[
    {
        "filename": "an-1-14",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 46
            },
            {
                "type": "heading",
                "text": "14. එතදග්ගපාළි.",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 14. 1. 1 – 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "**(සාවත්ථිනිදානං:)**"
            },
            {
                "type": "paragraph",
                "text": "එතදග්ගං භික්ඛවෙ මම සාවකානං භික්ඛූනං රත්තඤ්ඤෑනං යදිදං අඤ්ඤාකොණ්ඩඤ්ඤො{1 අඤ්ඤාසිකොණ්ඩඤ්ඤො - මඡසං. අඤ්ඤාතකොණ්ඩඤ්ඤොති - කත්ථචි.} -පෙ-මහාපඤ්ඤානං යදිදං සාරිපුත්තො, -පෙ- ඉද්ධිමන්තානං යදිදං මහාමොග්ගල්ලානො, -පෙ- ධුතවාදානං යදිදං මහාකස්සපො, -පෙ- දිබ්බචක්ඛුකානං යදිදං අනුරුද්ධො, -පෙ- උච්චාකුලිකානං යදිදං භද්දියො කාළිගොධායපුත්තො, -පෙ- මඤ්ජුස්සරානං යදිදං ලකුණ්ටකභද්දියො, -පෙ- සීහනාදිකානං යදිදං පිණ්ඩොලභාරද්වාජො, -පෙ- ධම්මකථිකානං යදිදං පුණ්ණො මන්තාණිපුත්තො, -පෙ- සංඛිත්තෙන භාසිතස්ස විත්ථාරෙන අත්ථං විභජන්තානං යදිදං මහාකච්චානොති."
            },
            {
                "type": "centered",
                "text": "වග්ගො පඨමො.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "1. 14. 2. 1 – 11.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එතදග්ගං භික්ඛවෙ මම සාවකානං භික්ඛූනං මනොමයං කායං අභිනිම්මිණන්තානං යදිදං චුල්ලපන්ථකො{2 චූලපන්ථකො - මඡසං.}, චෙතොවිවට්ටකුසලානං යදිදං චුල්ලපන්ථකො, -පෙ- සඤ්ඤාවිවට්ටකුසලානං යදිදං මහාපන්ථකො, -පෙ- අරණවිහාරීනං යදිදං සුභූති, -පෙ- දක්ඛිණෙය්යානං යදිදං සුභූති, -පෙ- ආරඤ්ඤකානං යදිදං රෙවතො ඛදිරවනියො, -පෙ- ඣායීනං යදිදං කඞ්ඛාරෙවතො, -පෙ- ආරද්ධවිරියානං යදිදං සොණො කොළිවීසො, -පෙ- කල්යාණවාක්කරණානං යදිදං සොණො කුටිකණ්ණො, -පෙ- ලාභීනං යදිදං සීවලී, -පෙ- සද්ධාධිමුත්තානං යදිදං වක්කලීති."
            },
            {
                "type": "centered",
                "text": "වග්ගො දුතියො.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "48"
            },
            {
                "type": "heading",
                "text": "1. 14. 3. 1 - 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එතදග්ගං භික්ඛවෙ මම සාවකානං භික්ඛූනං සික්ඛාකාමානං යදිදං රාහුලො.-පෙ- සද්ධාපබ්බජිතානං යදිදං රට්ඨපාලො, -පෙ- පඨමං සලාකං ගණ්හන්තානං යදිදං කුණ්ඩධානො, -පෙ- පටිභානවන්තානං යදිදං වඞ්ගීසො, -පෙ- සමන්තපාසාදිකානං යදිදං උපසෙනො වඞ්ගන්තපුත්තො, -පෙ- සෙනාසනපඤ්ඤාපකානං යදිදං දබ්බො මල්ලපුත්තො -පෙ- දෙවතානං පියමනාපානං යදිදං පිළින්දිවච්ඡො,{1 පිලින්දවච්ඡො - මඡසං.} -පෙ- ඛිප්පාභිඤ්ඤානං යදිදං බාහියො දාරුචීරියො, -පෙ- චිත්තකථිකානං යදිදං කුමාරකස්සපො, -පෙ- පටිසම්භිදාපත්තානං යදිදං මහාකොට්ඨිතොති."
            },
            {
                "type": "centered",
                "text": "වග්ගො තතියො.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "1. 14. 4. 1 – 16.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එතදග්ගං භික්ඛවෙ මම සාවකානං භික්ඛූනං බහුස්සුතානං යදිදං ආනන්දො, -පෙ- සතිමන්තානං යදිදං ආනන්දො, -පෙ- ගතිමන්තානං යදිදං ආනන්දො, -පෙ- ධිතිමන්තානං යදිදං ආනන්දො, -පෙ- උපට්ඨාකානං යදිදං ආනන්දො, -පෙ- මහාපරිසානං යදිදං උරුවෙලකස්සපො, -පෙ- කුලප්පසාදකානං යදිදං කාළුදායී, -පෙ-අප්පාබාධානං යදිදං බක්කුලො{2 බාකුලො - මඡසං.}, -පෙ- පුබ්බෙනිවාසං අනුස්සරන්තානං යදිදං සොභිතො, -පෙ- විනයධරානං යදිදං උපාලි, -පෙ- භික්ඛුනොවාදකානං යදිදං නන්දකො, -පෙ- ඉන්ද්රියෙසු ගුත්තද්වාරානං යදිදං නන්දො, -පෙ- භික්ඛුඔවාදකානං යදිදං මහාකප්පිනො, -පෙ- තෙජොධාතුකුසලානං යදිදං සාගතො, -පෙ- පටිභානෙය්යකානං යදිදං රාධො, -පෙ- ලූඛචීවරධරානං යදිදං මොඝරාජාති."
            },
            {
                "type": "centered",
                "text": "වග්ගො චතුත්ථො.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "50"
            },
            {
                "type": "heading",
                "text": "1. 14. 5. 1 – 13.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එතදග්ගං භික්ඛවෙ මම සාවිකානං භික්ඛුනීනං රත්තඤ්ඤූනං යදිදං මහාපජාපතීගොතමී, -පෙ- මහාපඤ්ඤානං යදිදං ඛෙමා, -පෙ- ඉද්ධිමන්තීනං යදිදං උප්පලවණ්ණා, -පෙ- විනයධරානං යදිදං පටාචාරා, -පෙ- ධම්මකථිකානං යදිදං ධම්මදින්නා, -පෙ- ඣායීනං යදිදං නන්දා, -පෙ- ආරද්ධවිරියානං යදිදං සොණා, -පෙ- දිබ්බචක්ඛුකානං යදිදං සකුලා,{1 බකුලා - මඡසං.} -පෙ- ඛිප්පාභිඤ්ඤානං යදිදං භද්දා කුණ්ඩලකෙසා, -පෙ- පුබ්බෙනිවාසං අනුස්සරන්තීනං යදිදං භද්දාකාපිලානී, -පෙ- මහාභිඤ්ඤප්පත්තානං යදිදං භද්දකච්චානා, -පෙ- ලූඛචීවරධරානං යදිදං කිසාගොතමී, -පෙ- සද්ධාධිමුත්තානං යදිදං සිගාලමාතාති.{2 සිගාලකමාතා - මඡසං.}"
            },
            {
                "type": "centered",
                "text": "වග්ගො පඤ්චමො.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "1. 14. 6. 1 – 10.",
                "level": 1
            },
            {
                "type": "paragraph",
                "text": "එතදග්ගං භික්ඛවෙ මම සාවකානං උපාසකානං පඨමං සරණං ගච්ඡන්තානං යදිදං තපුස්සභල්ලිකා{3 තපස්සුභල්ලිකා - ස්යා. PTS.} වාණිජා, -පෙ- දායකානං යදිදං සුදත්තො ගහපති අනාථපිණ්ඩිකො, -පෙ- ධම්මකථිකානං යදිදං චිත්තො ගහපති මච්ඡිකාසණ්ඩිකො, -පෙ- චතූහි සඞ්ගහවත්ථූහි පරිසං සඞ්ගණ්හන්තානං යදිදං හත්ථකො ආලවකො, -පෙ- පණීතදායකානං යදිදං මහානාමො සක්කො, -පෙ- මනාපදායකානං යදිදං උග්ගො ගහපති වෙසාලිකො, -පෙ- සඞ්ඝුපට්ඨාකානං යදිදං උග්ගතො{4 හත්ථිගාමකො උග්ගො ගහපති - මඡසං.} ගහපති, -පෙ- අවෙච්චප්පසන්නානං යදිදං සූරො අම්බට්ඨො{5 සූරබන්ධො - මඡසං.} , -පෙ- පුග්ගලප්පසන්නානං යදිදං ජීවකො කොමාරභච්චො, -පෙ- විස්සාසකානං යදිදං නකුලපිතා ගහපතීති."
            },
            {
                "type": "centered",
                "text": "වග්ගො ඡට්ඨො.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "52"
            },
            {
                "type": "heading",
                "text": "1. 14. 7. 1 – 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එතදග්ගං භික්ඛවෙ මම සාවිකානං උපාසිකානං පඨමං සරණං ගච්ඡන්තීනං යදිදං සුජාතා සෙනානීධීතා,{1 සෙනියධීතා - මඡසං.} දායිකානං යදිදං විසාඛා මිගාරමාතා, බහුස්සුතානං යදිදං ඛුජ්ජුත්තරා, මෙත්තාවිහාරීනං යදිදං සාමාවතී, ඣායීනං යදිදං උත්තරා නන්දමාතා, පණීතදායිකානං යදිදං සුප්පවාසා කොලියධීතා, ගිලානුපට්ඨාකීනං යදිදං සුප්පියා උපාසිකා, අවෙච්චප්පසන්නානං යදිදං කාතියානී, විස්සාසිකානං යදිදං නකුලමාතා ගහපතානී, අනුස්සවප්පසන්නානං යදිදං කාළී උපාසිකා කුරරඝරිකාති.{2 කුලඝරිකා - මඡසං.}"
            },
            {
                "type": "centered",
                "text": "වග්ගො සත්තමො.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 47
            },
            {
                "text": "14. එතදග්ග පාළිය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 14. 1 - 10.",
                "level": "1"
            },
            {
                "text": "**[සැවැත් නිදානයි:]**",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් අඤ්ඤාකොණ්ඩඤ්ඤ නම් මහණෙක් වේ ද, චිරරාත්‍රඥ වූ මාගේ ශ්‍රාවක භික්ෂූන් අතුරෙහි මෙ අග්‍ර වෙයි. … යම් ශාරීපුත්‍ර නම් මහණෙක් වේ ද, මහාප්‍රඥ වූ මාගේ ශ්‍රාවකයන් අතුරෙහි … යම් මහා මෞද්ගල්‍යායන නම් මහණෙක් වේ ද, ඍද්ධිමතුන් අතුරෙහි … යම් මහාකාශ්‍යප නම් මහණෙක් වේ ද, ධුතවාද ඇත්තවුන් අතුරෙහි … යම් අනුරුද්ධ නම් මහණෙක් වේ ද, දිවැස් ඇතියන් අතුරෙහි … කාළිගොධාවගේ පුත් යම් භද්දිය නම් මහණෙක් වේ ද, උසස් කුලයෙහි උපනුවන් අතුරෙහි … යම් ලකුණ්ටක භද්දිය නම් මහණෙක් වේ ද, මිහිරි කටහඬ ඇතියන් අතුරෙහි … යම් පිණ්ඩෝලභාරද්වාජ නම් මහණෙක් වේ ද, සිංහනාද කරනුවන් අතුරෙහි … යම් මන්තාණි බැමිණියගේ පුත් පුණ්ණ නම් මහණෙක් වේ ද, ධර්මකථිකයන් අතුරෙහි … යම් මහාකච්චාන නම් මහණෙක් වේ ද, සැකෙවින් කියූ දැයෙහි අරුත් විතරින් බෙදා දක්වන මාගේ ශ්‍රාවක භික්ෂූන් අතුරෙහි මේ අග්‍ර වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "පළමුවන වග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "1. 14. 2. 1 - 11.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් චුල්ලපන්ථක නම් මහණෙක් වේ ද, මනෝමය කය මවන මාගේ ශ්‍රාවක භික්ෂූන් අතුරෙහි මේ අග්‍ර වෙයි. … යම් චුල්ලපන්ථක නම් මහණෙක් වේ ද, චෙතොවිවට්ට (රූපධ්‍යාන) යෙහි දක්ෂ වූ භික්ෂූන් අතුරෙහි … යම් මහාපන්ථක නම් මහණෙක් වේ ද, සඤ්ඤාවිවට්ට (අරූපධ්‍යාන) යෙහි දක්ෂ වූ භික්ෂූන් අතුරෙහි … යම් සුභූති නම් මහණෙක් වේ ද, කෙලෙස් රහිත විහරණ ඇතියන් අතුරෙහි … යම් සුභූති නම් මහණෙක් වේ ද, දක්ෂිණාහර්යයන් අතුරෙහි … කිහිරිවන වැසි යම් රේවත නම් මහණෙක් වේ ද, අරණ්‍යවාසී මාගේ ශ්‍රාවක භික්ෂූන් අතුරෙහි … යම් කඞ්ඛාරේවත නම් මහණෙක් වේ ද, ධ්‍යානයෙහි ඇලුනවුන් අතුරෙහි … කොළිවීස ගෝත්‍රයෙහි උපන් යම් සෝණ නම් මහණෙක් වේ ද, පිරිපුන් වැර ඇති භික්ෂූන් අතුරෙහි … යම් කූටිකණ්ණසෝණ නම් මහණෙක් වේ ද, කලණ බස් තෙපලනුවන් අතුරෙහි … යම් සීවලී නම් මහණෙක් වේ ද, සිවුපසය ලබනුවන් අතුරෙහි … යම් වක්කලි නම් මහණෙක් වේ ද, බලවත් සැදැහැ ඇති මාගේ ශ්‍රාවක භික්ෂූන් අතුරෙන් මේ අග්‍ර වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "දෙවැනි වග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "49"
            },
            {
                "type": "heading",
                "text": "1. 14. 3. 1 - 10.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් රාහුල නම් මහණෙක් වේ ද, මාගේ ශ්‍රාවක වූ සිඛ කැමැති භික්ෂූන් අතුරෙහි මේ අග්‍ර වේ … යම් රට්ඨපාල නම් මහණෙක් වේ ද, සැදැහැයෙන් පැවිදි වූ මාගේ ශ්‍රාවක භික්ෂූන් අතුරෙහි … යම් කුණ්ඩධාන නම් මහණෙක් වේ ද, පෙරට ව ලහගන්නා මාගේ ශ්‍රාවක වූ මහණුන් අතුරෙහි … යම් වඞ්ගීස නම් මහණෙක් වේ ද, පිරිපුන් වැටහීම් ඇති මාගේ ශ්‍රාවක භික්ෂූන් අතුරෙහි … වඞ්ගන්ත බ්‍රාහ්මණයාගේ පුත්‍ර වූ යම් උපසේන නම් මහණෙක් වේ ද, පැහැදීම එළවන මාගේ ශ්‍රාවක වූ මහණුන් අතුරෙහි … මල්ලරාජපුත්‍ර වූ යම් දබ්බ නම් මහණෙක් වේ ද, සෙනසුන් පණවන මාගේ ශ්‍රාවක වූ භික්ෂූන් අතුරෙහි … යම් පිළින්දිවච්ඡ නම් මහණෙක් වේ ද, දෙවියනට ප්‍රියමනාප වූ මාගේ ශ්‍රාවක වූ මහණුන් අතුරෙහි … යම් දාරුචීරිය බාහිය නම් මහණෙක් වේ ද, වහා ලත් අභිඥා ඇති මාගේ ශ්‍රාවක වූ මහණුන් අතුරෙහි … යම් කුමාරකාශ්‍යප නම් මහණෙක් වේ ද, විසිතුරු ධර්මකථා ඇති මාගේ ශ්‍රාවක වූ මහණුන් අතුරෙහි … යම් මහාකොට්ඨිත නම් මහණෙක් වේ ද, පිළිසැඹියා ලත් මාගේ ශ්‍රාවක වූ මහණුන් අතුරෙහි මේ අග්‍ර වේ.",
                "type": "paragraph"
            },
            {
                "text": "තුන්වැනි වග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "1. 14. 4. 1 - 16.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් ආනන්ද නම් මහණෙක් වේ ද, බොහෝ ඇසූ පිරූ තැන ඇති මාගේ සවු මහණුන් අතුරෙහි මේ අග්‍ර වෙයි, … යම් ආනන්ද නම් මහණෙක් වේ ද … ධාරණස්මෘති ඇති මහණුන් අතුරෙහි … ප්‍රඥාගති ඇති … ධෘතිමත් වූ … උපස්ථායක වූ මාගේ සවු මහණුන් අතුරෙහි මේ අග්‍ර වෙයි. … යම් උරුවෙලකස්සප නම් මහණෙක් වේ ද, මහපිරිස් ඇති මාගේ සවු මහණුන් අතුරෙහි … යම් කාළුදායී නම් මහණෙක් වේ ද, කුල පහදවන මාගේ සවු මහණුන් අතුරෙහි … යම් බක්කුල නම් මහණෙක් වේ ද, නීරෝග වූ මාගේ සවු මහණුන් අතුරෙහි … යම් සෝභිත නම් මහණෙක් වේ ද, පෙර විසූ කඳපිළිවෙළ සිහි කරණ මාගේ සවු මහණුන් අතුරෙහි … යම් නන්ද නම් මහණෙක් වේ ද, ඉඳුරන් කෙරෙහි වැසූ දොර ඇති මාගේ සවු මහණුන් අතුරෙහි … යම් මහාකප්පින නම් මහණෙක් වේ ද, භික්ෂූන්ට අවවාද කරණ මාගේ සවු මහණුන් අතුරෙහි … යම් සාගත නම් මහණෙක් වේ ද, තේජෝධාතු සමාපත්තියට සමවැදීමෙහි දක්‍ෂ වූ මාගේ සවු මහණුන් අතුරෙහි … යම් රාධ නම් මහණෙක් වේ ද, ධර්මදේශනා ප්‍රතිභානයට ප්‍රත්‍යය වන කථා ඇති මාගේ සවු මහණුන් අතුරෙහි … යම් මෝඝරාජ නම් මහණෙක් වේ ද, රූක්‍ෂචීවර දරන මාගේ සවු මහණුන් අතුරෙහි මේ අග්‍ර වේ.",
                "type": "paragraph"
            },
            {
                "text": "සතරවන වග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "51"
            },
            {
                "type": "heading",
                "text": "1. 14. 5. 1 - 13.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් මහාප්‍රජාපති ගෝතමී නම් මෙහෙණක් ඇද්ද, චිරරාත්‍රඥ වූ මාගේ ශ්‍රාවිකා මෙහෙණන් අතුරෙහි තුලු අග්‍ර වේ. … යම් ඛේමා නම් මෙහෙණක් ඇද්ද, මාගේ ශ්‍රාවිකා වූ මහාප්‍රඥා ඇති මෙහෙණන් අතුරෙහි … යම් උප්පලවණ්ණා නම් මෙහෙණක් ඇද්ද, මාගේ ශ්‍රාවිකා වූ ඍද්ධි ඇති මෙහෙණන් අතුරෙහි … යම් පටාචාරා නම් මෙහෙණක් ඇද්ද, මාගේ ශ්‍රාවිකා වූ විනයධර මෙහෙණන් අතුරෙහි … යම් ධම්මදින්නා නම් මෙහෙණක් ඇද්ද, මාගේ ශ්‍රාවිකා වූ ධර්ම කථික මෙහෙණන් අතුරෙහි … යම් නන්දා නම් මෙහෙණක් ඇද්ද, ධ්‍යානයෙහි ඇලුනු මාගේ ශ්‍රාවිකා වූ මෙහෙණන් අතුරෙහි … යම් සෝණා නම් මෙහෙණක් ඇද්ද, මාගේ ශ්‍රාවිකා වූ සම්පූර්ණ කරණ ලද වීර්යය ඇති මෙහෙණන් අතුරෙහි .. යම් සකුලා නම් මෙහෙණක් ඇද්ද, දිවැස් ඇති මාගේ ශ්‍රාවිකා වූ මෙහෙණන් අතුරෙහි … යම් භද්දා කුණ්ඩලකේසී නම් මෙහෙණක් ඇද්ද, ක්ෂිප්‍රාභිඥා වූ මාගේ ශ්‍රාවිකා වූ මෙහෙණන් අතුරෙහි … යම් භද්දා කාපිලානී නම් මෙහෙණක් ඇද්ද, පෙර විසූ කඳපිළිවෙලින් සිහි කරණ මාගේ ශ්‍රාවිකා මෙහෙණන් අතුරෙහි … යම් භද්දකච්චානා නම් මෙහෙණක් ඇද්ද, මහා අභිඥා ලද මාගේ ශ්‍රාවිකා වූ මෙහෙණන් අතුරෙහි … යම් කිසාගෝතමී නම් මෙහෙණක් ඇද්ද, රූක්‍ෂ චීවර දරණ මාගේ ශ්‍රාවිකා වූ මෙහෙණන් අතුරෙහි … යම් සිගාලමාතු නම් මෙහෙණක් ඇද්ද, ශ්‍රද්ධාලක්ෂණයෙහි බැස ගත් මාගේ ශ්‍රාවිකා වූ මෙහෙණන් අතුරෙහි තුලු අග්‍ර වේ.",
                "type": "paragraph"
            },
            {
                "text": "පස්වන වග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "1. 14. 6. 1 - 10.",
                "level": 1
            },
            {
                "text": "මහණෙනි, යම් තපුස්ස ය භල්ලික ය යන වෙණෙදහු දෙදෙනෙක් වෙත් ද, හැමට පළමු ව සරණ යන මාගේ ශ්‍රාවක වූ උපාසකයන් අතුරෙහි තෙලහු අග්‍ර වෙත්. … යම් අනාථපිණ්ඩික සුදත්ත නම් වූ ගෘහපතියෙක් වේ ද, දායක වූ මාගේ ශ්‍රාවක උපාසකයන් අතුරෙහි … යම් මච්ඡිකාසණ්ඩ පුරවාසී චිත්ත නම් ගෘහපතියෙක් වේ ද, ධර්මකථික වූ මාගේ ශ්‍රාවක උපාසකයන් අතුරෙහි … යම් හත්ථක ආලවක නම් රජෙක් වේ ද, සිවුසඟරාවතින් පිරිස් සගන්නා මාගේ ශ්‍රාවක උපාසකයන් අතුරෙහි … යම් මහානාම නම් ශාක්‍යයෙක් වේ ද, ප්‍රණීත ප්‍රත්‍යය දෙන මාගේ ශ්‍රාවක උපාසකයන් අතුරෙහි … යම් විසල්පුර වැසි උග්ග නම් ගැහැවියෙක් වේ ද, මනාප දෑ දෙන මාගේ ශ්‍රාවක උපාසකයන් අතුරෙහි … යම් උග්ගත නම් ගැහැවියෙක් වේ ද, සඞ්ඝෝපස්ථායක වූ මාගේ ශ්‍රාවක උපාසකයන් අතුරෙහි … යම් සූරම්බට්ඨ නම් සිටුවරයෙක් වේ ද, අචලප්‍රසාදයෙන් සමන්විත වූ මාගේ ශ්‍රාවක උපාසකයන් අතුරෙහි … යම් ජීවක කොමාරභච්ච නම් උපාසකයෙක් වේ ද, පෞද්ගලික ප්‍රසාදයෙන් සමන්විත වූ මාගේ ශ්‍රාවක උපාසකයන් අතුරෙහි … යම් නකුලපිතු නම් ගැහැවියෙක් වේ ද, විශ්වාස කථා ඇති මාගේ ශ්‍රාවක වූ උපාසකයන් අතුරෙන් තෙල අග්‍ර වේ.",
                "type": "paragraph"
            },
            {
                "text": "සවැනි වගයි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "53"
            },
            {
                "type": "heading",
                "text": "1. 14. 7. 1 - 10.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් සේනානීධිතු සුජාතා නම් උපාසිකාවක් ඇද්ද, සියල්ලන්ට පළමු ව සරණයෙහි පිහිටි මාගේ ශ්‍රාවිකා උපාසිකාවන් අතුරෙහි තුලු අග්‍ර වේ. … යම් මිගාරමාතු විසඛා නම් උපාසිකාවක් ඇද්ද, දීමෙහි ඇලුනු මාගේ ශ්‍රාවිකා උපාසිකාවන් අතුරෙහි … යම් බුජ්ජුත්තරා නම් උපාසිකාවක් ඇද්ද, බහුශ්‍රැත වූ මාගේ ශ්‍රාවිකා උපාසිකාවන් අතුරෙහි … යම් සාමාවතී නම් උපාසිකාවක් ඇද්ද, මෛත්‍රීවිහරණ ඇති මාගේ ශ්‍රාවිකා උවැසියන් අතුරෙහි … යම් උත්තරා නන්දමාතු නම් උපාසිකාවක් ඇද්ද, ධ්‍යානයෙහි අභිරත වූ මාගේ ශ්‍රාවිකා උවැසියන් අතුරෙහි … යම් කොලියධීතු සුප්පාවාසා නම් උපාසිකාවක් ඇද්ද, ප්‍රණීත රසදායිකා වූ මාගේ ශ්‍රාවිකා උවැසියන් අතුරෙහි … යම් සුප්පියා නම් උපාසිකාවක් ඇද්ද, ග්ලානොපස්ථායිකා වූ මාගේ ශ්‍රාවිකා උවැසියන් අතුරෙහි … යම් කාතියානි නම් උපාසිකාවක් ඇද්ද, අවෙත්‍යප්‍රසාදයෙන් සමන්විත මාගේ ශ්‍රාවිකා වූ උවැසියන් අතුරෙහි … යම් නකුලමාතු ගහපතානී නම් උපාසිකාවක් ඇද්ද, විශ්වාස කථා ඇති මාගේ ශ්‍රාවිකා වූ උවැසියන් අතුරෙහි … යම් කුරරඝර වැසි කාළි නම් උපාසිකාවක් ඇද්ද, අනුශ්‍රවයෙන් උපන් ප්‍රසාද ඇති මාගේ ශ්‍රාවිකා වූ උපාසිකාවන් අතුරෙහි තුලු අග්‍ර වේ.",
                "type": "paragraph"
            },
            {
                "text": "සත්වැනි වග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-1-14"
    }
]