[
    {
        "filename": "an-1-4",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 12
            },
            {
                "type": "heading",
                "text": "4. අදන්තවග්ගො ",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 4. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං අදන්තං මහතො අනත්ථාය සංවත්තති. යථයිදං චිත්තං. චිත්තං භික්ඛවෙ අදන්තං මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 4. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං දන්තං මහතො අත්ථාය සංවත්තති, යථයිදං චිත්තං. චිත්තං භික්ඛවෙ දන්තං මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 4. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං අගුත්තං මහතො අනත්ථාය සංවත්තති, යථයිදං චිත්තං. චිත්තං භික්ඛවෙ අගුත්තං මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 4. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං ගුත්තං මහතො අත්ථාය සංවත්තති, යථයිදං චිත්තං. චිත්තං භික්ඛවෙ ගුත්තං මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "page-break",
                "text": "14"
            },
            {
                "type": "heading",
                "text": "1. 4. 5.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං අරක්ඛිතං මහතො අනත්ථාය සංවත්තති, යථයිදං චිත්තං. චිත්තං භික්ඛවෙ අරක්ඛිතං මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 4. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි යං එවං රක්ඛිතං මහතො අත්ථාය සංවත්තති, යථයිදං චිත්තං. චිත්තං භික්ඛවෙ රක්ඛිතං මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 4. 7.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං අසංවුතං මහතො අනත්ථාය සංවත්තති, යථයිදං චිත්තං. චිත්තං භික්ඛවෙ අසංවුතං මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 4. 8.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං සංවුතං මහතො අත්ථාය සංවත්තති, යථයිදං චිත්තං. චිත්තං භික්ඛවෙ සංවුතං මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 4. 9.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං අදන්තං අගුත්තං අරක්ඛිතං අසංවුතං මහතො අනත්ථාය සංවත්තති, යථයිදං චිත්තං. චිත්තං භික්ඛවෙ අදන්තං අගුත්තං අරක්ඛිතං අසංවුතං මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 4. 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං දන්තං ගුත්තං රක්ඛිතං සංවුතං මහතො අත්ථාය සංවත්තති, යථයිදං චිත්තං. චිත්තං භික්ඛවෙ දන්තං ගුත්තං රක්ඛිතං සංවුතං මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "centered",
                "text": "වග්ගො චතුත්ථො.{1 අදන්ත වග්ගො චතුත්ථො - මඡසං.}",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 13
            },
            {
                "text": "4. අදන්ත වර්ගය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 4. 1.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ නොදැමුනේ මහත් වූ අනර්ථය පිණිස පවත්නේ නම්, සිත් බඳු අන් එක ධර්මයකුදු  මම (නුවණැසින්) නො දක්මි. මහණෙනි, නොදැමුනු සිත මහත් වූ අනර්ථය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 4. 2.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ දැමුනේ මහත් වූ අර්ථය පිණිස පවත්නේ නම්, සිත බඳු අන් එක ධර්මයකුදු මම  (නුවණැසින්) නො දක්මි. මහණෙනි, දැමුනු සිත මහත් අර්ථය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 4. 3.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ (සතිසංවරයෙන්) ගෝපනය නොකරණ ලද්දේ මහත් වූ අනර්ථය පිණිස පවත්නේ  නම්, සිත බඳු අන් එක ධර්මයකුදු මම (නුවණැසින්) නො දක්මි. මහණෙනි, අගෝපිත වූ සිත මහත් වූ අනර්ථය  පිණිස පවත්නේ ය.  ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 4. 4.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ ගෝපනය කරණ ලද්දේ මහත් වූ අර්ථය පිණිස පවත්නේ නම්, සිත බඳු අන් එක  ධර්මයකුදු මම (නුවණැසින්) නො දක්මි. මහණෙනි, ගෝපිත වූ සිත මහත් අර්ථය පිණිස පවත්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "15"
            },
            {
                "type": "heading",
                "text": "1. 4. 5.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ නොරක්නා ලද්දේ මහත් වූ අනර්ථය පිණිස පවත්නේ නම්, සිත බඳු අන් එක  ධර්මයකුදු මම (නුවණැසින්) නො දක්මි. මහණෙනි, නොරැකුනු සිත මහත් වූ අනර්ථය පිණිස පවත්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 4. 6.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ රක්නා ලද්දේ මහත් වූ අර්ථය පිණිස පවත්නේ නම්, සිත බඳු අන් එක ධර්මයකුදු මම  (නුවණැසින්) නො දක්මි. මහණෙනි, රැකුනු සිත මහත් වූ අර්ථය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 4. 7.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ සංවර නොකරණ ලද්දේ මහත් වූ අනර්ථය පිණිස පවත්නේ නම්, සිත බඳු අන් එක  ධර්මයකුදු මම (නුවණැසින්) නො දක්මි. මහණෙනි, සංවර රහිත සිත මහත් වූ අනර්ථය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 4. 8.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ සංවර කරණ ලද්දේ මහත් අර්ථය පිණිස පවත්නේ නම්, සිත බඳු අන් එක ධර්මයකුදු  මම (නුවණැසින්) නො දක්මි. මහණෙනි, සංවර කළ සිත මහත් වූ අර්ථය පිණිස පවත්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 4. 9.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ නොදැමුනේ ගෝපනය නොකරණ ලද්දේ සංවර නොකරණ ලද්දේ මහත් වූ  අනර්ථය පිණිස පවත්නේ නම්, සිත බඳු අන් එක ධර්මයකුදු මම (නුවණැසින්) නො දක්මි. මහණෙනි, නොදැමුනු ගෝපනය නොකළ නොරැකි සංවර රහිත සිත මහත් වූ අනර්ථය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 4. 10.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ දැමුනේ ගෝපනය කරණ ලද්දේ රක්නා ලද්දේ සංවර කරණ ලද්දේ මහත් වූ අර්ථය  පිණිස පවත්නේ නම්, සිත බඳු අන් එක ධර්මයකුදු මම (නුවණැසින්) නො දක්මි. මහණෙනි, දාන්ත වූ ගුප්ත වූ  රක්ෂිත වූ සංවෘත වූ සිත මහත් වූ අර්ථය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "text": "සිවුවන වග යි.  ",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-1-4"
    }
]