[
    {
        "filename": "an-1-20",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 92
            },
            {
                "type": "heading",
                "text": "[ අමතවග්ගො ]",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 16. 8. 1 – 8.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙ භික්ඛවෙ න පරිභුඤ්ජන්ති, යෙ කායගතාසතිං න පරිභුඤ්ජන්ති."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙ භික්ඛවෙ පරිභුඤ්ජන්ති, යෙ කායගතාසතිං පරිභුඤ්ජන්ති."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ අපරිභුත්තං, යෙසං කායගතාසති අපරිභුත්තා."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ පරිභුත්තං, යෙසං කායගතාසති පරිභුත්තාති."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ පරිහීනං, යෙසං කායගතාසති පරිහීනා."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ අපරිහීනං, යෙසං කායගතාසති අපරිහීනා."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ විරද්ධං, යෙසං කායගතාසති විරද්ධා."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ ආරද්ධං, යෙසං කායගතාසති ආරද්ධා."
            },
            {
                "type": "page-break",
                "text": "94"
            },
            {
                "type": "heading",
                "text": "1. 16. 8. 9 – 24.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙ භික්ඛවෙ පමාදිංසු, යෙ කායගතාසතිං පමාදිංසු."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙ භික්ඛවෙ නප්පමාදිංසු, යෙ කායගතාසතිං නප්පමාදිංසු."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ පම්මුට්ඨං, යෙසං කායගතාසති පම්මුට්ඨා."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ අපම්මුට්ඨං, යෙසං කායගතාසති අපම්මුට්ඨාති."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ අනාසෙවිතං, යෙසං කායගතාසති අනාසෙවිතා."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ ආසෙවිතං, යෙසං කායගතාසති ආසෙවිතා."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ අභාවිතං, යෙසං කායගතාසති අභාවිතා."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ භාවිතං, යෙසං කායගතාසති භාවිතා."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ අබහුලීකතං, යෙසං කායගතාසති අබහුලීකතා."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ බහුලීකතං, යෙසං කායගතාසති බහුලීකතා."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ අනභිඤ්ඤාතං, යෙසං කායගතාසති අනභිඤ්ඤාතා."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ අභිඤ්ඤාතං, යෙසං කායගතාසති අභිඤ්ඤාතා."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ අපරිඤ්ඤාතං, යෙසං කායගතාසති අපරිඤ්ඤාතා."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ පරිඤ්ඤාතං, යෙසං කායගතාසති පරිඤ්ඤාතා."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ අසච්ඡිකතං, යෙසං කායගතාසති අසච්ඡිකතා."
            },
            {
                "type": "paragraph",
                "text": "අමතං තෙසං භික්ඛවෙ සච්ඡිකතං, යෙසං කායගතාසති සච්ඡිකතාති."
            },
            {
                "type": "centered",
                "text": "[ අමත ] වග්ගො අට්ඨමො.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "එකකනිපාතස්ස සුත්තසහස්සං*{1 වීමංසිතබ්බං.} සමත්තං.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 93
            },
            {
                "text": "[ අමෘත වර්ගය ]",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 16. 8. 1 - 8.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් කෙනෙක් අමෘතසදෘශ කායගතාසතිය පරිභොග ධ්‍යාන-සමාපජ්ජනයෙන් නො කෙරෙද් ද, ඔහු අමෘත සඞ්ඛ්‍යාත නිර්වාණය නො වළඳත්.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනෙක් කායගතාසතිය පරිභොග කෙරෙත් ද, ඔහු අමෘතය වළඳත්.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුන් විසින් කායගතාසතිය නො වළඳන ලදු ද, ඔවුන් විසින් අමෘතය නො වළඳනා ලදී.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුන් විසින් කායගතාසතිය වළඳන ලදු ද, ඔවුන් විසින් අමෘතය වළඳනා ලදි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුන්ගේ කායගතාසතිය පිරිහුනු ද, ඔවුන්ගේ අමෘතය පිරිහින.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුන්ගේ කායගතාසතිය නො පිරිහුනු ද, ඔවුන්ගේ අමෘතය නො පිරිහින.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුන් විසින් කායගතාසතිය අනධිගමයෙන් වරදනා ලදු ද, ඔවුන් විසින් අමෘතය වරදනා ලදී.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුන් විසින් කායගතාසතිය සැපැයිනි ද, ඔවුන් විසින් අමෘතය නිෂ්පාදිත වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "95"
            },
            {
                "type": "heading",
                "text": "1. 16. 8. 9 - 24.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් කෙනෙක් කායගතාසතිය පමා කෙරෙත් ද, ඔහු අමෘතය පමා කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනෙක් කායගතාසතිය පමා නො කෙරෙත් ද, ඔහු අමෘතය පමා නො කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුනට කායගතාසතිය විස්මෘත ද, ඔවුන්ට අමෘතය විස්මෘත වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුනට කායගතාසතිය විස්මෘත නො වේ ද, ඔවුනට අමෘතය විස්මෘත නො වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුන් විසින් කායගතාසතිය නො සෙවුනා ලදු ද, ඔවුන් විසින් අමෘතය සෙවුනා ලද නො වෙයි. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුන් විසින් කායගතාසතිය සෙවුනා ලදු ද, ඔවුන් විසින් අමෘතය සෙවුනා ලද වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුන් විසින් කායගතාසතිය නො වඩනා ලදු ද, ඔවුන් විසින් අමෘතය වඩනා ලද නො වෙයි. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුන් විසින් කායගතාසතිය වඩන ලදු ද, ඔවුන් විසින් අමෘතය වඩන ලද වෙයි. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුන් විසින් කායගතාසතිය බහුල වශයෙන් පුරුදු නො කරණ ලදු ද, ඔවුන් විසින් අමෘතය පුරුදු කරණ ලද නො වෙයි. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුන් විසින් කායගතාසතිය බහුල වශයෙන් පුරුදු කරණ ලදු ද, ඔවුන් විසින් අමෘතය පුරුදු කරණ ලද වෙයි. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුන් විසින් කායගතාසතිය විශිෂ්ටඥානයෙන් නො දන්නා ලදු ද, ඔවුන් විසින් අමෘතය දන්නා ලද නො වෙයි. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුන් විසින් කායගතාසතිය දන්නා ලදු ද, ඔවුන් විසින් අමෘතය දන්නා ලද වෙයි. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුන් විසින් කායගතාසතිය (භූතපරිඥාවශයෙන්) පිරිසිඳ නොදන්නා ලදු ද, ඔවුන් විසින් අමෘතය පිරිසිඳ දන්නා ලද නො වෙයි. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුන් විසින් කායගතාසතිය පිරිසිඳ දන්නා ලදු ද, ඔවුන් විසින් අමෘතය පිරිසිඳ දන්නා ලද වෙයි. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුන් විසින් කායගතාසතිය පසක් නො කරණ ලදු ද, ඔවුන් විසින් අමෘතය පසක් කරණ ලද නො වෙයි. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කෙනකුන් විසින් කායගතාසතිය පසක් කරණ ලදු ද, ඔවුන් විසින් අමෘතය පසක් කරණ ලද වේ යි.",
                "type": "paragraph"
            },
            {
                "text": "අටවෙනි [ අමා ] වගයි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "ඒකක නිපාතයෙහි සුත්‍ර දහස* නිමි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-1-20"
    }
]