[
    {
        "filename": "an-1-6",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 20
            },
            {
                "type": "heading",
                "text": "6. පභස්සරවග්ගො",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 6. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "පභස්සරමිදං භික්ඛවෙ චිත්තං. තඤ්ච ඛො ආගන්තුකෙහි උපක්කිලෙසෙහි උපක්කිලිට්ඨං. තං අස්සුතවා පුථුජ්ජනො යථාභූතං නප්පජානාති. තස්මා අස්සුතවතො පුථුජ්ජනස්ස චිත්තභාවනා නත්ථීති වදාමීති."
            },
            {
                "type": "heading",
                "text": "1. 6. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "පභස්සරමිදං භික්ඛවෙ චිත්තං. තඤ්ච ඛො ආගන්තුකෙහි උපක්කිලෙසෙහි විප්පමුත්තං. තං සුතවා අරියසාවකො යථාභූතං පජානාති. තස්මා සුතවතො අරියසාවකස්ස චිත්තභාවනා අත්ථීති වදාමීති."
            },
            {
                "type": "heading",
                "text": "1. 6. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අච්ඡරාසඞ්ඝාතමත්තම්පි චෙ භික්ඛවෙ භික්ඛු මෙත්තං{1 මෙත්තචිත්තං - ස්යා. මෙත්තාචිත්තං - මඡසං.} චිත්තං ආසෙවති, අයං වුච්චති භික්ඛවෙ භික්ඛු අරිත්තජ්ඣානො විහරති, සත්ථුසාසනකරො ඔවාදපතිකරො අමොඝං රට්ඨපිණ්ඩං භුඤ්ජති. කො පන වාදො යෙ නං බහුලීකරොන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 6. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අච්ඡරාසඞ්ඝාතමත්තම්පි චෙ භික්ඛවෙ භික්ඛු මෙත්තං චිත්තං භාවෙති, අයං වුච්චති භික්ඛවෙ භික්ඛු අරිත්තජ්ඣානො විහරති සත්ථුසාසනකරො ඔවාදපතිකරො අමොඝං රට්ඨපිණ්ඩං භුඤ්ජති. කො පන වාදො යෙ නං බහුලීකරොන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 6. 5.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අච්ඡරාසඞ්ඝාතමත්තම්පි චෙ භික්ඛවෙ භික්ඛු මෙත්තං චිත්තං මනසි කරොති, අයං වුච්චති භික්ඛවෙ භික්ඛු අරිත්තජ්ඣානො විහරති, සත්ථුසාසනකරො ඔවාදපතිකරො අමොඝං රට්ඨපිණ්ඩං භුඤ්ජති. කො පන වාදො යෙ නං බහුලීකරොන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 6. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "යෙ කෙචි භික්ඛවෙ ධම්මා අකුසලා අකුසලභාගියා අකුසලපක්ඛිකා, සබ්බෙ තෙ මනොපුබ්බඞ්ගමා. මනො තෙසං ධම්මානං පඨමං උප්පජ්ජති, අන්වදෙව අකුසලා ධම්මාති."
            },
            {
                "type": "heading",
                "text": "1. 6. 7.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "යෙ කෙචි භික්ඛවෙ ධම්මා කුසලා කුසලභාගියා කුසලපක්ඛිකා, සබ්බෙ තෙ මනොපුබ්බඞ්ගමා. මනො තෙසං ධම්මානං පඨමං උප්පජ්ජති. අන්වදෙව කුසලා ධම්මාති."
            },
            {
                "type": "page-break",
                "text": "22"
            },
            {
                "type": "heading",
                "text": "1. 6. 8.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා අකුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා වා කුසලා ධම්මා පරිහායන්ති, යථයිදං භික්ඛවෙ පමාදො. පමත්තස්ස භික්ඛවෙ අනුප්පන්නා චෙව අකුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච කුසලා ධම්මා පරිහායන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 6. 9.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා වා අකුසලා ධම්මා පරිහායන්ති, යථයිදං භික්ඛවෙ අප්පමාදො. අප්පමත්තස්ස භික්ඛවෙ අනුප්පන්නා චෙව කුසලා ධම්මා උප්පජ්ජන්ති උප්පන්නා ච අකුසලා ධම්මා පරිහායන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 6. 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා අකුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා වා කුසලා ධම්මා පරිහායන්ති, යථයිදං භික්ඛවෙ කොසජ්ජං. කුසීතස්ස භික්ඛවෙ අනුප්පන්නා චෙව අකුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච කුසලා ධම්මා පරිහායන්තීති."
            },
            {
                "type": "centered",
                "text": "වග්ගො ඡට්ඨො.{* අච්ඡරා සඞ්ඝාතවග්ගො ඡට්ඨො - මඡසං.}",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 21
            },
            {
                "text": "6. ප්‍රභාස්වර වර්ගය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 6. 1.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, මේ (භවාඞ්ග) සිත ප්‍රභාස්වර ය. එ ද වනාහි ආගන්තුක (ජවන්කෙණෙහි උපදනා රාගාදි) උපක්ලේශයන්ගෙන් කිලිටි වූයෙ ය. ශ්‍රැතරහිත පෘතග්ජන තෙමේ එය තත් වූ පරිද්දෙන් නො දනී. එහෙයින් ‘අශ්‍රැතවත් පෘතග්ජනයාහට චිත්තභාවනායෙක් නැතැ’යි කියමි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 6. 2.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, මේ (භවාඞ්ග) සිත ප්‍රභාස්වර ය. එ ද වනාහි ආගන්තුක උපක්ලේශයන්ගෙන් මිදින. එය ශ්‍රැතවත්  ආර්යශ්‍රාවක තෙමේ තත් වූ පරිද්දෙන් දනී. එහෙයින් ‘ශ්‍රැතවත් ආර්යශ්‍රාවකයාහට චිත්තභාවනාව ඇතැ’යි කියමි. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 6. 3.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ඉදින් මහණ අසුරුසනක් පමණකුදු මෙත් සිත සෙවුනේ නම්, මහණෙනි, මේ මහණ නොසිස් දැහැන් ඇත්තේ (ඊර්යාපථවිහරණයෙන්) වෙසේය යි කියනු ලැබේ. ශාස්තෲන් වහන්සේගේ අනුශාසනය කරන්නේ  අවවාදය පිළිපදනේ නොසිස් වූ රට්ඨපිණ්ඩය (රටින් ලත් පිණ්ඩපාතය) වළඳයි. යම් කෙනෙක් එය බහුල  වශයෙන් කෙරෙත් නම් (එහි ලා) කවර කථා ද? ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 6. 4.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ඉදින් මහණ අසුරුසනක් පමණකුදු මෙත් සිත වඩා නම්, මහණෙනි, මේ මහණ නොසිස් දැහැන්  ඇත්තේ වෙසෙය යි කියනු ලැබේ. ශාස්තෘශාසනය කරන්නේ අවවාදය පිළිපදනේ නොසිස් වූ රට්ඨපිණ්ඩය  (රටින් ලත් පිණ්ඩපාතය) වළඳයි. යම් කෙනෙක් එය බහුලවශයෙන් කෙරෙත් නම්, (එහි ලා) කවර කථා ද? ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 6. 5.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ඉදින් මහණ අසුරුසනක් පමණකුදු මෙත් සිත මෙනෙහි කෙරේ නම්, මහණෙනි, මේ මහණ  නොසිස් දැහැන් ඇත්තේ වෙසේය යි කියනු ලැබේ. ශාස්තෘශාසනය කරන්නේ අවවාදය පිළිපදනේ නොසිස් වූ  රට්ඨපිණ්ඩය (රටින් ලත් පිණ්ඩපාතය) වළඳයි. යම් කෙනෙක් එය බහුලවශයෙන් කෙරෙත් නම්, (එහි ලා) කවර කථා ද?",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 6. 6.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් ධර්ම කෙනෙක් අකුශල වෙත් ද, අකුශලභජනයෙහි, අකුශල පක්ෂයෙහි වැටෙත් ද, ඒහැම ධර්මයෝ සිත පෙරටු කොට ඇත. සිත ඒ ධර්මයනට පළමු උපදනේය. ඒ හා එක්වට ම අකුශලධර්මයෝ  උපදිත්. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 6. 7.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් කිසි ධර්ම කෙනෙක් කුශල වෙත් ද, කුශලභජනයෙහි, කුශලපක්ෂයෙහි වැටෙත් ද, ඒ සියලු  ධර්මයෝ සිත පෙරටු කොට ඇත. සිත ඒ ධර්මයනට පළමු උපදනේය. ඒ හා එක්වට ම කුශලධර්මයෝ උපදිත්.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "23"
            },
            {
                "type": "heading",
                "text": "1. 6. 8.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද අකුශලධර්මයෝ උපදිත් නම්, උපන්නා වූ ද  කුශලධර්මයෝ පිරිහෙත් නම්, මහණෙනි, ප්‍රමාදය වැනි අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, පමා වූ  පුඟුල්හට නූපන්නා වූ ද අකුශල ධර්මයෝ උපදිත්, උපන්නා වූ ද කුශල ධර්මයෝ පිරිහෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 6. 9.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද කුශලධර්මයෝ උපදිත් නම්, උපන්නා වූ ද  අකුශලධර්මයෝ පිරිහෙත් නම්, මහණෙනි, අප්‍රමාදය වැනි අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, නොපමා පුඟුල්හට නූපන්නා වූ ද කුශලධර්මයෝ උපදිත්, උපන්නා වූ ද අකුශල ධර්මයෝ පිරිහෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 6. 10.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද අකුශලධර්මයෝ උපදිත් නම්, උපන්නා වූ ද  කුශලධර්මයෝ පිරිහෙත් නම්, මහණෙනි, කුසීත බව වැනි අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, කුසීතයාහට නූපන්නා වූ ද අකුශලධර්මයෝ උපදිත්, උපන්නා වූ ද කුශල ධර්මයෝ පිරිහෙත්.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-1-6"
    }
]