[
    {
        "filename": "an-1-11",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 40
            },
            {
                "type": "heading",
                "text": "11. අධම්මවග්ගො",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 11. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "**(සාවත්ථිනිදානං:)**"
            },
            {
                "type": "paragraph",
                "text": "යෙ තෙ භික්ඛවෙ භික්ඛූ අධම්මං අධම්මොති දීපෙන්ති, තෙ භික්ඛවෙ භික්ඛූ බහුජනහිතාය පටිපන්නා බහුජනසුඛාය බහුනො ජනස්ස අත්ථාය හිතාය සුඛාය දෙවමනුස්සානං. බහුඤ්ච තෙ භික්ඛවෙ භික්ඛූ පුඤ්ඤං පසවන්ති. තෙවිමං{2 තෙපිමං - සීමු. තෙචිමං - ස්යා. මඡසං. PTS.} සද්ධම්මං ඨපෙන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 11. 2 – 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "යෙ තෙ භික්ඛවෙ භික්ඛූ ධම්මං ධම්මොති දීපෙන්ති -පෙ- අවිනයං අවිනයොති දීපෙන්ති -පෙ- විනයං විනයොති දීපෙන්ති -පෙ- අභාසිතං අලපිතං තථාගතෙන අභාසිතං අලපිතං තථාගතෙනාති දීපෙන්ති -පෙ- භාසිතං ලපිතං තථාගතෙන භාසිතං ලපිතං තථාගතෙනාති දීපෙන්ති -පෙ- අනාචිණ්ණං තථාගතෙන අනාචිණ්ණං තථාගතෙනාති දීපෙන්ති -පෙ- ආචිණ්ණං තථාගතෙන ආචිණ්ණං තථාගතෙනාති දීපෙන්ති -පෙ- අපඤ්ඤත්තං තථාගතෙන අපඤ්ඤත්තං තථාගතෙනාති දීපෙන්ති -පෙ- පඤ්ඤත්තං තථාගතෙන පඤ්ඤත්තං තථාගතෙනාති දීපෙන්ති, තෙ භික්ඛවෙ භික්ඛූ බහුජනහිතාය පටිපන්නා බහුජනසුඛාය බහුනො ජනස්ස අත්ථාය හිතාය සුඛාය දෙවමනුස්සානං. බහුඤ්ච තෙ භික්ඛවෙ භික්ඛූ පුඤ්ඤං පසවන්ති. තෙවිමං{3 තෙපිමං - සීමු. තෙචිමං - ස්යා. මඡසං. PTS.} සද්ධම්මං ඨපෙන්තීති."
            },
            {
                "type": "centered",
                "text": "වග්ගො එකාදසමො.{4 අධම්මවග්ගො එකාදසමො - මඡසං.}",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 41
            },
            {
                "text": "11. අධම්ම වර්ගය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 11. 1.",
                "level": "1"
            },
            {
                "text": "**[සැවැත් නිදානයි:]**",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් ම මහණ කෙනෙක් අධර්මය අධර්මය යි දක්වත් ද, මහණෙනි, ඒ මහණහු බොහෝ දෙනාට හිත  පිණිස බොහෝ දෙනාට සුව පිණිස බොහෝ දෙනාට වැඩ පිණිස දෙවිමිනිස්නට හිත පිණිස සුව පිණිස  පිළිපන්නාහු වෙති. මහණෙනි, ඒ මහණහු බොහෝ පින් ද උපදවත්. ඔහු ම මේ සද්ධර්මය තබත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 11. 2 - 10",
                "level": 1
            },
            {
                "text": "මහණෙනි, යම් ම මහණ කෙනෙක් ධර්මය ධර්මය යි (යථාවිධියෙන් ගෙණ) දක්වත් ද …, අවිනය අවිනය යි  දක්වත් ද …, විනය විනය යි දක්වත් ද …, තථාගතයන් වහන්සේ විසින් නොදෙසන ලද්ද නොතෙපලන ලද්ද තථාගතයන් වහන්සේ විසින් නොදෙසන ලදැයි නොතෙපලන ලදැයි දක්වත් ද …, තථාගතයන් වහන්සේ විසින් දෙසන ලද්ද තෙපලන ලද්ද තථාගතයන් වහන්සේ විසින් දෙසන ලදැයි තෙපලන ලදැයි දක්වත් ද …, තථාගතයන් වහන්සේ විසින් පුරුදු නො කරණ ලද්ද තථාගතයන් වහන්සේ විසින් පුරුදු නො කරණ ලදැයි දක්වත් ද …, තථාගතයන් වහන්සේ විසින් පුරුදු කරණ ලද්ද තථාගතයන් වහන්සේ විසින් පුරුදු කරණ ලදැයි දක්වත් ද …, තථාගතයන් වහන්සේ විසින් නො පණවන ලද්ද තථාගතයන් වහන්සේ විසින් නො පණවන ලදැයි දක්වත් ද …, තථාගතයන් වහන්සේ විසින් පණවන ලද්ද තථාගතයන් වහන්සේ විසින් පණවන ලදැයි දක්වත් ද …, මහණෙනි, ඒ මහණහු බොහෝ දෙනාට හිත පිණිස බොහෝ දෙනාට සුව පිණිස බොහෝ දෙනාට වැඩ පිණිස දෙවිමිනිස්නට  හිත පිණිස සුව පිණිස පිළිපන්නාහු වෙති. මහණෙනි, ඒ මහණහු බොහෝ පින් ද උපදවත්. ඔහු ම මේ සද්ධර්මය  තබත්.",
                "type": "paragraph"
            },
            {
                "text": "එකොලොස් වන වග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-1-11"
    }
]