[
    {
        "filename": "an-1-2",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 6
            },
            {
                "type": "heading",
                "text": "2. නීවරණප්පහානවග්ගො",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 2. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "**[සාවත්ථිනිදානං:]**"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නො වා කාමච්ඡන්දො උප්පජ්ජති, උප්පන්නො වා කාමච්ඡන්දො භිය්යොභාවාය වෙපුල්ලාය සංවත්තති, යථයිදං භික්ඛවෙ සුභනිමිත්තං. සුභනිමිත්තං භික්ඛවෙ අයොනිසො මනසි කරොතො අනුප්පන්නො චෙව කාමච්ඡන්දො උප්පජ්ජති, උප්පන්නො ච කාමච්ඡන්දො භිය්යොභාවාය වෙපුල්ලාය සංවත්තතී."
            },
            {
                "type": "heading",
                "text": "1. 2. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නො වා ව්යාපාදො{1 බ්යාපාදො - මඡසං, ස්යා.} උප්පජ්ජති, උප්පන්නො වා ව්යාපාදො භිය්යොභාවාය වෙපුල්ලාය සංවත්තති, යථයිදං භික්ඛවෙ පටිඝනිමිත්තං. පටිඝනිමිත්තං භික්ඛවෙ අයොනිසො මනසි කරොතො අනුප්පන්නො චෙව ව්යාපාදො{2 බ්යාපාදො - මඡසං, ස්යා.} උප්පජ්ජති, උප්පන්නො ච ව්යාපාදො භිය්යොභාවාය වෙපුල්ලාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 2. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නං වා ථිනමිද්ධං{3 ථීනමිද්ධං - මඡසං.} උප්පජ්ජති, උප්පන්නං වා ථිනමිද්ධං භිය්යොභාවාය වෙපුල්ලාය සංවත්තති, යථයිදං භික්ඛවෙ අරති තන්දී විජම්භිකා{4 විජම්භිතා - මඡසං.} භත්තසම්මදො චෙතසො ච ලීනත්තං. ලීනචිත්තස්ස භික්ඛවෙ අනුප්පන්නං චෙව ථිනමිද්ධං උප්පජ්ජති, උප්පන්නඤ්ච ථිනමිද්ධං භිය්යොභාවාය වෙපුල්ලාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 2. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නං වා උද්ධච්චකුක්කුච්චං උප්පජ්ජති, උප්පන්නං වා උද්ධච්චකුක්කුච්චං භිය්යොභාවාය වෙපුල්ලාය සංවත්තති, යථයිදං භික්ඛවෙ චෙතසො අවූපසමො. අවූපසන්තචිත්තස්ස භික්ඛවෙ අනුප්පන්නං චෙව උද්ධච්චකුක්කුච්චං උප්පජ්ජති, උප්පන්නං ච උද්ධච්චකුක්කුච්චං භිය්යොභාවාය වෙපුල්ලාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 2. 5.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා විචිකිච්ඡා උප්පජ්ජති, උප්පන්නා වා විචිකිච්ඡා භිය්යොභාවාය වෙපුල්ලාය සංවත්තති, යථයිදං භික්ඛවෙ අයොනිසො මනසිකාරො. අයොනිසො භික්ඛවෙ මනසි කරොතො අනුප්පන්නා චෙව විචිකිච්ඡා උප්පජ්ජති, උප්පන්නා ච විචිකිච්ඡා භිය්යොභාවාය වෙපුල්ලාය සංවත්තතීති."
            },
            {
                "type": "page-break",
                "text": "8"
            },
            {
                "type": "heading",
                "text": "1. 2. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නො වා කාමච්ඡන්දො නුප්පජ්ජති, උප්පන්නො වා කාමච්ඡන්දො පහීයති, යථයිදං භික්ඛවෙ අසුභනිමිත්තං. අසුභනිමිත්තං භික්ඛවෙ යොනිසො මනසි කරොතො අනුප්පන්නො චෙව කාමච්ඡන්දො නුප්පජ්ජති උප්පන්නො ච කාමච්ඡන්දො පහීයතීති."
            },
            {
                "type": "heading",
                "text": "1. 2. 7.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නො වා ව්යාපාදො නුප්පජ්ජති, උප්පන්නො වා ව්යාපාදො පහීයති, යථයිදං භික්ඛවෙ මෙත්තා චෙතොවිමුත්ති. මෙත්තං භික්ඛවෙ චෙතොවිමුත්තිං යොනිසො මනසි කරොතො අනුප්පන්නො චෙව ව්යාපාදො නුප්පජ්ජති, උප්පන්නො ච ව්යාපාදො පහීයතීති."
            },
            {
                "type": "heading",
                "text": "1. 2. 8.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නං වා ථිනමිද්ධං නුප්පජ්ජති, උප්පන්නං වා ථිනමිද්ධං පහීයති, යථයිදං භික්ඛවෙ ආරම්භධාතු නික්කමධාතු පරක්කමධාතු. ආරද්ධවීරියස්ස භික්ඛවෙ අනුප්පන්නඤ්චෙව ථිනමිද්ධං නුප්පජ්ජති, උප්පන්නඤ්ච ථිනමිද්ධං පහීයතීති."
            },
            {
                "type": "heading",
                "text": "1. 2. 9.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නං වා උද්ධච්චකුක්කුච්චං නුප්පජ්ජති, උප්පන්නං වා උද්ධච්චකුක්කුච්චං පහීයති, යථයිදං භික්ඛවෙ චෙතසො වූපසමො. වූපසන්තචිත්තස්ස භික්ඛවෙ අනුප්පන්නං චෙව උද්ධච්චකුක්කුච්චං නුප්පජ්ජති, උප්පන්නඤ්ච උද්ධච්චකුක්කුච්චං පහීයතීති."
            },
            {
                "type": "heading",
                "text": "1. 2. 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා විචිකිච්ඡා නුප්පජ්ජති, උප්පන්නා වා විචිකිච්ඡා පහීයති, යථයිදං භික්ඛවෙ යොනිසො මනසිකාරො. යොනිසො භික්ඛවෙ මනසි කරොතො අනුප්පන්නා චෙව විචිකිච්ඡා නුප්පජ්ජති, උප්පන්නා ච විචිකිච්ඡා පහීයතීති."
            },
            {
                "type": "centered",
                "text": "වග්ගො දුතියො.{* නීවරණප්පහාණවග්ගො දුතියො - මඡසං.}",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 7
            },
            {
                "text": "2. නීවරණප්‍රහාණ වර්ගය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 2. 1.",
                "level": 1
            },
            {
                "text": "**[සැවැත්නිදානයි:]**",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද කාමච්ඡන්දය උපදනේ නම්, උපන්නා වූ ද කාමච්ඡන්දය භූයසත්වය (නැවත නැවත වන බව) පිණිස විපුලබව පිණිස පවත්නේ නම්, මහණෙනි, මේ ශුභනිමිත්ත යම්සේ  වේ ද, එබඳු වූ අන් එක ද ධර්මයක් මම (නුවණැසින්) නො දක්මි. මහණෙනි, ශුභනිමිත්ත නුනුවණින් මෙනෙහි  කරණුවහට නූපන්නා වූ ද කාමච්ඡන්දය උපදනේ ය, උපන්නා වූ ද කාමච්ඡන්දය භූයසත්වය පිණිස විපුලත්වය  පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 2. 2.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද ව්‍යාපාදය උපදනේ නම්, උපන්නා වූ ද ව්‍යාපාදය  භූයොභාවය පිණිස විපුලභාවය පිණිස පවත්නේ නම්, මහණෙනි, මේ ප්‍රතිඝ (අනිෂ්ට) නිමිත්ත යම්සේ වේ ද, එබඳු වූ අන් එක ධර්මයකුදු  මම (නුවණැසින්) නො දක්මි. මහණෙනි, ප්‍රතිඝනිමිත්ත නුනුවණින් මෙනෙහි කරණුවහට නූපන්නා වූ  ද ව්‍යාපාදය උපදනේ ය. උපන්නා වූ ද ව්‍යාපාදය භූයොභාවය පිණිස විපුලභාවය  පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 2. 3.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද ථිනමිද්ධය (චිත්ත චෛතසිකයන් කර්මණ්‍ය නොවන බව) උපදනේ නම්, උපන්නා වූ ද ථිනමිද්ධය භූයොභාවය පිණිස විපුලභාවය පිණිස පවත්නේ නම්, මහණෙනි, මේ  (දුර සෙනසුන්හි හෝ අධිකුශලධර්මයෙහි නොඇල්ම වූ) අරතිය ද, (අලසබව වූ) තන්දිය ද, (ඇඟ මැළි කැඩීම වූ) විජම්භිකාව ද, (බත්මත නම් වූ) භත්තසම්මදය ද, චිත්තයාගේ හැකුළුණු බව වූ ලීනත්වය ද යම්සේ වේ ද, එබඳු වූ  අන් එක ධර්මයකුදු මම (නුවණැසින්) නො දක්මි. මහණෙනි, හැකිළුණු සිත් ඇත්තහුට නූපන්නා වූ ද  ථිනමිද්ධය  උපදනේ ය. උපන්නා වූ ද ථිනමිද්ධය භූයොභාවය පිණිස විපුලභාවය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 2. 4.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද (චිත්තයාගේ නොසන්හුන් බව හා විපිළිසරබව ය යි කියන  ලද) උද්ධච්චකුක්කුච්චය උපදනේ නම්, උපන්නා වූ ද උද්ධච්චකුක්කුච්චය භූයොභාවය පිණිස  විපුලභාවය  පිණිස පවත්නේ නම්, මහණෙනි, චිත්තයාගේ මේ නොසන්හුන්බව යම්සේ වේ ද, එබඳු අන් එක ධර්මයකුදු මම  නුවණැසින් නො දක්මි. මහණෙනි, නොසන්හුන් සිත් ඇත්තහුට නූපන්නා වූ ද උද්ධච්චකුක්කුච්චය උපදනේය. උපන්නා වූ ද උද්ධච්චකුක්කුච්චය භූයොභාවය පිණිස විපුලභාවය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 2. 5.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද (බුද්ධාදි අට තන්හි සැකය යි කියන ලද) විචිකිච්ඡාව  උපදනේ නම්, උපන්නා වූ ද විචිකිච්ඡාව භුයොභාවය පිණිස විපුලභාවය පිණිස පවත්නේ නම්, මහණෙනි, මේ නුනුවණින් මෙනෙහි කිරීම යම්සේ වේ ද, එබඳු අන් එක ධර්මයකුදු මම (නුවණැසින්) නො දක්මි. මහණෙනි, නුනුවණින්  මෙනෙහි කරණුවහට නූපන්නා වූ ද විචිකිච්ඡාව උපදනේ ය. උපන්නා වූ  ද  විචිකිච්ඡාව භූයොභාවය පිණිස විපුලභාවය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "9"
            },
            {
                "type": "heading",
                "text": "1. 2. 6.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද කාමච්ඡන්ද නූපදනේ  නම්, උපන්නා වූ ද කාමච්ඡන්දය ප්‍රහීණ වේ නම්, මහණෙනි, මේ අශුභනිමිත්ත යම්සේ වේ ද, එබඳු අන් එක ධර්මයකුදු මම (නුවණැසින්) නො දක්මි. මහණෙනි, අශුභනිමිත්ත නුවණින් මෙනෙහි කරන්නාහට නූපන්නා වූ ද කාමච්ඡන්දය නූපදනේ ය. උපන්නා වූ ද  කාමච්ඡන්දය ප්‍රහීණ වේ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 2. 7.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද ව්‍යාපාදය නූපදනේ නම්, උපන්නා වූ ද  ව්‍යාපාදය  ප්‍රහීණ වේ නම්, මහණෙනි, මේ මෛත්‍රීචිත්තවිමුක්තිය යම්සේ වේ ද, එබඳු අන් එක ධර්මයකුදු මම (නුවණැසින්) නො  දක්මි. මහණෙනි, මෛත්‍රීචිත්තවිමුක්තිය නුවණින් මෙනෙහි කරන්නාහට නූපන්නා වූ ද ව්‍යාපාදය නූපදනේ ය. උපන්නා  වූ ද ව්‍යාපාදය ප්‍රහීණ වේ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 2. 8.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද ථිනමිද්ධය නූපදනේ නම්, උපන්නා වූ ද ථිනමිද්ධය ප්‍රහීණ වේ නම්, මහණෙනි, මේ (ප්‍රථමාරම්භවීර්ය සඞ්ඛ්‍යාත) ආරම්භධාතු ද (කුසීතභාවයෙන් නික්මුනු බැවින් එයට වඩා බලවත්) නික්කමධාතු ද, (සම්බාධ මැඩ මතු මත්තට යන හෙයින් එයට ද වඩා බලවත්) පරක්කමධාතු ද  යම්සේ වේ ද, එබඳු අන් එක ධර්මයකුදු මම (නුවණැසින්) නො දක්මි. මහණෙනි, ආරබ්ධවීර්ය ඇතියහුට නූපන්නා වූ ද ථිනමිද්ධය නූපදනේ ය. උපන්නා වූ ද ථිනමිද්ධය ප්‍රහීණ වේ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 2. 9.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද උද්ධච්චකුක්කුච්චය නූපදනේ නම්, උපන්නා වූ ද  උද්ධච්චකුක්කුච්චය ප්‍රහීණ වේ නම්, මහණෙනි, මේ චිත්තයාගේ සන්හිඳීම යම්සේ වේ ද, එබඳු අන් එක  ධර්මයකුදු මම (නුවණැසින්) නො දක්මි. මහණෙනි, සන්හුන් සිත් ඇත්තහුට නූපන්නා වූ ද උද්ධච්චකුක්කුච්චය නූපදනේ ය. උපන්නා වූ ද උද්ධච්චකුක්කුච්චය ප්‍රහීණ වේ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 2. 10.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නාවූ වූ ද විචිකිච්ඡාව නූපදනේ නම්, උපන්නා වූ ද  විචිකිච්ඡාව  ප්‍රහීණ වේ නම්, මහණෙනි, මේ නුවණින් මෙනෙහි කිරීම යම්සේ වේ ද, එබඳු අන් එක ධර්මයකුදු මම  (නුවණැසින්) නො දක්මි. මහණෙනි, නුවණින් මෙනෙහි කරන්නාහට නූපන්නා වූ ද විචිකිච්ඡාව නූපදනේ ය. උපන්නා වූ ද  විචිකිච්ඡාව ප්‍රහීණ වේ.",
                "type": "paragraph"
            },
            {
                "text": "දෙවන වග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-1-2"
    }
]