[
    {
        "filename": "an-1-10",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 32
            },
            {
                "type": "heading",
                "text": "10. අජ්ඣත්තිකවග්ගො",
                "level": 3
            },
            {
                "type": "paragraph",
                "text": "**(සාවත්ථි නිදානං:)**"
            },
            {
                "type": "heading",
                "text": "1. 10. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අජ්ඣත්තිකං භික්ඛවෙ අඞ්ගන්ති කරිත්වා න{2 නාඤ්ඤං - මඡසං.} අඤ්ඤං එකඞ්ගම්පි සමනුපස්සාමි, යං එවං මහතො අනත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ පමාදො. පමාදො භික්ඛවෙ මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අජ්ඣත්තිකං භික්ඛවෙ අඞ්ගන්ති කරිත්වා න අඤ්ඤං එකඞ්ගම්පි සමනුපස්සාමි, යං එවං මහතො අත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ අප්පමාදො. අප්පමාදො භික්ඛවෙ මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අජ්ඣත්තිකං භික්ඛවෙ අඞ්ගන්ති කරිත්වා න අඤ්ඤං එකඞ්ගම්පි සමනුපස්සාමි, යං එවං මහතො අනත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ කොසජ්ජං. කොසජ්ජං භික්ඛවෙ මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අජ්ඣත්තිකං භික්ඛවෙ අඞ්ගන්ති කරිත්වා න අඤ්ඤං එකඞ්ගම්පි සමනුපස්සාමි යං එවං මහතො අත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ විරියාරම්භො. විරියාරම්භො භික්ඛවෙ මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "page-break",
                "text": "34"
            },
            {
                "type": "heading",
                "text": "1. 10. 5.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අජ්ඣත්තිකං භික්ඛවෙ අඞ්ගන්ති කරිත්වා න අඤ්ඤං එකඞ්ගම්පි සමනුපස්සාමි, යා{1 යං - සබ්බත්ථං.} එවං මහතො අනත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ මහිච්ඡතා. මහිච්ඡතා භික්ඛවෙ මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අජ්ඣත්තිකං භික්ඛවෙ අඞ්ගන්ති කරිත්වා න අඤ්ඤං එකඞ්ගම්පි සමනුපස්සාමි, යා{2 යං - සබ්බත්ථං.} එවං මහතො අත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ අප්පිච්ඡතා. අප්පිච්ඡතා භික්ඛවෙ මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 7.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අජ්ඣත්තිකං භික්ඛවෙ අඞ්ගන්ති කරිත්වා න අඤ්ඤං එකඞ්ගම්පි සමනුපස්සාමි, යා{3 යං - සබ්බත්ථං.} එවං මහතො අනත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ අසන්තුට්ඨිතා. අසන්තුට්ඨිතා භික්ඛවෙ මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 8.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අජ්ඣත්තිකං භික්ඛවෙ අඞ්ගන්ති කරිත්වා න අඤ්ඤං එකඞ්ගම්පි සමනුපස්සාමි, යා{4 යං - සබ්බත්ථං.} එවං මහතො අත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ සන්තුට්ඨිතා. සන්තුට්ඨිතා භික්ඛවෙ මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 9.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අජ්ඣත්තිකං භික්ඛවෙ අඞ්ගන්ති කරිත්වා න අඤ්ඤං එකඞ්ගම්පි සමනුපස්සාමි, යා{5 යං - සබ්බත්ථං.} එවං මහතො අනත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ අයොනිසොමනසිකාරො. අයොනිසොමනසිකාරො භික්ඛවෙ මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අජ්ඣත්තිකං භික්ඛවෙ අඞ්ගන්ති කරිත්වා න අඤ්ඤං එකඞ්ගම්පි සමනුපස්සාමි, යා{6 යං - සබ්බත්ථං.} එවං මහතො අත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ යොනිසොමනසිකාරො. යොනිසොමනසිකාරො භික්ඛවෙ මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 11.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අජ්ඣත්තිකං භික්ඛවෙ අඞ්ගන්ති කරිත්වා න අඤ්ඤං එකඞ්ගම්පි සමනුපස්සාමි, යා{7 යං - සබ්බත්ථං.} එවං මහතො අනත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ අසම්පජඤ්ඤං. අසම්පජඤ්ඤං භික්ඛවෙ මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 12.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අජ්ඣත්තිකං භික්ඛවෙ අඞ්ගන්ති කරිත්වා න අඤ්ඤං එකඞ්ගම්පි සමනුපස්සාමි, යා{8 යං - සබ්බත්ථං.} එවං මහතො අත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ සම්පජඤ්ඤං. සම්පජඤ්ඤං භික්ඛවෙ මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "page-break",
                "text": "36"
            },
            {
                "type": "heading",
                "text": "1. 10. 13.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "බාහිරං භික්ඛවෙ අඞ්ගන්ති කරිත්වා න අඤ්ඤං එකඞ්ගම්පි සමනුපස්සාමි, යං එවං මහතො අනත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ පාපමිත්තතා. පාපමිත්තතා, භික්ඛවෙ, මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 14.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "බාහිරං භික්ඛවෙ අඞ්ගන්ති කරිත්වා න අඤ්ඤං එකඞ්ගම්පි සමනුපස්සාමි, යං{1 යං - සබ්බත්ථ.} එවං මහතො අත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ කල්යාණමිත්තතා. කල්යාණමිත්තතා භික්ඛවෙ මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 15.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අජ්ඣත්තිකං භික්ඛවෙ අඞ්ගන්ති කරිත්වා න අඤ්ඤං එකඞ්ගම්පි සමනුපස්සාමි, යං එවං මහතො අනත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ අනුයොගො අකුසලානං ධම්මානං, අනනුයොගො කුසලානං ධම්මානං. අනුයොගො භික්ඛවෙ අකුසලානං ධම්මානං, අනනුයොගො කුසලානං ධම්මානං මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 16.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අජ්ඣත්තිකං භික්ඛවෙ අඞ්ගන්ති කරිත්වා න අඤ්ඤං එකඞ්ගම්පි සමනුපස්සාමි, යං එවං මහතො අත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ අනුයොගො කුසලානං ධම්මානං, අනනුයොගො අකුසලානං ධම්මානං. අනුයොගො භික්ඛවෙ කුසලානං ධම්මානං, අනනුයොගො අකුසලානං ධම්මානං මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 17.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං සද්ධම්මස්ස සම්මොසාය අන්තරධානාය සංවත්තති, යථයිදං භික්ඛවෙ පමාදො. පමාදො භික්ඛවෙ සද්ධම්මස්ස සම්මොසාය අන්තරධානාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 18.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං සද්ධම්මස්ස ඨිතියා අසම්මොසාය අනන්තරධානාය සංවත්තති, යථයිදං භික්ඛවෙ අප්පමාදො. අප්පමාදො භික්ඛවෙ සද්ධම්මස්ස ඨිතියා අසම්මොසාය අනන්තරධානාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 19.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි යං{2 යො - සබ්බත්ථ.} එවං සද්ධම්මස්ස සම්මොසාය අන්තරධානාය සංවත්තති, යථයිදං භික්ඛවෙ කොසජ්ජං. කොසජ්ජං භික්ඛවෙ සද්ධම්මස්ස සම්මොසාය අන්තරධානාය සංවත්තතීති."
            },
            {
                "type": "page-break",
                "text": "38"
            },
            {
                "type": "heading",
                "text": "1. 10. 20.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං සද්ධම්මස්ස ඨිතියා අසම්මොසාය අනන්තරධානාය සංවත්තති, යථයිදං භික්ඛවෙ විරියාරම්භො. විරියාරම්භො භික්ඛවෙ සද්ධම්මස්ස ඨිතියා අසම්මොසාය අනන්තරධානාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 21 – 30.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යා එවං සද්ධම්මස්ස සම්මොසාය අන්තරධානාය සංවත්තති, යථයිදං භික්ඛවෙ මහිච්ඡතා -පෙ- අප්පිච්ඡතා -පෙ- අසන්තුට්ඨිතා -පෙ- සන්තුට්ඨිතා -පෙ- අයොනිසොමනසිකාරො -පෙ- යොනිසොමනසිකාරො -පෙ- අසම්පජඤ්ඤං -පෙ- සම්පජඤ්ඤං -පෙ- පාපමිත්තතා -පෙ- කල්යාණමිත්තතා. කල්යාණමිත්තතා භික්ඛවෙ සද්ධම්මස්ස ඨිතියා අසම්මොසාය අන්තරධානාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 31.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං සද්ධම්මස්ස සම්මොසාය අන්තරධානාය සංවත්තති, යථයිදං භික්ඛවෙ අනුයොගො අකුසලානං ධම්මානං, අනනුයොගො කුසලානං ධම්මානං. අනුයොගො භික්ඛවෙ අකුසලානං ධම්මානං, අනනුයොගො කුසලානං ධම්මානං සද්ධම්මස්ස සම්මොසාය අන්තරධානාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 10. 32.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං සද්ධම්මස්ස ඨිතියා අසම්මොසාය අනන්තරධානාය සංවත්තති, යථයිදං භික්ඛවෙ අනුයොගො කුසලානං ධම්මානං, අනනුයොගො අකුසලානං ධම්මානං. අනුයොගො භික්ඛවෙ කුසලානං ධම්මානං, අනනුයොගො අකුසලානං ධම්මානං සද්ධම්මස්ස ඨිතියා අසම්මොසාය අනන්තරධානාය සංවත්තතීති."
            },
            {
                "type": "centered",
                "text": "චතුක්කොටිකං නිට්ඨිතං.{1 චතුක්කොටිකං නිට්ඨිතං - මඡසං.}",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "1. 10. 33.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "යෙ{2 යෙපි - ස්යා.} තෙ භික්ඛවෙ භික්ඛූ අධම්මං ධම්මොති දීපෙන්ති, තෙ භික්ඛවෙ භික්ඛූ බහුජනාහිතාය{3 බහුජන අහිතාය - මඡසං.} පටිපන්නා බහුජනාසුඛාය{4 බහුජන අසුඛාය - මඡසං.} බහුනො ජනස්ස අනත්ථාය අහිතාය දුක්ඛාය දෙවමනුස්සානං . බහුඤ්ච තෙ භික්ඛවෙ භික්ඛූ අපුඤ්ඤං පසවන්ති, තෙවිමං සද්ධම්මං අන්තරධාපෙන්තීති."
            },
            {
                "type": "page-break",
                "text": "40"
            },
            {
                "type": "heading",
                "text": "1. 10. 34 – 42.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "යෙ තෙ භික්ඛවෙ භික්ඛූ ධම්මං අධම්මොති දීපෙන්ති, -පෙ- අවිනයං විනයොති දීපෙන්ති -පෙ- විනයං අවිනයොති දීපෙන්ති -පෙ- අභාසිතං අලපිතං තථාගතෙන භාසිතං ලපිතං තථාගතෙනාති දීපෙන්ති -පෙ- භාසිතං ලපිතං තථාගතෙන අභාසිතං අලපිතං තථාගතෙනාති දීපෙන්ති -පෙ- අනාචිණ්ණං තථාගතෙන ආචිණ්ණං තථාගතෙනාති දීපෙන්ති -පෙ- ආචිණ්ණං තථාගතෙන අනාචිණ්ණං තථාගතෙනාති දීපෙන්ති -පෙ- අපඤ්ඤත්තං තථාගතෙන පඤ්ඤත්තං තථාගතෙනාති දීපෙන්ති -පෙ- පඤ්ඤත්තං තථාගතෙන අපඤ්ඤත්තං තථාගතෙනාති දීපෙන්ති, තෙ භික්ඛවෙ භික්ඛූ බහුජනාහිතාය පටිපන්නා බහුජනාසුඛාය බහුනො ජනස්ස අනත්ථාය අහිතාය දුක්ඛාය දෙවමනුස්සානං. බහුඤ්ච තෙ භික්ඛවෙ භික්ඛූ අපුඤ්ඤං පසවන්ති. තෙවිමං{1 තෙපිමං - සීමු. තෙචිමං - ස්යා. මඡසං. PTS.} සද්ධම්මං අන්තරධාපෙන්තීති."
            },
            {
                "type": "centered",
                "text": "වග්ගො දසමො.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 33
            },
            {
                "text": "10. ආධ්‍යාත්මික වර්ගය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "paragraph",
                "text": "**[සැවැත් නිදානයි:]**"
            },
            {
                "type": "heading",
                "text": "1. 10. 1.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ‘ආධ්‍යාත්මික අඞ්ගය’ යි (තමා තුළ වැටෙන හෙතුය යි) මෙසේ කොට ගෙණ, (පරාඞ්ගසඞ්ඛ්‍යතබාහිර හේතු හැරපියා බණත් මැ) යමෙක් මෙසේ මහත් වූ අනර්ථය පිණිස පවත්නේ ද, මහණෙනි, ප්‍රමාදය බඳු අන්  එක කාරණයකුදු නො දක්මි. මහණෙනි, ප්‍රමාදය මහත් අනර්ථය පිණිස පවත්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 2.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ‘ආධ්‍යාත්මික අඞ්ගය’ යි කොට ගෙණ, යමෙක් මෙසේ මහත් වූ අර්ථය පිණිස පවත්නේ ද, මහණෙනි, අප්‍රමාදය බඳු අන් එක අඞ්ගයකුදු නො දක්මි. මහණෙනි, අප්‍රමාදය මහත් වූ අර්ථය පිණිස පවත්නේ  ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 3.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ‘ආධ්‍යාත්මික අඞ්ගය’ යි කොට ගෙණ, යමෙක් මෙසේ මහත් අනර්ථය පිණිස පවත්නේ ද, මහණෙනි, කුසීත බව බඳු අන් එක ධර්මයකුදු නො දක්මි. මහණෙනි, කුසීතබව මහත් වූ අනර්ථය පිණිස  පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 4.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ‘ආධ්‍යාත්මික අඞ්ගය’ යි කොට ගෙණ, යමෙක් මෙසේ මහත් අර්ථය පිණිස පවත්නේ ද, මහණෙනි, වීර්යාරම්භය බඳු අන් එක ධර්මයකුදු නො දක්මි. මහණෙනි, වීර්යාරම්භය මහත් අර්ථය පිණිස පවත්නේය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "35"
            },
            {
                "type": "heading",
                "text": "1. 10. 5.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ‘ආධ්‍යාත්මික අඞ්ගය’ යි කොට ගෙණ යමක් මෙසේ මහත් අනර්ථය පිණිස පවත්නී ද, මහණෙනි, මහෙච්ඡතාව බඳු අන් එක ධර්මයකුදු නො දක්මි. මහණෙනි, මහෙච්ඡතාව මහත් අනර්ථය පිණිස පවත්නී ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 6.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ‘ආධ්‍යාත්මික අඞ්ගය’ යි කොට ගෙණ යමක් මෙසේ මහත් අර්ථය පිණිස පවත්නී ද, මහණෙනි, අල්පෙච්ඡතාව බඳු අන් එක ධර්මයකුදු නො දක්මි. මහණෙනි, අල්පෙච්ඡතාව මහත් අර්ථය පිණිස පවත්නී ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 7.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ‘ආධ්‍යාත්මික අඞ්ගය’ යි කොට ගෙණ යමක් මෙසේ මහත් අනර්ථය පිණිස පවත්නී ද, මහණෙනි, අසන්තුට්ඨිතාව බඳු අන් එක ධර්මයකුදු නො දක්මි. මහණෙනි, අසන්තුට්ඨිතාව මහත් අනර්ථය පිණිස පවත්නී  ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 8.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ‘ආධ්‍යාත්මික අඞ්ගය’ යි කොට ගෙණ යමක් මෙසේ මහත් අර්ථය පිණිස පවත්නී ද, මහණෙනි, සන්තුට්ඨිතාව බඳු අන් එක ධර්මයකුදු නො දක්මි. මහණෙනි, සන්තුට්ඨිතාව මහත් අර්ථය පිණිස පවත්නී ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 9.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ‘ආධ්‍යාත්මික අඞ්ගය’ යි කොට ගෙණ යමෙක් මෙසේ මහත් අනර්ථය පිණිස පවත්නේ ද, මහණෙනි, අයෝනිසො මනසිකාරය බඳු අන් එක ධර්මයකුදු නො දක්මි. මහණෙනි, අයෝනිසො මනසිකාරය මහත්  අනර්ථය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 10.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ‘ආධ්‍යාත්මික අඞ්ගය’ යි කොට ගෙණ යමෙක් මෙසේ මහත් අර්ථය පිණිස පවත්නේ ද, මහණෙනි, යෝනිසො මනසිකාරය බඳු අන් එක ධර්මයකුදු නො දක්මි. මහණෙනි, යෝනිසො මනසිකාරය මහත් අර්ථය  පිණිස පවත්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 11.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ‘ආධ්‍යාත්මික අඞ්ගය’ යි කොට ගෙණ යමෙක් මෙසේ මහත් අනර්ථය පිණිස පවත්නේ ද, මහණෙනි, අසම්පජඤ්ඤය බඳු අන් එක ධර්මයකුදු නො දක්මි. මහණෙනි, අසම්පජඤ්ඤය මහත් අනර්ථය පිණිස  පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 12.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ‘ආධ්‍යාත්මික අඞ්ගය’ යි කොට ගෙණ යමෙක් මෙසේ මහත් අර්ථය පිණිස පවත්නේ ද, මහණෙනි, සම්පජඤ්ඤය බඳු අන් එක ධර්මයකුදු නො දක්මි. මහණෙනි, සම්පජඤ්ඤය මහත් අර්ථය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "37"
            },
            {
                "type": "heading",
                "text": "1. 10. 13.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ‘බාහිර අඞ්ගය’ යි කොට ගෙණ යමක් මෙසේ මහත් අනර්ථය පිණිස පවත්නී ද, මහණෙනි, පාපමිත්‍රතාව බඳු අන් එක අඞ්ගයකුදු නො දක්මි. මහණෙනි, පාපමිත්‍රතාව මහත් අනර්ථය පිණිස පවත්නී ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 14.",
                "level": 1
            },
            {
                "text": "මහණෙනි, ‘බාහිර අඞ්ගය’ යි කොට ගෙණ යමක් මෙසේ මහත් අර්ථය පිණිස පවත්නී ද, මහණෙනි, කල්‍යාණමිත්‍රතාව බඳු අන් එක අඞ්ගයකුදු නො දක්මි. මහණෙනි, කල්‍යාණමිත්‍රතාව මහත් අර්ථය පිණිස පවත්නී  ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 15.",
                "level": 1
            },
            {
                "text": "මහණෙනි, ‘ආධ්‍යාත්මික අඞ්ගය’ යි කොට ගෙණ යමෙක් මෙසේ මහත් අනර්ථය පිණිස පවත්නේ ද, මහණෙනි, අකුශලධර්මයන්හි යෙදීම හා කුශලධර්මයන්හි නොයෙදීම බඳු අන් එක අඞ්ගයකුදු නො දක්මි. මහණෙනි, අකුශලධර්මයන්හි යෙදීම හා කුශලධර්මයන්හි නො යෙදීම මහත් අනර්ථය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 16.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ‘ආධ්‍යාත්මික අඞ්ගය’ යි කොට ගෙණ යමෙක් මෙසේ මහත් අර්ථය පිණිස පවත්නේ ද, මහණෙනි, කුශලධර්මයන්හි යෙදීම හා අකුශලධර්මයන්හි නොයෙදීම බඳු අන් එක අඞ්ගයකුදු මම නොදක්මි. මහණෙනි, කුශලධර්මයන්හි යෙදීම හා අකුශලධර්මයන්හි නො යෙදීම. මහත් අර්ථය පිණිස පවත්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 17.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමෙක් මෙසේ සද්ධර්මයාගේ විනාශය පිණිස අන්තර්ධානය පිණිස පවත්නේ ද, මහණෙනි, ප්‍රමාදය  බඳු අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, ප්‍රමාදය සද්ධර්මයාගේ විනාශය පිණිස අන්තර්ධානය පිණිස  පවත්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 18.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමෙක් මෙසේ සද්ධර්මයාගේ පැවැත්ම පිණිස අවිනාශය පිණිස අතුරුදන් නොවීම පිණිස පවත්නේ ද, මහණෙනි, අප්‍රමාදය බඳු අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, අප්‍රමාදය සද්ධර්මයාගේ පැවැත්ම පිණිස  අවිනාශය පිණිස අතුරුදන් නො වීම පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 19.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමෙක් මෙසේ සද්ධර්මයාගේ ප්‍රමෝෂය පිණිස අන්තර්ධානය පිණිස පවත්නේ ද, මහණෙනි, කුසීත  බව බඳු අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, කුසීත බව සද්ධර්මයාගේ ප්‍රමෝෂය පිණිස අන්තර්ධානය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "39"
            },
            {
                "type": "heading",
                "text": "1. 10. 20.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමෙක් මෙසේ සද්ධර්මයාගේ පැවැත්ම පිණිස අප්‍රමෝෂය පිණිස අතුරුදන් නො වීම පිණිස පවත්නේ  ද, මහණෙනි, වීර්යාරම්භය බඳු අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, වීර්යාරම්භය සද්ධර්මයාගේ පැවැත්ම පිණිස අප්‍රමෝෂය පිණිස අතුරුදන් නොවීම පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 21 - 30.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ සද්ධර්මයාගේ ප්‍රමෝෂය පිණිස අතුරුදන් වීම පිණිස පවත්නී ද, මහණෙනි, මහේච්ඡතාව බඳු අන් එක ධර්මයකුදු මම නො දක්මි. … අල්පේච්ඡතාව … අසන්තුට්ඨිතාව … සන්තුට්ඨිතාව … අයෝනිසොමනසිකාරය … යෝනිසොමනසිකාරය … අසම්පජඤ්ඤය … සම්පජඤ්ඤය … පාපමිත්‍රයන් ඇති  බව … කල්‍යාණමිත්‍රයන් ඇති බව. මහණෙනි, කල්‍යාණමිත්‍රතාව සද්ධර්මයාගේ ස්ථිතිය පිණිස අප්‍රමෝෂය පිණිස  අතුරුදන් නොවීම පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 31.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමෙක් මෙසේ සද්ධර්මයාගේ ප්‍රමෝෂය පිණිස අන්තර්ධානය පිණිස පවත්නේ ද, මහණෙනි, අකුශලධර්මයන්හි යෙදීම හා කුශලධර්මයන්හි නොයෙදීම බඳු අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, අකුශලධර්මයන්හි යෙදීම හා කුශලධර්මයන්හි නො යෙදීම සද්ධර්මයාගේ ප්‍රමෝෂය පිණිස  අතුරුදන්වීම  පිණිස  පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 10. 32.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමෙක් මෙසේ සද්ධර්මයාගේ ස්ථිතිය පිණිස අප්‍රමෝෂය පිණිස අතුරුදන් නොවීම පිණිස පවත්නේ  ද  මහණෙනි, කුශලධර්මයන්හි යෙදීම හා අකුශලධර්මයන්හි නොයෙදීම බඳු අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, කුශලධර්මයන්හි යෙදීම හා අකුශලධර්මයන්හි නො යෙදීම සද්ධර්මයාගේ ස්ථිතිය පිණිස අප්‍රමෝෂය  පිණිස අතුරුදන් නොවීම පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "text": "චතුකොටිකය නිමි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "1. 10. 33.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් ම මහණ කෙනෙක් (ඒ ඒ ධර්මප්‍රදෙශ ඌනාධිකවශයෙන් ගෙණ) අධර්මය ධර්මය යි ප්‍රකාශ කෙරෙත් ද, මහණෙනි, ඒ මහණහු බොහෝ දෙනාට අහිත පිණිස බොහෝ දෙනාට නො සුව පිණිස බොහෝ  දෙනාට අනර්ථය පිණිස දෙවිමිනිසුනට අහිත පිණිස දුක් පිණිස පිළිපන්නාහු වෙති. මහණෙනි, ඒ භික්ෂූහු බොහෝ පව් ද උදා කෙරෙති. ඔහු ම මේ සද්ධර්මය අතුරුදන් කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "41"
            },
            {
                "type": "heading",
                "text": "1. 10.  34 - 42.",
                "level": 1
            },
            {
                "text": "මහණෙනි, යම් ම මහණ කෙනෙක් ධර්මය අධර්මය යි ප්‍රකාශ කෙරෙත් ද … අවිනය විනය යි ප්‍රකාශ කෙරෙත්  ද … විනය අවිනය යි ප්‍රකාශ කෙරෙත් ද … තථාගතයන් වහන්සේ විසින් නොදෙසන ලද්ද නොතෙපලන ලද්ද තථාගතයන් වහන්සේ විසින් දෙසන ලදැයි තෙපලන ලදැයි ප්‍රකාශ කෙරෙත් ද … තථාගතයන් වහන්සේ විසින්  දෙසන ලද්ද තෙපලන ලද්ද තථාගතයන් වහන්සේ විසින් නොදෙසන ලදැයි නොතෙපලන ලදැයි ප්‍රකාශ  කෙරෙත් ද … තථාගතයන් වහන්සේ විසින් නොපුරුදු කරණ ලද්ද තථාගතයන් වහන්සේ විසින් පුරුදු කරණ  ලදැයි ප්‍රකාශ කෙරෙත් ද … තථාගතයන් වහන්සේ විසින් පුරුදු කරණ ලද්ද තථාගතයන් වහන්සේ විසින් පුරුදු  නො කරණ ලදැයි ප්‍රකාශ කෙරෙත් ද … තථාගතයන් වහන්සේ විසින් නො පණවන ලද්ද තථාගතයන් වහන්සේ  විසින් පණවන ලදැයි ප්‍රකාශ කෙරෙත් ද … තථාගතයන් වහන්සේ විසින් පණවන ලද්ද තථාගතයන් වහන්සේ  විසින් නොපණවන ලදැයි ප්‍රකාශ කෙරෙත් ද … මහණෙනි, ඒ මහණහු බොහෝ දෙනාට අහිත පිණිස බොහෝ  දෙනාට නො සුව පිණිස බොහෝ දෙනාට අනර්ථය පිණිස දෙවිමිනිසුනට අහිත පිණිස දුක් පිණිස පිළිපන්නාහු වෙති. මහණෙනි, ඒ මහණහු බොහෝ පව් ද උදා කෙරෙති. ඔහු ම මේ සද්ධර්මය අතුරුදන් කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "text": "දසවන වග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-1-10"
    }
]