[
    {
        "filename": "an-1-8",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 26
            },
            {
                "type": "heading",
                "text": "8. කල්යාණමිත්තවග්ගො",
                "level": 3
            },
            {
                "type": "paragraph",
                "text": "**(සාවත්ථි නිදානං:)**"
            },
            {
                "type": "heading",
                "text": "1. 8. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා වා අකුසලා ධම්මා පරිහායන්ති, යථයිදං භික්ඛවෙ කල්යාණමිත්තතා. කල්යාණමිත්තස්ස භික්ඛවෙ අනුප්පන්නා චෙව කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච අකුසලා ධම්මා පරිහායන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 8. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා අකුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා වා කුසලා ධම්මා පරිහායන්ති, යථයිදං භික්ඛවෙ අනුයොගො අකුසලානං ධම්මානං, අනනුයොගො කුසලානං ධම්මානං. අනුයොගා භික්ඛවෙ අකුසලානං ධම්මානං අනනුයොගා කුසලානං ධම්මානං අනුප්පන්නා චෙව අකුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච කුසලා ධම්මා පරිහායන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 8. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා වා අකුසලා ධම්මා පරිහායන්ති, යථයිදං භික්ඛවෙ අනුයොගො කුසලානං ධම්මානං, අනනුයොගො අකුසලානං ධම්මානං. අනුයොගා භික්ඛවෙ කුසලානං ධම්මානං, අනනුයොගා අකුසලානං ධම්මානං අනුප්පන්නා චෙව කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච අකුසලා ධම්මා පරිහායන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 8. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා බොජ්ඣඞ්ගා නුප්පජ්ජන්ති, උප්පන්නා වා බොජ්ඣඞ්ගා න භාවනා පාරිපූරිං ගච්ඡන්ති, යථයිදං භික්ඛවෙ අයොනිසො මනසිකාරො. අයොනිසො භික්ඛවෙ මනසිකරොතො අනුප්පන්නා චෙව බොජ්ඣඞ්ගා නුප්පජ්ජන්ති, උප්පන්නා ච බොජ්ඣඞ්ගා න භාවනාපාරිපූරිං ගච්ඡන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 8. 5.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා බොජ්ඣඞ්ගා උප්පජ්ජන්ති, උප්පන්නා වා බොජ්ඣඞ්ගා භාවනාපාරිපූරිං ගච්ඡන්ති, යථයිදං භික්ඛවෙ යොනිසො මනසිකාරො. යොනිසො භික්ඛවෙ මනසිකරොතො අනුප්පන්නා චෙව බොජ්ඣඞ්ගා උප්පජ්ජන්ති, උප්පන්නා ච බොජ්ඣඞ්ගා භාවනාපාරිපූරිං ගච්ඡන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 8. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අප්පමත්තිකා එසා භික්ඛවෙ පරිහානි, යදිදං ඤාතිපරිහානි. එතං පතිකිට්ඨං භික්ඛවෙ පරිහානීනං යදිදං පඤ්ඤාපරිහානීති."
            },
            {
                "type": "page-break",
                "text": "28"
            },
            {
                "type": "heading",
                "text": "1. 8. 7.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අප්පමත්තිකා එසා භික්ඛවෙ වුද්ධි, යදිදං ඤාතිවුද්ධි. එතදග්ගං භික්ඛවෙ වුද්ධීනං යදිදං පඤ්ඤාවුද්ධි. තස්මාතිහ භික්ඛවෙ එවං සික්ඛිතබ්බං: පඤ්ඤාවුද්ධියා වඩ්ඪිස්සාමාති. එවං හි වො භික්ඛවෙ සික්ඛිතබ්බන්ති."
            },
            {
                "type": "heading",
                "text": "1. 8. 8.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අප්පමත්තිකා එසා භික්ඛවෙ පරිහානි, යදිදං භොගපරිහානි. එතං පතිකිට්ඨං භික්ඛවෙ පරිහානීනං යදිදං පඤ්ඤාපරිහානීති."
            },
            {
                "type": "heading",
                "text": "1. 8. 9.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අප්පමත්තිකා එසා භික්ඛවෙ වුද්ධි, යදිදං භොගවුද්ධි. එතදග්ගං භික්ඛවෙ වුද්ධීනං යදිදං පඤ්ඤාවුද්ධි. තස්මාතිහ භික්ඛවෙ එවං සික්ඛිතබ්බං : පඤ්ඤාවුද්ධියා වඩ්ඪිස්සාමාති. එවං හි වො භික්ඛවෙ සික්ඛිතබ්බන්ති."
            },
            {
                "type": "heading",
                "text": "1. 8. 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අප්පමත්තිකා එසා භික්ඛවෙ පරිහානි, යදිදං යසොපරිහානි. එතං පතිකිට්ඨං භික්ඛවෙ පරිහානීනං යදිදං පඤ්ඤාපරිහානීති."
            },
            {
                "type": "heading",
                "text": "1. 8. 11.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අප්පමත්තිකා එසා භික්ඛවෙ වුද්ධි, යදිදං යසොවුද්ධි. එතදග්ගං භික්ඛවෙ වුද්ධීනං යදිදං පඤ්ඤාවුද්ධි. තස්මාතිහ භික්ඛවෙ එවං සික්ඛිතබ්බං: පඤ්ඤාවුද්ධියා වඩ්ඪිස්සාමාති. එවං හි වො භික්ඛවෙ සික්ඛිතබ්බන්ති."
            },
            {
                "type": "centered",
                "text": "වග්ගො අට්ඨමො.{* කල්යාණමිත්තාදිවග්ගො අට්ඨමො - මඡසං.}",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 27
            },
            {
                "text": "8. කල්‍යාණමිත්‍ර වර්ගය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "paragraph",
                "text": "**[සැවැත් නිදානයි:]**"
            },
            {
                "text": "1. 8. 1.",
                "type": "heading",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද කුශලධර්මයෝ උපදිත් නම්, උපන්නා වූ ද අකුශල ධර්මයෝ පිරිහෙත් නම්, මහණෙනි, කල්‍යාණමිත්‍රතාව වැනි අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, කලණ මිතුරන්  ඇත්තාහට නූපන්නා වූ ද කුශලධර්මයෝ උපදිත්. උපන්නා වූ ද අකුශල ධර්මයෝ පිරිහෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 8. 2.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද අකුශලධර්මයෝ උපදිත් නම්, උපන්නා වූ ද කුශලධර්මයෝ පිරිහෙත් නම්, මහණෙනි, අකුශල ධර්මයන්හි යෙදීම හා (චාතුර්භුමක) කුශලධර්මයන්හි නො යෙදීම ද වැනි අන්  එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, අකුශලධර්මයන්හි යෙදීමෙනුදු කුශලධර්මයන්හි නොයෙදීමෙනුදු නූපන්නා වූ ද අකුශලධර්මයෝ උපදිත්, උපන්නා වූ ද කුශලධර්මයෝ පිරිහෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 8. 3.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද කුශලධර්මයෝ උපදිත් නම්, උපන්නා වූ ද අකුශලධර්මයෝ පිරිහෙත් නම්, මහණෙනි, කුශලධර්මයන්හි යෙදීම හා අකුශලධර්මයන්හි නොයෙදීම ද වැනි අන් එක ධර්මයකුදු  මම නො දක්මි. මහණෙනි, කුශලධර්මයන්හි යෙදීමෙන් හා අකුශල ධර්මයන්හි නො යෙදීමෙන් හා නූපන්නා වූ ද  කුශලධර්මයෝ උපදිත්. උපන්නා වූ ද අකුශලධර්මයෝ පිරිහෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 8. 4.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද බෝධ්‍යඞ්ගධර්මයෝ නූපදිත් නම්, උපන්නා වූ ද  බෝධ්‍යඞ්ගධර්මයෝ භාවනායෙන් පිරිපුන් බවට නො යෙත් නම්, මහණෙනි, අයොනිසො මනසිකාරය වැනි අන්  එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, නුනුවණින් මෙනෙහි කරන්නාහට නූපන්නා වූ ද බෝධ්‍යඞ්ග ධර්මයෝ නූපදිත්. උපන්නා වූ ද බෝධ්‍යඞ්ගධර්මයෝ භාවනායෙන් පිරිපුන් බවට නො යෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 8. 5.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද බෝධ්‍යඞ්ගධර්මයෝ උපදිත් නම්, උපන්නා වූ ද  බෝධ්‍යඞ්ගධර්මයෝ භාවනායෙන් පිරිපුන් බවට යෙත් නම්, මහණෙනි, නුවණින් මෙනෙහි කිරීම වැනි අන් එක  ධර්මයකුදු මම නො දක්මි. මහණෙනි, නුවණින් මෙනෙහි කරන්නාහට නූපන්නා වූ ද බෝධ්‍යඞ්ගධර්මයෝ උපදිත්. උපන්නා වූ ද බෝධ්‍යඞ්ගධර්මයෝ භාවනායෙන් පිරිපුන් බවට යෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 8. 6.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් ඥාති පරිහාණියෙක් වේ නම්, මෙය අල්පමාත්‍ර වූ පරිහාණි යෙකි. මහණෙනි, යම්  ප්‍රඥාපරිහාණියෙක් වේ නම්, පිරිහීම් අතුරෙන් තෙල පිරිහීම නිකෘෂ්ට ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "29"
            },
            {
                "type": "heading",
                "text": "1. 8. 7.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් ඥාතිවෘද්ධියෙක් වේ නම්, මෙය අල්පමාත්‍ර වෘද්ධියෙක. මහණෙනි, යම් ප්‍රඥායෙන් වැඩීමෙක් වේ  නම්, වෘද්ධීන් අතුරෙන් තෙල වෘද්ධිය අග්‍ර වෙයි. මහණෙනි, එහෙයින් මෙහි ලා “ප්‍රඥාවෘද්ධියෙන්  වැඩෙන්නම්හ” යි මෙසේ හික්මිය යුතුය. මහණෙනි, තොප විසින් මෙසේ ම හික්මිය යුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 8. 8.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් භෝගපරිහාණියෙක් වේ නම්, මේ පරිහාණිය අල්ප මාත්‍ර වූවක. මහණෙනි, යම් ප්‍රඥාපරිහාණියෙක් වේ නම්, පරිහාණීන් අතුරෙන් තෙල පරිහාණිය නිකෘෂ්ට වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 8. 9.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් භෝගවෘද්ධියෙක් වේ නම්, මෙය අල්පමාත්‍ර වෘද්ධියෙක. මහණෙනි, ප්‍රඥාවෘද්ධියෙක් වේ නම්, වෘද්ධීන් අතුරෙන් තෙල අග්‍ර වෙයි. මහණෙනි, එහෙයින් මෙහිලා “ප්‍රඥාවෘද්ධියෙන් වැඩෙන්නම්හ” යි මෙසේ  හික්මිය යුතුයි. මහණෙනි, තොප විසින් මෙසේ ම හික්මිය යුතුයි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 8. 10.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් යශස් පරිහාණියෙක් වේ නම්, මෙය අල්පමාත්‍ර පරිහාණියෙක. මහණෙනි, යම් ප්‍රඥාපරිහාණියෙක් වේ නම්, පරිහාණීන් අතුරෙන් තෙල නිකෘෂ්ට වෙයි. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 8. 11.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් යශෝවෘද්ධියෙක් වේ නම්, මෙය අල්පමාත්‍ර වෘද්ධියෙක. මහණෙනි, යම් ප්‍රඥාවෘද්ධියෙක් වේ නම්, එය වෘද්ධීන් අතුරෙන් අග්‍ර වෙයි. මහණෙනි, එහෙයින් මෙහි ලා “ප්‍රඥාවෘද්ධියෙන් වැඩෙන්නම්හ” යි මෙසේ  හික්මිය යුතු ය. මහණෙනි, තොප විසින් මෙසේ ම හික්මිය යුතුයි.",
                "type": "paragraph"
            },
            {
                "text": "අට වන වග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-1-8"
    }
]