{
    "filename": "an-10-5",
    "pages": [
        {
            "pageNum": 520,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "පණ්ණාසාතිරෙක සුත්තානි",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. කරජකායවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10. 5. 1. 1",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පඨමනිරය සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථි)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "දසහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ. කතමෙහි දසහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "1. ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතී හොති ලුද්දො ලොහිතපාණී හතපහතෙ නිවිට්ඨො අදයාපන්නො සබ්බපාණභූතෙසු."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. අදින්නාදායී හොති. යං තං පරස්ස පරචිත්තූපකරණං ගාමගතං වා අරඤ්ඤගතං වා, තං අදින්නං ථෙය්යසඞ්ඛාතං ආදාතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. කාමෙසු මිච්ඡාචාරී හොති. යා තා මාතුරක්ඛිතා පිතුරක්ඛිතා මාතාපිතුරක්ඛිතා භාතුරක්ඛිතා භගිනීරක්ඛිතා ඤාතිරක්ඛිතා ගොත්තරක්ඛිතා ධම්මරක්ඛිතා සස්සාමිකා සපරිදණ්ඩා අන්තමසො මාලා ගුලපරික්ඛිත්තාපි, තථා රූපාසු චාරිත්තං ආපජ්ජිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "4. මුසාවාදී හොති සභාගතො{1} වා පරිසගතො වා ඤාති මජ්ඣගතො වා පූගමජ්ඣගතො වා රාජකුලමජ්ඣගතො වා අභිනීතො සක්ඛිපුට්ඨො ‘එහම්භො පුරිස, යං ජානාහි, තං වදෙහී’ති. සො අජානං වා ආහ ‘ජානාමී’ති. ජානං වා ආහ ‘න ජානාමී’ති අපස්සං වා ආහ, ‘පස්සාමී’ති පස්සං වා ආහ, න පස්සාමී’ති. ඉති අත්තහෙතු වා පරහෙතු වා ආමිසකිඤ්චික්ඛහෙතු වා සම්පජානමුසා භාසිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "5. පිසුනාවාචො හොති, ඉතො සුත්වා අමුත්ර අක්ඛාතා ඉමෙසං භෙදාය, අමුත්ර වා සුත්වා ඉමෙසං අක්ඛාතා අමූසං භෙදාය. ඉති සමග්ගානං වා භෙත්තා, භින්නානං වා අනුප්පදාතා, වග්ගාරාමො වග්ගරතො වග්ගනන්දි වග්ගකරණිං වාචං භාසිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "6. ඵරුසාවාචො හොති, යා සා වාචා අණ්ඩකා කක්කසා පරකටුකා පරාභිසජ්ජනී කොධසාමන්තා අසමාධිසංවත්තනිකා තථාරූපිං වාචං භාසිතා හොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සභාගතො වා හොති පරිසග්ගතො වා - මඡසං,"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "අතිරේක සූත්‍ර",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. කරජකාය වර්ගය",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10.5.1.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පඨමනිරය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්]",
                        "type": "unindented"
                    },
                    {
                        "text": "මහණෙනි, දස කරුණකින් සමන්වාගත වූයේ ගෙනවුත් බහා තැබූයේ යම් සේ නම් එසේ නිරයෙහි නික්ෂිප්ත වෙයි. කවර දස කරුණකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "1. මහණෙනි, මෙ ලොව්හි ඇතැමෙක් රුදුරු කම් ඇතියේ ලෙහෙ වැකුණු අත් ඇතියේ නැසුම් වොලොගැණුම්හි බටුයේ සර්‍වප්‍රාණභුතගණයා කෙරෙහි දයාවට නො පතුයේ ප්‍රාණඝාතී වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. නුදුන්දෑ ගන්නා සුලු වෙයි. ග්‍රාමගත වේවයි අරණ්‍යගත වේවයි. මෙරමාගේ යම් ඒ පරචිත්තොපකරණයෙක් වේ නම් ස්තෙය සඞ්ඛ්‍යාත වූ එ නුදුන් දෑ ගන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. කාමයෙහි මිසහසර ඇත්තේ වෙයි. මාතෘරක්ෂිතා ය, පිතෘරක්ෂිතාය, මාතෘරක්ෂිතාය, භ්‍රාතෘරක්ෂිතාය, භගිනිරක්ෂිතාය, ඥාතිරක්ෂිතාය, ගොත්‍රරක්ෂිතාය, ධර්මරක්ෂිතාය, සස්වාමිකාය, සපරිදණ්ඩාය යටත් පිරිසෙයින් මල්ගුලායෙන් පරික්ෂිප්ත වුවා දැයි යම් ඒ මාගම්හු වෙත් නම් එබන්දන් කෙරෙහි හැසිරෙන බවට පැමිණියේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. සභාගත වේවයි පර්‍ෂද්ගත වේවයි, ඥාතිමධ්‍යගත වේවයි, පූගමධ්‍යගත වේවයි, රාජකුලමධ්‍යගත වේවයි ඉදිරියට කැඳවන ලදුයේ “එම්බා පුරුෂය, එව යමක් දිනිහි නම් එ කියව”යි, සාක්ෂ්‍ය පුළුවුස්නා ලදුයේ මුසාවාදී වෙයි. හේ නො දන්නේ හෝ “දන්මි”යි කියයි. දන්නේ හෝ ‘නො දන්මි’යි කියයි. නො දක්නේ හෝ ‘දක්මි’යි කියයි, දක්නේ හෝ ‘නො දක්මී’යි කියයි, මෙසේ තමා හෙතු කොට වේව යි මෙරමා හෙතු කොට වේවායි කිසියම් ආමිසයක් හෙතුකොට වේවයි, දැන දැන මුසවා බණන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "5. පිසුනුබස් ඇතියේ වෙයි. මොවුන්ගේ භෙදයට මෙ තැනින් අසා කියන්නේ වෙයි. එහි හෝ අසා ඔවුන්ගේ භෙදයට මොවුනට කියන්නේ ය. මෙසේ සමගයන් හෝ බිඳින සුලුවූයේ භින්නයනට හෝ අනුබල දෙන්නේ වර්‍ගයෙහි රැඳියේ වර්‍ගරත වූයේ වර්‍ගයෙහි සතුටු වන්නේ වර්‍ග කරණ වදන් කියන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "6. පරොස්බස් ඇතියේ වෙයි. නො සබැඳි කැකුළු මෙරමා කටුක පරාගටනා ක්‍රොධය වටා ඇති සමාධිට අහිත යම් ඒ තෙපුලක් වේ නම් එබඳු තෙපුල් කියන්නේ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 522,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "7. සම්ඵප්පලාපී හොති අකාලවාදී අභූතවාදී අනත්ථවාදී අධම්මවාදී අවිනයවාදී අනිධානවතිං වාචං භාසිතා හොති අකාලෙන අනපදෙසං අපරියන්තවතිං අනත්ථසංහිතං."
                    },
                    {
                        "type": "paragraph",
                        "text": "8. අභිජ්ඣාලූ හොති යං තං පරස්ස පරචිත්තූපකරණං, තං අභිජ්ඣිතා හොති, ‘අහොවත{1} යං පරස්ස තං මම අස්සා’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "9. බ්යාපන්නචිත්තො හොති පදුට්ඨමනසඞ්කප්පො, ‘ඉමෙ සත්තා හඤ්ඤන්තු වා බජ්ඣන්තු වා උච්ඡිජ්ජන්තු වා විනස්සන්තු වා මා වා අහෙසුන්ති”."
                    },
                    {
                        "type": "paragraph",
                        "text": "10. මිච්ඡාදිට්ඨිකො හොති විපරීතදස්සනො, ‘නත්ථි දින්නං, නත්ථි යිට්ඨං, නත්ථි හුතං, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො, නත්ථි අයං ලොකො, නත්ථි පරො ලොකො, නත්ථි මාතා, නත්ථි පිතා, නත්ථි සත්තා ඔපපාතිකා, නත්ථි ලොකෙ සමණබ්රාහ්මණා සම්මග්ගතා සම්මාපටිපන්නා යෙ ඉමඤ්ච ලොකං පරඤ්ච ලොකං සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදෙන්තී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ දසහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "දසහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙ. කතමෙහි දසහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "1. ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතං පහාය පාණාතිපාතා පටිවිරතො හොති, නිහිතදණ්ඩො නිහිතසත්ථො, ලජ්ජී දයාපන්නො සබ්බපාණභූතහිතානුකම්පී විහරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. අදින්නාදානං පහාය අදින්නාදානා පටිවිරතො හොති, යං තං පරස්ස පරචිත්තූපකරණං ගාමගතං වා අරඤ්ඤගතං වා, න තං අදින්නං ථෙය්යසඞ්ඛාතං ආදාතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. කාමෙසු මිච්ඡාචාරං පහාය කාමෙසු මිච්ඡාචාරා පටිවිරතො හොති. යා තා මාතුරක්ඛිතා, පිතුරක්ඛිතා, මාතාපිතුරක්ඛිතා, භාතු රක්ඛිතා, භගිනීරක්ඛිතා, ඤාතිරක්ඛිතා, ගොත්තරක්ඛිතා, ධම්මරක්ඛිතා, සස්සාමිකා සපරිදණ්ඩා අන්තමසො මාලාගුලපරික්ඛිත්තාපි, තථාරූපාසු න චාරිත්තං ආපජ්ජිතා හොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. වතායං - සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "7. අකාලවාදී ව අභූතවාදී ව අනර්ථවාදී ව අධර්මවාදී ව අවිනයවාදී ව සම්ඵප්‍රලාප කියන සුලු වෙයි. සිත්හිලා නො දැරිය යුතු නො කල්හි කරුණු රහිත පරිච්ඡෙද රහිත අනර්ථය ඇසුරු කළ බස් කියන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "8. අභිධ්‍යා බහුල කොට ඇත්තේ වෙයි, මෙරමාගේ යම් ඒ පරචිත්තොපකරණයෙක් වේ නම්, “අහෝ, ඒ කැතින් යමක් මෙරමාගේ වේ නම් එ මට වේව”යි. එය ගිජුසිතින් පතනේ වෙයි,",
                        "type": "paragraph"
                    },
                    {
                        "text": "9. ප්‍ර‍දුෂ්ටමනඃ සඞ්කල්ප ඇතියේ “මෙ සත්හු නැසෙත් වායි හෝ බැඳෙත්වයි හෝ මුලුසුන් වෙත්වයි හෝ වැනසෙත්වයි හෝ නහමක් වෙත්වයි හෝ” ව්‍යාපාදයට පත් සිතැතියේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "10. දුන්දැයෙහි පල නැත, යාගයෙහි නැත, හෝමයෙහි පල නැත, සුකෘත දුෂ්කෘත කර්මයන්ගේ ඵල විපාක නැත, මෙලෝ නැත, පරලෝ නැත, මවක් නැත, පියෙක් නැත, ඖපපාදුක සත්ත්‍වයෝ නැත, ලොව්හි යහමගට ගිය මනා පිළිවෙත් සපන් යමෙක් තුමූ මෙලෝ හා පරලෝ හා තුමූ විශිෂ්ටඥානයෙන් දැන සාක්ෂාත් කොට සකසා දනිත් නම් එ බඳු මහණබමුණෝ නැත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ දසකරුණින් සමන්වාගත වූයේ ගෙනවුත් බහා තැබුයේ යම් සේ නම් එසේ නිරාහි නික්ෂිප්ත වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, දසකරුණෙකින් සමන්වාගත වූයේ ගෙනවුත් තැබූයේ යම් සේ නම් එසේ ස්වර්‍ගයෙහි නික්ෂිප්ත වෙයි. කවර දසයකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "1. මහණෙනි, මෙ ලොව්හි ප්‍රාණඝාතය දුරු කොට බහා තැබූ දඬු ඇතියේ බහා තැබූ අවි ඇතියේ ලජ්ජා ඇතියේ දයාපත් වූයේ ප්‍රාණඝාතයෙන් වැළැක්කේ වෙයි. සර්‍වප්‍රාණභූතගණයා කෙරෙහි හිතානුකම්පීව වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. අයිනාදන් හැර පියා අයිනාදනින් වැළැක්කේ වෙයි. ග්‍රාමගත වේවයි අරණ්‍යගත වේවයි මෙරමාගේ විත්තොපකරණයෙක් වේ නම් ස්තෙය සඞ්ඛ්‍යාත ඒ නුදුන් දෑ ගන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. කාමමිථ්‍යාචාරය හැර පියා කාමමිථ්‍යාචාරයෙන් වැළැක්කේ වෙයි. මාතෘරක්ෂිතා ය, පිතෘරක්ෂිතාය, මාතෘපිතෘ රක්ෂිතාය, භ්‍රාතෘරක්ෂිතාය, භගිනිරක්ෂිතාය, ඥාතිරක්ෂිතාය, ගොත්‍රරක්ෂිතාය, ධර්මරක්ෂිතාය, සස්වාමිකාය, සපරිදණ්ඩාය යටත් පිරිසෙයින් මල්ගුලායෙන් පරික්ෂිප්ත වු දැයි යම් ඒ මාගම්හු වෙත් නම් එබන්දන් කෙරෙහි නො හැසිරෙන බවට පැමිණෙන්නේ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 524,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "4. මුසාවාදං පහාය මුසාවාදා පටිවිරතො හොති. සභාගතො වා පරිසගතො වා ඤාතිමජ්ඣගතො වා පූගමජ්ඣගතො වා රාජකුලමජ්ඣගතො වා අභිනීතො සක්ඛිපුට්ඨො, “එහම්භො පුරිස, යං __ජා__නාහි, තං වදෙහී”ති. සො අජානං වා ආහ: ‘න ජානාමී’ති. ජානං වා ආහ, ‘ජානාමී’ති, අපස්සං වා ආහ ‘න පස්සාමී’ති. පස්සං වා ආහ, ‘පස්සාමී’ති. ඉති අත්තහෙතු වා පරහෙතු වා ආමිසකිඤ්චික්ඛහෙතු වා න සම්පජානමුසා භාසිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "5. පිසුනං වාචං පහාය පිසුනාය වාචාය පටිවිරතො හොති. න ඉතො සුත්වා අමුත්ර අක්ඛාතා ඉමෙසං භෙදාය, අමුත්ර වා සුත්වා ඉමෙසං අක්ඛාතා අමූසං භෙදාය, ඉති භින්නානං වා සන්ධාතා සහිතානං වා අනුප්පදාතා සමග්ගාරාමො සමග්ගරතො සමග්ග නන්දී සමග්ගකරණිං වාචං භාසිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "6. ඵරුසං වාචං පහාය ඵරුසාය වාචාය පටිවිරතො හොති. යා තා වාචා නෙලා කණ්ණසුඛා පෙමණීයා හදයඞ්ගමා පොරී බහුජනකන්තා බහුජනමනාපා තථාරූපිං වාචං භාසිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "7. සම්ඵප්පලාපං පහාය සම්ඵප්පලාපා පටිවිරතො හොති. කාලවාදී භූතවාදී අත්ථවාදී ධම්මවාදී විනයවාදී නිධානවතිං වාචං භාසිතා හොති, කාලෙන සාපදෙසං පරියන්තවතිං අත්ථසංහිතං."
                    },
                    {
                        "type": "paragraph",
                        "text": "8. අනභිජ්ඣාලූ හොති, යං තං පරස්ස පරචිත්තූපකරණං, තං අනභිජ්ඣිතා හොති, “අහො වත යං පරස්ස තං මම අස්සා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "9. අබ්යාපන්නචිත්තො හොති අප්පදුට්ඨමනසඞ්කප්පො, ‘ඉමෙ සත්තා අවෙරා හොන්තු අව්යාපජ්ජා අනීඝා සුඛී අත්තානං පරිහරන්තු”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "4. මුසාවාදය හැරපියා මුසාවායෙන් වැළැක්කේ වෙයි. සභාගත වේවයි, පර්‍ෂද්ගත වේවයි, ඥාතිමධ්‍යගත වේවයි, පූගමධ්‍යගත වේවයි, රාජකුලමධ්‍යගත වේවයි, කැඳවනු ලදුයේ “එම්බා පුරුෂයා, එව යමක් දනිහි නම් එ කියව”යි සාක්ෂ්‍ය පුළුවුස්නා ලදුයේ වෙයි. හේ නො දන්නේ හෝ ‘නොදන්මි’යි කියයි. දන්නේ හෝ ‘දන්මි’යි කියයි, නො දක්නේ හෝ ‘නො දක්මි’යි කියයි. දක්නේ හෝ ‘දක්මි’යි කියයි. මෙසේ තමා හෙතු කොට හෝ මෙරමා හෙතු කොට හෝ කිසි ආමිෂයක් හෙතු කොට හෝ දැන දැන මුසවා නො කියන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "5. පිසුනුබස් හැරපියා පිසුනු බසින් වැළැකියේ වෙයි. මෙයින් අසා මොවුන්ගේ භෙදය සඳහා එහි නො කියනේ ය, එ තන්හි හෝ අසා මොවුන්ගේ භෙදය සඳහා මොවුනට නො කියන්නේ ය. මෙසේ බිඳුනවුන් හෝ සන්‍ධාන කරණුයේ සමගයනට හෝ අනුබල දෙනුයේ සමගියෙහි ඇලුමැතියෝ සමගයන් කෙරෙහි රැඳියේ සමග වූවන් දැක තුස්නේ සමග කරනු බස් කියන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "6. පරොස්බස් හැරපියා පරොස් බසින් වැළැකියේ වෙයි, යම් ඒ බසෙක් නිදොස් වේ ද, කනට සුව එළවා ද, ප්‍රේම දනවා ද හාදයාඞ්ගම වේ ද ගුණෙන් පිරිපුන් වේ ද, බොහෝ දෙනාට කාන්ත වේ ද, බොහෝ දෙනාට මනවඩා ද එ බඳු බස් කියන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "7. සම්ඵප්‍රලාප හැරපියා සම්ඵප්‍ර‍ලාපයෙන් වැළැකියේ වෙයි. කාලවාදි ව භූතවාදී ව අර්ථවාදී ව ධර්මවාදී ව විනයවාදී ව ලෙහි රඳවා ගතයුතු බස් කල්හි සකරුණු කොට පර්‍ය්‍යන්තවත් කොට සහිත කොට කියන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "8. අභිධ්‍යා බහුල කොට නැත්තේ වෙයි. මෙරමාගේ යම් ඒ පරචිත්තෝපකරණයෙක් වේ නම්, එය “අහෝ, යමක් මෙරමාගේ වේ නම්, එය මට වේව”යි ගිජු සිතින් නො පතන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "9. “මෙ සත්ත්‍වයෝ වෛර නැත්තාහු ව්‍යාපාද නැත්තාහු දුක් නැත්තාහු සැප ඇත්තාහු ආත්මපරිහරණ කෙරෙත්වා” අප්‍ර‍දුෂ්ට මනස්සඞ්කල්ප ඇතියේ ව්‍යාපාදයට නො පත් සිත් ඇත්තේ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 526,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "10. සම්මාදිට්ඨිකො හොති අවිපරීතදස්සනො, ‘අත්ථි දින්නං අත්ථි යිට්ඨං, අත්ථි හුතං, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො, අත්ථි අයං ලොකො, අත්ථි පරො ලොකො, අත්ථි මාතා, අත්ථි පිතා, අත්ථි සත්තා ඔපපාතිකා, අත්ථි ලොකෙ සමණබ්රාහ්මණා සම්මග්ගතා, සම්මා පටිපන්නා, යො ඉමඤ්ච ලොකං පරඤ්ච ලොකං සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදෙන්තී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ දසහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 5. 1. 2",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතියනිරය සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දසහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ. කතමෙහි දසහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතී හොති ලුද්දො ලොහිතපාණී හතපහතෙ නිවිට්ඨො අදයාපන්නො සබ්බපාණභූතෙසු. අදින්නාදායී හොති -පෙ- කාමෙසු මිච්ඡාචාරී හොති -පෙ- මුසාවාදී හොති -පෙ- පිසුනාවාචො හොති -පෙ- ඵරුසාවාචො හොති -පෙ- සම්ඵප්පලාපී හොති -පෙ- අභිජ්ඣාලූ හොති -පෙ- ව්යාපන්නචිත්තො හොති -පෙ- මිච්ඡාදිට්ඨිකො හොති විපරීතදස්සනො, ‘නත්ථි දින්නං, නත්ථි යිට්ඨං, නත්ථි හුතං, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො, නත්ථි අයං ලොකො, නත්ථි පරො ලොකො, නත්ථි මාතා, නත්ථි පිතා, නත්ථි සත්තා ඔපපාතිකා, නත්ථි ලොකෙ සමණබ්රාහ්මණා සම්මග්ගතා සම්මාපටිපන්නා යෙ ඉමඤ්ච ලොකං පරඤ්ච ලොකං සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදෙන්තී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ දසහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "දසහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙ. කතමෙහි දසහි:"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "10. ‘දුන් දෑ පල ඇත, යාගයෙහි පල ඇත, හෝමයෙහි පල ඇත, සුකෘතදුෂ්කෘතයන්ගේ ඵල විපාක ඇත. මෙ ලෝ ඇත, පරලෝ ඇත, මවු ඇත, පියා ඇත, ඖපපාදුකසත්ත්‍වයෝ ඇත, ලොව්හි සම්‍යග්ගතව සම්‍යක්ප්‍රතිපත්තියට පත්ව යමෙක් මෙලෝ හා පරලෝ හා තුමු විශිෂ්ට ඥානයෙන් දැන පසක් කොට දන්නාහු නම් එබඳු මහණ බමුණෝ ඇතැ”යි අවිපරීතදර්‍ශන ඇති සම්‍යග් දෘෂ්ටික වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ දසකරුණෙන් සමන්වාගත වූයේ (හිසින්) ගෙනා දැයක් යම්සේ බහා තැබුයේ වේ නම් එසේ ස්වර්‍ගයෙහි නික්ෂිප්ත වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10.5.1.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතියනිරය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, දස කරුණෙකින් සමන්වාගත වූයේ ගෙන එන ලද්ද බහාතැබුයේ යම්සේ වේ නම් එසේ නිරයෙහි නික්ෂිප්ත වෙයි. කවර දසයෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙලොව්හි ඇතැමෙක් රුදුරු කම් ඇතියේ ලෙහෙයින් වැකුණු අත් ඇතියේ නැසුම් වෙලො ගැනුම්හි බටුයේ හැම සතුන් කෙරෙහි දයාවට නො පැමිණියේ ප්‍රාණඝාතී වෙයි. නුදුන්දෑ ගන්නා සුළු වෙයි. ... කාමයන්හි මිසහසර ඇතියේ වෙයි. ... මුසවා කියන්නේ වෙයි ... පිසුනුබස් ඇතියේ වෙයි .... පරොස් බස් ඇතියේ වෙයි ... සම්ඵප්‍ර‍ලාප ඇතියේ වෙයි ... අභිධ්‍යා බහුල කොටැතියේ වෙයි ... ව්‍යාපාදයට පත් සිතැතියේ වෙයි ... “දුන් දෑ පල නැත, යාගයෙහි පල නැත, හෝමයෙහි පල නැත, සුකෘතදුෂ්කෘතයෙහි ඵල විපාක නැත, මෙලෝ නැත, පරලෝ නැත, මවු නැත, පියා නැත, ඖපපාදුක සත්ත්‍වයෝ නැත, ලොකයෙහි යමෙක් තුමූ ම මෙලෝ හා පරලෝ හා විශිෂ්ටඥානයෙන් දැන පසක්කොට ප්‍රකට කොට දනිත් නම් එ බඳු මහණ බමුණෝ නැතැ”යි විපරිතදර්‍ශන ඇති මිථ්‍යාදෘෂ්ටික වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ දස කරුණින් සමන්වාගත වූයේ ගෙන එන ලද්දක් බහා තැබූයේ යම්සේ නම් එසේ නිරයෙහි නික්ෂිප්ත වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, දස කරුණෙකින් සමන්වාගත වූයේ ගෙන එන ලද්දක් බහා තැබුයේ යම්සේ වේ නම් එසේ ස්වර්‍ගයෙහි නික්ෂිප්ත වෙයි. කවර දසයෙක යත්:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 528,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතං පහාය පාණාතිපාතා පටිවිරතො හොති, නිහිතදණ්ඩො නිහිතසත්ථො, ලජ්ජී දයාපන්නො සබ්බපාණභූතහිතානුකම්පී විහරති. අදින්නාදානං පහාය අදින්නාදානා පටිවිරතො හොති -පෙ- කාමෙසු මිච්ඡාචාරං පහාය කාමෙසු මිච්ඡාචාරා පටිවිරතො හොති -පෙ- මුසාවාදං පහාය මුසාවාදා පටිවිරතො හොති -පෙ- පිසුනං වාචං පහාය පිසුනා වාචා පටිවිරතො හොති -පෙ- ඵරුසං වාචං පහාය ඵරුසාය වාචාය පටිවිරතො හොති -පෙ- සම්ඵප්පලාපං පහාය සම්ඵප්පලාපා පටිවිරතො හොති -පෙ- අනභිජ්ඣාලූ හොති -පෙ- අබ්යාපන්නචිත්තො හොති -පෙ- සම්මා දිට්ඨිකො හොති අවිපරීතදස්සනො, ‘අත්ථි දින්නං අත්ථි යිට්ඨං, අත්ථි හුතං, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො, අත්ථි අයං ලොකො, අත්ථි පරො ලොකො, අත්ථි මාතා, අත්ථි පිතා, අත්ථි සත්තා ඔපපාතිකා, අත්ථි ලොකෙ සමණබ්රාහ්මණා සම්මග්ගතා, සම්මා පටිපන්නා, යෙ ඉමඤ්ච ලොකං පරඤ්ච ලොකං සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදෙන්තී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ දසහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 5. 1. 3",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මාතුගාම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දසහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො මාතුගාමො යථාභතං නික්ඛිත්තො එවං නිරයෙ. කතමෙහි දසහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "පාණාතිපාතී හොති අදින්නාදායී හොති, කාමෙසු මිච්ඡාචාරී හොති, මුසාවාදී හොති, පිසුනා වාචො හොති, ඵරුසා වාචො හොති, සම්ඵප්පලාපී හොති, අභිජ්ඣාලූ හොති, ව්යාපන්න චිත්තො හොති, මිච්ඡා දිට්ඨිකො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ දසහි ධම්මෙහි සමන්නාගතො මාතුගාමො යථාභතං නික්ඛිත්තෙ එවං නිරයෙ."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි ඇතැමෙක් බහා තැබූ දඬු ඇතියේ බහා තැබූ අවි ඇතියේ ලජ්ජා ඇතියේ ප්‍රාණඝාතය හැරපියා ප්‍රාණඝාතයෙන් වැළැකියේ වෙයි. දයාවට පැමිණියේ සවුසතුන් කෙරෙහි හිතානුකම්පා ඇතියේ වාසය කරයි. අයිනාදන් හැර පියා අයිනාදනින් වැළැකියේ වෙයි ... කාමයන්හි මිසහසර හැරපියා කාමයන්හි මිසහසරින් වැළැකියේ වෙයි ... මුසවා හැරපියා මුසවායෙන් වැළැකියේ වෙයි ... පිසුනු බස් හැර පියා පිසුනු බසින් වැළැකියේ වෙයි ... පරොස් බස් හැර පියා පරොස් බසින් වැළැකියේ වෙයි … සම්ඵප්‍රලාපය හැරපියා සම්ඵප්‍රලාපයෙන් වැළකියේ වෙයි ... අභිධ්‍යා බහුල කොටැතියේ නො වෙයි ... ව්‍යාපාදයට නො පත් සිතැතියේ වෙයි ... “දුන්දැයෙහි පල ඇති, යාගයෙහි පල ඇත, හෝමයෙහි පල ඇත, සුකෘත දුෂ්කෘතයන්ගේ ඵල විපාක ඇත, මෙලෝ ඇත, පරලෝ ඇත, මවු ඇත, පියා ඇත, ඖපපාදුක සත්ත්‍වයෝ ඇත, යමෙක් තුමූ මෙලෝ හා පරලෝ හා විශිෂ්ටඥානයෙන් දැන පසක් කොට මොනොවට දක්නාහු නම්, එ බඳු සම්‍යග්ගත සම්‍යක්ප්‍ර‍තිපන්න මහණ බමුණෝ ඇතැ”යි අවිපරිත දර්‍ශන ඇතියේ සම්‍යග් දෘෂ්ටික වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ දස කරුණින් සමන්වාගත වූයේ ගෙන එනලද දැයක් බහා තැබූයේ යම්සේ නම් එසේ ස්වර්‍ගයෙහි නික්ෂිප්ත වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10.5.1.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මාතුගාම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, දසකරුණෙකින් සමන්වාගත මාගම් ගෙන එන ලද දැයක් බහා තැබුයේ යම් සේ වේ නම් එසේ නිරයෙහි නික්ෂිප්ත වෙයි. කවර දසයෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ප්‍රාණඝාතී වෙයි, නුදුන් දැ ගන්නේ වෙයි, කාමයන්හි මිසහසර ඇතියේ වෙයි, මුසවා කියන්නේ වෙයි, පිසුනු බස් ඇතියේ වෙයි, පරොස් බස් ඇතියේ වෙයි, සම්ප්‍ර‍ඵලාප ඇතියේ වෙයි, අභිධ්‍යා බහුලකොට ඇත්තේ වෙයි, ව්‍යාපාදයට වන් සිතැත්තේ වෙයි, මිථ්‍යාදෘෂ්ටික වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ දස කරුණින් සමන්වාගත මාගම ගෙන එන ලද දැයක් බහා තැබූයේ යම් සේ නම්, එසේ නිරයෙහි නික්ෂිප්ත වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 530,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "දසහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො මාතුගාමො යථාභතං නික්ඛිත්තො එවං සග්ගෙ. කතමෙහි දසහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "පාණාතිපාතා පටිවිරතො හොති, අදින්නාදානා පටිවිරතො හොති, කාමෙසු මිච්ඡාචාරා පටිවිරතො හොති, මුසාවාදා පටිවිරතො හොති, පිසුනාය වාචාය පටිවිරතො හොති, ඵරුසාය වාචාය පටිවිරතො හොති, සම්ඵප්පලාපා පටිවිරතො හොති, අනභිජ්ඣාලූ හොති, අබ්යාපන්නචිත්තො හොති, සම්මාදිට්ඨිකො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ දසහි ධම්මෙහි සමන්නාගතො මාතුගාමො යථාභතං නික්ඛිත්තො එවං සග්ගෙති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 5. 1. 4",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උපාසිකා සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දසහි භික්ඛවෙ ධම්මෙහි සමන්නාගතා උපාසිකා යථාභතං නික්ඛිත්තා එවං නිරයෙ. කතමෙහි දසහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "පාණාතිපාතිනී හොති, අදින්නාදායිනී හොති, කාමෙසු මිච්ඡාචාරිණී හොති, මුසාවාදිනී හොති, පිසුනාවාචා හොති, ඵරුසාවාචා හොති, සම්ඵප්පලාපිනී හොති, අභිජ්ඣාලූනී හොති, බ්යාපන්න චිත්තා හොති, මිච්ඡාදිට්ඨිකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ දසහි ධම්මෙහි සමන්නාගතා උපාසිකා යථාභතං නික්ඛිත්තා එවං නිරයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "දසහි භික්ඛවෙ ධම්මෙහි සමන්නාගතා උපාසිකා යථාභතං නික්ඛිත්තා එවං සග්ගෙ. කතමෙහි දසහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "පාණාතිපාතා පටිවිරතා හොති -පෙ- සම්මාදිට්ඨිකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ දසහි ධම්මෙහි සමන්නාගතා උපාසිකා යථාභතං නික්ඛිත්තා එවං සග්ගෙති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, දස කරුණෙකින් සමන්වාගත මාගම ගෙන එන ලද දැයක් බහා තැබූයේ යම්සේ නම්, එසේ ස්වර්‍ගයෙහි නික්ෂිප්ත වෙයි. කවර දශයෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "පණිවයෙන් වැළැකියේ වෙයි. අයිනාදනින් වැළැකියේ වෙයි. කාමයෙහි මිසහසරින් වැළැකියේ වෙයි. මුසවායෙන් වැළැකියේ වෙයි. පිසිනු බසින් වැළැකියේ වෙයි. පරොස්බසින් වැළැකියේ වෙයි. සම්ප්‍ර‍ඵලාපයෙන් වැළැකියේ වෙයි. අභිධ්‍යා බහුල කොට නැතියේ වෙයි. ව්‍යාපාදයට පත් සිත් නැතියේ වෙයි. සම්‍යග් දෘෂ්ටික වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ දස කරුණින් සමන්වාගත මාගම ගෙන එන ලද දැයක් බහා තැබුයේ යම්සේ නම්, එසේ ස්වර්‍ගයෙහි නික්ෂිප්ත වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10.5.1.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උපාසිකා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, දස කරුණෙකින් සමන්වාගත උවැසි ගෙන එන ලද දැයක් බහා තැබුයේ යම් සේ නම් එසේ නිරයෙහි නික්ෂිප්ත වෙයි. කවර දසයෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "පණිවා කරන්නී වෙයි. නුදුන් දෑ ගන්නී වෙයි. කාමයන්හි මිස හසර ඇත්තී වෙයි. මුසවා කියන්නී වෙයි. පිසුනු බස් ඇත්තී වෙයි. පරොස් බස් ඇත්තී වෙයි. සම්ප්‍ර‍ඵලාප ඇත්තී වෙයි. අභිධ්‍යා බහුල කොට ඇත්තී වෙයි, ව්‍යාපාදයට අවන් සිත් ඇත්තී වෙයි. මිසදිටු ඇත්තී වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "මහණෙනි, මෙ දස කරුණින් සමන්වාගත උවැසි ගෙන එන ලද දැයක් බහා තැබූයේ යම්සේ ද, එසේ නිරයෙහි නික්ෂිප්ත වෙයි."
                    },
                    {
                        "text": "මහණෙනි, දසකරුණෙකින් සමන්වාගත උවැසි ගෙන එන ලද දැයක් බහා තැබුයේ යම්සේ වේ ද එසේ ස්වර්‍ගයෙහි නික්ෂිප්ත වෙයි. කවර දසයෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "පණිවායෙන් වැළැකියා වෙයි .... සම්දිටු ඇත්තී වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ දස කරුණින් සමන්වාගත උවැසි ගෙන එන ලද දෙයක් බහාතැබුයේ යම්සේ වේද, එසේ ස්වර්‍ගයෙහි නික්ෂිප්ත වේ යයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 532,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 5. 1. 5",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "විසාරද සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දසහි භික්ඛවෙ ධම්මෙහි සමන්නාගතා උපාසිකා අවිසාරදා අගාරං අජ්ඣාවසති. කතමෙහි දසහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "පාණාතිපාතිනී හොති, අදින්නාදායිනී හොති, කාමෙසු මිච්ඡාචාරිනී හොති, මුසාවාදිනී හොති, පිසුනාවාචා හොති, ඵරුසවාචා හොති, සම්ඵප්පලාපිනී හොති, අභිජ්ඣාලූනී හොති, බ්යාපන්නචිත්තා හොති, මිච්ඡාදිට්ඨිකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ දසහි ධම්මෙහි සමන්නාගතා උපාසිකා අවිසාරදා අගාරං අජ්ඣාවසති."
                    },
                    {
                        "type": "paragraph",
                        "text": "දසහි භික්ඛවෙ ධම්මෙහි සමන්නාගතා උපාසිකා විසාරදා අගාරං අජ්ඣාවසති. කතමෙහි දසහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "පාණාතිපාතා පටිවිරතා හොති, අදින්නාදානා පටිවිරතා හොති, කාමෙසු මිච්ඡාචාරා පටිවිරතා හොති, මුසාවාදා පටිවිරතා හොති, පිසුනාය වාචාය පටිවිරතා හොති, ඵරුසාය වාචාය පටිවිරතා හොති, සම්ඵප්පලාපා පටිවිරතා හොති, අනභිජ්ඣාලුනී හොති, අබ්යාපන්නචිත්තා හොති, සම්මාදිට්ඨිකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ දසහි ධම්මෙහි සමන්නාගතා උපාසිකා විසාරදා අගාරං අජ්ඣාවසතීති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 5. 1. 6",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සංසප්පනිය පරියාය සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සංසප්පනියපරියායං වො භික්ඛවෙ දෙසිස්සාමි තං සුණාථ, සාධුකං මනසිකරොථ, භාසිස්සාමීති. එවං භන්තෙති ඛො තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච සො භික්ඛවෙ සංසප්පනීයපරියායො ධම්මපරියායො:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කම්මස්සකා භික්ඛවෙ සත්තා කම්මදායාදා කම්මයොනි කම්මබන්ධු කම්මපටිසරණා, යං කම්මං කරොන්ති කල්යාණං වා පාපකං වා තස්ස දායාදා භවන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10.5.1.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "විසාරද සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, දස කරුණෙකින් සමන්වාගත අවිශාරද උපාසිකා තොමෝ ගිහිගෙයි වසයි. කවර දසයෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "පණිවා කරන්නී වෙයි. නුදුන් දෑ ගන්නී වෙයි, කාමයන්හි මිසහසර ඇත්තී වෙයි, මුසවා කියන්නී වෙයි, පිසුනුබස් ඇත්තී වෙයි, පරොස්බස් ඇත්තී වෙයි, සම්ප්‍ර‍ඵලාප ඇත්තී වෙයි. අභිධ්‍යා බහුල කොට ඇත්තී වෙයි. ව්‍යාපාදයට අවන් සිතැත්තී වෙයි. මිසදිටු ඇත්තී වෙයි,",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "මහණෙනි, මෙ දස කරුණින් සමන්වාගත උපාසිකා තොමෝ අවිශාරද වූවා ගිහිගෙයි වසයි."
                    },
                    {
                        "text": "මහණෙනි, දස කරුණෙකින් සමන්වාගත විශාරද උපාසිකා තොමෝ ගිහිගෙයි වසයි. කවර දසයෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "පණිවායෙන් වැළැකියා වෙයි, අයිනාදනින් වැළැකියා වෙයි, කාමයන්හි මිස හසරින් වැළැකියා වෙයි, මුසවායෙන් වැළැකියා වෙයි, පිසුනුබසින් වැළැකියා වෙයි, පරොස් බසින් වැළැකියා වෙයි, සම්ප්‍ර‍ඵලාපයෙන් වැළැකියා වෙයි. අභිධ්‍යා බහුල කොට නැත්තී වෙයි. ව්‍යාපාදයට පත් සිත් නැත්තී වෙයි. සම්‍යග්දෘෂ්ටි ඇත්තී වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ දස කරුණින් යුත් උපාසිකා තොමෝ විශාරද වූවා ගිහිගෙයි වසයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10.5.1.6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සංසප්පනිය පරියාය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට සංසර්‍පණීය පර්‍ය්‍යාය දෙසන්නෙමි. එ අසවු, මොනොවට මෙනෙහි කරවු. කියන්නෙමි යි. එසේ ය, වහන්සැයි එ මහණහු භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වූහ. භාග්‍යවතුන් වහන්සේ තෙල වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සංසර්‍පණීය පර්‍ය්‍යාව නම් වූ එ ධර්‍මපර්‍ය්‍යාය කවරේය යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සත්හු කර්‍මය දායාද්‍ය කොට ඇත්තාහු කර්‍මය කරණ කොට ඇත්තාහු කර්‍මය බන්‍ධු කොට ඇත්තාහු කර්‍මය පිළිසරණ කොට ඇත්තාහු කර්‍මස්වකයහ. කලණ වේවයි ලමු වේවයි යම් ම කර්‍මයක් කෙරෙත් නම් එයට දායාද වෙත්.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 534,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතී හොති ලුද්දො ලොහිතපාණී හතපහතෙ නිවිට්ඨො අදයාපන්නො සබ්බපාණභූතෙසු, සො සංසප්පති කායෙන, සංසප්පති වාචාය, සංසප්පති මනසා, තස්ස ජිම්හං කායකම්මං හොති, ජිම්හං වචීකම්මං, ජිම්හං මනොකම්මං, ජිම්හා ගති, ජිම්හුපපත්ති. ජිම්හගතිකස්ස ඛො පනාහං භික්ඛවෙ ජිම්හුපපත්තිකස්ස ද්වින්නං ගතීනං අඤ්ඤතරං ගතිං වදාමි, යෙ වා එකන්ත දුක්ඛා නිරයා, යා වා සංසප්පජාතිකා තිරච්ඡානයොනි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමා ච සා භික්ඛවෙ සංසප්පජාතිකා තිරච්ඡානයොනි: අහිවිච්ඡිකා, සතපදී, නකුලා, බිළාරා, මූසිකා, උලූකා, යෙ වා පනඤ්ඤෙ පි කෙචි තිරච්ඡාන යොනිකා සත්තා මනුස්සෙ දිස්වා සංසප්පන්ති. ඉති ඛො භික්ඛවෙ භූතා භූතස්ස උපපත්ති හොති, යං කරොති, තෙන උපපජ්ජති, උපපන්නමෙතං ඵස්සා ඵුසන්ති. එවංපහං භික්ඛවෙ කම්මදායාදා සත්තා ති වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො අදින්නාදායී හොති -පෙ- කාමෙසු මිච්ඡාචාරී හොති -පෙ- මුසාවාදී හොති -පෙ- පිසුනවාචො හොති -පෙ- ඵරුසවාචො හොති -පෙ- සම්ඵප්පලාපී හොති -පෙ- අභිජ්ඣාලූ හොති -පෙ- බ්යාපන්නචිත්තො හොති -පෙ- මිච්ඡාදිට්ඨිකො හොති විපරීතදස්සනො:"
                    },
                    {
                        "type": "paragraph",
                        "text": "’නත්ථි දින්නං -පෙ- නත්ථි ලොකෙ සමණබ්රාහ්මණා සම්මග්ගතා සම්මාපටිපන්නා, යෙ ඉමඤ්ච ලොකං පරඤ්ච ලොකං සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදෙන්තී”ති. සො සංසප්පති කායෙන, සංසප්පති වාචාය, සංසප්පති මනසා, තස්ස ජිම්හං කායකම්මං හොති, ජිම්හං වචීකම්මං, ජිම්හං මනොකම්මං, ජිම්හා ගති, ජිම්හුපපත්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ජිම්හගතිකස්ස ඛො පනාහං භික්ඛවෙ ජිම්හුපපත්තිකස්ස ද්වින්නං ගතීනං අඤ්ඤතරං ගතිං වදාමි, යෙ වා එකන්තදුක්ඛා නිරයා, යා වා සංසප්පජාතිකා තිරච්ඡානයොනි. {1}"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. __සං සප්පති පරියායං__ - අට්ඨකථා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි ඇතැමෙක් රුදුරුකම් ඇතියේ ලෙහෙවැකි අත් ඇතියේ නැසුම්හි හා වොලො ගැණුම් හි බටුයේ සර්‍වප්‍රාණභූත ගණයා කෙරෙහි දයාරහිත වූයේ ප්‍රාණඝාතී වෙයි. හෙ කයින් සංසර්‍පණ (කර්ම) කෙරෙයි, වචනයෙන් සංසර්‍පණ කෙරෙයි. මනසින් සංසර්‍පණ කෙරෙයි, ඔහුගේ වක්‍ර‍කාය කර්‍මය වෙයි, වක්‍ර‍වාක්කර්‍මය වෙයි, වක්‍ර‍ මනඃ කර්‍මය වෙයි, වක්‍රගති වෙයි, චක්‍ර‍ උප්පත්ති වෙයි, මහණෙනි, මම වක්‍ර‍ගති ඇති වක්‍ර‍ උපපත්ති ඇතියහුට යම් බඳු එකැතින් දුක් ඇති නිරයෝ වෙත් නම් යම් බඳු සංසර්‍පණ ස්වාභාව ඇති තිරිසන් යොන්හු වෙත් නම් එ දෙගතියෙන් එක්තරා ගතියක් කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සංසර්‍පණස්වාභාව ඇති ඒ තිරශ්චීනයොනිය කවර: සර්‍පයහ වෘශ්චිකා යහ, ශතපදීහුය, නකුල යහ, විඩාල යහ, මූෂිකා යහ, උලුකය හයි. යම් බඳු කිසියම් තිරශ්චීන යොනියෙහි උපන් සත්ත්‍වකෙනෙක් මිනිසුන් දැක හැකිලෙත් නම් ඔහු හෝ යි. මහණෙනි, මෙසේම විද්‍යාමාන කර්‍මයෙන් සත්ත්‍වයාගේ උපපත්තිය වෙයි, යමක් කෙරේ නම් එයින් උපදනේය. උපන් ඔහු විපාක ස්පර්‍ශයෝ පහසිත්, මහණෙනි, මෙසේ ද මම් සත්ත්‍වයෝ කර්‍ම දායාදය හ යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි ඇතැමෙක් නුදුන් දෑ ගන්නා සුලු වෙයි … කාමයන්හි මිසහසර ඇතිවෙයි … මුසවා බණන සුලු වෙයි ... පිසුනු බස් ඇතියේ වෙයි ... පරොස් බස් ඇතියේ වෙයි ... සම්ප්‍ර‍ඵලාප කියන සුලු වෙයි ... අභිධ්‍යා බහුල කොට ඇතියේ වෙයි ... ව්‍යාපාදයට වන් සිතැතියේ වෙ ... විපරීතදර්‍ශන ඇති මිථ්‍යා දෘෂ්ටික වෙයි:",
                        "type": "paragraph"
                    },
                    {
                        "text": "“දුන් දෑහි ඵල නැත ... ලොව්හි සම්‍යක්ගත සම්‍යක්ප්‍ර‍තිපන්න වූ යම් කෙනෙක් මෙ ලොව හා පරලොව හා තුමූ විශිෂ්ට ඥානයෙන් දැන සාක්ෂාත් කොට ප්‍ර‍කර්ෂයෙන් දන්නාහු නම් එබඳු මහණ බමුණෝ නැතැ”යි. හෙ කයින් කර්‍ම කෙරෙයි වචනයෙන් කර්‍ම කෙරෙයි. මනසින් කර්‍ම කෙරෙයි. ඔහුගේ කායකර්‍ම වක්‍ර‍ වෙයි, වාක්කර්‍ම වක්‍ර‍ වෙයි, මනඃ කර්‍ම වක්‍ර වෙයි, වක්‍රගති වෙයි, වක්‍ර උපපත්ති වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, වක්‍රගති ඇතියහුට වක්‍ර‍ උපපත්ති ඇතිය හුට මම යම් බඳු වූ හෝ එකැතියෙන් දුක් ඇති නිරයෝ වෙත් නම් යම් බඳු වූ හෝ හැකිලෙන සැහැවි ඇති තිරිසන් යොන් වේ නම් එබඳු දෙගතියෙන් එක්තරා ගතියක් කියමි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 536,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමා ච සා භික්ඛවෙ සංසප්පජාතිකා තිරච්ඡානයොනි: අහීවිච්ඡිකා, සතපදී, නකුලා, බිළාරා, මූසිකා, උලූකා, යෙ වා පනඤ්ඤෙ පි කෙචි තිරච්ඡානයොනිකා සත්තා මනුස්සෙ දිස්වා සංසප්පන්ති. ඉති ඛො භික්ඛවෙ භූතා භූතස්ස උපපත්ති හොති, යං කරොති, තෙන උපපජ්ජති, උපපන්නමෙතං ඵස්සා ඵුසන්ති. එවංපහං භික්ඛවෙ කම්මදායාදා සත්තා ති වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කම්මස්සකා භික්ඛවෙ සත්තා කම්මදායාදා කම්මයොනි කම්මබන්ධු කම්මපටිසරණා, යං කම්මං කරොන්ති කල්යාණං වා පාපකං වා තස්ස දායාදා භවන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතං පහාය පාණාතිපාතා පටිවිරතො හොති නිහිත දණ්ඩො නිහිතසත්ථො ලජ්ජී දයාපන්නො සබ්බපාණභූතහිතානුකම්පී විහරති. සො න සංසප්පති කායෙන, න සංසප්පති වාචාය න සංසප්පති මනසා. තස්ස උජුං කාය කම්මං හොති, උජුං වචීකම්මං, උජුං මනො කම්මං, උජු ගති, උජූපපත්ති. උජුගතිකස්ස ඛො පනාහං භික්ඛවෙ උජූපපත්තිකස්ස ද්වින්නං ගතීනං අඤ්ඤතරං ගතිං වදාමි, යෙ වා එකන්තසුඛා සග්ගා, යානි වා පන තානි උච්චාකුලානි ඛත්තිය මහාසාළකුලානි වා බ්රාහ්මණ මහාසාළකුලානි වා ගහපති මහාසාළකුලානි වා අඩ්ඪානි මහද්ධනානි මහාභොගානි පහූතජාතරූපරජතානි පහූත චිත්තූපකරණානි පහූතධනධඤ්ඤානි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉති ඛො භික්ඛවෙ භූතා භූතස්ස උපපත්ති හොති යං කරොති, තෙන උපපජ්ජති, උපපන්නමෙතං ඵස්සා ඵුස්සන්ති. එවංපහං භික්ඛවෙ කම්මදායාදා සත්තාති වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො අදින්නාදානං පහාය අදින්නාදානා පටිවිරතො හොති -පෙ- කාමෙසු මිච්ඡාචාරං පහාය කාමෙසු මිච්ඡාචාරා පටිවිරතො හොති -පෙ- මුසාවාදං පහාය මුසාවාදා පටිවිරතො හොති -පෙ- පිසුනං වාචං පහාය පිසුනාය වාචාය පටිවිරතො හොති -පෙ- ඵරුසං වාචං පහාය ඵරුසාය වාචාය පටිවිරතො හොති -පෙ- සම්ඵප්පලාපං පහාය සම්ඵප්පලාපා පටිවිරතො හොති -පෙ- අනභිජ්ඣාලූ හොති -පෙ- අබ්යාපන්නචිත්තො හොති -පෙ- සම්මාදිට්ඨිකො හොති අවිපරීතදස්සනො:{1}"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උජුං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, ඒ හැකිලෙන සැහැවි ඇති තිරිසන් යොන් කවර: සප්හුය නුහුසුය පත්වාය නුකුල්ය බළල්ය මීය මහමුහුණුයි, යම් බඳු වූ හෝ අන්කිසි තිරිසන් යොන් ඇති සත්ත්‍වකෙනෙක් මිනිසුන් දැක හැකිලෙත් නම් ඔහු යි. මහණෙනි, මෙසේ (ස්වභාවයෙන්) විද්‍යාමාන කර්‍මයෙන් සත්ත්‍වයාගේ උපත වෙයි, යමක් කෙරේ නම් එයින් උපදනේය. උපන් තෙල පුඟුලා විපාකස්පර්‍ශයෝ පහසිත්. මහණෙනි, මෙසේ ද මම සත්හු කර්‍මදායාදය යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සත්වයෝ කර්‍ම දායාද්‍ය කොට ඇති කර්‍මයොනි කොට ඇති කර්‍මබන්‍ධු කොට ඇති කර්‍ම පිළිසරණ කොට ඇති කර්‍මස්වක වෙති. කලණ වේවයි ලමු වේවයි යම් කර්‍මයක් කෙරෙත් නම් එයට දායාද වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි ඇතැමෙක් පණිවා හැරපියා බහා තැබූ දඬු ඇතියේ බහා තැබූ සැත් ඇතියේ පණිවායෙන් වැළැක්කේ වෙයි. පවට ලජ්ජා ඇතියේ දයාවට පැමිණියේ සර්‍වප්‍රාණභූතයන් කෙරෙහි හිතානුකම්පා ඇතියේ වෙසෙයි. හෙ කයින් සංසර්‍පණ නො කෙරෙයි, වචනයෙන් සංසර්‍පණ නො කෙරෙයි. මනසින් සංසර්‍පණ නො කෙරෙයි. ඔහුගේ කාය කර්‍මය ඍජු වෙයි, වාක් කර්‍ම ඍජු වෙයි, මනඃ කර්‍ම ඍජු වෙයි, ඍජුගති වෙයි, ඍජු උපපත්ති වෙයි, මහණෙනි, ඍජුගති ඇතියහුට ඍජු උපපත්ති ඇතියහුට මම යම් ඒ එකාන්තසුඛ ස්වර්‍ගයෝ හෝ වෙත් නම් යම් බඳු වූ හෝ ක්ෂත්‍රිය මහා සාරකුල වෙත්වයි බ්‍රාහ්මණ මහාසාර කුල වෙත්වයි ගෘහපති මහාසාර කුල වෙත්වයි ආඪ්‍ය වූ මහත් ධන ඇති මහා භොග ඇති බොහෝ රන් රිදී ඇති බොහෝ චිත්තොපකරණ ඇති බොහෝ ධන ධ්‍යාන ඇති උසස් කුල වෙත් නම් එ බඳු දෙගතියෙන් එක්තරා ගතියක් කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙසේ විද්‍යාමාන කර්මයෙන් සත්ත්වයාගේ උපපත්තිය වෙයි. යම් කර්මයක් කෙරේ නම් එයින් උපදනේය. උපන් තෙල පුඟුල්හු විපාකස්පර්ශයෝ පහසිත්. මහණෙනි, මෙසේ ද මම සත්ත්වයෝ කර්මදයාදයයි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙලොව්හි ඇතැමෙක් අයිනාදන් හැරපියා අයිනාදනින් වැළැක්කේ වෙයි ... කාමයන්හි මිසහසර හැරපියා කාමයන්හි මිසහසරින් වැළැක්කේ වෙයි ... මුසවා හැරපියා මුසවායෙන් වැළැක්කේ වෙයි ... පිසුනු බස් හැරපියා පිසුනු බසින් වැළැක්කේ වෙයි ... පරොස්බස් හැරපියා පරොස් බසින් වැළැක්කේ වෙයි ... සම්ප්‍ර‍ඵලාප හැරපියා සම්ප්‍ර‍ඵලාපයෙන් වැළැක්කේ වෙයි ... අනභිධ්‍යාලූ වෙයි ... ව්‍යාපාද රහිත සිතැත්තේ වෙයි ... අවිපරීතදර්‍ශන ඇති සම්‍යක්දෘෂ්ටික වෙයි:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 538,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අත්ථි දින්නං, අත්ථි යිට්ඨං, අත්ථි හුතං, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො, අත්ථි අයං ලොකො, අත්ථි, පරො ලොකො, අත්ථි මාතා, අත්ථි පිතා, අත්ථි සත්තා ඔපපාතිකා, අත්ථි ලොකෙ සමණබ්රාහ්මණා සම්මග්ගතා සම්මාපටිපන්නා, යෙ ඉමඤ්ච ලොකං පරඤ්ච ලොකං සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදෙන්තී ති. සො න සංසප්පති කායෙන, න සංසප්පති වාචාය, න සංසප්පති මනසා, තස්ස උජුං කාය කම්මං හොති, උජුං වචීකම්මං, උජුං මනො කම්මං, උජුගති, උජුපපත්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "උජුගතිකස්ස ඛො පනාහං භික්ඛවෙ උජුපපත්තිකස්ස ද්වින්නං ගතීනං අඤ්ඤතරං ගතිං වදාමි. යෙ වා එකන්තසුඛා සග්ගා, යානි වා පන තානි උච්චාකුලානි ඛත්තියමහාසාළ කුලානි වා, බ්රාහ්මණ මහාසාළකුලානි වා ගහපති මහාසාළ කුලානි වා, අඩ්ඪානි මහද්ධනානි මහා භොගානි පහුත ජාතරූපරජතානි පහුතචිත්තූපකරණානි, පහුතධනධඤ්ඤානි, ඉති ඛො භික්ඛවෙ භූතා භූතස්ස උපපත්ති, හොති යං කරොති, තෙන උපපජ්ජති උපපන්නමෙනං ඵස්සා ඵුසන්ති. එවංපහං භික්ඛවෙ කම්මදායාදා සත්තාති වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කම්මස්සකා භික්ඛවෙ සත්තා කම්මදායාදා කම්මයොනි කම්මබන්ධු කම්මපටිසරණා යං කම්මං කරොන්ති කල්යාණං වා පාපකං වා තස්ස දායාදා භවන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො සො භික්ඛවෙ සංසප්පනියපරියායො ධම්ම පරියායොති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 5. 1. 7",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පඨමසඤ්චෙතනික සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "නාහං භික්ඛවෙ සඤ්චෙතනිකානං කම්මානං කතානං උපචිතානං අප්පටිසංවිදිත්වා ව්යන්තීභාවං වදාමි. තඤ්ච ඛො දිට්ඨෙ වා ධම්මෙ උපපජ්ජෙ{1} වා අපරෙ වා පරියායෙ. න ත්වෙ වාහං භික්ඛවෙ සඤ්චෙතනිකානං කම්මානං කතානං උපචිතානං අප්පටිසංවිදිත්වා දුක්ඛස්සන්තකිරියං වදාමි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උපපජ්ජං වා - සී. මු. - මජසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "“දුන් දැයෙහි ඵල ඇත, යාගයෙහි ඵල ඇත, හෝමයෙහි ඵල ඇත, සුකෘත දුෂ්කෘත කර්‍මයන්ගේ ඵල විපාක ඇත, මෙ ලෝ ඇත, පරලෝ ඇත, ‍ඖපපාදුක සත්ත්‍වයෝ ඇත. යම් කෙනෙක් මෙලෝ හා පරලෝ හා තුමූ විශිෂ්ට ඥානයෙන් දැන පසක් කොට දනිත් නම් එ බඳු සම්‍යක්ගත සම්‍යක්ප්‍ර‍තිපන්න මහණ බමුණෝ ඇතැ”යි. හෙ කයින් නො හැකිලෙයි, වචනයෙන් නො හැකිලෙයි, මනසින් නො හැකිලෙයි, ඔහට ඍජුකාය කර්‍ම වෙයි, ඍජුවාක්කර්‍ම වෙයි, ඍජු මනඃ කර්‍ම වෙයි, ඍජුගති වෙයි, ඍජු උප්පත්ති වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මම ඍජුගති ඇතියහුට ඍජු උප්පත්ති ඇතියහුට යම් බඳු ඒකාන්ත සුඛ ස්වර්‍ගයෝ හෝ වෙත් නම් යම් බඳු ක්ෂත්‍රිය මහාසාරකුල වෙත්වයි, බ්‍රාහ්මණ මහාසාරකුල වෙත්වයි, ගෘහපති මහාසාරකුල වෙත්වයි, ආඪ්‍ය වූ මහත් ධන ඇති, මහාභොග ඇති, බොහෝ රන් රිදී ඇති, බොහෝ චිත්තොපකරණ ඇති බොහෝ ධනධ්‍යාන ඇති උසස් කුලයෝ හෝ වෙත් නම් එ බඳු දෙගතියෙන් එක්තරා ගතියක් කියමි. මහණෙනි, විද්‍යාමාන කර්‍මයෙන් සත්හුගේ උපත වෙයි. යමක් කෙරේ නම් එයින් උපදනේය. උපන් තෙල පුඟුලා විපාකස්පර්‍ශයෙන් පහසිත්. මහණෙනි, මෙසේ ද මම සත්ත්‍වයෝ කර්‍මදායාදහයි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සත්ත්‍වයෝ කර්‍ම දායාද කොට ඇති කර්‍මයොනි කොට ඇති කර්‍මබන්‍ධු කොට ඇති කර්‍ම ප්‍ර‍තිශරණ කොට ඇති කර්‍මස්වක වෙත්. කලණ වේවයි ලමු වේවයි යම් කර්‍මයක් කෙරෙත් නම් එයට දායාද වෙත්,",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "මහණෙනි, මෙ සංසර්‍පණීය පර්‍ය්‍යාය නම් වූ ධර්‍ම පර්‍ය්‍යාය වේය යි."
                    },
                    {
                        "type": "centered",
                        "text": "10.5.1.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පඨම සඤ්චෙතනික සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මම දැන දැන කළ වැඩූ කර්‍මයන්ගේ විපාක නො විඳ විගතාන්ත භාවයක් නොකියමි. හෙ ද වනාහි දිටුදැමියෙහි ම හෝ උපපද්‍යයෙහි හෝ අපරපරියායෙහි හෝ වෙයි. මහණෙනි, මම දැන දැන කළ වැඩූ කර්‍මයන්ගේ විපාක නො විඳ දුඃඛයාගේ කෙළවර කිරීමක් නො කියම් මැයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 540,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තත්ර භික්ඛවෙ තිවිධා කායකම්මන්තසන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා දුක්ඛුද්රයා දුක්ඛවිපාකා හොති. චතුබ්බිධා වචීකම්මන්ත සන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා දුක්ඛුද්රයා දුක්ඛවිපාකා හොති. තිවිධා මනො කම්මන්තසන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා දුක්ඛුද්රයා දුක්ඛ විපාකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ තිවිධා කායකම්මන්ත සන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා දුක්ඛුද්රයා දුක්ඛවිපාකා හොති:"
                    },
                    {
                        "type": "paragraph",
                        "text": "1. ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතී හොති ලුද්දො ලොහිතපාණී හතපහතෙ නිවිට්ඨො අදයාපන්නො සබ්බපාණභූතෙසු."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. අදින්නාදායී හොති. යං තං පරස්ස පරවිත්තූපකරණං ගාමගතං වා අරඤ්ඤගතං වා අදින්නං ථෙය්යසඞ්ඛාතං ආදාතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. කාමෙසු මිච්ඡාචාරී හොති, යා තා මාතුරක්ඛිතා -පෙ- අන්තමසො මාලාගුලපරික්ඛිත්තාපි, තථාරූපාසු චාරිත්තං ආපජ්ජිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං ඛො භික්ඛවෙ තිවිධා කාය කම්මන්ත සන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා දුක්ඛුද්රයා දුක්ඛවිපාකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ චතුබ්බිධා වචී කම්මන්ත සන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා දුක්ඛුද්රයා දුක්ඛ විපාකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "4. ඉධ භික්ඛවෙ එකච්චො මුසාවාදී හොති, සභාගතො වා{1} පරිසගතො වා{1} ඤාතිමජ්ඣගතො වා පූගමජ්ඣගතො වා රාජකුලමජ්ඣගතො වා අභිනීතො සක්ඛි පුට්ඨො, “එහම්භො පුරිස යං ජානාසි තං වදෙහී”ති. සො අජානං වා ආහ ‘ජානාමී’ති. ජානං වා ආහ ‘න ජානාමි’ ති. අපස්සං වා ආහ, ‘පස්සාමී’ති, පස්සං වා ආහ, ‘න පස්සාමී’ති. ඉති අත්තහෙතු වා පරහෙතු වා ආමිස කිඤ්චික්ඛහෙතු වා සම්පජානමුසාභාසිතා හොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සභගගතො වා පරිසග්ගතො වා - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, එහි අකුශලසඤ්චෙතනා ඇති දුක් උපදවන දුඃඛවිපාක ඇති කායකර්‍ම සඞ්ඛ්‍යාත ස්වකීය විපත් ත්‍රිවිධ වේ. අකුශලසඤ්චෙතනා ඇති දුක් උපදවන දුඃඛවිපාක ඇති වාක්කර්‍ම සඞ්ඛ්‍යාත ස්වදොෂ විපත් චතුර්විධ වෙයි. අකුශලසඤ්චෙතනා ඇති දුඃඛ විපාක ඇති දුක් උපදවන මනඃකර්‍ම සඞ්ඛ්‍යාත ස්වදොෂ විපත් ත්‍රිවිධ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් අකුශලසඤ්චෙතනා ඇති දුක් උපදවන දුඃඛවිපාක ඇති කාය කර්‍ම සඞ්ඛ්‍යාත ස්වදොෂ විපත් ත්‍රිවිධ වේය යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "1. මහණෙනි, මෙ ලොව්හි ඇතැමෙක් රුදුරු කම් ඇත්තේ ලෙහෙ වැකි අත් ඇත්තේ නැසුම් - වොලො ගැණුම්හි බටුයේ සර්‍වප්‍රාණී භූතයන් කෙරෙහි දයාරහිත වූයේ ප්‍රාණඝාතී වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. නුදුන් දෑ ගන්නා සුලු වෙයි, ග්‍රාමගත වේවයි අරණ්‍යගත වේවයි මෙරමාගේ යම් එ පරචිත්තොපකරණයෙක් වේ නම් ස්තෙය සඞ්ඛ්‍යාත ඒ නුදුන් දෑ ගන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. කාමයන්හි මිසහසර ඇතියේ වෙයි, මාතෘරක්ෂිතාය ... යටත් පිරිසෙයින් මල්ගුලායෙනුදු පරික්ෂිප්ත වූ, යම් ඒ මාගම්හු වෙත් නම් එබඳු මාගමුන් කෙරෙහි හැසිරීමට පැමිණියේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙසේ අකුශලසඤ්චෙතනා ඇති දුක් උපදවන දුන් විපාක ඇති කායකර්‍ම සඞ්ඛ්‍යාත ස්වදොෂ විපත් ත්‍රිවිධ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් අකුසල සඤ්චෙතනා ඇති දුක් උපදවන දුක් විපාක ඇති වාක්කර්‍ම සඞ්ඛ්‍යාත ස්වදොෂ විපත් චතුර්විධ වේය යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. මහණෙනි, මෙ ලොව්හි ඇතැමෙක් මුසවා කියන්නේ වෙයි: සභාවට ගියේ වේවයි පිරිසකට ගියේ වේවයි නෑයන් මැදට ගියේ වේවයි ගණමැදට ගියේ වේවයි රාජකුල මධ්‍යයට ගියේ වේවයි ඉදිරියට කැඳවන ලදුයේ එම්බා පුරුෂය, එව, යමක් දන්හි නම් එ කියවයි සාක්ෂි පුළුවුස්නා ලදුයේ හෙ නො දන්නේ හෝ දන්මියි කියයි. දන්නේ හෝ නො දන්මි යි කියයි. නො දක්නේ හෝ දක්මියි කියයි. දක්නේ හෝ නො දක්මියි කියයි. මෙසේ තමා හෙතුකොට වේවයි, මෙරමා හෙතු කොට වේවායි කිසි ආමිසයක් හෙතුකොට වේවයි දැන දැන මුසවා කියන්නේ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 542,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "5. පිසුනවාචො හොති. ඉතො සුත්වා අමුත්ර අක්ඛාතා ඉමෙසං භෙදාය, අමුත්ර වා සුත්වා ඉමෙසං අක්ඛාතා අමූසං භෙදාය. ඉති සමග්ගානං වා භෙත්තා, භින්නානං වා අනුප්පදාතා වග්ගාරාමො වග්ගරතො වග්ගනන්දි වග්ගකරණිං වාචං භාසිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "6. ඵරුසවාචො හොති, යා සා වාචා අණ්ඩකා කක්කසා පරකටුකා පරාභිසජ්ජනී කොධසාමන්තා අසමාධිසංවත්තනිකා, තථාරූපිං වාචං භාසිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "7. සම්ඵප්පලාපී හොති, අකාලවාදී අභූතවාදී අනත්ථවාදී අධම්මවාදී අවිනයවාදී අනිධානවතිං වාචං භාසිතා හොති අකාලෙන අනපදෙසං අපරියන්තවතිං අනත්ථසංහිතං."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං ඛො භික්ඛවෙ චතුබ්බිධා වචීකම්මන්ත සන්දොස බ්යාපත්ති අකුසලසඤ්චෙතනිකා දුක්ඛුද්රයා දුක්ඛවිපාකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ තිවිධාමනොකම්මන්ත සන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා දුක්ඛුද්රයා දුක්ඛවිපාකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "8. ඉධ භික්ඛවෙ එකච්චො අභිජ්ඣාලූ හොති, යං තං පරස්ස පරවිත්තූපකරණං තං අභිජ්ඣිතා හොති: අහො වත යං{1} පරස්ස තං මමස්සා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "9. ව්යාපන්නචිත්තො හොති පදුට්ඨමනසංකප්පො ‘ඉමෙ සත්තා හඤ්ඤන්තු වා බජ්ඣන්තු වා උච්ඡිජ්ජන්තු වා විනස්සන්තු වා මා වා අහෙසුන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "10. මිච්ඡාදිට්ඨිකො හොති විපරීතදස්සනො, නත්ථි දින්නං නත්ථි යිට්ඨං, නත්ථි හුතං, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො, නත්ථි අයං ලොකො, නත්ථි පරො ලොකො, නත්ථි මාතා, නත්ථි පිතා, නත්ථි සත්තා ඔපපාතිකා, නත්ථි ලොකෙ සමණබ්රාහ්මණා සමග්ගතා සම්මාපටිපන්නා යෙ ඉමඤ්ච ලොකං පරඤ්ච ලොකං සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදෙන්තීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං ඛො භික්ඛවෙ තිවිධා මනො කම්මන්ත සන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා දුක්ඛුද්රයා දුක්ඛවිපාකා හොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. වතායං - සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "5. පිසුණුබස් ඇතියේ වෙයි: මෙතැනින් අසා මොවුන්ගේ භෙදය පිණිස එතැන කියන්නේ වෙයි, එතැනින් හෝ අසා ඔවුන්ගේ භෙදය පිණිස මොවුන්ට කියන්නේ වෙයි. මෙසේ සමගවූවන් හෝ බිදුවන්නේ භින්නයනට හෝ අනුබල දෙන්නේ වර්‍ගයෙහි සිත් ඇලවූයේ වර්‍ගයෙහි රැඳුනේ වර්‍ගයෙන් තුටුවන්නේ වර්‍ගකරනබස් කියන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "6. පරොස්බස් ඇත්තේ වෙයි. හටගත් අණ්ඩක (නිර්‍ය්‍යාස හෝ පිළිල) ඇති කර්කශ වූ පරාහට කටුක වූ පරා ලග්න කරන කොධයට සමීප වූ සමාධිය පිණිස නො පවත්නා වූ යම් වචනයක් වේ ද එබඳු වචන කියන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "7. අකාලවාදී අභූතවාදී අනර්ථවාදී අධර්‍මවාදී අවිනයවාදී සම්ප්‍ර‍ඵලාප බණන්නේ වෙයි.නො කල්හි කරුණු රහිතව පර්‍ය්‍යන්ත විරහිත අනර්ථ සංහිත සිත්හි ලා දරනට නො නිසි බස් බණන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙසේ අකුසලසඤ්චෙතනා ඇති දුක් උපදවන දුඃඛවිපාක ඇති වාක්කර්‍මසඞ්ඛ්‍යාත ස්වදොෂවිපත් චතුර්විධ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ අකුසලසඤ්චෙතනා ඇති දුක් උපදවන දුඃඛවිපාක ඇති මනඃකර්‍මසඞ්ඛ්‍යාත ස්වදොෂවිපත් ත්‍රිවිධ වේය යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "8. මහණෙනි, මෙ ලොව්හි ඇතැමෙක් අභිධ්‍යා බහුල වෙයි. පරා අයත් යම් වස්තූපකරණ ඇද්ද එය තමන් නතු කොට ගැන්මට සිතන්නේ වෙයි. “පරාසතු යම් දැයෙක් ඇද්ද එය මා සතු වන්නේ නම් මැනැවැ”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "9. ව්‍යාපාදයට පත් සිතැත්තේ වෙයි. ප්‍ර‍දූෂ්‍යමනඃසංකල්ප ඇත්තේ වෙයි: “මේ සත්හු නැසෙන්නාහු හෝ වෙත්වා! බැඳෙන්නාහු වෙත්වා! සිඳෙන්නාහු හෝ වෙත්වා! නැසෙන්නාහු හෝ වෙත්වා! නොහොත් නොවෙත්වා හෝ”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "10. මිසදිටුගත්තේ විපරීතදර්ශන ඇතියේ වෙයි. “දානවිපාක නැත, මඞ්ගලදාන නැත, හොම නැත, සුකෘතදුෂ්කෘතකර්‍මයන්ගේ ඵලයෙක් විපාකයෙක් නැත, මෙලෝ නැත, පරලෝ නැත, මවු නැත, පියා නැත, ඔපපාතිකසත්ත්‍වයෝ නැත, යම් කෙනෙක් මෙලෝ හා පරලෝ හා තමන් විසින් වෙසෙසින් දැන ප්‍ර‍ත්‍යක්ෂ කොට ප්‍ර‍කාශ කෙරෙත් ද එබඳු සම්‍යග් ගත සම්‍යක්ප්‍ර‍තිපන්න මහණ බමුණු කෙනෙක් ලෙව්හි නැති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ‍මෙසේ අකුශලසඤ්චෙතනා ඇති දුක් උපදවන දුඃඛවිපාක ඇති මනඃකර්‍මසඞ්ඛ්‍යාත ස්වදොෂවිපත් ත්‍රිවිධ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 544,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තිවිධ කායකම්මන්තසන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා හෙතු වා භික්ඛවෙ, සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුබ්බිධවචීකම්මන්තසන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා හෙතු වා භික්ඛවෙ, සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තිවිධ මනොකම්මන්තසන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා හෙතු වා භික්ඛවෙ, සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි භික්ඛවෙ අපණ්ණකො මණි උද්ධං ඛිත්තො යෙන යෙනෙව පතිට්ඨාති, සුප්පතිට්ඨිතායෙව පතිට්ඨාති, එවමෙව ඛො භික්ඛවෙ තිවිධ කායකම්මන්තසන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා හෙතු වා සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්ති. චතුබ්බිධවචීකම්මන්තසන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකාහෙතු වා සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්ති. තිවිධ මනො කම්මන්තසන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකාහෙතු වා සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං නිරයං උපපජ්ජන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "නාහං භික්ඛවෙ සඤ්චෙතනිකානං කම්මානං කතානං උපචිතානං අප්පටිසංවිදිත්වා ව්යන්තීභාවං වදාමි. තඤ්ච ඛො දිට්ඨෙ ව ධම්මෙ උපපජ්ජෙ වා අපරෙ වා පරියායෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "න ත්වෙවාහං භික්ඛවෙ සඤ්චෙතනිකානං කම්මානං කතානං උපචිතානං අප්පටිසංවිදිත්වා දුක්ඛස්සන්තකිරියං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ර භික්ඛවෙ තිවිධා කායකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා සුඛුද්රයා සුඛවිපාකා හොති, චතුබ්බිධා වචීකම්මන්ත සම්පත්ති කුසලසඤ්චෙතනිකා සුඛුද්රයා සුඛවිපාකා හොති, තිවිධා මනොකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා සුඛුද්රයා සුඛවිපාකා හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, ත්‍රිවිධකාය කර්ම ස්වදොෂ විපත් සඞ්ඛ්‍යාත අකුසල සඤ්චෙතනා හේතුවෙන් හෝ සත්හු කාබුන් මරණින් මතු දුර්‍ගති විනිපාත නිරය සඞ්ඛ්‍යාත අපායෙහි උපදිති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, චතුර්විධවාක්කර්ම ස්වදොෂ විපත් සඞ්ඛ්‍යාත අකුසල සඤ්චෙතනා හේතුවෙන් හෝ සත්හු කාබුන් මරණින් මතු දුර්‍ගති විනිපාත නිරය සඞ්ඛ්‍යාත අපායෙහි උපදිති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ත්‍රිවිධමනඃකර්ම ස්වදොෂ විපත් සඞ්ඛ්‍යාත අකුසල සඤ්චෙතනා හේතුවෙන් හෝ සත්හු කාබුන් මරණින් මතු දුර්‍ගති විනිපාත නිරය සඞ්ඛ්‍යාත අපායෙහි උපදිති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් සේ සිවුරැස් පසැටක් උඩලූයේ යම් යම් අතකින් පිහිටා ද සුප්‍ර‍තිට්ඨිතව ම පිහිට යි. මහණෙනි, එ පරිදි ම ත්‍රිවිධකාය කර්ම ස්වදොෂ විපත් සඞ්ඛ්‍යාත අකුසල සඤ්චෙතනා හේතුවෙන් හෝ සත් හු කාබුන් මරණින් මතු දුර්‍ගති විනිපාත නිරය සඞ්ඛ්‍යාත අපායෙහි උපදිති. චතුර්විධවාක්කර්ම ස්වදොෂ විපත් සඞ්ඛ්‍යාත අකුසල සඤ්චෙතනා හේතුවෙන් හෝ සත්හු කාබුන් මරණින් මතු දුර්‍ගති විනිපාත නිරය සඞ්ඛ්‍යාත අපායෙහි උපදිති. ත්‍රිවිධ මනඃකර්ම ස්වදොෂ විපත් සඞ්ඛ්‍යාත අකුසල සඤ්චෙතනා හේතුවෙන් හෝ සත්හු කාබුන් මරණින් මතු දුර්‍ගති විනිපාත නිරය සඞ්ඛ්‍යාත අපායෙහි උපදිති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මම දැන දැන කළ, රැස් කළ කර්මයන්ගේ නො විඳ විගතාන්තභාවයෙක් නො කියමි. හෙ ද වනාහි දිටුදැමියෙහි හෝ වෙයි, දෙවන අත් බැව් හි හෝ වෙයි, අපර භවයෙක් හෝ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මම දැන දැන කළ, රැස් කළ කර්මයන්ගේ නො විඳ දුක් කෙළවර කිරීමක් නො කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එහි ලා කුසල සඤ්චෙතනා ඇති සුව උපදවන සුඛවිපාක ඇති කායකර්ම සම්පත් ත්‍රිවිධ වෙයි, කුසල සඤ්චෙතනා ඇති සුව උපදවන සුඛවිපාක ඇති වාක්කර්ම සම්පත් චතුර්විධ වෙයි, කුසල සඤ්චෙතනා ඇති සුව උපදවන සුඛවිපාක ඇති මනඃකර්ම සම්පත් ත්‍රිවිධ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 546,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ තිවිධා කායකම්මන්තසම්පත්ති කුලසඤ්චෙතනිකා සුඛුද්රයා සුඛවිපාකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "1. ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතං පහාය පාණාතිපාතා පටිවිරතො හොති, නිහිතදණ්ඩො නිහිතසත්ථො, ලජ්ජී දයාපන්නො සබ්බපාණභූතහිතානුකම්පී විහරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. අදින්නාදානං පහාය අදින්නාදානා පටිවිරතො හොති, යං තං පරස්ස පරවිත්තූපකරණං ගාමගතං වා අරඤ්ඤගතං වා, න තං අදින්නං ථෙය්යසඞ්ඛාතං ආදාතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. කාමෙසු මිච්ඡාචාරං පහාය කාමෙසු මිච්ඡාචාරා පටිවිරතො හොති. යා තා මාතුරක්ඛිතා -පෙ- අන්තමසො මාලාගුලපරික්ඛිත්තාපි, තථාරූපාසු න චාරිත්තං ආපජ්ජිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං ඛො භික්ඛවෙ තිවිධා කායකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා සුඛුද්රයා සුඛවිපාකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ චතුබ්බිධා වචීකම්මන්ත සම්පත්ති කුසලසඤ්චෙතනිකා සුඛුද්රයා සුඛ විපාකා හොති:"
                    },
                    {
                        "type": "paragraph",
                        "text": "4. ඉධ භික්ඛවෙ එකච්චො මුසාවාදං පහාය මුසාවාදා පටිවිරතො හොති. සභාගතො වා පරිසගතො වා ඤාතිමජ්ඣගතො වා පූගමජ්ඣගතො වා රාජකුලමජ්ඣගතො වා අභිනීතො සක්ඛිපුට්ඨො “එහම්භො පුරිස යං ජානාහි, තං වදෙහී’ති. සො අජානං වා ආහ: ‘න ජානාමී’ති. ජානං වා ආහ, ‘ජානාමී’ති, අපස්සං වා ආහ ‘න පස්සාමී’ති. පස්සං වා ආහ, ‘පස්සාමී’ති. ඉති අත්තහෙතු වා පරහෙතු වා ආමිසකිඤ්චික්ඛහෙතු වා න සම්පජාන මුසා භාසිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "5. පිසුනං වාචං පහාය පිසුනාය වාචාය පටිවිරතො හොති. න ඉතො සුත්වා අමුත්ර අක්ඛාතා ඉමෙසං භෙදාය, අමුත්ර වා සුත්වා ඉමෙසං අක්ඛාතා අමූසං භෙදාය, ඉති භින්නානං වා සන්ධාතා සහිතානං වා අනුප්පදාතා සමග්ගාරාමො සමග්ගරතො සමග්ගනන්දී සමග්ගකරණිං වාචං භාසිතා හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කුසල සඤේචෙතනා ඇති සුව උපදවන සුඛ විපාක ඇති ත්‍රිවිධකාය කර්ම සම්පත් කෙසේ වේය යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "1. මහණෙනි, මෙලොව්හි ඇතැමෙක් පණිවායෙන් දුරුව පණිවායෙන් වැළක්කේ වෙයි. බහාතැබූ දඬු ඇත්තේ බහාතැබූ අවි ඇත්තේ ලජ්ජා ඇත්තේ දයාපන්න වූයේ සර්‍වප්‍රාණභූතයන් කෙරෙහි හිතානුකම්පී ව වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. අයිනාදන් හැර අයිනාදනින් වැළැක්කේ වෙයි: ග්‍රාමගතවේවයි අරණ්‍යගත වේවයි පරා අයත් යම් පරවස්තූපකරණයෙක් වේ නම් සේතය සඞ්ඛ්‍යාත නො දුන් එය නො ගන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. කාමයන්හි මිස හසර හැර කාම මිථ්‍යාචාරයෙන් වැළැක්කේ වෙයි: මාතුරක්ඛීතාය ... යටත් පිරිසෙයින් මාලා ගුණ පරික්ෂිප්තව හෝ කිසිවකු අයත්කර ගත් යම් ඒ ස්ත්‍රීහු වෙත් නම් එබඳු ස්ත්‍රීන් කෙරෙහි මිථ්‍යාචාරයට නො යන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙසේ කුසල සඤ්චෙතනා ඇති සුව උපදවන සුඛ විපාක ඇති ත්‍රිවිධකායකර්‍ම සම්පත් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කුසල සඤ්චෙතනා ඇති සුව උපදවන සුඛවිපාක ඇති චතුර්විධ වාක්කර්‍ම සම්පත් කිසේය යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. මහණෙනි, මෙලොව්හි ඇතැමෙක් මුසවා හැර මුසාවාදයෙන් වැළැක්කේ වෙයි. සභාවටගියේ වේවයි, පිරිසට ගියේ වේවයි, ඥාතිමධ්‍යයට ගියේ වේවයි, සමූහ මධ්‍යයට ගියේ වේවයි, රාජකුලමධ්‍යයට ගියේ වේවයි, හමුවට කැඳවන ලදුයේ “එම්බා පුරුෂයා, මෙහි එව, යමක් දනිහි නම් එ කියව”යි සාක්ෂ්‍ය පුළුවුස්නා ලද හේ නො දත් දැය හෝ නො දන්මි යි කියායි, දත් දැය හෝ දන්මි යි කියායි, නො දුටු දැය හෝ නො දක්මි යි කියායි දුටු දැය හෝ දක්මි යි කිය යි මෙසේ තමා හෙතුකොට ගෙන වේව යි, පරා හෙතු කොට ගෙන වේව යි කිසි ආමිසයක් හේතු කොට ගෙන වේවයි දැන දැන මුසවා බණන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "5. පිසුනු බස් හැර බසින් වැළැක්කේ වෙයි. මෙ තැනින් අසා මොවුන්ගේ භෙදය පිණිස එ තැන නො කියන්නේ වෙයි. එ තන්හි අසා ඔවුන්ගේ භෙදය පිණිස මොවුනට නො කියන්නේ වෙයි. මෙසේ අසමග්‍ර‍යන් සමග්‍ර‍ කරන්නේ සමග්‍ර‍යන්හට අනුබල දෙන්නේ සමග්‍රාරාම වූයේ සමග්‍ර‍රත වූයේ සමග්‍ර‍නන්‍දි වූයේ සමග්‍ර‍කරණී බස් බණන්නේ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 548,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "6. ඵරුසං වාචං පහාය ඵරුසාය වාචාය පටිවිරතො හොති. යා සා වාචා නෙළා කණ්ණසුඛා පෙමනීයා හදයඞ්ගමා පොරී බහුජනකන්තා බහුජනමනාපා තථාරූපං වාචං භාසිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "7. සම්ඵප්පලාපං පහාය සම්ඵප්පලාපා පටිවිරතො හොති, කාලවාදී භූතවාදී අත්ථවාදී ධම්මවාදී විනයවාදී නිධානවතිං වාචං භාසිතා හොති, කාලෙන සාපදෙසං පරියන්තවතිං අත්ථසංහිතං. එවං ඛො භික්ඛවෙ චතුබ්බිධා වචීකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා සුඛුද්රයා සුඛවිපාකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ තිවිධා මනොකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා සුඛුද්රයා සුඛවිපාකා හොති:"
                    },
                    {
                        "type": "paragraph",
                        "text": "8. ඉධ භික්ඛවෙ එකච්චො අනභිජ්ඣාලූ හොති, යං තං පරස්ස පරචිත්තූපකරණං, තං අනභිජ්ඣිතා හොති, ‘අහො වත යං පරස්ස තං මමස්සා’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "9. අව්යාපන්නචිත්තො හොති අප්පදුට්ඨමනසඞ්කප්පො, ‘ඉමෙ සත්තා අවෙරා අබ්යාපජ්ජා අනීඝා සුඛී අත්තානං පරිහරන්තූති."
                    },
                    {
                        "type": "paragraph",
                        "text": "10. සම්මාදිට්ඨිකො හොති අවිපරීතදස්සනො, ‘අත්ථි දින්නං අත්ථි යිට්ඨං -පෙ- __යො__ ඉමඤ්ච ලොකං පරඤ්ච ලොකං සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදෙන්තී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං ඛො භික්ඛවෙ තිවිධා මනොකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා සුඛුද්රයා සුඛවිපාකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තිවිධකායකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා හෙතු වා භික්ඛවෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. චතුබ්බිධවචීකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා හෙතු වා භික්ඛවෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තිවිධ මනො කම්මන්ත සම්පත්ති කුසලසඤ්චෙතනිකා හෙතු වා භික්ඛවෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "6. පරොස් බස් හැර පරුෂ වචනයෙන් වැළැක්කේ වෙයි: නිදොස් වූ කර්‍ණසුඛ වූ ප්‍රෙමණීය වූ හෘදයඞ්ගම වූ බහුජන කාන්ත වූ බහුජනමනාප වූ යම් බසෙක් වේ නම් එබඳු බස් බණන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "7. නිසරු (ප්‍ර‍ලාප) බස් හැරපියා නිසරු බසින් වැළැක්කේ වෙයි: කල් බලා කියනුයේ සැබැවක් ම කියනුයේ වැඩ දායක තෙපුල් කියනුයේ ධර්මවාදී වූයේ විනයවාදී වූයේ සුදුසු කල කරුණු සහිත වූ පිරිසිඳීම් ඇති වැඩ සහිත වූ ළෙහි තැබිය යුතු වූ තෙපුලක් ම කියන්නේ වෙයි. මහණෙනි, කුසලසඤ්චෙතනා ඇති සුව උපදවන සුඛවිපාක ඇති චතුර්විධවාක්කර්මසම්පත් මෙසේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කුසල සඤ්චෙතනා ඇති සුව උපදවන සුඛ විපාක ඇති ත්‍රිවිධ මනඃ කර්මසම්පත් කිසේය යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "8. මහණෙනි, මෙ ලොව් හි ඇතැමෙක් අභිධ්‍යා බහුල නො වෙයි: පරා අයත් යම් වස්තූපකරණ ඇද්ද එය තමන් නතු කොට ගැන්ම නො සිතන්නේ වෙයි: “පරාසතු යම් දැයෙක් ඇද්ද එය මා සතු වන්නේ නම් මැනැවැ”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "9. ව්‍යාපාදයට පත් සිත් නැත්තේ වෙයි, ප්‍ර‍දූෂ්‍යමනඃසඞ්කල්ප නැත්තේ වෙයි: “මෙ සත්හු වෛර නැත්තාහු ව්‍යාපාද රහිත වූවාහු උවදුරු රහිත වූවාහු සුව ඇත්තාහු ආත්ම පරිහරණය කෙරෙත්ව”යි",
                        "type": "paragraph"
                    },
                    {
                        "text": "10. සම්‍යග් දෘෂ්ටික වූයේ විපරීත දර්‍ශන නැත්තේ වෙයි: “දාන විපාක ඇත, මඞ්ගල දාන ඇත ... මෙලො පරලෝ තුමූම විශිෂ්ට ඥානයෙන් දැන සාක්ෂාත් කොට පවසත් නම් එබඳු මහණ බමුණු කෙනෙක් ලෙව්හි ඇතැ”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කුසල සඤ්චෙතනා ඇති සුව උපදවන සුඛ විපාක ඇති ත්‍රිවිධ මනඃකර්මසම්පත් මෙසේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ත්‍රිවිධ කායකර්ම සඞ්ඛ්‍යාත කුසලසඤ්චෙතනා හෙතුයෙන් හෝ සත්ත්‍වයෝ කාබුන් මරණින් මතු සුගති සඞ්ඛ්‍යාත ස්වර්‍ග ලොකයෙහි උපදිති. මහණෙනි, චතුර්විධ වාක්කර්මසඞ්ඛ්‍යාත කුසලසඤ්චෙතනා හෙතුයෙන් හෝ සත්හු කාබුන් මරණින් මතු සුගති සඞ්ඛ්‍යාත ස්වර්‍ගලොකයෙහි උපදිති. මහණෙනි, ත්‍රිවිධ මනඃකර්ම සම්පත් සඞ්ඛ්‍යාත කුසලසඤ්චෙතනා හෙතුයෙන් හෝ සත්හු කාබුන් මරණින් මතු සුගති සඞ්ඛ්‍යාත ස්වර්‍ගලොකයෙහි උපදිති.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 550,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි භික්ඛවෙ අපණ්ණකො මණි උද්ධං ඛිත්තො යෙන යෙනෙව පතිට්ඨාති සුප්පතිට්ඨිතං යෙව පතිට්ඨාති. එවමෙව ඛො භික්ඛවෙ තිවිධ කායකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා හෙතු වා සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුබ්බිධ වචීකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා හෙතු වා සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තිවිධ මනොකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා හෙතු වා සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "නාහං භික්ඛවෙ සඤ්චෙතනිකානං කම්මානං කතානං උපචිතානං ව්යන්තීභාවං වදාමි. තඤ්ච ඛො දිට්ඨෙ වා ධම්මෙ, උපපජ්ජෙ වා අපරෙ වා පරියායෙ. න ත්වෙවාහං භික්ඛවෙ සඤ්චෙතනිකානං කම්මානං කතානං උපචිතානං අප්පටිසංවිදිත්වා දුක්ඛස්ස අන්තකිරියං වදාමීති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 5. 1. 8",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතිය සඤ්චෙතනික සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "නාහං භික්ඛවෙ සඤ්චෙතනිකානං කම්මානං කතානං උපචිතානං අප්පටිසංවිදිත්වා ව්යන්තීභාවං වදාමි. තඤ්ච ඛො දිට්ඨෙ වා ධම්මෙ, උපපජ්ජෙ වා අපරෙ වා පරියායෙ. න ත්වෙවාහං භික්ඛවෙ සඤ්චෙතනිකානං කම්මානං කතානං උපචිතානං අප්පටිසංවිදිත්වා දුක්ඛස්සන්තකිරියං වදාමී."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ර භික්ඛවෙ තිවිධා කායකම්මන්තසන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා දුක්ඛුද්රයා දුක්ඛවිපාකා හොති. චතුබ්බිධා වාචාකම්මන්තසන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා දුක්ඛුද්රයා දුක්ඛවිපාකා හොති. තිවිධා මනොකම්මන්තසන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා දුක්ඛුද්රයා දුක්ඛ විපාකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ තිවිධා කායකම්මන්තසන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා දුක්ඛුද්රයා දුක්ඛවිපාකා හොති -පෙ- එවං ඛො භික්ඛවෙ තිවිධා කාය කම්මන්ත සන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා දුක්ඛුද්රයා දුක්ඛවිපාකා හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, යම් සේ සිවුරැස් පසැටක් උඩ ලූයේ යම් යම් අතකින් පිහිටා ද සුප්‍රතිෂ්ඨිත ව ම පිහිටයි. මහණෙනි, එ පරිදි ම ත්‍රිවිධකායකර්ම සම්පත් සඞ්ඛ්‍යාත කුසල සඤ්චෙතනා හෙතුයෙන් හෝ සත්හු කාබුන් මරණින් මතු ස්වර්‍ග ලොක සඞ්ඛ්‍යාත සුගතියෙහි උපදිත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "චතුර්විධ වාක්කර්මසම්පත් කුසලසඤ්චෙතනා හේතුවෙන් හෝ සත්හු කාබුන් මරණින් මතු ස්වර්‍ගලොක සඞ්ඛ්‍යාත සුගතියෙහි උපදිත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ත්‍රිවිධ මනඃකර්මසම්පත් සඞ්ඛ්‍යාත කුසලසඤ්චෙතනා හෙතුයෙන් හෝ සත්හු කාබුන් මරණින් මතු ස්වර්‍ගලොක සඞ්ඛ්‍යාත සුගතියෙහි උපදිත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මම දැන දැන කළ රැස්කළ කර්මයන්ගේ නො විඳ විගාතාන්තභාවයෙක් නො කියමි. හෙ ද මේ අත් බැව්හි හෝ වෙයි, දෙවෙනි අත් බැව්හි හෝ වෙයි, අපරජන්මයෙහි හෝ වෙයි. මහණෙනි, මම දැන දැන කළ රැස්කළ කර්මයන්ගේ විපාක නො විඳ දුක් කෙළවර කිරීමක් නො කියමි යී.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10.5.1.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතිය සඤ්චෙතනික සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මම කරන ලද රැස් කරන ලද සඤ්චෙතනික කර්මයන්ගේ විපාක නො විඳ විගතාන්ත භාවයක් නො කියමි. හෙ ද වනාහි ඉහාත්මයෙහි ම හෝ අනතුරු ආත්මභාවයෙහි හෝ අපරජන්මයෙහි හෝ වේ. මහණෙනි, මම කරන ලද රැස් කරන ලද සඤ්චෙතනික කර්මයන්ගේ විපාක නො විඳ දුක් කෙළවර කිරීමක් නො ම කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එහිලා අකුසලසඤ්චෙතනා ඇති දුක් උපදවන දුඃඛ විපාක ඇති කායකර්ම සඞ්ඛ්‍යාත ස්වදොෂ විපත් ත්‍රිවිධ වෙයි. අකුසලසඤ්චෙතනා ඇති දුක් උපදවන දුඃඛවිපාක ඇති වාක්කර්ම සඞ්ඛ්‍යාත ස්වදොෂ විපත් චතුර්විධ වෙයි. අකුසලසඤ්චෙතනා ඇති දුක් උපදවන දුඃඛ විපාක ඇති මනඃ කර්ම සඞ්ඛ්‍යාත ස්වදොෂ විපත් ත්‍රිවිධ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අකුසලසඤ්චෙතනා ඇති දුක් උපදවන දුඃඛ විපාක ඇති ත්‍රිවිධ කායකර්ම සඞ්ඛ්‍යාත ස්වදොෂ විපත් කිසේය යත්: ... මහණෙනි, අකුසලසඤ්චෙතනා ඇති දුක් උපදවන දුඃඛ විපාක ඇති ත්‍රිවිධ කාය කර්ම සඞ්ඛ්‍යාත ස්වදොෂ විපත් මෙසේ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 552,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ චතුබ්බිධා වචීකම්මන්ත සන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා දුක්ඛුද්රයා දුක්ඛ විපාකා හොති -පෙ- එවං ඛො භික්ඛවෙ චතුබ්බිධා වචීකම්මන්ත සන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා දුක්ඛුද්රයා දුක්ඛවිපාකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ තිවිධාමනො කම්මන්ත සන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා දුක්ඛුද්රයා දුක්ඛවිපාකා හොති -පෙ- එවං ඛො භික්ඛවෙ තිවිධා මනො කම්මන්ත සන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා දුක්ඛුද්රයා දුක්ඛවිපාකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තිවිධ කායකම්මන්තසන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකාහෙතු වා භික්ඛවෙ සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්ති. චතුබ්බිධවචීකම්මන්ත -පෙ- තිවිධමනොකම්මන්ත සන්දොසබ්යාපත්ති අකුසලසඤ්චෙතනිකා හෙතු වා භික්ඛවෙ සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "නාහං භික්ඛවෙ සඤ්චෙතනිකානං කම්මානං කතානං උපචිතානං අප්පටිසංවිදිත්වා බ්යන්තීභාවං වදාමි. තඤ්ච ඛො දිට්ඨෙ වා ධම්මෙ උපපජ්ජෙ වා අපරෙ වා පරියායෙ. න ත්වෙවාහං භික්ඛවෙ සඤ්චෙතනිකානං කම්මානං කතානං උපචිතානං අප්පටිසංවිදිත්වා දුක්ඛස්සන්තකිරියං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ර භික්ඛවෙ තිවිධා කායකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා සුඛුද්රයා සුඛවිපාකා හොති. චතුබ්බිධා වචීකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා සුඛුද්රයා සුඛවිපාකා හොති. තිවිධා මනොකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා සුඛුද්රයා සුඛවිපාකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ තිවිධා කායකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා සුඛුද්රයා සුඛවිපාකා හොති -පෙ- එවං ඛො භික්ඛවෙ තිවිධා කායකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා සුඛුද්රයා සුඛවිපාකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ චතුබ්බිධා වචීකම්මන්ත සම්පත්ති කුසලසඤ්චෙතනිකා සුඛුද්රයා සුඛ විපාකා හොති -පෙ- එවං ඛො භික්ඛවෙ චතුබ්බිධා වචීකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා සුඛුද්රයා සුඛවිපාකා හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, අකුසල සඤ්චෙතනා ඇති දුක් උපදවන දුඃඛ විපාක ඇති චතුර්විධ වාක්කර්ම සඞ්ඛ්‍යාත ස්වදොෂ විපත් කිසේය යත්: ... මහණෙනි, අකුසල සඤ්චෙතනා ඇති දුක් උපදවන දුඃඛ විපාක ඇති චතුර්විධ වාක්කර්ම සඞ්ඛ්‍යාත ස්වදොෂ විපත් මෙසේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අකුසල සඤ්චෙතනා ඇති දුක් උපදවන දුඃඛ විපාක ඇති ත්‍රිවිධ මනඃකර්ම සඞ්ඛ්‍යාත ස්වදොෂ විපත් කිසේය යත්: ... මහණෙනි, අකුසල සඤ්චෙතනා ඇති දුක් උපදවන දුඃඛ විපාක ඇති ත්‍රිවිධ මනඃකර්ම සඞ්ඛ්‍යාත ස්වදොෂ විපත් මෙසේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ත්‍රිවිධ කායකර්ම ස්වදොෂ විපත් සඞ්ඛ්‍යාත අකුසල සඤ්චෙතනා හේතුයෙන් හෝ සත්ත්‍වයෝ කාබුන් මරණින් මතු අපාය, දුර්‍ගති විනිපාත සඞ්ඛ්‍යාත නිරයෙහි උපදනාහ. චතුර්විධ වාක්කර්ම ... මහණෙනි, ත්‍රිවිධ මනඃ කර්ම ස්වදොෂ විපත් සඞ්ඛ්‍යාත අකුසල සඤ්චෙතනා හෙතුයෙන් හෝ සත්ත්‍වයෝ කාබුන් මරණින් මතු අපාය දුර්‍ගති විනිපාත සඞ්ඛ්‍යාත නිරයෙහි උපදනාහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කරන ලද රැස් කරන ලද සඤචෙතනික කර්මයන්ගේ විපාක නො විඳ විගතාන්ත භාවයක් මම නො කියමි. හෙ ද වනාහි ඉහාත්මයෙහි හෝ අනතුරු අත් බැව්හි හෝ අපර ජන්මයෙහි හෝ වෙයි. මහණෙනි, මම කරන ලද රැස් කරන ලද සඤ්චෙතනික කර්මයන් නො විඳ දුක් කෙළවර කිරීමක් නො ම කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එහි ලා කුසල සඤ්චෙතනා ඇති සුව එළවන සුඛ විපාක ඇති කාය කර්ම සඞ්ඛ්‍යාත සම්පත් ත්‍රිවිධ වෙයි. කුසල සඤ්චෙතනා ඇති සුව උපදවන සුඛවිපාක ඇති වාක්කර්ම සඞ්ඛ්‍යාත සම්පත් චතුර්විධ වෙයි. කුසල සඤ්චෙතනා ඇති සුව උපදවන සුඛවිපාක ඇති මනඃකර්ම සඞ්ඛ්‍යාත සම්පත් ත්‍රිවිධ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කුසල සඤ්චෙතනා ඇති සුව උපදවන සුඛ විපාක ඇති ත්‍රිවිධකාය කර්ම සඞ්ඛ්‍යාත සම්පත් කිසේය යත් ... මහණෙනි, කුසල සඤ්චෙතනා ඇති සුව උපදවන සුඛවිපාක ඇති ත්‍රිවිධකායකර්ම සඞ්ඛ්‍යාත සම්පත් මෙසේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කුසල සඤ්චෙතනා ඇති සුව උපදවන සුඛ විපාක ඇති චතුර්විධ වාක්කර්ම සඞ්ඛ්‍යාත සම්පත් කිසේ වේය යත් … මහණෙනි, කුසල සඤ්චෙතනා ඇති සුව උපදවන සුඛ විපාක ඇති චතුර්විධ වාක්කර්ම සඞ්ඛ්‍යාත සම්පත් මෙසේ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 554,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ තිවිධා මනොකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා සුඛුද්රයා සුඛවිපාකා හොති -පෙ- එවං ඛො භික්ඛවෙ තිවිධා මනොකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා සුඛුද්රයා සුඛවිපාකා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තිවිධකායකම්මන්තසම්පත්ති කුසලසඤ්චෙතනිකා හෙතු වා භික්ඛවෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. චතුබ්බිධවචීකම්මන්ත -පෙ- තිවිධ මනො කම්මන්ත සම්පත්ති කුසලසඤ්චෙතනිකා හෙතු වා භික්ඛවෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති -පෙ-"
                    },
                    {
                        "type": "centered",
                        "text": "10. 5. 1. 9",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කරජකාය සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "නාහං භික්ඛවෙ සඤ්චෙතනිකානං කම්මානං කතානං උපචිතානං අප්පටිසංවිදිත්වා{1} ව්යන්තීභාවං වදාමි. තඤ්චෙ ඛො දිට්ඨෙ වා ධම්මෙ උපපජ්ජෙ{2} වා අපරෙ වා පරියායෙ. න ත්වෙවාහං භික්ඛවෙ සඤ්චෙතනිකානං කම්මානං කතානං උපචිතානං අප්පටිසංවිදිත්වා දුක්ඛස්සන්තකිරියං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ස ඛො සො භික්ඛවෙ අරියසාවකො එවං විගතාභිජ්ඣො විගතව්යාපාදො අසම්මූළ්හො සම්පජානො පතිස්සතො මෙත්තාසහගතෙන චෙතසා එකං දිසං ඵරිත්වා විහරති. තථා දුතියං -පෙ- තථා තතියං -පෙ- තථා චතුත්ථං{3} ඉති උද්ධමධො තිරියං සබ්බධි සබ්බත්තතාය{4} සබ්බාවන්තං ලොකං මෙත්තාසහගතෙන චෙතසා විපුලෙන මහග්ගතෙන අප්පමාණෙන අවෙරෙන අබ්යාපජ්ජෙන ඵරිත්වා විහරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සො එවං පජානාති: “පුබ්බෙ ඛො මෙ ඉදං චිත්තං පරිත්තං අහොසි අභාවිතං. එතරහි පන මෙ ඉදං චිත්තං අප්පමාණං සුභාවිතං. යං ඛො පන කිඤ්චි පමාණකතං කම්මං, න තං තත්රාවසිස්සති. න තං තත්රාවතිට්ඨතී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තං කිං මඤ්ඤථ භික්ඛවෙ දහරතග්ගෙ චෙ සො අයං{5} කුමාරො මෙත්තං චෙතො විමුත්තිං භාවෙය්ය, අපි නු ඛො පාපකම්මං කරෙය්යාති? නො හෙතං භන්තෙ."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අප්පටිසංවෙදිත්වා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. උපපජ්ජං වා - සීමු. මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. තථා චතුත්ථිං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. සබ්බත්ථතාය - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "5. චෙ අයං - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කුසල සඤ්චෙතනා ඇති සුව උපදවන සුඛ විපාක ඇති ත්‍රිවිධ මනඃකර්ම සඞ්ඛ්‍යාත සම්පත් කිසේ වේය යත් ... මහණෙනි, කුසල සඤ්චෙතනා ඇති සුව උපදවන සුඛවිපාක ඇති ත්‍රිවිධ මනඃකර්ම සංඛාත සම්පත් මෙසේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ත්‍රිවිධකාය කර්ම සංඛ්‍යාත කුසල සඤ්චෙතනා හේතුවෙන් හෝ සත්හු කාබුන් මරණින් මතු සුගති සංඛ්‍යාත ස්වර්‍ග ලොකයෙහි උපදිත්. චතුර්විධ වාක්කර්ම .. ත්‍රිවිධ මනඃකර්ම සම්පත් සංඛ්‍යාත කුසල සඤ්චෙතනා හේතුවෙන් හෝ සත්හු කාබුන් මරණින් මතු සුගති සංඛ්‍යාත ස්වර්‍ග ලොකයෙහි උපදනාහ ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10.5.1.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කරජකාය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මම දැන දැන කළ, රැස් කළ කර්‍මයන්ගේ නො විඳ විගතාන්තභාවයක් නො කියමි. හෙ ද වනාහි ඉහාත්මයෙහි හෝ වෙයි. දෙවන ජන්මයෙහි හෝ වෙයි. ජන්මාන්තරයෙහි හෝ වෙයි. මහණෙනි, මම දැන දැන කළ, රැස් කළ කර්මයන්ගේ විපාක නො විඳ දුක කෙළවර කිරීමක් නො ම කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඒ මේ අරීසවු මෙසේ පහ වූ අභිධ්‍යා ඇතියේ පහ වූ ව්‍යාපාද ඇතියේ අසම්මූඪ වූයේ සම්‍යක් ප්‍ර‍ඥා ඇතියේ එළඹ සිටි සිහි ඇතියේ මෙත්සහගිය සිතින් එක් දිගක් පතුරුවා වෙසෙයි. දෙවන දිග ද එසේ ය. තෙවන දිග ද එසේ ය. සිවුවන දිග ද එසේ ය. මෙසේ උඩ යට සරස හැමතන්හි සර්‍වාත්මභාවයෙන් හැමතාක් ලොව විපුල මහද්ගත අප්‍ර‍මාණ අවෛර අව්‍යපාද මෙත්සහගිය සිතින් පතුරුවා වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "හෙ මෙසේ දනියි: “පෙර වනාහි මාගේ මෙ සිත අභාවිත වූයේ පරිත්ත විය. දැන් වනාහි මාගේ මේ සිත සුභාවිත වූයේ අප්‍ර‍මාණ වෙයි. යම් කිසි ප්‍ර‍මාණ කෘත කර්මයක් වේ නම් ඒ එහි අවශිෂ්ට නො වෙයි. ඒ එහි නො සිටුනේ” යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඒ කුමැයි හඟිවු ද? ළදරු කල් පටන් ඉදින් ඒ මේ කුමර මෛත්‍රීචිත්ත විමුක්තිය වඩනේ නම් පව් කමක් නම් කෙරේ දැ යි. වහන්ස, තෙල නො වේ මැයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 556,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අකරොන්තං ඛො පන පාපකම්මං අපි නු ඛො දුක්ඛං ඵුසෙය්යාති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "නො හෙතං භන්තෙ, අකරොන්තං හි භන්තෙ පාපකම්මං කුතො දුක්ඛං ඵුසිස්සතී ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "භාවෙතබ්බා ඛො පනායං භික්ඛවෙ මෙත්තාචෙතොවිමුත්ති ඉත්ථියා වා භික්ඛවෙ පුරිසෙන වා. ඉත්ථියා වා භික්ඛවෙ පුරිසස්ස වා නායං කායො ආදාය ගමනීයො. චිත්තන්තරො භික්ඛවෙ මච්චො. සො එවං පජානාති: “යං ඛො මෙ ඉධ{1} කිඤ්චී පුබ්බෙ ඉමිනා කරජකායෙන පාපකම්මං කතං, සබ්බං තං ඉධ වෙදනීයං, න තං අනුගං භවිස්සතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං භාවිතා ඛො භික්ඛවෙ මෙත්තාචෙතොවිමුත්ති අනාගාමිතාය සංවත්තති, ඉධ පඤ්ඤස්ස භික්ඛුනො උත්තරිං විමුත්තිං අප්පටිවිජ්ඣතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කරුණාසහගතෙන චෙතසා -පෙ- මුදිතා සහගතෙන චෙතසා -පෙ- උපෙක්ඛාසහගතෙන චෙතසා එකං දිසං ඵරිත්වා විහරති. තථා දුතියං - තථා තතියං - තථා චතුත්ථං - ඉති උද්ධමධො තිරියං සබ්බධි සබ්බත්තතාය සබ්බාවන්තං ලොකං උපෙක්ඛාසහගතෙන චෙතසා විපුලෙන මහග්ගතෙන අප්පමාණෙන අවෙරෙන අබ්යාපජ්ජෙන ඵරිත්වා විහරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සො එවං පජානාති, “පුබ්බෙ ඛො මෙ ඉදං චිත්තං අප්පමාණං පරිත්තං අහොසි අභාවිතං, එතරහි පන මෙ ඉදං චිත්තං සුභාවිතං. යං ඛො පන මෙ කිඤ්චි පමාණකතං කම්මං, න තං තත්රාවසිස්සති, න තං තත්රාවතිට්ඨතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තං කිං මඤ්ඤථ භික්ඛවෙ දහරතග්ගෙ චෙ සො අයං කුමාරො උපෙක්ඛං චෙතොවිමුත්තිං භාවෙය්ය, අපි නු ඛො පාපකම්මං කරෙය්යාති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "නො හෙතං භන්තෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "අකරොන්තං ඛො පන පාපකම්මං අපි නු ඛො දුක්ඛං ඵුසෙය්යාති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "නො හෙතං භන්තෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "අකරොන්තං හි භන්තෙ පාපකම්මං කුතො දුක්ඛං ඵුසිස්සතී ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඉදං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "දුක පාපකර්ම නො කරන්නාහු පහස්නේ දැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, තෙල නො වේ මැයි. වහන්ස, දුක පව් නො කරන්නහු කෙසේ නම් පහස්නේ ද?",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ස්ත්‍රියක විසින් වේවයි පුරුෂයකු විසින් වේවයි මේ මෛත්‍රීචිත්තවිමුක්තිය වැඩිය යුතු මැයි. ස්ත්‍රියගේ වේවයි, පුරුෂයාගේ වේවයි මේ කරජකායය පරලෝ ගෙන යා හැකි නො වේ මැයි. මහණෙනි, මේ මිනිස් තෙම චිත්තක්ෂණාන්තරයක් ඇත්තෙකි. හේ මෙසේ දනී: “මෙ ලොව්හි ම විසින් පෙර මෙ කරජකයින් යම් කිසි පව්කමක් කරන ලද නම් එ හැම මෙ ලොව්හි ම වින්ද යුතු වෙයි. (උපපද්‍ය වෙදනිය විසින්) එය අනුව යන්නක් නො වන්නේ ය”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙසේ වඩනා ලද මෛත්‍රී චිත්තවිමුක්තිය මතුයෙහි අර්හත්ත්‍ව විමුක්තිය නො පිළි විදුනා ප්‍ර‍ඥා ඇති මහණහට මෙලොව්හිදී ම අනාගාමී බව පිණිස වැටෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "කරුණා සහගිය සිතින් ... මුදිතා සහගිය සිතින් ... උපෙක්ෂා සහගත සිතින් එක් දිගක් පතුරුවා වෙසෙයි. දෙවන දිග ද එසේ ය - තෙවන දිග ද එසේ ය - සිවුවන දිගද එසේ ය - මෙසේ උඩ යට සරස හැමතන්හි සර්‍වාත්මභාවයෙන් හැම තාක් ලොව විපුල මහද්ගත අප්‍ර‍මාණ අවෛර ව්‍යාපාද රහිත උපෙක්ෂා සහගත සිතින් පතුරුවා වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "හෙ මෙසේ දනී: “පෙර වනාහි මාගේ සිත අභාවිත වූයේ පරිත්ත වීය. දැන් වනාහි මාගේ මෙ සිත සුභාවිත වූයේ අප්‍ර‍මාණ වෙයි, ම විසින් යම් ම කර්මයක් ප්‍ර‍මාණ කරන ලද ද ඒ කර්මය මෙහි අවශිෂ්ට නො වෙයි. එ එහි නො සිටුනේ ය”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එ කුමැයි හඟිවු ද? ළදරු කල් පටන් ඉදින් ඒ මේ කුමර උපෙක්ෂා චිත්ත විමුක්තිය වඩනේ නම් පව්කම් කරන්නේ දැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, තෙල නො වේ ම ය.",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "දුක පව්කම් නො කරන්නහු පහස්නේ දැ යි."
                    },
                    {
                        "text": "වහන්ස, තෙල නො වේ මැයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, දුක පාපකර්ම නො කරන්නහු කිසේ නම් පහස්නේ දැ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 558,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "භාවෙතබ්බා ඛො පනායං භික්ඛවෙ උපෙක්ඛා චෙතොවිමුත්ති ඉත්ථියා වා පුරිසෙන වා. ඉත්ථියා වා භික්ඛවෙ පුරිසස්ස වා නායං කායො ආදාය ගමනීයො. චිත්තන්තරො අයං භික්ඛවෙ මච්චො. සො එවං පජානාති: “යං ඛො මෙ ඉධ කිඤ්චි පුබ්බෙ ඉමිනා කරජකායෙන පාපකම්මං කතං, සබ්බං තං ඉධ වෙදනියං. න තං අනුගං භවිස්සතී ති. එවං භාවිතා ඛො භික්ඛවෙ උපෙක්ඛා චෙතොවිමුත්ති අනාගාමිතාය සංවත්ත ති. ඉධ පඤ්ඤස්ස භික්ඛුනො උත්තරිං විමුත්තිං අප්පටිවිජ්ඣතො ති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 5. 1. 10",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අධම්මචරියා සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො අඤ්ඤතරො බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං{1} වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො සො බ්රාහ්මණො භගවන්තං එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කො නු ඛො භො ගොතම හෙතු, කො පච්චයො, යෙනමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්තී ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අධම්මචරියා විසමචරියා හෙතු ඛො බ්රාහ්මණ එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්තීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කො පන භො ගොතම හෙතු, කො පච්චයො, යෙනමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්තීති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ධම්මචරියා සමචරියා හෙතු ඛො බ්රාහ්මණ එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්තීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සාරණීයං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, ස්ත්‍රියක විසින් වේවයි, පුරුෂයකු විසින් වේවයි මේ උපෙක්ෂාචෙතො විමුක්තිය වැඩිය යුතුය. මහණෙනි, ස්ත්‍රියගේ හෝ පුරුෂයාගේ හෝ මේ කය පරලොව ගෙන යා හැකි නො වේ. මහණෙනි, මෙ මිනිස් තෙම චිත්ත ක්ෂණාන්තරයක් ඇත්තෙකි. හෙ මෙසේ දනී: “ම විසින් මෙ ලොව්හි පෙර මෙ කරජකයින් යම් පව්කමක් කරණ ලද නම් එ හැම මෙලොව වින්ඳ යුතු වෙයි. එය අනුගතයෙක් නො වන්නේ ය”යි මහණෙනි, මෙසේ වඩනා ලද උපෙක්ෂාචිත්ත විමුත්තිය මතුයෙහි අර්හත්‍ව චිත්තවිමුක්තිය නො පිළි විදුනා ප්‍රාඥභික්ෂූහුගේ මෙලොව්හිදී අනගැමි බව පිණිස වැටේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10.5.1.10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අධම්මචරියා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "එ සඳ එක්තරා බ්‍රාහ්මණයෙක් භාග්‍යවතුන් වහන්සේ කරා එළඹියේය. එළඹ භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථාව කොට නිමවා එකත් පසෙක හින. එකත් පසෙක හුන් එ බ්‍රාහ්මණ තෙම භාග්‍යවතුන් වහන්සේට තෙල සැල කෙළේ ය:",
                        "type": "paragraph"
                    },
                    {
                        "text": "භවත් ගෞතමයන් වහන්ස, යම් හෙයෙකින් මෙ ලොව්හි ඇතැම් සත්ත්‍ව කෙනෙක් කාබුන් මරණින් මතු අපාය සඞ්ඛ්‍යාත දුර්‍ගති සඞ්ඛ්‍යාත විනිපාත නම් වූ නිරයෙහි උපදනාහු නම් එ හෙතු කවර? එ ප්‍ර‍ත්‍යය කවර? යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බ්‍රාහ්මණය, අධර්‍මචර්‍ය්‍යයා සංඛ්‍යාත විෂමචර්‍ය්‍යාව හෙතු කොට ගෙන මෙසේ මෙලොව් හි ඇතැම් සත්ත්‍ව කෙනෙක් කාබුන් මරණින් මතු අපාය සංඛ්‍යාත, දුර්‍ගති සංඛ්‍යාත, විපාත නම් වූ නිරයෙහි උපදනා හු ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "භවත් ගෞතමයන් වහන්ස, යම් හෙයකින් මෙ ලොව්හි ඇතැම් සත්ත්‍ව කෙනෙක් කාබුන් මරණින් මතු සුගති නම් වූ ස්වර්‍ග ලොකයෙහි උපදනාහු නම්, ඒ හෙතු කවර? එ ප්‍රත්‍යය කවර? යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බ්‍රාහ්මණය, මෙ ලොව්හි ඇතැම් සත්ත්‍ව කෙනෙක් මෙසේ ධර්‍මචර්‍ය්‍යා සංඛ්‍යාත සමචර්‍ය්‍යාව හෙතු කොට ගෙන කාබුන් මරණින් පසු සුගති නම් ස්වර්‍ග ලොකයෙහි උපදනාහයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 560,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "න ඛො අහං ඉමස්ස භොතො ගොතමස්ස සඞ්ඛිත්තෙන භාසිතස්ස විත්ථාරෙන අත්ථං ආජානාමි. සාධු මෙ භවං ගොතමො තථා ධම්මං දෙසෙතු යථාහං ඉමස්ස භොතො ගොතමස්ස සඞ්ඛිත්තෙන භාසිතස්ස විත්ථාරෙන අත්ථං ආජානෙය්යන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන හි බ්රාහ්මණ, සුණාහි, සාධුකං මනසි කරොහි භාසිස්සාමීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං හොති ඛො සො බ්රාහ්මණො භගවතො පච්චස්සොසි. භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "තිවිධා{1} ඛො බ්රාහ්මණ, කායෙන අධම්මචරියා විසමචරියා හොති. චතුබ්බිධා{2} වාචාය අධම්මචරියා විසමචරියා හොති. තිවිධා මනසා අධම්මචරියා විසමචරියා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච බ්රාහ්මණ, තිවිධා{1} කායෙන අධම්මචරියා විසමචරියා හොති: -පෙ- එවං ඛො{3} බ්රාහ්මණ, තිවිධා කායෙන අධම්මචරියා විසමචරියා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච බ්රාහ්මණ චතුබ්බිධා{2} වාචාය අධම්මචරියා විසමචරියා හොති: -පෙ- එවං ඛො{3} බ්රාහ්මණ, චතුබ්බිධා වාචාය අධම්මචරියා විසමචරියා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච බ්රාහ්මණ තිවිධා{1} මනසා අධම්මචරියා විසමචරියා හොති: -පෙ- එවං ඛො{3} බ්රාහ්මණ, තිවිධා මනසා අධම්මචරියා විසමචරියා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං අධම්මචරියා විසමචරියා හෙතු ඛො බ්රාහ්මණ, එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තිවිධා{1} ඛො බ්රාහ්මණ, කායෙන ධම්මචරියා සමචරියා හොති. චතුබ්බිධා{2} වාචාය ධම්මචරියා සමචරියා හොති. තිවිධා මනසා ධම්මචරියා සමචරියා හොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. තිවිධං - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "2. චතුබ්බිධං - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "3. එවං බ්රාහ්මණ - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "භවත් ගෞතමයන් වහන්සේ විසින් සැකෙවින් දෙසූ මේ භාෂිතයාගේ අර්ථය මම විස්තර විසින් නො දනිම් මැයි. භවත් ගෞතමයන් වහන්සේ විසින් සැකෙවින් දෙසන ලද මේ භාෂිතයාගේ අර්ථය යම් පරිද්දෙකින් මම විස්තර විසින් දැන ගනිම් නම්, භවත් ගෞතමයන් වහන්සේ මට එපරිද්දෙන් ධර්‍මය දෙසන සේක් නම් මැනැවි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බ්‍රාහ්මණය, එසේ නම් අසව, මොනොවට මෙනෙහි කරව, කියන්නෙමි යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පින්වතුන් වහන්ස, එසේ ය යි බ්‍රාහ්මණ භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වී. භාග්‍යවතුන් වහන්සේ තෙල කරුණ වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බ්‍රාහ්මණය, කායද්වාරයෙන් ත්‍රිවිධ අධර්මවර්‍ය්‍යා සංඛ්‍යාත විෂමචර්‍ය්‍යායෙක් වෙයි. වාග්ද්වාරයෙන් චතුර්විධ අධර්මචර්‍ය්‍යා සංඛ්‍යාත විෂමචර්‍ය්‍යායෙක් වෙයි. මනොද්වාරයෙන් ත්‍රිවිධ අධර්මචර්‍ය්‍යා සංඛ්‍යාත විෂමචර්‍ය්‍යායෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බ්‍රාහ්මණය, කායද්වාරයෙන් ත්‍රිවිධ අධර්මචර්‍ය්‍යා සංඛ්‍යාත විෂමචර්‍ය්‍යාව කෙසේ වේය යත්: -පෙ- බ්‍රාහ්මණය, මෙසේ කායද්වාරයෙන් ත්‍රිවිධ අධර්මචර්‍ය්‍යා සංඛ්‍යාත විෂමචර්‍ය්‍යාව වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බ්‍රාහ්මණය, වාග්ද්වාරයෙන් චතුර්විධ අධර්මචර්‍ය්‍යා සංඛ්‍යාත විෂමචර්‍ය්‍යාව කෙසේ වේය යත්: -පෙ- බ්‍රාහ්මණය, මෙසේ වනාහි වාග්ද්වාරයෙන් චතුර්විධ අධර්මචර්‍ය්‍යා සංඛ්‍යාත විෂමචර්‍ය්‍යාව වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බ්‍රාහ්මණය, මනොද්වාරයෙන් ත්‍රිවිධ අධර්මචර්‍ය්‍යා සංඛ්‍යාත විෂමචර්‍ය්‍යාව කෙසේ වේය යත්: -පෙ- බ්‍රාහ්මණය, මෙසේ මනොද්වාරයෙන් ත්‍රිවිධ අධර්මවර්‍ය්‍යා සංඛ්‍යාත විෂමචර්‍ය්‍යාව වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බ්‍රාහ්මණය, මෙසේ අධර්මවර්‍ය්‍යා සංඛ්‍යාත විෂමචර්‍ය්‍යාව හෙතු කොට මෙලොව්හි ඇතැම් සත්ත්‍ව කෙනෙක් කාබුන් මරණින් මතු අපාය නම් වූ දුගති නම් වූ විනිපාත නම් වූ නිරයෙහි උපදනා හ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බ්‍රාහ්මණය, කායද්වාරයෙන් ත්‍රිවිධ ධර්මචර්‍ය්‍යා සංඛ්‍යාත සමචර්‍ය්‍යායෙක් වෙයි. වාග්ද්වාරයෙන් චතුර්විධ ධර්මචර්‍ය්‍යා සංඛ්‍යාත සමචර්‍ය්‍යායෙක් වෙයි. මනොද්වාරයෙන් ත්‍රිවිධ ධර්මචර්‍ය්‍යා සංඛ්‍යාත සමචර්‍ය්‍යායෙක් වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 562,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච බ්රාහ්මණ, තිවිධා කායෙන ධම්මචරියා සමචරියා හොති: -පෙ- එවං ඛො බ්රාහ්මණ, තිවිධා කායෙන ධම්මචරියා සමචරියා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච බ්රාහ්මණ චතුබ්බිධා වාචාය ධම්මචරියා සමචරියා හොති: -පෙ- එවං ඛො බ්රාහ්මණ, චතුබ්බිධා වාචාය ධම්මචරියා සමචරියා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච බ්රාහ්මණ තිවිධා මනසා ධම්මචරියා සමචරියා හොති: -පෙ- එවං ඛො බ්රාහ්මණ, තිවිධා මනසා ධම්මචරියා සමචරියා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං ධම්මචරියා සමචරියා හෙතු ඛො බ්රාහ්මණ එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්තී ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අභික්කන්තං භො ගොතම -පෙ- උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "කරජකායවග්ගො පඨමො.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "බ්‍රාහ්මණය, කායද්වාරයෙන් ත්‍රිවිධ ධර්මචර්‍ය්‍යා සංඛ්‍යාත සමචර්‍ය්‍යාව කෙසේ වේය යත්: ... බ්‍රාහ්මණය, කායද්වාරයෙන් ත්‍රිවිධ ධර්මචර්‍ය්‍යා සංඛ්‍යාත සමචර්‍ය්‍යාව වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බ්‍රාහ්මණය, වාග්ද්වාරයෙන් චතුර්විධ ධර්මචර්‍ය්‍යා සංඛ්‍යාත සමචර්‍ය්‍යාව කෙසේ වේය යත්: ... බ්‍රාහ්මණය, වාග්ද්වාරයෙන් චතුර්විධ ධර්මචර්‍ය්‍යා සංඛ්‍යාත සමචර්‍ය්‍යාව මෙසේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බ්‍රාහ්මණය, මනොද්වාරයෙන් ත්‍රිවිධ ධර්මචර්‍ය්‍යා සංඛ්‍යාත සමචර්‍ය්‍යාව කෙසේ වේය යත්: ... බ්‍රාහ්මණය, මනොද්වාරයෙන් ත්‍රිවිධ ධර්මචර්‍ය්‍යා සංඛ්‍යාත සමචර්‍ය්‍යාව මෙසේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බ්‍රාහ්මණය, මෙසේ ධර්මචර්‍ය්‍යා සංඛ්‍යාත සමචර්‍ය්‍යාව හෙතු කොට ගෙන මෙසේ මෙ ලොව්හි ඇතැම් සත්ත්‍වයෝ කාබුන් මරණින් මතු සුගති සංඛ්‍යාත ස්වර්‍ග ලොකයෙහි උපදනාහ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පින්වත් ගෞතමයන් වහන්ස, ඉතා කාන්තය ... භවත් ගෞතමයන් වහන්සේ අද පටන් මා දිවිහිමියෙන් තෙරුවන් සරණ ගිය උවසුවකු කොට දරණ සේක්වා යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ප්‍ර‍ථම කරජකාය වර්‍ගය යි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 564,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "2. සාමඤ්ඤවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10. 5. 2. 1",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පඨම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දසහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ. කතමෙහි දසහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "පාණාතිපාතී හොති, අදින්නාදායී හොති, කාමෙසු මිච්ඡාචාරී හොති, මුසාවාදී හොති, පිසුණාවාචො හොති, ඵරුසාවාචො හොති, සම්ඵප්පලාපී හොති, අභිජ්ඣාලූ හොති, ව්යාපන්නචිත්තො හොති. මිච්ඡාදිට්ඨිකො හොති. ඉමෙහි ඛො භික්ඛවෙ දසහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "දසහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙ. කතමෙහි දසහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "පාණාතිපාතා පටිවිරතො හොති. අදින්නාදානා පටිවිරතො හොති, කාමෙසු මිච්ඡාචාරා පටිවිරතො හොති, මුසාවාදා පටිවිරතො හොති, පිසුනාය වාචාය පටිවිරතො හොති, ඵරුසාය වාචාය පටිවිරතො හොති, සම්ඵප්පලාපා පටිවිරතො හොති. අනභිජ්ඣාලූ හොති, අබ්යාපන්නචිත්තො හොති, සම්මාදිට්ඨිකො හොති. ඉමෙහි ඛො භික්ඛවෙ දසහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 5. 2. 2",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතිය සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "වීසතියා භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ. කතමෙහි වීසතියා:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච පාණාතිපාතී හොති, පරඤ්ච පාණාතිපාතෙ සමාදපෙති. අත්තනා ච අදින්නාදායී හොති, පරඤ්ච අදින්නාදානෙ සමාදපෙති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "2. සාමඤ්ඤ වර්ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10.5.2.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පළමුවැනි සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, දස ධර්‍මයෙකින් සමන්වාගත වූයේ ගෙනෙන ලදුවක් බහා තැබුයේ යම් සේ ද එසේ නිරයෙහි වෙයි. කවර දසයෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "පණිවා කරනුයේ වෙයි. නුදුන් දැ ගන්නා සුලුයේ වෙයි, කාමයන්හි මිස හසර ඇතියේ වෙයි. මුසවා බණන සුලුයේ වෙයි. පිසුන් බස් ඇතියේ වෙයි. පරොස් බස් ඇතියේ වෙයි. සම්ඵප්‍ර‍ලාප ඇතියේ වෙයි. අභිධ්‍යාලූ වෙයි. ව්‍යාපාදයට පත් සිතැතියේ වෙයි. මිසදිටු ඇතියේ වෙයි. මහණෙනි, මේ දස ධර්මයෙන් සමන්වාගත වූයේ ගෙනෙන ලද්දක් බහා තැබුයේ යම් සේ වේ නම් එසේ නිරයෙහි වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, දස ධර්මයෙකින් සමන්වාගත වූයේ ගෙන එන ලද්දක් බහා තැබුයේ යම් සේ වේ නම්, එසේ ස්වර්‍ගයෙහි වෙයි. කවර දසයෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "පණිවායෙන් වැළැකියේ වෙයි. අයිනාදනින් වැළැකියේ වෙයි. කාමයන්හි මිසහසරින් වැළැකියේ වෙයි. මුසවායෙන් වැළැකියේ වෙයි. පිසුන් බසින් වැළැකියේ වෙයි. පරොස් බසින් වැළැකියේ වෙයි. සම්ඵප්‍ර‍ලාපයෙන් වැළැකියේ වෙයි. අනභිධ්‍යාලූ වෙයි. අබ්‍යාපාදයට පත් සිතැතියේ වෙයි. සම්දිටු ඇතියේ වෙයි. මහණෙනි, මෙ දස ධර්මයෙන් සමන්වාගත වූයේ ගෙනෙන ලද්දක් බහා තැබුයේ යම් සේ වේ නම් එසේ ස්වර්‍ගයෙහි වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10.5.2.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දෙවැනි සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, විසි කරුණෙකින් සමන්වාගත වූයේ ගෙනෙන ලද්දක් බහා තැබුයේ යම් සේ වේ නම්, එසේ නිරයෙහි වෙයි. කවර විස්සෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේ ද ප්‍රාණඝාතී වෙයි මෙරමා ද ප්‍රාණඝාතයෙහි සමාදන් කරවයි. තෙමේ ද නුදුන් දැ ගන්නා සුලුයේ වෙයි. මෙරමා ද අයිනාදනින් සමාදන් කරවයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 566,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච කාමෙසු මිච්ඡාචාරී හොති, පරඤ්ච කාමෙසු මිච්ඡාචාරෙ සමාදපෙති. අත්තනා ච මුසාවාදී හොති, පරඤ්ච මුසාවාදෙ සමාදපෙති. අත්තනා ච පිසුනවාචො හොති, පරඤ්ච පිසුනාය වාචාය සමාදපෙති. අත්තනා ච ඵරුසාවාචො හොති, පරඤ්ච ඵරුසාය වාචාය සමාදපෙති. අත්තනා ච සම්ඵප්පලාපී හොති, පරඤ්ච සම්ඵප්පලාපෙ සමාදපෙති. අත්තනා ච අභිජ්ඣාලූ හොති, පරඤ්ච අභිජ්ඣාය සමාදපෙති. අත්තනා ච ව්යාපන්නචිත්තො හොති, පරඤ්ච ව්යාපාදෙ සමාදපෙති. අත්තනා ච මිච්ඡාදිට්ඨිකො හොති, පරඤ්ච මිච්ඡාදිට්ඨියා සමාදපෙති. ඉමෙහි ඛො භික්ඛවෙ වීසතියා ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "වීසතියා භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙ, කතමෙහි වීසතියා,"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච පාණාතිපාතා පටිවිරතො හොති, පරඤ්ච පාණාතිපාතා වෙරමණියා සමාදපෙති. අත්තනා ච අදින්නාදානා පටිවිරතො හොති, පරඤ්ච අදින්නාදානා වෙරමණියා සමාදපෙති. අත්තනා ච කාමෙසු මිච්ඡාචාරා පටිවිරතො හොති, පරඤ්ච කාමෙසු මිච්ඡාචාරා වෙරමණියා සමාදපෙති. අත්තනා ච මුසාවාදා පටිවිරතො හොති, පරඤ්ච මුසාවාදා වෙරමණියා සමාදපෙති. අත්තනා ච පිසුනාය වාචාය පටිවිරතො හොති, පරඤ්ච පිසුනාය වාචාය වෙරමණියා සමාදපෙති. අත්තනා ච ඵරුසාය වාචාය පටිවිරතො හොති, පරඤ්ච ඵරුසායා වාචාය වෙරමණියා සමාදපෙති. අත්තනා ච සම්ඵප්පලාපා පටිවිරතො හොති, පරඤ්ච සම්ඵප්පලාපා වෙරමණියා සමාදපෙති. අත්තනා ච අනභිජ්ඣාලූ හොති, පරඤ්ච අනභිජ්ඣාය සමාදපෙති. අත්තනා ච අබ්යාපන්නචිත්තො හොති, පරඤ්ච අබ්යාපාදෙ සමාදපෙති. අත්තනා ච සම්මාදිට්ඨිකො හොති, පරඤ්ච සම්මාදිට්ඨියා සමාදපෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ වීසතියා ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "තෙමේ ද කාමයන්හි මිසහසර ඇතියේ වෙයි. මෙරමා ද කාමයන්හි මිස හසරයෙහි සමාදන් කරවයි. තෙමේ ද මුසවා ඇතියේ වෙයි. මෙරමා ද මුසවායෙහි සමාදන් කරවයි. තෙමේ ද පිසුනු බස් ඇතියේ වෙයි. මෙරමා ද පිසුනු බස්හි සමාදන් කරවයි. තෙමේ ද පරොස් බස් ඇතියේ වෙයි. මෙරමා ද පරොස් බස්හි සමාදන් කරවයි. තෙමේ ද සම්ඵප්‍ර‍ලාප ඇතියේ වෙයි. මෙරමා ද සම්ඵප්‍ර‍ලාපයෙහි සමාදන් කරවයි. තෙමේ ද අභිධ්‍යාලූ වෙයි. මෙරමා ද අභිධ්‍යායෙහි සමාදන් කරවයි. තෙමේ ද ව්‍යාපාදයට පත් සිතැතියේ වෙයි. මෙරමා ද ව්‍යාපාදයෙහි සමාදන් කරවයි. තෙමේ ද මිථ්‍යා දෘෂ්ටික වෙයි. මෙරමා ද මිථ්‍යාදෘෂ්ටිකයෙහි සමාදන් කරවයි. මහණෙනි, මේ විසි කරුණිකින් සමන්වාගත වූයේ ගෙන එන ලද්දක් බහා තැබුයේ යම් සේ වේ නම්, එසේ නිරයෙහි වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, විසි කරුණෙකින් සමන්වාගත වූයේ ගෙන එන ලද්දක් බහා තැබුයේ යම් සේ වේ නම්, එසේ ස්වර්‍ගයෙහි වෙයි. කවර විස්සෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේ ද පණිවායෙන් වැළැකියේ වෙයි. මෙරමා ද පණිවායෙන් වැළැකීමෙහි සමාදන් කරවයි. තෙමේ ද අයිනාදනින් වැළැකියේ වෙයි. මෙරමා ද අයිනාදනින් වැළැකීමෙහි සමාදන් කරවයි. තෙමේ ද කාමයෙහි මිස හසරින් වැළැකියේ වෙයි. මෙරමා ද කාමයන්හි මිස හසරින් වැළැකීමෙහි සමාදන් කරවයි. තෙමේ ද මුසාවායෙන් වැළැකියේ වෙයි. මෙරමා ද මුසාවායෙන් වැළැකීමෙහි සමාදන් කරවයි. තෙමේ ද පිසුනු බසින් වැළැකියේ වෙයි. මෙරමා ද පිසුනු බසින් වැළැකීමෙහි සමාදන් කරවයි. තෙමේ ද පරොස් බසින් වැළැකියේ වෙයි. මෙරමා ද පරොස් බසින් වැළැකීමෙහි සමාදන් කරවයි. තෙමේ ද සම්ඵප්‍ර‍ලපායෙන් වැළැකියේ වෙයි. මෙරමා ද සම්ඵප්‍ර‍ලාපයෙන් වැළැකීමෙහි සමාදන් කරවයි. තෙමේ ද අනභිධ්‍යාලූ වෙයි. මෙරමා ද අනභිධ්‍යායෙහි සමාදන් කරවයි. තෙමේ ද අව්‍යාපාදයට සිතැතියේ වෙයි. මෙරමා ද අව්‍යාපාදායෙහි සමාදන් කරවයි. තෙමේ ද සම්‍යක්දෘෂ්ටික වෙයි. මෙරමා ද සම්‍යක්දෘෂ්ටිකයෙහි සමාදන් කරවයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ විසි කරුණින් සමන්වාගත වූයේ ගෙන එන ලද්දක් බහා තැබුයේ යම් සේ නම් එසේ ස්වර්‍ගයෙහි වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 568,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 5. 2. 3",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තතිය සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "තිංසාය භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ. කතමෙහි තිංසාය:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච පාණාතිපාතී හොති, පරඤ්ච පාණාතිපාතෙ සමාදපෙති, පාණාතිපාතෙ ච සමනුඤ්ඤො හොති. අත්තනා ච අදින්නාදායී හොති, පරඤ්ච අදින්නාදානෙ සමාදපෙති, අදින්නාදානෙ ච සමනුඤ්ඤො හොති. අත්තනා ච කාමෙසු මිච්ඡාචාරී හොති, පරඤ්ච කාමෙසු මිච්ඡාචාරෙ සමාදපෙති, කාමෙසු මිච්ඡාචාරෙ ච සමනුඤ්ඤො හොති. අත්තනා ච මුසාවාදී හොති, පරඤ්ච මුසාවාදෙ සමාදපෙති, මුසාවාදෙ ච සමනුඤ්ඤො හොති. අත්තනා ච පිසුනවාචො හොති, පරඤ්ච පිසුනාය වාචාය සමාදපෙති, පිසුනාය වාචාය ච සමනුඤ්ඤො හොති. අත්තනා ච ඵරුසවාචො හොති, පරඤ්ච ඵරුසාය වාචාය සමාදපෙති, ඵරුසාය වාචාය ච සමනුඤ්ඤො හොති. අත්තනා ච සම්ඵප්පලාපී හොති, පරඤ්ච සම්ඵප්පලාපෙ සමාදපෙති, සම්ඵප්පලාපෙ ච සමනුඤ්ඤො හොති. අත්තනා ච අභිජ්ඣාලූ හොති, පරඤ්ච අභිජ්ඣාය සමාදපෙති, අභිජ්ඣාය ච සමනුඤ්ඤො හොති. අත්තනා ච ව්යාපන්න චිත්තො හොති, පරඤ්ච ව්යාපාදෙ සමාදපෙති, ව්යාපාදෙ ච සමනුඤ්ඤො හොති. අත්තනා ච මිච්ඡාදිට්ඨිකො හොති, පරඤ්ච මිච්ඡාදිට්ඨියා සමාදපෙති, මිච්ඡාදිට්ඨියා ච සමනුඤ්ඤො හොති. ඉමෙහි ඛො භික්ඛවෙ තිංසාය ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තිංසාය භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙ. කතමෙහි තිංසාය:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච පාණාතිපාතා පටිවිරතො හොති, පරඤ්ච පාණාතිපාතා වෙරමණියා සමාදපෙති, පාණාතිපාතා වෙරමණියා ච සමනුඤ්ඤො හොති. අත්තනා ච අදින්නාදානා පටිවිරතො හොති, පරඤ්ච අදින්නාදානා වෙරමණියා සමාදපෙති, අදින්නාදානා වෙරමණියා ච සමනුඤ්ඤො හොති. අත්තනා ච කාමෙසු මිච්ඡාචාරා පටිවිරතො හොති, පරඤ්ච කාමෙසු මිච්ඡාචාරා වෙරමණියා සමාදපෙති, කාමෙසු මිච්ඡාචාරා වෙරමණියා ච සමනුඤ්ඤො හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10.5.2.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තුන්වැනි සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තිස් කරුණෙකින් සමන්වාගත වූයේ ගෙන එන ලද්දක් බහා තැබූයේ යම් සේ නම් එසේ නිරයෙහි වෙයි: කවර තිසෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේ ද ප්‍රාණඝාතී වෙයි. මෙරමා ද ප්‍රාණඝාතයෙහි සමාදන් කරවයි. ප්‍රාණඝාතයෙහි සමසිතැතියේ වෙයි. තෙමේ ද අදින්නාදායී වෙයි. මෙරමා ද අයිනාදන්හි සමාදන් කරවයි. අයිනාදන්හි සම සිතැතියේ ද වෙයි. තෙමේ ද කාමයන්හි මිථ්‍යාචාරී වෙයි. මෙරමා ද කාමයන්හි මිස හසරෙහි සමාදන් කරවයි. කාමමිථ්‍යාචාරයෙහි සමසිතැතියේ වෙයි. තෙමේ ද මුසවා කියන සුලු වෙයි. මෙරමා දු මුසවායෙහි සමාදන් කරවයි. මුසවායෙහි සම සිතැතියේ ද වෙයි. තෙමේ පිසුනු බසැතියේ ද වෙයි. මෙරමා ද පිසුනුයෙහි සමාදන් කරවයි. පිසුනු බස්හි සමනුඥ වෙයි. තෙමේ පරොස් බසැතියේ ද වෙයි. මෙරමා ද පරොස්බස්හි සමාදන් කරවයි. පරොස් බස්හි තෙමේ සමනුඥ ද වෙයි. තෙමේ සම්ඵප්‍ර‍ලාප කියනුයේ ද වෙයි. මෙරමා ද සම්ඵප්‍ර‍ලාපයෙහි සමාදන් කරවයි. සම්ඵප්‍ර‍ලාපයෙහි සමනුඥ ද වෙයි. තෙමේ අභිධ්‍යාලූ ද වෙයි. මෙරමා ද අභිධ්‍යායෙහි සමාදන් කරවයි. අභිධ්‍යායෙහි සමනුඥ ද වෙයි. තෙමේ ව්‍යාපාදයට පත් සිතැතියේ ද වෙයි. මෙරමා ද ව්‍යාපාදයෙහි සමාදන් කරවයි. ව්‍යාපාදයෙහි සමනුඥ ද වෙයි. තෙමේ මිථ්‍යාදෘෂ්ටික ද වෙයි. මෙරමා ද මිථ්‍යාදෘෂ්ටියෙහි සමාදන් කරවයි. මිථ්‍යාදෘෂ්ටියෙහි සමනුඥ ද වෙයි. මහණෙනි, මෙ තිස් දහමින් සමන්වාගත වූයේ ගෙනෙන ලද්දක් බහා තැබුයේ යම් පරිදි වේ නම්, එසේ නිරයෙහි වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, තිස් කරුණෙකින් සමන්වාගත වූයේ ගෙනෙන ලද්දක් බහා තැබූයේ යම් පරිදි වේ නම් එ පරිදි ස්වර්‍ගයෙහි වෙයි: කවර තිස් කරුණෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේ ද ප්‍රාණඝාතයෙන් වැළැකියේ වෙයි. මෙරමා ද ප්‍රාණඝාතයෙන් වැළැකීමෙහි සමාදන් කරවයි. ප්‍රාණඝාත විරතියෙහි සමනුඥ ද වෙයි. තෙමේ අයිනාදනින් වැළකියේ ද වෙයි. මෙරමා ද අයිනාදනින් වැළැකීමෙහි සමාදන් කරවයි. අයිනාදනින් වැළකීමෙහි සමනුඥ ද වෙයි. තෙමේ කාමමිථ්‍යාචාරයෙන් වැළකියේ වෙයි. මෙරමා ද කාමමිථ්‍යාචාරයෙන් වැළැකීමෙහි සමාදන් කරවයි. කාමමිථ්‍යාචාර විරතියෙහි සමනුඥ ද වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 570,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච මුසාවාදා පටිවිරතො හොති, පරඤ්ච මුසාවාදා වෙරමණියා සමාදපෙති, මුසාවාදා වෙරමණියා ච සමනුඤ්ඤො හොති. අත්තනා ච පිසුනාය වාචාය පටිවිරතො හොති, පරඤ්ච පිසුනාය වාචාය වෙරමණියා සමාදපෙති, පිසුනාය වාචාය වෙරමණියා ච සමනුඤ්ඤො හොති. අත්තනා ච ඵරුසාය වාචාය පටිවිරතො හොති, පරඤ්ච පරුසාය වාචාය වෙරමණියා සමාදපෙති, ඵරුසාය වාචාය වෙරමණියා ච සමනුඤ්ඤො හොති. අත්තනා ච සම්ඵප්පලාපා පටිවිරතො හොති, පරඤ්ච සම්ඵප්පලාපා වෙරමණියා සමාදපෙති, සම්ඵප්පලාපා වෙරමණියා ච සමනුඤ්ඤො හොති. අත්තනා ච අනභිජ්ඣාලූ හොති, පරඤ්ච අනභිජ්ඣාය සමාදපෙති, අනභිජ්ඣාය ච සමනුඤ්ඤො හොති. අත්තනා ච අබ්යාපන්න චිත්තො හොති, පරඤ්ච අව්යාපාදෙ සමාදපෙති, අව්යාපාදෙ ච සමනුඤ්ඤො හොති. අත්තනා ච සම්මාදිට්ඨිකො හොති, පරඤ්ච සම්මාදිට්ඨියා සමාදපෙති, සම්මාදිට්ඨියා ච සමනුඤ්ඤො හොති, ඉමෙහි ඛො භික්ඛවෙ තිංසාය ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 5. 2. 4",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "චතුත්ථ සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "චත්තාරිසාය භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ. කතමෙහි චත්තාරිසාය:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච පාණාතිපාතී හොති, පරඤ්ච පාණාතිපාතෙ සමාදපෙති, පාණාතිපාතෙ ච සමනුඤ්ඤො හොති, පාණාතිපාතස්ස ච වණ්ණං භාසති. අත්තනා ච අදින්නාදායී හොති, පරඤ්ච අදින්නාදානෙ සමාදපෙති, අදින්නාදානෙ ච සමනුඤ්ඤො හොති, අදින්නාදානස්ස ච වණ්ණං භාසති. අත්තනා ච කාමෙසු මිච්ඡාචාරී හොති, පරඤ්ච කාමෙසු මිච්ඡාචාරෙ සමාදපෙති, කාමෙසු මිච්ඡාචාරෙ ච සමනුඤ්ඤො හොති, කාමෙසු මිච්ඡාචාරස්ස ච වණ්ණං භාසති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච මුසාවාදී හොති, පරඤ්ච මුසාවාදෙ සමාදපෙති, මුසාවාදෙ ච සමනුඤ්ඤො හොති, මුසාවාදස්ස ච වණ්ණං භාසති. අත්තනා ච පිසුනවාචො හොති, පරඤ්ච පිසුනාය වාචාය සමාදපෙති, පිසුනාය වාචාය සමනුඤ්ඤො හොති, පිසුනාය ච වාචාය වණ්ණං භාසති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "තෙමේ ද මුසවායෙන් වැළකියේ වෙයි. මෙරමා ද මෘෂාවාද විරතියෙහි සමාදන් කරවයි. මෘෂාවාද විරතියෙහි සමනුඥ ද වෙයි. තෙමේ ද පිසුනු බසින් වැළකියේ වෙයි. මෙරමා ද පිසුනු බසින් වැළැකීමෙහි සමාදන් කරවයි. පිසුන් වචන විරතියෙහි සමනුඥ ද වෙයි. තෙමේ ද පරුෂ වචනයෙන් වැළැකියේ වෙයි. මෙරමා ද පරුෂවචනවිරතියෙහි සමාදන් කරවයි. පරුෂ වචන විරතියෙහි සමනුඥ ද වෙයි. තෙමේ ද සම්ඵප්‍ර‍ලාපයෙන් වැළැකියේ වෙයි. මෙරමා ද සම්ඵප්‍ර‍ලාපවිරතියෙහි සමාදන් කරවයි. සම්ඵප්‍ර‍ලාපවිරතියෙහි සමනුඥ ද වෙයි. තෙමේ ද අනභිධ්‍යාලූ වෙයි. මෙරමා ද අනභිධ්‍යායෙහි සමාදන් කරවයි. අනභිධ්‍යායෙහි සමනුඥ ද වෙයි. තෙමේ ද අව්‍යාපන්නචිත්ත වෙයි. මෙරමා ද අව්‍යාපාදයෙහි සමාදන් කරවයි. අව්‍යාපාදයෙහි සමනුඥ ද වෙයි. තෙමේ ද සම්‍යග්දෘෂ්ටික වෙයි. මෙරමා ද සම්‍යග්දෘෂ්ටියෙහි සමාදන් කරවයි. සම්‍යග්දෘෂ්ටියෙහි සමනුඥ ද වෙයි. මහණෙනි, මේ තිස් කරුණින් සමන්වාගත වූයේ ගෙනෙන ලද්දක් බහා තැබුයේ යම් සේ ද එ පරිදි ස්වර්‍ගයෙහි වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10.5.2.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සතරවැනි සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, ධර්‍ම සතළිසෙකින් සමන්වාගත වූයේ ගෙනෙන ලද්දක් බහා තැබූයේ යම් සේ නම් එසේ නිරයෙහි වෙයි: කවර සතළිසෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේ ද ප්‍රාණඝාතී වෙයි. මෙරමා ද ප්‍රාණඝාතයෙහි සමාදන් කරවයි. ප්‍රාණඝාතයෙහි සමනුඥ ද වෙයි. ප්‍රාණඝාතයාගේ ගුණ ද බෙණෙයි. තෙමේ ද අයිනාදන් ගන්නාසුලු වෙයි. මෙරමා ද අයිනාදන්හි සමාදන් කරවයි. අයිනාදන්හි සමනුඥ ද වෙයි. අයිනාදන්හි ගුණ ද බෙණෙයි. තෙමේ ද කාමමිථ්‍යාචාරී වෙයි. මෙරමා ද කාමමිථ්‍යාචාරයෙහි සමාදන් කරවයි. කාමමිථ්‍යාචාරයෙහි සමනුඥ ද වෙයි. කාමමිථ්‍යාචාරයාගේ ගුණ ද බෙණෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේ ද මුසවා කියනසුලු වෙයි. මෙරමා ද මුසවායෙහි සමාදන් කරවයි. මුසවායෙහි සමනුඥ ද වෙයි. මුසවාහි ගුණ ද බෙණෙයි. තෙමේ ද පිසුනුබසැතියේ වෙයි. මෙරමා ද පිසුනුබස්හි සමාදන් කරවයි. පිසුන්බස්හි සමනුඥ ද වෙයි. පිසුනුබස්හුගේ ගුණ ද බෙණෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 572,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච ඵරුසවාචො හොති, පරඤ්ච ඵරුසාය වාචාය සමාදපෙති, ඵරුසාය වාචාය ච සමනුඤ්ඤො හොති, ඵරුසාය වාචාය ච වණ්ණං භාසති. අත්තනා ච සම්ඵප්පලාපී හොති, පරඤ්ච සම්ඵප්පලාපෙ සමාදපෙති, සම්ඵප්පලාපෙ ච සමනුඤ්ඤො හොති, සම්ඵප්පලාපස්ස ච වණ්ණං භාසති. අත්තනා ච අභිජ්ඣාලූ හොති, පරඤ්ච අභිජ්ඣාය සමාදපෙති, අභිජ්ඣාය ච සමනුඤ්ඤො හොති, අභිජ්ඣාය ච වණ්ණං භාසති. අත්තනා ච ව්යාපන්නචිත්තො හොති, පරඤ්ච ව්යාපාදෙ සමාදපෙති, ව්යාපාදෙ සමනුඤ්ඤො හොති, ව්යාපාදස්ස ච වණ්ණං භාසති. අත්තනා ච මිච්ඡාදිට්ඨිකො හොති, පරඤ්ච මිච්ඡාදිට්ඨියා සමාදපෙති, මිච්ඡාදිට්ඨියා ච සමනුඤ්ඤො හොති, මිච්ඡාදිට්ඨියා ච වණ්ණං භාසති. ඉමෙහි ඛො භික්ඛවෙ චත්තාරීසාය ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "චත්තාරීසාය භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙ, කතමෙහි චත්තාරීසාය:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච පාණාතිපාතා පටිවිරතො හොති, පරඤ්ච පාණාතිපාතා වෙරමණියා සමාදපෙති, පාණාතිපාතා වෙරමණියා ච සමනුඤ්ඤො හොති, පාණාතිපාතා වෙරමණියා ච වණ්ණං භාසති. අත්තනා ච අදින්නාදානා පටිවිරතො හොති, පරඤ්ච අදින්නාදානා වෙරමණියා සමාදපෙති, අදින්නාදානා වෙරමණියා ච සමනුඤ්ඤො හොති, අදින්නාදානා වෙරමණියා ච වණ්ණං භාසති. අත්තනා ච කාමෙසු මිච්ඡාචාරා පටිවිරතො හොති, පරඤ්ච කාමෙසු මිච්ඡාචාරා වෙරමණියා සමාදපෙති, කාමෙසු මිච්ඡාචාරා වෙරමණියා ච සමනුඤ්ඤො හොති, කාමෙසු මිච්ඡාචාරා වෙරමණියා ච වණ්ණං භාසති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච මුසාවාදා පටිවිරතො හොති, පරඤ්ච මුසාවාදා වෙරමණියා සමාදපෙති, මුසාවාදා වෙරමණියා ච සමනුඤ්ඤො හොති, මුසාවාදා වෙරමණියා ච වණ්ණං භාසති. අත්තනා ච පිසුනාය වාචාය පටිවිරතො හොති, පරඤ්ච පිසුනාය වාචාය වෙරමණියා සමාදපෙති, පිසුනාය වාචාය වෙරමණියා ච සමනුඤ්ඤො හොති, පිසුනාය වාචාය වෙරමණියා ච වණ්ණං භාසති. අත්තනා ච ඵරුසාය වාචාය පටිවිරතො හොති, පරඤ්ච ඵරුසාය වාචාය වෙරමණියා සමාදපෙති, ඵරුසාය වාචාය වෙරමණියා ච සමනුඤ්ඤො හොති, ඵරුසාය වාචාය වෙරමණියා ච වණ්ණං භාසති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "තෙමේ ද පරොස් බස් ඇතියේ වෙයි. මෙරමා ද පරොස්බස්හි සමාදන් කරවයි, පරොස්බස්හි සමනුඥ ද වෙයි. පරොස්බස්හුගේ ගුණ ද බෙණෙයි. තෙමේ ද සම්ඵප්‍ර‍ලාප ඇතියේ වෙයි, මෙරමා ද සම්ඵප්‍ර‍ලාපයෙහි සමාදන් කරවයි, සම්ඵප්‍ර‍ලාපයෙහි සමනුඥ ද වෙයි. සම්ඵප්‍ර‍ලාපයාගේ ගුණ ද බෙණෙයි. තෙමේ ද අභිධ්‍යාලූ වෙයි, මෙරමා ද අභිධ්‍යායෙහි සමාදන් කරවයි. අභිධ්‍යායෙහි සමනුඥ ද වෙයි. අභිධ්‍යාව ගේ ගුණ ද බෙණෙයි. තෙමේ ද ව්‍යාපන්නචිත්ත වෙයි. මෙරමා ද ව්‍යාපාදයෙහි සමාදන් කරවයි, ව්‍යාපාදයෙහි සමනුඥ ද වෙයි. ව්‍යාපාදයාගේ ගුණ ද බෙණෙයි. තෙමේ ද මිථ්‍යදෘෂ්ටික වෙයි. මෙරමා ද මිථ්‍යාදෘෂ්ටියෙහි සමාදන් කරවයි. මිථ්‍යාදෘෂ්ටියෙහි සමනුඥ ද වෙයි, මිථ්‍යාදෘෂ්ටිහුගේ ගුණ ද බෙණෙයි. මහණෙනි, මෙ සතළිස් කරුණින් සමන්වාගත වූයේ ගෙනෙන ලද්දක් බහා තැබූයේ යම් සේ නම්, එසේ නිරයෙහි වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සතළිස් කරුණෙකින් සමන්වාගත වූයේ ගෙනෙන ලද්දක් බහා තැබුයේ යම් සේ නම් එසේ ස්වර්‍ගයෙහි වෙයි. කවර සතළිසෙකින යත්;",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේ ද ප්‍රාණඝාතයෙන් වැළකියේ වෙයි. මෙරමා ද ප්‍රාණඝාතවීරමණයෙහි සමාදන් කරවයි. ප්‍රාණඝාතවිරමණයෙහි සමනුඥ ද වෙයි. ප්‍රාණඝාතවිරමණයාගේ ගුණ ද බෙණෙයි. තෙමේ ද අයිනාදනින් වැළකියේ වෙයි. මෙරමා ද අයිනාදනින් විරමණයෙහි සමාදන් කරවයි, අදින්නාදාන විරමණයෙහි සමනුඥ ද වෙයි. තෙමේ ද කාමමිථ්‍යචාරයෙන් වැළකියේ වෙයි. මෙරමා ද කාමමිථ්‍යචාර විරමණයෙහි සමාදන් කරවයි. කාමමිථ්‍යචාරවීරමණයෙහි සමනුඥ ද වෙයි. කාමමිථ්‍යචාරවිරමණයාගේ ගුණ ද බෙණෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේ ද මුසවායෙන් වැළැකියේ වෙයි. මෙරමා ද මුසවායෙන් විරමණයෙහි සමාදන් කරවයි, මුසාවාදවිරමණයෙහි සමනුඥ ද වෙයි. මෘෂවාදවිරමණයාගේ ගුණ ද බෙණෙයි. තෙමේ ද පිසුනු බසින් වැළැකියේ වෙයි, මෙරමා ද පිසුනු බසින් වැළකී මෙහි සමාදන් කරවයි. පිසුනු බසින් විරමණයෙහි සමනුඥ ද වෙයි. පිසුනු බසින් විරමණයාගේ ගුණ ද බෙණෙයි. තෙමේ ද පරුෂවචනයෙන් වැළැකියේ වෙයි, මෙරමා ද පරොස්බසින් වැළැකීමෙහි සමාදන් කරවයි. පරුෂවචනවිරමණයෙහි සමනුඥ ද වෙයි. පරුෂවචනවිරතිහුගේ ගුණ ද බණෙයි",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 574,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච සම්ඵප්පලාපා පටිවිරතො හොති, පරඤ්ච සම්ඵප්පලාපා වෙරමණියා සමාදපෙති, සම්ඵප්පලාපා වෙරමණියා ච සමනුඤ්ඤො හොති, සම්ඵප්පලාපා ච වෙරමණියා වණ්ණං භාසති. අත්තනා ච අනභිජ්ඣාලූ හොති, පරඤ්ච අනභිජ්ඣාය සමාදපෙති, අනභිජ්ඣාය ච සමනුඤ්ඤො හොති, අනභිජ්ඣාය ච වණ්ණං භාසති. අත්තනා ච අව්යාපන්නචිත්තො හොති, පරඤ්ච අව්යාපාදෙ සමාදපෙති, අව්යාපාදෙ ච සමනුඤ්ඤො හොති, අව්යාපාදස්ස ච වණ්ණං භාසති. අත්තනා ච සම්මාදිට්ඨිකො හොති, පරඤ්ච සම්මාදිට්ඨියා සමාදපෙති, සම්මාදිට්ඨියා ච සමනුඤ්ඤො හොති, සම්මාදිට්ඨියා ච වණ්ණං භාසති, ඉමෙහි ඛො භික්ඛවෙ චත්තාරීසාය ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 5. 2. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පඤ්චමාදි සුත්තානි",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දසහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො ඛතං උපහතං අත්තානං පරිහරති -පෙ- අක්ඛතං අනුපහතං අත්තානං පරිහරති -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 2. 6.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "වීසතියා භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 2. 7.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "තිංසාය භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 2. 8.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "චත්තාරීසාය භික්ඛවෙ ධම්මෙහි සමන්නාගතො ඛතං උපහතං අත්තානා පරිහරති -පෙ- අක්ඛතං අනුපහතං අත්තානං පරිහරති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "තෙමේ ද සම්ඵප්‍ර‍ලාපයෙන් වැළැකියේ වෙයි. මෙරමා ද සම්ඵප්‍ර‍ලාප විරමණයෙහි සමාදන් කරවයි. සම්ඵප්‍ර‍ලාපවිරමණයෙහි සමනුඥ ද වෙයි. සම්ඵප්‍ර‍ලාපවිරමණයාගේ ගුණ ද බෙණෙයි. තෙමේ ද අනභිධ්‍යා ලූ වෙයි, මෙරමා ද අනභිධ්‍යායෙහි සමාදන් කරවයි. අනභිධ්‍යායෙහි සමනුඥ ද වෙයි. අනභිධ්‍යාවගේ ගුණ ද බෙණෙයි. තෙමේ ද අව්‍යාපන්න චිත්ත වෙයි, මෙරමා ද, අව්‍යාපාදයෙහි සමාදන් කරවයි, අව්‍යාපාදයෙහි සමනුඥ ද වෙයි. අව්‍යාපාදයාගේ ගුණ ද බෙණෙයි. තෙමේ ද සම්‍යග්දෘෂ්ටික වෙයි. මෙරමා ද සම්‍යග්දෘෂ්ටියෙහි සමාදන් කරවයි. සම්‍යග්දෘෂ්ටියෙහි සමනුඥ ද වෙයි. සම්‍යග්දෘෂ්ටියගේ ගුණ ද බෙණෙයි. මහණෙනි, මෙ සතළිස් කරුණින් සමන්වාගත වූයේ ගෙනෙන ලද්ද බහා තැබූයේ යම් සේ ද එසේ ස්වර්‍ගයෙහි වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10.5.2.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පඤ්චමාදි සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, දස කරුණෙකින් සමන්වාගත වූයේ සාරාලූ ගුණ ඇති නටගුණ ඇති ආත්ම පරිහරණය කරයි. ... ගුණ විසින් සාරා නො දැමූ නොනට ගුණ ඇති ආත්ම පරිහරණ කරයි. ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.2.6.",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, විසි කරුණෙකින් …",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.2.7.",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තිස් කරුණෙකින් …",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.2.8.",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, සතළිස් කරුණෙකින් සමන්වාගත වූයේ සාරාලූ ගුණ ඇති නටගුණ ඇති ආත්ම පරිහරණය කරයි. ... නොදැමුණු ගුණ ඇති නොනට ගුණ ඇති ආත්ම පරිහරණය කරයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 576,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "10. 5. 2. 9.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දසහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො ඉධෙකච්චො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජති. -පෙ- ඉධෙකච්චො කායස්ස භෙදා පරම්මරණා සුගති සග්ගං ලොකං උපපජ්ජති."
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 2. 10.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "වීසතියා භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 2. 11.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "තිංසාය භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 2. 12.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "චත්තාරීසාය භික්ඛවෙ ධම්මෙහි සමන්නාගතො ඉධෙකච්චො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජති -පෙ- ඉධෙකච්චො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති."
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 2. 13.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දසහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො බාලො වෙදිතබ්බො -පෙ- පණ්ඩිතො වෙදිතබ්බො -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 2. 14.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "වීසතියා භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 2. 15.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "තිංසාය භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 2. 16.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "චත්තාරීසාය භික්ඛවෙ ධම්මෙහි සමන්නාගතො බාලො වෙදිතබ්බො -පෙ- පණ්ඩිතො වෙදිතබ්බො -පෙ- ඉමෙහි ඛො භික්ඛවෙ චත්තාරීසාය ධම්මෙහි සමන්නාගතො පණ්ඩිතො වෙදිතබ්බොති."
                    },
                    {
                        "type": "centered",
                        "text": "සාමඤ්ඤවග්ගො දුතියො",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "10.5.2.9.",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මෙලොව්හි දස කරුණෙකින් සමන්වාගත වූ ඇතැමෙක් කාබුන් මරණින් මතු අපාය නම් වූ දුර්‍ගති නම් වූ විනිපාත නම් වූ නිරයට පැමිණේ. ... මෙලොව්හි ඇතැමෙක් කාබුන් මරණින් මතු සුගති නම් වූ ස්වර්‍ගලොකයට එළඹෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.2.10.",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, විසි කරුණෙකින් ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.2.11.",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තිස් කරුණෙකින් ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.2.12.",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මෙලොව්හි සතළිස් කරුණෙකින් සමන්වාගත වූ ඇතැමෙක් කාබුන් මරණින් මතු අපාය සඞ්ඛ්‍යාත, දුර්‍ගති සඞ්ඛ්‍යාත, විනිපාත සංඞ්ඛ්‍යාත නිරයට පැමිණේ. ... මෙලොව්හි ඇතැමෙක් කාබුන් මරණින් මතු සුගති සඞ්ඛ්‍යාත ස්වර්‍ගලොකයට පැමිණේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.2.13.",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, දස කරුණෙකින් සමන්වාගත බාල තෙමේ දත යුත්තේය: ... පණ්ඩිත තෙම දතයුත්තේ ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.2.14.",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, විසි කරුණෙකින් ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.2.15.",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තිස් කරුණෙකින් …",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.2.16.",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, සතළිස් කරුණෙකින් සමන්වාගත වූ බාලතෙම දත යුත්තේය -පෙ- පණ්ඩිත තෙම දත යුත්තේය. මහණෙනි, මෙ සතළිස් කරුණෙන් සමන්වාගත වූ පණ්ඩිත දතයුත්තේ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "දෙවැනි සාමඤ්ඤ වර්‍ග යි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 578,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. රාගාදිපෙය්යාලං",
                        "level": 2
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 1.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "රාගස්ස භික්ඛවෙ අභිඤ්ඤාය දසධම්මා භාවෙතබ්බා. කතමෙ දස: අසුභසඤ්ඤා මරණසඤ්ඤා ආහාරෙ පටික්කූලසඤ්ඤා සබ්බලොකෙ අනභිරතසඤ්ඤා අනිච්චසඤ්ඤා අනිච්චෙ දුක්ඛසඤ්ඤා දුක්ඛෙ අනත්තසඤ්ඤා පහානසඤ්ඤා විරාගසඤ්ඤා නිරොධසඤ්ඤා, රාගස්ස භික්ඛවෙ අභිඤ්ඤාය ඉමෙ දසධම්මා භාවෙතබ්බා."
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 2.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "රාගස්ස භික්ඛවෙ අභිඤ්ඤාය දසධම්මා භාවෙතබ්බා. කතමෙ දස: අනිච්චසඤ්ඤා අනත්තසඤ්ඤා ආහාරෙ පටික්කූලසඤ්ඤා සබ්බලොකෙ අනභිරතසඤ්ඤා අට්ඨිකසඤ්ඤා පුලවකසඤ්ඤා{1} විනීලකසඤ්ඤා විපුබ්බකසඤ්ඤා විච්ඡිද්දකසඤ්ඤා උද්ධුමාතකසඤ්ඤා. රාගස්ස භික්ඛවෙ අභිඤ්ඤාය ඉමෙ දසධම්මා භාවෙතබ්බාති."
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 3.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "රාගස්ස භික්ඛවෙ අභිඤ්ඤාය දසධම්මා භාවෙතබ්බා. කතමෙ දස: සම්මාදිට්ඨි සම්මාසඞ්කප්පො සම්මාවාචා සම්මාකම්මන්තො සම්මාආජීවො සම්මාවායාමො සම්මාසති සම්මාසමාධි සම්මාඤාණං සම්මාවිමුත්ති. රාගස්ස භික්ඛවෙ අභිඤ්ඤාය ඉමෙ දසධම්මා භාවෙතබ්බාති."
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 4-6",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "රාගස්ස භික්ඛවෙ පරිඤ්ඤාය -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 7-9",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "රාගස්ස භික්ඛවෙ පරික්ඛයාය -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 10-12",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "රාගස්ස භික්ඛවෙ පහානාය -පෙ-"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පුලවකසඤ්ඤා - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "3. රාගාදිපෙය්‍යාලය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.1.",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, රාගයාගේ අභිඥාව පිණිස දසදහම් කෙනෙක් වැඩිය යුතුවහ. කවර දස දෙනෙක යත්: අසුභසඤ්ඤා ය, මරණසඤ්ඤා ය, ආහාරයෙහි පටික්කුලසඤ්ඤා ය, සර්වලොකයෙහි අනභිරත සඤ්ඤා ය, අනිච්ච සඤ්ඤා ය, අනිච්චෙ දුක්ඛ සඤ්ඤා ය, දුක්ඛෙඅනත්තසඤ්ඤා ය, පහානසඤ්ඤා ය, විරාගසඤ්ඤා ය, නිරොධසඤ්ඤා යි. මහණෙනි, රාගයාගේ අභිඥාව පිණිස මෙ දස දහම්හු වැඩිය යුතුවහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.2.",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, රාගයාගේ අභිඥාව පිණිස, දශධර්‍ම කෙනෙක් වැඩිය යුතුවහ, කවර දශ කෙනෙක යත්: අනිච්චසඤ්ඤා ය, අනත්තසඤ්ඤා ය, ආහාරෙ පටික්කුලසඤ්ඤා ය, සබ්බලොකෙ අනභිරත සංඤ්ඤා ය, අට්ඨික සඤ්ඤා ය, පුලවක සඤ්ඤා ය, විනීලකසඤ්ඤා ය, විපුබ්බකසඤ්ඤාය, විච්ඡිද්දකසඤ්ඤා ය, උද්ධුමාතකසඤ්ඤා යි, මහණෙනි, රාගයාගේ අභිඥාව සඳහා මෙ දස දහම්හු වැඩිය යුතුවහ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.3.",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, රාගයාගේ අභිඥාව සඳහා දශධර්‍ම කෙනෙක් වැඩිය යුතුවහ, කවර දශ කෙනෙක යත්: සම්මාදිට්ඨි ය, සම්මාසඞ්කප්ප ය, සම්මාවාචා ය, සම්මාකම්මන්ත ය, සම්මාආජීව ය, සම්මාවායාම ය, සම්මාසතිය, සම්මාසමාධි ය, සම්මාඤාණ ය, සම්මාවිමුත්ති යි, මහණෙනි, රාගයාගේ අභිඥාව සඳහා මෙ දස දහම්හු වැඩිය යුතුවහයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.4-6",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, රාගයාගේ පරිඥාව පිණිස, ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.7-9",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, රාගයාගේ පරික්ෂය ය පිණිස ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.10-12",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, රාගයාගේ ප්‍ර‍හාණය පිණිස ...",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 580,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 13-15",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "රාගස්ස භික්ඛවෙ ඛයාය -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 16-18",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "රාගස්ස භික්ඛවෙ වයාය -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 19-21",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "රාගස්ස භික්ඛවෙ විරාගාය පෙ"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 22-24",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "රාගස්ස භික්ඛවෙ නිරොධාය -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "උපසමාය -පෙ-{*}"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 25-27",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "රාගස්ස භික්ඛවෙ චාගාය -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 28-30",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "රාගස්ස භික්ඛවෙ පටිනිස්සග්ගාය -පෙ- ඉමෙ දසධම්මා භාවෙතබ්බාති."
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 31-60",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දොසස්ස භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 90",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "මොහස්ස භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 120",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "කොධස්ස භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 150",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "උපනාහස්ස භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 180",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "මක්ඛස්ස භික්ඛවෙ -පෙ-"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "*. ‘උපසමායා’ති පදය දකනිපාතාදිසු රාගපෙය්යාලෙ අදිස්සමානත්තා අට්ඨාන පති__තත්__ති මඤ්ඤෙ,"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "10.5.3.13-15",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, රාගයාගේ ක්ෂය පිණිස ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.16-18",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, රාගයාගේ ව්‍යය පිණිස ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.19-21",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, රාගයාගේ විරාගය පිණිස ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.22-24",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, රාගයාගේ නිරොධය පිණිස ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": ""
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.25-27",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, රාගයාගේ ත්‍යාගය පිණිස ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.28-30",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, රාගයාගේ ප්‍ර‍තිනිස්සර්ජනය පිණිස මෙ දස දහම්හු වැඩිය යුත්තාහ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.31-60",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, ද්වෙෂයාගේ ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.90",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මොහයාගේ ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.120",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, ක්‍රොධයාගේ ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.150",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, උපනාහයාගේ ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.180",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මක්ඛයාගේ ...",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 582,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 210",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "පලාසස්ස භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 240",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉස්සාය භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 270",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "මච්ඡරියස්ස භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 300",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "මායාය භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 330",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සාඨෙය්යස්ස භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 360",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ථම්භස්ස භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 390",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සාරම්භස්ස භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 420",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "මානස්ස භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 450",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "අතිමානස්ස භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 480",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "මදස්ස භික්ඛවෙ -පෙ-"
                    },
                    {
                        "type": "heading",
                        "text": "10. 5. 3. 510",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "පමාදස්ස භික්ඛවෙ අභිඤ්ඤාය -පෙ- පරිඤ්ඤාය -පෙ- පරික්ඛයාය -පෙ- පහානාය -පෙ- ඛයාය -පෙ- වයාය -පෙ- විරාගාය -පෙ- නිරොධාය -පෙ- උපසමාය -පෙ- චාගාය -පෙ- පටිනිස්සග්ගාය ඉමෙ දසධම්මා භාවෙතබ්බාති."
                    },
                    {
                        "type": "centered",
                        "text": "රාගාදිපෙය්යාලං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "දසකනිපාතො නිට්ඨිතො.",
                        "level": 2
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "10.5.3.210",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, පලාසයාගේ ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.240",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, ඊර්‍ෂ්‍යාවගේ ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.270",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මාත්සර්‍ය්‍යයාගේ ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.300",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මායාවගේ ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.330",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, සාඨෙය්‍යයාගේ ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.360",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, ථම්භයාගේ ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.390",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, සාරම්භයාගේ ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.420",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මානයාගේ ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.450",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, අතිමානයාගේ ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.480",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මදයාගේ ...",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "10.5.3.510",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, ප්‍ර‍මාදයාගේ අභිඥානය පිණිස ... පරිඥානය පිණිස ... පරික්ෂය පිණිස ... ප්‍ර‍හාණය පිණිස ... ක්ෂය පිණිස ... ව්‍යය පිණිස ... විරාගය පිණිස ... නිරොධය පිණිස ... ත්‍යාගය පිණිස ... ප්‍ර‍තිනිස්සර්ජනය පිණිස ... දස දහම්හු වැඩිය යුත්තාහ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "රාගදිපෙය්‍යාලය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "දසක නිපාතය නිමියේ ය.",
                        "type": "centered",
                        "level": 2
                    }
                ],
                "footnotes": []
            }
        }
    ],
    "bookId": 27,
    "pageOffset": 0
}