[
    {
        "filename": "an-1-13",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 42
            },
            {
                "type": "heading",
                "text": "13. එකපුග්ගලවග්ගො",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 13. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "**(සාවත්ථිනිදානං:)**"
            },
            {
                "type": "paragraph",
                "text": "එකපුග්ගලො භික්ඛවෙ ලොකෙ උප්පජ්ජමානො උප්පජ්ජති බහුජනහිතාය බහුජනසුඛාය ලොකානුකම්පාය{1 ලොකානුකම්පකාය - අට්ඨකථා (-) අන්තරිත පාඨො - සීමු. පොත්ථකෙ න දිස්සතෙ.} අත්ථාය හිතාය සුඛාය දෙවමනුස්සානං. කතමො එකපුග්ගලො: තථාගතො අරහං සම්මාසම්බුද්ධො. අයං ඛො භික්ඛවෙ එකපුග්ගලො ලොකෙ උප්පජ්ජමානො උප්පජ්ජති බහුජනහිතාය බහුජනසුඛාය ලොකානුකම්පාය අත්ථාය හිතාය සුඛාය දෙවමනුස්සානන්ති."
            },
            {
                "type": "page-break",
                "text": "44"
            },
            {
                "type": "heading",
                "text": "1. 13. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එකපුග්ගලස්ස භික්ඛවෙ පාතුභාවො දුල්ලභො ලොකස්මිං. කතමස්ස එකපුග්ගලස්ස: තථාගතස්ස අරහතො සම්මාසම්බුද්ධස්ස. ඉමස්ස ඛො භික්ඛවෙ එකපුග්ගලස්ස පාතුභාවො දුල්ලභො ලොකස්මින්ති."
            },
            {
                "type": "heading",
                "text": "1. 13. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එකපුග්ගලො භික්ඛවෙ ලොකෙ උප්පජ්ජමානො උප්පජ්ජති අච්ඡරියමනුස්සො. කතමො එකපුග්ගලො: තථාගතො අරහං සම්මාසම්බුද්ධො. අයං ඛො භික්ඛවෙ එකපුග්ගලො ලොකෙ උප්පජ්ජමානො උප්පජ්ජති අච්ඡරියමනුස්සොති."
            },
            {
                "type": "heading",
                "text": "1. 13. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එකපුග්ගලස්ස භික්ඛවෙ කාලකිරියා බහුනො ජනස්ස අනුතප්පා{1 ආනුතප්පා - කත්ථචි.}හොති. කතමස්ස එකපුග්ගලස්ස: තථාගතස්ස අරහතො සම්මාසම්බුද්ධස්ස. ඉමස්ස ඛො භික්ඛවෙ එකපුග්ගලස්ස කාලකිරියා බහුනො ජනස්ස අනුතප්පා හොතීති."
            },
            {
                "type": "heading",
                "text": "1. 13. 5 – 13.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එකපුග්ගලො භික්ඛවෙ ලොකෙ උප්පජ්ජමානො උප්පජ්ජති අදුතියො අසහායො, අප්පටිමො, අප්පටිසමො, අප්පටිභාගො, අප්පටිපුග්ගලො, අසමො අසමසමො, දිපදානං අග්ගො. කතමො එකපුග්ගලො: තථාගතො අරහං සම්මාසම්බුද්ධො. අයං ඛො භික්ඛවෙ එකපුග්ගලො ලොකෙ උප්පජ්ජමානො උප්පජ්ජති අදුතියො, අසහායො, අප්පටිමො, අප්පටිසමො, අප්පටිභාගො, අප්පටි පුග්ගලො, අසමො, අසමසමො, දිපදානං අග්ගොති."
            },
            {
                "type": "heading",
                "text": "1. 13. 14 – 25.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එකපුග්ගලස්ස භික්ඛවෙ පාතුභාවා මහතො චක්ඛුස්ස පාතුභාවො හොති, මහතො ආලොකස්ස පාතුභාවො හොති, මහතො ඔභාසස්ස පාතුභාවො හොති, ඡන්නං අනුත්තරියානං පාතුභාවො හොති, චතුන්නං පටිසම්භිදානං සච්ඡිකිරියා හොති, අනෙකධාතුපටිවෙධො හොති, නානාධාතුපටිවෙධො හොති, විජ්ජාවිමුත්තිඵලසච්ඡිකිරියා හොති, සොතාපත්තිඵලසච්ඡිකිරියා හොති, සකදාගාමිඵලසච්ඡිකිරියා හොති, අනාගාමිඵලසච්ඡිකිරියා හොති, අරහත්තඵලසච්ඡිකිරියා හොති. කතමස්ස එකපුග්ගලස්ස: තථාගතස්ස අරහතො සම්මාසම්බුද්ධස්ස. ඉමස්ස ඛො භික්ඛවෙ එකපුග්ගලස්ස පාතුභාවා මහතො චක්ඛුස්ස පාතුභාවො හොති, මහතො ආලොකස්ස පාතුභාවො හොති, මහතො ඔභාසස්ස පාතුභාවො හොති, ඡන්නං අනුත්තරියානං පාතුභාවො හොති, චතුන්නං පටිසම්භිදානං සච්ඡිකිරියා හොති, අනෙක ධාතුපටිවෙධො හොති, නානාධාතුපටිවෙධො හොති, විජ්ජාවිමුත්තිඵලසච්ඡිකිරියා හොති, සොතාපත්තිඵලසච්ඡිකිරියා හොති, සකදාගාමිඵලසච්ඡිකිරියා හොති, අනාගාමිඵලසච්ඡිකිරියා හොති, අරහත්තඵලසච්ඡිකිරියා හොතීති."
            },
            {
                "type": "page-break",
                "text": "46"
            },
            {
                "type": "heading",
                "text": "1. 13. 26.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකපුග්ගලම්පි සමනුපස්සාමි, යො එවං තථාගතෙන අනුත්තරං ධම්මචක්කං පවත්තිතං සම්මදෙව අනුප්පවත්තෙති, යථයිදං භික්ඛවෙ සාරිපුත්තො. සාරිපුත්තො භික්ඛවෙ තථාගතෙන අනුත්තරං ධම්මචක්කං පවත්තිතං සම්මදෙව අනුප්පවත්තෙතීති."
            },
            {
                "type": "centered",
                "text": "වග්ගො තෙරසමො",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 43
            },
            {
                "text": "13. ඒකපුග්ගල වර්ගය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 13. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "**[සැවැත් නිදානයි:]**"
            },
            {
                "text": "මහණෙනි, එක් පුද්ගලයෙක් ලොවැ (සත්ත්වලොකයෙහි = මිනිස්ලොවැ) උපදනට සමත් වූයේ බොහෝ දෙනාට හිත පිණිස බොහෝ දෙනාට සුව පිණිස ලොවට අනුකම්පා පිණිස දෙවිමිනිස්නට වැඩ පිණිස හිත පිණිස සුව පිණිස (අර්හත්ත්වඵලක්ෂණයෙහි) උපන්නේ වෙයි. කවර එක් පුද්ගලයෙක යත්: තථාගත අර්හත් සම්‍යක් සම්බුද්ධයන් වහන්සේ ය. මහණෙනි, මේ එක් පුද්ගලයා වනාහි ලොවැ උපදනට සමත් වූයේ බොහෝ දෙනාට හිත පිණිස බොහෝ දෙනාට සුව පිණිස ලොවට අනුකම්පා පිණිස දෙව්මිනිස්නට වැඩ පිණිස හිත පිණිස සුව පිණිස උපන්නේ වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "45"
            },
            {
                "type": "heading",
                "text": "1. 13. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "මහණෙනි, එක් පුද්ගලයක්හුගේ ඉපැද්ම ලොවැ දුර්ලභ ය. කවර එක් පුද්ගලයක්හුගේ ය? යත්: තථාගත අර්හත් සම්‍යක් සම්බුද්ධයන්වහන්සේගේ ය. මහණෙනි, මේ එක් පුද්ගලයාගේ ඉපැද්ම ලොවැ දුර්ලභ ය."
            },
            {
                "type": "heading",
                "text": "1. 13. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "මහණෙනි, එක් පුද්ගලයෙක් ලොවැ උපදනට සමත් වූයේ ආශ්චර්ය මනුෂ්‍ය ව උපන්නේ වෙයි. කවර එක් පුද්ගලයෙක යත්: තථාගත අර්හත් සම්‍යක් සම්බුද්ධයන් වහන්සේ ය. මහණෙනි, මේ එක් පුද්ගලයා වනාහි ලොවැ උපදනට සමත් වූයේ ආශ්චර්ය මනුෂ්‍ය ව උපන්නේ වෙයි."
            },
            {
                "type": "heading",
                "text": "1. 13. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "මහණෙනි, එක් පුද්ගලයක්හුගේ කාලක්‍රියාව බොහෝ දෙනාට අනුතාප කර වෙයි. කවර එක් පුද්ගලයක්හුගේ ය? යත්: තථාගත අර්හත් සම්‍යක් සම්බුද්ධයන් වහන්සේගේ (කාලක්‍රියාව) ය. මහණෙනි, මේ එක් පුද්ගලයාගේ කාලක්‍රියාව බොහෝ දෙනාට අනුතාපකර (චෙතොදුඃඛාවහ) වෙයි."
            },
            {
                "type": "heading",
                "text": "1. 13. 5 - 13",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "මහණෙනි, එක් පුද්ගලයෙක් ලොවැ උපදනට පොහොනේ අද්විතීය ව, අසහාය ව, අප්‍රතිම ව, අප්‍රතිසම ව, අප්‍රතිභාග ව, අප්‍රතිපුද්ගල ව, අසම ව, අසමසම ව, දෙපා ඇතියනට අග්‍ර ව උපන්නේවෙයි. කවර එක් පුද්ගලයෙක යත්: තථාගත අර්හත් සම්‍යක් සම්බුද්ධයන් වහන්සේ ය. මහණෙනි, මේ එක් පුද්ගල තෙමේ වනාහි ලොවැ උපදනට පොහොනේ අද්විතීය ව, අසහාය ව, අප්‍රතිම ව, අප්‍රතිසම ව, අප්‍රතිභාග ව, අප්‍රතිපුද්ගල ව, අසම ව, අසමසම ව, දෙපා ඇතියනට අග්‍ර ව උපන්නේ වෙයි."
            },
            {
                "type": "heading",
                "text": "1. 13. 14 - 25",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "මහණෙනි, එක් පුද්ගලයක්හුගේ නිෂ්පත්තිය හේතු කොට ගෙන මහත් වූ ප්‍රඥාචක්ෂුස්හුගේ පහළ වීම වෙයි, මහත් වූ ප්‍රඥාලෝකයක්හුගේ පහළ වීම වෙයි, මහත් වූ ප්‍රඥාවභාසයක්හුගේ පහළ වීම වෙයි, අනුත්තරියධර්මයන් සදෙනාගේ පහළ වීම වෙයි, සිවුපිළිසැඹියාවන්ගේ පසක් කිරීම වෙයි, (අටළොස් වැදෑරුම්) අනෙක ධාතුන්ගේ ප්‍රතිවෙධය වෙයි, (අටළොස් වැදෑරුම්) නානාධාතුන්ගේ ප්‍රතිවෙධය වෙයි, විද්‍යාවිමුක්තිඵලයන්ගේ සාක්‍ෂාත් කිරීම වෙයි, ස්‍රොතාපත්ති ඵලයාගේ සාක්‍ෂාත් කිරීම වෙයි, සකෘදාගාමි ඵලයාගේ සාක්‍ෂාත් කිරීම වෙයි, අනාගාමී ඵලයාගේ සාක්‍ෂාත් කිරීම වෙයි, අර්හත්ත්ව ඵලයාගේ සාක්‍ෂාත් කිරීම වෙයි, කවර එක් පුද්ගලයක්හුගේය? යත්: තථාගත අර්හත් සම්‍යක් සම්බුද්ධයන් වහන්සේගේ ය. මහණෙනි, මේ එක් පුද්ගලයාගේ නිෂ්පත්තියෙන් මහත් වූ ප්‍රඥාචක්ෂුස්හුගේ පහළ වීම වෙයි, මහත් වූ ප්‍රඥාලෝකයාගේ පහළ වීම වෙයි, මහත් වූ ප්‍රඥාවභාසයාගේ පහළ වීම වෙයි, අනුත්තරිය ධර්මයන් සදෙනාගේ පහළ වීම වෙයි, සිවුපිළිසැඹියාවන්ගේ සාක්‍ෂාත් කිරීම වෙයි, අනෙක ධාතු ප්‍රතිවෙධය වෙයි, නානාධාතුප්‍රතිවෙධය වෙයි, විද්‍යාවිමුක්තිඵලයාගේ සාක්‍ෂාත් කිරීම වෙයි, ස්‍රොතාපත්ති ඵලයාගේ සාක්‍ෂාත් කිරීම වෙයි, සකෘදාගාමි ඵලයාගේ සාක්‍ෂාත් කිරීම වෙයි, අනාගාමී ඵලයාගේ සාක්‍ෂාත් කිරීම වෙයි, අර්හත්ත්ව ඵලයාගේ සාක්‍ෂාත් කිරීම වෙයි. "
            },
            {
                "type": "page-break",
                "text": "47"
            },
            {
                "type": "heading",
                "text": "1. 13. 26.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "මහණෙනි, යමෙක් මෙසේ තථාගතයන් වහන්සේ විසින් පවත්වන ලද අනුත්තර වූ ධර්මචක්‍රය මොනොවට ම (තථාගතයන්) අනුව පවත්වා ද, මහණෙනි, ශාරීපුත්‍රයන් බඳු අන් එක පුඟුලකුදු මම නො දක්මි. මහණෙනි, සැරියුත් තෙමේ තථාගතයන් වහන්සේ විසින් පවත්වන ලද අනුත්තර වූ ධර්මචක්‍රය මනා කොට ම (තථාගතයන්) අනු ව පවත්වයි."
            },
            {
                "text": "තෙළෙස්වන වගයි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-1-13"
    }
]