[
    {
        "filename": "an-1-7",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 22
            },
            {
                "type": "heading",
                "text": "7. වීරියාරම්භවග්ගො",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 7. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා වා අකුසලා ධම්මා පරිහායන්ති, යථයිදං භික්ඛවෙ විරියාරම්භො.{2 විරියාරම්භො - මඡසං.} ආරද්ධවිරියස්ස{3 ආරද්ධ විරියස්ස - මඡසං.} භික්ඛවෙ අනුප්පන්නා චෙව කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච අකුසලා ධම්මා පරිහායන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 7. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා අකුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා වා කුසලා ධම්මා පරිහායන්ති, යථයිදං භික්ඛවෙ මහිච්ඡතා. මහිච්ඡස්ස භික්ඛවෙ අනුප්පන්නා චෙව අකුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච කුසලා ධම්මා පරිහායන්තී."
            },
            {
                "type": "heading",
                "text": "1. 7. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා වා අකුසලා ධම්මා පරිහායන්ති, යථයිදං භික්ඛවෙ අප්පිච්ඡතා. අප්පිච්ඡස්ස භික්ඛවෙ අනුප්පන්නා චෙව කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච අකුසලා ධම්මා පරිහායන්තීති."
            },
            {
                "type": "page-break",
                "text": "24"
            },
            {
                "type": "heading",
                "text": "1. 7. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා අකුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා වා කුසලා ධම්මා පරිහායන්ති, යථයිදං භික්ඛවෙ අසන්තුට්ඨිතා. අසන්තුට්ඨස්ස භික්ඛවෙ අනුප්පන්නා චෙව අකුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච කුසලා ධම්මා පරිහායන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 7. 5.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා වා අකුසලා ධම්මා පරිහායන්ති, යථයිදං භික්ඛවෙ සන්තුට්ඨිතා. සන්තුට්ඨස්ස භික්ඛවෙ අනුප්පන්නා චෙව කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච අකුසලා ධම්මා පරිහායන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 7. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා අකුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා වා කුසලා ධම්මා පරිහායන්ති, යථයිදං භික්ඛවෙ අයොනිසො මනසිකාරො. අයොනිසො භික්ඛවෙ මනසි කරොතො අනුප්පන්නා චෙව අකුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච කුසලා ධම්මා පරිහායන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 7. 7.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා වා අකුසලා ධම්මා පරිහායන්ති, යථයිදං භික්ඛවෙ යොනිසො මනසිකාරො. යොනිසො භික්ඛවෙ මනසිකරොතො අනුප්පන්නා චෙව කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච අකුසලා ධම්මා පරිහායන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 7. 8.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා අකුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා වා කුසලා ධම්මා පරිහායන්ති, යථයිදං භික්ඛවෙ අසම්පජඤ්ඤං. අසම්පජානස්ස භික්ඛවෙ අනුප්පන්නා චෙව අකුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච කුසලා ධම්මා පරිහායන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 7. 9.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා වා අකුසලා ධම්මා පරිහායන්ති, යථයිදං භික්ඛවෙ සම්පජඤ්ඤං. සම්පජානස්ස භික්ඛවෙ අනුප්පන්නා චෙව කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච අකුසලා ධම්මා පරිහායන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 7. 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා අකුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා වා කුසලා ධම්මා පරිහායන්ති, යථයිදං භික්ඛවෙ පාපමිත්තතා. පාපමිත්තස්ස භික්ඛවෙ අනුප්පන්නා චෙව අකුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච කුසලා ධම්මා පරිහායන්තීති."
            },
            {
                "type": "centered",
                "text": "වග්ගො සත්තමො.*{1 විරියාරම්භාදිවග්ගො - මඡසං.}",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 23
            },
            {
                "text": "7. වීර්යාරම්හ වර්ගය",
                "type": "heading",
                "level": 3
            },
            {
                "text": "1. 7. 1.",
                "type": "heading",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද කුශලධර්මයෝ උපදිත් නම්, උපන්නා වූ ද  අකුශලධර්මයෝ පිරිහෙත් නම්, මහණෙනි, වීර්යාරම්භය වැනි අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, ඇරඹු වැර ඇත්තාහට නූපන්නා වූ ද කුශලධර්මයෝ උපදිත්. උපන්නා වූ ද අකුශලධර්මයෝ පිරිහෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 7. 2.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද අකුශලධර්මයෝ උපදිත් නම්, උපන්නා වූ ද කුශල ධර්මයෝ පිරිහෙත් නම්, මහණෙනි, මහෙච්ඡතාව බඳු අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, මහෙච්ඡපුද්ගලයාහට නූපන්නා වූ ද අකුශල ධර්මයෝ උපදිත්. උපන්නා වූ ද කුශලධර්මයෝ පිරිහෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 7. 3.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද කුශලධර්මයෝ උපදිත් නම්, උපන්නා වූ ද අකුශලධර්මයෝ පිරිහෙත් නම්, මහණෙනි, අල්පේච්ඡතාව බඳු අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, අල්පේච්ඡයාහට නූපන්නා වූ ද කුශලධර්මයෝ උපදිත්, උපන්නා වූ ද අකුශලධර්මයෝ පිරිහෙත්.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "25"
            },
            {
                "type": "heading",
                "text": "1. 7. 4.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද අකුශලධර්මයෝ උපදිත් නම්, උපන්නා වූ ද කුශලධර්මයෝ පිරිහෙත් නම්, මහණෙනි, ලද දැයින් නොසතුටු බව (ලොභය) වැනි අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, ලද දැයින් නොසතුටු වන්නාහට නූපන්නා වූ ද අකුශලධර්මයෝ උපදිත්. උපන්නා වූ ද  කුශලධර්මයෝ පිරිහෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 7. 5.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද කුශලධර්මයෝ උපදිත් නම්, උපන්නා වූ ද අකුශලධර්මයෝ පිරිහෙත් නම්, මහණෙනි, ලද දැයින් සතුටු බව (අලොභය) බඳු අන් එක ධර්මයකුදු මම නොදක්මි. මහණෙනි, ලද  දැයින් සතුටු වන්නාහට නූපන්නා වූ ද කුශලධර්මයෝ උපදිත්, උපන්නා වූ ද අකුශලධර්මයෝ පිරිහෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 7. 6.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද අකුශලධර්මයෝ උපදිත් නම්, උපන්නා වූ ද කුශලධර්මයෝ පිරිහෙත් නම්, මහණෙනි, නුනුවණින් මෙනෙහි කිරීම වැනි අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, නුනුවණින් මෙනෙහි කරන්නාහට නූපන්නා වූ ද අකුශලධර්මයෝ උපදිත්, උපන්නා වූ ද කුශලධර්මයෝ පිරිහෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 7. 7.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද කුශලධර්මයෝ උපදිත් නම්, උපන්නා වූ ද  අකුශලධර්මයෝ පිරිහෙත් නම්, මහණෙනි, නුවණින් මෙනෙහි කිරීම වැනි අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, නුවණින් මෙනෙහි කරන්නාහට නූපන්නා වූ ද කුශලධර්මයෝ උපදිත්, උපන්නා වූ ද අකුශලධර්මයෝ පිරිහෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 7. 8.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද අකුශලධර්මයෝ උපදිත් නම්, උපන්නා වූ ද  කුශලධර්මයෝ පිරිහෙත් නම්, මහණෙනි, (මොහ සඞ්ඛ්‍යාත) අසම්පජඤ්ඤය වැනි අන් එක ධර්මයකුදු මම නොදක්මි. මහණෙනි, සම්මූඪ පුද්ගලයාහට නූපන්නා වූ ද අකුශලධර්මයෝ උපදිත්, උපන්නා වූ ද  කුශලධර්මයෝ පිරිහෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 7. 9.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණ නූපන්නා වූ ද කුශලධර්මයෝ උපදිත් නම්, උපන්නා වූ ද  අකුශලධර්මයෝ පිරිහෙත් නම්, මහණෙනි, සම්‍යක්ප්‍රඥාව (තීරණප්‍රඥාව) වැනි අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, සම්‍යක්ප්‍රඥායෙන් දක්නාහට නූපන්නා වූ ද කුශලධර්මයෝ උපදිත්, උපන්නා වූ ද  අකුශලධර්මයෝ පිරිහෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 7. 10.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් හේතු කොට ගෙණා නූපන්නා වූ ද අකුශලධර්මයෝ උපදිත් නම්, උපන්නා වූ ද කුශලධර්මයෝ පිරිහෙත් නම්, මහණෙනි, පාප මිත්‍රතාව වැනි අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, පාපමිත්‍රයන්  ඇත්තහුට නූපන්නා වූ ද අකුශලධර්මයෝ උපදිත්. උපන්නා වූ ද කුශලධර්මයෝ පිරිහෙත්.",
                "type": "paragraph"
            },
            {
                "text": "සත්වන වග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-1-7"
    }
]