[
    {
        "filename": "an-1-5",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 16
            },
            {
                "type": "heading",
                "text": "5. සූකවග්ගො.",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 5. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "**(සාවත්ථි නිදානං:)**"
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ සාලිසූකං වා යවසූකං වා මිච්ඡාපණිහිතං හත්ථෙන වා පාදෙන වා අක්කන්තං හත්ථං වා පාදං වා භෙච්ඡති,*{1 හෙජ්ජති - සීමු. මනොරථපූරණී.} ලොහිතං වා උප්පාදෙස්සතීති, නෙතං ඨානං විජ්ජති. තං කිස්ස හෙතු: මිච්ඡාපණිහිතත්තා භික්ඛවෙ සූකස්ස. එවමෙව ඛො භික්ඛවෙ සො වත භික්ඛු මිච්ඡාපණිහිතෙන චිත්තෙන අවිජ්ජං භෙච්ඡති, විජ්ජං උප්පාදෙස්සති, නිබ්බානං සච්ඡිකරිස්සතීති නෙතං ඨානං විජ්ජති. තං කිස්ස හෙතු: මිච්ඡාපණිහිතත්තා භික්ඛවෙ චිත්තස්සාති."
            },
            {
                "type": "heading",
                "text": "1. 5. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ සාලිසූකං වා යවසූකං වා සම්මාපණිහිතං හත්ථෙන වා පාදෙන වා අක්කන්තං හත්ථං වා පාදං වා භෙච්ඡති*{2 හෙජ්ජති - සීමු. මනොරථපූරණී.} ලොහිතං වා උප්පාදෙස්සතීති ඨානමෙතං විජ්ජති. තං කිස්ස හෙතු: සම්මා පණිහිතත්තා භික්ඛවෙ සූකස්ස.{3 සාලිසූකස්ස - ස්යා.} එවමෙව ඛො භික්ඛවෙ සො වත භික්ඛු සම්මාපණිහිතෙන චිත්තෙන අවිජ්ජං භෙච්ඡති, විජ්ජං උප්පාදෙස්සති, නිබ්බානං සච්ඡිකරිස්සතීති ඨානමෙතං විජ්ජති. තං කිස්ස හෙතු: සම්මාපණිහිතත්තා භික්ඛවෙ චිත්තස්සාති."
            },
            {
                "type": "heading",
                "text": "1. 5. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "ඉදාහං{4 ඉධාහං - ස්යා. මඡසං.} භික්ඛවෙ එකච්චං පුග්ගලං පදුට්ඨචිත්තං එවං චෙතසා චෙතො පරිච්ච පජානාමි: ඉමම්හි චෙ අයං සමයෙ පුග්ගලො කාලං කරෙය්ය, යථාභතං නික්ඛිත්තො එවං නිරයෙ. තං කිස්ස හෙතු: චිත්තං හිස්ස භික්ඛවෙ පදුට්ඨං. චෙතොපදොසහෙතුච්ච{5 චෙතොපදොස හෙතු ච - ස්යා. චෙතොපදොස හෙතු පන - මඡසං.} පන භික්ඛවෙ, එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 5. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "ඉදාහං භික්ඛවෙ එකච්චං පුග්ගලං පසන්නචිත්තං එවං චෙතසා චෙතො පරිච්ච පජානාමි: ඉමම්හි චෙ අයං සමයෙ පුග්ගලො කාලං කරෙය්ය, යථාභතං නික්ඛිත්තො එවං සග්ගෙ. තං කිස්ස හෙතු: චිත්තං හිස්ස භික්ඛවෙ පසන්නං. චෙතොපසාදහෙතුච්ච{6 චෙතොපසාද හෙතු ච - ස්යා. චෙතොපසාද හෙතු - පනමඡසං.} පන භික්ඛවෙ එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්තීති."
            },
            {
                "type": "page-break",
                "text": "18"
            },
            {
                "type": "heading",
                "text": "1. 5. 5.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ උදකරහදො ආවිලො ලුලිතො කලලීභූතො, තත්ථ චක්ඛුමා පුරිසො තීරෙ ඨිතො න පස්සෙය්ය සිප්පිසම්බුකම්පි*{1 සිප්පික සම්බුකම්පි - කත්ථචි.} සක්ඛරකඨලම්පි මච්ඡගුම්බම්පි චරන්තම්පි තිට්ඨන්තම්පි. තං කිස්ස හෙතු: ආවිලත්තා භික්ඛවෙ උදකස්ස. එවමෙව ඛො භික්ඛවෙ සො වත භික්ඛු ආවිලෙන චිත්තෙන අත්තත්ථං වා ඤස්සති, පරත්ථං වා ඤස්සති, උභයත්ථං වා ඤස්සති, උත්තරිං වා මනුස්සධම්මා අලමරියඤාණදස්සනවිසෙසං සච්ඡිකරිස්සතීති, නෙතං ඨානං විජ්ජති. තං කිස්ස හෙතු: ආවිලත්තා භික්ඛවෙ චිත්තස්සාති."
            },
            {
                "type": "heading",
                "text": "1. 5. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ උදකරහදො අච්ඡො විප්පසන්නො අනාවිලො, තත්ථ චක්ඛුමා පුරිසො තීරෙ ඨිතො පස්සෙය්ය සිප්පිසම්බුකම්පි සක්ඛරකඨලම්පි මච්ඡගුම්බම්පි චරන්තම්පි තිට්ඨන්තම්පි. තං කිස්ස හෙතු: අනාවිලත්තා භික්ඛවෙ උදකස්ස. එවමෙව ඛො භික්ඛවෙ සො වත භික්ඛු අනාවිලෙන චිත්තෙන අත්තත්ථං වා ඤස්සති, පරත්ථං වා ඤස්සති, උභයත්ථං වා ඤස්සති, උත්තරිං වා මනුස්සධම්මා අලමරියඤාණදස්සනවිසෙසං සච්ඡිකරිස්සතීති, ඨානමෙතං විජ්ජති. තං කිස්ස හෙතු: අනාවිලත්තා භික්ඛවෙ චිත්තස්සාති."
            },
            {
                "type": "heading",
                "text": "1. 5. 7.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ යානි කානිචි රුක්ඛජාතානං{2 රුක්ඛජාතානි - ස්යා.} ඵන්දනො{3 චන්දෙනා - ස්යා.} තෙසං අග්ගමක්ඛායති, යදිදං මුදුතාය චෙව කම්මඤ්ඤතාය ච. එවමෙව ඛො අහං භික්ඛවෙ න අඤ්ඤං{4 නාඤ්ඤං - ස්යා. මඡසං.} එකධම්මම්පි සමනුපස්සාමි, යං එවං භාවිතං බහුලීකතං මුදු ච{5 මුදුඤ්ච - සීමු.} හොති කම්මඤ්ඤඤ්ච{6 කම්මනියඤ්ච - ස්යා. කම්මඤ්ඤඤ්ච හොති - මඡසං.} යථයිදං චිත්තං. චිත්තං භික්ඛවෙ භාවිතං බහුලීකතං මුදු ච හොති කම්මඤ්ඤඤ්චාති."
            },
            {
                "type": "heading",
                "text": "1. 5. 8.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං ලහුපරිවත්තං, යථයිදං චිත්තං. යාවඤ්චිදං භික්ඛවෙ උපමාපි න සුකරා යාව ලහුපරිවත්තං චිත්තන්ති."
            },
            {
                "type": "heading",
                "text": "1. 5. 9.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "පභස්සරමිදං භික්ඛවෙ චිත්තං. තඤ්ච ඛො ආගන්තුකෙහි උපක්කිලෙසෙහි උපක්කිලිට්ඨන්ති."
            },
            {
                "type": "heading",
                "text": "1. 5. 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "පභස්සරමිදං භික්ඛවෙ චිත්තං. තඤ්ච ඛො ආගන්තුකෙහි උපක්කිලෙසෙහි විප්පමුත්තන්ති."
            },
            {
                "type": "centered",
                "text": "වග්ගො පඤ්චමො.{7 පණිහිත අච්ඡවග්ගො පඤ්චමො - මඡසං.}",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 17
            },
            {
                "text": "5. ශුක වර්ගය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 5. 1.",
                "level": "1"
            },
            {
                "text": "**[සැවැත් නිදානයි:]**",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, (උඩු අක් කොට නො තබා) වරදවා තබන ලද හැල්වී නංඩුයෙක් වේවයි යව වී නංඩුයෙක් වේව යි, අතින් වේවයි පයින් වේවයි, ඇක්මුනේ, අත වේවයි පය වේවයි බිඳුනේ ය, ලේ හෝ උපදවන්නේ ය යන මෙ  කරුණ විද්‍යමාන නො වේ. ඒ කවර හෙයින යත්: මහණෙනි, නංඩුව වරදවා තැබූ වන බැවිනි. මහණෙනි, එපරිදි එකාන්තයෙන් ඒ මහණ වරදවා තබන ලද සිතින් (දුඃඛාදි අට තන්හි නොදැනිම) ය යි කියන ලද අවිද්‍යාව  බිඳුනේ ය, (අභීන්මාර්ගඥාන සඞ්ඛ්‍යාත) විද්‍යාව උපදවන්නේ ය, නිර්වාණය සාක්ෂාත් කරන්නේ ය යාම මෙ  කරුණ විද්‍යමාන නො වේ. ඒ කවර හෙයින යත්:- මහණෙනි, සිත වරදවා තැබූ වන බැවිනි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 5. 2.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, (බිඳිනට හැකි සේ උඩුඅක් කොට) මොනොවට තබනා ලද හැල්වීනංඩුයෙක් වේවයි යවවීනංඩුයෙක්  වේවයි, අතින් වේවයි පයින් වේවයි, ඇක්මුනේ ඇත වේවයි, පය වේවයි බිඳුනේ ය, ලේ හෝ උපදවන්නේ ය  යන මෙකරුණ විද්‍යමාන වේ. ඒ කවර හෙයින යත්: මහණෙනි, නංඩුව මොනොවට තැබූ වන බැවිනි. මහණෙනි, එපරිදි එකාන්තයෙන් ඒ මහණ මොනොවට තබන ලද සිතින් අවිද්‍යාව බිඳුනේ ය, විද්‍යාව  උපදවන්නේ ය, නිර්වාණය සාක්ෂාත් කරන්නේ ය යන මෙකරුණ විද්‍යමාන වේ. ඒ කවර හෙයින යත්: මහණෙනි, සිත මොනොවට තැබූ වන බැවිනි. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 5. 3.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, මම මෙලොවැ (දෝෂයෙන්) ප්‍රදුෂ්ට වූ සිත් ඇති කිසි පුගුලකු “ඉදින් මේ පුද්ගල තෙමේ මෙ  සමයෙහි කලුරිය කරන්නේ නම්, (හිසින්) ගෙණවුත් තැබූයේ යම්සේ වේ ද, එසේ නිරයෙහි සිතුනේ”යි මෙසේ  මා සිතින් උහු සිත පිරිසිඳ දනිමි. ඒ කවර හෙයින යත්: මහණෙනි, මොහුගේ සිත ප්‍රදුෂ්ට ය, එහෙයිනි. මහණෙනි, මෙසේ මෙලොව සත්තව කෙනෙක් චිත්තප්‍රදෝෂහේතුයෙන් කාබුන් මරණින් මතු (සුවෙන්  තොර  බැවින්) අපාය නම් වූ (නපුරු ගති ඇති බැවින්) දුර්ගති නම් වූ (විවස ව පතිත වන බැවින්) විනිපාත නම් වූ  නිරයට පැමිණෙන්නාහු ය. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 5. 4.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, මම මෙලොවැ පහන් සිත් ඇති කිසි පුඟුලකු “ඉදින් මේ පුඟුල් මෙ සමයෙහි කලුරිය කරන්නේ නම්, (හිසින්) ගෙණවුත් තැබූයේ යම්සේ වේ ද, එසේ ස්වර්ගයෙහි සිටුනේ” යි මෙසේ මා සිතින් උහු සිත පිරිසිඳ දනිමි. ඒ කවර හෙයින යත්: මහණෙනි, මොහුගේ සිත පහන් වේ, එහෙයිනි. මහණෙනි, මෙලොව්හි සත්තව  කෙනෙක් මෙසේ චිත්තප්‍රසාදහේතුයෙනු දු කාබුන් මරණින් මතු (සුඛයට ගති වූ හෙයින්) සුගති නම් වූ  (මොනොවට අග්‍ර හෙයින්) සග්ග නම් වූ ලෝකයට පැමිණෙන්නාහු ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "19"
            },
            {
                "type": "heading",
                "text": "1. 5. 5.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් පරිදි නොපහන් වූ කැළැඹුනු මඬබිහිලි දියවිලෙක් වේ නම්, එහි ඇස් ඇති පුරුෂයෙක් තෙරැ සිටියේ හැසිරෙන්නා වූ ද සිටුනා වූ ද සිප්පිබෙල්ලන් හා සක්බෙල්ලනුදු කැට කැබලිති හා මස්කැල ද නොදක්නේ වේ. ඒ කවර හෙයින යත්: මහණෙනි, දිය නොපහන් වන බැවිනි. එපරිදි ම ඒ මහණ කැළැඹුනු සිතින් යුක්ත ව ඒකාන්තයෙන් ආත්මාර්ථ ය හෝ දැන ගන්නේය, පරාර්ථය හෝ දැන ගන්නේය, උභයාර්ථය හෝ දැන  ගන්නේය, (දශකුශලධර්ම සඞ්ඛ්‍යාත) මනුෂ්‍යධර්මයෙන් මත්තෙහි වූ ආර්යභාවය කිරීමට සමත් වූ  ඥානදර්ශනවිශේෂයක් හෝ පසක් කරන්නේය යන මෙකරුණ සිදු නො වේ. ඒ කවර හෙයින යත්: මහණෙනි, සිත නොපහන් වන බැවිනි. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 5. 6.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් පරිදි පිරිසිඳු වූ වෙසෙසින් පහන් වූ නොකැළැඹුනු දිය විලෙක් වේ නම්, එහි ඇස් ඇති  පුරුෂයෙක් තෙරැ සිටියේ හැසිරෙන්නා වූ ද සිටුනා වූ ද සිප්පිබෙල්ලන් හා සක්බෙල්ලනු දු කැටකැබලිති හා  මස්කැල ද දක්නේ වේ. ඒ කවර හෙයින යත්: මහණෙනි, දිය පහන් වන බැවිනි. මහණෙනි, එපරිදි  මා  ඒ  මහණ ඒකාන්තයෙන් නො කැළැඹුනු සිතින් ආත්මාර්ථය හෝ දැන ගන්නේය, පරාර්ථය  හෝ  දැන ගන්නේය, උභයාර්ථය හෝ දැන ගන්නේය, මනුෂ්‍යධර්මයෙන් මත්තෙහි වූ ආර්යභාවය ඇති කර ගැණීමට සමත්  ඥානදර්ශනවිශේෂයක් හෝ පසක් කරන්නේය යන මෙ කරුණ විද්‍යමාන වේ. ඒ කවර හෙයින යත්: මහණෙනි, සිත පහන් වන බැවිනි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 5. 7.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් පරිදි යම්කිසි වෘක්ෂ කෙනෙක් වෙත් නම්, ඔවුනතුරෙන් මෘදුත්වයෙන් හා කර්මණ්‍යතායෙනු දු බුදුරුදමුනුගස අග්‍ර යයි කියනු ලැබේ ද, මහණෙනි, එපරිදි ම යමෙක් මෙසේ වඩන ලද්දේ බහුල වශයෙන්  කරණ ලද්දේ මෘදුත් වේ නම්, කර්මණ්‍යත් වේ නම්, සිත බඳු අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, සිත වඩන ලද්දේ බහුල වශයෙන් කරණ ලද්දේ මෘදුත් වෙයි. කර්මණ්‍යත් වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 5. 8.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමෙක් මෙසේ වහා ඉපිද නස්නා සුලු වේ නම්, සිත බඳු අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, සිත අත්‍යර්ථයෙන් වහා පෙරළෙන සුලු වේ නම්, (එයට) උපමාවකුදු අතිශයදුෂ්කර වේ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 5. 9.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, මේ (භවාඞ්ග) සිත ප්‍රභාස්වර ය, හෙ ද වනාහි ආගන්තුක (ජවන්කෙණෙහි උපදනා රාගාදි) උපක්ලේශයන්ගෙන් කිලිටි වුයේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 5. 10.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, මේ (භවාඞ්ග) සිත ප්‍රභාස්වර ය, හෙ ද වනාහි ආගන්තුක උපක්ලේශයන්ගෙන් මිදින.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-1-5"
    }
]