[
    {
        "filename": "an-1-3",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 10
            },
            {
                "type": "heading",
                "text": "3. අකම්මනියවග්ගො",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 3. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "**(සාවත්ථිනිදානං:)**"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි යං එවං අභාවිතං අකම්මනියං හොති, යථයිදං*{1 යථයිදං භික්ඛවෙ චිත්තං - ස්යා. මඡසං.} චිත්තං. චිත්තං භික්ඛවෙ අභාවිතං අකම්මනියං හොතීති."
            },
            {
                "type": "heading",
                "text": "1. 3. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං භාවිතං කම්මනියං හොති, යථයිදං චිත්තං. චිත්තං භික්ඛවෙ භාවිතං කම්මනියං හොතීති."
            },
            {
                "type": "heading",
                "text": "1. 3. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං අභාවිතං මහතො අනත්ථාය සංවත්තති, යථයිදං චිත්තං. චිත්තං භික්ඛවෙ අභාවිතං මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 3. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං භාවිතං මහතො අත්ථාය සංවත්තති, යථයිදං චිත්තං. චිත්තං භික්ඛවෙ භාවිතං මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 3. 5.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං අභාවිතං අපාතුභූතං මහතො අනත්ථාය සංවත්තති, යථයිදං චිත්තං. චිත්තං භික්ඛවෙ අභාවිතං අපාතුභූතං මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 3. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං භාවිතං පාතුභූතං මහතො අත්ථාය සංවත්තති, යථයිදං චිත්තං. චිත්තං භික්ඛවෙ භාවිතං පාතුභූතං මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 3. 7.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං අභාවිතං අබහුලීකතං මහතො අනත්ථාය සංවත්තති, යථයිදං චිත්තං. චිත්තං භික්ඛවෙ අභාවිතං අබහුලීකතං මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "page-break",
                "text": "12"
            },
            {
                "type": "heading",
                "text": "1. 3. 8.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං භාවිතං බහුලීකතං මහතො අත්ථාය සංවත්තති. යථයිදං*{1 යථයිදං භික්ඛවෙ චිත්තං - ස්යා. මඡසං.} චිත්තං. චිත්තං, භික්ඛවෙ, භාවිතං බහුලීකතං මහතො අත්ථාය සංවත්තතී”ති."
            },
            {
                "type": "heading",
                "text": "1. 3. 9.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං අභාවිතං අබහුලීකතං දුක්ඛාවහං{2 ‘දුක්ඛාධිවාහං’ ඉතිපි පාඨො, අට්ඨකථායං.} හොති, යථයිදං චිත්තං. චිත්තං භික්ඛවෙ අභාවිතං අබහුලීකතං දුක්ඛාවහං{3 ‘දුක්ඛාධිවාහං’ ඉතිපි පාඨො, අට්ඨකථාය.} හොතීති."
            },
            {
                "type": "heading",
                "text": "1. 3. 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං භාවිතං බහුලීකතං සුඛාවහං{4 ‘සුඛාධිවාහං’ ඉති ච පාඨො, අට්ඨකථාය.} හොති, යථයිදං චිත්තං. චිත්තං භික්ඛවෙ භාවිතං බහුලීකතං සුඛාවහං{5 ‘සුඛාධිවාහං’ ඉති ච පාඨො, අට්ඨකථාය.} හොතීති."
            },
            {
                "type": "centered",
                "text": "වග්ගො තතියො.{6 අකම්මනියවග්ගො තතියො - මඡසං.}",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 11
            },
            {
                "text": "3. අකර්මණ්‍ය වර්ගය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 3. 1.",
                "level": "1"
            },
            {
                "text": "**[සැවැත් නිදානයි:]**",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ (භාවනා වශයෙන්) නොවඩන ලද්දේ අකර්මණ්‍ය (=කර්මයට අහිත) වේ නම්, චිත්තය  බඳු අන් එක ද ධර්මයක් මම (නුවණැසින්) නො දක්මි. මහණෙනි, නොවඩන ලද සිත අකර්මණ්‍ය වේ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 3. 2.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ (භාවනා වශයෙන්) වඩන ලද්දේ කර්මණ්‍ය වේ ද, චිත්තය බඳු අන් එක ද ධර්මයක්  මම් (නුවණැසින්) නො දක්මි. මහණෙනි, (භාවනා වශයෙන්) වඩන ලද සිත කර්මණ්‍ය වේ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 3. 3.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ (භාවනා වශයෙන්) නොවඩනා ලද්දේ මහත් වූ අනර්ථය පිණිස පවත්නේ නම්, සිත බඳු අන් එක ද ධර්මයක් මම් (නුවණැසින්) නො දක්මි. මහණෙනි, නොවඩන ලද සිත  මහත් අනර්ථය  පිණිස පවත්නේ  ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 3. 4.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ (භාවනා වශයෙන්) වඩන ලද්දේ මහත් අර්ථය පිණිස පවත්නේ නම්, සිත බඳු අන්  එක ද ධර්මයක් මම (නුවණැසින්) නො දක්මි. මහණෙනි, වැඩු සිත මහත් අර්ථය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 3. 5.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ නොවඩන ලද්දේ (විදර්ශනා මාර්ග ඵල නිර්වාණයන් අරමුණු කොට) පහළ නො වූයේ මහත් වූ අනර්ථය පිණිස පවත්නේ නම්, සිත බඳු අන් එක ධර්මයකුදු මම (නුවණැසින්) නො දක්මි. මහණෙනි, නොවැඩු (විදර්ශනාදිය අරමුණු කොට) පහළ නො වූ සිත මහත් වූ අනර්ථය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 3. 6.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ වඩන ලද්දේ පහළ වූයේ මහත් වූ අර්ථය පිණිස පවත්නේ නම්, සිත බඳු අන් එක ද  ධර්මයක් මම (නුවණැසින්) නො දක්මි. මහණෙනි, වැඩු (විදර්ශනාදිය අරමුණු කොට) පහළ වූ සිත මහත් වූ  අර්ථය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 3. 7.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ නොවඩන ලද්දේ බහුල වශයෙන් පුරුදු නොකරණ ලද්දේ මහත් වූ අනර්ථය පිණිස  පවත්නේ නම්, සිත බඳු අන් එක ද ධර්මයක් මම (නුවණැසින්) නො දක්මි. මහණෙනි, නො වැඩු බහුල වශයෙන් පුරුදු නොකළ සිත මහත් වූ අනර්ථය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "13"
            },
            {
                "type": "heading",
                "text": "1. 3. 8.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ වඩන ලද්දේ බහුල වශයෙන් කරණ ලද්දේ මහත් වූ අර්ථය පිණිස පවත්නේ නම්, සිත බඳු අන් එක ද ධර්මයක් මම් (නුවණැසින්)  නො දක්මි. මහණෙනි, වැඩු බහුල වශයෙන් කළ සිත මහත් වූ අර්ථය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 3. 9.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ නොවැඩුයේ බහුල වශයෙන් නොකෙළේ දුක් එළවන්නේ වේ නම්, සිත බඳු අන් එක ද ධර්මයක් මම (නුවණැසින්) නො දක්මි. මහණෙනි, නොවැඩු බහුල  වශයෙන් නොකළ සිත දුක් එළවන්නේ  වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 3. 10.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ වැඩුයේ බහුල වශයෙන් කෙළේ සුව එළවන්නේ වේ නම්, සිත බඳු අන් එක ද  ධර්මයක් මම (නුවණැසින්) නො දක්මි. මහණෙනි, භාවිතය වූ බහුලීකෘත වූ සිත සුව එළවන්නේ වේ.",
                "type": "paragraph"
            },
            {
                "text": "තෙවන වග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-1-3"
    }
]