[
    {
        "filename": "an-1-9",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 28
            },
            {
                "type": "heading",
                "text": "9. පමාදවග්ගො",
                "level": 3
            },
            {
                "type": "paragraph",
                "text": "**(සාවත්ථි නිදානං:)**"
            },
            {
                "type": "heading",
                "text": "1. 9. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං මහතො අනත්ථාය සංවත්තති. යථයිදං භික්ඛවෙ පමාදො. පමාදො භික්ඛවෙ මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 9. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං මහතො අත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ අප්පමාදො. අප්පපමාදො භික්ඛවෙ මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 9. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං මහතො අනත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ කොසජ්ජං. කොසජ්ජං භික්ඛවෙ මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "page-break",
                "text": "30"
            },
            {
                "type": "heading",
                "text": "1. 9. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං මහතො අත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ විරියාරම්භො. විරියාරම්භො භික්ඛවෙ මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 9. 5.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං මහතො අනත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ මහිච්ඡතා. මහිච්ඡතා භික්ඛවෙ මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 9. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං මහතො අත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ අප්පිච්ඡතා. අප්පිච්ඡතා භික්ඛවෙ මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 9. 7.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං මහතො අනත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ අසන්තුට්ඨිතා. අසන්තුට්ඨිතා භික්ඛවෙ මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 9. 8.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං මහතො අත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ සන්තුට්ඨිතා. සන්තුට්ඨිතා භික්ඛවෙ මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 9. 9.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං මහතො අනත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ අයොනිසො මනසිකාරො. අයොනිසො මනසිකාරො භික්ඛවෙ මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 9. 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං මහතො අත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ යොනිසො මනසිකාරො. යොනිසො මනසිකාරො භික්ඛවෙ මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 9. 11.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං මහතො අනත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ අසම්පජඤ්ඤං. අසම්පජඤ්ඤං භික්ඛවෙ මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 9. 12.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං මහතො අත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ සම්පජඤ්ඤං. සම්පජඤ්ඤං භික්ඛවෙ මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "page-break",
                "text": "32"
            },
            {
                "type": "heading",
                "text": "1. 9. 13.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං මහතො අනත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ පාපමිත්තතා. පාපමිත්තා භික්ඛවෙ මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 9. 14.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං මහතො අත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ කල්යාණමිත්තතා. කල්යාණමිත්තතා භික්ඛවෙ මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 9. 15.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං මහතො අනත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ අනුයොගො අකුසලානං ධම්මානං, අනනුයොගො කුසලානං ධම්මානං. අනුයොගො අකුසලානං ධම්මානං, අනනුයොගො කුසලානං ධම්මානං මහතො අනත්ථාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 9. 16.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යො එවං මහතො අත්ථාය සංවත්තති, යථයිදං භික්ඛවෙ අනුයොගො කුසලානං ධම්මාන, අනනුයොගො අකුසලානං ධම්මානං. අනුයොගො භික්ඛවෙ කුසලානං ධම්මානං, අනනුයොගො අකුසලානං ධම්මානං මහතො අත්ථාය සංවත්තතීති."
            },
            {
                "type": "centered",
                "text": "වග්ගො නවමො.*{1 පමාදවග්ගො නවමො - මඡසං.}",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 29
            },
            {
                "text": "9. ප්‍රමාද වර්ගය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "paragraph",
                "text": "**[සැවැත් නිදානයි:]**"
            },
            {
                "type": "heading",
                "text": "1. 9. 1.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමෙක් මෙසේ මහත් වූ අනර්ථය පිණිස පවත්නේ නම්, මහණෙනි, ප්‍රමාදය වැනි අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, ප්‍රමාදය මහත් අනර්ථය පිණිස පවත්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 9. 2.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමෙක් මෙසේ මහත් අර්ථය පිණිස පවත්නේ නම්, මහණෙනි, අප්‍රමාදය වැනි අන් එක ධර්මයකුදු නො දක්මි. මහණෙනි, අප්‍රමාදය මහත් අර්ථය පිණිස පවත්නේය. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 9. 3.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමෙක් මෙසේ මහත් අනර්ථය පිණිස පවත්නේ නම්, මහණෙනි, කුසීතබව වැනි අන් එක ධර්මයකුදු  මම නො දක්මි. මහණෙනි, කුසීතබව මහත් අනර්ථය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "31"
            },
            {
                "type": "heading",
                "text": "1. 9. 4.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් ධර්මයෙක් මෙසේ මහත් අර්ථය පිණිස පවත්නේ නම්, මහණෙනි, වීර්යාරම්භය වැනි අන් එක  ධර්මයකුදු මම නො දක්මි. මහණෙනි, වීර්යාරම්භය මහත් අර්ථය පිණිස පවත්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 9. 5.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මහත් අනර්ථය පිණිස පවත්නී නම්, මහණෙනි, මහෙච්ඡතා වැනි අන් එක ධර්මයකුදු මම  නො දක්මි. මහණෙනි, මහෙච්ඡතාව මහත් අනර්ථය පිණිස පවත්නී ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 9. 6.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ මහත් අර්ථය පිණිස පවත්නී නම්, මහණෙනි, අල්පේච්ඡතා වැනි අන් එක ධර්මයකුදු  මම නො දක්මි. මහණෙනි, අල්පේච්ඡතා මහත් අර්ථය පිණිස පවත්නී ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 9. 7.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ මහත් අනර්ථය පිණිස පවත්නී නම්, මහණෙනි, අසන්තුෂ්ටිතා බඳු අන් එක ධර්මයකුදු  මම නො දක්මි. මහණෙනි, අසන්තුෂ්ටිතා මහත් අනර්ථය පිණිස පවත්නී ය. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 9. 8.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ මහත් අර්ථය පිණිස පවත්නී නම්, මහණෙනි, සන්තුෂ්ටිතා බඳු අන් එක ධර්මයකුදු  මම නො දක්මි. මහණෙනි, සන්තුෂ්ටිතා මහත් අර්ථය පිණිස පවත්නී ය. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 9. 9.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමෙක් මෙසේ මහත් අනර්ථය පිණිස පවත්නේ නම්, මහණෙනි, නුනුවණින් මෙනෙහි කිරීම වැනි  අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, නුනුවණින් මෙනෙහි කිරීම මහත් අනර්ථය පිණිස පවත්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 9. 10.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමෙක් මෙසේ මහත් අර්ථය පිණිස පවත්නේ නම්, මහණෙනි, නුවණින් මෙනෙහි කිරීම වැනි අන් එක ධර්මයකුදු මම නො දක්මි.මහණෙනි, නුවණින් මෙනෙහි කිරීම මහත් අර්ථය පිණිස පවත්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 9. 11.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් ධර්මයෙක් මහත් අනර්ථය පිණිස පවත්නේ නම්, මහණෙනි, මෝහ සඞ්ඛයාත අසම්පජඤ්ඤය  වැනි අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, අසම්පජඤ්ඤය මහත් අනර්ථය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 9. 12.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් ධර්මයෙක් මෙසේ මහත් අර්ථය පිණිස පවත්නේ නම්, මහණෙනි සම්‍යක් ප්‍රඥාව වැනි අන් එක  ධර්මයකුදු මම නො දක්මි. මහණෙනි, සම්‍යක් ප්‍රඥාව මහත් අර්ථය පිණිස පවත්නී ය. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "33"
            },
            {
                "type": "heading",
                "text": "1. 9. 13.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ මහත් අනර්ථය පිණිස පවත්නී නම්, මහණෙනි, පාපමිත්‍රතාව බඳු අන් එක ධර්මයකුදු  මම නො දක්මි. මහණෙනි, පාපමිත්‍රතාව මහත් අනර්ථය පිණිස පවත්නී ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 9. 14.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමක් මෙසේ මහත් අර්ථය පිණිස පවත්නී නම්, මහණෙනි, කල්‍යාණමිත්‍රතාව බඳු අන් එක  ධර්මයකුදු මම නො දක්මි. මහණෙනි, කල්‍යාණමිත්‍රතාව මහත් අර්ථය පිණිස පවත්නී ය. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 9. 15.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් ධර්මයෙක් මෙසේ මහත් අනර්ථය පිණිස පවත්නේ නම්, මහණෙනි, අකුශලධර්මයන්හි යෙදීම  හා කුශලධර්මයන්හි නොයෙදීම බඳු අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, අකුශලධර්මයන්හි යෙදීම  හා කුශලධර්මයන්හි නොයෙදීම ද මහත් අනර්ථය පිණිස පවත්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 9. 16.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් ධර්මයෙක් මෙසේ මහත් අර්ථය පිණිස පවත්නේ නම්, මහණෙනි, කුශලධර්මයන්හි යෙදීම  හා අකුශලධර්මයන්හි නොයෙදීම බඳු අන් එක ධර්මයකුදු මම නො දක්මි. මහණෙනි, කුශලධර්මයන්හි යෙදීම  හා අකුශල ධර්මයන්හි නොයෙදීම ද මහත් අර්ථය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "text": "නවවන වග යි",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-1-9"
    }
]