[
    {
        "filename": "an-1-15",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 54
            },
            {
                "type": "heading",
                "text": "15. අට්ඨානපාළි",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 15. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "**(සාවත්ථිනිදානං:)**"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං දිට්ඨිසම්පන්නො පුග්ගලො කඤ්චි{1 කිඤ්ච - කත්ථචි.} සඞ්ඛාරං නිච්චතො උපගච්ඡෙය්ය, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං පුථුජ්ජනො කඤ්චි සඞ්ඛාරං නිච්චතො උපගච්ඡෙය්ය, ඨානමෙතං විජ්ජති.{2 විජ්ජතීති - මඡසං. ස්යා.}"
            },
            {
                "type": "heading",
                "text": "1. 15. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං දිට්ඨිසම්පන්නො පුග්ගලො කඤ්චි සඞ්ඛාරං සුඛතො උපගච්ඡෙය්ය, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං පුථුජ්ජනො කඤ්චි සඞ්ඛාරං සුඛතො උපගච්ඡෙය්ය, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "heading",
                "text": "1. 15. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං දිට්ඨිසම්පන්නො පුග්ගලො {3 }*කඤ්චි ධම්මං අත්තතො උපගච්ඡෙය්ය, නෙතං ඨානං විජ්ජති, ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං පුථුජ්ජනො කඤ්චි ධම්මං අත්තතො උපගච්ඡෙය්ය, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "heading",
                "text": "1. 15. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං දිට්ඨිසම්පන්නො පුග්ගලො මාතරං ජීවිතා වොරොපෙය්ය, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං පුථුජ්ජනො මාතරං ජීවිතා වොරොපෙය්ය, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "heading",
                "text": "1. 15. 5.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං දිට්ඨිසම්පන්නො පුග්ගලො පිතරං ජීවිතා වොරොපෙය්ය, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං පුථුජ්ජනො පිතරං ජීවිතා වොරොපෙය්ය, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "heading",
                "text": "1. 15. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං දිට්ඨිසම්පන්නො පුග්ගලො අරහන්තං ජීවිතා වොරොපෙය්ය, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං පුථුජ්ජනො අරහන්තං ජීවිතා වොරොපෙය්ය, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "page-break",
                "text": "56"
            },
            {
                "type": "heading",
                "text": "1. 15. 7.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං දිට්ඨිසම්පන්නො පුග්ගලො තථාගතස්ස දුට්ඨෙන චිත්තෙන ලොහිතං උප්පාදෙය්ය, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං පුථුජ්ජනො තථාගතස්ස දුට්ඨෙන චිත්තෙන ලොහිතං උප්පාදෙය්ය, ඨානමෙතං විජ්ජති.{1 විජ්ජතීති - මඡසං, ස්යා.}"
            },
            {
                "type": "heading",
                "text": "1. 15. 8.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං දිට්ඨිසම්පන්නො පුග්ගලො සඞ්ඝං භින්දෙය්ය, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති යං පුථුජ්ජනො සඞ්ඝං භින්දෙය්ය, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "heading",
                "text": "1. 15. 9.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං දිට්ඨිසම්පන්නො පුග්ගලො අඤ්ඤං සත්ථාරං උද්දිසෙය්ය, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං පුථුජ්ජනො අඤ්ඤං සත්ථාරං උද්දිසෙය්ය, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "heading",
                "text": "1. 15. 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං එකිස්සා ලොකධාතුයා ද්වෙ අරහන්තො සම්මාසම්බුද්ධා අපුබ්බං අචරිමං උප්පජ්ජෙය්යුං, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං එකිස්සා ලොකධාතුයා එකො අරහං සම්මාසම්බුද්ධො උප්පජ්ජෙය්ය, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "heading",
                "text": "1. 15. 11.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං එකිස්සා ලොකධාතුයා ද්වෙ රාජානො චක්කවත්තී අපුබ්බං අචරිමං උප්පජ්ජෙය්යුං, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං එකිස්සා ලොකධාතුයා එකො රාජා චක්කවත්තී උප්පජ්ජෙය්ය, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "heading",
                "text": "1. 15. 12.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං ඉත්ථී අරහං අස්ස සම්මාසම්බුද්ධො, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං පුරිසො අරහං අස්ස සම්මාසම්බුද්ධො, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "page-break",
                "text": "58"
            },
            {
                "type": "heading",
                "text": "1. 15. 13.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං ඉත්ථී රාජා අස්ස චක්කවත්තී, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං පුරිසො රාජා අස්ස චක්කවත්තී, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "heading",
                "text": "1. 15. 14 – 16.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං ඉත්ථී සක්කත්තං කාරෙය්ය -පෙ-, මාරත්තං කාරෙය්ය -පෙ-, බ්රහ්මත්තං කාරෙය්ය, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං පුරිසො සක්කත්තං කාරෙය්ය, මාරත්තං කාරෙය්ය, බ්රහ්මත්තං කාරෙය්ය. ඨානමෙතං විජ්ජති."
            },
            {
                "type": "heading",
                "text": "1. 15. 17.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං කායදුච්චරිතස්ස ඉට්ඨො කන්තො මනාපො විපාකො නිබ්බත්තෙය්ය, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති යං කායදුච්චරිතස්ස අනිට්ඨො අකන්තො අමනාපො විපාකො නිබ්බත්තෙය්ය, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "heading",
                "text": "1. 15. 18 – 19.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං වචීදුච්චරිතස්ස -පෙ- යං මනොදුච්චරිතස්ස ඉට්ඨො කන්තො මනාපො විපාකො නිබ්බත්තෙය්ය, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං මනොදුච්චරිතස්ස අනිට්ඨො අකන්තො අමනාපො විපාකො නිබ්බත්තෙය්ය, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "heading",
                "text": "1. 15. 20.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං කායසුචරිතස්ස අනිට්ඨො අකන්තො අමනාපො විපාකො නිබ්බත්තෙය්ය, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං කායසුචරිතස්ස ඉට්ඨො කන්තො මනාපො විපාකො නිබ්බත්තෙය්ය, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "heading",
                "text": "1. 15. 21 – 22.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං වචීසුචරිතස්ස -පෙ-, යං මනොසුචරිතස්ස අනිට්ඨො අකන්තො අමනාපො විපාකො නිබ්බත්තෙය්ය, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං මනොසුචරිතස්ස ඉට්ඨො කන්තො මනාපො විපාකො නිබ්බත්තෙය්ය, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "page-break",
                "text": "60"
            },
            {
                "type": "heading",
                "text": "1. 15. 23.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං කායදුච්චරිතසමඞ්ගී තන්නිදානා තප්පච්චයා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජෙය්ය, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං කායදුච්චරිතසමඞ්ගී තන්නිදානා තප්පච්චයා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජෙය්ය, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "heading",
                "text": "1. 15. 24 – 25.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං වචීදුච්චරිතසමඞ්ගී -පෙ-, යං මනොදුච්චරිතසමඞ්ගී තන්නිදානා තප්පච්චයා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජෙය්ය, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං මනොදුච්චරිතසමඞ්ගී තන්නිදානා තප්පච්චයා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජෙය්ය, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "heading",
                "text": "1. 15. 26.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං කායසුචරිතසමඞ්ගී තන්නිදානා තප්පච්චයා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජෙය්ය, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං කායසුචරිතසමඞ්ගී තන්නිදානා තප්පච්චයා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජෙය්ය, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "heading",
                "text": "1. 15. 27 – 28.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං වචීසුචරිතසමඞ්ගී -පෙ-, යං මනොසුචරිතසමඞ්ගී තන්නිදානා තප්පච්චයා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජෙය්ය, නෙතං ඨානං විජ්ජති. ඨානඤ්ච ඛො එතං භික්ඛවෙ විජ්ජති, යං මනොසුචරිතසමඞ්ගී තන්නිදානා තප්පච්චයා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජෙය්ය, ඨානමෙතං විජ්ජති."
            },
            {
                "type": "centered",
                "text": "(අට්ඨානපාළි නිට්ඨිතා.)",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 55
            },
            {
                "text": "15. අට්ඨාන පාළිය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 15. 1.",
                "level": "1"
            },
            {
                "text": "**[සැවැත් නිදානයි:]**",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් මාර්ගදෘෂ්ටියෙන් යුත් (=සොවාන්) පුද්ගල තෙමේ කිසි සංස්කාරයක් නිත්‍යය යි ගන්නේය යන තෙල කරුණ විද්‍යමාන නො වේ. තෙල අවිද්‍යමාන තැනෙකි. ප්‍රත්‍යය රහිත යෙකි. මහණෙනි, යම් හෙයෙකින් පෘථග්ජන තෙමේ කිසියම් සංස්කාරයක් නිත්‍යය යි ගන්නේ ය යන යමෙක් වේද, තෙල කරුණ විද්‍යමාන වේ. තෙල හේතු ඇත. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 15. 2.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් දර්ශනසම්පන්න පුද්ගල තෙමේ කිසි සංස්කාරයක් සුඛය යි ගන්නේය යන තෙල කරුණ විද්‍යමාන නො වේ. තෙල හෙතු රහිත යෙකි. අවකාශ රහිත යෙකි. මහණෙනි, යම් හෙයෙකින් පෘථග්ජන තෙමේ කිසි සංස්කාරයක් සුඛය යි ගන්නේ ය යන යමෙක් වේ ද, තෙල කරුණ විද්‍යමාන වෙයි. තෙල හේතු ඇත. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 15. 3.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් දෘෂ්ටිසම්පන්න පුද්ගල තෙමේ කිසි ධර්මයක් ආත්මය යි ගන්නේ ය යන තෙල කරුණ විද්‍යමාන නො වේ. තෙල හෙතු රහිත යෙකි. අවකාශ රහිත යෙකි. මහණෙනි, යම් හෙයෙකින් පෘථග්ජන තෙමේ කිසි ධර්මයක් ආත්මය යි ගන්නේ ය යන යමෙක් වේද, තෙල කරුණ විද්‍යමාන වේ. තෙල හේතු ඇත. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 15. 4.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් දෘෂ්ටිසම්පන්න පුද්ගල තෙමේ මව දිවියෙන් තොර කරන්නේය යන තෙල කරුණ විද්‍යමාන නො වේ. තෙල හෙතු රහිත යෙකි. අවකාශ රහිත යෙකි. මහණෙනි, යම් හෙයෙකින් පෘථග්ජන තෙමේ මව දිවියෙන් තොර කරන්නේ ය යන යමෙක් වේ ද, තෙල කරුණ විද්‍යමාන වෙයි. තෙල හේතු ඇත. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 15. 5.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් දෘෂ්ටිසම්පන්න පුද්ගල තෙමේ පියා දිවියෙන් තොර කරන්නේ ය යන තෙල කරුණ විද්‍යමාන නො වේ. තෙල හෙතු රහිත යෙකි. අවකාශ රහිත යෙකි. මහණෙනි, යම් හෙයෙකින් පෘථග්ජන තෙමේ පියා දිවියෙන් තොර කරන්නේ ය යන යමෙක් වේද, තෙල කරුණ විද්‍යමාන වෙයි. තෙල හේතු ඇත. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 15. 6.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් දෘෂ්ටිසම්පන්න පුද්ගල තෙමේ රහතකු දිවියෙන් තොර කරන්නේ ය යන තෙල කරුණ විද්‍යමාන නො වේ. තෙල හෙතු රහිත යෙකි. අවකාශ රහිත යෙකි. මහණෙනි, යම් හෙයෙකින් පෘථග්ජන තෙමේ රහතකු දිවියෙන් තොර කරන්නේය යන යමෙක් වේ ද, තෙල කරුණ විද්‍යමාන වෙයි. තෙල හේතු ඇත.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "57"
            },
            {
                "type": "heading",
                "text": "1. 15. 7.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් දෘෂ්ටිසම්පන්න පුද්ගල තෙමේ දුෂ්ට වූ සිතින් තථාගතයන් වහන්සේගේ (සිරුරෙහි) ලේ සොලවන්නේ ය යන තෙල කරුණ විද්‍යමාන නො වෙයි. තෙල හෙතු රහිත යෙකි. අවකාශ රහිත යෙකි. මහණෙනි, යම් හෙයෙකින් පෘථග්ජන පුද්ගල තෙමේ දුෂ්ට වූ සිතින් තථාගතයන් වහන්සේගේ (සිරුරෙහි) ලේ සොලවන්නේ ය යන යමෙක් වේ ද, තෙල කරුණ විද්‍යමාන වෙයි. තෙල හේතු ඇත.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 15. 8.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් දෘෂ්ටිසම්පන්න පුද්ගල තෙමේ සඞ්ඝයා බිඳුනේය යන තෙල කරුණ විද්‍යමාන නොවේ. තෙල හෙතු රහිත යෙකි. අවකාශ රහිත යෙකි. මහණෙනි, යම් හෙයෙකින් පෘථග්ජන තෙමේ සඞ්ඝයා බිඳුනේ ය යන යමෙක් වේ ද, තෙල කරුණ විද්‍යමාන වෙයි. තෙල හේතු ඇත.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 15. 9.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් දෘෂ්ටිසම්පන්න පුද්ගල තෙමේ අන්‍යශාස්තෘ කෙනෙකුන් උදෙසා සිටුනේ ය යන තෙල කරුණ විද්‍යමාන නො වෙයි, තෙල හෙතු රහිත යෙකි. අවකාශ රහිත යෙකි. මහණෙනි, යම් හෙයෙකින් පෘථග්ජන තෙමේ අන්‍ ශාස්තෘ කෙනකුන් උදෙසා සිටුනේ ය යන යමෙක් වේ ද, තෙල කරුණ විද්‍යමාන වෙයි. තෙල හේතු ඇත.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 15. 10.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් එක් ලොකධාතුවෙක්හි අර්හත් වූ දෙසම්බුදු කෙනකුන් වහන්සේ එකවට උපදනාහු ය යන තෙල කරුණ විද්‍යමාන නො වේ. තෙල හෙතු රහිත යෙකි. අවකාශ රහිත යෙකි. මහණෙනි, යම් හෙයෙකින් එක් ලොකධාතුවෙක එක ම අර්හත් සම්බුදුරජානන් වහන්සේ කෙනෙක් උපදනාහ යන යමෙක් වේ ද, තෙල කරුණ විද්‍යමාන වේ. තෙල හේතු ඇත.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 15. 11.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් එක් ලොකධාතුවෙක්හි සක්විති රජවරු දෙදෙනෙක් එකවට උපදනාහු ය යන තෙල කරුණ විද්‍යමාන නො වේ. තෙල හෙතු රහිත යෙකි. අවකාශ රහිත යෙකි. මහණෙනි, යම් හෙයෙකින් එක් ලොකධාතුවෙක්හි එක් සක්විතිරජෙක් උපදනේ ය යන යමෙක් වේ ද, තෙල කරුණ විද්‍යමාන වේ. තෙල හේතු ඇත.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 15. 12.",
                "level": 1
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් ස්ත්‍රියක අර්හත් සම්‍යක්සම්බුද්ධ වෙති යි යන තෙල කරුණ විද්‍යමාන නො වේ. තෙල හෙතු රහිත යෙකි. අවකාශ රහිත යෙකි. මහණෙනි, යම් හෙයෙකින් පුරුෂයෙක් අර්හත් සම්‍යක්සම්බුද්ධ වන්නේය ය යන යමෙක් වේ ද, තෙල කරුණ විද්‍යමාන වේ. තෙල හේතු ඇත.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "59"
            },
            {
                "type": "heading",
                "text": "1. 15. 13.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් ස්ත්‍රියක සක්විති රජ වෙති යි යන තෙල කරුණ විද්‍යමාන නො වේ. තෙල හෙතු රහිත යෙකි. අවකාශ රහිත යෙකි. මහණෙනි, පුරුෂයෙක් සක්විති රජ වන්නේය ය යන යමෙක් වේ ද, තෙල කරුණ විද්‍යමාන වේ. තෙල හේතු ඇත.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 15. 14 - 16.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් ස්ත්‍රියක සක්දෙව් රජ බව කරති යි … මාරබව කරති යි … බ්‍රහ්ම බව කරති යි යන තෙල කරුණ විද්‍යමාන නො වේ. තෙල හෙතු රහිත යෙක. අවකාශ රහිත යෙක. මහණෙනි, යම් හෙයෙකින් පුරුෂයෙක් සක්දෙව් බව කරන්නේ ය …, මාර බව කරන්නේ ය …, බ්‍රහ්ම බව කරන්නේ ය යන යමෙක් වේ ද, තෙල කරුණ විද්‍යමාන වේ. තෙල හේතු ඇත.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 15. 17.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් කායදුශ්චරිතයාගේ ඉෂ්ට කාන්ත මනාප විපාකයෙක් උපදනේ ය යන තෙල කරුණ විද්‍යමාන නො වේ. තෙල හෙතු රහිත ය. අවකාශ රහිත ය. මහණෙනි, යම් හෙයෙකින් කායදුශ්චරිතයාගේ අනිෂ්ට අකාන්ත අමනාප වූ විපාකයෙක් උපදනේ ය යන යමෙක් වේ ද, තෙල කරුණ විද්‍යමාන වේ. තෙල හේතු ඇත.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 15. 18 - 19.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් වාග්දුශ්චරිතයාගේ …, යම් හෙයෙකින් මනොදුශ්චරිතයාගේ ඉෂ්ට කාන්ත මනාප විපාකයෙක් උපදනේ ය යන තෙල කරුණ විද්‍යමාන නො වේ. මහණෙනි, යම් හෙයෙකින් මනොදුශ්චරිතයාගේ අනිෂ්ට අකාන්ත අමනාප වූ විපාකයෙක් උපදනේ ය යන යමෙක් වේ ද, තෙල කරුණ විද්‍යමාන වේ. තෙල හේතු ඇත.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 15. 20.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් කායසුචරිතයාගේ අනිෂ්ට අකාන්ත අමනාප විපාකයෙක් උපදනේ ය යන තෙල කරුණ විද්‍යමාන නො වේ. තෙල හෙතු රහිත ය. අවකාශ රහිත ය. මහණෙනි, යම් හෙයෙකින් කායසුචරිතයාගේ ඉෂ්ට කාන්ත මනාප වූ විපාකයෙක් උපදනේ ය යන යමෙක් වේ ද, තෙල කරුණ විද්‍යමාන වේ. තෙල හේතු ඇත.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 15. 21 - 22.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් වාක්සුචරිතයාගේ …, මනඃසුචරිතයාගේ අනිෂ්ට අකාන්ත අමනාප විපාකයෙක් උපදනේ ය යන තෙල කරුණ විද්‍යමාන නො වේ. තෙල හෙතු රහිත ය. අවකාශ රහිත ය. මහණෙනි, යම් හෙයෙකින් මනඃසුරිතයාගේ ඉෂ්ට කාන්ත මනාප විපාකයෙක් උපදනේ ය යන යමෙක් වේ ද, තෙල කරුණ විද්‍යමාන වේ. තෙල හේතු ඇත.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "61"
            },
            {
                "type": "heading",
                "text": "1. 15. 23.",
                "level": 1
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් කායදුශ්චරිතයෙන් සමන්විත පුද්ගල තෙමේ ඒ හේතුයෙන් ඒ ප්‍රත්‍යයෙන් කාබුන් මරණින් මතු (මනාගති ඇති හෙයින්) සුගති නම් වූ ස්වර්ගලොකයට (ප්‍රතිසන්ධිවශයෙන්) යන්නේ ය යන තෙල කරුණ විද්‍යමාන නො වේ. තෙල හෙතු රහිත ය, අවකාශ රහිත ය. මහණෙනි, යම් හෙයෙකින් කායදුශ්චරිතයෙන් සමන්විත පුද්ගල තෙමේ ඒ හේතුයෙන් ඒ ප්‍රත්‍යයෙන් කාබුන් මරණින් මතු (සුවෙන් පහ වූ හෙයින්) අපාය නම් වූ (නපුරු ගති ඇති හෙයින්) දුගති නම් වූ (විවසව පතිත වන හෙයින්) විනිපාත නම් වූ නිරයට (ප්‍රතිසන්ධිවශයෙන්) යන්නේ ය යන යමෙක් වේ ද, තෙල කරුණ විද්‍යමාන වේ. තෙල හේතු ඇත.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 15. 24 - 25.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් වාග්දුශ්චරිතයෙන් සමන්විත පුද්ගල තෙමේ …. මනොදුශ්චරිතයෙන් සමන්විත පුද්ගල තෙමේ ඒ හේතුයෙන් ඒ ප්‍රත්‍යයෙන් කාබුන් මරණින් මතු සුගති නම් වූ ස්වර්ගලොකයට යන්නේ ය යන තෙල කරුණ විද්‍යමාන නො වේ, තෙල හෙතු රහිත ය, අවකාශ රහිත ය. මහණෙනි, යම් හෙයෙකින් මනොදුශ්චරිතයෙන් සමන්විත පුද්ගල තෙමේ ඒ හේතුයෙන් ඒ ප්‍රත්‍යයෙන් කාබුන් මරණින් මතු අපාය නම් වූ දුගති නම් වූ විනිපාත නම් වූ නිරයට යන්නේ ය යන යමෙක්වේ ද, තෙල කරුණ විද්‍යමාන වේ, තෙල හේතු ඇත.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 15. 26.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් කායසුචරිතයෙන් යුත් පුද්ගල තෙමේ ඒ හේතුයෙන් ඒ ප්‍රත්‍යයෙන් කාබුන් මරණින් මතු අපාය නම් වූ දුගති නම් වූ විනිපාත නම් වූ නිරයට යන්නේ ය යන තෙල කරුණ විද්‍යමාන නො වේ. තෙල හෙතු රහිත ය, අවකාශ රහිත ය. මහණෙනි, යම් හෙයෙකින් කායසුචරිතයෙන් යුත් පුද්ගල තෙමේ ඒ හේතුයෙන් ඒ ප්‍රත්‍යයෙන් කාබුන් මරණින් මතු ස්වර්ගලොකයට (පිළිසඳ විසින්) යන්නේ ය යන යමෙක් වේ ද, තෙල කරුණ විද්‍යමාන වේ. තෙල හේතු ඇත.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 15. 27 - 28.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් වාක්සුචරිතයෙන් සමන්විත පුද්ගල තෙමේ … යම් හෙයකින් මනඃසුචරිතයෙන් සමන්විත පුද්ගල තෙමේ ඒ හෙතුයෙන් ඒ ප්‍රත්‍යයෙන් කාබුන් මරණින් මතු අපාය නම් වූ දුගති නම් වූ විනිපාත නම් වූ නිරයට (පිළිසිඳ විසින්) යන්නේ ය යන තෙල කරුණ විද්‍යමාන නො වේ. තෙල හෙතු රහිත ය, අවකාශ රහිත ය. මහණෙනි, යම් හෙයෙකින් මනඃසුචරිතයෙන් සමන්විත පුද්ගල තෙමේ ඒ හෙතුයෙන් ඒ ප්‍රත්‍යයෙන් කාබුන් මරණින් මතු සුගති නම් වූ ස්වර්ගලොකයට යන්නේ ය යන යමෙක් වේ ද, තෙල කරුණ විද්‍යමාන වේ. තෙල හේතු ඇත.",
                "type": "paragraph"
            },
            {
                "text": "[අට්ඨානපාළිය නිමි.]",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-1-15"
    }
]