[
    {
        "filename": "an-1-12",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 42
            },
            {
                "type": "heading",
                "text": "12. අනාපත්තිවග්ගො",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 12. 1 – 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "**(සාවත්ථිනිදානං:)**"
            },
            {
                "type": "paragraph",
                "text": "යෙ තෙ භික්ඛවෙ භික්ඛූ අනාපත්තිං ආපත්තීති දීපෙන්ති -පෙ- ආපත්තිං අනාපත්තීති දීපෙන්ති -පෙ- ලහුකං ආපත්තිං ගරුකා ආපත්තීති දීපෙන්ති -පෙ- ගරුකං ආපත්තිං ලහුකා ආපත්තීති දීපෙන්ති -පෙ- දුට්ඨුල්ලං ආපත්තිං අදුට්ඨුල්ලා ආපත්තීති දීපෙන්ති -පෙ- අදුට්ඨුල්ලං ආපත්තිං දුට්ඨුල්ලා ආපත්තීති දීපෙන්ති -පෙ- සාවසෙසං ආපත්තිං අනවසෙසා ආපත්තීති දීපෙන්ති -පෙ- අනවසෙසං ආපත්තිං සාවසෙසා ආපත්තීති දීපෙන්ති -පෙ- සප්පටිකම්මං ආපත්තිං අප්පටිකම්මා ආපත්තීති දීපෙන්ති -පෙ- අප්පටිකම්මං ආපත්තිං සප්පටිකම්මා ආපත්තීති දීපෙන්ති, තෙ භික්ඛවෙ භික්ඛූ බහුජනාහිතාය පටිපන්නා බහුජනාසුඛාය බහුනො ජනස්ස අනත්ථාය අහිතාය දුක්ඛාය දෙවමනුස්සානං. බහුඤ්ච තෙ භික්ඛවෙ භික්ඛූ අපුඤ්ඤං පසවන්ති. තෙවිමං සද්ධම්මං අන්තරධාපෙන්තීති."
            },
            {
                "type": "heading",
                "text": "1. 12. 11 – 20.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "යෙ තෙ භික්ඛවෙ භික්ඛූ අනාපත්තිං අනාපත්තීති දීපෙන්ති -පෙ- ආපත්තිං ආපත්තීති දීපෙන්ති -පෙ- ලහුකං ආපත්තිං ලහුකා ආපත්තීති දීපෙන්ති -පෙ- ගරුකං ආපත්තිං ගරුකා ආපත්තීති දීපෙන්ති -පෙ- (දුට්ඨුල්ලං ආපත්තිං දුට්ඨුල්ලා ආපත්තීති දීපෙන්ති) -පෙ- අදුට්ඨුල්ලං ආපත්තිං අදුට්ඨුල්ලා ආපත්තීති දීපෙන්ති -පෙ- සාවසෙසං ආපත්තිං සාවසෙසා ආපත්තීති දීපෙන්ති -පෙ- අනවසෙසං ආපත්තිං අනවසෙසා ආපත්තීති දීපෙන්ති -පෙ- සප්පටිකම්මං ආපත්තිං සප්පටිකම්මා ආපත්තීති දීපෙන්ති -පෙ- අප්පටිකම්මං ආපත්තිං අප්පටිකම්මා ආපත්තීති දීපෙන්ති, තෙ භික්ඛවෙ භික්ඛූ බහුජනහිතාය පටිපන්නා බහුජනසුඛාය බහුනො ජනස්ස අත්ථාය හිතාය සුඛාය දෙවමනුස්සානං. බහුඤ්ච තෙ භික්ඛවෙ භික්ඛූ පුඤ්ඤං පසවන්ති. තෙවිමං සද්ධම්මං ඨපෙන්තීති."
            },
            {
                "type": "centered",
                "text": "වග්ගො ද්වාදසමො.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 43
            },
            {
                "text": "12. අනාපත්ති වර්ගය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 12. 1 - 10",
                "level": "1"
            },
            {
                "text": "**[සැවැත් නිදානයි:]**",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් ම මහණ කෙනෙක් නොඇවැත ඇවැතයි දක්වත් ද …, ඇවැත නොඇවැතැයි දක්වත් ද …, ලුහු  ඇවැත ගුරු ඇවැතැයි දක්වත් ද …, ගුරු ඇවැත ලුහු ඇවැතැයි දක්වත් ද …, දුළුල් ඇවැත නොදුළුල් ඇවැතැයි  දක්වත් ද …, නොදුළුල් ඇවැත දුළුල් ඇවැතැයි දක්වත් ද …, සාවශෙෂ ඇවැත අනවශෙෂ ඇවැතැයි දක්වත් ද …, අනවශෙෂ ඇවැත සාවශෙෂ ඇවැතැයි දක්වත් ද …, පිළියම් සහිත ඇවැත පිළියම් රහිත ඇවැතැයි දක්වත් ද …, පිළියම් රහිත ඇවැත පිළියම් සහිත ඇවැතැයි දක්වත් ද …, මහණෙනි, ඒ මහණ හු බොහෝ දෙනාට අහිත පිණිස බොහෝ දෙනාට නො සුව පිණිස බොහෝ දෙනාට නො වැඩ පිණිස දෙවිමිනිස්නට අහිත පිණිස දුක් පිණිස පිළිපන්නාහු වෙති. මහණෙනි, ඒ මහණහු බොහෝ පව් ද රැස් කෙරෙති. ඔහු ම මේ සස්න අතුරුදන් කෙරෙත්. ",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 12. 11 - 20",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් ම මහණ කෙනෙක් නො ඇවැත නො ඇවැතයි දක්වත් ද …, ඇවැත ඇවැතැයි දක්වත් ද …, ලුහු ඇවැත (පස්ඇවැත්කඳු) ලුහු ඇවැතැයි දක්වත් ද …, ගුරු ඇවැත (දෙඇවැත්කඳු) ගුරු ඇවැතැයි  දක්වත් ද …, දුළුල් ඇවැත දුළුල් ඇවැතැයි  දක්වත් ද …, නො දුළුල් ඇවැත නො දුළුල් ඇවැතැයි දක්වත් ද …, සාවශෙෂ ඇවැත සාවශෙෂ ඇවැතැයි දක්වත් ද …, අනවශෙෂ ඇවැත (පරිජිඇවැත) අනවශෙෂ ඇවැතැයි දක්වත් ද …, පිළියම් සහිත ඇවැත පිළියම් සහිත ඇවැතැයි දක්වත් ද …, පිළියම් රහිත ඇවැත (පරිජිඇවැත) පිළියම් රහිත ඇවැතැයි දක්වත් ද …, මහණෙනි, ඒ මහණ හු බොහෝ දෙනාට හිත පිණිස බොහෝ දෙනාට සුව පිණිස බොහෝ දෙනාට වැඩ පිණිස දෙවිමිනිස්නට හිත පිණිස සුව පිණිස පිළිපන්නාහු වෙති. මහණෙනි, ඒ මහණහු බොහෝ පින් ද උදා කෙරෙත්. ඔහු ම මේ ශාසනය තබත්. ",
                "type": "paragraph"
            },
            {
                "text": "දොළොස්වන වග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-1-12"
    }
]