[
    {
        "filename": "an-1-19",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 88
            },
            {
                "type": "heading",
                "text": "[ කායගතාසතිවග්ගො ]",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "යස්ස කස්සචි භික්ඛවෙ මහාසමුද්දො චෙතසා ඵුටො, අන්තොගධා තස්ස කුන්නදියො යා කාචි සමුද්දඞ්ගමා. එවමෙව ඛො{1 එවමෙව - මඡසං.} භික්ඛවෙ යස්ස කස්සචි කායගතාසති භාවිතා බහුලීකතා, අන්තොගධා තස්ස කුසලා ධම්මා, යෙ කෙචි විජ්ජාභාගියා.{2 විජ්ජාභාගිනියාති - මඡසං.}"
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 2 – 8.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එකධම්මො භික්ඛවෙ භාවිතො බහුලීකතො මහතො සංවෙගාය සංවත්තති, -පෙ- මහතො අත්ථාය සංවත්තති, -පෙ- මහතො යොගක්ඛෙමාය සංවත්තති, -පෙ- සතිසම්පජඤ්ඤාය සංවත්තති, -පෙ- ඤාණදස්සනපටිලාභාය සංවත්තති, -පෙ- දිට්ඨධම්මසුඛවිහාරාය සංවත්තති, -පෙ- විජ්ජාවිමුත්තිඵලසච්ඡිකිරියාය, සංවත්තති. කතමො එකධම්මො: කායගතාසති. අයං ඛො භික්ඛවෙ එකධම්මො භාවිතො බහුලීකතො මහතො සංවෙගාය සංවත්තති, මහතො අත්ථාය සංවත්තති, මහතො යොගක්ඛෙමාය සංවත්තති, සතිසම්පජඤ්ඤාය සංවත්තති, ඤාණදස්සනපටිලාභාය සංවත්තති, දිට්ඨධම්මසුඛවිහාරාය සංවත්තති, විජ්ජාවිමුත්තිඵලසච්ඡිකිරියාය සංවත්තතීති."
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 9 – 12.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එකධම්මෙ භික්ඛවෙ භාවිතෙ බහුලීකතෙ කායොපි පස්සම්භති, -පෙ- චිත්තම්පි පස්සම්භති, -පෙ- විතක්කවිචාරාපි වූපසම්මන්ති, -පෙ- කෙවලාපි විජ්ජාභාගියා ධම්මා භාවනාපාරිපූරිං ගච්ඡන්ති. කතමස්මිං එකධම්මෙ: කායගතාය සතියා. ඉමස්මිං ඛො භික්ඛවෙ එකධම්මෙ භාවිතෙ බහුලීකතෙ කායොපි පස්සම්භති, චිත්තම්පි පස්සම්භති, විතක්කවිචාරාපි වූපසම්මන්ති, කෙවලාපි විජ්ජාභාගියා ධම්මා භාවනාපාරිපූරිං ගච්ඡන්ති.{3 ගච්ඡන්තීති - මඡසං.}"
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 13.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එකධම්මෙ භික්ඛවෙ භාවිතෙ බහුලීකතෙ අනුප්පන්නා චෙව අකුසලා ධම්මා නුප්පජ්ජන්ති, උප්පන්නා ච අකුසලා ධම්මා පහීයන්ති. කතමස්මිං එකධම්මෙ: කායගතාසතියා. ඉමස්මිං ඛො භික්ඛවෙ එකධම්මෙ භාවිතෙ බහුලීකතෙ අනුප්පන්නා චෙව අකුසලා ධම්මා නුප්පජ්ජන්ති, උප්පන්නා ච අකුසලා ධම්මා පහීයන්ති."
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 14.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එකධම්මෙ භික්ඛවෙ භාවිතෙ බහුලීකතෙ අනුප්පන්නා චෙව කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච කුසලා ධම්මා භිය්යොභාවාය වෙපුල්ලාය සංවත්තන්ති. කතමස්මිං එකධම්මෙ: කායගතාසතියා. ඉමස්මිං ඛො භික්ඛවෙ එකධම්මෙ භාවිතෙ බහුලීකතෙ අනුප්පන්නා චෙව කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච කුසලා ධම්මා භිය්යොභාවාය වෙපුල්ලාය සංවත්තන්ති."
            },
            {
                "type": "page-break",
                "text": "90"
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 15 – 19.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එකධම්මෙ භික්ඛවෙ භාවිතෙ බහුලීකතෙ අවිජ්ජා පහීයති, -පෙ- විජ්ජා උප්පජ්ජති, -පෙ- අස්මිමානො පහීයති, -පෙ- අනුසයා සමුග්ඝාතං ගච්ඡන්ති, -පෙ- සඤ්ඤොජනා පහීයන්ති. කතමස්මිං එකධම්මෙ: කායගතාය සතියා. ඉමස්මිං ඛො භික්ඛවෙ එකධම්මෙ භාවිතෙ බහුලීකතෙ අවිජ්ජා පහීයති, විජ්ජා උප්පජ්ජති. අස්මිමානො පහීයති, අනුසයා සමුග්ඝාතං ගච්ඡන්ති, සඤ්ඤොජනා පහීයන්ති.{1 පහීයන්තීති - මඡසං.}"
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 20 – 21.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එකධම්මො භික්ඛවෙ භාවිතො බහුලීකතො පඤ්ඤාපභෙදාය සංවත්තති, -පෙ- අනුපාදා පරිනිබ්බාණාය සංවත්තති. කතමො එකධම්මො: කායගතා සති. අයං ඛො භික්ඛවෙ එකධම්මො භාවිතො බහුලීකතො පඤ්ඤාපභෙදාය සංවත්තති, අනුපාදාපරිනිබ්බාණාය සංවත්තති.{2 සංවත්තන්තීති - මඡසං.}"
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 22 – 24.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එකධම්මෙ භික්ඛවෙ භාවිතෙ බහුලීකතෙ අනෙකධාතුපටිවෙධො හොති, -පෙ- නානාධාතුපටිවෙධො හොති, -පෙ- අනෙකධාතුපටිසම්භිදා හොති. කතමස්මිං එකධම්මෙ: කායගතාය{3 කායගතා සතියා - සීමු.} සතියා. ඉමස්මිං ඛො භික්ඛවෙ එකධම්මෙ භාවිතෙ බහුලීකතෙ අනෙකධාතුපටිවෙධො හොති, නානාධාතුපටිවෙධො හොති, අනෙකධාතුපටිසම්භිදා හොති.{4 හොතීති - මඡසං.}"
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 25 – 28.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එකධම්මො භික්ඛවෙ භාවිතො බහුලීකතො සොතාපත්තිඵලසච්ඡිකිරියාය සංවත්තති, -පෙ- සකදාගාමිඵලසච්ඡිකිරියාය සංවත්තති, -පෙ- අනාගාමිඵලසච්ඡිකිරියාය සංවත්තති, -පෙ- අරහත්තඵලසච්ඡිකිරියාය සංවත්තති. කතමො එකධම්මො: කායගතා සති. අයං ඛො භික්ඛවෙ එකධම්මො භාවිතො බහුලීකතො සොතාපත්තිඵලසච්ඡිකිරියාය සංවත්තති, සකදාගාමිඵලසච්ඡිකිරියාය සංවත්තති, අනාගාමිඵලසච්ඡිකිරියාය සංවත්තති, අරහත්තඵලසච්ඡිකිරියාය සංවත්තති."
            },
            {
                "type": "page-break",
                "text": "92"
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 29 – 44.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එකධම්මො භික්ඛවෙ භාවිතො බහුලීකතො පඤ්ඤාපටිලාභාය සංවත්තති, -පෙ- පඤ්ඤාවුද්ධියා සංවත්තති, -පෙ- පඤ්ඤාවෙපුල්ලාය සංවත්තති, -පෙ- මහාපඤ්ඤතාය සංවත්තති, -පෙ- පුථුපඤ්ඤතාය සංවත්තති, -පෙ- විපුලපඤ්ඤතාය සංවත්තති, -පෙ- ගම්භීරපඤ්ඤතාය සංවත්තති, -පෙ- අසාමන්තපඤ්ඤතාය{1 අසමත්ථපඤ්ඤතාය - ස්යා. කං. අසමත්තපඤ්ඤතාය, කත්ථචි.} සංවත්තති, -පෙ- භූරිපඤ්ඤතාය සංවත්තති, -පෙ- පඤ්ඤාබාහුල්ලාය සංවත්තති, -පෙ- සීඝපඤ්ඤතාය සංවත්තති, -පෙ- ලහුපඤ්ඤතාය සංවත්තති, -පෙ- හාසුපඤ්ඤතාය{2 හා ස පඤ්ඤතාය - මඡසං.} සංවත්තති, -පෙ- ජවනපඤ්ඤතාය සංවත්තති, -පෙ- තික්ඛපඤ්ඤතාය සංවත්තති, -පෙ- නිබ්බෙධිකපඤ්ඤතාය සංවත්තති. කතමො එකධම්මො: කායගතා සති. අයං ඛො භික්ඛවෙ එකධම්මො භාවිතො බහුලීකතො පඤ්ඤාපටිලාභාය සංවත්තති, පඤ්ඤාවුද්ධියා සංවත්තති, පඤ්ඤාවෙපුල්ලාය සංවත්තති, මහාපඤ්ඤතාය සංවත්තති, පුථුපඤ්ඤතාය සංවත්තති, විපුලපඤ්ඤතාය සංවත්තති, ගම්භීරපඤ්ඤතාය සංවත්තති, අසාමන්තපඤ්ඤතාය සංවත්තති, භූරිපඤ්ඤතාය සංවත්තති, පඤ්ඤාබාහුල්ලාය සංවත්තති, සීඝපඤ්ඤතාය සංවත්තති, ලහුපඤ්ඤතාය සංවත්තති, හාසුපඤ්ඤතාය සංවත්තති, ජවනපඤ්ඤතාය සංවත්තති, තික්ඛපඤ්ඤතාය සංවත්තති, නිබ්බෙධිකපඤ්ඤතාය සංවත්තති.{3 සංවත්තතීති - මඡසං.}"
            },
            {
                "type": "centered",
                "text": "(කායගතාසති) වග්ගො සත්තමො.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 89
            },
            {
                "text": "[ කායගතාසති වර්ගය ]",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 1.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් කිසිවකු විසින් මහසමුදුර සිතින් පහස්නා ලද්දේ නම්, මහමුහුදට ගලා බස්නා යම් කිසි කුඩා නදීහු වෙත් ද, ඔහු එයට ඇතුළත් වෙති. මහණෙනි, එසෙයින් ම යම් කිසිවකු විසින් කාගියාසී (කායගතාසතිය) වඩන ලද්දේ බහුල වශයෙන් කරණ ලද්දේ වේ ද, අෂ්ටවිද්‍යා භජනය කරණ යම් කිසි කුශල ධර්මයෝ වෙත් නම්, ඔහු එයට (කායගතාසතියට) ඇතුළත් වෙති.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 2 - 8.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, එක් ම ධර්මයෙක් වඩන ලද්දේ බහුල වශයෙන් කරණ ලද්දේ මහත් වූ සංවෙගය පිණිස පවත්නේය … මහත් වූ අර්ථය (සතරමග) පිණිස පවත්නේය … මහත් වූ යොගක්ෂෙමය (සතර ශ්‍රාමණ්‍යඵල) පිණිස පවත්නේය ස්මෘතිය හා සම්‍යක්ප්‍රඥාව පිණිස පවත්නේය … ඥානදර්ශනප්‍රතිලාභය (දිවැස් නුවණ) පිණිස පවත්නේය. ඉහාත්මභාවසුඛ විහරණය පිණිස පවත්නේය. විද්‍යා - විමුක්තිඵල (මාර්ගප්‍රඥා - සම්ප්‍රයුක්තධර්ම - අර්හත්ඵල) ප්‍රත්‍යවෙක්‍ෂා කිරීම පිණිස පවත්නේය. කවර එක ම ධර්මයෙක යත්: කායගතාසතිය යි. මහණෙනි, මේ එක් ධර්මය වඩන ලද්දේ බහුල වශයෙන් කරණ ලද්දේ මහත් සංවෙගය පිණිස පවත්නේය … මහත් අර්ථය පිණිස පවත්නේය ... මහත් යොගක්ෂෙමය පිණිස පවත්නේ ය ... ස්මෘතිය හා සම්‍යක් ප්‍රඥාව පිණිස පවත්නේය … ඥානදර්ශනප්‍රතිලාභය පිණිස පවත්නේය ... දෘෂ්ටධර්මසුඛ විහරණය පිණිස පවත්නේය ... විද්‍යා - විමුක්ති - ඵල ප්‍රත්‍යක්‍ෂ කිරීම පිණිස පවත්නේය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 9 - 12.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, එක් ම ධර්මයෙක් වැඩු කල්හි බහුල වශයෙන් (පුරුදු) කළ කල්හි කය ද (නාම - කරජ දෙකාය) සන්හිඳෙයි … සිත ද සන්සිඳෙයි ... විතර්ක විචාරයෝ ද සන්හිඳෙත් … සියලු විද්‍යාභාගීය ධර්මයෝ ද භාවනායෙන් පිරිපුන් බවට යෙත්. කවර එක් ධර්මයෙක් වැඩු කල්හි යත්: කායගතාසතිය යි. මහණෙනි, මේ එක් ම ධර්මය වැඩු කල්හි බහුල වශයෙන් (පුරුදු) කළ කල්හි කය ද සන්හිඳෙයි. සිත ද සන්හිඳෙයි. විතර්කවිචාරයෝ ද සන්සිඳෙත්. සියලු විද්‍යාභාගීය ධර්මයෝ ද භාවනායෙන් පිරිපුන් බවට යෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 13.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, එක් ම ධර්මයක් වැඩු කල්හි බහුල වශයෙන් පුරුදු කළ කල්හි නූපන් අකුශලධර්මයෝ ද නූපදිත්. උපන් අකුශලධර්මයෝ ද ප්‍රහීණ වෙත්. කවර එක් ධර්මයක් වැඩු කල්හි යත්: කාගියාසීය යි. මහණෙනි, මේ එක් ම ධර්මය වැඩු කල්හි බහුල වශයෙන් කළ කල්හි නූපන්නා වූ ද අකුශලධර්මයෝ නූපදිත්. උපන්නා වූ ද අකුශලධර්මයෝ ප්‍රහීණ වෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 14.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, එක් ම ධර්මයක් වැඩු කල්හි බහුල වශයෙන් පුරුදු කළ කල්හි නූපන්නා වූ ද කුශලධර්මයෝ උපදිත්. උපන්නා වූ කුශලධර්මයෝ ද භුයසත්වය පිණිස විපුල බව පිණිස පවත්නාහ. කවර එක් ධර්මයක් වැඩු කල්හිය යත්: කාගියාසි (වැඩු කල්හි) යි. මහණෙනි, මේ එක් ධර්මය වැඩු කල්හි බහුල වශයෙන් කළකල්හි නූපන්නා වූ ද කුශලධර්මයෝ බොහෝ බව පිණිස විපුල බව පිණිස පවත්නාහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "91"
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 15 – 19.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, මේ එක්ම ධර්මය වැඩු කල්හි බහුල වශයෙන් (පුරුදු) කළ කල්හි (අටතන්හි බොල්අඳුරු කරණ) අවිද්‍යාව ප්‍රහීණ වේ … (අර්හත්වමාර්ගඥාන ) විද්‍යාව උපදනීය … (නවවිධ) අස්මිමානය ප්‍රහීණ වේ .... (සප්ත) අනුශයයෝ නැස්මට යෙත් ... (දශ) සංයොජනයෝ ප්‍රහීණ වෙත්. කවර එක් ධර්මයක් වැඩු කල්හිය යත්: කාගියාසී ය යි. මහණෙනි, මේ එක් ම ධර්මය වැඩු කල්හි අවිද්‍යාව ප්‍රහීණ වේ. විද්‍යාව උපදනීය. අස්මිමානය ප්‍රහීණ වේ. අනුශයෝ නැස්මට යෙත්. සංයොජනයෝ ප්‍රහීණ වෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 20 - 21.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, එක් ම ධර්මයෙක් වඩන ලද්දේ බහුල වශයෙන් කරණ ලද්දේ ප්‍රඥා ප්‍රභෙදය පිණිස පවත්නේ ය … අනුපාදා පරිනිර්වාණය පිණිස පවත්නේ ය. කවර එක් ධර්මයෙක යත්: කාගියාසී ය යි. මහණෙනි, මේ එක් ම ධර්මය වඩනා ලද්දේ බහුල වශයෙන් කරණ ලද්දේ ප්‍රඥාප්‍රභෙදය පිණිස පවත්නේ ය. අනුපාදා පරිනිර්වාණය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 22 - 24.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, එක් ම ධර්මයක් වැඩු කල්හි බහුල වශයෙන් පුරුදු කළ කල්හි අනෙක (අටළොස්) ධාතූන්ගේ (ලක්ෂණ) ප්‍රතිවෙදය වෙයි … (අටළොස්) ධාතූන්ගේ නානාභාවයෙන් (ලක්ෂණ) ප්‍රතිවෙධය වේ … අනෙක (අටළොස්) ධාතුන්ගේ ප්‍රතිසම්භිදා ඥානය වේ. කවර එක් ධර්මයක් වැඩුකල්හි යත්: කාගියාසී ය යි. මහණෙනි, මේ එක් ම ධර්මය වැඩු කල්හි බහුල වශයෙන් කළ කල්හි අනෙක ධාතූන්ගේ ප්‍රතිවෙධය වේ. නානාධාතූන්ගේ ප්‍රතිවෙධය වේ. අනෙක ධාතුන්ගේ ප්‍රතිසම්භිධා ඥානය වේ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 25 - 28.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, එක් ම ධර්මයෙක් වඩන ලද්දේ බහුල වශයෙන් කරණ ලද්දේ සෝවාන්පල පසක් කිරීම පිණිස පවත්නේ ය ... සෙදගැමිපල පසක් කිරීම පිණිස පවත්නේය ... අනගැමිපල පසක් කිරීම පිණිස පවත්නේ ය ... රහත්පල පසක් කිරීම පිණිස පවත්නේ ය. කවර එක් ධර්මයක යත්: කාගියාසී ය යි. මහණෙනි, මේ එක් ම ධර්මය වඩනා ලද්දේ බහුල වශයෙන් කරණ ලද්දේ සෝවන්පල පසක් කිරීම පිණිස පවත්නේ ය. සෙදගැමිපල පසක් කිරීම පිණිස පවතී. අනගැමිපල පසක් කිරීම පිණිස පවත්නේ ය. රහත්පල පසක් කිරීම පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "93"
            },
            {
                "type": "heading",
                "text": "1. 16. 7. 29 – 44.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, එක් ම ධර්මයෙක් වඩන ලද්දේ, බහුල වශයෙන් කරණ ලද්දේ ප්‍රඥාප්‍රතිලාභය පිණිස පවත්නේය … ප්‍රඥාවගේ වැඩීම පිණිස පවත්නේය … ප්‍රඥාවගේ විපුල බව පිණිස පවත්නේය … මහාප්‍රාඥ බව පිණිස පවත්නේය ... (ස්කන්ධාදිනානාධර්මයන්හි) පෘථක්ප්‍රඥා ඇති බව පිණිස පවත්නේ ය ... විපුල ප්‍රඥා ඇති බව පිණිස පවත්නේය … ගැඹුරු ප්‍රඥා ඇති බව පිණිස පවත්නේය ... අසාමන්තප්‍රඥා ඇති බව පිණිස පවත්නේය ... (රාගාදිකෙලෙස් මඩනා) භූරි ප්‍රඥා ඇති බව පිණිස පවත්නේය … ප්‍රඥාබාහුල්‍ය පිණිස පවත්නේය … ශීඝ්‍රප්‍රඥා ඇති බව පිණිස පවත්නේය … (යුහුව සිල්පුරණ) ක්ෂිප්‍රප්‍රඥා ඇති බව පිණිස පවත්නේය ... (තෘෂ්ටිබහුලව ශීලාදිය පුරණ) හාසුප්‍රඥා ඇති බව පිණිස පවත්නේය … (ස්කන්ධාත්‍වායතනාදියෙහි දුවන) ජවනප්‍රඥා ඇති බව පිණිස පවත්නේය ... (කෙලෙස් සිඳීමෙහි) තීක්‍ෂණප්‍රඥා ඇති බව පිණිස පවත්නේය ... (සංස්කාරයන්හි කලකිරුවන) නිර්වෙදික ප්‍රඥා ඇති බව පිණිස පවත්නේය. කවර එක් ධර්මයෙක යත්: කායගතාසතිය යි. මහණෙනි, මේ එක් ම ධර්මය වඩන ලද්දේ බහුල වශයෙන් පුරුදු කරණ ලද්දේ ප්‍රඥාවගේ ප්‍රතිලාභය පිණිස පවත්නේය. ප්‍රඥාවගේ වෘද්ධිය පිණිස පවත්නේය. ප්‍රඥාවගේ විපුලත්වය පිණිස පවත්නේය. මහාප්‍රඥා ඇති බව පිණිස පවත්නේය. පෘථක්ප්‍රඥා ඇති බව පිණිස පවත්නේය. විපුලප්‍රඥා ඇති බව පිණිස පවත්නේය. ගම්භීරප්‍රඥා ඇති බව පිණිස පවත්නේය. අසාමන්තප්‍රඥා ඇති බව පිණිස පවත්නේ ය. භූරිප්‍රඥා ඇති බව පිණිස පවත්නේය. ප්‍රඥාබාහුල්‍යය පිණිස පවත්නේය. ශීඝ්‍රප්‍රඥා ඇති බව පිණිස පවත්නේය. ක්ෂිප්‍ර ප්‍රඥා ඇති බව පිණිස පවත්නේය. හාසු ප්‍රඥා ඇති බව පිණිස පවත්නේය. ජවනප්‍රඥා ඇති බව පිණිස පවත්නේය. තීක්‍ෂණ ප්‍රඥා ඇති බව පිණිස පවත්නේය. නිර්වේදිකප්‍රඥා ඇති බව පිණිස පවත්නේය.",
                "type": "paragraph"
            },
            {
                "text": "සත්වන (කායගතාසති) වගයි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-1-19"
    }
]