{
    "filename": "an-10-3",
    "pages": [
        {
            "pageNum": 378,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. තතියො පණ්ණාසකො",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. සමණසඤ්ඤාවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 1.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "සමණසඤ්ඤා සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "තිස්සො ඉමා භික්ඛවෙ සමණසඤ්ඤා භාවිතා බහුලීකතා සත්තධම්මෙ පරිපූරෙන්ති. කතමා තිස්සො:"
                    },
                    {
                        "type": "paragraph",
                        "text": "වෙවණ්ණියම්හි අජ්ඣුපගතො, පටපටිබද්ධා මෙ ජීවිකා, අඤ්ඤො මෙ ආකප්පො කරණීයොති. ඉමා ඛො භික්ඛවෙ තිස්සො සමණසඤ්ඤා භාවිතා බහුලීකතා සත්තධම්මෙ පරිපූරෙන්ති. කතමෙ සත්ත:"
                    },
                    {
                        "type": "paragraph",
                        "text": "නිච්චං සන්තතකාරී{1} හොති සන්තතවුත්ති{2} සීලෙසු, අනභිජ්ඣාලූ හොති. අව්යාපජ්ඣො හොති. අනතිමානී හොති සික්ඛාකාමො හොති, ඉදමත්ථන්තිස්ස හොති ජීවිතපරික්ඛාරෙසු ආරද්ධවිරියො ච{3} විහරති. ඉමා ඛො භික්ඛවෙ තිස්සො සමණඤ්ඤා භාවිතා බහුලීකතා ඉමෙ සත්ත ධම්මෙ පරිපූරෙන්තී ති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 2.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "බොජ්ඣඞ්ග සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සත්තිමෙ භික්ඛවෙ බොජ්ඣඞ්ගා භාවිතා බහුලීකතා තිස්සො විජ්ජා පරිපූරෙන්ති. කතමෙ සත්ත:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සතිසම්බොජ්ඣඞ්ගො, ධම්මවිචයසම්බොජ්ඣඞ්ගො, විරියසම්බොජ්ඣඞ්ගො, පීතිසම්බොජ්ඣඞ්ගො, පස්සද්ධිසම්බොජ්ඣඞ්ගො සමාධිසම්බොජ්ඣඞ්ගො, උපෙක්ඛාසම්බොජ්ඣඞ්ගො, ඉමෙ ඛො භික්ඛවෙ සත්තබොජ්ඣඞ්ගා භාවිතා බහුලීකතා තිස්සො විජ්ජා පරිපූරෙන්ති. කතමා තිස්සො:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති. සෙය්යථීදං: එකම්පි ජාතිං ද්වෙපි ජාතියො -පෙ- ඉති සාකාරං සඋද්දෙසං අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සන්තකාරී හොති – මඡසං, අ.අඞ්ගු \nසත්තකාරීහොති – ස්යා, PTS"
                    },
                    {
                        "type": "footnote",
                        "text": "2. සත්තවුත්ති – ස්යා, PTS"
                    },
                    {
                        "type": "footnote",
                        "text": "3. ආරද්ධ විරියොච – මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "3. තෙවන පණ්ණාසකය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. සමණසඤ්ඤා වර්‍ගය",
                        "level": 2
                    },
                    {
                        "text": "10. 3. 1. 1.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සමණසඤ්ඤා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මෙ ත්‍රිවිධ ශ්‍රමණ සංඥා කෙනෙක් භාවිත බහුලීකෘත වූවාහු සත්කරුණක් පිරිපුන් කරත්. කවර තුන් කෙනෙක් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "(කාය - චීවරාදී) වෛවර්‍ණ්‍යයට පැමිණියෙම් වෙමියි. මා දිවිවැටුම් පරාපිළිබැඳි වෙයි; මා විසින් ගිහිනට අන්‍ය වූ ශ්‍රමණාකල්පයෙක් කට යුත්තේ ය; මහණෙනි, ශ්‍රමණයනට උපදනා මෙ ත්‍රිවිධ සංඥාහු භාවිත බහුලීකෘත වූවාහු සත් කරුණක් පිරිපුන් කරත්. කවර සත් කෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "හැම කල්හි නිරන්තරකාරී වූයේ ශීලයෙහි සතතප්‍රවෘත්ති ඇත්තේ වෙයි. අභිධ්‍යාබහුල නොවෙයි. ව්‍යාපාද නැත්තේ වෙයි. අතිමාන නැත්තේ වෙයි. ශික්‍ෂා කාම වෙයි. ඔහුගේ ජීවිතපරික්‍ෂාකාරයන්හි මේ ප්‍රත්‍යය ය යන (අදහස) වෙයි. ඇරඹු වැර ඇතියේ ද වෙයි. මහණෙනි, මේ ත්‍රිවිධ ශ්‍රමණ සංඥාවෝ භාවිත බහුලීකෘත වූවාහු මෙ සත් කරුණු සපුරත්යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බොජ්ඣඞ්ග සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මේ සප්ත බෝධ්‍යඞ්ගයෝ භාවිත බහුලීකෘත වූවාහු ත්‍රිවිද්‍යාවන් සපුරත්. කවර සතෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සතිසම්බොජ්ඣඞ්ගය, ධම්මවිචය සම්බොජ්ඣඞ්ගය, විරිය සම්බොජ්ඣඞ්ගය, පීති සම්බොජ්ඣඞ්ගය, පස්සද්ධි සම්බොජ්ඣඞ්ගය, සමාධි සම්බොජ්ඣඞ්ගය, උපෙක්ඛා සම්බොජ්ඣඞ්ගය යි. මහණෙනි, මේ සප්ත සම්බොජඣඞ්ගයෝ භාවිත බහුලීකෘත වූවාහු ත්‍රිවිද්‍යාවන් සපුරත්, කවර තිදෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ අනේකවිධ වූ පූර්වේනිවාසානු ස්මෘතිය සිහි කරයි. එ කෙසේය යත්: එක් ජාතියක් ද, ජාති දෙකක් ද ... මෙසේ ආකාර සහිත උද්දේශ සහිත අනේකවිධ පූර්වේනිවාසය අනුස්මරණය කරයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 380,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන -පෙ- යථාකම්මූපගෙ සත්තෙ පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ආසවානං ඛයා -පෙ- සච්ඡිකත්වා උපසම්පජ්ජ විහරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ සත්ත බොජ්ඣඞ්ගා භාවිතා බහුලීකතා ඉමා තිස්සො විජ්ජා පරිපූරෙන්තී ති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 3.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "මිච්ඡත්ත සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡත්තං භික්ඛවෙ ආගම්ම විරාධනා හොති, නො ආරාධනා. කථඤ්ච භික්ඛවෙ මිච්ඡත්තං ආගම්ම විරාධනා හොති නො ආරාධනා:"
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාදිට්ඨිකස්ස භික්ඛවෙ මිච්ඡාසංකප්පො පහොති, මිච්ඡාසඞ්කප්පස්ස මිච්ඡාවාචා පහොති, මිච්ඡාවාචස්ස මිච්ඡාකම්මන්තො පහොති, මිච්ඡාකම්මන්තස්ස මිච්ඡා ආජීවො පහොති, මිච්ඡාආජීවස්ස මිච්ඡාවායාමො පහොති, මිච්ඡාවායාමස්ස මිච්ඡාසති පහොති, මිච්ඡාසතිස්ස මිච්ඡාසමාධි පහොති, මිච්ඡාසමාධිස්ස මිච්ඡාඤාණං පහොති, මිච්ඡාඤාණිස්ස{1} මිච්ඡාවිමුත්ති පහොති. එවං ඛො භික්ඛවෙ මිච්ඡත්තං ආගම්ම විරාධනා හොති නො ආරාධනා."
                    },
                    {
                        "type": "paragraph",
                        "text": "සම්මත්තං භික්ඛවෙ ආගම්ම ආරාධනා හොති, නො විරාධනා කථඤ්ච භික්ඛවෙ සම්මත්තං ආගම්ම ආරාධනා හොති, නො විරාධනා:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සම්මාදිට්ඨිකස්ස භික්ඛවෙ සම්මාසඞ්කප්පො පහොති, සම්මාසඞ්කප්පස්ස සම්මාවාචා පහොති, සම්මාවාචස්ස සම්මාකම්මන්තො පහොති, සම්මාකම්මන්තස්ස සම්මා ආජීවො පහොති, සම්මා ආජීවස්ස සම්මාවායාමො පහොති, සම්මා වායාමස්ස සම්මාසති පහොති, සම්මාසතිස්ස සම්මා සමාධි පහොති, සම්මාසමාධිස්ස සම්මාඤාණං පහොති, සම්මාඤාණිස්ස{2} සම්මාවිමුත්ති පහොති. එවං ඛො භික්ඛවෙ සම්මත්තං ආගම්ම ආරාධනා හොති නො විරාධනා ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. මිච්ඡාඤාණස්ස – PTS"
                    },
                    {
                        "type": "footnote",
                        "text": "2. සම්මාඤාණස්ස – PTS"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මිනිසැස ඉක්ම ගිය, විශුද්ධ වූ දිවැසින් ... කම් වූ පරිදි ප්‍රතිසන්‍ධියට එළඹෙන සත්ත්‍වයන් දනිත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආස්‍රවක්‍ෂයන් … සාක්‍ෂාත් කොට එයට එළඹ වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මෙ සප්ත බෝධ්‍යඞ්ගයෝ භාවිත බහුලීකෘත වූවාහු මෙ ත්‍රිවිද්‍යාවන් සපුරත්.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මිච්ඡත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මිථ්‍යාත්‍වයට විරාධනා වෙයි. ආරාධනායෙක් නොවෙයි. මහණෙනි, කෙසේ නම් මිථ්‍යාත්‍වයට පැමිණීමෙන් විරාධන වේ යැ ආරාධනා නො වේය යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මිථ්‍යාදෘෂ්ටිකහට මිථ්‍යාසංකල්පය පොහෝනේය, මිථ්‍යාසංකල්ප ඇතියහට මිථ්‍යාවාක් පොහෝනේය. මිථ්‍යාවාක් ඇතියහට මිථ්‍යා කර්‍මාන්ත පොහෝනේය. මිථ්‍යා කර්‍මාන්ත ඇතියහට මිථ්‍යා ආජීවය පොහෝනේය. මිථ්‍යා ආජීව ඇත්තාහට මිථ්‍යා ව්‍යායාමය පොහෝනේය. මිථ්‍යා ව්‍යායාමය ඇත්තාහට මිථ්‍යා ස්මෘතිය පොහෝනේය. මිථ්‍යා ස්මෘතිය ඇත්තාහට මිථ්‍යා සමාධිය පොහෝනේය. මිථ්‍යා සමාධි ඇත්තාහට මිථ්‍යා ඥානය පොහෝනේය. මිථ්‍යා ඥානය ඇත්තාහට මිථ්‍යා විමුක්ති පොහෝනේය. මහණෙනි, මෙ සෙයින් ම මිථ්‍යාත්‍වයට පැමිණීමෙන් විරාධනා වෙයි. ආරාධනා නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සම්‍යක්ත්‍වයට පැමිණීමෙන් ස්වර්‍ග - මාර්‍ගාරාධනා වෙයි. විරාධනා නො වෙයි. මහණෙනි, කෙසේ නම් සම්‍යක්ත්‍වයට පැමිණීමෙන් ආරාධනා වේයැ, විරාධනා නොවේය යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සම්‍යක්දෘෂ්ටිකයාහට සම්‍යක් සංකල්පට පොහෝනේය. සම්‍යක් සංකල්ප ඇතිහට සම්‍යග් වචනය පොහෝනේය. සම්‍යග් වචනය ඇතියහට සම්‍යක්කර්‍මාන්තය පොහෝනේය. සම්‍යක් කර්‍මාන්ත ඇතියහට සම්‍යගාජීවය පොහෝනේය. සම්‍යගාජීවය ඇතියහට සම්‍යග් ව්‍යායාමය පොහෝනේය. සම්‍යග් ව්‍යායාමය ඇත්තහුට සම්‍යක් ස්මෘතිය පොහෝනේය. සම්‍යක් ස්මෘතිය ඇත්තහුට සම්‍යක් සමාධිය පොහෝනේය. සම්‍යක් සමාධිය ඇත්තහුට සම්‍යග් ඥානය පොහෝනේය. සම්‍යග් ඥාන ඇත්තහුට සම්‍යග් විමුක්තිය පොහෝනේයි. මහණෙනි, මෙ සෙයින් ම සම්‍යක්ත්‍වයට පැමිණීමෙන් ආරාධනා වේ. විරාධනා නො වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 382,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 4.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "බීජ සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාදිට්ඨිකස්ස භික්ඛවෙ පුරිස පුග්ගලස්ස මිච්ඡා සංකප්පස්ස - මිච්ඡා වාචස්ස - මිච්ඡා කම්මන්තස්ස - මිච්ඡා ආජීවස්ස - මිච්ඡා වායාමස්ස - මිච්ඡා සතිස්ස - මිච්ඡා සමාධිස්ස - මිච්ඡා ඤාණිස්ස - මිච්ඡා විමුත්තිස්ස යඤ්චෙව{1} කායකම්මං යථාදිට්ඨි සමත්තං සමාදින්නං{2}, යඤ්ච වචීකම්මං -පෙ- යඤ්ච මනොකම්මං යථාදිට්ඨි සමත්තං සමාදින්නං, යා ච චෙතනා යා ච පත්ථනා, යො ච පණිධි, යෙ ච සඞ්ඛාරා, සබ්බෙ තෙ ධම්මා, අනිට්ඨාය අකන්තාය අමනාපාය අහිතාය දුක්ඛාය සංවත්තන්ති. තං කිස්ස හෙතු: දිට්ඨි හි{3} භික්ඛවෙ පාපිකා."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි භික්ඛවෙ නිම්බබීජං වා කොසාතකී බීජං තිත්තකාලාබු බීජං වා අල්ලාය පඨවියා නික්ඛිත්තං යඤ්චෙව{1} පඨවිරසං උපාදියති. යඤ්ච ආපොරසං උපාදියති. සබ්බං තං තිත්තකත්තාය කටුකත්තාය අසාතත්තාය සංවත්තන්ති. තං කිස්ස හෙතු: බීජං හි භික්ඛවෙ පාපකං."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ මිච්ඡාදිට්ඨිකස්ස පුරිස පුග්ගලස්ස - මිච්ඡා සංකප්පස්ස - මිච්ඡා වාචස්ස - මිච්ඡා කම්මන්තස්ස - මිච්ඡා ආජීවස්ස - මිච්ඡා වායාමස්ස - මිච්ඡා සතිස්ස - මිච්ඡා සමාධිස්ස - මිච්ඡා ඤාණිස්ස - මිච්ඡා විමුත්තිස්ස යඤ්චෙව කායකම්මං යථාදිට්ඨි සමත්තං සමාදින්නං, යඤ්ච වචීකම්මං -පෙ- යඤ්ච මනොකම්මං යථාදිට්ඨි සමත්තං සමාදින්නං, යා ච චෙතනා යා ච පත්ථනා, යො ච පණිධි, යෙ ච සඞ්ඛාරා, සබ්බෙ තෙ ධම්මා, අනිට්ඨාය අකන්තාය අමනාපාය අහිතාය දුක්ඛාය සංවත්තන්ති. තං කිස්ස හෙතු: දිට්ඨි හි භික්ඛවෙ පාපිකා."
                    },
                    {
                        "type": "paragraph",
                        "text": "සම්මාදිට්ඨිකස්ස භික්ඛවෙ පුරිසපුග්ගලස්ස සම්මා සංකප්පස්ස - සම්මා වාචස්ස - සම්මා කම්මන්තස්ස - සම්මා ආජීවස්ස - සම්මා වායාමස්ස - සම්මා සතිස්ස - සම්මා සමාධිස්ස - සම්මා ඤාණිස්ස - සම්මා විමුත්තිස්ස යඤ්චෙව කායකම්මං යථාදිට්ඨි සමත්තං සමාදින්නං, යඤ්ච වචීකම්මං යථාදිට්ඨි සමත්තං සමාදින්නං යඤ්ච මනොකම්මං යථාදිට්ඨි සමත්තං සමාදින්නං, යා ච චෙතනා, යා ච පත්ථනා යො ච පණිධි, යෙ ච සඞ්ඛාරා සබ්බෙ තෙ ධම්මා ඉට්ඨාය කන්තාය මනාපාය හිතාය සුඛාය සංවත්තන්ති. තං කිස්ස හෙතු: දිට්ඨි හි{4} භික්ඛවෙ භද්දිකා."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. යඤ්ච – මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "2. සමාදින්නං – PTS"
                    },
                    {
                        "type": "footnote",
                        "text": "3. දිට්ඨි හිස්ස – මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "4. දිට්ඨිහිහිස්ස – මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බීජ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මිථ්‍යාදෘෂ්ටික පුරුෂ පුද්ගලයා විසින් - මිථ්‍යා සංකල්ප ඇති - මිථ්‍යා වාක් ඇති - මිථ්‍යා කර්‍මාන්ත ඇති - මිථ්‍යා ආජීව ඇති - මිථ්‍යා ව්‍යායාම ඇති - මිථ්‍යා ස්මෘති ඇති - මිථ්‍යා සමාධි ඇති - මිථ්‍යා ඥාන ඇති - මිථ්‍යා විමුක්ති ඇති පුරුෂ පුද්ගලයා විසින් දෘෂ්ටි පරිදි ගන්නා ලද සමාදන් වන ලද යම් කාය කර්‍මයක් හා - යම් වාග් කර්‍මයක් හා දෘෂ්ටි පරිදි ගන්නා ලද සමාදන් වන ලද යම් මනඃ කර්‍මයක් හා යම් චේතනාවක් හා යම් ප්‍රාර්‍ත්‍ථනාවක් හා යම් ප්‍රණිධියක් හා යම් සංස්කාර හා වෙත් නම්, ඒ හැම ධර්‍මයෝ අනිටු වූ අකාන්ත වූ අමනාප වූ අහිත වූ දුක් පිණිස වැටෙත්. එ කවර හෙයින යත්: මහණෙනි, දෘෂ්ටිය ලමු වේ මැයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් සේ කොසඹ බිජුවටෙක් වේවයි වැටකොලු බිජුවටෙක් වේවයි තික්ත ලබු බිජුවටෙක් වේවයි තෙත් පොළොව්හි නික්‍ෂිප්ත වූයේ යම් ම පොළෝරසයක් හා අල්වාගනී නම්, යම් ම ආපෝරසයක් හා අල්වාගනී නම්, එහැම තික්ත භාවය පිණිස, කුළුබව් පිණිස, අශාතභාවය පිණිස වැටෙයි. එ කවරහෙයින යත්: මහණෙනි, බිජුවට ලමුමැයි. (එහෙයිනි)",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිද්දෙන් ම මිථ්‍යාදෘෂ්ටික පුරුෂ පුද්ගලයා විසින් - මිථ්‍යාසංකල්ප ඇති - මිථ්‍යාවාක් ඇති - මිථ්‍යා කර්‍මාන්ත ඇති - මිථ්‍යා ආජීව ඇති - මිථ්‍යා ව්‍යායාම ඇති - මිථ්‍යා ස්මෘති ඇති - මිථ්‍යා සමාධි ඇති - මිථ්‍යා ඥාන ඇති - මිථ්‍යා විමුක්ති ඇති පුරුෂ පුද්ගලයා විසින් දෘෂ්ටි වූ පරිද්දෙන් ගන්නා ලද සමාදන්වන ලද යම් කායකර්‍මයක් හා - යම් ම වාක්කර්‍මයක් හා දෘෂ්ටි පරිදි ගන්නා ලද සමාදන් වන ලද යම් ම මනඃකර්‍මයක් හා - යම් ම චේතනාවක් හා යම් ම ප්‍රාර්‍ත්‍ථනාවක් හා යම් ම ප්‍රණිධියක් හා යම් ම සංස්කාර කෙනෙක් හා වෙත් ද එ හැම දහම්හු අනිටු බව පිණිස, අකාන්තය පිණිස දුක් පිණිස වැටෙත්. එ කවර හෙයින යත්: මහණෙනි, දෘෂ්ටිය ලමු මැයි. (එහෙයිනි)",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සම්‍යක්දෘෂ්ටික පුරුෂපුද්ගලයා විසින් - සම්‍යක් සංකල්ප ඇති - සම්‍යක් වාක් ඇති - සම්‍යක් කර්‍මාන්ත ඇති - සම්‍යක් ආජීව ඇති - සම්‍යක් ව්‍යායාම ඇති - සම්‍යක් ස්මෘති ඇති - සම්‍යක් සමාධි ඇති - සම්‍යක් ඥාන ඇති - සම්‍යක් විමුක්ති ඇති පුරුෂ පුද්ගලයා විසින් දෘෂ්ටි වූ පරිදි ගන්නා ලද සමාදන් වන ලද යම් ම කායකර්‍මයක් වේවයි, දෘෂ්ටි වූ පරිදි ගන්නා ලද සමාදන්වන ලද යම් ම වාක්කර්‍මයක් වේවයි, දෘෂ්ටි වූ පරිදි ගන්නා ලද සමාදන්වන ලද යම් ම මනඃකර්‍මයක් වේවයි, යම් ම චේතනාවක් වේවයි, යම් ම ප්‍රාර්‍ත්‍ථනාවක් වේවයි, යම් ම ප්‍රණිධියක් වේවයි, යම් ම සංස්කාර වෙත්වයි, එ හැම ධර්‍මයෝ ඉටු වූ කාන්ත වූ මනාප වූ හිත වූ සැප පිණිස වැටෙත්. එ කවරහෙයින යත්: මහණෙනි, දෘෂ්ටිය භද්‍ර මැයි. (එහෙයිනි)",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 384,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි භික්ඛවෙ, උච්ඡුබීජං වා සාළි බීජං වා මුද්දිකා බීජං වා අල්ලාය පඨවියා නික්ඛිත්තං යඤ්චෙව පඨවිරසං උපාදියති, යඤ්ච ආපොරසං උපාදියති, සබ්බං තං සාතත්තාය මධුරත්තාය අසෙචනකත්තාය සංවත්තති. තං කිස්ස හෙතු: බීජං හි භික්ඛවෙ භද්දකං."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ සම්මාදිට්ඨිකස්ස පුරිසපුග්ගලස්ස සම්මා සංකප්පස්ස සම්මාවාචස්ස - සම්මාකම්මන්තස්ස - සම්මා ආජීවස්ස - සම්මා වායාමස්ස - සම්මා සතිස්ස - සම්මා සමාධිස්ස - සම්මා ඤාණස්ස - සම්මා විමුත්තිස්ස යඤ්චෙව කායකම්මං යථාදිට්ඨි සමත්තං සමාදින්නං, යඤ්ච වචීකම්මං -පෙ- යඤ්ච මනොකම්මං යථාදිට්ඨි සමත්තං සමාදින්නං, යා ච චෙතනා, යා ච පත්ථනා යො ච පණිධි, යෙ ච සඞ්ඛාරා සබ්බෙ තෙ ධම්මා ඉට්ඨාය කන්තාය මනාපාය හිතාය සුඛාය සංවත්තන්ති. තං කිස්ස හෙතු: දිට්ඨි හි භික්ඛවෙ භද්දිකාති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 5.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "විජ්ජා සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "අවිජ්ජා භික්ඛවෙ පුබ්බඞ්ගමා අකුසලානං ධම්මානං සමාපත්තියා. අන්වදෙව අහිරිකං අනොත්තප්පං. අවිජ්ජාගතස්ස භික්ඛවෙ අවිද්දසුනො මිච්ඡාදිට්ඨි පහොති. මිච්ඡාදිට්ඨිකස්ස මිච්ඡාසඞ්කප්පො පහොති. මිච්ඡා සඞ්කප්පස්ස මිච්ඡාවාචා පහොති. මිච්ඡාවාචස්ස මිච්ඡාකම්මන්තො පහොති. මිච්ඡා කම්මන්තතස්ස මිච්ඡා ආජීවො පහොති. මිච්ඡා ආජීවස්ස මිච්ඡාවායාමො පහොති. මිච්ඡා වායාමස්ස මිච්ඡාසති පහොති. මිච්ඡා සතිස්ස මිච්ඡාසමාධි පහොති. මිච්ඡා සමාධිස්ස මිච්ඡාඤාණං පහොති. මිච්ඡාඤාණිස්ස මිච්ඡාවිමුත්ති පහොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, යම්පරිදි උක් බිජුවටෙක් වේවයි හැල් බිජුවටෙක් වේවයි මිදි බිජුවටෙක් වේවයි තෙත් පොළොව්හි නික්‍ෂිප්ත වූයේ යම්බඳු පොළෝ රසයක් ගන්නේ ද ආපෝරසයක් ගන්නේ ද එ හැම ශාකභාවයට මියුරු බවට අසෙචනක භාවයට වැටෙයි. එ කවර හෙයින යත්: මහණෙනි, බිජුවට භද්‍ර ය, එහෙයිනි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එපරිදි ම මහණෙනි, සම්‍යග්දෘෂ්ටික පුරුෂපුද්ගලයා විසින් - සම්‍යක්සංකල්ප ඇති - සම්‍යග්වචන ඇති - සම්‍යක්කර්‍මාන්ත ඇති - සම්‍යගාජීව ඇති - සම්‍යග්ව්‍යායාම ඇති - සම්‍යක්ස්මෘති ඇති - සම්‍යක්සමාධි ඇති - සම්‍යග්ඥාන ඇති - සම්‍යග්විමුක්ති ඇති පුරුෂපුද්ගලයා විසින් දෘෂ්ටියට අනුව ගන්නා ලද සමාදන් වන ලද යම් ම කායකර්‍මයක් වේවයි, යම් ම වාක්කර්‍මයක් වේවයි - දෘෂ්ටියට අනුව ගන්නා ලද සමාදන් වන ලද යම් ම මනඃකර්‍මයක් වේවයි, යම් ම චේතනාවක් වේවයි, යම් ම ප්‍රාර්‍ත්‍ථනාවක් වේවයි, යම් ම ප්‍රණිධියක් වේවයි, යම් ම සංස්කාරකෙනෙක් වෙත්වයි, එ හැම ඉටු වූ කාන්ත වූ මනාප වූ හිත වූ සුඛය පිණිස වැටෙත්. එ කවර හෙයින යත්: මහණෙනි, දෘෂ්ටිය භද්‍ර මැයි. (එහෙයිනි)",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "විජ්ජා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, අකුශලධර්‍ම සමාපත්තියට අවිද්‍යා පූර්‍වඞ්ගම වෙයි. අහ්‍රීකය, අනපත්‍රපාය යන දෙක නුහුබඳනේ මය. මහණෙනි, අවිද්‍යාගත අන්‍ධබාලයාට මිථ්‍යාදෘෂ්ටිය පොහෝනේය. මිථ්‍යාදෘෂ්ටිකහට මිථ්‍යා සංකල්පය පොහෝනේයි. මිථ්‍යාසංකල්ප ඇතියහුට මිථ්‍යාවාක් පොහෝනේයි. මිථ්‍යාවාක් ඇතියහුට මිථ්‍යාකර්‍මාන්ත පොහෝනේය. මිථ්‍යාකර්‍මාන්ත ඇතියහට මිථ්‍යා ආජීවය පොහෝනේය. මිථ්‍යාආජීවය ඇතියහට මිථ්‍යාව්‍යායාමය පොහෝනේය. මිථ්‍යාව්‍යායාමය ඇතියහට මිථ්‍යාස්මෘතිය පොහෝනේය. මිථ්‍යාස්මෘතිය ඇතියහට මිථ්‍යාසමාධි පොහෝනේය. මිථ්‍යාසමාධි ඇතියහට මිථ්‍යාඥානය පොහෝනේය. මිථ්‍යාඥානය ඇතියහට මිථ්‍යාවිමුක්ති පොහෝනේය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 386,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "විජ්ජා ච ඛො භික්ඛවෙ පුබ්බඞ්ගමා කුසලානං ධම්මානං සමාපත්තියා. අන්වදෙව හිරොතප්පං. විජ්ජාගතස්ස භික්ඛවෙ විද්දසුනො සම්මාදිට්ඨි පහොති. සම්මා දිට්ඨිකස්ස සම්මා සඞ්කප්පො පහොති, සම්මා සඞ්කප්පස්ස සම්මාවාචා පහොති. සම්මා වාචස්ස සම්මා කම්මන්තො පහොති. සම්මා කම්මන්තස්ස සම්මා ආජීවො පහොති. සම්මා ආජීවස්ස සම්මාවායාමො පහොති. සම්මාවායාමස්ස සම්මාසති පහොති. සම්මාසතිස්ස සම්මා සමාධි පහොති. සම්මාසමාධිස්ස සම්මා ඤාණං පහොති. සම්මාඤාණස්ස සම්මා විමුත්ති පහොතී’ති"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 6.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "නිජ්ජර සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**[සාවත්ථි]**"
                    },
                    {
                        "type": "paragraph",
                        "text": "දස ඉමානි භික්ඛවෙ නිජ්ජරවත්ථූනි. කතමානි දස:"
                    },
                    {
                        "type": "paragraph",
                        "text": "1. සම්මාදිට්ඨිකස්ස භික්ඛවෙ මිච්ඡාදිට්ඨි නිජ්ජිණ්ණා හොති. යෙ ච මිච්ඡාදිට්ඨිපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, තෙ චස්ස නිජ්ජිණ්ණා හොන්ති. සම්මාදිට්ඨිපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. සම්මාසංකප්පස්ස භික්ඛවෙ මිච්ඡාසඞ්කප්පො නිජ්ජිණ්ණො හොති. යෙ ච මිච්ඡාසඞ්කප්පපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, තෙ චස්ස නිජ්ජිණ්ණා හොන්ති, සම්මා සඞ්කප්පපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. සම්මාවාචස්ස භික්ඛවෙ මිච්ඡාවාචා නිජ්ජිණ්ණො හොති. යෙ ච මිච්ඡාවාචාපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, තෙ චස්ස නිජ්ජිණ්ණා හොන්ති. සම්මාවාචාපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "4. සම්මාකම්මන්තස්ස භික්ඛවෙ මිච්ඡාකම්මන්තො නිජ්ජිණ්ණො හොති, යෙ ච මිච්ඡාකම්මන්ත පච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති. තෙ චස්ස නිජ්ජිණ්ණා හොන්ති. සම්මාකම්මන්තපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "5. සම්මා ආජීවස්ස භික්ඛවෙ මිච්ඡාආජීවො නිජ්ජිණ්ණො හොති. යෙ ච මිච්ඡාආජීවපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, තෙ චස්ස නිජ්ජිණ්ණා හොන්ති. සම්මාආජීව පච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "තවද මහණෙනි, කුශලධර්‍මසමාපත්තියට විද්‍යාව පූර්‍වඞ්ගම වෙයි. එ අනුව හිරිඔතප් නුහුබඳනේ ය. මහණෙනි, විද්‍යාගත විදර්ශිහට සම්‍යග්දෘෂ්ටිය පොහෝනේ ය. සම්‍යග්දෘෂ්ටිකයාහට සම්‍යක්සංකල්පය පොහෝනේ ය. සම්‍යග්සංකල්පය ඇත්තාහට සම්‍යක්වාග් පොහෝනේ ය. සම්‍යක්වචන ඇත්තාහට සම්‍යක්කර්‍මාන්තය පොහෝනේ ය. සම්‍යක්කර්‍මාන්තය ඇත්තාහට සම්‍යගාජීවය පොහෝනේ ය. සම්‍යගාජීව ඇත්තාහට සම්‍යග්ව්‍යායාමය පොහෝනේ ය. සම්‍යග්ව්‍යායාමය ඇත්තාහට සම්‍යක්ස්මෘතිය පොහෝනේ ය. සම්‍යග්ස්මෘති ඇත්තාහට සම්‍යග්ඥානය පොහෝනේ ය. සම්‍යග්ඥානය ඇත්තාහට සම්‍යග්විමුක්තිය පොහෝනේ යයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නිජ්ජර සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "**[සැවැත්]**",
                        "type": "unindented"
                    },
                    {
                        "text": "මහණෙනි, මෙ නිර්ජර වස්තූහු දශදෙනෙක. කවර දශදෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "1. මහණෙනි, සම්‍යග්දෘෂ්ටිකයාගේ මිථ්‍යාදෘෂ්ටිය (මාර්‍ගභාවනායෙන්) නිර්ජිර්‍ණ වෙයි. මිථ්‍යාදෘෂ්ටි ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලමු අකුශල ධර්‍මයෝ උපදනාහු නම් ඔහුගේ එ අකුශල ධර්‍මයෝ නිර්ජිර්‍ණ වෙත්. සම්‍යග්දෘෂ්ටි ප්‍රත්‍යයෙනුදු නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. මහණෙනි, සම්‍යක්සංකල්ප ඇතියහුගේ මිථ්‍යාසංකල්පය නිර්ජිර්‍ණ වෙයි. මිථ්‍යාසංකල්ප ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලමු අකුශල ධර්‍මයෝ උපදනාහු නම් ඕහට ඔහුදු නිර්ජිර්‍ණ වෙත්. සම්‍යග් සංකල්ප ප්‍රත්‍යයෙනුදු නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. මහණෙනි, සම්‍යක්වචන ඇතියහුගේ මිථ්‍යාවචනය නිර්ජීර්‍ණ වෙයි. මිථ්‍යාවාක්ර ප්‍රත්‍යයෙන් නොයෙක් ලාමක අකුශල ධර්‍මයෝ වෙත් නම් ඕහට ඔහු ද නිර්ජිර්‍ණ වෙත්. සම්‍යග්වාක් ප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. මහණෙනි, සම්‍යක්කර්‍මාන්ත ඇතියහුගේ මිථ්‍යාකර්‍මාන්තය නිර්ජිර්‍ණ වෙයි. මිථ්‍යාකර්‍මාන්ත ප්‍රත්‍යයෙන් නොයෙක් ලාමක අකුශල ධර්‍මයෝ උපදනාහු නම් ඕහට එ අකුශලධර්‍මයෝ ද නිර්ජිර්‍ණ වෙත්. සම්‍යක් සංකල්පකර්‍මාන්ත ප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "5. මහණෙනි, සම්‍යගාජීව ඇතියහුගේ මිථ්‍යාජීවය නිර්ජිර්‍ණ වෙයි. මිථ්‍යාජීව ප්‍රත්‍යයෙන් යම්බඳු ලාමක අකුශලධර්‍මයෝ වෙත් නම් ඔහුගේ ඒ අකුශලධර්‍මයෝ නිර්ජිර්‍ණ වෙත්. සම්‍යගාජීව ප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ ද භාවනායෙන් පරිපූර්තියට යෙත්.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 388,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "6. සම්මාවායාමස්ස භික්ඛවෙ මිච්ඡාවායාමො නිජ්ජිණ්ණො හොති. යෙ ච මිච්ඡාවායාමපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, තෙ චස්ස නිජ්ජිණා හොන්ති. සම්මාවායාම පච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "7. සම්මා සතිස්ස භික්ඛවෙ මිච්ඡා සති නිජ්ජිණ්ණා හොති. යෙ ච මිච්ඡාසතිපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, තෙ චස්ස නිජ්ජිණ්ණා හොන්ති. සම්මාසති පච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "8. සම්මා සමාධිස්ස භික්ඛවෙ මිච්ඡා සමාධි නිජ්ජිණ්ණො හොති. යෙ ච මිච්ඡාසමාධිපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, තෙ චස්ස නිජ්ජිණ්ණා හොන්ති. සම්මාසමාධිපච්චයා ච අනෙකෙ කුසලා ධම්මා භවනා පාරිපූරිං ගච්ඡන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "9. සම්මා ඤාණස්ස භික්ඛවෙ මිච්ඡා ඤාණං නිජ්ජිණ්ණං හොති. යෙ ච මිච්ඡාඤාණපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, තෙ චස්ස නිජ්ජිණ්ණා හොන්ති. සම්මාඤාණපච්චයා ච අනෙකෙ කුසලා ධම්මා භවනා පාරිපූරිං ගච්ඡන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "10. සම්මාවිමුත්තිස්ස භික්ඛවෙ මිච්ඡාවිමුත්ති නිජ්ජිණ්ණා හොති. යෙච මිච්ඡාවිමුත්තිපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, තෙ චස්ස නිජ්ජිණ්ණා හොන්ති. සම්මාවිමුත්තිපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති. ඉමානි ඛො භික්ඛවෙ දසනිජ්ජරාවත්ථුනී ති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 7.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "ධොවන සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**[සාවත්ථි]**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි භික්ඛවෙ දක්ඛිණෙසු ජනපදෙසු ධොවනං නාම තත්ථ හොති අන්නම්පි පානම්පි ඛජ්ජම්පි භොජ්ජම්පි ලෙය්යම්පි පෙය්යම්පි නච්චම්පි ගීතම්පි වාදිතම්පි. අත්ථෙතං භික්ඛවෙ ධොවනං, නෙතං නත්ථීති වදාමි. තඤ්ච ඛො එතං භික්ඛවෙ ධොවනං හීනං ගම්මං පොථුජ්ජනිකං අනරියං අනත්ථ සංහිතං, න නිබ්බිදාය න විරාගාය න නිරොධාය න උපසමයා න අභිඤ්ඤාය න සම්බොධාය න නිබ්බානාය සංවත්ත ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "6. මහණෙනි, සම්‍යග්ව්‍යායාම ඇතියහුගේ මිථ්‍යාව්‍යායාමය නිර්ජිර්‍ණ වෙයි. මිථ්‍යාව්‍යායාම ප්‍රත්‍යයෙන් යම්බඳු ලාමක අකුශල ධර්‍මයෝ උපදනාහු නම්, ඕහට එ අකුසල්හු ද නිර්ජිර්‍ණ වෙත්. සම්‍යග්ව්‍යායාම ප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "7. මහණෙනි, සම්‍යක්ස්මෘති ඇතියහුගේ මිථ්‍යාස්මෘතිය නිර්ජිර්‍ණ වෙයි, මිථ්‍යාස්මෘති ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශල ධර්‍මයෝ උපදනාහු නම් ඔහුගේ එ අකුශලධර්‍මයෝ ද නිර්ජිර්‍ණ වෙත්. සම්‍යක්ස්මෘති ප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "8. මහණෙනි, සම්‍යක්සමාධි ඇතියහුගේ මිථ්‍යාසමාධිය නිර්ජිර්‍ණ වෙයි. මිථ්‍යාසමාධිප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශල ධර්‍මයෝ උපදනාහු නම් ඕහට එ අකුශලධර්‍මයෝ ද නිර්ජිර්‍ණ වෙත්. සම්‍යක්සමාධිප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පිරීමට යෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "9. මහණෙනි, සම්‍යග්ඥාන ඇතියහුගේ මිථ්‍යාඥාන නිර්ජිර්‍ණ වෙයි. මිථ්‍යාඥාන ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශල ධර්‍මයෝ උපදනාහු නම් ඕහට එ අකුශලධර්‍මයෝ ද නිර්ජිර්‍ණ වෙත්. සම්‍යග්ඥාන ප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "10. මහණෙනි, සම්‍යග් විමුක්ති ඇතියහුගේ මිථ්‍යාවිමුක්ති නිර්ජිර්‍ණ වෙයි, මිථ්‍යාවිමුක්ති ප්‍රත්‍යයෙන් නොයෙක් ලාමක අකුශල ධර්‍මයෝ උපදනාහු නම් ඕහට එ අකුශලධර්‍මයෝ ද නිර්ජිර්‍ණ වෙත්. සම්‍යග් විමුක්ති ප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත්. මහණෙනි, මෙ දසදෙන නිර්ජරවස්තූහු වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ධෝවන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "**[සැවැත්]**",
                        "type": "unindented"
                    },
                    {
                        "type": "paragraph",
                        "text": "මහණෙනි, දක්‍ෂිණජනපදයෙහි ධෝවන නම් නැකැත් කෙළියෙක් ඇත. මහණෙනි, එ නකත් කෙළියෙහි අන්න හා පාන හා ඛාද්‍ය භෝජ්‍ය හා ලෙහ්‍ය හා පෙය හා නෘත්‍ය හා ගීත හා වාදිත්‍ර හා වෙයි. මහණෙනි, තෙල ධොවනය ඇත් මැයි. තෙල නැතැයි නො ම කියමි. මහණෙනි, තෙල ධොවනය හීනය, ග්‍රාම්‍යය, පුහුදුනන් අයත්ය, අනාර්‍ය්‍යය, අනර්‍ත්‍ථ ඇසුරු කෙළේය. නිර්වේදය සඳහා නො වෙයි, විරාගය සඳහා නො වෙයි, නිරෝධය සඳහා නො වෙයි, ක්ලේශව්‍යුපශමය සඳහා නො වෙයි. අභිඥා සඳහා නො වෙයි, සම්බෝධිය සඳහා නො වෙයි, නිර්‍වාණය පිණිස නො වැටෙයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 390,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අහඤ්ච ඛො භික්ඛවෙ අරියං ධොවනං දෙසිස්සාමී. යං ධොවනං එකන්තනිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තති. යං ධොවනං ආගම්ම ජාතිධම්මා සත්තා ජාතියා පරිමුච්චන්ති, ජරාධම්මා සත්තා ජරාය පරිමුච්චන්ති, මරණධම්මා සත්තා මරණෙන පරිමුච්චන්ති, සොකපරිදෙවදුක්ඛදොමනස්සුපායාසධම්මා සත්තා සොකපරිදෙවදුක්ඛදොමනස්සුපායාසෙහි පරිමුච්චන්ති. තං සුණාථ, සාධුකං මනසිකරොථ, භාසිස්සාමී ති. එවං භන්තෙ ති ඛො තෙ භික්ඛු භගවතො පච්චස්සොසුං භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච තං භික්ඛවෙ අරියං ධොවනං යං ධොවනං එකන්ත නිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තති, යං ධොවනං ආගම්ම ජාතිධම්මා සත්තා ජාතියා පරිමුච්චන්ති, ජරාධම්මා සත්තා ජරාය පරිමුච්චන්ති, මරණධම්මා සත්තා මරණෙන පරිමුච්චන්ති, සොකපරිදෙවදුක්ඛදොමනස්සුපායාසධම්මා සත්තා සොකපරිදෙවදුක්ඛදොමනස්සුපායාසෙහි පරිමුච්චන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සම්මාදිට්ඨිකස්ස භික්ඛවෙ මිච්ඡාදිට්ඨි නිද්ධොතා හොති, යෙ ච මිච්ඡා දිට්ඨිපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, තෙ චස්ස නිද්ධොතා හොන්ති. සම්මාදිට්ඨිපච්චයා ච අනෙකෙ කුසලා ධම්මා භවනා පාරිපූරිං ගච්ඡන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සම්මාසඞ්කප්පස්ස භික්ඛවෙ මිච්ඡාසඞ්කප්පො නිද්ධොතො හොති -පෙ- සම්මාවාචස්ස භික්ඛවෙ මිච්ඡාවාචා නිද්ධොතා හොති -පෙ- සම්මාකම්මන්තස්ස භික්ඛවෙ මිච්ඡාකම්මන්තො නිද්ධොතො හොති -පෙ- සම්මා ආජීවස්ස භික්ඛවෙ මිච්ඡාආජීවො නිද්ධොතො හොති -පෙ- සම්මා වායාමස්ස භික්ඛවෙ මිච්ඡාවායාමො නිද්ධොතො හොති -පෙ- සම්මාසතිස්ස භික්ඛවෙ මිච්ඡාසති නිද්ධොතා හොති -පෙ- සම්මාසමාධිස්ස භික්ඛවෙ මිච්ඡාසමාධි නිද්ධොතො හොති -පෙ- සම්මාඤාණස්ස භික්ඛවෙ මිච්ඡාඤාණං නිද්ධොතං හොති -පෙ- සම්මා විමුත්තිස්ස භික්ඛවෙ මිච්ඡාවිමුත්ති නිද්ධොතා හොති. යෙ ච මිච්ඡාවිමුත්ති පච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, තෙ චස්ස නිද්ධොතා හොන්ති. සම්මාවිමුත්තිපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මම ද යම් ධොවනයක් ඒකාන්ත නිර්වේදය පිණිස, විරාගය පිණිස, නිරෝධය පිණිස, ව්‍යුපශමය පිණිස, අභිඥා පිණිස, සම්බෝධිය පිණිස, නිර්‍වාණය පිණිස වැටේ නම්, යම් ධොවනයකට පැමිණ ජාතිස්වභාව ඇති සත්හු ජාතියෙන් මිදෙත් නම් ජරාස්වාභාව ඇති සත්හු ජරායෙන් මිදෙත් නම්, මරණස්වාභාව ඇති සත්හු මරණයෙන් මිදෙත් නම්, ශෝක, පරිදේව, දුඃඛ, දෞර්‍මනස්‍ය උපායාස සැහැවි කොට ඇති සත්හු ශෝක, පරිදේව, දුක් දොම්නස් දැඩි ආයාසයෙන් මිදෙත් නම්, එබඳු ආර්‍ය්‍ය ධොවනයක් දෙසන්නෙමි. එ අසව, මොනොවට මෙනෙහි කරව, කියනෙමි යි. ‘එසේය, වහන්සැ’යි එ මහණහු භාග්‍යවත්හට පිළිවදන් ඇස්වූහ. භගවත්හු තෙල වදාළහ:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් ධොවනයක් ඒකාන්ත නිර්වේදයට විරාගයට, නිරෝධයට, ව්‍යුපශමයට, අභිඥාවට, සම්බෝධයට, නිර්‍වාණයට වැටේ නම්, යම් ධොවනයකට පැමිණ ජාතිධර්‍ම සත්ත්‍වයෝ ජාතියෙන් මිදෙත් නම්, ජරාධර්‍ම සත්ත්‍වයෝ ජරායෙන් මිදෙත් නම්, මරණධර්‍ම සත්ත්‍වයෝ මරණින් මිදෙත් නම්, ශෝක, පරිදේව, දුඃඛ, දෞර්‍මනස්‍ය, උපායාස ධර්‍ම සත්ත්‍වයෝ සෝක, පරිදේව, දුඃඛ, දෞර්‍මනස්‍ය, උපායාසයෙන් මිදෙත් නම්, එ ආර්‍ය්‍යධොවනය කවර යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සම්‍යක්දෘෂ්ටිකයා විසින් මිථ්‍යාදෘෂ්ටිය නිරවශේෂයෙන් දෝනාලදු වෙයි. මිථ්‍යාදෘෂ්ටිප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශලධර්‍මයෝ උපදනාහු නම් ඔහු විසින් ඔහුදු නිරවසෙස්නෙන් දෝනාලදහ. සම්‍යග්දෘෂ්ටි ප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ ද භාවනායෙන් පරිපූර්තියට යෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සම්‍යක්සංකල්ප ඇත්තහු විසින් මිථ්‍යාසංකල්පය නිර්ධෞත වෙයි. ... මහණෙනි, සම්‍යග්වාක් ඇතියහු විසින් මිථ්‍යාවචනය නිර්ධෞත වෙයි. ... මහණෙනි, සම්‍යක්කර්‍මාන්ත ඇතියහු විසින් මිථ්‍යාකර්‍මාන්තය නිර්ධෞත වෙයි. ... මහණෙනි, සම්‍යගාජීව ඇත්තහු විසින් මිථ්‍යාආජීවය නිර්ධෞත වෙයි. ... මහණෙනි, සම්‍යග්ව්‍යායාම ඇත්තහු විසින් මිථ්‍යාව්‍යායාම නිර්ධෞත වෙයි. ... මහණෙනි, සම්‍යක්ස්මෘති ඇතියහු විසින් මිථ්‍යාස්මෘතිය නිර්ධෞත වෙයි. ... මහණෙනි, සම්‍යක්සමාධි ඇත්තහු විසින් මිථ්‍යාසමාධිය නිර්ධෞත වෙයි. … මහණෙනි, සම්‍යග්ඥානය ඇතියහු විසින් මිථ්‍යාඥානය නිර්ධෞත වෙයි. ... මහණෙනි, සම්‍යග්විමුක්ති ඇත්තහු විසින් මිථ්‍යාවිමුක්තිය නිර්ධෞත වෙයි. මිථ්‍යාවිමුක්ති ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලමු අකුසල් දහම්හු උපදනාහු නම් ඔහු විසින් ඔහුදු නිර්ධෞත වෙත්. සම්‍යග්විමුක්ති ප්‍රත්‍යයෙන් නොයෙක් කුසල් දහම්හු ද භාවනායෙන් පරිපූර්තියට යෙත්.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 392,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉදං ඛො තං භික්ඛවෙ අරියං ධොවනං, යං ධොවනං එකන්ත නිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තති, යං ධොවනං ආගම්ම ජාතිධම්මා සත්තා ජාතියා පරිමුච්චන්ති, ජරාධම්මා සත්තා ජරාය පරිමුච්චන්ති, මරණධම්මා සත්තා මරණෙන පරිමුච්චන්ති, සොකපරිදෙවදුක්ඛදොමනස්සුපායාසධම්මා සත්තා සොකපරිදෙවදුක්ඛදොමනස්සුපායාසෙහි පරිමුච්චන්තී ති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 8.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "තිකිච්ඡක සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "තිකිච්ඡකා භික්ඛවෙ විරෙචනං දෙන්ති පිත්තසමුට්ඨානානම්පි ආබාධානං පටිඝාතාය, සෙම්හසමුට්ඨානානම්පි ආබාධානං පටිඝාතාය, වාතසමුට්ඨානානම්පි ආබාධානං පටිඝාතාය, අත්ථෙතං භික්ඛවෙ විරෙචනං නෙතං නත්ථි ති වදාමි. තඤ්ච ඛො එතං භික්ඛවෙ විරෙචනං සම්පජ්ජතිපි, විපජ්ජතිපි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අහඤ්ච ඛො භික්ඛවෙ අරියං විරෙචනං දෙසිස්සාමි, යං විරෙචනං සම්පජ්ජතියෙව නො විපජ්ජති, යං විරෙචනං ආගම්ම ජාතිධම්මා සත්තා ජාතියා පරිමුච්චන්ති, ජරාධම්මා සත්තා ජරාය පරිමුච්චන්ති, මරණධම්මා සත්තා මරණෙන පරිමුච්චන්ති, සොකපරිදෙවදුක්ඛදොමනස්සුපායාසධම්මා සත්තා සොකපරිදෙවදුක්ඛදොමනස්සුපායාසෙහි පරිමුච්චන්ති. තං සුණාථ, සාධුකං මනසිකරොථ, භාසිස්සාමීති. එවං භන්තෙති ඛො තෙ භික්ඛු භගවතො පච්චස්සොසුං. භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච තං භික්ඛවෙ අරියං විරෙචනං, යං විරෙචනං ආගම්ම ජාති ධම්මා සත්තා ජාතියා පරිමුච්චන්ති, ජරාධම්මා සත්තා ජරාය පරිමුච්චන්ති, මරණධම්මා සත්තා මරණෙන පරිමුච්චන්ති, සොකපරිදෙවදුක්ඛදොමනස්සුපායාසධම්මා සත්තා සොකපරිදෙවදුක්ඛදොමනස්සුපායාසෙහි පරිමුච්චන්ති:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සම්මාදිට්ඨිකස්ස භික්ඛවෙ මිච්ඡාදිට්ඨි විරිත්තො හොති, යෙ ච මිච්ඡාදිට්ඨිපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, තෙ චස්ස විරිත්තා හොන්ති. සම්මාදිට්ඨිපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, යම් ධොවනයෙක් ඒකාන්ත නිර්වේදයට - විරාගයට නිරෝධයට - ව්‍යුපමශයට - අභිඥාවට - සම්බෝධියට නිර්‍වාණයට වැටේ නම්, යම් ධොවනයකට පැමිණ ජාතිස්වභාව ඇති සත්ත්‍වයෝ ජාතියෙන් මිදෙත් නම්, ජරාස්වභාව ඇති සත්ත්‍වයෝ ජරායෙන් මිදෙත් නම්, මරණස්වභාව ඇති සත්ත්‍වයෝ මරණයෙන් මිදෙත් නම්, ශෝක, පරිදේව, දුක්, දොම්නස්, දැඩි ආයාස සැහැවි කොට ඇති සත්ත්‍වයෝ ශෝක, පරිදේව, දුක්, දොම්නස්, දැඩි ආයාසයන්ගෙන් මිදෙත් නම්, එ යයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තිකිච්ඡක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, චිකිත්සකයෝ පිතින් උපදනා ආබාධයන් නසනුවට ද සෙමෙන් උපදනා ආබාධයන් නසනුවට ද වාතයෙන් උපදනා ආබාධයන් නසනුවට ද විරේචන දෙත්. මහණෙනි, තෙල විරේචනය ඇත, ‘තෙල නැතැ’යි නොකියමි. මහණෙනි, තෙල විරේචනය සම්පද්‍යමාන හෝ විපද්‍යමාන හෝ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මම ද යම් විරේචනයෙක් සම්‍පද්‍යමාන ම වේ නම් විපද්‍යමාන නොවේ නම්, යම් විරේචනයකට පැමිණ ජාතිස්වභාව කොට ඇති සත්ත්‍වයෝ ජාතියෙන් මිදෙන්නාහු ද, ජරාස්වභාව කොට ඇති සත්ත්‍වයෝ ජරායෙන් මිදෙන්නාහු ද, මරණස්වභාව කොට ඇති සත්ත්‍වයෝ මරණින් මිදෙන්නාහු ද, ශෝකපරිදේව, දුක්, දොම්නස්, දැඩි ආයාස ස්වභාව කොට ඇති සත්ත්‍වයෝ ශෝකපරිදේව, දුක්, දොම්නස්, දැඩි ආයාසයෙන් මිදෙන්නාහු ද, එබඳු ආර්‍ය්‍ය විරේචනයක් දෙසම්. එ අසව, මොනොවට මෙනෙහි කරව, කියනෙමැයි. ‘එසේය වහන්සැ’යි එ මහණහු භගවත්හට පිළිවදන් ඇස්වූහ. භාග්‍යවතුන් වහන්සේ තෙල කරුණ දෙසූහ:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් විරේචනයට පැමිණ ජාතිධර්‍ම සත්ත්‍වයෝ ජාතියෙන් මිදෙන්නාහු නම්, ජරාධර්‍ම සත්ත්‍වයෝ ජරායෙන් මිදෙන්නාහු නම්, මරණධර්‍ම සත්ත්‍වයෝ මරණින් මිදෙන්නාහු නම්, ශෝකපරිදේව, දුඃඛ, දෞර්‍මනස්‍යෙපායාසධර්‍ම සත්ත්‍වයෝ ශෝක, පරිදේව, දුක්, දොම්නස් දැඩි ආයාසයෙන් මිදෙන්නාහු නම් එ ආර්‍ය්‍ය විරේචනය කවර:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සම්‍යග්දෘෂ්ටිකයා විසින් මිථ්‍යාදෘෂ්ටිය විරික්ත වෙයි. මිථ්‍යාදෘෂ්ටි ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශලධර්‍මයෝ වෙත් නම් ඔහු විසින් ඔහු ද විරික්ත වෙත්. සම්‍යක්දෘෂ්ටි ප්‍රත්‍යයෙන් අනේක කුශල ධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත්.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 394,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සම්මාසඞ්කප්පස්ස භික්ඛවෙ මිච්ඡාසංකප්පො විරිත්තො හොති -පෙ- සම්මාවාචස්ස භික්ඛවෙ මිච්ඡාවාචා විරිත්තා හොති -පෙ- සම්මාකම්මන්තස්ස භික්ඛවෙ මිච්ඡාකම්මන්තො විරිත්තො හොති -පෙ- සම්මාආජීවස්ස භික්ඛවෙ මිච්ඡාආජීවො විරිත්තො හොති -පෙ- සම්මාවායාමස්ස භික්ඛවෙ මිච්ඡාවායාමො විරිත්තො හොති -පෙ- සම්මාසතිස්ස භික්ඛවෙ මිච්ඡාසති විරිත්තා හොති -පෙ- සම්මාසමාධිස්ස භික්ඛවෙ මිච්ඡාසමාධි විරිත්තො හොති -පෙ- සම්මාඤාණිස්ස භික්ඛවෙ මිච්ඡාඤාණං විරිත්තං හොති -පෙ- සම්මාවිමුත්තිස්ස භික්ඛවෙ මිච්ඡාවිමුත්ති විරිත්තා හොති, යෙ ච මිච්ඡාවිමුත්තිපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති. තෙ චස්ස විරිත්තා හොන්ති. සම්මාවිමුත්ති පච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදං ඛො තං භික්ඛවෙ අරියං විරෙචනං, යං විරෙචනං සම්පජ්ජතියෙව නො විපජ්ජති. යං විරෙචනං ආගම්ම ජාතිධම්මා සත්තා ජාතියා පරිමුච්චන්ති. ජරාධම්මා සත්තා ජරාය පරිමුච්චන්ති. මරණධම්මා සත්තා මරණෙන පරිමුච්චන්ති, සොකපරිදෙවදුක්ඛදොමනස්සුපායාසධම්මා සත්තා සොකපරිදෙවදුක්ඛදොමනස්සුපායාසෙහි පරිමුච්චන්තී ති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 9.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "වමන සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "තිකිච්ඡකා භික්ඛවෙ වමනං දෙන්ති, පිත්තසමුට්ඨානානං ආබාධානං පටිඝාතාය, සෙම්හසමුට්ඨානානම්පි ආබාධානං පටිඝාතාය, වාතසමුට්ඨානානම්පි ආබාධානං පටිඝාතාය, අත්ථෙතං භික්ඛවෙ වමනං, නෙතං නත්ථි ති වදාමි. තඤ්ච ඛො එතං භික්ඛවෙ වමනං සම්පජ්ජතිපි, විපජ්ජතිපි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අහඤ්ච ඛො භික්ඛවෙ අරියං වමනං දෙසිස්සාමි, යං වමනං සම්පජ්ජතියෙව නො විපජ්ජති, යං වමනං ආගම්ම ජාතිධම්මා සත්තා ජාතියා පරිමුච්චන්ති, ජරාධම්මා සත්තා ජරාය පරිමුච්චන්ති, මරණධම්මා සත්තා මරණෙන පරිමුච්චන්ති, සොකපරිදෙවදුක්ඛදොමනස්සුපායාසධම්මා සත්තා සොකපරිදෙවදුක්ඛදොමනස්සුපායාසෙහි පරිමුච්චන්ති. තං සුණාථ -පෙ- භගවා එතදවොච:"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, සම්‍යක්සංකල්ප ඇත්තහුට මිථ්‍යාසංකල්පය විරික්ත වෙයි. ... සම්‍යග්වචන ඇතියහු විසින් මිථ්‍යාවචනය විරික්ත වෙයි. ... සම්‍යග්කර්‍මාන්තයට මිථ්‍යාකර්‍මාන්තය විරික්ත වෙයි. ... සම්‍යාගජීව ඇත්තහු විසින් මිථ්‍යාජීවය විරික්ත වෙයි. ... සම්‍යග්ව්‍යායාම ඇත්තහු විසින් මිථ්‍යාව්‍යායාමය විරික්ත වෙයි. ... සම්‍යක්ස්මෘති ඇත්තහු විසින් මිථ්‍යාස්මෘතිය විරික්ත වෙයි. ... සම්‍යක්සමාධි ඇත්තහු විසින් මිථ්‍යාසමාධිය විරික්ත වෙයි. ... සම්‍යග්ඥාන ඇතියහු විසින් මිථ්‍යාඥානය විරික්ත වෙයි. ... සම්‍යග්විමුක්ති ඇතියහු විසින් මිථ්‍යාවිමුක්ති විරික්ත වෙයි. මිථ්‍යාවිමුක්ති ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශල ධර්‍මයෝ උපදනාහු නම් ඔහු විසින් ඔහු ද විරික්ත වෙත්. සම්‍යග්විමුක්ති ප්‍රත්‍යයෙන් අනේක කුශල ධර්‍මයෝ ද භාවනාවෙන් පරිපූර්තියට යෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් විරේචනයෙක් සම්පද්‍යමාන ම වේ නම් විපද්‍යමාන නො වේ නම් යම් විරේචනයෙකට පැමිණ ජාතිධර්‍ම සත්ත්‍වයෝ ජාතියෙන් මිදෙන්නාහු නම්, ජරාධර්‍ම සත්ත්‍වයෝ ජරායෙන් මිදෙන්නාහු නම්, මරණධර්‍ම සත්ත්‍වයෝ මරණින් මිදෙන්නාහු නම්, ශෝක, පරිදේව, දුඃඛ, දෞර්‍මනස්‍යෙපායාසධර්‍ම සත්ත්‍වයෝ සෝ, වැලපීම්, දුක්, දොම්නස් දැඩි වෙහෙසින් මිදෙන්නාහු නම්, මෙ එ ආර්‍ය්‍ය විරේචනයයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "වමන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, චිකිත්සකයෝ පිතින් උපදනා ආබාධයන් නසනුවට ද සෙමින් උපදනා ආබාධයන් නසනුවට ද වාතයෙන් උපදනා ආබාධයන් නසනුවට ද වමන බෙහෙත් දෙත්. මහණෙනි, තෙල වමන ඇත. තෙල නැතැයි නොකියමි. මහණෙනි, තෙල වමන බෙහෙත් සම්පද්‍යමාන ද වෙයි, විපද්‍යමාන ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් වමනයක් සම්පද්‍යමාන ම වේ නම් විපද්‍යාමාන නොවේ නම් යම් වමන බෙහෙතකට පැමිණ ජාතිධර්‍ම සත්හු ජාතියෙන් මිදෙත් නම්, ජරාධර්‍ම සත්හු ජරායෙන් මිදෙත් නම්, මරණධර්‍ම සත්හු මරණින් මිදෙත් නම්, ශෝක, පරිදේව, දුඃඛ, දෞර්‍මනස්‍ය උපායාසධර්‍ම සත්හු සෝ, වැලපීම්, දුක්, දොම්නස් දැඩි උපායාසයෙන් මිදෙත් නම්, එබඳු ආර්‍ය්‍යවමනයක් දෙසන්නෙමි. එ අසව, -පෙ- භාග්‍යවතුන් වහන්සේ තෙල වදාළ සේක:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 396,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච තං භික්ඛවෙ අරියං වමනං: යං වමනං සම්පජ්ජතියෙව නො විපජ්ජති, යං වමනං ආගම්ම ජාතිධම්මා සත්තා ජාතියා පරිමුච්චන්ති -පෙ- සොකපරිදෙවදුක්ඛදොමනස්සුපායාසෙහි පරිමුච්චන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සම්මාදිට්ඨිකස්ස භික්ඛවෙ මිච්ඡාදිට්ඨි වන්තා හොති යෙ ච මිච්ඡාදිට්ඨිපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති තෙ චස්ස වන්තා හොන්ති. සම්මාදිට්ඨිපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සම්මාසඞ්කප්පස්ස භික්ඛවෙ මිච්ඡාසඞ්කප්පො වන්තො හොති -පෙ- සම්මා වාචස්ස භික්ඛවෙ මිච්ඡාවාචා වන්තා හොති -පෙ- සම්මාකම්මන්තස්ස භික්ඛවෙ මිච්ඡාකම්මන්තො වන්තො හොති -පෙ- සම්මා ආජීවස්ස භික්ඛවෙ මිච්ඡාආජීවො වන්තො හොති -පෙ- සම්මාවායාමස්ස භික්ඛවෙ මිච්ඡාවායාමො වන්තො හොති -පෙ- සම්මාසතිස්ස භික්ඛවෙ මිච්ඡාසති වන්තා හොති -පෙ- සම්මාසමාධිස්ස භික්ඛවෙ මිච්ඡාසමාධි වන්තො හොති -පෙ- සම්මාඤාණිස්ස භික්ඛවෙ මිච්ඡාඤාණං වන්තං හොති -පෙ- සම්මාවිමුත්තිස්ස භික්ඛවෙ මිච්ඡාවිමුත්ති වන්තා හොති යෙ ච මිච්ඡාවිමුත්තිපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, තෙ චස්ස වන්තා හොන්ති. සම්මාවිමුත්තිපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති. ඉදං ඛො තං භික්ඛවෙ අරියං වමනං, යං වමනං සම්පජ්ජතියෙව නො විපජ්ජති, යං වමනං ආගම්ම ජාතිධම්මා සත්තා ජාතියා පරිමුච්චන්ති -පෙ- සොකපරිදෙවදුක්ඛදොමනස්සුපායාසධම්මා සත්තා සොකපරිදෙවදුක්ඛදොමනස්සුපායාසෙහි පරිමුච්චන්තී ති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 10.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "නිද්ධමනිය සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දස ඉමෙ භික්ඛවෙ නිද්ධමනියා ධම්මා. කතමෙ දස:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සම්මාදිට්ඨිකස්ස භික්ඛවෙ මිච්ඡාදිට්ඨි නිද්ධන්තා හොති. යෙ ච මිච්ඡා දිට්ඨි පච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, තෙ චස්ස නිද්ධන්තා හොන්ති, සම්මාදිට්ඨි පච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, යම් ආර්‍ය්‍යවමනයෙක් සම්පද්‍යමාන ම වේ නම් විපද්‍යාමාන නොවේ නම්, යම් වමනයකට පැමිණ ජාතිධර්‍මසත්ත්‍වයෝ ජාතියෙන් මිදෙත් නම්, ... ශෝක, පරිදේව, දුඃඛ, දෞර්‍මනස්‍ය උපායාසයෙන් මිදෙත් නම්, එ ආර්‍ය්‍යවමනය කවර:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සම්‍යග්දෘෂ්ටිකයා විසින් මිථ්‍යාදෘෂ්ටිය වාන්ත වෙයි. මිථ්‍යාදෘෂ්ටි ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශලධර්‍මයෝ උපදනාහු නම් ඔහු විසින් ඔහුදු වාන්තයහ. සම්‍යග්දෘෂ්ටි ප්‍රත්‍යයෙන් අනේක කුශලධර්‍මයෝ ද භාවනායෙන් පරිපූර්තියට යෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සම්‍යක් සංකල්පඇතියහු විසින් මිථ්‍යාසංකල්පය වාන්ත වෙයි. ... සම්‍යග්වචන ඇතියහු විසින් මිථ්‍යාවාක් වාන්ත ය .... සම්‍යක්කර්‍මාන්ත ඇතියහු විසින් මිථ්‍යාකර්‍මාන්තය වාන්තය. ... මහණෙනි, සම්‍යගාජීවය ඇතියහු විසින් මිථ්‍යා ආජීවය වාන්තය. ... මහණෙනි, සම්‍යග්ව්‍යායාම ඇතියහු විසින් මිථ්‍යාව්‍යායාමය වාන්ත වෙයි. ... මහණෙනි, සම්‍යක්ස්මෘතිය ඇතියහු විසින් මිථ්‍යාස්මෘතිය වාන්ත වෙයි. ... මහණෙනි, සම්‍යක්සමාධිය ඇතියහු විසින් මිථ්‍යාසමාධිය වාන්ත වෙයි. ... මහණෙනි, සම්‍යග්ඥාන ඇතියහු විසින් මිථ්‍යාඥානය වාන්ත වෙයි. ... මහණෙනි, සම්‍යග්විමුක්තිය ඇතියහු විසින් මිථ්‍යාවිමුක්තිය වාන්ත වෙයි. මිථ්‍යාවිමුක්ති ප්‍රත්‍යයෙන් යම්බඳු අනේක ලාමක අකුශල ධර්‍මයෝ උපදනාහු නම් ඔහු විසින් ඔහුදු වාන්ත වෙත්. සම්‍යග්විමුක්ති ප්‍රත්‍යයෙන් නොයෙක් කුශල ධර්‍මයෝ ද භාවනායෙන් පරිපූර්තියට යෙත්. මහණෙනි, යම් වමන සම්පද්‍යමාන ම වේ නම්, විපද්‍යමාන නොවේ නම්, යම් වමනකට පැමිණ ජාතිධර්‍ම සත්ත්‍වයෝ ජාතියෙන් මිදෙත් නම් ... ශෝක, පරිදේව, දුඃඛ, දෞර්‍මනස්‍යෙපායාසධර්‍ම සත්ත්‍වයෝ සෝ වැලපුම් දුක් දොම්නස් දැඩි වෙහෙසින් මිදෙත් නම් මේ ඒ ආර්‍ය්‍යවමනය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නිද්ධමනිය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මේ නිර්ධමනිය ධර්‍ම දස දෙනෙකි. කවර දස දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සම්‍යග්දෘෂ්ටිකයා විසින් මිථ්‍යාදෘෂ්ටිය පහ කෙළේ වෙයි. මිථ්‍යාදෘෂ්ටි ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශලධර්‍මයෝ උපදනාහු නම් ඔහු විසින් උහුදු පහකරන ලදහ. සම්‍යග්දෘෂ්ටි ප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත්.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 398,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සම්මාසඞ්කප්පස්ස භික්ඛවෙ මිච්ඡාසඞ්කප්පො නිද්ධන්තො හොති -පෙ- සම්මාවාචස්ස භික්ඛවෙ මිච්ඡාවාචා නිද්ධන්තා හොති -පෙ- සම්මාකම්මන්තස්ස භික්ඛවෙ මිච්ඡාකම්මන්තො නිද්ධන්තො හොති -පෙ- සම්මා ආජීවස්ස භික්ඛවෙ මිච්ඡාආජීවො නිද්ධන්තො හොති -පෙ- සම්මා වායාමස්ස භික්ඛවෙ මිච්ඡාවායාමො නිද්ධන්තො හොති -පෙ- සම්මාසතිස්ස භික්ඛවෙ මිච්ඡාසති නිද්ධන්තා හොති -පෙ- සම්මාසමාධිස්ස භික්ඛවෙ මිච්ඡා සමාධි නිද්ධන්තො හොති -පෙ- සම්මාඤාණිස්ස භික්ඛවෙ මිච්ඡාඤාණං නිද්ධන්තා හොති -පෙ- සම්මා විමුත්තිස්ස භික්ඛවෙ මිච්ඡාවිමුත්ති නිද්ධන්තා හොති, යෙ ච මිච්ඡාවිමුත්තිපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, තෙ චස්ස නිද්ධන්තා හොන්ති. සම්මාවිමුත්තිපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති. ඉමෙ ඛො භික්ඛවෙ දස නිද්ධමනියා ධම්මා ති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 11.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "අසෙක සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො අඤ්ඤතරො භික්ඛු යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච."
                    },
                    {
                        "type": "paragraph",
                        "text": "අසෙඛො අසෙඛො තී භන්තෙ වුච්චති, කිත්තාවතා නු ඛො භන්තෙ භික්ඛු අසෙඛො හොතී ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛු, භික්ඛු අසෙඛාය සම්මාදිට්ඨියා සමන්නාගතො හොති, අසෙඛෙන සම්මාසඞ්කප්පෙන සමන්නාගතො හොති, අසෙඛාය සම්මාවාචාය සමන්නාගතො හොති, අසෙඛෙන සම්මා කම්මන්තෙන සමන්නාගතො හොතී, අසෙඛෙන සම්මාආජීවෙන සමන්නාගතො හොති, අසෙඛෙන සම්මාවායාමෙන සමන්නාගතො හොති, අසෙඛාය සම්මාසතියා සමන්නාගතො හොති, අසෙඛෙන සම්මාසමාධිනා සමන්නාගතො හොති, අසෙඛෙන සම්මාඤාණෙන සමන්නාගතො හොති, අසෙඛාය සම්මා විමුත්තියා සමන්නාගතො හොති. එවං ඛො භික්ඛු, භික්ඛු අසෙඛො හොතී ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, සම්‍යක්සංකල්ප ඇතියහු විසින් මිථ්‍යාසංකල්පය පහ කෙළේවෙයි ... මහණෙනි, සම්‍යග්වාත් ඇතියහු විසින් මිථ්‍යාවාක් පහ කෙළේ වෙයි ... මහණෙනි, සම්‍යක්කර්‍මාන්ත ඇතියහු විසින් මිථ්‍යාකර්‍මාන්ත පහ කෙළේ වෙයි ... මහණෙනි, සම්‍යගාජීව ඇතියහු විසින් මිථ්‍යාජීවය පහ කෙළේ වෙයි ... මහණෙනි, සම්‍යග්ව්‍යායාම ඇතියහු විසින් මිථ්‍යාව්‍යායාමය පහ කෙළේ වෙයි ... මහණෙනි, සම්‍යක්ස්මෘති ඇතියහු විසින් මිථ්‍යාස්මෘති පහ කෙළේ වෙයි ... මහණෙනි, සම්‍යක්සමාධිය ඇතියහු විසින් මිථ්‍යාසමාධිය පහ කෙළේ වෙයි ... මහණෙනි, සම්‍යග්ඥානය ඇතියහු විසින් මිථ්‍යාඥානය පහ කෙළේ වෙයි ... මහණෙනි, සම්‍යග්විමුක්ති ඇතියහු විසින් මිථ්‍යාවිමුක්තිය පහ කෙළේ වෙයි ... මිථ්‍යාවිමුක්ති ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශලධර්‍මයෝ උපදනාහු නම්, උහුදු ඔහු විසින් පහකරන ලදහු වෙත්. සම්‍යග්විමුක්ති ප්‍රත්‍යයෙන් කුශලධර්‍මයෝ ද භාවනායෙන් පරිපූර්තියට යෙත්. මහණෙනි, මොහු දසදෙන නිද්ධමනිය ධර්‍ම වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 11.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අසේඛ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "එකල්හි අන්‍යතර මහණෙක් භාග්‍යවතුන් වහන්සේ කරා එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සකසා වැඳ එකත්පසෙක හින. එකත්පසෙක හුන් එ මහණ භාග්‍යවතුන් වහන්සේට තෙල කරුණ කීය:",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, අසේඛයා, අසේඛයා යි කියනු ලැබේ. වහන්ස, මහණ කෙතෙක් කරුණින් අසේඛ වේ දැ යි?",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, මෙ සස්නෙහි මහණ අශෛක්‍ෂ සම්‍යග්දෘෂ්ටියෙන් සමන්‍වාගත වෙයි. අශෛක්‍ෂ්‍ය සම්‍යක්සංකල්පයෙන් සමන්‍වාගත වෙයි. අශෛක්‍ෂ්‍ය සම්‍යග්වචනයෙන් සමන්‍වාගත වෙයි. අශෛක්‍ෂ්‍ය සම්‍යක්කර්‍මාන්තයෙන් සමන්‍වාගත වෙයි. අශෛක්‍ෂ්‍ය සම්‍යගාජීවයෙන් සමන්‍වාගත වෙයි. අශෛක්‍ෂ්‍ය සම්‍යක්ව්‍යායාමයෙන් සමන්‍වාගත වෙයි. අශෛක්‍ෂ්‍ය සම්‍යක්ස්මෘතියෙන් සමන්‍වාගත වෙයි. අශෛක්‍ෂ්‍ය සම්‍යග්ඥානයෙන් සමන්‍වාගත වෙයි. අශෛක්‍ෂ්‍ය සම්‍යග්විමුක්තියෙන් සමන්‍වාගත වෙයි. මහණෙනි, මහණ මෙසේ අසේඛ වේ යයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 400,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 12.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "අසෙඛියධම්ම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දස ඉමෙ භික්ඛවෙ අසෙඛියා ධම්මා. කතමෙ දස:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අසෙඛා සම්මාදිට්ඨි, අසෙඛො සම්මාසඞ්කප්පො, අසෙඛා සම්මාවාචා, අසෙඛො සම්මාකම්මන්තො, අසෙඛො සම්මාආජීවො, අසෙඛො සම්මාවායාමො, අසෙඛො සම්මාසති, අසෙඛො සම්මාසමාධි, අසෙඛා සම්මා ඤාණං, අසෙඛා සම්මාවිමුත්ති. ඉමෙ ඛො භික්ඛවෙ දස අසෙඛියා ධම්මාති."
                    },
                    {
                        "type": "centered",
                        "text": "සමණසඤ්ඤාවග්ගො පඨමො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තස්සුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "සඤ්ඤා බොජ්ඣඞ්ගා මිච්ඡත්තං\nබීජං විජ්ජාය නිජ්ජරා\nධොවනඤ්ච තිකිච්ඡා ච\nනිද්ධමනං ද්වෙ අසෙඛාති.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 1. 12.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අසේඛියධම්ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මෙ අසෙඛියධර්‍ම දස දෙනෙකි. කවර දස දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "අසේඛ සම්මාදිට්ඨි ය, අසේඛ සම්මාසඞ්කප්ප ය, අසේඛ සම්මාවාචා ය, අසේඛ සම්මාකම්මන්ත ය, අසේඛ සම්මාආජීව ය, අසේඛ සම්මාවායාම ය, අසේඛ සම්මාසතිය ය, අසේඛ සම්මාසමාධිය ය, අසේඛ සම්මාඤාණය ය, අසේඛ සම්මාවිමුක්ති යයි. මහණෙනි, මොහු දස අසේඛිය ධර්‍මයෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පළමුවැනි සමණසඤ්ඤා වර්‍ග යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි උද්දානය:**",
                        "type": "unindented"
                    },
                    {
                        "text": "සඤ්ඤා ය, බොජ්ඣඞ්ග ය, මිච්ඡත්ත ය, බීජය, විජ්ජා ය, නිජ්ජරා ය, ධෝවන ය, තිකිච්ඡා දෙකය, නිද්ධමන ය, අසේඛ සූත්‍ර දෙකදැයි දොළොසෙකි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 402,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "2. පච්චොරොහණීවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 1.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "පඨම අධම්ම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "අධම්මො ච භික්ඛවෙ වෙදිතබ්බො අනත්ථො ච, ධම්මො ච වෙදිතබ්බො අත්ථො ච, අධම්මඤ්ච විදිත්වා අනත්ථඤ්ච ධම්මඤ්ච විදිත්වා අත්ථඤ්ච යථා ධම්මො යථා අත්ථො තථා පටිපජ්ජිතබ්බං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ අධම්මො ච අනත්ථො ච: මිච්ඡාදිට්ඨි මිච්ඡා සඞ්කප්පො මිච්ඡාවාචා මිච්ඡාකම්මන්තො මිච්ඡාආජීවො මිච්ඡාවායාමො මිච්ඡාසති මිච්ඡාසමාධි මිච්ඡාඤාණං මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ අධම්මො ච අනත්ථො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ ධම්මො ච අත්ථො ච: සම්මාදිට්ඨි සම්මාසඞ්කප්පො සම්මාවාචා සම්මාකම්මන්තො සම්මාආජීවො සම්මාවායාමො සම්මාසති සම්මාසමාධි සම්මාඤාණං සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ ධම්මො ච අත්ථො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "අධම්මො ච භික්ඛවෙ වෙදිතබ්බො අනත්ථො ච, ධම්මො ච වෙදිතබ්බො අත්ථො ච, අධම්මඤ්ච විදිත්වා අනත්ථඤ්ච, ධම්මඤ්ච විදිත්වා අත්ථඤ්ච යථා ධම්මො යථා අත්ථො තථා පටිපජ්ජිතබ්බන්ති ඉති යං තං වුත්තං, ඉදමෙතං පටිච්ච වුත්තන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 2.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "දුතිය අධම්ම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "අධම්මො ච භික්ඛවෙ වෙදිතබ්බො ධම්මො ච, අනත්ථො ච වෙදිතබ්බො අත්ථො ච. අධම්මඤ්ච විදිත්වා ධම්මඤ්ච, අනත්ථඤ්ච විදිත්වා අත්ථඤ්ච යථා ධම්මො යථා අත්ථො තථා පටිපජ්ජිතබ්බං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ අධම්මො, කතමො ච ධම්මො, කතමො ච අනත්ථො කතමො ච අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "1. මිච්ඡාදිට්ඨි භික්ඛවෙ අධම්මො, සම්මාදිට්ඨි ධම්මො. යෙ ච මිච්ඡාදිට්ඨිපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති අයං අනත්ථො. සම්මාදිට්ඨිපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනාපාරිපූරිං ගච්ඡන්ති අයං අත්ථො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "2. පච්චෝරෝහණි වර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පඨම අධම්ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, අධර්‍ම හා අනර්‍ත්‍ථ හා දතයුතු, ධර්‍ම හා අර්‍ත්‍ථ හා දතයුතු, අධර්‍ම හා අනර්‍ත්‍ථ හා දැන ධර්‍ම හා අර්‍ත්‍ථ දැන ධර්‍ම යම් පරිදි වේ නම් අර්‍ත්‍ථ යම් පරිදි වේ නම් ඒ පරිදි පිළිපැදිය යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අධර්‍මය හා අනර්‍ත්‍ථය හා කවර: මිච්ඡාදිට්ඨි ය, මිච්ඡාසඞ්කප්ප ය, මිච්ඡාවාචා ය, මිච්ඡාකම්මන්ත ය, මිච්ඡාආජීව ය, මිච්ඡාවායාම ය, මිච්ඡාසති ය, මිච්ඡාසමාධි ය, මිච්ඡාඤාණ ය, මිච්ඡාවිමුත්ති ය යි. මහණෙනි, මේ අධර්‍මය හා අනර්‍ත්‍ථය හා යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ධර්‍ම හා අර්‍ත්‍ථ හා කවරේ ය යත්: සම්මාදිට්ඨි ය, සම්මාසඞ්කප්ප ය, සම්මාවාචා ය, සම්මාකම්මන්ත ය, සම්මාආජීව ය, සම්මාවායාම ය, සම්මාසති ය, සම්මාසමාධි ය, සම්මාඤාණ ය, සම්මාවිමුත්ති ය යි. මහණෙනි, ධර්‍ම හා අර්‍ත්‍ථ යයි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අධර්‍මය හා අනර්‍ත්‍ථය හා දත යුතු ය, ධර්‍මය හා අර්‍ත්‍ථය හා දත යුතුය, අධර්‍ම හා අනර්‍ත්‍ථ හා දැන ධර්‍ම හා අර්‍ත්‍ථ හා දැන ධර්‍මය යම් පරිදි වේ නම් අර්‍ත්‍ථය යම් පරිදි වෙ නම් එපරිදි පිළිපැදිය යුතු යයි මෙසේ යමක් කියනලද නම්, තෙල මෙ පිණිස කියන ලදැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතිය අධම්ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, අධර්‍ම හා ධර්‍ම හා දතයුතු: අනර්‍ත්‍ථ හා අර්‍ත්‍ථ හා දතයුතු, අධර්‍ම හා ධර්‍ම හා දැන අනර්‍ත්‍ථ හා අර්‍ත්‍ථ හා දැන ධර්‍මය යම් පරිදි වේ නම්, අර්‍ත්‍ථය යම් පරිදි වේ නම් එසේ නම් පිළිපැදිය යුතුයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අධර්‍මය කවරේය, ධර්‍මය කවරේය, අනර්‍ත්‍ථය කවරේය, අර්‍ත්‍ථය කවරේය යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "1. මහණෙනි, මිච්ඡාදිට්ඨිය අධර්‍මයි, සම්මාදිට්ඨිය ධර්‍ම යි. මිථ්‍යාදෘෂ්ටි ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශලධර්‍මයෝ උපදනාහු නම්, මේ අනර්‍ත්‍ථ වෙයි. සම්‍යග්දෘෂ්ටිප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත් නම් මේ අර්‍ත්‍ථ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 404,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "2. මිච්ඡාසඞ්කප්පො භික්ඛවෙ අධම්මො, සම්මාසඞ්කප්පො ධම්මො. යෙ ච මිච්ඡාසඞ්කප්පපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, අයං අනත්ථො. සම්මාසඞ්කප්පපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති, අයං අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. මිච්ඡාවාචා භික්ඛවෙ අධම්මො, සම්මාවාචා ධම්මො, යෙ ච මිච්ඡාවාචා පච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, අයං අනත්ථො. සම්මාවාචාපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති, අයං අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "4. මිච්ඡාකම්මන්තො භික්ඛවෙ අධම්මො, සම්මාකම්මන්තො ධම්මො. යෙ ච මිච්ඡාකම්මන්තපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, අයං අනත්ථො. සම්මාකම්මන්තපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති, අයං අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "5. මිච්ඡාආජීවො භික්ඛවෙ අධම්මො, සම්මාආජීවො ධම්මො. යෙ ච මිච්ඡාආජීවපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, අයං අනත්ථො. සම්මාආජීවපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති, අයං අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "6. මිච්ඡාවායාමො භික්ඛවෙ අධම්මො, සම්මාවායාමො ධම්මො. යෙ ච මිච්ඡාවායාමපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති. අයං අනත්ථො. සම්මාවායාමපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති, අයං අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "7. මිච්ඡාසති භික්ඛවෙ අධම්මො, සම්මාසති ධම්මො. යෙ ච මිච්ඡාසතිපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, අයං අනත්ථො, සම්මාසතිපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති, අයං අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "8. මිච්ඡාසමාධි භික්ඛවෙ අධම්මො, සම්මාසමාධි ධම්මො. යෙ ච මිච්ඡාසමාධිපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, අයං අනත්ථො. සම්මාසමාධිපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති. අයං අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "9. මිච්ඡාඤාණං භික්ඛවෙ අධම්මො, සම්මාඤාණං ධම්මො. යෙ ච මිච්ඡා ඤාණපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, අයං අනත්ථො. සම්මාඤාණපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති. අයං අත්ථො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "2. මහණෙනි, මිථ්‍යාසංකල්පය අධර්‍මයි, සම්‍යක්සංකල්පය ධර්‍ම යි. මිථ්‍යාසංකල්ප ප්‍රත්‍යයෙන් යම් ම නොයෙක් ලාමක අකුශලධර්‍මයෝ උපදනාහු නම්, මේ අනර්‍ත්‍ථ යි. සම්‍යග්සංකල්ප ප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත් නම් මේ අර්‍ත්‍ථ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. මහණෙනි, මිථ්‍යාවාක් අධර්‍මයි, සම්‍යග්වාක් ධර්‍ම යි. මිථ්‍යාවාක් ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශලධර්‍මයෝ උපදනාහු නම්, මේ අනර්‍ත්‍ථ යි. සම්‍යග්වාක් ප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත් නම් මේ අර්‍ත්‍ථ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. මහණෙනි, මිථ්‍යාකර්‍මාන්තය අධර්‍මයි, සම්‍යක්කර්‍මාන්තය ධර්‍ම යි. මිථ්‍යාකර්‍මාන්ත ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශලධර්‍මයෝ උපදනාහු නම්, මේ අනර්‍ත්‍ථ යි. සම්‍යග්කර්‍මාන්ත ප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත් නම් මේ අර්‍ත්‍ථ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "5. මහණෙනි, මිථ්‍යාආජීවය අධර්‍මයි, සම්‍යගාජීවය ධර්‍ම යි. මිථ්‍යාජීව ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශලධර්‍මයෝ උපදනාහු නම්, මේ අනර්‍ත්‍ථ යි. සම්‍යගාජීව ප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත් නම් මේ අර්‍ත්‍ථ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "6. මහණෙනි, මිථ්‍යාව්‍යායාමය අධර්‍මයි, සම්‍යග්ව්‍යායාමය ධර්‍ම යි. මිථ්‍යාව්‍යායාම ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශලධර්‍මයෝ උපදනාහු නම්, මේ අනර්‍ත්‍ථ යි. සම්‍යග්ව්‍යායාම ප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත් නම් මේ අර්‍ත්‍ථ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "7. මහණෙනි, මිථ්‍යාස්මෘතිය අධර්‍මයි, සම්‍යක්ස්මෘතිය ධර්‍ම යි. මිථ්‍යාස්මෘති ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශලධර්‍මයෝ උපදනාහු නම්, මේ අනර්‍ත්‍ථ යි. සම්‍යග්ස්මෘති ප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත් නම් මේ අර්‍ත්‍ථ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "8. මහණෙනි, මිථ්‍යාසමාධිය අධර්‍මයි, සම්‍යක්සමාධිය ධර්‍ම යි. මිථ්‍යාසමාධිය ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශලධර්‍මයෝ උපදනාහු නම්, මේ අනර්‍ත්‍ථ යි. සම්‍යග්සමාධි ප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත් නම් මේ අර්‍ත්‍ථ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "9. මහණෙනි, මිථ්‍යාඥානය අධර්‍මයි, සම්‍යග්ඥානය ධර්‍ම යි. මිථ්‍යාඥාන ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශලධර්‍මයෝ උපදනාහු නම්, මේ අනර්‍ත්‍ථ යි. සම්‍යග්ඥාන ප්‍රත්‍යයෙන් නොයෙක් කුශලදහම්හු භාවනායෙන් පිරිපුන්බවට යෙත් නම් මේ අර්‍ත්‍ථ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 406,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "10. මිච්ඡාවිමුත්ති භික්ඛවෙ අධම්මො, සම්මාවිමුත්ති ධම්මො. යෙ ච මිච්ඡා විමුත්තිපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, අයං අනත්ථො. සම්මාවිමුත්තිපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති. අයං අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "අධම්මො ච භික්ඛවෙ වෙදිතබ්බො ධම්මො ච, අනත්ථො ච වෙදිතබ්බො අත්ථො ච, අධම්මඤ්ච විදිත්වා ධම්මඤ්ච, අනත්ථඤ්ච විදිත්වා අත්ථඤ්ච, යථා ධම්මො යථා අත්ථො තථා පටිපජ්ජිතබ්බන්ති. ඉති යං තං වුත්තං ඉදමෙතං පටිච්ච වුත්තන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 3.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "තතිය අධම්ම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "අධම්මො ච භික්ඛවෙ වෙදිතබ්බො, ධම්මො ච. අනත්ථො ච වෙදිතබ්බො අත්ථො ච, අධම්මඤ්ච විදිත්වා ධම්මඤ්ච, අනත්ථඤ්ච විදිත්වා අත්ථඤ්ච, යථා ධම්මො යථා අත්ථො තථා පටිපජ්ජිතබ්බන්ති. ඉදමවොච භගවා ඉදං වත්වා සුගතො උට්ඨායාසනා විහාරං පාවිසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො තෙසං භික්ඛූනං අචිරපක්කන්තස්ස භගවතො එතදහොසි: “ඉදං ඛො නො ආවුසො භගවා සඞ්ඛිත්තෙන උද්දෙසං උද්දිසිත්වා විත්ථාරෙන අත්ථං අවිභජිත්වා උට්ඨායාසනා විහාරං පවිට්ඨො “අධම්මො ච භික්ඛවෙ වෙදිතබ්බො ධම්මො ච, අනත්ථො ච වෙදිතබ්බො අත්ථො ච, අධම්මඤ්ච විදිත්වා ධම්මඤ්ච, අනත්ථඤ්ච විදිත්වා අත්ථඤ්ච, යථා ධම්මො යථා අත්ථො තථා පටිපජ්ජිතබ්බ”න්ති. කො නු ඛො ඉමස්ස භගවතා සඞ්ඛිත්තෙන උද්දෙසස්ස උද්දිට්ඨස්ස විත්ථාරෙන අත්ථං අවිභත්තස්ස විත්ථාරෙන අත්ථං විභජෙය්යාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො තෙසං භික්ඛූනං එතදහොසි: ‘අයං ඛො ආයස්මා ආනන්දො සත්ථු චෙව සංවණ්ණිතො, සම්භාවිතො ච විඤ්ඤූනං සබ්රහ්මචාරීනං, පහොති චායස්මා ආනන්දො ඉමස්ස භගවතා සඞ්ඛිත්තෙන උද්දෙසස්ස උද්දිට්ඨස්ස විත්ථාරෙන අත්ථං අවිභත්තස්ස විත්ථාරෙන අත්ථං විභජිතුං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "10. මහණෙනි, මිථ්‍යාවිමුක්තිය අධර්‍මයි, සම්‍යග්විමුක්තිය ධර්‍ම යි. මිථ්‍යාවිමුක්ති ප්‍රත්‍යයෙන් යම්බඳු ලාමක අකුශලධර්‍මයෝ උපදනාහු නම්, මේ අනර්‍ත්‍ථ යි. සම්‍යග්විමුක්ති ප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත් නම් මේ අර්‍ත්‍ථ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අධර්‍මය ද ධර්‍මය ද දතයුත්තේ ය, අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දතයුත්තේ ය, අධර්‍මය ද දැන, ධර්‍මය ද දැන, අනර්‍ත්‍ථය දැන අර්‍ත්‍ථය ද දැන, දහම් යම් පරිදි නම් එසේ පිළිපැදිය යුතු යයි මෙසේ යමක් කියන ලද නම් තෙල කරුණ මෙ නිසා කියන ලදැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තතිය අධම්ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, අධර්‍මය ද ධර්‍මය ද දතයුතු, අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දතයුතු, අධර්‍මය ද ධර්‍මය ද දැන, අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දැන ධර්‍මය යම් පරිදි නම්, අර්‍ත්‍ථය යම් පරිදි නම්, එපරිද්දෙන් පිළිපැදිය යුතු යයි භාග්‍යවතුන් වහන්සේ මෙය වදාළහ. සුගතයන් වහන්සේ මෙය වදාරා හුනස්නෙන් නැඟි විහාරයට වැඩි සේක.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එකල්හි භාග්‍යවතුන් වහන්සේ බැහැර වැඩි නො බෝ කල් වත් ම එ මහණුන්ට තෙල සිත විය: ඇවැත්නි, අපහට භාග්‍යවතුන් වහන්සේ “මහණෙනි, අධර්‍මය ද ධර්‍මය ද දතයුතු, අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දතයුතු, අධර්‍මය ද ධර්‍මය ද දැන, අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දැන, ධර්‍මය යම් පරිදි නම්, අර්‍ත්‍ථය යම් පරිදි වේ නම්, එසෙයින් පිළිපැදිය යුතු යි” යන මෙ උද්දේශය සැකෙවින් උදෙසා විස්තර විසින් අරුත් නො බෙදා හුනස්නෙන් නැඟි විහාරයට වැඩියහ. කවරෙක් භාග්‍යවතුන් වහන්සේ විසින් සැකෙවින් උදෙසන ලද විස්තර විසින් අරුත් නො බෙදන ලද මේ උද්දේශයාගේ අර්‍ත්‍ථය විභාග කරන්නේ දැ”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එකල්හි එ මහණුන්හට තෙල සිත විය: “මේ ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ ශාස්තෘන් වහන්සේ විසිනුදු සංවර්ණිතයහ. විඥ සබ්‍රම්සරුන් විසිනුදු සම්භාවිතයහ. භාග්‍යවතුන් වහන්සේ විසින් සැකෙවින් උදෙසන ලද විතර විසින් අරුත් නො බෙදූ මේ උද්දේශයාගේ අර්‍ත්‍ථය විතර විසින් බෙදා දක්වන්නට ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ පොහොසත් ද වන්නාහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 408,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යන්නූන මයං යෙනායස්මා ආනන්දො තෙනුපසඞ්කමෙය්යාම. උපසඞ්කමිත්වා ආයස්මන්තං ආනන්දං එතමත්ථං පුච්ඡෙය්යාම, යථා නො ආයස්මා ආනන්දො ව්යාකරිස්සති, තථා නං ධාරෙස්සාමා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො තෙ භික්ඛු යෙනායස්මා ආනන්දො තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා ආයස්මතා ආනන්දෙන සද්ධිං සම්මොදිංසු, සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නා ඛො තෙ භික්ඛු ආයස්මන්තං ආනන්දං එතදවොචුං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "“ඉදං ඛො නො ආවුසො ආනන්ද භගවා සඞ්ඛිත්තෙන උද්දෙසං උද්දිසිත්වා විත්ථාරෙන අත්ථං අවිභජිත්වා උට්ඨායාසනා විහාරං පවිට්ඨො, ‘අධම්මො ච භික්ඛවෙ වෙදිතබ්බො ධම්මො ච, අනත්ථො ච වෙදිතබ්බො අත්ථො ච, අධම්මඤ්ච විදිත්වා ධම්මඤ්ච, අනත්ථඤ්ච විදිත්වා අත්ථඤ්ච, යථා ධම්මො යථා අත්ථො, තථා පටිපජ්ජිතබ්බන්ති’. තෙසං නො ආවුසො අම්හාකං අචිරපක්කන්තස්ස භගවතො එතදහොසි: ‘ඉදං ඛො නො ආවුසො භගවා සඞ්ඛිත්තෙන උද්දෙසං උද්දිසිත්වා විත්ථාරෙන අත්ථං අවිභජිත්වා උට්ඨායාසනා විහාරං පවිට්ඨො, අධම්මො ච භික්ඛවෙ වෙදිතබ්බො ධම්මො ච, අනත්ථො ච වෙදිතබ්බො අත්ථො ච. අධම්මඤ්ච විදිත්වා ධම්මඤ්ච, අනත්ථඤ්ච විදිත්වා අත්ථඤ්ච, යථා ධම්මො යථා අත්ථො තථා පටිපජ්ජිතබ්බන්ති. කො නු ඛො ඉමස්ස භගවතා සඞ්ඛිත්තෙන උද්දෙසස්ස උද්දිට්ඨස්ස විත්ථාරෙන අත්ථං අවිභත්තස්ස විත්ථාරෙන අත්ථං විභජෙය්යාති. තෙසං නො ආවුසො අම්හාකං එතදහොසි: “අයං ඛො ආයස්මා ආනන්දො සත්ථු චෙව සංවණ්ණිතො සම්භාවිතො ච විඤ්ඤූනං සබ්රහ්මචාරීනං, පහොති චායස්මා ආනන්දො ඉමස්ස භගවතා සඞ්ඛිත්තෙන උද්දෙසස්ස උද්දිට්ඨස්ස විත්ථාරෙන අත්ථං අවිභත්තස්ස විත්ථාරෙන අත්ථං විභජිතුං. යන්නූන මයං යෙනායස්මා ආනන්දො තෙනුපසඞ්කමෙය්යාම, උපසඞ්කමිත්වා ආයස්මන්තං ආනන්දං එතමත්ථං පුච්ඡෙය්යාම, යථා නො ආයස්මා ආනන්දො ව්යාකරිස්සති තථා නං ධාරෙය්යාමා”ති. විභජිතු ආයස්මා ආනන්දොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "“ඉදින් අපි ආයුෂ්මත් ආනන්‍ද තෙරුන් කරා එළඹමෝ නම්, එළඹ ආයුෂ්මත් ආනන්‍ද තෙරුන් තෙල අරුත් පුළුවුස්නමෝ නම්, ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ යම් පරිද්දෙකින් අපට ව්‍යාකරණ කරත් ද එ පරිද්දෙන් එය දරන්නමෝ නම් යෙහෙකැ”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉක්බිති එ භික්‍ෂූහු ආයුෂ්මත් ආනන්‍ද තෙරුන් කරා එළඹියහ. එළඹ ආයුෂ්මත් ආනන්‍ද තෙරුන් සමග සතුටු වූහ. සතුටු විය යුතු කථාව කොට නිමවා එකත්පසෙක හුන්හ. එකත්පසෙක හුන් ඒ මහණහු ආයුෂ්මත් ආනන්‍ද තෙරුන්ට තෙල කීහ:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත් ආනන්‍දයෙනි, භාග්‍යවතුන් වහන්සේ අපට ‘මහණෙනි, අධර්‍මය ද ධර්‍මය ද දතයුතු, අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දතයුතු, අධර්‍මය ද ධර්‍මය ද දැන, අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දැන, ධර්‍මය යම් පරිදි වේ නම් අර්‍ත්‍ථය යම් පරිදි වේ නම් එසේ පිළිපැදිය යුතු’යි යන මේ උද්දේශය සැකෙවින් උදෙසා විතර විසින් අර්‍ත්‍ථය නො බෙදා හුනස්නෙන් නැඟ විහාරයට වන්හ. ඇවැත්නි, එ අපට භාග්‍යවතුන් වහන්සේ බැහැර වැඩි නොබෝ කල්වත් ම තෙල සිත විය: ‘ඇවැත්නි, අපට භාග්‍යවතුන් වහන්සේ ‘මහණෙනි, අධර්‍මය ද ධර්‍මය ද දතයුතු ය, අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දතයුතු ය, අධර්‍මය ද ධර්‍මය ද දැන, අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දැන, ධර්‍මය යම් පරිදි වේ නම්, අර්‍ත්‍ථය යම් පරිදි වේ නම්, එ පරිදි පිළිපැදිය යුතු ය’ යන මේ උද්දේශය සැකෙවින් උදෙසා විස්තර විසින් අරුත් නො බෙදා හුනස්නෙන් නැඟ විහාරයට වන්හ. භාග්‍යවතුන් වහන්සේ විසින් සැකෙවින් උදෙසන ලද විතර විසින් අරුත් නො බෙදන ලද මේ උද්දේශයාගේ අර්‍ත්‍ථය කවරෙක් විතර විසින් අර්‍ත්‍ථය බෙදා දක්වන්නේ දැ’යි. ඇවැත්නි, එ අපට තෙල සිත විය: “මෙ ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ වනාහි ශාස්තෘන් වහන්සේ විසින් ද සංවර්ණිතයහ. විඥ සබ්‍රම්සරුන් විසිනුදු සම්භාවිතයහ. ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ විසින් සැකෙවින් උදෙසන ලද විතර විසින් අරුත් නො බෙදූ මේ උද්දේශයාගේ අර්‍ත්‍ථය විස්තර විසින් අරුත් බෙදනට පොහොසත් ද වෙත්. අපි ආයුෂ්මත් ආනන්‍ද තෙරුන් කරා එළඹමෝ නම්, එළඹ ආයුෂ්මත් ආනන්‍ද තෙරුන් තෙල කරුණ පුළුවුස්නමෝ නම්, ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ යම් පරිදි ව්‍යාකරණ කරන්නහු ද එ පරිදි දරන්නමෝ නම් යෙහෙකැ’යි. ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ බෙදා දක්වත්වා යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 410,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි ආවුසො පුරිසො සාරත්ථිකො සාරගවෙසී සාරපරියෙසනං චරමානො මහතො රුක්ඛස්ස තිට්ඨතො සාරවතො අතික්කම්මෙව මූලං අතික්කම්මඛන්ධං සාඛා පලාසෙ සාරං පරියෙසිතබ්බං මඤ්ඤෙය්ය, එවං සම්පදමිදං ආයස්මන්තානං සත්ථරි සම්මුඛීභූතෙ තං භගවන්තං අතියිත්වා{1} අම්හෙ එතමත්ථං පටිපුච්ඡිතබ්බං මඤ්ඤථ. සොහාවුසො භගවා ජානං ජානාති, පස්සං පස්සති, චක්ඛුභූතො ඤාණභූතො ධම්මභූතො බ්රහ්මභූතො වත්තා පවත්තා අත්ථස්ස නින්නෙතා අමතස්ස දාතා ධම්මස්සාමී තථාගතො. සො චෙව පනෙතස්ස කාලො අහොසි, යං තුම්හෙ භගවන්තං යෙව උපසඞ්කමිත්වා එතමත්ථං පුච්ඡෙය්යාථ, යථා වො භගවා ව්යාකරෙය්ය තථා නං ධාරෙය්යාථා ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අද්ධාවුසො ආනන්ද භගවා ජානං ජානාති, පස්සං පස්සති. චක්ඛුභූතො ඤාණභූතො ධම්මභූතො බ්රහ්මභූතො වත්තා පවත්තා අත්ථස්ස නින්නෙතා අමතස්ස දාතා ධම්මස්සාමි තථාගතො. සො චෙව පනෙතස්ස කාලො අහොසි යං මයං භගවන්තං යෙව උපසඞ්කමිත්වා එතමත්ථං පුච්ඡෙය්යාම, යථා නො භගවා ව්යාකරෙය්ය තථා නං ධාරෙය්යාම. අපි ච ආයස්මා ආනන්දො සත්ථු චෙව සංවණ්ණිතො, සම්භාවිතො ච විඤ්ඤූනං සබිරහ්මචාරීනං, පහොති චායස්මා ආනන්දො ඉමස්ස භගවතා සඞ්ඛිත්තෙන උද්දෙසස්ස උද්දිට්ඨස්ස විත්ථාරෙන අත්ථං අවිභත්තස්ස විත්ථාරෙන අත්ථං විභජිතුං. විභජතායස්මා ආනන්දො අගරු කරිත්වාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන හාවුසො සුණාථ සාධුකං මනසිකරොථ භාසිස්සාමී ති. එව මාවුසොති ඛො තෙ භික්ඛු ආයස්මතො ආනන්දස්ස පච්චස්සොසුං. ආයස්මා ආනන්දො එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "යං ඛො නො ආවුසො භගවා සඞ්ඛිත්තෙන උද්දෙසං උද්දිසිත්වා විත්ථාරෙන අත්ථං අවිභජිත්වා උට්ඨායාසනා විහාරං පවිට්ඨො “අධම්මො ච භික්ඛවෙ වෙදිතබ්බො ධම්මො ච, අනත්ථො ච වෙදිතබ්බො අත්ථො ච, අධම්මඤ්ච විදිත්වා ධම්මඤ්ච, අනත්ථඤ්ච විදිත්වා අත්ථඤ්ච, යථා ධම්මො යථා අත්ථො තථා පටිපජ්ජිතබ්බ”න්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අතිසීත්වා – මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "ඇවැත්නි, හර කැමැති පුරුෂයෙක් හර සොයනුයේ සාරපර්‍ය්‍යෙෂණ කරනුයේ සිටුනා හර ඇති මහරුක්හුගේ මුල ඉක්ම කඳ ඉක්ම අතු කොළෙහි හර සෙවිය යුතු කොට හඟනේ යම් සේ නම්, මෙ එබඳු උපමා සම්පත් ඇත්තෙකි. ආයුෂ්මත්හට ශාස්තෘන් සම්මුඛ වත් ම එ භාග්‍යවත්හු ඉක්ම තෙල කරුණ අප පිළිවිසිය යුතු කොට හඟනාහු ය. ඇවැත්නි, දන්නා වූ එ භාග්‍යවතුන් වහන්සේ දනිත්ම ය, දක්නාහු දක්නාහුම ය. තථාගතයන් වහන්සේ චක්‍ෂූර්භූතයහ, ඥානස්වභාව ඇතියහ, ධර්‍මස්වභාව ඇතියහ, ශ්‍රේෂ්ඨ ස්වභාව ඇතියහ, වක්තෘහ, ප්‍රවර්‍තනයෙහි සමර්‍ත්‍ථයහ, අර්‍ත්‍ථයාගේ නිර්නේතෘහ, අමෘතයාගේ දාතෘහ, ධර්‍මස්වාමීහ. තෙල කරුණ සඳහා එම කල් විය. එහෙයින් තෙපි එ භාග්‍යවතුන් වහන්සේ කරා ම එළඹ තෙල කරුණ පුළුවුස්ව. භාග්‍යවතුන් වහන්සේ යම් පරිද්දෙකින් තොපට ව්‍යාකරණ කෙරෙත්නම්, එ පරිද්දෙන් එය දරව යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත් ආනන්‍දයෙනි, එකැතින් දන්නාහු ම භාග්‍යවත්හු දනිති, දක්නාහු දකිත්, චක්‍ෂූර්භූතයහ, ඥානභූතයහ, ධර්‍මභූතයහ, බ්‍රහ්මභූතයහ, වක්තෘහ, ප්‍රවර්තෘහ, අර්‍ත්‍ථයාගේ නිර්නේතෘහ, අමෘතයාගේ දෘතෘහ, තථාගතයෝ ධර්‍මස්වාමීහ. යම් හෙයකින් අපි භාග්‍යවතුන් වහන්සේ කරා ම එළැඹ පුළුවුස්නමෝ නම්, යම් පරිද්දෙකින් අපට භාග්‍යවතුන් වහන්සේ ව්‍යාකරණ කරන සේක් නම් එසෙයින් දරනමෝ නම්, තෙල කරුණ සඳහා එ ම කල් විය. වැලිත් ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ ශාස්තෘන් වහන්සේ විසිනුදු සංවර්ණිතයහ, විඥ සබ්‍රම්සරුන් විසිනුදු සම්භාවිතයහ. ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ ද භාග්‍යවතුන් වහන්සේ විසින් සැකෙවින් උදෙසන ලද විතර විසින් අරුත් නො බෙදන ලද මේ උද්දේශයාගේ අර්‍ත්‍ථය විතර විසින් විභජනයට සමත්හ. ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ නො බර කොට විභජනය කරත්ව යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත්නි, එ කරුණින් අසව, මොනොවට මෙනෙහි කරව. දෙසන්නෙමැ යි. ‘ඇවැත්නි, එසේ’යයි එ මහණහු ආයුෂ්මත් ආනන්‍ද තෙරුන්ට පිළිවදන් ඇස්වූහ. ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ තෙල කරුණ වදාළහ:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත්නි, අපට භාග්‍යවතුන් වහන්සේ “මහණෙනි, අධර්‍මය ද ධර්‍මය ද දතයුතු ය, අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දතයුතු ය, අධර්‍මය ද ධර්‍මය ද දැන අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දැන ධර්‍මය යම් පරිදි වේ නම් එ පරිදි පිළිපැදිය යුතුය”යි යම් ම උද්දේශයක් උදෙසා විස්තර විසින් අර්‍ත්‍ථවිභජනය නො කොට හුනස්නෙන් නැග විහාරයට වන්හු නම්:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 412,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමො චාවුසො අධම්මො, කතමො ච ධම්මො, කතමො ච අනත්ථො, කතමො ච අත්ථො:"
                    },
                    {
                        "type": "paragraph",
                        "text": "“මිච්ඡාදිට්ඨි ආවුසො අධම්මො සම්මාදිට්ඨි ධම්මො. යෙ ච මිච්ඡාදිට්ඨිපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, අයං අනත්ථො. සම්මාදිට්ඨිපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති, අයං අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාසඞ්කප්පො ආවුසො අධම්මො, සම්මාසඞ්කප්පො ධම්මො -පෙ- මිච්ඡාවාචා ආවුසො අධම්මො, සම්මාවාචා ධම්මො -පෙ- මිච්ඡාකම්මන්තො ආවුසො අධම්මො සම්මාකම්මන්තො ධම්මො -පෙ- මිච්ඡාආජීවො ආවුසො අධම්මො, සම්මා ආජීවො ධම්මො -පෙ- මිච්ඡාවායාමො ආවුසො අධම්මො, සම්මාවායාමො ධම්මො -පෙ- මිච්ඡාසති ආවුසො අධම්මො, සම්මාසති ධම්මො -පෙ- මිච්ඡාසමාධි ආවුසො අධම්මො, සම්මා සමාධි ධම්මො -පෙ- මිච්ඡාඤාණං ආවුසො අධම්මො, සම්මා ඤාණං ධම්මො -පෙ- මිච්ඡාවිමුත්ති ආවුසො අධම්මො, සම්මාවිමුත්තිධම්මො, යෙ ච මිච්ඡාවිමුත්තිපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, අයං අනත්ථො. සම්මාවිමුත්තිපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති, අයං අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "යං ඛො නො ආවුසො භගවා සඞ්ඛිත්තෙන උද්දෙසං උද්දිසිත්වා විත්ථාරෙන අත්ථං අවිභජිත්වා උට්ඨායාසනා විහාරං පවිට්ඨො “අධම්මො ච භික්ඛවෙ වෙදිතබ්බො ධම්මො ච, අනත්ථො ච වෙදිතබ්බො අත්ථො ච, අධම්මඤ්ච විදිත්වා ධම්මඤ්ච, අනත්ථඤ්ච විදිත්වා අත්ථඤ්ච, යථා ධම්මො යථා අත්ථො තථා පටිපජ්ජිතබ්බ”න්ති. ඉමස්ස ඛො අහං ආවුසො භගවතා සඞ්ඛිත්තෙන උද්දෙසස්ස උද්දිට්ඨස්ස විත්ථාරෙන අත්ථං අවිභත්තස්ස එවං විත්ථාරෙන අත්ථං ආජානාමි. ආකඞ්ඛමානා ච පන තුම්හෙ ආවුසො භගවන්තංයෙව උපසඞ්කමිත්වා එතමත්ථං පුච්ඡෙය්යාථ. යථා වො භගවා ව්යාකරොති. තථා නං ධාරෙය්යාථාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "’එවමාවුසො’ති ඛො තෙ භික්ඛු ආයස්මතො ආනන්දස්ස භාසිතං අභිනන්දිත්වා අනුමොදිත්වා උට්ඨායාසනා යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නා ඛො තෙ භික්ඛු භගවන්තං එතදවොචුං:"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "ඇවැත්නි, අධර්‍ම කවරේ ය, ධර්‍මය ද කවරේ ය, අනර්‍ත්‍ථය ද කවරේ ය, අර්‍ත්‍ථය කවරේ ය යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත්නි, මිථ්‍යාදෘෂ්ටිය අධර්‍ම වෙයි, සම්‍යග්දෘෂ්ටිය ධර්‍මය වෙයි, මිථ්‍යාදෘෂ්ටි ප්‍රත්‍යයෙන් යම් බඳු නොයෙක් ලාමක අකුශලධර්‍මයෝ උපදනාහු නම්, මෙ අනර්‍ත්‍ථ යි, සම්‍යග්දෘෂ්ටි ප්‍රත්‍යයෙන් නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත් නම්, මෙ අර්‍ත්‍ථ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත්නි, මිථ්‍යාසංකල්පය අධර්‍මයි, සම්‍යක්සංකල්පය ධර්‍මයි ... ඇවැත්නි, මිථ්‍යාවාක් අධර්‍මයි, සම්‍යග්වාක් ධර්‍මයි ... ඇවැත්නි, මිථ්‍යාකර්‍මාන්තය අධර්‍මයි, සම්‍යක්කර්‍මාන්තය ධර්‍මයි ... ඇවැත්නි, මිථ්‍යාආජීවය අධර්‍මයි, සම්‍යගාජීවය ධර්‍මයි ... ඇවැත්නි, මිථ්‍යාව්‍යායාමය අධර්‍මයි, සම්‍යග්ව්‍යායාමය ධර්‍මයි ... ඇවැත්නි, මිථ්‍යාස්මෘතිය අධර්‍මයි, සම්‍යක්ස්මෘතිය ධර්‍මයි ... ඇවැත්නි, මිථ්‍යාසමාධිය අධර්‍මයි, සම්‍යක්සමාධිය ධර්‍මයි ... ඇවැත්නි, මිථ්‍යාඥානය අධර්‍මයි, සම්‍යග්ඥානය ධර්‍මයි ... ඇවැත්නි, මිථ්‍යාවිමුක්තිය අධර්‍මයි, සම්‍යග්විමුක්ති ධර්‍මයි ... මිථ්‍යාවිමුක්ති ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශලධර්‍මයෝ උපදනාහු නම්, මෙ අනර්‍ත්‍ථ යි. සම්‍යග්විමුක්ති ප්‍රත්‍යයෙනුදු නොයෙක් කුශලධර්‍මයෝ භාවනායෙන් පරිපූර්තියට යෙත් නම් මෙ අර්‍ත්‍ථ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත්නි, භාග්‍යවතුන් වහන්සේ අපට ‘මහණෙනි, අධර්‍මය ද ධර්‍මය ද දතයුතු ය, අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දතයුතු ය, අධර්‍මය ද ධර්‍මය දැන අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දැන ධර්‍මය යම් පරිදි වේ නම්, අර්‍ත්‍ථය යම් පරිදි වේ නම් එ පරිද්දෙන් පිළිපැදිය යුතු ය’යි යන මේ යම් උද්දේශයක් සැකෙවින් උදෙසා විතර විසින් අරුත් නොබෙදා හුනස්නෙන් නැඟී විහාරයට වන්හු නම්, ඇවැත්නි, මම භාග්‍යවතුන් වහන්සේ විසින් සැකෙවින් උදෙසන ලද විතර විසින් අරුත් නොබෙදූ මේ උද්දේශයාගේ අර්‍ත්‍ථය මෙසේ විතර විසින් දනිම්. ඇවැත්නි, තෙපි කැමතිවන්නාහු නම්, භාග්‍යවතුන් වහන්සේ කරාම එළඹ තෙල කරුණ පුළුවුස්ව. භාග්‍යවත්හු තොපට යම් ලෙසෙකින් ව්‍යාකරණ කරත් නම්, එලෙසින් එ දරව යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "“ඇවැත්නි, එසේය”යි එ මහණහු ආයුෂ්මත් ආනන්‍ද තෙරුන්ගේ භාෂිතය සතුටින් පිළිගෙන, අනුමෝදන්ව හුනස්නෙන් නැග භාග්‍යවතුන් වහන්සේ කරා එළඹියහ. එළඹ භාග්‍යවතුන් සකසා වැඳ එකත්පසෙක හුන්හ. එකත්පසෙක හුන් ඒ භික්‍ෂූහු භාග්‍යවතුන් වහන්සේට තෙල කරුණ සැලකළහ:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 414,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“යං ඛො නො භන්තෙ භගවා සඞ්ඛිත්තෙන උද්දෙසං උද්දිසිත්වා විත්ථාරෙන අත්ථං අවිභජිත්වා උට්ඨායාසනා විහාරං පවිට්ඨො “අධම්මො ච භික්ඛවෙ වෙදිතබ්බො ධම්මො ච, අනත්ථො ච වෙදිතබ්බො අත්ථො ච, අධම්මඤ්ච විදිත්වා ධම්මඤ්ච අනත්ථඤ්ච විදිත්වා අත්ථඤ්ච, යථා ධම්මො යථා අත්ථො තථා පටිපජ්ජිතබ්බ’න්ති. තෙසං නො භන්තෙ අම්හාකං අචිරපක්කන්තස්ස භගවතො එතදහොසි: “ඉදං ඛො නො ආවුසො භගවා සඞ්ඛිත්තෙන උද්දෙසං උද්දිසිත්වා විත්ථාරෙන අත්ථං අවිභජිත්වා උට්ඨායාසනා විහාරං පවිට්ඨො ‘අධම්මො ච භික්ඛවෙ වෙදිතබ්බො ධම්මො ච, අනත්ථො ච වෙදිතබ්බො අත්ථො ච, අධම්මඤ්ච විදිත්වා ධම්මඤ්ච, අනත්ථඤ්ච විදිත්වා අත්ථඤ්ච, යථා ධම්මො යථා අත්ථො තථා පටිපජ්ජිතබ්බ’න්ති. කො නු ඛො ඉමස්ස භගවතා සඞ්ඛිත්තෙන උද්දෙසස්ස උද්දිට්ඨස්ස විත්ථාරෙන අත්ථං අවිභත්තස්ස විත්ථාරෙන අත්ථං විභජෙය්යා”ති. තෙසං නො භන්තෙ අම්හාකං එතදහොසි: “අයං ඛො ආයස්මා ආනන්දො සත්ථු චෙව සංවණ්ණිතො, සම්භාවිතො ච විඤ්ඤූනං සබ්රහ්මචාරීනං, පහොති චායස්මා ආනන්දො ඉමස්ස භගවතා සඞ්ඛිත්තෙන උද්දෙසස්ස උද්දිට්ඨස්ස විත්ථාරෙන අත්ථං අවිභත්තස්ස විත්ථාරෙන අත්ථං විභජිතුං. යන්නූනමයං යෙනායස්මා ආනන්දො තෙනුපසඞ්කමෙය්යාම, උපසඞ්කමිත්වා ආයස්මා ආනන්දං එතමත්ථං පුච්ඡෙය්යාම, යථා නො ආයස්මා ආනන්දො ව්යාකරිස්සති, තථා නං ධාරෙස්සාමාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො මයං භන්තෙ යෙනායස්මා ආනන්දො තෙනුපසංකමිම්හ, උපසංකමිත්වා ආයස්මන්තං ආනන්දං එතමත්ථං අපුච්ඡිම්හ. තෙසං නො භන්තෙ ආයස්මතා ආනන්දෙන ඉමෙහි ආකාරෙහි ඉමෙහි පදෙහි ඉමෙහි ව්යඤ්ජනෙහි අත්ථො සුවිභත්තො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සාධු සාධු භික්ඛවෙ පණ්ඩිතො භික්ඛවෙ ආනන්දො, මහාපඤ්ඤො භික්ඛවෙ ආනන්දො. මමඤ්චෙපි තුම්හෙ භික්ඛවෙ උපසංකමිත්වා එතමත්ථං පුච්ඡෙය්යාථ, අහම්පි චෙතං අත්ථං එවමෙව ව්යාකරෙය්යං, යථා තං ආනන්දෙන ව්යාකතං. එසො චෙතස්ස අත්ථො, එවඤ්ච නං ධාරෙය්යාථාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "“වහන්ස, භාග්‍යවතුන් වහන්සේ අපට ‘මහණෙනි, අධර්‍මය ද ධර්‍මය ද දතයුතු ය, අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දතයුතු ය, අධර්‍මයත් ධර්‍මයත් දැන අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දැන ධර්‍මය යම් පරිදි වේ නම් අර්‍ත්‍ථය යම් පරිදි වේ නම් එසේ පිළිපැදිය යුතු ය’යි යම් උද්දේසයක් සැකෙවින් විතර විසින් අරුත් නොබෙදා හුනස්නෙන් නැඟී විහාරයට වන් සේක් ද වහන්ස, ඒ අපට භාග්‍යවතුන් වහන්සේ බැහැර වැඩි නො බෝ කල් වත් ම තෙල සිත විය. ‘ඇවැත්නි, අපට භාග්‍යවතුන් වහන්සේ ‘මහණෙනි, අධර්‍මය ද ධර්‍මය ද දතයුතුය, අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දතයුතුය, අධර්‍මය ද ධර්‍මය ද දැන අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දැන ධර්‍මය යම් පරිදි වේ නම් අර්‍ත්‍ථය යම් පරිදි වේ නම් ඒ පරිදි පිළිපැදිය යුතු ය’යි යන මේ උද්දේසය සැකෙවින් උදෙසා විස්තර විසින් අරුත් නො බෙදා හුනස්නෙන් නැඟී විහාරයට වන්හ. භාග්‍යවතුන් වහන්සේ විසින් සැකෙවින් උදෙසන ලද විස්තර විසින් අරුත් නොබෙදන ලද මේ උද්දේසයාගේ අර්‍ත්‍ථය කවරෙක් නම් විතර විසින් බෙදන්නේ දැ”යි. වහන්ස, ඒ අපට තෙල සිත විය: “මේ ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ ශාස්තෘන් වහන්සේ විසිනුදු සංවර්‍ණණිතයහ. විඥ සබ්‍රම්සරුන් විසිනුදු සම්භාවිතයහ. ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ විසින් සැකෙවින් උදෙසන ලද විතර විසින් අරුත් නො බෙදන ලද මේ උද්දේසයාගේ අර්‍ත්‍ථය විතර විසින් බෙදනට පොහොසත් ද වෙති. ඉදින් අපි ආයුෂ්මත් ආනන්‍ද තෙරුන් කරා එළඹමෝ නම්, එළඹ ආයුෂ්මත් ආනන්‍ද තෙරුන් තෙල අරුත් පුළුවුස්නමෝ නම් ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ යම් පරිදි අපට ව්‍යාකරණ කෙරෙත් නම් එසෙයින් එම දරන්නමෝ නම් මැනැවැ”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, ඉක්බිති අපි ආයුෂ්මත් ආනන්‍ද තෙරුන් කරා එළඹියම්හ. එළඹ ආයුෂ්මත් ආනන්‍ද තෙරුන් තෙල අරුත් පුළුවුසුම්හ. වහන්ස, එ අපට ආයුෂ්මත් ආනන්‍ද තෙරුන් විසින් මේ අයුරින් මෙ පෙදෙන් මෙ ව්‍යඤ්ජනයෙන් අර්‍ත්‍ථය සුවිභක්තය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මැනව, මැනව. මහණෙනි, ආනන්‍දයෝ පණ්ඩිතයහ. මහණෙනි, ආනන්‍දයෝ මහාප්‍රාඥයහ. මහණෙනි, ඉදින් තෙපි මා කරා එළඹ තෙල අරුත් පුළුවුස්නාහු නම් මම ද තෙල කරුණ ආනන්‍දයන් විසින් එය යම් පරිදි ව්‍යාකෘත නම් එපරිදි ම විවරණ කරමි. තෙල භාෂිතයාගේ තෙල අරුත් ම ය. එසෙයින් ම එය දරව යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 416,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 4.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "අජිත සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො **අජිතො පරිබ්බාජකො** යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො අජිතො පරිබ්බාජකො භගවන්තං එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අම්හාකං භො ගොතම පණ්ඩිතො නාම සබ්රහ්මචාරී. තෙන පඤ්චමත්තානි චිත්තට්ඨානසතානි චින්තිතානි, යෙහි අඤ්ඤතිත්ථියා උපාරද්ධා{1} පජානන්ති උපාරද්ධම්භාති.{2}"
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා භික්ඛු ආමන්තෙසි: ධාරෙථ නො තුම්හෙ භික්ඛවෙ පණ්ඩිතවත්ථූනීති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "එතස්ස භගවා කාලො, එතස්ස සුගත කාලො, යං භගවා භාසෙය්ය, භගවතො සුත්වා භික්ඛූ ධාරෙස්සන්තීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන හි භික්ඛවෙ සුණාථ, සාධුකං මනසිකරොථ, භාසිස්සාමීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවම්භන්තෙති ඛො තෙ භික්ඛු භගවතො පච්චස්සොසුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චො අධම්මිකෙන වාදෙන අධම්මිකං වාදං අභිනිග්ගණ්හාති, අභිනිප්පීළෙති. තෙන ච අධම්මිකං පරිසං රඤ්ජෙති. තෙන සා අධම්මිකා පරිසා උච්චාසද්දා මහාසද්දා හොති. පණ්ඩිතො වත භො, පණ්ඩිතො වත භොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො අධම්මිකෙන වාදෙන ධම්මිකං වාදං අභිනිග්ගණ්හාති, අභිනිප්පීළෙති. තෙන ච අධම්මිකං පරිසං රඤ්ජෙති. තෙන සා අධම්මිකා පරිසා උච්චාසද්දා මහාසද්දා ‘පණ්ඩිතො වත භො, පණ්ඩිතො වත භො’ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උපාරද්ධාවජානන්ති – මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "2. උපරද්ධස්මාති – මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අජිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "එකල්හි **අජිත පරිව්‍රාජක** භාග්‍යවතුන් වහන්සේ කරා එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සතුටු විය යුතු සිහිකටයුතු කථා කොට නිමවා එකත්පසෙක හින. එකත්පසෙක හුන් අජිත පරිව්‍රාජක භගවත්හට තෙල කීය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "භවත් ගෞතමයෙනි, අපගේ පණ්ඩිත නම් සබ්‍රම්සරෙක් ඇත. ඔහු විසින් යම් චිත්තෝත්පාද කෙනෙකුන් කරණ කොට ගෙන අන්‍යතීර්‍ත්‍ථකයෝ නිගන්නාලදහු නිගන්නා ලදුම්හයි දනිත් නම් එබඳු පන්සියක් පමණ චිත්තෝත්පාදයෝ සිතන ලදහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එකල්හි භාග්‍යවතුන් වහන්සේ මහණුන් ඇමතූ සේක: “මහණෙනි, තෙපි පණ්ඩිත වස්තූන් දරවුදැ”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "භාග්‍යවතුන් වහන්සේ යමක් වදාරනසේක් නම් භාග්‍යවත්නි, තෙල සඳහා මෙ කලි, සුගතයෙනි, තෙල සඳහා මෙ කලි, භාග්‍යවතුන් වහන්සේගේ භාෂිතය අසා භික්‍ෂූහු දරත්හ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එහෙයින් ම අසවු, මොනොවට මෙනෙහි කරවු, කියන්නෙමි යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, එසේ ය යි එ මහණහු භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වූහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "භාග්‍යවතුන් වහන්සේ තෙල වදාළහ:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි එකෙක් අධාර්මිකවාදයෙන් අධාර්මිකවාදය නිගන්නේ ය, වෙසෙසින් පෙළන්නේ ය. එයිනුදු අධාර්මික පර්‍ෂද්රඤ්ජිත කරනේ ය. එයින් ඒ අධාර්මික පර්‍ෂද් “භවත්නි, එකැතින් පණ්ඩිත ය. භවත්නි, එකැතින් පණ්ඩිත ය”යි උස්හඬ මහහඬ හඬ ඇති වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි එකෙක් අධාර්මිකවාදයෙන් ධාර්මිකවාදය දැඩි කොට නිගන්නේ ය, දැඩි කොට පෙළන්නේ ය. එයිනුදු අධාර්මික පර්‍ෂද් “භවත්නි, එකැතින් පණ්ඩිත ය, භවත්නි, එකැතින් පණ්ඩිත ය”යි උස්හඬ මහහඬ ඇති වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 418,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො අධම්මිකෙන වාදෙන ධම්මිකං ච වාදං අධම්මිකඤ්ච වාදං අභිනිග්ගණ්හාති, අභිනිප්පීළෙති. තෙන ච අධම්මිකං පරිසං රඤ්ජෙති. තෙන සා අධම්මිකා පරිසා උච්චාසද්දා මහාසද්දා හොති පණ්ඩිතො වත භො, පණ්ඩිතො වත භො’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො ධම්මිකෙන වාදෙන ධම්මිකං ච වාදං අධම්මිකඤ්ච වාදං අභිනිග්ගණ්හාති, අභිනිප්පීළෙති. තෙන ච අධම්මිකං පරිසං රඤ්ජෙති. තෙන සා අධම්මිකා පරිසා උච්චාසද්දා මහාසද්දා හොති ‘පණ්ඩිතො වත භො, පණ්ඩිතො වත භො”ති.{*}"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො ධම්මිකෙන වාදෙන ධම්මිකං වාදං අභිනිග්ගණ්හාති, අභිනිප්පීළෙති. තෙන ච ධම්මිකං පරිසං රඤ්ජෙති. තෙන ච සා ධම්මිකා පරිසා උච්චාසද්දා මහාසද්දා හොති පණ්ඩිතො වත භො, පණ්ඩිතො වත භො’ති.{*}"
                    },
                    {
                        "type": "paragraph",
                        "text": "අධම්මො ච භික්ඛවෙ වෙදිතබ්බො ධම්මො ච, අනත්ථො ච වෙදිතබ්බො අත්ථො ච. අධම්මඤ්ච විදිත්වා ධම්මඤ්ච, අනත්ථං ච විදිත්වා අත්ථඤ්ච, යථා ධම්මො යථා අත්ථො පටිපජ්ජිතබ්බං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ අධම්මො, කතමො ච ධම්මො: කතමො ච අනත්ථො, කතමො ච අත්ථො:"
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාදිට්ඨි භික්ඛවෙ අධම්මො, සම්මාදිට්ඨි ධම්මො, යෙ ච මිච්ඡාදිට්ඨිපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, අයං අනත්ථො. සම්මාදිට්ඨිපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති අයං අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාසඞ්කප්පො භික්ඛවෙ අධම්මො, සම්මාසඞ්කප්පො ධම්මො -පෙ- මිච්ඡාවාචා භික්ඛවෙ අධම්මො, සම්මාවාචා ධම්මො -පෙ- මිච්ඡාකම්මන්තො භික්ඛවෙ අධම්මො සම්මාකම්මන්තො ධම්මො -පෙ-"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "*. මරම්මපොත්ථකෙසු එතානි දෙව ඛණ්ඩානි න දිස්සන්තෙ"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි එකෙක් අධාර්මිකවාදයෙන් ධාර්මිකවාදය ද අධාර්මිකවාදය ද දැඩි ව නිගනී, දැඩි ව පෙළ යි. එයින් ම අධාර්මික පර්‍ෂද් රඳනේ ය. ඒ කරුණින් ඒ අධාර්මික පර්‍ෂද් “භවත්නි, එකැතින් පණ්ඩිත. භවත්නි, එකැතින් පණ්ඩිත ය”යි උස්හඬ ඇති මහ හඬ ඇති වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි එකෙක් ධාර්මිකවාදයෙන් ධාර්මිකවාදය ද අධාර්මිකවාදය ද දැඩි ව නිගන්නේ ය, දැඩි ව පෙළන්නේ ය. එයිනුදු අධාර්මික පර්‍ෂද් කැඳවන්නේ ය. එයින් ඒ අධාර්මික පර්‍ෂද් “භවත්නි, එකැතින් පණ්ඩිත ය. භවත්නි, එකැතින් පණ්ඩිත ය”යි උස්හඬ මහහඬ ඇති වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි එකෙක් ධාර්මික වාදයෙන් ධාර්මිකවාදය තදින් නිගනී, තදින් පෙළයි. එයිනුදු ධාර්මික පර්‍ෂද් රඳවයි. එයින් ඒ ධාර්මික පර්‍ෂද් “භවත්නි, එකැතින් පණ්ඩිත ය. භවත්නි, එකැතින් පණ්ඩිත ය” යි උස්හඬ ඇති මහ හඬ ඇති වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අධර්‍මය ද ධර්‍මය ද දතයුතු, අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දතයුතු, අධර්‍මය ද ධර්‍මය ද දැන අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දැන දහම් යම් පරිදි වේ නම් අරුත් යම් පරිදි වේ නම් එ පරිදි පිළිපැදිය යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අධර්‍මය කවර? ධර්‍මය ද කවර? අනර්‍ත්‍ථය කවර? අර්‍ත්‍ථය ද කවර?",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මිථ්‍යාදෘෂ්ටිය අධර්‍ම යි. සම්‍යක්දෘෂ්ටිය ධර්‍ම යි. මිථ්‍යාදෘෂ්ටි ප්‍රත්‍යයෙන් යම් බඳු නොයෙක් ලමු අකුශල ධර්‍මයෝ උපදනාහු නම් මේ අනර්‍ත්‍ථ යි. සම්‍යක්දෘෂ්ටි ප්‍රත්‍යයෙනුදු නොයෙක් කුශල ධර්‍මයෝ භාවනායෙන් පරිපූර්ත්තියට යෙත් නම් මේ අර්‍ත්‍ථ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මිථ්‍යාසඞ්කල්පය අධර්‍ම යි, සම්‍යක්සඞ්කල්පය ධර්‍ම යි ... මහණෙනි, මිථ්‍යාවාග් අධර්‍ම යි, සම්‍යක්වාග් ධර්‍ම යි ... මහණෙනි, මිථ්‍යා කර්‍මාන්තය අධර්‍ම යි. සම්‍යක් කර්‍මාන්තය ධර්‍ම යි ...",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 420,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාආජීවො භික්ඛවෙ අධම්මො, සම්මා ආජීවො ධම්මො -පෙ- මිච්ඡාවායාමො භික්ඛවෙ අධම්මො, සම්මාවායාමො ධම්මො -පෙ- මිච්ඡාසති භික්ඛවෙ අධම්මො, සම්මාසති ධම්මො -පෙ- මිච්ඡාසමාධි භික්ඛවෙ අධම්මො, සම්මා සමාධි ධම්මො -පෙ- මිච්ඡාඤාණං භික්ඛවෙ අධම්මො, සම්මා ඤාණං ධම්මො -පෙ- මිච්ඡාවිමුත්ති භික්ඛවෙ අධම්මො, සම්මාවිමුත්ති ධම්මො, යෙ ච මිච්ඡාවිමුත්තිපච්චයා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති, අයං අනත්ථො. සම්මාවිමුත්තිපච්චයා ච අනෙකෙ කුසලා ධම්මා භාවනා පාරිපූරිං ගච්ඡන්ති, අයං අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "අධම්මො ච භික්ඛවෙ වෙදිතබ්බො ධම්මො ච, අනත්ථො ච වෙදිතබ්බො අත්ථො ච, අධම්මඤ්ච විදිත්වා ධම්මඤ්ච, අනත්ථඤ්ච විදිත්වා අත්ථඤ්ච යථා ධම්මො, යථා අත්ථො තථා පටිපජ්ජිතබ්බන්ති ඉති යං තං වුත්තං ඉදමෙතං පටිච්ච වුත්තන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 5.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "සඞ්ගාරව සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො **සඞ්ගාරවො** බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො සඞ්ගාරවො බ්රාහ්මණො භගවන්තං එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "“කිං නු ඛො භො ගොතම ඔරිමං තීරං, කිං පාරිමං තීර”න්ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාදිට්ඨි ඛො බ්රාහ්මණ ඔරිමං තීරං, සම්මාදිට්ඨි පාරිමං තීරං. මිච්ඡාසඞ්කප්පො ඔරිමං තීරං, සම්මාසඞ්කප්පො පාරිමං තීරං. මිච්ඡාවාචා ඔරිමං තීරං, සම්මාවාචා පාරිමං තීරං. මිච්ඡාකම්මන්තො ඔරිමං තීරං සම්මාකම්මන්තො පාරිමං තීරං. මිච්ඡා ආජීවො ඔරිමං තීරං, සම්මා ආජීවො පාරිමං තීරං. මිච්ඡාවායාමො ඔරිමං තීරං, සම්මා වායාමො පාරිමං තීරං. මිච්ඡාසති ඔරිමං තීරං, සම්මාසති පාරිමං තීරං. මිච්ඡාසමාධි ඔරිමං තීරං, සම්මාසමාධි පාරිමං තීරං. මිච්ඡාඤාණං ඔරිමං තීරං, සම්මාඤාණං පාරිමං තීරං. මිච්ඡාවිමුත්ති ඔරිමං තීරං, සම්මාවිමුත්ති පාරිමං තීරං. ඉදං ඛො බ්රාහ්මණ ඔරිමං තීරං, ඉදං පාරිමං තීරන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මිථ්‍යාආජීවය අධර්‍ම යි. සම්‍යක්ආජීවය ධර්‍ම යි ... මහණෙනි, මිථ්‍යාව්‍යායාමය අධර්‍ම යි. සම්‍යක්ව්‍යායාමය ධර්‍ම යි ... මහණෙනි, මිථ්‍යා ස්මෘතිය අධර්‍ම යි, සම්‍යක්ස්මෘතිය ධර්‍ම යි ... මහණෙනි, මිථ්‍යාසමාධිය අධර්‍ම යි. සම්‍යක්සමාධිය ධර්‍ම යි ... මහණෙනි, මිථ්‍යාඤාණය අධර්‍ම යි, මහණෙනි, සම්‍යක්ඥානය ධර්‍ම යි ... මහණෙනි, මිථ්‍යාවිමුක්තිය අධර්‍ම යි. සම්‍යක්විමුක්තිය ධර්‍ම යි. මිථ්‍යාවිමුක්ති ප්‍රත්‍යයෙන් යම්බඳු නොයෙක් ලාමක අකුශල ධර්‍මයෝ උපදනාහු නම් මේ අනර්‍ත්‍ථ යි. සම්‍යක් විමුක්ති ප්‍රත්‍යයෙනුදු මේ කුශල ධර්‍මයෝ භාවනායෙන් පරිපූර්‍තතියට යෙත් නම් මේ අර්‍ත්‍ථ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අධර්‍මය ද ධර්‍මය ද දතයුතු, අනර්‍ත්‍ථය ද අර්‍ත්‍ථය ද දතයුතු, අධර්‍මයත් ධර්‍මයත් දැන අනර්‍ත්‍ථයත් අර්‍ත්‍ථයත් දැන දහම් යම් පරිදි වේ නම් අනර්‍ත්‍ථ යම් පරිදි වේ නම් එසේ පිළිපැදිය යුතු යයි මෙසේ යමක් කියන ලද නම් මෙය තෙල කරුණ පිණිස කියන ලදැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සඞ්ගාරව සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "එකල්හි **සඞ්ගාරව** බ්‍රාහ්මණ භාග්‍යවතුන් වහන්සේ වෙත එළැඹියේ ය. එළැඹ භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පස්ව හින. එකත්පස්ව හුන් සඞ්ගාරව බ්‍රාහ්මණ භාග්‍යවතුන් වහන්සේට තෙල කීය:",
                        "type": "paragraph"
                    },
                    {
                        "text": "භවත් ගෞතමයෙනි, මෙතෙර කවර, එතෙර කවර?",
                        "type": "paragraph"
                    },
                    {
                        "text": "බ්‍රාහ්මණය, මිථ්‍යාදෘෂ්ටිය මෙ තෙර යි. සම්‍යක්දෘෂ්ටිය එතෙර යි. මිථ්‍යාසඞ්කල්පය මෙතෙර යි, සම්‍යක්සඞ්කල්පය එතෙර යි. මිථ්‍යාවචනය මෙතෙර යි, සම්‍යක්වචනය එතෙර යි. මිථ්‍යාකර්‍මාන්තය මෙතෙර යි, සම්‍යක්කර්‍මාන්තය එතෙර යි. මිථ්‍යාආජීවය මෙතෙර යි, සම්‍යක්ආජීවය එතෙර යි. මිථ්‍යාව්‍යායාමය මෙතෙර යි, සම්‍යක්ව්‍යායාමය එතෙර යි. මිථ්‍යාසතිය මෙතෙර යි, සම්‍යක්සතිය එතෙර යි. මිථ්‍යාසමාධිය මෙතෙර යි, සම්‍යක්සමාධිය එතෙර යි. මිථ්‍යාඥානය මෙතෙර යි, සම්‍යක්ඥානය එතෙර යි. මිථ්‍යාවිමුක්තිය මෙතෙර යි, සම්‍යක්විමුක්තිය එතෙර යි. බමුණ, මෙ වනාහි මෙතෙරය, මෙ එතෙරය යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 422,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "1. අප්පකා තෙ මනුස්සෙසු - යෙ ජනා පාරගාමිනො,\nඅථායං ඉතරා පජා - තීරමෙවානුධාවති.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "2. යෙ ච ඛො සම්මදක්ඛාතෙ - ධම්මෙ ධම්මානුවත්තිනො,\nතෙ ජනා පාරමෙස්සන්ති - මච්චුධෙය්යං සුදුත්තරං.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "3. කණ්හං ධම්මං විප්පහාය සුක්කං භාවෙථ පණ්ඩිතො,\nඔකා අනොකං ආගම්ම - විවෙකෙ යත්ථ දූරමං.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "4. තත්රාභිරතිමිච්ඡෙය්ය - හිත්වා කාමෙ අකිඤ්චනො,\nපරියොදපෙය්ය අත්තානං - චිත්තක්ලෙසෙහි පණ්ඩිතො.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "5. යෙසං සම්බොධි අඞ්ගෙසු - සම්මාචිත්තං සුභාවිතං,\nආදානපටිනිස්සග්ගෙ - අනුපාදාය යෙ රතා,\nඛීණාසවා ජුතීමන්තො - තෙ ලොකෙ පරිනිබ්බුතා ති.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 6.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "ඔරිමතීර සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඔරිමඤ්ච ඛො භික්ඛවෙ තීරං දෙසිස්සාමි, පාරිමඤ්ච තීරං. තං සුණාථ. සාධුකං මනසිකරොථ, භාසිස්සාමීති. එවං භන්තෙති ඛො තෙ භික්ඛු භගවතො පච්චස්සොසුං. භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ ඔරිමං තීරං, කතමඤ්ච පාරිමං තීරං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාදිට්ඨි භික්ඛවෙ ඔරිමං තීරං, සම්මාදිට්ඨි පාරිමං තීරං -පෙ- මිච්ඡාවිමුත්ති ඔරිමං තීරං, සම්මාවිමුත්ති පාරිමං තීරං. ඉදං ඛො භික්ඛවෙ ඔරිමං තීරං, ඉදං පාරිමං තීරන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "1. මිනිසුන් අතුරෙන් යම් ජන කෙනෙක් නිවන් යනුවෝ ද එ ජනයෝ මඳහ. වැලි මෙ (නිවන් යන සත්ත්‍වයන් කෙරෙන්) අන් ප්‍රජාව සත්කාය තීරයට ම දිවෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. යම් කෙනෙකුන් මොනොවට දෙසූ (දේශනා) නව ලෝකෝත්තර ධර්‍මයෙහි ධර්‍මානුරූප ව වටනාහු ද, එ ජනයෝ සුදුසතර තෙබුමු වට නැමැති මෘත්‍යුධෙයය තරණය කොට පරතෙර (නිවන) ට යෙත්‍.",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. පණ්ඩිත තෙමේ කෘෂ්ණ ධර්‍ම හැරදමා වර්‍ත සඞ්ඛ්‍යාත ගෙන් යම් කාය චිත්ත උපධි විවේකයෙක්හි අභිරමණය කිරීමට දුෂ්කර වූ විවර්‍ත සඞ්ඛ්‍යාත අනෝකයට පැමිණ ශුක්ලධර්‍මය වඩනේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. පලිබෝධ රහිත වූයේ පණ්ඩිත තෙම ද්විවිධ කාමයන් දුරු කොට එ නිවන්හි අභිරතිය කැමැති වන්නේ ය. චිත්තක්ලේශයන්ගෙන් සිත පර්‍ය්‍යවදාත කරන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "5. යමකුන් විසින් සම්බෝධ්‍යඞ්ගයන්හි මොනොවට සිත වඩන ලද ද ග්‍රහණප්‍රතිනිඃසර්‍ග සඞ්ඛ්‍යාත නිර්‍වාණයෙහි චතුරෝපාදාන විසින් නො ගෙන යම් කෙනෙක් ඇලුණාහු ද ද්‍යුතිමත් එ ක්‍ෂීණාස්‍රවයෝ පඤ්චස්කන්‍ධ සඞ්ඛ්‍යාත උපාදාන ලෝකයෙහි (කෙලෙස් පිරිනිවුමෙන්) නිවියහයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඔරිමතීර සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට ඔරිමතීරය හා පාරිමතීරය හා දෙසන්නෙමි. එ අසව, මොනොවට මෙනෙහි කරව දෙසන්නෙමි යි. ‘වහන්ස, එසේ’ යි එ භික්‍ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වූහ. භාග්‍යවතුන් වහන්සේ තෙල වදාළහ:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඔරිමතීරය හා කවර, පාරිමතීරය හා කවර:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මිථ්‍යාදෘෂ්ටිය ඔරිමතීරය යි. සම්‍යග්දෘෂ්ටිය පාරිමතීරය යි ... මිථ්‍යාවිමුක්තිය ඔරිමතීරය යි. සම්‍යග්විමුක්තිය පාරිමතීරය යි. මහණෙනි, මෙ ඔරිමතීරය යි. මෙ පාරිමතීරය යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 424,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "1. අප්පකා තෙ මනුස්සෙසු - යෙ ජනා පාරගාමිනො,\nඅථායං ඉතරා පජා - තීරමෙවානුධාවති.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "2. යෙ ච ඛො සම්මදක්ඛාතෙ - ධම්මෙ ධම්මානුවත්තිනො,\nතෙ ජනා පාරමෙස්සන්ති - මච්චුධෙය්යං සුදුත්තරං.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "3. කණ්හං ධම්මං විප්පහාය - සුක්කං භාවෙථ පණ්ඩිතො,\nඔකා අනොකං ආගම්ම - විවෙකෙ යත්ථ දූරමං.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "4. තත්රාභිරතිමිච්ඡෙය්ය - හිත්වා කාමෙ අකිඤ්චනො,\nපරියොදපෙය්ය අත්තානං - චිත්තක්ලෙසෙහි පණ්ඩිතො.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "5. යෙසං සම්බොධි අඞ්ගෙසු - සම්මාචිත්තං සුභාවිතං,\nආදානපටිනිස්සග්ගෙ - අනුපාදාය යෙ රතා,\nඛීණාසවා ජුතීමන්තො - තෙ ලොකෙ පරිනිබ්බුතා ති.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 7.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "පඨම පච්චොරොහණී සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන **ජාණුස්සොණි**{1} බ්රාහ්මණො තදහුපොසථෙ සීසං{2}නහාතො නවං ඛොමයුගං නිවත්ථො අල්ලකුසමුට්ඨිං ආදාය භගවතො අවිදූරෙ එකමන්තං ඨිතො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අද්දසා ඛො භගවා ජාණුස්සොණිං බ්රාහ්මණං තදහුපොසථෙ සීසං නහාතං නවං ඛොම යුගං නිවත්ථං අල්ලං කුසමුට්ඨිං ආදාය අවිදූරෙ එකමන්තං ඨිතං. දිස්වා ජාණුස්සොණිං බ්රාහ්මණං එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කිං නු ඛො ත්වං බ්රාහ්මණ, තදහුපොසථෙ සීසං නහාතො නවං ඛොමයුගං නිවත්ථො අල්ලං කුසමුට්ඨිං ආදාය එකමන්තං ඨිතො? කිං න්වජ්ජ බ්රාහ්මණකුලස්සාති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "පච්චොරොහණී භො ගොතම, අජ්ජ බ්රාහ්මණකුලස්සාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යථාකථං පන බ්රාහ්මණ, බ්රාහ්මණානං පච්චොරොහණී හොතී ති?"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ජානුස්සොණී – මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "2. සීසං නහාතො – මඡසං; සීසනහාතො – ස්යා"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "1. මිනිසුන් අතුරෙන් යම් ජන කෙනෙක් නිවන් යනුවෝ ද, එ ජනයෝ මදහ. වැලි මෙ සෙසු ලොවී සත්ත්‍වාඛ්‍ය ප්‍රජාව සත්කාය තීරයටම දිවෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. යම් කෙනෙකුන් මොනොවට දෙසූ නව ලොවුතුරු දහම්හි ධර්‍මානුරූප ව වටනාහු ද, එ ජනයෝ සුදුසතර වූ තෙබුමු වට නැමැති මෘත්‍යුධෙයය තරණය කොට පරතෙර (නිවන) ට යෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. පණ්ඩිත තෙම කෘෂ්ණධර්‍ම හැරපියා වර්‍ත සඞ්ඛ්‍යාත ගිහිගෙන් ත්‍රිවිධ විවේකයෙහි අභිරමණයට දුෂ්කරවූ විවර්‍ත සඞ්ඛ්‍යාත අනෝකයට පැමිණ ශුක්ල ධර්‍ම වඩනේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. පරිරෝධ නැතියේ කාමයන් හැරපියා එ නිවන්හි අභිරතිය පතන්නේ ය. පණ්ඩිත තෙමේ චිත්තක්ලේශයන්ගෙන් සිත පර්‍ය්‍යවදාත කරන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "5. යමකුන් විසින් සම්බෝධ්‍යඞ්ගයන්හි චිත්තය මොනොවට වඩන ලද ද, ආදාන ප්‍රතිනිඃසර්‍ගයෙහි උපාදාන විසින් නො ගෙන යමෙක් ඇලුණාහු ද ද්‍යුතිමත් එ ක්‍ෂීණාස්‍රව පණ්ඩිතයෝ ලොව්හි පිරිනිවියහ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පඨම පච්චෝරෝහණී සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "එ සමයෙහි **ජානුස්සෝණී** බ්‍රාහ්මණ එ පොහෝ දවස්හි හිස නහවාලූයේ නව ක්‍ෂෞමවස්ත්‍ර යුග්මයක් හැඳියේ අමු කුසතණ මිටක් ගෙන භාග්‍යවතුන් වහන්සේට නුදුරෙහි එකත්පස්හි සිටියේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "භාග්‍යවතුන් වහන්සේ එපොහෝ දවස්හි හිස නහවාලූ නව ක්‍ෂෞමවස්ත්‍ර යුග්මයක් හැඳි අමු හීතණ මිටක් ගෙන නුදුරෙහි එකත්පස්හි හුන් ජාණුස්සෝණී බ්‍රාහ්මණයා දුටුහු, දැක ජාණුස්සෝණී බ්‍රාහ්මණහට තෙල කරුණ වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "text": "බ්‍රාහ්මණය, එ පොහෝ දවස්හි හිස සෝදා නහා නව කොමුපිළී යුවළක් හැඳියේ අමු හීතණ මිටක් ගෙන තෙපි කවර හෙයින් එකත් පසෙක් සිටියහු ද? අද බ්‍රාහ්මණ කුලයට කවරක් ඇද්දැයි?",
                        "type": "paragraph"
                    },
                    {
                        "text": "භවත් ගෞතමයිනි, අද බ්‍රාහ්මණ කුලයට ප්‍රත්‍යවරෝහණය (පව් සෝදා හැරීම) යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බ්‍රාහ්මණය, බමුණන්ගේ ප්‍රත්‍යවරෝහණය කෙසෙයින් වේ ද?",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 426,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉධ භො ගොතම, බ්රාහ්මණා තදහුපොසථෙ සීසං නහාතා නවං ඛොමයුගං නිවත්ථා අල්ලෙන ගොමයෙන පඨවිං ඔපුඤ්ඡිත්වා හරිතෙහි කුසෙහි පත්ථරිත්වා අන්තරා ච වෙලං අන්තරා ච අග්ග්යාගාරං සෙය්යං කප්පෙන්ති. තෙ තං රත්තිං තික්ඛත්තුං පච්චුට්ඨාය පඤ්ජලිකා අග්ගිං නමස්සන්ති “පච්චොරොහාම භවන්තං, පච්චොරොහාම භවන්ත”න්ති. පහූතෙන ච සප්පිතෙලෙන නවනීතෙන අග්ගිං සන්තප්පෙන්ති. තස්සා ච රත්තියා අච්චයෙන පණීතෙන ඛාදනීයෙන භොජනීයෙන බ්රාහ්මණෙ සන්තප්පෙන්ති. එවං ඛො භො ගොතම, බ්රාහ්මණානං පච්චොරොහණී හොතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අඤ්ඤථා ඛො බ්රාහ්මණ, බ්රාහ්මණානං පච්චොරොහණී අඤ්ඤථා ච පන අරියස්ස විනයෙ පච්චොරොහණී හොතී ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යථාකථං පන භො ගොතම, අරියස්ස විනයෙ පච්චොරොහණී හොතීති? සාධු මෙ භවං ගොතමො තථා ධම්මං දෙසෙතු, යථා අරියස්ස විනයෙ පච්චොරොහණී හොතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන හි බ්රාහ්මණ, සුණාහි, සාධුකං මනසිකරොහි, භාසිස්සාමීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං භොති ඛො ජාණුස්සොණි බ්රාහ්මණො භගවතො පච්චස්සොසි, භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ බ්රාහ්මණ, අරියසාවකො ඉතිපටිසඤ්චික්ඛති: “මිච්ඡාදිට්ඨියා ඛො පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ, අභිසම්පරායඤ්චා”ති, සො ඉති පටිසඞ්ඛාය මිච්ඡාදිට්ඨිං පජහති, මිච්ඡාදිට්ඨියා පච්චොරොහති."
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාසඞ්කප්පස්ස ඛො පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරායඤ්චාති. සො ඉති පටිසඞ්ඛාය මිච්ඡාසඞ්කප්පං පජහති, මිච්ඡාසඞ්කප්පා පච්චොරොහති."
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාවාචාය ඛො පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ, අභිසම්පරායඤ්චාති. සො ඉති පටිසඞ්ඛාය මිච්ඡාවාචං පජහති. මිච්ඡාවාචාය පච්චොරොහති."
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාකම්මන්තස්ස ඛො පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ, අභිසම්පරායඤ්චාති. සො ඉති පටිසඞ්ඛාය මිච්ඡාකම්මන්තං පජහති. මිච්ඡාකම්මන්තා පච්චොරොහති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "භවත් ගෞතමයෙනි, මෙලොව්හි බමුණෝ එ පොහෝ දවස්හි හිස් සෝදා නෑවාහු නව කොමුපිළී යුවළක් හැදියාහු අමුගොමින් පොළෝ අලෙවුදී නිල් හීතණින් අතුරා වැලිසරට හා ගිනිහල් ගෙට අතර ශය්‍යා කරත්. ඔහු එරෑ තෙවිටක් නැඟී බදැඳිලි ව ගිනි නමදිත්. “භවතුන්ට ප්‍රත්‍යවරෝහණය (පාපශෝධන) කරම්හ”යි. බොහෝ ගිතෙලිනුදු වෙඬරුයෙනුදු අග්නි සන්තර්‍පණ කරත්. එරෑ ඉක්ම යාමෙනුදු කෑ යුතු බුදිය යුතු පිණි අහරින් බමුණන් සන්තර්පිත කරත්. භවත් ගෞතමයෙනි, මෙසෙයින් බ්‍රාහ්මණයන්ගේ ප්‍රත්‍යවරෝහණය වේ යයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බ්‍රාහ්මණය, බ්‍රාහ්මණයන්ගේ ප්‍රත්‍යවරෝහණය අන්පරිද්දෙකින් වෙයි. ආර්‍ය්‍යවිනයෙහි ප්‍රත්‍යවරෝහණය අන් පරිද්දෙකින් වේ යයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "භවත් ගෞතමයෙනි, ආර්‍ය්‍යවිනයෙහි ප්‍රත්‍යවරෝහණය කෙසේ වේ දැයි? ආර්‍ය්‍යවිනයෙහි ප්‍රත්‍යවරෝහණය යම් පරිද්දෙකින් වේ නම් භවත් ගෞතමයන් වහන්සේ මට එලෙසින් දහම් දෙසන සේක්වා යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බ්‍රාහ්මණය, එ කරුණෙන් අසව, මොනොවට මෙනෙහි කරව දෙසන්නෙමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "භවත්නි, එසේය යි ජාණුස්සෝණි බ්‍රාහ්මණ භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වීය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බමුණ, මෙසස්නෙහි අරීසවු මෙසේ නුවණින් සලක යි. මිථ්‍යාදෘෂ්ටිහුගේ ලාමක විපාක දිටුදැමියෙහි ම හා සම්පරායෙහි වෙයි. හේ මෙසේ නුවණින් සලකා මිසදිටු හැරපියයි. මිථ්‍යාදෘෂ්ටියෙන් ප්‍රත්‍යවරෝහණ කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මිථ්‍යාසඞ්කල්පයාගේ ලාමක විපාක වනාහි දිටුදැහැමියෙහි ම හා සම්පරායෙහි හා වෙයි. හේ මෙසේ නුවණින් සලකා මිථ්‍යාසඞ්කල්ප හැර පියයි, මිථ්‍යාසඞ්කල්පයෙන් ප්‍රත්‍යවරෝහණ කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මිථ්‍යාවාක්හුගේ ලාමක විපාක වනාහි දිටුදැහැමියෙහි ම හා සම්පරායෙහි හා වෙයි. හේ මෙසේ නුවණින් සලකා මිථ්‍යාවචනය හැර පියයි, මිථ්‍යාවචනයෙන් ප්‍රත්‍යවරෝහණ කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මිථ්‍යාකර්‍මාන්තයාගේ වනාහි ලාමක විපාක දිටුදැහැමියෙහි ම හා සම්පරායෙහි හා වෙයි. හේ මෙසේ නුවණින් සලකා මිථ්‍යාකර්‍මාන්තය හැර පියයි, මිථ්‍යාකර්‍මාන්තයෙන් ප්‍රත්‍යවරෝහණ කෙරෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 428,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාආජීවස්ස ඛො පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරායඤ්චාති සො ඉති පටිසඞ්ඛාය මිච්ඡාආජීවං පජහති. මිච්ඡාආජීවා පච්චොරොහති."
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාවායාමස්ස ඛො පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරායඤ්චාති සො ඉති පටිසඞ්ඛාය මිච්ඡාවායාමං පජහති. මිච්ඡා වායාමා පච්චොරොහති."
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාසතියා ඛො පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරායඤ්චාති සො ඉති පටිසඞ්ඛාය මිච්ඡාසතිං පජහති. මිච්ඡාසතියා පච්චොරොහති."
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාසමාධිස්ස ඛො පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරායඤ්චාති සො ඉති පටිසඞ්ඛාය මිච්ඡාසමාධිං පජහති. මිච්ඡාසමාධිම්හා පච්චොරොහති."
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාඤාණස්ස ඛො පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරායඤ්චාති සො ඉති පටිසඞ්ඛාය මිච්ඡාඤාණං පජහති. මිච්ඡාඤාණා පච්චොරොහති."
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාවිමුත්තියා ඛො පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරායඤ්චාති සො ඉති පටිසඞ්ඛාය මිච්ඡාවිමුත්තිං පජහති. මිච්ඡාවිමුත්තියා පච්චොරොහති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං ඛො බ්රාහ්මණ, අරියස්ස විනයෙ පච්චොරොහණී හොතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අඤ්ඤථා භො ගොතම, බ්රාහ්මණානං පච්චොරොහණී, අඤ්ඤථා ච පන අරියස්ස විනයෙ පච්චොරොහණී හොතීති. ඉමිස්සා ච ඛො භො ගොතම, අරියස්ස විනයෙ පච්චොරොහණියා බ්රාහ්මණානං පච්චොරොහණී කලං නාග්ඝති සොළසිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අභික්කන්තං භො ගොතම -පෙ- උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මිථ්‍යාආජීවයාගේ වනාහි ලාමකවිපාක දිටුදැහැමියෙහි ම හා සම්පරායෙහි හා වෙයි. හේ මෙසේ නුවණින් සලකා මිථ්‍යාආජීවය හැර පියයි, මිථ්‍යාආජීවයෙන් ප්‍රත්‍යවරෝහණ කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මිථ්‍යාව්‍යායාමයාගේ වනාහි ලාමක විපාක දිටුදැහැමියෙහි ම හා සම්පරායෙහි හා වෙයි. හේ මෙසේ නුවණින් සලකා මිථ්‍යාව්‍යායාමය හැර පියයි, මිථ්‍යාව්‍යායාමයෙන් ප්‍රත්‍යවරෝහණ කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මිථ්‍යාස්මෘතිහුගේ වනාහි ලාමක විපාක දිටුදැහැමියෙහි ම හා සම්පරායෙහි හා වෙයි. හේ මෙසේ නුවණින් සලකා මිථ්‍යාස්මෘතිය හැර පියයි, මිථ්‍යාස්මෘතියෙන් ප්‍රත්‍යවරෝහණ කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මිථ්‍යාසමාධිහුගේ වනාහි ලාමක විපාක දිටුදැහැමියෙහි ම හා සම්පරායෙහි හා වෙයි. හේ මෙසේ නුවණින් සලකා මිථ්‍යාසමාධි හැර පියයි, මිථ්‍යාසමාධියෙන් ප්‍රත්‍යවරෝහණ කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මිථ්‍යාඥානයාගේ වනාහි ලාමක විපාක දිටුදැහැමියෙහි ම හා සම්පරායෙහි හා වෙයි. හේ මෙසේ නුවණින් සලකා මිථ්‍යාඥානය හැර පියයි, මිථ්‍යාඥානයෙන් ප්‍රත්‍යවරෝහණ කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මිථ්‍යාවිමුක්තිහුගේ වනාහි ලාමක විපාක දිටුදැහැමියෙහි ම හා සම්පරායෙහි හා වෙයි. හේ මෙසේ නුවණින් සලකා මිථ්‍යාවිමුක්ති හැරපියා මිථ්‍යාවිමුක්තියෙන් ප්‍රත්‍යවරෝහණ කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බ්‍රාහ්මණය, මෙසේ වනාහි ආර්‍ය්‍යවිනයෙහි ප්‍රත්‍යවරෝහණ වේ යයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "භවත් ගෞතමයෙනි, බ්‍රාහ්මණයන්ගේ ප්‍රත්‍යවරෝහණ අන් පරිද්දෙකින් වෙයි. ආර්‍ය්‍යවිනයෙහි ප්‍රත්‍යවරෝහණය ද අන් පරිද්දෙකින් වේ යයි. භවත් ගෞතමයෙනි, බ්‍රාහ්මණයන්ගේ ප්‍රත්‍යවරෝහණය මේ ආර්‍ය්‍යවිනයෙහි ප්‍රත්‍යවරෝහණයාගේ සොළොස්වන කලා ද නො අගනේ යයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "භවත් ගෞතමයෙනි, ඉතා කාන්ත ය ... භවත් ගෞතමයන් වහන්සේ අද පටන් මා දිවිහිමියෙන් සරණ ගිය උවසුවකු කොට දරන සේක්වා යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 430,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 8.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "දුතිය පච්චොරොහණී සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "අරියං ඛො භික්ඛවෙ පච්චොරොහණිං දෙසිස්සාමි. තං සුණාථ -පෙ- කතමා ච භික්ඛවෙ අරියා පච්චොරොහණී:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ අරියසාවකො ඉති පටිසංචික්ඛති: “මිච්ඡාදිට්ඨියා ඛො පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ, අභිසම්පරායඤ්චා”ති, සො ඉති පටිසඞ්ඛාය මිච්ඡාදිට්ඨිං පජහති, මිච්ඡාදිට්ඨියා පච්චොරොහති. මිච්ඡාසඞ්කප්පස්ස ඛො පාපකො විපාකො -පෙ- මිච්ඡාවාචාය ඛො පාපකො විපාකො -පෙ- මිච්ඡාකම්මන්තස්ස ඛො පාපකො විපාකො -පෙ- මිච්ඡාආජීවස්ස ඛො පාපකො -පෙ- මිච්ඡාවායාමස්ස ඛො පාපකො විපාකො -පෙ- මිච්ඡාසතියා ඛො පාපකො විපාකො -පෙ- මිච්ඡාසමාධිස්ස ඛො පාපකො විපාකො -පෙ- මිච්ඡාඤාණස්ස ඛො පාපකො විපාකො -පෙ- මිච්ඡාවිමුත්තියා ඛො පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරායඤ්චාති සො ඉති පටිසඞ්ඛාය මිච්ඡාවිමුත්තිං පජහති. මිච්ඡාවිමුත්තියා පච්චොරොහති. අයං වුච්චති භික්ඛවෙ අරියා පච්චොරොහණීති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 9.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "පුබ්බඞ්ගම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සුරියස්ස භික්ඛවෙ උදයතො එතං පුබ්බඞ්ගමං එතං පුබ්බනිමිත්තං යදිදං අරුණග්ගං. එවමෙව ඛො භික්ඛවෙ කුසලානං ධම්මානං එතං පුබ්බඞ්ගමං, එතං පුබ්බනිමිත්තං, යදිදං සම්මාදිට්ඨි. සම්මාදිට්ඨිස්ස{1} භික්ඛවෙ සම්මා සඞ්කප්පො පහොති. සම්මාසඞ්කප්පස්ස සම්මාවාචා පහොති. සම්මාවාචස්ස සම්මාකම්මන්තො පහොති. සම්මාකම්මන්තස්ස සම්මාආජීවො පහොති. සම්මාආජීවස්ස සම්මාවායාමො පහොති. සම්මාවායාමස්ස සම්මාසති පහොති. සම්මාසතිස්ස සම්මාසමාධි පහොති. සම්මාසමාධිස්ස සම්මාඤාණං පහොති. සම්මාඤාණිස්ස සම්මාවිමුත්ති පහොතීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සම්මාදිට්ඨිකස්ස – මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතිය පච්චෝරෝහණ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට ආර්‍ය්‍යප්‍රත්‍යවරෝහණය දෙසන්නෙමි. එය අසවු ... මහණෙනි, ආර්‍ය්‍යප්‍රත්‍යවරෝහණය කවර යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි අරීසවු මෙසේ නුවණින් සලක යි: මිථ්‍යාදෘෂ්ටියගේ වනාහි ලාමක විපාක දිටුදැමියෙහි ම හා සම්පරායෙහි හා වෙයි. හේ මෙසේ නුවණින් සලකා මිසදිටු දුරු කෙරෙයි. මිථ්‍යාදෘෂ්ටියෙන් ප්‍රත්‍යවරෝහණය කෙරෙයි. මිථ්‍යාසඞ්කල්පයාගේ වනාහි ලාමක විපාක ... මිථ්‍යාවාක්හුගේ වනාහි ලාමක විපාක ... මිථ්‍යාකර්‍මාන්තයාගේ වනාහි ලාමක විපාක ... මිථ්‍යාආජීවයාගේ වනාහි ලාමක විපාක ... මිථ්‍යාව්‍යායාමයාගේ වනාහි ලාමක විපාක ... මිථ්‍යාස්මෘතියගේ වනාහි ලාමක විපාක ... මිථ්‍යාසමාධිහුගේ වනාහි ලාමක විපාක ... මිථ්‍යාඤාණයාගේ වනාහි ලාමක විපාක ... මිථ්‍යාවිමුක්තිගේ වනාහි ලාමක විපාක දිටුදැමියෙහි හා සම්පරායෙහි හා වෙයි. හේ මෙසේ නුවණින් සලකා මිථ්‍යාවිමුක්තිය හැරපියයි. මිථ්‍යාවිමුක්තියෙන් ප්‍රත්‍යවරෝහණය යි. මහණෙනි, ආර්‍ය්‍යවිනයෙහි ප්‍රත්‍යවරෝහණය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පුබ්බඞ්ගම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, උදාවන හිරුහට තෙල පූර්‍වඞ්ගම වෙයි, තෙල පූර්‍වනිමිත්ත වෙයි, එනම් අරුණු නැඟීම යි. මහණෙනි, එ පරිදිම කුශල ධර්‍මයනට තෙල පූර්‍වඞ්ගම වෙයි, තෙල පූර්‍ව නිමිත්ත වෙයි, එනම් සම්දිට්හයි. මහණෙනි, සම්‍යක්දෘෂ්ටි ඇත්තහුට සම්‍යක්සඞ්කල්පය පොහෝනේ වෙයි. සම්‍යක්සඞ්කල්ප ඇත්තහුට සම්‍යක්වාක් පොහෝනේ වෙයි. සම්‍යක්වාක් ඇත්තහුට සම්‍යක්කර්‍මාන්ත පොහෝනේ වෙයි. සම්‍යක්කර්‍මාන්ත ඇත්තහුට සම්‍යක් ආජීවය පොහෝනේ වෙයි. සම්‍යක්ආජීවීහට ඇත්තහුට සම්‍යක්ව්‍යායාමය පොහෝනේ වෙයි. සම්‍යක්ව්‍යායාමය ඇත්තහුට සම්‍යක්ස්මෘතිය පොහෝනේ වෙයි. සම්‍යක්ස්මෘතිය ඇත්තහුට සම්‍යක්සමාධිය පොහෝනේ වෙයි. සම්‍යක්සමාධිය ඇත්තහුට සම්‍යක්ඥානය පොහෝනේ වෙයි. සම්‍යක්ඥානීහට සම්‍යක්විමුක්තිය පොහෝනේ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 432,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 2. 10.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "ආසවක්ඛය සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දස ඉමෙ භික්ඛවෙ ධම්මා භාවිතා බහුලීකතා ආසවානං ඛයාය සංවත්තන්ති. කතමෙ දස:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සම්මාදිට්ඨි, සම්මාසඞ්කප්පො, සම්මාවාචා, සම්මාකම්මන්තො, සම්මාආජීවො, සම්මා වායාමො, සම්මාසති, සම්මාසමාධි, සම්මාඤාණං, සම්මාවිමුත්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ දස ධම්මා භාවිතා බහුලීකතා ආසවානං ඛයාය සංවත්තන්තීති."
                    },
                    {
                        "type": "centered",
                        "text": "පච්චොරොහණීවග්ගො දුතියො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තස්සුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "තයො අධම්මා අජිතො සඞ්ගාරවො ච ඔරිමං\nද්වෙ චෙව පච්චොරොහණී පුබ්බඞ්ගමං ආසවො චාති.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "10. 3. 2. 10.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආසවක්ඛය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මේ දශධර්‍ම කෙනෙක් භාවිත බහුලීකෘත වූහු ආස්‍රවක්‍ෂය සඳහා වැටෙත්. කවර දශ කෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සම්මාදිට්ඨි ය, සම්මාසඞ්කප්ප ය, සම්මාවාචාය, සම්මාකම්මන්තය, සම්මාආජීව ය, සම්මාවායාම ය, සම්මාසතිය ය, සම්මාසමාධි ය, සම්මාඤාණය, සම්මාවිමුත්ති යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ දසදහම් භාවිතා බහුලීකෘත වූහු ආස්‍රවක්‍ෂය පිණිස වැටෙතැයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "දෙවන පච්චෝරෝහණ වර්‍ග යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි උද්දානය:**",
                        "type": "unindented"
                    },
                    {
                        "text": "අධර්‍ම සූත්‍ර තුනෙක, අජිත සූත්‍රය, සඞ්ගාරව සූත්‍රය, ඔරිම සූත්‍රය, පච්චෝරෝහණ සූත්‍ර දෙකය, පුබ්බඞ්ගම සූත්‍රය ආසව සූත්‍රයදැයි යන දසයයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 434,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. පරිසුද්ධවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 1.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "පඨම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දස ඉමෙ භික්ඛවෙ ධම්මා පරිසුද්ධා පරියොදාතා නාඤ්ඤත්ර සුගතවිනයා කතමෙ දස:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සම්මාදිට්ඨි සම්මාසඞ්කප්පො සම්මාවාචා සම්මාකම්මන්තො සම්මාආජීවො සම්මාවායාමො සම්මාසති සම්මාසමාධි සම්මාඤාණං සම්මාවිමුත්ති. ඉමෙ ඛො භික්ඛවෙ දසධම්මා පරිසුද්ධා පරියොදාතා නාඤ්ඤත්ර සුගතවිනයාති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 2.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "දුතිය සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දස ඉමෙ භික්ඛවෙ ධම්මා අනුප්පන්නා උප්පජ්ජන්ති, නාඤ්ඤත්ර සුගතවිනයා. කතමෙ දස: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. ඉමෙ ඛො භික්ඛවෙ දසධම්මා අනුප්පන්නා උප්පජ්ජන්ති නාඤ්ඤත්ර සුගතවිනයාති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 3.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "තතිය සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දස ඉමෙ භික්ඛවෙ ධම්මා මහප්ඵලා මහානිසංසා නාඤ්ඤත්ර සුගතවිනයා. කතමෙ දස: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. ඉමෙ ඛො භික්ඛවෙ දස ධම්මා මහප්ඵලා මහානිසංසා නාඤ්ඤත්ර සුගතවිනයාති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 4.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "චතුත්ථ සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දස ඉමෙ භික්ඛවෙ ධම්මා රාගවිනයපරියොසානා හොන්ති, දොසවිනයපරියොසානා හොන්ති, මොහවිනයපරියොසානා හොන්ති, නාඤ්ඤත්ර සුගතවිනයා. කතමෙ දස: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. ඉමෙ ඛො භික්ඛවෙ දසධම්මා රාගවිනයපරියොසානා හොන්ති, දොසවිනයපරියොසානා හොන්ති, මොහවිනයපරියොසානා හොන්ති, නාඤ්ඤත්ර සුගතවිනයාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "3. පරිශුද්ධ වර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ප්‍රථම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, සුගත් විනය හැර අන් තන්හි මෙ දස දහම්හි පරිශුද්ධ පර්‍ය්‍යවදාත නො වෙත්. කවර දස කෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සම්මාදිට්ඨි ය, සම්මාසඞ්කප්ප ය, සම්මාවාචාය, සම්මාකම්මන්තය, සම්මාආජීව ය, සම්මාවායාම ය, සම්මාසති ය, සම්මාසමාධි ය, සම්මාඤාණය, සම්මා විමුත්ති යි. මහණෙනි, සුගත් විනය හැර අන් තන්හි මෙ දස දහම්හු පරිශුද්ධ පර්‍ය්‍යවදාත නො වෙතැයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ද්වේතීය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, නූපන් මෙ දස දහම්හු සුගත් විනය හැර අන් තැනක නො උපදනාහ. කවර දස දහමෙක යත්: සම්මාදිට්ඨි ... සම්මාවිමුක්තිය. මහණෙනි, නූපන් මෙ දසදහම්හු සුගත් විනය හැර අන් තන්හි නූපදනාහ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තෘතීය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, සුගත් විනය හැර අන් තැනක මෙ දසදහම්හු මහත්ඵල මහානෘසංස නො වෙත්. කවර දස දහමෙක් යත්: සම්මාදිට්ඨි ය ... සම්මාවිමුක්ති යි. මහණෙනි, සුගත් විනය හැර අන් තැන්හි මෙ දසදහම්හු මහත්ඵල මහා නෘසංස නො වෙත් යී.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "චතුර්‍ත්‍ථ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, සුගත් විනය හැර අන් තැනක මෙ දසදහම්හු රාගවිනය පර්‍ය්‍යවසාන කොට ඇති නො වෙත්. ද්වේෂ විනය පර්‍ය්‍යවසාන කොට ඇති නො වෙත්. මෝහවිනය පර්‍ය්‍යවසාන කොට ඇති නො වෙත්. කවර දස දහමෙක යත්: සම්මාදිට්ඨි ය ... සම්මාවිමුක්ති යි. මහණෙනි, සුගත් විනය හැර අන් තන්හි මෙ දසදහම්හු රාගවිනය පර්‍ය්‍යවසාන කොට, ඇති නො වෙත්. ද්වේෂ විනය පර්‍ය්‍යවසාන කොට, ඇති නො වෙත්. මෝහවිනය පර්‍ය්‍යවසාන කොට, ඇති නො වෙත් යී.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 436,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 5.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "පඤ්චම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දස ඉමෙ භික්ඛවෙ ධම්මා එකන්තනිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තන්ති. නාඤ්ඤත්ර සුගතවිනයා. කතමෙ දස: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති, ඉමෙ ඛො භික්ඛවෙ දසධම්මා එකන්තනිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තන්ති, නාඤ්ඤත්ර සුගතවිනයාති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 6.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "ඡට්ඨම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දස ඉමෙ භික්ඛවෙ ධම්මා භාවිතා බහුලීකතා අනුප්පන්නා උප්පජ්ජන්ති, නාඤ්ඤත්ර සුගතවිනයා, කතමෙ දස: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. ඉමෙ ඛො භික්ඛවෙ දසධම්මා භාවිතා බහුලීකතා අනුප්පන්නා උප්පජ්ජන්ති, නාඤ්ඤත්ර සුගතවිනයාති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 7.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "සත්තම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දස ඉමෙ භික්ඛවෙ ධම්මා භාවිතා බහුලීකතා මහප්ඵලා හොන්ති මහානිසංසා නාඤ්ඤත්ර සුගතවිනයා. කතමෙ දස: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. ඉමෙ ඛො භික්ඛවෙ දසධම්මා භාවිතා බහුලීකතා මහප්ඵලා හොන්ති මහානිසංසා, නාඤ්ඤත්ර සුගතවිනයාති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 8.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "අට්ඨම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දස ඉමෙ භික්ඛවෙ ධම්මා භාවිතා බහුලීකතා රාගවිනයපරියොසානා හොන්ති, දොසවිනයපරියොසානා හොන්ති, මොහවිනයපරියොසානා හොන්ති, නාඤ්ඤත්ර සුගතවිනයා කතමෙ දස: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. ඉමෙ ඛො භික්ඛවෙ දසධම්මා භාවිතා බහුලීකතා රාගවිනයපරියොසානා හොන්ති, දොසවිනයපරියොසානා හොන්ති, මොහවිනයරියොසානා හොන්ති, නාඤ්ඤත්ර සුගතවිනයාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පඤ්චම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, සුගත් විනය හැර අන් තන්හි මෙ දසදහම්හු ඒකාන්ත නිර්වේදය පිණිස විරාගය පිණිස නිරෝධය පිණිස ව්‍යුපසමය පිණිස අභිඥා පිණිස සම්බෝධිය පිණිස නිර්‍වාණය පිණිස නො වැටෙත්. කවර දස දහමෙකයත්: සම්මාදිට්ඨිය ... සම්මාවිමුත්ති යි. මහණෙනි, සුගත් විනය හැර අන් තැනෙක මෙ දසදහම්හු ඒකාන්ත නිර්වේදය පිණිස විරාගය පිණිස නිරෝධය පිණිස ව්‍යුපශමය පිණිස අභිඥා පිණිස සම්බෝධිය පිණිස නිර්‍වාණය පිණිස නො වැටෙති යී.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ෂෂ්ඨ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, සුගත් විනය හැර අන් තැනෙක නූපන් මෙ දසදහම්හු භාවිත බහුලීකෘත ව නො උපදනාහ. කවර දස දහමෙක යත්: සම්මාදිට්ඨිය ... සම්මාවිමුත්ති යි. මහණෙනි, සුගත් විනය හැර අන් තන්හි නූපන් මෙ දසදහම්හු භාවිත ව බහුලීකෘත ව නූපදනාහ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සප්තම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, සුගත් විනය හැර අන් තැනෙක මෙ දසදහම්හු භාවිත ව බහුලීකෘත ව මහත්ඵල මහානෘශංස නො වෙත්. කවර දසදහමෙක යත්: සම්මාදිට්ඨි ය ... සම්මාවිමුත්ති යි. මහණෙනි, සුගත් විනය හැර අන් තැනෙක මෙ දසදහම්හු භාවිත ව බහුලීකෘත ව මහත්ඵල මහානෘශංස නො වෙති යී.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අෂ්ටම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, සුගත් විනය හැර අන් තැනෙක භාවිත බහුලීකෘත මෙ දසදහම්හු රාගවිනය පර්‍ය්‍යවසාන කොට ඇති නො වෙත්. ද්වේෂවිනය පර්‍ය්‍යවසාන කොට ඇති නො වෙත්. මෝහවිනය පර්‍ය්‍යවසාන කොට ඇති නො වෙත්. කවර දසදහමෙක යත්: සම්මාදිට්ඨි ය ... සම්මාවිමුත්ති යි. මහණෙනි, සුගත් විනය හැර අන් තැනක භාවිත බහුලීකෘත මෙ දසදහම්හු රාගවිනය පර්‍ය්‍යාවසාන කොට ඇති නො වෙත්. ද්වේෂවිනය පර්‍ය්‍යවසාන කොට ඇති නො වෙත්. මෝහවිනය පර්‍ය්‍යවසාන කොට ඇති නොවෙත්.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 438,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 9.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "නවම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දස ඉමෙ භික්ඛවෙ ධම්මා භාවිතා ධම්මා බහුලීකතා එකන්තනිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තන්ති, නාඤ්ඤත්ර සුගතවිනයා. කතමෙ දස: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. ඉමෙ ඛො භික්ඛවෙ දසධම්මා භාවිතා බහුලීකතා එකන්තනිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තන්ති, නාඤ්ඤත්ර සුගතවිනයාති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 10.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "දසම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දස ඉමෙ භික්ඛවෙ මිච්ඡත්තා. කතමෙ දස: මිච්ඡාදිට්ඨි මිච්ඡාසඞ්කප්පො මිච්ඡාවාචා මිච්ඡාකම්මන්තො මිච්ඡාආජීවො මිච්ඡාවායාමො මිච්ඡාසති මිච්ඡාසමාධි මිච්ඡාඤාණං මිච්ඡාවිමුත්ති. ඉමෙ ඛො භික්ඛවෙ දස මිච්ඡත්තාති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 11.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "එකාදසම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දස ඉමෙ භික්ඛවෙ සම්මත්තා. කතමෙ දස: සම්මාදිට්ඨි සම්මා සඞ්කප්පො සම්මාවාචා සම්මාකම්මන්තො සම්මාආජීවො සම්මාවායාමො සම්මාසති සම්මාසමාධි සම්මාඤාණං සම්මාවිමුත්ති. ඉමෙ ඛො භික්ඛවෙ දස සම්මත්තාති."
                    },
                    {
                        "type": "centered",
                        "text": "පරිසුද්ධවග්ගො තතියො.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නවම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, සුගත් විනය හැර අන් තැනෙක භාවිත බහුලීකෘත මෙ දසදහම්හු ඒකාන්ත නිර්වේදය පිණිස විරාගය පිණිස නිරෝධය පිණිස ව්‍යුපශමය පිණිස අභිඥා පිණිස සම්බෝධිය පිණිස නිර්‍වාණය පිණිස නො වැටෙත්. කවර දසදහමෙක යත්: සම්මාදිට්ඨි ය ... සම්මාවිමුක්ති යි. මහණෙනි, සුගත් විනය හැර අන් තැනෙක භාවිත බහුලීකෘත මෙ දසදහම්හු ඒකාන්ත නිර්වේදය පිණිස විරාගය පිණිස නිරෝධය පිණිස ව්‍යුපශමය පිණිස අභිඥා පිණිස සම්බෝධිය පිණිස නිර්‍වාණය පිණිස නො වැටෙති යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දසම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මේ මිථ්‍යාත්‍ව දසයෙක. කවර දසයෙක යත්: මිච්ඡාදිට්ඨි ය, මිච්ඡාසඞ්කප්ප ය, මිච්ඡාවාචා ය, මිච්ඡාකම්මන්ත ය, මිච්ඡාආජීව ය, මිච්ඡාවායාම ය, මිච්ඡාසති ය, මිච්ඡාසමාධි ය, මිච්ඡාඤාණ ය, මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ දස මිථ්‍යාත්‍ව යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 3. 11.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඒකාදශ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මේ සම්‍යක්ත්‍ව දසයෙක. කවර දසයෙක යත්: සම්මාදිට්ඨි ය, සම්මාසඞ්කප්ප ය, සම්මාවාචා ය, සම්මාකම්මන්ත ය, සම්මාආජීව ය, සම්මාවායාම ය, සම්මාසති ය, සම්මාසමාධි ය, සම්මාඤාණ ය, සම්මාවිමුත්ති යි. මහණෙනි, මේ දස සම්‍යක්ත්‍ව යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙවැනි පරිසුද්ධවර්‍ග යි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 440,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "4. සාධුවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 1.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "සාධු සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සාධුඤ්ච වො භික්ඛවෙ දෙසිස්සාමි, අසාධුඤ්ච. තං සුණාථ සාධුකං මනසිකරොථ භාසිස්සාමීති. එවම්භන්තෙති ඛො තෙ භික්ඛු භගවතො පච්චස්සොසුං. භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ ආසාධුං{1}: මිච්ඡාදිට්ඨි මිච්ඡාසඞ්කප්පො මිච්ඡාවාචා මිච්ඡාකම්මන්තො මිච්ඡාආජීවො මිච්ඡාවායාමො මිච්ඡාසති මිච්ඡාසමාධි මිච්ඡාඤාණං විච්ඡාවිමුත්ති. ඉදං වුච්චති භික්ඛවෙ අසාධුං{1}."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ සාධුං{1}: සම්මාදිට්ඨි සම්මාසඞ්කප්පො සම්මාවාචා සම්මාකම්මන්තො සම්මාආජීවො සම්මාවායාමො සම්මාසති සම්මාසමාධි සම්මාඤාණං සම්මාවිමුත්ති. ඉදං වුච්චති භික්ඛවෙ සාධුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 2.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "අරියධම්ම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "අරියධම්මඤ්ච වො භික්ඛවෙ දෙසිස්සාමි{2} අනරියධම්මඤ්ච. තං සුණාථ සාධුකං මනසිකරොථ -පෙ- කතමො ච භික්ඛවෙ අනරියො ධම්මො. මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ අනරියො ධම්මො. කතමො ච භික්ඛවෙ අරියො ධම්මො: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ අරියො ධම්මොති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 3.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "කුසල සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "කුසලඤ්ච{3} වො භික්ඛවෙ දෙසිස්සාමි{2} අකුසලඤ්ච{4}. තං සුණාථ -පෙ- කතමඤ්ච භික්ඛවෙ අකුසලං: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. ඉදං වුච්චති භික්ඛවෙ අකුසලං. කතමඤ්ච භික්ඛවෙ කුසලං: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. ඉදං වුච්චති භික්ඛවෙ කුසලන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අසාධු – මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "2. දෙසෙස්සාමි – මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "3. අකුසලඤ්ච – මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "4. කුසලඤ්ච – මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "4. සාධු වර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සාධු සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට සාධුධර්‍මය හා අසාධු ධර්‍මය හා දෙසන්නෙමි. එ අසවු, මොනොවට මෙනෙහි කරවු කියන්නෙමි යි. එසේය වහන්සැයි ඒ මහණහු භාග්‍යවත්නට පිළිවදන් ඇස් වූහ. භාග්‍යවත්හු තෙල වදාළ හ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "මහණෙනි, අසාධු ධර්‍මය කවර: මිච්ඡාදිට්ඨි ය, මිච්ඡාසඞ්කප්ප ය, මිච්ඡාවාචා ය, මිච්ඡාකම්මන්ත ය, මිච්ඡාආජීව ය, මිච්ඡාවායාම ය, මිච්ඡාසති ය, මිච්ඡාසමාධි ය, මිච්ඡාඤාණ ය, මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ අසාධු ධර්‍මය යි කියනු ලැබේ."
                    },
                    {
                        "text": "මහණෙනි, සාධුධර්‍මය කවර: සම්මාදිට්ඨි ය, සම්මාසඞ්කප්පය, සම්මාවාචා ය, සම්මාකම්මන්ත ය, සම්මාආජීව ය, සම්මාවායාම ය, සම්මාසති ය, සම්මාසමාධි ය, සම්මාඤාණ ය, සම්මාවිමුත්ති යි. මහණෙනි, මේ සාධුධර්‍ම යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අරියධම්ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට ආර්‍ය්‍ය ධර්‍මය හා අනාර්‍ය්‍ය ධර්‍මය හා දෙසන්නෙමි. එ අසවු මොනොවට මෙනෙහි කරවු ... මහණෙනි, අනාර්‍ය්‍යධර්‍මය කවර: මිච්ඡාදිට්ඨි ය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ අනාර්‍ය්‍යධර්‍ම යි කියනු ලැබේ. මහණෙනි, ආර්‍ය්‍යධර්‍ම කවර: සම්මාදිට්ඨි ය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ ආර්‍ය්‍යධර්‍ම යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කුශල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට කුශල හා අකුශල හා දෙසන්නෙමි. එ අසවු ... මහණෙනි, අකුශල කවර යත්: මිච්ඡාදිට්ඨි ය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ අකුශල යි කියනු ලැබේ. මහණෙනි, කුශල කවර යත්: සම්මාදිට්ඨි ය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ කුශල යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 442,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 4.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "අත්ථ සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථඤ්ච වො භික්ඛවෙ දෙසිස්සාමි අනත්ථඤ්ච. තං සුණාථ -පෙ- කතමො ච භික්ඛවෙ අනත්ථො: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ අනත්ථො. කතමො ච භික්ඛවෙ අත්ථො: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ අත්ථොති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 5.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "ධම්ම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ධම්මඤ්ච වො භික්ඛවෙ දෙසිස්සාමි, අධම්මඤ්ච. තං සුණාථ -පෙ- කතමො ච භික්ඛවෙ අධම්මො: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ අධම්මො. කතමො ච භික්ඛවෙ ධම්මො: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ ධම්මොති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 6.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "සාසව සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සාසවඤ්ච වො භික්ඛවෙ ධම්මං දෙසිස්සාමි, අනාසවඤ්ච. තං සුණාථ -පෙ- කතමො ච භික්ඛවෙ සාසවො ධම්මො: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ සාසවො ධම්මො. කතමො ච භික්ඛවෙ අනාසවො ධම්මො: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ අනාසවො ධම්මොති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 7.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "සාවජ්ජ සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සාවජ්ජඤ්ච ඛො භික්ඛවෙ ධම්මං දෙසිස්සාමි, අනවජ්ජඤ්ච. තං සුණාථ -පෙ- කතමො ච භික්ඛවෙ සාවජ්ජො ධම්මො: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ සාවජ්ජො ධම්මො. කතමො ච භික්ඛවෙ අනවජ්ජො ධම්මො: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ අනවජ්ජො ධම්මොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අත්‍ථ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට අර්‍ත්‍ථය හා අනර්‍ත්‍ථය දෙසන්නෙමි. එ අසවු ... මහණෙනි, අනර්‍ත්‍ථය කවර: මිච්ඡාදිට්ඨි ය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ අනර්‍ත්‍ථයි කියනු ලැබේ. මහණෙනි, අර්‍ත්‍ථය කවර: සම්මාදිට්ඨිය ... සම්මාවිමුත්තිය යි. මහණෙනි, මේ අර්‍ත්‍ථය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ධම්ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට ධර්‍මය හා අධර්‍මය හා දෙසමි. එ අසවු ... මහණෙනි, අධර්‍මය කවර: මිච්ඡාදිට්ඨි ය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ අධර්‍ම යි කියනු ලැබේ. මහණෙනි, ධර්‍මය කවර: සම්මාදිට්ඨි ය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ ධර්‍ම යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සාසව සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට සාස්‍රව ධර්‍මය හා අනාස්‍රවධර්‍ම හා දෙසමි. එ අසවු ... මහණෙනි, සාස්‍රවධර්‍ම කවර යත්: මිච්ඡාදිට්ඨිය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ සාස්‍රවධර්‍ම යි කියනු ලැබේ. මහණෙනි, අනාස්‍රවධර්‍ම කවර යත්: සම්මාදිට්ඨිය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ අනාස්‍රව ධර්‍ම යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සාවජ්ජ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, සාවද්‍යධර්‍මය හා අනවද්‍යධර්‍ම හා දෙසන්නෙමි. එ අසවු ... මහණෙනි, සාවද්‍යධර්‍ම කවර: මිච්ඡාදිට්ඨි ය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ සාවද්‍යධර්‍ම යි කියනු ලැබේ. මහණෙනි, අනවද්‍යධර්‍ම කවර: සම්මාදිට්ඨි ය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ අනවද්‍යධර්‍ම ය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 444,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 8.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "තපනීය සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "තපනීයඤ්ච වො භික්ඛවෙ ධම්මං දෙසිස්සාමි, අතපනීයඤ්ච. තං සුණාථ -පෙ- කතමො ච භික්ඛවෙ තපනීයො ධම්මො: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ කතමො ච තපනීයො ධම්මො. කතමො ච භික්ඛවෙ අතපනීයො ධම්මො: සම්මා දිට්ඨි -පෙ- සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ අතපනීයො ධම්මොති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 9.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "ආචයගාමී සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ආචයගාමිඤ්ච වො භික්ඛවෙ දෙසිස්සාමි, අපචයගාමිඤ්ච. තං සුණාථ -පෙ- කතමො ච භික්ඛවෙ ආචයගාමී ධම්මො: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ ආචයගාමී ධම්මො. කතමො ච භික්ඛවෙ අපචයගාමී ධම්මො: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ අපචයගාමී ධම්මොති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 10.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "දුක්ඛුද්රය සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දුක්ඛුද්රයඤ්ච වො භික්ඛවෙ ධම්මං දෙසිස්සාමි, සුඛුද්රයඤ්ච. තං සුණාථ -පෙ- කතමො ච භික්ඛවෙ දුක්ඛුද්රයො ධම්මො: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ දුක්ඛුද්රයො ධම්මො. කතමො ච භික්ඛවෙ සුඛුද්රයො ධම්මො: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ සුඛුද්රයො ධම්මොති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 11.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "දුක්ඛවිපාක සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දුක්ඛවිපාකඤ්ච වො භික්ඛවෙ ධම්මං දෙසිස්සාමි, සුඛවිපාකඤ්ච, තං සුණාථ -පෙ- කතමො ච භික්ඛවෙ දුක්ඛවිපාකො ධම්මො: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ දුක්ඛවිපාකො ධම්මො. කතමො ච භික්ඛවෙ සුඛ විපාකො ධම්මො: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ සුඛවිපාකො ධම්මොති."
                    },
                    {
                        "type": "centered",
                        "text": "සාධුවග්ගො චතුත්ථො.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තපනීය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට තපනීයධර්‍ම හා අතපනීයධර්‍ම හා දෙසමි. එ අසවු ... මහණෙනි, තපනීයධර්‍ම කවර: මිච්ඡාදිට්ඨි ය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ තපනීයධර්‍ම යි කියනු ලැබේ. මහණෙනි, අතපනීයධර්‍ම කවර: සම්මාදිට්ඨි ය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ අතපනීයධර්‍ම යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආචයගාමී සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට ආචයගාමීධර්‍ම හා අපචයගාමීධර්‍ම හා දෙසමි. එ අසවු ... මහණෙනි, ආචයගාමීධර්‍ම කවර: මිච්ඡාදිට්ඨි ය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ ආචයගාමීධර්‍ම යි කියනු ලැබේ. මහණෙනි, අපචයගාමී ධර්‍ම කවර: සම්මාදිට්ඨි ය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ අපචයගාමී ධර්‍ම යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුක්ඛුද්‍රය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට දුක් උදාකරන ධර්‍ම හා සුව උදාකරන ධර්‍ම හා දෙසමි. එ අසවු ... මහණෙනි, දුක් උදාකරන ධර්‍ම කවර: මිච්ඡාදිට්ඨි ය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ දුක් උදාකරන ධර්‍මයි කියනු ලැබේ. මහණෙනි, සුව උදාකරන ධර්‍ම කවර: සම්මාදිට්ඨි ය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ සුව උදාකරන ධර්‍ම යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 4. 11.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුක්ඛවිපාක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, දුක්ඛවිපාකධර්‍මය හා සුඛවිපාක ධර්‍මය දෙසමි. එ අසවු ... මහණෙනි, දුක්ඛවිපාකධර්‍මය කවර: මිච්ඡාදිට්ඨි ය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ දුක්ඛවිපාකධර්‍ම යි කියනු ලැබේ. මහණෙනි, සුඛ විපාකධර්‍ම කවර: සම්මාදිට්ඨි ය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ සුඛ විපාක ධර්‍ම යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සතරවැනි සාධුවර්‍ග යි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 446,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "5. අරියවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 1.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "අරියමග්ග සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "අරියමග්ගඤ්ච වො භික්ඛවෙ{1} දෙසිස්සාමි, අනරියමග්ගඤ්ච. තං සුණාථ -පෙ- කතමො ච භික්ඛවෙ අනරියමග්ගො: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ අනරියො මග්ගො. කතමො ච භික්ඛවෙ අරියො මග්ගො: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ අරියො මග්ගොති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 2.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "සුක්කමග්ග සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සුක්කමග්ගඤ්ච{2} වො භික්ඛවෙ{1} දෙසිස්සාමි කණ්හමග්ගඤ්ච{3}. කතමො ච භික්ඛවෙ කණ්හමග්ගො: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ කණ්හමග්ගො. කතමො ච භික්ඛවෙ සුක්කමග්ගො: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ සුක්කමග්ගොති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 3.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "සද්ධම්ම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සද්ධම්මඤ්ච වො භික්ඛවෙ දෙසිස්සාමි, අසද්ධම්මඤ්ච. තං සුණාථ -පෙ- කතමො ච භික්ඛවෙ අසද්ධම්මො: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ අසද්ධම්මො. කතමො ච භික්ඛවෙ සද්ධම්මො: සම්මාදිට්ඨි -පෙ- අයං වුච්චති භික්ඛවෙ සද්ධම්මොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. භික්ඛවෙ ධම්මං – මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "2. සුක්කමග්ගඤ්ච – මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "3. කණ්හමග්ගඤ්ච – මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "5. අරිය වර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අරියමග්ග සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට ආර්‍ය්‍යමාර්‍ගය හා අනාර්‍ය්‍යමාර්‍ගය දෙසන්නෙමි. එ අසවු ... මහණෙනි, අනාර්‍ය්‍යමාර්‍ග කවර: මිච්ඡාදිට්ඨිය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ අනාර්‍ය්‍යමාර්‍ග යි කියනු ලැබේ. මහණෙනි, ආර්‍ය්‍යමාර්‍ගය කවර: සම්මාදිට්ඨිය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ ආර්‍ය්‍යමාර්‍ග යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සුක්කමග්ග සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට ශුක්ලමාර්‍ගය හා කෘෂ්ණමාර්‍ගය දෙසන්නෙම්. එ අසවු ... මහණෙනි, කෘෂ්ණමාර්‍ගය කවර: මිච්ඡාදිට්ඨිය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ කෘෂ්ණමාර්‍ග යි කියනු ලැබේ. මහණෙනි, ශුක්ලමාර්‍ගය කවර: සම්මාදිට්ඨිය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ ශුක්ලමාර්‍ග යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සද්ධම්ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට සද්ධර්‍මය හා අසද්ධර්‍මය දෙසන්නෙමි. එ අසවු ... මහණෙනි, අසද්ධර්‍ම කවර: මිච්ඡාදිට්ඨි ය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ අසද්ධර්‍ම යි කියනු ලැබේ. මහණෙනි, සද්ධර්‍ම කවර: සම්මාදිට්ඨි ය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ සද්ධර්‍ම යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 448,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 4.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "සප්පුරිසධම්ම සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සප්පුරිසධම්මඤ්ච වො භික්ඛවෙ දෙසිස්සාමි, අසප්පුරිසධම්මඤ්ච. තං සුණාථ -පෙ- කතමො ච භික්ඛවෙ අසප්පුරිසධම්මො: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ අසප්පුරිසධම්මොති. කතමො ච භික්ඛවෙ සප්පුරිසධම්මො: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ සප්පුරිසධම්මොති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 5.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "උප්පාදෙතබ්බ සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "උප්පාදෙතබ්බඤ්ච වො භික්ඛවෙ ධම්මං දෙසිස්සාමි, න උප්පාදෙතබ්බඤ්ච. තං සුණාථ -පෙ- කතමො ච භික්ඛවෙ න උප්පාදෙතබ්බො ධම්මො: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ න උප්පාදෙතබ්බො ධම්මො. කතමො ච භික්ඛවෙ උප්පාදෙතබ්බො ධම්මො: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ උප්පාදෙතබ්බොධම්මොති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 6.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "ආසෙවිතබ්බ සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ආසෙවිතබ්බඤ්ච වො භික්ඛවෙ ධම්මං දෙසිස්සාමි, න සෙවිතබ්බඤ්ච. තං සුණාථ -පෙ- කතමො ච භික්ඛවෙ න සෙවිතබ්බො ධම්මො: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ න සෙවිතබ්බො ධම්මො. කතමො ච භික්ඛවෙ ආසෙවිතබ්බො ධම්මො: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ ආසෙවිතබ්බො ධම්මොති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 7.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "භාවෙතබ්බ සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "භාවෙතබ්බඤ්ච වො භික්ඛවෙ ධම්මං දෙසිස්සාමි, න භාවෙතබ්බඤ්ච. තං සුණාථ -පෙ- කතමො ච භික්ඛවෙ න භාවෙතබ්බො ධම්මො: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ න භාවෙතබ්බො ධම්මො. කතමො ච භික්ඛවෙ භාවෙතබ්බො ධම්මො: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ භාවෙතබ්බො ධම්මොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සප්පුරිසධම්ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට සත්පුරුෂධර්‍මය හා අසත්පුරුෂධර්‍මය හා දෙසන්නෙමි. එ අසවු ... මහණෙනි, අසත්පුරුෂධර්‍ම කවර: මිච්ඡාදිට්ඨි ය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ අසත්පුරුෂධර්‍ම යි කියනු ලැබේ. මහණෙනි, සත්පුරුෂධර්‍මය කවර: සම්මාදිට්ඨි ය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ සත්පුරුෂධර්‍ම යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උප්පාදෙතබ්බ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට ඉපදවියයුතු දහම් හා නො ඉපදවිය යුතු දහම් හා දෙසන්නෙමි. එ අසවු ... මහණෙනි, නො ඉපදවිය යුතු දහම් කවර: මිච්ඡාදිට්ඨිය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ නො ඉපදවිය යුතු දහමැයි කියනු ලැබේ. මහණෙනි, ඉපදවිය යුතු දහම් කවර: සම්මාදිට්ඨිය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ ඉපදවිය යුතු දහමැ යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආසේවිතබ්බ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට සෙවිය යුතු දහම් හා නො සෙවිය යුතු දහම් හා දෙසන්නෙමි. එ අසවු ... මහණෙනි, නො සෙවිය යුතු දහම් කවර: මිච්ඡාදිට්ඨි ය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ නො සෙවිය යුතු දහමැ යි කියනු ලැබේ. මහණෙනි, සෙවිය යුතු දහම් කවර: සම්මාදිට්ඨි ය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ සෙවිය යුතු දහමැ යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භාවෙතබ්බ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට භාවයිතව්‍යධර්‍ම හා න භාවයිතව්‍යධර්‍ම දෙසමි. එ අසවු ... මහණෙනි, න භාවිතව්‍යධර්‍ම කවර: මිච්ඡාදිට්ඨි ය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ න භාවිතව්‍යධර්‍මයි කියනු ලැබේ. මහණෙනි, භාවයිතව්‍යධර්‍ම කවර: සම්මාදිට්ඨි ය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ භාවිතව්‍යධර්‍ම යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 450,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 8.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "බහුලීකත්තබ්බ සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "බහුලීකත්තබ්බඤ්ච{1} වො භික්ඛවෙ ධම්මං දෙසිස්සාමි, න බහුලීකත්තබ්බඤ්ච{1}. තං සුණාථ -පෙ- කතමො ච භික්ඛවෙ න බහුලීකත්තබ්බො ධම්මො: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ න බහුලීකත්තබ්බො ධම්මො. කතමො ච භික්ඛවෙ බහුලීකත්තබ්බො ධම්මො: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ බහුලීකත්තබ්බො ධම්මොති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 9.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "අනුස්සරිතබ්බ සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "අනුස්සරිතබ්බඤ්ච වො භික්ඛවෙ ධම්මං දෙසිස්සාමි, නානුස්සරිතබ්බඤ්ච. තං සුණාථ -පෙ- කතමො ච භික්ඛවෙ නානුස්සරිතබ්බො ධම්මො: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ නානුස්සරිතබ්බො ධම්මො. කතමො ච භික්ඛවෙ අනුස්සරිතබ්බො ධම්මො: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ අනුස්සරිතබ්බො ධම්මොති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 10.",
                        "level": 1,
                        "noAudio": true
                    },
                    {
                        "type": "heading",
                        "text": "සච්ඡිකාතබ්බ සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සච්ඡිකාතබ්බඤ්ච වො භික්ඛවෙ ධම්මං දෙසිස්සාමි, න සච්ඡිකාතබ්බඤ්ච. තං සුණාථ -පෙ- කතමො ච භික්ඛවෙ න සච්ඡිකාතබ්බො ධම්මො: මිච්ඡාදිට්ඨි -පෙ- මිච්ඡාවිමුත්ති. අයං වුච්චති භික්ඛවෙ න සච්ඡිකාතබ්බො ධම්මො. කතමො ච භික්ඛවෙ සච්ඡිකාතබ්බො ධම්මො: සම්මාදිට්ඨි -පෙ- සම්මාවිමුත්ති. අයං වුච්චති භික්ඛවෙ සච්ඡිකාතබ්බො ධම්මොති."
                    },
                    {
                        "type": "centered",
                        "text": "අරියවග්ගො පඤ්චමො.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "තතියො පණ්ණාසකො.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කාතබ්බඤ්ච – මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බහුලීකත්තබ්බ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට බහුලීකර්‍තව්‍යධර්‍ම හා අබහුලීකර්‍තව්‍යධර්‍ම හා දෙසමි. එ අසවු ... මහණෙනි, අබහුලීකර්‍තව්‍ය ධර්‍ම කවර: මිච්ඡාදිට්ඨි ය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මෙ අබහුලීකර්‍තව්‍යධර්‍ම යි කියනු ලැබේ. මහණෙනි, බහුලීකර්‍තව්‍යධර්‍ම කවර: සම්මාදිට්ඨි ය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ බහුලීකර්‍තව්‍යධර්‍ම යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අනුස්සරිතබ්බ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට අනුස්මර්‍තව්‍යධර්‍ම හා නානුස්මර්‍තව්‍යධර්‍ම හා දෙසමි. එ අසවු ... මහණෙනි, නානුස්මර්‍තව්‍යධර්‍ම කවර: මිච්ඡාදිට්ඨි ය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ නානුස්මර්‍තව්‍යධර්‍ම යි කියනු ලැබේ. මහණෙනි, අනුස්මර්‍තව්‍යධර්‍ම කවර: සම්මාදිට්ඨිය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ අනුස්මර්‍තව්‍යධර්‍ම යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 3. 5. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සච්ඡිකාතබ්බ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, තොපට සාක්‍ෂාත්ර්‍තව්‍යධර්‍ම හා න සාක්‍ෂාකර්‍තව්‍යධර්‍ම හා දෙසමි. එ අසවු ... මහණෙනි, න සාක්‍ෂාත්කර්‍තව්‍යධර්‍ම කවර: මිච්ඡාදිට්ඨි ය ... මිච්ඡාවිමුත්ති යි. මහණෙනි, මේ න සාක්‍ෂාත්කර්‍තව්‍යධර්‍ම යි කියනු ලැබේ. මහණෙනි, සාක්‍ෂාත් කර්‍තව්‍යධර්‍ම කවර: සම්මාදිට්ඨි ය ... සම්මාවිමුත්ති යි. මහණෙනි, මේ සාක්‍ෂාත් කර්‍තව්‍යධර්‍ම යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පස්වැනි ආර්‍ය්‍යවර්‍ග යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "තෙවන පණ්ණාසක යි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ],
    "bookId": 27,
    "pageOffset": 0,
    "collection": "mula"
}