[
    {
        "filename": "an-1-16",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 62
            },
            {
                "type": "heading",
                "text": "16. එකධම්මපාළි",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. 16. 1. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "**(සාවත්ථිනිදානං:)**"
            },
            {
                "type": "paragraph",
                "text": "එකධම්මො භික්ඛවෙ භාවිතො බහුලීකතො එකන්තනිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තති. කතමො එකධම්මො: බුද්ධානුස්සති. අයං ඛො භික්ඛවෙ එකධම්මො භාවිතො බහුලීකතො එකන්තනිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තතීති.{1 සංවත්තන්තීති - මඡසං, ස්යා.}"
            },
            {
                "type": "heading",
                "text": "1. 16. 1. 2 – 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එකධම්මො භික්ඛවෙ භාවිතො බහුලීකතො එකන්තනිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තති. කතමො එකධම්මො: ධම්මානුස්සති -පෙ- සඞ්ඝානුස්සති -පෙ- සීලානුස්සති -පෙ- චාගානුස්සති -පෙ- දෙවතානුස්සති -පෙ- ආනාපානසති -පෙ- මරණසති -පෙ- කායගතාසති -පෙ- උපසමානුස්සති. අයං ඛො භික්ඛවෙ එකධම්මො භාවිතො බහුලීකතො එකන්තනිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තතීති."
            },
            {
                "type": "centered",
                "text": "වග්ගො පඨමො.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා අකුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා වා අකුසලා ධම්මා භිය්යොභාවාය වෙපුල්ලාය සංවත්තන්ති, යථයිදං භික්ඛවෙ මිච්ඡාදිට්ඨි. මිච්ඡාදිට්ඨිකස්ස භික්ඛවෙ අනුප්පන්නා චෙව අකුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච අකුසලා ධම්මා භිය්යොභාවාය වෙපුල්ලාය සංවත්තන්ති."
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා වා කුසලා ධම්මා භිය්යොභාවාය වෙපුල්ලාය සංවත්තන්ති, යථයිදං භික්ඛවෙ සම්මාදිට්ඨි. සම්මාදිට්ඨිකස්ස භික්ඛවෙ අනුප්පන්නා චෙව කුසලා ධම්මා උප්පජ්ජන්ති, උප්පන්නා ච කුසලා ධම්මා භිය්යොභාවාය වෙපුල්ලාය සංවත්තන්ති."
            },
            {
                "type": "page-break",
                "text": "64"
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා කුසලා ධම්මා නුප්පජ්ජන්ති, උප්පන්නා වා කුසලා ධම්මා පරිහායන්ති, යථයිදං භික්ඛවෙ මිච්ඡාදිට්ඨි. මිච්ඡාදිට්ඨිකස්ස භික්ඛවෙ අනුප්පන්නා චෙව කුසලා ධම්මා නුප්පජ්ජන්ති, උප්පන්නා ච කුසලා ධම්මා පරිහායන්ති.{1 පරිහායන්තීති - මඡසං, ස්යා.}"
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා අකුසලා ධම්මා නුප්පජ්ජන්ති, උප්පන්නා වා අකුසලා ධම්මා පරිහායන්ති, යථයිදං භික්ඛවෙ සම්මාදිට්ඨි. සම්මාදිට්ඨිකස්ස භික්ඛවෙ අනුප්පන්නා චෙව අකුසලා ධම්මා නූප්පජ්ජන්ති, උප්පන්නා ච අකුසලා ධම්මා පරිහායන්ති."
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 5.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා මිච්ඡාදිට්ඨි උප්පජ්ජති, උප්පන්නා වා මිච්ඡාදිට්ඨි පවඩ්ඪති, යථයිදං භික්ඛවෙ අයොනිසොමනසිකාරො. අයොනිසො භික්ඛවෙ මනසි කරොතො අනුප්පන්නා චෙව මිච්ඡාදිට්ඨි උප්පජ්ජති, උප්පන්නා ච මිච්ඡාදිට්ඨි පවඩ්ඪති.{2 පවඩ්ඪතීති - මඡසං, ස්යා.}"
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යෙන අනුප්පන්නා වා සම්මාදිට්ඨි උප්පජ්ජති, උප්පන්නා වා සම්මාදිට්ඨි පවඩ්ඪති, යථයිදං භික්ඛවෙ යොනිසො මනසිකාරො. යොනිසො භික්ඛවෙ මනසිකරොතො අනුප්පන්නා චෙව සම්මාදිට්ඨි උප්පජ්ජති, උප්පන්නා ච සම්මාදිට්ඨි පවඩ්ඪති."
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 7.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි යෙනෙව{3 යෙන - මඡසං.} සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්ති, යථයිදං භික්ඛවෙ මිච්ඡාදිට්ඨි. මිච්ඡාදිට්ඨියා භික්ඛවෙ සමන්නාගතා සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්ති.{4 උපපජ්ජන්ති - මඡසං.}"
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 8.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි යෙනෙවං{5 යෙන - මඡසං.} සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති, යථයිදං භික්ඛවෙ සම්මාදිට්ඨි. සම්මාදිට්ඨියා භික්ඛවෙ සමන්නාගතා සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති."
            },
            {
                "type": "page-break",
                "text": "66"
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 9 – 15.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "මිච්ඡාදිට්ඨිකස්ස භික්ඛවෙ පුරිසපුග්ගලස්ස යඤ්චෙව කායකම්මං යථාදිට්ඨි සමත්තං සමාදින්නං, යඤ්ච වචීකම්මං -පෙ- යඤ්ච මනොකම්මං යථාදිට්ඨි සමත්තං සමාදින්නං, යා ච චෙතනා-යා ච පත්ථනා-යො ච පණිධි-යෙ ච සඞ්ඛාරා-සබ්බෙ තෙ ධම්මා අනිට්ඨාය අකන්තාය අමනාපාය අහිතාය දුක්ඛාය සංවත්තන්ති. තං කිස්ස හෙතු: දිට්ඨි හි{1 දිට්ඨිහිස්ස - මඡසං.} භික්ඛවෙ පාපිකා. සෙය්යථාපි භික්ඛවෙ නිම්බබීජං වා කොසාතකිබීජං වා තිත්තකලාබුබීජං වා අල්ලාය පඨවියා නික්ඛිත්තං යඤ්චෙව පඨවිරසං උපාදියති, යඤ්ච ආපොරසං උපාදියති, සබ්බං තං තිත්තකත්තාය කටුකත්තාය අසාතත්තාය සංවත්තති. තං කිස්ස හෙතු: බීජං{2 බීජං - සීමු. බීජංහිස්ස - මඡසං.} හි භික්ඛවෙ පාපකං. එවමෙවං ඛො භික්ඛවෙ මිච්ඡාදිට්ඨිකස්ස පුරිසපුග්ගලස්ස යඤ්චෙව කායකම්මං යථාදිට්ඨි සමත්තං සමාදින්නං, යඤ්ච වචීකම්මං -පෙ- යඤ්ච මනොකම්මං යථාදිට්ඨි සමත්තං සමාදින්නං, යා ච චෙතනා - යා ච පත්ථනා - යො ච පණිධි - යෙ ච සඞ්ඛාරා - සබ්බෙ තෙ ධම්මා අනිට්ඨාය අකන්තාය අමනාපාය අහිතාය දුක්ඛාය සංවත්තන්ති. තං කිස්ස හෙතු: දිට්ඨි හි භික්ඛවෙ පාපිකාති."
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 16 – 22.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "සම්මාදිට්ඨිකස්ස භික්ඛවෙ පුරිසපුග්ගලස්ස යඤ්චෙව කායකම්මං යථාදිට්ඨි සමත්තං සමාදින්නං, යඤ්ච වචීකම්මං -පෙ- යඤ්ච මනොකම්මං යථාදිට්ඨි සමත්තං සමාදින්නං, යා ච චෙතනා - යා ච පත්ථනා - යො ච පණිධි - යෙ ච සඞ්ඛාරා - සබ්බෙ තෙ ධම්මා ඉට්ඨාය කන්තාය මනාපාය හිතාය සුඛාය සංවත්තන්ති. තං කිස්ස හෙතු: දිට්ඨි හි භික්ඛවෙ භද්දිකා. සෙය්යථාපි භික්ඛවෙ උච්ඡුබීජං වා සාලිබීජං වා මුද්දිකාබීජං වා අල්ලාය පඨවියා{3 පඨවියා - මඡසං.} නික්ඛිත්තං යඤ්චෙව පඨවිරසං උපාදියති, යඤ්ච ආපොරසං උපාදියති, සබ්බං තං මධුරත්තාය සාතත්තාය අසෙචකත්තාය{4 අසෙවනකත්තාය - මඡසං.} සංවත්තති. තං කිස්ස හෙතු: බීජං හි භික්ඛවෙ භද්දකං. එවමෙව ඛො භික්ඛවෙ සම්මාදිට්ඨිකස්ස පුරිසපුග්ගලස්ස යඤ්චෙව කායකම්මං යථාදිට්ඨි සමත්තං සමාදින්නං, යඤ්ච වචීකම්මං යථාදිට්ඨි සමත්තං සමාදින්නං, යඤ්ච මනොකම්මං යථාදිට්ඨි සමත්තං සමාදින්නං, යා ච චෙතනා - යා ච පත්ථනා - යො ච පණිධි - යෙ ච සඞ්ඛාරා - සබ්බෙ තෙ ධම්මා ඉට්ඨාය කන්තාය මනාපාය හිතාය සුඛාය සංවත්තන්ති. තං කිස්ස හෙතු: දිට්ඨි හි භික්ඛවෙ භද්දිකාති."
            },
            {
                "type": "centered",
                "text": "වග්ගො දුතියො.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "68"
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එකපුග්ගලො භික්ඛවෙ ලොකෙ උප්පජ්ජමානො උප්පජ්ජති බහුජනාහිතාය බහුජනාසුඛාය බහුනො ජනස්ස අනත්ථාය අහිතාය දුක්ඛාය දෙවමනුස්සානං. කතමො එකපුග්ගලො: මිච්ඡාදිට්ඨිකො හොති විපරීතදස්සනො. සො බහුජනං සද්ධම්මා වුට්ඨාපෙත්වා අසද්ධම්මෙ පතිට්ඨාපෙති. අයං ඛො භික්ඛවෙ එකපුග්ගලො ලොකෙ උප්පජ්ජමානො උප්පජ්ජති බහුජනාහිතාය බහුජනාසුඛාය බහුනො ජනස්ස අනත්ථාය අහිතාය දුක්ඛාය දෙවමනුස්සානං."
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එකපුග්ගලො භික්ඛවෙ ලොකෙ උප්පජ්ජමානො උප්පජ්ජති බහුජනහිතාය බහුජනසුඛාය බහුනො ජනස්ස අත්ථාය හිතාය සුඛාය දෙවමනුස්සානං. කතමො එකපුග්ගලො: සම්මාදිට්ඨිකො හොති අවිපරීතදස්සනො. සො බහුජනං අසද්ධම්මා වුට්ඨාපෙත්වා සද්ධම්මෙ පතිට්ඨාපෙති. අයං ඛො භික්ඛවෙ එකපුග්ගලො ලොකෙ උපපජ්ජමානො උප්පජ්ජති බහුජනහිතාය බහුජනසුඛාය බහුනො ජනස්ස අත්ථාය හිතාය සුඛාය දෙවමනුස්සානන්ති."
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකධම්මම්පි සමනුපස්සාමි, යං එවං මහාසාවජ්ජං, යථයිදං භික්ඛවෙ මිච්ඡාදිට්ඨි. මිච්ඡාදිට්ඨිපරමානි භික්ඛවෙ වජ්ජානීති.{1 මහාසාවජ්ජානීති - මඡසං.}"
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකපුග්ගලම්පි සමනුපස්සාමි, යො එවං බහුජනාහිතාය පටිපන්නො බහුජනාසුඛාය බහුනො ජනස්ස අනත්ථාය අහිතාය දුක්ඛාය දෙවමනුස්සානං, යථයිදං භික්ඛවෙ මක්ඛලී මොඝපුරිසො. සෙය්යථාපි භික්ඛවෙ නදීමුඛෙ ඛිපං{2 } ඔඩ්ඩෙය්ය බහුන්නං මච්ඡානං අහිතාය දුක්ඛාය අනත්ථාය ව්යසනාය. එවමෙව ඛො භික්ඛවෙ මක්ඛලී මොඝපුරිසො මනුස්සඛිපං මඤ්ඤෙ ලොකෙ උප්පන්නො බහුන්නං සත්තානං අහිතාය දුක්ඛාය අනත්ථායාය ව්යසනායාති."
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 5.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "දුරක්ඛාතෙ භික්ඛවෙ ධම්මවිනයෙ යො ච සමාදපෙති, යඤ්ච සමාදපෙති, යො ච සමාදපිතො තථත්තාය පටිපජ්ජති, සබ්බෙ තෙ බහුං අපුඤ්ඤං පසවන්ති. තං කිස්ස හෙතු: දුරක්ඛාතත්තා භික්ඛවෙ ධම්මස්ස."
            },
            {
                "type": "page-break",
                "text": "70"
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "ස්වාක්ඛාතෙ භික්ඛවෙ ධම්මවිනයෙ යො ච සමාදපෙති, යඤ්ච සමාදපෙති, යො ච සමාදපිතො තථත්තාය පටිපජ්ජති, සබ්බෙ තෙ බහුං පුඤ්ඤං පසවන්ති. තං කිස්ස හෙතු: ස්වාක්ඛාතත්තා භික්ඛවෙ ධම්මස්සාති."
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 7.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "දුරක්ඛාතෙ භික්ඛවෙ ධම්මවිනයෙ දායකෙන මත්තා ජානිතබ්බා, නො පටිග්ගාහකෙන. තං කිස්ස හෙතු: දුරක්ඛාතත්තා භික්ඛවෙ ධම්මස්ස."
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 8.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "ස්වාක්ඛාතෙ භික්ඛවෙ ධම්මවිනයෙ පටිග්ගාහකෙන මත්තා ජාතිතබ්බා, නො දායකෙන. තං කිස්ස හෙතු: ස්වාක්ඛාතත්තා භික්ඛවෙ ධම්මස්සාති."
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 9.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "දුරක්ඛාතෙ භික්ඛවෙ ධම්මවිනයෙ යො ආරද්ධවිරියො, සො දුක්ඛං විහරති. තං කිස්ස හෙතු: දුරක්ඛාතත්තා භික්ඛවෙ ධම්මස්ස."
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "ස්වාක්ඛාතෙ භික්ඛවෙ ධම්මවිනයෙ යො කුසීතො, සො දුක්ඛං විහරති. තං කිස්ස හෙතු: ස්වාක්ඛාතත්තා භික්ඛවෙ ධම්මස්සාති."
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 11.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "දුරක්ඛාතෙ භික්ඛවෙ ධම්මවිනයෙ යො කුසීතො, සො සුඛං විහරති. තං කිස්ස හෙතු: දුරක්ඛාතත්තා භික්ඛවෙ ධම්මස්ස."
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 12.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "ස්වාක්ඛාතෙ භික්ඛවෙ ධම්මවිනයෙ යො ආරද්ධවිරියො, සො සුඛං විහරති. තං කිස්ස හෙතු: ස්වාක්ඛාතත්තා භික්ඛවෙ ධම්මස්සාති."
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 13.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ අප්පමත්තකොපි ගූථො දුග්ගන්ධො හොති, එවමෙවං ඛො අහං භික්ඛවෙ අප්පමත්තකම්පි භවං න වණ්ණෙමි, අන්තමසො අච්ඡරාසඞ්ඝාතමත්තම්පීති."
            },
            {
                "type": "page-break",
                "text": "72"
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 14 – 17.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ අප්පමත්තකම්පි මුත්තං දුග්ගන්ධං හොති -පෙ- අප්පමත්තකොපි ඛෙළො දුග්ගන්ධො හොති -පෙ- අප්පමත්තකොපි පුබ්බො දුග්ගන්ධො හොති -පෙ- අප්පමත්තකම්පි ලොහිතං දුග්ගන්ධං හොති, එවමෙවං ඛො අහං භික්ඛවෙ අප්පමත්තකම්පි භවං න වණ්ණෙමි, අන්තමසො අච්ඡරාසඞ්ඝාතමත්තම්පීති."
            },
            {
                "type": "centered",
                "text": "වග්ගො තතියො.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 63
            },
            {
                "text": "16. එකධම්ම පාළිය",
                "type": "heading",
                "level": 3
            },
            {
                "text": "1. 16. 1. 1.",
                "type": "heading",
                "level": "1"
            },
            {
                "text": "**[සැවැත්නිදානයි:]**",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, එක් ම ධර්‍මයෙක් (භාවනා වශයෙන්) වඩනා ලද්දේ බහුල වශයෙන් කරණ ලද්දේ ඒකාන්තයෙන් (සසර) කළකිරීම පිණිස, (සසර) නොඇලීම පිණිස (රාගාදීන්ගේ) නිරොධය පිණිස (කෙලෙස්) සන්හිඳීම පිණිස (අනිත්‍යාදිවශයෙන්) වෙසෙසා දැනුම පිණිස සිවුසස් පිළිවිඳීම පිණිස නිවන් පිණිස පවත්නේ ය. කවර එක් ධර්‍මයෙක? යත්: බුද්ධානුස්මෘතිය යි. මහණෙනි, මේ එක් ධර්‍මය වඩනා ලද්දේ බහුලවශයෙන් කරණ ලද්දේ ඒකාන්තනිර්වෙදය පිණිස විරාගය පිණිස නිරොධය පිණිස උපශමය පිණිස අභිඥාව පිණිස සම්බොධිය පිණිස නිර්වාණය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 1. 2 - 10.",
                "level": 1
            },
            {
                "text": "මහණෙනි, එක් ම ධර්‍මයෙක් (භාවනා වශයෙන්) වඩනා ලද්දේ බහුල වශයෙන් කරණ ලද්දේ එකාන්ත නිර්වෙදය පිණිස, විරාගය පිණිස, නිරොධය පිණිස උපශමය පිණිස අභිඥාව පිණිස සම්බොධය පිණිස නිර්‍වාණය පිණිස පවත්නේ ය. කවර එක් ධර්‍මයෙක? යත්: ධර්‍මානුස්මෘතිය යි. ... සඬ්ඝානුස්මෘතිය යි. ... ශීලානුස්මෘතිය යි. ... ත්‍යාගානුස්මෘතිය යි. ... දෙවතානුස්මෘතිය යි. ... ආනාපානස්මෘතිය යි. ... මරණානුස්මෘතිය යි. ... කායගතස්මෘතිය යි. ... උපශාමානුස්මෘතිය යි. මහණෙනි, මේ එක් ධර්‍මය වඩනා ලද්දේ බහුලවශයෙන් කරණ ලද්දේ ඒකාන්ත නිර්වෙදය පිණිස විරාගය පිණිස නිරොධය පිණිස උපශමය පිණිස අභිඥාව පිණිස සම්බොධය පිණිස නිර්‍වාණය පිණිස පවත්නේ ය.",
                "type": "paragraph"
            },
            {
                "text": "පළමු වග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "1. 16. 2. 1.",
                "type": "heading",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් ධර්‍මයක් හේතු කොට ගෙණ නූපන්නා වූ ද අකුශල ධර්‍මයෝ උපදිත් නම්, උපන්නා වූ ද අකුශලධර්‍මයෝ භූයසත්‍වය පිණිස විපුල බව පිණිස පවතිත් නම්, මහණෙනි, මිථ්‍යාදෘෂ්ටිය බඳු අන් එක ධර්‍මයකුදු මම නො දක්මි. මහණෙනි, මිථ්‍යාදෘෂ්ටිකයාහට නූපන්නා වූ ද අකුශලධර්‍මයෝ උපදිත්. උපන්නා වූ ද අකුශලධර්‍මයෝ භූයසත්‍වය පිණිස විපුල බව පිණිස පවතිත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 2.",
                "level": "1"
            },
            {
                "text": "මහණෙනි,යම් ධර්‍මයක් හේතු කොට ගෙණ නූපන්නා වූ ද කුශල ධර්‍මයෝ උපදිත් නම්, උපන්නා වූ ද කුශලධර්‍මයෝ බොහෝ බව පිණිස විපුලබව පිණිස පවතිත් නම්, මහණෙනි, සම්‍යක්දෘෂ්ටිය බඳු අන් එක ධර්‍මයකුදු මම නො දක්මි. මහණෙනි, සම්‍යක්දෘෂ්ටිකයාහට නූපන්නා වූ ද කුශලධර්‍මයෝ උපදිත්. උපන්නා වූ ද කුශලධර්‍මයෝ භූයසත්‍වය පිණිස විපුල බව පිණිස පවතිත්.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "65"
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 3.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් ධර්‍මයක් හෙතු කොට ගෙණ නූපන්නා වූ ද කුශලධර්‍මයෝ නූපදිත් නම්, උපන්නා වූ ද කුශලධර්‍මයෝ පිරිහෙත් නම්, මහණෙනි, මිථ්‍යාදෘෂ්ටිය බඳු අන් එක ධර්‍මයකුදු මම නො දක්මි. මහණෙනි, මිත්‍යදෘෂ්ටිකයාහට නූපන්නා වූ ද කුශලධර්‍මයෝ නූපදිත්. උපන්නා වූ ද කුශලධර්‍මයෝ පිරිහෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 4.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් ධර්‍මයක් හෙතු කොට ගෙණ නූපන්නා වූ ද අකුශලධර්‍මයෝ නූපදිත් නම්, උපන්නා වූ ද අකුශලධර්‍මයෝ පිරිහෙත් නම්, මහණෙනි, සම්‍යග්දෘෂ්ටිය බඳු අන් එක ධර්‍මයකුදු මම නො දක්මි. මහණෙනි, සම්‍යග්දෘෂ්ටිකයාහට නූපන්නා වූ ද අකුශලධර්‍මයෝ නූපදිත්. උපන්නා වූ ද අකුශලධර්‍මයෝ පිරිහෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 5.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් ධර්‍මයක් හෙතු කොට ගෙණ නූපන්නා වූ ද මිථ්‍යාදෘෂ්ටිය උපදනේ නම්, උපන්නා වූ ද මිථ්‍යාදෘෂ්ටිය වැඩේ නම්, මහණෙනි, මේ අයොනිසො මනසිකාරය යම්බඳු වේ නම් එබඳු අන් එක ධර්‍මයකුදු මම නො දක්මි. මහණෙනි, අනුපාය මනසිකාරයෙන් මෙනෙහි කරනුවහුට නූපන්නා වු ද මිථ්‍යාදෘෂ්ටිය උපදී. උපන්නා වූ ද මිථ්‍යාදෘෂ්ටිය වැඩේ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 6.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් ධර්‍මයක් හෙතු කොට ගෙණ නූපන්නා වූ ද සම්‍යග්දෘෂ්ටිය උපදනේ නම්, උපන්නා වූ ද සම්‍යග්දෘෂ්ටිය වැඩේ නම්, මහණෙනි, මේ යොනිසෝ මනසිකාරය යම්බඳු වේ නම් එබඳු අන් එක ධර්‍මයකුදු මම නො දක්මි. මහණෙනි, නුවණින් මෙනෙහි කරනුවහට නූපන්නා වූ ද සම්‍යග්දෘෂ්ටිය උපදී. උපන්නා වූ ද සම්‍යග්දෘෂ්ටිය වැඩේ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 7.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් ධර්‍මයක් හෙතු කොට ගෙණ මෙසේ සත්ත්‍වයෝ කාබුන් මරණින් මතු අපාය නම් වූ දුගති නම් වූ විනිපාත නම් වූ නිරයට (ප්‍රතිසන්ධි වශයෙන්) පැමිණෙත් නම් , මහණෙනි, මේ මිථ්‍යාදෘෂ්ටිය යම්බඳු වේ නම් එබඳු අන් එක ධර්‍මයකුදු මම නො දක්මි. මහණෙනි, මිථ්‍යාදෘෂ්ටියෙන් යුක්ත සත්ත්‍වයෝ කාබුන් මරණින් මතු අපාය නම් වූ දුගති නම් වූ විනිපාත නම් වූ නිරයට පැමිණෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 8.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම් ධර්‍මයක් හෙතු කොට ගෙණ මෙසේ සත්ත්‍වයෝ කාබුන් මරණින් මතු සුගති නම් වූ ස්වර්‍ගලොකයට (පිළිසඳ විසින්) පැමිණෙත් නම්, මහණෙනි, මේ සම්‍යග්දෘෂ්ටිය යම්බඳු වේ නම් එබඳු අන් එක ධර්‍මයකුදු මම නො දක්මි. මහණෙනි, සම්‍යග්දෘෂ්ටියෙන් යුක්ත වූ සත්ත්‍වයෝ කාබුන් මරණින් මතු සුගති නම් වූ ස්වර්‍ගලොකයට පැමිණෙත්.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "67"
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 9 - 15.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, මිසදිටුගත් පුරුෂපුද්ගලයාගේ දෘෂ්ටියට අනුරූප වූ සමාප්ත වූ (නිඃශෙෂ වූ) සමාදින්න වූ (මුල මැද අග සමකොට ගත්) යම් කායකර්‍මයෙකුත් වේ ද, ... යම් වාක්කර්‍මයෙකුත් වේ ද, දෘෂ්ටියට අනුරූප වූ පිරිපුන් වූ මොනවට ගන්නා ලද යම් මනඃකර්‍මයෙකුත් වේ ද, ... (දෘෂ්ටිසහජාත වූ) යම් චෙතනායෙකුත් වේ ද ... යම් ප්‍රාර්ථනායෙකුත් වේ ද … යම් චිත්තප්‍රණිධියෙකුත් (චෙතනා ප්‍රාර්‍ථනාවන්ගේ වශයෙන් සිත පිහිටුවාලීමෙක්) වේ ද ... යම් සංස්කාර කෙනෙකුත් වෙද් ද, ඒ සියලු ධර්‍මයෝ අනිටු වූ අකාන්ත වූ මන නොවඩන්නා වූ අහිත වූ දුක් පිණිස පවත්නාහ. ඒ කවර හෙයින: මහණෙනි, දෘෂ්ටිය පවිටු ය, එහෙයිනි. මහණෙනි, යම්සේ කොසඹ බිජුවටෙක් වේවයි, වැටකොළු බිජුවටෙක් වේවයි, තිත්ත ලබු බිජුවටෙක් වේවයි, තෙත් බිම බහාලන ලද්දේ යම් ම පෘථිවිරසයකුත් ඇද ගණී ද, යම් ම ආපොරසයකුත් ඇද ගණී ද, ඒ සියල්ල තිත්තරස බව පිණිස, කටුකරස බව පිණිස, නොමිහිරි රස බව පිණිස පවත්නේ ය. ඒ කවරහෙයින: මහණෙනි, බිජුවට ලාමක ය, එහෙයිනි. මහණෙනි, එපරිද්දෙන් ම මිසදිටු ගත් පුරුෂ පුද්ගලයාගේ දෘෂ්ටියට අනුරූප වූ පිරිපුන් වූ සමාදන් වූ යම් කායකර්‍මයෙකුත් වේ ද ... යම් වාක්කර්‍මයෙකුත් වේ ද ... යම් මනඃකර්‍මයෙකුත් වේ ද ... යම් චෙතනායෙකුත් වේ ද ... යම් ප්‍රාර්ථනායෙකුත් වේ ද ... යම් ප්‍රණිධියෙකුත් වේ ද ... යම් සංස්කාර කෙනෙකුත් වෙත් ද ... ඒ සියලු ධර්‍මයෝ අනිටු වූ නොකල් වූ අමනාප වූ අහිත වූ දුක් පිණිස පවත්නාහ. ඒ කවරහෙයින: මහණෙනි, දෘෂ්ටිය පවිටු ය, එහෙයිනි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 2. 16 - 22.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, සම්‍යග්දෘෂ්ටික වූ පුරුෂපුද්ගලයාගේ දෘෂ්ටියට අනුරූප වූ පිරිපුන් වූ සමාදන් වූ යම් කායකර්‍මයෙකුත් වේ ද ... යම් වාක්කර්‍මයෙකුත් වේ ද ... දෘෂ්ටියට අනුරූප වූ පිරිපුන් වූ, සමාදන් වූ යම් මනඃකර්‍මයෙකුත් වේ ද ... යම් චෙතනායෙකුත් වේ ද ... යම් ප්‍රාර්ථනායෙකුත් වේ ද ... යම් චිත්තප්‍රණිධියෙකුත් වේ ද .... යම් සංස්කාර කෙනෙකුත් වෙත් ද, ඒ සියලු ධර්‍මයෝ ඉටු වූ කල් වූ මනාප වූ හිත වූ සුව පිණිස පවත්නාහ. ඒ කවර හෙයින: මහණෙනි, දෘෂ්ටිය කල්‍යාණය, එහෙයිනි. මහණෙනි, යම් බඳු උක් බිජුවටෙක් වේවයි, හැල් බිජුවටෙක් වේවයි, මිදි බිජුවටෙක් වේවයි, තෙත් බිමෙහි ඇද බහාලන ලද්දේ යම් ම පෘථිවි රසයකුත් ඇද ගණී ද, යම් ම ආපොරසයකුත් ඇද ගණී ද, ඒ සියල්ල මධුරභාවය පිණිස, ප්‍රියභාවය පිණිස අසෙචනකභාවය (අමුතු රස නො ඉසිය යුතු බව = අත්‍යන්තප්‍රියභාවය) පිණිස පවත්නේය. ඒ කවර හෙයින: මහණෙනි, බිජුවට සොඳුරුය, එහෙයිනි. මහණෙනි, එපරිද්දෙන් ම සම්‍යග්දෘෂ්ටික පුරුෂපුද්ගලයාගේ දෘෂ්ටියට අනුරූප වූ පිරිපුන් වූ සමාදන් ව ගත් යම් කායකර්‍මයෙකුත් වේ ද ... යම් වාක්කර්‍මයෙකුත් වේ ද ... දෘෂ්ටියට අනුරූප වූ පිරිපුන් වූ සමාදන් ව ගත් යම් මනඃකර්‍මයෙකුත් වේ ද ... යම් චෙතනායෙකුත් වේ ද ... යම් ප්‍රාර්ථනායෙකුත් වේ ද ... යම් ප්‍රණිධියෙකුත් වේ ද .... යම් සංස්කාර කෙනෙකුත් වෙත් ද, ඒ සියලු ධර්‍මයෝ ඉටු වූ කල් වූ මනාප වූ හිත වූ සුව පිණිස පවත්නාහ. ඒ කවරහෙයින: මහණෙනි, දෘෂ්ටිය සොඳුරු ය, එහෙයිනි.",
                "type": "paragraph"
            },
            {
                "text": "දෙවන වගයි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "69"
            },
            {
                "text": "1. 16. 3. 1.",
                "type": "heading",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ලෙව්හි උපදනට සමත් එක් පුද්ගලයෙක් බොහෝ දෙනාට අහිත පිණිස බොහෝ දෙනාට නොසුව පිණිස බොහෝ දෙනාට නොවැඩ පිණිස දෙව්මිනිස්නට අහිත පිණිස දුක් පිණිස උපන්නේ වෙයි. කවර එක් පුද්ගලයෙක යත්: විපරීතදර්‍ශන ඇති මිත්‍යාදෘෂ්ටික වෙයි. හෙතෙම බොහෝ දෙනා (දශකුශලකර්‍මපථසඬ්ඛ්‍යාත) සද්ධර්‍මයෙන් නඟා (දශ අකුශල කර්‍මපථ සඬ්ඛ්‍යාත) අසද්ධර්‍මයෙහි පිහිටුවයි. මහණෙනි, ලෙව්හි උපදනට සමත් මේ එක් පුද්ගල තෙමේ බොහෝ දෙනාට අහිත පිණිස බොහෝ දෙනාට නොසුව පිණිස බොහෝ දෙනාට නොවැඩ පිණිස දෙව්මිනිස්නට අහිත පිණිස දුක් පිණිස උපන්නේ වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 2.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, ලෙව්හි උපදනට සමත් එක් පුද්ගලයෙක් බොහෝ දෙනාට හිත පිණිස බොහෝ දෙනාට සුව පිණිස බොහෝ දෙනාට වැඩ පිණිස දෙවිමිනිස්නට හිත පිණිස සුව පිණිස උපන්නේ වෙයි. කවර එක් පුද්ගලයෙක යත්: මහණෙනි, අවිපරීත දර්‍ශන ඇති සම්‍යග් දෘෂ්ටික වෙයි. හෙ තෙමෙ බොහෝ දෙනා අසද්ධර්‍මයෙන් නඟා සද්ධර්‍මයෙහි පිහිටුවයි. මහණෙනි, ලෙව්හි උපදනට සමත් මේ එක් පුද්ගලයා බොහෝ දෙනාට හිත පිණිස බොහෝ දෙනාට සුව පිණිස බොහෝ දෙනාට වැඬ පිණිස දෙව්මිනිස්නට හිත පිණිස සුව පිණිස උපන්නේ වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 3.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමෙක් මෙසේ මහාසාවද්‍ය වේ ද, මහණෙනි, මේ මිථ්‍යාදෘෂ්ටිය යම් බඳු වේ නම් එබඳු අන් එක ධර්‍මයකුදු මම නො දක්මි. මහණෙනි, දොෂයෝ මිථ්‍යාදෘෂ්ටිය පරම කොට ඇතියහ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 4.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යමෙක් මෙසේ බොහෝ දෙනාට අහිත පිණිස බොහෝ දෙනාට නොසුව පිණිස බොහෝ දෙනාට නොවැඩ පිණිස දෙව්මිනිස්නට අහිත පිණිස දුක් පිණිස පිළිපන්නේ ද, මහණෙනි, මස්කරි මොඝපුරුෂයා බඳු අන් එක පුඟුලකු මම නො දක්මි. මහණෙනි, යම්සේ හෝමුවදොර බොහෝ මස්නට අහිත පිණිස දුක් පිණිස නොවැඩ පිණිස වැසන පිණිස කෙමිනක් බහා ලන්නේ ද, මහණෙනි, එපරිද්දෙන් ම මස්කරි මොඝපුරුෂයා බොහෝ සත්නට අහිත පිණිස දුක් පිණිස නොවැඩ පිණිස වැසන පිණිස ලෙව්හි උපන් මිනිස් කෙමිනක් බඳු වේ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 5.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, වරදවා දෙසන ලද බාහිරක ශාසනයෙහි යමෙකුත් සමාදන් කරවා නම්, යමකුදු ලවා සමාදන් කරවා නම්, සමාදන් කරවන ලද යම් අතැවැසියෙකුත් ඒ පිණිස පිළිපදනේ නම්, ඒ හැම දෙන බොහෝ පව් රැස් කෙරෙත්. ඒ කවරහෙයින: මහණෙනි, ඒ ශාසනය වරදවා දෙසන ලද බැවිනි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "71"
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 6",
                "level": "1"
            },
            {
                "text": "මහණෙනි, මොනොවට (ඒකාන්තනෛර්‍යාණිකභාවයෙන්) දෙසන ලද ශාසනයෙහි යමෙකුත් සමාදන් කරවා නම්, යමකුදු ලවා සමාදන් කරවා නම්, සමාදන් කරවන ලද යම් අතැවැසියෙකුත් ඒ පිණිස පිළිපදනේ නම්, ඒ හැම දෙන බොහෝ පින් රැස් කෙරෙත්. ඒ කවරහෙයින: මහණෙනි, ශාසනය මොනොවට දෙසන ලද බැවිනි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 7",
                "level": "1"
            },
            {
                "text": "මහණෙනි, වරදවා දෙසන ලද බාහිරකශාසනයෙහි දායකයා විසින් පමණ දත යුතු වෙයි. ප්‍රතිග්‍රාහකයා විසින් නොදත යුතු වේ. ඒ කවරහෙයින: මහණෙනි, ශාසනය වරදවා දෙසන ලද බැවිනි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 8.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, මොනොවට දෙසන ලද ශාසනයෙහි ප්‍රතිග්‍රාහකයා විසින් පමණ දත යුතු වෙයි. දායකයා විසින් නොදත යුතු වේ. ඒ කවරහෙයින: මහණෙනි, ශාසනය මොනොවට දෙසන ලද බැවිනි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 9.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, වරදවා දෙසන ලද බාහිරකශාසනයෙහි යමෙක් පටන්ගත් වැර ඇතියේ ද, හේ දුකසේ වෙසෙයි. ඒ කවරහෙයින: මහණෙනි, ධර්‍මය වරදවා දෙසන ලද බැවිනි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 10.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, මොනොවට දෙසන ලද ශාසනයෙහි යමෙක් කුසීත (තුන් විතක් ඇති) වේ ද, හේ දුකසේ වෙසෙයි. ඒ කවරහෙයින: මහණෙනි, ධර්‍මය මනාකොට දෙසන ලද බැවිනි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 11.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, වරදවා දෙසන ලද බාහිරක ශාසනයෙහි යමෙක් කුසීත වේ ද, හේ සුවසේ වෙසෙයි. ඒ කවරහෙයින: මහණෙනි, ධර්‍මය වරදවා දෙසන ලද බැවිනි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 12.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, මොනොවට දෙසන ලද ශාසනයෙහි යමෙක් පටන්ගත් වැර ඇතියේ ද, හේ සුවසේ වෙසෙයි. ඒ කවරහෙයින: මහණෙනි, ධර්‍මය මොනොවට දෙසන ලද බැවිනි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 13.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම්සේ අල්පමාත්‍ර වූත් ගූථය දුගඳ වේ ද, එසෙයින් ම මම අල්පමාත්‍ර කාලයකුදු යටතින් ඇඟිලිපොළනකල් පමණකුදු භවප්‍රතිසන්ධිය නො වණමි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "73"
            },
            {
                "type": "heading",
                "text": "1. 16. 3. 14 - 17.",
                "level": "1"
            },
            {
                "text": "මහණෙනි, යම්සේ අල්පමාත්‍ර වූ ද මුත්‍රය දුඟද වේ ද ... අල්පමාත්‍ර වූ ද කෙළ දුඟද වේ ද ... අල්පමාත්‍ර වූ ද පූයා දුඟද වේ ද ... අල්පමාත්‍ර වූ ද ලෙහෙ දුඟද වේ ද, මහණෙනි, එසෙයින් ම අල්පමාත්‍රකාලයකුදු යටත් පිරිසෙයින් ඇඟිලිවටන කලක් පමණකුදු භවය මම නො වණමි.",
                "type": "paragraph"
            },
            {
                "text": "තෙවන වගයි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-1-16"
    }
]