[
    {
        "filename": "an-2-3",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 116
            },
            {
                "type": "heading",
                "text": "3. බාලවග්ගො",
                "level": 3
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 1.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**[සාවත්ථිනිදානං:]**"
            },
            {
                "type": "paragraph",
                "text": "21. ද්වෙමෙ භික්ඛවෙ බාලා. කතමෙ ද්වෙ? යො ච අච්චයං අච්චයතො න පස්සති, යො ච අච්චයං දෙසෙන්තස්ස යථාධම්මං න පතිගණ්හාති.{2 නප්පටිග්ගණ්හාති - මඡසං.} ඉමෙ ඛො භික්ඛවෙ ද්වෙ බාලාති."
            },
            {
                "type": "paragraph",
                "text": "ද්වෙමෙ භික්ඛවෙ පණ්ඩිතා. කතමෙ ද්වෙ? යො ච අච්චයං අච්චයතො පස්සති, යො ච අච්චයං දෙසෙන්තස්ස යථාධම්මං පතිගණ්හාති.{3 පටිග්ගණ්හාති - මඡසං. පටිගණ්හාති - සී 1} ඉමෙ ඛො, භික්ඛවෙ, ද්වෙ පණ්ඩිතාති."
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "22. ද්වෙමෙ භික්ඛවෙ තථාගතං අබ්භාචික්ඛන්ති. කතමෙ ද්වෙ? දුට්ඨො වා දොසන්තරො, සද්ධො වා දුග්ගහිතෙන. ඉමෙ ඛො භික්ඛවෙ ද්වෙ තථාගතං අබ්භාචික්ඛන්තීති."
            },
            {
                "type": "page-break",
                "text": "118"
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "23. ද්වෙමෙ භික්ඛවෙ තථාගතං අබ්භාචික්ඛන්ති. කතමෙ ද්වෙ? යො ච අභාසිතං අලපිතං තථාගතෙන භාසිතං ලපිතං තථාගතෙනාති දීපෙති, යො ච භාසිතං ලපිතං තථාගතෙන අභාසිතං අලපිතං තථාගතෙනාති දීපෙති. ඉමෙ ඛො භික්ඛවෙ ද්වෙ තථාගතං අබ්භාචික්ඛන්තීති."
            },
            {
                "type": "paragraph",
                "text": "ද්වෙමෙ භික්ඛවෙ තථාගතං නාබ්භාචික්ඛන්ති. කතමෙ ද්වෙ? යො ච අභාසිතං අලපිතං තථාගතෙන අභාසිතං අලපිතං තථාගතෙනාති දීපෙති, යො ච භාසිතං ලපිතං තථාගතෙන භාසිතං ලපිතං තථාගතෙනාති දීපෙති. ඉමෙ ඛො භික්ඛවෙ ද්වෙ තථාගතං නාබ්භාචික්ඛන්තීති."
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "24. ද්වෙමෙ භික්ඛවෙ තථාගතං අබ්භාචික්ඛන්ති. කතමෙ ද්වෙ? යො ච නෙය්යත්ථං සුත්තන්තං නීතත්ථො සුත්තන්තොති දීපෙති, යො ච නීතත්ථං සුත්තන්තං නෙය්යත්ථො සුත්තන්තොති දීපෙති. ඉමෙ ඛො භික්ඛවෙ ද්වෙ තථාගතං අබ්භාචික්ඛන්තීති."
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 5.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "25. ද්වෙමෙ භික්ඛවෙ තථාගතං නාබ්භාචික්ඛන්ති. කතමෙ ද්වෙ? යො ච නෙය්යත්ථං සුත්තන්තං නෙය්යත්ථො සුත්තන්තොති දීපෙති, යො ච නීතත්ථං සුත්තන්තං නීතත්ථො සුත්තන්තොති දීපෙති. ඉමෙ ඛො භික්ඛවෙ ද්වෙ තථාගතං නාබ්භාචික්ඛන්තීති."
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "26. පටිච්ඡන්නකම්මන්තස්ස භික්ඛවෙ ද්වින්නං ගතීනං අඤ්ඤතරා ගති පාටිකඞ්ඛා : නිරයො වා තිරච්ඡානයොනි වාති."
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 7.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "27. අප්පටිච්ඡන්නකම්මන්තස්ස භික්ඛවෙ ද්වින්නං ගතීනං අඤ්ඤතරා ගති පාටිකඞ්ඛා: දෙවා වා මනුස්සා වාති."
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 8.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "28. මිච්ඡාදිට්ඨිකස්ස භික්ඛවෙ ද්වින්නං ගතීනං අඤ්ඤතරා ගති පාටිකඞ්ඛා : නිරයො වා තිරච්ඡානයොනි වාති."
            },
            {
                "type": "page-break",
                "text": "120"
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 9.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "29. සම්මාදිට්ඨිකස්ස භික්ඛවෙ ද්වින්නං ගතීනං අඤ්ඤතරා ගති පාටිකඞ්ඛා : දෙවා වා මනුස්සා වාති."
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "30. දුස්සීලස්ස භික්ඛවෙ ද්වෙ පටිග්ගාහා : නිරයො වා තිරච්ඡානයොනි වාති.{1 අරඤ්ඤවනපත්ථානි - මඡසං.} සීලවතො භික්ඛවෙ ද්වෙ පටිග්ගාහා : දෙවා වා මනුස්සා වාති."
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 11.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "31. ද්වාහං භික්ඛවෙ අත්ථවසෙ සම්පස්සමානො අරඤ්ඤෙ වනපත්ථානි{2 අරඤ්ඤවනපත්ථානි - මඡසං.} පන්තානි සෙනාසනානි පටිසෙවාමි. කතමෙ ද්වෙ? අත්තනො ච දිට්ඨධම්මසුඛවිහාරං සම්පස්සමානො, පච්ඡිමඤ්ච ජනතං අනුකම්පමානො. ඉමෙ ඛො අහං භික්ඛවෙ ද්වෙ අත්ථවසෙ සම්පස්සමානො අරඤ්ඤෙ වනපත්ථානි පන්තානි සෙනාසනානි පටිසෙවාමීති."
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 12.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "32. ද්වෙමෙ භික්ඛවෙ ධම්මා විජ්ජාභාගියා. කතමෙ ද්වෙ? සමථො ච විපස්සනා ච. සමථො භික්ඛවෙ භාවිතො කමත්ථමනුභොති? චිත්තං භාවීයති. චිත්තං භාවිතං කමත්ථමනුභොති{3 කිමත්ථමනුහොති - ස්යා. කතමත්ථමනුහොති - කත්ථචි.}? යො රාගො, සො පහීයති. විපස්සනා භික්ඛවෙ භාවිතා කමත්ථමනුභොති? පඤ්ඤා භාවීයති. පඤ්ඤා භාවිතා කමත්ථමනුභොති? යා අවිජ්ජා, සා පහීයති. රාගුපක්කිලිට්ඨං වා භික්ඛවෙ චිත්තං න විමුච්චති. අවිජ්ජුපක්කිලිට්ඨා වා පඤ්ඤා භාවීයති. ඉති ඛො භික්ඛවෙ රාගවිරාගා චෙතොවිමුත්ති, අවිජ්ජාවිරාගා පඤ්ඤාවිමුත්තීති."
            },
            {
                "type": "centered",
                "text": "බාලවග්ගො තතියො.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 117
            },
            {
                "text": "3. බාල වර්ගය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 1.",
                "level": "1"
            },
            {
                "text": "**[සැවැත්නිදානයි:]**",
                "type": "unindented"
            },
            {
                "text": "21. මහණෙනි, මේ බාලයෝ දෙදෙනෙක් වෙති. කවර දෙදෙනෙක යත්: යමෙක් වරද වරද විසින් නො දක්නේ ද, යමෙකුත් (පිළිගෙණ) වරද දෙසන්නහුගේ යථාධර්‍මය නො පිළිගන්නේ ද, මහණෙනි, මොහු බාලයෝ දෙදෙන වෙති.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මේ පණ්ඩිතයෝ දෙදෙනෙක් වෙති. කවර දෙදෙනෙක යත්: යමෙක් වරද වරද විසින් දක්නේ ද, යමෙකුත් පිළිගෙණ වරද දෙසන්නහුගේ යථාධර්‍මය පිළිගන්නේ ද, මහණෙනි, මොහු දෙදෙන පණ්ඩිත වෙති.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 2.",
                "level": "1"
            },
            {
                "text": "22. මහණෙනි, මොහු දෙදෙන තථාගතයන්ට අභ්‍යාඛ්‍යාන කෙරෙත් (අභූතයෙන් දොස් තබත්). කවර දෙදෙනෙක යත්: දුෂ්ට වූයේ ඇතුළත සිටුනා ද්වෙෂය ඇත්තේ හෝ වේ ද, වැරදි ලෙස ගැණීමෙන් වූ සැදැහැ ඇත්තේ හෝ වේ ද (යන දෙදෙන වෙති.) මහණෙනි, මොහු දෙදෙන තථාගතයන්ට අභ්‍යාඛ්‍යාන කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "119"
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 3.",
                "level": "1"
            },
            {
                "text": "23. මහණෙනි, මොහු දෙදෙන තථාගතයන්ට අභ්‍යාඛ්‍යාන කෙරෙත්. කවර දෙදෙන යත්: යමෙක් තථාගතයන් වහන්සේ විසින් නො දෙසන ලද්ද නො තෙපලන ලද්ද තථාගතයන් වහන්සේ විසින් දෙසනලදැ යි තෙපලන ලදැයි දක්වා ද, යමෙකුත් තථාගතයන් වහන්සේ විසින් දෙසන ලද්ද තෙපලන ලද්ද තථාගතයන් වහන්සේ විසින් නො දෙසන ලදැයි නො තෙපලන ලදැයි දක්වා ද (යන දෙදෙන වෙති.) මහණෙනි, මොහු දෙදෙන තථාගතයන්ට අභ්‍යාඛ්‍යාන කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මොහු දෙදෙන තථාගතයන්ට අභ්‍යාඛ්‍යාන නො කෙරෙත්. කවර දෙදෙන යත්: යමෙක් තථාගතයන් වහන්සේ විසින් නො දෙසන ලද්ද නො තෙපලන ලද්ද තථාගතයන් වහන්සේ විසින් නො දෙසන ලදැයි නො තෙපලන ලදැයි දක්වා ද, යමෙකුත් තථාගතයන් වහන්සේ විසින් දෙසන ලද්ද තෙපලන ලද්ද තථාගතයන් වහන්සේ විසින් දෙසන ලදැයි තෙපලන ලදැයි දක්වා ද, (යන දෙදෙන වෙති.) මහණෙනි, මොහු දෙදෙන තථාගතයන්ට අභ්‍යාඛ්‍යාන නො කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 4.",
                "level": "1"
            },
            {
                "text": "24. මහණෙනි, මොහු දෙදෙන තථාගතයන්ට අභ්‍යාඛ්‍යාන කෙරෙත්. කවර දෙදෙන යත්: යමෙක් එළවා කිය යුතු අර්ථය ඇති සූත්‍රාන්තය හෙළි කළ අරුත් ඇති සූත්‍රාන්තය යි දක්වා ද, යමෙකුත් හෙළි කළ අරුත් ඇති සුත්‍රාන්තය එළවා කිය යුතු අරුත් ඇති සුත්‍රාන්තය යි දක්වා ද (යන මේ දෙදෙන වෙති.) මහණෙනි, මොහු දෙදෙන තථාගතයන්ට අභ්‍යාඛ්‍යාන කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 5.",
                "level": "1"
            },
            {
                "text": "25. මහණෙනි, මොහු දෙදෙන තථාගතයන්ට අභ්‍යාඛ්‍යාන නො කෙරෙත්. කවර දෙදෙන යත්: යමෙක් එළවා කිය යුතු අරුත් ඇති සූත්‍රාන්තය එළවා කිය යුතු අරුත් ඇති සූත්‍රාන්තය යි දක්වා ද, යමෙකුත් හෙළි කළ අරුත් ඇති සූත්‍රාන්තය හෙළි කළ අරුත් ඇති සූත්‍රාන්තය යි දක්වා ද, (යන මේ දෙදෙන වෙති.) මහණෙනි, මොහු දෙදෙන තථාගතයන්ට අභ්‍යාඛ්‍යාන නො කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 6.",
                "level": "1"
            },
            {
                "text": "26. මහණෙනි, පිළිසන්කමත්හට (පව්කම් ඇත්තහුට) නිරය හෝ තිරිසන් යෝනිය හෝ යයි දෙගතීන් අතුරෙන් එක්තරා ගතියෙක් කැමති විය යුතුයි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 7.",
                "level": "1"
            },
            {
                "text": "27. මහණෙනි, නො පිළිසන් කමත්හට දේවගතිය හෝ මනුෂ්‍යගතිය හෝ යයි දෙගතීන් අතුරෙන් එක්තරා ගතියෙක් කැමති විය යුතුයි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 8.",
                "level": "1"
            },
            {
                "text": "28. මහණෙනි, මිථ්‍යාදෘෂ්ටිකයාට නිරය හෝ තිරිසන් යොනිය හෝ යයි දෙගතීන් අතුරෙන් එක්තරා ගතියෙක් කැමති විය යුතුයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "121"
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 9.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "29. මහණෙනි, සම්‍යක්දෘෂ‍්ටිකයාට දෙවගතිය හෝ මනුෂ්‍යගතිය හෝ යයි දෙගතීන් අතුරෙන් එක්තරා ගතියෙක් කැමති විය යුතුයි."
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 10.",
                "level": "1"
            },
            {
                "text": "30. මහණෙනි, දුශ්ශීලයාගේ පිළිගාවෝ (ප්‍රතිග්‍රාහකයෝ) දෙදෙනෙකි. නිරය හෝ තිරිසන් යොනිය හෝ යි. මහණෙනි, සිල්වත්හුගේ පිළිගාවෝ දෙදෙනෙකි. දෙවියෝ හෝ මනුෂ්‍යයෝ හෝ යි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 11.",
                "level": "1"
            },
            {
                "text": "31. මහණෙනි, මම කරුණු දෙකක් දක්නෙම් අරන් ද, වනපෙත් ද, ගැඹුරු වල් ද යන සෙනසුන් සෙවනය කරමි. කවර දෙකෙක යත්: තමන්හට ඉහාත්මසුඛවිහරණය දක්නෙම් හෝ පශ්චිමජනතාවට අනුකම්පා කරන්නෙම් හෝ යි මහණෙනි, මම මේ කරුණු දෙක දක්නෙම් අරන් ද, වනපෙත් ද, ගැඹුරු වල් ද යන සෙනසුන් සෙවනය කරමි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 3. 12.",
                "level": "1"
            },
            {
                "text": "32. මහණෙනි, මේ විද්‍යාභාගීය ධර්‍මයෝ දෙදෙනෙකි. කවර දෙදෙනෙක යත්: ශමථය හා විදර්‍ශනාව හා යන දෙදෙනායි. මහණෙනි, ශමථය වඩන ලද්දේ කිනම් අර්ථයක් සපයා ද? මාර්‍ගචිත්තය වැඩෙයි. වැඩුනු සිත කිනම් අර්ථයක් සපයා ද?යම් රාගයෙක් වේ නම්, එය පැහෙයි (ප්‍රහීණ වේ.) මහණෙනි, විදර්‍ශනාව වඩන ලද්දී කිනම් අර්ථයක් සපයා ද? මාර්‍ගප්‍රඥාව වැඩෙයි. වැඩුනු ප්‍රඥාව කිනම් අර්ථයක් සපයා ද? යම් අවිද්‍යායෙක් වේ නම් එය පැහෙයි. මහණෙනි, රාගයෙන් කිලිටි වූ සිත නො මිදෙයි. අවිද්‍යායෙන් කිලිටි වූ ප්‍රඥාව නො වැඩෙයි. මහණෙනි, මෙසේ වනාහි රාගයාගේ ක්‍ෂයවිරාගයෙන් (ඵලසමාධිසඞ්ඛ්‍යාත) චිත්තවිමුක‍්තිය වේ. අවිද්‍යාවගේ ක්‍ෂයවිරාගයෙන් (ඵලප්‍රඥාසඞ්ඛ්‍යාත) ප්‍රඥාවිමුක්තිය වේ.",
                "type": "paragraph"
            },
            {
                "text": "බාල වග තෙවැනි යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-2-3"
    }
]