[
    {
        "filename": "an-2-12",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 170
            },
            {
                "type": "heading",
                "text": "[ 12. ආයාචනවග්ගො ]",
                "level": "3"
            },
            {
                "type": "unindented",
                "text": "**[සාවත්ථි නිදානං:]**"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "13. සද්ධො භික්ඛවෙ භික්ඛු එවං සම්මා ආයාචමානො ආයාචෙය්ය : තාදිසො හොමි, යාදිසා සාරිපුත්තමොග්ගල්ලානාති. එසා භික්ඛවෙ තුලා, එතං පමාණං මම සාවකානං භික්ඛූනං යදිදං සාරිපුත්තමොග්ගල්ලානාති."
            },
            {
                "type": "page-break",
                "text": "172"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "14. සද්ධා භික්ඛවෙ භික්ඛුනී එවං සම්මා ආයාචමානා ආයාචෙය්ය : තාදිසා{1 තාදිසීහොමි - මඡසං.} හොමි, යාදිසා{2 යාදිසී - මඡසං.} ඛෙමා ච භික්ඛුනී උප්පලවණ්ණා චාති. එසා භික්ඛවෙ තුලා, එතං පමාණං මම සාවිකානං භික්ඛුනීනං යදිදං ඛෙමා ච භික්ඛුනී, උප්පලවණ්ණා චාති."
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "15. සද්ධො භික්ඛවෙ උපාසකො එවං සම්මා ආයාචමානො ආයාචෙය්ය : තාදිසො හොමි, යාදිසො චිත්තො ච ගහපති, හත්ථකො ච ආලවකොති. එසා භික්ඛවෙ තුලා, එතං පමාණං මම සාවකානං උපාසකානං යදිදං චිත්තො ච ගහපති, හත්ථකො ච ආලවකොති."
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "16. සද්ධා භික්ඛවෙ උපාසිකා එවං සම්මා ආයාචමානා ආයාචෙය්ය : තාදිසා{3 තාදිසීහොමි - මඡසං.} හොමි, යාදිසා{4 යාදිසී - මඡසං.} ඛුජ්ජුත්තරා ච උපාසිකා, වෙලුකණ්ටකියා ච නන්දමාතාති. එසා භික්ඛවෙ තුලා, එතං පමාණං මම සාවිකානං උපාසිකානං යදිදං ඛුජ්ජුත්තරා ච උපාසිකා, වෙළුකණ්ඩකියා ච නන්දමාතාති."
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 5.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "17. ද්වීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො බාලො අබ්යත්තො අසප්පුරිසො ඛතං උපහතං අත්තානං පරිහරති, සාවජ්ජො ච හොති සානුවජ්ජො{5 සානුවජ්ජො ච - මඡසං.} විඤ්ඤූනං, බහුඤ්ච අපුඤ්ඤං පසවති. කතමෙහි ද්වීහි: අනනුවිච්ච අපරියොගාහෙත්වා අවණ්ණාරහස්ස වණ්ණං භාසති. අනනුවිච්ච අපරියොගාහෙත්වා වණ්ණාරහස්ස අවණ්ණං භාසති. ඉමෙහි ඛො භික්ඛවෙ ද්වීහි ධම්මෙහි සමන්නාගතො බාලො අබ්යත්තො අසප්පුරිසො ඛතං උපහතං අත්තානං පරිහරති, සාවජ්ජො ච හොති සානුවජ්ජො ච විඤ්ඤූනං, බහුඤ්ච අපුඤ්ඤං පසවති.{6 පසවතීති - මඡසං.}"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "18. ද්වීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො පණ්ඩිතො බ්යත්තො සප්පුරිසො අක්ඛතං අනුපහතං අත්තානං පරිහරති, අනවජ්ජො ච හොති අනනුවජ්ජො විඤ්ඤූනං, බහුඤ්ච පුඤ්ඤං පසවති. කතමෙහි ද්වීහි: අනුවිච්ච පරියොගාහෙත්වා අවණ්ණාරහස්ස අවණ්ණං භාසති, අනුවිච්ච පරියොගාහෙත්වා වණ්ණාරහස්ස වණ්ණං භාසති. ඉමෙහි ඛො භික්ඛවෙ ද්වීහි ධම්මෙහි සමන්නාගතො පණ්ඩිතො බ්යත්තො සප්පුරිසො අක්ඛතං අනුපහතං අත්තානං පරිහරති. අනවජ්ජො ච හොති, අනනුවජ්ජො විඤ්ඤූනං. බහුඤ්ච පුඤ්ඤං පසවතීති."
            },
            {
                "type": "page-break",
                "text": "174"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "19. ද්වීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො බාලො අබ්යත්තො අසප්පුරිසො ඛතං උපහතං අත්තානං පරිහරති, සාවජ්ජො ච හොති සානුවජ්ජො විඤ්ඤූනං. බහුඤ්ච අපුඤ්ඤං පසවති. කතමෙහි ද්වීහි: අනනුවිච්ච අපරියොගාහෙත්වා අප්පසාදනීයෙ ඨානෙ පසාදං උපදංසෙති. අනනුවිච්ච අපරියොගාහෙත්වා පසාදනියෙ ඨානෙ අප්පසාදං උපදංසෙති. ඉමෙහි ඛො භික්ඛවෙ ද්වීහි ධම්මෙහි සමන්නාගතො බාලො අබ්යත්තො අසප්පුරිසො ඛතං උපහතං අත්තානං පරිහරති. සාවජ්ජො ච හොති, සානුවජ්ජො{1 සානුවජ්ජො ච - මඡසං.} විඤ්ඤූනං. බහුඤ්ච අපුඤ්ඤං පසවති.{2 පසවතීති - මඡසං.}"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 7.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "20. ද්වීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො පණ්ඩිතො බ්යත්තො සප්පුරිසො අක්ඛතං අනුපහතං අත්තානං පරිහරති, අනවජ්ජො ච හොති අනනුවජ්ජො විඤ්ඤූනං, බහුඤ්ච පුඤ්ඤං පසවති. කතමෙහි ද්වීහි: අනුවිච්ච පරියොගාහෙත්වා අප්පසාදනීයෙ ඨානෙ අප්පසාදං උපදංසෙති, අනුවිච්ච පරියොගාහෙත්වා පසාදනීයෙ ඨානෙ පසාදං උපදංසෙති. ඉමෙහි ඛො භික්ඛවෙ ද්වීහි ධම්මෙහි සමන්නාගතො පණ්ඩිතො බ්යත්තො සප්පුරිසො අක්ඛතං අනුපහතං අත්තානං පරිහරති. අනවජ්ජො ච හොති, අනනුවජ්ජො විඤ්ඤූනං, බහුඤ්ච පුඤ්ඤං පසවතීති."
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 8",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "21. ද්වීසු භික්ඛවෙ මිච්ඡා පටිපජ්ජමානො බාලො අබ්යත්තො අසප්පුරිසො ඛතං උපහතං අත්තානං පරිහරති, සාවජ්ජො ච හොති සානුවජ්ජො විඤ්ඤූනං, බහුඤ්ච අපුඤ්ඤං පසවති. කතමෙසු ද්වීසු: මාතරි ච පිතරි ච. ඉමෙසු ඛො භික්ඛවෙ ද්වීසු මිච්ඡා පටිපජ්ජමානො බාලො අබ්යත්තො අසප්පුරිසො ඛතං උපහතං අත්තානං පරිහරති, සාවජ්ජො ච හොති සානුවජ්ජො විඤ්ඤූනං, බහුඤ්ච අපුඤ්ඤං පසවති.{3 පසවතීති - මඡසං.}"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 9.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "22. ද්වීසු භික්ඛවෙ සම්මා පටිපජ්ජමානො පණ්ඩිතො බ්යත්තො සප්පුරිසො අක්ඛතං අනුපහතං අත්තානං පරිහරති, අනවජ්ජො ච හොති අනනුවජ්ජො විඤ්ඤූනං. බහුඤ්ච පුඤ්ඤං පසවති. කතමෙසු ද්වීසු: මාතරි ච පිතරි ච. ඉමෙසු ඛො භික්ඛවෙ ද්වීසු සම්මා පටිපජ්ජමානො පණ්ඩිතො බ්යත්තො සප්පුරිසො අක්ඛතං අනුපහතං අත්තානං පරිහරති, අනවජ්ජො ච හොති අනනුවජ්ජො ච විඤ්ඤූනං, බහුඤ්ච පුඤ්ඤං පසවතීති."
            },
            {
                "type": "page-break",
                "text": "176"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "23. ද්වීසු භික්ඛවෙ මිච්ඡා පටිපජ්ජමානො බාලො අබ්යත්තො අසප්පුරිසො ඛතං උපහතං අත්තානං පරිහරති, සාවජ්ජො ච හොති සානුවජ්ජො ච විඤ්ඤූනං. බහුඤ්ච අපුඤ්ඤං පසවති. කතමෙසු ද්වීසු: තථාගතෙ ච තථාගතසාවකෙ ච. ඉමෙසු ඛො භික්ඛවෙ මිච්ඡා පටිපජ්ජමානො බාලො අබ්යත්තො අසප්පුරිසො ඛතං උපහතං අත්තානං පරිහරති, සාවජ්ජො ච හොති සානුවජ්ජො විඤ්ඤූනං, බහුඤ්ච අපුඤ්ඤං පසවති."
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 11.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "24. ද්වීසු භික්ඛවෙ සම්මා පටිපජ්ජමානො පණ්ඩිතො බ්යත්තො සප්පුරිසො අක්ඛතං අනුපහතං අත්තානං පරිහරති, අනවජ්ජො ච හොති, අනනුවජ්ජො විඤ්ඤූනං. බහුඤ්ච පුඤ්ඤං පසවති. කතමෙසු ද්වීසු: තථාගතෙ ච තථාගතසාවකෙ ච. ඉමෙසු ඛො භික්ඛවෙ ද්වීසු සම්මා පටිපජ්ජමානො පණ්ඩිතො බ්යත්තො සප්පුරිසො අක්ඛතං අනුපහතං අත්තානං පරිහරති, අනවජ්ජො ච හොති අනනුවජ්ජො විඤ්ඤූනං, බහුඤ්ච පුඤ්ඤං පසවතීති."
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 12.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "25. ද්වෙමෙ භික්ඛවෙ ධම්මා. කතමෙ ද්වෙ: සචිත්තවොදානඤ්ච, න ච කිඤ්චි ලොකෙ උපාදියති. ඉමෙ ඛො භික්ඛවෙ ද්වෙ ධම්මාති."
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 13.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "26. ද්වෙමෙ භික්ඛවෙ ධම්මා. කතමෙ ද්වෙ: කොධො ච උපනාහො ච. ඉමෙ ඛො භික්ඛවෙ ද්වෙ ධම්මාති."
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 14.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "27. ද්වෙමෙ භික්ඛවෙ ධම්මා. කතමෙ ද්වෙ: කොධවිනයො ච උපනාහවිනයො ච. ඉමෙ ඛො භික්ඛවෙ ද්වෙ ධම්මාති."
            },
            {
                "type": "centered",
                "text": "වග්ගො ද්වාදසමො.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 171
            },
            {
                "text": "[ 12. ආයාචන වර්ගය ]",
                "type": "heading",
                "level": "3"
            },
            {
                "type": "unindented",
                "text": "**[සැවැත්නිදානයි:]**"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 1.",
                "level": "1"
            },
            {
                "text": "13. මහණෙනි, සැදැහැති මහණ මෙසේ මොනොවට යදනේ සැරියුත් මුගලන් දෙදෙන යම්බඳු වෙත් නම්, එබඳු වෙම්ව යි යදනේය. (කවර හෙයින යත්:) මහණෙනි, යම් සැරියුත් මුගලන් දෙදනෙක් වෙත් නම්, මාගේ ශ්‍රාවක භික්‍ෂූන්ට තෙල තුලාව ය. තෙල ප්‍රමාණ ය යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "173"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 2.",
                "level": "1"
            },
            {
                "text": "14. මහණෙනි, සැදැහැති මෙහෙණ මෙසේ මොනොවට යදනී ඛෙමා උප්පලවණ්ණා දෙනම යම්බඳු වෙත් නම්, එබඳු වෙම්ව යි යදනීය. (කවරහෙයින යත්:) මහණෙනි, ඛෙමා හා උප්පලවණ්ණා හා යන දෙදෙන යම්සේ වෙත් නම්, මාගේ ශ්‍රාවිකා භික්‍ෂූණීන්ට තෙල තුලාව ය. තෙල ප්‍රමාණ ය යි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 3.",
                "level": "1"
            },
            {
                "text": "15. මහණෙනි, සැදැහැති උපාසක මෙසේ මොනොවට යදනේ චිත්ත ගෘහපති හා හත්‍ථක ආලවක හා යම්බඳු වෙත් නම්, එබඳු වෙම්ව යි යදනේය. (කවරහෙයින යත්:) මහණෙනි, මේ චිත්ත ගෘහපති හා හත්‍ථක ආලවක තෙමේත් යම්සේ වෙත් නම් මාගේ ශ්‍රාවක උපාසකයන්ට තෙල තුලාව වේ, තෙල ප්‍රමාණය යි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 4.",
                "level": "1"
            },
            {
                "text": "16. මහණෙනි, සැදැහැති උපාසිකාව මෙසේ මොනොවට යදනී ඛුජ්ජුත්තරාව උපාසිකාව හා වෙළුකණ්ටකියා නන්‍දමාතාව හා යම්බඳු වෙත් නම්, එබඳු වෙම්ව යි යදනීය. (කවරහෙයින යත්:) මහණෙනි, ඛුජ්ජුත්තරා උපාසිකාව ද වෙළුකණ්ටකීය නන්‍දමාතාව ද යන දෙදෙනෙක් වෙත් නම් මාගේ ශ්‍රාවිකා උපාසිකාවනට තෙල තුලාව වේ. තෙල ප්‍රමාණය යි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 5.",
                "level": "1"
            },
            {
                "text": "17. මහණෙනි, දහම් දෙකෙකින් සමන්‍වාගත වූ අව්‍යක්ත වූ අසත්පුරුෂ වූ බාල තෙමේ සාරා දමන ලද ගුණ ඇති, නට ගුණ ඇති ආත්මය පරිහරණය කරයි. සදොස් වූයේ ද නුවණැත්තන් ගේ උපවාදයට යොග්‍ය වූයේ ද වේ. බොහෝ පව් ද රැස් කරයි. කවර දෙකෙකින යත්: නොදැන නොපිවිස නුගුණ කීමට සුදුස්සාගේ ගුණ කියා නම්, නොදැන නොපිවිස ගුණ කීමට සුදුස්සාගේ අගුණ කියා නම්, මහණෙනි, මේ දහම් දෙකින් යුක්ත වූ අව්‍යක්ත වූ අසත්පුරුෂ වූ බාල තෙමේ සාරා දමන ලද ගුණ ඇති, නට ගුණ ඇති ආත්මය පරිහරණය කෙරෙයි. සදොස් වූයේ ද නුවණැත්තන්ගේ උපවාදයට යොග්‍ය වූයේ ද වේ. බොහෝ පව් ද රැස් කරණේ ය යි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 6.",
                "level": "1"
            },
            {
                "text": "18. මහණෙනි, දහම් දෙකෙකින් සමන්‍වාගත වූ ව්‍යක්ත වූ සත්පුරුෂ වූ පණ්ඩිත තෙමේ සාරා නො දැමූ ගුණ ඇති, නොනට ගුණ ඇති ආත්මය පරිහරණය කරණේය. නිදොස් වූයේ ද නුවණැත්තන්ගේ උපවාදයට යොග්‍ය නුවූයේ ද වේ. බොහෝ පින් ද රැස් කරණේය. කවර දෙකෙකින යත්: දැන පිවිස නුගුණ කිය යුත්තාගේ නුගුණ කියා නම්, දැන පිවිස ගුණ කීමට සුදුස්සාගේ ගුණ කියා නම්, මහණෙනි, මේ දහම් දෙකින් යුක්ත වූ ව්‍යක්ත වූ සත්පුරුෂ වූ පණ්ඩිත තෙම සාරා නො දමන ලද ගුණ ඇති, නොනට ගුණ ඇති ආත්මය පරිහරණය කෙරෙයි. නිදොස් වූයේ ද නුවණැත්තන්ගේ උපවාදයට යොග්‍ය නුවූයේ ද වේ. බොහෝ පින් ද රැස් කරණේ ය යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "175"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 7.",
                "level": "1"
            },
            {
                "text": "19. මහණෙනි, දහම් දෙකෙකින් සමන්‍වාගත වූ අව්‍යක්ත වූ අසත්පුරුෂ වූ බාල තෙමේ කනන ලද ගුණ ඇති, නට ගුණ ඇති ආත්මය පරිහරණය කරණේය. සදොස් වූයේ ද නුවණැත්තන්ගේ උපවාදයට යොග්‍ය වූයේ ද වේ. බොහෝ පව් ද රැස් කරණේය. කවර දෙකෙකින යත්: නොදැන නොපිවිස නොපැහැදිය යුතු තන්හි ප්‍රසාදය දක්වන්නේ ද, නො දැන නොපිවිස පැහැදිය යුතු තන්හි අප්‍රසාදය දක්වන්නේ ද යන දෙකිනි. මහණෙනි, මේ දහම් දෙකින් සමන්‍වාගත වූ අව්‍යක්ත වූ අසත්පුරුෂ වූ බාල තෙමේ කනන ලද ගුණ ඇති, නට ගුණ ඇති ආත්මය පරිහරණය කරණේය. සදොස් වූයේ ද නුවණැත්තන්ගේ උපවාදයට යොග්‍ය වූයේ ද වේ. බොහෝ පව් ද රැස් කරණේ ය යි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 8.",
                "level": "1"
            },
            {
                "text": "20. මහණෙනි, දහම් දෙකෙකින් සමන්‍වාගත වූ ව්‍යක්ත වූ සත්පුරුෂ වූ පණ්ඩිත තෙමේ නො කනන ලද ගුණ ඇති නොනට ගුණ ඇති ආත්මය පරිහරණය කරණේය. නිදොස් වූයේ ද නුවණැත්තවුන් විසින් උපවාද නොකට යුත්තේ ද වේ. බොහෝ පින් ද රැස් කරයි. කවර දෙකෙකින යත්: දැන පිවිස නො පැහැදිය යුතු තන්හි අප්‍රසාදය දක්වන්නේ ද, දැන පිවිස පැහැදිය යුතු තන්හි ප්‍රසාදය දක්වන්නේ ද යන දෙකිනි. මහණෙනි, මේ දහම් දෙකින් සමන්‍වාගත වූ ව්‍යක්ත වූ සත්පුරුෂ වූ පණ්ඩිත තෙම නො කනන ලද ගුණ ඇති නොනට ගුණ ඇති ආත්මය පරිහරණය කරණේය. නිදොස් වූයේ ද නුවණැත්තන් විසින් උපවාද නොකට යුත්තේ ද වේ. බොහෝ කුසල් ද රැස් කරණේය යි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 9.",
                "level": "1"
            },
            {
                "text": "21. මහණෙනි, දෙතැනෙක්හි වරදවා පිළිපදනා වූ අව්‍යක්ත වූ අසත්පුරුෂ වූ බාල තෙම කනන ලද ගුණ ඇති නට ගුණ ඇති ආත්මය පරිහරණය කෙරෙයි, සදොස් වූයේ ද නුවණැත්තන් විසින් ගැරැහිය යුතු වූයේ ද වෙයි. බොහෝ පව් ද රැස් කරණේය. කවර දෙතැනෙකය යත්: මවු කෙරෙහි ද පියා කෙරෙහි ද යන දෙතැන්හිය. මහණෙනි, මේ දෙතැන්හි වරදවා පිළිපදනා වූ අව්‍යක්ත වූ අසත්පුරුෂ වූ බාල තෙම කනන ලද ගුණ ඇති නට ගුණ ඇති ආත්මය පරිහරණය කරණේය. සදොස් වූයේ ද නුවණැත්තන් විසින් උපවාද කටයුත්තේ ද වේ. බොහෝ පව් ද රැස් කරණේය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 9.",
                "level": "1"
            },
            {
                "text": "22. මහණෙනි, දෙතැනෙක්හි මොනොවට පිළිපදනා වූ ව්‍යක්ත වූ සත්පුරුෂ වූ පණ්ඩිත තෙම නොකනන ලද ගුණ ඇති නොනට ගුණ ඇති ආත්මය පරිහරණය කෙරෙයි. නිදොස් වූයේ ද නුවණැත්තන් විසින් උපවාද නො කට යුත්තේ ද වෙයි. බොහෝ කුසල් ද රැස් කරණේය. කවර දෙතැනෙක යත්: මවු කෙරෙහි ද පියා කෙරෙහි ද යන දෙතැන්හිය. මහණෙනි, මේ දෙතැන්හි මොනොවට පිළිපදනා වූ ව්‍යක්ත වූ සත්පුරුෂ වූ පණ්ඩිත තෙම නො කනන ලද ගුණ ඇති නොනට ගුණ ඇති ආත්මය පරිහරණය කරණේය. නිදොස් වූයේ ද නුවණැත්තන් විසින් උපවාද නො කටයුත්තේ ද වේ. බොහෝ පින් ද රැස් කරණේය යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "177"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 10.",
                "level": "1"
            },
            {
                "text": "23. මහණෙනි, දෙතැනෙක වරදවා පිළිපදනා වූ අව්‍යක්ත වූ අසත්පුරුෂ වූ බාල තෙම කනන ලද ගුණ ඇති නටගුණ ඇති ආත්මය පරිහරණය කරණේය. සදොස් වූ යේ ද නුවණැත්තන් විසින් උපවාද කළ යුත්තේ ද වෙයි. බොහෝ පව් ද රැස් කරණේය. කවර දෙතැනෙකය යත්: තථාගතයන් වහන්සේ කෙරෙහි ද තථාගතශ්‍රාවකයා කෙරෙහි ද යන දෙතන්හිය. මහණෙනි, මේ දෙතන්හි වරදවා පිළිපදනා වූ අව්‍යක්ත වූ අසත්පුරුෂ වූ බාල තෙම කනන ලද ගුණ ඇති නට ගුණ ඇති ආත්මය පරිහරණය කරණේය. සදොස් වූයේ ද නුවණැත්තවුන් විසින් උපවාද කටයුත්තේ ද වේ. බොහෝ පව් ද රැස් කරණේ ය යි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 12.",
                "level": "1"
            },
            {
                "text": "24. මහණෙනි, දෙතැනෙක මනාව පිළිපදනා වූ ව්‍යක්ත වූ සත්පුරුෂ වූ පණ්ඩිත තෙම නොකනන ලද ගුණ ඇති නොනට ගුණ ඇති ආත්මය පරිහරණය කරණේය. නිදොස් වූයේ ද නුවණැත්තන් විසින් උපවාද නො කටයුත්තේ ද වෙයි. බොහෝ පින් ද රැස් කරණේය. කවර දෙතැනෙකය යත්: තථාගතයන් වහන්සේ කෙරෙහි ද තථාගතශ්‍රාවකයා කෙරෙහි ද යන දෙතන්හිය. මහණෙනි, මේ දෙතන්හි මනාව පිළිපදනා වූ ව්‍යක්ත වූ සත්පුරුෂ වූ පණ්ඩිත තෙම නො කනන ලද ගුණ ඇති නොනට ගුණ ඇති ආත්මය පරිහරණය කරණේය. නිදොස් වූයේ ද නුවණැත්තන් විසින් උපවාද නො කටයුත්තේ ද වෙයි. බොහෝ පින් ද රැස් කරණේ ය යි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 12.",
                "level": 1
            },
            {
                "text": "25. මහණෙනි, මේ ධර්‍ම දෙකෙකි. කවර දෙකෙක යත්: (අෂ්ටසමාපත්ති සඞ්ඛ්‍යාත) සව්චිත්තව්‍යවදානය ද ලොවැ කිසි එක ද ධර්‍මයක් (තෘෂ‍්ණා දෘෂටි මානපරාමර්‍ශයෙන්) නොගන්නේ ද යන දෙකයි. මහණෙනි, මේ වනාහි ධර්‍ම දෙකයි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 13.",
                "level": 1
            },
            {
                "text": "26. මහණෙනි, මේ ධර්‍ම දෙකෙකි. කවර දෙකෙක යත්: ක්‍රෝධය හා උපනාහය හා යන දෙකයි. මහණෙනි, මේ වනාහි ධර්‍ම දෙකයි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 3. 12. 14.",
                "level": "1"
            },
            {
                "text": "27. මහණෙනි, මේ ධර්‍ම දෙකෙකි. කවර දෙකෙක යත්: ක්‍රෝධවිනය හා උපනාහවිනය හා යන දෙකයි. මහණෙනි, මේ වනාහි ධර්‍ම දෙකයි.",
                "type": "paragraph"
            },
            {
                "text": "දොළොස්වන වග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-2-12"
    }
]