[
    {
        "filename": "an-2-2",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 104
            },
            {
                "type": "heading",
                "text": "2. අධිකරණවග්ගො",
                "level": 3
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 1.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**[ සාවත්ථිනිදානං ]**"
            },
            {
                "type": "paragraph",
                "text": "11. ද්වෙමානි භික්ඛවෙ, බලානි. කතමානි ද්වෙ: පටිසඞ්ඛානබලඤ්ච, භාවනාබලඤ්ච. කතමඤ්ච භික්ඛවෙ, පටිසඞ්ඛානබලං: ඉධ භික්ඛවෙ, එකච්චො ඉති පටිසඤ්චික්ඛති: කායදුච්චරිතස්ස ඛො පාපකො විපාකො දිට්ඨෙ චෙව{1 දිට්ඨෙව ධම්මෙ - සීමු PTS.} ධම්මෙ අභිසම්පරායඤ්ච, වචීදුච්චරිතස්ස පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරායඤ්ච, මනොදුච්චරිතස්ස පාපකො විපාකො දිට්ඨෙ චෙව{2 දිට්ඨෙව ධම්මෙ - සීමු PTS.} ධම්මෙ අභිසම්පරායඤ්චාති. සො ඉති පටිසඞ්ඛාය කායදුච්චරිතං පහාය කායසුචරිතං භාවෙති. වචීදුච්චරිතං පහාය වචීසුචරිතං භාවෙති, මනොදුච්චරිතං පහාය මනොසුචරිතං භාවෙති. සුද්ධං අත්තානං පරිහරති. ඉදං වුච්චති භික්ඛවෙ, පටිසඞ්ඛානබලං. කතමඤ්ච භික්ඛවෙ, භාවනාබලං. තත්ර භික්ඛවෙ, යමිදං{3 යදිදං - සීමු.} භාවනාබලං. සෙඛමෙතං{4 සෙඛාන මෙතං බලං - මඡසං. සෙඛස්සෙතංචි බලං - කත්ථචි.} බලං. සෙඛං හි සො භික්ඛවෙ, බලං ආගම්ම රාගං පජහති, දොසං පජහති, මොහං පජහති. රාගං පහාය, දොසං පහාය, මොහං පහාය යං අකුසලං, තං න කරොති.{5 න තං කරොති - මඡසං.} යං පාපං, තං න සෙවති. ඉදං වුච්චති භික්ඛවෙ, භාවනාබලං. ඉමානි ඛො භික්ඛවෙ, ද්වෙ බලානීති."
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "12. ද්වෙමානි භික්ඛවෙ, බලානි. කතමානි ද්වෙ: පටිසඞ්ඛානබලඤ්ච, භාවනාබලඤ්ච. කතමඤ්ච භික්ඛවෙ, පටිසඞ්ඛානබලං: ඉධ භික්ඛවෙ, එකච්චො ඉති පටිසඤ්චික්ඛති: කායදුච්චරිතස්ස ඛො පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරායඤ්ච. වචීදුච්චරිතස්ස පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරායඤ්ච. මනොදුච්චරිතස්ස පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරායඤ්චාති. සො ඉති පටිසඞ්ඛාය කායදුච්චරිතං පහාය කායසුචරිතං භාවෙති, වචීදුච්චරිතං පහාය වචීසුචරිතං භාවෙති, මනොදුච්චරිතං පහාය මනොසුචරිතං භාවෙති, සුද්ධං අත්තානං පරිහරති. ඉදං වුච්චති භික්ඛවෙ, පටිසඞ්ඛානබලං. කතමඤ්ච භික්ඛවෙ, භාවනාබලං: ඉධ භික්ඛවෙ, භික්ඛු සතිසම්බොජ්ඣඞ්ගං භාවෙති විවෙකනිස්සිතං විරාගනිස්සිතං නිරොධනිස්සිතං වොසග්ගපරිණාමිං. ධම්මවිචයසම්බොජ්ඣඞ්ගං භාවෙති -පෙ- විරියසම්බොජ්ඣඞ්ගං භාවෙති -පෙ- පීතිසම්බොජ්ඣඞ්ගං භාවෙති -පෙ- පස්සද්ධිසම්බොජ්ඣඞ්ගං භාවෙති -පෙ- සමාධිසම්බොජ්ඣඞ්ගං භාවෙති -පෙ- උපෙක්ඛාසම්බොජ්ඣඞ්ගං භාවෙති විවෙකනිස්සිතං විරාගනිස්සිතං නිරොධනිස්සිතං වොසග්ගපරිණාමිං. ඉදං වුච්චති භික්ඛවෙ, භාවනාබලං. ඉමානි ඛො භික්ඛවෙ, ද්වෙ බලානීති."
            },
            {
                "type": "page-break",
                "text": "106"
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "13. ද්වෙමානි භික්ඛවෙ, බලානි. කතමානි ද්වෙ: පටිසඞ්ඛානබලඤ්ච භාවනාබලඤ්ච. කතමඤ්ච භික්ඛවෙ, පටිසඞ්ඛානබලං: ඉධ භික්ඛවෙ, එකච්චො ඉති පටිසඤ්චික්ඛති කායදුච්චරිතස්ස ඛො පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරායඤ්ච, වචීදුච්චරිතස්ස ඛො පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරායඤ්ච, මනොදුච්චරිතස්ස ඛො පාපකො විපාකො දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරායඤ්චාති. සො ඉති පටිසඞ්ඛාය කායදුච්චරිතං පහාය කායසුචරිතං භාවෙති, වචීදුච්චරිතං පහාය වචීසුචරිතං භාවෙති, මනොදුච්චරිතං පහාය මනොසුචරිතං භාවෙති, සුද්ධං අත්තානං පරිහරති. ඉදං වුච්චති භික්ඛවෙ, පටිසඞ්ඛානබලං. කතමඤ්ච භික්ඛවෙ, භාවනාබලං: ඉධ භික්ඛවෙ, භික්ඛු විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහරති. විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියං ඣානං උපසම්පජ්ජ විහරති. පීතියා ච විරාගා උපෙක්ඛකො ච විහරති සතො ච සම්පජානො, සුඛඤ්ච කායෙන පටිසංවෙදෙති, යං තං අරියා ආචික්ඛන්ති උපෙක්ඛකො සතිමා සුඛවිහාරීති, තතියං ඣානං උපසම්පජ්ජ විහරති. සුඛස්ස ච පහානා දුක්ඛස්ස ච පහානා පුබ්බෙව සොමනස්සදොමනස්සානං අත්ථඞ්ගමා අදුක්ඛං අසුඛං උපෙක්ඛාසතිපාරිසුද්ධිං චතුත්ථං ඣානං උපසම්පජ්ජ විහරති. ඉදං වුච්චති භික්ඛවෙ, භාවනාබලං. ඉමානි ඛො භික්ඛවෙ, ද්වෙ බලානීති."
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "14. ද්වෙමා භික්ඛවෙ, තථාගතස්ස ධම්මදෙසනා. කතමා ද්වෙ: සංඛිත්තෙන ච විත්ථාරෙන ච, ඉමා ඛො භික්ඛවෙ, ද්වෙ තථාගතස්ස ධම්මදෙසනාති."
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 5",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "15. යස්මිං භික්ඛවෙ, අධිකරණෙ ආපන්නො{1 ආපත්තාපන්නො - කත්ථචි.} ච භික්ඛු චොදකො ච භික්ඛු න සාධුකං අත්තනාව අත්තානං පච්චවෙක්ඛති{2 පච්චවෙක්ඛන්ති - සීමු.}, තස්මෙතං භික්ඛවෙ, අධිකරණෙ පාටිකඞ්ඛං, දීඝත්තාය ඛරත්තාය වාළත්තාය සංවත්තිස්සති, භික්ඛූ ච න ඵාසුකං{3 ඵාසු - කත්ථචි.} විහරිස්සන්තීති.{4 විහරිස්සන්ති - සීමු.} "
            },
            {
                "type": "paragraph",
                "text": "යස්මිං ච ඛො භික්ඛවෙ, අධිකරණෙ ආපන්නො ච භික්ඛු චොදකො ච භික්ඛු සාධුකං අත්තනාව අත්තානං පච්චවෙක්ඛති,{5 පච්චවෙක්ඛන්ති - සීමු.} තස්මෙතං භික්ඛවෙ, අධිකරණෙ පාටිකඞ්ඛං, න දීඝත්තාය ඛරත්තාය වාළත්තාය සංවත්තිස්සති, භික්ඛූ ච ඵාසුකං{6 ඵාසු - කත්ථචි.} විහරිස්සන්තීති:"
            },
            {
                "type": "page-break",
                "text": "108"
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ ආපන්නො භික්ඛු සාධුකං අත්තනාව අත්තානං පච්චවෙක්ඛති: ඉධ භික්ඛවෙ ආපන්නො භික්ඛු ඉති පටිසඤ්චික්ඛති, අහං ඛො අකුසලං ආපන්නො කඤ්චිදෙව දෙසං කායෙන. තං{1 මං සො භික්ඛු - මඡසං. තස්මා මං සො භික්ඛු - ස්යා. සී 1.} මං සො භික්ඛු අද්දස අකුසලං ආපජ්ජමානං කඤ්චිදෙව දෙසං කායෙන. නො චෙ අහං අකුසලං ආපජ්ජෙය්යං කඤ්චිදෙව දෙසං කායෙන, න මං සො භික්ඛු පස්සෙය්ය අකුසලං ආපජ්ජමානං කඤ්චිදෙව දෙසං කායෙන. යස්මා ච ඛො අහං අකුසලං ආපන්නො කඤ්චිදෙව දෙසං කායෙන. තස්මා මං සො භික්ඛු අද්දස අකුසලං ආපජ්ජමානං කඤ්චිදෙව දෙසං කායෙන. දිස්වා ච පන මං සො භික්ඛු අකුසලං ආපජ්ජමානං කඤ්චිදෙව දෙසං කායෙන අනත්තමනො අහොසි. අනත්තමනො සමානො අනත්තමනවචනං මං සො භික්ඛු අවච. අනත්තමනවචනාහං තෙන භික්ඛුනා වුත්තො සමානො අනත්තමනො අහොසිං. අනත්තමනො සමානො පරෙසං ආරොචෙසිං. ඉති මමෙව තත්ථ අච්චයො අච්චගමා සුඞ්කදායකංව භණ්ඩස්මින්ති. එවං ඛො භික්ඛවෙ ආපන්නො භික්ඛු සාධුකං අත්තනාව අත්තානං පච්චවෙක්ඛති."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ චොදකො භික්ඛු සාධුකං අත්තනාව අත්තානං පච්චවෙක්ඛති: ඉධ භික්ඛවෙ චොදකො භික්ඛු ඉති පටිසඤ්චික්ඛති: අයංඛො භික්ඛු අකුසලං ආපන්නො කඤ්චිදෙව දෙසං කායෙන. {2 අහං ඉමං භික්ඛු - මඡසං. ස්යා.}තාහං ඉමං භික්ඛුං අද්දසං අකුසලං ආපජ්ජමානං කඤ්චිදෙව දෙසං කායෙන. නො චෙ අයං භික්ඛු අකුසලං ආපජ්ජෙය්ය කඤ්චිදෙව දෙසං කායෙන, නාහං ඉමං භික්ඛුං පස්සෙය්යං අකුසලං ආපජ්ජමානං කඤ්චිදෙව දෙසං කායෙන. යස්මා ච ඛො අයං භික්ඛු අකුසලං ආපන්නො කඤ්චිදෙව දෙසං කායෙන, තස්මා අහං ඉමං භික්ඛුං අද්දසං අකුසලං ආපජ්ජමානං කඤ්චිදෙව දෙසං කායෙන. දිස්වා ච පනාහං ඉමං භික්ඛුං අකුසලං ආපජ්ජමානං කඤ්චිදෙව දෙසං කායෙන, අනත්තමනො අහොසිං. අනත්තමනො සමානො අනත්තමනවචනාහං ඉමං භික්ඛුං අවචං. අනත්තමනවචනායං භික්ඛු මයා වුත්තො සමානො අනත්තමනො අහොසි. අනත්තමනො සමානො පරෙසං ආරොචෙසි. ඉති මමෙව තත්ථ අච්චයො අච්චගමා සුඞ්කදායකංව{3 සුඞ්කදායිකංව - ස්යා.} භණ්ඩස්මින්ති. එවං ඛො භික්ඛවෙ චොදකො භික්ඛු සාධුකං අත්තනාව අත්තානං පච්චවෙක්ඛති."
            },
            {
                "type": "paragraph",
                "text": "යස්මිං භික්ඛවෙ අධිකරණෙ ආපන්නො ච භික්ඛු චොදකො ච භික්ඛු න සාධුකං අත්තනාව අත්තානං පච්චවෙක්ඛති, තස්මෙතං භික්ඛවෙ අධිකරණෙ පාටිකඞ්ඛං දීඝත්තාය ඛරත්තාය වාළත්තාය සංවත්තිස්සති. භික්ඛූ ච න ඵාසුකං විහරිස්සන්තීති. යස්මිං ච ඛො භික්ඛවෙ අධිකරණෙ ආපන්නො ච භික්ඛු චොදකො ච භික්ඛු සාධුකං අත්තනාව අත්තානං පච්චවෙක්ඛති, තස්මෙතං භික්ඛවෙ අධිකරණෙ පාටිකඞ්ඛං න දීඝත්තාය ඛරත්තාය වාළත්තාය සංවත්තිස්සති. භික්ඛූ ච ඵාසුකං විහරිස්සන්තීති."
            },
            {
                "type": "page-break",
                "text": "110"
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "16. අථ ඛො අඤ්ඤතරො බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො සො බ්රාහ්මණො භගවන්තං එතදවොච : කො නු ඛො භො ගොතම හෙතු, කො පච්චයො, යෙන මිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්තීති?"
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "paragraph",
                "text": "අධම්මචරියා{1 අධම්මචරිය විසමචරියා හෙතු - ස්යා.} විසමචරියා හෙතු ඛො බ්රාහ්මණ එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්තීති."
            },
            {
                "type": "unindented",
                "text": "(බ්රාහ්මණො:)"
            },
            {
                "type": "paragraph",
                "text": "කො පන භො ගොතම හෙතු, කො පච්චයො, යෙනමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්තීති?"
            },
            {
                "type": "unindented",
                "text": "(භගවා:)"
            },
            {
                "type": "paragraph",
                "text": "ධම්මචරියා සමචරියා හෙතු ඛො බ්රාහ්මණ එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්තීති."
            },
            {
                "type": "unindented",
                "text": "(බ්රාහ්මණො:)"
            },
            {
                "type": "paragraph",
                "text": "අභික්කන්තං භො ගොතම අභික්කන්තං භො ගොතම, සෙය්යථාපි භො ගොතම නික්කුජ්ජිතං වා උක්කුජ්ජෙය්ය, පටිච්ඡන්නං වා විවරෙය්ය, මූළ්හස්ස වා මග්ගං ආචික්ඛෙය්ය, අන්ධකාරෙ වා තෙලපජ්ජොතං ධාරෙය්ය, ‘චක්ඛුමන්තො රූපානි දක්ඛන්තී’{2 දක්ඛන්තීති - ස්යා. මඡසං.}ති, එවමෙව භොතා ගොතමෙන අනෙකපරියායෙන ධම්මො පකාසිතො. එසාහං භවන්තං ගොතමං සරණං ගච්ඡාමි ධම්මඤ්ච භික්ඛුසඞ්ඝඤ්ච. උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 7.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "17. අථඛො ජාණුස්සොණි බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි -පෙ- එකමන්තං නිසින්නො ඛො ජාණුස්සොණි බ්රාහ්මණො භගවන්තං එතදවොච. කො නු ඛො භො ගොතම, හෙතු, කො පච්චයො, යෙන මිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්තීති,"
            },
            {
                "type": "unindented",
                "text": "(භගවා:)"
            },
            {
                "type": "paragraph",
                "text": "කතත්තා ච බ්රාහ්මණ අකතත්තා ච. එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්තීති."
            },
            {
                "type": "unindented",
                "text": "[බ්රාහ්මණො:]"
            },
            {
                "type": "paragraph",
                "text": "කො පන භො ගොතම හෙතු, කො පච්චයො, යෙන මිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්තීති."
            },
            {
                "type": "page-break",
                "text": "112"
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "paragraph",
                "text": "කතත්තා ච බ්රාහ්මණ අකතත්තා ච. එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්තීති."
            },
            {
                "type": "unindented",
                "text": "(බ්රාහ්මණො:)"
            },
            {
                "type": "paragraph",
                "text": "න ඛො අහං ඉමස්ස භොතො ගොතමස්ස සංඛිත්තෙන භාසිතස්ස විත්ථාරෙන අත්ථං{1 විත්ථාරෙන අත්ථං අවිභත්තස්ස - ස්යාමපොත්ථකෙ අයං න දිස්සති.} අවිභත්තස්ස විත්ථාරෙන අත්ථං ආජානාමි. සාධු මෙ භවං ගොතමො තථා ධම්මං දෙසෙතු, යථා අහං ඉමස්ස භොතො ගොතමස්ස සඞ්ඛිත්තෙන භාසිතස්ස විත්ථාරෙන අත්ථං අවිභත්තස්ස විත්ථාරෙන අත්ථං ආජානෙය්යන්ති."
            },
            {
                "type": "paragraph",
                "text": "තෙන හි බ්රාහ්මණ සුණාහි සාධුකං මනසි කරොහි, භාසිස්සාමීති. එවම්භොති ඛො ජාණුස්සොණි බ්රාහ්මණො භගවතො පච්චස්සොසි: භගවා එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "ඉධ බ්රාහ්මණ එකච්චස්ස කායදුච්චරිතං කතං හොති, අකතං හොති කායසුචරිතං. වචීදුච්චරිතං කතං හොති, අකතං හොති වචීසුචරිතං. මනොදුච්චරිතං කතං හොති, අකතං හොති මනොසුචරිතං. එවං ඛො බ්රාහ්මණ කතත්තා ච අකතත්තා ච එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්ති."
            },
            {
                "type": "paragraph",
                "text": "ඉධ පන බ්රාහ්මණ එකච්චස්ස කායසුචරිතං කතං හොති, අකතං හොති කායදුච්චරිතං, වචීසුචරිතං කතං හොති, අකතං හොති වචීදුච්චරිතං. මනොසුචරිතං කතං හොති, අකතං හොති මනොදුච්චරිතං. එවං ඛො බ්රාහ්මණ කතත්තා ච අකතත්තා ච එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්තීති."
            },
            {
                "type": "unindented",
                "text": "(බ්රාහ්මණො:)"
            },
            {
                "type": "paragraph",
                "text": "අභික්කන්තං භො ගොතම -පෙ- උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 8.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "18. අථ ඛො ආයස්මා ආනන්දො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො ආයස්මන්තං ආනන්දං භගවා එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "එකංසෙනාහං ආනන්ද අකරණීයං වදාමි කායදුච්චරිතං වචීදුච්චරිතං මනොදුච්චරිතන්ති."
            },
            {
                "type": "page-break",
                "text": "114"
            },
            {
                "type": "unindented",
                "text": "(ආනන්දො:)"
            },
            {
                "type": "paragraph",
                "text": "යමිදං භන්තෙ භගවතා එකංසෙන අකරණීයං අක්ඛාතං කායදුච්චරිතං වචීදුච්චරිතං මනොදුච්චරිතං. තස්මිං අකරණීයෙ කයිරමානෙ කො ආදීනවො පාටිකඞ්ඛොති."
            },
            {
                "type": "unindented",
                "text": "(භගවා:)"
            },
            {
                "type": "paragraph",
                "text": "යමිදං ආනන්ද මයා එකංසෙන අකරණීයං අක්ඛාතං කායදුච්චරිතං වචීදුච්චරිතං මනොදුච්චරිතං. තස්මිං අකරණීයෙ කයිරමානෙ අයං ආදීනවො පාටිකඞ්ඛො:"
            },
            {
                "type": "paragraph",
                "text": "අත්තාපි අත්තානං උපවදති, අනුවිච්ච විඤ්ඤූ ගරහන්ති, පාපකො කිත්තිසද්දො අබ්භුග්ගච්ඡති, සම්මූළ්හො කාලං කරොති, කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජති."
            },
            {
                "type": "paragraph",
                "text": "යමිදං ආනන්ද මයා එකංසෙන අකරණීයං අක්ඛාතං කායදුච්චරිතං වචීදුච්චරිතං මනොදුච්චරිතං. තස්මිං අකරණීයෙ කයිරමානෙ අයං ආදීනවො පාටිකඞ්ඛො."
            },
            {
                "type": "paragraph",
                "text": "එකංසෙනාහං ආනන්ද කරණීයං වදාමි කායසුචරිතං වචීසුචරිතං මනොසුචරිතන්ති."
            },
            {
                "type": "unindented",
                "text": "(ආනන්දො:)"
            },
            {
                "type": "paragraph",
                "text": "යමිදං භන්තෙ භගවතා එකංසෙන කරණීයං අක්ඛාතං කායසුචරිතං වචීසුචරිතං මනොසුචරිතං තස්මිං කරණීයෙ කයිරමානෙ කො ආනිසංසො පාටිකඞ්ඛොති?"
            },
            {
                "type": "unindented",
                "text": "(භගවා:)"
            },
            {
                "type": "paragraph",
                "text": "යමිදං ආනන්ද මයා එකංසෙන කරණීයං අක්ඛාතං කායසුචරිතං වචීසුචරිතං මනොසුචරිතං. තස්මිං කරණීයෙ කයිරමානෙ අයං ආනිසංසො පාටිකඞ්ඛො:"
            },
            {
                "type": "paragraph",
                "text": "අත්තාපි අත්තානං න උපවදති, අනුවිච්ච විඤ්ඤූ පසංසන්ති, කල්යාණො කිත්තිසද්දො අබ්භුග්ගච්ඡති, අසම්මූළ්හො කාලං කරොති, කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති."
            },
            {
                "type": "paragraph",
                "text": "යමිදං ආනන්ද මයා එකංසෙන කරණීයං අක්ඛාතං කායසුචරිතං වචීසුචරිතං මනොසුචරිතං. තස්මිං කරණීයෙ කයිරමානෙ අයං ආනිසංසො පාටිකඞ්ඛොති."
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 9.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "19. අකුසලං භික්ඛවෙ පජහථ. සක්කා භික්ඛවෙ අකුසලං පජහිතුං. නො චෙ තං{1 නොචෙදං - මඡසං.} භික්ඛවෙ සක්කා අභවිස්ස අකුසලං පජහිතුං, නාහං එවං වදෙය්යං ‘‘අකුසලං භික්ඛවෙ පජහථා”ති. යස්මා ච ඛො භික්ඛවෙ සක්කා අකුසලං පජහිතුං, තස්මාහං එවං වදාමි “අකුසලං භික්ඛවෙ පජහථා”ති. අකුසලං ච හිදං භික්ඛවෙ පහීනං අහිතාය දුක්ඛාය සංවත්තෙය්ය. නාහං එවං වදෙය්යං ‘‘අකුසලං භික්ඛවෙ පජහථා”ති. යස්මා ච ඛො භික්ඛවෙ අකුසලං පහීනං හිතාය සුඛාය සංවත්තති, තස්මාහං එවං වදාමි ‘‘අකුසලං භික්ඛවෙ පජහථා”ති."
            },
            {
                "type": "page-break",
                "text": "116"
            },
            {
                "type": "paragraph",
                "text": "කුසලං භික්ඛවෙ භාවෙථ. සක්කා භික්ඛවෙ කුසලං භාවෙතුං. නො චෙ තං{1 නොචෙදං - මඡසං.} භික්ඛවෙ සක්කා අභවිස්ස කුසලං භාවෙතුං, නාහං එවං වදෙය්යං ‘‘කුසලං භික්ඛවෙ භාවෙථා”ති. යස්මා ච ඛො භික්ඛවෙ සක්කා කුසලං භාවෙතුං, තස්මාහං එවං වදාමි ‘‘කුසලං භික්ඛවෙ භාවෙථා”ති. කුසලං ච හිදං භික්ඛවෙ භාවිතං අහිතාය දුක්ඛාය සංවත්තෙය්ය, නාහං එවං වදෙය්යං ‘‘කුසලං භික්ඛවෙ භාවෙථා”ති. යස්මා ච ඛො භික්ඛවෙ කුසලං භාවිතං හිතාය සුඛාය සංවත්තති තස්මාහං එවං වදාමි ‘‘කුසලං භික්ඛවෙ භාවෙථා”ති."
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "20. ද්වෙ මෙ භික්ඛවෙ ධම්මා සද්ධම්මස්ස සම්මොසාය අන්තරධානාය සංවත්තන්ති. කතමෙ ද්වෙ? දුන්නික්ඛිත්තඤ්ච පදබ්යඤ්ජනං, අත්ථො ච දුන්නීතො. දුන්නික්ඛිත්තස්ස භික්ඛවෙ පදබ්යඤ්ජනස්ස අත්ථොපි දුන්නයො හොති. ඉමෙ ඛො භික්ඛවෙ ද්වෙ ධම්මා සද්ධම්මස්ස සම්මොසාය අන්තරධානාය සංවත්තන්තීති."
            },
            {
                "type": "paragraph",
                "text": "ද්වෙ මෙ භික්ඛවෙ ධම්මා සද්ධම්මස්ස ඨිතියා අසම්මොසාය අනන්තරධානාය සංවත්තන්ති. කතමෙ ද්වෙ? සුනික්ඛිත්තඤ්ච පදබ්යඤ්ජනං, අත්ථො ච සුනීතො. සුනික්ඛිත්තස්ස භික්ඛවෙ පදබ්යඤ්ජනස්ස අත්ථොපි සුනයො හොති. ඉමෙ ඛො භික්ඛවෙ ද්වෙ ධම්මා සද්ධම්මස්ස ඨිතියා අසම්මොසාය අනන්තරධානාය සංවත්තන්තීති."
            },
            {
                "type": "centered",
                "text": "අධිකරණවග්ගො දුතියො.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 105
            },
            {
                "text": "2. අධිකරණ වර්ගය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 1.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": ""
            },
            {
                "text": "11. මහණෙනි, මේ බල දෙකෙකි. කවර දෙකෙක යත්: පටිසඞ්ඛානබලය හා භාවනාබලය (යන දෙක) යි. මහණෙනි, පටිසඞ්ඛානබලය කවරේ ය යත්: මහණෙනි, මෙලොව්හි කිසිවෙක් මෙසේ නුවණින් පස්විකා බලයි: “කායදුශ්චරිතයාගේ ලාමක වූ විපාකය දිටුදැමියෙහි ද පරලොව්හි ද වෙයි. වාග්දුශ්චරිතයාගේ ලාමක වූ විපාකය දිටුදැමියෙහි ද පරලොව්හි ද වෙයි. මනෝදුශ්චරිතයාගේ ලාමක වූ විපාකය දිටුදැමියෙහි ද පරලොව්හි ද වේය” යි. හෙතෙම මෙසේ නුවණින් බලා කායදුශ්චරිතය හැරපියා කායසුචරිතය වඩයි. වාග්දුශ්චරිතය හැරපියා වාක්සුචරිතය වඩයි. මනෝදුශ්චරිතය හැරපියා මනස්සුචරිතය වඩයි. පිරිසිදු අත්බව පරිහරණය කෙරෙයි. මහණෙනි, මෙය පටිසඞ්ඛානබලැ යි කියනු ලැබේ. මහණෙනි, භාවනාබලය කවරේය යත්: මහණෙනි, එහි ලා යම් භාවනාබලයෙක් වේ නම්, මෙය ශෛක්‍ෂබලය වේ. මහණෙනි, හේ ශෛක්‍ෂබලයට පැමිණ රාගය හැර ලා, ද්වෙෂය හැරලයි. මෝහය හැරලයි. රාගය හැර ලා, ද්වෙෂය හැර ලා, මෝහය හැර ලා යමෙක් අකුශල වේ නම් එය නො කෙරෙයි. යමෙක් පව් වේ නම් එය නො සෙව්නේය. මහණෙනි, මෙය භාවනාබලැ යි කියනු ලැබේ. මහණෙනි, මේ වනාහි බල දෙකයි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 2.",
                "level": "1"
            },
            {
                "text": "12. මහණෙනි, මේ බල දෙකෙකි. කවර දෙකෙක යත්: පටිසඞ්ඛානබලය හා භාවනාබලය (යන දෙක) යි. මහණෙනි, පටිසඞ්ඛානබලය කවරේය යත්: මහණෙනි, මෙ ලොව්හි කිසිවෙක් මෙසේ නුවණින් පස්විකා බලයි: කායදුශ්චරිතයාගේ ලාමක විපාකය වනාහි දිටුදැමියෙහි ද පරලොව්හි ද වෙයි. වාග්දුශ්චරිතයාගේ ලාමක වූ විපාකය දිටුදැමියෙහි ද පරලොව්හි ද වෙයි. මනෝදුශ්චරිතයාගේ ලාමක වූ විපාකය දිටුදැමියෙහි ද පරලොව්හි ද වෙයි. හේ මෙසේ නුවණින් බලා කායදුශ්චරිතය හැරපියා කායසුචරිතය වඩයි. වාග්දුශ්චරිතය හැරපියා වාක්සුචරිතය වඩයි. මනෝදුශ්චරිතය හැරපියා මනස්සුචරිතය වඩයි. පිරිසිදු අත්බව පරිහරණය කෙරෙයි. මහණෙනි, මේ පටිසඞ්ඛානබලැ යි කියනු ලැබේ. මහණෙනි, භාවනාබලය කවරේය යත්: මහණෙනි, මේ සස්නෙහි මහණ තෙමේ විවෙකය ඇසුරු කළ, විරාගය ඇසුරු කළ, නිරොධය ඇසුරු කළ, ක්ලෙශපරිත්‍යාගය හා නිර්‍වාණප්‍රස්කන්‍දනය පිණිස පිරිනමන සතිසම්බොජ්ඣඞ්ගය වඩයි. ධම්මවිචයසම්බොජ්ඣඞ්ගය වඩයි. ... විරියසම්බොජ්ඣඞ්ගය වඩයි. ... පීතිසම්බොජ්ඣඞ්ගය වඩයි. ... පස්සද්ධිසම්බොජ්ඣඞ්ගය වඩයි ... සමාධිසම්බොජ්ඣඞ්ගය වඩයි. විවෙකය ඇසුරු කළ, විරාගය ඇසුරු කළ, නිරොධය ඇසුරු කළ, ක්ලෙශපරිත්‍යාගය හා නිර්‍වාණප්‍රස්කන්‍දනය පිණිස පිරිනමන උපෙක්ඛාසම්බොජ්ඣඞ්ගය වඩයි. මහණෙනි, මේ භාවනාබලැ යි කියනු ලැබේ. මහණෙනි, මෙ බල දෙකයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "107"
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 3.",
                "level": "1"
            },
            {
                "text": "13. මහණෙනි, මේ බල දෙකෙකි. කවර දෙකෙක යත්: පටිසඞ්ඛානබලය හා භාවනාබලය (යන දෙක) යි. මහණෙනි, පටිසඞ්ඛානබලය කවරේය යත්: මහණෙනි, මෙලොව්හි කිසිවෙක් මෙසේ නුවණින් පස්විකා බලයි: කායදුශ්චරිතයාගේ ලාමක විපාකය වනාහි දිටුදැමියෙහි ද පරලොව්හි ද වෙයි. වාග්දුශ්චරිතයාගේ ලාමක විපාකය වනාහි මෙලොව්හි ද පරලොව්හි ද වෙයි. මනොදුශ්චරිතයාගේ ලාමක වූ විපාකය වනාහි මෙලොව්හි ද පරලොව්හි ද වෙයි. හේ මෙසේ නුවණින් බලා කායදුශ්චරිතය හැරපියා කායසුචරිතය වඩයි. වාග්දුශ්චරිතය හැරපියා වාක්සුචරිතය වඩයි. මනෝදුශ්චරිතය හැරපියා මනස්සුචරිතය වඩයි. පිරිසිදු අත්බව පිරිවටයි. මහණෙනි, මේ පටිසඞ්ඛානබලැ යි කියනු ලැබේ. මහණෙනි, භාවනාබලය කවරේය යත්: මහණෙනි, මේ සස්නෙහි මහණ කාමයෙන් වෙන් ව ම අකුශලධර්‍මයෙන් වෙන් ව ම විතර්‍ක සහිත වූ විචාර සහිත වූ විවේකයෙන් උපන් ප්‍රීතිය හා සුඛ ඇති ප්‍රථමධ්‍යානය උපයා වෙසෙයි. විතර්‍කවිචාරයන්ගේ සන්හිඳීමෙන් අධ්‍යාත්මයෙහි මනා පැහැදීම ඇති චිත්තයාගේ එකාග්‍රභාවය ඇති විතර්‍කරහිත වූ විචාරරහිත වූ සමාධියෙන් උපනන් ප්‍රීතිය හා සුඛ ඇති ද්විතීයධ්‍යානයට ඇටි ඇටි සඳ සමවැද වෙසෙයි. ප්‍රීතිහුගේ ද විරාගයෙන් උපෙක්‍ෂාව ඇත්තේ ද ස්මෘතිමත් වූයේ ද සම්‍යක්ප්‍රඥා ඇත්තේ වෙසෙයි. කයින් සුව පිළිවිදියි. ආර්‍ය්‍යයෝ “උපෙක්‍ෂා ඇත්තේ ස්මෘතිමත් වූයේ සුඛවිහරණ ඇත්තෙකැ”යි යම් ධ්‍යානලාභියකු (ගෙණ) කියද්ද, ඒ තෘතියධ්‍යානයට පැමිණ වෙසෙයි. සුඛයාගේ ද ප්‍රහාණයෙන් දුඃඛයාගේ ද ප්‍රහාණයෙන් කැලැ ම සොම්නස් දොම්නසුන්ගේ අස්තඞ්ගමයෙන් නොදුක් නොසුව වූ උපෙක්‍ෂාස්මෘති පරිශුද්ධිය ඇති චතුර්ථධ්‍යානයට එළඹ වෙසෙයි. මහණෙනි, මේ භාවනාබලැ යි කියනු ලැබේ. මහණෙනි, මේ වනාහි බල දෙකයි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 4.",
                "level": "1"
            },
            {
                "text": "14. මහණෙනි, තථාගතයන් වහන්සේගේ මේ ධර්‍මදෙශනා දෙකෙකි. කවර දෙකෙක යත්: සැකෙවින් දෙසුම් හා විතර විසින් දෙසුම ය. මහණෙනි, මේ වනාහි තථාගතයන් වහන්සේගේ ධර්‍මදෙශනා දෙක ය.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 5.",
                "level": "1"
            },
            {
                "text": "15. මහණෙනි, යම් අධිකරණයෙක්හි ලා (ඇවැත්) අවන් මහණ ද (ඇවතින්) චොදනා කරණ මහණ ද මොනොවට තෙමේ ම තමා නුවණින් සලකා නො බලා නම්, මහණෙනි, ඒ අධිකරණයෙහි ලා තෙල කැමැති විය යුතුය: දිගුකලක් පැවැත්ම පිණිස, රළුබස්කම් පිණිස, කැකුළුබව පිණිස (ඒ අධිකරණය) පවත්නේ ය. භික්‍ෂූහු ද සුවසේ නො වසන්නාහුය යි.",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "මහණෙනි, යම් අධිකරණයෙක්හි ලා (ඇවැත්) අවන් මහණ ද (ඇවතින්) චෝදනා කරණ මහණ ද තෙමේ ම මොනොවට තමා නුවණින් සලකා බලා නම්, මහණෙනි, ඒ අධිකරණයෙහි දී තෙල කැමැති විය යුතුය. දිගුකල් පැවැත්ම පිණිස, රළුබස්කම් පිණිස, කැකුළුබව පිණිස (ඒ අධිකරණය) නො පවත්නේ ය. භික්‍ෂූහු ද සුවසේ වසන්නාහුය යි."
            },
            {
                "type": "page-break",
                "text": "109"
            },
            {
                "text": "මහණෙනි, කෙසේ නම් ඇවැත් අවන් මහණ මොනොවට තෙමේ ම තමා නුවණින් බලා ද? මහණෙනි, මේ සස්නෙහි (ඇවැත්) අවන් මහණ මෙසේ නුවණින් සලකා බලයි: ‘මම වනාහි කරජ කයින් කිසිදෙසක් ම අකුසලට (අන්‍යතර ආපත්තියකට) අවන්මි. ඒ මහණ කයින් කිසියම් දේශමාත්‍ර වූ අකුශල (ආපත්ති) යකට අවදනා ඒ මා දිටී. මම වැලිත් කයින් යම් ම අකුශල (ආපත්ති) යකට නො අවන්නෙම් නම්, ඒ මහණ කයින් කිසියම් අකුශල (ආපත්ති) යකට අවදනා මා නො දක්නේ ය. යම් හෙයෙකින් මම කයින් කිසියම් අකුශල (ආපත්ති) යකට අවන්නෙම් වේ ද, එහෙයින් ඒ මහණ කයින් කිසියම් ප්‍රදේශමාත්‍ර වූ අකුශලයකට අවදනා මා දිටී. ඒ මහණ කයින් කිසියම් දේශමාත්‍ර වූ අකුශලයකට අවදනා මා දැක ද නො සතුටු සිත් ඇති වීය. නොසතුටු සිත් ඇත්තේ ම ඒ මහණ මට නො සතුටු බස් කීය. මම ඒ මහණහු විසින් නො සතුටු බසින් කියනු ලැබුයෙම් ම නො සතුටු සිත් ඇත්තෙම් වීමි. නොසතුටු සිත් ඇත්තෙම් ම අනුනට සැළ කෙළෙමි. මෙසේ භාණ්ඩයෙහි සුංවත් දෙන්නකු සෙයින් ඒ අධිකරණයෙහි මාගේ ම (තුන්වැදෑරුම්) අපරාධයෙක් මා ඔබාගෙන නැඟිනැ’ යි. මහණෙනි, මෙසේ වනාහි ඇවැත් අවන් මහණ තෙමේ ම තමා මොනොවට නුවණින් සලකා බලයි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, කෙසේ නම් චෝදනා කරණ මහණ තෙමේ ම තමා මොනොවට නුවණින් සලකා බලා ද? මහණෙනි, මේ සස්නෙහි චෝදක භික්‍ෂූ තෙමේ මෙසේ නුවණින් සලකා බලයි: ‘මේ මහණ තෙමේ වනාහි කයින් කිසියම් දේශමාත්‍ර වූ අකුශල (ආපත්ති) යකට අවන්නේය. මම කයින් කිසියම් එකදේශමාත්‍ර වූ අකුශලයකට අවදනා ඒ මහණහු දිටිමි. ඉදින් මේ මහණ කයින් කිසියම් අකුශලයකට නො අවදනේ නම්, මම කයින් යම් ම අකුශලයකට අවදනා මේ මහණහු නො දක්නෙමි. යම් හෙයෙකින් මේ මහණ තෙමේ කයින් කිසියම් දේශමාත්‍ර වූ අකුශලයකට අවන්නේ ද, එහෙයින් මම කයින් කිසියම් දෙසක් ම අකුශලයකට අවදනා මේ මහණහු දිටිමි. කයින් කිසියම් දේශමාත්‍ර වූ අකුශලයකට අවදනා මේ මහණහු දැක ද මම නො සතුටු සිත් ඇත්තෙම් වීමි. නොසතුටු සිත් ඇත්තෙම් ම මේ මහණහට නො සතුටු බස් කීමි. මා විසින් නො සතුටු බසින් කියනු ලැබුයේ ම මේ මහණ නො සතුටු සිත් ඇති විය. නො සතුටු සිත් ඇත්තේ ම එය අනුනට සැළ කෙළේය. මෙසේ ඒ අධිකරණයෙහි ලා භාණ්ඩයෙහි සුංවත් දෙන්නකු සේ මාගේ ම (දෙවැදෑරුම්) අපරාධයෙක් මා ඔබාගෙන නැඟිනැ’ යි. මහණෙනි, මෙසේ චෝදක මහණ තෙමේ මොනොවට තෙමේ ම තමා නුවණින් සලකා බලයි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් අධිකරණයෙක්හි ඇවැත් අවන් භික්‍ෂු තෙමේ ද චොදක භික්‍ෂු තෙමේ ද තෙමේ ම තමා මොනොවට නුවණින් සලකා නො බලා නම්, මහණෙනි, ඒ අධිකරණයෙහි ලා තෙල කැමැති විය යුතුයි: ‘දිගුකල් පැවැත්ම පිණිස රළුබස්කම් පිණිස කැකුළුබව පිණිස (අධිකරණය) පවත්නේ ය. භික්‍ෂූහු ද සැපසේ නො වසන්නාහු’ යි. මහණෙනි, යම් අධිකරණයෙක්හි ලා (ඇවැත්) අවන් මහණ තෙමේ ද ඇවැත්නි චෝදනා කරණ මහණ තෙමේ ද තෙමේ ම තමා මොනොවට නුවණින් සලකා බලා නම්, මහණෙනි, ඒ අධිකරණයෙහි ලා තෙල කැමැති විය යුතුය: ‘දිගුකල් පැවැත්ම පිණිස රළුබස් කම් පිණිස, කැකුළුබැව පිණිස අධිකරණය නො පවත්නේ ය. භික්‍ෂූහු ද සැපසේ වසන්නාහුය’ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "111"
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 6.",
                "level": "1"
            },
            {
                "text": "16. එකල්හි නොපාළ බමුණෙක් භාග්‍යවතුන් වහන්සේ වෙත එළඹියේය. එළඹ භාග්‍යවතුන් වහන්සේ හා සමග තුස්නකථාවට නිසි සිහිකරනුවට නිසි කථාව නිමවා එකත් පසෙක හින. එකත්පසෙක හුන් ඒ බමුණු භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේ ය: ‘භවත් ගෞතමයෙනි, යම් හෙයෙකින් මෙ ලොව්හි ඇතැම් සත‍ත්‍ව කෙනෙක් කාබුන් මරණින් මතු සුවයෙන් පහවූ නපුරු ගති වූ විවස පතනයට තැන්වූ නිරයට (උපපාත වශයෙන්) පැමිණෙත් නම්, එයට හේතු කවරේය? එයට ප්‍රත්‍යය කවරේය? ",
                "type": "paragraph"
            },
            {
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "text": "බමුණු, අධර්‍මචර්‍ය්‍යා සඞ්ඛ්‍යාත විෂම චර්‍ය්‍යාව හේතු කොට ගෙණ මෙසේ මෙ ලොව්හි ඇතැම් සත‍ත්‍ව කෙනෙක් කාබුන් මරණින් මතු සුවයෙන් පහ වූ දුර්‍ගති වූ විනිපාත වූ නිරයට එළඹෙත්.",
                "type": "paragraph"
            },
            {
                "text": "[බමුණු:]",
                "type": "unindented"
            },
            {
                "text": "භවත් ගෞතමයෙනි, මෙලොව්හි ඇතැම් සත‍ත්‍ව කෙනෙක් කාබුන් මරණින් මතු සුගති නම් වූ ස්වර්‍ගලොකයට එළඹෙත් නම්, එයට හේතු කවරේය? ප්‍රත්‍යය කවරේ ය?",
                "type": "paragraph"
            },
            {
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "text": "බමුණ, ධර්‍මචර්‍ය්‍යා සඞ්ඛ්‍යාත සමචර්‍ය්‍යාව හේතු කොට ගෙණ මෙසේ මෙ ලොව්හි ඇතැම් සත‍ත්‍ව කෙනෙක් කාබුන් මරණින් මතු සුගති නම් වූ ස්වර්‍ගලොකයට එළඹෙත්.",
                "type": "paragraph"
            },
            {
                "text": "[බමුණු:]",
                "type": "unindented"
            },
            {
                "text": "භවත් ගෞතමයන්වහන්ස, ඉතා මැනැවි. භවත් ගෞතමයන් වහන්ස ඉතා මැනැවි. භවත් ගෞතමයන් වහන්ස! යම්සේ යටිහුරු කොට තබන ලද්දක් හෝ උඩුහුරු කොට තබන්නේ, පිළිසන් වූවක් හෝ වැසුම් හරනේ මංමුළා වූවකුට හෝ මග කියන්නේ ‘ඇස් ඇත්තෝ රූ දක්නාහුය’ යි බොල් අඳුරෙහි තෙල් පහනක් හෝ දල්වන්නේ වේ ද, එසෙයින් ම භවත් ගෞතමයන් වහන්සේ විසින් නන්නියරින් ධර්‍මය ප්‍රකාශ කරණ ලද්දේ ය. ඒ මම භවත් ගෞතමයන් වහන්සේ ද ධර්‍මය ද භික්‍ෂූසඞ්ඝයා ද සරණ යෙමි. භවත් ගෞතමයන් වහන්සේ අද පටන් මා දිවිහිමියෙන් සරණ ගිය උවසුවකු සේ රුස්නා සේක්වා’ යි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 7.",
                "level": "1"
            },
            {
                "text": "17. එකල්හි ජාණුස්සොණි බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේය. එළඹ භාග්‍යවතුන් වහන්සේ හා සමග සතුටු විය ... එකත්පසෙක හුන් ජාණුස්සොණි බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළකෙළේය: භවත් ගෞතමයන් වහන්ස, යම් හෙයෙකින් මේ ලෝකයෙහි ඇතැම් සත්ත්‍ව කෙනෙක් කාබුන් මරණින් මතු සුවයෙන් පහ වූ දුර්ගති වූ විනිපාත වූ නිරයට යෙත් නම්, (එයට) හේතු කවරේය? ප්‍රත්‍යය කවරේය? ",
                "type": "paragraph"
            },
            {
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "text": "බමුණ, කළ බැවිනුදු නොකළ බැවිනිදු මෙසේ මෙ ලොව කිසි සත්ත්‍ව කෙනෙක් කාබුන් මරණින් මතු සුවයෙන් පහ වූ දුර්‍ගති වූ විනිපාත වූ නිරයට එළඹෙත්.",
                "type": "paragraph"
            },
            {
                "text": "[බමුණු:]",
                "type": "unindented"
            },
            {
                "text": "භවත් ගෞතමයන් වහන්ස, යම් හෙයෙකින් මෙ ලොව කිසි සත්ත්‍ව කෙනෙක් සුගති සඞ්ඛ්‍යාත ස‍වර්‍ගලොකයට එළඹෙත් නම්, (එයට) හේතු කවරේය? ප්‍රත්‍යය කවරේය?",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "113"
            },
            {
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "text": "බමුණ, කළ බැවිනුදු නොකළ බැවිනිදු මෙසේ මෙ ලොව කිසි සත්ත්‍ව කෙනෙක් කාබුන් මරණින් මතු සුගති සඞ්ඛ්‍යාත ස‍වර්‍ගයට එළඹෙත්.",
                "type": "paragraph"
            },
            {
                "text": "[බමුණු:]",
                "type": "unindented"
            },
            {
                "text": "භවත් ගෞතමයන් වහන්සේ විසින් සැකෙවින් වදාරණ ලද විතර විසින් අරුත් නො බෙදන ලද මේ භාෂිතයාගේ අර්ථය මම විතර විසින් නො දනිමි. යම්සේ මම භවත් ගෞතමයන් වහන්සේ විසින් සැකෙවින් දෙසූ විතර විසින් අරුත් නො බෙදූ මේ භාෂිතයාගේ අර්ථය විතර විසින් දැනගන්නෙම් ද එපරිද්දෙන් භවත් ගෞතමයන් වහන්සේ දහම් දෙසන සේක් නම් මැනැවි.",
                "type": "paragraph"
            },
            {
                "text": "බමුණ, එසේ වී නම් අසව, මනා කොට මෙනෙහි කරව, දෙසමි යි. එසේය වහන්සැ’ යි ජාණුස්සොණි බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වීය. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "text": "බ්‍රාහ්මණය, මේ ලෝකයෙහි කිසිවකු විසින් කායදුශ්චරිතය කරණ ලද්දේ වෙයි, කායසුචරිතය නොකරණ ලද්දේ වෙයි. වාග්දුශ්චරිතය කරණ ලද්දේ වෙයි, වාක්සුචරිතය නො කරණ ලද්දේ වෙයි. මනොදුශ්චරිතය කරණ ලද්දේ වයි, මනස්සුචරිතය නො කරණ ලද්දේ වෙයි. බ්‍රාහ්මණය, මෙසේ වනාහි කළ බැවිනුදු නො කළ බැවිනිදු මෙ ලොව්හි කිසි සත්ත්‍ව කෙනෙක් කාබුන් මරණින් මතු මෙසේ සුවයෙන් පහ වූ දුගති වූ විනිපාත වූ නිරයට එළඹෙත්.",
                "type": "paragraph"
            },
            {
                "text": "බ්‍රාහ්මණය, මෙලොව කිසිවකු විසින් කායසුචරිතය කරණ ලද්දේ වෙයි, කායදුශ්චරිතය නොකරණ ලද්දේ වෙයි. වාක්සුචරිතය කරණ ලද්දේ වෙයි, වාග්දුශ්චරිතය නොකරණ ලද්දේ වෙයි. මනස්සුචරිතය කරණ ලද්දේ වෙයි, මනොදුශ්චරිතය නොකරණ ලද්දේ වෙයි. බ්‍රාහ්මණය, මෙසේ වනාහි කළ බැවිනුදු නො කළ බැවිනිදු මෙලොව්හි කිසි සත්ත්‍ව කෙනෙක් මෙ පරිද්දෙන් කාබුන් මරණින් මතු සුගති සඞ්ඛ්‍යාත ස‍වර්‍ගලෝකයට එළඹෙත්.",
                "type": "paragraph"
            },
            {
                "text": "[බමුණු:]",
                "type": "unindented"
            },
            {
                "text": "භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි ... භවත් ගෞතමයන් වහන්සේ අද පටන් දිවිහිම් කොට සරණ ගිය උවසුවකු සේ මා රුස්නා සේක්වායී.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 8.",
                "level": "1"
            },
            {
                "text": "18. එකල්හි ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ සකසා වැඳ එකත්පසෙක හුන්හ. එකත්පසෙක හුන් ආයුෂ්මත් ආනන්‍දතෙරණුවනට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "text": "ආනන්‍දය, මම කායදුශ්චරිතය වාග්දුශ්චරිතය මනොදුශ්චරිතය ඒකාන්තයෙන් නො කළ යුතුයි කියමි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "115"
            },
            {
                "text": "[අනඳ තෙරහු:]",
                "type": "unindented"
            },
            {
                "text": "වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් යම් කායදුශ්චරිතයෙක්, වාග්දුශ්චරිතයෙක් මනෝදුශ්චරිතයෙක් ඒකාන්තයෙන් නො කළ යුතුය යි වදාරණ ලද ද ඒ නොකට යුතු දැ කරණු ලබන කල්හි කවර ආදිනවයෙක් කැමැති විය යුතු ද?",
                "type": "paragraph"
            },
            {
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "text": "ආනන්‍දය, මා විසින් යම් කායදුශ්චරිතයෙක් - වාග්දුශ්චරිතයෙක් - මනොදුශ්චරිතයෙක් ඒකාන්තයෙන් නො කට යුතුය යි වදාරණ ලද නම්, ඒ නො කට යුතු දෑ කරණු ලබන කල්හි මේ ආදීනවය කැමැති විය යුතුය:",
                "type": "paragraph"
            },
            {
                "text": "“තෙමේත් තමහට උපවාද කෙරෙයි. නුවණැතියෝ විමසා දැන ගරහත්. අපකීර්තිය උස්ව නගියි. සම්මූඪ ව කළුරිය කෙරෙයි. කාබුන් මරණින් මතු සුවයෙන් පහ වූ දුගති වූ විනිපාත වූ නිරයට එළඹෙත්” ය යි.",
                "type": "paragraph"
            },
            {
                "text": "ආනන්‍දය, මා විසින් යම් කායදුශ්චරිතයෙක් - වාග්දුශ්චරිතයෙක් - මනෝදුශ්චරිතයෙක් ඒකාන්තයෙන් නො කළ යුතුය යි පවසන ලද නම්, ඒ නොකට යුතු දෑ කරණු ලබන කල්හි මේ ආදීනවය කැමැති විය යුත්තේ ය.",
                "type": "paragraph"
            },
            {
                "text": "ආනන්‍දය, මම කායසුචරිතය - වාක්සුචරිතය - මනස්සුචරිතය ඒකාන්තයෙන් කළ යුතු යයි කියමි.",
                "type": "paragraph"
            },
            {
                "text": "[අනඳ තෙරහු:]",
                "type": "unindented"
            },
            {
                "text": "වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් යම් කායසුචරිතයයෙක් - වාක්සුචරිතයෙක් - මනස්සුචරිතයෙක් ඒකාන්තයෙන් කළ යුතු ය යි පවසන ලද නම්, ඒ කට යුතු දෑ කරණු ලබන කල්හි කවර අනුසසෙක් කැමැති විය යුත්තේ ද?",
                "type": "paragraph"
            },
            {
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "text": "ආනන්‍දය, යම් මේ කායසුචරිතයෙක් - වාක්සුචරිතයෙක් - මනස්සුචරිතයෙක් එකාන්තයෙන් කටයුතුය යි මා විසින් කියන ලද නම්, ඒ කට යුතු දෑ කරණු ලබන කල්හි මේ අනුසස කැමැති විය යුත්තේ ය:",
                "type": "paragraph"
            },
            {
                "text": "“තෙමේත් තමහට උපවාද නො කෙරෙයි. නුවණැත්තෝ විමසා දැන පසසත්. යසගී උස්ව නැගෙයි. අසම්මූඪ ව කළුරිය කෙරෙයි. කාබුන් මරණින් මතු සුගති සඞ්ඛ්‍යාත ස‍වර්‍ගලෝකයට එළඹෙත්.”",
                "type": "paragraph"
            },
            {
                "text": "ආනන්‍දය, යම් කායසුචරිතයෙක් - වාක්සුචරිතයෙක් - මනස්සුචරිතයෙක් ඒකාන්තයෙන් කටයුතුය යි ම විසින් පවසන ලද නම්, ඒ කටයුතු දෑ කරණු ලබන කල්හි මේ අනුසස කැමැති විය යුත්තේ යයි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 9.",
                "level": "1"
            },
            {
                "text": "19. මහණෙනි, අකුශලය දුරලව. මහණෙනි, අකුශලය දුරලන්නට හැකිය. මහණෙනි, ඉදින් ඒ අකුශලය දුරලීමට නො හැකි නම් “මහණෙනි, අකුශලය දුරලවයි” මෙසේ මම නොකියමි. මහණෙනි, යම් හෙයෙකින් අකුශලය දුරලන්නට හැකි ද, එහෙයින් ම “මහණෙනි, අකුශලය දුරලව”යී මෙසේ මම කියමි. තවද මහණෙනි, මේ අකුශලය ප්‍රහීණ වූයේ අහිත පිණිස දුක් පිණිස පවත්නේ නම් “මහණෙනි, අකුශලය දුරලව” යි මම මෙසේ නොකියමි. මහණෙනි, යම් හෙයෙකින් අකුශලය ප්‍රහීණ වූයේ හිත පිණිස සුව පිණිස පවත්නේ ද එහෙයින් ම “මහණෙනි, අකුශලය දුරලව” යි මම් මෙසේ කියමි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "117"
            },
            {
                "text": "මහණෙනි, කුශලය වඩව. මහණෙනි, කුශලය වඩන්නට හැකිය. මහණෙනි, ඉදින් කුශලය නොවැඩිය හැකි නම් “මහණෙනි, කුශලය වඩව”යි මෙසේ මම නොකියමි. මහණෙනි, යම් හෙයෙකින් කුශලය වඩන්නට හැකි ද, එහෙයින් “මහණෙනි, කුශලය වඩව”යි මම මෙසේ කියමි. මහණෙනි, කුශලය වඩන ලද්දේ ඉදින් අහිත පිණිස දුක් පිණිස පවත්නේ නම් “මහණෙනි, කුසල් වඩව”යි මෙසේ මම නො කියමි. \n\nතවද මහණෙනි, යම් හෙයෙකින් කුශලය වඩන ලද්දේ හිත පිණිස සුව පිණිස පවත්නේ ද එහෙයින් ම “මහණෙනි, කුශලය වඩව” යි මම මෙසේ කියමි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 2. 10.",
                "level": "1"
            },
            {
                "text": "20. මහණෙනි, මේ ධර්‍මයෝ දෙදෙනෙක් සද්ධර්‍මයාගේ විනාශය පිණිස අතුරුදන් වීම පිණිස පවත්නාහ. කවර දෙදෙනෙක යත්: උපිළිවෙලින් වරදවා ගත් පෙළ ද වරදවා පෙරළා ගත් අටුවා ද යන දෙකය. මහණෙනි, වරදවා ගත් පාළියෙහි අටුවා ද දුර්නය (අන්නෑය) වෙයි. මහණෙනි, මේ ධර්‍මයෝ දෙදෙන සද්ධර්‍මයාගේ විනාශය පිණිස අන්තර්‍ධානය පිණිස පවත්නාහ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මේ ධර්‍මයෝ දෙදෙනෙක් සද්ධර්‍මයාගේ පැවැත්ම පිණිස අවිනාශය පිණිස අතුරුදන් නොවීම පිණිස පවත්නාහ. කවර දෙදෙනෙක යත්: මොනොවට ගත් පෙළදහම ද මොනොවට ගත් අටුවා ද යන දෙකයි. මහණෙනි, මොනොවට ගත් පෙළදහමෙහි අටුවා ද සුනය වෙයි. මහණෙනි, මේ ධර්‍මයෝ දෙදෙන සද්ධර්‍මයාගේ පැවැත්ම පිණිස අවිනාශය පිණිස අතුරුදන් නොවීම පිණිස පවත්නාහ යි.",
                "type": "paragraph"
            },
            {
                "text": "අධිකරණවග දෙවැනි යි",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-2-2"
    }
]