[
    {
        "filename": "an-2-6",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 146
            },
            {
                "type": "heading",
                "text": "[ 6. පුග්ගලවග්ගො ]",
                "level": 3
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 1.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**[සාවත්ථිනිදානං:]**"
            },
            {
                "type": "paragraph",
                "text": "1. ද්වෙමෙ භික්ඛවෙ පුග්ගලා ලොකෙ උප්පජ්ජමානා උප්පජ්ජන්ති බහුජනහිතාය බහුජනසුඛාය බහුනො ජනස්ස අත්ථාය හිතාය සුඛාය දෙවමනුස්සානං."
            },
            {
                "type": "paragraph",
                "text": "කතමෙ ද්වෙ: තථාගතො ච අරහං සම්මාසම්බුද්ධො, රාජා ච චක්කවත්තී. ඉමෙ ඛො භික්ඛවෙ ද්වෙ පුග්ගලා ලොකෙ උප්පජ්ජමානා උප්පජ්ජන්ති බහුජනහිතාය බහුජනසුඛාය, බහුනො ජනස්ස අත්ථාය හිතාය සුඛාය දෙවමනුස්සානන්ති."
            },
            {
                "type": "page-break",
                "text": "148"
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "2. ද්වෙමෙ භික්ඛවෙ පුග්ගලා ලොකෙ උප්පජ්ජමානා උප්පජ්ජන්ති අච්ඡරියමනුස්සා. කතමෙ ද්වෙ: තථාගතො ච අරහං සම්මාසම්බුද්ධො, රාජා ච චක්කවත්තී. ඉමෙ ඛො භික්ඛවෙ ද්වෙ පුග්ගලා ලොකෙ උප්පජ්ජමානා උප්පජ්ජන්ති අච්ඡරියමනුස්සාති."
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3. ද්වින්නං භික්ඛවෙ පුග්ගලානං කාලකිරියා බහුනො ජනස්ස ආනුතප්පා{1 අනුතප්පා හොති - මඡසං. ස්යා. PTS.} හොති. කතමෙසං ද්වින්නං: තථාගතස්ස{2 තථාගතස්ස ච - මඡසං. ස්යා. PTS.} අරහතො සම්මාසම්බුද්ධස්ස, රඤ්ඤො චක්කවත්තිස්ස. ඉමෙසං ඛො භික්ඛවෙ ද්වින්නං පුග්ගලානං කාලකිරියා බහුනො ජනස්ස ආනුතප්පා හොති.{3 හොතීති - මඡසං. ස්යා. PTS.}"
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "4. ද්වෙමෙ භික්ඛවෙ ථූපාරහා. කතමෙ ද්වෙ: තථාගතො ච අරහං සම්මාසම්බුද්ධො, රාජා ච චක්කවත්තී. ඉමෙ ඛො භික්ඛවෙ ද්වෙ ථූපාරහාති."
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 5.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "5. ද්වෙමෙ භික්ඛවෙ බුද්ධා. කතමෙ ද්වෙ: තථාගතො ච අරහං සම්මාසම්බුද්ධො, පච්චෙකබුද්ධො ච. ඉමෙ ඛො භික්ඛවෙ ද්වෙ බුද්ධාති."
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "6. ද්වෙමෙ භික්ඛවෙ අසනියා ඵලන්තියා න සන්තසන්ති. කතමෙ ද්වෙ: භික්ඛු ච ඛීණාසවො, හත්ථාජානීයො ච. ඉමෙ ඛො භික්ඛවෙ ද්වෙ අසනියා ඵලන්තියා න සන්තසන්තීති."
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 7.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "7. ද්වෙමෙ භික්ඛවෙ අසනියා ඵලන්තියා න සන්තසන්ති. කතමෙ ද්වෙ: භික්ඛු ච ඛීණාසවො, අස්සාජානීයො ච. ඉමෙ ඛො භික්ඛවෙ ද්වෙ අසනියා ඵලන්තියා න සන්තසන්තීති."
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 8.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "8. ද්වෙමෙ භික්ඛවෙ අසනියා ඵලන්තියා න සන්තසන්ති. කතමෙ ද්වෙ: භික්ඛු ච ඛීණාසවො, සීහො ච මිගරාජා. ඉමෙ ඛො භික්ඛවෙ ද්වෙ අසනියා ඵලන්තියා න සන්තසන්තීති."
            },
            {
                "type": "page-break",
                "text": "150"
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 9.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "9. ද්වෙමෙ භික්ඛවෙ අත්ථවසෙ සම්පස්සමානා කිම්පුරිසා මානුසිං වාචං න භාසන්ති. කතමෙ ද්වෙ: මා ච මුසා භණිම්හා{1 භණිම්හ - මඡසං. ස්යා. සී 1. PTS.}, මා ච පරං අභූතෙන අබ්භාචික්ඛිම්හාති. ඉමෙ ඛො භික්ඛවෙ ද්වෙ අත්ථවසෙ සම්පස්සමානා කිම්පුරිසා මානුසිං වාචං න භාසන්තීති."
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "10. ද්වින්නං භික්ඛවෙ{2 ද්වින්නං ධම්මානං භික්ඛවෙ - මඡසං.} ධම්මානං අතිත්තො අප්පටිවානො මාතුගාමො කාලං කරොති. කතමෙසං ද්වින්නං: මෙථුනධම්මසමාපත්තියා{3 මෙථූනසමාපත්තියා ච - මඡසං.} ච, විජායනස්ස ච. ඉමෙසං ඛො භික්ඛවෙ ද්වින්නං ධම්මානං අතිත්තො අප්පටිවානො මාතුගාමො කාලං කරොතීති."
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 11.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "11. අසන්තසන්නිවාසංච වො භික්ඛවෙ දෙසිස්සාමි{4 දෙසෙස්සාමි - මඡසං, ස්යා, PTS.} සන්තසන්නිවාසඤ්ච. තං සුණාථ, සාධුකං මනසි කරොථ, භාසිස්සාමීති: එවං භන්තෙති ඛො තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ අසන්තසන්නිවාසො හොති: කථඤ්ච අසන්තො සන්නිවසන්ති:"
            },
            {
                "type": "paragraph",
                "text": "ඉධ භික්ඛවෙ ථෙරස්ස භික්ඛුනො එවං හොති : ථෙරොපි මං න වදෙය්ය, මජ්ඣිමොපි මං න වදෙය්ය, නවොපි මං න වදෙය්ය, ථෙරම්පහං{5 ථෙරම්පාහං - මඡසං, ස්යා.} න වදෙය්යං. මජ්ඣිමම්පාහං න වදෙය්යං, නවම්පහං{6 නවම්පාහං - ස්යා. මඡසං.} න වදෙය්යං. ථෙරො චෙපි මං වදෙය්ය, අහිතානුකම්පී මං වදෙය්ය, නො හිතානුකම්පී, නොති නං වදෙය්යං, විහෙසෙය්යම්පි{7 විහෙඨෙය්යං - මඡසං.} නං, පස්සම්පිස්ස න පටිකරෙය්යං. මජ්ඣිමො චෙපි මං වදෙය්ය, නවො චෙපි මං වදෙය්ය, අහිතානුකම්පී මං වදෙය්ය; නො හිතානුකම්පී. නොති නං වදෙය්යං, විහෙසෙය්යම්පි{8 විහෙඨෙය්යං - මඡසං.} නං, පස්සම්පිස්ස න පටිකරෙය්යං. මජ්ඣිමස්සපි භික්ඛුනො එවං හොති -පෙ- නවස්සපි භික්ඛුනො එවං හොති : ථෙරොපි මං න වදෙය්ය, මජ්ඣිමොපි මං න වදෙය්ය, නවොපි මං න වදෙය්ය, ථෙරම්පාහං න වදෙය්යං, මජ්ඣිමම්පහං න වදෙය්යං, නවම්පහං නං වදෙය්යං. ථෙරො චෙපි මං වදෙය්ය, අහිතානුකම්පී මං වදෙය්ය, නො හිතානුකම්පී, නොති නං වදෙය්යං, විහෙසෙය්යම්පි{9 විහෙඨෙය්යං - මඡසං.} නං, පස්සම්පිස්ස න පටිකරෙය්යං. මජ්ඣිමො චෙපි මං වදෙය්ය, නවො චෙපි මං වදෙය්ය; අහිතානුකම්පී මං වදෙය්ය, නො හිතානුකම්පී, නොති නං වදෙය්යං, විහෙසෙය්යම්පි{10 විහෙඨෙය්යං - මඡසං.} නං; පස්සම්පිස්ස න පටිකරෙය්යං. එවං ඛො භික්ඛවෙ අසන්තසන්නිවාසො හොති. එවං ච අසන්තො සන්නිවසන්ති."
            },
            {
                "type": "page-break",
                "text": "152"
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ සන්තසන්නිවාසො හොති: කථඤ්ච සන්තො සන්නිවසන්ති:"
            },
            {
                "type": "paragraph",
                "text": "ඉධ භික්ඛවෙ ථෙරස්ස භික්ඛුනො එවං හොති : ථෙරොපි මං වදෙය්ය, මජ්ඣිමොපි මං වදෙය්ය. නවොපි මං වදෙය්ය, ථෙරම්පහං වදෙය්යං, මජ්ඣිමම්පහං වදෙය්යං, නවම්පහං වදෙය්යං. ථෙරො චෙපි මං වදෙය්ය, හිතානුකම්පී මං වදෙය්ය, නො අහිතානුකප්පී, සාධූති නං වදෙය්යං, න විහෙසෙය්යං පස්සම්පිස්ස පටිකරෙය්යං. මජ්ඣිමො චෙපි මං වදෙය්ය, නවො චෙපි මං වදෙය්ය හිතානුකම්පී මං වදෙය්ය, නො අහිතානුකම්පී, සාධූති නං වදෙය්යං, න නං විහෙසෙය්යං, පස්සම්පිස්ස පටිකරෙය්යං. මජ්ඣිමස්සපි භික්ඛුනො එවං හොති -පෙ- නවස්සපි භික්ඛුනො එවං හොති: ථෙරොපි මං වදෙය්ය, මජ්ඣිමොපි මං වදෙය්ය, නවොපි මං වදෙය්ය, ථෙරම්පහං වදෙය්යං, මජ්ඣිමම්පහං වදෙය්යං, නවම්පහං වදෙය්යං. ථෙරො චෙපි මං වදෙය්ය, හිතානුකම්පී මං වදෙය්ය, නො අහිතානුකම්පී. සාධූති නං වදෙය්යං, න නං විහෙසෙය්යං, පස්සම්පිස්ස පටිකරෙය්යං. මජ්ඣිමො චෙපි මං වදෙය්ය, නවො චෙපි මං වදෙය්ය, හිතානුකම්පී මං වදෙය්ය නො අහිතානුකම්පී. සාධූති නං වදෙය්යං, න නං විහෙසෙය්යං, පස්සම්පිස්ස පටිකරෙය්යං. එවං ඛො භික්ඛවෙ සන්තසන්නිවාසො හොති. එවං ච{1 එවං - මඡසං. එවං ඛො - ස්යා.} සන්තො සන්නිවසන්තීති."
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 12.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "12. යස්මිං භික්ඛවෙ අධිකරණෙ උභතො වචීසංසාරො දිට්ඨිපලාසො චෙතසො ආඝාතො අප්පච්චයො අනභිරද්ධි අජ්ඣත්තං න අවූපසන්තං{2 න සුවුපසන්නං - සී 1. සීමු.} හොති. තස්මෙතං භික්ඛවෙ අධිකරණෙ පාටිකඞ්ඛං: දීඝත්තාය ඛරත්තාය වාළත්තාය සංවත්තිස්සති, භික්ඛූ ච න ඵාසුං විහරිස්සන්ති."
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 13.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "13. යස්මිඤ්ච ඛො භික්ඛවෙ අධිකරණෙ උභතො වචීසංසාරො දිට්ඨිපලාසො චෙතසො ආඝාතො අප්පච්චයො අනභිරද්ධි අජ්ඣත්තං අවූපසන්තං හොති. තස්මෙතං භික්ඛවෙ අධිකරණෙ පාටිකඞ්ඛං : න දීඝත්තාය ඛරත්තාය වාළත්තාය සංවත්තිස්සති. භික්ඛූ ච ඵාසුං විහරිස්සන්තීති."
            },
            {
                "type": "centered",
                "text": "පුග්ගල වග්ගො ඡට්ඨො.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 147
            },
            {
                "text": "[ 6. පුග්‌ගල වර්ගය ]",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 1.",
                "level": "1"
            },
            {
                "text": "**[සැවැත්නිදානයි:]**",
                "type": "unindented"
            },
            {
                "text": "1. මහණෙනි, මේ පුද්ගලයෝ දෙදෙනෙක් උපදනට සමත්වූවාහු ලොකයෙහි බොහෝ දෙනාට හිත පිණිස ද බොහෝ දෙනාට සුව පිණිස ද බොහෝ දෙනාට වැඩ පිණිස ද දෙවිමිනිසුනට හිත පිණිස ද සුව පිණිස ද උපනාහ.",
                "type": "paragraph"
            },
            {
                "text": "කවර දෙදෙනෙක යත්: තථාගත අර්‍හත් සම්‍යක්සම්බුද්ධයන් වහන්සේ හා චක්‍රවර්‍තති රජහු හා දෙදෙන ය. මහණෙනි, මේ පුද්ගලයෝ දෙදෙන ලොකයෙහි උපදනට සමත්වූවාහු බොහෝ දෙනාට හිත පිණිස ද බොහෝ දෙනාට සුව පිණිස ද බොහෝ දෙනාට වැඩ පිණිස ද දෙවි මිනිසුනට හිත පිණිස ද සුව පිණිස ද උපදනාහ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "149"
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 2.",
                "level": "1"
            },
            {
                "text": "2. මහණෙනි, මේ පුද්ගලයෝ දෙදෙනෙක් ලෝකයෙහි උපදනට සමත් වූවාහු ආශ‍චර්‍ය්‍ය මනුෂ්‍ය ව උපදිත්. කවර දෙදෙනෙක යත්: තථාගත අර්‍හත් සම්‍යක් සම්බුද්ධයන් වහන්සේ හා චක්‍රවර්‍තති රජ හා දෙදෙනයි. මහණෙනි, ලොකයෙහි උපදනට සමත් මේ පුද්ගලයෝ දෙදෙන ආශ‍චර්‍ය්‍ය මනුෂ්‍ය ව උපදනාහ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 3.",
                "level": "1"
            },
            {
                "text": "3. මහණෙනි, පුද්ගලයන් දෙදෙනක්හුගේ කාලක්‍රියාව බොහෝ දෙනාට අනුතාපකර වෙයි. කවර දෙදෙනක්හුගේ ය යත්: තථාගත අර්‍හත් සම්‍යක් සම්බුද්ධයන් වහන්සේගේ ය, චක්‍රවර්‍තති රජහුගේ ය. මහණෙනි, මේ පුද්ගලයන් දෙදෙනාගේ කාලක්‍රියාව බොහෝ දෙනාට අනුතාප කර වේ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 4.",
                "level": "1"
            },
            {
                "text": "4. මහණෙනි, මේ ස්තුපාර්‍හයෝ දෙදෙනෙකි. කවර දෙදෙනෙක යත්: තථාගත අර්‍හත් සම්‍යක් සම්බුද්ධයන් වහන්සේ හා චක්‍රවර්‍තති රජ හා දෙදෙනයි. මහණෙනි, මොහු වනාහි ස්තුපාර්‍හයෝ දෙදෙන වෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 5.",
                "level": "1"
            },
            {
                "text": "5. මහණෙනි, මේ බුදුවරු දෙදෙනෙකි. කවර දෙදෙනෙක යත්: තථාගත අර්‍හත් සම්‍යක් සම්බුද්ධයන් වහන්සේ හා ප්‍රත්‍යෙක බුදුන්වහන්සේ හා දෙදෙනයි. මහණෙනි, මොහු බුදුවරු දෙදෙන වෙත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 6.",
                "level": "1"
            },
            {
                "text": "6. මහණෙනි, මොහු දෙදෙනෙක් සෙන ගිගිරි කරණ කල්හි නොබත්. කවර දෙදෙනෙක යත්: ක්‍ෂීණාස්‍රව තෙමේ ද ආජානෙය හස්ති තෙමේ ද යන දෙදෙන යි. මහණෙනි, මේ දෙදෙන සෙන ගුගුරත් නො බති.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 7.",
                "level": "1"
            },
            {
                "text": "7. මහණෙනි, මොහු දෙදෙන සෙන ගිගිරි කරත් ම නො බානහ. කවර දෙදෙනෙක යත්: ක්‍ෂීණාස්‍රව තෙමේ ද ආජානෙය අශ්වයා ද යන දෙදෙන යි. මහණෙනි, මේ දෙදෙන සෙන ගුගුරණ කල්හි තැති නො ගණිත්.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 8.",
                "level": "1"
            },
            {
                "text": "8. මහණෙනි, මොහු දෙදෙන සෙන ගොහන කල්හි තැති නො ගණිත්: කවර දෙදෙනෙක යත්: ක්‍ෂීණාස්‍රව මහණ ද මෘගරාජන් වූ සිංහයා හා දෙදෙනයි. මහණෙනි, මොහු දෙදෙන සෙන ගොහන කල්හි තැති නො ගණිත්.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "151"
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 9.",
                "level": "1"
            },
            {
                "text": "9. මහණෙනි, මේ කරුණු දෙකක් දක්නා කිංපුරුෂයෝ මිනිස්බස් නො බෙණෙත්. කවර දෙකෙක යත්: නහමක් මුසවා බණමෝව යි, මෙරමා අභූතයෙන් නහමක් අභ්‍යාඛ්‍යාන කරමෝ ව යි යන දෙකයි. මහණෙනි, මේ කරුණු දෙක දක්නා කිංපුරුෂයෝ මිනිස්බස් නොබණන්නාහ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 10.",
                "level": "1"
            },
            {
                "text": "10. මහණෙනි, මේ ධර්‍ම දෙකක් පිළිබඳව මාගම අතෘප්ත ව නොපසුබට ව සිට කලුරිය කරයි. කවර දෙකක් පිළිබඳවය යත්: මෙවුන්දම්සෙවීම හා ප්‍රසූතිය හා යන දෙක පිළිබඳව යි. මහණෙනි, මේ ධර්‍ම දෙක පිළිබඳ මාගම අතෘප්ත ව නොපසුබට ව සිට කලුරිය කෙරේ ය යි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 11.",
                "level": "1"
            },
            {
                "text": "11. මහණෙනි, තොපට අසත්පුරුෂ සන්නිවාසය හා සත්පුරුෂසන්නිවාසය දෙසමි. එය අසව ...",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, කෙසේ නම් අසත්පුරුෂ සන්නිවාසය වේය යත්: කෙසේ නම් අසත්පුරුෂයෝ එක්ව වෙසෙත්ය යත්:",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මෙ සස්නෙහි ස්ථවිර භික්‍ෂූහට මෙබඳු සිතෙක් වෙයි: වැඩිහිටි තෙරද මට නහමක් කියාවා, මධ්‍යම තෙර ද මට නහමක් කියාවා, නවක තෙමේ ද මට නහමක් කියාවා, මම ද මහලු තෙරුන්ට නහමක් කියම්වා, මම මැදුම් තෙරුන් ට ද නහමක් කියම්වා, නවක භික්‍ෂුහට ද නහමක් කියම්වා, මහලු තෙර ද මට කියන්නේ නම්, හිතානුකම්පා නැත්තේ ම මට කියයි. හිතානුකම්පා ඇති ව නො කියයි ඔහුට නැතැයි ද කියනෙමි. ඔහුට වෙහෙස ද කරමි, එය දක්නෙම් නමුදු පිළියම් නො කරමි. ඉදින් මැදුම් තෙර ද මට කියා නම් ... ඉදින් නවක භික්‍ෂූ ද මට කියා නම්, අහිතානුකම්පා ඇති ව මට කියනේය. හිතානුකම්පා ඇති ව නො වේ. ඔහුට මම නැතැ’යි කියමි. ඔහුට වෙහෙස ද කරමි. දක්නෙම් නමුදු එයට පිළියම් නො කරමි. මැදුම් මහණහට ද මෙබඳු සිතෙක් වෙයි ... නවක භික්‍ෂුහට ද මෙබඳු සිතෙක් වෙයි: මහලු තෙර ද මට නහමක් කියාවා, මැදුම් තෙර ද මට නහමක් කියාවා, නවක භික්‍ෂු තෙමේ ද මට නහමක් කියාවා, මම ද මහලු තෙරුන්ට නහමක් කියමි. මැදුම් තෙරුන්ට ද මම නහමක් කියමි. නවක භික්‍ෂූහට ද මම නහමක් කියමි. ඉදින් මහලු තෙර ද මට කියා නම්, (මට) අහිතානුකම්පී ව කියන්නේය. හිතානුකම්පී ව නො වේ. නැතැයි ඔහුට කියමි, ඔහුට වෙහෙස ද කරමි. දක්නෙම් නමුදු එයට පිළියම් නො කරමි. ඉදින් මැදුම් තෙර ද මට කියා නම් ... ඉදින් නවක භික්‍ෂූ තෙමේ ද මට කියා නම්, අහිතානුකම්පී ව මට කියන්නේය, හිතානුකම්පී ව නො වේ. නැතැයි ඔහුට කියමි, ඔහුට වෙහෙස ද කරමි. දක්නෙම් නමුදු එයට පිළියම් නො කරමි. මහණෙනි, මෙසේ වනාහි අසත්පුරුෂ සන්නිවාසය වේ. මෙසේ ද අසත්පුරුෂයෝ එක්ව වෙසෙත්.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "153"
            },
            {
                "text": "මහණෙනි, සත්පුරුෂසන්නිවාසය කෙසේය යත්: සත්පුරුෂයෝ කෙසේ නම් එක්ව වෙසෙති යත්:",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මෙ සස්නෙහි මහලු තෙරුන්ට මෙබඳු සිතෙක් වෙයි: මහලු තෙර ද මට කියාවා, මැදුම් තෙරද මට කියාවා, නවක භික්‍ෂු තෙමේ ද මට කියාවා, මම ද මහලු තෙරුන්ට ද කියමි. මැදුම් තෙරුන්ට ද මම කියමි. නවක භික්‍ෂූහට ද මම කියමි. ඉදින් මහලු තෙර ද මට කියා නම්, හිතානුකම්පී ව මට කියයි. අහිතානුකම්පී ව නො වේ, මැනවැයි ඔහුට කියමි. මම ඒ තෙරුන් නො වෙහෙසන්නෙමි. මම දක්නෙම් එයට පිළියම් කරමි. ඉදින් මධ්‍යම තෙර ද මට කියා ... නවක භික්‍ෂු තෙමේ ද මට කියා නම්, හිතානුකම්පී ව මට කියනේය. අහිතානුකම්පී ව නො කියන්නේය. (මම) මැනවැ යි ඒ තෙරුන්ට කියමි, ඒ තෙරුන් නො වෙහෙසමි, දක්නෙම් එයට පිළියම් කරමි. මධ්‍යම භික්‍ෂුහට ද මෙබඳු සිතෙක් වෙයි ... නවක භික්‍ෂුහට ද මෙබඳු සිතෙක් වෙයි: මහලු තෙර ද මට කියාවා, මැදුම් මහණ තෙමේ ද මට කියාවා, නවක මහණ තෙමේ ද මට කියාවා, මම ද මහලු තෙරුන්ට කියනෙමි ... මම ද මැදුම් තෙරුන්ට කියන්නෙමි. ... මම ද නවක මහණහට කියන්නෙමි. ඉදින් මහලු තෙර ද මට කියා නම්, මට හිතානුකම්පී ව කියන්නේය. අහිතානුකම්පී ව නො කියන්නේය. ඔහුට “මැනවැ”යි කියමි. ඔහුට වෙහෙස ද නො කරමි. දක්නෙම් නමුදු එයට පිළියම් කරමි. ඉදින් මැදුම් තෙර ද මට කියන්නේ නම් ... ඉදින් නවක මහණ තෙමේ ද මට කියන්නේ නම්, හිතානුකම්පී ව මට කියන්නේය, අහිතානුකම්පී ව නො කියන්නේය. ඔහුට “මැනවැ”යි කියමි. ඔහුට වෙහෙස ද නො කරමි. දක්නෙම් පිළියම් ද කරමි. මහණෙනි, මෙසේ වනාහි සත්පුරුෂ සන්නිවාසය වෙයි. මෙසේ ම සතපුරුෂයෝ එක්ව වෙසෙත් යයි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 12.",
                "level": "1"
            },
            {
                "text": "12. මහණෙනි, යම් අධිකරණයෙක (උනුන් ආක්‍රොශවශයෙන් සමචලා ගැණීම වූ) වාක්සංසරණය ද, (දෘෂ්ටිය නිසා උපදනා යුගග්‍රාහ සඞ්ඛ්‍යාත) පළාසය ද, චිත්තයෙහි වූ කොපය ද, නොසතුට ද, නො ඇල්ම ද, අධ්‍යාත්මයෙහි මැනැවින් නොසන්හිඳුනේ වේ ද, මහණෙනි, ඒ අධිකරණයෙහි මෙය බොහෝ කල් පැවැත්මට රළුබවට සැඩබවට වැටෙන්නේය. භික්‍ෂූහු ද සුවසේ නො වෙසෙන්නාහ’ යි කැමැති විය යුත්තේ යි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 2. 6. 13.",
                "level": "1"
            },
            {
                "text": "13. මහණෙනි, යම් අධිකරණයෙක දෙපස වාක් සංසරණය, දිට්ඨිපළාසය, චිත්තයාගේ ආඝාතය අසන්තුෂ්ටිය, අනභිරද්ධිය, අධ්‍යාත්මයෙහි මැනැවින් සන්හිඳුනේ වේ ද, මහණෙනි, මෙය ඒ අධිකරණයෙහි බොහෝ කල් පැවැත්මට රළුබවට සැඩබවට නො වැටෙන්නේය. භික්‍ෂූහු ද සුවසේ වෙසෙන්නාහ යි කැමැති විය යුත්තේ යි.",
                "type": "paragraph"
            },
            {
                "text": "සවන පුඟුල්වගයි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-2-6"
    }
]