[
    {
        "filename": "an-2-5",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 136
            },
            {
                "type": "heading",
                "text": "[ 5. පරිසවග්ගො ]",
                "level": 3
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 1.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**[සාවත්ථිනිදානං:]**"
            },
            {
                "type": "paragraph",
                "text": "42. ද්වෙමා භික්ඛවෙ පරිසා. කතමා ද්වෙ: උත්තානා ච පරිසා ගම්භීරා ච පරිසා."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ උත්තානා පරිසා: ඉධ භික්ඛවෙ යස්සං පරිසායං භික්ඛූ උද්ධතා හොන්ති උන්නලා චපලා මුඛරා විකිණ්ණවාචා මුට්ඨස්සතී අසම්පජානා අසමාහිතා විබ්භන්තචිත්තා පාකතින්ද්රියා. අයං වුච්චති භික්ඛවෙ උත්තානා පරිසා."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ ගම්භීරා පරිසා: ඉධ භික්ඛවෙ යස්සං පරිසායං භික්ඛූ අනුද්ධතා හොන්ති අනුන්නලා අචපලා අමුඛරා අවිකිණ්ණවාචා උපට්ඨිතසතී සම්පජානා සමාහිතා එකග්ග චිත්තා සංවුතින්ද්රියා. අයං වුච්චති භික්ඛවෙ ගම්භීරා පරිසා. ඉමා ඛො භික්ඛවෙ ද්වෙ පරිසා. එතදග්ගං භික්ඛවෙ ඉමාසං ද්වින්නං පරිසානං යදිදං ගම්භීරා පරිසාති."
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "43. ද්වෙමා භික්ඛවෙ පරිසා: කතමා ද්වෙ: වග්ගා ච පරිසා, සමග්ගා ච පරිසා."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ වග්ගා පරිසා. ඉධ භික්ඛවෙ යස්සං පරිසායං භික්ඛූ භණ්ඩනජාතා කලහජාතා විවාදාපන්නා අඤ්ඤමඤ්ඤං මුඛසත්තීහි විතුදන්තා විහරන්ති. අයං වුච්චති භික්ඛවෙ වග්ගා පරිසා."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ සමග්ගා පරිසා: ඉධ භික්ඛවෙ යස්සං පරිසායං භික්ඛූ සමග්ගා සම්මොදමානා අවිවදමානා ඛීරොදකීභූතා අඤ්ඤමඤ්ඤං පියචක්ඛූහි සම්පස්සන්තා විහරන්ති. අයං වුච්චති භික්ඛවෙ සමග්ගා පරිසා. ඉමා ඛො භික්ඛවෙ ද්වෙ පරිසා. එතදග්ගං භික්ඛවෙ ඉමාසං ද්වින්නං පරිසානං යදිදං සමග්ගා පරිසාති."
            },
            {
                "type": "page-break",
                "text": "138"
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "44. ද්වෙමා භික්ඛවෙ පරිසා. කතමා ද්වෙ: අනග්ගවතී ච පරිසා, අග්ගවතී ච පරිසා."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ අනග්ගවතී පරිසා: ඉධ භික්ඛවෙ යස්සං පරිසායං ථෙරා භික්ඛූ බාහුලිකා{1 බාහුල්ලිකා - ස්යා. කං.} හොන්ති සාථලිකා ඔක්කමනෙ පුබ්බඞ්ගමා පවිවෙකෙ නික්ඛිත්තධුරා, න විරියං ආරභන්ති අප්පත්තස්ස පත්තියා අනධිගතස්ස අධිගමාය අසච්ඡිකතස්ස සච්ඡිකිරියාය. තෙසං පච්ඡිමා ජනතා දිට්ඨානුගතිං ආපජ්ජති. සාපි හොති බාහුලිකා{2 බාහුල්ලිකා - ස්යා. කං.} සාථලිකා ඔක්කමනෙ පුබ්බඞ්ගමා පවිවෙකෙ නික්ඛිත්තධුරා, න විරියං ආරභති අප්පත්තස්ස පත්තියා අනධිගතස්ස අධිගමාය අසච්ඡිකතස්ස සච්ඡිකිරියාය. අයං වුච්චති භික්ඛවෙ අනග්ගවතී පරිසා."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ අග්ගවතී පරිසා: ඉධභික්ඛවෙයස්සං පරිසායං ථෙරා භික්ඛූ න බාහුලිකා හොන්ති න සාථලිකා, ඔක්කමනෙ නික්ඛිත්තධුරා පවිවෙකෙ පුබ්බඞ්ගමා විරියං ආරභන්ති, අප්පත්තස්ස පත්තියා අනධිගතස්ස අධිගමාය අසච්ඡිකතස්ස සච්ඡිකිරියාය. තෙසං පච්ඡිමා ජනතා දිට්ඨානුගතිං ආපජ්ජති. සාපි හොති න බාහුලිකා න සාථලිකා, ඔක්කමනෙ නික්ඛිත්තධුරා පවිවෙකෙ පුබ්බඞ්ගමා, විරියං ආරභති අප්පත්තස්ස පත්තියා අනධිගතස්ස අධිගමාය අසච්ඡිකතස්ස සච්ඡිකිරියාය. අයං වුච්චති භික්ඛවෙ අග්ගවතී පරිසා. ඉමා ඛො භික්ඛවෙ ද්වෙ පරිසා. එතදග්ගං භික්ඛවෙ ඉමාසං ද්වින්නං පරිසානං යදිදං අග්ගවතී පරිසාති."
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 4.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "45. ද්වෙමා භික්ඛවෙ පරිසා. කතමා ද්වෙ: අනරියා ච පරිසා, අරියා ච පරිසා."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ අනරියා පරිසා: ඉධ භික්ඛවෙ යස්සං පරිසායං භික්ඛූ ඉදං දුක්ඛන්ති යථාභූතං නප්පජානන්ති, අයං දුක්ඛසමුදයොති යථාභූතං නප්පජානන්ති, අයං දුක්ඛනිරොධොති යථාභූතං නප්පජානන්ති, අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං නප්පජානන්ති. අයං වුච්චති භික්ඛවෙ අනරියා පරිසා."
            },
            {
                "type": "page-break",
                "text": "140"
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ අරියා පරිසා: ඉධ භික්ඛවෙ යස්සං පරිසායං භික්ඛූ ඉදං දුක්ඛන්ති යථාභූතං පජානන්ති, අයං දුක්ඛසමුදයොති යථාභූතං පජානන්ති, අයං දුක්ඛනිරොධොති යථාභූතං පජානන්ති, අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං පජානන්ති. අයං වුච්චති භික්ඛවෙ අරියා පරිසා. ඉමා ඛො භික්ඛවෙ ද්වෙ පරිසා. එතදග්ගං භික්ඛවෙ ඉමාසං ද්වින්නං පරිසානං යදිදං අරියා පරිසාති."
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 5.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "46. ද්වෙමා භික්ඛවෙ පරිසා. කතමා ද්වෙ: පරිසකසටො{1 පරිසාකසටො ච, පරිසාමණ්ඩොච - මඡසං.} ච පරිසමණ්ඩො ච."
            },
            {
                "type": "paragraph",
                "text": "කතමො ච භික්ඛවෙ පරිසකසටො: ඉධ භික්ඛවෙ යස්සං පරිසායං භික්ඛූ ඡන්දාගතිං ගච්ඡන්ති, දොසාගතිං ගච්ඡන්ති, මොහාගතිං ගච්ඡන්ති, භයාගතිං ගච්ඡන්ති. අයං වුච්චති භික්ඛවෙ පරිසකසටො."
            },
            {
                "type": "paragraph",
                "text": "කතමො ච භික්ඛවෙ පරිසමණ්ඩො: ඉධ භික්ඛවෙ යස්සං පරිසායං භික්ඛූ න ඡන්දාගතිං ගච්ඡන්ති, න දොසාගතිං ගච්ඡන්ති, න මොහාගතිං ගච්ඡන්ති, න භයාගතිං ගච්ඡන්ති. අයං වුච්චති භික්ඛවෙ පරිසමණ්ඩො. ඉමා ඛො භික්ඛවෙ ද්වෙ පරිසා. එතදග්ගං භික්ඛවෙ ඉමාසං ද්වින්නං පරිසානං යදිදං පරිසාමණ්ඩොති."
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "47. ද්වෙමා භික්ඛවෙ පරිසා. කතමා ද්වෙ: ඔක්කාචිතවිනීතා{2 උක්කාචිකවිනීතා - සීමු. සී 1, PTS, ස්යා.} පරිසා නො පටිපුච්ඡාවිනීතා, පටිපුච්ඡාවිනීතා පරිසා නො ඔක්කාචිතවිනීතා."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ ඔක්කාචිතවිනීතා පරිසා නො පටිපුච්ඡාවිනීතා: ඉධ භික්ඛවෙ යස්සං පරිසායං භික්ඛූ යෙ තෙ සුත්තන්තා තථාගතභාසිතා ගම්භීරා ගම්භීරත්ථා ලොකුත්තරා සුඤ්ඤතා{3 සුඤ්ඤාතපටිසංයුත්තා - ස්යා.} පටිසඤ්ඤුත්තා. තෙසු භඤ්ඤමානෙසු න සුස්සූසන්ති න සොතං ඔදහන්ති, න අඤ්ඤාචිත්තං උපට්ඨපෙන්ති, න ච තෙ ධම්මෙ උග්ගහෙතබ්බං පරියාපුණිතබ්බං මඤ්ඤන්ති. යෙ පන තෙ සුත්තන්තා කවිකතා{4 කවිතා - මඡසං. * පටිචරන්ති - කත්ථචි.} කාවෙය්යා චිත්තක්ඛරා චිත්තබ්යඤ්ජනා බාහිරකා සාවකභාසිතා. තෙසු භඤ්ඤමානෙසු සුස්සූසන්ති, සොතං ඔදහන්ති, අඤ්ඤාචිත්තං උපට්ඨපෙන්ති, තෙ ච ධම්මෙ උග්ගහෙතබ්බං පරියාපුණිතබ්බං මඤ්ඤන්ති. තෙ තං ධම්මං පරියාපුණිත්වා න චෙව අඤ්ඤමඤ්ඤං පටිපුච්ඡන්ති, පටිවිචරන්ති*. ඉදං කථං, ඉමස්ස ක්වත්ථොති? තෙ අවිවටඤ්චෙව න විවරන්ති, අනුත්තානීකතඤ්ච න උත්තානී කරොන්ති. අනෙකවිහිතෙසු ච කඞ්ඛාඨානීයෙසු ධම්මෙසු කඞ්ඛං න පටිවිනොදෙන්ති.{5 නප්පටිවිනොදෙන්ති - මඡසං, ස්යා.} අයං වුච්චති භික්ඛවෙ ඔක්කාචිතවිනීතා පරිසා, නො පටිපුච්ඡාවිනීතා."
            },
            {
                "type": "page-break",
                "text": "142"
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ පටිපුච්ඡාවිනීතා පරිසා නො ඔක්කාචිතවිනීතා: ඉධ භික්ඛවෙ යස්සං පරිසායං භික්ඛූ යෙ තෙ සුත්තන්තා, කවිකතා කාවෙය්යා චිත්තක්ඛරා චිත්තබ්යඤ්ජනා බාහිරකා සාවකභාසිතා, තෙසු භඤ්ඤමානෙසු න සුස්සූසන්ති, න සොතං ඔදහන්ති, න අඤ්ඤා චිත්තං උපට්ඨපෙන්ති, න ච තෙ ධම්මෙ උග්ගහෙතබ්බං පරියාපුණිතබ්බං මඤ්ඤන්ති. යෙ පන තෙ සුත්තන්තා තථාගතභාසිතා ගම්භීරා ගම්භීරත්ථා ලොකුත්තරා සුඤ්ඤතාපටිසඤ්ඤුත්තා, තෙසු භඤ්ඤමානෙසු සුස්සූසන්ති, සොතං ඔදහන්ති, අඤ්ඤා චිත්තං උපට්ඨපෙන්ති, තෙ ච ධම්මෙ උග්ගහෙතබ්බං පරියාපුණිතබ්බං මඤ්ඤන්ති. තෙ තං ධම්මං පරියාපුණිත්වා අඤ්ඤමඤ්ඤං පටිපුච්ඡන්ති, පටිවිචරන්ති, ඉදං කථං? ඉමස්ස ක්වත්ථොති,{1 කො අත්ථොති - මඡසං. * අඤ්ඤමඤ්ඤස්ස වණ්ණං න භාසෙන්ති - මඡසං, න ගිහීනං ඔදාතවසනානං සම්මුඛා අඤ්ඤමඤ්ඤාස්ස වණ්ණං භාසන්ති - ස්යා. මඡසං.+ මරම්මපොත්ථකෙ අයං පාඨො න දිස්සතෙ.} තෙ අවිවටඤ්චෙව විවරන්ති? අනුත්තානීකතඤ්ච උත්තානීකරොන්ති, අනෙකවිහිතෙසු ච කඞ්ඛාඨානීයෙසු ධම්මෙසු කඞ්ඛං පටිවිනොදෙන්ති. අයං වුච්චති භික්ඛවෙ පටිපුච්ඡාවිනීතා පරිසා නො ඔක්කාචිතවිනීතා. ඉමා ඛො භික්ඛවෙ ද්වෙ පරිසා. එතදග්ගං භික්ඛවෙ ඉමාසං ද්වින්නං පරිසානං යදිදං පටිපුච්ඡාවිනීතා පරිසා නො ඔක්කාචිතවිනීතාති."
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 7.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "48. ද්වෙමා භික්ඛවෙ පරිසා. කතමා ද්වෙ: ආමිසගරු පරිසා නො සද්ධම්මගරු, සද්ධම්මගරු පරිසා නො ආමිසගරු."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ ආමිසගරු පරිසා නො සද්ධම්මගරු: ඉධ භික්ඛවෙ යස්සං පරිසායං භික්ඛූ ගිහීනං ඔදාතවසනානං සම්මුඛා අඤ්ඤමඤ්ඤස්ස වණ්ණං භාසන්ති, අසුකො භික්ඛු උභතොභාගවිමුත්තො, අසුකො පඤ්ඤාවිමුත්තො, අසුකො කායසක්ඛී, අසුකො දිට්ඨප්පත්තො, අසුකො සද්ධාවිමුත්තො, අසුකො ධම්මානුසාරී, අසුකො සද්ධානුසාරී, අසුකො සීලවා කල්යාණධම්මො, අසුකො දුස්සීලො පාපධම්මොති. තෙ තෙන ලාභං ලභන්ති. තෙ තං ලාභං ලභිත්වා ගථිතා මුච්ඡිතා අජ්ඣොපන්නා අනාදීනවදස්සාවිනො අනිස්සරණපඤ්ඤා පරිභුඤ්ජන්ති. අයං වුච්චති භික්ඛවෙ ආමිසගරු පරිසා නො සද්ධම්මගරු."
            },
            {
                "type": "page-break",
                "text": "144"
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ සද්ධම්මගරු පරිසා නො ආමිසගරු: ඉධ භික්ඛවෙ යස්සං පරිසායං භික්ඛූ ගිහීනං ඔදාතවසනානං සම්මුඛා *න අඤ්ඤමඤ්ඤස්ස වණ්ණං භාසන්ති: අසුකො භික්ඛු උභතොභාගවිමුත්තො, අසුකො පඤ්ඤාවිමුත්තො, අසුකො කායසක්ඛී, අසුකො දිට්ඨප්පත්තො, අසුකො සද්ධාවිමුත්තො, අසුකො ධම්මානුසාරී, අසුකො සද්ධානුසාරී, අසුකො සීලවා කල්යාණධම්මො, අසුකො දුස්සීලො පාපධම්මොති. තෙ තෙන ලාභං ලභන්ති. තං ලාභම්පි ලභිත්වා අගථිතා අමුච්ඡිතා අනජ්ඣොසන්නා ආදීනවදස්සාවිනො නිස්සරණපඤ්ඤා පරිභුඤ්ජන්ති. අයං වුච්චති භික්ඛවෙ සද්ධම්මගරු පරිසා නො ආමිසගරු. ඉමා ඛො භික්ඛවෙ ද්වෙ පරිසා. එතදග්ගං භික්ඛවෙ ඉමාසං ද්වින්නං පරිසානං යදිදං සද්ධම්මගරු පරිසා නො ආමිසගරුති."
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 8.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "49. ද්වෙමා භික්ඛවෙ පරිසා. කතමා ද්වෙ: විසමා ච පරිසා, සමා ච පරිසා."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ විසමා පරිසා: ඉධ භික්ඛවෙ යස්සං පරිසායං අධම්මකම්මානි පවත්තන්ති, ධම්මකම්මානි නප්පවත්තන්ති, අවිනයකම්මානි පවත්තන්ති, විනයකම්මානි නප්පවත්තන්ති. අධම්මකම්මානි දිප්පන්ති, ධම්මකම්මානි න දිප්පන්ති. අවිනයකම්මානි දිප්පන්ති, විනයකම්මානි න දිප්පන්ති. අයං වුච්චති භික්ඛවෙ විසමා පරිසා. +විසමත්තා භික්ඛවෙ පරිසාය අධම්මකම්මානි පවත්තන්ති, ධම්මකම්මානි නප්පවත්තන්ති. අවිනයකම්මානි පවත්තන්ති, විනයකම්මානි නප්පවත්තන්ති. අධම්මකම්මානි දිප්පන්ති, ධම්මකම්මානි න දිප්පන්ති, අවිනයකම්මානි දිප්පන්ති, විනයකම්මානි න දිප්පන්ති."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ සමා පරිසා: ඉධ භික්ඛවෙ යස්සං පරිසායං ධම්මකම්මානි පවත්තන්ති, අධම්මකම්මානි නප්පවත්තන්ති, විනයකම්මානි පවත්තන්ති, අවිනයකම්මානි නප්පවත්තන්ති, ධම්මකම්මානි දිප්පන්ති, අධම්මකම්මානි න දිප්පන්ති, විනයකම්මානි දිප්පන්ති, අවිනයකම්මානි න දිප්පන්ති. අයං වුච්චති භික්ඛවෙ සමා පරිසා. +සමත්තා භික්ඛවෙ පරිසාය ධම්මකම්මානි පවත්තන්ති, අධම්මකම්මානි නප්පවත්තන්ති. විනයකම්මානි පවත්තන්ති, අවිනයකම්මානි නප්පවත්තන්ති. ධම්මකම්මානි දිප්පන්ති, අධම්මකම්මානි න දිප්පන්ති, විනයකම්මානි දිප්පන්ති, අවිනයකම්මානි න දිප්පන්ති. ඉමා ඛො භික්ඛවෙ ද්වෙ පරිසා. එතදග්ගං භික්ඛවෙ ඉමාසං ද්වින්නං පරිසානං යදිදං සමා පරිසාති."
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 9.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "50. ද්වෙමා භික්ඛවෙ පරිසා. කතමා ද්වෙ: අධම්මිකා ච පරිසා, ධම්මිකා ච පරිසා. -පෙ- ඉමා ඛො භික්ඛවෙ ද්වෙ පරිසා. එතදග්ගං භික්ඛවෙ ඉමාසං ද්වින්නං පරිසානං යදිදං ධම්මිකා පරිසාති."
            },
            {
                "type": "page-break",
                "text": "146"
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "51. ද්වෙමා භික්ඛවෙ පරිසා. කතමා ද්වෙ: අධම්මවාදිනී ච පරිසා, ධම්මවාදිනී ච පරිසා."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ අධම්මවාදිනී පරිසා: ඉධ භික්ඛවෙ යස්සං පරිසායං භික්ඛූ අධිකරණං ආදියන්ති ධම්මිකං වා අධම්මිකං වා. තෙ තං අධිකරණං ආදියිත්වා න චෙව අඤ්ඤමඤ්ඤං සඤ්ඤාපෙන්ති, න ච සඤ්ඤත්තිං උපගච්ඡන්ති, න ච නිජ්ඣාපෙන්ති, න ච නිජ්ඣත්තිං උපගච්ඡන්ති. තෙ අසඤ්ඤත්තිබලා අනිජ්ඣත්තිබලා අප්පටිනිස්සග්ගමන්තිනො තමෙව අධිකරණං ථාමසා පරාමස්ස{1 පරාමාසා - මඡසං.}අභිනිවිස්ස වොහරන්ති, ඉදමෙව සච්චං මොඝමඤ්ඤන්ති. අයං වුච්චති භික්ඛවෙ අධම්මවාදිනී පරිසා."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ ධම්මවාදිනී පරිසා: ඉධ භික්ඛවෙ යස්සං පරිසායං භික්ඛූ අධිකරණං ආදියන්ති, ධම්මිකං වා අධම්මිකං වා. තෙ තං අධිකරණං ආදියිත්වා අඤ්ඤමඤ්ඤං සඤ්ඤාපෙන්ති චෙව සඤ්ඤත්තිඤ්ච උපගච්ඡන්ති. නිජ්ඣාපෙන්ති චෙව නිජ්ඣත්තිඤ්ච උපගච්ඡන්ති. තෙ සඤ්ඤත්තිබලා නිජ්ඣත්තිබලා පටිනිස්සග්ගමන්තිනො න තමෙව අධිකරණං ථාමසා පරාමස්ස{2 පරාමාසා - මඡසං.} අභිනිවිස්ස වොහරන්ති, ඉදමෙව සච්චං මොඝමඤ්ඤන්ති. අයං වුච්චති භික්ඛවෙ ධම්මවාදිනී පරිසා. ඉමා ඛො භික්ඛවෙ ද්වෙ පරිසා. එතදග්ගං භික්ඛවෙ ඉමාසං ද්වින්නං පරිසානං යදිදං ධම්මවාදිනී පරිසාති."
            },
            {
                "type": "centered",
                "text": "පරිසවග්ගො පඤ්චමො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං :**"
            },
            {
                "type": "gatha",
                "text": "උත්තානා වග්ගා අග්ගවතී අරියා කසටො ච පඤ්චමො,\nඔක්කාචිතාමිසඤ්චෙව විසමා අධම්මා ධම්මියෙන චාති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "පඨමො පණ්ණාසකො සමත්තො.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "දුතියො පණ්ණාසකො",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 137
            },
            {
                "text": "[ 5. පරිස වර්ගය ]",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 1.",
                "level": "1"
            },
            {
                "text": "**[සැවැත්නිදානයි:]**",
                "type": "unindented"
            },
            {
                "text": "42. මහණෙනි, මේ පිරිස් දෙකෙකි. කවර දෙකෙක යත්: නොගැඹුරු (ප්‍රකට) පිරිස හා ගැඹුරු (මුවහ) පිරිස හා යන දෙකය.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, නොගැඹුරු පිරිස කවර: මහණෙනි, මෙසස්නෙහි යම් පිරිසෙක්හි භික්‍ෂූහු වික්‍ෂිප්ත සිත් ඇති වෙත් ද, උස් ව නැඟූනු මාන නළ ඇති වෙත් ද, චපල වෙත් ද, රළුවදන් ඇති වෙත් ද, පලප් ඇති වෙත් ද, මුෂිතස්මෘති වෙත් ද, සම්‍යක්ප්‍රඥා නැති වෙත් ද, සමාධිගත සිත් නැති වෙත් ද, එකඟ නො වූ සිත් ඇති වෙත් ද, භ්‍රාන්ත සිත් ඇති වෙත් ද, (සංවර නොකෙළෙන්) පියවි ඉඳුරන් ඇති වෙත් ද, මහණෙනි, මේ උත්තාන (නොමුවහ) පිරිස යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, ගැඹුරු පිරිස කවර: මහණෙනි, මෙසස්නෙහි යම් පිරිසෙක්හි භික්‍ෂූහු වික්‍ෂිප්ත සිත් නැති වෙත් ද, උස් ව නැඟූනු මාන නළ නැති වෙත් ද, චපල නො වෙත් ද, රළුවදන් නැති වෙත් ද, අසංවෘත වචන නැති වෙත් ද, එළඹසිටි සිහි ඇති වෙත් ද, සම්‍යක් ප්‍රඥා ඇති වෙත් ද, සමාධිගත සිත් ඇති වෙත් ද, එකඟ වූ සිත් ඇති වෙත් ද, සංවර කළ ඉඳුරන් ඇති වෙත් ද, මහණෙනි, මේ ගම්භීර පිරිසැ යි කියනු ලැබේ. මහණෙනි, මේ පිරිස් දෙකය. මහණෙනි, මේ දෙපිරිස් අතුරෙන් යම් ගැඹුරු පිරිසෙක් වේ නම්, තෙල අග්‍ර වේ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 2.",
                "level": "1"
            },
            {
                "text": "43. මහණෙනි, මේ පිරිස් දෙකෙකි. කවර දෙකෙක යත්: ව්‍යග්‍ර පිරිස හා සමග්‍ර පිරිස හා යන දෙකයි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, ව්‍යග්‍ර පිරිස කවර: මහණෙනි, මෙසස්නෙහි යම් පිරිසෙක්හි භික්‍ෂූහු හටගත් පූර්‍වභාග සටන් ඇත්තාහු, හටගත් කලහ ඇත්තාහු, විරුද්ධවාදයට පැමිණියාහු, උනුන් මුවසැතින් විදුනාහු වෙසෙත් ද, මහණෙනි, මේ වර්‍ග පිරිසැ යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, සමග්‍ර පිරිස කවර: මහණෙනි, මෙසස්නෙහි යම් පිරිසෙක්හි භික්‍ෂූහු සමග වූවාහු, සතුටුවන්නාහු විවාද නොකරන්නාහු, කිරි හා දිය මෙන් සැසැඳුනාහු, උනුන් පියනෙතින් බලන්නාහු වෙසෙත් ද, මහණෙනි, මේ සමග්‍ර පිරිසැ යි කියනු ලැබේ. මහණෙනි, මේ වනාහි දෙපිරිස ය. මහණෙනි, මේ දෙපිරිස් අතුරෙන් යම් සමග්‍ර පිරිසක් වේ නම්, තෙල අග්‍ර වේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "139"
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 3.",
                "level": "1"
            },
            {
                "text": "44. මහණෙනි, මේ පිරිස් දෙකෙකි. කවර දෙකෙක යත්: (උතුම් පුඟුලන් ඇති හෙයින්) අග්ගවතී නම් පිරිස හා (උතුම් පුඟුලන් නැති හෙයින්) අනග්ගවතී නම් පිරිස හා දෙකයි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, අනග්ගවතී පිරිස් කවර: මහණෙනි, මේ සස්නෙහි යම් පිරිසෙක ස්ථවිර භික්‍ෂූහු (සිවුරු ඈ පිරිකරින්) බාහුලික වෙත් ද, සස්න ලිහිල් කොට ගන්නාහු වෙත් ද, අවක්‍රමණ සඞ්ඛ්‍යාත පඤ්චනීවරණධර්‍මයන් පිරිමෙහි පෙරටු වෙත් ද, ප්‍රවිවෙක සඞ්ඛ්‍යාත නිර්‍වාණයෙහි බහා තැබූ වීර්‍ය්‍යධුර ඇති වෙත් ද, නොලත් (ධ්‍යාන් - විදර්‍ශනා - මාර්‍ග - ඵල විශෙෂයාගේ) ප්‍රාප්තිය පිණිස අනධිගත ධර්‍මයාගේ අධිගමය පිණිස, පසක් නො කළ ධර්‍මයාගේ පසක් කිරීම පිණිස වැර නො වඩත් ද, ඔවුන්ගේ (සද්ධිවිහාරිකාදී) පශ්චිමජනතාව (ඔවුන්ගේ ආචාරය අනුව යෑමය යි කියන ලද) දෘෂ්ටානුගතියට පැමිණේ. ඒ ජනතාව ද බාහුලික වෙයි. සාථලික වෙයි. අවක්‍රමණයෙහි පූර්‍වඞ්ගම වෙයි. ප්‍රවිවෙකයෙහි හළ ධුර ඇති වෙයි. නො පත් ධර්‍මයට පැමිණීම පිණිස නො ලත් ධර්‍මය ලැබීම පිණිස පසක් නොකළ ධර්‍මය පසක් කිරීම පිණිස වැර නො වඩයි. මහණෙනි, මේ අනග්ගවතී පිරිසැ යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, අග්ගවතී පිරිස කවර: මහණෙනි, මෙසස්නෙහි යම් පිරිසෙක ස්ථවිර භික්‍ෂූහු බාහුලික නො වෙත් ද, සාථලික නො වෙත් ද, පඤ්චනීවරණ සඞ්ඛ්‍යාත අවක්‍රමණයෙහි හළ වීර්‍ය්‍යධුර ඇති වෙත් ද, ප්‍රකර්‍ෂ විවෙකයෙහි පෙරටු ව යන්නාහු වෙත් ද, නො පත් ධර්‍මයාගේ පැමිණීම පිණිස, නො ලත් ධර්‍මයාගේ ලැබීම පිණිස, පසක් නො කළ ධර්‍මයාගේ පසක් කිරීම පිණිස වැර වඩත් ද, ඔවුන්ගේ පශ්චිමජනතාව දෘෂ්ටානුගතියට පැමිණේ. ඒ ජනතාවද බාහුලීක නො වේ සාථලික නො වේ අවක්‍රමණයෙහි හළ ධුර ඇති වේ ප්‍රවිවෙකයෙහි පෙරටුව යන්නේ වේ. නො පත් ධර්‍මයාගේ පැමිණීම පිණිස, නො ලත් ධර්‍මයාගේ ලාභය පිණිස, පසක් නො කළ ධර්‍මයාගේ පසක් කිරීම පිණිස, වැර වඩයි. මහණෙනි, මේ අග්ගවතී පිරිසැ යි කියනු ලැබේ. මහණෙනි, මේ පිරිස් දෙකය. මහණෙනි, මේ පිරිස් දෙක අතුරෙන් යම් අග්ගවතී පිරිසෙක් වේ නම්, තෙල අග්‍ර වේ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 4.",
                "level": "1"
            },
            {
                "text": "45. මහණෙනි, මේ පිරිස් දෙකෙකි. කවර දෙකෙක යත්: අනාර්‍ය්‍ය (ශ්‍රාවක) පිරිස හා ආර්‍ය්‍ය (ශ්‍රාවක) පිරිස හා දෙකයි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, අනාර්‍ය්‍ය පිරිස කවර: මහණෙනි, මෙ සස්නෙහි යම් පිරිසෙක භික්‍ෂූහු මේ (තෘෂ්ණාව තබා පඤ්චසකන්‍ධය) දුකැයි තත් වූ පරිදි නො දනිත් ද, මේ (තෘෂ්ණාව) දුඃඛසමුදයයි තත් වූ පරිදි නො දනිත් ද, මේ (තෘෂ්ණාවගේ නැවැත්ම) දුඃඛනිරොධ යයි තත් වූ පරිදි නො දනිත් ද, මේ (අරීඅටඟිමග) දුඃඛනිරොධගමී ප්‍රතිපත්ති යයි තත් වූ පරිදි නො දනිත් ද, මහණෙනි මේ අනාර්‍ය්‍ය පිරිසැ යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "141"
            },
            {
                "text": "මහණෙනි, ආර්‍ය්‍ය පිරිස කවර: මහණෙනි, මෙ සස්නෙහි යම් පිරිසෙක භික්‍ෂූහු මේ දුකැයී තත් වූ පරිදි දනිත් ද, මේ දුඃඛසමුදයයි තත් වූ පරිදි දනිත් ද, මේ දුඃඛනිරොධයයි තත් වූ පරිදි දනිත් ද,මේ දුඃඛනිරොධගමි ප්‍රතිපත්ති යයි තත් වූ පරිදි දනිත් ද, මහණෙනි, මේ ආර්‍ය්‍ය පිරිසැ යි කියනු ලැබේ. මහණෙනි, මේ පිරිස් දෙකයි. මහණෙනි, මේ පිරිස් දෙක අතුරෙන් යම් ආර්‍ය්‍ය පිරිසෙක් වේ නම්, තෙල අගී.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 5.",
                "level": "1"
            },
            {
                "text": "46. මහණෙනි, මේ පිරිස් දෙකෙකි. කවර දෙකෙක යත්: කසළ පිරිස හා නිකසළ පිරිස හා දෙකයි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, කසළ පිරිස කවර: මහණෙනි, මෙසස්නෙහි යම් පිරිසෙක භික්‍ෂූහු ඡන්‍දයෙන් අගතියට යෙත් ද, ද්වෙෂයෙන් අගතියට යෙත් ද, මොහයෙන් අගතියට යෙත් ද, භයින් අගතියට යෙත් ද, මහණෙනි මේ කසළ පිරිසැ යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, නිකසළ පිරිස කවර: මහණෙනි, මෙසස්නෙහි යම් පිරිසෙක භික්‍ෂූහු ඡන්‍දයෙන් අගතියට නො යෙත් ද, ද්වෙෂයෙන් අගතියට නො යෙත් ද, මොහයෙන් අගතියට නො යෙත් ද, භයින් අගතියට නො යෙත් ද, මහණෙනි මේ නිකසළ පිරිසැ යී කියනු ලැබේ. මහණෙනි, මේ පිරිස් දෙකය. මහණෙනි, මේ පිරිස් දෙක අතුරෙන් යම් නිකසළ පිරිසෙක් වේ නම්, තෙල අගී.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 6.",
                "level": "1"
            },
            {
                "text": "47. මහණෙනි, මේ පිරිස් දෙකෙකි. කවර දෙකෙක යත්: අවිනීත වූ පිළිවිස නොහික්මුනු පිරිසය, දුර්විනීත නො වූ පිළිවිස හික්මුනු පිරිසය යන දෙකය.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, අවිනීත වූ පිළිවිස නො හික්මුනු පිරිස කවර: මහණෙනි, මෙ සස්නෙහි යම් පිරිසෙක භික්‍ෂූහු තථාගතයන් වහන්සේ විසින් වදාරණ ලද (පාළි වසයෙන්) ගැඹුරු වූ, ගැඹුරු අරුත් ඇති, ලොකොත්තර අර්ථය ප්‍රකාශ කරණ (සත්ත්‍ව පුදගල) ශුන්‍යතායෙන් යුත් යම් සූත්‍රාන්ත කෙනෙක් වෙත් ද, ඒ සූත්‍රාන්ත දෙසනු ලබන කල්හි ඇසීමට නො කැමැති වෙත්, ඇසීමට කන් රුකොට නොගණිත්, දැන ගැණීමට සිත් නො එළවත්, ඒ ධර්‍මයන් උගත යුතු කොට පුහුණු කළ යුතු කොට නො හඟිත්, කවීන් විසින් කරණ ලද, කවීන්ට හිත වූ, විසිතුරු අකුරු ඇති, විසිතුරු ව්‍යඤ්ජන ඇති, සස්නෙන් බැහිරි වූ, සව්වන් විසින් කියන ලද යම් ඒ සූත්‍රාන්ත කෙනෙක් වෙත් නම්, එය කියත් කියත් ඇසීමට කැමැති වෙත්, කන් රුකොට ගණිත්, ඇසීමට සිත් එළවත්, ඒ ධර්‍මයන් උගත යුතු කොට පුහුණු කළ යුතු කොට හඟිත්. ඔහු ඒ ධර්‍මයන් පුහුණු කොට ඔවුනොවුන් නො ද පිළිවිසිත්. මෙය කෙසේ ය? මෙහි අරුත් කිමැ යි පිළිවිසුමට නො ම සැරිසරත්. ඔහු පිළිසන් අරුත විවර නො කෙරෙත්. අප්‍රකට අර්‍ත්ථය ප්‍රකට නො කෙරෙත්. නන් වැදෑරුම් සැකයට කරුණු වූ ධර්‍මයන් විෂයෙහි සැක දුරු නො කෙරෙත්. මහණෙනි, මේ අවිනීත නො පිළිවිස හික්මුනු පිරිස වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "143"
            },
            {
                "text": "මහණෙනි, පිළිවිස හික්මුනු අවිනීත නො වූ පිරිස කවර: මහණෙනි, මේ සස්නෙහි යම් පිරිසෙක භික්‍ෂූහු කවීන් විසින් කරණ ලද, කවීන්ට හිත වූ, විසිතුරු අකුරු ඇති, විසිතුරු ව්‍යඤ්ජන ඇති, සස්නෙන් බැහිරි වූ ශ්‍රාවකයන් විසින් කියන ලද, යම් ම සූත්‍රාන්ත කෙනෙක් වෙත් නම් ඒ සූත්‍රාන්තයන් කියත් ම එය ඇසීමට කන් නතු නො කෙරෙත්. දැනගැණීමට සිත් නො එළවත්. ඒ ධර්‍මයන් උගත යුතු කොට පුහුණු කළ යුතු කොට නො ද හඟිත්. තථාගතයන් වහන්සේ විසින් දෙසන ලද (පාළිවිසින්) ගැඹුරු වූ, ගැඹුරු අරුත් ඇති, ලොකොත්තර වූ ශුන්‍යතාප්‍රතිසංයුක්ත වූ යම් ම සූත්‍රාන්ත කෙනෙක් වෙත් නම්, ඒ සූත්‍රාන්ත දෙසනු ලබන කල්හි ඇසීමට කැමැති වෙත්. කන් නතු කෙරෙත්. දැනගැණීමට සිත් එළවත්. ඒ ධර්‍මයන් ද උගත යුතු කොට පුහුණු කළ යුතු කොට හඟිත්. ඔහු ඒ ධර්‍මය පුහුණු කොට උනුන් පිළිවිසිත්. මෙය කෙසේ ය? මෙහි අර්ථය කිමැ? යි පිළිවිසීමට සැරිසරත්. ඒ භික්‍ෂූහු නොපිළිසන් වූ අර්ථය විවර කෙරෙත්. අප්‍රකට වූ අර්ථය ද ප්‍රකට කෙරෙත්. නන්වැදෑරුම් සැකයට කරුණු වූ ධර්‍ම විෂයෙහි සැක දුරු කෙරෙත්. මහණෙනි, මේ විනීත වූ පිළිවිස හික්මුනු පිරිසැ යි කියනු ලැබේ. මහණෙනි, මේ වනාහි පිරිස් දෙකය. මහණෙනි, මේ පිරිස් දෙක අතුරෙන් යම් පිළිවිස හික්මුනු විනීත වූ පිරිසෙක් වේ ද, තෙල අගී.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 7.",
                "level": "1"
            },
            {
                "text": "48. මහණෙනි, මේ පිරිස් දෙකෙකි. කවර දෙකෙක යත්: ආමිස (සිවුපස) ගරු කරණ සදහම් ගරු නොකරණ පිරිසය, සදහම් ගරු කරණ ආමිස ගරු නො කරණ පිරිසය යන දෙකය.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, ආමිස ගරු කරණ සදහම් ගරු නො කරණ පිරිස කවර: මහණෙනි, මෙ සස්නෙහි යම් පිරිසෙක භික්‍ෂූහු සුදුවත් හඳනා ගිහියන් පෙරට අසෝ මහණ (සමථවිපස්සනා දෙකින් කෙලෙසුන් කෙරෙන් මිදුනු) උභතොභාගවිමුක්තයෙක, අසෝ මහණ (ශුෂ්කවිදර්ශක ක්‍ෂීණාස්‍රව) ප්‍රඥාවිමුක්තයෙක, අසෝ මහණ (නාමකයින් ධ්‍යානස්පර්‍ශ කොට නිවන් පසක් කළ) කාය සාක්‍ෂියෙක. අසෝ මහණ දෘෂ්ටප්‍රාප්තයෙක. අසෝ මහණ (ශ්‍රද්ධාධුරයෙන් වැද කෙලෙසුන් නැසු බැවින්) ශ්‍රද්ධාවිමුක්තයෙක, අසෝ මහණ (ප්‍රඥාධුරයෙන් වැද සෝවන්මඟ ගන්නා බැවින්) ධර්‍මානුසාරියෙක, අසෝ මහණ (සැදැහැයෙන් වැද සමවන් නොසපයා සොවන් මගට පිළිපන්) ශ්‍රද්ධානුසාරියෙක, අසෝ මහණ කලණ දහම් ඇති සිල්වතෙක, අසෝ මහණ පවිටුදහම් ඇති දුශ්ශීලයෙකැ යි උනුන් ගුණ බෙණෙත් ද, ඔහු එයින් ලාභ ලබත්. ඔහු මැසූනාහු මුසපත්වූවාහු (එහි) ගැලුනාහු ආදීනව නො දක්නාහු නිස්සරණප්‍රඥා නැත්තාහු ඒ ලාභය පරිභොග කෙරෙත්. මහණෙනි, මේ ආමිසය ගරු කරණ සද්ධර්‍මය ගරු නොකරණ පිරිස වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "145"
            },
            {
                "text": "මහණෙනි, සද්ධර්‍මය ගරු කරණ (ආමිෂය) ගරු නොකරණ පිරිස කවර: මහණෙනි, මෙසස්නෙහි යම් පිරිසෙක භික්‍ෂූහු සුදුවත් හඳනා ගිහියන් පෙරට ‘අසෝ මහණ උභතොභාග විමුක්තයෙක, අසෝ මහණ ප්‍රඥාවිමුක්තයෙක, අසෝ මහණ කායසාක්‍ෂියෙක, අසෝ මහණ දෘෂ්ටප්‍රාප්තයෙක, අසෝ මහණ ශ්‍රද්ධාවිමුක්තයෙක, අසෝ මහණ ධර්‍මානුසාරියෙක, අසෝ මහණ ශ්‍රද්ධානුසාරියෙක, අසෝ මහණ කලණදහම් ඇති සිල්වතෙක, අසෝ මහණ පවිටුදහම් ඇති දුශ්ශීලයෙකැ යි උනුන් ගුණ නො බෙණෙත්. ඔහු ලාභ ද ලබා නො මැසූනාහු මුසපත් නො වූවාහු (එහි) නො ගැලුනාහු ආදීනව දක්නාහු නිඃසරණප්‍රඥා ඇත්තාහු පරිභොග කෙරෙත්. මහණෙනි, මේ සද්ධර්‍මය ගරු කරණ ආමිෂය ගරු නො කරණ පිරිසැ යි කියනු ලැබේ. මහණෙනි, මේ පිරිස් දෙකය. මහණෙනි, මේ පිරිස් දෙක අතුරෙන් යම් සද්ධර්‍මය ගරු කරණ ආමිෂය ගරු නො කරණ පිරිසෙක් වේ නම් තෙල අගී.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 8.",
                "level": "1"
            },
            {
                "text": "49. මහණෙනි, මේ පිරිස් දෙකෙකි. කවර දෙකෙක යත්: විෂම පිරිස හා සමපිරිස හා දෙකය.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, විෂම පිරිස කවර: මහණෙනි, මේ සස්නෙහි යම් පිරිසෙක අධර්‍මකර්‍මයෝ පවතිත් ද, ධර්‍මකර්‍මයෝ නො පවතිත් ද, අවිනය කර්‍මයෝ පවතිත් ද, විනයකර්‍මයෝ නො පවතිත් ද, අධර්‍මකර්‍මයෝ දීප්ත වෙත් ද, ධර්‍මකර්‍මයෝ දීප්ත නො වෙත් ද, අවිනයකර්‍මයෝ දීප්ත වෙත් ද, විනයකර්‍මයෝ දීප්ත නො වෙත් ද, මහණෙනි මේ විෂම පිරිසැ යි කියනු ලැබේ. මහණෙනි, පිරිස විෂම බැවින් අධර්‍මකර්‍මයෝ පවතිත්. ධර්‍මකර්‍මයෝ නො පවතිත්. අවිනයකර්‍මයෝ පවතිත්. විනයකර්‍මයෝ නො පවතිත්. අධර්‍මකර්‍මයෝ දීප්ත වෙත්. ධර්‍මකර්‍මයෝ දීප්ත නො වෙත්. අවිනයකර්‍මයෝ දීප්ත වෙත්. විනයකර්‍මයෝ දීප්ත නො වෙත්. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, සමපිරිස කවර: මහණෙනි, මේ සස්නෙහි යම් පිරිසෙක ධර්‍මකර්‍මයෝ පවතිත් ද, අධර්‍මකර්‍මයෝ නො පවතිත් ද, විනයකර්‍මයෝ පවතිත් ද, අවිනයකර්‍මයෝ නො පවතිත් ද, ධර්‍මකර්‍මයෝ දීප්ත වෙත් ද, අධර්‍මකර්‍මයෝ දීප්ත නො වෙත් ද, විනයකර්‍මයෝ දීප්ත වෙත් ද, අවිනයකර්‍මයෝ දීප්ත නො වෙත් ද, මහණෙනි, මේ සමපිරිසැ යි කියනු ලැබේ. මහණෙනි, පිරිස සම බැවින් ධර්‍මකර්‍මයෝ පවතිත්. අධර්‍මකර්‍මයෝ නො පවතිත්. විනයකර්‍මයෝ පවතිත්. අවිනයකර්‍මයෝ නො පවතිත්. ධර්‍මකර්‍මයෝ දීප්ත වෙත්. අධර්‍මකර්‍මයෝ දීප්ත නො වෙත්. විනයකර්‍මයෝ දීප්ත වෙත්. අවිනයකර්‍මයෝ දීප්ත නො වෙත්. මහණෙනි, මේ වනාහි පිරිස් දෙකය. මහණෙනි, මේ පිරිස් දෙක අතුරෙන් යම් සම පිරිසෙක් වේ ද, තෙල අග්‍ර වේ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 9.",
                "level": "1"
            },
            {
                "text": "50. මහණෙනි, මේ පිරිස් දෙකෙකි. කවර දෙකෙක යත්: අධාර්මික පිරිස හා ධාර්මික පිරිස හා දෙකය. ... මහණෙනි, මේ වනාහි පිරිස් දෙකය. මහණෙනි, මේ පිරිස්දෙක අතුරෙන් යම් මේ ධාර්මික පිරිසෙක් වේ ද, තෙල අග්‍ර වේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "147"
            },
            {
                "type": "heading",
                "text": "2. 1. 5. 10.",
                "level": "1"
            },
            {
                "text": "51. මහණෙනි, මේ පිරිස් දෙකෙකි. කවර දෙකෙක යත්: අධර්‍මවාදී පිරිස හා ධර්‍මවාදී පිරිස හා දෙකය.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, අධර්‍මවාදී පිරිස කවර: මහණෙනි, මේ සස්නෙහි යම් පිරිසෙක භික්‍ෂූහු දැහැමි වූ හෝ නො දැහැමි වූ අධිකරණයක් ගණිත් ද, ඔහු ඒ අධිකරණය ගෙණ උනුන් නො ද හඟවත්. හැඟවීමට නො ද එළඹෙත්. නො ද දක්වත්. දැක්වීමට නො ද එළඹෙත්. නො ඇඟවීම බලය කොට ඇති, නො දැක්වීම බලය කොට ඇති ඔහු (අයුක්ති) දුරලීමට මන්ත්‍රණ නොකරන්නාහු එම අධිකරණ (දෘෂ්ටි) ශක්තියෙන් පරාමර්ශ කොට එයට වැදගෙන ‘මෙය ම සත්‍යය, සෙස්ස තූචඡ’ යි ව්‍යවහාර කෙරෙත් ද, මහණෙනි, මේ අධර්‍මවාදී පිරිස යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, ධර්‍මවාදී පිරිස කවර: මහණෙනි, මෙසස්නෙහි යම් පිරිසෙක භික්‍ෂූහු දැහැමි හෝ නො දැහැමි අධිකරණයක් ගණිත් ද, ඔහු ඒ අධිකරණය ගෙණ උනුන් ද හඟවත්. හැඟවීමට ද එළඹෙත්. උනුන් දක්වත්. දැක්වීමට ද එළඹෙත්. හැඟවීම බලය කොට ඇති, දැක්වීම බලය කොට ඇති (අධර්‍මය) දුරලීමට ම මන්ත්‍රණය කරණ සුලු ඔහු එම අධිකරණය ‘මෙය ම සත්‍යය, සෙස්ස තූච්ඡ’ යි (දෘෂ්ටි) ශක්තියෙන් පරාමර්‍ශ කොට එයට පිවිස ව්‍යවහාර නො කෙරෙත් ද, මහණෙනි, මේ වනාහි ධර්‍මවාදී පිරිසැ යි කියනු ලැබේ. මහණෙනි, මේ පිරිස් දෙකය. මහණෙනි, මේ පිරිස් දෙක අතුරෙන් යම් ධර්‍මවාදී පිරිසෙක් වේ නම් තෙල අග්‍ර වේ.",
                "type": "paragraph"
            },
            {
                "text": "පස්වන පිරිස් වග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි උද්දානය:**",
                "type": "unindented"
            },
            {
                "text": "උත්තාන, වග්ග, අග්ගවතී, අරියසූත්‍රය හා පස්වැනි කසට සූත්‍රය ද, උක්කාචිත, ආමිස, විසම, අධම්ම, ධම්මිය සූත්‍රය ද යන මොහු (දශසූත්‍රයෝ) යි.",
                "type": "paragraph"
            },
            {
                "text": "ප්‍රථම පණ්ණාසකය සමාප්ත යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-2-5"
    }
]