[
    {
        "filename": "an-2-4",
        "bookId": 22,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": 120
            },
            {
                "type": "heading",
                "text": "4. සමචිත්තවග්ගො",
                "level": 3
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 1.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "**[සාවත්ථිනිදානං:]**"
            },
            {
                "type": "paragraph",
                "text": "32. අසප්පුරිසභූමිඤ්ච වො භික්ඛවෙ දෙසිස්සාමි{4 දෙසෙස්සාමි - මඡසං. ස්යා. සී. 1.} සප්පුරිසභූමිඤ්ච. තං සුණාථ, සාධුකං මනසි කරොථ, භාසිස්සාමීති. එවම්භන්තෙති ඛො තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච :"
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ අසප්පුරිසභූමි? අසප්පුරිසො භික්ඛවෙ අකතඤ්ඤූ හොති අකතවෙදී. අසබ්භිහෙතං භික්ඛවෙ උපඤ්ඤාතං යදිදං අකතඤ්ඤුතා අකතවෙදිතා. කෙවලා එසා භික්ඛවෙ අසප්පුරිසභූමි යදිදං අකතඤ්ඤුතා අකතවෙදිතා."
            },
            {
                "type": "page-break",
                "text": "122"
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ සප්පුරිසභූමි? සප්පුරිසො ච ඛො භික්ඛවෙ කතඤ්ඤූ හොති කතවෙදී. සබ්භිහෙතං භික්ඛවෙ උපඤ්ඤාතං යදිදං කතඤ්ඤුතා කතවෙදිතා. කෙවලා එසා භික්ඛවෙ සප්පුරිසභූමි යදිදං කතඤ්ඤුතා කතවෙදිතාති."
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 2.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "33. ද්වින්නාහං භික්ඛවෙ න සුප්පතිකාරං වදාමි,* මාතුච්ච පිතුච්ච{1 මාතු ච, පිතු ච - මඡසං. ස්යා. * කතමෙසං ද්වින්නං - මඡසං. PTS. ස්යා.} එකෙන භික්ඛවෙ අංසෙන මාතරං පරිහරෙය්ය, එකෙන අංසෙන පිතරං පරිහරෙය්ය වස්සසතායුකො වස්සසතජීවී. සො ච නෙසං උච්ඡාදනපරිමද්දනනහාපනසම්බාහනෙන, තෙපි තත්ථෙව මුත්තකරීසං චජෙය්යුං. නත්වෙව භික්ඛවෙ මාතාපිතුන්නං කතං වා හොති, පතිකතං{2 පටිකතං වා - මඡසං. ස්යා.} වා."
            },
            {
                "type": "paragraph",
                "text": "ඉමිස්සා ච භික්ඛවෙ මහාපඨවියා පහූතසත්තරතනාය{3 පහූතරත්තරතනාය - මඡසං.} මාතාපිතරො ඉස්සරාධිපච්චෙ රජ්ජෙ පතිට්ඨාපෙය්ය, නත්වෙව භික්ඛවෙ මාතාපිතුන්නං කතං වා හොති, පතිකතං{4 පටිකතං වා - මඡසං. ස්යා. + අයං පාඨො ස්යාමමරම්ම පොත්ථකෙ න දිස්සතෙ.} වා. තං කිස්ස හෙතු: බහුකාරා භික්ඛවෙ මාතාපිතරො පුත්තානං ආපාදකා පොසකා, ඉමස්ස ලොකස්ස දස්සෙතාරො."
            },
            {
                "type": "paragraph",
                "text": "යො ච ඛො භික්ඛවෙ මාතාපිතරො අස්සද්ධෙ සද්ධාසම්පදාය සමාදපෙති, නිවෙසෙති, පතිට්ඨාපෙති, දුස්සීලෙ සීලසම්පදාය සමාදපෙති, නිවෙසෙති, පතිට්ඨාපෙති, මච්ඡරී චාගසම්පදාය සමාදපෙති, නිවෙසෙති, පතිට්ඨාපෙති, දුප්පඤ්ඤෙ පඤ්ඤාසම්පදාය සමාදපෙති, නිවෙසෙති, පතිට්ඨාපෙති, එත්තාවතා ඛො භික්ඛවෙ මාතාපිතුන්නං කතඤ්ච හොති පතිකතඤ්ච අතිකතඤ්චාති +"
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 3.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "34. අථ ඛො අඤ්ඤතරො බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි -පෙ- එකමන්තං නිසින්නො ඛො සො බ්රාහ්මණො භගවන්තං එතදවොච : කිංවාදී භවං ගොතමො කිමක්ඛායීති?"
            },
            {
                "type": "unindented",
                "text": "**[භගවා:]**"
            },
            {
                "type": "paragraph",
                "text": "කිරියවාදී චාහං බ්රාහ්මණ අකිරියවාදී චාති."
            },
            {
                "type": "unindented",
                "text": "**[බ්රාහ්මණො:]**"
            },
            {
                "type": "paragraph",
                "text": "යථාකථං පන භවං ගොතමො කිරියවාදී ච අකිරියවාදී චාති?"
            },
            {
                "type": "unindented",
                "text": "**[භගවා:]**"
            },
            {
                "type": "paragraph",
                "text": "අකිරියං ඛො අහං බ්රාහ්මණ වදාමි කායදුච්චරිතස්ස වචීදුච්චරිතස්ස මනොදුච්චරිතස්ස, අනෙකවිහිතානං පාපකානං අකුසලානං ධම්මානං අකිරියං වදාමි. කිරියඤ්ච ඛො අහං බ්රාහ්මණ වදාමි කායසුචරිතස්ස වචීසුචරිතස්ස මනොසුචරිතස්ස, අනෙකවිහිතානං කුසලානං ධම්මානං කිරියං වදාමි. එවං ඛො අහං බ්රාහ්මණ කිරියවාදී ච අකිරියවාදී චාති."
            },
            {
                "type": "page-break",
                "text": "124"
            },
            {
                "type": "unindented",
                "text": "**[බ්රාහ්මණො:]**"
            },
            {
                "type": "paragraph",
                "text": "අභික්කන්තං භො ගොතම -පෙ- උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 4",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "35. අථ ඛො අනාථපිණ්ඩිකො ගහපති යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො අනාථපිණ්ඩිකො ගහපති භගවන්තං එතදවොච: කති නු ඛො භන්තෙ ලොකෙ දක්ඛිණෙය්යා? කත්ථ ච දානං දාතබ්බන්ති?"
            },
            {
                "type": "paragraph",
                "text": "ද්වෙ ඛො ගහපති ලොකෙ දක්ඛිණෙය්යා සෙඛො ච අසෙඛො ච. ඉමෙ ඛො ගහපති ද්වෙ ලොකෙ දක්ඛිණෙය්යා. එත්ථ ච දානං දාතබ්බන්ති, ඉදමවොච භගවා. ඉදං වත්වා{1 ඉදං වත්වාන - මඡසං.} සුගතො අථාපරං එතදවොච සත්ථා:"
            },
            {
                "type": "gatha",
                "text": "සෙඛො අසෙඛො ච ඉමස්මිං ලොකෙ\nආහුණෙය්යා යජමානානං හොන්ති,\nතෙ උජ්ජුභූතා කායෙන වාචාය උද චෙතසා\nඛෙත්තං තං යජමානානං එත්ථ දින්නං මහප්ඵලන්ති.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 5",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "36. එවං මෙ සුතං; එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තෙන ඛො පන සමයෙන ආයස්මා සාරිපුත්තො සාවත්ථියං විහරති පුබ්බාරාමෙ මිගාරමාතුපාසාදෙ. තත්ර ඛො ආයස්මා සාරිපුත්තො භික්ඛූ ආමන්තෙසි, ආවුසො භික්ඛවොති.{2 භික්ඛවෙති - මඡසං.} ආවුසොති ඛො තෙ භික්ඛූ ආයස්මතො සාරිපුත්තස්ස පච්චස්සොසුං. ආයස්මා සාරිපුත්තො එතදවොච."
            },
            {
                "type": "paragraph",
                "text": "අජ්ඣත්තසඤ්ඤොජනඤ්ච ආවුසො පුග්ගලං දෙසිස්සාමි බහිද්ධාසඤ්ඤොජනඤ්ච. තං සුණාථ සාධුකං මනසි කරොථ. භාසිස්සාමීති. එවමාවුසොති ඛො තෙ භික්ඛූ ආයස්මතො සාරිපුත්තස්ස පච්චස්සොසුං. ආයස්මා සාරිපුත්තො එතදවොච."
            },
            {
                "type": "paragraph",
                "text": "කතමො චාවුසො අජ්ඣත්තසඤ්ඤොජනො පුග්ගලො? ඉධාවුසො භික්ඛු සීලවා හොති පාතිමොක්ඛසංවරසංවුතො විහරති ආචාරගොචරසම්පන්නො අණුමත්තෙසු වජ්ජෙසු භයදස්සාවී සමාදාය සික්ඛති සික්ඛාපදෙසු. සො කායස්ස භෙදා පරම්මරණා අඤ්ඤතරං දෙවනිකායං උපපජ්ජති. සො තතො චුතො ආගාමී හොති ආගන්තා ඉත්ථත්තං. අයං වුච්චතාවුසො අජ්ඣත්තසඤ්ඤොජනො පුග්ගලො ආගාමී ආගන්තා ඉත්ථත්තං."
            },
            {
                "type": "page-break",
                "text": "126"
            },
            {
                "type": "paragraph",
                "text": "කතමො චාවුසො බහිද්ධාසඤ්ඤොජනො පුග්ගලො? ඉධාවුසො භික්ඛු සීලවා හොති. පාතිමොක්ඛසංවරසංවුතො විහරති ආචාරගොචරසම්පන්නො අණුමත්තෙසු වජ්ජෙසු භයදස්සාවී. සමාදාය සික්ඛති සික්ඛාපදෙසු. සො අඤ්ඤතරං සන්තං චෙතොවිමුත්තිං උපසම්පජ්ජ විහරති. සො කායස්ස භෙදා පරම්මරණා අඤ්ඤතරං දෙවනිකායං උපපජ්ජති. සො තතො චුතො අනාගාමී හොති. අනාගන්තා ඉත්ථත්තං. අයං වුච්චතාවුසො බහිද්ධාසඤ්ඤොජනො පුග්ගලො අනාගාමී{1 අනාගාමී හොති - මඡසං.} අනාගන්තා ඉත්ථත්තං."
            },
            {
                "type": "paragraph",
                "text": "පුනචපරං ආවුසො භික්ඛු සීලවා හොති -පෙ- සමාදාය සික්ඛති සික්ඛාපදෙසු. සො කාමානං යෙව නිබ්බිදාය විරාගාය නිරොධාය පටිපන්නො හොති. සො භවානං යෙව නිබ්බිදාය විරාගාය නිරොධාය පටිපන්නො හොති. සො තණ්හක්ඛයාය{2 තණ්හාක්ඛයාය - මඡසං.} පටිපන්නො හොති. සො ලොභක්ඛයාය පටිපන්නො හොති. සො කායස්ස භෙදා පරම්මරණා අඤ්ඤතරං දෙවනිකායං උපපජ්ජති. සො තතො චුතො අනාගාමී හොති. අනාගන්තා ඉත්ථත්තං. අයං වුච්චතාවුසො බහිද්ධාසඤ්ඤොජනො පුග්ගලො අනාගාමී අනාගන්තා ඉත්ථත්තන්ති."
            },
            {
                "type": "paragraph",
                "text": "අථඛො සම්බහුලා සමචිත්තා දෙවතා යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං අට්ඨංසු. එකමන්තං ඨිතා ඛො තා දෙවතා භගවන්තං එතදවොචුං:"
            },
            {
                "type": "paragraph",
                "text": "එසො භන්තෙ ආයස්මා සාරිපුත්තො පුබ්බාරාමෙ මිගාරමාතුපාසාදෙ භික්ඛූනං අජ්ඣත්තසඤ්ඤොජනඤ්ච පුග්ගලං දෙසෙති, බහිද්ධාසඤ්ඤොජනඤ්ච. හට්ඨා භන්තෙ පරිසා. සාධු භන්තෙ භගවා යෙනායස්මා සාරිපුත්තො තෙනුපසඞ්කමතු, අනුකම්පං උපාදායාති. අධිවාසෙසි භගවා තුණ්හීභාවෙන."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා සෙය්යථාපි නාම බලවා පුරිසො සම්මිඤ්ජිතං{3 සමිඤ්ජිතං - මඡසං.} වා බාහං පසාරෙය්ය පසාරිතං වා බාහං සම්මිඤ්ජෙය්ය එවමෙව ජෙතවනෙ අන්තරහිතො පුබ්බාරාමෙ මිගාරමාතුපාසාදෙ ආයස්මතො සාරිපුත්තස්ස පමුඛෙ පාතුරහොසි. නිසීදි භගවා පඤ්ඤත්තෙ ආසනෙ. ආයස්මාපි ඛො සාරිපුත්තො භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො ආයස්මන්තං සාරිපුත්තං භගවා එතදවොච :"
            },
            {
                "type": "page-break",
                "text": "128"
            },
            {
                "type": "paragraph",
                "text": "ඉධ සාරිපුත්ත සම්බහුලා සමචිත්තා දෙවතා යෙනාහං තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා මං අභිවාදෙත්වා එකමන්තං අට්ඨංසු. එකමන්තං ඨිතා ඛො සාරිපුත්ත තා දෙවතා මං එතදවොචුං:"
            },
            {
                "type": "paragraph",
                "text": "එසො භන්තෙ ආයස්මා සාරිපුත්තො පුබ්බාරාමෙ මිගාරමාතුපාසාදෙ, භික්ඛූනං අජ්ඣත්තසඤ්ඤොජනඤ්ච පුග්ගලං දෙසෙති බහිද්ධාසඤ්ඤොජනඤ්ච. ‘‘හට්ඨා භන්තෙ පරිසා. සාධු භන්තෙ භගවා යෙනායස්මා සාරිපුත්තො තෙනුපසඞ්කමතු අනුකම්පං උපාදායා”ති. තා ඛො පන සාරිපුත්ත දෙවතා දසපි හුත්වා වීසම්පි{1 වීසතිම්පි - කත්ථචි.} හුත්වා තිංසම්පි හුත්වා චත්තාරීසම්පි හුත්වා පඤ්ඤාසම්පි හුත්වා සට්ඨිම්පි හුත්වා ආරග්ගකොටිනිත්තුද්දනමත්තෙපි{2 ආරග්ගකොටිනිතුදනමත්තෙපි - මඡසං.} තිට්ඨන්ති න ච අඤ්ඤමඤ්ඤං ව්යාබාධෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "සියා ඛො{3 සියා ඛො පන සාරිපුත්ත - මඡසං. * එවං මෙ සුතං - මඡසං.} පන තෙ සාරිපුත්ත එවමස්ස. තත්ථ නූන තාසං දෙවතානං තථා චිත්තං භාවිතං යෙන තා දෙවතා දසපි හුත්වා වීසම්පි{4 වීසතිම්පි - කත්ථචි.} හුත්වා තිංසම්පි හුත්වා චත්තාරීසම්පි හුත්වා පඤ්ඤාසම්පි හුත්වා සට්ඨිම්පි හුත්වා ආරග්ගකොටිනිත්තුද්දනමත්තෙපි{5 ආරග්ගකොටිනිතුදනමත්තෙපි - මඡසං.} තිට්ඨන්ති න ච අඤ්ඤමඤ්ඤං ව්යාබාධෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "න ඛො පනෙතං සාරිපුත්ත එවං දට්ඨබ්බං. ඉධෙව සාරිපුත්ත තාසං දෙවතානං තථා චිත්තං භාවිතං යෙන තා දෙවතා දසපි හුත්වා වීසම්පි{6 වීසතිම්පි - කත්ථචි.} හුත්වා තිංසම්පි හුත්වා චත්තාරීසම්පි හුත්වා පඤ්ඤාසම්පි හුත්වා සට්ඨිම්පි හුත්වා ආරග්ගකොටිනිත්තුද්දන{7 ආරග්ගකොටිනිතුදනමත්තෙපි - මඡසං.} මත්තෙපි තිට්ඨන්ති. න ච අඤ්ඤමඤ්ඤං ව්යාබාධෙන්තීති."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ සාරිපුත්ත එවං සික්ඛිතබ්බං : සන්තින්ද්රියා භවිස්සාම සන්තමානසාති. එවං හි වො සාරිපුත්ත සික්ඛිතබ්බං. සන්තින්ද්රියානංහි වො සාරිපුත්ත සන්තමානසානං සන්තං යෙව උපහාරං උපහරිස්සාම සබ්රහ්මචාරීසූති. එවං හි වො සාරිපුත්ත සික්ඛිතබ්බං."
            },
            {
                "type": "paragraph",
                "text": "අනස්සුං ඛො සාරිපුත්ත අඤ්ඤතිත්ථියා පරිබ්බාජකා යෙ ඉමං ධම්මපරියායං න අස්සොසුන්ති."
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 6.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "37. * එකං සමයං ආයස්මා මහාකච්චානො වරණායං විහරති කද්දමදහතීරෙ. අථ ඛො ආරාමදණ්ඩො බ්රාහ්මණො යෙනායස්මා මහාකච්චානො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මතා මහාකච්චානෙන සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං{8 සාරණීයං - මඡසං.} වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආරාමදණ්ඩො බ්රාහ්මණො ආයස්මන්තං මහාකච්චානං එතදවොච :"
            },
            {
                "type": "paragraph",
                "text": "කො නු ඛො භො කච්චාන, හෙතු, කො පච්චයො යෙන ඛත්තියාපි ඛත්තියෙහි විවදන්ති, බ්රාහ්මණාපි බ්රාහ්මණෙහි විවදන්ති, ගහපතිකාපි ගහපතිකෙහි විවදන්තීති?"
            },
            {
                "type": "page-break",
                "text": "130"
            },
            {
                "type": "unindented",
                "text": "**[මහාකච්චානො:]**"
            },
            {
                "type": "paragraph",
                "text": "කාමරාගවිනිවෙසවිනිබන්ධ{1 කාමරාගාභිනිවෙස විනිබද්ධ - මඡසං.}පලිගෙධපරියුට්ඨානජ්ඣොසානහෙතු ඛො බ්රාහ්මණ, ඛත්තියාපි ඛත්තියෙහි විවදන්ති, බ්රාහ්මණාපි බ්රාහ්මණෙහි විවදන්ති, ගහපතිකාපි ගහපතිකෙහි විවදන්තීති."
            },
            {
                "type": "unindented",
                "text": "**[ආරාමදණ්ඩො:]**"
            },
            {
                "type": "paragraph",
                "text": "කො පන භො කච්චාන, හෙතු කො පච්චයො යෙන සමණාපි සමණෙහි විවදන්තීති?"
            },
            {
                "type": "unindented",
                "text": "**[මහාකච්චානො:]**"
            },
            {
                "type": "paragraph",
                "text": "දිට්ඨිරාගවිනිවෙසවිනිබන්ධ{2 දිට්ඨිරාගාභිනිවෙස විනිබද්ධ - මඡසං.}පලිගෙධපරියුට්ඨානජ්ඣොසානහෙතු ඛො බ්රාහ්මණ, සමණාපි සමණෙහි විවදන්තීති."
            },
            {
                "type": "unindented",
                "text": "**[ආරාමදණ්ඩො:]**"
            },
            {
                "type": "paragraph",
                "text": "අත්ථි පන භො කච්චාන, කොචි ලොකස්මිං යො ඉමං චෙව කාමරාගවිනිවෙසවිනිබන්ධපලිගෙධපරියුට්ඨානජ්ඣොසානං සමතික්කන්තො, ඉමං ච දිට්ඨිරාගවිනිවෙස{3 දිට්ඨිරාගාභිනිවෙස විනිබද්ධ - මඡසං.}විනිබන්ධපලිගෙධපරියුට්ඨානජ්ඣොසානං සමතික්කන්තොති?"
            },
            {
                "type": "unindented",
                "text": "**[මහාකච්චානො:]**"
            },
            {
                "type": "paragraph",
                "text": "අත්ථි බ්රාහ්මණ ලොකස්මිං යො ඉමඤ්චෙව කාමරාගවිනිවෙසවිනිබන්ධපලිගෙධපරියුට්ඨානජ්ඣොසානං සමතික්කන්තො, ඉමඤ්චදිට්ඨිරාගවිනිවෙස{4 දිට්ඨිරාගාභිනිවෙස විනිබද්ධ - මඡසං.(මහාකච්චානො:)}විනිබන්ධපලිගෙධපරියුට්ඨානජ්ඣොසානං සමතික්කන්තොති."
            },
            {
                "type": "unindented",
                "text": "**[ආරාමදණ්ඩො:]**"
            },
            {
                "type": "paragraph",
                "text": "කො පන සො භො කච්චාන, ලොකස්මිං යො ඉමඤ්චෙව කාමගරාගවිනිවෙසවිනිබන්ධපලිගෙධපරියුට්ඨානජ්ඣොසානං සමතික්කන්තො, ඉමඤ්ච දිට්ඨිරාගවිනිවෙසවිනිබන්ධපලිගෙධපරියුට්ඨානජ්ඣොසානං සමතික්කන්තොති?"
            },
            {
                "type": "unindented",
                "text": "**[මහාකච්චානො:]**"
            },
            {
                "type": "paragraph",
                "text": "අත්ථි බ්රාහ්මණ, පුරත්ථිමෙසු ජනපදෙසු සාවත්ථී නාම නගරං. තත්ථ සො භගවා එතරහි විහරති අරහං සම්මාසම්බුද්ධො. සො හි බ්රාහ්මණ, භගවා ඉමඤ්චෙව කාමරාගවිනිවෙසවිනිබන්ධපලිගෙධපරියුට්ඨානජ්ඣොසානං සමතික්කන්තො, ඉමඤ්ච දිට්ඨිරාගවිනිවෙසවිනිබන්ධපලිගෙධපරියුට්ඨානජ්ඣොසානං සමතික්කන්තොති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ ආරාමදණ්ඩො බ්රාහ්මණො උට්ඨායාසනා එකංසං උත්තරාසඞ්ගං කරිත්වා දක්ඛිණං ජාණුමණ්ඩලං පුථුවියං{5 පථවියං - කත්ථචි.} නිහන්ත්වා යෙන භගවා තෙනඤ්ජලිං පණාමෙත්වා තික්ඛත්තුං උදානං උදානෙසි : නමො තස්ස භගවතො අරහතො සම්මාසම්බුද්ධස්ස, නමො තස්ස භගවතො අරහතො සම්මාසම්බුද්ධස්ස -පෙ- යො හි සො භගවා ඉමඤ්චෙව කාමරාග{6 දිට්ඨිරාගාභිනිවෙස විනිබද්ධ - මඡසං.}විනිවෙසවිනිබන්ධ පලිගෙධ පරියුට්ඨානජ්ඣොසානං සමතික්කන්තො, ඉමඤ්ච දිට්ඨිරාග{7 දිට්ඨිරාගාභිනිවෙස විනිබද්ධ - මඡසං.}විනිවෙසවිනිබන්ධ පලිගෙධ පරියුට්ඨානජ්ඣොසානං සමතික්කන්තොති."
            },
            {
                "type": "page-break",
                "text": "132"
            },
            {
                "type": "paragraph",
                "text": "අභික්කන්තං භො කච්චාන -පෙ- සෙය්යථාපි භො කච්චාන නික්කුජ්ජිතං වා උක්කුජ්ජෙය්ය, පටිච්ඡන්නං වා විවරෙය්ය, මූළ්හස්ස වා මග්ගං ආචික්ඛෙය්ය, අන්ධකාරෙ වා තෙලපජ්ජොතං ධාරෙය්ය චක්ඛුමන්තො රූපානි දක්ඛින්තීති,{1 දක්ඛන්තීති - මඡසං.} එවමෙවං භොතා කච්චානෙන අනෙකපරියායෙන ධම්මො පකාසිතො. එසාහං භො කච්චාන තං භගවන්තං ගොතමං සරණං ගච්ඡාමි ධම්මඤ්ච භික්ඛුසඞ්ඝඤ්ච. උපාසකං මං භවං කච්චානො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 7.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "38. එකං සමයං ආයස්මා මහාකච්චානො මධුරායං විහරති ගුන්දාවනෙ. අථ ඛො කණ්ඩරායණො{2 කන්දරායනො - මඡසං. * න ථෙරොත්ථෙව - මඡසං.} බ්රාහ්මණො යෙනායස්මා මහාකච්චානො, තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මතා මහාකච්චානෙන සද්ධිං -පෙ- එකමන්තං නිසින්නො ඛො කණ්ඩරායණො{3 කන්දරායනො - මඡසං.} බ්රාහ්මණො ආයස්මන්තං මහාකච්චානං එතදවොච :"
            },
            {
                "type": "paragraph",
                "text": "සුතං මෙතං භො කච්චාන, න සමණො කච්චානො බ්රාහ්මණෙ ජිණ්ණෙ වුද්ධෙ මහල්ලකෙ අද්ධගතෙ වයො අනුප්පත්තෙ අභිවාදෙති වා පච්චුට්ඨෙති වා ආසනෙන වා නිමන්තෙතීති. තයිදං භො කච්චාන, තථෙව, නහි භවං කච්චානො බ්රාහ්මණෙ ජිණ්ණෙ වුද්ධෙ මහල්ලකෙ අද්ධගතෙ වයො අනුප්පත්තෙ අභිවාදෙති වා පච්චුට්ඨෙති වා ආසනෙන වා නිමන්තෙති. තයිදං භො කච්චාන න සම්පන්නමෙවාති."
            },
            {
                "type": "paragraph",
                "text": "අත්ථි බ්රාහ්මණ, තෙන භගවතා ජානතා පස්සතා අරහතා සම්මාසම්බුද්ධෙන වුද්ධභූමි ච අක්ඛාතා දහරභූමි ච. වුද්ධො චෙපි බ්රාහ්මණ හොති ආසීතිකො වා නාවුතිකො වා වස්සසතිකො වා ජාතියා, සො ච කාමෙ පරිභුඤ්ජති, කාමමජ්ඣාවසති, කාමපරිළාහෙන පරිඩය්හති, කාමවිතක්කෙහි ඛජ්ජති, කාමපරියෙසනාය උස්සුක්කො. අථ ඛො සො බාලො* ත්ථෙව සඞ්ඛං ගච්ඡති. දහරො චෙපි බ්රාහ්මණ, හොති යුවා සුසුකාලකෙසො භද්රෙන යොබ්බනෙන සමන්නාගතො පඨමෙන වයසා. සො ච න කාමෙ පරිභුඤ්ජති, න කාමමජ්ඣාවසති, න කාමපරිළාහෙන පරිඩය්හති, න කාමවිතක්කෙහි ඛජ්ජති, න කාමපරියෙසනාය උස්සුක්කො. අථ ඛො සො පණ්ඩිතො ථෙරොත්වෙව සඞ්ඛං ගච්ඡතීති. "
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ කණ්ඩරායණො බ්රාහ්මණො උට්ඨායාසනා එකංසං උත්තරාසඞ්ගං කරිත්වා දහරානං සුදං භික්ඛූනං පාදෙ සිරසා වන්දති : වුද්ධා භවන්තො වුද්ධභූමියං ඨිතා. දහරා මයං දහරභූමියං ඨිතාති. අභික්කන්තං භො කච්චාන -පෙ- උපාසකං මං භවං කච්චානො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
            },
            {
                "type": "page-break",
                "text": "134"
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 8.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**[සාවත්ථිනිදානං:]**"
            },
            {
                "type": "paragraph",
                "text": "39. යස්මිං භික්ඛවෙ සමයෙ චොරා බලවන්තො හොන්ති, රාජානො තස්මිං සමයෙ දුබ්බලා හොන්ති. තස්මිං භික්ඛවෙ සමයෙ රඤ්ඤො න ඵාසු හොති අතියාතුං වා නීයාතුං වා පච්චන්තිමෙ වා ජනපදෙ අනුසඤ්ඤාතුං. බ්රාහ්මණගහපතිකානම්පි තස්මිං සමයෙ න ඵාසු හොති අතියාතුං වා නීයාතුං වා බාහිරානි වා කම්මන්තානි පටිවෙක්ඛිතුං. එවමෙව ඛො භික්ඛවෙ යස්මිං සමයෙ පාපභික්ඛූ බලවන්තො හොන්ති, පෙසලා භික්ඛූ තස්මිං සමයෙ දුබ්බලා හොන්ති. තස්මිං භික්ඛවෙ සමයෙ පෙසලා භික්ඛූ තුණ්හීභූතා තුණ්හීභූතා සඞ්ඝමජ්ඣෙ සංකසායන්ති{1 සඤ්ඣායන්ති, අට්ඨකථා - සංකායන්ති - කත්ථචි.} පච්චන්තිමෙ වා ජනපදෙ භජන්ති. තයිදං භික්ඛවෙ හොති බහුජනාහිතාය බහුජනාසුඛාය බහුනො ජනස්ස අනත්ථාය අහිතාය දුක්ඛාය දෙවමනුස්සානං."
            },
            {
                "type": "paragraph",
                "text": "යස්මිං භික්ඛවෙ සමයෙ රාජානො බලවන්තො හොන්ති, චොරා තස්මිං සමයෙ දුබ්බලා හොන්ති. තස්මිං භික්ඛවෙ සමයෙ රඤ්ඤො ඵාසු හොති අතියාතුං වා නීයාතුං වා, පච්චන්තිමෙ වා ජනපදෙ අනුසඤ්ඤාතුං. බ්රාහ්මණගහපතිකානම්පි තස්මිං සමයෙ ඵාසු හොති අතියාතුං වා නීයාතුං වා, බාහිරානි වා කම්මන්තානි පටිවෙක්ඛිතුං. එවමෙවං ඛො භික්ඛවෙ යස්මිං සමයෙ පෙසලා භික්ඛූ බලවන්තො හොන්ති, පාපභික්ඛූ තස්මිං සමයෙ දුබ්බලා හොන්ති. තස්මිං භික්ඛවෙ සමයෙ පාපභික්ඛූ තුණ්හීභූතා තුණ්හීභූතා සඞ්ඝමජ්ඣෙ සංකසායන්ති, යෙන වා පන තෙන පපතන්ති.{2 පක්කමන්ති - මඡසං.} තයිදං භික්ඛවෙ හොති බහුජනහිතාය බහුජනසුඛාය බහුනො ජනස්ස අත්ථාය හිතාය සුඛාය දෙවමනුස්සානන්ති."
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 9.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "40. ද්වින්නාහං භික්ඛවෙ මිච්ඡාපටිපත්තිං න වණ්ණෙමි, ගිහිස්ස වා පබ්බජිතස්ස වා. ගිහී වා භික්ඛවෙ පබ්බජිතො වා මිච්ඡාපටිපන්නො මිච්ඡාපටිපත්තාධිකරණහෙතු නාරාධකො හොති ඤායං ධම්මං කුසලං."
            },
            {
                "type": "paragraph",
                "text": "ද්වින්නාහං භික්ඛවෙ සම්මාපටිපත්තිං වණ්ණෙමි, ගිහිස්ස වා පබ්බජිතස්ස වා. ගිහී වා භික්ඛවෙ පබ්බජිතො වා සම්මාපටිපන්නො සම්මාපටිපත්තාධිකරණහෙතු ආරාධකො හොති ඤායං ධම්මං කුසලන්ති."
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 10.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "41. යෙ තෙ භික්ඛවෙ භික්ඛූ දුග්ගහිතෙහි සුත්තන්තෙහි බ්යඤ්ජනපතිරූපකෙහි අත්ථඤ්ච ධම්මඤ්ච පටිබාහන්ති, තෙ භික්ඛවෙ භික්ඛූ බහුජනාහිතාය පටිපන්නා බහුජනාසුඛාය බහුනො ජනස්ස අනත්ථාය අහිතාය දුක්ඛාය දෙවමනුස්සානං. බහුඤ්ච තෙ භික්ඛවෙ භික්ඛූ අපුඤ්ඤං පසවන්ති. තෙචිමං සද්ධම්මං අන්තරධාපෙන්ති."
            },
            {
                "type": "page-break",
                "text": "136"
            },
            {
                "type": "paragraph",
                "text": "යෙ තෙ භික්ඛවෙ භික්ඛූ සුග්ගහිතෙහි සුත්තන්තෙහි න බ්යඤ්ජනපතිරූපකෙහි අත්ථඤ්ච ධම්මඤ්ච අනුලොමෙන්ති, තෙ භික්ඛවෙ භික්ඛූ බහුජනහිතාය පටිපන්නා බහුජනසුඛාය බහුනො ජනස්ස අත්ථාය හිතාය සුඛාය දෙවමනුස්සානං. බහුඤ්ච තෙ භික්ඛවෙ භික්ඛූ පුඤ්ඤං පසවන්ති. තෙ චිමං සද්ධම්මං ඨපෙන්තීති."
            },
            {
                "type": "centered",
                "text": "සමචිත්තවග්ගො චතුත්ථො.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": 121
            },
            {
                "text": "4. සමචිත්‌ත වර්ගය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 1.",
                "level": "1"
            },
            {
                "text": "**[සැවැත්නිදානයි:]**",
                "type": "paragraph"
            },
            {
                "text": "32. මහණෙනි, තොපට අසත්පුරුෂ භූමිය හා සත්පුරුෂ භූමිය දෙසමි. එය අසව, මනාකොට මෙනෙහි කරව. කියමි (වදාළහ.) වහන්ස, එසේ ය යි ඒ භික්‍ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වූහ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, අසත්පුරුෂ භූමිය කවර? මහණෙනි, අසත්පුරුෂ තෙමේ අකෘතඥ වෙයි, කෙළෙහිගුණ පාළකොට නො දන්නේ ද වෙයි. මහණෙනි, යම් මේ අකෘතඥ බවෙක් වේ ද, අකෘතවෙදී බවෙක් වේ ද, මෙය අසත්පුරුෂයන් විසින් ම පසස්නා ලදී. මහණෙනි, යම් අකෘතඥ බවෙක් අකෘතවෙදී බවෙක් වේ ද, මේ සම්පූර්‍ණ අසත්පුරුෂ භූමිය වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "123"
            },
            {
                "text": "මහණෙනි, සත්පුරුෂ භූමිය කවර? මහණෙනි, සත්පුරුෂ තෙමේ කෘතඥ වූයේ කෘතවෙදී වූයේ වේ. මහණෙනි, තෙල කෘතඥ බවෙක් කෘතවෙදී බවෙක් වේ ද, මෙය සත්පුරුෂයන් විසින් ම පසස්නා ලදී. මහණෙනි, තෙල කෘතඥ බවෙක් කෘතවෙදී බවෙක් වේ ද, මේ සම්පූර්‍ණ සත්පුරුෂ භූමිය මැයි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 2.",
                "level": "1"
            },
            {
                "text": "33. මහණෙනි, මම මවට ද පියාට දැයි දෙදෙනාට ප්‍රත්‍යුපකාරය සුකරය යි නො කියමි. මහණෙනි, ශතවර්‍ෂායුෂ්ක වූ යමෙක් සියවස් ජීවත් වන්නේ එක් අංසයෙකින් මව පිළිදගින්නේ එක් අංසයෙකින් පියා පිළිදගින්නේ වේ ද, හේ ම ඔවුන්ගේ සිරුරු සුවඳ සුණු ඉළීමෙන් හා අත්පා පිරිමැදීමෙන් හා සිහිල්පැන් හුණුපැන් නෑවීමෙන් හා අඞ්ගසම්බාහනයෙන් හා උපස්ථාන කෙරේ ද, ඔහුත් ඒ අංසයෙහි ම හිඳ මල මුත්‍ර පහකරන්නාහු නම්, මහණෙනි, හේ එසේ ද වුව, මවුපියන්ට උපකාරයෙක් හෝ ප්‍රත්‍යුපකාරයෙක් හෝ නොවේ මැයි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, බොහෝ සත්රුවන් ඇති මේ මහා පෘථිවියෙහි මවු පියන් සක්විති රජයෙහි පිහිටුවන්නේ නමුදු, මහණෙනි, මවුපියන්ට උපකාර කරණ ලද්දේ හෝ ප්‍රත්‍යුපකාර කරණ ලද්දේ හෝ නො ම වෙයි. එයට හේතු කවරේය? මහණෙනි, මවුපියෝ දූ පුතුනට බොහෝ උපකාර ඇතියහ. පුතුන් වඩන්නාහු පෝෂණය කරන්නාහු මේ ලෝකය දක්වනසුලු වෙති.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යමෙක් ශ්‍රද්ධා නැති මවුපියන් ශ්‍රද්ධාසම්පත්තියෙහි සමාදන් කරවා ද, වසවා ද, පිහිටුවා ද, මසුරුවූවන් ත්‍යාගසම්පත්තියෙහි සමාදන් කරවා ද, වසවා ද, පිහිටුවා ද. දුෂ‍්ප්‍රාඥවූවන් ප්‍රඥාසම්පත්තියෙහි සමාදන් කරවා ද, වසවා ද, පිහිටුවා ද. මහණෙනි, මෙතෙකින් මවුපියනට උපකාර කරණ ලද්දේත් ප්‍රත්‍යුපකාර කරණ ලද්දේත් අධික උපකාර කරණ ලද්දේත් වේ යයි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 3.",
                "level": "1"
            },
            {
                "text": "34. එකල්හි එක්තරා බ්‍රහ්මණයෙක් භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ හා සමග සතුටු වී ය ... එකත් පසෙක හුන් ඒ බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේ ය. භවත් ගෞතමයන් වහන්සේ කෙබඳු වාද ඇතිසේක් ද? කුමක් වදාරණ දැ ද?",
                "type": "paragraph"
            },
            {
                "text": "**[භගවත්හු:]**",
                "type": "unindented"
            },
            {
                "text": "බ්‍රාහ්මණය, මම ක්‍රියාවාදීත් වෙමි, අක්‍රියවාදීත් වෙමි.",
                "type": "paragraph"
            },
            {
                "text": "**[බමුණු:]**",
                "type": "unindented"
            },
            {
                "text": "කිසෙයින් භවත් ගෞතමයන් වහන්සේ ක්‍රියාවාදීත් අක්‍රියවාදීත් වන සේක් ද?",
                "type": "paragraph"
            },
            {
                "text": "**[භගවත්හු:]**",
                "type": "unindented"
            },
            {
                "text": "බ්‍රාහ්මණය, මම කායදුශ්චරිතයාගේත් වාග්දුශ්චරිතයාගේත් මනොදුශ්චරිතයාගේත් අක්‍රියාව (නො කිරීම) කියමි. නන්වැදෑරුම් ලාමක අකුශලධර්‍මයන්ගේ නොකිරීම කියමි. බ්‍රාහ්මණය, මම කායසුචරිතයාගේත් වාක්සුචරිතයාගේත් මනස්සුචරිතයාගේත් කිරීම කියමි. නන්වැදෑරුම් කුශලධර්‍මයන්ගේ කිරීම කියමි. බ්‍රහ්මණය, මම මෙසේ වනාහි ක්‍රියාවාදිත් අක්‍රියාවාදීත් වෙමි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "125"
            },
            {
                "text": "**[බමුණු:]**",
                "type": "unindented"
            },
            {
                "text": "භවත් ගෞතමයන් වහන්ස, ඉතා මැනවී ... භවත් ගෞතමයන් වහන්සේ අද පටන් දිවියෙන් ශරණ ගත් උපාසකයකු කොට මා රුස්නා සේක් වා යි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 4.",
                "level": "1"
            },
            {
                "text": "35. ඉක්බිති අනාථපිණ්ඩික ගෘහපති තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත් පසෙක හුන්නේ ය. එකත් පසෙක හුන් අනාථපිණ්ඩික ගෘහපති තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේ ය: වහන්ස, ලොකයෙහි දක්‍ෂිණාර්‍හයෝ කෙතෙක් ද? කො තැන්හි දන් දිය යුතු ද?",
                "type": "paragraph"
            },
            {
                "text": "ගෘහපතිය, ලොකයෙහි දක්‍ෂිණාවට සුදුස්සො දෙදෙනෙක් වෙති. ශෛක්‍ෂ තෙමේ ය, අශෛක්‍ෂ තෙමේ ය යන දෙදෙනා යි. ගෘහපතිය, ලොකයෙහි මේ දක්‍ෂිණාවට සුදුස්සෝ දෙදෙන වෙත්. මොවුන් කෙරෙහි දන් දිය යුතු වේ. භාග්‍යවතුන් වහන්සේ මෙය වදාළසේක. මෙය වදාරා ඉක්බිති සුගත වූ ශාස්තෲන් වහන්සේ තෙල ගය ද වදාළසේක.",
                "type": "paragraph"
            },
            {
                "text": "මේ ලොකයෙහි ශෛක්‍ෂ තෙමේ ද අශෛක්‍ෂ තෙමේ ද යාග කරනුවනට ආහුණෙය්‍ය (ඇරැදෙන්නටඅර්‍හ) වෙති. ඔහු කයින් ද වචනයෙන් ද යලි සිතින් ද ඍජු වෙති. යාග කරන්නන්හට එය කෙත වෙයි මෙහි දෙන ලද්දේ මහත්ඵල වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 5.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "36. මා විසින් මෙසේ අසන ලදී: එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයෙහි ජෙතවන නම්වූ අනේපිඬු සිටුහුගේ අරම්හි වැඩ වසන සේක. එසමයෙහි ආයුෂ්මත් ශාරිපුත්‍ර තෙරණුවෝ සැවැත්නුවර සමීපයෙහි පූර්‍වාරාම නම් මුවරමාපායෙහි වැඩවසන සේක. එකල්හි ආයුෂ්මත් සැරියුත් තෙරණුවෝ ඇවැත් මහණෙනි යි භික්‍ෂූන් ඇමතූහ. ඒ භික්‍ෂූහු ඇවැත්නි, යි ආයුෂ්මත් සැරියුත් තෙරණුවන්ට පිළිවදන් ඇස්වූහ. ආයුෂ්මත් ශාරීපුත්‍ර ස්ථවිරයන් වහන්සේ තෙල සුත්‍රය දෙසූහ:"
            },
            {
                "text": "ඇවැත්නි, අධ්‍යාත්මසංයෝජන ඇති පුද්ගලයා හා බාහිර සංයෝජන ඇති පුද්ගලයා හා දෙසමි. එය අසව මොනොවට මෙනෙහි කරව. දෙසමි යී. ඇවැත්නි, එසේ යි ඒ භික්‍ෂූහු ආයුෂ්මත් සැරියුත් තෙරණුවන්ට පිළිවදන් ඇස්වූහ. ආයුෂ්මත් සැරියුත් තෙරණුවෝ තෙල වදාළහ:",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, අධ්‍යාත්මසංයෝජන ඇති පුද්ගල තෙමේ කවරේ ය? ඇවැත්නි, මේ ශාසනයෙන් මහණ තෙමේ සිල්වත් වෙයි. ප්‍රාතිමොක්‍ෂසංවරශීලයෙන් සමන්‍වාගතවූයේ ආචාරගෝචර සම්‍පන්‍න වූයේ වෙසෙයි. අල්පමාත්‍ර වූ ද වරදෙහි බිය දක්නා සුලු වූයේ ශික්‍ෂාපදයන් මොනොවට ගෙන හික්මෙයි. හෙ තෙමේ කාබුන් මරණින් මතු එක්තරා දේවනිකායකට එළඹෙයි හේ එයින් ච්‍යුතවූයේ ආගාමී වූයේ මේ මිනිස් බවට එන්නේ වෙයි. ඇවැත්නි, මෙ තෙමේ ආගාමී වූයේ මේ මිනිස් බවට එන අධ්‍යාත්මසංයෝජන ඇති පුද්ගලයා යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "127"
            },
            {
                "text": "ඇවැත්නි, බාහිරසංයෝජන ඇති පුද්ගල තෙමේ කවරේ ය? ඇවැත්නි, මේ ශාසනයෙහි මහණ තෙමේ සිල්වත් වෙයි. ප්‍රාතිමෝක්‍ෂසංවරයෙන් සමන්‍වාගත වූයේ ආචාර ගෝචර සම්‍පන්‍න වූයේ වෙසෙයි. අල්පමාත්‍ර වූ ද වරදෙහි බිය දක්නා සුලු වූයේ ශික්‍ෂාපදයන් සමාදන්ව හික්මෙයි. හෙ තෙමේ එක්තරා ශාන්ත චිත්ත විමුක්තියකට පැමිණ වාසය කරයි. හෙ තෙමේ කාබුන් මරණින් මතු එක්තරා දේවනිකායකට එළඹෙයි. හේ එයින් ච්‍යුත වූයේ මේ මිනිසත් බවට නො එන්නේ අනාගාමී වෙයි. ඇවැත්නි, මේ තෙමේ මේ මිනිසත් බවට නො එන්නේ බාහිරසංයොජන ඇති අනාගාමී පුද්ගලයා යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, යලිදු අනෙකක් කියමි: මහණ තෙමේ සිල්වත් වෙයි ... ශික්‍ෂාපදයන් සමදන්ව හික්මෙයි හෙ තෙම කාමයන්ගේ ම නිර්‍වෙදය පිණිස, විරාගය පිණිස, නිරෝධය පිණිස පිළිපන්නේ වෙයි. හෙ තෙමේ ත්‍රිවිධ භවයන්ගේ ම නිර්‍වෙදය පිණිස, විරාගය පිණිස, නිරොධය පිණිස පිළිපන්නේ වෙයි. හෙතෙම (පඤ්චකාමගුණික වූ) තෘෂ්ණාව ක්‍ෂය කිරීම පිණිස පිළිපන්නේ වෙයි. හෙ තෙමේ භවලොභය ක්‍ෂය කිරීම පිණිස පිළිපන්නේ වෙයි. හෙ තෙමේ කාබුන් මරණින් මත්තෙහි එක්තරා දෙවනිකායෙක උපදී. හේ එයින් ච්‍යුත වූයේ මේ මිනිසත් බවට නො එන්නේ අනාගාමී වෙයි. ඇවැත්නි, මේ මිනිසත්බවට නො පැමිණෙන, අනාගාමී වූ බාහිර සංයොජන ඇති පුද්ගලයා යි කියනු ලැබේ. ",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති, බොහෝ වූ සමසිත් ඇති දෙවිවරු භාග්‍යවතුන් වහන්සේ වෙත එළඹියාහු ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පස් ව සිටියාහු ය. එකත්පසෙක සිටි ඒ දෙවිවරු භාග්‍යවතුන් වහන්සේට මෙය සැළ කළාහු ය:",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, මේ ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ පූර්‍වාරාම නම් වූ මුවරමාපහයෙහිදී භික්‍ෂූන්ට අධ්‍යාත්මසංයෝජන ඇති පුද්ගලයා ද බාහිර සංයෝජන ඇති පුද්ගලයා ද දෙශනා කෙරෙති. වහන්ස, පිරිස සතුටු වූ ය. වහන්ස, භාග්‍යවතුන් වහන්සේ අනුකම්පා කොට ආයුෂ්මත් ශාරීපුත්‍ර ස්ථවිරයන් වහන්සේ වෙත එළඹෙන සේක් නම් මැනැවි. භාග්‍යවතුන් වහන්සේතුෂ‍්ණීම්භාවයෙන් ඉවසූ සේක.",
                "type": "paragraph"
            },
            {
                "text": "එකල්හි භාග්‍යවතුන් වහන්සේ බලවත් පුරුෂයෙක් වක් කළ අතක් දික් නො කරණ තුරු දිගු කළ අතක් වක් නො කරන තුරු ජේතවනයෙහි අතුරු දහන් වූ සේක් පූර්‍වාරාම නම් මුවරමාපහයෙහි ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේගේ පෙරට පැණී ගිය සේක. භාග්‍යවතුන් වහන්සේ පැන වූ අස්නෙහි වැඩ හුන් සේක. ආයුෂ්මත් ශාරීපුත්‍ර ස්ථවිරයන් වහන්සේ ද භාග්‍යවතුන් වහන්සේ වැඳ එකත් පසෙක හුන්හ. එකත්පසෙක හුන් ආයුෂ්මත් සැරියුත් තෙරණුවන්ට භාග්‍යවතුන් වහන්සේ තෙල වදාළ සේක: ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "129"
            },
            {
                "text": "ශාරීපුත්‍රය, මෙහි බොහෝ වූ සමසිත් ඇති දෙවිවරු මා වෙත එළඹියාහු ය. එළඹ මා වැඳ එකත්පසෙක සිටියාහු ය. ශාරිපුත්‍රය, එකත් පසෙක සිටියා වූ ඒ දෙවියෝ මට තෙල සැළ කළාහු ය. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "වහන්ස, මේ ආයුෂ්මත් සැරියුත් තෙරණුවෝ පූර්‍වාරාම නම්වූ මුවරමාපහයෙහි දී භික්‍ෂූන්ට අධ්‍යාත්මසංයොජන ඇති පුද්ගලයා ද බාහිරසංයොජන ඇති පුද්ගලයා ද දෙශනා කෙරෙති, වහන්ස, පිරිස තුටු වූය. වහන්ස, භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ශාරීපුත්‍ර ස්ථවිරයන් වහන්සේ වෙත අනුකම්පා කොට එළඹෙන සේක් නම් මැනවැයි. ශාරීපුත්‍රය, ඒ දෙවියෝ දසදෙනක් ව ද, විසිදෙනක් ව ද, තිස්දෙනක් ව ද, සතළිස්දෙනක් ව ද, පණස්දෙනක් ව ද, සැටදෙනක් ව ද, හිදි අග් වැද සිටුනා පමණ තන්හිදු සිටිත්. ඔවුනොවුන් නො ද පෙළති යි."
            },
            {
                "text": "ශාරිපුත්‍රය, තොපට මෙබඳු සිතෙක් විය හෙයි. එනම්: යම් හෙයෙකින් ඒ දෙවිවරු දසදෙනක් ව ද, විසිදෙනක් ව ද, තිස්දෙනක් ව ද, සතළිස්දෙනක් ව ද, පණස්දෙනක් ව ද, සැටදෙනක් ව ද, හිදි අග් වැද සිටුනා පමණ තන්හිදු සිටිත් ද, උනුන් නො ද පෙළත් ද, ඒ දෙවියන් විසින් ඒකාන්තයෙන් ඒ රූපභවයෙහි දී එසේ සිත වඩනා ලද්දේ ය (කියා යී).",
                "type": "paragraph"
            },
            {
                "text": "ශාරීපුත්‍රය, මෙය මෙසේ නොදත යුතුය. ශාරීපුත්‍රය, යම් හෙයෙකින් ඒ දෙවියෝ දෙවිවරු දසදෙනක් ව ද විසිදෙනක් ව ද, තිස්දෙනක් ව ද, සතළිස්දෙනක් ව ද, පණස්දෙනක් ව ද, සැටදෙනක් ව ද, හිදි අග් වැද සිටුනා පමණ තන්හි සිටිත් ද. ඔවුනොවුන් නො පෙළත් ද, මෙසස්නෙහි දී ම ඒ දෙවියන් විසින් එසේ සිත වඩන ලද.",
                "type": "paragraph"
            },
            {
                "text": "ශාරීපුත්‍රය, එහෙයින් මෙසේ හික්මිය යුතු ය: සන්හුන් ඉඳුරන් ඇත්තමෝ සන්හුන් සිත් ඇත්තමෝ වන්නම්හ (කියායි.) ශාරීපුත්‍රය, තොප විසින් මෙසේ ම හික්මිය යුතු ය. ශාරීපුත්‍ර ය, සන්හුන් ඉඳුරන් ඇත්තා වූ ම සන්හුන් සිත් ඇත්තා වූ ම තොපගේ කායකර්‍මය ශාන‍ත වන්නේ ය. වාක්කර්‍මය ශාන‍ත වන්නේ ය. මනඃකර්‍මය ශාන‍ත වන්නේ ය. සබ්‍රම්සරුන් කෙරෙහි ශාන්ත වූ ම උපහාරයක් කරන්නම්හ යි (කියායි). ශාරීපුත්‍රය, මෙසේ ම හික්මිය යුතු ය.",
                "type": "paragraph"
            },
            {
                "text": "ශාරීපුත්‍රය, යම් කෙනෙක් මේ ධර්‍මපර්‍ය්‍යා නො ඇසුහු ද, ඒ අන්‍යතීර්ථකයෝ නටුවාහු ම වෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 6.",
                "level": "1"
            },
            {
                "text": "37. එක් සමයෙක්හි ආයුෂ්මත් මහාකාත්‍යායන ස්ථවිරයන් වහන්සේ වරණායෙහි කද‍දමදහතීරයෙහි වසන සේක. එකල්හි ආරාමදණ්ඩ බ්‍රාහ්මණ තෙමේ ආයුෂ්මත් මහාකාත්‍යායන ස්ථවිරයන් වහන්සේ වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් මහාකාත්‍යායන ස්ථවිරයන් වහන්සේ සමග සතුටු වී ය. සම්මොදනකථාවට නිසි සිහිකරනුවට නිසි කථාව කොට නිමවා එකත්පසෙක හුන්නේ ය. එකත් පසෙක හුන් ආරාමදණ්ඩ බ්‍රාහ්මණ ආයුෂ්මත් මහාකාත්‍යායන ස්ථවිරයන් වහන්සේට මෙය කී ය.",
                "type": "paragraph"
            },
            {
                "text": "භවත් කාත්‍යායනයෙනි, යම් හෙයෙකින් ක්‍ෂත්‍රියයෝ ද ක්‍ෂත්‍රියයන් හා සමග විවාද කෙරෙත් නම්, බ්‍රහ්මණයෝ ද බ්‍රාහ්මණයන් හා සමග විවද කෙරෙත් නම්, ගැහැවියෝ ද ගැහැවියන් හා සමග විවාද කෙරෙත් නම්, එයට හේතු කවරේ ය? ප්‍රත්‍යය කවරේ ය?",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "131"
            },
            {
                "text": "**[කසයින්තෙරහු:]**",
                "type": "unindented"
            },
            {
                "text": "බ්‍රාහ්මණය, කාමරාගයෙහි වැද ගැණුම ය, වෙසෙසින් බැඳීම ය, එරුණු ය, මැඩැගැණුම ය, ගිල ගැණුමය යන මේ හේතු කොට ගෙණ ම ක්‍ෂත්‍රියයෝ ද ක්‍ෂත්‍රියයන් හා සමග විවාද කෙරෙති. බ්‍රහ්මණයෝ ද බ්‍රාහ්මණයන් හා සමග විවද කෙරෙති. ගැහැවියෝ ද ගැහැවියන් හා සමග විවාද කෙරෙති. ",
                "type": "paragraph"
            },
            {
                "text": "**[රුප්දඬුබමුණු:]**",
                "type": "unindented"
            },
            {
                "text": "භවත් කාත්‍යායනයෙනි, යම් හෙයෙකින් ශ්‍රමණයෝ ද ශ්‍රමණයන් හා සමග විවාද කෙරෙත් නම්, එයට හෙතු කවරේ ය? ප්‍රත්‍යය කවරේ ය?",
                "type": "paragraph"
            },
            {
                "text": "**[කසයින්තෙරහු:]**",
                "type": "unindented"
            },
            {
                "text": "බ්‍රාහ්මණය, දෘෂ්ටිරාගයෙහි වැද ගැණුම ය, වෙසෙසින් බැඳීම ය, එරුණු ය, මැඩැගැණුම ය, ගිල ගැණුම ය යන මේ හෙතු කොට ගෙණ ශ්‍රමණයෝ ද ශ්‍රමණයන් හා සමග විවාද කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "text": "**[රුප්දඬුබමුණු:]**",
                "type": "unindented"
            },
            {
                "text": "භවත් කාත්‍යායනයෙනි, යමෙක් මේ කාමරාග විනිවෙස විනිබන්‍ධ පලිගෙධ පරියුට්ඨාන අජ්ඣොසානය ඉක්ම වී ද, මේ දිට්ඨිරාගවිනිවෙස විනිබන්‍ධ පලිගෙධ පරියුට්ඨාන අජ්ඣොසානයත් ඉක්ම වී ද එබඳු කිසිවෙක් ලොකයෙහි ඇත් ද?",
                "type": "paragraph"
            },
            {
                "text": "**[කසයින්තෙරහු:]**",
                "type": "unindented"
            },
            {
                "text": "බ්‍රාහ්මණය, ලොකයෙහි යමෙක් මේ කාමරාග විනිවෙස විනිබන්‍ධ පලිගෙධ පරියුට්ඨාන අජ්ඣොසානය ඉක්ම වූයේ ද, මේ දිට‍ඨිරාග විනිවෙස විනිබන්‍ධ පලිගෙධ පරියුට්ඨාන අජ්ඣොසානයත් ඉක්ම වී ද එබඳු කෙනෙක් ඇත.",
                "type": "paragraph"
            },
            {
                "text": "**[රුප්දඬුබමුණු:]**",
                "type": "unindented"
            },
            {
                "text": "භවත් කාත්‍යායනයෙනි, යම් කෙනෙක් ලෝකයෙහි මේ කාමරාග විනිවෙස විනිබන්‍ධ පලිගෙධ පරියුට්ඨාන අජ්ඣොසානය ඉක්ම වූ හු නම්, යම් කෙනෙක් මේ දිට්ඨිරාග විනිවෙස විනිබන්‍ධ පලිගෙධ පරියුට්ඨාන අජ්ඣොසානයත් ඉක්ම වූහු නම්, ඔහු කවරහ? ",
                "type": "paragraph"
            },
            {
                "text": "**[කසයින්තෙරහු:]**",
                "type": "unindented"
            },
            {
                "text": "බ්‍රාහ්මණය,පෙරදිග දනව්වෙහි සැවැත් නම් නුවරෙක් ඇත. එහි ඒ අර්‍හත් සම්‍යක් ස‍ම්බුද්ධ වූ භාග්‍යවතුන් වහන්සේ දැන් වැඩවසන සේක. බ්‍රාහ්මණය, ඒ භාග්‍යවතුන් වහන්සේ වනාහි මේ කාමරාග විනිවෙශ විනිබන්‍ධ පරිගෙධ පර්‍ය්‍යුත්‍ථාන අධ්‍යවසාය ඉක්ම වූ සේක. මේ දෘෂ්ටිරාග විනිවෙශ විනිබන්‍ධ පරිගෙධ පර්‍ය්‍යුත්‍ථාන අධ්‍යවසාය ද ඉක්ම වූ සේකැ යි.",
                "type": "paragraph"
            },
            {
                "text": "මෙසේ කී කල්හි ආරාමදණ්ඩ බ්‍රාහ්මණ හුනස්නෙන් නැගී සිට උතුරුසළුව එකස් කොට ලා දකුණු දණමඩල පොළොවෙහි හැන භාග්‍යවතුන් වහන්සේ වසන දසට ඇඳිලි බැඳ යම් ඒ භාග්‍යවතුන් වහන්සේ කෙනෙක් මේ කාමරාග විනිවෙශ විනිබන්‍ධ පරිගෙධ පර්‍ය්‍යුත්‍ථාන අධ්‍යවසාය ඉක්ම වූහු ද, මේ දෘෂ්ටිරාග විනිවෙශ විනිබන්‍ධ පරිගෙධ පර්‍ය්‍යුත්‍ථාන අධ්‍යවසායයත් ද ඉක්ම වූහු ද ඒ භාග්‍යවත් අර්‍හත් සම්‍යක් සම්බුද්ධයන් වහන්සේට නමස්කාර වේ වා යි තෙවරක් උදන් ඇනී.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "133"
            },
            {
                "text": "භවත් කාත්‍යායනයෙනි, ඉතා මැනැවි ... භවත් කාත්‍යායනයෙනි, යම්සේ යටිහුරු කොට තබන ලද්දක් උඩුහුරු කරන්නේ හෝ පිළිසන් වූවක් විවර කරන්නේ හෝ මංමුළා වූවකුහට මග කියන්නේ හෝ ‘ඇස් ඇත්තාහු රූප දක්නාහුය’ යි අඳුරෙහි තෙල්වැටුප් හෝ දරන්නේ වේ ද, එසේ ම භවත් කාත්‍යායනයන් විසින් නොයෙක් නියරින් ධර්‍මය ද දෙශනා කරණ ලද. භවත් කාත්‍යායනයෙනි, තෙල මම ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ ද ධර්‍මය ද භික්‍ෂුසඞඝයා ද ශරණ කොට යෙමි. භවත් කාත්‍යායනයෝ අද පටන් කොට දිවියෙන් ගත් සරණ ගිය උපාසකයකු කොට මා රුස්නා සේක්වා යි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 7.",
                "level": "1"
            },
            {
                "text": "38. එකල්හි ආයුෂ්මත් මහාකාත්‍යායන ස්ථවිරයන් වහන්සේ මධුරායෙහි වූ ගුන්‍දාවනයෙහි වැඩ වසන සේක. එකල්හි ක‍ණ්ඩරායණ බමුණු ආයුෂ්මත් මහාකාත්‍යායන ස්ථවිරයන් වහන්සේ වෙත එළඹියේ ය. එලඹ ආයුෂ්මත් මහාකාත්‍යායන ස්ථවිරයන් වහන්සේ හා සමග ... එකත් පසෙක හුන් ක‍ණ්ඩරායණ බමුණු ආයුෂ්මත් මහාකාත්‍යායන ස්ථවිරයන් වහන්සේට තෙල සැළ කෙළේය:",
                "type": "paragraph"
            },
            {
                "text": "භවත් කාත්‍යායනයෙනි, ශ්‍රමණ කාත්‍යායන තෙමේ ජරාජීර්‍ණ වූ වියඅතට ගිය දෑමහලු වූ කල් ගිය පශ්චිම වයසට පැමිණි බ්‍රාහ්මණයන් නොවඳනේය යි ද, දැක හුනස්නෙන් නොනැඟසිටුනේ යයි ද, අස්නෙන් නො අමතනේ යයි ද, යන මෙය මා විසින් අසන ලදී. භවත් කාත්‍යායනයෙනි, ඒ කාරණය එසේ ම ය. “භවත් කාත්‍යායන තෙමේ ජරාජීර්‍ණ වූ වයොවෘද්ධ වූ මහලු වූ කල් ඉක්මවූ පශ්චිම වයසට පැමිණි බමුණන් නො වඳනේය. දැක හුනස්නෙන් ද නැඟ නොසිටුනේය. අස්නෙනුදු නො අමතනේ ය. භවත් කාත්‍යායනයෙනි, එ කරුණ නොනිසිමැය”යි.",
                "type": "paragraph"
            },
            {
                "text": "බ්‍රාහ්මණය, භාග්‍යවත් වූ (සියලු දතයුතු දේ) දන්නා වූ (සියලු දැකිය යුතු දේ හස්‍තමාලකයක් සේ) දක්නා වූ අර්‍හත් වූ ඒ සම්‍යක් සම්බුද්ධයන් වහන්සේ විසින් වදාරණ ලද වෘද්ධභූමියෙක් හා දහරභූමියෙක් හා ඇත. බ්‍රාහ්මණය, ඉදින් උත්පත්තියෙන් අසූවයස් ඇති හෝ අනූවයස් ඇති හෝ සියක්වස් ඇති හෝ වෘද්ධයෙක් වේ නම් හෙ ද වස්තුකාම ක්ලෙශකාමයන් වළඳ කෙරේ ද, වස්තුකාම ක්ලෙශකාමයෙහි ලා ඉවස්නේ ද, කාමපරිළාහයෙන් දැවේ ද, කාමවිතර්‍කයන් විසින් කනු ලැබේ ද, කම්සුව පිරියෙස්‌ලියට උත්සාහවත් වූයේ ද, එකල්හි හෙ බාලයෙක යන සඞ්ඛ්‍යාවට ම යෙයි. බ්‍රාහ්මණය, ඉදින් තරුණ වූයේ මනා බොල් කළු කෙස් ඇත්තේ බහදුරු යොවුනින් සමනාවූයේ ප්‍රථම වයසින් යුක්ත දහරයෙක් හෝ වේ ද, හෙ ද වස්තුකාම ක්ලෙශකාමයන් පරිභොග නො කරනේ ද, වස්තුකාම ක්ලෙශකාමයෙහි ලා නො ඉවස්නේ ද, කාමපරිදාහයෙන් නො දැවේ ද, කාමවිතර්‍කයන් විසින් නො කනු ලැබේ ද, කම්සුව පිරියෙස්නට උත්සාහවත් නො වේ ද, ‘එකල්හි හෙ තෙමේ ප‍ණ්ඩිත වූ ස්ථවිර නම’ යන සඞ්ඛ්‍යාවට ම යේ යි.",
                "type": "paragraph"
            },
            {
                "text": "මෙසේ කී කල්හි ක‍ණ්ඩරායණ බ්‍රාහ්මණ හුනස්නෙන් නැඟී උතුරුසළුව එකස් කොට ලා “වෘද්ධ වූ භවත්හු තුමූ වෘද්ධභූමියෙහි සිටියහ. දහර වූ අපි දහරභූමියෙහි සිටියමෝය” යි. තරුණ භික්‍ෂූන්ගේ පා (මෙසේ) සිරසින් වඳියි: භවත් කාත්‍යායනයෙනි, ඉතා මැනව ... භවත් කාත්‍යායන තෙමේ අද පටන් කොට දිවියෙන් ගත් සරණ ගිය උපාසකයකු කොට මා රුස්නාසේක් වා යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "135"
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 8.",
                "level": "1"
            },
            {
                "text": "**[සැවැත්නිදානයි:]**",
                "type": "unindented"
            },
            {
                "text": "39. මහණෙනි, යම් කලෙක්හි සොරු බලවත් වෙත් ද, රජවරු එසමයෙහි දුර්‍වල වෙත්. මහණෙනි, එසමයෙහි රජුට (ඇතුළුනුවරට) පිවිසෙන්නට හෝ (ඇතුළුනුවරින්) නික්මෙන්නට හෝ පසල්දනව්වෙයි (කටයුතු) සංවිධාන කරන්නට හෝ පහසු නො වෙයි. එසමයෙහි බමුණු ගැහැවියන් ට ද (ඇතුළුනුවරට) පිවිසෙන්නට හෝ (ඇතුළුනුවරින්) නික්මෙන්නට හෝ බැහැර කටයුතු සංවිධාන කරන්නට හෝ පහසු නො වේ. මහණෙනි, එසේ ම යම් සමයෙක්හි පවිටු භික්‍ෂූහු බලවත් වෙත් ද, එසමයෙහි පේශල භික්‍ෂූහු දුර්‍වල වෙත්. මහණෙනි, එසමයෙහි පේශල භික්‍ෂූහු පුන පුනා නිශ්ශබ‍ද වූවාහු සඟ මැද කර බහා හිඳුනාහ. පසල් දනවු හෝ ඇසුරු කරන්නාහ. මහණෙනි, මේ කරුණ බොහෝ දෙනාට අහිත පිණිස බොහෝ දෙනාට නො සුව පිණිස බොහෝ දෙනාට අනර්ත්ථ පිණිස දෙවිමිනිසුන්ට අහිත පිණිස දුක් පිණිස වේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කලෙක්හි රජවරු බලවත් වෙත් ද, එසමයෙහි සොරු දුර්‍වල වෙත්. මහණෙනි, එසමයෙහි රජුට (ඇතුළු නුවරට) පිවිසෙන්නට හෝ (ඇතුළු නුවරින්) නික්ම යන්නට හෝ පසල් දනවුවෙහි (කටයුතු) සංවිධාන කරන්නට හෝ පහසු වෙයි. එසමයෙහි බමුණු ගැහැවියනට ද (ඇතුළු නුවරට) පිවිසෙන්නට හෝ (ඇතුළු නුවරින්) නික්ම යන්නට හෝ බැහැර කටයුතු සංවිධාන කරන්නට හෝ පහසු වේ. මහණෙනි, එසේ ම යම් සමයෙක්හි පෙශල භික්‍ෂූහු බලවත් වෙත් ද, එසමයෙහි පවිටු භික්‍ෂූහු දුර්‍වල වෙත්. මහණෙනි, එසමයෙහි පවිටු භික්‍ෂූහු පුන පුනා නිශ්ශබ‍ද වූවාහු සඟ මැද කරබහා හිඳුනාහ. යම් මැ තැනෙක හෝ යෙත්. මහණෙනි, ඒ මේ කරුණ බොහෝ දෙනාට හිත පිණිස බොහෝ දෙනාට සුව පිණිස බොහෝ දෙනාට වැඩ පිණිස දෙවිමිනිසුනට හිත පිණිස සුව පිණිස වේ.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 9.",
                "level": "1"
            },
            {
                "text": "40. මහණෙනි, මම ගිහියාගේ වේව යි පැවිද්දාගේ වේව යි දෙදෙනාගේ වරදවා පිළිපැදුම වර්‍ණනා නො කරමි. මහණෙනි, වරදවා පිළිපන් ගිහියා වේව යි පැවිද්දා වේව යි වරදවා පිළිපැදුම් හෙතුයෙන් විදර්‍ශනා සහිත මාර්‍ගය පුරන්නට නො හැකි වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මම ගිහියාගේ වේව යි පැවිද්දාගේ වේව යි දෙදෙනාගේ නිවැරදි පිළිපැදුම වර්‍ණනා කරමි. මහණෙනි, නිවැරදි ව පිළිපන් ගිහියා වේව යි පැවිද්දා වේව යි නිවැරදි පිළිපැදුම් හේතුයෙන් විදර්‍ශනා සහිත මාර්‍ගය පුරන්නට හැකි වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. 1. 4. 10.",
                "level": "1"
            },
            {
                "text": "41. මහණෙනි, යම් මහණ කෙනෙක් වරදවා ගන්නා ලද පදප්‍රතිරූපක වූ (ශබ්දචින්තායෙන් වරදවා ගන්නට නිසි) සූත්‍රාන්තයෙන් අටුවා ද පෙළ ද පිළිබහන්නාහු ද, මහණෙනි, ඒ මහණහු බොහෝ දෙනාට අහිත පිණිස ද බොහෝ දෙනාට නොසුව පිණිස ද බොහෝ දෙනාට අනර්ත්ථ පිණිස ද දෙවිමිනිසුනට අහිත පිණිස ද දුක් පිණිස ද පිළිපන්නාහු ය. මහණෙනි, ඒ භික්‍ෂූහු බොහෝ අකුසල් ද රැස් කෙරෙත්. ඔහු ම මේ සස්න ද අතුරුදන් කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "137"
            },
            {
                "text": "මහණෙනි, යම් මහණ කෙනෙක් මැනැවින් ගන්නා ලද ව්‍යඤ්ජන ප්‍රතිරූපක නොවූ (අක්‍ෂරචින්තායෙන් වැරදි ලෙස අදහස ගන්නට නොනිසි) සූත්‍රාන්තයෙන් අර්ත්ථ ද ධර්‍මය ද අනුව පවත්නාහු ද, මහණෙනි, ඒ මහණහු බොහෝ දෙනාට හිත පිණිස බොහෝ දෙනාට සුව පිණිස බොහෝ දෙනාට වැඩ පිණිස දෙවිමිනිසුනට හිත පිණිස සුව පිණිස පිළිපන්නාහු ය. මහණෙනි, ඒ මහණහු බොහෝ කුසල් ද රැස් කෙරෙත්. ඔහු ම මේ ශාසනය තබත් යී.",
                "type": "paragraph"
            },
            {
                "text": "සිවුවැනි සමසිත්වගයි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "filename": "an-2-4"
    }
]