{
    "filename": "an-3",
    "pages": [
        {
            "pageNum": 196,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. තිකනිපාතො",
                        "level": 4
                    },
                    {
                        "type": "heading",
                        "text": "1. පඨමො පණ්ණාසකො",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. බාලවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 1.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1. එවං මෙ සුතං: එකං සමයං භගවා **සාවත්ථියං **විහරති **ජෙතවනෙ අනාථපිණ්ඩිකස්ස **ආරාමෙ. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි, භික්ඛවොති. භදන්තෙති තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච."
                    },
                    {
                        "type": "paragraph",
                        "text": "යානි කානිචි භික්ඛවෙ භයානි උප්පජ්ජන්ති. සබ්බානි තානි බාලතො උප්පජ්ජන්ති, නො පණ්ඩිතතො. යෙ කෙචි උපද්දවා උප්පජ්ජන්ති, සබ්බෙ තෙ බාලතො උප්පජ්ජන්ති, නො පණ්ඩිතතො. යෙ කෙචි උපසග්ගා{1} උප්පජ්ජන්ති, සබ්බෙ තෙ බාලතො උප්පජ්ජන්ති, නො පණ්ඩිතතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි භික්ඛවෙ නළාගාරො වා තිණාගාරො{2} වා අග්ගිමුක්කො{3} කූටාගාරානිපි දහති උල්ලිත්තාවලිත්තානි නිවාතානි ඵුස්සිතග්ගලානි{4} පිහිතවාතපානානි.{5} එවමෙව ඛො භික්ඛවෙ යානි කානිචි භයානි උප්පජ්ජන්ති, සබ්බානි තානි බාලතො උප්පජ්ජන්ති, නො පණ්ඩිතතො. යෙ කෙචි උපද්දවා උප්පජ්ජන්ති, සබ්බෙ තෙ බාලතො උප්පජ්ජන්ති, නො පණ්ඩිතතො. යෙ කෙචි උපසග්ගා උප්පජ්ජන්ති, සබ්බෙ තෙ බාලතො උප්පජ්ජන්ති නො පණ්ඩිතතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉති ඛො භික්ඛවෙ සප්පටිභයො බාලො, අප්පටිභයො පණ්ඩිතො. සඋපද්දවො බාලො, අනුපද්දවො පණ්ඩිතො. සඋපසග්ගො බාලො, අනුපසග්ගො පණ්ඩිතො. නත්ථි භික්ඛවෙ පණ්ඩිතතො භයං, නත්ථි පණ්ඩිතතො උපද්දවො, නත්ථි පණ්ඩිතතො උපසග්ගො."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්මාතිහ භික්ඛවෙ එවං සික්ඛිතබ්බං : යෙහි තීහි ධම්මෙහි සමන්නාගතො බාලො වෙදිතබ්බො, තෙ තයො ධම්මෙ අභිනිවජ්ජෙත්වා යෙහි තීහි ධම්මෙහි සමන්නාගතො පණ්ඩිතො වෙදිතබ්බො, තෙ තයො ධම්මෙ සමාදාය වත්තිස්සාමාති. එවං හි වො භික්ඛවෙ සික්ඛිතබ්බන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උපස්සග්ගා - කත්ථචි."
                    },
                    {
                        "type": "footnote",
                        "text": "2. නලාගාරා වා තිණාගාරා වා - මඡසං. ස්යා. PTS"
                    },
                    {
                        "type": "footnote",
                        "text": "3. අග්ගිමුත්තො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. ඵස්සිතග්ගලානි - කත්ථචි. ඵුස්සිතග්ගලානි - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. වාතාපානානි - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "3. තිකනිපාතය",
                        "type": "heading",
                        "level": 4
                    },
                    {
                        "text": "1. පඨමපණ්ණාසකය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "text": "1. බාලවර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 1.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1. මා විසින් මෙසේ අසන ලදි: එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ **සැවැත්නුවර **සමීපයෙහි **ජේතවන **නම් වූ **අනේපිඬු **සිටුහුගේ අරම්හි වැඩ වසන සේක. එසමයෙහි භාග්‍යවතුන් වහන්සේ මහණෙනි යි භික්‍ෂූන් ඇමතූ සේක. පින්වතුන් වහන්සැ යි ඒ භික්‍ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වූහ. භාග්‍යවතුන් වහන්සේ තෙල සූත්‍රය වදාළ සේක."
                    },
                    {
                        "text": "මහණෙනි, යම් කිසි බිය කෙනෙක් උපදිත් නම් එහැම භීතීහු බාලයා කෙරෙන් උපදනාහ. පණ්ඩිතයා කෙරෙන් නූපදනාහ. යම් කිසි උපද්‍රව කෙනෙක් උපදිත් නම් එහැම උපද්‍රවයෝ බාලයා කෙරෙන් උපදනාහ. පණ්ඩිතයා කෙරෙන් නූපදනාහ. යම් කිසි උපසර්‍ග කෙනෙක් උපදිත් නම් එහැම උපසර්‍ගයෝ බාලයා කෙරෙන් උපදනාහ. පණ්ඩිතයා කෙරෙන් නූපදනාහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, රනහුණින් සුසන් ගෙයක් හෝ තණ කරලින් සුසන් ගෙයක් හෝ ගිනි ඇවිළ ගත්තේ, ඇතුළත පිටත සුණුවමින් ගල්වන ලද, වැළැහු සුලං ඇති, පැහැසු කවුළු ඇති, යෙදූ දැල් කවුළුදොර ඇති කැණි දුන් ගෙය ද යම්සේ දවා ද, මහණෙනි, එසෙයින් ම යම් කිසි බිය කෙනෙක් උපදිත් නම් එහැම භීතීහු බාලයා කෙරෙන් උපදනාහ. පණ්ඩිතයා කෙරෙන් නූපදනාහ. යම් කිසි උපද්‍රව කෙනෙක් උපදිත් නම් එහැම උපද්‍රවයෝ බාලයා කෙරෙන් උපදනාහ. පණ්ඩිතයා කෙරෙන් නූපදනාහ. යම් කිසි උපසර්‍ග කෙනෙක් උපදිත් නම් එහැම උපසර්‍ගයෝ බාලයා කෙරෙන් උපදනාහ. පණ්ඩිතයා කෙරෙන් නූපදනාහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙසේ වනාහි බාල තෙමේ ප්‍රතිභය සහිත වේ. පණ්ඩිත තෙමේ ප්‍රතිභය රහිත වේ. බාල තෙමේ උපද්‍රව සහිත වේ. පණ්ඩිත තෙමේ උපද්‍රව රහිත වේ. බාල තෙමේ උපසර්‍ග සහිත වේ. පණ්ඩිත තෙමේ උපසර්‍ග රහිත වේ. මහණෙනි, පණ්ඩිතයා කෙරෙන් බියෙක් නැත. පණ්ඩිතයා කෙරෙන් උපද්‍රවයෙක් නැත. පණ්ඩිතයා කෙරෙන් උපසර්‍ගයෙක් නැත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එහෙයින් යම් ධර්‍ම තුණෙකින් සමන්වාගත බාල තෙම දත යුතු නම්, ඒ ධර්‍ම තුණ නෙරැ යම්බඳු ධර්‍ම තුණෙකින් සමන්වාගත පණ්ඩිත තෙම දතයුතු නම්, ඒ ධර්‍ම තුණ සමාදන් කොට ගෙණ පවත්නම්හ යි මෙසේ හික්මිය යුතුය. මහණෙනි, තොප විසින් මෙසේ ම හික්මිය යුතුයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 198,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 2.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "2. කම්මලක්ඛණො භික්ඛවෙ බාලො, කම්මලක්ඛණො පණ්ඩිතො, අපදානසොභිනී{1} පඤ්ඤාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො බාලො වෙදිතබ්බො. කතමෙහි තීහි: කායදුච්චරිතෙන, වචීදුච්චරිතෙන, මනොදුච්චරිතෙන, ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො බාලො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "තීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො පණ්ඩිතො වෙදිතබ්බො; කතමෙහි තීහි: කායසුචරිතෙන, වචීසුචරිතෙන, මනොසුචරිතෙන. ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො පණ්ඩිතො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්මාතිහ භික්ඛවෙ එවං සික්ඛිතබ්බං ; යෙහි තීහි ධම්මෙහි සමන්නාගතො බාලො වෙදිතබ්බො, තෙ තයො ධම්මෙ අභිනිවජ්ජෙත්වා, යෙහි තීහි ධම්මෙහි සමන්නාගතො පණ්ඩිතො වෙදිතබ්බො, තෙ තයො ධම්මෙ සමාදාය වත්තිස්සාමාති. එවං හි වො භික්ඛවෙ සික්ඛිතබ්බන්ති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 3",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3. තීණිමානි භික්ඛවෙ බාලස්ස බාලලක්ඛණානි බාලනිමිත්තානි බාලාපදානානි.{2} කතමානි තීණි: ඉධ භික්ඛවෙ බාලො දුච්චින්තිතචින්තී ච හොති, දුබ්භාසිතභාසී, දුක්කතකම්මකාරී. නො චෙදං{3} භික්ඛවෙ බාලො දුච්චින්තිතචින්තී ච අභවිස්ස, දුබ්භාසිතභාසී, දුක්කතකම්මකාරී. කෙන නං පණ්ඩිතා ජානෙය්යුං බාලො අයං භවං අසප්පුරිසොති. යස්මා ච ඛො භික්ඛවෙ බාලො දුච්චින්තිතචින්තී ච හොති, දුබ්භාසිතභාසී, දුක්කතකම්මකාරී. තස්මා නං පණ්ඩිතා ජානන්ති, බාලො අයං භවං අසප්පුරිසොති. ඉමානි ඛො භික්ඛවෙ තීණි බාලස්ස බාලලක්ඛණානි බාලනිමිත්තානි බාලාපදානානි."
                    },
                    {
                        "type": "paragraph",
                        "text": "තීණිමානි භික්ඛවෙ පණ්ඩිතස්ස පණ්ඩිතලක්ඛණානි පණ්ඩිතනිමිත්තානි පණ්ඩිතාපදානානි.{4} කතමානි තීණි: ඉධ භික්ඛවෙ පණ්ඩිතො සුචින්තිතචින්තී ච හොති, සුභාසිතභාසී, සුකතකම්මකාරී. නො චෙදං{5} භික්ඛවෙ පණ්ඩිතො සුචින්තිතචින්තී ච අභවිස්ස, සුභාසිතභාසී, සුකතකම්මකාරී. කෙන නං පණ්ඩිතා ජානෙය්යුං, පණ්ඩිතො අයං භවං සප්පුරිසොති. යස්මා ච ඛො භික්ඛවෙ පණ්ඩිතො සුචින්තිතචින්තී ච හොති, සුභාසිතභාසී, සුකතකම්මකාරී. තස්මා නං පණ්ඩිතා ජානන්ති, පණ්ඩිතො අයං භවං සප්පුරිසොති. ඉමානි ඛො භික්ඛවෙ තීණි පණ්ඩිතස්ස පණ්ඩිතලක්ඛණානි පණ්ඩිතනිමිත්තානි පණ්ඩිතාපදානානි. තස්මාතිහ -පෙ- එවං හි වො භික්ඛවෙ සික්ඛිතබ්බන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අපදානෙ සොභනී පඤ්ඤා - PTS. ස්යා. අපදාන සොභනී - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. බාලපදානානි - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. නොචෙතං ස්යා. කං"
                    },
                    {
                        "type": "footnote",
                        "text": "4. පණ්ඩිතපදානානි - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "5. නොචෙතං - ස්යා. කං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 2.",
                        "level": 1
                    },
                    {
                        "text": "2. මහණෙනි, බාල තෙමේ කර්‍මය ලකුණු කොට ඇතියේ ය. පණ්ඩිත තෙමේ කර්‍මය ලකුණු කොට ඇතියේ ය. ප්‍රඥාව චරිතාපදානයෙන් හොබනී ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ධර්‍ම තුණෙකින් සමන්වාගත වූ බාලයා දතයුතු ය. කවර තුණෙකින යත්: කායදුශ්චරිතයෙන් හා වාග්දුශ්චරිතයෙන් හා මනොදුශ්චරිතයෙන් හා යන තුණෙනි. මහණෙනි, මේ ධර්‍ම තුණෙන් සමන්වාගත වූ බාල තෙමේ දතයුතු ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ධර්‍ම තුණෙකින් සමන්වාගත වූ පණ්ඩිත තෙමේ දතයුතුය: කවර තුණෙකින යත්: කායසුචරිතයෙන් හා වාක්දුචරිතයෙන් හා මනස්සුචරිතයෙන් හා යන තුණෙනි. මහණෙනි, මේ ධර්‍ම තුණෙන් සමන්වාගත වූ පණ්ඩිත තෙමේ දතයුතු ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එහෙයින් යම් ධර්‍ම තුණෙකින් සමන්වාගත බාල තෙම දත යුත්තේ නම්, ඒ තුන් ධර්‍මයන් නෙරැ යම් ධර්‍ම තුණෙකින් සමන්වාගත පණ්ඩිත තෙමේ දතයුත්තේ නම්, ඒ ධර්‍ම තුණ සමාදන් කොට ගෙණ පවත්නම්හ යි මෙසේ හික්මිය යුතුය. මහණෙනි, තොප විසින් මෙසේ ම හික්මිය යුතුයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 3.",
                        "level": 1
                    },
                    {
                        "text": "3. මහණෙනි, බාලයාගේ බාලාභිඥානයෝ, බාලනිමිත්තයෝ, බාලචරිතයෝ මොහු තුන්දෙනෙක් වෙත්. කවර තුන්දෙනෙක යත්: මහණෙනි, මෙ ලොව්හි බාල තෙමේ (අභිධ්‍යාදි විසින්) නපුරු සිතිවිලි සිතනුයේ ද වෙයි. නපුරු බස් බණනුයේ ද වෙයි. නපුරු කර්‍ම කරණුයේ ද වෙයි. මහණෙනි, ඉදින් බාල තෙමේ නපුරු සිතිවිලි සිතන සුලුත්, නපුරු බස් බණන සුලුත්, නපුරු කර්‍ම කරණ සුලුත් නොවී නම්, පණ්ඩිතයෝ මේ භවත් බාල ය, අසත්පුරුෂ යයි කවර සැටියෙකින් ඔහු හඳුනාගත හෙත් ද, මහණෙනි, යම් හෙයෙකින් බාල තෙමේ නපුරු සිතිවිලි සිතන සුලුත් වේ ද, නපුරු බස් බණන සුලුත් වේ ද, නපුරු කර්‍ම කරණ සුලුත් වේ ද, පණ්ඩිතයෝ මේ භවත් බාල ය, අසත්පුරුෂ යයි එයින් ඔහු හඳුනන්නාහ. මහණෙනි, මොහු තුන්දෙනා බාලයාගේ බාල ලක්‍ෂණ වෙති. බාලනිමිත්ත වෙති. බාලාපදාන වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පණ්ඩිතයාගේ පණ්ඩිතලක්‍ෂණයෝ, පණ්ඩිතනිමිත්තයෝ පණ්ඩිතචරිතයෝ මොහු තුන්දෙනෙක් වෙත්. කවර තුන්දෙනෙක යත්: මහණෙනි, මෙලොව්හි පණ්ඩිත තෙම මනාසිතිවිලි සිතන සුල්ලේත්, මනාතෙපුල් තෙපලන සුල්ලේත්, මනා කර්‍ම කරණ සුල්ලේත් වෙයි. මහණෙනි, පණ්ඩිත තෙමේ ඉදින් මනා සිතිවිලි සිතන සුල්ලේත්, මනා තෙපුල් තෙපලන සුල්ලේත්, මනා කර්‍ම කරණු සුල්ලේත් නොවී නම්, කවර සැටියෙකින් පණ්ඩිතයෝ මේ භවත් සත්පුරුෂයෙක පණ්ඩිතයෙකැ යි ඔහු හඳුනා ගත හෙත් ද, මහණෙනි, යම් හෙයෙකින් පණ්ඩිත තෙමේ මනා සිතිවිලි සිතන සුල්ලේත් වේ ද, මනා තෙපුල් තෙපලන සුල්ලේත් වේ ද, මනා කර්‍ම කරණ සුල්ලේත් වේ ද, එහෙයින් පණ්ඩිතයෝ මේ භවත් සත්පුරුෂයෙක, පණ්ඩිතයෙකැ යි ඔහු හඳුනා ගන්නාහ. මහණෙනි, පණ්ඩිතයාගේ පණ්ඩිත ලක්‍ෂණයෝ, පණ්ඩිත නිමිත්තයෝ, පණ්ඩිතාපදානයෝ මොහු තුන්දෙන වෙත් යයි. එහෙයින් ... මහණෙනි, තොප විසින් මෙසේ ම හික්මිය යුතුයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 200,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 4.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "4. තීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො බාලො වෙදිතබ්බො, කතමෙහි තීහි:අච්චයං අච්චයතො න පස්සති, අච්චයං අච්චයතො දිස්වා යථාධම්මං න පටිකරොති, පරස්ස ඛො පන අච්චයං දෙසෙන්තස්ස යථාධම්මං න පතිගණ්හාති.{1} ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො බාලො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "තීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො පණ්ඩිතො වෙදිතබ්බො, කතමෙහි තීහි: අච්චයං අච්චයතො පස්සති, අච්චයං අච්චයතො දිස්වා යථාධම්මං පටිකරොති, පරස්ස ඛො පන අච්චයං දෙසෙන්තස්ස යථාධම්මං පතිගණ්හාති.{2} ඉමෙහි ඛො භික්ඛවෙ, තීහි ධම්මෙහි සමන්නාගතො පණ්ඩිතො වෙදිතබ්බො. තස්මාතිහ -පෙ- එවං හි වො භික්ඛවෙ සික්ඛිතබ්බන්ති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 5.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "5. තීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො බාලො වෙදිතබ්බො, කතමෙහි තීහි: අයොනිසො පඤ්හං කත්තා හොති, අයොනිසො පඤ්හං විස්සජ්ජෙතා හොති, පරස්ස ඛො පන යොනිසො පඤ්හං විස්සජ්ජිතං පරිමණ්ඩලෙහි පදබ්යඤ්ජනෙහි සිලිට්ඨෙහි උපගතෙහි නාබ්භනුමොදිතා හොති. ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො බාලො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "තීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො පණ්ඩිතො වෙදිතබ්බො, කතමෙහි තීහි: යොනිසො පඤ්හං කත්තා හොති, යොනිසො පඤ්හං විස්සජ්ජෙතා හොති, පරස්ස ඛො පන යොනිසො පඤ්හං විස්සජ්ජිතං පරිමණ්ඩලෙහි පදබ්යඤ්ජනෙහි සිලිට්ඨෙහි උපගතෙහි අබ්භනුමොදිතා හොති. ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො පණ්ඩිතො වෙදිතබ්බො. තස්මාතිහ -පෙ- එවං හි වො භික්ඛවෙ සික්ඛිතබ්බන්ති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 6.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "6. තීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො බාලො වෙදිතබ්බො, කතමෙහි තීහි: අකුසලෙන කායකම්මෙන අකුසලෙන වචීකම්මෙන අකුසලෙන මනොකම්මෙන. ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො බාලො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "තීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො පණ්ඩිතො වෙදිතබ්බො, කතමෙහි තීහි: කුසලෙන කායකම්මෙන, කුසලෙන වචීකම්මෙන, කුසලෙන මනොකම්මෙන. ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො පණ්ඩිතො වෙදිතබ්බො. තස්මාතිහ -පෙ- එවං හි වො භික්ඛවෙ සික්ඛිතබ්බන්ති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 7.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "7. තීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො බාලො වෙදිතබ්බො, කතමෙහි තීහි: සාවජ්ජෙන කායකම්මෙන, සාවජ්ජෙන වචීකම්මෙන, සාවජ්ජෙන මනොකම්මෙන. ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො බාලො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "තීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො පණ්ඩිතො වෙදිතබ්බො, කතමෙහි තීහි: අනවජ්ජෙන කායකම්මෙන, අනවජ්ජෙන වචීකම්මෙන, අනවජ්ජෙන මනොකම්මෙන. ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙන සමන්නාගතො පණ්ඩිතො වෙදිතබ්බො. තස්මාතිහ -පෙ- එවං හි වො භික්ඛවෙ සික්ඛිතබ්බන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. නප්පටිග්ගණ්හාති - මඡසං. න පටිග්ගණ්හාති - ස්යා. නප්පතිගණ්හාති - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. __පටිග්ගණ්හාති - මඡසං. (?) - ස්යා.__"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 4.",
                        "level": 1
                    },
                    {
                        "text": "4. මහණෙනි, ධර්‍ම තුණෙකින් සමන්වාගත බාල තෙමේ දතයුතු වේ. කවර තුණෙකින යත්: වරද වරද විසින් නො දක්නේ ද, වරද වරද විසින් දැක ඇවැතට නිසි (යථාපරාධ දණ්ඩයෙන්) පිළියම් නොකෙරේ ද, අපරාධය දෙසන මෙරමාගේ යථාධර්‍මය නො පිළිගණී ද (යන තුණෙනි). මහණෙනි, මේ ධර්‍ම තුණෙන් සමන්වාගත බාල තෙමේ දතයුත්තේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ධර්‍ම තුණෙකින් සමන්වාගත පණ්ඩිත තෙමේ දතයුතු ය. කවර තුණෙකින යත්: වරද වරද විසින් දක්නේ ද, වරද වරද විසින් දැක දහම් වූ පරිදි පිළියම් කෙරේ ද, අපරාධය දෙසන අන්‍යයාගේ අපරාධය පිළිගණී ද, (යන තුණෙනි). මහණෙනි, මේ ධර්‍ම තුණෙන් සමන්වාගත පණ්ඩිත තෙමේ දතයුත්තේ ය. එහෙයින් ... මහණෙනි, තොප විසින් මෙසේ ම හික්මිය යුතුයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 5.",
                        "level": 1
                    },
                    {
                        "text": "5. මහණෙනි, ධර්‍ම තුණෙකින් සමන්වාගත බාල තෙමේ දතයුතු ය. කවර තුණෙකින යත්: නුනුවණින් ප්‍රශ්න කරණු වෙයි. නුනුවණින් ප්‍රශ්න විසඳනු වෙයි. පිරිමඬුලු සිලුටු අර්‍ථානුගතපදයෙන් මෙරමා විසින් නුවණින් විසඳන ලද ප්‍රශ්නය සතුටින් නො පිළිගණු වෙයි. (යන තුණෙනි.) මහණෙනි, මේ ධර්‍ම තුණෙන් යුක්ත වූ බාල තෙමේ දතයුතූ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ධර්‍ම තුණෙකින් සමන්වාගත වූ පණ්ඩිත තෙමේ දතයුතු වේ. කවර තුණෙකින යත්: නුවණින් ප්‍රශ්න කරණු වෙයි. නුවණින් ප්‍රශ්න විසඳනු වෙයි. පිරිමඬුලු සිලුටු අර්‍ථානුගත පදව්‍යඤ්ජනයෙන් මෙරමා විසින් නුවණින් විසඳන ලද ප්‍රශ්නය සතුටින් පිළිගණු වෙයි. (යන තුණෙනි.) මහණෙනි, මේ ධර්‍ම තුණෙන් සමන්වාගත වූ පණ්ඩිත තෙමේ දතයුතූ වේ. එහෙයින් ... මහණෙනි, තොප විසින් මෙසේ ම හික්මිය යුතු ය.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 6.",
                        "level": 1
                    },
                    {
                        "text": "6. මහණෙනි, ධර්‍ම තුණෙකින් සමන්වාගත බාල තෙමේ දතයුතු වේ. කවර තුණෙකින යත්: අකුශල වූ කායකර්‍මයෙන, අකුශල වූ වාක්කර්‍මයෙන, අකුශල වූ මනඃකර්‍මයෙන (යන තුණෙනි). මහණෙනි, මේ ධර්‍ම තුණෙන් සමන්වාගත වූ බාල තෙමේ දතයුතු වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ධර්‍ම තුණෙකින් සමන්වාගත පණ්ඩිත තෙමේ දතයුතු වෙයි. කවර තුණෙකින යත්: කුශල වූ කායකර්‍මයෙන, කුශල වූ වාක්කර්‍මයෙන, කුශල වූ මනඃකර්‍මයෙන (යන තුණෙනි). මහණෙනි, මේ ධර්‍ම තුණෙන් සමන්වාගත වූ පණ්ඩිත තෙමේ දතයුතූ වේ. එහෙයින් ... මහණෙනි, තොප විසින් මෙසේ ම හික්මිය යුතු ය.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 7.",
                        "level": 1
                    },
                    {
                        "text": "7. මහණෙනි, ධර්‍ම තුණෙකින් සමන්වාගත වූ බාල තෙමේ දතයුතු වේ. කවර ධර්‍ම තුණෙකින යත්: වරද සහිත වූ කායකර්‍මයෙන, වරද සහිත වූ වාක්කර්‍මයෙන, වරද සහිත වූ මනඃකර්‍මයෙන (යන තුණෙනි). මහණෙනි, මේ ධර්‍ම තුණෙන් සමන්වාගත වූ බාල තෙමේ දතයුතු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ධර්‍ම තුණෙකින් සමන්වාගත වූ පණ්ඩිත තෙමේ දතයුතු වෙයි. කවර තුණෙකින යත්: නිරවද්‍ය වූ කායකර්‍මයෙන, නිරවද්‍ය වූ වාක්කර්‍මයෙන, නිරවද්‍ය වූ මනඃකර්‍මයෙන. (යන තුණෙනි). මහණෙනි, මේ ධර්‍ම තුණෙන් සමන්වාගත වූ පණ්ඩිත තෙමේ දතයුතූ වේ. එහෙයින් ... මහණෙනි, තොප විසින් මෙසේ ම හික්මිය යුතු ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 202,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 8.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "8. තීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො බාලො වෙදිතබ්බො, කතමෙහි තීහි: සබ්යාපජ්ඣෙන කායකම්මෙන, සබ්යාපජ්ඣෙන වචීකම්මෙන, සබ්යාපජ්ඣෙන මනොකම්මෙන. -පෙ- අබ්යාපජ්ඣෙන කායකම්මෙන, අබ්යාපජ්ඣෙන වචීකම්මෙන, අබ්යාපජ්ඣෙන මනොකම්මෙන. ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො පණ්ඩිතො වෙදිතබ්බො. තස්මාතිහ භික්ඛවෙ එවං සික්ඛිතබ්බං: යෙහි තීහි ධම්මෙහි සමන්නාගතො බාලො වෙදිතබ්බො, තෙ තයො ධම්මෙ අභිනිවජ්ජෙත්වා යෙහි තීහි ධම්මෙහි සමන්නාගතො පණ්ඩිතො වෙදිතබ්බො, තෙ තයො ධම්මෙ සමාදාය වත්තිස්සාමාති. එවං හි වො භික්ඛවෙ සික්ඛිතබ්බන්ති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 9.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "9. තීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො බාලො අව්යත්තො අසප්පුරිසො ඛතං උපහතං අත්තානං පරිහරති, සාවජ්ජො ච හොති සානුවජ්ජො විඤ්ඤූනං, බහුඤ්ච අපුඤ්ඤං පසවති. කතමෙහි තීහි: කායදුච්චරිතෙන, වචීදුච්චරිතෙන, මනොදුච්චරිතෙන. ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො බාලො අව්යත්තො අසප්පුරිසො ඛතං උපහතං අත්තානං පරිහරති, සාවජ්ජො ච හොති, සානුවජ්ජො විඤ්ඤූනං, බහුඤ්ච අපුඤ්ඤං පසවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො පණ්ඩිතො ව්යත්තො සප්පුරිසො අක්ඛතං අනුපහතං අත්තානං පරිහරති, අනවජ්ජො ච හොති, අනනුවජ්ජො විඤ්ඤූනං, බහුඤ්ච පුඤ්ඤං පසවති. කතමෙහි තීහි: කායසුචරිතෙන, වචීසුචරිතෙන, මනොසුචරිතෙන. ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො පණ්ඩිතො ව්යත්තො සප්පුරිසො අක්ඛතං අනුපහතං අත්තානං පරිහරති, අනවජ්ජො ච හොති, අනනුවජ්ජො විඤ්ඤූනං, බහුඤ්ච පුඤ්ඤං පසවතීති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 10.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "10. තීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො තයො මලෙ අප්පහාය යථාභතං නික්ඛිත්තො එවං නිරයෙ. කතමෙහි තීහි: දුස්සීලො ච හොති, දුස්සීල්යමලඤ්චස්ස අප්පහීනං හොති. ඉස්සුකී ච හොති, ඉස්සාමලඤ්චස්ස අප්පහීනං හොති. මච්ඡරී ච හොති, මච්ඡෙරමලඤ්චස්ස අප්පහීනං හොති. ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො ඉමෙ තයො මලෙ අප්පහාය යථාභතං නික්ඛිත්තො එවං නිරයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "තීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො තයො මලෙ පහාය යථාභතං නික්ඛිත්තො එවං සග්ගෙ. කතමෙහි තීහි: සීලවා ච හොති, දුස්සීල්යමලඤ්චස්ස පහීනං හොති. අනිස්සුකී ච හොති, ඉස්සාමලඤ්චස්ස පහීනං හොති. අමච්ඡරී ච හොති, මච්ඡෙරමලඤ්චස්ස පහීනං හොති. ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො ඉමෙ තයො මලෙ පහාය යථාභතං නික්ඛිත්තො එවං සග්ගෙති."
                    },
                    {
                        "type": "centered",
                        "text": "බාලවග්ගො පඨමො. {1}",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. තස්සුද්දානං :- භයං ලක්ඛණචින්තී ච අච්චයඤ්ච අයොනිසො,\nඅකුසලඤ්ච සාවජ්ජං -සබ්යජ්ඣකතං මලන්ති. - මඡසං. ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 8.",
                        "level": 1
                    },
                    {
                        "text": "8. මහණෙනි, ධර්‍ම තුණෙකින් සමන්වාගත වූ බාල තෙමේ දතයුතු වෙයි. කවර තුණෙකින යත්: සදොස් වූ කායකර්‍මයෙන, සදොස් වූ වාක්කර්‍මයෙන, සදොස් වූ මනඃකර්‍මයෙන (යන තුණෙනි). නිදොස් වූ කායකර්‍මයෙන, නිදොස් වූ වාක්කර්‍මයෙන, නිදොස් වූ මනඃකර්‍මයෙන (යන තුණෙනි). මහණෙනි, මේ ධර්‍ම තුණෙන් සමන්වාගත වූ පණ්ඩිත තෙමේ දතයුතු වේ. මහණෙනි, එහෙයින් යම් ධර්‍ම තුණෙකින් සමන්වාගත වූ බාල තෙමේ දත යුත්තේ නම්, ඒ ධර්‍ම තුණ නෙරැ යම් ධර්‍ම තුණෙකින් සමන්වාගත වූ පණ්ඩිත තෙමේ දතයුත්තේ නම්, ඒ ධර්‍ම තුණ සමාදන් කොට ගෙණ පවත්නම්හ යි මෙසේ හික්මිය යුතුය. මහණෙනි, තොප විසින් මෙසේ ම හික්මිය යුතුයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 9.",
                        "level": 1
                    },
                    {
                        "text": "9. මහණෙනි, ධර්‍ම තුණෙකින් සමන්වාගත අව්‍යක්ත අසත්පුරුෂ බාල තෙම කැණු ගුණ ඇති නට ගුණ ඇති ආත්මය පිරිවටයි. වරද සහිත ද වෙයි. නුවණැත්තන් විසින් උපවාද කටයුතු ද වෙයි. බොහෝ පව් ද රැස් කරයි. කවර තුණෙකින යත්: කායදුශ්චරිතයෙන, වාග්දුශ්චරිතයෙන, මනොදුශ්චරිතයෙන (යන තුණෙනි.) මහණෙනි, මේ ධර්‍ම තුණෙන් සමන්වාගත වූ අව්‍යක්ත අසත්පුරුෂ තෙමේ කැණු ගුණ ඇති නටගුණ ඇති ආත්මය __පස්වටයි__. සදොස් වූයේ ද නුවණැත්තන් විසින් උපවාද කටයුතු ද වෙයි. බොහෝ පව් ද රැස් කරයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ධර්‍ම තුණෙකින් සමන්වාගත ව්‍යක්ත සත්පුරුෂ වූ පණ්ඩිත තෙම නොකිණි ගුණ ඇති, නොනට ගුණ ඇති ආත්මය පිරිවටයි. නිදොස්වූයේද නුවණැත්තන් විසින් උපවාද නොකට යුත්තේ ද වෙයි. බොහෝ (ලොවී ලොවුතුරා) කුසල් ද රැස් කරයි. කවර තුණෙකින යත්: කායසුචරිතයෙන, වාක්සුචරිතයෙන, මනස්සුචරිතයෙන (යන තුණෙනි.) මහණෙනි, මේ ධර්‍ම තුණෙන් සමන්වාගත වූ ව්‍යක්ත සත්පුරුෂ වූ පණ්ඩිත තෙම නොකිණි ගුණ ඇති, නොනට ගුණ ඇති ආත්මය පරිහරණය කෙරෙයි. නිදොස් වූයේ නුවණැත්තන් විසින් නො ම උපවාද කටයුතු ද වෙයි. බොහෝ කුසල් ද රැස් කෙරේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 1. 10.",
                        "level": 1
                    },
                    {
                        "text": "10. මහණෙනි, ධර්‍ම තුණෙකින් සමන්වාගත වූයේ ත්‍රිවිධ මල නො දැහැ (හිසින්) ගෙණවුත් බහා තැබූයේ යම්සේ ද, එසේ නිරයෙහි (පිහිටියේ) වේ. කවර තුණෙකින් යත්: දුශ්ශීල ද වේ. මොහුගේ දෞශ්ශීල්‍ය මලය ප්‍රහීණ නුවූයේත් වේ. ඊර්ෂ්‍යා ඇත්තේත් වේ. මොහුගේ ඊර්ෂ්‍යාමලය ප්‍රහීණ නුවූයේත් වේ. මසුරුවූයේ ද වේ. ඔහුගේ මසුරු මල නො ම ප්‍රහීණ වූයේ ද වේ. (යන තුණෙනි.) මහණෙනි, මේ ධර්‍ම තුණෙන් සමන්වාගත වූයේ මේ මල තුණ ප්‍රහීණ නො කොට හිසින් ගෙණවුත් බහා තැබූයේ යම්සේ ද එසේ නිරයෙහි (පිහිටියේ) වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ධර්‍ම තුණෙකින් සමන්වාගත වූයේ ත්‍රිවිධ මල පහා හිසින් ගෙණ වුත් බහා තැබූයේ යම්සේ ද, එසේ ස‍්වර්‍ගයෙහි (පිහිටියේ) වේ. කවර තුණෙකින් යත්: සිල්වත් ද වෙයි. මොහුගේ දෞශ්ශීල්‍ය මලය ප්‍රහීණ වූයේත් වෙයි. ඊර්ෂ්‍යා නැත්තේ ද වෙයි. ඔහුගේ ඊර්ෂ්‍යා මලය ප්‍රහීණ වූයේත් වේ. නො මසුරු වූයේ ද වෙයි. ඔහුගේ මසුරුමල ප්‍රහීණ වූයේත් වේ. මහණෙනි, මේ ධර්‍ම තුණෙන් සමන්වාගත වූයේ මේ ත්‍රිවිධමලය ප්‍රහීණ කොට හිසින් ගෙණවුත් බහා තැබූයේ යම්සේ ද එසේ (ස‍්වර්‍ගයෙහි) වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පළමුවන බාල වග යි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 204,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "2. රථකාරවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "**(සාවත්ථිනිදානං:)**"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 1.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "11. තීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො ඤාතකො භික්ඛු බහුජනාහිතාය පටිපන්නො හොති, බහුජනාසුඛාය බහුනො ජනස්ස අනත්ථාය අහිතාය දුක්ඛාය දෙවමනුස්සානං. කතමෙහි තීහි: අනනුලොමිකෙ කායකම්මෙ සමාදපෙති, අනනුලොමිකෙ වචීකම්මෙ සමාදපෙති, අනනුලොමිකෙසු ධම්මෙසු සමාදපෙති. ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො ඤාතකො භික්ඛු බහුජනාහිතාය පටිපන්නො හොති, බහුජනාසුඛාය බහුනො ජනස්ස අනත්ථාය අහිතාය දුක්ඛාය දෙවමනුස්සානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "තීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො ඤාතකො භික්ඛු බහුජනහිතාය පටිපන්නො හොති, බහුජනසුඛාය බහුනො ජනස්ස අත්ථාය හිතාය සුඛාය දෙවමනුස්සානං. කතමෙහි තීහි: අනුලොමිකෙ කායකම්මෙ සමාදපෙති, අනුලොමිකෙ වචීකම්මෙ සමාදපෙති, අනුලොමිකෙසු ධම්මෙසු සමාදපෙති. ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො ඤාතකො භික්ඛු බහුජනහිතාය පටිපන්නො හොති, බහුජනසුඛාය බහුනො ජනස්ස අත්ථාය හිතාය සුඛාය දෙවමනුස්සානන්ති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 2.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "12. තීණිමානි භික්ඛවෙ රඤ්ඤො ඛත්තියස්ස මුද්ධාවසිත්තස්ස යාවජීවං සාරාණීයානි{1} භවන්ති. කතමානි තීණි: යස්මිං භික්ඛවෙ පදෙසෙ රාජා ඛත්තියො මුද්ධාවසිත්තො ජාතො හොති. ඉදං භික්ඛවෙ පඨමං රඤ්ඤො ඛත්තියස්ස මුද්ධාවසිත්තස්ස යාවජීවං සාරණීයං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ යස්මිං පදෙසෙ රාජා ඛත්තියො මුද්ධාවසිත්තො{2} හොති. ඉදං භික්ඛවෙ දුතියං රඤ්ඤො ඛත්තියස්ස මුද්ධාවසිත්තස්ස{2} යාවජීවං සාරාණීයං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ යස්මිං පදෙසෙ රාජා ඛත්තියො මුද්ධාවසිත්තො සඞ්ගාමං අභිවිජිනිත්වා විජිතසඞ්ගාමො තමෙව සඞ්ගාමසීසං අජ්ඣාවසති. ඉදං භික්ඛවෙ තතියං රඤ්ඤො ඛත්තියස්ස මුද්ධාවසිත්තස්ස{2} යාවජීවං සාරාණීයං{5} හොති. ඉමානි ඛො භික්ඛවෙ තීණි රඤ්ඤො. ඛත්තියස්ස මුද්ධාවසිත්තස්ස යාවජීවං සාරාණීයානි භවන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ තීණිමානි භික්ඛුස්ස යාවජීවං සාරාණීයානි භවන්ති. කතමානි තීණි: යස්මිං භික්ඛවෙ පදෙසෙ භික්ඛු කෙසමස්සුං ඔහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජිතො හොති. ඉදං භික්ඛවෙ පඨමං භික්ඛුස්ස යාවජීවං සාරාණීයං{5} හොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සරණීයානි - ස්යා. කං. PTS. සාරණීයානි - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. මුද්ධාභිසිත්තො - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. සරණීයානි - ස්යා. කං. PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "2. රථකාරවර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "**(සැවැත්නිදානයි:)**"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 1.",
                        "level": 1
                    },
                    {
                        "text": "11. මහණෙනි, කරුණු තුණෙකින් සමන්වාගත ප්‍රකට මහණ බොහෝ දෙනාට අහිත පිණිස බොහෝ දෙනාට නොසුව පිණිස බොහෝ දෙනාට අනර්ථය පිණිස, දෙවිමිනිස්නට අහිත පිණිස, දුක් පිණිස පිළිපන්නේ වෙයි. කවර තුණෙකින යත්: (ශාසනයට) අනුලොම් නුවූ කායකර්මයෙහි සමාදන් කරවයි. අනුලොම් නුවූ වාක්කර්මයෙහි සමාදන් කරවයි. අනුලොම් නුවූ ධර්මයෙහි සමාදන් කරවයි. මහණෙනි, මේ ධර්ම තුණෙකින් සමන්වාගත ප්‍රකට මහණ තෙම බොහෝ දෙනාට අහිත පිණිස බොහෝ දෙනාට නොසුව පිණිස බොහෝ දෙනාට අනර්ථය පිණිස, දෙවිමිනිස්නට අහිත පිණිස දුක් පිණිස පිළිපන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ධර්ම තුනෙකින් සමන්වාගත ප්‍රසිද්ධ මහණ බොහෝ දෙනාට හිත පිණිස, බොහෝ දෙනාට සුව පිණිස, බොහෝ දෙනාට වැඩ පිණිස, දෙවිමිනිස්නට හිත පිණිස, සුව පිණිස පිළිපන්නේ ය. කවර තුණෙකින යත්: (සස්නට) අනුලොම් වූ කායකර්මයෙහි සමාදන් කරවයි, අනුලොම් වූ වාක්කර්මයෙහි සමාදන් කරවයි, අනුලොම් වූ ධර්මයෙහි සමාදන් කරවයි, මහණෙනි, මේ ධර්ම තුණෙන් සමන්වාගත ප්‍රකට මහණ බොහෝ දෙනාට හිත පිණිස, බොහෝ දෙනාට සුව පිණිස, බොහෝ දෙනාට වැඩ පිණිස, දෙවිමිනිස්නට හිත පිණිස, සුව පිණිස පිළිපන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 2.",
                        "level": 1
                    },
                    {
                        "text": "12. මහණෙනි, මේ කරුණු තුණෙක් මුදුනෙහි බිසෙස් කළ දෑ කැත්රජහු විසින් දිවිහිම් කොට සිහි කරණුවට නිසි වේ. කවර තුණෙක යත්: මහණෙනි, යම් පෙදෙසෙක්හි මුදුනෙහි බිසෙස් කළ කැත් රජ උපන්නේ වේ ද, මහණෙනි, මෙය මුදුනෙහි බිසෙස් කළ කැත් රජහු විසින් දිවිහිම් කොට සිහි කටයුතු පළමු වන කරුණ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තවද මහණෙනි, යම් පෙදෙසෙක දී මුදුනෙහි බිසෙස් කළ කැත් රජ බිසෙස් කෙළේ වේ ද, මහණෙනි, මෙය මුදුනෙහි බිසෙස් කළ කැත් රජහු විසින් දිවිහිම් කොට සිහි කටයුතු දෙවෙනි කරුණ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තවද මහණෙනි, යම් පෙදෙසෙක්හි දී මුදුනෙහි බිසෙස් කළ කැත් රජ සඞ්ග්‍රාමය දිනා, දිනු සඞ්ග්‍රාම ඇත්තේ, එම සඞ්ග්‍රාම ස්ථානය (කඳවුරු) අභිභවා වෙසේ ද, මහණෙනි, මේ මුදුනෙහි බිසෙස් කළ කැත් රජහු විසින් දිවි හිමියෙන් සිහි කටයුතු තෙවෙනි කරුණ වේ. මහණෙනි, මේ මුදුනෙහි බිසෙස් කළ කැත් රජහු විසින් දිවිහිමියෙන් සිහි කරණුවට නිසි කරුණු තුණ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එසෙයින් ම මහණහු විසින් (දිවිහිම්) කොට සිහි කරණුවට නිසි මේ කරුණු තුණෙක් වේ. කවර කරුණු තුණෙක යත්: මහණෙනි, යම් පෙදෙසක දී මහණ තෙමේ කෙහෙරවුලු බා කසාවත් හැඳ පෙරෙව ගිහිගෙන් නික්ම සසුන් වන්නේ වේ ද, මහණෙනි, මෙය දිවිහිමියෙන් මහණහු විසින් සිහිකටයුතු පළමු වන කරුණය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 206,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ යස්මිං පදෙසෙ භික්ඛු ඉදං දුක්ඛන්ති යථාභූතං පජානාති, අයං දුක්ඛසමුදයොති යථාභූතං පජානාති, අයං දුක්ඛනිරොධොති යථාභූතං පජානාති, අයං __දුක්ඛනිරොධගාමිනී__ පටිපදාති යථාභූතං පජානාති. ඉදං භික්ඛවෙ දුතියං භික්ඛුස්ස යාවජීවං සාරාණීයං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ යස්මිං පදෙසෙ භික්ඛු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති. ඉදං භික්ඛවෙ තතියං භික්ඛුස්ස යාවජීවං සාරාණීයං හොති. ඉමානි ඛො භික්ඛවෙ තීණි භික්ඛුස්ස යාවජීවං සාරාණීයානි භවන්තීති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 3.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "13. තයොමෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ තයො: නිරාසො ආසංසො විගතාසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පුග්ගලො නිරාසො: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො නීචෙ කුලෙ පච්චාජාතො හොති, චණ්ඩාලකුලෙ වා නෙසාදකුලෙ වා වෙණකුලෙ වා රථකාරකුලෙ වා පුක්කුසකුලෙ වා දලිද්දෙ අප්පන්නපානභොජනෙ කසිරවුත්තිකෙ, යත්ථ කසිරෙන ඝාසච්ඡාදො ලබ්භති. සො ච හොති, දුබ්බණ්ණො දුද්දසිකො ඔකොටිමකො බව්හාබාධො{1} කාණො වා කුණී වා ඛඤ්ජො වා පක්ඛහතො වා, න ලාභී අන්නස්ස පානස්ස වත්ථස්ස යානස්ස මාලාගන්ධවිලෙපනස්ස සෙය්යාවසථපදීපෙය්යස්ස. සො සුණාති, ඉත්ථන්නාමො කිර ඛත්තියො ඛත්තියෙහි ඛත්තියාභිසෙකෙන අභිසිත්තොති. තස්ස න එවං හොති : කුදස්සු නාම මමම්පි{2} ඛත්තියා ඛත්තියාභිසෙකෙන අභිසිඤ්චිස්සන්තීති. අයං වුච්චති භික්ඛවෙ පුග්ගලො නිරාසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පුග්ගලො ආසංසො. ඉධ භික්ඛවෙ රඤ්ඤො ඛත්තියස්ස මුද්ධාවසිත්තස්ස ජෙට්ඨො පුත්තො හොති, ආභිසෙකො අනභිසිත්තො මචලප්පත්තො. සො සුණාති, ඉත්ථන්නාමො කිර ඛත්තියො ඛත්තියෙහි ඛත්තියාභිසෙකෙන අභිසිත්තොති. තස්ස එවං හොති : කුදස්සු{3} නාම මමම්පි ඛත්තියා ඛත්තියාභිසෙකෙන අභිසිඤ්චිස්සන්තීති. අයං වුච්චති භික්ඛවෙ පුග්ගලො ආසංසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පුග්ගලො විගතාසො: ඉධ භික්ඛවෙ රාජා හොති, ඛත්තියො මුද්ධාවසිත්තො. සො සුණාති : ඉත්ථන්නාමො කිර ඛත්තියො ඛත්තියෙහි ඛත්තියාභිසෙකෙන අභිසිත්තොති. තස්ස න එවං හොති : කුදස්සු{3} නාම මමම්පි{2} ඛත්තියා ඛත්තියාභිසෙකෙන අභිසිඤ්චිස්සන්තීති. තං කිස්ස හෙතු: යා හිස්ස භික්ඛවෙ පුබ්බෙ අනභිසිත්තස්ස ආභිසෙකාසා සාස්ස පටිප්පස්සද්ධා. අයං වුච්චති භික්ඛවෙ පුග්ගලො විගතාසො. ඉමෙ ඛො භික්ඛවෙ තයො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. බහ්වාබාධො - ස්යා. කං. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. මමපි - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. කුදාස්සු නාම - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "තවද මහණෙනි, යම් පෙදෙසෙක්හි දී මහණ ‘මෙය දුකැ’යි තත් වූ පරිද්දෙන් දැනගණී ද, ‘මෙය දුක ඉපදීමට හෙතු යැ’යි තත් වූ පරිද්දෙන් දැනගණී ද, ‘මෙය දුඃඛනිරොධයැ’යි තත් වූ පරිද්දෙන් දැනගණී ද, ‘මෙය දුඃඛ නිරොධයට යන මාර්‍ගයැ’ යි තත් වූ පරිද්දෙන් දැනගණී ද, මහණෙනි, මෙය මහණහු විසින් දිවිහිමියෙන් සිහි කටයුතු දෙවැනි කරුණ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තවද මහණෙනි, මහණ යම් පෙදෙසෙක්හි දී ආස්‍රවක්‍ෂයෙන් ආස්‍රවරහිත වූ ඵලසමාධිය ද ඵලප්‍රඥාව ද දිටුදැමියෙහි තෙමේ ම විශිෂ්ටඥානයෙන් දැන පසක් කොට එය ලැබගෙණ වාසය කරයි ද, මහණෙනි, මෙය මහණහු විසින් දිවිහිමියෙන් මෙනෙහි කටයුතු තෙවැනි කරුණ ය. මහණෙනි, මේ මහණහු විසින් දිවිහිමියෙන් මෙනෙහි කටයුතු කරුණු තුණයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 3.",
                        "level": 1
                    },
                    {
                        "text": "13. මහණෙනි, මේ පුද්ගලයෝ තුන්දෙනෙක් ලොව්හි විද්‍යාමාන වෙත්. කවර තුන්දෙනෙක යත්: නිරාශය, ආශංසය, විගතාශ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, නිරාශ පුද්ගල තෙමේ කවරේය යත්: මහණෙනි, මෙ ලොව්හි ඇතැම් පුද්ගලයෙක් දිළිඳු වූ ස්වල්ප ආහාරපාන භොජන ඇති දුක්දිවෙල් ඇති, දුකසේ ආහාර වස්ත්‍ර ලබන, සැඬල් කුලයෙහි වේව යි වැදි කුලයෙක වේව යි, කුලුපොතු කුලයෙහි වේව යි, සොම්මර කුලයෙහි වේව යි, පුප්සඬු කුලයෙහි වේව යි, නීචකුලයෙක උපන්නේ වෙයි. හෙතෙමේ ද දුර්‍වර්‍ණ වූ අප්‍රියදර්‍ශන ඇති ලකුණ්ටක වූ බොහෝ ආබාධ ඇති කණෙක් හෝ අත් කොරෙක් හෝ පා කොරෙක් හෝ පිළෙක් හෝ වෙයි. ආහාර පාන වස්ත්‍ර යාන මාලා ගන්‍ධ විලෙපන ශයනාවාස ප්‍රදීපොපකරණ නො ලබන්නෙක් වෙයි. හෙ තෙමේ අසෝ ක්‍ෂත්‍රිය තෙමේ ක්‍ෂත්‍රියයන් විසින් ක්‍ෂත්‍රියාභිෂෙකයෙන් බිසෙස් කරණ ලදැයි අසා. ඔහුට “කවර නම් දිනෙක ක්‍ෂත්‍රියයෝ මා ක්‍ෂත්‍රියාභිෂේකයෙන් අභිසෙස් කරන්නාහු දෝ!” යි මෙසේ සිතෙක් නො වෙයි. මහණෙනි, මේ පුද්ගල තෙමේ නිරාශ යැ යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ආශංස පුද්ගල තෙමේ කවරේය යත්: මහණෙනි, මෙ ලොව්හි ශීර්‍ෂාභිෂික්ත වූ ක්‍ෂත්‍රිය රජක්හුගේ අභිෂේකයට යෝග්‍ය වූ අචලප්‍රාප්ත වූ අනභික්‍ෂික්ත වූ දෙටු පුතෙක් වේ හෙ තෙමේ අසෝ කැත් ක්‍ෂත්‍රියයන් විසින් ක්‍ෂත්‍රියාභිෂෙකයෙන් අභිෂික්තයයි අසා, “ක්‍ෂත්‍රියයෝ කවර නම් දිනෙක මාත් ක්‍ෂත්‍රියාභිෂේකයෙන් බිසෙස් කරන්නාහු දෝ!” යි ඔහුට මෙසේ සිතෙක් වෙයි. මහණෙනි, මේ පුද්ගල තෙමේ ආශංසය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, විගතාශ පුද්ගල තෙමේ කවරේය යත්: මහණෙනි, මෙ ලොව්හි ශීර්‍ෂාභිෂික්ත වූ ක්‍ෂත්‍රිය රජෙක් වේ. හේ මෙනම් “ක්‍ෂත්‍රිය තෙමේ ක්‍ෂත්‍රියයන් විසින් ක්‍ෂත්‍රියාභිෂේකයෙන් අභිෂික්තය”යි අසා, ඔහුට “කවර නම් දිනෙක ක්‍ෂත්‍රියයෝ මාත් ක්‍ෂත්‍රියාභිෂෙකයෙන් බිසෙස් කරන්නාහු දෝ!” යි මෙසේ සිතෙක් නො වෙයි. ඒ කවර හෙයින යත්: මහණෙනි, අනභිෂික්ත වූ ඔහුට පෙර යම් අභිෂෙකාශායෙක් වී ද, ඔහුගේ ඒ ආශාව සංහිඳින. මහණෙනි, මේ පුද්ගල තෙමේ විගතාශයී කියනු ලැබේ. මහණෙනි, මේ පුද්ගලයෝ තිදෙන ලොව්හි විද්‍යමාන වෙති.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 208,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ තයො පුග්ගලා සන්තො සංවිජ්ජමානා භික්ඛූසු. කතමෙ තයො: නිරාසො ආසංසො විගතාසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පුග්ගලො නිරාසො. ඉධ භික්ඛවෙ එකච්චො පුග්ගලො දුස්සීලො හොති, පාපධම්මො අසුචී සංකස්සරසමාචාරො පටිච්ඡන්නකම්මන්තො අස්සමණො සමණපටිඤ්ඤො අබ්රහ්මචාරී බ්රහ්මචාරීපටිඤ්ඤො අන්තොපූති අවස්සුතො කසම්බුජාතො. සො සුණාති: ඉත්ථන්නාමො කිර භික්ඛු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතීති. තස්ස න එවං හොති: කුදස්සු{1} නාම අහම්පි ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරිස්සාමීති. අයං වුච්චති භික්ඛවෙ පුග්ගලො නිරාසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පුග්ගලො ආසංසො: ඉධ භික්ඛවෙ භික්ඛු සීලවා හොති, කල්යාණධම්මො. සො සුණාති: ඉත්ථන්නාමො කිර භික්ඛු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතීති. තස්ස එවං හොති: කුදස්සු{2} නාම අහම්පි ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරිස්සාමීති. අයං වුච්චති භික්ඛවෙ පුග්ගලො ආසංසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පුග්ගලො විගතාසො: ඉධ භික්ඛවෙ භික්ඛු අරහං හොති ඛීණාසවො. සො සුණාති: ඉත්ථන්නාමො කිර භික්ඛු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතීති. තස්ස න එවං හොති: කුදස්සු{2} නාම අහම්පි ආසවානං ඛයා -පෙ- සච්ඡිකත්වා උපසම්පජ්ජ විහරිස්සාමීති. තං කිස්ස හෙතු: යා හිස්ස භික්ඛවෙ පුබ්බෙ අවිමුත්තස්ස විමුත්තාසා, සාස්ස{4} පටිප්පස්සද්ධා. අයං වුච්චති භික්ඛවෙ පුග්ගලො විගතාසො. ඉමෙ ඛො භික්ඛවෙ තයො පුග්ගලා සන්තො සංවිජ්ජමානා භික්ඛූසූති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 4.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "14. යොපි සො භික්ඛවෙ රාජා චක්කවත්තී ධම්මිකො ධම්මරාජා. සොපි{5} න අරාජකං චක්කං වත්තෙතීති. එවං වුත්තෙ අඤ්ඤතරො භික්ඛු භගවන්තං එතදවොච : කො පන භන්තෙ රඤ්ඤො චක්කවත්තිස්ස ධම්මිකස්ස ධම්මරඤ්ඤො රාජාති? ධම්මො භික්ඛූති, භගවා අවොච. ඉධ භික්ඛු රාජා චක්කවත්තී ධම්මිකො ධම්මරාජා ධම්මංයෙව නිස්සාය ධම්මං සක්කරොන්තො ධම්මං ගරුකරොන්තො ධම්මං අපචායමානො ධම්මද්ධජො ධම්මකෙතු ධම්මාධිපතෙය්යො ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහති අන්නො ජනස්මිං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කුදාස්සු නාම - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. කුදාස්සු නාම - මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "4. සා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. සොපි නාම - ස්යා. PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, එපරිද්දෙන් ම මේ පුද්ගලයෝ තුන්දෙනෙක් භික්‍ෂූන් අතර විද්‍යමාන වෙති. කවර තුන්දෙනෙක යත්: නිරාශය, ආශංසය, විගතාශ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "මහණෙනි, නිරාශපුද්ගල තෙමේ කවරේය යත්: මහණෙනි, මෙසස්නෙහි ඇතැම් පුද්ගලයෙක් ලාමක ස්වභාව ඇත්තේ අපිරිසිදු වූ කායකර්‍මාදිය ඇත්තේ, සැකයෙන් සිහිකටයුතු හැසිරීම් ඇත්තේ, පිළිසන් කර්‍ම ඇත්තේ ශ්‍රමණ ප්‍රතිරූපක වැ “ශ්‍රමණයෙමි” යි ප්‍රතිඥා කරන්නේ බ්‍රහ්මචාරී ප්‍රතිරූපක වැ “බඹසැරිමි”යී පිළින කරන්නේ ඇතුළත දුගඳ ඇතියේ රාගාදියෙන් තෙත් වූයේ හටගත් කෙලෙස් කසළ ඇත්තේ දුශ්ශීල වෙයි. හෙ තෙමේ “මේනම් භික්‍ෂු තෙම ආස්‍රවයන් ක්‍ෂය කිරීමෙන් ආස්‍රවරහිත වූ ඵලසමාධිය හා ඵලප්‍රඥා හා දිටුදැම්හි තෙමේ ම විශිෂ්ටඥානයෙන් දැන පසක් කොට ලැබගෙණ වෙසේ ලැ යි අසා ද, ඔහුට මෙබඳු සිතෙක් නො වෙයි. “කවර නම් දිනෙක මමත් ආස්‍රවයන්ගේ ක්‍ෂයයෙන් ආස්‍රවරහිත වූ ඵලසමාධිය හා ඵලප්‍රඥාව හා ඉහාත්මයෙහි ම තෙමේ විශිෂ්ටඥානයෙන් දැන පසක් කොට ලැබැ වසන්නෙම් දෝ!”යි මෙබඳු සිතෙක් නො වේ. මහණෙනි, මෙ තෙම නිරාශ පුද්ගල යැ යි කියනු ලැබේ."
                    },
                    {
                        "text": "මහණෙනි, ආශංස පුද්ගල තෙමේ කවරේය යත්: මහණෙනි, මේ ශාසනයෙහි මහණෙක් සිල් ඇත්තේ, කලණදහම් ඇත්තේ වේ. “මෙ නම් භික්‍ෂු තෙම ආස්‍රවයන්ගේ ක්‍ෂය කිරීමෙන් ආස්‍රවරහිත වූ ඵලසමාධිය හා ඵලප්‍රඥාව හා ඉහාත්මයෙහි ම තෙමේ විශිෂ්ටඥානයෙන් දැන පසක් කොට සපයාගෙණ වෙසේ ලැ යී හෙතෙම අසා ද, ඔහුට “කවර නම් දිනෙක මමත් ආස්‍රවක්‍ෂයයෙන් අනාශ්‍රව වූ ඵලසමාධියත් ඵලප්‍රඥාවත් මේ අත්බව්හි ම තෙමේ විශිෂ්ටඥානයෙන් දැන පසක් කොට ලැබ වසන්නෙම් දෝ!”යි මෙබඳු සිතෙක් වේ. මහණෙනි, මෙතෙම ආශංස පුද්ගල ය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, විගතාශ පුද්ගල තෙමේ කවරේය යත්: මහණෙනි, මේ ශාසනයෙහි මහණෙක් අර්‍හත් වූයේ ක්‍ෂය කළ ආශ්‍රව ඇත්තේ වේ ද, “මෙනම් භික්‍ෂු තෙම ආස්‍රවයන්ගේ ක්‍ෂයයෙන් ආස්‍රවරහිත වූ ඵලසමාධිය හා ඵලප්‍රඥාව හා ඉහාත්මයෙහි ම තෙමේ විශිෂ්ට ඥානයෙන් දැන පසක් කොට සපයා වෙසේ ලැ යි අසා ද, ඔහුට “කවර නම් දිනෙක මමත් ආශ්‍රවයන්ගේ ක්‍ෂයයෙන් ... පසක් කොට ඊට පැමිණ වෙසෙම්දෝ!”යී (මෙබඳු) සිතෙක් නො වෙයි. ඒ කවර හෙයින යත්: මහණෙනි, පෙර ම කෙලෙසුන්ගෙන් නොමිදුනා වූ ඔහුගේ යම් විමුක්තියෙහි ආශායෙක් වී ද ඒ ආශා තොමෝ ඔහුට සංහුන. මහණෙනි, මේ විගතාශපුද්ගලයැ යි කියනු ලැබේ. මහණෙනි, මේ පුද්ගලයෝ තිදෙනා භික්‍ෂූන් අතරෙහි විද්‍යමාන වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 4.",
                        "level": 1
                    },
                    {
                        "text": "14. මහණෙනි, යම් ඒ දැහැමි වූ ධර්‍මරාජන් වූ සක්විතිරජෙක් වේ ද, හෙ ද රජකුගෙන් තොර වූ අණසක නො පවත්වයි. මෙසේ වදාළ කල්හි එක්තරා මහණෙක් “භාග්‍යවතුන් වහන්සේට වහන්ස, දැහැමි වූ ධර්‍මරාජන් වූ සක්විති රජකුහට කවර නම් රජෙක් වේ දැ” යි මෙය කීය. මහණ, ධර්‍මය වේයැ යි භාග්‍යවතුන් වහන්සේ වදාළ සේක. මහණ, මෙලොව්හි දැහැමි වූ ධර්‍මරාජන් වූ සක්විතිරජ තෙමේ ධර්‍මය ම ආශ්‍රය කොට ධර්‍මයට සත්කාර කරමින් ධර්‍මයට ගරු කරමින් ධර්‍මය පුදමින් ධර්‍මය ධ්වජ කොට ඇත්තේ ධර්‍මය කෙතු කොට ඇත්තේ ධර්‍මාධිපත්‍යය ඇත්තේ ධාර්මික වූ රකවල් ඇතුළත් ජනයා කෙරෙහි යොදයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 210,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛු රාජා චක්කවත්තී ධම්මිකො ධම්මරාජා ධම්මංයෙව නිස්සාය ධම්මං සක්කරොන්තො ධම්මං ගරුකරොන්තො ධම්මං අපචායමානො ධම්මද්ධජො ධම්මකෙතු ධම්මාධිපතෙය්යො ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහති ඛත්තියෙසු අනුයුත්තෙසු{1} බලකායස්මිං බ්රාහ්මණගහපතිකෙසු, නෙගමජානපදෙසු, සමණබ්රාහ්මණෙසු, මිගපක්ඛීසු. ස ඛො සො භික්ඛු රාජා චක්කවත්තී ධම්මිකො ධම්මරාජා ධම්මඤ්ඤෙව නිස්සාය ධම්මං සක්කරොන්තො ධම්මං ගරුකරොන්තො ධම්මං අපචායමානො ධම්මද්ධජො ධම්මකෙතු ධම්මාධිපතෙය්යො ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහිත්වා අන්තොජනස්මිං, ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහිත්වා ඛත්තියෙසු අනුයුත්තෙසු බලකායස්මිං බ්රාහ්මණගහපතිකෙසු නෙගමජානපදෙසු සමණබ්රාහ්මණෙසු මිගපක්ඛීසු ධම්මෙනෙව චක්කං වත්තෙති. තං හොති චක්කං අප්පතිවත්තියං කෙනචි මනුස්සභූතෙන පච්චත්ථිකෙන පාණිනා."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛු තථාගතො අරහං සම්මාසම්බුද්ධො ධම්මිකො ධම්මරාජා ධම්මං යෙව නිස්සාය ධම්මං සක්කරොන්තො ධම්මං ගරුකරොන්තො ධම්මං අපචායමානො ධම්මද්ධජො ධම්මකෙතු ධම්මාධිපතෙය්යො ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහති කායකම්මස්මිං, එවරූපං කායකම්මං සෙවිතබ්බං, එවරූපං කායකම්මං න සෙවිතබ්බන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛු තථාගතො අරහං සම්මාසම්බුද්ධො ධම්මිකො ධම්මරාජා ධම්මංයෙව නිස්සාය ධම්මං සක්කරොන්තො ධම්මං ගරුකරොන්තො ධම්මං අපචායමානො ධම්මද්ධජො ධම්මකෙතු ධම්මාධිපතෙය්යො ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහති වචීකම්මස්මිං, එවරූපං වචීකම්මං සෙවිතබ්බං, එවරූපං වචීකම්මං න සෙවිතබ්බන්ති. -පෙ- මනොකම්මස්මිං, එවරූපං මනොකම්මං සෙවිතබ්බං, එවරූපං මනොකම්මං න සෙවිතබ්බන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ස ඛො සො භික්ඛු තථාගතො අරහං සම්මාසම්බුද්ධො ධම්මිකො ධම්මරාජා ධම්මංයෙව නිස්සාය ධම්මං සක්කරොන්තො ධම්මං ගරුකරොන්තො ධම්මං අපචායමානො ධම්මද්ධජො ධම්මකෙතු ධම්මාධිපතෙය්යො ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහිත්වා කායකම්මස්මිං, ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහිත්වා වචීකම්මස්මිං, ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහිත්වා මනොකම්මස්මිං, ධම්මෙනෙව අනුත්තරං ධම්මචක්කං පවත්තෙති. තං හොති චක්කං අප්පතිවත්තියං සමණෙන වා බ්රාහ්මණෙන වා දෙවෙන වා මාරෙන වා බ්රහ්මුනා වා කෙනචි වා ලොකස්මින්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අනුයන්තෙසු - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "තවද මහණ, දැහැමි වූ ධර්‍මරාජන් වූ සක්විතිරජ තෙමේ ධර්‍මය ම ආශ්‍රය කොට ධර්‍මයට ම සත්කාර කරන්නේ ධර්‍මය ම ගරු කරන්නේ ධර්‍මය ම පුදන්නේ ධර්‍මය ම ධ්වජ කොට ඇත්තේ ධර්‍මය ම කේතු කොට ඇත්තේ ධර්‍මාධිපත්‍යය ඇත්තේ අනුයුක්ත වූ ක්‍ෂත්‍රියයන් කෙරෙහි ද, බලසෙනඟ කෙරෙහි ද, බමුණුගැහැවියන් කෙරෙහි ද, නියම්ගම් දනවු වැස්සන් කෙරෙහි ද, මහණබමුණන් කෙරෙහි ද, මෘගපක්‍ෂීන් කෙරෙහි ද, ධාර්මික වූ රක්‍ෂාවරණ ගුප්තිය පණවයි. මහණ, ඒ දැහැමි වූ ධර්‍මරාජන් වූ සක්විතිරජ ධර්‍මය ම ආශ්‍රය කොට, ධර්‍මයට ම සත්කාර කරන්නේ, ධර්‍මය ම ගරු කරන්නේ, ධර්‍මය ම පුදන්නේ, ධර්‍මය ධ්වජ කොට ඇත්තේ, ධර්‍මය කේතු කොට ඇත්තේ, ධර්‍මාධිපත්‍යය ඇත්තේ අභ්‍යන්තර ජනයා කෙරෙහි ධාර්මික වූ රක්‍ෂාවරණ ගුප්තිය යොදා අනුයුක්ත වූ ක්‍ෂත්‍රියයන් කෙරෙහි ද, බලසෙනඟ කෙරෙහි ද, බමුණු ගැහැවියන් කෙරෙහි ද, නියම්ගම් දනවු වැස්සන් කෙරෙහි ද, මහණ බමුණන් කෙරෙහි ද, මෘගපක්‍ෂීන් කෙරෙහි ද, ධාර්මික වූ රක්‍ෂාවරණ ගුප්තිය යොදා දැහැමින් ම අණසක පණවයි ද, ඒ අණසක මනුෂ්‍ය වූ පසමිතුරු වූ කිසියම් ප්‍රාණියකු විසින් නොවැළැහිය හැකි වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිද්දෙන් ම දැහැමි වූ අර්‍හත් වූ ධර්‍මරාජන් වූ සම්‍යක් සම්බුද්ධ වූ තථාගතයන් වහන්සේ ධර්‍මය ම ආශ්‍රය කොට ධර්‍මයට ම සත්කාර කරණ සේක් ධර්‍මය ම ගරු කරණ සේක් ධර්‍මය ම පුදන සේක් ධර්‍මය ම ධ්වජ කොට ඇති සේක් ධර්‍මය ම කේතු කොට ඇති සේක් ධර්‍මාධිපත්‍යය ඇති සේක් මෙබඳු වූ කායකර්‍මය සෙවිය යුතුය යි ද, මෙබඳු වූ කායකර්‍මය නො සෙවිය යුතුයැ යි ද, කායකර්‍ම විෂයෙහි ලා ධාර්මික වූ රක්‍ෂාවරණගුප්තිය වදාරණ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, තවද දැහැමි වූ ධර්‍මරාජන් වූ අර්‍හත් වූ සම්‍යක් සම්බුද්ධ වූ තථාගතයන් වහන්සේ ධර්‍මය ම ආශ්‍රය කොට ධර්‍මයට සත්කාර කරණ සේක් ධර්‍මය ගරු කරණ සේක් ධර්‍මය පුදන සේක් ධර්‍මය ධ්වජ කොට ඇති සේක් ධර්‍මය කේතු කොට ඇති සේක් ධර්‍මාධිපත්‍යය ඇති සේක් මෙබඳු වූ වාක්කර්‍මය සෙවිය යුතුයැ යි ද, මෙබඳු වූ වාක්කර්‍මය නො සෙවිය යුතුයැ යි ද, වාක්කර්‍ම විෂයෙහි දැහැමි වූ රක්‍ෂාවරණ ගුප්තිය පණවන සේක … මෙබඳු වූ මනඃකර්‍මය සෙවිය යුතුය, මෙබඳු වූ මනඃකර්‍මය නො සෙවිය යුතුයැ යි ද මනඃකර්‍මවිෂයෙහි දැහැමි වූ රක්‍ෂාවරණ ගුප්තිය පණවන සේක.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, දැහැමි වූ ධර්‍මරාජන් වූ අර්‍හත් වූ සම්‍යක් සම්බුද්ධ වූ ඒ තථාගතයන් වහන්සේ ධර්‍මයට සත්කාර කරණ සේක් ධර්‍මය ගරු කරණ සේක් ධර්‍මය පුදන සේක් ධර්‍මය ධ්වජ කොට ඇති සේක් ධර්‍මය කේතු කොට ඇති සේක් ධර්‍මාධිපත්‍යය ඇති සේක් කායකර්‍ම විෂයයෙහි ධාර්මික වූ රක්‍ෂාවරණ ගුප්තිය පණවා, වාක්කර්‍ම විෂයයෙහි ධාර්මික වූ රක්‍ෂාවරණ ගුප්තිය පණවා, මනඃකර්‍ම විෂයයෙහි ධාර්මික වූ රක්‍ෂාවරණ ගුප්තිය පණවා, දැහැමින් ම නිරුත්තර වූ ධර්‍මචක්‍රය පවත්වන සේක් ද, ඒ ධර්‍මචක්‍රය වනාහි ලොව්හි ශ්‍රමණ වූ හෝ බ්‍රාහ්මණ වූ හෝ දෙව වූ හෝ බ්‍රහ්ම වූ හෝ ලොව්හි කිසිවකු විසිනුත් නො වැළැහිය හැක්කේ වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 212,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 5.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "15. එකං සමයං භගවා **බාරාණසියං **විහරති **ඉසිපතනෙ **මිගදායෙ. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි භික්ඛවොති. භදන්තෙති තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "භූතපුබ්බං භික්ඛවෙ රාජා අහොසි **පචෙතනො **නාම. අථ ඛො භික්ඛවෙ රාජා පචෙතනො{1} රථකාරං ආමන්තෙසි : ඉතො මෙ සම්ම රථකාර, ඡන්නං මාසානං අච්චයෙන සඞ්ගාමො භවිස්සති. සක්කසි{2} මෙ සම්ම රථකාර, නවං චක්කයුගං කාතුන්ති? සක්කොමි දෙවාති ඛො භික්ඛවෙ රථකාරො රඤ්ඤො පචෙතනස්ස පච්චස්සොසි. අථ ඛො භික්ඛවෙ රථකාරො ඡහි මාසෙහි ඡාරත්තූනෙහි එකං චක්කං නිට්ඨාපෙසි. අථ ඛො භික්ඛවෙ රාජා පචෙතනො රථකාරං ආමන්තෙසි: ඉතො මෙ සම්ම රථකාර, ඡන්නං දිවසානං අච්චයෙන සඞ්ගාමො භවිස්සති නිට්ඨිතං තෙ{3} නවං චක්කයුගන්ති. ඉමෙහි ඛො දෙව ඡහි මාසෙහි ඡාරත්තූනෙහි එකං චක්කං නිට්ඨිතන්ති. සක්කසි පන මෙ සම්ම රථකාර, ඉමෙහි ඡහි දිවසෙහි දුතියං චක්කං නිට්ඨාපෙතුන්ති? සක්කොමි දෙවාති ඛො භික්ඛවෙ රථකාරො ඡහි දිවසෙහි දුතියං චක්කං නිට්ඨාපෙත්වා නවං චක්කයුගං ආදාය යෙන රාජා පචෙතනො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා රාජානං පචෙතනං එතදවොච: ඉදන්තෙ දෙව නවං චක්කයුගං නිට්ඨිතන්ති. යඤ්ච තෙ ඉදං සම්ම රථකාර, චක්කං ඡහි මාසෙහි නිට්ඨිතං ඡාරත්තූනෙහි, යඤ්ච තෙ ඉදං චක්කං ඡහි දිවසෙහි නිට්ඨිතං. ඉමෙසං කිං නානාකරණං නෙසාහං{4} කිඤ්චි නානාකරණං පස්සාමීති. අත්ථෙවෙසං දෙව නානාකරණං, පස්සතු දෙවො නානාකරණන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භික්ඛවෙ රථකාරො යං තං චක්කං ඡහි දිවසෙහි නිට්ඨිතං, තං පවත්තෙසි. තං පවත්තිතං සමානං යාවතිකා අභිසඞ්ඛාරස්ස ගති, තාවතිකං ගන්ත්වා චිඞ්ගුලායිත්වා භූමියං පපති. යං පන තං චක්කං ඡහි මාසෙහි නිට්ඨිතං ඡාරත්තූනෙහි තං පවත්තෙසි. තං පවත්තිතං සමානං යාවතිකා අභිසඞ්ඛාරස්ස ගති, තාවතිකං ගන්ත්වා අක්ඛාහතං මඤ්ඤෙ අට්ඨාසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කො නු ඛො සම්ම රථකාර, හෙතු කො පච්චයො. යමිදං චක්කං ඡහි දිවසෙහි නිට්ඨිතං, තං පවත්තිතං සමානං යාවතිකා අභිසඞ්ඛාරස්ස ගති, තාවතිකං ගන්ත්වා චිඞ්ගුලායිත්වා භූමියං පපති? කො පන සම්ම රථකාර, හෙතු, කො පච්චයො? යමිදං චක්කං ඡහි මාසෙහි නිට්ඨිතං ඡාරත්තූනෙහි, තං පවත්තිතං සමානං යාවතිකා අභිසඞ්ඛාරස්ස ගති, තාවතිකං ගන්ත්වා අක්ඛාහතං මඤ්ඤෙ අට්ඨාසීති? යමිදං දෙව, චක්කං ඡහි දිවසෙහි නිට්ඨිතං. තස්ස නෙමීපි සවඞ්කා සදොසා සකසාවා. අරාපි සවඞ්කා සදොසා සකසාවා. නාභීපි සවඞ්කා සදොසා සකසාවා. තං නෙමියාපි සවඞ්කත්තා සදොසත්තා සකසාවත්තා, අරානම්පි සවඞ්කත්තා සදොසත්තා සකසාවත්තා, නාභියාපි සවඞ්කත්තා සදොසත්තා සකසාවත්තා පවත්තිතං සමානං යාවතිකා අභිසඞ්ඛාරස්ස ගති, තාවතිකං ගන්ත්වා චිඞ්ගුලායිත්වා භූමියං පපති. යං පන තං දෙව චක්කං ඡහි මාසෙහි නිට්ඨිතං ඡාරත්තූනෙහි. තස්ස නෙමීපි අවඞ්කා අදොසා අකසාවා. අරාපි අවඞ්කා අදොසා අකසාවා. නාභීපි අවඞ්කා අදොසා අකසාවා. තං නෙමියාපි අවඞ්කත්තා අදොසත්තා අකසාවත්තා, අරානම්පි අවඞ්කත්තා අදොසත්තා අකසාවත්තා, නාභියාපි අවඞ්කත්තා අදොසත්තා අකසාවත්තා පවත්තිතං සමානං යාවතිකා අභිසඞ්ඛාරස්ස ගති. තාවතිකං ගන්ත්වා අක්ඛාහතං මඤ්ඤෙ අට්ඨාසීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සචෙතනො නාම - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සක්ඛසි කත්ථචි - සක්ඛිස්සසි - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. නිට්ඨිතං - මඡසං. ස්යා. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "4. නාහං - සීමු. නෙසං නාහං - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 5.",
                        "level": 1
                    },
                    {
                        "text": "15. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ **බරණැස්නුවර ඉසිපතන **නම් වූ **මිගදාය**යෙහි වැඩවසන සේක. එහිදී භාග්‍යවතුන් වහන්සේ ‘මහණෙනි, යි’ භික්‍ෂූන් ඇමතූ සේක. ‘වහන්සැ’යී ඒ භික්‍ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වූහ. භාග්‍යවතුන් වහන්සේ තෙල වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, වූ විරියෙකි. **පචෙතන **නම් රජෙක් විය. මහණෙනි, ඉක්බිති පචෙතන රජ තෙම, “යහළු රථකාරය, මෙයින් සමසක් ඇවෑමෙන් මට යුද්ධයෙක් වන්නේ ය. යහළු රථකාරය, මට නව රියසක් යුවළක් කරන්නට හැක්කෙහි දැ”යි රියකරුවා ඇමතීය. මහණෙනි, “හැක්කෙමි දේවයෙනි”යි රියකරු පචෙතන රජහට පිළිවදන් ඇස්වීය. මහණෙනි, ඉක්බිත්තෙන් රථකාර තෙමේ සරැයක් අඩු සමසෙකින් එක් රියසකක් නිමැවීය. මහණෙනි, ඉක්බිත්තෙන් පචෙතන රජ තෙමේ, “යහළු රථකාරය, මෙයින් සදවසක් ඇවෑමෙන් මාගේ සඞ්ග්‍රාමය වන්නේය. තා විසින් නවසක්සඟළ නිමවන ලද දැයි රථකාරයා ඇමතීය. “දේවයිනි, සරැයක් හළ මේ සමසින් එක් රියසකෙක් නිමවන ලදැ”යි රියකරු කීය. “යහළු රථකාරය, මේ සදවසින් මාගේ දෙවන රියසක නිමවන්නට හැක්කෙහි ද?” “දෙවයිනි, හැක්කෙමැ” යි රථකාර තෙම පචෙතන රජුට පිළිවදන් ඇස්වීය. මහණෙනි, ඉක්බිති රථකාර තෙමේ සදවසෙකින් දෙවන රියසක නිමවා නවසක්යුවළ රැගෙණ පචෙතන රජු වෙත එළඹියේය. එළඹ පචෙතන රජහට “දේවයෙනි, මුබගේ මේ නවසක් යුවළ නිමවන ලදැ”යි මෙය පැවසීය. “යහළු රථකාරය, තා විසින් යම් මේ රියසකෙක් සරැයක් අඩු සමසෙකින් නිමවන ලද ද, තා විසින් යම් මේ රියසකෙක් සදවසෙකින් නිමවන ලද ද, මේ දෙකෙහි වෙනස කවරේ ය? මම කිසිදු වෙනසක් නො දකිමි” යි රජ කීය. “දේවයෙනි, මේ දෙක්හි වෙනස ඇත් ම ය. දේව තෙමේ වෙනස දකීවා” යි රියකරු කීය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඉක්බිත්තෙන් රථකාර තෙමේ යම් ඒ රියසකෙක් සදවසින් නිමවන ලද ද, එය පෙරළා හැරියේය. එය පෙරළා හරිණ ලද්දේ ම ප්‍රයොගයාගේ ගතිය යම්තාක් ද ඒතාක් ගොස් බමා බිම වැටුනේය. යම් ඒ රියසකෙක් සරැයක් අඩු සමසෙකින් නිමවන ලද ද එය පෙරළා හැරියේය. එය පෙරළා හරිණ ලද්දේ ම ප්‍රයොග ගතිය වහන තාක් ගොස් අකුරෙහි වැද තුබුවා සෙයින් සිටියේය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "“යහළු රථකාරය, යම් මේ රියසකෙක් සදවසින් නිමවන ලද ද, එය පෙරළා හරිණ ලද්දේ ම ප්‍රයොගයාගේ ගතිය වහන තාක් __ගොස් __බමා බිම වැටුනේ ද, එයට හෙතු කිම? එයට කරුණු කිම? යහළු රථකාරය, යම් මේ සකෙක් සරැයෙකින් අඩු සමසෙකින් නිමවන ලද ද, එය පෙරළා හරිණ ලද්දේ ම ප්‍රයොගයාගේ ගතිය වහන තාක් ගොස් අකුරෙහි වැද තුබුවා සෙයින් සිටියේ ද, එයට හෙතු කවරේ ය: එයට කරුණ කවරේය? දෙවයෙනි, යම් මේ රියසකෙක් සදවසෙකින් නිමවන ලද ද, එහි නිම්වළල්ල වක්වෙයි. සදොස් වෙයි. එලයෙන් යුක්ත වෙයි. දැවි ද වක් වෙයි. සදොස් වෙයි. එලයෙන් යුක්ත වෙයි. නැබ ද වක් වෙයි. සදොස් වෙයි. එලයෙන් යුක්ත වෙයි. නිම්වළල්ළෙහි වක්බැවින් ද සදොස් බැවින් ද එලයෙන් යුත් බැවින් ද දැවියෙහි වක් බැවින් ද සදොස් බැවින් ද එලයෙන් යුත් බැවින් ද නැබෙහි වක් බැවින් ද සදොස් බැවින් ද එලයෙන් යුත් බැවින් ද පෙරළා හරිණ ලද්දා වූ ම එය ප්‍රයොගයාගේ ගතිය යම්තාක් ද ඒ තාක් ගොස් බමා බිම වැටුනේ ය. දේවයෙනි, යම් ඒ රියසකෙක් සරැයක් අඩු සමසෙකින් නිමවන් ලද ද, එහි නිම් වළල්ල ද නො වක් වෙයි. නිදොස් වෙයි. එලයෙන් තොර වෙයි. (එහි) දැවිහු ද නො වක් වෙයි. නිදොස්හ. එලයෙන් තොරහ. නැබ ද නො වක්ය, නිදොස්ය, එලයෙන් තොරය, නිම් වළල්ලේ නොවක් බැවින් නිදොස් බැවින් එලයෙන් තොර බැවින් ද, දැවියෙහි නො වක් බැවින් නිදොස් බැවින් එලයෙන් තොර බැවින් ද පෙරළා හරිණ ලද්දා වූ ම එය ප්‍රයොගයාගේ ගතිය යම්තාක් ද ඒ තාක් ගොස් අකුරෙහි වැද තුබුවා සෙයින් සිටියේය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 214,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සියා ඛො පන භික්ඛවෙ තුම්හාකං එවමස්ස: අඤ්ඤො නූන තෙන සමයෙන සො රථකාරො අහොසීති. න ඛො පනෙතං භික්ඛවෙ එවං දට්ඨබ්බං. අහං තෙන සමයෙන සො රථකාරො අහොසිං. තදා පනාහං භික්ඛවෙ කුසලො දාරුවඞ්කානං දාරුදොසානං දාරුකසාවානං. එතරහි ඛො පනාහං භික්ඛවෙ අරහං සම්මාසම්බුද්ධො කුසලො කායවඞ්කානං කායදොසානං කායකසාවානං. කුසලො වචීවඞ්කානං වචීදොසානං වචීකසාවානං. කුසලො මනොවඞ්කානං මනොදොසානං මනොකසාවානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්ස කස්සචි භික්ඛවෙ භික්ඛුස්ස වා භික්ඛුනියා වා කායවඞ්කො අප්පහීනො කායදොසො කායකසාවො. වචීවඞ්කො අප්පහීනො වචීදොසො වචීකසාවො. මනොවඞ්කො අප්පහීනො මනොදොසො මනොකසාවො. එවං පපතිකා තෙ භික්ඛවෙ ඉමස්මා ධම්මවිනයා. සෙය්යථාපි තං චක්කං ඡහි දිවසෙහි නිට්ඨිතං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්ස කස්සචි භික්ඛවෙ භික්ඛුස්ස වා භික්ඛුනියා වා කායවඞ්කො පහීනො කායදොසො කායකසාවො. වචීවඞ්කො පහීනො වචීදොසො වචීකසාවො. මනොවඞ්කො පහීනො මනොදොසො මනොකසාවො. එවං පතිට්ඨිතා තෙ භික්ඛවෙ ඉමස්මිං ධම්මවිනයෙ. සෙය්යථාපි තං චක්කං ඡහි මාසෙහි නිට්ඨිතං ඡාරත්තූනෙහි."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්මාතිහ භික්ඛවෙ එවං සික්ඛිතබ්බං: කායවඞ්කං පජහිස්සාම, කායදොසං කායකසාවං. වචීවඞ්කං පජහිස්සාම, වචීදොසං වචීකසාවං. මනොවඞ්කං පජහිස්සාම, මනොදොසං මනොකසාවන්ති. එවං හි වො භික්ඛවෙ සික්ඛිතබ්බන්ති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 6.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "**(සාවත්ථිනිදානං:)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "16. තීහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො භික්ඛු අපණ්ණකතං{1} පටිපදං පටිපන්නො හොති, යොනි චස්ස ආරද්ධා හොති, ආසවානං ඛයාය. කතමෙහි තීහි: ඉධ භික්ඛවෙ භික්ඛු ඉන්ද්රියෙසු ගුත්තද්වාරො හොති, භොජනෙ මත්තඤ්ඤූ හොති, ජාගරියං අනුයුත්තො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු ඉන්ද්රියෙසු ගුත්තද්වාරො හොති: ඉධ භික්ඛවෙ භික්ඛු චක්ඛුනා රූපං දිස්වා න නිමිත්තග්ගාහී හොති නානුබ්යඤ්ජනග්ගාහී. යත්වාධිකරණ{2}මෙතං චක්ඛුන්ද්රියං අසංවුතං විහරන්තං අභිජ්ඣාදොමනස්සා පාපකා අකුසලා ධම්මා අන්වාස්සවෙය්යුං, තස්ස සංවරාය පටිපජ්ජති, රක්ඛති චක්ඛුන්ද්රියං, චක්ඛුන්ද්රියෙ සංවරං ආපජ්ජති. සොතෙන සද්දං සුත්වා - ඝාණෙන ගන්ධං ඝායිත්වා - ජිව්හාය රසං සායිත්වා - කායෙන ඵොට්ඨබ්බං ඵුසිත්වා - මනසා ධම්මං විඤ්ඤාය න නිමිත්තග්ගාහී හොති, නානුබ්යඤ්ජනග්ගාහී. යත්වාධිකරණමෙතං{2} මනින්ද්රියං අසංවුතං විහරන්තං අභිජ්ඣාදොමනස්සා පාපකා අකුසලා ධම්මා අන්වාස්සවෙය්යුං, තස්ස සංවරාය පටිපජ්ජති. රක්ඛති මනින්ද්රියං, මනින්ද්රියෙ සංවරං ආපජ්ජති. එවං ඛො භික්ඛවෙ භික්ඛු ඉන්ද්රියෙසු ගුත්තද්වාරො හොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අපණ්ණකපටිපදං - ස්යා. මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. යත්වාධිකරණාමෙතං - මඡසං. ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, එසමයෙහි ඒ රියකරු ඒකාන්තයෙන් අනෙකෙක් විය හැක්කැ යි තොපට මෙබඳු සිතෙක් විය හෙයි. මහණෙනි, මෙය මෙසේ නො දැක්ක යුතු ම ය. එ සමයෙහි මම ඒ රියකරු වීමි. මහණෙනි, මම වනාහි එකල දැව පිළිබඳ ඇදෙහි දැව පිළිබඳ දොස්හි දැව පිළිබඳ එලයෙහි නිපුණයෙකිම් වීමි. මහණෙනි, දැන් වනාහි මම අර්‍හත් සම්‍යක් සම්බුද්ධවූයෙම් කායවඞ්කයන්ගේ ද කායදොෂයන්ගේ ද කායකෂායයන්ගේ ද නිපුණයෙකිම් වෙමි. වාග්වඞ්කයන්ගේ ද වාග්දොෂයන්ගේ ද වාක්කෂායයන්ගේ ද නිපුණයෙකිම් වෙමි. මනොවඞ්කයන්ගේ ද මනොදොෂයන්ගේ ද මනඃකෂායයන්ගේ ද නිපුණයෙකිම් වෙමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම්කිසි මහණකුගේ හෝ මෙහෙණකගේ හෝ කායවඞ්කය කායදොෂය කායකෂායය ප්‍රහීණ නුවූයේ වේ ද, වාග්වඞ්කය වාග්දොෂය වාක්කෂාය ප්‍රහීණ නුවූයේ වේ ද, මනොවඞ්කය මනොදොෂය මනඃකෂාය ප්‍රහීණ නුවූයේ වේ ද, මහණෙනි, මෙසේ ඔහු මේ (ධර්‍මවිනයයෙන්) ශාසනයෙන් ගුණ හීනවීමෙන් වැටුනාහු වෙති. සදවසෙකින් නිමවන ලද ඒ රියසක යම්සේ වේ ද, එසේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම්කිසි මහණකුගේ හෝ මෙහෙණකගේ හෝ කායවඞ්කය කායදොෂය කායකෂායය ප්‍රහීණ වූයේ ද, වාග්වඞ්කය වාග්දොෂය වාක්කෂාය ප්‍රහීණ ද, මනොවඞ්කය මනොදොෂය මනඃකෂායය ප්‍රහීණ ද, මහණෙනි, මෙසේ වනාහි ඔහු මෙසස්නෙහි පිහිටියාහු වෙති. සරැයක් හළ සමසෙකින් නිමි ඒ රියසක යම්සේ වේ ද එසේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එහෙයින් කායවඞ්කය කායදොෂය කායකෂායය දුරලන්නම්හ. වාග්වඞ්කය වාග්දොෂය වාක්කෂායය දුරලන්නම්හ. මනොවඞ්කය මනොදොෂය මනඃකෂායය දුරලන්නම්හ යි මෙසේ හික්මිය යුතුයි. මහණෙනි, තොප විසින් මෙසේ ම හික්මිය යුතුයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 6.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "**(සැවැත්නිදානයි:)**"
                    },
                    {
                        "text": "16. මහණෙනි, ධර්‍ම තුණෙකින් සමන්වාගත භික්‍ෂු තෙම අවිරුද්ධ ප්‍රතිපත්තියට පිළිපන්නේ වෙයි. ඔහු විසින් ආස්‍රවයන්ගේ ක්‍ෂයය පිණිස කරුණ ද පටන්ගන්නා ලද්දේ වේ. කවර තුණෙකින යත්. මහණෙනි, මේ ශාසනයෙහි මහණ තෙම ඉන්‍ද්‍රියයන් විෂයයෙහි රක්නා ලද දොර ඇත්තේ වේ. භොජනයෙහි මාත්‍රඥ වේ. නිදිවැරීමෙහි යෙදුණේ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, භික්‍ෂු තෙම කෙසේ ඉන්‍ද්‍රිය විෂයයෙහි රක්නා ලද දොර ඇති වේ ද, මහණෙනි, මේ ශාසනයෙහි භික්‍ෂු තෙම ඇසින් රූපයක් දැක නිමිති වශයෙන් නො ගන්නේ වේ අනුබ්‍යඤ්ජන වශයෙන් නො ගන්නේ වේ. යම් කරුණෙකින් චක්‍ෂුරින්‍ද්‍රියය අසංවර කොට වාසය කරණ මේ පුද්ගලයා අභිධ්‍යා දෞර්‍මනස්‍ය නම් වූ ලාමක අකුශල ධර්‍මයෝ ලුහු බඳනාහු ද, ඒ චක්‍ෂුරින්‍ද්‍රියයාගේ සංවරය පිණිස පිළිපදනේ ය. චක්‍ෂුරින්‍ද්‍රියය රක්නේ ය. චක්‍ෂුරින්‍ද්‍රියයෙහි සංවරයට පැමිණෙන්නේ ය. කණින් ශබ්දයක් අසා ... නාසිකායෙන් ගඳක් ආඝ්‍රාණය කොට ... දිවෙන් රසයක් විඳ ... කයින් ස්ප්‍රෂ්ටව්‍යයක් ස්පර්‍ශ කොට ... සිතින් දහමක් දැන නිමිති වශයෙන් නොගන්නේ වේ ද, අනුබ්‍යඤ්ජන වශයෙන් නො ගන්නේ වේ ද, අභිධ්‍යා දෞර්‍මනස්‍ය නම් වූ ලාමක අකුශලධර්‍මයෝ තුමූ ම ඉන්‍ද්‍රිය සංවර කොට නොගෙණ වසන මේ පුඟුලා යම් හෙයෙකින් ලුහු බඳනාහු ද, ඒ මනින්‍ද්‍රියයාගේ සංවරය පිණිස පිළිපදියි. මනින්‍ද්‍රිය රකියි. මනින්‍ද්‍රියයෙහි සංවරයට පැමිණෙයි. මහණෙනි, මහණ තෙමේ මෙසේ ඉන්‍ද්‍රිය විෂයයෙහි වැසූ ද්වාර ඇති වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 216,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු භොජනෙ මත්තඤ්ඤූ හොති: ඉධ භික්ඛවෙ භික්ඛු පටිසඞ්ඛා යොනිසො ආහාරං ආහාරෙති, නෙව දවාය න මදාය න මණ්ඩනාය න විභූසනාය. යාවදෙව ඉමස්ස කායස්ස ඨිතියා යාපනාය විහිංසූපරතියා බ්රහ්මචරියානුග්ගහාය, ඉති පුරාණඤ්ච වෙදනං පටිහඞ්ඛාමි, නවඤ්ච වෙදනං න උප්පාදෙස්සාමි, යාත්රා ච මෙ භවිස්සති, අනවජ්ජතා ච ඵාසුවිහාරො චාති. එවං ඛො භික්ඛවෙ භික්ඛු භොජනෙ මත්තඤ්ඤූ හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු ජාගරියං අනුයුත්තො හොති: ඉධ භික්ඛවෙ භික්ඛු දිවසං චඞ්කමෙන නිසජ්ජාය ආවරණීයෙහි ධම්මෙහි චිත්තං පරිසොධෙති, රත්තියා පඨමං යාමං චඞ්කමෙන නිසජ්ජාය ආවරණීයෙහි ධම්මෙහි චිත්තං පරිසොධෙති, රත්තියා මජ්ඣිමං යාමං දක්ඛිණෙන පස්සෙන සීහසෙය්යං කප්පෙති, පාදෙ පාදං අච්චාධාය සතො සම්පජානො උට්ඨානසඤ්ඤං මනසිකරිත්වා. රත්තියා පච්ඡිමං යාමං පච්චුට්ඨාය චඞ්කමෙන නිසජ්ජාය ආවරණීයෙහි ධම්මෙහි චිත්තං පරිසොධෙති. එවං ඛො භික්ඛවෙ භික්ඛු ජාගරියං අනුයුත්තො හොති. ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො භික්ඛු අපණ්ණකතං පටිපදං පටිපන්නො හොති. යොනි චස්ස ආරද්ධා හොති ආසවානං ඛයායාති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 7.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "17. තයොමෙ භික්ඛවෙ ධම්මා අත්තව්යාබාධායපි සංවත්තන්ති, පරව්යාබාධායපි සංවත්තන්ති, උභයව්යාබාධායපි සංවත්තන්ති. කතමෙ තයො: කායදුච්චරිතං, වචීදුච්චරිතං, මනොදුච්චරිතං. ඉමෙ ඛො භික්ඛවෙ තයො ධම්මා අත්තව්යාබාධායපි සංවත්තන්ති, පරව්යාබාධායපි සංවත්තන්ති, උභයව්යාබාධායපි සංවත්තන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තයොමෙ භික්ඛවෙ ධම්මා නෙවත්තව්යාබාධායපි සංවත්තන්ති. න පරව්යාබාධායපි සංවත්තන්ති. න උභයව්යාබාධායපි සංවත්තන්ති. කතමෙ තයො: කායසුචරිතං, වචීසුචරිතං, මනොසුචරිතං. ඉමෙ ඛො භික්ඛවෙ තයො ධම්මා නෙවත්තව්යාබාධායපි සංවත්තන්ති. න පරව්යාබාධායපි සංවත්තන්ති. න උභයව්යාබාධායපි සංවත්තන්තීති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 8.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "18. සචෙ වො භික්ඛවෙ අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං පුච්ඡෙය්යුං: දෙවලොකූපපත්තියා ආවුසො සමණෙ ගොතමෙ බ්රහ්මචරියං වුස්සතීති?{1} නනු තුම්හෙ භික්ඛවෙ එවංපුට්ඨා අට්ටීයෙය්යාථ, හරායෙය්යාථ, ජිගුච්ඡෙය්යාථාති? එවම්භන්තෙ. ඉති කිර තුම්හෙ භික්ඛවෙ දිබ්බෙන ආයුනා අට්ටීයථ, හරායථ, ජිගුච්ඡථ, දිබ්බෙන වණ්ණෙන - දිබ්බෙන සුඛෙන - දිබ්බෙන යසෙන - දිබ්බෙන ආධිපතෙය්යෙන, අට්ටීයථ, හරායථ, ජිගුච්ඡථ. පගෙව ඛො පන භික්ඛවෙ තුම්හෙහි කායදුච්චරිතෙන අට්ටීයිතබ්බං, හරායිතබ්බං, ජිගුච්ඡිතබ්බං. වචීදුච්චරිතෙන -පෙ- මනොදුච්චරිතෙන අට්ටීයිතබ්බං, හරායිතබ්බං, ජිගුච්ඡිතබ්බං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. වුස්සථාති - සීමු, මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මහණ තෙම කෙසේ භෝජනයෙහි මාත්‍රඥ වේ ද? මහණෙනි, මෙ සස්නෙහි මහණ තෙම නුවණින් සලකා අහර ගණියි. කෙළි පිණිස නො වේ, මද පිණිස නො වේ, අඩුතැන් පිරවීම පිණිස නො වේ, සැරසීම පිණිස නො වේ, මේ සිරුර පැවැත් ම පිණිස ම වේ, යැපීම පිණිස ම වේ, සාගිනි වේදනාව වැළැක් ම පිණිස ම වේ, ශාසනමාර්‍ගබ්‍රහ්මචර්‍ය්‍යහට අනුග්‍රහ පිණිස ම වේ, මෙසේ පැරණි කුසගිනි වේදනාව නසන්නෙමි. අභිනව වේදනා නූපදවන්නෙමි. මාගේ ජීවිත යාත්‍රාව ද වන්නේ ය. නිදොස්බව ද නිවැරදිබව ද පහසු විහරණය ද වන්නේ ය යනුයි. මහණෙනි, මෙසේ වනාහි මහණ තෙමේ භොජනයෙහි පමණ දන්නේ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මහණ තෙම කෙසේ වනාහි නිදිවැරීමෙහි යෙදුනේ වේ ද? මහණෙනි, මෙ සස්නෙහි මහණ දවල් සක්මනින් ද හිඳීමෙන් ද නීවරණධර්‍මයන් කෙරෙන් සිත පිරිසිදු කෙරෙයි. රෑ පළමු යම සක්මනින් ද හිඳීමෙන් ද නීවරණධර්‍මයන්ගෙන් සිත පිරිසිදු කෙරෙයි. රෑ මැදියම දකුණු පයෙහි වම්පය මඳක් හයා තබා නැගීසිටුනා සංඥාව මෙනෙහි කොට සිහි ඇත්තේ නුවණ ඇත්තේ සිංහ ශය්‍යාව කරයි. රෑ පැසුළුයම නැගිට සක්මනින් ද හිඳීමෙන් ද නීවරණධර්‍මයන් කෙරෙන් සිත පිරිසිදු කෙරෙයි. මහණෙනි, මෙසේ වනාහි මහණ තෙමේ නිදිවැරීමෙහි යෙදුනේ වෙයි. මහණෙනි, මේ ධර්‍ම තුණෙන් සමන්වාගත මහණ අවිරුද්ධ ප්‍රතිපත්තියට පිළිපන්නේ වෙයි. ආස්‍රවයන්ගේ ක්‍ෂයය පිණිස කරුණ ද පටන්ගන්නා ලද්දේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 7.",
                        "level": 1
                    },
                    {
                        "text": "17. මහණෙනි, මේ ධර්‍මයෝ තුන්දෙනෙක් තමාට පීඩාව පිණිස ද පවත්නාහ. මෙරමාහට පීඩාව පිණිස ද පවත්නාහ. දෙදෙනාහට ම පීඩා පිණිස පවත්නාහ. කවර තුන්දෙනෙක යත්: කායදුශ්චරිත ය වාග්දුශ්චරිත ය මනෝදුශ්චරිත යි. මහණෙනි, මේ ධර්‍මයෝ තුන්දෙන තමාට හිංසාව පිණිස ද පවත්නාහ. මෙරමාහට හිංසාව පිණිස ද, දෙදෙනාහට හිංසාව පිණිස ද පවත්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ ධර්‍මයෝ තුන්දෙනෙක් තමාට පීඩා පිණිස ද නො පවත්නාහ. මෙරමාහට පීඩා පිණිස ද නො පවත්නාහ. දෙදෙනාහට ම පීඩා පිණිස නො පවත්නාහ. කවර තුන්දෙනෙක යත්: කායසුචරිතය වාක්සුචරිතය මනඃසුචරිත යි. මහණෙනි, මේ ධර්‍මයෝ තුන්දෙන තමාට පීඩා පිණිස ද නො පවත්නාහ. මෙරමාහට පීඩා පිණිස ද නො ම පවත්නාහ. දෙදෙනාහට ම පීඩා පිණිස ද නො ම පවත්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 8.",
                        "level": 1
                    },
                    {
                        "text": "18. මහණෙනි, ඉදින් අන්තොටු පිරිවැජියෝ “ඇවැත්නි, දෙව්ලොව උපදනා සඳහා මහණගොයුම්හු කෙරෙහි බඹසරවස් වැසෙන්නේ වේ දැ” යි මෙසේ පුළුවුස්නාහු නම්, මහණෙනි, තෙපි මෙසේ පුළුවුස්නා ලද්දහු පීඩිතවන්නහු නොවවු ද, ලජ්ජිතවන්නහු නොවවු ද, ජුගුප්සා ඇත්තහු නොවවු දැ යි. වහන්ස, එසේය. මහණෙනි, මෙසේ තෙපි දිව්‍ය ආයුෂින් පීඩිත වව, ලජ්ජිත වව, හටගත් ජුගුප්සා ඇති වව, දිව්‍ය වූ වර්‍ණයෙන් - දිව්‍ය වූ සුඛයෙන් - දිව්‍ය වූ යශසින් - දිව්‍ය වූ ආධිපත්‍යයෙන් පීඩිත වව, ලජ්ජිත වව, ජුගුප්සා ඇති වව, මහණෙනි, තොප විසින් කැල ම කායදුශ්චරිතයෙන් පීඩිත වුව මැනව, ලජ්ජිත වුව මැනව, ජුගුප්සා ඇති වුව මැනව. වාග්දුශ්චරිතයෙන් ... මනොදුශ්චරිතයෙන් පීඩිත වුව මැනව, ලජ්ජිත වුව මැනව, ජුගුප්සා ඇති වුව මැනව.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 218,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 9",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "19. තීහි භික්ඛවෙ, අඞ්ගෙහි සමන්නාගතො පාපණිකො අභබ්බො අනධිගතං වා භොගං අධිගන්තුං, අධිගතං වා භොගං ඵාතිකත්තුං{1}. කතමෙහි තීහි: ඉධ භික්ඛවෙ පාපණිකො පුබ්බන්හසමයං න සක්කච්චං කම්මන්තං අධිට්ඨාති, මජ්ඣන්තිකං{2} සමයං න සක්කච්චං කම්මන්තං අධිට්ඨාති, සායන්හසමයං න සක්කච්චං කම්මන්තං අධිට්ඨාති. ඉමෙහි ඛො භික්ඛවෙ තීහි අඞ්ගෙහි සමන්නාගතො පාපණිකො අභබ්බො අනධිගතං වා භොගං අධිගන්තුං, අධිගතං වා භොගං ඵාතිකත්තුං.{1}"
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො භික්ඛු අභබ්බො අනධිගතං වා කුසලං ධම්මං අධිගන්තුං, අධිගතං වා කුසලං ධම්මං ඵාතිකත්තුං{1}. කතමෙහි තීහි: ඉධ භික්ඛවෙ භික්ඛු පුබ්බණ්හසමයං න සක්කච්චං සමාධිනිමිත්තං අධිට්ඨාති. මජ්ඣන්තිකං සමයං න සක්කච්චං සමාධිනිමිත්තං අධිට්ඨාති. සායන්හසමයං න සක්කච්චං සමාධිනිමිත්තං අධිට්ඨාති. ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො භික්ඛු අභබ්බො අනධිගතං වා කුසලං ධම්මං අධිගන්තුං, අධිගතං වා කුසලං ධම්මං ඵාතිකත්තුං{1}."
                    },
                    {
                        "type": "paragraph",
                        "text": "තීහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො පාපණිකො භබ්බො අනධිගතං වා භොගං අධිගන්තුං, අධිගතං වා භොගං ඵාතිකත්තුං.{1} කතමෙහි තීහි: ඉධ භික්ඛවෙ පාපණිකො පුබ්බන්හසමයං සක්කච්චං කම්මන්තං අධිට්ඨාති, මජ්ඣන්තිකං සමයං -පෙ- සායන්හසමයං සක්කච්චං කම්මන්තං අධිට්ඨාති. ඉමෙහි ඛො භික්ඛවෙ තීහි අඞ්ගෙහි සමන්නාගතො පාපණිකො භබ්බො අනධිගතං වා භොගං අධිගන්තුං, අධිගතං වා භොගං ඵාතිකත්තුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො භික්ඛු භබ්බො අනධිගතං වා කුසලං ධම්මං අධිගන්තුං, අධිගතං වා කුසලං ධම්මං ඵාතිකත්තුං. කතමෙහි තීහි: ඉධ භික්ඛවෙ භික්ඛු පුබ්බන්හසමයං සක්කච්චං සමාධිනිමිත්තං අධිට්ඨාති. මජ්ඣන්තිකං සමයං -පෙ- සායන්හසමයං සක්කච්චං සමාධිනිමිත්තං අධිට්ඨාති, ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො භික්ඛු භබ්බො අනධිගතං වා කුසලං ධම්මං අධිගන්තුං, අධිගතං වා කුසලං ධම්මං ඵාතිකත්තුන්ති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 10",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "20. තීහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො පාපණිකො න චිරස්සෙව මහන්තත්තං{7} වෙපුල්ලත්තං පාපුණාති භොගෙසු. කතමෙහි තීහි: ඉධ භික්ඛවෙ පාපණිකො චක්ඛුමා ච හොති, විධුරො ච, නිස්සයසම්පන්නො ච."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඵාතිකාතුං - PTS. ස්යා. ඵාතිං කාතුං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. මජ්ඣන්තිකසමයං - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "7. __මහත්තං - මඡසං. (?) - ස්යා. (?) - PTS.__"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 9.",
                        "level": 1
                    },
                    {
                        "text": "19. මහණෙනි, අඞ්ග තුණෙකින් සමන්වාගත වෙණෙඳ නොලැබූ භොග ලබන්නට වේවයි ලැබූ භෝග දියුණු කරන්නට වේවයි අභව්‍යයෙකි. කවර අඞ්ග තුණෙකින යත්: මහණෙනි, මෙලොව්හි වෙණෙඳ පෙරවරු කාලයෙහි සකසා කර්‍මාන්තයෙහි නො සිටුනේ ද, මධ්‍යහ්න කාලයෙහි කර්‍මාන්තයෙහි සකසා නො සිටුනේ ද, සවස් කාලයෙහි කර්‍මාන්තයෙහි සකසා නොසිටුනේ ද, මහණෙනි, මේ අඞ්ග තුණෙන් සමන්වාගත වූ වෙණෙඳ නොලත් භොග ලබා ගන්නට වේවයි ලැබූ භොග දියුණු කරන්නට වේවයි අභව්‍ය වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිද්දෙන් ම ධර්‍ම තුණෙකින් සමන්වාගත වූ මහණ නොලත් කුසල්දහම් ලබන්නට වේවයි ලැබූ කුසල්දහම් වඩාගන්නට වේවයි අභව්‍ය වෙයි. කවර තුණෙකින යත්: මහණෙනි, මේ සස්නෙහි මහණ පෙරවරු කාලයෙහි සකසා සමාධිනිමිත්තෙහි නොසිටුනේ ද, මධ්‍යහ්නකාලයෙහි සකසා සමාධිනිමිත්තෙහි නොසිටුනේ ද, සවස්කාලයෙහි සකසා සමාධිනිමිත්තෙහි නොසිටුනේ ද, මහණෙනි, මේ ධර්‍ම තුණෙන් සමන්වාගත වූ මහණ නො ලැබූ සමාධිනිමිත්ත ලබා ගන්නට වේවයි ලැබූ සමාධිනිමිත්ත වඩාගන්නට වේවයි අභව්‍ය වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අඞ්ග තුණෙකින් සමන්වාගත වෙණෙඳ නොලැබූ භොග ලබාගන්නට වේවයි ලැබු භොග වඩාගන්නට වේවයි භව්‍ය වෙයි. කවර තුණෙකින යත්: මහණෙනි, මෙලොව්හි වෙණෙඳ පෙරවරුකාලයෙහි සකසා කර්‍මාන්තයෙහි සිටුනේ ද, මධ්‍යහ්නකාලයෙහි සකසා කර්‍මාන්තයෙහි සිටුනේ ද, සවස් කාලයෙහි සකසා කර්‍මාන්තයෙහි සිටුනේ ද, මහණෙනි, මේ අඞ්ගතුණෙන් සමන්වාගත වෙණෙඳ නොලැබු භොග ලබන්නට වේවයි ලැබූ භොග වඩාගන්නට වේවයි භව්‍ය වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිද්දෙන් ම ධර්‍ම තුණෙකින් සමන්වාගත මහණ නො ලැබූ කුසල්දහම් ලබන්නට වේවයි ලැබූ කුසල්දහම් වඩන්නට වේවයි භව්‍ය වෙයි. කවර තුණෙකින යත්: මහණෙනි, මේ සස්නෙහි මහණ පෙරවරු කාලයෙහි සමාධිනිමිත්තෙහි සකසා සිටුනේය. මධ්‍යහ්නකාලයෙහි සමාධිනිමිත්තෙහි සකසා සිටුනේය. සවස්කාලයෙහි සමාධිනිමිත්තෙහි සකසා සිටුනේය. මහණෙනි, මේ ධර්‍මතුණෙන් සමන්වාගත මහණ නොලැබූ කුසල්දහම් ලබන්නට වේවයි, ලැබූ කුසල්දහම් වඩන්නට වේවයි භව්‍ය වේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 2. 10.",
                        "level": 1
                    },
                    {
                        "text": "20. මහණෙනි, අඞ්ග තුණෙකින් සමන්වාගත වෙණෙඳ නොබෝ කලෙකින් ම භොගවිෂයෙහි මහත්බවට විපුලබවට පැමිණෙයි. කවර තුණෙකින යත්: මහණෙනි, මෙලොව්හි වෙණෙඳ නුවණැස් ඇත්තේ වෙයි, ඥානසම්ප්‍රයුක්ත වීර්‍ය්‍ය ඇත්තේ ද වෙයි, නිඃශ්‍රයසම්පන්න ද වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 220,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පාපණිකො චක්ඛුමා හොති: ඉධ භික්ඛවෙ පාපණිකො පණියං ජානාති. ඉදං පණියං එවං කීතං එවං වික්කයමානං එත්තකං මූලං භවිස්සති එත්තකො උදයොති{1} එවං ඛො භික්ඛවෙ පාපණිකො චක්ඛුමා හොති. කථඤ්ච භික්ඛවෙ පාපණිකො විධුරො හොති: ඉධ භික්ඛවෙ පාපණිකො කුසලො හොති පණියං කෙතුඤ්ච වික්කෙතුඤ්ච. එවං ඛො භික්ඛවෙ පාපණිකො විධුරො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පාපණිකො නිස්සයසම්පන්නො හොති: ඉධ භික්ඛවෙ පාපණිකො යෙ තෙ ගහපතී වා ගහපතිපුත්තා වා අඩ්ඪා මහද්ධනා මහාභොගා තෙ එවං ජානන්ති: අයං ඛො භවං පාපණිකො චක්ඛුමා ච විධුරො ච පටිබලො පුත්තදාරඤ්ච පොසෙතුං. අම්හාකඤ්ච කාලෙන කාලං අනුප්පදාතුන්ති. තෙ නං භොගෙහි නිපතන්ති: ඉතො සම්ම පාපණික, භොගෙ හරිත්වා{2} පුත්තදාරඤ්ච පොසෙහි අම්හාකඤ්ච කාලෙන කාලං අනුප්පදෙහීති. එවං ඛො භික්ඛවෙ පාපණිකො නිස්සයසම්පන්නො හොති. ඉමෙහි ඛො භික්ඛවෙ තීහි අඞ්ගෙහි සමන්නාගතො පාපණිකො න චිරස්සෙව මහන්තත්තං{3} වෙපුල්ලත්තං පාපුණාති භොගෙසු."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො භික්ඛු න චිරස්සෙව මහන්තත්තං{3} වෙපුල්ලත්තං පාපුණාති කුසලෙසු ධම්මෙසු. කතමෙහි තීහි: ඉධ භික්ඛවෙ භික්ඛු චක්ඛුමා ච හොති විධුරො ච නිස්සයසම්පන්නො ච. කථඤ්ච භික්ඛවෙ භික්ඛු චක්ඛුමා හොති: ඉධ භික්ඛවෙ භික්ඛු ඉදං දුක්ඛන්ති යථාභූතං පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං පජානාති. එවං ඛො භික්ඛවෙ භික්ඛු චක්ඛුමා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු විධුරො හොති: ඉධ භික්ඛවෙ භික්ඛු ආරද්ධවිරියො විහරති අකුසලානං ධම්මානං පහානාය,කුසලානං ධම්මානං උපසම්පදාය, ථාමවා දළ්හපරක්කමො අනික්ඛිත්තධුරො කුසලෙසු ධම්මෙසු. එවං ඛො භික්ඛවෙ භික්ඛු විධුරො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු නිස්සයසම්පන්නො හොති: ඉධ භික්ඛවෙ භික්ඛු යෙ තෙ භික්ඛූ බහුස්සුතා ආගතාගමා ධම්මධරා විනයධරා මාතිකාධරා. තෙ කාලෙන කාලං උපසඞ්කමිත්වා පරිපුච්ඡති, පරිපඤ්හති ඉදං භන්තෙ කථං? ඉමස්ස කො අත්ථොති? තස්ස තෙ ආයස්මන්තො අවිවටඤ්චෙව විවරන්ති අනුත්තානීකතඤ්ච උත්තානීකරොන්ති, අනෙකවිහිතෙසු{5} කඞ්ඛාඨානීයෙසු ධම්මෙසු කඞ්ඛං පටිවිනොදෙන්ති. එවං ඛො භික්ඛවෙ භික්ඛු නිස්සයසම්පන්නො හොති. ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො භික්ඛු න චිරස්සෙව මහන්තත්තං{3} වෙපුල්ලත්තං පාපුණාති කුසලෙසු ධම්මෙසූති."
                    },
                    {
                        "type": "centered",
                        "text": "පඨමභාණවාරො නිට්ඨිතො.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "වග්ගො දුතියො.{7}",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උද්දයොති - කත්ථචි."
                    },
                    {
                        "type": "footnote",
                        "text": "2. කරිත්වා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. මහත්තං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. අනෙකවිහිතෙසු ච - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "7. තස්සුද්දානං :- ඤාතො සාරණීයො භික්ඛු - චක්කවත්ති සචෙතනො, අපණ්ණකත්තා දෙවො ච - දුවෙ පාපණිකෙන චාති. - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, වෙණෙඳ කෙසේ නුවණැස් ඇති වේ ද යත්: මහණෙනි, මෙ ලොව්හි වෙණෙඳ “මේ වෙළඳ බඩු මෙසේ මිල දී ගන්නා ලද්දේ මෙසේ විකුණනු ලබන්නේ මෙතෙක් මිල වෙයි. මෙතෙක් ලාභ වේ යයි” බඩුමිල දනී ද, මහණෙනි, මෙසේ වනාහි වෙළඳ තෙම නුවණැස් ඇති වෙයි. මහණෙනි, කෙසේ නම්, වෙළඳ තෙම ඥානසම්ප්‍රයුක්ත වීර්‍ය්‍ය ඇති වේ ද යත්: මහණෙනි, මෙලොව්හි වෙළඳ තෙම වෙළඳ බඩු මිලට ගන්නට හා විකුණන්නට හා දක්‍ෂ වේ ද, මහණෙනි, මෙසේ වනාහි වෙළඳ තෙම ඥානසම්ප්‍රයුක්ත වීර්‍ය්‍ය ඇති වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, වෙළඳ තෙම කෙසේ නම් නිඃශ්‍රයසම්පන්න වේ ද? යත් මහණෙනි, මෙලොව්හි වෙළෙඳෙක් වේද, “ආඪ්‍ය වූ මහත් වූ ධන ඇති, මහා භොග ඇති, යම් ඒ ගෘහපති කෙනෙක් හෝ ඇත් ද, ගෘහපතිපුත්‍ර කෙනෙක් හෝ ඇත් ද, ඔවුහු “මේ භවත් වෙළෙඳ තෙම නුවණැස් ඇත්තේ ද, විධුර ද වෙයි. අඹුදරුවන් පුස්නට හා අපට කලින් කල අනුප්‍රදානය කරන්නට ද ප්‍රතිබල වේ ය”යි මෙසේ ඔහු දැන ගණිත් ද, ඔවුහු “සගය, වාණිජයෙනි, මෙයින් භොගයන් ගෙණ ගොස් අඹුදරුවන් පුස්ව, කලින් කල අපට ද දෙව”යි ඔහු භොගයෙන් පවරත්. මහණෙනි, මෙසේ වනාහි වෙළෙඳ තෙම නිඃශ්‍රයසම්පන්න වේ. මහණෙනි, මේ අඞ්ග තුණෙන් යුත් වෙළෙඳ තෙම භොගවිෂයෙහි මහත්බවට විපුලබවට පැමිණෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිද්දෙන් ම ධර්‍ම තුණෙකින් සමන්වාගත මහණ නොබෝ කලෙකින් ම ධර්‍මවිෂයෙහි මහත් බවට විපුල බවට පැමිණෙයි. කවර තුණෙකින යත්: මහණෙනි, මේ ශාසනයෙහි මහණ නුවණැස් ඇත්තේ ප්‍රඥා ඇත්තේ නිඃශ්‍රය ඇත්තේ වෙයි. මහණෙනි, මහණ කෙසේ නුවණැස් ඇති වේ ද යත්: මහණෙනි, මේ සස්නෙහි මහණ තෙම “මෙය දුකැ”යි තත් වූ පරිද්දෙන් දනී ද - මෙය දුක් නැති කිරීමට යන ප්‍රතිපදා යයි තත් වූ පරිද්දෙන් දනී ද, මහණෙනි, මෙසේ වනාහි මහණ නුවණැස් ඇති වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මහණ කෙසේ නම් විධුර වූයේ වේ ද? මහණෙනි, මේ සස්නෙහි මහණ අකුශලධර්‍මයන් ප්‍රහීණ කිරීම පිණිස පටන්ගත් වැර ඇත්තේ වෙසෙයි ද, කුසල්දහම් වැඩීම පිණිස ශක්ති ඇත්තේ දෘඪපරාක්‍රම ඇත්තේ වේ ද, කුශලධර්‍මයන් කෙරෙහි නොහළ වීර්‍ය්‍ය ඇති වේ ද, මහණෙනි, මෙසේ වනාහි මහණ වීර්‍ය්‍ය ඇති වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මහණ කෙසේ නම් නිඃශ්‍රය ඇති වේ ද යත්: මහණෙනි, මෙසස්නෙහි මහණ, බහුශ්‍රැත වූ පැමිණි ශාස්තෘශාසන ඇති ධර්‍මධර වූ විනයධර වූ (උභය) මාතෘකාධර වූ යම් මහණ කෙනෙක් වෙත් ද, කලින් කල ඔවුන් වෙත පැමිණ කරුණු නොකරුණු විචාරා ද, වහන්ස, මෙය කෙසේ ය? මෙහි අර්ථය කිමෙකැයි? ප්‍රශ්නකරයි ද, ඒ ආයුෂ්මත්හු ඔහුට අප්‍රකට වූ ධර්‍මය ද විවර කෙරෙති. විස්තෘත නුවූ ධර්‍මය ද විස්තර කෙරෙති. නන්වැදෑරුම් සැකයට කරුණු වූ ධර්‍මයන් කෙරෙහි සැක දුරලති. මහණෙනි, මෙසේ වනාහි මහණ නිඃශ්‍රය ඇති වේ. මහණෙනි, මේ ධර්‍ම තුණෙන් සමන්වාගත වූ මහණ නොබෝ කලෙකින් ම ධර්‍මවිෂයෙහි මහත්බවට විපුල බවට පැමිණෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පළමු වන බණවර නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "දෙවන වග යි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 222,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. පුග්ගලවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 1",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "21. එවං මෙ සුතං : එකං සමයං භගවා **සාවත්ථියං **විහරති, **ජෙතවනෙ **අනාථපිණ්ඩිකස්ස ආරාමෙ. අථ ඛො ආයස්මා ච **සවිට්ඨො**{1} ආයස්මා ච **මහාකොට්ඨිතො **යෙනායස්මා **සාරිපුත්තො **තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා ආයස්මතා සාරිපුත්තෙන සද්ධිං සම්මොදිංසු. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නං ඛො ආයස්මන්තං සවිට්ඨං ආයස්මා සාරිපුත්තො එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "තයොමෙ ආවුසො සවිට්ඨ{2}, පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ තයො: කායසක්ඛී, දිට්ඨප්පත්තො,{3} සද්ධාවිමුත්තො. ඉමෙ ඛො ආවුසො තයො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. ඉමෙසං{4} ඛො ආවුසො තිණ්ණං පුග්ගලානං කතමො තෙ පුග්ගලො ඛමති අභික්කන්තතරො ච පණීතතරො චාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තයොමෙ ආවුසො සාරිපුත්ත, පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ තයො? කායසක්ඛී දිට්ඨප්පත්තො සද්ධාවිමුත්තො. ඉමෙ ඛො ආවුසො තයො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. ඉමෙසං ආවුසො තිණ්ණං පුග්ගලානං ය්වායං පුග්ගලො සද්ධාවිමුත්තො, අයං මෙ පුග්ගලො ඛමති, ඉමෙසං තිණ්ණං පුග්ගලානං අභික්කන්තතරො ච, පණීතතරො ච. තං කිස්ස හෙතු, ඉමස්සාවුසො, පුග්ගලස්ස සද්ධින්ද්රියං අධිමත්තන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා සාරිපුත්තො ආයස්මන්තං මහාකොට්ඨිතං එතදවොච: තයො මෙ ආවුසො කොට්ඨිත, පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ තයො: කායසක්ඛී දිට්ඨප්පත්තො සද්ධාවිමුත්තො. ඉමෙ ඛො ආවුසො තයො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. ඉමෙසං ආවුසො තිණ්ණං පුග්ගලානං කතමො තෙ පුග්ගලො ඛමති, අභික්කන්තතරො ච පණීතතරො චාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තයොමෙ ආවුසො සාරිපුත්ත, පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ තයො: කායසක්ඛී, දිට්ඨප්පත්තො, සද්ධාවිමුත්තො. ඉමෙ ඛො ආවුසො තයො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. ඉමෙසං ආවුසො තිණ්ණං පුග්ගලානං ය්වායං පුග්ගලො කායසක්ඛී, අයං මෙ පුග්ගලො ඛමති, ඉමෙසං තිණ්ණං පුග්ගලානං අභික්කන්තතරො ච පණීතතරො ච. තං කිස්ස හෙතු? ඉමස්සාවුසො, පුග්ගලස්ස සමාධින්ද්රියං අධිමත්තන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා මහාකොට්ඨිතො{5} ආයස්මන්තං සාරිපුත්තං එතදවොච : තයොමෙ ආවුසො සාරිපුත්ත, පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ තයො: කායසක්ඛී දිට්ඨප්පත්තො සද්ධාවිමුත්තො. ඉමෙ ඛො ආවුසො තයො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. ඉමෙසං ආවුසො තිණ්ණං පුග්ගලානං කතමො තෙ පුග්ගලො ඛමති, අභික්කන්තතරො ච පණීතතරො චාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. __සමිද්ධො - මඡසං.__"
                    },
                    {
                        "type": "footnote",
                        "text": "2. __සමිද්ධ - මඡසං.__"
                    },
                    {
                        "type": "footnote",
                        "text": "3. දිට්ඨප්පත්තො - කත්ථචි."
                    },
                    {
                        "type": "footnote",
                        "text": "4. ඉමෙසං ආවුසො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. __මහාකොට්ඨිකො - මඡසං__."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "3. පුඟුල් වර්ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 1",
                        "level": 1
                    },
                    {
                        "text": "21. මා විසින් මෙසේ අසන ලදි: එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ **සැවැත්නුවර **සමීපයෙහි **ජේතවන **නම් වූ අනේපිඬු මහසිටුහුගේ අරම්හි වැඩ වසන සේක. එකල්හි ආයුෂ්මත් **සවිට්ඨ **තෙරණුවන් හා ආයුෂ්මත් **මහාකොට්ඨිත **තෙරණුවෝ ආයුෂ්මත් **සැරියුත් **තෙරණුවන් කරා එළඹියහ. එළඹ ආයුෂ්මත් සැරියුත් තෙරණුවන් හා සමග සතුටු වූහ. සාම්මොදනයට හේතු වන සිහි කරන්නට නිසි කථාව කොට නිමවා එකත්පස් ව හුන්හ. එකත්පස් ව හුන් ආයුෂ්මත් සවිට්ඨ තෙරණුවන්ට ආයුෂ්මත් සැරියුත් තෙරණුවෝ තෙල කීහ:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත්නි, සවිට්ඨයෙනි, ලොව්හි මේ පුද්ගලයෝ තුන් දෙනෙක් ඇත. කවර තුන් දෙනෙක යත්: කායසක්ඛී ය, දිට්ඨප්පත්ත ය, සද්ධාවිමුත්තයි. ඇවැත්නි, මේ පුද්ගලයෝ තුන්දෙන ලොව්හි විද්‍යමාන වෙත්. ඇවැත්නි, මේ පුද්ගලයන් තුන් දෙනා අතුරෙන් කවර පුද්ගලයෙක් තොපට ඉතා මැනැවැයි ප්‍රණීතතරය යි රුස්නේ ය?",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත් ශාරීපුත්‍රයෙනි, ලොව්හි මේ පුද්ගලයෝ තුන් දෙනෙක් ඇත. කවර තුන් දෙනෙක යත්: කායසක්ඛී ය, දිට්ඨප්පත්ත ය, සද්ධාවිමුත්තයි. ඇවැත්නි: ලොව්හි මේ පුද්ගලයෝ තුන් දෙන විද්‍යමාන වෙති. ඇවැත්නි, මේ පුද්ගලයන් තුන් දෙනා අතුරෙන් සද්ධාවිමුත්ත නම් යම් පුද්ගලයෙක් වේ ද, මේ පුද්ගලයන් තුන් දෙනා අතුරෙන් මේ පුද්ගල තෙමේ වඩා මැනැවැයි ද වඩා ප්‍රණීත යයි ද මට රුස්නේ වේ. ඊට හෙතු කවරේය යත්: ඇවැත්නි, මේ පුද්ගලයාගේ ශ්‍රද්ධෙන්‍ද්‍රිය බලවත් වේ ද එහෙයිනි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉක්බිති, ආයුෂ්මත් සැරියුත් තෙරණුවෝ ආයුෂ්මත් මහාකොට්ඨිත තෙරණුවන්ට තෙල කීහ: ඇවැත, කොට්ඨිතයෙනි, ලොව්හි මේ පුද්ගලයෝ තුන් දෙනෙක් විද්‍යමාන වෙති. කවර තුන් දෙනෙක යත්: කායසක්ඛී ය, දිට්ඨප්පත්ත ය, සද්ධාවිමුත්තයි. ඇවැත්නි, මේ පුද්ගලයෝ තුන්දෙන ලොව්හි විද්‍යමාන වෙති. ඇවැත්නි, මේ පුද්ගලයන් තුන් දෙනා අතුරෙන් කවර පුද්ගලයෙක් වඩා මැනැවැයි ද, ප්‍රණීතය යී ද තොපට රුස්නේ වේ ද?",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත් ශාරීපුත්‍රයෙනි, ලොව්හි මේ පුද්ගලයෝ තුන් දෙනෙක් වෙති. කවර තුන් දෙනෙක යත්: කායසක්ඛී ය, දිට්ඨප්පත්ත ය, සද්ධාවිමුත්තයි. ඇවැත්නි, මේ පුද්ගලයෝ තුන්දෙන ලොව්හි විද්‍යමාන වෙති. ඇවැත්නි, මේ පුද්ගලයන් තුන් දෙනා අතුරෙහි යම් පුද්ගලයෙක් කායසක්ඛී වේ ද, මේ පුද්ගල තෙමේ මේ පුද්ගලයන් තුන් දෙනා අතුරෙන් වඩා මැනැවැයි ද, වඩා ප්‍රණීතය යි ද මට රුස්නේ වෙයි. ඒ කවර හෙයින යත්: ඇවැත්නි, මේ පුද්ගලයාගේ සමාධින්‍ද්‍රිය ය ඉතා බලවත් වේ ද, එහෙයිනි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉක්බිති ආයුෂ්මත් මහාකොට්ඨිත තෙරණුවෝ ආයුෂ්මත් සැරියුත් තෙරණුවන්ට තෙල කීහ: ඇවැත් ශාරීපුත්‍රයෙනි, මේ පුද්ගලයෝ තුන්දෙනෙක් ලොව්හි විද්‍යමාන වෙත්. කවර තුන් දෙනෙක යත්: කායසක්ඛී ය, දිට්ඨප්පත්ත ය, සද්ධාවිමුත්ත යි. ඇවැත්නි, මේ පුද්ගලයෝ තුන් දෙන ලොව්හි විද්‍යමාන වෙත්. ඇවැත්නි, මේ පුද්ගලයන් තුන්දෙනා අතුරෙන් කවර පුද්ගලයෙක් වඩා මැනැවැයි ද, වඩා ප්‍රණීතය යි ද තොපට රුස්නේ වේ ද?",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 224,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තයොමෙ ආවුසො කොට්ඨිත, පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ තයො: කායසක්ඛී, දිට්ඨප්පත්තො, සද්ධාවිමුත්තො. ඉමෙ ඛො ආවුසො තයො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. ඉමෙසං ආවුසො තිණ්ණං පුග්ගලානං ය්වායං පුග්ගලො දිට්ඨප්පත්තො, අයං මෙ පුග්ගලො ඛමති, ඉමෙසං තිණ්ණං පුග්ගලානං අභික්කන්තතරො ච පණීතතරො ච. තං කිස්ස හෙතු: ඉමස්සාවුසො පුග්ගලස්ස පඤ්ඤින්ද්රියං අධිමත්තන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා සාරිපුත්තො ආයස්මන්තඤ්ච සවිට්ඨං ආයස්මන්තඤ්ච මහාකොට්ඨිතං එතදවොච : ව්යාකතං ඛො ආවුසො අම්හෙහි සබ්බෙහෙව යථාසකං පටිභානං. ආයාමාවුසො යෙන භගවා තෙනුපසඞ්කමිස්සාම, උපසඞ්කමිත්වා භගවතො එතමත්ථං ආරොචෙස්සාම. යථා නො භගවා ව්යාකරිස්සති, තථා නං ධාරෙස්සාමාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමාවුසොති. ඛො ආයස්මා ච සවිට්ඨො ආයස්මා ච මහාකොට්ඨිතො ආයස්මතො සාරිපුත්තස්ස පච්චස්සොසුං. අථ ඛො ආයස්මා ච සාරිපුත්තො ආයස්මා ච සවිට්ඨො ආයස්මා ච මහාකොට්ඨිතො යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නො ඛො ආයස්මා සාරිපුත්තො යාවතකො අහොසි ආයස්මතා ච සවිට්ඨෙන ආයස්මතා ච මහාකොට්ඨිතෙන සද්ධිං කථාසල්ලාපො, තං සබ්බං භගවතො ආරොචෙසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "න ඛොත්ථ{1} සාරිපුත්ත සුකරං එකංසෙන ව්යාකාතුං, අයං ඉමෙසං තිණ්ණං පුග්ගලානං අභික්කන්තතරො ච පණීතතරො චාති. ඨානං හෙතං සාරිපුත්ත, විජ්ජති, ය්වායං පුග්ගලො සද්ධාවිමුත්තො ස්වාස්ස අරහත්තාය පටිපන්නො. ය්වායං පුග්ගලො කායසක්ඛී, ස්වාස්ස සකදාගාමී වා, අනාගාමී වා. යො චායං පුග්ගලො දිට්ඨප්පත්තො, සොපස්ස සකදාගාමී වා, අනාගාමී වා. න ඛොත්ථ සාරිපුත්ත සුකරං, එකංසෙන ව්යාකාතුං, අයං ඉමෙසං තිණ්ණං පුග්ගලානං අභික්කන්තතරො ච පණීතතරො චාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඨානං හෙතං සාරිපුත්ත විජ්ජති, ය්වායං පුග්ගලො කායසක්ඛී ස්වාස්ස අරහත්තාය පටිපන්නො. ය්වායං පුග්ගලො සද්ධාවිමුත්තො, ස්වාස්ස සකදාගාමී වා, අනාගාමී වා, යො චායං පුග්ගලො දිට්ඨප්පත්තො, සො පස්ස සකදාගාමී වා අනාගාමී වා. න ඛොත්ථ සාරිපුත්ත සුකරං එකංසෙන ව්යාකාතුං, අයං ඉමෙසං තිණ්ණං පුග්ගලානං අභික්කන්තතරො ච පණීතතරො චාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඨානං හෙතං සාරිපුත්ත, විජ්ජති, ය්වායං පුග්ගලො දිට්ඨප්පත්තො ස්වාස්ස __අරහා, වා අරහත්තාය පටිපන්නො__,{*} ය්වායං පුග්ගලො සද්ධාවිමුත්තො, ස්වාස්ස සකදාගාමී වා, අනාගාමී වා. යො චායං පුග්ගලො කායසක්ඛී, සොපස්ස. සකදාගාමී වා අනාගාමී වා. න ඛොත්ථ සාරිපුත්ත, සුකරං එකංසෙන ව්යාකාතුං, අයං ඉමෙසං තිණ්ණං පුග්ගලානං අභික්කන්තතරො ච පණීතතරො චාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. __න ඛ්වෙත්ථ - මඡසං.__"
                    },
                    {
                        "type": "footnote",
                        "text": "*. අරහත්තාය පටිපන්නො - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "ඇවැත් කොට්ඨිතයෙනි, මේ පුද්ගලයෝ තුන් දෙනෙක් ලොව්හි විද්‍යමාන වෙත්. කවර තුන් දෙනෙක යත්: කායසක්ඛී ය, දිට්ඨප්පත්ත ය, සද්ධාවිමුත්තයි. ඇවැත්නි, මේ පුද්ගලයෝ තුන් දෙන ලොව්හි විද්‍යමාන වෙත්. ඇවැත්නි, මේ පුද්ගලයන් තුන් දෙනා අතුරෙන් යම් පුද්ගලයෙක් දිට්ඨප්පත්ත වේ ද, ඇවැත්නි, මේ පුද්ගලයන් තුන් දෙනා අතුරෙන් ඉතා මැනැවැයි ද, ඉතා ප්‍රණීතය යි ද, මට රුස්නේ වෙයි. ඒ කවර හෙයින යත්: ඇවැත්නි, මේ පුද්ගලයාගේ ප්‍රඥෙන්‍ද්‍රියය ඉතා බලවත් වේ ද, එහෙයිනි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉක්බිති ආයුෂ්මත් සැරියුත් තෙරණුවෝ ආයුෂ්මත් සවිට්ඨ තෙරණුවන් හා ආයුෂ්මත් මහාකොට්ඨිත තෙරණුවන්ට තෙල කීහ: ඇවැත්නි, අප හැම දෙනා විසින් සිය සිය වැටහීම ප්‍රකාශ කරණ ලදී. ඇවැත්නි, යම්හ, භාග්‍යවතුන් වහන්සේ කරා එළඹෙන්නම්හ. එළැඹ භාග්‍යවතුන් වහන්සේට මෙ පවත සැළ කරම්හ. භාග්‍යවතුන් වහන්සේ අපට යම් පරිද්දෙකින් වදාරණ සේක නම්, එපරිද්දෙන් එය දරන්නම්හ යී.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආයුෂ්මත් සවිට්ඨ තෙරණුවන් හා ආයුෂ්මත් මහාකොට්ඨිත තෙරණුවෝ ඇවැත්නි, එසේ ය යී ආයුෂ්මත් සැරියුත් තෙරණුවන්ට පිළිවදන් ඇස්වූහ. ඉක්බිති ආයුෂ්මත් සැරියුත් තෙරණුවෝ ආයුෂ්මත් සවිට්ඨ තෙරණුවන් හා ආයුෂ්මත් මහාකොට්ඨිත තෙරණුවන් හා භාග්‍යවතුන් වහන්සේ වෙත එළඹියාහුය. එළැඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පස් ව හුන්හ. එකත්පස් ව හුන් ආයුෂ්මත් සැරියුත් තෙරණුවෝ ආයුෂ්මත් සවිට්ඨ තෙරුන් හා ආයුෂ්මත් මහාකොට්ඨිත තෙරුන් හා සමග යම් බඳු කථාසල්ලාපයෙක් වී ද, ඒ හැම භාග්‍යවතුන් වහන්සේට සැළ කළහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ශාරීපුත්‍රය, මෙහි ලා මේ පුද්ගලයන් තුන්දෙනා අතුරෙන් මෙ තෙමේ වඩා මැනැවයි ද, වඩා ප්‍රණීතය යි ද, ඒකාන්තයෙන් ප්‍රකාශ කිරීම සුකර නො වේ. ශාරීපුත්‍රය, මෙබඳු කරුණෙක් ඇත: “යම් මේ පුද්ගලයෙක් සද්ධාවිමුත්ත වේ ද, හේ __අර්‍හත් හෝ අර්‍හත් මාර්‍ගයට පිළිපන්නේ හෝ__{*} වෙයි. යම් පුද්ගලයෙක් කායසක්ඛී වේ ද, හෙ සකෘදාගාමී හෝ අනාගාමී හෝ වෙයි. යම් මේ පුද්ගලයෙක් දිට්ඨප්පත්ත වේ ද, හෙ ද සකෘදාගාමී හෝ අනාගාමී හෝ වෙයි” ශාරීපුත්‍රය, මෙහි ලා මේ පුද්ගලයන් තුන් දෙනා අතූරෙන් මේ වඩා මැනැවැ යි ද, වඩා ප්‍රණීතය යි ද ඒකාන්තයෙන් ප්‍රකාශ කිරීම සුකර නො වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ශාරීපුත්‍රය, මෙබඳු කරුණෙක් ඇත: ‘යම් මේ පුද්ගලයෙක් කායසක්ඛී වේ ද, හෙ __අර්‍හත් හෝ අර්‍හත් මාර්‍ගයට පිළිපන්නේ හෝ__{*} වෙයි. යම් මේ පුද්ගලයෙක් සද්ධාවිමුත්ත වේ ද, හේ සකෘදාගාමී හෝ අනාගාමි හෝ වෙයි. යම් මේ පුද්ගලයෙක් දිට්ඨප්පත්ත වේ ද, හෙ ද සකෘදාගාමී හෝ අනාගාමී හෝ වෙයි.’ ශාරීපුත්‍ර ය, මෙහි ලා මේ පුද්ගලයන් තුන් දෙනා අතුරෙන් මේ වඩා මැනැවැ යි ද, වඩා ප්‍රණීතය යි ද, ඒකාන්තයෙන් ප්‍රකාශ කිරීම සුකර නො වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ශාරීපුත්‍රය, මෙබඳු කරුණෙක් ඇත: “යම් මේ පුද්ගලයෙක් දිට්ඨප්පත්ත වේ ද, හෙ __අර්‍හත් හෝ අර්‍හත් මාර්‍ගයට පිළිපන්නේ හෝ__{*} වෙයි. යම් මේ පුද්ගලයෙක් සද්ධාවිමුත්ත වේ ද, හේ සකෘදාගාමී හෝ අනාගාමී හෝ වෙයි. යම් මේ පුද්ගලයෙක් කායසක්ඛී වේ ද, හෙ ද සකෘදාගාමී හෝ අනාගාමි හෝ වෙයි” ශාරීපුත්‍රය, මෙහි ලා මේ පුද්ගලයන් තුන් දෙනා අතූරෙන් මේ වඩා මැනැවැ යි ද, වඩා ප්‍රණීතය යි ද ඒකාන්තයෙන් ප්‍රකාශ කිරීමට සුකර නො වේ යයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "*. අර්‍හත් මාර්‍ගයට පිළිපන්නේ - මඡසං. හා අටුවා අනුව වියයුතු පරිවර්තනය"
                    }
                ]
            }
        },
        {
            "pageNum": 226,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "(සාවත්ථිනිදානං:)"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 2.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "22. තයො’මෙ භික්ඛවෙ ගිලානා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ තයො: ඉධ භික්ඛවෙ එකච්චො ගිලානො ලභන්තො වා සප්පායානි භොජනානි, අලභන්තො වා සප්පායානි භොජනානි, ලභන්තො වා සප්පායානි භෙසජ්ජානි, අලභන්තො වා සප්පායානි භෙසජ්ජානි, ලභන්තො වා පතිරූපං උපට්ඨාකං, අලභන්තො වා පතිරූපං උපට්ඨාකං, නෙව වුට්ඨාති තම්හා ආබාධා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චො ගිලානො ලභන්තො වා සප්පායානි භොජනානි, අලභන්තො වා සප්පායානි භොජනානි, ලභන්තො වා සප්පායානි භෙසජ්ජානි, අලභන්තො වා සප්පායානි භෙසජ්ජානි, ලභන්තො වා පතිරූපං උපට්ඨාකං, අලභන්තො වා පතිරූපං උපට්ඨාකං, වුට්ඨාති තම්හා ආබාධා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො ගිලානො ලභන්තො’ව සප්පායානි භොජනානි නො අලභන්තො, ලභන්තො’ව සප්පායානි භෙසජ්ජානි නො අලභන්තො, ලභන්තො’ව පතිරූපං උපට්ඨාකං නො අලභන්තො, වුට්ඨාති තම්හා ආබාධා."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්‍ර භික්ඛවෙ ය්වායං ගිලානො ලභන්තො’ව සප්පායානි භොජනානි නො අලභන්තො, ලභන්තො’ව සප්පායානි භෙසජ්ජානි නො අලභන්තො, ලභන්තො’ව පතිරූපං උපට්ඨාකං නො අලභන්තො, වුට්ඨාති තම්හා ආබාධා, ඉමං ඛො භික්ඛවෙ ගිලානං පටිච්ච ගිලානභත්තං අනුඤ්ඤාතං, ගිලානභෙසජ්ජං අනුඤ්ඤාතං, ගිලානුපට්ඨාකො අනුඤ්ඤාතො; ඉමඤ්ච පන භික්ඛවෙ ගිලානං පටිච්ච අඤ්ඤෙපි ගිලානා උපට්ඨාතබ්බා. ඉමෙ ඛො භික්ඛවෙ තයො ගිලානා සන්තො සංවිජ්ජමානා ලොකස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ තයොමෙ ගිලානූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ තයො: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො ලභන්තො වා තථාගතං දස්සනාය, අලභන්තො වා තථාගතං දස්සනාය, ලභන්තො වා තථාගතප්පවෙදිතං ධම්මවිනයං සවණාය, අලභන්තො වා තථාගතප්පවෙදිතං ධම්මවිනයං සවණාය, නෙවොක්කමති{1} නියාමං කුසලෙසු ධම්මෙසු සම්මත්තං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො පුග්ගලො ලභන්තො වා තථාගතං දස්සනාය, අලභන්තො වා තථාගතං දස්සනාය, ලභන්තො වා තථාගතප්පවෙදිතං ධම්මවිනයං සවණාය, අලභන්තො වා තථාගතප්පවෙදිතං ධම්මවිනයං සවනාය, වොක්කමති{2} නියාමං කුසලෙසු ධම්මෙසු සම්මත්තං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො පුග්ගලො ලභන්තො’ව{3} තථාගතං දස්සනාය, නො අලභන්තො, ලභන්තො’ව තථාගතප්පවෙදිතං ධම්මවිනයං සවණාය, නො අලභන්තො වොක්කමති{2} නියාමං කුසලෙසු ධම්මෙසු සම්මත්තං."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ර භික්ඛවෙ ය්වායං පුග්ගලො ලභන්තො’ව තථාගතං දස්සනාය, නො අලභන්තො, ලභන්තො’ව තථාගතප්පවෙදිතං ධම්මවිනයං සවණාය, නො අලභන්තො, වොක්කමති{2} නියාමං කුසලෙසු ධම්මෙසු සම්මත්තං. ඉමං ඛො භික්ඛවෙ පුග්ගලං පටිච්ච ධම්මදෙසනා අනුඤ්ඤාතා. ඉමඤ්ච පන භික්ඛවෙ පුග්ගලං පටිච්ච අඤ්ඤෙසම්පි ධම්මො දෙසෙතබ්බො. ඉමෙ ඛො භික්ඛවෙ තයො ගිලානූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. නෙව ඔක්කමති - මඡසං. PTS. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ඔක්කමති - මඡසං. ස්යා. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ලභන්තො - ස්යා. PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "[සැවැත්නිදානයි:]"
                    },
                    {
                        "text": "3. 1. 3. 2.",
                        "type": "heading",
                        "level": 1
                    },
                    {
                        "text": "22. මහණෙනි, ලොව්හි මේ ගිලන්නු තුන් දෙනෙක් ඇත. කවර තුන් දෙනෙක යත්: මහණෙනි, මෙ ලොව්හි කිසි ගිලනෙක් පථ්‍ය භෝජන ලබන්නේ හෝ පථ්‍ය භෝජන නො ලබන්නේ හෝ, පථ්‍ය බෙහෙත් ලබන්නේ හෝ පථ්‍ය බෙහෙත් නො ලබන්නේ හෝ, නිසි උපස්ථායකයකු ලබන්නේ හෝ නිසි උපස්ථායකයකු නො ලබන්නේ හෝ ඒ ආබාධයෙන් නොමැ නැගි සිටුනේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි කිසි ගිලනෙක් පථ්‍ය භෝජන ලබන්නේ හෝ පථ්‍ය භෝජන නො ලබන්නේ හෝ, පථ්‍ය බෙහෙත් ලබන්නේ හෝ පථ්‍ය බෙහෙත් නො ලබන්නේ හෝ, නිසි උපස්ථායකයකු ලබන්නේ හෝ නිසි උපස්ථායකයකු නො ලබන්නේ හෝ, ඒ ආබාධයෙන් නැගි සිටුනේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි කිසි ගිලනෙක් පථ්‍ය භොජන නො ලබනු නොව ලබනුයේ ම, පථ්‍ය බෙහෙත් නො ලබනු නොව ලබනුයේ ම, නිසි උපස්ථායකයකු නො ලබනු නොව ලබනුයේ ම, ඒ ආබාධයෙන් නැගි සිටුනේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එහි ලා යම් ගිලනෙක් පථ්‍ය භෝජන නො ලබනු නො ව ලබනුයේ ම, පථ්‍ය බෙහෙත් නො ලබනු නො ව ලබනුයේ ම, නිසි උපස්ථායකයකු නො ලබනු නො ව ලබනුයේ ම, ඒ ආබාධයෙන් නැගේ ද, මහණෙනි, මේ ගිලනා පිණිස ගිලන් බත අනුදන්නා ලදී. ගිලන් බෙහෙත් අනුදන්නා ලදී. ගිලන් උවටෙක් අනුදන්නා ලද්දේ ය. මහණෙනි, මේ ගිලනා නිසා අන් ගිලන්නු ද උවටැන් කළයුත්තාහු වෙති. මහණෙනි, මේ වනාහි ලොව්හි විද්‍යමාන වූ ගිලන්නු තුන් දෙන වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිද්දෙන් ම ලොව්හි මේ ගිලනුන් බඳු පුද්ගලයෝ තුන්දෙනෙක් විද්‍යමාන වෙත්. කවර තුන් දෙනෙක යත්: මහණෙනි, මෙ ලොව්හි ඇතැම් පුද්ගලයෙක් තථාගතයන් වහන්සේ දක්නට ලබන්නේ හෝ තථාගතයන් දක්නට නොලබන්නේ හෝ තථාගතයන් දෙසූ ධර්‍මවිනය අසන්නට ලබන්නේ හෝ තථාගතයන් දෙසූ ධර්‍මවිනය අසන්නට නොලබන්නේ හෝ කුශලධර්‍මවිෂයෙහි මාර්‍ගනියාම සඞ්ඛ්‍යාත සම්‍යක්ත්‍වයට නො පැමිණෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි කිසි පුද්ගලයෙක් තථාගතයන් දක්නට ලබන්නේ හෝ තථාගතයන් දක්නට නො ලබන්නේ හෝ තථාගතයන් දෙසූ ධර්‍මවිනය අසන්නට ලබන්නේ හෝ තථාගතයන් දෙසූ ධර්‍මවිනය අසන්නට නොලබන්නේ හෝ කුශලධර්‍මයන් විෂයෙහි මාර්‍ගනියාම සඞ්ඛ්‍යාත සම්‍යක්ත්‍වයට පැමිණෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි කිසි පුද්ගලයෙක් තථාගතයන් දක්නට නොලබනු නොව ලබන්නේ ම, තථාගතයන් දෙසු ධර්මවිනය අසන්නට නොලබනු නොව ලබන්නේ ම කුසලධර්මයන් විෂයෙහි මාර්‍ගනියාම සඞ්ඛ්‍යාත සම්‍යක්ත්‍වයට පැමිණෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එහි ලා යම් පුද්ගලයෙක් තථාගතයන් දක්නට නොලබනු නොව ලබන්නේ ම, තථාගතයන් දෙසූ ධර්‍මවිනය අසන්නට නොලබනු නොව ලබන්නේ ම, කුශල ධර්‍මයන් විෂයෙහි මාර්‍ගනියාම සඞ්ඛ්‍යාත සම්‍යක්ත්‍වයට පැමිණේ ද, මේ පුඟුලා පිණිස ධර්‍මදේශනාව අනුදන්නා ලදු. මහණෙනි, මේ පුඟුලා පිණිස අනුන්ට ධර්‍මය දෙසිය යුතුයි. මහණෙනි, ලොව්හි ගිලනුන් උපමා කොට ඇති මේ පුද්ගලයෝ තුන් දෙන විද්‍යමාන වෙත්.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 228,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 3.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "23. තයො’මෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ තයො: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො සබ්යාපජ්ඣං කායසඞ්ඛාරං අභිසඞ්ඛරොති, සබ්යාපජ්ඣං වචීසඞ්ඛාරං අභිසඞ්ඛරොති, සබ්යාපජ්ඣං මනොසඞ්ඛාරං අභිසඞ්ඛරොති. සො සබ්යාපජ්ඣං කායසඞ්ඛාරං අභිසඞ්ඛරිත්වා සබ්යාපජ්ඣං වචීසඞ්ඛාරං අභිසඞ්ඛරිත්වා සබ්යාපජ්ඣං මනොසඞ්ඛාරං අභිසඞ්ඛරිත්වා සබ්යාපජ්ඣං ලොකං උපපජ්ජති. තමෙනං සබ්යාපජ්ඣං ලොකං උපපන්නං සමානං සබ්යාපජ්ඣා ඵස්සා ඵුසන්ති. සො සබ්යාපජ්ඣෙහි ඵස්සෙහි ඵුට්ඨො සමානො සබ්යාපජ්ඣං වෙදනං වෙදියති එකන්තදුක්ඛං, සෙය්යථාපි සත්තා නෙරයිකා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො පුග්ගලො අබ්යාපජ්ඣං කායසඞ්ඛාරං අභිසඞ්ඛරොති, අබ්යාපජ්ඣං වචීසඞ්ඛාරං අභිසඞ්ඛරොති, අබ්යාපජ්ඣං මනොසඞ්ඛාරං අභිසඞ්ඛරොති. සො අබ්යාපජ්ඣං කායසඞ්ඛාරං අභිසඞ්ඛරිත්වා අබ්යාපජ්ඣං වචීසඞ්ඛාරං අභිසඞ්ඛරිත්වා අබ්යාපජ්ඣං මනොසඞ්ඛාරං අභිසඞ්ඛරිත්වා අබ්යාපජ්ඣං ලොකං උපපජ්ජති. තමෙනං අබ්යාපජ්ඣං ලොකං උපපන්නං සමානං අබ්යාපජ්ඣා ඵස්සා ඵුසන්ති. සො අබ්යාපජ්ඣෙහි ඵස්සෙහි ඵුට්ඨො සමානො අබ්යාපජ්ඣං වෙදනං වෙදියති එකන්තසුඛං, සෙය්යථාපි දෙවා සුභකිණ්හා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො පුග්ගලො සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි කායසඞ්ඛාරං අභිසඞ්ඛරොති, සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි වචීසඞ්ඛාරං අභිසඞ්ඛරොති, සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි මනොසඞ්ඛාරං අභිසඞ්ඛරොති. සො සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි කායසඞ්ඛාරං අභිසඞ්ඛරිත්වා සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි වචීසඞ්ඛාරං අභිසඞ්ඛරිත්වා සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි මනොසඞ්ඛාරං අභිසඞ්ඛරිත්වා සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි ලොකං උපපජ්ජති. තමෙනං සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි ලොකං උපපන්නං සමානං සබ්යාපජ්ඣාපි අබ්යාපජ්ඣාපි ඵස්සා ඵුසන්ති. සො සබ්යාපජ්ඣෙහිපි අබ්යාපජ්ඣෙහිපි ඵස්සෙහි ඵුට්ඨො සමානො සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි වෙදනං වෙදියති වොකිණ්ණසුඛදුක්ඛං, සෙය්යථාපි මනුස්සා, එකච්චෙ ච දෙවා, එකච්චෙ ච විනිපාතිකා. ඉමෙ ඛො භික්ඛවෙ තයො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 4.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "24. තයො’මෙ භික්ඛවෙ පුග්ගලා පුග්ගලස්ස බහුකාරා. කතමෙ තයො: යං භික්ඛවෙ පුග්ගලං ආගම්ම පුග්ගලො බුද්ධං සරණං ගතො හොති, ධම්මං සරණං ගතො හොති, සඞ්ඝං සරණං ගතො හොති. අයං භික්ඛවෙ පුග්ගලො ඉමස්ස පුග්ගලස්ස බහුකාරො."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ යං පුග්ගලං ආගම්ම පුග්ගලො ඉදං දුක්ඛන්ති යථාභූතං පජානාති, අයං දුක්ඛසමුදයොති යථාභූතං පජානාති, අයං දුක්ඛනිරොධොති යථාභූතං පජානාති, අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං පජානාති. අයං භික්ඛවෙ පුග්ගලො ඉමස්ස පුග්ගලස්ස බහුකාරො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 3.",
                        "level": 1
                    },
                    {
                        "text": "23. මහණෙනි, මේ පුද්ගලයෝ තුන්දෙනෙක් ලොව්හි විද්‍යමාන වෙත්. කවර තුන් දෙනක යත්: මහණෙනි, මෙ ලොව්හි කිසි පුඟුලෙක් දුඃඛ සහිත (කායද්වාරයෙහි උපදනා චෙතනා රාශිය යි කියන ලද) කායසංස්කාරය රැස් කෙරෙයි. දුඃඛ සහිත (වාග්ද්වාරයෙහි උපදනා චෙතනා රාශිය යි කියන ලද) වාක්සංස්කාරය මුළු කෙරෙයි. දුඃඛ සහිත (මනොද්වාරයෙහි උපදනා චෙතනා රාශිය යි කියන ලද) මනඃසංස්කාරය පිඬු කෙරෙයි. හේ දුඃඛ සහිත කායසංස්කාරය රැස් කොට, දුඃඛ සහිත වාක්සංස්කාරය මුළු කොට, දුඃඛ සහිත මනඃසංස්කාරය පිඬු කොට දුඃඛ සහිත ලෝකයට පැමිණෙයි. දුඃඛ සහිත ලෝකයට පැමිණියා වූ ම ඔහු දුඃඛ සහිත ස්පර්‍ශයෝ පහස්නාහ. හේ දුඃඛ සහිත ස්පර්‍ශයන් විසින් පහස්නා ලදුයේ ම නිරිසතුන් සෙයින් ඒකාන්තයෙන් දුක් වූ සාබාධවිපාක වෙදනාව විඳුනේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි කිසි පුද්ගලයෙක් නිදුක් කායසංස්කාරය රැස් කෙරෙයි. නිදුක් වාක්සංස්කාරය රැස් කෙරෙයි. නිදුක් මනඃසංස්කාරය රැස් කෙරෙයි. හේ නිදුක් කායසංස්කාරය රැස් කොට, නිදුක් වාක්සංස්කාරය රැස් කොට නිදුක් මනඃසංස්කාරය රැස් කොට නිදුක් ලෝකයට පැමිණෙයි. නිදුක් ලොවට පැමිණියා වූ ම ඔහු නිදුක් ස්පර්‍ශයෝ පහස්නාහ. හේ නිදුක් ස්පර්‍ශයන් විසින් පහස්නා ලදුයේ ම සුභකිණ්ණ දෙවියන් සෙයින් නිදුක් ඒකාන්ත සුව ඇති විපාක වෙදනාව විඳුනේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි කිසි පුද්ගලයෙක් දුඃඛ සහිත වූ ද, දුඃඛ රහිත වූ ද කායසංස්කාරය රැස් කෙරෙයි. දුඃඛ සහිත වූ ද දුඃඛ රහිත වූ ද වාක්සංස්කාරය රැස් කෙරෙයි. දුඃඛ සහිත වූ ද දුඃඛ රහිත වූ ද මනඃසංස්කාරය රැස් කෙරෙයි. දුඃඛ සහිත වූ ද දුඃඛ රහිත වූ ද කායසංස්කාරය රැස් කොට දුඃඛ සහිත වූ ද දුඃඛ රහිත වූ ද වාක්සංස්කාරය රැස් කොට, දුඃඛ සහිත වූ ද දුඃඛ රහිත වූ ද මනඃසංස්කාරය රැස් කොට දුඃඛ සහිත වූ ද දුඃඛ රහිත වූ ද ලෝකයට පැමිණෙයි. දුඃඛ සහිත වූ ද දුඃඛ රහිත වූ ද ලෝකයට පැමිණියා වූ ම ඔහු දුඃඛ සහිත වූ ද දුඃඛ රහිත වූ ද ස්පර්‍ශයෝ පහස්නාහ. දුඃඛ සහිත වූ ද දුඃඛ රහිත වූ ද ස්පර්‍ශයන් විසින් පහස්නා ලදුයේ ම හේ __ඇතැම් මිනිසුන් හා ඇතැම් __විනිපාත දෙවියන්__ සෙයින්__{1} දුඃඛ සහිත වූ ද දුඃඛ රහිත වූ ද සුවදුක් මුසු වූ වේදනාව විඳුනේ ය. මහණෙනි, මේ පුද්ගලයෝ තිදෙන ලොව්හි විද්‍යමාන වෙති.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 4.",
                        "level": 1
                    },
                    {
                        "text": "24. මහණෙනි, මේ පුද්ගලයෝ තුන් දෙනෙක් පුද්ගලයක්හට බොහෝ වහල් වෙති. කවර තුන් දෙනෙක යත්: මහණෙනි, යම් පුඟුලකු වෙත පැමිණ පුද්ගල තෙමේ බුදුන් සරණ ගියා වේ ද, දහම් සරණ ගියා වේ ද, සඟුන් සරණ ගියා වේ ද, මහණෙනි, මේ ඇදුරු පුද්ගල තෙමේ මේ අතැවැසි පුද්ගලයාහට බොහෝ වහල් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තවද මහණෙනි, යම් පුද්ගලයකු වෙත පැමිණ පුද්ගල තෙමේ ‘මේ දුකැ’යි තත් වූ පරිද්දෙන් දන්නේ වේ ද, ‘මේ දුක් ඉපැදීමෙහි හේතුය’යි තත් වූ පරිද්දෙන් දන්නේ වේ ද, ‘මේ දුක් නැති කිරීමැ’යි තත් වූ පරිද්දෙන් දන්නේ වේ ද, ‘මේ දුක් නැති කරණු පිණිස යන ප්‍රතිපදාය’ යි තත් වූ පරිද්දෙන් දන්නේ වේ ද, මහණෙනි, මේ ඇදුරු පුද්ගල තෙමේ මේ අතැවැසි පුද්ගලයාහට බොහෝ වහල් වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඇතැම් මිනිසුන්, ඇතැම් විනිපාතිකයින් හා ඇතැම් දෙවියන් සෙයින් - **අටුවා.**"
                    }
                ]
            }
        },
        {
            "pageNum": 230,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ යං පුග්ගලං ආගම්ම පුග්ගලො ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති; අයං භික්ඛවෙ පුග්ගලො ඉමස්ස පුග්ගලස්ස බහුකාරො. ඉමෙ ඛො භික්ඛවෙ තයො පුග්ගලා පුග්ගලස්ස බහුකාරා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ච පන භික්ඛවෙ තීහි පුග්ගලෙහි ඉමස්ස පුග්ගලස්ස නත්ථඤ්ඤො පුග්ගලො බහුකාරතරොති වදාමි. ඉමෙසඤ්ච භික්ඛවෙ තිණ්ණං පුග්ගලානං ඉමිනා පුග්ගලෙන න සුප්පතිකාරං වදාමි, යදිදං අභිවාදන පච්චුට්ඨාන අඤ්ජලිකම්ම සාමීචිකම්ම චීවරපිණ්ඩපාතසෙනාසන ගිලානපච්චය භෙසජ්ජපරික්ඛාරානුප්පදානෙනාති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 5.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "25. තයො’මෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ තයො: අරුකූපමචිත්තො පුග්ගලො, විජ්ජූපමචිත්තො{1} පුග්ගලො, වජිරූපමචිත්තො{2} පුග්ගලො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ අරුකූපමචිත්තො පුග්ගලො: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො කොධනො හොති උපායාසබහුලො, අප්පම්පි වුත්තො සමානො අභිසජ්ජති, කුප්පති, බ්යාපජ්ජති, පතිත්ථියති, කොපඤ්ච දොසඤ්ච අප්පච්චයඤ්ච පාතුකරොති. සෙය්යථාපි{3} භික්ඛවෙ දුට්ඨාරුකා{4} කට්ඨෙන වා කඨලෙන{5} වා ඝට්ටිතා{6} භිය්යොසොමත්තාය අස්සන්දති;{7} එවමෙව ඛො භික්ඛවෙ ඉධෙකච්චො පුග්ගලො කොධනො හොති උපායාසබහුලො අප්පම්පි වුත්තො සමානො අභිසජ්ජති, කුප්පති, බ්යාපජ්ජති, පතිත්ථියති, කොපඤ්ච දොසඤ්ච අප්පච්චයඤ්ච පාතුකරොති. අයං වුච්චති භික්ඛවෙ අරුකූපමචිත්තො පුග්ගලො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ විජ්ජූපමචිත්තො පුග්ගලො: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො ඉදං දුක්ඛන්ති යථාභූතං පජානාති, අයං දුක්ඛසමුදයොති යථාභූතං පජානාති, අයං දුක්ඛනිරොධොති යථාභූතං පජානාති, අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං පජානාති. සෙය්යථාපි භික්ඛවෙ චක්ඛුමා පුරිසො රත්තන්ධකාරතිමිසායං විජ්ජන්තරිකාය රූපානි පස්සෙය්ය, එවමෙව ඛො භික්ඛවෙ ඉධෙකච්චො පුග්ගලො ඉදං දුක්ඛන්ති යථාභූතං පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති, යථාභූතං පජානාති. අයං වුච්චති භික්ඛවෙ විජ්ජූපමචිත්තො පුග්ගලො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ වජිරූපමචිත්තො පුග්ගලො: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති. සෙය්යථාපි භික්ඛවෙ වජිරස්ස නත්ථි කිඤ්චි අභෙජ්ජං, මණි වා පාසාණො වා. එවමෙව ඛො භික්ඛවෙ ඉධෙකච්චො පුග්ගලො ආසවානං ඛයා -පෙ- සච්ඡිකත්වා උපසම්පජ්ජ විහරති. අයං වුච්චති භික්ඛවෙ වජිරූපමචිත්තො පුග්ගලො. ඉමෙ ඛො භික්ඛවෙ තයො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. විජ්ජුපමචිත්තො - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. වජිරුපමචිත්තො - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. සෙය්යථාපි නාම - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "4. දුට්ඨාරුකො - ස්යා මඡසං. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "5. කඨලාය වා - සී 1, මඡසං, ස්යා. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "6. ඝට්ටිතො - මඡසං. ස්යා. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "7. අස්සවනොති - සීමු. ආසවං දෙති - PTS. මඡසං. ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "තවද මහණෙනි, යම් පුද්ගලයකු වෙත පැමිණි පුද්ගල තෙමේ ආස්‍රවයන්ගේ ක්‍ෂයහේතුයෙන් අනාස්‍රව වූ ඵලසමාධිය ද ඵලප්‍රඥාව ද ඉහාත්මයෙහි ම තමා විසින් වෙසෙසින් දැන ප්‍රත්‍යක්‍ෂ කොට උපයා ගෙණ වාසය කරන්නේ වේ ද, මහණෙනි, මේ ඇදුරු පුද්ගල තෙමේ මේ අතැවැසි පුද්ගලයාහට බොහෝ උපකාරවත් ෙවේ. මහණෙනි, මේ ඇදුරු පුද්ගලයෝ තුන් දෙන මේ අතැවැසි පුද්ගලයාහට බොහෝ උපකාරවත් වෙති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පුද්ගලයෝ තුන් දෙනාට වඩා මේ අතැවැසි පුද්ගලයාට උපකාර ඇති අනෙක් පුද්ගලයෙක් නැතියි කියමි. මහණෙනි, මේ පුද්ගලයන් තුන් දෙනාහට මේ (අතැවැසි) පුඟුලා විසින් මනා සේ ප්‍රත්‍යුපකාර කිරීම සුකර නො වෙති යි කියමි. හේ කිමෙකින: වැඳීම ය, දැක හුනස්නෙන් නැගී සිටීම ය, ඇඳිලි කිරීම ය, උවසර කිරීම ය, චීවර පිණ්ඩපාත සේනාසන ගිලානපච්චය හා බෙහෙත් පිරිකර දීමය යන මෙයිනි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 5.",
                        "level": 1
                    },
                    {
                        "text": "25. මහණෙනි, මේ පුද්ගලයෝ තුන් දෙනෙක් ලොව්හි විද්‍යමාන වෙත්. කවර තුන් දෙනෙක යත්: පැරැණි වණයක් බඳු සිත් ඇති පුද්ගලය, විදුලිය බඳු සිත් ඇති පුද්ගලය, විදුරක් බඳු සිත් ඇති පුද්ගල යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පැරැණි වණයක් බඳු සිත් ඇති පුද්ගල කවරේය යත්: මහණෙනි, මෙලොව්හි කිසි පුඟුලෙක් කිපෙන සුලු වෙයි, දැඩි ආයාස බහුල කොට ඇත්තේ වෙයි, මඳකුදු කියනු ලැබුයේ ම ලැගෙයි, කිපෙයි, ප්‍රකෘතිය පියයි, තද ව සිටී, කෝපයත් ද්වෙෂයත් නොසතුටත් පහළ කෙරෙයි. මහණෙනි, යම් පරිදි දඬුකඩෙකින් හෝ කැබිලිත්තෙකින් හෝ ගටනා ලද පැරැණි වණයක් වෙසෙසින් (ලෙ සැරව) වගුරුවා ද, මහණෙනි, එපරිද්දෙන් ම මෙ ලොව්හි කිසි පුද්ගලයෙක් කිපෙන සුලු වෙයි. දැඩි ආයාස බහුල කොට ඇත්තේ වෙයි. මඳකුදු කියනු ලැබුයේ ම ලැගෙයි, කිපෙයි, ප්‍රකෘතිය අත් හරියි, තදව සිටී, කෝපයත් ද්වෙෂයත් නොසතුටක් පහළ කෙරෙයි. මහණෙනි, මෙ පැරැණි වණයක් බඳු සිත් ඇති පුද්ගලයා යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, විදුලිය බඳු සිත් ඇති පුද්ගල කවරේය යත්: මහණෙනි, මෙ ලොව්හි කිසි පුද්ගලයෙක් “මේ දුකැ” යි තත් වූ පරිද්දෙන් දනී. “මේ දුක් උපදනා හෙතු ය” යි තත් වූ පරිද්දෙන් දනී. “මේ දුක් නැති කිරීම ය” යි තත් වූ පරිද්දෙන් දනී. “මේ දුක් නැති කරණු පිණිස යන පිළිවෙත ය” යි තත් වූ පරිද්දෙන් දනී. මහණෙනි, යම් පරිදි ඇස් ඇති පුරුෂයෙක් ගණඳුරු රැයෙහි විදුලිය පවත්නා අතුරෙහි රූ දක්නේ වේ ද, මහණෙනි, එපරිදි මෙ ලොව්හි කිසි පුද්ගලයෙක් “මේ දුකැ” යි තත් වූ පරිද්දෙන් දනී. ... ‘මේ දුක් නැති කරණ පිළිවෙතැ’ යි තත් වූ පරිද්දෙන් දනී. මහණෙනි, විදුලිය බඳු සිත් ඇති පුද්ගලයා යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, විදුර බඳු සිත් ඇති පුද්ගල කවරේය යත්: මහණෙනි, මෙ ලොව්හි කිසි පුද්ගලයෙක් අනාස්‍රව වූ ඵලසමාධිය ද ඵලප්‍රඥාව ද ඉහාත්මයෙහි ම තමා විසින් විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්‍ෂ කොට ඇටි ඇටි සඳ සමවැද වෙසෙයි. මහණෙනි, යම් පරිදි මිණෙක් වේවයි, පහණෙක් වේවයි, විදුර විසින් නොබිඳලියහෙන දැයෙක් නැද්ද, මහණෙනි, එපරිද්දෙන් ම මෙ ලොව්හි කිසි පුද්ගලයෙක් ආස්‍රවක්‍ෂයන් ... ප්‍රත්‍යක්‍ෂ කොට උපයා වෙසෙයි. මහණෙනි, මෙ විදුර බඳු සිත් ඇති පුද්ගලයා යි කියනු ලැබේ. මහණෙනි, මේ වනාහි ලෝකයෙහි විද්‍යමාන වන පුද්ගලයෝ තුන් දෙන වෙත්.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 232,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 6",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "26. තයො’මෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ තයො: අත්ථි භික්ඛවෙ පුග්ගලො න සෙවිතබ්බො න භජිතබ්බො න පයිරුපාසිතබ්බො. අත්ථි භික්ඛවෙ පුග්ගලො සෙවිතබ්බො භජිතබ්බො පයිරුපාසිතබ්බො. අත්ථි භික්ඛවෙ පුග්ගලො සක්කත්වා ගරුකත්වා සෙවිතබ්බො භජිතබ්බො පයිරුපාසිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පුග්ගලො න සෙවිතබ්බො න භජිතබ්බො න පයිරුපාසිතබ්බො: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො හීනො හොති සීලෙන සමාධිනා පඤ්ඤාය. එවරූපො භික්ඛවෙ පුග්ගලො න සෙවිතබ්බො න භජිතබ්බො න පයිරුපාසිතබ්බො අඤ්ඤත්ර අනුද්දයාය{1} අඤ්ඤත්ර අනුකම්පාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පුග්ගලො සෙවිතබ්බො භජිතබ්බො පයිරුපාසිතබ්බො: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො සදිසො හොති සීලෙන සමාධිනා පඤ්ඤාය. එවරූපො භික්ඛවෙ පුග්ගලො සෙවිතබ්බො, භජිතබ්බො, පයිරුපාසිතබ්බො. තං කිස්ස හෙතු: සීලසාමඤ්ඤගතානං සතං සීලකථා ච නො භවිස්සති, සා ච නො පවත්තනී{2} භවිස්සති. සා ච නො ඵාසු භවිස්සති. සමාධිසාමඤ්ඤගතානං සතං සමාධිකථා ච නො භවිස්සති, සා ච නො පවත්තනී{2} භවිස්සති, සා ච නො ඵාසු භවිස්සති. පඤ්ඤාසාමඤ්ඤගතානං සතං පඤ්ඤාකථා ච නො භවිස්සති, සා ච නො පවත්තනී{2} භවිස්සති, සා ච නො ඵාසු භවිස්සතීති. තස්මා එවරූපො පුග්ගලො සෙවිතබ්බො භජිතබ්බො පයිරුපාසිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පුග්ගලො සක්කත්වා ගරුකත්වා සෙවිතබ්බො භජිතබ්බො පයිරුපාසිතබ්බො: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො අධිකො හොති සීලෙන සමාධිනා පඤ්ඤාය. එවරූපො භික්ඛවෙ පුග්ගලො සක්කත්වා ගරුකත්වා සෙවිතබ්බො භජිතබ්බො පයිරුපාසිතබ්බො. තං කිස්ස හෙතු: ඉති අපරිපූරං වා සීලක්ඛන්ධං පරිපූරෙස්සාමි, පරිපූරං වා සීලක්ඛන්ධං තත්ථ තත්ථ පඤ්ඤාය අනුග්ගහෙස්සාමි. අපරිපූරං වා සමාධික්ඛන්ධං පරිපූරෙස්සාමි, පරිපූරං වා සමාධික්ඛන්ධං තත්ථ තත්ථ පඤ්ඤාය අනුග්ගහෙස්සාමි. අපරිපූරං වා පඤ්ඤාක්ඛන්ධං පරිපූරෙස්සාමි, පරිපූරං වා පඤ්ඤාක්ඛන්ධං තත්ථ තත්ථ පඤ්ඤාය අනුග්ගහෙස්සාමීති. තස්මා එවරූපො පුග්ගලො සක්කත්වා ගරුකත්වා සෙවිතබ්බො භජිතබ්බො පයිරුපාසිතබ්බො. ඉමෙ ඛො භික්ඛවෙ තයො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "gatha",
                        "text": "1. නිහීයති පුරිසො නිහීනසෙවී\n න ච හායෙථ කදාචි තුල්යසෙවී, \n සෙට්ඨමුපනමං උදෙති ඛිප්පං \n තස්මා අත්තනො උත්තරිං භජෙථාති.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අනුද්දයා . අනුකම්පා - ස්යා. මඡසං. සී 1. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. පවත්තිනී - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 6.",
                        "level": 1
                    },
                    {
                        "text": "26. මහණෙනි, මේ පුද්ගලයෝ තුන් දෙනෙක් ලොව්හි විද්‍යමාන වෙත්. කවර තුන් දෙනෙක යත්: මහණෙනි, නො එළඹියයුතු නො ඇලියයුතු පුනපුනා නො එළඹියයුතු පුද්ගලයෙක් ඇත. මහණෙනි, සේවනය කටයුතු භජනය කටයුතු පර්‍ය්‍යුපාසනය කටයුතු පුද්ගලයෙක් ඇත. මහණෙනි, සත්කාර කොට ගුරුකාර කොට සේවනය කටයුතු පර්‍ය්‍යුපාසනය කටයුතු පුද්ගලයෙක් ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සේවනය නො කටයුතු භජනය නො කටයුතු පර්‍ය්‍යුපාසනය නො කටයුතු පුද්ගලයා කවරේය යත්: මහණෙනි, මෙ ලොව්හි කිසි පුද්ගලයෙක් ශීලයෙන් සමාධියෙන් ප්‍රඥායෙන් (තමහට) හීන වේ ද, මහණෙනි, මෙබඳු පුද්ගල සේවනය නො කටයුතුය. භජනය නො කටයුතුය. පර්‍ය්‍යුපාසනය නො කටයුතුය. දයාව හැරයි, අනුකම්පාව හැරයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සේවනය කටයුතු, භජනය කටයුතු, පර්‍ය්‍යුපාසනය කටයුතු පුද්ගල කවරේය යත්: මහණෙනි, මෙ ලොව්හි කිසි පුද්ගලයෙක් ශීලයෙන් සමාධියෙන් ප්‍රඥායෙන් (තමහට) සමාන වේ ද, මහණෙනි, මෙබඳු පුද්ගල සේවනය කටයුතුය. භජනය කටයුතුය. පර්‍ය්‍යුපාසනය කටයුතු ය. ඒ කවර හෙයින යත්: ශීලයෙන් සමාන බවට ගියා වූ ම අපගේ ශීල කථාව ද වෙයි, අපගේ ඒ කථාව ද පවත්නී වෙයි, ඒ කථාව අපට පහසු ද වෙයි. සමාධියෙන් සමාන බවට ගියා වූ ම අපගේ සමාධිකථාව ද වෙයි, එය අපගේ පවත්නා කථාව ද වෙයි, ඒ කථාව අපට පහසු ද වෙයි. ප්‍රඥායෙන් සමාන බවට ගියා වූ ම අපගේ ප්‍රඥාකථාව ද වෙයි, එය අපගේ පවත්නා කථාව ද වෙයි, ඒ කථාව අපට පහසු ද වෙයි. එහෙයින් මෙබඳු වූ පුද්ගල සේවනය කටයුත්තේ ය. භජනය කටයුත්තේ ය. පර්‍ය්‍යුපාසනය කටයුත්තේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කවර පුද්ගලයෙක් සත්කාර කොට ගුරුකාර කොට සේවනය කටයුත්තේ වේ ද, භජනය කටයුත්තේ වේ ද, පර්‍ය්‍යුපාසනය කටයුත්තේ වේ ද: මහණෙනි, මෙ ලොව්හි කිසි පුද්ගලයෙක් ශීලයෙන් සමාධියෙන් ප්‍රඥායෙන් (තමහට) වැඩි තරම් වේ ද, මහණෙනි, මෙබඳු වූ පුද්ගල සත්කාර කොට ගුරුකාර කොට සේවනය කටයුත්තේය. භජනය කටයුත්තේ ය. පර්‍ය්‍යුපාසනය කටයුත්තේය. ඒ කවර හෙයින යත්: මෙසේ නො පිරිපුන් හෝ සිල්කඳ පුරමි. පිරිපුන් හෝ සිල්කඳ ඒ ඒ තන්හි ප්‍රඥායෙන් අනුගන්මි. නො පිරිපුන් හෝ සමාධිස්කන්‍ධය පුරමි. පිරිපුන් හෝ සමාධිස්කන්‍ධය ඒ ඒ තන්හි ප්‍රඥායෙන් අනුගන්මි. නො පිරිපුන් හෝ ප්‍රඥාස්කන්‍ධය පුරමි. පිරිපුන් හෝ ප්‍රඥාස්කන්‍ධය ඒ ඒ තන්හි ප්‍රඥායෙන් අනුගන්මි. එහෙයින් මෙබඳු වූ පුද්ගල සත්කාර කොට ගරුකාර කොට සේවනය කටයුත්තේ ය. භජනය කටයුත්තේය. පර්‍ය්‍යුපාසනය කටයුත්තේය. මහණෙනි, මේ පුද්ගලයෝ තිදෙනා ලොකයෙහි විද්‍යමාන වෙති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "1. තමනට වඩා (ගුණයෙන්) හීනයන් සෙවුනා පුරුෂ පිරිහෙයි. තමන් හා (ගුණයෙන්) සමාන පුඟුලන් සෙවුනා පුරුෂ කිසි කලෙකත් නො පිරිහෙයි. තමනට වඩා (ගුණයෙන්) වැඩුනවුන් වෙත නැමෙන්නේ වහා වැඩෙයි. එහෙයින් තමනට වඩා (ගුණයෙන්) වැඩිතැනැත්තකු භජනය කරන්නේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 234,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 7",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "27. තයො’මෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ තයො: අත්ථි භික්ඛවෙ පුග්ගලො ජිගුච්ඡිතබ්බො, න සෙවිතබ්බො, න භජිතබ්බො, න පයිරුපාසිතබ්බො. අත්ථි භික්ඛවෙ පුග්ගලො අජ්ඣුපෙක්ඛිතබ්බො, න සෙවිතබ්බො, න භජිතබ්බො, න පයිරුපාසිතබ්බො. අත්ථි භික්ඛවෙ පුග්ගලො සෙවිතබ්බො, භජිතබ්බො, පයිරුපාසිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පුග්ගලො ජිගුච්ඡිතබ්බො, න සෙවිතබ්බො, න භජිතබ්බො, න පයිරුපාසිතබ්බො: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො දුස්සීලො හොති පාපධම්මො අසුචි සංකස්සරසමාචාරො පටිච්ඡන්නකම්මන්තො අස්සමණො සමණපටිඤ්ඤො අබ්රහ්මචාරී බ්රහ්මචාරීපටිඤ්ඤො අන්තොපුති අවස්සුතො කසම්බුජාතො. එවරූපො භික්ඛවෙ පුග්ගලො ජිගුච්ඡිතබ්බො, න සෙවිතබ්බො, න භජිතබ්බො න පයිරුපාසිතබ්බො. තං කිස්ස හෙතු: කිඤ්චාපි භික්ඛවෙ එවරූපස්ස පුග්ගලස්ස න දිට්ඨානුගතිං ආපජ්ජති, අථ ඛො නං පාපකො කිත්තිසද්දො අබ්භුග්ගච්ඡති පාපමිත්තො පුරිසපුග්ගලො පාපසහායො පාපසම්පවඞ්කොති. සෙය්යථාපි භික්ඛවෙ අහි ගූථගතො, කිඤ්චාපි න දංසති, අථ නං මක්ඛෙති. එවමෙව ඛො භික්ඛවෙ කිඤ්චාපි එවරූපස්ස පුග්ගලස්ස න දිට්ඨානුගතිං ආපජ්ජති, අථ ඛො නං පාපකො කිත්තිසද්දො අබ්භුග්ගච්ඡති පාපමිත්තො පුරිසපුග්ගලො පාපසහායො පාපසම්පවඞ්කොති. තස්මා එවරූපො පුග්ගලො ජිගුච්ඡිතබ්බො, න සෙවිතබ්බො, න භජිතබ්බො, න පයිරුපාසිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පුග්ගලො අජ්ඣුපෙක්ඛිතබ්බො, න සෙවිතබ්බො, න භජිතබ්බො, න පයිරුපාසිතබ්බො: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො කොධනො හොති -පෙ- සෙය්යථාපි භික්ඛවෙ දුට්ඨාරුකා{1} කට්ඨෙන වා කඨලෙන වා ඝට්ටිතා{2} භිය්යොසොමත්තාය අස්සන්දති.{3} එවමෙව ඛො භික්ඛවෙ -පෙ- සෙය්යථාපි භික්ඛවෙ තින්දුකාලාතං කට්ඨෙන වා කඨලෙන{4} වා ඝට්ටිතං භිය්යොසොමත්තාය චිච්චිටායති, චිටිචිටායති. එවමෙව ඛො භික්ඛවෙ -පෙ- ගූථකූපො කට්ඨෙන වා කඨලෙන{4} වා ඝට්ටිතො භිය්යොසොමත්තාය දුග්ගන්ධො හොති. එවමෙව ඛො භික්ඛවෙ ඉධෙකච්චො පුග්ගලො කොධනො හොති, උපායාසබහුලො, අප්පම්පි වුත්තො සමානො අභිසජ්ජති, කුප්පති, ව්යාපජ්ජති, පතිත්ථියති, කොපඤ්ච දොසඤ්ච අපච්චයඤ්ච පාතුකරොති, එවරූපො භික්ඛවෙ පුග්ගලො අජ්ඣුපෙක්ඛිතබ්බො, න සෙවිතබ්බො, න භජිතබ්බො, න පයිරුපාසිතබ්බො. තං කිස්ස හෙතු: අක්කොසෙය්යාථාපි මං, පරිභාසෙය්යාථාපි මං, අනත්ථම්පි මං කරෙය්යාති. තස්මා එවරූපො පුග්ගලො අජ්ඣුපෙක්ඛිතබ්බො, න සෙවිතබ්බො, න භජිතබ්බො, න පයිරුපාසිතබ්බො."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. දුට්ඨාරුකො - මඡසං. ස්යා. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ඝට්ටිතො - මඡසං. ස්යා. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ආසවං දෙති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. කඨලාය වා - සීමු. මඡසං. ස්යා. PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 7.",
                        "level": 1
                    },
                    {
                        "text": "27. මහණෙනි, මේ පුද්ගලයෝ තුන් දෙනෙක් ලෝකයෙහි ඇත. කවර තුන් දෙනෙක යත්: මහණෙනි, පිළිකුල් කටයුතු වූ නොසෙවිය යුතු වූ භජනය නොකටයුතු වූ පර්‍ය්‍යුපාසනය නොකටයුතු වූ පුඟුලෙක් ඇත. මහණෙනි, මැදහත්ව දැක්කයුතු, නො සෙවියයුතු භජනය නොකටයුතු පර්‍ය්‍යුපාසනය නොකටයුතු පුඟුලෙක් ඇත. මහණෙනි, සේවනය කටයුතු භජනය කටයුතු පර්‍ය්‍යුපාසනය කටයුතු පුඟුලෙක් ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ගැරැහිය යුතු නො සෙවියයුතු නො ඇලියයුතු පුනපුනා නො එළඹිය යුතු පුද්ගල කවරේය යත්: මහණෙනි, මේ ලෝකයෙහි කිසි පුද්ගලයෙක් දුශ්ශීල වූ පාපකස්වභාව ඇති අපවිත්‍ර වූ සැකෙන් සිහි කළයුතු හැසිරීම් ඇති පිළිසන්කමත් ඇති ශ්‍රමණප්‍රතිරූපක වූ, ශ්‍රමණයෙමී, පිළින කරණ, බ්‍රහ්මචාරී ප්‍රතිරූපක වූ, බ්‍රහ්මචාරීමී පිළින කරන, ඇතුළත දුගඳ වූ කෙලෙසුන් විසින් තෙත් වූ හටගත් කෙලෙස් කසළ ඇතියේ වේ ද, මහණෙනි, මෙබඳු පුද්ගල තෙමේ පිළිකුල් කටයුතු නො සෙවියයුතු භජනය නො කටයුතු පර්‍ය්‍යුපාසනය නො කටයුතු වේ. ඒ කවර හෙයින යත්: මහණෙනි, මෙබඳු පුද්ගලයාගේ දෘෂ්ටානුගතියට නොයතුදු වැළිත් “පවිටු මිතුරන් ඇති පවිටුන් සහාය කොට ඇති පවිටුන් කෙරෙහි නැමෙන පුරුෂ පුද්ගලයෙකැ”යි ඔහුගේ ලාමක වූ කීර්ති ශබ්දය (අපකීර්තිය) උස්ව නගියි. මහණෙනි, අසුචියෙන් වැකුනු සර්‍පයා නොඩහතත් වැලි ඔහු (අසූචියෙන්) යම්සේ තවරා ද, මහණෙනි, එමෙන් ම මෙබඳු පුඟුලාගේ දෘෂ්ටානුගතියට නොපැමිණිය ද වැලි “මේ පුරුෂපුද්ගල පාපමිත්‍රයන් ඇතියෙක, පාප යහළුවන් ඇතියෙක, පාපයන් කෙරෙහි නැමුනෙකැ”යි ඔහුගේ අපකීර්ති ශබ්දය උස්ව නැඟෙයි. එහෙයින් මෙ බඳු වූ පුද්ගල පිළිකුල් කටයුතු වෙයි. සේවනය නොකටයුතු වෙයි. භජනය නොකටයුතු වෙයි. පර්‍ය්‍යුපාසනය නොකටයුතු වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මැදහත් සේ දැක්කයුතු සෙවනය නොකටයුතු භජනය නොකටයුතු පර්‍ය්‍යුපාසනය නොකටයුතු පුද්ගල කවරේය යත්: මහණෙනි, මේ ලෝකයෙහි කිසි පුඟුලෙක් කිපෙනසුලු වූයේ වේ ද ... මහණෙනි, යම් පරිදි දඬුකඩෙකින් හෝ කැබිලිත්තෙකින් හෝ ගටනු ලැබු පැරැණි වණෙක් යම් සේ වෙසෙසින් ලේ සැරව වගුරුවා ද, මහණෙනි, එසේ ම ... මහණෙනි, යම් පරිදි දඬුකඩෙකින් හෝ කැබිලිත්තෙකින් හෝ ගටනු ලැබු තිඹිරිගිනිපෙණෙහෙල්ල වැඩිපමණින් “චිටි චිටි” යන අනුකරණ පවත්වා ද, මහණෙනි, එපරිද්දෙන් ම දඬුකඩෙකින් හෝ කැබිලිත්තෙකින් හෝ ගටනු ලැබූ අශුචිවළ යම්සේ වෙසෙසින් දුගඳ වහනය කෙරේ ද, මහණෙනි, එපරිද්දෙන් ම මේ ලොකයෙහි කිසි පුද්ගලයෙක් දැඩි ආයාසබහුල කොට ඇත්තේ මඳකුත් කියන ලද්දේ එහි ගැටේ ද, කිපේ ද, තදව සිටුනේ වේ ද, කෝපයත් ද්වෙෂයත් නොසතුටත් පහළ කෙරේ ද, මහණෙනි, මෙබඳු පුද්ගල මැදහත් සේ දැක්ක යුත්තේ ය. සේවනය නොකට යුත්තේ ය. භජනය නොකට යුත්තේ ය. පර්‍ය්‍යුපාසනය නොකට යුත්තේ ය. කවර හෙයින යත්: වැලි මා හැවියහෙන්නේය, වැලි මට අසභ්‍ය බණනේය, මට අනර්‍ථ ද කරන්නේය කියායි. එබැවින් මෙබඳු පුද්ගල මැදහත් සේ දැක්ක යුත්තේ ය. සේවනය නොකට යුත්තේ ය. භජනය නොකට යුත්තේ ය. පර්‍ය්‍යුපාසනය නොකට යුත්තේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 236,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පුග්ගලො සෙවිතබ්බො, භජිතබ්බො, පයිරුපාසිතබ්බො: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො සීලවා හොති කල්යාණධම්මො. එවරූපො භික්ඛවෙ පුග්ගලො සෙවිතබ්බො, භජිතබ්බො, පයිරුපාසිතබ්බො. තං කිස්ස හෙතු: කිඤ්චාපි භික්ඛවෙ එවරූපස්ස පුග්ගලස්ස න දිට්ඨානුගතිං ආපජ්ජති. අථ ඛො නං කල්යාණො කිත්තිසද්දො අබ්භුග්ගච්ඡති: “කල්යාණමිත්තො පුරිසපුග්ගලො, කල්යාණසහායො, කල්යාණසම්පවඞ්කො”ති. තස්මා එවරූපො පුග්ගලො සෙවිතබ්බො, භජිතබ්බො, පයිරුපාසිතබ්බො. ඉමෙ ඛො භික්ඛවෙ තයො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "gatha",
                        "text": "2. නිහීයති පුරිසො නිහීනසෙවී \nන ච හායෙථ කදාචි තුල්යසෙවී, \nසෙට්ඨමුපනමං උදෙති ඛිප්පං \nතස්මා අත්තනො උත්තරිං භජෙථාති.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 8.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "28. තයො’මෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ තයො: ගූථභාණී පුප්ඵභාණී මධුභාණී."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පුග්ගලො ගූථභාණී: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො සභග්ගතො{1} වා පරිසග්ගතො{2} වා ඤාතිමජ්ඣගතො වා පූගමජ්ඣගතො වා රාජකුලමජ්ඣගතො වා අභිනීතො සක්ඛිපුට්ඨො “එහම්භො{3} පුරිස යං ජානාසි, තං වදෙහී”ති. සො අජානං වා ආහ, “ජානාමී”ති. ජානං වා ආහ, “න ජානාමී”ති. අපස්සං වා ආහ, “පස්සාමී”ති පස්සං වා ආහ, “න පස්සාමී”ති. ඉති අත්තහෙතු වා පරහෙතු වා ආමිසකිඤ්චික්ඛහෙතු වා සම්පජානමුසා භාසිතා හොති. අයං වුච්චති භික්ඛවෙ පුග්ගලො ගූථභාණී."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පුග්ගලො පුප්ඵභාණී: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො සභග්ගතො වා පරිසග්ගතො{2} වා ඤාතිමජ්ඣගතො වා පූගමජ්ඣගතො වා රාජකුලමජ්ඣගතො වා අභිනීතො සක්ඛිපුට්ඨො “එහම්භො{3} පුරිස, යං ජානාසි තං වදෙහී’ති. සො අජානං වා ආහ, “න ජානාමී”ති, ජානං වා ආහ, “ජානාමී”ති, අපස්සං වා ආහ “න පස්සාමී”ති, පස්සං වා ආහ, “පස්සාමී”ති: ඉති අත්තහෙතු වා පරහෙතු වා ආමිසකිඤ්චික්ඛහෙතු වා න සම්පජානමුසා භාසිතා හොති. අයං වුච්චති භික්ඛවෙ පුග්ගලො පුප්ඵභාණී."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පුග්ගලො මධුභාණී: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො ඵරුසං වාචං පහාය ඵරුසාය{6} වාචාය පටිවිරතො හොති. යා සා වාචා නෙලා කණ්ණසුඛා පෙමනීයා හදයඞ්ගමා පොරී බහුජනකන්තා බහුජනමනාපා; තථාරූපිං{7} වාචං භාසිතා හොති. අයං වුච්චති භික්ඛවෙ පුග්ගලො මධුභාණී. ඉමෙ ඛො භික්ඛවෙ තයො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සභාගතො වා - ස්යා. කං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. පරිසගතො වා - සීමු. සී 1. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. එවම්භොපුරිස - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "6. ඵරුසා වාචා - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "7. තථාරූපං - සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කවර පුද්ගලයෙක් සේවනය කටයුතු වේ ද, භජනය කටයුතු වේ ද, පර්‍ය්‍යුපාසනය කටයුතු වේ ද: මහණෙනි, මේ ලොව්හි කිසි පුද්ගලයෙක් කලණ දහම් ඇත්තේ සිල්වත් වෙයි. මහණෙනි, මෙබඳු පුද්ගල සේවනය කටයුත්තේ ය, භජනය කට යුත්තේ ය, පර්‍ය්‍යුපාසනය කට යුත්තේ ය. ඒ කවර හෙයින් යත්: මහණෙනි, මෙබඳු පුද්ගලයාගේ දෘෂ්ටානුගතියට නොයතත් වැලි “මේ පුරුෂ පුද්ගල කලණ මිතුරන් ඇතියෙක, කලණ යහළුවන් ඇතියෙක, කලණ මිතුරන් කෙරෙහි නැමුනෙකැ” යි මෙසේ ඔහු ලකුණු කොට කලණ යස ගී උස්ව නැඟෙයි. එහෙයින් මෙබඳු පුද්ගල සේවනය කටයුත්තේ ය, භජනය කටයුත්තේ ය, පර්‍ය්‍යුපාසනය කටයුත්තේ ය. මහණෙනි, මේ පුද්ගලයෝ තුන් දෙන ලෝකයෙහි විද්‍යමාන වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. තමහට වඩා (ගුණයෙන්) හීනයන් සෙවුනා පුරුෂ පිරිහෙයි. තමන් හා (ගුණයෙන්) සමාන පුඟුලන් සෙවුනා පුරුෂ කිසිකලෙකත් නො පිරිහෙන්නේ ය. තමනට වඩා (ගුණයෙන්) වැඩුනවුන් වෙත නැමෙන්නේ වහා වැඩෙයි. එහෙයින් තමනට වඩා (ගුණයෙන්) වැඩි තැනැත්තකු භජනය කරන්නේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 8.",
                        "level": 1
                    },
                    {
                        "text": "28. මහණෙනි, මේ පුද්ගලයෝ තුන් දෙනෙක් ලොව්හි විද්‍යමාන වෙති. කවර තුන් දෙනෙක යත්: ගුථභාණීය, පුප්ඵභාණීය, මධුභාණීය යන මොහුයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ගුථභාණී පුද්ගල තෙමේ කවරේ ය යත්: මහණෙනි, මෙ ලොව්හි කිසි පුද්ගලයෙක් සභාවට ගියේ හෝ ගම්පිරිසට ගියේ හෝ නෑයන් මැදට ගියේ හෝ සේණි මැදට ගියේ හෝ රජකුලන් මැදට ගියේ හෝ “එම්බා, පුරුෂය, එව, යමක් දනිහි නම් එය කියව” යි පිළිවිසීමට හමියට කැඳවන ලද්දේ සාක්‍ෂි කොට පුළුවුස්නා ලද්දේ නොදන්නේ හෝ ‘දන්මි’යි කියයි. දන්නේ හෝ ‘නො දන්මි’ යි කියයි. නො දක්නේ හෝ ‘දක්මි’ යි කියයි. දක්නේ හෝ ‘නො දක්මි’යි කියයි. මෙසේ තමා හේතු කොට ගෙණ හෝ මෙරමා හේතු කොට ගෙණ හෝ මඳ ආමිෂයක් හේතු කොට ගෙණ හෝ දැන දැන මුසවා බෙණේ ද, මහණෙනි, මේ ගුථභාණී පුද්ගලයා යී කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පුප්ඵභාණී පුද්ගල කවරේ ය යත්: මහණෙනි, මෙ ලොව්හි කිසි පුඟුලෙක් සභාවට ගියේ හෝ පිරිසට ගියේ හෝ නෑයන් මැදට ගියේ හෝ සේණි මැදට ගියේ හෝ රජකුලන් මැදට ගියේ හෝ “එම්බා, පුරුෂය, එව, යමක් දනිහි නම් එය කියව” යි පෙරමුණට කැඳවන ලද්දේ සාක්‍ෂි කොට පුළුවුස්නා ලද්දේ වේ ද, හෙ නො දන්නේ හෝ “නොදන්මි”යි කියයි. දන්නේ හෝ “දන්මි” යි කියයි. නො දක්නේ හෝ “නො දක්මි” යි කියයි. දක්නේ හෝ “දක්මි”යි කියයි. මෙසේ තමා හේතු කොට හෝ මෙරමා හේතු කොට හෝ මඳ ආමිෂයක් හේතු කොට හෝ දැන දැන මුසවා නො බෙණේ ද, මහණෙනි, මේ පුප්ඵභාණී පුද්ගලයා යී කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මධුභාණී පුද්ගල කවරේ ය යත්: මහණෙනි, මෙ ලොව්හි කිසි පුද්ගලයෙක් පරුස්විසිකම් දුරු කොට කොරොස් බසින් වැළහුනේ වෙයි. යම් බසක් නිදොස් ද, කණට සුව එළවා ද, පෙම් දනවා ද, ල ගණී ද, නන්වැසි (සභ්‍ය) ද, බොහෝ දෙනාට කැමති ද, බොහෝ දෙනාට මනාප ද, එබඳු බස් කියන්නේ වේ ද, මහණෙනි, මේ මධුභාණී පුද්ගලයා යී කියනු ලැබේ. මහණෙනි, මේ පුද්ගලයෝ තුන් දෙන ලොව්හි විද්‍යමාන වෙත් යයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 238,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 9",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "29. තයො’මෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ තයො: අන්ධො එකචක්ඛු ද්විචක්ඛු. කතමො ච භික්ඛවෙ පුග්ගලො අන්ධො: ඉධ භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස තථාරූපං චක්ඛු න හොති, යථාරූපෙන චක්ඛුනා අනධිගතං වා භොගං අධිගච්ඡෙය්ය, අධිගතං වා භොගං ඵාතිකරෙය්ය.{1} තථාරූපම්පිස්ස චක්ඛු න හොති, යථාරූපෙන චක්ඛුනා කුසලාකුසලෙ ධම්මෙ ජානෙය්ය, සාවජ්ජානවජ්ජෙ ධම්මෙ ජානෙය්ය, හීනප්පණීතෙ ධම්මෙ ජානෙය්ය, කණ්හසුක්කසප්පටිභාගෙ ධම්මෙ ජානෙය්ය. අයං වුච්චති භික්ඛවෙ පුග්ගලො අන්ධො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පුග්ගලො එකචක්ඛු: ඉධ භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස තථාරූපං චක්ඛු හොති, යථාරූපෙන චක්ඛුනා අනධිගතං වා භොගං අධිගච්ඡෙය්ය, අධිගතං වා භොගං ඵාතිකරෙය්ය. තථාරූපම්පිස්ස* චක්ඛු න හොති, යථාරූපෙන චක්ඛුනා කුසලාකුසලෙ ධම්මෙ ජානෙය්ය, සාවජ්ජානවජ්ජෙ ධම්මෙ ජානෙය්ය, හීනප්පණීතෙ ධම්මෙ ජානෙය්ය, කණ්හසුක්කසප්පටිභාගෙ ධම්මෙ ජානෙය්ය. අයං වුච්චති භික්ඛවෙ පුග්ගලො එකචක්ඛු."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පුග්ගලො ද්විචක්ඛු: ඉධ භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස තථාරූපං චක්ඛු හොති, යථාරූපෙන චක්ඛුනා අනධිගතං වා භොගං අධිගච්ඡෙය්ය, අධිගතං වා භොගං ඵාතිකරෙය්ය{1} තථාරූපම්පිස්ස චක්ඛු හොති, යථාරූපෙන චක්ඛුනා කුසලාකුසලෙ ධම්මෙ ජානෙය්ය, සාවජ්ජානවජ්ජෙ ධම්මෙ ජානෙය්ය, හීනප්පණීතෙ ධම්මෙ ජානෙය්ය, කණ්හසුක්කසප්පටිභාගෙ ධම්මෙ ජානෙය්ය. අයං වුච්චති භික්ඛවෙ පුග්ගලො ද්විචක්ඛු. ඉමෙ ඛො භික්ඛවෙ තයො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "gatha",
                        "text": "3. න චෙව භොගා තථාරූපා න ච පුඤ්ඤානි කුබ්බති, \nඋභයත්ථ කලිග්ගාහො අන්ධස්ස හතචක්ඛුනො.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "4. අථාපරායං අක්ඛාතො එකචක්ඛු ච පුග්ගලො, \nධම්මාධම්මෙන සසඨො{3} භොගානි පරියෙසති.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "5. ථෙය්යෙන කූටකම්මෙන මුසාවාදෙන චූභයං, \nකුසලො හොති සඞ්ඝාතුං{4} කාමභොගී ච මානවො, \nඉතො සො නිරයං ගන්ත්වා එකචක්ඛු විහඤ්ඤති.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "6. ද්විචක්ඛු පන අක්ඛාතො සෙට්ඨො පුරිසපුග්ගලො, \nධම්මලද්ධෙහි භොගෙහි උට්ඨානාධිගතං ධනං. \n\n7. දදාති සෙට්ඨසඞ්කප්පො අව්යග්ගමනසො{5} නරො, \nඋපෙති භද්දකං ඨානං යත්ථ ගන්ත්වා න සොචති.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "8. අන්ධඤ්ච එකචක්ඛුඤ්ච ආරකා පරිවජ්ජයෙ, \nද්විචක්ඛුං{6} පන සෙවෙථ සෙට්ඨං පුරිසපුග්ගලන්ති.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඵාතිං කරෙය්ය - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. සඨොසො - මඡසං. සංසට්ඨො - කත්ථචි."
                    },
                    {
                        "type": "footnote",
                        "text": "4. සංහාතුං - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. අබ්යග්ගමානසො නරො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "6. ද්විචක්ඛුඤ්ච - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 9.",
                        "level": 1
                    },
                    {
                        "text": "29. මහණෙනි, මේ පුද්ගලයෝ තුන් දෙනෙක් ලොව්හි විද්‍යමාන වෙත්. කවර තුන් දෙනෙක යත්: අන්‍ධ ය, එකැස් ඇත්තේ ය, දෑස් ඇත්තේ ය යි. මහණෙනි, අන්‍ධ පුද්ගල කවරේය යත්: මහණෙනි, මෙ ලොව්හි කිසි පුද්ගලයකුට යම්බඳු පැණැසෙකින් නොලත් භොග හෝ ලබන්නේ නම්, ලැබූ භෝග හෝ වඩා ගන්නේ නම්, එබඳු වූ නුවණැසෙක් නොවෙයි. යම් බඳු නුවණැසෙකින් කුසල් අකුසල් දහම් දැනගන්නේ නම්, සදොස් නිදොස් දහම් දැනගන්නේ නම්, හීනප්‍රණීත දහම් දැනගන්නේ නම්, අන්‍යොන්‍ය ප්‍රතිවිරුද්ධ වූ කෘෂ්ණ ශුක්ල ධර්‍මයන් දැනගන්නේ නම්, එබඳු වූ නුවණැසෙක් ඕහට නැත. මහණෙනි, මේ පුද්ගල අන්‍ධයා යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එකැස් ඇති පුද්ගල කවරේය යත්: මහණෙනි, මේ ලෝකයෙහි කිසි පුද්ගලයකුට යම් බඳු ඇසෙකින් ලබා නොගත් භෝග ලබා ගන්නේ නම්, ලබාගත් භෝග හෝ වඩා ගන්නේ නම්, එබඳු නුවණැසෙක් ද වෙයි. යම් බඳු නුවණැසෙකින් කුසල් අකුසල් දහම් දැනගන්නේ නම්, සදොස් නිදොස් දහම් දැනගන්නේ නම්, හීනප්‍රණීත ධර්‍මයන් දැනගන්නේ නම්, අන්‍යොන්‍ය ප්‍රතිවිරුද්ධ වූ කෘෂ්ණ ශුක්ල ධර්‍මයන් දැනගන්නේ නම්, එබඳු වූ නුවණැස ද ඔහට නො වේ. මහණෙනි, මේ පුද්ගල එකැස් පුඟුලාය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, දෑස් ඇති පුද්ගල කවරේය යත්: මහණෙනි, මේ ලොව්හි කිසි පුද්ගලයකුට යම් බඳු වූ නුවණැසෙකින් නොලැබූ හෝ භෝගයන් ලබාගන්නේ නම් හෝ ලබාගත් භෝගයන් වඩා ගන්නේ නම් එබඳු නුවණැසෙක් වෙයි. යම් බඳු වූ නුවණැසෙකින් කුසල් අකුසල් දහම් දැනගන්නේ නම්, සදොස් නිදොස් දහම් දැනගන්නේ නම්, හීනප්‍රණීත ධර්‍මයන් දැනගන්නේ නම්, අන්‍යොන්‍ය ප්‍රතිවිරුද්ධ වූ කෘෂ්ණ ශුක්ල ධර්‍මයන් දැනගන්නේ නම්, එබඳු වූ නුවණැස ද ඔහට වේ. මහණෙනි, මේ දෑස් ඇති පුද්ගලයා යි කියනු ලැබේ. මහණෙනි, මේ පුද්ගලයෝ තුන් දෙන ලොව්හි විද්‍යමාන වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. නට නුවණැස් ඇති අන්‍ධයාහට එබඳු භොගයෝ නො වෙත්. පින් ද නොකරයි, දෙලොව්හි පරාජයග්‍රහණ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. වැලිදු ශඨවැ සිටුනා හේ පින්පව් දෙකින් භෝගයන් සොයා ද, එබඳු වූ මේ අනෙක් එකැස් ඇති පුඟුලෙක් ද වදාරණ ලද්දේය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "5. කාමභෝගී වූ ඒ මිනිස් සොර රැවටිලි හා මුසවාය යන දෙකිනුදු භෝග රැස් කරන්නට දක්‍ෂයෙක් වේ. එකැස් ඇති හෙ මෙයින් නිරයට ගොස් වැනසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "6-7. දෑස් ඇත්තා වූ ශ්‍රෙෂ්ඨ පුරුෂ පුද්ගලයෙක් ද වදාරණ ලද්දේය. ශ්‍රෙෂ්ඨ සංකල්පනා ඇති විචිකිච්ඡාරහිත සිත් ඇති ඒ මනුෂ්‍යයා දැහැමින් ලත් භොගයෙන් යුක්ත වූයේ උත්‍ථානවීර්‍ය්‍යයෙන් ලත් ධනය (මෙරමාහට) දෙයි. යම් තැනෙකට ගොස් නොසොස්නේ නම්, එබඳු සොඳුරු තැනට පැමිණෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "8. අන්‍ධයා ද එකැස් ඇති පුද්ගලයා ද දුරින් දුරු කරන්නේය. ශ්‍රෙෂ්ඨ වූ දෑස් ඇති පුරුෂ පුද්ගලයා සේවනය කරන්නේය යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 240,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 10",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "30. තයො’මෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ තයො: අවකුජ්ජපඤ්ඤො පුග්ගලො, උච්ඡඞ්ගපඤ්ඤො පුග්ගලො, පුථුපඤ්ඤො පුග්ගලො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ අවකුජ්ජපඤ්ඤො පුග්ගලො: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො ආරාමං ගන්තා හොති අභික්ඛණං භික්ඛූනං සන්තිකෙ ධම්මසවණාය. තස්ස භික්ඛූ ධම්මං දෙසෙන්ති ආදිකල්යාණං මජ්ඣෙකල්යාණං පරියොසානකල්යාණං සාත්ථං සව්යඤ්ජනං කෙවලපරිපුණ්ණං පරිසුද්ධං බ්රහ්මචරියං පකාසෙන්ති. සො තස්මිං ආසනෙ නිසින්නො තස්සා කථාය නෙවාදිං මනසි කරොති, න මජ්ඣං මනසි කරොති, න පරියොසානං මනසි කරොති. වුට්ඨිතොපි තම්හා ආසනා තස්සා කථාය නෙවාදිං මනසි කරොති, න මජ්ඣං මනසි කරොති, න පරියොසානං මනසි කරොති. සෙය්යථාපි භික්ඛවෙ කුම්භො නික්කුජ්ජො, තත්ර උදකං ආසිත්තං විවට්ටති, නො සණ්ඨාති. එවමෙව ඛො භික්ඛවෙ ඉධෙකච්චො පුග්ගලො ආරාමං ගන්තා හොති අභික්ඛණං භික්ඛූනං සන්තිකෙ ධම්මසවණාය. තස්ස භික්ඛූ ධම්මං දෙසෙන්ති, ආදිකල්යාණං මජ්ඣෙකල්යාණං පරියොසානකල්යාණං, සාත්ථං සව්යඤ්ජනං කෙවලපරිපුණ්ණං පරිසුද්ධං බ්රහ්මචරියං පකාසෙන්ති. සො තස්මිං ආසනෙ නිසින්නො තස්සා කථාය නෙවාදිං මනසි කරොති, න මජ්ඣං මනසි කරොති, න පරියොසානං මනසි කරොති. වුට්ඨිතොපි තම්හා ආසනා තස්සා කථාය නෙවාදිං මනසි කරොති, න මජ්ඣං මනසි කරොති, න පරියොසානං මනසි කරොති. අයං වුච්චති භික්ඛවෙ අවකුජ්ජපඤ්ඤො පුග්ගලො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ උච්ඡඞ්ගපඤ්ඤො පුග්ගලො: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො ආරාමං ගන්තා හොති අභික්ඛණං භික්ඛූනං සන්තිකෙ ධම්මසවණාය. තස්ස භික්ඛූ ධම්මං දෙසෙන්ති ආදිකල්යාණං මජ්ඣෙකල්යාණං පරියොසානකල්යාණං, සාත්ථං සව්යඤ්ජනං කෙවලපරිපුණ්ණං පරිසුද්ධං බ්රහ්මචරියං පකාසෙන්ති. සො තස්මිං ආසනෙ නිසින්නො තස්සා කථාය ආදිම්පි මනසි කරොති, මජ්ඣම්පි මනසි කරොති, පරියොසානම්පි මනසි කරොති, වුට්ඨිතොපි තම්හා ආසනා තස්සා කථාය නෙවාදිං මනසි කරොති, න මජ්ඣං මනසි කරොති, න පරියොසානං මනසි කරොති. සෙය්යථාපි භික්ඛවෙ පුරිසස්ස උච්ඡඞ්ගෙ නානාඛජ්ජකානි ආකිණ්ණානි තිලා තණ්ඩුලා මොදකා බදරා. සො තම්හා ආසනා වුට්ඨහන්තො සතිසම්මොසා පකිරෙය්ය. එවමෙව ඛො භික්ඛවෙ ඉධෙකච්චො පුග්ගලො ආරාමං ගන්තා හොති අභික්ඛණං භික්ඛූනං සන්තිකෙ ධම්මසවණාය. තස්ස භික්ඛූ ධම්මං දෙසෙන්ති ආදිකල්යාණං මජ්ඣෙකල්යාණං පරියොසානකල්යාණං, සාත්ථං සව්යඤ්ජනං කෙවලපරිපුණ්ණං පරිසුද්ධං බ්රහ්මචරියං පකාසෙන්ති. සො තස්මිං ආසනෙ නිසින්නො තස්සා කථාය ආදිම්පි මනසි කරොති, මජ්ඣම්පි මනසි කරොති, පරියොසානම්පි මනසි කරොති. වුට්ඨිතොපි තම්හා ආසනා තස්සා කථාය නෙවාදිං මනසි කරොති, න මජ්ඣං මනසි කරොති, න පරියොසානං මනසි කරොති. අයං වුච්චති භික්ඛවෙ උච්ඡඞ්ගපඤ්ඤො පුග්ගලො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 3. 10.",
                        "level": 1
                    },
                    {
                        "text": "30. මහණෙනි, මේ පුද්ගලයෝ තුන් දෙනෙක් ලොව්හි විද්‍යමාන වෙත්. කවර තුන් දෙනෙක යත්: අවකුජ්ජපඤ්ඤ පුද්ගලය, උච්ඡඞ්ගපඤ්ඤ පුද්ගලය, පුථුපඤ්ඤ පුද්ගලයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අවකුජ්ජපඤ්ඤ පුද්ගල කවරේය යත්: මහණෙනි, මේ ලෝකයෙහි කිසි පුද්ගලයෙක් භික්‍ෂූන් වෙත නිතර බණ ඇසීම පිණිස ආරාමයට යන්නේ වේ ද, භික්‍ෂූහු ඕහට මුල කලණ කොට මැද කලණ කොට අග කලණ කොට අර්‍ථ සහිත කොට ව්‍යඤ්ජන සහිත කොට කේවල සම්පූර්‍ණ කොට දහම් දෙසත්. පිරිසිදු කොට බඹසර ප්‍රකාශ කරත්, හෙතෙම ඒ අස්නෙහි හුන්නේ ඒ කථාව පිළිබඳ මුල මෙනෙහි නො කරයි. මැද මෙනෙහි නො කරයි, අග මෙනෙහි නො කරයි. ඒ අස්නෙන් නැඟී සිටියේත් ඒ කථාව පිළිබඳ මුල මෙනෙහි නො කෙරේ, මැද මෙනෙහි නො කෙරේ, අග මෙනෙහි නො කෙරේ. මහණෙනි, යම් පරිදි යටිකුරු කළ කළයෙක් වේ ද, වත් කරණ ලද ජලය පෙරළේ ද, නො නවත්නේ ද, මහණෙනි, එපරිද්දෙන් ම මෙ ලොව්හි කිසි පුද්ගලයෙක් භික්‍ෂූන් වෙත බණ ඇසීම පිණිස නිතර ආරාමයට යන්නේ වේ ද, භික්‍ෂූහු ඔහට මුල කලණ කොට මැද කලණ කොට අග කලණ කොට දම් දෙසත් ද, අර්‍ථ සහිත කොට බ්‍යඤ්ජන සහිත කොට සියල්ලෙන් සම්පූර්‍ණ කොට දහම් දෙසත්. පිරිසිදු කොට බඹසර ප්‍රකාශ කරත්. හෙතෙම ඒ අස්නෙහි හුන්නේ ඒ කථාව පිලිබඳ මුල මෙනෙහි නො කරයි ද, මැද මෙනෙහි නො කරයි ද, අග මෙනෙහි නො කරයි ද, ඒ අස්නෙන් නැඟී සිටියේ ම ඒ කථාව පිළිබඳ මුල මෙනෙහි නො කරයි ද, මැද මෙනෙහි නො කරයි ද, අග මෙනෙහි නො කරයි ද; මහණෙනි, මේ අවකුජ්ජපඤ්ඤ පුද්ගලයා යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, උච්ඡඞ්ගපඤ්ඤ පුද්ගල කවරේය යත්: මහණෙනි, මේ ලොව්හි කිසි පුද්ගලයෙක් භික්‍ෂූන් වෙත දහම් ඇසීම පිණිස නිතර ආරාමයට යන්නේ වේ, භික්‍ෂූහු ඔහට මුල කලණ කොට මැද කලණ කොට අග කලණ කොට අර්‍ථ සහිත කොට බ්‍යඤ්ජන සහිත කොට සියල්ලෙන් සම්පූර්‍ණ කොට ධර්‍මය දෙසත් ද, පිරිසිදු කොට බඹසර ප්‍රකාශ කරත් ද, හෙතෙම ඒ අස්නෙහි හුන්නේ ඒ කථාව පිළිබඳ මුලත් මෙනෙහි කෙරේ ද, මැදත් මෙනෙහි කෙරේ ද, අගත් මෙනෙහි කෙරේ ද, ඒ අස්නෙන් නැඟී සිටියේත් ඒ කථාව පිළිබඳ මුල මෙනෙහි නො කෙරේ ද, මැද මෙනෙහි නො කෙරේ ද, අග මෙනෙහි නො කෙරේ ද. මහණෙනි, යම් පරිදි පුරුෂයකුගේ හිඟැ තල සහල් අත්වට ඩෙබර යන නොයෙක් කෑයුතු දෑ ගැවසුනේ වේ ද, හෙතෙම ඒ අස්නෙන් නැගී සිටුනේ ම සිහිමුළාවෙන් වම්හයි ද, මහණෙනි, එපරිදි ම මෙ ලොව්හි කිසි පුද්ගලයෙක් භික්‍ෂූන් වෙත බණ ඇසීම පිණිස නිතර ආරාමයට යන්නේ වේ ද, භික්‍ෂූහු ඔහට මුල කලණ කොට මැද කලණ කොට අග කලණ කොට දම් දෙසත් ද, අර්‍ථ සහිත කොට බ්‍යඤ්ජන සහිත කොට සියල්ලෙන් සම්පූර්‍ණ කොට පිරිසිදු කොට බඹසර ප්‍රකාශ කරත් ද, හෙතෙම ඒ අස්නෙහි හුන්නේ ඒ කථාව පිළිබඳ මුලත් මෙනෙහි කෙරේ ද, මැදත් මෙනෙහි කෙරේ ද, අගත් මෙනෙහි කෙරේ ද, ඒ අස්නෙන් නැඟී සිටියේ ඒ කථාව පිළිබඳ මුල නො මෙනෙහි කෙරේ ද, මැද නොම මෙනෙහි කෙරේ ද, අග නොම මෙනෙහි කෙරේ ද,මහණෙනි, මේ උච්ඡඞ්ගපඤ්ඤ පුද්ගල යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 242,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පුථුපඤ්ඤො පුග්ගලො: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො ආරාමං ගන්තා හොති අභික්ඛණං භික්ඛූනං සන්තිකෙ ධම්මසවණාය. තස්ස භික්ඛූ ධම්මං දෙසෙන්ති ආදිකල්යාණං මජ්ඣෙකල්යාණං පරියොසානකල්යාණං, සාත්ථං සව්යඤ්ජනං කෙවලපරිපුණ්ණං පරිසුද්ධං බ්රහ්මචරියං පකාසෙන්ති. සො තස්මිං ආසනෙ නිසින්නො තස්සා කථාය ආදිම්පි මනසිකරොති, මජ්ඣම්පි මනසි කරොති, පරියොසානම්පි මනසි කරොති. වුට්ඨිතොපි තම්හා ආසනා තස්සා කථාය ආදිම්පි මනසි කරොති, මජ්ඣම්පි මනසි කරොති. පරියොසානම්පි මනසි කරොති. සෙය්යථාපි භික්ඛවෙ කුම්භො උක්කුජ්ජො, තත්ර උදකං ආසිත්තං සණ්ඨාති, නො විවට්ටති. එවමෙව ඛො භික්ඛවෙ ඉධෙකච්චො පුග්ගලො ආරාමං ගන්තා හොති අභික්ඛණං භික්ඛූනං සන්තිකෙ ධම්මසවණාය. තස්ස භික්ඛූ ධම්මං දෙසෙන්ති ආදිකල්යාණං මජ්ඣෙකල්යාණං පරියොසානකල්යාණං, සාත්ථං සව්යඤ්ජනං කෙවලපරිපුණ්ණං පරිසුද්ධං බ්රහ්මචරියං පකාසෙන්ති. සො තස්මිං ආසනෙ නිසින්නො තස්සා කථාය ආදිම්පි මනසි කරොති, මජ්ඣම්පි මනසි කරොති, පරියොසානම්පි මනසි කරොති. වුට්ඨිතොපි තම්හා ආසනා තස්සා කථාය ආදිම්පි මනසි කරොති, මජ්ඣම්පි මනසි කරොති, පරියොසානම්පි මනසි කරොති. අයං වුච්චති භික්ඛවෙ පුථුපඤ්ඤො පුග්ගලො. ඉමෙ ඛො භික්ඛවෙ තයො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "gatha",
                        "text": "9. අවකුජ්ජපඤ්ඤො පුරිසො දුම්මෙධො අවිචක්ඛණො, \nඅභික්ඛණම්පි චෙ හොති ගන්තා භික්ඛූන සන්තිකෙ.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "10. ආදිං කථාය මජ්ඣඤ්ච පරියොසානඤ්ච තාදිසො, \nඋග්ගහෙතුං න සක්කොති පඤ්ඤා හිස්ස න විජ්ජති.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "11. උච්ඡඞ්ගපඤ්ඤො පුරිසො සෙය්යො එතෙන වුච්චති,\nඅභික්ඛණම්පි චෙ හොති ගන්තා භික්ඛූන සන්තිකෙ.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "12. ආදිං කථාය මජ්ඣඤ්ච පරියොසානඤ්ච තාදිසො,\nනිසින්නො ආසනෙ තස්මිං උග්ගහෙත්වාන බ්යඤ්ජනං,\nවුට්ඨිතො{1} නප්පජානාති ගහිතම්පිස්ස{2} මුස්සති.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "13. පුථුපඤ්ඤො ච පුරිසො සෙය්යො එතෙහි වුච්චති,\nඅභික්ඛණම්පි චෙ හොති ගන්තා භික්ඛූන සන්තිකෙ.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "14. ආදිං කථාය මජ්ඣඤ්ච පරියොසානඤ්ච තාදිසො,\nනිසින්නො ආසනෙ තස්මිං උග්ගහෙත්වාන බ්යඤ්ජනං.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "15. ධාරෙති සෙට්ඨසඞ්කප්පො අව්යග්ගමනසො නරො,\nධම්මානුධම්මපටිපන්නො දුක්ඛස්සන්තකරො{3} සියාති.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "පුග්ගලවග්ගො තතියො.{*}",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. වුට්ඨිතො ච ඛො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ගහිතං හිස්ස - ස්යා. කං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. දුක්ඛස්සන්තකරො සියා - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "*. තස්සුද්දානං :- සමිද්ධ ගිලානසඞ්ඛාර බහුකාරා වජිරෙන ච සෙවි-ජිගුච්ඡ-ගූථභාණී අන්ධො ච අවකුජ්ජතාති."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, පුථුපඤ්ඤ පුද්ගල කවරේය යත්: මහණෙනි, මේ ලොව්හි කිසි පුද්ගලයෙක් භික්‍ෂූන් වෙත බණ ඇසීම පිණිස ආරාමයට නිතර යන්නේ වේ. භික්‍ෂූහු ඔහුට මුල කලණ කොට මැද කලණ කොට අග කලණ කොට අර්‍ථ සහිත කොට බ්‍යඤ්ජන සහිත කොට සියල්ලෙන් සම්පූර්‍ණ කොට ධර්‍මය දෙසත්. පිරිසිදු බඹසර ප්‍රකාශ කෙරෙත්. හෙතෙම ඒ අස්නෙහි හුන්නේ ඒ කථාව පිළිබඳ මුලත් මෙනෙහි කෙරේ, මැදත් මෙනෙහි කෙරේ, අගත් මෙනෙහි කෙරේ. ඒ අස්නෙන් නැඟීසිටියේත් ඒ කථායෙහි මුලත් මෙනෙහි කෙරේ, මැදත් මෙනෙහි කෙරේ, අගත් මෙනෙහි කෙරේ. මහණෙනි, යම් පරිදි උඩුකුරු කළ කළයෙක් වේ ද, එහි වත් කරණ ලද දිය පිහිටා ද, පිටත නො ගැළේ ද, මහණෙනි, එපරිද්දෙන් ම මෙ ලොව්හි කිසි පුඟුලෙක් භික්‍ෂූන් වෙත බණ ඇසීම පිණිස නිතර ආරාමයට යන්නේ වේ ද, භික්‍ෂූහු ඔහුට මුල කලණ කොට මැද කලණ කොට අග කලණ කොට අර්‍ථ සහිත කොට බ්‍යඤ්ජන සහිත කොට සියල්ලෙන් සම්පූර්‍ණ කොට ධර්‍මය දෙසත් ද, පිරිසිදු වූ බඹසර ප්‍රකාශ කරත් ද, හෙ ඒ අස්නේ හුන්නේ ඒ කථායෙහි මුලත් මෙනෙහි කරයි ද, මැදත් මෙනෙහි කරයි ද, අගත් මෙනෙහි කරයි ද, ඒ අස්නෙන් නැඟී සිටියේත් ඒ කථායෙහි මුලත් මෙනෙහි කරයි ද, මැදත් මෙනෙහි කරයි ද, අගත් මෙනෙහි කරයි ද, මහණෙනි, මේ පුථුපඤ්ඤ පුද්ගලයා යි කියනු ලැබේ. මහණෙනි, මේ පුද්ගලයෝ තුන් දෙන ලොව්හි විද්‍යමාන වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "9. විචක්‍ෂණ නුවූ ප්‍රඥා නැති, අවකුජ්ජපඤ්ඤ පුරුෂ තෙමේ ඉදින් භික්‍ෂූන් වෙත නිතර යන සුලු වේ ද-",
                        "type": "paragraph"
                    },
                    {
                        "text": "10. එබඳු පුරුෂ කථායෙහි මුල ද මැද ද අග ද උගන්නට නොහැක්කේ ය. ඔහුට ප්‍රඥාව නැත් ද, එහෙයිනි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "11. ‘උච්ඡඞ්ගපඤ්ඤ’ පුරුෂ තෙමේ මොහට වඩා ශ්‍රෙෂ්ඨය යි කියනු ලැබේ. හෙතෙම ඉදින් නිතර භික්‍ෂූන් වෙත යන සුලු වේ ද-",
                        "type": "paragraph"
                    },
                    {
                        "text": "12. එබඳු පුද්ගල ඒ ආසනයෙහි හුන්නේ ඒ කථායෙහි මුල ද මැද ද අග ද ඉගෙණ ව්‍යඤ්ජන ධරා නැගී සිටියේ ම නො දනී ද, ඔහු විසින් ගන්නා ලද්ද නැසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "13. ‘පුථුපඤ්ඤ’ පුරුෂ මොවුනට වඩා ශ්‍රෙෂ්ඨය යි කියනු ලැබේ. ඉදින් හේ නිතර භික්‍ෂූන් වෙත යන සුලු වේ ද-",
                        "type": "paragraph"
                    },
                    {
                        "text": "14. එබඳු පුද්ගල ඒ අස්නෙහි හුන්නේ ඒ කථායෙහි මුල ද මැද ද අග ද ඉගෙණ ව්‍යඤ්ජනය දරයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "15. ශ්‍රෙෂ්ඨසංකල්පනා ඇති විචිකිච්ඡා රහිත සිත් ඇති ධර්‍මානුධර්‍මයෙහි පිළිපන් මිනිස් ඒ දුක් කෙළවර කරන්නෙක් වන්නේය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙවන පුඟුල් වග යි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 244,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "4. දෙවදූතවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 1",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "**(සාවත්ථිනිදානං:) **"
                    },
                    {
                        "type": "paragraph",
                        "text": "31. සබ්රහ්මකානි භික්ඛවෙ තානි කුලානි, යෙසං පුත්තානං මාතාපිතරො අජ්ඣාගාරෙ පූජිතා හොන්ති. සපුබ්බාචරියකානි භික්ඛවෙ තානි කුලානි, යෙසං පුත්තානං මාතාපිතරො අජ්ඣාගාරෙ පූජිතා හොන්ති. සාහුනෙය්යකානි{1} භික්ඛවෙ තානි කුලානි, යෙසං පුත්තානං මාතාපිතරො අජ්ඣාගාරෙ පූජිතා හොන්ති. බ්රහ්මාති භික්ඛවෙ මාතාපිතුන්නං එතං අධිවචනං. පුබ්බාචරියාති භික්ඛවෙ මාතාපිතුන්නං එතං අධිවචනං. ආහුනෙය්යාති භික්ඛවෙ මාතාපිතුන්නං එතං අධිවචනං. තං කිස්ස හෙතු: බහුකාරා භික්ඛවෙ මාතාපිතරො පුත්තානං. ආපාදකා පොසකා ඉමස්ස ලොකස්ස දස්සෙතාරොති."
                    },
                    {
                        "type": "gatha",
                        "text": "16. බ්රහ්මාති මාතාපිතරො පුබ්බාචරියාති වුච්චරෙ, \nආහුනෙය්යා ච පුත්තානං පජාය අනුකම්පකා.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "17. තස්මා හි නෙ නමස්සෙය්ය සක්කරෙය්යාථ පණ්ඩිතො,\nඅන්නෙන අථ පානෙන වත්ථෙන සයනෙන ච,\nඋච්ඡාදනෙන නහාපනෙන පාදානං ධොවනෙන ච.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "18. තාය නං පරිචරියාය මාතාපිතූසු පණ්ඩිතා,\nඉධචෙව{2} නං පසංසන්ති පෙච්ච සග්ගෙ ච මොදතීති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 2",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "32. අථ ඛො ආයස්මා **ආනන්දො** යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා ආනන්දො භගවන්තං එතදවොච: සියා නු ඛො භන්තෙ භික්ඛුනො තථාරූපො සමාධිපටිලාභො, යථා ඉමස්මිඤ්ච සවිඤ්ඤාණකෙ කායෙ අහිඞ්කාරමමිඞ්කාරමානානුසයා{3} නාස්සු, බහිද්ධා ච සබ්බනිමිත්තෙසු අහිඞ්කාරමමිඞ්කාරමානානුසයා නාස්සු, යඤ්ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං උපසම්පජ්ජ විහරතො අහිඞ්කාරමමිඞ්කාරමානානුසයා{3} න හොන්ති, තං ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං උපසම්පජ්ජ විහරෙය්යා?ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සියා ආනන්ද භික්ඛුනො තථාරූපො සමාධිපටිලාභො, යථා ඉමස්මිඤ්ච සවිඤ්ඤාණකෙ කායෙ අහිඞ්කාරමමිඞ්කාරමානානුසයා{3} නාස්සු, බහිද්ධා ච සබ්බනිමිත්තෙසු අහිඞ්කාරමමිඞ්කාරමානානුසයා{3} නාස්සු, යඤ්ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං උපසම්පජ්ජ විහරතො අහිඞ්කාරමමිඞ්කාරමානානුසයා{3} න හොන්ති, තඤ්ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං උපසම්පජ්ජ විහරෙය්යාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යථා කථං පන භන්තෙ සියා භික්ඛුනො තථාරූපො සමාධිපටිලාභො, යථා ඉමස්මිඤ්ච සවිඤ්ඤාණකෙ කායෙ අහිඞ්කාරමමිඞ්කාරමානානුසයා{3} න හොන්ති, බහිද්ධා ච සබ්බනිමිත්තෙසු අහිඞ්කාරමමිඞ්කාරමානානුසයා{3} න හොන්ති, යං ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං උපසම්පජ්ජ විහරතො අහිඞ්කාරමමිඞ්කාරමානානුසයා{3} න හොන්ති, තං ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං උපසම්පජ්ජ විහරෙය්යා?ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සාහුණෙය්යානි - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ඉධෙව නං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අහඞ්කාරමමඞ්කාරමානානුසයා - ස්යා. මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "4. දෙවදූත වර්ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 1",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "**[සැවැත්නිදානයි:]**"
                    },
                    {
                        "text": "31. මහණෙනි, යම් පුත්‍ර කෙනකුන් විසින් මාපියෝ සියගෙහි පුදන ලද්දාහු වෙත් ද, ඒ කුලයෝ බ්‍රහ්ම සහිතයහ. මහණෙනි, යම් පුත්‍ර කෙනකුන් විසින් මාපියෝ සියගෙහි පුදන ලද්දාහු වෙත් ද, ඒ කුලයෝ පූර්‍වාචාර්‍ය සහිතයහ. මහණෙනි, යම් පුත්‍ර කෙනකුන් විසින් මාපියෝ සියගෙහි පුදන ලද්දාහු වෙත් ද, ඒ කුලයෝ ආහුණෙය්‍ය සහිතයහ. මහණෙනි, ‘බ්‍රහ්ම’ යනු මාපියනට තෙල නමෙකි. මහණෙනි, ‘පුබ්බාචරිය’ යනු මාපියනට තෙල නමෙකි. මහණෙනි, ‘ආහුනෙය්‍ය’ යනු මාපියනට තෙල නමෙකි. ඒ කවර හෙයින යත්: මහණෙනි, මාපියෝ පුත්‍රයන් පල්නාහු පුස්නාහු මේ ලෝකය දක්වන්නාහු වෙත් ද, එහෙයින් දරුවනට බොහෝ උපකාර ඇතියහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "16. මාපියෝ පුත්‍රයනට බ්‍රහ්මයහ යි ද පූර්‍වාචාර්‍ය්‍යයහ යි ද ආහුනෙය්‍යහ යි ද දරුවනට අනුකම්පා කරන්නාහු යයි ද කියනු ලැබෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "17. එහෙයින් නුවණැත්තේ ඔවුන් නමදනේ ය. ආහාරයෙනුදු යලි පානයෙනුදු වස්ත්‍රයෙනුදු යහනිනුදු ඇඟ ඉළීමෙනුදු නෑවීමෙනුදු පා දෙවීමෙනුදු ඔවුන් සගන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "18. මවුපියන් කෙරෙහි ඒ පිරිසැරියෙන් පණ්ඩිතයෝ මෙලොව්හි ද ඔහු පසසත්. හේ පරලොව ගොස් ස්වර්‍ගයෙහි ද (විපාකමොදනායෙන්) තුටු වේ යයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 2",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "32. එකල්හි ආයුෂ්මත් **ආනන්‍ද** තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළැඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත් පසෙක හුන්හ. එකත් පසෙක හුන් ආයුෂ්මත් අනඳ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළහ: වහන්ස, යම් පරිද්දෙකින් සවිඥානක වූ මේ ශරීරයෙහිත් අහඞ්කාරදෘෂටි හා මමඞ්කාරතෘෂණා හා මානානුසය හා යන මොහු නො වෙත් නම්, බාහිර වූ ද සියලු නිමිත්තයෙහි අහඞ්කාර, මමඞ්කාර, මානානුසය යන මොහු නො වෙත් නම්, යම් ඵලසමාධියකටත් ඵලප්‍රඥාවකටත් සමවැද වසන්නහුට අහඞ්කාර, මමඞ්කාර, මානානුසයෝ නො වෙත් නම්, එබඳු ඵලසමාධියකට ද ඵලප්‍රඥාවකට ද පැමිණ වසන්නේ නම්, ඒ භික්‍ෂූහට එබඳු සමාධිප්‍රතිලාභයෙක් ඇත් ද?"
                    },
                    {
                        "text": "ආනන්‍දයෙනි, යම් පරිද්දෙකින් මේ සවිඥානක ශරීරයෙහි ද, අහඞ්කාර, මමඞ්කාර, මානානුසයයෝ නො වෙත් නම්, බාහිර වූ ද සියලු රූපාදිනිමිත්තයෙහි අහඞ්කාර, මමඞ්කාර, මානානුසයයෝ නො වෙත් නම්, යම් බඳු වූ ඵල සමාධියකට ඵලප්‍රඥාවකට පැමිණ වසන්නහුට අහඞ්කාර, මමඞ්කාර, මානානුසයයෝ නො වෙත් නම්, එබඳු වූ ද ඵලසමාධියකට ඵලප්‍රඥාවකට පැමිණ වෙසෙන්නේ නම්, ඒ භික්‍ෂූහට එවැනි සමාධිප්‍රතිලාභයෙක් ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, යම් හෙයෙකින් මේ සවිඥානක ශරීරයෙහි ද අහඞ්කාර, මමඞ්කාර, මානානුසයයෝ නො වෙත් ද, බාහිර වූ ද සියලු නිමිත්තයෙහි අහඞ්කාර, මමඞ්කාර, මානානුසයයෝ නො වෙත් ද, යම් බඳු වූ ඵලසමාධියකට ඵලප්‍රඥාවකට පැමිණ වසන්නහුට අහඞ්කාර, මමඞ්කාර, මානානුසයයෝ නො වෙත් නම්, එබඳු වූ ඵලසමාධියට ඵලප්‍රඥාවට පැමිණ වසන්නේ නම්, ඒ භික්‍ෂූහට එබඳු සමාධිප්‍රතිලාභයෙක් කෙසේ නම් වන්නේ ද?",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 246,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉධානන්ද භික්ඛුනො එවං හොති: එතං සන්තං, එතං පණීතං, යදිදං සබ්බසඞ්ඛාරසමථො සබ්බූපධිපටිනිස්සග්ගො තණ්හක්ඛයො විරාගො නිරොධො නිබ්බාණන්ති. එවං ඛො ආනන්ද සියා භික්ඛුනො තථාරූපො සමාධිපටිලාභො, යථා ඉමස්මිං ච සවිඤ්ඤාණකෙ කායෙ අහිඞ්කාරමමිඞ්කාරමානානුසයා{1} නාස්සු, බහිද්ධා ච සබ්බනිමිත්තෙසු අහිඞ්කාරමමිඞ්කාරමානානුසයා{1} නාස්සු, යං ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං උපසම්පජ්ජ විහරතො අහිඞ්කාරමමිඞ්කාරමානානුසයා{1} න හොන්ති, තං ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං උපසම්පජ්ජ විහරෙය්ය.{2} ඉදං ච පන මෙතං ආනන්ද සන්ධාය භාසිතං පාරායණෙ පුණ්ණකපඤ්හෙ:"
                    },
                    {
                        "type": "gatha",
                        "text": "19. සඞ්ඛාය ලොකස්මිං පරොවරානි{3}\n යස්සිඤ්ජිතං නත්ථි කුහිඤ්චි ලොකෙ,\nසන්තො විධූමො අනීඝො නිරාසො \nඅතාරි සො ජාතිජරන්ති බ්රූමී’ති.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 3.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "33. අථ ඛො ආයස්මා **සාරිපුත්තො** යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො ආයස්මන්තං සාරිපුත්තං භගවා එතදවොච : සඞ්ඛිත්තෙනපි ඛො අහං සාරිපුත්ත ධම්මං දෙසෙය්යං, විත්ථාරෙනපි ඛො අහං සාරිපුත්ත ධම්මං දෙසෙය්යං, සඞ්ඛිත්තවිත්ථාරෙනපි ඛො අහං සාරිපුත්ත ධම්මං දෙසෙය්යං, අඤ්ඤාතාරො{4} ච දුල්ලභාති. එතස්ස භගවා කාලො, එතස්ස සුගත කාලො, යං භගවා සඞ්ඛිත්තෙනපි ධම්මං දෙසෙය්ය, විත්ථාරෙනපි ධම්මං දෙසෙය්ය, සඞ්ඛිත්තවිත්ථාරෙනපි ධම්මං දෙසෙය්ය. භවිස්සන්ති ධම්මස්ස අඤ්ඤාතාරොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්මාතිහ සාරිපුත්ත එවං සික්ඛිතබ්බං : ඉමස්මිං ච සවිඤ්ඤාණකෙ කායෙ අහිඞ්කාරමමිඞ්කාරමානානුසයා න භවිස්සන්ති, බහිද්ධා ච සබ්බනිමිත්තෙසු අහිඞ්කාරමමිඞ්කාරමානානුසයා න භවිස්සන්ති, යං ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං උපසම්පජ්ජ විහරතො අහිඞ්කාරමමිඞ්කාරමානානුසයා න හොන්ති, තං ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං උපසම්පජ්ජ විහරිස්සාමාති. එවං හි ඛො සාරිපුත්ත සික්ඛිතබ්බං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යතො ච ඛො සාරිපුත්ත භික්ඛුනො ඉමස්මිං ච සවිඤ්ඤාණකෙ කායෙ අහිඞ්කාරමමිඞ්කාරමානානුසයා න හොන්ති, බහිද්ධා ච සබ්බනිමිත්තෙසු අහිඞ්කාරමමිඞ්කාරමානානුසයා න හොන්ති, යං ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං උපසම්පජ්ජ විහරතො අහිඞ්කාරමමිඞ්කාරමානානුසයා න හොන්ති, තං ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං උපසම්පජ්ජ විහරති. අයං වුච්චති සාරිපුත්ත භික්ඛු අච්ඡෙච්ඡි{5} තණ්හං, වාවත්තයී{6} සංයොජනං, සම්මා මානාභිසමයා අන්තමකාසි දුක්ඛස්ස. ඉදං ච පන මෙතං සාරිපුත්ත සන්ධාය භාසිතං පාරායණෙ උදයපඤ්හෙ."
                    },
                    {
                        "type": "gatha",
                        "text": "20. පහාණං කාමසඤ්ඤානං දොමනස්සානචූභයං,\nථීනස්ස ච පනූදනං කුක්කුච්චානං නිවාරණං.\n\n21. උපෙක්ඛාසතිසංසුද්ධං ධම්මතක්කපුරෙජවං,\nඅඤ්ඤාවිමොක්ඛං පබ්රූමි අවිජ්ජායප්පභෙදනං’ති.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අහඞ්කාරමමඞ්කාරමානානුසයා - ස්යා. මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. විහරෙය්යාති - මඡසං. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. පරොපරානි -  මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. ධම්මස්ස අඤ්ඤාතාරො - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. අච්ඡෙජ්ජි - ස්යා. කං."
                    },
                    {
                        "type": "footnote",
                        "text": "6. විවත්තයි - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "ආනන්‍දයෙනි, මේ ශාසනයෙහි භික්‍ෂුහට මෙබඳු සිතෙක් වෙයි: යම් සියලු සංස්කාරයන්ගේ සංහිඳීමෙක් සියලු උපධීන්ගේ දුරලීමෙක් තෘෂ්ණාක්‍ෂයයෙක් නො ඇලීමෙක් නිරොධයෙක් නිවණෙක් වේ ද, තෙල ශාන්තය. තෙල ප්‍රණීතයි. ආනන්‍දයෙනි, යම්සේ මේ සවිඥානක ශරීරයෙහි අහඞ්කාර, මමඞ්කාර, මානානුසයයෝ නො වෙත් ද, යම් ඵලසමාධියකට ද ඵලප්‍රඥාවකට ද පැමිණ වාසය කරන්නාහට අහඞ්කාර, මමඞ්කාර, මානානුසයයෝ නො වෙත් ද, ඒ ඵලසමාධියට ද ඵලප්‍රඥාවට ද පැමිණ වාසය කරන්නේ ද, මෙසේ ඒ භික්‍ෂුහට එබඳු වූ සමාධිප්‍රතිලාභයෙක් වන්නේ ය. ආනන්‍දයෙනි, මේ කරුණ සඳහා පාරායණයෙහි පූර්‍ණක ප්‍රශ්නයෙහිදී මා විසින් තෙල දෙසන ලදී:",
                        "type": "paragraph"
                    },
                    {
                        "text": "19. ලෝකයෙහි ස්වාත්මභාව පරාත්මභාව සඞ්ඛ්‍යාත පරාවරයන් නුවණින් දැන, ලොව්හි කිසි අරමුණෙක්හිදු යමකුගේ කම්පායෙක් නැත් ද, විරුද්ධ වූ ක්ලේශයන් සංහිඳ වූ හෙයින් ශාන්ත වූ කායදුශ්චරිතාදි වූ දුම් නැති රාගාදි ඊඝ හා ආශා නැති හෙතෙම ජාති ජරා ව්‍යාධි මරණ සමූහය තරණය කෙළේය යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 3",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "33. එකල්හි ආයුෂ්මත් **සැරියුත්** තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළැඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පස් ව හුන්හ. එකත්පස් ව හුන් ආයුෂ්මත් සැරියුත් තෙරණුවනට භාග්‍යවතුන් වහන්සේ තෙල වදාළ සේක: ‘ශාරීපුත්‍රයෙනි, මම සැකෙවිනුදු දහම් දෙසමි. ශාරීපුත්‍රයෙනි, මම විතර විසිනුදු දහම් දෙසමි. සංක්‍ෂෙපවිස්තර දෙකිනුදු දහම් දෙසමි. එතෙකුදුවත් ප්‍රතිවෙධ කරණුවෝ දුර්ලභයහ යි. භාග්‍යවතුන්වහන්සේ යම් හෙයෙකින් සැකෙවිනුදු දහම් දෙසන සේක් ද, විතර විසිනුදු දහම් දෙසන සේක් ද, සංක්‍ෂෙපවිස්තර දෙකිනුත් දහම් දෙසන සේක් ද, භාග්‍යවතුන් වහන්ස, මේ එයට කලි. සුගතයන් වහන්ස, මේ එයට කලි. ධර්‍මය ප්‍රතිවෙධ කරණුවෝ වෙති යි."
                    },
                    {
                        "text": "ශාරීපුත්‍රයෙනි, එසේ හෙයින් මේ සවිඥානක ශරීරයෙහි අහඞ්කාර, මමඞ්කාර, මානානුසයයෝ නොවන්නාහු ද, බාහ්‍ය වූ හැම නිමිත්හිදු අහඞ්කාර, මමඞ්කාර, මානානුසයයෝ නොවන්නාහු ද, යම් ඵලසමාධියකටත් ඵලප්‍රඥාවකටත් පැමිණ වාසය කරන්නහුට අහඞ්කාර, මමඞ්කාර, මානානුසයයෝ නො වෙත් නම් ඒ ඵලසමාධියට ද ඵලප්‍රඥාවට ද පැමිණ වසන්නම්හ යි මෙසේ හික්මිය යුතුයි. ශාරීපුත්‍රයෙනි, තොප විසින් මෙසේ ම හික්මිය යුතුයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ශාරීපුත්‍රයෙනි, යම් කලෙක පටන්ගෙණ භික්‍ෂුහට සවිඥානක වූ මේ ශරීරයෙහි අහඞ්කාර, මමඞ්කාර, මානානුසයයෝ නොවෙත් නම්, බාහිර වූ සියලු නිමිත්තයෙහිදු අහඞ්කාර, මමඞ්කාර, මානානුසයයෝ නොවෙත් නම්, යම් ඵලසමාධියකට ද යම් ඵලප්‍රඥාවකට ද පැමිණ වාසය කරන්නහුට අහඞ්කාර, මමඞ්කාර, මානානුසයයෝ නො වෙත් නම්, ඒ ඵලසමාධියට ද ඵලප්‍රඥාවට ද පැමිණ වෙසේ නම්, ශාරීපුත්‍රයෙනි, මේ භික්‍ෂු තෘෂ්ණාව සිඳලී ය යි ද, සංයොජන උපුටා හළේ ය යි ද, මනා පිළිවෙතින් මානය සංහිඳවීමෙන් සසරදුක් අවසන් කෙළේය යි ද, කියනු ලැබේ. ශාරීපුත්‍රයෙනි, මෙය සඳහා ම **පාරායණ** වර්‍ගයෙහි **උදය ප්‍රශ්න**යෙහි මා විසින් තෙල දෙසන ලදී:",
                        "type": "paragraph"
                    },
                    {
                        "text": "20-21. කාමසංඥාවන්ගේ ද දොම්නසුන්ගේ දැයි මේ ධර්‍මයන් දෙදෙනාගේ ප්‍රහාණය ද ථීනමිද‍්ධයාගේ දුරලීම ද කුක්කුච්චයන්ගේ වැළැහීම ද චතුර්ථධ්‍යානයට අයත් ඵලයෙහි උපන් උපෙක්‍ෂායෙන් හා ස්මෘතියෙන් පිරිසිදු වූ සම්‍යක්සංකල්පය පෙරට කොට සිටි අඤ්ඤින්‍ද්‍රියයාගේ කෙළවර උපදනා අර්‍හත්ඵලය අවිද්‍යාව බිඳීමය යි කියමි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 248,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 4.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "34. තීණි’මානි භික්ඛවෙ නිදානානි කම්මානං සමුදයාය. කතමානි තීණි: ලොභො නිදානං කම්මානං සමුදයාය, දොසො නිදානං කම්මානං සමුදයාය, මොහො නිදානං කම්මානං සමුදයාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "යං භික්ඛවෙ ලොභපකතං කම්මං ලොභජං ලොභනිදානං ලොභසමුදයං, යත්ථස්ස අත්තභාවො නිබ්බත්තති, තත්ථ තං කම්මං විපච්චති. යත්ථ තං කම්මං විපච්චති, තත්ථ තස්ස කම්මස්ස විපාකං පටිසංවෙදෙති දිට්ඨෙ වා ධම්මෙ උපපජ්ජෙ වා,{1} අපරෙ වා පරියායෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "යං භික්ඛවෙ දොසපකතං කම්මං දොසජං දොසනිදානං දොසසමුදයං, යත්ථස්ස අත්තභාවො නිබ්බත්තති, තත්ථ තං කම්මං විපච්චති. යත්ථ තං කම්මං විපච්චති, තත්ථ තස්ස කම්මස්ස විපාකං පටිසංවෙදෙති දිට්ඨෙ වා ධම්මෙ, උපපජ්ජෙ වා,{1} අපරෙ වා පරියායෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "යං භික්ඛවෙ මොහපකතං කම්මං මොහජං මොහනිදානං මොහසමුදයං, යත්ථස්ස අත්තභාවො නිබ්බත්තති, තත්ථ තං කම්මං විපච්චති. යත්ථ තං කම්මං විපච්චති, තත්ථ තස්ස කම්මස්ස විපාකං පටිසංවෙදෙති දිට්ඨෙ වා ධම්මෙ, උපපජ්ජෙ වා, අපරෙ වා පරියායෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි භික්ඛවෙ බීජානි අඛණ්ඩානි අපූතීනි අවාතාතපහතානි සාරාදානි සුඛසයිතානි සුඛෙත්තෙ සුපරිකම්මකතාය භූමියා නික්ඛිත්තානි, දෙවො ච සම්මා ධාරං අනුප්පවෙච්ඡෙය්ය, එවස්සු තානි භික්ඛවෙ බීජානි වුද්ධිං විරූළ්හිං වෙපුල්ලං ආපජ්ජෙය්යුං. එවමෙව ඛො භික්ඛවෙ යං ලොභපකතං කම්මං ලොභජං ලොභනිදානං ලොභසමුදයං, යත්ථස්ස අත්තභාවො නිබ්බත්තති, තත්ථ තං කම්මං විපච්චති. යත්ථ තං කම්මං විපච්චති, තත්ථ තස්ස කම්මස්ස විපාකං පටිසංවෙදෙති දිට්ඨෙ වා ධම්මෙ, උපපජ්ජෙ, වා අපරෙ වා පරියායෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "යං දොසපකතං කම්මං -පෙ- යං මොහපකතං කම්මං මොහජං මොහනිදානං මොහසමුදයං, යත්ථස්ස අත්තභාවො නිබ්බත්තති, තත්ථ තං කම්මං විපච්චති. යත්ථ තං කම්මං විපච්චති, තත්ථ තස්ස කම්මස්ස විපාකං පටිසංවෙදෙති දිට්ඨෙ වා ධම්මෙ, උපපජ්ජෙ වා අපරෙ වා පරියායෙ. ඉමානි ඛො භික්ඛවෙ තීණි නිදානානි කම්මානං සමුදයාය."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උපපජ්ජ වා - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 4",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "34. මහණෙනි, (වෘත්තගාමී) කර්‍මයන්ගේ රැස් කිරීමට මේ කරුණු තුණෙකි. කවර තුණෙක යත්: කර්‍මයන්ගේ රැස් කිරීමට ලෝභය කරුණෙකි, කර්‍මයන්ගේ රැස් කිරීමට ද්වේෂය කරුණෙකි, කර්‍මයන්ගේ රැස් කිරීමට මෝහය කරුණෙකි."
                    },
                    {
                        "text": "මහණෙනි, ලෝභයෙන් කරණ ලද ලෝභයෙන් උපන් ලෝභය නිදාන කොට ඇති ලෝභය ප්‍රත්‍යය කොට ඇති යම් කර්‍මයෙක් වේ ද, යම් තැනෙක කර්‍මවත් ඔහුගේ පස්කඳ පහළ වේ ද, ඒ අත්බැව්හි ඔහුගේ ඒ කර්‍මය විපාක දෙයි. යම් තැනෙක ඒ කර්‍මය විපාක දෙන්නේ වේ ද, ඒ කර්‍මයාගේ විපාකය ඉහාත්මයෙහි හෝ දෙවන අත්බැව්හි හෝ අවකාශ ලත් යම් ම අත්බැවෙක හෝ විඳුනේය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ද්වේෂයෙන් කරණ ලද ද්වේෂයෙන් උපන් ද්වේෂය නිදාන කොට ඇති ද්වේෂය ප්‍රත්‍යය කොට ඇති යම් කර්‍මයෙක් වේ ද, යම් තැනෙක ඔහුගේ පස්කඳ පහළ වේ නම්, ඒ අත්බැව්හි ඒ කර්‍මය විවස්නේ වෙයි. යම් තැනෙක ඒ කර්‍මය විවස්නේ ද, මේ භවයෙහි වේවයි, දෙවන අත්බැව්හි වේවයි, තදන්‍යභවයෙක වේවයි, එහි ඒ කර්‍මවිපාකය විඳුනේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෝහයෙන් කරණ ලද මෝහයෙන් උපන් මෝහය නිදාන කොට ඇති මෝහය ප්‍රත්‍යය කොට ඇති යම් කර්‍මයෙක් වේ ද, යම් තැනෙක ඔහුගේ ආත්මභාවය පහළ වේ නම්, ඒ අත්බැව්හි ඒ කර්‍මය විවස්නේ වෙයි. යම් තැනෙක ඒ කර්‍මය විවස්නේ ද, ඉහාත්මභාවයෙහි වේවයි, දෙවන භවයෙහි වේවයි, තදන්‍යභවයෙක වේවයි, එහි ඒ කර්‍මවිපාකය විඳුනේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම්සේ නොබුන් කුණු නුවූ අව්සුළඟින් නොපහළ ඇදගත් සාරය ඇති සුවයෙන් හොත් මනා කෙතෙක්හි මොනොවට සහට බිම්හි වපුළ බීජකෙනෙක් වෙත් ද, මේඝය ද සම්‍යක් ධාරාව වර්‍ෂණ කෙරේ ද, මහණෙනි, එසේ ඇතිකල්හි ඒ බීජයෝ (අකුර නැඟීමෙන්) වෘද්ධියට (මුල්බැස ගැණීමෙන්) විරූඪියට (පැතිරීමෙන්) වෛපුල්‍යයට යන්නාහ. මහණෙනි, එපරිද්දෙන් ම ලෝභයෙන් කරන ලද ලෝභයෙන් උපන් ලෝභය නිදාන කොට ඇති ලෝභය ප්‍රත්‍යය කොට ඇති යම් කර්‍මයෙක් වේ ද, යම් තැනෙක ඔහුගේ ආත්මභාවය (පස්කඳ) පහළ වේ ද, ඒ අත්බැව්හි ඒ කර්‍මය විවස්නේය. යම් තැනෙක ඒ කර්‍මය විවස්නේ වේ ද, ඉහාත්මභාවයෙහි වේවයි, දෙවන අත්බැව්හි වේවයි, තදන්‍යභවයෙක වේවයි, එහි ඒ කර්‍ම විපාකය විඳුනේය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ද්වේෂයෙන් කරණ ලද යම් කර්‍මයෙක් වේ ද ... මෝහයෙන් කරණ ලද මෝහයෙන් උපන් මෝහය නිදාන කොට ඇති මෝහය ප්‍රත්‍යය කොට ඇති යම් කර්‍මයෙක් වේ ද, යම් තැනෙක ඔහුගේ ආත්මභාවය පහළ වේ ද, එහි ඔහුගේ ඒ කර්‍මය විවස්නේය. යම් තැනෙක ඒ කර්‍මය විවස්නේ වේ ද, ඉහාත්මභාවයෙහි වේවයි, දෙවන අත්බැව්හි වේවයි, එයින් අන් අත්බැවෙක්හි වේවයි එහි ඒ කර්‍මවිපාකය විඳුනේය. මහණෙනි, (වෘත්තගාමී) කර්‍මයන්ගේ සමුදය පිණිස මේ නිදානයෝ තුන් දෙන වෙති.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 250,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තීණිමානි භික්ඛවෙ නිදානානි කම්මානං සමුදයාය. කතමානි තීණි: අලොභො නිදානං කම්මානං සමුදයාය, අදොසො නිදානං කම්මානං සමුදයාය, අමොහො නිදානං කම්මානං සමුදයාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "යං භික්ඛවෙ අලොභපකතං කම්මං අලොභජං අලොභනිදානං අලොභසමුදයං, ලොභෙ විගතෙ එවං තං කම්මං පහීණං හොති උච්ඡින්නමූලං තාලාවත්ථුකතං අනභාවකතං{1} ආයතිං අනුප්පාදධම්මං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යං භික්ඛවෙ අදොසපකතං කම්මං අදොසජං අදොසනිදානං අදොසසමුදයං, දොසෙ විගතෙ එවං තං කම්මං පහීණං හොති උච්ඡින්නමූලං තාලාවත්ථුකතං අනභාවකතං{1} ආයතිං අනුප්පාදධම්මං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යං භික්ඛවෙ අමොහපකතං කම්මං අමොහජං අමොහනිදානං අමොහසමුදයං, මොහෙ විගතෙ එවං තං කම්මං පහීණං හොති උච්ඡින්නමූලං තාලාවත්ථුකතං අනභාවකතං ආයතිං අනුප්පාදධම්මං."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි භික්ඛවෙ බීජානි අඛණ්ඩානි අපූතීනි අවාතාතපහතානි සාරාදානි සුඛසයිතානි. තානි පුරිසො අග්ගිනා දහෙය්ය. අග්ගිනා දහිත්වා මසිං කරෙය්ය. මසිං කරිත්වා මහාවාතෙ වා ඔපුනෙය්ය,{3} නදියා වා සීඝසොතාය පවාහෙය්ය. එවස්සු තානි භික්ඛවෙ බීජානි උච්ඡින්නමූලානි තාලාවත්ථුකතානි අනභාවකතානි ආයතිං අනුප්පාදධම්මානි. එවමෙව ඛො භික්ඛවෙ යං අලොභපකතං කම්මං අලොභජං අලොභනිදානං අලොභසමුදයං, ලොභෙ විගතෙ එවං තං කම්මං පහීණං හොති උච්ඡින්නමූලං තාලාවත්ථුකතං අනභාවකතං ආයතිං අනුප්පාදධම්මං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යං අදොසපකතං කම්මං -පෙ- යං අමොහපකතං කම්මං අමොහජං අමොහනිදානං අමොහසමුදයං, මොහෙ විගතෙ එවං තං කම්මං පහීණං හොති උච්ඡින්නමූලං තාලාවත්ථුකතං අනභාවකතං ආයතිං අනුප්පාදධම්මං. ඉමානි ඛො භික්ඛවෙ තීණි නිදානානි කම්මානං සමුදයායාති."
                    },
                    {
                        "type": "gatha",
                        "text": "22. ලොභජං දොසජං චෙව මොහජං චාපවිද්දසු,\nයං තෙන පකතං කම්මං අප්පං වා යදි වා බහුං,\nඉධෙව තං වෙදනීයං වත්ථු අඤ්ඤං න විජ්ජති.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "23. තස්මා ලොභං ච දොසං ච මොහජං චාපි විද්දසු,\nවිජ්ජං උප්පාදයං භික්ඛු සබ්බා දුග්ගතියො ජහෙ’ති.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අනභාවං කතං - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ඔඵුණෙය්ය - මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, වෘත්තගාමී කර්‍මයන්ගේ සමුදය පිණිස මේ නිදානයෝ තුන් දෙනෙකි. කවර තුන් දෙනෙක් යත්: වෘත්තගාමී කර්‍මයන්ගේ සමුදය පිණිස අලෝභය නිදාන වේ. වෘත්තගාමී කර්‍මයන්ගේ සමුදය පිණිස අදෝසය නිදානය වේ. වෘත්තගාමී කර්‍මයන්ගේ සමුදය පිණිස අමෝහය නිදානය වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අලෝභයෙන් කරණ ලද අලෝභයෙන් උපන් අලෝභය නිදාන කොට ඇති අලෝභය සමුදය කොට ඇති යම් කර්‍මයෙක් වේ ද, ලෝභය පහ වූ කල්හි මෙසේ ඒ කර්‍මය ප්‍රහත වේ. උපුටා හළ මුල් ඇති වේ. මුදුන සිඳලූ (තාලවස්තුවක් මෙන්) කරණ ලද්දේ වේ. නැවත නොවැඩීම කරණ ලද්දේ වේ. නැවත නූපදනා සැහැවි ඇති වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අද්වේෂයෙන් කරණ ලද අද්වේෂයෙන් උපන් අද්වේෂය නිදාන කොට ඇති අද්වේෂය සමුදය කොට ඇති යම් කර්‍මයෙක් වේ ද, ද්වේෂය පහ වූ කල්හි මෙසේ ඒ කර්‍මය ප්‍රහත වේ. උපුටා හළ මුල් ඇති වේ. (මුදුන සිඳුනා ලද) තාලවස්තුවක් මෙන් කරණ ලද්දේ වේ. මතු නොවැඩීම කරණ ලද්දේ වේ. මතු නූපදනා සැහැවි ඇති වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අමෝහයෙන් කරණ ලද අමෝහයෙන් උපන් අමෝහය නිදාන කොට ඇති අමෝහය සමුදය කොට ඇති යම් කර්‍මයෙක් වේ ද, මෝහය පහ වූ කල්හි මෙසේ ඒ කර්‍මය ප්‍රහත වේ. උපුටා හළ මුල් ඇති වේ. (මුදුන සිඳුනා ලද) තාලවස්තුවක් මෙන් කරණ ලද්දේ වේ. නැවත නොවැඩීම කරණ ලද්දේ වේ. නැවත නූපදනා සැහැවි ඇති වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම්සේ නො බුන් කුණු නුවූ අව්සුළඟින් නොපහළ ඇදගත් සාරය ඇති, මොනොවට හොත් බිජුවට ඇත් ද, ඒ බිජුවට පුරුෂයෙක් ගින්නෙන් දවන්නේ ද, ගින්නෙන් දවා හළු කරන්නේ ද, හළු කොට මහසුළඟෙහි හෝ පොළාහරණේ ද, සැඩ දියපහර ඇති නදියෙක්හි හෝ උල්පවා හරණේ ද, මහණෙනි, එසේ ඇති කල්හි ඒ බිජුවට සිඳලූ මුල් ඇති වේ. (මුදුන සිඳුනා ලද) තාලවස්තුවක් මෙන් කරණ ලද්දේ වේ. නැවත නොවැඩීම කරණ ලද්දේ වේ. මත්තෙහි නූපදනා සැහැවි ඇති වේ. මහණෙනි, එපරිද්දෙන් ම අලෝභයෙන් කරණ ලද අලෝභයෙන් උපන් අලෝභය නිදාන කොට ඇති අලෝභය සමුදය කොට ඇති යම් කර්‍මයෙක් වේ ද, ලෝභය පහවූ කල්හි මෙසේ ඒ කර්‍මය ප්‍රහත වේ. සිඳලූ මුල් ඇති වේ. (මුදුන සිඳුනා ලද) තාලවස්තුවක් මෙන් කරණ ලද්දේ වේ. නැවත නොවැඩීම කරණ ලද්දේ වේ. නැවත නූපදනා සැහැවි ඇති වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අද්වේෂයෙන් කරණ ලද යම් කර්‍මයෙක් වේ ද ... අමෝහයෙන් කරණ ලද අමෝහයෙන් උපන් අමෝහය නිදාන කොට ඇති අමෝහය සමුදය කොට ඇති යම් කර්‍මයෙක් වේ ද, මෝහය පහ වූ කල්හි ඒ කර්‍මය ප්‍රහත වේ. සිඳලු මුල් ඇති වේ. (මුදුන සිඳලු) තාලවස්තුවක් මෙන් කරණ ලද්දේ වේ. නැවත නොවැඩීම කරණ ලද්දේ වේ. නැවත නූපදනා සැහැවි ඇති වේ. මහණෙනි, වෘත්තගාමී කර්‍මයන්ගේ සමුදය පිණිස වූ තුන් නිදානයෝයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "22. අන්‍ධ බාල තෙම ලෝභයෙන් උපන් හෝ ද්වේෂයෙන් උපන් හෝ{1} ස්වල්ප වූ හෝ බොහෝ වූ යම් කර්‍මයක් කරයි ද, ඔහු විසින් කරණ ලද ඒ කර්‍මය මේ අත්බැව්හි ම වින්ද යුතු වේ. (එහි විපාක දීමට) අන් තැනෙක් නැත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "23. එහෙයින් පණ්ඩිත භික්‍ෂු තෙම අර්‍හත්ත්වමාර්ඥානවිද්‍යාව උපදවන්නේ ලොභයෙන් උපන් හෝ ද්වේෂයෙන් උපන් හෝ මෝහයෙන් උපන් කර්‍ම ද සියලු දුගතීන් ද දුර ලන්නේ යයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. “මෝහයෙන් උපන් හෝ” යන්න ද එක්විය යුතුය."
                    }
                ]
            }
        },
        {
            "pageNum": 252,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 5.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "35. එකං සමයං භගවා **ආළවියං** විහරති ගොමග්ගෙ සිංසපාවනෙ පණ්ණසන්ථරෙ. අථ ඛො **හත්ථකො** ආළවකො ජඞ්ඝාවිහාරං අනුචඞ්කමමානො අනුවිචරමානො අද්දස භගවන්තං ගොමග්ගෙ සිංසපාවනෙ පණ්ණසන්ථරෙ නිසින්නං. දිස්වා යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො හත්ථකො ආළවකො භගවන්තං එතදවොච: කච්චි භන්තෙ භගවා සුඛමසයිත්ථාති? එවං කුමාර සුඛමසයිත්ථං. යෙ ච පන ලොකෙ සුඛං සෙන්ති, අහං තෙසං අඤ්ඤතරොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සීතා භන්තෙ හෙමන්තිකා රත්ති, අන්තරට්ඨකො හිමපාතසමයො, ඛරා ගොකණ්ටකහතා භූමි, තනුකො පණ්ණසන්ථරො, විරළානි රුක්ඛස්ස පත්තානි, සීතානි කාසායානි වත්ථානි, සීතො ච වෙරම්බවාතො{1} වාති. අථ ච පන භගවා එවමාහ: එවං කුමාර සුඛමසයිත්ථං; යෙ ච පන ලොකෙ සුඛං සෙන්ති, අහං තෙසං අඤ්ඤතරොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන හි කුමාර, තඤ්ඤෙවෙත්ථ පටිපුච්ඡිස්සාමි; යථා තෙ ඛමෙය්ය, තථා නං ව්යාකරෙය්යාසි. තං කිම්මඤ්ඤසි කුමාර? ඉධස්ස ගහපතිස්ස වා ගහපතිපුත්තස්ස වා කූටාගාරං උල්ලිත්තාවලිත්තං නිවාතං ඵුස්සිතග්ගලං පිහිතවාතපානං; තත්රස්ස පල්ලඞ්කො ගොණකත්ථතො පටිකත්ථතො පටලිකත්ථතො කදලිමිගපවර පච්චත්ථරණො{2} සඋත්තරච්ඡදො උභතොලොහිතකූපධානො; තෙලප්පදීපො චෙත්ථ ඣායෙය්ය; චතස්සො ච පජාපතියො මනාපමනාපෙන පච්චුපට්ඨිතාස්සු; තං කිම්මඤ්ඤසි කුමාර සුඛං වා සො සයෙය්ය, නො වා, කථං වා තෙ එත්ථ හොතීති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සුඛං සො භන්තෙ සයෙය්ය; යෙ ච පන ලොකෙ සුඛං සෙන්ති, සො තෙසං අඤ්ඤතරොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තං කිම්මඤ්ඤසි කුමාර? අපි නු තස්ස ගහපතිස්ස වා ගහපතිපුත්තස්ස වා උප්පජ්ජෙය්යුං රාගජා පරිළාහා කායිකා වා චෙතසිකා වා, යෙහි සො රාගජෙහි පරිළාහෙහි පරිඩය්හමානො දුක්ඛං සයෙය්යාති? එවං භන්තෙ. යෙහි ඛො සො කුමාර, ගහපති වා ගහපතිපුත්තො වා රාගජෙහි පරිළාහෙහි පරිඩය්හමානො දුක්ඛං සයෙය්ය, සො රාගො තථාගතස්ස පහීනො උච්ඡින්නමූලො තාලාවත්ථුකතො අනභාවකතො ආයතිං අනුප්පාදධම්මො. තස්මාහං සුඛමසයිත්ථං. තං කිම්මඤ්ඤසි කුමාර? අපි නු තස්ස ගහපතිස්ස වා ගහපතිපුත්තස්ස වා උප්පජ්ජෙය්යුං දොසජා පරිළාහා -පෙ- උප්පජ්ජෙය්යුං මොහජා පරිළාහා කායිකා වා චෙතසිකා වා යෙහි සො මොහජෙහි පරිළාහෙහි පරිඩය්හමානො දුක්ඛං සයෙය්යාති? එවං භන්තෙ. යෙ හි ඛො සො කුමාර, ගහපති වා ගහපතිපුත්තො වා මොහජෙහි පරිළාහෙහි පරිඩය්හමානො දුක්ඛං සයෙය්ය, සො මොහො තථාගතස්ස පහීනො උච්ඡින්නමූලො තාලාවත්ථුකතො අනභාවකතො ආයතිං අනුප්පාදධම්මො. තස්මාහං සුඛමසයිත්ථං’ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. වෙරම්භො වාතො වායති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. කදලිමිගපවර පච්චත්ථරණො - මඡසං, ස්යා. PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 5",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "35. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ **අළව්රට** ගොන්මග ඇට්ටර වෙනෙහි කොළ ඇතිරියෙහි වැඩවසන සේක. එකල්හි **හත්‍ථක** ආළවක නම් රජපුත් ජඞ්ඝාවිහාරය කොට සක්මන් කරනුයේ ඇවිදිනුයේ ගොන්මග ඇට්ටර වෙන්හි කොළ ඇතිරියෙහි වැඩහුන් භාග්‍යවතුන් වහන්සේ දුටුයේය. දැක භාග්‍යවතුන් වහන්සේ වෙත එළඹියේය. එළැඹ භාග්‍යවතුන් වහන්සේ සකසා වැඳ එකත් පස් ව හින. එකත්පස්ව හුන් හත්‍ථක ආළවක භාග්‍යවතුන් වහන්සේට මෙය කීය: කිමෙක් ද, වහන්ස, භාග්‍යවතුන් වහන්සේ සුවසේ හොත්සේක් ද? කුමාරය, එසේ ය. සුවසේ හොත්මි. ලොව්හි යම් කෙනෙක් සුවසේ හොවිත් නම්, මම ඔවුන් අතුරෙන් අන්‍යතරයෙක්මි."
                    },
                    {
                        "text": "වහන්ස, හේමන්තයට අයත් රැය ශීතය, (නවම් මැදින් දෙමස අගමුල අට දවස) හිම වැටෙන කාලය වේ. බිම රළුය, ගොකුරකටුයෙන් බිඳින. පත් ඇතිරිය තූනීය. ගසේ කොළ ද විරල ය. කසාවත් සිහිලැ. සිහිල් වේරම්බ වාතය ද හමයි. එතෙකුදු වුව භාග්‍යවතුන් වහන්සේ මෙසේ වදාරණ සේක: ‘කුමාරය, එසේ ය. සුවසේ හොත්මි. ලොව්හි යම් කෙනෙක් සුවසේ හොවිත් නම්, මම ඔවුනතුරෙන් අන්‍යතරයෙක්මි යි.’",
                        "type": "paragraph"
                    },
                    {
                        "text": "කුමාරය, එසේ නම් මෙහිලා තා ම පුළුවුස්මි. යම්සේ තට රුස්නේ නම්, එසේ ප්‍රකාශ කරව. කුමාරය, එය කිමැයි හඟනෙහි ද? මෙ ලොව්හි ගැහැවියකුහට හෝ ගැහැවි පුතකුට හෝ ඇතුළත පිටත අලෙව් දුන් වාතයෙන් තොර වූ වැද්දූ අගුල් ඇති යෙදූ වා කවුළු ඇති කුළුගෙයක් වන්නේ නම්, එහි කළුකොඳු පලස් අතුළ, සුදු එළුලොම්මුවා ඇතිරි අතුළ, ඝනපුප් එළුලොම් ඇතිරි අතුළ, කෙහෙල්මුව සමින් කළ උතුම් පසතුරුණු ඇති, උඩුවියන් සහිත හිස්දොර හා පාමුල දෙපස රත් කන්වයින් ඇති පලඟෙක් ඇත් නම්, තෙල් පහනෙක් ද එහි දැල්වේ නම්, පාදපරිචාරිකාවෝ සිවුදෙනකුත් මනාප මනාප උපස්ථානයෙන් එළඹ සිටියාහු නම්, කුමාරය, එය කිමැයි සිතයි ද? හෙතෙම සුවසේ හෝනේ හෝ වේ ද? නොහොත් නො වේ ද? මෙහිලා තට කෙබඳු සිතෙක් හෝ වේ දැ”යි?",
                        "type": "paragraph"
                    },
                    {
                        "text": "‘වහන්ස, හෙතෙම සැපසේ හෝනේය. ලොව්හි යම් කෙනෙකුන් සුවසේ හොවිත් නම්, හෙතෙම ඔවුනතුරෙන් අන්‍යතරයෙකැ’යි කීය. කුමාරය, එසේ නම් මෙහිලා තා ම පුළුවුස්මි. යම්සේ තට රුස්නේ නම්, එසේ ප්‍රකාශ කරව.",
                        "type": "paragraph"
                    },
                    {
                        "text": "‘කුමාරය, ‘එය කිමැ’යි සිතයි ද? රාගයෙන් උපන් යම්බඳු පරිදාහයෙන් දැවෙන හෙතෙම දුකසේ හෝනේ නම්, එබඳු කය පිලිබඳ වූ හෝ සිත පිළිබඳ වූ හෝ රාගයෙන් උපන් පරිදාහයෝ ඒ ගෘහපතියාට හෝ ගෘහපතිපුත්‍රයාට හෝ උපදනාහු ද? ‘වහන්ස, එසේය’. ‘කුමාරය, ඒ ගෘහපති තෙමේ හෝ ගෘහපති පුත්‍රයා හෝ රාගයෙන් උපන් යම් දැවිල්ලෙකින් හාත්පසින් දැවෙන්නේ දුකසේ හෝනේ නම්, ඒ රාගය තථාගයන් වහන්සේට ප්‍රහතය, උපුටා හළ මුල් ඇත්තේය, (මුදුන සිඳුනා ලද) තාලවස්තුවක් මෙන් කරණ ලද්දේය. නැවත නොවැඩීම කරණ ලද්දේය. නැවත නුපදනා සැහැවි ඇත්තේය. එහෙයින් මම සුවසේ හොත්මි. ‘කුමාරය, එය කිමැ’යි සිතයි ද? ඒ ගෘහපතියාහට හෝ ගෘහපතිපුත්‍රයාහට හෝ ද්වේෂයෙන් උපන් දැවිලිහි ඉදින් උපදනාහු ද? -පෙ- හෙතෙම යම්බඳු මෝහයෙන් උපන් දැවිල්ලෙන් දැවෙන්නේ දුකසේ හොවී නම්, එබඳු වූ කායික හෝ චෛතසික හෝ මෝහයෙන් උපන් දැවිලිහි උපදින්නාහු ද? ‘වහන්ස, එසේය.’ ‘කුමාරය, ඒ ගෘහපතියා හෝ ගෘහපතිපුත්‍රයා හෝ මෝහයෙන් උපන් යම්බඳු දැවිල්ලෙකින් දැවෙන්නේ දුකසේ හෝනේ නම්, ඒ මෝහය තථාගතයනට ප්‍රහතය. උපුටා හළ මුල් ඇත්තේය. (මුඳුන සිඳලූ) තාලවස්තුවක් මෙන් කරණ ලද්දේය. නැවත නොවැඩීම කරණ ලද්දේය. මතු නූපදනා සැහැවි ඇත්තේය. එහෙයින් මම සුවසේ හොත්මි’යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 254,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "24. සබ්බදා වෙ සුඛං සෙති, බ්රාහ්මණො පරිනිබ්බුතො,\nයො න ලිම්පති{1} කාමෙසු සීතිභූතො නිරූපධි.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "25. සබ්බා ආසත්තියො ඡෙත්වා විනෙය්ය හදයෙ දරං,\nඋපසන්තො සුඛං සෙති සන්තිං පප්පුය්ය චෙතසොති.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 6.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "**(සාවත්ථිනිදානං:)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "36. තීණිමානි භික්ඛවෙ **දෙවදූතානි**. කතමානි තීණි: ඉධ භික්ඛවෙ එකච්චො කායෙන දුච්චරිතං චරති, වාචාය දුච්චරිතං චරති, මනසා දුච්චරිතං චරති. සො කායෙන දුච්චරිතං චරිත්වා, වාචාය දුච්චරිතං චරිත්වා, මනසා දුච්චරිතං චරිත්වා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජති. තමෙනං භික්ඛවෙ නිරයපාලා නානාබාහාසු ගහෙත්වා යමස්ස රඤ්ඤො දස්සෙන්ති: ‘අයං දෙව පුරිසො අමත්තෙය්යො අපෙත්තෙය්යො අසාමඤ්ඤො අබ්රහ්මඤ්ඤො, න කුලෙජෙට්ඨාපචායී. ඉමස්ස දෙවො දණ්ඩං පණෙතූ’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තමෙනං භික්ඛවෙ යමො රාජා පඨමං දෙවදූතං සමනුයුඤ්ජති, සමනුගාහති, සමනුභාසති: ‘අම්භො පුරිස, න ත්වං අද්දස මනුස්සෙසු පඨමං දෙවදූතං පාතුභූත’න්ති. සො එවමාහ : ‘නාද්දසං භන්තෙ’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තමෙනං භික්ඛවෙ යමො රාජා එවමාහ: ‘අම්භො පුරිස, න ත්වං අද්දස මනුස්සෙසු ඉත්ථිං වා පුරිසං වා ආසීතිකං වා නාවුතිකං වා වස්සසතිකං වා ජාතියා, ජිණ්ණං ගොපානසිවඞ්කං භොග්ගං දණ්ඩපරායණං පවෙධමානං ගච්ඡන්තං ආතුරං ගතයොබ්බනං ඛණ්ඩදන්තං පලිතකෙසං විලූනං ඛලිතංසිරො{2} වලිතං තිලකාහතගත්ත’න්ති. සො එවමාහ: ‘අද්දසං භන්තෙ’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තමෙනං භික්ඛවෙ යමො රාජා එවමාහ: ‘අම්භො පුරිස, තස්ස තෙ විඤ්ඤුස්ස සතො මහල්ලකස්ස න එතදහොසි: ‘අහම්පි ඛොම්හි ජරාධම්මො ජරං අනතීතො, හන්දාහං කල්යාණං කරොමි කායෙන වාචාය මනසා’ති? සො එවමාහ: ‘නාසක්ඛිස්සං, භන්තෙ. පමාදස්සං භන්තෙ’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තමෙනං භික්ඛවෙ යමො රාජා එවමාහ: ‘අම්භො පුරිස, පමාදවතාය න කල්යාණමකාසි කායෙන වාචාය මනසා. තග්ඝ ත්වං අම්භො පුරිස, තථා කරිස්සන්ති යථා තං පමත්තං. තං ඛො පනෙතං පාපං කම්මං නෙව මාතරා කතං, න පිතරා කතං, න භාතරා කතං, න භගිනියා කතං, න මිත්තාමච්චෙහි කතං, න ඤාතිසාලොහිතෙහි කතං, න දෙවතාහි කතං, න සමණබ්රාහ්මණෙහි කතං. අථ ඛො තයා වෙතං පාපං කම්මං කතං, ත්වඤ්ඤෙවෙතස්ස විපාකං පටිසංවෙදිස්සසී’ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ලිප්පති - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ඛල්ලිත සිරං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "24. (කෙලෙස් පිරිනිවීමෙන්) පිරිනිවීගිය (කෙලෙස්තැවීම නැති බැවින්) සිහිල් වූ ක්ලේශෝපධීන්ගේ අභාවයෙන් උපධි රහිත වූ යමෙක් වස්තුකාම ක්ලේශකාමයන්හි නො ඇලේ ද, ඒ ක්‍ෂීණාස්‍රව බ්‍රාහ්මණ තෙම හැමකල්හි සැපසේ හොවියි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "25. සියලු තෘෂ්ණාවන් සිඳ සිත්හි ක්ලේශදරථ සංහිඳුවා චිත්තශාන්තියට පැමිණ සංහුන් වූයේ සුවසේ හෝනේය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 6.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "**[සැවැත්නිදානයි:]**"
                    },
                    {
                        "text": "36. මහණෙනි, මේ **දෙවදූතයෝ** තිදෙනෙකි. කවර තිදෙනෙක යත්: මහණෙනි, මෙ ලොව්හි එකෙක් කයින් දුසිරිත් කරනේය. වචනයෙන් දුසිරිත් කරනේය. සිතින් දුසිරිත් කරනේය. හෙතෙම කයින් දුසිරිත් කොට වචනයෙන් දුසිරිත් කොට සිතින් දුසිරිත් කොට කාබුන් මරණින් මත්තෙහි අපාය නම් වූ දුගති නම් වූ විනිපාත නම් වූ නරකයට පැමිණෙයි. මහණෙනි, යමපල්හු ඔහු වෙන වෙන අත්හි ලා ගෙණ යමරජුට දක්වත්. ‘දේවයන් වහන්ස, මේ පුරුෂ මවට අහිතයෙක, පියාට අහිතයෙක, මහණුනට අහිතයෙක, බමුණනට අහිතයෙක, කුලදෙටුවන් නොපුදන්නෙක. දේවයන් වහන්සේ මුහුට දඬුවම් එළවත්වා’ යී.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යමරජ ඔහුගෙන් පළමු දේවදූතයා අනුයෝග වතට නඟා විචාරයි. ලබ්ධියෙහි පිහිටුවයි, කරුණු විචාරයි: ‘එම්බා පුරුෂය, මිනිසුන් අතුරෙහි පහළ වූ පළමු දෙවදුතයා තෝ නොදිටිහි ද?’ හේ මෙසේ කියයි. ‘වහන්ස, නො දිටිමි.’",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යමරජ ඔහුට මෙසේ කියයි: ‘එම්බා පුරුෂය, තෝ මිනිසුන් අතුරෙහි උපතින් අසූවස් ගියා වූ හෝ අනූවස් ගියා වූ හෝ සියවස් ගියා වූ හෝ දිරූ ගොනැස්සක් මෙන් නැමූනා වූ වක් වූ සැරයටිය පිහිට කොට ඇති ව වෙවුළමින් යන්නා වූ ජරායෙන් ආතුර වූ ගිය යොවුන් විය ඇති, කඩදත් ඇති, පැසුනු කෙස් ඇති, මුඩු හිස් ඇති, මට්ටත්තල ඇති, හටගත් රැලි ඇති, තලකැලලින් යුත් සිරුරු ඇති, ස්ත්‍රියක හෝ පුරුෂයකු, නොදිටිහි ද?’ හේ මෙසේ කියයි: ‘වහන්ස, දිටිමි.’",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යමරජ ඔහුට මෙසේ කියයි: ‘එම්බා පුරුෂය, මහලු වූ නුවණැත්තා වූ ම ඒ තාහට මෙබඳු සිතෙක් නො වී ද? ‘මම ද ජරාව නො ඉක්ම වූයෙම් ජරාව ස්වභාව කොට ඇත්තෙම් වෙමි. ඉදින් මම කයින් වචසින් මනසින් කලණ දහම් පුරුදු කෙරෙම් නම් මැනවැ’ යි. හෙතෙම මෙසේ කියයි: ‘වහන්ස, නො හැකිවීමි. වහන්ස, පමා වීමි’යී.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඔහට යමරජ මෙසේ කියයි: ‘එම්බා පුරුෂය, පමාවත් බැවින් කයින් වචසින් මනසින් කුසල් නො කෙළෙහි, එම්බා පුරුෂය, එහෙයින් ඒ පමාවූවහුට යම්සේ ද එසේ තට කරන්නාහ. ඒ මේ පාපකර්‍මය වනාහි මව විසින් නො ම කරණ ලද්දේ ය. පියා විසින් නො ම කරණ ලද්දේ ය. බෑයා විසින් නො ම කරණ ලද්දේ ය. බිහිනිය විසින් නො ම කරණ ලද්දේ ය. සගයහළුවන් විසිනුදු නො ම කරණ ලද්දේ ය. නෑ සහලේ නෑයන් විසිනුදු නො ම කරණ ලද්දේ ය. දෙවියන් විසින් නො ම කරණ ලද්දේ ය. මහණ බමුණන් විසින් නො ම කරණ ලද්දේ ය. වැලිදු තා විසින් ම මේ පාපකර්‍මය කරණ ලදී. තෝ ම මේ කර්‍මයාගේ විපාක විඳුව’ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 256,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තමෙනං භික්ඛවෙ යමො රාජා පඨමං දෙවදූතං සමනුයුඤ්ජිත්වා සමනුගාහිත්වා සමනුභාසිත්වා, දුතියං දෙවදූතං සමනුයුඤ්ජති, සමනුගාහති, සමනුභාසති: ‘අම්භො පුරිස, න ත්වං අද්දස මනුස්සෙසු දුතියං දෙවදූතං පාතුභූතන්ති?’ සො එවමාහ: ‘නාද්දසං භන්තෙ’ති. තමෙනං භික්ඛවෙ යමො රාජා එවමාහ: ‘අම්භො පුරිස, න ත්වං අද්දස මනුස්සෙසු ඉත්ථිං වා පුරිසං වා ආබාධිකං දුක්ඛිතං බාළ්හගිලානං, සකෙ මුත්තකරීසෙ පළිපන්නං සෙමානං අඤ්ඤෙහි වුට්ඨාපියමානං, අඤ්ඤෙහි සංවෙසියමානන්ති?’ සො එවමාහ: ‘අද්දසං, භන්තෙ’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තමෙනං භික්ඛවෙ යමො රාජා එවමාහ: අම්භො පුරිස, තස්ස තෙ විඤ්ඤුස්ස සතො මහල්ලකස්ස න එතදහොසි: අහම්පි ඛොම්හි ව්යාධිධම්මො ව්යාධිං අනතීතො, හන්දාහං කල්යාණං කරොමි කායෙන වාචාය මනසාති. සො එවමාහ: නාසක්ඛිස්සං භන්තෙ. පමාදස්සං භන්තෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තමෙනං භික්ඛවෙ යමො රාජා එවමාහ: ‘අම්භො පුරිස, පමාදවතාය න කල්යාණමකාසි කායෙන වාචාය මනසා. තග්ඝ ත්වං අම්භො පුරිස, තථා කරිස්සන්ති යථා තං පමත්තං; තං ඛො පනෙතං පාපං{1} කම්මං නෙව මාතරා කතං, න පිතරා කතං, න භාතරා කතං, න භගිනියා කතං, න මිත්තාමච්චෙහි කතං, න ඤාතිසාලොහිතෙහි කතං, න දෙවතාහි කතං, න සමණබ්රාහ්මණෙහි කතං. අථ ඛො තයා වෙතං පාපං{1} කම්මං කතං. ත්වඤ්ඤෙවෙතස්ස විපාකං පටිසංවෙදිස්සසී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තමෙනං භික්ඛවෙ යමො රාජා දුතියං දෙවදූතං සමනුයුඤ්ජිත්වා සමනුගාහිත්වා සමනුභාසිත්වා, තතියං දෙවදූතං සමනුයුඤ්ජති සමනුගාහති සමනුභාසති: ‘අම්භො පුරිස, න ත්වං අද්දස මනුස්සෙසු තතියං දෙවදූතං පාතුභූතන්ති?’ සො එවමාහ: ‘නාද්දසං, භන්තෙ’ති. තමෙනං භික්ඛවෙ යමො රාජා එවමාහ: ‘අම්භො පුරිස, න ත්වං අද්දස මනුස්සෙසු ඉත්ථිං වා පුරිසං වා එකාහමතං වා ද්වීහමතං වා තීහමතං වා උද්ධුමාතකං විනීලකං විපුබ්බකජාතන්ති? සො එවමාහ: ‘අද්දසං, භන්තෙ’ති. තමෙනං භික්ඛවෙ යමො රාජා එවමාහ: ‘අම්භො පුරිස, තස්ස තෙ විඤ්ඤුස්ස සතො මහල්ලකස්ස න එතදහොසි: ‘අහම්පි ඛොම්හි මරණධම්මො, මරණං අනතීතො, හන්දාහං කල්යාණං කරොමි කායෙන වාචාය මනසා’ති. සො එවමාහ: ‘නාසක්ඛිස්සං භන්තෙ. පමාදස්සං භන්තෙ’ති. තමෙනං භික්ඛවෙ යමො රාජා එවමාහ: ‘අම්භො පුරිස, පමාදවතාය න කල්යාණමකාසි කායෙන වාචාය මනසා. තග්ඝ ත්වං අම්භො පුරිස, තථා කරිස්සන්ති යථා තං පමත්තං. තං ඛො පනෙතං පාපං{1} කම්මං නෙව මාතරා කතං, න පිතරා කතං, න භාතරා කතං, න භගිනියා කතං, න මිත්තාමච්චෙහි කතං, න ඤාතිසාලොහිතෙහි කතං, න දෙවතාහි කතං, න සමණබ්රාහ්මණෙහි කතං. අථ ඛො තයා වෙතං පාපං{1} කම්මං කතං. ත්වඤ්ඤෙවෙතස්ස විපාකං පටිසංවෙදිස්සසී’ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පාපකම්මං - PTS. මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, යමරජ ප්‍රථම දේවදූතයා අනුයෝගවතට නංවා ලබ්ධියෙහි පිහිටුවා කරුණු ගන්වා, කරුණු විචාරා, දෙවන දේවදූතයා අනුයෝගවතට නංවා විචාරයි, කරුණු ගන්වයි, කරුණු විචාරායි: ‘එම්බා පුරුෂය, තෝ මිනිසුන් අතුරෙහි පහළ වූ දෙවන දේවදූතයා නො දිටිහි ද?’ හේ මෙසේ කියි: ‘වහන්ස, නො දිටිමි’යි. මහණෙනි, යමරජ තුලුන්ට මෙසේ කියයි: ‘එම්බා පුරුෂය, තෝ මිනිසුන් අතුරෙහි රෝගාතුර වූ දුකට පත් වූ හෝ දැඩි ගිලන් වූ සිය මලමූයෙහි ගැළී හෝනා මෙරමා විසින් නගාසිටුවනු ලබන්නා වූ මෙරමා විසින් හොවනු ලබන්නා වූ ස්ත්‍රියක හෝ පුරුෂයකු, නොදිටිහි ද?’ හේ මෙසේ කියයි: ‘වහන්ස, දිටිමි.’",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "මහණෙනි, යමරජ තුලුන්ට මෙසේ කියයි: ‘එම්බා පුරුෂය, මහලු වූ නුවණැත්තා වූ ම ඒ තට මේ සිත නො වී ද?’ ‘මම ද ව්‍යාධිය ස්වභාව කොට ඇත්තෙම්, ව්‍යාධිය නො ඉක්මවූයෙම් වෙමි. එබැවින් මම කයින් වචසින් මනසින් කුසල් දහම් කෙරෙමි’යි. හේ මෙසේ කියයි: ‘වහන්ස, නො හැකිවීමි. වහන්ස, පමාවීමි’යී."
                    },
                    {
                        "text": "මහණෙනි, යමරජ තුලුන්ට මෙසේ කියයි: ‘එම්බා පුරුෂය, පමාවත්වන බැවින් කයින් වචසින් මනසින් කුසල් නො කෙළෙහි ය. එම්බා පුරුෂය, ඒ පමාවූවකුට කරන්නාක් සෙයින් තට ද කරන්නාහ. මේ පව්කම් වනාහි මව විසිනිදු නො ම කරණ ලද. පියා විසිනිදු නො ම කරණ ලද. බෑයා විසිනිදු නො ම කරණ ලද. බුන් විසිනිදු නො ම කරණ ලද. යහළුවන් විසිනිදු නො ම කරණ ලද. නෑ සහලේනෑයන් විසිනිදු නො ම කරණ ලද. දෙවියන් විසිනිදු නො ම කරණ ලද. මහණ බමුණන් විසිනිදු නො ම කරණ ලද. වැලිදු තා විසින් ම මේ පාපකර්‍මය කරණ ලදී. මේ පාපකර්‍මයාගේ විපාක තෝ ම විඳුනෙහිය’යී.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යමරජ දෙවන දේවදූතයා අනුයෝගවතට නංවා කරුණු ගන්වා, කරුණු විචාරා, තෙවන දේවදූතයා අනුයෝගවතට නංවා විචාරයි, කරුණු ගන්වයි, කරුණු විචාරායි: ‘එම්බා පුරුෂය, තෝ මිනිසුන් අතුරෙහි පහළ වූ තෙවන දේවදූතයා නොදිටිහිදැ’ යි. හේ මෙසේ කියයි: ‘වහන්ස, නොදිටිමි’යි. මහණෙනි, යමරජ තුලුන්ට මෙසේ කියයි: ‘එම්බා පුරුෂය, තෝ මිනිසුන් අතුරෙහි මළගිය එක් දවසක් ඇත්තා වූ හෝ මළගිය දෙදවසක් ඇත්තා වූ හෝ මළගිය තෙදිනක් ඇත්තා වූ හෝ ඉදිමුනු වෙසෙසින් නිල්වන් වූ පූයා වෑහෙන ස්ත්‍රියක හෝ පුරුෂයකු, නොදිටිහි දැ’යි. හේ මෙසේ කියයි: ‘වහන්ස, දිටිමි’. මහණෙනි, යමරජ තුලුන්ට මෙසේ කියයි. ‘එම්බා පුරුෂය, මහලු වූ නුවණැත්තා වූ ම තට මේ සිත නො වී ද?’ ‘මම ද මරණය නො ඉක්මවූයෙම්, මරණය ස්වභාව කොට ඇත්තෙම් වෙමි. එබැවින් මම කයින් වචසින් මනසින් කුසල් දහම් කෙරෙමි’යි. හෙතෙම මෙසේ කියයි: ‘වහන්ස, නො හැකිවීමි. වහන්ස, පමාවීමි’. මහණෙනි, යමරජ තුලුන්ට මෙසේ කියයි: ‘එම්බා පුරුෂය, පමාවත්වන බැවින් කයින් වචසින් මනසින් කුසල් දහම් නො කෙළෙහි ය. එම්බා පුරුෂය, ඒ පමාවූවහුට කරන්නාක් සෙයින් තට ද කරන්නාහ. ඒ මේ පාපකර්‍මය වනාහි මව විසිනිදු නොකරණ ලදී. පියා විසිනිදු නො කරණ ලදී. බෑයා විසිනිදු නො කරණ ලදී. ුන් විසිනිදු නො කරණ ලදී. සගයහළුවන් විසිනිදු නො කරණ ලදී. නෑ සහලේනෑයන් විසිනිදු නො කරණ ලදී. දෙවියන් විසිනිදු නො කරණ ලදී. මහණ බමුණන් විසිනිදු නො කරණ ලදී. වැලිදු තා විසින් ම මේ පාපකර්‍මය කරණ ලදී. තෝ ම මේ පාපකර්‍මයාගේ විපාක විඳුනෙහිය’ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 258,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තමෙනං භික්ඛවෙ යමො රාජා තතියං දෙවදූතං සමනුයුඤ්ජිත්වා සමනුගාහිත්වා සමනුභාසිත්වා තුණ්හී හොති. තමෙනං භික්ඛවෙ නිරයපාලා පඤ්චවිධබන්ධනං නාම කාරණං කරොන්ති. තත්තං අයොඛිලං හත්ථෙ ගමෙන්ති. තත්තං අයොඛිලං දුතියස්මිං හත්ථෙ ගමෙන්ති. තත්තං අයොඛිලං පාදෙ ගමෙන්ති. තත්තං අයොඛිලං දුතියස්මිං පාදෙ ගමෙන්ති. තත්තං අයොඛිලං මජ්ඣෙ උරස්මිං ගමෙන්ති. සො තත්ථ දුක්ඛා තිබ්බා{1} කටුකා වෙදනා වෙදියති. න ච තාව කාලං කරොති, යාව න තං පාපං කම්මං{2} බ්යන්තී හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තමෙනං භික්ඛවෙ නිරයපාලා සංවෙසෙත්වා{3} කුඨාරීහි තච්ඡන්ති. සො තත්ථ දුක්ඛා තිබ්බා{1} ඛරා කටුකා වෙදනා වෙදියති, න ච තාව කාලං කරොති, යාව න තං පාපං කම්මං බ්යන්තී හොති. තමෙනං භික්ඛවෙ නිරයපාලා උද්ධපාදං{4} අධොසිරං ඨපෙත්වා{5} වාසීහි තච්ඡන්ති -පෙ- තමෙනං භික්ඛවෙ නිරයපාලා රථෙ යොජෙත්වා ආදිත්තාය භූමියා සම්පජ්ජලිතාය සජොතිභූතාය {6}සාරෙන්තිපි පච්චාසාරෙන්තිපි -පෙ- තමෙනං භික්ඛවෙ නිරයපාලා මහන්තං අඞ්ගාරපබ්බතං ආදිත්තං සම්පජ්ජලිතං සජොතිභූතං ආරොපෙන්තිපි ඔරොපෙන්තිපි. තමෙනං භික්ඛවෙ නිරයපාලා උද්ධපාදං{4} අධොසිරං ගහෙත්වා තත්තාය ලොහකුම්භියා පක්ඛිපන්ති, ආදිත්තාය සම්පජ්ජලිතාය සජොතිභූතාය. සො තත්ථ ඵෙණුද්දෙහකං පච්චති.{7} සො තත්ථ ඵෙණුද්දෙහකං පච්චමානො සකිම්පි උද්ධං ගච්ඡති, සකිම්පි අධො ගච්ඡති, සකිම්පි තිරියං ගච්ඡති. සො තත්ථ දුක්ඛා තිබ්බා කටුකා වෙදනා වෙදියති, න ච තාව කාලං කරොති, යාව න තං පාපං කම්මං බ්යන්තී හොති. තමෙනං භික්ඛවෙ නිරයපාලා මහානිරයෙ පක්ඛිපන්ති. සො ඛො පන භික්ඛවෙ මහානිරයො –:"
                    },
                    {
                        "type": "gatha",
                        "text": "26. චතුක්කණ්ණො චතුද්වාරො විභත්තො භාගසො මිතො,\nඅයොපාකාරපරියන්තො අයසා පටිකුජ්ජිතො.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "27. තස්ස අයොමයා භූමි ජලිතා තෙජසා යුතා,\nසමන්තා යොජනසතං ඵරිත්වා තිට්ඨති සබ්බදා’ති.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "භූතපුබ්බං භික්ඛවෙ යමස්ස රඤ්ඤො එතදහොසි: ‘යෙ කිර භො, ලොකෙ පාපකානි කම්මානි කරොන්ති, තෙ එවරූපා විවිධා කම්මකාරණා කරීයන්ති. අහො වතාහං මනුස්සත්තං ලභෙය්යං, තථාගතො ච ලොකෙ උප්පජ්ජෙය්ය අරහං සම්මාසම්බුද්ධො, තං චාහං භගවන්තං පයිරුපාසෙය්යං. සො ච මෙ භගවා ධම්මං දෙසෙය්ය, තස්ස චාහං භගවතො ධම්මං ආජානෙය්යන්ති. තං ඛො පනාහං භික්ඛවෙ න අඤ්ඤස්ස සමණස්ස වා බ්රාහ්මණස්ස වා සුත්වා එවං වදාමි. අපි ච ඛො භික්ඛවෙ යදෙව මෙ සාමඤ්ඤාතං සාමං දිට්ඨං සාමං විදිතං, තදෙවාහං වදාමීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. තිප්පා - සීමු. ස්යා. තිප්පා - ස්යා, තිබ්බාඛරා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. පාපකම්මං - මඡසං. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. සංකඩ්ඪිත්වා කුඨාරීහි තච්ඡෙන්නි - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. උද්ධං පාදං - PTS. මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. ගහෙත්වා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "6. සඤ්ජොතිභූතාය - ස්යා. කං."
                    },
                    {
                        "type": "footnote",
                        "text": "7. මඡසං පොත්ථකෙ අයං පාඨො න දිස්සතෙ."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, යමරජ තෙල තෙවන දේවදූතයා අනුයෝගවතට නංවා විචාරා කරුණු ගන්වා කරුණු කියා තුෂ්ණිම්භූත වෙයි. මහණෙනි, යමපල්ලෝ ඔහුට පඤ්චවිධබන්‍ධන නම් කම් කටොලු කරත්: රත්කළ යහුලක් දකුණතෙහි ගසත්. රත්කළ යහුලක් දෙවෙනි (වම්) අතෙහි ගසත්. රත්කළ යහුලක් දකුණු පයෙහි ගසත්. රත්කළ යහුලක් දෙවෙනි (වම්) පාහි ගසත්. රත්කළ යහුලක් ලමැද ගසත්. හේ එහි දුක් වූ තීව්‍ර වූ කටුක වූ වේදනා විඳුනේයි. ඒ පාපකර්‍මය නොගෙවෙනා තාක් හේ කලුරිය නො කරයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යමපල්හු තුලුන් හොවාපියා කෙටේරියෙන් සසිත්. හේ එහි දුක් වූ තීව්‍ර වූ කටුක වූ වේදනා විඳුනේයි. ඒ පාපකර්‍මය නොගෙවෙනා තාක් හේ කලුරිය නො කරයි. යමපල්හු තුලුන් පා උඩුකුරු කොට හිස යටිකුරු කොට තබා වෑයෙන් සසිත් ... මහණෙනි, යමපල්හු තුලුන් රියෙහි යොදා ගිනි ගෙණ දිලියෙන ගිනිදැල් සහිත බිම්හි ඔබ මොබ ඇවිදුවත් ... මහණෙනි, යමපල්හු තුලුන් ගිනි ගෙණ දිලියෙන ගිනිදැල් සහිත මහඅඟුරුපව්වකට නංවත් , බස්වත් ... මහණෙනි යමපල්හු තුලුන් පා උඩුකුරු කොට හිස යටිකුරු කොට ගෙණ රත් වූ ඇවිලගත් ගිනිදැල් සහිත ලෝකුඹුයෙහි බහත්. හේ එහි පෙණ බඳු දේහ ඇතිව පැසෙයි. හේ එහි පෙණ බඳු දේහ ඇතිව පැසෙනුයේ වරක් උඩට මතු වෙයි. වරක් යටට බසියි. වරක් සරසට ද යෙයි. හේ එහි දුක් වූ තීව්‍ර වූ කටුක වූ වේදනා විඳියි. ඒ පව්කම් නො ගෙවෙනා තාක් කලුරිය නො කරයි. යමපල්හු තුලුන් ගෙණ මහානිරයෙහි බහත්. මහණෙනි, ඒ මහානිරය වනාහි:",
                        "type": "paragraph"
                    },
                    {
                        "text": "26. සිවුකොන් ඇත්තේ ය, සිවුදොරටු ඇත්තේ ය, කොටස් කොට මැන බෙදන ලද්දේ ය, යපවුරින් පිරිසිඳුනා ලද්දේ ය, යපටින් වසන ලද්දේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "27. එහි බිම යමුවා ය, දිලින, ගිනිදැලින් මුසු වෙයි. හාත්පස යොදුන් සියක් පුරා හැමකල්හි පැතිර සිටුනේය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, වූ විරීයෙකි: යමරජුට මෙබඳු සිතෙක් විය: ‘භවත්නි, ලොව්හි යම් කෙනෙක් පව්කම් කෙරෙත් ද, ඔවුහු මෙබඳු වූ නන් කම්කටොලු කරවනු ලබත්. අහෝ! ඉදින් මම මිනිසත්බවක් ලබම් නම්, අර්‍හත් වූ සම්‍යක් සම්බුද්ධ වූ තථාගතයන් ලොව උපදින සේක් නම්, මම ද ඒ භාග්‍යවතුන් වහන්සේ ඇසුරු කරන්නෙම් නම්, ඒ භාග්‍යවතුන් වහන්සේ ද මට දහම් දෙසන සේක් නම්, ඒ භාග්‍යවතුන් වහන්සේගේ ධර්‍මය මම දැනගන්නෙම් නම්, ඉතා මැනැවැ’යි. මහණෙනි, ඒ වනාහි මම අන් මහණකුගෙන් හෝ බමුණකුගෙන් හෝ අසා මෙසේ නො කියමි. මහණෙනි, වැලිදු යමක් මා විසින් තමා විසින් ම දැනගන්නා ලද ද, තමා ම දක්නා ලද ද, තමා විසින් ම ප්‍රකට කොට දැනගන්නා ලදද, __එය මම ම__{1} කියමි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. “එයම මම” යැයි යෙදිය යුතු සේ පෙනේ."
                    }
                ]
            }
        },
        {
            "pageNum": 260,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "28. චොදිතා දෙවදූතෙහි යෙ පමජ්ජන්ති මානවා,\nතෙ දීඝරත්තං සොචන්ති හීනකායූපගා නරා.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "29. යෙ ච ඛො දෙවදූතෙහි සන්තො සප්පුරිසා ඉධ,\nචොදිතා නප්පමජ්ජන්ති අරියධම්මෙ කුදාචනං.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "30. උපාදානෙ භයං දිස්වා ජාතිමරණසම්භවෙ,\nඅනුපාදා විමුච්චන්ති ජාතිමරණසඞ්ඛයෙ.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "31. තෙ ඛොප්පමත්තා{1} සුඛිතා{2} දිට්ඨධම්මාභිනිබ්බුතා,\nසබ්බවෙරභයාතීතා සබ්බදුක්ඛං උපච්චගුන්ති.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 7.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "37. අට්ඨමියං භික්ඛවෙ පක්ඛස්ස චතුන්නං මහාරාජානං අමච්චා පාරිසජ්ජා ඉමං ලොකං අනුවිචරන්ති: ‘කච්චි බහූ මනුස්සා මනුස්සෙසු මත්තෙය්යා පෙත්තෙය්යා සාමඤ්ඤා බ්රහ්මඤ්ඤා කුලෙජෙට්ඨාපචායිනො උපොසථං උපවසන්ති, පටිජාගරන්ති{3}, පුඤ්ඤානි කරොන්තීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "චාතුද්දසියං{*} භික්ඛවෙ පක්ඛස්ස චතුන්නං මහාරාජානං පුත්තා ඉමං ලොකං අනුවිචරන්ති, කච්චි බහූ මනුස්සා මනුස්සෙසු මත්තෙය්යා පෙත්තෙය්යා සාමඤ්ඤා බ්රහ්මඤ්ඤා කුලෙජෙට්ඨාපචායිනො උපොසථං උපවසන්ති, පටිජාගරන්ති{3} පුඤ්ඤානි කරොන්තී’ති. තදහු භික්ඛවෙ උපොසථෙ පණ්ණරසෙ චත්තාරො මහාරාජා{4} සාමඤ්ඤෙව ඉමං ලොකං අනුවිචරන්ති: ‘කච්චි බහූ මනුස්සා මනුස්සෙසු මත්තෙය්යා පෙත්තෙය්යා සාමඤ්ඤා බ්රහ්මඤ්ඤා කුලෙජෙට්ඨාපචායිනො උපොසථං උපවසන්ති, පටිජාගරන්ති පුඤ්ඤානි කරොන්තී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සචෙ භික්ඛවෙ අප්පකා හොන්ති මනුස්සා මනුස්සෙසු මත්තෙය්යා පෙත්තෙය්යා සාමඤ්ඤා බ්රහ්මඤ්ඤා කුලෙජෙට්ඨාපචායිනො උපොසථං උපවසන්ති, පටිජාගරන්ති, පුඤ්ඤානි කරොන්ති. තමෙනං භික්ඛවෙ චත්තාරො මහාරාජා{4} දෙවානං තාවතිංසානං සුධම්මායං සභායං{†} සන්නිසින්නානං සන්නිපතිතානං ආරොචෙන්ති: අප්පකා ඛො මාරිසා මනුස්සා මනුස්සෙසු මත්තෙය්යා පෙත්තෙය්යා සාමඤ්ඤා බ්රහ්මඤ්ඤා කුලෙජෙට්ඨාපචායිනො උපොසථං උපවසන්ති, පටිජාගරන්ති, පුඤ්ඤානි කරොන්තී’ති. තෙන{5} භික්ඛවෙ දෙවා තාවතිංසා අනත්තමනා හොන්ති: දිබ්බා වත භො කායා පරිහායිස්සන්ති, පරිපූරිස්සන්ති අසුරා{6} කායාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සචෙ පන භික්ඛවෙ බහූ හොන්ති මනුස්සා මනුස්සෙසු මත්තෙය්යා පෙත්තෙය්යා සාමඤ්ඤා බ්රහ්මඤ්ඤා කුලෙජෙට්ඨාපචායිනො උපොසථං උපවසන්ති, පටිජාගරන්ති, පුඤ්ඤානි කරොන්ති. තමෙනං භික්ඛවෙ චත්තාරො මහාරාජා දෙවානං තාවතිංසානං සුධම්මායං සභායං සන්නිසින්නානං සන්නිපතිතානං ආරොචෙන්ති: ‘බහූ ඛො මාරිසා මනුස්සා මනුස්සෙසු මත්තෙය්යා පෙත්තෙය්යා සාමඤ්ඤා බ්රහ්මඤ්ඤා කුලෙජෙට්ඨාපචායිනො උපොසථං උපවසන්ති, පටිජාගරන්ති, පුඤ්ඤානි කරොන්තී’ති. තෙන භික්ඛවෙ දෙවා තාවතිංසා අත්තමනා හොන්ති: ‘දිබ්බා වත භො කායා පරිපූරිස්සන්ති, පරිහායිස්සන්ති අසුරා කායාති.{6}"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. තෙ අප්පමත්තා - මඡසං. තෙ ඛෙමප්පත්තා - PTS. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සුඛිනො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. පටිජාගරොන්ති - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "*. චාතුද්දසිං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. මහාරාජානො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "†. සුධම්මාය සභාය - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. තෙන ඛො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "6. අසුරකායා - මඡසං. PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "28. දේවදූතයන් විසින් මෙහෙයන ලද යම් මිනිස් කෙනෙක් පමා වෙත් ද, හීන වූ අත්බැව් ලැබූ ඒ මිනිස්සු බොහෝ කලක් සොවිත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "29. මෙ ලොව්හි දේවදූතයන් විසින් මෙහෙයන ලද යම් ශාන්ත සත්පුරුෂ කෙනක් වෙත් ද, (ඔහු) ආර්‍ය්‍යධර්‍මයෙහි කිසි කලෙකත් පමා නො වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "30. ජාති මරණ දෙකට කරුණු වූ (පඤ්ච) උපාදානයෙහි බිය දැක (ආත්ම ආත්මීය වශයෙන්) සතර උපාදානයන් නො ගෙණ ජාතිමරණයන්ගේ ක්‍ෂය සඞ්ඛ්‍යාත නිර්‍වාණය නිමිති කොට මිදෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "31. මෙ අත්බව්හි ම කෙලෙස් පිරිනිවීමෙන් නිවුනු නොපමා වූ (එහෙයින් ම) සුවපත් වූ ඔහු සියලු වෙරභය ඉක්මවූවාහු සියලු දුක් ඉක්ම ගියාහුය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 7",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "37. මහණෙනි, අඩමසැ අටවක්හි සිවුමහරජුන්ගේ පිරිසට අයත් ඇමතියෝ ‘කිමෙක් ද? මිනිස් ලොව්හි බොහෝ මිනිස්සු මවුන් පුදනුවාහු ද, පියන් පුදනුවාහු ද, මහණුන් පුදනුවාහු ද, බමුණන් පුදනුවාහු ද, කුලදෙටුවන් පුදනුවාහු ද, පෙහෙවස් වෙසෙත් ද, පටිජාගර උපොසථය කෙරෙත් ද, පින් කෙරෙත් දැ’යි. මෙලොව සිසාරා ඇවිදිත්."
                    },
                    {
                        "text": "මහණෙනි, අඩමසැ තුදුස්වක්හි සිවුමහරජුන්ගේ පුත්‍රයෝ මේ ලෝකය වටාගෙණ ඇවිදිත්: ‘කිම, මිනිසුන් අතුරෙහි බොහෝ දෙනා මවුන් පුදනුවාහු ද, පියන් පුදනුවාහු ද, මහණුන් පුදන්නාහු ද, බමුණන් පුදන්නාහු ද, කුලදෙටුවන් පුදන්නාහු ද, පෙහෙවස් වෙසෙත් ද, පටිජාගර උපොසථය කෙරෙත් ද, පින් කෙරෙත් දැ’යි. මහණෙනි, ඒ පුරපසළොස්වක් පොහෝ දින සිවුමහරජවරු තුමූ ම මේ ලොව වටාගෙණ ඇවිදිත්. ‘කිම, මිනිසුන් අතුරෙහි බොහෝ දෙනා මවුන් පුදන්නාහු ද, පියන් පුදන්නාහු ද, මහණුන් පුදන්නාහු ද, බමුණන් පුදන්නාහු ද, කුලදෙටුවන් පුදන්නාහු ද, පෙහෙවස් වෙසෙත් ද, පටිජාගර උපොසථය කෙරෙත් ද, පින් කෙරෙත් දැ’යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඉදින් මිනිසුන් අතුරෙහි මවුන් පුදන පියන් පුදන මහණුන් පුදන බමුණන් පුදන කුලදෙටුවන් පුදන මිනිස්සු ස්වල්ප වෙත් ද, (එසේ ම) ස්වල්ප මනුෂ්‍ය කෙනෙක් පෙහෙවස් වෙසෙත් ද, පටිජාගර උපොසථය කෙරෙත් ද, පින් කෙරෙත් ද, මහණෙනි, සතරවරම් මහරජවරු සුධර්‍මාසභායෙහි රැස්ව හුන් තව්තිසාවැසි දෙවියන්ට මෙකරුණ සැළ කරත්: ‘නිදුකානෙනි, මිනිස්ලොව්හි ස්වල්ප මනුෂ්‍ය කෙනෙක් මවුන්ට හිතවත්හ. පියනට හිතවත්හ. මහණුනට හිතවත්හ. බමුණනට හිතවත්හ. කුලදෙටුවන් පුදන්නාහ. පෙහෙවස් කරන්නාහ. පටිජාගර උපොසථය කරන්නාහ. පින් කරන්නාහ’ යි. මහණෙනි, එයින් තව්තිසා වැසි දෙවියෝ ‘අහහ’ භවත්නි, දෙව්පිරිස්හු පිරිහෙන්නාහ, අසුර පිරිස්හු පිරෙන්නාහ’ යි නො සතුටු සිත් ඇත්තාහු වෙති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඉදින් මිනිස්ලොව බොහෝ මනුෂ්‍යයෝ මවුනට හිතවත් නම්, පියනට හිතවත් නම්, මහණුනට හිතවත් නම්, බමුණනට හිතවත් නම්, කුලදෙටුවන් පුදත් නම්, පෙහෙවස් වෙසෙත් නම්, පටිජාගර උපොසථය කෙරෙත් නම්, පින් කෙරෙත් නම්, මහණෙනි, සිවුවරම් මහරජවරු සුධර්‍මාසභායෙහි රැස්ව හුන් තව්තිසාවැසි දෙවියනට මෙසේ සැළ කරත්: ‘නිදුකානනි, මිනිසුන් අතුරෙහි බොහෝ මිනිස්සු මවුනට හිතවත්හ. පියනට හිතවත්හ. මහණුනට හිතවත්හ. බමුණනට හිතවත්හ. කුලදෙටුවන් පුදන්නාහ. පෙහෙවස් වසන්නාහ. පටිජාගර උපොසථය වසන්නාහ. පින් කරන්නාහ’ යි. මහණෙනි, එයින් තව්තිසා වැසි දෙවියෝ ‘භවත්නි, ප්‍රීතියෙක! දෙව්පිරිස්හු පිරෙන්නාහ, අසුරපිරිස්හු පිරිහෙන්නාහ’ යි තුටුසිත් ඇත්තාහු වෙත්.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 262,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 8.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "38. භූතපුබ්බං භික්ඛවෙ සක්කො දෙවානමින්දො දෙවෙ තාවතිංසෙ අනුනයමානො{1} තායං වෙලායං ඉමං ගාථං අභාසි:"
                    },
                    {
                        "type": "gatha",
                        "text": "32. චාතුද්දසිං පඤ්චදසිං{2} යා ච පක්ඛස්ස අට්ඨමී{3}\nපාටිහාරියපක්ඛං ච අට්ඨඞ්ගසුසමාගතං,\nඋපොසථං උපවසෙය්ය යො පස්ස{4} මාදිසො නරො’ති.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සා ඛො පනෙසා භික්ඛවෙ සක්කෙන දෙවානමින්දෙන ගාථා දුග්ගීතා, න සුගීතා, දුබ්භාසිතා, න සුභාසිතා. තං කිස්ස හෙතු: සක්කො හි භික්ඛවෙ දෙවානමින්දො අවීතරාගො අවීතදොසො අවීතමොහො. යො ච ඛො සො භික්ඛවෙ භික්ඛු අරහං ඛීණාසවො වුසිතවා{*} කතකරණීයො ඔහිතභාරො අනුප්පත්තසදත්ථො පරික්ඛීණභවසඤ්ඤොජනො සම්මදඤ්ඤා විමුත්තො, තස්ස ඛො එතං භික්ඛවෙ භික්ඛුනො කල්ලං වචනාය :"
                    },
                    {
                        "type": "gatha",
                        "text": "33. චාතුද්දසිං{2} පඤ්චදසිං යා ච පක්ඛස්ස{3} අට්ඨමී,\nපාටිහාරියපක්ඛං ච අට්ඨඞ්ගසුසමාගතං\nඋපොසථං උපවසෙය්ය යොපස්ස{4} මාදිසො නරො’ති.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "තං කිස්ස හෙතු? සො හි භික්ඛවෙ - භික්ඛු වීතරාගො වීතදොසො වීතමොහොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "භූතපුබ්බං භික්ඛවෙ සක්කො දෙවානමින්දො දෙවෙ තාවතිංසෙ අනුනයමානො තායං වෙලායං ඉමං ගාථං අභාසි:–"
                    },
                    {
                        "type": "gatha",
                        "text": "34. චාතුද්දසිං{2} පඤ්චදසිං යා ච පක්ඛස්ස අට්ඨමී,{3}\nපාටිහාරියපක්ඛං ච අට්ඨඞ්ගසුසමාගතං \nඋපොසථං උපවසෙය්ය යොපස්ස{4} මාදිසො නරො’ති.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සා ඛො පනෙසා භික්ඛවෙ සක්කෙන දෙවානමින්දෙන ගාථා දුග්ගීතා, න සුගීතා, දුබ්භාසිතා, න සුභාසිතා. තං කිස්ස හෙතු? සක්කො හි භික්ඛවෙ දෙවානමින්දො අපරිමුත්තො ජාතියා ජරාමරණෙන{5} සොකෙහි පරිදෙවෙහි දුක්ඛෙහි දොමනස්සෙහි උපායාසෙහි, අපරිමුත්තො දුක්ඛස්මාති වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "යො ච ඛො සො භික්ඛවෙ භික්ඛු අරහං ඛීණාසවො වුසිතවා කතකරණීයො ඔහිතභාරො අනුප්පත්තසදත්ථො පරික්ඛීණභවසඤ්ඤොජනො සම්මදඤ්ඤා විමුත්තො, තස්ස ඛො එතං භික්ඛවෙ භික්ඛුනො කල්ලං වචනාය:–"
                    },
                    {
                        "type": "gatha",
                        "text": "35. චාතුද්දසිං පඤ්චදසිං යා ච පක්ඛස්ස අට්ඨමී,\nපාටිහාරියපක්ඛං ච අට්ඨඞ්ගසුසමාගතං;\nඋපොසථං උපවසෙය්ය යොපස්ස මාදිසො නරො’ති.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "තං කිස්ස හෙතු? සො හි භික්ඛවෙ භික්ඛු පරිමුත්තො ජාතියා ජරාමරණෙන සොකෙහි පරිදෙවෙහි දුක්ඛෙහි දොමනස්සෙහි උපායාසෙහි පරිමුත්තො දුක්ඛස්මාති වදාමීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අනුසඤ්ඤායමානො - අට්ඨකථා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. චාතුද්දසී පඤ්චදසී - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. යාව පක්ඛස්ස අට්ඨමිං - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "4. යෙ, පිස්ස - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "*. බ්රහ්මචරියො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. ජරාය මරණෙන - PTS. මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 8",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "38. මහණෙනි, වූ විරීයෙකි: සක්දෙවිඳු තව්තිසා වැසි දෙවියන් ඇලුම් කරවමින් ඒ වෙලායෙහි මේ ගය කීය:"
                    },
                    {
                        "text": "32. ‘ඉදින් යම් මිනිසෙක් මා’ බඳු වන්නේ නම්, ඒ මිනිස් පක්‍ෂයෙහි තුදුස්වක්හි ද, පසළොස්වක්හි ද, අටවක්හි ද, ප්‍රාතිහාර්‍ය්‍ය පක්‍ෂයෙහි ද, අටඟින් යුත් පෙහෙවස් වසනේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සක්දෙවිඳු විසින් ඒ ගාථා වරදවා ගයන ලදු. මැනැවින් නො ගයන ලදු. වරදවා කියන ලදු. මැනැවින් නො කියන ලදු. ඒ කවරහෙයින යත්: සක්දෙවිඳු වනාහි පහ නො කළ රාග ඇත්තෙක. පහ නො කළ ද්වේෂ ඇත්තෙක. පහ නො කළ මෝහ ඇත්තෙක. මහණෙනි, ක්‍ෂය කළ ආස්‍රව ඇති, වැස නිම වූ මඟබඹසර ඇති, කරණ ලද සිවුමග කටයුතු ඇති, බහා තබන ලද කෙලෙස්බර ඇති, පැමිණි ස්වාර්ත්ථ ඇති, ක්‍ෂය කළ සසර බැඳුම් ඇති, මනාසේ දැන කෙලෙසුන් කෙරෙන් මිදුන යම් රහත් මහණෙක් වේ ද, ඒ මහණහු විසින් මෙය කියන්නට නිසි ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "33. ‘ඉදින් යම් මිනිසෙක් මා බඳු වන්නේ ද, ඒ මිනිස් පක්‍ෂ පිළිබඳ තුදුස්වක්හි ද, පසළොස්වක් හි ද, අටවක්හි ද, ප්‍රාතිහාර්‍ය්‍ය පක්‍ෂයෙහි ද, අටඟින් යුත් පෙහෙවස් වසනේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "කවර හෙයින යත්: මහණෙනි, යම් හෙයෙකින් ඒ මහණ පහ වූ රාග ඇත්තේ වේ ද, පහ වූ ද්වේෂ ඇත්තේ වේ ද, පහ වූ මෝහ ඇත්තේ වේ ද, එහෙයිනි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, වූ විරීයෙකි: සක්දෙවිඳු තව්තිසා වැසි දෙවියන් ඇලුම් කරවමින් ඒ වෙලායෙහි මේ ගය කීය:",
                        "type": "paragraph"
                    },
                    {
                        "text": "34. ඉදින් යම් මිනිසෙක් මා බඳු වන්නේ නම්, ඒ මිනිස් පක්‍ෂ පිළිබඳ තුදුස්වක්හි ද, පසළොස්වක් හි ද, අටවක්හි ද, ප්‍රාතිහාර්‍ය්‍යපක්‍ෂයෙහි ද, අටඟින් යුත් පෙහෙවස් වසනේය’යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සක්දෙවිඳු විසින් ඒ ගාථාව වරදවා ගයන ලදු. මැනැවින් නො ගයන ලදු, වරදවා කියන ලදු, මැනැවින් නො කියන ලදු. ඒ කවර හෙයින යත්: මහණෙනි, යම් හෙයෙකින් සක්දෙවිඳු ජාතියෙන් ද, ජරායෙන් හා මරණයෙන් ද, ශෝකයෙන් ද, වැලපීමෙන් ද, දුක්දොම්නසින් ද, දැඩි ආයාසයෙන් ද, හාත්පසින් නො මිදුනේ ද, එහෙයිනි. (හෙ තෙමේ) දුකින් නොමිදුනේ ය යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ක්‍ෂය කළ ආස්‍රව ඇති, වැස නිම වූ මඟබඹසර ඇති, කරණ ලද සිවුමග කටයුතු ඇති, බහා තැබූ කෙලෙස්බර ඇති, පැමිණි ස්වාර්ත්ථ ඇති, ක්‍ෂය කළ සසර බැඳුම් ඇති මනාසේ දැන කෙලෙසුන් ගෙන් මිදුනු යම් රහත් මහණෙක් වේ ද, ඒ මහණහු විසින් මෙය කියන්නට නිසි ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "35. ‘ඉදින් යම් මිනිසෙක් මා බඳු වන්නේ ද, ඒ මිනිස් පක්‍ෂය පිළිබඳ තුදුස්වක්හි ද, පසළොස්වක් හි ද, අටවක්හි ද, ප්‍රාතිහාර්‍ය්‍යපක්‍ෂයෙහි ද, අටඟින් යුත් පෙහෙවස් වසනේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඒ කවර හෙයින යත්: මහණෙනි, යම් හෙයෙකින් ඒ මහණ ජාතියෙන් ද, ජරාමරණයෙන් ද, ශෝකයෙන් ද, වැලපීමෙන් ද, කායිකදුකින් ද, දොම්නසින් ද, දැඩි ආයාසයෙන් ද, මිදුනේ ද, එහෙයිනි. (හෙ තෙමේ) දුකින් මිදුනේය යි කියමි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 264,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 9",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "39. සුඛුමාලො අහං භික්ඛවෙ පරමසුඛුමාලො. අච්චන්තසුඛුමාලො. මම සුදං භික්ඛවෙ පිතු නිවෙසනෙ පොක්ඛරණියො කාරිතා හොන්ති. එකත්ථ සුදං{*} උප්පලං පුප්ඵති,{1} එකත්ථ පදුමං, එකත්ථ පුණ්ඩරීකං, යාවදෙව මමත්ථාය. න ඛො පනස්සාහං භික්ඛවෙ අකාසිකං{†} චන්දනං ධාරෙමි. කාසිකං සු මෙ තං භික්ඛවෙ වෙඨනං හොති. කාසිකා කඤ්චුකා, කාසිකං නිවාසනං, කාසිකො උත්තරාසඞ්ගො. රත්තින්දිවං ඛො පනස්සු{2} මෙතං භික්ඛවෙ සෙතච්ඡත්තං ධාරීයති, මා නං ඵුසි සීතං වා උණ්හං වා රජො වා තිණං වා උස්සාවො වාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්ස මය්හං භික්ඛවෙ තයො පාසාදා අහෙසුං, එකො හෙමන්තිකො, එකො ගිම්හිකො, එකො වස්සිකො. සො ඛො අහං භික්ඛවෙ වස්සිකෙ පාසාදෙ වස්සිකෙ චත්තාරො මාසෙ නිප්පුරිසෙහි තූරියෙහි පරිචාරියමානො{3} න හෙට්ඨාපාසාදං ඔරොහාමි. යථා ඛො පන භික්ඛවෙ අඤ්ඤෙසං නිවෙසනෙසු{4} දාසකම්මකරපොරිසස්ස කණාජකං භොජනං දීයති බිලඞ්ගදුතියං, එවමෙවස්සු මෙ භික්ඛවෙ පිතු නිවෙසනෙ දාසකම්මකරපොරිසස්ස සාලිමංසොදනො දීයති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්ස මය්හං භික්ඛවෙ එවරූපාය ඉද්ධියා සමන්නාගතස්ස එවරූපෙන ච සුඛුමාලෙන එතදහොසි: ‘අස්සුතවා ඛො පුථුජ්ජනො අත්තනා ජරාධම්මො සමානො ජරං අනතීතො පරං ජිණ්ණං දිස්වා අට්ටීයති, හරායති, ජිගුච්ඡති, අත්තානඤ්ඤෙව අතියිත්වා.{5} අහම්පි ඛොම්හි ජරාධම්මො, ජරං අනතීතො. අහං චෙව ඛො පන ජරාධම්මො සමානො ජරං අනතීතො, පරං ජිණ්ණං දිස්වා අට්ටීයෙය්යං, හරායෙය්යං, ජිගුච්ඡෙය්යං, න මෙ තං අස්ස පතිරූපන්ති’. තස්ස මය්හං භික්ඛවෙ ඉති පටිසඤ්චික්ඛතො යො යොබ්බනෙ යොබ්බනමදො, සො සබ්බසො පහීයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අස්සුතවා ඛො පුථුජ්ජනො අත්තනා ව්යාධිධම්මො සමානො ව්යාධිං අනතීතො, පරං ව්යාධිතං දිස්වා අට්ටීයති, හරායති, ජිගුච්ඡති, අත්තානඤ්ඤෙව අතියිත්වා{5}, අහම්පි ඛොම්හි ව්යාධිධම්මො, ව්යාධිං අනතීතො, අහං චෙව ඛො පන ව්යාධිධම්මො සමානො ව්යාධිං අනතීතො, පරං ව්යාධිතං දිස්වා අට්ටීයෙය්යං හරායෙය්යං ජිගුච්ඡෙය්යං, න මෙ තං අස්ස පතිරූපන්ති’. තස්ස මය්හං භික්ඛවෙ ඉති පටිසඤ්චික්ඛතො යො ආරොග්‍යෙ ආරොග්යමදො, සො සබ්බසො පහීයි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "*. සුදං භික්ඛවෙ - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "1. වප්පති - ස්යා. මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "†. කාසිකං - ස්යා. කං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ඛො පන මෙ සුතං - මඡසං. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. පරිචාරයමානො - අට්ඨකථා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. නිවෙසනෙ - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. අතිසිත්වා - සීමු. මඡසං. PTS. ස්‍යා, සී 1."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 9",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "39. මහණෙනි, මම නිදුක්මි. අතිශයින් නිදුක්මි. සතතයෙන් නිදුක්මි. මහණෙනි, මාගේ පියනිවෙස්නෙහි පොකුණු කරවන ලද. එකෙක වනාහි නිලුපුල් පිපෙයි. එකෙක හෙළපියුම් පිපෙයි. එකෙක රත්පියුම් පිපෙයි. ඒ වනාහි හුදෙක් මා පිණිස ම ය. මහණෙනි, මම වනාහි නො සියුම් සඳුනක් නම් නො දරමි. මහණෙනි, මා හිස්වෙළුම ද සියුම් ම වෙයි. මාගේ පොරෝනා කස්ස ද සියුම් ම ය. හඳනා ද සියුම් වෙයි. උතුරුසළුව ද සියුම් වේ. මහණෙනි, රෑ දෙවෙහි ශීතය හෝ උෂ්ණය හෝ රජස හෝ තෘණ හෝ පිනි හෝ මුහු නහමක් පෙළාවා යි මට සේසතෙක් දරණු ලැබේ."
                    },
                    {
                        "text": "මහණෙනි, ඒ මට තුන් පහයෙක් වීය. එකෙක් හෙමන්තයට හිත ය, එකෙක් ගිම්හානයට හිත ය, එකෙක් වර්‍ෂාඍතුවට හිත ය. මහණෙනි, ඒ මම වැසිකලට නිසි පහයෙහි පිරිමින් නැති (ස්ත්‍රීන් කරණ) පසඟතුරුයෙන් පිනවනු ලබන්නෙම් යට පහයට නො බස්මි. මහණෙනි, යම්සේ අන්‍යයන්ගේ නිවෙස්හි දස්කම්කරු අතැවැසි පුරුෂයනට කාඩි දෙවන කොට ඇති නිවුඩුසාලේ බත දෙනු ලැබේ ද, මහණෙනි, එලෙසින් මාගේ පිය නිවෙස්නෙහි දස්කම්කරු යටත් පුරුෂයනට මස් සහිත ඇල්සහලේ බත් දෙනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙබඳු ඉදුහයෙන් ද මෙබඳු සියුමැලියෙන් ද යුත් ඒ මට මේ සිත විය: අශ්‍රැතවත් පෘථග්ජන ජරාව ස්වභාව කොට ඇත්තේ ම ජරාව නො ඉක්ම වූයේ ම ජරාවට පත් අනෙකකු දැක තමා තබා පීඩිත වෙයි. ලජ්ජිතවෙයි, පිළිකුල් උපදවයි. වැලි මම ද ජරාව ස්වභාව කොට ඇත්තෙම්. ජරාව නො ඉක්ම වූයෙම් වෙමි. මම ද ජරාව ස්වභාව කොට ඇත්තෙම් ජරාව නො ඉක්ම වූයෙම් ම ජරාවට පත් අනෙකකු දැක පීඩිත වන්නෙම් නම්, ලජ්ජිත වන්නෙම් නම්, පිළිකුල් උපදවන්නෙම් නම්, එය මට නිසි නො වන්නේ ම ය’. මහණෙනි, මෙසේ නුවණින් සලකා බලන්නා වූ ඒ මාගේ යොවුන් විය නිමිති කොට යම් යෞවනමදයෙක් වී ද, එය සර්‍වප්‍රකාරයෙන් ප්‍රහත විය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අශ්‍රැතවත් පෘථග්ජනයා තෙමේ ව්‍යාධිය ස්වභාව කොට ඇත්තේ ම ව්‍යාධිය නො ඉක්ම වූයේ ම ව්‍යාධියට පත් අනෙකකු දැක තමා තබා පීඩිත වෙයි, ලජ්ජිත වෙයි, පිළිකුල් උපදවයි. මම වැලිත් ව්‍යාධිය ස්වභාව කොට ඇත්තෙම්, ව්‍යාධිය නො ඉක්ම වූයෙම් වෙමි. මම ද ව්‍යාධිය ස්වභාව කොට ඇත්තෙම්, ව්‍යාධිය නො ඉක්ම වූයෙම් ම ව්‍යාධියට පත් අනෙකකු දැක පීඩිත වන්නෙම් නම්, ලජ්ජිත වන්නෙම් නම්, පිළිකුල් උපදවන්නෙම් නම්, ඒ මට තරම් නො වන්නේ ම ය’. මහණෙනි, මෙසේ නුවණින් සලකා බලන්නා වූ ඒ මාගේ ආරොග්‍යය නිමිති කොට යම් ආරොග්‍යමදයෙක් වී නම්, එය සර්‍වප්‍රකාරයෙන් ප්‍රහත විය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 266,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අස්සුතවා ඛො පුථුජ්ජනො අත්තනා මරණධම්මො සමානො මරණං අනතීතො පරං මතං දිස්වා අට්ටීයති හරායති ජිගුච්ඡති, අත්තානඤ්ඤෙව අතියිත්වා{1} අහම්පි ඛොම්හි මරණධම්මො මරණං අනතීතො, අහං චෙව ඛො පන මරණධම්මො සමානො මරණං අනතීතො පරං මතං දිස්වා අට්ටීයෙය්යං හරායෙය්යං ජිගුච්ඡෙය්යං, න මෙතං අස්ස පතිරූපන්ති’. තස්ස මය්හං භික්ඛවෙ ඉති පටිසඤ්චික්ඛතො යො ජීවිතෙ ජීවිතමදො, සො සබ්බසො පහීයීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තයො’මෙ භික්ඛවෙ මදා. කතමෙ තයො: යොබ්බනමදො, ආරොග්යමදො, ජීවිතමදො. යොබ්බනමදමත්තො වා භික්ඛවෙ අස්සුතවා පුථුජ්ජනො කායෙන දුච්චරිතං චරති, වාචාය දුච්චරිතං චරති, මනසා දුච්චරිතං චරති. සො කායෙන දුච්චරිතං චරිත්වා, වාචාය දුච්චරිතං චරිත්වා, මනසා දුච්චරිතං චරිත්වා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජති. ආරොග්යමදමත්තො වා භික්ඛවෙ අස්සුතවා පුථුජ්ජනො -පෙ- ජීවිතමදමත්තො වා භික්ඛවෙ අස්සුතවා පුථුජ්ජනො කායෙන දුච්චරිතං චරති, වාචාය දුච්චරිතං චරති, මනසා දුච්චරිතං චරති. සො කායෙන දුච්චරිතං චරිත්වා, වාචාය දුච්චරිතං චරිත්වා, මනසා දුච්චරිතං චරිත්වා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යොබ්බනමදමත්තො වා භික්ඛවෙ භික්ඛු සික්ඛං පච්චක්ඛාය හීනායාවත්තති. ආරොග්යමදමත්තො වා භික්ඛවෙ භික්ඛු සික්ඛං පච්චකාය හීනායාවත්තති, ජීවිතමදමත්තො වා භික්ඛවෙ භික්ඛු සික්ඛං පච්චක්ඛාය හීනායාවත්තතීති."
                    },
                    {
                        "type": "gatha",
                        "text": "36. ව්යාධිධම්මා ජරාධම්මා අථො මරණධම්මිනො,\nයථා ධම්මා තථා සන්තා ජිගුච්ඡන්ති පුථුජ්ජනා.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "37. අහං චෙතං ජිගුච්ඡෙය්යං එවං ධම්මෙසු පාණිසු,\nන මෙතං පතිරූපස්ස මම එවං විහාරිනො.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "38. සොහං එවං විහරන්තො ඤත්වා ධම්මං නිරූපධිං,\nආරොග්යෙ යොබ්බනස්මිං ච ජීවිතස්මිං ච යෙ මදා.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "39. සබ්බෙ මදෙ අභිභොස්මි නෙක්ඛම්මෙ{2} දට්ඨු ඛෙමතං,\nතස්ස මෙ අහු උස්සාහො නිබ්බානං අභිපස්සතො.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "40. නාහං භබ්බො එතරහි කාමානි පටිසෙවිතුං,\nඅනිවත්තී භවිස්සාමි බ්රහ්මචරියපරායනොති.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අතිසිත්වා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. නෙක්ඛම්මං දට්ඨු වෙමතො - ස්යා. සී 1. සීමු. PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "අශ්‍රැතවත් පෘථග්ජන තෙමේ මරණය ස්වභාව කොට ඇත්තේ ම මරණය නො ඉක්ම වූයේ ම මරණයට පත් අනෙකකු දැක තමා තබා පීඩිත වෙයි, ලජ්ජිත වෙයි, පිළිකුල් උපදවයි. ‘මම වැලිත් මරණය ස්වභාව කොට ඇත්තෙම් මරණය නො ඉක්ම වූයෙම් වෙමි. මම ද මරණය ස්වභාව කොට ඇත්තෙම් මරණය නො ඉක්ම වූයෙම් ම මළා වූ අනෙකක්හු දැක පීඩිත වන්නෙම් නම්, ලජ්ජිත වන්නෙම් නම්, පිළිකුල් උපදවන්නෙම් නම්, ඒ මට තරම් නො වන්නේ ය’. මහණෙනි, මෙසේ නුවණින් සලකා බලන්නා වූ ඒ මාගේ ජීවිතය නිමිති කොට යම් ජීවිතමදයෙක් වී නම්, එය සර්‍වප්‍රකාරයෙන් ප්‍රහත විය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ මද තුණෙකි. කවර තුණෙක යත්: යෞවනමදය, ආරොග්‍යමදය, ජීවිතමදයි. මහණෙනි, අශ්‍රැතවත් පෘථග්ජන යෞවන මදයෙන් මත්වූයේ කයින් දුසිරිත් කරයි, වචසින් දුසිරිත් කරයි, සිතින් දුසිරිත් කරයි. හේ කයින් දුසිරිත් කොට වචසින් දුසිරිත් කොට සිතින් දුසිරිත් කොට කාබුන් මරණින් මතු සුවයෙන් පහ වූ දුකට ගති වූ විවසව පතිත වන නිරයට පැමිණෙයි. මහණෙනි, ආරොග්‍යමදයෙන් මත් වූත් අශ්‍රැතවත් පෘථග්ජන ... ජීවිතමදයෙන් මත් වූත් අශ්‍රැතවත් පෘථග්ජන කයෙන් දුසිරිත් කරයි, වචසින් දුසිරිත් කරයි, මනසින් දුසිරිත් කරයි. කයින් දුසිරිත් කොට වචසින් දුසිරිත් කොට මනසින් දුසිරිත් කොට කාබුන් මරණින් මතු සැපයෙන් පහ වූ දුකට ගති වූ (පව්කළහු) විවසව පතිත වන නිරයට පැමිණෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යොවුන්මදින් මත් වූ ද මහණ ශික්‍ෂාව හැරපියා ගිහිබවට පෙරළෙයි. මහණෙනි, ආරොග්‍යමදයෙන් මත් වූ ද මහණ ශික්‍ෂාව හැරපියා ගිහිබවට පෙරළෙයි. ජීවිතමදයෙන් මත් වූ ද මහණ ශික්‍ෂාව හැරපියා ගිහිබවට පෙරළෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "36. ව්‍යාධිය ස්වභාව කොට ඇත්තා වූ ද ජරාව ස්වභාව කොට ඇත්තා වූ ද යලි මරණය ස්වභාව කොට ඇත්තා වූ ද පෘථග්ජනයෝ (ව්‍යාධිආදි) ස්වභාවයන් නො ඉක් මැ සිටියාහු ම (මෙරමා) පිළිකුල් කරත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "37. මම ද මෙබඳු ස්වභාව ඇති ප්‍රාණීන් කෙරෙහි පිළිකුල් කරන්නෙම් නම්, මෙබඳු ජුගුප්සාවිහරණ ඇති මට එය තරම් නො වන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "38. මම මෙසේ වසන්නෙම් නිර්‍වාණධර්‍මය දැන, ආරෝග්‍යයෙහි ද යෞවනයෙහි ද, ජීවිතයෙහි ද යම් මද කෙනෙක් වෙත් නම්,",
                        "type": "paragraph"
                    },
                    {
                        "text": "39. නිර්‍වාණයෙහි ක්‍ෂෙමභාවය දැක සියලු මදයන් මැඩලූ යෙම් වෙමි. නිවන දක්නා ඒ මට උත්සාහය විය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "40. දැන් මම කාමයන් සෙවුනට භව්‍ය නො වෙමි. නො නවත්නෙම් මඟබඹසර පිහිට කොට ඇත්තෙම් වෙමි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 268,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 10.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "40. තීණි’මානි භික්ඛවෙ ආධිපතෙය්යානි. කතමානි තීණි: අත්තාධිපතෙය්යං, ලොකාධිපතෙය්යං, ධම්මාධිපතෙය්යං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමං ච භික්ඛවෙ අත්තාධිපතෙය්යං: ඉධ භික්ඛවෙ භික්ඛු අරඤ්ඤගතො වා රුක්ඛමූලගතො වා සුඤ්ඤාගාරගතො වා ඉති පටිසඤ්චික්ඛති: ‘න ඛො පනාහං චීවරහෙතු අගාරස්මා අනගාරියං පබ්බජිතො. න පිණ්ඩපාතහෙතු -පෙ- න සෙනාසනහෙතු -පෙ- න ඉතිභවාභවහෙතු අගාරස්මා අනගාරියං පබ්බජිතො. අපි ච ඛොම්හි ඔතිණ්ණො ජාතියා ජරාමරණෙන{1} සොකෙහි පරිදෙවෙහි දුක්ඛෙහි දොමනස්සෙහි උපායාසෙහි, දුක්ඛොතිණ්ණො දුක්ඛපරෙතො. අප්පෙවනාම ඉමස්ස කෙවලස්ස දුක්ඛක්ඛන්ධස්ස අන්තකිරියා පඤ්ඤායෙථා’ති. අහඤ්චෙව ඛො පන යාදිසකෙ{2} වා කාමෙ ඔහාය අගාරස්මා අනගාරියං පබ්බජිතො, තාදිසකෙ වා කාමෙ පරියෙසෙය්යං, තතො වා පාපිට්ඨතරෙ, න මෙතං{3} අස්ස පතිරූපන්ති. සො ඉති පටිසඤ්චික්ඛති: ආරද්ධං ඛො පන මෙ විරියං භවිස්සති අසල්ලීනං, උපට්ඨිතා සති අසම්මුට්ඨා,{4} පස්සද්ධො කායො අසාරද්ධො, සමාහිතං චිත්තං එකග්ගන්ති’. සො අත්තානඤ්ඤෙව අධිපතිං කරිත්වා අකුසලං පජහති, කුසලං භාවෙති, සාවජ්ජං පජහති, අනවජ්ජං භාවෙති, සුද්ධං අත්තානං පරිහරති. ඉදං වුච්චති භික්ඛවෙ අත්තාධිපතෙය්යං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ ලොකාධිපතෙය්යං: ඉධ භික්ඛවෙ භික්ඛු අරඤ්ඤගතො වා රුක්ඛමූලගතො වා සුඤ්ඤාගාරගතො වා ඉති පටිසඤ්චික්ඛති: ‘න ඛො පනාහං චීවරහෙතු අගාරස්මා අනගාරියං පබ්බජිතො. න පිණ්ඩපාතහෙතු -පෙ- න සෙනාසනහෙතු -පෙ- න ඉතිභවාභවහෙතු අගාරස්මා අනගාරියං පබ්බජිතො. අපි ච ඛොම්හි ඔතිණ්ණො ජාතියා ජරාමරණෙන සොකෙහි පරිදෙවෙහි දුක්ඛෙහි දොමනස්සෙහි උපායාසෙහි, දුක්ඛොතිණ්ණො දුක්ඛපරෙතො. අප්පෙවනාම ඉමස්ස කෙවලස්ස දුක්ඛක්ඛන්ධස්ස අන්තකිරියා පඤ්ඤායෙථා’ති. අහං චෙව ඛො පන එවං පබ්බජිතො සමානො කාමවිතක්කං වා විතක්කෙය්යං, ව්යාපාදවිතක්කං වා විතක්කෙය්යං, විහිංසාවිතක්කං වා විතක්කෙය්යං, මහා ඛො පනායං ලොකසන්නිවාසො. මහන්තස්මිං ඛො පන ලොකසන්නිවාසෙ සන්ති සමණබ්රාහ්මණා ඉද්ධිමන්තො දිබ්බචක්ඛුකා පරචිත්තවිදුනො. තෙ දූරතොපි පස්සන්ති, ආසන්නාපි න දිස්සන්ති, චෙතසාපි චිත්තං පජානන්ති{5} තෙපි මං එවං ජානෙය්යුං : ‘පස්සථ භො ඉමං කුලපුත්තං සද්ධා අගාරස්මා අනගාරියං පබ්බජිතො සමානො වොකිණ්ණො විහරති පාපකෙහි අකුසලෙහි ධම්මෙහී’ති. දෙවතාපි ඛො සන්ති ඉද්ධිමන්තිනියො දිබ්බචක්ඛුකා පරචිත්තවිදුනියො. තා දූරතොපි පස්සන්ති, ආසන්නාපි න දිස්සන්ති, චෙතසාපි චිත්තං පජානන්ති{5} තාපි මං එවං ජානෙය්යුං: ‘පස්සථ භො ඉමං කුලපුත්තං සද්ධා අගාරස්මා අනගාරියං පබ්බජිතො සමානො වොකිණ්ණො විහරති පාපකෙහි අකුසලෙහි ධම්මෙහී’ති. සො ඉති පටිසඤ්චික්ඛති – ‘ආරද්ධං ඛො පන මෙ විිරියං භවිස්සති අසල්ලීනං, උපට්ඨිතා සති අසම්මුට්ඨා,{4} ‘පස්සද්ධො කායො අසාරද්ධො, සමාහිතං චිත්තං එකග්ගන්ති’. සො ලොකඤ්ඤෙව අධිපතිං කරිත්වා අකුසලං පජහති, කුසලං භාවෙති, සාවජ්ජං පජහති, අනවජ්ජං භාවෙති, සුද්ධං අත්තානං පරිහරති. ඉදං වුච්චති භික්ඛවෙ ලොකාධිපතෙය්යං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ජරාය මරණෙන - මඡසං,"
                    },
                    {
                        "type": "footnote",
                        "text": "2. යාදිසකෙ - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. න මෙතං පතිරූපන්ති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. අපම්මුට්ඨා - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "5. ජානන්ති - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 4. 10",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "40. මහණෙනි, මේ ආධිපත්‍යයයෝ තුන් දෙනෙකි. කවර තුන්දෙනෙක යත්: ආත්මාධිපත්‍යය, ලෝකාධිපත්‍යය, ධර්‍මාධිපත්‍යයි."
                    },
                    {
                        "text": "මහණෙනි, ආත්මාධිපත්‍යය කවරේය යත්: මහණෙනි, මෙ සස්නෙහි මහණ අරණ්‍යයට ගියේ හෝ වෘක්‍ෂමූලයට ගියේ හෝ ශුන්‍යාගාරයට ගියේ හෝ මෙසේ ප්‍රත්‍යවෙක්‍ෂා කරයි: ‘මම චීවරහේතුයෙන් ගිහිගෙන් නික්ම පැවිද්දට පැමිණියෙම් නො වෙමි. පිණ්ඩපාත හේතුයෙන් ගිහිගෙන් නික්ම පැවිද්දට පැමිණියෙම් නො වෙමි. සෙනසුන් හේතුයෙන් ගිහිගෙන් නික්ම පැවිද්දට පැමිණියෙම් නො වෙමි. මෙසේත් භවය, මෙසේත් භවයයි ඒ ඒ සම්පත්තිභව හේතුයෙන් ගිහිගෙන් නික්ම පැවිද්දට පැමිණියෙම් නො වෙමි. වැලිදු ජාතියෙන් හා ජරාමරණයෙන් හා ශෝකයෙන් හා වැලපීමෙන් හා දුක්දොම්නසින් හා දැඩි ආයාසයෙන් හා වැදගන්නා ලදුයෙම් වෙමි. දුකට බටුයෙම්, දුකින් පීඩිත වූයෙම් වෙමි. මෙහැම දුක්රැසෙහි අවසන් කිරීමෙක් පැණෙන්නේ නම් මනාමැනු යීී. තවද මම යම්බඳු වූ කාමයන් හැර ගිහිගෙන් නික්ම පැවිද්දට පැමිණියෙම් ද, එබඳු වූ කාමයන් හෝ එයට වඩා ඉතා ලාමක වූ කාමයන් හෝ සොයන්නෙම් නම්, එය මට තරම් නො වන්නේය යි. හෙතෙම මෙසේ නුවණින් සලකයි: ‘මවිසින් වීර්‍ය්‍යය සම්පූර්‍ණ කරණ ලද වෙයි. එහෙයින් ම නො හැකුළුනේ වෙයි. සිහිය එළඹ සිටියේ වෙයි. එහෙයින් ම නො මුළා වෙයි. කය සැහැල්ලු වෙයි. එහෙයින් ම සන්හුන් දරථ ඇත්තේ ය. සිත අරමුණෙහි පිහිටුවන ලද, එහෙයින් ම එකඟ වූයේ’ යි. හෙතෙම තමා ම අධිපති කොට අකුශලය දුරු කෙරෙයි, කුශලය වඩයි, සාවද්‍යය දුරලයි, අනවද්‍යය වඩයි, පිරිසිදු කොට ආත්මය පිරිවටයි. මෙය අත්තාධිපතෙය්‍ය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ලෝකාධිපත්‍යය කවරේය යත්: මහණෙනි, මෙ සස්නෙහි මහණ වනසෙනස්නට ගියේ හෝ රුක්මුලට ගියේ හෝ හිස් ගෙයකට ගියේ හෝ මෙසේ සිතයි: ‘මම වනාහි චීවර හේතුයෙන් ගිහිගෙන් නික්ම පැවිද්දට පැමිණියෙම් නො වෙමි, පිණ්ඩපාතය හේතු කොට ගෙණ ... සෙනසුන් හේතු කොට ගෙණ හෝ ... මෙසේ මෙසේත් භවය, මෙසේත් භව යයි ඒ ඒ සම්පත්තිභවය හේතුයෙන් ගිහිගෙන් නික්ම පැවිද්දට පැමිණියෙම් නො වෙමි. වැලිදු ජාතියෙන් ජරාමරණයෙන් ශෝකයෙන් වැලපීමෙන් දුක්දොම්නසින් දැඩි ආයාසයෙන් වැදගන්නා ලද්දෙම් දුකින් මඩන ලදුයෙම් දුකින් පීඩිත වූයෙම් වෙමි. මෙ හැම දුක්රැස අවසන් කිරීමෙක් පැණේ නම් මැනැවැ යි. මම ද, වැලිත් මෙසේ පැවිදි වූයෙම් ම කාමවිතර්‍කයක් හෝ කරන්නෙම් නම් , ව්‍යාපාදවිතර්‍කයක් හෝ කරන්නෙම් නම්, විහිංසාවිතර්‍කයක් හෝ කරන්නෙම් නම්, මේ ලෝකසන්නිවාසය වනාහි මහත් වූවෙකි. මහත් වූ ලෝකසන්නිවාසයෙහි ඍද්ධිමත් වූ දිවැස් ඇති පරසිත් දන්නා මහණ බමුණෝ ඇත. ඔවුහු දුරිනුදු දක්නාහ. සමීපස්ථවූවාහු නමුදු නො පැණෙන්නාහ. ඔවුන්ගේ සිතිනුදු මාගේ සිත දැන ගණිත්. තවද ඔවුහු මා මෙසේ දැනගන්නාහුය: ‘භවත්නි, මේ කුලපුත්හු බලව, සැදැහැයෙන් ගිහිගෙන් නික්ම පැවිද්දට වන්නේ ලාමක අකුශලධර්‍මයන්ගෙන් ගැවසී ගත්තේ වෙසෙයි. ඍද්ධිමත් වූ දිවැස් ඇත්තා වූ පරසිත් දන්නා වූ දෙවියෝ ද ඇත. ඔවුහු ද දුරින් (මා) දකිත්. සමීපස්ථවූවාහු ද (ඔවුහු) නො පැණෙත්. ඔවුහු තමන් සිතිනුදු මා සිත දැනගන්නාහ. ඔවුහු ද මා මෙසේ දැන ගන්නාහ: ‘භවත්නි, මේ කුලපුත්හු බලව, සැදැහැයෙන් ගිහිගෙන් නික්ම පැවිද්දට වන්නේ ම ලාමක අකුශලධර්‍මයන්ගෙන් ව්‍යාකීර්‍ණව වෙසේය’යි. හේ මෙසේ නුවණින් සලකයි: ‘මා විසින් වීර්‍ය්‍යය අරඹන ලද. එය නො හැකුළුනේ වෙයි. සිහිය එළඹ සිටියේය. එහෙයින් මුළා නුවූයේ ය. නාමකය සන්හිඳුනේ ය. එහෙයින් ම දරථ රහිත වෙයි. සිත සමාධිගත වූයේ ය. එහෙයින් ම එකඟ වේ ය’ යි. හේ ලෝකයා ම අධිපති කොට අකුශලය හැරලයි, කුශලය වඩයි, සාවද්‍යය දුරලයි, අනවද්‍යය වඩයි, පිරිසිදු කොට ආත්මය පිරිවටයි. මහණෙනි, මෙය ලෝකාධිපත්‍ය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 270,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ ධම්මාධිපතෙය්යං: ඉධ භික්ඛවෙ භික්ඛු අරඤ්ඤගතො වා රුක්ඛමූලගතො වා සුඤ්ඤාගාරගතො වා ඉති පටිසංචික්ඛති: ‘න ඛො පනාහං චීවරහෙතු අගාරස්මා අනගාරියං පබ්බජිතො. න පිණ්ඩපාතහෙතු -පෙ- න සෙනාසනහෙතු -පෙ- න ඉති භවාභවහෙතු අගාරස්මා අනගාරියං පබ්බජිතො. අපි ච ඛො’ම්හි ඔතිණ්ණො ජාතියා ජරාමරණෙන{1} සොකෙහි පරිදෙවෙහි දුක්ඛෙහි දොමනස්සෙහි උපායාසෙහි දුක්ඛොතිණ්ණො දුක්ඛපරෙතො. අප්පෙවනාම ඉමස්ස කෙවලස්ස දුක්ඛක්ඛන්ධස්ස අන්තකිරියා පඤ්ඤායෙථා’ති. ස්වාක්ඛාතො භගවතා ධම්මො සන්දිට්ඨිකො අකාලිකො එහිපස්සිකො ඔපනයිකො{2} පච්චත්තං වෙදිතබ්බො විඤ්ඤූහීති. සන්ති ඛො පන මෙ සබ්රහ්මචාරී ජානං පස්සං විහරන්ති. අහං චෙව ඛො පන එවං ස්වාක්ඛාතෙ ධම්මවිනයෙ පබ්බජිතො සමානො කුසීතො විහරෙය්යං පමත්තො, න මෙතං අස්ස පතිරූපන්ති’. සො ඉති පටිසඤ්චික්ඛති: ‘ආරද්ධං ඛො පන මෙ විරියං භවිස්සති අසල්ලීනං, උපට්ඨිතා සති අසම්මුට්ඨා, පස්සද්ධො කායො අසාරද්ධො, සමාහිතං චිත්තං එකග්ගන්ති’. සො ධම්මං යෙව අධිපතිං කරිත්වා අකුසලං පජහති, කුසලං භාවෙති, සාවජ්ජං පජහති, අනවජ්ජං භාවෙති, සුද්ධං අත්තානං පරිහරති. ඉදං වුච්චති භික්ඛවෙ ධම්මාධිපතෙය්යං. ඉමානි ඛො භික්ඛවෙ තීණි ආධිපතෙය්යානීති."
                    },
                    {
                        "type": "gatha",
                        "text": "41. නත්ථි ලොකෙ රහො නාම පාපකම්මං පකුබ්බතො,\nඅත්තා තෙ පුරිස ජානාති සච්චං වා යදි වා මුසා.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "42. කල්යාණං වත භො සක්ඛි අත්තානං අතිමඤ්ඤසි,\nයො සන්තං අත්තනි පාපං අත්තානං පරිගූහසි.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "43. පස්සන්ති දෙවා ච තථාගතා ච ලොකස්මිං බාලං විසමං චරන්තං,\nතස්මා හි අත්තාධිපකො{3} සතො චරෙ ලොකාධිපො ච නිපකො ච ඣායී.\nධම්මාධිපො ච අනුධම්මචාරී න හීයති සච්චපරක්කමො මුනි.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "44. පසය්හ මාරං අභිභුය්ය අන්තකං යො ච ඵුසී ජාතිඛයං පධානවා,\nස{4} තාදිසො ලොකවිදූ සුමෙධො සබ්බෙසු ධම්මෙසු අතම්මයො මුනීති.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "දෙවදූත වග්ගො චතුත්ථො.{*}",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ජරාය මරණෙන"
                    },
                    {
                        "type": "footnote",
                        "text": "2. ඔපනෙය්යකො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අත්තාධිපතෙය්යකො ච - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. සො"
                    },
                    {
                        "type": "footnote",
                        "text": "*. තස්සුද්දානං:- බ්රහ්ම ආනන්ද සාරිපුත්තො - නිදානං හත්ථකෙන ච දූතා දුවෙ ච රාජානො - සුඛුමාලාධිපතෙය්යෙන චාති - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, ධර්‍මාධිපත්‍යය කවරේය යත්: මහණෙනි, මෙ සස්නෙහි මහණ වන සෙනස්නට ගියේ හෝ රුක්මුලට ගියේ හෝ ශුන්‍යාගාරයට ගියේ හෝ මෙසේ සිතයි: ‘මම වනාහි චීවරහේතුයෙන් ගිහිගෙන් නික්ම පැවිද්දට පැමිණියෙම් නො වෙමි. පිණ්ඩපාත හේතුයෙන් ගිහිගෙන් නික්ම ... සෙනසුන් හේතුයෙන් ... ඉතිභවාභව හේතුයෙන් ගිහිගෙන් නික්ම පැවිද්දට පැමිණියෙම් නො වෙමි. වැලිදු ජාතියෙන් ජරාමරණයෙන් ශොකයෙන් වැළපීමෙන් දුක්දොම්නසින් දැඩි ආයාසයෙන් අවතීර්‍ණවෙමි. දුකට බටුයෙම් දුකින් මඩනා ලදුයෙම් වෙමි. මේ හැම දුක් රැස අවසන් කිරීමෙක් පැණේ නම්, ඉතා මැනව. භාග්‍යවතුන් වහන්සේ විසින් සාන්දෘෂ්ටිකවූ අකාලික වූ ‘එව බලව’ යන විධානයට නිසි වූ උපනයනයට නිසි වූ නුවණැත්තන් විසින් තමන් කෙරෙහි ලා දතයුතු වූ නවලෝකොත්තර ධර්‍මය මොනොවට ප්‍රකාශ කරණ ලදී. මට සමාන බඹසර ඇත්තාහු වෙත් ම ය. ඔහු __මා__{1} දන්නාහු දක්නාහු වෙසෙත්. මම ද වනාහි මෙසේ ස්වාඛ්‍යාත වූ ශාසනයෙහි පැවිදි වූයෙම් ම කුසීත ව ප්‍රමත්ත ව වෙසෙම් නම්, එය මට නිසි නොවන්නේය’ යි. හෙතෙම මෙසේ නුවණින් සලකයි: ‘මා විසින් වීර්‍ය්‍යය පුරන ලද වෙයි. එහෙයින් ම නො හැකුළුනේ වෙයි. සිහිය එළඹ සිටියේ ය. එහෙයින් ම නුමුළා වූයේ ය. නාමකය සන්හින. එහෙයින් ම දරථ රහිත වෙයි. සිත සමාධිගත වූයේ ය. එහෙයින් ම එකඟ වේය’ යි. හෙතෙම ධර්‍මය ම අධිපති කොට අකුශලය හැරලයි, කුශලය වඩයි, සාවද්‍යය හැරලයි, අනවද්‍යය වඩයි, පිරිසුදු වූ ආත්මය පරිහරණය කරයි. මහණෙනි, මෙය ධර්‍මාධිපත්‍ය යි කියනු ලැබේ. මහණෙනි, මේ වනාහි ආධිපත්‍යයෝ තුන් දෙන යහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "41. පව්කම් කරණුවහට ලොව්හි රහසෙක් නම් නැත. පුරුෂය, තාගේ ආත්මය (හිත) එය සැබවෙක් ද, නැතහොත් මුසායෙක් දැයි දන්නේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "42. යම් බඳු වූ තෝ තමා කෙරෙහි ඇත්තාවූ ම පව තමාට සඟවන්නෙහි ද? පින්වත, තමා ඉක්මවා හඟනෙහි ද? මැනවෙක් වනාහි ඒකානතයෙන් ප්‍රත්‍යක්‍ෂය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "43. යම් හෙයෙකින් ලොව්හි විෂම ලෙස හැසිරෙන්නා වූ බාලයා දෙවියෝ ද තථාගතවරු ද දකිත් ද එහෙයින් ම සිහි ඇත්තාවූ ද තන්වැසි නුවණැත්තා වූ ද ධ්‍යාන කරණ සුලුවූ ද ධර්‍මය අනුව හැසිරෙන්නා වූ ද සත්‍යපරාක්‍රම ඇත්තාවූ ද යම් මහණෙක්",
                        "type": "paragraph"
                    },
                    {
                        "text": "44. ප්‍රධන් වීර්‍ය්‍යය ඇත්තේ මාරයා මැඩ අන්තකයා අභිභවනය කොට රහත් බව ප්‍රත්‍යක්‍ෂ කෙළේ ද, අත්තාධිපති වූ ද ලෝකාධිපති වූ ද ධර්‍මාධිපති වූ ද ලෝකය දැනගත්තා වූ මනා නුවණැත්තා වූ එබඳු මුනි තෙම සියලු ත්‍රෛභූමික ධර්‍මයන්හි තම්මය නම් වූ තෘෂ්ණායෙන් තොර වූයේ ලෝකය දැනගත්තේ, නො පිරිහේ ය යී.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සතරවන දෙවදූත වර්‍ගයයි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඒ ධර්මය දනිමින් දකිමින් - අටුවා (**ජානං පස්සං විහරන්තී**ති තං ධම්මං ජානන්තා පස්සන්තා විහරන්ති. )"
                    }
                ]
            }
        },
        {
            "pageNum": 272,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "[5. චූලවග්ගො]",
                        "level": 2
                    },
                    {
                        "type": "unindented",
                        "text": "**[සාවත්ථි නිදානං]**"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 1.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "41. තිණ්ණං භික්ඛවෙ සම්මුඛීභාවා සද්ධො කුලපුත්තො බහුං පුඤ්ඤං පසවති. කතමෙසං තිණ්ණං: සද්ධාය භික්ඛවෙ සම්මුඛීභාවා සද්ධො කුලපුත්තො බහුං පුඤ්ඤං පසවති. දෙය්යධම්මස්ස භික්ඛවෙ සම්මුඛීභාවා සද්ධො කුලපුත්තො බහුං පුඤ්ඤං පසවති. දක්ඛිණෙය්යානං භික්ඛවෙ සම්මුඛීභාවා සද්ධො කුලපුත්තො බහුං පුඤ්ඤං පසවති. ඉමෙසං ඛො භික්ඛවෙ තිණ්ණං සම්මුඛීභාවා සද්ධො කුලපුත්තො බහුං පුඤ්ඤං පසවතීති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 2.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "42. තීහි භික්ඛවෙ ඨානෙහි සද්ධො පසන්නො වෙදිතබ්බො. කතමෙහි තීහි: සීලවන්තානං දස්සනකාමො හොති, සද්ධම්මං සොතුකාමො හොති, විගතමලමච්ඡෙරෙන චෙතසා අගාරං අජ්ඣාවසති මුත්තචාගො පයතපාණී වොස්සග්ගරතො යාචයොගො දානසංවිභාගරතො. ඉමෙහි ඛො භික්ඛවෙ තීහි ඨානෙහි සද්ධො පසන්නො වෙදිතබ්බොති."
                    },
                    {
                        "type": "gatha",
                        "text": "45. දස්සනකාමො සීලවතං සද්ධම්මං සොතුමිච්ඡති,\nවිනෙය්ය{1} මච්ඡෙරමලං ස වෙ සද්ධොති වුච්චතීති.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 3.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "43. තයො’මෙ{2} භික්ඛවෙ අත්ථවසෙ සම්පස්සමානෙන අලමෙව පරෙසං ධම්මං දෙසෙතුං. කතමෙ තයො: යො ධම්මං දෙසෙති, සො අත්ථපටිසංවෙදී ච හොති ‘ධම්මප්පටිසංවෙදී ච. යො ධම්මං සුණාති, සො අත්ථප්පටිසංවෙදී ච හොති ධම්මපටිසංවෙදී{3} ච. යො චෙව ධම්මං දෙසෙති, යො ච ධම්මං සුණාති, උභො අත්ථපටිසංවෙදිනො ච හොන්ති ධම්මප්පටිසංවෙදිනො ච. ඉමෙ ඛො භික්ඛවෙ තයො අත්ථවසෙ සම්පස්සමානෙන අලමෙව පරෙසං ධම්මං දෙසෙතුන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. විනයෙ - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. තයො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ධම්මපටිසංවෙදී - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "[5. චූල වර්ගය]",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "unindented",
                        "text": "**[සැවැත්නිදානයි:]**"
                    },
                    {
                        "text": "3. 1. 5. 1.",
                        "type": "heading",
                        "level": 1
                    },
                    {
                        "text": "41. මහණෙනි, තුන් දෙනකුන්ගේ හමුබැවින් සැදැහැවත් කුලපුත් බොහෝ පින් රැස් කරණේය. කවර තිදෙනකුගේය යත්: මහණෙනි, සැදැහැ හමුබැවින් සැදැහැවත් කුලපුත් බොහෝ පින් රැස් කරණේය. මහණෙනි, දෙයධර්‍ම හමුබැවින් සැදැහැති කුලපුත් බොහෝ පින් රැස් කරණේ ය. මහණෙනි, දක්‍ෂිණාර්‍හයන්ගේ හමුබැවින් සැදැහැති කුලපුත් බොහෝ පින් රැස් කරණේ ය. මහණෙනි, මෙ කරුණු තුණ හමුබැවින් සැදැහැති කුලපුත් බොහෝ පින් රැස් කරණේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 2.",
                        "level": 1
                    },
                    {
                        "text": "42. මහණෙනි, මේ කරුණු තුණෙකින් පහන් වූ සැදැහැතියේ දතයුතු වේ. කවර තුණෙකින යත්: සිල්වතුන් දක්නා කැමැතියේ වෙයි, සදහම් අසනු කැමැතියේ වෙයි, වුහුටු ත්‍යාග ඇත්තේ දීමෙහි දෙවි අත් ඇතියේ හැරපීමෙහි ඇලුනේ යදනට නිසිවූයේ දන් හා සංවිභාගයෙහි ඇලුනේ පහ වූ මසුරු මලින් යුත් සිතින් ගිහිගෙයි වෙසෙයි. මහණෙනි, මේ තෙකරුණින් යුක්ත වූයේ පහන් වූ සැදැහැතියේ යි දත යුතුයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "45. සිල්වතුන් දක්නට කැමැතියේ වේ ද, සදහම් අසන්නට කැමැති වේ ද, මසුරුමල දුරලා වෙසේ ද, හේ ඒකාන්තයෙන් සැදැහැත්තේ ය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 3.",
                        "level": 1
                    },
                    {
                        "text": "43. මහණෙනි, මේ කරුණු තුණක් දක්නහු විසින් පරහට දහම් දෙසුමට නිසි ම වේ. කවර තුණෙක යත්: යමෙක් දහම් දෙසා නම්, හේ අටුවා දන්නේත් වෙයි. පෙළදහම් දන්නෙත් වෙයි. යමෙක් ධර්‍මය අසා නම්, හෙ අටුවා දන්නේත් පෙළදහම් දන්නෙත් වෙයි. යමෙකුත් දහම් දෙසා නම්, යමෙකුත් දහම් අසා නම්, එ දෙදෙන අටුවා දන්නාහු ද පෙළදහම් දන්නාහු ද වෙත්. මහණෙනි, මේ කරුණු තුණ දක්නහු විසින් පරහට දහම් දෙසනු නිසි මැ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 274,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 4.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "44. තීහි භික්ඛවෙ ඨානෙහි කථා පවත්තනී{1} හොති. කතමෙහි තීහි: යො ධම්මං දෙසෙති, සො අත්ථපටිසංවෙදී ච හොති ධම්මපටිසංවෙදී ච. යො ධම්මං සුණාති, සො අත්ථපටිසංවෙදී ච හොති ධම්මපටිසංවෙදී ච. යො චෙව ධම්මං දෙසෙති, යො ච ධම්මං සුණාති, උභො අත්ථපටිසංවෙදිනො ච හොන්ති ධම්මපටිසංවෙදිනො ච. ඉමෙහි ඛො භික්ඛවෙ තීහි ඨානෙහි කථා පවත්තනී{1} හොතීති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 5.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "45. තීණි’මානි භික්ඛවෙ පණ්ඩිතපඤ්ඤත්තානි සප්පුරිසපඤ්ඤත්තානි. කතමානි තීණි: දානං භික්ඛවෙ පණ්ඩිතපඤ්ඤත්තං සප්පුරිසපඤ්ඤත්තං. පබ්බජ්ජා භික්ඛවෙ පණ්ඩිතපඤ්ඤත්තා සප්පුරිසපඤ්ඤත්තා. මාතාපිතුන්නං{2} භික්ඛවෙ උපට්ඨානං පණ්ඩිතපඤ්ඤත්තං සප්පුරිසපඤ්ඤත්තං. ඉමානි ඛො භික්ඛවෙ තීණි පණ්ඩිතපඤ්ඤත්තානි සප්පුරිසපඤ්ඤත්තානීති."
                    },
                    {
                        "type": "gatha",
                        "text": "46. සබ්භි දානං උපඤ්ඤත්තං අහිංසා සඤ්ඤමො දමො,\nමාතාපිතුඋපට්ඨානං සන්තානං බ්රහ්මචාරිනං.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "47. සතං එතානි ඨානානි යානි සෙවෙථ පණ්ඩිතො,\nඅරියො දස්සනසම්පන්නො ස ලොකං භජතෙ සිවන්ති.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 6.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "46. යං භික්ඛවෙ සීලවන්තො පබ්බජිතා ගාමං වා නිගමං වා උපනිස්සාය විහරන්ති, තත්ථ මනුස්සා තීහි ඨානෙහි බහුං පුඤ්ඤං පසවන්ති. කතමෙහි තීහි: කායෙන වාචාය මනසා. යං භික්ඛවෙ සීලවන්තො පබ්බජිතා ගාමං වා නිගමං වා උපනිස්සාය විහරන්ති, තත්ථ මනුස්සා ඉමෙහි තීහි ඨානෙහි බහුං පුඤ්ඤං පසවන්තීති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 7.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "47. තීණි’මානි භික්ඛවෙ සඞ්ඛතස්ස සඞ්ඛතලක්ඛණානි. කතමානි තීණි: උප්පාදො පඤ්ඤායති, වයො පඤ්ඤායති, ඨිතස්ස අඤ්ඤථත්තං පඤ්ඤායති. ඉමානි ඛො භික්ඛවෙ තීණි සඞ්ඛතස්ස සඞ්ඛතලක්ඛණානීති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 8.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "48. තීණි’මානි භික්ඛවෙ අසඞ්ඛතස්ස අසඞ්ඛතලක්ඛණානි. කතමානි තීණි: න උප්පාදො පඤ්ඤායති, න වයො පඤ්ඤායති, න ඨිතස්ස අඤ්ඤථත්තං පඤ්ඤායති. ඉමානි ඛො භික්ඛවෙ තීණි අසඞ්ඛතස්ස අසඞ්ඛතලක්ඛණානීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පවත්තිනී - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. මාතාපිතූනං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 4.",
                        "level": 1
                    },
                    {
                        "text": "44. මහණෙනි, කරුණු තුණෙකින් කථාව පවත්නී වෙයි. කවර තුණෙකින යත්: යමෙක් දහම් දෙසා නම්, හේ අටුවා දන්නේත් පෙළදහම් දන්නේත් වෙයි. යමෙක් දහම් අසා නම්, හේ අටුවා දන්නේත් පෙළදහම් දන්නේත් වේ. යමෙක් එ දහම් දෙසා නම්, යමෙක් දහම් අසා නම්, යන දෙදෙන ම අටුවා දන්නෝත් පෙළදහම් දන්නෝත් වෙති. මහණෙනි, මේ කරුණු තුණෙන් කථාව පවත්නී වේ යයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 5.",
                        "level": 1
                    },
                    {
                        "text": "45. මහණෙනි, පණ්ඩිතයන් විසින් පණවන ලද සත්පුරුෂයන් විසින් පණවන ලද මේ කරුණු තුණෙකි. කවර තුණෙක යත්: මහණෙනි, දානය පණ්ඩිතයන් විසින් පණවන ලද සත්පුරුෂයන් විසින් පණවනලද. මහණෙනි, පැවිද්ද පණ්ඩිතයන් විසින් පණවන ලද සත්පුරුෂයන් විසින් පණවන ලද. මහණෙනි, මවුපියඋවටන පණ්ඩිතයන් විසින් පණවන ලද සත්පුරුෂයන් විසින් පණවනලද. මහණෙනි, මොහු තිදෙන පණ්ඩිතයන් විසින් පණවන ලද්දාහු සත්පුරුෂයන් විසින් පණවන ලද්දාහු වෙති යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "46. ශ්‍රෙෂ්ඨචර්‍ය්‍යා ඇති සත්පුරුෂයන්ගේ දානය ද අහිංසාව ද ශීලසංයමය ද ඉන්‍ද්‍රියසංවරය ද මවුපිය උවටන ද යන මේ සත්පුරුෂයන් විසින් පණවන ලද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "47. පණ්ඩිත තෙමේ සත්පුරුෂයන් පිළිබඳ වූ යම්බඳු මේ තුන් කරුණු සෙවුනේ නම්, දර්‍ශන සම්පන්න වූ ඒ ආර්‍ය්‍ය තෙම දෙව්ලොව සෙවුනේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 6.",
                        "level": 1
                    },
                    {
                        "text": "46. මහණෙනි, සිල්වත් පැවිද්දෝ යම් ගමක් හෝ නියම්ගමක් ඇසුරු කොට වෙසෙත් ද, එහි මිනිස්සු කරුණු තුණෙකින් බොහෝ පින් ලබත්. කවර තුණෙකින යත්: කයින් ද, වචනයෙන් ද, සිතින් දැයි. මහණෙනි, සිල්වත් වූ පැවිද්දෝ යම් ගමක් හෝ නියම්ගමක් හෝ ඇසුරු කොට වසත් නම්, එහි මිනිස්සු මේ කරුණු තුණෙන් බොහෝ පින් ලබත්.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 7.",
                        "level": 1
                    },
                    {
                        "text": "47. මහණෙනි, ප්‍රත්‍යය සමවායයෙන් සකස් කරණ ලද්දහුගේ මේ සඞ්ඛත ලක්‍ෂණ තුණෙකි. කවර තුණෙක යත්: ඉපැදීම පැණෙයි, නැස්ම (බිඳීම) පැණෙයි, සිටියහුගේ වෙනස්වීම (නම් වූ ජරාව) පැණෙයි. මහණෙනි, ප්‍රත්‍යය සමවායයෙන් සකස් කරණ ලද්දහුගේ මේ සඞ්ඛත ලක්‍ෂණ තුණයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 8.",
                        "level": 1
                    },
                    {
                        "text": "48. මහණෙනි, ප්‍රත්‍යයයන් විසින් නො සකස්කළහු (නිර්‍වාණයා) ගේ මේ අසඞ්ඛත ලක්‍ෂණ තුණෙකි. කවර තුනෙක යත්: උපත් නොපැණෙයි, ව්‍යය නොපැණෙයි, සිටියහුගේ අන්‍යථාත්‍වය (ජරාව) නො පැණෙයි. මහණෙනි, අසංස්කාර (ධර්‍මයා) ගේ මේ අසංස්කෘත ලක්‍ෂණ තුණයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 276,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 9.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "49. හිමවන්තං භික්ඛවෙ පබ්බතරාජං නිස්සාය මහාසාලා තීහි වඩ්ඪීහි වඩ්ඪන්ති. කතමාහි තීහි:{1} සාඛාපත්තපලාසෙන වඩ්ඪන්ති, තචපපටිකාය වඩ්ඪන්ති, ඵෙග්ගුසාරෙන වඩ්ඪන්ති. හිමවන්තං භික්ඛවෙ පබ්බතරාජං නිස්සාය මහාසාලා ඉමාහි තීහි වඩ්ඪීහි වඩ්ඪන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ සද්ධං කුලපතිං නිස්සාය අන්තොජනො තීහි වඩ්ඪීහි වඩ්ඪති. කතමාහි තීහි: සද්ධාය වඩ්ඪති, සීලෙන වඩ්ඪති, පඤ්ඤාය වඩ්ඪති. සද්ධං භික්ඛවෙ කුලපතිං නිස්සාය අන්තොජනො ඉමාහි තීහි වඩ්ඪීහි වඩ්ඪතීති."
                    },
                    {
                        "type": "gatha",
                        "text": "48. යථාපි පබ්බතො සෙලො අරඤ්ඤස්මිං බ්රහාවනෙ,\nතං රුක්ඛා උපනිස්සාය වඩ්ඪන්තෙ තෙ වනස්පතී.{2}",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "49. තථෙව සීලසම්පන්නං සද්ධං කුලපතිං ඉධ,\nඋපනිස්සාය වඩ්ඪන්ති පුත්තදාරා ච බන්ධවා,\nඅමච්චා ඤාතිසඞ්ඝා ච යෙ චස්ස අනුජීවිනො.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "50. ත්යාස්ස සීලවතො සීලං චාගං සුචරිතානි ච,\nපස්සමානානුකුබ්බන්ති __යෙ භවන්ති__{3} විචක්ඛණා.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "51. ඉධ ධම්මං චරිත්වාන මග්ගං සුගතිගාමිනං,\nනන්දිනො දෙවලොකස්මිං මොදන්ති කාමකාමිනොති.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 10.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "50. තීහි භික්ඛවෙ ඨානෙහි ආතප්පං කරණීයං. කතමෙහි තීහි: අනුප්පන්නානං පාපකානං අකුසලානං ධම්මානං අනුප්පාදාය ආතප්පං කරණීයං. අනුප්පන්නානං කුසලානං ධම්මානං උප්පාදාය ආතප්පං කරණීයං. උප්පන්නානං සාරීරිකානං වෙදනානං දුක්ඛානං තිබ්බානං{4} ඛරානං කටුකානං අසාතානං අමනාපානං පාණහරානං අධිවාසනාය ආතප්පං කරණීයං. ඉමෙහි තීහි භික්ඛවෙ ඨානෙහි ආතප්පං කරණීයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යතො ඛො භික්ඛවෙ භික්ඛු අනුප්පන්නානං පාපකානං අකුසලානං ධම්මානං අනුප්පාදාය ආතප්පං කරොති, අනුප්පන්නානං කුසලානං ධම්මානං උප්පාදාය ආතප්පං කරොති, උප්පන්නානං සාරීරිකානං වෙදනානං දුක්ඛානං තිබ්බානං ඛරානං කටුකානං අසාතානං අමනාපානං පාණහරානං අධිවාසනාය ආතප්පං කරොති. අයං වුච්චති භික්ඛවෙ භික්ඛු ආතාපී නිපකො සතො සම්මා දුක්ඛස්ස අන්තකිරියායාති."
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 11.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "51. තීහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො මහාචොරො සන්ධිම්පි ඡින්දති, නිල්ලොපම්පි හරති, එකාගාරිකම්පි කරොති, පරිපන්ථෙපි තිට්ඨති. කතමෙහි තීහි: ඉධ භික්ඛවෙ මහාචොරො විසමනිස්සිතො ච හොති, ගහනනිස්සිතො ච හොති, බලවනිස්සිතො ච හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ මහාචොරො විසමනිස්සිතො හොති: ඉධ භික්ඛවෙ මහාචොරො නදීවිදුග්ගං වා නිස්සිතො හොති, පබ්බතවිසමං වා. එවං ඛො භික්ඛවෙ මහාචොරො විසමනිස්සිතො හොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කතමෙහි තීහි - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. වනප්පතී - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අත්තමත්ථං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. තිප්පානං - සීමු. අට්ඨකථා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 9.",
                        "level": 1
                    },
                    {
                        "text": "49. මහණෙනි, හිමවත් පර්‍වතරාජයා නිසා මහා වෘක්‍ෂයෝ තුන් වැඩුමෙකින් වැඩෙත්. කවර තුණෙකින යත්: ශාඛායෙන් හා පත්‍ර සඞ්ඛ්‍යාත කොළපතරින් වැඩෙත්, පොතුපතරින් වැඩෙත්, එලයෙන් හා හරින් හා වැඩෙත්, මහණෙනි, හිමවත් පර්‍වතරාජයා නිසා මහාවෘක්‍ෂයෝ මේ තුන් වැඩුමෙන් වැඩෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිද්දෙන් ම සැදැහැති කුලදෙටුහු නිසා ඇතුළු දෙනේ තුන් වැඩුමෙකින් වැඩෙයි. කවර තුණෙකින යත්: සැදැහැයෙන් වැඩෙයි, ශීලයෙන් වැඩෙයි, ප්‍රඥායෙන් වැඩෙයි. මහණෙනි, සැදැහැති කුලපතිහු නිසා ඇතුළු දෙනේ මේ තුන් වැඩුමින් වැඩෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "48. නොගම් මහවෙනෙහි ගල්පව්වෙක් යම්බඳු වේ නම්, එය ඇසුරු කොට ගෙණ ඒ වනදෙටු වෘක්‍ෂයෝ වැඩෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "49. එපරිදි ම මෙහි සැදැහැති සිල්වත් කුලදෙටුහු ඇසුරු කොට ගෙණ අඹුදරුවෝ ද, බන්‍ධුහු ද, සගයෝ ද, නෑ සමූහයෝ ද යම් අනුජීවීහු වෙත් නම්, ඔහු ද වැඩෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "50. යම් විචක්‍ෂණ කෙනෙක් වෙත් නම්, ඔහු ඒ සිල්වත්හුගේ ශීලය හා ත්‍යාග්‍ය හා සුචරිත හා දක්නාහු ඔහු අනුව ක්‍රියා කෙරෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "51. මෙලොව සුගතිගාමී මාර්‍ගය වන කුසල් දහම් පුරා (කර්‍මනන්‍දනායෙන්) සතුටු වූවාහු පස්කම් සැප කැමැත්තාහු දෙව්ලොව දී (විපාක මොදනායෙන්) සතුටු වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 10.",
                        "level": 1
                    },
                    {
                        "text": "50. මහණෙනි, කරුණු තුණෙකින් වීර්‍ය්‍යය කට යුතුයි. කවර තුණෙකින යත්: නූපන් ලාමක අකුශල ධර්‍මයන්ගේ නූපදීම පිණිස වීර්‍ය්‍යය කට යුතු. නූපන් කුශලධර්‍මයන්ගේ ඉපැත්ම පිණිස වීර්‍ය්‍යය කට යුතු. උපන් දුක් වූ තීව්‍ර වූ කර්‍කශ වූ කටුක වූ අමිහිරි වූ අමනාප වූ දිවිහරණා වූ ශාරීරික වෙදනාවන් ඉවසීම පිණිස වීර්‍ය්‍යය කටයුතුය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් කලෙක පටන් කොට මහණ නූපන් ලාමක අකුශලධර්‍මයන් නූපදනා පිණිස වීර්‍ය්‍යය කෙරේ ද, නූපන් කුශලධර්‍මයන් ඉපැත්ම පිණිස වීර්‍ය්‍යය කෙරේ ද, උපන් දුක් වූ තීව්‍ර වූ කර්‍කශ වූ කටුක වූ අමිහිරි වූ අමනාප වූ දිවිහරණා වූ ශාරීරික වෙදනාවන් ඉවසීම පිණිස වැර කෙරේ ද, මහණෙනි, මේ මහණ කෙලෙස් තවන වීර්‍ය්‍යය ඇත්තේ පාරිහාරික නුවණින් නුවණැත්තේ ස්මෘති සම්පන්න වූයේ මොනොවට දුක් නසනු පිණිස පිළිපන්නේ යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "3. 1. 5. 11.",
                        "level": 1
                    },
                    {
                        "text": "51. මහණෙනි, අඞ්ග තුණෙකින් සමන්වාගත වූ මහසොර ගෘහසන්‍ධි ද සිඳුනේයි. වොලොගැණුම් ද කරණේයි. එක් ගෙයක් පැහැර ගැණුම් ද කරණේයි. කඩපලා සොරකමෙහි ද යෙදෙයි. කවර තුණෙකින යත්: මහණෙනි, මෙ ලොව්හි මහසොර විෂමස්ථාන ඇසුරු කෙළේ ද වෙයි, වනලැහැබ් ඇසුරු කෙළේ ද වෙයි. බලවතුන් ඇසුරු කෙළේ ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "මහණෙනි, මහසොර කෙසේ නම් විසමතැන් ඇසුරු කෙළේ වේ ද: මහණෙනි, මෙලොව්හි මහසොර නදී විදුර්‍ගයක් හෝ පර්‍වත විෂම ස්ථානයක් හෝ ඇසුරු කෙළේ වෙයි. මහණෙනි, මෙසේ මහසොර විෂමස්ථානයන් ඇසුරු කෙළේ වේ."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 278,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ මහාචොරො ගහනනිස්සිතො හොති: ඉධ භික්ඛවෙ මහාචොරො තිණගහනං වා නිස්සිතො හොති රුක්ඛගහනං වා ගෙධං{1} වා පන වනසණ්ඩං. එවං ඛො භික්ඛවෙ මහාචොරො ගහනනිස්සිතො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ මහාචොරො බලවනිස්සිතො හොති: ඉධ භික්ඛවෙ මහාචොරො රාජානං වා රාජමහාමත්තානං වා නිස්සිතො හොති. තස්ස එවං හොති: සචෙ මං කොචි කිඤ්චි වක්ඛති, ඉමෙ මෙ රාජානො වා රාජමහාමත්තා වා පරියොධාය අත්ථං භණිස්සන්තීති. සචෙ නං කොචි කිඤ්චි ආහ, ත්යාස්ස රාජානො වා රාජමහාමත්තා වා පරියොධාය අත්ථං භණන්ති. එවං ඛො භික්ඛවෙ මහාචොරො බලවනිස්සිතො හොති. ඉමෙහි ඛො භික්ඛවෙ තීහි අඞ්ගෙහි සමන්නාගතො මහාචොරො සන්ධිම්පි ඡින්දති, නිල්ලොපම්පි හරති, එකාගාරිකම්පි කරොති, පරිපන්ථෙපි තිට්ඨති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ තීහි ධම්මෙහි{†} සමන්නාගතො පාපභික්ඛු ඛතං උපහතං අත්තානං පරිහරති, සාවජ්ජො ච හොති සානුවජ්ජො{2} විඤ්ඤූනං, බහුං ච අපුඤ්ඤං පසවති. කතමෙහි තීහි: ඉධ භික්ඛවෙ පාපභික්ඛු විසමනිස්සිතො ච හොති, ගහනනිස්සිතො ච, බලවනිස්සිතො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පාපභික්ඛු විසමනිස්සිතො හොති: ඉධ භික්ඛවෙ පාපභික්ඛු විසමෙන කායකම්මෙන සමන්නාගතො හොති, විසමෙන වචීකම්මෙන සමන්නාගතො හොති, විසමෙන මනොකම්මෙන සමන්නාගතො හොති. එවං ඛො භික්ඛවෙ පාපභික්ඛු විසමනිස්සිතො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පාපභික්ඛු ගහනනිස්සිතො හොති: ඉධ භික්ඛවෙ පාපභික්ඛු මිච්ඡාදිට්ඨිකො හොති, අන්තග්ගාහිකාය දිට්ඨියා සමන්නාගතො.{3} එවං ඛො භික්ඛවෙ පාපභික්ඛු ගහනනිස්සිතො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පාපභික්ඛු බලවනිස්සිතො හොති: ඉධ භික්ඛවෙ පාපභික්ඛු රාජානං වා රාජමහාමත්තානං වා නිස්සිතො හොති. තස්ස එවං හොති: සචෙ මං කොචි කිඤ්චි වක්ඛති, ඉමෙ මෙ රාජානො වා රාජමහාමත්තා වා පරියොධාය අත්ථං භණිස්සන්තීති. සචෙ නං කොචි කිඤ්චි ආහ, ත්යාස්ස රාජානො වා රාජමහාමත්තා වා පරියොධාය අත්ථං භණන්ති. එවං ඛො භික්ඛවෙ පාපභික්ඛු බලවනිස්සිතො හොති. ඉමෙහි ඛො භික්ඛවෙ තීහි ධම්මෙහි සමන්නාගතො පාපභික්ඛු ඛතං උපහතං අත්තානං පරිහරති, සාවජ්ජො ච හොති සානුවජ්ජො ච විඤ්ඤූනං. බහුඤ්ච අපුඤ්ඤං පසවතීති."
                    },
                    {
                        "type": "centered",
                        "text": "චූළවග්ගො පඤ්චමො.{5}",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "පඨමො පණ්ණාසකො සමත්තො.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. රොධං වා - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "†. අඞ්ගෙහි - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සානුවජ්ජො ච - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. සමන්නාගතො හොති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. තස්සුද්දානං :- සම්මුඛීඨානත්ථවසං - පවත්ති පණ්ඩිත සීලවං සංඛතං පබ්බතා තප්පං මහාචොරෙනෙකාදසාති."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කෙසේ නම් මහසොර ගහන ස්ථානයන් ඇසුරු කෙළේ වේ ද: මහණෙනි, මෙ ලොව්හි මහසොර තණ ලැහැබ් හෝ රුක් ලැහැබ් හෝ මහවන ලැහැබ් හෝ ඇසුරු කෙළේ වෙයි. මහණෙනි, මෙසේ මහසොර ගහන ස්ථානයන් ඇසුරු කෙළේ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මහසොර කෙසේ නම් බලවතුන් ඇසුරු කෙළේ වේ ද: මහණෙනි, මෙ ලොව්හි මහසොර රජකු හෝ රජමහඇමතියන් හෝ ඇසුරු කෙළේ වෙයි. ඔහට මෙබඳු සිතෙක් වෙයි. ‘ඉදින් කිසිවෙක් මට කිසිවක් කියන්නේ නම්, මේ රජවරු ද රජමහඇමැතියෝ ද මාගේ දොස් සඟවා කරුණු කියන්නාහ’ යි. ඉදින් කිසිවෙක් ඔහට කිසිවක් කියා නම්, ඒ රජවරු හෝ රජමහඇමතියෝ හෝ දොස් සඟවා (ඔහුගේ නිදොස්බවට) යුක්ති බෙණෙත්. මහණෙනි, මෙසේ මහසොර බලවතුන් ඇසුරු කෙළේ වේ. මහණෙනි, මේ අඞ්ග තුණෙන් යුත් මහසොර ගෘහසන්‍ධි ද සිඳුනේයි, වොලොගැන්ම ද කරණේයි, එක්ගෙයක් පැහැරගැණුම ද කරණේයි. කඩපලා සොරකම්හි ද යෙදෙන්නේයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිද්දෙන් ම දහම් තුණෙකින් යුත් ලාමක භික්‍ෂු ගුණවිසින් සාළ ගුණවිසින් නට ආත්මය පිරිවටයි. වරද සහිතයෙක් ද නුවණැත්තන් විසින් දොස් කියයුත්තෙක් ද වෙ යි. බොහෝ පව් ද ප්‍රසව කෙරෙයි. කවර තුණෙකින යත්: මහණෙනි, මෙහි පවිටු මහණ විෂමස්ථාන ඇසුරු කෙළේත් ගහනස්ථාන ඇසුරු කෙළේත් බලවතුන් ඇසුරු කෙළේත් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "මහණෙනි, පවිටු මහණ කෙසේ විෂමස්ථාන ඇසුරු කෙළේ වේ ද: මහණෙනි, මෙ සස්නෙහි පවිටු මහණ විෂම වූ කායකර්‍මයෙන් යුක්ත වෙයි, විෂම වූ වාක්කර්‍මයෙන් යුක්ත වෙයි, විෂම වූ මනඃකර්‍මයෙන් යුක්ත වෙයි. මහණෙනි, මෙසේ පවිටු මහණ විෂමස්ථාන ඇසුරු කෙළේ වේ."
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් පවිටු මහණ ගහන නිඃශ්‍රිත වේ ද: මහණෙනි, මෙහි පවිටු මහණ අන්තග්‍රාහිකදෘෂ්ටියෙන් යුක්ත වූයේ මිසදිටු වේ නම්, මහණෙනි, මෙසේ පවිටු මහණ ගහන නිඃශ්‍රිත වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පවිටු මහණ කෙසේ නම් බලවතුන් ඇසුරු කෙළේ වේ ද: මහණෙනි, මෙහි පවිටු මහණ රජුන් හෝ රජමහ ඇමතියන් හෝ ඇසුරු කෙළේ වේ. ඔහට මෙබඳු සිතෙක් වෙයි. ‘ඉදින් මට කිසිවෙක් කිසිවක් කියන්නේ නම්, මේ රජවරු හෝ රජමහඇමැතියෝ හෝ මාගේ දොස් සඟවා යුක්ති බෙණෙත්. ඉදින් කිසිවෙක් ඔහට කිසිවක් කියා නම්, ඒ රජවරු හෝ රජමහඇමැතියෝ හෝ ඔහුගේ දොස් සඟවා යුක්ති බෙණෙති. මහණෙනි, මෙසේ පවිටු මහණ බලවතුන් ඇසුරු කෙළේ වේ. මහණෙනි, මේ ධර්‍ම තුණෙන් යුත් පවිටු මහණ ගුණවිසින් සාළ ගුණ විසින් නට ආත්මය පිරිවටයි. වරද සහිතයෙක් ද නුවණැත්තවුන් විසින් ගැරැහිය යුත්තෙක් ද වේ. බොහෝ පව් ද ප්‍රසව කෙරේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පස්වන චූලවර්‍ගයයි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "පළමු පණස නිමි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ],
    "bookId": 22,
    "pageOffset": 0
}