{
    "filename": "an-4-5",
    "bookId": 23,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 414,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "5. පඤ්චම මහාපණ්ණාසකො",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. සප්පුරිසවග්ගො.",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 1. 1",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සප්පුරිසසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "1. අසප්පුරිසඤ්ච වො භික්ඛවෙ දෙසිස්සාමි අසප්පුරිසෙන අසප්පුරිසතරඤ්ච, සප්පුරිසඤ්ච සප්පුරිසෙන සප්පුරිසතරඤ්ච. තං සුණාථ සාධුකං මනසි කරොථ භාසිස්සාමීති. එවං භන්තෙ’ති ඛො තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ අසප්පුරිසො? ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතී හොති, අදින්නාදායී හොති, කාමෙසු මිච්ඡාචාරී හොති, මුසාවාදී හොති, සුරාමෙරයමජ්ජපමාදට්ඨායී හොති. අයං වුච්චති භික්ඛවෙ අසප්පුරිසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ අසප්පුරිසෙන අසප්පුරිසතරො? ඉධ භික්ඛවෙ එකච්චො අත්තනා ච පාණාතිපාතී හොති, පරඤ්ච පාණාතිපාතෙ සමාදපෙති. අත්තනා ච අදින්නාදායී හොති, පරඤ්ච අදින්නාදානෙ සමාදපෙති. අත්තනා ච කාමෙසු මිච්ඡාචාරී හොති, පරඤ්ච කාමෙසු මිච්ඡාචාරෙ සමාදපෙති. අත්තනා මුසාවාදී හොති, පරඤ්ච මුසාවාදෙ සමාදපෙති. අත්තනා ච සුරාමෙරයමජ්ජපමාදට්ඨායී හොති, පරඤ්ච සුරාමෙරයමජ්ජපමාදට්ඨානෙ සමාදපෙති. අයං වුච්චති භික්ඛවෙ අසප්පුරිසෙන අසප්පුරිසතරො:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ සප්පුරිසො? ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතා පටිවිරතො හොති, අදින්නාදානා පටිවිරතො හොති, කාමෙසු මිච්ඡාචාරා පටිවිරතො හොති, මුසාවාදා පටිවිරතො හොති, සුරාමෙරයමජ්ජපමාදට්ඨානා පටිවිරතො හොති. අයං වුච්චති භික්ඛවෙ සප්පුරිසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ සප්පුරිසෙන සප්පුරිසතරො? ඉධ භික්ඛවෙ එකච්චො අත්තනා ච පාණාතිපාතා පටිවිරතො හොති, පරඤ්ච පාණාතිපාතා වෙරමණියා සමාදපෙති. අත්තනා ච අදින්නාදානා පටිවිරතො හොති, පරඤ්ච අදින්නාදානා වෙරමණියා සමාදපෙති. අත්තනා ච කාමෙසු මිච්ඡාචාරා පටිවිරතො හොති, පරඤ්ච කාමෙසු මිච්ඡාචාරා වෙරමණියා සමාදපෙති. අත්තනා ච මුසාවාදා පටිවිරතො හොති, පරඤ්ච මුසාවාදා වෙරමණියා සමාදපෙති. අත්තනා ච සුරාමෙරයමජ්ජපමාදට්ඨානා පටිවිරතො හොති, පරඤ්ච සුරාමෙරයමජ්ජපමාදට්ඨානා සමාදපෙති. අයං වුච්චති භික්ඛවෙ සප්පුරිසෙන සප්පුරිසතරොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "5. පස්වන මහාපණ්ණාසකය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. සප්පුරිස වර්‍ගය",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4.5.1.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සප්පුරිස සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි:]",
                        "type": "unindented"
                    },
                    {
                        "text": "1.මහණෙනි, තොපට අසත්පුරුෂයා හා අසත්පුරුෂයාට වැඩිසිටි අසත්පුරුෂතරයා හා සත්පුරුෂයා හා සත්පුරුෂයාට වැඩිසිටි සත්පුරුෂතරයා හා දෙසමි. ඒ අසව, මනා කොට මෙනෙහි කරව, කියමි යි වදාළහ. ‘එසේ ය වහන්සැ’ යි ඒ භික්‍ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හු. භාග්‍යවතුන් වහන්සේ තෙල සූත්‍රය වදාළහ:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අසත්පුරුෂ කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් පණිවා කරන්නේ වෙයි. අයිනාදන් ගන්නේ වෙයි. කාමයෙහි මිසහසර ඇතියේ වෙයි. මුසවා කියන්නේ වෙයි. මද පමා දෙකට කරුණු වූ රහමෙර පීමෙහි සිටුනාසුලු වෙයි. මහණෙනි, මේ අසත්පුරුෂය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අසත්පුරුෂයාට වැඩිසිටි අසත්පුරුෂතර කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තෙමේත් පණිවා කරන්නේ වෙයි. මෙරමාත් පණිවායෙහි සමාදන් කරවයි. තෙමේත් අයිනාදන් ගන්නේ වෙයි. මෙරමාත් අයිනාදනෙහි සමාදන් කරවයි. තෙමේත් කාමයෙහි මිසහසර ඇතියේ වෙයි. මෙරමාත් කාමයෙහි මිසහසරෙහි සමාදන් කරවයි. තෙමේත් මුසවා කියන්නේ වෙයි. මෙරමාත් මුසවායෙහි සමාදන් කරවයි. තෙමේත් මද පමා දෙකට කරුණු වූ රහමෙර පීමෙහි සිටුනාසුලු වෙයි. මෙරමාත් මද පමා දෙකට කරුණු වූ රහමෙර පීමෙහි සමාදන් කරවයි. මහණෙනි, මේ අසත්පුරුෂයාට වැඩිසිටි අසත්පුරුෂතරය යී කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සත්පුරුෂ කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් පණිවායෙන් දුරු වූයේ වෙයි. අයිනාදනින් දුරු වූයේ වෙයි. කාමයෙහි මිසහසරින් දුරු වූයේ වෙයි. මුසවායෙන් දුරු වූයේ වෙයි. මද පමා දෙකට කරුණු වූ රහමෙරින් දුරු වූයේ වෙයි. මහණෙනි, මේ සත්පුරුෂය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සත්පුරුෂයාට වැඩිසිටි සත්පුරුෂතර කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තෙමේත් පණිවායෙන් දුරු වූයේ වෙයි. මෙරමාත් පණිවායෙන් දුරු වීමෙහි සමාදන් කරවයි. තෙමේත් අයිනාදනින් දුරු වූයේ වෙයි. මෙරමාත් අයිනාදනින් දුරු වීමෙහි සමාදන් කරවයි. තෙමේත් කාමයෙහි මිසහසරින් දුරු වූයේ වෙයි. මෙරමාත් කාමයෙහි මිසහසරින් දුරු වීමෙහි සමාදන් කරවයි. තෙමේත් මුසවායෙන් දුරු වූයේ වෙයි. මෙරමාත් මුසාවයින් දුරු වීමෙහි සමාදන් කරවයි. තෙමේත් මද පමා දෙකට කරුණු වූ රහමෙරින් දුරු වූයේ වෙයි. මෙරමාත් මද පමා දෙකට කරුණු වූ රහමෙර පීමෙන් දුරු වීමෙහි සමාදන් කරවයි. මහණෙනි, මේ සත්පුරුෂයාට වැඩිසිටි සත්පුරුෂතරය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 416,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 5. 1. 2",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(දුතිය සප්පුරිසසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "2. අසප්පුරිසඤ්ච වො භික්ඛවො දෙසිස්සාමි අසප්පුරිසෙන අසප්පුරිසතරඤ්ච, සප්පුරිසඤ්ච සප්පුරිසෙන සප්පුරිසතරඤ්ච. තං සුණාථ -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ අසප්පුරිසො? ඉධ භික්ඛවෙ එකච්චො අස්සද්ධො හොති, අහිරිකො හොති, අනොත්තප්පී හොති, අප්පස්සුතො හොති, කුසීතො හොති, මුට්ඨස්සතී හොති, දුප්පඤ්ඤො හොති. අයං වුච්චති භික්ඛවෙ අසප්පුරිසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ අසප්පුරිසෙන අසප්පුරිසතරො? ඉධ භික්ඛවෙ එකච්චො අත්තනා ච අස්සද්ධො හොති, පරඤ්ච අස්සද්ධීයෙ සමාදපෙති. අත්තනා ච අහිරිකො හොති, පරඤ්ච අහිරිකතාය සමාදපෙති. අත්තනා ච අනොත්තප්පී හොති, පරඤ්ච අනොත්තප්පෙ සමාදපෙති. අත්තනා ච අප්පස්සුතො හොති, පරඤ්ච අප්පස්සුතෙ සමාදපෙති. අත්තනා ච කුසීතො හොති, පරඤ්ච කොසජ්ජෙ සමාදපෙති. අත්තනා ච මුට්ඨස්සතී හොති, පරඤ්ච මුට්ඨසච්චෙ සමාදපෙති. අත්තනා ච දුප්පඤ්ඤො හොති, පරඤ්ච දුප්පඤ්ඤතාය සමාදපෙති. අයං වුච්චති භික්ඛවෙ අසප්පුරිසෙන අසප්පුරිසතරො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ සප්පුරිසො? ඉධ භික්ඛවෙ එකච්චො සද්ධො හොති, හිරිමා හොති, ඔත්තප්පී හොති, බහුස්සුතො හොති, ආරද්ධවිරියො හොති, සතිමා හොති, පඤ්ඤවා හොති. අයං වුච්චති භික්ඛවෙ සප්පුරිසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ සප්පුරිසෙන සප්පුරිසතරො? ඉධ භික්ඛවෙ එකච්චො අත්තනා ච සද්ධාසම්පන්නො හොති. පරඤ්ච සද්ධාසම්පදාය සමාදපෙති. අත්තනා ච හිරිමා හොති, පරඤ්ච හිරිමතාය සමාදපෙති අත්තනා ච ඔත්තප්පී හොති, පරඤ්ච ඔත්තප්පෙ සමාදපෙති. අත්තනා ච බහුස්සුතො හොති. පරඤ්ච බාහුසච්චෙ සමාදපෙති. අත්තනා ච ආරද්ධවිරියො හොති, පරඤ්ච විරියාරම්භෙ සමාදපෙති. අත්තනා ච උපට්ඨිතසතී හොති, පරඤ්ච සතිපට්ඨානෙ සමාදපෙති. අත්තනා ච පඤ්ඤාසම්පන්නො හොති, පරඤ්ච පඤ්ඤාසම්පදාය සමාදපෙති. අයං වුච්චති භික්ඛවෙ සප්පුරිසෙන සප්පුරිසතරොති"
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 1. 3",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "( තතිය සප්පුරිසසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3. අසප්පුරිසඤ්ච වො භික්ඛවෙ දෙසිස්සාමි, අසප්පුරිසෙන අසප්පුරිසතරඤ්ච, සප්පුරිසඤ්ච සප්පුරිසෙන සප්පුරිසතරඤ්ච? තං සුණාථ -පෙ-"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.5.1.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දෙවන සප්පුරිස සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "2. මහණෙනි, තොපට අසත්පුරුෂයා හා අසත්පුරුෂයාට වැඩිසිටි අසත්පුරුෂතරයා හා සත්පුරුෂයා හා සත්පුරුෂයාට වැඩිසිටි සත්පුරුෂතරයා හා දෙසමි. එය අසව …",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අසත්පුරුෂ කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් සැදැහැ නැත්තේ ය. ලජ්ජා නැත්තේ ය. පවට බිය නැත්තේ ය. අල්පශ්‍රැත ය. කුසීත ය. මුළා වූ සිහි ඇතියේ ය. දුෂ්ප්‍රාඥ ය. මහණෙනි, මේ අසත්පුරුෂය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අසත්පුරුෂයාට වැඩිසිටි අසත්පුරුෂතර කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තෙමේත් සැදැහැ නැත්තේ ය. මෙරමා ද සැදැහැ නැතිසෙයෙහි සමාදන් කරවයි. තෙමේ ද පවට ලජ්ජා නැත්තේ ය. මෙරමා ද ලජ්ජානැතිසෙයෙහි සමාදන් කරවයි. තෙමේ ද පවට බිය නැත්තේ ය. මෙරමා ද පවට බියනැතිසෙයෙහි සමාදන් කරවයි. තෙමේ ද අල්පශ්‍රැත ය. මෙරමා ද අල්පශ්‍රැතබව්හි සමාදන් කරවයි. තෙමේ ද කුසීත ය. මෙරමා ද කුසීතබව්හි සමාදන් කරවයි. තෙමේ ද මුළාවූ සිහි ඇත්තේ ය. මෙරමා ද මුළාවූ සිහිඇතිසෙයෙහි සමාදන් කරවයි. තෙමේ ද දුෂ්ප්‍රාඥය. මෙරමා ද දුෂ්ප්‍රාඥබව්හි සමාදන් කරවයි. මහණෙනි, මේ අසත්පුරුෂයාට වැඩිසිටි අසත්පුරුෂතරය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සත්පුරුෂ කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් සැදැහැ ඇතියේ වෙයි. පවට ලජ්ජා ඇතියේ වෙයි. පවට බිය ඇතියේ වෙයි. බහුශ්‍රුත වෙයි. රුකුළවැර ඇතියේ වෙයි. සිහි ඇතියේ වෙයි. පැණවත් වෙයි. මහණෙනි, මේ සත්පුරුෂය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සත්පුරුෂයාට වැඩිසිටි සත්පුරුෂතර කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තෙමේත් ශ්‍රද්ධාසම්පන්න වෙයි. මෙරමාත් ශ්‍රද්ධාසම්පත්තියෙහි සමාදන් කරවයි. තෙමේත් පවට ලජ්ජා ඇතියේ වෙයි. මෙරමා ද පවට ලජ්ජා ඇතිබව්හි සමාදන් කරවයි. තෙමේ ද පවට බිය ඇත්තේ වෙයි. මෙරමා ද පවට බියඇතිබව්හි සමාදන් කරවයි. තෙමේ ද බහුශ්‍රුත වෙයි. මෙරමා ද බහුශ්‍රුත බව්හි සමාදන් කරවයි. තෙමේ ද ඇරඹූ වැර ඇතියේ වෙයි. මෙරමා ද වැර ඇරඹුම්හි සමාදන් කරවයි. තෙමේ ද එළඹ සිටි සිහි ඇත්තේ වෙයි. මෙරමා ද සීවටන්හි සමාදන් කරවයි. තෙමේ ද ප්‍රඥාසම්පන්න වෙයි. මෙරමා ද ප්‍රඥාසම්පත්තියෙහි සමාදන් කරවයි. මහණෙනි, මේ සත්පුරුෂයාට වැඩිසිටි සත්පුරුෂතරය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.1.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තෙවන සප්පුරිස සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3. මහණෙනි, තොපට අසත්පුරුෂයා හා අසත්පුරුෂයාට වැඩි සිටි අසත්පුරුෂතරයා හා, සත්පුරුෂයා හා සත්පුරුෂයාට වැඩි සිටි සත්පුරුෂතරයා හා දෙසමි. එය අසව…",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 418,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ අසප්පුරිසො? ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතී හොති අදින්නාදායී හොති. කාමෙසු මිච්ඡාචාරී හොති මුසාවාදී හොති. පිසුණාවාචො හොති. ඵරුසාවාචො හොති සම්ඵප්පලාපී හොති. අයං වුච්චති භික්ඛවෙ අසප්පුරිසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ අසප්පුරිසෙන අසප්පුරිසතරො? ඉධ භික්ඛවෙ එකච්චො අත්තනා ච පාණාතිපාතී හොති, පරඤ්ච පාණාතිපාතෙ සමාදපෙති. අත්තනා ච අදින්නාදායී හොති, පරඤ්ච අදින්නාදානෙ සමාදපෙති, අත්තනා ච කාමෙසු මිච්ඡාචාරී හොති, පරඤ්ච කාමෙසු මිච්ඡාචාරෙ සමාදපෙති. අත්තනා ච මුසාවාදී හොති, පරඤ්ච මුසාවාදෙ සමාදපෙති. අත්තනා ච පිසුණාවාචො හොති, පරඤ්ච පිසුණාය වාචාය සමාදපෙති. අත්තනා ච ඵරුසාවාචො හොති, පරඤ්ච ඵරුසාය වාචාය සමාදපෙති. අත්තනා ච සම්ඵප්පලාපී හොති, පරඤ්ච සම්ඵප්පලාපෙ සමාදපෙති. අයං වුච්චති භික්ඛවෙ අසප්පුරිසෙන අසප්පුරිසතරො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ සප්පුරිසො? ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතා පටිවිරතො හොති. අදින්නාදානා පටිවිරතො හොති. කාමෙසු මිච්ඡාචාරා පටිවිරතො හොති. මුසාවාදා පටිවිරතො හොති. පිසුණාවාචා පටිවිරතො හොති. ඵරුසාවාචා පටිවිරතො හොති. සම්ඵප්පලාපා පටිවිරතො හොති. අයං වුච්චති භික්ඛවෙ සප්පුරිසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ සප්පුරිසෙන සප්පුරිසතරො? ඉධ භික්ඛවෙ එකච්චො අත්තනා ච පාණාතිපාතා පටිවිරතො හොති, පරඤ්ච පාණාතිපාතා වෙරමණියා සමාදපෙති. අත්තනා ච අදින්නාදානා පටිවිරතො හොති, පරඤ්ච අදින්නාදානා වෙරමණියා සමාදපෙති. -පෙ- අත්තනා ච පිසුණාවාචා පටිවිරතො හොති, පරඤ්ච පිසුණාවාචා වෙරමණියා සමාදපෙති. අත්තනා ච ඵරුසාවාචා පටිවිරතො හොති, පරඤ්ච ඵරුසාවාචා වෙරමණියා සමාදපෙති, අත්තනා ච සම්ඵප්පලාපා පටිවිරතො හොති, පරඤ්ච සම්ඵප්පලාපා වෙරමණියා සමාදපෙති. අයං වුච්චති භික්ඛවෙ සප්පුරිසෙන සප්පුරිසතරොති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 1. 4",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(චතුත්ථ සප්පුරිස සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "4. අසප්පුරිසඤ්ච වො භික්ඛවෙ දෙසිස්සාමි අසප්පුරිසෙන අසප්පුරිසතරඤ්ච සප්පුරිසඤ්ච සප්පුරිසෙන සප්පුරිසතරඤ්ච. තං සුණාථ -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ අසප්පුරිසො? ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතී හොති. -පෙ- අභිජ්ඣාලු හොති, බ්යාපන්නචිත්තො හොති. මිච්ඡාදිට්ඨිකො හොති. අයං වුච්චති භික්ඛවෙ අසප්පුරිසො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, අසත්පුරුෂ කවරේය? මහණෙනි, මෙලොව ඇතැමෙක් පණිවා කරන්නේ වෙයි. අයිනාදන් ගන්නේ වෙයි. කාමයෙහි මිසහසර ඇතියේ වෙයි. මුසවා බණන්නේ වෙයි. පිසුනුබස් ඇතියේ වෙයි. පරොස්බස් ඇතියේ වෙයි. පලප් ඇතියේ වෙයි. මහණෙනි, මේ අසත්පුරුෂයයි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අසත්පුරුෂයාට වැඩි සිටි අසත්පුරුෂතර කවරේ ය? මහණෙනි, මෙලොව ඇතැමෙක් තෙමේ ද පණිවා කරන්නේ වෙයි. මෙරමා ද පණිවායෙහි සමාදන් කරවයි. තෙමේ ද අයිනාදන් ගන්නේ වෙයි. මෙරමා ද අයිනාදන්හි සමාදන් කරවයි. තෙමේ ද කාමයෙහි මිසහසර ඇතියේ වෙයි. මෙරමා ද කාමයෙහි මිසහසරෙහි ලා සමාදන් කරවයි. තෙමේ ද මුසවා බණන්නේ වෙයි. මෙරමා ද මුසවායෙහි සමාදන් කරවයි. තෙමේ ද පිසුනුබස් ඇතියේ වෙයි. මෙරමා ද පිසුනුබස් හි සමාදන් කරවයි. තෙමේ ද පරොස් බස් ඇතියේ වෙයි. මෙරමා ද පරොස් බස්හි සමාදන් කරවයි. තෙමේ ද පලප් ඇතියේ වෙයි. මෙරමා ද පලප්හි සමාදන් කරවයි. මහණෙනි, මේ අසත්පුරුෂයාට වැඩි සිටි අසත්පුරුෂතරය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සත්පුරුෂ කවරේ ය? මහණෙනි, මෙලොව ඇතැමෙක් පණිවායෙන් දුරු වූයේ වෙයි. අයිනාදනින් දුරුවූයේ වෙයි. කාමයෙහි මිසහසරින් දුරුවූයේ වෙයි. මුසවායෙන් දුරුවූයේ වෙයි. පිසුනුබසින් දුරු වූයේ වෙයි. පරොස්බසින් දුරු වූයේ වෙයි. පලපින් දුරු වූයේ වෙයි. මහණෙනි, මේ සත්පුරුෂය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සත්පුරුෂයාට වැඩි සිටි සත්පුරුෂතර කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තෙමේ පණිවායෙන් දුරු වූයේ වෙයි. මෙරමා ද පණිවායෙන් දුරු වීමෙහි සමාදන් කරවයි. තෙමේ ද අයිනාදනින් දුරු වූයේ වෙයි. මෙරමා ද අයිනාදනින් දුරු වීමෙහි සමාදන් කරවයි ... තෙමේ ද පිසුනු බසින් දුරු වූයේ වෙයි. මෙරමා ද පිසුනු බසින් දුරු වීමෙහි සමාදන් කරවයි. තෙමේ ද පරොස් බසින් දුරු වූයේ වෙයි. මෙරමා ද පරොස් බසින් දුරු වීමෙහි සමාදන් කරව යි. තෙමේ ද පලපින් දුරු වූයේ වෙයි. මෙරමා ද පලපින් දුරු වීමෙහි සමාදන් කරවයි. මහණෙනි, මේ සත්පුරුෂයාට වැඩි සිටි සත්පුරුෂතරය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.1.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සිව්වන සප්පුරිස සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "4. මහණෙනි, තොපට අසත්පුරුෂයා හා අසත්පුරුෂයාට වැඩි සිටි අසත්පුරුෂතරයා හා සත්පුරුෂයා හා සත්පුරුෂයාට වැඩි සිටි සත්පුරුෂතරයා හා දෙසමි. ඒ අසව…",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අසත්පුරුෂ කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් පණිවා කරන්නේ වෙයි ... අභිධ්‍යා බහුල වෙයි. ව්‍යාපාදයට පැමිණි සිතැත්තේ වෙයි. මිසදිටු ඇත්තේ වෙයි. මහණෙනි, මේ අසත්පුරුෂය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 420,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ අසප්පුරිසෙන අසප්පුරිසතරො? ඉධ භික්ඛවෙ එකච්චො අත්තනා ච පාණාතිපාතී හොති, පරඤ්ච පාණාතිපාතෙ සමාදපෙති. -පෙ- අත්තනා ච අභිජ්ඣාලු හොති, පරඤ්ච අභිජ්ඣාය සමාදපෙති. අත්තනා ච බ්යාපන්නචිත්තො හොති, පරඤ්ච බ්යාපාදෙ සමාදපෙති. අත්තනා ච මිච්ඡාදිට්ඨිකො හොති, පරඤ්ච මිච්ඡාදිට්ඨියා සමාදපෙති. අයං වුච්චති භික්ඛවෙ අසප්පුරිසෙන අසප්පුරිසතරො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ සප්පුරිසො? ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතා පටිවිරතො හොති. -පෙ- අනභිජ්ඣාලු හොති, අබ්යාපන්නචිත්තො හොති. සම්මාදිට්ඨිකො හොති. අයං වුච්චති භික්ඛවෙ සප්පුරිසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ සප්පුරිසෙන සප්පුරිසතරො? ඉධ භික්ඛවෙ එකච්චො අත්තනා ච පාණාතිපාතා පටිවිරතො හොති, පරඤ්ච පාණාතිපාතා වෙරමණියා සමාදපෙති. -පෙ- අත්තනා ච අනභිජ්ඣාලු හොති. පරඤ්ච අනභිජ්ඣාය සමාදපෙති. අත්තනා ච අබ්යාපන්නචිත්තො හොති. පරඤ්ච අබ්යාපාදෙ සමාදපෙති. අත්තනා ච සම්මාදිට්ඨිකො හොති. පරඤ්ච සම්මාදිට්ඨියා සමාදපෙති. අයං වුච්චති භික්ඛවෙ සප්පුරිසෙන සප්පුරිසතරොති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 1. 5",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පඤ්චම සප්පුරිස සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "5. අසප්පුරිසඤ්ච වො භික්ඛවෙ දෙසිස්සාමි අසප්පුරිසෙන අසප්පුරිසතරඤ්ච සප්පුරිසඤ්ච සප්පුරිසෙන සප්පුරිසතරඤ්ච. තං සුණාථ -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ අසප්පුරිසො? ඉධ භික්ඛවෙ එකච්චො මිච්ඡාදිට්ඨිකො හොති. මිච්ඡාසඞ්කප්පො හොති. මිච්ඡාවාචො හොති. මිච්ඡාකම්මන්තො හොති. මිච්ඡාආජීවො හොති. මිච්ඡාවායාමො හොති. මිච්ඡාසතී හොති. මිච්ඡාසමාධී හොති. අයං වුච්චති භික්ඛවෙ අසප්පුරිසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ අසප්පුරිසෙන අසප්පුරිසතරො? ඉධ භික්ඛවෙ එකච්චො අත්තනා ච මිච්ඡාදිට්ඨිකො හොති. පරඤ්ච මිච්ඡාදිට්ඨියා සමාදපෙති. අත්තනා ච මිච්ඡාසඞ්කප්පො හොති. පරඤ්ච මිචඡාසඞ්කප්පෙ සමාදපෙති. අත්තනා ච මිච්ඡාවාචො හොති. පරඤ්ච මිච්ඡාවාචාය සමාදපෙති. අත්තනා ච මිච්ඡාකම්මන්තො හොති. පරඤ්ච මිච්ඡාකම්මන්තෙ සමාදපෙති. අත්තනා ච මිච්ඡාආජීවො හොති. පරඤ්ච මිච්ඡාආජීවෙ සමාදපෙති. අත්තනා ච මිච්ඡාවායාමො හොති. පරඤ්ච මිච්ඡාවායාමෙ සමාදපෙති. අත්තනා ච මිච්ඡාසති හොති. පරඤ්ච මිච්ඡාසතියා සමාදපෙති. අත්තනා ච මිච්ඡාසමාධි හොති. පරඤ්ච මිච්ඡාසමාධිම්හි සමාදපෙති. අයං වුච්චති භික්ඛවෙ අසප්පුරිසෙන අසප්පුරිසතරො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, අසත්පුරුෂයාට වැඩි සිටි අසත්පුරුෂතර කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තෙමේත් පණිවා කරන්නේ වෙයි. මෙරමාත් පණිවා කිරීමෙහි සමාදන් කරවයි ... තෙමේත් අභිධ්‍යාබහුල වෙයි. මෙරමාත් අභිධ්‍යායෙහි සමාදන් කරවයි. තෙමේත් ව්‍යාපාද ඇත්තේ වෙයි. මෙරමාත් ව්‍යාපාදයෙහි සමාදන් කරව යි. තෙමේත් මිසදිටු ඇත්තේ වෙයි. මෙරමාත් මිසදිටුයෙහි සමාදන් කරවයි. මහණෙනි, මේ අසත්පුරුෂයාට වැඩි සිටි අසත්පුරුෂතරය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සත්පුරුෂ කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් පණිවායෙන් දුරු වූයේ වෙයි ... අභිධ්‍යාබහුල කොට නැත්තේ වෙයි. ව්‍යාපාද රහිත සිතැත්තේ වෙයි. සම්‍යග්දෘෂ්ටික වෙයි. මහණෙනි, මේ සත්පුරුෂය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සත්පුරුෂයාට වැඩි සිටි සත්පුරුෂතර කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තෙමේත් පණිවායෙන් දුරු වූයේ වෙයි. මෙරමාත් පණිවායෙන් දුරු වීමෙහි සමාදන් කරවයි ... තෙමේත් අභිධ්‍යාබහුල කොට නැත්තේ වෙයි. මෙරමාත් අභිධ්‍යායෙහි සමාදන් නොකරවයි. තෙමේත් අව්‍යාපාද සිතැත්තේ වෙයි. මෙරමාත් අව්‍යාපාදයෙහි සමාදන් කරවයි. තෙමේත් සම්‍යග්දෘෂ්ටික වෙයි. මෙරමාත් සම්‍යග්දෘෂ්ටියෙහි සමාදන් කරවයි. මහණෙනි, මේ සත්පුරුෂයාට වැඩි සිටි සත්පුරුෂතරය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.1.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පස්වන සප්පුරිස සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "5. මහණෙනි, තොපට අසත්පුරුෂයා හා අසත්පුරුෂයාට වැඩිසිටි අසත්පුරුෂතරයා හා සත්පුරුෂයා හා සත්පුරුෂයාට වැඩි සිටි සත්පුරුෂතරයා හා දෙසමි. ඒ අසව …",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අසත්පුරුෂ කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් මිසදිටු ඇතියේ වෙයි. මිථ්‍යාසඞ්කල්ප ඇතියේ වෙයි. මිථ්‍යාවාක් ඇතියේ වෙයි. මිථ්‍යාකර්‍මාන්ත ඇතියේ වෙයි. මිථ්‍යා ආජීව ඇතියේ වෙයි. මිථ්‍යාව්‍යායාම ඇතියේ වෙයි. මිථ්‍යාස්මෘති ඇතියේ වෙයි. මිථ්‍යාසමාධි ඇතියේ වෙයි. මහණෙනි, මේ අසත්පුරුෂය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අසත්පුරුෂයාට වැඩි සිටි අසත්පුරුෂතර කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තෙමේත් මිථ්‍යාදෘෂ්ටික වෙයි. මෙරමාත් මිථ්‍යාදෘෂ්ටියෙහි සමාදන් කරවයි. තෙමේත් මිථ්‍යාසඞ්කල්ප ඇතියේ වෙයි. මෙරමාත් මිථ්‍යාසඞ්කල්පයෙහි සමාදන් කරවයි. තෙමේත් මිථ්‍යාවාක් ඇත්තේ වෙයි. මෙරමාත් මිථ්‍යාවචනයෙහි සමාදන් කරවයි. තෙමේත් මිථ්‍යාකර්‍මාන්ත ඇත්තේ වෙයි. මෙරමාත් මිථ්‍යාකර්‍මාන්තයෙහි සමාදන් කරවයි. තෙමේත් මිථ්‍යාආජීව ඇත්තේ වෙයි. මෙරමාත් මිථ්‍යා ආජීවයෙහි සමාදන් කරවයි. තෙමේත් මිථ්‍යාව්‍යායාම ඇත්තේ වෙයි. මෙරමාත් මිථ්‍යාව්‍යායාමයෙහි සමාදන් කරවයි. තෙමේත් මිථ්‍යාස්මෘති ඇත්තේ වෙයි. මෙරමාත් මිථ්‍යාස්මෘතියෙහි සමාදන් කරවයි. තෙමේත් මිථ්‍යාසමාධි ඇත්තේ වෙයි. මෙරමාත් මිථ්‍යාසමාධියෙහි සමාදන් කරවයි. මහණෙනි, මේ අසත්පුරුෂයාට වැඩි සිටි අසත්පුරුෂතරය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 422,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ සප්පුරිසො? ඉධ භික්ඛවෙ එකච්චො සම්මාදිට්ඨිකො හොති. සම්මාසඞ්කප්පො හොති. සම්මාවාචො හොති. සම්මාකම්මන්තො හොති. සම්මාආජීවො හොති. සම්මා වායාමො හොති. සම්මාසතී හොති. සම්මාසමාධී හොති. අයං වුච්චති භික්ඛවෙ සප්පුරිසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො භික්ඛවෙ සප්පුරිසෙන සප්පුරිසතරො? ඉධ භික්ඛවෙ එකච්චො සම්මාදිට්ඨිකො හොති, පරඤ්ච සම්මාදිට්ඨියා සමාදපෙති. අත්තනා ච සම්මාසඞ්කප්පො හොති. පරඤ්ච සම්මා සඞ්කප්පෙ සමාදපෙති. අත්තනා ච සම්මාවාචො හොති, පරඤ්ච සම්මාවාචාය සමාදපෙති. අත්තනා ච සම්මාකම්මන්තො හොති, පරඤ්ච සම්මාකම්මන්තෙ සමාදපෙති. අත්තනා ච සම්මාආජීවො හොති, පරඤ්ච සම්මාආජීවෙ සමාදපෙති. අත්තනා ච සම්මාවායාමො හොති, පරඤ්ච සම්මාවායාමෙ සමාදපෙති. අත්තනා ච සම්මාසතී හොති, පරඤ්ච සම්මාසතියා සමාදපෙති. අත්තනා ච සම්මාසමාධී හොති, පරඤ්ච සම්මාසමාධිම්හි සමාදපෙති. අයං වුච්චති භික්ඛවෙ සප්පුරිසෙන සප්පුරිසතරොති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 1. 6",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ඡට්ඨ සප්පුරිස සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "6. අසප්පුරිසඤ්ච වො භික්ඛවෙ දෙසිස්සාමි අසප්පුරිසෙන අසප්පුරිසතරඤ්ච සප්පුරිසඤ්ච සප්පුරිසෙන සප්පුරිසතරඤ්ච. තං සුණාථ -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ අසප්පුරිසො? ඉධ භික්ඛවෙ එකච්චො මිච්ඡාදිට්ඨිකො හොති, -පෙ- මිච්ඡාඤාණී හොති, මිච්ඡාවිමුත්තී හොති, අයං වුච්චති භික්ඛවෙ අසප්පුරිසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ අසප්පුරිසෙන අසප්පුරිසතරො? ඉධ භික්ඛවෙ එකච්චො අත්තනා ච මිච්ඡාදිට්ඨිකො හොති, පරඤ්ච මිච්ඡාදිට්ඨියා සමාදපෙති. -පෙ- අත්තනා ච මිච්ඡාඤාණී හොති, පරඤ්ච මිච්ඡාඤාණෙ සමාදපෙති. අත්තනා ච මිච්ඡාවිමුත්තී හොති, පරඤ්ච මිච්ඡාවිමුත්තියා සමාදපෙති. අයං වුච්චති භික්ඛවෙ අසප්පුරිසෙන අසප්පුරිසතරො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ සප්පුරිසො? ඉධ භික්ඛවෙ එකච්චො සම්මාදිට්ඨිකො හොති -පෙ- සම්මාඤාණී හොති. සම්මාවිමුත්තී හොති. අයං වුච්චති භික්ඛවෙ සප්පුරිසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ සප්පුරිසෙන සප්පුරිසතරො? ඉධ භික්ඛවෙ එකච්චො අත්තනා ච සම්මාදිට්ඨිකො හොති, පරඤ්ච සම්මාදිට්ඨියා සමාදපෙති -පෙ- අත්තනා ච සම්මාඤාණී හොති, පරඤ්ච සම්මාඤාණෙ සමාදපෙති. අත්තනා ච සම්මාවිමුත්තී හොති, පරඤ්ච සම්මාවිමුත්තියා සමාදපෙති. අයං වුච්චති භික්ඛවෙ සප්පුරිසෙන සප්පුරිසතරොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, සත්පුරුෂ කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් සම්‍යග්දෘෂ්ටික වෙයි. සම්‍යක්සඞ්කල්ප ඇතියේ වෙයි. සම්‍යග් වචන ඇතියේ වෙයි. සම්‍යක්කර්‍මාන්ත ඇතියේ වෙයි. සම්‍යග් ආජීව ඇතියේ වෙයි. සම්‍යග්ව්‍යායාම ඇතියේ වෙයි. සම්‍යක්ස්මෘති ඇතියේ වෙයි. සම්‍යක්සමාධි ඇතියේ වෙයි. මහණෙනි, මේ සත්පුරුෂය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සත්පුරුෂයාට වැඩි සිටි සත්පුරුෂතර කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තෙමේත් සම්‍යග්දෘෂ්ටික වේ. මෙරමාත් සම්‍යග්දෘෂ්ටියෙහි සමාදන් කරවයි. තෙමේත් සම්‍යක්සඞ්කල්ප ඇතියේ වෙයි. මෙරමාත් සම්‍යක්සඞ්කල්පයෙහි සමාදන් කරවයි. තෙමේත් සම්‍යග් වචන ඇතියේ වෙයි. මෙරමාත් සම්‍යග් වචනයෙහි සමාදන් කරවයි. තෙමේත් සම්‍යක් කර්‍මාන්ත ඇතියේ වෙයි.මෙරමාත් සම්‍යක්කර්‍මාන්තයෙහි සමාදන් කරවයි. තෙමේත් සම්‍යග් ආජීව ඇතියේ වෙයි. මෙරමාත් සම්‍යග් ආජීවයෙහි සමාදන් කරවයි. තෙමේත් සම්‍යග්ව්‍යායාම ඇතියේ වෙයි. මෙරමාත් සම්‍යග්ව්‍යායාමයෙහි සමාදන් කරවයි. තෙමේත් සම්‍යක් ස්මෘති ඇත්තේ වෙයි. මෙරමාත් සම්‍යක් ස්මෘතියෙහි සමාදන් කරවන්නේ වෙයි. තෙමේත් සම්‍යක් සමාධි ඇත්තේ වෙයි. මෙරමාත් සම්‍යක් සමාධියෙහි සමාදන් කරවයි. මහණෙනි, මේ සත්පුරුෂයාට වැඩි සිටි සත්පුරුෂතරය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.1.6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සවන සප්පුරිස සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "6. මහණෙනි, තොපට අසත්පුරුෂයා හා අසත්පුරුෂයාට වැඩි සිටි අසත්පුරුෂතරයා හා සත්පුරුෂයා හා සත්පුරුෂයාට වැඩි සිටි සත්පුරුෂතරයා හා දෙසමි. ඒ අසව…",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අසත්පුරුෂ කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් මිථ්‍යාදෘෂ්ටික වෙයි … මිථ්‍යාඥාන ඇත්තේ වෙයි. මිථ්‍යාවිමුක්ති ඇත්තේ වෙයි. මහණෙනි, මේ අසත්පුරුෂය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අසත්පුරුෂයාට වැඩි සිටි අසත්පුරුෂතර කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තෙමේත් මිසදිටු වෙයි. මෙරමාත් මිසදිටුයෙහි සමාදන් කරවයි ... තෙමේත් මිථ්‍යාඥාන ඇත්තේ වෙයි. මෙරමාත් මිථ්‍යාඥානයෙහි සමාදන් කරවයි. තෙමේත් මිථ්‍යාවිමුක්ති ඇත්තේ වෙයි. මෙරමාත් මිථ්‍යාවිමුක්තියෙහි සමාදන් කරවයි. මහණෙනි, මේ අසත්පුරුෂයාට වැඩිසිටි අසත්පුරුෂතරය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සත්පුරුෂ කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් සම්‍යග් දෘෂ්ටික වෙයි ... සම්‍යග්ඥාන ඇත්තේ වෙයි. සම්‍යග් විමුක්ති ඇත්තේ වෙයි. මහණෙනි, මේ සත්පුරුෂය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සත්පුරුෂයාට වැඩිසිටි සත්පුරුෂතර කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තෙමේත් සම්‍යග් දෘෂ්ටික වෙයි. මෙරමාත් සම්‍යග් දෘෂ්ටියෙහි සමාදන් කරවයි ... තෙමේත් සම්‍යග් ඥාන ඇත්තේ වෙයි. මෙරමාත් සම්‍යග්ඥානයෙහි සමාදන් කරවයි. තෙමේත් සම්‍යග් විමුක්ති ඇත්තේ වෙයි. මෙරමාත් සම්‍යග් විමුක්තියෙහි සමාදන් කරවයි. මහණෙනි, මේ සත්පුරුෂයාට වැඩිසිටි සත්පුරුෂතරය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 424,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 5. 1. 7",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පඨම පාප - කල්යාණසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "7. පාපඤ්ච වො භික්ඛවෙ දෙසිස්සාමි පාපෙන පාපතරඤ්ච කල්යාණඤ්ච කල්යාණෙන කල්යාණතරඤ්ච. තං සුණාථ -පෙ- භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පාපො? ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතී හොති. -පෙ- මිච්ඡාදිට්ඨිකො හොති. අයං වුච්චති භික්ඛවෙ පාපො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පාපෙන පාපතරො? ඉධ භික්ඛවෙ එකච්චො අත්තනා ච පාණාතිපාතී හොති. පරඤ්ච පාණාතිපාතෙ සමාදපෙති -පෙ- අත්තනා ච මිච්ඡාදිට්ඨිකො හොති, පරඤ්ච මිච්ඡා දිට්ඨියා සමාදපෙති. අයං වුච්චති භික්ඛවෙ පාපෙන පාපතරො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ කල්යාණො? ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතා පටිවිරතො හොති -පෙ- සම්මාදිට්ඨිකො හොති. අයං වුච්චති භික්ඛවෙ කල්යාණො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ කල්යාණෙන කල්යාණතරො? ඉධ භික්ඛවෙ එකච්චො අත්තනා ච පාණාතිපාතා පටිවිරතො හොති, පරඤ්ච පාණාතිපාතා වෙරමණියා සමාදපෙති -පෙ- අත්තනා ච සම්මාදිට්ඨිකො හොති, පරඤ්ච සම්මාදිට්ඨියා සමාදපෙති. අයං වුච්චති භික්ඛවෙ කල්යාණෙන කල්යාණතරොති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 1. 8",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(දුතිය පාප - කල්යාණසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "8. පාපඤ්ච වො භික්ඛවෙ දෙසිස්සාමි පාපෙන පාපතරඤ්ච කල්යාණඤ්ච කල්යාණෙන කල්යාණතරඤ්ච. තං සුණාථ -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පාපො? ඉධ භික්ඛවෙ එකච්චො මිච්ඡාදිට්ඨිකො හොති. මිච්ඡාසඞ්කප්පො හොති -පෙ- මිච්ඡාඤාණී හොති. මිච්ඡාවිමුත්තී හොති. අයං වුච්චති භික්ඛවෙ පාපො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පාපෙන පාපතරො? ඉධ භික්ඛවෙ එකච්චො අත්තනා ච මිච්ඡාදිට්ඨිකො හොති, පරඤ්ච මිච්ඡාදිට්ඨියා සමාදපෙති -පෙ- අත්තනා ච මිච්ඡාඤාණී හොති, පරඤ්ච මිච්ඡාඤාණෙ සමාදපෙති. අත්තනා ච මිචඡාවිමුත්තී හොති, පරඤ්ච මිච්ඡාවිමුත්තියා සමාදපෙති. අයං වුච්චති භික්ඛවෙ පාපෙන පාපතරො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ කල්යාණො? ඉධ භික්ඛවෙ එකච්චො සම්මාදිට්ඨිකො හොති -පෙ- සම්මාඤාණී හොති. සම්මාවිමුත්තී හොති. අයං වුච්චති භික්ඛවෙ කල්යාණො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.5.1.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පළමුවන පාප - කල්‍යාණ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "7. මහණෙනි, පාපයාත් පාපයාට වැඩිසිටි පාපතරයාත් කල්‍යාණයාත් කල්‍යාණයාට වැඩිසිටි කල්‍යාණතරයාත් දෙසමි. ඒ අසව ... භාග්‍යවතුන් වහන්සේ තෙල වදාළහ:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පාප නම් කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් පණිවා ඇත්තේ වෙයි ... මිසදිටුහ ඇත්තේ වෙයි. මහණෙනි, මේ පාප යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පාපයා කෙරෙන් වැඩි සිටි පාපතර නම් කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තෙමේත් පණිවා කරන්නේ වෙයි. මෙරමාත් පණිවායෙහි සමාදන් කරවයි ... තෙමේත් මිසදිටු ඇත්තේ වෙයි. මෙරමාත් මිසදිටුයෙහි සමාදන් කරවයි. මහණෙනි, මේ පාපයා කෙරෙන් වැඩිසිටි පාපතර යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කල්‍යාණ (භද්‍ර) කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් පණිවායෙන් දුරුවූයේ වෙයි ... සම්‍යග් දෘෂ්ටික වෙයි. මහණෙනි, මේ කල්‍යාණය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කල්‍යාණයාට වැඩි සිටි කල්‍යාණතර කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තෙමේත් පණිවායෙන් දුරුවූයේ වෙයි. මෙරමාත් පණිවායෙන් දුරු වීමෙහි සමාදන් කරවයි ... තෙමේත් සම්‍යග් දෘෂ්ටික වෙයි. මෙරමාත් සම්‍යග් දෘෂ්ටියෙහි සමාදන් කරවයි. මහණෙනි, මේ කල්‍යාණයාට වැඩි සිටි කල්‍යාණතරය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.1.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දෙවන පාප - කල්‍යාණ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "8. මහණෙනි, පාපයා ද පාපයාට වැඩිසිටි පාපතරයා ද කල්‍යාණයා ද කල්‍යාණයාට වැඩි සිටි කල්‍යාණතරයා ද දෙසමි. ඒ අසව …",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පාප කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් මිසදිටු වේ ... මිථ්‍යාඥාන ඇතියේ වේ. මිථ්‍යාවිමුක්ති ඇතියේ වේ. මහණෙනි, මේ පාප යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පාපයාට වැඩිසිටි පාපතර කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තෙමේත් මිථ්‍යාදෘෂ්ටික වෙයි. මෙරමාත් මිථ්‍යාදෘෂ්ටියෙහි සමාදන් කරවයි ... තෙමේත් මිථ්‍යාඥාන ඇත්තේ වෙයි. මෙරමාත් මිථ්‍යාඥානයෙහි සමාදන් කරවයි. තෙමේත් මිථ්‍යාවිමුක්ති ඇත්තේ වෙයි. මෙරමාත් මිථ්‍යාවිමුක්තියෙහි සමාදන් කරවන්නේ වෙයි. මහණෙනි, මේ පාපයා කෙරෙන් වැඩිසිටි පාපතරය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කල්‍යාණ නම් කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් සම්‍යග්දෘෂ්ටික වේ ... සම්‍යග් ඥාන ඇත්තේ වෙයි. සම්‍යග්විමුක්ති ඇත්තේ වෙයි. මහණෙනි, මේ කල්‍යාණය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 426,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමො භික්ඛවෙ කල්යාණෙන කල්යාණතරො? ඉධ භික්ඛවෙ එකච්චො අත්තනා ච සම්මාදිට්ඨිකො හොති. පරඤ්ච සම්මාදිට්ඨියා සමාදපෙති. -පෙ- අත්තනා ච සම්මාඤාණී හොති. පරඤ්ච සම්මාඤාණෙ සමාදපෙති. අත්තනා ච සම්මාවිමුත්තී හොති. පරඤ්ච සම්මාවිමුත්තියා සමාදපෙති. අයං වුච්චති භික්ඛවෙ කල්යාණෙන කල්යාණතරොති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 1. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පඨම පාපධම්ම - කල්යාණධම්ම සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "9. පාපධම්මඤ්ච වො භික්ඛවෙ දෙසිස්සාමි පාපධම්මෙන පාපධම්මතරඤ්ච කල්යාණධම්මඤ්ච කල්යාණධම්මෙන කල්යාණධම්මතරඤ්ච. තං සුණාථ -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පාපධම්මො? ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතී හොති -පෙ- මිච්ඡාදිට්ඨිකො හොති. අයං වුච්චති භික්ඛවෙ පාපධම්මො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පාපධම්මතරො? ඉධ භික්ඛවෙ, එකච්චො අත්තනා ච පාණාතිපාතී හොති. පරඤ්ච පාණාතිපාතෙ සමාදපෙති. -පෙ- අත්තනා ච මිච්ඡාදිට්ඨිකො හොති, පරඤ්ච මිච්ඡාදිට්ඨියා සමාදපෙති. අයං වුච්චති භික්ඛවෙ පාපධම්මෙන පාපධම්මතරො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ කල්යාණධම්මො? ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතා පටිවිරතො හොති. -පෙ- සම්මාදිට්ඨිකො හොති. අයං වුච්චති භික්ඛවෙ කල්යාණධම්මො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ කල්යාණධම්මෙන කල්යාණධම්මතරො? ඉධ භික්ඛවෙ එකච්චො අත්තනා ච පාණාතිපාතා පටිවිරතො හොති, පරඤ්ච පාණාතිපාතා වෙරමණියා සමාදපෙති -පෙ- අත්තනා ච සම්මාදිට්ඨිකො හොති, පරඤ්ච සම්මාදිට්ඨියා සමාදපෙති. අයං වුච්චති භික්ඛවෙ කල්යාණධම්මෙන කල්යාණධම්මතරොති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 1. 10",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(දුතිය පාපධම්ම - කල්යාණධම්ම සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "10. පාපධම්මඤ්ච වො භික්ඛවෙ දෙසිස්සාමි පාපධම්මෙන පාපධම්මතරඤ්ච කල්යාණධම්මඤ්ච කල්යාණධම්මෙන කල්යාණධම්මතරඤ්ච. තං සුණාථ -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පාපධම්මො? ඉධ භික්ඛවෙ එකච්චො මිච්ඡාදිට්ඨිකො හොති -පෙ- මිච්ඡාඤාණී හොති. මිච්ඡාවිමුත්තී හොති. අයං වුච්චති භික්ඛවෙ පාපධම්මො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කල්‍යාණයාට වඩා කල්‍යාණතර කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තෙමේත් සම්‍යග් දෘෂ්ටික වේ. මෙරමාත් සම්‍යග් දෘෂ්ටියෙහි සමාදන් කරවයි ... තෙමේත් සම්‍යග් ඥාන ඇත්තේ වෙයි. මෙරමාත් සම්‍යග් ඥානයෙහි සමාදන් කරවයි. තෙමේත් සම්‍යග් විමුක්ති ඇත්තේ වෙයි. මෙරමාත් සම්‍යග් විමුක්තියෙහි සමාදන් කරවයි. මහණෙනි, මේ කල්‍යාණයාට වඩා කල්‍යාණතරය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.1.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පළමුවන පාපධම්ම - කල්‍යාණධම්ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "9. මහණෙනි, පාපධර්‍මයා ද පාපධර්‍මයාට වැඩසිටි පාපධර්‍මතරයා ද කල්‍යාණධර්‍මයා ද කල්‍යාණධර්‍මයාට වැඩිසිටි කල්‍යාණධර්‍මතරයා ද දෙසමි. ඒ අසව …",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පාපධර්‍ම නම් කවරේය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් පණිවා කරන්නේ වෙයි ... මිථ්‍යාදෘෂ්ටික වෙයි. මහණෙනි, මේ පාපධර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පාපධර්‍මයා කෙරෙන් වැඩිසිටි පාපධර්‍මතර කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තෙමේත් පණිවා කරන්නේ වෙයි. මෙරමාත් පණිවා කිරීමෙහි සමාදන් කරවයි ... තෙමේත් මිථ්‍යාදෘෂ්ටික වෙයි. මෙරමාත් මිථ්‍යාදෘෂ්ටියෙහි සමාදන් කරවයි. මහණෙනි, මේ පාපධර්‍මයාට වඩා පාපධර්‍මතරය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කල්‍යාණධර්‍ම නම් කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් පණිවායෙන් දුරුවූයේ වෙයි ... සම්‍යග්දෘෂ්ටික වෙයි. මහණෙනි, මේ කල්‍යාණධර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කල්‍යාණධර්‍මයාට වැඩි සිටි කල්‍යාණධර්‍මතර කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගයෙක් තෙමේත් පණිවායෙන් දුරුවූයේ වෙයි. මෙරමාත් පණිවායෙන් දුරු වීමෙහි සමාදන් කරවයි ... තෙමේත් සම්‍යග් දෘෂ්ටික වෙයි. මෙරමාත් සම්‍යග් දෘෂ්ටියෙහි සමාදන් කරවයි. මහණෙනි, මේ කල්‍යාණධර්‍මයාට වඩා කල්‍යාණධර්‍මතරය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.1.10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දෙවන පාපධම්ම - කල්‍යාණධම්ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "10. මහණෙනි, පාපධර්‍මයා ද පාපධර්‍මයාට වැඩසිටි පාපධර්‍මතරයා ද කල්‍යාණධර්‍මයා ද කල්‍යාණධර්‍මයාට වැඩිසිටි කල්‍යාණධර්‍මතරයා ද දෙසමි. ඒ අසව …",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පාපධර්‍ම කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් මිථ්‍යාදෘෂ්ටික වෙයි ... මිථ්‍යාඥාන ඇත්තේ වෙයි. මිථ්‍යාවිමුක්ති ඇත්තේ වෙයි. මහණෙනි, මේ පාපධර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 428,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ පාපධම්මෙන පාපධම්මතරො? ඉධ භික්ඛවෙ එකච්චො අත්තනා ච මිච්ඡාදිට්ඨිකො හොති, පරඤ්ච මිච්ඡාදිට්ඨියා සමාදපෙති -පෙ- අත්තනා ච මිච්ඡාඤාණී හොති, පරඤ්ච මිච්ඡාඤාණෙ සමාදපෙති. අත්තනා ච මිචඡාවිමුත්තී හොති, පරඤ්ච මිච්ඡාවිමුත්තියා සමාදපෙති. අයං වුච්චති භික්ඛවෙ පාපධම්මෙන පාපධම්මතරො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ කල්යාණධම්මො? ඉධ භික්ඛවෙ එකච්චො සම්මාදිට්ඨිකො හොති -පෙ- සම්මාඤාණී හොති. සම්මාවිමුත්තී හොති. අයං වුච්චති භික්ඛවෙ කල්යාණධම්මො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ කල්යාණධම්මෙන කල්යාණධම්මතරො? ඉධ භික්ඛවෙ එකච්චො අත්තනා ච සම්මාදිට්ඨිකො හොති. පරඤ්ච සම්මාදිට්ඨියා සමාදපෙති. -පෙ- අත්තනා ච සම්මාඤාණී හොති, පරඤ්ච සම්මාඤාණෙ සමාදපෙති. අත්තනා ච සම්මාවිමුත්තී හොති, පරඤ්ච සම්මාවිමුත්තියා සමාදපෙති. අයං වුච්චති භික්ඛවෙ කල්යාණධම්මෙන කල්යාණධම්මතරොති."
                    },
                    {
                        "type": "centered",
                        "text": "සප්පුරිසවග්ගො පඨමො.{*}",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "*. **තස්සුද්දානං**: \nසික්ඛාපදඤ්ච අස්සද්ධං සත්තකම්මං අථො ච දසකම්මං \nඅට්ඨඞ්ගිකඤ්ච දසමග්ගං ද්වෙ පාපධම්මා අපරෙ ද්වෙති. - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, පාපධර්‍මයාට වැඩි සිටි පාපධර්‍මතරයා කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තෙමේත් මිථ්‍යාදෘෂ්ටික වෙයි. මෙරමාත් මිථ්‍යාදෘෂ්ටියෙහි සමාදන් කරවයි ... තෙමේත් මිථ්‍යාඥාන ඇත්තේ වෙයි. මෙරමාත් මිථ්‍යාඥානයෙහි සමාදන් කරවයි. තෙමේත් මිථ්‍යාවිමුක්ති ඇත්තේ වෙයි. මෙරමාත් මිථ්‍යාවිමුක්තියෙහි සමාදන් කරවයි. මහණෙනි, මේ පාපධර්‍මයාට වඩා පාපධර්‍මතරය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කල්‍යාණධර්‍ම නම් කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් සම්‍යග්දෘෂ්ටික වෙයි ... සම්‍යග්ඥාන ඇත්තේ වෙයි. සම්‍යග් විමුක්ති ඇත්තේ වෙයි. මහණෙනි, මේ කල්‍යාණධර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කල්‍යාණර්‍ධමයාට වැඩි සිටි කල්‍යාණධර්‍මතර කවරේ ය? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තෙමේත් සම්‍යග්දෘෂ්ටික වෙයි. මෙරමාත් සම්‍යග්දෘෂ්ටියෙහි සමාදන් කරවයි ... තෙමේත් සම්‍යග්ඥාන ඇත්තේ වෙයි. මෙරමාත් සම්‍යග්ඥානයෙහි සමාදන් කරවයි. තෙමේත් සම්‍යග්විමුක්ති ඇත්තේ වෙයි. මෙරමාත් සම්‍යග්විමුක්තියෙහි සමාදන් කරවයි. මහණෙනි, මේ කල්‍යාණධර්‍මයාට වඩා කල්‍යාණධර්‍මතරය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සත්පුරුෂ වර්‍ගය පළමුවැනි යි",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 430,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "2. පරිසසොභනවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 2. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පරිසසොභනසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "11. චත්තාරො’මෙ භික්ඛවෙ පරිසදූසනා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "භික්ඛු භික්ඛවෙ දුස්සීලො පාපධම්මො පරිසදූසනො. භික්ඛුනී භික්ඛවෙ දුස්සීලා පාපධම්මා පරිසදූසනා. උපාසකො භික්ඛවෙ දුස්සීලො පාපධම්මො පරිසදූසනො. උපාසිකා භික්ඛවෙ දුස්සීලා පාපධම්මා පරිසදූසනා. ඉමෙ ඛො භික්ඛවෙ චත්තාරො පරිසදුසනාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "චත්තාරොමෙ භික්ඛවෙ පරිසසොභනා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "භික්ඛූ භික්ඛවෙ සීලවා කල්යාණධම්මො පරිසසොභනො. භික්ඛුනී භික්ඛවෙ සීලවතී කල්යාණධම්මා පරිසසොභනා. උපාසකො භික්ඛවෙ සීලවා කල්යාණධම්මො පරිසසොභනො උපාසිකා භික්ඛවෙ සීලවතී කල්යාණධම්මා පරිසසොභනා. ඉමෙ ඛො භික්ඛවෙ චත්තාරො පරිසසොභනාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 2. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පඨම නිරය සග්ගනික්ඛිත්තසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "12. චතූහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ. කතමෙහි චතූහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "කායදුච්චරිතෙන, වචීදුච්චරිතෙන, මනොදුච්චරිතෙන, මිච්ඡාදිට්ඨියා. ඉමෙහි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතූහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙ. කතමෙහි චතූහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "කායසුචරිතෙන, වචීසුචරිතෙන, මනොසුචරිතෙන, සම්මාදිට්ඨියා, ඉමෙහි ඛො භික්ඛවෙ චතූහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "2. පරිසසෝභන වර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4.5.2.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරිසසෝභන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "11. මහණෙනි, මේ පරිසදූසනයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, දුශ්ශීල වූ පාපධර්‍ම වූ මහණ පිරිස් කෙලෙසන්නේ වෙයි. මහණෙනි, දුශ්ශීල වූ පාපධර්‍ම වූ මෙහෙණ පිරිස් කෙලෙසන්නී වෙයි. මහණෙනි, දුශ්ශීල වූ පාපධර්‍ම වූ උවසු පිරිස් කෙලෙසන්නේ වෙයි. මහණෙනි, දුශ්ශීල වූ පාපධර්‍ම වූ උවැසි පිරිස් කෙලෙසන්නී වෙයි. මහණෙනි, මේ සතර පරිසදූසනයෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පරිසසෝභනයෝ සතර දෙනෙකි. කවර සතර දෙනක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සිල්වත් කලණදහම් ඇති මහණ පිරිස් හොබවන්නේ වෙයි. මහණෙනි, සිල්වත් කලණදහම් ඇති මෙහෙණ පිරිස් හොබවන්නී වෙයි. මහණෙනි, සිල්වත් කලණදහම් ඇති උවසු පිරිස් හොබවන්නේ වෙයි. මහණෙනි, සිල්වත් කලණදහම් ඇති උවැසි පිරිස් හොබවන්නී වෙයි. මහණෙනි, මේ සතර පරිසසෝභනයෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.2.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පළමුවන නිරය - සග්ග නික්ඛිත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "12. මහණෙනි, දහම් සතරෙකින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දක් සෙයින් නිරයෙහි නිඃක්‍ෂිප්ත වෙයි. කවර සතරෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "කායදුශ්චරිතයෙන, වාග්දුශ්චරිතයෙන, මනෝදුශ්චරිතයෙන, මිථ්‍යා දෘෂ්ටියෙන. මහණෙනි, මේ දහම් සතරින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දක් සෙයින් නිරයෙහි බැහෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කරුණු සතරෙකින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දක් සෙයින් ස්වර්‍ගයෙහි සිටුනේ ය. කවර සතර කරුණෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "කායසුචරිතයෙන,වාක්සුචරිතයෙන,මනඃසුචරිතයෙන, සම්‍යග්දෘෂ්ටියෙන. මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දක් සෙයින් ස්වර්‍ගයෙහි සිටුනේ ය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 432,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 5. 2. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(දුතිය නිරය-සග්ග නික්ඛිත්තසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "13. චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ. කතමෙහි චතූහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "කායදුච්චරිතෙන, වචීදුච්චරිතෙන, මනොදුච්චරිතෙන, අකතඤ්ඤුතා අකතවෙදිතා. ඉමෙහි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතූහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙ. කතමෙහි චතූහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "කායසුචරිතෙන, වචීසුචරිතෙන, මනොසුචරිතෙන, කතඤ්ඤුතා කතවෙදිතා. ඉමෙහි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 2. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(තතිය නිරය-සග්ග නික්ඛිත්ත සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "14. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "පාණාතිපාතී හොති. අදින්නාදායී හොති. කාමෙසු මිච්ඡාචාරී හොති. මුසාවාදී හොති. -පෙ- (යථාභතං නික්ඛිත්තො එවං නිරයෙති. )"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "පාණාතිපාතා පටිවිරතො හොති. අදින්නාදානා පටිවිරතො හොති. කාමෙසු මිච්ඡාචාරා පටිවිරතො හොති. මුසාවාදා පටිවිරතො හොති -පෙ- (යථාභතං නික්ඛිත්තො එවං සග්ගෙති. )"
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 2. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(චතුත්ථ නිරය-සග්ග නික්ඛිත්ත සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "15. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාදිට්ඨිකො හොති. මිච්ඡාසඞ්කප්පො හොති. මිච්ඡාවාචො හොති. මිච්ඡාකම්මන්තො හොති -පෙ- (යථාභතං නික්ඛිත්තො එවං නිරයෙති.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "සම්මාදිට්ඨිකො හොති. සම්මාසඞ්කප්පො හොති. සම්මාවාචො හොති. සම්මාකම්මන්තො හොති. -පෙ- (යථාභතං නික්ඛිත්තො එවං සග්ගෙති. )"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.5.2.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දෙවන නිරය - සග්ග නික්ඛිත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "13. මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දක් සෙයින් නිරයෙහි වේ. කවර සතර කරුණෙන යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "කායදුශ්චරිතයෙන, වාග්දුශ්චරිතයෙන, මනෝදුශ්චරිතයෙන, අකෘතඥතා - අකෘතවේදිතායෙන. මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දක් සෙයින් නිරයෙහි බහා තැබුනේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දේ යම් සේ ද එපරිදි ස්වර්‍ගයෙහි වේ. කවර සතර කරුණෙන යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "කායසුචරිතයෙන,වාක්සුචරිතයෙන,මනඃසුචරිතයෙන, කෘතඥතා-කෘතවෙදිතායෙන. මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දේ යම්සේ ද එපරිදි ස්වර්‍ගයෙහි වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.2.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තෙවන නිරය - සග්ග නික්ඛිත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "14. [මහණෙනි, දහම් සතරෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "පණිවා කරන්නේ වෙයි. අයිනාදන් ගන්නේ වෙයි. කාමයෙහි මිසහසර ඇතියේ වෙයි. මුසවා බණන්නේ වෙයි ... [ ගෙණවුත් බහා තබන ලද්දක් සෙයින් නිරයෙහි බැහෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, දහම් සතරෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "පණිවායෙන් දුරුවූයේ වෙයි. අයිනාදනින් දුරුවූයේ වෙයි. කාමයෙහි මිසහසරින් දුරුවූයේ වෙයි. මුසවායෙන් දුරුවූයේ වෙයි. ... [ගෙණවුත් බහා තබන ලද්දක් සෙයින් ස්වර්‍ගයෙහි වෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.2.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සිවුවන නිරය - සග්ග නික්ඛිත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "15. [මහණෙනි, දහම් සතරෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "මිසදිටු ඇතියේ වෙයි. මිථ්‍යාසඞ්කල්ප ඇතියේ වෙයි. මිථ්‍යාවචන ඇතියේ වෙයි. මිථ්‍යාකර්‍මාන්ත ඇතියේ වෙයි … [ගෙණවුත් බහා තබන ලද්දක් සෙයින් නිරයෙහි බැහෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, දහම් සතරෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "සම්‍යග්දෘෂ්ටි ඇත්තේ වෙයි. සම්‍යක්සඞ්කල්ප ඇතියේ වෙයි. සම්‍යග්වචන ඇත්තේ වෙයි. සම්‍යක්කර්‍මාන්ත ඇත්තේ වෙයි ... [ගෙණවුත් බහා තබන ලද්දක් සෙයින් ස්වර්‍ගයෙහි වෙයි.]",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 434,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 5. 2. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පඤ්චම නිරය - සග්ග නික්ඛිත්ත සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "16. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාආජීවො හොති. මිච්ඡාවායාමො හොති. මිච්ඡාසති හොති. මිච්ඡාසමාධී හොති. -පෙ- (යථාභතං නික්ඛිත්තො එවං නිරයෙති.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතූහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "සම්මාආජීවො හොති. සම්මාවායාමො හොති. සම්මාසතී හොති. සම්මාසමාධී හොති -පෙ- (යථාභතං නික්ඛිත්තො එවං සග්ගෙති. )"
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 2. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ඡට්ඨම නිරය - සග්ග නික්ඛිත්ත සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "17. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අදිට්ඨෙ දිට්ඨවාදී හොති. අසුතෙ සුතවාදී හොති. අමුතෙ මුතවාදී හොති. අවිඤ්ඤාතෙ විඤ්ඤාතවාදී හොති -පෙ- (යථාභතං නික්ඛිත්තො එවං නිරයෙති.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතූහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අදිට්ඨෙ අදිට්ඨවාදී හොති. අසුතෙ අසුතවාදී හොති. අමුතෙ අමුතවාදී හොති. අවිඤ්ඤාතෙ අවිඤ්ඤාතවාදී හොති -පෙ- (යථාභතං නික්ඛිත්තො එවං සග්ගොති. )"
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 2. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සත්තම නිරය - සග්ග නික්ඛි ත්ත සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "18. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "දිට්ඨෙ අදිට්ඨවාදී හොති. සුතෙ අසුතවාදී හොති. මුතෙ අමුතවාදී හොති. විඤ්ඤාතෙ අවිඤ්ඤාතවාදී හොති -පෙ- ( යථාභතං නික්ඛිත්තො එවං නිරයෙති.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ- )"
                    },
                    {
                        "type": "paragraph",
                        "text": "දිට්ඨෙ දිට්ඨවාදී හොති. සුතෙ සුතවාදී හොති. මුතෙ මුතවාදී හොති. විඤ්ඤාතෙ විඤ්ඤාතවාදී හොති -පෙ- (යථාභතං නික්ඛිත්තො එවං සග්ගෙති. )"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.5.2.6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පස්වන නිරය - සග්ග නික්ඛිත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "16. [මහණෙනි, දහම් සතරෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "මිථ්‍යාජීව ඇතියේ වෙයි. මිථ්‍යා ව්‍යායාම ඇතියේ වෙයි. මිථ්‍යාස්මෘති ඇතියේ වෙයි. මිථ්‍යාසමාධි ඇතියේ වෙයි … [ගෙණවුත් බහා තබන ලද්දක් සෙයින් නිරයෙහි බැහෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, දහම් සතරෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "සම්‍යග් ආජීව ඇතියේ වෙයි. සම්‍යග්ව්‍යායාම ඇතියේ වෙයි. සම්‍යක්ස්මෘති ඇතියේ වෙයි. සම්‍යක්සමාධි ඇතියේ වෙයි ... [ගෙණවුත් බහා තබන ලද්දක් සෙයින් ස්වර්‍ගයෙහි වෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.2.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සවන නිරය - සග්ග නික්ඛිත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "17. [මහණෙනි, දහම් සතරෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "නොදුටු රූපායතනයෙහි දෘෂ්ටවාද ඇත්තේ වෙයි. නොඇසූ ශබ්දායතනයෙහි ශ්‍රැතවාද ඇත්තේ වෙයි. එයින් සෙසු අමුත-ආයතනයෙහි මුතවාද ඇත්තේ වෙයි. අවිඥාතධර්‍මයෙහි විඥාතවාද ඇත්තේ වෙයි … [ගෙණවුත් බහා තබන ලද්දක් සෙයින් නිරයෙහි බැහෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[ මහණෙනි, දහම් සතරෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "නොදුටු රූපායතනයෙහි අදෘෂ්ටවාද ඇත්තේ වෙයි. නොඇසූ ශබ්දායතනයෙහි අශ්‍රැතවාද ඇතියේ වෙයි. එයින් සෙසු අමුත-ආයතනයෙහි අමුතවාද ඇතියේ වෙයි. අවිඥාතධර්‍මයෙහි අවිඥාතවාද ඇත්තේ වෙයි ... [ගෙණවුත් බහා තබන ලද්දක් සෙයින් ස්වර්‍ගයෙහි වෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.2.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සත්‍වන නිරය - සග්ග නික්ඛිත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "18. [මහණෙනි, දහම් සතරෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "දෘෂ්ටායතනයෙහි අදෘෂ්ටවාද ඇත්තේ වෙයි. ශ්‍රැතායතනයෙහි අශ්‍රැතවාද ඇත්තේ වෙයි. මුතායතනයෙහි අමුතවාද ඇත්තේ වෙයි. විඥාතආයතනයෙහි අවිඥාතවාද ඇත්තේ වෙයි … [ගෙණවුත් බහා තබන ලද්දක් සෙයින් නිරයෙහි බැහෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, දහම් සතරෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "දෘෂ්ටායතනයෙහි දෘෂ්ටවාද ඇත්තේ වෙයි. ශ්‍රැතායතනයෙහි ශ්‍රැතවාද ඇත්තේ වෙයි. මුතායතනයෙහි මුතවාද ඇත්තේ වෙයි. විඥාතධර්‍මයෙහි වඥාතවාද ඇත්තේ වෙයි … [ගෙණවුත් බහා තබන ලද්දක් සෙයින් ස්වර්‍ගයෙහි වෙයි.]",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 436,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 5. 2. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අට්ඨම නිරය-සග්ග නික්ඛිත්ත සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "19. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අස්සද්ධො හොති. දුස්සීලො හොති. අහිරිකො හොති. අනොත්තප්පී හොති -පෙ- (යථාභතං නික්ඛිත්තො එවං නිරයෙති.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතූහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "සද්ධො හොති. සීලවා හොති. හිරිමා හොති. ඔත්තප්පී හොති -පෙ- (යථාභතං නික්ඛිත්තො එවං සග්ගෙති.)"
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 2. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(නවම නිරය-සග්ග නික්ඛිත්ත සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "20. චතූහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ. කතමෙහි චතූහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අස්සද්ධො හොති. දුස්සීලො හොති. කුසීතො හොති. දුප්පඤ්ඤො හොති. ඉමෙහි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙ. කතමෙහි චතූහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සද්ධො හොති. සීලවා හොති. ආරද්ධවිරියො හොති. පඤ්ඤවා හොති. ඉමෙහි ඛො භික්ඛවෙ චතූහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙති."
                    },
                    {
                        "type": "centered",
                        "text": "පරිසසොභනවග්ගො දුතියො.{*}",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "*. තස්සුද්දානං:\nපරිසා දිට්ඨි අකතඤ්ඤුතා පාණාතිපාතාපි ද්වෙ මග්ගා\nද්වෙ වොහාරකථා වුත්තා අහිරිකං දුප්පඤ්ඤෙන වාති මඡසං. - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.5.2.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අටවැනි නිරය - සග්ග නික්ඛිත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "19. [මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ …]",
                        "type": "paragraph"
                    },
                    {
                        "text": "සැදැහැ නැතියේ වෙයි. සිල් නැතියේ වෙයි. පවට ලජ්ජා නැතියේ වෙයි. පවට බිය නැතියේ වෙයි ... [ගෙණවුත් බහා තබන ලද්දක් සෙයින් නිරයෙහි වැටුනේ වෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ … ]",
                        "type": "paragraph"
                    },
                    {
                        "text": "සැදැහැ ඇතියේ වෙයි. සිල් ඇතියේ වෙයි. පවට ලජ්ජා ඇතියේ වෙයි. පවට බිය ඇතියේ වෙයි … [ගෙණවුත් බහා තබන ලද්ලක් සෙයින් ස්වර්‍ගයෙහි සිටුනේ වේ.]",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.2.10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නවවැනි නිරය - සග්ග නික්ඛිත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "20. මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දක් සෙයින් නිරයෙහි වැටුනේ වේ. කවර සතර කරුණින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සැදැහැ නැතියේ වෙයි. සිල් නැතියේ වෙයි. කුසීත වෙයි. අප්‍රාඥ වෙයි. මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දක් සෙයින් නිරයෙහි වැටුනේ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දක් සෙයින් ස්වර්‍ගයෙහි සිටුනේ වේ. කවර සතර කරුණකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සැදැහැ ඇතියේ වෙයි. සිල් ඇතියේ වෙයි. ඇරඹූ වැර ඇතියේ වෙයි. පැණ ඇතියේ වෙයි. මහණෙනි, මේ සිවු කරුණින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දක් සෙයින් ස්වර්‍ගයෙහි සිටුනේ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පරිසෝභන වර්‍ගය දෙවැනි යි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 438,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. සුචරිතවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 3. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(වචීසුචරිතසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "21. චත්තාරිමානි භික්ඛවෙ වචීදුච්චරිතානි. කතමානි චත්තාරි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "මුසාවාදො, පිසුණාවාචා, ඵරුසාවාචා, සම්ඵප්පලාපො. ඉමානි ඛො භික්ඛවෙ චත්තාරි වචීදුච්චරිතානි."
                    },
                    {
                        "type": "paragraph",
                        "text": "චත්තාරිමානි භික්ඛවෙ වචීසුචරිතානි. කතමානි චත්තාරි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සච්චවාචා, අපිසුණාවාචා, සණ්හවාචා, මත්තාභස්සං. ඉමානි ඛො භික්ඛවෙ චත්තාරි වචීසුචරිතානි."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 3. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පඨම බාල-පණ්ඩිතසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "22. චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො බාලො අබ්යත්තො, අසප්පුරිසො ඛතං උපහතං අත්තානං පරිහරති. සාවජ්ජො ච හොති සානුවජ්ජො විඤ්ඤූනං. බහුඤ්ච අපුඤ්ඤං පසවති. කතමෙහි චතූහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "කායදුච්චරිතෙන, වචීදුච්චරිතෙන, මනොදුච්චරිතෙන, මිච්ඡාදිට්ඨියා. ඉමෙහි ඛො භික්ඛවෙ චතූහි ධම්මෙහි සමන්නාගතො බාලො අබ්යත්තො අසප්පුරිසො ඛතං උපහතං අත්තානං පරිහරති. සාවජ්ජො ච හොති සානුවජ්ජො විඤ්ඤූනං. බහුඤ්ච අපුඤ්ඤං පසවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො පණ්ඩිතො බ්යත්තො සප්පුරිසො අක්ඛතං අනුපහතං අත්තානං පරිහරති. අනවජ්ජො ච හොති. අනනුවජ්ජො විඤ්ඤූනං. බහුඤ්ච පුඤ්ඤං පසවති. කතමෙහි චතුහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "කායසුචරිතෙන, වචීසුචරිතෙන, මනොසුචරිතෙන, සම්මාදිට්ඨියා. ඉමෙහි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො පණ්ඩිතො බ්යත්තො සප්පුරිසො අක්ඛතං අනුපහතං අත්තානං පරිහරති. අනවජ්ජො ච හොති අනනුවජ්ජො විඤ්ඤූනං. බහුඤ්ච පුඤ්ඤං පසවතීති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "3. සුචරිත වර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4.5.3.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "වචීසුචරිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත් නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "21. මහණෙනි, මේ වාග්දුශ්චරිතයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මුසවා ය, පිසුනුබස් ය, පරොස්බස් ය, පලප් යි. මහණෙනි, මේ සතර වාග්දුශ්චරිතයෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ වාක්සුචරිතයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සබවස ය, නො පිසුනුබස ය, මොළොක්බස ය, පමණ දැන බණන බස් යී. මහණෙනි, මේ සතර වාක්සුචරිතයෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.3.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ප්‍රථම බාල - පණ්ඩිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "22. මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූ අඥ වූ අව්‍යක්ත වූ අසත්පුරුෂ තෙමේ ගුණ විසින් සාළ (සාරා ලූ) ගුණ විසින් නට, ආත්මයක් පරිහරණය කෙරෙයි. සාවද්‍ය ද වෙයි. නුවණැතියන් විසින් උපවාද කටයුතු ද වෙයි. බොහෝ අකුසල් ද ප්‍රසව කෙරෙයි. කවර සතර කරුණින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "කායදුශ්චරිතයෙන, වාග්දුශ්චරිතයෙන, මනෝදුශ්චරිතයෙන්, මිථ්‍යාදෘෂ්ටියෙන. මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත වූ බාල වූ අව්‍යක්ත වූ අසත්පුරුෂ තෙමේ ගුණ විසින් සාළ, ගුණ විසින් නට ආත්මයක් පරිහරණය කෙරෙයි සාවද්‍ය ද වෙයි. නුවණැතියන් විසින් උපවාද කටයුතු ද වෙයි. බොහෝ අකුසල් ද රැස් කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූ පණ්ඩිත වූ ව්‍යක්ත වූ සත්පුරුෂ තෙමේ ගුණ විසින් නො සාළ, එයින් නො නට ආත්මයක් පස්වැටුම් කෙරෙයි. අනවද්‍ය ද වෙයි. නුවණැතියන් විසින් උපවාද නො කටයුතු ද වෙයි. බොහෝ පින් ද රැස් කෙරෙයි. කවර සතර කරුණින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "කායසුචරිතයෙන, වාක්සුචරිතයෙන, මනඃසුචරිතයෙන, සම්‍යග්දෘෂ්ටියෙන. මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත වූ පණ්ඩිත වූ ව්‍යක්ත වූ සත්පුරුෂ තෙමේ ගුණ විසින් නො සාළ, එයින් නො නට ආත්මයක් පස්වටයි. අනවද්‍ය ද වෙයි. නුවණැතියන් විසින් උපවාද නො කටයුතු ද වෙයි. බොහෝ පින් ද රැස් කෙරෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 440,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 5. 3. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(දුතිය බාල - පණ්ඩිත සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "23. චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො බාලො අබ්යත්තො අසප්පුරිසො ඛතං උපහතං අත්තානං පරිහරති, සාවජ්ජො ච හොති සානුවජ්ජො විඤ්ඤූනං. බහුඤ්ච අපුඤ්ඤං පසවති. කතමෙහි චතූහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "කායදුච්චරිතෙන, වචීදුච්චරිතෙන, මනොදුච්චරිතෙන, අකතඤ්ඤුතා අකතවෙදිතාය. (ඉමෙහි -පෙ- අසප්පුරිසො -පෙ- බහුඤ්ච අපුඤ්ඤං පසවති.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ- සප්පුරිසො -පෙ- )"
                    },
                    {
                        "type": "paragraph",
                        "text": "කායසුචරිතෙන, වචීසුචරිතෙන, මනොසුචරිතෙන, කතඤ්ඤුතා කතවෙදිතාය. (ඉමෙහි -පෙ- බහුඤ්ච පුඤ්ඤං පසවතී ති. )"
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 3. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(තතිය බාල .. පණ්ඩිත සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "24. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ- අසප්පුරිසො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "පාණාතිපාතී හොති. අදින්නාදායී හොති. කාමෙසු මිච්ඡාචාරී හොති. මුසාවාදී හොති. (ඉමෙහි -පෙ- බහුඤ්ච අපුඤ්ඤං පසවති.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ- සප්පුරිසො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "පාණාතිපාතා පටිවිරතො හොති. අදින්නාදානා පටිවිරතො හොති. කාමෙසු මිච්ඡාචාරා පටිවිරතො හොති. මුසාවාදා පටිවිරතො හොති. (ඉමෙහි -පෙ- බහුඤ්ච පුඤ්ඤං පසවතීති. )"
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 3. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(චතුත්ථ බාල - පණ්ඩිත සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "25. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ- අසප්පුරිසො -පෙ- )"
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාදිට්ඨිකො හොති. මිච්ඡාසඞ්කප්පො හොති. මිච්ඡාවාචො හොති. මිච්ඡාකම්මන්තො හොති. (ඉමෙහි -පෙ- බහුඤ්ච අපුඤ්ඤං පසවති.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ- සප්පුරිසො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "සම්මාදිට්ඨිකො හොති. සම්මාසඞ්කප්පො හොති. සම්මාවාචො හොති. සම්මාකම්මන්තො හොති. (ඉමෙහි -පෙ- බහුඤ්ච පුඤ්ඤං පසවතීති. )"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.5.3.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දෙවන බාල - පණ්ඩිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "23. මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූ බාල වූ අව්‍යක්ත වූ අසත්පුරුෂ තෙමේ ගුණ විසින් සාරා දමන ලද, ගුණ විසින් නට ආත්මයක් පරිහරකය කෙරෙයි. සාවද්‍ය ද වෙයි. නුවණැතියන් විසින් උපවාද කටයුතු ද වෙයි. බොහෝ අකුසල් ද රැස් කෙරෙයි. කවර සතරෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "කායදුශ්චරිතයෙන, වාක්දුශ්චරිතයෙන, මනෝදුශ්චරිතයෙන්, අකෘතඥතා-අකෘතවේදිතායෙන. [මේ සතර කරුණින් ... බොහෝ අකුසල් ද රැස් කෙරෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත ... සත්පුරුෂ තෙමේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "කායසුචරිතයෙන, වාක්සුචරිතයෙන, මනඃසුචරිතයෙන, කෘතඥතා-කෘතවෙදිතායෙන. [මේ සතර කරුණින් ... බොහෝ පින් ද රැස් කෙරෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.3.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තෙවන බාල - පණ්ඩිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "24. [මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත ... අසත්පුරුෂ තෙමේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "පණිවා කරන්නේ වෙයි. අයිනාදන් ගන්නේ වෙයි.කාමයෙහි මිසහසර ඇතියේ වෙයි. මුසවා බණන්නේ වෙයි. [මේ සතර කරුණින් බොහෝ අකුසල් ද රැස් කෙරෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත ... සත්පුරුෂ තෙමේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "පණිවායෙන් දුරු වූයේ වෙයි. අයිනාදනින් දුරු වූයේ වෙයි. කාමයෙහි මිසහසරින් දුරු වූයේ වෙයි. මුසවායෙන් දුරු වූයේ වෙයි. [මේ සතර කරුණින් බොහෝ කුසල් ද රැස් කෙරෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.3.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සිවුවන බාල - පණ්ඩිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "25. [මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත ... අසත්පුරුෂ තෙමේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "මිසදිටු ඇත්තේ වෙයි. මිථ්‍යාසඞ්කල්ප ඇත්තේ වෙයි. මිථ්‍යාවචන ඇත්තේ වෙයි. මිථ්‍යා කර්‍මාන්ත ඇත්තේ වෙයි. [මේ සතර කරුණින් ... බොහෝ අකුසල් ද රැස් කෙරෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත ... සත්පුරුෂ තෙමේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "සම්‍යග් දෘෂ්ටික වෙයි. සම්‍යක් සඞ්කල්ප ඇතියේ වෙයි. සම්‍යග් වචන ඇතියේ වෙයි. සම්‍යක් කර්‍මාන්ත ඇතියේ වෙයි. [මේ සතර කරුණින් ... බොහෝ කුසල් ද රැස් කෙරෙයි.]",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 442,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 5. 3. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පඤ්චම බාල - පණ්ඩිත සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "26. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ- අසප්පුරිසො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "මිච්ඡාආජීවො හොති. මිච්ඡාවායාමො හොති. මිච්ඡාසතී හොති. මිච්ඡාසමාධී හොති. (ඉමෙහි -පෙ- බහුඤ්ච අපුඤ්ඤං පසවති. )"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ- සප්පුරිසො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "සම්මාආජීවො හොති. සම්මාවායාමො හොති. සම්මාසතී හොති. සම්මාසමාධී හොති. (ඉමෙහි -පෙ- බහුඤ්ච පුඤ්ඤං පසවතීති. )"
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 3. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ඡට්ඨ බාල - පණ්ඩිත සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "27. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ- අසප්පුරිසො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අදිට්ඨෙ දිට්ඨවාදී හොති. අසුතෙ සුතවාදී හොති. අමුතෙ මුතවාදී හොති. අවිඤ්ඤාතෙ විඤ්ඤාතවාදී හොති. (ඉමෙහි -පෙ- බහුඤ්ච අපුඤ්ඤං පසවති. )"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ- සප්පුරිසො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අදිට්ඨෙ අදිට්ඨවාදී හොති. අසුතෙ අසුතවාදී හොති. අමුතෙ අමුතවාදී හොති. අවිඤ්ඤාතෙ අවිඤ්ඤාතවාදී හොති. (ඉමෙහි -පෙ- බහුඤ්ච පුඤ්ඤං පසවතීති. )"
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 3. 8",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සත්තම බාල - පණ්ඩිත සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "28. (චතූහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ- අසප්පුරිසො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "දිට්ඨෙ අදිට්ඨවාදී හොති. සුතෙ අසුතවාදී හොති. මුතෙ අමුතවාදී හොති. විඤ්ඤාතෙ අවිඤ්ඤාතවාදී හොති. (ඉමෙහි -පෙ- බහුඤ්ච අපුඤ්ඤං පසවති. )"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ- සප්පුරිසො -පෙ- )"
                    },
                    {
                        "type": "paragraph",
                        "text": "දිට්ඨෙ දිට්ඨවාදී හොති. සුතෙ සුතවාදී හොති. මුතෙ මුතවාදී හොති. විඤ්ඤාතෙ විඤ්ඤාතවාදී හොති. (ඉමෙහි -පෙ- බහුඤ්ච පුඤ්ඤං පසවතීති. )"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.5.3.6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පස්වන බාල - පණ්ඩිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "26. [මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත ... අසත්පුරුෂ තෙමේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "මිථ්‍යා ආජීව ඇතියේ වෙයි. මිථ්‍යා ව්‍යායාම ඇතියේ වෙයි. මිථ්‍යාස්මෘති ඇතියේ වෙයි. මිථ්‍යාසමාධි ඇතියේ වෙයි. [මේ සතර කරුණින් ... බොහෝ අකුසල් ද රැස් කෙරෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත ... සත්පුරුෂ තෙමේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "සම්‍යග් ආජීව ඇතියේ වෙයි. සම්‍යග් ව්‍යායාම ඇතියේ වෙයි. සම්‍යක් ස්මෘති ඇතියේ වෙයි. සම්‍යක් සමාධි ඇතියේ වෙයි. [මේ සතර කරුණින් ... බොහෝ කුසල් ද රැස් කෙරෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.3.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සවන බාල - පණ්ඩිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "27. [මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත ... අසත්පුරුෂ තෙමේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "අදෘෂ්ට ආලම්බනයෙහි දෘෂ්ටවාදී වෙයි. අශ්‍රැත ආලම්බනයෙහි ශ්‍රැතවාදී වෙයි. අමුත ආලම්බනයෙහි මුතවාදී වෙයි. අවිඥාත ආලම්බනයෙහි විඥාතවාදී වෙයි. [මේ සතර කරුණින් ... බොහෝ අකුසල් ද රැස් කෙරෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, මේ සතර කරුණෙකින් සමන්‍වාගත ... සත්පුරුෂ තෙමේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "අදෘෂ්ට ආලම්බනයෙහි අදෘෂ්ටවාදී වෙයි. අශ්‍රැත ආලම්බනයෙහි අශ්‍රැතවාදී වෙයි. අමුත ආලම්බනයෙහි අමුතවාදී වෙයි. අවිඥාත ආලම්බනයෙහි අවිඥතවාදී වෙයි. [මේ සතර කරුණින් ... බොහෝ කුසල් ද රැස් කෙරෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.3.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සත්‍වන බාල - පණ්ඩිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "28. [මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත ... අසත්පුරුෂ තෙමේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "දෘෂ්ටාලම්බනයෙහි අදෘෂ්ටවාදී වෙයි. ශ්‍රැතාලම්බනයෙහි අශ්‍රැතවාදී වෙයි. මුතාලම්බනයෙහි අමුතවාදී වෙයි. විඥාතාලම්බනයෙහි අවිඥාතවාදී වෙයි. [මේ සතර කරුණෙන් ... බොහෝ අකුසල් ද රැස් කෙරෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත ... සත්පුරුෂ තෙමේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "දෘෂ්ටාලම්බනයෙහි දෘෂ්ටවාදී වෙයි. ශ්‍රැතාලම්බනයෙහි ශ්‍රැතවාදී වෙයි. මුතාලම්බනයෙහි මුතවාදී වෙයි. විඥාතාලම්බනයෙහි විඥාතවාදී වෙයි. [මේ සතර කරුණෙන් ... බොහෝ කුසල් ද රැස් කෙරෙයි.]",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 444,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 5. 3. 9",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අට්ඨම බාල - පණ්ඩිත සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "29. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ- අසප්පුරිසො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අස්සද්ධො හොති, දුස්සීලො හොති. අහිරිකො හොති. අනොත්තප්පී හොති. (ඉමෙහි -පෙ- බහුඤ්ච අපුඤ්ඤං පසවති. )"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතූහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ- සප්පුරිසො -පෙ- )"
                    },
                    {
                        "type": "paragraph",
                        "text": "සද්ධො හොති. සීලවා හොති. හිරිමා හොති. ඔත්තප්පී හොති. (ඉමෙහි -පෙ- බහුඤ්ච පුඤ්ඤං පසවතීති. )"
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 3. 10",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(නවම බාල - පණ්ඩිත සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "30. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ- අසප්පුරිසො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අස්සද්ධො හොති. දුස්සිලො හොති. කුසීතො හොති. දුප්පඤ්ඤො හොති. (ඉමෙහි -පෙ- බහුඤ්ච අපුඤ්ඤං පසවති.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ- සප්පුරිසො -පෙ- )"
                    },
                    {
                        "type": "paragraph",
                        "text": "සද්ධො හොති. සීලවා හොති. ආරද්ධවිරියො හොති. පඤ්ඤවා හොති. ඉමෙහි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො පණ්ඩිතො බ්යත්තො සප්පුරිසො අක්ඛතං අනුපහතං අත්තානං පරිහරති. අනවජ්ජො ච හොති. අනනුවජ්ජො විඤ්ඤූනං. බහුඤ්ච පුඤ්ඤං පසවතීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 3. 11",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(කවිසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "31. චත්තාරොමෙ භික්ඛවෙ කවී. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "චින්තාකවි, සුතකවි, අත්ථකවි, පටිභානකවි. ඉමෙ ඛො භික්ඛවෙ චත්තාරො කවීති."
                    },
                    {
                        "type": "centered",
                        "text": "සුචරිතවග්ගො තතියො.{*}",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "*. **තස්සුද්දානං**:\nදුච්චරිතං දිට්ඨි අකතඤ්ඤූ ච පාණාතිපාතාපි ද්වෙ මග්ගා, \nද්වෙ වොහාරකථා වුත්තා අහිරිකං දුප්පඤ්ඤකවිනා චාති - මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.5.3.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අටවැනි බාල - පණ්ඩිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "29. [මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත ... අසත්පුරුෂ තෙමේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "ශ්‍රද්ධා නැත්තේ වෙයි. දුශ්ශීල වෙයි. පවට ලජ්ජා නැතියේ වෙයි. පවට බිය නැතියේ වෙයි. [මේ සතර කරුණෙන් ... බොහෝ අකුසල් ද රැස් කෙරෙයි. ]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත ... සත්පුරුෂ තෙමේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "ශ්‍රද්ධා ඇතියේ වෙයි. ශීල ඇතියේ වෙයි. පවට ලජ්ජා ඇතියේ වෙයි. පවට බිය ඇතියේ වෙයි … [මේ සතර කරුණෙන් ... බොහෝ කුසල් ද රැස් කෙරෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.3.10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නවවැනි බාල - පණ්ඩිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "30. [මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත ... අසත්පුරුෂ තෙමේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "ශ්‍රද්ධා නැතියේ වෙයි. දුශ්ශීල වෙයි. කුසීත වෙයි. දුෂ්ප්‍රාඥ වෙයි. [මේ සතර කරුණෙන් ... බොහෝ අකුසල් ද රැස් කෙරෙයි.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත ... සත්පුරුෂ තෙමේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "ශ්‍රද්ධා ඇතියේ වෙයි. සිල්වත් වෙයි. රුකළ වැර ඇතියේ වෙයි. ප්‍රඥාවත් වෙයි. මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත වු පණ්ඩිත වූ ව්‍යක්ත වූ සත්පුරුෂ තෙමේ ගුණ විසින් සාරා නො ලන ලද, ගුණ විසින් නො නට ආත්මයක් පරිහරණය කෙරෙයි. අනවද්‍ය ද වෙයි. නුවණැත්තන් විසින් උපවාද නො කටයුතුත් වෙයි. බොහෝ කුසල් ද රැස් කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.3.11.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කවි සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "31. මහණෙනි, මේ කවීහු සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "චින්තාකවිය, ශ්‍රැතකවිය, අර්‍ත්‍ථකවිය, ප්‍රතිභානකවි යි. මහණෙනි, මේ සතර කවීහු වෙති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සුචරිතවර්‍ගය තෙවැනි යි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 446,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "4. කම්මවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 4. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පඨම කම්මසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "32. චත්තාරිමානි භික්ඛවෙ කම්මානි මයා සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදිතානි. කතමානි චත්තාරි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි භික්ඛවෙ කම්මං කණ්හං කණ්හවිපාකං. අත්ථි භික්ඛවෙ කම්මං සුක්කං සුක්කවිපාකං. අත්ථි භික්ඛවෙ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං. අත්ථි භික්ඛවෙ කම්මං අකණ්හං අසුක්කං අකණ්හඅසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ චත්තාරි කම්මානි මයා සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදිතානීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 4. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(දුතියකම්මසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "33. චත්තාරිමානි භික්ඛවෙ කම්මානි මයා සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදිතානි. කතමානි චත්තාරි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි භික්ඛවෙ කම්මං කණ්හං කණ්හවිපාකං. අත්ථි භික්ඛවෙ කම්මං සුක්කං සුක්කවිපාකං. අත්ථි භික්ඛවෙ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං. අත්ථි භික්ඛවෙ කම්මං අකණ්හං අසුක්කං අකණ්හඅසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං කණ්හං කණ්හවිපාකං? ඉධ භික්ඛවෙ එකච්චො සබ්යාපජ්ඣං කායසඞ්ඛාරං අභිසඞ්ඛරොති, සබ්යාපජ්ඣං වචීසඞ්ඛාරං අභිසඞ්ඛරොති, සබ්යාපජ්ඣං මනොසඞ්ඛාරං අභිසඞ්ඛරොති. සො සබ්යාපජ්ඣං කායසඞ්ඛාරං අභිසඞ්ඛරිත්වා සබ්යාපජ්ඣං වචීසඞ්ඛාරං අභිසඞ්ඛරිත්වා සබ්යාපජ්ඣං මනොසඞ්ඛාරං අභිසඞ්ඛරිත්වා සබ්යාපජ්ඣං ලොකං උපපජ්ජති. තමෙනං සබ්යාපජ්ඣං ලොකං උපපන්නං සමානං සබ්යාපජ්ඣා ඵස්සා ඵුසන්ති. සො සබ්යාපජ්ඣෙහි ඵස්සෙහි ඵුට්ඨො සමානො සබ්යාපජ්ඣං වෙදනං වෙදියති එකන්තදුක්ඛං. සෙය්යථාපි සත්තා නෙරයිකා. ඉදං වුච්චති භික්ඛවෙ කම්මං කණ්හං කණ්හවිපාකං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං සුක්කං සුක්කවිපාකං? ඉධ භික්ඛවෙ එකච්චො අබ්යාපජ්ඣං කායසඞ්ඛාරං අභිසඞ්ඛරොති, අබ්යාපජ්ඣං වචීසඞ්ඛාරං අභිසඞ්ඛරොති, අබ්යාපජ්ඣං මනොසඞ්ඛාරං අභිසඞ්ඛරොති. සො අබ්යාපජ්ඣං කායසඞ්ඛාරං අභිසඞ්ඛරිත්වා අබ්යාපජ්ඣං වචීසඞ්ඛාරං අභිසඞ්ඛරිත්වා අබ්යාපජ්ඣං මනොසඞ්ඛාරං අභිසඞ්ඛරිත්වා අබ්යාපජ්ඣං ලොකං උපපජ්ජති. තමෙනං අබ්යාපජ්ඣං ලොකං උපපන්නං සමානං අබ්යාපජ්ඣා ඵස්සා ඵුසන්ති. සො අබ්යාපජ්ඣෙහි ඵස්සෙහි ඵුට්ඨො සමානො අබ්යාපජ්ඣං වෙදනං වෙදියති එකන්තසුඛං. සෙය්යථාපි දෙවා සුභකිණ්හා. ඉදං වුච්චති භික්ඛවෙ කම්මං සුක්කං සුක්කවිපාකං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "4. කර්‍ම වර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4.5.4.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ප්‍රථම කර්‍ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත් නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "32. මහණෙනි, මේ සතර කර්‍මයෝ මා විසින් තමන් ම විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්‍ෂ කොට ප්‍රකාශ කරණ ලද්දාහු ය. කවර සතර කර්‍මයහ යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෘෂ්ණවිපාක ඇති කෘෂ්ණ (අකුශල) කර්‍මයෙක් ඇත. මහණෙනි, ශුක්ල විපාක ඇති ශුක්ල (කුශල) කර්‍මයෙක් ඇත. මහණෙනි, කෘෂ්ණ වූ ද ශුක්ල වූ ද විපාක ඇති (මිශ්‍රක වන) කෘෂ්ණ-ශුක්ලකර්‍මයෙක් ඇත. මහණෙනි, කෘෂ්ණ ද නො වූ ශුක්ල ද නො වූ විපාක ඇති කර්‍මක්‍ෂය පිණිස පවත්නා අකෘෂ්ණ-අශුක්ල (චතුර්මාර්‍ගඥාන) කර්‍මයෙක් ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කර්‍මයෝ මා විසින් තමන් ම විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්‍ෂ කොට ප්‍රකාශ කරණ ලදහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.4.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දෙවන කර්‍ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "33. මහණෙනි, මේ කර්‍මයෝ සතර කෙනෙක් මා විසින් තමන් ම විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්‍ෂ කොට පවසන ලද්දාහු ය. කවර සතර කර්‍මයහ යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අනිෂ්ටවිපාක ඇති අකුශලකර්‍මයෙක් ඇත. මහණෙනි, ඉෂ්ටවිපාක ඇති කුශලකර්‍මයෙක් ඇත. මහණෙනි, අනිෂ්ට වූ ද ඉෂ්ට වූ ද විපාක ඇති කෘෂ්ණ-ශුක්ලකර්‍මයෙක් ඇත. මහණෙනි, අකෘෂ්ණ-අශුක්ල විපාක ඇති කර්‍මක්‍ෂය පිණිස පවත්නා අකෘෂ්ණ-අශුක්ලකර්‍මයෙක් ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අනිෂ්ට විපාක ඇති අකුශලකර්‍මය කවරේ ය? මහණෙනි, මෙලොව්හි ඇතැමෙක් සදොස් වූ (කායද්වාරිකචේතනා සඞ්ඛ්‍යාත) කායසංස්කාරය රැස් කෙරෙයි. සදොස් (වාග්ද්වාරිකචෙතනා සඞ්ඛ්‍යාත) වාක්සංස්කාරය රැස් කෙරෙයි. සදොස් වූ (මනෝද්වාරිකචේතනා සඞ්ඛ්‍යාත) මනඃසංස්කාරය රැස් කෙරෙයි. හේ දොස් සහිත කායසංස්කාරය රැස් කොට දොස් සහිත වාක්සංස්කාරය රැස් කොට දොස් සහිත මනඃසංස්කාරය රැස් කොට දුක් සහිත ලෝකයට උත්පත්ති වශයෙන් පැමිණෙයි. දුක් සහිත ලොව්හි උපන් ඔහු දුක් සහිත විපාකස්පර්‍ශයෝ පහස්නාහ. දුක් සහිත ස්පර්‍ශයන් විසින් පහස්නා ලද හේ ඒකාන්තයෙන් දුක් වූ ආබාධ සහිත විපාකවේදනාව විඳියි. නිරිසතුන් සෙයිනි. මහණෙනි, මේ අනිෂ්ටවිපාක ඇති අකුශලකර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඉෂ්ටවිපාක ඇති කුශලකර්‍මය කවරේ ය? මහණෙනි, මෙලොව ඇතැමෙක් නිදොස් වූ කායසංස්කාරය රැස් කෙරෙයි. නිදොස් වූ වාක්සංස්කාරය රැස් කෙරෙයි. නිදොස් වූ මනඃසංස්කාරය රැස් කෙරෙයි. හේ නිදොස් වූ කායසංස්කාරය රැස් කොට නිදොස් වූ වාක්සංස්කාරය රැස් කොට නිදොස් වූ මනඃසංස්කාරය රැස් කොට නිදුක් ලොවට එළඹෙයි. නිදුක් ලොවට එළඹි ඔහු දුක් රහිත විපාක ස්පර්‍ශයෝ පහස්නාහ. නිදුක් ස්පර්‍ශයන් විසින් පහස්නා ලද හේ ඒකාන්තසුඛ වූ නිරාබාධවේදනා විඳී. සුභකිණ්හ දෙවියන් සෙයිනි. මහණෙනි, මේ ඉෂ්ටවිපාක ඇති කුශලකර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 448,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං? ඉධ භික්ඛවෙ එකච්චො සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි කායසඞ්ඛාරං අභිසඞ්ඛරොති, සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි වචීසඞ්ඛාරං අභිසඞ්ඛරොති, සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි මනොසඞ්ඛාරං අභිසඞ්ඛරොති. සො සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි කායසඞ්ඛාරං අභිසඞ්ඛරිත්වා සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි වචීසඞ්ඛාරං අභිසඞ්ඛරිත්වා සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි මනොසඞ්ඛාරං අභිසඞ්ඛරිත්වා සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි ලොකං උපපජ්ජති. තමෙනං සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි ලොකං උපපන්නං සමානං සබ්යාපජ්ඣාපි අබ්යාපජ්ඣාපි ඵස්සා ඵුසන්ති. සො සබ්යාපජ්ඣෙහිපි අබ්යාපජ්ඣෙහිපි ඵස්සෙහි ඵුට්ඨො සමානො සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි වෙදනං වෙදියති වොකිණ්ණසුඛදුක්ඛං. සෙය්යථාපි මනුස්සා එකච්චෙ ච දෙවා එකච්චෙ ච විනිපාතිකා. ඉදං වුච්චති භික්ඛවෙ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං අකණ්හං අසුක්කං අකණ්හඅසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති? තත්ර භික්ඛවෙ යමිදං කම්මං කණ්හං කණ්හවිපාකං තස්ස පහාණාය යා චෙතනා, යම්පිදං කම්මං සුක්කං සුක්කවිපාකං තස්ස පහාණාය යා චෙතනා, යම්පිදං කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං තස්ස පහාණාය යා චෙතනා, ඉදං වුච්චති භික්ඛවෙ කම්මං අකණ්හං අසුක්කං අකණ්හ අසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ චත්තාරි කම්මානි මයා සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදිතානීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 4. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(තතිය කම්ම සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "34. අථ ඛො **සිඛාමොග්ගල්ලානො** බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො සිඛාමොග්ගල්ලානො බ්රාහ්මණො භගවන්තං එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "පුරිමානි භො ගොතම දිවසානි පුරිමතරානි **සොණකායනො** මාණවො යෙනාහං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා මං එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ගොතමො සබ්බකම්මානං අකිරියං පඤ්ඤාපෙති. සබ්බකම්මානං ඛො පන අකිරියං පඤ්ඤාපෙන්තො උච්ඡෙදං ආහ ලොකස්ස. කම්මසච්චායං භො ලොකො, කම්මසමාරම්භට්ඨායීති."
                    },
                    {
                        "type": "unindented",
                        "text": "**(භගවා:)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "දස්සනම්පි ඛො අහං බ්රාහ්මණ සොණකායනස්ස මාණවස්ස නාභිජානාමි. කුතො පනෙවරූපො කථාසල්ලාපො?"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, ඉෂ්ටානිෂ්ට විපාක ඇති කෘෂ්ණශුක්ලකර්‍ම කවරේ ය? මහණෙනි, මෙලොව ඇතැමෙක් සදොස් වූත් නිදොස් වූත් කායසංස්කාර රැස් කෙරෙයි සදොස් වූත් නිදොස් වූත් වාක්සංස්කාර රැස් කෙරෙයි. සදොස් වූත් නිදොස් වූත් මනඃසංස්කාර රැස් කෙරෙයි. හේ සදොස් වූත් නිදොස් වූත් කායසංස්කාර රැස් කොට සදොස් වූත් නිදොස් වූත් වාක්සංස්කාර රැස් කොට සදොස් වූත් නිදොස් වූත් මනඃසංස්කාර රැස් කොට සදුක් වූ ද නිදුක් වූ ද ලෝකයට එළඹෙයි. සදුක් වූ ද නිදුක් වූ ද ලොවට එළඹි ඔහු දුක් සහිත වූ ද දුක් රහිත වූ ද විපාකස්පර්‍ශයෝ පහස්නාහ. සදුක් වූ ද නිදුක් වූ ද ස්පර්‍ශයන් විසින් පහස්නා ලද හේ ව්‍යතිමිශ්‍රසුඛදුඃඛ ඇති සදුක් වූත් නිදුක් වූත් විපාකවේදනා විඳියි. මිනිසුන් සෙයිනි. ඇතැම් දෙවියන් හා ඇතැම් විනිපාතිකයන් ද සෙයිනි. මහණෙනි, මේ ඉටු අනිටු විපාක ඇති කෘෂ්ණශුක්ලකර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කර්‍මක්‍ෂය පිණිස පවත්නා කෘෂ්ණවිපාකත් නො වූ ශුක්ලවිපාකත් නො වූ අකෘෂ්ණඅශුක්ලකර්‍මය කවරේ ය? මහණෙනි, එහි ලා යම් කර්‍මයෙක් කෘෂ්ණ වේ ද කෘෂ්ණවිපාක වේ ද, ඒ කර්‍මයාගේ ප්‍රහාණය පිණිස යම් චේතනායෙක් ඇද්ද, යම් කර්‍මයෙක් ශුක්ල වේ ද ශුක්ලවිපාක වේ ද, ඒ කර්‍මයාගේ ප්‍රහාණය පිණිස යම් චේතනායෙක් ඇද්ද, යම් කර්‍මයෙක් කෘෂ්ණශුක්ල වේ ද කෘෂ්ණශුක්ලවිපාකත් වේ ද, ඒ කර්‍මයාගේ ප්‍රහාණය පිණිස යම් චේතනායෙක් ඇද්ද, මහණෙනි, මේ කර්‍මක්‍ෂය පිණිස පවත්නා අකෘෂ්ණඅශුක්ල වූ අකෘෂ්ණඅශුක්ලවිපාකත් වූ කර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කර්‍මයෝ මා විසින් තමන් ම විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්‍ෂ කොට පවසන ලදහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.4.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තෙවන කර්‍ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "34. එකල්හි සිඛාමොග්ගල්ලාන බමුණු භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමග සතුටු වී. සතුටට කරුණු වූ සිහි කරණුවට නිසි කථා කොට නිමවා එකත්පසෙක හින. එකත්පස් ව හුන් සිළුමුගලන් බමුණු භාග්‍යවතුන් වහන්සේට තෙල සැළ කෙළේ ය:",
                        "type": "paragraph"
                    },
                    {
                        "text": "භවත් ගෞතමයන් වහන්ස, පුරිම වූත් පුරිමතර වූත් දිනයෙහි සෝණකායන නම් මාණවක මා කරා එළඹියේ ය. එළඹ මට තෙල කී ය:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ ගොයුම් සියලු කර්‍මයන්ගේ අක්‍රියාව පණවයි. සියලු කර්‍මයන්ගේ අක්‍රියාව පණවන්නේ ලොවට උච්ඡේදයක් කියයි. භවත්නි, මේ ලෝකය කර්‍මය සැහැවි කොට ඇත. කර්‍මසමාරම්භයෙන් (කර්‍ම රැස් කිරීමෙන්) සිටුනාසුලු ය. (කර්‍ම නොකරණුයේ උච්ඡේදයට යෙයි යූසේය.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "[භාග්‍යවත්හු:]",
                        "type": "unindented"
                    },
                    {
                        "text": "බමුණ, මම සෝණකායන නම් මාණවකයාගේ දැක්මක් ද නො දන්මි. මෙබඳු කථා සල්ලාපයෙක් කොහි වී ද?",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 450,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "චත්තාරිමානි බ්රාහ්මණ කම්මානි මයා සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදිතානි. කතමානි චත්තාරි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි බ්රාහ්මණ කම්මං කණ්හං කණ්හවිපාකං. අත්ථි බ්රාහ්මණ කම්මං සුක්කං සුක්කවිපාකං. අත්ථි බ්රාහ්මණ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං. අත්ථි බ්රාහ්මණ කම්මං අකණ්හං අසුක්කං අකණ්හඅසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච බ්රාහ්මණ කම්මං කණ්හං කණ්හවිපාකං? ඉධ බ්රාහ්මණ එකච්චො සබ්යාපජ්ඣං කායසඞ්ඛාරං අභිසඞ්ඛරොති, සබ්යාපජ්ඣං වචීසඞ්ඛාරං අභිසඞ්ඛරොති, සබ්යාපජ්ඣං මනොසඞ්ඛාරං අභිසඞ්ඛරොති. සො සබ්යාපජ්ඣං කායසඞ්ඛාරං අභිසඞ්ඛරිත්වා සබ්යාපජ්ඣං වචීසඞ්ඛාරං අභිසඞ්ඛරිත්වා සබ්යාපජ්ඣං මනොසඞ්ඛාරං අභිසඞ්ඛරිත්වා සබ්යාපජ්ඣං ලොකං උපපජ්ජති. තමෙනං සබ්යාපජ්ඣං ලොකං උපපන්නං සමානං සබ්යාපජ්ඣා ඵස්සා ඵුසන්ති. සො සබ්යාපජ්ඣෙහි ඵස්සෙහි ඵුට්ඨො සමානො සබ්යාපජ්ඣං වෙදනං වෙදියති එකන්තදුක්ඛං. සෙය්යථාපි සත්තා නෙරයිකා. ඉදං වුච්චති බ්රාහ්මණ කම්මං කණ්හං කණ්හවිපාකං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච බ්රාහ්මණ කම්මං සුක්කං සුක්කවිපාකං? ඉධ බ්රාහ්මණ එකච්චො අබ්යාපජ්ඣං කායසඞ්ඛාරං අභිසඞ්ඛරොති, අබ්යාපජ්ඣං වචීසඞ්ඛාරං අභිසඞ්ඛරොති, අබ්යාපජ්ඣං මනොසඞ්ඛාරං අභිසඞ්ඛරොති. සො අබ්යාපජ්ඣං කායසඞ්ඛාරං අභිසඞ්ඛරිත්වා අබ්යාපජ්ඣං වචීසඞ්ඛාරං අභිසඞ්ඛරිත්වා අබ්යාපජ්ඣං මනොසඞ්ඛාරං අභිසඞ්ඛරිත්වා අබ්යාපජ්ඣං ලොකං උපපජ්ජති. තමෙනං අබ්යාපජ්ඣං ලොකං උපපන්නං ඵස්සා ඵුසන්ති සො අබ්යාපජ්ඣෙහි ඵස්සෙහි ඵුට්ඨො සමානො අබ්යාපජ්ඣං වෙදනං වෙදියති එකන්තසුඛං. සෙය්යථාපි දෙවා සුභකිණ්හා. ඉදං වුච්චති බ්රාහ්මණ කම්මං සුක්කං සුක්කවිපාකං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච බ්රාහ්මණ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං? ඉධ බ්රාහ්මණ එකච්චො සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි කායසඞ්ඛාරං අභිසඞ්ඛරොති, සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි වචීසඞ්ඛාරං අභිසඞ්ඛරොති, සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි මනොසඞ්ඛාරං අභිසඞ්ඛරොති. සො සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි කායසඞ්ඛාරං අභිසඞ්ඛරිත්වා සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි වචීසඞ්ඛාරං අභිසඞ්ඛරිත්වා සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි මනොසඞ්ඛාරං අභිසඞ්ඛරිත්වා සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි ලොකං උපපජ්ජති. තමෙනං සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි ලොකං උපපන්නං සමානං සබ්යාපජ්ඣාපි අබ්යාපජ්ඣාපි ඵස්සා ඵුසන්ති. සො සබ්යාපජ්ඣෙහිපි අබ්යාපජ්ඣෙහිපි ඵස්සෙහි ඵුට්ඨො සමානො සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි වෙදනං වෙදියති වොකිණ්ණසුඛදුක්ඛං. සෙය්යථාපි මනුස්සා එකච්චෙ ච දෙවා එකච්චෙ ච විනිපාතිකා. ඉදං වුච්චති බ්රාහ්මණ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච බ්රාහ්මණ කම්මං අකණ්හං අසුක්කං අකණ්හඅසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති? තත්ර බ්රාහ්මණ යමිදං කම්මං කණ්හං කණ්හවිපාකං තස්ස පහාණාය යා චෙතනා, යම්පිදං කම්මං සුක්කං සුක්කවිපාකං තස්ස පහාණාය යා චෙතනා, යම්පිදං කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං තස්ස පහාණාය යා චෙතනා, ඉදං වුච්චති බ්රාහ්මණ කම්මං අකණ්හං අසුක්කං අකණ්හාසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො බ්රාහ්මණ චත්තාරි කම්මානි මයා සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදිතානීති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "බමුණ, මේ සතර කර්‍ම කෙනෙක් මා විසින් තමන් ම විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්‍ෂ කොට ප්‍රකාශ කරණ ලදහ. කවර සතර කර්‍මයහ යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "බමුණ, කෘෂ්ණවිපාක ඇති කෘෂ්ණකර්‍මයෙක් ඇත. බමුණ, ශුක්ලවිපාක ඇති ශුක්ලකර්‍මයෙක් ඇත. බමුණ, කෘෂ්ණශුක්ලවිපාක ඇති කෘෂ්ණශුක්ලකර්‍මයෙක් ඇත. කර්‍මක්‍ෂය පිණිස පවත්නා අකෘෂ්ණ අශුක්ල විපාක ඇති අකෘෂ්ණ අශුක්ල කර්‍මයෙක් ඇති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බමුණ, කෘෂ්ණවිපාක ඇති කෘෂ්ණකර්‍මය කවරේ ය? බමුණ, මෙලොව ඇතැමෙක් සදොස් වූ කායසංස්කාර රැස් කෙරෙයි. සදොස් වූ වාක්සංස්කාර රැස් කෙරෙයි. සදොස් වූ මනස්සංස්කාර රැස් කෙරෙයි. හේ සදොස් කායසංස්කාර රැස් කොට සදොස් වාක්සංස්කාර රැස් කොට සදොස් මනස්සංස්කාර රැස් කොට සදුක් වූ ලොවට එළඹෙයි. සදුක් ලොවට එළඹියහු සදුක් විපාකස්පර්‍ශයෝ පහස්නාහ. හේ සදුක් ස්පර්‍ශයන් විසින් පහස්නා ලද්දේ ම ඒකාන්ත දුඃඛ වූ සදුක් වේදනා විඳී. නිරිසතුන් සෙයිනි. බමුණ, මේ කෘෂ්ණවිපාක ඇති කෘෂ්ණකර්‍ම යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බමුණ, ශුක්ලවිපාක ඇති ශුක්ලකර්‍මය කවරේ ය? බමුණ, මෙලොව ඇතැමෙක් නිදොස් කායසංස්කාර රැස් කෙරෙයි. නිදොස් වාක්සංස්කාර රැස් කෙරෙයි. නිදොස් මනස්සංස්කාර රැස් කෙරෙයි. හේ නිදොස් කායසංස්කාර රැස් කොට නිදොස් වාක්සංස්කාර රැස් කොට නිදොස් මනස්සංස්කාර රැස් කොට නිදුක් ලෝකයට එළඹෙයි. නිදුක් ලෝකයට එළඹියහු නිදුක් ස්පර්‍ශයෝ පහස්නාහ. හේ නිදුක් ස්පර්‍ශයන් විසින් පහස්නා ලද්දේ ඒකාන්ත සුඛ වූ නිදුක් වේදනා විඳී. සුභකිණ්හ දෙවියන් සෙයිනි. බමුණ, මේ ශුක්ලවිපාක ඇති ශුක්ලකර්‍ම යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බමුණ, කෘෂ්ණ-ශුක්ලවිපාක ඇති කෘෂ්ණ-ශුක්ලකර්‍මය කවරේ ය? බමුණ, මෙලොව ඇතැමෙක් සදොස් වූ ද නිදොස් වූ ද කායසංස්කාර රැස් කෙරෙයි. සදොස් වූ ද නිදොස් වූ ද වාක්සංස්කාර රැස් කෙරෙයි. සදොස් වූ ද නිදොස් වූ ද මනස්සංස්කාර රැස් කෙරෙයි. හේ සදොස් වූ ද නිදොස් වූ ද කායසංස්කාරය රැස් කොට සදොස් වූ ද නිදොස් වූ ද වාක්සංස්කාරය රැස් කොට සදොස් වූ ද නිදොස් වූ ද මනස්සංස්කාරය රැස් කොට සදුක් වූ ද නිදුක් වූ ද ලෝකයට එළඹෙයි. සදුක් වූ ද නිදුක් වූ ද ලොවට එළඹියහු සදුක් වූ ද නිදුක් වූ ද විපාකස්පර්‍ශයෝ පහස්නාහ. හේ සදුක් වූ ද නිදුක් වූ ද ස්පර්‍ශයන් විසින් පහස්නා ලද්දේ ව්‍යවකීර්‍ණ සුඛදුඃඛ ඇති සදුක් වූ ද නිදුක් වූ ද විපාකවේදනා විඳී. ඇතැම් මිනිසුන් සෙයිනි. ඇතැම් දෙවියන් හා විනිපාතිකයන් ද සෙයිනි. බමුණ, මේ කෘෂ්ණශුක්ලවිපාක ඇති කෘෂ්ණශුක්ල කර්‍ම යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බමුණ, කර්‍මක්‍ෂය පිණිස පවත්නා අකෘෂ්ණ අශුක්ල විපාක ඇති අකෘෂ්ණ අශුක්ලකර්‍මය කවරේ ය? බමුණ, එහි ලා කෘෂ්ණවිපාක ඇති යම් කෘෂ්ණකර්‍මයෙක් ඇත් ද ඒ කර්‍මයාගේ ප්‍රහාණය පිණිස යම් චේතනායෙක් ඇත් ද, ශුක්ලවිපාක ඇති යම් ශුක්ලකර්‍මයෙක් ඇත් ද ඒ කර්‍මයාගේ ප්‍රහාණය පිණිස යම් චේතනායෙක් ඇත් ද, කෘෂ්ණශුක්ලවිපාක ඇති යම් කෘෂ්ණශුක්ලකර්‍මයෙක් ඇත් ද, ඒ කර්‍මයාගේ ප්‍රහාණය පිණිස යම් චේතනායෙක් ඇත් ද, බමුණ, මේ කර්‍මක්‍ෂය පිණිස පවත්නා අකෘෂ්ණ අශුක්ල විපාක ඇති අකෘෂ්ණ අශුක්ල කර්‍ම යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බමුණ, මේ සතර කර්‍මයෝ මා විසින් තමන් ම විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්‍ෂ කොට ප්‍රකාශ කරණ ලදහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 452,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 5. 4. 4",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(චතුත්ථ කම්මසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "35. චත්තාරිමානි භික්ඛවෙ කම්මානි මයා සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදිතානි. කතමානි චත්තාරි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි භික්ඛවෙ කම්මං කණ්හං කණ්හවිපාකං. අත්ථි භික්ඛවෙ කම්මං සුක්කං සුක්කවිපාකං. අත්ථි භික්ඛවෙ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං. අත්ථි භික්ඛවෙ කම්මං අකණ්හං අසුක්කං අකණ්හාසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං කණ්හං කණ්හවිපාකං? ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතී හොති, අදින්නාදායී හොති, කාමෙසු මිච්ඡාචාරී හොති, මුසාවාදී හොති, සුරාමෙරයමජ්ජපමාදට්ඨායී හොති. ඉදං වුච්චති භික්ඛවෙ කම්මං කණ්හං කණ්හවිපාකං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං සුක්කං සුක්කවිපාකං? ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතා පටිවිරතො හොති, අදින්නාදානා පටිවිරතො හොති, කාමෙසු මිච්ඡාචාරා පටිවිරතො හොති, මුසාවාදා පටිවිරතො හොති, සුරාමෙරයමජ්ජපමාදට්ඨානා පටිවිරතො හොති. ඉදං වුච්චති භික්ඛවෙ කම්මං සුක්කං සුක්කවිපාකං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං? ඉධ භික්ඛවෙ එකච්චො සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි කායසඞ්ඛාරං අභිසඞ්ඛරොති -පෙ- (වචීසඞ්ඛාරං -පෙ- මනොසඞ්ඛාරං අභිසඞ්ඛරොති.) ඉදං වුච්චති භික්ඛවෙ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං අකණ්හං අසුක්කං අකණ්හඅසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති? තත්ර භික්ඛවෙ යමිදං කම්මං කණ්හං කණ්හවිපාකං (තස්ස පහාණාය යා චෙතනා) -පෙ- ඉදං වුච්චති භික්ඛවෙ කම්මං අකණ්හං අසුක්කං අකණ්හඅසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ චත්තාරි කම්මානි මයා සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදිතානීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 4. 5",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පඤ්චම කම්මසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "36. චත්තාරිමානි භික්ඛවෙ කම්මානි මයා සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදිතානි. කතමානි චත්තාරි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි භික්ඛවෙ කම්මං කණ්හං කණ්හවිපාකං. අත්ථි භික්ඛවෙ කම්මං සුක්කං සුක්කවිපාකං. අත්ථි භික්ඛවෙ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං. අත්ථි භික්ඛවෙ කම්මං අකණ්හං අසුක්කං අකණ්හඅසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.5.4.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සිවුවන කර්‍ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "35. මහණෙනි, මේ කර්‍මයෝ සතර දෙනෙක් මා විසින් තමන් ම විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්‍ෂ කොට ප්‍රකාශ කරණ ලදහ. කවර සතර කර්‍මයහ යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෘෂ්ණ විපාක ඇති කෘෂ්ණ කර්‍මයෙක් ඇත. මහණෙනි, ශුක්ල විපාක ඇති ශුක්ල කර්‍මයෙක් ඇත. මහණෙනි, කෘෂ්ණ වූ ද ශුක්ල වූ ද විපාක ඇති කෘෂ්ණ ශුක්ල කර්‍මයෙක් ඇත. මහණෙනි, කර්‍මක්‍ෂය පිණිස පවත්නා අකෘෂ්‍ණ අශුක්ල විපාක ඇති අකෘෂ්ණ අශුක්ල කර්‍මයෙක් ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෘෂ්ණ විපාක ඇති කෘෂ්ණ කර්‍මය කවරේය? මහණෙනි, මෙ ලොව ඇතැමෙක් පණිවා කරන්නේ වෙයි. අයිනාදන් ගන්නේ වෙයි. කාමයෙහි මිසහසර ඇතියේ වෙයි. මුසවා බණන්නේ වෙයි. මද පමා දෙකට කරුණු වන රහ මෙර පීමෙහි සිටුනේ වෙයි. මහණෙනි, මේ කෘෂ්ණ විපාක ඇති කෘෂ්ණ කර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ශුක්ල විපාක ඇති ශුක්ල කර්‍මය කවරේ ය? මහණෙනි, මෙ ලොව ඇතැමෙක් පණිවායෙන් දුරු වූයේ වෙයි. අයිනාදනින් දුරු වූයේ වෙයි. කාමයෙහි මිසහසරින් දුරු වූයේ වෙයි. මුසාවායෙන් දුරු වූයේ වෙයි. මද පමා දෙකට කරුණු වන රහමෙර පීමෙන් දුරු වූයේ වෙයි. මහණෙනි, මේ ශුක්ල විපාක ඇති ශුක්ල කර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෘෂ්ණ වූ ද ශුක්ල වූ ද විපාක ඇති කෘෂ්ණ ශුක්ල කර්‍මය කවරේ ය? මහණෙනි, මෙලොව ඇතැමෙක් සදොස් වූ ද නිදොස් වූ ද කායසංස්කාර රැස් කෙරෙයි ... [වාක්සංස්කාර ... මනස්සංස්කාර රැස් කෙරෙයි.] මහණෙනි, මේ කෘෂ්ණ වූ ද ශුක්ල වූ ද විපාක ඇති කෘෂ්ණ ශුක්ල කර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කර්‍මක්‍ෂය පිණිස පවත්නා අකෘෂ්ණ අශුක්ල විපාක ඇති අකෘෂ්ණ අශුක්ල කර්‍මය කවරේ ය? මහණෙනි, එහි ලා කෘෂ්ණ විපාක ඇති යම් කෘෂ්ණ කර්‍මයෙක් වේ ද [ඒ කර්‍මයාගේ ප්‍රහාණය පිණිස යම් චේතනායෙක් ඇත් ද,] මහණෙනි, මේ කර්‍මක්‍ෂය පිණිස පවත්නා අකෘෂ්ණ වූ ද අශුක්ල වූ ද විපාක ඇති අකෘෂ්ණ අශුක්ල කර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කර්‍මයෝ මා විසින් තමන් ම විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්‍ෂ කොට ප්‍රකාශ කරණ ලදහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.4.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පස්වන කර්‍ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "36. මහණෙනි, මේ කර්‍මයෝ සතර දෙනෙක් මා විසින් තමන් ම විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්‍ෂ කොට ප්‍රකාශ කරණ ලදහ. කවර සතර කර්‍මයහ යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෘෂ්ණ විපාක ඇති කෘෂ්ණකර්‍මයෙක් ඇත. මහණෙනි, ශුක්ල විපාක ඇති ශුක්ලකර්‍මයෙක් ඇත. මහණෙනි, කෘෂ්ණ ශුක්ල විපාක ඇති කෘෂ්ණශුක්ලකර්‍මයෙක් ඇත. මහණෙනි, කර්‍මක්‍ෂය පිණිස පවත්නා අකෘෂ්ණ අශුක්ල විපාක ඇති අකෘෂ්ණ අශුක්ලකර්‍මයෙක් ඇත.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 454,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං කණ්හං කණ්හවිපාකං? ඉධ භික්ඛවෙ එකච්චෙන මාතා ජීවිතා වොරොපිතා හොති, පිතා ජීවිතා වොරොපිතො හොති, අරහං ජීවිතා වොරොපිතො හොති, තථාගතස්ස දුට්ඨෙන චිත්තෙන ලොහිතං උප්පාදිතා හොති. සඞ්ඝොපි භින්නො හොති. ඉදං වුච්චති භික්ඛවෙ කම්මං කණ්හං කණ්හවිපාකං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං සුක්කං සුක්කවිපාකං? ඉධ භික්ඛවෙ එකච්චො පාණාතිපාතා පටිවිරතො හොති, අදින්නාදානා පටිවිරතො හොති, කාමෙසු මිච්ඡාචාරා පටිවිරතො හොති, මුසාවාදා පටිවිරතො හොති, පිසුණාවාචා පටිවිරතො හොති, ඵරුසාවාචා පටිවිරතො හොති, සම්ඵප්පලාපා පටිවිරතො හොති, අනභිජ්ඣාලු හොති, අබ්යාපන්නචිත්තො හොති, සම්මාදිට්ඨිකො හොති. ඉදං වුච්චති භික්ඛවෙ කම්මං සුක්කං සුක්කවිපාකං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං? ඉධ භික්ඛවෙ එකච්චො සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි කායසඞ්ඛාරං අභිසඞ්ඛරොති, -පෙ- ඉදං වුච්චති භික්ඛවෙ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං අකණ්හං අසුක්කං අකණ්හඅසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති? තත්ර භික්ඛවෙ යමිදං කම්මං කණ්හං කණ්හවිපාකං (තස්ස පහාණාය යා චෙතනා) -පෙ- ඉදං වුච්චති භික්ඛවෙ කම්මං අකණ්හං අසුක්කං අකණ්හාසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ චත්තාරි කම්මානි මයා සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදිතානීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 4. 6",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ඡට්ඨකම්මසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "37. චත්තාරිමානි භික්ඛවෙ කම්මානි මයා සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදිතානි. කතමානි චත්තාරි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි භික්ඛවෙ කම්මං කණ්හං කණ්හවිපාකං. අත්ථි භික්ඛවෙ කම්මං සුක්කං සුක්කවිපාකං. අත්ථි භික්ඛවෙ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං. අත්ථි භික්ඛවෙ කම්මං අකණ්හං අසුක්කං අකණ්හඅසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං කණ්හං කණ්හවිපාකං? ඉධ භික්ඛවෙ එකච්චො සබ්යාපජ්ඣං කායසඞ්ඛාරං අභිසඞ්ඛරොති -පෙ- ඉදං වුච්චති භික්ඛවෙ කම්මං කණ්හං කණ්හවිපාකං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං සුක්කං සුක්කවිපාකං? ඉධ භික්ඛවෙ එකච්චො අබ්යාපජ්ඣං කායසඞ්ඛාරං අභිසඞ්ඛරොති, -පෙ- ඉදං වුච්චති භික්ඛවෙ කම්මං සුක්කං සුක්කවිපාකං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං? ඉධ භික්ඛවෙ එකච්චො සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි කායසඞ්ඛාරං අභිසඞ්ඛරොති, -පෙ- ඉදං වුච්චති භික්ඛවෙ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කෘෂ්ණ විපාක ඇති කෘෂ්ණකර්‍මය කවරේ ය? මහණෙනි, මෙ ලොව ඇතැමකු විසින් මව දිවියෙන් තොරකරණ ලදු වෙයි. පියා දිවියෙන් තොර කරණ ලද්දේ වෙයි. රහත් දිවියෙන් තොර කරණ ලද්දේ වෙයි. දුෂ්ට සිතින් තථාගතයන් වහන්සේගේ කයෙහි ලේ සොල්වන ලද්දේ වෙයි. සඞ්ඝයා බිඳනා ලද්දේ වෙයි. මහණෙනි, මේ කෘෂ්ණවිපාක ඇති කෘෂ්ණකර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ශුක්ලවිපාක ඇති ශුක්ලකර්‍මය කවරේ ය? මහණෙනි, මෙලොව ඇතැමෙක් පණිවායෙන් දුරුවූයේ වෙයි. අයිනාදනින් දුරුවූයේ වෙයි. කාමයෙහි මිසහසරින් දුරුවූයේ වෙයි. මුසාවායෙන් දුරුවූයේ වෙයි. පිසුණු බසින් දුරුවූයේ වෙයි. පරොස්බසින් දුරුවූයේ වෙයි. පලපින් දුරුවූයේ වෙයි. දළ ලෝභ නැතියේ වෙයි. ව්‍යාපාදයට නොපත් සිත් ඇතියේ වෙයි. සම්‍යග්දෘෂ්ටික වෙයි. මහණෙනි, මේ ශුක්ලවිපාක ඇති ශුක්ලකර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෘෂ්ණශුක්ලවිපාක ඇති කෘෂ්ණශුක්ලකර්‍මය කවරේ ය? මහණෙනි, මෙලොව ඇතැමෙක් සදොස් වූ ද නිදොස් වූ ද කායසංස්කාර රැස් කෙරෙයි ... මහණෙනි, මේ කෘෂ්ණශුක්ල විපාක ඇති කෘෂ්ණශුක්ලකර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කර්‍මක්‍ෂය පිණිස පවත්නා අකෘෂ්ණ අශුක්ලවිපාක ඇති අකෘෂ්ණ අශුක්ලකර්‍මය කවරේ ය? මහණෙනි, එහි ලා යම් කර්‍මයක් කෘෂ්ණ වේ ද කෘෂ්ණවිපාක ඇත්තේ වේ ද [ඒ කර්‍මයාගේ ප්‍රහාණය පිණිස යම් චේතනායෙක් ඇද් ද] ... මහණෙනි, කර්‍මක්‍ෂය පිණිස පවත්නා මෙය අකෘෂ්ණ අශුක්ලවිපාක ඇති අකෘෂ්ණ අශුක්ලකර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කර්‍මයෝ මා විසින් තමන් ම විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්‍ෂ කොට වදාරණ ලදහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.4.6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සවන කර්‍ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "37. මහණෙනි, මේ සතර කර්‍මයෝ මා විසින් තමන් ම විශිෂ්ටඥානයෙන් දැන සාක්‍ෂාත් කොට වදාරණ ලදහ. කවර සතර කර්‍මයහ යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෘෂ්ණවිපාක ඇති කෘෂ්ණ කර්‍මයෙක් ඇත. ශුක්ලවිපාක ඇති ශුක්ලකර්‍මයෙක් ඇත. කෘෂ්ණශුක්ලවිපාක ඇති කෘෂ්ණශුක්ලකර්‍මයෙක් ඇත. කර්‍මක්‍ෂය පිණිස පවත්නා අකෘෂ්ණ අශුක්ලවිපාක ඇති අකෘෂ්ණ අශුක්ලකර්‍මයෙක් ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෘෂ්ණවිපාක ඇති කෘෂ්ණකර්‍මය කවරේ ය? මහණෙනි, මෙලොව ඇතැමෙක් සදොස් වූ කායසංස්කාරය රැස් කෙරෙයි ... මහණෙනි, මේ කෘෂ්ණවිපාක ඇති කෘෂ්ණකර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ශුක්ලවිපාක ඇති ශුක්ලකර්‍මය කවරේ ය? මහණෙනි, මෙලොව ඇතැමෙක් නිදොස් වූ කායසංස්කාරය රැස් කෙරෙයි ... මහණෙනි, මේ ශුක්ලවිපාක ඇති ශුක්ලකර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෘෂ්ණශුක්ලවිපාක ඇති කෘෂ්ණශුක්ලකර්‍මය කවරේ ය? මහණෙනි, මෙලොව ඇතැමෙක් සදොස් වූ ද නිදොස් වූ ද කායසංස්කාරය රැස් කෙරෙයි ... මහණෙනි, මේ කෘෂ්ණශුක්ලවිපාක ඇති කෘෂ්ණශුක්ලකර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 456,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං අකණ්හං අසුක්කං අකණ්හඅසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති? සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. ඉදං වුච්චති භික්ඛවෙ කම්මං අකණ්හං අසුක්කං අකණ්හඅසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ චත්තාරි කම්මානි මයා සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදිතානීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 4. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සත්තමකම්මසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "38. චත්තාරිමානි භික්ඛවෙ කම්මානි මයා සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදිතානි. කතමානි චත්තාරි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි භික්ඛවෙ කම්මං කණ්හං කණ්හවිපාකං. අත්ථි භික්ඛවෙ කම්මං සුක්කං සුක්කවිපාකං. අත්ථි භික්ඛවෙ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං. අත්ථි භික්ඛවෙ කම්මං අකණ්හං අසුක්කං අකණ්හඅසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං කණ්හං කණ්හවිපාකං? ඉධ භික්ඛවෙ එකච්චො සබ්යාපජ්ඣං කායසඞ්ඛාරං අභිසඞ්ඛරොති -පෙ- (වචීසඞ්ඛාරං -පෙ- මනොසඞ්ඛාරං -පෙ-) ඉදං වුච්චති භික්ඛවෙ කම්මං කණ්හං කණ්හවිපාකං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං සුක්කං සුක්කවිපාකං? ඉධ භික්ඛවෙ එකච්චො අබ්යාපජ්ඣං කායසඞ්ඛාරං අභිසඞ්ඛරොති -පෙ- (වචීසඞ්ඛාරං -පෙ- මනොසඞ්ඛාරං -පෙ-) ඉදං වුච්චති භික්ඛවෙ කම්ම සුක්කං සුක්කවිපාකං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං? ඉධ භික්ඛවෙ එකච්චො සබ්යාපජ්ඣම්පි අබ්යාපජ්ඣම්පි කායසඞ්ඛාරං අභිසඞ්ඛරොති -පෙ- (වචීසඞ්ඛාරං -පෙ- මනොසඞ්ඛාරං -පෙ- ) ඉදං වුච්චති භික්ඛවෙ කම්මං කණ්හසුක්කං කණ්හසුක්කවිපාකං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කම්මං අකණ්හං අසුක්කං අකණ්හඅසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති? සතිසම්බොජ්ඣඞ්ගො, ධම්මවිචයසම්බොජ්ඣඞ්ගො, විරියසම්බොජ්ඣඞ්ගො, පීතිසම්බොජ්ඣඞ්ගො, පස්සද්ධිසම්බොජ්ඣඞ්ගො, සමාධිසම්බොජ්ඣඞ්ගො, උපෙක්ඛාසම්බොජ්ඣඞ්ගො. ඉදං වුච්චති භික්ඛවෙ කම්මං අකණ්හං අසුක්කං අකණ්හ අසුක්කවිපාකං කම්මක්ඛයාය සංවත්තති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ චත්තාරි කම්මානි මයා සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදිතානීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 4. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සාවජ්ජ - අනවජ්ජකම්මසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "39. චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ. කතමෙහි චතූහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සාවජ්ජෙන කායකම්මෙන, සාවජ්ජෙන වචීකම්මෙන, සාවජ්ජෙන මනොකම්මෙන, සාවජ්ජාය දිට්ඨියා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කර්‍මක්‍ෂය පිණිස පවත්නා අකෘෂ්ණ අශුක්ලවිපාක ඇති අකෘෂ්ණ අශුක්ලකර්‍මය කවරේ ය? සම්‍යග් දෘෂ්ටිය .. සම්‍යක් සමාධි යි. මහණෙනි, කර්‍මක්‍ෂය පිණිස පවත්නා මේ අකෘෂ්ණ අශුක්ලවිපාක ඇති අකෘෂ්ණ අශූකලකර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කර්‍මයෝ මා විසින් තමන් ම විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්‍ෂ කොට පවසන ලදහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.4.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සත්‍වන කර්‍ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "38. මහණෙනි, මේ සතර කර්‍මයෝ මා විසින් තමන් ම විශිෂ්ටඥානයෙන් දැන සාක්‍ෂාත් කොට ප්‍රකාශ කරණ ලදහ. කවර සතර කර්‍මයහ යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෘෂ්ණවිපාක ඇති කෘෂ්ණකර්‍මයෙක් ඇත. මහණෙනි, ශුක්ලවිපාක ඇති ශුක්ලකර්‍මයෙක් ඇත. මහණෙනි, කෘෂ්ණශුක්ලවිපාක ඇති කෘෂ්ණශුක්ලකර්‍මයෙක් ඇත. මහණෙනි, කර්‍මක්‍ෂය පිණිස පවත්නා අකෘෂ්ණ අශුක්ලවිපාක ඇති අකෘෂ්ණ අශුක්ලකර්‍මයෙක් ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෘෂ්ණවිපාක ඇති කෘෂ්ණකර්‍මය කවරේ ය? මහණෙනි, මෙලොව ඇතැමෙක් සදොස් වූ කායසංස්කාර රැස් කෙරෙයි [වාක්සංස්කාර ... මනඃසංස්කාර ... [මහණෙනි, මේ කෘෂ්ණවිපාක ඇති කෘෂ්ණකර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ශුක්ලවිපාක ඇති ශුක්ලකර්‍මය කවරේ ය? මහණෙනි, මෙලොව ඇතැමෙක් නිදොස් වූ කායසංස්කාර රැස් කෙරෙයි ... [වාක්සංස්කාර ... මනඃසංස්කාර ...] මහණෙනි, මේ ශුක්ල විපාක ඇති ශුක්ලකර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෘෂ්ණ ශුක්ලවිපාක ඇති කෘෂ්ණශුක්ලකර්‍මය කවරේ ය? මහණෙනි, මෙලොව ඇතැමෙක් සදොස් වූ ද නිදොස් වූ ද කායසංස්කාර රැස් කෙරෙයි [වාක්සංස්කාර ... මනඃසංස්කාර] මහණෙනි, මේ කෘෂ්ණශුක්ල විපාක ඇති කෘෂ්ණශුක්ලකර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කර්‍මක්‍ෂය පිණිස පවත්නා අකෘෂ්ණ අශුක්ල විපාක ඇති අකෘෂ්ණ අශුක්ලකර්‍මය කවරේ ය? ස්‍මෘතිසම්බොධ්‍යඞ්ගය, ධර්‍මවිචයසම්බෝධ්‍යඞ්ගය, වීර්‍ය්‍යයසම්බෝධ්‍යඞ්ගය, ප්‍රීතිසම්බෝධ්‍යඞ්ගය, ප්‍රශ්‍රබ්ධිසම්බෝධ්‍යඞ්ගය, සමාධිසම්බෝධ්‍යඞ්ගය, උපේක්‍ෂාසම්බෝධ්‍යඞ්ග යි. මහණෙනි, මේ කර්‍මක්‍ෂය පිණිස පවත්නා අකෘෂ්ණ අශුක්ලවිපාක ඇති අකෘෂ්ණ අශුක්ලකර්‍මය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කර්‍මයෝ මා විසින් තමන් ම විශිෂ්ටඥානයෙන් දැන සාක්‍ෂාත් කොට ප්‍රකාශ කරණ ලදහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.4.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සාවජ්ජ - අනවජ්ජ කර්‍ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "39. මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දේ යම්සේ ද, එසෙයින් නිරයෙහි වේ. කවර සතරෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සාවද්‍යකායකර්‍මයෙන, සාවද්‍යවාක්කර්‍මයෙන, සාවද්‍යමඃකර්‍මයෙන, සාවද්‍ය දෘෂ්ටියෙනැ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 458,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ චතූහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතූහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙ. කතමෙහි චතූහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනවජ්ජෙන කායකම්මෙන අනවජ්ජෙන වචීකම්මෙන, අනවජ්ජෙන මනොකම්මෙන, අනවජ්ජාය දිට්ඨියා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 4. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සබ්යාපජ්ඣ - අබ්යාපජ්ඣකම්මසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "40. චතූහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ. කතමෙහි චතූහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සබ්යාපජ්ඣෙන කායකම්මෙන, සබ්යාපජ්ඣෙනවචීකම්මෙන, සබ්යාපජ්ඣෙන මනොකම්මෙන, සබ්යාපජ්ඣාය දිට්ඨියා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතූහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙ. කතමෙහි චතූහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අබ්යාපජ්ඣෙන කායකම්මෙන, අබ්යාපජ්ඣෙන වචීකම්මෙන, අබ්යාපජ්ඣෙන මනොකම්මෙන, අබ්යාපජ්ඣාය දිට්ඨියා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 4. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "( සමණසුත්තං )",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "41. ඉධෙව භික්ඛවෙ සමණො, ඉධ දුතියො සමණො, ඉධ තතියො සමණො, ඉධ චතුත්ථො සමණො, සුඤ්ඤා පරප්පවාදා සමණෙහි අඤ්ඤෙති. එවමෙතං භික්ඛවෙ සම්මා සීහනාදං නදථ."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ සමණො? ඉධ භික්ඛවෙ භික්ඛු තිණ්ණං සංයොජනානං පරික්ඛයා සොතාපන්නො හොති අවිනිපාතධම්මො නියතො සම්බොධිපරායණො. අයං භික්ඛවෙ සමණො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ දුතියො සමණො? ඉධ භික්ඛවෙ භික්ඛු තිණ්ණං සංයොජනානං පරික්ඛයා රාගදොසමොහානං තනුත්තා සකදාගාමී හොති, සකිදෙව ඉමං ලොකං ආගන්ත්වා දුක්ඛස්සන්තං කරොති. අයං භික්ඛවෙ දුතියො සමණො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දේ යම්සේ ද, එපරිදි නිරයෙහි වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දේ යම්සේ ද, එසෙයින් ස්වර්‍ගයෙහි වේ. කවර සතරෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "අනවද්‍ය කායකර්‍මයෙන, අනවද්‍ය වාක්කර්‍මයෙන, අනවද්‍ය මනඃකර්‍මයෙන, අනවද්‍ය දෘෂ්ටියෙනැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දේ යම්සේ ද, එසේ ස්වර්‍ගයෙහි වේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.4.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සඛ්‍යාපජ්ඣ - අබ්‍යාපජ්ඣ කර්‍ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "40. මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දේ යම්සේ ද, එසෙයින් නිරයෙහි වේ. කවර සතරෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සදොස් වූ කායකර්‍මයෙන, සදොස් වූ වාක්කර්‍මයෙන, සදොස් වූ මනඃකර්‍මයෙන, සදොස් වූ දෘෂ්ටියෙනැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දේ යම් සේ ද, එසෙයින් නිරයෙහි වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දේ යම්සේ ද, එසෙයින් ස්වර්‍ගයෙහි වේ. කවර සතරෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නිදොස් වූ කායකර්‍මයෙන, නිදොස් වූ වාක්කර්‍මයෙන, නිදොස් වූ මනඃකර්‍මයෙන, නිදොස් වූ දෘෂ්ටියෙනැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තබන ලද්දේ යම්සේ ද, එසෙයින් ස්වර්‍ගයෙහි වේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.4.10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සමණ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "41. මහණෙනි, ප්‍රථම (ස්‍රෝතාපන්න) මහණ ද මෙසස්නෙහිම ය. දෙවන (සකෘදාගාමී) මහණ ද මෙසස්නෙහිම ය. තෙවන (අනාගාමී) මහණ ද මෙසස්නෙහි ම ය. සිවුවන (අර්‍හත්) මහණ ද මෙසස්නෙහි ම ය. අන්‍ය වූ පරප්‍රවාදයෝ ශ්‍රමණයන් කෙරෙන් තොරයහ යි. මහණෙනි, මෙසේ මොනොවට සිංහනාද කරව.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ප්‍රථම (ස්‍රෝතාපන්න) ශ්‍රමණ කවරේ ය? මහණෙනි, මෙසස්නෙහි මහණ ත්‍රිවිධසංයෝජනයන්ගේ ක්‍ෂය කිරීමෙන් අවිනිපාතස්වභාව ඇති නියත වූ සම්බෝධිපරායණ වූ ස්‍රොතාපන්නයෙක් වේ. මහණෙනි, මේ (ප්‍රථම) ශ්‍රමණ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, දෙවන මහණ කවරේ ය? මහණෙනි, මෙසස්නෙහි මහණ ත්‍රිවිධසංයෝජනයන් ක්‍ෂය කිරීමෙන් රාගද්වේෂමෝහයන් තුනු බැවින් සකෘදාගාමී වෙයි. එක් වරක් ම මෙලොවට අවුත් දුක් කෙළවර කෙරෙයි. මහණෙනි, මේ දෙවන මහණ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 460,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ තතියො සමණො? ඉධ භික්ඛවෙ භික්ඛු පඤ්චන්නං ඔරම්භාගියානං සංයොජනානං පරික්ඛයා ඔපපාතිකො හොති තත්ථ පරිනිබ්බායී අනාවත්තිධම්මො තස්මා ලොකා අයං භික්ඛවෙ තතියො සමණො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ චතුත්ථො සමණො? ඉධ භික්ඛවෙ භික්ඛු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති. අයං භික්ඛවෙ චතුත්ථො සමණො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධෙව භික්ඛවෙ සමණො, ඉධ දුතියො සමණො, ඉධ තතියො සමණො, ඉධ චතුත්ථො සමණො. සුඤ්ඤා පරප්පවාදා සමණෙහි අඤ්ඤෙ’ති. එවමෙතං භික්ඛවෙ සම්මා සීහනාදං නදථාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 4. 5. 11.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සප්පුරිසානිසංසසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "42. සප්පුරිසං භික්ඛවෙ නිස්සාය චත්තාරො ආනිසංසා පාටිකඞ්ඛා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අරියෙන සීලෙන වඩ්ඪති, අරියෙන සමාධිනා වඩ්ඪති, අරියාය පඤ්ඤාය වඩ්ඪති, අරියාය විමුත්තියා වඩ්ඪති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සප්පුරිසං භික්ඛවෙ නිස්සාය ඉමෙ චත්තාරො ආනිසංසා පාටිකඞ්ඛාති."
                    },
                    {
                        "type": "centered",
                        "text": "කම්මවග්ගො චතුත්ථො. {*}",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "*. තස්සුද්දානං: \nසංඛිත්තවිත්ථාර සොණකායන සික්ඛාපදං අරියමග්ගො \nසාවජ්ජඤ්චෙව අබ්යාපජ්ඣං සමණො ච සප්පුරිසානිසංසොතිං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, තෙවන මහණ කවරේ ය? මහණෙනි, මෙසස්නෙහි මහණ පඤ්ච ඕරම්භාගිය සංයෝජනයන් ක්‍ෂය කිරීමෙන් එ බඹලොව පිරිනිවෙනසුලු එලොවින් වටාලා නොඑනසුලු ඕපපාතික වේ. මහණෙනි, මේ තෙවන මහණ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සිවුවන මහණ කවරේ ය? මහණෙනි, මෙසස්නෙහි මහණ ආස්‍රවක්‍ෂය කිරීමෙන් අනාස්‍රව වූ චේතෝවිමුක්තිය ප්‍රඥාවිමුක්තිය ඉහාත්මයෙහි තමන් විසින් ම විශිෂ්ටඥානයෙන් දැන සාක්‍ෂාත් කොට එළඹ වෙසේ, මහණෙනි, මේ සිවුවන මහණ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පළමු මහණ මෙසස්නෙහි ය. දෙවන මහණ මෙසස්නෙහි ය. තෙවන මහණ මෙසස්නෙහි ය. සිවුවන මහණ මෙසස්නෙහි ය. අන්‍ය වූ පරප්‍රවාදයෝ මහණුන් කෙරෙන් තොරයහ. මහණෙනි, මෙසේ මොනොවට තෙල සිංහනාදය කරව.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.4.11.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සප්පුරිසානිසංස සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "42. මහණෙනි, සත්පුරුෂයා නිසා අනුසස් සතරෙක් කැමැතිවිය යුතුයි. කවර සතරෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආර්‍ය්‍යශීලයෙන් වැඩෙයි. ආර්‍ය්‍යසමාධියෙන් වැඩෙයි. ආර්‍ය්‍යප්‍රඥායෙන් වැඩෙයි. ආර්‍ය්‍යවිමුක්තියෙන් වැඩෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සත්පුරුෂයා නිසා මේ සතර අනුසස් කැමැතිවිය යුතුයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "කර්‍මවර්‍ගය සිවුවැනි යි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 462,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "5. ආපත්තිභයවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 5. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පාපභික්ඛුසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "43. එකං සමයං භගවා **කොසම්බියං** විහරති **ඝොසිතාරාමෙ**. අථ ඛො ආයස්මා **ආනන්දො** යෙන භගවා තෙනුපසඞ්කමි, උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො ආයස්මන්තං ආනන්දං භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අපි නු තං ආනන්ද අධිකරණං වුපසන්තන්ති? “කුතො තං. භන්තෙ අධිකරණං වුපසමිස්සති, ආයස්මතො භන්තෙ **අනුරුද්ධස්ස බාහියො** නාම සද්ධිවිහාරිකො කෙවලකප්පං සඞ්ඝභෙදාය ඨිතො. තත්ථායස්මා අනුරුද්ධො න එකවාචිකම්පි භණිතබ්බං මඤ්ඤතී” ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කදා පනානන්ද අනුරුද්ධො සඞ්ඝමජ්ඣෙ අධිකරණෙසු වොයුඤ්ජති? නනු ආනන්ද යානි කානි චි අධිකරණානි උප්පජ්ජන්ති සබ්බානි තානි තුම්හෙ චෙව වූපසමෙථ **සාරිපුත්තමොග්ගල්ලානා** ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "චත්තාරොමෙ ආනන්ද අත්ථවසෙ සම්පස්සමානො පාපභික්ඛු සඞ්ඝභෙදෙන නන්දති. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධානන්ද පාපභික්ඛු දුස්සීලො හොති පාපධම්මො අසුචි සඞ්කස්සරසමාචාරො පටිච්ඡන්නකම්මන්තො අස්සමණො සමණපටිඤ්ඤො අබ්රහ්මචාරී බ්රහ්මචාරීපටිඤ්ඤො අන්තොපූති අවස්සුතො කසම්බුජාතො. තස්ස එවං හොති: “සචෙ ඛො මං භික්ඛූ ජානිස්සන්ති: ‘දුස්සීලො පාපධම්මො අසුචි සංකස්සරසමාචාරො පටිච්ඡන්නකම්මන්තො අස්සමණො සමණපටිඤ්ඤො අබ්රහ්මචාරී බ්රහ්මචාරීපටිඤ්ඤො අන්තොපූති අවස්සුතො කසම්බුජාතො’ති. සමග්ගා මං සන්තා නාසිස්සන්ති. වග්ගා පන මං න නාසිස්සන්තී”__ති__{1}. ඉදං ආනන්ද පඨමං අත්ථවසං සම්පස්සමානො පාපභික්ඛු සඞ්ඝභෙදෙන නන්දති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං ආනන්ද පාපභික්ඛු මිච්ඡාදිට්ඨිකො හොති අන්තග්ගාහිකාය දිට්ඨියා සමන්නාගතො. තස්ස එවං හොති: “සචෙ ඛො මං භික්ඛූ ජානිස්සන්ති ‘මිච්ඡාදිට්ඨිකො අන්තග්ගාහිකාය දිට්ඨියා සමන්නාගතො’ති. සමග්ගා මං සන්තා නාසිස්සන්ති. වග්ගා පන මං න නාසිස්සන්තී”ති. ඉදං ආනන්ද දුතියං අත්ථවසං සම්පස්සමානො පාපභික්ඛු සඞ්ඝභෙදෙන නන්දති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. නාසෙස්සන්ති මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "5. ආපත්තිභය වර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4.5.5.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පාපභික්ඛු සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "43. එක් කලෙක භාග්‍යවතුන් වහන්සේ කොසඹෑනුවර ඝෝෂිතාරාම යෙහි වැඩ වසන සේක. ඉක්බිති ආයුෂ්මත් අනඳ තෙරණුවෝ භාග්‍යවතුන් වහන්සේ කරා එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ සකසා වැඳ එකත්පස්ව හුන්හ. එකත්පස්ව හුන් ආයුෂ්මත් අනඳ තෙරණුවන්ට භාග්‍යවතුන් වහන්සේ තෙල වදාළහ:",
                        "type": "paragraph"
                    },
                    {
                        "text": "කිම ආනන්‍දය, ඒ (උපන්) අධිකරණය සන්සිඳුනේ වේ ද? “වහන්ස, කෙසේ ඒ අධිකරණ සන්සිඳෙන්නේ වේ ද, වහන්ස, ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේගේ බාහිය නම් සද්ධිවිහාරිකයෙක් වටාගෙණ සඟුන් හි විරුද්ධවාදයට සිටියේ ය. එහි ලා ආයුෂ්මත් අනුරුද්ධස්ථවිරයන් වහන්සේ එක් බසකුත් බිණියයුතු සේ නහමක් සිතත්.”",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්‍දය, කිනම් දිනෙක අනුරුද්ධ සඟුන් මැද අධිකරණයෙහි අනුයෝගවතට නැගේ ද, ආනන්‍දය, යම්කිසි අධිකරණ කෙනෙක් ඇද්ද, එ හැම තෙපි හෝ සන්සිඳුවන්නාහු නො වේ ද, සැරියුත් මුගලන් දෙනම හෝ සන්සිඳුවන්නාහු නො වේ ද,",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්‍දය, මේ සතර කරුණක් දක්මින් පවිටු මහණ සඞ්ඝභේදයෙන් සතුටු වෙයි. කවර සතර කරුණෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්‍දය, මෙසස්නෙහි පවිටු මහණ දුසිල් වූයේ, ලමුදහම් ඇතියේ, කෙලෙසුන් විසින් අපවිත්‍ර වූයේ, සැකයෙන් සිහිකළ යුතු හැසිරීම් ඇතියේ, පිළිසන් කර්‍මාන්ත ඇතියේ, අශ්‍රමණ වූයේත්, ‘ශ්‍රමණයෙමි යි’ ප්‍රතිඥා කරණුයේ, අබ්‍රහ්මචාරී වූයේත්, ‘බ්‍රහ්මචාරීමි’ යි ප්‍රතිඥා කරණුයේ, කෙලෙසුන් විසින් ඇතුළත දුඟඳ වූයේ, කෙලෙසුන් විසින් තෙත් වූයේ, හටගත් කෙලෙස්කසළ ඇතියේ වෙයි. ඔහුට මෙබඳු සිතෙක් වෙයි: “ඉදින් මහණහු සිල් නැත්තෙක, පාපධර්‍ම ඇත්තෙක, කෙලෙසුන් විසින් අපවිත්‍රයෙක, සැකයෙන් සිහි කළයුතු හැසිරීම් ඇත්තෙක, පිළිසන් කර්‍මාන්ත ඇත්තෙක, අශ්‍රමණ වූයේත් ‘ශ්‍රමණයෙමි’ යි ප්‍රතිඥා කරන්නෙක, අබ්‍රහ්මචාරී වූයේත්, ‘බ්‍රහ්මචාරීමි’ යි ප්‍රතිඥා කරන්නෙක, කෙලෙසුන් විසින් ඇතුළත දුඟඳ වූයෙක, කෙලෙසුන් විසින් තෙත් වූයෙක, උපන් කෙලෙස් කසළ ඇතියෙකැ’ යි මා දනිත් නම් සමග වූ ඒ මහණහු මා නෙරත්. වැලිත් වර්‍ග වූවාහු මා නො නෙරත්” කියා යි ආනන්‍දය, මේ පළමුවන කරුණ දක්මින් පවිවු මහණ සඞ්ඝභේදයෙන් තුටු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තවද ආනන්‍දය, පවිටු මහණ මිසදුටු ඇතියේ අන්තග්‍රාහදෘෂ්ටියෙන් සමන්‍වාගත වූයේ වෙයි. ඔහුට මෙබඳු සිතෙක් වෙයි: “ඉදින් භික්‍ෂූහු මිථ්‍යාදෘෂ්ටිකයෙක, අන්තග්‍රාහදෘෂ්ටියෙන් සමන්‍වාගතයෙකැ’ යි මා දනිත් ද, සමඟ වූවාහු මා නෙරත්. වර්‍ග වූවාහු මා නො නෙරත් ය” කියා යි. ආනන්‍දය, මේ දෙවන කරුණ දක්මින් පවිටු මහණ සඞ්ඝභේදයෙන් තුටු වෙයි:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 464,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං ආනන්ද පාපභික්ඛු මිච්ඡාආජීවො හොති. මිච්ඡාජීවෙන ජීවිකං කප්පෙති. තස්ස එවං හොති: “සචෙ ඛො මං භික්ඛූ ජානිස්සන්ති: ‘මිච්ඡාආජීවො මිච්ඡාආජීවෙන ජීවිකං කප්පෙතී’ති. සමග්ගා පන මං නාසිස්සන්ති. වග්ගා පන මං න නාසිස්සන්ති”ති. ඉදං ආනන්ද තතියං අත්ථවසං සම්පස්සමානො පාපභික්ඛු සඞ්ඝභෙදෙන නන්දති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං ආනන්ද පාපභික්ඛු ලාභකාමො හොති සක්කාරකාමො අනවඤ්ඤත්තිකාමො. තස්ස එවං හොති: “සචෙ ඛො මං භික්ඛු ජානිස්සන්ති: ‘ලාභකාමො සක්කාරකාමො අනවඤ්ඤත්තිකාමො’ති, සමග්ගා මං න සක්කරිස්සන්ති න ගරුකරිස්සන්ති න මානෙස්සන්ති න පූජෙස්සන්ති. වග්ගා පන මං සක්කරිස්සන්ති ගරුකරිස්සන්ති මානෙස්සන්ති පූජෙස්සන්තී”ති. ඉදං ආනන්ද චතුත්ථං අත්ථවසං සම්පස්සමානො පාපභික්ඛු සඞ්ඝභෙදෙන නන්දති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො ආනන්ද චත්තාරො අත්ථවසෙ සම්පස්සමානො පාපභික්ඛු සඞ්ඝභෙදෙන නන්දතීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 5. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ආපත්තිභය සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "44. චත්තාරිමානි භික්ඛවෙ ආපත්තිභයානි. කතමානි චත්තාරි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි භික්ඛවෙ චොරං ආගුචාරිං ගහෙත්වා රඤ්ඤො දස්සෙය්යුං “අයං තෙ දෙව චොරො ආගුචාරී, ඉමස්ස දෙවො දඬං පණෙතූ”ති. තමෙනං රාජා එවං වදෙය්ය: ගච්ඡථ භො ඉමං පුරිසං දළ්හාය රජ්ජුයා පච්ඡාබාහං ගාළ්හබන්ධනං බන්ධිත්වා ඛුරමුණ්ඩං කරිත්වා ඛරස්සරෙන පණවෙන රථියාය රථියං{1} සිඞ්ඝාටකෙන සිඞ්ඝාටකං පරිනෙත්වා දක්ඛිණද්වාරෙන නික්ඛාමෙත්වා දක්ඛිණතො නගරස්ස සීසං ඡින්දථාති. තමෙනං රඤ්ඤො පුරිසා දළ්හාය රජ්ජුයා පච්ඡාබාහං ගාළ්හබන්ධනං බන්ධිත්වා ඛුරමුණ්ඩං කරිත්වා ඛරස්සරෙන පණවෙන රථියාය රථියං සිඞ්ඝාටකෙන සිඞ්ඝාටකං පරිනෙත්වා දක්ඛිණද්වාරෙන නික්ඛාමෙත්වා දක්ඛිණතො නගරස්ස සීසං ඡින්දෙය්යුං. තත්රඤ්ඤතරස්ස ථලට්ඨස්ස පුරිසස්ස එවමස්ස පාපකං වත භො අයං පුරිසො කම්මං අකාසි ගාරය්හං සීසච්ඡෙජ්ජං, යත්ර හි නාම රඤ්ඤො පුරිසා දළ්හාය රජ්ජුයා පච්ඡාබාහං ගාළ්හබන්ධනං බන්ධිත්වා ඛුරමුණ්ඩං කරිත්වා ඛරස්සරෙන පණවෙන රථියාය රථියං සිඞ්ඝාටකෙන සිඞ්ඝාටකං පරිනෙත්වා දක්ඛිණද්වාරෙන නික්ඛාමෙත්වා දක්ඛිණතො නගරස්ස සීසං ඡින්දිස්සන්ති. සො වතස්සාහං{2} එවරූපං පාපං කම්මං න කරෙය්යං{3} ගාරය්හං සීසච්ඡෙජ්ජන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ යස්ස කස්සචි භික්ඛුස්ස වා භික්ඛුනියා වා එවං තිබ්බා භයසඤ්ඤා පච්චුපට්ඨිතා හොති පාරාජිකෙසු ධම්මෙසු, තස්සෙතං පාටිකඞ්ඛං: අනාපන්නො වා පාරාජිකං ධම්මං න ආපජ්ජිස්සති. ආපන්නො වා පාරාජිකං ධම්මං යථාධම්මං පටිකරිස්සති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. රථිකාය රථිකායං - මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "2. සොවතස්සාවං - සීමු. මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. න කරෙය්ය - සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "තවද ආනන්‍දය, පවිටු මහණ මිථ්‍යාආජීව ඇති වෙයි. මිථ්‍යාආජීවයෙන් ජීවිකාව කෙරෙහි. ඔහුට මෙබඳු සිතෙක් වෙයි: “ඉදින් මහණහු ‘මිථ්‍යා ආජීව ඇතියෙක. මිථ්‍යා ආජීවයෙන් ජීවිකා කෙරේ ය’යි මා දනිත් නම්, සමග්‍ර වූවාහු මා නෙරත්, ව්‍යග්‍ර වූවාහු මා නො නෙරත්ය” කියා යි. ආනන්‍දය, මේ තුන්වන කරුණ දක්මින් පවිටු මහණ සඞ්ඝභේදයෙන් තුටු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තවද ආනන්‍දය, පවිටු මහණ ලාභ කැමැති වෙයි. සත්කාර කැමැති වෙයි. නොගරහනු කැමැති වෙයි. ඔහුට මෙබඳු සිතෙක් වෙයි: “ඉදින් මහණහු ‘ලාභ කැමතියෙක, සත්කාර කැමතියෙක, නොගරහනු කැමැතියෙකැ’ යි මා දනිත් නම්, සමග්‍ර වූවාහු මා නෙරත්, ගරු නො කෙරෙත්, බුහුමන් නො කෙරෙත්, නොපුදත්. ව්‍යග්‍ර වූවාහු මට සත්කාර කරත්, ගරු කරත්, බුහුමන් කෙරෙත්, පූජා කෙරෙති” යි කියා යි. ආනන්‍දය, මේ සතරවන කරුණ දක්මින් පවිටු මහණ සඞ්ඝභේදයෙන් තුටු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්‍දය, මේ සතර කරුණු දක්මින් පවිටු මහණ සඞ්ඝභේදයෙන් තුටු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.5.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආපත්තිභය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "44. මහණෙනි, මේ ආපත්‍තිභය සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් පරිදි අපරාධ කරණ සොරහු ගෙණ රජුට දක්වත් ද, “දේවයෙනි, තොපට මේ සොරා අපරාධකාරීය. මොහුට දේවයෝ දඬුවම් එළවත්වා” කියා යි. රජ තුලුන් ගෙණ මෙසේ කිය යි: ‘භවත්නි, යව මේ මිනිසා දළරැහැණින් දොහොත් පිටත් කොට දැඩිසේ බැඳ කර මුඩු කොට කැකුළු හඬ ඇති වදබෙරින් වීථියෙන් වීථියට මංසන්‍ධියෙන් මංසන්‍ධියට හැද ගෙණ ගොස් දකුණු දොරින් නෙරවා නුවරට දකුණු දික්හි හිස සිඳුව” කියා යි. රජුගේ පුරුෂයෝ ඒ සොරහු දළරැහැණින් දොහොත පිටත ලා හයා දැඩි කොට බැඳ කර මුඩු කොට කැකුළු හඬ ඇති වදබෙරින් වීථියෙන් වීථියට මංසන්‍ධියෙන් මංසන්‍ධියට ගෙණ ගොස් දකුණු දොරින් නෙරවා නුවරට දකුණෙහි හිස සිඳිත්. එහි එකත්පස්ව සිටුනා අන්‍යතර පුරුෂයකුට මෙබඳු සිතෙක් වෙයි: “භවත්නි, යම් කර්‍මයක් නිසා යම් පුරුෂයකු රජහුගේ පුරුෂයෝ දළරැහැණින් දෙ අත් පිටත ලා හයා දැඩි කොට බැඳ කර මුඬු කොට කැකුළු හඬ ඇති පණාබෙරින් වීථියෙන් වීථියට මංසන්‍ධියෙන් මංසන්‍ධියට ගෙණ ගොස් දකුණු දොරින් නෙරවා නුවරට දකුණෙහි හිස සිඳින්නාහු ද, “මේ මිනිස් තෙමේ ගැරහිය යුතු හිස සිඳලිය යුතු එබඳු ලාමක කර්‍මයක් කෙළේම ය. හෙ මම නම් මෙබඳු ගැරහියයුතු හිස් සිඳියයුතු පාපකර්‍මයක් නො කෙරෙමි” යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම යම් කිසි මහණකුට හෝ මෙහෙණකට හෝ පරිජිදහම්හි මෙසේ තීව්‍රභය සංඥා එළඹ සිටී ද, ඔහුට තෙල කැමැති වියයුතුයි: පරිජිඅවැතට නො පැමිණියේ පරිජිඇවැතට නො පැමිණෙන්නේ ය. පරිජිඇවැතට අවන්නේ හෝ ධර්‍මානුරූප කොට ප්‍රතිකර්‍ම කරන්නේ ය (=හෙරණ බැව්හි සිටුනේ ය.)",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 466,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි භික්ඛවෙ පුරිසො කාළකං වත්ථං{1} පරිධාය කෙසෙ පකිරිත්වා මුසලං ඛන්ධෙ ආරොපෙත්වා මහාජනකායං උපසඞ්කමිත්වා එවං වදෙය්ය: “අහං භන්තෙ පාපං කම්මං අකාසිං ගාරය්හං මොසල්ලං. යෙන මෙ ආයස්මන්තො අත්තමනා හොන්ති තං කරොමී”ති. තත්රඤ්ඤතරස්ස ථලට්ඨස්ස පුරිසස්ස එවමස්ස: “පාපකං වත භො අයං පුරිසො කම්මං අකාසි ගාරය්හං මොසල්ලං, යත්ර හි නාම කාළකං වත්ථං පරිධාය කෙසෙ පකිරිත්වා මුසලං ඛන්ධෙ ආරොපෙත්වා මහාජනකායං උපසඞ්කමිත්වා එවං වක්ඛති: ‘අහං භන්තෙ පාපං කම්මං අකාසිං ගාරය්හං මොසල්ලං. යෙන මෙ ආයස්මන්තො අත්තමනා හොන්ති, තං කරොමී”ති. සො වතස්සාහං එවරූපං පාපං කම්මං න කරෙය්යං ගාරය්හං මොසල්ලන්ති”."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ යස්ස කස්ස චි භික්ඛුස්ස වා භික්ඛුනියා වා එවං තිබ්බා භයසඤ්ඤා පච්චුපට්ඨිතා හොති සඞ්ඝාදිසෙසෙසු ධම්මෙසු, තස්සෙතං පාටිකඞ්ඛං: අනාපන්නො වා සඞ්ඝාදිසෙසං ධම්මං න ආපජ්ජිස්සති. ආපන්නො වා සඞ්ඝාදිසෙසං ධම්මං න ආපජ්ජිස්සති. ආපන්නො වා සඞ්ඝාදිසෙසං ධම්මං යථාධම්මං පටිකරිස්සති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි භික්ඛවෙ පුරිසො කාළකං වත්ථං පරිධාය කෙසෙ පකිරිත්වා අස්සපුටං{2} ඛන්ධෙ ආරොපෙත්වා මහාජනකායං උපසඞ්කමිත්වා එවං වදෙය්ය: “අහං භන්තෙ පාපං කම්මං අකාසිං ගාරය්හං අස්සපුටං යෙන මෙ ආයස්මන්තො අත්තමනා හොන්ති, තං කරොමී”ති. තත්රඤ්ඤතරස්ස ථලට්ඨස්ස පුරිසස්ස එවමස්ස: “පාපකං වත භො අයං පුරිසො කම්මං අකාසි ගාරය්හං අස්සපුටං. යත්ර හි නාම කාළකං වත්ථං පරිධාය කෙසෙ පකිරිත්වා අස්සපුටං ඛන්ධෙ ආරොපෙත්වා මහාජනකායං උපසඞ්කමිත්වා එවං වක්ඛති: ‘අහං භන්තෙ පාපං කම්මං අකාසිං ගාරය්හං අස්සපුටං. යෙන මෙ ආයස්මන්තො අත්තමනා හොන්ති, තං කරොමී’ති. සො වතස්සාහං එවරූපං පාපං කම්මං න කරෙය්යං ගාරය්හං අස්සපුටන්ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ යස්ස කස්ස චි භික්ඛුස්ස වා භික්ඛුනියා වා එවං තිබ්බා භයසඤ්ඤා පච්චුපට්ඨිතා හොති පාචිත්තියෙසු ධම්මෙසු, තස්සෙතං පාටිකඞ්ඛං: අනාපන්නො වා පාචිත්තියං ධම්මං න ආපජ්ජිස්සති. ආපන්නො වා පාචිත්තියං ධම්මං යථා ධම්මං පටිකරිස්සති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි භික්ඛවෙ පුරිසො කාළකං වත්ථං පරිධාය කෙසෙ පකිරිත්වා මහාජනකායං උපසඞ්කමිත්වා එවං වදෙය්ය: “අහං භන්තෙ පාපං කම්මං අකාසිං ගාරය්හං උපවජ්ජං. යෙන මෙ ආයස්මන්තො අත්තමනා හොන්ති, තං කරොමී”ති. තත්රඤ්ඤතරස්ස ථලට්ඨස්ස පුරිසස්ස එවමස්ස. “පාපකං වත භො අයං පුරිසො කම්මං අකාසි ගාරය්හං උපවජ්ජං, යත්ර හි නාම කාළකං වත්ථං පරිධාය කෙසෙ පකිරිත්වා මහාජනකායං උපසඞ්කමිත්වා එවං වක්ඛති: ‘අහං භන්තෙ පාපං කම්මං අකාසිං ගාරය්හං උපවජ්ජං. යෙන මෙ ආයස්මන්තො අත්තමනා හොන්ති, තං කරොමී”ති. සො වතස්සාහං එවරූපං පාපං කම්මං න කරෙය්යං ගාරය්හං උපවජ්ජන්ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ යස්ස කස්සචි භික්ඛුස්ස වා භික්ඛුනියා වා එවං තිබ්බා භයසඤ්ඤා පච්චුපට්ඨිතා හොති පාටිදෙසනීයෙසු ධම්මෙසු, තස්සෙතං පාටිකඞ්ඛං: අනාපන්නො වා පාටිදෙසනීයං ධම්මං න ආපජ්ජිස්සති. ආපන්නො වා පාටිදෙසනීයං ධම්මං යථා ධම්මං පටිකරිස්සති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ චත්තාරි ආපත්තිභයානීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කාලවත්ථං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. භසමපුටං. මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, යම් පරිදි පුරුෂයෙක් කළුවතක් හැඳ කෙස් විසුරුවා ගෙණ මොහොලක් කර නගා ගෙණ මහජනකායට වැද මෙසේ කියන්නේ වේ ද: භවත්නි, මම ගැරහිය යුකු මොහොල් පහරට නිසි පාපකර්‍මයක් කෙළෙමි ආයුෂ්මත්හු මට දෙන යම් දඬුවමෙකින් සතුටු වවු නම්, එය කෙරෙමි කියා යි එහි දී එකත්පස් ව සිටුනා එක්තරා පුරුෂයකුට මෙබඳු සිතෙක් වෙයි: “භවත්නි, ‘මම ගැරහිය යුතු මොහොලින් පහර දිය යුතු පාපකර්‍මයක් කෙළෙමි. ආයුෂ්මත්හු මට කරණ යම් දඬුවමෙකින් සතුටු වවු ද ඒ කෙරෙමි” යි යම් පුරුෂයෙක් කළුවතක් හැඳ කෙස් විසුරුවා ගෙණ මොහොලක් කර නගා ගෙණ මහජනකායට එළඹ මෙසේ කී ද’, මේ පුරුෂ ගැරහිය යුතු, මොහොලින් පහර දියයුතු, එබඳු පව්කමක් කෙළේය. හේ මම නම් එබඳු ගැරහිය යුතු මොහොලින් පහර දියයුතු පාපකර්‍මයක් නො කෙරෙම් ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම යම් කිසි මහණෙකුට හෝ මෙහෙණකට හෝ සඟවෙසෙස් ඇවැත්හි මෙබඳු තීව්‍රභයසංඥා එළඹ සිටියා වේ ද, ඔහුට තෙල කැමැති වියයුතුයි: සඟවෙසෙස් ඇවතට නො පැමිණියේ හෝ නො අවදනේ ය. සඟවෙසෙස් ඇවතට අවන්නේ හෝ ධර්‍මානුකූල කොට ප්‍රතිකර්‍ම කරන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් පරිදි පුරුෂයෙක් කළුවතක් හැඳ කෙස් විසුරුවා ගෙණ හළු පොදියක් කර නගා ගෙණ මහාජනකායට වැඳ මෙසේ කියන්නේ වේ ද: “භවත්නි, මම හළුපොදියෙන් හිසැ පැහැරිය යුතු පාපකර්‍මයක් කෙළෙමි. ආයුෂ්මත්හු මට කරණ යම් දඬුවමෙකින් සතුටු වවු ද, එය කෙරෙමි” යි. එහිදී එකත්පස්ව සිටුනා එක්තරා පුරුෂයකුට මෙබඳු සිතෙක් වෙයි: “භවත්නි, ‘මම ගැරහිය යුතු හළු පොදියෙන් හිස පහර දුනමනා පාපකර්‍මයක් කෙළෙමි. ආයුෂ්මත්හු මට කරණ යම් දඬුවමෙකින් සතුටු වවු ද, එය කෙරෙමි’ යි කියා යම් පුරුෂයෙක් කළුවතක් හැඳ කෙස් විසුරුවා ගෙණ හළුපොදියක් කර නගා ගෙණ මහජනකායට එළඹ මෙසේ කීයේ වේ ද, හේ මම නම් මෙබඳු ගැරහිය යුතු හළු පොදියක් නගා පහළ යුතු පාපකර්‍මයක් නො කෙරෙමි” යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම යම් කිසි මහණකුට හෝ මෙහෙණකට හෝ පචිති ඇවැත්හි මෙසේ තීව්‍ර වූ භය සංඥාව එළඹ සිටියා වේ ද, ඔහුට තෙල කැමැති විය යුතුය: පචිති ඇවැතට නො පැමිණියේ හෝ එයට නො අවදනේ යි. පචිති ඇවැතට අවන්නේ හෝ ධර්‍මානුකූල කොට ප්‍රතිකර්‍ම කරන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් පරිදි පුරුෂයෙක් කළුවතක් හැඳ කෙස් විසුරුවා ගෙණ මහජනකායට වැද මෙසේ කියන්නේ වේ ද: “භවත්නි, මම ගැරහිය යුතු උපවාද කළ යුතු පාපකර්‍මයක් කෙළෙමි. ආයුෂ්මත්හු මට කරණ යම් දඬුවමකින් සතුටු වවු ද, එය කෙරෙමි කියා යි. එහි දී එකත්පස්ව සිටුනා එක්තරා පුරුෂයකුට මෙබඳු සිතෙක් වෙයි: “භවත්නි, ‘මම ගැරහිය යුතු උපවාද කළයුතු පාපකර්‍මයක් කෙළෙමි. ආයුෂ්මත්හු මට කරණ යම් දඬුවමකින් සතුටු වවු ද, එය කෙරෙමි’ යි කියා යම් පුරුෂයෙක් කළුවතක් හැඳ කෙස් විසුරුවා ගෙණ මහාජනකායට අවුත් මෙසේ කී ද, හේ මම නම් මෙබඳු ගැරහිය යුතු උපවාද කළයුතු පව්කමක් නො කරමි” කියා යි",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම යම් කිසි මහණකුට හෝ මෙහෙණකට හෝ පාටිදේසනීය ඇවැත්නි මෙසේ තීව්‍ර වු භයසංඥාව එළඹ සිටී ද, ඔහුට මෙය කැමැති විය යුතුය: පාටිදේසනීය ඇවැතට නො පැමිණියේ හෝ නො අවදනේ ය. පාටිදේසනීය ඇවැතට අවන්නේ හෝ ධර්‍මානුකූල කොට ප්‍රතිකර්‍ම කරන්නේ ය කියා යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සතර ආපත්තිභයහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 468,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 5. 5. 3",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සික්ඛානිසංසසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "45. සික්ඛානිසංසමිදං භික්ඛවෙ බ්රහ්මචරියං වුස්සති පඤ්ඤුත්තරං විමුත්තිසාරං සතාධිපතෙය්යං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ සික්ඛානිසංසං හොති? ඉධ භික්ඛවෙ මයා සාවකානං ආභිසමාචාරිකා සික්ඛා පඤ්ඤත්තා අප්පසන්නානං පසාදාය, පසන්නානං භිය්යොභාවාය. යථා යථා භික්ඛවෙ මයා සාවකානං ආභිසමාචාරිකා සික්ඛා පඤ්ඤත්තා අප්පසන්නානං පසාදාය, පසන්නානං භිය්යොභාවාය, තථා තථා සො තස්සා සික්ඛාය අඛණ්ඩකාරී හොති අච්ඡිද්දකාරී අසබලකාරී අකම්මාසකාරී සමාදාය සික්ඛති සික්ඛාපදෙසු. පුන චපරං භික්ඛවෙ මයා සාවකානං ආදිබ්රහ්මචරියිකා සික්ඛා පඤ්ඤත්තා සබ්බසො සම්මා දුක්ඛක්ඛයාය. යථා යථා භික්ඛවෙ මයා සාවකානං ආදිබ්රහ්මචරියිකා සික්ඛා පඤ්ඤත්තා සබ්බසො සම්මා දුක්ඛක්ඛයාය. තථා තථා සො තස්සා සික්ඛාය අඛණ්ඩකාරී හොති. අච්ඡිද්දකාරී අසබලකාරී අකම්මාසකාරී සමාදාය සික්ඛති සික්ඛාපදෙසු. එවං භික්ඛවෙ සික්ඛානිසංසං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පඤ්ඤුත්තරං හොති? ඉධ භික්ඛවෙ මයා සාවකානං ධම්මා දෙසිතා සබ්බසො සම්මා දුක්ඛක්ඛයාය. යථා යථා භික්ඛවෙ මයා සාවකානං ධම්මා දෙසිතා සබ්බසො සම්මා දුක්ඛක්ඛයාය, තථා තථාස්ස තෙ ධම්මා පඤ්ඤාය සමවෙක්ඛිතා හොන්ති. එවං ඛො භික්ඛවෙ පඤ්ඤුත්තරං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ විමුත්තිසාරං හොති? ඉධ භික්ඛවෙ මයා සාවකානං ධම්මා දෙසිතා සබ්බසො සම්මා දුක්ඛක්ඛයාය. යථා යථා භික්ඛවෙ මයා සාවකානං ධම්මා දෙසිතා සබ්බසො සම්මා දුක්ඛක්ඛයාය, තථා තථාස්ස තෙ ධම්මා විමුත්තියා ඵස්සිතා{1} හොන්ති. එවං ඛො භික්ඛවෙ විමුත්තිසාරං{2} හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ සතාධිපතෙය්යං හොති? ඉති අපරිපූරං වා ආභිසමාචාරිකං සික්ඛං පරිපූරෙස්සාමි, පරිපූරං වා ආභිසමාචාරිකං සික්ඛං තත්ථ තත්ථ පඤ්ඤාය අනුග්ගහෙස්සාමීති. අජ්ඣත්තං යෙව සති සූපට්ඨිතා හොති. ඉති අපරිපූරං වා ආදිබ්රහ්මචරියිකං සික්ඛං පරිපූරෙස්සාමි, පරිපූරං වා ආදිබ්රහ්මචරියිකං සික්ඛං තත්ථ තත්ථ පඤ්ඤාය අනුග්ගහෙස්සාමීති අජ්ඣත්තං යෙව සති සූපට්ඨිතා හොති. ඉති අසමවෙක්ඛිතං වා ධම්මං පඤ්ඤාය සමවෙක්ඛිස්සාමි, සමවෙක්ඛිතං වා ධම්මං තත්ථ තත්ථ පඤ්ඤාය අනුග්ගහෙස්සාමීති. අජ්ඣත්තං යෙව සති සූපට්ඨිතා හොති. ඉති අඵස්සිතං වා ධම්මං විමුත්තියා ඵස්සිස්සාමි.{3} ඵස්සිතං{4} වා ධම්මං තත්ථ තත්ථ පඤ්ඤාය අනුග්ගහෙස්සාමීති. අජ්ඣත්තං යෙව සති සූපට්ඨිතා හොති. එවං ඛො භික්ඛවෙ සතාධිපතෙය්යං හොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඵුසිතා, මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. විමුත්තිසාරො - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ඵුසිස්සාමි - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. ඵුසිතං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.5.5.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සික්ඛාපදානිසංස සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "45. මහණෙනි, ශික්‍ෂා අනුසස් කොට ඇති, ප්‍රඥා උතුම් කොට ඇති, විමුක්ති හර කොට ඇති, ස්‍මෘති ආධිපත්‍යය කොට ඇති, මෙ බඹසර වසනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ බඹසර කෙසේ ශික්‍ෂා අනුසස් කොට ඇත්තේය යත්: මහණෙනි, මෙසස්නෙහි සව්වනට මා විසින් අප්‍රසන්නයන්ගේ ප්‍රසාදය පිණිස, ප්‍රසන්නයන්ගේ භූයෝභාවය පිණිස ආභිසමාචාරික (උතුම්වත් පිළිබඳ) ශික්‍ෂා පණවන ලදු. මහණෙනි, යම් යම් සැටියෙකින් මා විසින් අප්‍රසන්නයන්ගේ ප්‍රසාදය පිණිස ප්‍රසන්නයන්ගේ භූයෝභාවය පිණිස සව්වනට ආභිසමාචාරික ශික්‍ෂා පණවන ලද ද, ඒ ඒ සැටියෙන් හේ (ශික්‍ෂාකාමී මහණ තෙම) ඒ ශික්‍ෂායෙහි අඛණ්‍ඩකාරී වේ. අච්‍ඡිද්‍රකාරී වේ. අශබලකාරී වේ. අකල්මාෂකාරී වේ. මොනොවට සමාදන්ව ශික්‍ෂාපදයෙහි හික්මේ. තව ද, මහණෙනි, මා විසින් සර්‍වප්‍රකාරයෙන් මොනොවට දුක් නස්නා පිණිස ශ්‍රාවකයනට ආදිබ්‍රහ්මචර්‍ය්‍ය (මාර්‍ගබ්‍රහ්මචර්‍ය්‍යයට මුල් වූ සංවර) ශික්‍ෂා පණවන ලදු. මහණෙනි, යම් යම් සැටියෙකින් මා විසින් සර්‍වප්‍රකාරයෙන් මොනොවට දුක් නස්නා පිණිස ශ්‍රාවකයනට ආදිබ්‍රහ්මචර්‍ය්‍යශික්‍ෂා පණවන ලදු. මහණෙනි, යම් යම් සැටියෙකින් මා විසින් සර්‍වප්‍රකාරයෙන් මොනොවට දුක් නස්නා පිණිස ශ්‍රාවකයනට ආදිබ්‍රහ්මචර්‍ය්‍යශික්‍ෂා පණවන ලදු ද, ඒ ඒ සැටියෙන් හේ ඒ ශික්‍ෂායෙහි අඛණ්ඩකාරී වෙයි. අච්ඡිද්‍රකාරී වෙයි. අශබලකාරී වෙයි. අකල්මාෂකාරී වෙයි. මොනොවට සමාදන් ව ශික්‍ෂාපදයෙහි හික්මෙයි. මහණෙනි, මෙසේ මේ බඹසර ශික්‍ෂා අනුසස් කොට ඇති වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, බඹසර කෙසේ ප්‍රඥාව උත්තර කොට ඇත්තේ ය යත්: මහණෙනි, මෙසස්නෙහි සව්වනට මා විසින් සර්‍වප්‍රකාරයෙන් මොනොවට දුක් නසනු පිණිස චතුඃසත්‍ය ධර්‍මයෝ දෙසන ලදහ. මහණෙනි, යම් යම් සැටියෙකින් මා විසින් සර්‍වප්‍රකාරයෙන් මොනොවට දුක් නසනු පිණිස ශ්‍රාවකයනට දහම් දෙසන ලද ද, ඒ ඒ සැටියෙන් ඔහු විසින් ඒ ධර්‍මයෝ ප්‍රඥායෙන් මොනොවට අවබෝධ කරණ ලද්දාහු වෙත්. මහණෙනි, මෙසේ මේ බඹසර ප්‍රඥාව උත්තර කොට ඇති වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, බඹසර කෙසේ විමුක්තිය සාර කොට ඇත්තේ ය යත්: මහණෙනි, මෙසස්නෙහි මා විසින් සර්‍වප්‍රකාරයෙන් දුක් නසනු පිණිස ශ්‍රාවකයනට දහම් දෙසන ලදී. මහණෙනි, යම් යම් සැටියකින් මා විසින් සර්‍වප්‍රකාරයෙන් මොනොවට දුක් නසනු පිණිස ශ්‍රාවකයනට දහම් දෙසන ලද ද, ඒ ඒ සැටියෙන් ඔහු විසින් ඒ ධර්‍මයෝ විමුක්ති (ඥාන) යෙන් පහස්නා ලද්දාහු වෙති. මහණෙනි, මෙසේ බඹසර විමුක්තිය සාර කොට ඇත්තේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ බඹසර ස්‍මෘතිය ආධිපත්‍යය කොට ඇත්තේය යත්: මෙසේ අපරිපූර්‍ණ වූ හෝ ආභිසමාචාරිකශික්‍ෂා පුරමි යි, පරිපූර්‍ණ වූ හෝ ආභිසමාචාරිකශික්‍ෂා ඒ ඒ තැන විදර්‍ශනාප්‍රඥායෙන් ලුහුබැඳ ගන්මි යි තමා සතන්හි ස්මෘතිය මොනොවට එළඹ සිටුනී වෙයි. මෙසේ අපරිපූර්‍ණ වූ හෝ ආදිබ්‍රහ්මචර්‍ය්‍යකශික්‍ෂා පුරමි යි, පරිපූර්‍ණ වූ හෝ ආදිබ්‍රහ්මචර්‍ය්‍යකශික්‍ෂා ඒ ඒ තැන විදර්‍ශනා ප්‍රඥායෙන් ලුහුබැඳ ගන්මි යි අධ්‍යාත්මයෙහි ම ස්මෘතිය මොනොවට එළඹ සිටුනී වෙහි. මෙසේ මාර්‍ගප්‍රඥායෙන් නො දක්නා ලද හෝ චතුස්සත්‍යධර්‍මය මාර්‍ගප්‍රඥායෙන් දක්මි යි මාර්‍ගප්‍රඥායෙන් දක්නා ලද හෝ චතුස්සත්‍යධර්‍මය ඒ ඒ තැන මාර්‍ගප්‍රඥායෙන් ලුහුබැඳ ගන්මි යි අධ්‍යාත්මයෙහි ම ස්මෘතිය මොනොවට එළඹ සිටුනී වෙයි. මෙසේ ඥානස්පර්‍ශයෙන් නො පහස්නා ලද ධර්‍මය අර්‍හත්ඵලවිමුක්තියෙන් පහස්නෙමි යි පහස්නා ලද හෝ ධර්‍මය ඒ ඒ තැන ප්‍රඥායෙන් ලුහුබැඳ ගන්මි යි අධ්‍යාත්මයෙහි ම ස්මෘතිය මොනොවට එළඹ සිටුනී වෙයි. මහණෙනි, මෙසේ බඹසර ස්මෘතිය අධිපති කොට ඇති වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 470,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සික්ඛානිසංසමිදං භික්ඛවෙ බ්රහ්මචරියං වුස්සති පඤ්ඤුත්තරං විමුත්තිසාරං සතාධිපතෙය්යන්ති ඉති යන්තං වුත්තං, ඉදමෙතං පටිච්ච වුත්තන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 5. 4",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සෙය්යාසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "46. චතස්සො ඉමා භික්ඛවෙ සෙය්යා. කතමා චතස්සො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "පෙතසෙය්යා, කාමභොගීසෙය්යා, සීහසෙය්යා, තථාගතසෙය්යා."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමා ච භික්ඛවෙ පෙතසෙය්යා? යෙභුය්යෙන භික්ඛවෙ පෙතා උත්තානා සෙන්ති. අයං වුච්චති භික්ඛවෙ පෙතසෙය්යා."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමා ච භික්ඛවෙ කාමභොගීසෙය්යා? යෙභුය්යෙන භික්ඛවෙ කාමභොගී වාමෙන පස්සෙන සෙන්ති. අයං වුච්චති භික්ඛවෙ කාමභොගීසෙය්යා."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමා ච භික්ඛවෙ සීහසෙය්යා? සීහො භික්ඛවෙ මිගරාජා දක්ඛිණෙන පස්සෙන සෙය්යං කප්පෙති පාදෙ පාදං අච්චාධාය, අන්තරා __සත්ථීනං__{1} නඞ්ගුට්ඨං අනුක්ඛිපිත්වා. සො පටිබුජ්ඣිත්වා පුරිමං කායං අබ්භුන්නාමෙත්වා පච්ඡිමං කායං අනුවිලොකෙති. සචෙ භික්ඛවෙ සීහො මිගරාජා කිඤ්චි පස්සති කායස්ස වික්ඛිත්තං වා විසටං වා, තෙන භික්ඛවෙ සීහො මිගරාජා අනත්තමනො හොති. සචෙ පන භික්ඛවෙ සීහො මිගරාජා න කිඤ්චි පස්සති කායාස්ස වික්ඛිත්තං වා විසටං වා, තෙන භික්ඛවෙ සීහො මිගරාජා අත්තමනො හොති. අයං වුච්චති භික්ඛවෙ සීහසෙය්යා."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමා ච භික්ඛවෙ තථාගතසෙය්යා? ඉධ භික්ඛවෙ තථාගතො විවිච්චෙව කාමෙහි (-පෙ- පඨමං ඣානං -පෙ- දුතියං ඣානං -පෙ- තතියං ඣානං) -පෙ- චතුත්ථං ඣානං උපසම්පජ්ජ විහරති. අයං වුච්චති භික්ඛවෙ තථාගතසෙය්යා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමා ඛො භික්ඛවෙ චතස්සො සෙය්යාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 5. 5",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ථූපාරහසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "47. චත්තාරොමෙ භික්ඛවෙ ථූපාරහා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "තථාගතො අරහං සම්මාසම්බුද්ධො ථූපාරහො, පච්චෙකබුද්ධො ථූපාරහො, තථාගතසාවකො ථූපාරහො, රාජා චක්කවත්තී ථූපාරහො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො ථූපාරහාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 5. 6",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පඤ්ඤාවුද්ධි සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "48. චත්තාරොමෙ භික්ඛවෙ ධම්මා පඤ්ඤාවුද්ධියා සංවත්තන්තී. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සප්පුරිසසංසෙවො, සද්ධම්මසවණං, යොනිසො මනසිකාරො, ධම්මානුධම්මපටිපත්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො ධම්මා පඤ්ඤාවුද්ධියා සංවත්තන්තීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අන්තරසත්ථිම්හි - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, ශික්‍ෂා අනුසස් කොට ඇති, ප්‍රඥා උත්තර කොට ඇති, විමුක්තිය හර කොට ඇති, ස්මෘතිය ආධිපත්‍යය කොට ඇති, මේ බඹසර වැසේය යි මෙසේ යමක් වදාරණ ලද ද, මෙය තෙල කරුණ පිණිස වදාරණ ලදී.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.5.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සෙය්‍යා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "46. මහණෙනි, මේ ශය්‍යාවෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ප්‍රේතශය්‍යා ය, කාමභෝගීශය්‍යා, සිංහශය්‍යා ය, තථාගතශය්‍යා යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ප්‍රේතශය්‍යා කවර? මහණෙනි, මළාහු උඩුහුරුව හොවිත්. මහණෙනි, මේ ප්‍රේතශය්‍යා යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කාමභෝගීශය්‍යා නම් කවර? මහණෙනි, බෙහෙවින් කාමභොගීහු වම්පසින් හොවිත්. මහණෙනි, මේ කාමභෝගීශය්‍යා යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සිංහශය්‍යා නම් කවර? මහණෙනි, මෘගරාජන් වූ සිංහ පාපිට පය මඳක් ඇද තබා දෙකළවේ අතර නගුට බහා තබා දකුණු ඇළයෙන් ශය්‍යා කෙරෙයි. හේ පිබිද උඩුකය නගාගෙණ යටකය විමසා බලයි. මහණෙනි, ඉදින් මෘගරාජන් වූ සිංහ ශරීරාවයව විසිරීමක් හෝ විහිටීමක් හෝ කිසිත් ඉදින් දක්නේ නම් මහණෙනි, එයින් මෘගරාජන් වූ සිංහ නො සතුටු වෙයි. මහණෙනි, මෘගරාජන් වූ සිංහ ශරීරාවයව විසිරීමක් හෝ විහිටීමක් හෝ කිසිත් නොදක්නේ නම්, මහණෙනි, එයින් මෘගරාජන් වූ සිංහ සතුටු වෙහි. මහණෙනි, මෙ සිංහශය්‍යා යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, තථාගතශය්‍යා නම් කවර? මහණෙනි, මෙලොව තථාගතයන් වහන්සේ කාමයෙන් වෙන්ව ම … ප්‍රථම ධ්‍යානයට ... ද්විතීය ධ්‍යානයට ... තෘතීය ධ්‍යානයට ... චතුර්‍ත්‍ථධ්‍යානයට එළඹ වෙසෙති. මහණෙනි, මේ තථාගතශය්‍යා යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර ශය්‍යාවෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.5.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ථූපාරහ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "47. මහණෙනි, මේ ථූපාරහ පුද්ගලයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "තථාගත අර්‍හත් සම්‍යක්සම්බුද්ධයන් වහන්සේ ථුපාරහයහ. ප්‍රත්‍යෙක සම්බුද්ධයන් වහන්සේ ථූපාරහයහ. තථාගතශ්‍රාවකයන් වහන්සේ ථූපාරහයහ. සක්විති රජ ථුපාරහ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර දෙනා ථුපාරහයයෝ (=සෑ බැඳ පුදන්නට නිස්සෝ) යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.5.6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පඤ්ඤාවුද්ධි සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "48. මහණෙනි, මේ සතර දහම් කෙනෙක් ප්‍රඥාවෘද්ධිය පිණිස පවතිත්. කවර සතර දහම් කෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සත්පුරුෂයන් සෙවුනාබව ය, සද්ධර්‍මශ්‍රවණ ය, නුවණින් මෙනෙහි කිරීම ය, ධර්‍මානුධර්‍මප්‍රතිපත් ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර දහම්හු ප්‍රඥාවෘද්ධිය පිණිස පවතිත්.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 472,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 5. 5. 7",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(බහුකාරසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "49. චත්තාරොමෙ භික්ඛවෙ ධම්මා මනුස්සභූතස්ස බහුකාරා හොන්ති. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සප්පුරිසසංසෙවො, සද්ධම්මසවණං, යොනිසො මනසිකාරො, ධම්මානුධම්මපටිපත්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො ධම්මා මනුස්සභූතස්ස බහුකාරා හොන්තීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 5. 8",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අනරිය වොහාරසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "50. චත්තාරොමෙ භික්ඛවෙ අනරියවොහාරා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අදිට්ඨෙ දිට්ඨවාදිතා, අසුතෙ සුතවාදිතා, අමුතෙ මුතවාදිතා, අවිඤ්ඤාතෙ විඤ්ඤාතවාදිතා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො අනරියවොහාරාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 5. 9",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අරියවොහාරසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "51. චත්තාරොමෙ භික්ඛවෙ අරියවොහාරා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අදිට්ඨෙ අදිට්ඨවාදිතා, අසුතෙ අසුතවාදිතා, අමුතෙ අමුතවාදිතා, අවිඤ්ඤාතෙ අවිඤ්ඤාතවාදිතා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො අරියවොහාරාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 5. 10",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අනරිය වොහාරසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "52. චත්තාරොමෙ භික්ඛවෙ අනරියවොහාරා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "දිට්ඨෙ අදිට්ඨවාදිතා, සුතෙ අසුතවාදිතා, මුතෙ අමුතවාදිතා, විඤ්ඤාතෙ අවිඤ්ඤාතවාදිතා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො අනරියවොහාරාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 5. 5. 12",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අරියවොහාරසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "53. චත්තාරොමෙ භික්ඛවෙ අරියවොහාරා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "දිට්ඨෙ දිට්ඨවාදිතා,{1} සුතෙ සුතවාදිතා, මුතෙ මුතවාදිතා, විඤ්ඤාතෙ විඤ්ඤාතවාදිතා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො අරියවොහාරාති."
                    },
                    {
                        "type": "centered",
                        "text": "ආපත්තිභයවග්ගො පඤ්චමො{*}",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "පණ්ණාසකං පඤ්චමං.",
                        "level": 2
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. දිට්ඨාවාදී හොති, ආදි, සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "*. තස්සුද්දානං -\nභෙද ආපත්ති සික්ඛා ච සෙය්යා ථූපාරහෙන ච\nපඤ්ඤාවුද්ධි බහුකාරා වොහාරා චතුරො ඨිතාතී - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.5.5.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බහුකාර සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "49. මහණෙනි, සතර දහම් කෙනෙක් මනුෂ්‍යවූවක්හට බොහෝ උපකාර වෙති. කවර සතර දහම් කෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සත්පුරුෂයන් සෙවුනා බව ය. සද්ධර්‍මශ්‍රවණ ය, නුවණින් මෙනෙහි කිරීම ය, ධර්‍මානුධර්‍ම ප්‍රතිපත්ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර දහම්හු මනුෂ්‍ය වූවක්හට බොහෝ උපකාර වෙති.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.5.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අනරියවෝහාර සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "50. මහණෙනි, මේ අනාර්‍ය්‍ය ව්‍යවහාරයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "අදෘෂ්‍ටයෙහි දෘෂ්ටවාදිතා ය, අශ්‍රැතයෙහි ශ්‍රැතවාදිතා ය, අමුතයෙහි මුතවාදිතා ය. අවිඥාතයෙහි විඥාතවාදිතා යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර අනාර්‍ය්‍ය ව්‍යවහාරයෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.5.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අරියවෝහාර සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "51. මහණෙනි, මේ ආර්‍ය්‍යව්‍යවහාරයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "අදෘෂ්‍ටයෙහි අදෘෂ්ටවාදිතා ය, අශ්‍රැතයෙහි අශ්‍රැතවාදිතා ය, අමුතයෙහි අමුතවාදිතා ය, අවිඥාතයෙහි අවිඥාතවාදිතා යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර ආර්‍ය්‍යව්‍යවහාරයෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.5.10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අනරියවෝහාර සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "52. මහණෙනි, මේ අනාර්‍ය්‍යව්‍යවහාරයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "දෘෂ්‍ටයෙහි අදෘෂ්ටවාදිතා ය. ශ්‍රැතයෙහි අශ්‍රැතවාදිතා ය, මුතයෙහි අමුතවාදිතා ය, විඥාතයෙහි අවිඥාතවාදිතා ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර අනාර්‍ය්‍ය ව්‍යවහාරයෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.5.5.11.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අරියවෝහාර සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "53. මහණෙනි, මේ ආර්‍ය්‍යව්‍යවහාරයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "දෘෂ්‍ටයෙහි දෘෂ්ටවාදිතා ය, ශ්‍රැතයෙහි ශ්‍රැතවාදිතා ය, මුතයෙහි මුතවාදිතා ය, විඥාතයෙහි විඥාතවාදිතා ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර ආර්‍ය්‍යව්‍යවහාරයෝ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආපත්ති වර්‍ගය පස්වැනි යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "පස්වන පණ්‍ණාසක ය යි.",
                        "type": "centered",
                        "level": 2
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 474,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "6. අභිඤ්ඤාවග්ගො",
                        "level": 3
                    },
                    {
                        "type": "centered",
                        "text": "4. 6. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අභිඤ්ඤා සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "1. චත්තාරොමෙ භික්ඛවෙ ධම්මා, කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි භික්ඛවෙ ධම්මා අභිඤ්ඤා පරිඤ්ඤෙය්යා. අත්ථි භික්ඛවෙ ධම්මා අභිඤ්ඤා පහාතබ්බා. අත්ථි භික්ඛවෙ ධම්මා අභිඤ්ඤා භාවෙතබ්බා. අත්ථි භික්ඛවෙ ධම්මා අභිඤ්ඤා සච්ඡිකාතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමෙ ච භික්ඛවෙ ධම්මා අභිඤ්ඤා පරිඤ්ඤෙය්යා? පඤ්චුපාදානක්ඛන්ධා ඉමෙ වුච්චන්ති භික්ඛවෙ ධම්මා අභිඤ්ඤා පරිඤ්ඤෙය්යා."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමෙ ච භික්ඛවෙ ධම්මා අභිඤ්ඤා පහාතබ්බා? අවිජ්ජා ච භවතණ්හා ච ඉමෙ වුච්චන්ති භික්ඛවෙ ධම්මා අභිඤ්ඤා පහාතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමෙ ච භික්ඛවෙ ධම්මා අභිඤ්ඤා භාවෙතබ්බා? සමථො ච විපස්සනා ච ඉමෙ වුච්චන්ති භික්ඛවෙ ධම්මා අභිඤ්ඤා භාවෙතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමෙ ච භික්ඛවෙ ධම්මා අභිඤ්ඤා සච්ඡිකාතබ්බා? විජ්ජා ච විමුත්ති ච ඉමෙ වුච්චන්ති භික්ඛවෙ ධම්මා අභිඤ්ඤා සච්ඡිකාතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො ධම්මාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 6. 2",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පරියෙසනා සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "2. චතස්සො ඉමා භික්ඛවෙ අනරියපරියෙසනා කතමා චතස්සො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චො අත්තනා ජරාධම්මො සමානො ජරාධම්මං යෙව පරියෙසති. අත්තනා ව්යාධිධම්මො සමානො ව්යාධිධම්මං යෙව පරියෙසති. අත්තනා මරණධම්මො සමානො මරණධම්මං යෙව පරියෙසති. අත්තනා සංකිලෙසධම්මො සමානො සංකිලෙසධම්මං යෙව පරියෙසති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමා ඛො භික්ඛවෙ චතස්සො අනරියපරියෙසනාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "6. අභිඤ්ඤා වර්‍ගය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "type": "centered",
                        "text": "4.6.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අභිඤ්ඤා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "1. මහණෙනි, මේ ධර්‍මයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ප්‍රඥායෙන් දැන (පරිඥේය) අවබෝධ කටයුතු ධර්‍ම කෙනෙක් ඇත. මහණෙනි, ප්‍රඥායෙන් දැන ප්‍රහාතව්‍ය (ප්‍රහාණය කළයුතු) ධර්‍ම කෙනෙක් ඇත. මහණෙනි, ප්‍රඥායෙන් දැන භාවිතව්‍ය (=බැවිය යුතු) ධර්‍ම කෙනෙක් ඇත. මහණෙනි, ප්‍රඥායෙන් දැන සාක්‍ෂාත් කර්‍තව්‍ය (ප්‍රත්‍යක්‍ෂ කටයුතු) ධර්‍ම කෙනෙක් ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ප්‍රඥායෙන් දැන පරිඥෙය්‍ය ධර්‍මයෝ කවරහ: පඤ්චඋපාදානස්‍කන්‍ධයෝ යි. මහණෙනි, මේ ධර්‍මයෝ ප්‍රඥායෙන් දැන පරිඥේය (අවබෝධකටයුතු) හ යි කියනු ලැබෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ප්‍රඥායෙන් දැන ප්‍රහාතව්‍ය ධර්‍මයෝ කවරහ: අවිද්‍යාව හා භවතෘෂ්ණා යි. මහණෙනි, මේ ධර්‍මයෝ ප්‍රඥායෙන් දැන ප්‍රහාතව්‍යයහ යි කියනු ලැබෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ප්‍රඥායෙන් දැන භාවිතව්‍ය ධර්‍මයෝ කවරහ: සමථය හා විදර්‍ශනා යි. මහණෙනි, මෙ ධර්‍මයෝ ප්‍රඥායෙන් දැන භාවිතව්‍යයහ යි කියනු ලැබෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ප්‍රඥායෙන් දැන සාක්‍ෂාත් කර්‍තව්‍ය ධර්‍මයෝ කවරහ: විද්‍යාව හා විමුක්ති යි. මහණෙනි, මේ ධර්‍මයෝ ප්‍රඥායෙන් දැන සාක්‍ෂාත් කර්‍තව්‍යයහ යි කියනු ලැබෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර ධර්‍මයෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.6.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරියේසනා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "2. මහණෙනි, මේ අනාර්‍ය්‍යයන්ගේ පර්‍ය්‍යෙෂණාවෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙලොව ඇතැමෙක් තෙමේ ජරාස්වභාව ඇතියේ ම ජරාස්වභාවය ම සොයයි. තෙමේ ව්‍යාධිස්වභාව ඇතියේ ම ව්‍යාධිස්වභාවය ම සොයයි. තෙමේ මරණස්වභාව ඇතියේ ම මරණස්වභාවය ම සොයයි. තෙමේ සඞ්ක්ලේශස්වභාවය ඇතියේ ම සඞ්ක්ලේශස්වභාවය ම සොයයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර අනාර්‍ය්‍ය පර්‍ය්‍යෙෂණාවෝ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 476,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "චතස්සො ඉමා භික්ඛවෙ අරියපරියෙසනා. කතමා චතස්සො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චො අත්තනා ජරාධම්මො සමානො ජරාධම්මෙ ආදීනවං විදිත්වා අජරං අනුත්තරං යොගක්ඛෙමං නිබ්බානං පරියෙසති. අත්තනා ව්යාධිධම්මො සමානො ව්යාධිධම්මෙ ආදීනවං විදිත්වා අව්යාධිං අනුත්තරං යොගක්ඛෙමං නිබ්බානං පරියෙසති. අත්තනා මරණධම්මො සමානො මරණධම්මෙ ආදීනවං විදිත්වා අමතං අනුත්තරං යොගක්ඛෙමං නිබ්බානං පරියෙසති. අත්තනා සංකිලෙසධම්මො සමානො සංකිලෙසධම්මෙ ආදීනවං විදිත්වා අසංකිලිට්ඨං අනුත්තරං යොගක්ඛෙමං නිබ්බානං පරියෙසති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චතස්සො අරියපරියෙසනාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 6. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සඞ්ගහවත්ථුසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3. චත්තාරිමානි භික්ඛවෙ සඞ්ගහවත්ථූනි. කතමානි චත්තාරි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "දානං, පෙය්යවජ්ජං, අත්ථචරියා, සමානත්තතා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ චත්තාරි සඞ්ගහවත්ථූනීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 6. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(මාලුඞ්ක්යපුත්තසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "4. අථ ඛො ආයස්මා **මාලුඞ්ක්යපුත්තො** යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා මාලුඞ්ක්යපුත්තො භගවන්තං එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සාධු ඛො මෙ භන්තෙ භගවා සඞ්ඛිත්තෙන ධම්මං දෙසෙතු, යමහං භගවතො ධම්මං සුත්වා එකො වුපකට්ඨො අප්පමත්තො ආතාපී පහිතත්තො විහරෙය්යන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එත්ථදානි මාලුඞ්ක්යපුත්ත කිං දහරෙ වක්ඛාම, යත්ර හි නාම ත්වං ජිණ්ණො වුද්ධො මහල්ලකො තථාගතස්ස සඞ්ඛිත්තෙන ඔවාදං යාචසීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "”දෙසෙතු මෙ භන්තෙ භගවා සඞ්ඛිත්තෙන ධම්මං, දෙසෙතු සුගතො සඞ්ඛිත්තෙන ධම්මං, අප්පෙවනාමාහං භගවතො භාසිතස්ස අත්ථං ආජානෙය්යං අප්පෙවනාමාහං භගවතො භාසිතස්ස දායාදො අස්සන්ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "චත්තාරොමෙ මාලුඞ්ක්යපුත්ත තණ්හුප්පාදා යත්ථ භික්ඛුනො තණ්හා උප්පජ්ජමානා උප්පජ්ජති. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "චීවරහෙතු වා මාලුඞ්ක්යපුත්ත භික්ඛුනො තණ්හා උප්පජ්ජමානා උප්පජ්ජති, පිණ්ඩපාතහෙතු වා මාලුඞ්ක්යපුත්ත භික්ඛුනො තණ්හා උප්පජ්ජමානා උප්පජ්ජති, සෙනාසනහෙතු වා මාලුඞ්ක්යපුත්ත භික්ඛුනො තණ්හා උප්පජ්ජමානා උප්පජ්ජති, ඉති භවාභවහෙතු වා මාලුඞ්ක්යපුත්ත භික්ඛුනො තණ්හා උප්පජ්ජමානා උප්පජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො මාලුඞ්ක්යපුත්ත චත්තාරො තණ්හුප්පාදා යත්ථ භික්ඛුනො තණ්හා උප්පජ්ජමානා උප්පජ්ජති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මේ ආර්‍ය්‍යයන්ගේ පර්‍ය්‍යෙෂණාවෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙලොව ඇතැමෙක් තෙමේ ජරාස්වභාව ඇතියේ ජරාස්වභාවයෙහි ආදීනව දැන ජරා රහිත අනුත්තර වූ යෝගක්‍ෂේම වූ නිර්‍වාණය සොයයි. තෙමේ ව්‍යාධිස්වභාව ඇතියේ ව්‍යාධිස්වභාවයෙහි ආදීනව දැන ව්‍යාධි රහිත අනුත්තර වූ යෝගක්‍ෂේම වූ නිර්‍වාණය සොයයි. තෙමේ මරණස්‍වභාව ඇතියේ ම මරණස්වභාවයෙහි ආදීනව දැන මරණ රහිත වූ අනුත්තර වූ යෝගක්‍ෂේම වූ නිර්‍වාණය සොයයි. තෙමේ සඞ්ක්ලේශස්වභාවය ඇතියේ සඞ්ක්ලේශස්වභාවයෙහි ආදීනව දැන සඞ්ක්ලේශ රහිත වූ අනුත්තර වූ යෝගක්‍ෂේම වූ නිර්‍වාණය සොයයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර ආර්‍ය්‍යපර්‍ය්‍යෙෂණාවෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.6.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සඞ්ගහවත්‍ථු සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3. මහණෙනි, මේ සඞ්ග්‍රහවස්තූහ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "දාන ය, ප්‍රියවචන ය, අර්‍තචර්‍ය්‍යා ය, සමානාත්මතා යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මොහු සතර සඞ්ග්‍රහ වස්තූහු යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.6.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මාලුඞ්ක්‍යපුත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "4. එකල්හි ආයුෂ්මත් මාලුඞ්ක්‍යපුත්‍ර මහතෙරහු භාග්‍යවතුන් වහන්සේ කරා එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ සකසා වැඳ එකත්පස්ව හුන්හ. එකත්පස්ව හුන් ආයුෂ්මත් මාලුඞ්ක්‍යපුත්‍ර මහතෙරහු භාග්‍යවතුන් වහන්සේට තෙල සැළ කළහ:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මම භාග්‍යවතුන් වහන්සේගේ යම් දහමක් අසා ඒකාකී වූයෙම් ගණසඞ්ගණිකායේන් වෙන් වූයෙම් අප්‍රමත්ත වූයෙම් කෙලෙස් තවන වීර්‍ය්‍ය ඇත්තෙම් ජීවිතනිරපේක්‍ෂක වූයෙම් වෙසෙම් ද, වහන්ස, ආයාචනා කරමි. භාග්‍යවතුන් වහන්සේ සැකෙවින් එබඳු දහමක් දෙසන සේක්වා යනුයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මාලුඞ්ක්‍යපුත්‍රය, යම් හෙයෙකින් තෝ දිරූයෙහි වයෝවෘද්ධ වූයෙහි මහලු වූයෙහි සැකෙවින් තථාගතයන්ගේ අවවාදය යදනෙහි ද, තෙල අවවාද දානයෙහි ලා දැන් තරුණ යෝගාවචරයනට කුමක් කියමෝ ද,",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, භාග්‍යවතුන් වහන්සේ මට සැකෙවින් දහම් දෙසන සේක්වා! සුගතයන් වහන්සේ සැකෙවින් දහම් දෙසන සේක්වා. මම භාග්‍යවතුන් වහන්සේගේ තෙපුලෙහි අරුත් දැනගණිම් නම් මැනව, මම භාග්‍යවතුන් වහන්සේගේ තෙපුලට දායාද වන්නෙම් නම් මැනව.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මාලුඞ්ක්‍යපුත්‍රය, මහණහට යම් අරමුණෙක උපදනා තෘෂ්ණාව උපදිනී වේ ද, මේ තෘෂ්ණෝත්‍පාදයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මාලුඞ්ක්‍යපුත්‍රය, මහණහට, චීවරහේතුයෙන් හෝ උපදනා තෘෂ්ණායෙක් උපදී. මාලුඞ්ක්‍යපුත්‍රය, මහණහට පිණ්ඩපාතහේතුයෙන් හෝ උපදනා තෘෂ්ණායෙක් උපදී. මාලුඞ්ක්‍යපුත්‍රය, මහණහට සයනාසනහේතුයෙන් හෝ උපදනා තෘෂ්ණායෙක් උපදී. මාලුඞ්ක්‍යපුත්‍රය, මහණහට ඉති භවාභවහේතුයෙන් හෝ උපදනා තෘෂ්ණායෙක් උපදී.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මාලුඞ්ක්‍යපුත්‍රය, මහණහට යම් අරමුණෙක උපදනා තෘෂ්ණාව උපදිනී වේ ද, මේ සතර ඒ තෘෂ්ණෝත්පාදයෝ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 478,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යතො ඛො මාලුඞ්ක්යපුත්ත භික්ඛුනො තණ්හා පහීණා හොති, උච්ඡින්නමූලා තාලාවත්ථුකතා අනභාවකතා ආයතිං අනුප්පාදධම්මා. අයං වුච්චති මාලුඞ්ක්යපුත්ත භික්ඛු අච්ඡෙච්ඡි තණ්හං, වාවත්තයි සංයොජනං, සම්මාමානාභිසමයා අන්තමකාසි දුක්ඛස්සාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා මාලුඞ්ක්යපුත්තො භගවතා ඉමිනා ඔවාදෙන ඔවදිතො උට්ඨායාසනා භගවන්තං අභිවාදෙත්වා පදක්ඛිණං කත්වා පක්කාමි. අථ ඛො ආයස්මා මාලුඞ්ක්යපුත්තො එකො වුපකට්ඨො අප්පමත්තො ආතාපී පහිතත්තො විහරන්තො න චිරස්සෙව යස්සත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජන්ති, තදනුත්තරං බ්රහ්මචරියපරියොසානං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහාසි. ඛීණා ජාති, වුසිතං බ්රහ්මචරියං, කතං කරණීයං, නාපරං ඉත්ථත්තායාති අබ්භඤ්ඤාසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අඤ්ඤතරො ච පනායස්මා මාලුඞ්ක්යපුත්තො අරහතං අහොසීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 6. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(කුලසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "5. යානි කානි චි භික්ඛවෙ කුලානි භොගෙසු මහන්තතං{1} පත්තානි න චිරට්ඨිතිකානි භවන්ති, සබ්බානි තානි චතුහි ඨානෙහි, එතෙසං වා අඤ්ඤතරෙන. කතමෙහි චතුහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "නට්ඨං න ගවෙසන්ති, ජිණ්ණං න පටිසඞ්ඛරොන්ති, අපරිමිතපානභොජනා හොන්ති, දුස්සීලං ඉත්ථිං වා පුරිසං වා ආධිපච්චෙ ඨපෙන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යානි කානි චි භික්ඛවෙ කුලානි භොගෙසු මහන්තතං පත්තානි. න චිරට්ඨිතිකානි භවන්ති, සබ්බානි තානි ඉමෙහි චතුහි ඨානෙහි, එතෙසං වා අඤ්ඤතරෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "යානි කානි චි භික්ඛවෙ කුලානි භොගෙසු මහන්තතං පත්තානි චිරට්ඨිතිකානි භවන්ති, සබ්බානි තානි චතුහි ඨානෙහි, එතෙසං වා අඤ්ඤතරෙන. කතමෙහි චතුහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "නට්ඨං ගවෙසන්ති, ජිණ්ණං පටිසඞ්ඛරොන්ති, පරිමිතපානභොජනා හොන්ති, සීලවන්තං ඉත්ථිං වා පුරිසං වා ආධිපච්චෙ ඨපෙන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යානි කානි චි භික්ඛවෙ කුලානි භොගෙසු මහන්තතං පත්තානි චිරට්ඨිතිකානි භවන්ති, සබ්බානි තානි ඉමෙහි චතුහි ඨානෙහි, එතෙසං වා අඤ්ඤතරෙනාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. මහන්තං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මාලුඞ්ක්‍යපුත්‍රයා, යම් කලෙක මහණහට තෘෂ්ණාව ප්‍රහීණ වේ ද, මුලුසුන් වේ ද, මස්තකච්ඡින්න තාලයක් සෙයින් අවස්තුක බවට පමුණුවන ලද ද, පුන පුනා කළ අභාවය ඇද්ද, මතුයෙහි අනුත්පාද ස්වභාවය ඇද්ද, මාලුඞ්ක්‍යපුත්‍රය, මේ මහණ තෘෂ්ණා සිඳපී ය යි සංයෝජන පෙරළාලී ය යි මොනොවට මානයාගේ ප්‍රහාණාභිසමයයෙන් දුක් කෙළවර කෙළේ ය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එක්බිති ආයුෂ්මත් මාලුඞ්ක්‍යපුත්‍ර මහතෙරහු භාග්‍යවතුන් වහන්සේ විසින් මේ අවවාදයෙන් අවවාද කරණ ලද්දාහු හුනස්නෙන් නැගී භාග්‍යවතුන් වහන්සේ සකසා වැඳ පැදකුණු කොට ගියහ. එක්බිති ආයුෂ්මත් මාලුඞ්ක්‍යපුත්‍ර මහතෙර ඒකාකී වූයේ ගණසඞ්ගණිකායේන් වෙන් වූයේ අප්‍රමත්ත වූයේ කෙලෙස් තවන වැර ඇත්තේ නිවනට ගිය සිත් ඇතියේ වෙසෙමින් මඳ කලෙකින් යම් අර්‍හත්ත්‍වයක් පිණිස කුලපුත්‍රයෝ මොනොවට ගිහිගෙන් නික්ම පැවිද්දට පැමිණෙද් ද, මාර්‍ගබ්‍රහ්මචර්‍ය්‍ය කෙළවර කොට ඇති ඒ අර්‍හත්ත්‍වය වර්‍තමාන භවයෙහි ම තමා විසින් විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්‍ෂ කොට ඊට පැමිණ විසී. ජාතිය ක්‍ෂීණ විය. බඹසර වැස නිමවින. සතර මග කිස කරණ ලදි. මේ අර්‍හත්ත්‍වය පිණිස අන් දැයෙක් නැති යි දත්හ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආයුෂ්මත් මාලුඞ්ක්‍යපුත්‍ර මහතෙරහු රහතුන් කෙරෙහි එක්තරා කෙනෙක් ද වූහු.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.6.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කුල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "5. මහණෙනි, භෝගයෙහි මහත්ත්‍වයට පැමිණ යම් කිසි කුලයෝ ඇත් ද, එ හැම කුලයෝ සතර කරුණෙකින් හෝ සතර කරුණු අතුරෙන් අන්‍යතරයෙකින් හෝ චිරස්‍ථායී නො වෙත්. කවර සතර කරුණෙන යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නට දැය නො සොයත්. දිරූ දැය පිළිසකර නො කෙරෙත්. පරිමාණ රහිත පානභෝජන වළඳනාහු වෙත්. සිල් නැති ස්ත්‍රියක හෝ පුරුෂයකු හෝ භාණ්ඩාගාරික භාවයෙහි තබත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, භෝගයෙහි මහත්ත්‍වයට පැමිණි යම් කිසි කුලයෝ ඇත් ද, එ හැම කුලයෝ මේ සතර කරුණින් හෝ මේ සතර කරුණු අතුරෙන් අන්‍යතරයෙකින් හෝ චිරස්ථායී නො වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, භෝගයෙහි මහත්ත්‍වයට පැමිණි යම් කිසි කුලයෝ ඇත් ද, එ හැම කුලයෝ සතර කරුණින් හෝ සතර කරුණු අතුරින් අන්‍යතරයෙකින් හෝ චිරස්ථායී වෙත්. කවර සතර කරුණින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නට දෑ සොයත්. දිරූ දැය පිළිසකර කෙරෙත්. පරිමාණ සහිත පාන භෝජන වළඳනාහු වෙත්. සිල් ඇති ස්‍ත්‍රියක හෝ පුරුෂයකු හෝ අධිපතිභාවයෙහි තබත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, භෝගයෙහි මහත්ත්‍වයට පැමිණි යම් කිසි කුලයෝ ඇත් ද, එ හැම කුලයෝ මේ සතර කරුණින් හෝ මේ සතර කරුණු අතුරින් අන්‍යතරයෙකින් හෝ චිරස්ථායී වෙත්.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 480,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 6. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පඨම ආජානීයසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "6. චතුහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො රඤ්ඤො භද්රො අස්සාජානීයො රාජාරහො හොති රාජභොග්ගො. රඤ්ඤො අඞ්ගන්ත්වෙව සඞ්ඛං ගච්ඡති. කතමෙහි චතුහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ රඤ්ඤො භද්රො අස්සාජානීයො වණ්ණසම්පන්නො ච හොති, බලසම්පන්නො ච, ජවසම්පන්නො ච, ආරොහපරිණාහසම්පන්නො ච. ඉමෙහි ඛො භික්ඛවෙ චතුහි අඞ්ගෙහි සමන්නාගතො රඤ්ඤො භද්රො අස්සාජානීයො රාජාරහො හොති රාජභොග්ගො. රඤ්ඤො අඞ්ගන්ත්වෙව සඞ්ඛං ගච්ඡති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො භික්ඛු ආහුනෙය්යො හොති -පෙ- (පාහුණෙය්යො -පෙ- දක්ඛිණෙය්යො -පෙ- අඤ්ජලිකරණීයො -පෙ-) අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්ස. කතමෙහි චතුහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු වණ්ණසම්පන්නො ච හොති, බලසම්පන්නො ච, ජවසම්පන්නො ච, ආරොහපරිණාහසම්පන්නො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු වණ්ණසම්පන්නො හොති? ඉධ භික්ඛවෙ භික්ඛු සීලවා හොති -පෙ- සමාදාය සික්ඛති සික්ඛාපදෙසු. එවං ඛො භික්ඛවෙ භික්ඛු වණ්ණසම්පන්නො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු බලසම්පන්නො හොති? ඉධ භික්ඛවෙ භික්ඛූ ආරද්ධවිරියො විහරති අකුසලානං ධම්මානං පහාණාය, කුසලානං ධම්මානං උපසම්පදාය, ථාමවා දළ්හපරක්කමො අනික්ඛිත්තධුරො කුසලෙසු ධම්මෙසු. එවං ඛො භික්ඛවෙ භික්ඛු බලසම්පන්නො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු ජවසම්පන්නො හොති? ඉධ භික්ඛවෙ භික්ඛු ඉදං දුක්ඛන්ති යථාභූතං පජානාති -පෙ- අයං දුක්ඛසමුදයොති -පෙ- අයං දුක්ඛනිරොධොති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං පජානාති. එවං ඛො භික්ඛවෙ භික්ඛු ජවසම්පන්නො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු ආරොහපරිණාහසම්පන්නො හොති? ඉධ භික්ඛවෙ භික්ඛු ලාභී හොති චීවරපිණ්ඩපාතසෙනාසනගිලානපච්චය භෙසජ්ජපරික්ඛාරානං. එවං ඛො භික්ඛවෙ භික්ඛු ආරොහපරිණාහසම්පන්නො හොති. ඉමෙහි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො භික්ඛු ආහුනෙය්යො හොති -පෙ- (පාහුණෙය්යො -පෙ- දක්ඛිණෙය්යො -පෙ- අඤ්ජලිකරණීයො) -පෙ- අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්සාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 6. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(දුතිය ආජානීය සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "7. චතුහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො රඤ්ඤො භද්රො අස්සාජානීයො රාජාරහො හොති රාජභොග්ගො. රඤ්ඤො අඞ්ගන්ත්වෙව සඞ්ඛං ගච්ඡති. කතමෙහි චතූහි?"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.6.6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ප්‍රථම ආජානීය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "6. මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූ රජසතු භද්‍ර අශ්වාජානීය රාජාර්‍හ වෙයි. රජු විසින් වළඳ කළයුතු වෙයි. රජුගේ අවයවයෙකැයි ගණනට යෙයි. කවර සතර කරුණින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව රජක්හුගේ භද්‍ර අශ්‍වාජානීයයෙක් වර්‍ණසම්පන්නත් වේ ද, බලසම්පන්නත් වේ ද, ජවසම්පන්නත් වේ ද, අරෝහපරිණාහ සම්පන්නත් වේ ද, මහණෙනි, මේ සතර කරුණෙන් සමන්‍වාගත වූ රජසතු භද්‍ර අශ්‍වාජානීය රාජාර්‍හ වෙයි. රජු විසින් වළඳ කළයුතු වෙයි. රජුගේ අවයවයෙකැයි ගණනට යෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එ පරිදි ම සතර ධර්‍මයෙකින් සමන්‍වාගත වූ මහණ ආහුනාර්‍හ වෙයි. ප්‍රාඝුණාර්‍හ වෙයි. දක්‍ෂිණාර්‍හ වෙයි. අඤ්ජලිකරණාර්‍හ වෙයි. ලෝකයට අනුත්තර පුණ්‍යක්‍ෂේත්‍ර වෙයි. කවර සතර ධර්‍මයෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ වර්‍ණසම්පන්න ද වෙයි. බලසම්පන්නද වෙයි. ජවසම්පන්න ද වෙයි. අරෝහපරිණාහසම්පන්න ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මහණ කෙසේ වර්‍ණසම්පන්න වේ ද? මහණෙනි, මෙ සස්නෙහි මහණ සිල්වත් වෙයි. … සිකපදයෙහි සමාදන් ව ගෙණ හික්මෙයි. මහණෙනි, මෙසේ මහණ වර්‍ණසම්පන්න වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් මහණ බලසම්පන්න වේ ද? මහණෙනි, මෙ සස්නෙහි මහණ අකුසල් දහම් ප්‍රහාණය පිණිස කුසල් දහම් රැස් කිරීම පිණිස ඇරඹු වැර ඇත්තේ ථාමයෙන් යුක්ත වූයේ දැඩි පැරකුම් ඇතියේ කුසල්දහම්හි බහා නොතැබූ වීර්‍ය්‍යධූර ඇත්තේ වෙසෙයි. මහණෙනි, මෙසේ මහණ බලසම්පන්න වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මහණ කෙසේ නම් ජවසම්පන්න වේ ද? මහණෙනි, මෙ සස්නෙහි මහණ මේ දුඃඛය යි තත් වූ පරිදි දනී. මේ දුඃඛසමුදය යි ... මේ දුඃඛනිරෝධය යි ... මේ දුඃඛ නිරොධගාමිනී ප්‍රතිපදාය යි තත් වූ පරිදි දනී. මහණෙනි, මෙසේ මහණ ජවසම්පන්න වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ මහණ ආරෝහපරිණාහයෙන් යුක්ත වූයේ වේ ද? මහණෙනි, මෙ සස්නෙහි මහණ සිවුරු පිඬුවා සෙනසුන් ගිලන්පස බෙහෙත් පිරිකර ලබන්නෙක් වෙයි. මහණෙනි, මෙසේ මහණ ආරෝහ පරිණාහ සම්පන්න වූයේ වෙයි. මහණෙනි, මේ සතර ධර්‍මයෙන් සමන්‍වාගත වූ මහණ ආහුන්‍යෙය වෙයි ... ලෝකයට අනුත්තර පුණ්‍යක්‍ෂේත්‍ර වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.6.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දෙවැනි ආජානීය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "7. මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූ රජසතු භද්‍ර අශ්වාජානීය රාජාර්‍හ වෙයි. රජු විසින් වළඳ කටයුතු වෙයි. රජුගේ අවයවයෙකැයි ගණනට යේ. කවර සතර කරුණින් යත්:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 482,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ රඤ්ඤො භද්රො අස්සාජානීයො වණ්ණසම්පන්නො ච හොති, බලසම්පන්නො ච, ජවසම්පන්නො ච, ආරොහපරිණාහසම්පන්නො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ චතුහි අඞ්ගෙහි සමන්නාගතො රඤ්ඤො භද්රො අස්සාජානීයො රාජාරහො හොති රාජභොග්ගො. රඤ්ඤො අඞ්ගන්ත්වෙව සඞ්ඛං ගච්ඡති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො භික්ඛු ආහුනෙය්යො හොතී, (පාහුණෙය්යො - දක්ඛිණෙය්යො - අඤ්ජලිකරණීයො) -පෙ- අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්ස. කතමෙහි චතූහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු වණ්ණසම්පන්නො ච හොති, බලසම්පන්නො ච ජවසම්පන්නො ච, ආරොහපරිණාහසම්පන්නො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු වණ්ණසම්පන්නො හොති? ඉධ භික්ඛවෙ භික්ඛු සීලවා හොති -පෙ- සමාදාය සික්ඛති සික්ඛාපදෙසු. එවං ඛො භික්ඛවෙ භික්ඛු වණ්ණසම්පන්නො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු බලසම්පන්නො හොති? ඉධ භික්ඛවෙ භික්ඛු ආරද්ධවිරියො විහරති. ථාමවා දළ්හපරක්කමො අනික්ඛිත්තධුරො කුසලෙසු ධම්මෙසු. එවං ඛො භික්ඛවෙ භික්ඛු බලසම්පන්නො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු ජවසම්පන්නො හොති? ඉධ භික්ඛවෙ භික්ඛු ආසවානං ඛයා -පෙ- සච්ඡිකත්වා උපසම්පජ්ජ විහරති. එවං ඛො භික්ඛවෙ භික්ඛු ජවසම්පන්නො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු ආරොහපරිණාහසම්පන්නො හොති? ඉධ භික්ඛවෙ භික්ඛු ලාභී හොති. චීවරපිණ්ඩපාතසෙනාසනගිලානපච්චයභෙසජ්ජපරික්ඛාරානං. එවං ඛො භික්ඛවෙ භික්ඛු ආරොහපරිණාහසම්පන්නො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො භික්ඛු ආහුනෙය්යො හොති, (පාහුණෙය්යො - දක්ඛිණෙය්යො - අඤ්ජලිකරණීයො) -පෙ- අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්සාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 6. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(බලසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "8. චත්තාරිමානි භික්ඛවෙ බලානි. කතමානි චත්තාරි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "විරියබලං සතිබලං සමාධිබලං පඤ්ඤාබලං. ඉමානි ඛො භික්ඛවෙ චත්තාරි බලානීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 6. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අරඤ්ඤසෙනාසන සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "9. චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො භික්ඛු නාලං අරඤ්ඤෙ වනපත්ථානි පන්තානි සෙනාසනානි පටිසෙවිතුං. කතමෙහි චතූහි?"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මෙ ලොව රජසතු භද්‍ර අශ්‍වාජානීය වර්‍ණසම්පන්න ද වෙයි. බලසම්පන්න ද වෙයි. ජවසම්පන්න ද වෙයි. ආරෝහපරිණාහ සම්පන්න ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කරුණින් යුත් රාජකීය භද්‍ර අශ්වාජානීය තෙමේ රාජාර්‍හ ද වෙයි. රාජභෝග්‍ය ද වෙයි. රජුගේ අවයවයෙකැ යි ගණනට යෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එ පරිදි ම සතර කරුණෙකින් යුක්ත වූ මහණ ආහුන්‍යෙය වෙයි. පාහුණ්‍යෙය වෙයි. දක්‍ඛිණ්‍යෙය වෙයි. අඤ්ජලිකරණීය වෙයි. ලෝකයට අනුත්තර පුණ්‍යක්‍ෂේත්‍ර වෙයි. කවර සතර කරුණින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ වර්‍ණසම්පන්න ද වෙයි. බලසම්පන්න ද වෙයි. ජවසම්පන්න ද වෙයි. ආරෝහපරිණාහසම්පන්න ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් මහණ වර්‍ණසම්පන්න වේ ද? මහණෙනි, මෙ සස්නෙහි මහණ සිල් ඇත්තේ වේ ද ... සිකපදයන් සමාදන් ව ගෙණ හික්මේ ද, මහණෙනි, මෙසේ මහණ වර්‍ණසම්පන්න වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් මහණ බලසම්පන්න වේ ද? මහණෙනි, මේ සස්නෙහි මහණ රුකළ වැර ඇත්තේ බලවත් වූයේ දෘඪපරාක්‍රම ඇත්තේ කුසල්දහම්හි බහා නොතැබූ ධුර ඇත්තේ වෙසෙයි. මහණෙනි, මහණ මෙසේ බලසම්පන්න වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් මහණ ජවසම්පන්න වේ ද? මහණෙනි, මේ සස්නෙහි මහණ ආස්‍රවක්‍ෂයයෙන් ... සාක්‍ෂාත් කොට එයට පැමිණ වෙසෙයි. මහණෙනි, මහණ මෙසේ ජවසම්පන්න වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් මහණ ආරෝහපරිණාහසම්පන්න වේ ද? මහණෙනි, මෙ සස්නෙහි මහණ සිවුරු පිඬුවා සෙනසුන් ගිලන්පස බෙහෙත් පිරිකර ලබන්නේ වෙයි. මහණෙනි, මෙසේ මහණ ආරෝහපරිණාහසම්පන්න වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත මහණ ආහුනෙය්‍ය වෙයි. පාහුණෙය්‍ය වෙයි. දක්ඛිණෙය්‍ය වෙයි. අඤ්ජලිකරණීය වෙයි. ලෝකයට අනුත්තර පුණ්‍යක්‍ෂේත්‍ර වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.6.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "8. මහණෙනි, මේ සතර බලකෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "වීර්‍ය්‍යබල ය, ස්‍මෘතිබල ය, සමාධිබල ය, ප්‍රඥාබල යි. මහණෙනි, මේ බල සතර යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.6.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අරඤ්ඤසේනාසන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "9. මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත මහණ අරණ සෙනසුන ද, මිනිස්හසර ඉක්ම වූ වනසෙනසුන් ද, අරණෙහි ඉතා දුරසෙනසුන් ද, සෙවීමට නොනිසි වෙයි. කවර සතරෙකින් යත්:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 484,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කාමවිතක්කෙන, ව්යාපාදවිතක්කෙන, විහිංසාවිතක්කෙන, දුප්පඤ්ඤො හොති ජළො එලමූගො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො භික්ඛු නාලං අරඤ්ඤෙ වනපත්ථානි පන්තානි සෙනාසනානි පටිසෙවිතුන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො භික්ඛු අලං අරඤ්ඤෙ වනපත්ථානි පන්තානි සෙනාසනානි පටිසෙවිතුං. කතමෙහි චතූහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "නෙක්ඛම්මවිතක්කෙන, අව්යාපාදවිතක්කෙන, අවිහිංසාවිතක්කෙන, පඤ්ඤවා හොති අජළො අනෙලමූගො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො භික්ඛු අලං අරඤ්ඤෙ වනපත්ථානි පන්තානි සෙනාසනානි පටිසෙවිතුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 6. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සාවජ්ජ - අනවජ්ජ සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "10. චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො බාලො අව්යත්තො අසප්පුරිසො ඛතං උපහතං අත්තානං පරිහරති. සාවජ්ජො ච හොති. සානුවජ්ජො විඤ්ඤූනං. බහුං ච අපුඤ්ඤං පසවති. කතමෙහි චතුහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සාවජ්ජෙන කායකම්මෙන, සාවජ්ජෙන වචීකම්මෙන, සාවජ්ජෙන මනොකම්මෙන, සාවජ්ජාය දිට්ඨියා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො බාලො අව්යත්තො අසප්පුරිසො ඛතං උපහතං අත්තානං පරිහරති. සාවජ්ජො ච හොති සානුවජ්ජො විඤ්ඤූනං. බහුං ච අපුඤ්ඤං පසවතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො පණ්ඩිතො ව්යත්තො සප්පුරිසො අක්ඛතං අනුපහතං අත්තානං පරිහරති. අනවජ්ජො ච හොති අනනුවජ්ජො විඤ්ඤූනං. බහුං ච පුඤ්ඤං පසවති. කතමෙහි චතූහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනවජ්ජෙන කායකම්මෙන, අනවජ්ජෙන වචීකම්මෙන, අනවජ්ජෙන මනොකම්මෙන, අනවජ්ජාය දිට්ඨියා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො පණ්ඩිතො ව්යත්තො සප්පුරිසො අක්ඛතං අනුපහතං අත්තානං පරිහරති. අනවජ්ජො ච හොති අනනුවජ්ජො විඤ්ඤූනං. බහුඤ්ච පුඤ්ඤං පසවතීති."
                    },
                    {
                        "type": "centered",
                        "text": "අභිඤ්ඤාවග්ගො ඡට්ඨො{*}",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "*. තස්සුද්දානං:\nඅභිඤ්ඤා පරියෙසනා සඞ්ගං මාලුඞ්ක්යපුත්තො. \nකුලං ද්වෙ ච ආජානීයා බලං අරඤ්ඤකම්මුනාති - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "කාමවිතර්‍කයෙන් යුක්ත වූයේ වේ. ව්‍යාපාදවිතර්‍කයෙන් යුක්ත වූයේ වේ. විහිංසාවිතර්‍කයෙන් යුක්ත වූයේ වේ. ජඩ වූයේ වහතොලු වූයේ දුෂ්ප්‍රාඥ ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත වූ මහණ අරණසෙනසුන ද මිනිස්හසර ඉක්ම වූ වනසෙනසුන් ද අරණෙහි ඉතා දුරසෙනසුන් ද සෙවීමට නො නිසි වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කරුණු සතරෙකින් සමන්‍වාගත මහණ අරණසෙනසුන ද මිනිස්හසර ඉක්ම වූ වනසෙනසුන් ද අරණෙහි ඉතා දුර සෙනසුන් ද සෙවීමට නිසි වෙයි. කවර සතර කරුණෙන යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නෛෂ්ක්‍රම්‍යවිතර්‍කයෙන් යුක්ත වූයේ වේ. අව්‍යාපාදවිතර්‍කයෙන් යුක්ත වූයේ වේ. අවිහිංසාවිතර්‍කයෙන් යුක්ත වූයේ වේ. ජඩ නොවූයේ වහතොලු නොවූයේ පැණැතියේ ද වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත මහණ අරණසෙනසුන් ද මිනිස්හසර ඉක්ම වූ වනසෙනසුන් ද අරණෙහි ඉතා දුරසෙනසුන් ද සෙවීමට නිසි වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.6.10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සාවජ්ජ - අනවජ්ජ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "10. මහණෙනි, මේ සතර කරුණෙකින් සමන්‍වාගත වූ බාල වූ අව්‍යක්ත වූ අසත්පුරුෂ ගුණ විසින් සාළ ගුණ විසින් නට ආත්මයක් පරිහරණය කෙරෙයි. සාවද්‍ය ද වෙයි. නුවණැත්තන් විසින් උපවාද කටයුතු වූයේ බොහෝ පව් ද රැස් කෙරෙයි. කවර සතරෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සාවද්‍ය වූ කායකර්‍මයෙන් යුක්ත වූයේ වෙයි. සාවද්‍ය වූ වාක්කර්‍මයෙන් යුක්ත වූයේ වෙයි. සාවද්‍ය වූ මනඃකර්‍මයෙන් යුක්ත වූයේ වෙයි. සාවද්‍ය වූ දෘෂ්ටියෙන් යුක්ත වූයේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත වූ බාල අව්‍යක්ත අසත්පුරුෂ ගුණ විසින් සාරා දැමූ ගුණ විසින් නට ආත්මයක් පරිහරණය කෙරෙයි. සාවද්‍ය ද වෙයි. නුවණැත්තන් විසින් උපවාද කටයුතු වූයේ බොහෝ අකුසල් ද රැස් කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූ පණ්ඩිත ව්‍යක්ත සත්පුරුෂ ගුණ විසින් සාරා නොදැමූ ගුණ විසින් නොනට ආත්මයක් පරිහරණය කෙරෙයි. නිරවද්‍ය ද වෙයි. නුවණැත්තන් විසින් උපවාද නොකටයුත්තේ බොහෝ පින් ද රැස් කෙරෙයි. කවර සතර කරුණෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "අනවද්‍ය වූ කායකර්‍මයෙන් යුක්ත වූයේ වේ. අනවද්‍ය වූ වාක්කර්‍මයෙන් යුක්ත වූයේ වේ. අනවද්‍ය වූ මනඃකර්‍මයෙන් යුක්ත වූයේ වෙයි. අනවද්‍ය වූ දෘෂ්ටියෙන් යුක්ත වූයේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත වූ පණ්ඩිත වූ ව්‍යක්ත වූ සත්පුරුෂ ගුණ විසින් සාරා නො දැමූ ගුණ විසින් නොනටුවා වූ ආත්මයක් පරිහරණය කෙරෙයි. අනවද්‍ය ද වෙයි. නුවණැත්‍තන් විසින් උපවාද නො කටයුත්තේ බොහෝ කුසල් ද රැස් කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අභිඥාවර්‍ගය සවැනි යි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 486,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "7. කම්මපථවග්ගො",
                        "level": 3
                    },
                    {
                        "type": "centered",
                        "text": "4. 7. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පාණාතිපාතසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "1. චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ. කතමෙහි චතුහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච පාණාතිපාතී හොති, පරඤ්ච පාණාතිපාතෙ සමාදපෙති, පාණාතිපාතෙ ච සමනුඤ්ඤො හොති, පාණාතිපාතස්ස ච වණ්ණං භාසති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙ. කතමෙහි චතුහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච පාණාතිපාතා පටිවිරතො හොති. පරඤ්ච පාණාතිපාතා වෙරමණියා සමාදපෙති, පාණාතිපාතා වෙරමණියා ච සමනුඤ්ඤො හොති, පාණාතිපාතා වෙරමණියා ච වණ්ණං භාසති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 7. 2",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අදින්නාදානසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "2. චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ. කතමෙහි චතුහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච අදින්නාදායී හොති, පරඤ්ච අදින්නාදානෙ සමාදපෙති, අදින්නාදානෙ ච සමනුඤ්ඤො හොති, අදින්නාදානස්ස ච වණ්ණං භාසති. ඉමෙහි ඛො -පෙ- (යථාභතං නික්ඛිත්තො එවං නිරයෙ. )"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච අදින්නාදානා පටිවිරතො හොති, පරඤ්ච අදින්නාදානා වෙරමණියා සමාදපෙති, අදින්නාදානා වෙරමණියා ච සමනුඤ්ඤො හොති, අදින්නාදානා වෙරමණියා ච වණ්ණං භාසති. ඉමෙහි ඛො -පෙ- (යථාභතං නික්ඛිත්තො එවං සග්ගෙති.)"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "7. කම්මපථ වර්‍ගය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "type": "centered",
                        "text": "4.7.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පාණාතිපාත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "1. මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තැබූයේ යම්සේ වේ ද, එ පරිදි නිරයෙහි වේ. කවර සතර කරුණින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් පණිවා කරන්නේ වෙයි. මෙරමාත් පණිවායෙහි සමාදන් කරවයි. පණිවායෙහි ද අනුදන්නේත් වෙයි. පණිවා පිළිබඳ ගුණ කියන්නේත් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත වූයේ ගෙණ වුත් බහා තැබූයේ යම්සේ වේ ද, එ පරිදි නිරයෙහි වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ගෙණ වුත් බහා තැබූයේ යම්සේ ද, එපරිදි ස්‍වර්‍ගයෙහි වේ. කවර සතර කරුණින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් පණිවායෙන් දුරු වූයේ වෙයි. මෙරමාත් පණිවායෙන් දුරු වීමෙහි සමාදන් කරවයි. පණිවායෙන් දුරු වීමෙහි අනුදන්නේත් වෙයි. පණිවායෙන් දුරු වීම පිළිබඳ ගුණ කියන්නේත් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තැබූයේ යම්සේ ද, එසෙයින් ස්වර්‍ගයෙහි වේ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.7.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අදින්නාදාන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "2. මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ගෙණවුත් බහා තැබූයේ යම්සේ වේ ද, එ පරිදි නිරයෙහි වේ. කවර සතර කරුණෙන යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් අයිනාදන් ගන්නේ වෙයි, මෙරමාත් අයිනාදනෙහි සමාදන් කරවයි. අයිනාදනෙහි ද අනුදන්නේ වෙයි. අයිනාදන පිළිබඳ ගුණ කියන්නේ වෙයි. මහණෙනි, මේ සතර කරුණින් … [ගෙණ වුත් බහා තැබූයේ යම් සේ ද, එ පරිදි නිරයෙහි වේ.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් අයිනාදනින් දුරුවූයේ වෙයි, මෙරමාත් අයිනාදනින් දුරුවීමෙහි සමාදන් කරවයි. අයිනාදනින් දුරුවීමෙහි අනුදන්නේත් වෙයි. අයිනාදනින් දුරුවීම පිළිබඳ ගුණ කියයි. මහණෙනි, මේ සතර කරුණින් ... [ගෙණ වුත් බහා තැබූයේ යම් සේ ද, එ පරිදි ස්‍වර්‍ගයෙහි වේ.]",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 488,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 7. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(කාමමිච්ඡාචාරසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච කාමෙසු මිච්ඡාචාරී හොති, පරඤ්ච කාමෙසු මිච්ඡාචාරෙ සමාදපෙති, කාමෙසු මිච්ඡාචාරෙ ච සමනුඤ්ඤො හොති, කාමෙසු මිච්ඡාචාරස්ස ච වණ්ණං භාසති. ඉමෙහි ඛො -පෙ- (යථාභතං නික්ඛිත්තො එවං නිරයෙ. )"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච කාමෙසු මිච්ඡාචාරා පටිවිරතො හොති, පරඤ්ච කාමෙසු මිච්ඡාචාරා වෙරමණියා සමාදපෙති, කාමෙසු මිච්ඡාචාරා වෙරමණියා ච සමනුඤ්ඤො හොති, කාමෙසු මිච්ඡාචාරා වෙරමණියා ච වණ්ණං භාසති. ඉමෙහි ඛො -පෙ- (යථාභතං නික්ඛිත්තො එවං සග්ගෙති.)"
                    },
                    {
                        "type": "centered",
                        "text": "4. 7. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(මුසාවාදසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "4. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච මුසාවාදී හොති, පරඤ්ච මුසාවාදෙ සමාදපෙති, මුසාවාදෙ ච සමනුඤ්ඤො හොති, මුසාවාදස්ස ච වණ්ණං භාසති. ඉමෙහි ඛො -පෙ- (යථාභතං නික්ඛිත්තො එවං නිරයෙ. )"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතූහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච මුසාවාදා පටිවිරතො හොති, පරඤ්ච මුසාවාදා වෙරමණියා සමාදපෙති, මුසාවාදා වෙරමණියා ච සමනුඤ්ඤො හොති, මුසාවාදා වෙරමණියා ච වණ්ණං භාසති. ඉමෙහි ඛො -පෙ- (යථාභතං නික්ඛිත්තො එවං සග්ගෙති. )"
                    },
                    {
                        "type": "centered",
                        "text": "4. 7. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පිසුණාවාචාසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "5. ( චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච පිසුණාවාචො හොති, පරඤ්ච පිසුණාවාචාය සමාදපෙති, පිසුණාවාචාය ච සමනුඤ්ඤො හොති, පිසුණාවාචාය ච වණ්ණං භාසති. ඉමෙහි ඛො -පෙ- (යථාභතං නික්ඛිත්තො එවං නිරයෙ. )"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතූහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච පිසුණාවාචා පටිවිරතො හොති, පරඤ්ච පිසුණාවාචාය වෙරමණියා සමාදපෙති, පිසුණාවාචා වෙරමණියා ච සමනුඤ්ඤො හොති, පිසුණාවාචා වෙරමණියා ච වණ්ණං භාසති. ඉමෙහි ඛො -පෙ- (යථාභතං නික්ඛිත්තො එවං සග්ගෙති. )"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.7.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කාමමිච්ඡාචාර සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3. [මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ... ]",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් කාමයෙහි මිසහසර ඇතියේ වෙයි. මෙරමාත් කාමයෙහි මිසහසරෙහි සමාදන් කරවයි. කාමයෙහි මිසහසරෙහි අනුදන්නේත් වෙයි. කාමයෙහි මිසහසර පිළිබඳ ගුණ කියන්නේත් වෙයි. මහණෙනි, මේ සතර කරුණින් ... [ගෙණ වුත් බහා තැබූයේ යම් සේ ද, එපරිදි නිරයෙහි වේ.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් කාමයෙහි මිසහසරින් දුරුවූයේ වෙයි. මෙරමාත් කාමයෙහි මිසහසරින් දුරුවීමෙහි සමාදන් කරවයි. කාමයෙහි මිසහසරින් දුරුවීමෙහි අනුදන්නේත් වෙයි. කාමයෙහි මිසහසරින් දුරුවීම පිළිබඳ ගුණ කියන්නේත් වෙයි. මහණෙනි, මේ සතර කරුණින් ... [ගෙණ වුත් බහා තැබූයේ යම් සේ ද, එපරිදි ස්වර්‍ගයෙහි වේ.]",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.7.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මුසාවාද සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "4. [මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් මුසවා බණන්නේ වෙයි. මෙරමාත් මුසවායෙහි සමාදන් කරවයි. මුසවායෙහි අනුදන්නේත් වෙයි. මුසවා පිළිබඳ ගුණ කියන්නේත් වෙයි. මහණෙනි, මෙ සතර කරුණින් ... [ගෙණවුත් බහා තැබූයේ යම් සේ ද, එපරිදි නිරයෙහි වේ.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් මුසවායෙන් දුරුවූයේ වෙයි. මෙරමාත් මුසවායෙන් දුරුවීමෙහි සමාදන් කරවයි. මුසවායෙන් දුරුවීමෙහි අනුදන්නේත් වෙයි. මුසවායෙන් දුරුවීම පිළිබඳ ගුණ කියන්නේත් වෙයි. මහණෙනි, මේ සතර කරුණින් ... [ගෙණවුත් බහා තැබූයේ යම් සේ ද, එපරිදි ස්වර්‍ගයෙහි වේ.]",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.7.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පිසුණවාචා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "5. [මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ... ]",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් පිසුනුබස් ඇතියේ වෙයි. මෙරමාත් පිසුනුබස්හි සමාදන් කරවයි. පිසුනුබස්හි අනුදන්නේත් වෙයි. පිසුනුබස් පිළිබඳ ගුණ කියන්නේත් වෙයි. මහණෙනි, මේ සතර කරුණින් ... [ගෙණ වුත් බහා තැබූයේ යම් සේ ද, එපරිදි නිරයෙහි වේ.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් පිසුනුබසින් දුරුවූයේ වෙයි. මෙරමාත් පිසුනුබසින් දුරුවීමෙහි සමාදන් කරවයි. පිසුනුබසින් දුරුවීමෙහි අනුදන්නේත් වෙයි. පිසුනුබසින් දුරුවීම පිළිබඳ ගුණ ද කියයි. මහණෙනි, මේ සතර කරුණින් ... [ගෙණවුත් බහා තැබුයේ යම්සේ ද, එපරිදි ස්වර්‍ගයෙහි වේ.]",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 490,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 7. 6",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ඵරුසාවාචාසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "6. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච ඵරුසාවාචො හොති, පරඤ්ච ඵරුසාවාචාය සමාදපෙති, ඵරුසාවාචාය ච සමනුඤ්ඤො හොති, ඵරුසාවාචාය ච වණ්ණං භාසති. ඉමෙහි ඛො -පෙ- (යථාභතං නික්ඛිත්තො එවං නිරයෙ.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච ඵරුසාවාචාය පටිවිරතො හොති, පරඤ්ච ඵරුසාවාචාය වෙරමණියා සමාදපෙති, ඵරුසාවාචාය වෙරමණියා ච සමනුඤ්ඤො හොති, ඵරුසාවාචාය වෙරමණියා ච වණ්ණං භාසති. ඉමෙහි ඛො -පෙ- (යථාභතං නික්ඛිත්තො එවං සග්ගෙති.)"
                    },
                    {
                        "type": "centered",
                        "text": "4. 7. 7",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සම්ඵප්පලාපසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "7. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච සම්ඵප්පලාපී හොති, පරඤ්ච සම්ඵප්පලාපෙ සමාදපෙති, සම්ඵප්පලාපෙ ච සමනුඤ්ඤො හොති, සම්ඵප්පලාපස්ස ච වණ්ණං භාසති. ඉමෙහි ඛො -පෙ- (යථාභතං නික්ඛිත්තො එවං නිරයෙ. )"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච සම්ඵප්පලාපා පටිවිරතො හොති, පරඤ්ච සම්ඵප්පලාපා වෙරමණියා සමාදපෙති, සම්ඵප්පලාපා වෙරමණියා ච සමනුඤ්ඤො හොති, සම්ඵප්පලාපා වෙරමණියා ච වණ්ණං භාසති. ඉමෙහි ඛො -පෙ- (යථාභතං නික්ඛිත්තො එවං සග්ගෙති. )"
                    },
                    {
                        "type": "centered",
                        "text": "4. 7. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අභිජ්ඣාලුසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "8. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච අභිජ්ඣාලු හොති, පරඤ්ච අභිජ්ඣාය සමාදපෙති, අභිජ්ඣාය ච සමනුඤ්ඤො හොති. අභිජ්ඣාය ච වණ්ණං භාසති. ඉමෙහි ඛො -පෙ- (යථාභතං නික්ඛිත්තො එවං නිරයෙ.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච අනභිජ්ඣාලු හොති, පරඤ්ච අනභිජ්ඣාය සමාදපෙති, අනභිජ්ඣාය ච සමනුඤ්ඤො හොති, අනභිජ්ඣාය ච වණ්ණං භාසති. ඉමෙහි ඛො -පෙ- ( යථාභතං නික්ඛිත්තො එවං සග්ගෙති. )"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.7.6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඵරුසාවාචා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "6. [මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් පරොස්බස් ඇතියේ වෙයි. මෙරමාත් පරොස්බස්හි සමාදන් කරවයි. පරොස්බස්හි අනුදන්නේත් වෙයි. පරොස්බස් පිළිබඳ ගුණ ද කියයි.. මහණෙනි, මේ සතර කරුණින් ... [ගෙණවුත් බහා තැබූයේ යම් සේ ද, එපරිදි නිරයෙහි වේ.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් පරොස්බසින් දුරුවූයේ වෙයි. මෙරමාත් පරොස්බසින් දුරුවීමෙහි සමාදන් කරවයි. පරොස්බසින් දුරුවීමෙහි අනුදන්නේත් වෙයි. පරොස්බසින් දුරුවීම පිළිබඳ ගුණ ද කියයි. මහණෙනි, මේ සතර කරුණින් ... [ගෙණවුත් බහා තැබුයේ යම් සේ ද, එපරිදි ස්වර්‍ගයෙහි වේ.]",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.7.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සම්ඵප්පලාප සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "7. [මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් සම්ඵප්‍රලාප ඇතියේ වෙයි. මෙරමාත් සම්ඵප්‍රලාපයෙහි සමාදන් කරවයි. සම්ඵප්‍රලාපයෙහි අනුදන්නේත් වෙයි. සම්ඵප්‍රලාපය පිළිබඳ ගුණ ද කියයි. මහණෙනි, මේ සතර කරුණින් ... [ගෙණවුත් බහා තැබුයේ යම් සේ ද, එපරිදි නිරයෙහි වේ.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් සම්ඵප්‍රලාපයෙන් දුරුවූයේ වෙයි. මෙරමාත් සම්ඵප්‍රලාපයෙන් දුරුවීමෙහි සමාදන් කරවයි. සම්ඵප්‍රලාපයෙන් දුරුවීමෙහි අනුදන්නේත් වෙයි. සම්ඵප්‍රලාපයෙන් දුරුවීම පිළිබඳ ගුණත් කියයි. මහණෙනි, මේ සතර කරුණින් ... [ගෙණවුත් බහා තැබුයේ යම් සේ ද, එපරිදි ස්වර්‍ගයෙහි වේ.]",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.7.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අභිජ්ඣාලු සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "8. [මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් අභිධ්‍යා බහුල වෙයි. මෙරමාත් අභිධ්‍යායෙහි සමාදන් කරවයි. අභිධ්‍යායෙහි අනුදන්නේත් වෙයි. අභිධ්‍යාව පිළිබඳ ගුණ කියන්නේත් වෙයි. මහණෙනි, මේ සතර කරුණින් ... [ගෙණවුත් බහා තැබූයේ යම් සේ ද, එපරිදි නිරයෙහි වේ.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් අභිධ්‍යා බහුල නොවූයේ වෙයි. මෙරමාත් අභිධ්‍යායෙහි සමාදන් කරවයි. අනභිධ්‍යායෙහි අනුදන්නේත් වෙයි. අනභිධ්‍යාව පිළිබඳ ගුණ කියන්නේත් වෙයි. මහණෙනි, මේ සතර කරුණින් ... [ගෙණවුත් බහා තැබුයේ යම් සේ ද, එපරිදි ස්වර්‍ගයෙහි වේ.]",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 492,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 7. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(බ්යාපන්නචිත්තසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "9. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච බ්යාපන්නචිත්තො හොති, පරඤ්ච ව්යාපාදෙ සමාදපෙති, ව්යාපාදෙ ච සමනුඤ්ඤො හොති, ව්යාපාදස්ස ච වණ්ණං භාසති. ඉමෙහි ඛො -පෙ- (යථාභතං නික්ඛිත්තො එවං නිරයෙ. )"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච අබ්යාපන්නචිත්තො හොති, පරඤ්ච අව්යාපාදෙ සමාදපෙති, අව්යාපාදෙ ච සමනුඤ්ඤො හොති, අව්යාපාදස්ස ච වණ්ණං භාසති. ඉමෙහි ඛො -පෙ- (යථාභතං නික්ඛිත්තො එවං සග්ගෙති. )"
                    },
                    {
                        "type": "centered",
                        "text": "4. 7. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(මිච්ඡාදිට්ඨිසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "10. (චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච මිච්ඡාදිට්ඨි හොති, පරඤ්ච මිච්ඡාදිට්ඨියා සමාදපෙති, මිච්ඡාදිට්ඨියා ච සමනුඤ්ඤො හොති, මිච්ඡාදිට්ඨියා ච වණ්ණං භාසති. ඉමෙහි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො (යථාභතං නික්ඛිත්තො එවං නිරයෙ. )"
                    },
                    {
                        "type": "paragraph",
                        "text": "(චතුහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො -පෙ-)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තනා ච සම්මාදිට්ඨි හොති, පරඤ්ච සම්මාදිට්ඨියා සමාදපෙති, සම්මාදිට්ඨියා ච සමනුඤ්ඤො හොති, සම්මාදිට්ඨියා ච වණ්ණං භාසති. ඉමෙ හි ඛො භික්ඛවෙ චතුහි ධම්මෙහි සමන්නාගතො (යථාභතං නික්ඛිත්තො එවං සග්ගෙති.)"
                    },
                    {
                        "type": "centered",
                        "text": "කම්මපථවග්ගො සත්තමො.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.7.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බ්‍යාපන්නචිත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "9. [මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් ව්‍යාපන්න සිත් ඇත්තේ වෙයි. මෙරමාත් ව්‍යාපාදයෙහි සමාදන් කරවයි. ව්‍යාපාදයෙහි අනුදන්නේත් වෙයි. ව්‍යාපාදය පිළිබඳ ගුණ කියයි. මහණෙනි, මේ සතර කරුණින් ... [ගෙණවුත් බහා තැබුයේ යම් සේ ද, එපරිදිම නිරයෙහි වේ.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් ව්‍යාපාද රහිත සිතැත්තේ වෙයි. මෙරමාත් අව්‍යාපාදයෙහි සමාදන් කරවයි. අව්‍යාපාදයෙහි අනුදන්නේත් වෙයි. අව්‍යාපාදය පිළිබඳ ගුණත් කියයි. මහණෙනි, මේ සතර කරුණින් ... [ගෙණවුත් බහා තැබුයේ යම් සේ ද, එපරිදි ස්වර්‍ගයෙහි වේ.]",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.7.10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මිච්ඡාදිට්ඨි සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "10. [මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් මිථ්‍යාදෘෂ්ටි ඇතියේ වෙයි. මෙරමාත් මිථ්‍යාදෘෂ්ටියෙහි සමාදන් කරවයි. මිථ්‍යාදෘෂ්ටියෙහි අනුදන්නේත් වෙයි. මිථ්‍යාදෘෂ්ටිය පිළිබඳ ගුණත් කියයි. මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත වූයේ ... [ගෙණවුත් බහා තැබූයේ යම් සේ ද, එපරිදි නිරයෙහි වේ.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "[මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත වූයේ ...]",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙමේත් සම්‍යග්දෘෂ්ටි ඇතියේ වෙයි. මෙරමාත් සම්‍යග්දෘෂ්ටියෙහි සමාදන් කරවයි. සම්‍යග්දෘෂ්ටියෙහි අනුදන්නේත් වෙයි. සම්‍යග්දෘෂ්ටිය පිළිබඳ ගුණත් කියයි. මහණෙනි, මේ සතර කරුණින් සමන්‍වාගත වූයේ ... [ගෙණවුත් බහා තැබුයේ යම් සේ ද, එපරිදි ස්වර්‍ගයෙහි වේ.]",
                        "type": "paragraph"
                    },
                    {
                        "text": "කර්‍මපථවර්‍ගය සත්වැනි යි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 494,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "8. රාගාදිපෙය්යාලං",
                        "level": 3
                    },
                    {
                        "type": "centered",
                        "text": "4. 8. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(චතුසතිපට්ඨානසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "1. රාගස්ස භික්ඛවෙ අභිඤ්ඤාය චත්තාරො ධම්මා භාවෙතබ්බා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣා දොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣා දොමනස්සං."
                    },
                    {
                        "type": "paragraph",
                        "text": "රාගස්ස භික්ඛවෙ අභිඤ්ඤාය ඉමෙ චත්තාරො ධම්මා භාවෙතබ්බාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 8. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(චතුසම්මප්පධානසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "2. රාගස්ස භික්ඛවෙ අභිඤ්ඤාය චත්තාරො ධම්මා භාවෙතබ්බා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු අනුප්පන්නානං පාපකානං අකුසලානං ධම්මානං අනුප්පාදාය ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. උප්පන්නානං පාපකානං අකුසලානං ධම්මානං පහාණාය -පෙ- අනුප්පන්නානං කුසලානං ධම්මානං උප්පාදාය -පෙ- උප්පන්නානං කුසලානං ධම්මානං ඨිතියා අසම්මොසාය භීයොභාවාය වෙපුල්ලාය භාවනාය පාරිපූරියා ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති."
                    },
                    {
                        "type": "paragraph",
                        "text": "රාගස්ස භික්ඛවෙ අභිඤ්ඤාය ඉමෙ චත්තාරො ධම්මා භාවෙතබ්බාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 8. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(චතුරිද්ධිපාදසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3. රාගස්ස භික්ඛවෙ අභිඤ්ඤාය චත්තාරො ධම්මා භාවෙතබ්බා කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "රාගස්ස භික්ඛවෙ අභිඤ්ඤාය ඉමෙ චත්තාරො ධම්මා භාවෙතබ්බාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "8. රාගපෙය්‍යාලය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "type": "centered",
                        "text": "4.8.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "චතුසතිපට්ඨාන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "1. මහණෙනි, රාගයාගේ අභිඥා පිණිස ධර්‍මයෝ සතර දෙනෙක් වැඩිය යුතුයහ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ කෙලෙස් තවන වීර්‍ය්‍ය ඇතියේ නුවණින් දන්නේ ස්‍මෘතිමත් වූයේ පඤ්චස්‍කන්‍ධලෝකයෙහි අභිධ්‍යාදොම්නස්‍ය දුරු කොට කයෙහි කය නුවණින් දක්නේ වෙසෙයි. වේදනායෙහි ... චිත්තයෙහි ... කෙලෙස් තවන වීර්‍ය්‍ය ඇතියේ නුවණින් දන්නේ ස්මෘතිමත් වූයේ පඤ්චස්‍කන්‍ධලෝකයෙහි අභිධ්‍යාදෞර්‍මනස්‍ය දුරු කොට ධර්‍මයෙහි ධර්‍මය නුවණින් දක්නේ වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, රාගයාගේ අභිඥා පිණිස මේ සතර ධර්‍මයෝ වැඩිය යුත්තාහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.8.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "චතුසම්මප්පධාන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "2. මහණෙනි, රාගයාගේ අභිඥා පිණිස ධර්‍මයෝ සතර දෙනෙක් වැඩිය යුත්තාහ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ නූපන් ලාමක අකුශල ධර්‍මයන්ගේ අනුත්පාදය පිණිස ඡන්‍දය උපදවයි. ව්‍යායාම කෙරෙයි. වීර්‍ය්‍යාරම්භ කෙරෙයි. සිත දැඩි කොට ගණියි. ප්‍රධන්වීර්‍ය්‍ය කෙරෙයි. උපන් ලාමක අකුශල ධර්‍මයන්ගේ ප්‍රහාණය පිණිස ... නූපන් කුශලධර්‍මයන්ගේ උත්පාදය පිණිස ... උපන් කුශලධර්‍මයන්ගේ ස්‍ථීතිය පිණිස සම්මොෂය නොවනු පිණිස භූයෝභාවය පිණිස වෛපුල්‍යය පිණිස භාවනායෙන් පරිපූර්‍ණත්‍වය පිණිස ඡන්‍දය දනවයි. ව්‍යායාම කෙරෙයි. වීර්‍ය්‍යාරම්භ කෙරෙයි. සිත දැඩි කොට ගණියි. ප්‍රධන්වීර්‍ය්‍යය කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, රාගයාගේ අභිඥා පිණිස මේ සතර ධර්‍මයෝ භාවිතව්‍යයෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.8.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "චතුරිද්ධිපාද සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3. මහණෙනි, රාගයාගේ අභිඥා පිණිස ධර්‍මයෝ සතර දෙනෙක් වැඩිය යුත්තාහ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ ඡන්‍දසමාධි පූර්‍වක ප්‍රධන්වීර්‍ය්‍ය සඞ්ඛ්‍යාත සංස්කාරයෙන් සමන්‍වාගත ඍද්ධිපාදය භවයි. වීර්‍ය්‍යසමාධිපූර්‍වක ... චිත්තසමාධිපූර්‍වක ... විමංසාසමාධිපූර්‍වක ප්‍රධන්වීර්‍ය්‍ය සඞ්ඛ්‍යාත සංස්කාරයෙන් සමන්‍වාගත ඍද්ධිපාදය භවයි:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, රාගයාගේ අභිඥා පිණිස මේ සතර ධර්‍මයෝ භාවිතව්‍යයෝ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 496,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "(4. 8. 4. - 30 )",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "රාගස්ස භික්ඛවෙ පරිඤ්ඤාය (චත්තාරො ධම්මා භාවෙතබ්බා -පෙ- රාගස්ස භික්ඛවෙ) පරික්ඛයාය -පෙ- පහාණාය -පෙ- ඛයාය -පෙ- වයාය -පෙ- විරාගාය -පෙ- නිරොධාය -පෙ- චාගාය -පෙ- පටිනිස්සග්ගාය -පෙ- ඉමෙ චත්තාරො ධම්මා භාවෙතබ්බා ති."
                    },
                    {
                        "type": "heading",
                        "text": "(4. 8. 31-60)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දොසස්ස (භික්ඛවෙ අභිඤ්ඤාය චත්තාරො ධම්මා භාවෙතබ්බා -පෙ- ) දොසස්ස භික්ඛවෙ පරිඤ්ඤාය -පෙ- පරික්ඛයාය -පෙ- පහාණාය -පෙ- ඛයාය -පෙ- වයාය -පෙ- විරාගාය -පෙ- නිරොධාය -පෙ- චාගාය -පෙ- පටිනිස්සග්ගාය -පෙ- ඉමෙ චත්තාරො ධම්මා භාවෙතබ්බා ති."
                    },
                    {
                        "type": "heading",
                        "text": "(4. 8. 61-480)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "මොහස්ස භික්ඛවෙ -පෙ- කොධස්ස -පෙ- උපනාහස්ස -පෙ- මක්ඛස්ස -පෙ- පලාසස්ස -පෙ- ඉස්සාය -පෙ- මච්ඡරියස්ස -පෙ- මායාය -පෙ- සාඨෙය්යස්ස -පෙ- ථම්භස්ස -පෙ- සාරම්භස්ස -පෙ- මානස්ස -පෙ- මදස්ස -පෙ- පමාදස්ස -පෙ- අභිඤ්ඤාය -පෙ- පරිඤ්ඤාය -පෙ- පරික්ඛයාය -පෙ- පහාණාය -පෙ- ඛයාය -පෙ- වයාය -පෙ- විරාගාය -පෙ- නිරොධාය පෙ -පෙ- චාගාය -පෙ- පටිනිස්සග්ගාය (චත්තාරො ධම්මා භාවෙතබ්බාති. කතමෙ චත්තාරො? ඉධ භික්ඛවෙ භික්ඛු කායෙ කායානුපස්සී -පෙ- වෙදනාසු වෙදනානුපස්සී -පෙ- චිත්තෙ චිත්තානුපස්සී -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති -පෙ- අකුසලානං ධම්මානං අනුප්පාදාය -පෙ- පහාණාය -පෙ- කුසලානං ධම්මානං උප්පාදාය -පෙ- පාරිපූරියා ඡන්දං ජනෙති -පෙ- ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං -පෙ- විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. පමාදස්ස භික්ඛවෙ අභිඤ්ඤාය -පෙ- පටිනිස්සග්ගාය ඉමෙ චත්තාරො ධම්මා භාවෙතබ්බාති."
                    },
                    {
                        "type": "centered",
                        "text": "{*}රාගාදිපෙය්යාලං නිට්ඨිතං",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "චතුක්කං සමත්තං",
                        "level": 3
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "*. රාගපදතො පට්ඨාය පමාදපරියන්තෙසු සොළසසු පෙය්යාලෙසු එකමෙකං අභිඤ්ඤායාදි දසහි පදෙහි යොජෙත්වා “චත්තාරො ධම්මා භාවෙතබ්බා”ති නිද්දිට්ඨ සතිපට්ඨාන සම්මප්පධාන ඉද්ධිපාදෙහි පච්චෙකං ඝටිතානි සබ්බ සුත්තානි අසීත්යධිකචත්තාරි සතානි හොන්ති."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "4.8.4-30",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, රාගයාගේ පරිඥා පිණිස ... ධර්‍මයෝ සතර දෙනෙක් වැඩිය යුත්තාහ. මහණෙනි, රාගයාගේ පරික්‍ෂය පිණිස ... ප්‍රහාණය පිණිස ක්‍ෂය පිණිස ... ව්‍යය පිණිස ... විරාගය පිණිස ... නිරෝධය පිණිස ... ත්‍යාගය පිණිස ... ප්‍රතිනිස්‍සර්‍ගය පිණිස මේ සතර ධර්‍මයෝ භාවිතව්‍යයෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "4.8.31-60",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, ද්වේෂයාගේ අභිඥා පිණිස ධර්‍මයෝ සතර දෙනෙක් වැඩිය යුත්තාහ. මහණෙනි, ද්වේෂයාගේ පරිඥා පිණිස ... පරික්‍ෂය පිණිස ... ප්‍රහාණය පිණිස ... ක්‍ෂය පිණිස ... ව්‍යය පිණිස ... විරාගය පිණිස ... නිරෝධය පිණිස ... ත්‍යාගය පිණිස ... ප්‍රතිනිස්සර්‍ගය පිණිස ... මේ සතර ධර්‍මයෝ වැඩිය යුත්තාහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "heading",
                        "text": "4.8.61-480",
                        "level": 1
                    },
                    {
                        "text": "මහණෙනි, මෝහයාගේ ... ක්‍රෝධයාගේ ... උපනාහයාගේ ... මක්‍ඛයාගේ ... පලාසයාගේ ... ඊර්‍ෂ්‍යාවගේ ... මාත්සර්‍ය්‍යයාගේ ... මායාවගේ සඨභාවයාගේ ස්තම්භයාගේ ... සාරම්භයාගේ ... මානයාගේ ... මදයාගේ ... ප්‍රමාදයාගේ ... අභිඥා පිණිස ... පරිඥා පිණිස ... පරික්‍ෂය පිණිස ... ප්‍රහාණය පිණිස ... ක්‍ෂය පිණිස ... ව්‍යය පිණිස ... විරාගය පිණිස ... නිරෝධය පිණිස ... ත්‍යාගය පිණිස ... ප්‍රතිනිස්සර්‍ගය පිණිස ධර්‍මයෝ සතර දෙනෙක් වැඩිය යුත්තාහ. කවර සතර දෙනෙක යත්: මහණෙනි, මේ ශාසනයෙහි මහණ තෙම කයෙහි කය නුවණින් දක්නේ ... වේදනාවන්හි වේදනා නුවණින් දක්නේ ... ධර්‍මයන්හි ධර්‍ම නුවණින් දක්නේ වෙසෙයි ... අකුශල ධර්‍මයන්ගේ අනුත්පාදය පිණිස ... ප්‍රහාණය පිණිස ... කුශලධර්‍මයන්ගේ උත්පාදය පිණිස ... භාවනායෙන් පරිපූර්‍ණත්‍වය පිණිස ඡන්‍දය දනවයි ... ඡන්‍ද සමාධි ප්‍රධන්වීර්‍ය්‍ය සමන්‍වාගත ඍද්ධිපාදය ... වීර්‍ය්‍ය සමාධි ... චිත්ත සමාධි ... විමංසාසමාධි ප්‍රධන්වීර්‍ය්‍ය සමන්‍වාගත ඍද්ධිපාදය වඩයි. මහණෙනි, ප්‍රමාදයාගේ අභිඥා පිණිස ... ප්‍රතිනිස්සර්‍ගය පිණිස මේ සතර ධර්‍මයෝ වැඩිය යුත්තාහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "{*}රාගාදි පෙය්‍යාලය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "චතුක්ක නිපාතය සමාප්ත යි.",
                        "type": "centered",
                        "level": 3
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "*. මෙහි රාග පදය පටන් ප්‍රමාද පදය අවසන් කොට ඇති සොළොස් පදයන්ට “අභිඥා පිණිස” ආදි දශපදයන් වෙන වෙන ම සම්බන්ධ කොට එක් එක් පදය ‘ධර්‍මයෝ සතර දෙනෙක් වැඩිය යුත්තාහ’ යි කී නයින් සතිපට්ඨාන, සම්මප්පධාන, ඉද්ධිපාද යන සූත්‍ර තුණ සමඟ යොදාගත් කල සියලු සූත්‍ර සංඛ්‍යාව 480 කි. රාගාදි එක් එක් පෙය්‍යාලයෙහි සූත්‍රයෝ තිස් දෙනෙකි."
                    }
                ]
            }
        }
    ]
}