{
    "filename": "an-4-3",
    "bookId": 23,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 196,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. තතියො පණ්ණාසකො",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. වලාහකවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 1. 1",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පඨමවලාහකසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1. එකං සමයං භගවා **සාවත්ථියං** විහරති **ජෙතවනෙ** අනාථපිණ්ඩිකස්ස ආරාමෙ. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි භික්ඛවොති. භදන්තෙති තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච :"
                    },
                    {
                        "type": "paragraph",
                        "text": "චත්තාරොමෙ භික්ඛවෙ වලාහකා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ගජ්ජිතා නො වස්සිතා, වස්සිතා නො ගජ්ජිතා, නෙව ගජ්ජිතා නො වස්සිතා, ගජ්ජිතා ච වස්සිතා ච. ඉමෙ ඛො භික්ඛවෙ චත්තාරො වලාහකා."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ චත්තාරො’මෙ වලාහකූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ගජ්ජිතා නො වස්සිතා, වස්සිතා නො ගජ්ජිතා, නෙව ගජ්ජිතා නො වස්සිතා, ගජ්ජිතා ච වස්සිතා ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො ගජ්ජිතා හොති නො වස්සිතා? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො භාසිතා හොති නො කත්තා. එවං ඛො භික්ඛවෙ පුග්ගලො ගජ්ජිතා හොති නො වස්සිතා. සෙය්යථාපි සො භික්ඛවෙ වලාහකො ගජ්ජිතා නො වස්සිතා, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො වස්සිතා හොති නො ගජ්ජිතා? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො කත්තා හොති නො භාසිතා. එවං ඛො භික්ඛවෙ පුග්ගලො වස්සිතා හොති නො ගජ්ජිතා. සෙය්යථාපි සො භික්ඛවෙ වලාහකො වස්සිතා නො ගජ්ජිතා, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො නෙව ගජ්ජිතා හොති නො වස්සිතා? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො නෙව භාසිතා හොති නො කත්තා. එවං ඛො භික්ඛවෙ පුග්ගලො නෙව ගජ්ජිතා හොති නො වස්සිතා. සෙය්යථාපි සො භික්ඛවෙ වලාහකො නෙව ගජ්ජිතා හොති නො වස්සිතා, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "3. තෙවන පණ්ණාසකය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. වලාහක වර්ගය",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4.3.1.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පඨමවලාහක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1. එක් කලෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර සමීපයෙහි ජේතවන නම් අනේපිඬු සිටුහුගේ ආරාමයෙහි වැඩවසන සේක. එකල්හි භාග්‍යවතුන් වහන්සේ මහණෙනි’ යි භික්‍ෂූන් ඇමැතූ සේක. වහන්සැ’ යි ඒ භික්‍ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වූහ. භාග්‍යවතුන් වහන්සේ තෙල වදාළහ:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ වලාහකයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ගිගිරි ඇත්තේ නොවස්නේය. වස්නේ ගිගිරි නැත්තේය. ගිගිරි ද නැත්තේ වැසි ද නැත්තේ ය. ගිගිරි ද ඇත්තේ වැසි ද ඇත්තේ යි. මහණෙනි, මේ සතර වලාවෝ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම වලා බඳු මේ පුද්ගලයෝ සතර දෙනෙක් ලොකයෙහි විද්‍යමානයහ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ගිගිරි ඇත්තේ නොවස්නේය. වස්නේ ගිගිරි නැත්තේය. ගිගිරි ද නැත්තේ වැසි ද නැත්තේ ය. ගිගිරි ද ඇත්තේ වැසි ද ඇත්තේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල තෙමේ ගිගිරි ඇත්තේ නොවස්නේ වේ ද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් (මෙ ද මෙ ද කරමි යි) බණන්නේත් නො කරන්නේ ය. මහණෙනි, මෙසේ පුද්ගල ගුගුරනුයේ නො වස්නේ නම් වෙයි. මහණෙනි, යම් පරිදි ඒ වලාහක ගිගිරි කරන්නේ නො වස්නේ වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇත්තෙකැයි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල වර්‍ෂා කරන්නේ ගිගුරුම් නො කරන්නේ වේ ද? මහණෙනි, මෙ ලොව ඇතැම් පුද්ගලයෙක් (නො බැණ ම ඒ ඒ දැය) කරන්නේ වෙයි. බණන්නේ නො වෙයි. මහණෙනි, මෙ පරිදි පුද්ගල වර්‍ෂා කරන්නේ ගිගුරුම් නො කරන්නේ නම් වෙයි. මහණෙනි, යම් පරිදි ඒ වලාහක වර්‍ෂා කරන්නේ ගිගිරි නො කරන්නේ වේ ද, මහණෙනි, මේ පුද්ගලයා මම එබඳු උපමා ඇති කොට කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල ගිගිරි නො කරන්නේත්, වර්‍ෂා නො කරන්නේත් වේ ද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් නො කියන්නේ ම නො කරන්නේත් වෙයි. මහණෙනි, මෙසේ පුද්ගල ගිගිරි නො කරන්නේ ම වර්‍ෂා නො කරන්නේ ද වෙයි. මහණෙනි, යම් පරිදි වලාහක ගිගිරි නො කරන්නේ ම වර්‍ෂා නො කරන්නේත් වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇත්තෙකැ යි කියමි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 198,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො ගජ්ජිතා ච හොති වස්සිතා ච? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො භාසිතා ච හොති කත්තා ච. එවං ඛො භික්ඛවෙ පුග්ගලො ගජ්ජිතා ච හොති වස්සිතා ච. සෙය්යථාපි සො භික්ඛවෙ වලාහකො ගජ්ජිතා ච වස්සිතා ච, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො වලාහකූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 1. 2",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(දුතියවලාහකසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "2. චත්තාරො’මෙ භික්ඛවෙ වලාහකා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ගජ්ජිතා නො වස්සිතා, වස්සිතා නො ගජ්ජිතා, නෙව ගජ්ජිතා නො වස්සිතා, ගජ්ජිතා ච වස්සිතා ච. ඉමෙ ඛො භික්ඛවෙ චත්තාරො වලාහකා."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ චත්තාරො’මෙ වලාහකූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ගජ්ජිතා නො වස්සිතා, වස්සිතා නො ගජ්ජිතා, නෙව ගජ්ජිතා නො වස්සිතා, ගජ්ජිතා ච වස්සිතා ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො ගජ්ජිතා හොති නො වස්සිතා? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො ධම්මං පරියාපුණාති: සුත්තං ගෙය්යං වෙය්යාකරණං ගාථං උදානං ඉතිවුත්තකං ජාතකං අබ්භුතධම්මං වෙදල්ලං. සො ඉදං දුක්ඛන්ති යථාභූතං නප්පජානාති. අයං දුක්ඛසමුදයොති යථාභූතං නප්පජානාති. අයං දුක්ඛනිරොධොති යථාභූතං නප්පජානාති. අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං නප්පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො ගජ්ජිතා හොති නො වස්සිතා. සෙය්යාථාපි සො භික්ඛවෙ වලාහකො ගජ්ජිතා නො වස්සිතා, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො වස්සිතා හොති නො ගජ්ජිතා? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො ධම්මං නෙව ධම්මං පරියාපුණාති : සුත්තං ගෙය්යං වෙය්යාකරණං ගාථං උදානං ඉතිවුත්තකං ජාතකං අබ්භුතධම්මං වෙදල්ලං. සො ඉදං දුක්ඛන්ති යථාභූතං පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො වස්සිතා හොති නො ගජ්ජිතා. සෙය්යථාපි සො භික්ඛවෙ වලාහකො වස්සිතා නො ගජ්ජිතා, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල ගුගුරන්නේත් වස්නේත් වේ ද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් බණන්නේත් කරන්නේත් වෙයි. මහණෙනි, මෙසේ පුද්ගල ගුගුරන්නේත් වස්නේත් වෙයි. මහණෙනි, යම් පරිදි ඒ වලාහක ගුගුරන්නේත් වස්නේත් වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇති කොට කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර වැදෑරුම් වලාහකූපම පුද්ගලයෝ ලොකයෙහි විද්‍යමානයහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.1.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතියවලාහක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "2. මහණෙනි, මේ වලාහකයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ගිගිරි කරන්නේ වැසි නො කරන්නේය. වැසි නො කරන්නේ ගිගිරි කරන්නේය. ගිගිරි නො කරන්නේ වැසි ද නො කරන්නේය. ගිගිරි කරන්නේ වැසි ද කරන්නේයි. මහණෙනි, මේ සතර වලාහකයෝ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම මේ වලාහකූපම පුද්ගලයෝ සතර දෙනෙක් ලොකයෙහි විද්‍යමානය හ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ගිගිරි කරන්නේ වැසි නො කරන්නේය. වැසි කරන්නේ ගිගිරි නො කරන්නේය. ගිගිරි නො කරන්නේ ම වැසි ද නො කරන්නේය. ගිගිරි කරන්නේත් වැසි ද කරන්නේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල ගිගිරි කරන්නේ වැසි නො කරන්නේ වේ ද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් සුත්ත, ගෙය්‍ය, වෙය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වෙදල්ල යන පෙළදහම් හදාරයි. හේ “මේ දුකැ” යි තත් වූ පරිදි නො දන්නේ ය. “මේ දුඃඛසමුදය” යි තත් වූ පරිදි නො දන්නේ ය. “මේ දුඃඛනිරොධය” යි තත් වූ පරිදි නො දන්නේ ය. “මේ දුඃඛනිරොධගාමිනී ප්‍රතිපදාය” යි තත් වූ පරිදි නො දන්නේ ය. මහණෙනි, මෙසේ පුද්ගල ගිගිරි කරන්නේ වැසි නො කරන්නේ ය. මහණෙනි, යම් පරිදි වලාහක ගිගිරි කරන්නේ වැසි නො කරන්නේ වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇත්තෙකැයි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල වැසි කරන්නේ ගිගිරි නො කරන්නේ වේ ද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් සුත්ත, ගෙය්‍ය, වෙය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වෙදල්ල යන පෙළදහම් නොහදාරනුයේ වෙයි. හෙතෙම “මේ දුකැ” යි තත් වූ පරිදි දනී. ... “මේ දුඃඛනිරොධගාමිනී ප්‍රතිපදාය” යි තත් වූ පරිදි දනී. මහණෙනි, මෙසේ පුද්ගල වැසි කරන්නේ ගිගිරි නො කරන්නේ වෙයි. මහණෙනි, යම් පරිදි ඒ වලාහක වැසි කරන්නේ ගිගිරි නො කරන්නේ වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇත්තෙකැයි කියමි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 200,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො නෙව ගජ්ජිතා හොති නො වස්සිතා? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො ධම්මං න පරියාපුණාති: සුත්තං ගෙය්යං වෙය්යාකරණං ගාථං උදානං ඉතිවුත්තකං ජාතකං අබ්භුතධම්මං වෙදල්ලං. සො ඉදං දුක්ඛන්ති යථාභූතං නප්පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං නප්පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො නෙව ගජ්ජිතා හොති නො වස්සිතා. සෙය්යථාපි සො භික්ඛවෙ වලාහකො නෙව ගජ්ජිතා නො වස්සිතා, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො ගජ්ජිතා ච හොති වස්සිතා ච? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො ධම්මං පරියාපුණාති : සුත්තං ගෙය්යං වෙය්යාකරණං ගාථං උදානං ඉතිවුත්තකං ජාතකං අබ්භුතධම්මං වෙදල්ලං. සො ඉදං දුක්ඛන්ති යථාභූතං පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො ගජ්ජිතා ච හොති වස්සිතා ච. සෙය්යථාපි සො භික්ඛවෙ වලාහකො ගජ්ජිතා ච වස්සිතා ච, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො වලාහකූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 1. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(කුම්භසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3. චත්තාරො’මෙ භික්ඛවෙ කුම්භා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "තුච්ඡො පිහිතො, පූරො විවටො, තුච්ඡො විවටො, පූරො පිහිතො. ඉමෙ ඛො භික්ඛවෙ චත්තාරො කුම්භා."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙවං ඛො භික්ඛවෙ චත්තාරො’මෙ කුම්භූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "තුච්ඡො පිහිතො, පූරො විවටො, තුච්ඡො විවටො, පූරො පිහිතො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල ගිගිරි නො කරන්නේ ම වැසි නො කරන්නේ වේ ද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් සුත්ත, ගෙය්‍ය, වෙය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වෙදල්ල යන පෙළදහම් නො හදාරයි. හේ “මේ දුකැ” යි තත් වූ පරිදි නො දනී. ... “මේ දුඃඛනිරොධගාමිනී ප්‍රතිපදාය” යි තත් වූ පරිදි නො දනී. මහණෙනි, මෙසේ පුද්ගල ගිගිරි නො කරන්නේ ම වැසි ද නො කරන්නේ ය. මහණෙනි, යම් පරිදි ඒ වලාහක ගිගිරි නො කරන්නේ ම වැසි ද නො කරන්නේ වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇත්තෙකැයි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල ගිගිරි කරන්නේත් වැසි කරන්නේත් වේ ද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් සුත්ත, ගෙය්‍ය, වෙය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වෙදල්ල යන පෙළදහම් හදාරයි. හේ “මේ දුකැ” යි තත් වූ පරිදි දනී. ... “මේ දුඃඛනිරොධගාමිනී ප්‍රතිපදාය” යි තත් වූ පරිදි දනී. මහණෙනි, මෙසේ පුද්ගල ගිගිරි කරන්නේත් වැසි කරන්නේත් වෙයි. මහණෙනි, යම් පරිදි ඒ වලාහක ගුගුරන්නේත් වස්නේත් වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇත්තෙකැයි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර වැදෑරුම් පුද්ගලයෝ ලෝකයෙහි විද්‍යමානයහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.1.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කුම්භ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3. මහණෙනි, මේ කුම්භයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇතුළත සිස් වූ පිටත පියු මුව ඇති එකෙක. ඇතුළත දිය පිරුණු නො පියු මුව ඇති එකෙක. ඇතුළත සිස් වූ නො පියූ මුව ඇති එකෙක. ඇතුළත දිය පිරුණු පියු මුව ඇති එකෙක. මේ සතර කුම්භයෝය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම මේ කුම්භොපම පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි විද්‍යමානයහ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇතුළත සිස් වූ පියු මුව ඇති එකෙක. ඇතුළත පිරුණු වළ කට ඇති එකෙක. ඇතුළත සිස් වූ වළ කට ඇති එකෙක. ඇතුළත පිරුණු පියු කට ඇති එකෙක.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 202,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො තුච්ඡො හොති පිහිතො? ඉධ භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස පාසාදිකං හොති අභික්කන්තං පටික්කන්තං ආලොකිතං විලොකිතං සම්මිඤ්ජිතං පසාරිතං සඞ්ඝාටිපත්තචීවරධාරණං. සො ඉදං දුක්ඛන්ති යථාභූතං නප්පජානාති. අයං දුක්ඛ සමුදයොති -පෙ- අයං දුක්ඛ නිරොධොති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං නප්පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො තුච්ඡො හොති පිහිතො. සෙය්යථාපි සො භික්ඛවෙ කුම්භො තුච්ඡො පිහිතො, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො පූරො හොති විවටො? ඉධ භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස න පාසාදිකං හොති අභික්කන්තං පටික්කන්තං ආලොකිතං විලොකිතං සම්මිඤ්ජිතං පසාරිතං සඞ්ඝාටිපත්තචීවරධාරණං. සො ඉදං දුක්ඛන්ති යථාභූතං පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො පූරො හොති විවටො. සෙය්යථාපි සො භික්ඛවෙ කුම්භො පූරො විවටො, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො තුච්ඡො හොති විවටො? ඉධ භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස න පාසාදිකං හොති අභික්කන්තං පටික්කන්තං ආලොකිතං විලොකිතං සම්මිඤ්ජිතං පසාරිතං සඞ්ඝාටිපත්තචීවරධාරණං. සො ඉදං දුක්ඛන්ති යථාභූතං නප්පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං නප්පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො තුච්ඡො හොති විවටො. සෙය්යථාපි සො භික්ඛවෙ කුම්භො තුච්ඡො විවටො, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො පූරො හොති පිහිතො? ඉධ භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස පාසාදිකං හොති අභික්කන්තං පටික්කන්තං ආලොකිතං විලොකිතං සම්මිඤ්ජිතං පසාරිතං සඞ්ඝාටිපත්තචීවරධාරණං. සො ඉදං දුක්ඛන්ති යථාභූතං පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො පූරො හොති පිහිතො. සෙය්යථාපි සො භික්ඛවෙ කුම්භො පූරො පිහිතො, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො කුම්භූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල ඇතුළත හිස් වූයේ පියු මුව ඇතියේ වේ ද? මහණෙනි, මෙ සස්නෙහි ඇතැම් පුද්ගලකුගේ ඉදිරි යෑම, වටාලා ඊම, ඉදිරි බැලීම, ඔබමොබ බැලීම, අත්පා හැකිලීම, අත්පා දිග හැරීම, සඟළ පාසිවුරු ධැරීම ප්‍රසාද එළවන්නේ වෙයි. හේ “මේ දුකැ”යි තත්වූ පරිදි නො දනී “මේ දුක්ඛසමුදය”යි ... “මේ දුක්ඛනිරොධය”යි ... “මේ දුක්ඛනිරොධගාමිනී පටිපදා ය”යි තත් වූ පරිදි නො දනී. මහණෙනි, මෙසේ පුද්ගල ඇතුළත සිස් වූයේ පිටත පියු මුව ඇතියේ වෙයි. මහණෙනි, යම් පරිදි ඒ කුම්භය ඇතුළත සිස් වූයේ පිටත පියු මුව ඇතියේ වේද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැ යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල ඇතුළත පිරුණේ පිටත වළ මුව ඇතියේ වේ ද? මහණෙනි, මෙසස්නෙහි ඇතැම් පුද්ගලයකුගේ ඉදිරි යෑම, පෙරළා ඊම, ඉදිරි බැලීම, ඔබමොබ බැලීම, අත්පා හැකිලීම, අත්පා දිග හැරීම, සඟළ පා සිවුරු ධැරීම ප්‍රසාද එළවන්නේ නො වෙයි. හේ “මේ දුකැ”යි තත්වූ පරිදි දනී ... “මේ දුඃඛනිරොධගාමිනී ප්‍රතිපදා ය”යි තත් වූ පරිදි දනී. මහණෙනි, මෙසේ පුද්ගල ඇතුළත පිරුණේ පිටත විවෘත වූයේ වෙයි. මහණෙනි, යම් පරිදි ඒ කුම්භය ඇතුළත පිරුණේ පිටත විවෘත වූයේ වේද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැ යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල ඇතුළත සිස් වූයේ පිටත විවෘත වූයේ වේ ද? මහණෙනි, මෙසස්නෙහි ඇතැම් පුද්ගලයකුගේ ඉදිරි යෑම, පෙරළා ඊම, ඉදිරි බැලීම, ඔබමොබ බැලීම, අත්පා හැකිලීම, අත්පා දිගු කිරීම, සඟළ පාසිවුරු ධැරීම ප්‍රසාද එළවන්නේ නො වෙයි. හේ “මේ දුකැ”යි තත්වූ පරිදි නො දනී ... “මේ දුඃඛනිරොධගාමිනී ප්‍රතිපදා ය”යි තත් වූ පරිදි නො දනී. මහණෙනි, මෙසේ පුද්ගල ඇතුළත සිස් වූයේ පිටත විවෘත වූයේ වෙයි. මහණෙනි, යම් පරිදි ඒ කුම්භය තෙමේ ඇතුළත හිස් වූයේ පිටත විවෘත වූයේ වේද, මහණෙනි, මම මේ පුද්ගල එබඳු උපමා ඇත්තෙකැ යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල ඇතුළත පිරුණේ පිටත පියු මුව ඇතියේ වේ ද, මහණෙනි, මෙසස්නෙහි ඇතැම් පුද්ගලයකුගේ ඉදිරි යෑම, පෙරළා ඊම, ඉදිරි බැලීම, ඔබමොබ බැලීම, අත්පා හැකිලීම, අත්පා දිගු කිරීම, සඟළ පාසිවුරු ධැරීම ප්‍රසාද එළවන්නේ වෙයි. හේ “මේ දුකැ”යි තත්වූ පරිදි දනී ... “මේ දුක්ඛනිරොධගාමිනී ප්‍රතිපදා ය”යි තත් වූ පරිදි දනී. මහණෙනි, මෙසේ පුද්ගල ඇතුළත පිරුණේ පිටත පියු මුව ඇතියේ වෙයි. මහණෙනි, යම් පරිදි ඒ කුම්භය ඇතුළත පිරුණේ පිටත පියු මුව ඇතියේ වේද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇත්තෙකැ’යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර වැදෑරුම් කුම්භොපම පුද්ගලයෝ ලොකයෙහි විද්‍යමානය හ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 204,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 3. 1. 4",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(උදකරහදසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "4. චත්තාරො’මෙ භික්ඛවෙ උදකරහදා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "උත්තානො ගම්භීරොභාසො, ගම්භීරො උත්තානොභාසො, උත්තානො උත්තානොභාසො, ගම්භීරො ගම්භීරොභාසො. ඉමෙ ඛො භික්ඛවෙ චත්තාරො උදකරහදා."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ චත්තාරො’මෙ උදකරහදූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "උත්තානො ගම්භීරොභාසො, ගම්භීරො උත්තානොභාසො, උත්තානො උත්තානොභාසො, ගම්භීරො ගම්භීරොභාසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො උත්තානො හොති ගම්භීරොභාසො? ඉධ භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස පාසාදිකං හොති අභික්කන්තං පටික්කන්තං ආලොකිතං විලොකිතං සම්මිඤ්ජිතං පසාරිතං සඞ්ඝාටිපත්තචීවරධාරණං. සො ඉදං දුක්ඛන්ති යථාභූතං නප්පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං නප්පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො උත්තානො හොති ගම්භීරොභාසො. සෙය්යථාපි සො භික්ඛවෙ උදකරහදො උත්තානො ගම්භීරොභාසො, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො ගම්භීරො හොති උත්තානොභාසො? ඉධ භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස න පාසාදිකං හොති අභික්කන්තං පටික්කන්තං ආලොකිතං විලොකිතං සම්මිඤ්ජිතං පසාරිතං සඞ්ඝාටිපත්තචීවරධාරණං. සො ඉදං දුක්ඛන්ති යථාභූතං පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො ගම්භීරො හොති උත්තානොභාසො. සෙය්යථාපි සො භික්ඛවෙ උදකරහදො ගම්භීරො උත්තානොභාසො, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො උත්තානො හොති උත්තානොභාසො? ඉධ භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස න පාසාදිකං හොති අභික්කන්තං පටික්කන්තං ආලොකිතං විලොකිතං සම්මිඤ්ජිතං පසාරිතං සඞ්ඝාටිපත්තචීවරධාරණං. සො ඉදං දුක්ඛන්ති යථාභූතං නප්පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං නප්පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො උත්තානො හොති උත්තානොභාසො. සෙය්යථාපි සො භික්ඛවෙ උදකරහදො උත්තානො උත්තානොභාසො, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.3.1.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උදකරහද සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "4. මහණෙනි, මේ දිය පිරුණු දහතළාවෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නො ගැඹුරු වූ (එහෙත්) ගැඹුරු සේ පැණෙන එකෙක, ගැඹුරු වූයේ නො ගැඹුරු සේ පැණෙන එකෙක. නො ගැඹුරු වූයේ නො ගැඹුරු සේ පැණෙන එකෙක. ගැඹුරු වූයේ ගැඹුරු සේ පැණෙන එකෙක. මහණෙනි, මේ සතර දිය පිරුණු දහතළාවෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම දහතළා බඳු පුද්ගලයෝ මේ සතර දෙනෙක් ලෝකයෙහි විද්‍යමානයහ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නො ගැඹුරු වූයේ ගැඹුරු සේ පැණෙන එකෙක. ගැඹුරු වූයේ නො ගැඹුරු සේ පැණෙන එකෙක. නො ගැඹුරු වූයේ නො ගැඹුරු සේ පැණෙන එකෙක. ගැඹුරු වූයේ ගැඹුරු සේ පැණෙන එකෙකැ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල නො ගැඹුරු වූයේ ගැඹුරු සේ පැණෙන්නේ වේ ද? මහණෙනි, මෙසස්නෙහි ඇතැම් පුද්ගලයක්හුගේ ඉදිරි යෑම, පෙරළා ඊම, ඉදිරි බැලීම, වටා බැලීම, අත්පා හැකිලීම, අත්පා දිගු කිරීම, සඟළ පාසිවුරු දැරීම ප්‍රසාද එළවන්නේ වෙයි. හේ “මේ දුකැ”යි තත්වූ පරිදි නො දනී. “මේ දුක්ඛසමුදය”යි ... “මේ දුක්ඛ නිරොධය”යි ... “මේ දුඃඛනිරොධගාමිනී ප්‍රතිපදාය”යි තත් වූ පරිදි නො දනී. මහණෙනි, මෙසේ පුද්ගල නො ගැඹුරු වූයේ ගැඹුරු සේ පැණෙන්නේ වෙයි. මහණෙනි, යම් පරිදි හේ දහතළාව නො ගැඹුරු වූයේ ගැඹුරු සේ පැණේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇත්තෙකැයි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල ගැඹුරු වූයේ නො ගැඹුරු සේ පැණෙන්නේ වේ ද? මහණෙනි, මෙසස්නෙහි ඇතැම් පුද්ගලයක්හුගේ ඉදිරි යෑම, පෙරළා ඊම, ඉදිරි බැලීම, පසු බැලීම, අත්පා හැකිලීම, අත්පා දිගු කිරීම, සඟළ පාසිවුරු දැරීම ප්‍රසාද එළවන්නේ නො වෙයි. හේ “මේ දුකැ”යි තත්වූ පරිදි දනී. ... “මේ දුඃඛනිරොධගාමිනී පටිපදා”යි තත් වූ පරිදි දනී. මහණෙනි, මෙසේ පුද්ගල ගැඹුරු වූයේ නො ගැඹුරු සේ පැණෙන්නේ වෙයි. මහණෙනි, යම් පරිදි හේ දහතළාව ගැඹුරු වූයේ නො ගැඹුරු සේ පැණෙන්නේ වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇත්තෙකැයි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල නො ගැඹුරු වූයේ නො ගැඹුරු සේ පැණෙන්නේ වේ ද? මහණෙනි, මෙසස්නෙහි ඇතැම් පුද්ගලයක්හුගේ ඉදිරි යෑම, පෙරළා ඊම, ඉදිරි බැලීම, පසු බැලීම, අත්පා හැකිලීම, අත්පා දිගු හැරීම, සඟළපාසිවුරු දැරීම ප්‍රසාද එළවන්නේ නො වේ. හේ “මේ දුකැ”යි තත්වූ පරිදි නො දනී. ... “මේ දුඃඛනිරොධගාමිනී ප්‍රතිපදා”යි තත් වූ පරිදි නො දනී. මහණෙනි, මෙසේ පුද්ගල නො ගැඹුරු වූයේ නො ගැඹුරු සේ පැණුම් ඇත්තේ වෙයි. මහණෙනි, යම් සේ ඒ දහතළාව නො ගැඹුරු වූයේ නො ගැඹුරු සේ පැණුම් ඇත්තේ වේ ද, මහණෙනි, මම මේ පුඟුලා එබඳු උපමා ඇත්තෙකැයි කියමි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 206,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො ගම්භීරො හොති ගම්භීරොභාසො? ඉධ භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස පාසාදිකං හොති අභික්කන්තං පටික්කන්තං ආලොකිතං විලොකිතං සම්මිඤ්ජිතං පසාරිතං සඞ්ඝාටිපත්තචීවරධාරණං. සො ඉදං දුක්ඛන්ති යථාභූතං පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො ගම්භීරො හොති ගම්භීරොභාසො. සෙය්යථාපි සො භික්ඛවෙ උදකරහදො ගම්භීරො ගම්භීරොභාසො, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො උදකරහදූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 1. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අම්බසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "5. චත්තාරිමානි භික්ඛවෙ අම්බානි. කතමානි චත්තාරි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ආමං පක්කවණ්ණි, පක්කං ආමවණ්ණි, ආමං ආමවණ්ණි, පක්කං පක්කවණ්ණි. ඉමානි ඛො භික්ඛවෙ චත්තාරි අම්බානි."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ චත්තාරො’මෙ අම්බූපමා{1} පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ආමො පක්කවණ්ණී, පක්කො ආමවණ්ණී, ආමො ආමවණ්ණී, පක්කො පක්කවණ්ණී."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො ආමො හොති පක්කවණ්ණී? ඉධ භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස පාසාදිකං හොති අභික්කන්තං පටික්කන්තං ආලොකිතං විලොකිතං සම්මිඤ්ජිතං පසාරිතං සඞ්ඝාටිපත්තචීවරධාරණං. සො ඉදං දුක්ඛන්ති යථාභූතං නප්පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං නප්පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො ආමො හොති පක්කවණ්ණී. සෙය්යථාපි තං භික්ඛවෙ අම්බං ආමං පක්කවණ්ණි, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො පක්කො හොති ආමවණ්ණී? ඉධ භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස න පාසාදිකං හොති අභික්කන්තං පටික්කන්තං ආලොකිතං විලොකිතං සම්මිඤ්ජිතං පසාරිතං සඞ්ඝාටිපත්තචීවරධාරණං. සො ඉදං දුක්ඛන්ති යථාභූතං පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො පක්කො හොති ආමවණ්ණී. සෙය්යථාපි තං භික්ඛවෙ අම්බං පක්කං ආමවණ්ණි, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. චත්තාරො අම්බූපමා - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල ගැඹුරු වූයේ ගැඹුරු පැණුම් ඇත්තේ වේ ද? මහණෙනි, මෙසස්නෙහි ඇතැම් පුද්ගලයක්හුගේ ඉදිරි ගමන, පසු ගමන, ඉදිරි බැලීම, පසු බැලීම, ආකුඤ්චනය, ප්‍රසාරණය, සඟළපාසිවුරු දැරීම ප්‍රසාදජනක වෙයි. හේ “මේ දුකැ”යි තත්වූ පරිදි දනී. ... “මේ දුඃඛනිරොධගාමිනී ප්‍රතිපදා”යි තත් වූ පරිදි දනී. මහණෙනි, මෙසේ පුද්ගල ගැඹුරු වූයේ ගැඹුරු සේ පැණෙන්නේ වෙයි. මහණෙනි, යම්සේ ඒ දහතළාව ගැඹුරු වූයේ ගැඹුරු සේ පැණෙන්නේ වේ ද, මහණෙනි, මම මේ පුඟුලා එබඳු උපමා ඇත්තෙකැයි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, දහතළා බඳු මේ සතර වැදෑරුම් පුද්ගලයෝ ලොකයෙහි විද්‍යමානයහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.1.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අම්බ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "5. මහණෙනි, මෙ අඹපල සතරෙකි. කවර සතරෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "අමුවූයේ පැසුනුවන් එකෙක. පැසුනේ අමුවන් එකෙක. අමුවූයේ අමුවන් එකෙක. පැසුනේ පැසුනුවන් එකෙක. මහණෙනි, මේ සතර අඹපලයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම ලොව්හි මේ අඹ බඳු පුඟුලෝ සතර දෙනෙක් විද්‍යමානයහ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "අමුවූයේ පැසුනුවන් එකෙක. පැසුනේ අමුවන් එකෙක. අමුවූයේ අමුවන් එකෙක. පැසුනේ පැසුනුවන් එකෙක.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල අමුවූයේ පැසුනුවන් වේ ද? මහණෙනි, මෙසස්නෙහි ඇතැම් පුද්ගලයක්හුගේ ඉදිරියෑම, පසුඊම, ඉදිරි බැලීම, අවට බැලීම, අත්පා හැකිළීම, අත්පා දිගුකිරීම, සඟළපාසිවුරු දැරීම යන මේ ප්‍රසාද එළවන්නේ වෙයි. හේ “මේ දුකැ”යි තත් වූ පරිදි නො දනී ... “මේ දුඃඛනිරොධගාමිනී ප්‍රතිපදා” යි තත් වූ පරිදි නො දනී. මහණෙනි, මෙසේ පුද්ගල අමුවූයේ පැසුනුවන් වෙයි. මහණෙනි, යම් සේ ඒ අඹය අමු වූයේ පැසුනුවන් වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැ යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල පැසුනේ අමුවන් වේ ද? මහණෙනි, මෙසස්නෙහි ඇතැම් පුඟුලක්හුගේ ගමන, ආගමන, ආලොකන, විලොකන, ආකුඤ්චන, ප්‍රසාරණ, සඞ්ඝාටිපාත්‍රචීවරධාරණ යන මේ ප්‍රාසාදික නො වේ. හේ “මේ දුකැ”යි තත් වූ පරිදි දනී ... “මේ දුඃඛනිරොධගාමිනී ප්‍රතිපදා” යි තත් වූ පරිදි දනී. මෙසේ පුද්ගල පැසුනේ අමුවන් වෙයි. මහණෙනි, යම් පරිදි ඒ අඹපල පැසුනේ අමුවන් වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැ යි කියමි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 208,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො ආමො හොති ආමවණ්ණී? ඉධ භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස න පාසාදිකං හොති අභික්කන්තං පටික්කන්තං ආලොකිතං විලොකිතං සම්මිඤ්ජිතං පසාරිතං සඞ්ඝාටිපත්තචීවරධාරණං. සො ඉදං දුක්ඛන්ති යථාභූතං නප්පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං නප්පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො ආමො හොති ආමවණ්ණී. සෙය්යථාපි තං භික්ඛවෙ අම්බං ආමං ආමවණ්ණි, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො පක්කො හොති පක්කවණ්ණී? ඉධ භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස පාසාදිකං හොති අභික්කන්තං පටික්කන්තං ආලොකිතං විලොකිතං සම්මිඤ්ජිතං පසාරිතං සඞ්ඝාටිපත්තචීවරධාරණං. සො ඉදං දුක්ඛන්ති යථාභූතං පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො පක්කො හොති පක්කවණ්ණී. සෙය්යථාපි තං භික්ඛවෙ අම්බං පක්කං පක්කවණ්ණි, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො අම්බූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 1. 6{*}\n4. 3. 1. 7",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(මූසිකාසුත්තං)",
                        "keyOffset": 7,
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "7. චතස්සො ඉමා භික්ඛවෙ මූසිකා. කතමා චතස්සො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ගාධං කත්තා නො වසිතා, වසිතා නො ගාධං කත්තා, නෙව ගාධං කත්තා නො වසිතා, ගාධං කත්තා ච වසිතා ච. ඉමා ඛො භික්ඛවෙ චතස්සො මූසිකා."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ චත්තාරො’මෙ මූසිකූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ගාධං කත්තා නො වසිතා, වසිතා නො ගාධං කත්තා, නෙව ගාධං කත්තා නො වසිතා, ගාධං කත්තා ච වසිතා ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො ගාධං කත්තා හොති නො වසිතා? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො ධම්මං පරියාපුණාති : සුත්තං ගෙය්යං වෙය්යාකරණං ගාථං උදානං ඉතිවුත්තකං ජාතකං අබ්භුතධම්මං වෙදල්ලං. සො ඉදං දුක්ඛන්ති යථාභූතං නප්පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං නප්පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො ගාධං කත්තා හොති නො වසිතා. සෙය්යථාපි සා භික්ඛවෙ මූසිකා ගාධං කත්තා නො වසිතා, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "*. ‘ඡට්ඨං උත්තානත්ථමෙවාති’ - අට්ඨකථායං දිස්සති පාළියම්පන ඡට්ඨං සුත්තං න දිස්සති."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල අමුවූයේ අමුවන් වේ ද? මහණෙනි, මෙසස්නෙහි ඇතැම් පුඟුලක්හුගේ අභික්‍රමණ, ප්‍රකික්‍රමණ, ආලෝකන, විලෝකන, ආකුඤ්චන, ප්‍රසාරණ, සඞ්ඝාටිපාත්‍රචීවරධාරණ යන මේ ප්‍රාසාදික නොවේ. හේ මේ “දුකැ”යි තත් වූ පරිදි නොදනී ... “මේ දුඃඛනිරොධගාමිනී ප්‍රතිපදා”යි තත් වූ පරිදි නො දනී. මහණෙනි, මෙසේ පුද්ගල අමුවූයේ අමුවන් වෙයි. මහණෙනි, යම් පරිදි ඒ අඹපල අමුවූයේ අමුවන් වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැ යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල පැසුනේ පැසුනුවන් වේ ද? මහණෙනි, මෙසස්නෙහි ඇතැම් පුද්ගලයකුගේ ඉදිරියෑම, වටාලා ඊම, ආලොකන, විලොකන, හැකිළීම්, දිගු හැරීම්, සඟළ පා සිවුරු දැරීම් ප්‍රසාද එළවන්නේ වෙයි. හේ මේ “දුකැ”යි තත් වූ පරිදි දනී ... “මේ දුඃඛනිරොධගාමිනී ප්‍රතිපදා”යි තත් වූ පරිදි දනී. මහණෙනි, මෙසේ පුද්ගල පැසුනේ පැසුනුවන් වේ. මහණෙනි, යම්සේ ඒ අඹය පැසුනේ පැසුනුවන් වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැ යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අඹ බඳු මේ සතර වැදෑරුම් පුඟුලෝ ලොව්හි විද්‍යමානයහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.1.6.\n4.3.1.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මූසිකා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "7. මහණෙනි, මේ මූෂිකාවෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "බිල කරන්නී වාස නො කරන්නී ය, වාස කරන්නී බිල නො කරන්නී ය. බිල නො කරන්නී ම වාස නො කරන්නී ය. බිල කරන්නීත් වාස ද කරන්නී ය. මහණෙනි, මේ සතර මූෂිකාවෝ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම මේ මූෂිකොපම පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි විද්‍යමානය හ. කවර සතර දෙනෙක් ද යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "බිල කරන්නේ වාස නො කරන්නේ ය. වාස කරන්නේ බිල නො කරන්නේ ය. බිල නො කරන්නේ ම වාස ද නො කරන්නේ ය. බිල කරන්නේත් වාස ද කරන්නේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල බිල කරන්නේ වාස නො කරන්නේ වේ ද? මහණෙනි, මෙසස්නෙහි ඇතැම් පුද්ගලයෙක් සුත්ත, ගෙය්‍ය, වෙය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වෙදල්ල යන පෙළදහම් හදාරයි. හේ “මේ දුකැ”යි තත් වූ පරිදි නො දනී ... “මේ දුක්ඛනිරොධගාමිනී පටිපදාය”යි තත් වූ පරිදි නො දනී. මහණෙනි, මෙසේ පුද්ගල බිල කරන්නේ වාස නො කරන්නේ වෙයි. මහණෙනි, යම් පරිදි ඒ මුෂිකාව බිල කරන්නී වාස නොකරන්නී වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැ යි කියමි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 210,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො වසිතා හොති නො ගාධං කත්තා? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො ධම්මං න පරියාපුණාති සුත්තං ගෙය්යං වෙය්යාකරණං ගාථං උදානං ඉතිවුත්තකං ජාතකං අබ්භුතධම්මං වෙදල්ලං. සො ඉදං ඉදං දුක්ඛන්ති යථාභූතං පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො වසිතා හොති නො ගාධං කත්තා. සෙය්යථාපි සා භික්ඛවෙ මූසිකා වසිතා නො ගාධං කත්තා. තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො නෙව ගාධං කත්තා හොති නො වසිතා? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො ධම්මං න පරියාපුණාති සුත්තං ගෙය්යං වෙය්යාකරණං ගාථං උදානං ඉතිවුත්තකං ජාතකං අබ්භුතධම්මං වෙදල්ලං. සො ඉදං දුක්ඛන්ති යථාභූතං නප්පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං නප්පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො නෙව ගාධං කත්තා හොති නො වසිතා. සෙය්යථාපි සා භික්ඛවෙ මූසිකා නෙව ගාධං කත්තා නො වසිතා, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො ගාධං කත්තා ච හොති වසිතා ච? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො ධම්මං පරියාපුණාති සුත්තං ගෙය්යං වෙය්යාහකරණං ගාථං උදානං ඉතිවුත්තකං ජාතකං අබ්භුතධම්මං වෙදල්ලං. සො ඉදං දුක්ඛන්ති යථාභූතං පජානාති -පෙ- අයං දුක්ඛනිරොධගාමිනී පටිපදාති යථාභූතං පජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො ගාධං කත්තා ච හොති වසිතා ච. සෙය්යථාපි සා භික්ඛවෙ මූසිකා ගාධං කත්තා ච වසිතා ච, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො මූසිකූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 1. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(බලිවද්දසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "8. චත්තාරො’මෙ භික්ඛවෙ බලිවද්දා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සගවචණ්ඩො නො පරගවචණ්ඩො, පරගවචණ්ඩො නො සගවචණ්ඩො, සගවචණ්ඩො ච පරගවචණ්ඩො ච, නෙව සගවචණ්ඩො නො පරගවචණ්ඩො. ඉමෙ ඛො භික්ඛවෙ චත්තාරො බලිවද්දා."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ චත්තාරො’මෙ බලිවද්දූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල වාස කරන්නේ බිල නොකරන්නේ වේ ද? මහණෙනි, මෙසස්නෙහි ඇතැම් පුද්ගලයෙක් සුත්ත, ගෙය්‍ය, වෙය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වෙදල්ල යන පෙළදහම් නො හදාරයි. හේ “මේ දුකැ”යි තත් වූ පරිදි දනී ... “මේ දුක්ඛනිරොධගාමිනී පටිපදාය”යි තත් වූ පරිදි දනී. මහණෙනි, මෙසේ පුද්ගල වාස කරන්නේ බිල නො කරන්නේ ය. මහණෙනි, යම් පරිදි ඒ මුෂිකාව වාස කරන්නී බිල නොකරන්නී වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැ යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල බිල නොකරන්නේ ම වාස නො කරන්නේත් වේ ද? මහණෙනි, මෙසස්නෙහි ඇතැම් පුද්ගලයෙක් සුත්ත, ගෙය්‍ය, වෙය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වෙදල්ල යන පෙළදහම් නො හදාරයි. හේ “මේ දුකැ”යි තත් වූ පරිදි නො දනී ... “මේ දුක්ඛනිරොධගාමිනී පටිපදාය”යි තත් වූ පරිදි නො දනී. මහණෙනි, මෙසේ පුද්ගල බිල නො කරන්නේ ම වාසත් නො කරන්නේ ය. මහණෙනි, යම් පරිදි ඒ මුෂිකාව බිල නොකරන්නී වාස නො කරන්නී වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැ යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල බිල කරන්නේත් වාස කරන්නේත් වේ ද? මහණෙනි, මෙසස්නෙහි ඇතැම් පුද්ගලයෙක් සුත්ත, ගෙය්‍ය, වෙය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වෙදල්ල යන පෙළදහම් හදාරයි. හේ “මේ දුකැ”යි තත් වූ පරිදි දනී ... “මේ දුක්ඛනිරොධගාමිනී පටිපදා”යි තත් වූ පරිදි දනී. මහණෙනි, මෙසේ පුද්ගල බිල කරන්නේත් වාස කරන්නේත් වෙයි. මහණෙනි, යම් පරිදි ඒ මුෂිකාව බිල කරන්නීත් වාස කරන්නීත් වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැ යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ මූෂිකොපම මේ සතර පුද්ගලයෝ ලෝකයෙහි විද්‍යමානයහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.1.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බලීවද්ද සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "8. මහණෙනි,මේ බලීවර්‍දයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සිය ගෙරිනට සැඬ වූයේ අන් ගෙරිනට සැඬ නොවූයේය, අන් ගෙරිනට සැඬ වූයේ සිය ගෙරිනට සැඬ නොවූයේය, සිය ගෙරිනට සැඬ වූයේත් අන් ගෙරිනට ද සැඬ වූයේ ය, සිය ගෙරිනට සැඬ නොවූයේ ම අන් ගෙරිනට ද සැඬ නොවූයේය. මහණෙනි, මේ සතර බලීවර්‍දයෝයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම බලීවර්‍දොපම වූ මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි විද්‍යමානය හ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 212,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමෙ චත්තාරො? සගවචණ්ඩො නො පරගවචණ්ඩො, පරගවචණ්ඩො නො සගවචණ්ඩො, සගවචණ්ඩො ච පරගවචණ්ඩො ච, නෙව සගවචණ්ඩො නො පරගවචණ්ඩො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො සගවචණ්ඩො හොති නො පරගවචණ්ඩො? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො සකං පරිසං{1} උබ්බෙජෙතා හොති, නො පරපරිසං. එවං ඛො භික්ඛවෙ පුග්ගලො සගවචණ්ඩො හොති නො පරගවචණ්ඩො. සෙය්යථාපි සො භික්ඛවෙ බලිවද්දො සගවචණ්ඩො නො පරගවචණ්ඩො, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො පරගවචණ්ඩො හොති නො සගවචණ්ඩො? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො පරපරිසං උබ්බෙජෙතා හොති නො සකපරිසං. එවං ඛො භික්ඛවෙ පුග්ගලො පරගවචණ්ඩො හොති නො සගවචණ්ඩො. සෙය්යථාපි සො භික්ඛවෙ බලිවද්දො පරගවචණ්ඩො නො සගවචණ්ඩො, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො සගවචණ්ඩො ච හොති පරගවචණ්ඩො ? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො සකපරිසඤ්ච උබ්බෙජෙතා හොති පරපරිසඤ්ච. එවං ඛො භික්ඛවෙ පුග්ගලො සගවචණ්ඩො ච හොති පරගවචණ්ඩො ච. සෙය්යථාපි සො භික්ඛවෙ බලිවද්දො සගවචණ්ඩො ච පරගවචණ්ඩො ච, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො නෙව සගවචණ්ඩො හොති නො පරගවචණ්ඩො? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො නෙව සකපරිසං උබ්බෙජෙතා හොති නො පරපරිසං. එවං ඛො භික්ඛවෙ පුග්ගලො නෙව සගවචණ්ඩො හොති නො පරගවචණ්ඩො. සෙය්යථාපි සො භික්ඛවෙ බලිවද්දො නෙව සගවචණ්ඩො නො පරගවචණ්ඩො, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො බලිවද්දූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සකපරිසං - මඡසං. ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "කවර සතර දෙනෙක යත්: සගව චණ්ඩ වූයේ පරගවචණ්ඩ නොවූයේය. පරගවචණ්ඩවූයේ සගවචණ්ඩ නොවූයේ ය. සගවචණ්ඩ වූයේ පරගවචණ්ඩ ද වූයේය. සගවචණ්ඩ නොවූයේ ම පරගවචණ්ඩ ද නොවූයේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල සගවචණ්ඩ වූයේ පරගවචණ්ඩ නොවූයේ වේ ද? මහණෙනි, මෙ ලොව ඇතැම් පුද්ගලයෙක් සිය පිරිස ඝටා උද්වෙග (බියපත්) කරන්නේ වෙයි. පරපිරිස නොගටන්නේ වෙයි. මහණෙනි, මෙසේ පුද්ගල සගවචණ්ඩ වූයේ පරගවචණ්ඩ නොවූයේය. මහණෙනි, යම් පරිදි ඒ ගොන් සගවචණ්ඩ ව පරගවචණ්ඩ නොවූයේ වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැ යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල පරගවචණ්ඩ වූයේ සගවචණ්ඩ නොවූයේ වේ ද? මහණෙනි, මෙ ලොව ඇතැම් පුද්ගලයෙක් පරපර්‍ෂද් ඝටා උද්වෙග කරන්නේ වෙයි. සිය පිරිස නොගටන්නේ වෙයි. මහණෙනි, මෙසේ පුද්ගල පරගවචණ්ඩ වූයේ සගවචණ්ඩ නොවූයේ වෙයි. මහණෙනි, යම් පරිදි ඒ ගොන් පරගවචණ්ඩ ව සගවචණ්ඩ නොවූයේ වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැ යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල සගවචණ්ඩ වූයේත් පරවචණ්ඩ වූයේත් වේ ද? මහණෙනි, මෙ ලොව ඇතැම් පුද්ගලයෙක් සිය පිරිස ඝටා උද්වෙග කරන්නේ වෙයි. පරපර්‍ෂද් ඝටන්නේත් වෙයි. මහණෙනි, මෙසේ පුද්ගල සගවචණ්ඩ වූයේත් පරගවචණ්ඩ වූයේත් වෙයි. මහණෙනි, යම් පරිදි ඒ ගොන් සගවචණ්ඩ වූයේත් පරගවචණ්ඩ වූයේත් වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැ යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල සගවචණ්ඩ නොවූයේ ම පරවචණ්ඩ නොවූයේත් වේ ද? මහණෙනි, මෙ ලොව ඇතැම් පුද්ගලයෙක් ස්වකීය පර්‍ෂද් ඝටා උද්වෙග කරන්නේත් නොවෙයි. පරපර්‍ෂද් ඝටන්නේත් නොවෙයි. මහණෙනි, මෙසේ පුද්ගල සගවචණ්ඩ නොවූයේත් පරගවචණ්ඩ නොවූයේ ද වෙයි. මහණෙනි, යම් පරිදි ඒ ගොන් සගවචණ්ඩ නොවූ\tයේ ම පරගවචණ්ඩ නොවූයේත් වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැ යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, බලීවර්‍දොපම මේ සතර පුද්ගලයෝ ලෝකයෙහි විද්‍යමානයහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 214,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 3. 1. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(රුක්ඛසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "9. චත්තාරො’මෙ භික්ඛවෙ රුක්ඛා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඵෙග්ගු ඵෙග්ගුපරිවාරො, ඵෙග්ගු සාරපරිවාරො, සාරො ඵෙග්ගුපරිවාරො, සාරො සාරපරිවාරො. ඉමෙ ඛො භික්ඛවෙ චත්තාරො රුක්ඛා."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ චත්තාරො’මෙ රුක්ඛූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඵෙග්ගු ඵෙග්ගුපරිවාරො, ඵෙග්ගු සාරපරිවාරො, සාරො ඵෙග්ගුපරිවාරො, සාරො සාරපරිවාරො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො ඵෙග්ගු හොති ඵෙග්ගුපරිවාරො? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො දුස්සීලො හොති පාපධම්මො. පරිසාපිස්ස හොති දුස්සීලා පාපධම්මා. එවං ඛො භික්ඛවෙ පුග්ගලො ඵෙග්ගු හොති ඵෙග්ගුපරිවාරො. සෙය්යථාපි සො භික්ඛවෙ රුක්ඛො ඵෙග්ගු ඵෙග්ගුපරිවාරො, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො ඵෙග්ගු හොති සාරපරිවාරො? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො දුස්සීලො හොති පාපධම්මො, පරිසා ච ඛ්වස්ස හොති සීලවතී කල්යාණධම්මා. එවං ඛො භික්ඛවෙ පුග්ගලො ඵෙග්ගු හොති සාරපරිවාරො. සෙය්යථාපි සො භික්ඛවෙ රුක්ඛො ඵෙග්ගු සාරපරිවාරො, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො සාරො හොති ඵෙග්ගුපරිවාරො? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො සීලවා හොති කල්යාණධම්මො. පරිසා ච ඛ්වස්ස හොති දුස්සීලා පාපධම්මා. එවං ඛො භික්ඛවෙ පුග්ගලො සාරො හොති ඵෙග්ගුපරිවාරො. සෙය්යථාපි සො භික්ඛවෙ රුක්ඛො සාරො ඵෙග්ගුපරිවාරො, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො සාරො හොති සාරපරිවාරො? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො සීලවා හොති කල්යාණධම්මො. පරිසාපිස්ස හොති සීලවතී කල්යාණධම්මා. එවං ඛො භික්ඛවෙ පුග්ගලො සාරො හොති සාරපරිවාරො. සෙය්යථාපි සො භික්ඛවෙ රුක්ඛො සාරො සාරපරිවාරො, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො රුක්ඛූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.3.1.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "රුක්ඛ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "9. මහණෙනි, මේ වෘක්‍ෂයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නිසරු රුක් පිරිවර කොට ඇති නිසරු රුකෙක. හර රුක් පිරිවර කොට ඇති නිසරු රුකෙක. නිසරු රුක් පිරිවර කොට ඇති හර රුකෙක. හර රුක් පිරිවර කොට ඇති හර රුකෙක. මහණෙනි, මේ වෘක්‍ෂයෝ සතර දෙනයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම රුක්බඳු මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි විද්‍යමානයහ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඵලගු පරිවාර කොට ඇති ඵලගු පුද්ගලය, සාර පරිවාර කොට ඇති ඵලගු පුද්ගලය, ඵලගු පරිවාර කොට ඇති සාර පුද්ගලය. සාර පරිවාර කොට ඇති සාර පුද්ගල යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල ඵලගුපරිවාර කොට ඇති ඵලගු පුද්ගල වේද? මහණෙනි, මෙ ලොව්හි ඇතැම් පුද්ගලයෙක් දුශ්ශීල වෙයි. ලමුදහම් ඇති වෙයි. ඔහු පිරිස ද දුශ්ශීල වෙයි, ලමුදහම් ඇති වෙයි. මහණෙනි, මෙසේ පුද්ගල ඵලගුපරිවාර කොට ඇති ඵලගු පුද්ගල නම් වෙයි. මහණෙනි, යම් පරිදි ඒ වෘක්‍ෂය ඵලගුපරිවාර කොට ඇති ඵලගුවෘක්‍ෂයෙක් වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැයි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල සාර පරිවාර කොට ඇති ඵලගු පුද්ගල වේද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් දුශ්ශීල වෙයි, ලමුදහම් ඇති වෙයි. උහුගේ පිරිස සිල්වත් වෙයි, කලණදහම් ඇති වෙයි. මහණෙනි, මෙසේ පුද්ගල සාර පරිවාර කොට ඇති ඵලගු පුද්ගල වෙයි. මහණෙනි, යම් පරිදි ඒ වෘක්‍ෂය සාර පරිවාර කොට ඇති ඵලගුවෘක්‍ෂ වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැයි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල ඵලගුපරිවාර කොට ඇති සාර පුද්ගල වේද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් සිල්වත් වෙයි, කලණදහම් ඇති වෙයි. ඔහුගේ පිරිස දුශ්ශීල වෙයි, ලමුදහම් ඇති වෙයි. මහණෙනි, මෙසේ පුද්ගල ඵලගුපරිවාර කොට ඇති සාර පුද්ගල වෙයි. මහණෙනි, යම් පරිදි ඒ වෘක්‍ෂය, ඵලගුපරිවාර කොට ඇති සාරවෘක්‍ෂයෙක් වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැයි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල සාරපරිවාර කොට ඇති සාර පුද්ගල වේද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් සිල්වත් වෙයි. කලණදහම් ඇති වෙයි. ඔහුගේ පිරිස ද සිල්වත් වෙයි, කළණදහම් ඇති වෙයි. මහණෙනි, මෙසේ පුද්ගල සාරපරිවාර කොට ඇති සාර පුද්ගල නම් වෙයි. මහණෙනි, යම් පරිදි ඒ වෘක්‍ෂය සාරපරිවාර කොට ඇති සාරවෘක්‍ෂ වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැයි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, වෘක්‍ෂෝපම මේ සතර පුද්ගලයෝ ලෝකයෙහි විද්‍යමානයහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 216,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 3. 1. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ආසිවිසසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "10. චත්තාරො’මෙ භික්ඛවෙ ආසිවිසා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ආගතවිසො න ඝොරවිසො, ඝොරවිසො න ආගතවිසො, ආගතවිසො ච ඝොරවිසො ච, නෙවාගතවිසො න ඝොරවිසො. ඉමෙ ඛො භික්ඛවෙ චත්තාරො ආසීවිසා."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ චත්තාරො’මෙ ආසිවිසූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ආගතවිසො න ඝොරවිසො, ඝොරවිසො න ආගතවිසො, ආගතවිසො ච ඝොරවිසො ච, නෙවාගතවිසො න ඝොරවිසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො ආගතවිසො හොති න ඝොරවිසො? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො අභිණ්හං කුජ්ඣති. සො ච ඛ්වස්ස කොධො න දීඝරත්තං අනුසෙති. එවං ඛො භික්ඛවෙ පුග්ගලො ආගතවිසො හොති න ඝොරවිසො. සෙය්යථාපි සො භික්ඛවෙ ආසීවිසො ආගතවිසො න ඝොරවිසො, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො ඝොරවිසො හොති න ආගතවිසො? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො න හෙව ඛො අභිණ්හං කුජ්ඣති. සො ච ඛ්වස්ස කොධො දීඝරත්තං අනුසෙති. එවං ඛො භික්ඛවෙ පුග්ගලො ඝොරවිසො හොති න ආගතවිසො. සෙය්යථාපි සො භික්ඛවෙ ආසිවිසො ඝොරවිසො න ආගතවිසො, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො ආගතවිසො ච හොති ඝොරවිසො ච? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො අභිණ්හං කුජ්ඣති. සො ච ඛ්වස්ස කොධො දීඝරත්තං අනුසෙති. එවං ඛො භික්ඛවෙ පුග්ගලො ආගතවිසො ච හොති ඝොරවිසො ච. සෙය්යථාපි සො භික්ඛවෙ ආසිවිසො ආගතවිසො ච ඝොරවිසො ච, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො නෙවාගතවිසො හොති න ඝොරවිසො? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො න හෙව ඛො අභිණ්හං කුජ්ඣති. සො ච ඛ්වස්ස කොධො න දීඝරත්තං අනුසෙති. එවං ඛො භික්ඛවෙ පුග්ගලො නෙවාගතවිසො න ඝොරවිසො. සෙය්යථාපි සො භික්ඛවෙ ආසිවිසො නෙවාගතවිසො න ඝොරවිසො, තථූපමාහං භික්ඛවෙ ඉමං පුග්ගලං වදාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො ආසිවිසූපමා පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "වලාහකවග්ගො පඨමො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "තස්සුද්දානං :"
                    },
                    {
                        "type": "paragraph",
                        "text": "ද්වෙ වලාහකා ච කුම්භ උදකරහදා ද්වෙ හොන්ති - අම්බානි මූසිකා බලිවද්දා රුක්ඛා ආසිවිසෙන තෙ දසාති.{*}"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "*. එත්ථා පි සුත්තමෙකං ඌනං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.3.1.10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආසීවිස සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "10. මහණෙනි, මේ ආශීවිෂයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "පැමිණි (එවේලෙහි) විස ඇතියේ කැකුළු (පවත්නා) විස නැතියේ ය. පැමිණි විස නැතියේ කැකුළුවිස ඇතියේ ය. පැමිණි විස ඇතියේ කැකුළු විස ද ඇතියේ ය. පැමිණි විස නැතියේ ම කැකුළුවිස ද නැතියේ යි. මහණෙනි, මේ සතර ආශීවිෂයෝ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම ආශීවිශෝපම මේ සතර පුද්ගලයෝ ලෝකයෙහි විද්‍යමානය හ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "පැමිණි විස ඇතියේ කැකුළු විස නැතියේ ය. පැමිණි විස නැතියේ කැකුළු විස ඇතියේ ය. පැමිණි විස ඇතියේත් කැකුළු විස ද ඇතියේ ය. පැමිණි විස නැතියේ ම කැකුළුවිස ද නැතියේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල පැමිණි විස ඇතියේ කැකුළු විස නැතියේ වේ ද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් නිතොර කිපෙයි. උහුගේ ඒ ක්‍රෝධය දීර්‍ඝරාත්‍රයෙහි ලුහුබැඳ නො වැටෙයි. මහණෙනි, මෙසේ පුද්ගල පැමිණි විස ඇතියේ කැකුළු විස නැතියේ නම් වෙයි. මහණෙනි, යම් පරිදි ඒ ආශීවිෂයා පැමිණි විස ඇතියේ කැකුළු විස නැතියේ වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැ යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල පැමිණි විස නැතියේ කැකුළු විස ඇතියේ වේ ද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් නිතොර නො ම කිපේ. උහුගේ ඒ ක්‍රෝධය දීර්‍ඝරාත්‍රයෙහි ලුහුබැඳ වැටෙයි. මහණෙනි, මෙසේ පුද්ගල පැමිණි විස නැතියේ කැකුළු විස ඇතියේ නම් වෙයි. මහණෙනි, යම් පරිදි ඒ ආශීවිෂයා පැමිණි විස නැතියේ කැකුළු විස ඇතියේ වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැ යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල පැමිණි විස ඇතියේත් කැකුළු විස ඇතියේත් වේ ද: මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් නිතොර කිපෙයි. උහුගේ ඒ ක්‍රෝධය දීර්‍ඝරාත්‍රයෙහි ලුහුබැඳ වැටෙයි. මහණෙනි, මෙසේ පුද්ගල පැමිණි විස ඇතියේත් කැකුළු විස ඇතියේත් වෙයි. මහණෙනි, යම් පරිදි ඒ ආශීවිෂයා පැමිණි විස ඇතියේත් කැකුළු විස ඇතියේත් වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැ යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල පැමිණි විස නැතියේ ම කැකුළු විස නැතියේත් වේ ද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් නිතොර නො ම කිපෙයි. උහුගේ ඒ ක්‍රෝධය ද දීර්‍ඝරාත්‍රයෙහි ලුහුබැඳ නො වැටෙයි. මහණෙනි, මේ පුද්ගල පැමිණි විස නැතියේම කැකුළු විස නැතියේ ද වෙයි. මහණෙනි, යම් පරිදි ඒ ආශීවිෂයා පැමිණි විස නැතියේ ම කැකුළු විස නැතියේත් වේ ද, මහණෙනි, මම මේ පුද්ගලයා එබඳු උපමා ඇතියෙකැ යි කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ආශීවිෂෝපම මේ සතර පුද්ගලයෝ ලෝකයෙහි විද්‍යමානයහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වලාහක වර්‍ගය පළමුවැනියි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "එහි උද්දානය :",
                        "type": "unindented"
                    },
                    {
                        "text": "වලාහක දෙකය, කුම්භ-උදකරහද යන දෙකය, අම්බ, මූසික, රුක්ඛ, බලිවද්ද, ආසිවිස යන ඒ සූත්‍ර දසයෙකි. (දසයෙන් එක් සූත්‍රයෙක් මෙහි නැත.)",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 218,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "2. කෙසිවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 2. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(කෙසිසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "(සාවත්ථිනිදානං)"
                    },
                    {
                        "type": "paragraph",
                        "text": "11. අථ ඛො **කෙසි** අස්සදම්මසාරථි යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො කෙසිං අස්සදම්මසාරථිං භගවා එතදවොච :"
                    },
                    {
                        "type": "paragraph",
                        "text": "ත්වං ච ඛ්වාසි,{1} කෙසි, සඤ්ඤාතො{2} අස්සදම්මසාරථී. කථං පන ත්වං කෙසි, අස්සදම්මං විනෙසීති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අහං ඛො භන්තෙ අස්සදම්මං සණ්හෙනපි විනෙමි, ඵරුසෙනපි විනෙමි, සණ්හඵරුසෙනපි විනෙමීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සචෙ තෙ කෙසි, අස්සදම්මො සණ්හෙනපි විනයං න උපෙති, ඵරුසෙනපි විනයං න උපෙති, සණ්හඵරුසෙනපි විනයං න උපෙති, කින්ති නං කරොසීති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සචෙ මෙ භන්තෙ අස්සදම්මො සණ්හෙනපි විනයං න උපෙති, ඵරුසෙනපි විනයං න උපෙති, සණ්හඵරුසෙන විනයං න උපෙති, හනාමි නං භන්තෙ. තං කිස්ස හෙතු? මා මෙ ආචරියකුලස්ස අවණ්ණො අහොසීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "භගවා පන භන්තෙ අනුත්තරො පුරිසදම්මසාරථි, කථං පන භන්තෙ භගවා පුරිසදම්මං විනෙතීති{3}?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අහං ඛො කෙසි, පුරිසදම්මං සණ්හෙනපි විනෙමි, ඵරුසෙනපි විනෙමි සණ්හඵරුසෙනපි විනෙමි. තත්රිදං කෙසි, සණ්හස්මිං: ඉති කායසුචරිතං, ඉති කායසුචරිතස්ස විපාකො. ඉති වචීසුචරිතං, ඉති වචීසුචරිතස්ස විපාකො. ඉති මනොසුචරිතං, ඉති මනොසුචරිතස්ස විපාකො. ඉති දෙවා, ඉති මනුස්සා."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්රි දං කෙසි, ඵරුසස්මිං: ඉති කායදුච්චරිතං, ඉති කායදුච්චරිතස්ස විපාකො. ඉති වචීදුච්චරිතං, ඉති වචීදුච්චරිතස්ස විපාකො. ඉති මනොදුච්චරිතං, ඉති මනොදුච්චරිතස්ස විපාකො. ඉති නිරයො, ඉති තිරච්ඡානයොනි, ඉති පෙත්තිවිසයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්රිදං කෙසි, සණ්හඵරුසස්මිං. ඉති කායසුචරිතං, ඉති කායසුචරිතස්ස විපාකො. ඉති කායදුච්චරිතං, ඉති කායදුච්චරිතස්ස විපාකො. ඉති වචීසුචරිතං, ඉති වචීසුචරිතස්ස විපාකො. ඉති වචීදුච්චරිතං, ඉති වචීදුච්චරිතස්ස විපාකො. ඉති මනොසුචරිතං, ඉති මනොසුචරිතස්ස විපාකො. ඉති මනොදුච්චරිතං, ඉති මනොදුච්චරිතස්ස විපාකො. ඉති දෙවා, ඉති මනුස්සා. ඉති නිරයො, ඉති තිරච්ඡානයොනි, ඉති පෙත්තිවිසයොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ත්වං ඛොසි - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. පඤ්ඤාතො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. දමෙතීති - අට්ඨකථා"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "2. කේසි වර්ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4.3.2.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කේසි සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "(සැවැත් නිදානයි)",
                        "type": "unindented"
                    },
                    {
                        "text": "11. එසඳ කේසි නම් අස්දම්සැරි භාග්‍යවතුන් වහන්සේ කරා එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සකසා වැඳ එකත්පසෙක හින. එකත්පස් ව හුන් කේසි නම් අස්දම්සැරිහට භාග්‍යවතුන් වහන්සේ තෙල වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "text": "කේසිය, තෝ ප්‍රසිද්ධ අස්දම්සැරියෙහි. කේසිය, තෝ කෙසේ නම් නහඹු අසු විනය(දම)නය කෙරෙහි?",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, මම නහඹු අසු ශ්ලක්‍ෂණයෙනුදු (මුදුබැවිනුදු) විනයනය කෙරෙමි, පරුෂයෙනුදු විනයනය කෙරෙමි, ශ්ලක්‍ෂණ - පරුෂයෙනුදු විනයනය කෙරෙමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "කේසිය, ඉදින් තාගේ අශ්වදම්‍යයා ශ්ලක්‍ෂණයෙනුදු විනයට නොයේ නම්, පරුෂයෙනුදු විනයට නොයේ නම්, ශ්ලක්‍ෂණපරුෂයෙනුදු විනයට නොයේ නම්, ඔහුට කුම් කෙරෙහි?",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, ඉදින් මාගේ අශ්වදම්‍යයා ශ්ලක්‍ෂණයෙනුදු විනයට නොයේ නම්, පරුෂයෙනුදු විනයට නොයේ නම්, ශ්ලක්‍ෂණපරුෂයෙනුදු විනයට නොයේ නම්, වහන්ස, මම උහු මරමි. ඒ කවර හෙයින යත්: මාගේ ඇදුරුකුලයට නහමක් අකීර්‍තති වේවයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, භාග්‍යවතුන් වහන්සේ අනුත්තර පුරුෂදම්‍යසාරථී දෑ ය. වහන්ස, භාග්‍යවතුන් වහන්සේ පුරුෂදම්‍යයා කෙසේ විනයනය කරණ සේක් ද?",
                        "type": "paragraph"
                    },
                    {
                        "text": "කේසිය, මම පුරුෂදම්‍යයා ශ්ලක්‍ෂණයෙනුදු විනයනය කෙරෙමි, පරුෂයෙනුදු විනයනය කෙරෙමි, ශ්ලක්‍ෂණපරුෂයෙනුදු විනයනය කෙරෙමි. කේසිය, එහි මේ ශ්ලක්‍ෂණභාවය වෙයි: කායසුචරිතය මෙබඳු වෙයි, කායසුචරිතයාගේ විපාකය මෙබඳු වෙයි. වචීසුචරිතය මෙබඳු වෙයි, වචීසුචරිතයාගේ විපාකය මෙබඳු වෙයි. මනඃසුචරිතය මෙබඳු වෙයි, මනඃසුචරිතයාගේ විපාකය මෙබඳු වෙයි. දෙවියෝ මෙබන්දහ, මනුෂ්‍යයෝ මෙබන්දහයි මෙසේ දැක්වීමයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "කේසිය, එහි මේ පරුෂභාවය වෙයි: කායදුශ්චරිතය මෙසේ ය, කායදුශ්චරිතයාගේ විපාක මෙසේ ය. වාග්දුශ්චරිතය මෙසේ ය, වාග්දුශ්චරිතයාගේ විපාක මෙසේ ය. මනෝදුශ්චරිතය මෙසේ ය, මනෝදුශ්චරිතයාගේ විපාක මෙසේ ය. නිරය මෙසේ ය, තිරශ්චීනයෝනි මෙසේ ය, ප්‍රේතවිෂය මෙසේ ය යනු යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "කේසිය, එහි මේ ශ්ලක්‍ෂණපරුෂභාවය වේ: කායසුචරිතය මෙසේ ය, කායසුචරිතයාගේ විපාක මෙසේ ය, කායදුශ්චරිතය මෙසේ ය, කායදුශ්චරිතයාගේ විපාක මෙසේ ය, වචීසුචරිතය මෙසේ ය, වචීසුචරිතයාගේ විපාක මෙසේ ය. වචීදුශ්චරිතය මෙසේ ය, වචීදුශ්චරිතයාගේ විපාක මෙසේ ය. මනඃසුචරිතය මෙසේ ය, මනඃසුචරිතයාගේ විපාක මෙසේ ය. මනෝදුශ්චරිතය මෙසේ ය, මනෝදුශ්චරිතයාගේ විපාක මෙසේ ය. දෙවියෝ මෙබන්දහ. මනුෂ්‍යයෝ මෙබන්දහ. නිරය මෙබඳුය. තිරශ්චීනයෝනි මෙබඳුය. ප්‍රේතවිෂය මෙබඳුය යනුයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 220,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සචෙ තෙ භන්තෙ පුරිසදම්මො සණ්හෙන විනයං න උපෙති, ඵරුසෙන විනයං න උපෙති, සණ්හඵරුසෙන විනයං න උපෙති, කින්ති නං භගවා කරොතීති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සචෙ මෙ කෙසි, පුරිසදම්මො සණ්හෙන විනයං න උපෙති, ඵරුසෙන විනයං න උපෙති, සණ්හඵරුසෙන විනයං න උපෙති, හනාමි නං කෙසීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "න ඛො භන්තෙ භගවතො පාණාතිපාතො කප්පති. අථ ච පන භගවා එවමාහ: හනාමි නං කෙසීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සච්චං කෙසි, න තථාගතස්ස පාණාතිපාතො කප්පති. අපි ච සො පුරිසදම්මො සණ්හෙන විනයං න උපෙති, ඵරුසෙන විනයං න උපෙති, සණ්හඵරුසෙන විනයං න උපෙති, න තථාගතො වත්තබ්බං අනුසාසිතබ්බං මඤ්ඤති. නපි විඤ්ඤූ සබ්රහ්මචාරී වත්තබ්බං අනුසාසිතබ්බං මඤ්ඤන්ති. වධො හෙස කෙසි, අරියස්ස විනයෙ යං න තථාගතො වත්තබ්බං අනුසාසිතබ්බං මඤ්ඤති. නපි විඤ්ඤූ සබ්රහ්මචාරී වත්තබ්බං අනුසාසිතබ්බං මඤ්ඤන්තීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සො හි නූන භන්තෙ සුවධො හොති යං න තථාගතො වත්තබ්බං අනුසාසිතබ්බං මඤ්ඤති. නපි විඤ්ඤූ සබ්රහ්මචාරී වත්තබ්බං අනුසාසිතබ්බං මඤ්ඤන්තීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අභික්කන්තං භන්තෙ, අභික්කන්තං -පෙ- උපාසකං මං භන්තෙ භගවා ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 2. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අස්සාජානීය-ජව සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "12. චතූහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො රඤ්ඤො භද්රො අස්සාජානීයො රාජාරහො හොති රාජභොග්ගො. රඤ්ඤො අඞ්ගන්ත්වෙව සඞ්ඛං ගච්ඡති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමෙහි චතූහි? අජ්ජවෙන, ජවෙන, ඛන්තියා, සොරච්චෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ චතූහි අඞ්ගෙහි සමන්නාගතො රඤ්ඤො භද්රො අස්සාජානීයො රාජාරහො හොති රාජභොග්ගො. රඤ්ඤො අඞ්ගන්ත්වෙව සඞ්ඛං ගච්ඡති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ චතූහි ධම්මෙහි සමන්නාගතො භික්ඛු ආහුනෙය්යො හොති පාහුනෙය්යො, දක්ඛිණෙය්යො, අඤ්ජලිකරණීයො අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමෙහි චතූහි? අජ්ජවෙන ජවෙන ඛන්තියා සොරච්චෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ චතූහි ධම්මෙහි සමන්නාගතො භික්ඛු ආහුනෙය්යො හොති -පෙ- අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්සාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "වහන්ස, ඉදින් භගවත්හුගේ පුරුෂදම්‍ය භගවත්හුගේ පුරුෂදම්‍ය ශ්ලක්‍ෂණයෙනුදු විනයට නොයේ නම්, පරුෂයෙනුදු විනයට නොයේ නම්, ශ්ලක්‍ෂණපරුෂයෙනුදු විනයට නොයේ නම්, භාග්‍යවතුන් වහන්සේ ඔහුට කුම් කෙරෙති හෝ යි?",
                        "type": "paragraph"
                    },
                    {
                        "text": "කේසිය, ඉදින් මාගේ පුරුෂදම්‍යයා ශ්ලක්‍ෂෙයනුදු විනයට නොයේ නම්, පරුෂයෙනුදු විනයට නොයේ නම්, ශ්ලක්‍ෂණපරුෂයෙනුදු විනයට නොයේ නම්, කේසිය, ඔහු නස්මි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, භගවත්හට පණිවා නො කැපම ය. එතෙකුදු වුව, භාග්‍යවතුන් වහන්සේ ‘කේසිය, ඔහු නස්මි’යි මෙසේ වදාරණදෑ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සැබැව කේසිය, තථාගතයනට පණිවා නොසරුප් වෙයි. වැළිදු, ඒ පුරුෂදම්‍යයා ශ්ලක්‍ෂණයෙනුදු විනයට නොයේ නම්, පරුෂයෙනුදු විනයට නොයේ නම්, ශ්ලක්‍ෂණපරුෂයෙනුදු විනයට නොයේ නම්, තථාගතයෝ ඔහු කියයුතු කොට අනුශාසනා කළයුතු කොට නොසිතත්. නුවණැති සබ්‍රම්සරහුදු ඔහු කියයුතුකොට අනුශාසනා කටයුතු කොට නොසිතත්. කේසිය, තථාගතයන් වහන්සේ යමකු කියයුතු කොට අනුශාසනා කටයුතු කොට නොසිතත් ද, නුවණැති සබ්‍රම්සරහුදු ඔහු කියයුතුකොට අනුශාසනා කටයුතු කොට නොසිතත් ද, ආර්‍ය්‍යවිනයයෙහි තෙල වධයෙක් මැ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, තථාගතයන් වහන්සේ යමකු කියයුතු කොට අනුශාසනා කළයුතු කොට නොසිතන සේක් ද, නුවණැති සබ්‍රම්සරහුදු, කියයුතු කොට අනුශාසනා කළයුතු කොට නොසිතත් ද, හේ එකැතින් මහත් වධයෙක.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, ඉතා මැනව, ඉතා මැනව ... වහන්ස, භාග්‍යවතුන් වහන්සේ මා අද පටන් දිවිහිමියෙන් සරණ ගිය උවසකු කොට ධරණ සේක්වා.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.2.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අස්සාජානීය - ජව සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "12. මහණෙනි, රජුගේ භද්‍ර අශ්වාජානීය සතර අඟෙකින් සමන්‍වාගත වූයේ රජුට නිසි වෙයි. රජු විසින් උපභෝග කටයුතු වෙයි. රාජාඞ්ගයෙක් ම යයි ගණයට යෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "කවර සතර අඟෙකින යත්: ඍජු බැවින, පද ජවයෙන, අධිවාසනායෙන, සුරතභාවයෙනැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, රජුගේ භද්‍ර අශ්වාජානීය මේ සතර අඟින් සමන්‍වාගත වූයේ රජුට නිසි වූයේ වෙයි. රජු විසින් උපභෝග කටයුතු වෙයි. රාජාඞ්ගයෙක් ම යයි ගණයට යෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම සතර අඟෙකින් සමන්‍වාගත මහණ ආහුනෙය්‍ය වෙයි, පාහුණෙය්‍ය වෙයි, දක්ඛිණෙය්‍ය වෙයි, අඤ්ජලිකරණීය වෙයි. ලෝකයට අනුත්තර පුණ්‍යක්‍ෂෙත්‍ර වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "කවර සතර අඟෙකින යත්: ඍජු බැවින, ඤාණජවයෙන, ඉවසීමෙන, සුරතභාවයෙනැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර අඟින් සමන්‍වාගත මහණ ආහුනෙය්‍ය වෙයි ... ලෝකයට අනුත්තර පුණ්‍ය ක්‍ෂෙත්‍රවෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 222,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 3. 2. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අස්සාජානීය-පතොදසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "13. චත්තාරොමෙ භික්ඛවෙ භද්රො අස්සාජානීයා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චො භද්රො අස්සාජානීයො පතොදච්ඡායං දිස්වා සංවිජ්ජති සංවෙගං ආපජ්ජති: “කිං නු ඛො මං අජ්ජ අස්සදම්මසාරථි කාරණං කාරෙස්සති, කිමස්සාහං පතිකරොමී”ති. එව රූපොපි භික්ඛවෙ ඉධෙකච්චො භද්රො අස්සාජානීයො හොති. අයං භික්ඛවෙ පඨමො භද්රො අස්සාජානීයො සන්තො සංවිජ්ජමානො ලොකස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ ඉධෙකච්චො භද්රො අස්සාජානීයො නහෙව ඛො පතොදච්ඡායං දිස්වා සංවිජ්ජති සංවෙගං ආපජ්ජති, අපි ච ඛො ලොමවෙධවිද්ධො සංවිජ්ජති සංවෙගං ආපජ්ජති : “කිංනු ඛො මං අජ්ජ අස්සදම්මසාරථි කාරණං කාරෙස්සති, කිමස්සාහං පතිකරොමී”ති. එවරූපොපි භික්ඛවෙ ඉධෙකච්චො භද්රො අස්සාජානීයො හොති. අයං භික්ඛවෙ දුතියො භද්රො අස්සාජානීයො සන්තො සංවිජ්ජමානො ලොකස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ ඉධෙකච්චො භද්රො අස්සාජානීයො නහෙව ඛො පතොදච්ඡායං දිස්වා සංවිජ්ජති සංවෙගං ආපජ්ජති, නපි ලොමවෙධවිද්ධො සංවිජ්ජති සංවෙගං ආපජ්ජති. අපි ච ඛො චම්මවෙධවිද්ධො සංවිජ්ජති සංවෙගං ආපජ්ජති: “කිංනු ඛො මං අජ්ජ අස්සදම්මසාරථි කාරණං කාරෙස්සති, කිමස්සාහං පතිකරොමී”ති. එවරූපොපි භික්ඛවෙ ඉධෙකච්චො භද්රො අස්සාජානීයො හොති. අයං භික්ඛවෙ තතියො භද්රො අස්සාජානීයො සන්තො සංවිජ්ජමානො ලොකස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ ඉධෙකච්චො භද්රො අස්සාජානීයො නහෙව ඛො පතොදච්ඡායං දිස්වා සංවිජ්ජති සංවෙගං ආපජ්ජති, නපි ලොමවෙධවිද්ධො සංවිජ්ජති සංවෙගං ආපජ්ජති, නපි චම්මවෙධවිද්ධො සංවිජ්ජති සංවෙගං ආපජ්ජති. අපි ච ඛො අට්ඨිවෙධවිද්ධො සංවිජ්ජති සංවෙගං ආපජ්ජති: “කිංනු ඛො මං අජ්ජ අස්සදම්මසාරථි කාරණං කාරෙස්සති, කිමස්සාහං පතිකරොමී”ති. එවරූපොපි භික්ඛවෙ ඉධෙකච්චො භද්රො අස්සාජානීයො හොති. අයං භික්ඛවෙ චතුත්ථො භද්රො අස්සාජානීයො සන්තො සංවිජ්ජමානො ලොකස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො භද්රා අස්සාජානීයා සන්තො සංවිජ්ජමානා ලොකස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ චත්තාරොමෙ භද්රා පුරිසාජානීයා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.3.2.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අස්සාජානීය - පතොද සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "13. මහණෙනි, මේ භද්‍ර අශ්වාජානීයයෝ සතර දෙනෙක් ලෝකයෙහි විද්‍යමානයහ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ ලෝකයෙහි ඇතැම් භද්‍ර අශ්වාජානීයයෙක් කැහිටිසෙය දැක සංවෙග (ජව) උපදවයි, වෙගයට පැමිණෙයි: “දැන් අස්දම්සැරි මට කවර දඬුවමක් කරන්නේ ද? මම ඔහුට කිනම් දෑ කෙරෙම් දැ” යි. මහණෙනි, මෙබඳු වූ ද ඇතැම් භද්‍ර අශ්වාජානීයයෙක් මෙලොව වෙයි. මහණෙනි, මේ පළමුවන භද්‍ර අශ්වාජානීය ලෝකයෙහි විද්‍යමාන වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තවද මහණෙනි, මෙලොව ඇතැම් භද්‍ර අශ්වාජානීයයෙක් කැහිටිසෙය දැක සංවෙග නොම උපදවයි, වෙගයට නො පැමිණේ ම ය. වැළිත් ලොමකූපයෙහි හීකැහිටින් විදුනා ලද්දේ වෙග උපදවයි, වෙගයට පැමිණෙයි: “දැන් අස්දම්සැරි මට කිනම් දඬුවමක් කරන්නේ ද? මම ඔහුට කිනම් දෑ කෙරෙම් දැ” යි. මහණෙනි, මෙබඳු වූ ද ඇතැම් භද්‍ර අශ්වාජානීයයෙක් මෙලොව ඇත. මහණෙනි, මේ දෙවන භද්‍ර අශ්වාජානීය ලෝකයෙහි විද්‍යමාන වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තවද මහණෙනි, මෙලොව ඇතැම් භද්‍ර අශ්වාජානීයයෙක් කැහිටිසෙය දැක සංවෙග නො ම උපදවයි, වෙගයට නො ද පැමිණෙයි. ලොමකූපයෙහි විත් පහරින් විදුනා ලද්දේත් සංවේග නූපදවයි, වෙගයට නො ද පැමිණෙයි. වැළිත් සමෙහි විත්පහරින් විදුනා ලද්දේ සංවෙග උපදවයි, වෙගයට පැමිණෙයි: “දැන් අස්දම්සැරි මට කිනම් කාරණාවක් කරන්නේ ද? මම ඔහුට කිනම් දෑ කෙරෙම් දැ” යි. මහණෙනි, මෙබඳු වූ ද ඇතැම් භද්‍ර අශ්වාජානීයයෙක් මෙලොව වෙයි. මහණෙනි, මේ තුන්වන භද්‍ර අශ්වාජානීය ලෝකයෙහි විද්‍යමාන වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තවද මහණෙනි, මෙලොව ඇතැම් භද්‍ර අශ්වාජානීයයෙක් කැහිටිසෙය දැක සංවෙග නො ම උපදවයි, වෙගයට නො ද පැමිණෙයි. ලෝම කූපයෙහි විත් පහරින් විදුනා ලද්දේ සංවේග නො ම උපදවයි. වෙගයට නො පැමිණෙයි. චර්‍මයෙහි විත් පහරින් විදුනනා ලද්දේ සංවෙග නො උපදවයි, වෙගයට නො පැමිණෙයි. වැළිත් ඇට බිඳුනා විත් පහරින් විදුනා ලද්දේ සංවේග උපදවයි, වේගයට පැමිණෙයි, “දැන් අස්දම්සැරි මට කිනම් කරුණක් කරන්නේ ද? මම ඔහුට කිනම් දෑ කෙරෙම් දැ” යි. මහණෙනි, මෙබඳු වූ ද ඇතැම් භද්‍ර අශ්වාජානීයයෙක් මෙලොව විද්‍යමාන වෙයි. මහණෙනි, මේ සතරවන භද්‍ර අශ්වාජානීය ලෝකයෙහි විද්‍යමානය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ භද්‍රඅශ්වාජානීයයෝ සතර දෙන ලෝකයෙහි විද්‍යමානය හ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම භද්‍ර වූ මේ පුරුෂාජානීයයෝ සතර දෙනෙක් ලෝකයෙහි විද්‍යමානය හ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 224,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චො භද්රො පුරිසාජානීයො සුණාති අමුකස්මිං නාම ගාමෙ වා නිගමෙ වා ඉත්ථි වා පුරිසො වා දුක්ඛිතො වා කාලකතො වාති. සො තෙන සංවිජ්ජති සංවෙගං ආපජ්ජති. සංවිග්ගො යොනිසො පදහති. පහිතත්තො කායෙන චෙව පරමසච්චං සච්ඡිකරොති, පඤ්ඤාය ච අතිවිජ්ඣ පස්සති. සෙය්යථාපි සො භික්ඛවෙ භද්රො අස්සාජානීයො පතොදච්ඡායං දිස්වා සංවිජ්ජති සංවෙගං ආපජ්ජති, තථූපමාහං භික්ඛවෙ ඉමං භද්රං පුරිසාජානීයං වදාමි. එවරූපොපි භික්ඛවෙ ඉධෙකච්චො භද්රො පුරිසාජානීයො හොති. අයං භික්ඛවෙ පඨමො භද්රො පුරිසාජානීයො සන්තො සංවිජ්ජමානො ලොකස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ ඉධෙකච්චො භද්රො පුරිසාජානීයො නහෙව ඛො සුණාති අමුකස්මිං නාම ගාමෙ වා නිගමෙ වා ඉත්ථී වා පුරිසො වා දුක්ඛිතො වා කාලකතො වා ති. අපි ච ඛො සාමං පස්සති ඉත්ථිං වා පුරිසං වා දුක්ඛිතං වා කාලකතං වා. සො තෙන සංවිජ්ජති සංවෙගං ආපජ්ජති. සංවිග්ගො යොනිසො පදහති. පහිතත්තො කායෙන චෙව පරමසච්චං සච්ඡිකරොති, පඤ්ඤාය ච අතිවිජ්ඣ පස්සති. සෙය්යථාපි සො භික්ඛවෙ භද්රො අස්සාජානීයො ලොමවෙධවිද්ධො සංවිජ්ජති සංවෙගං ආපජ්ජති, තථූපමාහං භික්ඛවෙ ඉමං භද්රං පුරිසාජානීයං වදාමි. එවරූපොපි භික්ඛවෙ ඉධෙකච්චො භද්රො පුරිසාජානීයො හොති. අයං භික්ඛවෙ දුතියො භද්රො පුරිසාජානීයො සන්තො සංවිජ්ජමානො ලොකස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ ඉධෙකච්චො භද්රො පුරිසාජානීයො නහෙව ඛො සුණාති අමුකස්මිං නාම ගාමෙ වා නිගමෙ වා ඉත්ථී වා පුරිසො වා දුක්ඛිතො වා කාලකතො වාති, නපි සාමං පස්සති ඉත්ථිං වා පුරිසං වා දුක්ඛිතං වා කාලකතං වා. අපි ච ඛ්වස්ස ඤාති වා සාලොහිතො වා දුක්ඛිතො වා හොති කාලකතො වා. සො තෙන සංවිජ්ජති සංවෙගං ආපජ්ජති. සංවිග්ගො යොනිසො පදහති. පහිතත්තො කායෙන චෙව පරමසච්චං සච්ඡිකරොති, පඤ්ඤාය ච අතිවිජ්ඣ පස්සති. සෙය්යථාපි සො භික්ඛවෙ භද්රො අස්සාජානීයො චම්මවෙධවිද්ධො සංවිජ්ජති සංවෙගං ආපජ්ජති, තථූපමාහං භික්ඛවෙ ඉමං භද්රං පුරිසාජානීයං වදාමි. එවරූපොපි භික්ඛවෙ ඉධෙකච්චො භද්රො පුරිසාජානීයො හොති. අයං භික්ඛවෙ තතියො භද්රො පුරිසාජානීයො සන්තො සංවිජ්ජමානො ලොකස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ ඉධෙකච්චො භද්රො පුරිසාජානීයො නහෙව ඛො සුණාති අමුකස්මිං නාම ගාමෙ වා නිගමෙ වා ඉත්ථී වා පුරිසො වා දුක්ඛිතො වා කාලකතො වාති. නපි සාමං පස්සති ඉත්ථිං වා පුරිසං වා දුක්ඛිතං වා කාලකතං වා. නපිස්ස ඤාති වා සාලොහිතො වා දුක්ඛිතො වා හොති කාලකතො වා. අපි ච ඛො සාමඤ්ඤෙව ඵුට්ඨො හොති සාරීරිකාහි වෙදනාහි දුක්ඛාහි තිබ්බාහි ඛරාහි කටුකාහි අසාතාහි අමනාපාහි පාණහරාහි. සො තෙන සංවිජ්ජති, සංවෙගං ආපජ්ජති. සංවිග්ගො යොනිසො පදහති. පහිතත්තො කායෙන චෙව පරමසච්චං සච්ඡිකරොති, පඤ්ඤාය ච අතිවිජ්ඣ පස්සති. සෙය්යථාපි සො භික්ඛවෙ භද්රො අස්සාජානීයො අට්ඨිවෙධවිද්ධො සංවිජ්ජති සංවෙගං ආපජ්ජති, තථූපමාහං භික්ඛවෙ ඉමං භද්රං පුරිසාජානීයං වදාමි. එවරූපොපි භික්ඛවෙ ඉධෙකච්චො භද්රො පුරිසාජානීයො හොති. අයං භික්ඛවෙ චතුත්ථො භද්රො පුරිසාජානීයො සන්තො සංවිජ්ජමානො ලොකස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො භද්රා පුරිසාජානීයා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මෙලොව ඇතැම් භද්‍ර පුරුෂාජානීයයෙක් අසෝ ගම්හි හෝ නියම්ගම්හි හෝ ස්ත්‍රියක හෝ පුරුෂයෙක් හෝ දුඃඛිත වේවයි, කලුරිය කෙළේ වේවයි අසා ද, හෙ එයින් සංවේග (මනාවීර්‍ය්‍ය) කෙරෙයි, සංවේගයට පැමිණෙයි. උපන් සංවේග ඇත්තේ, නිවන් කරා ගිය සිත් ඇත්තේ නුවණින් ප්‍රධන් වීර්‍ය්‍ය කෙරෙයි. නාමකයිනුත් නිවන් දක්නේ විදර්‍ශනා සහිත මාර්‍ග ප්‍රඥායෙන් ද විනිවිද දකියි. මහණෙනි, යම් පරිදි ඒ භද්‍ර ආශ්වාජානීය කැහිටිසෙය දැක සංවේග කෙරේ ද, වේගයට පැමිණේ ද, මහණෙනි, මේ භද්‍ර පුරුෂාජානීයයා එබඳුහ යි මම කියමි. මහණෙනි, මෙලොව මෙබඳු වූත් ඇතැම් භද්‍ර පුරුෂාජානීයයෙක් වෙයි. මහණෙනි, මේ පළමුවන භද්‍ර පුරුෂාජානීයයා ලොකයෙහි විද්‍යමාන වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තවද මහණෙනි, මෙලොව ඇතැම් භද්‍ර පුරුෂාජානීයයෙක් අසෝ ගමෙහි හෝ නියම්ගමෙහි හෝ ස්ත්‍රියක හෝ පුරුෂයෙක් හෝ දුඃඛිත වේවයි, කලුරිය කෙළේ වේවයි නො ම අසා ද, වැළිත් දුඃඛිත වූ හෝ කලුරිය කළා වූ හෝ ස්ත්‍රියක හෝ පුරුෂයකු හෝ තෙමේ දක්නේ ය. හේ එයින් සංවේග කෙරේ. සංවේගයට පැමිණේ. සංවේග ඇතියේ නිවන් කරා ගිය සිත් ඇත්තේ නුවණින් ප්‍රධන් වීර්‍ය්‍ය කෙරේ. නාමකයිනුත් නිර්‍වාණය පසක් කරන්නේ විදර්‍ශනා සහිත මාර්‍ග ප්‍රඥායෙන් ද විනිවිද දකී. මහණෙනි, යම් පරිදි ඒ භද්‍ර ආශ්වාජානීය ලෝමයෙහි විත් පහරින් විදුනා ලද්දේ වේග දනවා ද, වේගයට පැමිණේ ද, මහණෙනි, මම මේ භද්‍ර පුරුෂාජානීයයා එබඳුහ යි කියමි. මහණෙනි, මෙබඳු වූත් ඇතැම් භද්‍ර පුරුෂාජානීයයෙක් මෙලොව්හි වෙයි. මහණෙනි, මේ දෙවන භද්‍ර පුරුෂාජානීයයා ලෝකයෙහි විද්‍යමාන වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තවද මහණෙනි, මෙලොව ඇතැම් භද්‍ර පුරුෂාජානීයයෙක් අසෝ ගමෙහි හෝ නියම්ගමෙහි හෝ ස්ත්‍රියක හෝ පුරුෂයෙක් හෝ දුඃඛිත වේවයි, කලුරිය කෙළේ වේවයි නො ම අසා ද, දුඃඛිත වූ හෝ කලුරිය කළා වූ හෝ ස්ත්‍රියක හෝ පුරුෂයකු හෝ තෙමේත් නො දකී ද, වැළිත් ඔහුගේ නෑයෙක් හෝ සහලේ නෑයෙක් හෝ දුඃඛිත වූයේ හෝ කලුරිය කෙළේ හෝ වේ ද, හෙ එයින් සංවේග කෙරෙයි. සංවේගයට පැමිණෙයි. සංවේගයට පැමිණියේ නිවනට ගිය සිතැත්තේ නුවණින් ප්‍රධන් වීර්‍ය්‍ය කෙරෙයි. නාමකයිනුත් නිවන් ප්‍රත්‍යක්‍ෂ කරණුයේ විදර්‍ශනා සහිත මාර්‍ගප්‍රඥායෙන් විනිවිද දකී. මහණෙනි, යම් පරිදි ඒ භද්‍ර ආශ්වාජානීය තෙමේ ලොමෙහි විත් පහරින් විදුනා ලදුයේ සංවේග දනවා ද, වේගයට පැමිණේ ද, මහණෙනි, මම මේ භද්‍ර පුරුෂාජානීයයා එබඳුහ යි කියමි. මහණෙනි, මෙබඳු වූත් ඇතැම් භද්‍ර පුරුෂාජානීයයෙක් මෙලොව්හි වෙයි. මහණෙනි, මේ තුන්වන භද්‍ර පුරුෂාජානීයයා ලෝකයෙහි විද්‍යමාන වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තවද මහණෙනි, මෙලොව ඇතැම් පුරුෂාජානීයයෙක් අසෝ ගමෙහි හෝ නියම්ගමෙහි හෝ ස්ත්‍රියක හෝ පුරුෂයෙක් හෝ දුඃඛිත වේවයි, කලුරිය කෙළේ වේවයි නො ම අසා ද, දුඃඛිත වූ හෝ කලුරිය කළා වූ හෝ ස්ත්‍රියක හෝ පුරුෂයකු හෝ තෙමේත් නො දක්නේ ද, ඔහුගේ නෑයෙක් හෝ සහලේ නෑයෙක් දුඃඛිත වූයේ හෝ කලුරිය කෙළේ හෝ නො වේ ද, වැලිත් තෙමේ ම දුක් වූ තීව්‍ර වූ ඛර වූ කටුක වූ අමධුර වූ අමනොහර වූ ප්‍රාණහර වූ ශාරීරිකවේදනායෙන් පහස්නා ලද්දේ වෙයි. හේ එයින් සංවේග කෙරේ. සංවේගයට පැමිණේ. සංවේගයට පැමිණියේ නිවණට ගිය සිතැත්තේ නුවණින් ප්‍රධන් වීර්‍ය්‍යය කෙරේ. නාමකයිනුත් නිවන් ප්‍රත්‍යක්‍ෂ කරණුයේ විදර්‍ශනා සහිත ප්‍රඥායෙනුත් විනිවිද දකී. මහණෙනි, යම් පරිදි ඒ භද්‍ර ආශ්වාජානීය ඇට බිඳුනා විත් පහරින් විදුනා ලද්දේ සංවේග දනවා ද, වේගයට පැමිණේ ද, මහණෙනි, මම මේ භද්‍ර පුරුෂාජානීයයා එබඳු හ යි කියමි. මහණෙනි, මෙබඳු වූත් ඇතැම් භද්‍ර පුරුෂාජානීයයෙක් මෙලොව්හි වෙයි. මහණෙනි, මේ භද්‍ර වූ සතරවන පුරුෂාජානීයයා ලෝකයෙහි විද්‍යමාන වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර පුරුෂාජානීයයෝ ලෝකයෙහි විද්‍යමානයහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 226,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 3. 2. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(නාගසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "14. චතූහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො රඤ්ඤො නාගො රාජාරහො හොති රාජභොග්ගො. රඤ්ඤො අඞ්ගන්ත්වෙව සඞ්ඛං ගච්ඡති. කතමෙහි චතූහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ රඤ්ඤො නාගො සොතා ච හොති හන්තා ච ඛන්තා ච ගන්තා ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො සොතා හොති, ඉධ භික්ඛවෙ රඤ්ඤො නාගො යමෙනං හත්ථිදම්මසාරථි කාරණං කාරෙති යදි වා කතපුබ්බං යදි වා අකතපුබ්බං, තං අට්ඨිකත්වා{1} මනසි කත්වා සබ්බං චෙතසො{2} සමන්නාහරිත්වා ඔහිතසොතො සුණාති. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො සොතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො හන්තා හොති? ඉධ භික්ඛවෙ රඤ්ඤො නාගො සඞ්ගාමගතො හත්ථිම්පි හන්ති{3} හත්ථාරුහම්පි හන්ති{3} අස්සම්පි හන්ති අස්සාරුහම්පි හන්ති රථම්පි හන්ති රථිකම්පි හන්ති පත්තිකම්පි හන්ති. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො හන්තා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො ඛන්තා හොති? ඉධ භික්ඛවෙ රඤ්ඤො නාගො සඞ්ගාමගතො ඛමො හොති සත්තිප්පහාරානං උසුප්පහාරානං{5} අසිප්පහාරානං ඵරසුප්පහාරානං භෙරිපණවසඞ්ඛතිණවනින්නාදසද්දානං. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො ඛන්තා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො ගන්තා හොති? ඉධ භික්ඛවෙ රඤ්ඤො නාගො යමෙනං හත්ථිදම්මසාරථි දිසං පෙසෙති යදි වා ගතපුබ්බං යදි වා අගතපුබ්බං, තං ඛිප්පඤ්ඤෙව{6} ගන්තා හොති. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො ගන්තා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ චතූහි අඞ්ගෙහි සමන්නාගතො රඤ්ඤො නාගො රාජාරහො හොති රාජභොග්ගො. රඤ්ඤො අඞ්ගන්ත්වෙව සඞ්ඛං ගච්ඡති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ චතූහි ධම්මෙහි සමන්නාගතො භික්ඛු ආහුනෙය්යො හොති පාහුණෙය්යො, දක්ඛිණෙය්යො, අඤ්ජලිකරණීයො, අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමෙහි චතූහි? ඉධ භික්ඛවෙ භික්ඛු සොතා ච හොති හන්තා ච ඛන්තා ච ගන්තා ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු සොතා හොති? ඉධ භික්ඛවෙ භික්ඛු තථාගතප්පවෙදිතෙ ධම්මවිනයෙ දෙසියමානෙ අට්ඨිකත්වා මනසි කත්වා සබ්බං චෙතසො{2} සමන්නාහරිත්වා ඔහිතසොතො ධම්මං සුණාති. එවං ඛො භික්ඛවෙ භික්ඛු සොතා හොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අට්ඨිං කත්වා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සබ්බචෙතසා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ආහන්ති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. අසිප්පහාරානං උසුප්පහාරානං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "6. ඛිප්පමෙව - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.3.2.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නාග සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "14. මහණෙනි, සතර කරුණෙකින් සමන්‍වාගත රජුගේ ඇත් රාජාර්‍හ වේ. රජහු විසින් වළඳ කළයුතු වේ. රාජාවයවයෙක් ම ය යි ගණයට යෙයි. කවර සතර කරුණෙන යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙලොව අජුගේ ඇත් අසනුයේ ද වෙයි, නසනුයේ ද, ඉවසනුයේ ද, යනුයේ ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ රජුගේ ඇත් අසනුයේ වේ ද? මහණෙනි, මෙලොව රජුගේ ඇත් කළවිරූ වේවයි, නො කළවිරූ වේවයි, යම් කම්කටුලු හස්තිදම්‍යසාරථි තුලූන් ලවා කරවා ද, එය අර්ත්‍ථී ව මෙනෙහි කොට සියල්ල සිතට සමනා ගෙන රුකළ කන් ඇති ව අසා ද, මහණෙනි, මෙසේ රජුගේ ඇත් අසනුයේ නම් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ රජුගේ ඇත් නසනුයේ වේ ද? මහණෙනි, මෙලොව රජුගේ ඇත් සඞ්ග්‍රාමශීර්‍ෂයට ගියේ ඇතුදු නසයි. ඇතරුවා ද නසයි. අසුදු නසයි. අසරුවා ද නසයි. රිය ද නසයි. රිය නැගි යොධ ද නසයි. පාබළ ද නසයි. මහණෙනි, මෙසේ රජුගේ ඇත් නසනුයේ නම් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ රජුගේ ඇත් ඉවසනුයේ වේ ද? මහණෙනි, මෙලොව රජුගේ ඇත් සඞ්ග්‍රාමශීර්‍ෂයට ගියේ සිරිය පහර, හී පහර, කඩු පහර, පොරෝ පහර, බෙර පණාබෙර සක් දෙණ්ඩිම යන නින්නාද ශබ්ද ඉවසයි. මහණෙනි, මෙසේ රජුගේ ඇත් ඉවසනුයේ නම් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ රජුගේ ඇත් යනුයේ වේ ද? මහණෙනි, මෙලොව රජුගේ ඇත් ගිය විරූ දිග වේවයි නො ගිය විරූ දිග වේවයි, යම් දිගකට ඇත්දම්සැරි මෙහෙයා ද, එදිගට වහාම යනුයේ වෙයි. මහණෙනි, මෙසේ රජුගේ ඇත් යනුයේ නම් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කරුණින් සමන්වාගත වූ රජුගේ ඇත් රජුට නිසි වූයේ රජු විසින් වළඳ කටයුතු වූයේ වෙයි. රාජාවයවයෙක් ම ය යි ගණයට යෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම සතර කරුණෙකින් සමන්වාගත මහණ ආහුනෙය්‍ය වේ. පාහුණෙය්‍ය වේ. දක්ඛිණෙය්‍ය වේ. අඤ්ජලිකරණීය වේ. ලෝකයාට අනුත්තර පුණ්‍යක්‍ෂෙත්‍ර වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "කවර සතර කරුණෙන යත්: මහණෙනි, මෙසස්නෙහි මහණ අසනුයේ ද, නසනුයේ ද, ඉවසනුයේ ද, යනුයේ ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ මහණ අසනුයේ වේ ද? මහණෙනි, මෙසස්නෙහි මහණ තථාගතයන් විසින් වදාරණ ලද ධර්‍ම විනය දෙසනු ලබන කල්හි අර්ත්‍ථීව මෙනෙහි කොට සියල්ල සිතට සමනා ගෙණ රුකළ කන් ඇතිව ඒ දහම් අසයි. මහණෙනි, මෙසේ මහණ අසනුයේ නම් වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 228,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු හන්තා හොති? ඉධ භික්ඛවෙ භික්ඛු උප්පන්නං කාමවිතක්කං නාධිවාසෙති පජහති විනොදෙති{1} ව්යන්තීකරොති අනභාවං ගමෙති. උප්පන්නං ව්යාපාදවිතක්කං -පෙ- උප්පන්නං විහිංසාවිතක්කං -පෙ- උප්පන්නුප්පන්නෙ පාපකෙ අකුසලෙ ධම්මෙ නාධිවාසෙති පජහති විනොදෙති ව්යන්තීකරොති අනභාවං ගමෙති. එවං ඛො භික්ඛවෙ භික්ඛු හන්තා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු ඛන්තා හොති? ඉධ භික්ඛවෙ භික්ඛු ඛමො හොති සීතස්ස උණ්හස්ස ජිඝච්ඡාය පිපාසාය ඩංසමකසවාතාතපසිරිංසපසම්ඵස්සානං දුරුත්තානං දුරාගතානං වචනපථානං, උප්පන්නානං සාරීරිකානං වෙදනානං දුක්ඛානං තිබ්බානං ඛරානං කටුකානං අසාතානං අමනාපානං පාණහරානං අධිවාසිකජාතිකො හොති. එවං ඛො භික්ඛවෙ භික්ඛු ඛන්තා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු ගන්තා හොති? ඉධ භික්ඛවෙ භික්ඛු යා දිසා අගතපුබ්බා ඉමිනා දීඝෙන අද්ධුනා යදිදං සබ්බසඞ්ඛාරසමථො සබ්බූපධිපටිනිස්සග්ගො තණ්හක්ඛයො විරාගො නිරොධො නිබ්බානං, තං ඛිප්පඤ්ඤෙව ගන්තා හොති. එවං ඛො භික්ඛවෙ භික්ඛු ගන්තා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ චතූහි ධම්මෙහි සමන්නාගතො භික්ඛු ආහුනෙය්යො හොති -පෙ- අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්සාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 2. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ඨානසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "15. චත්තාරිමානි භික්ඛවෙ ඨානානි. කතමානි චත්තාරි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි භික්ඛවෙ ඨානං අමනාපං කාතුං, තඤ්ච කයිරමානං අනත්ථාය සංවත්තති. අත්ථි භික්ඛවෙ ඨානං අමනාපං කාතුං, තඤ්ච කයිරමානං අත්ථාය සංවත්තති. අත්ථි භික්ඛවෙ ඨානං මනාපං කාතුං, තඤ්ච කයිරමානං අනත්ථාය සංවත්තති. අත්ථි භික්ඛවෙ ඨානං මනාපං කාතුං, තඤ්ච කයිරමානං අත්ථාය සංවත්තති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ර භික්ඛවෙ යමිදං ඨානං අමනාපං කාතුං, තඤ්ච කයිරමානං අනත්ථාය සංවත්තති, ඉදං භික්ඛවෙ ඨානං උභයෙනෙව න කත්තබ්බං මඤ්ඤති. යම්පිදං ඨානං අමනාපං කාතුං, ඉමිනාපි තං න කත්තබ්බං මඤ්ඤති. යම්පිදං ඨානං කයිරමානං අනත්ථාය සංවත්තති, ඉමිනාපි තං න කත්තබ්බං මඤ්ඤති. ඉදං භික්ඛවෙ ඨානං උභයෙනෙව න කත්තබ්බං මඤ්ඤති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ර භික්ඛවෙ යමිදං ඨානං අමනාපං කාතුං, තඤ්ච කයිරමානං අත්ථාය සංවත්තති, ඉමස්මිං භික්ඛවෙ ඨානෙ බාලො ච පණ්ඩිතො ච වෙදිතබ්බො පුරිසත්ථාමෙ පුරිසවිරියෙ පුරිසපරක්කමෙ. න භික්ඛවෙ බාලො ඉති පටිසංචික්ඛති, ‘කිඤ්චාපි ඛො ඉදං ඨානං අමනාපං කාතුං, අථ චරහිදං ඨානං කයිරමානං අත්ථාය සංවත්තතී’ති. සො තං ඨානං න කරොති. තස්ස තං ඨානං අකයිරමානං අනත්ථාය සංවත්තති. පණ්ඩිතො ච ඛො භික්ඛවෙ ඉති පටිසංචික්ඛති: ‘කිඤ්චාපි ඛො ඉදං ඨානං අමනාපං කාතුං, අථ චරහිදං ඨානං කයිරමානං අත්ථාය සංවත්තතී’ති. සො තං ඨානං කරොති. තස්ස තං ඨානං කයිරමානං අත්ථාය සංවත්තතීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. විනොදෙති හන්ති - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කෙසේ මහණ නසනුයේ වේ ද? මහණෙනි, මෙසස්නෙහි මහණ උපන් කාමවිතර්‍කය සිත්හි නො වස්වයි. හැර පියයි. බැහැරි කෙරෙයි. විගතාන්ත කෙරෙයි. අභාවයට පමුණුවයි. උපන් ව්‍යාපාදවිතර්‍කය ... උපන් විහිංසාවිතර්‍කය ... උපනුපන් ලමු අකුසල දහම් සිත්හි නො වස්වයි. හැර පියයි. බැහැරි කෙරෙයි. විගතාන්ත කෙරෙයි. අභාවයට පමුණුවයි. මහණෙනි මෙසේ මහණ නසනුයේ නම් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ මහණ ඉවසනුයේ වේ ද? මහණෙනි, මෙසස්නෙහි මහණ ශීතය, උෂ්ණය, බඩසය, පවස, මැසිමදුරු, වා - අව්, දිග් දෑ යන මොවුන්ගේ පහස් ඉවසන්නේ වෙයි. නපුරු කොට කී නපුරු කොට පැමිණි වචනපථයන් ද දුක් ඇති තීව්‍ර වූ ඛර වූ කටුක වූ අමධුර වූ අමනාප වූ ප්‍රාණහර වූ උපන් ශාරීරික වෙදනා ඉවසන ප්‍රකෘති ඇත්තේ වෙයි. මහණෙනි, මෙසේ මහණ ඉවසනුයේ නම් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් මහණ යනුයේ නම් වේ ද? මහණෙනි, මෙසස්නෙහි මහණ සියලු උපධීන්ගෙන් වෙන් වූ තෘෂ්ණාක්‍ෂය වූ විරාග වූ නිරොධ වූ සර්‍වසංස්කාරශමථය යි කියන ලද යම් මේ නිවන් නමැති, මේ දීර්‍ඝ කාලයෙහි නො ගිය විරූ දිගෙක් ඇද්ද, එදිග වහා ම යනුයේ වෙයි. මහණෙනි, මෙසේ මහණ යනුයේ නම් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කරුණින් සමන්වාගත මහණ ආහුනෙය්‍ය වේ ... ලෝකයාගේ අනුත්තර පුණ්‍යක්‍ෂෙත්‍රය වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.2.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඨාන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "15. මහණෙනි, මේ කාරණයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කරුණෙක් ඇත. කරන්නට අමනාප ය. එ ද කරණු ලබන්නේ අනර්‍ත්‍ථයට වැටේ. මහණෙනි, කරුණෙක් ඇත. කරන්නට අමනාප ය. එ ද කරණු ලබන්නේ අර්‍ත්‍ථයට වැටේ. මහණෙනි, කරුණෙක් ඇත. කරන්නට මනාපය. එද කරණු ලබන්නේ අනර්‍ත්‍ථයට වැටේ. මහණෙනි, කරුණෙක් ඇත. කරන්නට මනාපය. එද කරණු ලබන්නේ අර්‍ත්‍ථයට වැටේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එහි කරන්නට අමනාප වූ යම් මේ කරුණෙක් ඇද්ද, එ ද කරණු ලබන්නේ අනර්‍ත්‍ථයට වැටේ ද, මහණෙනි, මේ කරුණ දෙපරිදි ම නො කටයුතු කොට හඟනේය. මේ කරුණෙක් කරන්නට අමනාප වේ ද, මෙයිනුත් එය නො කටයුතු කොට හඟනේ ය. යම් මේ කරුණෙක් කරණු ලබන්නේ අනර්‍ත්‍ථයට වැටේ ද, මෙයිනුත් නො කටයුතු කොට හඟනේය. මහණෙනි, මෙ කරුණ දෙරිදි ම නො කටයුතු කොට හඟනේය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එහි කරන්නට අමනාප යම් ඒ කරුණෙක් ඇද්ද, එ ද කරණු ලබන්නේ අර්‍ත්‍ථයට වැටේ ද, මහණෙනි, මෙ කරුණෙහි පුරුෂයාගේ ඥානශක්තියෙහි, පුරුෂයාගේ ඥානවීර්‍ය්‍යයෙහි, පුරුෂයාගේ ඥානපරාක්‍රමයෙහි ලා බාලයා ද පණ්ඩිතයා ද දත යුතු යි. මහණෙනි, බාල තෙමේ මෙසේ නො සලකයි: ‘මෙ කරුණ කරන්නට අමනාපය. වැලිත් මෙ කරුණ කරණු ලබන්නේ අර්‍ත්‍ථයට වැටේ’ ය යි. හෙතෙම එ කරුණ නො කෙරෙයි. ඔහුට නො කරණු ලබන එකරුණ අනර්‍ත්‍ථයට වැටෙයි. මහණෙනි, පණ්ඩිත තෙමේ මෙසේ සලකයි: ‘මෙකරුණ කරන්නට අමනාපය. වැලිත් මෙකරුණ කරණු ලබන්නේ අර්‍ත්‍ථයට වැටේය’ යි. හෙතෙම එ කරුණ කෙරෙයි. ඔහුට එකරුණ කරණු ලබන්නේ අර්‍ත්‍ථයට වැටෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 230,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තත්ර භික්ඛවෙ යමිදං ඨානං මනාපං කාතුං, තඤ්ච කයිරමානං අනත්ථාය සංවත්තති. ඉමස්මිම්පි භික්ඛවෙ ඨානෙ බාලො ච පණ්ඩිතො ච වෙදිතබ්බො පුරිසත්ථාමෙ පුරිසවිරියෙ පුරිසපරක්කමෙ. න භික්ඛවෙ බාලො ඉති පටිසංචික්ඛති : ‘කිඤ්චාපි ඛො ඉදං ඨානං මනාපං කාතුං, අථ චරහිදං ඨානං කයිරමානං අනත්ථාය සංවත්තතී’ති. සො තං ඨානං කරොති. තස්ස තං ඨානං කයිරමානං අනත්ථාය සංවත්තති. පණ්ඩිතො ච ඛො භික්ඛවෙ ඉති පටිසංචික්ඛති : ‘කිඤ්චාපි ඛො ඉදං ඨානං මනාපං කාතුං, අථ චරහිදං ඨානං කයිරමානං අනත්ථාය සංවත්තී’ති. සො තං ඨානං න කරොති. තස්ස තං ඨානං අකයිරමානං අත්ථාය සංවත්තති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ර භික්ඛවෙ යමිදං ඨානං මනාපං කාතුං, තඤ්ච කයිරමානං අත්ථාය සංවත්තති, ඉදං භික්ඛවෙ ඨානං උභයෙනෙව කත්තබ්බං මඤ්ඤති. යම්පිදං ඨානං මනාපං කාතුං, ඉමිනාපි නං කත්තබ්බං මඤ්ඤති. යම්පිදං ඨානං කයිරමානං අත්ථාය සංවත්තති, ඉමිනාපි තං කත්තබ්බං මඤ්ඤති. ඉදං භික්ඛවෙ ඨානං උභයෙනෙව කත්තබ්බං මඤ්ඤති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ චත්තාරි ඨානානීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 2. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අප්පමාදසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "16. චතූහි භික්ඛවෙ ඨානෙහි අප්පමාදො කරණීයො. කතමෙහි චතූහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "කායදුච්චරිතං භික්ඛවෙ පජහථ. කායසුචරිතං භාවෙථ. තත්ථ ච මා පමාදත්ථ. වචීදුච්චරිතං භික්ඛවෙ පජහථ. වචීසුචරිතං භාවෙථ. තත්ථ ච මා පමාදත්ථ. මනොදුච්චරිතං භික්ඛවෙ පජහථ. මනොසුචරිතං භාවෙථ. තත්ථ ච මා පමාදත්ථ. මිච්ඡාදිට්ඨිං භික්ඛවෙ පජහථ, සම්මාදිට්ඨිං භාවෙථ. තත්ථ ච මා පමාදත්ථ."
                    },
                    {
                        "type": "paragraph",
                        "text": "යතො ඛො භික්ඛවෙ භික්ඛුනො කායදුච්චරිතං පහීණං හොති, කායසුචරිතං භාවිතං. වචීදුච්චරිතං පහීණං හොති, වචීසුචරිතං භාවිතං. මනොදුච්චරිතං පහීණං හොති, මනොසුචරිතං භාවිතං. මිච්ඡාදිට්ඨි පහීණා හොති, සම්මාදිට්ඨි භාවිතා. සො න භායති සම්පරායිකස්ස මරණස්සාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, එහි කරන්නට මනාප වූ යම් කරුණෙක් වේ ද, එ ද කරණු ලබන්නේ අනර්‍ත්‍ථයට වැටේ ද, මහණෙනි, මෙ කරුණෙහි දී පුරුෂයාගේ ඥානශක්තියෙහි, පුරුෂයාගේ ඥානවීර්‍ය්‍යයෙහි, පුරුෂයාගේ ඥානපරාක්‍රමයෙහි ලා බාලයා ද පණ්ඩිතයා ද දත යුතුය. මහණෙනි, බාල මෙසේ නො සලකයි: ‘මෙ කරුණ කරන්නට මනාපය. වැලිත් මෙකරුණ කරණු ලබන්නේ අනර්‍ත්‍ථයට වැටේය’යි. හෙතෙම එකරුණ කෙරෙයි. ඔහුට එකරුණ කරණු ලබන්නේ අනර්‍ත්‍ථයට වැටේ. මහණෙනි, පණ්ඩිත තෙමේ මෙසේ සලකයි: ‘මෙ කරුණ කරන්නට මනාපය. වැලිත් මෙකරුණ කරණු ලබන්නේ අනර්‍ත්‍ථයට වැටේය’ යි. හෙතෙම එ කරුණ නො කෙරෙයි. ඔහුට එකරුණ නො කරණු ලබන්නේ අර්‍ත්‍ථයට වැටෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එහි කරන්නට මනාප යම් ඒ කරුණෙක් ඇද්ද, එ ද කරණු ලබන්නේ අර්‍ත්‍ථයට වැටේ ද, මහණෙනි, මෙ කරුණ දෙපරිදි ම කටයුතු කොට හඟී. යම් මේ කරුණෙක් කරන්නට කැමති වේ ද, මෙයිනුත් එය කළයුතු කොට හඟී. යම් මේ කරුණෙක් කරණු ලබන්නේ අර්‍ත්‍ථයට වැටේ ද, මෙයිනුත් එය කළයුතු කොට හඟී. මහණෙනි, මෙ කරුණ දෙපරිදි ම කළයුතු කොට හඟී.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර කරුණුයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.2.6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අප්පමාද සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "16. මහණෙනි, සතර කරුණෙකින් අප්‍රමාදය කළ යුතුය. කවර සතර කරුණෙන යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කායදුශ්චරිතය හැර පියව. කාය සුචරිතය වඩව. එහිදු නහමක් පමා වව. මහණෙනි, වාග්දුශ්චරිතය හැර පියව. වාක්සුචරිතය වඩව. එහිදු නහමක් පමා වව. මහණෙනි, මනොදුශ්චරිතය හැර පියව. මනඃසුචරිතය වඩව. එහිදු නහමක් පමා වව. මහණෙනි, මිසදිටු හැර පියව. සම්දිටු වඩව. එහිදු නහමක් පමා වව.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් කලක මහණහට කායදුශ්චරිතය ප්‍රහීණ වේ ද, කායසුචරිතය භාවිත වේ ද, වාග්දුශ්චරිතය ප්‍රහීණ වේ ද, වාක්සුචරිතය භාවිත වේ ද, මනෝදුශ්චරිතය ප්‍රහීණ වේ ද, මනස්සුචරිතය භාවිත වේ ද, මිසදිටු ප්‍රහීණ වේ ද, සම්දිටු භාවිත වේ ද, හෙතෙම සම්පරායික මරණයට බියපත් නො වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 232,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 3. 2. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ආරක්ඛසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "17. චතූසු භික්ඛවෙ ඨානෙසු අත්තරූපෙන අප්පමාදො සතිචෙතසො ආරක්ඛො කරණීයො. කතමෙසු චතූසු?"
                    },
                    {
                        "type": "paragraph",
                        "text": "මා මෙ රජනීයෙසු ධම්මෙසු චිත්තං රජ්ජීති අත්තරූපෙන අප්පමාදො සතිචෙතසො ආරක්ඛො කරණීයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "මා මෙ දොසනීයෙසු ධම්මෙසු චිත්තං දුස්සීති අත්තරූපෙන අප්පමාදො සතිචෙතසො ආරක්ඛො කරණීයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "මා මෙ මොහනීයෙසු ධම්මෙසු චිත්තං මුය්හීති අත්තරූපෙන අප්පමාදො සතිචෙතසො ආරක්ඛො කරණීයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "මා මෙ මදනීයෙසු ධම්මෙසු චිත්තං මජ්ජීති අත්තරූපෙන අප්පමාදො සතිචෙතසො ආරක්ඛො කරණීයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "යතො ඛො භික්ඛවෙ භික්ඛුනො රජනීයෙසු ධම්මෙසු චිත්තං න රජ්ජති වීතරාගත්තා, දොසනීයෙසු ධම්මෙසු චිත්තං න දුස්සති වීතදොසත්තා, මොහනීයෙසු ධම්මෙසු චිත්තං න මුය්හති වීතමොහත්තා, මදනීයෙසු ධම්මෙසු චිත්තං න මජ්ජති වීතමදත්තා, සො නච්ඡම්භති, න කම්පති, න වෙධති, න සන්තාසං ආපජ්ජති. න ච පන සමණවචනහෙතුපි ගච්ඡතීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 2. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සංවෙජනීයසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "18. චත්තාරිමානි භික්ඛවෙ සද්ධස්ස කුලපුත්තස්ස දස්සනීයානි සංවෙජනීයානි ඨානානි. කතමානි චත්තාරි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ තථාගතො ජාතොති භික්ඛවෙ සද්ධස්ස කුලපුත්තස්ස දස්සනීයං සංවෙජනීයං ඨානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ තථාගතො අනුත්තරං සම්මාසම්බොධිං අභිසම්බුද්ධොති භික්ඛවෙ සද්ධස්ස කුලපුත්තස්ස දස්සනීයං සංවෙජනීයං ඨානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ තථාගතො අනුත්තරං ධම්මචක්කං පවත්තෙසීති භික්ඛවෙ සද්ධස්ස කුලපුත්තස්ස දස්සනීයං සංවෙජනීයං ඨානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ තථාගතො අනුපාදිසෙසාය නිබ්බානධාතුයා පරිනිබ්බුතොති භික්ඛවෙ සද්ධස්ස කුලපුත්තස්ස දස්සනීයං සංවෙජනීයං ඨානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ චත්තාරි සද්ධස්ස කුලපුත්තස්ස දස්සනීයානි සංවෙජනීයානි ඨානානීති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.3.2.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආරක්ඛ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "17. මහණෙනි, සතර තැනෙක තමාට නිසි සැටියෙන් (හිත-කැමැත්තෙන්) අප්‍රමාදය-ස්මෘති සම්ප්‍රයුක්ත චිත්තයාගේ ආරක්‍ෂාව කළයුතුය. කවර සතර තැනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සිත් ඇලීමට කරුණු වූ දහම්හි මාගේ සිත නහමක් ඇලේව යි, තමහට නිසි සැටියෙන් අප්‍රමාදය - ස්මෘති සම්ප්‍රයුක්ත චිත්තයාගේ ආරක්‍ෂාව කළයුතුය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ද්වේෂයට කරුණු වූ දහම්හි මාගේ සිත නහමක් දූෂිත වේව යි, තමාට නිසි සැටියෙන් අප්‍රමාදය - ස්මෘති සම්ප්‍රයුක්ත චිත්තයාගේ ආරක්‍ෂාව කළයුතුය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මෝහනයට කරුණු වූ දහම් හි මාගේ සිත නහමක් මුළා වේව යි, තමාට නිසි සැටියෙන් අප්‍රමාදය - ස්මෘති සම්ප්‍රයුක්ත චිත්තයාගේ ආරක්‍ෂාව කළයුතු ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මදයට කරුණු වූ දහම් හි මාගේ සිත නහමක් මත් වේව යි, තමහට නිසි සැටියෙන් අප්‍රමාදය - ස්මෘති සම්ප්‍රයුක්ත චිත්තයාගේ ආරක්‍ෂාව කළයුතු ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් දිනෙක පටන් ගෙණ මහණහුගේ සිත වීතරාග බැවින් රජනයට කරුණු වූ දහම් හි නො ඇලේ ද, වීතදෝෂ බැවින් ද්වේෂයට කරුණු වූ දහම් හි සිත දූෂිත නොවේද, මෝහයට කරුණු වූ දහම් හි පැහු මෝහ ඇති බැවින් සිත නහමක් මුළා වේ ද, මදයට කරුණු වූ දහම් හි පැහු මද ඇති බැවින් සිත නහමක් මත් වේ ද, හෙතෙම තැති නො ගණී. නො සැලේ. නො වෙවුළයි. සන්ත්‍රාසයට නො යෙයි. පරවාදි ශ්‍රමණයන්ගේ වචන හේතුවෙන් ද මිසදිටුවට නොයේ මැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.2.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සංවෙජනීය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "18. මහණෙනි, සැදැහැති කුලපුතකු විසින් දැක්ක යුතු, සංවෙග කටයුතු, මේ ස්ථානයෝ සතරෙක. කවර සතරෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙහි තථාගතයන් වහන්සේ උපන්හ යි සැදැහැති කුලපුතකු විසින් දැක්කයුතු සංවේග කටයුතු ස්ථාන යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙහි තථාගතයන් වහන්සේ අනුත්තර සම්‍යක්සම්බෝධිය අවබෝධ කළහයි සැදැහැති කුලපුතකු විසින් දැක්කයුතු සංවේග කටයුතු ස්ථාන යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙහි තථාගතයන් වහන්සේ අනුත්තර ධර්‍මචක්‍රය පැවැත්වූහ යි සැදැහැති කුලපුතකු විසින් දැක්කයුතු සංවේග කටයුතු ස්ථාන යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙහි තථාගතයන් වහන්සේ අනුපාදිශේෂ පරිනිර්‍වාණධාතුවෙන් පිරිනිවියහ යි සැදැහැති කුලපුතකු විසින් දැක්කයුතු සංවේග කටයුතු ස්ථාන යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සැදැහැති කුලපුතකු විසිනු දැක්කයුතු සංවේග කටයුතු මේ සතර ස්ථානයෝ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 234,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 3. 2. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(භයසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "19. චත්තාරිමානි භික්ඛවෙ භයානි. කතමානි චත්තාරි? ජාතිභයං ජරාභයං ව්යාධිභයං මරණභයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ චත්තාරි භයානීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 2. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(දුතියභයසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "20. චත්තාරිමානි භික්ඛවෙ භයානි. කතමානි චත්තාරි? අග්ගිභයං උදකභයං රාජභයං චොරභයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ චත්තාරි භයානීති."
                    },
                    {
                        "type": "centered",
                        "text": "කෙසිවග්ගො දුතියො.{*}",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "3. භයවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 3. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(භයසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "(සාවත්ථිනිදානං)"
                    },
                    {
                        "type": "paragraph",
                        "text": "21. චත්තාරිමානි භික්ඛවෙ භයානි. කතමානි චත්තාරි? අත්තානුවාදභයං පරානුවාදභයං දණ්ඩභයං දුග්ගතිභයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ අත්තානුවාදභයං? ඉධ භික්ඛවෙ එකච්චො ඉති පටිසංචික්ඛති : ‘අහං චෙව ඛො පන කායෙන දුච්චරිතං චරෙය්යං. වාචාය දුච්චරිතං චරෙය්යං, මනසා දුච්චරිතං චරෙය්යං, කිඤ්ච තං මං{2} අත්තා සීලතො න උපවදෙය්යා’ති. සො අත්තානුවාදභයස්ස භීතො කායදුච්චරිතං පහාය කායසුචරිතං භාවෙති. වචීදුච්චරිතං පහාය වචීසුචරිතං භාවෙති. මනොදුච්චරිතං පහාය මනොසුචරිතං භාවෙති. සුද්ධං අත්තානං පරිහරති. ඉදං වුච්චති භික්ඛවෙ අත්තානුවාදභයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ පරානුවාදභයං? ඉධ භික්ඛවෙ එකච්චො ඉති පටිසංචික්ඛති : අහඤ්චෙව ඛො පන කායෙන දුච්චරිතං චරෙය්යං, වාචාය දුච්චරිතං චරෙය්යං, මනසා දුච්චරිතං චරෙය්යං, කිඤ්ච තං මං{2} පරෙ සීලතො න උපවදෙය්යුන්ති. සො පරානුවාදභයස්ස භීතො කායදුච්චරිතං පහාය කායසුචරිතං භාවෙති. වචීදුච්චරිතං පහාය වචීසුචරිතං භාවෙති. මනොදුච්චරිතං පහාය මනොසුචරිතං භාවෙති. සුද්ධං අත්තානං පරිහරති. ඉදං වුච්චති භික්ඛවෙ පරානුවාදභයං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "*. තස්සුද්දානං : කෙසී ජවො පතාදො ච නාගො ඨානෙන පඤ්චමී අප්පමාදො ච ආරක්ඛො සංවෙජනීයඤ්ච ද්වෙ භයානීති. - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. යං මං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.3.2.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "19. මහණෙනි, මේ සතර භීතිහු වෙති. කවර සතරහ යත්: ජාති භය ය. ජරා භය ය. ව්‍යාධි භය ය. මරණ භය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතරභීතීහු යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.2.10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතිය භය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "20. මහණෙනි, මේ සතර භීතීහු වෙති. කවර සතරහ යත්: අග්නිභය ය. උදකභය ය. රාජභය ය. චොරභය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි මේ සතර භීතීහු යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "කෙසීවර්‍ගය දෙවැනි යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "3. භය වර්ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4.3.3.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "(සැවැත් නිදානයි)",
                        "type": "unindented"
                    },
                    {
                        "text": "21. මහණෙනි, මේ සතර භීතීහු වෙති. කවර සතරහ යත්: ආත්මානුවාදභය ය. පරානුවාදභය ය. දණ්ඩභය ය. දුර්‍ගතිභය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ආත්මානුවාදභය නම් කවරේය යත්: මහණෙනි, මෙලොව ඇතැම් එකෙක් මෙසේ සලකයි. ‘මම ද කයින් දුශ්චරිත කෙරෙම් නම්, වචනයෙන් දුශ්චරිත කෙරෙම් නම්, සිතින් දුශ්චරිත කෙරෙම් නම්, කිම, තෙමේ ඒ මට සීලයෙන් උපවාද නො කරන්නේ වේ ද?, හේ ආත්මානුවාදභයට බියපත් වූයේ කායදුශ්චරිතය හැරපියා කායසුචරිතය වඩයි. වාග්දුශ්චරිතය හැරපියා වාක්සුචරිතය වඩයි. මනෝදුශ්චරිතය හැරපියා මනඃසුචරිතය වඩයි. ශුද්ධ වූ ආත්මයක් පරිහරණය කෙරේ. මහණෙනි, මේ ආත්මානුවාදභය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පරානුවාදභය නම් කවරේය යත්: මහණෙනි, මෙලොව ඇතැමෙක් මෙසේ සලකයි: ‘මම වැලිත් කයින් දුශ්චරිත කෙරෙම් නම්, වචනයෙන් දුශ්චරිත කෙරෙම් නම්, සිතින් දුශ්චරිත කෙරෙම් නම්, කිම, පරහු ඒ මට ශීලයෙන් උපවාද නො කරන්නාහු වෙත් ද?, හේ පරානුවාදභයට බියපත් වූයේ කායදුශ්චරිතය හැරපියා කායසුචරිතය වඩයි. වාග්දුශ්චරිතය හැරපියා වාක්සුචරිතය වඩයි. මනෝදුශ්චරිතය හැරපියා මනඃසුචරිතය වඩයි. ශුද්ධ වූ ආත්මයක් පරිහරණය කෙරේ. මහණෙනි, මේ පරානුවාදභය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 236,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ දණ්ඩභයං? ඉධ භික්ඛවෙ එකච්චො පස්සති චොරං ආගුචාරිං රාජානො ගහෙත්වා විවිධා කම්මකාරණා{1} කාරෙන්තෙ - කසාහිපි තාළෙන්තෙ, වෙත්තෙහිපි තාළෙන්තෙ, අද්ධදණ්ඩකෙහිපි තාළෙන්තෙ, හත්ථම්පි ඡින්දන්තෙ, පාදම්පි ඡින්දන්තෙ, හත්ථපාදම්පි ඡින්දන්තෙ, කණ්ණම්පි ඡින්දන්තෙ, නාසම්පි ඡින්දන්තෙ, කණ්ණනාසම්පි ඡින්දන්තෙ, බිලඞ්ගථාලිකම්පි කරොන්තෙ, සඞ්ඛමුණ්ඩිකම්පි කරොන්තෙ, රාහුමුඛම්පි කරොන්තෙ, ජොතිමාලිකම්පි කරොන්තෙ, හත්ථපජ්ජොතිකම්පි කරොන්තෙ, එරකවත්තිකම්පි කරොන්තෙ, චීරකවාසිකම්පි කරොන්තෙ, එණෙය්යනකම්පි කරොන්තෙ, බලිසමංසිකම්පි කරොන්තෙ, කහාපණකම්පි කරොන්තෙ, ඛාරාපතච්ඡිකම්පි කරොන්තෙ, පලිඝපරිවත්තිකම්පි කරොන්තෙ, පලාලපීඨකම්පි කරොන්තෙ, තත්තෙනපි තෙලෙන ඔසිඤ්චන්තෙ, සුනඛෙහිපි ඛාදාපෙන්තෙ, ජීවන්තම්පි සූලෙ උත්තාසෙන්තෙ, අසිනාපි සීසං ඡින්දන්තෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්ස එවං හොති : “යථාරූපානං ඛො පාපකානං කම්මානං හෙතු චොරං ආගුචාරිං රාජානො ගහෙත්වා විවිධා කම්මකාරණා කාරෙන්ති: කසාහිපි තාළෙන්ති -පෙ- අසිනාපි සීසං ඡින්දන්ති. අහං චෙව ඛො පන එවරූපං පාපකං කම්මං කරෙය්යං, මම්පි රාජානො ගහෙත්වා එවරූපා විවිධා කම්මකාරණා කාරෙය්යුං: කසාහිපි තාළෙය්යුං, වෙත්තෙහිපි තාළෙය්යුං, අද්ධදණ්ඩකෙහිපි තාළෙය්යුං, හත්ථම්පි ඡින්දෙය්යුං, පාදම්පි ඡින්දෙය්යුං, හත්ථපාදම්පි ඡින්දෙය්යුං, කණ්ණම්පි ඡින්දෙය්යුං, නාසම්පි ඡින්දෙය්යුං, කණ්ණනාසම්පි ඡින්දෙය්යුං, බිලඞ්ගථාලිකම්පි කරෙය්යුං, සඞ්ඛමුණ්ඩිකම්පි කරෙය්යුං, රාහුමුඛම්පි කරෙය්යුං, ජොතිමාලිකම්පි කරෙය්යුං, හත්ථපජ්ජොතිකම්පි කරෙය්යුං, එරකවත්තිකම්පි කරෙය්යුං, චීරකවාසිකම්පි කරෙය්යුං, එණෙය්යකම්පි කරෙය්යුං, බලිසමංසිකම්පි කරෙය්යුං, කහාපණකම්පි කරෙය්යුං, ඛාරාපතච්ඡිකම්පි කරෙය්යුං, පලිඝපරිවත්තිකම්පි කරෙය්යුං, පලාලපීඨකම්පි කරෙය්යුං, තත්තෙනපි තෙලෙන ඔසිඤ්චෙය්යුං, සුනඛෙහිපි ඛාදාපෙය්යුං, ජීවන්තම්පි සූලෙ උත්තාසෙය්යුං, අසිනාපි සීසං ඡින්දෙය්යු”න්ති. සො දණ්ඩභයස්ස භීතො න පරෙසං පාභතං පලුම්පන්තො විචරති. ඉදං වුච්චති භික්ඛවෙ දණ්ඩභයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ දුග්ගතිභයං? ඉධ භික්ඛවෙ එකච්චො ඉති පටිසංචික්ඛති : කායදුච්චරිතස්ස ඛො පාපකො විපාකො අභිසම්පරායං. වචීදුච්චරිතස්ස පාපකො විපාකො අභිසම්පරායං. මනොදුච්චරිතස්ස පාපකො විපාකො අභිසම්පරායං. අහං චෙව ඛො පන කායෙන දුච්චරිතං චරෙය්යං, වාචාය දුච්චරිතං චරෙය්යං, මනසා දුච්චරිතං චරෙය්යං, කිඤ්ච තං සාහං න කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජෙය්යන්ති. සො දුග්ගතිභයස්ස භීතො කායදුච්චරිතං පහාය කායසුචරිතං භාවෙති. වචීදුච්චරිතං පහාය වචීසුචරිතං භාවෙති. මනොදුච්චරිතං පහාය මනොසුචරිතං භාවෙති. සුද්ධං අත්තානං පරිහරති. ඉදං වුච්චති භික්ඛවෙ දුග්ගතිභයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ චත්තාරි භයානීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කම්මකරණා - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, දණ්ඩභය නම් කවරේය යත්: මහණෙනි, මෙලොව ඇතැමෙක් අපරාධකාරී සොරකු දකී. රජදරුවෝ තෙල සොරු ගෙණ විවිධ වූ කම්කටොලු කරත් - කස වැලිනුදු තළත් ද, වේවැලිනුදු තළත් ද, අඩදඬුයෙනු දු තළත්ද, අතු දු සිඳිත් ද, පාත් සිඳිත් ද, අත්පාත් සිඳිත් ද, කනුදු සිඳිත් ද, නාසාත් සිඳිත් ද, කන් නාසාත් සිඳිත් ද, බිලඞ්ගථාලික නම් වධයත් කෙරෙත් ද, සඞ්ඛමුණ්ඩික නම් වධයත් කෙරෙත් ද, රාහුමුඛ නම් වධයත් කෙරෙත් ද, ජොතිමාලික නම් වධයත් කෙරෙත් ද, හත්‍ථපජ්ජොතික නම් වධයත් කෙරෙත් ද, එරකවත්තික නම් වධයත් කෙරෙත් ද, චීරකවාසික නම් වධයත් කෙරෙත් ද, එණෙය්‍යක නම් වධයත් කෙරෙත් ද, බලිසමංසික නම් වධයත් කෙරෙත් ද, කහාපණක නම් වධයත් කෙරෙත් ද, ඛාරාපතච්ඡික නම් වධයත් කෙරෙත් ද, පලිඝපරිවත්තික නම් වධයත් කෙරෙත් ද, පලාලපීඨක නම් වධයත් කෙරෙත් ද, කකියන තෙලිනුත් ඉසිත් ද, සුනඛයන් ලවාත් කවත් ද, දිවස් හුල හිඳුවත් ද, කඩුවෙනුදු හිස සිඳිත් ද, (මෙබඳු දඬුවම් ලබන සොරුයි.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඔහුට මෙබඳු සිතෙක් වෙයි: “යම්බඳු පාපකර්‍ම හේතුයෙන් අපරාධකාරී සොරකු ගෙන රජදරුවෝ විවිධ කම්කටොලු කරත් ද, කස වැලිනුදු තළත් ද ... කඩුවෙනුත් හිස සිඳිත් ද, මම ද මෙබඳු පාපකර්‍ම කෙරෙම් නම් රජ දරුවෝ මයිත් ගෙණ මෙබඳු විවිධ කම්කටොලු කරන්නාහු ය. කසවැලිනුදු ගළන්නාහු ය. වේවැලිනුදු තළන්නාහු ය. අඩදඬුයෙනු දු තළන්නාහු ය. අතු දු සිඳින්නාහු ය. පාත් සිඳින්නාහු ය. අත්පාත් සිඳින්නාහු ය. කනුදු සිඳින්නාහු ය. නාසාත් සිඳින්නාහු ය. කන් නාසාත් සිඳින්නාහු ය. බිලඞ්ගථාලික නම් වධයත් කරන්නාහු ය. සඞ්ඛමුණ්ඩික නම් වධයත් කරන්නාහු ය. රාහුමුඛ නම් වධයත් කරන්නාහු ය. ජොතිමාලික නම් වධයත් කරන්නාහු ය. හත්‍ථපජ්ජොතික නම් වධයත් කරන්නාහු ය. එරකවත්තික නම් වධයත් කරන්නාහු ය. චීරකවාසික නම් වධයත් කරන්නාහු ය. එණෙය්‍යක නම් වධයත් කරන්නාහු ය. බලිසමංසික නම් වධයත් කරන්නාහු ය. කහාපණක නම් වධයත් කරන්නාහු ය. ඛාරාපතච්ඡික නම් වධයත් කරන්නාහු ය. පළිඝපරිවත්තික නම් වධයත් කරන්නාහු ය. පලාලපීඨක නම් වධයත් කරන්නාහු ය. කකියන තෙලිනුත් ඉස්නාහු ය. සුනඛයන් ලවාත් කවන්නාහු ය. දිවස් හුල නගන්නාහු ය. කඩුවෙනුදු හිස සිඳිනුනාහු ය”’ යි. හේ දණ්ඩභයට බිය වූයේ මෙරමා අයත් වස්තුව පැහැර ගණිමින් නො හැසිරෙයි. මහණෙනි, මේ දණ්ඩභය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, දුර්‍ගතිභය නම් කවරේය යත්: මහණෙනි, මෙලොව ඇතැමෙක් මේ සේ සලකයි: කායදුශ්චරිතයාගේ පරලොව ලමු විපාකයෙක. වචීදුශ්චරිතයාගේ පරලොව ලමු විපාකයෙක. මනෝදුශ්චරිතයාගේ පරලොව ලමු විපාකයෙක. මම ද වැලිත් කයින් දුශ්චරිත කෙරෙම් නම්, වචනයෙන් දුශ්චරිත කෙරෙම් නම්, සිතින් දුශ්චරිත කෙරෙම් නම්, කිම, ඒ හේතුවෙන් යම් බඳු මම කාබුන් මරණින් මතුයෙහි සැපයෙන් පහව සිටි, නපුරු ගති ඇති, විවශ ව පතිත වන නිරයෙහි නූපදින්නෙම් වේ දැ යි හෙතෙම දුර්‍ගතිභයට බිය වූයේ කායදුශ්චරිතය හැර පියා කායසුචරිතය වඩයි. වචීදුශ්චරිතය හැර පියා වාක්සුචරිතය වඩයි. මනෝදුශ්චරිතය හැර පියා මනස්සුචරිතය වඩයි. ශුද්ධාත්මභාවයක් පරිහරණය කෙරෙයි. මහණෙනි, මේ දුර්‍ගතිභය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර භීතීහු යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 238,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 3. 3. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(උදකොරොහභයසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "22. චත්තාරිමානි භික්ඛවෙ භයානි උදකොරොහන්තස්ස පාටිකඞ්ඛිතබ්බානි. කතමානි චත්තාරි? ඌමිභයං, කුම්භීලභයං, ආවට්ටභයං, සුසුකාභයං. ඉමානි ඛො භික්ඛවෙ චත්තාරි භයානි උදකොරොහන්තස්ස පාටිකඞ්ඛිතබ්බානි."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ ඉධෙකච්චස්ස කුලපුත්තස්ස ඉමස්මිං ධම්මවිනයෙ සද්ධා අගාරස්මා අනගාරියං පබ්බජිතො චත්තාරිමානි භයානි පාටිකඞ්ඛිතබ්බානි. කතමානි චත්තාරි? ඌමිභයං, කුම්භීලභයං, ආවට්ටභයං, සුසුකාභයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ ඌමිභයං? ඉධ භික්ඛවෙ එකච්චො කුලපුත්තො සද්ධා අගාරස්මා අනගාරියං පබ්බජිතො හොති “ඔතිණ්ණොම්හි ජාතියා ජරා, මරණෙන, සොකෙහි පරිදෙවෙහි දුක්ඛෙහි දොමනස්සෙහි උපායාසෙහි, දුක්ඛොතිණ්ණො දුක්ඛපරෙතො, අප්පෙවනාම ඉමස්ස කෙවලස්ස දුක්ඛක්ඛන්ධස්ස අන්තකිරියා පඤ්ඤායෙථා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තමෙනං තථා පබ්බජිතං සමානං සබ්රහ්මචාරී ඔවදන්ති අනුසාසන්ති : “එවං තෙ අභික්කමිතබ්බං. එවං තෙ පටික්කමිතබ්බං. එවං තෙ ආලොකෙතබ්බං. එවං තෙ විලොකෙතබ්බං. එවං තෙ සමිඤ්ජිතබ්බං. එවං තෙ පසාරිතබ්බං. එවං තෙ සඞ්ඝාටිපත්තචීවරං ධාරෙතබ්බන්ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්ස එවං හොති : “මයං ඛො පුබ්බෙ අගාරියභූතා සමානා අඤ්ඤෙ ඔවදාමපි අනුසාසාමපි. ඉමෙ පනම්හාකං පුත්තමත්තා මඤ්ඤෙ, නත්තමත්තා මඤ්ඤෙ, ඔවදිතබ්බං අනුසාසිතබ්බං මඤ්ඤන්තී”ති. සො කුපිතො අනත්තමනො සික්ඛං පච්චක්ඛාය හීනායාවත්තති. අයං වුච්චති භික්ඛවෙ භික්ඛු ඌමිභයස්ස භීතො සික්ඛං පච්චක්ඛාය හීනායාවත්තො. ඌමිභයන්ති ඛො භික්ඛවෙ කොධුපායාසස්සෙතං අධිවචනං. ඉදං වුච්චති භික්ඛවෙ ඌමිභයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ කුම්භීලභයං: ඉධ භික්ඛවෙ එකච්චො කුලපුත්තො සද්ධා අගාරස්මා අනගාරියං පබ්බජිතො හොති “ඔතිණ්ණොම්හි ජාතියා ජරා{1}මරණෙන, සොකෙහි පරිදෙවෙහි දුක්ඛෙහි දොමනස්සෙහි උපායාසෙහි, දුක්ඛොතිණ්ණො දුක්ඛපරෙතො, අප්පෙවනාම ඉමස්ස කෙවලස්ස දුක්ඛක්ඛන්ධස්ස අන්තකිරියා පඤ්ඤායෙථා”ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ජරාය - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.3.3.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උදකොරොගභය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "22. මහණෙනි, දියට බස්නහුට මේ භීතීහු සතර දෙනෙක් කැමැති විය යුත්තාහ. කවර සතර දෙනෙක යත්: රළ බිය, කිඹුල් බිය, සුළි බිය, සැඩමස් බිය යි. මහණෙනි, දියට බස්නහුව මේ සතර භීතීහු කැමැති විය යුත්තාහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම සැදැහැයෙන් ගිහිගෙන් නික්ම මේ ශාසනයෙහි පැවිදි වන ඇතැම් කුලපුත්‍රයකුට මේ සතර භීතීහු කැමැති විය යුත්තාහ. කවර සතර භීතීහු ය යත්: ඌමිභය, කුම්භීලභය, ආවට්ටභය, සුසුකාභය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඌමිභය නම් කවරේය යත්: මහණෙනි, “ජාතිවිසිනුදු ජරාමරණවිසිනුදු ශෝකපරිදෙවදුඃඛදෞර්‍මනස්‍ය උපායාසවිසිනිදු අවතීර්‍ණයෙමි. දුකට බටුයෙමි. දුක් විසින් මැඩුනෙම් වෙමි. මේ කේවලදුඃඛස්කන්‍ධයාගේ අවසන් කිරීම පැණේ නම් මනා නම් නු” යි. මෙ ලොව ඇතැම් කුලපුත්‍රයෙක් සැදැහැයෙන් ගිහිගෙන් නික්ම පැවිද්දට පැමිණියේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එසේ පැවිදි වූ තෙල මුහුට සබ්‍රම්සරු අවවාද කෙරෙත්, අනුශාසනා කෙරෙත්: “තොප විසින් මෙසේ පෙරට යා යුතුය. තොප විසින් මෙසේ වටාලා ආ යුතුය. තොප විසින් මෙසේ ඉදිරි බැලිය යුතුය. තොප විසින් මෙසේ හාත්පස බැලිය යුතුය. තොප විසින් මෙසේ අත් පා වක්කළ යුතුය. තොප විසින් මෙසේ අත් පා දිගු කළ යුතුය. තොප විසින් මෙසේ සඟළ පාසිවුරු දැරිය යුතුය” කියා යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඔහුට මෙබඳු සිතෙක් වෙයි: “පෙර අපි ගිහි වූවමෝ සෙස්සනට අවවාදත් කරමෝ වම්හ, අනුශාසනාත් කරමෝ වම්හ. මොහු වනාහි අපගේ පුත්‍රමාත්‍රයන් බන්දහ, මුණුපුරන් බන්දහ. (එහෙත් අප ) අවවාද කළ යුතු කොට අනුශාසනා කළ යුතු කොට හඟිති” යි. හේ කිපියේ නොසතුටු සිත් ඇතියේ ශික්‍ෂාප්‍රත්‍යාඛ්‍යාන කොට ගිහිගෙට පෙරළා වැටෙයි. මහණෙනි, මේ මහණ ඌමිභයෙන් බිය වූයේ ශික්‍ෂාව හැර ගිහිගෙට පෙරළා වැටුනේ ය යි කියනු ලැබේ. මහණෙනි, ඌමිභය යනු ක්‍රෝධ-උපායාසයට තෙල නමෙකි. මහණෙනි, මේ ඌමිභය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කුම්භීලභය නම් කවරේ ය යත්: මහණෙනි, මෙ ලොව ඇතැම් කුලපුත්‍රයෙක් “ජාතිවිසින් ජරාමරණවිසින් ශොකපරිදෙව දුඃඛදෞර්‍මනස්‍යවිසින් අවතීර්‍ණයෙමි. දුකට බටුයෙමි. දුක්විසින් මැඩුනෙම් වෙමි. මේ කෙවලදුඃඛස්කන්‍ධයාගේ අවසන් කිරීම පැණේ නම් මනා නම් නු” යි සැදැහැයෙන් ගිහිගෙන් නික්ම පැවිද්දට පැමිණියේ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 240,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තමෙනං තථා පබ්බජිතං සමානං සබ්රහ්මචාරී ඔවදන්ති අනුසාසන්ති : “ඉදං තෙ ඛාදිතබ්බං, ඉදං තෙ න ඛාදිතබ්බං, ඉදං තෙ භුඤ්ජිතබ්බං, ඉදං තෙ න භුඤ්ජිතබ්බං, ඉදං තෙ සායිතබ්බං, ඉදං තෙ න සායිතබ්බං, ඉදං තෙ පාතබ්බං, ඉදං තෙ න පාතබ්බං. කප්පියං තෙ ඛාදිතබ්බං, අකප්පියං තෙ න ඛාදිතබ්බං, කප්පියං තෙ භුඤ්ජිතබ්බං, අකප්පියං තෙ න භුඤ්ජිතබ්බං, කප්පියං තෙ සායිතබ්බං, අකප්පියං තෙ න සායිතබ්බං, කප්පියං තෙ පාතබ්බං, අකප්පියං තෙ න පාතබ්බං, කාලෙ තෙ පාතබ්බං, විකාලෙ තෙ පාතබ්බං, කාලෙ තෙ ඛාදිතබ්බං, විකාලෙ තෙ න ඛාදිතබ්බං, කාලෙ තෙ භුඤ්ජිතබ්බං, විකාලෙ තෙ න භුඤ්ජිතබ්බං, කාලෙ තෙ සායිතබ්බං, විකාලෙ තෙ න සායිතබ්බන්ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්ස එවං හොති : “මයං ඛො පුබ්බෙ අගාරියභූතා සමානා යං ඉච්ඡාම තං ඛාදාම, යං න ඉච්ඡාම තං න ඛාදාම, යං ඉච්ඡාම තං භුඤ්ජාම, යං න ඉච්ඡාම තං න භුඤ්ජාම, යං ඉච්ඡාම තං සායාම. යං න ඉච්ඡාම න තං සායාම, යං ඉච්ඡාම තං පිබාම, යං න ඉච්ඡාම තං න පිබාම, කප්පියම්පි ඛාදාම, අකප්පියම්පි ඛාදාම, කප්පියම්පි භුඤ්ජාම, අකප්පියම්පි භුඤ්ජාම, කප්පියම්පි සායාම, අකප්පියම්පි සායාම, කප්පියම්පි පිබාම, අකප්පියම්පි පිබාම, කාලෙපි ඛාදාම, විකාලෙපි ඛාදාම, කාලෙපි භුඤ්ජාම, විකාලෙපි භුඤ්ජාම, කාලෙපි සායාම, විකාලෙපි සායාම, කාලෙපි පිබාම, විකාලෙපි පිබාම. යම්පි නො සද්ධා ගහපතිකා දිවා විකාලෙ පණීතං ඛාදනීයං වා භොජනීයං වා දෙන්ති, තත්රාපිමෙ මුඛාවරණං මඤ්ඤෙ කරොන්තී”ති. සො කුපිතො අනත්තමනො සික්ඛං පච්චක්ඛාය හීනායාවත්තති. අයං වුච්චති භික්ඛවෙ භික්ඛු කුම්භීලභයස්ස භීතො සික්ඛං පච්චක්ඛාය හීනායාවත්තො. කුම්භීලභයන්ති ඛො භික්ඛවෙ ඔදරිකත්තස්සෙතං අධිවචනං. ඉදං වුච්චති භික්ඛවෙ කුම්භීලභයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ ආවට්ටභයං? ඉධ භික්ඛවෙ එකච්චො කුලපුත්තො සද්ධා අගාරස්මා අනගාරියං පබ්බජිතො හොති “ඔතිණ්ණොම්හි ජාතියා ජරාමරණෙන, සොකෙහි පරිදෙවෙහි දුක්ඛෙහි දොමනස්සෙහි උපායාසෙහි, දුක්ඛොතිණ්ණො දුක්ඛපරෙතො. අප්පෙවනාම ඉමස්ස කෙවලස්ස දුක්ඛක්ඛන්ධස්ස අන්තකිරියා පඤ්ඤායෙථා”ති. සො එවං පබ්බජිතො සමානො පුබ්බන්හසමයං නිවාසෙත්වා පත්තචීවරං ආදාය ගාමං වා නිගමං වා පිණ්ඩාය පවිසති අරක්ඛිතෙනෙව කායෙන අරක්ඛිතාය වාචාය අරක්ඛිතෙන චිත්තෙන අනුපට්ඨිතාය සතියා අසංවුතෙහි ඉන්ද්රියෙහි. සො තත්ථ පස්සති ගහපතිං වා ගහපතිපුත්තං වා පඤ්චහි කාමගුණෙහි සමප්පිතං සමඞ්ගීභූතං පරිචාරයමානං. තස්ස එවං හොති : “මයං ඛො පුබ්බෙ අගාරියභූතා සමානා පඤ්චහි කාම ගුණෙහි සමප්පිතා සමඞ්ගීභූතා පරිචාරිම්හ. සංවිජ්ජන්තෙ ඛො පන මෙ කුලෙ භොගා. සක්කා භොගෙ ච භුඤ්ජිතුං පුඤ්ඤානි ච කාතුං. යන්නූනාහං සික්ඛං පච්චක්ඛාය හීනායාවත්තිත්වා භොගෙ ච භුඤ්ජෙය්යං පුඤ්ඤානි ච කරෙය්යන්ති.” සො සික්ඛං පච්චක්ඛාය හීනායාවත්තති. අයං වුච්චති භික්ඛවෙ භික්ඛු ආවට්ටභයස්ස භීතො සික්ඛං පච්චක්ඛාය හීනායාවත්තො. ආවට්ටභයන්ති ඛො භික්ඛවෙ පඤ්චන්නෙතං කාමගුණානං අධිවචනං. ඉදං වුච්චති භික්ඛවෙ ආවට්ටභයං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "එසේ පැවිදි වූ තෙල මුහුට සබ්‍රම්සරු අවවාද කරත්, අනුශාසනා කරත්. “මේ තොප විසින් කෑ යුතුය, මේ තොප විසින් නො කෑ යුතුය, මේ තොප විසින් බිදිය යුතුය, මේ තොප විසින් නො බිදිය යුතුය, මේ තොප විසින් ආස්වාද කළ යුතුය, මේ තොප විසින් ආස්වාද නො කළ යුතුය, මේ තොප විසින් පිය යුතුය, මේ තොප විසින් නො පිය යුතුය, තොප විසින් කැප දෑ කෑ යුතුය. තොප විසින් නො කැප දෑ නො කෑ යුතුය. තොප විසින් කැප දෑ බිදිය යුතුය, තොප විසින් නො කැප දෑ නො බිදිය යුතුය, තොප විසින් කැප දෑ ආස්වාද කට යුතුය, තොප විසින් නො කැප දෑ ආස්වාද නො කට යුතුය, තොප විසින් කැප දෑ පිය යුතුය, තොප විසින් නො කැප දෑ නො පිය යුතුය, තොප විසින් නිසි කාලයෙහි පිය යුතුය, තොප විසින් විකාලයෙහි නො පිය යුතුය, තොප විසින් කාලයෙහි කෑ යුතුය, තොප විසින් විකාලයෙහි නො කෑ යුතුය, තොප විසින් කාලයෙහි බිදිය යුතුය, තොප විසින් විකාලයෙහි නො බිදිය යුතුය, තොප විසින් කාලයෙහි ආස්වාද කටයුතුය, තොප විසින් විකාලයෙහි ආස්වාද නො කට යුතුය” කියා යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඔහුට මෙ බඳු සිතෙක් වෙයි: “අපි පෙර ගිහි වූවමෝ යමක් කැමැත්තමෝ නම් එය කම්හ. යමක් නො කැමැත්තමෝ නම් එය නො කම්හ. යමක් කැමැත්තමෝ නම් එය බිදිම්හ. යමක් නො කැමැත්තමෝ නම් එය නො බිදිම්හ. යමක් කැමැත්තමෝ නම් එය ආස්වාද කරම්හ. යමක් නො කැමැත්තමෝ නම් එය ආස්වාද නොකරම්හ. යමක් කැමැත්තමෝ නම් එය බොම්හ. යමක් නො කැමැත්තමෝ නම් එය නො බොම්හ. කැප දැය ද කම්හ, අකැප දැය ද කම්හ. කැප දැය ද බිදිම්හ, අකැප දැය ද බිදිම්හ. කැප දැය ද ආස්වාද කරම්හ, අකැප දැය ද ආස්වාද කරම්හ. කැප දැය ද බොම්හ, අකැප දැයද බොම්හ. කාලයෙහි ද කම්හ, විකාලයෙහි ද කම්හ. කාලයෙහි ද බිදිම්හ, විකාලයෙහි ද බිදිම්හ, කාලයෙහි දු ආස්වාද කරම්හ, විකාලයෙහි ද ආස්වාද කරම්හ. කාලයෙහි ද බොම්හ, විකාලයෙහි ද බොම්හ. සැදැහැති ගෙහෙවිහු දාවල විකාලයෙහිත් අපට යම් පිණී ඛාද්‍යයක් හෝ භෝජ්‍යයක් දෙත් ද, එහිත් මොහු මුඛාවරණ කරණවුන් බන්දහ” යි හේ කිපියේ නො සතුටු සිත් ඇතියේ ශික්‍ෂාප්‍රත්‍යාඛ්‍යානය කොට ගිහිගෙට පෙරළා වැටෙයි. මහණෙනි, මෙ මහණ කුම්භීලභයෙන් බිය වූයේ ශික්‍ෂාව හැර පියා ගිහිගෙට පෙරළා වැටිනැ යි කියනු ලැබේ. මහණෙනි, කුම්භීලභය යනු මහොදරභාවයට (බොහෝකනුවට) තෙල නමෙකි. මහණෙනි, මේ කුම්භීභය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ආවට්ටභය නම් කවරේ ය යත්: මහණෙනි, මෙ ලොව ඇතැම් කුලපුත්‍රයෙක් “ජාතිවිසින් ජරාමරණවිසින් ශෝකපරිදේවදුඃඛදෞර්‍මනස්‍ය උපායාසවිසින් අවතීර්‍ණයෙමි. දුකට බටුයෙමි. දුක්විසින් පෙළුනෙමි. මේ කේවලදුඃඛස්කන්‍ධයාගේ කෙළවර කිරීම පැණේ නම් මනා නම් නු” යි සැදැහැයෙන් ගිහිගෙන් නික්ම පැවිද්දට වැදුනේ වෙයි. හේ මෙසේ පැවිදි වූයේ පෙරවරු හැඳ පෙරෙව පා සිවුරු ගෙණ ගමට හෝ නියම්ගමට හෝ නො රැකි වූ ම කයින් නො රැකි වචනයෙන් නො රැකි සිතින් නො එළඹ සිටි සිහියෙන් අසංවෘත ඉන්‍ද්‍රියයෙන් පිඬු පිණිස පිවිසෙයි. හේ එහි දී පස්කම්ගුණෙන් සමර්පිත සමන්‍විත ඉඳුරන් පිණවන ගොවියකු හෝ ගොවියා පුතකු හෝ දක්නේ ය. ඔහුට මෙ බඳු සිතෙක් වෙයි: අපි පෙර ගිහි වූවමෝ පස්කම් ගුණයෙන් සමර්පිත ව සමන්‍විත ව ඉඳුරන් පිණවූම්හ. මාගේ කුලයෙහි භෝගයෝ විද්‍යමානයහ. භෝගයන් වළඳන්නට ද පින් කරන්නට ද හැකිය. ශික්‍ෂාප්‍රත්‍යාඛ්‍යානය කොට ගිහිගෙට වැටී භෝගයන් වළඳම් නම් පින් ද කෙරෙම් නම් මැනැව” කියා යි. හෙ ශික්‍ෂාව හැර පියා ගිහිගෙට වටාලා වැටෙයි. මහණෙනි, මේ මහණ ආවට්ටභයෙන් බිය වූයේ ශික්‍ෂාව හැර ගිහිගෙට වැටිනැ යි කියනු ලැබේ. මහණෙනි, ආවට්ටභය යනු පස්කම් ගුණයට තෙල නමෙකි. මහණෙනි, මේ ආවට්ටභය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 242,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමඤ්ච භික්ඛවෙ සුසුකාභයං? ඉධ භික්ඛවෙ එකච්චො කුලපුත්තො සද්ධා අගාරස්මා අනගාරියං පබ්බජිතො හොති “ඔතිණ්ණොම්හි ජාතියා ජරාමරණෙන, සොකෙහි පරිදෙවෙහි දුක්ඛෙහි දොමනස්සෙහි උපායාසෙහි, දුක්ඛොතිණ්ණොදුක්ඛපරෙතො. අප්පෙවනාම ඉමස්ස කෙවලස්ස දුක්ඛක්ඛන්ධස්ස අන්තකිරියා පඤ්ඤායෙථා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සො එවං පබ්බජිතො සමානො පුබ්බන්හසමයං නිවාසෙත්වා පත්තචීවරං ආදාය ගාමං වා නිගමං වා පිණ්ඩාය පවිසති අරක්ඛිතෙනෙව කායෙන අරක්ඛිතාය වාචාය අරක්ඛිතෙන චිත්තෙන අනුපට්ඨිතාය සතියා අසංවුතෙහි ඉන්ද්රියෙහි. සො තත්ථ පස්සති මාතුගාමං දුන්නිවත්ථං වා දුප්පාරුතං වා. තස්ස මාතුගාමං දිස්වා දුන්නිවත්ථං වා දුප්පාරුතං වා රාගොචිත්තං අනුද්ධංසෙති. සො රාගානුද්ධංසිතෙන චිත්තෙන සික්ඛං පච්චක්ඛාය හීනායාවත්තති. අයං වුච්චති භික්ඛවෙ භික්ඛු සුසුකාභයස්ස භීතො සික්ඛං පච්චක්ඛාය හීනායාවත්තො. සුසුකාභයන්ති ඛො භික්ඛවෙ මාතුගාමස්සෙතං අධිවචනං. ඉදං වුච්චති භික්ඛවෙ සුසුකාභයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ චත්තාරි භයානි ඉධෙකච්චස්ස කුලපුත්තස්ස ඉමස්මිං ධම්මවිනයෙ සද්ධා අගාරස්මා අනගාරියං පබ්බජිතස්ස පාටිකඞ්ඛිතබ්බානීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 3. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පුගගලසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "23. චත්තාරොමෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චො පුග්ගලො විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහරති. සො තදස්සාදෙති. තන්නිකාමෙති. තෙන ච විත්තිං ආපජ්ජති. තත්ථ ඨිතො තදධිමුත්තො තබ්බහුලවිහාරී අපරිහීනො කාලං කුරුමානො බ්රහ්මකායිකානං දෙවානං සහව්යථතං උපපජ්ජති. බ්රහ්මකායිකානං භික්ඛවෙ දෙවානං කප්පො ආයුප්පමාණං. තත්ථ පුථුජ්ජනො යාවතායුකං ඨත්වා යාවතකං තෙසං දෙවානං ආයුප්පමාණං තං සබ්බං ඛෙපෙත්වා නිරයම්පි ගච්ඡති. තිරච්ඡානයොනිම්පි ගච්ඡති පෙත්තිවිසයම්පි ගච්ඡති. භගවතො පන සාවකො තත්ථ යාවතායුකං ඨත්වා යාවතකං තෙසං දෙවානං ආයුප්පමාණං තං සබ්බං ඛෙපෙත්වා තස්මිංයෙව භවෙ පරිනිබ්බායති. අයං ඛො භික්ඛවෙ විසෙසො, අයං අධිප්පායො, ඉදං නානාකරණං සුතවතො අරියසාවකස්ස අස්සුතවතා පුථුජ්ජනෙන යදිදං ගතියා උපපත්තියා සති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, සුසුකාභය නම් කවරේය යත්: මහණෙනි, මෙලොව ඇතැම් කුලපුත්‍රයෙක් “ජාතිවිසින් ජරාමරණවිසින් ශෝකපරිදේවදුඃඛදෞර්‍මනස්‍යඋපායාසවිසින් අවතීර්‍ණ වෙමි. දුකට බටුයෙමි. දුක්විසින් පෙළුනෙමි. මේ කේවල දුඃඛස්කන්‍ධයාගේ අවසානය පැණේ නම් මනා නම් නු” යි සැදැහැයෙන් ගිහිගෙන් නික්ම පැවිද්දට වැදුනේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "හේ මෙසේ පැවිදි වූයේ පෙරවරු හැඳ පෙරව පාසිවුරු ගෙණ ගමට හෝ නියම්ගමට හෝ නො රැක ගත් කයින්, නො රැක ගත් වචනයෙන්, නො රැක ගත් සිතින් නො එළඹ සිටි සිහියෙන් අසංවෘත ඉන්‍ද්‍රියයෙන් යුක්ත ව පිඬු පිණිස පිවිසෙයි. හේ එහි දී වසඩක් නොවසා හැඳගත් වසඩක් නොවසා පෙරව ගත් මාගමක් දක්නේ ය. වසඩක් නොවසා හැඳි වසඩක් නොවසා පෙරවි මාගම දැක්මෙන් ඔහුගේ සිත රාගය පුන පුනා පෙළයි. හේ රාගයා විසින් පෙළුනු සිතින් ශික්‍ෂාව හැර ගිහිගෙට වැටෙයි. මහණෙනි, මේ මහණ සුසුකාභයින් බිය වූයේ ශික්‍ෂාව හැර ගිහිගෙට වැටිනැ යි කියනු ලැබේ. මහණෙනි, සුසුකාභය යනු මාගමට තෙල නමෙකි. මහණෙනි, මේ සුසුකාභය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර භීතීහු සැදැහැයෙන් ගිහිගෙන් නික්ම මෙසස්නෙහි පැවිද්දට පැමිණි කුලපුත්‍රයා විසින් කැමැති විය යුත්තාහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.3.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පුග්ගල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "23. මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි විද්‍යමානයහ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව ඇතැම් පුද්ගලයෙක් කාමයෙන් වෙන් ව අකුසලදහමින් වෙන් ව, විතර්‍ක සහිත, විචාර සහිත, විවේකයෙන් උපන් ප්‍රීති සුඛය ඇති ප්‍රථමධ්‍යානට පැමිණ වෙසෙයි. හේ ඒ ධ්‍යානය සුඛාස්වාදයෙන් ආස්වාද කෙරෙයි. ඒ ධ්‍යානය පතයි. ඒ ධ්‍යානයෙන් ම තුෂ්ටියට පැමිණෙයි. එහි සිටියේ එහි අධිමුක්ත වූයේ ඒ දැහැනින් බෙහෙවින් වසන්නේ එයින් නො පිරිහුනේ කලුරිය කරමින් බ්‍රහ්මකායික දෙවියන්ගේ සහභාවයට පැමිණෙයි. මහණෙනි, බ්‍රහ්මකායික දෙවියන්ගේ ආයුඃප්‍රමාණය කල්පයෙකි. එහි පුහුදුන් තෙමේ ආයු ඇති තාක් සිට ඒ දෙවියන්ගේ ආයුඃප්‍රමාණය යම් පමණ වේ ද යම් පමණ වේ ද ඒ හැම ගෙවා නිරයට ද යෙයි. තිරිසන්යෝනට ද යෙයි. ප්‍රේතවිෂ්යට ද යෙයි. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක වනාහි එහි ආයු තාක් සිට ඒ දෙවියන්ගේ ආයුඃප්‍රමාණය යම් පමණ වේ ද එ හැම ගෙවා ඒ රූපභාවයෙහි ම පිරිනිවන් පානේ ය. මහණෙනි, ගතිය හා උපපත්තිය හා ඇති කල්හි අශ්‍රැතවත් පෘථග්ජනයා හා ශ්‍රැතවත් ආර්‍ය්‍යශ්‍රාවකයාගේ මේ විශෙෂ යි. මේ අධිකප්‍රයෝගයි. මේ වෙනස යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 244,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ ඉධෙකච්චො පුග්ගලො විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියං ඣානං උපසම්පජ්ජ විහරති. සො තදස්සාදෙති. තන්නිකාමෙති. තෙන ච විත්තිං ආපජ්ජති. තත්ථ ඨිතො තදධිමුත්තො තබ්බහුලවිහාරී අපරිහීනො කාලං කුරුමානො ආභස්සරානං දෙවානං සහව්යතං උපපජ්ජති. ආභස්සරානං භික්ඛවෙ දෙවානං ද්වෙ කප්පා ආයුප්පමාණං. තත්ථ පුථුජ්ජනො යාවතායුකං ඨත්වා යාවතකං තෙසං දෙවානං ආයුප්පමාණං තං සබ්බං ඛෙපෙත්වා නිරයම්පි ගච්ඡති තිරච්ඡානයොනිම්පි ගච්ඡති පෙත්තිවිසයම්පි ගච්ඡති. භගවතො පන සාවකො තත්ථ යාවතායුකං ඨත්වා යාවතකං තෙසං දෙවානං ආයුප්පමාණං තං සබ්බං ඛෙපෙත්වා තස්මිං යෙව භවෙ පරිනිබ්බායති. අයං ඛො භික්ඛවෙ විසෙසො. අයං අධිප්පායො ඉදං නානාකරණං සුතවතො අරියසාවකස්ස අස්සුතවතා පුථුජ්ජනෙන යදිදං ගතියා උපපත්තියා සති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ ඉධෙකච්චො පුග්ගලො පීතියා ච විරාගා උපෙක්ඛකො ච විහරති සතො ච සම්පජානො සුඛං ච කායෙන පටිසංවෙදෙති. යං තං අරියා ආචික්ඛන්ති උපෙක්ඛකො සතිමා සුඛවිහාරීති තතියං ඣානං උපසම්පජ්ජ විහරති. සො තදස්සාදෙති තන්නිකාමෙති තෙන ච විත්තිං ආපජ්ජති. තත්ථ ඨිතො තදධිමුත්තො තබ්බහුලවිහාරී අපරිහීනො කාලං කුරුමානො සුභකිණ්හානං දෙවානං සහව්යතං උපපජ්ජති. සුභකිණ්හානං භික්ඛවෙ දෙවානං චත්තාරො කප්පා ආයුප්පමාණං. තත්ථ පුථුජ්ජනො යාවතායුකං ඨත්වා යාවතකං තෙසං දෙවානං ආයුප්පමාණං තං සබ්බං ඛෙපෙත්වා නිරයම්පි ගච්ඡති තිරච්ඡානයොනිම්පි ගච්ඡති පෙත්තිවිසයම්පි ගච්ඡති. භගවතො පන සාවකො තත්ථ යාවතායුකං ඨත්වා යාවතකං තෙසං දෙවානං ආයුප්පමාණං තං සබ්බං ඛෙපෙත්වා තස්මිං යෙව භවෙ පරිනිබ්බායති. අයං ඛො භික්ඛවෙ විසෙසො, අයං අධිප්පායො, ඉදං නානාකරණං සුතවතො අරියසාවකස්ස අස්සුතවතා පුථුජ්ජනෙන යදිදං ගතියා උපපත්තියා සති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ ඉධෙකච්චො පුග්ගලො සුඛස්ස ච පහාණා දුක්ඛස්ස ච පහාණා පුබ්බෙව සොමනස්සදොමනස්සානං අත්ථගමා අදුක්ඛං අසුඛං උපෙක්ඛාසතිපාරිසුද්ධිං චතුත්ථං ඣානං උපසම්පජ්ජ විහරති. සො තදස්සාදෙති. තන්නිකාමෙති. තෙන ච විත්තිං ආපජ්ජති. තත්ථ ඨිතො තදධිමුත්තො තබ්බහුලවිහාරී අපරිහීනො කාලං කුරුමානො වෙහප්ඵලානං දෙවානං සහව්යජතං උපපජ්ජති. වෙහප්ඵලානං භික්ඛවෙ දෙවානං පඤ්චකප්පසතානි ආයුප්පමාණං. තත්ථ පුථුජ්ජනො යාවතායුකං ඨත්වා යාවතකං තෙසං දෙවානං ආයුප්පමාණං තං සබ්බං ඛෙපෙත්වා නිරයම්පි ගච්ඡති. තිරච්ඡානයොනිම්පි ගච්ඡති. පෙත්තිවිසයම්පි ගච්ඡති. භගවතො පන සාවකො තත්ථ යාවතායුකං ඨත්වා යාවතකං තෙසං දෙවානං ආයුප්පමාණං තං සබ්බං ඛෙපෙත්වා තස්මිං යෙව භවෙ පරිනිබ්බායති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "තවද මහණෙනි, මෙ ලොව ඇතැම් පුද්ගලයෙක් විතර්‍ක විචාර සංහිඳුවාලීමෙන් තමා තුළ පැහැදීම් කරණ, සිත පිළිබඳ එකඟ බව ඇති විතර්‍ක විචාර නැති, සමාධියෙන් උපන් ප්‍රීතිසුඛ ඇති, ද්විතීයධ්‍යානය උපයා වෙසෙයි. හේ ඒ දැහැන සුඛාස්වාදයෙන් ආස්වාද කෙරෙයි. ඒ දැහැන පතයි. ඒ දැහැනින් තුෂ්ටියට පැමිණෙයි. එහි සිටියේ ඒ දැහැනෙහි අධිමුක්ත වූයේ ඒ දැහැනින් බහුල විහරණ ඇතියේ, නො පිරිහුනේ කලුරිය කරමින් ආභාස්වර දෙවියන්ගේ සහභාවයට පැමිණෙයි. මහණෙනි, ආභාස්වර දෙවියන්ගේ ආයුඃප්‍රමාණය දෙ කපෙකි. එහි පෘථග්ජන ආයු ඇතිතාක් සිට ඒ දෙවියන්ගේ ආයුඃප්‍රමාණය යම් පමණ වේ ද එ හැම ගෙවා නිරයට ද යෙයි. තිරිසන් යොනට ද යෙයි. ප්‍රේතවිෂයට ද යෙයි. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක වනාහි එහි ආයු ඇති තාක් සිට ඒ දෙවියන්ගේ ආයුඃප්‍රමාණය යම් පමණ වේ ද, එ හැම ගෙවා ඒ භවයෙහි ම පිරිනිවෙයි. මහණෙනි, ගතිය හා උපපත්තිය හා ඇතිකල්හි අශ්‍රැතවත් පෘථග්ජනයා හා ශ්‍රැතවත් ආර්‍ය්‍යශ්‍රාවකයාගේ මේ විශේෂයි. මේ අධිකප්‍රයෝග යි. මේ වෙනසයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තව ද මහණෙනි, මෙ මෙලොව ඇතැම් පුද්ගලයෙක් ප්‍රීති විරාගයෙන් උපේක්‍ෂක වූයේ ස්මෘතිමත් වූයේ නුවණින් දන්නේ වාස කෙරෙයි. සුඛය ද නාමකයින් විඳ ගණී. යම් දැහැන් ලදුවකු උපේක්‍ෂක ය, ස්මෘතිමත් ය, සුඛවිහාරී ය යි ආර්‍ය්‍යයෝ කියත් ද, ඒ තුන්වන දැහැනට එළඹ වෙසෙයි. හේ ඒ දැහැන සුඛාස්වාදයෙන් ආස්වාද කෙරෙයි. ඒ දැහැන පතයි. එයින් තුෂ්ටියට පැමිණෙයි. එහි සිටියේ ඒ දැහැනෙහි අධිමුක්ත වූයේ ඒ දැහැනින් බහුල විහරණ ඇත්තේ නො පිරිහුනේ කලුරිය කරමින් ශුභකෘත්සන දෙවියන්ගේ සහභාවයට එළඹෙයි. මහණෙනි, ශුභකෘත්සන දෙවියන්ගේ ආයුඃප්‍රමාණය සතර කල්පයෙකි. එහි පෘථග්ජන ආයු ඇති තාක් සිට ඒ දෙවියන්ගේ ආයුඃප්‍රමාණය යම් පමණ වේ ද එ හැම ගෙවා නිරයට ද යෙයි. තිරිසන්යොනට ද යෙයි. ප්‍රේතවිෂයට ද යෙයි. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක වනාහි එහි ආයු ඇති තාක් සිට ඒ දෙවියන්ගේ ආයුඃප්‍රමාණය යම් පමණ වේ ද එ හැම ගෙවා ඒ භවයෙහි ම පිරිනිවෙයි. මහණෙනි, ගතිය හා උපපත්තිය හා ඇති කල්හි අශ්‍රැතවත් පෘථග්ජනයා හා ශ්‍රැතවත් ආර්‍ය්‍යශ්‍රාවකයාගේ මේ විශේෂයි. මේ අධිකප්‍රයෝගයි, මේ වෙනසයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තව ද මහණෙනි, මේ ලොව ඇතැම් පුද්ගලයෙක් සුඛයාගේ ද ප්‍රහාණියෙන් දුඃඛයාගේ ද ප්‍රහාණියෙන් කැලම සොම්නස් දොම්නසුන් අස්තඞ්ගම ව යාමෙන් දුක් නැති, සුව නැති, උපේක්‍ෂාස්මෘති පාරිශුද්ධි ඇති චතුර්‍ත්‍ථධ්‍යානයට එළඹ වෙසෙයි. හේ ඒ ධ්‍යානය සුඛාස්වාද විසින් ආස්වාද කෙරෙයි. ඒ දැහැන පතයි. ඒ දැහැනින් තුෂ්ටියට පැමිණෙයි. එහි සිටියේ ඒ දැහැනෙහි අධිමුක්ත වූයේ ඒ දැහැනෙන් බහුල විහරණ ඇත්තේ නොපිරිහුනේ කලුරිය කරමින් වෘහත්ඵල දෙවියන්ගේ සහභාවයට එළඹෙයි. මහණෙනි, වෘහත්ඵල දෙවියන්ගේ ආයුඃප්‍රමාණය පන්සිය කපෙකි. එහි පෘථග්ජන ආයු ඇති තාක් සිට ඒ දෙවියන්ගේ ආයුඃප්‍රමාණය යම් පමණ වේ ද එ හැම ගෙවා නිරයට ද යෙයි, තිරිසන්යොනට ද යෙයි. ප්‍රෙතවිෂයට ද යෙයි. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක වනාහි එහි ආයු ඇති තාක් සිට ඒ දෙවියන්ගේ ආයුඃප්‍රමාණය යම් පමණ වේ ද ඒ හැම ගෙවා ඒ භවයෙහි ම පිරිනිවෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 246,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො භික්ඛවෙ විසෙසො, අයං අධිප්පායො ඉදං නානාකරණං සුතවතො අරියසාවකස්ස අස්සුතවතා පුථුජ්ජනෙන යදිදං ගතියා උපපත්තියා සති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 3. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(දුතියපුග්ගලසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "24. චත්තාරොමෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චො පුග්ගලො විවිච්චෙව කාමෙහි -පෙ- පඨමං ඣානං උපසම්පජ්ජ විහරති. සො යදෙව තත්ථ හොති රූපගතං වෙදනාගතං සඤ්ඤාගතං සඞ්ඛාරගතං විඤ්ඤාණගතං, තෙ ධම්මෙ අනිච්චතො දුක්ඛතො රොගතො ගණ්ඩතො සල්ලතො අඝතො ආබාධතො පරතො පලොකතො සුඤ්ඤතො අනත්තතො සමනුපස්සති. සො කායස්ස භෙදා පරම්මරණා සුද්ධාවාසානං දෙවානං සහව්යතං උපපජ්ජති. අයං භික්ඛවෙ උපපත්ති අසාධාරණා පුථුජ්ජනෙහි."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ ඉධෙකච්චො පුග්ගලො විතක්කවිචාරානං වූපසමා -පෙ- දුතියං ඣානං -පෙ- තතියං ඣානං -පෙ- චතුත්ථං ඣානං උපසම්පජ්ජ විහරති. සො යදෙව තත්ථ හොති රූපගතං වෙදනාගතං සඤ්ඤාගතං සඞ්ඛාරගතං විඤ්ඤාණගතං, තෙ ධම්මෙ අනිච්චතො දුක්ඛතො රොගතො ගණ්ඩතො සල්ලතො අඝතො ආබාධතො පරතො පලොකතො සුඤ්ඤතො අනත්තතො සමනුපස්සති. සො කායස්ස භෙදා පරම්මරණා සුද්ධාවාසානං දෙවානං සහව්යතං උපපජ්ජති. අයං භික්ඛවෙ උපපත්ති අසාධාරණා පුථුජ්ජනෙහි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 3. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(තතියපුග්ගලසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "25. චත්තාරොමෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චො පුග්ගලො මෙත්තාසහගතෙන චෙතසා එකං දිසං ඵරිත්වා විහරති - තථා දුතියං - තථා තතියං - තථා චතුත්ථිං, ඉති උද්ධමධො තිරියං සබ්බධි සබ්බත්තතාය සබ්බාවන්තං ලොකං මෙත්තාසහගතෙන චෙතසා විපුලෙන මහග්ගතෙන අප්පමාණෙන අවෙරෙන අබ්යාපජ්ජෙන ඵරිත්වා විහරති. සො තදස්සාදෙති තං නිකාමෙති තෙන ච විත්තිං ආපජ්ජති. තත්ථ ඨිතො තදධිමුත්තො තබ්බහුලවිහාරී අපරිහීනො කාලං කුරුමානො බ්රහ්මකායිකානං දෙවානං සහව්යතං උපපජ්ජති. බ්රහ්මකායිකානං භික්ඛවෙ දෙවානං කප්පො ආයුප්පමාණං. තත්ථ පුථුජ්ජනො යාවතායුකං ඨත්වා යාවතකං තෙසං දෙවානං ආයුප්පමාණං තං සබ්බං ඛෙපෙත්වා නිරයම්පි ගච්ඡති තිරච්ඡානයොනිම්පි ගච්ඡති පෙත්තිවිසයම්පි ගච්ඡති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, ගතිය උපපත්තිය ඇති කල්හි අශ්‍රැතවත් පෘතග්ජනයා හා ශ්‍රැතවත් ආර්‍ය්‍යශ්‍රාවකයාගේ මේ විශේෂයි. මේ අධිකප්‍රයෝග යි. මේ වෙනස යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර පුද්ගලයෝ ලෝකයෙහි විද්‍යමානයහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.3.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතියපුග්ගල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "24. මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි විද්‍යමානයහ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව ඇතැම් පුද්ගලයෙක් කාමයෙන් වෙන් ව ම ... පළමුවන දැහැනට ඇටිඇටිසඳ සමවැද වෙසෙයි. හේ එහි යම් ම රූපයෙක් ඇත් ද, වෙදනායෙක්, සංඥායෙක්, සංස්කාරයෙක්, විඥානයෙක් ඇත් ද, ඒ දහම් අනිත්‍ය විසින් දුඃඛ විසින් රෝග විසින් ගණ්ඩ විසින් ශල්‍ය විසින් අඝ විසින් ආබාධ විසින් පරායත්ත විසින් විනාශ විසින් ශූන්‍ය විසින් අනාත්ම විසින් දක්නේ ය. හේ කාබුන් මරණින් මතුයෙහි ශුද්ධාවාස දෙවියන්ගේ සහභාවයට යෙයි. මහණෙනි, මේ උප්පත්තිය පුහුදුන් හා අසාධාරණ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තව ද මහණෙනි, මෙ ලොව ඇතැම් පුද්ගලයෙක් විතර්‍ක විචාරයන් සංහිඳීමෙන් .. දෙවන දැහැනට ... තෙවන දැහැනට ... සතරවන දැහැනට සමවැද වෙසෙයි. හේ එහි යම් ම රූපයෙක්, වෙදනායෙක්, සංඥායෙක්, සංස්කාරයෙක්, විඥානයෙක් ඇත් ද, ඒ දහම් අනිත්‍ය විසින් දුඃඛ විසින් රෝග විසින් ගණ්ඩ විසින් ශල්‍ය විසින් අඝ විසින් ආබාධ විසින් පරායත්ත විසින් විනාශ විසින් ශූන්‍ය විසින් අනාත්ම විසින් දක්නේ ය. හේ කාබුන් මරණින් මතුයෙහි ශුද්ධාවාස දෙවියන්ගේ සහභාවයට එළඹෙයි. මහණෙනි, මේ උප්පත්තිය පුහුදුනන් හා අසාධාරණ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පුද්ගලයෝ සතර දෙන ලෝකයෙහි විද්‍යමාන වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.3.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තතියපුග්ගල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "25. මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි විද්‍යමාන වෙත්. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව ඇතැම් පුද්ගලයෙක් මෛත්‍රී සහගත සිතින් එක් දිගක් පැහැස වෙසෙයි. එසෙයින් දෙවන දිග ද එසෙයින් තෙවන දිග ද එසෙයින් සතරවන දිග දැයි මෙසේ උඩ යට සරස හැම තැන සර්‍වසත්ත්‍වයන් කෙරෙහි ආත්මසමතායෙන් මුළු ලෝ විපුල වූ මහද්ගත වූ අප්‍රමාණ වූ අවෛර වූ ව්‍යාබාධ (දොම්නස්) රහිත වූ මෙත්සහගිය සිතින් පැහැස වෙසෙයි. හේ දැහැන සුඛානුභව විසින් ආස්වාද කෙරෙයි. ඒ දැහැන කැමැති වෙයි. ඒ දැහැනින් තුෂ්ටියට පැමිණෙයි. එහි සිටියේ ඒ දැහැනෙහි අධිමුක්ත වූයේ ඒ දැහැනෙන් බහුල විහරණ ඇතියේ නො පිරිහුනේ කලුරිය කරමින් බ්‍රහ්මකායික දෙවියන්ගේ සහභාවයට එළඹෙයි. මහණෙනි, බ්‍රහ්මකායික දෙවියන්ගේ ආයුඃප්‍රමාණය කල්පයෙකි. එහි පෘථග්ජන ආයු ඇතිතාක් සිට ඒ දෙවියන්ගේ ආයුඃප්‍රමාණය යම් පමණ වේ ද, එහැම ගෙවා නිරයට ද යෙයි. තිරිසන් යොනට ද යෙයි. ප්‍රෙතවිෂයට ද යෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 248,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "භගවතො පන සාවකො තත්ථ යාවතායුකං ඨත්වා යාවතකං තෙසං දෙවානං ආයුප්පමාණං තං සබ්බං ඛෙපෙත්වා තස්මිං යෙව භවෙ පරිනිබ්බායති. අයං ඛො භික්ඛවෙ විසෙසො අයං අධිප්පයායො ඉදං නානාකරණං සුතවතො අරියසාවකස්ස අස්සුතවතා පුථුජ්ජනෙන යදිදං ගතියා උපපත්තියා සති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ ඉධෙකච්චො පුග්ගලො කරුණාසහගතෙන චෙතසා -පෙ- ආභස්සරානං දෙවානං සහව්යතං උපපජ්ජති. ආභස්සරානං භික්ඛවෙ දෙවානං ද්වෙ කප්පා ආයුප්පමාණං -පෙ- මුදිතාසහගතෙන චෙතසා -පෙ- සුභකිණ්හානං දෙවානං සහව්යතං උපපජ්ජති. සුභකිණ්හානං භික්ඛවෙ දෙවානං චත්තාරො කප්පා ආයුප්පමාණං -පෙ- {1}*උපෙක්ඛාසහගතෙන චෙතසා එකං දිසං ඵරිත්වා විහරති, තථා දුතියං - තථා තතියං - තථා චතුත්ථිං - ඉති උද්ධමධො තිරියං සබ්බධි සබ්බත්තතාය සබ්බාවන්තං ලොකං උපෙක්ඛාසහගතෙන චෙතසා විපුලෙන මහග්ගතෙන අප්පමාණෙන අවෙරෙන අබ්යාපජ්ඣෙන ඵරිත්වා විහරති. සො තදස්සාදෙති තං නිකාමෙති තෙන ච විත්තිං ආපජ්ජති. තත්ථ ඨිතො තදධිමුත්තො තබ්බහුලවිහාරී අපරිහීනො කාලං කුරුමානො වෙහප්ඵලානං දෙවානං සහව්යතං උපපජ්ජති. වෙහප්ඵලානං භික්ඛවෙ දෙවානං පඤ්චකප්පසතානි ආයුප්පමාණං. තත්ථ පුථුජ්ජනො යාවතායුකං ඨත්වා යාවතකං තෙසං දෙවානං ආයුප්පමාණං තං සබ්බං ඛෙපෙත්වා නිරයම්පි ගච්ඡති. තිරච්ඡානයොනිම්පි ගච්ඡති. පෙත්තිවිසයම්පි ගච්ඡති. භගවතො පන සාවකො තත්ථ යාවතායුකං ඨත්වා යාවතකං තෙසං දෙවානං ආයුප්පමාණං තං සබ්බං ඛෙපෙත්වා තස්මිං යෙව භවෙ පරිනිබ්බායති. අයං ඛො භික්ඛවෙ විසෙසො, අයං අධිප්පයායො. ඉදං නානාකරණං සුතවතො අරියසාවකස්ස අස්සුතවතා පුථුජ්ජනෙන යදිදං ගතියා උපපත්තියා සති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 3. 6",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(චතුත්ථපුග්ගලසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "26. චත්තාරොමෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චො පුග්ගලො මෙත්තාසහගතෙන චෙතසා එකං දිසං ඵරිත්වා විහරති. තථා දුතියං - තථා තතියං - තථා චතුත්ථිං.- ඉති උද්ධමධො තිරියං සබ්බධි සබ්බත්තතාය සබ්බාවන්තං ලොකං මෙත්තාසහගතෙන චෙතසා විපුලෙන මහග්ගතෙන අප්පමාණෙන අවෙරෙන අබ්යාපජ්ඣෙන ඵරිත්වා විහරති. සො යදෙව තත්ථ හොති රූපගතං වෙදනාගතං සඤ්ඤාගතං සඞ්ඛාරගතං විඤ්ඤාණගතං, තෙ ධම්මෙ අනිච්චතො දුක්ඛතො රොගතො ගණ්ඩතො සල්ලතො අඝතො ආබාධතො පරතො පලොකතො සුඤ්ඤතො අනත්තතො සමනුපස්සති. සො කායස්ස භෙදා පරම්මරණා සුද්ධාවාසානං දෙවානං සහව්යතං උපපජ්ජති. අයං ඛො භික්ඛවෙ උපපත්ති අසාධාරණා පුථුජ්ජනෙහි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. * ඉමෙසං සුත්තප්පදෙසානං පෙය්යාලමුඛානි ‘සීමු, මඡසං’ පොත්ථකෙසු අට්ඨානපතිතානි දිස්සන්ති. ස්යාමපොත්ථකෙ සුත්තං සම්පුණ්ණමෙව දිස්සති."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක වනාහි එහි ආයු ඇතිතාක් සිට ඒ දෙවියන්ගේ ආයුඃප්‍රමාණය යම් පමණ වේ ද එ හැම ගෙවා ඒ භවයෙහි ම පිරිනිවෙයි. මහණෙනි, ගතිය හා උපපත්තිය හා ඇති තාක් අශ්‍රැතවත් පෘථග්ජනයා හා ශ්‍රැතවත් ආර්‍ය්‍යශ්‍රාවකයාගේ මේ විශෙෂ යි. මේ අධිකප්‍රයෝග යි. මේ වෙනස යි."
                    },
                    {
                        "text": "තවද මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් කරුණා සහගත සිතින් ... ආභාස්වර දෙවියන්ගේ සහභාවයට එළඹෙයි. මහණෙනි, ආභාස්වර දෙවියන්ගේ ආයුඃප්‍රමාණය කල්ප දෙකෙකි. ... මුදිතා සහගත සිතින් ... ශුභකෘත්සන දෙවියන්නේ සහභාවයට එළඹෙයි. මහණෙනි, ශුභකෘත්සන දෙවියන්ගේ ආයුඃප්‍රමාණය සතර කල්පයෙකි. ... උපේක්‍ෂා සහගත සිතින් එක් දිගක් පැහැස වෙසෙයි. එසෙයින් දෙවන දිග ද එසෙයින් තෙවන දිග ද එසෙයින් සතර වන දිග ද මෙසේ උඩ යට සරස සැම තැන සර්‍වසත්ත්‍වයන් කෙරෙහි ආත්මසමතායෙන් මුළු ලෝ විපුල වූ මහද්ගත වූ අප්‍රමාණ වූ අවෛර වූ ව්‍යාබාධ රහිත උපේක්‍ෂා සහගත සිතින් පැහැස වෙසෙයි. හේ එය සුඛානුභව විසින් ආස්වාද කෙරෙයි. ඒ දැහැන පතයි. ඒ දැහැනින් තුෂ්ටියට පැමිණෙයි. එහි සිටියේ එහි අධිමුක්ත වූයේ ඒ දැහැනෙන් බහුල විහරණ ඇත්තේ නො පිරිහුනේ කලුරිය කරමින් වෘහතඵල දෙවියන්ගේ සහභාවයට එළඹෙයි. මහණෙනි, වෘහතඵල දෙවියන්ගේ ආයුඃප්‍රමාණය පඤ්චකල්ප ශතයෙකි. එහි පෘථග්ජන ආයු ඇතිතාක් සිට ඒ දෙවියන්ගේ ආයුඃප්‍රමාණය යම් පමණ වේ ද, ඒ හැම ගෙවා නිරයට ද යෙයි. තිරිසන්යොනට ද යෙයි. ප්‍රේත විෂයට ද යෙයි. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක වනාහි එහි ආයු ඇති තාක් සිට ඒ දෙවියන්ගේ ආයුඃප්‍රමාණය යම් පමණ වේ ද එ හැම ගෙවා ඒ භවයෙහි ම පිරිනිවෙයි. මහණෙනි, ගතිය හා උපපත්තිය හා ඇති කල්හි අශ්‍රැතවත් පෘතග්ජනයා හා ශ්‍රැතවත් ආර්‍ය්‍යශ්‍රාවකයාගේ මේ විශේෂයි. මේ අධිකප්‍රයෝගයි. මේ වෙනසයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පුද්ගලයෝ සතර දෙන ලෝකයෙහි විද්‍යමානයහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.3.6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "චතුත්ථපුග්ගල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "26. මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි විද්‍යමානයහ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව ඇතැම් පුද්ගලයෙක් මෛත්‍රී සහගත සිතින් එක් දිගක් පැහැස වෙසෙයි. එසෙයින් දෙවන දිග ද එසෙයින් තෙවන දිග ද එසෙයින් සිවුවන දිග ද මෙසේ උඩ යට සරස හැම තැන සර්‍වසත්ත්‍වයන් කෙරෙහි ආත්මසමතායෙන් මුළු ලොව විපුල වූ මහද්ගත වූ අප්‍රමාණ වූ අවෛර වූ ව්‍යාබාධ රහිත වූ මෙත් සහගිය සිතින් පැහැස වෙසෙයි. හේ යම් ම එහි රූපයෙක්, වෙදනායෙක්, සංඥායෙක්, සංස්කාරයෙක්, විඥානයෙක් වේ ද, ඒ ධර්‍මයන් අනිත්‍ය විසින්, රෝග විසින්, ගඬ විසින්, අඝ විසින්, ආබාධ විසින්, පරායත්ත විසින්, විනාශ විසින්, ශූන්‍ය විසින්, අනාත්ම විසින්, නුවණින් දක්නේ ය. හේ කාබුන් මරණින් මතු සුදවැසි දෙවියන්ගේ සහවාසයට පැමිණෙයි. මහණෙනි, මේ උප්පත්තිය පුහුදුනන් හා අසාධාරණ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 250,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ ඉධෙකච්චො පුග්ගලො කරුණාසහගතෙන චෙතසා -පෙ- මුදිතාසහගතෙන චෙතසා -පෙ- උපෙක්ඛාසහගතෙන චෙතසා එකං දිසං ඵරිත්වා විහරති. තථා දුතියං - තථා තතියං - තථා චතුත්ථිං. ඉති උද්ධමධො තිරියං සබ්බධි සබ්බත්තතාය සබ්බාවන්තං ලොකං උපෙක්ඛාසහගතෙන චෙතසා විපුලෙන මහග්ගතෙන අප්පමාණෙන අවෙරෙන අබ්යාපජ්ඣෙන ඵරිත්වා විහරති. සො යදෙව තත්ථ හොති රූපගතං වෙදනාගතං සඤ්ඤාගතං සඞ්ඛාරගතං විඤ්ඤාණගතං තෙ ධම්මෙ අනිච්චතො දුක්ඛතො රොගතො ගණ්ඩතො සල්ලතො අඝතො ආබාධතො පරතො පලොකතො සුඤ්ඤතො අනත්තතො සමනුපස්සති. සො කායස්ස භෙදා පරම්මරණා සුද්ධාවාසානං දෙවානංසහව්යතං උපපජ්ජති. අයං භික්ඛවෙ උපපත්ති අසාධාරණා පුථුජ්ජනෙහි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 3. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(තථාගත අච්ඡරියසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "27. තථාගතස්ස භික්ඛවෙ අරහතො සම්මාසම්බුද්ධස්ස පාතුභාවා චත්තාරො අච්ඡරියා අබ්භුතා ධම්මා පාතුභවන්ති. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "යදා භික්ඛවෙ බොධිසත්තො තුසිතා කායා චවිත්වා සතො සම්පජානො මාතුකුච්ඡිං ඔක්කමති, අථ සදෙවකෙ ලොකෙ සමාරකෙ සබ්රහ්මකෙ සස්සමණබ්රාහ්මණියා පජාය සදෙවමනුස්සාය අප්පමාණො උළාරො ඔභාසො පාතුභවති අතික්කම්මෙව දෙවානං දෙවානුභාවං. යාපි තා ලොකන්තරිකා අඝා අසංවුතා අන්ධකාරා අන්ධකාරතිමිසා යත්ථිමෙසං චන්දිමසුරියානං එවං මහිද්ධිකානං එවං මහානුභාවානං ආභා නානුභොන්ති, තත්ථපි අප්පමාණො උළාරො ඔභාසො පාතුභවති අතික්කම්මෙව දෙවානං දෙවානුභාවං. යෙපි තත්ථ සත්තා උපපන්නා තෙපි තෙනොභාසෙන අඤ්ඤමඤ්ඤං සඤ්ජානන්ති “අඤ්ඤෙපි කිර භො සන්ති සත්තා ඉධූපපන්නා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තථාගතස්ස භික්ඛවෙ අරහතො සම්මාසම්බුද්ධස්ස පාතුභාවා අයං පඨමො අච්ඡරියො අබ්භුතො ධම්මො පාතුභවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ යදා බොධිසත්තො සතො සම්පජානො මාතුකුච්ඡිස්මා නික්ඛමති, අථ සදෙවකෙ ලොකෙ සමාරකෙ සබ්රබහ්මකෙ, සස්සමණබ්රාහ්මණියා පජාය සදෙවමනුස්සාය අප්පමාණො උළාරො ඔභාසො පාතුභවති. අතික්කම්මෙව දෙවානං දෙවානුභාවං. යාපි තා ලොකන්තරිකා අඝා අසංවුතා අන්ධකාරා අන්ධකාරතිමිසා යත්ථපිමෙසං චන්දිමසුරියානං එවං මහිද්ධිකානං එවං මහානුභාවානං ආභා නානුභොන්ති, තත්ථපි අප්පමාණො උළාරො ඔභාසො පාතුභවති අතික්කම්මෙව දෙවානං දෙවානුභාවං. යෙපි තත්ථ සත්තා උපපන්නා, තෙපි තෙනොභාසෙන අඤ්ඤමඤ්ඤං සඤ්ජානන්ති “අඤ්ඤෙපි කිර භො සන්ති සත්තා ඉධූපපන්නා”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "තවද මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් කරුණා සහගිය සිතින් ... මුදිතා සහගිය සිතින් ... උපේක්‍ෂා සහගිය සිතින් එක් දිගක් පැහැස වෙසෙයි. එසෙයින් දෙවෙනි දිග ද එසෙයින් තෙවන දිග ද එසෙයින් සිවුවන දිග ද මෙසේ උඩ යට සරස සැම තැන සර්‍වසත්ත්‍වයන් කෙරෙහි ආත්මසමතායෙන් මුළු ලෝ විපුල වූ, මහද්ගත වූ, අප්‍රමාණ වූ, අවෛර වූ, ව්‍යාබාධ රහිත වූ, උපේක්‍ෂා සහගත සිතින් පැහැස වෙසේ. හේ එහි යම් ම රූපයෙක්, වෙදනායෙක්, සංඥායෙක්, සංස්කාරයෙක්, විඥානයෙක් වේ ද ඒ ධර්‍මයන් අනිත්‍ය විසින්, දුඃඛ විසින්, රෝග විසින්, ගණ්ඩ විසින්, ශල්‍ය විසින්, අඝ විසින්, පරායත්ත විසින්, විනාශ විසින්, ශූන්‍ය විසින්, අනාත්ම විසින් නුවණින් දක්නේ ය. හේ කාබුන් මරණින් මතු සුදවැසි දෙවියන්ගේ සහභාවයට පැමිණෙයි. මහණෙනි, මේ උපපත්තිය පුහුදුනන් හා අසාධාරණ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර පුඟුලෝ ලොව්හි විද්‍යමානයහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.3.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තථාගත අච්ඡරිය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "27. මහණෙනි, අර්‍හත් සම්‍යක් සම්බුද්ධ තථාගතයන් වහන්සේගේ පහළ වීමෙන් සතර ආශ්චර්‍ය්‍ය අද්භූත ධර්‍ම කෙනෙක් පහළ වෙත්. කවර සතර කෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් කලෙක බෝසත් තුසීදෙව්ලොවින් සැව සිහි නුවණින් යෙදී මවුකුස පිළිසිඳ ගත්තේ වේ ද, එසඳ පඤ්චකාමාවචර දෙවියන් සහිත, සවන කාමාවචර දෙවියන් සහිත බ්‍රහ්මයන් සහිත ලෝකයෙහි, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත සෙසු දෙවි මිනිසුන් සහිත සත්ත්‍වාඛ්‍යප්‍රජායෙහි දෙවියන්ගේ දේවානුභාවය ඉක්ම සිටි විපුල වූ අවහාසයෙක් පහළ වෙයි. යම් නිරයෙක මෙබඳු මහත් ඍද්ධි ඇති, මෙබඳු මහත් අනුභාව ඇති මේ සඳහිරු දෙදෙනාගේ රශ්මීහු නො වැද ගණිත් ද, වළ දොර ඇති, අසංවෘත වූ, අඳුරු වූ, ගණඳුරු ඇති (චක්‍ෂුර්විඥාන වළහන) යම් ඒ ලෝකාන්තරිකයෝ ඇද්ද, එහිදු දෙවියන්ගේ දේවානුභාවය ඉක්ම සිටි විපුල අවහාසයෙක් පහළ වේ. එහි යම් සත්ත්‍ව කෙනෙක් උපන්හු ද, ඔහුත් ඒ අවහාසයෙන් “‘භවත්නි, අන්‍ය වූත් සත්ත්‍වයෝ මෙහි පහළවූවාහු ඇති”’ යි උනුන් හඳුනා ගණිත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අර්‍හත් සම්‍යක් සම්බුද්ධ තථාගතයන් වහන්සේගේ පහළ වීමෙන් මේ පළමුවැනි ආශ්චර්‍ය්‍ය අද්භූත ධර්‍ම ය පහළ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තවද මහණෙනි, යම් කලෙක බෝසත් සිහි නුවණින් යුක්ත ව මවු කුසින් බිහි වේ ද, එසඳ පඤ්චකාමාවචර දෙවියන් සහිත, සවන කාමාවචර දෙවියන් සහිත බඹුන් සහිත ලෝකයෙහි, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත සෙසු දෙවිමිනිසුන් සහිත සත්ත්‍වාඛ්‍යප්‍රජායෙහි දෙවියන්ගේ දේවානුභාවය ඉක්ම සිටි විපුල අවහාසයෙක් පහළ වෙයි. යම් තැනෙක මෙබඳු මහත් ඍද්ධි ඇති, මෙබඳු මහත් අනුභාව ඇති, මේ සඳහිරු දෙදෙනාගේ කාන්තීහු නො වැද ගණිත් ද, එබඳු වූ වළ දොර ඇති, අසංවෘත වූ, අඳුරු වූ, ගණඳුරින් ඇස් මුවහ කළ යම් ඒ ලෝකාන්තරිකයෝ ඇද්ද, එහිදු දෙවියන්ගේ දේවානුභාව ඉක්ම සිටි විපුල අවහාසයෙක් පහළ වේ. එහි යම් සත්හු උපන්හු ද ඔහුදු ඒ අවහාසයෙන් “භවත්නි, අන්‍යවූත් සත්ත්‍වයෝ මෙහි උපන්නාහු ඇති”’ යි උනුන් හඳුනා ගණිත්.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 252,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තථාගතස්ස භික්ඛවෙ අරහතො සම්මාසම්බුද්ධස්ස පාතුභාවා අයං දුතියො අච්ඡරියො අබ්භුතො ධම්මො පාතුභවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ යදා තථාගතො අනුත්තරං සම්මාසම්බොධිං අභිසම්බුජ්ඣති, අථ සදෙවකෙ ලොකෙ සමාරකෙ සබ්රහ්මකෙ, සස්සමණබ්රාහ්මණියා පජාය සදෙවමනුස්සාය අප්පමාණො උළාරො ඔභාසො පාතුභවති අතික්කම්මෙව දෙවානං දෙවානුභාවං. යාපි තා ලොකන්තරිකා අඝා අසංවුතා අන්ධකාරා අන්ධකාරතිමිසා යත්ථපිමෙසං චන්දිමසුරියානං එවං මහිද්ධිකානං එවං මහානුභාවානං ආභා නානුභොන්ති, තත්ථපි අප්පමාණො උළාරො ඔභාසො පාතුභවති අතික්කම්මෙව දෙවානං දෙවානුභාවං. යෙපි තත්ථ සත්තා උපපන්නා තෙපි තෙනොභාසෙන අඤ්ඤමඤ්ඤං සඤ්ජානන්ති. “අඤ්ඤෙපි කිර භො සන්ති සත්තා ඉධූපපන්නා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තථාගතස්ස භික්ඛවෙ අරහතො සම්මාසම්බුද්ධස්ස පාතුභාවා අයං තතියො අච්ඡරියො අබ්භුතො ධම්මො පාතුභවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛවෙ යදා තථාගතො අනුත්තරං ධම්මචක්කං පවත්තෙති, අථ සදෙවකෙ ලොකෙ සමාරකෙ සබ්රහ්මකෙ, සස්සමණබ්රාහ්මණියා පජාය සදෙවමනුස්සාය අප්පමාණො උළාරො ඔභාසො පාතුභවති අතික්කම්මෙව දෙවානං දෙවානුභාවං. යාපි තා ලොකන්තරිකා අඝා අසංවුතා අන්ධකාරා අන්ධකාරතිමිසා යත්ථිමෙසං චන්දිමසුරියානං එවං මහිද්ධිකානං එවං මහානුභාවානං ආභා නානුභොන්ති, තත්ථපි අප්පමාණො උළාරො ඔභාසො පාතුභවති අතික්කම්මෙව දෙවානං දෙවානුභාවං. යෙපි තත්ථ සත්තා උපපන්නා තෙපි තෙනොභාසෙන අඤ්ඤමඤ්ඤං සඤ්ජානන්ති “අඤ්ඤෙපි කිර භො සන්ති සත්තා ඉධූපපන්නා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තථාගතස්ස භික්ඛවෙ අරහතො සම්මාසම්බුද්ධස්ස පාතුභාවා අයං චතුත්ථො අච්ඡරියො අබ්භුතො ධම්මො පාතුභවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තථාගතස්ස භික්ඛවෙ අරහතො සම්මාසම්බුද්ධස්ස පාතුභාවා ඉමෙ චත්තාරො අච්ඡරියා අබ්භුතා ධම්මා පාතුභවන්තීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 3. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(දුතියතථාගතච්ඡරියසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "28. තථාගතස්ස භික්ඛවෙ අරහතො සම්මාසම්බුද්ධස්ස පාතුභාවා චත්තාරො අච්ඡරියා අබ්භුතා ධම්මා පාතුභවන්ති. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ආලයාරාමා භික්ඛවෙ පජා ආලයරතා ආලයසම්මුදිතා සා තථාගතෙන අනාලයෙ ධම්මෙ දෙසියමානෙ සුස්සූසති. සොතං ඔදහති. අඤ්ඤාචිත්තං උපට්ඨාපෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තථාගතස්ස භික්ඛවෙ අරහතො සම්මාසම්බුද්ධස්ස පාතුභාවා අයං පඨමො අච්ඡරියො අබ්භුතො ධම්මො පාතුභවති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, අර්‍හත් සම්‍යක් සම්බුද්ධ තථාගතයන් වහන්සේගේ පහළ වීමෙන් මේ දෙවැනි ආශ්චර්‍ය්‍ය අද්භූත ධර්‍ම ය පහළ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තවද මහණෙනි, යම් කලෙක තථාගතයන් වහන්සේ අනුත්තර සම්‍යක් සම්බෝධිය අවබෝධ කරණ සේක් ද, එසඳ සදේවක සමාරක සබ්‍රහ්මක ලෝකයෙහි සශ්‍රමණබ්‍රාහ්මණ සදෙවමනුෂ්‍ය ප්‍රජායෙහි දෙවියන්ගේ දේවානුභාවය ඉක්ම සිටි විපුල අවහාසයෙක් පහළ වෙයි. යම් තැනෙක මෙබඳු මහත් ඍද්ධි ඇති, මෙබඳු මහත් අනුභාව ඇති, මේ සඳහිරු දෙදෙනාගේ කාන්තීහු නො වැද ගණිත් ද, එබඳු වූ වළදොර ඇති, අසංවෘත වූ, අඳුරු වූ, ගණඳුරින් ඇස් මුවහ කළ යම් ඒ ලෝකාන්තරිකයෝ ඇද්ද, එහිදු දෙවියන්ගේ දේවානුභාවය ඉක්ම සිටි විපුල අවහාසයෙක් පහළ වෙයි. එහි යම් සත්හු උපන්හු ද, ඔහුත් ඒ අවහාසයෙන් “භවත්නි, අන්‍යසත්ත්‍වයෝත් මෙහි උපන්හු ඇති”’ යි උනුන් හඳුනා ගණිත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අර්‍හත් සම්‍යක් සම්බුද්ධ තථාගතයන් වහන්සේගේ පහළ වීමෙන් මේ තෙවන ආශ්චර්‍ය්‍ය අද්භූත ධර්‍ම ය පහළ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තවද මහණෙනි, යම් කලෙක තථාගතයන් වහන්සේ අනුත්තර ධර්‍මචක්‍රය පවත්වන සේක් ද, එසඳ සදෙවක සමාරක සබ්‍රහ්මක ලොකයෙහි, සශ්‍රමණබ්‍රාහ්මණ සදෙවමනුෂ්‍ය සතත්‍වාඛ්‍ය ප්‍රජායෙහි දෙවියන්ගේ දේවානුභාවය ඉක්ම සිටි විපුල අවහාසයෙක් පහළ වෙයි. යම් තැනෙක මෙසේ මහත් ඍද්ධි ඇති, මෙසේ මහත් අනුභාව ඇති මේ සඳහිරු දෙදෙනාගේ කාන්තිහු නො වැද ගණිත් ද, වළදොර ඇති, අසංවෘත වූ, අඳුරු වූ, ගණඳුරින් මුවහ කළ ඇස් ඇති යම් ලෝකාන්තරිකයෝ ඇද්ද, එහිදු දෙවියන්ගේ දේවානුභාව ඉක්ම සිටි විපුල අවහාසයෙක් පහළ වෙයි. එහි යම් සත්ත්‍ව කෙනෙක් උපන්හු ද, ඔහුත් ඒ අවහාසයෙන් “භවත්නි, අන්‍ය වූත් සත්ත්‍වයෝ මෙහි උපන්නාහු ඇති”’ යි උනුන් හඳුනා ගණිත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අර්‍හත් සම්‍යක් සම්බුද්ධ තථාගතයන් වහන්සේගේ පහළ වීමෙන් මේ සතරවැනි ආශ්චර්‍ය්‍ය අද්භූත ධර්‍මය පහළ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අර්‍හත් සම්‍යක් සම්බුද්ධ තථාගතයන් වහන්සේගේ පහළ වීමෙන් මේ සතර ආශ්චර්‍ය්‍ය අද්භූත ධර්‍මය පහළ වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.3.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතියතථාගතඅච්ඡරිය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "28. මහණෙනි, අර්‍හත් සම්මා සම්බුද්ධ තථාගතයන් වහන්සේගේ පහළවීමෙන් මේ සතර ආශ්චර්‍ය්‍ය අද්භූත ධර්‍ම කෙනෙක් පහළ වෙත්. කවර සතර ධර්‍ම කෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ප්‍රජා තොමෝ ආලය ආරාම කොට ඇත්තී (පඤ්චකාම ගුණ) ආලයෙහි ඇලුනී වෙයි. ආලයෙහි ප්‍රමුදිත වෙයි. ඒ ප්‍රජාව තථාගතයන් වහන්සේ විසින් විවට ඇසුරු කළ අරීදහම් දෙසනු ලබන කල්හි අසනු කැමැති වෙයි. කන් රුකොට තබයි. දැනගනු පිණිස සිත එළවයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අර්‍හත් සම්මා සම්බුද්ධ තථාගතයන් වහන්සේගේ පහළවීමෙන් මේ පළමුවන ආශ්චර්‍ය්‍ය අද්භූත ධර්‍මය පහළ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 254,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "මානාරාමා භික්ඛවෙ පජා මානරතා මානසම්මුදිතා. සා තථාගතෙන මානවිනයෙ ධම්මෙ දෙසියමානෙ සුස්සූසති. සොතං ඔදහති. අඤ්ඤාචිත්තං උපට්ඨපෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තථාගතස්ස භික්ඛවෙ අරහතො සම්මාසම්බුද්ධස්ස පාතුභාවා අයං දුතියො අච්ඡරියො අබ්භුතො ධම්මො පාතුභවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අනුපසමාරාමා භික්ඛවෙ පජා අනුපසමරතා අනුපසමසම්මුදිතා. සා තථාගතෙන ඔපසමිකෙ ධම්මෙ දෙසියමානෙ සුස්සූසති. සොතං ඔදහති. අඤ්ඤා චිත්තං උපට්ඨපෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තථාගතස්ස භික්ඛවෙ අරහතො සම්මාසම්බුද්ධස්ස පාතුභාවා අයං තතියො අච්ඡරියො අබ්භුතො ධම්මො පාතුභවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අවිජ්ජාගතා භික්ඛවෙ පජා අණ්ඩභූතා{1} පරියොනද්ධා. සා තථාගතෙන අවිජ්ජාවිනයෙ ධම්මෙ දෙසියමානෙ සුස්සූසති. සොතං ඔදහති. අඤ්ඤා චිත්තං උපට්ඨපෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තථාගතස්ස භික්ඛවෙ අරහතො සම්මාසම්බුද්ධස්ස පාතුභාවා අයං චතුත්ථො අච්ඡරියො අබ්භුතො ධම්මො පාතුභවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තථාගතස්ස භික්ඛවෙ අරහතො සම්මාසම්බුද්ධස්ස පාතුභාවා ඉමෙ චත්තාරො අච්ඡරියා අබ්භුතා ධම්මා පාතුභවන්තීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 3. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ආනන්දච්ඡරියසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "29. චත්තාරොමෙ භික්ඛවෙ අච්ඡරියා අබ්භුතා ධම්මා ආනන්දෙ. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සචෙ භික්ඛවෙ භික්ඛුපරිසා ආනන්දං දස්සනාය උපසඞ්කමති, දස්සනෙන සා අත්තමනා හොති. තත්ථ චෙ ආනන්දො ධම්මං භාසති, භාසිතෙනපි සා අත්තමනා හොති. අතිත්තාව භික්ඛවෙ භික්ඛුපරිසා හොති. අථ ආනන්දො තුණ්හී භවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සචෙ භික්ඛවෙ භික්ඛුනීපරිසා ආනන්දං දස්සනාය උපසඞ්කමති, දස්සනෙනපි සා අත්තමනා හොති. තත්ථ චෙ ආනන්දො ධම්මං භාසති, භාසිතෙනපි සා අත්තමනා හොති. අතිත්තාව භික්ඛවෙ භික්ඛුනීපරිසා හොති. අථ ආනන්දො තුණ්හී භවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සචෙ භික්ඛවෙ උපාසකපරිසා ආනන්දං දස්සනාය උපසඞ්කමති, දස්සනෙනපි සා අත්තමනා හොති. තත්ථ චෙ ආනන්දො ධම්මං භාසති, භාසිතෙනපි සා අත්තමනා හොති. අතිත්තාව භික්ඛවෙ උපාසකපරිසා හොති. අථ ආනන්දො තුණ්හී භවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සචෙ භික්ඛවෙ උපාසිකාපරිසා ආනන්දං දස්සනාය උපසඞ්කමති, දස්සනෙනපි සා අත්තමනා හොති. තත්ථ චෙ ආනන්දො ධම්මං භාසති, භාසිතෙනපි සා අත්තමනා හොති. අතිත්තාව භික්ඛවෙ උපාසිකාපරිසා හොති. අථ ආනන්දො තුණ්හී භවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො අච්ඡරියා අබ්භුතා ධම්මා ආනන්දෙති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අන්ධභූතා - සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, ප්‍රජාව මානය ආරාම කොට ඇත්තී මානයෙහි ඇලුනී මානයෙහි ප්‍රමුදිත වූවා වෙයි. ඒ ප්‍රජාව තථාගතයන් වහන්සේ විසින් මානවිනයකර ධර්‍මය දෙසනු ලබන කල්හි අසනු කැමැති වෙයි. කන් රුකොට තබයි. දැනගනු පිණිස සිත් එළවයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අර්‍හත් සම්මා සම්බුද්ධ තථාගතයන් වහන්සේගේ පහළවීමෙන් මේ දෙවන ආශ්චර්‍ය්‍ය අද්භූත ධර්‍මය පහළ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ප්‍රජාව අනුපශමය ආරාම කොට ඇත්තී අනුපශමයෙහි ඇලුනී අනුපශමයෙහි ප්‍රමුදිත වෙයි. ඒ ප්‍රජාව තථාගතයන් වහන්සේ විසින් උපශමකර ධර්‍මය දෙසනු ලබන කල්හි අසනු කැමැති වෙයි. කන් රුකොට තබයි. දැනගන්නා සිත් එළවයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අර්‍හත් සම්මා සම්බුද්ධ තථාගතයන් වහන්සේගේ පහළවීමෙන් මේ තුන්වැනි ආශ්චර්‍ය්‍ය අද්භූත ධර්‍මය පහළ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ප්‍රජාව අවිද්‍යායෙන් සමන්‍වාගතය. අවිද්‍යායෙන් වළඳනා ලදුයෙන් අණ්ඩභූතය. හාත්පස වළඳනා ලදු ය. ඒ ප්‍රජාව තථාගතයන් වහන්සේ විසින් අවිද්‍යාවිනය ඇසුරු කළ ධර්‍මය දෙසනු ලබන කල්හි අසනු කැමැති වෙයි. කන් රුකොට තබයි. දැනගන්නා සිත් එළවයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අර්‍හත් සම්මා සම්බුද්ධ තථාගතයන් වහන්සේගේ පහළවීමෙන් මේ සතර වැනි ආශ්චර්‍ය්‍ය අද්භූත ධර්‍මය පහළ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අර්‍හත් සම්මා සම්බුද්ධ තථාගතයන් වහන්සේගේ පහළවීමෙන් මේ සතර ආශ්චර්‍ය්‍ය අද්භූත ධර්‍මයෝ පහළ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.3.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආනන්දච්ඡරිය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "29. මහණෙනි, ආනන්‍දයන් කෙරෙහි මේ සතර ආශ්චර්‍ය්‍ය අද්භූත ධර්‍ම කෙනෙක් ඇත. කවර සතර කෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඉදින් භික්‍ෂුපර්‍ෂද් ආනන්‍දයන් දක්නට එළඹේ ද, දැක්මෙන් ම එ පිරිස සතුටු වෙයි. ඉදින් එ පිරිස්හි ආනන්‍දයෝ දහම් දෙසත් ද, එ පිරිස භාෂිතයෙනුදු සතුටු වෙයි. මහණෙනි, භික්‍ෂුපර්‍ෂද් අතෘප්ත ම වෙයි. එසේ වත් ම ආනන්‍දයෝ නිශ්ශබ්ද වෙති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඉදින් භික්‍ෂුණීපර්‍ෂද් ආනන්‍දයන් දක්නට එළඹේ ද, දැක්මෙන් ම එ පිරිස සතුටු වෙයි. ඉදින් එ පිරිස්හි ආනන්‍දයෝ දහම් දෙසත් ද, එ පිරිස දෙසීමෙනුදු සතුටු වෙයි. මහණෙනි, භික්‍ෂුණීපර්‍ෂද් අතෘප්ත ම වෙයි. එසේ වත් ම ආනන්‍දයෝ නිශ්ශබ්ද වෙති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඉදින් උපාසකපර්‍ෂද් ආනන්‍දයන් දක්නට එළඹේ ද, දැක්මෙන් ම එ පිරිස සතුටු වෙයි. එ පිරිස්හි ඉදින් ආනන්‍දයෝ දහම් දෙසත් ද, එ පිරිස දෙසීමෙනුදු සතුටු වෙයි. මහණෙනි, උපාසකපර්‍ෂද් අතෘප්ත ම වෙයි. එසේ වත් ම ආනන්‍දයෝ නිශ්ශබ්ද වෙති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඉදින් උපාසිකාපර්‍ෂද් ආනන්‍දයන් දක්නට එළඹේ ද, දැක්මෙන් ම එ පිරිස සතුටු වෙයි. එ පිරිස්හි ඉදින් ආනන්‍දයෝ දහම් දෙසත් ද, එ පිරිස දෙසීමෙනුදු සතුටු වෙයි. මහණෙනි, උපාසිකාපර්‍ෂද් අතෘප්ත ම වෙයි. එසේ වත් ම ආනන්‍දයෝ නිශ්ශබ්ද වෙති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර ආශ්චර්‍ය්‍ය අද්භූත ධර්‍මයෝ ආනන්‍දයන් කෙරෙහි පහළ වෙති.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 256,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 3. 3. 10",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(චක්කවත්තිඅච්ඡරියසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "30. චත්තාරොමෙ භික්ඛවෙ අච්ඡරියා අබ්භුතා ධම්මා රඤ්ඤෙ චක්කවත්තිම්හි. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සචෙ භික්ඛවෙ ඛත්තියපරිසා රාජානං චක්කවත්තිං දස්සනාය උපසඞ්කමති. දස්සනෙනපි සා අත්තමනා හොති. තත්ථ{1} චෙ රාජා චක්කවත්තී භාසති, භාසිතෙනපි සා අත්තමනා හොති. අතිත්තාව භික්ඛවෙ ඛත්තියපරිසා හොති. අථ රාජා චක්කවත්තී තුණ්හී භවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සචෙ භික්ඛවෙ බ්රාහ්මණපරිසා රාජානං චක්කවත්තිං දස්සනාය උපසඞ්කමති. දස්සනෙන සා අත්තමනා හොති. තත්ථ චෙ රාජා චක්කවත්තී භාසති, භාසිතෙනපි සා අත්තමනා හොති. අතිත්තාව භික්ඛවෙ බ්රාහ්මණපරිසා හොති. අථ රාජා චක්කවත්තී තුණ්හී භවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සචෙ භික්ඛවෙ ගහපතිපරිසා රාජානං චක්කවත්තිං දස්සනාය උපසඞ්කමති. දස්සනෙනපි සා අත්තමනා හොති. තත්ථ චෙ රාජා චක්කවත්තී භාසති, භාසිතෙනපි සා අත්තමනා හොති. අතිත්තාව භික්ඛවෙ ගහපතිපරිසා හොති. අථ රාජා චක්කවත්තී තුණ්හී භවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සචෙ භික්ඛවෙ සමණපරිසා රාජානං චක්කවත්තිං දස්සනාය උපසඞ්කමති. දස්සනෙන සා අත්තමනා හොති. තත්ථ චෙ රාජා චක්කවත්තී භාසති, භාසිතෙනපි සා අත්තමනා හොති. අතිත්තාව භික්ඛවෙ සමණපරිසා හොති. අථ රාජා චක්කවත්තී තුණ්හී භවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො අච්ඡරියා අබ්භුතා ධම්මා රඤ්ඤෙ චක්කවත්තිම්හි."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ චත්තාරො අච්ඡරියා අබ්භුතා ධම්මා ආනන්දෙ. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සචෙ භික්ඛවෙ භික්ඛුපරිසා ආනන්දං දස්සනාය උපසඞ්කමති, දස්සනෙන සා අත්තමනා හොති. තත්ථ චෙ ආනන්දො ධම්මං භාසති, භාසිතෙනපි සා අත්තමනා හොති. අතිත්තාව භික්ඛවෙ භික්ඛුපරිසා හොති. අථ ආනන්දො තුණ්හී භවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සචෙ භික්ඛවෙ භික්ඛුනීපරිසා -පෙ- සචෙ භික්ඛවෙ උපාසකපරිසා -පෙ- සචෙ භික්ඛවෙ උපාසිකාපරිසා ආනන්දං දස්සනාය උපසඞ්කමති, දස්සනෙන සා අත්තමනා හොති. තත්ථ චෙ ආනන්දො ධම්මං භාසති, භාසිතෙනපි සා අත්තමනා හොති. අතිත්තාව භික්ඛවෙ උපාසිකාපරිසා හොති. අථ ආනන්දො තුණ්හී භවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො අච්ඡරියා අබ්භුතා ධම්මා ආනන්දෙති."
                    },
                    {
                        "type": "centered",
                        "text": "භයවග්ගො තතියො.{*}",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. තත්ර - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "*. තස්සුද්දානං: අත්තානුවාද ඌමී ච - ද්වෙ ච නානා ද්වෙ ච හොන්ති \nමෙත්තා ද්වෙච අච්ඡරියා - අපරා ච තථා ද්රවෙති."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.3.3.10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "චක්කවත්තිඅච්ඡරිය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "30. මහණෙනි, සක්විතිරජහු කෙරෙහි මේ සතර ආශ්චර්‍ය්‍ය අද්භූත ධර්‍ම කෙනෙක් ඇත. කවර සතර ධර්‍ම කෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඉදින් කැත්පිරිස් සක්විති රජු දක්නට එළඹේ ද, දැක්මෙන් ම එ පිරිස සතුටු වෙයි. ඉදින් එ පිරිස්හි සක්විතිරජ බෙණේ නම්, බිණීමෙනුදු එ පිරිස සතුටු වෙයි. මහණෙනි, ක්‍ෂත්‍රියපර්‍ෂද් අතෘප්ත ම වෙයි. එසේ වත් ම සක්විති රජ නිශ්ශබ්ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඉදින් බමුණුපිරිස් සක්විතිරජු දක්නට එළඹේ ද, දැක්මෙන් ම එ පිරිස සතුටු වෙයි. ඉදින් එ පිරිස්හි සක්විතිරජ ඉදින් බෙණේ නම්, බිණීමෙනුදු එ පිරිස සතුටු වෙයි. මහණෙනි, බ්‍රාහ්මණපර්‍ෂද් අතෘප්ත ම වෙයි. එසේ වත් ම සක්විති රජ නිශ්ශබ්ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඉදින් ගෙහෙවිපිරිස් සක්විතිරජු දක්නට එළඹේ ද, දැක්මෙන් ම එ පිරිස සතුටු වෙයි. එ පිරිස්හි සක්විතිරජ ඉදින් බෙණේ නම්, බිණීමෙනුදු එ පිරිස සතුටු වෙයි. මහණෙනි, ගෘහපතිපර්‍ෂද් අතෘප්ත ම වෙයි. එසේ වත් ම සක්විති රජ නිශ්ශබ්ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඉදින් මහණපිරිස් සක්විතිරජු දක්නට එළඹේ ද, දැක්මෙන් ම එ පිරිස සතුටු වෙයි. එ පිරිස්හි ඉදින් සක්විතිරජ බෙණේ නම්, බිණීමෙනුදු එ පිරිස සතුටු වෙයි. මහණෙනි, ශ්‍රමණපර්‍ෂද් අතෘප්ත ම වෙයි. එසේ වත් ම සක්විති රජ නිශ්ශබ්ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සක්විතිරජු කෙරෙහි මේ සතර ආශ්චර්‍ය්‍ය අද්භූත ධර්‍ම කෙනෙක් ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම ආනන්‍දයන් කෙරෙහි සතර ආශ්චර්‍ය්‍ය අද්භූත ධර්‍ම කෙනෙක් ඇත. කවර සතර ධර්‍ම කෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඉදින් මහණපිරිස් ආනන්‍දයන් දක්නට එළඹේ ද, දැක්මෙන් ම එ පිරිස සතුටු වෙයි. ඉදින් එ පිරිස්හි ඉදින් ආනන්‍ද යෝ දහම් දෙසත් ද, දෙසීමෙනුදු එ පිරිස සතුටු වෙයි. මහණෙනි, මහණපිරිස් අතෘප්ත ම වෙයි. එසේ වත් ම ආනන්‍දයෝ නිශ්ශබ්ද වෙති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඉදින් මෙහෙණපිරිස් ... මහණෙනි, ඉදින් උවසුපිරිස් ... මහණෙනි, ඉදින් උවැසි පිරිස් ආනන්‍දයන් දක්නට එළඹේ ද, දැක්මෙන් ම එ පිරිස සතුටු වෙයි. එ පිරිස්හි ඉදින් ආනන්‍දයෝ දහම් බෙණෙත් නම්, බිණීමෙනුදු එ පිරිස සතුටු වෙයි. මහණෙනි, උපාසිකාපර්‍ෂද් අතෘප්ත ම වෙයි. එසේ වත් ම ආනන්‍දයෝ නිශ්ශබ්ද වෙති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ආනන්‍දයන් කෙරෙහි මේ සතර ආශ්චර්‍ය්‍ය ධර්‍ම කෙනෙක් ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "භයවර්‍ගය තෙවැනි යි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 258,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "4. පුග්ගලවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 4. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සංයොජනපුග්ගලසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "(සාවත්ථිනිදානං)"
                    },
                    {
                        "type": "paragraph",
                        "text": "31. චත්තාරොමෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස ඔරම්භාගියානි සංයොජනානි අප්පහීනානි හොන්ති. උපපත්තිපටිලාභියානි සංයොජනානි අප්පහීනානි හොන්ති. භවපටිලාභියානි සංයොජනානි අප්පහීනානි හොන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස ඔරම්භාගියානි සංයොජනානි පහීනානි හොන්ති. උපපත්තිපටිලාභියානි සංයොජනානි අප්පහීණානි හොන්ති. භවපටිලාභියානි සංයොජනානි අප්පහීණානි හොන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස ඔරම්භාගියානි සංයොජනානි පහීනානි හොන්ති. උපපත්තිපටිලාභියානි සංයොජනානි පහීණානි හොන්ති. භවපටිලාභියානි සංයොජනානි අප්පහීණානි හොන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චස්ස පුග්ගලස්ස ඔරම්භාගියානි සංයොජනානි පහීනානි හොන්ති. උපපත්තිපටිලාභියානි සංයොජනානි පහීණානි හොන්ති. භවපටිලාභියානි සංයොජනානි පහීණානි හොන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමස්ස භික්ඛවෙ පුග්ගලස්ස ඔරම්භාගියානි සංයොජනානි අප්පහීණානි, උපපත්තිපටිලාභියානි සංයොජනානි අප්පහීණානි, භවපටිලාභියානි සංයොජනානි අප්පහීණානි? සකදාගාමිස්ස{1}. ඉමස්ස ඛො භික්ඛවෙ පුග්ගලස්ස ඔරම්භාගියානි සංයොජනානි අප්පහීණානි. උපපත්තිපටිලාභියානි සංයොජනානි අප්පහීණානි. භවපටිලාභියානි සංයොජනානි අප්පහීණානි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමස්ස භික්ඛවෙ පුග්ගලස්ස ඔරම්භාගියානි සංයොජනානි පහීණානි, උපපත්තිපටිලාභියානි සංයොජනානි අප්පහීණානි, භවපටිලාභියානි සංයොජනානි අප්පහීණානි? උද්ධංසොතස්ස අකනිට්ඨගාමිනො. ඉමස්ස ඛො භික්ඛවෙ පුග්ගලස්ස ඔරම්භාගියානි සංයොජනානි පහීණානි. උපපත්තිපටිලාභියානි සංයොජනානි අප්පහීණානි, භවපටිලාභියානි සංයොජනානි අප්පහීනානි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමස්ස භික්ඛවෙ පුග්ගලස්ස ඔරම්භාගියානි සංයොජනානි පහීණානි, උපපත්තිපටිලාභියානි සංයොජනානි පහීණානි, භවපටිලාභියානි සංයොජනානි අප්පහීණානි? අන්තරාපරිනිබ්බායිස්ස. ඉමස්ස ඛො භික්ඛවෙ පුග්ගලස්ස ඔරම්භාගියානි සංයොජනානි පහීණානි. උපපත්තිපටිලාභියානි සංයොජනානි පහීණානි. භවපටිලාභියානි සංයොජනානි අප්පහීණානි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සකදාගාමිකස්ස - සීමු"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "4. පුග්ගල වර්ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4.3.4.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සංයොජනපුග්ගල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "31. මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි විද්‍යමානයහ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙකුට ඔරම්භාගිය සංයොජනයෝ අප්‍රහීණ වෙත්. අනන්තරොත්පත්ති ප්‍රතිලාභයට හෙතු වූ සංයොජනයෝ අප්‍රහීණ වෙත්. උපපත්ති භවප්‍රතිලාභයට හෙතු වූ සංයොජනයෝ අප්‍රහීණ වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙකුට ඔරම්භාගිය සංයොජනයෝ ප්‍රහීණ වෙත්. අනතුරු උත්පත්තිය පිණිස හෙතු වූ සංයොජනයෝ අප්‍රහීණ වෙත්. උපපත්ති භවය පිණිස හෙතු වූ සංයොජනයෝ අප්‍රහීණ වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙලොව ඇතැම් පුද්ගලයකුට ඔරම්භාගිය සංයොජනයෝ ප්‍රහීණ වෙත්. අනන්තරොත්පත්තිප්‍රතිලාභයට හෙතු වූ සංයොජනයෝ ප්‍රහීණ වෙත්. උපපත්තිභවප්‍රතිලාභයට හෙතු වූ සංයොජනයෝ අප්‍රහීණ වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙලොව ඇතැම් පුද්ගලයකුට ඔරම්භාගිය සංයොජනයෝ ප්‍රහීණ වෙත්. අනන්තරොත්පත්තිප්‍රතිලාභයට හෙතු වූ සංයොජනයෝ ප්‍රහීණ වෙත්. උපපත්තිභවප්‍රතිලාභයට හෙතු වූ සංයොජනයෝ ප්‍රහීණ වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කවර පුද්ගලයකුට ඔරම්භාගිය සංයොජනයෝ අප්‍රහීණ වෙත් ද, අනන්තරොත්පත්තිප්‍රතිලාභයට හෙතු වූ සංයොජනයෝ අප්‍රහීණ වෙත් ද, උපපත්තිභවප්‍රතිලාභයට හෙතු වූ සංයොජනයෝ අප්‍රහීණ වෙත් ද? සකෘදාගාමීහට ය. මහණෙනි, මේ සකෘදාගාමී පුද්ගලයාහට ඔරම්භාගිය සංයොජනයෝ අප්‍රහීණ වෙත්. (ඔහුට ඉතිරි ඔරම්භාගිය සංයෝජන සඳහා කියූ සේය.) අනන්තරොත්පත්තිප්‍රතිලාභයට හෙතු වූ සංයොජනයෝ අප්‍රහීණ වෙත්. උපපත්තිභවප්‍රතිලාභයට හෙතු වූ සංයොජනයෝ අප්‍රහීණ වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කවර පුද්ගලයකුට ඔරම්භාගිය සංයොජනයෝ ප්‍රහීණ වෙත් ද? අනන්තරොත්පත්තිප්‍රතිලාභයට හෙතු වූ සංයොජනයෝ අප්‍රහීණ වෙත් ද, උපපත්තිභවප්‍රතිලාභයට හෙතු වූ සංයොජනයෝ අප්‍රහීණ වෙත් ද? උද්ධංසොත අකනිට්ඨගාමීහට ය. මහණෙනි, මේ උද්ධංසොත අකනිට්ඨගාමී පුද්ගලයාහට ඔරම්භාගිය සංයොජනයෝ ප්‍රහීණ වෙත්. අනන්තරොත්පත්තිප්‍රතිලාභයට හෙතු වූ සංයොජනයෝ අප්‍රහීණ වෙත්. උපපත්තිභවප්‍රතිලාභයට හෙතු වූ සංයොජනයෝ අප්‍රහීණ වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කවර පුද්ගලයකුට ඔරම්භාගිය සංයොජනයෝ ප්‍රහීණ වෙත් ද, අනන්තරොත්පත්තිප්‍රතිලාභයට හේතු වූ සංයොජනයෝ ප්‍රහීණ වෙත් ද, උපපත්තිභවප්‍රතිලාභයට හෙතු වූ සංයොජනයෝ අප්‍රහීණ වෙත් ද? අන්තරාපරිනිබ්බායීහට ය. මහණෙනි, මේ අන්තරාපරිනිබ්බායී පුද්ගලයාහට ඔරම්භාගිය සංයොජනයෝ ප්‍රහීණ වෙත්. අනන්තරොත්පත්තිප්‍රතිලාභයට හෙතු වූ සංයොජනයෝ ප්‍රහීණ වෙත්. උපපත්තිභවප්‍රතිලාභයට හේතු වූ සංයොජනයෝ අප්‍රහීණ වෙත්.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 260,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමස්ස භික්ඛවෙ පුග්ගලස්ස ඔරම්භාගියානි සංයොජනානි පහීණානි, උපපත්තිපටිලාභියානි සංයොජනානි පහීණානි, භවපටිලාභියානි සංයොජනානි පහීණානි? අරහතො. ඉමස්ස ඛො භික්ඛවෙ පුග්ගලස්ස ඔරම්භාගියානි සංයොජනානි පහීණානි. උපපත්තිපටිලාභියානි සංයොජනානි පහීණානි, භවපටිලාභියානි සංයොජනානි පහීණානි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 4 . 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පටිභානපුග්ගලසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "32. චත්තාරොමෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "යුත්තපටිභානො{1} න මුත්තපටිභානො, මුත්තපටිභානො න යුත්තපටිභානො, යුත්තපටිභානො ච මුත්තපටිභානො ච, නෙව යුත්තපටිභානො නෙව මුත්තපටිභානො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 4. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(නෙය්යපුග්ගලසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "33. චත්තාරොමෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො ?"
                    },
                    {
                        "type": "paragraph",
                        "text": "උග්ඝටිතඤ්ඤූ, විපචිතඤ්ඤූ, නෙය්යො, පදපරමො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 4. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ඵලුපජීවීපුග්ගලසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "34. චත්තාරොමෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "උට්ඨානඵලුපජීවී{2} න කම්මඵලුපජීවී, කම්මඵලුපජීවී න උට්ඨානඵලුපජීවී, උට්ඨානඵලුපජීවී ච කම්මඵලුපජීවී ච, නෙවුට්ඨානඵලූපජීවී නෙව කම්මඵලුපජීවී."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. යුත්තප්පටිභානො න මුත්තප්පටිභානො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. උට්ඨානඵලුපජීවී චෙව - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කවර පුද්ගලයකුට ඔරම්භාගිය සංයොජනයෝ ප්‍රහීණ වෙත් ද, අනන්තරොත්පත්තිප්‍රතිලාභයට හේතු වූ සංයොජනයෝ ප්‍රහීණ වෙත් ද, උපපත්තිභවප්‍රතිලාභයට හෙතු වූ සංයොජනයෝ ප්‍රහීණ වෙත් ද? අර්‍හත්හට ය. මහණෙනි, අර්‍හත් පුද්ගලයාහට ඔරම්භාගිය සංයොජනයෝ ප්‍රහීණ වෙත්. අනන්තරොත්පත්තිප්‍රතිලාභයට හේතු වූ සංයොජනයෝ ප්‍රහීණ වෙත්. උපපත්තිප්‍රතිලාභයට හේතු වූ සංයොජනයෝ ප්‍රහීණ වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ලෝකයෙහි මේ සතර පුද්ගලයෝ විද්‍යමානයහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.4.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පටිභානපුග්ගල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "32. මහණෙනි, ලෝකයෙහි මේ පුද්ගලයෝ සතර දෙනෙක් විද්‍යමානයහ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "අර්‍ත්‍ථයුක්තප්‍රතිභාන (වැටහීම්) ඇත්තේ, වහා අවුල් මුදා බණන ප්‍රතිභාන නැත්තේ ය. අවුල් මුදා බණන ප්‍රතිභාන ඇත්තේ, අර්‍ත්‍ථයුක්ත ප්‍රතිභාන නැත්තේ ය. අවුල් මුදා බණන ප්‍රතිභාන ද ඇත්තේ, අර්‍ථ යුක්ත ප්‍රතිභාන ද ඇත්තේ ය. අර්‍ත්‍ථයුක්ත ප්‍රතිභාන නැත්තේ අවුල් මුදා බණන ප්‍රතිභාන ද නැත්තේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ලෝකයෙහි මේ සතර පුද්ගලයෝ විද්‍යමානයහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.4.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නෙය්‍යපුග්ගල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "33. මහණෙනි, ලෝකයෙහි මේ පුද්ගලයෝ සතර දෙනෙක් විද්‍යමානයහ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "උද්ඝාටිතඥ ය, විපථතඥ ය, නෙය්‍ය ය, පදපරම යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ලොකයෙහි මේ පුද්ගලයෝ සතර දෙන විද්‍යමානයහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.4.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඵලූපජීවීපුග්ගල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "34. මහණෙනි, ලෝකයෙහි මේ පුද්ගලයෝ සතර දෙනෙක් විද්‍යමානයහ. කවර සතර දෙනෙක යත්?",
                        "type": "paragraph"
                    },
                    {
                        "text": "උට්ඨානවීර්‍ය්‍යඵලයෙන් ජීවත් වනසුලු කර්‍මඵලයෙන් ජීවත් නොවනසුලු පුද්ගල ය, කර්‍මඵලයෙන් ජීවත් වනසුලු උට්ඨානවීර්‍ය්‍යඵලයෙන් ජීවත් නොවනසුලු පුද්ගල ය, උට්ඨානවීර්‍ය්‍යඵලයෙනුදු ජීවත් වනසුලු කර්‍මඵලයෙනුදු ජීවත් වනසුලු පුද්ගල ය, උට්ඨානවීර්‍ය්‍යඵලයෙන් ජීවත් නො වනසුලු කර්‍මඵලයෙනුදු ජීවත් නොවනසුලු පුද්ගල යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ලෝකයෙහි මේ පුද්ගලයෝ සතර දෙන විද්‍යමානයහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 262,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.3.4.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(වජ්ජපුග්ගලසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "35. චත්තාරොමෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සාවජ්ජො, වජ්ජබහුලො, අප්පවජ්ජො, අනවජ්ජො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො සාවජ්ජො හොති? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො සාවජ්ජෙන කායකම්මෙන සමන්නාගතො හොති, සාවජ්ජෙන වචීකම්මෙන සමන්නාගතො හොති, සාවජ්ජෙන මනොකම්මෙන සමන්නාගතො හොති. එවං ඛො භික්ඛවෙ පුග්ගලො සාවජ්ජො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො වජ්ජබහුලො හොති? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො සාවජ්ජෙන බහුලං කායකම්මෙන සමන්නාගතො හොති, අප්පං අනවජ්ජෙන. සාවජ්ජෙන බහුලං වචීකම්මෙන සමන්නාගතො හොති, අප්පං අනවජ්ජෙන. සාවජ්ජෙන බහුලං මනොකම්මෙන සමන්නාගතො හොති, අප්පං අනවජ්ජෙන. එවං ඛො භික්ඛවෙ පුග්ගලො වජ්ජබහුලො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො අප්පවජ්ජො හොති? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො අනවජ්ජෙන බහුලං කායකම්මෙන සමන්නාගතො හොති, අප්පං සාවජ්ජෙන. අනවජ්ජෙන බහුලං වචීකම්මෙන සමන්නාගතො හොති, අප්පං සාවජ්ජෙන. අනවජ්ජෙන බහුලං මනොකම්මෙන සමන්නාගතො හොති, අප්පං සාවජ්ජෙන. එවං ඛො භික්ඛවෙ පුග්ගලො අප්පවජ්ජො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො අනවජ්ජො හොති? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො අනවජ්ජෙන කායකම්මෙන සමන්නාගතො හොති, අනවජ්ජෙන වචීකම්මෙන සමන්නාගතො හොති, අනවජ්ජෙන මනොකම්මෙන සමන්නාගතො හොති. එවං ඛො භික්ඛවෙ පුග්ගලො අනවජ්ජො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 4. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පරිපූරකාරීපුග්ගලසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "36. චත්තාරොමෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චො පුග්ගලො සීලෙසු න පරිපූරකාරී හොති, සමාධිස්මිං න පරිපූරකාරී, පඤ්ඤාය න පරිපූරකාරී. ඉධ පන භික්ඛවෙ එකච්චො පුග්ගලො සීලෙසු පරිපූරකාරී හොති, සමාධිස්මිං න පරිපූරකාරී, පඤ්ඤාය න පරිපූරකාරී. ඉධ පන භික්ඛවෙ එකච්චො පුග්ගලො සීලෙසු පරිපූරකාරී හොති, සමාධිස්මිං පරිපූරකාරී, පඤ්ඤාය න පරිපූරකාරී. ඉධ පන භික්ඛවෙ එකච්චො පුග්ගලො සීලෙසු පරිපූරකාරී හොති, සමාධිස්මිං පරිපූරකාරී, පඤ්ඤාය පරිපූරකාරී."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.3.4.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "වජ්ජපුග්ගල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "35. මහණෙනි, ලෝකයෙහි මේ පුද්ගලයෝ සතර දෙනෙක් විද්‍යමානයහ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සාවද්‍යය, වද්‍යබහුලය, අල්පවද්‍යය, අනවද්‍ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල සාවද්‍ය වේ ද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් සාවද්‍ය කායකර්‍මයෙන් සමන්‍වාගත වෙයි. සාවද්‍ය වාක්කර්‍මයෙන් සමන්‍වාගත වෙයි. සාවද්‍ය මනඃකර්‍මයෙන් සමන්‍වාගත වෙයි. මහණෙනි, මෙසේ පුද්ගල සාවද්‍ය වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල වද්‍යබහුල වේ ද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් බොහෝසෙයින් සාවද්‍ය කායකර්‍මයෙන් සමන්‍වාගත වෙයි, අනවද්‍ය කායකර්‍මයෙන් අල්ප කොට ය. බොහෝසෙයින් සාවද්‍ය වාක්කර්‍මයෙන් සමන්‍වාගත වෙයි, අනවද්‍ය වාක්කර්‍මයෙන් අල්ප කොට ය. බොහෝසෙයින් සාවද්‍ය මනඃකර්‍මයෙන් සමන්‍වාගත වෙයි, අනවද්‍ය මනඃකර්‍මයෙන් අල්පකොට ය. මහණෙනි, මෙසේ පුද්ගල වද්‍යබහුල වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල අල්පවද්‍ය වේ ද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් අනවද්‍ය කායකර්‍මයෙන් බහුලකොට සමන්‍වාගත වෙයි. සාවද්‍ය කායකර්‍මයෙන් අල්ප කොට ය. අනවද්‍ය වාක්කර්‍මයෙන් බහුල කොට සමන්‍වාගත වෙයි. සාවද්‍ය වාක්කර්‍මයෙන් අල්ප කොට ය. අනවද්‍ය මනඃකර්‍මයෙන් බහුල කොට සමන්‍වාගත වෙයි. සාවද්‍ය මනඃකර්‍මයෙන් අල්ප කොට ය. මහණෙනි, මෙසේ පුද්ගල අල්පවද්‍ය වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල අනවද්‍ය වේ ද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් අනවද්‍ය කායකර්‍මයෙන් සමන්‍වාගත වෙයි. අනවද්‍ය වාක්කර්‍මයෙන් සමන්‍වාගත වෙයි. අනවද්‍ය මනඃකර්‍මයෙන් සමන්‍වාගත වෙයි. මහණෙනි, මෙසේ පුද්ගල අනවද්‍ය වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර පුද්ගලයෝ ලෝකයෙහි විද්‍යමානයහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.4.6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරිපූරකාරීපුග්ගල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "36. මහණෙනි, ලෝකයෙහි මේ පුද්ගලයෝ සතර දෙනෙක් විද්‍යමානයහ. කවර සතර දෙනෙක යත්?",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් ශීලයෙහි පරිපූරකාරී නො වේ. සමාධියෙහි පරිපූරකාරී නො වේ. ප්‍රඥායෙහි පරිපූරකාරී නො වේ. මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් ශීලයෙහි පරිපූරකාරී වේ. සමාධියෙහි පරිපූරකාරී නො වේ. ප්‍රඥායෙහි පරිපූරකාරී නො වේ. මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් ශීලයෙහි පරිපූරකාරී වේ. සමාධියෙහි පරිපූරකාරී වේ. ප්‍රඥායෙහි පරිපූරකාරී නො වේ. මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් ශීලයෙහි පරිපූරකාරී වේ. සමාධියෙහි පරිපූරකාරී වේ. ප්‍රඥායෙහි පරිපූරකාරී වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර පුද්ගලයෝ ලෝකයෙහි විද්‍යමානයහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 264,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 3. 4. 7",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ගරුපුග්ගලසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "37. චත්තාරොමෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චො පුග්ගලො න සීලගරු හොති න සීලාධිපතෙය්යො. න සමාධිගරු හොති න සමාධාධිපතෙය්යො. න පඤ්ඤාගරු හොති න පඤ්ඤාධිපතෙය්යො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො පුග්ගලො සීලගරු හොති සීලාධිපතෙය්යා. න සමාධිගරු හොති න සමාධාධිපතෙය්යො. න පඤ්ඤාගරු හොති න පඤ්ඤාධිපතෙය්යො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො පුග්ගලො සීලගරු හොති සීලාධිපතෙය්යො, සමාධිගරු හොති සමාධාධිපතෙය්යො, න පඤ්ඤාගරු හොති න පඤ්ඤාධිපතෙය්යො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො පුග්ගලො සීලගරු හොති සීලාධිපතෙය්යො, සමාධිගරු හොති සමාධාධිපතෙය්යො, පඤ්ඤාගරු හොති පඤ්ඤාධිපතෙය්යො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 4. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(නිකට්ඨපුග්ගලසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "38. චත්තාරොමෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "නිකට්ඨකායො අනිකට්ඨචිත්තො. අනිකට්ඨකායො නිකට්ඨචිත්තො. අනිකට්ඨකායො ච අනිකට්ඨචිත්තො ච. නිකට්ඨකායො ච නිකට්ඨචිත්තො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො නිකට්ඨකායො හොති අනිකට්ඨචිත්තො? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො අරඤ්ඤෙ වනපත්ථානි{1} පන්තානි සෙනාසනානි පටිසෙවති. සො තත්ථ කාමවිතක්කම්පි විතක්කෙති, ව්යාපාදවිතක්කම්පි විතක්කෙති, විහිංසාවිතක්කම්පි විතක්කෙති. එවං ඛො භික්ඛවෙ පුග්ගලො නිකට්ඨකායො හොති අනිකට්ඨචිත්තො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො අනිකට්ඨකායො හොති නිකට්ඨචිත්තො: ඉධ භික්ඛවෙ එකච්චො පුග්ගලො නහෙව ඛො අරඤ්ඤෙ වනපත්ථානි පන්තානි සෙනාසනානි පටිසෙවති. සො තත්ථ නෙක්ඛම්මවිතක්කම්පි විතක්කෙති අබ්යාපාදවිතක්කම්පි විතක්කෙති, අවිහිංසාවිතක්කම්පි විතක්කෙති. එවං ඛො භික්ඛවෙ පුග්ගලො අනිකට්ඨකායො හොති නිකට්ඨචිත්තො."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අරඤ්ඤවනපත්ථානි, මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.3.4.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ගරුපුග්ගල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "37. මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි විද්‍යමානයහ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් ශීලගරුක නො වේ, ශීලය අධිපති කොට ඇත්තේ ද නො වේ. සමාධිගරුක නො වේ. සමාධිය අධිපති කොට ඇත්තේ ද නො වේ. ප්‍රඥාගරුක නො වේ. ප්‍රඥාව අධිපති කොට ඇත්තේ ද නො වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් ශීලගරුක වේ, ශීලය අධිපති කොට ඇත්තේ ද වේ. සමාධිගරුක නො වේ. සමාධිය අධිපති කොට ඇත්තේ ද නො වේ. ප්‍රඥාගරුක නො වේ. ප්‍රඥාව අධිපති කොට ඇත්තේ ද නො වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් ශීලගරුක වේ, ශීලය අධිපති කොට ඇත්තේ වේ. සමාධිගරුක වේ, සමාධිය අධිපති කොට ඇත්තේ ද වේ. ප්‍රඥාගරුක නො වේ. ප්‍රඥාව අධිපතිකොට ඇත්තේ ද නො වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් ශීලගරුක වේ, ශීලය අධිපති කොට ඇත්තේ වේ. සමාධිගරුක වේ. සමාධිය අධිපති කොට ඇත්තේ වේ. ප්‍රඥාගරුක වේ. ප්‍රඥාව අධිපතිකොට ඇත්තේ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි විද්‍යමානයහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.4.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නිකට්ඨපුග්ගල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "38. මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි විද්‍යමානයහ. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "(වෙනෙන්) ඇද ගත් කය ඇත්තේ (වනයට) වැද ගත් සිත් ඇත්තේ ය. වැද ගත් කය ඇත්තේ ඇද ගත් සිත් ඇත්තේ ය. වැද ගත් කය ඇත්තේ වැද ගත් සිත් ද ඇත්තේ ය. ඇද ගත් කය ඇත්තේ ඇද ගත් සිත් ද ඇත්තේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල ඇද ගත් කය ඇත්තේ වැද ගත් සිත් ඇත්තේ වේ ද? මහණෙනි, මෙලොව ඇතැම් පුල්ගලයෙක් අරණ්‍ය සෙනසුන් ද, වානප්‍රස්ථයන් ද, ගැඹුරු වල් සෙනසුන් ද, සෙවුනේ ය. හේ එහි ලා කාමවිතර්‍කය ද විතර්‍කණය කෙරේ. ව්‍යාපාදවිතර්‍කය ද විතර්‍කණය කෙරේ. විහිංසාවිතර්‍කය ද විතර්‍කණය කෙරේ. මහණෙනි, මෙසේ පුද්ගල ඇදගත්, කය ඇත්තේ වැද ගත් සිත් ඇත්තේ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල වැද ගත් කය ඇත්තේ ඇද ගත් සිත් ඇත්තේ වේ ද? මහණෙනි, මෙලොව ඇතැම් පුල්ගලයෙක් අරණ්‍යයන් ද, වානප්‍රස්ථයන් ද, ගැඹුරු වල් සෙනසුන් ද නො ම සෙවුනේ ය. හේ එහි නෙක්ඛම්ම විතර්‍කය ද, විතර්‍කණය කෙරෙයි, අව්‍යාපාද විතර්‍කය ද විතර්‍කණය කෙරෙයි, අවිහිංසා විතර්‍කය ද විතර්‍කණය කෙරෙයි. මහණෙනි, මෙසේ පුද්ගල වැද ගත් කය ඇත්තේ ඇද ගත් සිත් ඇත්තේ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 266,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො අනිකට්ඨකායො ච හොති අනිකට්ඨචිත්තො ච? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො න හෙව ඛො අරඤ්ඤෙ වනපත්ථානි{1} පන්තානි සෙනාසනානි පටිසෙවති. සො තත්ථ කාමවිතක්කම්පි විතක්කෙති, බ්යාපාදවිතක්කම්පි විතක්කෙති, විහිංසාවිතක්කම්පි විතක්කෙති. එවං ඛො භික්ඛවෙ පුග්ගලො අනිකට්ඨකායො ච හොති අනිකට්ඨචිත්තො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො නිකට්ඨකායො ච හොති නිකට්ඨචිත්තො ච? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො අරඤ්ඤෙ වනපත්ථානි පන්තානි සෙනාසනානි පටිසෙවති. සො තත්ථ නෙක්ඛම්මවිතක්කම්පි විතක්කෙති, අබ්යාපාදවිතක්කම්පි විතක්කෙති, අවිහිංසාවිතක්කම්පි විතක්කෙති. එවං ඛො භික්ඛවෙ පුග්ගලො නිකට්ඨකායො ච හොති නිකට්ඨචිත්තො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 4. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ධම්මකථිකසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "39. චත්තාරොමෙ භික්ඛවෙ ධම්මකථිකා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චො ධම්මකථිකො අප්පං ච භාසති අසහිතඤ්ච. පරිසා ච{2} න කුසලා හොති සහිතාසහිතස්ස. එවරූපො භික්ඛවෙ ධම්මකථිකො එවරූපාය පරිසාය ධම්මකථිකොත්වෙව සඞ්ඛං ගච්ඡති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො ධම්මකථිකො අප්පඤ්ච භාසති සහිතඤ්ච, පරිසා ච කුසලා හොති සහිතාසහිතස්ස. එවරූපො භික්ඛවෙ ධම්මකථිකො එවරූපාය පරිසාය ධම්මකථිකොත්වෙව සඞ්ඛං ගච්ඡති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො ධම්මකථිකො බහුඤ්ච භාසති අසහිතඤ්ච. පරිසා ච න කුසලා හොති සහිතාසහිතස්ස. එවරූපො භික්ඛවෙ ධම්මකථිකො එවරූපාය පරිසාය ධම්මකථිකොත්වෙව සඞ්ඛං ගච්ඡති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො ධම්මකථිකො බහුඤ්ච භාසති සහිතඤ්ච. පරිසා ච{2} කුසලා හොති සහිතාසහිතස්ස. එවරූපො භික්ඛවෙ ධම්මකථිකො එවරූපාය පරිසාය ධම්මකථිකොත්වෙව සඞ්ඛං ගච්ඡති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො ධම්මකථිකාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අරඤ්ඤවනපත්ථානි - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. පරිසාචස්ස - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල වැද ගත් කය ඇත්තේ වැද ගත් සිත් ද ඇත්තේ වේ ද? මහණෙනි, මෙලොව ඇතැම් පුල්ගලයෙක් අරණ්‍යයන් ද, වානප්‍රස්ථයන් ද, ගැඹුරු වන සෙනසුන් ද නොම සෙවුනේ ය. හේ එහි කාමවිතර්‍කය ද විතර්‍කණය කෙරෙයි. ව්‍යාපාදවිතර්‍කණය ද විතර්‍කණය කෙරෙයි. විහිංසාවිතර්‍කය ද විතර්‍කණය කෙරෙයි. මහණෙනි, මෙසේ පුද්ගල වැද ගත් කය ඇත්තේ වැද ගත් සිත් ද ඇත්තේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල ඇද ගත් කය ඇත්තේ ඇද ගත් සිත් ඇත්තේ වේ ද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් අරණ්‍යයන් ද, වානප්‍රස්ථයන් ද, ගැඹුරු වන සෙනසුන් ද සෙවුනේ ය. හේ එහි නෙක්ඛම්මවිතර්‍කය ද විතර්‍කණය කෙරේ. අව්‍යාපාදවිතර්‍කය ද විතර්‍කණය කෙරේ. අවිහිංසාවිතර්‍කය ද විතර්‍කණය කෙරේ. මහණෙනි, මෙසේ පුද්ගල ඇද ගත් කය ඇත්තේ ඇද ගත් සිත් ඇත්තේ ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පුද්ගලයෝ සතර දෙන ලෝකයෙහි විද්‍යමානයහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.4.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ධම්මකථික සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "39. මහණෙනි. මේ ධර්‍මකථිකයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙලොව ඇතැම් ධර්‍මකථිකයෙක් අල්ප කොට ද අර්‍ත්‍ථයෙන් අසංයුක්ත කොට ද බෙණේ. පිරිස ද අර්‍ත්‍ථනිඃශ්‍රිත වූ හෝ අනිඃශ්‍රිත වූ හෝ බසට අදක්‍ෂ වේ. මහණෙනි, මෙබඳු ධර්‍මකථික මෙබඳු අදක්‍ෂ පිරිසෙහි “ධර්‍මකථිකයෙක් ම ය” යි ගණයට යේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙලොව ඇතැම් ධර්‍මකථිකයෙක් අල්ප කොට ද අර්ථ සංයුක්ත කොට ද බෙණේ. පිරිස ද අර්‍ත්‍ථනිඃශ්‍රිත වූ හෝ අනිඃශ්‍රිත වූ බසට දක්‍ෂ වේ. මහණෙනි, මෙබඳු ධර්‍මකථික මෙබඳු දක්‍ෂපිරිසෙහි “ධර්‍මකථිකයෙක් ම ය” යි ගණයට යේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙලොව ඇතැම් ධර්‍මකථිකයෙක් බොහෝ කොට ද අර්‍ත්‍ථයෙන් අසංයුක්ත කොට ද බෙණේ. පිරිස ද අර්‍ත්‍ථනිඃශ්‍රිත වූ හෝ අනිඃශ්‍රිත වූ බසට දක්‍ෂ නො වේ. මහණෙනි, මෙබඳු ධර්‍මකථික මෙබඳු අදක්‍ෂ පිරිසෙහි ‘ධර්‍මකථිකයෙක් ම ය’යි ගණයට යේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙලොව ඇතැම් ධර්‍මකථිකයෙක් බොහෝ කොට ද අර්ථ සංයුක්ත කොට ද බෙණේ. පිරිස ද අර්‍ත්‍ථනිඃශ්‍රිත වූ හෝ අනිඃශ්‍රිත වූ බසට දක්‍ෂ වේ. මහණෙනි, මෙබඳු ධර්‍මකථික මෙබඳු දක්‍ෂ පිරිසෙහි “ධර්‍මකථිකයෙක් ම ය” යි ගණයට යේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර ධර්‍මකථිකයෝ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 268,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 3. 4. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(වාදීසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "40. චත්තාරොමෙ භික්ඛවෙ වාදී. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි භික්ඛවෙ වාදී අත්ථතො පරියාදානං ගච්ඡති නො ව්යඤ්ජනතො. අත්ථි භික්ඛවෙ වාදී ව්යඤ්ජනතො පරියාදානං ගච්ඡති නො අත්ථතො. අත්ථි භික්ඛවෙ වාදී අත්ථතො ච ව්යඤ්ජනතො ච පරියාදානං ගච්ඡති. අත්ථි භික්ඛවෙ වාදී නෙවත්ථතො නො ව්යඤ්ජනතො පරියාදානං ගච්ඡති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො වාදී. අට්ඨානමෙතං භික්ඛවෙ අනවකාසො, යං චතූහි පටිසම්භිදාහි සමන්නාගතො භික්ඛු අත්ථතො ච ව්යඤ්ජනතො ච පරියාදානං ගච්ඡෙය්යාති."
                    },
                    {
                        "type": "centered",
                        "text": "පුග්ගලවග්ගො චතුත්ථො.{*}",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "5. ආභාවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 5. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ආභාසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "(සාවත්ථිනාදානං)"
                    },
                    {
                        "type": "paragraph",
                        "text": "41. චතස්සො ඉමා භික්ඛවෙ ආභා. කතමා චතස්සො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "චන්දාභා, සූරියාභා, අග්ගාභා, පඤ්ඤාභා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමා ඛො භික්ඛවෙ චතස්සො ආභා. එතදග්ගං භික්ඛවෙ ඉමාසං චතස්සන්නං ආභානං යදිදං පඤ්ඤාභාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 5. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පභාසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "42. චතස්සො ඉමා භික්ඛවෙ පභා. කතමා චතස්සො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "චන්දප්පභා, සුරියප්පභා, අග්ගිප්පභා, පඤ්ඤාපභා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමා ඛො භික්ඛවෙ චතස්සො පභා. එතදග්ගං භික්ඛවෙ ඉමාසං චතස්සන්නං පභානං යදිදං පඤ්ඤාපභාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "*. තස්සුද්දානං : සඤ්ඤොජනං පටිභානො - උග්ඝටිතඤ්ඤූ උට්ඨානං \nසාවජ්ජො ද්වෙ ච සීලානි - නිකට්ඨ ධම්මවාදී චාති - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.3.4.10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "වාදී සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "40. මහණෙනි, මේ වාදීහු සතර දෙනෙකි. කවර සතර දෙනෙක යත්?",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අර්ථ විසින් අවසන් කොට ගැණුමට යන ව්‍යඤ්ජන විසින් නොයන වාදී කෙනෙක් ඇත. මහණෙනි, ව්‍යඤ්ජන විසින් පරික්‍ෂයට යන අර්ථ විසින් නොයන වාදී කෙනෙක් ඇත. මහණෙනි, අර්ථ විසිනුදු ව්‍යඤ්ජන විසිනුදු පරික්‍ෂයට යන වාදී කෙනෙක් ඇත. මහණෙනි, අර්ථ විසිනුදු ව්‍යඤ්ජන විසිනුදු පරික්‍ෂයට නොයන වාදී කෙනෙක් ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ වාදීහු සතර දෙන යැ. මහණෙනි, සිවුපිළිසැඹියායෙන් සමන්වාගත මහණ අර්ථ විසිනුත් ව්‍යඤ්ජන විසිනුත් පරික්‍ෂයට යේ ය යන තෙල වන්නට අකාරණ ය, අනවකාශ ය. (නො යන්නේ ම ය.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "පුද්ගලවර්‍ගය සිවුවැනි යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "5. ආභා වර්ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "4.3.5.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආභා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "(සැවැත්නිදානයි)",
                        "type": "unindented"
                    },
                    {
                        "text": "41. මහණෙනි, මේ ආභාවෝ (විහිදෙන රශ්මීහු) සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "චන්‍ද්‍රාභා ය, සූර්‍ය්‍යාභා ය, අග්න්‍යාභා ය, ප්‍රඥාභා යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ ආභාවෝ සතර දෙන වෙති. මහණෙනි, මේ සතර ආභාවන් කෙරෙහි ප්‍රඥාභායෙක් ඇද්ද, තෙල අග්‍ර යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.5.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පභා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "42. මහණෙනි, මේ ප්‍රභාවෝ (දීප්ත රශ්මිහු) සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "චන්‍ද්‍රප්‍රභා ය, සූර්‍ය්‍යප්‍රභා ය, අග්නිප්‍රභා ය, ප්‍රඥාප්‍රභා යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ ප්‍රභාවෝ සතර දෙන වෙති. මහණෙනි, මේ සතර ප්‍රභාවන් කෙරෙහි ප්‍රඥාප්‍රභායෙක් ඇද්ද, තෙල අග්‍ර යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 270,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 3. 5. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ආලොකසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "43. චත්තාරොමෙ භික්ඛවෙ ආලොකා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "චන්දාලොකො, සුරියාලොකො, අග්ගාලොකො, පඤ්ඤාලොකො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො ආලොකා. එතදග්ගං භික්ඛවෙ ඉමෙසං චතුන්නං ආලොකානං යදිදං පඤ්ඤාලොකොති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 5. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ඔභාසසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "44. චත්තාරොමෙ භික්ඛවෙ ඔභාසා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "චන්දොභාසො, සුරියොභාසො, අග්ගොභාසො, පඤ්ඤොභාසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො ඔභාසා. එතදග්ගං භික්ඛවෙ ඉමෙසං චතුන්නං ඔභාසානං යදිදං පඤ්ඤොභාසොති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 5. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පජ්ජොතසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "45. චත්තාරොමෙ භික්ඛවෙ පජ්ජොතා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "චන්දපජ්ජොතො, සුරියපජ්ජොතො, අග්ගිපජ්ජොතො, පඤ්ඤාපජ්ජොතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො පජ්ජොතා. එතදග්ගං භික්ඛවෙ ඉමෙසං චතුන්නං පජ්ජොතානං යදිදං පඤ්ඤාපජ්ජොතොති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 5. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(කාලසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "46. චත්තාරොමෙ භික්ඛවෙ කාලා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "කාලෙන ධම්මස්සවණං, කාලෙන ධම්මසාකච්ඡා, කාලෙන සමථො, කාලෙන විපස්සනා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො කාලාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.3.5.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආලොක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "43. මහණෙනි, මේ ආලොකයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "චන්‍ද්‍රාලොක ය, සූර්‍ය්‍යාලොක ය, අගන්‍යාලොක ය, ප්‍රඥාලොක යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "මහණෙනි, මේ ආලොකයෝ සතර දෙන වෙති. මහණෙනි, මේ සතර ආලොකයන් කෙරෙහි ප්‍රඥාලොකයෙක් ඇද්ද, තෙල අග්‍ර යි."
                    },
                    {
                        "type": "centered",
                        "text": "4.3.5.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඔභාස සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "44. මහණෙනි, මේ අවභාසයෝ (බබලන්නෝ) සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "චන්‍ද්‍රාවභාස ය, සූර්‍ය්‍යාවභාස ය, අගන්‍යවභාස ය, ප්‍රඥාවභාස යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ අවභාසයෝ සතර දෙන වෙති. මහණෙනි, මේ සතර අවභාසයන් කෙරෙහි ප්‍රඥාවභාසයෙක් ඇද්ද, තෙල අග්‍රයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.5.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පජ්ජොත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "45. මහණෙනි, මේ ප්‍රද්‍යොතයෝ (ප්‍රභාස්වරයෝ) සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "චන්‍ද්‍රප්‍රද්‍යොත ය, සූර්‍ය්‍යප්‍රද්‍යොත ය, අගනිප්‍රද්‍යොත ය, ප්‍රඥාප්‍රද්‍යොත යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "මහණෙනි, මේ ප්‍රද්‍යොතයෝ සතර දෙන වෙති. මහණෙනි, මේ සතර ප්‍රද්‍යොතයන් කෙරෙහි ප්‍රඥාප්‍රද්‍යොතයෙක් ඇද්ද, තෙල අග්‍ර යි."
                    },
                    {
                        "type": "centered",
                        "text": "4.3.5.6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කාල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "46. මහණෙනි, මේ කාලයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නිසි කාලයෙහි ධර්‍මශ්‍රවණ ය, නිසි කාලයෙහි ධර්‍මසාකච්ඡා ය, නිසි කාලයෙහි සමථ ය, නිසි කාලයෙහි විදර්‍ශනා යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ කාලයෝ සතර දෙන වෙති.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 272,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 3. 5. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(දුතියකාලසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "47. චත්තාරොමෙ භික්ඛවෙ කාලා සම්මා භාවියමානා සම්මා අනුපරිවත්තියමානා අනුපුබ්බෙන ආසවානං ඛයං පාපෙන්ති. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "කාලෙන ධම්මසවණං, කාලෙන ධම්මසාකච්ඡා, කාලෙන සමථො,{1} කාලෙන විපස්සනා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො කාලා සම්මා භාවියමානා සම්මා අනුපරිවත්තියමානා අනුපුබ්බෙන ආසවානං ඛයං පාපෙන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යාථාපි භික්ඛවෙ උපරිපබ්බතෙ ථුල්ලඵුසිතකෙ දෙවෙ වස්සන්තෙ තං උදකං යථානින්නං පවත්තමානං පබ්බතකන්දරපදරසාඛා පරිපූරෙති. පබ්බතකන්දරපදරසාඛා පරිපූරා කුස්සුබ්භෙ{2} පරිපූරෙන්ති. කුස්සුබ්භා{2} පරිපූරා මහාසොබ්භෙ පරිපූරෙන්ති. මහාසොබ්භා පරිපූරා කුන්නදියො පරිපූරෙන්ති. කුන්නදියො පරිපූරා මහානදියො පරිපූරෙන්ති. මහානදියො පරිපූරා සමුද්දං{4} සාගරං පරිපූරෙන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ ඉමෙ චත්තාරො කාලා සම්මා භාවියමානා සම්මා අනුපරිවත්තියමානා අනුපුබ්බෙන ආසවානං ඛයං පාපෙන්තීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 5. 8",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(වචීදුච්චරිතසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "48. චත්තාරිමානි භික්ඛවෙ වචීදුච්චරිතානි. කතමානි චත්තාරි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "මුසාවාදො, පිසුනාවාචා, ඵරුසාවාචා, සම්ඵප්පලාපො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ චත්තාරි වචීදුච්චරිතානි."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 5. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(වචීසුචරිතසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "49. චත්තාරිමානි භික්ඛවෙ වචීසුචරිතානි. කතමානි චත්තාරි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සච්චවාචා, අපිසුනවාචා{5}, සණ්හවාචා{5}, මන්තාභාසා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ චත්තාරි වචීසුචරිතානීති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 3. 5. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සාරසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "50. චත්තාරොමෙ භික්ඛවෙ සාරා. කතමෙ චත්තාරො?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සීලසාරො, සමාධිසාරො, පඤ්ඤාසාරො, විමුත්තිසාරො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ චත්තාරො සාරාති."
                    },
                    {
                        "type": "centered",
                        "text": "ආභාවග්ගො පඤ්චමො.{*}",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "තතියො පණ්ණාසකො.",
                        "level": 2
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සම්මසනා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. කුසොබ්භෙ - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. සමුද්ද සාගරං - ස්යා. - කං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. අපිසුනාවාචා, සණ්හාවාචා."
                    },
                    {
                        "type": "footnote",
                        "text": "*. තස්සුද්දානං : ආභා පභා ච ආලොකං - ඔභාසා චෙව පජ්ජොතා \nද්වෙ කාලා චරිතා ද්වෙ ච - හොන්ති සාරෙන තෙ දසාති - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.3.5.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතියකාල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "47. මහණෙනි, මේ කාලයෝ (කුශල ධර්‍මයෝ) සතර දෙනෙක් මොනොවට වඩනු ලබන්නාහු මැනවින් වටාලා කරණු ලබන්නාහු ක්‍රමයෙන් ආස්‍රවක්‍ෂයට පමුණුවත්. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නිසි කාලයෙහි ධර්‍මශ්‍රවණ ය, නිසි කාලයෙහි ධර්‍මසාකච්ඡා ය, නිසි කාලයෙහි සමථ ය, නිසි කාලයෙහි විදර්‍ශනා යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ කුශල ධර්‍මයෝ සතර දෙනා මැනවින් වඩනු ලබන්නාහු, මැනවින් වටාලා කරණු ලබන්නාහු පිළිවෙළින් අර්‍හත්ත්‍වයට පමුණුවත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් පරිදි පර්‍වතය මත දළ බිඳු ඇති වැසි වසිත් ම ඒ දිය වළ තැන් තුබූ සැටියෙන් වැටෙමින් පවුකඳුරු පැළිවළන් පුරවයි. පිරීසිටි පවු කඳුරු පැළිවළඳහු කුඩා හෙබහු පුරවත්. පරිපූර්‍ණ කුඩා හෙබහු මහහෙබ පුරවත්. පිරුණු මහහෙබහු කුඩා ගං හෝ පුරවත්. පිරුණු කුඩා ගං හෝ මහනදීන් පුරවත්. පිරුණු මහානදීහු සමුද්‍රසාගරය පුරවත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එ පරිදි ඒ මේ සතර කුසලධර්‍මයෝ මැනැවින් වඩනු ලබන්නාහු, මැනැවින් වටාලා කරණු ලබන්නාහු පිළිවෙළින් අර්‍හත්ත්‍වයට පමුණුවත්.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.5.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "වචීදුච්චරිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "48. මහණෙනි, මේ වාග්දුශ්චරිතයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මෘෂාවාද ය, පිශුනවාක්‍ය ය, පරුෂවාක්‍ය ය, සම්ඵප්‍රලාප යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර වාග්දුශ්චරිතයෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.5.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "වචීසුචරිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "49. මහණෙනි, මේ සතර වාක්සුචරිතයෝ යි. කවර සතරහ යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සත්‍යවචන ය, අපිශුනවචන ය, මොළොක් වචන ය, නුවණින් පිරිසිඳ කළ කථා යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර වාග්සුචරිතයෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4.3.5.10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සාර සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "50. මහණෙනි, මේ සාරයෝ සතර දෙනෙකි. කවර සතර දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ශිලසාර ය, සමාධිසාර ය, ප්‍රඥාසාර ය, විමුක්තිසාර යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සතර සාරයෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආභාවර්‍ගය පස්වැනි යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "තෙවන පණ්ණාසකය යි.",
                        "type": "centered",
                        "level": 2
                    }
                ],
                "footnotes": []
            }
        }
    ]
}