{
    "filename": "an-5-3",
    "bookId": 24,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 202,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. තතියං පණ්ණාසකං",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. ඵාසුවිහාර වග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 1. 1",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සෙඛවෙසාරජ්ජසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "1. පඤ්චිමෙ භික්ඛවෙ සෙඛවෙසාරජ්ජකරණා ධම්මා. කතමෙ පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු සද්ධො හොති, සීලවා හොති, බහුස්සුතො හොති, ආරද්ධවිරියො හොති, පඤ්ඤවා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යං ඛො භික්ඛවෙ{1} අස්සද්ධස්ස සාරජ්ජං හොති, සද්ධස්ස තං සාරජ්ජං න හොති. තස්මායං ධම්මො සෙඛවෙසාරජ්ජකරණො."
                    },
                    {
                        "type": "paragraph",
                        "text": "යං භික්ඛවෙ දුස්සීලස්ස සාරජ්ජං හොති, සීලවතො තං සාරජ්ජං න හොති. තස්මායං ධම්මො සෙඛවෙසාරජ්ජකරණො."
                    },
                    {
                        "type": "paragraph",
                        "text": "යං භික්ඛවෙ අප්පස්සුතස්ස සාරජ්ජං හොති, බහුස්සුතස්ස තං සාරජ්ජං න හොති. තස්මායං ධම්මො සෙඛවෙසාරජ්ජකරණො."
                    },
                    {
                        "type": "paragraph",
                        "text": "යං භික්ඛවෙ කුසීතස්ස සාරජ්ජං හොති, ආරද්ධවිරියස්ස තං සාරජ්ජං න හොති. තස්මායං ධම්මො සෙඛවෙසාරජ්ජකරණො."
                    },
                    {
                        "type": "paragraph",
                        "text": "යං භික්ඛවෙ දුප්පඤ්ඤස්ස සාරජ්ජං හොති, පඤ්ඤවතො තං සාරජ්ජං න හොති. තස්මායං ධම්මො සෙඛවෙසාරජ්ජකරණො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ පඤ්ච සෙඛවෙසාරජ්ජකරණා ධම්මාති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 1. 2",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සඞ්කිතසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "2. පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො භික්ඛු උස්සඞ්කිතපරිසඞ්කිතො හොති, පාපභික්ඛූති අපි අකුප්පධම්මො. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු වෙසියගොචරො{2} වා හොති, විධවගොචරොවා හොති, ථුල්ලකුමාරිගොචරො{3}වා හොති, පණ්ඩකගොචරො වා හොති. භික්ඛුනී ගොචරො වා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු උස්සඞ්කිත පරිසඞ්කිතො හොති පාපභික්ඛූති අපි අකුප්පධම්මොති.{4}"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. යං භික්ඛවෙ - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. වෙසියාගොචරො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ථුල්ලකුමාරිකා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. අකුප්පධම්මොපි - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "3. තෙවැනි පණ්ණාසකය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. ඵාසු විහාර වර්ගය",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "5.3.1.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සෙඛවෙසාරජ්ජ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "1. මහණෙනි, ශෛක්ෂයාගේ වෙසරද බව කරණ මේ ධර්ම පසෙකි. කවර පසෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ ශ්‍රද්ධා ඇතියේ වෙයි, සිල් ඇතියේ වෙයි, බහුශ්‍රැත වෙයි, රුකුළු වැර ඇතියේ වෙයි, පැණැතියේ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ශ්‍රද්ධා නැතියහට යම් ශාරද්‍යයෙක් (දොම්නසෙක්) වේ නම්, ශ්‍රද්ධා ඇතියහුට ඒ ශාරද්‍යය නො වෙයි. එහෙයින් මෙ දහම සෙඛවෙසාරජ්ජකරණ යි. (ශෛක්ෂපුද්ගලයාගේ විශාරදභාවය කරන්නේ වේ.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, දුසිල්හට යම් ශාරද්‍යයෙක් වේ නම්, සිල්වත්හට ඒ ශාරද්‍යය නො වෙයි. එහෙයින් මෙ දහම සෙඛවෙසාරජ්ජකරණ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අල්ප ශ්‍රැතයාහට යම් ශාරද්‍යයෙක් වේ නම්, බහුශ්‍රැතයාහට එ ශාරද්‍යය නො වෙයි. එහෙයින් මෙ ධර්මය සෙඛවෙසාරජ්ජකරණ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කුසීතයාහට යම් ශාරද්‍යයෙක් වේ නම්, රුකුළුවැර ඇතියහුට ඒ ශාරද්‍යය නො වෙයි. එහෙයින් මේ ධර්මය සෙඛවෙසාරජ්ජකරණ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, දුෂ්ප්‍රාඥයාහට යම් ශාරද්‍යයෙක් වේ නම්, ප්‍රඥාවත්හට ඒ ශාරද්‍යය නො වෙයි. එහෙයින් මෙ දහම සෙඛවෙසාරජ්ජකරණ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ දහම් පස සෙඛවෙසාරජ්ජකරණ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.1.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සඞ්කිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "2. මහණෙනි, කරුණු පසෙකින් සමන්වාගත මහණ අකොප්‍යධර්ම ඇති ක්ෂීණාස්‍රව වූයේ නමුදු පාපභික්ෂුයැයි මතුමතුයෙහි සැක කරණ ලදුයේ හැම සෙයින් සැක කරණ ලදුයේ වෙයි. කවර පසෙකිනයත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ ගණිකාව ගොචර (එළැඹිය යුතු තැන්) කොට ඇතියේ හෝ වෙයි, වැන්දඹුව ගොචර කොට ඇතියේ හෝ වෙයි, ථුල්ලකුමාරි (විවාහයට නොගිය මහලු කුමරිය) ගොචර කොට ඇතියේ හෝ වෙයි, පණ්ඩක (නපුංසක) ගොචර කොට ඇතියේ හෝ වෙයි, මෙහෙණ ගොචර කොට ඇතියේ හෝ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පඤ්චධර්මයෙන් සමන්වාගත මහණ අකොප්‍යධර්ම ඇතියේ නමුදු පාපභික්ෂු යයි මෙරමා විසින් මතු මතුයෙහි සැක කරණ ලදුයේ හැමසෙයින් සැක කරණ ලදුයේ වේ යයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 204,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5. 3. 1. 3",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(මහාචොරසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "3. පඤ්චහි භික්ඛවෙ, අඞ්ගෙහි සමන්නාගතො මහාචොරො සන්ධිම්පි ඡින්දති. නිල්ලොපම්පි හරති. එකාගාරිකම්පි කරොති. පරිපන්ථෙපි තිට්ඨති. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ මහාචොරො විසමනිස්සිතො ච හොති ගහනනිස්සිතො ච බලවනිස්සිතො ච භොගචාගී ච එකචාරි ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ, මහාචොරො විසමනිස්සිතො හොති: ඉධ භික්ඛවෙ මහාචොරො නදීවිදුග්ගං වා නිස්සිතො හොති පබ්බතවිසමං වා. එවං ඛො භික්ඛවෙ මහාචොරො විසමනිස්සිතො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ, මහාචොරො ගහනනිස්සිතො හොති: ඉධ භික්ඛවෙ මහාචොරො තිණගහනං වා නිස්සිතො හොති රුක්ඛගහනං වා ගෙධං{1} වා පන වනසණ්ඩං. එවං ඛො භික්ඛවෙ මහාචොරො ගහනනිස්සිතො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ, මහාචොරො බලවනිස්සිතො හොති: ඉධ භික්ඛවෙ මහාචොරො රාජානං වා රාජමහාමත්තං වා නිස්සිතො හොති. තස්ස එවං හොති: සචෙ මං කොචි කිඤ්චි වක්ඛති, ඉමෙ මෙ රාජානො වා රාජමහාමත්තා වා පරියොධාය අත්ථං භණිස්සන්තීති. සචෙ නං කොචි කිඤ්චි ආහ, ත්යාස්ස රාජානො වා රාජමහාමත්තා වා පරියොධාය අත්ථං භණන්ති. එවං ඛො භික්ඛවෙ මහාචොරො බලවනිස්සිතො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ, මහාචොරො භොගචාගී හොති: ඉධ භික්ඛවෙ මහාචොරො අඩ්ඪො හොති මහද්ධනො මහාභොගො. තස්ස එවං හොති: සචෙ මං කොචි කිඤ්චි වක්ඛති, ඉතො භොගෙන පටිසන්ථරිස්සාමීති. සචෙ නං කොචි කිඤ්චි ආහ, තතො භොගෙන පටිසන්ථරති. එවං ඛො භික්ඛවෙ මහාචොරො භොගචාගී හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ, මහාචොරො එකචාරි හොති: ඉධ භික්ඛවෙ මහාචොරො එකකො නිග්ගහණානි කත්තා හොති. තං කිස්ස හෙතු: මා මෙ ගුය්හමන්තා බහිද්ධා සම්භෙදං අගමංසූති. එවං ඛො භික්ඛවෙ මහාචොරො එකචාරි හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි අඞ්ගෙහි සමන්නාගතො මහාචොරො සන්ධිම්පි ඡින්දති, නිල්ලොපම්පි හරති, එකාගාරිකම්පි කරොති, පරිපන්ථෙපි තිට්ඨති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. රොධං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5.3.1.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මහා චොර සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "3. මහණෙනි, කරුණු පසෙකින් සමන්වාගත මහසොර ගෘහසන්ධි දූ බිඳියි. වොලොගැනුමුදු කෙරෙයි. ගෙපැහැරුම් (එක් ගෙයක් වටලා පැහැර ගැණීම් ද) කෙරෙයි. කඩපලාසොරකම් (පල්හොරකම්) ද කෙරෙයි. කවර පසෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි මහසොර විෂමනිඃශ්‍රිත ද වෙයි, ගහනනිඃශ්‍රිත ද වෙයි, බලවන්නිඃශ්‍රිත ද වෙයි, භොගචාගී ද වෙයි, එකචාරී ද වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මහසොර කෙසේ නම් විෂමනිඃශ්‍රිත වේ ය යත්: මහණෙනි, මෙ ලොව්හි මහසොර නදීවිදුර්ගයෙක් වේවයි, පර්වතවිෂමයෙක් වේවයි, ඇසුරු කෙළේ වෙයි. මහණෙනි, මෙසෙයින් මහසොර විෂමනිඃශ්‍රිත වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් මහසොර ගහනනිඃශ්‍රිත වේ ය යත්: මහණෙනි, මෙලොව්හි මහසොර තෘණගහනයෙක් වේවයි, වෘක්ෂගහනයෙක් වේවයි, ඝනවන ලැහැබෙක් වේවයි, ඇසුරු කෙළේ වෙයි. මහණෙනි, මෙසේ මහසොර ගහනනිඃශ්‍රිත වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මහසොර කෙසේ නම් බලවන්නිඃශ්‍රිත වේ ය යත්: මහණෙනි, මෙ ලොව්හි මහසොර රජහු හෝ, රජමහමැතියකු හෝ, ඇසුරු කෙළේ වෙයි. ඔහට මෙබඳු සිතෙක් වෙයි: ඉදින් මට කිසිවෙක් කිසිවක් කියා නම්, මේ රජහු හෝ රජමහමැතියෝ හෝ මාගේ දොෂය ඹබා පියා අරුත් බණන්නාහ යි. ඉදින් කිසිවෙක් ඔහට කිසිවක් කියා නම්, රජහු හෝ රජමහමැතිහු හෝ ඔහුගේ අපරාධය ඔබාපියා අරුත් බෙණෙති. මහණෙනි, මෙසෙයින් මහසොර බලවන්නිඃශ්‍රිත වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් මහසොර භොගචාගී වේ ය යත්: මහණෙනි, මෙලොව්හි මහසොර මහාධන ඇති මහා භොග ඇති ආඪ්‍යයෙක් වෙයි. ඔහට මෙබඳු සිතෙක් වෙයි: ඉදින් කිසිවෙක් මට කිසිවක් (දොසක්) කියා නම්, මේ භොගයෙන් පිළිසතර කරන්නෙමියි (‘භොගදානයෙන් දොස් වසාගන්නෙමි’ යි). ඉදින් ඔහට කිසිවෙක් කිසිවක් කී නම්, හේ භොගයෙන් පිළිසඳර කරයි. මහණෙනි, මෙ සෙයින් මහසොර භොගචාගී වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් මහසොර එකචාරී වේ ය යත්: මහණෙනි, මෙ ලොව්හි මහසොර එකලා වූයේ මැ මෙරමා සතු දැය පැහැර ගැණීම් කරන්නේ වෙයි. එ කවර හෙයින යත්: මාගේ ගුහ්‍යමන්ත්‍රයෝ (සැඟවිය යුතු රහස්) නහමක් බැහැර නො යෙත් වා යි. මහණෙනි, මෙසේ මහසොර එකචාරී වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසෙන් සමන්වාගත මහසොර ගෘහසන්ධිදු සිඳුනේ ය. වොලො ගන්නේ ය. ගෙපැහැරීම් ද කරන්නේ ය. කඩපලා සොරකම් ද කෙරෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 206,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො පාපභික්ඛු ඛතං උපහතං අත්තානං පරිහරති. සාවජ්ජො ච හොති සානුවජ්ජො විඤ්ඤූනං. බහුඤ්ච{1} අපුඤ්ඤං පසවති. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ, පාපභික්ඛු විසමනිස්සිතො ච හොති ගහනනිස්සිතො ච බලවනිස්සිතො ච භොගචාහී ච එකචාරී ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ, පාපභික්ඛු විසමනිස්සිතො හොති: ඉධ භික්ඛවෙ පාපභික්ඛු විසමෙන කායකම්මෙන සමන්නාගතො හොති, විසමෙන වචීකම්මෙන සමන්නාගතො හොති, විසමෙන මනොකම්මෙන සමන්නාගතො හොති. එවං ඛො භික්ඛවෙ පාපභික්ඛු විසමනිස්සිතො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ, පාපභික්ඛු ගහනනිස්සිතො හොති, ඉධ භික්ඛවෙ පාපභික්ඛු මිච්ඡාදිට්ඨිකො හොති අන්තග්ගාහිකාය දිට්ඨියා සමන්නාගතො.{2} එවං ඛො භික්ඛවෙ පාපභික්ඛු ගහනනිස්සිතො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ, පාපභික්ඛු බලවනිස්සිතො හොති: ඉධ භික්ඛවෙ පාපභික්ඛු රාජානං වා රාජමහාමත්තං වා නිස්සිතො හොති. තස්ස එවං හොති: සචෙ මං කොචි කිඤ්චි වක්ඛති, ඉමෙ මෙ රාජානො වා රාජමහාමත්තා වා පරියොධාය අත්ථං භණිස්සන්තීති. සචෙ නං කොචි කිඤ්චි ආහ, ත්යාස්ස රාජානොවා රාජමහාමත්තා වා පරියොධාය අත්ථං භණන්ති. එවං ඛො භික්ඛවෙ පාපභික්ඛු බලවනිස්සිතො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ, පාපභික්ඛු භොගචාගී හොති: ඉධ භික්ඛවෙ පාපභික්ඛු ලාභී හොති චීවරපිණ්ඩපාතසෙනාසනගිලානප්පච්චයභෙසජ්ජපරික්ඛාරානං. තස්ස එවං හොති: සචෙ මං කොචි කිඤ්චි වක්ඛති, ඉතො ලාභෙන පටිසන්ථරිස්සාමිති. සචෙ නං කොචි කිඤ්චි ආහ, තතො ලාභෙන පටිසන්ථරති. එවං ඛො භික්ඛවෙ පාපභික්ඛු භොගචාගී හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ, පාපභික්ඛු එකචාරි හොති: ඉධ භික්ඛවෙ පාපභික්ඛු එකකො3{3} පච්චන්තිමෙසු ජනපදෙසු නිවාසං කප්පෙති. සො තත්ථ කුලානි උපසඞ්කමන්තො ලාභං ලභති. එවං ඛො භික්ඛවෙ පාපභික්ඛු එකචාරී හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො පාපභික්ඛු ඛතං උපහතං අත්තානං පරිහරති. සාවජ්ජො ච හොති සානුවජ්ජො විඤ්ඤූනං. බහුඤ්ච අපුඤ්ඤං පසවතීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. බහු ච - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සමන්නාගතො හොති - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "3. එකකො ච - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, එ පරිදි ම කරුණු පසෙකින් සමන්වාගත පාපභික්ෂු තෙමේ සාළ ගුණ ඇති, නටගුණ ඇති ආත්මය (තමා) පරිහරණ කෙරෙයි. සදොස් වූයේ විඥයන් විසින් අනුවාද කටයුතු ද වෙයි. බොහෝ පව් ද රැස් කරයි. කවර පසෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි පාපභික්ෂු විෂමනිඃශ්‍රිත ද වෙයි, ගහනනිඃශ්‍රිත ද වෙයි, බලවන්නිඃශ්‍රිත ද වෙයි, භොගචාගී ද වේ. එකචාරී ද වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් පවිටු මහණ විෂමනිඃශ්‍රිත වේ ය යත්: මහණෙනි, මෙ සස්නෙහි පවිටු මහණ විෂමකායකර්මයෙන් සමන්වාගත වෙයි, විෂමවාක්කර්මයෙන් සමන්වාගත වෙයි, විෂමමනඃකර්මයෙන් සමන්වාගත වෙයි. මහණෙනි, මෙසේ පවිටු මහණ විෂමනිඃශ්‍රිත වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් පවිටු මහණ ගහනනිඃශ්‍රිත වේ ය යත්: මහණෙනි, මෙ සස්නෙහි පවිටු මහණ අන්තග්‍රාහික (ශාශ්වත හෝ උච්ඡේද හෝ) දෘෂ්ටියෙන් සමන්වාගත වූයේ මිථ්‍යාදෘෂ්ටික වෙයි. මහණෙනි, මෙසේ පවිටු මහණ ගහනනිඃශ්‍රිත වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් පාපභික්ෂු බලවන්නිඃශ්‍රිත වේ ය යත්: මහණෙනි, මෙ සස්නෙහි පවිටු මහණ රජකු හෝ රජමහමැතියකු හෝ ඇසුරු කෙළේ වෙයි. ඔහට මෙබඳු සිතෙක් වෙයි: ඉදින් කිසිවෙක් මට කිසිවක් කියා නම්, මෙ රජහු හෝ රජමහමැතිහු හෝ මාගේ දොස් ඔබාපියා අරුත් බණන්නාහ යි. ඉදින් ඔහට කිසිවෙක් කිසිවක් කියා නම් එ රජහු හෝ රජමහමැතියෝ හෝ ඔහුගේ දොස් වසාපියා අරුත් බෙණෙති. මහණෙනි, මෙසේ පාපභික්ෂු බලවන්නිඃශ්‍රිත වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් පවිටු මහණ භොගචාගී (භොග දෙන්නේ) වේ ය යත්: මහණෙනි, මෙ සස්නෙහි පවිටු මහණ සිවුරු පිඬුවා සෙනසුන් ගිලන්පස බෙහෙසත් පිරිකර ලබනසුලු වෙයි. ඔහට මෙබඳු සිතෙක් වෙයි: ඉදින් මාහට කිසිවෙක් කිසිවක් කියා නම්, මේ ලාභයෙන් පිළිසතර (සඞ්ග්‍රහ) කරන්නේමී යි. ඉදින් ඔහට කිසිවෙක් කිසිවක් කියා නම්, එ ලාභයෙන් පිළිසතර කරයි. මහණෙනි, මෙසේ පාපභික්ෂු තෙමේ භොගචාගී වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් පාපභික්ෂු එකචාරී වේ ය යත්: මහණෙනි, මෙ සස්නෙහි පාපභික්ෂු තෙමේ එකලා වූයේ පසල්දනව්හි වාස කරයි. හෙ එහි කුලයන් කරා එළඹෙනුයේ ලාභ ලබයි. මහණෙනි, මෙසේ පාපභික්ෂු එකචාරී වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පඤ්චධර්මයෙන් සමන්වාගත පාපභික්ෂු සාරාලු ගුණ ඇති, නටගුණ ඇති, ආත්මය පරිහරණ කරයි. සදොස් වූයේ විඥයන් විසින් අනුවාද (නින්දා) කටයුතු ද වෙයි. බොහෝ අකුසල් ද රැස් කෙරේ ය යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 208,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5. 3. 1. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සමණසුඛුමාලසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "4. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො භික්ඛු සමණෙසු සමණසුඛුමාලො හොති. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ, භික්ඛු යාචිතොව බහුලං චීවරං පරිභුඤ්ජති, අප්පං අයාචිතො. යාචිතොව බහුලං පිණ්ඩපාතං පරිභුඤ්ජති, අප්පං අයාචිතො. යාචිතොව බහුලං සෙනාසනං පරිභුඤ්ජති, අප්පං අයාචිතො. යාචිතොව බහුලං ගිලානපච්චයභෙසජ්ජපරික්ඛාරං පරිභුඤ්ජති, අප්පං අයාචිතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "යෙහි ඛො පන සබ්රහ්මචාරිහි සද්ධිං{1} විහරති, ත්යාස්ස මනාපෙනෙව බහුලං කායකම්මෙන සමුදාචරන්ති, අප්පං අමනාපෙන. මනාපෙනෙව බහුලං වචීකම්මෙන සමුදාචරන්ති, අප්පං අමනාපෙන. මනාපෙනෙව බහුලං මනොකම්මෙන සමුදාචරන්ති, අප්පං අමනාපෙන, මනාපං යෙව බහුලං උපහාරං{2} උපහරන්ති, අප්පං අමනාපං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යානි ඛො පන තානි වෙදයිතානි චිත්තසමුට්ඨානානි වා සෙම්හසමුට්ඨානානි වා වාතසමුට්ඨානානි වා සන්නිපාතිකානි වා උතුපරිනාමජානි වා විසමපරිහාරජානි වා ඔපක්කමිකානි වා කම්මවිපාකජානි වා, තානිස්ස න බහුදෙව උප්පජ්ජන්ති. අප්පාබාධො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුන්නං ඣානානං ආභිචෙතසිකානං දිට්ඨධම්මසුඛවිහාරානං නිකාමලාභී හොති අකිච්ඡලාභී අකසිරලාභී."
                    },
                    {
                        "type": "paragraph",
                        "text": "ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙවධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු සමණෙසු සමණසුඛුමාලො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යං හි තං භික්ඛවෙ, සම්මා වදමානො වදෙය්ය, ‘සමණෙසු සමණසුඛුමාලො’ති මමෙව තං භික්ඛවෙ සම්මා වදමානො වදෙය්ය, ‘සමණෙසු සමණසුඛුමාලො’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අහං හි භික්ඛවෙ යාචිතොව බහුලං චීවරං පරිභුඤ්ජාමි, අප්පං අයාචිතො. යාචිතොව බහුලං පිණ්ඩපාතං -පෙ- සෙනාසනං -පෙ- ගිලානපච්චයභෙසජ්ජපරික්ඛාරං පරිභුඤ්ජාමි. අප්පං අයාචිතො."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සබ්රහ්මචාරීහි - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "2. මනාපං යෙව උපහාරං - මඡසං. ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5.3.1.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සමණසුඛුමාල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "4. මහණෙනි, කරුණු පසෙකින් සමන්වාගත ශ්‍රමණ තෙමේ ශ්‍රමණයන් කෙරෙහි ශ්‍රමණ සුකුමාර (සැප බහුල) වෙයි. කවර පසෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණෙක් (පිළිගත මැනැවයි) ආරාධිත වූයේ ම බොහෝ කොට චීවර වළඳ කෙරෙයි. ආරාධිත නො වූයේ අල්ප ය. ආරාධිත වූයේ ම බොහෝ කොට පිණ්ඩපාත වළඳ කෙරෙයි. ආරාධිත නො වූයේ අල්ප ය. ආරාධිත වූයේ ම බොහෝ කොට සෙනසුන් වළඳ කෙරෙයි. ආරාධිත නො වූයේ අල්ප ය. ආරාධිත වූයේ ම බොහෝ කොට ගිලන්පස බෙහෙසත් පිරිකර වළඳ කෙරෙයි. ආරාධිත නො වූයේ අල්ප ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "යම් සබ්‍රම්සරුන් සමඟ එක්ව වාස කෙරේ ද, ඔහට ඒ සබ්‍රම්සරහු බහුල කොට මනාප වූ ම කායකර්මයෙන් පවත්නාහ. අමනාප කායකර්මයෙන් පවත්නාහු අල්පයහ. මනාප වූ ම වාක්කර්මයෙන් බහුල කොට පවත්නාහ. අමනාප වාක්කර්මයෙන් පවත්නාහු අල්පයහ. මනාප වූ ම මනඃකර්මයෙන් බහුල කොට පවත්නාහ. අමනාප මනඃකර්මයෙන් පවත්නාහු අල්පයහ. මනාප වූ ම පඬුරු එළවත්. අමනාප පඬුරු අල්ප ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "යම් ඒ වෙදනායෙක් පිත්තසමුත්ථාන වේවයි, ශ්ලෙෂ්මසමුත්ථාන වේවයි, වාතසමුත්ථාන වේවයි, සාන්නිපාතික වේවයි, ඍතුපරිණාමජ වේවයි, විෂමපරිහාරජ වේවයි, ඖපක්‍රමික වේවයි, කර්මවිපාකජ වේවයි, ඒ වෙදනා බෙහෙවින් ම ඔහට නූපදී. අල්පාබාධ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අධිචිත්තයෙහි උපදනා ඉහාත්මසුඛවිහරණ වන සතර ධ්‍යානයන් කැමැතිසේ ලබන සුලුයේ, නිදුකින් ලබනසුලුයේ, විපුල කොට ලබනසුලුයේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආස්‍රවයන්ගේ ක්ෂය වීමෙන් අනාස්‍රව වූ චිත්තවිමුක්තිය ප්‍රඥාවිමුක්තිය ඉහාත්මයෙහි ම තෙමේ විශිෂ්ට ඥානයෙන් දැන සාක්ෂාත් කොට සපයා වාස කරයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසෙන් සමන්වාගත මහණ ශ්‍රමණයන් කෙරෙහි ශ්‍රමණ සුකුමාර වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් පුඟුලකු ගෙණ මැනැවින් කියනුයෙක්, ‘ශ්‍රමණයන් කෙරෙහි ශ්‍රමණ සුකුමාරයෙකැ’යි කියා නම්, මහණෙනි, මැනැවින් කියන හේ ‘ශ්‍රමණ‍යන් කෙරෙහි ශ්‍රමණ සුකුමාරය’යි ඒ මා මැ සඳහා කියන්නේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මම ආරාධිත වූයෙම් මැ බොහෝ කොට සිවුරු වළඳ කරමි. අනාරාධිත වූයෙම් අල්ප ය. ආරාධිත වූයෙම් මැ බොහෝ කොට පිණ්ඩපාත, ශයනාසන, ගිලන්පස බෙහෙසත් පිරිකර වළඳ කෙරෙමි. අනාරාධිත වූයෙම් අල්ප කොට වළඳ කෙරෙමි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 210,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යෙහි ඛො පන භික්ඛූහි සද්ධිං විහරාමි, තෙ මං මනාපෙනෙව බහුලං කායකම්මෙන සමුදාචරන්ති, අප්පං අමනාපෙන. මනාපෙනෙව බහුලං වචිකම්මෙන සමුදාචරන්ති, අප්පං අමනාපෙන. මනාපෙනෙව බහුලං මනොකම්මෙන සමුදාචරන්ති, අප්පං අමනාපෙන. මනාපං යෙව බහුලං උපහාරං උපහරන්ති, අප්පං අමනාපං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යානි ඛො පන තානි වෙදයිතානි චිත්තසමුට්ඨානානි වා සෙම්හසමුට්ඨානානි වා වාතසමුට්ඨානානි වා සන්නිපාතිකානි වා උතුපරිනාමජානි වා විසමපරිහාරජානි වා ඔපක්කමිකානි වා කම්මවිපාකජානි වා, තානි මෙ න බහූදෙව උප්පජ්ජන්ති. අප්පාබාධොහමස්මි."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුන්නං ඛො පනම්හි{1} ඣානානං ආභිචෙතසිකානං දිට්ඨධම්මසුඛවිහාරානං නිකාමලාභී අකිච්ඡලාභී අකසිරලාභී."
                    },
                    {
                        "type": "paragraph",
                        "text": "ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙවධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහාරාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "යං හි තං භික්ඛවෙ, සම්මා වදමානො වදෙය්ය, ‘සමණෙසු සමණසුඛුමාලො’ති මමෙ ව තං භික්ඛවෙ සම්මා වදමානො වදෙය්ය, ‘සමණෙසු සමණසුඛුමාලො’ති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 1. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ඵාසුවිහාර සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "5. පඤ්චිමෙ භික්ඛවෙ, ඵාසුවිහාරා. කතමෙ පඤ්ච"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛුනො මෙත්තං කායකම්මං පච්චුපට්ඨිතං හොති සබ්රහ්මචාරීසු ආවී චෙව රහො ච. මෙත්තං වචීකම්මං -පෙ- මෙත්තං මනොකම්මං පච්චුපට්ඨිතං හොති සබ්රහ්මචාරීසු ආචී චෙව රහො ච. යානි තානි සීලානි අඛණ්ඩානි අච්ඡිද්දානි අසබලානි අකම්මාසානි භුජිස්සානි විඤ්ඤුප්පසත්ථානි අපරාමට්ඨානි සමාධිසංවත්තනිකානි, තථාරූපෙහි සීලෙහි සීලසාමඤ්ඤගතො විහරති සබ්රහ්මචාරීහි ආවි චෙව රහො ච. යායං දිට්ඨි අරියා නිය්යානිකා නිය්යාති තක්කරස්ස සම්මා දුක්ඛක්ඛයාය, තථාරූපාය දිට්ඨියා දිට්ඨිසාමඤ්ඤගතො විහරති සබ්රහ්මචාරීහි ආවී චෙව රහො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ පඤ්ච ඵාසුවිහාරාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. චතුන්නං ඛො පන - සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "යම් මැ භික්ෂු කෙනකුන් සමඟ වාස කෙරෙම් නම්, ඔහු මට මනාප වූ ම කායකර්මයෙන් බහුල කොට පවත්නාහ. අමනාපකායකර්මයෙන් පවත්නාහු අල්පයහ. මනාප වූ මැ වාක්කර්මයෙන් බහුල කොට පවත්නාහ. අමනාප වාක්කර්මයෙන් පවත්නාහු අල්පයහ. මනාප වූ මැ මනඃකර්මයෙන් බහුල කොට පවත්නාහ, අමනාපමනඃකර්මයෙන් පවත්නාහු අල්පයහ. මනාප වූ මැ උපහාර බහුල කොට එළවත්. අමනාප උපහාර අල්ප යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "යම් වෙදනායෙක් - පිත්තසමුත්ථාන වේවයි, සෙම්හසමුත්ථාන වේවයි, වාතසමුත්ථාන වේවයි, සාන්නිපාතික වේවයි, ඍතුපරිණාමජ වේවයි, විෂමපරිහාරජ වේවයි, ඖපක්‍රමික වේවයි, කර්මවිපාකජ වේවයි, ඒ වෙදනා මට බෙහෙවින් නූපදී. මම අල්පාබාධයෙමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අධිචිත්තයෙහි (රූපාවචර සිත්හි) උපදනා වූ ඉහාත්මයෙහි සුඛවිහරණ වන සතරධ්‍යානයන් කැමැති සෙයින් ලබන සුලුයෙම්, නිදුකින් ලබන සුලුයෙම්, විපුල සේ ලබන සුලුයෙම් වෙමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආස්‍රවක්ෂයයෙන් අනාස්‍රව වූ චිත්තවිමුක්තිය ප්‍රඥාවිමුක්තිය ඉහාත්මයෙහි මැ තෙමේ විශිෂ්ටඥානයෙන් දැන සාක්ෂාත් කොට සපයා වාස කරමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් පුඟුලකු ගෙන ‘ශ්‍රමණයන් කෙරෙහි ශ්‍රමණ සුකුමාර’යි මොනොවට කියනුයෙක් පවසන්නේ නම්, මහණෙනි, ඒ මා සඳහා ‘ශ්‍රමණයන් කෙරෙහි ශ්‍රමණ සුකුමාර’යි මැනැවින් කියන හේ පවසන්නේ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.1.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඵාසුවිහාර සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදාන යි]",
                        "type": "unindented"
                    },
                    {
                        "text": "5. මහණෙනි, මේ ඵාසුවිහාරයෝ පස් දෙනෙකි. කවර පස් දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණහුගේ මෛත්‍රීචිත්තයෙන් යුත් කායකර්මය සබ්‍රම්සරුන් කෙරෙහි සම්මුඛයෙහිත් පරාම්මුඛයෙහිත් එළඹ සිටියේ වෙයි. මෛත්‍රියෙන් යුත් වාක්කර්මය ... මෛත්‍රියෙන් යුත් මනඃකර්මය සබ්‍රම්සරුන් කෙරෙහි සම්මුඛයෙහිත් පරාම්මුඛයෙහිත් එළඹ සිටියේ වෙයි. නොකඩ වූ නොසිදුරු වූ අශබල වූ අකල්මාෂ වූ නිදහස් වූ විඥයන් විසින් පසස්නා ලද තෘෂ්ණදෘෂ්ටියෙන් අපරාමෘෂ්ට වූ සමාධියට හිතවත් ව වැටෙන යම් ශීල කෙනෙක් වෙත් නම්, එබඳු ශීලයෙන් සබ්‍රම්සරුන් සමඟ සම්මුඛයෙහිත් පරාම්මුඛයෙහිත් ශීලයෙන් සමභාවයට ගියේ වාස කරයි. ආර්ය වූ නෛර්ය්‍යාණික වූ යම් දෘෂ්ටියෙක් එය කරණවහුගේ දුක් මැනැවින් ගෙවීමට පමුණුවා නම්, සම්මුඛයෙහිත් පරාම්මුඛයෙහිත් එබඳු දෘෂ්ටියෙන් සබ්‍රම්සරුන් හා දෘෂ්ටිසමභාවයට ගියේ වාස කරයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ ඵාසු විහාර පස යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 212,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5. 3. 1. 6",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආනන්දසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "6. එකං සමයං භගවා **කොසම්බියං** විහරති **ඝොසිතාරාමෙ**. අථ ඛො ආයස්මා **ආනන්දො** යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා ආනන්දො භගවන්තං එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කිත්තාවතා නු ඛො භන්තෙ, භික්ඛු සඞ්ඝෙ{1} විහරන්තො ඵාසුං විහරෙය්යාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යතො ඛො ආනන්ද, භික්ඛු අත්තනා{2} සීලසම්පන්නො හොති නො ච පරං අධිසීලෙ සම්පවත්තා. එත්තාවතාපි ඛො ආනන්ද භික්ඛු සඞ්ඝෙ විහරන්තො ඵාසුං විහරෙය්යාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සියා පන භන්තෙ, අඤ්ඤොපි පරියායො යථා භික්ඛු සඞ්ඝෙ ඵාසුං විහරෙය්යාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සියා ආනන්ද, යතො ඛො ආනන්ද භික්ඛු අත්තනා සිලසම්පන්නො හොති නො ච පරං අධිසීලෙ සම්පවත්තා හොති. අත්තානුපෙක්ඛී ච හොති නො පරානුපෙක්ඛී. එත්තාවතා පි ඛො ආනන්ද භික්ඛු සඞ්ඝෙ විහරන්තො ඵාසුං විහරෙය්යාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සියා පන භන්තෙ, අඤ්ඤොපි පරියායො යථා භික්ඛු සඞ්ඝෙ විහරන්තො ඵාසුං විහරෙය්යාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සියා ආනන්ද, යතො ඛො ආනන්ද භික්ඛු අත්තනා සීලසම්පන්නො හොති නො ච පරං අධිසීලෙ සම්පවත්තා. අත්තානුපෙක්ඛී ච නො පරානුපෙක්ඛී හොති. අප්පඤ්ඤාතො{3} ච හොති, තෙන ච අප්පඤ්ඤාතකෙන නො පරිතස්සති. එත්තාවතාපි ඛො{4} ආනන්ද භික්ඛු සඞ්ඝෙ විහරන්තො ඵාසුං විහරෙය්යාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සියා පන භන්තෙ, අඤ්ඤොපි පරියායො යථා භික්ඛු සඞ්ඝෙ විහරන්තො ඵාසුං විහරෙය්යාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සියා ආනන්ද, යතො ඛො ආනන්ද භික්ඛු අත්තනා සීලසම්පන්නො හොති, නො පරං අධිසීලෙ සම්පවත්තා. අතතානුපෙක්ඛී ච හොති නො පරානුපෙක්ඛී. අප්පඤ්ඤාතො ච හොති. තෙන ච අප්පඤ්ඤාතකෙන නො පරිතස්සති. චතුන්නඤ්ච ඣානානං ආභිචෙතසිකානං දිට්ඨධම්මසුඛවිහාරානං නිකාමලාභී හොති අකිච්ඡලාභී අකසිරලාභී. එත්තාවතාපි ඛො ආනන්ද භික්ඛු සඞ්ඝෙ විහරන්තො ඵාසුං විහරෙය්යති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. භික්ඛු සඞ්ඝො - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අත්තනාච - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අපඤ්ඤතො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. එත්තාවතාපි - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5.3.1.6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආනන්ද සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "6. එක් සමයෙක්හි භාග්‍යවතුන්වහන්සේ කොසඹෑ නුවර ඝොසිතාරාමයෙහි වැඩ වසන සේක. එකල්හි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ කරා එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ සකසා වැඳ එකත්පස්ව හුන්හ. එකත්පස් ව හුන් ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට තෙල කරුණු සැළ කළහ:",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, කෙතෙක් කරුණෙකින් සඞ්ඝයා කෙරෙහි වසන මහණ සුවසේ වසන්නේ දැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්දයෙනි, යම් කරුණෙකින් මහණ තෙමේ සිල්සපන් වූයේ, මෙරමා අධිශීලයෙහි ලා උපවාද නොකරණුයේ වේ ද, ආනන්දයෙනි, මෙ කරුණෙනුදු මහණ සඞ්ඝයා කෙරෙහි සුවසේ වාස කරන්නේ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, මහණ යම් කරුණෙකින් සඞ්ඝයා කෙරෙහි සුවසේ වෙසේ නම් එබඳු අන් කරුණෙක් වන්නේ ද?",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්දයෙනි, වන්නේ ය. ආනන්දයෙනි, යම් හෙයෙකින් මහණ තෙමේ සිල්සපන් වූයේ මෙරමා අධිශීලයෙහි ලා නො ද ගරහනුයේත් වේ, තමාගේ කිස දක්නා සුලු වූයේත් වෙයි, මෙරමාගේ කෘතාකෘත නො විමසනුයේත් වෙයි, ආනන්දයෙනි, මහණ මෙ කරුණෙනුදු සඟුන් කෙරෙහි සුවසේ වසන්නේ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, යම් කරුණෙකින් මහණ සඟුන් කෙරෙහි සුවසේ වෙසේ නම්, එබඳු අන් කරුණෙකුදු වන්නේ ද?",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්දයෙනි, වන්නේ ය. ආනන්දයෙනි, යම් කරුණෙකින් මහණ තෙමේ සිල්සපන් වූයේ අන්‍යයා අධිශීලයෙහි ලා නො ගරහන්නේ වෙයි, තමාගේ කළ නොකළ දෑ දක්නා සුල්ලේත් වෙයි, මෙරමා නො විමසනුයේත් වෙයි, අප්‍රකට වූයේත් වෙයි, ඒ අප්‍රකට භාවයෙන් නො තැවෙනුයේත් වෙයි. ආනන්දයෙනි, මෙ කරුණෙනුදු මහණ සඟුන් කෙරෙහි වසනුයේ සුවසේ වසන්නේ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, යම් කරුණෙකින් මහණ සඟුන් කෙරෙහි වසනුයේ සුවසේ වාස කෙරේ නම්, එබඳු අන් කරුණෙකුදු වන්නේ ද?",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්දයෙනි, වන්නේ ය. ආනන්දයෙනි, යම් කරුණෙකින් මහණ තෙමේ සිල් සපන් වූයේ මෙරමා අධිශීලයෙහි ලා නො ගරහන්නේ වේ ද, ආත්මානුප්‍රෙක්ෂී වේ ද, පරානුප්‍රෙක්ෂි නො වේ ද, අල්පඥාත වේ ද, ඒ අල්පඥාතභාවයෙන් නො තැවෙන්නේ ද, අධිචිත්තයෙහි උපදනා ඉහාත්මභාවයෙහි සුඛවිහරණ ඇති සතර ධ්‍යානයන් රිසි සේ ලබනසුලුයේ, නිදුකින් ලබනසුලුයේ, විපුල කොට ලබනසුලුවූයේත් වේ ද, ආනන්දයෙනි, මෙ කරුණෙනුදු මහණ සඟුන් කෙරෙහි වසනුයේ සුවසේ වාස කරන්නේ ය යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 214,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සියා පන භන්තෙ, අඤ්ඤොපි පරියායො යථා භික්ඛු සඞ්ඝෙ විහරන්තො ඵාසුං විහරෙය්යාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සියා ආනන්ද, යතො ඛො ආනන්ද භික්ඛු අත්තනා සීලසම්පන්නො හොති, නො ච පරං අධිසීලෙ සම්පවත්තා. අත්තානුපෙක්ඛී ච හොති නො පරානුපෙක්ඛී. අප්පඤ්ඤාතො ච හොති තෙන අප්පඤ්ඤාතකෙන නො පරිතස්සති. චතුන්නං ඣානානං ආභිචෙතසිකානං දිට්ඨධම්මසුඛවිහාරානං නිකාමලාභී හොති අකිච්ඡලාභී අකසිරලාභී. ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙවධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති. එත්තාවතා ඛො ආනන්ද භික්ඛු සඞ්ඝෙ විහරන්තො ඵාසුං විහරෙය්ය."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමම්හා චාහං ආනන්ද ඵාසුවිහාරා අඤ්ඤො ඵාසුවිහාරොඋත්තරිතරො වා පණීතතරො වා නත්ථීති වදාමී’ති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 1. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සීලසම්පන්නසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "7. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො භික්ඛු ආහුනෙය්යො පාහුනෙය්යො දක්ඛිණෙය්යො අඤ්ජලිකරණීයො අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්ස. කතමෙහි පඤ්චහි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ, භික්ඛු සීලසම්පන්නො හොති, සමාධිසම්පන්නො හොති, පඤ්ඤාසම්පන්නො හොති, විමුත්තිසම්පන්නො හොති, විමුත්තිඤාණදස්සනසම්පන්නො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු ආහුනෙය්යො පාහුනෙය්යො දක්ඛිණෙය්යො අඤ්ජලිකරණීයො අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්සාති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 1. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අසෙඛසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "8. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො භික්ඛු ආහුනෙය්යො{1} -පෙ- අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්ස. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ, භික්ඛු අසෙඛෙන සීලක්ඛන්ධෙන සමන්නාගතො හොති, අසෙඛෙන සමාධික්ඛන්ධෙන සමන්නාගතො හොති, අසෙඛෙන පඤ්ඤාක්ඛන්ධෙන සමන්නාගතො හොති, අසෙඛෙන විමුත්තික්ඛන්ධෙන සමන්නාගතො හොති, අසෙඛෙන විමුත්තිඤාණදස්සනක්ඛන්ධෙන සමන්නාගතො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු ආහුනෙය්යො හොති -පෙ- අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්සාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ආහුණෙය්යො පාහුණෙය්යො - සීමු. මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "වහන්ස, යම් කරුණෙකින් සඟුන් කෙරෙහි වසන මහණ සුවසේ වෙසේ නම්, එබඳු අන් කරුණෙකුදු ඇත් ද?",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්දයෙනි, ඇත. ආනන්දයෙනි, යම් කරුණෙකින් මහණ තෙමේ සිල සපන් වූයේ මෙරමා අධිශීලයෙහි ලා නො ගරහනුයේ වේ ද, ආත්මානුප්‍රෙක්ෂී වේ ද, පරානුප්‍රෙක්ෂී නො වේ ද, අල්පඥාත වේ ද, ඒ අල්පඥාතභාවයෙන් නො තැවේ ද, ආභිචෙතසික වූ දිට්ඨධම්මසුඛවිහාර වූ සතර ධ්‍යානයන් රිසි සේ ලබනසුලුයේ, නිදුකින් ලබනසුලුයේ, විපුල සේ ලබනසුලුයේත් වේ ද, ආස්‍රවයන්ගේ ක්ෂය වීමෙන් අනාස්‍රව වූ චිත්තවිමුක්තිය හා ප්‍රඥාවිමුක්තිය තෙමේ මැ විශිෂ්ටඥානයෙන් දැන සාක්ෂාත් කොට එයට එළඹ වෙසේ ද, ආනන්දයෙනි, මෙ කරුණෙනුදු මහණ සඟුන් කෙරෙහි වසනුයේ සුවසේ වාස කරන්නේ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්දයෙනි, මේ (ආස්‍රවක්ෂය) ඵාසුවිහාරයෙන් උත්තරීතර වූ හෝ ප්‍රණීතතර වූ අනෙක් ඵාසුවිහාරයෙක් නැතැයි කියමි යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.1.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සීලසම්පන්න සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "7. මහණෙනි, කරුණු පසෙකින් සමන්වාගත මහණ ආහුනාර්හ වෙයි, ප්‍රාඝුණාර්හ වෙයි, දක්ෂිණාර්හ වෙයි, අඤ්ජලිකරණාර්හ වෙයි, ලොකයාට අනුත්තර පුණ්‍යක්ෂෙත්‍ර වෙයි. කවර පසෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ සීලසම්පන්න වෙයි, සමාධිසම්පන්න වෙයි, ප්‍රඥාසම්පන්න වෙයි, විමුක්තිසම්පන්න වෙයි, විමුක්තිඥානදර්ශනසම්පන්න වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසින් සමන්වාගත මහණ ආහුනාර්හ වෙයි, ප්‍රාඝුනාර්හ වෙයි, දක්ෂිනාර්හ වෙයි, අඤ්ජලිකරණාර්හ වෙයි, ලොකයාට අනුත්තර පුණ්‍යක්ෂෙත්‍ර වේ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.1.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අසෙඛ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "8. මහණෙනි, කරුණු පසෙකින් සමන්වාගත මහණ ආහුනාර්හ වෙයි, ප්‍රාඝුණාර්හ වෙයි, දක්ෂිණාර්හ වෙයි, අඤ්ජලිකරණාර්හ වෙයි, ලොකයාට අනුත්තර පුණ්‍යක්ෂෙත්‍ර වෙයි. කවර පසෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ අශෛක්ෂශීලස්කන්ධයෙන් සමන්වාගත වෙයි, අශෛක්ෂසමාධිස්කන්ධයෙන් සමන්වාගත වෙයි, අශෛක්ෂප්‍රඥාස්කන්ධයෙන් සමන්වාගත වෙයි, අශෛක්ෂවිමුක්තිස්කන්ධයෙන් සමන්වාගත වෙයි, අශෛක්ෂවිමුක්තිඥානදර්ශනස්කන්ධයෙන් සමන්වාගත වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසින් සමන්වාගත මහණ ආහුනාර්හ වෙයි, ප්‍රාඝුනාර්හ වෙයි, දක්ෂිනාර්හ වෙයි, අඤ්ජලිකරණාර්හ වෙයි, ලොකයාට අනුත්තර පුණ්‍යක්ෂෙත්‍ර වේ ය යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 216,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5. 3. 1. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(චාතුද්දිසසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "9. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො භික්ඛු චාතුද්දිසො හොති. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ, භික්ඛු සීලවා හොති, පාතිමොක්ඛසංවරසංවුතො විහරති ආචාරගොචරසම්පන්නො, අණුමත්තෙසු වජ්ජෙසු භයදස්සාවී, සමාදාය සික්ඛති සික්ඛාපදෙසු."
                    },
                    {
                        "type": "paragraph",
                        "text": "බහුස්සුතො හොති සුතධරො සුතසන්නිචයො. යෙ තෙ ධම්මා ආදිකල්යාණා මජ්ඣෙකල්යාණා පරියොසානකල්යාණා සාත්ථා සබ්යඤ්ජනා{1} කෙවලපරිපුණණං පරිසුද්ධං බ්රහ්මචරියං අභිවදන්ති, තථාරූපාස්ස ධම්මා බහුස්සුතා හොන්ති ධතා{2} වචසා පරිවිතා මනසානුපෙක්ඛිතා දිට්ඨියා සුප්පටිවිද්ධා."
                    },
                    {
                        "type": "paragraph",
                        "text": "සන්තුට්ඨො හොති ඉතරීතරචීවරපිණ්ඩපාතසෙනාසනගිලානපච්චයභෙසජ්ජපරික්ඛාරෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුන්නං ඣානානං ආභිචෙතසිකානං දිට්ඨධම්මසුඛවිහාරානං නිකාමලාභී හොති අකිච්ඡලාභී අකසිරලාභී."
                    },
                    {
                        "type": "paragraph",
                        "text": "ආසවනං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙවධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු චාතුද්දිසො හොතීති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 1. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අරඤ්ඤසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "10. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො භික්ඛු අලං අරඤ්ඤෙ වනපත්ථානි පන්තානි සෙනාසනානි පටිසෙවිතුං. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ, භික්ඛු සීලවා හොති පාතිමොක්ඛසංවරසංවුතො -පෙ- සමාදාය සික්ඛති සික්ඛාපදෙසු."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සාත්ථං සබ්යඤ්ජනං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ධාතා - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5.3.1.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "චාතුද්දිස සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "9. මහණෙනි, කරුණු පසෙකින් සමන්වාගත මහණ සිවුදික්හි නො පැකිලි ආචාර ඇතියේ වෙයි. කවර පසෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ සිල්වත් වෙයි, ආචාරගොචර සම්පන්න වූයේ ප්‍රාතිමොක්ෂසංවරශීලයෙන් සංවෘත වූයේ වාස කරයි, අණුමාත්‍ර වරදෙහි භය දක්නාසුලුයේ ශික්ෂාපදයෙහි සමාදන් කොට ගෙණ හික්මෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ශ්‍රැතධර වූයේ ශ්‍රැතසන්නිචය ඇතියේ බහුශ්‍රැත වෙයි, ආදිකල්‍යාණ වූ මධ්‍යකල්‍යාණ වූ පර්ය්‍යවසානකල්‍යාණ වූ සාර්ථ වූ සව්‍යඤ්ජන වූ යම් ධර්ම කෙනෙක් කෙවල පරිපූර්ණ වූ පරිශුද්ධ වූ බ්‍රහ්මචර්ය්‍යය ප්‍රකාශ කරත් නම්, එබඳු ධර්මයෝ ඔහු විසින් බහුශ්‍රැතවූවාහු ධරණ ලද්දාහු වෙත්, වචනයෙන් පිරිවහන ලදහු වෙත්, මනසින් අනුප්‍රෙක්ෂිත වෙත්, ප්‍රඥාදෘෂ්ටියෙන් මොනොවට පිළිවිදුනා ලද වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉතරෙතර (යථාලාභ වූ) චීවර පිණ්ඩපාත ශයනාසන ග්ලානප්‍රත්‍යය භෛෂජ්‍ය පරිෂ්කාරයෙන් සතුටු වූයේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආභිචෙතසික වූ දිට්ඨධම්මසුඛවිහාර වූ සතර ධ්‍යානයන් කැමැති සෙයින් ලබනසුලුයේ නිදුකින් ලබනසුලුයේ විපුල කොට ලබනසුලුයේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආස්‍රවක්ෂය වීමෙන් අනාස්‍රව වූ චෙතොවිමුක්ති හා ප්‍රඥාවිමුක්ති හා තෙමේ ඉහාත්මයෙහි මැ විශිෂ්ටඥානයෙන් දැන සාක්ෂාත් කොට එයට පැමිණ වාස කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ කරුණු පසින් සමන්වාගත මහණ සිවුදික්හි නො පැකිලි ආචාර ඇතියේ වේ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.1.10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අරඤ්ඤ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "10. මහණෙනි, කරුණු පසෙකින් සමන්වාගත මහණ වන සෙනසුන් හා වෙනෙහි දුර සෙනසුන් හා ගැඹුරු වල්සෙනසුන් හා සෙවුනට නිසි වූයේ වෙයි. කවර පසෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ සිල්වත් වෙයි, ප්‍රාතිමොක්ෂ සංවරයෙන් සංවෘත වූයේ සමාදන් කොට ගෙන සිකපදයෙහි හික්මෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 218,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "බහුස්සුතො හොති -පෙ- තථාරූපාස්ස ධම්මා -පෙ- දිට්ඨියා සුප්පටිවිද්ධා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ආරද්ධවිරියො විහරති අකුසලානං ධම්මානං පහානාය, කුසලානං ධම්මානං උපසම්පදාය, ථාමවා දළ්හපරක්කමො අනික්ඛිත්තධුරො කුසලෙසු ධම්මෙසු."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුන්නං ඣානානං ආභිචෙතසිකානං දිට්ඨධම්මසුඛවිහාරානං නිකාමලාභී හොති. අකිච්ඡලාභී අකසිරලාභී."
                    },
                    {
                        "type": "paragraph",
                        "text": "ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙවධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු අලං අරඤ්ඤෙ වනපත්ථානි පන්තානි සෙනාසනානි පටිසෙවිතුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "ඵාසුවිහාරවග්ගො පඨමො",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තස්සුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "සාරජ්ජං සඞ්කිතො චොරො සුඛුමාලං ඵාසු පඤ්චමං{1}\nආනන්ද සීලා සෙඛා ච{2} චාතුද්දිසො අරඤ්ඤෙන චාති",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සුඛුමාලඵාසු පඤ්චමං - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ආනන්ද සීල සෙඛියා - සීමු. ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "බහුශ්‍රැත වෙයි ... බ්‍රහ්මචර්ය්‍යය ප්‍රකාශ කරණ එබඳු ධර්මයෝ … නුවණින් මොනොවට පිළිවිදුනා ලද්දාහු වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අකුශල ධර්මයන්ගේ ප්‍රහාණය පිණිස කුශලධර්මයන්ගේ උපසම්පත් පිණිස ඇරඹුවැර ඇතියේ වාස කරයි. වීර්ය්‍යස්ථාම ඇතියේ දළ පැරකුම් ඇතියේ කුශලධර්මයෙහි නො බහා ලූ ධූර ඇතියේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආභිචෙතසික වූ දිට්ඨධම්මසුඛවිහාර වූ සතර ධ්‍යානයන් කැමැතිසෙයින් ලබනසුලු වූයේ නිදුකින් ලබනසුලු වූයේ විපුල කොට ලබනසුලු වූයේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආස්‍රවයන්ගේ ක්ෂයවීමෙන් අනාස්‍රව වූ චෙතොවිමුක්තිය හා ප්‍රඥාවිමුක්තිය හා තෙමේ විශිෂ්ටඥානයෙන් දැන පසක් කොට එයට එළඹ වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ කරුණු පසින් සමන්වාගත මහණ අරණ්‍යයෙහි වානප්‍රස්ථයෙහි වනපර්ය්‍යන්තයෙහි ශයනාසනයන් සෙවුනට නිසි වේ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඵාසුවිහාර වර්ගය පළමු වැනි යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "එහි උද්දානය:",
                        "type": "unindented"
                    },
                    {
                        "text": "වෙසාරජ්ජ සූත්‍රය, සඞ්කිත සූත්‍රය, මහාචොර සූත්‍රය, සමණ සුඛුමාල සූත්‍රය, පස්වැනි ඵාසුවිහාර සූත්‍රය, ආනන්ද සූත්‍රය, සීලසම්පන්න සූත්‍රය, අසෙඛ සූත්‍රය, චාතුද්දිස සූත්‍රය, අරඤ්ඤ සූත්‍රය දැයි සූත්‍ර දශයෙකි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 220,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "2. අන්ධකවින්දවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 2. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(කුලූපගසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "11. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො කුලූපගො භික්ඛු කුලෙසු අප්පියො ච හොති අමනාපො ච අගරු ච අභාවනීයො ච. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අසන්ථුතවිස්සාසී{1} ච හොති, අනිස්සරවිකප්පී ච, වියත්ථුපසෙවී{2}ච, උපකණ්ණකජප්පී ච, අතියාචනකො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො කුලූපගො භික්ඛු කුලෙසු අප්පියො ච හොති අමනාපො ච අගරු ච අභාවනීයො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො කුලූපගො භික්ඛු කුලෙසු පියො ච හොති මනාපො ච ගරු ච භාවනීයො ච. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "න අසන්ථුතවිස්සාසී{3} ච හොති, න අනිස්සරවිකප්පී ච, න වියත්ථුපසෙවී{2}ච, න උපකණ්ණකජප්පී ච, න අතියාචනකො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො කුලූපගො භික්ඛු කුලෙසු පියො ච හොති මනාපො ච ගරු ච භාවනීයො චාති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 2. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පච්ඡාසමණසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "12. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො පච්ඡාසමණො න ආදාතබ්බො. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අතිදූරෙ වා ගච්ඡති අච්චාසන්නෙ වා, න පත්තපරියාපන්නං ගණ්හාති, ආපත්තිසාමන්තා භණමානං න නිවාරෙති, භණමානස්ස අන්තරන්තරා කථං ඔපාතෙති, දුප්පඤ්ඤො හොති ජළො එළමූගො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො පච්ඡාසමණො න ආදාතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො පච්ඡාසමණො ආදාතබ්බො. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "නාතිදූරෙ ගච්ඡති න අච්චාසන්නෙ, පත්තපරියාපන්නං ගණ්හාති, ආපත්තිසාමන්තා භණමානං නිවාරෙති, භණමානස්ස න අන්තරන්තරා කථං ඔපාතෙති, පඤ්ඤවා හොති අජළො අනෙළමූගො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො පච්ඡාසමණො ආදාතබ්බොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අසනථවවිස්සාසී - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. විසට්ඨූපසෙවී - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අසනථවවිස්සාසී - මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "2. අන්ධකවින්ද වර්ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "5.3.2.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කුලුපග සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "11. මහණෙනි, කරුණු පසෙකින් සමන්වාගත කුලොපග මහණ කුලයෙහි අප්‍රිය, අමනාප, අගරු, අභාවනීය (බුහුමනට අනිසි) ද වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "අසංස්තුතයන් (තමා හා මිත්‍ර නොවූවන්) කෙරෙහි විශ්වාස ඇතියේද වෙයි. අනීශ්වර වූයේ (අධිපතියකු සෙයින්) විකල්පන (විධාන) කරනුයේ ද වෙයි. වියත්ථුපසෙවි (විඝටිත කුලයන් නැවත ඝටනුවස් සෙවුනේ) ද වෙයි. උපකර්‍ණජලපී (කණෙහි කොඳුරණුයේ) ද වෙයි. අතියාචනක (ඉබොහෝ යදනේ) ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පඤ්චධර්‍මයෙන් සමන්වාගත කුලොපග මහණ කුලන්හි අප්‍රිය, අමනාප, අගරු, අභාවනීය ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කරුණු පසෙකින් සමන්වාගත කුලොපග මහණ කුලෙහි ප්‍රිය, මනාප, ගරු, භාවනීය ද වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "අසංස්තුතයන් කෙරෙහි විශ්වාස ඇතියේ ද නො වෙයි. ඊශ්වරවිකල්පී ද නො වෙයි. වියත්ථූපසෙවී ද නො වෙයි. උපකර්‍ණජල්පී ද නො වෙයි. අතියාචනක ද නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පඤ්චධර්‍මයෙන් සමන්වාගත කුලොපග මහණ කුලයෙහි ප්‍රිය, මනාප, ගරු, භාවනීය (බුහුමනට නිසි) ද වේ යයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.2.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පච්ඡාසමණ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "12. මහණෙනි, කරුණු පසෙකින් සමන්වාගත පසුමහණ (උවටැන් සඳහා තමා කැටුව යන මහණ සේ) නො ගත යුත්තේය. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉතා දුරෙහි හෝ යෙයි, අත්‍යාසන්නයෙහි හෝ යෙයි, පාත්‍රපර්‍ය්‍යාපන්නය (පාත්‍රයෙන් දුන් දැය) නො ගන්නේ වෙයි. ආපත්ති සාමන්ත කොට (ඇවැත් වියහැකි) වචන බණනුවහු (මෙබඳු බස් නො කිය යුතුයයි) නො වළහන්නේ ය. ඔහු (උවදෑ තෙරුන්) බෙණෙත් ම අතරතුරැ කථා හෙලණුයේ වෙයි. ජඩ (බුද්ධි රහිත) වූයේ කෙළතොලු වූයේ දුස්ප්‍රාඥ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ ධර්‍ම පසින් සමන්වාගත පසුමහණ නො ගත යුත්තේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කරුණු පසෙකින් සමන්වාගත පසුමහණ ගතයුතු වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉතා දුරෙහි නොයෙයි, ඉතා ආසන්නයෙහි නොයෙයි. පාත්‍රපර්‍ය්‍යාපන්නය ගන්නේය. ආපත්ති සාමන්ත කොට බණන්නහු වළහන්නේ ය. ඔහු බණත් ම අතරතුර කථා නො හෙළන්නේය. ජඩ නො වූයේ කෙළතොලු නො වූයේ ප්‍රාඥ (නැණවත්) වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පඤ්චධර්‍මයෙන් සමන්වාගත පසුමහණ ගතයුතු වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 222,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5. 3. 2. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සම්මාසමාධිසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "13. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො භික්ඛු අභබ්බො සම්මාසමාධිං උපසම්පජ්ජ විහරිතුං. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ, භික්ඛු අක්ඛමො හොති රූපානං, අක්ඛමො සද්දානං, අක්ඛමො ගන්ධානං, අක්ඛමො රසානං, අක්ඛමො ඵොට්ඨබ්බානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතතො භික්ඛු අභබ්බො සම්මාසමාධිං උපසම්පජ්ජ විහරිතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො භික්ඛු භබ්බො සම්මාසමාධිං උපසම්පජ්ජ විහරිතුං. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ, භික්ඛු ඛමො හොති රූපානං, ඛමො සද්දානං, ඛමො ගන්ධානං, ඛමො රසානං, ඛමො ඵොට්ඨබ්බානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු භබ්බො සම්මාසමාධිං උපසම්පජ්ජ විහරිතුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 2. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අන්ධකවින්දසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "14. එකං සමයං භගවා මගධෙසු විහරති **අන්ධකවින්දෙ**. අථ ඛො ආයස්මා **ආනන්දො** යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො ආයස්මන්තං ආනන්දං භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "යෙ තෙ ආනන්ද භික්ඛූ නවා අචිරපබ්බජිතා අධුනාගතා ඉමං ධම්මවිනයං, තෙ වො ආනන්ද භික්ඛූ පඤ්චසු ධම්මෙසු සමාදපෙතබ්බා, නිවෙසෙතබ්බා, පතිට්ඨාපෙතබ්බා. කතමෙසු පඤ්චසු:"
                    },
                    {
                        "type": "paragraph",
                        "text": "”එථ තුම්හෙ ආවුසො, සීලවා හොථ පාතිමොක්ඛසංවරසංවුතා විහරථ ආචාරගොචරසම්පන්නා, අණුමත්තෙසු වජ්ජෙසු භයදස්සාවිනො සමාදාය සික්ඛථ සික්ඛාපදෙසූති” ඉති පාතිමොක්ඛසංවරෙ සමාදපෙතබ්බා, නිවෙසෙතබ්බා, පතිට්ඨාපෙතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "“එථ තුම්හෙ ආවුසො, ඉන්ද්රියෙසු ගුත්තද්වාරා විහරථ ආරක්ඛසතිනො නිපක්කසතිනො සාරක්ඛිතමානසා සතාරක්ඛෙන චෙතසා සමන්නාගතාති.” ඉති ඉන්ද්රියසංවරෙ සමාදපෙතබ්බා, නිවෙසෙතබ්බා, පතිට්ඨාපෙතබ්බා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5.3.2.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සම්මාසමාධි සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "13. මහණෙනි, පඤ්චධර්‍මයෙකින් සමන්වාගත මහණ සම්‍යක් සමාධියට එළඹ වාස කරන්නට අභව්‍ය (නුසුදුසු) වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ රූපයන් නො සහනේ වෙයි. ශබ්දයන් නො සහනේ වෙයි. ගන්ධයන් නො සහනේ වෙයි. රසයන් නො සහනේ වෙයි. ස්ප්‍රෂ්ටව්‍යයන් නො සහනේ වෙයි. (රූපාදි අරමුණු පසෙහි ඇලුනේ වෙයි.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පඤ්චධර්‍මයෙන් සමන්වාගත මහණ සම්‍යක් සමාධියට එළඹ වෙසෙනුවට අභව්‍ය වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පඤ්චධර්‍මයෙකින් සමන්වාගත මහණ සම්‍යක් සමාධියට එළඹ වාසකරණුවට භව්‍ය වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ රූපයන් සහනේ වෙයි. ශබ්දයන් සහනේ වෙයි. ගන්ධයන් සහනේ වෙයි. රසයන් සහනේ වෙයි. ස්ප්‍රෂ්ටව්‍යයන් සහනේ වෙයි. (රූපාදි අරමුණු පසෙහි නො ඇලුනේ වෙයි.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පඤ්චධර්‍මයෙන් සමන්වාගත මහණ සම්‍යක්සමාධියට එළඹ වසන්නට භව්‍ය වෙ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.2.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අන්ධකවින්ද සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "14. එක් කලෙක භාග්‍යවතුන් වහන්සේ මගධරට අන්ධකවින්දයෙහි වැඩවසන සේත. එකල්හි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් කරා එළඹියහ. එළඹ භාග්‍යවතුන් සකසා වැඳ එකත්පසෙක හුන්හ. එකත්පසෙක හුන් ආයුෂ්මත් ආනන්ද තෙරුන්හට භාග්‍යවතුන් වහන්සේ තෙල වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්දයෙනි, නවක වූ පැවිදිව නොබෝ කල් ඇති මෙ සස්නට අලුත පැමිණි යම් භික්ෂු කෙනෙක් වෙත් නම්, ආනන්දයෙනි, තොප විසින් එ මහණහු පස්දහමෙක සමාදන් කරවිය යුතු වෙති. යෙදවිය යුතු වෙති. පිහිටුවිය යුතු වෙති. කවර පසෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "“එව ඇවැත්නි, තෙපි සිල්වත් වැ, ප්‍රාතිමොක්ෂ සංවරයෙන් සංවෘතව වසව, අණුමාත්‍ර වරදෙහිදු භය දක්නාහු, ආචාරගොචරසම්පන්න වූවහු සමාදන් කොටගෙණ සිකපදයෙහි මොනවට හික්මෙව” යි සීල සංවරයෙහි සමාදන් කරවියයුතු වෙති, යෙදවියයුතු වෙති, පිහිටුවියයුතු වෙති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "“එව ඇවැත්නි, තෙපි ඉන්ද්‍රියයෙහි පියු දොර ඇතිවැ වසවු, (ද්වාරයන්) ආරක්ෂා කරණ සිහි ඇතිවැ (ද්වාරයන්) රක්නා සිහි නුවණ ඇතිවැ මොනවට රක්නාලද සිත් ඇතිවැ ස්මෘති ආරක්ෂා සහිත සිතින් සමන්වාගත වූවහු වාස තරව” යි ඉන්ද්‍රියසංවරයෙහි සමාදන් කරවියයුතු වෙති, යෙදවියයුතු වෙති, පිහිටුවියයුතු වෙති.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 224,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“එථ තුම්හෙ ආවුසො, අප්පභස්සා හොථ භස්සෙ පරියන්තකාරිනොති” ඉති භස්සපරියන්තෙ සමාදපෙතබ්බා, නිවෙසෙතබ්බා, පතිට්ඨාපෙතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "“එථ තුම්හෙ ආවුසො, ආරඤ්ඤකා හොථ අරඤ්ඤෙ වනපත්ථානි{1}පන්තානි සෙනාසනානි පටිසෙවථා”ති ඉති කායවූපකාසෙ සමාදපෙතබ්බා, නිවෙසෙතබ්බා, පතිට්ඨාපෙතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "“එථ තුම්හෙ ආවුසො, සම්මාදිට්ඨිකා හොථ සම්මාදස්සනෙන සමන්නාගතාති” ඉති සම්මාදස්සනෙ සමාදපෙතබ්බා, නිවෙසෙතබ්බා, පතිට්ඨාපෙතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "යෙ තෙ ආනන්ද, භික්ඛූ නවා අචිරපබ්බජිතා අධුනාගතා ඉමං ධම්මවිනයං, තෙ වො ආනන්ද භික්ඛූ ඉමෙසු පඤ්චසු ධම්මෙසු සමාදපෙතබ්බා, නිවෙසෙතබ්බා, පතිට්ඨාපෙතබ්බාති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 2. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(මච්ඡරීසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "15. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං නිරයෙ: කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ආවාසමච්ඡරිනී හොති, කුලමච්ඡරිනී හොති, ලාභමච්ඡරිනී හොති, වණ්ණමච්ඡරිනී හොති, ධම්මමච්ඡරිනී හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං නිරයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතා භික්ඛුනී යථභතං නික්ඛිත්තා එවං සග්ගෙ. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "න ආවාසමච්ඡරිනී හොති, න කුලමච්ඡරිනී හොති, න ලාභමච්ඡරිනී හොති, න වණ්ණමච්ඡරිනී හොති, න ධම්මමච්ඡරිනී හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං සග්ගෙති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 2. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(වණ්ණසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "16. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං නිරයෙ. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනනුවිච්ච අපරියොගාහෙත්වා අවණ්ණාරහස්ස වණ්ණං භාසති. අනනුවිච්ච අපරියොගාහෙත්වා වණ්ණාරහස්ස අවණ්ණං භාසති. අනනුවිච්ච අපරියොගාහෙත්වා අප්පසාදනීයෙ ඨානෙ පසාදං උපදංසෙති. අනනුවිච්ච අපරියොගාහෙත්වා පසාදනීයෙ ඨානෙ අප්පසාදං උපදංසෙති. සද්ධාදෙය්යං විනිපාතෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං නිරයෙ."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අරඤ්ඤවනපත්ථානි - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "“එව ඇවැත්නි, තෙපි කථාප්‍රර්‍ය්‍යන්ත ඇති වැ අල්පකථා ඇතිවව” යි මෙසේ කථාප්‍රර්‍ය්‍යන්තයෙහි (සීමාසහිත කථායෙහි) සමාදන් කරවිය යුතු වෙති, යෙදවිය යුතු වෙති, පිහිටුවාලිය යුතු වෙති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "“එව ඇවැත්නි තෙපි අරණ්‍යසෙනසුන් ඇති වව, අරණ්‍යයෙහි වානප්‍රස්ථ ප්‍රාන්තශයනාසනයන් සෙවන කරව” යි මෙසේ කායවිවේකයෙහි සමාදන් කරවිය යුතු වෙති, යෙදවිය යුතු වෙති, පිහිටුවාලිය යුතු වෙති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "“එව ඇවැත්නි, තෙපි සම්දිටු ඇත්තාහු සම්‍යග් දර්‍ශනයෙන් සමන්වාගත වව” යි මෙසේ සම්‍යග්දර්‍ශනයෙහි සමාදන් කරවිය යුත්තාහ, යෙදවිය යුත්තාහ, පිහිටුවාලිය යුත්තාහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්දයෙනි, නවක වූ, පැවිදිව නොබෝ කල් ඇති, මේ ධම්මවිනයට අලුත පැමිණි, යම් මහණහු වෙත් නම් තොප විසින්, ආනන්දයෙනි, එ මහණහු මේ පඤ්චධර්‍මයෙහි සමාදන් කරවිය යුත්තාහ, යෙදවිය යුත්තාහ, පිහිටුවාලිය යුත්තාහයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.2.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මච්ඡරී සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "15. මහණෙනි, පඤ්චධර්‍මයෙකින් සමන්වාගත මෙහෙණ ගෙණවුත් බහා තැබූවක සෙයින් නිරයෙහි (උපදනී) වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආවාසයෙහි මසුරුබව ඇත්ති වෙයි, කුලයෙහි මසුරුබව ඇත්තී වෙයි, ලාභයෙහි මසුරුබව ඇත්තී වෙයි, වර්‍ණ (ගුණ) යෙහි මසුරුබව ඇත්තී වෙයි, ධර්‍මයෙහි මසුරුබව ඇත්තී වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ පස් කරුණින් සමන්වාගත මෙහෙණ ගෙණවුත් බහා තැබුවක සෙයින් නිරයෙහි (උපදනී) වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පඤ්චධර්‍මයෙකින් සමන්වාගත මෙහෙණ ගෙණවුත් තැබූවක සෙයින් ස්වර්‍ගයෙහි (උපදිනී) වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආවාසමාත්සර්‍ය්‍ය ඇත්තී නො වෙයි, කුල (උපස්ථායක කුලයෙහි) මාත්සර්‍ය්‍ය ඇත්තී නො වෙයි, ලාභමාත්සර්‍ය්‍ය ඇත්තී නො වෙයි, වර්‍ණමාත්සර්‍ය්‍ය ඇත්තී නො වෙයි, ධර්මමාත්සර්‍ය්‍ය ඇත්තී නොවේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ ධර්‍මපසින් සමන්වාගත මෙහෙණ ගෙණවුත් බහා තැබූවක සෙයින් සවර්‍ගයෙහි (උපදනී) වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.2.6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "වණ්ණා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "16. මහණෙනි, කරුණු පසෙකින් සමන්වාගත මෙහෙණ ගෙණවුත් තැබුවක සෙයින් නිරයෙහි (උපදනී) වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නො දැන නො විමසා අවර්‍ණාර්‍හයාට (ගුණනැත්තාහට) වර්‍ණ (ගුණ) බෙණෙයි, නො දැනැ නො විමසා වර්‍ණාර්‍හයාට (ගුණැත්තාහට) අවර්‍ණ (අගුණ) බෙණෙයි, නො දැනැ නො විමසා නො පැහැදිය යුතු තන්හි ප්‍රසාදය උපදවයි. නො දැනැ නො විමසා පැහැදිය යුතු තන්හි අප්‍රසාදය උපදවයි. ශ්‍රද්ධාදෙයය (සැදැහැයෙන් දුන් දෙය) විනිපාතන (නසාලිම්) කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පඤ්ච ධර්‍මයෙන් සමන්වාගත මෙහෙණ ගෙණවුත් බහා තැබුවක සෙයින් නිරයෙහි (උපදනී) වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 226,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං සග්ගෙ. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනුවිච්ච පරියොගාහෙත්වා අවණ්ණාරහස්ස අවණ්ණං භාසති, අනුවිච්ච පරියොගාහෙත්වා වණ්ණාරහස්ස වණ්ණං භාසති, අනුවිච්ච පරියොගාහෙත්වා අප්පසාදනීයෙ ඨානෙ අප්පසාදං උපදංසෙති, අනුවිච්ච පරියොගාහෙත්වා පසාදනීයෙ ඨානෙ පසාදං උපදංසෙති, සද්ධාදෙය්යං න විනිපාතෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතා භික්ඛුණී යථාභතං නික්ඛිත්තා එවං සග්ගෙති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 2. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ඉස්සුකීසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "17. පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතා භික්ඛුණී යථාභතං නික්ඛිත්තා එවං නිරයෙ. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනනුවිච්ච අපරියොගාහෙත්වා අවණ්ණාරහස්ස වණ්ණං භාසති, අනනුවිච්ච අපරියොගාහෙත්වා වණ්ණාරහස්ස අවණ්ණං භාසති, ඉස්සුකිනී ච හොති, මච්ඡරිනී ච, සද්ධාදෙය්යං විනිපාතෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං නිරයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං සග්ගෙ. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනුවිච්ච පරියොගාහෙත්වා අවණ්ණාරහස්ස අවණ්ණං භාසති, අනුවිච්ච පරියොගාහෙත්වා වණ්ණාරහස්ස වණ්ණං භාසති, අනිස්සුකී ච හොති, අමච්ඡරිනී ච, සද්ධාදෙය්යං න විනිපාතෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතා භික්ඛුණී යථාභතං නික්ඛිත්තා එවං සග්ගෙති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 2. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(මිච්ඡාදිට්ඨිකසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "18. පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං නිරයෙ. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනනුවිච්ච අපරියොගාහෙත්වා අවණ්ණාරහස්ස වණ්ණං භාසති, අනනුවිච්ච අපරියොගාහෙත්වා වණ්ණාරහස්ස අවණ්ණං භාසති, මිච්ඡාදිට්ඨිකා ච හොති, මිච්ඡාසඞ්කප්පා ච, සද්ධාදෙය්යං විනිපාතෙති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, පඤ්චධර්‍මයෙකින් සමන්වාගත මෙහෙණ ගෙණවුත් තැබූවක සෙයින් ස්වර්‍ගයෙහි (උපදිනී) වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "දැනැ (කරුණු) විමසා අවර්‍ණාර්‍හයාට අවර්‍ණ බෙණෙයි, දැනැ විමසා වර්‍ණාර්‍හයාට වර්‍ණ බෙණෙයි, දැනැ විමසා නො පැහැදිය යුතු තන්හි අප්‍රසාදය උපදවයි, දැනැ විමසා පැහැදිය යුතු තන්හි ප්‍රසාදය උපදවයි, ශ්‍රද්ධාදෙයය (සැදැහැයෙන් දුන් දැය) විනිපාතන (විනාශ) නො කෙරෙයි."
                    },
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසින් සමන්වාගත මෙහෙණ ගෙණවුත් බහා තැබූවක එසෙයින් ස්වර්‍ගයෙහි වේ යයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.2.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඉස්සුකී සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]‍",
                        "type": "unindented"
                    },
                    {
                        "text": "17. මහණෙනි, ධර්‍ම පසෙකින් සමන්වාගත මෙහෙණ ගෙණවුත් බහා තැබූවක සෙයින් නිරයෙහි වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නො දැනැ නො විමසා අවර්‍ණාර්‍හයාට ගුණ කියයි, නො දැනැ නො විමසා වර්‍ණාර්‍හයාට නුගුණ කියයි. ඊර්‍ෂ්‍යා ඇත්තී ද වෙයි, මාත්සර්‍ය්‍ය ඇත්තී ද වෙයි, ශ්‍රද්ධාදෙයය විනිපාතන කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසින් සමන්වාගත මෙහෙණ ගෙණවුත් බහා තැබුවක සෙයින් නිරයෙහි වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කරුණු පසෙකින් සමන්වාගත මෙහෙණ ගෙණවුත් බහා තැබූවක සෙයින් ස්වර්‍ගයෙහි වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "දැනැ විමසා අවර්‍ණාර්‍හයාට අවර්‍ණ කියයි, දැනැ විමසා වර්‍ණාර්‍හයාට වර්‍ණ කියයි, ඊර්‍ෂ්‍යා නැත්තී ද වෙයි, මාත්ස්‍යර්‍ය නැත්තී ද වෙයි, ශ්‍රද්ධාදෙයය විනිපාතන නො කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසින් සමන්වාගත මෙහෙණ ගෙණවූත් බහා තැබූවක සෙයින් ස්වර්‍ගයෙහි වේ යයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.2.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මිච්ඡාදිට්ඨික සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "18. මහණෙනි, කරුණු පසෙකින් සමන්වාගත මෙහෙණ ගෙණවුත් බහා තැබුවක සෙයින් නිරයෙහි වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නො දැනැ නො විමසා ගුණ නො වැණිය යුතුවහුගේ ගුණ කියයි. නො දැනැ නො විමසා ගුණ වැණිය යුතුවහුගේ අගුණ කියයි. මිසදිටු ඇත්තී ද වෙයි. මිථ්‍යාසංකල්ප ඇත්තී ද වෙයි. ශ්‍රද්ධාදෙයය විනිපාතන කෙරෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 228,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං නිරයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං සග්ගෙ. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනුවිච්ච පරියොගාහෙත්වා අවණ්ණාරහස්ස අවණ්ණං භාසති, අනුවිච්ච පරියොගාහෙත්වා වණ්ණාරහස්ස වණ්ණං භාසති, සම්මාදිට්ඨිකා ච හොති, සම්මාසඞ්කප්පා ච, සද්ධාදෙය්යං න විනිපාතෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං සග්ගෙති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 2. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(මිච්ඡාවාචා සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "19. පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං නිරයෙ. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනනුවිච්ච අපරියොගාහෙත්වා අවණ්ණාරහස්ස වණ්ණං භාසති, අනනුවිච්ච අපරියොගාහෙත්වා වණ්ණාරහස්ස අවණ්ණං භාසති, මිච්ඡාවාචා ච හොති, මිච්ඡාකම්මන්තා ච, සද්ධාදෙය්යං විනිපාතෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං නිරයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං සග්ගෙ. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනුවිච්ච පරියොගාහෙත්වා අවණ්ණාරහස්ස අවණ්ණං භාසති, අනුවිච්ච පරියොගාහෙත්වා වණ්ණාරහස්ස වණ්ණං භාසති, සම්මාවාචා ච හොති, සම්මා කම්මන්තා ච, සද්ධාදෙය්යං න විනිපාතෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං සග්ගෙති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 2. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(මිච්ඡාවායාම සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "20. පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං නිරයෙ. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනනුවිච්ච අපරියොගාහෙත්වා අවණ්ණාරහස්ස වණ්ණං භාසති, අනනුවිච්ච අපරියොගාහෙත්වා වණ්ණාරහස්ස අවණ්ණං භාසති, මිච්ඡාවායාමා ච හොති, මිච්ඡාසතිනී ච, සද්ධාදෙය්යං විනිපාතෙති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසින් සමන්වාගත මෙහෙණ ගෙණවුත් බහා තැබූවක සෙයින් නිරයෙහි වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කරුණු පසෙකින් යුත් මෙහෙණ ගෙණවුත් බහා තැබූවක සෙයින් ස්වර්‍ගයෙහි වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නුවණින් දැනැ කරුණු විමසා නුගුණ කියයුත්තාහට නුගුණ කියයි. දැනැ කරුණු විමසා ගුණ කියයුත්තාහට ගුණ කියයි. සම්‍යක්දෘෂ්ඨි ඇත්තී ද වෙයි. සම්‍යක්සංකල්ප ඇත්තී ද වෙයි. ශ්‍රද්ධාදෙයය විනිපාතන නො කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසින් යුත් මෙහෙණ ගෙණවුත් බහා තැබූවක සේ ස්වර්‍ගයෙහි වේ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.2.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මිච්ඡාවාචා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "19. මහණෙනි, ධර්‍ම පසෙකින් සමන්වාගත මෙහෙණ ගෙණවුත් බහා තැබූවක සෙයින් නිරයෙහි වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නො දැනැ කරුණු නො විමසා අවර්‍ණාර්‍හයාගේ ගුණ වර්‍ණනය කියයි. නො දැනැ කරුණු නො විමසා වර්‍ණාර්‍හයාගේ අවර්‍ණය කියයි. මිථ්‍යාවචන ඇත්තී වෙයි. මිථ්‍යාකර්‍මාන්ත ඇත්තී වෙයි. ශ්‍රද්ධාදෙයය විනිපාතන කරයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පඤ්චධර්‍මයෙන් සමන්වාගත භික්ෂුණී ගෙණවුත් බහා තැබූවක සෙයින් නිරයෙහි (උපදිනී) වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ධර්‍ම පසෙකින් සමන්වාගත මෙහෙණ ගෙණවුත් බහා තැබූවක සෙයින් ස්වර්‍ගයෙහි (උපදිනී) වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "දැනැ කරුණු විමසා අවර්‍ණාර්‍හයාගේ අවර්‍ණය කියයි. දැනැ කරුණු විමසා වර්‍ණාර්‍හයාගේ ගුණ කියයි. සම්‍යග්වචන ඇත්තී වෙයි. සම්‍යක්කර්‍මාන්ත ඇත්තී ද වෙයි. ශ්‍රද්ධාදෙයය විනිපාතන නො කරයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ දහම් පසින් සමන්වාගත මෙහෙණ ගෙණවුත් බහා තැබූවක සෙයින් ස්වර්‍ගයෙහි උපදිනී වේ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.2.10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මිච්ඡාවායාම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "20. මහණෙනි, ධර්‍ම පසෙකින් සමන්වාගත භික්ෂුණී ගෙණවුත් බහා තැබුවක සෙයින් නිරයෙහි (උපදිනී) වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නො දැනැ කරුණු නො විමසා අවර්‍ණාර්‍හයාගේ ගුණ කියයි. නො දැනැ කරුණු නො විමසා වර්‍ණාර්‍හයාගේ නුගුණ කියයි. මිථ්‍යාව්‍යයාම ඇත්තී ද වෙයි. මිථ්‍යාස්මෘති ඇත්තී ද වෙයි. ශ්‍රද්ධාදෙයය විනිපාතන ‍කෙරෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 230,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං නිරයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං සග්ගෙ කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනුවිච්ච පරියොගාහෙත්වා අවණ්ණාරහස්ස අවණ්ණං භාසති, අනුවිච්ච පරියොගාහෙත්වා වණ්ණාරහස්ස වණ්ණං භාසති, සම්මාවායාමා ච හොති, සම්මාසතිනී ච, සද්ධාදෙය්යං න විනිපාතෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතා භික්ඛුනී යථාභතං නික්ඛිත්තා එවං සග්ගෙති."
                    },
                    {
                        "type": "centered",
                        "text": "අන්ධකවින්දවග්ගො දුතියො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තසසුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "කුලූපගො, පච්ඡාසමණො සමාධි අන්ධකවින්දං\nමච්ඡරී වණ්ණනා ඉස්සා දිට්ඨිවාචාය වායාමාති.{1}",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. වායාමො - සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මේ ධර්‍ම පසින් සමන්වාගත භික්ෂුණී ගෙණවුත් බහා තැබූවක සෙයින් නිරයෙහි වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කරුණු පසෙකින් යුත් භික්ෂුණී ගෙණවුත් බහා තැබූවක සේ සවර්‍ගයෙහි වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "දැනැ කරුණු විමසා අවර්‍ණාර්‍හයාගේ නුගුණ කියයි. දැනැ කරුණු විමසා වර්‍ණාර්‍හයාගේ ගුණ කියයි. සම්‍යග්ව්‍යායාම ඇත්තී ද වෙයි. සම්‍යක්ස්මෘති ඇත්තී ද වෙයි. ශ්‍රද්ධාදෙයය විනිපාතන නො කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ කරුණු පසින් සමන්වාගත භික්ෂුණී ගෙණවුත් බහා තැබූවක සෙයින් ස්වර්‍ගයෙහි (උපදිනී) වේ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අන්ධකවින්දවර්‍ගය දෙවැනි යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "එහි උද්දානය:",
                        "type": "unindented"
                    },
                    {
                        "text": "කුලූපග සූත්‍රය, පච්ඡාසමණ සූත්‍රය, සම්මාසමාධි සූත්‍රය, අන්ධකවින්ද සූත්‍රය, මච්ඡරිනී සූත්‍රය, වණ්ණ සූත්‍රය, ඉස්සුකීය සූත්‍රය, මිච්ඡාදිට්ඨික සූත්‍රය, මිච්ඡාවාචා සූත්‍රය, මිච්ඡාවායාම සූත්‍රය යි සූත්‍ර දශයෙකි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 232,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. ගිලානවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 3. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ගිලානසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "21. එකං සමයං භගවා **වෙසාලියං** විහරති මහාවනෙ **කූටාගාරසාලායං**. අථ ඛො භගවා සායන්හසමයං පතිසල්ලානා වුට්ඨිතො යෙන ගිලානසාලා තෙනුපසඞ්කමි. අද්දසා ඛො භගවා අඤ්ඤතරං භික්ඛුං දුබ්බලං ගිලානකං. දිස්වා පඤ්ඤත්තෙ ආසනෙ නිසීදි. නිසජ්ජ ඛො භගවා භික්ඛූ ආමන්තෙසි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "යං කඤ්චි{1} භික්ඛවෙ දුබ්බලං{2} ගිලානකං පඤ්ච ධම්මා න විජහන්ති, තස්සෙතං පාටිකඞ්ඛං: න චිරස්සෙව ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරිස්සතීති කතමෙහි පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු අසුභානුපස්සී කායෙ විහරති, ආහාරෙ පටික්කූලසඤ්ඤී, සබ්බලොකෙ අනභිරතසඤ්ඤී, සබ්බසංඛාරෙසු අනිච්චානුපස්සී, මරණසඤ්ඤා ඛො පනස්ස අජ්ඣත්තං සූපට්ඨිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යං කඤ්චි{1} භික්ඛවෙ දුබ්බලං{2} ගිලානකං ඉමෙ පඤ්ච ධම්මා න විජහන්ති, තස්සෙතං පාටිකඞ්ඛං: න චිරස්සෙව ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරිස්සතීති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 3. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සතිසූපට්ඨිතසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "22. යො හි කොචි භික්ඛවෙ භික්ඛු වා භික්ඛුනී වා පඤ්ච ධම්මෙ භාවෙති, පඤ්ච ධම්මෙ බහුලීකරොති, තස්ස ද්වින්නං ඵලානං අඤ්ඤතරං ඵලං පාටිකඞ්ඛං: දිට්ඨෙව ධම්මෙ අඤ්ඤා, සති වා උපදිසෙසෙ අනාගාමිතා. කතමෙ පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛුනො අජ්ඣත්තං යෙව සති සූපට්ඨිතා හොති, ධම්මානං උදයත්ථගාමිනියා පඤ්ඤාය අසුභානුපස්සී කායෙ විහරති, ආහාරෙ පටික්කූලසඤ්ඤි, සබ්බලොකෙ අනභිරතසඤ්ඤී, සබ්බසංඛාරෙසු අනිච්චානුපස්සී."
                    },
                    {
                        "type": "paragraph",
                        "text": "යො හි කොචි භික්ඛවෙ භික්ඛු වා භික්ඛුනී වා ඉමෙ පඤ්ච ධම්මෙ භාවෙති, ඉමෙ පඤ්ච ධම්මෙ බහුලීකරොති, තස්ස ද්වින්නං ඵලානං අඤ්ඤතරං ඵලං පාටිකඞ්ඛං: දිට්ඨෙව ධම්මෙ අඤ්ඤා, සති වා උපාදිසෙසෙ අනාගාමිතා."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. යංකිඤ්චි - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. භික්ඛුං දුබ්බලං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "3. ගිලාන වර්ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "5.3.3.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ගිලාන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "21. එක් කලෙක භාග්‍යවතුන් වහන්සේ විසාලායෙහි මහාවනයෙහි වූ කූටාගාරසාලායෙහි වැඩවසන සේක. එකල්හි භාග්‍යවතුන් වහන්සේ පිළිසලනින් නැඟී සිටි සේක් ගිලන්හල කරා වැඩිසේක. භාග්‍යවතුන් වහන්සේ එක්තරා දුබල ගිලන් මහණකු දුටු සේක. දැක පැන්වූ අස්නෙහි වැඩහුන්සේක. වැඩහිඳ භාග්‍යවතුන් වහන්සේ මහණුන් ඇමතූ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පඤ්චධර්‍ම කෙනෙක් යම් කිසි දුබල ගිලනක්හු නොපියා සිටිත් නම්, ඔහු විසින් නොබෝ‍කලෙකින් ම ආස්‍රවයන්ගේ ක්ෂය වීමෙන් ආස්‍රව රහිතවූ චිත්තවිමුක්තිය ද, ප්‍රඥාවිමුක්තිය ද තෙමේ දැනැ ප්‍රත්‍යක්ෂ කොට එයට පැමිණ වාස කරන්නේ ය යන තෙල කරුණ කැමැති විය යුතු යි. කවර පස් දෙනෙක් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ කරජකායයෙහි අශුභය නුවණින් දක්මින් වෙසෙයි. ආහාරයෙහි ප්‍රතිකූලසංඥා ඇතියේ, හැම ‍ලොව්හි අනභිරතසංඥා ඇතියේ, හැම සංස්කාරයෙහි අනිත්‍යානුදර්ශිව වෙසෙයි. මරණසංඥාව ඔහුගේ සිත්හි මොනොවට එළඹ සිටියා වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පඤ්ච ධර්‍මයෝ යම් කිසි දුබල ගිලනක්හු නො පියා සිටිත් නම්, ඔහු විසින් නොබෝ‍කලෙකින් ම ආස්‍රව ක්ෂය වීමෙන් ආස්‍රව රහිත වූ චිත්තවිමුක්තිය ප්‍රඥාවිමුක්තිය තෙමේ දැනැ පසක් කොට එයට පැමිණ වාස කරන්නේ ය යන තෙල කරුණ කැමැති විය යුතු යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.3.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සතිසූපට්ඨිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "(සැවැත්නිදාන යි)",
                        "type": "unindented"
                    },
                    {
                        "text": "22. මහණෙනි, යම් කිසි මහණෙක් වේවයි, මෙ‍හෙණක් වේවයි, කරුණු පසක් වඩා නම්, කරුණු පසක් බහුල කෙරේ නම්, ඔහු විසින් ඉහාත්මයෙහි ම අර්‍හත්ත්වය හෝ උපාදිශෙෂයක් ඇතිවත් ම අනාගාමිත්වය හෝ යන උභය ඵලයන් අතුරෙන් අන්‍යතර ඵලයෙක් කැමැති විය යුතු. කවර පසෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්ණෙහි මහණහුගේ අධ්‍යාත්මයෙහිම ස්මෘතිය මැනැවින් එළැඹ සිටියා වෙයි. ස්කන්ධධර්මයන්ගේ උදයව්‍යය පිරිසිඳිනට සමර්‍තථ වූ ප්‍රඥායෙන් කයෙහි අශුභානුදර්ශි වූයේ, ආහාරයෙහි ප්‍රතිකූලසංඥා ඇතියේ, හැම ලොව්හි අනභිරතසංඥා ඇතියේ, සර්‍වසංස්කාරයෙහි අනිත්‍යානුදර්ශි ව වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් කිසි මහණෙක් වේවයි, මෙ‍හෙණක් වේවයි, මේ පඤ්චධර්‍මයන් වඩනේ ද, මේ පඤ්චධර්‍මයන් බහුල කෙරේ ද, ඔහු විසින් ඉහාත්මයෙහි ම අර්‍හත්ත්වය හෝ උපාදිශෙෂයක් ඇති වත් ම අනාගාමිත්වය හෝ යන උභය ඵලයන්ගෙන් අතුරෙන් අන්‍යතර ඵලයෙක් කැමැති විය යුතු යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 234,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5. 3. 3. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(දූපට්ඨාකගිලානසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "23. පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො ගිලානො දූපට්ඨාකො{1} හොති. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අසප්පායකාරී හොති සප්පායෙ මත්තං න ජානාති. භෙසජ්ජං න පටිසෙවිතා හොති. අත්ථකාමස්ස ගිලානූපට්ඨාකස්ස න යථාභූතං ආබාධං ආවීකත්තා හොති. අභික්කමන්තං වා අභික්කමතීති, පටික්කමන්තං වා පටික්කමතීති ඨිතං වා ඨිතො’ති උප්පන්නානං වා සාරිරිකානං වෙදනානං දුක්ඛානං තිප්පානං ඛරානං කටුකානං අසාතානං අමනාපානං පාණහරානං අනධිවාසකජාතිකො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො ගිලානො දූපට්ඨාකො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො ගිලානො සූපට්ඨාකො හොති. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සප්පායකාරී හොති. සප්පායෙ මත්තං ජානාති. භෙසජ්ජං පටිසෙවිතා හොති. අත්ථකාමස්ස ගිලානූපට්ඨාකස්ස යථාභූතං ආබාධං ආවීකත්තා හොති: අභික්කමන්තං වා අභික්කමතීති, පටික්කමන්තං වා පටික්කමතීති, ඨිතං වා ඨිතොති. උප්පන්නානං වා සාරීරිකානං වෙදනානං දුක්ඛානං තිප්පානං ඛරානං කටුකානං අසාතානං අමනාපානං පාණහරානං අධිවාසකජාතිකො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො ගිලානො සූපට්ඨාකො හොතීති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 3. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ගිලානූපට්ඨාකසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "24. පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො ගිලානූපට්ඨාකො නාලං ගිලානං උපට්ඨාතුං. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "න පටිබලො හොති භෙසජ්ජං සංවිධාතුං. සප්පයාසප්පායං න ජානාති, අසප්පායං උපනාමෙති, සප්පායං අපනාමෙති. ආමිසන්තරො ගිලානං උපට්ඨහති නො මෙත්තචිත්තො. ජෙගුච්ඡි හොති උච්චාරං වා පස්සාවං වා වන්තං වා ඛෙලං වා නීහරිතුං න පටිබලො{2} හොති ගිලානං කාලෙන කාලං ධම්මියා කථාය සන්දස්සෙතුං සමාදපෙතුං සමුත්තෙජෙතුං සම්පහංසෙතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො ගිලානූපට්ඨාකො නාලං ගිලානං උපට්ඨාතුං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. දුපට්ඨාකො - PTS, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. නප්පටිබලො - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5.3.3.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දූපට්ඨාක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "(සැවැත්නිදාන යි)",
                        "type": "unindented"
                    },
                    {
                        "text": "23. මහණෙනි, පඤ්චධර්‍ම‍යෙකින් සමන්වාගත ගිලන් තෙමේ උවටනට නො පහසු වෙයි .කවර පසෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "අසත්ප්‍රාය (ලෙඩට අහිත) දෑ කරණ සුලුයේ වෙයි. සත්ප්‍රායයෙහි (හිත දෑහි) පමණ නොදන්නේ වෙයි. බෙහෙසද් නො සෙවුනේ වෙයි. හිත කැමති ග්ලානොපස්ථායකහට වැඩෙන රොගය වැඩේ ය යි ද සන්හිඳුනා රොගය සන්හිඳේ ය යි ද පවත්නා රොගය හෝ පවත්නේ ය යි ද යථාභූත ආබාධය පාළ නො කරණුයේ වෙයි. උපන් දුක් වූ තීව්‍ර වූ රළු වූ කටුක වූ අමධුර වූ අමනාප වූ ප්‍රාණහර වූ ශාරීරික වෙදනාවන් නො ඉවසන සුලුයේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පඤ්චධර්‍ම‍යෙන් සමන්වාගත ගිලන් තෙමේ උවටනට නො පහසු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පඤ්චධර්‍ම‍යෙකින් සමන්වාගත ගිලන් තෙමේ උවටනට පහසු වෙයි .කවර පසෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සත්ප්‍රායකාරී වෙයි. සත්ප්‍රායයෙහි පමණ දන්නේ වෙයි. බෙහෙසද් සෙවුනේ වෙයි. හිත කැමති ග්ලානොපස්ථායකයාට වැඩෙන රොගය වැඩේ ය යි ද සන්හිඳුනා රොගය සන්හිඳේ ය යි ද ස්ථිත රොගය ස්ථිත ය යි ද යථාභූත ආබාධය පාළ කරණුයේ වෙයි. උපන් දුක වු තීව්‍ර වූ රළු වූ කටුක වූ අමධුර වූ අමනාප වූ ප්‍රාණහර වූ ශාරීරික වෙදනාවන් ඉවසන සැහැවි ඇතියේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පඤ්චධර්‍ම‍යෙන් සමන්වාගත ගිලන් තෙමේ උවටනට පහසු වූයේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.3.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ගිලානූපට්ඨාක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "(සැවැත්නිඳාන යි)",
                        "type": "unindented"
                    },
                    {
                        "text": "24. මහණෙනි, මෙ පඤ්ච ධර්‍ම‍යෙන් සමන්වාගත ග්ලා‍නොපස්ථායක ගිලන් උවටනට නො නිසි වෙයි. කවර පසෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "බෙහෙසද් සංවිධාන කරන්නට ප්‍රතිබල නො වෙයි. සත්ප්‍රාය දෑ හා අසත්ප්‍රාය දෑ නො දන්නේ අසත්ප්‍රාය දෑ එළවයි, සත්ප්‍රාය දෑ බැහැර කෙරෙයි. මෙත්සිත් නැතියේ ලාභාපෙක්ෂා ඇතියේ ගිලනා වටයි. මල හෝ මූ හෝ වමන හෝ කෙළ හෝ බැහැර ලන්නට ජුගුප්සා ඇතියේ වෙයි. කලින් කල ගිලනහු දැහැමි කථායෙන් කරුණු දක්වන්නට හෝ සමාදන් කරවන්නට හෝ තෙද ගන්වන්නට හෝ පහන් කරවන්නට හෝ ප්‍රතිබල නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ පඤ්ච ධර්‍ම‍යෙන් සමන්වාගත ග්ලා‍නොපස්ථායක ගිලනුන් උවටනට නො නිසි වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 236,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො ගිලානූපට්ඨාකො අලං ගිලානං උපට්ඨාතුං. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "පටිබලො හොති භෙසජ්ජං සංවිධාතුං. සප්පායාසප්පායං ජානාති, අසප්පායං අපනාමෙති, සප්පායං උපනාමෙති. මෙත්තචිත්තො ගිලානං උපට්ඨහති නො ආමිසන්තරො. අජෙගුච්ඡී හොති උච්චාරං වා පස්සාවං වා වන්තං වා ඛෙලං වා නීහරිතූං. පටිබලො හොති ගිලානං කාලෙන කාලං ධම්මියා කථාය සන්දස්සෙතුං. සමාදපෙතුං සමුත්තෙජෙතුං සම්පහංසෙතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො ගිලානූපට්ඨාකො අලං ගිලානං උපට්ඨාතුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 3. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පඨම ආයුස්සසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "**(සාවත්ථි නිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "25. පඤ්චිමෙ භික්ඛවෙ ධම්මා අනායුස්සා. කතමෙ පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අසප්පායකාරි හොති, සප්පායෙ මත්තං න ජානාති, අපරිනතභොජී ච හොති, අකාලචාරි ච හොති, අබ්රහ්මචාරී ච. ඉමෙ ඛො භික්ඛවෙ පඤ්ච ධම්මා අනායුස්සා."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චිමෙ භික්ඛවෙ ධම්මා ආයුස්සා. කතමෙ පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සප්පායකාරී හොති, සප්පායෙ මත්තං ජානාති, පරිනතභොජී ච හොති, කාලචාරි ච හොති, බ්රහ්මචාරි ච. ඉමෙ ඛො භික්ඛවෙ පඤ්ච ධම්මා ආයුස්සා ති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 3. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(දුතිය ආයුස්සසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "26. පඤ්චිමෙ භික්ඛවෙ ධම්මා අනායුස්සා. කතමෙ පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අසප්පායකාරී හොති, සප්පායෙ මත්තං න ජානාති, අපරිනතභොජී ච හොති, දුස්සීලො ච, පාපමිත්තො ච. ඉමෙ ඛො භික්ඛවෙ පඤ්ච ධම්මා අනායුස්සා."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චිමෙ භික්ඛවෙ ධම්මා ආයුස්සා, කතමෙ පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සප්පායකාරී හොති, සප්පායෙ මත්තං ජානාති, පරිනතභොජී ච හොති, සීලවා ච, කල්යාණමිත්තො ච. ඉමෙ ඛො භික්ඛවෙ පඤ්ච ධම්මා ආයුස්සා ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, පඤ්ච ධර්‍ම‍යෙකින් සමන්වාගත ග්ලා‍නොපස්තථායක ගිලනුන් උවටනට නිස්සේ වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "බෙහෙසද් සංවිධාන කිරීමට ප්‍රතිබල වෙයි. සත්ප්‍රාය හා අසත්ප්‍රාය හා දන්නේ අසත්ප්‍රාය දෑ බැහැර කරයි, සත්ප්‍රාය එළවයි. ලාභාපෙක්ෂා නැතියේ මෙත්සිතැතියේ ගිලන්හු වටයි. මල හෝ මූ හෝ වමන හෝ කෙළ හෝ බැහැර ලනුවට ජුගුප්සා නැතියේ වෙයි. කලින් කල ගිලනහු දැහැමි කථායෙන් කරුණු ගන්වන්නට සමාදන් කරවන්නට උත්සුක කරවන්නට පහදවන්නට ප්‍රතිබල වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ පඤ්චධර්‍ම‍යෙන් සමන්වාගත ග්ලා‍නොපස්ථායකයා ගිලනුන් වටනට නිසි වේ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.3.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ප්‍රථම අනායුස්සා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "(සැවැත්නිඳාන යි)",
                        "type": "paragraph"
                    },
                    {
                        "text": "25. මහණෙනි, මේ අනායුෂ්‍ය (දායු හිතනොවු) ධර්‍ම පසෙකි. කවර පසෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "අසත්ප්‍රායකාරී වෙයි, සත්ප්‍රායයෙහි මාත්‍රා නො දන්නේ ය, අපරිණත භෝගි (ගත් අහර නොදිරූ කල්හි අනුභව කරන්නේ) ද වෙයි, නොකල්හි සැරිසරණුයේ වෙයි, බ්‍රම්සර නැතියේ ද වෙයි. මහණෙනි ,මේ අනායුෂ්‍යධර්‍ම පස යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි මේ ආයුෂ්‍ය (අයුෂට හිතකර) ධර්‍ම පසෙකි. කවර පසෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සත්ප්‍රායකාරී වේ, සත්ප්‍රායයෙහි මාත්‍රා දන්නේ ය, පරිණතභොජි ද වෙයි, කල්හි හැසිරෙණුයේ ද වෙයි, බ්‍රම්සර ඇතියේ ද වෙයි. මහණෙනි ,මේ ආයුෂ්‍ය ධර්‍ම පස යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.3.6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ද්විතීය අනායුස්සා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "(සැවැත්නිඳාන යි)",
                        "type": "unindented"
                    },
                    {
                        "text": "26. මහණෙනි, මේ අනායුෂ්‍ය ධර්‍ම පසෙකි. කවර පසෙක යත්,",
                        "type": "paragraph"
                    },
                    {
                        "text": "අසත්ප්‍රායකාරි වෙයි, සත්ප්‍රායයෙහි මාත්‍රා නො දනී, අපරිණතභොජි ද වෙයි, දුශ්හීල ද වෙයි, පවිටු මිතුරන් ඇතියේ ද වේ. මහණෙනි, මේ අනායුෂ්‍යධර්‍ම පස යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ අයුෂ්‍ය ධර්‍ම පසෙකි. කවර පසෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සත්ප්‍රායකාරී වෙයි, සත්ප්‍රායයෙහි පමණ දනී, පරිණතභෝජි ද වෙයි, සිල්වත් ද වෙයි, කලණමිතුරන් ඇතියේ ද වේ. මහණෙනි, මේ ආයුෂ්‍ය ධර්‍ම පසයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 238,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5. 3. 3. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(වපකාසසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "27. පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො භික්ඛු නාලං සඞ්ඝම්හා වපකාසිතුං. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු අසන්තුට්ඨො හොති ඉතරීතරෙන චීවරෙන, අසන්තුට්ඨො හොති ඉතරීතරෙන පිණඩපාතෙන, අසන්තුට්ඨො හොති ඉතරීතරෙන සෙනාසනෙන, අසන්තුට්ඨො හොති ඉතරීතරෙන ගිලානපච්චයභෙසජ්ජපරික්ඛාරෙන, කාමසඞ්කප්පබහුලො ච විහරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු නාලං සඞ්ඝම්හා වපකාසිතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො භික්ඛු අලං සඞ්ඝම්හා වපකාසිතුං. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු සන්තුට්ඨො හොති ඉතරීතරෙන චීවරෙන, සන්තුට්ඨො හොති ඉතරීතරෙන පිණ්ඩපාතෙන, සන්තුට්ඨො හොති ඉතරීතරෙන සෙනාසනෙන, සන්තුට්ඨො හොති ඉතරීතරෙන ගිලානපච්චයභෙසජ්ජපරික්ඛාරෙන, නෙක්ඛම්මසඞ්කප්පබහුලො ච විහරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු අලං සඞ්ඝම්හා වපකාසිතුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 3. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සමණදුක්ඛ - සුඛ සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "28. පඤ්චිමානි භික්ඛවෙ සමණදුක්ඛානි. කතමානි පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු අසන්තුට්ඨො හොති ඉතරීතරෙන චීවරෙන, අසන්තුට්ඨො හොති ඉතරීතරෙන පිණ්ඩපාතෙන, අසන්තුට්ඨො හොති ඉතරීතරෙන සෙනාසනෙන, අසන්තුට්ඨො හොති ඉතරීතරෙන ගිලානපච්චයභෙසජ්ජපරික්ඛාරෙන, අනභිරතො ච බ්රහ්මචරියං චරති. ඉමානි ඛො භික්ඛවෙ පඤ්ච සමණදුක්ඛානි."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චිමානි භික්ඛවෙ සමණසුඛානි. කතමානි පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු සන්තුට්ඨො හොති ඉතරීතරෙන චීවරෙන, සන්තුට්ඨො හොති ඉතරීතරෙන පිණ්ඩපාතෙන, සන්තුට්ඨො හොති ඉතරීතරෙන සෙනාසනෙන, සන්තුට්ඨො හොති ඉතරීතරෙන ගිලානපච්චයභෙසජ්ජපරික්ඛාරෙන, අභිරතො ච බ්රහ්මචරියං චරති. ඉමානි ඛො භික්ඛවෙ පඤ්ච සමණසුඛානී ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5.3.3.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "වපකාස සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "(සැවැත්නිදාන යි)",
                        "type": "unindented"
                    },
                    {
                        "text": "27. මහණෙනි, ධර්‍ම පසෙකින් සමන්වාගත මහණ සඟුන් කෙරෙන් වියෝ ව වසන්නට නො නිසි වෙයි. කවර පසෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සස්නෙහි මහණ ඉත‍රෙතර චීවරයෙන් (ලද පරිදි යම් මැ සිවුරකින්) නොසතුටු වෙයි. ඉතරෙතර පිණ්ඩපාතයෙන් නොසතුටු වෙයි. ඉතරෙතර ශයනාසනයෙන් නොසතුටු වෙයි. ඉතරෙතර ග්ලානප්‍රත්‍යය භෛෂජ්‍ය පරිෂ්කාරයෙන් නොසතුටු වෙයි. කාමසංකල්ප බහුල ව ද වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ පඤ්ච ධර්‍ම‍යෙන් සමන්වාගත මහණ සඟුන් කෙරෙන් වියෝ ව වසන්නට නො නිසි වේ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පඤ්ච ධර්‍ම‍යෙක්න් සමන්වාගත මහණ සඟුන් කෙරෙන් වියෝ ව වසන්නට නිසි වෙයි. කවර පසෛකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ ඉතරෙතර චීවරයෙන් සතුටු වෙයි. ඉතරෙතර පිණ්ඩපාතයෙන් සතුටු වෙයි. ඉතරෙතර ශයනාසනයෙන් සතුටු වෙයි. ඉතරෙතර ග්ලානප්‍රත්‍යභෛෂජ්‍ය පරිෂ්කාරයෙන් සතුටු වෙයි. නෛෂ්ක්‍රම්‍යසංකල්ප බහුල ව ද වෙසේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ පඤ්චධර්‍ම‍යෙන් සමන්වාගත මහණ සඟුන් කෙරෙන් වියෝ ව වසන්නට නිසි වෙ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.3.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සමණදුක්ඛ - සුඛ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "(සැවැත්නිදාන යි)",
                        "type": "unindented"
                    },
                    {
                        "text": "28. මහණෙනි, මේ මහණදුක් පසෙකි. කවර පසෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ ඉත‍‍රෙතර චීවරයෙන් නොසතුටු වෙයි. ඉතරෙතර පිණ්ඩපාතයෙන් නොසතුටු වෙයි. ඉතරෙතර ශයනාසනයෙන් නොසතුටු වෙයි. ඉතරෙතරග්ලානප්‍රත්‍යයභෛෂජ්‍යපරිෂ්කාරයෙන් නොසතුටු වෙයි. සස්නෙහි ඇලුම් නැති ව බඹසර සරයි. මහණෙනි, මේ මහණදුක් පස යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ මහණ සුව පසෙකි. කවර පසෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ ඉතරෙතර චීවරයෙන් සතුටු වෙයි. ඉතරෙතර පිණ්ඩපාතයෙන් සතුටු වෙයි. ඉතරෙතර ශයනාසනයෙන් සතුටු වෙයි. ඉතරෙතර ග්ලානප්‍රත්‍යයභෛෂජ්‍යපරිෂ්කාරයෙන් සතුටු වෙයි. සස්නෙහි ඇලුම් ඇති ව බ්‍රම්සර ද හැසිරෙයි. මහණෙනි, මේ මහණසුව පස යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 240,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5. 3. 3. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පරිකුප්පසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "29. පඤ්චිමෙ භික්ඛවෙ ආපායිකා නෙරයිකා පරිකුප්පා අතෙකිච්ඡා. කතමෙ පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "මාතා ජීවිතා වොරොපිතා හොති, පිතා ජීවිතා වොරොපිතො හොති, අරහං{1} ජීවිතා වොරොපිතො හොති, තථාගතස්ස දුට්ඨෙන චිත්තෙන ලොහිතං උප්පාදිතං හොති, සඞ්ඝො භින්නො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ පඤ්ච ආපායිකා නෙරයිකා පරිකුප්පා අතෙකිච්ඡා ති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 3. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සම්පදාසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "30. පඤ්චිමානි භික්ඛවෙ බ්යසනානි. කතමානි පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඤාතිබ්යසනං, භොගබ්යසනං, රොගබ්යසනං, සීලබ්යසනං, දිට්ඨිබ්යසනං."
                    },
                    {
                        "type": "paragraph",
                        "text": "න භික්ඛවෙ සත්තා ඤාතිබ්යසනහෙතු වා භොගබ්යසනහෙතු වා රොගබ්යසනහෙතු වා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්ති.{2}"
                    },
                    {
                        "type": "paragraph",
                        "text": "සීලබ්යසනහෙතු වා භික්ඛවෙ සත්තා දිට්ඨිබ්යසනහෙතු වා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්ති.2{2}"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ පඤ්ච බ්යසනානි."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චිමා භික්ඛවෙ සම්පදා. කතමා පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඤාතිසම්පදා, භොගසම්පදා, ආරොග්යසම්පදා, සීලසම්පදා, දිට්ඨිසම්පදා."
                    },
                    {
                        "type": "paragraph",
                        "text": "න භික්ඛවෙ සත්තා ඤාතිසම්පදාහෙතු වා භොගසම්පදාහෙතු වා ආරොග්යසම්පදාහෙතු වා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සීලසම්පදාහෙතු වා භික්ඛවෙ සත්තා දිට්ඨිසම්පදාහෙතු වා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමා ඛො භික්ඛවෙ පඤ්ච සම්පදා ති."
                    },
                    {
                        "type": "centered",
                        "text": "ගිලානවග්ගො තතියො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තස්සුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "ගිලානො සතිපට්ඨානං ද්වෙ උපට්ඨාකා ද්වායුසා\nවපකාසසමණසුඛානි පරිකුප්පො ච සම්පදාති.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අරහා - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. උපපජ්ජන්ති - සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5.3.3.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරිකුප්ප සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "(සැවැත්නිඳාන යි)",
                        "type": "unindented"
                    },
                    {
                        "text": "29. මහණෙනි, මේ‍ අපායගාමීහු නිරයගාමීහු පරිකොප්‍ය (කිපෙන සැහැවී ඇති) වූවාහු පිළියම් නොකට හැකියාහු පස් දෙනෙකි. කවර පස් දෙනක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මව දිවියෙන් තොර කරණ ලදු වෙයි, පියා දිවියෙන් තොර කරණ ලද වෙයි, අර්‍හත් දිවියෙන් තොර කරණ ලද වෙයි, දුෂ්ටචිත්තයෙන් තථාගතයන්ගේ ලෙහෙ උපදවන ලද වෙයි, සඞ්ඝයා බිඳින ලද වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මොහු පස්දෙන අපායගාමීහු නිරයගාමීහු පරිකොප්‍ය (පැරණි වණයන් වැනි) වූවාහු පිළියම් නොකට හැකියාහු වෙත් ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.3.10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සම්පදා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "(සැවැත්නිදාන යි)",
                        "type": "unindented"
                    },
                    {
                        "text": "30. මහණෙනි, මේ ව්‍යසන (විපත්) පසෙකි. කවර පසෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඥාතිව්‍යසනය, භොගව්‍යසනය, රොගව්‍යසනය, ශීලව්‍යසනය, ද්‍රෂ්ටිව්‍යසන යී.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සත්ත්වයෝ ඥාතිව්‍යසනහේතුවින් වේවයි, භොගව්‍යසනහේතුවින් වේවයි, රොගව්‍යසනහේතුවින් වේවයි, කාබුන් මරණින් මතු අපාය නම් වූ දුර්‍ගති නම්වූ විනිපාත නම් වූ නිරයට නො පැමිණෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ශීලව්‍යසනහේතුවින් වේවයි, දෘෂ්ටිව්‍යසනහේතුවින් වේවයි සත්ත්වයෝ කාබුන් මරණින් මතු අපාය නම් වූ දුර්‍ගති නම් වූ විනිපාත නම් වූ නිරයට පැමිණෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ ව්‍යසන පස යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සම්පත් පසෙකි. කවර පසෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඥාතිසම්පද් හා භොගසම්පද් හා ආරොග්‍යසම්පද් හා ශීලසම්පද් හා දෘෂ්ටිසම්පද් හා යැ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සත්ත්වයෝ ඥාතිසම්පද්හේතුවින් වේවයි, භොගසම්පද්හේතුවින් වේවයි, ආරොග්‍යසම්පද්හේතුවින් වේවයි කාබුන් මරණින් මතු සුගති සඞ්ඛ්‍යාත ස්වර්‍ගලොකයට නො පැමිණෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සත්ත්වයෝ ශීලසම්පද්හේතුවින් හෝ ‍දෘෂ්ටිසම්පද්හේතුවින් හෝ කාබුන් මරණින් මතු සුගති සඞ්ඛ්‍යාත ස්වර්‍ගලොකයට පැමිණෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සම්පත් පස යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ගිලාන වර්‍ගය තුන් වැනි යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "එහි උද්දානය:",
                        "type": "unindented"
                    },
                    {
                        "text": "ගිලාන සූත්‍ර ය, සතිසූපට්ඨිත සූත්‍ර ය, උපට්ඨාක සූත්‍ර දෙක ය, අනායුස්ස සූත්‍ර දෙක ය, වපකාස සූත්‍ර ය, සමණසූඛ සූත්‍ර ය, පරිකුප්ප සූත්‍ර ය, සම්පදා සූත්‍රය දැ යි සූත්‍ර දශයෙකි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 242,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "4. රාජවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 4. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පඨමචක්කානුවත්තනසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "31. පඤ්චහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො රාජා චක්කවත්තී ධම්මෙනෙව චක්කං පවත්තෙති.{1} තං හොති චක්කං අප්පතිවත්තියං{2} කෙනචි මනුස්සභූතෙන පච්චත්ථිකෙන පාණිනා. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ රාජා චක්කවත්තී අත්ථඤ්ඤූ ච හොති, ධම්මඤ්ඤූ ච, මත්තඤ්ඤූ ච, කාලඤ්ඤූ ච, පරිසඤ්ඤූ ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො පඤ්චහි අඞ්ගෙහි සමන්නාගතො රාජා චක්කවත්තී ධම්මෙනෙව චක්කං වත්තෙති. තං හොති චක්කං අප්පතිවත්තියං{2} කෙනචි මනුස්සභූතෙන පච්චත්ථිකෙන පාණිනා"
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො තථාගතො අරහං සම්මාසම්බුද්ධො ධම්මෙනෙව අනුත්තරං ධම්මචක්කං පවත්තෙති. තං හොති චක්කං අප්පතිවත්තියං{2} සමණෙන වා බ්රාහ්මණෙන වා දෙවෙන වා මාරෙන වා බ්රහ්මුනා වා කෙනචි වා ලොකස්මිං. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ තථාගතො අරහං සම්මාසම්බුද්ධො අත්ථඤ්ඤූ, ධම්මඤ්ඤූ, මත්තඤ්ඤූ, කාලඤ්ඤූ, පරිසඤ්ඤූ."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො තථාගතො අරහං සම්මාසම්බුද්ධො ධම්මෙනෙව අනුත්තරං ධම්මවක්කං පවත්තෙති. තං හොති චක්කං අප්පතිවත්තියං{2} සමණෙන වා බ්රාහ්මණෙන වා දෙවෙන වා මාරෙන වා බ්රහ්මුනා වා කෙනචි වා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 4. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(දුතියචක්කානුවත්තනසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "32. පඤ්චහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො රඤ්ඤො චක්කවත්තිස්ස ජෙට්ඨො පුත්තො පිතරා පවත්තිතං චක්කං ධම්මෙනෙව අනුප්පවත්තෙති. තං හොති චක්කං අප්පතිවත්තියං{2}කෙනචි මනුස්සභූතෙන පච්චත්ථිකෙන පාණිනා. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ රඤ්ඤො චක්කවත්තිස්ස ජෙට්ඨො පුත්තො අත්ථඤ්ඤූ ච හොති, ධම්මඤ්ඤූ ච, මත්තඤ්ඤූ ච, කාලඤ්ඤූ ච, පරිසඤ්ඤූ ච."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. වත්තෙති - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අප්පටිවත්තියං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "4. රාජ වර්ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "5.3.4.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ප්‍රථම චක්කානුවත්තන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදාන යි]",
                        "type": "unindented"
                    },
                    {
                        "text": "31. මහණෙනි, කරුණු පසෙකින් සමන්වාගත සක්විති රජ (දසකුසල්) දැහැමින් ම අණසක් පවත්වයි. කිසිදු මනුෂ්‍ය වූ පසමිතුරු ප්‍රාණියකු විසින් එ අණසක් ප්‍රතිවර්‍තන නො කළ හැකි වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි සක්විතිරජ (හෙතු සඞ්ඛ්‍යාත) අර්‍ථය දනුයේ ද, ප්‍රවෙණිධර්‍මය දනුයේ ද, (දඬුවම්හි වේවයි, කරවුවරෙහි වේවයි) මාත්‍රා දනුයේ ද, (රාජ්‍යසුඛානුභව - විනිශ්චයකරණ - චාරිකා පිළිබඳ) කාලය දනුයේ ද, (ක්ෂත්‍රිය-බ්‍රාහ්මණ-වෛශ්‍ය-ශ්‍රද්‍ර-ශ්‍රමණපර්‍ෂද් ආදි) පර්‍ෂද් දනුයේ ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසින් සමන්වාගත සක්විති රජ දැහැමින් ම අණසක් පවත්වයි. එ අණසක් වනාහි කිසිදු මනුෂ්‍ය වූ පසමිතුරු ප්‍රාණියකු විසින් ප්‍රතිවර්‍තන නො කළ හැකි වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එ පරිද්දෙන් ම දහම් පසෙකින් සමන්වාගත තථාගත අර්‍හත් සම්‍යක්සම්බුදධයන් වහන්සේ දැහැමින් ම (නවලොකොත්තර ධර්‍මයෙන්) අනුත්තර වූ ධර්‍මචක්‍රය පවත්වන සේක. එ ශ්‍රෙෂ්ඨචක්‍රය වනාහි ශ්‍රමණයකු විසින් වේවයි, බ්‍රාහ්මණයකු විසින් වේවයි, දෙවියකු විසින් වේවයි, මාරයකු විසින් වේවයි, බ්‍රහ්මහකු විසින් වේවයි, ලොව්හි කිසිවකු විසින් වේවයි ප්‍රතිවර්‍තනය කළ හැකි නො වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි තථාගත අර්‍හත් සම්‍යක්සම්බුද්ධයන් වහන්සේ (පඤ්චවිධ) අර්‍ථ දන්නාහ. (සතර) ධර්‍මයන් දන්නාහ. (සිවුපසෙහි) මාත්‍රා දන්නාහ. (පටිසල්ලානආදි) කාල දන්නාහ. පිරිස් දන්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පඤ්චධර්‍මයෙන් සමන්වාගත තථාගත අර්‍හත් සම්‍යක්සම්බුදධයන් වහන්සේ ධර්‍මයෙන් ම අනුත්තරධර්‍මචක්‍රය පවත්වන්නාහ. එ ධර්‍මචක්‍රය ශ්‍රමණයකු විසින් වේවයි, බ්‍රාහ්මණයකු විසින් වේවයි, දෙවියකු විසින් වේවයි, මාරයකු විසින් වේවයි, බ්‍රහ්මයකු විසින් වේවයි, ලොව්හි කිසිවකු විසින් වේවයි ප්‍රතිවර්‍තනය කළ හැකි නො වේ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.4.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දෙවැනි චක්කානුවත්තන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "32. මහණෙනි, කරුණු පසෙකින් සමන්වාගත වූ සක්විති රජුගේ දෙටු පුත් පියහු විසින් පවත්වන ලද ආඥාචක්‍රය දැහැමින් ම අනුව පවත්වයි. එ අණසක් මනුෂ්‍ය වූ කිසිදු පසමිතුරු ප්‍රාණියකු විසින් ප්‍රතිවර්‍තන කළ හැකි නො වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි සක්විති රජහුගේ ජ්‍යෙෂ්ඨ පුත්‍ර අර්‍ථඥ ද වෙයි, ධර්‍මඥ ද වෙයි, මාත්‍රඥ ද වෙයි, කාලඥ ද වෙයි, පර්‍ෂද් දන්නේ ද වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 244,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි අඞ්ගෙහි සමන්නාගතො රඤ්ඤො චක්කවත්තිස්ස ජෙට්ඨො පුත්තො පිතරා පවත්තිතං චක්කං ධම්මෙනෙව අනුප්පවත්තෙති. තං හොති චක්කං අප්පතිවත්තියං{1} කෙනචි මනුස්සභූතෙන පච්චත්ථිකෙන පාණිනා."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො සාරිපුත්තො තථාගතෙන පවත්තිතං අනුත්තරං ධම්මචක්කං සම්මදෙව අනුප්පවත්තෙති. තං හොති චක්කං අප්පතිවත්තියං සමණෙන වා බ්රාහ්මණෙන වා දෙවෙන වා මාරෙන වා බ්රහ්මුනා වා කෙනචි වා ලොකස්මිං. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ සාරිපුත්තො අත්ථඤ්ඤූ, ධම්මඤ්ඤූ, මත්තඤ්ඤූ, කාලඤ්ඤූ, පරිසඤ්ඤූ."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො සාරිපුත්තො තථාගතෙන අනුත්තරං ධම්මචක්කං පවත්තිතං සම්මදෙව අනුප්පවත්තෙති. තං හොති චක්කං අප්පතිවත්තියං{1} සමණෙන වා බ්රාහ්මණෙන වා දෙවෙන වා මාරෙන වා බ්රහ්මුනා වා කෙනචි වා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 4. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ධම්මරාජසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "33. යො පි ඛො භික්ඛවෙ රාජා චක්කවත්ති ධම්මිකො ධම්මරාජා, සො පි න අරාජකං චක්කං වත්තෙතීති. එවං වුත්තෙ අඤ්ඤතරො භික්ඛූ භගවන්තං එතදවොච: කො පන භන්තෙ රඤ්ඤො චක්කවත්තිස්ස ධම්මිකස්ස ධම්මරඤ්ඤො රාජා?ති. ‘ධම්මො භික්ඛූ’ති භගවා අවොච."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛු රාජා චක්කවත්තී ධම්මිකො ධම්මරාජා ධම්මඤ්ඤෙව නිස්සාය ධම්මං සක්කරොන්තො ධම්මං ගරු{3}කරොන්තො ධම්මං අපචායමානො ධම්මද්ධජො ධම්මකෙතු ධම්මාධිපතෙය්යො ධමිමිකං රක්ඛාවරණගුත්තිං සංවිදහති අන්තොජනස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛු රාජා චක්කවත්තී ධම්මිකො ධම්මරාජා ධම්මඤ්ඤෙව නිස්සාය ධම්මං සක්කරොන්තො ධම්මං ගරුකරොන්තො ධම්මං අපචායමානො ධම්මද්ධජො ධම්මකෙතු ධම්මාධිපතෙය්යො ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහති ඛත්තියෙසු අනුයුත්තෙසු{4}, බලකායස්මිං, බ්රාහ්මණගහපතිකෙසු, නෙගමජානපදෙසු, සමණබ්රාහ්මණෙසු, මිගපක්ඛීසු."
                    },
                    {
                        "type": "paragraph",
                        "text": "ස ඛො සො භික්ඛු රාජා චක්කවත්ති ධම්මිකො ධම්මරාජා ධම්මං යෙව නිස්සාය ධම්මං සක්කරොන්තා ධම්මං ගරුකරොන්තො ධම්මං අපචායමානො ධම්මද්ධජො ධම්මකෙතු ධම්මාධිපතෙය්යො ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහිත්වා අන්තොජනස්මිං, ධම්මිකං රක්ඛාචරණගුත්තිං සංවිදහිත්වා ඛත්තියෙසු අනුයුත්තෙසු{4}, බලකායස්මිං, බ්රාහ්මණගහපතිකෙසු නෙගමජානපදෙසු, සමණබ්රාහ්මණෙසු, මිගපක්කිසු, ධම්මෙනෙව චක්කං පවත්තෙති. තං හොති චක්කං අප්පතිවත්තියං{1} කෙනචි මනුස්සභූතෙන පච්චත්ථිකෙන පාණිනා."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අප්පටිවත්තියං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ගරුං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. අනුයන්තෙසු - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මෙ පස් කරුණින් සමන්වාගත සක්විති රජුගේ දෙටුපුත් පියහු විසින් පැවැත්වූ අණසක් දැහැමින් ම අනුව පවත්වයි. එ අණසක් වනාහි මනුෂ්‍ය වූ කිසිදු පසමිතුරු ප්‍රාණියකු විසින් ප්‍රතිවර්‍තන කළ හැකි නො වෙයි. (ප්‍රතික්ෂෙප හෝ කළ නො හෙයි.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එසෙයින් ම කරුණු පසෙකින් සමන්වාගත ශාරීපුත්‍ර තෙරණුවෝ තථාගතයන් වහන්සේ විසින් පවත්වන ලද අනුත්තර ධර්‍මචක්‍රය මැනැවින් පවත්වන්නාහ. එ ධර්‍මචක්‍රය ශ්‍රමණයකු විසින් හෝ බ්‍රහ්මණයකු විසින් හෝ දෙවියකු විසින් හෝ මාරයකු විසින් හෝ බ්‍රහ්මයකු හෝ ලොවැ වෙන කිසිවකු විසින් හෝ නො පැවැත්විය හෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි ශාරිපුත්‍රයෝ අර්‍ථඥයහ, ධර්‍මඥයහ, මාත්‍රඥයහ, කාලඥයහ, පර්‍ෂද්‍ දන්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ කරුණු පසින් සමන්වාගත ශාරිපුත්‍රයෝ තථාගතයන් වහන්සේ විසින් පවත්වන ලද අනුත්තර ධර්‍මචක්‍රය මනාකොට අනුව පවත්වත්. එ ධර්‍මචක්‍රය ශ්‍රමණයකු විසින් හෝ බ්‍රාහමණයකු විසින් හෝ දෙවියකු විසින් හෝ මරකු විසින් හෝ බ්‍රහ්මයකු විසින් හෝ ලොවැ කිසිවකු විසින් හෝ ප්‍රතිවර්‍තන කළ හැකි නො වෙයි. (ප්‍රතික්ෂෙප ද කළ නො හෙයි.)",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.4.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ධම්මරාජ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "33.මහණෙනි, “දැහැමි වූ ධර්‍මරාජන් වූ යම් චක්‍රවර්ති රජෙක් වේ නම්, හෙ ද අරාජක ආඥාචක්‍රය නො පවත්වා ය” යි. මෙ සෙයින් වදාළ කල්හි අන්‍යතර මහණෙක් භාග්‍යවත්හට තෙල කරුණ සැළ කළේ ය: “වහන්ස, ධාර්මික වූ ධර්‍මරාජන් වූ චක්‍රවර්තී රජහට කවරෙක් රජ වේ දැ?” යි, “මහණ, ධර්‍මය”යි භාග්‍යවතුන් වහන්සේ වදාළහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, මෙ ලොව්හි දැහැමි වූ ධර්‍මරාජන් වූ සක්විතිරජ ධර්‍මය ම නිසා ධර්‍මයට සත්කාර කරණුයේ ධර්‍මය‍ට බුහුමන් කරණුයේ ධර්‍මය ධ්වජ කොට ඇතියේ ධර්‍මය කෙතු කොට ඇතියේ ධර්‍මය ආධිපත්‍යය කොට ඇතියේ අන්තඃපුරජනයා කෙරෙහි දැහැමි රැකවරණ ගොපන සංවිධාන කරයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තවද මහණ, ධාර්මික ධර්‍මරාජන් වූ සක්විතිරජ දහම ම නිසා ධර්‍මයට සත්කාර කරණුයේ ධර්‍මයට සත්කාර කරණුයේ ධර්‍මය ගුරු කරණුයේ ධර්‍මයට බුහුමන් කරණුයේ ධර්‍මය ධ්වජ කොට ඇතියේ ධර්‍මය කෙතු කොට ඇතියේ ධර්‍මය ආධිපත්‍යය කොට ඇතියේ අනුයුක්ත ක්ෂත්‍රියයන් කෙරෙහිදු, බලකාය කෙරෙහිදු, බමුණු ගැහැවියන් කෙරෙහිදු, නියම්ගම් දනවුවැස්සන් කෙරෙහිදු, ශ්‍රමණබ්‍රාහ්මණයන් කෙරෙහිදු, මෘගපක්ෂීන් කෙරෙහිදු ධාර්මික රක්ෂාවරණගොපන කරයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, ධාර්මික වූ ධර්‍මරාජන් වූ එ සක්විතිරජ ධර්‍මය ම නිසා ධර්‍මයට සත්කාර කරණුයේ ධර්‍මය ගුරු කරණුයේ ධර්‍මයට බුහුමන් කරණුයේ ධර්‍මධ්වජ වූයේ ධර්‍මකෙතු වූයේ ධර්‍මාධිපත්‍යය ඇතියේ අන්තඃපුරජනයා කෙරෙහි ධාර්මිකරක්ෂාවරණගොපනය කොට අනුයුක්ත ක්ෂත්‍රියයන් කෙරෙහි ද බලකාය කෙරෙහි ද බ්‍රාහ්මණගෘහපතියන් කෙරෙහි ද නියම්ගම්දනවුවැසියන් කෙරෙහි ද ශ්‍රමණබ්‍රාහ්මණයන් කෙරෙහි ද මෘගපක්ෂීන් කෙරෙහි ද ධාර්මික රක්ෂාවරණගුප්තිය කොට ධර්‍මයෙන් ම ආඥාචක්‍රය පවත්වයි. එ ආඥාචක්‍රය වනාහි මනුෂ්‍යභූත කිසිදු පසමිතුරු ප්‍රාණියකු විසින් ප්‍රතිවර්‍තනය කළ හැකි නො වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 246,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛු තථාගතො අරහං සම්මාසම්බුද්ධො ධම්මිකො ධම්මරාජා ධම්මං යෙව නිස්සාය ධම්මං සක්කරොන්තො ධම්මං ගරුකරොන්තො ධම්මං අපචායමානො ධම්මද්ධජො ධම්මකෙතු ධම්මාධිපතෙය්යො ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහති භික්ඛූසු: “එවරූපං කායකම්මං සෙවිතබ්බං, එවරූපං කායකම්මං න සෙවිතබ්බං, එවරූපං වචීකම්මං සෙවිතබ්බං, එවරූපං වචීකම්මං න සෙවිතබ්බං, එවරූපං මනොකම්මං සෙවිතබ්බං, එවරූපං මනොකම්මං න සෙවිතබ්බං, එවරූපො ආජීවො සෙවිතබ්බො, එවරූපො ආජීවො න සෙවිතබ්බො, එවරූපො ගාමනිගමො සෙවිතබ්බො, එවරූපො ගාමනිගමො න සෙවිතබ්බො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං භික්ඛු තථාගතො අරහං සම්මාසම්බුද්ධො ධම්මිකො ධම්මරාජා ධම්මං යෙව නිස්සාය ධම්මං සක්කරොන්තො ධම්මං ගරුකරොන්තො ධම්මං අපචායමානො ධම්මද්ධජො ධම්මකෙතු ධම්මාධිපතෙය්යො ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහති භික්ඛුනීසු -පෙ- උපාසකෙසු -පෙ- උපාසිකාසු: “එවරූපං කායකම්මං සෙවිතබ්බං, එවරූපං කායකම්මං න සෙවිතතබ්බං, එවරූපං වචීකම්මං සෙවිතබ්බං, එවරූපං වචීකම්මං න සෙවිතබ්බං, එවරූපං මනොකම්මං සෙවිතබ්බං, එවරූපං මනොකම්මං න සෙවිතබ්බං, එවරූපො ආජීවො සෙවිතබ්බො, එවරූපො ආජීවො න සෙවිතබ්බො, එවරූපො ගාමනිගමො සෙවිතබ්බො, එවරූපො ගාමනිගමො න සෙවිතබ්බො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ස ඛො භික්ඛු තථාගතො අරහං සම්මාසම්බුද්ධො ධම්මිකො ධම්මරාජා ධම්මං යෙව නිස්සාය ධම්මං සක්කරොන්තො ධම්මං ගරුකරොන්තො ධම්මං අපචායමානො ධම්මද්ධජො ධම්මකෙතු ධම්මාධිපතෙය්යො ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහිත්වා භික්ඛුසු, ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහිත්වා භික්ඛුනීසු, ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහිත්වා උපාසකෙසු, ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහිත්වා උපාසිකාසු, ධම්මෙනෙව අනුත්තරං ධම්මචක්කං පවත්තෙති. තං හොති චක්කං අප්පතිවත්තියං සමණෙන වා බ්රාහ්මණෙන වා දෙවෙන වා මාරෙන වා බ්රහ්මුනා වා කෙනචි වා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 4. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ඛත්තියරාජසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "34. පඤ්චහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො රාජා ඛත්තියො මුද්ධාවසිත්තො යස්සං යස්සං දිසායං විහරති සකස්මිං යෙව විජිතෙ විහරති. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ රාජා ඛත්තියො මුද්ධාවසිත්තො උභතො සුජාතො හොති මාතිතො ච පිතිතො ච, සංසුද්ධගහණිකො, යාව සත්තමා පිතාමහයුගා අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන. අඩ්ඪො මහද්ධනො මහාභොගො පරිපුණ්ණකොසකොට්ඨාගාරො. බලවා ඛො පන හොති චතුරඞ්ගිනියා සෙනාය සමන්නාගතො අස්සවාය ඔවාදපතිකරාය.{1}"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඔවාදපටිකරාය - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණ, එ පරිද්දෙන් ම ධාර්මික ධර්‍මරාජන් වූ තථාගත අර්‍හත් සම්‍යක් සම්බුද්ධයන් වහන්සේ ධර්‍මය ම නිසා ධර්‍මයට සත්කාර කරන්නාහු ධර්‍මය ගුරු කරන්නාහු ධර්‍මයට බුහුමන් කරන්නාහු ධර්‍මය ධ්වජ කොට ඇත්තාහු ධර්‍මය කෙතු කොට ඇත්තාහු ධර්‍මය ආධිපත්‍යය කොට ඇත්තාහු භික්ෂූන් කෙරෙහි ධාර්මික රක්ෂාවරණගුප්තිය සලසන්නාහ. “මෙබඳු කායකර්‍මය සෙවිය යුතු ය, මෙබඳු කායකර්‍මය නො සෙවිය යුතුය, මෙබඳු වාක්කර්‍මය සෙවිය යුතු ය, මෙබඳු වාක්කර්‍මය නො සෙවිය යුතු ය, මෙබඳු මනඃකර්‍මය සෙවිය යුතු ය, මෙබඳු මනඃකර්‍මය නො සෙවිය යතු ය, මෙබඳු ආජීවය සෙවිය යුතු ය, මෙබඳු ආජීවය නො සෙවිය යුතු ය, මෙබඳු ගම් නියම්ගම් සෙවිය යුතුය, මෙබඳු ගම් නියම්ගම් නො සෙවිය යුතු ය” යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තවද මහණ, ධාර්මික ධර්‍මරාජන් වූ අර්‍හත් සම්‍යක්සම්බුද්ධ තථාගතයන් වහන්සේ ධර්‍මය ම නිසා ධර්‍මයට සත්කාර කරන්නාහු ධර්‍මය ගුරු කරන්නාහු ධර්‍මයට බුහුමන් කරන්නාහු ධර්‍මය ධ්වජ කොට ඇත්තාහු ධර්‍මය කෙතු කොට ඇත්තාහු ධර්‍මය ආධිපත්‍ය කොට ඇත්තාහු භික්ෂුණින් කෙරෙහි … උපාසකයන් කෙරෙහි ... උපාසිකාවන් කෙරෙහි “මෙබඳු කායකර්‍මය සෙවිය යුතු, මෙබඳු කායකර්‍මය නො සෙවිය යුතු, මෙබඳු වාක්කර්‍මය සෙවිය යුතු, මෙබඳු වාක්කර්‍මය නො සෙවිය යුතු, මෙබඳු මනඃකර්‍මය සෙවිය යුතු, මෙබඳු මනඃකර්‍මය නො සෙවිය යුතු, මෙබඳු ආජීවය සෙවිය යුතු, මෙබඳු ආජීවය නො සෙවිය යුතු, මෙබඳු ගම් නියම්ගම් සෙවිය යුතු, මෙබඳු ගම් නියම්ගම් නො සෙවිය යුතු ය”යි ධාර්මික රක්ෂාවරණගුප්තිය සලසන්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, එ ධාර්මික ධර්‍මරාජන් වූ අර්‍හත් සම්‍යක්සම්බුද්ධ තථාගතයන් වහන්සේ ධර්‍මය ම නිසා ධර්‍මයට සත්කාර කරන්නාහු ධර්‍මය ගුරු කරන්නාහු ධර්‍මයට බුහුමන් කරන්නාහු ධර්‍මය ධ්වජ කොට ඇතියාහු ධර්‍මය කෙතු කොට ඇතියාහු ධර්‍මය ආධිපත්‍ය කොට ඇතියාහු භික්ෂුන් කෙරෙහි ධාර්මික රක්ෂාවරණගොපනය සලසා, භික්ෂුණීන් කෙරෙහි ධාර්මික රක්ෂාවරණගොපනය සලසා, උපාසකයන් කෙරෙහි ධාර්මික රක්ෂාවරණගොපනය සලසා, උපාසිකාවන් කෙරෙහි ධාර්මික රක්ෂාවරණගොපනය සලසා, ධර්‍මයෙන් ම අනුත්තරධර්‍මචක්‍රය පවත්වන සේක. එ ධර්‍මචක්‍රය ලොව්හි ශ්‍රමණයකු විසින් හෝ බ්‍රාහ්මණයකු විසින් හෝ දෙවියකු විසින් හෝ මාරයකු විසින් හෝ බ්‍රහ්මයකු විසින් හෝ අන් කිසිවකු විසින් හෝ ප්‍රතිවර්‍තනය කළ හැකි නොවේ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.4.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඛත්තියරාජ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදාන යි]",
                        "type": "unindented"
                    },
                    {
                        "text": "34. මහණෙනි, කරුණු පසෙකින් සමන්වාගත මූර්‍ධාභිෂික්ත වූ ක්ෂත්‍රිය රජ යම් ම දිශායෙක්හි වාස කෙරේ නම්, ස්වකීය වූ ම විජිතයෙහි වෙසෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි මූර්‍ධාභික්ෂිත ක්ෂත්‍රිය රජ මවු පසින් හා පියපසින් හා යන උභයපාර්ශ්වයෙන් මනා කොට උපන්නේ, සුපිරිසිදු මවුකුසැතියේ, සත්මුතු පරපුර තෙක් ජාතිවාදයෙන් බැහැර නොලන ලදුයේ උපක්‍රොශ නො ලදුයේ වෙයි. මහාධන ඇතියේ මහාභොග ඇතියේ පිරිපුන් ධනකොෂ හා ධාන්‍යකොෂ්ඨාගාර ඇතියේ ආඨ්‍ය වෙයි. කීකරු වූ ඔවා අනුව කරණ සිවුරඟසෙනගින් සමන්වාගත වූයේ බලවත් වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 248,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පරිනායකො ඛො පනස්ස හොති පණ්ඩිතො වියත්තො මෙධාවී පටිබලො අතීතානාගත පච්චුප්පන්නෙ අත්ථෙ චින්තෙතුං. තස්සිමෙ චත්තාරො ධම්මා යසං පරිපාචෙන්ති. සො ඉමිනා යසපඤ්චමෙන{1} ධම්මෙන සමන්නාගතො යස්සං යස්සං දිසායං විහරති, සකස්මිං යෙව විජිතෙ විහරති. තං කිස්ස හෙතු: එවං හෙතං භික්ඛවෙ හොති විජිතාවිනං."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු යස්සං යස්සං දිසායං විහරති විමුත්තචිත්තො{2} විහරති. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු සීලවා හොති පාතිමොක්ඛසංවරසංවුතො විහරති. ආචාරගොචරසම්පන්නො අනුමත්තෙසු වජ්ජෙසු භයදස්සාවී, සමාදාය සික්ඛති සික්ඛාපදෙසු. රාජා’ච ඛත්තියො මුද්ධාවසිත්තො ජාතිසම්පන්නො."
                    },
                    {
                        "type": "paragraph",
                        "text": "බහුස්සුතො හොති සුතධරො සුතසන්තිචයො. යෙ තෙ ධම්මා ආදිකල්යාණා මජ්ඣෙකල්යාණා පරියොසානකල්යාණා සාත්ථා සංබ්යඤ්ජනා කෙවලපරිපුණ්ණං පරිසුද්ධං බ්රහ්මචරියං අභිවදන්ති, තථාරූපාස්ස ධම්මා බහුස්සුතා හොන්ති ධතා{3} වචසා පරිචිතා මනසානුපෙක්ඛිතා දිට්ඨියා සුප්පටිවිද්ධා. රාජා’ච ඛත්තියො මුද්ධාවසිත්තො අඩ්ඪො මහද්ධනො මහාභොගො පරිපුණ්ණකොසකොට්ඨාගාරො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ආරද්ධවිරියො විහරති අකුසලානං ධම්මානං පහානාය කුසලානං ධම්මානං උපසම්පදාය ථාමවා දළ්හපරක්කමො අනික්ඛිත්තධුරො කුසලෙසු ධම්මෙසු. රාජා’ච ඛත්තියො මුද්ධාවසිත්තො බලසම්පන්නො."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්ඤවා හොති උදයත්ථගාමිනියා පඤ්ඤාය සමන්නාගතො අරියාය නිබ්බෙධිකාය සම්මා දුක්ඛක්ඛයගාමිනියා. රාජා’ච ඛත්තියො මුද්ධාවසිත්තො පරිනායකසම්පන්නො."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්සිමෙ චත්තාරො ධම්මා විමුත්තිං පරිපාචෙන්ති. සො ඉමිනා විමුත්තිපඤ්චමෙන ධම්මෙන සමන්නාගතො යස්සං යස්සං දිසායං විහරති විමුත්තචිත්තො{2} විහරති. තං කිස්ස හෙතු: එවං හෙතං භික්ඛවෙ හොති විමුත්තචිත්තානන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 4. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පඨම පත්ථනාසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "35. පඤ්චහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො රඤ්ඤො ඛත්තියස්ස මුද්ධාවසිත්තස්ස ජෙට්ඨො පුත්තො රජ්ජං පත්ථෙති. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ රඤ්ඤො ඛත්තියස්ස මුද්ධාවසිත්තස්ස ජෙට්ඨො පුත්තො උභතො සුජාතො හොති මාතිතො ච පිතිතො ච, සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා, අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන. අභිරූපො හොති දස්සනීයො පාසාදිකො පරමාය වණ්ණපොක්ඛරතාය සමන්නාගතො මාතාපිතුන්නං{5} පියො හොති මනාපො. නෙගමජානපදස්ස පියො හොති මනාපො. යානි තානි රඤ්ඤං ඛත්තියානං මුද්ධාවසිත්තානං සිප්පට්ඨානානි{6} හත්ථිස්මිං වා අස්සස්මිං වා රථස්මිං වා ධනුස්මිං වා ථරුස්මිං වා තත්ථ සික්ඛිතො හොති අනවයො."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඉමිනා පඤ්චමෙන - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "2. විමුත්තචිත්තොච - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ධාතා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. මාතා පිතූනං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "6. සිප්පුට්ඨානානි - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඔහුගේ පරිණායක පණ්ඩිත වෙයි. (ප්‍රඥාව්‍යක්තතායෙන්) ව්‍යක්ත වෙයි. (ස්ථානොචිතප්‍රඥායෙන් යුක්තවන හෙයින්) මෙධාවී වෙයි. අතීතානාගත ප්‍රත්‍යුත්පන්න අර්‍ථයන් සිතීමට ප්‍රතිබල වෙයි. මෙ සතර දහම්හු ඔහුගේ යශස් පරිපාක කරවත්. මේ යශස නැමැති පස්වන කරුණින් සමන්වාගත හෙතෙමේ යම් ම දිශායෙක්හි වෙසේ නම්, ස්වකීය වූ ම විජිතයෙහි (වෙසෙන සේ) වෙසෙයි. ඒ කවර හෙතුයෙන් යත්: විජෙතෘනට (ධර්‍මවිජය ඇත්තනට) තෙල එසෙයින් ම වෙයි."
                    },
                    {
                        "text": "මහණෙනි, එපරිදි ම කරුණු පසෙකින් සමන්වාගත මහණ යම් ම දිශායෙක්හි වාස ‍කෙරේ නම්, පඤ්චවිධ විමුක්තියෙන් යුත් ඇතියේ ම වාස කෙරෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ සිල්වත් වෙයි. ප්‍රාතිමොක්ෂසංවර ශීලයෙන් සංවෘත ව වෙසෙයි. ආචාරගොචරිම්පන්න වූයේ අණුමාත්‍රවරදෙහි දු බිය දක්නා සුලුයේ සිකපදයෙහි සමාදන් කොටගෙණ හික්මෙයි. ජාතිසම්පන්න වූ මූර්‍ධාභිෂික්ත ක්ෂත්‍රිය මහරජකු සෙයිනි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "(නවාඞ්ගශාසන සඞ්ඛ්‍යාත) ශ්‍රැතයට ආධාර වූයේ රාසි කොටගත් ශ්‍රැත ඇතියේ බහුශ්‍රැත වෙයි. යම් ධර්‍මකෙනෙක් ආදිකල්‍යාණ මධ්‍යකල්‍යාණ පර්‍ය්‍යවසානකල්‍යාණ වූවාහු අර්‍ථසහිත ව්‍යඤ්ජන සහිත වූවාහු කෙවල පරිපූර්‍ණ වූ පිරිසිදු බ්‍රහ්මචර්‍ය්‍ය පවසත් නම්, එබඳු ධර්‍මයෝ ඔහු විසින් අසා උගන්නා ලද්දාහු ප්‍රගුණ කරණ ලද්දාහු වචනයෙන් වනපොත් කරණ ලද්දාහු (සූත්‍ර දශකාදි විසින්) සිතින් පිරික්සා බලන ලද්දහු ප්‍රඥායෙන් මොනොවට පිළිවිදුනා ලද්දාහු වෙත්. ආඨ්‍ය වූ මහද්ධන ඇති මහාභොග ඇති පිරිපුන් ධනාගාර හා ධාන්‍යාගාර ඇති මුදුනෙහි බිසෙස් ලද කැත්මහරජකු මෙනි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අකුශලධර්‍මයන්ගේ ප්‍රහාණය පිණිස කුශලධර්‍මයන්ගේ උපසම්පත්තිය පිණිස ස්ථාමවත් වූයේ දළපැරැකුම් ඇතියේ කුශලධර්‍මයෙහි නොහළ වැර ධූර ඇතියේ ඇරැඹූ වීර්‍ය්‍ය ඇතියේ වාස කෙරෙයි. බලසම්පන්න මූර්‍ධාභිෂික්ත ක්ෂත්‍රිය රජකු මෙනි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආර්‍ය්‍ය වූ නිර්‍වෙදයට නිසි වූ මැනැවින් දුඃඛක්ෂයට යන සුලු උදාවිය දෙක අනුව ගිය විදර්‍ශනාප්‍රඥායෙන් සමන්වාගත මූර්‍ධාභිෂික්ත ක්ෂත්‍රිය මහරජු සෙයිනි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඔහුගේ මේ සතර දහම්හු විමුක්තිපරිපාකය කරවත්. හේ මේ විමුක්තිය පස්වනු කොට ඇති ධර්‍මයෙන් සමන්වාගත වූයේ යම් ම දිශායෙක්හි වෙසේ නම්, විමුක්තචිත්ත ව වෙසෙයි. එ කවර හෙයින් යත්: මහණෙනි, විමුක්තචිත්තයනට (මිදුන සිත් ඇතියනට) තෙල එසෙයින් ම වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.4.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පළමුවන පත්ථනා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "35. මහණෙනි, කරුණු පසෙකින් සමන්වාගත වූ මූර්‍ධාභිෂික්ත ක්ෂත්‍රිය රජුගේ දෙටුපුත් රාජ්‍යය පතන්නේ ය. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි මූර්‍ධාභිෂික්ත වූ ක්ෂත්‍රියරජුගේ ජ්‍යෙෂ්ඨපුත්‍ර තෙමේ මවුපසින් හා පියපසින් හා යන දෙපසින් සුජාත වූයේ, පිරිසිදු මවුකුස් ඇතියේ, සත්මුතුපරපුර තෙක් ජාතිවාදයෙන් බැහැර නො කරණ ලදුයේ උපක්‍රොෂ නැතියේ වෙයි. උත්තම වර්‍ණසෞන්දර්ය්‍යයෙන් සමන්වාගත වූයේ ප්‍රසාද එළවන සුලුයේ අභිරූප වෙයි. මාපියනට ප්‍රිය මනාප වෙයි. නියම් ගම්දනවු වැස්සනට ප්‍රිය මනාප වෙයි. හස්තිශිල්ප වේවයි, අශ්වශිල්ප වේවයි, රථ ශිල්ප වේවයි, ධනුශිල්ප වේවයි, ඛඞ්ගශිල්ප වේවයි, මූර්‍ධාභිෂික්ත ක්ෂත්‍රිය රජුන්ගේ යම් ශිල්පස්ථානයෝ වෙත් නම්, එහි හික්මුනේ පරිපූර්‍ණ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 250,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තස්ස එවං හොති: අහං ඛොම්හි උභතො සුජාතො මාතිතො ච පිතිතො ච, සංසුද්ධගහණිකො, යාව සත්තමා පිතාමහයුගා අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන. කස්මාහං රජ්ජං න පත්ථෙය්යං? අහං ඛොම්හි අභිරූපො දස්සනීයො පාසාදිකො පරමාය වණ්ණපොක්ඛරතාය සමන්නාගතො. කස්මාහං රජ්ජං න පත්ථෙය්යං? අහං ඛොම්හි මාතාපිතුන්නං පියො මනාපො. කස්මාහං රජ්ජං න පත්ථෙය්යං? අහං ඛොම්හි නෙගමජානපදස්ස පියො මනාපො. කස්මාහං රජ්ජං න පත්ථෙය්යං? අහං ඛොම්හි යානි තානි රඤ්ඤං ඛත්තියානං මුද්ධාවසිත්තානං සිප්පට්ඨානානි හත්ථිස්මිං වා අස්සස්මිං වා රථස්මිං වා ධනුස්මිං වා ථරුස්මිං වා, තත්ථම්හි සික්ඛිතො{1} අනවයො. කස්මාහං රජ්ජං න පත්ථෙය්යන්ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි අඞ්ගෙහි සමන්නාගතො රඤ්ඤො ඛත්තියස්ස මුද්ධාවසිත්තස්ස ජෙට්ඨො පුත්තො රජ්ජං පත්ථෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු ආසවානං ඛයං පත්ථෙති. කමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු සද්ධො හොති සද්දහති තථාගතස්ස බොධිං: “ඉතිපි සො භගවා අරහං-සම්මාසම්බුද්ධො-විජ්ජාචරණසම්පන්නො-සුගතො-ලොකවිදූ-අනුත්තරො පුරිසදම්මසාරථි-සත්ථා දෙවමනුස්සානං-බුද්ධො-භගවාති.” අප්පාබාධො හොති අප්පාතඞ්කො සමවෙපාකිනියා ගහණියා සමන්නාගතො නාතිසීතාය නාච්චුණ්හාය මජ්ඣිමාය පධානක්ඛමාය. අසඨො හොති අමායාවී යථාභූතං අත්තානං{2} ආවීකත්තා{3} සත්ථරි වා විඤ්ඤූසු වා සබ්රහ්මචාරීසු. ආරද්ධවිරියො විහරති අකුසලානං ධම්මානං පහානාය, කුසලානං ධම්මානං උපසම්පදාය, ථාමවා දළ්හපරක්කමො අනික්ඛිත්තධුරො කුසලෙසු ධම්මෙසු. පඤ්ඤවා හොති උදයත්ථගාමිනියා පඤ්ඤාය සමන්නාගතො අරියාය නිබ්බෙධිකාය සම්මාදුක්ඛක්ඛයගාමිනියා."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්ස එවං හොති: ‘අහං ඛොම්හි සද්ධො, සද්දහාමි තථාගතස්ස බොධිං: ‘අරහං-සම්මාසම්බුද්ධො-විජ්ජාචරණසම්පන්නො-සුගතො-ලොකවිදූ-අනුත්තරො පුරිසදම්මසාරථි-සත්ථා දෙවමනුස්සානං-බුද්ධො-භගවාති.’ කස්මාහං ආසවානං ඛයං න පත්ථෙය්යං? අහං ඛොම්හි අප්පාබාධො අප්පාතඞ්කො සමවෙපාකිනියා ගහණියා සමන්නාගතො නාතිසීතාය නාච්චුණ්හාය මජ්ඣිමාය පධානක්ඛමාය. කස්මාහං ආසවානං ඛයං න පත්ථෙය්යං? අහං ඛොම්හි අසඨො අමායාවී යථාභූතං අත්තානං ආවීකත්තා{3} සත්ථරි වා විඤ්ඤූසු වා සබ්රහ්මචාරිසු. කස්මාහං ආසවානං ඛයං න පත්ථෙය්යං? අහං ඛොම්හි ආරද්ධවිරියො විහරාමි අකුසලානං ධම්මානං පහානාය කුසලානං ධම්මානං උපසම්පදාය, ථාමවා දළ්හපරක්කමො අනික්ඛිත්තධුරො කුසලෙසු ධම්මෙසු. කස්මාහං ආසවානං ඛයං න පත්ථෙය්යං? අහං ඛොම්හි පඤ්ඤවා උදයත්ථගාමිනියා පඤ්ඤාය සමන්නාගතො අරියාය නිබ්බෙධිකාය සම්මා දුක්ඛක්ඛයගාමිනියා. කස්මාහං අසවානං ඛයං න පත්ථෙය්යන්ති?’"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු ආසවානං ඛයං පත්ථෙතීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. තත්ථ සික්ඛිතො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. යථාභූතානං අත්ථානං - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ආවිකත්තා - මඡසං, ස්යා, සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "ඔහට මෙබඳු සිතෙක් වෙයි: “මම වනාහි මවුපසින් හා පියපසින් හා දෙපසින් සුජාතයෙම්, පිරිසුදු මවුකුස් ඇතියෙම්, සත්මුතු පරපුර තෙක් ජාති වාදයෙන් බැහැර නො කරණ ලදුයෙම්, අනුපකෘෂ්ටයෙම් වෙමි. කවර හෙයින් මම රාජ්‍යය නො පතනෙම් ද? මම් වනාහි දැකුම්කලුයෙම් ප්‍රසාදජනකයෙම් උත්තම වර්‍ණසෞන්දර්‍ය්‍යයෙන් සමන්වාගතයෙම් අභිරූපය යෙම් වෙමි. කවර හෙයින් මම රාජ්‍යය නො පතන්නෙම් ද? මම වනාහි මා පියනට ප්‍රියමනාප යෙම් වෙමි. කවර හෙයින් මම රාජ්‍ය නො පතන්නෙම් ද? මම වනාහි නියම්ගම් දනවුවැස්සනට ප්‍රිය මනාපයෙම් වෙමි. කවර හෙයින් මම රාජ්‍යය නො පතන්නෙම් ද? මම වනාහි හස්තිශිල්ප වේවයි, අශ්වශිල්ප වේවයි, රථශිල්ප වේවයි, ඛඩගශිල්ප වේවයි, මූර්‍ධාභිෂික්ත ක්ෂත්‍රිය රජුන්ගේ යම් ශිල්පස්ථාන කෙනෙක් වෙත් නම්, එහි හික්මුනෙම් පරිපූර්ණයෙම් ‍‍වෙමි. කවර හෙයින් මම රජය නො පතන්නෙම් දැ?”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසින් සමන්වාගත මූර්‍ධාභිෂික්ත වූ ක්ෂත්‍රිය රජුගේ දෙටුපුත් රජය පත‍යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිද්දෙන් ම කරුණු පසෙකින් සමන්වාගත මහණ ආස්‍රවයන්ගේ ක්ෂයය (නිවන) පතන්නේ ය. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ සැදැහැති වෙයි: “ඒ භාග්‍යවතුන් වහන්සේ මෙ මෙ කරුණෙනුදු අර්‍හත්හ. සම්‍යක්සම්බුද්ධයහ. විද්‍යාචරණසම්පන්නයහ. සුගතයහ. ලොකවිද්හ. අනුත්තරපුරුෂදම්‍යසාරථිහ. දෙව් මිනිස්නට ශාස්තෘහ. බුද්ධයහ. භගවත් හ” යි තථාගතයන් වහන්සේගේ (චතුස්සත්‍යඥාන) බොධිය හදහයි. අල්පාතඞ්ක වූයේ ස්වල්පාබාධ වෙයි. ඉතා සිහිල් නො වූ ඉතා උණුසුම් නැති මධ්‍යම වූ ප්‍රධන්විර්‍ය්‍යට නිසි වූ සමව අහර පැසවන ජඨරාගනියෙන් සමන්වාගත වෙයි. මායා නැතියේ ශාස්තෲන් වහන්සේ කෙරෙහි වේවයි, විඥ සබ්‍රම්සරුන් කෙරෙහි වේවයි, තමා තතුසේ පාළ කරණුයේ සළබව් නැතියේ වේ. අකුශලධර්‍මයන්ගේ ප්‍රහාණය පිණිස කුශලධමර්‍යන්ගේ ප්‍රතිලාභය පිණිස රුකුළු වැර ඇතියේ දළපැරකුම් ඇතියේ කුශලධර්‍මයන්හි නො හළ වැරධුර ඇතියේ ස්ථාමවත් වූයේ විහරණ කෙරෙයි. ආර්‍ය්‍ය වූ නිර්‍වෙදයට වැටෙන මනා සේ දුඃඛක්ෂය කරා යන උදයව්‍යයට යන ප්‍රඥායෙන් සමන්වාගත වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඔහට මෙබඳු සිතෙක් වෙයි: “මම සැදැහැතියෙම් වෙමි. තථාගතයන් වහන්සේගේ සම්බොධිය “මෙ කරුණිනුදු ඒ භාග්‍යවත්හු අර්‍හත්හ. සම්‍යක් සම්බුද්ධයහ ... දෙව්මිනිස්නට ශාස්තෘහ. බුද්ධයහ. භාග්‍යවත්හ”යි හදහමි. කවර කරුණෙකින් මම ආස්‍රවක්ෂය නො පතම් ද? මම වනාහි අල්පාතඞ්ක ඇතියෙම් අල්පාබාධා ඇතියෙම්, අතිශීත නො වූ අත්‍යුෂණ නො වූ මධ්‍යම වූ ප්‍රධානක්ෂම වූ සම ව අහර පැසවන ජඨරාග්නියෙන් සමන්වාගතයෙමි. කවර කරුණෙකින් මම ආස්‍රවක්ෂය (නිර්‍වාණය) නො පතන්නෙම් ද? මම වනාහි මායා රහිතයෙමි, අශඨයෙම් ශාස්තෲන් කෙරෙහි වේවයි, විඥ සබ්‍රම්සරුන් කෙරෙහි වේවයි, තමා තතුසේ පාළ කරන්නෙම් වෙමි. කවර හෙයින් මම ආස්‍රවක්ෂයය නො පතම් ද? මම වනාහි අකුශලධර්‍මයන්ගේ ප්‍රහාණය පිණිස, කුශලධර්‍මයන්ගේ ලාභය පිණිස රුකුළු වැර ඇතියෙම් කුශලධර්‍මයෙහි නො හළ වැර ඇතියෙම් දළපැරකුම් ඇතියෙම් ස්ථාමවත්ව වෙසෙමි. කවර හෙයින් මම ආස්‍රවක්ෂය නො පතන්නෙම් ද? මම වනාහි ආර්‍ය්‍ය වූ නිර්‍වෙදය ඇසුරු කළ මොනවට දුඃඛක්ෂයට යන උදයව්‍යයගාමීනිප්‍රඥායෙන් සමන්වාගත වෙමි. කවර කරුණෙකින් මම ආස්‍රවක්ෂය නො පතන්නෙම් ද?",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පඤ්ච ධර්‍මයෙන් සමන්වාගත මහණ ආස්‍රවක්ෂය පතන්නේ ය යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 252,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5. 3. 4. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(දුතිය පත්ථනාසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "36. පඤ්චහි භික්ඛවෙ, අඞ්ගෙහි සමන්නාගතො රඤ්ඤො ඛත්තියස්ස මුද්ධාවසිත්තස්ස ජෙට්ඨො පුත්තො ඔපරජ්ජං පත්ථෙති. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ රඤ්ඤො ඛත්තියස්ස මුද්ධාවසිත්තස්ස ජෙට්ඨො පුත්තො උභතො සුජාතො හොති මාතිතො ච පිතිතො ච, සංසුද්ධ ගහණිකො, යාව සත්තමා පිතාමහයුගා. අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන. අභිරූපො හොති දස්සනීයො පාසාදිකො පරමාය වණ්ණපොක්ඛරතාය සමන්නාගතො. මාතාපිතුන්නං{1} පියො හොති මනාපො. බලකායස්ස පියො හොති මනාපො. පණ්ඩිතො හොති වියත්තො මෙධාවී පටිබලො අතීතානාගතපච්චුප්පන්නෙ අත්ථෙ චින්තෙතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්ස එවං හොති: ‘අහං ඛොම්හි උභතො සුජාතො මාතිතො ච පිතිතො ච, සංසුද්ධගහණිකො, යාව සත්තමා පිතාමහයුගා අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන. කස්මාහං ඔපරජ්ජං න පත්ථෙය්යං? අහං ඛොම්හි අභිරූපො දස්සනීයො පාසාදිකො පරමාය වණණපොක්ඛරතාය සමන්නාගතො. කස්මාහං ඔපරජ්ජං{2} න පත්ථෙය්යං? අහං ඛොම්හි මාතාපිතුන්නං පියො මනාපො. කස්මාහං ඔපරජ්ජං න පත්ථෙය්යං? අහං ඛොම්හි බලකායස්ස පියො මනාපො. කස්මාහං ඔපරජ්ජං න පත්ථෙය්යං? අහං ඛොම්හි පණ්ඩිතො වියත්තො මෙධාවී පටිබලො අතීතානාගතපච්චුප්පන්නෙ අත්ථෙ චින්තෙතුං. කස්මාහං ඔපරජ්ජං න පත්ථෙය්යන්ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි අඞ්ගෙහි සමන්නාගතො රඤ්ඤො ඛත්තියස්ස මුද්ධාවසිත්තස්ස ජෙට්ඨො පුත්තො ඔපරජ්ජං පත්ථෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු ආසවානං ඛයං පත්ථෙති කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු සීලවා හොති -පෙ- සමාදාය සික්ඛති සික්ඛාපදෙසු. බහුස්සුතො හොති -පෙ- දිට්ඨියා සුප්පටිවිද්ධො, චතුසු සති පට්ඨානෙසු සූපට්ඨිතචිත්තො{3} හොති. ආරද්ධවිරියො විහරති අකුසලානං ධම්මානං පහානාය, කුසලානං ධම්මානං උපසම්පදාය, ථාමවා දළ්හපරක්කමො අනික්ඛිත්තධුරො කුසලෙසු ධම්මෙසු. පඤ්ඤවා හොති උදයත්ථගාමිනියා පඤ්ඤාය සමන්නාගතො අරියාය නිබ්බෙධිකාය සම්මා දුක්ඛක්ඛයගාමිනියා."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. මාතාපිතූනං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. උපරජ්ජං - ස්යා, PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. සුප්පතීතචිත්තො - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5.3.4.6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දෙවැනි පත්ථනා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "36. මහණෙනි, කරුණු පසෙකින් සමන්වාගත වූ මූර්‍ධාභිෂික්ත ක්ෂත්‍රිය රජුගේ දෙටු පුත් යුවරජ තනතුර පතන්නේ ය. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "මහණෙනි, මූර්‍ධාභිෂික්ත වූ ක්ෂත්‍රිය රජුගේ දෙටුපුත් මවුපසින් හා පියපසින් හා උභයපක්ෂයෙන් සුජාත වූයේ, පිරිසිදු මවුකුස ඇතියේ, සත්වන පියමුතුපරපුර තෙක් ජාති‍වාදයෙන් බැහැර නො කරණ ලදුයේ උපකෘෂ්ට නො වෙයි. උත්තමරූපසෞන්දර්‍ය්‍යයෙන් සමන්වාගත වූයේ දැකුම්කලු වූයේ ප්‍රසාදජනක වූයේ විශිෂ්ට රූපසම්පත් ඇතියේ වෙයි. මවුපියනට ප්‍රියමනාප වෙයි. බලසෙනඟට ප්‍රියමනාප වෙයි. පාණ්ඩිත්‍යයෙන් සමන්වාගත වූයේ ප්‍රඥව්‍යක්තභාවයෙන් යුක්ත වූයේ තන්වැසි නුවණින් යුක්ත වූයේ අතීත අනාගත ප්‍රත්‍යුත්පන්න වූ වෘද්ධි අර්‍ථයන් සිතීමෙහි ප්‍රතිබල වෙයි."
                    },
                    {
                        "text": "ඔහට මෙබඳු සිතෙක් වෙයි. “මම වනාහි මවුපසින් හා පියපසින් හා දෙපසින් ම සුජාතයෙම් පිරිසිදු මවුකුස් ඇතියෙම් සත්වන පියමුතුපරපුර තෙක් ජාතිවාදයෙන් අක්ෂිප්තයෙම් උපක්‍රොශ නො ලදුයෙම් වෙමි. කවර හෙයින් මම යුවරජ තනතුරු නො පතම් ද? මම වනාහි පරමවර්‍ණසෞන්දර්‍ය්‍යයෙන් සමන්වාගතයෙම් අභිරූපයෙම් දර්‍ශනීයයෙම් ප්‍රසාදජනකයෙමි. කවර හෙයින් මම යුවරජය නො පතම් ද? මම වනාහි මාපියනට ප්‍රියමනාපයෙමි. කවර හෙයින් මම යුවරජය නො පතම් ද? මම වනාහි බලසෙනඟට ප්‍රියමනාපයෙමි. කවර හෙයින් මම යුවරජය නො පතම් ද? මම වනාහි පණ්ඩිතයෙමි, ව්‍යක්තයෙමි, තන්වැසි නුවණැතියෙම්. අතීතානාගත ප්‍රත්‍යුත්පන්න අර්‍ථයන් සිතීමට ප්‍රතිබලයෙමි. කවර හෙයින් මම යුවරජය නො පතම් ද?”",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසින් සමන්වාගත මූර්‍ධාභිෂික්ත ක්ෂත්‍රිය රජුගේ දෙටුපුත් යුවරජය පතන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිද්දෙන් ම කරුණු පසෙකින් සමන්වාගත මහණ ආස්‍රවක්ෂය පතයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ සිල්වත් වෙයි ... සිකපදයෙහි සමාදන් කොට ගෙණ හික්මෙයි. බහුශ්‍රැත වෙයි ... (ධර්‍මයෝ) ප්‍රඥායෙන් සුප්‍රතිවිද්ධ වෙත්. සතර සීවටන්හි මොනවට එළඹ සිටි සිත් ඇතියේ වෙයි. අකුශලධර්‍මයන්ගේ ප්‍රහාණය සඳහා කුශලධර්‍මයන්ගේ උපසම්පත් සඳහා රුකුළු වැර ඇතිව වාස කරයි, දළපැරකුම් ඇතියේ කුශලධර්‍මයෙහි නො හළ වැර ඇතියේ ස්ථාමවත් වෙයි. ආර්‍ය්‍ය වූ නිර්‍වෙදයට වැටෙන මැනැවින් දුඃඛක්ෂයට යන උදාවියට යන ප්‍රඥායෙන් සමන්වාගත වූයේ ප්‍රඥාවත් වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 254,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තස්ස එවං හොති: අහං ඛොම්හි සීලවා පාතිමොක්ඛසංවර සංවුතො විහරාමි, ආචාරගොචරසම්පන්නො අණුමත්තෙසු වජ්ජෙසු භයදස්සාවි සමාදාය සික්ඛාමි සික්ඛාපදෙසු. කස්මාහං ආසවානං ඛයං න පත්ථෙය්යං? අහං ඛොම්හි බහුස්සුතො සුතධරො සුතසන්නිචයො - ‘යෙ තෙ ධම්මා ආදිකල්යාණා, මජ්ඣෙකල්යාණා පරියොසානකල්යාණා සාත්ථා සබ්යඤ්ජනා,{1} කෙවලපරිපුණණං පරිසුද්ධං බ්රහ්මචරියං අභිවදන්ති, තථාරූපා මෙ ධම්මා බහුස්සුතා හොන්ති.{2} ධතා{3} ච වචසා පරිචිතා මනසානුපෙක්ඛිතා දිට්ඨියා සුප්පටිවිද්ධා. කස්මාහං ආසවානං ඛයං න පත්ථෙය්යං? අහං ඛොම්හි චතුසු සතිපට්ඨානෙසු සූපට්ඨිතචිත්තො. කස්මාහං ආසවානං ඛයං න පත්ථෙය්යං? අහං ඛොම්හි ආරද්ධවිරියො විහරාමි අකුසලානං ධම්මානං පහානාය, කුසලානං ධම්මානං උපසම්පදාය, ථාමවා දළ්හපරක්කමො අනික්ඛිත්තධුරො කුසලෙසු ධම්මෙසු. කස්මාහං ආසවානං ඛයං න පත්ථෙය්යං? අහං ඛොම්හි පඤ්ඤවා උදයත්ථගාමිනියා පඤ්ඤාය සමන්නාගතො අරියාය නිබ්බෙධිකාය සම්මා දුක්ඛක්ඛයගාමිනියා. කස්මාහං ආසවානං ඛයං න පත්ථෙය්යන්ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු ආසවානං ඛයං පත්ථෙතීති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 4. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අප්පංසුපතිසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "37. පඤ්චිමෙ භික්ඛවෙ අප්පං රත්තියා සුපන්ති, බහුං ජග්ගන්ති. කතමෙ පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉත්ථි භික්ඛවෙ පුරිසාධිප්පායා අප්පං රත්තියා සුපති, බහුං ජග්ගති. පුරිසො භික්ඛවෙ ඉත්ථිධිප්පායො අප්පං රත්තියා සුපති, බහුං ජග්ගති. චොරො භික්ඛවෙ ආදානාධිප්පායො අප්පං රත්තියා සුපති, බහුං ජග්ගති. රාජා භික්ඛවෙ රාජකරණියෙසු යුත්තො අප්පං රත්තියා සුපති, බහුං ජග්ගති. භික්ඛු භික්ඛවෙ විසංයොගාධිප්පායො අප්පං රත්තයා සුපති, බහුං ජග්ගති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්ච අප්පං රත්තියා සුපන්ති, බහුං ජග්ගන්තීති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 4. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(භත්තාදකසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "38. පඤ්චහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො රඤ්ඤො නාගො භත්තාදකො ච හොති ඔකාසඵරණො ච ලණ්ඩසාටනො{4} ච සලාකගාහී{5} ච රඤ්ඤො නාගොත්වෙව සඞ්ඛං ගච්ඡති. කතමෙහි පඤ්චහි:"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සාත්ථං සව්යඤ්ජනං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. බහුස්සුතා - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ධාතා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. ලණ්ඩසාරණො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. සලාකග්ගාහී - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "ඔහට මෙබඳු සිතෙක් වෙයි. “මම වනාහි සිල්වත් වෙමි. ප්‍රාතිමොක්ෂසංවරශීලයෙන් සංවෘතයෙමි. ආචාරගොචර සම්පන්නයෙමි. අණුමාත්‍ර වරදෙහි භය දක්නා සුල්ලෙම් වාස කරමි. සමාදන් කොට ගෙණ ශික්ෂාපදයෙහි හික්මෙමි. කවර හෙයින් මම ආස්‍රවක්ෂය නො පතම් ද? මම වනාහි ශ්‍රැතධරයෙමි ශ්‍රැතසන්නිචය ඇතියෙමි, බහුශ්‍රැතයෙමි. ආදිකල්‍යාණ වූ මධ්‍යකල්‍යාණ වූ පර්‍ය්‍යවසානකල්‍යාණ වූ සාර්‍ථවූ සව්‍යඤ්ජන වූ යම් ධර්‍ම කෙනෙක් කෙවලපරිපූර්‍ණ පරිශුද්ධ බ්‍රහ්මචර්‍ය්‍යය පාළ කෙරෙත් නම්, එබඳු ධර්‍මයෝ මා විසින් බහුශ්‍රැත වූවාහු ධෘත වෙත්. වචනයෙන් ප්‍රගුණ කරණ ලදහ. මනසින් අනුප්‍රෙක්ෂිතයහ. ප්‍රඥායෙන් සුපිළිවිදුනා ලදහ. කවර හෙයින් මම ආස්‍රවක්ෂය නො පතම් ද? මම වනාහි සතර ස්මෘතිප්‍රස්ථානයෙහි එළඹ සිටි සිහි ඇතියෙම් වෙමි. කවර හෙයින් මම ආස්‍රවක්ෂය නො පතම් ද? මම වනාහි අකුශලධර්‍මයන්ගේ ප්‍රහාණය සඳහා කුශලධර්‍මයන්ගේ උපසම්පත් සඳහා රුකුළු වැර ඇතියෙම් වෙසෙමි. කුශලධර්‍මයෙහි නො හළ වීර්‍ය්‍යධූර ඇතියෙම් දළපැරකුම් ඇතියෙම් ස්ථාමවත් වෙමි. කවර හෙයින් මම ආස්‍රවක්ෂය නො පතම් ද? මම වනාහි ආර්‍ය්‍ය වූ නිර්‍වෙදය පිණිස පවත්නා මැනැවින් දුඃඛක්ෂයට යන සුලු උදාවිය නුවණින් ප්‍රඥාවත් වෙමි. කවර ‍හෙයින් මම ආස්‍රවක්ෂය නො පතම් දැ?”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසින් සමන්වාගත මහණ ආස්‍රවක්ෂය පතන්නේ යයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.4.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අප්පංසුපති සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "37. මහණෙනි, මෙ පස් දෙනෙක් රාත්‍රියෙහි අල්ප කොට නිදන්නාහ. බහුල කොට නිදි වරන්නාහ. කවර පස්දෙනෙක යත්:‍‍",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, පුරුෂයන් කෙරෙහි අධිප්‍රාය ඇති ස්ත්‍රී රාත්‍රියෙහි අල්ප කොට නිදයි. බහුල කොට නිදි වරයි. මහණෙනි, ස්ත්‍රීන් කෙරෙහි අධිප්‍රාය ඇති පුරුෂ රාත්‍රියෙහි අල්ප කොට නිදයි. බහුල කොට නිදි වරයි. මහණෙනි, වස්තු පැහැර ගැණීමෙහි අධිප්‍රාය ඇති සොර රාත්‍රියෙහි අල්ප කොට නිදයි. බොහෝ කොට නිදිවරයි. මහණෙනි, රජකරණීහි නියුතු රජ රාත්‍රියෙහි අල්ප කොට නිදයි. බො‍හෝ කොට නිදි වරයි. මහණෙනි, කෙලෙසුන්ගෙන් මිදීමෙහි අධිප්‍රාය ඇති මහණ රාත්‍රියෙහි අල්ප කොට නිදයි. බොහෝ කොට නිදි වරයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ පස් දෙන රාත්‍රියෙහි අල්ප කොට නිදත්. බොහෝ කොට නිදි වරත් යයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.4.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භත්තාදක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "38. මහණෙනි, රජුගේ ඇත් කරුණු පසෙකින් සමන්වාගත වූයේ බොහෝ බත් බුදිනේ ද වෙයි. (අන්‍යයන්ට බාධාවනසේ) ඇවුරු අවකාශ ඇතියේ ද වෙයි. (තන්හි තන්හි) ලඩ හෙළනුයේත් වෙයි. ඇතුන් ගණින කලැ ලහගන්නා සුලුයේ ද වෙයි. රජුගේ හස්තියා මැ යි යන සංඛ්‍යාවට ද යෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 256,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ රඤ්ඤො නාගො අක්ඛමො හොති රූපානං, අක්ඛමො සද්දානං, අක්ඛමො ගන්ධානං, අක්ඛමො රසානං, අක්ඛමො ඵොට්ඨබ්බානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි අඞ්ගෙහි සමන්නාගතො රඤ්ඤො නාගො භත්තාදකො ච හොති ඔකාසඵරණො ච ලණ්ඩසාටනො ච සලාකගාහී ච රඤ්ඤො නාගොත්වෙව සඞ්ඛං ගච්ඡති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු භත්තාදකො ච හොති ඔකාසඵරණො ච පීඨමද්දනො{1} ච සලකගාහී ච භික්ඛුත්වෙව සඞ්ඛං ගච්ඡති. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු අක්ඛමො හොති රූපානං, අක්ඛමො සද්දානං, අක්ඛමො ගන්ධානං, අක්ඛමො රසානං, අක්ඛමො ඵොට්ඨබ්බානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු භත්තාදකො ච හොති ඔකාසඵරණො ච පීඨමද්දනො ච සලකගාහී ච භික්ඛුත්වෙව සඞ්ඛං ගච්ඡතීති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 4. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අක්ඛමසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "39. පඤ්චහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො රඤ්ඤො නාගො න රාජාරහො හොති න රාජභොග්ගො. න රඤ්ඤො අඞ්ගන්ත්වෙව සඞ්ඛං ගච්ඡති. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ රඤ්ඤො නාගො අක්ඛමො හොති රූපානං, අක්ඛමො සද්දානං, අක්ඛමො ගන්ධානං, අක්ඛමො රසානං, අක්ඛමො ඵොට්ඨබ්බානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො අක්ඛමො හොති රූපානං? ඉධ භික්ඛවෙ රඤ්ඤො නාගො සඞ්ගාමගතො හත්ථිකායං වා දිස්වා අස්සකායං වා දිස්වා රථකායං වා දිස්වා පත්තිකායං වා දිස්වා සංසීදති විසීදති න සන්ථම්හති න සක්කොති සඞ්ගාමං ඔතරිතුං. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො අක්ඛමො හොති රූපානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො අක්ඛමො හොති සද්දානං? ඉධ භික්ඛවෙ රඤ්ඤො නාගො සඞ්ගාමගතො හත්ථිසද්දං වා සුත්වා, අස්සසද්දං වා සුත්වා රථසද්දං වා සුත්වා පත්තිසද්දං වා සුත්වා භෙරිපණව සඞ්ඛතිණවනින්නාදසද්දං වා සුත්වා සංසීදති විසීදති න සන්ථම්හති න සක්කොති සඞ්ගාමං ඔතරිතුං. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො අක්ඛමො හොති සද්දානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො අක්ඛමො හොති ගන්ධානං? ඉධ භික්ඛවෙ රඤ්ඤො නාගො සඞ්ගාමගතො යෙ තෙ රඤ්ඤො නාගා අභිජාතා සඞ්ගාමාවචරා, තෙසං මුත්තකරීසස්ස ගන්ධං ඝායිත්වා සංසීදති විසීදති, න සන්ථම්හති න සක්කොති සඞ්ගාමං ඔතරිතුං. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො අක්ඛමො හොති ගන්ධානං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. මඤ්චපීඨමද්දනො - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි රජුගේ ඇත් රූප නො සහනුයේ වෙයි. ශබ්දයන් නොසහනූයේ වෙයි. ගන්ධයන් නොසහනුයේ වෙයි. රස නොසහනුයේ වෙයි. සප්‍රෂ්ටව්‍යයන් නොසහනුයේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, රජුගේ හස්තිනාගයා මෙ කරුණු පසින් සමන්වාගත වූයේ භක්තාදක ද වෙයි. අවකාශස්ථරණ ද වෙයි. ලඬ හෙළනුයේ ද වෙයි. ලහ ගනුයේ ද වෙයි. “රජුගේ නාගයා ම වේ” යන සඞ්ඛ්‍යාවට ද යෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එ පරිද්දෙන් ම කරුණු පසෙකින් සමන්‍වාගත මහණ බොහෝ අහර වළඳනුයේත් වෙයි. අවකාශ අවුරණුයේත් වෙයි. (ඇඳ) පුටු මඩනේ ද වෙයි. ශලාකග්‍රාහී ද වෙයි. “මහණෙක” යන සඞ්ඛ්‍යාවට ද යෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ රූපාලම්බනයන් නොසහනේ වෙයි. ශබ්දාලම්බනයන් නොසහනේ වෙයි. ගන්ධාලම්බනයන් නොසහනේ වෙයි. රසාලම්බනයන් නොසහනේ වෙයි. ස්ප්‍රෂ්ටව්‍යාලම්බනයන් නොසහනේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසින් සමන්වාගත මහණ බොහෝ අහර වළඳනේ වෙයි. අවකාශ අවුරණුයේ ද වෙයි. පීඨමර්‍දන කරණුයේ ද වෙයි. ශලාකග්‍රාහී ද වෙයි. “මහණෙක් ම ය” යන සඞ්ඛ්‍යාවට ද යේ යයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.4.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අක්ඛම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "39. මහණෙනි, කරුණු පසෙකික් සමනවාගත රාජකීය හස්ති රාජාර්‍හ නො වෙයි, රාජභොග්‍ය නො වෙයි, “රාජාඞ්ගයෙක” යන සඞ්ඛ්‍යාවට ද නො යෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ‍මෙ ලොව රජුගේ ඇත් රූප නොසහනේ වෙයි. ශබ්ද නොසහනේ වෙයි. ගන්ධ නොසහනේ වෙයි. රස නොසහනේ වෙයි. ස්පර්‍ශ නොසහනේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, රජුගේ ඇත්රජ කෙසේ නම් රූප නො ඉවසන්නේ ය යත්: මහණෙනි, මෙ ලොව්හි රජුගේ ඇත්රජ සඞ්ග්‍රාම භූමියට ගියේ ඇත්මුළ හෝ දැක අස්මුළ හෝ දැක රියසෙන් හෝ දැක පාබළසෙන් හෝ දැක ගැලෙයි. වෙසෙසින් ගැලෙයි. මැනැවින් නො සිටුනේ ය. සඞ්ග්‍රාමභූමියට බස්නට නොපොහොසත් වෙයි. මහණෙනි, මෙසෙයින් රජුගේ හස්තිරාජයා රූප නො ඉවසන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් රජු‍ගේ ඇත් ශබ්ද නො ඉවසන්නේ ය යත්: මහණෙනි, මෙ ලොව්හි රජුගේ ඇත්රජ සඞ්ග්‍රාමභූමියට ගියේ ඇත්හඬ වේවයි අසා අස්හඬ වේවයි අසා රියහඬ වේවයි අසා පාබලසෙන්හඬ වේවයි අසා බෙර පණාබෙර සක් තිණ‍ව යන තූර්‍ය්‍යනාද වේවයි අසා ගැලෙයි. වෙසෙසින් ගැලෙයි. දැඩිව නො සිටුනේ ය. සඞ්ග්‍රාමභූමියට බස්නට නො පොහොනේ වෙයි. මහණෙනි, මෙසෙයින් රජුගේ ඇත්රජ ශබ්ද නොඉවසන්නේ වෙයි. ‍‍‍",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, රජුගේ හස්තිනාග කෙසේ නම් ගන්ධයන් නො ඉවසන්නේ ය යත්: මහණෙනි, මෙ ලොව්හි රජුගේ ඇත් සඞ්ග්‍රාමයට ගියේ රජුගේ අභිජාත වූ යම් ඇත්කෙනෙක් සඞ්ග්‍රාමාවචර වුහු නම්, උන්ගේ මුත්‍රපුරීෂ ගන්ධය අසා ගැලෙයි. පසුබසී. මනා කොට නොසිටුනේ ය. සංග්‍රාමවතරණයට නොපොහොනේ වෙයි. මහණෙනි, මෙසේ රජුගේ ඇත්රජ ගන්ධයනට අක්ෂම වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 258,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො අක්ඛමො හොති රසානං? ඉධ භික්ඛවෙ රඤ්ඤො නාගො සඞ්ගාමගතො එකිස්සා වා තිණොදකදත්තියා විමානිතො,{1} ද්වීහි වා තීහි වා චතුහි වා පඤ්චහි වා තිණොදකදත්තී හි විමානිතො{1} සංසීදති, විසීදති, න සන්ථම්හති, න සක්කොති සඞ්ගාමං ඔතරිතුං. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො අක්ඛමො හොති රසානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො අක්ඛමො හොති ඵොට්ඨබ්බානං? ඉධ භික්ඛවෙ රඤ්ඤො නාගො සඞ්ගාමගතො එකෙන වා සරවෙධෙන{3} විද්ධො, ද්වීහි වා තීහි වා චතුහි වා පඤ්චහි වා සරවෙධෙහි{3} විද්ධො සංසීදති, විසීදති, න සන්ථම්භති, න සක්කොති සඞ්ගාමං ඔතරිතුං. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො අක්ඛමො හොති ඵොට්ඨබ්බානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි අඞ්ගෙහි සමන්නාගතො රඤ්ඤො නාගො න රාජාරහො හොති න රාජභොග්ගො. න රඤ්ඤො අඞ්ගන්ත්වෙව සඞ්ඛං ගච්ඡති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ පඤ්චහි අඞ්ගෙහි සමන්නාගතො භික්ඛු න ආහුනෙය්යො හොති, න පාහුනෙය්යො, න දක්ඛිණෙය්යො, න අඤ්ජලිකරණීයො, න අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්ස. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු අක්ඛමො හොති රූපානං, අක්ඛමො සද්දානං, අක්ඛමො ගන්ධානං, අක්ඛමො රසානං, අක්ඛමො ඵොට්ඨබ්බානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු අක්ඛමො හොති රූපානං? ඉධ භික්ඛවෙ භික්ඛු චක්ඛුනා රූපං දිස්වා රජනීයෙ රූපෙ සාරජ්ජති. න සක්කොති චිත්තං සමාදහිතුං එවං ඛො භික්ඛවෙ භික්ඛු අක්ඛමො හොති රූපානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු අක්ඛමො හොති සද්දානං? ඉධ භික්ඛවෙ භික්ඛු සොතෙන සද්දං සුත්වා රජනීයෙ සද්දෙ සාරජ්ජති. න සක්කොති චිත්තං සමාදහිතුං එවං ඛො භික්ඛවෙ භික්ඛු අක්ඛමො හොති සද්දානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු අක්ඛමො හොති ගන්ධානං? ඉධ භික්ඛවෙ භික්ඛු ඝානෙන ගන්ධං ඝායිත්වා රජනීයෙ ගන්ධෙ සාරජ්ජති. න සක්කොති චිත්තං සමාදහිතුං එවං ඛො භික්ඛවෙ භික්ඛු අක්ඛමො හොති ගන්ධානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු අක්ඛමො හොති රසානං? ඉධ භික්ඛවෙ භික්ඛු ජිව්හාය රසං සායිත්වා රජනීයෙ රසෙ සාරජ්ජති. න සක්කොති චිත්තං සමාදහිතුං එවං ඛො භික්ඛවෙ භික්ඛු අක්ඛමො හොති රසානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු අක්ඛමො හොති ඵොට්ඨබ්බානං? ඉධ භික්ඛවෙ භික්ඛු කායෙන ඵොට්ඨබ්බං ඵුසිත්වා රජනීයෙ ඵොට්ඨබ්බෙ සාරජ්ජති. න සක්කොති චිත්තං සමාදහිතුං එවං ඛො භික්ඛවෙ භික්ඛු අක්ඛමො හොති ඵොට්ඨබ්බානං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. විහනීතො - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. සරවෙගෙන - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කෙසේ නම් රජුගේ හස්තියා රසයනට අක්ෂම වේය යත්: මහණෙනි, මෙ ලොව්හි රජුගේ ඇත් සංග්‍රාමභූමියට ගියේ එක් දිනෙක තණ දිය දීමෙකින් අපමානික වූයේ (දිනක තණදිය නො ලදුයේ) හෝ, තෘණොදකදාන දෙකෙකින් හෝ තුණෙකින් හෝ සතරෙකින් හෝ පසෙකින් හෝ අපමානිත වූයේ ගැලෙයි. වෙසෙසින් ගැලෙයි. මනා සේ නො සිටුනේ ය. සඞ්ග්‍රාමභූමියට වදනට නො හැකි වෙයි. මහණෙනි, මෙසේ රජුගේ නාග රසයනට අක්ෂම වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් රජුගේ ඇත් සප්‍රෂ්ටව්‍යයනට අක්ෂම වේ ය යත්: මහණෙනි, මෙලොව්හි රජුගේ ඇත් සඞ්ග්‍රාමභූමියට ගියේ එක් ශරවෙධයෙකින් හෝ විදුනා ලදුයේ, (ශරවෙධ) දෙකෙකින් හෝ තුණෙකින් හෝ සතරෙකින් හෝ ශරවෙධ පසෙකින් හෝ විදුනා ලදුයේ සංසීදන කෙරෙයි. විසීදන කෙරෙයි. මනා කොට නොසිටුනේ ය. සංග්‍රාමභූමියට බස්නට නොසමත් වෙයි. මහණෙනි, මෙ සෙයින් රජුගේ ඇත් ස්ප්‍රෂ්ටව්‍යයනට අක්ෂම වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසින් සමන්වාගත රාජකීය නාග රාජාර්‍ග නො වෙයි. රාජභොග්‍ය නො වෙයි. “රාජාඞ්ගයෙක” යන ගණනට නො ම යෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිද්දෙන් ම කරුණු පසෙකින් සමන්වාගත මහණ ආහුනාර්‍ග නො වෙයි. ප්‍රාඝුණාර්‍හ නො වෙයි. දක්ෂිණාර්‍හ නො වෙයි. අඤජලිකරණාර්‍හ නො වෙයි. ලොකයට අනුත්තර පුණ්‍යක්ෂෙත්‍ර නො වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ රූපයන් නො සහනේ වෙයි. ශබ්දයන් නොසහනේ වෙයි. ගන්ධයන් නොසහනේ වෙයි. රසයන් නොසහනේ වෙයි. ස්ප්‍රෂ්ටව්‍යයන් නොසහනේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් මහණ රූපයන් නො ඉවසන්නේ වේ ය යත්: මහණෙනි, මෙ සස්නෙහි මහණ චක්ෂුසින් රූපලම්බන දැක රඤ්ජනයට නිසි රූපයෙහි රැ‍ඳෙයි. සිත සමාහිත කිරීමට නො හැක්කේ ය. මහණෙනි, මෙ සෙයින් මහණ රූපයන් නො ඉවසන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම මහණ ශබ්ද නො ඉවසන්නේ ය යත්: මහණෙනි, මෙ සස්නෙහි මහණ ශ්‍රොතයෙන් ශබ්ද අසා රජනීය ශබ්දයෙහි රැ‍‍‍‍ඳෙයි. චිත්තය සමාහිත කරණට නො හැකි වෙයි. මහණෙනි, මෙසේ මහණ ශබ්දයන් නො ඉවසන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් මහණ ගන්ධයන් නො ඉවසන්නේ ය යත්: මහණෙනි, මෙ සස්නෙහි මහණ ඝ්‍රාණයෙන් ගන්ධ අසා රජනීය ගන්ධයෙහි රැ‍ඳෙයි. චිත්තය සමාහිත කිරීමට නො හැකි වෙයි. මහණෙනි, මෙසෙයින් මහණ ගන්ධයන් ඉවසනුවට නො හැකි වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් මහණ රසයන් නො සහනේය යත්: මහණෙනි, මෙ සස්නෙහි මහණ ජිහ්වායෙන් රස විඳ රජනීය රසයෙහි රැ‍ඳෙයි. සිත සමාහිත කිරීමට නො හැකි වෙයි. මහණෙනි, මෙසේ මහණ රසයන් ඉවසනුවට අක්ෂම වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් මහණ ස්ප්‍රෂ්ටව්‍යයන් ඉවසනුවට අක්ෂම වේය යත්: මහණෙනි, මෙ සස්නෙයි මහණ ස්ප්‍රෂ්ටව්‍යය පැහැස රජනීය ස්ප්‍රෂ්ටව්‍යයෙහි රැ‍ඳෙයි. චිත්තය සමාහිත කිරීමට නො හැකි වෙයි. මහණෙනි, මෙසේ මහණ ස්ප්‍රෂ්ටව්‍යයන් නො සහනේ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 260,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු න ආහුනෙය්යො හොති, න පාහුනෙය්යො, න දක්ඛිණෙය්යො, න අඤ්ජලිකරණීයො, න අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො රඤ්ඤො නාගො රාජාරහො හොති රාජභොග්ගො. රඤ්ඤො අඞ්ගන්ත්වෙව සඞ්ඛං ගච්ඡති. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ රඤ්ඤො නාගො ඛමො හොති රූපානං. ඛමො හොති සද්දානං. ඛමො හොති ගන්ධානං. ඛමො හොති රසානං. ඛමො හොති ඵොට්ඨබ්බානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො ඛමො හොති රූපානං? ඉධ භික්ඛවෙ රඤ්ඤො නාගො සඞ්ගාමගතො හත්ථිකායං වා දිස්වා අස්සකායං වා දිස්වා රථකායං වා දිස්වා පත්තිකායං වා දිස්වා න සංසීදති, න විසීදති, සන්ථම්භති, සක්කොති සඞ්ගාමං ඔතුරිතුං. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො ඛමො හොති රූපානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො ඛමො හොති සද්දානං? ඉධ භික්ඛවෙ රඤ්ඤො නාගො සඞ්ගාමගතො හත්ථිසද්දං වා සුත්වා අස්සසද්දං වා සුත්වා රථසද්දං වා සුත්වා පත්තිසද්දං වා සුත්වා භෙරිපණවසඞ්ඛතිණවනින්නාදසද්දං වා සුත්වා න සංසීදති, න විසීදති, සන්ථම්භති, සක්කොති සඞ්ගාමං ඔතරිතුං. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො ඛමො හොති සද්දානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො ඛමො හොති ගන්ධානං? ඉධ භික්ඛවෙ රඤ්ඤො නාගො සඞ්ගාමගතො යෙ තෙ රඤ්ඤො නාගා අභිජාතා සඞ්ගාමාවචරා, තෙසං මුත්තකරීසස්ස ගන්ධං ඝායිත්වා න සංසීදති, න විසීදති, සන්ථම්හති, සක්කොති සඞ්ගාමං ඔතරිතුං. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො ඛමො හොති ගන්ධානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො ඛමො හොති රසානං? ඉධ භික්ඛවෙ රඤ්ඤො නාගො සඞ්ගාමගතො එකිස්සා වා තිණොදකදත්තියා විමානිතො, ද්වීහි වා තීහි වා චතුහි වා පඤ්චහි වා තිණොදකදත්තීහි විමානිතො න සංසීදති, න විසීදති, සන්ථම්හති, සක්කොති සඞ්ගාමං ඔතරිතුං. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො ඛමො හොති රසානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො ඛමො හොති ඵොට්ඨබ්බානං? ඉධ භික්ඛවෙ රඤ්ඤො නාගො සඞ්ගාමගතො එකෙන වා සරවෙධෙන විද්ධො, ද්වීහි වා තීහි වා චතුහි වා පඤ්චහි වා සරවෙධෙහි විද්ධො න සංසීදති, න විසීදති, සන්ථම්හති, සක්කොති සඞ්ගාමං ඔතරිතුං. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො ඛමො හොති ඵොට්ඨබ්බානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි අඞ්ගෙහි සමන්නාගතො රඤ්ඤො නාගො රාජාරහො හොති රාජභොග්ගො රඤ්ඤො අඞ්ගන්ත්වෙව සඞ්ඛං ගච්ඡති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මෙ පඤ්චධර්‍මයෙන් සමන්‍වාගත මහණ ආහුනාර්‍හ නො වෙ යි. ප්‍රාඝුණාර්‍හ නො වෙයි. දක්ෂිණාර්‍හ නො වෙයි. අඤ්ජලිකරණාර්‍හ නො වෙයි. ලොකයට අනුත්තරපුණ්‍ය‍ක්ෂෙත්‍ර නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කරුණු පසෙකින් සමන්වාගත රජුගේ හස්තිනාග රාජාර්‍හ වෙයි. රාජභොග්‍ය වෙයි. “රාජාඞ්ගයෙක” යන සඞ්ඛ්‍යාවට යෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි රජුගේ හස්තිනාග රූපයන් සහනු වෙයි ... ස්ප්‍රෂ්ටව්‍යයන් සහනට ක්ෂම වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් රජුගේ හස්තිනාග රූපයන් සහනු වේය යත්: මහණෙනි, මෙ ලොවහි රජුගේ හස්තිනාග සඞ්ග්‍රාමයට ගියේ ඇත්මුළ දැක වේවයි ... සඞ්ග්‍රාමභූමියට බස්නට සමත් වෙයි. මහණෙනි, මෙසෙයින් රජුගේ හස්ති රූපයන් සහනු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් රජුගේ ඇත් ශබ්දයන් සහනු වේය යත: මහණෙනි, මෙ ලොව්හි රජුගේ ඇත් සඞ්ග්‍රාමභූමියට ගියේ හස්තිශබ්ද අසා හෝ අශ්වශබ්ද අසා හෝ රථශබ්ද අසා හෝ පදාතිශබ්ද අසා හෝ භෙරිපණවශඞ්ඛතිණවනිනාද අසා හෝ සංසීදන නො කෙරෙයි. විසීදන නො කෙරෙයි. සංස්තම්භන කෙරෙහි. සඞ්ග්‍රාමභූමියට වදනට හැකි වෙයි. මහණෙනි, මෙසේ රජුගේ ඇත් ශබ්දයන් සහනු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "‍මහණෙනි, කෙසේ නම් රජුගේ හස්ති ගන්ධයන් සහනු වේය යත්: මහණෙනි, මෙ ලොව්හි රජුගේ ඇත් සඞ්ග්‍රාමභූමියට ගියේ රජුගේ යම් අභිජාත වූ සඞ්ග්‍රාමාවතීර්‍ණ වූ හස්තිහූ වෙත් නම්, ඔවුන්ගේ මූත්‍රපුරීෂගන්ධ අසා සංසීදන නො කරයි. විසීදන නො කරයි. සංස්තම්භන කරයි. සඞ්ග්‍රාමභූමියට බස්න‍ට හැකි වෙයි. මහණෙනි, මෙසෙයින් රජුගේ හස්ති ගන්ධයන් සහනු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් රජුගේ හස්ති රසයන් සහනු වේය යත්: මහණෙනි, මෙ ලොව්හි රජුගේ ඇත් සඞ්ග්‍රාමභූමියට ගියේ එක් තණදිය දීමෙකින් වේවයි අපමානිත වූයේ, (තණදිය දීම්) දෙකෙකින් වේවයි තුණෙකින් සතරෙකින් වේවයි තණ දිය දීම් පසෙකින් වේවයි අපමානිත වූයේ සංසීදන නො කෙරෙයි. විසීදන නො කෙරෙයි. සංස්තම්භන කෙරෙයි. සඞ්ග්‍රාමාවතරණයට සමත් වෙයි. මහණෙනි, මෙසෙයින් රජුගේ හස්ති රසයන් සහනු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් රජුගේ ඇත් ස්ප්‍රෂ්ටව්‍යයන් සමනු වේය යත්: මහණෙනි, මෙ ලොව්හි රජුගේ ඇත් සඞ්ග්‍රාමයට ගියේ එක් ශරවෙධයෙකින් විදුනා ලදුයේ හෝ ශරවෙධ දෙකෙකින් හෝ තුණෙකින් හෝ සතරෙකින් හෝ පසෙකින් හෝ විදුනා ලදුයේ සංසීදන නො කෙරෙයි. විසීදන නො කෙරෙයි. සංස්තම්භන කෙරෙයි. සඞ්ග්‍රාමයට බස්නට සමත් වෙයි. මහණෙනි, මෙසේ රජුගේ ඇත් ස්ප්‍රෂ්ටව්‍යයන් සහනු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසින් සමන්වාගත රජුගේ ඇත් රාජාර්‍හ වෙයි. රාජාභොග්‍ය වෙයි. “රාජාඞ්ගයෙක” යන සඞ්ඛ්‍යාවට යෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 262,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු ආහුනෙය්යො හොති පාහුනෙය්යො දක්ඛිණෙය්යො අඤ්ජලිකරණීයො අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්ස. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු ඛමො හොති රූපානං. ඛමො සද්දානං, ඛමො ගන්ධානං, ඛමො රසානං, ඛමො ඵොට්ඨබ්බානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු ඛමො හොති රූපානං? ඉධ භික්ඛවෙ භික්ඛු චක්ඛුනා රූපං දිස්වා රජනීයෙ රූපෙ න සාරජ්ජති. සක්කොති චිත්තං සමාදහිතුං. එවං ඛො භික්ඛවෙ භික්ඛු ඛමො හොති රූපානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු ඛමො හොති සද්දානං? ඉධ භික්ඛවෙ භික්ඛු සොතෙන සද්දං සුත්වා රජනීයෙ සද්දෙ න සාරජ්ජති. සක්කොති චිත්තං සමාදහිතුං. එවං ඛො භික්ඛවෙ භික්ඛු ඛමො හොති සද්දානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු ඛමො හොති ගන්ධානං? ඉධ භික්ඛවෙ භික්ඛු ඝානෙන ගන්ධං ඝායිත්වා රජනීයෙ ගන්ධෙ න සාරජ්ජති. සක්කොති චිත්තං සමාදහිතුං. එවං ඛො භික්ඛවෙ භික්ඛු ඛමො හොති ගන්ධානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු ඛමො හොති රසානං? ඉධ භික්ඛවෙ භික්ඛු ජිව්හාය රසං සායිත්වා රජනීයෙ රසෙ න සාරජ්ජති. සක්කොති චිත්තං සමාදහිතුං. එවං ඛො භික්ඛවෙ භික්ඛු ඛමො හොති රසානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු ඛමො හොති ඵොට්ඨබ්බානං? ඉධ භික්ඛවෙ භික්ඛු කායෙන ඵොට්ඨබ්බං ඵුසිත්වා රජනීයෙ ඵොට්ඨබ්බෙ න සාරජ්ජති. සක්කොති චිත්තං සමාදහිතුං. එවං ඛො භික්ඛවෙ භික්ඛු ඛමො හොති ඵොට්ඨබ්බානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු ආහුනෙය්යො හොති පාහුනෙය්යො දක්ඛිණෙය්යො අඤ්ජලිකරණීයො අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්සාති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 4. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සොතාරසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "40. පඤ්චහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො රඤ්ඤො නාගො රාජාරහො හොති රාජභොග්ගො. රඤ්ඤො අඞ්ගන්ත්වෙව සඞ්ඛං ගච්ඡති. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ රඤ්ඤො නාගො සොතා ච හොති, හන්තා ච, රක්ඛිතා ච, ඛන්තා ච, ගන්තා ච."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, ඒ පරිද්දෙන් ම කරුණු පසෙකින් සමන්වාගත මහණ ආහුනෙය්‍ය වෙයි. පාහුනෙය්‍ය වෙයි. දක්ඛිණෙය්‍ය වෙයි. අඤ්ජලිකරණීය වෙයි. ලොකයට අනුත්තර පුණ්‍යක්ෂේත්‍ර වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ රූපාලම්බනයන් සහනුයේ වෙයි. ශබ්දාලම්බනයන් සහනුයේ වෙයි. ශබ්දාලම්බනයන් සහනුයේ වෙයි. ගන්ධාලම්බනයන් සහනුයේ වෙයි. රසාලම්බනයන් සහනුයේ වෙයි. ස්ප්‍රෂ්ටව්‍යාලම්බනයන් සහනුයේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ මහණ රූපයන් ඉවසනුයේ ‍වේ ය යත්: මහණෙනි, මෙ සස්නෙහි මහණ චක්ෂුසින් රූපාලම්බන දැක රජනීය රූපයෙහි නො ඇලෙයි. ‍‍ සිත සමාහිත කිරීමට සමත් වෙයි. මහණෙනි, මෙසෙයින් මහණ රූපයන් සහනුයේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ මහණ ශබ්දයන් ඉවසන්නේ වේ ය යත්: මහණෙනි, මෙ සස්නෙහි මහණ ශ්‍රොත්‍රයෙන් ශබ්දාලම්බන අසා රජනීය ශබ්දාලම්බනයෙහි නො ඇලෙයි. සිත සමාහිත කරණට හැකියේ වෙයි. මහණෙනි, මෙ සෙයින් මහණ ශබ්දයන් ඉවසනුයේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ මහණ ගන්ධයන් ඉවසන්නේ වේ ය යත්: මහණෙනි, මෙ සස්නෙහි මහණ ඝ්‍රාණයෙන් ගන්ධාලම්බන ආඝ්‍රාණ කොට රජනීය ගන්ධාලම්බනයෙහි නො ඇලෙයි. සිත සමාහිත කරණයට හැකියේ වෙයි. මහණෙනි, මෙසේ මහණ ගන්ධයන් ඉවසනුයේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ මහණ රසයන් ඉවසනුයේ වේ ය යත්: මහණෙනි, මෙ සස්නෙහි මහණ ජිහ්වායෙන් රසාලම්බන විඳ රජනීය රසාලම්බනයෙහි නො ඇලෙයි. චිත්තය සමාහිත කරණයට හැකි වෙයි. මහණෙනි, මහණ මෙසේ රසයන් ඉවසනුයේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ මහණ ස්ප්‍රෂ්ටව්‍යයන් ඉවසනුයේ වේ ය යත්: මහණෙනි, මෙ සස්නෙහි මහණ කයින් ස්ප්‍රෂ්ටව්‍ය පැහැස රජනීය ස්ප්‍රෂ්ටව්‍යාලම්බනයෙහි නො ඇලෙයි. චිත්තය සමාහිත කරණට හැකි වෙයි. මහණෙනි, මෙසේ මහණ ස්ප්‍රෂ්ටව්‍යයන් ඉවසනුයේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ කරුණු පසින් සමන්වාගත මහණ ආහුන්‍යෙය වෙයි. පාහුන්‍යෙය වෙයි. දක්ඛිණ්‍යෙය වෙයි. අඤ්ජලිකරණීය වෙයි. ලොකයට අනුත්තර පුණ්‍යක්ෂෙත්‍ර වේ ය යි.‍‍",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.4.10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සොතාර සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "40. මහණෙනි, කරුණු පසෙකින් සමන්වාගත රාජකීය මහඇත් රාජාර්‍හ වෙයි, රාජභොග්‍ය වෙයි, “රාජාඞ්ගයෙක” යන සඞ්ඛ්‍යාවට යෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ලොව්හි රජුගේ මහඇත් අසන්නේ ද වෙයි, නසන්නේ ද වෙයි, රකින්නේ ද වෙයි, ඉවසන්නේ ද වෙයි, යන්නේ ද වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 264,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො සොතා හොති? ඉධ භික්ඛවෙ රඤ්ඤො නාගො යමෙනං හත්ථිදම්මසාරථී කාරණං කාරෙති යදි වා කතපුබ්බං යදි වා අකතපුබ්බං, තං අට්ඨිකත්වා{1} මනසිකත්වා සබ්බචෙතසො{2} සමන්නාහරිත්වා ඔහිතසොතො සුණාති. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො සොතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො හන්තා හොති? ඉධ භික්ඛවෙ රඤ්ඤො නාගො සඞ්ගාමගතො හත්ථිම්පි හන්ති,{3} හත්ථාරුහම්පි හන්ති. අස්සම්පි හන්ති, අස්සාරුහම්පි හන්ති. රථම්පි හන්ති රථියම්පි{4} හන්ති. පත්තිකම්පි හන්ති. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො හන්තා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො රක්ඛිතා හොති? ඉධ භික්ඛවෙ රඤ්ඤො නාගො සඞ්ගාමගතො රක්ඛති පුරිමං කායං, රක්ඛති පච්ඡිමං කායං. රක්ඛති පුරිමෙ පාදෙ, රක්ඛති පච්ඡිමෙ පාදෙ. රක්ඛති සීසං, රක්ඛති කාණෙ, රක්ඛති දන්තෙ, රක්ඛති සොණ්ඩං, රක්ඛති වාලධිං, රක්ඛති හත්ථාරුහං. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො රක්ඛිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො ඛන්තා හොති? ඉධ භික්ඛවෙ රඤ්ඤො නාගො ඛමො හොති සත්තිප්පහාරානං, අසිප්පහාරානං, උසුප්පහාරානං, ඵරසුප්පහාරානං, භෙරිපණවසඞ්ඛතිණවනින්නාදසද්දානං. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො ඛන්තා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ රඤ්ඤො නාගො ගන්තා හොති? ඉධ භික්ඛවෙ රඤ්ඤො නාගො යමෙනං හත්ථිදම්මසාරථී දිසං පෙසෙති යදිවා ගතපුබ්බං යදිවා අගතපුබ්බං, තං ඛිප්පං එව{5} ගන්තා හොති. එවං ඛො භික්ඛවෙ රඤ්ඤො නාගො ගන්තා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි අඞ්ගෙහි සමන්නාගතො රඤ්ඤො නාගො රාජාරහො හොති රාජභොග්ගො. රඤ්ඤො අඞ්ගන්ත්වෙව සඞ්ඛං ගච්ඡති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු ආහුනෙය්යො හොති පාහුනෙය්යො දක්ඛිණෙය්යො අඤ්ජලිකරණීයො අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්ස. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ භික්ඛු සොතා ච හොති, හන්තා ච, රක්ඛිතා ච, ඛන්තා ච, ගන්තා ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු සොතා හොති? ඉධ භික්ඛවෙ භික්ඛු තථාගතප්පවෙදිතෙ ධම්මවිනයෙ දෙසියමානෙ අට්ඨීකත්වා{1} මනසිකත්වා සබ්බචෙතසො සමන්නාහරිත්වා ඔහිතසොතො ධම්මං සුණාති. එවං ඛො භික්ඛවෙ භික්ඛු සොතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු හන්තා හොති? ඉධ භික්ඛවෙ භික්ඛු උප්පන්නං කාමවිතක්කං නාධිවාසෙති පජහති විනොදෙති බ්යන්තීකරොති අනභාවං ගමෙති. උප්පන්නං ව්යාපාදවිතක්කං නාධිවාසෙති පජහති විනොදෙති බ්යන්තීකරොති අනභාවං ගමෙති. උප්පන්නං විහිංසාවිතක්කං නාධිවාසෙති පජහති විනොදෙති බ්යන්තීකරොති අනභාවං ගමෙති. උප්පන්නුප්පන්නෙ පාපකෙ අකුසලෙ ධම්මෙ නාධිවාසෙති පජහති විනොදෙති බ්යන්තීකරොති අනභාවං ගමෙති. එවං ඛො භික්ඛවෙ භික්ඛු හන්තා හොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අට්ඨිං කත්වා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සබ්බං චෙතසා - සීමු. සබ්බ චෙතසා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. හන්ති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. රථිකම්පි - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. ඛිප්පමෙව - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කෙසේ රජුගේ මහඇත් ශ්‍රොතෘ වේ ය යත්: මහණෙනි, මෙ ලොව්හි රජුගේ මහඇත් ඇත්දම්සැරි තෙල ඇත්හු ලවා කළ විරූ වේවයි නොකළ විරූ වේවයි යම් ම කාරණයක් කරවා නම්, එය අර්ථ කොට (ඕනෑකමින්) මෙනෙහි කොට මුළු සිතින් ආවර්ජනා කොට යොමු කළ කන් ඇතිව අසයි. මහණෙනි, මෙසේ රජුගේ මහඇත් ‍ශ්‍රොතෘ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ රජුගේ මහ ඇත් හන්තෘ වේ ය යත්: මහණෙනි, මෙ ලොව්හි රජුගේ මහඇත් රණබිමට ගියේ ඇතු ද නසයි, ඇතැරු ද නසයි, අසු ද නසයි, අසරු ද නසයි, රථය ද නසයි, රථිකයා ද නසයි, පාබළසෙන් ද නසයි. මහණෙනි, මෙසේ රජුගේ ඇත් රජ හන්තෘ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ රජුගේ මහඇත් රක්ෂිතෘ වේ ය යත්: මහණෙනි, මෙ ලොව්හි රජුගේ මහඇත් රණබිමට ගියේ ඉදිරිකය රක්නේ ය, පශ්චිමකාය රක්නේ ය, ඉදිරි පා රක්නේය, පසු පා රක්නේය, හිස රක්නේ ය, දෙකන් රක්නේ ය, දෙකන් රක්නේ ය, දෙදළ රක්නේ ය, සොඬ රක්නේ ය, වල්පත් රක්නේ ය, ඇතැරු රක්නේ ය. මහණෙනි, මෙසේ රජුගේ මහඇත් රක්ෂිතෘ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ රජුගේ මහඇත් ක්ෂන්තෘ වේ ය යත්: මහණෙනි, මෙ ලොව්හි රජුගේ මහඇත් සැත්පහර ඉවසනුයේ වෙයි, කඩුපහර ඉවසනුයේ වෙයි, හී පහර ඉවසනුයේ වෙයි, පොරෝ පහර ඉවසනුයේ වෙයි, බෙර පණාබෙරසක් ගැටබෙර තිණව-ඩිණ්ඩිම බෙර යන තූර්‍ය්‍යයන්ගේ මහ හඬ ඉවසනුයේ වෙයි. මහණෙනි, මෙසේ රජුගේ මහඇත් ක්ෂන්තෘ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ රජුගේ මහඇත් ගන්තෘ වේ ය යත්: මහණෙනි, මෙ ලොව්හි රජුගේ මහඇත් ඇත්දම්සැරි තෙල ඇතු ගිය විරූ වේවයි නොගිය විරූ වේවයි යම් ම දිශාවකට මෙහෙයවා නම්, එ දිගට වහා යන්නේ වෙයි. මහණෙනි, මෙසේ රජුගේ මහඇත් ගන්තෘ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ කරුණු පසින් යුත් රජුගේ මහඇත් රාජාර්‍හ වෙයි. රාජභොග්‍ය වෙයි. “රාජාඞ්ගයෙක” යන සඞ්ඛ්‍යාවට යෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එපරිද්දෙන් ම කරුණු පසෙකින් සමන්වාගත මහණ ආහුනෙය්‍ය වෙයි, පාහුනෙය්‍ය වෙයි, දක්ඛිණෙය්‍ය වෙයි, අඤ්ජලිකරණීය වෙයි, ලොකයට අනුත්තර පුණ්‍යක්ෂෙත්‍ර වෙයි. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි මහණ ශ්‍රොතෘ ද වෙයි. හන්තෘ ද වෙයි, රක්ෂිතෘ ද වෙයි, ක්ෂන්තෘ ද වෙයි, ගන්තෘ ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ මහණ ශ්‍රොතෘ වේ ය යත්: මහණෙනි, මෙ සස්නෙහි මහණ තථාගතයන් වහන්සේ විසින් ප්‍රවිදිත ධර්‍මවිනය දෙසනු ලබත් ම අර්ථ කොට (ආශාවෙන්), මෙනෙහි කොට, සම්පූර්‍ණ සිතින් ආවර්‍ජනා කොට, නැඹුරු කළ කන් ඇතිව ධර්‍මය අසයි. මහණෙනි, මෙසේ මහණ ශ්‍රොතෘ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ මහණ හන්තෘ වේ ය යත්: මහණෙනි, මෙ සස්නෙහි මහණ උපන් කාමවිතර්‍කය සිත්හි නො රඳවයි, දුරු කෙරෙයි, හැරපියයි. විගතාන්ත (ප්‍රහීණ) කරයි, අභාවයට පමුණුවයි. උපන් ව්‍යාපාදවිතර්‍කය සිත්හි වාස නො කරවයි, දුරු කෙරෙයි, හැරපියයි, විගතාන්ත කරයි, අභාවයට පමුණුවයි. උපන් විහිංසාවිතර්‍කය සිත්හි වාස නො කරවයි, දුරු කෙරෙයි, හැරපියයි, විගතාන්ත කෙරෙයි. අභාවයට පමුණුවයි. උපනුපන් ලමු අකුසල් දහම් වාස නො කරවයි, දුරු කෙරෙයි, හැරපියයි, විගතාන්ත කෙරෙයි, අභාවයට පමුණුවයි. මහණෙනි, මෙසේ මහණ හන්තෘ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 266,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු රක්ඛිතා හොති? ඉධ භික්ඛවෙ භික්ඛු චක්ඛුනා රූපං දිස්වා න නිමිත්තග්ගාහී නානුබ්යඤ්ජනග්ගාහී. යත්වාධිකරණමෙතං චක්ඛුන්ද්රියං අසංවුතං විහරන්තං අභිජ්ඣාදොමනස්සා පාපකා අකුසලා ධම්මා අන්වාස්සවෙය්යුං, තස්ස සංවරාය පටිපජ්ජති. රක්ඛති චක්ඛුන්ද්රියං, චක්ඛුන්ද්රියෙ සංවරං ආපජ්ජති. සොතෙන සද්දං සුත්වා -පෙ- ඝානෙන ගන්ධං ඝායිත්වා -පෙ- ජිව්හාය රසං සායිත්වා -පෙ- කායෙන ඵොට්ඨබ්බං ඵුසිත්වා -පෙ- මනසා ධම්මං විඤ්ඤාය න නිමිත්තග්ගාහී හොති නානුබ්යඤ්ජනග්ගාහී. යත්වාධිකරණමෙතං මනින්ද්රියං අසංවුතං විහරන්තං අභිජ්ඣාදොමනස්සා පාපකා අකුසලා ධම්මා අන්වාස්සවෙය්යුං, තස්ස සංවරාය පටිපජ්ජති. රක්ඛති මනින්ද්රියං, මනින්ද්රියෙ සංවරං ආපජ්ජති. එවං ඛො භික්ඛවෙ භික්ඛු රක්ඛිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු ඛන්තා හොති? ඉධ භික්ඛවෙ භික්ඛු ඛමො හොති සීතස්ස උණ්හස්ස ජිඝච්ඡාය පිපාසාය ඩංසමකසවාතාතපසිරිංසපසම්ඵස්සානං, දුරුත්තානං දුරාගතානං වචනපථානං. උප්පන්නානං සාරීරිකානං වෙදනානං දුක්ඛානං තිප්පානං ඛරානං කටුකානං අසාතානං අමනාපානං පාණහරානං අධිවාසකජාතිකො හොති. එවං ඛො භික්ඛවෙ භික්ඛු ඛන්තා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ භික්ඛු ගන්තා හොති? ඉධ භික්ඛවෙ භික්ඛු යා සා දිසා අගතපුබ්බා ඉමිනා දීඝෙන අද්ධුනා යදිදං සබ්බසංඛාරසමථො සබ්බූපධි පටිනිස්සග්ගො තණ්හක්ඛයො විරාගො නිරොධො නිබ්බානං, තං ඛිප්පඤ්ඤෙව ගන්තා හොති. එවං ඛො භික්ඛවෙ භික්ඛු ගන්තා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛු ආහුනෙය්යො හොති පාහුනෙය්යො දක්ඛිණෙය්යො අඤ්ජලිකරණීයො අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්සාති."
                    },
                    {
                        "type": "centered",
                        "text": "රාජවග්ගො චතුත්ථො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තස්සුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "චක්කානුවත්තනා රාජා යස්සං දිසං චෙව පත්ථනා\nඅප්පං සුපති භත්තාදා අක්ඛමො සොතාරො චාති.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, කෙසේ මහණ රක්ෂිතෘ වේ ය යත්: මහණෙනි, මෙ සස්නෙහි මහණ ඇසින් රූප දැක නිමිති නො ගන්නා සුලුයේ අනුවියඳුන් (උප ලකුණු) නො ගන්නා සුලුයේ වෙයි. යම් හෙයෙකින් ලාමක අකුශලධර්‍ම වූ අභිධ්‍යා දෞර්මනස්‍යයෝ චක්ෂුරින්ද්‍රිය අසංවෘත කොට වාස කරණ තෙල පුද්ගලයා ලුහුබඳනාහු නම්, එ චක්ෂුරින්ද්‍රිය සංවර කිරීමට පිළිපදනේ ය. චක්ෂුරින්ද්‍රිය රකියි. චක්ෂුරින්ද්‍රියයෙහි සංවරයට පැමිණෙයි. ශ්‍රොත්‍රයෙන් ශබ්ද අසා ... ඝ්‍රාණයෙන් ගන්ධය ආඝ්‍රාණ කොට ... දිවින් රස විඳ ... කයින් ස්ප්‍රෂටව්‍ය පැහැස ... මනසින් ධර්‍මය දැන නිමිති නො ගන්නා සුලුයේ අනුව්‍යඤ්ජන නො ගන්නා සුලුයේ වෙයි. යම් හෙයෙකින් ලාමක අකුශලධර්‍ම වූ අභිධ්‍යාදෞර්මනස්‍යයෝ මනින්ද්‍රිය අසංවෘත කොට වසන තෙල පුඟුල්හු ලුහුබඳනාහු නම්, ඒ මනින්ද්‍රිය සංවරය පිණිස පිළිපදිනේ ය. මනින්ද්‍රිය රකියි. මනින්ද්‍රියයෙහි සංවරයට පැමිණෙයි. මහ‍ණෙනි, මෙසේ මහණ රක්ෂිතෘ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් මහණ ක්ෂන්තෘ වේ ය යත්: මහණෙනි, මෙ සස්නෙහි මහණ ශීත හා උෂ්ණ හා සාපවස් හා මැසි මදුරු වා අවු සපුන් පහස් ඉවසන්නේ වෙයි. නපුරු කොට කියු නපුරු කොට පැමිණි (අසන්නට ලැබුනු) වචන ඉවසන්නේ වෙයි. දුක් වූ තීව්‍ර වූ ක්‍රෑර වූ කටුක වූ අශාත වූ අමනාප වූ පණ හරණා සුලු උපන් ශාරීරික වෙදනා ඉවසන සැහැවි ඇතියේ වෙයි. මහණෙනි, මෙසේ මහණ ක්ෂන්තෘ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මහණ කෙසේ ගන්තෘ වේ ය යත්: මහණෙනි, මෙ සස්නෙහි මහණ මේ දීර්‍ඝකාලයෙහි සර්‍වසංස්කාරයන්ගේ ශමථය වන සර්‍වොපධීන්ගේ දුරැලීම වන තෘෂ්ණාක්ෂය වන විරාගය වය නිරොධය වන නිර්‍වාණය වන යම් නොගියවිරූ දිශායෙක් වේ නම්, එ දිගට වහා යන සුලුයේ වෙයි. මහණෙනි, මෙසේ මහණ ගන්තෘ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ පස් කරුණින් සමන්වාගත වූ මහණ ආහුනෙය්‍ය වෙයි, පාහුනෙය්‍ය වෙයි, දක්ඛිණෙය්‍ය වෙයි, අඤ්ජලිකරණීය වෙයි, ලොකයට අනුත්තර පුණ්‍ය‍ක්ෂෙත්‍ර වේ යයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "රාජවර්‍ගය සතර වැනි යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "එහි උද්දානය:",
                        "type": "unindented"
                    },
                    {
                        "text": "චක්කානුවත්තන සූත්‍ර දෙකය, ධම්මරාජ සූත්‍රය, යස්සං දිසා සූත්‍රය, පත්ථනා සූත්‍ර දෙකය, අප්පං සූපති සූත්‍රය, භත්තාද සූත්‍රය, අක්ඛම සූත්‍රය, සොතාර සූත්‍රය සමඟ දශයෙකි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 268,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "5. තිකණ්ඩකීවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 5. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අවජානාති සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "41. පඤ්චිමෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "දත්වා අවජානානි, සංවාසෙන අවජානාති, ආදිය්යමුඛො{1} හොති, ලොලො හොති. මන්දො හොති මොමුහො.{2}"
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො දත්වා අවජානාති? ඉධ භික්ඛවෙ පුග්ගලො පුග්ගලස්ස දෙති චීවරපිණ්ඩපාතසෙනාසනගිලානපච්චයභෙසජ්ජපරික්ඛාරං. තස්ස එවං හොති: ‘අහං දෙමි, අයං පතිගණ්හාතී’ති.{3} තමෙනං දත්වා අවජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො දත්වා අවජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො සංවාසෙන අවජානාති? ඉධ භික්ඛවෙ පුග්ගලො පුග්ගලෙන සද්ධිං සංවසති ද්වෙ වා තීණි වා වස්සානි. තමෙනං සංවාසෙන අවජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො සංවාසෙන අවජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො __ආදිය්යමුඛො__{1}{*} හොති? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො පරස්ස වණෙණ වා අවණෙණ වා භාසියමානෙ තං ඛිප්පඤ්ඤෙව අධිමුච්චිතා{4} හොති. එවං ඛො භික්ඛවෙ පුග්ගලො ආදිය්යමුඛො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො ලොලො හොති? ඉධ භික්ඛවෙ එකච්චො පුග්ගලො ඉත්තරසද්ධො හොති. ඉත්තරභත්තී ඉත්තරපෙමො ඉත්තරප්පසාදො. එවං ඛො භික්ඛවෙ පුග්ගලො ලොලො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ පුග්ගලො මන්දො හොති? මොමූහො ඉධ භික්ඛවෙ එකච්චො පුග්ගලො කුසලාකුසලෙ ධම්මෙ න ජානාති, සාවජ්ජානවජ්ජෙ ධම්මෙ න ජානාති, හීනප්පණීතෙ ධම්මෙ න ජානාති, කණ්හසුක්කසප්පටිභාගෙ ධම්මෙ න ජානාති. එවං ඛො භික්ඛවෙ පුග්ගලො මන්දො හොති මොමුහො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ පඤ්ච පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 5. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(ආරම්භතිසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "42. පඤ්චිමෙ භික්ඛවෙ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං කතමෙ පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛවෙ එකච්චො පුග්ගලො ආරම්හති{1} ච විප්පටිසාරි ච හොති. තං ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං යථාභූතං නප්පජානාති යත්ථස්සු තෙ උප්පන්නා පාපකා අකුසලා ධම්මා අපරිසෙසා නිරුජ්ඣන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ආධෙය්යමුඛො - මඡසං. ආදෙය්යමුඛො - ස්යා, ආදියමුඛො -"
                    },
                    {
                        "type": "footnote",
                        "text": "2. මන්දො මොමුහො හොති - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. පටිග්ගණ්හාතී’ති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "1. "
                    },
                    {
                        "type": "footnote",
                        "text": "*. ‘ආධිය්යමුඛො’ති පොරාණ පාඨො. අට්ඨකථායපි පාලියා අත්ථො නිද්දිට්ඨො."
                    },
                    {
                        "type": "footnote",
                        "text": "4. අධිමුච්චිතො - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "5. තිකණ්ඩකී වර්ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "5.3.5.1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අවජානාති සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "41. මහණෙනි, ලොකයෙහි විද්‍යාමාන වන මේ පුද්ගලයෝ පස් දෙනෙක් වෙත්. කවර පස්දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "දී අවමන් කරන්නේ ය, එක්වැ විසීමෙන් අවමන් කරන්නේ ය, ග්‍රහණමුඛයෙක් වෙයි, ලොලයෙක් වෙයි, මන්ද මොමුහයෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල දී අවමන් කෙරේ ය යත්: මහණෙනි, මෙ ලොවැ පුද්ගල පුඟුලක්හට සිවුරු පිඬුවා සෙනසුන් ගිලන්පස බෙහෙසද් පිරිකර දෙයි. ඔහට මෙබඳු සිත් වෙයි: “මම දෙන්නෙම් වෙමි, මෙ තෙමේ පිළිගන්නේ වේ (මෙතෙම පිළිගන්නට නම් දනී) ය” යි. තෙල පුඟුල්හට දී අවමන් කෙරෙයි. මහණෙනි, මෙසේ පුද්ගල දී අවමන් කරන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල සංවාසයෙන් (එක්ව විසීමෙන්) අවමන් කෙරේ ය යත්: මහණෙනි, මෙ ලොවැ පුද්ගල පුද්ගලයකු හා සමඟ දෙවසක් වේවයි තෙවසක් වේවයි එක්ව වසයි. සංවාසයෙන් (මම තොපගේ හැටි දනිමි යි) එපුඟුල්හට අවමන් කෙරෙයි. මහණෙනි, මෙසේ පුද්ගල සංවාසයෙන් අවමන් කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල ග්‍රහණමුඛ වේ ය යත්: මහණෙනි, මෙ ලොවැ ඇතැම් පුද්ගලයෙක් මෙරමාගේ ගුණය වේවයි අගුණය වේවයි කියත් ම එය වහා ම අදහන්නේ (පිළිගැණීමට හයාගත් මුව ඇත්තේ) වෙයි. මහණෙනි, මෙසේ පුද්ගල ග්‍රහණමුඛ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල ලොල වේ ය යත්: මහණෙනි, මෙ ලොවැ ඇතැම් පුද්ගලයෙක් ඉත්වර (ස්වල්ප) ශ්‍රද්ධා ඇතියේ ඉත්වරභක්ති ඇතියේ ඉත්වරප්‍රෙමඇතියේ ඉත්වරප්‍රසාද ඇතියේ වෙයි. මහණෙනි, මෙසේ පුද්ගල ලොලයෙක් (වහා වෙනස්වන සුලු අස්ථිරයෙක්) වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ පුද්ගල මන්ද මොමූහ වේ ය යත්: මහණෙනි, මෙ ලොවැ ඇතැම් පුද්ගලයෙක් කුශල අකුශල ධර්‍මයන් නො දන්නේ ය. සාවද්‍ය අනවද්‍ය ධර්‍මයන් නො දන්නේ ය. හීනප්‍රණිත ධර්‍මයන් නො දන්නේ ය. කෘෂ්ණශුක්ල සප්‍රතිභාග (අකුශලවිරුද්ධ කුශල, කුශලවිරුද්ධ අකුශල) ධර්‍මයන් නො දන්නේ ය. මහණෙනි, මෙසේ පුද්ගල මන්ද මොමුහ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මොහු ලොකයෙහි විද්‍යාමාන පුද්ගලයෝ පස්දෙන යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.5.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආරම්භති සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "42. මහණෙනි, ලොකයෙහි මේ පුද්ගලයෝ පස්දෙනෙක් විද්‍යාමාන වෙත්. කවර පස්දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි ඇතැම් පුද්ගලයෙක් ආපත්තිව්‍යතික්‍රම (ආරම්හ) ද කෙරෙයි. (එ හෙතුයෙන්) විපිළිසර ඇතියේ ද වෙයි. යම් තැනෙක්හි (යම් කරුණෙක්හි) ඔහුට උපන් එ ලාමක අකුශලධර්‍මයො අපරිශෙෂව නිරුද්ධ වෙත් නම්, ඒ (අර්‍හත්වඵලසමාධි) චෙතොවිමුක්තිය හා (අර්‍හත්වඵලඥාන) ප්‍රඥාවිමුක්තිය ඇති සැටියෙන් (අර්‍හත්වාධිගම නැති හෙයින්) නො දන්නේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 270,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො පුග්ගලො ආරම්භති, න විප්පටිසාරී හොති. තං ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං යථාභූතං නප්පජානාති යත්ථස්සු තෙ උප්පන්නා පාපකා අකුසලා ධම්මා අපරිසෙසා නිරුජ්ඣන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො පුග්ගලො නාරම්භති, විප්පටිසාරී හොති. තං ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං යථාභූතං නප්පජානාති යත්ථස්සු තෙ උප්පන්නා පාපකා අකුසලා ධම්මා අපරිසෙසා නිරුජ්ඣන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙව එකච්චො පුග්ගලො නාරම්භති, න විප්පටිසාරී හොති. තං ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං යථාභූතං නප්පජානාති යත්ථස්සු තෙ උප්පන්නා පාපකා අකුසලා ධම්මා අපරිසෙසා නිරුජ්ඣන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ පන භික්ඛවෙ එකච්චො පුග්ගලො නාරම්භති, න විප්පටිසාරී හොති. තං ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං යථාභූතං පජානාති යත්ථස්සු තෙ උප්පන්නා පාපකා අකුසලා ධම්මා අපරිසෙසා නිරුජ්ඣන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ර භික්ඛවෙ ය්වායං පුග්ගලො ආරම්භති ච, විප්පටිසාරී ච හොති, තං ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං යථාභූතං නප්පජානාති යත්ථස්සු තෙ උප්පන්නා පාපකා අකුසලා ධම්මා අපරිසෙසා නිරුජ්ඣන්ති, සො එවමස්ස වචනීයො: ‘ආයස්මතො ඛො ආරම්භජා ආසවා සංවිජ්ජන්ති. විප්පටිසාරජා ආසවා පවඩ්ඪන්ති. සාධු වතායස්මා ආරම්භජෙ ආසවෙ පහාය විප්පටිසාරජෙ ආසවෙ පටිවිනොදෙත්වා චිත්තං පඤ්ඤං ච භාවෙතු. එවමායස්මා අමුනා පඤ්චමෙන පුග්ගලෙන සමසමො භවිස්සතී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ර භික්ඛවෙ ය්වායං පුග්ගලො ආරම්භති, න විප්පටිසාරී හොති, තං ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං යථාභූතං නප්පජානාති යත්ථස්සු තෙ උප්පන්නා පාපකා අකුසලා ධම්මා අපරිසෙසා නිරුජ්ඣන්ති, සො එවමස්ස වචනීයො: ‘ආයස්මතො ඛො ආරම්භජා ආසවා සංවිජ්ජන්ති. විප්පටිසාරජා ආසවා නප්පවඩ්ඪන්ති. සාධු වතායස්මා ආරම්භජෙ ආසවෙ පහාය චිත්තං පඤ්ඤං ච ච භාවෙතු. එවමායස්මා අමුනා පඤ්චමෙන පුග්ගලෙන සමසමො භවිස්සතී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ර භික්ඛවෙ ය්වායං පුග්ගලො නාරම්භති, විප්පටිසාරී හොති, තං ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං යථාභූතං නප්පජානාති යත්ථස්සු තෙ උප්පන්නා පාපකා අකුසලා ධම්මා අපරිසෙසා නිරුජ්ඣන්ති, සො එවමස්ස වචනීයො: ‘ආයස්මතො ඛො ආරම්භජා ආසවා න සංවිජ්ජන්ති. විප්පටිසාරජා ආසවා පවඩ්ඪන්ති. සාධු වතායස්මා විප්පටිසාරජෙ ආසවෙ පටිවිනොදෙත්වා චිත්තං පඤ්ඤං ච භාවෙතු. එවමායස්මා අමුනා පඤ්චමෙන පුග්ගලෙන සමසමො භවිස්සතී’ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි ඇතැම් පුද්ගලයෙක් ඇවැත් මඩනේ ය, (ඇවැතින් නැඟිසිටි හෙයින්) විපිලිසර ඇතියේ නො වෙයි. යම් කරුණෙකින් ඔහට උපන් එ ලාමක අකුශලධර්‍මයෝ අපරිශෙෂ වූවාහු නිරුද්ධ වෙත් නම්, ඒ චෙතොවිමුක්තිය හා ප්‍රඥාවිමුක්තිය හා ඇති සැටියෙන් නො දන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි ඇතැම් පුද්ගලයෙක් ආපත්තිව්‍යතික්‍රම නො කෙරෙයි. (ඇවැතින් නැඟී සිටියේ ද) විපිළිසර ඇතියේ වෙයි. යම් කරුණෙකින් ඔහට උපන් එ ලාමක අකුශලධර්‍මයෝ අපරිශෙෂ වූවාහු නිරුද්ධ වෙත් නම්, ඒ චෙතොවිමුක්තිය ද ප්‍රඥාවිමුක්තිය ද ඇතිසැටියෙන් නො දන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "__need typing__"
                    },
                    {
                        "text": "මහණෙනි, මෙ සස්නෙහි ඇතැම් පුද්ගලයෙක් ආපත්තිව්‍යතික්‍රම නො කෙරෙයි. විපිළිසර ඇතියේ ද නො වෙයි. යම් හෙයෙකින් ඔහට උපන් එ ලාමක අකුශලධර්‍මයෝ අපරිශෙෂ වූවාහු නිරුද්ධ වෙත් නම්, ඒ චෙතොවිමුක්තිය ද ප්‍රඥාවිමුක්තිය ද ඇතිසැටියෙන් නො දන්නේ ය. (මේ රහත් පුඟුල් ය)",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඔවුනතුරෙහි යම් පුද්ගලයෙක් ඇවැත් මඩනේ හා විපිළිසර ඇතියේ හා වේ ද, යම් කරුණෙකින් ඔහට උපන් එ ලාමක අකුශලධර්‍මයෝ අපරිශෙෂ වූවාහු නිරුද්ධ වෙත් නම්, ඒ චෙතොවිමුක්තිය ද ප්‍රඥාවිමුක්තිය ද ඇතිසැටි නොදන්නේ ද, හේ මෙසේ කිවයුතු වන්නේ ය: “ආයුෂ්මත්හට ආපත්තිව්‍යතික්‍රමයෙන් උපන් ආස්‍රවයෝ විද්‍යාමාන වෙති. විප්‍රතිසාරයෙන් උපන් ආස්‍රවයෝ වැඩෙති. ආයුෂ්මත් ආරම්හප්‍රත්‍යයෙන් උපන් ආස්‍රවයන් ප්‍රහීණ කොට විප්‍රතිසාරයෙන් උපන් ආස්‍රවයෝ දුරු කොට චිත්තය (සමාධි-ප්‍රඥා දෙක) වඩනේ මැනැව. එසේ වත් ම ආයුෂ්මත් මේ පස්වන (රහත්) පුඟුල් හා සමසම වන්නේ ය” යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඔවුනතුරෙහි යම් පුද්ගලයෙක් ආපත්තිව්‍යතික්‍රම කෙරේ ද, විපිළිසර ඇතියේ නො වේ ද, යම් කරුණෙකින් ඔහට උපන් එ ලාමක අකුශලධර්‍මයෝ අපරිශෙෂ ව නිරුද්ධ වෙත් නම්, ඒ චෙතොවිමුක්තිය ද ප්‍රඥාවිමුක්තිය ද ඇති සැටියෙන් නො දන්නේ ද, හේ මෙසෙයින් කිවයුතු වන්නේ ය: “ආයුෂ්මත්හට වනාහි ආරම්භප්‍රත්‍යයෙන් උපන් ආස්‍රවයෝ විද්‍යමානයහ. විපිළිසරින් උපන් ආස්‍රවයෝ නො වැඩෙන්නාහ. ආයුෂ්මත් එකාන්තයෙන් ආරම්භප්‍රත්‍යයෙන් උපන් ආස්‍රවයන් ප්‍රහීණ කොට සමාධිය හා ප්‍රඥාව හා වඩා නම් මැනැවැ. එසේවත් ම ආයුෂ්මත් තෙල පස්වන පුඟුල් හා සමසම වන්නේ ය”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඔවුනතුරෙහි යම් පුද්ගලයෙක් ආපත්තිව්‍යතික්‍රමය නො කෙරේ ද, (එහෙත්) විපිළිසර ඇතියේ වේ ද, යම් කරුණෙකින් ඔහට උපන් ඒ ලාමක අකුශලධර්‍මයෝ අපරිශෙෂ වූවාහු නිරුද්ධ වෙත් නම්, ඒ චෙතොවිමුක්තිය හා ප්‍රඥාවිමුක්තිය හා ඇතිසැටියෙන් නො දන්නේ ද, හේ මෙසේ කිවයුතු වන්නේ ය: “ආයුෂ්මත්ට ආරම්හප්‍රත්‍යයෙන් උපන් ආස්‍රවයෝ විද්‍යාමාන නො වෙති. විපිළිසරින් උපන් ආස්‍රවයෝ වැඩෙන්නාහ. ආයුෂ්මත් එකාන්තයෙන් විපිළිසරින් උපන් ආස්‍රවයන් දුරු කොට චිත්තය හා ප්‍රඥාව හා වඩා නම් මැනැවැ. එසේ වත් ම ආයුෂ්මත් තෙල පස්වන පුද්ගලයා හා සමසම වන්නේ ය” යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 272,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තත්ර භික්ඛවෙ ය්වායං පුග්ගලො නාරම්භති, න විප්පටිසාරී හොති, තං ච චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං යථාභූතං නප්පජානාති යත්ථස්සු තෙ උප්පන්නා පාපකා අකුසලා ධම්මා අපරිසෙසා නිරුජ්ඣන්ති, සො එවමස්ස වචනීයො: ‘ආයස්මතො ඛො ආරම්භජා ආසවා න සංවිජ්ජන්ති. විප්පටිසාරජා ආසවා නප්පඩ්ඪන්ති. සාධු වතායස්මා චිත්තං පඤ්ඤං ච භාවෙතු. එවමායස්මා අමුනා පඤ්චමෙන පුග්ගලෙන සමසමො භවිස්සතී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉති ඛො භික්ඛවෙ ඉමෙ චත්තාරො පුග්ගලා අමුනා පඤ්චමෙන පුග්ගලෙන එවං ඔවදියමානා එවං අනුසාසියමානා අනුපුබ්බෙන ආසවානං ඛයං පාපුණන්තී’ති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 5. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සාරන්දද සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "43. එකං සමයං භගවා **වෙසාලියං** විහරති මහාවනෙ **කූටාගාරසාලායං**. අථ ඛො භගවා පුබ්බන්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය වෙසාලිං පිණ්ඩාය පාවිසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන පඤ්චමත්තානං ලිච්ඡවීසතානං **සාරන්දදෙචෙතියෙ** සන්නිසින්නානං සන්නිපතිතානං අයමන්තරා කථා උදපාදි: ‘පඤ්චන්නං රතනානං පාතුභාවො දුල්ලභො ලොකස්මිං. කතමෙසං පඤ්චන්නං: හත්ථිරතනස්ස පාතුභාවො දුල්ලභො ලොකස්මිං. අස්සරතනස්ස පාතුභාවො දුල්ලභො ලොකස්මිං. මණිරතනස්ස පාතුභාවො දුල්ලභො ලොකස්මිං. ඉත්ථිරතනස්ස පාතුභාවො දුල්ලභො ලොකස්මිං. ගහපතිරතනස්ස පාතුභාවො දුල්ලභො ලොකස්මිං. ඉමෙසං පඤ්චන්නං රතනානං පාතුභාවො දුල්ලභො ලොකස්මින්ති.’"
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො තෙ ලිච්ඡවී මග්ගෙ පුරිසං ඨපෙසුං, ‘යදා ත්වං{1} අම්භො පුරිස පස්සෙය්යාසි භගවන්තං ආගච්ඡන්තං, අථ අම්හාකං ආරොචෙය්යාසී’ති. අද්දසා ඛො සො පුරිසො භගවන්තං දුරතොව ආගච්ඡන්තං. දිස්වාන යෙන තෙ ලිච්ඡවී තෙනුපසඞ්කමි. උපසඞ්කමිත්වා තෙ ලිච්ඡවී එතදවොච: ‘අයං සො භොන්තො{2} භගවා ආගච්ඡති{3} අරහං සම්මාසම්බුද්ධො, යස්සදානි කාලං මඤ්ඤථා’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො තෙ ලිච්ඡවී යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං අට්ඨංසු. එකමන්තං ඨිතා ඛො තෙ ලිච්ඡවී භගවන්තං එතදවොචුං: ‘සාධු භන්තෙ භගවා යෙන සාරන්දදං{4} චෙතියං තෙනුපසඞ්කමතු අනුකම්පං උපාදායා’ති. අධිවාසෙසි භගවා තුණ්හීභාවෙන. අථ ඛො භගවා යෙන සාරන්දදං චෙතියං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදි. නිසජ්ජ ඛො භගවා තෙ ලිච්ඡවී එතදවොච:"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. යථා ත්වං - සීමු, PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. භන්තෙ - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ගච්ඡති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. සාධු භන්තෙ යෙන සාරන්දදං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, ඔවුනතුරෙහි යම් පුද්ගලයෙක් ආපත්තිව්‍යතික්‍රමය නො කෙරේ ද, විපිළිසර ඇතියේ නො වේ ද, යම් කරුණෙක්හි ඔහට උපන් ඒ ලාමක අකුශලධර්‍මයෝ අපරිශෙෂ වූවාහු නිරුද්ධ වෙත් නම් ඒ චෙතොවිමුක්තිය හා ප්‍රඥාවිමුක්තිය හා ඇතිසැටියෙන් නො දන්නේ ද, හේ මෙසේ කිවයුතු වන්නේ ය: “ආයුෂ්මත්හට ආරම්භප්‍රත්‍යයෙන් උපන් ආස්‍රවයෝ අවිද්‍යාමානයහ. විපිළිසරින් උපන් ආස්‍රවයෝ නො වැඩෙන්නාහ. ආයුෂ්මත් චිත්තය හා ප්‍රඥාව වඩා නම් එකාන්තයෙන් මැනැවැ. එසේ වත් ම ආයුෂ්මත් තෙල පස්වන පුද්ගලයා හා සමසම වන්නේ ය” යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "මහණෙනි, මෙසේ මේ (මුලින් කී) සතර පුද්ගලයෝ මේ පස්වන (රහත්) පුඟුල්හු විසින් මෙලෙසින් ඔවා දෙනු ලබන්නාහු අනුක්‍රමයෙන් ආස්‍රවක්ෂයට පැමිණෙන්නාහ යි."
                    },
                    {
                        "type": "centered",
                        "text": "5.3.5.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සාරන්දද සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "43. එක් කලෙක භාග්‍යවතුන් වහන්සේ වෙසාලී නගර සමීපයෙහි වූ මහාවනයෙහි කුළාරහල්හි වැඩවසන සේක. එකල්හි භාග්‍යවතුන් වහන්සේ පෙරවරුයෙහි හැඳ පෙරෙව පාසිවුරු ගෙණ වෙසාලියට පිඬු පිණිස වැඩි සේක.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එසමයෙහි සාරන්දද චෙතියෙහි රැස්ව හුන් පන්සියක් පමණ ලිච්ඡවීන් අතුරෙහි මෙ අතුරු කථාව පාළ විය. “ලොව්හි පඤ්චරත්නයන්ගේ ප්‍රාදුර්‍භාවය දුර්‍ලභ වෙයි, කවර පඤ්චරත්නයන්ගේ ය යත්: ලොව්හි හස්තිරත්නයාගේ ප්‍රාදුර්‍භාවය දුර්‍ලභ වෙයි. ලොව්හි අශ්වරත්නයාගේ ප්‍රාදුර්‍භාවය දුර්‍ලභ වෙයි. ලොව්හි මණිරත්නයාගේ ප්‍රාදුර්‍භාවය දුර්‍ලභ වෙයි. ලොව්හි ස්ත්‍රීරත්නයාගේ ප්‍රාදුර්‍භාවය දුර්‍ලභ වෙයි. ලොව්හි ගෘහපතිරත්නයාගේ ප්‍රාදුර්‍භාවය දුර්‍ලභ වෙයි. ලොව්හි මෙ පඤ්චරත්නයන්ගේ පාළවීම දුර්‍ලභ වේ”ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉක්බිති එ ලිච්ඡවීහු “එම්බා පුරුෂය, යම් විටෙක තෝ භාග්‍යවතුන් වහන්සේ වඩනවුන් දක්නෙහි ද, එකල්හි අපට දන්වාලව” යි මාර්‍ගයෙහි පුරුෂයකු රඳවාලූහ. එ පුරුෂයා භාග්‍යවතුන්වහන්සේ වඩනාවුන් දුරදීම දිට. දැක එ ලිච්ඡවීන් කරා ගියේ. ගොස් එ ලිච්ඡවීනට තෙල කී: “භවත්නි, අර්‍හත් සම්‍යක්සම්බුද්ධ වූ ඒ භාග්‍යවතුන් වහන්සේ වඩනාහ. එයට දැන් කල් දනුව” යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එකල්හි එ ලිච්ඡවීහු භාග්‍යවතුන් වහන්සේ කරා එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ සකසා වැඳ එකත්පස් ව සිටියහ. එකත්පස් ව සිටි එ ලිච්ඡවීහු භාග්‍යවතුන් වහන්සේට තෙල සැළකළෝ: “වහන්ස, අයැදුම්හ. භාග්‍යවතුන් වහන්සේ අනුකම්පා සඳහා සාරන්දද චෛත්‍යය කරා වඩනා සේක්ව” යි. භාග්‍යවතුන් වහන්සේ තුෂ්ණිම්භාවයෙන් ඉවසූ සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ සාරන්දද චෛත්‍යය කරා වැඩි සේක. වැඩ පැන්වූ අස්නෙහි හුන් සේක. භාග්‍යවතුන් වහන්සේ වැඩහිඳ එ ලිච්ඡවීනට තෙල කරුණ වදාළෝ:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 274,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“කායනුත්ථ ලිච්ඡවී, එතරහි කථාය සන්නිසින්නා? කා ච පන වො අන්තරා කථා විප්පකතා”ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භන්තෙ අම්හාකං සන්නිසින්නානං සන්නිපතිනානං අයමන්තරා කථා උදපාදි: පඤ්චන්නං රතනානං පාතුභාවො දුල්ලභො ලොකස්මිං. කතමෙසං පඤ්චන්නං: හත්ථිරතනස්ස පාතුභාවො දුල්ලභො ලොකස්මිං. අස්සරතනස්ස පාතූභාවො දුල්ලභො ලොකස්මිං. මණිරතනස්ස පාතුභාවො දුල්ලභො ලොකස්මිං. ඉත්ථිරතනස්ස පාතුභාවො දුල්ලභො ලොකස්මිං. ගහපතිරතනස්ස පාතුභාවො දුල්ලභො ලොකස්මිං. ඉමෙසං පඤ්චන්නං රතනානං පාතුභාවො දුල්ලභො ලොකස්මින්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කාමාධිමුත්තානං වත වො{1} ලිච්ඡවීනං කාමඤ්ඤෙව ආරබ්භ අන්තරා කථා උදපාදි."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චන්නං ලිච්ඡවී, රතනානං පාතුභාවො දුල්ලභො ලොකස්මිං. කතමෙසං පඤ්චන්නං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "තථාගතස්ස අරහතො සම්මාසම්බුද්ධස්ස පාතුභාවො දුල්ලභො ලොකස්මිං. තථාගතප්පවෙදිතස්ස ධම්මවිනයස්ස දෙසෙතා පුග්ගලො දුල්ලභො ලොකස්මිං. තථාගතප්පවෙදිතස්ස ධම්මවිනයස්ස දෙසිතස්ස විඤ්ඤාතා පුග්ගලො දුල්ලභො ලොකස්මිං. තථාගතප්පවෙදිතස්ස ධම්මවිනයස්ස දෙසිතස්ස විඤ්ඤාතස්ස ධම්මානුධම්මපටිපන්නො පුග්ගලො දුල්ලභො ලොකස්මිං. කතඤ්ඤූ කතවෙදි පුග්ගලො දුල්ලභො ලොකස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙසං ඛො ලිච්ඡවී, පඤ්චන්නං රතනානං පාතුභාවො දුල්ලභො ලොකස්මින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 5. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(තිකණ්ඩකීසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "41. එකං සමයං භගවා **සාකෙතෙ** විහරති **තිකණ්ඩකීවනෙ**.{2} තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි භික්ඛවොති. භදන්තෙති තෙ භික්ඛු භගවතො පච්චස්සොසුං. භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සාධු භික්ඛවෙ භික්ඛු කාලෙන කාලං අප්පටික්කූලෙ පටික්කූලසඤ්ඤී{3} විහරෙය්ය."
                    },
                    {
                        "type": "paragraph",
                        "text": "සාධු භික්ඛවෙ භික්ඛු කාලෙන කාලං පටික්කූලෙ අප්පටික්කූලසඤ්ඤී විහරෙය්ය."
                    },
                    {
                        "type": "paragraph",
                        "text": "සාධු භික්ඛවෙ භික්ඛු කාලෙන කාලං අප්පටික්කූලෙ ච පටික්කූලෙ ච පටික්කූලසඤ්ඤී විහරෙය්ය."
                    },
                    {
                        "type": "paragraph",
                        "text": "සාධු භික්ඛවෙ භික්ඛු කාලෙන කාලං පටික්කූලෙ ච අප්පටික්කූලෙ ච අප්පටික්කූලසඤ්ඤී විහරෙය්ය."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. වත භො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. තිකන්දකීවනෙ - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අප්පටිකුලෙ පටිකුලසඤ්ඤී - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "“ලිච්ඡවීනි, දැන් තෙපි කවර නම් කථායෙකින් යුක්තව රැස්ව හුන්නාව? තොපගේ කවර නම් අතුරුකථායෙක් කොට අඩාළ වී දැ?” යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, මෙහි රැස්ව හුන් අප අතර මෙ නම් අතුරු කථායෙක් උපන: “ලොකයෙහි පඤ්චරත්න කෙනකුන්ගේ පහළවිම දුර්‍ලභ ය. කවර පඤ්චරත්න කෙනකුන්ගේ ය යත්: ලොකයෙහි හස්තිරත්නයාගේ පාළ වනු දුලබ ය. ලොකයෙහි අශ්වරත්නයාගේ පහළ වනු දුලබ ය. ලොකයෙහි මණිරත්නයාගේ පාළ වනු දුලබ ය. ලොකයෙහි ස්ත්‍රීරත්නයාගේ පාළවනු දුබල ය. ලොකයෙහි ගෘහපතිරත්නයාගේ පාළ වනු දුලබ ය. ලොව මෙ පස් රුවනුන්ගේ පාළ වනු දුලබ ය” යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වස්තුකාමක්ලෙශකාමයන්හි අධිමුක්ත (දැඩිසේ ඇලුන) ලිච්ඡවීන් වන තොප අතර කාමයන් අරභයා ම අතුරුකථා උපනේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ලිච්ඡවීනි, ලොවැ පඤ්චරත්න කෙනකුන්ගේ ප්‍රාදුර්‍භාවය දුර්‍ලභ ය. කවර පඤ්චරත්න කෙනකුන්ගේ ය යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ලොවැ තථාගත අර්‍හත් සම්‍යක්සම්බුද්ධයන්ගේ ප්‍රාදුර්‍භාවය දුර්‍ලභ වෙයි. ලොවැ තථාගතප්‍රවිදිත ධර්‍මවිනය දෙසන පුද්ගලයා දුර්‍ලභ වෙයි. ලොවැ තථාගතප්‍රවිදිත වූ දෙශිත ධර්‍මවිනය දැනගන්නා පුද්ගලයා දුර්‍ලභ වෙයි. ලොවැ තථාගතප්‍රවිදිත වූ දෙශිත ධර්‍මවිනය දන්නේ ම ධර්‍මානුධර්‍මය (ලොකොත්තර ධර්‍මප්‍රතිපදාව) අනුව පිළිපන් පුද්ගල දුර්‍ලභ වෙයි. ලොවැ කෘතඥ කෘතවෙදී පුද්ගල දුර්‍ලභ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ලිච්ඡවීනි, ලොවැ මේ පඤ්චරත්නයන්ගේ ප්‍රාදුර්‍භාවය දුර්‍ලභ වේ යයි වදාළසේක.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.5.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තිකණ්ඩකී සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "41. එක් කලෙක භාග්‍යවතුන් වහන්සේ සාකෙත නගරසමීපයෙහි තිකණ්ඩකී වනයෙහි වැඩවසන සේක. එකල්හි භාග්‍යවතුන් වහන්සේ “මහණෙනි”යි මහණුන් ඇමතූ සේක. “වහන්සැ”යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්සූහ. භාග්‍යවතුන් වහන්සේ තෙල කරුණ වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මහණ කලින් කල අප්‍රතිකූල ආලම්බනයෙහි ප්‍රතිකූලසංඥා ඇතිව වාස කරන්නේ නම් මැනැවැ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මහණ කලින් කල ප්‍රතිකූලාලම්බනයෙහි අප්‍රතිකූලසංඥා ඇතිව වෙසේ නම් මැනැවැ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මහණ කලින් කල අප්‍රතිකූලාලම්බනයෙහි දු ප්‍රතිකූලාලම්බනයෙහි දු ප්‍රතිකූලසංඥා ඇතිව වසන්නේ නම් මැනැවැ.‍",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මහණ කලින් කල ප්‍රතිකූලාලම්බනයෙහි දු අප්‍රතිකූලාලම්බනයෙහි දු අප්‍රතිකූලසංඥා ඇතිව වසන්නේ නම් මැනැවැ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 276,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සාධු භික්ඛවෙ භික්ඛු කාලෙන කාලං අප්පටික්කූලං ච පටික්කූලං ච තදුභයං අභිනිවජ්ජෙත්වා උපෙක්ඛකො විහරෙය්ය සතො සම්පජානො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කිඤ්ච භික්ඛවෙ භික්ඛු අත්ථවසං පටිච්ච අප්පටික්කූලෙ පටික්කූලසඤ්ඤී විහරෙය්ය? “මා මෙ රජනීයෙසු ධම්මෙසු රාගො උදපාදී”ති. ඉදං ඛො භික්ඛවෙ භික්ඛු අත්ථවසං පටිච්ච අප්පටික්කූලෙ පටික්කූලසඤ්ඤී විහරෙය්ය."
                    },
                    {
                        "type": "paragraph",
                        "text": "කිඤ්ච භික්ඛවෙ භික්ඛු අත්ථවසං පටිච්ච පටික්කූලෙ අප්පටික්කූලසඤ්ඤී විහරෙය්ය? “මා මෙ දොසනීයෙසු ධම්මෙසු දොසො උදපාදී”ති. ඉදං ඛො භික්ඛවෙ භික්ඛු අත්ථවසං පටිච්ච පටික්කූලෙ අප්පටික්කූලසඤ්ඤී විහරෙය්ය."
                    },
                    {
                        "type": "paragraph",
                        "text": "කිඤ්ච භික්ඛවෙ භික්ඛු අත්ථවසං පටිච්ච අප්පටික්කූලෙ ච පටික්කූලෙ ච පටික්කූලසඤ්ඤී විහරෙය්ය? “මා මෙ රජනීයෙසු ධම්මෙසු රාගො උදපාදී”ති, “මා මෙ දොසනීයෙසු ධම්මෙසු දොසො උදපාදී”ති. ඉදං ඛො භික්ඛවෙ, භික්ඛු අත්ථවසං පටිච්ච අප්පටික්කූලෙ ච පටික්කූලෙ ච පටික්කූලසඤ්ඤී විහරෙය්ය."
                    },
                    {
                        "type": "paragraph",
                        "text": "කිඤ්ච භික්ඛවෙ භික්ඛු අත්ථවසං පටිච්ච පටික්කූලෙ ච අප්පටික්කූලෙ ච අප්පටික්කූලසඤ්ඤී විහරෙය්ය? “මා මෙ දොසනීයෙසු ධම්මෙසු දොසො උදපාදී, මා මෙ රජනීයෙසු ධම්මෙසු රාගො උදපාදී”ති. ඉදං ඛො භික්ඛවෙ, භික්ඛු අත්ථවසං පටිච්ච පටික්කූලෙ ච අප්පටික්කූලෙ ච අප්පටික්කූලසඤ්ඤී විහරෙය්ය."
                    },
                    {
                        "type": "paragraph",
                        "text": "කිඤ්ච භික්ඛවෙ භික්ඛු අත්ථවසං පටිච්ච අප්පටික්කූලං ච පටික්කූලං ච තදුභයං අභිනිවජ්ජෙත්වා උපෙක්ඛකො විහරෙය්ය සතො සම්පජානො? “මා මෙ ක්වචිනි{1} කත්ථචි කිඤ්චන{2} රජනීයෙසු ධම්මෙසු රාගො උදපාදි, මා මෙ ක්විචිනි{1} කත්ථචි කිඤ්චන{2} දොසනීයෙසු ධම්මෙසු දොසො උදපාදි, මා මෙ ක්වචිනි{1} කත්ථචි කිඤ්චන{2} මොහනීයෙසු ධම්මෙසු මොහො උදපාදී”ති. ඉදං ඛො භික්ඛවෙ භික්ඛු අත්ථවසං පටිච්ච අප්පටික්කූලං ච පටික්කූලං ච තදුභයං අභිනිවජ්ජෙත්වා උපක්ඛකො විහරෙය්ය සතො සම්පජානොති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 5. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(නිරයසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "45. පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "පාණාතිපාතී හොති, අදින්නාදායී හොති, කාමෙසු මිච්ඡාචාරී හොති, මුසාවාදී හොති, සුරාමෙරයමජ්ජපමාදට්ඨායී හොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කච්චනි - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. කිඤ්චනං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මහණ කලින් කල අප්‍රතිකූලාලම්බනය හා ප්‍රතිකූලාලම්බනය හා එ දෙක ම දුරලා උපෙක්ෂක වැ ස්මෘතිසම්පන්න වූයේ සම්‍යක්ප්‍රඥා ඇති වැ වසන්නේ නම් මැනැවැ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මහණ කිනම් අර්‍ථයක් පිණිස අප්‍රතිකූලාලම්බනයෙහි ප්‍රතිකූලසංඥා ඇති වැ විහරණ කෙරේ ය යත්: “ඇලුම් කටයුතු දහම්හි මට රාගය නහමක් උපදීව”යි. මහණෙනි, මහණ මෙ අර්‍ථය පිණිස අප්‍රතිකූලාලම්බනයෙහි ප්‍රතිකූලසංඥා ඇති වැ විහරණ කරන්නේය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මහණ කිනම් අර්‍ථයක් පිණිස ප්‍රතිකූලාලම්බනයෙහි අප්‍රතිකූලසංඥා ඇති වැ විහරණ කරන්නේ ය යත්: “ද්වෙෂයට නිසි (ආලම්බන) ධර්‍මයෙහි මට ද්වෙශය නහමක් උපදීව”යි. මහණෙනි, මහණ මේ අර්‍ථය පිණිස ප්‍රතිකූලාලම්බනයෙහි අප්‍රතිකූලසංඥා ඇති වැ විහරණ කරන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මහණ කිනම් අර්‍ථයක් නිසා අප්‍රතිකූල වූ ද ප්‍රතිකූල වූ ද ආලම්බනයෙහි ප්‍රතිකූලසංඥා ඇති වැ විහරණය කරන්නේ ය යත්: “රජනීය ධර්‍මයෙහි මට රාගය නහමක් උපදිව” යි. “ද්වෙෂයට නිසි ධර්‍මයෙහි මට ‍ද්වෙෂය නහමක් උපදීව”යි. මහණෙනි, මහණ මේ අර්‍ථය නිසා අප්‍රතිකූල වූ ද ප්‍රතිකූල වූ ද ආලම්බනයෙහි ප්‍රතිකූලසංඥා ඇති වැ විහරණ කරන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මහණ කිනම් අර්‍ථයක් නිසා ප්‍රතිකූලාලම්බනයෙහි දු අප්‍රතිකූලාලම්බනයෙහි දු අප්‍රතිකූලසංඥා ඇති වැ වසන්නේ ය යත්: “ද්වෙෂ්‍ය ධර්‍මයෙහි මට ද්වෙෂය නහමක් පාළ වේව යි, රජනීය ධර්‍මයෙහි මට රාගය නහමක් පාළ වේව” යි. මහණෙනි, මහණ මේ අර්‍ථය නිසා ප්‍රතිකූලයෙහි දු අප්‍රතිකූලයෙහි දු අප්‍රතිකූලසංඥා ඇති වැ විහරණය කරන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මහණ කිනම් අර්‍ථයක් නිසා අප්‍රතිකූලය හා ප්‍රතිකූලය හා එ දෙක හැරපියා උපෙක්ෂක වැ ස්මෘතිසම්පන්න වැ නුවණැති වැ විහරණ කරන්නේය යත්: මහණෙනි, “මට කිසිදු අරමුණෙක්හි කොතන්හි දු රජනීයධර්‍මයෙහි ස්වල්පමාත්‍ර වූ ද රාගයෙක් නහමක් උපදීවා, මට කිසිදු අරමුණෙක්හි කොතැනෙක දී හෝ ද්වෙෂ්‍ය ධර්‍මයන්හි ස්වල්පමාත්‍ර වූ ද ද්වෙෂයෙක් නහමක් උපදීවා, මට කිසිදු අරමුණෙක්හි කොතැනෙක දී හෝ මොහනීයධර්‍මයෙහි ස්වල්පමාත්‍ර වූ ද මොහයෙක් නහමක් උපදීවා” යි. මේ අර්‍ථය නිසා මහණ අප්‍රතිකූලය ද ප්‍රතිකූලය ද යන එ දෙක ම හැරපියා ස්මෘතිසම්පන්න ව සම්‍යක්ප්‍රඥා ඇති ව උපෙක්ෂක ව විහරණ කරන්නේය”යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.5.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නිරය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "45. මහණෙනි, ධර්‍ම පසෙකින් සමන්වාගත වූයේ ගෙණවුත් බහා තැබුවකු සෙයින් නිරයෙහි උපදනේ යැ. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "පණිවා කරන්නේ වෙයි. අයිනාදන් ගන්නේ වෙයි. කාමයෙහි මිසහසර ඇතියේ වෙයි.\tමුසවා බණන සුලු වෙයි. මදපමා දෙකට කරුණු වූ රහමෙර බොන සුලු වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 278,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං නිරයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙ. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "පාණාතිපාතා පටිවිරතො හොති, අදින්නාදානා පටිවිරතො හොති, කාමෙසු මිච්ඡාචාරා පටිවිරතො හොති, මුසාවාදා පටිවිරතො හොති, සුරාමෙරයමජ්ජපමාදට්ඨානා පටිවිරතො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො යථාභතං නික්ඛිත්තො එවං සග්ගෙ."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 5. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(භික්ඛුමිත්ත සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "46. පඤ්චහි භික්ඛවෙ ධම්මමෙහි සමන්නාගතො භික්ඛුමිත්තො න සෙවිතබ්බො. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කම්මන්තං කාරෙති, අධිකරණං අධිකරණං ආදියති, පාමොක්ඛෙසු භික්ඛූසු පටිවිරුද්ධො හොති, දීඝචාරිකං අනවත්ථිතචාරිකං{1} අනුයුත්තො විහරති, න පටිබලො හොති කාලෙන කාලං ධම්මියා කථාය සන්දස්සෙතුං සමාදපෙතුං සමුත්තෙජෙතුං සම්පහංසෙතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛුමිත්තො න සෙවිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො භික්ඛුමිත්තො, සෙවිතබ්බො. කතමෙහි පඤ්චහි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "න කම්මන්තං කාරෙති, න අධිකරණං ආදියති, න පාමොක්ඛෙසු භික්ඛුසු පටිවිරුද්ධො හොති, න දීඝචාරිකං අනවත්ථිතචාරිකං අනුයුත්තො විහරති, පටිබලො හොති කාලෙන කාලං ධම්මියා කථාය සන්දස්සෙතුං සමාදපෙතුං සමුත්තෙජෙතුං සම්පහංසෙතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො භික්ඛුමිත්තො සෙවිතබ්බොති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 5. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(අසප්පුරිසදානසුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "47. පඤ්චිමානි භික්ඛවෙ අසප්පුරිසදානානි. කතමානි පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අසක්කච්චං දෙති, අචිත්තීකත්වා දෙති, අසහත්ථා දෙති, අපවිද්ධං දෙති, අනාගමනදිට්ඨිකො දෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ පඤ්ච අසප්පුරිසදානානි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අනවත්ථචාරිකං - මඡසං, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මෙ ධර්‍ම පසින් සමන්වාගත වූයේ ගෙණවුත් බහා තැබුවකු සෙයින් නිරයෙහි උපදනේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ධර්‍ම පසෙකින් සමන්වාගත වූයේ ගෙණවුත් බහා තැබුවකු හෙයින් ස්වර්‍ගයෙහි උපදනේ යැ. කවර පසෙකින යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "පණිවායෙන් වැළකියේ වෙයි. අයිනාදන් ගැණුමින් වැළකියේ වෙයි. කාමයෙහි මිසහසරින් වැළකියේ වෙයි. මුසාවායෙන් වැළකියේ වෙයි. මදපමා දෙකට කරුණු වූ රහමෙරින් වැළකියේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසින් සමන්වාගත වූයේ ගෙණවුත් බහා තැබුවකු සෙයින් ස්වර්‍ගයෙහි උපදනේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.5.6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භික්ඛුමිත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "46. මහණෙනි, ධර්‍ම පසෙකින් සමන්වාගත භික්ෂුමිත්‍ර නො සෙවිය යුත්තේ ය. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "කර්‍මාන්ත කරවන්නේ ය. අධිකරණ ගන්නේ ය. දිසාපාමොක් මහණුන් කෙරෙහි විරුද්ධ වන්නේ ය. දීර්‍ඝචාරිකායෙහි, ව්‍යවස්ථා රහිත (යදෘච්ඡා) චාරිකායෙහි යෙදී වසන්නේ ය. කලින් කල ධාර්මික කථායෙන් කරුණු දක්වන්නට සමාදන් කරවන්නට සමු‍ත්තෙජනය (උත්සාහවත්) කරවන්නට සම්ප්‍රහර්‍ෂණය කරවන්නට ප්‍රතිබල නො වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසින් සමන්වාගත භික්ෂුමිත්‍ර නො සෙවිය යුත්තේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කරුණු පසෙකින් සමන්වාගත භික්ෂුමිත්‍ර සෙවිය යුත්තේ ය. කවර පසෙකින් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "කර්‍මාන්ත නොකරවන්නේ ය. අධිකරණ නොගන්නේ ය. දිසාපාමොක් මහණුන් කෙරෙහි ප්‍රතිවිරුද්ධ නොවන්නේ ය. දීර්‍ඝචාරිකායෙහිත් යදාච්ඡාරිකායෙහිත් නොයෙදී වසන්නේ ය. කලින් කල දැහැමි කථායෙන් සන්දර්‍ශනය කරවන්නට සමාදන් කරවන්නට සමුත්තෙජන කරවන්නට සම්ප්‍රහර්ෂණ කරවන්නට ප්‍රතිබල වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ කරුණු පසින් සමන්වාගත භික්ෂුමිත්‍ර සෙවිය යුත්තේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.5.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අසප්පුරිස දාන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "47. මහණෙනි, මේ අසත්පුරුෂදාන පසෙකි. කවර පසෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නො සකසා දෙයි. (ගෞරවයෙන්) සලකා නො දෙයි. සියතින් නො දෙයි. පටිවිද්ධයක් (ඉවත ලන්නක්) සෙයින් දෙයි හෝ නිතර නො දෙයි. අනාගමනදෘෂ්ටික (කර්‍මඵලවිපාක ඇදැහීම නැති) ව දෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ පස අසත්පුරුෂදාන යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 280,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පඤ්චිමානි භික්ඛවෙ සප්පුරිසදානානි. කතමානි පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සක්කච්චං දෙති, චිත්තීකත්වා දෙති, සහත්ථා දෙති, අනපවිද්ධං දෙති, ආගමනදිට්ඨිකො දෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ පඤ්ච සප්පුරිසදානානීති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 5. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(සප්පුරිසදාන සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "48. පඤ්චිමානි භික්ඛවෙ සප්පුරිසදානානි. කතමානි පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සද්ධාය දානං දෙති, සක්කච්චං දානං දෙති, කාලෙන දානං දෙති, අනග්ගහිතචිත්තො{1} දානං දෙති, අත්තානං ච පරං ච අනුපභච්ච දානං දෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සද්ධාය ඛො පන භික්ඛවෙ දානං දත්වා යත්ථ යත්ථ තස්ස දානස්ස විපාකො නිබ්බත්තති, අඩ්ඪො ච හොති මහද්ධනො මහාභොගො. අභිරූපො ච හොති දස්සනීයො පාසාදිකො පරමාය වණ්ණපොක්ඛරතාය සමන්නාගතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "සක්කච්චං ඛො පන භික්ඛවෙ දානං දත්වා යත්ථ යත්ථ තස්ස දානස්ස විපාකො නිබ්බත්තති, අඩ්ඪො ච හොති මහද්ධනො මහාභොගො. යෙපිස්ස තෙ හොන්ති පුත්තාති වා දාරාති වා දාසාති වා පෙස්සාති වා කම්මකරාති වා, තෙපි සුස්සූසන්ති, සොතං ඔදහන්ති, අඤ්ඤා චිත්තං උපට්ඨපෙන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කාලෙන ඛො පන භික්ඛවෙ දානං දත්වා යත්ථ යත්ථ තස්ස දානස්ස විපාකො නිබ්බත්තති, අඩ්ඪො ච හොති මහද්ධනො මහාභොගො. කාලාගතා චස්ස අත්ථා පචුරා හොන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අනග්ගහිතචිත්තො ඛො{1} පන භික්ඛවෙ දානං දත්වා යත්ථ යත්ථ තස්ස දානස්ස විපාකො නිබ්බත්තති, අඩ්ඪො ච හොති මහද්ධනො මහාභොගො. උළාරෙසු ච පඤ්චසු කාමගුණෙසු භොගාය චිත්තං නමති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තානඤ්ච පරඤ්ච අනුපහච්ච ඛො පන භික්ඛවෙ දානං දත්වා යත්ථ යත්ථ තස්ස දානස්ස විපාකො නිබ්බත්තති, අඩ්ඪො ච හොති මහද්ධනො මහාභොගො. න චස්ස කුතොචි භොගානං උපඝාතො ආගච්ඡති අග්ගිතො වා උදකතො වා රාජතො වා චොරතො වා අප්පියදායාදතො වා.{3}"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො භික්ඛවෙ පඤ්ච සප්පුරිසදානානීති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 5. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(පඨම සමයවිමුත්ත සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "49. පඤ්චිමෙ භික්ඛවෙ ධම්මා සමයවිමුත්තස්ස භික්ඛුනො පරිහානාය සංවත්තන්ති. කතමෙ පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කම්මාරාමතා, භස්සාරාමතා, නිද්දාරාමතා, සඞ්ගණිකාරාමතා, යථාවිමුත්තං චිත්තං න පච්චවෙක්ඛති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අනග්ගතචිත්තො - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අප්පියතො වා දායාදතො - මඡසං. අප්පියතො වා දායාදතො වා - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මේ සත්පුරුෂදාන පසෙකි. කවර පසෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "සකසා දෙයි. ගරු කොට දෙයි. සියතින් දෙයි. නිරතුරු කොට දෙයි. ආගමනදෘෂ්ටි ඇති ව දෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සත්පුරුෂදාන පස යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.5.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සප්පුරිස දාන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "48. මහණෙනි, මෙ සත්පුරුෂදාන පසෙකි. කවර පසෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ශ්‍රද්ධායෙන් දන් දෙයි. සකසා දන් දෙයි. නිසි කල්හි දන් දෙයි. දෙන දැයෙහි සිත් බැඳුම් නැතිව (මුත්තචාගීව) දන් දෙයි. තමා ද මෙරමා ද නො පෙළා (ගුණ නොමකා) දන් දෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සැදැහැයෙන් දන් දී යම් යම් ම තැනෙක එ දානයාගේ විපාක උපදනේ නම්, මහාධන ඇතියේ මහාභොග ඇතියේ ආඨ්‍ය ද වෙයි. උතුම් වර්‍ණ‍සෞන්දර්‍ය්‍යයෙන් යුක්ත වූයේ දැකුම්කලු වූයේ පහන් එළවන සුලුයේ අභිරූප ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සකසා දන් දීම යම් යම් ම තැනෙක ඒ දානයාගේ විපාක උපදනේ නම්, මහද්ධන ඇතියේ මහාභොග ඇතියේ ආඨ්‍ය ද වෙයි. පුත්‍රයෝ වෙත්ව යි, අඹුහු වෙත්ව යි, දාසයෝ වෙත්ව යි, කම්කරුහු වෙත්ව යි, ඔහට යම් (පිරිවර) කෙනෙක් වෙත් නම්, ඔහු ද ශුශ්‍රෑෂා කෙරෙති (කීකරු වෙති). කන් යොමු කෙරෙති. දැනුම් සඳහා සිත් එළවත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, නිසි කල්හි දන් දී යම් යම් ම තැනෙක ඒ දානයාගේ විපාක උපදනේ නම්, මහද්ධන මහාභොග වූයේ ආඨ්‍ය ද වෙයි. නිසි කල්හි ලත් ඔහුගේ අර්‍ථයෝ ප්‍රචුර වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, දෙන දැයෙහි නොබැඳසිත් ඇති ව දන් දී යම් යම් ම තැනෙක ඒ දානයාගේ විපාක උපදනේ නම්, මහද්ධන මහාභොග වූයේ ආඨ්‍ය ද වෙයි. උදාර වූ පස්කම්ගුණ වළඳ කරුණු සඳහා සිත් නැමෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, තමා හා මෙරමා නො ඝටා දන් දී යම් යම් ම තැනෙක ඒ දානයාගේ විපාකය උපදනේ නම්, මහද්ධන මහාභොග ඇතියේ ආඨ්‍ය ද වෙයි. ගින්නෙන් වේවයි, දියෙන් වේවයි, රජුන්ගෙන් වේවයි, සොරුන්ගෙන් වේවයි, අප්‍රිය දායාදයන්ගෙන් (තමන්ට අප්‍රියවූවන්ගෙන්) වේවයි, කිසිවක්හුගෙන් ඔහට භොගයන්ගේ උපඝාතයෙක් නො එයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ සත්පුරුෂදාන පස යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.5.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පළමුවැනි සමයවිමුත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]‍",
                        "type": "unindented"
                    },
                    {
                        "text": "49. මහණෙනි, සමයවිමුක්ත (ඒ ඒ ක්ෂණයෙහි විෂ්කම්භනවශයෙන් ලෞකිකවිමුක්තියෙන් විමුක්ත සිත් ඇති) මහණුහුගේ පරිහානිය සඳහා මෙ ධර්‍මයෝ පස්දෙනෙක් විද්‍යාමාන වන්නාහ. කවර පස්දෙනෙක් යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "කර්‍මාරාමතා ය, භාෂ්‍යාරාමතා ය, නිද්‍රාරාමතා ය, සඞ්ගණිකාරාමතා ය, යථාවිමුක්තචිත්තය ප්‍රත්‍යවෙක්ෂා නොකරන්නේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 282,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ පඤ්ච ධම්මා සමයවිමුත්තස්ස භික්ඛුනො පරිහානාය සංවත්තන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චිමෙ භික්ඛවෙ ධම්මා සමයවිමුත්තස්ස භික්ඛුනො අපරිහානාය සංවත්තන්ති. කතමෙ පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "න කම්මාරාමතා, න භස්සාරාමතා, න නිද්දාරාමතා, න සඞ්ගණිකාරාමතා, යථාවිමුත්තං චිත්තං පච්චවෙක්ඛති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ පඤ්ච ධම්මා සමයවිමුත්තස්ස භික්ඛුනො අපරිහානාය සංවත්තන්තීති."
                    },
                    {
                        "type": "centered",
                        "text": "5. 3. 5. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "(දුතියසමයවිමුත්ත සුත්තං)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**(සාවත්ථිනිදානං)**"
                    },
                    {
                        "type": "paragraph",
                        "text": "50. පඤ්චිමෙ භික්ඛවෙ ධම්මා සමයවිමුත්තස්ස භික්ඛුනො පරිහානාය සංවත්තන්ති. කතමෙ පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කම්මාරාමතා, භස්සාරාමතා, නිද්දාරාමතා, ඉන්ද්රියෙසු අගුත්තද්වාරතා, භොජනෙ අමත්තඤ්ඤුතා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ පඤ්ච ධම්මා සමයවිමුත්තස්ස භික්ඛුනො පරිහානාය සංවත්තන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චිමෙ භික්ඛවෙ ධම්මා සමයවිමුත්තස්ස භික්ඛුනො අපරිහානාය සංවත්තන්ති. කතමෙ පඤ්ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "න කම්මාරාමතා, න භස්සාරාමතා, න නිද්දාරාමතා, ඉන්ද්රියෙසු ගුත්තද්වාරතා, භොජනෙ මත්තඤ්ඤුතා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භික්ඛවෙ පඤ්ච ධම්මා සමයවිමුත්තස්ස භික්ඛුනො අපරිහානාය සංවත්තන්තීති."
                    },
                    {
                        "type": "centered",
                        "text": "තිකණඩකීවග්ගො පඤ්චමො",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තස්සුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "දත්වා අවජානාති ආරම්භති ච සාරන්දද තිකණ්ඩකී නිරයෙන ච.\nමිත්තො අසප්පුරිසසප්පුරිසෙන සමයවිමුත්තං අපරෙ ද්වෙති.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "තතියො පණ්ණාසකො සමත්තො.",
                        "level": 2
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මෙ පඤව ධර්‍මයෝ සමයවිමුක්ත මහණහුගේ පිරිහීම පිණිස පවතිත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පඤ්චධර්‍මයෝ සමයවිමුක්ත මහණහුගේ අපරිහානිය පිණිස පවත්නාහ. කවර පස්දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නවකර්‍මාන්තයෙහි නො ඇලිම ය, කථායෙහි නො ඇලිම යි, නිද්‍රායෙහි නො ඇලීම ය, සමූහයන් කෙරෙහි නො ඇලීම ය, යථාවිමුක්තචිත්තය (ඒ ඒ කෙලෙස් යටපත් වීමෙන් සිත මිදුනු අයුරු) ප්‍රත්‍යවෙක්ෂා කරන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පඤ්‍චධර්‍මයෝ සමයවිමුක්ත මහණහුගේ අපරිහානිය පිණිස පවත්නාහ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "5.3.5.10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දෙවැනි සමයවිමුත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "[සැවැත්නිදානයි]",
                        "type": "unindented"
                    },
                    {
                        "text": "50. මහණෙනි, මේ පඤ්චධර්‍ම කෙනෙක් සමයවිමුක්ත භික්ෂුහුගේ පරිහානිය සඳහා පවත්නාහ. කවර පසෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "කම්මාරාමතා ය, භස්සාරාමතා ය, නිද්දාරාමතා ය, ඉන්ද්‍රියයන්හි අගුත්තද්වාරතා ය, භොජනයෙහි අමත්තඤ්ඤූතා යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ පඤ්චධර්‍මයෝ සමයවිමුක්ත මහණහුගේ පරිහානිය සඳහා වැටෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මේ ධර්‍මයෝ පස් දෙන සමයවිමුක්ත මහණහුගේ අපරිහානිය සඳහා පවත්නාහ. කවර පස්දෙනෙක යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නවකම්හි නො ඇල්ම ය, කථායෙහි නො ඇල්ම ය, නිද්‍රායෙහි නො ඇල්ම ය, ඉන්ද්‍රියයන්හි ගුප්තද්වාරතා ය (සංවරය), භොජනයෙහි මාත්‍රඥතා යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙ ධර්‍ම‍යෝ පස්දෙන සමයවිමුක්ත මහණහුගේ අපරිහානිය සඳහා වැටෙත් ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තිකණ්ඩකිවර්‍ගය පස්වැනි යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "එහි උද්දානය:",
                        "type": "unindented"
                    },
                    {
                        "text": "අවජානාති සූත්‍රය, ආරම්භති{*} සූත්‍රය, සාරන්දද සූත්‍රය, තිකණ්ඩකී සූත්‍රය, නිරය සූත්‍රය, මිත්ත සූත්‍රය, අසප්පුරිසදාන සූත්‍රය, සප්පුරිසදාන සූත්‍රය, පඨමසමයවිමුත්ත සූත්‍රය, දුතියසමයවිමුත්ත සූත්‍රය දැයි දශයෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙවන පණ්ණාසකය සමාප්ත යි.",
                        "type": "centered",
                        "level": 2
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "*. ආපත්තිව්‍යති ක්‍රම - අර්‍ථ හෙයින් “ආරම්භති” යනු ශුඬපඨයි. “ආරභති” යනු පාඨාන්තරයි."
                    }
                ]
            }
        }
    ]
}