{
    "filename": "ap-pat-2-83",
    "pages": [
        {
            "pageNum": 1137,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "අභිධම්මපිටකෙ",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "පට්ඨානප්පකරණං",
                        "level": 5
                    },
                    {
                        "type": "centered",
                        "text": "තතියො භාගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "නමො තස්ස භගවතො අරහතො සම්මාසම්බුද්ධස්ස",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "2. දුක පට්ඨානං",
                        "level": 4
                    },
                    {
                        "type": "heading",
                        "text": "93. කාමාවචර දුකං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "කාමාවචරං ධම්මං පටිච්ච කාමාවචරො ධම්මො උප්පජ්ජති හෙතුපච්චයා, කාමාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච රූපං, පටිසන්ධි-. එකං මහාභූතං, (සංඛිත්තං) කාමාවචරං ධම්මං පටිච්ච කාමාවචරො-. හෙතුපච්චයා-. පටිසන්ධික්ඛණෙ වත්ථුං-. පටිච්ච න කාමාවචරා ඛන්ධා, කාමාවචරං ධම්මං පටිච්ච කාමාවචරො ච න කාමාවචරො ච-. හෙතුපච්චයා, පටිසන්ධික්ඛණෙ වත්ථුං පටිච්ච න කාමාවචරා ඛන්ධා, මහාභූතෙ පටිච්ච කටත්තාරූපං, න කාමාවචරං ධම්මං පටිච්ච න කාමාවචරො-. හෙතුපච්චයා. න කාමාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. පටිසන්ධික්ඛණෙ-. න කාමාවචරං ධම්මං පටිච්ච කාමාවචරො-. හෙතුපච්චයා, න කාමාවචරෙ ඛන්ධෙ පටිච්ච චිත්තසමුට්ඨානං-. පටිසන්ධික්ඛණෙ, න කාමාවචරෙ ඛන්ධෙ පටිච්ච කටත්තා-. න කාමාවචරං ධම්මං"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1138,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පටිච්ච කාමාවචරො ච න කාමාවචරො ච ධම්මා-. හෙතු-. න කාමාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච-. ද්වෙ-. පටිසන්ධි-. කාමාවචරඤ්ච න කාමාවචරඤ්ච ධම්මං පටිච්ච කාමාවචරො ධම්මො-. හෙතුපච්චයා. න කාමාචරෙ ඛන්ධෙ ච මහාභූතෙ ච පටිච්ච චිත්තසමුට්ඨානං-. පටිසන්ධික්ඛණෙ, න කාමාවචරෙ ඛන්ධෙ ච මහාභූතෙ ච පටිච්ච කටත්තා-. කාමාවචරඤ්ච න කාමාවචරඤ්ච ධම්මං පටිච්ච න කාමාවචරො-. හෙතුපච්චයා, පටිසන්ධික්ඛණෙ, න කාමාවචරං එකං ඛන්ධඤ්ච වත්ථුං ච පටිච්ච තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. කාමාවචරඤ්ච න කාමාවචරඤ්ච ධම්මං පටිච්ච කාමාවචරො ච න කාමාවචරො ච ධම්මා-. හෙතු-. පටිසන්ධික්ඛණෙ, න කාමාවචරං එකං ඛන්ධඤ්ච වත්ථුං ච පටිච්ච තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. න කාමාවචරෙ ඛන්ධෙ ච මහාභූතෙ ච පටිච්ච කටත්තා, (සංඛිත්තං.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "හෙතුයා නව, ආරම්මණෙ චත්තාරි, අධිපතියා පඤ්ච, අනන්තරෙ චත්තාරි, සමනන්තරෙ චත්තාරි, සහජාතෙ නව, අඤ්ඤමඤ්ඤෙ ඡ, නිස්සයෙ නව, උපනිස්සයෙ චත්තාරි, පුරෙජාතෙ ද්වෙ, ආසෙවනෙ ද්වෙ, කම්මෙ නව, විපාකෙ නව, ආහාරෙ නව, ඉන්ද්රියෙ නව, ඣානෙ නව, මග්ගෙ නව, සම්පයුත්තෙ චත්තාරි, විප්පයුත්තෙ නව, අත්ථියා නව, නත්ථියා චත්තාරි, විගතෙ චත්තාරි, අවිගතෙ නව."
                    },
                    {
                        "type": "paragraph",
                        "text": "කාමාවචරං ධම්මං පටිච්ච කාමාවචරො ධම්මො උප්පජ්ජති න හෙතුපච්චයා, අහෙතුං කාමාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච- ද්වෙ ඛන්ධෙ-. අහෙතුකපටිසන්ධි-. යාව අසඤ්ඤසත්තා. විචිකිච්ඡාසහගතෙ උද්ධච්චසහගතෙ ඛන්ධෙ පටිච්ච විචිකිච්ඡා-. උද්ධච්ච-. මොහො. නාරම්මණපච්චයා, තීණි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කාමාවචරං ධම්මං-. කාමාවචරො ධම්මො-. නාධිපති-. තීණි න කාමාවචරං ධම්මං-. න කාමාවචරො ධම්මො-. නාධිපති-. තීණි. න කාමාවචරෙ ඛන්ධෙ පටිච්ච න කාමාවචරාධිපති විපාකං-. න කාමාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, ද්වෙ-. පටිසන්ධි-. න කාමාවචරං ධම්මං-. කාමාවචරො-. නාධිපති-. විපාකෙ න කාමාවචරෙ ඛන්ධෙ පටිච්ච චිත්තසමුට්ඨානං- පටිසන්ධි- න කාමාවචරං ධම්මං-. කාමාවචරො ච න කාමාවචරො ච-. නාධිපති-. විපාකං න කාමාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච-. ද්වෙ-. පටිසන්ධි-. කාමාවචරඤ්ච න කාමාවචරඤ්ච-. කාමාවචරො-. නාධිපති-. විපාකෙ න කාමාවචරෙ ඛන්ධෙ ච"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1139,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "මහාභූතෙ ච පටිච්ච චිත්තසමුට්ඨානං-. පටිසන්ධි-. (ඉතරෙ ද්වෙ පාකතිකා,) නානන්තරපච්චයා, න පුරෙජාතපච්චයා, න පච්ඡාජාතපච්චයා."
                    },
                    {
                        "type": "paragraph",
                        "text": "කාමාවචරං ධම්මං- කාමාවචරො ධම්මො- නාසෙවනපච්චයා, තීණි. න කාමාවචරං-. න කාමාවචරො-. නාසෙවනපච්චයා, විපාකං න කාමාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, ද්වෙ- පටිසන්ධි-. න කාමාවචරං-. කාමාවචරො-. නාසෙවන-. න කාමාවචරෙ ඛන්ධෙ පටිච්ච චිත්තසමුට්ඨානං-. පටිසන්ධි-. (මූලං-.) විපාකං න කාමාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානං-. ද්වෙ-. පටිසන්ධි-. (අවසෙසා තීණි පාකතිකා. සංඛිත්තං.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "න හෙතුයා එකං, නාරම්මණෙ තීණි, නාධිපතියා නව, නානන්තරෙ තීණි, න සමනන්තරෙ තීණි, න උපනිස්සයෙ තීණි, න පුරෙජාතෙ නව, න පච්ඡාජාතෙ නව, නාසෙවනෙ නව, න කම්මෙ ද්වෙ, න විපාකෙ පඤ්ච, නාහාරෙ එකං, න ඉන්ද්රියෙ එකං, න ඣානෙ එකං, න මග්ගෙ එකං, න සම්පයුත්තෙ තීණි, න විප්පයුත්තෙ ද්වෙ, නො නත්ථියා තීණි, නො විගතෙ තීණි, (අවසෙසා ගණනාපි සහජාතවාරෙපි කාතබ්බො.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "කාමාවචරං ධම්මං පච්චයා කාමාවචරො ධම්මො උප්පජ්ජති හෙතුපච්චයා, කාමාවචරං එකං ඛන්ධං පච්චයා තයො ඛන්ධා චිත්තසමුට්ඨා-. ද්වෙ-. පටිසන්ධි-. (යාව අජ්ඣත්තිකා මහාභූතා,) වත්ථුං පච්චයා කාමාවචරා ඛන්ධා, කාමාවචරං ධම්මං පච්චයා න කාමාවචරො-. හෙතුපච්චයා, වත්ථුං පච්චයා න කාමාවචරා ඛන්ධා, පටිසන්ධි-. කාමාවචරං-. කාමාවචරො ච න කාමාවචරො ච- හෙතුපච්චයා, වත්ථුං පච්චයා න කාමාවචරා ඛන්ධා, මහාභූතෙ පච්චයා චිත්තසමුට්ඨානං-. පටිසන්ධි-. න කාමාවචරං ධම්මං පච්චයා න කාමාචවරො ධම්මො-. හෙතුපච්චයා, තීණි (පටිච්ච සදිසා) කාමාවචරඤ්ච න කාමාවචරඤ්ච ධම්මං-. කාමාවචරො-. හෙතු-. (පටිච්චසදිසා,) කාමාවචරඤ්ච න කාමාවචරඤ්ච-. න කාමාවචරො-. හෙතුපච්චයා, න කාමාවචරං එකං ඛන්ධඤ්ච වත්ථුං ච පච්චයා තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. පටිසන්ධි-. කාමාවචරඤ්ච න කාමාවචරඤ්ච ධම්මං පච්චයා කාමාවචරො ච න කාමාවචරො ච- හෙතුපච්චයා, න කාමාවචරං එකං ඛන්ධඤ්ච වත්ථුං ච පච්චයා තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. න කාමාවචරෙ ඛන්ධෙ ච මහාභූතෙ ච පච්චයා චිත්තසමුට්ඨානං-. පටිසන්ධි-. (සංඛිත්තං.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "හෙතුයා නව, ආරම්මණෙ චත්තාරි, අධිපතියා නව, අනන්තරෙ චත්තාරි, සමනන්තරෙ චත්තාරි, සහජාතෙ නව. අඤ්ඤමඤ්ඤෙ නව, නිස්සයෙ නව, උපනිස්සයෙ චත්තාරි, පුරෙජාතෙ චත්තාරි, ආසෙවනෙ චත්තාරි, කම්මෙ නව, අවිගතෙ නව."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1140,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කාමාවචරං ධම්මං පච්චයා කාමාවචරො ධම්මො- න හෙතුපච්චයා, අහෙතුකං කාමාවචරං එකං ඛන්ධං පච්චයා-. චක්ඛුවිඤ්ඤාණං කායාය-. වත්ථු පච්චයා අහෙතුකා කාමාවචරා ඛන්ධා-. විචිකිච්ඡා සහගතෙ උද්ධච්චසහගතෙ ඛන්ධෙ ච වත්ථුං ච පච්චයා විචිකිච්ඡා-. උද්ධච්ච-. මොහො. -පෙ- නාරම්මණපච්චයා, කාමාවචරං ධම්මං-. කාමාවචරො-. නාධිපති-. එකං. (යාව අසඤ්ඤසත්තා.) කාමාවචරං ධම්මං-. න කාමාවචරො-. නාධිපති-. වත්ථුං පච්චයා න කාමාවචරාධිපති-. වත්ථුං පච්චයා විපාකා න කාමාවචරා ඛන්ධා, පටිසන්ධි-. කාමාවචරං-. කාමාවචරො ච න කාමාවචරො ච-. නාධිපති-. වත්ථුං පච්චයා විපාකා න කාමාවචරා ඛන්ධා, මහාභූතෙ පච්චයා චිත්තසමුට්ඨානං-. පටිසන්ධි-. න කාමාවචරං-. න කාමාවචරො-. නාධිපති-. තීණි. (පටිච්චසදිසා) කාමාවචරඤ්ච න කාමාවචරඤ්ච ධම්මං-. කාමාවචරො-. නාධිපති-. (පටිච්ච සදිසා.) මූලං-. න කාමාවචරෙ ඛන්ධෙ ච වත්ථුං ච පච්චයා න කාමාවචරාධිපති-. විපාකං න කාමාවචරං එකං ඛන්ධඤ්ච වත්ථුං ච පච්චයා තයො ඛන්ධා, ද්වෙ-. පටිසන්ධික්ඛණෙ-. විපාකං කාමාවචරං එකං ඛන්ධඤ්ච වත්ථුං ච පච්චයා තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. විපාකෙ න කාමාවචරෙ ඛන්ධෙ ච මහාභූතෙ ච පච්චයා චිත්තසමුට්ඨානං-. පටිසන්ධි-. න උපනිස්සයෙ තීණි, න ආසෙවනපච්චයා, (සුද්ධකෙ, අරූපමිස්සකෙ ච, විපාකන්ති නියාමෙතබ්බං රූපමිස්සකෙ නත්ථි.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "න හෙතුයා එකං, නාරම්මණෙ තීණි, නාධිපතියා නව, නානන්තරෙ තීණි, න සමනන්තරෙ තීණි, න උපනිස්සයෙ තීණි, න පුරෙජාතෙ නව, න පච්ඡාජාතෙ නව, න ආසෙවනෙ නව, න කම්මෙ චත්තාරි, න විපාකෙ නව, නාහාරෙ එකං, න ඉන්ද්රියෙ එකං, න ඣානෙ එකං, න මග්ගෙ එකං, න සම්පයුත්තෙ තීණි, න විප්පයුත්තෙ ද්වෙ, නො නත්ථියා තීණි, නො විගතෙ තීණි, න (එවං ඉතරෙ ද්වෙ ගණනාපි නිස්සයවාරොපි කාතබ්බො.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "කාමාවචරං ධම්මං සංසට්ඨො කාමාවචරො ධම්මො උප්පජ්ජති හෙතු-. කාමාවචරං එකං ඛන්ධං සංසට්ඨා තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. පටිසන්ධි-. න කාමාවචරං ධම්මං සංසට්ඨො න කාමාවචරො-. හෙතුපච්චයා. න කාමාවචරං එකං ඛන්ධං සංසට්ඨා තයො ඛන්ධා, ද්වෙ-. පටිසන්ධි-. හෙතුයා ද්වෙ. ආරම්මණෙ ද්වෙ, අධිපතියා ද්වෙ, සබ්බත්ථ ද්වෙ, අවිගතෙ ද්වෙ, කාමාවචරං ධම්මං සංසට්ඨො කාමාවචරො-. න හෙතුපච්චයා, අහෙතුකං කාමාවචරං එකං ඛන්ධං සංසට්ඨා තයො"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1141,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඛන්ධා, ද්වෙ ඛන්ධෙ-. අහෙතුකපටිසන්ධි-. විචිකිච්ඡාසහගතෙ උද්ධච්චසහගතෙ ඛන්ධෙ සංසට්ඨො විචිකිච්ඡා-. උද්ධච්ච-. මොහො. න හෙතුයා එකං, නාධිපතියා ද්වෙ, න පුරෙජාතෙ ද්වෙ, න පච්ඡාජාතෙ නව, නාසෙවනෙ ද්වෙ, න කම්මෙ ද්වෙ, න විපාකෙ ද්වෙ, න ඣානෙ එකං, න මග්ගෙ එකං, න විප්පයුත්තෙ ද්වෙ, (එවං ඉතරෙ ද්වෙ ගණනාපි සම්පයුත්තවාරොපි කාතබ්බො.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "කාමාවචාරො ධම්මො කාමාවචරස්ස ධම්මස්ස හෙතුපච්චයා, කාමාවචරා හෙතු සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච රූපානං හෙතුපච්චයා, පටිසන්ධි-. න කාමාවචරො න කාමාවචරස්ස හෙතුපච්චයා, න කාමාවචරා හෙතු සම්පයුත්තකානං ඛන්ධානං හෙතුපච්චයා, පටිසන්ධි-. න කාමාවචරො කාමාවචරස්ස හෙතුපච්චයෙන පච්චයො, න කාමාවචරා හෙතු චිත්තසමුට්ඨානානං රූපානං හෙතුපච්චයා, පටිසන්ධි-. (මූලං-.) න කාමාවචරා හෙතුසම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානඤ්ච රූපානං හෙතුපච්චයා, පටිසන්ධි-."
                    },
                    {
                        "type": "paragraph",
                        "text": "කාමාවචරො ධම්මො කාමාවචරස්ස ධම්මස්ස ආරම්මණපච්චයා, දානං දත්වා, සීලං-. උපොසථකම්මං-. පුබ්බෙ සුචිණ්ණානි පච්චවෙක්ඛති, අස්සාදෙති, අභි-. තං ආරබ්භ රාගො-. දොමනස්සං උප්පජ්ජති, අරියා ගොත්රභුං පච්ච-. වොදානං පච්ච-. පහීනෙ කිලෙසෙ-. වික්ඛම්භිතෙ-. පුබ්බෙසු-. ඣානා-. චක්ඛුං, වත්ථුං, කාමාවචරෙ ඛන්ධෙ අනිච්චතො-. දොමනස්සං උප්පජ්ජති, රූපායතනං චක්ඛුවිඤ්ඤාණස්ස, ඵොට්ඨබ්බායතනං-. කාමාවචරො ධම්මො න කාමාවචරස්ස ආරම්මණ-. දිබ්බෙන චක්ඛුනා රූපං පස්සති. දිබ්බාය සොතධාතුයා සද්දං සුණාති, චෙතොපරියඤාණෙ කාමාවචරචිත්තසමඞ්ගිස්ස-. කාමාවචරා ඛන්ධා ඉද්ධි-. චෙතො-. පුබ්බෙ-. යථා-. අනාගතංසඤාණස්ස ආරම්මණ-. න කාමාවචරො ධම්මො න කාමාවචරස්ස ධම්මස්ස ආරම්මණ-. නිබ්බානං මග්ගස්ස, ඵලස්ස ආරම්මණ-. චෙතොපරියඤාණෙන න කාමාවචරචිත්තසමඞ්ගිස්ස, චිත්තං ජානාති, ආකාසානඤ්චායතනං විඤ්ඤාණඤ්චායතනස්ස, ආකිඤ්චඤ්ඤායතනං නෙවසඤ්ඤානාසඤ්ඤායතනස්ස-. න කාමාවචරා ඛන්ධා ඉද්ධිවිධ-. චෙතො-. පුබ්බෙ-. යථා-. අනාගතංසඤාණස්ස ආරම්මණ-. න කාමාවචරො ධම්මො කාමාවචරස්ස ආරම්මණ-. ඣානා වුට්ඨහිත්වා ඣානං පච්චවෙක්ඛති, අස්සාදෙති, අභි-. තං ආරබ්භ රාගො-. දිට්ඨි උප්පජ්ජති, අරියා මග්ගා වුට්ඨහිත්වා මග්ගං පච්ච-. ඵලං-. නිබ්බානං පච්ච-. නිබ්බානං ගොත්රභුස්ස-. වොදානස්ස-. ආවජ්ජනාය ආරම්මණ-. ආකාසානඤ්චායතනං පච්ච-. විඤ්ඤාණඤ්චායතනං පච්ච-. ආකිඤ්චඤ්ඤායතනං පච්ච-. නෙවසඤ්ඤානාසඤ්ඤායතනං පච්ච-. දිබ්බචක්ඛුං පච්ච-. දිබ්බසොතධාතුං-. ඉද්ධිවිධ-. චෙතොපරියඤාණං-."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1142,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පුබ්බෙ-. යථාකම්මූපගඤාණං, අනාගතංසඤාණං පච්ච-. න කාමාවචරෙ ඛන්ධෙ අනිච්චතො-. දොමනස්සං උප්පජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කාමාවචරො ධම්මො කාමාවචරස්ස අධිපති-. ආරම්මණාධිපති, සහජාතාධිපති, ආරම්මණාධිපති දානං-. සීලං-. උපොසථ-. පුබ්බෙ සුචිණ්ණානි-. තං ගරුං කත්වා පච්ච-. අස්සාදෙති, තං ගරුං කත්වා රාගො-. දිට්ඨි උප්පජ්ජති, සෙක්ඛා ගොත්රභුං ගරුං කත්වා පච්ච-. තං ගරුං කත්වා-. චක්ඛුං, වත්ථුං, කාමාවචරෙ ඛන්ධෙ ගරුං කත්වා අස්සාදෙති, තං ගරුං කත්වා රාගො-. දිට්ඨි උප්පජ්ජති, සහජාතාධිපති කාමාවචරාධිපති සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච අධිපති-. න කාමාවචරො න කාමාවචරස්ස අධිපති-. ආරම්මණාධිපති, සහජාතාධිපති, ආරම්මණාධිපති: නිබ්බානං මග්ගස්ස, ඵලස්ස අධිපති-. සහජාතාධිපති කාමාවචරාධිපති සම්පයුත්තකානං ඛන්ධානං අධිපති-. න කාමාවචරො කාමාවචරස්ස අධිපති-. ආරම්මණාධිපති, සහජාතාධිපති, - ආරම්මණාධිපති ඣානා වුට්ඨහිත්වා ඣානං ගරුං කත්වා පච්ච-. අස්සාදෙති, තං ගරුං කත්වා රාගො-. දිට්ඨි-. අරියා මග්ගා වුට්ඨහිත්වා මග්ගං ගරුං කත්වා පච්ච-. ඵලං-. නිබ්බානං, ගරුං කත්වා-. නිබ්බානං ගොත්රභුස්ස, වොදානස්ස අධිපති-. ආකාසානඤ්චායතනං ගරුං කත්වා පච්ච-. විඤ්ඤාණඤ්චායතනං. ආකිඤ්චඤ්ඤායතනං, නෙවසඤ්ඤානාසඤ්ඤායතනං, දිබ්බචක්ඛුං, දිබ්බසොතං, ඉද්ධිවිධං, අනාගතංසඤාණං ගරුං කත්වා පච්ච-. න කාමාවචරෙ ඛන්ධෙ ගරුං කත්වා අස්සාදෙති, තං ගරුං කත්වා රාගො-. දිට්ඨි-. සහජාතාධිපති න කාමාවචරාධිපති චිත්තසමුට්ඨානං අධිපති-. න කාමාවචරො කාමාවචරස්ස ච න කාමාවචරස්ස ච අධිපති-. සහජාතාධිපති න කාමාවචරාධිපති සම්පයුත්තාකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච අධිපති-."
                    },
                    {
                        "type": "paragraph",
                        "text": "කාමාවචරො ධම්මො කාමාවචරස්ස අනන්තර, පුරිමා පුරිමා-. කාමාවචරා ඛන්ධා පච්ඡිමානං පච්ඡිමානං ඛන්ධානං අනන්තරපච්චයා-. අනුලොමං ගොත්රභුස්ස, අනුලොමං වොදානස්ස, ආවජ්ජනා කාමාවචරානං ඛන්ධානං අනන්තරපච්ච-. කාමාවචරො න කාමාවචරස්ස අනන්තර-. කාමාවචරං චුතිචිත්තං න කාමාවචරස්ස උපපත්තිචිත්තස්ස-. ආවජ්ජනා න කාමාවචරානං ඛන්ධානං අනන්තරපච්ච-. කාමාවචරා ඛන්ධා න කාමාවචරස්ස වුට්ඨානස්ස අනන්තර-. පඨමස්ස ඣානස්ස පරිකම්මං පඨමස්ස ඣානස්ස අනන්තර-. චතුත්ථස්ස ඣානස්ස-. නෙවසඤ්ඤානාසඤ්ඤායතනස්ස පරිකම්මං-. දිබ්බස්ස චක්ඛුස්ස-. දිබ්බාය සොතධාතුයා-. ඉද්ධිවිධ-. චෙතො-. පුබ්බෙ-. යථා-. අනාගතංසඤාණස්ස පරිකම්මං-. ගොත්රභුස්ස, වොදානං මග්ගස්ස-. අනුලොමං ඵලසමාපත්තියා අනන්තර-. න කාමාවචරො න කාමාවචරස්ස අනන්තර-. පුරිමා"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1143,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පුරිමා න කාමාවචරා ඛන්ධා පච්ඡිමානං ඛන්ධානං අනන්තර-. මග්ගො ඵලස්ස-. ඵලං ඵලස්ස-. නිරොධා වුට්ඨාහන්තස්ස නෙවසඤ්ඤානාසඤ්ඤායතනං ඵලසමාපත්තියා අනන්තර-. න කාමාවචරො කාමාවචරස්ස අනන්තරපච්චයා-. න කාමාවචරං චුතිචිත්තං කාමාවචරස්ස උපපත්තිචිත්තස්ස-. න කාමාවචරං භවඞ්ගං ආවජ්ජනාය-. න කාමාවචරා ඛන්ධා කාමාවචරස්ස වුට්ඨානස්ස අනන්තරපච්ච-. සමනන්තරපච්ච-. සහජාතපච්ච-. සත්ත, අඤ්ඤමඤ්ඤපච්ච-. ඡ, නිස්සයපච්ච-. සත්ත."
                    },
                    {
                        "type": "paragraph",
                        "text": "කාමාවචරො-. කාමාවචරස්ස උපනිස්සය-. ආරම්මණූ-. අනන්තරූ-. පකතූ-. - පකතූප: කාමාවචරං, සද්ධං උපනිස්සාය දානං දෙති, සීලං-. උපොසථ-. විපස්සනා-. මානං ජප්පෙති, දිට්ඨිං ගණ්හාති, කාමාවචරං සීලං, පඤ්ඤං, රාගං, පත්ථනං, කායිකං සුඛං, කායිකං දුක්ඛං, උතුං, භොජනං සෙනාසනං උපනිස්සාය දානං දෙති, විපස්සනං-. පාණං හනති, සඞ්ඝං භින්දති, කාමාවචරා සද්ධා සෙනාසනං කාමාවචරාය සද්ධාය, පත්ථනාය, කායිකස්ස සුඛස්ස කායිකස්ස දුක්ඛස්ස උපනිස්ස-. කාමාවචරො න කාමාවචරස්ස උපනිස්සය-. අනන්තරූ-. පකතූ-. - පකතූප: කාමාවචරං සද්ධං උපනිස්සාය න කාමාවචරං ඣානං උප්පාදෙති, මග්ගං-. අභිඤ්ඤං-. සමාපත්තිං-. කාමාවචරං සීලං, සෙනාසනං උපනිස්සාය-. න කාමාවචරං ඣානං මග්ගං, අභිඤ්ඤං, සමාපත්තිං-. කාමාවචරා සද්ධා, සෙනාසනං, න කාමාවචරාය සද්ධාය, පඤ්ඤාය, මග්ගස්ස, ඵලසමාපත්තියා උපනිස්සය-. පඨමස්ස ඣානස්ස පරිකම්මං පඨමස්ස ඣානස්ස-. චතුත්ථස්ස ඣානස්ස-. ආකාසානඤ්චා-. පඨමස්ස මග්ගස්ස-. චතුත්ථස්ස මග්ගස්ස පරිකම්මං-. න කාමාවචරො න කාමාවචරස්ස උපනිස්සය-. ආරම්මණූ-. අනන්තරූ-. පකතූ, - පකතූප: න කාමාවචරං සද්ධං උපනිස්සය ඣානං උප්පාදෙති, මග්ගං-. අභිඤ්ඤං-. සමාපත්තිං උප්පාදෙති, න කාමාවචරං සීලං, පඤ්ඤං උපනිස්සාය ඣානං-. මග්ගං. අභිඤ්ඤං-. සමාපත්තිං උප්පාදෙති, න කාමාවචරා සද්ධා-. පඤ්ඤා-. න කාවචරාය සද්ධාය, පඤ්ඤාය මග්ගස්ස ඵලසමාපත්තියා උපනිස්සය-. පඨමං ඣානං දුතියස්ස ඣානස්ස උපනිස්සය-. තතියං ඣානං-. චතුත්ථං ඣානං-. ආකාසානඤ්චායතනං, ආකිඤ්චඤ්ඤායතනං, නෙවසඤ්ඤානාසඤ්ඤායතනස්ස උපනිස්සය-. පඨමො මග්ගො දුතියස්ස, තතියො මග්ගො චතුත්ථස්ස උපනිස්සය-. මග්ගො ඵලසමාපත්තියා උපනිස්සය-. න කාමාවචරො කාමාවචරස්ස උපනිස්සය-. ආරම්මණූ-. අනන්තරූ-. පකතූ-: - පකතූප-: න කාමාවචරං සද්ධං උපනිස්සාය දානං-. සීලං උපොසථ-. විපස්සනං මානං ජප්පෙති, දිට්ඨිං-. න කාමාවචරං සීලං, පඤ්ඤං උපනිස්සාය දානං දෙති, සීලං-. උපොසථ-. විපස්සනං-. මානං-. දිට්ඨිං ගණ්හාති. න"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1144,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කාමාවචරා සද්ධා, පඤ්ඤා, කාමාවචරාය සද්ධාය පඤ්ඤාය රාගස්ස, පත්ථනාය, කායිකස්ස සුඛස්ස, කායිකස්ස දුක්ඛස්ස උපනිස්සය-. අරියා මග්ගං උපනිස්සාය සඞ්ඛාරෙ අනිච්චතො විපස්සන්ති. මග්ගො අරියානං අත්ථපටිසම්භිදාය-. ධම්ම-. නිරුත්ති-. පටිභාන-. ඨානාඨානකොසල්ලස්ස-. උපනිස්සය-. ඵලසමාපත්ති කායිකස්ස සුඛස්ස, උපනිස්සය-."
                    },
                    {
                        "type": "paragraph",
                        "text": "කාමාවචරො කාමාවචරස්ස පුරෙජාත-. ආරම්මණපුරෙජාතං, වත්ථු පුරෙජාතං, ආරම්මණපුරෙ: චක්ඛුං, වත්ථුං, අනිච්චතො දොමනස්සං රූපායතනං චක්ඛුවිඤ්ඤාණස්ස ඵොට්ඨබ්බායතනං කාය-. වත්ථු කාමාවචරානං ඛන්ධානං පුරෙජාත-. කාමාවචරො කාමාවචරස්ස පුරෙජාත-. ආරම්මණපුරෙ-. වත්ථුපුරෙ-. ආරම්මණපුරෙ ජාතං-. දිබ්බෙන චක්ඛුනා රූපං-. දිබ්බාය-. වත්ථුපුරෙ-. වත්ථු-. න කාමාවචරානං ඛන්ධානං පුරෙජාත-. පච්ඡාජාතපච්ච-. ද්වෙ-. ආසෙවනපච්ච-. තීණි-."
                    },
                    {
                        "type": "paragraph",
                        "text": "කාමාවචාරො කාමාවචරස්ස කම්ම-. සහජාතා, නානාඛණිකා-. (සංඛිත්තං) න කාමාවචරො න කාමාවචරස්ස කම්ම-. සහජාතා, නානාඛණිකා-. න කාමාවචරරො කාමාවචරස්ස කම්ම-. සහජාතා, නානාඛණිකා, (සංඛිත්තං) න කාමාවචරො කාමාවචරස්ස ච න කාමාවචරස්ස ච කම්ම-. සහජාතා, නානාඛණිකා-. (සංඛිත්තං) විපාකෙ චත්තාරි, ආහාරෙ චත්තාරි, ඉන්ද්රියෙ චත්තාරි, ඣානෙ චත්තාරි, මග්ගෙ චත්තාරි, සම්පයුත්තෙ ද්වෙ, කාමාවචරො කාමාවචරස්ස විප්පයුත්තපච්ච-. සහජාතං, පුරෙජාතං, පච්ඡාජාතං-. (සංඛිත්තං) කාමාවචරො න කාමාවචරස්ස විප්පයුත්තපච්ච-. සහජාතං, පුරෙජාතං, -. සහජාතං-. (සංඛිත්තං) පටිසන්ධික්ඛණෙ වත්ථු න කාමාවචරානං ඛන්ධානං විප්පයුත්ත-. පුරෙජාතං වත්ථු න කාමාවචරානං ඛන්ධානං විප්පයුත්ත-. න කාමාවචරො කාමාවචරස්ස විප්පයුත්ත-. සහජාතං, පච්ඡෘජාතං, සහජාතා න කාමාවචරා ඛන්ධා චිත්තසමුට්ඨානං-. පටිසන්ධි-. පච්ඡාජාතා න කාමාවචරා ඛන්ධා පුරෙජාතස්ස-."
                    },
                    {
                        "type": "paragraph",
                        "text": "කාමාවචරො කාමාවචරස්ස අත්ථි-. සහජාතං, පුරෙජාතං, පච්ඡාජාතං, ආහාරං, ඉන්ද්රියං, (සංඛිත්තං) කාමාවචරො න කාමාවචරස්ස අත්ථි-. සහජාතං, පුරෙජාතං, -. සහජාතං: පටිසන්ධික්ඛණෙ වත්ථු න කාමාවචරානං ඛන්ධානං අත්ථි-. පුරෙජාතං-. දිබ්බෙන චක්ඛුනා-. (පුරෙජාත සදිසං) න කාමාවචරො න කාමාවචරස්ස අත්ථි-. සහජාතං-. (සංඛිත්තං) න කාමාවචරො කාමාවචරස්ස අත්ථි-. සහජාතං, පච්ඡාජාතං-. (විප්පයුත්ත සදිසං.) න කාමාවචරො කාමාවචරස්ස ච න කාමාවචරස්ස ච අත්ථි-. (පටිච්ච සදිසං) කාමාවචරො ච න කාමාවචරො ච කාමාවචරස්ස අත්ථි-. සහජාතං, පච්ඡාජාතං, ආහාරං, ඉන්ද්රියං, සහජාතා"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1145,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "න කාමාවචරා ඛන්ධා ච මහාභූතා ච චිත්තසමුට්ඨා-. අත්ථි-. පටිසන්ධි-. පච්ඡාජාතා න කාමාවචරා ඛන්ධා ච කබළීකාරො ආහාරො ච ඉමස්ස කායස්ස අත්ථි-. පච්ඡාජාතා න කාමාවචරා ඛන්ධා ච රූපජීවිතින්ද්රියඤ්ච කටත්තා-. අත්ථි-. කාමාවචරො ච න කාමාවචරො ච න කාමාවචරස්ස අත්ථි-. සහජාතං, පුරෙජාතං. සහජාතො න කාමාවචරො එකො ඛන්ධො ච වත්ථු ච තිණ්ණන්නං ඛන්ධානං අත්ථි-. ද්වෙ-. පටිසන්ධි-. නත්ථිපච්චයා-. විගතපච්චයා-. අවිගතපච්චයා-."
                    },
                    {
                        "type": "paragraph",
                        "text": "හෙතුයා චත්තාරි, ආරම්මණෙ චත්තාරි, අධිපතියා චත්තාරි, අනන්තරෙ චත්තාරි, සමනන්තරෙ චත්තාරි, සහජාතෙ සත්ත, අඤ්ඤමඤ්ඤෙ ඡ, නිස්සයෙ සත්ත, උපනිස්සයෙ චත්තාරි, පුරෙජාතෙ ද්වෙ, පච්ඡාජාතෙ ද්වෙ, ආසෙවනෙ තීණි, කම්මෙ චත්තාරි, විපාකෙ චත්තාරි, ආහාරෙ චත්තාරි, ඉන්ද්රියෙ චත්තාරි, ඣානෙ චත්තාරි, මග්ගෙ චත්තාරි, සම්පයුත්තෙ ද්වෙ, විප්පයුත්තෙ තීණි, අත්ථියා සත්ත, නත්ථියා චත්තාරි, විගතෙ චත්තාරි, අවිගතෙ සත්ත."
                    },
                    {
                        "type": "paragraph",
                        "text": "කාමාවචරො ධම්මො කාමාවචරස්ස-. ආරම්මණ-. සහජාත, උපනිස්සයෙ, පුරෙජාත, පච්ඡාජාත, කම්ම, ආහාර, ඉන්ද්රිය-. කාමාවචරො න කාමාවචරස්ස ආරම්මණ-. සහජාත, උපනිස්සය, පුරෙජාත-. න කාමාවචරො න කාමාවචරස්ස ආරම්මණ-. සහජාත, උපනිස්සය, න කාමාවචරො කාමාවචරස්ස ආරම්මණ-. සහජාත, උපනිස්සය, පච්ඡාජාත, කම්ම-. න කාමාවචරො කාමාවචරස්ස ච න කාමාවචරස්ස ච සහජාත-. කම්ම-. කාමාවචරො ච න කාමාවචරස්ස සහජාතං පච්ඡාජාතං, ආහාරං, ඉන්ද්රියං-. කාමාවචරො ච න කාමාවචරො ච න කාමාවචරස්ස සහජාතං, පුරෙජාතං."
                    },
                    {
                        "type": "paragraph",
                        "text": "න හෙතුයා සත්ත, නාරම්මණෙ සත්ත, න අධිපතියා සත්ත, න අනන්තරෙ සත්ත, න සමනන්තරෙ සත්ත, න සහජාතෙ ඡ, න අඤ්ඤමඤ්ඤෙ ඡ, න නිස්සයෙ ඡ, න උපනිස්සයෙ සත්ත, න පුරෙජාතෙ ඡ, න සම්පයුත්තෙ ඡ, න විප්පයුත්තෙ පඤ්ච, නො අත්ථියා පඤ්ච, නො නත්ථියා සත්ත, නො විගතෙ සත්ත, නො අවිගතෙ පඤ්ච, හෙතුපච්චයා නාරම්මණෙ චත්තාරි නාධිපතියා, චත්තාරි, නානන්තරෙ චත්තාරි, සමනන්තරෙ චත්තාරි, න අඤ්ඤමඤ්ඤෙ ද්වෙ, න උපනිස්සයෙ චත්තාරි, න සම්පයුත්තෙ ද්වෙ, නො නත්ථියා චත්තාරි, නො විගතෙ චත්තාරි, න හෙතුපච්චයා ආරම්මණෙ චත්තාරි, අධිපතියා චත්තාරි, (අනුලොම මාතිකා කාතබ්බා) අවිගතෙ සත්ත."
                    },
                    {
                        "type": "centered",
                        "text": "කාමාවචර දුකං නිට්ඨිතං.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1146,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "94. රූපාවචර දුකං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "රූපාවචරං ධම්මං පටිච්ච රූපාවචරො ධම්මො උප්පජ්ජති හෙතුපච්චයා, රූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. පටිසන්ධි-. රූපාවචරං ධම්මං පටිච්ච න රූපාවචරො ධම්මො උප්පජ්ජති හෙතුපච්චයා, රූපාවචරෙ ඛන්ධෙ පටිච්ච චිත්තසමුට්ඨානං රූපං, පටිසන්ධි-. රූපාවචරං ධම්මං පටිච්ච රූපාවචරො ච න රූපාවචරො ච-. හෙතුපච්චයා-. රූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච-. ද්වෙ පටිසන්ධි. න රූපාවචරං ධම්මං පටිච්ච න රූපාවචරො-. හෙතු-. න රූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච-. ද්වෙ ඛන්ධෙ-. පටිසන්ධික්ඛණෙ-. න රූපාවචරං ධම්මං පටිච්ච රූපාවචරො-. හෙතුපච්චයා, පටිසන්ධික්ඛණෙ-. වත්ථුං පටිච්ච රූපාවචරා ඛන්ධා, න රූපාවචරං ධම්මං පටිච්ච රූපාවචරො ච න රූපාවචරො ච-. හෙතුපච්චයා, පටිසන්ධික්ඛණෙ-. වත්ථුං පටිච්ච රූපාවචරා ඛන්ධා, මහාභූතෙ පටිච්ච කටත්තා රූපං, රූපාවචරඤ්ච න රූපාවචරඤ්ච ධම්මං පටිච්ච රූපාවචරො ධම්මො-. හෙතු-. පටිසන්ධික්ඛණෙ රූපාවචරං එකං ඛන්ධඤ්ච වත්ථුං ච පටිච්ච තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. රූපාවචරඤ්ච න රූපාවචරඤ්ච ධම්මං පටිච්ච න රූපාවචරො-. හෙතුපච්චයා, රූපාවචරෙ ඛන්ධෙ ච මහාභූතෙ ච පටිච්ච චිත්තසමුට්ඨානං,-. පටිසන්ධික්ඛණෙ, රූපාවචරෙ ඛන්ධෙ ච මහාභූතෙ ච පටිච්ච කටත්තා රූපං, රූපාවචරඤ්ච න රූපාවචරඤ්ච ධම්මං පටිච්ච රූපාවචරො ච න රූපාවචරො ච-. හෙතුපච්චයා. පටිසන්ධික්ඛණෙ-. රූපාවචරං එකං ඛන්ධඤ්ච වත්ථු ච පටිච්ච තයො ඛන්ධා, ද්වෙ-. රූපාවචරෙ ඛන්ධෙ ච මහාභූතෙ ච පටිච්ච කටත්තා රූපං, (සංඛිත්තං.) හෙතුයා නව, ආරම්මණෙ චත්තාරි, අධිපතියා පඤ්ච, අනන්තරෙ චත්තාරි, සමනන්තරෙ චත්තාරි, අධිපතියා පඤ්ච, අනන්තරෙ චත්තාරි, සමනන්තරෙ චත්තාරි, සහජාතෙ නව, අඤ්ඤමඤ්ඤෙ ඡ, නිස්සයෙ නව, උපනිස්සයෙ චත්තාරි, පුරෙජාතෙ ද්වෙ, ආසෙවනෙ ද්වෙ, කම්මෙ නව, විපාකෙ නව, ඣානෙ නව, මග්ගෙ නව, සම්පයුත්තෙ චත්තාරි, විප්පයුත්තෙ නව, අත්ථියා නව, නත්ථියා චත්තාරි, විගතෙ චත්තාරි, අවිගතෙ නව."
                    },
                    {
                        "type": "paragraph",
                        "text": "න රූපාවචරං ධම්මං පටිච්ච න රූපාවචරො ධම්මො උප්පජ්ජති න හෙතුපච්චයා, අහෙතුකං න රූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, චිත්තසමුට්ඨානඤ්ච-. ද්වෙ ඛන්ධෙ-. අහෙතුකපටිසන්ධික්ඛණෙ ඛන්ධෙ පටිච්ච වත්ථු, වත්ථුං පටිච්ච ඛන්ධා, එකං මහාභූතං, (යාව අසඤ්ඤසත්තා) විචිකිච්ඡාසහගතෙ උද්ධච්චසහගතෙ ඛන්ධෙ පටිච්ච විචිකිච්ඡාසහගතො උද්ධච්ච-. මොහො, නාරම්මණෙ තීණි, රූපාවචරං ධම්මං පටිච්ච රූපාවචරො ධම්මො-. නාධිපතිපච්චයා, රූපාවචරෙ"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1147,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඛන්ධෙ පටිච්ච රූපාවචරාධිපති, විපාකං රූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, ද්වෙ-. පටිසන්ධි-. රූපාවචරං ධම්මං-. පටිච්ච න රූපාවචරො-. නාධිපති-. විපාකෙ රූපාවචරෙ ඛන්ධෙ පටිච්ච චිත්තසමුට්ඨානං, පටිසන්ධි-. රූපාවචරං ධම්මං පටිච්ච රූපාවචරො ච න රූපාවචරො ච-. නාධිපති-. විපාකං රූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධො චිත්තසමුට්ඨානඤ්ච-. ද්වෙ ඛන්ධෙ-. පටිසන්ධි-. න රූපාවචරං ධම්මං පටිච්ච න රූපාවචරො ධම්මො-. නාධිපති-. න රූපාවචරං එකං ඛන්ධා පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච රූපං, තීණි, න කාමාවචරං-. (පටිච්චසදිසං, නින්නානං ඉධ සබ්බෙ මහාභූතා කාතබ්බා,) රූපාවචරඤ්ච න රූපාවචරඤ්ච ධම්මං-. රූපාවචරො-. නාධිපති-. පටිසන්ධික්ඛණෙ රූපාවචරං එකං ඛන්ධඤ්ච වත්ථුං ච පටිච්ච තයො ඛන්ධා, රුපවචරඤ්ච න රූපාවචරඤ්ච-. න රූපාවචරො-. නාධිපති-. විපාකෙ රූපාවචරෙ ඛන්ධෙ ච මහාභූතෙ ච පටිච්ච චිත්තසමුට්ඨානං,-. පටිසන්ධි-. රූපාවචරඤ්ච න රූපාවචරඤ්ච-. රූපාවචරො ච න රූපාවචරො ච-. නාධිපති-. පටිසන්ධික්ඛණෙ රූපාවචරං එකං ඛන්ධඤ්ච වත්තුං ච පටිච්ච තයො ඛන්ධා, ද්වෙ-. රූපාවචරෙ ඛන්ධෙ ච මහාභූතෙ ච පටිච්ච චිත්තසමුට්ඨානංවිපාකෙ රූපාවචරෙ ඛන්ධෙ ච මහාභූතෙ ච පටිච්ච චිත්තසමුට්ඨානං, පටිච්ච කටත්තා රූපං, නානන්තරපච්චයා, න උපනිස්සයපච්චයා,"
                    },
                    {
                        "type": "paragraph",
                        "text": "රූපාවචරං ධම්මං-. රූපාවචරො ධම්මො-. න පුරෙජාත-. පටිසන්ධික්ඛණෙ රූපාවචරං එකං-. පටිච්ච තයො ඛන්ධා, ද්වෙ-. රූපාවචරං ධම්මං-. න රූපාවචරො-. න පුරෙජාත-. රූපාවචරෙ ඛන්ධෙ පටිච්ච චිත්තසමුට්ඨානං-. පටිසන්ධි-. රූපාවචරං-. රූපාවචරො ච න රූපාවචරො ච-. න පුරෙජාත-. පටිසන්ධික්ඛණෙ රූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා කටත්තා රූපං, ද්වෙ-. න රූපාවචරං-. න රූපාවචරො ධම්මො-. න පුරෙජාත-. අරූපෙ න රූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. න රූපාවචරෙ ඛන්ධෙ පටිච්ච චිත්තසමුට්ඨානං-. පටිසන්ධි. (යාව අසඤ්ඤසත්තා ඉතරෙ පඤ්චපි පඤ්හා, අනුලොමං කාතබ්බං) න පච්ඡාජාතපච්චයා, නව, රූපාවචරං ධම්මං පටිච්ච රූපාවචරො-. නාසෙවන-. විපාකං රූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, පටිසන්ධි-. රූපාවචරං-. න රූපාවචරො-. නාසෙවන-. රූපාවචරෙ ඛන්ධෙ පටිච්ච චිත්තසමුට්ඨානං-. පටිසන්ධි-. රූපාවචරං-. රූපාවචරො ච න රූපාවචරො ච-. නාසෙවන-. විපාකං රූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච-. ද්වෙ ඛන්ධෙ-. පටිසන්ධි-. න රූපාවචරං-. න රූපාවචරො-. නාසෙවන-. තීණි රූපාවචරඤ්ච-. න රූපාවචරඤ්ච-. රූපාවචරො-. නාසෙවන-. (සංඛිත්තං) (මූලං ඉතරෙපි පඤ්හා කාතබ්බා-.) න කම්මපච්චයා, ද්වෙ, (සංඛිත්තං,) න සම්පයුත්තපච්චයා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1148,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "න රූපාවචරං ධම්මං පටිච්ච න රූපාවචරො-. න විප්පයුත්තපච්චයා-. අරූපෙ න රූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, ද්වෙ බාහිරං, ආහාරං, උතු-. අසඤ්ඤසත්තානං-. (සංඛිත්තං) න හෙතුයා එකං, නාරම්මණෙ තීණි, නාධිපතියා නව, නානන්තරෙ තීණි, න සමනන්තරෙ තීණි, නි උපනිස්සයෙ තීණි. න පුරෙජාතෙ නව, පච්ඡාජාතෙ නව, නාසෙවනෙ නව, න කම්මෙ ද්වෙ, න විපාකෙ පඤ්ච, නාහාරෙ එකං, න ඉන්ද්රියෙ එකං, න ඣානෙ එකං, න මග්ගෙ එකං, න සම්පයුත්තෙ තීණි, න විප්පයුත්තෙ එකං, නො නත්ථියා තීණි. නො විගතෙ තීණි. (ඉතරෙ ද්වෙ ගණනාපි සහජාතවාරෙපි කාතබ්බො) රූපාවචරං ධම්මං පච්චයා රූපාවචරො ධම්මො-. හෙතුපච්චයා, තීණි. (පටිච්චසදිසං.) න රූපාවචරං-. න රූපාවචරො-. හෙතුපච්චයා, න රූපාවචරං එකං ඛන්ධං පච්චයා තයො ඛන්ධා චිත්තසමුට්ඨානං-. (යාව අජ්ඣත්තිකං මහාභූතං, ) වත්ථුං පච්චයා න රූපාවචරා ඛන්ධා, න රූපාවචරං-. රූපාවචරො-. හෙතුපච්චයා, වත්ථුං පච්චයා රූපාවචරා ඛන්ධා, පටිසන්ධි-. න රූපාවචරං රූපාවචරො ච න රූපාවචරො ච-. හෙතුපච්චයා, වත්ථුං පච්චයා රූපාවචරා ඛන්ධා, මහාභූතෙ පච්චයා චිත්තසමුට්ඨානං-. පටිසන්ධි-. රූපාවචරඤ්ච න රූපාවචරඤ්ච-. රූපාවචරො-. හෙතුපච්චයා, රූපාවචරං එකං ඛන්ධඤ්ච වත්ථුං ච පච්චයා තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. පටිසන්ධි-. රූපාවචරඤ්ච න රූපාවචරඤ්ච-. න රූපාවචරො-. හෙතුපච්චයා, රූපාවචරෙ ඛන්ධෙ ච මහාභූතෙ ච පච්චයා චිත්තසමුට්ඨානං-. පටිසන්ධි-. රූපාවචරඤ්ච න රූපාවචරඤ්ච-. රූපාවචරො ච න රූපාවචරො ච-. හෙතුපච්චයා, රූපාවචරං එකං ඛන්ධඤ්ච වත්ථුං ච පච්චයා තයො ඛන්ධා, ද්වෙ-. රූපාවචරෙ ඛන්ධෙ ච මහාභූතෙ ච පච්චයා චිත්තසමුට්ඨානං-. පටිසන්ධි-. (සංඛිත්තං) හෙතුයා නව, ආරම්මණෙ චත්තාරි, අධිපතියා නව, අනන්තරෙ චත්තාරි, සමනන්තරෙ චත්තාරි, සහජාතෙ නව, අඤ්ඤමඤ්ඤෙ ඡ, නිස්සයෙ නව, උපනිස්සයෙ චත්තාරි, පුරෙජාතෙ චත්තාරි, ආසෙවනෙ චත්තාරි, කම්මෙ නව, අවිගතෙ නව."
                    },
                    {
                        "type": "paragraph",
                        "text": "න රූපාවචරං ධම්මං පච්චයා න රූපාවචරො-. න හෙතුපච්චයා, අහෙතුකං න රූපාවචරං එකං ඛන්ධං පච්චයා තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච-. ද්වෙ ඛන්ධෙ-. අහෙතුකපටිසන්ධි-. යාව අසඤ්ඤසත්තා, චක්ඛායතනං පච්චයා චක්ඛුවිඤ්ඤාණං, කායායතනං-. වත්ථු පච්චයා අහෙතුකා න රූපාවචරා ඛන්ධා-. විචිකිච්ඡාසහගතෙ උද්ධච්චසහගතෙ ඛන්ධෙ ච වත්ථුං ච පච්චයා විචිකිච්ඡා-. උද්ධච්ච-. මොහො. රූපාවචරං ධම්මං-. රූපාවචරො-. නාධිපති-. තීණි. (පටිච්ච සදිසං) න රූපාවචරං-. රූපාවචරො-. නාධිපති-. වත්ථුං පච්චයා රූපාවචරාධිපති, වත්ථුං පච්චයා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1149,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "විපාකා රූපාවචරා ඛන්ධා, පටිසන්ධි-. න රූපාවචරං-. රූපාවචරො ච න රූපාවචරො ච-. නාධිපති-. වත්ථුං පච්චයා විපාකා රූපාවචරා ඛන්ධා, මහාභූතෙ පච්චයා චිත්තසමුට්ඨානං-. පටිසන්ධි-. රූපාවචරඤ්ච න රූපාවචරඤ්ච-. රූපාවචරො-. නාධිපති-. රූපාවචරෙ ඛන්ධෙ ච වත්ථුං ච පච්චයා රූපාවචරාධිපති, විපාකං රූපාවචරං එකං ඛන්ධඤ්ච වත්ථුං ච පච්චයා තයො ඛන්ධා, ද්වෙ-. පටිසන්ධික්ඛණෙ, රූපාවචරං එකං ඛන්ධඤ්ච වත්ථුං ච පච්චයා තයො ඛන්ධා, ද්වෙ-. රූපාවචරඤ්ච න රූපාවචරඤ්ච-. න රූපාවචරො-. නාධිපති-. විපාකෙ රූපාවචරෙ ඛන්ධෙ ච මහාභූතෙ ච පච්චයා චිත්තසමුට්ඨානං-. පටිසන්ධි-. රූපාවචරඤ්ච න රූපාවචරඤ්ච-. රූපාවචරො ච න රූපාවචරො ච-. නාධිපති-. විපාකං රූපාවචරං එකං ඛන්ධඤ්ච වත්ථුං ච පච්චයා තයො ඛන්ධා, ද්වෙ-. විපාකෙ රූපාවචරෙ ඛන්ධෙ ච මහාභූතෙ ච පච්චයා චිත්තසමුට්ඨානං-. පටිසන්ධි-. (සංඛිත්තං.) න හෙතුයා එකං, නාරම්මණෙ තීණි, නාධිපතියා නව, නානන්තරෙ තීණි, න උපනිස්සයෙ තීණි, න පුරෙජාතෙ නව, න පච්ඡාජාතෙ නව, නාසෙවනෙ නව, (සුද්ධිකෙ අරූපෙ ච මිස්සකෙ ච විපාකන්ති නියාමෙතබ්බං) න කම්මෙ චත්තාරි, න විපාකෙ නව, නාහාරෙ එකං, න ඉන්ද්රියෙ එකං, න ඣානෙ එකං, න මග්ගෙ එකං, න සම්පයුත්තෙ තීණි, න විප්පයුත්තෙ එකං, නො නත්ථියා තීණි. නො විගතෙ තීණි, (ඉතරෙ ද්වෙ ගණනාපි නිස්සයවාරොපි කාතබ්බො.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "රූපාවචරං ධම්මං සංසට්ඨො රූපාවචරො-. හෙතුපච්චයා, රූපාවචරං එකං ඛන්ධං සංසට්ඨා තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. පටිසන්ධි-. න රූපාවචරං ධම්මං සංසට්ඨො න රූපාවචරො-. හෙතුපච්චයා, න රූපාවචරං එකං ඛන්ධං සංසට්ඨා තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. පටිසන්ධි-. හෙතුයා ද්වෙ, ආරම්මණෙ ද්වෙ, සබ්බත්ථ ද්වෙ, අවිගතෙ ද්වෙ, න රූපාවචරං ධම්මං සංසට්ඨො න රූපාවචරො න හෙතු-. න හෙතුයා එකං, නාධිපතියා ද්වෙ, න පුරෙජාතෙ ද්වෙ, න පච්ඡාජාතෙ ද්වෙ, න ආසෙවනෙ ද්වෙ, න කම්මෙ ද්වෙ, න විපාකෙ ද්වෙ, න ඣානෙ එකං, න මග්ගෙ එකං, න විප්පයුත්තෙ එකං, (ඉතරෙ ද්වෙ ගණනාපි සම්පයුත්තවාරොපි කාතබ්බො.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "රූපාවචරො ධම්මො රූපාවචරස්ස ධම්මස්ස හෙතුපච්චයා, රූපාවචරා හෙතු සම්පයුත්තකානං ඛන්ධානං හෙතුපච්චයා, පටිසන්ධි-. (මූලං-.) රූපාවචරා හෙතු චිත්තසමුට්ඨානානං රූපානං හෙතුපච්චයා, පටිසන්ධි-. (මූලං) රූපාවචරා හෙතු සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච රූපානං හෙතුපච්චයා, පටිසන්ධි-. න රූපාවචරො"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1150,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "න රූපාවචරස්ස හෙතුපච්චයා න රූපාවචරා හෙතු සම්පයුතත්කානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච-. හෙතුපච්චයා, පටිසන්ධි-."
                    },
                    {
                        "type": "paragraph",
                        "text": "රූපාවචරො රූපාවචරස්ස ආරම්මණ-. චෙතොපරියඤාණෙන රූපාවචර චිත්තසමඞ්ගිස්ස-. රූපාවචරා ඛන්ධා ඉද්ධිවිධ-. චොතො-. පුබ්බෙ-. යථා කම්මූ-. අනාගතංසඤාණස්ස ආරම්මණ-. රූපාවචරා න රූපාවචරස්ස ආරම්මණ-. පඨමං ඣානං පච්චවෙක්ඛති, චතුත්ථං ඣානං පච්චවෙක්ඛති, දිබ්බං චක්ඛුං පච්ච-. දිබ්බං සොතධාතුං-. ඉද්ධිවිධ-. චෙතො-. පුබ්බෙනිවාස-. යථාකම්මූ-. අනාගතංසඤාණ පච්චවෙක්ඛති, රූපාවචරෙ ඛන්ධෙ අනිච්චතො-. දොමනස්සං උප්පජ්ජති, න රූපාවචරො න රූපාවචරස්ස ආරම්මණ-. දානං දත්වා, සීලං-. උපොසථ පුබ්බෙ සුචිණ්ණානි පච්චවෙක්ඛති, අස්සාදෙති, තං ආරබ්භ රාගො-. දොමනස්සං උප්පජ්ජති, අරියා මග්ගා වුට්ඨහිත්වා මග්ගං පච්ච-. ඵලං පච්ච-. නිබ්බානං පච්ච-. නිබ්බානං ගොත්රභුස්ස වොදානස්ස, මග්ගස්ස, ඵලස්ස, ආවජ්ජනාය ආරම්මණපච්ච-. අරියා පහීනෙ කිලෙසෙ-. වික්ඛම්භිතෙ-. පුබ්බෙ-. චක්ඛුං-. වත්ථුං-. න රූපාවචරෙ ඛන්ධෙ අනිච්චතො-. දොමනස්සං-. ආකාසානඤ්චායතනං, විඤ්ඤාණඤ්චායතනං, ආකිඤ්චඤ්ඤායතනං, නෙවසඤ්ඤානාසඤ්ඤායතනං, රූපායතනං චක්ඛුවිඤ්ඤාණස්ස-. ඵොට්ඨබ්බායතනං-. න රූපාවචරො රූපාවචරස්ස ආරම්මණ-. දිබ්බෙන චක්ඛුනා රූපං-. දිබ්බාය සොත-. චෙතොපරියඤාණෙන න රූපාවචර චිත්තසමඞ්ගිස්ස චිත්තං ජානාති, න රූපාවචරා ඛන්ධා-. ඉද්ධි-. චෙතො-. පුබ්බෙ-. යථා-. අනාගතංසඤාණස්ස ආරම්මණ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "රූපාවචරො රූපාවචරස්ස අධිපති-. සහජාතාධිපති, රූපාවචරාධිපති, සම්පයුත්තකානං ඛන්ධානං අධිපති-. රූපාවචරො න රූපාවචරස්ස අධිපති-. ආම්මණාධිපති, සහජාතාධිපති, ආරම්මණාධිපති: පඨමං ඣානං ගරුං කත්වා පච්ච-. අස්සාදෙති, තං ගරුං කත්වා රාගො-. දිට්ඨි-. චතුත්ථං ඣානං-. දිබ්බං චක්ඛුං-. දිබ්බං සොතං-. ඉද්ධි-. චෙතො-. පුබ්බෙ-. යථා-. අනාගතංසඤාණං-. ගරුං කත්වා පච්චවෙක්ඛති, අස්සාදෙති, තං ගරුං කත්වා රාගො-. දිට්ඨි-. රූපාවචරෙ ඛන්ධෙ ගරුං කත්වා අස්සාදෙති, තං ගරුං කත්වා රාගො-. දිට්ඨි-. සහජාතාධිපති රූපාවචරාධිපති චිත්තසමුට්ඨානානං රූපානං අධිපති-. රූපාවචරො රූපාවචරස්ස ච න රූපාවචරස්ස ච අධිපති, සහජාතාධිපති රූපාවචරාධිපති සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච-. අධිපති-. න රූපාවචරො න රූපාවචරස්ස අධිපති-. ආරම්මණාධිපති, සහජාතාධිපති-. ආරම්මණාධිපති දානං-. සීලං-. උපොසථ-. පුබ්බෙ සුචිණ්ණානි ගරුං කත්වා පච්ච-. අස්සාදෙති තං ගරුං කත්වා රාගො-."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1151,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "දිට්ඨියා අරියා මග්ගා වුට්ඨහිත්වා, මග්ගං ගරුං කත්වා-. ඵලං-. නිබ්බානං ගරුං-. නිබ්බානං ගොත්රභුස්ස, වොදානස්ස, මග්ගස්ස, ඵලස්ස අධිපති-. චක්ඛුං, වත්ථුං-. න රූපාවචරෙ ඛන්ධෙ ගරුං කත්වා අස්සාදෙති, තං ගරුං කත්වා රාගො-. දිට්ඨි-. ආකාසානඤ්චායතනං ගරුං කත්වා පච්ච-. නෙවසඤ්ඤානාසඤ්ඤායතනං ගරුං කත්වා පච්ච-. සහජාතාධිපති න රූපාවචරාධිපති සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච-. අධිපති-."
                    },
                    {
                        "type": "paragraph",
                        "text": "රූපාවචරො රූපාවචරස්ස අනන්තර-. පුරිමා පුරිමා රූපාවචරා ඛන්ධා පච්ඡිමානං පච්ඡිමානං ඛන්ධානං අනන්තර-. රූපාවචරො න රූපාවචරස්ස අනන්තර-. රූපාවචරං චුතිචිත්තං න රූපාවචරස්ස උපපත්තිචිත්තස්ස අනන්තර-. රූපාවචරං, භවඞ්ගං ආවජ්ජනාය-. රූපාවචරා ඛන්ධා න රූපාවචරස්ස-. වුට්ඨානස්ස අනන්තර-. න රූපාවචරො න රූපාවචරස්ස අනන්තර-. පුරිමා පුරිමා න රූපාවචරා ඛන්ධා පච්ඡිමානං පච්ඡිමානං න රූපාවචරානං ඛන්ධානං අනන්තර-. අනුලොමං ගොත්රභුස්ස-. නෙවසඤ්ඤානාසඤ්ඤායතනං ඵලසමාපත්තියා අනන්තර-. න රූපාවචරො රූපාවචරස්ස අනන්තර-. න රූපාවචරං චුතිචිත්තං රූපාවචරස්ස උපපත්ති චිත්තස්ස අනන්තර-. න රූපාවචරා ඛන්ධා රූපාවචරස්ස වුට්ඨානස්ස අනන්තර-. පඨමස්ස ඣානස්ස පරිකම්මං පඨමස්ස ඣානස්ස, අනන්තර-. චතුත්ථස්ස ඣානස්ස-. දිබ්බස්ස චක්ඛුස්ස-. දිබ්බාය සොත-. ඉද්ධි-. චෙතො-. පුබ්බෙ-. යථා-. අනාගතංසඤාණස්ස පරිකම්මං අනාගතංස ඤාණස්ස අනන්තරපච්චයා සමනන්තරපච්චයා, සහජාතපච්චයා, සත්ත. අඤ්ඤ්මඤ්ඤපච්චයා, ඡ, නිස්සයපච්චයා, සත්ත."
                    },
                    {
                        "type": "paragraph",
                        "text": "රූපාවචරො ධම්මො රූපාවචරස්ස-. උපනිස්සය-. අනන්තරූ-. පකතූ-. පකතූප-. රූපාවචරං සද්ධං උපනිස්සාය රූපාවචරං ඣානං උප්පාදෙති, අභිඤ්ඤං-. සමාපත්තිං උප්පාදෙති, රූපාවචරං සීලං, පඤ්ඤං උපනිස්සාය රූපාවචරං ඣානං, අභිඤ්ඤං, සමාපත්තිං-. රූපාවචරා සද්ධා, පඤ්ඤා රූපාවචරාය සද්ධාය, පඤ්ඤාය උපනිස්සය-. පඨමං ඣානං දුතියස්ස ඣානස්ස, උපනිස්සය-. දුතියං ඣානං තතියස්ස ඣානස්ස-. තතියං ඣානං චතුත්ථස්ස ඣානස්ස-. උපනිස්සය-. රූපාවචරො න රූපාවචරස්ස උපනිස්සය-. ආරම්මණූ-. අනන්තරූ-. පකතූ-. - පකතූප-. රූපාවචරං සද්ධං උපනිස්සාය දානං දෙති. සීලං-. උපොසථ-. රූපාවචරං ඣානං-. විපස්සනං-. මග්ගං-. අභිඤ්ඤං-. සමාපත්තිං-. මානං ජප්පෙති, දිට්ඨිං ගණ්හාති, රූපාවචරං සීලං, පඤ්ඤං උපනිස්සාය දානං-. මානං ජප්පෙති, දිට්ඨිං ගණ්හාති, රූපාවචරා සද්ධා, පඤ්ඤා, න රූපාවචරාය සද්ධාය, පඤ්ඤාය,"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1152,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "රාගස්ස, පත්ථනාය, කායිකස්ස සුඛස්ස, දුක්ඛස්ස, මග්ගස්ස, ඵලසමාපත්තියා උපනිස්සය-. න රූපාවචරො න රූපාවචරස්ස උපනිස්සය-. ආරම්මණූ-. අනන්තරූ-. පකතූ-. පකතූප: න රූපාවචරං සද්ධං උපනිස්සාය දානං-. සීලං-. උපොසථ-. න රූපාවචරං ඣානං-. විපස්සනං-. මග්ගං-. අභිඤ්ඤං-. සමාපත්තිං-. මානං ජප්පෙති, දිට්ඨිං ගණ්හාති, න රූපාවචරං සීලං, පඤ්ඤං, උපනිස්සාය දානං, -පෙ- මානං ජප්පෙති, දිට්ඨිං ගණ්හාති, න රූපාවචරා සද්ධා, පඤ්ඤා, රූපාවචරාය පඤ්ඤාය රාගස්ස පත්ථනාය කායිකස්ස සුඛස්ස, දුක්ඛස්ස, මග්ගස්ස ඵලසමාපත්තියා උපනිස්සය-. න රූපාවචරො රූපාවචරස්ස උපනිස්සය-. අනන්තරූ-. පකතූ පකතූප: න රූපාවචරං සද්ධං උපනිස්සාය රූපාවචරං ඣානං, අභිඤ්ඤං, සමාපත්තිං-. න රූපාවචරං සීලං, -පෙ- සෙනාසනං උපනිස්සාය රූපාවචරං ඣානං-. අභිඤ්ඤං, සමාපත්තිං-. න රූපාවචරා සද්ධා සෙනාසනං රූපාවචරාය සද්ධාය, පඤ්ඤාය, උපනිස්සය-. පඨමස්ස ඣානස්ස පරිකම්මං පඨමස්ස ඣානස්ස උපනිස්සය-. චතුත්ථස්ස ඣානස්ස-. දිබ්බස්ස චක්ඛුස්ස පරිකම්මං-. දිබ්බාය සොත-. ඉද්ධි-. චෙතො-. පුබ්බෙනි-. යථා-. අනාගතංසඤාණස්ස පරිකම්මං-. අනාගතංසඤාණස්ස උපනිස්සය-."
                    },
                    {
                        "type": "paragraph",
                        "text": "න රූපාවචරො ධම්මො න රූපාවචරස්ස ධම්මස්ස පුරෙජාත-. ආරම්මණපුරෙ-. වත්ථුපුරෙ-. ආරම්මණපුරෙ චක්ඛුං, වත්ථුං, අනිච්චතො-. දොමනස්සං-. රූපායතනං චක්ඛුවිඤ්ඤාණස්ස ඵොට්ඨබ්බායතනං-. වත්ථු-. පුරෙ-. චක්ඛායකනං චක්ඛුවිඤ්ඤාණස්ස-. කායායතනං-. වත්ථු න රූපාවචරානං ඛන්ධානං පුරෙජාත-. න රූපාවචරො රූපාවචරස්ස පුරෙජාත-. ආරම්මණපුරෙ වත්ථුපුරෙ, - ආම්මණපුරෙ: දිබ්බෙන චක්ඛුනා රූපං පස්සති, දිබ්බාය සොත-. වත්ථුපුරෙ-. වත්ථුරූපාවචරානං ඛන්ධානං පුරෙජාත-. පච්ඡාජාතපච්චයා ද්වෙ-. ආසෙවන පච්චයා. තීණි."
                    },
                    {
                        "type": "paragraph",
                        "text": "රූපාවචරො ධම්මො රූපාවචරස්ස ධම්මස්ස කම්ම-. සහජාතා, නානාඛණිකා, සහජාතා රූපාවචරා චෙතනා සම්පයුත්තකානං ඛන්ධානං කම්මපච්ච-. නානාඛණිකා රූපාවචරා චෙතනා විපාකානං රූපාවචරානං ඛන්ධානං කම්මපච්ච-. රූපාවචරො න රූපාවචරස්ස කම්ම-. සහජාතා, නානාඛණිකා, සහජාතා රූපාවචරා චෙතනා චිත්තසමුට්ඨානානාං කම්ම-. පටිසන්ධි-. නානාඛණිකා රූපාවචරා චෙතනා කටත්තා-. කම්ම-. රූපාවචරො රූපාවචරස්ස ච න රූපාවචරස්ස ච කම්ම-. සහජාතා, නානාඛණිකා, සහජාතා රූපාවචරා චෙතනා සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානං-. කම්මපච්ච-. පටිසන්ධි-. නානාඛණිකා රූපාවචරා චෙතනා විපාකානං රූපාවචරානං ඛන්ධානං කටත්තා ච, කම්මපච්ච-. න රූපාවචරො න රූපාවචරස්ස කම්ම-."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1153,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සහජාතා, නානාඛණිකා. සහජාතා න රූපාවචරා චෙතනා සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානඤ්ච-. කම්ම-. පටිසන්ධි-. නානාඛණිකා න රූපාවචරා චෙතනා විපාකානං න රූපාවචරානං ඛන්ධානං කටත්තා ච-. කම්ම-. විපාකපච්ච-. චත්තාරි, ආහාරපච්ච-. චත්තාරි. මග්ගපච්ච-. චත්තාරි. සම්පයුත්තපච්ච-. ද්වෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "රූපාවචරො ධම්මො න රූපාවචරස්ස විප්පයුත්ත, සහජාතං, පච්ඡාජාතං, (සංඛිත්තං.) න රූපාවචරො න රූපාවචරස්ස විප්පයුත්ත-. සහජාතං, පුරෙජාතං, පච්ඡාජාතං, (සංඛිත්තං.) න රූපාවචරො රූපාවචරස්ස විප්පයුත්ත-. සහජාතං, පුරෙජාතං, - සහජාතං. පටිසන්ධික්ඛණෙ වත්ථු රූපාවචරානං ඛන්ධානං විප්පයුත්ත-. පුරෙජාතං වත්ථු රූපාවචරානං ඛන්ධානං විප්පයුත්ත පච්චයෙන පච්චයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "රූපාවචරො රූපාවචරස්ස අත්ථි-. (පටිච්චසදිසං,) රූපාවචරො න රූපාවචස්ස අත්ථි-. සහජාතං, පුරෙජාතං, පච්ඡාජාතං, රූපාවචරො රූපාවචරස්ස ච න රූපාවචරස්ස ච අත්ථි, (පටිච්ච සදිසං,) න රූපාවචරො න රූපාවචරස්ස අත්ථි-. සහජාතං, පුරෙජාතං, පච්ඡාජාතං, ආහාරං, ඉන්ද්රියං, (සංඛිත්තං.) න රූපාවචරො රූපාවචරස්ස අත්ථි-. සහජාතං, පුරෙජාතං, සහජාතං පටිසන්ධික්ඛණෙ වත්ථු රූපාවචරානං ඛන්ධානං අත්ථි-. පුරෙජාතං-. දිබ්බෙන චක්ඛුනා, දිබ්බාය සොත-. වත්ථු රූපාවචරානං ඛන්ධානං අත්ථි-. රූපාවචරො ච න රූපාවචරො ච-. රූපාවචරස්ස අත්ථි-. සහජාතං, පුරෙජාතං, සහජාතො රූපාවචරො එකො ඛන්ධො ච වත්ථු ච තිණ්ණන්නං ඛන්ධානං අත්ථි-. ද්වෙ-. පටිසන්ධි-. රූපාවචරො ච න රූපාවචරො ච-. න රූපාවචරස්ස අත්ථි-. සහජාතං, පච්ඡාජාතං, ආහාරං, ඉන්ද්රියං, සහජාතා රූපාවචරා ඛන්ධා ච මහාභූතා ච චිත්තසමුට්ඨානානං-. අත්ථි-. ද්වෙ-. පටිසන්ධි-. පච්ඡාජාතා රූපාවචරා ඛන්ධා ච කබළීකාරො ආහාරො ච පුරෙජාතස්ස ඉමස්ස කායස්ස අත්ථි-. පච්ඡාජාතා රූපාවචරා ඛන්ධා ච රූපජීවිතින්ද්රියඤ්ච කටත්තා-. අත්ථිපච්ච-. නාත්ථිපච්ච-. විගතපච්ච-. අවිගතපච්ච-."
                    },
                    {
                        "type": "paragraph",
                        "text": "හෙතුයා චත්තාරි, ආරම්මණෙ චත්තාරි, අධිපතියා චත්තාරි, අනන්තරෙ චත්තාරි, සමනන්තරෙ චත්තාරි, සහජාතෙ සත්ත, අඤ්ඤමඤ්ඤෙ ඡ, නිස්සයෙ සත්ත, උපනිස්සයෙ චත්තාරි, පුරෙජාතෙ ද්වෙ, පච්ඡාජාතෙ ද්වෙ, ආසෙවනෙ තීණි, කම්මෙ චත්තාරි, විපාකෙ චත්තාරි, ආහාරෙ චත්තාරි, ඉන්ද්රියෙ චත්තාරි, ඣානෙ චත්තාරි, මග්ගෙ චත්තාරි, සම්පයුත්තෙ ද්වෙ, විප්පයුත්තෙ තීණි, අත්ථියා සත්ත, නත්ථියා චත්තාරි, විගතෙ චත්තාරි, අවිගතෙ සත්ත."
                    },
                    {
                        "type": "paragraph",
                        "text": "රූපාවචරො ධම්මො රූපාවචරස්ස ධම්මස්ස ආරම්මණපච්ච-. සහජාතපච්ච උපනිස්සයපච්ච-. කම්මපච්ච-. රූපාවචරො න"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1154,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "රූපාවචරස්ස ආරම්මණ, සහජාත, උපනිස්සය, පච්ඡාජාත, කම්මපච්ච-. රූපාවචරො රූපාවචරස්ස ච න රූපාවචරස්ස ච සහජාතපච්ච-. කම්මපච්ච-. න රූපාවචරො න රූපාවචරස්ස ආරම්මණ, සහජාත, උපනිස්සය, පුරෙජාත, පච්ඡාජාත, කම්මපච්ච-. ආහාරපච්ච-. ඉන්ද්රිය, න රූපාවචරො රූපාවචරස්ස ආරම්මණ, සහජාත, උපනිස්සය, පුරෙජාත-. රූපාවචරො ච න රූපාවචරො ච ධම්මා රූපාවචරස්ස-. සහජාත, පුරෙජාතං, රූපාවචරො ච න රූපාවචරො ච න රූපාවචරස්ස සහජාතං, පච්ඡාජාතං, ආහාරං, ඉන්ද්රියං."
                    },
                    {
                        "type": "paragraph",
                        "text": "න හෙතුයා සත්ත, නාරම්මණෙ සත්ත, නාධිපතියා සත්ත, නානන්තරෙ සත්ත, න සමනන්තරෙ සත්ත, න සහජාතෙ ඡ, න අඤ්ඤමඤ්ඤෙ ඡ, න නිස්සයෙ ඡ, න උපනිස්සයෙ සත්ත, න පුරෙජාතෙ සත්ත, න පච්ඡාජාතෙ සත්ත, න සම්පයුත්තෙ ඡ, න විප්පයුත්තෙ පඤ්ච, නො අත්ථියා පඤ්ච, නො නත්ථියා සත්ත, නො විගතෙ සත්ත, නො අවිගතෙ පඤ්ච, හෙතුපච්චයා නාරම්මණෙ චත්තාරි, නාධිපතියා චත්තාරි, නානන්තරෙ, න සමනන්තරෙ චත්තාරි, න අඤ්ඤමඤ්ඤෙ ද්වෙ, න උපනිස්සයෙ චත්තාරි, න සම්පයුත්තෙ ද්වෙ, න විප්පයුත්තෙ ද්වෙ, නො නත්ථියා චත්තාරි, නො විගතෙ චත්තාරි, න හෙතුපච්චයා ආරම්මණෙ චත්තාරි, අධිපතියා චත්තාරි, (අනුලොම මාතිකා.) අවිගතෙ සත්ත."
                    },
                    {
                        "type": "centered",
                        "text": "රූපාවචර දුකං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "95. අරූපාවචර දුකං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "අරූපාවරං ධම්මං පටිච්ච අරූපාවචරො ධම්මො උප්පජ්ජති හෙතුපච්චයා, අරූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. පටිසන්ධික්ඛණෙ, අරූපාවචරං ධම්මං පටිච්ච න අරූපාවචරො ධම්මො-. හෙතුපච්චයා, අරූපාවචරෙ ඛන්ධෙ පටිච්ච චිත්තසමුට්ඨානං-. අරූපාවචරං ධම්මං පටිච්ච අරූපාවචරො ච න අරූපාවචරො ච-. හෙතුපච්චයා-. අරූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච-. ද්වෙ ඛන්ධෙ-. න අරූපාවචරං ධම්මං-. න අරූපාවචරො-. හෙතු-. න අරූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච-. ද්වෙ-. පටිසන්ධික්ඛණෙ-. න අරූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, කටත්තා ච-. ද්වෙ ඛන්ධෙ පටිච්ච වත්ථු, වත්ථුං පටිච්ච ඛන්ධා, එකං මහාභූතං, අරූපාවචරඤ්ච න අරූපාවචරඤ්ච ධම්මං පටිච්ච න අරූපාවචරො-. හෙතුපච්චයා. අරූපාවචරෙ ඛන්ධෙ ච මහාභූතෙ ච පටිච්ච චිත්තසමුට්ඨානං-. (සංඛිත්තං.) හෙතුයා පඤ්ච, ආරම්මණෙ ද්වෙ, අධිපතියා පඤ්ච, අනන්තරෙ ද්වෙ, සමනන්තරෙ"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1155,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ද්වෙ, සහජාතෙ පඤ්ච, අඤ්ඤමඤ්ඤෙ ද්වෙ, නිස්සයෙ පඤ්ච, උපනිස්සයෙ ද්වෙ, පුරෙජාතෙ ද්වෙ, ආසෙවනෙ ද්වෙ, කම්මෙ පඤ්ච, විපාකෙ පඤ්ච, ආහාරෙ පඤ්ච, අවිගතෙ පඤ්ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "න අරූපාවරං ධම්මං පටිච්ච න අරූපාවචරො ධම්මො-. න හෙතුපච්චයා, අහෙතුකං න අරූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, චිත්තසමුට්ඨානඤ්ච-. ද්වෙ ඛන්ධෙ-. අහෙතුකපටිසන්ධි-. (යාව අසඤ්ඤසත්තා,) විචිකිච්ඡාසහගතෙ උද්ධච්චසහගතෙ-. විචිකිච්ඡා-. උද්ධච්ච, මොහො, නාරම්මණෙ තීණි, අරූපාවචරං ධම්මං-. අරූපාවචරො ධම්මො-. නාධිපති, අරූපාවචරෙ ඛන්ධෙ පටිච්ච අරූපාවචරාධිපති, විපාකං අරූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. පටිසන්ධි-. න අරූපාවචරං ධම්මං-. න අරූපාවචරො-. නාධිපති-. න අරූපාවරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච-. ද්වෙ ඛන්ධෙ-. පටිසන්ධි-. (යාව අසඤ්ඤසත්තා,) නානන්තරපච්චයා න උපනිස්සයපච්චයා, අරූපාවචරං ධම්මං-. අරූපාවචරො-. න පුරෙජාත-. අරූපෙ අරූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, පටිසන්ධි-. (මූලං-.) අරූපාවචරෙ ඛන්ධෙ පටිච්ච චිත්තසමුට්ඨානං, න අරූපාවචරං ධම්මං-. න අරූපාවචරො-. න පුරෙජාත-. අරූපෙ න රූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. පටිසන්ධි-. (යාව අසඤ්ඤත්තා.) අරූපාවචරඤ්ච න අරූපාවචරඤ්ච ධම්මං-. න අරූපාවචරො-. න පුරෙජාත-. අරූපාවචරෙ ඛන්ධෙ ච මාහභුතෙ ච පටිච්ච චිත්තසමුට්ඨානං-. න පච්ඡාජාතපච්චයා. අරූපාවචරං ධම්ම පටිච්ච අරූපාවචරො-. නාසෙවන-. විපාකං අරූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. පටිසන්ධි-. අරූපාවචරං-. න අරූපාවචරො-. නාසෙවන-. අරූපාවචරෙ ඛන්ධෙ පටිච්ච චිත්තසමුට්ඨානං-. න අරූපාවචරං ධම්මං-. න අරූපාවචරො-. නාසෙවන-. න අරූපාවචරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානං-. ද්වෙ ඛන්ධෙ-. (යාව සඤ්ඤසත්තා) අරූපාවචරඤ්ච න අරූපාවචරඤ්ච ධම්මං-. න අරූපාවචරො-. නාසෙවනපච්චයා. අරූපාවචරෙ ඛන්ධෙ ච මහාභූතෙ ච පටිච්ච චිත්තසමුට්ඨානං-. (සංඛිත්තං.) න හෙතුයා එකං, නාරම්මණෙ තීණි, නාධිපතියා ද්වෙ, නානන්තරෙ තීණි, න සමනන්තරෙ තීණි. න අඤ්ඤමඤ්ඤෙ, න උපනිස්සයෙ, තීණි. න පුරෙජාතෙ තීණි, න පච්ඡාතෙ පඤ්ච, න ආසෙවනෙ චත්තාරි, න කම්මෙ ද්වෙ, න විපාකෙ පඤ්ච, නාහාරෙ එකං, න ඉන්ද්රියෙ එකං, න ඣානෙ එකං, න මග්ගෙ එකං, න සම්පයුත්තෙ තීණි, න විප්පයුත්තෙ ද්වෙ, නො නත්ථියා තීණි, නො විගතෙ තීණි, (ඉතරෙ ද්වෙ ගණනාපි සහජාතවාරොපි කාතබ්බා.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අරූපාවචරං ධම්මං අරූපාවචරො ධම්මො උප්පජ්ජති හෙතුපච්චයා, තීණි. (පටිච්ච සදිසා.) න අරූපාවචරං ධම්මං පච්චයා"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1156,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "න අරූපාවචරො-. හෙතුපච්චයා, න අරූපාවචරං එකං ඛන්ධං-. (යාව අජ්ඣත්තිකා මහාභූතා,) න අරූපාවචරං ධම්මං පච්චයා අරූපාවචරො ධම්මො-. හෙතුපච්චයා. වත්ථුං පච්චයා අරූපාවචරා ඛන්ධා, න අරූපාවචරං ධම්මං-. අරූපාවචරො ච න අරූපාවචරො ච ධම්මා-. හෙතුපච්චයා. වත්ථුං පච්චයා අරූපාවචරා ඛන්ධා, මහාභූතෙ පච්චයා චිත්තසමුට්ඨානං-. අරූපාවචරඤ්ච න අරූපාවචරඤ්ච-. අරූපාවචරො-. හෙතුපච්චයා. අරූපාවචරං එකං ඛන්ධඤ්ච වත්ථුං ච පච්චයා තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. අරූපාවචරඤ්ච න අරූපාවචරඤ්ච-. න අරූපාවචරො-. හෙතු පච්චයා. අරූපාවචරෙ ච ඛන්ධෙ ච මහාභූතෙ ච පච්චයා චිත්තසමුට්ඨානං-. අරූපාවචරඤ්ච න අරූපාවචරඤ්ච-. අරූපාවචරො ච න අරූපාවචරො ච-. හෙතුපච්චයා, අරූපාවචරං එකං ඛන්ධඤ්ච වත්ථුං ච පච්චයා තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. අරූපාවචරෙ ඛන්ධෙ ච මහාභූතෙ ච පච්චයා චිත්තසමුට්ඨානං-. හෙතුයා නව, ආරම්මණෙ චත්තාරි, අධිපතියා නව, අනන්තරෙ චත්තාරි, සමනන්තරෙ චත්තාරි, සහජාතෙ නව, අඤ්ඤමඤ්ඤෙ චත්තාරි, නිස්සයෙ නව, උපනිස්සයෙ චත්තාරි, පුරෙජාතෙ චත්තාරි, ආසෙවනෙ චත්තාරි, කම්මෙ නව. විපාකෙ ද්වෙ, අවිගතෙ නව."
                    },
                    {
                        "type": "paragraph",
                        "text": "න අරූපාවචරං ධම්මං පච්චයා න අරූපාවචරො ධම්මො උප්පජ්ජති න හෙතුපච්චයා, අහෙතුකං න අරූපාවචරං එකං ඛන්ධං-. (යාව අසඤ්ඤසත්තා.) චක්ඛායතනං පච්චයා චක්ඛුවිඤ්ඤාණං, කායාය-. වත්ථුං පච්චයා අහෙතුකා න අරූපාවචරා ඛන්ධා, විචිකිච්ඡාසහගතෙ උද්ධච්චසහගතෙ ඛන්ධෙ පච්චයා විචිකිච්ඡාසහගතො උද්ධච්ච-. මොහො, නාරම්මණපච්චයා: තීණි අරූපාවචරං ධම්මං පච්චයා අරූපාවචරො-. නාධිපතිපච්චයා. අරූපාවචරෙ ඛන්ධෙ පච්චයා අරූපාවචරාධිපති, විපාකං අරූපාවචරං එකං ඛන්ධං-. පටිසන්ධි-. න අරූපාවචරං-. න අරූපාවචරො-. නාධිපති-. න අරූපාවචරං එකං ඛන්ධං-. පටිසන්ධි-. (යාව අසඤ්ඤසත්තා) න හෙතුයා එකං, නාරම්මණෙ තීණි, නාධිපතියා චත්තාරි, නානන්තරෙ තීණි, න සමනන්තරෙ, න අඤ්ඤමඤ්ඤෙ, න උපනිස්සයෙ තීණි, න පුරෙජාතෙ චත්තාරි, න පච්ඡාජාතෙ නව, නාසෙවනෙ චත්තාරි, න කම්මෙ චත්තාරි, න විපාකෙ නව, නාහාරෙ එකං, න ඉන්ද්රියෙ එකං, න ඣානෙ එකං, න මග්ගෙ එකං, න සම්පයුත්තෙ තීණි, න විප්පයුත්තෙ ද්වෙ, නො නත්ථියා තීණි, නො විගතෙ තීණි, (ඉතරෙ ද්වෙ ගණනාපි නිස්සයවාරොපි කාතබ්බා.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "අරූපාවචරං ධම්මං සංසට්ඨො අරූපාවචරො හෙතුපච්චයා. අරූපාවචරං එකං ඛන්ධං සංසට්ඨා තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. පටිසන්ධි-. න අරූපාවචරං ධම්මං සංසට්ඨො න අරූපාවචරො ධම්මො-. හෙතු පච්චයා. න අරූපාවචරං එකං ඛන්ධං සංසට්ඨා තයො ඛන්ධා, ද්වෙ"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1157,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඛන්ධෙ-. පටිසන්ධි-. හෙතුයා ද්වෙ, අවිගතෙ ද්වෙ, න හෙතුයා එකං, නාධිපතියා ද්වෙ, න පුරෙජාතෙ ද්වෙ, න පච්ඡාජාතෙ ද්වෙ, න ආසෙවනෙ ද්වෙ, න කම්මෙ ද්වෙ, න විපාකෙ ද්වෙ, න ඣානෙ එකං, න මග්ගෙ එකං, න විප්පයුත්තෙ ද්වෙ, (එවං ඉතරෙ ද්වෙ ගණනාපි සම්පයුත්තවාරොපි කාතබ්බො.) අරූපාවචරො ධම්මො අරූපාවචරස්ස ධම්මස්ස හෙතුපච්චයා. අරූපාවචරා හෙතු සම්පයුත්තකානං ඛන්ධානං හෙතුපච්චයා. පටිසන්ධි-. (මූලං-.) අරූපාවචරා හෙතු චිත්තසමුට්ඨානානං රූපානං හෙතුපච්චයා. (මූලං-.) අරූපාවචරා හෙතු සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච-. හෙතුපච්චයා. න අරූපාවචරො න අරූපාවචරස්ස හෙතුපච්චයා. න අරූපාවචරා හෙතු සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච හෙතුපච්චයා. පටිසන්ධි-."
                    },
                    {
                        "type": "paragraph",
                        "text": "අරූපාවචරො අරූපාවචරස්ස ආරම්මණ-. ආකාසානඤ්චායතනං විඤ්ඤාණඤ්චායතනස්ස ආරම්මණ-. ආකිඤ්චඤ්ඤායතනං නෙවසඤ්ඤා-. නාසඤ්ඤායතනස්ස ආරම්මණ-. අරූපාවචරො න අරූපාවචරස්ස ආරම්මණ-. ආකාසානඤ්චායතනං පච්චවෙක්ඛති, විඤ්ඤාණඤ්චායතනං, ආකිඤ්චඤ්ඤායතනං, නෙවසඤ්ඤානාසඤ්ඤායතනං පච්චවෙක්ඛති, අරූපාවචරෙ ඛන්ධෙ අනිච්චතො-. දොමනස්සං උප්පජ්ජති, චෙතොපරියඤාණෙන අරූපාවචරචිත්තසමඞ්ගිස්ස චිත්තං ජානාති, අරූපාවචරා ඛන්ධා චෙතොපරියඤාණස්ස පුබ්බෙනි-. යථාකම්මූ-. අනාගතං-. ආවජ්ජනාය ආරම්මණපච්චයා. න අරූපාවචරො න අරූපාවචරස්ස ආරම්මණ-. දානං සීලං, උපොසථකම්මං කත්වා පච්චවෙක්ඛති, අස්සාදෙති, තං ආරබ්භ රාගො දොමනස්සං-. පුබ්බෙ සුචිණ්ණානි-. ඣානා-. අරියා මග්ගා වුට්ඨහිත්වා මග්ගං පච්ච-. ඵලං පච්ච-. නිබ්බානං පච්ච-. නිබ්බානං ගොත්රභුස්ස, වොදානස්ස, මග්ගස්ස, ඵලස්ස ආවජ්ජනාය ආරම්මණ-. අරියා පහීනෙ කිලෙසෙ පච්ච-. වික්ඛම්භිත-. පුබ්බෙ-. චක්ඛුං, වත්ථුං, න අරූපාවචරෙ ඛන්ධෙ අනිච්චතො-. දොමනස්සං උප්පජ්ජති, දිබ්බෙන චක්ඛුනා රූපං-. දිබ්බායසොත-. චෙතොපරියඤාණෙන න අරූපාවචර චිත්තසමඞ්ගිස්ස චිත්තං ජානාති, රූපායතනං චක්ඛු-. ඵොට්ඨබ්බායතනං-. න අරූපාවචරා ඛන්ධා-. ඉද්ධි-. චෙතො-. පුබ්බෙනි-. යථා-. අනාගතං-. ආවජ්ජනාය ආරම්මණ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "අරූපාවචරො අරූපාවචරස්ස අධිපති-. සහජාතාධිපති, අරූපාවචරාධිපති සම්පයුත්තකානං ඛන්ධානං අධිපති-. අරූපාවචරො න අරූපාවචරස්ස අධිපති-. අරූපාවචරො න අරූපාවචස්ස අධිපති-. ආරම්මණාධිපති, සහජාතාධිපති, ආරම්මණාධිපති ආකාසානඤ්චායතනං ගරුං කත්වා පච්ච, නෙවසඤ්ඤානාසඤ්ඤායතනං ගරුං කත්වා පච්චවෙක්ඛති, අරූපාවචරෙ ඛන්ධෙ ගරුං කත්වා අස්සාදෙති, තං ගරුං කත්වා රාගො-. දිට්ඨි උප්පජ්ජති, සහජාතාධිපති, අරූපාවචරාධිපති"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1158,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "චිත්තසමුට්ඨානං අධිපති-. (මූලං.) අරූපාවචරාධිපති සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච අධිපති-. න අරූපාවචරො න අරූපාවචරස්ස අධිපති-. ආරම්මණාධිපති, සහජාතාධිපති, - ආරම්මණාධිපති දානං-. සීලං-. උපොසථකම්මං කත්වා, තං ගරුං කත්වා පච්ච-. අස්සාදෙති, තං ගරුං කත්වා රාගො-. දිට්ඨි-. පුබ්බෙසු-. ඣානා-. අරියා මග්ගා වුට්ඨහිත්වා මග්ගං ගරුං කත්වා පච්ච-. ඵලං-. නිබ්බානං නිබ්බානං ගොත්රභුස්ස, වොදානස්ස, මග්ගස්ස, ඵලස්ස අධිපති-. චක්ඛුං, වත්ථුං, න අරූපාවචරෙ ඛන්ධෙ ගරුං කත්වා අස්සාදෙති, තං ගරුං කත්වා රාගො-. දිට්ඨි උප්පජ්ජති, සහජාතාධිපති න අරූපාවචරාධිපති සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච අධිපති-."
                    },
                    {
                        "type": "paragraph",
                        "text": "අරූපාවචරො අරූපාවචරස්ස අනන්තරපච්චයා, පුරිමා පුරිමා අරූපාවචරා ඛන්ධා පච්ඡිමානං පච්ඡිමානං අරූපාවචරානං ඛන්ධානං අනන්තර පච්චයා, අඅරූපාවචරො අරූපාවචරස්ස අනන්තරපච්ච-. අරූපාවචරං චුති චිත්තං න අරූපාවචරස්ස උපපත්තිචිත්තසස්ස-. අරූපාවචරං භවඞ්ගං ආවජ්ජනාය-. අරූපාවචරා ඛන්ධා න අරූපාවචරස්ස වුට්ඨානස්ස-. නිරොධා වුට්ඨහන්තස්ස, නෙවසඤ්ඤානාසඤ්ඤායතනං ඵලසමාපත්තියා අනන්තර පච්චයා, අරූපාවචරො න අරූපාවචරස්ස අනන්තර-. පුරිමා පුරිමා න අරූපාවචරා ඛන්ධා පච්ඡිමානං පච්ඡිමානං ඛන්ධානං අනන්තරපච්චයා, අනුලොමං ගොත්රභුස්ස, අනුලොමං ඵලසමාපත්තියා අනන්තර-. න අරූපාවචරරො අරූපාවචරස්ස අනන්තරපච්චයා න අරූපාවචරං චුතිචිත්තං අරූපාවචරස්ස උපපත්තිචිත්තස්ස අනන්තර-. න අරූපාවචරා ඛන්ධා අරූපාවචරස්ස වුට්ඨානස්ස අනන්තරපච්චයා, අකාසානඤ්චායතනස්ස පරිකම්මං ආකාසානඤ්චායතනස්ස අනන්තරපච්චයා. විඤ්ඤාණඤ්චායතනස්ස, ආකිඤ්චඤ්ඤායතනස්ස, නෙවසඤ්ඤානාසඤ්ඤායතනස්ස පරිකම්මං නෙවසඤ්ඤානාසඤ්ඤායතනස්ස අනන්තරපච්චයා සමනන්තරපච්චයා, සහජාතපච්චයා, පඤ්ච, අඤ්ඤමඤ්ඤපච්චයා, ද්වෙ, නිස්සයපච්චයා, සත්ත."
                    },
                    {
                        "type": "paragraph",
                        "text": "අරූපාවචරො අරූපාවචරස්ස උපනිස්සයපච්චයා, අනන්තරූ-. පකතූ-. පකතූපනිස්සයො-. ආකාසානඤ්චායතනං විඤ්ඤාණඤ්චායතනස්ස උපනිස්සය-. විඤ්ඤාණඤ්චායතනං ආකිඤ්චඤ්ඤායතනස්ස, ආකිඤ්චඤ්ඤායතනං නෙවසඤ්ඤානාසඤ්ඤායතනස්ස උපනිස්සයපච්චයා, අරූපාවචරො න අරූපාවචරස්ස උපනිස්සය-. ආරම්මණූපනිස්සයො, අනන්තරූ-. පකතූ, - පකතූප-. අරූපාවචරං සද්ධං උපනිස්සාය දානං දෙති, සීලං-. උපොසථ-. න අරූපාවවචරං ඣානං, විපස්සනං, මග්ගං, අභිඤ්ඤං, සමාපත්තිං-. මානං ජප්පෙති, දිට්ඨිං ගණ්හාති, අරූපාවචරං සීලං, පඤ්ඤං උපනිස්සාය දානං දෙති, සමාපත්තිං-. මානං ජප්පෙති, දිට්ඨිං ගණ්හාති, අරූපාවචරා සද්ධා පඤ්ඤා, න අරූපාවචරාය සද්ධාය, පඤ්ඤාය-."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1159,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "රාගස්ස, පත්ථනාය කායිකස්ස සුඛස්ස, දුක්ඛස්ස, මග්ගස්ස, ඵලසමාපත්තියා උපනිස්සය-. න අරූපාවචරො ධම්මො න අරූපාවචරස්ස-. උපනිස්සය-. ආරම්මණූ-. අනන්තරූ-. පකතූ, - පකතූප-. න අරූපාවචරං සද්ධං උපනිස්සාය දානං දෙති, සීලං-. උපොසථ-. න අරූපාවචරං ඣානං, විපස්සනං, මග්ගං, අභිඤ්ඤං, සමාපත්තිං-. මානං ජප්පෙති, දිට්ඨිං ගණ්හාති, න අරූපාවචරං සීලං, පඤ්ඤං, රාගං, පත්ථනං, කායිකං සුඛං, කායිකං දුක්ඛං, උතුං, භොජනං, සෙනාසනං උපනිස්සාය දානං දෙති, සමාපත්තිං උප්පාදෙති, පාණං හන්ති, සංඝං භින්දති, න අරූපාවචරා සද්ධා සෙනාසනං න අරූපාවචරාය සද්ධාය, පත්ථනාය, කායිකස්ස සුඛස්ස, කායිකස්ස දුක්ඛස්ස, මග්ගස්ස, ඵලසමාපත්තියා උපනිස්සය-. න අරූපාවචරො අරූපාවචරස්ස උපනිස්සය-. අනන්තරූ-. පකතූ, - පකතූප-. ආකාසානඤ්චායතනස්ස පරිකම්මං ආකාසානඤ්චායතනස්ස උපනිස්සය, -පෙ- නෙවසඤ්ඤානාසඤ්ඤායතනස්ස පරිකම්මං නෙවසඤ්ඤානාසඤ්ඤායතනස්ස උපනිස්සය-."
                    },
                    {
                        "type": "paragraph",
                        "text": "න අරූපාවචරො න අරූපාවචරස්ස පුරෙජාත-. ආරම්මණපුරෙ-. වත්ථුපුරෙ ආරම්මණපුරෙ: චක්ඛුං, වත්ථුං, අනිච්චතො-. දොමනස්සං උප්පජ්ජති, දිබ්බෙන චක්ඛුනා රූපං, දිබ්බාය සොත-. රූපායතනං චක්ඛුවිඤ්ඤාණස්ස, ඵොට්ඨබ්බායතනං කාය-. වත්ථුපුරෙ-. චක්ඛායතනං චක්ඛුවිඤ්ඤාණස්ස, කායායතනං-. වත්ථු න අරූපාවචරානං ඛන්ධානං පුරෙජාත-. න අරූපාවචරො අරූපාවචරස්ස පුරෙජාත-. වත්ථුපුරෙජාතං වත්ථු අරූපාවචරානං ඛන්ධානං පුරෙජාත-. පච්ඡාජාතපච්චයා ද්වෙ-. ආසෙවනපච්චයා, තීණි, අරූපාවචරො අරූපාවචරස්ස කම්මපච්චයා, සහජාතා, නානාඛණිකා -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "අරූපාවචරො න අරූපාවචරස්ස කම්මපච්චයා, අරූපාවචරා චෙතනා චිත්තසමුට්ඨානානං අරූපාවචරානං ඛන්ධානං කම්මපච්චයා, (මූලං) අරූපාවචරා චෙතනා සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානඤ්ච-. කම්ම-. න අරූපාවචරො න අරූපාවචරස්ස කම්ම-. සහජාතා, නානාඛණිකා, සහජාතා න අරූපාවචරා චෙතනා සම්පයුත්තකානං ඛන්ධානං (සංඛිත්තං) අරූපාවචරො අරූපාවචරස්ස විපාකපච්චයා න අරූපාවචරො න අරූපාවචරස්ස විපාකපච්චයා, ආහාරපච්චයා, චත්තාරි, ඉන්ද්රියපච්චයා, චත්තාරි, ඣානපච්චයා, චත්තාරි, මග්ගපච්චයා, චත්තාරි, සම්පයුත්තපච්චයා, ද්වෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "අරූපාවචරො න අරූපාවචරස්ස විප්පයුත්ත-. සහජාතං-. පච්ඡාජාතං-. න අරූපාවචරො න අරූපාවචරස්ස විප්පයුත්ත-. සහජාතං, පුරෙජාතං, පච්ඡාජාතං-. න අරූපාවචරො අරූපාවචරස්ස විප්පයුත්ත-. පුරෙජාතං වත්ථු අරූපාවචරානං ඛන්ධානං විප්පයුත්ත-."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1160,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අරූපාවචරො අරූපාවචරස්ස අත්ථි-. සහජාත-. අරූපාවචරො න අරූපාවචරස්ස අත්ථිපච්චයා, සහජාතං, පච්ඡාජාතං. අරූපාවචරො අරූපාවචරස්ස ච න අරූපාවචරස්ස ච අත්ථි-. සහජාතං-. න අරූපාවචරො න අරූපාවචරස්ස අත්ථි-. සහජාතං, පුරෙජාතං, පච්ඡාජාතං, ආහාරං, ඉන්ද්රියං-. න අරූපාවචරො අරූපාවචරස්ස අත්ථි-. පුරෙජාතං වත්ථු අරූපාවචරානං ඛන්ධානං අත්ථිපච්චයා, අරූපාවචරො ච න අරූපාවචරො ච අරූපාවචරස්ස අත්ථිපච්චයා, සහජාතං, පුරෙජාතං-. සහජාතො අරූපාවචරො එකො ඛන්ධො ච වත්ථු ච තිණ්ණන්නං ඛන්ධානං අත්ථිපච්චයා, ද්වෙ ඛන්ධා-. අරූපාවචරො ච න අරූපාවචරො ච න අරූපාවචරස්ස අත්ථිපච්චයා, සහජාතං, පච්ඡාජාතං, ආහාරං, ඉන්ද්රියං-. සහජාතා අරූපාවචරා ඛන්ධා ච මහාභූතා ච චිත්තසමුට්ඨානා-. අත්ථි-. පච්ඡාජාතා අරූපාවචරා ඛන්ධා ච කබළීකාරො ආහාරො ච ඉමස්ස අත්ථිපච්චයා පච්ඡාජාතා අරූපාවචරා ඛන්ධා ච රූපජීවිතින්ද්රියඤ්ච කටත්තා-. අත්ථි, නත්ථිපච්චයා, විගතපච්චයා, අවිගතපච්චයා."
                    },
                    {
                        "type": "paragraph",
                        "text": "හෙතුයා චත්තාරි, ආරම්මණෙ තීණි, අධිපතියා චත්තාරි, අනන්තරෙ චත්තාරි, සමනන්තරෙ චත්තාරි, සහජාතෙ පඤ්ච, අඤ්ඤමඤ්ඤෙ ද්වෙ, නිස්සයෙ සත්ත, උපනිස්සයෙ චත්තාරි, පුරෙජාතෙ ද්වෙ, පච්ඡාජාතෙ ද්වෙ, ආසෙවනෙ තීණි, කම්මෙ චත්තාරි, විපාකෙ ද්වෙ, ආහාරෙ චත්තාරි, ඉන්ද්රියෙ චත්තාරි, ඣානෙ චත්තාරි, මග්ගෙ චත්තාරි, සම්පයුත්තෙ ද්වෙ, විප්පයුත්තෙ තීණි, අත්ථියා සත්ත, නත්ථියා චත්තාරි, විගතෙ චත්තාරි, අවිගතෙ සත්ත."
                    },
                    {
                        "type": "paragraph",
                        "text": "අරූපාවචරො ධම්මො අරූපාචරස්ස-. ආරම්මණපච්චයා, සහජාත-. උපනිස්සයපච්චයා, කම්මපච්චයා, අරූපාවචරො න අරූපාවචරස්ස ආරම්මණ-. සහජාත-. උපනිස්සය-. පච්ඡාජාතපච්චයා, අරූපාවචරො අරූපාවචරස්ස ච න අරූපාවචරස්ස ච ධම්මස්ස සහජාතපච්චයා, න අරූපාවචරො න අරූපාවචරස්ස-. ආරම්මණ-. සහජාත-. උපනිස්සය-. පුරෙජාත-. පච්ඡාජාත-. කම්ම-. ආහාර-. ඉන්ද්රියපච්චයා, න අරූපාවචරො අරූපාවචරස්ස උපනිස්සය-. පුරෙජාතපච්චයා. අරූපාවචරො ච න අරූපාවචරො ච අරූපාවචරස්ස සහජාත-. පුරෙජාත-. අරූපාවරො ච න අරූපාවචරො ච-. න අරූපාවචරස්ස-. සහජාතං-. පච්ඡාජාතං-. ආහාරං-. ඉන්ද්රියං-. න හෙතුයා සත්ත, නාරම්මණෙ සත්ත, නාධිපතියා සත්ත, නානන්තරෙ සත්ත, න සමනන්තරෙ සත්ත, න සහජාතෙ පඤ්ච, න අඤ්ඤමඤ්ඤෙ පඤ්ච, න නිස්සයෙ පඤ්ච, න උපනිස්සයෙ සත්ත, න පුරෙජාතෙ ඡ, න පච්ඡාජාතෙ සත්ත, න සම්පයුත්තෙ පඤ්ච, න විප්පයුත්තෙ චත්තාරි, නො අත්ථියා චත්තාරි, නො නත්ථියා සත්ත, නො විගතෙ සත්ත, නො අවිගතෙ චත්තාරි, හෙතුපච්චයා නාරම්මණෙ චත්තාරි, නාධිපතියා චත්තාරි, නානන්තරෙ, න සමනන්තරෙ"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1161,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "චත්තාරි න අඤ්ඤමඤ්ඤෙ ද්වෙ, න උපනිස්සයෙ චත්තාරි, න සම්පයුත්තෙ ද්වෙ, න විප්පයුත්තෙ ද්වෙ, නො නත්ථියා චත්තාරි, නො විගතෙ චත්තාරි, න හෙතුපච්චයා ආරම්මණෙ තීණි, අධිපතියා චත්තාරි, (අනුලොමමාතිකා.) අවිගතෙ සත්ත."
                    },
                    {
                        "type": "centered",
                        "text": "අරූපාවචර දුකං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "96. පරියාපන්න දුකං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "පරියාපන්නං ධම්මං පටිච්ච පරියාපන්නො ධම්මො උප්පජ්ජති හෙතුපච්චයා, පරියාපන්නං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච-. ද්වෙ ඛන්ධෙ-. පටිසන්ධි. (යථා චූලන්තරදුකෙ ලොකියදුකං, එවං ඉමංපි දුකං කාතබ්බං. නින්නානාකරණං.)"
                    },
                    {
                        "type": "centered",
                        "text": "පරියාපන්න දුක්ඛං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "97. නිය්යානික දුකං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "නිය්යානිකං ධම්මං පටිච්ච නිය්යානිකො ධම්මො උප්පජ්ජති හෙතු පච්චයා නිය්යානිකං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. නිය්යානිකං ධම්මං පටිච්ච අනිය්යානිකො-. හෙතුපච්චයා-. නිය්යානිකෙ ඛන්ධෙ පටිච්ච චිත්තසමුට්ඨානං-. නිය්යානිකං ධම්මං පටිච්ච නිය්යානිකො ච අනිය්යානිකො ච-. හෙතුපච්චයා-. නිය්යානිකං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච ද්වෙ ඛන්ධෙ අනිය්යානිකං ධම්මං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච-. ද්වෙ ඛන්ධෙ-. අනිය්යානිකං ධම්මං පටිච්ච අනිය්යානිකො-. හෙතුපච්චයා-. අනිය්යානිකං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච-. ද්වෙ ඛන්ධෙ-. පටිසන්ධි. ඛන්ධෙ පටිච්ච වත්ථු, වත්ථුං පටිච්ච ඛන්ධා, එකං මහාභූතං-. නිය්යානිකඤ්ච අනිය්යානිකඤ්ච ධම්මං පටිච්ච අනිය්යානිකො ධම්මො-. හෙතුපච්චයා-. නිය්යානිකෙ ඛන්ධෙ ච මහාභූතෙ ච පටිච්ච චිත්තසමුට්ඨානං-. හෙතුයා පඤ්ච, ආරම්මණෙ ද්වෙ, අධිපතියා පඤ්ච, අනන්තරෙ, සමනන්තරෙ ද්වෙ, සහජාතෙ පඤ්ච, අඤ්ඤමඤ්ඤෙ ද්වෙ, නිස්සයෙ පඤ්ච, උපනිස්සයෙ ද්වෙ, පුරෙජාතෙ ද්වෙ, ආසෙවනෙ ද්වෙ, කම්මෙ පඤ්ච, විපාකෙ එකං, ආහාරෙ පඤ්ච, අවිගතෙ පඤ්ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "අනිය්යානිකං-. අනිය්යානිකො-. න හෙතුපච්චයා, අහෙතුකං අනිය්යානිකං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨා-. ද්වෙ-. අහෙතුක- පටිසන්ධි-. ඛන්ධෙ පටිච්ච වත්ථු, වත්ථුං පටිච්ච ඛන්ධා, එකං මහාභූතං-. (යාව අසඤ්ඤසත්තා,) විචිකිච්ඡාසහගතෙ උද්ධච්චසහගතෙ ඛන්ධෙ පටිච්ච විචිකිච්ඡා-. උද්ධච්ච-. මොහො-. නාරම්මණපච්චයා-. තීණි,"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1162,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "නිය්යානිකං-. නිය්යානිකො-. නාධිපති-. නිය්යානිකෙ ඛන්ධෙ පටිච්ච නිය්යානිකාධිපති, අනිය්යානිකං-. අනිය්යානිකො-. නාධිපති-. අනිය්යානිකං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච-. ද්වෙ ඛන්ධෙ-. පටිසන්ධි-. යාව (අසඤ්ඤසත්තා කාතබ්බා) නානන්තරපච්චයා. න සමනන්තරපච්චයා-. න අඤ්ඤමඤ්ඤපච්චයා-. නිය්යානිකං-. නිය්යානිකො-. න පුරෙජාත-. අරූපෙ නිය්යානිකං එකං ඛන්ධං-. නිය්යානිකං-. අනිය්යානිකො-. න පුරෙජාත-. නිය්යානිකෙ ඛන්ධෙ පටිච්ච චිත්තසමුට්ඨානං-. අනිය්යානිකං අනිය්යානිකො-. න පුරෙජාත-. අරූපෙ අනිය්යානිකං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. අනිය්යානිකෙ ඛන්ධෙ පටිච්ච චිත්තසමුට්ඨානං-. පටිසන්ධි-. (යාව අසඤ්ඤසත්තා.) නිය්යානිකඤ්ච අනිය්යානිකඤ්ච-. අනිය්යානිකො-. න පුරෙජාත-. නිය්යානිකෙ ඛන්ධෙ ච මහාභූතෙ ච පටිච්ච චිත්තසමුට්ඨානං-. න හෙතුයා එකං, නාරම්මණෙ තීණි, නාධිපතියා ද්වෙ, නානන්තරෙ තීණි, න උපනිස්සයෙ තීණි, න පුරෙජාතෙ චත්තාරි, න පච්ඡාජාතෙ පඤ්ච, න ආසෙවනෙ තීණි, න කම්මෙ ද්වෙ න විපාකෙ පඤ්ච, නාහාරෙ එකං, න ඉන්ද්රියෙ එකං, න ඣානෙ එකං, න මග්ගෙ එකං, න සම්පයුත්තෙ තීණි, න විප්පයුත්තෙ ද්වෙ, නො නත්ථියා තීණි, නො විගතෙ තීණි, (ඉතරෙ ද්වෙ ගණනාපි සහජාතවාරොපි කාතබ්බා.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "නිය්යානිකං ධම්මං පච්චයා නිය්යානිකො ධම්මො උප්පජ්ජති හෙතුපච්චයා-. තීණි (පටිච්ච සදිසා.) අනිය්යානිකං ධම්මං පච්චයා අනිය්යානිකො හෙතු-. අනිය්යානිකං එකං ඛන්ධං පච්චයා තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච-. (යාවඅජ්ඣත්තිකා මහාභූතා,) වත්ථුං පච්චයා අනිය්යානිකා ඛන්ධා-. අනිය්යානිකං-. නිය්යානිකො-. හෙතුපච්චයා-. වත්ථුං පච්චයා නිය්යානිකා ඛන්ධා, අනිය්යානිකං-. නිය්යානිකො ච අනිය්යානිකො ච-. හෙතුපච්චයා-. වත්ථුං පච්චයා නිය්යානිකා ඛන්ධා, මහාභූතෙ පච්චයා චිත්තසමුට්ඨානං-. නිය්යානිකඤ්ච අනිය්යානිකඤ්ච-. නිය්යානිකො-. හෙතුපච්චයා-. නිය්යානිකං එකං ඛන්ධඤ්ච වත්ථුං ච පච්චයා තයො ඛන්ධා-. ද්වෙ ඛන්ධෙ-. නිය්යානිකඤ්ච අනිය්යානිකඤ්ච-. අනිය්යානිකො-. හෙතුපච්චයා-. නිය්යානිකෙ ඛන්ධෙ ච මහාභූතෙ ච පච්චයා චිත්තසමුට්ඨානං-. නිය්යානිකඤ්ච අනිය්යානිකඤ්ච-. නිය්යානිකො ච අනිය්යානිකො ච-. හෙතුපච්චයා-. නිය්යානිකං එකං ඛන්ධඤ්ච වත්ථුං ච පච්චයා තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. නිය්යානිකෙ ඛන්ධෙ ච මහාභූතෙ ච පච්චයා චිත්තසමුට්ඨානං-. හෙතුයා නව, ආරම්මණෙ චත්තාරි, අධිපතියා නව, අනන්තරෙ චත්තාරි, සමනන්තරෙ චත්තාරි, සහජාතෙ නව. අඤ්ඤමඤ්ඤෙ චත්තාරි, නිස්සයෙ නව, උපනිස්සයෙ චත්තාරි, පුරෙජාතෙ චත්තාරි, ආසෙවනෙ චත්තාරි, කම්මෙ නව, විපාකෙ එකං, අවිගතෙ නව."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1163,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අනිය්යානිකං ධම්මං පච්චයා අනිය්යානිකො-. න හෙතුපච්චයා-. අහෙතුකං අනිය්යානිකං එකං ඛන්ධං පච්චයා තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච-. (යාව අසඤ්ඤසත්තා.) චක්ඛායතනං පච්චයා-. වත්ථුං පච්චයා අහෙතුකා අනිය්යානිකා ඛන්ධා, විචිකිච්ඡාසහගතෙ උද්ධච්ච, සහගතෙ ඛන්ධෙ ච වත්ථුං ච පච්චයා විචිකිච්ඡා-. උද්ධච්ච-. මොහො, නිය්යානිකං ධම්මං පච්චයා අනිය්යානිකො-. නාරම්මණ-. තීණි. නිය්යානිකං-. නිය්යානිකො-. නාධිපති-. නිය්යානිකෙ ඛන්ධෙ පච්චයා නිය්යානිකාධිපති, අනිය්යානිකං-. අනිය්යානිකො-. නාධිපති-. අනිය්යානිකං එකං ඛන්ධං පච්චයා-. (යාව අසඤ්ඤසත්තා,) අනිය්යානිකං-. නිය්යානිකො-. නාධිපති-. වත්ථුං පච්චයා නිය්යානිකාධිපති, නිය්යානිකඤ්ච අනිය්යානිකඤ්ච-. නිය්යානිකො-. නාධිපති-. නිය්යානිකෙ ඛන්ධෙ ච වත්ථුං ච පච්චයා නිය්යානිකාධිපති, න හෙතුයා එකං, නාරම්මණෙ තීණි, නාධිපතියා චත්තාරි, නානන්තරෙ තීණි, න උපනිස්සයෙ තීණි, න පුරෙජාතෙ චත්තාරි, න පච්ඡාජාතෙ නව, නාසෙවනෙ තීණි, න කම්මෙ චත්තාරි, න විපාකෙ නව, නාහාරෙ එකං, න ඉන්ද්රියෙ එකං, න ඣානෙ එකං, න මග්ගෙ එකං, න සම්පයුත්තෙ තීණි, න විප්පයුත්තෙ ද්වෙ, නො නත්ථියා තීණි, නො විගතෙ තීණි, (එවං ඉතරෙ ද්වෙ ගණනාපි නිස්සයවාරොපි කාතබ්බා.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "නිය්යානිකං ධම්මං සංසට්ඨො නිය්යානිකො-. හෙතුපච්චයා. නිය්යානිකං එකං ඛන්ධං සංසට්ඨා තයො ඛන්ධා, ද්වෙ ඛන්ධෙ-. අනිය්යානිකං-. අනිය්යානිකො-. හෙතුපච්චයා. අනිය්යානිකං එකං ඛන්ධං සංසට්ඨා තයො ඛන්ධා, ද්වෙ ඛන්ධෙ, (පටිසන්ධි) හෙතුයා ද්වෙ, ආරම්මණෙ ද්වෙ, සබ්බත්ථ ද්වෙ, විපාකෙ එකං, අවිගතෙ ද්වෙ, න හෙතුයා එකං, නාධිපතියා ද්වෙ, න පුරෙජාතෙ ද්වෙ, න පච්ඡාජාතෙ ද්වෙ, නාසෙවනෙ එකං, න කම්මෙ ද්වෙ, න විපාකෙ ද්වෙ, න ඣානෙ එකං, න මග්ගෙ එකං, න විප්පයුත්තෙ ද්වෙ, (එවං ඉතරෙ ද්වෙ ගණනාපි සම්පයුත්තවාරොපි කාතබ්බා.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "නිය්යානිකො ධම්මො නිය්යානිකස්ස ධම්මස්ස හෙතුපච්චයෙන පච්චයො, නිය්යානිකා හෙතු සම්පයුත්තාකානං ඛන්ධානං හෙතුපච්චයා. (මූලං-.) නිය්යානිකා හෙතු චිත්තසමුට්ඨානං-. හෙතුපච්චයා. (මූලං.) නිය්යානිකා හෙතු සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච හෙතුපච්චයා අනිය්යානිකො ධම්මො අනිය්යානිකස්ස හෙතුපච්ච-. අනිය්යානිකා හෙතු සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච-. හෙතුපච්ච-. පටිසන්ධි. නිය්යානිකො අනිය්යානිකස්ස ආරම්මණ-. අරියා මග්ගා වුට්ඨහිත්වා මග්ගං පච්ච-. චෙතොපරියඤාණෙන නිය්යානිකචිතත්සමඞ්ගිස්ස චිත්තං ජානාති, නිය්යානිකා ඛන්ධා චෙතොපරිය-."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1164,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පුබ්බෙ-. අනාගතං-. ආවජ්ජනාය ආරම්මණ-. අනිය්යානිකො අනිය්යානිකස්ස ආරම්මණ-. දානං-. සීලං-. උපොසථකම්මං කත්වා තං පච්ච-. අස්සාදෙති, තං ආරබ්භ රාගො-. දොමනස්සං උප්පජ්ජති, පුබ්බෙසු-. ඣානා අරියා ඵලං පච්ච-. නිබ්බානං පච්ච-. නිබ්බානං ගොත්රභුස්ස, වොදානස්ස, ඵලස්ස, ආවජ්ජනාය ආරම්මණ-. අරියා පහීනෙ කිලෙසෙ, වික්ඛම්භිතෙ, පුබ්බෙ සමුද්රචිණ්ණෙ-. චක්ඛුං, වත්ථුං, අනිය්යානිකෙ ඛන්ධෙ අනිච්චතො-. දොමනස්සං උප්පජ්ජති. දිබෙබ්න චක්ඛුනා දිබ්බායසොත-. චෙතොපරියඤාණෙන, අනිය්යානිකං ආකාසානඤ්චායතනං විඤ්ඤාණඤ්චායතනස්ස ආකිඤ්චඤ්ඤායතනං නෙවසඤ්ඤානාසඤ්ඤායතනස්ස, රූපායතනං චක්ඛුවිඤ්ඤාණස්ස, ඵොට්ඨබ්බායතනං කායවිඤ්ඤාණස්ස, අනිය්යානිකා ඛන්ධා ඉද්ධි-. චෙතො-. පුබ්බෙ-. යථා-. අනාගතං, ආවජ්ජනාය ආරම්මණ-. අනිය්යානිකො නිය්යානිකස්ස ආරම්මණ-. නිබ්බානං මග්ගස්ස ආරම්මණ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "නිය්යානිකො නිය්යානිකස්ස අධිපති-. සහජාතාධිපති, නිය්යානිකාධිපති සම්පයුත්තකානං ඛන්ධානං අධිපති-. නිය්යානිකො ධම්මො අනිය්යානිකස්ස ධම්මස්ස අධිපති-. ආරම්මණාධිපති, සහජාතාධිපති, ආරම්මණාධිපති: අරියා මග්ගා වුට්ඨහිත්වා මග්ගං ගරුං කත්වා පච්ච-. සහජාතාධිපති නිය්යානිකාධිපති චිත්තසමුට්ඨානානං අධිපති-. (මූලං.) නිය්යානිකාධිපති සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානඤ්ච අධිපති-. අනිය්යානිකො අනිය්යානිකස්ස අධිපති-. ආරම්මණාධිපති, සහජාතාධිපති, ආරම්මණාධිපති: දානං-. සීලං-. උපොසථකම්මං කත්වා-. තං ගරුං කත්වා පච්ච-. අස්සාදෙති. තං ගරුං කත්වා රාගො, දිට්ඨි උප්පජ්ජති, පුබ්බෙසු-. ඣානා වුට්ඨහිත්වා-. අරියා ඵලං ගරුං කත්වා පච්ච-. නිබ්බානං ගරුං කත්වා පච්ච-. නිබ්බානං ගොත්රභුස්ස වොදානස්ස, ඵලස්ස අධිපති-. චක්ඛුං, වත්ථුං අනිය්යානිකෙ ඛන්ධෙ ගරුං කත්වා අස්සාදෙති, අභිනන්දති, තං ගරුං කත්වා රාගො උප්පජ්ජති, දිට්ඨි උප්පජ්ජති, සහජාතාධිපති අනිය්යානිකාධිපති සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච අධිපති-. අනිය්යානිකො නිය්යානිකස්ස අධිපති-. ආරම්මණාධිපති-. නිබ්බානං මග්ගස්ස-. අධිපති-."
                    },
                    {
                        "type": "paragraph",
                        "text": "නිය්යානිකො අනිය්යානිකස්ස අනන්තර-. මග්ගො ඵලස්ස අනන්තර-. අනිය්යානිකො අනිය්යානිකස්ස අනන්තරපච්ච-. පුරිමා පුරිමා අනිය්යානිකා ඛන්ධා පච්ඡිමානං පච්ඡිමානං අනන්තර-. අනුලොමං ගොත්රභුස්ස, වොදානස්ස, ඵලං ඵලස්ස, අනුලොමං ඵලසමාපත්තියා අනන්තර-. අනිය්යානිකො නිය්යානිකස්ස අනන්තරපච්ච-. ගොත්රභූ මග්ගස්ස වොදානං මග්ගස්ස අනන්තරපච්ච-. සමනන්තරපච්ච-. සහජාතපච්ච-. පඤ්ච, අඤ්ඤමඤ්ඤපච්ච-. ද්වෙ, නිස්සයපච්ච-."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1165,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සත්ත, නිය්යානිකො නිය්යානිකස්ස උපනිස්සය-. පකතූපනිස්සයො පඨමො මග්ගො දුතියස්ස මග්ගස්ස උපනිස්සය-. තතියො මග්ගො චතුත්ථස්ස මග්ගස්ස උපනිස්සය-. නිය්යානිකො අනිය්යානිකස්ස උපනිස්සය-. ආරම්මණූ-. අනන්තරූ-. පකතූ-. පකතූප: අරියා මග්ගං උපනිස්සාය අනුප්පන්නං සමාපත්තිං උප්පාදෙති, උප්පන්නං සමාපජ්ජන්ති, සඞ්ඛාරෙ අනිච්චතො විපස්සන්ති. මග්ගො අරියානං අත්ථපටිසම්භිදාය ධම්ම-. නිරුත්ති-. පටිභාන-. ඨානාඨානකොසල්ලස්ස උපනිස්සය-. මග්ගො ඵලසමාපත්තියා උපනිස්සය-. අනිය්යානිකො ධම්මො අනිය්යානිකස්ස-. උපනිස්සය-. ආරම්මණූ-. අනන්තරූ පකතූ-. පකතූප: අනිය්යානිකං සද්ධං උපනිස්සාය දානං-. සීලං-. උපොසථ-. ඣානං-. විපස්සනං-. අභිඤ්ඤං-. සමාපත්තිං-. මානං ජප්පෙති, දිට්ඨිං ගණ්හාති, අනිය්යානිකං සීලං, පඤ්ඤං. රාගං, පත්ථනං, උතුං, භොජනං, සෙනාසනං උපනිස්සාය දානං දෙති, සමාපත්තිං-. පාණං හනති-. සඞ්ඝ භින්දති, අනිය්යානිකා සද්ධා, සෙනාසනං අනිය්යානිකාය සද්ධාය, පත්ථනාය, කායිකස්ස සුඛස්ස, කායිකස්ස දුක්ඛස්ස, ඵලසමාපත්තියා උපනිස්සය-. අනිය්යානිකො නිය්යානිකස්ස උපනිස්සය-. ආරම්මණූ-. අනන්තරූ-. පකතූ-. පකතූප: පඨමස්ස මග්ගස්ස පරිකම්මං පඨමස්ස මග්ගස්ස උපනිස්සය-. චතුත්ථස්ස මග්ගස්ස පරිකම්මං චතුත්ථස්ස මග්ගස්ස උපනිස්සය."
                    },
                    {
                        "type": "paragraph",
                        "text": "අනිය්යානිකො අනිය්යානිකස්ස පුරෙජාත-. ද්වෙ-. (අරූපදුකසදිසා කාතබ්බා.) පච්ඡාජාතපච්ච, ද්වෙ, ආසෙවනපච්ච, නිය්යානිකො නිය්යානිකස්ස කම්ම-. නිය්යානිකා චෙතනා සම්පයුත්තකානං ඛන්ධානං කම්ම-. නිය්යානිකො අනිය්යානිකස්ස කම්ම-. සහජාතා, නානාඛණිකා, සහජාතා නිය්යානිකා චෙතනා චිත්තසමුට්ඨානානං-. කම්ම-. නානාඛණිකා නිය්යානිකා චෙතනා ඵලස්ස කම්ම-. (මූලං.) නිය්යානිකා චෙතනා සම්පයුත්තකානාං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච කම්ම-. අනිය්යානිකො අනිය්යානිකස්ස කම්ම-. සහජාතා නානාඛණිකා. විපාකපච්චයා. එකං යෙව ආහාරපච්චයා චත්තාරි, ඉන්ද්රියපච්චයා චත්තාරි, ඣානපච්චයා චත්තාරි, මග්ග පච්චයා චත්තාරි. සම්පයුත්තපච්චයා තීණි, විප්පයුත්තෙ තීණි, (අරූපදුක සදිසා කාතබ්බා.) අත්ථිපච්චයා සත්ත, (අරූපදුකසදිසා කාතබ්බා.) (ආමසනා නා නා පදායෙව.) නත්ථිපච්චයා, විගතපච්චයා, අවිගතපච්චයා හෙතුයා චත්තාරි, ආරම්මණෙ තීණි, අධිපතියා පඤ්ච, අනන්තරෙ තීණි, සමනන්තරෙ තීණි, සහජාතෙ පඤ්ච, අඤ්ඤමඤ්ඤෙ ද්වෙ, නිස්සයෙ සත්ත, උපනිස්සයෙ චත්තාරි, පුරෙජාතෙ ද්වෙ, පච්ඡාජාතෙ ද්වෙ, ආසෙවනෙ ද්වෙ, කම්මෙ චත්තාරි, විපාකෙ එකං, ආහාරෙ චත්තාරි, ඉන්ද්රියෙ චත්තාරි, ඣානෙ චත්තාරි, මග්ගෙ චත්තාරි, සම්පයුත්තෙ"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1166,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ද්වෙ විප්පයුත්තෙ තීණි, අත්ථියා සත්ත, නත්ථියා තීණි, විගතෙ තීණි, අවිගතෙ සත්ත."
                    },
                    {
                        "type": "paragraph",
                        "text": "නිය්යානිකො ධම්මො නිය්යානිකස්ස-. සහජාත පච්චයා-. උපනිස්සය-. නිය්යානිකො අනිය්යානිකස්ස ආරම්මණ-. සහජාත-. උපනිස්සය-. පච්ඡාජාත-. නිය්යානිකො ධම්මො නිය්යානිකස්ස ච අනිය්යානිකස්ස ච සහජාතපච්චයා-. අනිය්යානිකකො ධම්මො අනිය්යානිකස්ස ආරම්මණ-. සහජාත-. උපනිස්සය-. පුරෙජාත-. පච්ඡාජාත-. කම්ම-. ආහාර-. ඉන්ද්රියපච්චයා. අනිය්යානිකො ධම්මො නිය්යානිකස්ස ධම්මස්ස උපනිස්සය-. පුරෙජාත-. නිය්යානිකො ච අනිය්යානිකො ච-. නිය්යානිකස්ස සහජාතං, පුරෙජාතං. නිය්යානිකො ච අනිය්යානිකො ච-. අනිය්යානිකස්ස සහජාතං පච්ඡාජාතං, ආහාරං, ඉන්ද්රියං."
                    },
                    {
                        "type": "paragraph",
                        "text": "න හෙතුයා සත්ත, නාරම්මණෙ සත්ත, නාධිපතියා සත්ත, නානන්තරෙ, න සමනන්තරෙ සත්ත, න සහජාතෙ පඤ්ච, න අඤ්ඤමඤ්ඤෙ පඤ්ච, නිස්සයෙ පඤ්ච, න උපනිස්සයෙ සත්ත, න පුරෙජාතෙ ඡ, න පච්ඡාජාතෙ සත්ත, න සම්පයුත්තෙ පඤ්ච, න විප්පයුත්තෙ චත්තාරි, නො අත්ථියා චත්තාරි, නො නත්ථියා සත්ත, නො විගතෙ සත්ත, නො අවිගතෙ චත්තාරි, හෙතුපච්චයා නාරම්මණෙ චත්තාරි, නාධිපතියා චත්තාරි, නානන්තරෙ, න සමනන්තරෙ චත්තාරි, න අඤ්ඤමඤ්ඤෙ ද්වෙ, න උපනිස්සයෙ චත්තාරි, න සම්පයුත්තෙ ද්වෙ. න විප්පයුත්තෙ ද්වෙ, න නො නත්ථියා චත්තාරි, නො විගතෙ චත්තාරි, න හෙතුපච්චයා ආරම්මණෙ තීණි, අධිපතියා පඤ්ච, අනුලොමමාතිකා, අවිගතෙ සත්ත."
                    },
                    {
                        "type": "centered",
                        "text": "නිය්යානික දුකං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "98. නියත දුකං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "නියතං ධම්මං පටිච්ච නියතො ධම්මො උප්පජ්ජති හෙතුපච්චයා, නියතං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා, ද්වෙ ඛන්ධෙ, නියතං ධම්මං-. අනියතො-. හෙතුපච්චයා, නියතෙ ඛන්ධෙ පටිච්ච චිත්තසමුට්ඨානං, (සංඛිත්තං.) (පඤ්චපි පඤ්හා කාතබ්බා. යථා නිය්යානිකදුකං, එවං පටිච්චවාරොපි සහජාතවාරොපි පච්චයවාරොපි නිස්සයවාරොපි සංසට්ඨවාරොපි සම්පයුත්තවාරොපි කාතබ්බා. නින්නානාකරණං, ආමසනං නානං.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "නියතො ධම්මො නියතස්ස ධම්මස්ස හෙතුපච්චයා, චත්තාරි, (නිය්යානිකදුක සදිසං. නින්නානාකරණං.) නියතො ධම්මො අනියතස්ස ධම්මස්ස ආරම්මණපච්චයා-. අරියා මග්ගා වුට්ඨහිත්වා මග්ගං පච්ච-. නියතං පහීනකිලෙසං පච්ච-. පුබ්බෙසු-. නියතෙ ඛන්ධෙ අනිච්චතො"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1167,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "විප්සසති. චෙතොපරියඤාණෙන, නියතචිත්තසමඞ්ගිස්ස චිත්තං ජානාති, නියතා ඛන්ධා චෙතොපරිය-. පුබ්බෙනි-. යථා-. අනාගතං-. ආවජ්ජනාය ආරම්මණ-. අනියතො ධම්මො අනියතස්ස ආරම්මණ-. දානං-. සීලං-. උපොසථ-. පුබ්බෙසු-. ඣානා වුට්ඨහිත්වා ඣානං පච්චවෙක්ඛති, අස්සාදෙති, අභිනන්දති, තං ආරබ්භ අනියතො රාගො උප්පජ්ජති, දිට්ඨි-. විචිකිච්ඡා-. උද්ධච්චං-. අනියතං දොමනස්සං උප්පජ්ජති, අරියා ඵලං පච්ච-. නිබ්බානං පච්ච-. නිබ්බානං ගොත්රභුස්ස, වොදානස්ස, ආවජ්ජනාය ආරම්මණ-. අරියා අනියතං පහීන කිලෙසං පච්ච-. වික්ඛම්භිත-. පුබ්බෙසමු-. චක්ඛුං, වත්ථුං, අනියතෙ ඛන්ධෙ අනිච්චතො, දුක්ඛතො විපස්සන්ති, අස්සාදෙන්ති, අභිනන්දන්ති, තං ආරබ්භ අනියතො රාගො, දොමනස්සං-. දිබ්බෙන චක්ඛුනා-. ආවජ්ජනාය ආරම්මණ-. අනියතො ධම්මො නියතස්ස-. ආරම්මණපච්චයා-. නිබ්බානං මග්ගස්ස ආරම්මණපච්චයා-. රූපජීවිතින්ද්රියං-. මාතුඝාතිකම්මස්ස, පිතු-. අරහන්තඝාති-. රුහිරුප්පාදකම්මස්ස ආරම්මණපච්චයා-. යං වත්ථුං ආමසන්තස්ස මිච්ඡත්තනියතා ඛන්ධා උප්පජ්ජන්ති, තං වත්ථු මිච්ඡත්තනියතානං ඛන්ධානං ආරම්මණපච්චයෙන පච්චයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "නියතො ධම්මො නියතස්ස ධම්මස්ස අධිපති-. සහජාතාධිපති, නියතාධිපති සම්පයුත්තකානං ඛන්ධානං අධිපතිපච්ච-. නියතො ධම්මො අනියතස්ස අධිපති-. ආරම්මණාධිපති, සහජාතාධිපති, ආරම්මණාධිපති: අරියා මග්ගා වුට්ඨහිත්වා මග්ගං ගරුං කත්වා පච්චවෙක්ඛති, සහජාතාධිපති: නියතාධිපති චිත්තසමුට්ඨානානං අධිපති-. නියතො නියතස්ස ච අනියතස්ස ච අධිපති-. සහජාතාධිපති නියතාධිපති, සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච අධිපති-. අනියතො: අධිපති-. ආරම්මණාධිපති, සහජාතාධිපති, - ආරම්මණාධිපති: දානං-. සීලං-. උපොසථකම්මං කත්වා තං ගරුං කත්වා පච්ච-. අස්සාදෙති, තං ගරුං කත්වා අනියතො රාගො-. දිට්ඨි-. පුබ්බෙ-. ඣානා-. අරියා ඵලං ගරුං කත්වා පච්ච-. නිබ්බානං ගරුං කත්වා පච්ච-. නිබ්බානං ගොත්රභුස්ස, වොදානස්ස, ඵලස්ස අධිපති-. චක්ඛුං, වත්ථුං, අනියතෙ ඛන්ධෙ ගරුං කත්වා අනියතො රාගො දිට්ඨි-. සහජාතාධිපති. අනියතාධිපති සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච-. අධිපති-. අනියතො නියතස්ස අධිපතිපච්ච-. ආරම්මණාධිපති නිබ්බානං මග්ගස්ස අධිපතිපච්චයෙන පච්චයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "නියතො ධම්මො අනියතස්ස ධම්මස්ස අනන්තරපච්චයා-. මග්ගො ඵලස්ස අනන්තරපච්චයා-. නියතා ඛන්ධා වුට්ඨානස්ස අනන්තර-. අනියතො අනියතස්ස අනන්තර-. පුරිමා පුරිමා අනියතා ඛන්ධා පච්ඡිමානං පච්ඡිමානං ඛන්ධානං අනන්තරපච්චයා-. අනුලොමං ගොත්රභුස්ස, අනුලොමං වොදානස්ස, ඵලං ඵලස්ස, අනුලොමං ඵලසමාපත්තියා, නිරොධා වුට්ඨ-. ඵලසමාපත්තියා අනන්තරපච්චයා. අනියතො නියතස්ස"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1168,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අනන්තර-. අනියතං දොමනස්සං නියතස්ස දොමනස්සස්ස-. අනියතා මිච්ඡාදිට්ඨි නියතමිච්ඡාදිට්ඨියා අනන්තර-. ගොත්රභු මග්ගස්ස, වොදානං මග්ගස්ස අනන්තර-. සමනන්තර-. සහජාතපච්චයා. පඤ්ච, අඤ්ඤමඤ්ඤපච්චයා ද්වෙ, නිස්සයපච්චයා සත්ත."
                    },
                    {
                        "type": "paragraph",
                        "text": "නියතො නියතස්ස උපනිස්සය-. පකතූපනිස්සයො, මාතුඝාතිකං කම්මං මාතුඝාතිකම්මස්ස, පිතුඝාති-. අරහන්ත-. රුහිරුප්පාද-. සඞ්ඝභෙද-. නියතමිච්ඡාදිට්ඨියා උපනිස්සය-. (චක්කං) පඨමො මග්ගො දුතියස්ස මග්ගස්ස, තතියො මග්ගො චතුත්ථස්ස උපනිස්සය-. නියතො අනියතස්ස උපනිස්සය-. ආරම්මණූ-. අනන්තරූ-. පකතූ-. - පකතූප: මාතරං ජීවිතා වොරොපෙත්වා -පෙ- සඞ්ඝං භින්දිත්වා තස්ස පටිඝාතත්ථාය දානං-. සීලං-. උපොසථ-. අරියා මග්ගං උපනිස්සාය අනුප්පන්නං සමාපත්තිං උප්පාදෙන්ති, උප්පන්නං, ඨානාඨානකොසල්ලස්ස උපනිස්සය පච්ච-. මග්ගො ඵලසමාපත්තියා උපනිස්සය පච්ච-. අනියතො අනියතස්ස උපනිස්සය-. ආරම්මණූ-. අනන්තරූ-. පකතූ-. පකතූප: අනියතං සද්ධං උපනිස්සාය දානං-. සීලං-. උපොසථ-. ඣානං-. විපස්සනං-. අභිඤ්ඤං-. සමාපත්තිං-. මානං-. දිට්ඨිං-. අනියතං සීලං-. පඤ්ඤං-. රාගං-. පත්ථනං-. කායිකං සුඛං-. කායිකං දුක්ඛං -පෙ- සෙනාසනං උපනිස්සාය දානං -පෙ- සමාපත්තිං උප්පාදෙති, පාණං හනති, නිගමඝාතං-. අනියතා සද්ධා, සෙනාසනං අනියතාය සද්ධාය -පෙ- පත්ථනාය, කායිකස්ස සුඛස්ස, කායිකස්ස දුක්ඛස්ස, ඵලසමාපත්තියා උපනිස්සය, අනියතො නියතස්ස උපනිස්සය, ආරම්මණූ අනන්තරූ-. පකතූ-. පකතූප-. අනියතං රාගං උපනිස්සාය මාතරං ජීවිතා වොරොපෙති, සඞ්ඝං භින්දති, අනියතං දොමනස්සං, -.පෙසෙනාසනං උපනිස්සාය මාතරං ජීවිතා වොරොපෙති, සඞ්ඝං භින්දති, අනියතං දොමනස්සං -පෙ- සෙනාසනං උපනිස්සාය මාතරං ජීවිතා වොරොපෙති, සඞ්ඝං භින්දති, අනියතො රාගො, දොමනස්සං, සෙනාසනං මාතුඝාතිකම්මස්ස සඞ්ඝභෙදකම්මස්ස උපනිස්සය-. පඨමස්ස මග්ගස්ස පරිකම්මං පඨමස්ස මග්ගස්ස, චතුත්ථස්ස මග්ගස්ස පරිකම්මං චතුත්ථස්ස මග්ගස්ස උපනිස්සය පච්චයෙන පච්චයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "අනියතො අනියතස්ස පුරෙජාත-. ආරම්මණපුරෙ-. වත්ථුපුරෙ-. (සංඛිත්තං.) අනියතො නියතස්ස ධම්මස්ස පුරෙජාත-. ආරම්මණපුරෙ, වත්ථුපුරෙ, - ආරම්මණපුරෙ-. රූපජීවිතින්ද්රියං මාතුඝාතිකම්මස්ස-. පිතුඝාත-. අරහන්ත-. රුහිරුප්පාදකම්මස්ස පුරෙජාත-. වත්ථුපුරෙ-. වත්ථු නියතානං ඛන්ධානං පුරෙජාතපච්චයා-. ද්වෙ-. පච්ඡාජාතෙ ද්වෙ, ආසෙවනෙ ද්වෙ, නියතො නියතස්ස කම්මපච්චයා-. නියතා චෙතනා සම්පයුත්තකානං ඛන්ධානං කමම්පච්චයා-. නියතො අනියතස්ස කම්මපච්චයා-. සහජාතා, නානාඛණිකා සහජාතා නියතා චෙතනා චිත්තසමුට්ඨානානං කම්ම-. නානාඛණිකා නියතා චෙතනා විපාකානං ඛන්ධානං කටත්තා ච"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1169,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "රූපානං කම්ම-. (මූලං) නියතා චෙතනා සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච කම්ම-. අනියතො අනියතස්ස කම්ම-. සහජාතා, නානාඛණිකා. (සංඛිත්තං.) විපාකපච්චයා-. එකං ආහාරපච්චයා-. චත්තාරි, ඉන්ද්රියෙ චත්තාරි, ඣානෙ චත්තාරි, මග්ගෙ චත්තාරි, සම්පයුත්තෙ ද්වෙ, විප්පයුත්තෙ තීණි, (අරූපදුකසදිසං.) අත්ථිපච්චයා-. සත්ත, (අරූපාවචරදුක සදිසං.) නත්ථිපච්චයා, විගතපච්චයා, අවිගතපච්චයා, සත්ත. හෙතුයා චත්තාරි, ආරම්මණෙ තීණි, අධිපතියා පඤ්ච, අනන්තරෙ තීණි, සමනන්තරෙ තීණි, සහජාතෙ පඤ්ච, අඤ්ඤමඤ්ඤෙ ද්වෙ, නිස්සයෙ සත්ත, උපනිස්සයෙ චත්තාරි, පුරෙජාතෙ ද්වෙ, පච්ඡාජාතෙ ද්වෙ, ආසෙවනෙ ද්වෙ, කම්මෙ චත්තාරි, විපාකෙ එකං, ආහාරෙ චත්තාරි, ඉන්ද්රියෙ, ඣානෙ චත්තාරි, මග්ගෙ චත්තාරි, සම්පයුත්තෙ ද්වෙ, විප්පයුත්තෙ තීණි, අත්ථියා සත්ත, නත්ථියා තීණි, විගතෙ තීණි, අවිගතෙ සත්ත."
                    },
                    {
                        "type": "paragraph",
                        "text": "නියතො ධම්මො නියතස්ස සහජාතපච්චයා-. උපනිස්සය-. නියතො අනියතස්ස ආරම්මණ-. සහජාත-. උපනිස්සය-. පච්ඡාජාත-. කම්මපච්චයා. නියතො නියතස්ස ච අනියතස්ස ච ධම්මස්ස සහජාතපච්චයා. අනියතො අනියතස්ස ආරම්මණ-. සහජාත-. උපනිස්සය-. පුරෙජාත-. පච්ඡාජාත-. කම්ම-. ආහාර-. ඉන්ද්රියපච්චයා. අනියතො නියතස්ස ආරම්මණ-. උපනිස්සය-. පුරෙජාත-. නියතො ච අනියතො ච නියතස්ස සහජාතං, පුරෙජාතං, නියතො ච අනියතො ච අනියතස්ස සහජාතං, පච්ඡාජාතං, ආහාරං, ඉන්ද්රියං."
                    },
                    {
                        "type": "paragraph",
                        "text": "න හෙතුයා සත්ත, නාරම්මණෙ සත්ත, නාධිපතියා සත්ත, නානන්තරෙ, න සමනන්තරෙ සත්ත, න සහජාතෙ පඤ්ච, න අඤ්ඤමඤ්ඤෙ පඤ්ච, න නිස්සයෙ පඤ්ච, න උපනිස්සයෙ සත්ත, න පුරෙජාතෙ ඡ, න පච්ඡාජාතෙ සත්ත, න සම්පයුත්තෙ පඤ්ච, න විප්පයුත්තෙ චත්තාරි නො අත්ථියා චත්තාරි, නො නත්ථියා සත්ත, නො විගතෙ සත්ත. නො අවිගතෙ චත්තාරි, හෙතුපච්චයා නාරම්මණෙ චත්තාරි, නාධිපතියා චත්තාරි. නානන්තරෙ, න සමනන්තරෙ චත්තාරි, න අඤ්ඤමඤ්ඤෙ ද්වෙ, න උපනිස්සයෙ චත්තාරි, න සම්පයුත්තෙ ද්වෙ, න විප්පයුත්තෙ ද්වෙ, නො නත්ථියා චත්තාරි, නො විගතෙ චත්තාරි, න හෙතුපච්චයා ආරම්මණෙ තීණි, අධිපතියා පඤ්ච, (අනුලොමමාතිකා.) අවිගතෙ සත්ත."
                    },
                    {
                        "type": "centered",
                        "text": "නියත දුකං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "99. සඋත්තර දුකං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සඋත්තර ධම්මං පටිච්ච සඋත්තරො ධම්මො උප්පජ්ජති හෙතුපච්චයා-. සඋත්තරං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච-"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1170,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ද්වෙ ඛන්ධෙ, පටිසන්ධි (යාව අජ්ඣත්තිකා මහාභූතා,) (යථාචුලන්තරදුකෙ ලොකියදුකසදිසං. නින්නානාකරණං.)"
                    },
                    {
                        "type": "centered",
                        "text": "සඋත්තර දුකං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "100. සරණ දුකං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සරණං ධම්මං පටිච්ච සරණො ධම්මො උප්පජ්ජති හෙතුපච්චයා. සරණං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා. ද්වෙ ඛන්ධෙ, පඤ්ච පඤ්හා (අරූපාවචර දුක සදිසං අනුලොම පටිච්ච සදිසා) හෙතුයා පඤ්ච, ආරම්මත්ණ ද්වෙ, අධිපතියා පඤ්ච, අවිගතෙ පඤ්ච, සරණං ධම්මං පටිච්ච සරණො ධම්මො උප්පජ්ජති න හෙතුපච්චයා. විචිකිච්ඡාසහගතෙ ඛන්ධෙ පටිච්ච විචිකිච්ඡා-. උද්ධච්ච-. මොහො-. අරණං ධම්මං පටිච්ච අරණො ධම්මො-. න හෙතුපච්චයා. අහෙතුකං අරණං එකං ඛන්ධං පටිච්ච තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච-. අහෙතුකපටිසන්ධි. යාවඅසඤ්ඤසත්තා, න හෙතුයා ද්වෙ, නාරම්මණෙ තීණි, නාධිපතියා පඤ්ච, නානන්තරෙ තීණි. න උපනිස්සයෙ තීණි, න පුරෙජාතෙ චත්තාරි, න පච්ඡාජාතෙ පඤ්ච, නාසෙවනෙ පඤ්ච, න කම්මෙ ද්වෙ, න විපාකෙ පඤ්ච, නාහාරෙ එකං, න ඉන්ද්රියෙ එකං, න ඣානෙ එකං, න මග්ගෙ එකං, න සම්පයුත්තෙ තීණි, න විප්පයුත්තෙ ද්වෙ, නො නත්ථියා තීණි, නො විගතෙ තීණි, (ඉතරෙ ද්වෙ ගණනාපි සහජාතවාරොපි කාතබ්බා.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "සරණං ධම්මං පච්චයා සරණො ධම්මො උප්පජ්ජති හෙතුපච්චයා, සරණං එකං ඛන්ධං පච්චයා තයො ඛන්ධා, ද්වෙ ඛන්ධෙ, (යථා අරූපාවචර දුකස්ස පච්චයවාරොපි එවං කාතබ්බො) හෙතුයා නව, ආරම්මණෙ චත්තාරි, අධිපතියා නව, අධිපතියා නව, අවිගතෙ නව, සරණං ධම්මං පච්චයා සරණො ධම්මො උප්පජ්ජති න හෙතුපච්චයා, විචිකිච්ඡාසහගතෙ උද්ධච්චසහගතෙ ඛන්ධෙ පච්චයා විචිකිච්ඡා-. උද්ධච්ච-. මොහො, අරණං ධම්මං පච්චයා අරණො ධම්මො උප්පජ්ජති න හෙතුපච්චයා, අහෙතුකං අරණං එකං ඛන්ධං පච්චයා තයො ඛන්ධා චිත්තසමුට්ඨානඤ්ච-. අහෙතුකපටිසන්ධි-. (යාව අසඤ්ඤසත්තා.) චක්ඛායතනං පච්චයා චක්ඛුවිඤ්ඤාණං, කායායතනං පච්චයා-. අරණං ධම්මං පච්චයා අරණො ධම්මො-. න හෙතු-. වත්ථුං පච්චයා විචිකිච්ඡාසහගතො උද්ධච්චසහගතො මොහො, සරණඤ්ච අරණඤ්ච ධම්මං පච්චයා සරණො ධම්මො-. න හෙතුපච්චයා. විචිකිච්ඡාසහගතෙ උද්ධච්චසහගතෙ ඛන්ධෙ ච වත්ථුං ච පච්චයා විචිකිච්ඡා-. උද්ධච්චං-. මොහො න හෙතුයා චත්තාරි. නාරමමනෙ තීණි, නාධිපතියා නව, නානන්තරෙ තීණි,"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1171,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "න සමනන්තරෙ තීණි, න අඤ්ඤමඤ්ඤෙ තීණි, න උපනිස්සයෙ තීණි, න පුරෙජාතෙ චත්තාරි, න පච්ඡාජාතෙ නව, නාසෙවනෙ නව, න කම්මෙ චත්තාරි, න විපාකෙ නව, නාහාරෙ එකං, න ඉන්ද්රියෙ එකං, න ඣානෙ එකං, න මග්ගෙ එකං, න සම්පයුත්තෙ තීණි, න විප්පයුත්තෙ ද්වෙ, නො නත්ථියා තීණි, නො විගතෙ තීණි. (ඉතරෙ ද්වෙ ගණනාපි නිස්සයවාරොපි කාතබ්බො. සංසට්ඨවාරොපි ද්වෙ පඤ්හා කාතබ්බා සබ්බත්ථ) හෙතුයා දෙව, ආරම්මණෙ ද්වෙ, සබ්බත්ථ ද්වෙ, විපාකෙ එකං, අවිගතෙ ද්වෙ, න හෙතුයා ද්වෙ, නාධිපතියා ද්වෙ, න පුරෙජාතෙ ද්වෙ, න පච්ඡාජාතෙ ද්වෙ, නාසෙවනෙ ද්වෙ, න කම්මෙ ද්වෙ, න විපාකෙ ද්වෙ, න ඣානෙ එකං, න මග්ගෙ එකං, න විප්පයුත්තෙ ද්වෙ, (ඉතරෙ ද්වෙ ගණනාපි සම්පයුත්තවාරොපි කාතබ්බො.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "සරණො ධම්මො සරණස්ස ධම්මස්ස හෙතු-. (අරූපදුක සදිසං.) චත්තාරි, සරණො ධම්මො සරණස්ස ධම්මස්ස ආරම්මණ-. රාගං අස්සාදෙති, අභි-. තං ආරබ්භ රාගො උප්පජ්ජති, දිට්ඨි-. විචිකිච්ඡා-. උද්ධච්චං-. දොමනස්සං උප්පජ්ජති, දිට්ඨිං අස්සාදෙති, විචිකිච්ඡා-. උද්ධච්චං, දොමනස්සං ආරබ්භ දොමනස්සං උප්පජ්ජති, දිට්ඨි, විචිකිච්ඡා, උද්ධච්චං උප්පජ්ජති, සරණො ධම්මො අරණස්ස ආරම්මණ-. අරියා පහීනකිලෙසං, වික්ඛම්භි-. පුබ්බෙ-. සරණෙ ඛන්ධෙ අනිච්චතො විපස්සති, චෙතොපරියඤාණෙන න සරණචිත්තසමඞ්ගිස්ස චිත්තං ජානාති, සරණා ඛන්ධා චෙතොපරිය-. පුබ්බෙනි-. යථා-. අනාගතං-. ආවජ්ජනාය ආරම්මණ-. අරණො ධම්මො අරණස්ස ආරම්මණ-. දානං-. සීලං-. උපොසථකම්මං කත්වා තං පච්ච-. පුබ්බෙ-. ඣානා-. අරියා, මග්ගා වුට්ඨහිත්වා මග්ගං පච්ච-. ඵලං-. නිබ්බානං-. නිබ්බානං: ගොත්රභුස්ස, වොදානස්ස, මග්ගස්ස, ඵලස්ස ආවජ්ජනාය ආරම්මණ-. චක්ඛුං, වත්ථුං, අරණෙ ඛන්ධෙ අනිච්චතො විපස්සන්ති, දිබ්බෙන චක්ඛුනා, අනාගතංසඤාණස්ස ආවජ්ජනාය ආරම්මණ-. අරණො ධම්මො සරණස්ස ආරම්මණ-. දානං-. සීලං-. උපොසථ කම්මං කත්වා චක්ඛුං, වත්ථුං, අරණෙ ඛන්ධෙ අස්සාදෙති, අභි-. තං ආරබ්භ රාගො දොමනස්සං උප්පජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සරණො සරණස්ස අධිපති-. ආරම්මණාධි-. සහජාතාධි-. ආරම්මණාධිපති රාගං ගරුං කත්වා අස්සාදෙති, අභිනන්දති, තං ගරුං කත්වා රාගො-. දිට්ඨිං ගරුං කත්වා අස්සාදෙති, සහජාතාධිපති සරණාධිපති සම්පයුත්තකානං ඛන්ධානං අධිපති-. සරණො සරණස්ස අධිපති-. සහජාතාධිපති, සරණාධිපති චිත්තසමුට්ඨානානං අධිපති-."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1172,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සරණො සරණස්ස ච අරණස්ස ච අධිපති-. සහජාතාධිපති සරණාධිපති සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච අධිපති-. අරණො අරණස්ස අධිපති-. ආරම්මණාධිපති, සහජාතාධිපති, - ආරම්මණාධිපති: දානං-. සීලං-. උපොසථකම්මං කත්වා තං ගරුං කත්වා පච්චවෙක්ඛති, පුබ්බෙ-. ඣානා-. අරියා මග්ගා වුට්ඨහිත්වා මග්ගං ගරුං කත්වා පච්ච, -පෙ- ඵලං, නිබ්බානං, නිබ්බානං: ගොත්රභුස්ස, වොදානස්ස, මග්ගස්ස, ඵලස්ස අධිපති-. සහජාතාධිපති, අරණාධිපති සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච අධිපති-. අරණො සරණස්ස අධිපති-. ආරම්මණාධිපති දානං-. සීලං-. උපොසථකම්මං කත්වා තං ගරුං කත්වා අස්සාදෙති, තං ගරුං කත්වා රාගො දිට්ඨි උප්පජ්ජති, පුබ්බෙසු-. ඣානා-. චක්ඛුං, වත්ථුං, අරණෙ-. ඛන්ධෙ ගරුං කත්වා අස්සාදෙති, අභි-. තං ගරුං කත්වා රාගො-. දිට්ඨි-."
                    },
                    {
                        "type": "paragraph",
                        "text": "සරණො සරණස්ස අනන්තරපච්චයා-. පුරිමා පුරිමා සරණා ඛන්ධා පච්ඡිමානං පච්ඡිමානං සරණානං ඛන්ධානං අනන්තරපච්චයා-. සරණො අරණස්ස අනන්තරපච්චයා-. සරණා ඛන්ධා වුට්ඨානස්ස අනන්තරපච්චයා-. අරණො අරණස්ස අනන්තරපච්චයා-. පුරිමා පුරිමා අරණා ඛන්ධා පච්ඡිමානං පච්ඡිමානං අරණානං ඛන්ධානං අනන්තරපච්චයා-. අනුලොමං ගොත්රභුස්ස, ඵලසමාපත්තියා අනන්තරපච්චයා-. අරණො සරණස්ස අනන්තරපච්චයා-. ආවජ්ජනා සරණානං ඛන්ධානං අනන්තරපච්චයා-. සමනන්තරපච්චයා-. සහජාතපච්චයා-. පඤ්ච, අඤ්ඤමඤ්ඤපච්චයා-. ද්වෙ, නිස්සයපච්චයා-. සත්ත."
                    },
                    {
                        "type": "paragraph",
                        "text": "සරණො සරණස්ස උපනිස්සය-. ආරම්මණූ-. අනන්තරූ-. පකතූ-. පකතූප: රාගං උපනිස්සාය පාණං හනති, සඞ්ඝං භින්දති, දොසං, පත්ථනං උපනිස්සාය පාණං හනති, සඞ්ඝං භින්දති, රාගො, පත්ථනා, රාගස්ස, පත්ථනාය උපනිස්සය-. සරණො අරණස්ස උපනිස්සය-. අනන්තරූ-. පකතූ-. පකතූප: රාගං උපනිස්සාය දානං දෙති, සීලං-. උපොසථ-. ඣානං, විපස්සනං මග්ගං, අභිඤ්ඤං සමාපත්තිං උප්පාදෙති, දොසං, පත්ථනං උපනිස්සාය දානං-. සමාපත්තිං උප්පාදෙති, රාගො, පත්ථනා සද්ධාය, පඤ්ඤාය, කායිකස්ස සුඛස්ස කායිකස්ස දුක්ඛස්ස, මග්ගස්ස, ඵලසමාපත්තියා උපනිස්සය-. අරණො අරණස්ස උපනිස්සය-. ආරම්මණූ-. අනන්තරූ-. පකතූ-. පකතූප: සද්ධං උපනිස්සාය දානං දෙති, සමාපත්තිං උප්පාදෙති, සීලං, පඤ්ඤං, කායිකං සුඛං, කායිකං දුක්ඛං, උතුං, භොජනං, සෙනාසනං උපනිස්සාය දානං-. සමාපත්තිං-. සද්ධා, සෙනාසනං සද්ධාය, පඤ්ඤාය, කායිකස්ස සුඛස්ස, කායිකස්ස දුක්ඛස්ස, මග්ගස්ස,"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1173,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඵලසමාපත්තියා උපනිස්සය-. අරණො සරණස්ස උපනිස්සය-. ආරම්මණූ-. අනන්තරූ-. පකතූ-. පකතූපනිස්සයො, සද්ධං උපනිස්සාය මානං ජප්පෙති, දිට්ඨිං ගණ්හාති, සීලං-. සෙනාසනං උපනිස්සාය පාණං හනති. සඞ්ඝං භින්දති, සද්ධා, සෙනාසනං රාගස්ස, පත්ථනාය උපනිස්සය පච්චයෙන පච්චයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "අරණො ධම්මො අරණස්ස පුරෙජාත-. ආරම්මණපුරෙ-. වත්ථුපුරෙ-. ආරම්මණපුරෙ-. චක්ඛුං, වත්ථුං, අනිච්චතො විපස්සති. දිබ්බෙන චක්ඛුනා, දිබ්බාය සොත-. රූපායතනං චක්ඛු-. ඵොට්ඨබ්බායතනං-. වත්ථුපුරෙජාතං, චක්ඛායතනං චක්ඛු, කායායතනං කායවිඤ්ඤා-. වත්ථු අරණානං ඛන්ධානං පුරෙජාත-. අරණො සරණස්ස පුරෙජාත-. ආරම්මණපුරෙජාතං, වත්ථුපුරෙජාතං, ආරම්මණපුරෙ: චක්ඛුං වත්ථුං අස්සාදෙති, අභිනන්දති, තං ආරබ්භ රාගො-. දොමනස්සං උප්පජ්ජති, වත්ථුපුරෙජාතං, වත්ථු සරණානං ඛන්ධානං පුරෙජාත-. පච්ඡාජාත පච්ච-. ද්වෙ, ආසෙවනෙ ද්වෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "සරණො සරණස්ස කම්මපච්චයා සරණා චෙතනා සම්පයුත්තකානං ඛන්ධානං කම්මපච්චයා-. (මූලං) සහජාතා, නානාඛණිකා, සහජාතා සරණා චෙතනා චිත්තසමුට්ඨානානං කම්මපච්චයා. නානාඛණිකා සරණා චෙතනා විපාකානං ඛන්ධානං කටත්තා ච කම්ම (මුල-.) සහජාතා සරණා චෙතනා සම්පයුත්තකානං ඛන්ධානං චිත්තසමුට්ඨානානඤ්ච කම්ම-. අරණෙ අරණස්ස කම්ම-. සහජාතා, නානාඛණිකා සහජාතා-. (සංඛිත්තං.) විපාකෙ එකං, ආහාර චත්තාරි, ඉන්ද්රියෙ චත්තාරි, ඣානෙ චත්තාරි, මග්ගෙ චත්තාරි, සම්පයුත්තෙ ද්වෙ, විප්පයුත්තෙ තීණි, (අරූපදුකසදිසා.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "සරණො සරණස්ස අත්ථිපච්චයා-. සරණො අරණස්ස අත්ථිපච්චයා-. සහජාතං, පච්ඡාජාතං, සරණෙ සරණස්ස ච අරණස්ස ච අත්ථි-. අරණො අරණස්ස අත්ථි-. සහජාතං, පුරෙජාතං, පච්ඡාජාතං ආහාරං ඉන්ද්රියං, අරණො සරණස්ස අත්ථි-. සහජාතං, පුරෙජාතං, චක්ඛුං වත්ථුං අස්සාදෙති, අභින්දති, තං ආරබ්භ රාගො උප්පජ්ජති, දොමනස්සං, වත්ථු සරණානං ඛන්ධානං අනන්තරපච්චයා. සරණො ච අරණො ච සරණස්ස අත්ථි-. සහජාතං, පුරෙජාතං, සරණො ච අරණො ච අරණස්ස අත්ථි-. සහජාතං, පච්ඡාජාතං, ආහාරං, ඉන්ද්රියං, සහජාතා සරණා ඛන්ධා ච මහාභූතා ච චිත්තසමුට්ඨානානං අත්ථිපච්චයා. පච්ඡාජාතා සරණා ඛන්ධා ච කබළීකාරො ආහාරො ච ඉමස්ස-. අත්ථි-. පච්ඡාජාතා සරණා ඛන්ධා ච රූපජීවිතින්ද්රියඤ්ච කටත්තා-. අත්ථි-. හෙතුයා චත්තාරි, ආරම්මණෙ චත්තාරි, අධිපතියා පඤ්ච, අනන්තරෙ චත්තාරි, සමනන්තරෙ චත්තාරි, සහජාතෙ"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        },
        {
            "pageNum": 1174,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පඤ්ච, අඤ්ඤමඤ්ඤෙ ද්වෙ, නිස්සයෙ සත්ත. උපනිස්සයෙ චත්තාරි, පුරෙජාතෙ ද්වෙ, පච්ඡාජාතෙ ද්වෙ, ආසෙවනෙ ද්වෙ, කම්මෙ චත්තාරි, විපාකෙ එකං, ආහාරෙ චත්තාරි, ඉන්ද්රියෙ චත්තාරි, ඣානෙ චත්තාරි, මග්ගෙ චත්තාරි, සම්පයුත්තෙ ද්වෙ, විප්පයුත්තෙ තීණි, අත්ථියා සත්ත, නත්ථියා චත්තාරි විගතෙ චත්තාරි, අවිගතෙ සත්ත."
                    },
                    {
                        "type": "paragraph",
                        "text": "සරණො ධම්මො සරණස්ස ධම්මස්ස ආරම්මණ-. සහජාත-. උපනිස්සය-. සරණො අරණස්ස ආරම්මණපච්චයා. සහජාත-. උපනිස්සය-. පච්ඡාජාත-. කම්මපච්චයා. සරණො සරණස්ස ච අරණස්ස ච සහජාතපච්චයා. අරණො අරණස්ස ආරම්මණපච්චයා. සහජාත-. උපනිස්සය-. පුරෙජාත-. පච්ඡාජාත-. කම්මපච්ච-. ආහාර-. ඉන්ද්රියපච්චයා. අරණො ධම්මො සරණස්ස ධම්මස්ස ආරම්මණපච්චයා. උපනිස්සය-. පුරෙජාතපච්චයා-. සරණො ච අරණො ච ධම්මා සරණස්ස ධම්මස්ස සහජාතං, පුරෙජාතං, සරණො ච අරණො ච ධම්මා අරණස්ස ධම්මස්ස සහජාතං, පච්ඡාජාතං, ආහාරං ඉන්ද්රියං."
                    },
                    {
                        "type": "paragraph",
                        "text": "න හෙතුයා සත්ත, -පෙ- න සමනන්තරෙ සත්ත, න සහජාතෙ පඤ්ච, න අඤ්ඤමඤ්ඤෙ පඤ්ච, න නිස්සයෙ පඤ්ච, න උපනිස්සයෙ සත්ත, න පුරෙජාතෙ ඡ, න පච්ඡාජාතෙ සත්ත, -පෙ- න සම්පයුත්තෙ පඤ්ච, න විප්පයුත්තෙ චත්තාරි, නො අත්ථියා චත්තාරි, නො නත්ථියා සත්ත, නො විගතෙ සත්ත, නො අවිගතෙ චත්තාරි, හෙතුපච්චයා නාරම්මණෙ චත්තාරි නාධිපතියා චත්තාරි, -පෙ- න සමනන්තරෙ චත්තාරි න අඤ්ඤමඤ්ඤෙ ද්වෙ, න උපනිස්සයෙ චත්තාරි, -පෙ- න සම්පයුත්තෙ ද්වෙ, න විප්පයුත්තෙ ද්වෙ, නො නත්ථියා චත්තාරි නො විගතෙ චත්තාරි, න හෙතුපච්චයා ආරම්මණෙ චත්තාරි, අධිපතියා පඤ්ච, අනන්තරෙ චත්තාරි, (අනුලොමමාතිකං ගණෙතබ්බා) අවිගතෙ සත්ත."
                    },
                    {
                        "type": "centered",
                        "text": "සරණ දුකං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "දුකපට්ඨානං නිට්ඨිතං.",
                        "level": 3
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [],
                "footnotes": []
            }
        }
    ],
    "bookId": 57,
    "pageOffset": -135
}