{
    "filename": "atta-ap-yam",
    "pages": [
        {
            "pageNum": 1,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "නමො තස්ස භගවතො අරහතො සම්මාසම්බුද්ධස්ස",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "අභිධම්මපිටකෙ",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "යමකප්පකරණ-අට්ඨකථා",
                        "level": 5
                    },
                    {
                        "type": "gatha",
                        "text": "සඞ්ඛෙපෙනෙව දෙවානං, දෙවදෙවො සුරාලයෙ;\nකථාවත්ථුප්පකරණං, දෙසයිත්වා රණඤ්ජහො.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "යමස්ස විසයාතීතො, නානායමකමණ්ඩිතං;\nඅභිධම්මප්පකරණං, ඡට්ඨං ඡට්ඨාන දෙසකො.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "යමකං අයමාවත්ත-නීලාමලතනූරුහො;\nයං දෙසයි අනුප්පත්තො, තස්ස සංවණ්ණනාක්කමො;\nඉදානි යස්මා තස්මාස්ස, හොති සංවණ්ණනා අයන්ති.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "1. මූලයමකං",
                        "level": 4
                    },
                    {
                        "type": "heading",
                        "text": "උද්දෙසවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "මූලයමකං , ඛන්ධයමකං, ආයතනයමකං, ධාතුයමකං, සච්චයමකං, සඞ්ඛාරයමකං, අනුසයයමකං, චිත්තයමකං, ධම්මයමකං, ඉන්ද්රියයමකන්ති ඉමෙසං දසන්නං යමකානං වසෙන ඉදං පකරණං දසවිධෙන විභත්තන්ති හි වුත්තං. තත්ථ යෙසං දසන්නං යමකානං වසෙන ඉදං පකරණං දසවිධෙන විභත්තං, තෙසඤ්චෙව ඉමස්ස ච පකරණස්ස නාමත්ථො තාව එවං වෙදිතබ්බො – කෙනට්ඨෙන යමකන්ති? යුගළට්ඨෙන. යුගළඤ්හි යමකන්ති වුච්චති – ‘යමකපාටිහාරියං, යමකසාලා’තිආදීසු විය. ඉති යුගළසඞ්ඛාතානං යමකානං වසෙන දෙසිතත්තා ඉමෙසු දසසු එකෙකං යමකං නාම. ඉමෙසං පන යමකානං සමූහභාවතො සබ්බම්පෙතං පකරණං යමකන්ති වෙදිතබ්බං."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ථ මූලවසෙන පුච්ඡාවිස්සජ්ජනං කත්වා දෙසිතත්තා දසන්නං තාව සබ්බපඨමං මූලයමකන්ති වුත්තං. තස්ස උද්දෙසවාරො, නිද්දෙසවාරොති ද්වෙ වාරා හොන්ති . තෙසු උද්දිට්ඨානුක්කමෙන නිද්දිසිතබ්බත්තා උද්දෙසවාරො පඨමො. තස්ස **යෙ කෙචි කුසලා ධම්මා, සබ්බෙ තෙ කුසලමූලා; යෙ වා පන කුසලමූලා, සබ්බෙ තෙ ධම්මා කුසලා**ති ඉදං යමකං ආදි . තස්ස කුසලාකුසලමූලසඞ්ඛාතානං ද්වින්නං අත්ථානං වසෙන අත්ථයමකන්ති වා, තෙසඤ්ඤෙව අත්ථානං වසෙන අනුලොමපටිලොමතො පවත්තපාළිධම්මවසෙන ධම්මයමකන්ති වා, අනුලොමපටිලොමතො පවත්තපුච්ඡාවසෙන පුච්ඡායමකන්ති වා තිධා යමකභාවො වෙදිතබ්බො. සෙසෙසුපි එසෙව නයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදානි ඉමෙසං යමකානං වසෙන දෙසිතෙ ඉමස්මිං මූලයමකෙ උද්දෙසවාරස්ස තාව නයයමකපුච්ඡාඅත්ථවාරප්පභෙදවසෙන පාළිවවත්ථානමෙව එවං වෙදිතබ්බං – කුසලත්තිකමාතිකාය හි ‘කුසලා ධම්මා’ති ඉදං ආදිපදං නිස්සාය මූලනයො, මූලමූලනයො, මූලකනයො, මූලමූලකනයොති ඉමෙ චත්තාරො නයා හොන්ති. තෙසං එකෙකස්මිං නයෙ මූලයමකං, එකමූලයමකං, අඤ්ඤමඤ්ඤමූලයමකන්ති තීණි තීණි යමකානි. එවං චතූසු නයෙසු ද්වාදස යමකානි, එකෙකස්මිං යමකෙ අනුලොමපටිලොමවසෙන ද්වෙ ද්වෙ පුච්ඡාති චතුවීසති පුච්ඡා, එකෙකාය පුච්ඡාය සන්නිට්ඨානසංසයවසෙන ද්වෙ ද්වෙ අත්ථාති අට්ඨචත්තාලීස අත්ථාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "ඒ භාග්‍යවත් වූ අරහත් වූ සම්මා සම්බුදුරජාණන් වහන්සේට නමස්කාරය වේවා!",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "අභිධම්ම පිටක",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "යමකප්පකරණ අටුවාව",
                        "level": 5
                    },
                    {
                        "type": "gatha",
                        "text": "දෙවියනට දෙවි වූ - කෙලෙසුන් දිනුව මුනිරජ\nසුරලොවදී දෙවිනට - කතා වස්තුව දෙසා සැකෙවින්",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "යම විසය ඉක්මවූ - යමක ලකර වූ නා නා\n‘බිදම් පකරණ’ නම් - සවැනි සවැනි වූ දේසක",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "යමක මෙය ඇවැටූ - නිලමල තනුරුහ\nදෙසී යම් පැමිණැක - එහි නයවැනුම් පිළිවෙල",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "1. මූල යමක වර්ණනාව",
                        "level": 4
                    },
                    {
                        "type": "heading",
                        "text": "උද්දේසවාර වර්ණනාව",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "මූල යමක, ඛන්‍ධ යමක, ආයතන යමක, ධාතු යමක, සච්ච යමක, සංඛාර යමක, අනුසය යමක, චිත්ත යමක, ධම්ම යමක, ඉන්‍ද්‍රිය යමක යයි මේ යමක දහය වශයෙන් මේ ප්‍රකරණය දහ ආකාරයකින් බෙදන ලදැයි කියන ලදි. ඒවායේ ද මේ ප්‍රකරණයේ ද නමෙහි අර්ථය පළමුකොට දතයුතුය. කුමක අර්ථයකින් යමක වේද? යුගලය යන අර්ථයෙන් එසේ යුගලය යමක යයි කියනු ලැබේ. යමාමහ පෙළහර, යමක සාලා ආදියෙහි මෙනි. මෙසේ යුගල සංඛ්‍යාත වූ යමක වශයෙන් දෙසන ලද බැවින් මේ දහයෙහි එක එකක් යමක නම් වේ. මේ යමකයන්ගේ වනාහි සමූහ භාවයෙන් මේ සියළු ප්‍රකරණය යමක යයි දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "එහි මූල වශයෙන් ප්‍රශ්න නගා විසඳීම් කොට දෙසන ලද බැවින් සියල්ලට පළමු දහය මූල යමක යයි කියන ලදි. එහි උද්දේස වාරය නිද්දේස වාරය යයි වාර දෙකක් වේ. ඒවායෙහි දක්වන ලද අනුක්‍රමයෙන් පෙන්විය යුත්ත උද්දේස වාරය පළමුව. එහි **යෙ කෙචි කුසලා ධම්මා සබ්බෙ තෙ කුසල මූලා, යෙ වා පන කුසල මූලා සබ්බෙ තෙ ධම්මා කුසලාති** මේ යමක ආදිය. එහි කුසලාකුසල මූල සංඛ්‍යාත අර්ථ දෙකක් වශයෙන් අර්ථ යමකයයි හෝ ඒ අර්ථයන්ගේ වශයෙන් අනුලොම් පිළිලොම් වශයෙන් පවත්නා පෙළ ධර්ම වශයෙන් ධර්මයමක යයි හෝ අනුලොම් පිළිලොම් වශයෙන් පවත්නා පුච්ඡා වශයෙන් පුච්ඡා යමක යයි හෝ තුන් ආකාර යමක භාවය දතයුතුය. සෙස්සෙහි ද මේ නයමය."
                    },
                    {
                        "type": "paragraph",
                        "text": "දැන් මෙම යමකයන්ගේ වශයෙන් දේශනා කරන ලද මේ මූල යමකයෙහි උද්දේශ වාරයේ පළමු නය යමක පුච්ඡා අර්ථ වාර ප්‍රභේද වශයෙන් පෙළෙහි නියමය මෙසේ දත යුතුය. කුසලත්‍රික මාතෘකාවෙහි **කුසලා ධම්මා** යන මේ මුල්පදය නිසා මූල නය, මූල මූල නය, මූලක නය, මූල මූළක නය යයි මේ සතර නය වේ. ඒවායේ එක එක නයෙහි මූල යමක, ඒකමූල යමක, අඤ්ඤමඤ්ඤ මූල යමක යයි යමක තුන බැගින් වේ. මෙසේ සතර නයෙහි යමක දොළොසෙක් වේ. එක් එක් යමකයෙහි අනුලෝම පටිලෝම වශයෙන් පුච්ඡා දෙක බැගින් පුච්ඡා විසිහතරෙක් වේ. එක් එක් පුච්ඡාවෙහි නිශ්චය සංශය වශයෙන් අර්ථ දෙක බැගින් අර්ථ හතලිස් අටෙක් වේ."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 3,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තත්ථ **යෙ කෙචි කුසලා ධම්මා**ති කුසලෙසු “කුසලා නු ඛො, න කුසලා නු ඛො”ති සන්දෙහාභාවතො ඉමස්මිං පදෙ සන්නිට්ඨානත්ථො වෙදිතබ්බො. **සබ්බෙ තෙ කුසලමූලා**ති “සබ්බෙ තෙ කුසලා ධම්මා කුසලමූලා නු ඛො, නනු ඛො”ති එවං විමතිවසෙන පුච්ඡිතත්තා ඉමස්මිං පදෙ සංසයත්ථො වෙදිතබ්බො. සො ච ඛො වෙනෙය්යානං සංසයට්ඨානෙ සංසයදීපනත්ථං වුත්තො, තථාගතස්ස පන සංසයො නාම නත්ථි. ඉතො පරෙසුපි පුච්ඡාපදෙසු එසෙව නයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "යථා ච කුසලපදං නිස්සාය ඉමෙ චත්තාරො නයා, එකෙකස්මිං නයෙ තිණ්ණං තිණ්ණං යමකානං වසෙන ද්වාදස යමකානි, එකෙකස්මිං යමකෙ ද්වින්නං ද්වින්නං පුච්ඡානං වසෙන චතුවීසති පුච්ඡා; එකෙකාය පුච්ඡාය ද්වින්නං ද්වින්නං අත්ථානං වසෙන අට්ඨචත්තාලීස අත්ථා ච හොන්ති. අකුසලපදං නිස්සායපි තථෙව. අබ්යාකතපදං නිස්සායපි තථෙව. තීණිපි පදානි එකතො කත්වා නිද්දිට්ඨං නාමපදං නිස්සායපි තථෙවාති කුසලත්තිකමාතිකාය චතූසු පදෙසු සබ්බෙපි සොළස නයා, අට්ඨචත්තාලීස යමකානි , ඡන්නවුති පුච්ඡා, ද්වෙනවුතිසතං අත්ථා ච උද්දෙසවසෙන වුත්තාති වෙදිතබ්බා. එත්තාවතා මූලවාරො නාම පඨමං උද්දිට්ඨො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තතො පරං **යෙ කෙචි කුසලා ධම්මා, සබ්බෙ තෙ කුසලහෙතූ**තිආදයො තස්සෙව මූලවාරස්ස වෙවචනවසෙන නව වාරා උද්දිට්ඨා. ඉති මූලවාරො, හෙතුවාරො, නිදානවාරො, සම්භවවාරො, පභවවාරො, සමුට්ඨානවාරො, ආහාරවාරො, ආරම්මණවාරො, පච්චයවාරො, සමුදයවාරොති සබ්බෙපි දස වාරා හොන්ති. තත්ථ මූලවාරෙ ආගතපරිච්ඡෙදෙනෙව සෙසෙසුපි නයාදයො වෙදිතබ්බාති සබ්බෙසුපි දසසු වාරෙසු සට්ඨිසතනයා, අසීතිඅධිකානි චත්තාරි යමකසතානි, සට්ඨිඅධිකානි නවපුච්ඡාසතානි, වීසාධිකානි එකූනවීසති අත්ථසතානි ච උද්දිට්ඨානීති වෙදිතබ්බානි. එවං තාව උද්දෙසවාරෙ නයයමකපුච්ඡාඅත්ථවාරප්පභෙදවසෙන පාළිවවත්ථානමෙව වෙදිතබ්බං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**මූලං හෙතු නිදානඤ්චා**ති ගාථා දසන්නම්පි වාරානං උද්දානගාථා නාම. තත්ථ මූලාදීනි සබ්බානිපි කාරණවෙවචනානෙව. කාරණඤ්හි පතිට්ඨානට්ඨෙන මූලං. අත්තනො ඵලනිප්ඵාදනත්ථං හිනොති පවත්තතීති හෙතු. ‘හන්ද, නං ගණ්හාථා’ති දස්සෙන්තං විය අත්තනො ඵලං නිදෙතීති නිදානං. එතස්මා ඵලං සම්භොතීති සම්භවො. පභවතීති පභවො. සමුට්ඨාති එත්ථ ඵලං, එතෙන වා සමුට්ඨාතීති සමුට්ඨානං. අත්තනො ඵලං ආහරතීති ආහාරො. අප්පටික්ඛිපිතබ්බෙන අත්තනො ඵලෙන ආලම්බියතීති ආලම්බණං. එතං පටිච්ච අප්පටික්ඛිපිත්වා ඵලං එති පවත්තතීති පච්චයො. එතස්මා ඵලං සමුදෙතීති සමුදයො. එවමෙතෙසං පදානං වචනත්ථො වෙදිතබ්බො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එහි **යෙ කෙචි කුසලා ධම්මා** යන කුසලයන්හි කුසල් වේද, කුසල් නොවේදැයි සැක බැවින් මේ පදයෙහි නිශ්චයාර්ථය දතයුතුය. **සබ්බෙ තෙ කුසලා මූලා** යන ඒ සියළු කුසල ධර්මයෝ කුසල් මුල් වේද නොවේදැයි විමති වශයෙන් විචාරන ලද බැවින් මේ පදයෙහි සංශයාර්ථය දතයුතුය. හෙද වනාහි වෛනේයයන්ගේ සංශය ස්ථානයෙහි සංශය දැක්වීම සඳහා කියන ලදි. තථාගතයන් වහන්සේට වනාහි සැකයක් නැත. මෙයින් පසුව පුච්ඡා පදවල ද මෙම නයම වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "යම්සේ කුසල පදය නිසා මේ සතර නය වේ. එක් එක් නයෙහි යමක තුන බැගින් යමක දොළොසසෙක් වේ. එක් එක් යමකයෙහි පුච්ඡා දෙක බැගින් විසිහතරෙක් වේ. එක් එක් පුච්ඡායෙහි අර්ථ දෙක බැගින් අර්ථ හතලිස් අටක් වේ. අකුසල පදය නිසා ද එසේමය. අව්‍යාකත්ත පදය නිසාද එසේමය. පද තුනම එකක් කොට නිර්දිෂ්ට නාම පදය නිසාද එසේම යයි කුසලත්‍රික මාතෘකාවේ සතර පදවල සියල්ල නය සොළසකි. යමක අටසාළිසකි. පුච්ඡා අනූහයකි. අර්ථ එකසිය අනූදෙකකි. උද්දේශ වශයෙන් කියන ලදැයි දතයුතුය. මෙපමණකින් මූලවාර නම් පළමු උද්දේශය වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉන්පසුව **යෙ කෙචි කුසලා ධම්මා සබ්බෙ තෙ කුසල හෙතු** යනාදිය එහි මූල වාරයේම පර්යාය වචන වශයෙන් වාර නවයක් දක්වන ලදි. මෙසේ මූල වාරය, හේතු වාරය, නිදාන වාරය, සම්භව වාරය, පභව වාරය, සමුට්ඨාන වාරය, ආහාර වාරය, ආලම්බන වාරය, පච්චය වාරය, සමුදය වාරය යයි සියල්ල දසවාරයක් වේ. එහි මූලවාරයෙහි පැමිණි පිරිසිඳීමෙන්ම සෙස්සෙහි ද නයාදිය දතයුතු යයි සියළු දසවාරවල නය එකසිය හැටක් වේ. යමක හාරසිය අසූවක් වේ. පුච්ඡා නවසිය හැටක් වේ. අර්ථ එක්දහස් නවසිය විස්සක් දක්වන ලදැයි දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "**මූලං හෙතු නිදානඤ්ච** යනාදි ගාථා දසවාරවල උදාන ගාථා නම් වේ. එහි මූලාදි සියල්ල ද හෙතු පර්යායම වේ. හේතු වනාහි පිහිටීම් අර්ථයෙන් **මූල** වේ. තමාගේ පල නිපදවීම සඳහා හිතවූයේ පවතීයයි **හේතු** වේ. එසේනම් එය ගනුවයි දක්වන්නාක් මෙන් තමාගේ පලය දක්වයි යනු **නිදාන** මේ මෙයින් පලය හටගනී යයි **සම්භව** වේ. පලය ප්‍රභව (ආරම්භ) වේ යයි **පභවො** වේ. එහි පලය හටගනී හෝ එයින් හටගනී හෝ **සමුට්ඨාන** වේ. තමාගේ පලය ගෙනඒනුයි **ආහාරො** වේ. ප්‍රතික්‍ෂෙප නොකළහැකි අර්ථයෙන් තමාගේ පලයෙන් එල්බී ගනීයයි **ආලම්බන** වේ. මෙයින් පලය උපදවානුයි **සමුදයො** වේ. මෙසේ මේ පදවල වචනාර්ථය දතයුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 5,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "උද්දෙසවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නිද්දෙසවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදානි **යෙකෙචි කුසලා ධම්මා**තිආදිනා නයෙන නිද්දෙසවාරො ආරද්ධො. තත්ථ **යෙ කෙචී**ති අනවසෙසවචනං. **කුසලා ධම්මා**ති කුසලත්තිකස්ස පදභාජනෙ වුත්තලක්ඛණා අනවජ්ජසුඛවිපාකා කුසලසභාවා. **සබ්බෙ තෙ කුසලමූලා**ති කිං තෙ සබ්බෙයෙව කුසලමූලාති පුච්ඡති. **තීණෙව කුසලමූලානී**ති න තෙ සබ්බෙ කුසලමූලානි, අලොභාදීනි පන තීණි එව කුසලමූලානීති අත්ථො. **අවසෙසා කුසලා ධම්මා න කුසලමූලා**ති අවසෙසා ඵස්සාදයො කුසලා ධම්මා කුසලමූලානි නාම න හොන්ති. අථ වා අවසෙසා ඵස්සාදයො කුසලා ධම්මායෙව නාම, න කුසලමූලානීතිපි අත්ථො. **යෙ වා පන කුසලමූලා**ති යෙ වා පන පඨමපුච්ඡාය දුතියපදෙන කුසලමූලාති තයො අලොභාදයො ගහිතා. **සබ්බෙ තෙ ධම්මා කුසලා**ති කිං තෙ සබ්බෙ තයොපි ධම්මා කුසලාති පුච්ඡති. **ආමන්තා**ති සබ්බෙසම්පි කුසලමූලානං කුසලභාවං සම්පටිච්ඡන්තො ආහ. අයං තාව මූලනයෙ මූලයමකස්ස අත්ථො. ඉමිනා උපායෙන සබ්බපුච්ඡාසු විස්සජ්ජනනයො වෙදිතබ්බො. යං පන යත්ථ විසෙසමත්තං අත්ථි, තදෙව වණ්ණයිස්සාම."
                    },
                    {
                        "type": "paragraph",
                        "text": "එකමූලයමකෙ තාව **සබ්බෙ තෙ කුසලමූලෙන එකමූලා**ති ගණනට්ඨෙන එකමූලකං අග්ගහෙත්වා සමානට්ඨෙන ගහෙතබ්බා. අයඤ්හෙත්ථ අත්ථො – සබ්බෙ තෙ කුසලමූලෙන සමානමූලා. යං ඵස්සස්ස මූලං, තදෙව වෙදනාදීනන්ති. අථ නෙසං තථාභාවං සම්පටිච්ඡන්තො **ආමන්තා**ති ආහ. **කුසලසමුට්ඨාන**න්ති කුසලචිත්තසමුට්ඨානරූපං දස්සිතං. **එකමූල**න්ති අලොභාදිනා කුසලමූලෙන සමානමූලං . යථෙව හි ඵස්සාදීනං අලොභාදයො හෙතුපච්චයත්තා මූලං, තථා තං සමුට්ඨානරූපස්සාපි, කුසලලක්ඛණාභාවෙන පන තං න කුසලං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අඤ්ඤමඤ්ඤයමකෙ ‘යෙකෙචි කුසලා’ති අපුච්ඡිත්වා **යෙකෙචි කුසලමූලෙන එකමූලා**ති පුච්ඡා කතා. කස්මා? ඉමිනාපි බ්යඤ්ජනෙන තස්සෙවත්ථස්ස සම්භවතො. **කුසලමූලානී**ති ඉදං පුරිමස්ස විසෙසනං. ‘මූලානි යානි එකතො උප්පජ්ජන්තී’ති හි වුත්තං, තානි පන කුසලමූලානිපි හොන්ති අකුසලඅබ්යාකතමූලානිපි, ඉධ කුසලමූලානීති විසෙසදස්සනත්ථමිදං වුත්තං. **අඤ්ඤමඤ්ඤමූලානි චා**ති අඤ්ඤමඤ්ඤං හෙතුපච්චයෙන පච්චයා හොන්තීති අත්ථො. තස්සෙව පටිලොමපුච්ඡාය ‘සබ්බෙ තෙ ධම්මා කුසලමූලෙන එකමූලා’ති අවත්වා **සබ්බෙ තෙ ධම්මා කුසලා**ති වුත්තං. කස්මා? අත්ථවිසෙසාභාවතො. කුසලමූලෙන එකමූලාති හි පුච්ඡාය කතාය ‘මූලානි යානි එකතො උප්පජ්ජන්තී’ති හෙට්ඨා වුත්තනයෙනෙව විස්සජ්ජනං කාතබ්බං භවෙය්ය, එවඤ්ච සති අත්ථවිසෙසාභාවො හොති. තස්මා තථා අකත්වා එවං පුච්ඡා කතා. ඉමිනා උපායෙන මූලමූලනයාදීසුපි අඤ්ඤමඤ්ඤමූලයමකෙ පුච්ඡාවිසෙසො වෙදිතබ්බො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "උද්දේසවාර වර්ණනාව නිමි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නිද්දෙසවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දැන් **යෙ කෙචි කුසලා ධම්මා** යනාදි නයින් නිද්දේස වාරය ආරම්භ කරන ලදි. එහි **යෙ කෙචි** යනු සියළු වචනයයි. කුසලා ධම්මා යනු කුසලත්‍රික පදභාජනයෙහි කියන ලක්‍ෂණ අනවද්‍ය සැප විපාක වූ කුසල ස්වභාවයයි. **සබ්බෙ තෙ කුසලමූලා** කිම? ඒ සියල්ලම කුසල මූලවේදැයි අසයි. **තීණෙව කුසල මූලානි** සියල්ල කුසල මූල නොවේ. අලෝභාදි තුනම කුසල් මුල් යන අර්ථයයි. **අවසෙසා කුසලා ධම්මා න කුසල මූලා** අවසේස වූ ඵස්සාදි ඵස්සාදිය කුසල ධර්ම වේ. කුසල් මුල් නොවේය යන අර්ථයි. **යෙ වා පන කුසලාමූලා** යෙ වා පන පළමුවන ඇසීමෙන් දෙවන පදයෙන් කුසල් මුල් යයි අලෝභාදී තුන ගන්නා ලදි. **සබ්බෙ තෙ ධම්ම කුසලා** කිම ඒ සියළු ධර්ම තුන කුසලදැ?යි අසයි. **ආමත්තා** සියළු කුසල මූලයන්ගේ කුසලභාවය පිළිගන්නේ කීය. මෙය පළමුව මූල නයෙහි මූල යමකගේ අර්ථයයි. මේ උපායෙන් සියළු පුච්ඡාවල විසඳීම් නය දතයුතුය. එහි විසේස තැන් පමණක් වර්ණනා කරන්නෙමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "පළමුව ඒකමූල යමකයෙහි **සබ්බෙ තෙ කුසල මූලෙන එක මූලා** ගණ අර්ථයෙන් ඒකමූල බව නොගෙන සමාන අර්ථයෙන් ගතයුතුය. මෙහි අර්ථය මෙයයි. ඒ සියල්ල කුසල මූලයෙන් සමාන මූල වේද? ඵස්සයේ වූ මූලය වේදනාදියේත් වේද? ඉක්බිති ඒවායේ එසේ වන බව පිළිගන්නේ **ආමන්තා** යයි කීය. **කුසල සමුට්ඨානං** කුසල සිතේ හටගන්නා රූපය දක්වන ලදි. **එකමූලං** අලොභාදි කුසල මූලයෙන් සමාන මුල් වේද, යම්සේ ඵස්සාදියේ අලෝභාදිය හේතුප්‍රත්‍ය බැවින් මුල් වේ. එසේම එයින් හටගන්වන රූපයේ ද මුල් වේ. කුසල ලක්‍ෂණ භාවයෙන් වනාහි එය කුසල නොවේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "අඤ්ඤමඤ්ඤ යමකයෙහි යෙ කෙචි කුසලා යයි නො අසා **යෙ කෙචි කුසල මූලෙන එකමූලා** යයි ඇසීම කරන ලදි. කුමක් නිසාද? මේ ව්‍යඤ්ජනයෙන් ම එහිම අර්ථය සම්භවය වූ හෙයිනි. **කුසලමූලා** යන මෙය පෙර වූවට විවේසන වේ. **මූලානි යානි එකතො උප්පජ්ජති** මෙයින් කියන ලදි. ඒවා වනාහි කුසලමූලද වේ. අකුසල අබ්‍යාකත මූලද වේ. මෙහි කුසල මූල යයි විශේෂ දැක්වීම සඳහා කියන ලදි. **අඤ්ඤමඤ්ඤ මූලානි ච** අඤ්ඤමඤ්ඤ හේතුප්‍රත්‍යයෙන් ප්‍රත්‍ය වේ යන අර්ථයයි. එහිම පටිලෝම පුච්ඡාවෙන් ඒ සියළු ධර්ම කුසල මූලයෙන් ඒකමූල යයි නොකියා **සබ්බෙ තෙ ධම්මා කුසලා** යයි කියන ලදි. කුමක් හෙයින්ද? අර්ථ විශේෂද් භාවයෙන්. කුසල මූලයෙන් ඒක මූල යයි පුච්ඡාවෙන් කරන ලද බැවින් යම් මූලයන් එකට උපදී යයි යට කියන ලද නයින්ම මූල විසඳීම කළයුතු වන්නේය. මෙසේ ඇතිකල්හි අර්ථ විශේෂ අභාවය වේ. එහෙයින් එසේ නොකොට මෙසේ පුච්ඡා කරන ලදි. මේ උපායෙන් මූලමූල නය ආදියෙහි ද අඤ්ඤමඤ්ඤ මූල යමකයෙහි පුච්ඡා විශේෂය දතයුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 7,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "මූලමූලනයෙ **සබ්බෙ තෙ කුසලමූලමූලා**ති සබ්බෙ තෙ කුසලමූලසඞ්ඛාතා මූලාති පුච්ඡති. **එකමූලමූලා**ති සමානට්ඨෙන එකමෙව මූලමූලං එතෙසන්ති එකමූලමූලා. **අඤ්ඤමඤ්ඤමූලමූලා**ති අඤ්ඤමඤ්ඤස්ස මූලං අඤ්ඤමඤ්ඤමූලං, අඤ්ඤමඤ්ඤමූලං හෙතුපච්චයට්ඨෙන මූලං එතෙසන්ති අඤ්ඤමඤ්ඤමූලමූලා."
                    },
                    {
                        "type": "paragraph",
                        "text": "මූලකනයෙ **කුසලමූලකා**ති හෙතුපච්චයට්ඨෙන කුසලං මූලං එතෙසන්ති කුසලමූලකා."
                    },
                    {
                        "type": "paragraph",
                        "text": "මූලමූලකනයෙ **කුසලමූලමූලකා**ති කුසලානං මූලං කුසලමූලං. හෙතුපච්චයට්ඨෙනෙව කුසලමූලං මූලං එතෙසන්ති කුසලමූලමූලකාති. අයං තාව කුසලපදං නිස්සාය නයයමකපුච්ඡාසු විසෙසත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අකුසලපදා**දීසුපි එසෙව නයො. අයං පන විසෙසො, **අහෙතුකං අකුසල**න්ති විචිකිච්ඡාය චෙව උද්ධච්චෙන ච සම්පයුත්තං මොහං සන්ධාය වුත්තං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අහෙතුකං අබ්යාකත**න්ති අට්ඨාරස චිත්තුප්පාදා රූපං, නිබ්බානඤ්ච. **අබ්යාකතමූලෙන න එකමූල**න්ති ඉධ පන ඨපෙත්වා සහෙතුකඅබ්යාකතසමුට්ඨානං රූපං, සෙසං ලබ්භති. සහෙතුකඅබ්යාකතසමුට්ඨානං රූපං අබ්යාකතමූලෙන එකමූලං හොති, තං අබ්බොහාරිකං කත්වා එකතො ලබ්භමානකවසෙනෙව චෙතං විස්සජ්ජනං කතං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**නාමා ධම්මා**ති නාමසඞ්ඛාතා ධම්මා. තෙ අත්ථතො චත්තාරො අරූපිනො ඛන්ධා, නිබ්බානඤ්ච. **නවෙව නාමමූලානී**ති කුසලාකුසලඅබ්යාකතමූලවසෙන නව මූලානි. **අහෙතුකං නාමං නාමමූලෙන න එකමූල**න්ති අහෙතුකං සබ්බම්පි අට්ඨාරස චිත්තුප්පාදවිචිකිච්ඡුද්ධච්චසම්පයුත්තමොහනිබ්බානසඞ්ඛාතං නාමං නාමමූලෙන න එකමූලං . න හි තං තෙන සද්ධිං උප්පජ්ජති. **සහෙතුකං නාමං නාමමූලෙනා**ති පදෙපි සහෙතුකං නාමං නාමමූලෙනාති අත්ථො. සෙසං සබ්බත්ථ උත්තානත්ථමෙවාති."
                    },
                    {
                        "type": "centered",
                        "text": "මූලවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "හෙතුවාරාදීසුපි ඉමිනාවුපායෙන අත්ථො වෙදිතබ්බො. **මූලං හෙතු නිදානඤ්චා**තිගාථා යථානිද්දිට්ඨානං දසන්නම්පි වාරානං පුන උද්දානවසෙනෙව වුත්තාති."
                    },
                    {
                        "type": "centered",
                        "text": "මූලයමකවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "2. ඛන්ධයමකං",
                        "level": 4
                    },
                    {
                        "type": "heading",
                        "text": "පණ්ණත්තිඋද්දෙසවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදානි මූලයමකෙ දෙසිතෙයෙව කුසලාදිධම්මෙ ඛන්ධවසෙන සඞ්ගණ්හිත්වා මූලයමකානන්තරං දෙසිතස්ස ඛන්ධයමකස්ස වණ්ණනා හොති. තත්ථ පාළිවවත්ථානං තාව එවං වෙදිතබ්බං – ඉමස්මිඤ්හි ඛන්ධයමකෙ තයො මහාවාරා හොන්ති – පණ්ණත්තිවාරො, පවත්තිවාරො, පරිඤ්ඤාවාරොති. තෙසු පණ්ණත්තිවාරො ඛන්ධානං නාමාභිධානසොධනවසෙනෙව ගතත්තා පණ්ණත්තිවාරොති වුච්චති. පවත්තිවාරො තෙන සොධිතනාමාභිධානානං ඛන්ධානං උප්පාදනිරොධවසෙන පවත්තිං සොධයමානො ගතො, තස්මා පවත්තිවාරොති වුච්චති. පරිඤ්ඤාවාරො ඉමිනානුක්කමෙන පවත්තානං ඛන්ධානං සඞ්ඛෙපෙනෙව තිස්සො පරිඤ්ඤා දීපයමානො ගතො, තස්මා පරිඤ්ඤාවාරොති වුච්චති. තත්ථ පණ්ණත්තිවාරො උද්දෙසනිද්දෙසවසෙන ද්වීහාකාරෙහි වවත්ථිතො. ඉතරෙසු විසුං උද්දෙසවාරො නත්ථි. ආදිතො පට්ඨාය පුච්ඡාවිස්සජ්ජනවසෙන එකධා වවත්ථිතා. තත්ථ **පඤ්චක්ඛන්ධා**තිපදං ආදිං කත්වා යාව **න ඛන්ධා, න සඞ්ඛාරා**ති පදං තාව පණ්ණත්තිවාරස්ස උද්දෙසවාරො වෙදිතබ්බො. පුච්ඡාවාරොතිපි තස්සෙව නාමං. තත්ථ **පඤ්චක්ඛන්ධා**ති අයං යමකවසෙන පුච්ඡිතබ්බානං ඛන්ධානං උද්දෙසො. **රූපක්ඛන්ධො…පෙ… විඤ්ඤාණක්ඛන්ධො**ති තෙසඤ්ඤෙව පභෙදතො නාමවවත්ථානං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "මූල මූල නයෙහි **සබ්බෙ තෙ කුසල මූලාති** ඒ සියළු කුසල මූල සංඛ්‍යාත මූල යයි අසයි. **එකමූලා** සමාන අර්ථයෙන් එකම මූල මූලය මොවුන්ට යයි එකමූල මුලා වේ. **අඤ්ඤමඤ්ඤ මූලමූලා** අඤ්ඤමඤ්ඤයන්ගේ මූලය අඤ්ඤමඤ්ඤ මූල වේ. අඤ්ඤමඤ්ඤ මූලය හේතුප්‍රත්‍ය අර්ථයෙන් වූ මූලය මොවුන්ටනුයි අඤ්ඤමඤ්ඤ මූලය වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "මූලක නයෙහි **කුසල මූලකාති** හේතුප්‍රත්‍ය අර්ථයෙන් කුසල මූල මොවුන්ට වේනුයි කුසල මූලක වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "මූල මූලක නයෙහි **කුසල මූල මූලකා** යයි කුසලයන්ගේ මූලය කුසලමූල වේ. හේතුප්‍රත්‍ය අර්ථයෙන්ම කුසලමූල මූල මොවුන්ට වේනුයි **කුසල මූල මූලක** යයි. මෙය පළමුව කුසල පදය නිසා නය යමක පුච්ඡාදියෙහි විශේෂ අර්ථ වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "අකුසල පද ආදියෙහි ද මෙම නයම වේ. මෙය වනාහි විශේෂයකි. **අහෙතුකං අකුසලං** යයි විචිකිච්ඡාවෙන් මෙන්ම උද්ධච්චයෙන් ද යුක්ත වූ මෝහය නිසා කියන ලදි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අහෙතුකං අබ්‍යාකතං** යනු අටළොස් සිත්, රූප, නිබ්බාන ද වේ. **අබ්‍යාකත මූලෙන එකමූලං** යයි මෙහි වනාහි සහේතුක අව්‍යාකත්ත සමුට්ඨාන රූප හැර, සෙස්ස ලැබේ. සහේතුක අබ්‍යාකත සමුට්ඨාන රූප අබ්‍යාකත මූලයෙන් ඒකමූලයක් වේ. එය ගණන් නොගෙන එක්තැන්ව ලැබීම් වශයෙන් ම මෙය විසඳීම් කරන ලදි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**නාමා ධම්මා** නාම සංඛ්‍යාත ධර්මය. ඒවා අර්ථ වශයෙන් අරූප ස්කන්ධ සතර සහ නිවන ද වේ. **නච්චෙ නාමමූලානි** කුසල අකුසල අබ්‍යාකත මූල වශයෙන් මූල නවයක් වේ. **අහෙතුකං නාමං නාම මූලෙන න එකමූලං** සියළු අහේතුක අටළොස් සිත් විචිකිච්ඡා උද්ධච්ච සම්ප්‍රයුක්ත මෝහ හා නිවන් සංඛ්‍යාත නාමය නාම මූලයෙන් ඒකමූලයක් නොවේ. එය එය සමග නූපදී. **සහෙතුකං නාමං නාම මූලෙන** යන පදයෙහි ද සහේතුක නාමය නාම මූලයෙන් ය යන අර්ථයයි. සෙසු සියල්ල නොගැඹුරු අරුත් වේ."
                    },
                    {
                        "type": "centered",
                        "text": "මූලවාර වර්ණනාව නිමි.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "හේතු වාරාදියෙහි ද මේ උපායෙන් අර්ථය දතයුතුය. **මූලංහෙතු නිදානඤ්ච** යන ගාථා දක්වන ලද දසවාරයන්ගේ නැවත උදාන වශයෙන් කියන ලදි."
                    },
                    {
                        "type": "centered",
                        "text": "මූලයමක වර්ණනාව නිමි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "2. ඛන්‍ධ යමක වර්ණනාව",
                        "level": 4
                    },
                    {
                        "type": "heading",
                        "text": "පණ්ණත්තිඋද්දෙසවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දැන් මූලයමකයෙහි දෙසන ලද්දා වූම කුසලාද ධර්මයන් ස්කන්ධ වශයෙන් සංග්‍රහකොට මූලයමකට අනතුරුව දෙසන ලද ඛන්‍ධ යමකයේ වර්ණනාව වේ. එහි පළමුව පෙළෙහි නියමය මෙසේ දතයුතුය. මේ ඛන්‍ධ යමකයෙහි මහාවාර තුනක් වේ. පණ්ණත්තිවාර, පවත්තිවාර, පරිඤ්ඤාවාර යනු ඒ තුනයි. ඒවායින් පණ්ණත්තිවාරය ස්කන්ධයන්ගේ නම් අභිධාත සෝධන වශයෙන් ගන්නා ලද බැවින් පණ්ණත්තිවාර යයි කියනු ලැබේ. පවත්තිවාරය එයින් ශෝධනය කරන ලද නම් අභිධාන ස්කන්ධයන්ගේ උත්පද නිරෝධ වශයෙන් පැවැත්ම ශෝධනය කරමින් ගන්නා ලදි. එහෙයින් පවත්තිවාර යයි කියනු ලැබේ. පරිඤ්ඤාවාරය මේ අනුක්‍රමයෙන් පවත්නා ස්කන්ධයන්ගේ සංක්‍ෂෙපයෙන් පරිඤ්ඤා තුනක් දක්වමින් ගන්නා ලදි. එහෙයින් පරිඤ්ඤාවාර යයි කියනු ලැබේ. එහි පණ්ණත්තිවාරය උද්දේස නිද්දේස වශයෙන් දෙයාකාරයකින් විස්තර කරන ලදි. ඉතිරි දෙකෙහි උද්දේසවාරය නැත. මුල පටන් පුච්ඡා විස්සජ්ජන (ඇසීම් විසඳීම්) වශයෙන් එක් ආකාරයකින් නියම කරන ලදි. එහි **පඤ්චක්ඛන්‍ධා** යන පදය මුල්කොට **න ඛන්‍ධා න සංඛාරා** පදය දක්වා පණ්ණත්තිවාරයේ උද්දේස වාරය දතයුතුයි. පුච්ඡාවාර යනු ද ඊටම නමකි. එහි **පඤ්චක්ඛන්‍ධා** යන මෙය යමක වශයෙන් ඇසිය යුතු ස්කන්ධයන්ගේ උද්දේසයයි. **රූපක්ඛන්‍ධො විඤ්ඤාණක්ඛන්‍ධො** යනු ඒවායෙම ප්‍රභේද වශයෙන් නාම වෙන් කිරීමයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 9,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉදානි ඉමෙසං ඛන්ධානං වසෙන පදසොධනවාරො, පදසොධනමූලචක්කවාරො, සුද්ධඛන්ධවාරො, සුද්ධඛන්ධමූලචක්කවාරොති චත්තාරො නයවාරා හොන්ති. තත්ථ **රූපං රූපක්ඛන්ධො, රූපක්ඛන්ධො රූප**න්තිආදිනා නයෙන පදමෙව සොධෙත්වා ගතො පදසොධනවාරො නාම. සො අනුලොමපටිලොමවසෙන දුවිධො හොති. තත්ථ අනුලොමවාරෙ ‘රූපං රූපක්ඛන්ධො, රූපක්ඛන්ධො රූප’න්තිආදීනි පඤ්ච යමකානි. පටිලොමවාරෙපි ‘න රූපං, න රූපක්ඛන්ධො; න රූපක්ඛන්ධො න රූප’න්තිආදීනි පඤ්චෙව. තතො පරං තෙසඤ්ඤෙව පදසොධනවාරෙ සොධිතානං ඛන්ධානං ‘රූපං රූපක්ඛන්ධො, ඛන්ධා වෙදනාක්ඛන්ධො’තිආදිනා නයෙන එකෙකඛන්ධමූලකානි චත්තාරි චත්තාරි චක්කානි බන්ධිත්වා ගතො පදසොධනමූලකානං චක්කානං අත්ථිතාය පදසොධනමූලචක්කවාරො නාම. සොපි අනුලොමපටිලොමවසෙන දුවිධො හොති. තත්ථ අනුලොමවාරෙ ‘රූපං රූපක්ඛන්ධො, ඛන්ධා වෙදනාක්ඛන්ධො’තිආදීනි එකෙකඛන්ධමූලකානි චත්තාරි චත්තාරි කත්වා වීසති යමකානි. පටිලොමවාරෙපි ‘න රූපං, න රූපක්ඛන්ධො; න ඛන්ධා න වෙදනාක්ඛන්ධො’තිආදීනි වීසතිමෙව."
                    },
                    {
                        "type": "paragraph",
                        "text": "තතො පරං **රූපං ඛන්ධො ඛන්ධා රූප**න්තිආදිනා නයෙන සුද්ධඛන්ධවසෙනෙව ගතො සුද්ධඛන්ධවාරො නාම. තත්ථ **ඛන්ධා රූප**න්තිආදීසු ඛන්ධා රූපක්ඛන්ධො, ඛන්ධා වෙදනාක්ඛන්ධොති අත්ථො ගහෙතබ්බො. කස්මා? නිද්දෙසවාරෙ එවං භාජිතත්තා. තත්ථ හි ‘රූපං ඛන්ධොති ආමන්තා. ඛන්ධා රූපක්ඛන්ධොති රූපක්ඛන්ධො ඛන්ධො චෙව රූපක්ඛන්ධො ච, අවසෙසා ඛන්ධා න රූපක්ඛන්ධො’ති එවං ‘ඛන්ධා රූප’න්තිආදීනං ඛන්ධා රූපක්ඛන්ධොතිආදිනා නයෙන පදං උද්ධරිත්වා අත්ථො විභත්තො. තෙනෙව ච කාරණෙනෙසෙ සුද්ධඛන්ධවාරොති වුත්තො. වචනසොධනෙ විය හි එත්ථ න වචනං පමාණං. යථා යථා පන සුද්ධඛන්ධා ලබ්භන්ති, තථා තථා අත්ථොව පමාණං. පරතො ආයතනයමකාදීසුපි එසෙව නයො. එසොපි ච සුද්ධඛන්ධවාරො අනුලොමපටිලොමවසෙන දුවිධො හොති. තත්ථ අනුලොමවාරෙ ‘රූපං ඛන්ධො ඛන්ධා රූප’න්තිආදීනි පඤ්ච යමකානි. පටිලොමවාරෙපි ‘න රූපං න ඛන්ධො, න ඛන්ධා න රූප’න්තිආදීනි පඤ්චෙව."
                    },
                    {
                        "type": "paragraph",
                        "text": "තතො පරං තෙසඤ්ඤෙව සුද්ධඛන්ධානං **රූපං ඛන්ධො, ඛන්ධා වෙදනා**තිආදිනා නයෙන එකෙකඛන්ධමූලකානි චත්තාරි චත්තාරි චක්කානි බන්ධිත්වා ගතො සුද්ධඛන්ධමූලකානං චක්කානං අත්ථිතාය සුද්ධඛන්ධමූලචක්කවාරො නාම. තත්ථ **ඛන්ධා වෙදනා**තිආදීසු ඛන්ධා වෙදනාක්ඛන්ධොතිආදිනා නයෙන අත්ථො වෙදිතබ්බො. ඉතරථා නිද්දෙසවාරෙන සද්ධිං විරොධො හොති. සොපි අනුලොමපටිලොමවසෙන දුවිධො හොති. තත්ථ අනුලොමවාරෙ ‘රූපං ඛන්ධො, ඛන්ධා වෙදනා’තිආදීනි එකෙකඛන්ධමූලකානි චත්තාරි චත්තාරි කත්වා වීසති යමකානි. පටිලොමවාරෙපි ‘න රූපං, න ඛන්ධො, න ඛන්ධා න වෙදනා’තිආදීනි වීසතිමෙව. එවං තාව එකෙන යමකසතෙන ද්වීහි පුච්ඡාසතෙහි එකෙකපුච්ඡාය සන්නිට්ඨානසංසයවසෙන ද්වෙ ද්වෙ අත්ථෙ කත්වා චතූහි ච අත්ථසතෙහි පටිමණ්ඩිතො පණ්ණත්තිවාරස්ස උද්දෙසවාරො වෙදිතබ්බොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "දැන් මේ ස්කන්ධයන්ගේ වශයෙන්, පද ශෝධන වාරය පදසෝධන මූල චක්කවාරය, සුද්ධ ඛන්‍ධවාරය, සුද්ධඛන්‍ධමූලචක්කවාරය යයි නය වාර සතරෙක් වේ. එහි **රූපං රූපක්ඛන්‍ධො රූපක්ඛන්‍ධො රූපං** යනාදී නයෙන් පදම ශෝධනය කොට යන ලද්දේ පදශෝධනය වාරය නම් වේ. එය අනුලෝම පටිලෝම වශයෙන් ද්විධ වේ. එහි අනුලෝම වාරයෙහි **රූපං රූපක්ඛන්‍ධො, රූපක්ඛන්‍ධො රූපං** යනාදි පංච යමක වේ. පටිලෝම වාරයෙහි ද **න රූපං න රූපක්ඛන්‍ධො න රූපක්ඛන්‍ධො න රූපං** යනාදි පසම ඉන්පසු ඒවායේම පද ශෝධන වාරයෙහි සේදූ ස්කන්ධවල **රූපං රූපක්ඛන්‍ධො, ඛන්‍ධා වෙදක්ඛන්‍ධො** යනාදි නයින් එක් එක් ඛන්‍ධ මූලකවල සතර සතර චක්‍ර බැඳ ගියේ පදශෝධන මූලකවල චක්‍රයන්ගේ ඇති බැවින් පදසෝධන මූල චක්කවාර නම් වේ. එය ද අනුලෝම පටිලෝම වශයෙන් ද්විධ වේ. එහි අනුලෝම වාරයෙහි **රූපං රූපක්ඛන්‍ධො, ඛන්‍ධා වෙදනාක්ඛන්‍ධො** යනාදි එක් එක් ඛන්‍ධ මූලකවල සතර සතර කොට යමක විස්සෙක් වේ. පටිලෝම වාරයෙහි ද **න රූපං රූපක්ඛන්‍ධො, න ඛන්‍ධා වෙදනාක්ඛන්‍ධො** යනාදි විස්සක්ම වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉන්පසු **රූපං රූපක්ඛන්‍ධො, ඛන්‍ධා රූපං** යනාදි නයින් සුද්ධ ඛන්‍ධ වශයෙන් ම ගියේ සුද්ධ ඛන්‍ධවාර නම් වේ. එහි **ඛන්‍ධා රූපං** යනාදියෙහි ඛන්‍ධ රූප ස්කන්ධ වේ. ඛන්‍ධ වේදනාස්කන්ධ වේ යන අර්ථය ගතයුතුය. කුමක් හෙයින්ද? නිද්දේස වාරයෙහි මෙසේ බෙදන ලද බැවිනි. එහි වනාහි **රූපං ඛන්‍ධොති ආමන්තා ඛන්‍ධා රූපක්ඛන්‍ධොති රූපක්ඛන්‍ධො ඛන්‍ධොචෙව රූපක්ඛන්‍ධො ච** **අවසෙසා ඛන්‍ධා න රූපක්ඛන්‍ධො** යයි මෙසේ **ඛන්‍ධා රූපං** යනාදියේ **ඛන්‍ධා රූපක්ඛන්‍ධො** යනාදි නයින් පද උදුරා අර්ථය බෙදන ලදි. ඒ කාරණයෙන් ද මෙය සුද්ධ ඛන්‍ධවාර යයි කියන ලදි. වචන සෝධනයෙහි මෙන් මෙහි ඛන්‍ධ යන වචනය ප්‍රමාණ නොවේ. සුද්ධ ඛන්‍ධ ලැබෙන හැටියෙන් අර්ථ ප්‍රමාණ වේ. පසුව එන ආයතන යමකාදියෙහි ද මෙම නයම වේ. මේ සුද්ධ ඛන්‍ධ වාරය ද අනුලෝම පටිලෝම වශයෙන් දෙවැදෑරුම් වේ. එහි අනුලෝම වාරයෙහි රූපං ඛන්‍ධො ඛන්‍ධා රූපං යනාදි පංච යමක වේ. පටිලෝම වාරයෙහි ද **න රූපං න ඛන්‍ධො න ඛන්‍ධා න රූපං** යනාදි පසක්ම වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉන්පසුව ඒ සුද්ධ ඛන්‍ධයන්ගේ ම **රූපං ඛන්‍ධො, ඛන්‍ධ වෙදනා** යනාදි නයින් එක් එක් ඛන්‍ධ මූලක සතර සතර සක් බැඳ ගියේ සුද්ධ මූලකවල සක් ඇති බැවින් සුද්ධ ඛන්‍ධ මූල චක්කවාර නම් වේ. එහි ඛන්‍ධා වෙදනා යනාදියෙහි **ඛන්‍ධ වෙදනා** ස්කන්ධ යයි ආදි නයින් අර්ථය දතයුතුය. නිද්දේස වාරය සමග අන් අයුරකින් විරෝධ වේ. එය ද අනුලෝම පටිලෝම වශයෙන් දෙයාකාර වේ. එහි අනුලෝම වාරයෙහි **රූපං ඛන්‍ධො ඛන්‍ධා වෙදනා** යනාදිය එක් එක් ඛන්‍ධමූලක සතර සතර කොටස් වශයෙන් විසි යමක වේ. පටිලෝම වාරයෙහි ද න **රූපං න ඛන්‍ධො, න ඛන්‍ධා න වෙදනා** යනාදි විස්සක්ම වේ. මෙසේ පළමුව යමක එක්සිය එකකින් පුච්ඡා දෙසීයකින් එක් එක් පුච්ඡායෙහි නිශ්චය සංශය වශයෙන් අර්ථ දෙක දෙක කොට අර්ථ හාරසියයකින් ප්‍රතිමණ්ඩිත පණ්ණත්තිවාරයේ උද්දේසවාරය දතයුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 11,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "පණ්ණත්තිඋද්දෙසවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පණ්ණත්තිනිද්දෙසවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදානි **රූපං රූපක්ඛන්ධො**තිආදිනා නයෙන නිද්දෙසවාරො ආරද්ධො. තත්ථ **රූපං රූපක්ඛන්ධො**ති යංකිඤ්චි රූපන්ති වුච්චති. සබ්බං තං රූපං රූපක්ඛන්ධොති වචනසොධනත්ථං පුච්ඡති. **පියරූපං සාතරූපං, රූපං, න රූපක්ඛන්ධො**ති යං ‘පියරූපං සාතරූප’න්ති එත්ථ රූපන්ති වුත්තං, තං රූපමෙව, න රූපක්ඛන්ධොති අත්ථො. **රූපක්ඛන්ධො රූපඤ්චෙව රූපක්ඛන්ධො චා**ති යො පන රූපක්ඛන්ධො, සො රූපන්තිපි රූපක්ඛන්ධොතිපි වත්තුං වට්ටතීති අත්ථො. **රූපක්ඛන්ධො රූප**න්ති එත්ථ පන යස්මා රූපක්ඛන්ධො නියමෙනෙව රූපන්ති වත්තබ්බො. තස්මා **ආමන්තා**ති ආහ. ඉමිනා උපායෙන සබ්බවිස්සජ්ජනෙසු අත්ථො වෙදිතබ්බො. යො පන යත්ථ විසෙසො භවිස්සති, තථෙව තං වණ්ණයිස්සාම . සඤ්ඤායමකෙ තාව **දිට්ඨිසඤ්ඤා**ති ‘පපඤ්චසඤ්ඤා’තිආදීසු ආගතා දිට්ඨිසඤ්ඤා. සඞ්ඛාරයමකෙ **අවසෙසා සඞ්ඛාරා**ති ‘අනිච්චා වත සඞ්ඛාරා’තිආදීසු ආගතා සඞ්ඛාරක්ඛන්ධතො අවසෙසා සඞ්ඛතධම්මා. පටිලොමවාරෙපි එසෙව නයොති."
                    },
                    {
                        "type": "centered",
                        "text": "පදසොධනවාරො නිට්ඨිතො.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "පදසොධනමූලචක්කවාරෙ **ඛන්ධා වෙදනාක්ඛන්ධො**ති යෙකෙචි ඛන්ධා, සබ්බෙ තෙ වෙදනාක්ඛන්ධොති පුච්ඡති. සෙසපුච්ඡාසුපි එසෙව නයො. පටිලොමෙ **න ඛන්ධා න වෙදනාක්ඛන්ධො**ති එත්ථ යෙ පඤ්ඤත්තිනිබ්බානසඞ්ඛාතා ධම්මා ඛන්ධා න හොන්ති, තෙ යස්මා වෙදනාක්ඛන්ධොපි න හොන්ති, තස්මා **ආමන්තා**ති ආහ. සෙසවිස්සජ්ජනෙසුපි එසෙව නයොති."
                    },
                    {
                        "type": "centered",
                        "text": "පදසොධනමූලචක්කවාරො නිට්ඨිතො.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සුද්ධඛන්ධවාරෙ **රූපං ඛන්ධො**ති යංකිඤ්චි රූපන්ති වුත්තං, සබ්බං තං ඛන්ධොති පුච්ඡති. තත්ථ යස්මා පියරූපසාතරූපසඞ්ඛාතං වා රූපං හොතු, භූතුපාදාරූපං වා, සබ්බං පඤ්චසු ඛන්ධෙසු සඞ්ගහං ගච්ඡතෙව. තස්මා **ආමන්තා**ති පටිජානාති. දුතියපදෙ ‘ඛන්ධා රූප’න්ති පුච්ඡිතබ්බෙ යස්මා රූපන්තිවචනෙන රූපක්ඛන්ධොව අධිප්පෙතො, තස්මා වචනං අනාදියිත්වා අත්ථවසෙන පුච්ඡන්තො **ඛන්ධා රූපක්ඛන්ධො**ති ආහ. ඉමිනා නයෙන සබ්බපදෙසු අත්ථො වෙදිතබ්බො. පරතො ආයතනයමකාදීනං නිද්දෙසවාරෙපි එසෙව නයො. **සඤ්ඤා ඛන්ධො**ති එත්ථාපි දිට්ඨිසඤ්ඤා වා හොතු, සඤ්ඤා එව වා, සබ්බායපි ඛන්ධභාවතො ආමන්තාති වුත්තං. **සඞ්ඛාරා ඛන්ධො**ති පදෙපි එසෙව නයො. ඛන්ධවිනිමුත්තකො හි සඞ්ඛාරො නාම නත්ථි."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "උද්දේසවාර වර්ණනාව නිමි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පණ්ණත්තිනිද්දෙසවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දැන් **රූපං රූපක්ඛන්‍ධො** යනාදි නයින් නිද්දේසවාරය අරඹන ලදි. එහි **රූපං රූපක්ඛන්‍ධො** යයි යම්කිසි රූපයක් කියයි. ඒ සියළු රූපය රූප ස්කන්ධය දැයි වචන සෝධනය සඳහා අසයි. **පියරූපං සාතරූපං රූපං, න රූපක්ඛන්‍ධො** යයි යම් ප්‍රිය රූපයක් මිහිරි රූපයක් යයි මෙහි රූපයයි කියන ලදි. ඒ රූපයම රූප ස්කන්ධ නොවේය යන අර්ථය වේ. **රූපක්ඛන්‍ධො රූපඤ්චෙව රූපක්ඛන්‍ධො ච** යයි යම් රූප ස්කන්ධයක් එය රූපය යයි ද රූප ස්කන්ධය යයිද කීමට වටී යන අර්ථයයි. **රූපක්ඛන්‍ධො රූපං** යන මෙහි වනාහි රූප ස්කන්ධය නියමයෙන්ම රූපය යයි කිවයුතුය. එහෙයින් **ආමන්තා** යයි කීය. මෙම උපායෙන් සියළු විසඳුම්වල අර්ථය දතයුතුය. යම්තැනක විශේෂයක් වේනම් එය වර්ණනා කරන්නෙමු. සංඥා යමකයෙහි පළමුව, **දිට්ඨි සඤ්ඤා** ප්‍රපංච සඤ්ඤා යනාදියෙහි දෘෂ්ටි සංඥා ආවේය. සංස්කාර යමකයෙහි **අවසෙසා සංඛාරා** යන ‘අනිච්චා වත සංඛාරා’ යනාදියෙහි ආවා වූ සංස්කාර ස්කන්ධයන් සංඛත ධර්ම අවසේසය. පටිලෝම වාරයෙහි ද මෙම නයම වේ."
                    },
                    {
                        "type": "centered",
                        "text": "පද සෝධන වාරය නිමි.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "පදසොධන මූලචක්ක වාරයෙහි **ඛන්‍ධා වෙදනාක්ඛන්‍ධො** යම්කිසි ස්කන්ධයක්, ඒ සියල්ල වේදනා ස්කන්ධයදැයි අසයි. ඒ වේදනා ස්කන්ධය, ස්කන්ධය ද වේදනා ස්කන්ධය ද වේ. සෙසු ස්කන්ධ වේදනා ස්කන්ධ නොවේය යන විසඳුමයි. සෙසු පුච්ඡාවල ද මෙම නයයි. පටිලෝමයෙහි **න ඛන්‍ධා න වෙදනාක්ඛන්‍ධො** යන මෙහි ප්‍රඥප්ති වූ නිර්වාණ සංඛ්‍යාත ධර්ම ස්කන්ධ නොවේ. ඒ යම් වේදනා ස්කන්ධ ද නොවේ. එහෙයින් **ආමන්තා** යයි කීය. සෙසු විසඳුම්වල ද මෙම නයම වේ."
                    },
                    {
                        "type": "centered",
                        "text": "පදසොධන මූල චක්කවාරය නිමි.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සුද්ධ ඛන්‍ධවාරයෙහි **රූපං ඛන්‍ධො** යයි යම්කිසි රූපයක් කියන ලදි. ඒ සියල්ල ස්කන්ධදැයි අසයි. එහි යම්හෙයකින් ප්‍රියරූප සාත රුප සංඛයාත වූ රූපය හෝ වේ. භූත උපාදාය රූප හෝ, සියල්ල පංච ස්කන්ධවල සංග්‍රහයට යේමය. එහෙයින් **ආමන්තා** යයි පිළිගනී, දෙවන පදයෙහි **ඛන්‍ධා රූපං** ඇසිය යුත්තෙහි යම්හෙයකින් රූපය යන වචනයෙන් රූපස්කන්ධයම අදහස් කරන ලදි. එහෙයින් වචනය නොගෙන අර්ථ වශයෙන් අසන්නේ, **ඛන්‍ධා රූපක්ඛන්‍ධො** යයි කීය. මෙම නයින් සියළු පදවල අර්ථය දතයුතුය. පසුව එන ආයතන යමකාදියේ නිද්දේස වාරයෙහි ද මෙම නයම වේ. **සඤ්ඤාක්ඛන්‍ධො** යයි මෙහි ද දෘෂ්ටි සංඥාව හෝ සංඥාව හෝ වේවා සියල්ල ද ස්කන්ධ භාවයෙන් ආමත්තා යයි කියන ලදි. **සංඛාර ඛන්‍ධො** යන පදයෙහි ද මෙම නයම වේ. ස්කන්ධ විනිර්මුක්තව සංස්කාර නම් නැත."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 13,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පටිලොමෙ **න රූපං න ඛන්ධො**ති යං ධම්මජාතං රූපං න හොති, තං ඛන්ධොපි න හොතීති පුච්ඡති. විස්සජ්ජනෙ පනස්ස **රූපං ඨපෙත්වා අවසෙසා ඛන්ධා න රූපං, ඛන්ධා**ති රූපතො අඤ්ඤෙ වෙදනාදයො ඛන්ධා රූපමෙව න හොන්ති, ඛන්ධා පන හොන්තීති අත්ථො. **රූපඤ්ච ඛන්ධෙ ච ඨපෙත්වා අවසෙසා**ති පඤ්චක්ඛන්ධවිනිමුත්තං නිබ්බානඤ්චෙව පඤ්ඤත්ති ච. ඉතො පරෙසුපි ‘අවසෙසා’ති පදෙසු එසෙව නයොති."
                    },
                    {
                        "type": "centered",
                        "text": "සුද්ධඛන්ධවාරො නිට්ඨිතො.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සුද්ධඛන්ධමූලචක්කවාරෙ **රූපං ඛන්ධො**තිආදීනං හෙට්ඨා වුත්තනයෙනෙව අත්ථො වෙදිතබ්බොති."
                    },
                    {
                        "type": "centered",
                        "text": "සුද්ධඛන්ධමූලචක්කවාරො නිට්ඨිතො.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "පණ්ණත්තිනිද්දෙසවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පවත්තිවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදානි **යස්ස රූපක්ඛන්ධො**තිආදිනා නයෙන පවත්තිවාරො ආරද්ධො. කස්මා පනෙත්ථ උද්දෙසවාරො න වුත්තොති? හෙට්ඨා දස්සිතනයත්තා. පණ්ණත්තිවාරස්මිඤ්හි උද්දෙසවාරෙ නයො දස්සිතො. තෙන පන නයෙන සක්කා සො ඉධ අවුත්තොපි ජානිතුන්ති තං අවත්වා නිද්දෙසවාරොව ආරද්ධො. ඉමස්මිං පන පවත්තිවාරසඞ්ඛාතෙ මහාවාරෙ උප්පාදවාරො, නිරොධවාරො, උප්පාදනිරොධවාරොති තයො අන්තරවාරා හොන්ති. තෙසු පඨමො ධම්මානං උප්පාදලක්ඛණස්ස දීපිතත්තා **උප්පාදවාරො**ති වුච්චති. දුතියො තෙසඤ්ඤෙව නිරොධලක්ඛණස්ස දීපිතත්තා **නිරොධවාරො**ති වුච්චති. තතියො උභින්නම්පි ලක්ඛණානං දීපිතත්තා **උප්පාදනිරොධවාරො**ති වුච්චති. උප්පාදවාරෙන චෙත්ථ ධම්මානං උප්පජ්ජනාකාරොව දීපිතො. නිරොධවාරෙන ‘උප්පන්නං නාම නිච්චං නත්ථී’ති තෙසඤ්ඤෙව අනිච්චතා දීපිතා. උප්පාදනිරොධවාරෙන තදුභයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ථ උප්පාදවාරෙ තාව තිණ්ණං අද්ධානං වසෙන ඡ කාලභෙදා හොන්ති – පච්චුප්පන්නො, අතීතො, අනාගතො, පච්චුප්පන්නෙනාතීතො, පච්චුප්පන්නෙනානාගතො, අතීතෙනානාගතොති. තෙසු **‘යස්ස රූපක්ඛන්ධො උප්පජ්ජතී’**ති පච්චුප්පන්නාභිධානවසෙන පච්චුප්පන්නො වෙදිතබ්බො. සො පච්චුප්පන්නානං ධම්මානං පච්චක්ඛතො ගහෙතබ්බත්තා අතිවිය සුවිඤ්ඤෙය්යොති පඨමං වුත්තො. **යස්ස රූපක්ඛන්ධො උප්පජ්ජිත්ථා**ති අතීතාභිධානවසෙන අතීතො වෙදිතබ්බො. සො පච්චක්ඛතො අනුභූතපුබ්බානං අතීතධම්මානං අනුමානෙන අනාගතෙහි සුවිඤ්ඤෙය්යතරත්තා දුතියං වුත්තො. **යස්ස රූපක්ඛන්ධො උප්පජ්ජිස්සතී**ති අනාගතාභිධානවසෙන අනාගතො වෙදිතබ්බො. සො පච්චක්ඛතො ච අනුභූතපුබ්බවසෙන ච ගහිතධම්මානුමානෙන ‘අනාගතෙපි එවරූපා ධම්මා උප්පජ්ජිස්සන්තී’ති ගහෙතබ්බතො තතියං වුත්තො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පටිලෝමයෙහි **න රූපං න ඛන්‍ධො** යම් ධර්ම ජාතයක් රූප නොවේ නම් එය ස්කන්ධ නොවේදැයි අසයි. මෙහි විසඳුමෙහි වනාහි රූපය හැර සෙසු ස්කන්ධ **න රූපං ඛන්‍ධා** යන රූපයෙන් අන්‍ය වූ වේදනාදි ස්කන්ධ රූඵයම නොවේ. ස්කන්ධ වේ යන අර්ථයයි. **රූපඤ්ච ඛන්‍ධෙ ච ඨපෙත්‍වා අවසෙසා** යයි පංච ස්කන්ධ විනිර්මුක්ත වූ නිවන ද ප්‍රඥප්තිය ද වේ. මෙයින් පසුව ද **අවසෙසා** යන පදවල මෙම නයම වේ."
                    },
                    {
                        "type": "centered",
                        "text": "සුද්ධ ඛන්‍ධවාරය නිමි.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සුද්ධඛන්‍ධමූලචක්ක වාරයෙහි **රූපං ඛන්‍ධො** යට කියන ලද නයින්ම දැනගත යුතුය."
                    },
                    {
                        "type": "centered",
                        "text": "සුද්ධඛන්‍ධ මූල චක්කවාර නිමි.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "පණ්ණත්තිවාර වර්ණනාව සමාප්තය.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පවත්තිවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දැන් **යස්ස රූපක්ඛන්‍ධො** යනාදි නයින් පවත්තිවාරය අරඹන ලදි. එහෙයින් මෙහි උද්දේසවාරය නොකියන ලදද? යට දක්වන ලද නය බව. පණ්ණත්තිවාර උද්දේස වාරයෙහි නය දක්වන ලදි. ඒ නයින් වනාහි මෙහි නොකියන ලද එය දැනගැනීමට හැකියයි එය නොකියා නිද්දේසවාරයම අරඹන ලදි. මේ පවත්තිවාර සංඛ්‍යාත මහා වාරයෙහි උප්පාද වාරය නිරොධ වාරය උප්පාදනිරොධවාරය යයි අන්තර්වාර තුනක් වේ. ඒවා අතුරෙන් පළමුව ධර්මයන්ගේ උප්පාද ලක්‍ෂණය දක්වන ලද බැවින් උප්පාදවාරය යයි කියයි. දෙවනුව ඒවායේම නිරෝධ ලක්‍ෂණ දක්වන ලද බැවින් නිරෝධවාරය යයි කියයි. තෙවනුව දෙකේම ලක්‍ෂණ දක්වන ලද බැවින් නිරෝධවාරය යයි කියයි. මෙහි උප්පාද වාරයෙන් ධර්මයන්ගේ උපදිනා ආකාරයම දක්වන ලදි. නිරෝධ වාරයෙන් ඉපදීම නම් නිත්‍ය නොවේ යයි ඒවායේම අනිත්‍යතා දක්වන ලදි. උප්පාද නිරෝධවාරයෙන් ඒ දෙකම දක්වන ලදි."
                    },
                    {
                        "type": "paragraph",
                        "text": "එහි උප්පාද වාරයෙහි පළමුව අද්ධ තුන වශයෙන් කාලභේද හයක් වේ. වර්තමානය, අතීතය, අනාගතය, වර්තමානයෙන් අතීතය, වර්තමානයෙන් අනාගතය, අතීතයේ අනාගතය. ඒවා අතරෙන් යමකට රූපස්කන්ධය උපදී යයි වර්තමානය අභිධාන වශයෙන් වර්තමානය දතයුතුය. එය වර්තමාන ධර්මයන්ගේ ප්‍රත්‍යක්‍ෂ වශයෙන් ගතයුතු හෙයින් අතිශයින් දැනගන්නේ යයි පළමුව කියන ලදි. **යස්ස රූපක්ඛන්‍ධො උප්පජ්ජත්‍ථා** අතීත අභිධාන වශයෙන් අතීතය දතයුතුය. එය ප්‍රත්‍යක්‍ෂයෙන් අනුභූත පූර්ව වූ අතීත ධර්මයන්ගේ අනුමානයෙන් අනාගතයෙහි හොඳින් දැනගැනීම කරන හෙයින් දෙවනුව කියන ලදි. **යස්ස රූපක්ඛන්‍ධො උප්පජ්ජිස්සති** අනාගත අභිධාන වශයෙන් අනාගතය දතයුතුය. එය ප්‍රත්‍යක්‍ෂයෙන් ම අනුභූත පූර්ව වශයෙන් ම ගන්නා ලද ධර්ම අනුමානයෙන් අනාගතයෙහි ද මෙබඳු වූ ධර්ම උපදින්නේ යයි ගතයුතු වශයෙන් තුන්වනුව කියන ලදි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 15,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**යස්ස රූපක්ඛන්ධො උප්පජ්ජති, තස්ස වෙදනාක්ඛන්ධො උප්පජ්ජිත්ථා**ති පච්චුප්පන්නෙන සද්ධිං අතීතාභිධානවසෙන පච්චුප්පන්නෙනාතීතො වෙදිතබ්බො. සො මිස්සකෙසු තීසු සුවිඤ්ඤෙය්යතරත්තා චතුත්ථං වුත්තො. **යස්ස රූපක්ඛන්ධො උප්පජ්ජති තස්ස වෙදනාක්ඛන්ධො උප්පජ්ජිස්සතී**ති පච්චුප්පන්නෙන සද්ධිං අනාගතාභිධානවසෙන පච්චුප්පන්නෙනානාගතො වෙදිතබ්බො. සො පච්චක්ඛතො ගහෙතබ්බානං ධම්මානං අත්ථිතාය අත්ථතො සුවිඤ්ඤෙය්යතරොති පඤ්චමං වුත්තො. **යස්ස රූපක්ඛන්ධො උප්පජ්ජිත්ථ, තස්ස වෙදනාක්ඛන්ධො උප්පජ්ජිස්සතී**ති අතීතෙන සද්ධිං අනාගතාභිධානවසෙන අතීතෙනානාගතො වෙදිතබ්බො. සො පුරිමෙහි දුවිඤ්ඤෙය්යොති ඡට්ඨං වුත්තො."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙතෙසු ඡසු කාලභෙදෙසු ය්වායං පඨමො පච්චුප්පන්නො, තත්ථ පුග්ගලතො, ඔකාසතො, පුග්ගලොකාසතොති තයො වාරා හොන්ති. තෙසු **යස්සා**ති පුග්ගලවසෙන ඛන්ධානං උප්පත්තිදීපනො **පුග්ගලවාරො**. **යත්ථා**ති ඔකාසවසෙන ඛන්ධානං උප්පත්තිදීපනො **ඔකාසවාරො**. **යස්ස යත්ථා**ති පුග්ගලොකාසවසෙන ඛන්ධානං උප්පත්තිදීපනො **පුග්ගලොකාසවාරො**. ඉමෙ පන තයොපි වාරා පඨමං අනුලොමනයෙන නිද්දිසිත්වා පච්ඡා පටිලොමනයෙන නිද්දිට්ඨා. තෙසු ‘උප්පජ්ජති’ ‘උප්පජ්ජිත්ථ,’ ‘උප්පජ්ජිස්සතී’ති වචනතො උප්පත්තිදීපනො අනුලොමනයො. ‘නුප්පජ්ජති’, ‘නුප්පජ්ජිත්ථ,’ ‘නුප්පජ්ජිස්සතී’ති වචනතො අනුප්පත්තිදීපනො පටිලොමනයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ථ පච්චුප්පන්නකාලෙ තාව පුග්ගලවාරස්ස අනුලොමනයෙ “යස්ස රූපක්ඛන්ධො උප්පජ්ජති, තස්ස වෙදනාක්ඛන්ධො උප්පජ්ජති. යස්ස වා පන වෙදනාක්ඛන්ධො උප්පජ්ජති, තස්ස රූපක්ඛන්ධො උප්පජ්ජති. යස්ස රූපක්ඛන්ධො උප්පජ්ජති, තස්ස සඤ්ඤාක්ඛන්ධො සඞ්ඛාරක්ඛන්ධො, විඤ්ඤාණක්ඛන්ධො, උප්පජ්ජති. යස්ස වා පන විඤ්ඤාණක්ඛන්ධො උප්පජ්ජති, තස්ස රූපක්ඛන්ධො උප්පජ්ජතී”ති එවං රූපක්ඛන්ධමූලකානි චත්තාරි යමකානි; “යස්ස වෙදනාක්ඛන්ධො උප්පජ්ජති, තස්ස සඤ්ඤාක්ඛන්ධො උප්පජ්ජතී”තිආදිනා නයෙන වෙදනාක්ඛන්ධමූලකානි තීණි; සඤ්ඤාක්ඛන්ධමූලකානි ද්වෙ; සඞ්ඛාරක්ඛන්ධමූලකං එකන්ති අග්ගහිතග්ගහණෙන දස යමකානි හොන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ථ රූපක්ඛන්ධමූලකෙසු චතූසු ආදිතො එකමෙව විස්සජ්ජිතං. සෙසානි තෙන සදිසවිස්සජ්ජනානීති තන්තියා ලහුභාවත්ථං සඞ්ඛිත්තානි. වෙදනාක්ඛන්ධාදිමූලකෙසුපි ‘ආමන්තා’ති එකසදිසමෙව විස්සජ්ජනං. තස්මා තානිපි තන්තියා ලහුභාවත්ථං සඞ්ඛිත්තානෙවාති එවමෙතානි පච්චුප්පන්නකාලෙ පුග්ගලවාරෙ අනුලොමනයෙ එකයමකවිස්සජ්ජනෙනෙව දස යමකානි විස්සජ්ජිතානි නාම හොන්තීති වෙදිතබ්බානි. යථා ච පුග්ගලවාරෙ දස, එවං ඔකාසවාරෙ දස, පුග්ගලොකාසවාරෙ දසාති පච්චුප්පන්නකාලෙ තීසු වාරෙසු අනුලොමනයෙ තිංස යමකානි හොන්ති. යථා ච අනුලොමනයෙ, එවං පටිලොමනයෙපීති සබ්බානිපි පච්චුප්පන්නකාලෙ සට්ඨි යමකානි හොන්ති. තෙසු වීසපුච්ඡාසතං, චත්තාරීසානි ච ද්වෙ අත්ථසතානි හොන්තීති වෙදිතබ්බානි. එවං සෙසෙසුපි පඤ්චසු කාලභෙදෙසු පුග්ගලාදිභෙදතො අනුලොමපටිලොමනයවසෙන ඡ ඡ වාරා. එකෙකස්මිං වාරෙ දස දස කත්වා සට්ඨි සට්ඨි යමකානීති තීණි යමකසතානි. තානි පුරිමෙහි සද්ධිං සට්ඨාධිකානි තීණි යමකසතානි, වීසාධිකානි සත්තපුච්ඡාසතානි, චත්තාරීසානි ච චුද්දස අත්ථසතානි හොන්ති. ඉදං තාව උප්පාදවාරෙ පාළිවවත්ථානං. යථා ච උප්පාදවාරෙ, තථා නිරොධවාරෙපි, උප්පාදනිරොධවාරෙපීති සබ්බස්මිම්පි පවත්තිමහාවාරෙ අසීති යමකසහස්සං, සට්ඨිසතාධිකානි ද්වෙ පුච්ඡාසහස්සානි, වීසං තිසතාධිකානි ච චත්තාරි අත්ථසහස්සානි වෙදිතබ්බානි."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**යස්ස රූපක්ඛන්‍ධො උප්පජ්ජති, තස්ස වෙදනාක්ඛන්‍දො උප්පජ්ජිත්‍ථ** මෙසේ වර්තමානය සමග අතීත අභිධාන වශයෙන් වර්තමානයෙන් අතීතය දතයුතුය. එය තුන් මිශ්‍රකවල දැනගත හැකි බැවින් සතරවනුව කියන ලදි. **යස්ස රූපක්ඛන්‍ධො** **උප්පජ්ජති, තස්ස වෙදනාක්ඛන්‍ධො උප්පජ්ජිස්සති **වර්තමානය සමග අනාගත අභිධාන වශයෙන් වර්තමානයෙන් අනාගතය දතයුතුය. එය ප්‍රත්‍යක්‍ෂ වශයෙන් ගතයුත්තක් ඇති බැවින් අර්ථ වශයෙන් හොඳින් දතහැකි යයි පස්වනුව කියන ලදි. **යස්ස රූපක්ඛන්‍ධො උප්පජ්ජිත්‍ථ තස්ස වෙදනාක්ඛන්‍ධො උප්පජ්ජිස්සති** මෙසේ වර්තමානය සමග අනාගත අභිධාන වශයෙන් අතීතයෙන් අනාගතය දතයුතුය. එය මුලින් දැනගැනීමට අපහසු යයි සවැනිව කියන ලදි."
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙසේ මේ කාලභේද සයෙහි යමක් මේ පළමු වර්තමානය, එහි පුග්ගලතො ඔකාසතො පුග්ගලො කාසතො යයි වාර තුනක් වේ. ඒවායින් **යස්ස** මෙසේ පුද්ගල වශයෙන් ස්කන්ධයන්ගේ උත්පත්තිය දක්වන්නේ පුද්ගල වාර වේ. **යත්‍ථ **මෙසේ ඕකාශ වශයෙන් ස්කන්ධයන්ගේ උත්පත්ති දක්වන්නේ ඕකාසවාර වේ. යස්ස යත්‍ථ මෙසේ පුද්ගල ඕකාශ වශයෙන් ස්කන්ධයන්ගේ උත්පත්ති දක්වන්නේ පුද්ගල ඕකාස වාර වේ. මේ වාර තුනම පළමුව අනුලෝම නයින් නිද්දේස කොට පසුව පටිලෝම නයෙන් නිර්දිෂ්ඨය. ඒවායින් “උප්පජ්ජති’, ‘උප්පජ්ජිත්‍ථ’, ‘උප්පජ්ජස්සති’ මෙසේ වචනයෙන් උත්පත්ති දක්වන්නේ අනුලෝම නය වේ. ‘නූප්පජ්ජති’, ‘නූප්පජ්ජිත්‍ථ’, ‘නූප්පජ්ජිස්සති’ මෙසේ වචනයෙන් අනුත්පත්ති දක්වන්නේ පටිලෝම නය වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "එහි වර්තමාන කාලයෙහි පළමුව පුද්ගල වාරයේ අනුලෝම නයෙහි **යස්ස රූපක්ඛන්‍ධො උප්පජ්ජති, තස්ස වෙදනාක්ඛන්‍ධො උප්පජ්ජති යස්ස වා පන වෙදනාක්ඛන්‍ධො උප්පජ්ජති, තස්ස රූපක්ඛන්‍ධො උප්පජ්ජති, තස්ස සඤ්ඤාක්ඛන්‍ධො, සංඛාරක්ඛන්‍ධො, විඤ්ඤාණක්ඛන්‍ඡො උප්පජ්ජති, යස්ස වා පන විඤ්ඤාණක්ඛන්‍ඡො උප්පජ්ජති, තස්ස රූපක්ඛන්‍ධො උප්පජ්ජති.** මෙසේ රූපස්කන්ධ මූලක, යමක සතර වේ. **යස්ස වෙදනාක්ඛන්‍ධො උප්පජ්ජති, තස්ස සඤ්ඤාක්ඛන්‍ධො උප්පජ්ජති** යනාදි නයෙන් වෙදනාක්ඛන්‍ධ මූලක තුන, සඤ්ඤාක්ඛන්‍ධ මූලක දෙක, සංඛාරක්ඛන්‍ධ මූලක එක යයි අගහිත ගහණයෙන් (නොගන්නා ලද්ද ගැනීමෙන්) යමක දහයක් වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "එහි රූපස්කන්ධ මූලක සතරෙහි මුලින් එකක්ම විසඳන ලදි. සෙස්ස ඊට සමාන විසඳීම් යයි පෙළෙහි ලඝුභාවය සඳහා සංක්‍ෂිප්ත කරන ලදි. වෙදනාක්ඛන්‍ධාදි මූලකවල ද **ආමන්තා** යයි එකසමාන විසඳීම වේ. එහෙයින් ඒවා ද පෙළෙහි ලඝුභාවය සඳහා සංක්‍ෂේප කරන ලද්දේමය. මෙසේ මේවා වර්තමාන කාලයේ පුද්ගලවාරයේ අනුලෝම නයෙහි එක් යමක විසඳීමකින්ම යමක දහයක් විසඳන ලද්දේ වේයයි දතයුතුය. පුද්ගල වාරයෙහි දහය මෙන් ඕකාස වාරයෙහි දහයක් ද පුග්ගලොකාස වාරයෙහි දහයක්දැයි වර්තමාන කාලයේ තුන්වාරයේ අනුලෝම නයෙහි යමක තිහක් වේ. අනුලෝමයෙහි මෙන් පටිලෝම නයෙහි ද සියල්ල වර්තමාන කාලයේ යමක හැටක් වේ. ඒවායේ පුච්ඡා එක්සිය විස්සක් වේ. අර්ථ දෙසිය සතලිසක් වේ යයි දතයුතු. මෙසේ සෙසු පස්කාල භේදයෙහි ද පුද්ගලාදි භේදයෙන් අනුලෝම පටිලෝම නය වශයෙන් සය සය වාර, එක එක වාරයෙහි දහය දහය කොට හැට හැට යමක යයි යමක තුන්සියයක්. ඒවා පෙර ඒවා සමග යමක තුන්සිය හැටක් වේ. පුච්ඡා හත්සිය විස්සක් වේ. අර්ථ එක්දහස් හාරසිය හතලිහක් වේ. මෙය උප්පාද වාරයෙහි පෙළෙහි නියමයයි. උප්පාද වාරයෙහි නිරෝධ වාරයෙහිද උප්පාද නිරෝධ වාරයෙහිදැයි සියළුම පවත්ති මහා වාරයෙහි යමක එක්දහස් අසූවක් වේ. පුච්ඡා දෙදහස් එකසිය හැටක් වේ. අර්ථ හාරදහස් තුන්සිය විස්සක් වේ යයි දතයුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 17,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පාළි පන උප්පාදවාරෙ නිරොධවාරෙ ච තීසු අසම්මිස්සකකාලභෙදෙසු තස්මිං තස්මිං වාරෙ එකෙකමෙව යමකං විස්සජ්ජෙත්වා සඞ්ඛිත්තා. තීසු මිස්සකකාලභෙදෙසු ‘යස්ස වෙදනාක්ඛන්ධො උප්පජ්ජති, තස්ස සඤ්ඤාක්ඛන්ධො උප්පජ්ජිත්ථා’තිආදිනා නයෙන වෙදනාක්ඛන්ධාදිමූලකෙසුපි එකං යමකං විස්සජ්ජිතං. උප්පාදනිරොධවාරෙ පන ඡසුපි කාලභෙදෙසු තං විස්සජ්ජිතමෙව. සෙසානි තෙන සමානවිස්සජ්ජනත්තා සඞ්ඛිත්තානීති. ඉදං සකලෙපි පවත්තිමහාවාරෙ පාළිවවත්ථානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථවිනිච්ඡයත්ථං පනස්ස ඉදං ලක්ඛණං වෙදිතබ්බං – ඉමස්මිඤ්හි පවත්තිමහාවාරෙ චතුන්නං පඤ්හානං පඤ්ච විස්සජ්ජනානි සත්තවීසතියා ඨානෙසු පක්ඛිපිත්වා අත්ථවිනිච්ඡයො වෙදිතබ්බො. තත්ථ පුරෙපඤ්හො, පච්ඡාපඤ්හො, පරිපුණ්ණපඤ්හො, මොඝපඤ්හොති ඉමෙ චත්තාරො පඤ්හා නාම. එකෙකස්මිඤ්හි යමකෙ ද්වෙ ද්වෙ පුච්ඡා. එකෙකපුච්ඡායපි ද්වෙ ද්වෙ පදානි. තත්ථ යාය පුච්ඡාය විස්සජ්ජනෙ එකෙනෙව පදෙන ගහිතක්ඛන්ධස්ස උප්පාදො වා නිරොධො වා ලබ්භති , අයං **පුරෙපඤ්හො** නාම. යාය පන පුච්ඡාය විස්සජ්ජනෙ ද්වීහිපි පදෙහි ගහිතක්ඛන්ධානං උප්පාදො වා නිරොධො වා ලබ්භති, අයං **පච්ඡාපඤ්හො** නාම. යාය පන පුච්ඡාය විස්සජ්ජනෙ එකෙනපි පදෙන ගහිතක්ඛන්ධස්ස ද්වීහිපි පදෙහි ගහිතක්ඛන්ධානං උප්පාදො වා, නිරොධො වා ලබ්භති, අයං **පරිපුණ්ණපඤ්හො** නාම. යාය පන පුච්ඡාය විස්සජ්ජනෙ පටික්ඛෙපො වා, පටිසෙධො වා ලබ්භති, අයං **මොඝපඤ්හො** නාම. යස්මා පනෙස අදස්සියමානො න සක්කා ජානිතුං, තස්මා නං දස්සයිස්සාම."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘යත්ථ රූපක්ඛන්ධො නුප්පජ්ජති, තත්ථ වෙදනාක්ඛන්ධො නුප්පජ්ජතී’ති පුච්ඡාය තාව උප්පජ්ජතීති ඉමස්මිං විස්සජ්ජනෙ එකෙනෙව පදෙන ගහිතස්ස වෙදනාක්ඛන්ධස්ස උප්පාදො ලබ්භති, ඉති අයඤ්චෙව අඤ්ඤො ච එවරූපො පඤ්හො පුරෙපඤ්හොති වෙදිතබ්බො. ‘යස්ස රූපක්ඛන්ධො උප්පජ්ජිත්ථ, තස්ස වෙදනාක්ඛන්ධො උප්පජ්ජිත්ථා’ති පුච්ඡාය පන ‘ආමන්තා’ති ඉමස්මිං විස්සජ්ජනෙ ද්වීහි පදෙහි ගහිතානං රූපවෙදනාක්ඛන්ධානං යස්ස කස්සචි සත්තස්ස අතීතෙ උප්පාදො ලබ්භති. ඉති අයඤ්චෙව අඤ්ඤො ච එවරූපො පඤ්හො පච්ඡාපඤ්හොති වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘යස්ස රූපක්ඛන්ධො උප්පජ්ජති, තස්ස වෙදනාක්ඛන්ධො උප්පජ්ජතී’ති ඉමාය පන පඨමපුච්ඡාය ‘අසඤ්ඤසත්තං උපපජ්ජන්තාන’න්තිආදිකෙ ඉමස්මිං විස්සජ්ජනෙ ‘අසඤ්ඤසත්තං උපපජ්ජන්තානං තෙසං රූපක්ඛන්ධො උප්පජ්ජති, නො ච තෙසං වෙදනාක්ඛන්ධො උප්පජ්ජතී’ති ඉමස්මිං කොට්ඨාසෙ එකෙනෙව පදෙන ගහිතස්ස රූපක්ඛන්ධස්සපි උප්පාදො ලබ්භති. ‘පඤ්චවොකාරං උපපජ්ජන්තානං තෙසං රූපක්ඛන්ධො ච උප්පජ්ජති වෙදනාක්ඛන්ධො ච උප්පජ්ජතී’ති ඉමස්මිං කොට්ඨාසෙ ද්වීහිපි පදෙහි සඞ්ගහිතානං රූපවෙදනාක්ඛන්ධානම්පි උප්පාදො ලබ්භති. ඉති අයඤ්චෙව අඤ්ඤො ච එවරූපො පඤ්හො පරිපුණ්ණපඤ්හොති වෙදිතබ්බො. පුරෙපච්ඡාපඤ්හොතිපි එතස්සෙව නාමං. එතස්ස හි විස්සජ්ජනෙ පුරිමකොට්ඨාසෙ එකෙන පදෙන සඞ්ගහිතස්ස රූපක්ඛන්ධස්සෙව උප්පාදො දස්සිතො. දුතියකොට්ඨාසෙ ද්වීහි පදෙහි සඞ්ගහිතානං රූපවෙදනාක්ඛන්ධානං. ඉමිනායෙව ච ලක්ඛණෙන යත්ථ එකෙන පදෙන සඞ්ගහිතස්ස ඛන්ධස්ස උප්පාදො වා නිරොධො වා ලබ්භති, සො පුරෙපඤ්හොති වුත්තො. යත්ථ ද්වීහිපි පදෙහි සඞ්ගහිතානං ඛන්ධානං උප්පාදො වා නිරොධො වා ලබ්භති, සො පච්ඡාපඤ්හොති වුත්තො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පෙළෙහි වනාහි උප්පාද නිරෝධ වාරවල අසම්මිශ්‍ර කාල භේදවල ඒ ඒ වාරයෙහි යමක එක එකම විසඳා සංක්‍ෂේප කරන ලදි. මිශ්‍රක කාලභේද තුනෙහි **යස්ස වෙදනාක්ඛන්‍ධො උප්පජ්ජති, තස්සෙ සඤ්ඤාක්ඛන්‍ධො උප්පජ්ජිත්‍ථ** යනාදි නයෙන් වෙදනාක්ඛන්‍ධාදි මූලකවලද එක් යමකයක් විසඳන ලදි. සෙස් එයින් සමාන විසඳීම් වන බැවින් සංක්‍ෂේප කරන ලදි. මෙය සියළුම පවත්ති මහා වාරයෙහි පෙළේ නියමයයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙහි අර්ථ විනිශ්චය සඳහා මේ ලක්‍ෂණය දතයුතුයි. මේ මහා පවත්තිවාරයෙහි සතර ප්‍රශ්නයන්ගේ පස් විසඳුම් විසිහත් තැනක බහා අර්ථ විනිශ්චය දතයුතුය. එහි පෙර ප්‍රශ්නය පසු ප්‍රශ්නය පරිපූර්ණ ප්‍රශ්නය මෝඝ ප්‍රශ්නය යයි මේ සතර ප්‍රශ්න නම් වේ. එක එක යමකයෙහි පුච්ඡා දෙක දෙක වේ. එක එක පුච්ඡාවෙහි දෙක දෙක පද වේ. එහි යම් පුච්ඡාවක් විසඳන කල්හි එකම පදයකින් ගන්නා ලද ස්කන්ධයේ උප්පාදය හෝ නිරෝධය හෝ ලැබේ. මෙය පෙරපද ප්‍රශ්නය වේ. යම් පුච්ඡාවක් විසඳන කල්හි පද දෙකකින් ගන්නා ලද ස්කන්ධයන්ගේ උප්පාදය හෝ නිරෝධය හෝ ලැබේ. මෙය පසු ප්‍රශ්නය නම් වේ. යම් පුච්ඡාවක් විසඳන කල්හි එකම පදයෙන් ගන්නා ස්කන්ධයේ පද දෙකකින් ගන්නා ලද ස්කන්ධයන්ගේ උප්පාදය හෝ නිරෝධය හෝ ලැබේ. මෙය පරිපූර්ණ ප්‍රශ්නය නම් වේ. යම් පුච්ඡාවක් විසඳන කල්හි ප්‍රතික්‍ෂේපය හෝ ප්‍රතිෂේධය හෝ ලැබේ. මෙය මෝඝ ප්‍රශ්නය නම් වේ. යම්හෙයකින් මෙය නො දක්නේ දැනීමට නොහැකි වේ. එහෙයින් එය දක්වන්නෙමු."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යත්‍ථ රූපක්ඛන්‍ධො නූප්පජ්ජති තත්‍ථ වෙදනක්ඛන්‍ධො නූප්පජ්ජති** යම්තැනක රූපස්කන්ධය නූපදීද එතැන වේදනාස්කන්ධය නූපදී යනු ඇසීමෙන් **උප්පජ්ජති** උපදී යන මේ විසඳුමෙහි ඒක පදයකින් ගන්නා ලද වේදනා ස්කන්ධයේ ඉපදීම ලැබේ. මෙසේ මෙය ද අන්‍ය වූ ද මෙබඳු රූප වූ ප්‍රශ්නය පෙර ප්‍රශ්නය යයි දතයුතු."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යස්ස රූපක්ඛන්‍ධො උප්පජ්ජිත්‍ථ තස්ස වෙදනාක්ඛන්‍ධො උප්පජ්ජිත්‍ථ** යමකට රූපස්කන්ධය ඉපදුනේය. ඊට වේදනා ස්කන්ධය ඉපදුනේද? ඇසීමෙන් වනාහි **ආමන්තා** ඔව් යයි මේ විසඳුමේ දෙපදයකින් ගන්නා ලද රූප වේදනා ස්කන්ධයන්ගේ යම්කිසි සත්ත්වයෙකුට අතීතේ උපත ලබයි. මෙසේ මෙය ද අන්‍ය වූ ද මෙබඳුරූප වූ ප්‍රශ්නය පරිපූර්ණ වූ ප්‍රශ්නය යයි දතයුතුය. පෙර ප්‍රශ්නය යනුද මෙයටම නමකි. මේ විසඳුමේ පළමු කොටසෙහි එක පදයකින් සංග්‍රහ කරන ලද රූපස්කන්ධයේම උපත දක්වන ලදි. දෙවන කොටසෙහි දෙපදයකින් සංග්‍රහ කරන ලද රූපවේදනා ස්කන්ධයන්ගේ උපත දක්වන ලදි. මේ ලක්‍ෂණයෙන් ම යම්තැනක එක පදයකින් සංග්‍රහ කරන ලද ස්කන්ධයෝ උප්පාදය හෝ නිරෝධය හෝ ලැබේ. එය පෙර ප්‍රශ්නය යයි කියන ලදි. යම්තැනක දෙපදයකින් සංග්‍රහ කරන ලද ස්කන්ධයන්ගේ උප්පාදය හෝ නිරෝධය හෝ ලැබේ. එය පසු ප්‍රශ්නය යයි කියනු ලැබේ."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 19,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "‘යස්ස රූපක්ඛන්ධො නුප්පජ්ජිත්ථ, තස්ස වෙදනාක්ඛන්ධො නුප්පජ්ජිත්ථා’ති ඉමාය පන පුච්ඡාය ‘නත්ථී’ති ඉමස්මිං විස්සජ්ජනෙ පටික්ඛෙපො ලබ්භති. ‘යස්ස රූපක්ඛන්ධො උප්පජ්ජති, තස්ස වෙදනාක්ඛන්ධො නිරුජ්ඣතී’ති පුච්ඡාය ‘නො’ති ඉමස්මිං විස්සජ්ජනෙ පටිසෙධො ලබ්භති. තස්මා අයඤ්චෙව දුවිධො අඤ්ඤො ච එවරූපො පඤ්හො මොඝපඤ්හොති වෙදිතබ්බො. තුච්ඡපඤ්හොතිපි වුච්චති. එවං තාව චත්තාරො පඤ්හා වෙදිතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "පාළිගතියා විස්සජ්ජනං, පටිවචනවිස්සජ්ජනං, සරූපදස්සනෙන විස්සජ්ජනං, පටික්ඛෙපෙන විස්සජ්ජනං, පටිසෙධෙන විස්සජ්ජනන්ති ඉමානි පන පඤ්ච විස්සජ්ජනානි නාම . තත්ථ යං විස්සජ්ජනං පාළිපදමෙව හුත්වා අත්ථං විස්සජ්ජෙති, ඉදං **පාළිගතියා විස්සජ්ජනං** නාම. තං පුරෙපඤ්හෙ ලබ්භති. ‘යත්ථ රූපක්ඛන්ධො නුප්පජ්ජති තත්ථ වෙදනාක්ඛන්ධො නුප්පජ්ජතී’ති හි පඤ්හෙ ‘උප්පජ්ජතී’ති ඉදං විස්සජ්ජනං පාළිපදමෙව හුත්වා අත්ථං විස්සජ්ජයමානං ගතං, තස්මා එවරූපෙසු ඨානෙසු පාළිගතියා විස්සජ්ජනං වෙදිතබ්බං. යං පන විස්සජ්ජනං පටිවචනභාවෙන අත්ථං විස්සජ්ජෙති, ඉදං **පටිවචනවිස්සජ්ජනං** නාම. තං පච්ඡාපඤ්හෙ ලබ්භති. ‘යස්ස රූපක්ඛන්ධො උප්පජ්ජිත්ථ, තස්ස වෙදනාක්ඛන්ධො උප්පජ්ජිත්ථා’ති හි පඤ්හෙ ‘ආමන්තා’ති ඉදං විස්සජ්ජනං පටිවචනවසෙනෙව අත්ථං විස්සජ්ජයමානං ගතං, තස්මා එවරූපෙසු ඨානෙසු පටිවචනවිස්සජ්ජනං වෙදිතබ්බං. යං විස්සජ්ජනං සරූපෙන දස්සෙත්වා අත්ථං විස්සජ්ජෙති; ඉදං **සරූපදස්සනෙන විස්සජ්ජනං** නාම. තං පරිපුණ්ණපඤ්හෙ ලබ්භති. ‘යස්ස රූපක්ඛන්ධො උප්පජ්ජති; තස්ස වෙදනාක්ඛන්ධො උප්පජ්ජතී’ති හි පඤ්හෙ ‘අසඤ්ඤසත්තං උපපජ්ජන්තාන’න්ති ඉදං විස්සජ්ජනං ‘ඉමෙසං රූපක්ඛන්ධො උප්පජ්ජති, නො ච වෙදනාක්ඛන්ධො, ඉමෙසං රූපක්ඛන්ධො ච උප්පජ්ජති, වෙදනාක්ඛන්ධො චා’ති සරූපදස්සනෙනෙව අත්ථං විස්සජ්ජයමානං ගතං. තස්මා එවරූපෙසු ඨානෙසු සරූපදස්සනෙන විස්සජ්ජනං වෙදිතබ්බං. යං පන විස්සජ්ජනං තථාරූපස්ස අත්ථස්සාභාවතො අත්ථපටික්ඛෙපෙන පඤ්හං විස්සජ්ජෙති, ඉදං **පටික්ඛෙපෙන විස්සජ්ජනං** නාම. යං තථාරූපස්ස අත්ථස්ස එකක්ඛණෙ අලාභතො අත්ථපටිසෙධනෙන පඤ්හං විස්සජ්ජෙති, ඉදං **පටිසෙධෙන විස්සජ්ජනං** නාම. තං මොඝපඤ්හෙ ලබ්භති. ‘යස්ස රූපක්ඛන්ධො නුප්පජ්ජිත්ථ, තස්ස වෙදනාක්ඛන්ධො නුප්පජ්ජිත්ථා’ති හි පඤ්හෙ ‘නත්ථී’ති ඉදං විස්සජ්ජනං; එවරූපො නාම සත්තො නත්ථීති අත්ථපටික්ඛෙපෙන පඤ්හං විස්සජ්ජයමානං ගතං; තස්මා එවරූපෙසු ඨානෙසු පටික්ඛෙපෙන විස්සජ්ජනං වෙදිතබ්බං. ‘යස්ස රූපක්ඛන්ධො උප්පජ්ජති, තස්ස වෙදනාක්ඛන්ධො නිරුජ්ඣතී’ති පඤ්හෙ පන ‘නො’ති ඉදං විස්සජ්ජනං එකස්මිං පටිසන්ධික්ඛණෙ උප්පාදෙන සද්ධිං නිරොධො නාම න ලබ්භතීති අත්ථපටිසෙධනෙන පඤ්හං විස්සජ්ජයමානං ගතං, තස්මා එවරූපෙසු ඨානෙසු පටිසෙධෙන විස්සජ්ජනං වෙදිතබ්බං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**යස්ස රූපක්ඛන්‍ධො නූප්පජ්ජිත්‍ථ තස්ස වෙදනක්ඛන්‍ධො නූප්පජ්ජිත්‍ථ** යමෙකුට රූපස්කන්ධය නොඉපදුනේය. ඊට වේදනා ස්කන්ධය නො ඉපදුනේ ද? මේ ඇසීමෙන් වනාහි **නත්‍ථිති** නැතැයි යන මේ විසඳුමේ ප්‍රතික්‍ෂේපය ලබයි. **යස්ස රූපක්ඛන්‍ධො උප්පජ්ජති තස්ස වෙදනාක්ඛන්‍ධො නිරුජ්ඣති** යමකට රූපස්කන්ධය උපදී. ඊට වේදනා ස්කන්ධය නිරුද්ධ වේ. ඇසීමෙන් නොති මේ විසඳුමෙහි පටිලෝමය ලබයි. එහෙයින් මෙය ද ද්විධ වූ අන්‍ය වූ මෙබඳු රූප ප්‍රශ්නය ද මොඝ ප්‍රශ්නය යයි දතයුතුය. හිස් ප්‍රශ්නය යනුද කියයි. මෙසේ ප්‍රශ්න සතර දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "පෙළෙහි ස්වභාවයෙන් විසඳීම ප්‍රතිවචනයෙන් විසඳීම ස්වරූප පෙන්වීමෙන් විසඳීම, ප්‍රතික්‍ෂේපයෙන් විසඳීම, ප්‍රතිසෝධයෙන් විසඳීම මේ විසඳීම් පස නම් වේ. එහි යම් විසඳීමක් පෙළෙහි පදවලින් ම අර්ථය විසඳයි. මෙය පාළිගතියා විස්සජ්ජන නම් වේ. එය පෙර ප්‍රශ්නයෙහි ලැබේ. **යත්‍ථ රූපක්ඛන්‍දො නූප්පජ්ජතීති තත්‍ථ වෙදනාක්ඛන්‍ධො නූප්පජ්ජති** යන ප්‍රශ්නයෙහි **උප්පජ්ජති** යනු මේ විසඳුම පෙළෙහි පදවලින්ම අර්ථය විසඳීම විය. එහෙයින් මෙබඳු වූ ස්ථානවල පාළි ගතියෙන් විසඳීම දතයුතුය. යම් විසඳුමක් ප්‍රතිවචන භාවයෙන් අර්ථය විසඳයි. මෙය පටිවචන විස්සජ්ජන නම් වේ. එය පසු ප්‍රශ්නයෙහි ලැබේ. **යස්ස රූපක්ඛන්‍ධො උප්පජ්ජිත්‍ථ තස්ස වෙදනාක්ඛන්‍ධො උප්පජ්ජිත්‍ථ** යන ප්‍රශ්නයෙහි ආමන්තා යනු විසඳීමයි. ප්‍රතිවචන වශයෙන් අර්ථයෙන් විසඳීම විය. එහෙයින් මෙබඳු වූ ස්ථානවල පටිවචන විස්සජ්ජනය දතයුතුය. යම් විසඳීමක් ස්වරූපයෙන් දක්වා අර්ථය විසඳයි. මේ ස්වරූප දැක්වීමෙන් විසඳීම වේ. එය පරිපූර්ණ ප්‍රශ්නයෙහි ලැබේ. **යස්ස රූපක්ඛන්‍ධො උප්පජ්ජති තස්ස වෙදනාක්ඛන්‍ධො උප්පජ්ජති** යන ප්‍රශ්නයෙහි අසඤ්ඤසත්තයෙහි ඉපදුන අයට මේ විසඳුමයි. මොවුන්ට රූපස්කන්ධය උපදී. වේදනා ස්කන්ධය නොවේ. මොවුන්ට රූපස්කන්ධයම උපදී. වේදනා ස්කන්ධය යයි ස්වරූප දැක්වීමෙන් ම අර්ථයේ විසඳීම විය. එහෙයින් මෙබඳු තැන්වල ස්වරූප දැක්වීමෙන් විසඳුම දතයුතුය. යම්කිසි විසඳුමක් වනාහි එබඳු අර්ථයක් නොමැතිවීමෙන් අර්ථ ප්‍රතික්‍ෂේපයෙන් ප්‍රශ්නය විසඳයි. මෙය පටික්ඛෙපෙන විස්සජ්ජන නම් වේ. එබඳු වූ යම් අර්ථයක් එකෙණෙහි නොලැබීමෙන් අර්ථ ප්‍රතිශෝධනයෙන් ප්‍රශ්නය විසඳයි. මෙය පටිස්සෙන්නෙ විස්සජ්ජන නම් වේ. එය මෝඝ ප්‍රශ්නයෙහි ලැබේ. **යස්ස රූපක්ඛන්‍ධො නූප්පජ්ජිත්‍ථ තස්ස වෙදනාක්ඛන්‍ධො නූප්පජ්ජිත්‍ථ** (රූපස්කන්ධය නො ඉපදිණි නම් වේදනා ස්කන්ධය නො ඉපදුනේද? යන ප්‍රශ්නයෙහි නත්‍ථි නැතැයි මෙම විසඳුම එබඳු වූ සත්ත්වයෙක් නැතැයි අර්ථ ප්‍රතික්‍ෂේපයෙන් ප්‍රශ්නය විසඳීය. එනිසා එබඳු තැන්වල ප්‍රතික්‍ෂේපයෙන් විසඳීම දතයුතුය. යස්ස රූපක්ඛන්‍ධො උප්පජ්ජති තස්ස වෙදනාක්ඛන්‍ධො නිරුජ්ඣති (යමකට රූපස්කන්ධය උපදී. ඊට වේදනා ස්කන්ධය නිරුද්ධ වේද? යන ප්‍රශ්නයෙහි **නො** නැත යන මේ විසඳුමය. එක් පටිසන්ධි ක්‍ෂණයෙහි ඉපදීම සමග නිරෝධය නො ලැබේ යයි අර්ථ ප්‍රතික්‍ෂේපයෙන් ප්‍රශ්නය විසඳීය. එනිසා එබඳු තැන්වල පටිසේධයෙන් විසඳීම දතයුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 21,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉදානි ඉමෙ චත්තාරො පඤ්හා, ඉමානි ච පඤ්ච විස්සජ්ජනානි, යෙසු සත්තවීසතියා ඨානෙසු පක්ඛිපිතබ්බානි, තානි එවං වෙදිතබ්බානි – අසඤ්ඤසත්තං උපපජ්ජන්තානන්ති එකං ඨානං, අසඤ්ඤසත්තෙ තත්ථාති එකං, අසඤ්ඤසත්තානන්ති එකං; අසඤ්ඤසත්තා චවන්තානන්ති එකං; අරූපං උපපජ්ජන්තානන්ති එකං, අරූපෙ තත්ථාති එකං, අරූපානන්ති එකං, අරූපා චවන්තානන්ති එකං , අරූපෙ පච්ඡිමභවිකානන්ති එකං, අරූපෙ පරිනිබ්බන්තානන්ති එකං; යෙ ච අරූපං උපපජ්ජිත්වා පරිනිබ්බායිස්සන්තීති එකං; පඤ්චවොකාරං උපපජ්ජන්තානන්ති එකං, පඤ්චවොකාරෙ තත්ථාති එකං, පඤ්චවොකාරානන්ති එකං පඤ්චවොකාරා චවන්තානන්ති එකං, පඤ්චවොකාරෙ පච්ඡිමභවිකානන්ති එකං, පඤ්චවොකාරෙ පරිනිබ්බන්තානන්ති එකං; සුද්ධාවාසං උපපජ්ජන්තානන්ති එකං, සුද්ධාවාසෙ තත්ථාති එකං, සුද්ධාවාසානන්ති එකං, සුද්ධාවාසෙ පරිනිබ්බන්තානන්ති එකං; සබ්බෙසං උපපජ්ජන්තානන්ති එකං, සබ්බෙසං චවන්තානන්ති එකං; සබ්බසාධාරණවසෙන පච්ඡිමභවිකානන්ති එකං, පරිනිබ්බන්තානන්ති එකං, චතුවොකාරං පඤ්චවොකාරං උපපජ්ජන්තානන්ති එකං, චවන්තානන්ති එකං. එවං ඉමෙසං චතුන්නං පඤ්හානං ඉමානි පඤ්ච විස්සජ්ජනානි ඉමෙසු සත්තවීසතියා ඨානෙසු පක්ඛිපිත්වා ඉමස්මිං පවත්තිමහාවාරෙ අත්ථවිනිච්ඡයො වෙදිතබ්බො. එවං විදිත්වා හි පඤ්හං විස්සජ්ජන්තෙන සුවිස්සජ්ජිතො හොති, අත්ථඤ්ච විනිච්ඡයන්තෙන සුවිනිච්ඡිතො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ථායං නයො – **යස්ස රූපක්ඛන්ධො උප්පජ්ජතී**ති යස්ස පුග්ගලස්ස උප්පාදක්ඛණසමඞ්ගිතාය රූපක්ඛන්ධො උප්පජ්ජති. **තස්ස වෙදනාක්ඛන්ධො උප්පජ්ජතී**ති වෙදනාක්ඛන්ධොපි තස්ස තස්මිඤ්ඤෙව ඛණෙ උප්පජ්ජතීති පුච්ඡති. **අසඤ්ඤසත්තං උපපජ්ජන්තාන**න්ති අචිත්තකපටිසන්ධිවසෙන අසඤ්ඤසත්තභවං උපපජ්ජන්තානං. **තෙසං රූපක්ඛන්ධො උප්පජ්ජතී**ති තෙසං එකන්තෙන රූපක්ඛන්ධො උප්පජ්ජතියෙව. පවත්තෙ උප්පන්නානං රූපක්ඛන්ධො උප්පජ්ජතිපි නිරුජ්ඣතිපි, තස්මා ‘අසඤ්ඤසත්තාන’න්ති අවත්වා’අසඤ්ඤසත්තං උපපජ්ජන්තාන’න්ති වුත්තං. **නො ච තෙසං වෙදනාක්ඛන්ධො උප්පජ්ජතී**ති අචිත්තකත්තා පන තෙසං වෙදනාක්ඛන්ධො නුප්පජ්ජතෙව. ඉදං සත්තවීසතියා ඨානෙසු පඨමෙ ඨානෙ පරිපුණ්ණපඤ්හස්ස පුරිමකොට්ඨාසෙ සරූපදස්සනෙන විස්සජ්ජනං. **පඤ්චවොකාරං උපපජ්ජන්තාන**න්ති රූපාරූපමිස්සකපටිසන්ධිවසෙන පඤ්චවොකාරභවං උපපජ්ජන්තානං. **තෙසං රූපක්ඛන්ධො ච උප්පජ්ජති, වෙදනාක්ඛන්ධො චා**ති තෙසං එකන්තෙන රූපවෙදනාක්ඛන්ධසඞ්ඛාතා ද්වෙපි ඛන්ධා උප්පජ්ජන්තියෙව. පවත්තෙ පන තත්ථ උප්පන්නානං තෙ ඛන්ධා උප්පජ්ජන්තිපි නිරුජ්ඣන්තිපි, තස්මා ‘පඤ්චවොකාරාන’න්ති අවත්වා ‘පඤ්චවොකාරං උපපජ්ජන්තාන’න්ති වුත්තං. ඉදං පඤ්චවොකාරං උපපජ්ජන්තානන්ති ඨානෙ පරිපුණ්ණපඤ්හස්ස පච්ඡිමකොට්ඨාසෙ සරූපදස්සනෙන විස්සජ්ජනං. ඉමිනා උපායෙන සබ්බානි විස්සජ්ජනානි වෙදිතබ්බානි."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "දැන් මේ ප්‍රශ්න සතර මේ පස් විසඳුම් ද විසිහත් තැනක තැබිය යුතුය. ඒ සත්විසි තැන් මෙසේ දතයුතුය. අසඤ්ඤසත්තයේ උපදින්නවුන්ගේ එක් ස්ථානයකි. අසඤ්ඤ සත්ත්වයෙහි තත්ත්වය එකකි. අසඤ්ඤ සත්ත්වයන්ගේ එකකි. අසඤ්ඤ සත්ත්වයෙන් චුත වන්නන්ගේ එකකි. අරූපයෙහි උපදින්නන්ගේ එකකි. අරූපයෙහි තත්ත්වය යයි එකකි. අරූපයන්ගේ එකකි. අරූපයෙන් චුත වන්නන්ගේ එකකි. අරූපයෙහි පශ්චිම භවිකයන්ගේ එකකි. අරූපයෙහි පිරිනිවන්පාන්නන්ගේ එකකි. ඇතැමෙක් අරූපයෙහි ඉපදී පිරිනිවන් පාන්නෝය යයි එකකි. පංචවෝකාරවල (ස්කන්ධ පහක් ඇති භවවල) උපදින්නන්ගේ එකකි. පංචවෝකාරවල තත්ත්වය යයි එකකි. පංචවෝකාරයන්ගේ එකකි. පංචවෝකාරවලින් චුතවන්නන්ගේ එකකි. පංචවෝකාරයෙහි පිරිනිවන් පාන්නන්ගේ එකකි. සුද්ධාවාසයෙහි උපදින්නන්ගේ එකකි. සුද්ධාවාසයෙහි තත්ත්වය යයි එකකි. සුද්ධාවාසිකයන්ගෙන් එකකි. සුද්ධාවාසයෙහි පිරිනිවන් පාන්නන්ගේ එකකි. සියල්ලන්ගේ උපදින්නන්ගේ එකකි. සියල්ලන්ගේ චුතවන්නන්ගේ එකකි. සියල්ලන්ට සාධාරණ වශයෙන් පශ්චිම භවිකයන්ගේ එකකි. පිරිනිවන් පාන්නන්ගේ එකකි. චතුවෝකාර පංචවෝකාරවල උපදින්නන්ගේ එකකි. චුතවන්නන්ගේ එකකි. මේ සතර ප්‍රශ්නවල මෙම විසඳුම් පහ මේ සත්විසි ස්ථානයන්හි බහා මේ පවත්ති මහා වාරයෙහි අර්ථ විනිශ්චය දතයුතුය. මෙසේ දැනගෙන වනාහි ප්‍රශ්නය විසඳන්නහු විසින් මනාව විසඳන ලද්දේ වේ. අර්ථය ද විනිශ්චය කරන ලද්දහු විසින් මනාව විනිශ්චය කරන ලද්දේ වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "එහි නය මෙසේය. **යස්ස රූපක්ඛන්‍ධො උප්පජ්ජති** යයි යම් පුද්ගලයෙකුට උත්පාද ක්‍ෂණ එකතුවෙන් රූප ස්කන්ධය උපදී. **තස්ස වෙදනාක්ඛන්‍ධො උප්පජ්ජති** යයි වේදනා ස්කන්ධය ද ඔහුට ඒ ක්‍ෂණයෙහිම උපදීදැයි අසයි. අසඤ්ඤසත්තයෙහි උපදින්නන්ට අචිත්තක ප්‍රතිසන්ධි වශයෙන් අසඤ්ඤසත්ත භවයෙහි උපදින්නන්ට. **තෙසං රූපක්ඛන්‍ධො උප්පජ්ජති** ඔවුන්ට එ්කාන්තයෙන් රූප ස්කන්ධයම උපදී. පැවැත්ම වනාහි එහි ඉපදුණු රූපස්කන්ධය ඉපදීම ද නිරුද්ධ වීමද වේ. එහෙයින් අසඤ්ඤ සත්ත්වයින්ගේ යයි නොකියා අසඤ්ඤ සත්ත්වයෙහි උපන්නවුන්ගේ යයි කියන ලදි. **නො ච තෙසං වෙදනාක්ඛන්‍ධො උප්පජ්ජති **අචිත්තක බැවින් ඔවුන්ට වේදනා ස්කන්ධය නූපදීමය. මේ සත්විසි ස්ථානවල පළමු ස්ථානයෙහි පරිපූර්ණ ප්‍රශ්නයේ පළමු කොටසේ ස්වරූප දැක්වීමෙන් විසඳයි. පංචවෝකාරයෙහි උපන්නවුන්ගේ **පංච වොකාරං උප්පජ්ජතිත්තානං** රූපාරූප මිශ්‍රක ප්‍රතිසන්ධි බැවින් පංචවෝකාර භවවල උපදින්නවුන්ගේ, **තෙසං රූපක්ඛන්‍ධො ච උප්පජ්ජති වෙදනක්ඛන්‍ධො ච** ඔවුන්ට ඒකාන්තයෙන් රූප වේදනා සංඛ්‍යාත ස්කන්ධ දෙකම උපදී. පැවැත්ම වනාහි එහි උපදින ඒ ස්කන්ධ ඉපදීම ද නිරුද්ධ වීම ද වේ. එහෙයින් පංචවෝකාරයින්ගේ යයි නොකියා **පංචවොකාරං උප්පජ්ජන්තානං** පංචවෝකාරයෙහි උපන්නන්ගේ යයි කියන ලදි. **මෙ පංචවොකාරං උප්පජ්ජන්තානං** යන ස්ථානයෙහි පරිපූර්ණ ප්‍රශ්නයේ පැසුළු කොටසෙහි ස්වරූප දැක්වීමෙන් විසඳීමයි. මේ උපායෙන් සියළු විසඳීම් දතයුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 23,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉදං පනෙත්ථ උප්පාදනිරොධෙසු නියමලක්ඛණං – සකලෙපි හි ඉමස්මිං ඛන්ධයමකෙ තත්ථ තත්ථ උප්පන්නානං පවත්තෙ යාව මරණා ඛන්ධානං අපරියන්තෙසු උප්පාදනිරොධෙසු විජ්ජමානෙසුපි ලහුපරිවත්තානං ධම්මානං විනිබ්භොගං කත්වා උප්පාදනිරොධෙ දස්සෙතුං න සුකරන්ති පවත්තියං උප්පාදනිරොධෙ අනාමසිත්වා අභිනවං විපාකවට්ටං නිප්ඵාදයමානෙන නානාකම්මෙන නිබ්බත්තානං පටිසන්ධිඛන්ධානං උප්පාදං දස්සෙතුං සුඛන්ති පටිසන්ධිකාලෙ උප්පාදවසෙනෙව උප්පාදවාරො කථිතො. උප්පන්නස්ස පන විපාකවට්ටස්ස පරියොසානෙන නිරොධං දස්සෙතුං සුඛන්ති මරණකාලෙ නිරොධවසෙන නිරොධවාරො කථිතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කිං පනෙත්ථ පවත්තියං උප්පාදනිරොධානං අනාමට්ඨභාවෙ පමාණන්ති? පාළියෙව. පාළියඤ්හි විසෙසෙන උප්පාදවාරස්ස අනාගතකාලවාරෙ ‘පච්ඡිමභවිකානං තෙසං රූපක්ඛන්ධො ච නුප්පජ්ජිස්සති, වෙදනාක්ඛන්ධො ච නුප්පජ්ජිස්සතී’ති අයං පාළි අතිපමාණමෙව. පච්ඡිමභවිකානඤ්හි පවත්තෙ රූපාරූපධම්මානං උප්පජ්ජිතුං යුත්තභාවෙ සතිපි ‘රූපක්ඛන්ධො ච නුප්පජ්ජිස්සති, වෙදනාක්ඛන්ධො ච නුප්පජ්ජිස්සතී’ති සන්නිට්ඨානං කත්වා වුත්තභාවෙන පවත්තෙ උප්පාදො න ගහිතොති වෙදිතබ්බො. ‘සුද්ධාවාසෙ පරිනිබ්බන්තානං තෙසං තත්ථ සඤ්ඤාක්ඛන්ධො න නිරුජ්ඣිත්ථ, නො ච තෙසං තත්ථ වෙදනාක්ඛන්ධො න නිරුජ්ඣතී’ති අයං පන පාළි පවත්තෙ නිරොධස්ස අනාමට්ඨභාවෙ අතිවිය පමාණං. සුද්ධාවාසෙ පරිනිබ්බන්තානඤ්හි චුතිචිත්තස්ස භඞ්ගක්ඛණෙ ඨිතානං පටිසන්ධිතො පට්ඨාය පවත්තෙ උප්පජ්ජිත්වා නිරුද්ධසඤ්ඤාක්ඛන්ධානං ගණනපථො නත්ථි. ‘එවං සන්තෙපි තෙසං තත්ථ සඤ්ඤාක්ඛන්ධො න නිරුජ්ඣිත්ථා’ති සන්නිට්ඨානං කත්වා වුත්තභාවෙන පවත්තෙ නිරොධො න ගහිතොති වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙත්ථ උප්පාදනිරොධෙසු නියමලක්ඛණං විදිත්වා පටිසන්ධිඋප්පාදමෙව චුතිනිරොධමෙව ච ගහෙත්වා තෙසු තෙසු ඨානෙසු ආගතානං විස්සජ්ජනානං අත්ථවිනිච්ඡයො වෙදිතබ්බො. සො පන සක්කා ආදිවිස්සජ්ජනෙ වුත්තනයෙන සබ්බත්ථ විදිතුන්ති විස්සජ්ජනපටිපාටියා න විත්ථාරිතො. ඉමිනා පන එවං දින්නෙනපි නයෙන යො එතෙසං අත්ථවිනිච්ඡයං ජානිතුං න සක්කොති, තෙන ආචරියෙ පයිරුපාසිත්වා සාධුකං සුත්වාපි ජානිතබ්බො."
                    },
                    {
                        "type": "gatha",
                        "text": "උප්පාදස්ස නිරොධස්ස, උප්පන්නඤ්චාපි එකතො;\nනයස්ස අනුලොමස්ස, පටිලොමනයස්ස ච.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "මෙය වනාහි මෙහි උප්පාද නිරෝධවල නියම ලක්‍ෂණයයි. මේ සියළු ඛන්‍ධ යමකයෙහි ඒ ඒ තැන උපන්නවුන්ගේ මරණය දක්වා පැවැත්මෙහි ස්කන්ධයන්ගේ කෙළවරක් නැති උප්පාද නිරෝධ විද්‍යමාන කල්හි වහා පරිවර්තනය වන ධර්මයන් වෙන්කොට උප්පාද නිරෝධයන් දැක්වීමට පහසු නොවේ. පැවැත්මෙහි උප්පාද නිරෝධ ආමර්ශනය නොකොට අළුත් විපාක වෘත්තය නිෂ්පාදනය කරමින් නොයෙක් කර්මයෙන් උපන් ප්‍රතිසන්ධි ස්කන්ධයන්ගේ ඉපදීම දැක්වීමට පහසු යයි ප්‍රතිසන්ධි කාලයෙහි උත්පාද වශයෙන්ම උප්පාද වාරය කියන ලදි. උපන්නහුගේ වනාහි විපාක වෘත්තයේ අවසානයේ නිරෝධය දැක්වීමට පහසු යයි මැරෙන කාලයෙහි නිරෝධ වශයෙන් නිරෝධ වාරය කියන ලදි."
                    },
                    {
                        "type": "paragraph",
                        "text": "පැවැත්මෙහි උප්පාද නිරෝධවල අනාමර්ශනයෙහි ප්‍රමාණ මොනවාද? පෙළමය. විශේෂයෙන් උප්පාද වාරයේ අනාගතකාල වාරයෙහි පච්ඡිමභවිකානං තෙසං රූපක්ඛන්‍ධො ච නූප්පජ්ජිස්සති වෙදනාක්ඛන්‍ධොච නූප්පජ්ජිස්සති. මේ පෙළ අතිප්‍රමාණ වේමය. පශ්චිම භවිකයන්ගේ පැවැත්මෙහි රූපාරූප ධර්මයන්ගේ ඉපදීමට සුදුසු බව ඇතිකල්හි රූපස්කන්ධය ද නූපදී. වේදනා ස්කන්ධය ද නූපදී. තීරණය කොට කියන ලද බැවින් පැවැත්මෙහි ඉපදීම නොගන්නා ලදැයි දතයුතුය. **සුද්ධාවාසෙ පරිනිබ්බත්තානං තෙසං තත්‍ථ සඤ්ඤාක්ඛන්‍ධො න නිරුජ්ඣිත්‍ථ නො ච තෙසං තත්‍ථ වෙදනාක්ඛන්‍ධො න නිරුජ්ඣතී** මෙය වනාහි පෙළෙහි පැවැත්මේ නිරෝධ අනාමර්ශන භාවයෙහි අතිශය ප්‍රමාණයකි. සුද්ධාවාසයෙහි පිරිනිවන්පාන්නන්ගේ චුති සිතේ පිළිසිඳීමේ සිට පැවති ඉපදී නිරුද්ධ වූ ස්කන්ධයන්ගේ ගණන් සීමාවක් නැත. මෙසේ ඇතිකල්හිද ඔවුන්ගේ එහි සඤ්ඤා ඛන්‍ධය නිරුද්ධ නොවූයේ යයි නිශ්චයකොට කියන ලද බැවින් පැවති නිරෝධය නොගන්නා ලදැයි දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙසේ මෙහි උප්පාද නිරෝධවල නියම ලක්‍ෂණ දැන පටිසන්ධි ඉපදීමට චුති නිරෝධයම ද ගෙන ඒ ඒ තැන්වල ආවා වූ විසඳුම්වල අර්ථ විනිශ්චය දතයුතුය. එය වනාහි මුල් විසඳුමෙහි කී නයින් සියළු තැන දැනගැනීමට හැකියයි විසඳුම් පිළිවෙල විස්තර නොකරන ලදි. මෙයින් මෙසේ දෙන ලද නයින් යමෙකුට මේවායේ අර්ථ විනිශ්චය දැනගැනීමට නොහැකි වේ නම් ආචාර්යවරුන් ඇසුරුකර හොඳින් අසා දැනගත යුතුය."
                    },
                    {
                        "type": "gatha",
                        "text": "ඉපදුමෙහි නිවුමේ - දෙකෙහිම ද එකතුව ගෙන\nඅනුලොම් නය සහා - පිළිලොම් නය ද දක්වන",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 25,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "වසෙන යානි ඛන්ධෙසු, යමකානි ච පඤ්චසු;\nපුග්ගලං අථ ඔකාසං, පුග්ගලොකාසමෙව ච.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "ආමසිත්වා පවත්තෙසු, ඨානෙසු කථයී ජිනො;\nතෙසං පාළිවවත්ථානං, දස්සිතං අනුපුබ්බතො.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "විනිච්ඡයත්ථං අත්ථස්ස, පඤ්හාවිස්සජ්ජනානි ච;\nවිස්සජ්ජනානං ඨානානි, යානි තානි ච සබ්බසො.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "දස්සෙත්වා එකපඤ්හස්මිං, යොජනාපි පකාසිතා;\nවිත්ථාරෙන ගතෙ එත්ථ, පඤ්හාවිස්සජ්ජනක්කමෙ.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "අත්ථං වණ්ණයතා කාතුං, කිං නු සක්කා ඉතො පරං;\nනයෙන ඉමිනා තස්මා, අත්ථං ජානන්තු පණ්ඩිතාති.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "පවත්තිමහාවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරිඤ්ඤාවාරවණ්ණනා",
                        "level": 1,
                        "keyOffset": 6
                    },
                    {
                        "type": "paragraph",
                        "text": "තදනන්තරෙ පරිඤ්ඤාවාරෙපි ඡළෙව කාලභෙදා. අනුලොමපටිලොමතො ද්වෙයෙව නයා. පුග්ගලවාරො, ඔකාසවාරො, පුග්ගලොකාසවාරොති ඉමෙසු පන තීසු පුග්ගලවාරොව ලබ්භති, න ඉතරෙ ද්වෙ. කිං කාරණා? සදිසවිස්සජ්ජනතාය. යො හි කොචි පුග්ගලො යත්ථ කත්ථචි ඨානෙ රූපක්ඛන්ධං චෙ පරිජානාති, වෙදනාක්ඛන්ධම්පි පරිජානාතියෙව. වෙදනාක්ඛන්ධං චෙ පරිජානාති, රූපක්ඛන්ධම්පි පරිජානාතියෙව. රූපක්ඛන්ධං චෙ න පරිජානාති, වෙදනාක්ඛන්ධම්පි න පරිජානාතියෙව. වෙදනාක්ඛන්ධං චෙ න පරිජානාති, රූපක්ඛන්ධම්පි න පරිජානාතියෙව. තස්මා තෙසුපි ‘යත්ථ රූපක්ඛන්ධං පරිජානාති, තත්ථ වෙදනාක්ඛන්ධං පරිජානාතී’ති ආදිවසෙන පුච්ඡං කත්වා ‘ආමන්තා’ත්වෙව විස්සජ්ජනං කාතබ්බං . සියාති සදිසවිස්සජ්ජනතාය තෙ ඉධ න ලබ්භන්තීති වෙදිතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ වා පරිඤ්ඤාකිච්චං නාම පුග්ගලස්සෙව හොති, නො ඔකාසස්ස, පුග්ගලොව පරිජානිතුං සමත්ථො, නො ඔකාසොති පුග්ගලවාරොවෙත්ථ ගහිතො, න ඔකාසවාරො. තස්ස පන අග්ගහිතත්තා තදනන්තරො පුග්ගලොකාසවාරො ලබ්භමානොපි න ගහිතො. යො පනෙස පුග්ගලවාරො ගහිතො, තත්ථ පච්චුප්පන්නකාලෙ රූපක්ඛන්ධමූලකානි චත්තාරි, වෙදනාක්ඛන්ධමූලකානි තීණි, සඤ්ඤාක්ඛන්ධමූලකානි ද්වෙ, සඞ්ඛාරක්ඛන්ධමූලකං එකන්ති හෙට්ඨා වුත්තනයෙනෙව අනුලොමනයෙ අග්ගහිතග්ගහණෙන දස යමකානි. පටිලොමනයෙ දසාති වීසති. තථා සෙසෙසුපීති එකෙකස්මිං කාලෙ වීසති වීසති කත්වා ඡසු කාලෙසු වීසං යමකසතං, චත්තාරීසානි ද්වෙ පුච්ඡාසතානි, අසීත්යාධිකානි චත්තාරි අත්ථසතානි ච හොන්තීති ඉදමෙත්ථ පාළිවවත්ථානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථවිනිච්ඡයෙ පනෙත්ථ අතීතානාගතපච්චුප්පන්නසඞ්ඛාතා තයො අද්ධා පවත්තිවාරෙ විය චුතිපටිසන්ධිවසෙන න ලබ්භන්ති. පවත්තෙ චිත්තක්ඛණවසෙනෙව ලබ්භන්ති. තෙනෙවෙත්ථ ‘යො රූපක්ඛන්ධං පරිජානාති, සො වෙදනාක්ඛන්ධං පරිජානාතී’තිආදීසු පුච්ඡාසු ‘ආමන්තා’ති විස්සජ්ජනං කතං. ලොකුත්තරමග්ගක්ඛණස්මිඤ්හි නිබ්බානාරම්මණෙන චිත්තෙන පඤ්චසු ඛන්ධෙසු පරිඤ්ඤාකිච්චනිබ්බත්තියා යං කිඤ්චි එකං ඛන්ධං පරිජානන්තො ඉතරම්පි පරිජානාතීති වුච්චති. එවමෙත්ථ ‘පරිජානාතී’ති පඤ්හෙසු අනුලොමනයෙ පරිඤ්ඤාකිච්චස්ස මත්ථකප්පත්තං අග්ගමග්ගසමඞ්ගිං සන්ධාය ‘ආමන්තා’ති වුත්තන්ති වෙදිතබ්බං. පටිලොමනයෙ පන ‘න පරිජානාතී’ති පඤ්හෙසු පුථුජ්ජනාදයො සන්ධාය ‘ආමන්තා’ති වුත්තං. ‘පරිජානිත්ථා’ති ඉමස්මිං පන අතීතකාලවාරෙ මග්ගානන්තරඅග්ගඵලෙ ඨිතොපි පරිඤ්ඤාකිච්චස්ස නිට්ඨිතත්තා පරිජානිත්ථයෙව නාම."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "විසින් යම් කඳුවල - යමකවල ද පහේ වන\nපුඟුල් සහ අවසර - පුඟුල් අවසර යන මෙය",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "පහස් කොට පැවතුණු - තැන්වල මුනිඳු වදහළ\nඑම පෙළෙහි නියමය - දක්වනු අනුපිළිවෙලින්",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "අරුත්හි විනිස’රුත් - පැන විසඳුම් ද වන මෙම\nවිසඳුම්හි වන තැන් - යම් ඒ මේ හැම අතින්",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "දක්වා එක් පැනෙහි - යෙදුම් ද පැවසිණි එහී\nවිතරින් ගිය මෙහී - පැන විසඳුම් පිළිවෙළේ",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "අරුත් වැනුමට මෙහි - හැකිවෙද මීටත් වඩා\nඑහෙයින් මෙම නයින් - අරුත් දක්වති පඬිවරු",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "පවත්තිමහාවාර වර්ණනාව නිමි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරිඤ්ඤාවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉන් අනතුරුව පරිඤ්ඤාවාරයෙහි ද කාල ප්‍රභේද සයෙක් ම වේ. අනුලෝම පටිලෝම වශයෙන් නය දෙකකි. පුග්ගල වාර ඔකාසවාර පුග්ගලෝකාසවාර යයි මේ පුග්ගල වාර තුනම ලබයි. ඉතිරි දෙක නොලැබේ. කුමන කරුණකින්ද? සමාන විසඳුම් බැවිනි. යම්කිසි පුද්ගලයෙක් යම්කිසි තැනක රූප ස්කන්ධය දනීද වේදනා ස්කන්ධය ද දනීමය. වේදනා ස්කන්ධය දනීද රූපස්කන්ධය ද දනීමය. රූපස්කන්ධය නොදනීද වේදනා ස්කන්ධය ද නොදනී. වේදනා ස්කන්ධය නොදනී ද රූපස්කන්ධය ද නොදනී. එහෙයින් ඒවායෙහි ද **යත්‍ථ රූපක්ඛන්‍ධං පරිජානාති තත්‍ථ වෙදනාක්ඛන්‍ධං පරිජානාති** ආදි වශයෙන් ප්‍රශ්නකොට **ආමන්තා **යන විසඳීම කළයුතු වන්නේය. සමාන විසඳුම් බැවින් ඒවා මෙහි නොදක්වන ලදැයි දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "එසේ නැතහොත් පරිඤ්ඤා කෘත්‍යය නම් පුද්ගලයාටම වේ. අවකාශය නොවේ. පුද්ගලයාම දැනගැනීමට සමර්ථ වේ. අවකාශය නොවේ යයි මෙහි පුද්ගලවාරයම ගන්නා ලදි. අවකාශ වාරය නොවේ. එය නොගන්නා ලද බැවින් ඉන් අනතුරුව පුග්ගලො කායවාරය ලබන්නේද, නො ගන්නා ලදි. යමෙක් වනාහි මේ පුද්ගල වාරය ගන්නා ලද්දේ, එහි වර්තමාන කාලයෙහි රූප ස්කන්ධ මූලක සතරකි. වේදනා ස්කන්ධ මූලක තුනකි. සඤ්ඤා ස්කන්ධ මූලක දෙකකි. සංඛාරා ස්ක්නධ මූලක එකකියි යට කියන ලද නයින්ම අනුලෝම නයෙහි අගහිත ගහණයෙන් යමක දහයකි. පටිලෝම නයෙහි දහයයි විස්සකි. එසේම සෙසු කාල සයේ ද එකිනෙකේ විස්ස බැගින් යමක එක්සිය විස්සක් වේ. පුච්ඡා දෙසිය සතලිහකි. අර්ථ හාරසිය අසූවකි. මෙය මෙහි පෙළෙහි නියමයයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙහි අර්ථ විනිශ්චයෙහි වනාහි අතීත අනාගත වර්තමාන සංඛ්‍යාත ත්‍රිවිධ කාල පවත්ති වාරයෙහි මෙන් චුතිපටිසන්ධි වශයෙන් නො ලැබේ. පැවතීමේ චිත්තක්‍ෂණ වශයෙන්ම ලබයි. එහෙයින් මෙහි **යො රූපක්ඛන්‍ධං පරිජානාති සො වෙදනාක්ඛන්‍ධං පරිජානාති** යමෙක් රූපස්කන්ධය දනී නම් හේ වේදනා ස්කන්ධය දනීද? යනාදි ප්‍රශ්නවලට **ආමන්තා** ඔව් යයි විසඳීම කරන ලදි. ලෝකෝත්තර මාර්ග ක්‍ෂණයෙහි නිවන් අරමුණු කරා සිතෙන් පංචස්කන්ධය දැනගැනීමේ කෘත්‍යය ඇතිවීමෙන් එක් ස්කන්ධයක් දැනගැනීමෙන් සෙසු ස්කන්ධවල ද දැනීම ඇතිවන්නේ යයි කියනු ලැබේ. මෙසේ මෙහි **පරිජානාති** යන ප්‍රශ්නවල අනුලෝම නයෙහි පරිඤ්ඤා කෘත්‍යයේ මුදුන් පැමිණි අග්‍ර වූ මාර්ගය යුක්තවීම සඳහා **ආමන්තා** යයි කියන ලදැයි දතයුතුය. පටිලෝම නයෙහි වනාහි **න පරිජානිති** යන ප්‍රශ්නවල පුහුදුන් අය සඳහා **ආමන්තා** යයි කියන ලදි. **පරිජානිත්‍ථ** යන මේ අතීත කාලවාරයෙහි මාර්ගයට අනතුරුව අග්‍රඵලයෙහි (රහත්) සිටියහුට ද පරිඤ්ඤා කෘත්‍යයේ (දැනගැනීම් කිසේ) අවසානය වූ බැවින් පරිජානිත්‍ථම නම් වේ."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 27,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**යො රූපක්ඛන්ධං පරිජානාති, සො වෙදනාක්ඛන්ධං පරිජානිත්ථා**ති පඤ්හෙන අග්ගමග්ගසමඞ්ගිං පුච්ඡති. යස්මා පනෙස ඛන්ධපඤ්චකං පරිජානාතියෙව නාම, න තාව නිට්ඨිතපරිඤ්ඤාකිච්චො; තස්මා ‘නො’ති පටිසෙධො කතො. දුතියපඤ්හෙ පන **පරිජානිත්ථා**ති අරහන්තං පුච්ඡති. යස්මා පනෙසො නිට්ඨිතපරිඤ්ඤාකිච්චො. නත්ථි තස්ස පරිඤ්ඤෙය්යං නාම; තස්මා ‘නො’ති පටිසෙධො කතො. පටිලොමනයවිස්සජ්ජනෙ පනෙත්ථ **අරහා රූපක්ඛන්ධං න පරිජානාතී**ති අරහතො පරිඤ්ඤාය අභාවෙන වුත්තං. **අග්ගමග්ගසමඞ්ගී වෙදනාක්ඛන්ධං න පරිජානිත්ථා**ති අරහත්තමග්ගට්ඨස්ස අනිට්ඨිතපරිඤ්ඤාකිච්චතාය වුත්තං. න කෙවලඤ්ච වෙදනාක්ඛන්ධමෙව, එකධම්මම්පි සො න පරිජානිත්ථෙව. ඉදං පන පුච්ඡාවසෙන වුත්තං. **නො ච රූපක්ඛන්ධ**න්ති ඉදම්පි පුච්ඡාවසෙනෙව වුත්තං. අඤ්ඤම්පි පන සො ඛන්ධං පරිජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යො රූපක්ඛන්ධං පරිජානාති, සො වෙදනාක්ඛන්ධං පරිජානිස්සතී**ති එත්ථ යස්මා මග්ගට්ඨපුග්ගලො එකචිත්තක්ඛණිකො, තස්මා සො පරිජානිස්සතීති සඞ්ඛං න ගච්ඡති. තෙන වුත්තං ‘නො’ති. **තෙ රූපක්ඛන්ධඤ්ච න පරිජානිත්ථා**ති පුච්ඡාසභාගෙන වුත්තං, න පරිජානිංසූති පනෙත්ථ අත්ථො. ඉමිනා උපායෙන සබ්බත්ථ අත්ථවිනිච්ඡයො වෙදිතබ්බොති."
                    },
                    {
                        "type": "centered",
                        "text": "පරිඤ්ඤාවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "ඛන්ධයමකවණ්ණනා නිට්ඨිතා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "3. ආයතනයමකං",
                        "level": 4
                    },
                    {
                        "type": "heading",
                        "text": "පණ්ණත්තිඋද්දෙසවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදානි මූලයමකෙ දෙසිතෙයෙව කුසලාදිධම්මෙ ආයතනවසෙනාපි සඞ්ගණ්හිත්වා ඛන්ධයමකානන්තරං දෙසිතස්ස ආයතනයමකස්ස වණ්ණනා හොති. තත්ථ ඛන්ධයමකෙ වුත්තනයෙනෙව පාළිවවත්ථානං වෙදිතබ්බං. යථෙව හි තත්ථ පණ්ණත්තිවාරො, පවත්තිවාරො, පරිඤ්ඤාවාරොති තයො මහාවාරා හොන්ති, තථා ඉධාපි. වචනත්ථොපි නෙසං තත්ථ වුත්තනයෙනෙව වෙදිතබ්බො. ඉධාපි ච පණ්ණත්තිවාරො උද්දෙසනිද්දෙසවසෙන ද්විධා වවත්ථිතො. ඉතරෙ නිද්දෙසවසෙනෙව. ‘තත්ථ ද්වාදසායතනානී’ති පදං ආදිං කත්වා යාව **නායතනා න මනො**ති, තාව පණ්ණත්තිවාරස්ස උද්දෙසවාරො වෙදිතබ්බො. තත්ථ **ද්වාදසායතනානී**ති අයං යමකවසෙන පුච්ඡිතබ්බානං ආයතනානං උද්දෙසො. **චක්ඛායතනං…පෙ… ධම්මායතන**න්ති තෙසඤ්ඤෙව පභෙදතො නාමවවත්ථානං. යමකවසෙන පුච්ඡාසුඛත්ථඤ්චෙත්ථ පඨමං පටිපාටියා අජ්ඣත්තරූපායතනානි වුත්තානි. පච්ඡා බාහිරරූපායතනානි. පරියොසානෙ මනායතනධම්මායතනානි."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යො රූපක්ඛන්‍ධං පරිජානාති සො වෙදනක්ඛන්‍ධං පරිජානිත්‍ථ (යමෙක් රූපස්කන්ධය දැනගනීද ඔහු වේදනා ස්කන්ධය දැන ගත්තේද?) යන ප්‍රශ්නයෙන් අග්‍රමාර්ගයෙන් යුක්තදැයි අසයි. යම්හෙයකින් හෙතෙම ස්කන්ධ පංචකය දැනගැනීමය නම් වේ. තවම අවසාන පරිඤ්ඤා කෘත්‍යය නොවේ. එහෙයින් නැතැයි කියන ලදි. දෙවන ප්‍රශ්නයෙහි වනාහි **පරිජානිත්‍ථ** යයි රහත්බව අසයි. ඔහුගේ අවසාන පරිඤ්ඤා කෘත්‍යය ඔහුගේ පරිඤ්ඤෙය්‍ය ද නොවේ. එහෙයින් **නො** යයි ප්‍රතිසේධය කරන ලදි. පටිලෝම නය විසඳීමෙහි වනාහි මෙහි **අරහා රූපක්ඛන්‍ධං න පරිජානාති** අරහා රූපස්කන්ධය නොදනී. අරහත් හෝ දැනීමේ අභාවයෙන් කියන ලදි. **අග්ගමග්ගසමංගි වෙදනාක්ඛන්‍ධං න පරිජානිත්‍ථ** අරහත්ත මාර්ගස්ථ වූවහුට නොනිමි පරිඤ්ඤා කෘත්‍යය නිසා කියන ලදි. හුදෙක් වේදනා ස්කන්ධය පමණක් නොව එකම ධර්මයක්වත් නොදැන ගත්තේමය. මෙය වනාහි පුච්ඡා වශයෙන් කියන ලදි. නො ච රූපක්ඛන්‍ධං යයි මෙය පුච්ඡා වශයෙන් කියන ලදි. හේ සෙසු ස්කන්ධ දනී."
                    },
                    {
                        "type": "paragraph",
                        "text": "යො රූපක්ඛන්‍ධං **පරිජානාති සො වෙදනාක්ඛන්‍ධං පරිජානිස්සති** යයි යමෙක් රූපස්කන්ධය දනී. හේ වෙදනා ස්කන්ධය දන්නේද? මෙහි යම්හෙයකින් මාර්ගස්ථ පුද්ගලයා ඒකචිත්ත ක්‍ෂණිකය. එහෙයින් හේ දැනගන්නේ යයි යන සංඛ්‍යාවට නොයේ. එහෙයින් කියන ලදි. නො කියා. **තෙ රූපක්ඛන්‍ධඤ්ච න පරිජානිත්‍ථාති** පුච්ඡා සභාගයෙන් කියන ලදි. නොදැනගත්හ යනු මෙහි අර්ථයයි. මේ උපායෙන් සියළු තැන අර්ථ විනිශ්චය දතයුතුය."
                    },
                    {
                        "type": "centered",
                        "text": "පරිඤ්ඤාවාරය නිමි.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "ඛන්‍ධ යමක වර්ණනාව නිමි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "3. ආයතන යමක වර්ණනාව",
                        "level": 4
                    },
                    {
                        "type": "heading",
                        "text": "පණ්ණත්තිඋද්දෙසවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දැන් මූල යමකයෙහි දේශනා කළ කුසලාදි ධර්මයත් ආයතන යමකයෙහි ද සංග්‍රහකොට ඛන්‍ධ යමකයට අනතුරුව දේශනා කළ ආයතන යමකයේ වර්ණනාව වේ. එහි ඛන්‍ධ යමකයෙහි කියන ලද නයින් ම පෙළෙහි නියමය දතයුතුය. එහි මෙන් මෙහි ද පණ්ණත්තිවාර, පවත්තිවාර, පරිඤ්ඤාවාර යයි මහාවාර තුනක් වේ. වචනාර්ථය ද ඒවායේ කියන ලද අයුරින්ම දතයුතුය. මෙහි ද පණ්ණත්තිවාරය උද්දේස නිද්දේස වශයෙන් නියම දෙකකි. සෙසු දෙකෙහි නිද්දේස වශයෙන් ම වේ. එහෙයින් **එහි ද්වාදසායතනානි** යන පදය ආදිකොට **නායතනා න මනො** යි දක්වා පණ්ණත්ති වාරයේ උද්දේසවාරය දතයුතුය. එහි **ද්වාදසායතනානි **යන මෙය යමක වශයෙන් ඇසිය යුතු ආයතනයන්ගේ උද්දේසයි. **චක්ඛායතනං.. -පෙ- ධම්මායතනං** ඒවායේම ප්‍රභේද වශයෙන් නාම නියමයයි. යමක වශයෙන් මෙහි ඇසීමේ පහසුව සඳහා පළමුව පිළිවෙලින් අජ්ඣත්ත රූප ආයතන කියන ලදි. බාහිර රූප ආයතන පසුව අවසානයෙහි මනායතන ධම්මායතන,"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 29,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යථා පන හෙට්ඨා ඛන්ධවසෙන, එවමිධ ඉමෙසං ආයතනානං වසෙන පදසොධනවාරො, පදසොධනමූලචක්කවාරො, සුද්ධායතනවාරො, සුද්ධායතනමූලචක්කවාරොති, චත්තාරොව නයවාරා හොන්ති. එකෙකො චෙත්ථ අනුලොමපටිලොමවසෙන දුවිධොයෙව. තෙසමත්ථො තත්ථ වුත්තනයෙනෙව වෙදිතබ්බො. යථා පන ඛන්ධයමකෙ පදසොධනවාරස්ස අනුලොමවාරෙ ‘රූපං රූපක්ඛන්ධො, රූපක්ඛන්ධො රූප’න්තිආදීනි පඤ්ච යමකානි, තථා ඉධ ‘චක්ඛු, චක්ඛායතනං; චක්ඛායතනං; චක්ඛූ’තිආදීනි ද්වාදස. පටිලොමවාරෙපි ‘න චක්ඛු, න චක්ඛායතනං; න චක්ඛායතනං, න චක්ඛූ’තිආදීනි ද්වාදස , පදසොධනමූලචක්කවාරස්ස පනෙත්ථ අනුලොමවාරෙ එකෙකායතනමූලකානි එකාදස එකාදස කත්වා ද්වත්තිංසසතං යමකානි. පටිලොමවාරෙපි ද්වත්තිංසසතමෙව. සුද්ධායතනවාරස්සාපි අනුලොමවාරෙ ද්වාදස, පටිලොමවාරෙ ද්වාදස, සුද්ධායතනමූලචක්කවාරස්සාපි අනුලොමවාරෙ එකෙකායතනමූලකානි එකාදස එකාදස කත්වා ද්වත්තිංසසතං යමකානි. පටිලොමවාරෙපි ද්වත්තිංසසතමෙවාති එවමිධ ඡසත්තතාධිකෙහි පඤ්චහි යමකසතෙහි, ද්විපඤ්ඤාසාධිකෙහි එකාදසහි පුච්ඡාසතෙහි, චතුරාධිකෙහි තෙවීසාය අත්ථසතෙහි ච පටිමණ්ඩිතො පණ්ණත්තිවාරස්ස උද්දෙසවාරො වෙදිතබ්බො."
                    },
                    {
                        "type": "centered",
                        "text": "පණ්ණත්තිඋද්දෙසවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පණ්ණත්තිනිද්දෙසවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "නිද්දෙසවාරෙ පන හෙට්ඨා ඛන්ධයමකස්ස පණ්ණත්තිවාරනිද්දෙසෙ වුත්තනයෙනෙව අත්ථො වෙදිතබ්බො. අඤ්ඤත්ර විසෙසා. තත්රායං විසෙසො – **දිබ්බචක්ඛූ**ති දුතියවිජ්ජාඤාණං. **පඤ්ඤාචක්ඛූ**ති තතියවිජ්ජාඤාණං. **දිබ්බසොත**න්ති දුතියඅභිඤ්ඤාඤාණං. **තණ්හාසොත**න්ති තණ්හාව. **අවසෙසො කායො**ති නාමකායො, රූපකායො, හත්ථිකායො, අස්සකායොති එවමාදි. **අවසෙසං රූප**න්ති රූපායතනතො සෙසං භූතුපාදායරූපඤ්චෙව පියරූපසාතරූපඤ්ච. **සීලගන්ධො**තිආදීනි වායනට්ඨෙන සීලාදීනංයෙව නාමානි. **අත්ථරසො**තිආදීනිපි සාධුමධුරට්ඨෙන අත්ථාදීනඤ්ඤෙව නාමානි. **අවසෙසො ධම්මො**ති පරියත්තිධම්මාදිඅනෙකප්පභෙදොති අයමෙත්ථ විසෙසො."
                    },
                    {
                        "type": "centered",
                        "text": "පණ්ණත්තිනිද්දෙසවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පවත්තිවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධාපි ච පවත්තිවාරස්ස උප්පාදවාරාදීසු තීසු අන්තරවාරෙසු එකෙකස්මිං ඡළෙව කාලභෙදා. තෙසං එකෙකස්මිං කාලෙ පුග්ගලවාරාදයො තයො වාරා. තෙ සබ්බෙපි අනුලොමපටිලොමනයවසෙන දුවිධාව හොන්ති. තත්ථ පච්චුප්පන්නකාලෙ පුග්ගලවාරස්ස අනුලොමනයෙ යථා ඛන්ධයමකෙ රූපක්ඛන්ධමූලකානි චත්තාරි, වෙදනාක්ඛන්ධමූලකානි තීණි, සඤ්ඤාක්ඛන්ධමූලකානි ද්වෙ, සඞ්ඛාරක්ඛන්ධමූලකං එකන්ති අග්ගහිතග්ගහණෙන දස යමකානි හොන්ති. එවං “යස්ස චක්ඛායතනං උප්පජ්ජති, තස්ස සොතායතනං උප්පජ්ජති; යස්ස වා පන සොතායතනං උප්පජ්ජති, තස්ස චක්ඛායතනං උප්පජ්ජති; යස්ස චක්ඛායතනං උප්පජ්ජති, තස්ස ඝාණායතනං, ජිව්හායතනං, කායායතනං, රූපායතනං, සද්දායතනං, ගන්ධායතනං, රසායතනං, ඵොට්ඨබ්බායතනං, මනායතනං, ධම්මායතනං, උප්පජ්ජති; යස්ස වා පන ධම්මායතනං උප්පජ්ජති, තස්ස චක්ඛායතනං උප්පජ්ජතී”ති එවං චක්ඛායතනමූලකානි එකාදස. “යස්ස සොතායතනං උප්පජ්ජති, තස්ස ඝානායතනං උප්පජ්ජතී”තිආදිනා නයෙන සොතායතනමූලකානි දස; ඝානායතනමූලකානි නව, ජිව්හායතනමූලකානි අට්ඨ; කායායතනමූලකානි සත්ත; රූපායතනමූලකානි ඡ; සද්දායතනමූලකානි පඤ්ච; ගන්ධායතනමූලකානි චත්තාරි; රසායතනමූලකානි තීණි; ඵොට්ඨබ්බායතනමූලකානි ද්වෙ; මනායතනමූලකං එකන්ති අග්ගහිතග්ගහණෙන ඡසට්ඨි යමකානි හොන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යට යම්සේ ස්කන්ධ වශයෙන් මෙන් මෙසේ මෙහි මේ ආයතනය්නගේ වශයෙන් පදසොධනවාරය, පදසොධන මූලචක්කවාරය, සුද්ධායතනවාරය, සුද්ධායතන මූලචක්කවාරය යයි නයවාර සතරක් වේ. මෙහි එක එකක් අනුලෝම පටිලෝම වශයෙන් දෙපරිදි වේ. ඒවායේ අර්ථ එහි කියන ලද නයින්ම දතයුතුය. ඛන්‍ධ යමකයෙහි පදසෝධනවාර අනුලෝම වාරයේ යම්සේ **රූපං රූපක්ඛන්‍ධො, රූපක්ඛන්‍ධො රූපං** යනාදි පංච යමකයක් වීද, එසේම මෙහි **චක්ඛු චක්ඛායතනං, චක්ඛායතනං චක්ඛූ** යනාදි දොළොසක් වේ. පටිලෝම වාරයෙහි ද **න චක්ඛු න චක්ඛායතනං න චක්ඛායතනං** **න චක්ඛු** යනාදි දොළොසක් වේ. මෙහි පදසෝධන මූලචක්කවාර අනුලෝම වාරයෙහි එක් එක් ආයතන මූලක එකොලහ බැගින් කර එකසිය තිස්දෙකක් වේ. සුද්ධායතනවාර අනුලෝම වාරයෙහි දොළොසක්, පටිලෝම වාරයෙහි දොළොසක් සුද්ධායතන මූල චක්කවාර අනුලෝම වාරයෙහි එක් එක් ආයතන මූලක එකොළහ බැගින් කොට යමක එකසිය තිස්දෙකක් වේ. පටිලෝමවාරයෙහි ද එක්සිය තිස්දෙකක්ම වේ. මෙසේ යමක පන්සිය සැත්තෑසයක් ඒ ඒ වාර අනුව (576 = 12x2 = 24 + 12x11 = 132x4 = 528 + 24 = 576) පුච්ඡා එක්දහස් එකසිය පනස් දෙකක් වේ. (576x2 = 1152) අර්ථ දෙදහස් තුන්සිය සතරක් වේ. (1152x2 = 2304) මෙසේ යුක්ත වූ පණ්ණත්ති වාරයේ උද්දේස වාරය දතයුතුය."
                    },
                    {
                        "type": "centered",
                        "text": "",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පණ්ණත්තිනිද්දෙසවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "නිද්දේස වාරයෙහි වනාහි යට ඛන්‍ධ යමකයේ පණ්ණත්තිවාර නිද්දේසයෙහි කියන ලද නයින් අර්ථය දතයුතුය. විශේෂ හැර. එහි විශේෂය මෙසේය. **දිබ්බ චක්ඛු** දෙවන විද්‍යා ඤාණයයි. **පඤ්ඤාචක්ඛු** තෙවැනි විද්‍යා ඤාණයයි. **දිබ්බසොතං** දෙවැනි අභිඥා ඤාණයයි. **තණ්හා සොතං** තෘෂ්ණාව. **අවසෙසො කායො** නාමකය, රූපකාය, හස්තිකාය, අශ්වකාය මෙනි. **අවසෙසං රූපං** රූපායතනයෙන් සේස වූ භූත, උපාදාය රූපද පියරූප, මිහිරි රූපද. **සීලගන්‍ධො** යනාදිය හැමීම් අර්ථයෙන් සීලාදියටම නම් වේ. **අත්‍ථරසො** ආදියද යහපත් මිහිරි අර්ථයෙන් අර්ථවලටම නම් වේ. **අවසෙසො ධම්මො** අනේක ප්‍රභේද වූ පර්යාප්ති ධර්මාදිය මෙහි විශේෂයයි."
                    },
                    {
                        "type": "centered",
                        "text": "",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පවත්තිවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙහි ද පවත්තිවාරයේ උප්පාද වාරවල අන්තර තුනෙහි එක එකේ කාලභේද හය වේ. ඒවායේ එක් එක් කාලයෙහි පුද්ගල වාරාදි තුන්වාරයක් වේ. ඒ සියල්ල අනුලෝම පටිලෝම වශයෙන් ද්විධ වේ. එහි වර්තමාන කාලයේ පුද්ගලවාරයේ අනුලෝම නයෙහි ඛන්‍ධ යමකයෙහි රූපස්කන්ධ මූලක සතරය. වේදනා ස්ක්නධ මූලක තුනය, සඤ්ඤා ස්කන්ධ මූලක දෙකය, සංඛාර ස්කන්ධමූලක එකයයි අගහිත ගහණයෙන් යමක දහයක් වේ. එසේම යමෙකුට චක්ඛායතනය උපදීද ඔහුට සෝතායතනය උපදී. යමකෙුට වනාහි සෝතායතනය උපදීද ඔහුට චක්ඛායතනය උපදී. යමෙකුට චක්ඛායතනය උපදීද ඔහුට ඝානායතන ජිව්හායතන කායායතන රූපායතන සද්දායතන ගන්ධායතන, රසායතන, පොට්ඨබ්බායතන, මනායතන ධම්මායතන උපදී. යමකෙුට වනාහි ධම්මායතන උපදීද ඔහුට චක්ඛායතන උපදීයයි මෙසේ චක්ඛායතන මූලක එකොලහක් ද යමෙකුට සෝතායතනය උපදීද ඔහුට ඝානායතනය උපදී යනාදි නයින් සෝතායතන මූලක දහයක් ද ඝානායතන මූලක නවයක් ද ජිව්හායතන මූලක අටක් ද කායායතන මූලක සතක් ද රූපායතන මූලක හයක් ද සද්දායතන මූලක පහක් ද ගන්ධායතන මූලක හතරක්ද රසායතන මූලක තුනක් ද පොට්ඨබ්බායතන මූලක දෙකක්ද මනායතන මූලක එකක්දැයි අගහිත ගහණයෙන් හැටහයක් යමක වේ."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 31,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තත්ථ චක්ඛායතනමූලකෙසු එකාදසසු “යස්ස චක්ඛායතනං උප්පජ්ජති, තස්ස සොතායතනං, ඝානායතනං, රූපායතනං, මනායතනං, ධම්මායතනං උප්පජ්ජතී”ති ඉමානි පඤ්චෙව විස්සජ්ජිතානි. තෙසු පඨමං විස්සජ්ජෙතබ්බං තාව විස්සජ්ජිතං. දුතියං කිඤ්චාපි පඨමෙන සදිසවිස්සජ්ජනං, චක්ඛුසොතායතනානං පවත්තිට්ඨානෙ පන ඝානායතනස්ස න එකන්තෙන පවත්තිතො “කථං නු ඛො එතං විස්සජ්ජෙතබ්බ”න්ති විමතිනිවාරණත්ථං විස්සජ්ජිතං. රූපායතනමනායතනධම්මායතනෙහි සද්ධිං තීණි යමකානි අසදිසවිස්සජ්ජනත්තා විස්සජ්ජිතානි. සෙසෙසු ජිව්හායතනකායායතනෙහි තාව සද්ධිං ද්වෙ යමකානි පුරිමෙහි ද්වීහි සද්ධිං සදිසවිස්සජ්ජනානි. සද්දායතනස්ස පටිසන්ධික්ඛණෙ අනුප්පත්තිතො තෙන සද්ධිං යමකස්ස විස්සජ්ජනමෙව නත්ථි. ගන්ධරසඵොට්ඨබ්බායතනෙහිපි සද්ධිං තීණි යමකානි පුරිමෙහි ද්වීහි සදිසවිස්සජ්ජනානෙව හොන්තීති තන්තියා ලහුභාවත්ථං සඞ්ඛිත්තානි. සොතායතනමූලකෙසු යං ලබ්භති , තං පුරිමෙහි සදිසවිස්සජ්ජනමෙවාති එකම්පි පාළිං නාරුළ්හං. ඝානායතනමූලකෙසු රූපායතනෙන සද්ධිං එකං, මනායතනධම්මායතනෙහි සද්ධිං ද්වෙති තීණි යමකානි පාළිං ආරුළ්හානි. සෙසානි ඝානායතනයමකෙන සදිසවිස්සජ්ජනත්තා නාරුළ්හානි. තථා ජිව්හායතනකායායතනමූලකානි. රූපායතනමූලකෙසු මනායතනධම්මායතනෙහි සද්ධිං ද්වෙයෙව විස්සජ්ජිතානි. ගන්ධරසඵොට්ඨබ්බෙහි පන සද්ධිං තීණි රූපායතනමනායතනෙහි සද්ධිං සදිසවිස්සජ්ජනානි. යථෙව හෙත්ථ “සරූපකානං අචිත්තකාන”න්තිආදි වුත්තං, තථා ඉධාපි “සරූපකානං අගන්ධකානං, අරසකානං අඵොට්ඨබ්බකාන”න්ති යොජනා වෙදිතබ්බා. ගන්ධාදීනි චෙත්ථ ආයතනභූතානෙව අධිප්පෙතානි. තස්මා “සරූපකානං සගන්ධායතනාන”න්ති ආයතනවසෙනෙත්ථ අත්ථො දට්ඨබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "සද්දායතනමූලකානි අත්ථාභාවතො පාළිං නාරුළ්හානෙව. ගන්ධරසඵොට්ඨබ්බමූලකානි චත්තාරි තීණි ද්වෙ ච හෙට්ඨිමෙහි සදිසවිස්සජ්ජනත්තා පාළිං නාරුළ්හානි. මනායතනමූලකං විස්සජ්ජිතමෙවාති එවමෙතානි පච්චුප්පන්නකාලෙ පුග්ගලවාරස්ස අනුලොමනයෙ කතිපයයමකවිස්සජ්ජනෙනෙව ඡසට්ඨියමකානි විස්සජ්ජිතානි නාම හොන්තීති වෙදිතබ්බානි. යථා ච පුග්ගලවාරෙ, එවං ඔකාසවාරෙපි පුග්ගලොකාසවාරෙපි ඡසට්ඨීති පච්චුප්පන්නකාලෙ තීසු වාරෙසු අනුලොමනයෙ අට්ඨනවුතිසතං යමකානි හොන්ති. යථා ච අනුලොමනයෙ, එවං පටිලොමනයෙපීති සබ්බානිපි පච්චුප්පන්නකාලෙ ඡන්නවුතාධිකානි තීණි යමකසතානි හොන්ති. තෙසු ද්වානවුතාධිකානි සත්ත පුච්ඡාසතානි, චතුරාසීතාධිකානි ච පන්නරස අත්ථසතානි හොන්තීති වෙදිතබ්බානි. එවං සෙසෙසුපි පඤ්චසු කාලභෙදෙසූති සබ්බානිපි ඡසත්තතාධිකානි තෙවීසති යමකසතානි. තතො දිගුණා පුච්ඡා, තතො දිගුණා අත්ථාති ඉදමෙත්ථ උප්පාදවාරෙ පාළිවවත්ථානං. නිරොධවාරඋප්පාදනිරොධවාරෙසුපි එසෙව නයොති. සබ්බස්මිම්පි පවත්තිවාරෙ අට්ඨවීසානි එකසත්තති යමකසතානි. තතො දිගුණා පුච්ඡා, තතො දිගුණා අත්ථා වෙදිතබ්බා. පාළි පන මනායතනං ධම්මායතනඤ්ච එකසදිසං, නානං නත්ථි. උපරි පන “වාරසඞ්ඛෙපො හොතී”තිආදීනි වත්වා තත්ථ තත්ථ සඞ්ඛිත්තා. තස්මා යං තත්ථ තත්ථ සඞ්ඛිත්තං, තං සබ්බං අසම්මුය්හන්තෙහි සල්ලක්ඛෙතබ්බං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එහි චක්ඛු ආයතන මූලකවල එකොලහේ යමෙකුට චක්ඛායතනය උපදී. ඔහුට සෝතායතනය, ඝානායතනය, රූපායතනය, මනායතනය, ධම්මායතනය උපදී යයි මේ පසම විසඳන ලදි. ඒවායින් පළමුව විසඳිය යුතු ඒවා විසඳන ලදි. දෙවනුව කිසිවක් ද පළමුවැන්නට සමානව විසඳන ලදි. චක්ඛු සෝත ආයතනවල පවතින ස්ථානයෙහි වනාහි ඝානායතනය ඒකාන්තයෙන් ම නො පවතී. මෙය කෙසේ විසඳිය යුතුදැයි විමතිය නිවාරණය කිරීම සඳහා විසඳන ලදි. රූපායතන මනායතන ධම්මායතන සමග යමක තුන අසදෘශ විසඳීම් බැවින් විසඳන ලදි. සෙසු ජිව්හායතන කායායතන සමග යමක දෙක පෙර දෙක සමග සමානව විසඳන ලදි. සද්දායතනය පටිසන්ධි ක්‍ෂණයෙහි නොපත් බැවින් එය සමග යමකයේ විසඳීමක් නැත. ගන්‍ධ රස පොට්ඨබ්බ ආයතන සමග යමක තුන පෙර දෙකට සමානව විසඳන ලද්දේ වේ. පෙළෙහි ලුහුබව සඳහා සංක්‍ෂෙප කරන ලදි. සෝතායතන මූලකවල යමක් ලබාද එය පෙර සමානව විසඳන ලද්දේ යයි එකක්වත් පෙළට ඇතුළත් නොකරන ලදි. ඝානායතන මූලකවල රූපායතන සමග එකක්, මනායතන, ධම්මායතන සමග දෙකක් තුනක් යමක පෙළෙහි ඇතුළත් කරන ලදි. එසේම ජිව්හායතන කායායතන මූලකවල, රූපායතන මූලකවල මනායතන සමග දෙකක්ම විසඳන ලදි. ගන්ධ රස පොට්ඨබ්බ සමග තුනක් රූපායතන මනායතන සමග සමානව විසඳන ලදි. යම්සේ යට ස්වරූප වූ අචිත්තකයින්ගේ යනාදිය කියන ලදි. එසේම මෙහි ද ස්වරූප වූ අගන්ධවල අරසවල අපොට්ඨබ්බවල යෙදීම දතයුතුය. මෙහි ගන්‍ධාදිය ආයතන වශයෙන් ම අභිප්‍රේතය. එහෙයින් **සරූපකානං සගන්‍ධායතනානං** යන ආයතන වශයෙන් මෙනි. අර්ථය දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "සද්දායතන මූලකවල අර්ථ අභාවයෙන් පෙළෙහි ඇතුළත් නොකරන ලදි. ගන්‍ධ රස පොට්ඨබ්බ මූලකවල සතර තුන දෙක ද යට සමානව විසඳන ලද බැවින් පෙළෙහි ඇතුළත් නොකරන ලදි. මනායතන මූලක විසඳන ලදමයයි මෙසේ මේවා වර්තමාන කාලයේ පුද්ගලවාරයේ අනුලෝම නයෙහි යමක කීපයක් විසඳීමෙන් ම යමක හැටහයක් විසඳන ලද්දේ වේයයි දතයුතුය. පුද්ගල වාරයෙහි මෙන් ඕකාස වාරයෙහි ද පුග්ගලොකාසවාරයෙහි ද හැටහය යයි වර්තමාන කාලයේ තුන් වාරයෙහි අනුලෝම නයෙහි යමක එකසිය අනූඅටක් වේ. අනුලෝම නයෙහි මෙන් පටිලෝම නයෙහි ද වේ. වර්තමාන කාලයෙහි සියල්ල යමක තුන්සිය අනූහයක් වේ. ඒවායේ පුච්ඡා හත්සිය අනූදෙකක් වේ. අර්ථ එක්දහස් පන්සිය අසූහතරක් වේයයි දතයුතුය. මෙසේ සෙසු කාලප්‍රභේද පසෙහිද සියල්ල දෙදහස් තුන් හැත්තෑහයක් වේ. පුච්ඡා හාරදහස් හත්සිය පනස් දෙකක් වේ. අර්ථ නවදහස් පන්සිය හතරක් වේ යයි මෙය මෙහි උප්පාද වාරයෙහි පෙළෙහි නියමයයි. නිරෝධවාර උප්පාද නිරෝධ වාරවලද මෙම නයම වේ. පවත්ති වාරයෙහි සියළු යමක හත්දහස් එකසිය විසිඅටක් වේ. පුච්ඡා එයින් දෙගුණය වේ. අර්ථ එයින් දෙගුණය වේයයි දතයුතුය. පෙළ වනාහි මනායතන ධම්මායතන එක සමානය. විවිධ නැත. ඉහළ වනාහි වාර සංක්‍ෂෙප වේ යයි ආදිය කියා ඒ ඒ තැන සංක්‍ෂේප කරන ලදි. එහෙයින් යම් තැන්වල සංක්‍ෂෙපද ඒ සියල්ල නුමුළා වන්නන් විසින් සැලකිය යුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 33,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අත්ථවිනිච්ඡයෙ පනෙත්ථ ඉදං නයමුඛං. **සචක්ඛුකානං අසොතකාන**න්ති අපායෙ ජාතිබධිරඔපපාතිකං සන්ධාය වුත්තං. සො හි සචක්ඛුකො අසොතකො හුත්වා උපපජ්ජති. යථාහ – “කාමධාතුයා උපපත්තික්ඛණෙ කස්සචි අපරානි දසායතනානි පාතුභවන්ති. ඔපපාතිකානං පෙතානං , ඔපපාතිකානං අසුරානං, ඔපපාතිකානං තිරච්ඡානගතානං, ඔපපාතිකානං නෙරයිකානං; ජච්චබධිරානං උපපත්තික්ඛණෙ දසායතනානි පාතුභවන්ති, චක්ඛායතනං රූපඝානගන්ධජිව්හාරසකායඵොට්ඨබ්බායතනං මනායතනං ධම්මායතන”න්ති. **සචක්ඛුකානං සසොතකාන**න්ති සුගතිදුග්ගතීසු පරිපුණ්ණායතනෙ ච ඔපපාතිකෙ රූපීබ්රහ්මානො ච සන්ධාය වුත්තං. තෙ හි සචක්ඛුකා සසොතකා හුත්වා උපපජ්ජන්ති. යථාහ – “කාමධාතුයා උපපත්තික්ඛණෙ කස්සචි එකාදසායතනානි පාතුභවන්ති; කාමාවචරානං දෙවානං, පඨමකප්පිකානං මනුස්සානං, ඔපපාතිකානං පෙතානං, ඔපපාතිකානං අසුරානං, ඔපපාතිකානං තිරච්ඡානගතානං, ඔපපාතිකානං නෙරයිකානං, පරිපුණ්ණායතනානං. රූපධාතුයා උපපත්තික්ඛණෙ පඤ්චායතනානි පාතුභවන්ති, චක්ඛායතනං රූපසොතමනායතනං ධම්මායතන”න්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අඝානකාන**න්ති බ්රහ්මපාරිසජ්ජාදයො සන්ධාය වුත්තං. තෙ හි සචක්ඛුකා අඝානකා හුත්වා උපපජ්ජන්ති. කාමධාතුයං පන අඝානකො ඔපපාතිකො නත්ථි. යදි භවෙය්ය “කස්සචි අට්ඨායතනානි පාතුභවන්තී”ති වෙදය්ය. යො ගබ්භසෙය්යකො පන අඝානකො සියා, සො “සචක්ඛුකාන”න්ති වචනතො ඉධ අනධිප්පෙතො. **සචක්ඛුකානං සඝානකාන**න්ති ජච්චබධිරම්පි පරිපුණ්ණායතනම්පි ඔපපාතිකං සන්ධාය වුත්තං. **සඝානකානං අචක්ඛුකාන**න්ති ජච්චන්ධම්පි ජච්චබධිරම්පි ඔපපාතිකං සන්ධාය වුත්තමෙව. **සඝානකානං සචක්ඛුකාන**න්ති පරිපුණ්ණායතනමෙව ඔපපාතිකං සන්ධාය වුත්තං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සරූපකානං අචක්ඛුකාන**න්ති එත්ථ ජච්චන්ධජච්චබධිරඔපපාතිකෙසු අඤ්ඤතරොපි ගබ්භසෙය්යකොපි ලබ්භතියෙව. **සචිත්තකානං අචක්ඛුකාන**න්ති එත්ථ හෙට්ඨා වුත්තෙහි ජච්චන්ධාදීහි තීහි සද්ධිං අරූපිනොපි ලබ්භන්ති. **අචක්ඛුකාන**න්ති එත්ථ පුරිමපදෙ වුත්තෙහි චතූහි සද්ධිං අසඤ්ඤසත්තාපි ලබ්භන්ති. **සරූපකානං අඝානකාන**න්ති එත්ථ ගබ්භසෙය්යකා ච අසඤ්ඤසත්තා ච සෙසරූපීබ්රහ්මානො ච ලබ්භන්ති. **සචිත්තකානං අඝානකාන**න්ති එත්ථ ගබ්භසෙය්යකා ච රූපාරූපබ්රහ්මානො ච ලබ්භන්ති. **අචිත්තකානං අරූපකාන**න්තිපදෙසු පන එකවොකාරචතුවොකාරසත්තාව ලබ්භන්තීති ඉමිනා නයෙන සබ්බෙසු පුග්ගලවාරෙසු පුග්ගලවිභාගො වෙදිතබ්බො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "මෙහි අර්ථ විනිශ්චයෙහි වනාහි මේ නය මුඛය :- **සචක්ඛුකානං අසොතකානං** යයි අපායෙහි උපන් බිහිරි ඕපපාතිකයන් සඳහා කියන ලදි. හේ චක්ඛු සහිතව කන් රහිතව උපදී. යම්සේ කීහ. කාමධාතුවේ උපන් කෙණෙහි කිසිවෙකුගේ අපර වූ දස ආයතන පහළ වේ. ඕපපාතික ප්‍රේතයින්ගේ ඕපපාතික අසුරයන්ගේ ඕපපාතික තිරිසන්ගත සතුන්ගේ ඕපපාතික නිරයවාසීන්ගේ ජාති බිහිරන්ගේ උපන් කෙනෙහි දස ආයතන පහළ වේ. චක්ඛායතන, රූප, ඝාන, ගන්ධ, ජිව්හා, රස, කාය, ඵොට්ඨබ්බ ආයතන මනායතන ධම්මායතන වේ. **සචක්ඛුකානං සසොතකානං** සුගති දුගතිවල පරිපූර්ණ ආයතනවල ද ඕපපාතික රූපී බ්‍රහ්මයන් සඳහා කියන ලදි. ඔව්හු චක්ඛු සහිතව කන් සහිතව උපදිති. යම්සේ කීහ. කාම ධාතුවෙහි උපන් කෙනෙහි කිසිවකුට ආයතන එකොළහක් පහළ වේ. කාමාවචර දෙවියන්ට ප්‍රථම කල්පික මිනිසුන්ට ඕපපාතික ප්‍රේතයන්ට ඕපපාතික අසුරයන්ට ඕපපාතික තිරිසන්ගතයන්ට ඕපපාතික නෙරයිකයන්ට පරිපූර්ණ ආයතන වේ. රූප ධාතුවෙහි උපන් කෙනෙහි චක්ඛායතන රූප සෝත මනායතන ධම්මායාතන යන පංචායතන පහළ වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අඝාතකානං **බ්‍රහ්ම පාරිසද්‍යාදීහු සඳහා කියන ලදි. ඔව්හු චක්ඛු සහිතව ඝාන රහිතව උපදිති. කාමධාතුවෙහි වනාහි අඝානක ඕපපාතිකයෝ නැත්තාහ. ඉදින් වන්නේ නම් කිසිවකුට ආයතන අටක් පහළවේ යයි කියන්නේය. යම් ගබ්භ සෙය්‍යකයෙක් වනාහි අඝාතක වන්නේය. හේ **සචක්ඛුකානං** වචනයෙන් මෙහි අභිප්‍රේත නොවේ. **සචක්ඛුකානං අඝාතකානං** ජාති බධිරයන් ද පරිපූර්ණ ආයතන ඕපපාතිකයන් ද සඳහා කියන ලදි. **සඝාතකානං අචක්ඛුකානං** ජාති අන්‍ධයා ද ජාති බධිරයා ද ඕපපාතිකයාද සඳහා කියන ලදි. **සඝානකානං සචක්ඛුකානං** සම්පූර්ණ ආයතන ඇති ඕපපාතිකයන් සඳහා කියන ලදි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සරූපකානං අචක්ඛුකානං** මෙහි ජාති අන්ධ ජාති බධිර ඕපපාතිකයන් අතරෙහි ගබ්භසෙය්‍යකයා ද ලැබේ. **සචිත්තකානං අචක්ඛුකානං** මෙහි යට කියන ලද ජාති අන්ධ ආදි තුන්දෙනා සමග අරූපීහු ද ලබති. **අචක්ඛුකානං **මෙහි පෙර පදයෙහි කියන ලද සතර දෙනා සමග අසඤ්ඤසත්ත්වයෝ ද ලබති. **සරූපකානං අඝානකානං** මෙහි ගබ්භ සෙය්‍යො ද අසඤ්ඤ සත්ත්වයෝ ද සෙසු රූපී බ්‍රහ්මයෝ ද ලබති. **සචිත්තකානං අඝානකානං** මෙහි ගබ්භසෙය්‍යොද රූපාරූපී බ්‍රහ්මයෝ ද ලබති. **අචිත්තකානං අරූපකානං** පදවල වනාහි ඒකවෝකාර චතුවෝකාර සත්ත්වයෝම ලබති. මෙම නයින් සියළු පුග්ගලවාරවල පුග්ගල විභාගය දතයුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 35,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඔකාසවාරෙ **යත්ථ චක්ඛායතන**න්ති රූපීබ්රහ්මලොකං පුච්ඡති. තෙනෙව **ආමන්තා**ති වුත්තං . තස්මිඤ්හි තලෙ නියමතො තානි ආයතනානි පටිසන්ධියං උප්පජ්ජන්ති. ඉදමෙත්ථ නයමුඛං. ඉමිනා නයමුඛෙන සකලෙපි පවත්තිවාරෙ අත්ථො වෙදිතබ්බො. පරිඤ්ඤාවාරො ඛන්ධයමකෙ වුත්තනයොයෙවාති."
                    },
                    {
                        "type": "centered",
                        "text": "පවත්තිවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "ආයතනයමකවණ්ණනා නිට්ඨිතා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "4. ධාතුයමකං",
                        "level": 4
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදානි තෙයෙව මූලයමකෙ දෙසිතෙ කුසලාදිධම්මෙ ධාතුවසෙන සඞ්ගණ්හිත්වා ආයතනයමකානන්තරං දෙසිතස්ස ධාතුයමකස්ස වණ්ණනා හොති. තත්ථ ආයතනයමකෙ වුත්තනයෙනෙව පාළිවවත්ථානං වෙතිදබ්බං. ඉධාපි හි පණ්ණත්තිවාරාදයො තයො මහාවාරා, අවසෙසා අන්තරවාරා ච සද්ධිං කාලප්පභෙදාදීහි ආයතනයමකෙ ආගතසදිසායෙව. ඉධාපි ච යමකපුච්ඡාසුඛත්ථං පටිපාටියා අජ්ඣත්තිකබාහිරා රූපධාතුයොව වත්වා විඤ්ඤාණධාතුයො වුත්තා. ධාතූනං පන බහුත්තා ඉධ ආයතනයමකතො බහුතරානි යමකානි, යමකදිගුණා පුච්ඡා, පුච්ඡාදිගුණා ච අත්ථා හොන්ති. තත්ථ චක්ඛුධාතුමූලකාදීසු යමකෙසු ලබ්භමානානං යමකානං අත්ථවිනිච්ඡයො ආයතනයමකෙ වුත්තනයෙනෙව වෙදිතබ්බො. තංසදිසායෙව හෙත්ථ අත්ථගති, තෙනෙව ච කාරණෙන පාළිපි සඞ්ඛිත්තා. පරිඤ්ඤාවාරො පාකතිකොයෙවාති."
                    },
                    {
                        "type": "centered",
                        "text": "ධාතුයමකවණ්ණනා නිට්ඨිතා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "5. සච්චයමකං",
                        "level": 4
                    },
                    {
                        "type": "heading",
                        "text": "පණ්ණත්තිවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදානි තෙයෙව මූලයමකෙ දෙසිතෙ කුසලාදිධම්මෙ සච්චවසෙන සඞ්ගණ්හිත්වා ධාතුයමකානන්තරං දෙසිතස්ස සච්චයමකස්ස වණ්ණනා හොති. තත්ථාපි හෙට්ඨා වුත්තනයෙනෙව පණ්ණත්තිවාරාදයො තයො මහාවාරා අන්තරවාරාදයො ච අවසෙසප්පභෙදා වෙදිතබ්බා. පණ්ණත්තිවාරෙ පනෙත්ථ චතුන්නං සච්චානං වසෙන පදසොධනවාරො, පදසොධනමූලචක්කවාරො, සුද්ධසච්චවාරො, සුද්ධසච්චමූලචක්කවාරොති ඉමෙසු චතූසු වාරෙසු යමකගණනා වෙදිතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "පණ්ණත්තිවාරනිද්දෙසෙ පන **අවසෙසං දුක්ඛසච්ච**න්ති දුක්ඛවෙදනාය චෙව තණ්හාය ච විනිමුත්තා තෙභූමකධම්මා වෙදිතබ්බා. **අවසෙසො සමුදයො**ති සච්චවිභඞ්ගෙ නිද්දිට්ඨකාමාවචරකුසලාදිභෙදො දුක්ඛසච්චස්ස පච්චයො. **අවසෙසො නිරොධො**ති තදඞ්ගවික්ඛම්භනසමුච්ඡෙදපටිපස්සද්ධිනිරොධො චෙව ඛණභඞ්ගනිරොධො ච. **අවසෙසො මග්ගො**ති “තස්මිං ඛො පන සමයෙ පඤ්චඞ්ගිකො මග්ගො හොති, අට්ඨඞ්ගිකො මග්ගො, මිච්ඡාමග්ගො, ජඞ්ඝමග්ගො, සකටමග්ගො”ති එවමාදිකො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඕකාස වාරයෙහි **යත්‍ථ චක්ඛායතනං** රූපී බ්‍රහ්මලෝකය විචාරයි. එයින්ම **ආමන්තා **යයි කියන ලදි. ඒ තලයෙහි නියමයෙන් ඒ ආයතනවල පිළිසිඳීමෙහි උපදිති. මෙහි නය මුඛය මෙසේය. මෙම නය මුඛයෙන් සියළුම පවත්තිවාරවල අර්ථය දතයුතුය. පරිඤ්ඤා වාරය ඛන්‍ධ යමකයෙහි කියන ලද නයින්ම වේ."
                    },
                    {
                        "type": "centered",
                        "text": "",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "ආයතන යමක වර්ණනාව නිමි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "4. ධාතු යමක වර්ණනාව",
                        "level": 4
                    },
                    {
                        "type": "paragraph",
                        "text": "දැන් ඒ මූලයමකයෙහි දේශනා කරන ලද කුසලාද ධර්මයන් ධාතු වශයෙන් සංග්‍රහකොට ආයතන යමකට අනතුරුව දේශනා කරන ලද ධාතු යමක වර්ණනාවේ වේ. එහි ආයතන යමකයෙහි කියන ලද නයින්ම පෙළ නියමය දතයුතුය. මෙහිද පණ්ණත්ති වාරාදි මහාවාර තුන අවසේස අතුරුවාරද සමග කාල ප්‍රභේද ආදියෙන් ආයතන යමකයෙහි පැමිණියා සේ සමානය. මෙහි ද යමක ඇසීම් පහසුව සඳහා පිළිවෙලින් අජ්ඣත්තික බාහිර රූපධාතු කියා විඤ්ඤාණ ධාතුව කියන ලදි. ධාතූන්ගේ බොහෝ බව නිසා මෙහි ආයතන යමකයට වඩා බහුතර යමක, යමක ද්විගුණව පුච්ඡා, පුච්ඡා ද්විගුණව අර්ථ වේ. එහි චක්ඛුධාතු මූලක යමකවල ලැබෙන යමකයන්ගේ අර්ථ විනිශ්චය ආයතන යමකයෙහි කියන ලද නයින්ම දතයුතුය. මෙහි ඊට සමානවම අර්ථගත වේ. ඒ කරුණෙන් ම පෙළද සංක්‍ෂිප්තය. පරිඤ්ඤාවාරය ප්‍රකෘතිකමය වේ."
                    },
                    {
                        "type": "centered",
                        "text": "ධාතු යමක වර්ණනාව නිමි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "5. සත්‍ය යමක වර්ණනාව",
                        "level": 4
                    },
                    {
                        "type": "heading",
                        "text": "පණ්ණත්තිවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දැන් ඒ මූලයමකයෙහි ම දේශනා කරන ලද කුසලාදි ධර්මයන් සත්‍ය වශයෙන් සංග්‍රහකොට ධාතු යමකයට අනතුරුව දේශනා කරන ලද සත්‍ය යමක වර්ණනාව වේ. එහි ද යට කියන ලද නයින්ම පණ්ණත්ති වාරාදි මහාවාර තුන, අන්තරවාරාදි වූ අවසේස ප්‍රභේදද දතයුතුය. මෙහි පණ්ණත්තිවාරයෙහි වනාහි චතුර් සත්‍ය වශයෙන් පදසෝධන වාරය, පදසෝධන මූල චක්කවාරය, සුද්ධ චක්කවාරය, සුද්ධ සච්චමූලචක්කවාරය යයි මේ සතර වාරයෙහි යමක ගණන දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "පණ්ණත්ති වාර නිද්දේසයෙහි වනාහි **අවසෙසං දුක්ඛසච්චං** දුක්ඛ වේදනාවෙන් මෙන්ම තෘෂ්ණාවෙන් ද විනිර්මුක්ත වූ ත්‍රෛභූමක ධර්ම දතයුතුය. **අවසෙසො සමුදයො** සත්‍ය විභංගයෙහි නිර්දිෂ්ඨ කාමාවචර කුසලාදි භේද වූ දුක්ඛ සත්‍යයට ප්‍රත්‍ය වේ. **අවසෙසො නිරොධො** තදංග වික්ඛම්භන සමුච්ඡේද පටිප්පස්සද්ධි නිරෝධය ද ක්‍ෂණ භංගුර නිරෝධය ද. **අවසෙසො මග්ගො** ඒ සමයෙහි පංචංගික මාර්ගය වේ. අට්ඨංගික මාර්ගය, මිථ්‍යා මාර්ගය, අඩිපාර, කරත්ත පාර යනාදිය වේ."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 37,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "පණ්ණත්තිවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පවත්තිවාරවණ්ණනා",
                        "level": 1,
                        "keyOffset": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "පවත්තිවාරෙ පනෙත්ථ පච්චුප්පන්නකාලෙ පුග්ගලවාරස්ස අනුලොමනයෙ “යස්ස දුක්ඛසච්චං උප්පජ්ජති, තස්ස සමුදයසච්චං උප්පජ්ජති; යස්ස වා පන සමුදයසච්චං උප්පජ්ජති, තස්ස දුක්ඛසච්චං උප්පජ්ජතී”ති දුක්ඛසච්චමූලකෙහි තීහි, සමුදයසච්චමූලකෙහි ද්වීහි, නිරොධසච්චමූලකෙන එකෙනාති ලබ්භමානඤ්ච අලබ්භමානඤ්ච ගහෙත්වා පාළිවසෙන ඡහි යමකෙහි භවිතබ්බං. තෙසු යස්මා නිරොධස්ස නෙව උප්පාදො, න නිරොධො යුජ්ජති, තස්මා දුක්ඛසච්චමූලකානි සමුදයසච්චමග්ගසච්චෙහි සද්ධිං ද්වෙ, සමුදයසච්චමූලකං මග්ගසච්චෙන සද්ධිං එකන්ති තීණි යමකානි ආගතානි. තස්ස පටිලොමනයෙපි ඔකාසවාරාදීසුපි එසෙව නයො. එවමෙත්ථ සබ්බවාරෙසු තිණ්ණං තිණ්ණං යමකානං වසෙන යමකගණනා වෙදිතබ්බා. අත්ථවිනිච්ඡයෙ පනෙත්ථ ඉදං ලක්ඛණං – ඉමස්ස හි සච්චයමකස්ස පවත්තිවාරෙ නිරොධසච්චං තාව න ලබ්භතෙව. සෙසෙසු පන තීසු සමුදයසච්චමග්ගසච්චානි එකන්තෙන පවත්තියංයෙව ලබ්භන්ති. දුක්ඛසච්චං චුතිපටිසන්ධීසුපි පවත්තෙපි ලබ්භති. පච්චුප්පන්නාදයො පන තයො කාලා චුතිපටිසන්ධීනම්පි පවත්තියාපි වසෙන ලබ්භන්ති. එවමෙත්ථ යං යං ලබ්භති, තස්ස තස්ස වසෙන අත්ථවිනිච්ඡයො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්රිදං නයමුඛං – **සබ්බෙසං උපපජ්ජන්තාන**න්ති අන්තමසො සුද්ධාවාසානම්පි. තෙපි හි දුක්ඛසච්චෙනෙව උපපජ්ජන්ති. **තණ්හාවිප්පයුත්තචිත්තස්සා**ති ඉදං දුක්ඛසච්චසමුදයසච්චෙසු එකකොට්ඨාසස්ස උප්පත්තිදස්සනත්ථං වුත්තං. තස්මා පඤ්චවොකාරවසෙනෙව ගහෙතබ්බං. චතුවොකාරෙ පන තණ්හාවිප්පයුත්තස්ස ඵලසමාපත්තිචිත්තස්ස උප්පාදක්ඛණෙ එකම්පි සච්චං නුප්පජ්ජති. ඉදං ඉධ න ගහෙතබ්බං. **තෙසං දුක්ඛසච්චඤ්චා**ති තස්මිඤ්හි ඛණෙ තණ්හං ඨපෙත්වා සෙසං දුක්ඛසච්චං නාම හොතීති සන්ධායෙතං වුත්තං. මග්ගස්ස උප්පාදක්ඛණෙපි එසෙව නයො. තත්ථ පන රූපමෙව දුක්ඛසච්චං නාම. සෙසා මග්ගසම්පයුත්තකා ධම්මා සච්චවිනිමුත්තා. තෙනෙව කාරණෙන “අරූපෙ මග්ගස්ස උප්පාදක්ඛණෙ තෙසං මග්ගසච්චං උප්පජ්ජති, නො ච තෙසං දුක්ඛසච්චං උප්පජ්ජතී”ති වුත්තං. **සබ්බෙසං උපපජ්ජන්තානං පවත්තෙ තණ්හාවිප්පයුත්තචිත්තස්ස උප්පාදක්ඛණෙ තෙසං තත්ථා**ති තෙසං තස්මිං උපපත්තික්ඛණෙ තණ්හාවිප්පයුත්තචිත්තුප්පත්තික්ඛණෙ චාති එවමෙත්ථ ඛණවසෙන ඔකාසො වෙදිතබ්බො. අඤ්ඤෙසුපි එවරූපෙසු එසෙව නයො. **අනභිසමෙතාවීන**න්ති චතුසච්චපටිවෙධසඞ්ඛාතං අභිසමයං අප්පත්තසත්තානං. **අභිසමෙතාවීන**න්ති අභිසමිතසච්චානන්ති. ඉමිනා නයමුඛෙන සබ්බත්ථ අත්ථවිනිච්ඡයො වෙදිතබ්බො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පවත්තිවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙහි පවත්ති වාරයෙහි වනාහි වර්තමාන කාල පුග්ගල වාර අනුලෝම නයෙහි යමෙකුට දුක්ඛ සත්‍යය ඇතිවේද, ඔහුට සමුදය සත්‍යය උපදී. යමෙකුට වනාහි සමුදය සත්‍යය උපදීද ඔහුට දුක්ඛ සත්‍යය උපදී. දුක්ඛ සච්ච මූලකයෙහි තුනකින් සමුදය සත්‍යය මූලකයන් දෙකකින් නිරෝධ සත්‍ය මූලකයෙන් එකකින් ලැබෙන ඒවාද නොලැබෙන ඒවාද ගෙන පෙළ වශයෙන් යමක හයකින් විය යුතුය. ඒවායෙහි නිරෝධයට උප්පාදාය නැත. නිරෝධය නොයෙදේ. එහෙයින් දුක්ඛ සත්‍යමූලක, සමුදය සත්‍ය මාර්ග සත්‍ය සමගින් දෙකක් ද සමුදය සත්‍ය මූලක මාර්ග සත්‍ය සමග එකකැයි යමක තුනක් ආයේය. එහි පටිලෝම නයෙහි ඕකාස වාරාදියෙහි ද මෙම නයම වේ. මෙසේ මෙහි සියළු වාරවල යමක තුන තුන වශයෙන් යමක ගණන දතයුතුය. මෙහි අර්ථ විනිශ්චයෙහි වනාහි මේ ලක්‍ෂණය සච්ච යමකයේ පවත්ති වාරයෙහි නිරෝධ සත්‍ය තවම නොලැබේ. සෙසු ඒවායේ වනාහි සමුදය සච්ච මග්ග සච්චවල එ්කාන්තයෙන් ම පැවතීමම ලබයි. දුක්ඛ සත්‍යය චුතිපටිසන්ධිවල ද පැවතීමේ ද ලබයි. වර්තමානාදි තුන් කාල චුතිපටිසන්ධිවල ද පැවතීම් වශයෙන් ලබයි. මෙසේ මෙහි යමක් ලබයිද ඒ අනුව අර්ථ විනිශ්චය දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "එහි නයමුඛය මෙසේය. **සබ්බෙසං උපපජ්ජන්තානං** යටත් පිරිසෙයින් සුද්ධාවාසවල ද ඔව්හු ද දුක්ඛ සත්‍යයෙන් ම උපදිති. **තණ්හා විප්පයුත්ත චිත්තස්ස** මෙය දුක්ඛ සත්‍යය සමුදය සත්‍යවල එක් කොටසක උත්පත්ති දැක්වීම සඳහා කියන ලදි. එහෙයින් පංචවෝකාර වශයෙන් ගතයුතුය. සතර වෝකාරයෙහි වනාහි තෘෂ්ණා විප්‍රයුක්ත ඵලසමාපත්ති සිතේ උපන් කෙණෙහි එකම සත්‍යකුදු නූපදී. මෙය මෙහි නොගත යුතුය. **තෙසං දුක්ඛසච්චං** එකෙණෙහි තෘෂ්ණාව හැර සෙසු දුක්ඛ සත්‍යය නම් වේයයි සඳහා කියන ලදි. මාර්ගයට ද උපන් කෙණෙහි මෙම නය වේ. එහි වනාහි රූපයම දුක්ඛ සත්‍ය වේ. සෙසු මාර්ග සම්ප්‍රයුක්ත ධර්ම සත්‍යය විනිර්මුක්තය. ඒ කාරණයෙන්ම **ආරුප්පෙ මග්ගස්ස උප්පාදක්ඛණෙ තෙසං මග්ගසච්චං උප්පජ්ජති, නො ච තෙසං දුක්ඛ සච්චං උප්පජ්ජතීති වුත්තං, සබ්බෙසං උපපජ්ජන්තානං පවත්තෙ තණ්හා විප්පයුත්ත චිත්තස්ස උප්පාදක්ඛණෙ තෙසං තත්‍ථ** ඔවුන්ගේ උපන් ක්‍ෂණයෙහි තෘෂ්ණා විප්‍රයුක්ත සිත උපන් කෙණෙහිම මෙසේ මෙහි ක්‍ෂණ වශයෙන් දතයුතුය. මෙබඳු ස්වරූප වූ වෙන තැන්වලද මෙම නයම වේ. **අනභිසමෙතාවීනං** චතුස්සත්‍ය ප්‍රතිවෙධ සංඛ්‍යාත අභිසමයට නොපත් සත්ත්වයන්ගේ. **අභිසමෙතාවීනං** අවබෝධ කළ සත්‍යය. මෙම නය මුඛයෙන් සියළු තැන අර්ථ විනිශ්චය දතයුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 39,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "පවත්තිවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරිඤ්ඤාවාරවණ්ණනා",
                        "level": 1,
                        "keyOffset": 6
                    },
                    {
                        "type": "paragraph",
                        "text": "පරිඤ්ඤාවාරෙ පන ඤාතපරිඤ්ඤා, තීරණපරිඤ්ඤා, පහානපරිඤ්ඤාති තිස්සොපෙත්ථ පරිඤ්ඤායො ලබ්භන්ති. යස්මා ච ලොකුත්තරධම්මෙසු පරිඤ්ඤා නාම නත්ථි; තස්මා ඉධ ද්වෙ සච්චානි ගහිතානි. තත්ථ **දුක්ඛසච්චං පරිජානාතී**ති ඤාතතීරණපරිඤ්ඤාවසෙනෙව වුත්තං. **සමුදයසච්චං පජහතී**ති ඤාතපහානපරිඤ්ඤාවසෙන. ඉති ඉමාසං පරිඤ්ඤානං වසෙන සබ්බපදෙසු අත්ථො වෙදිතබ්බොති."
                    },
                    {
                        "type": "centered",
                        "text": "පරිඤ්ඤාවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "සච්චයමකවණ්ණනා නිට්ඨිතා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "6. සඞ්ඛාරයමකං",
                        "level": 4
                    },
                    {
                        "type": "heading",
                        "text": "පණ්ණත්තිවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදානි තෙසඤ්ඤෙව මූලයමකෙ දෙසිතානං කුසලාදිධම්මානං ලබ්භමානවසෙන එකදෙසං සඞ්ගණ්හිත්වා සච්චයමකානන්තරං දෙසිතස්ස සඞ්ඛාරයමකස්ස වණ්ණනා හොති. තත්ථාපි හෙට්ඨා වුත්තනයෙනෙව පණ්ණත්තිවාරාදයො තයො මහාවාරා, අන්තරවාරාදයො ච අවසෙසපභෙදා වෙදිතබ්බා. අයං පනෙත්ථ විසෙසො – පණ්ණත්තිවාරෙ තාව යථා හෙට්ඨා ඛන්ධාදයො ධම්මෙ උද්දිසිත්වා “රූපං රූපක්ඛන්ධො; චක්ඛු චක්ඛායතනං; චක්ඛු චක්ඛුධාතු; දුක්ඛං දුක්ඛසච්ච”න්ති පදසොධනවාරො ආරද්ධො. තථා අනාරභිත්වා “අස්සාසපස්සාසා කායසඞ්ඛාරො”ති පඨමං තයොපි සඞ්ඛාරා විභජිත්වා දස්සිතා."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ථ කායස්ස සඞ්ඛාරො **කායසඞ්ඛාරො**. “අස්සාසපස්සාසා කායිකා, එතෙ ධම්මා කායප්පටිබද්ධා”ති (ම· නි· 1.463; සං· නි· 4.348 අත්ථතො සමානං) හි වචනතො කාරණභූතස්ස කරජකායස්ස ඵලභූතො එව සඞ්ඛාරොති කායසඞ්ඛාරො. අපරො නයො – සඞ්ඛරියතීති සඞ්ඛාරො. කෙන සඞ්ඛරියතීති? කායෙන. අයඤ්හි වාතො විය භස්තාය කරජකායෙන සඞ්ඛරියතීති. එවම්පි කායස්ස සඞ්ඛාරොති කායසඞ්ඛාරො. කායෙන කතො අස්සාසපස්සාසවාතොති අත්ථො. “පුබ්බෙව ඛො, ආවුසො විසාඛ, විතක්කෙත්වා විචාරෙත්වා පච්ඡා වාචං භින්දති, තස්මා විතක්කවිචාරා වචීසඞ්ඛාරො”ති (ම· නි· 1.463; සං· නි· 4.348) වචනතො පන සඞ්ඛරොතීති සඞ්ඛාරො. කිං සඞ්ඛරොති? වචිං. වචියා සඞ්ඛාරොති **වචීසඞ්ඛාරො**. වචීභෙදසමුට්ඨාපකස්ස විතක්කවිචාරද්වයස්සෙතං නාමං. “සඤ්ඤා ච වෙදනා ච චෙතසිකා එතෙ ධම්මා චිත්තපටිබද්ධා”ති (ම· නි· 1.463; සං· නි· 4.348) වචනතොයෙව පන තතියපදෙපි සඞ්ඛරියතීති සඞ්ඛාරො. කෙන සඞ්ඛරියති? චිත්තෙන. කරණත්ථෙ සාමිවචනං කත්වා චිත්තස්ස සඞ්ඛාරොති **චිත්තසඞ්ඛාරො**. සබ්බෙසම්පි චිත්තසමුට්ඨානානං චෙතසිකධම්මානමෙතං අධිවචනං. විතක්කවිචාරානං පන වචීසඞ්ඛාරභාවෙන විසුං ගහිතත්තා “ඨපෙත්වා විතක්කවිචාරෙ”ති වුත්තං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරිඤ්ඤාවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "පරිඤ්ඤා වාරයෙහි වනාහි ඤාත පරිඤ්ඤා, තීරණ පරිඤ්ඤා, පහාන පරිඤ්ඤා යයි මෙහි පරිඤ්ඤා තුනක් ලබයි. ලෝකෝත්තර ධර්මවල පරිඤ්ඤා නම් නැත. එහෙයින් මෙහි සත්‍ය දෙකක් ගන්නා ලදි. එහි **දුක්ඛ සච්චං පරිජානාති** ඤාත තීරණ පරිඤ්ඤා වශයෙන් කියන ලදි. **සමුදය සච්චං පජහති** ඤාත පහාන පරිඤ්ඤා වශයෙනි. මෙසේ මේ පරිඤ්ඤා වශයෙන් සියළු පදවල අර්ථය දතයුතුය."
                    },
                    {
                        "type": "centered",
                        "text": "",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "සච්ච යමක වර්ණනාව නිමි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "6. සංඛාර යමක වර්ණනාව",
                        "level": 4
                    },
                    {
                        "type": "heading",
                        "text": "පණ්ණත්තිවාර වර්ණනාව",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දැන් ඒ මූල යමකයෙහි ම දේශිත කුසලාදි ධර්මයන්ගේ ලැබීම් වශයෙන් ඒක දේශයක් සංග්‍රහකොට සච්ච යමකට අනතුරුව දේශනා කළ සංඛාර යමක වර්ණනාව වේ. එහි ද යට කියන ලද නයින්ම පණ්ණත්තිවාරාදි මහාවාර තුණ ද අන්තර වාරාදිය ද අවසේස ප්‍රභේද ද දතයුතුය. මෙය එහි විශේෂයකි. පණ්ණත්තිවාරයෙහි පළමුව යට යම්සේ ඛන්‍ධාදි ධර්ම උද්දේස කොට, **රූපං රූපක්ඛන්‍ධො, චක්ඛු චක්ඛායතනං, චක්ඛු චක්ඛුධාතු, දුක්ඛං දුක්ඛසච්චං **යයි පදසෝධන වාරය ආරම්භ කරන ලදි. එසේ ආරම්භ නොකොට **අස්සාසපස්සායා කාය සංඛාරො** යයි පළමුව සංඛාර තුනම බෙදා දක්වන ලදි."
                    },
                    {
                        "type": "paragraph",
                        "text": "එහි කයේ සංඛාර කාය සංඛාර වේ. ආශ්වාස ප්‍රශ්වාස කායිකය. මේ ධර්ම කාය හා ප්‍රතිබද්ධ යයි වචන හෙයින් හේතු වූ කරජකායේ ඵල වූයේ සංඛාර යයි කාය සංඛාර වේ. තවද ක්‍රමයක්:- රැස් කෙරේය යනු සංඛාර වේ. කුමකින් රැස් කෙරේද? කයින්. මෙය භස්ත්‍රාවෙන් වායුව මෙන් කරජකයින් සංචේරීයති. මෙසේද කයේ සංඛාර කාය සංඛාර වේ. කයින් කළ ආශ්වාස ප්‍රශ්වාස වාතය යන අර්ථයයි. ඇවැත්නි විසාඛ, පෙරම විතර්ක කොට විචාරා පසුව වචනය බිඳී. එහෙයින් විතක්ක විචාර වචී සංඛාර යයි වචන හෙයින් සංඛාර යයි සංඛාර වේ. කුමක් පිළියෙල කරයිද? වචනය. වචනයෙන් පිළියෙල කෙරේ යනු වචීසංඛාර වේ. වචීභේදයෙන් හටගත් විතක්ක විචාර දෙකට මෙය නමකි. සඤ්ඤාවච චේතනාවද තෛසික වේ. මේ ධර්ම චිත්ත ප්‍රතිබද්ධ වේයයි වචනයෙන්ම වනාහි තුන්වන පදයෙහිද සංස්කරණය කෙරේනුයි සංඛාර වේ. කුමකින් සංස්කරණය කෙරේද? සිතින්. කරණාර්ථයෙනි. සාමි (ඡට්ඨි) වචනය කොට සිතේ සංඛාර චිත්ත සංඛාර වේ. සිතෙන් හටගන්නා සියළුම චෛතසික ධර්මවලට මෙය පර්යාය වචනයකි. විතක්ක විචාර වනාහි වචීසංඛාර භාවයෙන් වෙනම ගත් බැවින් විතර්කය හැර විචාරයෙහි යයි කියන ලදි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 41,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉදානි **කායො කායසඞ්ඛාරො**ති පදසොධනවාරො ආරද්ධො. තස්ස අනුලොමනයෙ තීණි, පටිලොමනයෙ තීණීති ඡ යමකානි. පදසොධනමූලචක්කවාරෙ එකෙකසඞ්ඛාරමූලකානි ද්වෙ ද්වෙ කත්වා අනුලොමනයෙ ඡ, පටිලොමනයෙ ඡාති ද්වාදස යමකානි. සුද්ධසඞ්ඛාරවාරෙ පන යථා සුද්ධඛන්ධවාරාදීසු “රූපං ඛන්ධො, ඛන්ධා රූපං; චක්ඛු ආයතනං, ආයතනා චක්ඛූ”තිආදිනා නයෙන යමකානි වුත්තානි. එවං “කායො සඞ්ඛාරො, සඞ්ඛාරා කායො”ති අවත්වා “කායසඞ්ඛාරො වචීසඞ්ඛාරො, වචීසඞ්ඛාරො කායසඞ්ඛාරො”තිආදිනා නයෙන කායසඞ්ඛාරමූලකානි ද්වෙ, වචීසඞ්ඛාරමූලකං එකන්ති අනුලොමෙ තීණි, පටිලොමෙ තීණීති සබ්බානිපි සුද්ධිකවාරෙ ඡ යමකානි වුත්තානි. කිං කාරණා? සුද්ධිකඑකෙකපදවසෙන අත්ථාභාවතො. යථා හි ඛන්ධයමකාදීසු රූපාදිවිසිට්ඨානං ඛන්ධානං චක්ඛාදිවිසිට්ඨානඤ්ච ආයතනාදීනං අධිප්පෙතත්තා “රූපං ඛන්ධො , ඛන්ධා රූපං, චක්ඛු ආයතනං, ආයතනා චක්ඛූ”ති සුද්ධිකඑකෙකපදවසෙන අත්ථො අත්ථි. එවමිධ “කායො සඞ්ඛාරො, සඞ්ඛාරා කායො”ති නත්ථි. කායසඞ්ඛාරොති පන ද්වීහිපි පදෙහි එකොව අත්ථො ලබ්භති. අස්සාසො වා පස්සාසො වාති සුද්ධිකඑකෙකපදවසෙන අත්ථාභාවතො “කායො සඞ්ඛාරො, සඞ්ඛාරා කායො”ති න වුත්තං. “කායො කායසඞ්ඛාරො”තිආදි පන වත්තබ්බං සියා. තම්පි කායවචීචිත්තපදෙහි ඉධ අධිප්පෙතානං සඞ්ඛාරානං අග්ගහිතත්තා න යුජ්ජති. සුද්ධසඞ්ඛාරවාරො හෙස. පදසොධනෙ පන විනාපි අත්ථෙන වචනං යුජ්ජතීති තත්ථ සො නයො ගහිතොව. ඉධ පන කායසඞ්ඛාරස්ස වචීසඞ්ඛාරාදීහි, වචීසඞ්ඛාරස්ස ච චිත්තසඞ්ඛාරාදීහි, චිත්තසඞ්ඛාරස්ස ච කායසඞ්ඛාරාදීහි, අඤ්ඤත්තා “කායසඞ්ඛාරො වචීසඞ්ඛාරො, වචීසඞ්ඛාරො, කායසඞ්ඛාරො”ති එකෙකසඞ්ඛාරමූලකානි ද්වෙ ද්වෙ කත්වා ඡ යමකානි යුජ්ජන්ති. තෙසු අග්ගහිතග්ගහණෙන තීණෙව ලබ්භන්ති. තස්මා තානෙව දස්සෙතුං අනුලොමනයෙ තීණි, පටිලොමනයෙ තීණීති ඡ යමකානි වුත්තානි. සුද්ධසඞ්ඛාරමූලචක්කවාරො පනෙත්ථ න ගහිතොති. එවං පණ්ණත්තිවාරස්ස උද්දෙසවාරො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "නිද්දෙසවාරෙ පනස්ස අනුලොමෙ තාව යස්මා න කායාදයොව කායසඞ්ඛාරාදීනං නාමං, තස්මා **නො**ති පටිසෙධො කතො. පටිලොමෙ **න කායො න කායසඞ්ඛාරො**ති යො න කායො සො කායසඞ්ඛාරොපි න හොතීති පුච්ඡති. **කායසඞ්ඛාරො න කායො කායසඞ්ඛාරො**ති කායසඞ්ඛාරො කායො න හොති, කායසඞ්ඛාරොයෙව පනෙසොති අත්ථො. **අවසෙස**න්ති න කෙවලං සෙසසඞ්ඛාරද්වයමෙව. කායසඞ්ඛාරවිනිමුත්තං පන සෙසං සබ්බම්පි සඞ්ඛතාසඞ්ඛතපණ්ණත්තිභෙදං ධම්මජාතං නෙව කායො, න කායසඞ්ඛාරොති ඉමිනා උපායෙන සබ්බවිස්සජ්ජනෙසු අත්ථො වෙදිතබ්බොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "දැන් **කායො කායසංඛාරො** යයි පදසොධනවාරය අරඹන ලදි. එහි අනුලෝම නයෙහි තුනකි. පටිලෝම නයෙහි තුනක් යයි යමක සයකි. පදසෝධන මූලචක්ක වාරයෙහි එක එක සංඛාර මූලකවල දෙක දෙක කොට අනුලෝම නයෙහි සයකි. පටිලෝම නයෙහි සය යයි යමක දොළොසක් වේ. සුද්ධ සංඛාර වාරයෙහි වනාහි සුද්ධ ඛන්‍ධවාරාදියෙහි මෙන් ‘රූපං ඛන්‍ධො ඛන්‍ධා රූපං චක්ඛු ආයතනං ආයතනා චක්ඛු’ යනාදි නයින් යමක කියන ලදි. මෙසේ කායො සංඛාරො, සංඛාරො කායො යයි නොකියා **කාය සංඛාරො වචී සංඛාරො වචී සංඛාරො කාය සංඛාරො** යනාදි නයින් කාය සංඛාර මූලක දෙකකි. වචීසංඛාර මූලක එකක් යයි අනුලෝමයේ තුනකි. පටිලෝමයේ තුනක් යයි සුද්ධික වාරයෙහි සියල්ල යමක හයක් කියන ලදි. කුමක් නිසාද? සුද්ධික එක් එක් පද වශයෙන් අර්ථ අභාවයෙන් ඛන්‍ධ යමකාදියෙහි මෙන් රූපාදි විශිෂ්ඨ ස්කන්ධයන්ගේ චක්ඛු ආදි විශිෂ්ඨ ආයතන ආදීන්ගේ අභිප්‍රේත බැවින් **රූපං ඛන්‍ධො ඛන්‍ධා රූපං චක්ඛු ආයතනං ආයතනා චක්ඛු **යයි සුද්ධික එක් එක් පද වශයෙන් අර්ථ ඇත. එසේම මෙහි කායො සංඛාරො, සංඛාරො කායො නැත. කාය සංඛාරො යයි පද දෙකම එක් අර්ථයක් ලබයි. ආශ්වාස හෝ ප්‍රශ්වාසය හෝ යයි සුද්ධික එක එක පද වශයෙන් අර්ථය අභාවයෙන් කායො සංඛාරො සංඛාරො කායො යයි නොකියන ලදි. කායො කායො සංඛාරො යයි ආදිය වනාහි කිවයුතු වන්නේ ය. එය ද කාය වචී චිත්ත පදවලින් මෙහි අදහස් වන සංඛාරයන්ගේ නො ගන්නා ලද බැවින් නොයෙදේ. මෙය සුද්ධ සංඛාරවාරය වේ. පදසෝධනයෙහි වනාහි අර්ථය හැර වචන යෙදේ යයි එහි ඒ නය ගන්නා ලදි. මෙහි වනාහි කාය සංඛාරයට වචී සංඛාරාදියෙන් වචී සංඛාරයට චිත්ත සංඛාරාදියෙන් චිත්ත සංඛාරයට කාය සංඛාරාදියෙන් අනිකක් බැවින් කාය සංඛාර වචී සංඛාර, වචී සංඛාර කාය සංඛාර යයි එක් එක් සංඛාර මූලකවල දෙක බැගින් යමක හයක් යෙදේ. ඒවායේ අගහිත ගහණයෙන් තුනක්ම ලැබේ. එහෙයින් ඒවාම දැක්වීමට අනුලෝම නයෙහි තුනක් ද පටිලෝම නයෙහි තුනක්දැයි යමක හයක් කියන ලදි. සුද්ධ සංඛාර මූලචක්කවාරය වනාහි නොගන්නා ලදි. මෙසේ පණ්ණත්ති වාරයේ උද්දේසවාරය දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙහි නිද්දේස වාරයෙහි වනාහි පළමුව අනුලෝමයෙහි යම්හෙයකින් කායාදිය කාය සංඛාරාදිය නම් නොවේ. එහෙයින් **නො** යයි ප්‍රතිසේධ කරන ලදි. පටිලෝමයෙහි **න කායො න කාය සංඛාරො** යයි යමක් කාය නොවේද, එය කාය සංඛාර නොවේදැයි අසයි. **කාය සංඛාරො නකායො කාය සංඛාරො** යයි කාය සංඛාර කාය නොවේ. එය කාය සංඛාරම වේයයි අර්ථය වේ. **අවසෙසං **හුදෙක් සෙසු සංඛාර දෙක නොවේ. කාය සංඛාර විනිර්මුක්තය වනාහි සෙසු සියළු සංඛත සංඛත පණ්ණත්ති භේද ධර්මජාතය කාය නොවේ. කාය සංඛාර නොවේ යයි මේ උපායෙන් සියළු විසඳුම්වල අර්ථය දතයුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 43,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "පණ්ණත්තිවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පවත්තිවාරවණ්ණනා",
                        "level": 1,
                        "keyOffset": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "පවත්තිවාරෙ පනෙත්ථ පච්චුප්පන්නකාලෙ පුග්ගලවාරස්ස අනුලොමනයෙ “යස්ස කායසඞ්ඛාරො උප්පජ්ජති, තස්ස වචීසඞ්ඛාරො උප්පජ්ජතී”ති කායසඞ්ඛාරමූලකානි ද්වෙ, වචීසඞ්ඛාරමූලකං එකන්ති තීණෙව යමකානි ලබ්භන්ති; තානි ගහිතානෙව. තස්ස පටිලොමනයෙපි ඔකාසවාරාදීසුපි එසෙව නයො. එවමෙත්ථ සබ්බවාරෙසු තිණ්ණං තිණ්ණං යමකානං වසෙන යමකගණනා වෙදිතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථවිනිච්ඡයෙ පනෙත්ථ ඉදං ලක්ඛණං – ඉමස්මිඤ්හි සඞ්ඛාරයමකෙ “අස්සාසපස්සාසානං උප්පාදක්ඛණෙ විතක්කවිචාරානං උප්පාදක්ඛණෙ”තිආදිවචනතො පච්චුප්පන්නාදිකාලභෙදො පවත්තිවසෙනාපි ගහෙතබ්බො, න චුතිපටිසන්ධිවසෙනෙව. “දුතියජ්ඣානෙ තතියජ්ඣානෙ තත්ථ කායසඞ්ඛාරො උප්පජ්ජතී”තිආදිවචනතො ච ඣානම්පි ඔකාසවසෙන ගහිතන්ති වෙදිතබ්බං. එවමෙත්ථ යං යං ලබ්භති, තස්ස තස්ස වසෙන අත්ථවිනිච්ඡයො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්රිදං නයමුඛං – **විනා විතක්කවිචාරෙහී**ති දුතියතතියජ්ඣානවසෙන වුත්තං. **තෙස**න්ති තෙසං දුතියතතියජ්ඣානසමඞ්ගීනං. **කාමාවචරාන**න්ති කාමාවචරෙ උප්පන්නසත්තානං. රූපාවචරදෙවානං පන අස්සාසපස්සාසා නත්ථි. අරූපාවචරානං රූපමෙව නත්ථි. **විනා අස්සාසපස්සාසෙහී**ති රූපාරූපභවෙසු නිබ්බත්තසත්තානං විතක්කවිචාරුප්පත්තිං සන්ධාය වුත්තං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පඨමජ්ඣානෙ කාමාවචරෙ**ති කාමාවචරභූමියං උප්පන්නෙ පඨමජ්ඣානෙ. අඞ්ගමත්තවසෙන චෙත්ථ පඨමජ්ඣානං ගහෙතබ්බං, න අප්පනාවසෙනෙව. අනප්පනාපත්තෙපි හි සවිතක්කසවිචාරචිත්තෙ ඉදං සඞ්ඛාරද්වයං උප්පජ්ජතෙව."
                    },
                    {
                        "type": "paragraph",
                        "text": "**චිත්තස්ස භඞ්ගක්ඛණෙ**ති ඉදං කායසඞ්ඛාරස්ස එකන්තචිත්තසමුට්ඨානත්තා වුත්තං. උප්පජ්ජමානමෙව හි චිත්තං රූපං වා අරූපං වා සමුට්ඨාපෙති, න භිජ්ජමානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සුද්ධාවාසානං දුතියෙ චිත්තෙ වත්තමානෙ**ති පටිසන්ධිතො දුතියෙ භවඞ්ගචිත්තෙ. කාමඤ්චෙතං පටිසන්ධිචිත්තෙපි වත්තමානෙ තෙසං තත්ථ නුප්පජ්ජිත්ථෙව. යාව පන අබ්බොකිණ්ණං විපාකචිත්තං වත්තති, තාව නුප්පජ්ජිත්ථෙව නාමාති දස්සනත්ථමෙතං වුත්තං. යස්ස වා ඣානස්ස විපාකචිත්තෙන තෙ නිබ්බත්තා, තං සතසොපි සහස්සසොපි උප්පජ්ජමානං පඨමචිත්තමෙව. විපාකචිත්තෙන පන විසදිසං භවනිකන්තියා ආවජ්ජනචිත්තං දුතියචිත්තං නාම. තං සන්ධායෙතං වුත්තන්ති වෙදිතබ්බං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "පණ්ණත්තිවාර වර්ණනාව නිමි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පවත්තිවාර වර්ණනාව",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙහි පවත්ති වාරයෙහි වනාහි වර්තමාන කාල පුග්ගවාර අනුලෝම නයෙහි **යස්ස කාය සංඛාරො උප්පජ්ජති තස්ස වචී සංඛාරො උප්පජ්ජති** යයි කාය සංඛාර මූලක දෙකකි. වචීසංඛාර මූලක එකකැයි යමක තුනක් ලබයි. ඒවා ගන්නා ලදි. එහි පටිලෝම නයෙහි ඔකාසවාරාදියෙහි ද මෙම නයම වේ. මෙසේ මෙහි සියළු වාරවල යමක තුන තුන වශයෙන් යමක ගණන දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙහි අර්ථ විනිශ්චයෙහි වනාහි මේ ලක්‍ෂණය වේ. මේ සංඛාර යමකයෙහි **අස්සාස පස්සාසානං උප්පාදක්ඛණෙ විතක්ක විචාරානං උප්පාදක්ඛණෙ** යනාදි වචනයෙන් වර්තමාන ආදි කාලභේදය පැවතීම් වශයෙන් ද ගතයුතුය. චුති පටිසන්ධි වශයෙන් නොවේ. **දුතියජ්ඣානෙ තතියජ්ඣානෙ තත්‍ථ කාය සංඛාරො උප්පජ්ජති** ආදි වචන බැවින් ද ධ්‍යාන ද ඔකාස වශයෙන් ගන්නා ලදැයි දතයුතුය. මෙසේ මෙහි යමක් ලබාද ඒ ඒ වශයෙන් අර්ථ විනිශ්චය දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "එහි නය මුඛය මෙසේය:- **විනා විතක්ක විචාරෙහි** දුතිය තතියජ්ඣාන වශයෙන් කියන ලදි. **තෙසං** ඒ දුතිය තතියජ්ඣාන සමග **කාමාවචරානං** යයි කාමාවචරයෙහි උපන් සත්ත්වයන්ගේ. රූපාවචර දෙවියන්ගේ වනාහි ආශ්වාස ප්‍රශ්වාස නැත. අරූපාවචරයන්ගේ රූපයම නැත. **විනා අස්සාස පස්සාසෙහි** යයි රූප අරූප භවවල උපන් සතුන්ගේ විතක්ක විචාර ඉපදීම සඳහා කියන ලදි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පඨමජ්ඣානෙ කාමාවචරෙ** යයි කාමාවචර භූමියෙහි උපන් ප්‍රථම ධ්‍යානයෙහි. මෙහි අංග පමණක් ප්‍රථමධ්‍යානය ගත යුතුය. අර්පණා වශයෙන් නොවේ. අර්පණාවට නොපැමිණියහු විසින්ද සවිතක්ක සවිචාර සිතේ මෙ සංඛාර දෙක උපදවනු ලැබේමය."
                    },
                    {
                        "type": "paragraph",
                        "text": "**චිත්තස්ස භංගක්ඛණෙ** යන මේ කාය සංඛාර ඒකාන්ත චිත්ත සමුට්ඨානය බැවින් කියන ලද සිත උපදින්නේ, රූපය හෝ අරූපය හෝ උපදවයි. බිඳෙමින් නොවේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සුද්ධාවාසානං දුතියෙ චිත්තෙ වත්තමානෙ** පටිසන්ධියෙන් දෙවන භවාංග සිතේ මෙය ඒකාන්තයෙන් පටිසන්ධි සිත ද පවතින කල්හි එහි නූපදියි. යම්තාක් අමිශ්‍ර විපාක සිත පවතීද ඒතාක් නූපදින්නේ නමැයි දැක්වීම සඳහා මෙය කියන ලදි. යම් ධ්‍යානයක විපාක සිතින් ඔව්හු ඉපදුනහ. එය සියයකින් ද දහසකින් ද ඉපදෙන්නේ පළමු සිතමය. විපාක සිතින් වනාහි විසදෘෂ වූ භව ආශාවෙන් ආවර්ජන සිත දෙවන සිත නම් වේ. එය සඳහා කියන ලදැයි දතයුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 45,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**පච්ඡිමචිත්තසමඞ්ගීන**න්ති සබ්බපච්ඡිමෙන අප්පටිසන්ධිකචිත්තෙන සමඞ්ගීභූතානං ඛීණාසවානං. **අවිතක්කඅවිචාරං පච්ඡිමචිත්ත**න්ති රූපාවචරානං දුතියජ්ඣානිකාදිචුතිචිත්තවසෙන, අරූපාවචරානඤ්ච චතුත්ථජ්ඣානිකචුතිචිත්තවසෙනෙතං වුත්තං. **තෙස**න්ති තෙසං පච්ඡිමචිත්තසමඞ්ගීආදීනං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යස්ස කායසඞ්ඛාරො නිරුජ්ඣති, තස්ස චිත්තසඞ්ඛාරො නිරුජ්ඣතී**ති එත්ථ නියමතො කායසඞ්ඛාරස්ස චිත්තසඞ්ඛාරෙන සද්ධිං එකක්ඛණෙ නිරුජ්ඣනතො ආමන්තාති පටිවචනං දින්නං. න චිත්තසඞ්ඛාරස්ස කායසඞ්ඛාරෙන සද්ධිං. කිං කාරණා? චිත්තසඞ්ඛාරො හි කායසඞ්ඛාරෙන විනාපි උප්පජ්ජති ච නිරුජ්ඣති ච. කායසඞ්ඛාරො පන චිත්තසමුට්ඨානො අස්සාසපස්සාසවාතො. චිත්තසමුට්ඨානරූපඤ්ච චිත්තස්ස උප්පාදක්ඛණෙ උප්පජ්ජිත්වා යාව අඤ්ඤානි සොළසචිත්තානි උප්පජ්ජන්ති, තාව තිට්ඨති. තෙසං සොළසන්නං සබ්බපච්ඡිමෙන සද්ධිං නිරුජ්ඣතීති යෙන චිත්තෙන සද්ධිං උප්පජ්ජති, තතො පට්ඨාය සත්තරසමෙන සද්ධිං නිරුජ්ඣති. න කස්සචි චිත්තස්ස උප්පාදක්ඛණෙ වා ඨිතික්ඛණෙ වා නිරුජ්ඣති, නාපි ඨිතික්ඛණෙ වා භඞ්ගක්ඛණෙ වා උප්පජ්ජති. එසා චිත්තසමුට්ඨානරූපස්ස ධම්මතාති නියමතො චිත්තසඞ්ඛාරෙන සද්ධිං එකක්ඛණෙ නිරුජ්ඣනතො ආමන්තාති වුත්තං. යං පන විභඞ්ගප්පකරණස්ස සීහළට්ඨකථායං “චිත්තසමුට්ඨානං රූපං සත්තරසමස්ස චිත්තස්ස උප්පාදක්ඛණෙ නිරුජ්ඣතී”ති වුත්තං, තං ඉමාය පාළියා විරූජ්ඣති. අට්ඨකථාතො ච පාළියෙව බලවතරාති පාළියං වුත්තමෙව පමාණං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යස්ස කායසඞ්ඛාරො උප්පජ්ජති, තස්ස වචීසඞ්ඛාරො නිරුජ්ඣතී**ති එත්ථ යස්මා කායසඞ්ඛාරො චිත්තස්ස උප්පාදක්ඛණෙ උප්පජ්ජති, න ච තස්මිං ඛණෙ විතක්කවිචාරා නිරුජ්ඣන්ති, තස්මා නොති පටිසෙධො කතොති. ඉමිනා නයමුඛෙන සබ්බත්ථ අත්ථවිනිච්ඡයො වෙදිතබ්බො. පරිඤ්ඤාවාරො පාකතිකොයෙවාති."
                    },
                    {
                        "type": "centered",
                        "text": "පවත්තිවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "සඞ්ඛාරයමකවණ්ණනා නිට්ඨිතා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "7. අනුසයයමකං",
                        "level": 4
                    },
                    {
                        "type": "heading",
                        "text": "පරිච්ඡෙදපරිච්ඡින්නුද්දෙසවාරවණ්ණනා",
                        "level": 1,
                        "keyOffset": 0
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදානි තෙසඤ්ඤෙව මූලයමකෙ දෙසිතානං කුසලාදිධම්මානං ලබ්භමානවසෙන එකදෙසං සඞ්ගණ්හිත්වා සඞ්ඛාරයමකානන්තරං දෙසිතස්ස අනුසයයමකස්ස අත්ථවණ්ණනා හොති. තත්ථ පාළිවවත්ථානං තාව වෙදිතබ්බං – ඉමස්මිඤ්හි අනුසයයමකෙ ඛන්ධයමකාදීසු විය දෙසනං අකත්වා අඤ්ඤෙන නයෙන පාළිදෙසනා කතා. කථං? පඨමං තාව පරිච්ඡෙදතො, උද්දෙසතො, උප්පත්තිට්ඨානතොති තීහාකාරෙහි අනුසයෙ ගහාපෙතුං පරිච්ඡෙදවාරො, පරිච්ඡින්නුද්දෙසවාරො, උප්පත්තිට්ඨානවාරොති, තයො වාරා දෙසිතා. තතො සත්තන්නං මහාවාරානං වසෙන අනුසයෙ යොජෙත්වා යමකදෙසනා කතා. තත්ථ** සත්තානුසයාති** අයං “සත්තෙව, න තතො උද්ධං, න හෙට්ඨා”ති ගණනපරිච්ඡෙදෙන පරිච්ඡින්දිත්වා අනුසයානං දෙසිතත්තා පරිච්ඡෙදවාරො නාම. **කාමරාගානුසයො…පෙ… අවිජ්ජානුසයො**ති අයං පරිච්ඡෙදවාරෙන පරිච්ඡින්නානං නාමමත්තං උද්දිසිත්වා “ඉමෙ නාම තෙ”ති දෙසිතත්තා පරිච්ඡින්නුද්දෙසවාරො නාම. **කත්ථ කාමරාගානුසයො අනුසෙති…පෙ… එත්ථ අවිජ්ජානුසයො අනුසෙතී**ති අයං “ඉමෙසු නාම ඨානෙසු ඉමෙ අනුසයා අනුසෙන්ති”ති එවං තෙසංයෙව උප්පත්තිට්ඨානස්ස දෙසිතත්තා උප්පත්තිට්ඨානවාරො නාම."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**පච්ඡිමචිත්ත සමංගිනං** සියල්ලටම පසුව පටිසන්ධි නොවුන සිතින් යුක්ත වූ ක්‍ෂීණාශ්‍රවයන්ගේ. **අවිතක්ක අවිචාර පච්ඡිම චිත්තං** රූපාවචර ද්විතීය ධ්‍යානිකාදී චුති සිත වශයෙන් අරූපාවචරයින්ගේ චතුර්ථධ්‍යානික චුති සිත වශයෙන් මෙය කියන ලදි. **තෙසං** ඒ පශ්චිම සිතෙන් යුක්ත වූවන්ගේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යස්ස කාය සංඛාරො නිරුජ්ඣති තස්ස චිත්ත** **සංඛාරො** **නිරුජ්ඣති** මෙහි නියමයෙන් කාය සංඛාරයේ චිත්ත සංඛාරය සමග එක් ක්‍ෂණයෙහි නිරුද්ධ වීමෙන්. **ආමන්තා** යයි ප්‍රතිවචන දෙන ලදි. චිත්ත සංඛාරය කාය සංඛාරය සමග නිරුද්ධ නොවේ. කුමක් නිසාද? චිත්ත සංඛාරය වනාහි කාය සංඛාරය නැතුවද උපදී. නිරුද්ධ වේ. කාය සංඛාරය වනාහි සිතෙන් උපදවන ආශ්වාස ප්‍රශ්වාස වාතයෙන් යුක්ත වේ. චිත්ත සමුට්ඨාන රූප ද සිත උපදිනවිට ඉපදී අන් සොළොස් සිත් ඉපදෙන තුරු සිටී. ඒ සොළොස් සිත්වල සියල්ලට පසු සිත සමග නිරුද්ධ වේ. යම් සිතක් සම උපදීද එතැන් පටන් දාහත්වන සිත සමග නිරුද්ධ වේ. කිසි සිතක උප්පාද ක්‍ෂණයෙහි හෝ ඨිති ක්‍ෂණයෙහි නිරුද්ධ නොවේ. ඨිති ක්‍ෂණයෙහි හෝ භංග ක්‍ෂණයෙහි හෝ නූපදී. මෙය චිත්ත සමුට්ඨානික රූපවල ධර්මතාවයයි නියමයෙන් චිත්ත සංඛාර සමග ඒක ක්‍ෂණයෙහි නිරුද්ධවීමෙන් **ආමත්තා** යයි කියන ලදි. යම්සේ විභංගප්පකරණයේ සිංහල අටුවා කථාවෙහි සිතින් උපදවන රූප (චිත්ත සමුට්ඨානන රූප) දාහතරවන සිතේ උප්පාද ක්‍ෂණයෙහි නිරුද්ධ වේයයි කියන ලදි. එය මේ පෙළට විරුද්ධය. අටුවාවෙන් ද පෙළම බලවත් යයි පෙළෙහි කියන ලදමය. ප්‍රමාණ වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්ස කාය සංඛාරො උප්පජ්ජති තස්ස වචී සංඛාරො නිරුජ්ඣති මෙහි යම්හෙයකින් කාය සංඛාරය සිතේ උප්පාද ක්‍ෂණයෙහි උපදී. ඒ ක්‍ෂණයෙහි විතක්ක විචාර නිරුද්ධ නොවේ. එහෙයින් **නො** යයි ප්‍රතිසේධය කරන ලදි. මේ නය මුඛයෙන් සියළු තැන අර්ථ විනිශ්චය දතයුතුය. පරිඤ්ඤා වාරය මුලින් කියන ලද්ද සේය."
                    },
                    {
                        "type": "centered",
                        "text": "",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "සංඛාර යමක වර්ණනාව නිමි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "7. අනුසය යමක වර්ණනාව",
                        "level": 4
                    },
                    {
                        "type": "heading",
                        "text": "පරිච්ඡෙදපරිච්ඡින්නුද්දෙසවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දැන් ඒ මූල යමකයෙහි දේශනා කරන ලද කුසලාදි ධර්මයන්ගේ ලැබීම් වශයෙන් ඒක දේශයක් සංග්‍රහකොට සංඛාර යමකවලට අනතුරුව දේශනා කළ අනුශය යමකයේ අර්ථ වර්ණනාව වේ. එහි මුලින් පෙළෙහි නියමය දතයුතුය. මේ අනුශය යමකයෙහි ඛන්‍ධ යමකාදියෙහි මෙන් දේශනා නොකොට වෙනත් නයකින් පෙළෙහි දේශනාව කරන ලදි. කෙසේද? පළමුව පරිච්ඡේද වශයෙන්, උද්දේස වශයෙන්, උප්පත්ති ස්ථාන වශයෙන් යයි තුන් ආකාරයකින් අනුශයන් ගැන්වීමට පරිච්ඡේද වාරය, පරිච්ඡින්නුද්දෙසවාරය, උප්පත්තට්ඨානවාරය යයි වාර තුනක් දේශනා කරන ලදි. එයින් මහාවාර හතක් වශයෙන් අනුශයන් යොදා යමක දේශනාව කරන ලදි. [missing trans]"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 47,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යෙසං පන සත්තන්නං මහාවාරානං වසෙන අනුසයෙ යොජෙත්වා යමකදෙසනා කතා, තෙසං ඉමානි නාමානි – අනුසයවාරො, සානුසයවාරො, පජහනවාරො, පරිඤ්ඤාවාරො, පහීනවාරො, උප්පජ්ජනවාරො ධාතුවාරොති. තෙසු පඨමො අනුසයවාරො. සො අනුලොමපටිලොමනයවසෙන දුවිධො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ථ අනුලොමනයෙ “යස්ස අනුසෙති, යත්ථ අනුසෙති, යස්ස යත්ථ අනුසෙතී”ති පුග්ගලොකාසතදුභයවසෙන තයො අන්තරවාරා හොන්ති. තෙසු පඨමෙ පුග්ගලවාරෙ “යස්ස කාමරාගානුසයො අනුසෙති, තස්ස පටිඝානුසයො අනුසෙති; යස්ස වා පන පටිඝානුසයො අනුසෙති, තස්ස කාමරාගානුසයො අනුසෙති; යස්ස කාමරාගානුසයො අනුසෙති, තස්ස මානානුසයො, දිට්ඨානුසයො, විචිකිච්ඡානුසයො, භවරාගානුසයො, අවිජ්ජානුසයො අනුසෙති. යස්ස වා පන අවිජ්ජානුසයො අනුසෙති, තස්ස කාමරාගානුසයො අනුසෙතී”ති කාමරාගානුසයමූලකානි ඡ යමකානි. පුන අගහිතග්ගහණවසෙන පටිඝානුසයමූලකානි පඤ්ච, මානානුසයමූලකානි චත්තාරි, දිට්ඨානුසයමූලකානි තීණි, විචිකිච්ඡානුසයමූලකානි ද්වෙ, භවරාගානුසයමූලකං එකන්ති එවං සබ්බානිපි එකමූලකානි එකවීසති. පුන “යස්ස කාමරාගානුසයො ච පටිඝානුසයො ච අනුසෙන්තී”ති එවං ආගතානි දුකමූලකානි පඤ්ච, තිකමූලකානි චත්තාරි, චතුක්කමූලකානි තීණි, පඤ්චකමූලකානි ද්වෙ, ඡක්කමූලකං එකන්ති අපරානිපි පන්නරස හොන්ති. තානි පුරිමෙහි එකවීසතියා සද්ධිං ඡත්තිංසාති පුග්ගලවාරෙ ඡත්තිංස යමකානි. තථා ඔකාසවාරෙ, තථා පුග්ගලොකාසවාරෙති සබ්බානිපි අනුලොමනයෙ අට්ඨසතං යමකානි. තථා පටිලොමනයෙති අනුසයවාරෙ සොළසාධිකානි ද්වෙ යමකසතානි, තතො දිගුණා පුච්ඡා, තතො දිගුණා අත්ථා ච වෙදිතබ්බා. යථා චෙත්ථ, එවං සානුසයවාරො, පජහනවාරො, පරිඤ්ඤාවාරො, පහීනවාරො, උප්පජ්ජනවාරොති ඉමෙසම්පි පඤ්චන්නං වාරානං, එකෙකස්මිං යමකගණනා; යමකදිගුණා පුච්ඡා, පුච්ඡාදිගුණා ච අත්ථා වෙදිතබ්බා. අයං පනෙත්ථ පුරිමෙසු තීසු වාරෙසු විසෙසො. ඔකාසවාරෙ “යත්ථ තත්ථා”ති අවත්වා **යතො තතො**ති නිස්සක්කවචනෙන දෙසනා කතා. සෙසං තාදිසමෙව."
                    },
                    {
                        "type": "paragraph",
                        "text": "යො පනායං සබ්බපච්ඡිමො ධාතුවාරො නාම, සො පුච්ඡාවාරො, විස්සජ්ජනාවාරොති ද්විධා ඨිතො. තස්ස පුච්ඡාවාරෙ **කාමධාතුයා චුතස්ස කාමධාතුං උපපජ්ජන්තස්සා**ති වත්වා “කාමධාතුං වා පන උපපජ්ජන්තස්ස කාමධාතුයා චුතස්සා”ති න වුත්තං. කිං කාරණා? අත්ථවිසෙසාභාවතො. ද්වෙපි හි එතා පුච්ඡා එකත්ථායෙව, තස්මා එකෙකස්මා යමකා එකෙකමෙව පුච්ඡං පුච්ඡිත්වා සබ්බපුච්ඡාවසානෙ පුච්ඡානුක්කමෙනෙව “කාමධාතුයා චුතස්ස කාමධාතුං උපපජ්ජන්තස්ස කස්සචි සත්ත අනුසයා අනුසෙන්තී”තිආදිනා නයෙන විස්සජ්ජනං කතං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඒවායින් මේ නම් අනුශය වාර, සානුශය වාර, පජහන වාර, පරිඤ්ඤා වාර පහීන වාර උඵ්පජ්ජනවාර, ධාතුවාරයයි වේ. ඒවායින් පළමුව අනුශය වාරය වේ. එය අනුලෝම පටිලෝම වශයෙන් ද්විධ වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "එහි අනුලෝම නයෙහි ‘යස්ස අනුසෙති, යත්‍ථ අනුසෙති, යස්ස යත්‍ථ අනුසෙති’ යයි පුග්ගල ඕකාස ඒ දෙක වශයෙන් අන්තරවාර තුනක් වේ. ඒවායින් පළමුව පුග්ගල වාරයෙහි යමෙකුගේ කාමරාග අනුසය අත්නොහැර පවතී ද ඔහුගේ පටිඝානුසය ද අත්නොහැර පවතී. යමෙකුගේ වනාහි පටිඝ අනුසය අත්නොහැර පවතීද ඔහුගේ කාමරාග අනුසයද අත්නොහැර පවතී. යමෙකුගේ කාමරාග අනුසය අත්නොහැර පවතීද ඔහුගේ මාන අනුසය, දිට්ඨි අනුසය, විචිකිච්ඡා අනුසය, භවරාග අනුසය, අවිජ්ජා අනුසය අත්නොහැර පවතී. යමෙකුගේ වනාහි අවිජ්ජා අනුසය අත්නොහැර පවතීද ඔහුගේ කාමරාග අනුසය අත්නොහැර පවතී යයි කාමරාගානුසය මූලක යමක හයක් වේ. නැවත අගහිත ගහණ වශයෙන් පටිඝ අනුසය මූලක පහකි. මාන අනුසය මූලක සතරකි. දිට්ඨ අනුසය මූලක තුනකි. විචිකිච්ඡා අනුසය මූලක දෙකකි. භවරාග අනුසය මූලක එකක් යයි මෙසේ සියල්ල ඒක මූලක එක්විස්සක් වේ. නැවත යමෙකුට කාමරාග අනුසය ද පටිඝ අනුසය ද අත්නොහැර පවතීදැයි මෙසේ ආවා වූ දුක මූලක පහකි. තික මූලක හතරකි. චතුක්කමූලක තුනකි. පංචමූලක දෙකකි. ඡක්කමූලක එකකැයි තවත් පහළොවක් වේ. ඒවා පෙර එක්විස්ස සම තිස්හයක් වේ. පුග්ගල වාරයෙහි යමක තිස්හයක් වේ. එසේම ඕකාස වාරයෙහි ද, පුග්ගලොකාස වාරයෙහිදැයි අනුලෝම නයෙහි යමක සියල්ල එක්සිය අටක් වේ. පටිලෝම වාරයෙහි ද එසේ වේ. එසේ යමක දෙසිය දහසයක් වේ. එයින් දෙගුණය පුච්ඡා වේ. එයින් දෙගුණය අර්ථය වේයයි දතයුතුය. මෙහි යම්සේ මෙසේ සානුසය වාරය, පජහන වාරය, පරිඤ්ඤා වාරය, පහීන වාරය, උප්පජ්ජන වාරය යයි මේ පස්වාරයෙහි ද එක එකෙහි යමක ගණත, යමක දිගුණව පුච්ඡා, පුච්ඡා දිගුණව අර්ථ දතයුතුය. මෙහි මේ වනාහි පළමු තුන්වාරයෙහි විශේෂයකි. ඕකාස වාරයෙහි යත්‍ථ යත්‍ථ යයි නොකියා යතො තතො තතො යයි නිස්සක්ක (පංචමී) වචනයෙන් දේශනාව කරන ලදි. සෙස්ස ද එබඳු වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "මේ සියල්ලට පසුව වූ ධාතුවාරය වේ. එය පුච්ඡාවාර විස්සජ්ජන වාර යයි ද්විධ වේ. ඒ පුච්ඡාවාරයෙහි කාමධාතුවෙන් චුත වූ කාමධාතුවේ උපදින්නකුට නේ යයි කියා, කාමධාතුවේ හෝ උපදින්නාට කාමධාතුවෙන් චුතවන්නා යයි නොකියන ලදි. කුමන කරුණක් නිසාද? අර්ථ විශේෂ අභාවයෙන් මේ පුච්ඡා දෙකම එකම අර්ථ වේ. එහෙයින් එක එකේ යමක එක එකේම ප්‍රශ්න අසා සියළු පුච්ඡා අවසානයෙහි පුච්ඡා අනුක්‍රමයෙන් ම කාමධාතුවෙන් චුත වූවහුගේ කාමධාතුවේ උපදින්නන්ගේ කිසිවෙකුගේ අනුසය සත අත්නොහැර පවතී යයි ආදි නයින් විසඳීම කරන ලදි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 49,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තත්ථ “කාමධාතුයා චුතස්ස කාමධාතුං උපපජ්ජන්තස්ස, රූපධාතුං, අරූපධාතුං, නකාමධාතුං, නරූපධාතුං නඅරූපධාතුං , උපපජ්ජන්තස්සා”ති ඡ සුද්ධිකපුච්ඡා; “නකාමධාතුං, නඅරූපධාතුං, නරූපධාතුං; නඅරූපධාතුං, නකාමධාතුං, නරූපධාතුං, උපපජ්ජන්තස්සා”ති තිස්සො මිස්සකා පුච්ඡා චාති කාමධාතුමූලකා නව අනුලොමපුච්ඡා හොන්ති. තථා රූපධාතුමූලකා නව, අරූපධාතුමූලකා නවාති සත්තවීසති අනුලොමපුච්ඡා හොන්ති. තථා නකාමධාතුනරූපධාතුනඅරූපධාතුමූලකා සත්තවීසති පටිලොමපුච්ඡා. පුන “නකාමධාතුයා, නඅරූපධාතුයා, නරූපධාතුයා, නඅරූපධාතුයා, නකාමධාතුයා, නඅරූපධාතුයා”ති සත්තවීසති දුකමූලකා පුච්ඡාති සබ්බාපි සම්පිණ්ඩිතා එකාසීති පුච්ඡා හොන්ති. තාසං වසෙනෙත්ථ විස්සජ්ජනං කතන්ති ඉදං ධාතුවාරෙ පාළිවවත්ථානං. එවං තාව සකලෙපි අනුසයයමකෙ පාළිවවත්ථානමෙතං වෙදිතබ්බං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ආදිතො පට්ඨාය පනෙත්ථ යං යං අනුත්තානං, තත්ථ තත්ථ අයං විනිච්ඡයකථා – **අනුසයා**ති කෙනට්ඨෙන අනුසයා? අනුසයනට්ඨෙන. කො එස අනුසයනට්ඨො නාමාති? අප්පහීනට්ඨො. එතෙ හි අප්පහීනට්ඨෙන තස්ස තස්ස සන්තානෙ අනුසෙන්ති නාම, තස්මා අනුසයාති වුච්චන්ති. **අනුසෙන්තී**ති අනුරූපං කාරණං ලභිත්වා උප්පජ්ජන්තීති අත්ථො. අථාපි සියා – අනුසයනට්ඨො නාම අප්පහීනාකාරො. අප්පහීනාකාරො ච උප්පජ්ජතීති වත්තුං න යුජ්ජති, තස්මා න අනුසයා උප්පජ්ජන්තීති . තත්රිදං පටිවචනං – අප්පහීනාකාරො අනුසයො, අනුසයොති පන අප්පහීනට්ඨෙන ථාමගතකිලෙසො වුච්චති. සො චිත්තසම්පයුත්තො සාරම්මණො සප්පච්චයට්ඨෙන සහෙතුකො එකන්තාකුසලො අතීතොපි හොති අනාගතොපි පච්චුප්පන්නොපි, තස්මා උප්පජ්ජතීති වත්තුං යුජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්රිදං පමාණං – අභිධම්මෙ තාව කථාවත්ථුස්මිං (කථා· 554 ආදයො) “අනුසයා අබ්යාකතා, අනුසයා අහෙතුකා, අනුසයා චිත්තවිප්පයුත්තා”ති සබ්බෙ වාදා පටිසෙධිතා. පටිසම්භිදාමග්ගෙ (පටි· ම· 3.21) “පච්චුප්පන්නෙ කිලෙසෙ පජහතී”ති පුච්ඡං කත්වා අනුසයානං පච්චුප්පන්නභාවස්ස අත්ථිතාය “ථාමගතානුසයං පජහතී”ති වුත්තං. ධම්මසඞ්ගහෙ පන මොහස්ස පදභාජනෙ “අවිජ්ජානුසයො අවිජ්ජාපරියුට්ඨානං අවිජ්ජාලඞ්ගී මොහො අකුසලමූලං, අයං තස්මිං සමයෙ මොහො හොතී”ති (ධ· ස· 390) අකුසලචිත්තෙන සද්ධිං අවිජ්ජානුසයස්ස උප්පන්නභාවො වුත්තො. ඉමස්මිංයෙව අනුසයයමකෙ සත්තන්නං මහාවාරානං අඤ්ඤතරස්මිං උප්පජ්ජනවාරෙ “යස්ස කාමරාගානුසයො උප්පජ්ජති, තස්ස පටිඝානුසයො උප්පජ්ජතී”තිආදි වුත්තං. තස්මා “අනුසෙන්තීති අනුරූපං කාරණං ලභිත්වා උප්පජ්ජන්තී”ති යං වුත්තං, තං ඉමිනා තන්තිප්පමාණෙන සුවුත්තන්ති වෙදිතබ්බං. යම්පි “චිත්තසම්පයුත්තො සාරම්මණො”තිආදි වුත්තං, තම්පි සුවුත්තමෙව. අනුසයො හි නාමෙස පරිනිප්ඵන්නො චිත්තසම්පයුත්තො අකුසලධම්මොති නිට්ඨමෙත්ථ ගන්තබ්බං. **කාමරාගානුසයො**තිආදීසු කාමරාගො ච සො අප්පහීනට්ඨෙන අනුසයො චාති කාමරාගානුසයො. සෙසපදෙසුපි එසෙව නයො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එහි කම් ධාතුවෙන් චුතවන්නාගේ කාමධාතුවේ උපදින්නාගේ රූපධාතුව, අරූපධාතුව, කාමධාතු නොවේ. රූපධාතු නොවේ. අරූපධාතු නොවේ. උපදින්නාගේ සුද්ධික පුච්ඡා සය, කාමධාතු නොවේ. අරූපධාතු නොවේ. රූපධාතු නොවේ. අරූපධාතු නොවේ. කාමධාතු නොවේ. රූපධාතු නොවේ. උපදින්නාගේ යයි තුනයි. මිශ්‍රක පුච්ඡා යයි කාමධාතු මූලක අනුලෝම පුච්ඡා නවයක් වේ. එසේම රූපධාතු මූලක නවයකි. අරූපධාතු මූලක නවයකැයි අනුලෝම පුච්ඡා විසිහතක් වේ. එසේම කාමධාතු නොවේ. රූපධාතු නොවේ. අරූපධාතු නොවේ. අරූපධාතු නොවන පටිලෝම පුච්ඡා විසිහතකි. නැවත කාමධාතු නොවේ. අරූපධාතු නොවේ. රූපධාතු නොවේ. අරූපධාතුවේ නොවේ. කාමධාතුවේ නොවේ. රූපධාතුවේ නොවේ යයි දුක මූලක පුච්ඡා විසිහතකි. සියල්ල පිඩු කළවිට පුච්ඡා අසූඑකක් වේ. ඒවායේ වශයෙන් මෙහි විසඳීම කරන ලදි. මෙය ධාතුවාරයෙහි පෙළෙහි නියමයයි. මෙසේ සියළුම අනුශය යමකයෙහි මේ පෙළෙහි නියමය දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "මුලසිට මෙහි යමක් නොකියන ලද නම් එහි මේ විනිශ්චය කථාවයි. **අනුසයා** කුමන අර්ථයකින් අනුශය වේද? ප්‍රහීන නොවූ අර්ථයෙන්. අප්‍රහීනාර්ථයෙන් මේවා ඒ ඒ සන්තාන අත්නොහැර පවතී. එහෙයින් අනුශයයි කියනු ලැබේ. **අනුසෙන්ති** අනුරූප කරුණක් ලැබ උපදී යන අර්ථයයි. තවද අනුශයාර්ථ නම් අප්‍රහීන ආකාර වන්නේය. අප්‍රහීන ආකාරයද ඉපදීම යයි කීමට නොයෙදේ. එහෙයින් අනුශය නූපදීද? ඊට ප්‍රතිවචන මෙසේය. අප්‍රහීනාකර අනුශය වනාහි අප්‍රහීන අර්ථයෙන් බලවත් වූ කෙලෙස් කියනු ලැබේ. එය සිත හා යුක්ත වූයේ අරමුණු සහිත වූයේ ප්‍රත්‍ය ලැබ සහේතුක වූ ඒකාන්ත කුසලයක් අතීතයේ විය. අනාගතයේද වේ. එහෙයින් උපදී යයි කීමට යෙදේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "එහි ප්‍රමාණය මෙසේය. අභිධර්මයෙහි කථා වස්තුවේ අනුශය කියන ලදි. අහේතුක අනුශය, චිත්ත විප්‍රයුක්ත අනුශය යයි සියළු වාද ප්‍රතිසේධිතය. පටිසම්භිදා මාර්ගයෙහි වර්තමානයෙහි කෙලෙසුන් දුරු කෙරේ යයි ප්‍රශ්න කොට අනුශය වර්තමානයේ ඇති බව බලවත් අනුශය දුරු කෙරේ යයි කියන ලදි. ධම්ම සංගණියේ මෝහ පදභාජනයෙහි අවිජ්ජා අනුශය අවිජ්ජා පරියුට්ඨානය (නැගිටීම) අවිජ්ජා ඇලීම මෝහය අකුසල මූලයකි. ඒ අවස්ථාවේ මේ මෝහය වේ යයි අකුසල සිත සමග අවිද්‍යානුශයේ උපන් බව කියන ලදි. මේ අනුශය යමකයෙහි සත්මහා වැර අතුරෙන් යමක උපන් වාරයෙහි යමෙකුට කාමරාග අනුශය උපදීද ඔහුට පටිඝානුසය උපදී යයි යනාදිය කියන ලදි. එහෙයින් අත්නොහරී යයි අනුරූප කාරණයක් ලැබ උපදී යයි යමක් කියන ලදද එය මේ පෙළෙහි ප්‍රමාණයෙන් මනාව කියන ලදැයි දතයුතුය. යමක් චිත්ත සම්ප්‍රයුක්ත ද අරමුණු සහිතයයි ආදිය කියන ලදි. අකුසල ධර්මය යයි මෙහි නිෂ්ඨාවට යා යුතුය. **කාමරාගානුදොසයො** යනාදියෙහි කාමරාගය ද එය අප්‍රහීන බැවින් අනුශය යයි කාමරාගානුසය වේ. සෙසු පදවලද මෙම නයයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 51,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "පරිච්ඡෙදපරිච්ඡින්නුද්දෙසවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උප්පත්තිට්ඨානවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදානි තෙසං උප්පත්තිට්ඨානං පකාසෙතුං **කත්ථ කාමරාගානුසයො අනුසෙතී**තිආදිමාහ. තත්ථ **කාමධාතුයා ද්වීසු වෙදනාසූ**ති කාමාවචරභූමියං සුඛාය ච උපෙක්ඛාය චාති ද්වීසු වෙදනාසු. **එත්ථ කාමරාගානුසයො අනුසෙතී**ති ඉමාසු ද්වීසු වෙදනාසු උප්පජ්ජති. සො පනෙස අකුසලවෙදනාසු සහජාතවසෙන ආරම්මණවසෙන චාති ද්වීහාකාරෙහි අනුසෙති. අකුසලාය සුඛාය වෙදනාය චෙව උපෙක්ඛාය වෙදනාය ච සහජාතොපි හුත්වා උප්පජ්ජති. තා වෙදනා ආරම්මණං කත්වාපි උප්පජ්ජතීති අත්ථො. අවසෙසා පන කාමාවචරකුසලවිපාකකිරියවෙදනා ආරම්මණමෙව කත්වා උප්පජ්ජති. කාමධාතුයා ද්වීසු වෙදනාසු අනුසයමානො චෙස තාහි වෙදනාහි සම්පයුත්තෙසු සඤ්ඤාසඞ්ඛාරවිඤ්ඤාණෙසුපි අනුසෙතියෙව. න හි සක්කා වෙදනාසු අනුසයමානෙන තංසම්පයුත්තෙහි සඤ්ඤාදීහි සද්ධිං අසහජාතෙන වා භවිතුං, තංසම්පයුත්තෙ වා සඤ්ඤාදයො ආරම්මණං අකත්වා උප්පජ්ජිතුං. එවං සන්තෙපි පන යස්මා ඉමා ද්වෙ වෙදනාව සාතසන්තසුඛත්තා අස්සාදට්ඨෙන කාමරාගානුසයස්ස උප්පත්තියා සෙසසම්පයුත්තධම්මෙසු පධානා, තස්මා “ද්වීසු වෙදනාසු එත්ථ කාමරාගානුසයො අනුසෙතී”ති වුත්තං, ඔළාරිකවසෙන හි බොධනෙය්යෙ සුඛං බොධෙතුන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "නනු චෙස ආරම්මණවසෙන අනුසයමානො න කෙවලං ඉමාසු ද්වීසු වෙදනාසු චෙව වෙදනාසම්පයුත්තධම්මෙසු ච අනුසෙති, ඉට්ඨෙසු පන රූපාදීසුපි අනුසෙතියෙව. වුත්තම්පි චෙතං විභඞ්ගප්පකරණෙ (විභ· 816) “යං ලොකෙ පියරූපං සාතරූපං, එත්ථ සත්තානං කාමරාගානුසයො අනුසෙතී”ති ඉමස්මිම්පි පකරණෙ අනුසයවාරස්ස පටිලොමනයෙ වුත්තං. “යත්ථ කාමරාගානුසයො නානුසෙති තත්ථ දිට්ඨානුසයො නානුසෙතීති දුක්ඛාය වෙදනාය රූපධාතුයා අරූපධාතුයා එත්ථ කාමරාගානුසයො නානුසෙති, නො ච තත්ථ දිට්ඨානුසයො නානුසෙති. අපරියාපන්නෙ එත්ථ කාමරාගානුසයො ච නානුසෙති, දිට්ඨානුසයො ච නානුසෙතී”ති. එත්ථ හි දුක්ඛවෙදනාය චෙව රූපධාතුආදීසු ච නානුසෙතීති වුත්තත්තා සසම්පයුත්තධම්මං දුක්ඛවෙදනං සඔකාසෙ රූපාරූපාවචරධම්මෙ නව ච, ලොකුත්තරධම්මෙ ඨපෙත්වා අවසෙසෙසු රූපසද්දගන්ධරසඵොට්ඨබ්බෙසු අනුසෙතීති වුත්තං හොති. තං ඉධ කස්මා න වුත්තන්ති? අනොළාරිකත්තා. හෙට්ඨා වුත්තනයෙන හි වෙදනානඤ්ඤෙව ඔළාරිකත්තා ඉමෙසං පන අනොළාරිකත්තා එතෙසු රූපාදීසු අනුසෙතීති න වුත්තං, අත්ථතො පන ලබ්භති. තස්මා එතෙසුපි කාමරාගානුසයො අනුසෙතියෙවාති වෙදිතබ්බො. න හි සත්ථා සබ්බං සබ්බත්ථ කථෙති. බොධනෙය්යසත්තානං පන වසෙන කත්ථචි යං ලබ්භති, තං සබ්බං කථෙති, කත්ථචි න කථෙති. තථා හි අනෙන කත්ථචි දිට්ඨානුසයො අනුසෙතීති පුච්ඡිත්වා “සබ්බසක්කායපරියාපන්නෙසු ධම්මෙසු එත්ථ දිට්ඨානුසයො අනුසෙතී”ති යං ලබ්භති තං සබ්බං කථිතං. අපරස්මිං ඨානෙ විස්සජ්ජන්තෙන “රූපධාතුයා අරූපධාතුයා එත්ථ විචිකිච්ඡානුසයො ච මානානුසයො ච දිට්ඨානුසයො ච අනුසෙන්ති, කාමධාතුයා ද්වීසු වෙදනාසු එත්ථ විචිකිච්ඡානුසයො ච කාමරාගානුසයො ච මානානුසයො ච දිට්ඨානුසයො ච අනුසෙන්ති, දුක්ඛාය වෙදනාය එත්ථ විචිකිච්ඡානුසයො ච පටිඝානුසයො ච දිට්ඨානුසයො ච අවිජ්ජානුසයො ච අනුසෙන්තී”ති යං ලබ්භති තං සබ්බං අකථෙත්වා රූපධාතුඅරූපධාතූහි සද්ධිං තිස්සො වෙදනාව කථිතා. වෙදනාසම්පයුත්තා පන අරූපධම්මා, සබ්බඤ්ච රූපං න කථිතං. කිඤ්චාපි න කථිතං, දිට්ඨානුසයො පනෙත්ථ අනුසෙතියෙව. එවමෙව කිඤ්චාපි ඉධ රූපාදිඉට්ඨාරම්මණං න කථිතං, කාමරාගානුසයො පනෙත්ථ අනුසෙතියෙවාති. එවං තාව කාමරාගානුසයස්ස අනුසයනට්ඨානං වෙදිතබ්බං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උප්පත්තිට්ඨානවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දැන් ඒවායේ උත්පත්ති ස්ථාන පැවසීමට කාමරාග අනුසය කොහේ වැතිර සිටීද? යනාදිය කීහ. එහි කාමධාතුවෙහි වේදනා දෙකකය. කාමාවචර භූමියෙහි සැප සහ මැදහත් යන වේදනා දෙකෙහි. **එත්‍ථ කාමරාගානුසයො** **අනුසෙති** මෙම වේදනා දෙකෙහි උපදී. එය වනාහි මේ අකුසල වේදනාවල සහජාත වශයෙන් හා අරමුණු වශයෙන්දැයි දෙයාකාරයකින් අත්නොහැර පවතී. අකුසල්වල සැප වේදනාවේද මැදහත් වේදනාවේද එකට උපදී. ඒ වේදනා අරමුණු කොට උපදී යන අර්ථයයි. අවසේස කාමාවචර කුසල විපාක කිරිය වේදනා අරමුණු කොට උපදී. කාමධාතුවෙහි වේදනා දෙකක අත් නොහැර පවතින්නා වූ මෙය ඒ වේදනා හා සම්ප්‍රයුක්ත වූ සඤ්ඤා සංඛාර විඤ්ඤාණවලද අත්නොහැර පවතීමය. වේදනාවල අත්නොහැර පැවතීමෙන් එය හා යුක්ත වූ සංඥාදිය සමග සහජාත නොවී හෝ පැවතීමට නොහැකි වේ. එය හා යුක්ත වූ සංඥාදිය හෝ අරමුණු නොකොට ඉපදීමට නොහැකි වේ. මෙසේ ඇතිකල්හි වනාහි යම්හෙයකින් මේ වේදනා දෙකම මිහිරි අන්ත සැප අන්ත ආශ්වාදන අර්ථයෙන් කාමරාග අප්‍රාසයේ උපතින් සෙසු සම්ප්‍රයුක්ත ධර්මවල ප්‍රධාන වේ. එහෙයින් වේදනා දෙකෙහි කාමරාග අනුසය අත්නොහැර පවතී යයි කියන ලදි. ඕළාරික වශයෙන් අවබෝධ කළයුත්තන්ට පහසුවෙන් අවබෝධ කරවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙය අරමුණු වශයෙන් අත්නොහැර පවතින්නේ හුදෙක් මේ වේදනා දෙකෙහි ද වේදනා සම්ප්‍රයුක්ත ධර්මවල ද අත්නොහැර පවතී. ඉෂ්ට රූපාදියෙහි ද අත්නොහැර පවතීමය. විභංග ප්‍රකරණයෙහි මෙය කියන ලදි. ‘ලෝකයෙහි ප්‍රිය රූප වූ මිහිරි රූප වූ යමක් වේද, එහි සත්ත්වයින්ගේ කාමරාග අනුශය අත්නොහැර පවතී. මේ ප්‍රකරණයෙහි ම අනුශයවාර පටිලෝම නයෙහි කියන ලද:- යම්තැනක කාමරාග අනුශය අත්හැර පවතීද එතැන දිට්ඨ අනුශය අත්හැර පවතී. දුක් වේදනාවෙන් රූපධාතුවේ අරූප ධාතුවේ යන මෙහි ද කාමරාග අනුශය අත්හැර පවතී. දිට්ඨානුශයද එහි නොපවතී. අපරියාපත්ත වශයෙන් මෙහි කාමරාග අනුශය ද නොපවතී. දිට්ඨානුශයද නොපවතී යයි මෙහි දුක්ඛ වේදනාවද රූපධාතු ආදියෙහි නොපවතී යයි කියන ලද බැවින් සම්ප්‍රයුක්ත ධර්ම වූ දුක්ඛ වේදනාව ඕකාස සහිත වූ රූපාවචර ධර්මයෙන්ද ලෝකෝත්තර ධර්මය හැර අවසේස රූප සද්දගන්ධ රස ස්පර්ශවල පවතී යයි කියන ලද්දේ වේ. එය මෙහි කුමක්හෙයින් නොකියන ලදද? ඕලාරික නොවන බැවිනි. යට කියන ලද නයින් වේදනාවම ඕළාරික බැවින් මෙයද ඕළාරික නොවේ. මේ රූපාදියෙහි පවතීයයි නොකියන ලදි. අර්ථ වශයෙන් වනාහි ලබයි. එහෙයින් මේවායෙහි ද කාමරාග අනුශය පවතී යයි දතයුතුය. ශාස්තෲන් වහන්සේ සියල්ල සියළු තැන නො වදාළහ. අවබෝධ කළහැකි සත්ත්වයින්ගේ වශයෙන් කිසිතැනක යමක් ලබයි නම් ඒ සියල්ල වදාරති. කිසිතැනක නොවදාරති. එසේම මෙයින් දිට්ඨානුශය පවතීදැයි අසා සත්කාය ඇතුළත් සියළු ධර්මවල දිට්ඨානුශය පවතී යයි යමක් ලබාද ඒ සියල්ල වෙනත් තැනක විසඳමින් වදාරන ලදි. රූපධාතු අරූපධාතු යන මෙහි විචිකිච්ඡා අනුශයද මාන අනුශයද දිට්ඨ අනුශයද පවතී. කාමධාතුවේ වේදනා දෙකෙහිද ඉහත කී අනුශයන් පවතී. දුක්ඛ වේදනාවෙහි විචිකිච්ඡා අනුශය, පටිඝ අනුශය, දිට්ඨ අනුශය පවතී යයි යමක් ලබාද ඒ සියල්ල නොකියා රූපධාතු අරූප ධාතු සමග වේදනා තුන කියන ලදි. වේදනා සම්ප්‍රයුක්ත වනාහි අරූප ධර්ම සියල්ලද රූපයද නොකියන ලදි. කිසිවක් නොකියන ලදි. දිට්ඨ අනුශය මෙහි පවතී. එසේම රූපාදි ඉටු අරමුණෙහි කිසිවක් නොකියන ලදි. කාමරාග අනුශය මෙහි පවතීමය. මෙසේ කාමරාග අනුශයේ පවතින තැන් දතයුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 53,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පටිඝානුසයස්ස පන “දුක්ඛාය වෙදනායා”ති වචනතො ද්වෙ දොමනස්සවෙදනා කායවිඤ්ඤාණසම්පයුත්තා දුක්ඛවෙදනාති තිස්සො වෙදනා අනුසයනට්ඨානං. සො පනෙස දොමනස්සවෙදනාසු සහජාතවසෙන ආරම්මණවසෙන චාති ද්වීහාකාරෙහි අනුසෙති. අවසෙසදුක්ඛවෙදනාය පන ආරම්මණවසෙනෙව අනුසෙති. තාසු වෙදනාසු අනුසයමානො චෙස තාහි සම්පයුත්තෙසු සඤ්ඤාක්ඛන්ධාදීසුපි අනුසෙතියෙව. යාය හි වෙදනාය එස සහජාතො, තංසම්පයුත්තෙහි සඤ්ඤාදීහිපි සහජාතොව. යා ච වෙදනා ආරම්මණං කරොති, තාහි සම්පයුත්තෙ සඤ්ඤාදයොපි කරොතියෙව. එවං සන්තෙපි පන යස්මා දුක්ඛවෙදනාව අසාතදුක්ඛවෙදයිතත්තා නිරස්සාදට්ඨෙන පටිඝානුසයස්ස උප්පත්තියා සෙසසම්පයුත්තධම්මෙසු අධිකා; තස්මා “දුක්ඛාය වෙදනාය එත්ථ පටිඝානුසයො අනුසෙතී”ති වුත්තං, ඔළාරිකවසෙන හි බොධනෙය්යෙ සුඛං බොධෙතුන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "නනු චෙස ආරම්මණවසෙන අනුසයමානො න කෙවලං දුක්ඛවෙදනාය චෙව තංසම්පයුත්තධම්මෙසු ච අනුසෙති, අනිට්ඨෙසු පන රූපාදීසුපි අනුසෙතියෙව? වුත්තම්පි චෙතං විභඞ්ගප්පකරණෙ (විභ· 816) “යං ලොකෙ අප්පියරූපං අසාතරූපං, එත්ථ සත්තානං පටිඝානුසයො අනුසෙතී”ති ඉමස්මිම්පි පකරණෙ අනුසයවාරස්ස පටිලොමනයෙ වුත්තං – “කාමධාතුයා ද්වීසු වෙදනාසු එත්ථ පටිඝානුසයො නානුසෙති, නො ච තත්ථ කාමරාගානුසයො නානුසෙති. රූපධාතුයා අරූපධාතුයා අපරියාපන්නෙ එත්ථ පටිඝානුසයො ච නානුසෙති, කාමරාගානුසයො ච නානුසෙතී”ති. එත්ථ හි ද්වීසු කාමාවචරවෙදනාසු චෙව රූපධාතුආදීසු ච නානුසෙතීති වුත්තත්තා සසම්පයුත්තධම්මා ද්වෙ වෙදනා සඔකාසෙ රූපාරූපාවචරධම්මෙ නව ච, ලොකුත්තරධම්මෙ ඨපෙත්වා අවසෙසෙසු රූපාදීසු අනුසෙතීති වුත්තං හොති . තං ඉධ කස්මා න වුත්තන්ති? අනොළාරිකත්තා. හෙට්ඨා වුත්තනයෙන හි දුක්ඛවෙදනාය එව ඔළාරිකත්තා ඉමෙසං පන අනොළාරිකත්තා එතෙසු රූපාදීසු අනුසෙතීති න වුත්තං. අත්ථතො පන ලබ්භති, තස්මා එතෙසුපි පටිඝානුසයො අනුසෙතියෙවාති වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කිං පන ඉතරා ද්වෙ වෙදනා ඉට්ඨාරම්මණං වා පටිඝස්ස ආරම්මණං න හොන්තීති? නො න හොන්ති. පරිහීනජ්ඣානස්ස විප්පටිසාරවසෙන සසම්පයුත්තධම්මා තා වෙදනා ආරබ්භ දොමනස්සං උප්පජ්ජති. ඉට්ඨාරම්මණස්ස ච පටිලද්ධස්ස විපරිණාමං වා අප්පටිලද්ධස්ස අප්පටිලාභං වා සමනුස්සරතොපි දොමනස්සං උප්පජ්ජති. දොමනස්සමත්තමෙව පන තං හොති, න පටිඝානුසයො. පටිඝානුසයො හි අනිට්ඨාරම්මණෙ පටිහඤ්ඤනවසෙන උප්පන්නො ථාමගතො කිලෙසො, තස්මා එත්ථ දොමනස්සෙන සද්ධිං පටිඝො උප්පන්නොපි අත්තනො පටිඝකිච්චං අකරණභාවෙන එව පටිඝානුසයො න හොති අබ්බොහාරිකත්තං ගච්ඡති. යථා හි පාණාතිපාතචෙතනාය සද්ධිං උප්පන්නොපි බ්යාපාදො මනොකම්මං නාම න හොති අබ්බොහාරිකත්තං ගච්ඡති, එවං පටිඝානුසයො න හොති, අබ්බොහාරිකත්තං ගච්ඡති. වුත්තම්පි චෙතං එකච්චං ඉට්ඨාරම්මණං නෙක්ඛම්මසිතම්පි වා දොමනස්සං සන්ධාය “යං එවරූපං දොමනස්සං පටිඝං තෙන පජහති න තත්ථ පටිඝානුසයො අනුසෙතී”ති (ම· නි· 1.465). එවං පටිඝානුසයස්ස අනුසයනට්ඨානං වෙදිතබ්බං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පටිඝ අනුශය වනාහි දුක් වේදනාවේ වචනයෙන් දොම්නස් වේදනා දෙක, කාය විඤ්ඤාණ සම්ප්‍රයුක්ත දුක් වේදනාව යයි වේදනාව තුනෙහි පවතී. එය වනාහි මේ දොම්නස් වේදනා දෙකෙහි සහජාත වශයෙන් හා අරමුණු වශයෙන් යන දෙයාකාරයකින් පවතී. සෙසු දුක්වේදනාවල අරමුණු වශයෙන් පවතී. ඒ වේදනාවල පවතින්නේ ඒවා සමග සම්ප්‍රයුක්ත සංඥා ස්කන්ධාදියෙහි ද පවතීමය. යම් වේදනාවක් සමග මෙය සහජාත ද එය හා සම්ප්‍රයුක්ත සංඥාදියෙහි ද සහජාත වේ. යම් වේදනාවක් අරමුණු කෙරේ නම් එය හා සම්ප්‍රයුක්ත සංඥා ආදියද අරමුණු කෙරේ. මෙසේ පවතින කල්හි යම් දුක් වේදනාවක් අමිහිරි දුක් වේදනාදියක් බැවින් ආශ්වාද නොවන අර්ථයෙන් පටිඝ අනුශයේ ඉපදීමෙන් සෙසු සම්ප්‍රයුක්ත ධර්මවල අධිකව යෙදේ. එහෙයින් දුක්වේදනාවේ පටිඝ අනුශය පවතීයයි කියන ලදි. ඕළාරික වශයෙන් අවබෝධ කරන්නන්ට පහසුවෙන් අවබෝධ කරවීම සඳහාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "මේ දුක්වේදනාවල සහ එම සම්ප්‍රයුක්ත ධර්මවල පමණක් නොව අරමුණු වශයෙන් නොපවතින්නේ ද? අනිෂ්ට රූපාදියෙහි ද පවතීමය. විභංග ප්‍රකරණයෙහි කියන ලදි. ලෝකයෙහි යම් අප්‍රිය වූ අමිහිරි වූ රූපයක් වේද එහි සත්ත්වයින්ගේ පටිඝ අනුශය පවතී. මේ ප්‍රකරණයෙහිම අනුශය වාරයේ පටිලෝම නයෙහි කියන ලදි. කාමධාතුවේ වේදනා දෙකක පටිඝ අනුශය නොපවතී. එහි කාමරාග අනුශයද නොපවතී. එහි කාමාවචර වේදනාවල මෙන්ම රූපධාතුවල ද යන දෙකෙහි නොපවතී යයි කියන ලද බැවින් සම්ප්‍රයුක්ත ධර්ම සහිත වේදනා දෙක ඕකාශයෙහි රූපාවචර අරූපාවචර ධර්ම නවය ද ලෝකෝත්තර ධර්මය හැර අවසේස රූපාදියෙහි පවතී යයි කියන ලද්දේ වේ. එය මෙහි කුමක් නිසා නොකියන ලදද? ඕළාරික නොවන බැවිනි. යට කියන ලද නයින් දුක් වේදනාවම ඕළාරික බැවින් මේවායේ වනාහි ඕළාරික නොවන බැවින් මේ රූපාදියෙහි පවතීම යයි දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉතිරි වේදනා දෙක ඉටු අරමුණ හෝ පටිඝයේ අරමුණ කිම නොවේද? නොවන්නේ නොවේ. පිරිහුණු ධ්‍යානයේ විපිළිසර වශයෙන් සම්ප්‍රයුක්ත ධර්ම වූ ඒ වේදනා අරභයා දොම්නස උපදී. ඉටු අරමුණේ ද ලැබූ විපරිණාමය හෝ නොලද අලාභයේ හෝ සිහිකරන්නාට දොම්නස උපදී. එය දොම්නස් මාත්‍රයක් පමණක් වේ. පටිඝ අනුශය නොවේ. පටිඝානුශය වනාහි අනිටු අරමුණෙහි හැපීම් වශයෙන් උපන්නේ බලවත් වූ ක්ලේශයකි. එහෙයින් මෙහි දොම්නස සමග පටිඝය උපන්නේ ද තමාගේ පටිඝ කිස නොකරන බැවින්ම පටිඝ අනුශය නොවේ. අව්‍යවහාර බවට පැමිණේ. පාණාතිපාත චේතනාව සමග උපන් ව්‍යාපාදය මනෝකර්ම නම් නොවන්නා සේ අව්‍යවහාරයට පැමිණේ. මෙසේ පටිඝානුශය නොවේ. අව්‍යවහාර බවම යයි. මෙය කියන ලදි. එක් ඉටු අරමුණක් නෙක්ඛම්ම සිතද හෝ දොම්නස සඳහා ‘යම් එබඳු වූ දොම්නස් පටිඝය එයින් දුරු කෙරේ, එහි පටිඝ අනුශය නොවේ’ යයි මෙසේ පටිඝානුශයේ අනුශය නැතිවීම දතයුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 55,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "මානානුසයස්ස පන “කාමධාතුයා ද්වීසු වෙදනාසූ”තිආදිවචනතො ද්වෙ කාමාවචරවෙදනා රූපාරූපධාතුයො චාති ඉදං තිවිධං අනුසයනට්ඨානං. තස්ස අකුසලාසු වෙදනාසු කාමරාගානුසයස්ස විය සහජාතානුසයතා වෙදිතබ්බා. සසම්පයුත්තධම්මාසු පන සබ්බාසුපි කාමාවචරාසු සුඛඅදුක්ඛමසුඛවෙදනාසු රූපාරූපධාතූසු ච ආරම්මණවසෙනෙව අනුසෙති. අනුසයවාරස්ස පන පටිලොමනයෙ “දුක්ඛාය වෙදනාය අපරියාපන්නෙ එත්ථ කාමරාගානුසයො ච නානුසෙති, මානානුසයො ච නානුසෙතී”ති වුත්තත්තා ඨපෙත්වා දුක්ඛවෙදනඤ්චෙව නවවිධං ලොකුත්තරධම්මඤ්ච සෙසරූපාරූපධම්මෙසුපි අයං අනුසෙතියෙවාති. එවං මානානුසයස්ස අනුසයනට්ඨානං වෙදිතබ්බං."
                    },
                    {
                        "type": "paragraph",
                        "text": "දිට්ඨානුසයවිචිකිච්ඡානුසයා පන කෙවලං ලොකුත්තරධම්මෙස්වෙව නානුසෙන්ති. තෙභූමකෙසු පන සබ්බෙසුපි අනුසෙන්තියෙව. තෙන වුත්තං – “සබ්බසක්කායපරියාපන්නෙසු ධම්මෙසු එත්ථ දිට්ඨානුසයො අනුසෙති, එත්ථ විචිකිච්ඡානුසයො අනුසෙතී”ති. තත්ථ **සබ්බසක්කායපරියාපන්නෙසූ**ති සංසාරවට්ටනිස්සිතට්ඨෙන සක්කායපරියාපන්නෙසු සබ්බධම්මෙසූති අත්ථො. තත්ථ පනෙතෙ පඤ්චසු චිත්තුප්පාදෙසු සහජාතානුසයනවසෙන අනුසෙන්ති. තෙ වා පන පඤ්ච චිත්තුප්පාදෙ අඤ්ඤෙ වා තෙභූමකධම්මෙ ආරබ්භ පවත්තිකාලෙ ආරම්මණානුසයනවසෙන අනුසෙන්තීති. එවං දිට්ඨානුසයවිචිකිච්ඡානුසයානං අනුසයනට්ඨානං වෙදිතබ්බං."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවරාගානුසයො පන කිඤ්චාපි දිට්ඨිවිප්පයුත්තෙසු චතූසු චිත්තෙසු උප්පජ්ජනතො සහජාතානුසයනවසෙන “කාමධාතුයා ද්වීසු වෙදනාසු අනුසෙතී”ති වත්තබ්බො භවෙය්ය. කාමධාතුයං පනෙස ද්වීහි වෙදනාහි සද්ධිං උප්පජ්ජමානොපි රූපාරූපාවචරධම්මමෙව පටිලභති. කාමධාතුයා පරියාපන්නං එකධම්මම්පි ආරම්මණං න කරොති, තස්මා ආරම්මණානුසයනවසෙන නියමං කත්වා “රූපධාතුයා අරූපධාතුයා එත්ථ භවරාගානුසයො අනුසෙතී”ති වුත්තං. අපිච රාගො නාමෙස කාමරාගභවරාගවසෙන දුවිධො. තත්ථ කාමරාගො කාමධාතුයා ද්වීසු වෙදනාසු අනුසෙතීති වුත්තො. සචෙ පන භවරාගොපි කාමරාගො විය එවං වුච්චෙය්ය, කාමරාගෙන සද්ධිං දෙසනා සංකිණ්ණා විය භවෙය්යාති රාගකිලෙසං ද්විධා භින්දිත්වා කාමරාගතො භවරාගස්ස විසෙසදස්සනත්ථම්පි එවං දෙසනා කතාති. එවං භවරාගානුසයස්ස අනුසයනට්ඨානං වෙදිතබ්බං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "මානානුශය වනාහි කාමධාතුවේ වේදනා දෙකක යයි ආදි වචනයෙන් කාමාවචර වේදනා දෙකය. රූපධාතුව යයි මේ ස්ථාන තුන අනුශය ස්ථාන වේ. ඒ අකුසල වේදනාවල කාම රාගානුශය මෙන් සහජාත අනුශය බව දතයුතුය. සම්ප්‍රයුක්ත ධර්මවල වනාහි සියළු කාමාවචර සැප දුක් උපේක්‍ෂා වේදනාවල රූපාරූප ධාතුවලද අරමුණු වශයෙන් පවතී. අනුශය වාර පටිලෝම නයෙහි දුක් වේදනාවට ඇතුළත් නොවූ එහි කාමරාග අනුශයද මානානුශය ද නොපවතී යයි කියූ බැවින් නවවිධ දුක් වේදනාවද ලෝකෝත්තර ධර්මයද හැර සෙසු රූපාරූප ධර්මවලද මෙය පවතීමය. මෙසේ මානානුශයේ අනුශය ස්ථාන දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "දිට්ඨානුශය විචිකිච්ඡානුසය වනාහි හුදෙක් ලෝකෝත්තර ධර්මවල නොපවතී. ත්‍රෛභූමක සියල්ලෙහි වනාහි පවතීමය. එයින් කියන ලදි. ‘සියළු සක්කායවල ඇතුළත් ධර්මවල දිට්ඨානුසය පවතී. විචිකිච්ඡානුසයද පවතී. එහි **සබ්බකාය පරියාපන්නෙසු** සසරවට නිශ්‍රිතාර්ථයෙන් සක්කාය ඇතුළත් සියළු ධර්මවල යයි අර්ථය වේ. එහි වනාහි මේ පස් චිත්තුප්පාදවල සහජාත අනුශය වශයෙන් පවතී. ඒවා වනාහි චිත්තුප්පාද පසෙහි අන්‍ය වූ හෝ ත්‍රෛභූමක ධර්ම අරභයා පවතින කාලයෙහි අරමුණු අනුශය වශයෙන් පවතී. මෙසේ දිට්ඨානුසය විචිකිච්ඡානුසයවල පවතින සඳහා දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවරාග අනුසය වනාහි දිට්ඨිවිප්පයුත්ත සතර සිත්වල ඉපදීමෙන් සහජාත අනුසය වශයෙන් කාමධාතුවේ වේදනා දෙකෙහි පවතී යයි කිවයුතු වන්නේය. කාමධාතුවෙහි වනාහි මේ වේදනා දෙක සමාන උපදින්නේ ද රූපාරූප ධර්මම ලබයි. කාමධාතුවට ඇතුළත් එකම ධර්මයකුදු අරමුණු නොකරයි. එහෙයින් අරමුණු නොකරයි. එහෙයින් අරමුණු අනුශය වශයෙන් නියමකොට රූපධාතුවෙහි අරූප ධාතුවෙහි භවරාග අනුශය පවතී යයි කියන ලදි. තවද මෙම රාගය නම් කාමරාග භවරාග වශයෙන් ද්විධය. එහි කාමරාගය කාමධාතුවේ. වේදනා දෙකෙහි පවතී යයි කියන ලදි. ඉදින් භවරාගයද කාමරාගය මෙන් මෙසේ කියන්නේය. කාමරාගය සමග දේශනා සංකීර්ණ මෙන් වන්නේ යයි රාග ක්ලේශය දෙකට බෙදී කාමරාගයෙන් භවරාගයට විශේෂ දර්ශනාර්ථයක්ද මෙසේ දේශනා කරන ලදි. මෙසේ භවරාගානුසයේ අනුශය ස්ථානය දතයුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 57,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අවිජ්ජානුසයො පන සබ්බෙසුපි තෙභූමකධම්මෙසු අනුසෙති. තෙන වුත්තං “සබ්බසක්කායපරියාපන්නෙසු ධම්මෙසු එත්ථ අවිජ්ජානුසයො අනුසෙතී”ති. තස්ස ද්වාදසසු චිත්තුප්පාදෙසු සහජාතානුසයතා වෙදිතබ්බා. ආරම්මණකරණවසෙන පන න කිඤ්චි තෙභූමකධම්මං ආරබ්භ න පවත්තතීති. එවං අවිජ්ජානුසයස්ස අනුසයනට්ඨානං වෙදිතබ්බං. අයං තාව පරිච්ඡෙදවාරපරිච්ඡින්නුද්දෙසවාරඋප්පත්තිට්ඨානවාරෙසු විනිච්ඡයකථා."
                    },
                    {
                        "type": "centered",
                        "text": "උප්පත්තිට්ඨානවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "මහාවාරො",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "අනුසයවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සත්තන්නං පන මහාවාරානං පඨමෙ අනුසයවාරෙ **යස්ස කාමරාගානුසයො අනුසෙති, තස්ස පටිඝානුසයො අනුසෙතී**ති එත්ථ යදෙතං **“ආමන්තා”**ති පටිවචනං දින්නං, තං දුද්දින්නං විය ඛායති. කස්මා? කාමරාගපටිඝානං එකක්ඛණෙ අනුප්පත්තිතො. යථා හි “යස්ස මනායතනං උප්පජ්ජති, තස්ස ධම්මායතනං උප්පජ්ජතීති ‘ආමන්තා’, අස්සාසපස්සාසානං උප්පාදක්ඛණෙ තෙසං කායසඞ්ඛාරො ච උප්පජ්ජති, වචීසඞ්ඛාරො ච උප්පජ්ජතී”තිආදීසු මනායතනධම්මායතනානි කායසඞ්ඛාරවචීසඞ්ඛාරා ච එකක්ඛණෙ උප්පජ්ජන්ති, න තථා කාමරාගපටිඝා. කාමරාගො හි අට්ඨසු ලොභසහගතචිත්තුප්පාදෙසු උප්පජ්ජති. පටිඝො ද්වීසු දොමනස්සසහගතෙසූති, නත්ථි නෙසං එකක්ඛණෙ උප්පත්ති; තස්මා එත්ථ ‘නො’ති පටිසෙධො කත්තබ්බො සියා. තං අකත්වා පන ‘ආමන්තා’ති පටිවචනස්ස දින්නත්තා හෙට්ඨායමකෙසු විය එත්ථ ඛණපච්චුප්පන්නවසෙන වත්තමානවොහාරං අග්ගහෙත්වා අඤ්ඤථා ගහෙතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථං? අප්පහීනවසෙන. අප්පහීනතඤ්හි සන්ධාය අයං “අනුසෙතී”ති වත්තමානවොහාරො වුත්තො, න ඛණපච්චුප්පන්නතං. යස්මා ච අප්පහීනතං සන්ධාය වුත්තො, තස්මා “යස්ස කාමරාගානුසයො අනුසෙති, තස්ස පටිඝානුසයො අනුසෙතී”ති පුච්ඡාය යස්ස කාමරාගානුසයො අප්පහීනො, න අනුප්පත්තිධම්මතං ආපාදිතො, තස්ස පටිඝානුසයොපි අප්පහීනොති එවමත්ථො දට්ඨබ්බො. යස්මා ච තෙසු යස්සෙකො අප්පහීනො, තස්ස ඉතරොපි අප්පහීනොව හොති, තස්මා “ආමන්තා”ති වුත්තං. යදි එවං, යං උපරි උප්පජ්ජනවාරෙ ‘යස්ස කාමරාගානුසයො උප්පජ්ජති, තස්ස පටිඝානුසයො උප්පජ්ජතී’ති පුච්ඡිත්වා ‘ආමන්තා’ති වුත්තං; තත්ථ කථං අත්ථො ගහෙතබ්බොති? තත්ථාපි අප්පහීනවසෙනෙව උප්පත්තිපච්චයෙ සති උප්පත්තියා අනිවාරිතවසෙන වා. යථා හි චිත්තකම්මාදීනි ආරභිත්වා අපරිනිට්ඨිතකම්මන්තා චිත්තකාරාදයො තෙසං කම්මන්තානං අකරණක්ඛණෙපි මිත්තසුහජ්ජාදීහි දිට්ඨදිට්ඨට්ඨානෙ “ඉමෙසු දිවසෙසු කිං කරොථා”ති වුත්තා, “චිත්තකම්මං කරොම, කට්ඨකම්මං කරොමා”ති වදන්ති. තෙ කිඤ්චාපි තස්මිං ඛණෙ න කරොන්ති අවිච්ඡින්නකම්මන්තත්තා පන කතඛණඤ්ච කත්තබ්බඛණඤ්ච උපාදාය කරොන්තියෙව නාම හොන්ති. එවමෙව යම්හි සන්තානෙ අනුසයා අප්පහීනා, යම්හි වා පන නෙසං සන්තානෙ උප්පත්තිපච්චයෙ සති උප්පත්ති අනිවාරිතා, තත්ථ අනුප්පජ්ජනක්ඛණෙපි උප්පන්නපුබ්බඤ්චෙව කාලන්තරෙ උප්පජ්ජනකඤ්ච උපාදාය යස්ස කාමරාගානුසයො උප්පජ්ජති, තස්ස පටිඝානුසයො උප්පජ්ජතියෙව නාමාති එවමත්ථො වෙදිතබ්බො. ඉතො පරෙසුපි එවරූපෙසු විස්සජ්ජනෙසු එසෙව නයො. **නො ච තස්සා**ති ඉදං අනාගාමිස්ස කාමරාගබ්යාපාදානං අනවසෙසතො පහීනත්තා වුත්තං. **තිණ්ණං පුග්ගලාන**න්ති පුථුජ්ජනසොතාපන්නසකදාගාමීනං. **ද්වින්නං පුග්ගලාන**න්ති සොතාපන්නසකදාගාමීනං. පරතොපි එවරූපෙසු ඨානෙසු එසෙව නයො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අවිජ්ජානුසය සියළු ත්‍රෛභූමක ධර්මවල පවතී. එයින් කියන ලදි. ‘සියළු සක්කායවලට ඇතුළත් ධර්මවල යන මෙහි අවිජ්ජා අනුසය පවතී’ යයි දොළොස් චිත්තුප්පාදවල සහජාත අනුසය බව දතයුතුය. අරමුණු කිරීම් වශයෙන් වනාහි කිසිදු ත්‍රෛභූමක ධර්මයක් අරභයා නොපවතී. මෙසේ අවිජ්ජා අනුසයේ අනුසය (පවතින) ස්ථාන දතයුතුය. මේ පරිච්ඡේද වාර, පරිච්ඡින්නුද්දෙසවාර, උප්පත්තිට්ඨානවාර විනිශ්චය කළ විස්තර වේ."
                    },
                    {
                        "type": "centered",
                        "text": "",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "මහා වාර",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "අනුසයවාර වර්ණනාව",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සත්මහා වාරවල වනාහි පළමු අනුශය වාරයෙහි යමෙකුගේ කාමරාග අනුශය පවතීද ඔහුගේ පටිඝානුසය පවතී යයි ප්‍රතිවචන දෙන ලදි. එය වැරදියට දෙන ලදැයි හැඟේ. කුමක් හෙයින්ද? කාමරාග පටිඝයන්ගේ ඒකක්‍ෂණයෙහි නො උපදින බැවින්. යමෙකුගේ මනායතනය උපදී නම් ඔහුගේ ධම්මායතනය උපදීද එසේය. ආශ්වාස ප්‍රශ්වාසවල උපන් කෙරෙන ඔවුන්ගේ කාය සංඛාරය ද උපදී. වචී සංඛාරය ද උපදී යනාදියෙහි මනායතන ධම්මායතන කාය සංඛාර වචී සංඛාර ද එක් ක්‍ෂණයෙහි උපදී. කාමරාග පටිඝ එසේ නොවේ. කාමරාගය ලෝභසහගත සිත් අටෙහි උපදී. පටිඝය දොම්නස් සිත් දෙකෙහි උපදී. ඒවායේ ඒකක්‍ෂණයෙහි ඉපදීමක් නැත. එහෙයින් මෙහි ‘නො’ යයි ප්‍රතිශේධ කළයුතු වන්නේය. එය නොකොට වනාහි ‘ආමන්තා’ යයි ප්‍රතිවචන දුන් බැවින් යට යමකයෙහි මෙන් මෙහි ක්‍ෂණ වර්තමාන වශයෙන් වර්තමාන ව්‍යවහාරය නොගෙන වෙන ආකාරයකින් ගතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "කෙසේද? අප්‍රහීන වශයෙන්. අප්‍රහීන බව සඳහා මෙය පවතී යයි වර්තමාන ව්‍යවහාරයෙහි කියන ලදි. ක්‍ෂණ පච්චුප්පන්න භාවයෙන් නොවේ. යම්හෙයකින් අප්‍රහීන බව සඳහා කියන ලදි. එහෙයින් යමෙකුගේ කාමරාග අනුසය පවතීද ඔහුගේ පටිඝානුසය පවතීදැයි ඇසීමෙන් යමෙකුගේ කාමරාග අනුසය අප්‍රහීන වූයේ අනුප්ප්‍රාප්ති ධර්මතා ඉදිරිපත් නොවේ. ඔහුගේ පටිඝානුසයද අප්‍රහීන යයි මෙසේ අර්ථ වේයයි දැකිය යුතුය. යම්හෙයකින් ඒවායින් යමෙකුගේ එකක් අප්‍රහීනද ඔහුගේ ඉතිරි ඒවාද අප්‍රහීනම වේ. එහෙයින් ‘ආමන්තා’ යයි කියන ලදි. ඉදින් මෙසේ යමක් ඉහළ උපදින වාරයේ යමෙකුගේ කාමරාග අනුසය උපදීද ඔහුගේ පටිඝානුසය උපදීදැයි අසා ‘ආමන්තා’ යයි කියන ලදි. එහි අර්ථය කෙසේ ගතයුතු වේද? එහි ද අප්‍රහීන වශයෙන් ම උත්පත්ති ප්‍රත්‍යය ඇතිකල්හි උපතින් නො වැළැක්වීම් වශයෙන් හෝ. චිත්ත කර්මාදිය අරඹා නිමානොවූ කර්මාන්ත ඇත්තේ චිත්‍ර කාරාදීහු ඒ කර්මාන්තවල නොකරන ක්‍ෂණයෙහි ද මිතුරු සුහදයන් විසින් දුටු දුටු තැන්වල මේ දවස්වල කුමක් කරවුදැයි කියන ලදි. චිත්‍ර කර්මය කරමු. වඩුවැඩ කරමු යයි කියති. ඔව්හු ඒ අවස්ථාවේ (කළණයේ) කිසිවක් නොකරති. අවිච්ඡින්න කර්මාන්තභාවය වනාහි කළ ක්‍ෂණය ද කළයුතු කළණයද ගෙන කෙරෙතිම යයි වේ. එසේම යමෙකුගේ සන්තානයෙහි අනුසයෝ අප්‍රහීන ද යමෙකුගේ වනාහි හෝ ඔහුගේ සන්තානයෙහි උත්පත්ති ප්‍රත්‍ය ඇතිකල්හි උපත නොවළක්වන ලදි. එහි නූපදින ක්‍ෂණයෙහි ද ඉපදීමෙන් පෙරද කාල අතරෙහි ඉපදීමද ගෙන යමෙකුගේ කාමරාගානුසය උපදීද ඔහුගේ පටිඝානුසය ඉපදීම වේයයි මෙසේ අර්ථය දතයුතුය. මෙයින් පසුවද මෙබඳු වූ විසඳුම්වල මෙම නයම වේ. **නො ච තස්ස** මෙය අනාගාමීහුගේ කාමරාග ව්‍යාපාදවල ඉතිරි නැතිව ප්‍රහීන බව කියන ලදි. **තිණ්ණං පුග්ගලානං **පුථුක්ජන, සෝවාන්, සකදාගාමි. **ද්වින්නං පුග්ගලානං** සෝවාන් සකදාගාමි දෙදෙනා පසුවද මෙබඳු රූප තැන්වල මෙම නයම වේ."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 59,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඔකාසවාරස්ස පඨමදුතියපුච්ඡාසු යස්මා කාමරාගානුසයො කාමධාතුයා ද්වීසු වෙදනාසු අනුසෙති, පටිඝානුසයො දුක්ඛවෙදනාය; තස්මා **‘නො’**ති පටිසෙධො කතො. තතියපුච්ඡායං උභින්නම්පි කාමධාතුයා ද්වීසු වෙදනාසු අනුසයනතො **‘ආමන්තා’**ති පටිවචනං දින්නං. රූපධාතුඅරූපධාතුයා පන මානානුසයස්ස කාමරාගානුසයෙන සද්ධිං අසාධාරණං උප්පත්තිට්ඨානං. තස්මා **නො ච තත්ථ කාමරාගානුසයො**ති වුත්තං. ඉමිනා නයෙන සබ්බෙසං උප්පත්තිට්ඨානවාරං ඔලොකෙත්වා සාධාරණාසාධාරණං උප්පත්තිට්ඨානං වෙදිතබ්බං."
                    },
                    {
                        "type": "paragraph",
                        "text": "දුකමූලකපුච්ඡායං යස්මා කාමරාගපටිඝානුසයා නාපි එකස්මිං ඨානෙ උප්පජ්ජන්ති, න එකං ධම්මං ආරම්මණං කරොන්ති, තස්මා **නත්ථී**ති පටික්ඛෙපො කතො. අයඤ්හෙත්ථ අධිප්පායො. යස්මිං ඉමෙ ද්වෙ අනුසයා අනුසයෙය්යුං, තං ඨානමෙව නත්ථි. තස්මා “කත්ථ මානානුසයො අනුසෙතී”ති අයං පුච්ඡා අපුච්ඡායෙවාති. අඤ්ඤෙසුපි එවරූපෙසු එසෙව නයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුග්ගලොකාසවාරෙ **චතුන්න**න්ති පුථුජ්ජනසොතාපන්නසකදාගාමිඅනාගාමීනං."
                    },
                    {
                        "type": "paragraph",
                        "text": "පටිලොමනයෙ **යස්ස කාමරාගානුසයො නානුසෙතී**ති අයං පුච්ඡා අනාගාමිං ගහෙත්වා පුච්ඡති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ද්වින්නං පුග්ගලානං සබ්බත්ථ කාමරාගානුසයො නානුසෙතී**ති අනාගාමිඅරහන්තානං. **කාමධාතුයා තීසු වෙදනාසූ**ති ච වෙදනාග්ගහණෙන වෙදනාසම්පයුත්තකානම්පි තෙසං වත්ථාරම්මණානම්පීති සබ්බෙසම්පි කාමාවචරධම්මානං ගහණං වෙදිතබ්බං. අයං අනුසයවාරෙ විනිච්ඡයකථා."
                    },
                    {
                        "type": "centered",
                        "text": "අනුසයවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සානුසයවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සානුසයවාරෙ පන **යො කාමරාගානුසයෙන සානුසයො**ති යථා එකන්තරිකජරාදිරොගෙන ආබාධිකො යාව තම්හා රොගා න මුච්චති, තාව තස්ස රොගස්ස අනුප්පත්තික්ඛණෙපි සරොගොයෙව නාම හොති. එවං සසංකිලෙසස්ස වට්ටගාමිසත්තස්ස යාව අරියමග්ගෙන අනුසයා සමුග්ඝාතං න ගච්ඡන්ති, තාව තෙසං අනුසයානං අනුප්පත්තික්ඛණෙපි සානුසයොයෙව නාම හොති. එවරූපං සානුසයතං සන්ධාය **‘ආමන්තා’**ති වුත්තං. සෙසමෙත්ථ අනුසයවාරසදිසමෙව."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඔකාසවාරෙ පන “රූපධාතුයා අරූපධාතුයා එත්ථ මානානුසයෙන සානුසයො”ති වුත්තෙ තාසු ධාතූසු පුග්ගලස්ස සානුසයතා පඤ්ඤායෙය්ය, අනුසයස්ස උප්පත්තිට්ඨානං න පඤ්ඤායෙය්ය. අනුසයස්ස ච උප්පත්තිට්ඨානදස්සනත්ථං අයං වාරො ආරද්ධො, තස්මා **තතො මානානුසයෙන සානුසයො**ති වුත්තං. එවඤ්හි සති තතො ධාතුද්වයතො උප්පන්නෙන මානානුසයෙන සානුසයොති අනුසයස්ස උප්පත්තිට්ඨානං දස්සිතං හොති. ඉමස්ස පන පඤ්හස්ස අත්ථෙ අවුත්තෙ ආදිපඤ්හස්ස අත්ථො පාකටො න හොතීති පඨමං න වුත්තො, තස්මා සො එවං වෙදිතබ්බො. **යතො කාමරාගානුසයෙනා**ති යතො උප්පන්නෙන කාමරාගානුසයෙන සානුසයො, කිං සො තතො උප්පන්නෙන පටිඝානුසයෙනපි සානුසයොති? යස්මා පනෙතෙ ද්වෙ එකස්මා ඨානා නුප්පජ්ජන්ති; තස්මා “නො”ති පටිසෙධො කතො. **අරහා සබ්බත්ථා**ති අරහා සබ්බධම්මෙසු උප්පජ්ජනකෙන කෙනචි අනුසයෙන නිරානුසයොති. ඉමිනා අත්ථවසෙන නිප්පදෙසට්ඨානෙසු භුම්මවචනමෙව කතන්ති. ඉමිනා උපායෙන සබ්බත්ථ අත්ථවිනිච්ඡයො වෙදිතබ්බොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඕකාස වාරයේ පළමු දෙවන පුච්ඡාවල යම්සේ කාමරාගානුසය කාමධාතුවේ (ලෝකයේ) වේදනා දෙකක පවතී. පටිඝානුසය දුක්වේදනාවේ. එහෙයින් ‘නො’ යයි ප්‍රතිසේධ කරන ලදි. තුන්වන පුච්ඡාවෙහි දෙකද කාමධාතුවේ වේදනා දෙකහෙි පැවතීමෙන්. **ආමත්තා** යයි ප්‍රතිවචනය දෙන ලදි. රූපධාතු අරූප ධාතු වනාහි මාන අනුසයේ කාමරාග අනුසය සමග අසාධාරණ උත්පත්ති ස්ථාන වේ. එහෙයින් **නො ච තත්‍ථ කාමරාගානුසයො** යයි කියන ලදි. මෙම නයින් සියල්ලේ උත්පත්ති ස්ථාන වාරය බලා සාධාරණ අසාධාරණ උත්පත්ති ස්ථාන දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "දුක මූලක පුච්ඡාවෙහි යම්හෙයකින් කාමරාග පටිඝානුසය එක එක තැන්වල නූපදී. එක ධර්මයක් අරමුණු නො කරයි. එහෙයින් නත්‍ථි යයි ප්‍රතික්‍ෂෙප කරන ලදි. එහි අදහස් මෙසේය. යම්සේ මේ අනුසය දෙක පවතින්නේ නම් ඒ ස්ථානයම නැත. එහෙයින් මාන අනුසය පවතී යයි මේ පුච්ඡා අපුච්ඡා වේමය. (ඇසීමක් නොවේ යන අර්ථයයි.) අනිත් මෙබඳු රූප තැන්වල මෙම නයම වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුග්ගල ඔකාස වාරයෙහි **චතුන්නං** පෘථග්ජන, සෝවාන්, සකදාගාමි, අනාගාමි"
                    },
                    {
                        "type": "paragraph",
                        "text": "පටිලෝම නයෙහි **යස්ස කාමරාගානුසයො නානුසෙති **මේ පුච්ඡාව අනාගාමියා ගෙන අසයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ද්වින්නං පුග්ගලානං සබ්බත්‍ථ කාමරාගානුසයො නානුස්සති** අනාගාමි, අරහතුන්ගේ. **කාමධාතුයා තීසු වෙදනාසු** වේදනාව ගැනීමෙන් වේදනා සම්ප්‍රයුක්තයන්ගේ ද ඒවායේ වස්තු අරමුණු ද යන සියළු කාමාවචර ධර්මවල ගැනීම දතයුතුය."
                    },
                    {
                        "type": "centered",
                        "text": "මේ අනුසයවාර විනිශ්චය කථා නිමි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සානුසයවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "සානුසය වාරයෙහි වනාහි **කාමරාගානුසයෙන සානුසයො** යයි යම්සේ ඒකන්තරික ජරාදි රෝගයෙන් ආබාධිතව යම්තාක් ඒ රෝගයෙන් නොමිදේ ද ඒතාක් ඔහුගේ රෝගයේ අනුප්පත්ති ක්‍ෂණයෙහි ද රෝග සහිත වූයේ නම් වේ. මෙසේ කෙලෙස් සහිත වූ සසරගාමි සත්ත්වයාගේ ආර්ය මාර්ගයෙන් අනුසය ඉවත්කරන තුරු ඒ අනුසයන්ගේ උප්පත්ති ක්‍ෂණයෙහි ද සානුසයම නම් වේ. මෙබඳු රූප වූ සානුසය බව සඳහා ආමන්තා යයි කියන ලදි. මෙහි සෙස්ස අනුසයවාර හා සමාන වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඔකාස වාරයෙහි වනාහි **රූපධාතුයා අරූපධාතුයා එත්‍ථ මානානුසයෙන සානුසයො** යයි කියන ලද්දේ ඒ ධාතුවල පුද්ගලයාගේ අනුසය සහිත බව පෙනෙන්නේය. අනුසයේ උත්පත්ති ස්ථානය නො පෙනෙන්නේය. අනුසයේ උත්පත්ති ස්ථානය දැකීම සඳහා මේ වාරය අරඹන ලදි. එහෙයින් එයින් **මානානුසයෙන සානුසයො** යයි කියන ලදි. මෙසේ ඇතිකල්හි ඒ ධාතු දෙකින් උපන් මාන අනුසයෙන් සානුසය යයි අනුසයේ උපන් ස්ථානය දක්වන ලද්දේ වේ. මේ ප්‍රශ්නයේ අර්ථය නොකියන ලද කල්හි මුල් ප්‍රශ්නයේ අර්ථය ප්‍රකට නොවේ යයි පළමුව නොකියන ලදි. එහෙයින් එය මෙසේ දතයුතුය. **යතො කාමරාගානුසයෙන** යමකින් උපන් කාමරාගානුසයෙන් සානුසය වේ. කිම එය එයින් උපන් පටිඝ අනුසයෙන් ද සානුසය වේද? යම්හෙයකින් ඒ දෙක එකම තැනින් නූපදී. එහෙයින් **නො** යයි ප්‍රතිසෙධ කරන ලදි. අරහා **සබ්බත්‍ථා** සුදුසු සියළු ධර්මවල උපදින්නා විසින් කිසියම් අනුසයෙන් නිරනුසය වේ. මෙයින් අර්ථ වශයෙන් සියළු තැන්වල සත්තමී විභත්තියම යොදන ලදි. මෙම උපායෙන් සියළු අර්ථ විනිශ්චය දතයුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 61,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "සානුසයවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පජහනවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "පජහනවාරෙ **පජහතී**ති තෙන තෙන මග්ගෙන පහානපරිඤ්ඤාවසෙන පජහති, ආයතිං අනුප්පත්තිධම්මතං ආපාදෙති. **ආමන්තා**ති අනාගාමීමග්ගට්ඨං සන්ධාය පටිවචනං. **තදෙකට්ඨං පජහතී**ති පහානෙකට්ඨතං සන්ධාය වුත්තං. **නො**ති අරහත්තමග්ගට්ඨං සන්ධාය පටිසෙධො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යතො කාමරාගානුසයං පජහතී**ති යතො උප්පජ්ජනකං කාමරාගානුසයං පජහතීති අත්ථො. **අට්ඨමකො**ති අරහත්තඵලට්ඨතො පට්ඨාය පච්චොරොහනගණනාය ගණියමානො සොතාපත්තිමග්ගට්ඨො අට්ඨමකො නාම. දක්ඛිණෙය්යගණනාය හි අරහා අග්ගදක්ඛිණෙය්යත්තා පඨමො, අරහත්තමග්ගට්ඨො දුතියො, අනාගාමී තතියො…පෙ… සොතාපත්තිමග්ගට්ඨො අට්ඨමො. සො ඉධ “අට්ඨමකො”ති වුත්තො. නාමසඤ්ඤායෙව වා එසා තස්සාති. **අනාගාමිමග්ගසමඞ්ගිඤ්ච අට්ඨමකඤ්ච ඨපෙත්වා අවසෙසා**ති සද්ධිං පුථුජ්ජනෙන සෙක්ඛාසෙක්ඛා. තෙසු හි පුථුජ්ජනො පහානපරිඤ්ඤාය අභාවෙන නප්පජහති. සෙසා තෙසං අනුසයානං පහීනත්තා. **ද්වින්නං මග්ගසමඞ්ගීන**න්ති ද්වෙ මග්ගසමඞ්ගිනො ඨපෙත්වාති අත්ථො. ඉමිනා නයෙන සබ්බත්ථ විනිච්ඡයො වෙදිතබ්බොති."
                    },
                    {
                        "type": "centered",
                        "text": "පජහනවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරිඤ්ඤාවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "පරිඤ්ඤාවාරෙ **පරිජානාතී**ති තීහි පරිඤ්ඤාහි පරිජානාති. සෙසමෙත්ථ හෙට්ඨා වුත්තනයමෙව. අයම්පි හි වාරො පජහනවාරො විය මග්ගට්ඨානඤ්ඤෙව වසෙන විස්සජ්ජිතොති."
                    },
                    {
                        "type": "centered",
                        "text": "පරිඤ්ඤාවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පහීනවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "පහීනවාරෙ ඵලට්ඨවසෙනෙව දෙසනා ආරද්ධා. අනාගාමිස්ස හි උභොපෙතෙ අනුසයා පහීනා, තස්මා “ආමන්තා”ති වුත්තං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඔකාසවාරෙ **යත්ථ කාමරාගානුසයො පහීනො තත්ථ පටිඝානුසයො පහීනො**ති පුච්ඡිත්වා **න වත්තබ්බො පහීනොති වා අප්පහීනොති වා**ති වුත්තං තං කස්මාති? උප්පත්තිට්ඨානස්ස අසාධාරණත්තා. අඤ්ඤං හි කාමරාගානුසයස්ස උප්පත්තිට්ඨානං, අඤ්ඤං පටිඝානුසයස්ස. අභාවිතමග්ගස්ස ච යත්ථ අනුසයො උප්පජ්ජති, මග්ගෙ භාවිතෙ තත්ථෙව සො පහීනො නාම හොති . තත්ථ යස්මා නෙව කාමරාගානුසයට්ඨානෙ පටිඝානුසයො උප්පජ්ජති, න පටිඝානුසයට්ඨානෙ කාමරාගානුසයො, තස්මා තත්ථ සො පහීනොති වා අප්පහීනොති වා න වත්තබ්බො. සො හි යස්මිං අත්තනො උප්පත්තිට්ඨානෙ කාමරාගානුසයො පහීනො, තස්මිං අප්පහීනත්තා තත්ථ පහීනොති න වත්තබ්බො. යං කාමරාගානුසයස්ස උප්පත්තිට්ඨානං, තස්මිං අට්ඨිතත්තා තත්ථ අප්පහීනොති න වත්තබ්බො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "සානුසය වාර කථා නිමි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පජහනවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දුරුකරන වාරයෙහි **පජහති** ඒ ඒ මගින් ප්‍රහාන පරිඤ්ඤා වශයෙන් දුරුකරයි. ඉදිරියේ අනුත්පත්ති ධර්මතාවට පමුණුවයි. **ආමන්තා** යයි අනාගාමි මාර්ගස්ථයා සඳහා ප්‍රතිවචනයයි. **තදෙකට්ඨං පජහති** ප්‍රහානයෙහි කාෂ්ඨභාවය සඳහා කියන ලදි. **නො** යයි අරහත් මාර්ගස්ථාන සඳහා ප්‍රතිසේධය."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යතො කාමරාග අනුසයං පජහති** යමකින් ඉපදෙන කාමරාග අනුසය දුරුකරයි යන අර්ථය වේ. **අට්ඨමකො** අරහත් ඵලයේ සිට ප්‍රති ආරෝහන ගණනින් ගණන් ගන්නේ සෝවාන් මාර්ගස්ථයා අට්ඨමකු නම් වේ. දක්‍ෂණෙය්‍ය ගණනින් රහතන් වහන්සේ අග්‍ර දක්ඛිණෙය්‍ය බැවින් පළමුවැන්නාය. අරහත්ත මාර්ගස්ථයා දෙවැන්නාය. අනාගාමි තුන්වැන්නාය. සෝවාන් මාර්ගස්ථයා අටවැන්නාය. හේ මෙහි අට්ඨමකයයි කියන ලදි. ඔහුට මේ නාම සංඥාවක් වේ. **අනාගාමි මග්ග සමංගිඤ්ච අට්ඨමකඤ්ච ඨපෙත්‍වා අවසෙසා **යයි පෘථග්ජනයා සමග සේක අසේකයෝ. ඔවුනතුරෙන් පෘථග්ජනයා ප්‍රහාන පරිඤ්ඤාව නොමැති වීමෙන් දුරු නොකරයි. සෙස්සෝ ඔවුන්ගේ අනුශායවල ප්‍රහීන බැවින්. **ද්වින්නං මග්ග සමංගිනං** යුක්ත වූ මාර්ග දෙක හැර යන අර්ථයයි. මෙම නයින් සියලු තැන විනිශ්චය දතයුතුය."
                    },
                    {
                        "type": "centered",
                        "text": "පජහනවාර කථා නිමි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරිඤ්ඤාවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "පරිඤ්ඤාවාරයෙහි **පරිජානාති** යයි පරිඤ්ඤා තුනකින් දැනගනී. මෙහි සෙස්ස යට කියන ලද නයම වේ. මෙම වාරය ද වනාහි පජහන වාරය මෙන් මාර්ග ස්ථාන වශයෙන් ම විසඳන ලදි."
                    },
                    {
                        "type": "centered",
                        "text": "පරිඤ්ඤාවාර කථා නිමි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පහීනවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ප්‍රහීන වාරයෙහි ඵලස්ථ වශයෙන් ම දේශනාව අරඹන ලදි. අනාගාමියාට මේ අනුශය දෙකම ප්‍රහීනය. එහෙයින් **ආමන්තා** යයි කියන ලදි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඕකාස වාරයෙහි **යත්‍ථ කාමරාගානුසයො පහීනො තත්‍ථ පටිඝානුසයො පහීනොති පුච්ඡිත්‍වා න වත්තබ්බො පහීනොති වා අප්පහීනොති වා** යයි කියන ලදි. එය කුමක් නිසාද? උපන් ස්ථානයේ අසාධාරණ බැවිනි. කාමරාගානුසයේ උපන් තැන අන් තැනකය. පටිඝානුසයේ අන්තැනකය. අභාවිත මාර්ගයේ ද යම්තැන අනුසය උපදී. එහිම භාවිත මාර්ගයෙහි එය ප්‍රහීන නම් වේ. එහි යම්හෙයකින් කාමරාග අනුසය ස්ථානයෙහි පටිඝානුසය නො උපදී. පටිඝ අනුසය ස්ථානයෙහි කාමරාගානුසය නූපදී. එහෙයින් එහි එය ප්‍රහීන හෝ අප්‍රහීන හෝ යයි නොකිව යුතුය. එය තමාගේ උපන් ස්ථානයෙහි කාමරාග අනුසය ප්‍රහීන වේ. එහි අප්‍රහීන බැවින් එහි ප්‍රහීන යයි නොකිව යුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 63,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**යත්ථ කාමරාගානුසයො පහීනො, තත්ථ මානානුසයො පහීනො**ති එත්ථ පන සාධාරණට්ඨානං සන්ධාය ආමන්තාති වුත්තං. කාමරාගානුසයො හි කාමධාතුයා ද්වීසු වෙදනාසු අනුසෙති. මානානුසයො තාසු චෙව රූපාරූපධාතූසු ච. සො ඨපෙත්වා අසාධාරණට්ඨානං සාධාරණට්ඨානෙ තෙන සද්ධිං පහීනො නාම හොති. තස්මා ‘ආමන්තා’ති වුත්තං. ඉමිනා නයෙන සබ්බස්මිම්පි ඔකාසවාරෙ පහීනතා ච නවත්තබ්බතා ච වෙදිතබ්බා. ‘නත්ථී’ති ආගතට්ඨානෙසු පන හෙට්ඨා වුත්තසදිසොව විනිච්ඡයො. පුග්ගලොකාසවාරො, ඔකාසවාරගතිකොයෙව."
                    },
                    {
                        "type": "paragraph",
                        "text": "පටිලොමනයෙ **යස්ස කාමරාගානුසයො අප්පහීනො**ති පුථුජ්ජනසොතාපන්නසකදාගාමිවසෙන පුච්ඡති. කිඤ්චාපි හි ඉමෙ ද්වෙ අනුසයා පුථුජ්ජනතො පට්ඨාය යාව අනාගාමිමග්ගට්ඨා ඡන්නං පුග්ගලානං අප්පහීනා. ඉධ පන පරතො “තිණ්ණං පුග්ගලානං ද්වින්නං පුග්ගලාන”න්තිආදිවචනතො මග්ගට්ඨා අනධිප්පෙතා, තස්මා පුථුජ්ජනසොතාපන්නසකදාගාමිනොව සන්ධාය ‘ආමන්තා’ති වුත්තං. **ද්වින්නං පුග්ගලාන**න්ති සොතාපන්නසකදාගාමීනං. ඉමිනා නයෙන පුග්ගලවාරෙ විනිච්ඡයො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඔකාසවාරපුග්ගලොකාසවාරා පන හෙට්ඨා වුත්තනයෙනෙව වෙදිතබ්බාති."
                    },
                    {
                        "type": "centered",
                        "text": "පහීනවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උප්පජ්ජනවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "උප්පජ්ජනවාරො අනුසයවාරසදිසොයෙව."
                    },
                    {
                        "type": "heading",
                        "text": "ධාතුපුච්ඡාවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ධාතුවාරස්ස පුච්ඡාවාරෙ තාව **කති අනුසයා අනුසෙන්තී**ති කති අනුසයා සන්තානං අනුගතා හුත්වා සයන්ති. **කති අනුසයා නානුසෙන්තී**ති කති අනුසයා සන්තානං න අනුගතා හුත්වා සයන්ති. **කති අනුසයා භඞ්ගා**ති කති අනුසයා අනුසෙන්ති නානුසෙන්තීති එවං විභජිතබ්බාති අත්ථො. සෙසමෙත්ථ යං වත්තබ්බං සියා, තං හෙට්ඨා පාළිවවත්ථානෙ වුත්තමෙව."
                    },
                    {
                        "type": "heading",
                        "text": "ධාතුවිස්සජ්ජනාවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "නිද්දෙසවාරෙ පනස්ස **කස්සචි සත්ත අනුසයා අනුසෙන්තී**ති පුථුජ්ජනවසෙන වුත්තං. **කස්සචි පඤ්චා**ති සොතාපන්නසකදාගාමිවසෙන වුත්තං. තෙසඤ්හි දිට්ඨානුසයො ච විචිකිච්ඡානුසයො ච පහීනාති පඤ්චෙව අනුසෙන්ති. තත්ථ යථා අනුසයවාරෙ “අනුසෙන්තී”ති පදස්ස උප්පජ්ජන්තීති අත්ථො ගහිතො, එවමිධ න ගහෙතබ්බො. කස්මා? තස්මිං ඛණෙ අනුප්පජ්ජනතො. කාමධාතුං උපපජ්ජන්තස්ස හි විපාකචිත්තඤ්චෙව කම්මසමුට්ඨානරූපඤ්ච උප්පජ්ජති, අකුසලචිත්තං නත්ථි. අනුසයා ච අකුසලචිත්තක්ඛණෙ උප්පජ්ජන්ති, න විපාකචිත්තක්ඛණෙති තස්මිං ඛණෙ අනුප්පජ්ජනතො තථා අත්ථො න ගහෙතබ්බො. කථං පන ගහෙතබ්බොති? යථා ලබ්භති තථා ගහෙතබ්බො. කථඤ්ච ලබ්භති? අප්පහීනට්ඨෙන. යථා හි රාගදොසමොහානං අප්පහීනත්තා. කුසලාබ්යාකතචිත්තසමඞ්ගී පුග්ගලො “සරාගො සදොසො සමොහො”ති වුච්චති, එවං මග්ගභාවනාය අප්පහීනත්තා පටිසන්ධික්ඛණෙපි තස්ස තස්ස පුග්ගලස්ස තෙ තෙ අනුසයා අනුසෙන්තීති වුච්චන්ති. න කෙවලඤ්ච වුච්චන්ති, අප්පහීනත්තා පන තෙ අනුසෙන්තියෙව නාමාති වෙදිතබ්බා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කාමරාගානුසයේ උපන් ස්ථානය යම්තැනක ද එහි සිටි බැවින් එහි අප්‍රහීන යයි නොකිව යුතුය. **යත්‍ථ කාමරාගානුසයො පහීනො තත්‍ථ මානානුසයො පහීනොති** මෙහි වනාහි සාධාරණ ස්ථානයන් සඳහා **ආමන්තා** යයි කියන ලදි. කාමරාගානුසය වනාහි කාම ධාතුවේ වේදනා දෙකක පවතී. මානානුසය ඒවායෙහි මෙන්ම රූපාරූප ධාතුවල (රූප අරූප ලෝක) ද පවතී. එය අසාධාරණ ස්ථාන හැර සාධාරණ ස්ථානයේ එය සමග ප්‍රහීන වේ. එහෙයින් **ආමන්තා** යයි කියන ලදි. මෙම නයින් සියළු ඕකාස වාරයෙහි ප්‍රහීන බවද නොකිව යුතු බවද දතයුතුය. **නත්‍ථි** යයි ආ තැන්වල වනාහි යට කියන ලද සමානව විනිශ්චය වේ. පුග්ගලොකාසවාරය ඔකාසවාර ගතිකම වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "පටිලෝම නයෙහි **යස්ස කාමරාගානුසයො අප්පහීනො** පුථුජ්ජන, සෝතාපන්න, සකදාගාමි වශයෙන් අසයි. මේ අනුසය දෙකම පෘථග්ජනයාගේ සිට අනාගාමි මාර්ගස්ථයා දක්වා පුද්ගලයන් සදෙනාගේ අප්‍රහීනය. මෙහි වනාහි අන්‍ය වූ ‘පුද්ගලයන් තිදෙනාගේ, පුද්ගලයන් දෙදෙනාගේ’ යන ආදි වචනයෙන් මාර්ගස්ථයා අදහස් නො කෙරේ. එහෙයින් පෘථග්ජන සෝවාන් සකදාගාමින් සඳහා **ආමන්තා** යයි කියන ලදි. **ද්වින්නං පුග්ගලානං** සෝවාන් සකදාගාමි දෙදෙනාගේ මෙම නයින් පුද්ගල වාරයෙහි විනිශ්චය දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඔකාසවාර පුග්ගලොකාසවාර වනාහි යට කියන ලද නයින්ම දතයුතුය."
                    },
                    {
                        "type": "centered",
                        "text": "පහීන වාර කථා නිමි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උප්පජ්ජනවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "උප්පජ්ජනවාරය අනුසය වාරය හා සමාන වේමය."
                    },
                    {
                        "type": "heading",
                        "text": "ධාතුපුච්ඡාවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ධාතුවාරයේ පුච්ඡාවාරයෙහි **කති අනුසයා අනුසෙන්ති** අනුසය කීයක් සත්ත්වයින්ට අනුගතව පවතීද **කති අනුසයා නානුසෙන්ති** අනුසය කීයක් සත්ත්වයින්ට අනුගත නැතිව නොපවතීද, **කති අනුසයා භංගාති** අනුසය කීයක් පවතීද, නොපවතීදැයි මෙසේ බෙදිය යුතුය යන අර්ථය වේ. මෙහි කිවයුතු සෙසු යමක් වේ නම් එය යට පෙළ නියමයෙහි කියන ලදමය."
                    },
                    {
                        "type": "heading",
                        "text": "ධාතුවිස්සජ්ජනාවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "නිද්දේස වාරයේ වනාහි **කස්සචි සත්ත අනුසයා අනුසෙන්ති** යයි පෘථග්ජන වශයෙන් කියන ලදි. **කස්සචි පඤ්චාති** යයි සොතාපන්න සකදාගාමි වශයෙන් කියන ලදි. ඔවුන්ගේ වනාහි දිට්ඨ අනුසය සහ විචිකිච්ඡා අනුසය ප්‍රහීන යයි පහක්ම පවතී. එහි යම්සේ අනුසය වාරයෙහි පවතී යයි යන පදයේ උපදී යයි යන අර්ථය ගන්නා ලදි. මෙසේ මෙහි නොගත යුතුය. කුමක් හෙයින්ද? ඒ ක්‍ෂණයෙහි නූපදීම් වශයෙනි. කාමධාතුවේ උපදින්නාට විපාක සිත මෙන්ම කම්ම සමුට්ඨාන රූපද උපදී. අකුසල සිත නැත. අනුසය ද අකුසල චිත්ත ක්‍ෂණයෙහි උපදී. විපාක චිත්තක්‍ෂණයෙහි නොවේ යයි ඒ ක්‍ෂණයෙහි නො ඉපදීම් වශයෙන් එසේ අර්ථ නොගත යුතුය. කෙසේ නම් ගතයුතුද? යම්සේ ලබයිද එසේ ගතයුතුය. කෙසේ ලබයිද? අප්‍රහීනාර්ථයෙන්. යම්සේ ලබයිද එසේ ගතයුතුය. කෙසේ ලබයිද? අප්‍රහීනාර්ථයෙන්. යම්සේ රාග දෝස මෝහ අප්‍රහීන බව. කුසල අබ්‍යාකත චිත්ත සමංගි පුද්ගලයා රාග සහිත දෝස සහිත මෝහ සහිත යයි කියනු ලැබේ. මෙසේ මාර්ග භාවනාවෙන් අප්‍රහීන වූ බැවින් ප්‍රතිසන්ධි ක්‍ෂණයෙහි ඒ ඒ පුද්ගලයන්ට ඒ ඒ අනුසයෝ පවතිත් යයි කියති. කේවලව නො කියති. අප්‍රහීන බැවින් ඒවා පවතී යයි දතයුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 65,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**අනුසයා භඞ්ගා නත්ථී**ති යස්ස හි යො අනුසෙති, සො අනුසෙතියෙව; යො නානුසෙති, සො නානුසෙතියෙව. අයං අනුසෙති ච නානුසෙති ච, අයං සියා අනුසෙති සියා නානුසෙතීති, එවං විභජිතබ්බො අනුසයො නාම නත්ථි. **රූපධාතුං උපපජ්ජන්තස්ස කස්සචි තයො**ති අනාගාමිවසෙන වුත්තං. තස්ස හි කාමරාගපටිඝදිට්ඨිවිචිකිච්ඡානුසයා චත්තාරොපි අනවසෙසතො පහීනා. ඉතරෙ තයොව අප්පහීනා. තෙන වුත්තං – “කස්සචි තයො අනුසයා අනුසෙන්තී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**න කාමධාතු**න්ති කාමධාතුයා පටිසිද්ධත්තා සෙසා ද්වෙ ධාතුයො උපපජ්ජන්තස්සාති අත්ථො. **සත්තෙ වා**ති යස්මා අරියසාවකස්ස රූපධාතුයා චුතස්ස කාමධාතුයං උපපත්ති නාම නත්ථි, පුථුජ්ජනස්සෙව හොති, තස්මා සත්තෙවාති නියමෙත්වා වුත්තං. “අරූපධාතුයා චුතස්ස කාමධාතුං උපපජ්ජන්තස්ස සත්තෙවා”ති එත්ථාපි එසෙව නයො. **රූපධාතුයා උපපත්ති නත්ථී**ති කස්මා නත්ථි? උපපත්තිනිප්ඵාදකස්ස රූපාවචරජ්ඣානස්ස අභාවා. සො හි සබ්බසො රූපසඤ්ඤානං සමතික්කමා තං ධාතුං උපපන්නොති නාස්ස තත්ථ රූපාවචරජ්ඣානං අත්ථි. තදභාවා රූපධාතුයං උපපත්ති නත්ථීති වෙදිතබ්බා. **අරූපධාතුයා චුතස්ස න කාමධාතු**න්ති එත්ථ අරූපධාතුයෙව අධිප්පෙතා. ඉමිනා නයෙන සබ්බවිස්සජ්ජනෙසු අත්ථො වෙදිතබ්බොති."
                    },
                    {
                        "type": "centered",
                        "text": "ධාතුවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "අනුසයයමකවණ්ණනා නිට්ඨිතා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "8. චිත්තයමකං",
                        "level": 4
                    },
                    {
                        "type": "heading",
                        "text": "උද්දෙසවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදානි තෙසඤ්ඤෙව මූලයමකෙ දෙසිතානං කුසලාදිධම්මානං ලබ්භමානවසෙන එකදෙසමෙව සඞ්ගණ්හිත්වා අනුසයයමකානන්තරං දෙසිතස්ස චිත්තයමකස්ස අත්ථවණ්ණනා හොති. තත්ථ පාළිවවත්ථානං තාව වෙදිතබ්බං. ඉමස්මිඤ්හි චිත්තයමකෙ මාතිකාඨපනං, ඨපිතමාතිකාය විස්සජ්ජනන්ති ද්වෙ වාරා හොන්ති. තත්ථ මාතිකාඨපනෙ පුග්ගලවාරො, ධම්මවාරො, පුග්ගලධම්මවාරොති ආදිතොව තයො සුද්ධිකමහාවාරා හොන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ථ “යස්ස චිත්තං උප්පජ්ජති, න නිරුජ්ඣතී”ති එවං පුග්ගලවසෙන චිත්තස්ස උප්පජ්ජනනිරුජ්ඣනාදිභෙදං දීපෙන්තො ගතො පුග්ගලවාරො නාම. “යං චිත්තං උප්පජ්ජති, න නිරුජ්ඣතී”ති එවං ධම්මවසෙනෙව චිත්තස්ස උප්පජ්ජනනිරුජ්ඣනාදිභෙදං දීපෙන්තො ගතො ධම්මවාරො නාම. “යස්ස යං චිත්තං උප්පජ්ජති, න නිරුජ්ඣතී”ති එවං උභයවසෙන චිත්තස්ස උප්පජ්ජනනිරුජ්ඣනාදිභෙදං දීපෙන්තො ගතො පුග්ගලධම්මවාරො නාම. තතො “යස්ස සරාගං චිත්ත”න්ති සොළසන්නං පදානං වසෙන අපරෙ සරාගාදිපදවිසෙසිතා සොළස පුග්ගලවාරා, සොළස ධම්මවාරා, සොළස පුග්ගලධම්මවාරාති අට්ඨචත්තාලීසං මිස්සකවාරා හොන්ති. තෙ සරාගාදිපදමත්තං දස්සෙත්වා සඞ්ඛිත්තා. තතො “යස්ස කුසලං චිත්ත”න්තිආදිනා නයෙන ඡසට්ඨිද්විසතසඞ්ඛානං අභිධම්මමාතිකාපදානං වසෙන අපරෙ කුසලාදිපදවිසෙසිතා ඡසට්ඨිද්විසතපුග්ගලවාරා, ඡසට්ඨිද්විසතධම්මවාරා ඡසට්ඨිද්විසතපුග්ගලධම්මවාරාති අට්ඨනවුතිසත්තසතා මිස්සකවාරා හොන්ති. තෙපි කුසලාදිපදමත්තං දස්සෙත්වා සඞ්ඛිත්තායෙව. යානිපෙත්ථ සනිදස්සනාදීනි පදානි චිත්තෙන සද්ධිං න යුජ්ජන්ති, තානි මොඝපුච්ඡාවසෙන ඨපිතානි."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**අනුසයා භංගානං** යයි යමෙකුගේ යම් අනුසයක් පවතීද එය පවතීමය. යම් අනුසයක් නොපවතීද එය නොපවතීමය. මෙය පවතීද නොපවතීද, මෙය පවතින්නේය. නොපවතින්නේ යයි මෙසේ බෙදිය යුතු අනුසය නම් නැත. **රූප ධාතුං උප්පජ්ජන්තස්ස කස්සචි තයො** යයි අනාගාමි වශයෙන් කියන ලදි. ඔහුගේ වනාහි කාමරාග පටිඝ දිට්ඨි විචිකිච්ඡා අනුසය සතර ද ප්‍රහීන විය. ඉතිරි තුන අප්‍රහීනය. එයින් කියන ලදි. කිසිවෙකුගේ අනුසය තුනක් පවතී."
                    },
                    {
                        "type": "paragraph",
                        "text": "**න කාමධාතුං** යයි කාමධාතුවෙන් ප්‍රතිසෙධ බැවින් සෙසු ධාතු දෙකේ උපන්නාගේ යයි අර්ථ වේ. **සත්තෙව** යයි යම් ආර්ය ශ්‍රාවකයෙකුගේ රූපධාතුවෙන් චුතව කාමධාතුවේ උපතක් නම් නැත. පෘථග්ජනයාටම වේ. එහෙයින් සත්තෙ වා යයි නියමකොට කියන ලදි. **අරූප ධාතුයා චුතස්ස කාමධාතුං උප්පජ්ජන්තස්ස සත්තෙවා** යයි මෙහිද එම නයම වේ. **රූපධාතුයා උප්පත්ති නත්‍ථි** යයි කුමක් හෙයින් නැත්ද? උපත නිෂ්පාදකයාගේ රූපාවචර ධ්‍යානයේ අභාවය නිසා. හේ සියළු ආකාරයෙන් රූපසංඥාවන්ගේ සමතික්‍රමණය ඒ ධාතුවේ උපන්නේ යයි ඔහුට රූපාවචර ධ්‍යානයක් නැත. එය නොමැති වීමෙන් රූපධාතුවේ උපත් නැතැයි දතයුතුය. **අරූප ධාතුයා චූතස්ස න කාමධාතුං** මෙහි අරූපධාතුම අදහස් කරයි. මෙම නයින් සියළු විසඳුම්වල අර්ථ දතයුතුය."
                    },
                    {
                        "type": "centered",
                        "text": "ධාතුවාර කථා නිමි.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "අනුසය යමක වර්ණනාව සමාප්තයි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "8. චිත්ත යමක වර්ණනාව",
                        "level": 4
                    },
                    {
                        "type": "heading",
                        "text": "උද්දෙසවාර වණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දැන් ඒ මූල යමකයෙහි ම දේශනා කරන ලද කුසලාදි ධර්මවල ලැබීම් වශයෙන් ඒකදේශයක්ම සංග්‍රහකොට අනුසය යමකයට අනතුරුව දේශනා කළ චිත්ත යමකයේ අර්ථ වර්ණනාව වේ. මෙහි පෙළෙහි නියමය පළමුව දැනගත යුතුය. මෙම චිත්ත යමකයෙහි. මාතිකා ඨපනය ඨපිත මාතිකා විසඳීම යයි වාර දෙකක් වේ. එහි මාතෘකා තැබීමේ පුග්ගලවාර, ධම්මවාර, පුග්ගල ධම්මවාර යයි මුලින් සුද්ධික මහාවාර තුනක් වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "එහි **යස්ස චිත්තං උප්පජ්ජති න නිරුජ්ඣති** මෙසේ පුද්ගල වශයෙන් සිතේ උපදින නිරුද්ධවන ආදි භේද දක්වමින් යන ලද්දේ පුග්ගල ධම්මවාර නම් වේ. **යස්ස යං චිත්තං උප්පජ්ජති න නිරුජ්ඣති** යයි මෙසේ ධර්ම වශයෙන්ම සිතේ උපදින නිරුද්ධවන භේද දක්වන්නේ පුග්ගලධම්මවාර නම් වේ. ඉක්බිති **යස්ස සරාගං චිත්තං** යයි සොළොස් පදයන්ගේ වශයෙන් පසුව සරාගාදි පද විශේෂිත වූ සොළස පුග්ගල වාර, සොළස ධම්මවාර, සොළස පුග්ගල ධම්මවාර අට සතළිස් මිශ්‍රකවාර වේ. ඒවා සරාගාදි පද පමණක් දක්වා සංක්‍ෂෙප කරන ලදි. ඉක්බිති **යස්ස කුසලං චිත්තං** යනාදි නයින් දෙසිය හැටහය සංඛ්‍යාවක් අභිධර්ම මාතෘකා පද වශයෙන් පසුව කුසලාදි පද විශේෂිතව දෙසිය හැටහයක් පුද්ගලවාර, දෙසිය හැටහයක් ධම්මවාර, දෙසිය හැටහයක් පුග්ගල ධම්මවාර යයි හත්සිය අනූඅටක් මිශ්‍රක වාර වේ. ඒවාද කුසලාදි පද පමණක් දක්වා සංක්‍ෂෙප කෙළේමය. මෙහි යම් නිදර්ශන සහිත පද සිත සමග නොයෙදේ. ඒවා මෝඝ පුච්ඡා වශයෙන් තබන ලදි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 67,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තෙසු පන තීසු වාරෙසු සබ්බපඨමෙ සුද්ධිකපුග්ගලමහාවාරෙ උප්පාදනිරොධකාලසම්භෙදවාරො, උප්පාදුප්පන්නවාරො, නිරොධුප්පන්නවාරො, උප්පාදවාරො, නිරොධවාරො, උප්පාදනිරොධවාරො උප්පජ්ජමානනිරොධවාරො, උප්පජ්ජමානුප්පන්නවාරො, නිරුජ්ඣමානුප්පන්නවාරො, උප්පන්නුප්පාදවාරො, අතීතානාගතවාරො, උප්පන්නුප්පජ්ජමානවාරො, නිරුද්ධනිරුජ්ඣමානවාරො, අතික්කන්තකාලවාරොති චුද්දස අන්තරවාරා. තෙසු උප්පාදවාරො, නිරොධවාරො, උප්පාදනිරොධවාරොති ඉමෙසු තීසු වාරෙසු අනුලොමපටිලොමවසෙන ඡ ඡ කත්වා අට්ඨාරස යමකානි. උප්පන්නුප්පාදවාරෙ අතීතානාගතකාලවසෙන අනුලොමතො ද්වෙ, පටිලොමතො ද්වෙති චත්තාරි යමකානි. සෙසෙසු ආදිතො නිද්දිට්ඨෙසු තීසු, අනන්තරෙ නිද්දිට්ඨෙසු තීසු; අවසානෙ නිද්දිට්ඨෙසු චතූසූති දසසු වාරෙසු අනුලොමතො එකං, පටිලොමතො එකන්ති ද්වෙ ද්වෙ කත්වා වීසති යමකානි. එවං සබ්බෙසුපි චුද්දසසු අන්තරවාරෙසු ද්වාචත්තාලීස යමකානි, චතුරාසීති පුච්ඡා අට්ඨසට්ඨිඅත්ථසතං හොති. යථා ච එකස්මිං සුද්ධිකපුග්ගලමහාවාරෙ, තථා සුද්ධිකධම්මවාරෙපි සුද්ධිකපුග්ගලධම්මවාරෙපීති තීසු මහාවාරෙසු ඡබ්බීසතියමකසතං, තතො දිගුණා පුච්ඡා, තතො දිගුණා අත්ථා ච වෙදිතබ්බා. ඉදං පන වාරත්තයං සරාගාදිවසෙන සොළසගුණං, කුසලාදිවසෙන ඡසට්ඨිද්විසතගුණං කත්වා ඉමස්මිං චිත්තයමකෙ අනෙකානි යමකසහස්සානි, තතො දිගුණා පුච්ඡා, තතො දිගුණා අත්ථා ච හොන්තීති . පාඨො පන සංඛිත්තොති. එවං තාව ඉමස්මිං චිත්තයමකෙ පාළිවවත්ථානං වෙදිතබ්බං."
                    },
                    {
                        "type": "centered",
                        "text": "මාතිකාඨපනවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නිද්දෙසො",
                        "level": 2
                    },
                    {
                        "type": "heading",
                        "text": "පුග්ගලවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදානි ඨපිතානුක්කමෙන මාතිකං විස්සජ්ජෙතුං **යස්ස චිත්තං උප්පජ්ජති න නිරුජ්ඣතී**තිආදි ආරද්ධං. තත්ථ **උප්පජ්ජතී**ති උප්පාදක්ඛණසමඞ්ගිතාය උප්පජ්ජති **න නිරුජ්ඣතී**ති නිරොධක්ඛණං අප්පත්තතාය න නිරුජ්ඣති. **තස්ස චිත්ත**න්ති තස්ස පුග්ගලස්ස තතො පට්ඨාය චිත්තං නිරුජ්ඣිස්සති නුප්පජ්ජිස්සතීති පුච්ඡති. **තෙසං චිත්ත**න්ති යෙසං පරිච්ඡින්නවට්ටදුක්ඛානං ඛීණාසවානං සබ්බපච්ඡිමස්ස චුතිචිත්තස්ස උප්පාදක්ඛණො වත්තති, එතෙසං තදෙව චුතිචිත්තං උප්පාදප්පත්තතාය උප්පජ්ජති නාම, භඞ්ගං අප්පත්තතාය න නිරුජ්ඣති. ඉදානි පන භඞ්ගං පත්වා තං තෙසං චිත්තං නිරුජ්ඣිස්සති, තතො අප්පටිසන්ධිකත්තා අඤ්ඤං නුප්පජ්ජිස්සති. **ඉතරෙස**න්ති පච්ඡිමචිත්තසමඞ්ගිං ඛීණාසවං ඨපෙත්වා අවසෙසානං සෙක්ඛාසෙක්ඛපුථුජ්ජනානං **නිරුජ්ඣිස්සති චෙව උප්පජ්ජිස්සති චා**ති යං තං උප්පාදක්ඛණප්පත්තං තං නිරුජ්ඣිස්සතෙව. අඤ්ඤං පන තස්මිං වා අඤ්ඤස්මිං වා අත්තභාවෙ උප්පජ්ජිස්සති චෙව නිරුජ්ඣිස්සති ච. දුතියපුච්ඡාවිස්සජ්ජනෙපි තථාරූපස්සෙව ඛීණාසවස්ස චිත්තං සන්ධාය ‘ආමන්තා’ති වුත්තං. **නුප්පජ්ජති නිරුජ්ඣතී**ති භඞ්ගක්ඛණෙ අරහතො පච්ඡිමචිත්තම්පි සෙසානං භිජ්ජමානචිත්තම්පි. තතො පට්ඨාය පන අරහතො චිත්තං න නිරුජ්ඣිස්සතීති සක්කා වත්තුං උප්පජ්ජිස්සතීති පන න සක්කා. සෙසානං උප්පජ්ජිස්සතීති සක්කා වත්තුං, න නිරුජ්ඣිස්සතීති න සක්කා. තස්මා ‘නො’ති පටිසෙධො කතො. දුතියපඤ්හෙ යස්ස චිත්තං න නිරුජ්ඣිස්සති, උප්පජ්ජිස්සතීති සො පුග්ගලොයෙව නත්ථි, තස්මා නත්ථීති පටික්ඛෙපො කතො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඒවායින් තුන් වාරයක සියල්ලට පළමු සුද්ධික පුග්ගල මහාවාරයෙහි උප්පාද නිරොධ කාල සම්භේද වාරය, උප්පාදඋප්පන්න වාරය, නිරොධ උප්පන්න වාරය, උප්පාද වාරය, නිරොධ වාරය, උප්පාද නිරොධ වාරය, උප්පජ්ජමාන නිරොධ වාරය, උප්පජ්ජමාන උප්පන්න වාරය, නිරුජ්ඣමාන උප්පන්නවාරය, උප්පන්න උප්පාදවාරය, නිරුද්ධ නිරුජ්ඣමාන වාරය, අතීතානාගතවාරය, අතික්කන්තකාල වාරය යයි අන්තරවාර තුදුසකි. ඒවා අතරින් උප්පාදවාරය, නිරෝධවාරය, උප්පාද නිරොධවාරය යයි මේ වාර තුනෙහි අනුලෝම පටිලෝම වශයෙන් හය හය කොට යමක අටළොසක් වේ. උප්පන්න උප්පාද වාරයෙහි අතීත අනාගත කාල වශයෙන් අනුලෝම දෙකක් වේ. පටිලෝම දෙකකැයි යමක සතරක් වේ. සෙසු ඒවායෙහි මුලින් නිර්දිට්ඨ තුන, අනතුරුව, නිර්දිෂ්ඨ තුන අවසානයෙහි නිර්දිෂ්ඨ සතර යැයි දසවාරයෙහි අනුලෝම වශයෙන් එකකි. පටිලෝම වශයෙන් එකකැයි දෙක දෙක කොට යමක විස්සක් වේ. මෙසේ සියළු තුදුසෙහිම අන්තරවාරයෙහි යමක සතළිස් දෙකකි. පුච්ඡා අසූහතරකි. අර්ථ එක්සිය හැටඅටකි. ඒක සුද්ධික පුද්ගල වාරයෙහි යම්සේද එසේම සුද්ධික ධම්ම වාරයෙහිද සුද්ධික පුග්ගල ධම්මවාරයෙහි ද තුන්මහා වාරයෙහි යමක එක්සිය විසිහයක් වේ. එයින් දෙගුණය පුච්ඡා වේ. එයින් දෙගුණය අර්ථය වේයයි දතයුතුය. මෙය වනාහි වාර තුනේ සරාගාදි වශයෙන් සොළොස් ගුණයයි. කුසලාදි වශයෙන් දෙසිය හැටහය ගුණ කොට මේ චිත්ත යමකයෙහි අනෙක වූ යමක දහයක් වේ. එයින් දෙගුණය පුච්ඡා වේ. එයින් දෙගුණය අර්ථද වේයයි පාඨය සංක්‍ෂෙප කරන ලදි. මෙසේ මේ චිත්ත යමකයෙහි පෙළෙහි නියමය දතයුතුය."
                    },
                    {
                        "type": "centered",
                        "text": "මතිකා ඨපන වැනුම නිමි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නිර්දේශවාර",
                        "level": 2
                    },
                    {
                        "type": "heading",
                        "text": "පුග්ගලවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දැන් තැබූ පිළිවෙලින් මාතෘකා විසඳීමට යමෙකුගේ සිත උපදියි නිරුද්ධ නොවේ’ යනාදිය ආරම්භ කරන ලදි. එහි **උප්පජ්ජති** යයි උප්පාද ක්‍ෂණයෙන් යුක්තව උපදී. **න නිරුජ්ඣති** යයි නිරෝධ ක්‍ෂණය නොපැමිණි බැවින් නිරුද්ධ නොවේ. **තස්ස චිත්තං** යයි ඒ පුද්ගලයාගේ එතැන් පටන් සිත නිරුද්ධ වන්නේය. නූපදීදැයි අසයි. **තෙසං චිත්තං** සසර දුක් නැතිකළ යම් ක්‍ෂීණාශ්‍රවයන්ගේ සියල්ලටම පසුව චුති සිතේ උප්පාද ක්‍ෂණය වැටේ. ඔවුන්ගේ ඒ චුති සිතම ඉපදීම් බවට පැමිණියෙන් උපදියි. භංගයට නොපැමිණි බැවින් නිරුද්ධ නොවේ. දැන් වනාහි භංගයට පැමිණ එය ඔවුන්ගේ සිත නිරුද්ධ වන්නේය. ඉක්බිති අප්‍රතිසන්ධි බැවින් අනිකක් නූපදින්නේය. **ඉතරෙසං** යයි අවසන් සිත ඇතුළත් ක්‍ෂීණාශ්‍රවයා හැර අවසේස සෙකාසෙක පෘථග්ජනයින්ගේ **නිරුජ්ඣිස්සති චෙව උප්පජ්ජිස්සති **යමෙක් උප්පාද ක්‍ෂණයට පැමිණියේද ඔහු නිරුද්ධ වන්නේමය. අන්‍යයා වනාහි එහි හෝ වෙනත් ආත්මභාවයක හෝ උපදින්නේ ද නිරුද්ධ වන්නේද වේ. දෙවන පුච්ඡා විසඳීමෙහි ද එබඳු වූම ක්‍ෂීණාශ්‍රවයාගේ සිත සඳහා **ආමන්තා** යයි කියන ලදි. **නූප්පජ්ජති නිරුජ්ඣති** යයි භංග ක්‍ෂණයෙහි රහතන් වහන්සේගේ අවසාන සිත ද සෙස්සන් ගේ බිඳෙන සිත ද, එතැන් පටන් වනාහි රහතුන්ගේ සිත නිරුද්ධ නොවන්නේ යයි කීමට හැකිය. සෙස්සන්ගේ උපදින්නේ යයි කිවහැකිය. නිරුද්ධ නොවේ යයි කිව නොහැක. එහෙයින් **නො** යයි ප්‍රතිසෙධ කරන ලදි. දෙවන ප්‍රශ්නය. **යස්ස චිත්තං නො නිරුජ්ඣිස්සති උප්පජ්ජිස්සති **යයි ඒ පුද්ගලයාම නැත. එහෙයින් නත්‍ථි යයි ප්‍රතික්‍ෂෙප කරන ලදි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 69,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**උප්පන්න**න්ති උප්පාදසමඞ්ගිනොපෙතං නාමං. උප්පාදං පත්වා අනිරුද්ධස්සාපි. තත්ථ උප්පාදසමඞ්ගිතං සන්ධාය ‘ආමන්තා’ති, උප්පාදං පත්වා අනිරුද්ධභාවං සන්ධාය “තෙසං චිත්තං උප්පන්න”න්ති වුත්තං. **අනුප්පන්න**න්ති උප්පාදං අප්පත්තං. **තෙසං චිත්තං උප්පජ්ජිත්ථා**ති එත්ථාපි සබ්බෙසං තාව චිත්තං ඛණපච්චුප්පන්නමෙව හුත්වා උප්පාදක්ඛණං අතීතත්තා උප්පජ්ජිත්ථ නාම, නිරොධසමාපන්නානං නිරොධතො පුබ්බෙ උප්පන්නපුබ්බත්තා, අසඤ්ඤසත්තානං සඤ්ඤීභවෙ උප්පන්නපුබ්බත්තා. **උප්පජ්ජිත්ථ චෙව උප්පජ්ජති චා**ති උප්පාදං පත්තත්තා උප්පජ්ජිත්ථ, අනතීතත්තා උප්පජ්ජති නාමාති අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**උප්පාදක්ඛණෙ අනාගතඤ්චා**ති උප්පාදක්ඛණෙ ච චිත්තං අනාගතඤ්ච චිත්තන්ති අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "අතික්කන්තකාලවාරෙ **උප්පජ්ජමානං ඛණ**න්ති උප්පාදක්ඛණං. තත්ථ කිඤ්චාපි උප්පාදක්ඛණො උප්පජ්ජමානො නාම න හොති, උප්පජ්ජමානස්ස පන ඛණත්තා එවං වුත්තො. **ඛණං වීතික්කන්තං අතික්කන්තකාල**න්ති න චිරං වීතික්කන්තං තමෙව පන උප්පාදක්ඛණං වීතික්කන්තං හුත්වා අතික්කන්තකාලන්ති සඞ්ඛං ගච්ඡති. **නිරුජ්ඣමානං ඛණ**න්ති නිරොධක්ඛණං. තත්ථ කිඤ්චාපි නිරොධක්ඛණො නිරුජ්ඣමානො නාම න හොති, නිරුජ්ඣමානස්ස පන ඛණත්තා එවං වුත්තො. **ඛණං වීතික්කන්තං අතික්කන්තකාල**න්ති කිං තස්ස චිත්තං එවං නිරොධක්ඛණම්පි වීතික්කන්තං හුත්වා අතික්කන්තකාලං නාම හොතීති පුච්ඡති. තත්ථ යස්මා භඞ්ගක්ඛණෙ චිත්තං උප්පාදක්ඛණං ඛණං වීතික්කන්තං හුත්වා අතික්කන්තකාලං හොති, නිරොධක්ඛණං ඛණං වීතික්කන්තං හුත්වා අතික්කන්තකාලං නාම න හොති. අතීතං පන චිත්තං උභොපි ඛණෙ ඛණං වීතික්කන්තං හුත්වා අතික්කන්තකාලං නාම, තස්මා “භඞ්ගක්ඛණෙ චිත්තං උප්පාදක්ඛණං වීතික්කන්තං, භඞ්ගක්ඛණං අවීතික්කන්තං, අතීතං චිත්තං උප්පාදක්ඛණඤ්ච වීතික්කන්තං භඞ්ගක්ඛණඤ්ච වීතික්කන්තන්ති විස්සජ්ජනමාහ. දුතියපඤ්හස්ස විස්සජ්ජනෙ යස්මා අතීතං චිත්තං උභොපි ඛණෙ වීතික්කන්තං හුත්වා අතික්කන්තකාලං නාම හොති, තස්මා අතීතං චිත්තන්ති වුත්තං. පටිලොමපඤ්හස්ස විස්සජ්ජනෙ යස්මා උප්පාදක්ඛණෙ ච චිත්තං අනාගතඤ්ච චිත්තං උභොපි ඛණෙ ඛණං වීතික්කන්තං හුත්වා අතික්කන්තකාලං නාම න හොති, තෙසං ඛණානං අවීතික්කන්තත්තා. තස්මා “උප්පාදක්ඛණෙ චිත්තං අනාගතං චිත්ත”න්ති වුත්තං. දුතියවිස්සජ්ජනං පාකටමෙව."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**උප්පන්නං** උපත යුත් මෙය නමකි. ඉපදීමට පැමිණ නිරුද්ධ නොවන්නේ ද වේ. එහි උත්පාදයෙන් යුක්තවීම සඳහා **ආමත්තා** යයි, ඉපදීමට පැමිණ අතිරුද්ධභාවය සඳහා. **තෙසං චිත්තං උප්පන්නං** යයි කියන ලදි. **අනුප්පත්තං** යයි උපතට නොපැමිණියෝ. **තෙසං චිත්තං උප්පජ්ජිත්‍ථ** යන මෙහි ද සියල්ලන්ගේ සිත ක්‍ෂණ වර්තමානයම වී උප්පාද ක්‍ෂණය අතීත බැවින් උප්පජ්ජිත්‍ථ නම් වේ. නිරෝධයට සමවැදුනවුන්ගේ නිරෝධයෙන් පෙර උපන් පෙර බැවින්, අසඤ්ඤ සත්ත්වයින්ගේ සංඥී භවයෙහි උපන් පෙරටු බව. **උප්පජ්ජිත්‍ථචෙව උප්පජ්ජතිච** උත්පාදයට පැමිණියේ ඉපදුනහ. අනතීත බැවින් උපදී නමැයි අර්ථ වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "**උප්පාදක්ඛණෙ අනාගතඤ්ච** උත්පාද ක්‍ෂණයෙහි සිත ද අනාගත සිත ද යන අර්ථය වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "අතික්කන්ත කාල වාරයෙහි **උප්පජ්ජමානං ඛීණං** යයි උප්පාද ක්‍ෂණය යම්තැනක කිසියම් උප්පාද ක්‍ෂණය ද උපදින්නේ නම් නොවේ. උපදින්නහුගේ වනාහි ක්‍ෂණබව මෙසේ කියන ලදි. **ඛණං වීතික්කන්තං අතික්කන්ත කාලං** ඉක්මවී කලක් නොවේ. එයම වනාහි උප්පාද ක්‍ෂණ අතික්‍රමණය වී අතික්කන්ත කාල යයි සංඛ්‍යාවට යයි. **නිරුජ්ඣමානං ඛණං** නිරෝධ ක්‍ෂණය. එහි කිසියම් නිරෝධ ක්‍ෂණය නිරුද්ධ වන්නේ නම් නොවේ. නිරුද්ධ වන්නාගේ ක්‍ෂණබව මෙසේ කියන ලදි. **ඛණං වීතික්කන්තං අතික්කත්ත කාලං** අතික්‍රාන්ත කාලය නම් වේ යයි අසයි. එහි යම්හෙයකින් භංග ක්‍ෂණයෙහි සිත උත්පාද ක්‍ෂණ ක්‍ෂණය ඉක්මවා අතික්කන්ත කාලය වේ. නිරෝධ ක්‍ෂණ ක්‍ෂණය ඉක්මවා අතික්කන්ත කාලය නොවේ. අතීත සිත ක්‍ෂණ දෙකම ක්‍ෂණය ඉක්මවා අතික්කත්තකාල නම් වේ. එහෙයින් **භංගක්ඛණෙ චිත්තං උප්පාදක්ඛණං වීතික්කන්තං භංගක්ඛණං අවීතික්කන්තං අතීතං චිත්තං උප්පාදක්ඛණඤ්ච වීතික්කන්තං භංගක්ඛණඤ්ච වීතික්කන්තං** විසඳමින් කීය. දෙවන ප්‍රශ්නයේ විසඳුමෙහි යම් හෙයකින් අතීත සිත ක්‍ෂණ දෙකෙහිම ඉක්මවා අතික්කන්ත කාල නම්වේ. එහෙයින් අතීත සිත යයි කියන ලදි. පටිලෝම ප්‍රශ්නය විසඳීමෙහි යම්හෙයකින් උප්පාද ක්‍ෂණයේද සිත අනාගත සිත ද ක්‍ෂණ දෙකේම ක්‍ෂණය ඉක්මවා අතික්කන්ත කාල නම් නොවේ. ඔවුන්ගේ ක්‍ෂණ ඉක්මවීය. එහෙයින් **උප්පාදක්ඛණෙ චිත්තං අනාගතං චිත්තං** යයි කියන ලදි. දෙවන විසඳුම ප්‍රකටය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 71,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ධම්මවාරෙපි ඉමිනාවුපායෙන සබ්බවිස්සජ්ජනෙසු අත්ථො වෙදිතබ්බො. පුග්ගලධම්මවාරො ධම්මවාරගතිකොයෙව."
                    },
                    {
                        "type": "paragraph",
                        "text": "සබ්බෙපි මිස්සකවාරා **යස්ස සරාගං චිත්ත**න්තිආදිනා නයෙන මුඛමත්තං දස්සෙත්වා සඞ්ඛිත්තා. විත්ථාරො පන නෙසං හෙට්ඨා වුත්තනයෙනෙව වෙදිතබ්බො. තෙසු පන “යස්ස සරාගං චිත්තං උප්පජ්ජති, න නිරුජ්ඣති; තස්ස චිත්තං නිරුජ්ඣිස්සති, නුප්පජ්ජිස්සතී”ති එවං විත්ථාරෙතබ්බතාය පුච්ඡාව සදිසා හොති. යස්මා පන සරාගං චිත්තං පච්ඡිමචිත්තං න හොති, තස්මා “යස්ස සරාගං චිත්තං උප්පජ්ජති, න නිරුජ්ඣති; තස්ස චිත්තං නිරුජ්ඣිස්සති, නුප්පජ්ජිස්සතීති නො”ති එවං විස්සජ්ජිතබ්බත්තා විස්සජ්ජනං අසදිසං හොති. තං තං තස්සා තස්සා පුච්ඡාය අනුරූපවසෙන වෙදිතබ්බන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "චිත්තයමකවණ්ණනා නිට්ඨිතා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "9. ධම්මයමකං",
                        "level": 4
                    },
                    {
                        "type": "heading",
                        "text": "පණ්ණත්තිඋද්දෙසවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදානි තෙසඤ්ඤෙව මූලයමකෙ දෙසිතානං කුසලාදිධම්මානං මාතිකං ඨපෙත්වා චිත්තයමකානන්තරං දෙසිතස්ස ධම්මයමකස්ස වණ්ණනා හොති. තත්ථ ඛන්ධයමකෙ වුත්තනයෙනෙව පාළිවවත්ථානං වෙදිතබ්බං. යථා හි තත්ථ පණ්ණත්තිවාරාදයො තයො මහාවාරා, අවසෙසා අන්තරවාරා ච හොන්ති, තථා ඉධාපි. “යො කුසලං ධම්මං භාවෙති, සො අකුසලං ධම්මං පජහතී”ති ආගතත්තා පනෙත්ථ පරිඤ්ඤාවාරො, භාවනාවාරො නාමාති වෙදිතබ්බො. තත්ථ යස්මා අබ්යාකතො ධම්මො නෙව භාවෙතබ්බො, න පහාතබ්බො, තස්මා තං පදමෙව න උද්ධටං. පණ්ණත්තිවාරෙ පනෙත්ථ තිණ්ණං කුසලාදිධම්මානං වසෙන පදසොධනවාරො, පදසොධනමූලචක්කවාරො, සුද්ධධම්මවාරො, සුද්ධධම්මමූලචක්කවාරොති ඉමෙසු චතූසු වාරෙසු යමකගණනා වෙදිතබ්බා."
                    },
                    {
                        "type": "heading",
                        "text": "පණ්ණත්තිනිද්දෙසවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "පණ්ණත්තිවාරනිද්දෙසෙ පන **කුසලා කුසලධම්මා**ති කුසලානං එකන්තෙන කුසලධම්මත්තා “ආමන්තා”ති වුත්තං. සෙසවිස්සජ්ජනෙසුපි එසෙව නයො. **අවසෙසා ධම්මා න අකුසලා ධම්මා**ති අවසෙසා ධම්මා අකුසලා න හොන්ති, ධම්මා පන හොන්තීති අත්ථො. ඉමිනා නයෙන සබ්බවිස්සජ්ජනානි වෙදිතබ්බානි."
                    },
                    {
                        "type": "centered",
                        "text": "පණ්ණත්තිවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පවත්තිවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "පවත්තිවාරෙ පනෙත්ථ පච්චුප්පන්නකාලෙ පුග්ගලවාරස්ස අනුලොමනයෙ “යස්ස කුසලා ධම්මා උප්පජ්ජන්ති, තස්ස අකුසලා ධම්මා උප්පජ්ජන්ති; යස්ස වා පන අකුසලා ධම්මා උප්පජ්ජන්ති, තස්ස කුසලා ධම්මා උප්පජ්ජන්තී”ති කුසලධම්මමූලකානි ද්වෙ යමකානි, අකුසලධම්මමූලකං එකන්ති තීණි යමකානි හොන්ති. තස්ස පටිලොමනයෙපි ඔකාසවාරාදීසුපි එසෙව නයො. එවමෙත්ථ සබ්බවාරෙසු තිණ්ණං තිණ්ණං යමකානං වසෙන යමකගණනා වෙදිතබ්බා. අත්ථවිනිච්ඡයෙ පනෙත්ථ ඉදං ලක්ඛණං – ඉමස්ස හි ධම්මයමකස්ස පවත්තිමහාවාරෙ “උප්පජ්ජන්ති නිරුජ්ඣන්තී”ති ඉමෙසු උප්පාදනිරොධෙසු කුසලාකුසලධම්මා තාව එකන්තෙන පවත්තියංයෙව ලබ්භන්ති, න චුතිපටිසන්ධීසු. අබ්යාකතධම්මා පන පවත්තෙ ච චුතිපටිසන්ධීසු චාති තීසුපි කාලෙසු ලබ්භන්ති. එවමෙත්ථ යං යත්ථ යත්ථ ලබ්භති, තස්ස වසෙන තත්ථ තත්ථ විනිච්ඡයො වෙදිතබ්බො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ධම්මවාරේ ද මෙම උපායෙන් සියළු විසඳීම් දතයුතුය. පුග්ගල ධම්මවාරය ධම්මවාර ගතික වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "සියළු මිශ්‍රක වාර ‘යමෙකුගේ සරාග සිත’ යනාදි නයිාන් මුඛමාත්‍රය දක්වා සංක්‍ෂේප කරන ලදි. ඒවායේ විස්තරය වනාහි යට කියන ලද නයින් ම දතයුතුය. ඒවායින් වනාහි යමෙකුගේ සරාග සිත උපදී. නිරුද්ධ නොවේ. ඔහුගේ සිත නිරුද්ධ වේ නූපදින්නේ ය’යි මෙසේ විස්තරයෙහි තැබිය යුතු ඇසීමද සමාන වේ. යම්හෙයකින් සරාග සිත අවසාන සිත නොවේ. එහෙයින් යමෙකුගේ සරාග සිත උපදී. නිරුද්ධනොවේ. ඔහුගේ සිත නිරුද්ධ වන්නේය. නූපදින්නේ ද නැතැ’යි මෙසේ විසඳිය යුතු බැවින් විසඳීම අසදෘශ වේ. එය ඇසීමට අනුරූප වශයෙන් දතයුතුය."
                    },
                    {
                        "type": "centered",
                        "text": "චිත්තයමක වර්ණනාව නිමි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "9. ධම්ම යමක වර්ණනාව",
                        "level": 4
                    },
                    {
                        "type": "heading",
                        "text": "පණ්ණත්තිඋද්දෙසවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "දැන් ඒ මූල යමකයෙහිම දේශනා කරන ලද කුසලාදි ධර්මවල මාතෘකා තබා චිත්ත යමකයට අනතුරුව දේශනා කරන ලද ධම්ම යමකයෙහි වර්ණනාව වේ. එහි ඛන්‍ධ යමකයෙහි කියන ලද නයින්ම පෙළෙහි නියම දතයුතුය. යම්සේ එහි පණ්ණත්තිවාරාදි මහාවාර තුනකි. අවශේෂ වූ අන්තර වාරද වේ. එසේම මෙහිද වේ. ‘යමෙක් කුසල් දහම් වඩාද හේ අකුසල දහම් දුරුකරයි’ යයි ආ බැවින් වනාහි මෙහි පරිඤ්ඤා වාරය භාවනා වාර නමැයි දතයුතුය. එහි යම්සේ නොකියන ලද ධර්මය නොවැඩිය යුතුය. ප්‍රහාණය නොකළ යුතුය. එහෙයින් ඒ පදයම නොඋදුරන ලදි. මෙහි පණ්ණත්තිවාරයෙහි වනාහි තුන් කුසලාදි ධර්ම වශයෙන් පදශෝධන වාරය පදසොධන මූල චක්කවාරය, සුද්ධ ධම්මවාරය, සුද්ධ ධම්ම මූල චක්කවාරය යයි මේ සතර වාරයෙහි යමක ගණන දතයුතුය."
                    },
                    {
                        "type": "heading",
                        "text": "පණ්ණත්තිනිද්දෙසවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "පණ්ණත්ති වාර නිද්දේසය වනාහි ‘කුසලාකුසල ධම්මා’ යයි කුසලයන්ගේ ඒකාන්තයෙන් කුසල ධම්ම බව වේ. **ආමත්තා** යයි කියන ලදි. සෙසු විසඳුම්වල ද මෙම නයම වේ. **අවසෙසො ධම්මා න අකුසලා ධම්මා** යයි අවශේෂ ධර්ම අකුසල නොවේ. ධර්ම වේයයි අර්ථය වේ. මෙම නයින් සියළු විසඳීම් දතයුතුය."
                    },
                    {
                        "type": "centered",
                        "text": "",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පවත්තිවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙහි පවත්තිවාරයෙහි වනාහි වර්තමාන කාල පුග්ගල වාරයේ අනුලෝම නයෙහි උපදිති. ඔහුගේ අකුසල ධර්ම උපදී. ‘යමෙකුගේ වනාහි අකුසල ධර්ම උපදීද ඔහුගේ කුසල ධර්ම උපදී’ යයි කුසල ධර්ම මූලකවල යමක දෙකකි. අකුසල ධම්ම මූලක එකකැයි යමක තුනක් වේ. එහි පටිලෝම නයේ ද ඕකාසවාරාදියෙහි ද මෙම නයම වේ. මෙසේ මෙහි සියළු වාරවල යමක තුන තුන වශයෙන් යමක ගණන දතයුතුය. මෙහි අර්ථ විනිශ්චයෙහි වනාහි මේ ලක්‍ෂණ වේ. මේ ධර්ම යමකයේ පවත්ති මහාවාරයෙහි **උප්පජ්ජන්ති නිරුජ්ඣන්ති** මේ උප්පාද නිරෝධවල කුසලාකුසල ධර්ම ඒකාන්තයෙන් පැවතීමෙහිම ලැබේ. චුතිපටිසන්ධිවල නොවේ. අබ්‍යාකත ධර්ම වනාහි පැවතීමෙහි ද චුති පටිසන්ධිවලදැයි කාල තුනෙහිම ලැබේ. මෙසේ මෙහි යමක් ඒ ඒ තැන ලබයිද ඒ අනුව ඒ ඒ තැන විනිශ්චය දතයුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 73,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තත්රිදං නයමුඛං – කුසලාකුසලානං තාව එකක්ඛණෙ අනුප්පජ්ජනතො “නො”ති පටිසෙධො කතො. **අබ්යාකතා චා**ති චිත්තසමුට්ඨානරූපවසෙන වුත්තං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යත්ථ කුසලා ධම්මා නුප්පජ්ජන්තී**ති අසඤ්ඤභවං සන්ධාය වුත්තං. තෙනෙවෙත්ථ “ආමන්තා”ති විස්සජ්ජනං කතං. **උප්පජ්ජන්තී**ති ඉදම්පි අසඤ්ඤභවංයෙව සන්ධාය වුත්තං. අබ්යාකතානං පන අනුප්පත්තිට්ඨානස්ස අභාවා “නත්ථී”ති පටික්ඛෙපො කතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**දුතියෙ අකුසලෙ**ති භවං අස්සාදෙත්වා උප්පන්නෙසු නිකන්තිජවනෙසු දුතියෙ ජවනචිත්තෙ. **දුතියෙ චිත්තෙ වත්තමානෙ**ති පටිසන්ධිතො දුතියෙ භවඞ්ගචිත්තෙ වත්තමානෙ සහ වා පටිසන්ධියා භවඞ්ගං විපාකවසෙන එකමෙව කත්වා භවනිකන්තියා ආවජ්ජනචිත්තෙ. තඤ්හි කිරියචිත්තත්තා අබ්යාකතජාතියං විපාකතො දුතියං නාම හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යස්ස චිත්තස්ස අනන්තරා අග්ගමග්ග**න්ති ගොත්රභුචිත්තං සන්ධාය වුත්තං. **කුසලා ධම්මා උප්පජ්ජිස්සන්තී**ති තෙ අග්ගමග්ගධම්මෙයෙව සන්ධාය වුත්තං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යස්ස චිත්තස්ස අනන්තරා අග්ගමග්ගං පටිලභිස්සන්ති, තස්ස චිත්තස්ස උප්පාදක්ඛණෙ**ති ඉදං චිත්තජාතිවසෙන වුත්තං. තජ්ජාතිකස්ස හි එකාවජ්ජනෙන උප්පන්නස්ස තතො ඔරිමචිත්තස්ස උප්පාදක්ඛණෙපි එතං ලක්ඛණං ලබ්භතෙව."
                    },
                    {
                        "type": "paragraph",
                        "text": "නිරොධවාරෙපි කුසලාකුසලානං එකතො අනිරුජ්ඣනතො “නො”ති වුත්තං. ඉමිනා නයමුඛෙන සබ්බත්ථ විනිච්ඡයො වෙදිතබ්බොති."
                    },
                    {
                        "type": "centered",
                        "text": "ධම්මයමකවණ්ණනා නිට්ඨිතා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "10. ඉන්ද්රියයමකං",
                        "level": 4
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදානි තෙසඤ්ඤෙව මූලයමකෙ දෙසිතානං කුසලාදිධම්මානං ලබ්භමානවසෙන එකදෙසං සංගණ්හිත්වා ධම්මයමකානන්තරං දෙසිතස්ස ඉන්ද්රියයමකස්ස වණ්ණනා හොති. තත්ථ ඛන්ධයමකාදීසු වුත්තනයෙනෙව පාළිවවත්ථානං වෙදිතබ්බං. ඉධාපි හි පණ්ණත්තිවාරාදයො තයො මහාවාරා අවසෙසා අන්තරවාරා ච සද්ධිං කාලප්පභෙදාදීහි ඛන්ධයමකාදීසු ආගතසදිසාව. ඉන්ද්රියානං පන බහුතාය ධාතුයමකතොපි බහුතරානි යමකානි හොන්ති. යථා පන හෙට්ඨා පුග්ගලවාරාදීසු චක්ඛායතනචක්ඛුධාතුමූලකෙ නයෙ චක්ඛායතනචක්ඛුධාතූහි සද්ධිං ජිව්හායතනකායායතනානි න යොජිතානි. ජිව්හායතනකායායතනමූලකානි ච යමකානෙව න ගහිතානි, තථා ඉධාපි චක්ඛුන්ද්රියමූලකෙ නයෙ ජිව්හින්ද්රියකායින්ද්රියානි න යොජිතානි, ජිව්හින්ද්රියකායින්ද්රියමූලකානි ච යමකානෙව න ගහිතානි. තෙසං අග්ගහණෙ කාරණං තත්ථ වුත්තනයෙනෙව වෙදිතබ්බං. මනින්ද්රියං පන යථා චක්ඛුන්ද්රියාදිමූලකෙහි තථෙව ඉත්ථින්ද්රියාදිමූලකෙහිපි සද්ධිං යස්මා යොජනං ගච්ඡති, තස්මා නික්ඛිත්තපටිපාටියා අයොජෙත්වා සබ්බෙහිපි චක්ඛුන්ද්රියමූලකාදීහි සද්ධිං පරියොසානෙ යොජිතන්ති වෙදිතබ්බං. චක්ඛුන්ද්රියෙන සද්ධිං ඉත්ථින්ද්රියපුරිසින්ද්රියජීවිතින්ද්රියානි යොජිතානි සුඛින්ද්රියදුක්ඛින්ද්රියදොමනස්සින්ද්රියානි පටිසන්ධියං නත්ථීති න ගහිතානි. සොමනස්සින්ද්රියඋපෙක්ඛින්ද්රියානි පටිසන්ධියං උප්පත්තිසබ්භාවතො ගහිතානි. තථා සද්ධින්ද්රියාදීනි පඤ්ච. ලොකුත්තරානි තීණි පටිසන්ධියං අභාවෙනෙව න ගහිතානි. ඉති යානි ගහිතානි, තෙසං වසෙනෙත්ථ චක්ඛුන්ද්රියමූලකෙ නයෙ යමකගණනා වෙදිතබ්බා. යථා චෙත්ථ, එවං සබ්බත්ථ. යානි පන න ගහිතානි, තෙසං වසෙන යමකානි න ගණෙතබ්බානි. ගණෙන්තෙන වා මොඝපුච්ඡාවසෙන ගණෙතබ්බානීති එවං තාව සබ්බවාරෙසු පාළිවවත්ථානමෙව වෙදිතබ්බං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එහි නයමුඛය මෙසේය. කුසල අකුසල ඒකක්‍ෂණයෙහි නොඉපදෙන බැවින් නො යයි ප්‍රතිසෙධ කරන ලදි. **අබ්‍යාකතාච** චිත්ත සමුට්ඨාන රූප වශයෙන් කියන ලදි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යත්‍ථ කුසලා ධම්මා නූප්පජ්ජන්ති** අසඤ්ඤ භාවය සඳහා කියන ලදි. එහෙයින් එහි **ආමන්තා **යයි විසඳීම කරන ලදි. **උප්පජ්ජන්ති** මෙය ද අසඤ්ඤ භවයම සඳහා කියන ලදි. අබ්‍යාකතවල වනාහි නූපන් ස්ථානයේ අභාවයෙන් නැතැයි ප්‍රතිාක්‍ෂෙප කරන ලදි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**දුතියෙ අකුසලෙ** දෙවන අකුසල යයි භවය ආශ්වාදකොට උපන් ආශා ජවනයන්හි දවෙන ජවන සිතෙහි, **දුතියෙ චිත්තෙ වත්තමානෙ** ප්‍රතිසන්ධියෙන් දෙවන භවාංග සිතෙහි පවතින පටිසන්ධිය සමග භවංගය විපාක වශයෙන් එකක්ම කොට භව ආශාව ආවර්ජන සිතෙහි. එයම ක්‍රියා සිත බව අබ්‍යාකත ජාති විපාකයෙන් දෙවැන්න නම් වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යස්ස චිත්තස්ස** **අනන්තරා අග්ගමග්ගං** ගොත්‍රභූ සිත සඳහා කියන ලදි. **කුසලා ධම්මා උප්පජ්ජිස්සන්ති** ඒවා අග්‍ර මාර්ග ධර්මයම සඳහා කියන ලදි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යස්ස චිත්තස්ස අනන්තරා අග්ගමග්ගං පටිලභිස්සන්ති තස්ස චිත්තස්ස උප්පාදක්ඛණෙ** මේ සිත ජාති වශයෙන් කියන ලදි. ඒ ජාතියේ එක් ආවර්ජනයෙන් උපන් එයින් මේ හැම සිතේ උත්පාද ක්‍ෂණයෙහි ද මේ ලක්‍ෂණය ලැබේමය."
                    },
                    {
                        "type": "paragraph",
                        "text": "නිරෝධ වාරයෙහි ද කුසල අකුසල එකට නිරුද්ධ නොවන හෙයින් **නො** යයි කියන ලදි. මෙම නය මුඛයෙන් සියලු විනිශ්චයන් දතයුතුය."
                    },
                    {
                        "type": "centered",
                        "text": "ධම්ම යමක වර්ණනාව නිමි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "10. ඉන්‍ද්‍රිය යමක වර්ණනාව",
                        "level": 4
                    },
                    {
                        "type": "paragraph",
                        "text": "දැන් මූල යමකයෙහි ම දේශනා කරන ලද කුසලාදි ධර්මවල ලැබීම් වශයෙන් එක් දේශයක් සංග්‍රහකොට ධම්ම යමකට අනතුරුව දේශනා කළ ඉන්‍ද්‍රිය යමකයේ වර්ණනාව වේ. එහි ඛන්‍ධ යමකාදියෙහි කියන ලද නයින්ම පෙළ නියමය දතයුතුය. මෙහි ද පණ්ණත්තිවාර ආදි මහාවාර තුනකි. අවශේෂ අන්තරවාර ද කාලභේදාදිය සමග ඛන්‍ධ යමකාදියෙහි පැමිණි ලෙසට සමානය. ඉන්‍ද්‍රියන්ගේ බොහෝ බැවින් ධාතුයමකයට වඩා බොහෝ යමක වේ. යම්සේ යට පුග්ගල වාරාදියෙහි චක්ඛායතන චක්ඛුධාතු මූලක නයෙහි චක්ඛායතන චක්ඛුධාතු සමග ජිව්හායතන කායායතන නොයොදන ලදි. ජිව්හායතන කායායතන මූලක ද යමක යයි නො ගන්නා ලදි. එසේම මෙහි ද චක්ඛුන්‍ද්‍රිය මූලක නයෙහි ජිව්හින්‍ද්‍රිය කායින්‍ද්‍රිය මූලක යමක යයි නොගන්නා ලදි. ඒවා නොගන්නා කරුණ එහි කියන ලදයින්ම දතයුතුය. මනින්‍ද්‍රිය වනාහි චක්ඛුන්‍ද්‍රිය මූලකය මෙන් එසේම ඉත්‍ථින්‍ද්‍රිය මූලකය සමග යම්සේ යෙදීමට යයිද එහෙයින් තබන ලද පිළිවෙලින් නොයොදා සියළු චක්ඛුන්‍ද්‍රිය මූලක සමග අවසානයෙහි යොදන ලදැයි දතයුතුය. චක්ඛුඉන්‍ද්‍රිය සමග ඉත්‍ථින්‍ද්‍රිය පුරිසින්‍ද්‍රිය ජීවිතින්‍ද්‍රිය යොදන ලදි. සුඛින්‍ද්‍රිය දුක්ඛින්‍ද්‍රිය දොම්නස් ඉන්‍ද්‍රිය ප්‍රතිසන්ධියක් නැතැයි නොගන්නා ලදි. සොම්නස් ඉන්‍ද්‍රිය උපෙක්ඛා ඉන්‍ද්‍රිය ප්‍රතිසන්ධිය උපත් ස්වභාවයෙන් ගන්නා ලදි. එසේම සද්ධා ඉන්‍ද්‍රියාදි පහද ලෝකෝත්තර තුන ප්‍රතිසන්ධිායෙහි අභාවයෙන් ම නොගන්නා ලදි. මෙසේ යමක් ගන්නා ලදද මෙහි ඒවා අනුව චක්ඛුන්‍ද්‍රිය මූලක නයෙහි යමක ගණන දතයුතුය. යම්සේ මෙහි ද සියළු තැන එසේය. යමක් වනාහි නො ගන්නා ලදද ඒවායේ වශයෙන් යමක නොගත යුතුය. ගණන් ගන්නේ නම් මොඝ පුච්ඡා වශයෙන් ගණන් ගතයුතුය. මෙසේ සියළු වාරවල පෙළෙහි නියමය දතයුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 75,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "පවත්තිවාරවණ්ණනා",
                        "level": 1,
                        "keyOffset": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථවිනිච්ඡයෙ පනෙත්ථ ඉදං නයමුඛං – **සචක්ඛුකානං න ඉත්ථීන**න්ති බ්රහ්මපාරිසජ්ජාදීනඤ්චෙව රූපීනං පුරිසනපුංසකානඤ්ච වසෙන වුත්තං. තෙසඤ්හි ඉත්ථින්ද්රියං නුප්පජ්ජති. **සචක්ඛුකානං න පුරිසාන**න්ති රූපීබ්රහ්මානඤ්චෙව ඉත්ථිනපුංසකානඤ්ච වසෙන වුත්තං. තෙසඤ්හි පුරිසින්ද්රියං නුප්පජ්ජති. **අචක්ඛුකානං උපපජ්ජන්තානං තෙසං ජීවිතින්ද්රියං උප්පජ්ජතී**ති එකවොකාරචතුවොකාරකාමධාතුසත්තෙ සන්ධාය වුත්තං. **සචක්ඛුකානං විනා සොමනස්සෙනා**ති උපෙක්ඛාසහගතානං චතුන්නං මහාවිපාකපටිසන්ධීනං වසෙන වුත්තං. **සචක්ඛුකානං විනා උපෙක්ඛායා**ති සොමනස්සසහගතපටිසන්ධිකානං වසෙන වුත්තං. **උපෙක්ඛාය අචක්ඛුකාන**න්ති අහෙතුකපටිසන්ධිවසෙන වුත්තං. **අහෙතුකාන**න්ති අහෙතුකපටිසන්ධිචිත්තෙන සද්ධිං සද්ධින්ද්රියාදීනං අභාවතො වුත්තං. තත්ථ හි එකන්තෙනෙව සද්ධාසතිපඤ්ඤායො නත්ථි. සමාධිවීරියානි පන ඉන්ද්රියප්පත්තානි න හොන්ති. **සහෙතුකානං අචක්ඛුකාන**න්ති ගබ්භසෙය්යකවසෙන චෙව අරූපීවසෙන ච වුත්තං. අඤ්ඤො හි සහෙතුකො අචක්ඛුකො නාම නත්ථි. **සචක්ඛුකානං අහෙතුකාන**න්ති අපායෙ ඔපපාතිකවසෙන වුත්තං. **සචක්ඛුකානං ඤාණවිප්පයුත්තාන**න්ති කාමධාතුයං දුහෙතුකපටිසන්ධිකානං වසෙන වුත්තං. **සචක්ඛුකානං ඤාණසම්පයුත්තාන**න්ති රූපීබ්රහ්මානො චෙව කාමාවචරදෙවමනුස්සෙ ච සන්ධාය වුත්තං. **ඤාණසම්පයුත්තානං අචක්ඛුකාන**න්ති අරූපිනො ච තිහෙතුකගබ්භසෙය්යකෙ ච සන්ධාය වුත්තං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ජීවිතින්ද්රියමූලකෙ **විනා සොමනස්සෙන උපපජ්ජන්තාන**න්ති ද්වෙපි ජීවිතින්ද්රියානි සන්ධාය වුත්තං. **පවත්තෙ සොමනස්සවිප්පයුත්තචිත්තස්ස උප්පාදක්ඛණෙ**ති අරූපජීවිතින්ද්රියං සන්ධාය වුත්තං. ඉමිනා නයෙන සබ්බත්ථාපි පටිසන්ධිපවත්තිවසෙන ජීවිතින්ද්රියයොජනා වෙදිතබ්බා. සොමනස්සින්ද්රියාදිමූලකෙසුපි පටිසන්ධිපවත්තිවසෙනෙවත්ථො ගහෙතබ්බො. පටිලොමනයෙ පන නිරොධවාරෙ ච එතෙසඤ්චෙව අඤ්ඤෙසඤ්ච ධම්මානං යථාලාභවසෙන චුතිපටිසන්ධිපවත්තෙසු තීසුපි අනුප්පාදනිරොධා වෙදිතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "අනාගතවාරෙ **එතෙනෙව භාවෙනා**ති එතෙන පුරිසභාවෙනෙව, අන්තරා ඉත්ථිභාවං අනාපජ්ජිත්වා පුරිසපටිසන්ධිග්ගහණෙනෙවාති අත්ථො. **කතිචි භවෙ දස්සෙත්වා පරිනිබ්බායිස්සන්තී**ති කතිචි පටිසන්ධියො ගහෙත්වා ඉත්ථිභාවං අප්පත්වාව පරිනිබ්බායිස්සන්තීති අත්ථො. දුතියපුච්ඡායපි එසෙව නයො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "පවත්තිවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙහි අර්ථ විනිශ්චයෙහි වනාහි මේ නයමුඛය වේ. **සචක්ඛුකානං න ඉත්‍ථීනං** බ්‍රහ්ම පාරිසජ්ජාදීන් මෙන්ම රූපීන් ද නපුංසක පුරුෂයන් ද වශයෙන් කියන ලදි. ඔවුන්ට ද ඉත්‍ථීන්‍ද්‍රිය නූපදී. **සචක්ඛුකානං න පුරිසානං** රූපී බ්‍රහ්මයන්ට ද ස්ත්‍රී නපුංසකයන්ට ද වශයෙන් කියන ලදි. ඔවුන්ට පුරිසින්‍ද්‍රිය නූපදී. **අචක්ඛුකානං උප්පජ්ජන්තානං තෙසං ජීවිතින්‍ද්‍රියං උප්පජ්ජති** ඒකවෝකාර, චතුවෝකාර, කාමධාතු සත්ත්වයන් සඳහා කියන ලදි. **සචක්ඛුකානං විනා සොමනස්සෙන** උපේක්‍ෂා සහගත සතර විපාක ප්‍රතිසන්ධි වශයෙන් කියන ලදි. **සචක්ඛුකානං විනා උපෙක්ඛාය** සෝමනස්ස සහගත ප්‍රතිසන්ධිකයන්ගේ වශයෙන් කියන ලදි. **උපෙක්ඛාය අචක්ඛුකානං** අහේතුක ප්‍රතිසන්ධි වශයෙන් කියන ලදි. **අහෙතුකානං** අහේතුක ප්‍රතිසන්ධි සිත සමග සද්ධින්‍ද්‍රියන්ගේ අභාවයන් කියන ලදි. එහි ඒකාන්තයෙන් ම සද්ධා, සති, පඤ්ඤා ආදිය නැත. සමාධි විරිය වනාහි ඉන්‍ද්‍රිය බවට නොපැමිණේ. **සහෙතුකානං අචක්ඛුකානං** ගබ්භසෙය්‍යක වශයෙන් ද අරූපී වශයෙන් ද කියන ලදි. වෙන සහේතුක අචක්ඛුක නම් නැත. **සචක්ඛුකානං අහෙතුකානං** අපායෙහි ඕපපාතික වශයෙන් කියන ලදි. **සචක්ඛුකානං ඤාණ විප්පයුත්තානං** කාම ධාතුවෙහි දුහේතුක ප්‍රතිසන්ධිකයන්ගේ වශයෙන් කියන ලදි. **සචක්ඛුකානං ඤාණ සම්පයුත්තානං** රූපී බ්‍රහ්මයෝ ද කාමාවචර දෙවි මිනිසුන් ද සඳහා කියන ලදි. **ඤාණ සම්පයුත්තානං අචක්ඛුකානං** අරූපීන් ද ත්‍රිහේතුක ගබ්භසෙය්‍යකයන් ද සඳහා කියන ලදි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ජීවිතින්‍ද්‍රිය මූලකයෙහි **විනා සොමනස්සෙන උපපජ්ජන්තානං** ජීවිතින්‍ද්‍රිය දෙක සඳහා කියන ලදි. **පවත්තෙ සොමනස්ස විප්පයුත්තස්ස උප්පාදක්ඛණෙ** අරූපී ජීවිතින්‍ද්‍රිය සඳහා කියන ලදි. මෙම නයින් සියළු තැන ප්‍රතිසන්ධි පැවැත්ම වශයෙන් ජීවිතින්‍ද්‍රිය යෙදීම් දතයුතුය. සෝමනස්ස ඉන්‍ද්‍රිය මූලකවල ද ප්‍රතිසන්ධි පැවැත්ම වශයෙන් අර්ථය ගතයුතුය. පටිලෝම නයෙහි වනාහි නිරෝධ වාරයෙහි ද මේවායෙහි ද අන්‍ය ඒවායේ ද ධර්මයන්ගේ යථාලාභ (ලැබීම්) වශයෙන් චුති පටිසන්ධි පැවැත්මෙහි අනුත්පාද නිරෝධ තුන ද දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "අනාගත වාරයෙහි **එතෙනෙව භාවෙන** මේ පුරුෂ භාවයෙන්ම අතර ඉත්‍ථිභාවයට නොපැමිණ පුරිස පටිසන්ධි ගැනීමෙන් යයි අර්ථ වේ. **කති චි භවෙ දස්සෙත්‍වා පරිනිබ්බායිස්සති** ප්‍රතිසන්ධි කීයක් ගෙන ස්ත්‍රී භාවයට නොපැමිණම පිරිනිවන්පාන්නේ ද යන අර්ථයයි. දෙවන පුච්ඡාවෙහි ද මෙම නයම වේ."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 77,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පච්චුප්පන්නෙන අතීතවාරෙ **සුද්ධාවාසානං උපපත්තිචිත්තස්ස භඞ්ගක්ඛණෙ මනින්ද්රියඤ්ච නුප්පජ්ජිත්ථා**ති චිත්තයමකෙ විය උප්පාදක්ඛණාතික්කමවසෙන අත්ථං අග්ගහෙත්වා තස්මිං භවෙ අනුප්පන්නපුබ්බවසෙන ගහෙතබ්බොති. ඉමිනා නයමුඛෙන සබ්බස්මිම්පි පවත්තිවාරෙ අත්ථවිනිච්ඡයො වෙදිතබ්බො."
                    },
                    {
                        "type": "centered",
                        "text": "පවත්තිවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරිඤ්ඤාවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "පරිඤ්ඤාවාරෙ පන චක්ඛුමූලකාදීසු එකමෙව චක්ඛුසොතයමකං දස්සිතං. යස්මා පන සෙසානිපි ලොකියඅබ්යාකතානි චෙව ලොකියඅබ්යාකතමිස්සකානි ච පරිඤ්ඤෙය්යානෙව, තස්මා තානි අනුපදිට්ඨානිපි ඉමිනාව දස්සිතානි හොන්ති. යස්මා පන අකුසලං එකන්තතො පහාතබ්බමෙව, එකන්තං කුසලං භාවෙතබ්බමෙව, ලොකුත්තරාබ්යාකතං සච්ඡිකාතබ්බං, තස්මා “දොමනස්සින්ද්රියං පජහතී”ති “අනඤ්ඤාතඤ්ඤස්සාමීතින්ද්රියං භාවෙතී”ති “අඤ්ඤාතාවින්ද්රියං සච්ඡිකරොතී”ති වුත්තං. අඤ්ඤින්ද්රියං පන භාවෙතබ්බම්පි අත්ථි සච්ඡිකාතබ්බම්පි, තං භාවනාවසෙනෙව ගහිතං. තත්ථ **ද්වෙ පුග්ගලා**ති සකදාගාමිමග්ගසමඞ්ගී ච, අරහත්තමග්ගසමඞ්ගී ච. තෙසු එකො සමුච්ඡින්දිතුං අසමත්ථත්තා දොමනස්සින්ද්රියං න පජහති නාම. එකො පහීනදොසත්තා **චක්ඛුන්ද්රියං න පරිජානාතී**ති අනුප්පාදං ආපාදෙතුං අසමත්ථතාය න පරිජානාති. ඉමිනා නයෙන සබ්බවිස්සජ්ජනෙසු අත්ථො වෙදිතබ්බොති."
                    },
                    {
                        "type": "centered",
                        "text": "පරිඤ්ඤාවාරවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "ඉන්ද්රියයමකවණ්ණනා නිට්ඨිතා.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "නිගමනකථා",
                        "level": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "එත්තාවතා ච –"
                    },
                    {
                        "type": "gatha",
                        "text": "යස්සොවාදෙ ඨත්වා, නිට්ඨිතකිච්චස්ස කිච්චසම්පන්නො;\nයුවතිජනොපි අතීතො, සුවිහිතනියමො යමස්සාණං.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "දෙවපරිසාය මජ්ඣෙ, දෙවපුරෙ සබ්බදෙවදෙවෙන;\nයමකං නාම පකාසිතං, යමාමලලොමෙන යං තෙන.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "පාළිවවත්ථානවිධිං, පුච්ඡාවිස්සජ්ජනෙ ච අත්ථනයං;\nදස්සෙතුං ආරද්ධා, යමකඅට්ඨකථා මයා තස්ස.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "සා සුබහුඅන්තරායෙ, ලොකම්හි යථා අනන්තරායෙන;\nඅයමජ්ජ පඤ්චමත්තෙහි, තන්තියා භාණවාරෙහි.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "නිට්ඨං පත්තා එවං, නිට්ඨානං පාපුණන්තු සබ්බෙපි;\nහිතසුඛනිබ්බත්තිකරා, මනොරථා සබ්බසත්තානන්ති.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "යමකප්පකරණ-අට්ඨකථා නිට්ඨිතා.",
                        "level": 2
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "වර්තමානයේ අතීත වාරයේ නොවේ. **සුද්ධාවාසානං උපපත්ති චිත්තස්ස භංගක්ඛණෙ මනින්‍ද්‍රියඤ්ච නූප්පජ්ජිත්‍ථ** චිත්ත යමකයෙහි මෙන් උත්පාද ක්‍ෂණ ඉක්මවීම් වශයෙන් අර්ථය නොගෙන ඒ භවයෙහි නූපන් පෙර වශයෙන් ගතයුතුය. මෙම නය මුඛයෙන් සියළු පැවැත්ම වාරයෙහි අර්ථ විනිශ්චය දතයුතුය."
                    },
                    {
                        "type": "centered",
                        "text": "",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරිඤ්ඤාවාරවණ්ණනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "පරිඤ්ඤා වාරයෙහි වනාහි චක්ඛු මූලාදියෙහි එකම චක්ඛුසොත යමකය දක්වන ලදි. යම්හෙයකින් වනාහි බැලිය හැකි අබ්‍යාකතා ද ලෞකික අබ්‍යාකත මිශ්‍රවද වැඩීමෙන්ම වේ. එහෙයින් ඒවා නො දක්වන ලද්දේ ද මෙයම දක්වන ලදි. යම්හෙයකිාන් වනාහි අකුසලය ඒකාන්තයෙන් ප්‍රහාණය කළයුතුමය. කුසලය ඒකාන්තයෙන් වැඩිය යුතුය. ලෝකෝත්තර අබ්‍යාකතය සාක්‍ෂාත් කළයුතුය. එහෙයින් **දොමනස්සින්‍ද්‍රියං පජහති** දොම්නස් ඉන්‍ද්‍රිය දුරුකරයි. **අනඤ්ඤාතඤ්ඤස්සාමීතින්‍ද්‍රිය** වැඩිය යුතුයයි ද අඤ්ඤතාවින්‍ද්‍රිය සාක්‍ෂාත් කළයුතු යයි ද කියන ලදි. අඤ්ඤින්‍ද්‍රිය වනාහි වැඩිය යුත්තක් ද ඇත. සාක්‍ෂාත් කළයුත්තක් ද ඇත. එය භාවනා වශයෙන් ම ගන්නා ලදි. එහි **දෙව පුග්ගලා** යයි සකදාගාමි මාර්ගයුත්තාද අරහත් මාර්ග යුත්තාද ඔවුනතුරෙන් එක්කෙනෙක් සමුච්ඡේද කිරීමට අසමර්ථ බැවින් දොම්නස් ඉන්‍ද්‍රිය දුරු නොකෙරේ නම් වේ. එක්කෙනෙක් දෝස ප්‍රහීන බැවින් **චක්ඛුන්‍ද්‍රියං න පරිජානාති** යයි අනුප්පාදයට පැමිණීමට අසමත් බැවින් නොදනී. මෙම නයින් සියළු විසඳුම්වල අර්ථය දතයුතුය."
                    },
                    {
                        "type": "centered",
                        "text": "",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "ඉන්‍ද්‍රිය යමක වර්ණනා නිමි.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "නිගමන කථා",
                        "level": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙපමණකින් -"
                    },
                    {
                        "type": "gatha",
                        "text": "ඔවායෙහි පිහිටා - නිමි කිස කිසයුත් තමා\nයුවතිය ද පෙරදා - කෙළේ නියම අණ සොඳින්",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "දෙව්පුරයෙහි සියළු - දෙව්පිරිස මැද වැඩහිඳ\nදෙසී යමකය නම් - ගුණ’ගමිණි මුනිරජ ‘තුම්",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "පෙළ නියම විදියද - පුළුවුත් විසඳුම් නයද\nදක්වනු ඇරඹි මා - යමකයෙ අටුවා කතා",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "ලොවැ බහුල අනතුරු - නැතිවම කිසි අනතුරු\nඅද එය වන පහක - පමණ බණවර පෙළෙහි",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "නිමවී එය මෙසේ - පැමිණෙනු හැම නිමාවට\nහිතසුව නිවුම වෙත - හැමසත් පැතුම් විලසේ",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "යමකප්පකරණ අටුවාව නිමි.",
                        "level": 2
                    }
                ],
                "footnotes": []
            }
        }
    ],
    "bookId": 44,
    "pageOffset": 0,
    "collection": "atta"
}