{
    "filename": "atta-an-1-15",
    "pages": [
        {
            "pageNum": 543,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "අට්ඨානපාළි",
                        "level": 3
                    },
                    {
                        "type": "centered",
                        "text": "අට්ඨානපාළි-පඨමවග්ගවණ්ණනා",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "අට්ඨානපාළියා **අට්ඨාන**න්ති හෙතුපටික්ඛෙපො. **අනවකාසො**ති පච්චයපටික්ඛෙපො. උභයෙනාපි කාරණමෙව පටික්ඛිපති. කාරණඤ්හි තදායත්තවුත්තිතාය අත්තනො ඵලස්ස ඨානන්ති ච අවකාසොති ච වුච්චති. **ය**න්ති යෙන කාරණෙන. **දිට්ඨිසම්පන්නො**ති මග්ගදිට්ඨියා සම්පන්නො සොතාපන්නො අරියසාවකො. තස්ස හි දිට්ඨිසම්පන්නො ඉතිපි, දස්සනසම්පන්නො ඉතිපි, ආගතො ඉමං සද්ධම්මං ඉතිපි, පස්සති ඉමං සද්ධම්මං ඉතිපි, සෙක්ඛෙන ඤාණෙන සමන්නාගතො ඉතිපි, සෙක්ඛාය විජ්ජාය සමන්නාගතො ඉතිපි, ධම්මසොතසමාපන්නො ඉතිපි, අරියො නිබ්බෙධිකපඤ්ඤො ඉතිපි, අමතද්වාරං ආහච්ච තිට්ඨති ඉතිපිති බහූනි නාමානි හොන්ති. **කඤ්චි සඞ්ඛාර**න්ති චතුභූමකෙසු සඞ්ඛතසඞ්ඛාරෙසු කඤ්චි එකං සඞ්ඛාරම්පි. **නිච්චතො උපගච්ඡෙය්යා**ති නිච්චොති ගණ්හෙය්ය. **නෙතං ඨානං විජ්ජතී**ති එතං කාරණං නත්ථි න උපලබ්භති. **යං පුථුජ්ජනො**ති යෙන කාරණෙන පුථුජ්ජනො. **ඨානමෙතං විජ්ජතී**ති එතං කාරණං අත්ථි. සස්සතදිට්ඨියා හි සො තෙභූමකෙසු සඞ්ඛතසඞ්ඛාරෙසු කඤ්චි සඞ්ඛාරං නිච්චතො ගණ්හෙය්යාති අත්ථො. චතුත්ථභූමකසඞ්ඛාරා පන තෙජුස්සදත්තා දිවසංසන්තත්තො අයොගුළො විය මක්ඛිකානං, දිට්ඨියා වා අඤ්ඤෙසං වා අකුසලානං ආරම්මණං න හොන්ති. ඉමිනා නයෙන **කඤ්චි සඞ්ඛාරං සුඛතො**තිආදීසුපි අත්ථො වෙදිතබ්බො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "අට්ඨාන පාළිය",
                        "level": 3
                    },
                    {
                        "type": "centered",
                        "text": "",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "අට්ඨනෙ පාළියෙහි **අට්ඨානං** යනු හේතු ප්‍රතික්‍ෂෙපයයි. **අනවකාසො** යනු ප්‍රත්‍යය ප්‍රතික්‍ෂෙපයයි. දෙකින්ම කාරණය (සාධකය)ම ප්‍රතික්‍ෂෙප කරයි. කාරණය වනාහි එයට අයත් පැවත්ම ඇති බැවින් තමන්ගේ ඵලයට ස්ථානයයිද අවකාශයයිද කියනු ලැබේ. **යං** යනු යම්කිසි කරුණකින්ය. **දිට්ඨසම්පනේනා** යනු මාර්‍ගදෘෂ්ටියෙන් යුක්තවූ සෝවාන් ආර්‍ය්‍යශ්‍රාවක තෙමේයි. ඔහුට වනාහි දෘෂ්ටියෙන් යුක්තවූයේ යනුද මේ සද්ධර්‍මයට පැමිණියේ යනුද මේ සද්ධර්‍මය දකියි යනුද ශෛක්‍ෂ ඥානයෙන් යුක්තවූයේ යනුද ශෛක්‍ෂ විද්‍යාවෙන් යුක්තවූයේ යනුද ධර්‍ම ශ්‍රොතසින් යුක්තවූයේ යනුද ආර්‍ය්‍යවූ තියුණු ප්‍රඥ ඇත්තේ යනුද අමා දොර පැහැර සිටී යනුද බොහෝ නම් වෙත්. **කඤ්චි සංඛාරං** යනු චාතුර් භුමික වූ සංස්කාරයන් අතුරෙන් කිසි එක් සංස්කාරයකුදු යනුයි. **නිච්චතො උපගචේඡය්‍ය** යනු නිත්‍යයයි ගන්නෙයි**. නෙතං ඨානං විජ්ජති** යනු මේ කාරණය නැත. නොඑළමේ යනුයි. **යං පුථුජ්ජනො** යනු යම් කරුණකින් පෘථග්ජනවූයේයි. **ඨානමෙතං විජ්ජති** යනු මේ කාරණය ඇත යනුයි. ශාශ්වත දෘස්ටියෙන් හෙතෙම ත්‍රෛභූමික සංස්කාරයන්ගෙන් කිසි සංස්කාරයක් නිත්‍ය වශයෙන් ගන්නේය යනාර්‍ත්‍ථයි. චාතුර්ථභූමක සංස්කාරයෝ වනාහි තෙද වැඩිබැවින් මැස්සන්ට දවසම රත්වූ යගුළියක් මෙන් දෘෂ්ටියට හෝ අනෙක් අකුසලයන්ට හෝ අරමුණක් නොවෙත්. මේ ක්‍රමයෙන් **කංචි සංඛාරං සුඛතො** යනාදියෙහිද අර්‍ත්‍ථය දතයුතුයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 545,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**සුඛතො උපගච්ඡෙය්යා**ති “එකන්තසුඛී අත්තා හොති ආරොගො පරම්මරණා”ති (දී· නි· 1.76, 79; ම· නි· 3.21, 22) එවං අත්තදිට්ඨිවසෙන සුඛතො ගාහං සන්ධායෙතං වුත්තං. දිට්ඨිවිප්පයුත්තචිත්තෙන පන අරියසාවකො පරිළාහාධිභූතො පරිළාහවූපසමත්ථං මත්තහත්ථිපරිත්තාසිතො විය චොක්ඛබ්රාහ්මණො ගූථං කඤ්චි සඞ්ඛාරං සුඛතො උපගච්ඡති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්තවාරෙ කසිණාදිපණ්ණත්තිසඞ්ගහත්ථං “සඞ්ඛාර”න්ති අවත්වා **කඤ්චි ධම්ම**න්ති වුත්තං. ඉධාපි අරියසාවකස්ස චතුභූමකවසෙන පරිච්ඡෙදො වෙදිතබ්බො, පුථුජ්ජනස්ස තෙභූමකවසෙන. සබ්බවාරෙසු වා අරියසාවකස්සාපි තෙභූමකවසෙනෙව පරිච්ඡෙදො වට්ටති. යං යං හි පුථුජ්ජනො ගණ්හාති, තතො තතො අරියසාවකො ගාහං විනිවෙඨෙති. පුථුජ්ජනො හි යං යං නිච්චං සුඛං අත්තාති ගණ්හාති, තං තං අරියසාවකො අනිච්චං දුක්ඛං අනත්තාති ගණ්හන්තො තං ගාහං විනිවෙඨෙති. ඉති ඉමස්මිං සුත්තත්තයෙ පුථුජ්ජනත්තග්ගාහවිනිවෙඨනං නාම කථිතං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**මාතර**න්තිආදීසු ජනිකාව මාතා, ජනකොව පිතා, මනුස්සභූතොව ඛීණාසවො අරහාති අධිප්පෙතො. කිං පන අරියසාවකො අඤ්ඤං ජීවිතා වොරොපෙය්යාති? එතම්පි අට්ඨානං. සචෙපි භවන්තරගතං අරියසාවකං අත්තනො අරියසාවකභාවං අජානන්තම්පි කොචි එවං වදෙය්ය “ඉමං කුන්ථකිපිල්ලිකං ජීවිතා වොරොපෙත්වා සකලචක්කවාළගබ්භෙ චක්කවත්තිරජ්ජං පටිපජ්ජාහී”ති, නෙව සො තං ජීවිතා වොරොපෙය්ය. අථාපි නං එවං වදෙය්යුං “සචෙ ඉමං න ඝාතෙස්සසි, සීසං තෙ ඡින්දිස්සාමා”ති. සීසමෙවස්ස ඡින්දෙය්යුං, න ච සො තං ඝාතෙය්ය. පුථුජ්ජනභාවස්ස පන මහාසාවජ්ජභාවදස්සනත්ථං අරියසාවකස්ස ච බලවදීපනත්ථමෙතං වුත්තං. අයඤ්හෙත්ථ අධිප්පායො – සාවජ්ජො පුථුජ්ජනභාවො, යත්ර හි නාම පුථුජ්ජනො මාතුඝාතාදීනිපි ආනන්තරියානි කරිස්සති. මහාබලො ච අරියසාවකො, යො එතානි කම්මානි න කරොතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පදුට්ඨචිත්තො**ති වධකචිත්තෙන පදුට්ඨචිත්තො. **ලොහිතං උප්පාදෙය්යා**ති ජීවමානකසරීරෙ ඛුද්දකමක්ඛිකාය පිවනමත්තම්පි ලොහිතං උප්පාදෙය්ය."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සඞ්ඝං භින්දෙය්යා**ති සමානසංවාසකං සමානසීමාය ඨිතං පඤ්චහි කාරණෙහි සඞ්ඝං භින්දෙය්ය. වුත්තම්පි චෙතං “පඤ්චහුපාලි, ආකාරෙහි සඞ්ඝො භිජ්ජති – කම්මෙන, උද්දෙසෙන, වොහරන්තො, අනුස්සාවනෙන, සලාකග්ගාහෙනා”ති (පරි· 458)."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**සුඛතො උපගචේඡය්‍ය** යනු ඒකාන්ත සුඛවූ ආත්මයක් වෙයි. මරණින් මතු රෝග නැත්තේයි මෙසේ ආත්මදෘෂ්ටි වශයෙන් ගැනීම සඳහා කියනලදී. පරිළාහයෙන් මැඩුණු ආර්යශ්‍රාවකතෙමේ දෘෂ්ටියෙන් තොර සිතින් මත් ඇතෙකු නිසා තැතිගත් පිරිසිදු බමුණෙකු අශූචියකට මෙන් කිසියම් සංස්කාරයකට එළමෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ආත්මවාරයෙහි කසිණාදී ප්‍රඥප්ති සංග්‍රහ කරනු සඳහා සංස්කාරයයි නොකියා **කංචධම්මංයි** (කිසිධර්‍මයකැයි) කියනලදී. මෙහිදී ආර්‍ය්‍යශ්‍රාවකයාගේ චාතුර්භූමික වශයෙන් පරිච්ඡේදය (සීමාව) දතයුතුයි. පෘථග්ජනයාගේ ත්‍රෛභූමික වශයෙනි. සියලු වාරයෙහි හෝ ආර්‍ය්‍යශ්‍රමකයාගේද ත්‍රෛභූමික වශයෙන් පරිච්ඡේදය වටියි. පෘථග්ජනයා යමක් යමක් ගනීද එයින් ආර්‍ය්‍යශ්‍රාවකයා ගැනීම අන් අතට පෙරළයි. පෘථග්ජනයා වනාහි යමක් යමක් නිත්‍ය්‍ය, සැපය, ආත්මයයි ගනීද ආර්‍ය්‍යශ්‍රාවකයා එය අනිත්‍යය, දු:ඛය, අනාත්මයයි ගන්නේ ඒ ගැනීම අන් අතට පෙරළයි. මෙසේ මේ සූත්‍ර තුනෙහි පෘථග්ජනයාගේ ආත්ම ග්‍රහය පෙරළා දැමීම නම්වූ දෙය කියනලදී."
                    },
                    {
                        "type": "paragraph",
                        "text": "**මාතරං** යනාදියෙහි උපදවන්නීම මවයි. උපදවන්නා පියායි. මිනිසෙක්වූ ක්‍ෂීණාශ්‍රවයන්වහන්සේ රහතන්වහන්සේයයි අදහස් කරනලදී. කිමෙක්ද ආර්යශ්‍රාවක තෙමේ අන්‍යයෙකු ජීවිතයෙන් තොරකරන්නේද? යන මෙයද අහේතුකය (නොසිදුවේ). ඉදින් තමන් ආර්‍ය්‍යශ්‍රාවකයෙකුබවට නොදන්නාවූ භවාන්තරගත (කළුරිය කළ) ආර්‍ය්‍යශ්‍රාවකයෙකුට යමෙක් ‘මේ කුරුකුහුඹියා ජීවිතයෙන් තොර කොට සියලු සක්වල ගැබෙහි සක්විති රජකම පිළිපදුව’යි මෙසේ කියන්නේද හෙතෙම ඒ කුරුකුහුමියා ජීවිතයෙන් තොර නොකරන්නේමය. තවද ඔහුට, ඉදින් මොහු නොමරන්නෙහි නම් ඔබේ හිස සිඳින්නෙමු’යි මෙසේ කියන්නහුද ඔහුගේ හිසම සිඳින්නාහුය. හෙතෙම ඔහු නොමරන්නේමය. පාථග්ජන භාවයාගේ මහා සාවද්‍යබව දැක්වීම සඳහාත් ආර්‍ය්‍යශ්‍රාවකයාගේ බලය දැක්වීම සඳහාත් මෙය කියනලදී. මෙයම මෙහි අභිප්‍රායයි: ‘පෘථග්ජනභාවය සාවද්‍යය. යම් තැනක පෘථග්ජන තෙමේ මවුමැරීම් ආදී ආනන්තර්යයන් කරන්නේද යම් මහා බලවත්වූ ආර්‍ය්‍යශ්‍රාවක කෙනෙක් වේද හෙතෙම මේ කර්‍ම නොකරයි.’"
                    },
                    {
                        "type": "paragraph",
                        "text": "**දුට්ඨචිත්තෝ** යනු වධක සිතින් ප්‍රදුෂ්‍යවූ සිත් ඇත්තෙයි. **ලොහිතං උප්පාදෙය්‍ය,** යනු ජීවත් වන ශරීරයෙහි කුඩා මැස්සකු බෙනා තරම්වූද ලේ උපදවන්නේයි"
                    },
                    {
                        "type": "paragraph",
                        "text": "**සංඝංහින්‍දෙය්‍ය** යනු සමාන සංවාසකවූ සමාන සීමාවෙහි සිටියාවූ සංඝයා කරුණු පසකින් බිඳුවන්නේය. මෙය කියනලද්දේමැයි: ‘උපාලි, පස් ආකාරයකින් සංඝයා බිඳෙයි. (සංඝ) කර්‍මයෙන්, උදෙසීමෙන්, (අධර්‍මය ධර්‍මයයි ආදී වශයෙන්) බැවහර කරමින්, අනුශ්‍රාවනයෙන් ලහගැනීමෙන් (යන කරුණු පසිනි.)"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 547,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තත්ථ **කම්මෙනා**ති අපලොකනාදීසු චතූසු කම්මෙසු අඤ්ඤතරෙන කම්මෙන. **උද්දෙසෙනා**ති පඤ්චසු පාතිමොක්ඛුද්දෙසෙසු අඤ්ඤතරෙන උද්දෙසෙන. **වොහරන්තො**ති කථයන්තො, තාහි තාහි උප්පත්තීහි **අධම්මං ධම්මො**තිආදීනි අට්ඨාරස භෙදකරවත්ථූනි දීපෙන්තො. **අනුස්සාවනෙනා**ති “නනු තුම්හෙ ජානාථ මය්හං උච්චාකුලා පබ්බජිතභාවං බහුස්සුතභාවඤ්ච, මාදිසො නාම උද්ධම්මං උබ්බිනයං සත්ථු සාසනං ගාහෙය්යාති චිත්තම්පි උප්පාදෙතුං න තුම්හාකං යුත්තං, කිං මය්හං අවීචි නීලුප්පලවනං විය සීතලා, කිං අහං අපායතො න භායාමී”තිආදිනා නයෙන කණ්ණමූලෙ වචීභෙදං කත්වා අනුස්සාවනෙන. **සලාකග්ගාහෙනා**ති එවං අනුස්සාවෙත්වා තෙසං චිත්තං උපත්ථම්භෙත්වා අනිවත්තිධම්මෙ කත්වා “ගණ්හථ ඉමං සලාක”න්ති සලාකග්ගාහෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "එත්ථ ච කම්මෙව උද්දෙසො වා පමාණං, වොහාරානුස්සාවනසලාකග්ගාහා පන පුබ්බභාගා. අට්ඨාරසවත්ථුදීපනවසෙන හි වොහරන්තෙන තත්ථ රුචිජනනත්ථං අනුස්සාවෙත්වා සලාකාය ගහිතායපි අභින්නොව හොති සඞ්ඝො. යදා පන එවං චත්තාරො වා අතිරෙකා වා සලාකං ගහෙත්වා ආවෙණිකං කම්මං වා උද්දෙසං වා කරොන්ති, තදා සඞ්ඝො භින්නො නාම හොති. එවං දිට්ඨිසම්පන්නො පුග්ගලො සඞ්ඝං භින්දෙය්යාති නෙතං ඨානං විජ්ජති. එත්තාවතා මාතුඝාතාදීනි පඤ්ච ආනන්තරියකම්මානි දස්සිතානි හොන්ති, යානි පුථුජ්ජනො කරොති, න අරියසාවකො. තෙසං ආවිභාවත්ථං –"
                    },
                    {
                        "type": "gatha",
                        "text": "“කම්මතො ද්වාරතො චෙව, කප්පට්ඨිතියතො තථා;\nපාකසාධාරණාදීහි, විඤ්ඤාතබ්බො විනිච්ඡයො”.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ථ **කම්මතො** තාව – එත්ථ හි මනුස්සභූතස්සෙව මනුස්සභූතං මාතරං වා පිතරං වා අපි පරිවත්තලිඞ්ගං ජීවිතා වොරොපෙන්තස්ස කම්මං ආනන්තරියං හොති, තස්ස විපාකං පටිබාහිස්සාමීති සකලචක්කවාළං මහාචෙතියප්පමාණෙහිපි කඤ්චනථූපෙහි පූරෙත්වාපි සකලචක්කවාළං පූරෙත්වා නිසින්නස්ස භික්ඛුසඞ්ඝස්ස මහාදානං දත්වාපි බුද්ධස්ස භගවතො සඞ්ඝාටිකණ්ණං අමුඤ්චන්තො විචරිත්වාපි කායස්ස භෙදා නිරයමෙව උපපජ්ජති. යො පන සයං මනුස්සො තිරච්ඡානභූතං මාතරං වා පිතරං වා, සයං වා තිරච්ඡානභූතො මනුස්සභූතං, තිරච්ඡානභූතොයෙව වා තිරච්ඡානභූතං ජීවිතා වොරොපෙති, තස්ස කම්මං ආනන්තරියං න හොති, භාරියං පන හොති, ආනන්තරියං ආහච්චෙව තිට්ඨති. මනුස්සජාතිකානංව පන වසෙන අයං පඤ්හො කථිතො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එහි **කම්මේන** යනු අපලොකනාදී කර්‍ම සතර අතුරින් එක්තරා කර්‍මයකිනි. **උද්දේසෙන** යනු පාමොක් උදෙසීම් පසින් එක්තරා උදෙසීමකිනි. **වොහරනතො** යනු කියන්නේයි, ඒ ඒ උත්පත්නීන්ගෙන් අධර්‍මය ධර්‍මයයයි ආදී වශයෙන් වූ අටළොස් භේදකරවස්තූන් දක්වන්නේයි. **අනුසාවනෙන** යනු ‘නුඹලා මගේ උසස් කුලයෙන් පැවිදිවූබවද බොහෝ ඇසූ පිරූ තැන් ඇතිබවද නොදන්නහුද? මා වැන්නෙක් නම් ධර්‍මයට විරුද්ධවූ විනයට විරුද්ධවූ ශාස්තෘශාසනයක් ගන්නේයයි සිතක් උපදවන්නටද නුඹලාට සුදුසුද? කිම මට අවීචිය නිලුපුල්වනයක් මෙන් සිසිල්ද? කිම මම අපායට බිය නොවෙම්ද ආදී ක්‍රමයෙන් කන්මුල වාග්භේදයකොට අනුශ්‍රාවනය කිරීමෙනි. **සලාකගාහෙන** යනු මෙසේ අනුශ්‍රාවණයකොට ඔවුන්ගේ සිත් දැඩිකොට නොපෙරෙලෙනසුලුකොට මේ සලාකය ගනුවයි ලහගැන්වීමෙනි."
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙහිද කර්‍මයම හෝ උද්දේශය හෝ ප්‍රමාණවත්ය. ව්‍යවහාරය අනුසාවනය හා ලහගැන්වීම වනාහි පූර්‍වභාගයෝයි. අටළොස් වස්තූන් දැක්වීම් වශයෙන් ව්‍යවහාර කරන්නහු විසින් එහි කැමැත්ත දැනවීම සඳහා අනුශ්‍රාවණය කොට සලාකය ගත් කල්හිද සංඝයා නොබිඳුනේම වෙයි. යම් විටෙක වනාහි මෙසේ සතරක් හෝ වැඩියමක් ලහගෙන ආවෙණික් කර්‍ම හෝ උද්දේශය කරත්ද එකල්හි සංඝයා බිඳුනේනම් වෙයි. මෙසේ දෘෂ්ටියෙන් යුක්තවූ පුද්ගල තෙමේ සංඝයා බිඳින්නේය යන මෙයට හේතුවක් නොපෙනේ (නොසිදුවෙයි). මෙපමණකින් මව මැරීම ආදී ආනන්තර්ය කර්‍ම පස දක්වනලද්දේ වෙයි. පෘථග්ජනයා යමක් කෙරේද ආර්‍ය්‍යශ්‍රාවකයා ඒවා නොකරයි. එය ප්‍රකට කරනු සඳහා:-"
                    },
                    {
                        "type": "paragraph",
                        "text": "කර්‍මවශයෙන්ද ද්වාර වශයෙන්ද කල්පයක් තිබීම් වශයෙන්ද විපාකසාධාරණාදියෙන්ද විනිශ්ය දතයුත්තේය.{1}"
                    },
                    {
                        "type": "paragraph",
                        "text": "එහි කර්‍මවශයෙන් වනාහි, නොපෙරලුණු ලිංග ඇති මිනිස් මවක හෝ පියෙකු ජීවිතයෙන් තොර කරන්නාවූ මිනිසෙකුගේම කර්‍මය ආනන්තර්ය වෙයි. ඔහුගේ විපාකය වළක්වන්නෙමැයි සියලු සක්වළ මහා සෑය පමණවූ ස්වර්‍ණමය ස්තූපයන්ගෙන් පුරවාද සියලු සක්වල පුරවා හුන්නාවූ බික් සඟනට මහදන් දීද භාග්‍යවත් බුදුරජාණන්වහන්සේගේ සඟළ සිවුරු කොණ නොමුදමින් හැසිරීද කය බිඳීමෙන් නිරයෙහිම උපදියි. යමෙක් වනාහි තෙමේ මිනිසෙක්වූයේ තිරිසන්වූ මවක හෝ පියෙකු, තෙමේ තිරිසන්වූයේ මිනිස් මවක හෝ පියෙකු, (තෙමේ) තිරිසන්වූයේ තිරිසන්වූම මවක හෝ පියෙකු ජීවිතයෙන් තොර කරයිද ඔහුගේ කර්‍මය ආනන්තර්ය නොවෙයි. බැරෑරුම් නම් වෙයි. ආනන්තර්යයට ගැටී සිටී. මනුෂ්‍ය ජාතිකයන්ගේ වශයෙන්ම මේ ප්‍රශ්නය කියනලදී."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කම්මතො ද්වාරතො චෙව කප්පට්ඨිතියතො තථා පාක සාධාරණාදීහි විඤ්ඤාතබ්බො විනිච්ඡයො"
                    }
                ]
            }
        },
        {
            "pageNum": 549,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තත්ථ එළකචතුක්කං, සඞ්ගාමචතුක්කං, චොරචතුක්කඤ්ච කථෙතබ්බං. එළකං මාරෙස්සාමීති අභිසන්ධිනාපි හි එළකට්ඨානෙ ඨිතං මනුස්සො මනුස්සභූතං මාතරං වා පිතරං වා මාරෙන්තො ආනන්තරියං ඵුසති. එළකාභිසන්ධිනා මාතාපිතිඅභිසන්ධිනා වා එළකං මාරෙන්තො ආනන්තරියං න ඵුසති, මාතාපිතිඅභිසන්ධිනා මාතාපිතරො මාරෙන්තො ඵුසතෙව. එස නයො ඉතරස්මිම්පි චතුක්කද්වයෙ. යථා ච මාතාපිතූසු, එවං අරහන්තෙපි එතානි චතුක්කානි වෙදිතබ්බානි. මනුස්සඅරහන්තමෙව ච මාරෙත්වා ආනන්තරියං ඵුසති, න යක්ඛභූතං. කම්මං පන භාරියං, ආනන්තරියසදිසමෙව. මනුස්සඅරහන්තස්ස ච පුථුජ්ජනකාලෙයෙව සත්ථප්පහාරෙ වා විසෙ වා දින්නෙපි යදි සො අරහත්තං පත්වා තෙනෙව මරති, අරහන්තඝාතකො හොතියෙව. යං පන පුථුජ්ජනකාලෙ දින්නං දානං අරහත්තං පත්වා පරිභුඤ්ජති, පුථුජ්ජනස්සෙව තං දින්නං හොති. සෙසඅරියපුග්ගලෙ මාරෙන්තස්ස ආනන්තරියං නත්ථි, කම්මං පන භාරියං, ආනන්තරියසදිසමෙව."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ලොහිතුප්පාදෙ** තථාගතස්ස අභෙජ්ජකායතාය පරූපක්කමෙන චම්මච්ඡෙදං කත්වා ලොහිතපග්ඝරණං නාම නත්ථි, සරීරස්ස පන අන්තොයෙව එකස්මිං ඨානෙ ලොහිතං සමොසරති. දෙවදත්තෙන පවිද්ධසිලතො භිජ්ජිත්වා ගතා සකලිකාපි තථාගතස්ස පාදන්තං පහරි, ඵරසුනා පහටො විය පාදො අන්තොලොහිතොයෙව අහොසි. තථා කරොන්තස්ස ආනන්තරියං හොති. ජීවකො පන තථාගතස්ස රුචියා සත්ථකෙන චම්මං ඡින්දිත්වා තම්හා ඨානා දුට්ඨලොහිතං නීහරිත්වා ඵාසුකමකාසි. තථා කරොන්තස්ස පුඤ්ඤකම්මමෙව හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ යෙ පරිනිබ්බුතෙ තථාගතෙ චෙතියං භින්දන්ති, බොධිං ඡින්දන්ති, ධාතුම්හි උපක්කමන්ති, තෙසං කිං හොතීති? භාරියං කම්මං හොති, ආනන්තරියසදිසං. සධාතුකං පන ථූපං වා පටිමං වා බාධයමානං බොධිසාඛං ඡින්දිතුං වට්ටති. සචෙපි තත්ථ නිලීනා සකුණා චෙතියෙ වච්චං පාතෙන්ති, ඡින්දිතුං වට්ටතියෙව. පරිභොගචෙතියතො හි සරීරචෙතියං මහන්තතරං. චෙතියවත්ථුං භින්දිත්වා ගච්ඡන්තං බොධිමූලම්පි ඡින්දිත්වා හරිතුං වට්ටති. යා පන බොධිසාඛා බොධිඝරං බාධති, තං ගෙහරක්ඛණත්ථං ඡින්දිතුං න ලභති. බොධිඅත්ථඤ්හි ගෙහං, න ගෙහත්ථාය බොධි. ආසනඝරෙපි එසෙව නයො. යස්මිං පන ආසනඝරෙ ධාතු නිහිතා හොති, තස්ස රක්ඛණත්ථාය බොධිසාඛං ඡින්දිතුං වට්ටති. බොධිජග්ගනත්ථං ඔජාහරණසාඛං වා පූතිසාඛං වා ඡින්දිතුං වට්ටතියෙව, සරීරපටිජග්ගනෙ විය පුඤ්ඤම්පි හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එහි ඵළක චතුක්කයද සංගාමචතුක්කයද චොර චතුක්කයද දතයුතුය. එළුවෙකු මරමැයි මිනිසෙක් එළුවන් සිටින තැන සිටි මිනිස් මව හෝ පියා එකට ගැලපීමෙන් (එළුවෙකැයි වරදවා සමානකොට සිතීමෙන්) හෝ මරයිද ආනන්තර්යය ස්පර්‍ශ කෙරේමැයි. එළුවෙකැයි ගැලපීමෙන් හෝ මවපියායි ගැලපීමෙන් එළුවෙකු මරන්නේ ආනන්තර්යය ස්පර්‍ශ නොකරයි. මවුපියන් ගැලපීමෙන් මවුපියන් මරන්නේ ස්පර්‍ශ කෙරේමැයි. සෙසු චතුක්ක දෙකෙහිද මේ ක්‍රමයමයි. මවුපියන් කෙරෙහි යම්සේද එසේම රහතුන්වහන්සේ කෙරෙහිද මේ චතුෂකයෝ දතයුත්තාහ. මිනිස් රහත් කෙනෙකුම මරා ආනන්තර්යය ස්පර්‍ශ කරයි. යක්‍ෂයෙකුවූ රහත් කෙනෙකු (මැරීමෙන්) නොවේ. කර්‍මය වනාහි බැරෑරුම්ය. ආනන්තර්යයක් සමාන වේමයි. මිනිස් රහතන්වහන්සේටද පෘථග්ජන කාලයෙහිම අවිපහරක් හෝ විෂයක් දුන් කල්හි ඉදින් හෙතෙම රහත්බවට පත්ව එයින්ම මැරෙයිද අරහන්ත ඝාතකයෙක් වේමයි. පෘථග්ජන කාලයෙහි දුන්නාවූ යම් දානයක් රහත්බවට පැමිණ වළඳයිද එය පෘථග්ජනයාටම දුන් දෙයක් වෙයි. සෙසු ආර්‍ය්‍ය පුද්ගලයන් මරන්නහුට ආනන්තර්යයක් නැත. කර්‍මය නම් ආනන්තර්යයකට සමාන ලෙසින්ම බැරෑරුම්ය."
                    },
                    {
                        "type": "paragraph",
                        "text": "ලොහිතුප්පාද (ආනන්තර්ය) යෙහි තථාගතයන්වහන්සේගේ නොබිඳෙන කය ඇතිබැවින් අනුන්ගේ උපක්‍රමයෙන් සම සිඳීමකොට ලේ වැගිරීමක් නම් නැත. ශරීරයාගේ ඇතුළතම එක් තැනක ලේ එක්තැන් වෙයි. දෙව්දත්විසින් හෙළූ ගලින් බිඳීගිය ගල් කැබලිත්තද තථාගතයන්වහන්සේගේ පා කෙළවර ගැටිණි. පොරවකින් පහර ලද්දාක් මෙන් පාදය ඇතුළත ලෙහෙ ඇත්තේම විය. එසේ කරන්නහුට ආනන්තර්යය වෙයි. ජීවකතෙමේ වනාහි තථාගතයන්වහන්සේගේ කැමැත්තෙන් සැතින් සම සිඳ එතැනින් නරක්වූ ලෙය ඉවත්කොට පහසුව ඇති කළේය. එසේ කරන්නහුට පුණ්‍ය කර්‍මයක්ම වෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "තථාගතයන්වහන්සේ පිරිනිවන් පෑකල්හි යමෙක් චෛත්‍යය බිඳිත්ද බෝධිය සිඳිත්ද ධාතූන් විෂයෙහි (පැහැරගැනීම් සඳහා) උපක්‍රම යොදත්ද ඔවුනට කුමක් වේද? ආනන්තර්යය සමානවූ බැරෑරුම් කර්‍මයක් වෙයි. ධාතු සහිතවූ ස්තූපයකට හෝ ප්‍රතිමාවකට හෝ බාධා කරන්නාවූ බෝඅත්තක් සිඳීම වටී. තවද එහි සැඟවුණු පක්‍ෂීහු චෛත්‍යයෙහි වසුරු හෙළත්ද සිඳීමට වටනේමය. පාරිභොගික චෛත්‍යයට වඩා ශරීර චෛත්‍යය මාහැඟි වෙයි. චෛත්‍යවස්තුවක් බිඳ යන්නාවූ බෝමුලක් වුවද සිඳ ඉවත්කිරීම වටී. යම් බෝ අත්තක් බෝධිඝරය වළහා සිටීද එය ගෙය රැකීම සඳහා සිඳීමට සුදුසු නොවෙයි. ගෙය බෝධිය සඳහාය. ගෙය සඳහා බෝධිය නොවේ. ආසනඝරයෙහිද මේ ක්‍රමයමයි. යම් ආසනඝරයක ධාතු තැන්පත් කරනලද්දේ වේද? එය ආරක්‍ෂා කිරීම සඳහා බෝඅත්ත සිඳීම වටී. බෝධිය පිළිදැඟුම් කිරීම සඳහා ඉස්ම වැගිරෙන අත්තක් හෝ කුණුවීගිය තැනක් හෝ සිඳීමට වටනේමය. සිරුර පිළිදැඟුම් කිරීමෙහි මෙන් පිණද වෙයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 551,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**සඞ්ඝභෙදෙ**පි සීමට්ඨකසඞ්ඝෙ අසන්නිපතිතෙ විසුං පරිසං ගහෙත්වා කතවොහාරානුස්සාවනසලාකග්ගාහස්ස කම්මං වා කරොන්තස්ස උද්දෙසං වා උද්දිසන්තස්ස භෙදො ච හොති ආනන්තරියකම්මඤ්ච. සමග්ගසඤ්ඤාය පන වට්ටතීති සඤ්ඤාය වා කරොන්තස්ස භෙදොව හොති, න ආනන්තරියකම්මං. තථා නවතො ඌනපරිසාය. සබ්බන්තිමෙන පරිච්ඡෙදෙන නවන්නං ජනානං යො සඞ්ඝං භින්දති, තස්ස ආනන්තරියකම්මං හොති. තස්ස අනුවත්තකානං අධම්මවාදීනං මහාසාවජ්ජකම්මං, ධම්මවාදිනො පන අනවජ්ජා. තත්ථ නවන්නමෙව සඞ්ඝභෙදෙ ඉදං සුත්තං – “එකතො, උපාලි, චත්තාරො හොන්ති, එකතො චත්තාරො, නවමො අනුස්සාවෙති, සලාකං ගාහෙති ‘අයං ධම්මො අයං විනයො ඉදං සත්ථු සාසනං, ඉමං ගණ්හථ, ඉමං රොචෙථා’ති. එවං ඛො, උපාලි, සඞ්ඝරාජි චෙව හොති සඞ්ඝභෙදො ච. නවන්නං වා, උපාලි, අතිරෙකනවන්නං වා සඞ්ඝරාජි චෙව හොති සඞ්ඝභෙදො චා”ති (චූළව· 351). එතෙසු ච පන පඤ්චසු සඞ්ඝභෙදො වචීකම්මං, සෙසානි කායකම්මානීති එවං කම්මතො විඤ්ඤාතබ්බො විනිච්ඡයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ද්වාරතො**ති සබ්බානෙව චෙතානි කායද්වාරතොපි වචීද්වාරතොපි සමුට්ඨහන්ති. පුරිමානි පනෙත්ථ චත්තාරි ආණත්තිකවිජ්ජාමයප්පයොගවසෙන වචීද්වාරතො සමුට්ඨහිත්වාපි කායද්වාරමෙව පූරෙන්ති, සඞ්ඝභෙදො හත්ථමුද්ධාය භෙදං කරොන්තස්ස කායද්වාරතො සමුට්ඨහිත්වාපි වචීද්වාරමෙව පූරෙතීති එවමෙත්ථ ද්වාරතොපි විඤ්ඤාතබ්බො විනිච්ඡයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**කප්පට්ඨිතියතො**ති සඞ්ඝභෙදොයෙව චෙත්ථ කප්පට්ඨිතියො. සණ්ඨහන්තෙ හි කප්පෙ වා කප්පවෙමජ්ඣෙ වා සඞ්ඝභෙදං කත්වා කප්පවිනාසෙයෙව මුච්චති. සචෙපි හි ‘ස්වෙ කප්පො විනස්සිස්සතී”ති අජ්ජ සඞ්ඝභෙදං කරොති, ස්වෙව මුච්චති, එකදිවසමෙව නිරයෙ පච්චති. එවං කරණං පන නත්ථි. සෙසානි චත්තාරි කම්මානි ආනන්තරියානෙව හොන්ති, න කප්පට්ඨිතියානීති එවමෙත්ථ කප්පට්ඨිතියතොපි විඤ්ඤාතබ්බො විනිච්ඡයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පාකතො**ති යෙන ච පඤ්චපෙතානි කම්මානි කතානි හොන්ති, තස්ස සඞ්ඝභෙදොයෙව පටිසන්ධිවසෙන විපච්චති, සෙසානි “අහොසිකම්මං නාහොසි කම්මවිපාකො”ති එවමාදීසු සඞ්ඛං ගච්ඡන්ති. සඞ්ඝභෙදාභාවෙ ලොහිතුප්පාදො, තදභාවෙ අරහන්තඝාතො, තදභාවෙ සචෙ පිතා සීලවා හොති, මාතා දුස්සීලා, නො වා තථා සීලවතී, පිතුඝාතො පටිසන්ධිවසෙන විපච්චති. සචෙ මාතා සීලවතී, මාතුඝාතො. ද්වීසුපි සීලෙන වා දුස්සීලෙන වා සමානෙසු මාතුඝාතොව පටිසන්ධිවසෙන විපච්චති. මාතා හි දුක්කරකාරිනී බහූපකාරා ච පුත්තානන්ති. එවමෙත්ථ පාකතොපි විඤ්ඤාතබ්බො විනිච්ඡයො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සංඝභේද කර්‍මයෙහිද සීමාවෙහි සිටින සංඝයා රැස් නොවී සිටියදී වෙන්වූ පිරිසක් වෙත ගොස් කරනලද ව්‍යවහාර අනුසාවන හා සලාක ගැන්වීම් ඇතිව සංඝකර්‍මය කරන්නහුට හෝ පාමොක් උදෙසීම උදෙසවන්නහුට සංඝභේදයද වෙයි. ආනන්තර්ය කර්‍මයද වෙයි. සමඟිවූ හැඟීමෙන් සුදුසුයයි (එම) හැඟීමෙන් කරන්නාට භේදයම වෙයි. ආනන්තර්ය කර්‍මය නොවෙයි. එසේ නවදෙනකුගෙන් අඩු පිරිසෙහි යටත් පිරිසෙයින් නවදෙනා අතුරින් යමෙක් සංඝයා බිඳියිද ඔහුට ආනන්තර්ය කර්මය වෙයි. අනුවර්‍තක (අනුගමනය කරන්නා) වූ අධර්‍මවාදීන්ට මහා සාවද්‍ය කර්‍මයක් වෙයි. ධර්‍මවාදීහු වැරදි නැත්තෝය. එසේ නවදෙනෙකුගේ සංඝභේදයෙහි මේ සූත්‍රයයි: ‘උපාලි එක්පසෙක සිවුදෙනෙකි. තවත් පසෙකින් සිවු දෙනෙකි. නව වැන්නා, මේ ධර්‍මයයි, මේ විනයයි, මේ හාස්තෘශාසනයයි, මෙය ගනුමැනව, මෙය කැමතිවනු මැනවයි අනුශ්‍රාවණය කරවයි. ලහගන්වයි. උපාලි මෙසේ සංඝරාජිය (සඟපෙළ) ද සංඝභේදයද වෙයි. නව දෙනෙකුගේ හෝ නවදෙනෙකුට වැඩි සංඝයාගේ සංඝරාජියද සංඝභේදයද වෙයි! මේ ආනන්තර්ය පසෙහි සංඝභේදය වාග්කර්‍මයි. සෙස්ස කාය කර්‍මයි. මෙසේ කර්‍මවශයෙන් විනිශ්චය දතයුතුයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "දොරටු වශයෙන් යන්නෙන් මේ සියල්ලම කායද්වාරයෙන්ම වාග්ද්වාරයෙන්ද හටගනියි. මෙහි මුල් සතර ආණත්තික විජ්ජාමය හා පයෝග වශයෙන් වාග්ද්වාරයෙන් හට ගෙනද කායද්වාරයම පුරවයි. සංඝභේදය හස්තමුද්‍රවෙන් භේදය කරන්නහුට කායද්වාරයෙන් හට ගෙනද වාග් ද්වාරයම පුරවන්නේයයි මෙසේ මෙහි ද්වාර වශයෙන්ද විනිශ්චය දතයුතුයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කල්පයක් සිටීම් වශයෙන් යනු මෙහි සංඝභේදය කල්පයක් කල් පැවතියේවෙයි. කල්පය නැවත හටගැනීමේදී හෝ කල්පය මැද හෝ සංඝභේදයකොට කල්ප විනාශයෙහිම මිදෙයි. ඉදින් හෙට කල්පය විනාශවන්නේයයි අද සංඝභේදය කරයිද හෙට මිදෙයි. එක් දිනයක්ම නිරයෙහි පැසෙයි. මෙයට හේතුවක් නම් නැත. සෙසු ඒවා නොවේයයි මෙසේ මෙහි කල්පයක් තිබීම් වශයෙන් විනිශ්චය දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "විපාකවශයෙන් යනු යම්කිසිවෙකු විසින් මේ කර්‍මපස කරනලද්දේ වේද ඔහුට සංඝභේදයම ප්‍රතිසන්‍ධිවශයෙන් විපාක දෙයි. සෙස්ස අහෝසි කර්‍මයයි. අහෝසි කර්‍මවිපාකයක් නොමැත. මේ ආදී වශයෙන් ප්‍රසිද්ධවෙයි. සංඝභේදයක් නොමැති විට ලොහිතුප්පාදයද එය නැතිවිට අරහන්ත ඝාතනයද එය නැති කල්හි ඉදින් පියා සිල්වත් වෙයි. මව දුශ්ශීලය; නැතහොත් එසේ සිල්පත් නොවේ නම් පිතෘඝාතය ප්‍රතිසන්‍ධි වශයෙන් විපාක දෙයි. දෙදෙනාම සිල්වත්බවින් හෝ දුසිල්වත්බවින් සමාන වන කල්හි මාතෘඝාතයම ප්‍රතිසන්‍ධි වශයෙන් විපාක දෙයි. මව වනාහි දුකසේ කටයුතු කරන්නියයි. පුතුනට බොහෝ උපකාර ඇත්තීය. මෙසේ මෙහි විපාක වශයෙන්ද විනිශ්චය දතයුතුයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 553,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**සාධාරණාදීහී**ති පුරිමානි චත්තාරි සබ්බෙසම්පි ගහට්ඨපබ්බජිතානං සාධාරණානි. සඞ්ඝභෙදො පන “න ඛො, උපාලි භික්ඛුනී, සඞ්ඝං භින්දති, න සික්ඛමානා, න සාමණෙරො, න සාමණෙරී, න උපාසකො, න උපාසිකා සඞ්ඝං භින්දති. භික්ඛු ඛො, උපාලි, පකතත්තො සමානසංවාසකො සමානසීමායං ඨිතො සඞ්ඝං භින්දතී”ති (චූළව· 351) වචනතො වුත්තප්පකාරස්ස භික්ඛුනොව හොති, න අඤ්ඤස්ස, තස්මා අසාධාරණො. ආදිසද්දෙන සබ්බෙපෙතෙ දුක්ඛවෙදනාය සහගතා දොසමොහසම්පයුත්තා චාති එවමෙත්ථ සාධාරණාදීහිපි විඤ්ඤාතබ්බො විනිච්ඡයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අඤ්ඤං සත්ථාර**න්ති “අයං මෙ සත්ථා සත්ථු කිච්චං කාතුං අසමත්ථො”ති භවන්තරෙපි අඤ්ඤං තිත්ථකරං ‘අයං මෙ සත්ථා”ති එවං ගණ්හෙය්ය, නෙතං ඨානං විජ්ජතීති අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**එකිස්සා ලොකධාතුයා**ති දසසහස්සිලොකධාතුයා. තීණි හි ඛෙත්තානි ජාතිඛෙත්තං, ආණාඛෙත්තං විසයඛෙත්තන්ති. තත්ථ **ජාතිඛෙත්තං** නාම දසසහස්සී ලොකධාතු. සා හි තථාගතස්ස මාතුකුච්ඡිස්මිං ඔක්කමනකාලෙ නික්ඛමනකාලෙ සම්බොධිකාලෙ ධම්මචක්කප්පවත්තනෙ ආයුසඞ්ඛාරවොස්සජ්ජනෙ පරිනිබ්බානෙ ච කම්පති. කොටිසතසහස්සචක්කවාළං පන **ආණාඛෙත්තං** නාම. ආටානාටියපරිත්තමොරපරිත්තධජග්ගපරිත්තරතනපරිත්තාදීනඤ්හි එත්ථ ආණා පවත්තති. **විසයඛෙත්තස්ස** පන පරිමාණං නත්ථි. බුද්ධානඤ්හි “යාවතකං ඤාණං තාවතකං ඤෙය්යං, යාවතකං ඤෙය්යං තාවතකං ඤාණං, ඤාණපරියන්තිකං ඤෙය්යං, ඤෙය්යපරියන්තිකං ඤාණ”න්ති (මහානි· 69; චූළනි· මොඝරාජමාණවපුච්ඡානිද්දෙසො 85; පටි· ම· 3.5) වචනතො අවිසයො නාම නත්ථි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙසු පන තීසු ඛෙත්තෙසු ඨපෙත්වා ඉමං චක්කවාළං අඤ්ඤස්මිං චක්කවාළෙ බුද්ධා උප්පජ්ජන්තීති සුත්තං නත්ථි, න උප්පජ්ජන්තීති පන අත්ථි. **තීණි** හි **පිටකානි** – විනයපිටකං, සුත්තන්තපිටකං, අභිධම්මපිටකං. **තිස්සො සඞ්ගීතියො** – මහාකස්සපත්ථෙරස්ස සඞ්ගීති, යසත්ථෙරස්ස සඞ්ගීති, මොග්ගලිපුත්තත්ථෙරස්ස සඞ්ගීති. ඉමා තිස්සො සඞ්ගීතියො ආරුළ්හෙ තෙපිටකෙ බුද්ධවචනෙ ඉමං චක්කවාළං මුඤ්චිත්වා අඤ්ඤත්ථ බුද්ධා උප්පජ්ජන්තීති සුත්තං නත්ථි, න උප්පජ්ජන්තීති පන අත්ථි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අපුබ්බං අචරිම**න්ති අපුරෙ අපච්ඡා, එකතො න උප්පජ්ජන්ති. පුරෙ වා පච්ඡා වා උප්පජ්ජන්තීති වුත්තං හොති. තත්ථ බොධිපල්ලඞ්කෙ “බොධිං අප්පත්වා න උට්ඨහිස්සාමී”ති නිසින්නකාලතො පට්ඨාය යාව මාතුකුච්ඡිස්මිං පටිසන්ධිග්ගහණං, තාව පුබ්බෙති න වෙදිතබ්බං. බොධිසත්තස්ස හි පටිසන්ධික්ඛණෙ දසසහස්සචක්කවාළකම්පනෙනෙව ඛෙත්තපරිග්ගහො කතො, එත්ථන්තරෙ අඤ්ඤස්ස බුද්ධස්ස උප්පත්ති නිවාරිතාව හොති. පරිනිබ්බානතො පට්ඨාය යාව සාසපමත්තාපි ධාතු තිට්ඨති, තාව පච්ඡාති න වෙදිතබ්බං. ධාතූසු හි ඨිතාසු බුද්ධා ඨිතාව හොන්ති. තස්මා එත්ථන්තරෙ අඤ්ඤස්ස බුද්ධස්ස උප්පත්ති නිවාරිතාව හොති. ධාතුපරිනිබ්බානෙ පන ජාතෙ අඤ්ඤස්ස බුද්ධස්ස උප්පත්ති න නිවාරිතා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සාධාරණාදීන්ගෙන් වනාහි මුල් සතර ගිහි පැවිද්දන්ට සාධාරණය. සංඝභේදය වනාහි ‘උපාලි, භික්‍ෂුණිය සංඝයා නොබිඳියි. ශික්‍ෂමානාවක නොබිඳියි. සාමණේරයෙක් සාමණේරිණියක් සංඝයා නොබිඳියි. උවසුවෙක් උවැසියක් සංඝයා නොබිඳියි. ප්‍රකෘතිතත්වයෙහිවූ සමානසංවාසක එක්සීමාවෙක්හි සිටි භික්‍ෂුවම සංඝයා බිදී’ යන වචන වශයෙන් කියන ලද ආකාර ඇති භික්‍ෂුවටම වෙයි. අනෙකෙකුට නොවේ. එහෙයින් අසාධාරණය. ආදී ශබ්දයෙන් මේ සියල්ලම දුක්‍ඛ වේදනාවෙන් යුක්ත වූයේ ද්වේෂමොහයන්ගෙන් සමප්‍රයුක්ත වූයේයයිද මෙසේ මෙහි සාධාරණාදීන්ගෙන්ද විනිශ්චය දතයුතුයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**‘අඤ්ඤං සත්‍ථාරං’** යනු මේ මාගේ ශාස්තෘවරයා ශාස්තෘ කෘත්‍යය කිරීමට අසමත්යයි භවාන්තරයෙහිද අන්‍ය තීර්ථංකරයෙකු ‘මේ මාගේ ශාස්තෘවරයායි’ මෙසේ ගනීද එම කාරණය විද්‍යාමාන නොවේ යන අත්‍ථියි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**එකිස්සා ලොකධාතුයා** යනු දස සහස්සී ලොකධාතුවෙහිය. ජාතික්‍ෂෙත්‍රය, ආඥා ක්‍ෂෙත්‍රය, විෂය ක්‍ෂෙත්‍රයයි ක්‍ෂෙත්‍ර තුනකි. එහි ජාතික්‍ෂෙත්‍රය නම් යමක් තථාගතයන්වහන්සේගේ මව්කුස පිළිසිඳගන්නාකල්හි උපදිනකල්හි බුදුවනකල්හි, දම්සක් පවත්වනකල්හි ආයුසංස්කාරය හරිනකල්හි පිරිනිවන් පානාකල්හි කම්පා වෙයිද ඒ දහ සහස්‍රී ලෝකධාතුවයි. කෝටි ලක්‍ෂයක්වූ චකුවාලය ආඥා ක්‍ෂෙත්‍රයයි. ආටානාටිය මෝරපරිත්ත, ධජග්ගපරිත්ත, රතනපරිත්ත ආදී පිරිත්වල ආඥාව මෙහි පවතියි, බුදුවරුන්ගේ වනාහි විෂයක්‍ෂෙත්‍රයාගේ පරිමාණයක් නැත. ඥානය යම්‍තාක්ද ඥෙය (දතයුතුදෙය) ද එපමණෙකි. ඥෙය යම්තාක්ද ඥානය එපමණකි. ඥෙය ඥානය සීමා කොට ඇත. ඥානය ඥෙය්‍යය සීමා කොට ඇතයි යන වචනයෙන් අවිෂයවන්නාවූ දෙයක් නම් නැත."
                    },
                    {
                        "type": "paragraph",
                        "text": "මේ ක්‍ෂෙත්‍රයන් තුනෙහි මෙම සක්වළ හැර අන් සක්වලෙක බුදුවරු උපදිත්යයි සූත්‍රයක් නැත. නොඋපදිතැයි (සූත්‍රයක්) ඇත. විනය පිටකය සූත්‍රාන්තපිටකය, අභිධර්‍මපිටකයයි පිටක තුනකි. මහාකාශ්‍යපස්ථවරයන්ගේ සංගීතියයයි සංගීති තුනකි. මේ සංගීති තුනට නැඟුණු ත්‍රිපිටක බුද්ධවචනයෙහි මේ සක්වළ හැර අන තැනක බුදුවරු උපදිතැයි සූත්‍රයක් නැත. නොපදිතැයි ඇත."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අපුබ්බං අචරිමං** යනු පෙර පසු නොවීයි. එකට නොඋපදිති. පෙර හෝ පසුව උපදිතැයි කියන ලද්දේ වෙයි. එහි බෝධි පර්‍ය්‍යංකයෙහි බෝධියට නොපැමිණ නොනැගිටිමියි හුන්කල්හි පටන් යම්තාක් මවුකුසෙහි පිළිසඳ ගැනීම වෙයිද එතෙක් පෙරකාලයයි නොදත යුතුයි. බෝසතුන්ගේ පිළිසිඳ ගැනීමෙහිදී දස දහසක් සක්වළ කම්පාවීමෙන්ම ක්‍ෂෙත්‍ර පිළිගැනීම කරනලදී. මෙදැතුරෙහි අන්බුදු කෙනකුගේ උපත නවත්වනලද්දේ වෙයි. පිරිනිවනෙහි පටන් යම්තාක් අබැටක් පමණවූද ධාතුවක් සිටීද ඒතාක් පසුකාලයයි නොදත යුතුය. ධාතූන් සිටි කල්හි බුදුවරු සිටියාහු වෙත්, එබැවින් මේ අතරෙහි අන්බුදුකෙනෙකුගේ උපත නොවළහනලද්දේ වෙයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 555,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කස්මා පන අපුබ්බං අචරිමං න උප්පජ්ජන්තීති? අනච්ඡරියත්තා. බුද්ධා හි අච්ඡරියමනුස්සා. යථාහ – “එකපුග්ගලො, භික්ඛවෙ, ලොකෙ උප්පජ්ජමානො උප්පජ්ජති අච්ඡරියමනුස්සො. කතමො එකපුග්ගලො? තථාගතො අරහං සම්මාසම්බුද්ධො”ති (අ· නි· 1.172). යදි ච ද්වෙ වා චත්තාරො වා අට්ඨ වා සොළස වා එකතො උප්පජ්ජෙය්යුං, අනච්ඡරියා භවෙය්යුං. එකස්මිඤ්හි විහාරෙ ද්වින්නං චෙතියානම්පි ලාභසක්කාරො උළාරා න හොන්ති, භික්ඛූපි බහුතාය අනච්ඡරියා ජාතා, එවං බුද්ධාපි භවෙය්යුං. තස්මා න උප්පජ්ජන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "දෙසනාය ච විසෙසාභාවතො. යඤ්හි සතිපට්ඨානාදිකං ධම්මං එකො දෙසෙති, අඤ්ඤෙන උප්පජ්ජිත්වාපි සොව ධම්මො දෙසෙතබ්බො සියා. තතො අනච්ඡරියො සියා. එකස්මිං පන ධම්මං දෙසෙන්තෙ දෙසනාපි අච්ඡරියාව හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "විවාදභාවතො ච. බහූසු ච බුද්ධෙසු උප්පන්නෙසු බහූනං ආචරියානං අන්තෙවාසිකා විය “අම්හාකං බුද්ධො පාසාදිකො, අම්හාකං බුද්ධො මධුරස්සරො ලාභී පුඤ්ඤවා”ති විවදෙය්යුං, තස්මාපි එවං න උප්පජ්ජන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අපිචෙතං කාරණං මිලින්දරඤ්ඤා පුට්ඨෙන නාගසෙනත්ථෙරෙන විත්ථාරිතමෙව. වුත්තඤ්හි තත්ථ (මි· ප· 5.1.1) –"
                    },
                    {
                        "type": "paragraph",
                        "text": "“භන්තෙ, නාගසෙන, භාසිතම්පි හෙතං භගවතා – ‘අට්ඨානමෙතං, භික්ඛවෙ, අනවකාසො, යං එකිස්සා ලොකධාතුයා ද්වෙ අරහන්තො සම්මාසම්බුද්ධා අපුබ්බං අචරිමං උප්පජ්ජෙය්යුං, නෙතං ඨානං විජ්ජතී’ති. දෙසෙන්තා ච, භන්තෙ නාගසෙන, සබ්බෙපි තථාගතා සත්තතිංස බොධිපක්ඛියධම්මෙ දෙසෙන්ති, කථයමානා ච චත්තාරි අරියසච්චානි කථෙන්ති, සික්ඛාපෙන්තා ච තීසු සික්ඛාසු සික්ඛාපෙන්ති, අනුසාසමානා ච අප්පමාදපටිපත්තියං අනුසාසන්ති. යදි, භන්තෙ නාගසෙන, සබ්බෙසම්පි තථාගතානං එකො උද්දෙසො එකා කථා එකා සික්ඛා එකා අනුසිට්ඨි, කෙන කාරණෙන ද්වෙ තථාගතා එකක්ඛණෙ න උප්පජ්ජන්ති. එකෙනපි තාව බුද්ධුප්පාදෙන අයං ලොකො ඔභාසජාතො, යදි දුතියොපි බුද්ධො භවෙය්ය, ද්වින්නං පභාය අයං ලොකො භිය්යොසොමත්තාය ඔභාසජාතො භවෙය්ය. ඔවදමානා ච ද්වෙ තථාගතා සුඛං ඔවදෙය්යුං, අනුසාසමානා ච සුඛං අනුසාසෙය්යුං. තත්ථ මෙ කාරණං දෙසෙහි, යථාහං නිස්සංසයො භවෙය්යන්ති”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අයං, මහාරාජ, දසසහස්සී ලොකධාතු එකබුද්ධධාරණී, එකස්සෙව තථාගතස්ස ගුණං ධාරෙති. යදි දුතියො බුද්ධො උප්පජ්ජෙය්ය, නායං දසසහස්සී ලොකධාතු ධාරෙය්ය, චලෙය්ය කම්පෙය්ය නමෙය්ය ඔනමෙය්ය විනමෙය්ය විකිරෙය්ය විධමෙය්ය විද්ධංසෙය්ය, න ඨානමුපගච්ඡෙය්ය."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කුමක් නිසා පෙරපසු නොවී නොඋපදිත්ද යත් ආශ්චර්‍ය්‍යවත් නොවන බැවිනි. බුදුවරු වනාහි ආශ්චර්‍ය්‍ය මනුෂ්‍යයෝයි. යම්සේ කියන ලද්දේද: මහණෙනි, ආශ්තර්‍ය්‍ය මනුෂ්‍යවූ එක් පුද්ගලයෙක් මෙලොව උපදින්නේ උපදියි. කවර එක් පුද්ගලයෙක්ද යත් තථාගතවූ අරහත් සම්මාසම්බුදුන්වහන්සේයි.’ ඉදින් දෙදෙනෙක් සිවුදෙනෙක් අටදෙනෙක් හෝ සොළොස් දෙනෙක් එකට උපදින්නාහු නම් ආහ්චර්‍ය්‍යවත් නොවූවෝ වෙත්. එක් වෙහෙරෙක චෛත්‍යය දෙකකට ලාභසත්කාරය මහත් නොවෙයි. භික්‍ෂුහුද බොහෝ බැවින් ආශ්චර්‍ය්‍යවත් නොවූහ. බුදුවරුද එසේ වන්නාහුය. එබැවින් නොඋපදිත්."
                    },
                    {
                        "type": "paragraph",
                        "text": "දේශනාවගේද විශේෂයක් නොමැති බැවිනි. යමෙක් සතිපට්ඨානාදී ප්‍රභේද ඇති යම් ධර්‍මයක් එක්කෙනෙක් දෙසයිද අනෙකෙකුවිසින් ඉපදීද එයම දෙසියයුතු වන්නේය. එයින් ආශ්චර්‍ය්‍යයක් නැත්තේ වෙයි. එකම ධර්‍මයක් දේශනා කරන කල්හි දේශනාවද ආශචර්‍ය්‍යවත් වෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "විවාදවත් බවින්ද (අනාශ්චර්‍ය්‍ය වෙයි) බොහෝ බුදුවරුන් උපන් කල්හි බොහෝ ආචාර්‍ය්‍යවරුන්ගේ අතවැස්සන් මෙන් අපගේ බුදුහු ප්‍රසාදවත්හ. අපගේ බුදුහු මිහිරි හඬ ඇත්තාහුය. ලැබීම් ඇත්තෙකි. පින්වත්ය යනුවෙන් විවාද කරන්නාහුය. එනිසාද එසේ නොඋපදින්නාහුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "තවද මේ කාරණය මිළිඳු රජුවිසින් විමසන ලදුව නාගසේන තෙරුන් විසින් විස්තර කරන ලද්දේමය. කියනලද්දේමයි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "‘ස්වාමීනි, නාගසේනයිනි, එහි භාග්‍යවතුන්වහන්සේ විසින් ‘මහණෙනි, එකම ලෝකධාතුවෙක්හි අර්හත් සම්මා සම්බුදුවරු දෙදෙනෙක් පෙරපසු නොවී උපදින්නාහුය. යන යමක් වේද එය අවකාශරහතිය; කරුණු රහිතය, එයට හේතුවක් නොපෙනේ’යි කියනලදී. ස්වාමීනි, නාගසේනයිනි, සියලුම තථාගතවරු දහම් දෙසමින් තිසක්වූ බෝධිපාක්‍ෂික ධර්‍මයන් දෙසත්, කියන්නාහු සතර ආර්‍ය්‍ය සත්‍යයන් කියත්. හික්මවන්නාහු ත්‍රිවිධ ශික්‍ෂාවන්හි හික්මවත්, අනුශාසනා කරන්නාහු අප්‍රමාද ප්‍රතිපත්තිය දෙසත්. ඉදිත් ස්වාමීනි, නාගසේනයිනි, සියලුම බුදුවරුන්ට එක් උදෙසීමක්, එක් කථාවක්, එක් අනුශාසනාවක් ඇත්නම් කුමන කරුණකින් තථාගතවරු දෙදෙනෙක් එකවිට නූපදිත්ද? එක් බුද්ධෝත්පාදයකින්ම මේ ලෝකය ආලෝකමත් වූයේ නම් ඉදින් දෙවෙනි බුදුවරයෙක්ද උපන්නේ නම් දෙදෙනාගේම පැහැයෙන් මේ ලෝකය බොහෝසෙයින් අලෝකමත් වන්නේය. අවවාද කරමින් කථාගතවරු දෙදෙන සුවසේ අවවාද රකත්. අනුශාසනා කරමින් සුවසේ අනුශාසනා කරත්. යම් සේ යම්සේ මම නිසැක වන්නෙම්ද කෙරුණෙහිලා මට කරුණු දක්වනු මැනැවැයි’ (කීවේය)."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘මහරජ මෙම දශසහශ්‍රී ලෝකධාතුව එක් බුදු කෙනකුම දරන්නේය. එක් බුදුකෙනෙකුගේම ගුණය දරන්නේය. ඉඳින් දෙවැනි බුදුවරයෙක් උපදිත් නම් මේ දශසහශ්‍රී ලෝකධාතුව නො දරන්නේය. සැලෙන්නේය; කම්පා වන්නේය; නැමෙන්නේය, පාත්වන්නේය, හැකිලෙන්නේය, විසිරෙන්නේය, විනාශවන්නේය, කැඩෙන්නේය, විනාශයට යන්නේය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 557,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“යථා, මහාරාජ, නාවා එකපුරිසසන්ධාරණී භවෙය්ය. එකස්මිං පුරිසෙ අභිරූළ්හෙ සා නාවා සමුපාදිකා භවෙය්ය. අථ දුතියො පුරිසො ආගච්ඡෙය්ය තාදිසො ආයුනා වණ්ණෙන වයෙන පමාණෙන කිසථූලෙන සබ්බඞ්ගපච්චඞ්ගෙන, සො තං නාවං අභිරුහෙය්ය. අපි නු සා, මහාරාජ, නාවා ද්වින්නම්පි ධාරෙය්යාති? න හි, භන්තෙ, චලෙය්ය කම්පෙය්ය නමෙය්ය ඔනමෙය්ය විනමෙය්ය විකිරෙය්ය විධමෙය්ය විද්ධංසෙය්ය, න ඨානමුපගච්ඡෙය්ය, ඔසීදෙය්ය උදකෙති. එවමෙව ඛො, මහාරාජ, අයං දසසහස්සී ලොකධාතු එකබුද්ධධාරණී, එකස්සෙව තථාගතස්ස ගුණං ධාරෙති, යදි දුතියො බුද්ධො උප්පජ්ජෙය්ය, නායං දසසහස්සී ලොකධාතු ධාරෙය්ය, චලෙය්ය…පෙ… න ඨානමුපගච්ඡෙය්ය."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යථා වා පන, මහාරාජ, පුරිසො යාවදත්ථං භොජනං භුඤ්ජෙය්ය ඡාදෙන්තං යාව කණ්ඨමභිපූරයිත්වා. සො ධාතො පීණිතො පරිපුණ්ණො නිරන්තරො තන්දිකතො අනොනමිතදණ්ඩජාතො පුනදෙව තත්තකං භොජනං භුඤ්ජෙය්ය. අපි නු ඛො සො, මහාරාජ, පුරිසො සුඛිතො භවෙය්යාති? න හි, භන්තෙ, සකිංභුත්තොව මරෙය්යාති. එවමෙව ඛො, මහාරාජ, අයං දසසහස්සී ලොකධාතු එකබුද්ධධාරණී…පෙ… න ඨානමුපගච්ඡෙය්යාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“කිං නු ඛො, භන්තෙ නාගසෙන, අතිධම්මභාරෙන පථවි චලතීති? ඉධ, මහාරාජ, ද්වෙ සකටා රතනපරිපූරිතා භවෙය්යුං යාව මුඛසමා. එකස්මා සකටතො රතනං ගහෙත්වා එකස්මිං සකටෙ ආකිරෙය්යුං, අපි නු තං, මහාරාජ, සකටං ද්වින්නම්පි සකටානං රතනං ධාරෙය්යාති? න හි, භන්තෙ, නාභිපි තස්ස ඵලෙය්ය, අරාපි තස්ස භිජ්ජෙය්යුං, නෙමීපි තස්ස ඔපතෙය්යුං, අක්ඛොපි තස්ස භිජ්ජෙය්යාති. කිං නු ඛො, මහාරාජ, අතිරතනභාරෙන සකටං භිජ්ජතීති ? ආම, භන්තෙති. එවමෙව ඛො, මහාරාජ, අතිධම්මභාරෙන පථවී චලතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අපි ච, මහාරාජ, ඉමං කාරණං බුද්ධබලපරිදීපනාය ඔසාරිතං. අඤ්ඤම්පි තත්ථ අභිරූපං කාරණං සුණොහි, යෙන කාරණෙන ද්වෙ සම්මාසම්බුද්ධා එකක්ඛණෙ න උප්පජ්ජන්ති. යදි, මහාරාජ, ද්වෙ සම්මාසම්බුද්ධා එකක්ඛණෙ උප්පජ්ජෙය්යුං, පරිසාය විවාදො උප්පජ්ජෙය්ය, ‘තුම්හාකං බුද්ධො, අම්හාකං බුද්ධො’ති උභතොපක්ඛජාතා භවෙය්යුං. යථා, මහාරාජ, ද්වින්නං බලවාමච්චානං පරිසාය විවාදො උප්පජ්ජති, ‘තුම්හාකං අමච්චො අම්හාකං අමච්චො’ති උභතොපක්ඛජාතා හොන්ති. එවමෙව ඛො, මහාරාජ, යදි ද්වෙ සම්මාසම්බුද්ධා එකක්ඛණෙ උප්පජ්ජෙය්යුං, පරිසාය විවාදො උප්පජ්ජෙය්ය, ‘තුම්හාකං බුද්ධො, අම්හාකං බුද්ධො’ති උභතොපක්ඛජාතා භවෙය්යුං. ඉදං පඨමං කාරණං සුණොහි, යෙන කාරණෙන ද්වෙ සම්මාසම්බුද්ධා එකක්ඛණෙ න උප්පජ්ජන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යම්සේ මහරජ, නැවක් එක්පුරුෂයකු දරන්නේ වේද? එක් පුරුෂයකු නැඟුණු කල්හි මනාව (පරතරට) එළඹෙන්නේ වේද? ඉක්බිති දෙවැනි පුරුෂයෙක් එබඳුවූ ආයුෂයෙන් වර්‍ණයෙන් වයසින් ප්‍රමාණයෙන් කෙට්ටු මහත බවින්, සියලු අංග ප්‍රත්‍යංගයන්ගෙන් සමානවූයේ පැමිණෙයිද? හෙතෙම ඒ නැවට නැඟෙන්නේ නම් මහරජ, ඒ නැව දෙදෙනාම දරන්නේද? ‘නැත ස්වාමීනි, සැලෙන්නේය; කම්පාවන්නේය, නැමෙන්නේය, පහත්වන්නේය, හැකිලෙන්නේය, විසිරෙන්නේය, විනාශවන්නේය, කැඩෙන්නේය, විනාශයට යන්නේය, දියෙහි ගිලෙන්නේය,’ ‘මහරජ, එසේම, මේ දශසහශ්‍රී ලෝකධාතුව නොදරන්නේය. සෙලවෙන්නේය. -පෙ- විනාශයට එළඹෙන්නේය."
                    },
                    {
                        "type": "paragraph",
                        "text": "මහරජ, යම්සේ වනාහි පුරුෂයෙක් උගුර වැසෙන තෙක් මනාව පුරවා’ ඇතිපමණ බොජුන් අනුභව කරන්නේද හෙතෙම තෘප්තවූයේ ‘පිණාගියේ, සම්පූරණවූයේ, අතරක් නැතිවූයේ’ නොනැමෙන දණ්ඩක් මෙන්වූයේ, නැවතත් එපමණකම බොජුනක් වළඳ හෙතෙම මහරජ, සුවපත් වන්නේද? ‘නැත ස්වාමීනි, වරක් වැළඳුයේම මැරෙන්නේය.’ ‘එසේම මහරජ, මේ දශසහශ්‍රී ලෝකධාතුව එක් බුදුවරයකු දරන්නේය. -පෙ- විනාශයට යන්නේය."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘කිමෙක්ද ස්වාමීනි, නාගසේනයිනි, බොහෝ ධර්‍මබරින් පොළොව සැලෙන්නේද?’ ‘මහරජ, මෙහි ගැලදෙකක් මුවවිට රුවනින් පුරවන ලද්දේමවෙයි. එක් ගැලකින් රුවන්ගෙන එක් ගැලකම හෙලන්නේ නම් මහරජ, ඒගැල ගැල් දෙකේම රුවන් දරන්නේද?’ ‘නැත ස්වාමීනි, එහි ගැලද පැළෙන්නේය, එහි අරද (ගරාදි) බිඳෙන්නේය. ‘කිමෙක්ද මහරජ, බොහෝ රුවන් බරින් ගැල බිඳෙන්නේද?’ ‘එසේය ස්වාමීනි,’ ‘මහරජ එපරිද්දෙන්ම අතිධර්‍මභාරයෙන් පොළොව සැලෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "තවද මහරජ, මේ කාරණය බුද්ධබලය දැක්වීම සඳහා විස්තර කරන ලදී. යම් කරුණකින් බුදුවරු දෙදෙනෙක් එක්විට නූපදීත්ද? එහිලා අන්‍යවූද මනා කරුනක් ඇත. එයද අසව ඉදින් මහරජ, සම්මා සම්බුදුවරු දෙදෙනෙක් එක්විට උපදින්නාහු නම් පිරිසෙහි විවාද උපදින්නේය. නුඹලාගේ බුදුන්ය අපේ බුදුන්යයි දෙපසට පක්‍ෂවූවාහු වන්නාහුය. යම් සේ මහරජ, බලවත් ඇමතිවරුන් දෙදෙනෙකුගේ පිරිසෙහි විවාද උපදීද නුඹලාගේ ඇමතිය අපේ ඇමතියයි දෙපසට පක්‍ෂ වූවාහු වෙත්ද එසේම මහරජ, සම්මා සම්බුදුවරු දෙදෙනෙක් එකවිට උපදින්නාහු නම් පිරිසෙහි විවාදයක් උපදියි, නුඹලාගේ බුදුන්ය අපේ බුදුන්යයි දෙපසට පක්‍ෂවූවාහු වන්නාහුය. යම් කරුණකින් සම්මා සම්බුදුවරු දෙදෙනෙක් එක්වර නූපදිත්ද අසව, මේ පළමුවැනි කරුණයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 559,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“අපරම්පි, මහාරාජ, උත්තරිං කාරණං සුණොහි, යෙන කාරණෙන ද්වෙ සම්මාසම්බුද්ධා එකක්ඛණෙ න උප්පජ්ජන්ති. යදි, මහාරාජ, ද්වෙ සම්මාසම්බුද්ධා එකක්ඛණෙ උප්පජ්ජෙය්යුං, අග්ගො බුද්ධොති යං වචනං, තං මිච්ඡා භවෙය්ය. ජෙට්ඨො බුද්ධොති…පෙ… සෙට්ඨො බුද්ධොති. විසිට්ඨො බුද්ධොති, උත්තමො බුද්ධොති, පවරො බුද්ධොති, අසමො බුද්ධොති, අසමසමො බුද්ධොති, අප්පටිසමො බුද්ධොති, අප්පටිභාගො බුද්ධොති, අප්පටිපුග්ගලො බුද්ධොති යං වචනං, තං මිච්ඡා භවෙය්ය. ඉමම්පි ඛො ත්වං, මහාරාජ, කාරණං අත්ථතො සම්පටිච්ඡ, යෙන කාරණෙන ද්වෙ සම්මාසම්බුද්ධා එකක්ඛණෙ න උප්පජ්ජන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අපිච, මහාරාජ, බුද්ධානං භගවන්තානං සභාවපකතිකා එසා, යං එකොයෙව බුද්ධො ලොකෙ උප්පජ්ජති. කස්මා? කාරණමහන්තත්තා සබ්බඤ්ඤුබුද්ධගුණානං. අඤ්ඤම්පි, මහාරාජ, යං මහන්තං හොති, තං එකංයෙව හොති. පථවී, මහාරාජ, මහන්තී, සා එකායෙව. සාගරො මහන්තො, සො එකොයෙව. සිනෙරු ගිරිරාජ මහන්තො, සො එකොයෙව. ආකාසො මහන්තො, සො එකොයෙව. සක්කො මහන්තො, සො එකොයෙව. බ්රහ්මා මහන්තො, සො එකොයෙව. තථාගතො අරහං සම්මාසම්බුද්ධො මහන්තො, සො එකොයෙව. යත්ථ තෙ උප්පජ්ජන්ති, තත්ථ අඤ්ඤෙසං ඔකාසො න හොති. තස්මා තථාගතො අරහං සම්මාසම්බුද්ධො එකොයෙව ලොකෙ උප්පජ්ජතීති. සුකථිතො, භන්තෙ නාගසෙන, පඤ්හො ඔපම්මෙහි කාරණෙහී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**එකිස්සා ලොකධාතුයා**ති එකස්මිං චක්කවාළෙ. හෙට්ඨා ඉමිනාව පදෙන දස චක්කවාළසහස්සානි ගහිතානි, තානිපි එකචක්කවාළෙනෙව පරිච්ඡින්දිතුං වට්ටන්ති. බුද්ධා හි උප්පජ්ජමානා ඉමස්මිංයෙව චක්කවාළෙ උප්පජ්ජන්ති, උප්පජ්ජනට්ඨානෙ පන වාරිතෙ ඉතො අඤ්ඤෙසු චක්කවාළෙසු න උප්පජ්ජන්තීති වාරිතමෙව හොති."
                    },
                    {
                        "type": "centered",
                        "text": "පඨමවග්ගවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "අට්ඨානපාළි-දුතියවග්ගවණ්ණනා",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "**අපුබ්බං අචරිම**න්ති එත්ථ චක්කරතනපාතුභාවතො පුබ්බෙ පුබ්බං, තස්සෙව අන්තරධානතො පච්ඡා චරිමං. තත්ථ ද්විධා චක්කරතනස්ස අන්තරධානං හොති චක්කවත්තිනො කාලකිරියාය වා පබ්බජ්ජාය වා. අන්තරධායමානඤ්ච පන තං කාලකිරියතො වා පබ්බජ්ජතො වා සත්තමෙ දිවසෙ අන්තරධායති, තතො පරං චක්කවත්තිනො පාතුභාවො අවාරිතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "කස්මා පන එකචක්කවාළෙ ද්වෙ චක්කවත්තිනො න උප්පජ්ජන්තීති? විවාදුපච්ඡෙදතො, අච්ඡරියභාවතො, චක්කරතනස්ස මහානුභාවතො ච. ද්වීසු හි උප්පජ්ජන්තෙසු “අම්හාකං රාජා මහන්තො, අම්හාකං රාජා මහන්තො”ති විවාදො උප්පජ්ජෙය්ය, “එකස්මිං දීපෙ චක්කවත්තී, එකස්මිං දීපෙ චක්කවත්තී”ති ච අනච්ඡරියො භවෙය්ය. යො චායං චක්කරතනස්ස ද්විසහස්සදීපපරිවාරෙසු චතූසු මහාදීපෙසු ඉස්සරියානුප්පදානසමත්ථො මහානුභාවො, සොපි පරිහායෙථ. ඉති විවාදුපච්ඡෙදතො අච්ඡරියභාවතො චක්කරතනස්ස මහානුභාවතො ච න එකචක්කවාළෙ ද්වෙ උප්පජ්ජන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යම් කරුණකින් සම්මා සම්බුදුවරු දෙදෙනෙක් එක්වර නුපදිත්ද අසව, මත්තෙහි වෙනත් කරුණක්ද වෙයි. ඉදින් මහරජ සම්මා සම්බුදුවරු දෙදෙනෙක් එක්වර උපදින්නාහු නම් බුදුහු අග්‍රයහ යන නම් වචනයක් වේද එය මුසාවක් වන්නේය. බුදුහු ජ්‍යෙෂ්ටය යන යම් වචනයක් වේද එය මුසාවක් වන්නේය. බුදුහු ශ්‍රෙස්ටයහ, බුදුහු විශිෂ්ටයහ, බුදුහු උතුම්යහ, බුදුහු අතිඋතුම්යහ, බුදුහු අසමයහ, බුදුහු අසමසමයහ, බුදුහු අප්පටිසමයහ, බුදුහු අප්‍රතිභාගයහ, බුදුහු අප්‍රතිපුද්ගලයහ යන යම් වචනයක් වේද එය මුසාවක් වන්නේය. යම් කරුණකින් සම්මා සම්බුදුවරු දෙදෙනෙක් එක්වර නූපදිත්ද මහරජ, එබ මේ කරුණත් අර්‍ත්‍ථවශයෙන් පිළිගන්න."
                    },
                    {
                        "type": "paragraph",
                        "text": "තවද මහරජ, තනිවම ලෝකයෙහි උපදියි යන මෙය බුදුවරුන්ගේ ස්වභාව ප්‍රකෘතියයි. කුමක් හෙයින්ද යත්? සර්‍වඥබුද්ධගුණයන්ගේ හේතු මහත්වය හෙයිනි. මහරජ වෙනත් යමක් මහත් වේද එය එකක්ම වෙයි. සයුර මහත්ය, එය එකක්මය, මහාමේරු පර්‍වත රජයා මහත්ය, එය එකක්මය, අහස මහත්ය, එය එකක්මය, මහාමේරු පවර්‍ත රජයා මහත්ය, එය එකක්මය, අහස මහත්ය, එය එකක්මය, ශක්‍රයා මහත්ය, හෙතෙමෙ එකෙක්මය, බ්‍රහ්මයා මහත්ය, හෙතෙම එකෙක්මයි, අරහත් සම්මා සම්බුද්ධ වූ තථාගතයන්වහන්සේ මහත්ය, හෙතෙම එක්කෙනෙක්මය. යම් තැනක ඔවුහු උපදිත්ද, එහි අනෙක් අයට අවකාශයක් නැත. එබැවින් අරහත් සම්මා සම්බුදු තථාගතයන් වහන්සේ තනිවම ලොව උපදිත්.’ ‘ස්වාමීනි, නාගසේනයිනි, උපමා කාරණයන්ගෙන් ප්‍රශ්නය මනාව විසඳන ලදී.’"
                    },
                    {
                        "type": "paragraph",
                        "text": "**එකිස්සා ලොකධාතුයා** යනු එක් සක්වළෙක්හියි යට මේ පදයෙන්ම දසදහසක් සක්වළ ගන්නා ලදී. ඒවාද එක් සක්වළකින්ම සීමා කරන්නට වටීයි. බුදුවරු වනාහි උපදින්නාහු මේ සක්වළෙහිම උපදිත්. උපදින තැන වළහන ලද කල්හි මෙයින් අන්‍යවූ සක්වළවල්හි නූපදිතැයි වළහන ලද්දේම වෙයි."
                    },
                    {
                        "type": "centered",
                        "text": "",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "**අපුබ්බං අචරිමං** යන මෙහි සක්රුවන පහළවීමට කලින් පෙරය. එයම අතුරුදහන් වීමට පසු පසුය. එහි සක්රුවනේ අතුරුදහන් වීම දෙපරිදිය. සක්විති රජුගේ මරණයෙන් හෝ පැවිද්දෙන් වශයෙනිය. අතුරුදහන් වන එය කළුරිය කිරීමෙන් හෝ පැවිදි වීමෙන් සත්වැනි දිනයෙහි අතුරුදහන් වෙයි. එයින් මත්තෙහි සක්විති රජුගේ පහළවීම නොවළහන ලද්දේය."
                    },
                    {
                        "type": "paragraph",
                        "text": "කුමක් හෙයින් එක් සක්වළෙක සක්විති රජවරු දෙදෙනෙක් නූපදිත්ද? විවාද දුරලීම් වශයෙන්ද අසිරිමත් බවින්ද සක්රුවනේ මහත් ආනුභාවයෙන්ද වෙයි. දෙදෙනෙකු උපදනා කල්හි අපගේ රජ මහත්ය. අපගේ රජ මහත්යයි විවාදයක් හටගන්නේය, මේ දිවයිනෙහි සක්විති රජය, මේ දිවයිනෙහි සක්විති රජයයි අනාශ්චර්‍ය්‍යයක් වෙයි. සක්රුවනේ දෙදෙහසක් දිවයින් පිරිවර කොට ඇති සතර මහාදිවයින්හි ඉසුරු දීමේ යම් සමත් මහානුභාවයක් වේද? එය පිරිහෙන්නේය. මෙසේ විවාද දුරලීම් වශයෙන්ද අසිරිමත්බවින්ද සක්රුවනේ මහත් ආනුභාවයෙන්ද එක් සක්වළක දෙදෙනෙක් නූපදිත්,"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 561,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**යං ඉත්ථී අරහං අස්ස සම්මාසම්බුද්ධො**ති එත්ථ තිට්ඨතු තාව සබ්බඤ්ඤුගුණෙ නිබ්බත්තෙත්වා ලොකනිත්ථරණසමත්ථො බුද්ධභාවො, පණිධානමත්තම්පි ඉත්ථියා න සම්පජ්ජති."
                    },
                    {
                        "type": "gatha",
                        "text": "“මනුස්සත්තං ලිඞ්ගසම්පත්ති, හෙතු සත්ථාරදස්සනං;\nපබ්බජ්ජා ගුණසම්පත්ති, අධිකාරො ච ඡන්දතා;\nඅට්ඨ ධම්මසමොධානා, අභිනීහාරො සමිජ්ඣතී”ති. (බු· වං· 2.59) –",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "ඉමානි හි පණිධානසම්පත්තිකාරණානි. ඉති පණිධානම්පි සම්පාදෙතුං අසමත්ථාය ඉත්ථියා කුතො බුද්ධභාවොති. “අට්ඨානමෙතං, භික්ඛවෙ, අනවකාසො, යං ඉත්ථී අරහං අස්ස සම්මාසම්බුද්ධො”ති වුත්තං. සබ්බාකාරපරිපූරොව පුඤ්ඤුස්සයො සබ්බාකාරපරිපූරමෙව අත්තභාවං නිබ්බත්තෙතීති පුරිසොව අරහං හොති සම්මාසම්බුද්ධො, න ඉත්ථී."
                    },
                    {
                        "type": "paragraph",
                        "text": "**රාජා අස්ස චක්කවත්තී**තිආදීසුපි යස්මා ඉත්ථියා කොසොහිතවත්ථගුය්හතාදීනං අභාවෙන ලක්ඛණානි න පරිපූරන්ති, ඉත්ථිරතනාභාවෙන සත්තරතනසමඞ්ගිතා න සම්පජ්ජති, සබ්බමනුස්සෙහි ච අධිකො අත්තභාවො න හොති. තස්මා “අට්ඨානමෙතං, භික්ඛවෙ, අනවකාසො යං ඉත්ථී රාජා අස්ස චක්කවත්තී”ති වුත්තං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මා ච සක්කත්තාදීනි තීණි ඨානානි උත්තමානි, ඉත්ථිලිඞ්ගඤ්ච හීනං, තස්මා චස්සා සක්කත්තාදීනිපි පටිසිද්ධානි."
                    },
                    {
                        "type": "paragraph",
                        "text": "නනු ච යථා ඉත්ථිලිඞ්ගං, එවං පුරිසලිඞ්ගම්පි බ්රහ්මලොකෙ නත්ථි. තස්මා “යං පුරිසො බ්රහ්මත්තං කාරෙය්ය, ඨානමෙතං විජ්ජතී”තිපි න වත්තබ්බං සියාති. නො න වත්තබ්බං. කස්මා? ඉධ පුරිසස්ස තත්ථ නිබ්බත්තනතො. බ්රහ්මත්තන්ති හි මහාබ්රහ්මත්තං අධිප්පෙතං. ඉත්ථී ච ඉධ ඣානං භාවෙත්වා කාලං කත්වා බ්රහ්මපාරිසජ්ජානං සහබ්යතං උපපජ්ජති, න මහාබ්රහ්මානං. පුරිසො පන තත්ථ නුප්පජ්ජතීති න වත්තබ්බො. සමානෙපි චෙත්ථ උභයලිඞ්ගාභාවෙ පුරිසසණ්ඨානාව බ්රහ්මානො, න ඉත්ථිසණ්ඨානා. තස්මා සුවුත්තමෙවෙතං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**කායදුච්චරිතස්සා**තිආදීසු යථා නිම්බබීජකොසාතකිබීජාදීනි මධුරං ඵලං න නිබ්බත්තෙන්ති, අසාතං අමධුරමෙව නිබ්බත්තෙන්ති, එවං කායදුච්චරිතාදීනි මධුරං විපාකං න නිබ්බත්තෙන්ති, අමධුරමෙව නිබ්බත්තෙන්ති. යථා ච උච්ඡුබීජසාලිබීජාදීනි මධුරං සාදුරසමෙව ඵලං නිබ්බත්තෙන්ති, න අසාතං කටුකං. එවං කායසුචරිතාදීනි මධුරමෙව විපාකං නිබ්බත්තෙන්ති, න අමධුරං. වුත්තම්පි චෙතං –"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**යං ඉත්‍ථී අරහං අස්ස සම්මාසම්බුද්ධො** යනු මෙහි සර්‍වඥ තා ගුණයෙන් උපදවා ලෝකයා (සසරින්) එතෙර කිරීමට සමත් බුදුබව තිබියේවා? ස්ත්‍රියකට ප්‍රර්‍ත්‍ථනා මාත්‍රයක්වත් නොඑළඹෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "මිනිසත්බව, ලිංගසම්පත්තිය, හේතුව, ශස්තෘවරයකු දැකීම, පැවිද්ද, ගුණසම්පත්තිය, ප්‍රාර්‍ත්‍ථනව කැමැත්ත යන ධර්‍මඅට එක්වීමෙන් අභිනීහාරය (බුදුබව පැතීම) ඉටුවෙයි.{1}"
                    },
                    {
                        "type": "unindented",
                        "text": "මේවා ප්‍රාර්‍ත්‍ථනාව ඉටුවීමේ කරුණයි. මෙසේ ප්‍රාර්‍ත්‍ථනවද ඉටුකර ගැනීමට අසමත් බැවින් ස්ත්‍රියට බුදුබවක් කොයින්ද? ‘මහණෙනි, ස්ත්‍රිය අරහත් සම්මා සම්බුදු වේය යන යමක් වේද? එයට කරුණු රහිතය, අවකාශ රහිතය’යි කියනලදී. සියළු අයුරින් සපිරුණු පින් රැසම සියලු අයුරින් පිරිපුන් ආත්මභාවයක් උපදවන්නෙයි පිරිමියෙක්ම අරහත් සම්මා සම්බුදු වෙයි, ස්ත්‍රිය නොවෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**රාජා අස්ස චක්කවත්ති** යනාදියෙහිද යම් හෙයකින් ස්ත්‍රියගේ කොපුවකින් වැසුණු අංගජාතාදිය නොමැති බැවින් ලකුණු නොපිරෙයි. ස්ත්‍රීරත්නයක අභාවයෙන් සත්රුවනින් යුක්තවීම නොලැබෙයි. සියලු මිනිසුන් කෙරෙහිද වැඩි වූ අත්බැවක් නොවෙයි. එහෙයින්, ‘මහණෙනි, ස්ත්‍රිය සක්විති රජ වේ යන යමක් වේද? එය කරුණු රහිතය. අවකාශ රහිතය’යි කියනලදී."
                    },
                    {
                        "type": "paragraph",
                        "text": "යම් හෙයකින් ශක්‍ර බව ආදී තැන් තුනක් උතුම් වේද? ස්ත්‍රීලිංගය පහත්ය, එබැවින් ඇයට සක්බව ආදියද වැළකිණි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ස්ත්‍රීලිංගය පමණක් නොව පුරුෂලිංගයද බ්‍රහ්ම ලෝකයෙහි නැත. එහෙයින් පුරුෂයෙක් බ්‍රහ්මබව කරන්නේය යන යමක් වේද? මෙකරුණ විද්‍යාමාන වේයයිද නොකිය යුතු වන්නේය. නොකිවයුතු වන්නේද නොවේ. කුමක් හෙයින්ද යත්? මෙහිලා පුරුෂයා එහි උපදින බැවිනි. **බ්‍රහ්මත්තං** යන්නෙන් මහාබ්‍රහ්ම බව අදහස් කරලදී ස්‍ත්‍රියද මෙහි ධ්‍යාන වඩා කළුරිය කොට බ්‍රහ්මපාරිසද්‍යයන් සමඟ සහවාසයෙහි උපදියි. මහාබ්‍රහ්මයන් සමඟ නොවේ. පුරුෂයා වනාහි එහි නූපදිතැයි නොකිව යුතුය. (ස්ත්‍රීපුරුෂ) උභය ලිංගයාගේ අභාවය සමානව ඇති කල්හි බ්‍රහ්මයෝ පිරිමි සටහන් ඇත්තෝම වෙත්, ගැහුණු සටහන් ඇත්තෝ නොවෙත්, එබැවින් මෙය මනාව කියන ලද්දේම වෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**කායදුච්චරිතස්ස** යනාදියෙහි කොහොඹ ඇට කරවිල ඇට ආදිය මිහිරිපල නොඋපදවයි. කටුක අමිහිර පලම උපදවයි. එසේ කායදුශ්චරිතාදිය මිහිර විපාක නූපදවයි. අමිහිරි විපාකම උපදවයි. යම්සේ උක් හැල්බීජාදිය මිහිරි මනාරස ඇති පල උපදවයිද අමිහිරි කටුක පල නූපදවයිද එසේම කායසුචරිතාදිය මිහිරිවූම විපාකයක් උපදවයි, අමිහිරි විපාකයක් නූපදවයි. මෙයද කියනලදී."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. මනුස්සත්තං ලිංගසම්පත්ති හෙතු සත්‍ථාරදස්සනං පබ්බජ්ජාගුණ සම්පත්ති - අධිකාරො ච ඡන්‍දතා අට්ඨධම්මසමොධානා - අහිනීහාරො සමිජ්ක්‍ධති"
                    }
                ]
            }
        },
        {
            "pageNum": 563,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "“යාදිසං වපතෙ බීජං, තාදිසං හරතෙ ඵලං;\nකල්යාණකාරී කල්යාණං, පාපකාරී ච පාපක”න්ති. (සං· නි· 1.256);",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්මා “අට්ඨානමෙතං, භික්ඛවෙ, අනවකාසො, යං කායදුච්චරිතස්සා”තිආදි වුත්තං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**කායදුච්චරිතසමඞ්ගී**තිආදීසු **සමඞ්ගී**ති පඤ්චවිධා සමඞ්ගිතා – ආයූහනසමඞ්ගිතා, චෙතනාසමඞ්ගිතා, කම්මසමඞ්ගිතා, විපාකසමඞ්ගිතා, උපට්ඨානසමඞ්ගිතාති. තත්ථ කුසලාකුසලකම්මායූහනක්ඛණෙ **ආයූහනසමඞ්ගිතා**ති වුච්චති. තථා **චෙතනාසමඞ්ගිතා**. යාව පන සත්තා අරහත්තං න පාපුණන්ති, තාව සබ්බෙපි සත්තා පුබ්බෙ උපචිතචෙතනාය සමඞ්ගිතාය චෙතනාසමඞ්ගිනොති වුච්චන්ති. එසා චෙතනාසමඞ්ගිතා. යාව අරහත්තං න පාපුණන්ති, තාව සබ්බෙපි සත්තා පුබ්බෙ උපචිතං විපාකාරහං කම්මං සන්ධාය “කම්මසමඞ්ගිනො”ති වුච්චන්ති. එසා **කම්මසමඞ්ගිතා. විපාකසමඞ්ගිතා** විපාකක්ඛණෙයෙව වෙදිතබ්බා. යාව පන සත්තා අරහත්තං න පාපුණන්ති, තාව තෙසං තතො තතො චවිත්වා නිරයෙ උප්පජ්ජමානානං අග්ගිජාලාලොහකුම්භිආදීහි උපට්ඨානාකාරෙහි නිරයො, ගබ්භසෙය්යකත්තං ආපජ්ජමානානං මාතුකුච්ඡි, දෙවෙසු උප්පජ්ජමානානං කප්පරුක්ඛවිමානාදීහි උපට්ඨානාකාරෙහි දෙවලොකොති එවං උපපත්තිනිමිත්තං උපට්ඨාති. ඉති නෙසං ඉමිනා උපපත්තිනිමිත්තඋපට්ඨානෙන අපරිමුත්තතා **උපට්ඨානසමඞ්ගිතා** නාම. සා චලති, සෙසා නිච්චලා. නිරයෙ හි උපට්ඨිතෙපි දෙවලොකො උපට්ඨාති, දෙවලොකෙ උපට්ඨිතෙපි නිරයො උපට්ඨාති, මනුස්සලොකෙ උපට්ඨිතෙපි තිරච්ඡානයොනි උපට්ඨාති, තිරච්ඡානයොනියා ච උපට්ඨිතායපි මනුස්සලොකො උපට්ඨාතියෙව."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්රිදං වත්ථු – සොණගිරිපාදෙ කිර අචෙලවිහාරෙ සොණත්ථෙරො නාම එකො ධම්මකථිකො. තස්ස පිතා සුනඛවාජිකො නාම අහොසි, ථෙරො තං පටිබාහන්තොපි සංවරෙ ඨපෙතුං අසක්කොන්තො “මා නස්සි වරාකො”ති මහල්ලකකාලෙ අකාමකං නං පබ්බාජෙසි. තස්ස ගිලානසෙය්යාය නිපන්නස්ස නිරයො උපට්ඨාසි. සොණගිරිපාදතො මහන්තා සුනඛා ආගන්ත්වා ඛාදිතුකාමා විය සම්පරිවාරෙසුං. සො මහාභයභීතො “වාරෙහි, තාත සොණ, වාරෙහි, තාත සොණා”ති ආහ. කිං මහාථෙරාති? න පස්සසි, තාතාති තං පවත්තිං ආචික්ඛි. සොණත්ථෙරො “කථඤ්හි නාම මාදිසස්ස පිතා නිරයෙ නිබ්බත්තිස්සති, පතිට්ඨාස්ස භවිස්සාමී”ති සාමණෙරෙහි නානාපුප්ඵානි ආහරාපෙත්වා චෙතියඞ්ගණබොධියඞ්ගණෙසු තලසන්ථරණපූජං ආසනපූජඤ්ච කාරෙත්වා පිතරං මඤ්චකෙන චෙතියඞ්ගණං හරිත්වා මඤ්චෙ නිසීදාපෙත්වා “අයං, මහාථෙර, පූජා තුම්හාකං අත්ථාය කතා, ‘අයං මෙ භගවා දුග්ගතපණ්ණාකාරො’ති වත්වා භගවන්තං වන්දිත්වා චිත්තං පසාදෙහී”ති ආහ. සා මහාථෙරො පූජං දිස්වා තථා කරොන්තො චිත්තං පසාදෙසි. තාවදෙවස්ස දෙවලොකො උපට්ඨාසි. නන්දනවන-චිත්තලතාවන-මිස්සකවන-ඵාරුසකවන-විමානානි චෙව දෙවනාටකානි ච පරිවාරෙත්වා ඨිතානි විය අහෙසුං. සො “අපෙථ, සොණ, අපෙථ, සොණා”ති ථෙරං ආහ. කිමිදං, මහාථෙරාති? එතා තෙ මාතරො ආගච්ඡන්තීති. ථෙරො “සග්ගො උපට්ඨිතො මහාථෙරස්සා”ති චින්තෙසි. එවං උපට්ඨානසමඞ්ගිතා චලතීති වෙදිතබ්බා. එතාසු සමඞ්ගිතාසු ඉධ ආයූහනචෙතනාකම්ම-සමඞ්ගිතාවසෙන “කායදුච්චරිතසමඞ්ගී”තිආදි වුත්තං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "‘යම්බඳු බීජයක් වපුරයිද එබඳුම පලයක් ගෙනෙනු ලැබේ. යහපත කරන්නා යහපත් පලයක්ද පවුකරන්නා පවිටුපලයක්ද ගෙනෙනු ලැබේ{1}"
                    },
                    {
                        "type": "paragraph",
                        "text": "එහෙයින් **අට්ඨානමෙතං භික්‍ඛවෙ අනවකාසො යං කායදුච්චරිතස්ස’** ආදිය කියනලදී."
                    },
                    {
                        "type": "paragraph",
                        "text": "**කායදුච්චරිතසමඞ්ගී** යනාදියෙහි ‘සමඞ්ගී’ යනු ආයුහන සමඞ්ගිතා, චෙතනා සමඞ්ගිතා, කම්මසමඞ්ගිතා, විපාක සමඞ්ගිතා යන පස්ආකාර සමඞ්ගිතාව (යුක්ත බව)යි. එහි කුශලාකුශලකර්‍ම රැස්වන කෙණෙහි ආයුහන සමඞ්ගිතාවයි කියනු ලැබේ. චෙතනා සමඞ්ගිතා යනුද එසේමයි. රහත් බවට නොපැමිණෙන තෙක් සියලුම සත්වයෝ පෙර රැස කරනලද විපාකයකට සුදුසු කර්‍මයන් නිසා කර්‍මයෙන් යුක්තවූවෝයයි කියනු ලැබෙත්. මෙය කර්‍මසමඞ්ගිතාවයි. විපාක සමඞ්ගිතාව විපාකක්‍ෂණයෙහිම දතයුතුය. සත්වයෝ යම්තාක් රහත්බවට නොපැමිණෙත්ද එතෙක් ඔවුන්ගෙන් ඒ ඒ තැනින් සැව නිරයෙහි උපදිනවුන්ට ගිනිදැල් ලොහොකුඹු ආදී වැටහෙන ආකාරයන්ගෙන් නිරයද මවුකුසට එළඹෙන්නවුන්ට මවුකුසද දෙවියන් අතුරෙහි උපදිනවුන්ට කප්රුක්වීමන් ආදී වැටහෙන ආකාරයෙන් දෙව්ලොවදැයි මෙසේ උප්පත්ති නිමිත්ත වැටහෙයි. මෙසේ ඔවුනට උත්පත්ති නිමිත්ත වැටහීමෙන් නොමිදෙනබැවින් උපට්ඨාන සමඞ්ගිතා නමි. එය සෙලවෙයි, සෙස්ස නිසලය. නිරයෙහි එළඹුනුකල්හිද දෙව්ලොවද වැටහෙයි. දෙව්ලොවෙහි එළඹුණු කල්හි නිරයද වැටහෙයි. මිනිස් ලොව එළඹුණු කල්හිද තිරිසන් යෝනියද තිරිසන් යෝනියෙහි එළඹුණු කල්හි මිනිස් ලොවද වැටහේමැයි"
                    },
                    {
                        "type": "paragraph",
                        "text": "එහිලා මේ කථාවස්තුවයි - සොණ ගිරි පාමුලෙහි පංචල විහාරයෙහි සොණ තෙරුන් නම් වූ එක් ධර්‍මකථිකයෙක් වූයේය. ඔහුගේ පියා සුනඛයින් මෙහෙයවා සතුන් දඩයම් කරන්නෙක් වූයේය. තෙරුන්වහන්සේ ඔහු වළහන්නහුද සංවරයෙහි තැබීමට නොහැකි වන්නෝ අසරණයා නොනැසේවායි මහළු කල නොකැමැත්තෙන්ම පැවිදි කරවූහ. ගිලන් ඇඳෙහි වැදහොත්තාවූ ඔහුට නිරය වැටහුනේය. සොණ ගිරි පාමුලින් මහත් සුණඛයෝ අවුත් කනුකැමැත්තවුන් මෙන් වටකළාහුය. හෙතෙම මහත් බියෙන් බියපත්වූයේ ‘දරුව, සොණ වළක්වන්න, දරුව සෝණ වළක්වන්නැ’යි කීය, ‘කිමෙක්ද මහතෙර’යි සොණ තෙරණුවෝ ඇසූහ.’දරුව නොදක්නෙහිදැ’යි එපුවත සැළකළේය. සොණ තෙරණුවෝ ‘කෙසේනම් මා වැන්නෙකුගේ පියෙක් නරකයෙහි උපදින්නේද? මොහුට පිහිටක් වන්නේමැයි සාමණේරයන් ලවා නොයෙක් මල් ගෙන්වා සෑමලු බෝමලුවල මල් අතුරා කරන පූජාවක්ද ආසන පූජාවක්ද කරවා පියා ඇඳකින් සෑමලුවට යවා ඇඳෙහි හිඳුවා ‘මහතෙරුන්වහන්ස, මේ පූජාව ඔබ වෙනුවෙන් කරනලදී. භාග්‍යවතුන්වහන්ස, මේ මාගේ දිළිඳු පඬුරකැයි කියා භාග්‍යවතුන්වහන්සේ වැඳ සිත පහදවා ගනුමැනවැයි කීහ. මහතෙරණුවෝ පූජාව දැක එසේ කරමින් සිත පැහැදවූහ. එකෙණෙහිම ඔහුට දෙව්ලොව (නිමිති වශයෙන්) වැටහුණේය. නන්දන වනය, චිත්‍රලතා වනය, මිශ්‍රක වනය, පාරසක වන විමානයන් මෙන්ම දෙව් නිළියන්ද පිරිවරා සිටියාක් මෙන් විය. හෙතෙම ‘සොණ ඉවත්වන්නැයි කීවේය. ‘තෙරුන් වහන්ස, මේ කිමෙක්දැ’යි ඇසීය. මේ ඔබේ මවුවරු පැමිණෙති’යි කීවේය. තෙරණුවෝ ‘තෙරුන්ට ස්වර්‍ගය එළඹ සිටියේයයි සිතූහ. මෙසේ උපට්ඨාන සමඞ්ගිතාව වෙනස් වේයයි දතයුතුය. මේ සමංගිතාවන් අතුරෙහි මෙහි ආයුහන, චෙතනා, කර්‍මසමංගිතා වශයෙන්ද කායදුශ්චරිත සමංගිතා වශයෙන්ද කායදුච්චරිත සමංගි යනාදිය කියනලදී."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. “යාදිසං වපතෙ බීජං - තාදිසං හරතෙ ඵලං කල්‍යාණකාරී කල්‍යාණං - පාපකරීච පාපකං”"
                    }
                ]
            }
        },
        {
            "pageNum": 565,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තත්ථ එකෙ ආචරියා “යස්මිං ඛණෙ කම්මං ආයූහති, තස්මිංයෙව ඛණෙ තස්ස සග්ගො වාරිතො”ති වදන්ති. අපරෙ පන “ආයූහිතකම්මං නාම විපාකවාරං ලභන්තම්පි අත්ථි අලභන්තම්පි. තත්ථ යදා කම්මං විපාකවාරං ලභති, තස්මිංයෙව කාලෙ තස්ස සග්ගො වාරිතො”ති වදන්ති. සෙසං සබ්බත්ථ උත්තානත්ථමෙවාති."
                    },
                    {
                        "type": "centered",
                        "text": "අට්ඨානපාළිවණ්ණනා නිට්ඨිතා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "එකධම්මපාළි",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "පඨමොවග්ගො.",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "එකධම්මපාළියං **එකධම්මො**ති එකසභාවො. **එකන්තනිබ්බිදායා**ති එකන්තෙන වට්ටෙ නිබ්බින්දනත්ථාය උක්කණ්ඨනත්ථාය. **විරාගායා**ති වට්ටෙ විරජ්ජනත්ථාය, රාගාදීනං වා කිලෙසානං විරජ්ජනාය විගමාය. **නිරොධායා**ති රාගාදීනං නිරොධාය අප්පවත්තිකරණත්ථාය, වට්ටස්සෙව වා නිරුජ්ඣනත්ථාය. **උපසමායා**ති කිලෙසවූපසමනත්ථාය, **අභිඤ්ඤායා**ති අනිච්චාදිවසෙන ලක්ඛණත්තයං ආරොපෙත්වා අභිජානනත්ථාය. **සම්බොධායා**ති චතුන්නං සච්චානං බුජ්ඣනත්ථාය, “බොධි වුච්චති චතූසු මග්ගෙසු ඤාණ”න්ති (මහානි· 191; චූළනි· ඛග්ගවිසාණසුත්තනිද්දෙසො 121) එවං වුත්තස්ස වා චතුමග්ගඤාණස්ස පටිවිජ්ඣනත්ථාය. **නිබ්බානායා**ති අප්පච්චයනිබ්බානස්ස සච්ඡිකරණත්ථාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉති භගවා ඉමෙහි සත්තහි පදෙහි බුද්ධානුස්සතිකම්මට්ඨානස්ස වණ්ණං කථෙසි. කස්මා? මහාජනස්ස උස්සාහජනනත්ථං විසකණ්ටකවාණිජො විය අත්තනො පණියස්ස. විසකණ්ටකවාණිජො නාම ගුළවාණිජො වුච්චති. සො කිර ගුළඵාණිතඛණ්ඩසක්කරාදීනි සකටෙනාදාය පච්චන්තගාමං ගන්ත්වා “විසකණ්ටකං ගණ්හථ, විසකණ්ටකං ගණ්හථා”ති උග්ඝොසෙසි. තං සුත්වා ගාමිකා “විසං නාම කක්ඛළං ඝොරං. යො නං ඛාදති, සො මරති. කණ්ටකම්පි විජ්ඣිත්වා මාරෙති, උභොපෙතෙ කක්ඛළා. කො එත්ථ ආනිසංසො”ති ගෙහද්වාරානි ථකෙසුං, දාරකෙ ච පලාපෙසුං. තං දිස්වා වාණිජො ‘අවොහාරකුසලා ඉමෙ ගාමිකා, හන්ද නෙ උපායෙන ගාහාපෙමී”ති “අතිමධුරං ගණ්හථ, අතිසාදුං ගණ්හථ, ගුළං ඵාණිතං සක්කරං සමග්ඝං ලබ්භති, කූටමාසකකූටකහාපණාදීහි වාපි ලබ්භතී”ති උග්ඝොසෙසි. තං සුත්වා ගාමිකා තුට්ඨපහට්ඨා වග්ගවග්ගා ගන්ත්වා බහුම්පි මූලං දත්වා අග්ගහෙසුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ථ විසකණ්ටකවාණිජස්ස “විසකණ්ටකං ගණ්හථා”ති උග්ඝොසනං විය භගවතො බුද්ධානුස්සතිකම්මට්ඨානකථනං, විසකණ්ටකෙ වණ්ණං කථෙත්වා තස්ස ගහණත්ථාය මහාජනස්ස උස්සාහකරණං විය ඉමෙහි සත්තහි පදෙහි බුද්ධානුස්සතිකම්මට්ඨානස්ස වණ්ණභණනෙන තස්ස මහාජනස්ස උස්සාහකරණං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එහි ඇතැම් ආචාර්‍ය්‍යවරු ‘යම්විටෙක කර්‍මය රැස්වේද? එකෙණෙහිම ඔහුට ස්වර්‍ගය වැළකිණැ’යි කියති. අන්‍යයෝ වනාහි, ‘විපාකවාර ලබන්නාවූද නොලබන්නාවූද ආයුහිත (රැස්වූ) කර්‍ම ඇත. එහි යම්විටෙක කර්‍මය විපාකාවාරයක් ලබයිද එකෙණෙහිම ඔහුට ස්වර්‍ගය වැළකිණැ’යි කියත්, සෙස්ස සියලුතන්හි ප්‍රකට අරුත් ඇත්තේමය."
                    },
                    {
                        "type": "centered",
                        "text": "අට්ඨාන පාළිවර්‍ණනාව නිමියේයි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "එකධම්ම පාළිය",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "පළමු වර්ගය",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "එකධම්මපාළියෙහි **එකධම්මො** යනු එක් එක් ස්වභාවයකි. **එකනතනිබ්බිදාය** යනු එකාන්තයෙන්ම සසරෙහි කළකිරීම, උකටලීවීම සඳහායි. **විරාගය** යනු සසරෙහි නොඇලීම සඳහායි. රාගාදීවූ කෙලෙසුන්ගේ නොඇලීම දුරුකිරීම සඳහාය යනුයි. **නිරොධාය** යනු රාගාදීන්ගේ නිරෝධය සඳහා නොපැවැත්ම ඇති කරනු සඳහායි. සසරෙහිම නිරුද්ධවීම සඳහායි**. උපසමාය** යනු කෙලෙසුන් ව්‍යාපසමනය කරනු සඳහායි. **අභිඤ්ඤාය** යනු අනිත්‍යාදි වශයෙන් ලක්‍ෂණත්‍රයට නංවා මනාව දැනීම සඳහායි. **සම්බොධාය** යනු සිවුසස් අවබෝධ කර ගැනීම සඳහායි. සතර මාර්‍ගයන්හි ඥානය බෝධියයි කියනු ලැබේයයි මෙසේ කියනලද සතරමාර්‍ගඥානය හෝ අවබෝධ කිරීම සඳහායි** නිබ්බානාය** යනු ප්‍රත්‍යය රහිත නිර්‍වාණය ප්‍රත්‍යක්‍ෂ කරනු සඳහායි."
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙසේ භාග්‍යවතුන්වහන්සේ මේ සත් පදයන්ගෙන් බුද්ධානුස්මෘති කර්‍මස්ථානයාගේ වර්‍ණනාව කළ සේක. කුමක් හෙයින්ද යත්? විසකණ්ඩක වෙළෙන්දා තමන්ගේ වෙළඳබඩුවලට මෙන් මහජනයාට උනන්දුව ඇති කරලනු සඳහායි. විසකණ්ටක වෙළෙන්දා නම් සකුරු වෙළෙන්දායයි කියනු ලැබේ. හෙතෙම උක්සකුරුපැණි කැටහකුරු ආදිය ගැලෙන් ගෙන පසල් ගමට ගොස් විසකණ්ටක ගනුව විසකණ්ටක ගනුවයි හඬනැඟීය. එය අසා ගැමියෝ විසය නම් දරුණුය, භයානකය යමෙක් ඒවා කයි නම් හෙතෙම මැරෙයි. කටුවද විද මරයි. මේ දෙකම දරුණුය. මෙහි කවර අගයක්දැයි දොරවල් වැසුවාහුය. දරුවන්ද පළවා හැරියහ. වෙළෙන්දා එය දැක මේ ගැමියෝ ව්‍යවහාරය නොදන්නහුය. උපායෙන් මොවුන් ලවා ගන්වන්නේමැයි ඉතා මිහිරි දෙය ගන්න, ඉතා රසවත් දෙය ගන්න, උක් හකුරු පැණි සම අගයට ලැබෙයි. කූට මසුරන් කූට කහවණු ආදියෙන්ද ලැබේයයි හඬ නැංවීය. එය අසා ගැමියෝ සතුටු සිත් ඇතිව ගොස් බොහෝවූද මිල දී ගත්තාහුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "එහි භාග්‍යවතුන්වහන්සේගේ බුද්ධානුස්සති කර්‍මස්ථානය කීම වෙළෙන්දාගේ විසකණ්ටක ගනුවයි හඬ නැඟීම මෙනි. මේ පදසතින් බුද්ධානුස්සති කර්‍මස්ථානයෙහි වර්‍ණනාව කීමෙන් එහි මහජනයා උනන්දු කරවීම විෂකණටකයෙහි ගුණ කියා එය ගැනීම සඳහා මහජනයා උනන්දු කරවීම මෙනි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 567,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**කතමො එකධම්මො**ති කථෙතුකම්යතාපුච්ඡා. **බුද්ධානුස්සතී**ති බුද්ධං ආරබ්භ උප්පන්නා අනුස්සති, බුද්ධගුණාරම්මණාය සතියා එතං අධිවචනං. තං පනෙතං බුද්ධානුස්සතිකම්මට්ඨානං දුවිධං හොති චිත්තසම්පහංසනත්ථඤ්චෙව විපස්සනත්ථඤ්ච. කථං? යදා හි අසුභාරම්මණෙසු අඤ්ඤතරං භාවෙන්තස්ස භික්ඛුනො චිත්තුප්පාදො උපහඤ්ඤති උක්කණ්ඨති නිරස්සාදො හොති, වීථිං නප්පටිපජ්ජති, කූටගොණො විය ඉතො චිතො ච විධාවති. තස්මිං ඛණෙ එස මූලකම්මට්ඨානං පහාය “ඉතිපි සො භගවා”තිආදිනා නයෙන තථාගතස්ස ලොකියලොකුත්තරගුණෙ අනුස්සරති. තස්සෙවං බුද්ධං අනුස්සරන්තස්ස චිත්තුප්පාදො පසීදති, විනීවරණො හොති. සො තං චිත්තං එවං දමෙත්වා පුන මූලකම්මට්ඨානංයෙව මනසි කරොති. කථං? යථා නාම බලවා පුරිසො කූටාගාරකණ්ණිකත්ථාය මහාරුක්ඛං ඡින්දන්තො සාඛාපලාසච්ඡෙදනමත්තෙනෙව ඵරසුධාරාය විපන්නාය මහාරුක්ඛං ඡින්දිතුං අසක්කොන්තොපි ධුරනික්ඛෙපං අකත්වාව කම්මාරසාලං ගන්ත්වා තිඛිණං ඵරසුං කාරාපෙත්වා පුන තං ඡින්දෙය්ය. එවංසම්පදමිදං දට්ඨබ්බං. සො එවං බුද්ධානුස්සතිවසෙන චිත්තං පරිදමෙත්වා පුන මූලකම්මට්ඨානං මනසිකරොන්තො අසුභාරම්මණං පඨමජ්ඣානං නිබ්බත්තෙත්වා ඣානඞ්ගානි සම්මසිත්වා අරියභූමිං ඔක්කමති. එවං තාව චිත්තසම්පහංසනත්ථං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යදා පනෙස බුද්ධානුස්සතිං අනුස්සරිත්වා “කො අයං ඉතිපි සො භගවාතිආදිනා නයෙන අනුස්සරි, ඉත්ථි නු ඛො පුරිසො නු ඛො දෙවමනුස්සමාරබ්රහ්මානං අඤ්ඤතරො නු ඛො”ති පරිග්ගණ්හන්තො “න අඤ්ඤො කොචි, සතිසම්පයුත්තං පන චිත්තමෙව අනුස්සරී”ති දිස්වා “තං ඛො පනෙතං චිත්තං ඛන්ධතො විඤ්ඤාණක්ඛන්ධො හොති, තෙන සම්පයුත්තා වෙදනා වෙදනාක්ඛන්ධො, තෙන සම්පයුත්තා සඤ්ඤා සඤ්ඤාක්ඛන්ධො, සහජාතා ඵස්සාදයො සඞ්ඛාරක්ඛන්ධොති ඉමෙ චත්තාරො අරූපක්ඛන්ධා හොන්තී”ති අරූපඤ්ච වවත්ථපෙත්වා තස්ස නිස්සයං පරියෙසන්තො හදයවත්ථුං දිස්වා තස්ස නිස්සයානි චත්තාරි මහාභූතානි, තානි උපාදාය පවත්තානි සෙසඋපාදාරූපානි ච පරිග්ගහෙත්වා “සබ්බම්පෙතං රූපං රූපක්ඛන්ධො”ති වවත්ථපෙත්වා “ඉදඤ්ච රූපං පුරිමඤ්ච අරූප”න්ති සඞ්ඛෙපතො රූපාරූපං, පභෙදතො පඤ්චක්ඛන්ධෙ පුන “සඞ්ඛෙපතො පඤ්චපෙතෙ ඛන්ධා දුක්ඛසච්ච”න්ති දුක්ඛසච්චං වවත්ථපෙත්වා “තස්ස පභාවිකා තණ්හා සමුදයසච්චං, තස්සා නිරොධො නිරොධසච්චං, නිරොධපජානනා පටිපදා මග්ගසච්ච”න්ති එවං පුබ්බභාගෙ චත්තාරි ච සච්චානි වවත්ථපෙත්වා පටිපාටියා අරියභූමිං ඔක්කමති. තදාස්ස ඉමං කම්මට්ඨානං විපස්සනත්ථං නාම හොති. **අයං ඛො**තිආදි අප්පනාවාරො වුත්තනයෙනෙව වෙදිතබ්බො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**කතමො එක ධම්මො** යනු කියනු කැමති(ව) විමසීමයි. **බුද්ධානුස්සති** යනු බුදුන් අරබයා උපන් යළියළිත් සිහිකිරීමයි. බුදුගුණය අරමුණු කොට ඇති සිහියට මෙය නමෙකි. ඒ මේ බුද්ධානුස්මෘති කර්‍මස්ථානය දෙපරිදි වෙයි. සිත සතුටුවීම සඳහා මෙන්ම විපස්සනාව සඳහාද යනුවෙනි. කෙසේද? යම් විටෙක අසුහාරම්මණයන් අතුරෙන් යම් අරමුණක් වඩන්නාවූ භික්‍ෂුවගේ සිත හට ගැනීම වෙහෙසෙයි. කළකිරෙයි. ආස්වාද රහිත වෙයි. වීථියට නොඑළඹෙයි. කුළු ගොනෙකු මෙන් ඔබිමොබ දුවයි. එකෙණෙහි එය මුල් කොට ඇති කර්‍මස්ථානය හැර බුදුරජාණන් වහන්සේ ඒ කාරණයෙනුදු භාග්‍යවත් වනසේක. (ඉතිපිසො භගවා) යනාදී ක්‍රමයෙන් තථාගතයන් වහන්සේගේ ලෞකික ලෝකෝත්තර ගුණයන් සිහි කරයිද මෙසේ බුදුන් සිහි කරන්නාවූ ඔහුගේ චිත්තොත්පාදය පහදියි. නීවරණ රහිත වූයේ වෙයි. හෙතෙම ඒ සිත දමනය කොට මනාව දමනය කොට නැවත මුල් කමටහනම සිහි කරයි. කෙසේද? යම් සේ නම් බලවත් පුරුෂයෙක් කුළුගෙයි කැණිමඬල සඳහා මහ ගසක් සිඳින්නේ අතුරපතර කැපීමේදී පොරෝ මුවත නැතිවූ විට මහගස කැපීමට නොහැක්කේ වුවද අදහස අත නොහැර කම්මලට ගොස් තියුණු පොරොවක් කරවා යළි ඒ ගස සිඳින්නේද එසේ මේ කාරණය දතයුතුය. හෙතෙම මෙසේ බුද්ධානුස්සති වශයෙන් සිත මනාව දමනය කොට යළි මුල් කමටහන මෙනෙහි කරන්නේ අසුභාරම්මණ සහිත වූ ප්‍රථමධ්‍යානය උපදවා ධ්‍යානාංග සම්මර්‍ශනය කොට ආර්‍ය්‍ය භූමියට බැස ගනී. මෙසේ සිත සතුටුවීම සඳහා වෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "යම් කලෙක වනාහි මෙතෙම බුද්ධානුස්මෘතිය සිහි කොට කවරෙක් මේ භාග්‍යවතුන් වහන්සේ වන සේක්දැයි ආදි ක්‍රමයෙන් සිහි කළේද? ස්ත්‍රියක්ද පුරුෂයෙක්ද දෙවිමිනිස් මාර බ්‍රහ්මයන් අතුරෙන් යම් කෙනක්දැයි සලකන්නේ, අන් කිසිවෙක් නොවේ. සිහියෙන් යුත් සිතම සිහි කළේයයි දැක ඒ මේ සිත ස්කන්‍ධ වශයෙන් විඥානස්කන්‍ධය වෙයි. එයින් යුක්තවූ වේදනාව වේදනාස්කන්‍ධයයි. එයින් යුක්තවූ සංඥාව සංඥාස්කන්‍ධයයි.එක්ව හටගත් ස්පර්‍ශාදිය සංස්කාරස්කන්‍ධයයි. මේ සතර අරූප ස්කන්‍ධයෝ වෙතැයි අරූපයද ව්‍යවස්ථාපනය කොට එයට නිශ්‍රයක් සොයන්නේ හෘදයවස්තුව දැක එයට නිශ්‍රයවූ සතර මහාභුතද ඒවා උපාදාය කොට පැවති සෙසු උපාදාරූපද සලකා මේ සියලු රූපය රූපස්කන්ධයයි නිගමනය කොට මේ රූපයද පළමු අරූපයදැයි සැකෙවින් රූපාරූපය ප්‍රභේදවශයෙන් පඤචස්කන්‍ධයන් යළි සැකෙවින් මේ ස්කන්‍ධ පස දුක්‍ඛ සත්‍යයි දුක්‍ඛසත්‍යය නිශ්චය කොට එය උපදවන්නාවූ තෘෂ්ණාව සමුදය සත්‍යයයිද එහි නිරෝධ නිරෝධ සත්‍යයයයිද නිරෝධය උපදවන්නාවූ ප්‍රතිපදාව මාර්‍ග සත්‍යයයිද මෙසේ පූර්‍වභාගයෙහි චතුරාර්‍ය්‍ය සත්‍යයන් ව්‍යවස්ථාපනය කොට පිළිවෙළින් ආර්‍ය්‍ය භූමියට එළඹෙයි. එකල්හි ඔහුට මේ කමටහන විදර්‍ශනාව සඳහා නම් වෙයි. **අයං ඛො** යනාදීවූ අපර්ණා වාරය කියන ලද ක්‍රමයෙන්ම දතයුතුයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 569,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**ධම්මානුස්සති**ආදීසුපි එසෙව නයො. අයං පනෙත්ථ වචනත්ථො – ධම්මං ආරබ්භ උප්පන්නා අනුස්සති **ධම්මානුස්සති,** ස්වාක්ඛාතතාදිධම්මගුණාරම්මණාය සතියා එතං අධිවචනං. සඞ්ඝං ආරබ්භ උප්පන්නා අනුස්සති **සඞ්ඝානුස්සති,** සුප්පටිපන්නතාදිසඞ්ඝගුණාරම්මණාය සතියා එතං අධිවචනං. සීලං ආරබ්භ උප්පන්නා අනුස්සති **සීලානුස්සති,** අඛණ්ඩතාදිසීලගුණාරම්මණාය සතියා එතං අධිවචනං. චාගං ආරබ්භ උප්පන්නා අනුස්සති **චාගානුස්සති,** මුත්තචාගතාදිචාගගුණාරම්මණාය සතියා එතං අධිවචනං. දෙවතා ආරබ්භ උප්පන්නා අනුස්සති **දෙවතානුස්සති,** දෙවතා සක්ඛිට්ඨානෙ ඨපෙත්වා අත්තනො සද්ධාදිගුණාරම්මණාය සතියා එතං අධිවචනං. ආනාපානෙ ආරබ්භ උප්පන්නා සති **ආනාපානස්සති,** අස්සාසපස්සාසනිමිත්තාරම්මණාය සතියා එතං අධිවචනං. මරණං ආරබ්භ උප්පන්නා සති **මරණස්සති,** ජීවිතින්ද්රියුපච්ඡෙදාරම්මණාය සතියා එතං අධිවචනං. කෙසාදිභෙදං රූපකායං ගතා, කායෙ වා ගතාති කායගතා, කායගතා ච සා සති චාති කායගතාසතීති වත්තබ්බෙ රස්සං අකත්වා **කායගතාසතී**ති වුත්තා. කෙසාදිකායකොට්ඨාසනිමිත්තාරම්මණාය සතියා එතං අධිවචනං. උපසමං ආරබ්භ උප්පන්නා අනුස්සති **උපසමානුස්සති,** සබ්බදුක්ඛූපසමාරම්මණාය සතියා එතං අධිවචනං. දුවිධො වා උපසමො අච්චන්තූපසමො ච ඛයූපසමො ච. තත්ථ **අච්චන්තූපසමො** නාම නිබ්බානං, **ඛයූපසමො** නාම මග්ගො. එවමෙතං දුවිධම්පි උපසමං අනුස්සරන්තස්ස උප්පන්නා සති උපසමානුස්සතීති අයමෙත්ථ අත්ථො. ඉති ඉමෙසු දසසු කම්මට්ඨානෙසු ආනාපානස්සති මරණස්සති කායගතාසතීති ඉමානි තීණි විපස්සනත්ථානෙව හොන්ති, සෙසානි සත්ත චිත්තසම්පහංසනත්ථානිපි හොන්තීති."
                    },
                    {
                        "type": "centered",
                        "text": "පඨමවග්ගවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතියොවග්ගො.",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "දුතියෙ **මිච්ඡාදිට්ඨී**ති ද්වාසට්ඨිවිධායපි මිච්ඡාදිට්ඨියා එතං අධිවචනං. **මිච්ඡාදිට්ඨිකස්සා**ති තාය දිට්ඨියා සමන්නාගතස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සම්මාදිට්ඨී**ති පඤ්චවිධායපි සම්මාදිට්ඨියා එතං අධිවචනං. **සම්මාදිට්ඨිකස්සා**ති තාය දිට්ඨියා සමන්නාගතස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අයොනිසො මනසිකාරො**ති අනුපායමනසිකාරො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යොනිසො මනසිකාරො**ති උපායමනසිකාරො. තත්ථ අයොනිසො මනසිකරොතො පුබ්බෙ අනුප්පන්නා මිච්ඡාදිට්ඨි උප්පජ්ජති, උප්පන්නා පන යාව නියාමොක්කමනා පවඩ්ඪති. නියාමෙ ඔක්කන්තෙ වඩ්ඪිතා නාම හොති. යොනිසො මනසිකරොතො පුබ්බෙ අනුප්පන්නා සම්මාදිට්ඨි උප්පජ්ජති, උප්පන්නා පන යාව අරහත්තමග්ගා පවඩ්ඪති. අරහත්තඵලෙ පත්තෙ වඩ්ඪිතා නාම හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**ධම්මානුස්සති** ආදියෙහිද මේ ක්‍රමයෙන්ම දතයුතුයි. ධම්මානුස්සති ආදියෙහිද මේ ක්‍රමය ඇත්තේමැයි. මේ වනාහි වචනාර්ථයයි. ධර්‍මය අරභයා උපන් අනුසමෘතිය ධම්මානුස්සතියයි (භාග්‍යවතුන්වහන්සේ විසින්) මනාව දෙසනලදැයි ආදී ධර්‍මයේ ගුණ අරමුණකොට ඇති සිහියට මේ නමකි. සංඝයා අරභයා උපන් අනුස්මෘතිය සංඝානුස්සතියයි. මනාව පිළිපන් ආදී සංඝගුණ අරමුණුකොට ඇති සිහියට මේ නමකි. ශීලය අරභයා උපන්නාවූ අනුස්මෘතිය සීලානුස්සතියයි. කඩනොවීම් ආදී සිල් ගුණ අරමුණුකොට ඇතිවන සිහියට මේ නමකි. ත්‍යාගය (අත්හැරීම) අරභයා උපන්නාවූ අනුසමෘතිය චගානුස්සතියයි. මුත්තචාගතා ආදී ත්‍යාග ගුණ අරමුණුකොට ඇතිසිහියට මේ නමකි. දෙවියන් අරභයා උපන්නාවූ අනුස්මෘතිය දෙවතානුස්සතියයි. දෙවියන් සාක්‍ෂිස්ථානයෙහි තබා තමන්ගේ ශ්‍රද්ධාදී ගුණ අරමුණුකොට ඇතිවන සිහියට මේ නමකි. ආනාපානයන් (ආශ්වාස ප්‍රශ්වාසයන්) අරභයා උපන්නාවූ අනුස්මෘතිය ආනාපානසතියයි. හුස්ම ඉහලට ගැනීමේ හා පහලට ගැනීමේ නිමිති අරමුණුකොට ඇතිවන සිහියට මේ නමකි. මරණය අරභයා උපන්නාවූ අනුස්මෘතිය මරණානුස්සතියයි. ජීවිතින්‍ද්‍රිය විනාශවීම අරමුණු කොට ඇතිවන සිහියට මේ නමකි. කේශාදි ප්‍රභේද ඇති රූපකායට ගියේ හෝ කයෙහි ගියේනුයි කායගතානමි. කායගතවූයේත් සතියවූයේත් එමනුයි කායගතසතියයි කිවයුතුකල්හි හ්‍රස්වය නොකොට කායගතා සතියයි කියනලදී. කෙශාදි ශරීර කොටස් නිමිති අරමුණුකොට ඇති සිහියට මේ නමකි. සංසිදීම අරභයා උපන්නාවූ අනුස්මෘතිය උපසමානුස්සතියි. සියලුදුක් සංසිදීම අරමුණුකොට ඇති සිහියට මේ නමකි. අච්චන්තූපසමය ඛයුපසමයයි සංසිඳීම දෙපරිදි හෝ වෙයි. එහි අච්චන්තඋපසමය (අත්‍යන්ත ව්‍යුපශමනය) නම් නිවනයි. ඛයූපසමය නම් මාර්‍ගයයි. මෙසේ මේ දෙයාකාරවූ සංසිඳීම සිහි කරන්නාට උපන් සිහිය උපසමානුස්සතියයි. මෙහි මේ අර්‍ත්‍ථයයි. මෙසේ මේ දශ කර්‍මස්ථානයන් අතුරෙන් ආනාපානසති මරණසති. කායගතාසති යන මේ තුන විදර්‍ශනාව සඳහා වෙයි. සෙසුසත සිත සතුටු කිරීම සඳහා වූයේ වෙයි."
                    },
                    {
                        "type": "centered",
                        "text": "පළමුවැනි වර්‍ගයයි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දෙවන වර්ගය",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "දෙවැන්නෙහි **මිච්ඡාදිට්ඨ** යනු දෙසැට ආකාරවූ මිථ්‍යාදෘෂ්ටියට මේ නමකි. **මිච්ඡාදිට්ඨකස්ස** යනු ඒ දෘෂ්ටියෙන් යුක්ත වූවහුටයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සම්මාදිට්ඨ** යනු පස් ආකාරවූ සම්‍යක්දාෂ්ටියට මේ නමකි. **සම්මාදිට්ඨකස්ස** යනු ඒ දෘෂ්ටියෙන් යුක්තවූවහුටයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අයොනිසො මනසිකාරො **යනු වැරදි අයුරින් සලකා බැලීමයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යොනිසොමනසිකාරො** යනු නිවැරදි අයුරින් මෙනෙහි කිරීමයි. එහි වැරදිලෙස මෙනෙහි කරන්නාට පෙර නූපන් මිත්‍ථ්‍යාදෘෂටිය උපදියි. උපන් මිථ්‍යාදෘෂ්ටිය පිළිවෙළට බැස ගැන්ම තෙක් වැඩෙයි. පිළිවෙළට බැස ගත් විට වැඩුනේ නම් වෙයි. [missing trans]"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 571,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**මිච්ඡාදිට්ඨියා, භික්ඛවෙ, සමන්නාගතා සත්තා**ති එත්ථ එකච්චා මිච්ඡාදිට්ඨි සග්ගාවරණා චෙව හොති මග්ගාවරණා ච, එකච්චා මග්ගාවරණාව, න සග්ගාවරණා, එකච්චා නෙව සග්ගාවරණා න මග්ගාවරණා. තත්ථ අහෙතුකදිට්ඨි, අකිරියදිට්ඨි, නත්ථිකදිට්ඨීති අයං තිවිධා සග්ගාවරණා චෙව හොති මග්ගාවරණා ච. දසවත්ථුකා අන්තග්ගාහිකා මිච්ඡාදිට්ඨි මග්ගාවරණාව හොති න සග්ගාවරණා. වීසතිවත්ථුකා සක්කායදිට්ඨි නෙව සග්ගාවරණා න මග්ගාවරණා. ඉදං පන විධානං පටික්ඛිපිත්වා ඉමස්මිං සුත්තෙ “මිච්ඡාදිට්ඨියා, භික්ඛවෙ, සමන්නාගතා”ති වචනතො අන්තමසො වීසතිවත්ථුකං සක්කායදිට්ඨිං උපාදාය දිට්ඨි නාම සග්ගං උපනෙතුං සමත්ථා නාම නත්ථි, එකන්තං නිරයස්මිංයෙව නිමුජ්ජාපෙතීති වුත්තං. යථා හි මුග්ගමාසප්පමාණාපි පාසාණසක්ඛරා උදකෙ පක්ඛිත්තා උප්පිලවමානා නාම නත්ථි, එකන්තං හෙට්ඨාව පවිසති, එවමෙවං අන්තමසො සක්කායදිට්ඨිපි සග්ගං උපනෙතුං සමත්ථා නාම නත්ථි, එකන්තං අපායෙසුයෙව නිමුජ්ජාපෙතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සම්මාදිට්ඨියා සමන්නාගතා**ති එත්ථ කම්මස්සකතසම්මාදිට්ඨි, ඣානසම්මාදිට්ඨි, විපස්සනාසම්මාදිට්ඨි, මග්ගසම්මාදිට්ඨි, ඵලසම්මාදිට්ඨීති පඤ්චවිධා සම්මාදිට්ඨි. තත්ථ කම්මස්සකතසම්මාදිට්ඨි සම්පත්තිභවං ආකඩ්ඪති, ඣානසම්මාදිට්ඨි රූපාරූපභවෙ පටිසන්ධිං දෙති, මග්ගසම්මාදිට්ඨි වට්ටං විද්ධංසෙති, ඵලසම්මාදිට්ඨි භවං පටිබාහති. විපස්සනාසම්මාදිට්ඨි කිං කරොතීති? සාපි පටිසන්ධිං නාකඩ්ඪති. තිපිටකචූළාභයත්ථෙරො පනාහ “සචෙ විපස්සනාසම්මාදිට්ඨි භාවිතා දිට්ඨෙව ධම්මෙ අරහත්තං පාපෙතුං සක්කොති, ඉච්චෙතං කුසලං. සචෙ න සක්කොති, සත්ත භවෙ දෙති, ආවුසො”ති. එවමයං ලොකියලොකුත්තරා සම්මාදිට්ඨි කථිතා. ඉමස්මිං පනත්ථෙ ලොකිකා භවනිප්ඵාදිකාව වෙදිතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යඤ්චෙව කායකම්මං යථාදිට්ඨි සමත්තං සමාදින්න**න්ති එත්ථ **යථාදිට්ඨී**ති යා යා දිට්ඨි, තස්සා තස්සා අනුරූපං. **සමත්ත**න්ති පරිපුණ්ණං. **සමාදින්න**න්ති ගහිතං. තදෙතං යථාදිට්ඨියං ඨිතකායකම්මං, දිට්ඨිසහජාතං කායකම්මං, දිට්ඨානුලොමිකං කායකම්මන්ති තිවිධං හොති. තත්ථ “පාණං හනතො අදින්නං ආදියතො මිච්ඡාචාරං චරතො නත්ථි තතොනිදානං පාපං, නත්ථි පාපස්ස ආගමො”ති යං එවංලද්ධිකස්ස සතො පාණාතිපාත-අදින්නාදාන-මිච්ඡාචාරසඞ්ඛාතං කායකම්මං, ඉදං **යථාදිට්ඨියං ඨිතකායකම්මං** නාම. “පාණං හනතො අදින්නං ආදියතො මිච්ඡාචාරං චරතො නත්ථි තතොනිදානං පාපං, නත්ථි පාපස්ස ආගමො”ති ඉමාය පන ලද්ධියා ඉමිනා දස්සනෙන සහජාතං කායකම්මං **දිට්ඨිසහජාතං කායකම්මං** නාම. තදෙව පන සමත්තං සමාදින්නං ගහිතං පරාමට්ඨං **දිට්ඨානුලොමිකං කායකම්මං** නාම. වචීකම්මාදීසුපි එසෙව නයො. යථා පනෙත්ථ “පාණං හනතො අදින්නං ආදියතො මිච්ඡාචාරං චරතො නත්ථි තතොනිදානං පාප”න්ති යොජනා කතා, එවං වචීකම්මමනොකම්මෙසු “මුසා භණතො, පිසුණං කථෙන්තස්ස, ඵරුසං කථෙන්තස්ස, සම්ඵං පලපන්තස්ස, අභිජ්ඣාලුනො, බ්යාපන්නචිත්තස්ස, මිච්ඡාදිට්ඨිකස්ස ච සතො නත්ථි තතොනිදානං පාප”න්ති යොජනා කාතබ්බා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**මිච්ඡාදිට්ඨියා භික්‍ඛවෙ සමන්නාගතා සත්තා** යනු මෙහි ඇතැමි මිත්‍යාදෘෂ්ටියක් ස්වර්‍ගය වළහන්නේද මාර්‍ගය වළහන්නේද වෙයි. ඇතැම් දෘෂ්ටියක් මාර්‍ගය වළහන්නේම ස්වර්‍ගය වළහන්නේ නොවෙයි. ඇතැම් මිථ්‍යාදෘෂ්ටියක් ස්වර්‍ගය නොවළහන්නේ ද මාර්‍ගය නොවළහන්නේද වෙයි. එයි අහෙතුක දෘෂ්ටිය, අකිරිය දෘෂ්ටිය, නාස්තිකදෘෂ්ටිය, යන මේ තුන් ආකාර දෘෂ්ටිය ස්වර්‍ගය වළහන්නේද මාර්‍ගය වළහන්නේද වෙයි. දශවස්තුක වූ අන්තග්‍රාහී මිත්‍ථ්‍යා දෘෂ්ටිය මාර්‍ගය වළහන්නේම වෙයි. ස්වර්‍ගය නොවළහන්නේද මාර්‍ගය නොවළහන්නේද වෙයි. මේ නියමය ප්‍රතික්‍ෂෙප කොට මේ සූත්‍රයෙහි මිච්ඡාදිට්ඨියා භික්‍ඛවෙ සමන්නාගතා’ යන වචනයෙන් යටත්පිරිසෙයින් විංශතිවස්තුක මිත්‍ථ්‍යාදෘෂටියගෙන ස්වර්‍ගය එළවීමට සමත් මිත්‍ථ්‍යාදෘෂ්ටියක් නම් නැත. ඒකාන්තයෙන් නිරයෙහිම ගිල්වන්නේයයි කියනලදී. යම්සේ වනාහි දියෙහි හෙලන ලද මුං මෑ ප්‍රමාණවූද ගල් කැබැලිත්ත පාවන්නේ නම් නොවේ. ඒකාන්තයෙන් යටටම පිවිසෙයි. මෙසේම යටත් පිරිසෙයින් සත්කාය දෘෂ්ටියද ස්වර්‍ගයට එළඹවීමට සමත් වන්නේ නම් නැත. ඒකාන්තයෙන් අපායයන්හිම ගිල්වන්නේයයි කියනලදී."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සම්මාදිටඨියා සමන්නාගතා** යනු මෙහි කම්මාසස්කත සම්මාදිට්ඨි, ක්‍ධානසම්මාදිට්ඨි, විපස්සනා සම්මාදිට්ඨි, මග්ගසම්මාදිට්ඨි, ඵලසම්මාදිට්ඨි, ක්‍ධානසම්මාදිට්ඨි, විපස්සනා සම්මාදිට්ඨි, මග්ගසම්මාදිට්ඨි, ඵලසම්මාදිට්ඨි යනුවෙන් සම්‍යක්දෘෂ්ටිය පස්ආකාරය. එහි කම්මස්සකත සම්මාදිට්ඨිය සම්පත්ති භවය අදියි (කැඳවයි.) ක්‍ධානසම්මාදිට්ඨිය රූපාරූප භවයන්හි ප්‍රතිසන්‍ධිය දෙයි. මග්ගසම්මාදිට්ඨිය සංසාරවෘතය විනාශකරයි. ඵලසම්මාදිට්ඨිය භවය මැඬලයි. විපස්සනා සම්මාදිට්ඨිය කුමක් කෙරේද? එයද ප්‍රතිසන්‍ධිය නොඅදියි. ත්‍රපිටක චූලාභය තෙරුන්වහන්සේ ‘ඇවැත්නි, ඉදින් විපස්සනා සම්මාදිට්ටිය වඩනා ලද්දේ ඉහාත්මයෙහිම රහත්බවට පැමිණවීමට හැකිය යන මෙය මැනවි. ඉදින් නොහැකි වුවහොත් භවසතෙක්හි දෙතැ’යි කීහ. මෙසේ මේ ලෞකික ලෝකෝත්තර සම්‍යක්දෘෂ්ටිය කියනලදී. මෙහි වනාහි ලෞකිකවූ භවය ඇති කරන සම්‍යක් දෘෂ්ටියම දත යුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යං චෙව කායකම්මං යථාදිට්ඨ සමතතං සමාදින්නං** යන මෙහි **යථාදිට්ඨ** යනු යම් මේ දෘෂ්ටියක් වේද ඊට අනුරූපවයි. **සමත්තං** යනු සම්පූර්ණවූයි. **සමාදින්නං** යනු ගන්නාලද යනුයි. ඒ මෙය දෘෂ්ටියට අනුරූපව සිටි කායකර්‍මයය. දෘෂ්ටිය සමඟ උපන් කාකර්‍මයය, දෘෂ්ටියට අනුලොම්වූ කාය කර්‍මයයයි ත්‍රිවිධ වෙයි. එහි පරපණ නසන, නොදුන් දෙය ගන්නා, මිත්‍ථ්‍යාචාරයෙහි යෙදෙන ‘එය හේතුකොටගෙන පාපයක් නැත. පාපයක පැමිණීමක් නැතැයි මෙබදු ලබ්ධි ඇත්තහුගේ ප්‍රාණාතිපාත අදින්නාදාන මිත්‍ථ්‍යාචාර සංඛ්‍යාතවූ යම් කායකර්‍මයක් වේද එය දෘෂ්ටියට අනුරූපව සිටි කායකර්‍මය නමි. පරපණ නසන, නොදුන්දෙය ගන්නා, මිථ්‍යාචාරයෙහි යෙදෙන තැනැත්තාගේ මේ හේතුකොටගෙන පවක් නැත. පවේ පැමිණිමක් නැතැයි යන මේ දෘෂ්ටිය මේ දැක්ම සමඟ හටගත් කාය කර්‍මය දිට්ඨිසහජාත කාය කර්‍මය නමි. එයින් පිරුණු, සමාදන්වූ, ගන්නාලද සිතෙහි මුල්බැසගත් යමක්වේද එය දිට්ඨානුලෝමිකකායකර්‍මය නමි. වාක් කර්‍මාදියෙහිද මේ ක්‍රමයමැයි. යම් සේ වනාහි මෙහි පරපණ නසන, නොදුන් දෙය ගන්නා මිත්‍ථ්‍යාචාරයෙහි යෙදෙන්නහුට එය හේතුකොටගෙන පාපයක් නැත යන යෝජනාව කරනලද්දේද එසේ වාක්කර්‍මමනොකර්‍මයන්හි බොරුකියන, කේලාම් කියන රළු වචන කියන හිස්වචන දොඩන දැඩිලෝභය ඇති කෝපවූ සිත් ඇති මිත්‍ථ්‍යාදෘෂ්ටිකයාටද එය හේතුකොටගෙන පවක් නැත යන යෝජනාව කළ යුතුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 573,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**යා ච චෙතනා**තිආදීසු දිට්ඨිසහජාතාව චෙතනා **චෙතනා** නාම, දිට්ඨිසහජාතාව පත්ථනා **පත්ථනා** නාම, චෙතනාපත්ථනානං වසෙන චිත්තට්ඨපනා **පණිධි** නාම, තෙහි පන චෙතනාදීහි සම්පයුත්තා ඵස්සාදයො **සඞ්ඛාරා** නාම. **දිට්ඨි හිස්ස, භික්ඛවෙ, පාපිකා**ති යස්මා තස්ස පුග්ගලස්ස දිට්ඨි පාපිකා ලාමිකා. **නික්ඛිත්ත**න්ති රොපිතං. **උපාදියතී**ති ගණ්හාති. **කටුකත්තායා**ති ඉදං පුරිමස්සෙව වෙවචනං."
                    },
                    {
                        "type": "gatha",
                        "text": "“වණ්ණගන්ධරසූපෙතො, අම්බොයං අහුවා පුරෙ;\nතමෙව පූජං ලභමානො, කෙනම්බො කටුකප්ඵලො.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "“පුචිමන්දපරිවාරො, අම්බො තෙ දධිවාහන;\nමූලං මූලෙන සංසට්ඨං, සාඛා සාඛා නිසෙවරෙ;\nඅසාතසන්නිවාසෙන, තෙනම්බො කටුකප්ඵලො”ති. (ජා· 1.2.71-72) –",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "ආගතට්ඨානෙ විය හි ඉධාපි කටුකන්ති තිත්තකං වෙදිතබ්බං. **අසාතත්තායා**ති අමධුරත්තාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමස්මි පන බීජූපමසුත්තෙ “දිට්ඨීති නියතමිච්ඡාදිට්ඨි ගහිතා”ති පොරාණකත්ථෙරා ආහංසු. තං පන පටික්ඛිපිත්වා “සබ්බානිපි ද්වාසට්ඨි දිට්ඨිගතානි ගහිතානී”ති වුත්තං. අනන්තරසුත්තෙ “පාණාතිපාතා විරමන්තස්ස, අදින්නාදානා විරමන්තස්ස, මිච්ඡාචාරා විරමන්තස්ස නත්ථි තතොනිදානං පුඤ්ඤ”න්තිආදිනා නයෙන යථාදිට්ඨියං ඨිතකායකම්මාදීනි යොජෙත්වා වෙදිතබ්බානි. ඉධ පන සම්මාදිට්ඨිසහජාතා චිත්තට්ඨපනාව පත්ථනාති වෙදිතබ්බා. සම්මාදිට්ඨි පනෙත්ථ ලොකියලොකුත්තරා කථිතා. සෙසං සබ්බත්ථ උත්තානත්ථමෙවාති."
                    },
                    {
                        "type": "centered",
                        "text": "දුතියවග්ගවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තතියොවග්ගො.",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "තතියස්ස පඨමෙ **මිච්ඡාදිට්ඨිකො**ති අයාථාවදිට්ඨිකො. **විපරීතදස්සනො**ති තායෙව මිච්ඡාදිට්ඨියා විපරීතදස්සනො. **සද්ධම්මා වුට්ඨාපෙත්වා**ති දසකුසලකම්මපථධම්මතො වුට්ඨාපෙත්වා. **අසද්ධම්මෙ පතිට්ඨාපෙතී**ති දසඅකුසලකම්මපථසඞ්ඛාතෙ අසද්ධම්මෙ පතිට්ඨාපෙති. **එකපුග්ගලො**ති චෙත්ථ ඡහි සත්ථාරෙහි සද්ධිං දෙවදත්තො ච අඤ්ඤෙ ච එවරූපා වෙදිතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "දුතියෙ **සම්මාදිට්ඨිකො**ති යාථාවදිට්ඨිකො. **අවිපරීතදස්සනො**ති තායෙව සම්මාදිට්ඨියා අවිපරීතදස්සනො. **අසද්ධම්මා**ති දසඅකුසලකම්මපථතො. **සද්ධම්මෙ**ති දසකුසලකම්මපථසඞ්ඛාතෙ සද්ධම්මෙ. **එකපුග්ගලො**ති චෙත්ථ අනුප්පන්නෙ බුද්ධෙ චක්කවත්තී රාජා සබ්බඤ්ඤුබොධිසත්තොති එවමාදයො ලබ්භන්ති, උප්පන්නෙ බුද්ධෙ බුද්ධො චෙව බුද්ධසාවකා ච."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**යාච චෙතනා** ආදියෙහි දෘෂ්ටිය සමඟ එකට උපන් චෙතනාවම චෙතනා නමි. දෘෂ්ටිය සමඟ එක්ව උපන් ප්‍රර්‍ත්‍ථනාවම නාවම පත්‍ථනා නමි. චේතනා ප්‍රර්‍ත්‍ථනා වශයෙන් සිත පිහිටුවීම පණිධි නමි. මේ චේතනාදීන් සමඟ යුක්තවූ ස්පර්‍ශාදිය සංඛාර නමි**. දිට්ඨිහි භික්‍ඛවෙ පාපිකා** යනු යම්හෙයකින් ඒ පුද්ගලයාගේ දෘෂ්ටිය පවිටු ලාමක වේද යනුයි. **නික්‍ඛිතතං** යනු රොපණය කරනලද්දේයි. **උපාදියති **යනු ගනියි. **කටුකත්තාය** යන මෙය මුලින් කියනලද්දේටම පර්‍ය්‍යාය වචනයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "පෙර මේ අඹ පැහැයෙන් සුවඳින් හා රසින් යුක්තවිය. ඒ පූජාවම ලබමින් කෙසේ නම් අඹ අමිහිරි පලවූයේද?"
                    },
                    {
                        "type": "paragraph",
                        "text": "දධිවාහනය, ඔබේ අඹගස කොසඹ ගස් පිරිවර කොට ඇත්තේය. මුලෙන් මුල එකට ගැටී අතැ. අතු අතු සමඟ එක්ව ඇත්තේය. ඒ අමිහිරි දෙය සමඟ එක්වීමෙන් අඹගස අමිහිරි පල ඇත්තේයි{1}"
                    },
                    {
                        "type": "unindented",
                        "text": "යනුවෙන් ආ තැන්හි මෙන් මෙහිද **කටුකං** යනු තිත්තරස ඇත්තේයි දතයුතුය. **අසාතත්තාය **යනු අමිහිරිබවටය."
                    },
                    {
                        "type": "paragraph",
                        "text": "මේ බීජෝපම සූත්‍රයෙහි දිට්ඨියනු නියත මිත්‍ථ්‍යාදෘෂ්ටිය ගන්නාලදැයි පොරාණක ස්ථවිරවරු කීහ. එය ප්‍රතික්‍ෂෙප කොට සියලු දෙසැටක් දෘෂ්ටිගතයන් ගන්නාලදැයි කියනලදී. අනතුරු සූත්‍රයෙහි පරපණ නැසීමෙන් වෙන්වූ ‘නුදුන්දෙය ගැනීමෙන් වෙන්වූ’ මිත්‍ථ්‍යාචාරයෙන් වෙන්වූ පුද්ගලයාට එය හේතකොටගෙන පිණක් නැතැයි ආදී ක්‍රමයෙන් දෘෂ්ටියට අනුරූපව සිටි කායකර්‍මාදීන් යොදා දතයුතුයි. මෙහි වනාහි සම්‍යක් දෘෂ්ටිය සමඟ උපන් සිත පිහිටුවීමට ප්‍රර්‍ත්‍ථනාවයයි දතයුතුය. මෙහි ලෞකික ලෝකෝත්තරවූ සම්‍යක්දෘෂ්ටියම කියනලදී. සෙස්ස සියලු තන්හි පැහැදිලි අරුත් ඇත්තේමය."
                    },
                    {
                        "type": "centered",
                        "text": "දෙවන වර්‍ගයයි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තෙවන වර්ගය",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙවැනි වර්‍ගයෙහි පළමුසූත්‍රයෙහි **මිච්ඡාදිට්ඨිකො** යනු වැරදි දෘෂ්ටි ඇත්තේයි**. විපරීතදස්සනො** යනු ඒ මිත්‍ථාදෘෂ්ටියෙන්ම විපරීතවූ දැකීම් ඇත්තෙයි. **සද්ධම්මා උට්ඨාපෙත්‍වා** යනු දශකුශලකර්‍මපථධර්‍මයන්ගෙන් නඟාසිටුවායි. **අසද්ධම්මෙ පතිට්ඨාපෙති** යනු දශඅකුසල කර්‍මපථ සංඛ්‍යාතවූ අසද්ධර්‍මයෙහි පිහිටවන්නේයි. **එකපුග්ගලො** යන්නෙහි ෂට්ශාස්තෘන් සමඟ දෙව්දත් මෙන්ම එබඳු අන්‍යයෝද දතයුත්තාහ."
                    },
                    {
                        "type": "paragraph",
                        "text": "දෙවැන්නෙහි **සම්මාදිට්ඨිකො** යනු මනා දෘෂ්ටි ඇත්තේයි. **අවිපරිතදස්සනො** යනු ඒ සම්‍යක් දෘෂ්ටියෙන්ම නොවිකලවූ දැකීම් ඇත්තේයි. **අසද්ධම්මා** යනු දශඅකුශල කර්‍මපථයන්ගෙනුයි. **සද්ධම්මෙ** යනු දශකුශල කර්‍මපථ සංඛ්‍යාතවූ සද්ධර්‍මයෙහියි. **එකපුග්ගලො** යනු මෙහි බුදුන් නූපන් කල්හි සක්විති රජ, සර්‍වඥ බෝධිසත්‍ව තෙමේ මේ ආදීහු ලබත්, බුදුන් උපන්කල්හි බුදුරජාණන්වහන්සේද ශ්‍රාවකයෝද වෙත්."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. “වණ්ණගන්‍ධරසූපෙතො - අම්බායං අහුවා පුරෙ තමෙව පූජං ලභමානො - කෙනම්බො කටුකප්ඵලො පුචිමන්‍දපරිවාරො අම්බො තෙ දධිවාහන මූලං මූලෙන සංසට්ඨං සාඛා සාඛා නිසෙවරෙ අසාතසන්නිවාසෙන තේනම්බො කටුකප්ඵලො”"
                    }
                ]
            }
        },
        {
            "pageNum": 575,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තතියෙ **මිච්ඡාදිට්ඨිපරමානී**ති මිච්ඡාදිට්ඨි පරමා එතෙසන්ති මිච්ඡාදිට්ඨිපරමානි. පඤ්ච හි ආනන්තරියකම්මානි මහාසාවජ්ජානි නාම, තෙහිපි මිච්ඡාදිට්ඨියෙව මහාසාවජ්ජතරාති අධිප්පායො. කස්මා? තෙසඤ්හි පරිච්ඡෙදො අත්ථි. චත්තාරි හි ආනන්තරියකම්මානි නිරයෙ නිබ්බත්තාපෙන්තීති වුත්තානි. සඞ්ඝභෙදකම්මම්පි නිරයෙ කප්පට්ඨිතිකමෙව හොති. එවමෙතෙසං පරිච්ඡෙදො අත්ථි, කොටි පඤ්ඤායති. නියතමිච්ඡාදිට්ඨියා පන පරිච්ඡෙදො නත්ථි. සා හි වට්ටස්ස මූලං, තාය සමන්නාගතස්ස භවතො වුට්ඨානං නත්ථි. යෙ තස්ස සොතබ්බං මඤ්ඤන්ති, තෙපි විප්පටිපාදෙති. තාය ච සමන්නාගතස්ස නෙව සග්ගො අත්ථි න මග්ගො. කප්පවිනාසෙ මහාජනෙ බ්රහ්මලොකෙ නිබ්බත්තෙපි නියතමිච්ඡාදිට්ඨිකො තත්ථ අනිබ්බත්තිත්වා පිට්ඨිචක්කවාළෙ නිබ්බත්තති. කිං පන පිට්ඨිචක්කවාළං න ඣායතීති? ඣායති, තස්මිං ඣායමානෙපි එස ආකාසෙ එකස්මිං ඔකාසෙ පච්චතියෙවාති වදන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුත්ථෙ **මක්ඛලී**ති “මා ඛලී”ති වචනං උපාදාය එවංලද්ධනාමො තිත්ථකරො. **නදීමුඛෙ**ති ද්වින්නං නදීනං සමාගතට්ඨානෙ. දෙසනාමත්තමෙවෙතං, ද්වින්නං කන්දරානං, ද්වින්නං උදකානං, සමුද්දස්ස ච, ලොණියා ච, සමුද්දස්ස ච නදියා චාති එතෙසම්පි යස්ස කස්සචි සමාගතට්ඨානං, අඤ්ඤම්පි තථාරූපං උදකං. **ඛිප**න්ති කුමිනං. **උඩ්ඩෙය්යා**ති ඔඩ්ඩෙය්ය. මනුස්සා හි නළෙහි වා උච්ඡූහි වා වෙළූහි වා පලාසන්තිසලාකාය වා එකං ද්වෙ තයො වා කුම්භෙ ගණ්හනප්පමාණකුමිනං කත්වා මුඛවට්ටියා යොත්තෙන බන්ධිත්වා නදීමුඛං නෙත්වා ද්වීසු පස්සෙසු ඛාණුකෙ කොට්ටෙත්වා යොත්තෙහි තත්ථ බන්ධන්ති, තං සන්ධායෙතං වුත්තං. තස්මිඤ්හි පවිට්ඨස්ස ඛුද්දකස්ස මච්ඡස්සාපි මොක්ඛො නත්ථි. **අනයායා**ති අවඩ්ඪියා. **බ්යාසනායා**ති විනාසාය. **මක්ඛලි මොඝපුරිසො**ති අයං මක්ඛලි ගොසාලො තුච්ඡපුරිසො. **මනුස්සඛිප්පං මඤ්ඤෙ ලොකෙ උප්පන්නො**ති මහාජනස්ස සග්ගමොක්ඛගමනමග්ගෙ තත්ථ ගමනනිවාරණත්ථං මනුස්සකුමිනං විය ලොකෙ උප්පන්නො."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චමාදීසු **දුරක්ඛාතෙ, භික්ඛවෙ, ධම්මවිනයෙ**ති දුරක්ඛාතධම්මවිනයො නාම බාහිරකසාසනං. තත්ථ හි සත්ථාපි අසබ්බඤ්ඤූ හොති, ධම්මොපි දුරක්ඛාතො, ගණොපි දුප්පටිපන්නො. **යො ච සමාදපෙතී**ති යො ආචරියපුග්ගලො සමාදපෙති. **යඤ්ච සමාදපෙතී**ති යං අන්තෙවාසිකං සමාදපෙති. **යො ච සමාදපිතො තථත්තාය පටිපජ්ජතී**ති යො අන්තෙවාසිකො ආචරියෙන සමාදපිතො තස්ස වචනං කරොන්තො තථාභාවාය පටිපජ්ජති. **බහුං අපුඤ්ඤං පසවන්තී**ති සමාදපකො හි පාණාතිපාතාදීසු ජඞ්ඝසතං සමාදපෙන්තො තෙසං සබ්බෙසම්පි අකුසලෙන සමකමෙව අකුසලං පාපුණාති. තෙනාහ – “සබ්බෙ තෙ බහුං අපුඤ්ඤං පසවන්තී”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තෙවැන්නෙහි **මිච්ඡාදිට්ඨිපරමානි** යනු මිත්‍ථ්‍යා දෘෂ්ටිය මොවුන්ට පරමකොට ඇත්තේනුයි මිචඡාදිට්ට පරමානි නම් වේ. ආනන්තර්ය කර්‍මපස මහා සාවද්‍ය නම් වෙයි. ඔවුනතුරෙනුදු මිච්ඡාදිට්ටියම අතිශයින් සාවදයය යන අදහසයි. කුමක් හෙයින්ද යත් ඔවුනට සීමාවක් ඇත. ආනන්තර්ය කර්‍ම සතර නිරයෙහි උපදවතැයි කියන ලදී. සංඝභේද කර්‍මයද නිරයෙහි කල්පයක් සිටින්නේම වෙයි. මෙසේ ඔවුනට සීමාවක් ඇත. කෙළවරක් පෙනෙයි. නියත මිත්‍ථ්‍යාදෘෂ්ටියට පරිච්ඡේයක් නැත. එය සංසාරවෘත්තයේ මුලය. එයින් යුක්තවූවහුට භවයෙන් නැඟීසිටීමක් නැත. යමෙක් ඔහුට කන්දිය යුතුයයි හඟිත්ද වැරදි මගට යොමුකරවයි. එයින්ද යුක්තවූවහුට ස්වර්‍ගයද නැත. මාර්‍ගයද නැත. කල්ප විනාශයෙහිදී මහජනයා බඹලොව උපන්කල්හි නියත මිත්‍ථ්‍යාදෘෂ්ටිකයා එහි නොඉපිද පිටිසක්වළ උපදියි. කිම පිටිසක්වළ නොදැවෙයිද? දැවෙයි. එය දැවෙන කල්හිද මෙතෙම අහසෙහි එක් අවකාශයක පැසේමයයි කියත්."
                    },
                    {
                        "type": "paragraph",
                        "text": "සිවුවැන්නෙහි **මක්‍ඛලී** යනු මා ඛලී යන වචනය ඇසුරුකොට ලබන ලද නම් ඇති තීර්ථංකර තෙමේයි. **නදීමුඛෙ** යනු නදීන් දෙකක් එකතුවන තැනයි. මෙය දේශනාමාත්‍රයක්මය. කදුරැලි දෙකක දෙදියකද එක්වන තැනයි. මුහුදේ කලපුවේද මුහුදේ නදියකදැයි යන මේවායේද යම් කිසිවක එක්වූ තැනකි. වෙනත් එබඳුවූද දියය. **ඛිපං **යනු කෙමිනයි. **ඔඩ්ඩෙය්‍ය** අටවන්නේයි. මිනිස්සු බටවලින් හෝ උක්වලින් හෝ උණවලින් හෝ පෙඟූ ඉරටුවලින් හෝ කළ එකක් දෙකක් හෝ තුනක් කළ ගන්වන (තැබිය හැකි) පමණවූ කෙමියක් කොට මුවවිට යොතින් බැඳ ගං මුව දොරට ගෙන ගොස් දෙපසෙහි කණුවක කොටා යොත්වලින් එහි බඳිත්, එය සඳහා මෙය කියනලදී. එහි පිවිසි කුඩමස්සාටද ගැලවීමක් නැත. අනයාය යනු අවැඩටයි. **ව්‍යසනාය** යනු විනාශයටයි. **මක්‍ඛලී මොඝපුරිසො** යනු මේ මක්‍ඛලිගොසාල නම්වූ හිස්මිනිසායි. **මනුස්සබිපං මඤ්ඤෙ ලොකෙ උප්පන්නො** යනු මහජනයාගේ ස්වර්‍ගමොක්‍ෂ ගමන් මාර්‍ගයෙහි එහි යාම වැළැක්වීම සඳහාවූ මිනිස් කෙමිනක්මෙන් ලොව උපන්නෙකියි."
                    },
                    {
                        "type": "paragraph",
                        "text": "පස්‍වැන්න ආදියෙහිද **දුරුක්‍ඛාතෙ භික්‍ඛවෙ ධම්මවිනයෙ** යනු නරකට කියනලද ධර්‍මවිනය නම් (බුදුසසුනෙන්) බාහිරවූ ශාසනයයි. එහි ශාස්තෘවරයාද අසර්‍වඥ වෙයි. ධර්‍මයද නරකට දෙසනලද්දේය. පිරිසද වැරදියට පිළිපන්නේය. **යො ච සමාදපෙති** යනු යම් ආචාර්‍ය්‍යවූ පුද්ගලයෙක් පිළිගන්වයිද යනුයි. **යංච සමාදපෙති** යනු අතවැස්සන්ට යමක් පිළිගන්වයිද යනුයි. **යොච සමාදපිතො තථත්තාය පටිපජ්ජති** යනු යම් අතවැස්සෙක් ආචාර්‍ය්‍යයන් විසින් පිළිගන්වනලද්දේ ඔහුගේ වචනය (ඉටු) කරන්නේ එ(එබඳු) බවට පිළිපදියි. **බහුං අපුඤ්ඤං පසවන්ති** යනු පිළිගන්වන්නාද පරපණ නැසීම් ආදියෙහි පාදසියයක් පිළිගන්වනනේ ඒ සියල්ලන්ටම අකුශලයෙන් සමානවූම අකුශලයක් පමුණුවයි. එහෙයින් ඒ සියල්ලෝ බොහෝ පව් උපදවතියි කියනලදී."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 577,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**ස්වාක්ඛාතෙ**ති සුට්ඨු අක්ඛාතෙ සුදෙසිතෙ. එවරූපෙ හි ධම්මවිනයෙ සත්ථා ච සබ්බඤ්ඤූ හොති, ධම්මො ච ස්වාක්ඛාතො, ගණො ච සුප්පටිපන්නො. **සබ්බෙ තෙ බහුං පුඤ්ඤං පසවන්තී**ති සමාදපකො හි භික්ඛූ පිණ්ඩාය පවිට්ඨෙ දිස්වා යාගුභත්තාදීනි සමාදපෙන්තො සබ්බෙසම්පි දායකානං කුසලෙන සමකං කුසලං පාපුණාති. තෙන වුත්තං – “බහුං පුඤ්ඤං පසවන්තී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**දායකෙන මත්තා ජානිතබ්බා**ති දායකපුග්ගලෙන පමාණං ජානිතබ්බං, පමාණෙන දාතබ්බං, පූරෙත්වා අතිරෙකං න දාතබ්බං. න දාතබ්බන්ති හි අවත්වා පමාණවසෙන ථොකං දාතබ්බන්ති වුත්තං. කස්මා? පූරෙත්වා අතිරෙකෙ දින්නෙපි හි අතිරෙකා මනුස්සසම්පත්ති වා දිබ්බසම්පත්ති වා නිබ්බානසම්පත්ති වා නත්ථි. **නො පටිග්ගාහකෙනා**ති පටිග්ගාහකස්ස පන මත්තං ජානිත්වා පටිග්ගහණකිච්චං නාම නත්ථි. කස්මා? තස්ස හි මත්තං ඤත්වා පූරෙතබ්බා මත්තපටිග්ගහණමූලිකා අප්පිච්ඡපටිපදා නාම නත්ථි. යත්තකං පන ලභති, තත්තකං ගහෙතබ්බං. අතිරෙකග්ගහණමූලං හිස්ස පුත්තදාරභරණං භවිස්සති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පටිග්ගාහකෙන මත්තා ජානිතබ්බා**ති පටිග්ගාහකපුග්ගලෙන පමාණං ජානිතබ්බං. කථං? තෙන හි දායකස්ස වසො වෙදිතබ්බො, දෙය්යධම්මස්ස වසො වෙදිතබ්බො, අත්තනො ථාමො වෙදිතබ්බො. යදි හි දෙය්යධම්මො බහු හොති, දායකො අප්පං දාතුකාමො, දායකස්ස වසෙන අප්පං ගණ්හිතබ්බං. දෙය්යධම්මො අප්පො, දායකො බහුං දාතුකාමො, දෙය්යධම්මස්ස වසෙන අප්පං ගණ්හිතබ්බං. දෙය්යධම්මොපි බහු, දායකොපි බහුං දාතුකාමො, අත්තනො ථාමං ඤත්වා පමාණෙනෙව ගණ්හිතබ්බං. එවං මත්තං ඤත්වා පටිග්ගණ්හන්තො හි අප්පිච්ඡපටිපදං පූරෙති. අනුප්පන්නස්ස ලාභො උප්පජ්ජති, උප්පන්නො ලාභො ථාවරොව හොති. අප්පසන්නා පසීදන්ති, පසන්නාපි භිය්යො පසාදමාපජ්ජන්ති, මහාජනස්ස චක්ඛුභූතො හොති, සාසනං චිරට්ඨිතිකං කරොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්රිමානි වත්ථූනි – රොහණජනපදෙ කිර කුටිම්බියවිහාරෙ එකො දහරො දුබ්භික්ඛසමයෙ තස්මිං ගාමෙ එකස්ස කම්මකාරස්ස ගෙහෙ භුඤ්ජනත්ථාය කටච්ඡුභත්තං ගහෙත්වා ගමනත්ථාය ච කටච්ඡුභත්තමෙව ලභති. සො එකදිවසං තස්මිං ගෙහෙ එකං ආගන්තුකං දිස්වා එකමෙව කටච්ඡුභත්තං ගණ්හි. අථස්ස “කෙන කාරණෙනා”ති වුත්තෙ තමත්ථං වත්වා සො කුලපුත්තො පසීදිත්වා “අම්හාකං කුලූපකභදන්තො එවරූපො නාමා”ති රාජද්වාරෙ මිත්තාමච්චානං කථෙසි. තෙ සබ්බෙපි තස්ස අප්පිච්ඡගුණෙ පසන්නා එකදිවසෙනෙව සට්ඨි ධුරභත්තානි ඨපෙසුං. එවං **අප්පිච්ඡො අනුප්පන්නලාභං උප්පාදෙති**."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**ස්වාක්‍ඛා**තෙ යනු මනාව කියනලද මනාව දෙසන ලද්දෙහියි. එබඳුවූ ධර්‍මවිනයෙහි ශාස්තෘවරයාද සර්‍වඥවෙති. ධර්‍මයද මැනවින් දේශිතය, සංඝයාද මනාව පිළිපන්හ. **සබ්බෙ තෙ බහුං පුඤ්ඤං පසවන්ති **යනු සමාදන් කරවන්නාවූ භික්‍ෂුව පිඬු හැසිරෙනකල්හි දැක කැඳබත් ආදියෙන් සමාදන් කරවන්නේ සියලුම දායකයන්ට කුසලයෙන් සමානවූ කුශලයක් පමුණුවයි. එහෙයින් බොහෝ පින් උපදවතියි කියනලදී."
                    },
                    {
                        "type": "paragraph",
                        "text": "**දායකෙන ජානිතබ්බා** යනු දායක පුද්ගලයා විසින් ප්‍රමාණය දතයුතුය. පමණින් දිය යුතුය. පුරවා වැඩිපුර නොදිය යුතුය. නොදිය යුතුයයි නොකියා ප්‍රමාණ වශයෙන් ටික ටික දියයුතුයයි කියනලදී. පුරවා වැඩිපුර දුන් කල්හි වැඩිමිනිස් සැපතක් හෝ දෙව්සැපතක් හෝ නිවන් සැපතක් හෝ නැත. **නො පටිග්ගාහකෙන** යනු පිළිගන්නාගේ පමණ දැන පිළිගැනීමේ කිසක් නම් නැත. කුමක් හෙයින්ද යත්? ඔහුට වනාහි පමණ දැන පිරියයුතු පමණට පිළිගැනීම මුල්කොට ඇති අපිස් පටිපදාවක් නම් නැත. යම් පමණක් ලබයිද එපමණක් ගතයුතුය. ඔහුගේ අඹුදරුවන් රැකීම අතිරේකව ගැනීම මුල්කොට ඇත්තේ වෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පටිග්ගාහකෙන මත්තා ජාතිතබ්බා** යනු ප්‍රතිග්‍රාහක පුද්ගලයා විසින් පමණ දතයුතුය. කෙසේද යත්? ඔහු විසින් දායකයාගේ හැකියාව දතයුතුය. දෙය්‍යධර්‍මයාගේ (දානවස්තුවේ) හැකියාව දතයුතුය. තමන්ගේ ශක්තිප්‍රමාණය දතයුතුය. ඉදින් ද්‍යෙධර්‍මය බොහෝ වේද දායකයා ටිකක් දෙනු කැමැත්තේද දායකයාගේ වශයෙන් ටිකක් ගතයුතුය. දෙය්‍යධර්‍මය අල්පය, දායකයා බොහෝ දෙනු කැමැත්තේය, එවිට දෙය්‍යධර්‍මය වශයෙන් ටිකක් ගතයුතුය. දෙය්‍යධර්‍මයද බොහෝය, දායකයාද බොහෝ දෙනු කැමැත්තේය. එවිට තමන්ගේ ශක්තිප්‍රමාණය දැන පමණින්ම ගතයුතුය. මෙසේ පමණ දැන පිළිගන්නා වනාහි අල්පෙච්ඡප්‍රතිපදාව පුරයි. නූපන්නහුට ලාභය උපදියි. උපන් ලාභය තහවුරු වෙයි. නොපැහැදුනෝ පහදිත්, පැහැදුනෝද බොහෝ පැහැදීමට පැමිණෙත්, මහජනයාට ඇසක්වූයේ වෙයි. සසුන බොහෝකල් පවතින්නක් කරයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "එහිලා මේ කථාවස්තුහු වෙත්: රෝහණ ජනපදයෙහි කුටුම්බිය වෙහෙරෙහි එක් තරුණ භික්‍ෂුවක් දුර්භික්‍ෂ සමයෙක්හි එගම එක් ලමබකණ්ණ ගොත්‍රිකයෙකුගේ නිවසෙහි වැළදීම සඳහා හැඳිබතක් (හැන්දක් පමණ බත්) ගෙන ගමන සඳහා ද හැඳිබතක්ම ලබයි. හෙතෙම එක්දිනක ඒ නිවසෙහි එක් අමුත්තෙකු දැක එක් හැඳිබතක්ම ගත්තේය. ඉක්බිති එකරුණින් කුලපුත්‍රයා ඔහුට පැහැදී අපගේ ගෙදරට පැමිණෙන ස්වාමීන්වහන්සේ මෙවැන්නෙකැයි රජගෙදර මිත්‍ර ඇමතිවරුනට පැවසීය. ඒ සියල්ලෝ ඔහුගේ අපිස් ගුණයෙන් පැහැදුනාහු එක් දිනකින්ම නිතිබත් සැටක් පිහිටවූහ. මෙසේ අපිස් තැනැත්තේ නූපන් ලාභය උපදවයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 579,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සද්ධාතිස්සමහාරාජාපි චූළුපට්ඨාකං තිස්සාමච්චං වීමංසිත්වා තෙන එකං තිත්තිරං පචාපෙත්වා ආහරාපෙසි. අථ පරිභොගසමයෙ “අග්ගං දත්වා පරිභුඤ්ජිස්සාමී”ති අට්ඨකසාලපරිවෙණෙ මහාථෙරස්ස භණ්ඩග්ගාහසාමණෙරස්ස තිත්තිරමංසං දෙන්තො තස්මිං ථොකංයෙව පටිග්ගණ්හන්තෙ තස්ස අප්පිච්ඡගුණෙ පසීදිත්වා “පසන්නොස්මි, තාත, අට්ඨ තෙ ධුරභත්තානි දෙමී”ති ආහ. මහාරාජ, උපජ්ඣායස්ස දෙමීති. අපරානිපි අට්ඨ දෙමීති. තානි අම්හාකං ආචරියස්ස දෙමීති. අපරානිපි අට්ඨ දම්මීති. තානි සමානුපජ්ඣායානං දම්මීති. අපරානිපි අට්ඨ දම්මීති. තානි භික්ඛුසඞ්ඝස්ස දම්මීති. අපරානිපි අට්ඨ දම්මීති. සාමණෙරො අධිවාසෙසි. එවමස්ස **උප්පන්නො ලාභො ථාවරො හොති.**"
                    },
                    {
                        "type": "paragraph",
                        "text": "**අප්පසන්නා පසීදන්තී**ති එත්ථපි – දීඝබ්රාහ්මණො කිර බ්රාහ්මණෙ භොජෙන්තො පඤ්ච පඤ්ච භත්තසරකානි දත්වා සන්තප්පෙතුං නාසක්ඛි. අථෙකදිවසං “සමණා කිර නාම අප්පිච්ඡා”ති කථං සුත්වා වීමංසනත්ථාය භත්තං ගාහාපෙත්වා භික්ඛුසඞ්ඝස්ස භත්තකිච්චකරණවෙලාය විහාරං ගන්ත්වා තිංසමත්තෙ භික්ඛූ භොජනසාලායං භුඤ්ජන්තෙ දිස්වා එකං භත්තසරකං ගහෙත්වා සඞ්ඝත්ථෙරස්ස සන්තිකං අගමාසි. ථෙරො අඞ්ගුලිං චාලෙත්වා ථොකමෙව අග්ගහෙසි. එතෙනෙව නියාමෙන එකං භත්තසරකං සබ්බෙසං සම්පාපුණි. තතො බ්රාහ්මණො “සච්චොයෙව එතෙසං සමණානං ගුණො”ති අප්පිච්ඡතාය පසන්නො සහස්සං විස්සජ්ජෙත්වා තස්මිංයෙව විහාරෙ චෙතියං කාරෙසි. එවං අප්පසන්නා පසීදන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පසන්නා භිය්යො පසීදන්තී**ති එත්ථ වත්ථුනා කිච්චං නත්ථි. පසන්නානඤ්හි අප්පිච්ඡං දිස්වා පසාදො භිය්යො වඩ්ඪතියෙව."
                    },
                    {
                        "type": "paragraph",
                        "text": "මජ්ඣන්තිකතිස්සත්ථෙරසදිසෙ පන අප්පිච්ඡෙ දිස්වා මහාජනො අප්පිච්ඡො භවිතුං මඤ්ඤතීති අප්පිච්ඡො **මහාජනස්ස චක්ඛුභූතො** නාම හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අප්පිච්ඡතා, භික්ඛවෙ, සද්ධම්මස්ස ඨිතියා අසම්මොසාය අනන්තරධානාය සංවත්තතී”ති (අ· නි· 1.116-129) වචනතො පන අප්පිච්ඡො **සාසනං චිරට්ඨිතිකං කරොති** නාම."
                    },
                    {
                        "type": "paragraph",
                        "text": "**නො දායකෙනා**ති ස්වාක්ඛාතෙ ධම්මවිනයෙ පන දායකස්ස පමාණං ඤත්වා දාතබ්බකිච්චං නාම නත්ථි. යත්තකො දෙය්යධම්මො අත්ථි, තත්තකං අවත්ථරිත්වා දාතුං වට්ටති. අවත්ථරිත්වා දින්නකාරණා හි එස මනුස්සසම්පත්තිං, දිබ්බසම්පත්තිං, නිබ්බානසම්පත්තිඤ්ච අවත්ථරිත්වා උත්තරුත්තරි පණීතපණීතමෙව ලභති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සද්ධාතිස්ස මහරජතුමා වනාහි චුළ්භඋපට්ඨාක තිස්ස ඇමතියා විමසා ඔහුලවා එක් වටුවකු පිසවා ගෙන්වා ගත්තේය. ඉක්බිති වළඳන කල්හි අග්‍රයදී වළඳන්නෙමැයි කන්‍ථකසාල පිරිවෙණෙහි මහතෙරුන්ගේ භාණ්ඩග්‍රාහක තෙරණුන්ට වටුමස් දෙන්නේ උන්වහන්සේ ටිකක්ම පිළිගන්නාකල්හි ඔහුගේ අපිස් ගුණයෙහි පැහැදී ‘ස්වාමිදරුවනි, පැහැදුනෙමි. ඔබට නිතිබත් අටක් දෙමියි පැවසීය. ‘මහරජ මම උපාද්‍යායයන්ට දෙමැයි භික්‍ෂුව කීවේය. ‘තවත් අටක් දෙමැ’යි රජ කීවේය.’ ‘ඒවා අපගේ ආචාර්‍ය්‍යයන්ට දෙමි.’ ‘තවත් අටක්ද දෙමි.’ ‘ඒවා බික් සඟනට දෙමි’ ‘වෙනත් අටක්ද දෙමි.’ සාමණේරයෝ ඉවසූහ. මෙසේ ඔහුට උපන් ලාභය තහවුරු වූයේය."
                    },
                    {
                        "type": "paragraph",
                        "text": "නොපැහැදුනෝ පහදිත් යන මෙහි දීඝබ්‍රාහ්මණ නම් ඇත්තෙක් බමුණන් වළඳවන්නේ බඳුන් පස බැගින්දී සතුටු කරන්නට නොහැකි විය. ඉක්බිති එක් දිනක් ශ්‍රමණයෝ වනාහි අල්පේච්ඡයෝය යන කථාව අසා විමසනු සඳහා බත් ගෙන්වා ගෙන බික්සඟන බත් කිස කරන වේලාවෙහි විහාරයට ගොස් තිහක් පමණ භික්‍ෂූන් බෝජුන් හලෙහි වළඳනු දැක එක්බත් සරලුවක් ගෙන සංඝස්ථවිරයන් සමීපයට ගියේය. තෙරණුවෝ ඇඟිල්ල පොවා ටිකක්ම ගත්තේය. මේ ක්‍රමයෙන්ම එක් බත් සරලුව සියල්ලන්ට පැමිණියේය. ඉක්බිති බමුණු තෙමේ මේ ශ්‍රමණ සමූහයා සත්‍යයි අපිස් බැව්හි පැහැදුනේ දහසක් වියදම් කොට ඒ වෙහෙරෙහිම සෑයක් කරවීය. මෙසේ නොපැහැදුනෝ පැහැදෙත්"
                    },
                    {
                        "type": "paragraph",
                        "text": "පැහැදුනෝ වැඩියත් පහදිත් යන මෙහි කථාවස්තුවෙන් වැඩක් නැත. අල්පෙච්ඡ බව දැක පැහැදුනවුන්ගේ පැහැදීම බෙහෙවින් වැඩේමය."
                    },
                    {
                        "type": "paragraph",
                        "text": "මජක්‍ධන්තිකතිස්ස තෙරුන් සමාන අපිස් ඇත්තවුන් දැක මහජනයා අපිස්වීමට හඟිතියි අපිස් ඇත්තා මහජනයාට ඇසක්වූයේ නම් වෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘මහණෙනි, අපිස් බව සද්ධර්‍මයාගේ පැවැත්ම සඳහා අමතක නොවීම සඳහා විනාශ නොවීම සඳහා පවතී’ යන වචනයෙන් අපිස් ඇත්තේ සසුන බොහෝකල් පවතින්නක් කරයි නම් වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "**නොදායකෙන** යනු මනාව දෙහිත ධර්‍මවිනයෙහි දායකයාගේ පමණ දැන දියයුතු කිසක් නම් නැත. දෙය්‍යධර්‍මය යම් පමණක් ඇත්ද? එපමණක් වසා මැඬගෙන දීමට වටීයි. වසා මැඬගෙන දුන් හේතුවෙන් මෙතෙම මනුෂ්‍ය සම්පත්, දිව්‍යසම්පත් හා නිවන්සම්පත්ද වසා මැඬගෙන වඩවඩාත් ප්‍රණීත ප්‍රණීතව ලබයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 581,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**යො ආරද්ධවීරියො, සො දුක්ඛං විහරතී**ති පඤ්චාතපතප්පනමරුප්පපාතපතනාදිච්චානුපරිවත්තන-උක්කුටිකප්පධානාදීනි අනුයුඤ්ජන්තො දිට්ඨෙ චෙව ධම්මෙ දුක්ඛං විහරති, තස්සෙව බාහිරසමයෙ සමාදින්නස්ස තපචරණස්ස විපාකෙන නිරයෙ උප්පජ්ජිත්වා සම්පරායෙපි දුක්ඛං විහරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යො කුසීතො, සො දුක්ඛං විහරතී**ති අයම්පි දිට්ඨෙ ධම්මෙ චෙව සම්පරායෙ ච දුක්ඛං විහරති. කථං? යස්ස හි පබ්බජිතකාලතො පට්ඨාය යොනිසො මනසිකාරො නත්ථි, බුද්ධවචනං න උග්ගණ්හාති, ආචරියුපජ්ඣායවත්තං න කරොති, චෙතියඞ්ගණබොධියඞ්ගණවත්තං න කරොති. ජනස්ස පන සද්ධාදෙය්යං අපච්චවෙක්ඛිතපරිභොගෙන පරිභුඤ්ජිත්වා දිවසං සෙය්යසුඛං පස්සසුඛං අනුයුඤ්ජිත්වා පබුද්ධකාලෙ තයො විතක්කෙ විතක්කෙති. සො කතිපාහෙනෙව භික්ඛුභාවා චවති? එවං දිට්ඨධම්මෙ ච දුක්ඛං විහරති. පබ්බජිත්වා පන සමණධම්මස්ස සම්මා අකතත්තා ච –"
                    },
                    {
                        "type": "gatha",
                        "text": "“කුසො යථා දුග්ගහිතො, හත්ථමෙවානුකන්තති;\nසාමඤ්ඤං දුප්පරාමට්ඨං, නිරයායුපකඩ්ඪතී”ති. (ධ· ප· 311) –",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "අපායස්මිංයෙව පටිසන්ධිං ගණ්හති. එවං සම්පරායෙපි දුක්ඛං විහරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යො කුසීතො, සො සුඛං විහරතී**ති කාලෙන කාලං වුත්තප්පකාරෙ තපචරණෙ කිඤ්චි කිඤ්චි තපචරණං කත්වා කාලෙන කාලං ඔදාතවත්ථවසනො මාලාගන්ධවිලෙපනධරො මධුරභොජනං භුඤ්ජන්තො මුදුකාසු සෙය්යාසු සයන්තො දිට්ඨෙ ධම්මෙ චෙව සුඛං විහරති සම්පරායෙ ච. සො හි තස්ස තපචරණස්ස ගාළ්හං අග්ගහිතත්තා නාතිබහුං නිරයෙ දුක්ඛං අනුභවති. තස්මා සම්පරායෙ සුඛං විහරති නාම."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යො ආරද්ධවීරියො, සො සුඛං විහරතී**ති ආරද්ධවීරියො හි පබ්බජිතකාලතො පට්ඨාය වත්තෙසු පරිපූරකාරී හොති, බුද්ධවචනං උග්ගණ්හාති, යොනිසො මනසිකාරෙ කම්මං කරොති. අථස්ස වත්තපූරණඤ්චෙව උග්ගහිතබුද්ධවචනඤ්ච සමණධම්මකිරියඤ්ච ආවජ්ජෙන්තස්ස චිත්තං පසීදති. එවං දිට්ඨෙව ධම්මෙ සුඛං විහරති. දිට්ඨධම්මෙ පන අරහත්තං පාපුණිතුං අසක්කොන්තො නිබ්බත්තභවෙ ඛිප්පාභිඤ්ඤො හොතීති සම්පරායෙපි සුඛං විහරති නාම."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සෙය්යථාපි**, **භික්ඛවෙ, අප්පමත්තකොපි ගූථො දුග්ගන්ධො හොතී**ති ඉදං සුත්තං අට්ඨුප්පත්තියං වුත්තං. කතරඅට්ඨුප්පත්තියන්ති? නවකනිපාතෙ (අ· නි· 9.12) සත්තුප්පාදසුත්ත අට්ඨුප්පත්තියං. තථාගතො හි තං අත්ථං කථෙන්තො – “නව පුග්ගලා නිරයතො මුත්තා, තිරච්ඡානයොනිතො මුත්තා, පෙත්තිවිසයතො මුත්තා”ති කථෙසි. අථස්ස එතදහොසි – “සචෙ ඛො පන මෙ පුත්තා ඉමං ධම්මදෙසනං සුත්වා ඛීණනිරයම්හා ඛීණතිරච්ඡානයොනිකා ඛීණපෙත්තිවිසයා ඛීණාපායදුග්ගතිවිනිපාතාති මඤ්ඤමානා උපරිමග්ගඵලත්ථාය වායමිතුං න මඤ්ඤෙය්යුං, තෙසං සංවෙගං ජනෙස්සාමී”ති සංවෙගජනනත්ථං “සෙය්යථාපි, භික්ඛවෙ”ති ඉමං සුත්තමාරභි. තත්ථ **අප්පමත්තකො**ති ථොකමත්තකො පරිත්තප්පමාණො, අන්තමසො කුසග්ගෙනපි ගහෙත්වා උපසිඞ්ඝියමානො දුග්ගන්ධොව හොති. **අප්පමත්තකම්පි භවං න වණ්ණෙමී**ති අප්පමත්තකම්පි කාලං භවෙ පටිසන්ධිං න වණ්ණයාමි. ඉදානිස්ස උපමං දස්සෙන්තො ආහ – **අන්තමසො අච්ඡරාසඞ්ඝාතමත්තම්පී**ති. සබ්බන්තිමෙන පරිච්ඡෙදෙන ද්වෙ අඞ්ගුලියො එකතො කත්වා පහරණමත්තම්පි කාලන්ති වුත්තං හොති. සෙසං සබ්බත්ථ උත්තානත්ථමෙවාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**සො ආරද්ධවිරියො සො දුක්‍ඛං විහරති** යන පංචතාපයෙන් තැවීම, වැළි ප්‍රපාතයෙහි පෙරළීම, හිරු අනුව පැවතීම, ඇනතබාගෙන බවුන් වැඩීම ආදියෙහි යෙදෙන්නා ඉහාත්මයෙහිම දුකසේ වෙසෙයි. බැහැරි සසුනෙක පිළිගත් තපස්වරණයෙහි විපාකයෙන් නරකයෙහි ඉපිද පරලොවෙහිද දුකසේ වෙසෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යො කුසීතො සො දුක්‍ඛං විහරති** යනු මෙතෙමේද ඉහාත්මයෙහිද පරලොවෙහිද දුකසේ වෙසෙයි. කෙසේදයත්? යමෙකුට පැවිදිවීමේ පටන් නුවණින් මෙනෙහි කිරීමක් නැත්ද, බුදුවදන් නොඋගනියි. ආචාර්‍ය්‍ය උපාධ්‍යායවත් නොකරයි. සෑමලු බෝමලුවත් නොකරයි. ජනයාගේ සැදැහැයෙන් දෙන දෙය ප්‍රත්‍යවේක්‍ෂා නොකළ පරිභෝගයෙන් වළඳා දවසෙහි නිදිසුවයෙන් පහස් සුවයෙන් කල්යවා අවදිවූකල තුන විතර්‍කයන් විතර්කනය කරයි. හෙතෙම කිහිප දිනකින්ම භික්‍ෂු භාවයෙන් මිදෙයි. මෙසේ ඉහාත්මයෙහි දුකසේ වෙසෙයි. පැවිදිව මහණදම් මනාව නොකළ නිසාද,"
                    },
                    {
                        "type": "paragraph",
                        "text": "‘යම්සේ නොමනාව ගත් කුසතණ අතම කපයිද එසේ අයහපත්සේ ගන්නාලද ශ්‍රමණබව නිරයට ඇද දමයි.{1}"
                    },
                    {
                        "type": "unindented",
                        "text": "අපායෙහිම පිළිසිඳ ගන්වයි. මෙසේ පරලෙව්හිද දුකසේම වෙසෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යො කුසීතො සො සුඛං විහරතී** යනු කලින්කලට කියනලද අයුරු ඇති තපශ්වරණයෙහි යම් යම් තවුස් හැසීමෙහි යෙදී කලින්කලට සුදු ඇඳුම් හඳින්නේ මල්ගඳ විලවුන් දරන්නේ මිහිරි බොජුන් බුදින්නේ මුදුමොළොක් යහන්වල නිදන්නේ ඉහාත්මයෙහිද සුවසේ වෙසෙයි පරලෙව්හිද සුවසේ වෙසෙයි. හෙතෙම වනාහි ඒ තවුස් හැසිරීම දැඩි සේ නොගත් බැවින් නිරයෙහි බොහෝ දුක් අනුභව නොකරයි. එබැවින් පරලෙව්හි සුවසේ වෙසෙයි නම් වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යො ආරද්ධවිරියො සො සුඛං විහරති **යනු අරඹූ වීර්ය ඇත්තා වනාහි පැවිදිවූ කල්පටන් වත් සම්පූර්ණ කරන්නේ වෙයි. බුදුවදන් උගනියි. නුවණින් මෙනෙහි කිරීමෙහි කටයුතු කරයි. ඉක්බිති වත් පිරිමද උගත් බුදුවදන්ද මහණදම්හි හැසිරීම්ද සිහි කරන්නාවූ ඔහුගේ සිත පහදියි. මෙසේ ඉහාත්මයෙහිම සුවසේ වෙසෙයි. ඉහාත්මයෙහි රහත්බවට පැමිණීමට නොහැක්කේ උපන් භවයෙහි වහාවැටහෙන අභිඥා ඇත්තේ වේනුයි පරලෙව්හිද සුවසේ වෙසෙයි නමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සෙය්‍යථාපි භික්‍ඛවෙ අප්පමත්තකොපි ගූථො දුග්ගන්‍ධො හොති **යන මේ සූත්‍රය අර්‍ත්‍ථොත්පත්තියෙහිදී කියනලදී. කවර අර්‍ත්‍ථොත්පත්තියකදී යත්? නව නිපාතයෙහි සතුප්පාද සූත්‍ර අර්‍ත්‍ථොත්පත්තියෙහිය. තථාගතයන්වහන්සේ තථාගතයන්වහන්සේ එම සූත්‍රය දෙසන සේක් පුද්ගලයෝ නවදෙනෙක් නිරයෙන් මිදුනහ. තිරිසන් යෝනියෙන් මිදුනහ. ප්‍රේතවිෂයෙන් මිදුනහයි වදාළසේක. ඉක්බිති උන්වහන්සේට මෙසේ අදහසක්විය. ඉදින් මගේ පුත්‍රයෝ මේ දම් දෙසුම අසා ක්‍ෂයකළ නිරය ඇත්තාහු ක්‍ෂයකළ තිරිසන් යොනි ඇත්තාහු ක්‍ෂයකළ ප්‍රෙතවිෂය ඇත්තාහු ක්‍ෂයකළ අපාය දුගතියෙහි වැටීම් ඇත්තාහු වෙමුයි හඟින්නාහු මත්තෙහි මාර්‍ගඵල සඳහා වෑයම් කිරීමට නොසිතන්නාහු නම් ඔවුනට සංවේග උපදවන්නෙමියි සංවේග දැනවීම සඳහා ‘යම්සේ මහණෙනි’යි මේ සූත්‍රය පටන්ගත්සේක. එහි **අප්පමත්තකො** යනු මඳ පමණවූ, කුඩා ප්‍රමාණයක්වුයි යටත් පිරිසෙයින් කුසතණ අගකින් ගෙන හිඹ බලනුලබන්නේ දුගඳ ඇත්තේම වෙයි. **අප්පමත්තකම්පි භවංන වණ්ණෙමි** යනු කෙටි කලකටද භවයෙහි ප්‍රතිසන්‍ධිය නොවණමියි. දැන් එයට උපමාවක් දක්වමින් මෙසේ වදාළසේක. **අන්තමසො අච්ඡරාසංඝාතමත්තම්පි** යනු යටත් පිරිසෙයින් ඇඟිලි දෙකක් එකට තබා අසුරු ගසන පමණවූ කාලයකැයි කියනලද්දේ වෙයි. සෙස්ස සියලු තන්හි පැහැදිලිවූයේයමැයි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. “කුසො යථා දුග්ගහිතො හත්‍ථමෙවානුකන්තති සාමඤ්ඤං දුප්පරාමට්ඨං නිරයායුපකඩ්ඪති”"
                    }
                ]
            }
        },
        {
            "pageNum": 583,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "තතියවග්ගවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ජම්බුදීපපෙය්යාලො",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුත්ථවග්ගස්ස පඨමෙ **ජම්බුදීපෙ**ති ජම්බුයා පඤ්ඤාතො පාකටො දීපොති ජම්බුදීපො. ඉමස්ස කිර දීපස්ස සඤ්ඤාණභූතා යොජනසතුබ්බෙධා පණ්ණාසයොජනසාඛා පඤ්චදසයොජනාවට්ටක්ඛන්ධා හිමවන්තපබ්බතෙ ජාතා කප්පට්ඨායිනී මහාජම්බූ නාම අත්ථි, තාය අයං දීපො ජම්බුදීපොති වුච්චති. යථා ච ඉමස්මිං දීපෙ ජම්බුරුක්ඛො කප්පට්ඨායී, තථා අපරගොයානෙ කදම්බරුක්ඛො, උත්තරකුරූසු කප්පරුක්ඛො, පුබ්බවිදෙහෙ සිරීසරුක්ඛො, අසුරානං චිත්තපාටලිරුක්ඛො, සුපණ්ණානං සිම්බලිරුක්ඛො, දෙවානං පාරිච්ඡත්තකොති ඉමෙපි කප්පට්ඨායිනොව."
                    },
                    {
                        "type": "gatha",
                        "text": "“පාටලී සිම්බලී ජම්බූ, දෙවානං පාරිච්ඡත්තකො;\nකදම්බො කප්පරුක්ඛො ච, සිරීසො භවති සත්තමො”ති.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "**ආරාමරාමණෙය්යක**න්ති පුප්ඵාරාමඵලාරාමානං රාමණෙය්යකං වෙළුවන-ජීවකම්බවන-ජෙතවනපුබ්බාරාමසදිසං. තං ඉමස්මිං ජම්බුදීපෙ අප්පමත්තකං පරිත්තකං, න බහුකන්ති අත්ථො. සෙසපදෙසුපි එසෙව නයො. එත්ථ **වනරාමණෙය්යක**න්ති නාගවනසාලවනචම්පකවනාදිසදිසං වඞ්කපබ්බතහිමවන්තපබ්බතපදෙසාදීසු අරඤ්ඤවනං වෙදිතබ්බං. **භූමිරාමණෙය්යක**න්ති ජෙතවනවිහාරමගධක්ඛෙත්තාදිසදිසං සමං භූමිට්ඨානං. **පොක්ඛරණිරාමණෙය්යක**න්ති ජෙතවනපොක්ඛරණිගග්ගරාපොක්ඛරණිසදිසානං වට්ටචතුරස්සදීඝවඞ්කාදිසණ්ඨානානං පොක්ඛරණීනං සන්නිවෙසනට්ඨානං. **උක්කූලවිකූල**න්ති උක්කූලඤ්ච විකූලඤ්ච. තත්ථ උක්කූලං උන්නතට්ඨානං, විකූලං නින්නට්ඨානං. **නදීවිදුග්ග**න්ති නදීනං භින්නට්ඨානං තං දුග්ගමත්තා නදීවිදුග්ගන්ති වුච්චති. **ඛාණුකණ්ටකට්ඨාන**න්ති තත්ථජාතකානඤ්චෙව ආහරියමානානඤ්ච ඛාණුකණ්ටකාදීනං පතිට්ඨානට්ඨානං. **පබ්බතවිසම**න්ති ගිරිවිසමං. **යෙ ඔදකා**ති යෙ ච උදකෙ ජායන්ති, තෙයෙව බහුතරා. ඉතො කිර සුවණ්ණභූමි සත්තමත්තානි යොජනසතානි හොති, එකෙන වාතෙන ගච්ඡන්තී නාවා සත්තහි අහොරත්තෙහි ගච්ඡති. අථෙකස්මිං සමයෙ එවං ගච්ඡන්තී නාවා සත්තාහම්පි නන්දියාවට්ටමච්ඡපිට්ඨෙනෙව ගතා. එවං ඔදකානං සත්තානං බහුභාවො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "අපිච ථලට්ඨානස්ස පරිත්තභාවෙන උදකස්ස ච බහුභාවෙනාපි අයමත්ථො වෙදිතබ්බො. යථා හි මහාතළාකෙ එකොව උප්පලගච්ඡො අස්ස, තස්ස චත්තාරි ච පණ්ණානි, මජ්ඣෙ ච එකං උප්පලමකුලං අස්ස. එවමෙවං චත්තාරි පණ්ණානි විය චත්තාරො දීපා, මජ්ඣෙ උප්පලමකුලං විය සිනෙරුපබ්බතො, සෙසං උදකං විය උදකපරික්ඛිත්තො ඔකාසො. තස්ස මහන්තභාවො ඉද්ධිමන්තානං පාකටො හොති. තෙසඤ්හි ආකාසෙන ගච්ඡන්තානං චත්තාරො මහාදීපා චත්තාරි පණ්ණානි විය උපට්ඨහන්ති, සිනෙරුපබ්බතො මජ්ඣෙ උප්පලමකුලං විය, සෙසං උදකං විය උදකපරික්ඛිත්තො ඔකාසො. එවං මහන්තෙ උදකෙ ජාතත්තා ඔදකාව බහුතරා වෙදිතබ්බා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "තෙවෙනි වර්‍ගයයි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ජම්බුදීපපෙය්‍යාලය",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "සිවුවෙනි වර්ගයෙහි පළමුසූත්‍රයෙහි** ජම්බුදීපෙ** යනු දඹගසින් පැනුණු ප්‍රකටවුණු දිවයිනයි, ජම්බුදීපයයි. මේ දිවයින හඟවන්නාවූ යොදුන් සියයක් උස්වූ, පණස් යොදුන් ශාඛා ඇති, යොදුන් පසළොසක් වටවූ කඳ ඇති හිමවතෙහි හටගත් කල්පයක් පවත්නා මහාජම්බුනම්වූ ගසෙක් ඇත. ඒ ගස නිසා මේ දිවයින ජම්බුදීපයයි කියනු ලැබේ. යම් සේ මේ දිවයිනෙහි දඹගස කල්පයක් පවතින්නේද එසේ අපරගොයානයෙහි කඳම්බ (කොළොම්) ගසඳ උතුරුකුරු දිවයිනෙහි කප්රුකද පූර්‍ව විදෙහයෙහි මහරි ගසද, අසුරයන්ගේ චිත්තපාටලී ගසද සුපර්‍ණයන්ගේ ඉඹුල් ගසද දෙවියන්ගේ පරසතු ගසද යන මේවා කල්පයක් පවතින්නේමය."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘පළොල්, හිඹුල්, දඹ, දෙවියන්ගේ පරසතු, කොළොම් හා කප්රුකද සත්වෙනිවූ මහරි ගසද වේ.’{1}"
                    },
                    {
                        "type": "paragraph",
                        "text": "**ආරාමරාමණෙය්‍යකං** යනු වෙලුවන ජීවකම්බවන ජේතවන පුබ්බාරාම වැනිවූ මල්වතු පලතුරු වතුවල රමණීයබවයි. මේ දඹදිවෙහි එය අල්ප මාත්‍රය, මඳය බොහෝ නොවේයයි අර්‍ත්‍ථයි. සෙසු පදයන්හිද මේ ක්‍රමයමැයි. මෙහි වනාහි ව**නරාමණෙය්‍යකං** යනු නාවන සල්වන සපුවන ආදියට සමානවූ වඞකපර්‍වත හිමාලයපර්‍වත ප්‍රදේශදියෙහි ආරණ්‍යවන දතයුතුයි. **භූමිරාමණෙය්‍යකං** යනු දෙව්රම් පොකුණ හා ගග්ගරා පොකුණ වැනිවූ වට සතරැස් දිග අැද ආදී හැඩය ඇති පොකුණුවලට පිවිසෙන තැන දතයුතුය. **උක්කුලවිකුලං** යනු උස්වූ ඉවුරු ඇත්තාවූ හා පහත්වූ ඉවුරු ඇතියි. එහි උස්වූ ඉවුර උඩට නතුවූ තැනයි පහත්වූ ඉවුර පහතට නැමුණු තැනයි. **නදීවිදුග්ගං** යනු ගංගාවන්හි බිඳුණු තැනයි. එය යාමට අපහසු බැවින් නදීවිදුග්ගයයි කියනුලැබේ. **ඛාණුකණ්ටකාධානං** යනු එහි උපන්නාවූද ගෙනෙනු ලබන්නාවූද කණු කටුආදිය පිහිටි තැනයි**. පබ්බතවිසමං** යන පර්‍වත විෂමස්ථානයයි. **යෙ ඔදකා** යනු යමක් දියෙහි හටගනියිද ඒවාම බොහෝ වෙයි. මෙයින් (දඹදිවින්) ස්වර්‍ණභූමිය යොදුන් සත් සියයක් පමණ වෙයි. එක් සුළඟකින් යන නැවක සත් දිනක් යයි. ඉක්බිති එක් කලෙක මෙසේ යන නැවක් සත්දිනක්ම ගඟ සුළියෙහි මසුපිටෙන්ම ගියේය. මෙසේ ජලයෙහි උපන්නවුන්ගේ බොහෝබව දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "යම්සේ මහවිලක එකම උපුල් පදුරක් වේද එහි කොළ සතරක්ද මැද එක් උපුල් පොහොට්ටුවක්ද වේද, එසේම සිවුදිවයින කොළසතර මෙනි. මහාමේරු පර්‍වතය මැදවූ උපුල් පොහොට්ටුව මෙනි. ජලයෙන් වටවූ අවකාශය සෙසු ජලය මෙනි. එහි මහත්බව සෘද්ධිමතුන්ට ප්‍රකටය. අහසින් යන්නාවූ ඔවුනට සතර මහා දිවයින කොළ සතර මෙන් හැඟෙයි. මැද උපුල් පොහොට්ටුව මෙන් මහාමේරු පර්‍වතයයි. සෙසු ජලය මෙන් දියෙන් වටවූ අවකාශයයි. මෙසේ මහත් ජලයෙහි උපන් බැවින් දියෙහි හටගත්තෝම බොහෝයයි දතයුත්තාහ."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. “පාටලී සිම්බලී ජම්බු දෙවානං පාරිච්ඡත්තකො කදම්බො කප්පරුක්‍ඛො ච සිරීසො භවති සත්තමො”"
                    }
                ]
            }
        },
        {
            "pageNum": 585,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "දුතියාදීසු **අඤ්ඤත්ර මනුස්සෙහී**ති ඉධ චත්තාරො අපායා අඤ්ඤත්ර මනුස්සෙහීති අධිප්පෙතා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**මජ්ඣිමෙසු ජනපදෙසූ**ති “පුරත්ථිමාය දිසාය ගජඞ්ගලං නාම නිගමො, තස්ස පරෙන මහාසාලා, තතො පරා පච්චන්තිමා ජනපදා, ඔරතො මජ්ඣෙ. පුරත්ථිමදක්ඛිණාය දිසාය සල්ලවතී නාම නදී, තතො පරා පච්චන්තිමා ජනපදා, ඔරතො මජ්ඣෙ. දක්ඛිණාය දිසාය සෙතකණ්ණිකං නාම නිගමො, තතො පරා පච්චන්තිමා ජනපදා, ඔරතො මජ්ඣෙ. පච්ඡිමාය දිසාය ථූණං නාම බ්රාහ්මණගාමො, තතො පරා පච්චන්තිමා ජනපදා, ඔරතො මජ්ඣෙ. උත්තරාය දිසාය උසීරද්ධජො නාම පබ්බතො, තතො පරා පච්චන්තිමා ජනපදා, ඔරතො මජ්ඣෙ”ති (මහාව· 259) එවං පරිච්ඡින්නෙ ජනපදෙති අත්ථො. අයඤ්හි ජනපදො මුදිඞ්ගසණ්ඨානො උජුකෙන කත්ථචි අසීතියොජනො හොති, කත්ථචි යොජනසතිකො, කත්ථචි ද්වියොජනසතිකො, මජ්ඣෙන පන තියොජනසතිකො, පරියන්තපරික්ඛෙපෙන නවමත්තයොජනසතිකො හොති. එත්තකෙ ඨානෙ බුද්ධපච්චෙකබුද්ධා මහාසාවකා බුද්ධුපට්ඨාකා බුද්ධසාවකා බුද්ධමාතා බුද්ධපිතා චක්කවත්තී රාජාති ඉමෙ සත්තා නිබ්බත්තන්ති. අපිච උපාදායුපාදායාපි මජ්ඣිමපදෙසො ලබ්භති. සකලොපි හි ජම්බුදීපො මජ්ඣිමපදෙසො නාම, සෙසදීපා පච්චන්තිමා ජනපදා. තම්බපණ්ණිදීපෙ අනුරාධපුරං මජ්ඣිමපදෙසො නාම, සෙසො පච්චන්තොති එවං නයො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පඤ්ඤවන්තො අජළා අනෙළමූගා**ති එත්ථ කම්මස්සකතපඤ්ඤා, ඣානපඤ්ඤා විපස්සනාපඤ්ඤා, මග්ගපඤ්ඤා, ඵලපඤ්ඤාති එතාහි සමන්නාගතා පඤ්ඤවන්තො නාම, අමූළ්හා අජළා නාම. යෙසං එළා මුඛතො න ගලති, තෙ අනෙළමූගා නාම, අනෙළමුඛා නිද්දොසමුඛාති අත්ථො. **පටිබලා**ති සමත්ථා, කායබලෙන චෙව ඤාණබලෙන ච සමන්නාගතා. **අත්ථමඤ්ඤාතු**න්ති අත්ථානත්ථං කාරණාකාරණං ජානිතුං. **දුප්පඤ්ඤා**ති අප්පඤ්ඤා නිප්පඤ්ඤා. **ජළා**ති මන්දා මොමූහා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අරියෙන පඤ්ඤාචක්ඛුනා**ති සහවිපස්සනෙන මග්ගෙන. **අවිජ්ජාගතා**ති අවිජ්ජන්ධකාරෙන සමන්නාගතා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යෙ ලභන්ති තථාගතං දස්සනායා**ති යෙ තථාගතස්ස ගුණෙ ජානිත්වා තථාගතං චක්ඛුවිඤ්ඤාණෙන පස්සිතුං ලභන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**තථාගතප්පවෙදිත**න්ති තථාගතෙන පවෙදිතං පකාසෙත්වා කථිතං. **සවනායා**ති සොතවිඤ්ඤාණෙන සොතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ධාරෙන්තී**ති න පම්මුස්සන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ධාතානං ධම්මානං අත්ථං උපපරික්ඛන්තී**ති පගුණාය පාළියා අත්ථානත්ථං උපපරික්ඛන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "දෙවැනි සූත්‍රාදියෙහි **අඤ්ඤත්‍ර මනුසේසහි** යනු මෙහි මිනිසුන් හැර සතර අපාය අදහස් කරනලදී."
                    },
                    {
                        "type": "paragraph",
                        "text": "**මජ්ක්‍ධිමෙසු ජනපදෙ**සු යනු පෙරදිගෙහි කජංගල නම්වූ නියම්ගමයි. එයින් මෑත මහාසාලයෝයි. එයින් පසු මෙහා මැද පසල් දනවුය. පෙර දකුණු අනුදිශාවෙහි සලලවතී නම්වූ ගඟය. එයින්පසු මෙහා මැඳ පසල් දනවුය. දකුණු දිගෙහි සෙතකණ්ණික නම්වූ නියම්ගමයි. එයින් පසු මෙහාමැද පසල් දනවුය. පැසුළු දිගෙහි ථූන නම්වූ බමුණු ගමයි. එයින් පසු මෙහා මැද පසල් දනවුය. උතුරුදිගෙහි උසීරුද්ධවජ නම් වූ පර්‍වතයයි. එයින් පසු මෙහා මැද පසල්දනවුය. මෙසේ සීමාවූ ජනපදයෙහි යන අර්‍ත්‍ථයි. මේ ජනපදය වනාහි මිහිඟු බෙරයක හැඩය ඇත්තේයි. කෙළින් කිසිතැනක අසූ යොදුනක් වෙයි. කිසිතැනක සියක් යොදුනක් ඇත්තෙයි. කිසි තැනක යොදුන් දෙසීයක් ඇත්තේයි. මැදින් යොදුන් තුන් සියයක් ඇත්තේයි. කෙළවර වටින් නවසියයක් පමණ යොදුන් ඇත්තේ වෙයි. මෙපමණවූතන්හි බුදු පසේබුදුවරු මහසව්වෝ බුදුඋවටැන් කරන්නෝ, බුදුමව, බුදුපියා, සක්විති රජ යන මේ සත්වයෝ උපදිති. තවද ඇසුරු කොට ඇසුරුකොට මධ්‍යමදේශය ලැබෙයි. සියලු දඹදිවම මධ්‍යමදේශය නමි. සෙසු දිවයින් පසල් දනවුය. තම්බපණ්ණි දිවයිනෙහි (ලංකාවෙහි) අනුරාධපුරය මධ්‍යම දේශය නමි. සෙස්ස පසල් දනවුයයි මෙසේ ක්‍රමය දතයුතුයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පඤ්ඤාවනේතා අජළා අනෙළමුගා** යනු මෙහි කම්මස්සකත පඤ්ඤා ක්‍ධානපඤ්ඤ විපස්සනා පඤ්ඤ මග්ගපඤ්ඤ ඵලපඤ්ඤා යන මේවායින් යුක්තවූවාහු ප්‍රඥාවන්තයෝ නමි. නොමුලාවූවෝ අජළා නම් වෙත්. යමෙකුන්ගේ මුවෙන් කෙළ නොගලයිද ඔවුහු අනෙළමුගා නම් වෙත්, කෙළතොළු නොවූ නිදොස් මුව ඇත්තාහුයි අර්‍ත්‍ථයි **පටිබලා** යනු සමර්‍ත්‍ථයෝයි. කායබලයෙන් මෙන්ම ඤාණබලයෙන්ද යුක්තවූවෝයි. **අත්‍ථමඤ්ඤාතුං** යනු අර්‍ත්‍ථ අනර්‍ත්‍ථ කාරණ අකාරණ දැනීමටයි. **දුප්පඤ්ඤා **යනු ඥානය නැති ප්‍රඥාව නැති අයයි. ජළා යනු මෝඩ මුළාවූ අයයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අරියෙන පඤ්ඤාචක්‍ඛුනා** යනු විදර්‍ශනා සහිත මාර්‍ගයෙනුයි. **අවිජ්ජාගතා** යනු අවිද්‍යා අන්‍ධකාරයෙන් යුක්තවූවාහුයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යෙ ලභන්ති තථාගතං දස්සනාය** යනු යමෙක් තථාගතයන්ගේ ගුණය දැන ථාගතයන්වහන්සේ චක්‍ඛු විඤ්ඤාණයෙන් දකීමට ලබත්."
                    },
                    {
                        "type": "paragraph",
                        "text": "**තථාගතප්පචෙදිතං** යනු තථාගතයන්වහ්නසේ විසින් දන්නාලද පවසපවසා කියනලද යනුයි. **ස්වණාය** යනු ශොත්‍ර විඥානයාගෙන් ඇසීමටයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ධාරෙන්ති** යනු නොමුළාවෙත් (අමතක නොවෙත්)"
                    },
                    {
                        "type": "paragraph",
                        "text": "**ධතානං ධම්මානං අත්‍ථං උපපරික්‍ඛන්ති** යනු ප්‍රගුණවු පෙළෙහි අර්‍ත්‍ථ අනර්‍ත්‍ථ විමසත්."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 587,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**අත්ථමඤ්ඤාය ධම්මමඤ්ඤායා**ති අට්ඨකථඤ්ච පාළිඤ්ච ජානිත්වා. **ධම්මානුධම්මං පටිපජ්ජන්තී**ති අනුලොමපටිපදං පූරෙන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සංවෙජනීයෙසු ඨානෙසූ**ති සංවෙගජනකෙසු කාරණෙසු. **සංවිජ්ජන්තී**ති සංවෙගං ආපජ්ජන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යොනිසො පදහන්තී**ති උපායෙන පධානවීරියං කරොන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**වවස්සග්ගාරම්මණ**න්ති වවස්සග්ගො වුච්චති නිබ්බානං, තං ආරම්මණං කරිත්වාති අත්ථො. **ලභන්ති සමාධි**න්ති මග්ගසමාධිඤ්ච ඵලසමාධිඤ්ච පාපුණන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අන්නග්ගරසග්ගාන**න්ති උත්තමන්නානඤ්ච උත්තමරසානඤ්ච. **උඤ්ඡෙන කපාලාභතෙන යාපෙන්තී**ති උඤ්ඡාචාරෙන වනමූලඵලාඵලෙන වා කපාලෙන ආභතභත්තෙන වා යාපෙන්ති. එත්ථ ච යො කස්සචිදෙව ඛාදනීයස්ස භොජනීයස්ස අත්ථාය චිත්තෙ උප්පන්නෙ තංඛණංයෙව න තං ලභති, අයං අන්නග්ගරසග්ගානං න ලාභී නාම. යස්සපි තංඛණංයෙව ලභිත්වා ඔලොකෙන්තස්ස වණ්ණගන්ධරසා අමනාපා හොන්ති, අයම්පි අන්නග්ගරසග්ගානං න ලාභී නාම. යස්ස පන වණ්ණගන්ධරසා පටිලභන්ති, මනාපා හොන්ති, අයං අන්නග්ගරසග්ගානං ලාභී නාම. සො උත්තමකොටියා චක්කවත්තී රාජා, හෙට්ඨිමකොටියා ධම්මාසොකො වෙදිතබ්බො. සඞ්ඛෙපතො හි යස්ස භත්තස්ස එකපාති සතසහස්සං අග්ඝති, ඉදං අන්නග්ගරසග්ගං නාම. යං පන භික්ඛුසඞ්ඝං පිණ්ඩාය චරන්තං දිස්වා මනුස්සා උත්තමපණීතං භත්තං දෙන්ති, ඉදං කිං නාමාති? ඉදං උඤ්ඡෙන කපාලාභතෙන යාපෙන්තෙ උපාදාය අන්නග්ගරසග්ගං නාම වුච්චතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අත්ථරසස්සා**තිආදීසු අත්ථරසො නාම චත්තාරි සාමඤ්ඤඵලානි, ධම්මරසො නාම චත්තාරො මග්ගා, විමුත්තිරසො නාම අමතනිබ්බානං. සෙසං සබ්බත්ථ උත්තානත්ථමෙවාති."
                    },
                    {
                        "type": "centered",
                        "text": "චතුත්ථවග්ගවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "ජම්බුදීපපෙය්යාලො නිට්ඨිතො.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සොළසපසාදකරධම්මා",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "**අද්ධමිද**න්තිආදීසු **අද්ධ**න්ති එකංසාධිවචනමෙතං, අද්ධා ඉදං ලාභානං, එකංසො එස ලාභානන්ති වුත්තං හොති. **යදිදං ආරඤ්ඤිකත්ත**න්ති යො එස ආරඤ්ඤිකභාවො. ඉදං වුත්තං හොති – ආරඤ්ඤිකභාවො නාම ලාභානං එකංසො අවස්සභාවිතා න සක්කා ආරඤ්ඤිකෙන ලාභං න ලභිතුන්ති. ආරඤ්ඤිකො හි භික්ඛු “අත්තනො අරඤ්ඤවාසස්ස අනුච්ඡවිකං කරිස්සාමී”ති පාපකං නාම න කරොති, අථස්ස “ආරඤ්ඤිකො අයං භික්ඛූ”ති සඤ්ජාතගාරවො මහාජනො චතුපච්චයෙන පූජං කරොති. තෙන වුත්තං – “අද්ධමිදං, භික්ඛවෙ, ලාභානං යදිදං ආරඤ්ඤිකත්ත”න්ති. සෙසපදෙසුපි එසෙව නයො. එත්ථ පන **බාහුසච්ච**න්ති බහුස්සුතභාවො. **ථාවරෙය්ය**න්ති චිරපබ්බජිතත්තා ථාවරප්පත්තභාවො. **ආකප්පසම්පදා**ති චීවරග්ගහණාදිනො ආකප්පස්ස සම්පත්ති. **පරිවාරසම්පදා**ති සුචිපරිවාරතා. **කොලපුත්තී**ති කුලපුත්තභාවො. **වණ්ණපොක්ඛරතා**ති සම්පන්නරූපතා. **කල්යාණවාක්කරණතා**ති වචනකිරියාය මධුරභාවො. **අප්පාබාධතා**ති ආරොග්යසම්පත්ති. අරොගො හි භික්ඛු අත්තනො සරීරකල්යාණතාය විපස්සනාධුරෙ ච ගන්ථධුරෙ ච පරිපූරකාරී හොති, තෙනස්ස ලාභො උප්පජ්ජතීති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**අත්‍ථමඤ්ඤාය ධම්මමඤ්ඤාය** යනු අටුවාද පෙළද දැනයි. **ධම්මානුධම්මං පටිපජ්ජන්ති** යනු අනුලොම් (අනුකූල) පිළිවෙත පුරත්."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සංවෙජනීයෙසු ඨානෙසු** යනු සංවේග උපදවන්නාවූ කාරණයන්හියි. **සංවිජ්ජන්ති** යනු සංවේගයට පැමිණෙත්."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යොනිසො පදහන්ති** යනු උපායයෙන් (නුවණින්) ප්‍රධන් වීර්ය කරත්."
                    },
                    {
                        "type": "paragraph",
                        "text": "**වචස්සග්ගාරම්මණං** යනු නිවන වවස්සග්ගයයි කියනු ලැබේ. එය අරමුණුකොට යන අර්‍ත්‍ථයි. **ලභන්ති සමාධිං** යනු මාර්‍ගසමාධියටද ඵලසමාධියටද පැමිණෙත්."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අන්නග්ගරසග්ගානං** යනු උතුම් ආහාරයන්ගේද උතුම් රසයන්ගේද යනුයි. **උඤඡේන කපාලාහතෙන යාපෙන්ති** යනු පිඬු හැසිරීමෙන් හෝ වනමුල්පලවැලින් හෝ කබලින් රැගෙන එනලද බතින් හෝ යැපෙත්. මෙහි ද යමෙක් කිසියම් කෑයුතු බිදිය යුතු දෙයක් සඳහා සිත උපන් කල්හි එකෙණෙහිම එය නොලැබෙයිද මෙතෙම උතුම් ආහාර උතුම් රසයන් නොලැබෙන්නෙක් නමි. එකෙණෙහිම ලැබ බලන්නාවූ යමෙකුට වර්‍ණගන්‍ධරසයෝ නොකැමති වෙත් නම් මෙතෙමේත් උතුම් ආහාර හා උතුම් රස නොලැබෙන්නෙක් නම් වේ. යමෙකුට වනාහි වර්‍ණගන්‍ධරසයෝ ලැබෙත්ද ප්‍රිය වෙත්ද මෙතෙම උතුම් ආහාරයන් හා උතුම් රසයන් ලබන්නේ නමි. හෙතෙම උපරිම කෙළවරින් සක්විති රජය අවම කෙළවරින් ධර්‍මාශෝදයයි දතයුතුය. සැකෙවින් යමෙකුගේ එක් අහර බඳුනක් ලක්‍ෂයක් අගීද මෙය උතුම් අහර උතුම් රසය නමි. පිඬු පිණිස හැසිරෙන භික්‍ෂුසංඝයා දැක මිනිස්සු යම් උතුම් ප්‍රණීත බතක් දෙත්ද මෙය කිනම් වේද? මෙය පිඬු සිඟීමෙන් කබලින් ගෙනා අහරින් යැපෙන්නන් ඇසුරුකොට අග්‍රරසයයි කියනුලැබේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අත්‍ථරසස්ස** ආදී තන්හි සතර ශ්‍රමණ ඵලයන් අර්‍ත්‍ථරස නම්වෙයි. සතර මාර්‍ගය ධර්‍මරසය නම්වෙයි. අමාතවූ නිර්‍වාණය විමුක්තිරස නම් වෙයි. සෙස්ස සියලු තන්හි පැහැදිලිමය."
                    },
                    {
                        "type": "centered",
                        "text": "සිවුවැනි වර්‍ගයයි.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "ජම්බුදීප පෙය්‍යාලය නිමියේයි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සොළොස්ප්‍රසාදකරධර්‍ම",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "**අද්ධමිදං** යනාදියෙහි අද්ධං යන මෙය ඒකාන්ත යන්නට නමෙකි. ලාභයනගෙන් මෙය ඒකාන්තය, ලාභයන්ගෙන් මෙය නිශ්චිතයයි කියනලද්දෙවෙයි **යදිදං ආරඤ්ඤකත්තං** යනු යම් මේ ආරණ්‍යකභාවය ලාභයන්ට ඒකාන්තය. අවශ්‍යභාවිතයකි. ආරණ්‍යකයා විසින් ලාභ නොලැබීමට නොහැකියයි මෙය කියනලද්දේවෙයි. ආරණ්‍යක භික්‍ෂුව වනාහි තමන්ගේ අරණ්‍ය වාසයට සුදුස්සක් කරමැයි පවක් නම් නොකරයි. මේ භික්‍ෂුව ආරණ්‍යවාසියෙකැයි ඔහුට හටගත් ගෞරවය ඇති මහජනයා සිවුපසයෙන් පූජා කරයි. ‘මහණෙනි, යම් මේ ආරණ්‍යක භාවයක් වේද? මෙය ලාභයන්ට ඒකාන්ත’යයි එහෙයින් කියනලදී. සෙසු පදයන්හිද මේ ක්‍රමයමැයි. මෙහි වනාහි **බාහුසච්චං** යනු බහුශ්‍රැතභාවයයි. ථාවරෙය්‍යං යනු බොහෝකල් පැවිදිව සිටීමෙන් තහවුරුබවට පත්බවයි. **ආකප්පසම්පදා** යනු සිවුරු ගැනීම් ආදී ආකල්ප සම්පත්තියයි. **පරිවාරසම්පදා** යනු පිරිසුදු පිරිවර ඇති බවයි. **කොලපුත්තී** යනු කුලපුත්‍ර භාවයයි. **වණ්ණපොක්‍ඛරතා** යනු සපැමිණි රූපවත් බවයි. **කල්‍යාණවාක්කරණතා** යනු වචන ක්‍රියාවෙහි (කථාකිරීමෙහි) මිහිරිබවයි. **අප්පබාධතා** යනු නීරෝගී සම්පත්තියයි. නීරෝගී භික්‍ෂුව තමන්ගේ ශරීරයෙහි යහපත්බවින් වාස (විදර්‍ශනා) ධුරයන්ද ග්‍රන්ථධුරයන්ද සම්පූර්‍ණ කරන්නෙක් වෙයි. එහෙයින් ඔහුට ලාභය උපදියි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 589,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "සොළස පසාදකරධම්මා නිට්ඨිතා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අච්ඡරාසඞ්ඝාතවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "**අච්ඡරාසඞ්ඝාතමත්තම්පී**ති ඉදම්පි සුත්තං අග්ගික්ඛන්ධූපමඅට්ඨුප්පත්තියංයෙව (අ· නි· 7.72) වුත්තං. අප්පනාප්පත්තාය හි මෙත්තාය විපාකෙ කථායෙව නත්ථි. තස්සායෙව අට්ඨුප්පත්තියා අයං දෙසනා ආරද්ධාති වෙදිතබ්බා. තත්ථ **පඨම**න්ති “ගණනානුපුබ්බතා පඨමං, ඉදං පඨමං සමාපජ්ජතීති පඨම”න්ති විභඞ්ගෙ (විභ· 568) වුත්තත්ථමෙව. **ඣාන**න්ති ඣානං නාම දුවිධං ආරම්මණූපනිජ්ඣානඤ්ච ලක්ඛණූපනිජ්ඣානඤ්චාති. තත්ථ **ආරම්මණූපනිජ්ඣානං** නාම අට්ඨ සමාපත්තියො. තා හි පථවීකසිණාදිනො ආරම්මණස්ස උපනිජ්ඣානතො ආරම්මණූපනිජ්ඣානන්ති වුච්චන්ති. **ලක්ඛණූපනිජ්ඣාන**න්ති විපස්සනාමග්ගඵලානි. විපස්සනා හි අනිච්චාදිවසෙන සඞ්ඛාරලක්ඛණස්ස උපනිජ්ඣානතො ලක්ඛණූපනිජ්ඣානං නාම, විපස්සනාය පන ලක්ඛණූපනිජ්ඣානකිච්චං මග්ගෙන සිජ්ඣතීති මග්ගො ලක්ඛණූපනිජ්ඣානං, ඵලං සුඤ්ඤතඅනිමිත්තඅප්පණිහිත-ලක්ඛණස්ස නිබ්බානස්සෙව උපනිජ්ඣානතො ලක්ඛණූපනිජ්ඣානන්ති වුච්චති. තත්ථ ඉමස්මිං පන අත්ථෙ ආරම්මණූපනිජ්ඣානං අධිප්පෙතං. **කො පන වාදො යෙ නං බහුලීකරොන්තී**ති යෙ නං පඨමජ්ඣානං බහුලී කරොන්ති, පුනප්පුනං කරොන්ති, තෙසු වත්තබ්බමෙව නත්ථි. සෙසමෙත්ථ හෙට්ඨා වුත්තනයෙනෙව වෙදිතබ්බං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**දුතිය**න්තිආදීසුපි “ගණනානුපුබ්බතා දුතිය”න්තිආදිනා (විභ· 579) නයෙන අත්ථො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**මෙත්ත**න්ති සබ්බසත්තෙසු හිතඵරණං. **චෙතොවිමුත්ති**න්ති චිත්තවිමුත්තිං. ඉධ අප්පනාප්පත්තාව මෙත්තා අධිප්පෙතා. **කරුණාදීසු**පි එසෙව නයො. ඉමෙ පන චත්තාරො බ්රහ්මවිහාරා වට්ටං හොන්ති, වට්ටපාදා හොන්ති, විපස්සනාපාදා හොන්ති, දිට්ඨධම්මසුඛවිහාරා හොන්ති, අභිඤ්ඤාපාදා වා නිරොධපාදා වා හොන්ති. ලොකුත්තරා පන න හොන්ති. කස්මා? සත්තාරම්මණත්තාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**කායෙ කායානුපස්සී**ති ආනාපානපබ්බං, ඉරියාපථපබ්බං, චතුසම්පජඤ්ඤපබ්බං, පටිකූලමනසිකාරපබ්බං, ධාතුමනසිකාරපබ්බං, නවසිවථිකාපබ්බානි, අජ්ඣත්තපරිකම්මවසෙන චත්තාරි නීලාදිකසිණානීති ඉමස්මිං අට්ඨාරසවිධෙ කායෙ තමෙව කායං පඤ්ඤාය අනුපස්සන්තො. **විහරතී**ති ඉරියති වත්තති. ඉමිනා ඉමස්ස අට්ඨාරසවිධෙන කායානුපස්සනාසතිපට්ඨානභාවකස්ස භික්ඛුනො ඉරියාපථො කථිතො හොති. **ආතාපී**ති තස්සෙව වුත්තප්පකාරස්ස සතිපට්ඨානස්ස භාවනකවීරියෙන වීරියවා. **සම්පජානො**ති අට්ඨාරසවිධෙන කායානුපස්සනාසතිපට්ඨානස්ස පරිග්ගාහිකපඤ්ඤාය සම්මා පජානන්තො. **සතිමා**ති අට්ඨාරසවිධෙන කායානුපස්සනාපරිග්ගාහිකාය සතියා සමන්නාගතො. **විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්ස**න්ති තස්මිංයෙව කායසඞ්ඛාතෙ ලොකෙ පඤ්චකාමගුණිකතණ්හඤ්ච පටිඝසම්පයුත්තදොමනස්සඤ්ච විනෙත්වා වික්ඛම්භෙත්වා කායෙ කායානුපස්සී විහරතීති වුත්තං හොති. එත්තාවතා කායානුපස්සනාසතිපට්ඨානවසෙන සුද්ධරූපසම්මසනමෙව කථිතන්ති වෙදිතබ්බං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "සොළොස් ප්‍රසාදකර ධර්‍මයෝ නිමියෝයි.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අච්ඡරාසඞ්ඝාත වර්ගය",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "**අච්ඡරාසංඝාතමත්තම්පි** යන මේ සූත්‍රය යන මේ සූත්‍රය අග්ගික්‍ඛන්‍ඛොපම සූත්‍ර අර්‍ත්‍ථොත්පත්තියෙහිම කියනලදී. අර්‍පණාවට නැඟුණු මෛත්‍රයට විපාක කථාවක් නැත. එහි අර්‍ත්‍ථොත්පත්තියෙහිම මේ දේශනාව ඇරඹිණැයි දතයුතුය. එහි **පඨමං** යනු සංඛ්‍යානුපූර්‍වතාවෙන් මෙය පළමුවැනිය, පළමුව සමවදීයයි පළමු නමැයි විභංගයෙහි කියනලදී. **ක්‍ධානං** යනු ධ්‍යාන නම් ද්විවිධය. ආරම්මණූපනිජක්‍ධාන, ලක්‍ඛණූපනිජක්‍ධාන වශයෙනි. එහි ආරම්මණුපනිජක්‍ධානය නම් අෂ්ටසමාපත්තීහුයි. ඒවා වනාහි පඨවිකසිණාදී අරමුණුවලට නැවත නැවත ධ්‍යානකිරීම හේතුවෙන් ආරම්මණපනිජක්‍ධානයයි කියනුලැබෙයි. ලක්‍ඛණුපනිජක්‍ඛාන යනු විදර්‍ශනාමාර්‍ගඵලයෝයි. විදර්‍ශනාව වනාහි අනිත්‍යාදි වශයෙන් සංස්කාර ලක්‍ෂණය නැවත නැවත සිහිපත්කිරීම (ධ්‍යාන වැඩීම) හේතුවෙන් ලක්‍ඛණුපනිජක්‍ධාන නම් වෙයි. විදර්‍ශනාවට ලක්‍ඛණූපනිජක්‍ධාන කෘත්‍යය මාර්‍ගයෙන් සිද්ධවේයයි මාර්‍ගය ලක්‍ඛණුපනිජක්‍ධානයයි. ඵලය සුඤ්ඤත අනිමිත්ත අප්පණිහිත ලක්‍ෂණ ඇති නිර්‍වාණයෙහිම උපනිජක්‍ධානය වනබැවින් ලක්‍ඛණුපනිජක්‍ධානයයි කියනුලැබේ. එහි මේ අර්‍ත්‍ථයෙහි ආරම්මණුපනිජ්ක්‍ධානය අදහස් කරනලදී**. කො පන වාදො යෙ** නං **බහුලීකරොන්ති** යනු යමෙක් ඒ ප්‍රථමධ්‍යානය බොහෝ සෙයින් කරත්ද නැවත නැවත කරත්ද ඔවුන් කෙරෙහි කිවයුත්තක්ම නැත. මෙහි සෙස්සයට කියනලද ක්‍රමයෙන්ම දතයුතුයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**දුතියං** ආදියෙහිද ගණනානුක්‍රමයෙන් දෙවැනිය ආදී නයින් අර්‍ත්‍ථය දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "**මෙත්තං** යනු සියලු සතුන් කෙරෙහි හිතවත්බව පැතිරීමයි. **චෙතොවිමුත්තිං** යනු චිත්තවිමුක්තියයි. මෙහි අර්‍පණාවට පැමිණි මෛත්‍රියම අදහස් කරනලදී. කරුණා ආදියෙහිද මෙම ක්‍රමයමයි. මේ සතර බ්‍රහමවිහාරයෝ වට්ටවෙති, වට්ටපාදයෝ වෙති. විපස්සනාපාදයෝ වෙත්. දිට්ඨධම්මසුඛවිහරණයෝ වෙත්, අභිඥාපාදයෝ හෝ නිරෝධපාදයෝ හෝ වෙත්. ලෝකෝත්තර නොවෙත්. කුමක් හෙයින්දයත්? සත්වයෝ අරමුණුකොට ඇතිබැවිනි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**කායෙ කායානුපස්සී** යනු ආනාපාන පබ්බ, ඉරියාපථපබ්බ චතුසම්පජඤ්ඤපබ්බ පටිකකූලමනසිකාරපබ්බ ධාතුමනසිකාරපබ්බ, නවසීවථිකාපබ්බ අධ්‍යාත්ම පරිකර්‍ම වශයෙන් නීලකසින සතර යන මේ අටළොස් වැදැරුම් කයෙහි එම කයම ප්‍රඥාවෙන් බලන්නේයි. **විහරති** යනු ඉරියව් පවත්වයි, පවතියි මෙයින්, අටළොස් ආකාරය කායානුපස්සනා සතිපට්ඨාන භාවනාව වඩන මේ භික්‍ෂුවගේ ඉරියව් කියන ලද්දේ වෙයි**. ආතාපි** යනු ඒ කියනලද ආකාර ඇති සතිපට්ඨානභාවනාව වඩන වීර්යයෙන් වීර්‍ය්‍යවත්වූයේයි. **සම්පජානො** යනු කායානුපස්සනා සතිපට්ඨානයාගේ අටළොස් ආකාරවූ පරිග්‍රහණ ප්‍රඥාවෙන් මනාව දන්නේයි. **සතිමා** යනු කායානුපස්සනා සතිපට්ඨානයාගේ අටළොස් ආකාරවූ පරිග්‍රාහක සමෘතියෙන් යුක්ත වූයේයි. **විනෙය්‍ය ලොකෙ අභිජක්‍ධා දොමනස්සං** යනු ඒ කාය (ශරීර) සංඛ්‍යාතවූ ලොකයෙහි පඤචකාමගුණයන්ට අයත් තෘෂ්ණාවද ප්‍රතිඝසම්ප්‍රයුක්තවූ දොම්නසද දුරුකොට යටපත් කොට කයෙහි කය අනුව බලමින් වෙසේයයි කියනලද්දේ වෙයි. මෙපමණකින් කායානුපස්සනා වශයෙන් හුදුරූප (ස්කන්‍ධය) මෙනෙහි කිරීමම කියනලදැයි දතයුතුයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 591,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**වෙදනාසු වෙදනානුපස්සී**ති සුඛාදිභෙදාසු වෙදනාසු “සුඛං වෙදනං වෙදියමානො සුඛං වෙදනං වෙදියාමීති පජානාති. දුක්ඛං, අදුක්ඛමසුඛං, සාමිසං වා සුඛං, නිරාමිසං වා සුඛං, සාමිසං වා දුක්ඛං, නිරාමිසං වා දුක්ඛං, සාමිසං වා අදුක්ඛමසුඛං, නිරාමිසං වා අදුක්ඛමසුඛං වෙදනං වෙදියමානො නිරාමිසං අදුක්ඛමසුඛං වෙදනං වෙදියාමීති පජානාතී”ති (දී· නි· 2.380; විභ· 363; ම· නි· 1.113) එවං වුත්තං නවවිධං වෙදනං අනුපස්සන්තො. **ආතාපී**තිආදිනා පනෙත්ථ නවවිධෙන වෙදනානුපස්සනාසතිපට්ඨානස්ස භාවනාපරිග්ගාහිකානං වීරියපඤ්ඤාසතීනං වසෙන අත්ථො වෙදිතබ්බො. **ලොකො**ති චෙත්ථ වෙදනා වෙදිතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**චිත්තධම්මෙසු**පි එසෙව නයො. එත්ථ පන **චිත්තෙ චිත්තානුපස්සී**ති “සරාගං වා චිත්තං සරාගං චිත්තන්ති පජානාතී”ති (දී· නි· 2.381; විභ· 365; ම· නි· 1.114) එවං විත්ථාරිතෙ සොළසප්පභෙදෙ චිත්තෙ තමෙව චිත්තං පරිග්ගාහිකාය අනුපස්සනාය අනුපස්සන්තොති අත්ථො. **ධම්මෙසු ධම්මානුපස්සී**ති “පඤ්ච නීවරණානි, පඤ්චුපාදානක්ඛන්ධා, ඡ අජ්ඣත්තිකබාහිරායතනානි, සත්ත බොජ්ඣඞ්ගා, චත්තාරි අරියසච්චානී”ති (දී· නි· 2.382-403; විභ· 367-373; ම· නි· 1.115-136) එවං කොට්ඨාසවසෙන පඤ්චධා වුත්තෙසු ධම්මෙසු ධම්මපරිග්ගාහිකාය අනුපස්සනාය තෙ ධම්මෙ අනුපස්සන්තොති අත්ථො. එත්ථ පන වෙදනානුපස්සනාසතිපට්ඨානෙ ච චිත්තානුපස්සනාසතිපට්ඨානෙ ච සුද්ධඅරූපසම්මසනමෙව කථිතං, ධම්මානුපස්සනාසතිපට්ඨානෙ රූපාරූපසම්මසනං. ඉති ඉමානි චත්තාරිපි සතිපට්ඨානානි ලොකියලොකුත්තරමිස්සකානෙව කථිතානීති වෙදිතබ්බානි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අනුප්පන්නාන**න්ති අනිබ්බත්තානං. **පාපකාන**න්ති ලාමකානං. **අකුසලානං ධම්මාන**න්ති අකොසල්ලසම්භූතානං ලොභාදිධම්මානං. **අනුප්පාදායා**ති අනිබ්බත්තනත්ථාය. **ඡන්දං ජනෙතී**ති කත්තුකම්යතාකුසලච්ඡන්දං උප්පාදෙති. **වායමතී**ති පයොගං පරක්කමං කරොති. **වීරියං ආරභතී**ති කායිකචෙතසිකවීරියං කරොති. **චිත්තං පග්ගණ්හාතී**ති තෙනෙව සහජාතවීරියෙන චිත්තං උක්ඛිපති. **පදහතී**ති පධානවීරියං කරොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**උප්පන්නාන**න්ති ජාතානං නිබ්බත්තානං. **කුසලානං ධම්මාන**න්ති කොසල්ලසම්භූතානං අලොභාදිධම්මානං. **ඨිතියා**ති ඨිතත්ථං. **අසම්මොසායා**ති අනස්සනත්ථං. **භිය්යොභාවායා**ති පුනප්පුනභාවාය. **වෙපුල්ලායා**ති විපුලභාවාය. **භාවනායා**ති වඩ්ඪියා. **පරිපූරියා**ති පරිපූරණත්ථාය. අයං තාව චතුන්නං සම්මප්පධානානං එකපදිකො අත්ථුද්ධාරො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**වෙදනාසු වෙදනානුපස්සී** යනු සුඛාදී ප්‍රභේද ඇති වේදනාවන්හි ‘සුඛ වේදනාවක් විඳින්නේ සුඛවේදනාවක් විඳිමියි දනියි දුක්‍ඛවෙදනාවක් අදුක්‍ඛමසුඛවේදනාවක් - ආමිෂසහිතවූ සුඛවේදනාවක් - හෝ ආමිෂරහිතවූ සුඛවේදනාවක් හෝ - ආමිෂ සහිතවූ දුක්‍ඛවෙදනාවක් හෝ - ආමිෂ රහිතවූ දුක්‍ඛ වේදනාවක් හෝ - ආමිෂ සහිතවූ අදුක්‍ඛමසුඛ වූ වේදනාවක් හෝ - ආමිෂ රහිතවූ අදුක්‍ඛමසුඛ වේදනාවක් හෝ - විඳිමින් ආමිෂ රහිතවූ අදුක්‍ඛමසුඛ වේදනාවක් විඳිමියි දනියි’ මෙසේ කියනලද නවවිධවූ වේදනානුපස්සනා සතිපට්ඨානයාගේ භාවනා පරිග්‍රහිකයන්ගේ වීර්ය ප්‍රඥා සති වශයෙන් අර්‍ත්‍ථය දතයුතුයි. මෙහි **ලොකො **යනු ඒ වේදනාවම දතයුතුයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "චිත්තධර්‍මයන්හිද මේ ක්‍රමයමයි. මෙහි වනාහි **චිත්තෙ චිත්තානුපස්සී** යනු ‘රාග සහිතවූ සිත රාගසහිත සිතයයි දැනගනී’ මෙසේ විස්තර කරනලද සොළොස් ආකාර සිතෙහි ඒ සිතම ච්ත්තපරිග්‍රාහිකවූ අනුපස්සනාවෙන් සිහිකරන්නේ යනු අර්‍ත්‍ථයයි. **ධම්මෙසු ධම්මානුපස්සී** යනු පංචනීවරණ, පංචඋපාදානක්‍ඛන්‍ධ, ආධ්‍යාත්මික බාහිර ආයතනසය, බොධංග සත ආර්‍ය්‍යසත්‍ය සතරයයි මෙසේ කොටස් වශයෙන් පස් ආකාරයයි. කියනලද ධර්‍මයන්හි ධර්‍මපරිග්‍රාහක අනුපස්සනාවෙන් ඒ ධර්‍මයන් සිහිකරන්නේයි අර්‍ත්‍ථයි. මෙහි වනාහි වේදනානුපසසනා සතිපට්ටානයෙහිද චිත්තානුපස්සනා සතිපට්ඨානයෙහිද හුදු අරූප (ස්කන්‍ධ)ය සිහිකිරීමම කියනලදී. ධම්මානුපස්සනා සති පට්ඨානයෙහි රූප අරූප සිහිකිරීමයි. මේ ලෞකික ලෝකොත්තර වශයෙන් මිශ්‍රවූම මේ සතර සතිපට්ඨාන කියනලදැයි දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අනුප්පන්නානං** යනු නුපන්නවුන්ගේයි. **පාපකානං** යනු ලාමකවූවන්ගේයි. **අකුසලානං ධම්මානං** යනු අදක්‍ෂතාවෙන් (අකුසල බවින්) හටගත් ලෝභාදී ධර්‍මයන්ගේයි**. අනූප්පාදාය** යනු නොඉපදවීම සඳහායි. **ඡන්‍දං ජනෙති** යනු කරනු කැමති කුසලය පිළිබඳ කැමැත්ත උපදවයි. වායමති යනු ප්‍රයෝගය උත්සාහය කරයි. **විරියං ආරහති** යනු කායිකවූ හා චෛතසිකවූ වීර්ය කරයි. **චිත්තං පග්ගණ්හාති** යනු ඒ සමඟ උපන් වීර්‍ය්‍යයෙන්ම සිත ඔසවයි. **චිත්තං පග්ගණහාති** යනු ඒ සමඟ උපන් වීර්‍ය්‍යයෙන්ම සිත ඔසවයි**. පදහති** යනු පධන් වීර්යය කරයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**උප්පන්නානං** යනු හටගත්තවුන්ගේ උපන්නවුන්ගේයි. **කුසලානං ධම්මානං** යනු දක්‍ෂතාවෙන් හටගත් අලෝභාදී ධර්‍මයන්ගේයි. **ඨිතියා** යනු සිටීම (පැවැතීම) සඳහායි. **අසම්මොසාය** යනු නොමුළා බව සඳහායි. **භීය්‍යොභාවාය** යනු නැවත නැවත බව සඳහාය. **වෙපුල්ලාය** යනු බොහෝ බව සඳහායි. **භාවනාය** යනු වැඩීම සඳහායි. **පරිපූරියා **යනු සම්පූර්‍ණකරනු සඳහායි. මේ වනාහි සතර සම්‍යක් ප්‍රධානවීර්යයේ එක් පදයකට අයත්වූ අර්‍ත්‍ථමතුකොට දැක්වීමයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 593,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අයං පන සම්මප්පධානකථා නාම දුවිධා ලොකියා ලොකුත්තරා ච. තත්ථ ලොකියා සබ්බපුබ්බභාගෙ හොති, සා කස්සපසංයුත්තපරියායෙන ලොකියමග්ගක්ඛණෙයෙව වෙදිතබ්බා. වුත්තඤ්හි තත්ථ –"
                    },
                    {
                        "type": "paragraph",
                        "text": "“චත්තාරොමෙ, ආවුසො, සම්මප්පධානා. කතමෙ චත්තාරො? ඉධාවුසො, භික්ඛු ‘අනුප්පන්නා මෙ පාපකා අකුසලා ධම්මා උප්පජ්ජමානා අනත්ථාය සංවත්තෙය්යු’න්ති ආතප්පං කරොති, ‘උප්පන්නා මෙ පාපකා අකුසලා ධම්මා අප්පහීයමානා අනත්ථාය සංවත්තෙය්යු’න්ති ආතප්පං කරොති, ‘අනුප්පන්නා මෙ කුසලා ධම්මා අනුප්පජ්ජමානා අනත්ථාය සංවත්තෙය්යු’න්ති ආතප්පං කරොති, ‘උප්පන්නා මෙ කුසලා ධම්මා නිරුජ්ඣමානා අනත්ථාය සංවත්තෙය්යු’න්ති ආතප්පං කරොතී”ති (සං· නි· 2.145)."
                    },
                    {
                        "type": "paragraph",
                        "text": "එත්ථ ච **පාපකා අකුසලා**ති ලොභාදයො වෙදිතබ්බා. **අනුප්පන්නා කුසලා ධම්මා**ති සමථවිපස්සනා චෙව මග්ගො ච. **උප්පන්නා කුසලා** නාම සමථවිපස්සනාව. මග්ගො පන සකිං උප්පජ්ජිත්වා නිරුජ්ඣමානො අනත්ථාය සංවත්තනකො නාම නත්ථි. සො හි ඵලස්ස පච්චයං දත්වාව නිරුජ්ඣති. පුරිමස්මිම්පි වා සමථවිපස්සනාව ගහෙතබ්බාති වුත්තං, තං පන න යුත්තං. එවං ලොකියා සම්මප්පධානකථා සබ්බපුබ්බභාගෙ කස්සපසංයුත්තපරියායෙන වෙදිතබ්බා. ලොකුත්තරමග්ගක්ඛණෙ පනෙතං එකමෙව වීරියං චතුකිච්චසාධනවසෙන චත්තාරි නාමානි ලභති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ථ **අනුප්පන්නානං පාපකාන**න්ති එත්ථ “අනුප්පන්නො චෙව කාමච්ඡන්දො”තිආදීසු වුත්තනයෙන අත්ථො වෙදිතබ්බො. **උප්පන්නානං පාපකාන**න්ති එත්ථ චතුබ්බිධං උප්පන්නං වත්තමානුප්පන්නං, භුත්වාවිගතුප්පන්නං, ඔකාසකතුප්පන්නං, භූමිලද්ධුප්පන්නන්ති. තත්ථ යෙ කිලෙසා විජ්ජමානා උප්පාදාදිසමඞ්ගිනො, ඉදං **වත්තමානුප්පන්නං** නාම. කම්මෙ පන ජවිතෙ ආරම්මණරසං අනුභවිත්වා නිරුද්ධවිපාකො භුත්වා විගතං නාම, කම්මං උප්පජ්ජිත්වා නිරුද්ධං භුත්වා විගතං නාම. තදුභයම්පි **භුත්වාවිගතුප්පන්න**න්ති සඞ්ඛං ගච්ඡති. කුසලාකුසලකම්මං අඤ්ඤකම්මස්ස විපාකං පටිබාහිත්වා අත්තනො විපාකස්ස ඔකාසං කරොති, එවං කතෙ ඔකාසෙ විපාකො උප්පජ්ජමානො ඔකාසකරණතො පට්ඨාය උප්පන්නොති වුච්චති, ඉදං **ඔකාසකතුප්පන්නං** නාම. පඤ්චක්ඛන්ධා පන විපස්සනාය භූමි නාම, තෙ අතීතාදිභෙදා හොන්ති. තෙසු අනුසයිතකිලෙසා පන අතීතා වා අනාගතා වා පච්චුප්පන්නා වාති න වත්තබ්බා. අතීතක්ඛන්ධෙසු අනුසයිතාපි හි අප්පහීනාව හොන්ති, අනාගතක්ඛන්ධෙසු අනුසයිතාපි අප්පහීනාව හොන්ති, පච්චුප්පන්නක්ඛන්ධෙසු අනුසයිතාපි අප්පහීනාව හොන්ති, ඉදං **භූමිලද්ධුප්පන්නං** නාම. තෙනාහු පොරාණා – “තාසු තාසු භූමිසු අසමුග්ඝාතගතා කිලෙසා භූමිලද්ධුප්පන්නාති සඞ්ඛං ගච්ඡන්තී”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "මේ සම්‍යක්ප්‍රධාන කථාව ලෞකික ලෝකෝතර වශයෙන් ද්විවිධය. එහි ලෞකික (සම්‍යක් ප්‍රධාන)ය සියල්ලන්ට පූර්‍වභාගයෙහි වෙයි. එය කාශ්‍යප සංයුක්ත පර්යායෙන් ලෞකික ලෝකෝතර වශයෙන් ද්විවිධය. එහි ලෞකික (සම්‍යක් ප්‍රධාන)ය සියල්ලන්ට පූර්‍වභාගයෙහි වෙයි. එය කාශ්‍යප සංයුක්ත පර්යායයෙන් ලෞකික මාර්‍ගක්‍ෂණයෙදී දතයුතුය. එහි කියනලද්දේමය."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘ඇවැත්නි, මේ සම්‍යක් ප්‍රධානයෝ සතරෙකි. කවර සතරක් යත්? ඇවැත්නි, මෙහි භික්‍ෂුවක් මාගේ නූපන්නාවූ පවිටු අකුශලධර්‍මයෝ උපදිනු ලබන්නාහු අනර්‍ත්‍ථය සඳහා පවතිතැයි වීර්‍ය්‍යකරයි. මාගේ උපන්නාවූ කුශලධර්‍මයෝ නිරුද්ධවනු ලබන්නාහු අනර්‍ත්‍ථය සඳහා පවතිතැයි වීර්යකරයි යනුවෙනි."
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙහිද පවිටු අකුශලයෝ යනු ලෝභදීහුයයි දතයුත්තාහ. නූපන් කුශලධර්‍මයෝ යනු සමථ විදර්‍ශනා මෙන්ම මාර්‍ගයද වෙත්. උපන් කුශලයෝ නම් සමථවිදර්‍ශනයෝමැයි. මාර්‍ගය වනාහි වරක් ඉපිද නිරුද්ධවනුලබන්නේ අනර්‍ත්‍ථය සඳහා පවතින්නේ නම් නොවේ. එය වනාහි ඵලයට ප්‍රත්‍යය දී (හේතුව වී)ම නිරුද්ධ වෙයි. මුල් එකෙහි හෝ සමථවිදර්‍ශන ගතයුතුයි කියනලදී. එය නොසුදුසුය. මෙසේ ලෞකික සම්‍යක්ප්‍රධාන කථාව සියල්ලන්ම පූර්‍වභාගයෙහි කාශ්‍යප සංයුක්ත පර්යායයෙන් දතයුතුය. ලෝකෝත්තර මාර්‍ගක්‍ෂණයෙහිදී මේ එකම වීර්යය කෘත්‍ය සතරක් කිරීම් වශයෙන් නම් සතරක් ලබයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "එහි **අනුප්පන්නානං පාපකානං** යන මෙහි නූපන්නාවූම කාමච්ඡන්‍දය යනාදියෙහි කියන ලද ක්‍රමයෙන් අර්‍ත්‍ථය දතයුතුයි. **උප්පන්නානං පාපකානං** යන මෙහි උප්පන්න (උපන්) යනු සතරාකාරය: වත්තමානුප්පන්නය, භූත්‍වා විගතුප්පන්නය, ඔකාසකතුප්පන්නය, භූමිලද්ධුප්පන්නය යනුවෙනි. එහි උත්පාදාදියෙන් යුක්තවූ යම් කෙලෂයක් විද්‍යමාන වේද? මෙය වත්තමානුප්පන්න නම්වෙයි. කර්‍මය ජවනය වූවිට ආරම්මණ රසය අනුභව කොට නිරුද්ධවූ විපාක ඇත්තේ භුත්‍වා විගත නමි. කර්‍මයි ඉපිද නිරුද්ධවී විගත (පහවූයේ) නමි. ඒ දෙකම විඳ විගතුප්පන්නයයි පළටවෙයි. කුශලාකුශල කර්‍මය වෙනත් කර්‍මයක විපාකය යටපත්කොට තමාගේ විපාකයට ඉඩ සලසයි. මෙසේ කරනලද අවකාශ ඇති කල්හි උපදිනු ලබන විපාකය ඉඩ සැලසීමෙහි පටන් උපන්නේයයි කියනුලැබේ. මෙය ඔකාසකතුප්පන්න නමි. පංචස්කන්‍ධයෝ වනාහි විදර්‍ශනාවට භූමි නමි. ඔවුහු අතීතාදි භේද ඇත්තෝ වෙත්. ඔවුනතුරෙන් අනුසයගත (අනුසය බවට පත්වූ) කෙලෂයෝ අතීතවූවෝ හෝ අනාගතවූවෝ හෝ වර්‍තමානවූවෝ හෝයි නොකිව යුත්තාහ. අතීතසකන්‍ධයන්හි අනුශයගතවූවාහුද අප්‍රහීණවූවෝම වෙත්. මෙය භූමිලද්ධුප්පන්න නමි. එහෙයින් පෝරාණයෝ මෙසේ කීහ, ‘ඒ ඒ භූමීන්හි විනාශ නොවූ කෙළෂයෝ භූමිලද්ධුප්පන්න නමැයි ප්‍රසිද්ධියට යති’."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 595,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අපරම්පි චතුබ්බිධං උප්පන්නං සමුදාචාරුප්පන්නං, ආරම්මණාධිග්ගහිතුප්පන්නං, අවික්ඛම්භිතුප්පන්නං, අසමුග්ඝාතිතුප්පන්නන්ති. තත්ථ සම්පති වත්තමානංයෙව **සමුදාචාරුප්පන්නං** නාම. සකිං චක්ඛූනි උම්මීලෙත්වා ආරම්මණෙ නිමිත්තෙ ගහිතෙ අනුස්සරිතානුස්සරිතක්ඛණෙ කිලෙසා නුප්පජ්ජිස්සන්තීති න වත්තබ්බා. කස්මා? ආරම්මණස්ස අධිග්ගහිතත්තා. යථා කිං? යථා ඛීරුක්ඛස්ස කුඨාරියා ආහතාහතට්ඨානෙ ඛීරං න නික්ඛමිස්සතීති න වත්තබ්බා, එවං. ඉදං **ආරම්මණාධිග්ගහිතුප්පන්නං** නාම. සමාපත්තියා අවික්ඛම්භිතකිලෙසා පන ඉමස්මිං නාම ඨානෙන උප්පජ්ජිස්සන්තීති න වත්තබ්බා. කස්මා? අවික්ඛම්භිතත්තා. යථා කිං? යථා ඛීරරුක්ඛං කුඨාරියා ආහනෙය්යුං, ඉමස්මිං නාම ඨානෙ ඛීරං න නික්ඛමෙය්යාති න වත්තබ්බං, එවං. ඉදං **අවික්ඛම්භිතුප්පන්නං** නාම. මග්ගෙන අසමුග්ඝාතිතකිලෙසා පන භවග්ගෙ නිබ්බත්තස්සාපි උප්පජ්ජන්තීති පුරිමනයෙනෙව විත්ථාරෙතබ්බං. ඉදං **අසමුග්ඝාතිතුප්පන්නං** නාම."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙසු උප්පන්නෙසු වත්තමානුප්පන්නං, භුත්වාවිගතුප්පන්නං, ඔකාසකතුප්පන්නං, සමුදාචාරුප්පන්නන්ති චතුබ්බිධං උප්පන්නං න මග්ගවජ්ඣං, භූමිලද්ධුප්පන්නං, ආරම්මණාධිග්ගහිතුප්පන්නං, අවික්ඛම්භිතුප්පන්නං, අසමුග්ඝාතිතුප්පන්නන්ති චතුබ්බිධං මග්ගවජ්ඣං. මග්ගො හි උප්පජ්ජමානො එතෙ කිලෙසෙ පජහති. සො යෙ කිලෙසෙ පජහති, තෙ අතීතා වා අනාගතා වා පච්චුප්පන්නා වාති න වත්තබ්බා. වුත්තම්පි චෙතං –"
                    },
                    {
                        "type": "paragraph",
                        "text": "“හඤ්චි අතීතෙ කිලෙසෙ පජහති? තෙන හි ඛීණංයෙව ඛෙපෙති, නිරුද්ධං නිරොධෙති, අත්ථඞ්ගතං අත්ථඞ්ගමෙති, අතීතං යං නත්ථි, තං පජහති. හඤ්චි අනාගතෙ කිලෙසෙ පජහති? තෙන හි අජාතං පජහති, අනිබ්බත්තං අනුප්පන්නං අපාතුභූතං පජහති, අනාගතං යං නත්ථි, තං පජහති. හඤ්චි පච්චුප්පන්නෙ කිලෙසෙ පජහති? තෙන හි රත්තො රාගං පජහති, දුට්ඨො දොසං, මූළ්හො මොහං, විනිබද්ධො මානං, පරාමට්ඨො දිට්ඨිං, අනිට්ඨඞ්ගතො විචිකිච්ඡං, ථාමගතො අනුසයං පජහති, කණ්හසුක්කා ධම්මා යුගනද්ධා වත්තන්ති, සංකිලෙසියා මග්ගභාවනා හොතීති…පෙ… තෙන හි නත්ථි මග්ගභාවනා, නත්ථි ඵලසච්ඡිකිරියා, නත්ථි කිලෙසප්පහානං, නත්ථි ධම්මාභිසමයොති. අත්ථි මග්ගභාවනා…පෙ… අත්ථි ධම්මාභිසමයොති. යථා කථං විය? සෙය්යථාපි තරුණො රුක්ඛො…පෙ… අපාතුභූතායෙව න පාතුභවන්තී”ති (පටි· ම· 3.21)."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "වෙනත් සතරාකාරවූ උප්පන්නයක්ද වෙයි. සමුදාචාරුප්පන්න ආරම්මණාධිග්ගහිතුප්පන්න, අවික්‍ඛමභුතුප්පන්න, අසමුගඝාතිතුප්පන්න යනුවෙනි. එහි දැන් වර්‍තමානයම සමුදාචාරුප්පන්න නමි. වරක් ඇස් හැර අරමුණෙහි නිමිති ගත් කල්හි සිහිකළ සිහිකළ කෙණෙහි කෙලෙස් නූපදිතැයි නොකිව යුතුය. කුමක් හෙයින්දයත්? අරමුණ දැඩිව ගෙන ඇති බැවිනි. කුමක් මෙන්දයත්? යම්සේ කිරිගසකට කෙටේරියෙන් ගැසූ ගැසූ තැන කිරි නොනික්මේයයි නොකිව යුතුද එමෙන්ම මෙය අරමුණ දැඩිව ගෙන උපන්නේ නම්, සමවතින් යටපත් නොකළ කෙලෙස් මෙනම්වූ තන්හි නූපදින්නේයයි නොකිව යුතුය. කුමක් හෙයින්දයත්? යටපත් කරනලද බැවිනි, කුමක් මෙන්දයත්? යම් සේ ඉදින් කිරිගසට කෙට්රියෙන් අනීද මෙනම් තැන්හි කිරි නොනික්මෙන්නේයයි නොකිවයුතුය. මෙසේ මෙය අවික්‍ඛම්හිතුප්පන්න නමි. මාර්‍ගයෙන් විනාශ නොකළ කෙලෙස් භවාග්‍රයෙහි උපන්නහුටද හට ගනිතැයි පෙර ක්‍රමයෙන්ම විස්තර කළයුතුය. මෙය අසමුග්ඝාතිතඋපන්න නමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "මේ උත්පන්නයන් අතුරින් වත්තමානුප්පන්නය, භූත්‍වා විගතුප්පන්නය ඔකාසකතුප්පන්නය, සමුදාචාරුප්පන්නය යන සතරාකාර උප්පන්නය මාර්‍ගවධ්‍ය (මාර්‍ගයෙන් විනාශ කළයුතු) නොවෙයි. භූමිලද්ධුප්පන්නය, ආරම්මණාධිග්ගහිතුප්පන්නය අවික්‍ඛම්හිතුප්පන්නය අසමුග්ඝාතිතුප්පන්නය යන සතරාකාරය මාර්‍ගවධ්‍ය නමි. මාර්‍ගග උපදින්නේ මේ කෙලෙසුන් දුරලයි. එය යම් කෙලෙසුන් දුරලයිද ඒ කෙලෙස් අතීතය, අනාගතය වර්‍තමානයයි නොකිව යුතුය. මෙය කියන ලද්දේවෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘ඉදින් අතීත කෙලෙසුන් දුරලයිනම්? එසේ වීනම් ක්‍ෂයවුවක්ම ක්‍ෂයකරවයි. නැතිවූ දෙයක් නැතිකරවයි. අසතංගතවූවක් අසතංගතකරවයි. අතීතවූ යමක් නැත්ද එය දුරුකරයි. අනාගතයෙහි කෙලෙසුන් දුරලයි නම් එසේ වීනම් නොහටගත් දෙයක් දුරුකරයි. අනාගතවූ යමක් නැත්ද එය දුරලයි. වර්‍තමානයෙහි කෙලෙසුන් දුරලන්නේ නම්? එසේ වීනම් රාගීවූයේ රාගය දුරලයි. දූෂ්‍යවූයේ දේවෂයද මුළාවූයේ මෝහයද එකට බැඳුනේ මානයද සිතින් දැඩිසේ ගත්තේ දෘෂ්ටියද අවිනිශ්චිතවූයේ විචිකිච්ඡාවද තහවුරුබවට පත්වූයේ අනුසයද දුරලයි. පාපපුණ්‍යධර්‍මයෝ එකට වෙළී පවතිත්, කිලුටට පමණුවන මාර්‍ගභාවනාවක් ඇත්තේවෙයි. එහෙයින් මාර්‍ග භාවනාවක් නැත. ඵල ක්‍ෂාත් කිරීමක් නැත. කෙලෙස් දුරුකිරීමක් නැත. ධර්‍මාභිසමයක් නැත. මාර්‍ගභාවනාවක් ඇත -පෙ- ධර්‍මාභිසමයක් ඇත. කෙසේ නම්වේදයත්? යම්සේ නම් තුරුණු රුකක් -පෙ- නොහට ගත් දෙයම පහළකරත්’"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 597,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉති පාළියං අජාතඵලරුක්ඛො ආගතො, ජාතඵලරුක්ඛො පන දීපෙතබ්බො. යථා හි සඵලො තරුණම්බරුක්ඛො, තස්ස ඵලානි මනුස්සා පරිභුඤ්ජෙය්යුං, සෙසානි පාතෙත්වා පච්ඡියො පූරෙය්යුං, අථඤ්ඤො පුරිසො තං ඵරසුනා ඡින්දෙය්ය. තෙනස්ස නෙව අතීතානි ඵලානි නාසිතානි හොන්ති, න අනාගතපච්චුප්පන්නානි ච නාසිතානි. අතීතානි හි මනුස්සෙහි පරිභුත්තානි, අනාගතානි අනිබ්බත්තානි, න සක්කා නාසෙතුං. යස්මිං පන සමයෙ සො ඡින්නො, තදා ඵලානියෙව නත්ථීති පච්චුප්පන්නානිපි අනාසිතානි. සචෙ පන රුක්ඛො අච්ඡින්නො අස්ස, අථස්ස පථවීරසඤ්ච ආපොරසඤ්ච ආගම්ම යානි ඵලානි නිබ්බත්තෙය්යුං, තානි නාසිතානි හොන්ති. තානි හි අජාතානෙව න ජායන්ති, අනිබ්බත්තානෙව න නිබ්බත්තන්ති, අපාතුභූතානෙව න පාතුභවන්ති. එවමෙව මග්ගො නාපි අතීතාදිභෙදෙ කිලෙසෙ පජහති, නාපි න පජහති. යෙසඤ්හි කිලෙසානං මග්ගෙන ඛන්ධෙසු අපරිඤ්ඤාතෙසු උප්පත්ති සියා, මග්ගෙන උප්පජ්ජිත්වා ඛන්ධානං පරිඤ්ඤාතත්තා තෙ කිලෙසා අජාතාව න ජායන්ති, අනිබ්බත්තාව න නිබ්බත්තන්ති, අපාතුභූතාව න පාතුභවන්ති. තරුණපුත්තාය ඉත්ථියා පුන අවිජායනත්ථං බ්යාධිතානං රොගවූපසමනත්ථං පීතභෙසජ්ජෙහි වාපි අයමත්ථො විභාවෙතබ්බො. එවං මග්ගො යෙ කිලෙසෙ පජහති, තෙ අතීතා වා අනාගතා වා පච්චුප්පන්නා වාති න වත්තබ්බා. න ච මග්ගො කිලෙසෙ න පජහති. යෙ පන මග්ගො කිලෙසෙ පජහති, තෙ සන්ධාය “උප්පන්නානං පාපකාන”න්තිආදි වුත්තං."
                    },
                    {
                        "type": "paragraph",
                        "text": "න කෙවලඤ්ච මග්ගො කිලෙසෙයෙව පජහති, කිලෙසානං පන අප්පහීනත්තා යෙ උප්පජ්ජෙය්යුං උපාදින්නක්ඛන්ධා, තෙපි පජහතියෙව. වුත්තම්පි චෙතං – “සොතාපත්තිමග්ගඤාණෙන අභිසඞ්ඛාරවිඤ්ඤාණස්ස නිරොධෙන සත්ත භවෙ ඨපෙත්වා අනමතග්ගෙ සංසාරෙ යෙ උප්පජ්ජෙය්යුං නාමඤ්ච රූපඤ්ච, එත්ථෙතෙ නිරුජ්ඣන්තී”ති (චූළව· අජිතමාණවපුච්ඡානිද්දෙසො 6) විත්ථාරො. ඉති මග්ගො උපාදින්නතො අනුපාදින්නතො ච වුට්ඨාති. භවවසෙන පන සොතාපත්තිමග්ගො අපායභවතො වුට්ඨාති, සකදාගාමිමග්ගො සුගතිභවෙකදෙසතො, අනාගාමිමග්ගො සුගතිකාමභවතො, අරහත්තමග්ගො රූපාරූපභවතො වුට්ඨාති. සබ්බභවෙහි වුට්ඨාතියෙවාතිපි වදන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ මග්ගක්ඛණෙ කථං අනුප්පන්නානං උප්පාදාය භාවනා හොති, කථං වා උප්පන්නානං ඨිතියාති? මග්ගප්පවත්තියා එව. මග්ගො හි පවත්තමානො පුබ්බෙ අනුප්පන්නපුබ්බත්තා අනුප්පන්නො නාම වුච්චති. අනාගතපුබ්බඤ්හි ඨානං ගන්ත්වා අනනුභූතපුබ්බං වා ආරම්මණං අනුභවිත්වා වත්තාරො භවන්ති; “අනාගතට්ඨානං ආගතම්හ, අනනුභූතං ආරම්මණං අනුභවාමා”ති. යා චස්ස පවත්ති, අයමෙව ඨිති නාමාති “ඨිතියා භාවෙතී”ති වත්තුං වට්ටති. එවමෙතස්ස භික්ඛුනො ඉදං ලොකුත්තරමග්ගක්ඛණෙ වීරියං “අනුප්පන්නානං පාපකානං අකුසලානං ධම්මානං අනුප්පාදායා”තිආදීනි චත්තාරි නාමානි ලභති. අයං ලොකුත්තරමග්ගක්ඛණෙ සම්මප්පධානකථා. ඉමස්මිං පන සුත්තෙ ලොකියලොකුත්තරමිස්සකානෙව සම්මප්පධානානි කථිතානි."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "මෙසේ පෙළෙහි හට නොගත් ගෙඩි ඇති ගසක් (නිදසුන් වශයෙන්) ආයේය. හටගත් පල ඇති ගසින් දැක්විය යුතුයි. යම්සේ ගෙඩි සහිත තරුණ අඹගසක් වේද එහි ගෙඩි මිනිස්සු අනුභව කරන්නාහුද ඉතිරිවා හෙළා කූඩා පුරවන්නාහුද ඉක්බිති වෙනත් මිනිසෙක් ඒ ගස පොරොවෙන් කපන්නේද ඒ හේතුවෙන් ඒ ගසේ ඉකුත් ගෙඩි නසනලද්දේ නොවෙයි. අතීත ගෙඩි මිනිසුන් විසින් අනුභවකරනලදී. අනාගත ගෙඩි නොනිපැයිණි. නැසීමට නොහැකිය. යම් විටෙක ඒ ගස සිඳිනලද්දේද එවිට ගෙඩිද නැතැයි වත්මන් ගෙඩිද නොනසනලද්දේය. ඉදින් ගස නොසිඳිනලද්දේවේද? ඉක්බිති ඊට පොළෝරසයද ජලරසයද පැමිණ යම් ගෙඩි හටගන්වයිද ඒවා නසනලද්දේවේද? ඉක්බිති ඊට පොළෝ රසයද ජලරසයද පැමිණ යම් ගෙඩි හටගන්වයිද ඒවා නසනලද්දේ වෙයි. නූපන් ඒවා නූපදියි. නොනිපන් ඒවා නොනිපැයෙයි. නොපහළවූ ඒවා පහළ නොවෙයි. මෙසේම මාර්‍ගයද අතීතාදි භේද ඇති කෙලෙසුන් දුරුනොකරයි. නොද නොදුරු කරන්නේද වෙයි. යම් වූ කෙලෙසුන්ට මාර්‍ගයෙන් මනාව පිරිසිඳ නොදත් ස්කන්‍ධයන්හි උපතක් වේද? මාර්‍ගයෙන් ඉපිද ස්කන්‍ධයන් මනාව පිරිසිඳ දත් හෙයින් ඒ කෙලෙස් නොහටගත්තේම නොඋපදියි. නූපන්නේම නොහට ගනියි. පහළ නොවූයේම නොපහළ වෙයි. තරුණ පුතුන් ඇති ස්ත්‍රියක විසින් නැවත (දරුවන්) නොවදනු සඳහාද රෝගාදියෙන් පෙළුනවුන්ගේ රෝග සංසිඳීම සඳහාද බොනලද බෙහෙත්වලින්ද මේ අර්‍ත්‍ථය ප්‍රකට කළයුතුය. මෙසේ මාර්‍ගය යම් කෙලෙසුන් දුරුකරයිද ඒවා අතීත හෝ අනාගත හෝ වර්‍තමාන හෝයයි නොකිවයුතුය. [missing trans]"
                    },
                    {
                        "type": "paragraph",
                        "text": "මාර්‍ගය කෙලෙසුන් පමණක්ම දුරුනොකරයි. කෙලෙසුන් ප්‍රහීණ නොවී ඇති බැවින් යම් උපාදිණ්ණ ස්කන්‍ධයෝ උපදින්නාහුද ඒවාද දුරුකරන්නේමය. මෙය කියනලද්දේම වෙයි සොතාපත්ති මාර්‍ග ඥානයෙන් කර්‍ම රැස්කරන විඥානයාගේ නිරුද්ධවීම හේතුකොටගෙන සත්වභවය හැර අග්මුල් නැති සසරෙහි යම් කෙලෙස් නාමයද රූපයද උපදවයිද ඒවා මෙහි නිරුද්ධ වේය යනු විස්තරයයි. මෙසේ මාර්‍ගය උපාදින්න ආනුපාදින්නයන්ගෙන් නැඟිසිටියි. භව වශයෙන් වනාහි සොතාපත්ති මාර්‍ගය අපාය භවයෙන් නැඟී සිටියි. සකෘදාගාමී මාර්‍ගය සුගති භවයෙහි එක් කොටසකින් නැඟී සිටියි. අනාගාමී මාර්‍ගය සුගතිකාමභවයෙන් නැඟී සිටියි. අර්හත්මාර්‍ගය රූපාරූප භවයන්ගෙන් නැඟී සිටියි. සියලු භවයන්ගෙන් නැඟී සිටින්නේමයයි කියති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉක්බිති මාර්‍ගක්‍ෂණයෙහි නූපන්නවුන්ගේ ඉපදවීම සඳහා කෙසේ නම් භාවනාව වේද? කෙසේ නම් උපන්නවුන්ගේ පැවැත්ම සඳහා හෝ වේද? මාර්‍ගය පැවතීමෙහිදීමය. පවත්නාවූ මාර්‍ගය වනාහි පෙර නූපන්වරූ හෙයින් නූපන්නේ නමැයි කියනුලැබේ. නොආවිරූ තැනට ගොස් නොවිඳිවිරූ අරමුණ හෝ විඳ නොආ තැනට පැමිණියෙමු. නොවිඳි අරමුණු වින්දෙමු’යි කියන්නෝ වෙත්. එහි පැවැත්ම යම්තාක්ද මෙයම ඨිතිය නමැයි පැවැත්ම සඳහා වඩන්නේයයි කීමට වටී. මෙසේ මේ භික්‍ෂුවගේ ලො‍්කෝත්තර මාර්‍ගක්‍ෂණයෙහි මේ වීර්ය නූපන්නාවූ පවිටු අකුශලයන්ගේ නොඉපදවීම සඳහායි ආදී නම් සතර ලබයි. මේ ලෝකෝත්තර මාර්‍ගක්‍ෂණයෙහි සම්‍යක්ප්‍රධාන කථාවයි. මේ සූත්‍රයෙහිදී ලෞකික ලෝකෝත්තර වශයෙන් මිශ්‍රවූම සම්‍යක්ප්‍රධාන කියනලදී."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 599,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉද්ධිපාදෙසු ඡන්දං නිස්සාය පවත්තො සමාධි **ඡන්දසමාධි,** පධානභූතා සඞ්ඛාරා **පධානසඞ්ඛාරා. සමන්නාගත**න්ති තෙහි ධම්මෙහි උපෙතං. ඉද්ධියා පාදං, ඉද්ධිභූතං වා පාදන්ති **ඉද්ධිපාදං**. සෙසෙසුපි එසෙව නයො. අයමෙත්ථ සඞ්ඛෙපො, විත්ථාරො පන ඉද්ධිපාදවිභඞ්ගෙ (විභ· 431 ආදයො) ආගතො එව. විසුද්ධිමග්ගෙ (විසුද්ධි· 2.382) පනස්ස අත්ථො දීපිතො. තත්රායං භික්ඛු යදා ඡන්දාදීසු එකං ධුරං නිස්සාය විපස්සනං වඩ්ඪෙත්වා අරහත්තං පාපුණාති, තදාස්ස පඨමිද්ධිපාදො පුබ්බභාගෙ ලොකියො, අපරභාගෙ ලොකුත්තරො. එවං සෙසාපීති. ඉමස්මිම්පි සුත්තෙ ලොකියලොකුත්තරාව ඉද්ධිපාදා කථිතා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සද්ධින්ද්රියං භාවෙතී**තිආදීසු සද්ධාව අත්තනො සද්ධාධුරෙ ඉන්දට්ඨං කරොතීති **සද්ධින්ද්රියං. වීරියින්ද්රියා**දීසුපි එසෙව නයො. **භාවෙතී**ති එත්ථ පන ආදිකම්මිකො යොගාවචරො තීහි කාරණෙහි සද්ධින්ද්රියං විසොධෙන්තො සද්ධින්ද්රියං භාවෙති නාම. වීරියින්ද්රියාදීසුපි එසෙව නයො. වුත්තඤ්හෙතං –"
                    },
                    {
                        "type": "paragraph",
                        "text": "“අස්සද්ධෙ පුග්ගලෙ පරිවජ්ජයතො, සද්ධෙ පුග්ගලෙ සෙවතො භජතො පයිරුපාසතො, පසාදනීයෙ සුත්තන්තෙ පච්චවෙක්ඛතො ඉමෙහි තීහාකාරෙහි **සද්ධින්ද්රියං** විසුජ්ඣති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“කුසීතෙ පුග්ගලෙ පරිවජ්ජයතො, ආරද්ධවීරියෙ පුග්ගලෙ සෙවතො භජතො පයිරුපාසතො, සම්මප්පධානෙ පච්චවෙක්ඛතො ඉමෙහි තීහාකාරෙහි **වීරියින්ද්රියං** විසුජ්ඣති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“මුට්ඨස්සතී පුග්ගලෙ පරිවජ්ජයතො, උපට්ඨිතස්සතී පුග්ගලෙ සෙවතො භජතො පයිරුපාසතො, සතිපට්ඨානෙ පච්චවෙක්ඛතො ඉමෙහි තීහාකාරෙහි **සතින්ද්රියං** විසුජ්ඣති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අසමාහිතෙ පුග්ගලෙ පරිවජ්ජයතො, සමාහිතෙ පුග්ගලෙ සෙවතො භජතො පයිරුපාසතො, ඣානවිමොක්ඛෙ පච්චවෙක්ඛතො ඉමෙහි තීහාකාරෙහි **සමාධින්ද්රියං** විසුජ්ඣති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“දුප්පඤ්ඤෙ පුග්ගලෙ පරිවජ්ජයතො, පඤ්ඤවන්තෙ පුග්ගලෙ සෙවතො භජතො පයිරුපාසතො, ගම්භීරඤාණචරියං පච්චවෙක්ඛතො ඉමෙහි තීහාකාරෙහි **පඤ්ඤින්ද්රියං** විසුජ්ඣතී”ති (පටි· ම· 1.184-185)."
                    },
                    {
                        "type": "paragraph",
                        "text": "එත්ථ ච **ගම්භීරඤාණචරියං පච්චවෙක්ඛතො**ති සණ්හසුඛුමං ඛන්ධන්තරං, ආයතනන්තරං, ධාතන්තරං, ඉන්ද්රියබලබොජ්ඣඞ්ගන්තරං, මග්ගන්තරං, ඵලන්තරඤ්ච පච්චවෙක්ඛන්තස්සාති අත්ථො. ඉමෙසඤ්හි තිණ්ණං තිණ්ණං කාරණානං වසෙන අකතාභිනිවෙසො ආදිකම්මිකො යොගාවචරො සද්ධාධුරාදීසු අභිනිවෙසං පට්ඨපෙත්වා භාවෙන්තො අවසානෙ විවට්ටෙත්වා අරහත්තං ගණ්හති. සො යාව අරහත්තමග්ගා ඉමානි ඉන්ද්රියානි භාවෙති නාම, අරහත්තඵලෙ පත්තෙ භාවිතින්ද්රියො නාම හොතීති. එවං ඉමානිපි පඤ්චින්ද්රියානි ලොකියලොකුත්තරානෙව කථිතානීති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සෘද්ධිපාදයන්හි ඡන්‍දය ඇසුරු කොට පැවති සමාධි **ඡන්‍දසමාධියි.** ප්‍රධානවූ සංස්කාරයෝ** පධානසංඛාරා** නමි. **සමන්නාගතං** යනු ඒ ධර්‍මයන්ගෙන් යුක්තවූයේයි. සෘද්ධියෙහි පාදය හෝ සෘද්ධමයවූ පාදය **ඉද්ධිපාද **නමි. සෙස්සෙහිද මේ ක්‍රමයමැයි. මේ මෙහි සංක්ෂේපයයි. විස්තරය වනාහි සෘද්ධිපාද විභංගයෙහි ආයේය. විසුද්ධිමග්ගයෙහි මෙහි අර්‍ත්‍ථය දක්වන ලදී. එහි මේ භික්‍ෂුව යම් විටෙක ඡන්දාදීන් අතුරෙන් එක් ධූරයක් ඇසුරු කොට විදර්‍ශනාව වඩා රහත් බවට පැමිණෙයිද එවිට ඔහුගේ ප්‍රථම සෘද්ධිපාදය පූර්‍වභාගයෙහි ලෞකිකද අපරභාගයෙහි ලෝකෝත්තරද වෙයි. සෙස්සෝද එසේමය. මේ සූත්‍රයෙහිද ලෞකික ලෝකෝත්තර සෘද්ධිපාදයෝ කියන ලද්දාහ."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සද්ධින්‍ද්‍රියංභාවෙති** යනාදියෙහි ශ්‍රද්ධාවම තමාගේ ශ්‍රද්ධාධුරයෙහි ප්‍රධානතැන කරන්නෙනුයි **සද්ධින්‍ද්‍රියං **නමි. විරියින්‍ද්‍රියාදියෙහිද මේ ක්‍රමයමැයි. භාවෙති යන මෙහි වනාහි ආදිකර්මික වූ යෝගාවචර තෙමේ කරුණු තුනකින් ශ්‍රද්ධා ඉන්‍ද්‍රිය පිරිසිදු කරන්නේ ශ්‍රද්ධා ඉන්‍ද්‍රි වඩයි නම් වේ. වීර්ය ඉන්‍ද්‍රියාදියෙහිද මේ ක්‍රමයමැයි. මෙය කියනලද්දේමය."
                    },
                    {
                        "type": "paragraph",
                        "text": "සැදැහැවත් නොවන පුද්ගලයන් දුරලීමෙන් සැදැහැවත් පුද්ගලයන් සේවනය කිරීමෙන් ඇසුරු කිරීමෙන් එක්ව විසීමෙන් පහදවනසුලු සූත්‍රාන්තයන් සිහි කිරීමෙන් යන මේ තුන් ආකාරයෙන් ශ්‍රද්ධා ඉන්‍ද්‍රිය පිරිසුදුවෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කුසීත පුද්ගලයන් දුරලීමෙන් පටන්ගත් වීර්ය ඇති පුද්ගලයන් ඇසුරු කිරීමෙන් සේවනය කිරීමෙන් එක්ව විසීමෙන් සම්‍යක්ප්‍රධාන වීර්ය සිහි කිරීමෙන් යන මේ තුන් කරුණින් වීර්යඉන්‍ද්‍රිය පිරිසුදුවෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "මුළාවූ සිහි ඇති පුද්ගලයන් දුරලීමෙන් එළඹසිටි සිහිය ඇති පුද්ගලයන් ඇසුරු කිරීමෙන් සේවනය කිරීමෙන් එක්ව විසීමෙන් සතිපට්ඨානය සිහි කිරීමෙන් යන මේ තුන් කරුණින් සමෘති ඉන්‍ද්‍රිය පිරිසුදුවෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමාහිත නොවූ (සිත් එකඟ නොවූ) පුද්ගලයන් දුරලීමෙන් සමාහිත පුද්ගලයන් ඇසුරු කිරීමෙන් සේවනය කිරීමෙන් එක්ව විසීමෙන් ධ්‍යාන විමොක්‍ෂයන් සිහිකිරීමෙන් යන මේ තුන් කරුණින් සමාධින්‍ද්‍රිය පිරිසිදුවෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අනුවණ පුද්ගලයන් දුරලීමෙන් නුවණැති පුද්ගලයන් ඇසුරු කිරීමෙන් සේවනය කිරීමෙන් එක්ව විසීමෙන් ගැඹුරු ඥාන චර්යාව සිහි කිරීමෙන් යන මේ තුන් කරුණින් පුඥ ඉන්‍ද්‍රිය පිරිසුදුවෙයි.’"
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙහිද ගැඹුරු ඥානචර්යාව සිහි කිරීමෙන් යනු මෙලෙක් සියුම් ස්කන්‍ධ අන්තරය, ධාතු අන්තරය, ආයතන අන්තරය, ඉන්‍ද්‍රිය බල බොජ්ක්‍ධංග අන්තරය මාර්‍ග අන්තරය, හාඵල අන්තරයද සිහි කරන්නාට යනු අර්‍ත්‍ථයි. මේ තුන් තුන් කරුණු වශයෙන් සිත පිහිටුවීම් නොකළ ආදි කර්මිකවූ යෝගාවචර තෙමේ ශ්‍රද්ධාධුර ආදියෙහි සිත පිහිටුවා භාවනා කරමින් අවසානයෙහි විවර්තනය කොට රහත්බව ගනියි. හෙතෙම රහත් මග දක්වා මේ ඉන්‍ද්‍රියයන් වඩයි නමි. රහත්ඵලයට පැමිණිකල්හි වැඩූ ඉන්‍ද්‍රිය ඇත්තේ නමි. මෙසේ මේ ලෞකික ලෝකෝත්තර පඤ්ච ඉන්‍ද්‍රියයෝද කියනලද්දාහුය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 601,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සද්ධාබලාදීසු සද්ධායෙව අකම්පියට්ඨෙන බලන්ති **සද්ධාබලං. වීරියබලා**දීසුපි එසෙව නයො. එත්ථ හි සද්ධා අස්සද්ධියෙ න කම්පති, වීරියං කොසජ්ජෙන න කම්පති, සති මුට්ඨස්සච්චෙන න කම්පති, සමාධි උද්ධච්චෙ න කම්පති, පඤ්ඤා අවිජ්ජාය න කම්පතීති සබ්බානිපි අකම්පියට්ඨෙන බලානීති වුච්චන්ති. භාවනානයො පනෙත්ථ ඉන්ද්රියභාවනායං වුත්තනයෙනෙව වෙදිතබ්බොති. ඉමානි ලොකියලොකුත්තරානෙව කථිතානීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සතිසම්බොජ්ඣඞ්ගං භාවෙතී**ති එත්ථ අයං ආදිකම්මිකානං කුලපුත්තානං වසෙන සද්ධිං අත්ථවණ්ණනාය භාවනානයො. තත්ථ සතිසම්බොජ්ඣඞ්ගන්තිආදිනා නයෙන වුත්තානං සත්තන්නං ආදිපදානං තාව අයමත්ථවණ්ණනා – සතිසම්බොජ්ඣඞ්ගෙ තාව සරණට්ඨෙන සති, සා පනෙසා උපට්ඨානලක්ඛණා, අපිලාපනලක්ඛණා වා. වුත්තම්පි චෙතං – “යථා, මහාරාජ, රඤ්ඤො භණ්ඩාගාරිකො රඤ්ඤො සාපතෙය්යං අපිලාපෙති ‘එත්තකං, මහාරාජ, හිරඤ්ඤං, එත්තකං සුවණ්ණං, එත්තකං සාපතෙය්ය’න්ති. එවමෙව ඛො, මහාරාජ, සති උප්පජ්ජමානා කුසලාකුසලසාවජ්ජානවජ්ජහීනප්පණීතකණ්හසුක්කසප්පටිභාගෙ ධම්මෙ අපිලාපෙති ඉමෙ චත්තාරො සතිපට්ඨානා”ති (මි· ප· 2.1.13) විත්ථාරො. අපිලාපනරසා, කිච්චවසෙනෙව හිස්සා එතං ලක්ඛණං ථෙරෙන වුත්තං. අසම්මොසරසා වා, ගොචරාභිමුඛීභාවපච්චුපට්ඨානා. සති එව සම්බොජ්ඣඞ්ගොති **සතිසම්බොජ්ඣඞ්ගො**."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ථ බොධියා, බොධිස්ස වා අඞ්ගොති **බොජ්ඣඞ්ගො**. කිං වුත්තං හොති? යා හි අයං ධම්මසාමග්ගීයාය ලොකියලොකුත්තරමග්ගක්ඛණෙ උප්පජ්ජමානාය ලීනුද්ධච්චපතිට්ඨානායූහනකාමසුඛඅත්තකිලමථානුයොගඋච්ඡෙදසස්සතාභිනිවෙසාදීනං අනෙකෙසං උපද්දවානං පටිපක්ඛභූතාය සතිධම්මවිචයවීරියපීතිපස්සද්ධිසමාධිඋපෙක්ඛාසඞ්ඛාතාය ධම්මසාමග්ගියා අරියසාවකො බුජ්ඣතීති කත්වා බොධීති වුච්චති, **බුජ්ඣතී**ති කිලෙසසන්තානනිද්දාය උට්ඨහති, චත්තාරි වා අරියසච්චානි පටිවිජ්ඣති, නිබ්බානමෙව වා සච්ඡිකරොතීති වුත්තං හොති. යථාහ – “සත්ත බොජ්ඣඞ්ගෙ භාවෙත්වා අනුත්තරං සම්මාසම්බොධිං අභිසම්බුද්ධො”ති (සං· නි· 5.378; දී· නි· 3.143). තස්සා ධම්මසාමග්ගිසඞ්ඛාතාය බොධියා අඞ්ගොතිපි **බොජ්ඣඞ්ගො** ඣානඞ්ගමග්ගඞ්ගාදයො විය. යොපෙස යථාවුත්තප්පකාරාය එතාය ධම්මසාමග්ගියා බුජ්ඣතීති කත්වා අරියසාවකො බොධීති වුච්චති, තස්ස අඞ්ගොතිපි **බොජ්ඣඞ්ගො** සෙනඞ්ගරථඞ්ගාදයො විය. තෙනාහු අට්ඨකථාචරියා – “බුජ්ඣනකස්ස පුග්ගලස්ස අඞ්ගාති වා බොජ්ඣඞ්ගා”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ශ්‍රද්ධාබල ආදියෙහි ශ්‍රද්ධාවම නොසැලෙන තැන්හි බලය වේනුයි **සද්ධාබලං** නමි. වීර්ය බල ආදියෙහිද මේ ක්‍රමයමයි. මෙහි වනාහි ශ්‍රද්ධාව නැති බවින් නොසැලෙයි. වීර්ය කුසීත බවින් නොසැලෙයි. සිහිය මුළා වූ සත්‍යයෙන් නොසැලෙයි. සමාධිය උද්ධච්චබවින් නොසැලෙයි. ප්‍රඥාව අවිද්‍යාවෙන් නොසැලේයයි සියල්ලම නොසැලෙස අර්ථයෙන් බලයයි කියති. මෙහි භාවනානය ඉන්‍ද්‍රියභාවනාවෙහි කියනලද ක්‍රමයෙන්ම දතයුතුයි. ලෞකික ලෝකෝත්තරවුම මේවාද කියනලදී."
                    },
                    {
                        "type": "paragraph",
                        "text": "සතිසම්බෝජඤ්‍ධංගං භාවෙති යන මෙහි මෙය ආදිකර්මිකවූ කුලපුත්‍රයන්ගේ වශයෙන් සමඟ අර්‍ත්‍ථ වර්ණනාවෙහි භාවනාක්‍රමයයි. එහි සතිසම්බොජ්ක්‍ධඞගං යනාදී ක්‍රමයෙන් කියනලද මුල්පද සතෙහි මේ අර්‍ත්‍ථ වර්‍ණනාවයි. සතිසම්බොජක්‍ධංගයෙහි වනාහි පිහිටවීම් අර්‍ත්‍ථයෙන් සතියයි. එය වැටහීම ලක්‍ෂණකොට ඇත්තේද යළියළිත් සැලකීම ලක්‍ෂණකොට ඇත්තේදවෙයි. මෙය කියන ලද්දේමය. ‘මහරජ, යම්සේ රජුගේ අයකැමි තෙමේ රජුගේ ධනය මහරජ, අමුරන් මෙපමණය, රන් මෙපමණය, ධනය මෙපමණ’යැයි ගණන් ගෙන කියයිද මහරජ, මෙසේම සතිය උපදදිනු ලබන්නේ කුසල් අකුසල් වරද නිවරද හීන ප්‍රණීත කිළිටි පිවිතුරු වශයෙන් සමානවූ ධර්‍මයන් නැවත නැවත සලකා බලයිද මේ සතර සතිපට්ටානයෝය යනු විස්තරයයි. නැවත සලකාබැලීම රසය කොට ඇත්තේය. මෙහි කෘත්‍ය වශයෙන්ම තෙරුන්වහන්සේ විසින් මෙය කියනලදී. නොමුළා වීම රසයකොට ඇත්තේ හෝ වෙයි. අරමුණ ඉදිරියට එළඹසිටීමයි. සතියම සම්බොජක්‍ධංගවූයේ සතිසමබොජක්‍ධඞගයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "එහි බුදුබවට හෝ බුදුබවේ අංගයෝයි බොජක්‍ධඞ්ගා නමි. (මෙයින්) කුමක් කියනලද්දේද? යම් මේ ධර්‍ම සාමග්‍රියයි: ලෞකික ලෝකෝත්තර මාර්‍ගක්‍ෂණයෙහි උපදිනුලබන්නාවූ සැඟවුණු උද්ධච්චය පිහිටීම රැස් කිරීම, කාමසුඛ අත්තකිලමථානුයෝග උච්ඡේද ශාශ්වත ආදී නොයෙක් ආකාරවූ උපද්‍රවයන්ට ප්‍රතිපක්‍ෂවූ සතිධම්මවිචය විරිය පීති පස්සද්ධි සමාධි උපෙක්‍ඛා සංඛ්‍යාතවූ යම් ධර්‍මසාමග්‍රියකින් ආර්යශ්‍රාවක තෙමේ අවබෝධ කරයි. කෙලෙස් සන්තාන නින්දනේ නැගීසිටියි. සතර ආර්‍ය්‍ය සත්‍යයන් හෝ අවබෝධකරයි. නිර්‍වාණය ප්‍රත්‍යක්‍ෂකරයි කියනලද්දේවෙයි. යම්සේ කියන ලද්දේද? සප්ත බොධ්‍යංගයන් වඩා අනුත්තරවූ සම්මා සම්බෝධිය මනාව අවබෝධ කරනලද්දේ යනුවෙනි. ඒ ධර්‍ම සාමග්‍රි සංඛ්‍යාත බෝධියෙහි අංගය යනුවෙන්ද බොජක්‍ධඞ්ග නම්වේ. සේනාංග රථාංගාදිය මෙනි. එහෙයින් අර්‍ත්‍ථකථාචාර්‍ය්‍යවරු අවබෝධ කරන පුද්ගලයාගේ අංගය යනුවෙන් හෝ බොජක්‍ධඞ්ගය’යි කීහ."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 603,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අපිච “බොජ්ඣඞ්ගාති කෙනට්ඨෙන බොජ්ඣඞ්ගා? බොධාය සංවත්තන්තීති බොජ්ඣඞ්ගා, බුජ්ඣන්තීති බොජ්ඣඞ්ගා, අනුබුජ්ඣන්තීති බොජ්ඣඞ්ගා, පටිබුජ්ඣන්තීති බොජ්ඣඞ්ගා, සම්බුජ්ඣන්තීති බොජ්ඣඞ්ගා”ති ඉමිනා පටිසම්භිදානයෙනාපි (පටි· ම· 2.17) බොජ්ඣඞ්ගත්ථො වෙදිතබ්බො. පසත්ථො සුන්දරො ච බොජ්ඣඞ්ගො සම්බොජ්ඣඞ්ගො, සති එව සම්බොජ්ඣඞ්ගො **සතිසම්බොජ්ඣඞ්ගො,** තං සතිසම්බොජ්ඣඞ්ගං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ධම්මවිචයසම්බොජ්ඣඞ්ග**න්තිආදීසුපි චතුසච්චධම්මෙ විචිනතීති **ධම්මවිචයො**. සො පවිචයලක්ඛණො, ඔභාසනරසො, අසම්මොහපච්චුපට්ඨානො. වීරභාවතො, විධිනා ඊරයිතබ්බතො ච **වීරියං**. තං පග්ගහලක්ඛණං, උපථම්භනරසං, අනොසීදනපච්චුපට්ඨානං. පීණයතීති **පීති**. සා ඵරණලක්ඛණා, තුට්ඨිලක්ඛණා වා, කායචිත්තානං පීණනරසා, නෙසංයෙව ඔදග්යපච්චුපට්ඨානා. කායචිත්තදරථප්පස්සම්භනතො **පස්සද්ධි**. සා උපසමලක්ඛණා, කායචිත්තදරථමද්දනරසා, කායචිත්තානං අපරිප්ඵන්දසීතිභාවපච්චුපට්ඨානා. සමාධානතො **සමාධි**. සො අවික්ඛෙපලක්ඛණො, අවිසාරලක්ඛණො වා, චිත්තචෙතසිකානං සම්පිණ්ඩනරසො, චිත්තට්ඨිතිපච්චුපට්ඨානො. අජ්ඣුපෙක්ඛනතො **උපෙක්ඛා**. සා පටිසඞ්ඛානලක්ඛණා, සමවාහිතලක්ඛණා වා, ඌනාධිකනිවාරණරසා, පක්ඛපාතුපච්ඡෙදනරසා වා, මජ්ඣත්තභාවපච්චුපට්ඨානා. සෙසං වුත්තනයමෙව. **භාවෙතී**ති බ්රූහෙති වඩ්ඪෙති, උප්පාදෙතීති අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ථ චත්තාරො ධම්මා **සතිසම්බොජ්ඣඞ්ගස්ස** උප්පාදාය සංවත්තන්තීති වෙදිතබ්බා සතිසම්පජඤ්ඤං මුට්ඨස්සතිපුග්ගලපරිවජ්ජනතා උපට්ඨිතස්සතිපුග්ගලසෙවනතා තදධිමුත්තතාති. අභික්කන්තාදීසු හි සත්තසු ඨානෙසු සතිසම්පජඤ්ඤෙන, භත්තනික්ඛිත්තකාකසදිසෙ මුට්ඨස්සතිපුග්ගලෙ පරිවජ්ජනෙන, තිස්සදත්තත්ථෙරඅභයත්ථෙරාදිසදිසෙ උපට්ඨිතස්සතිපුග්ගලෙ සෙවනෙන, ඨානනිසජ්ජාදීසු සතිසමුට්ඨාපනත්ථං නින්නපොණපබ්භාරචිත්තතාය ච සතිසම්බොජ්ඣඞ්ගො උප්පජ්ජති. තස්මා ආදිකම්මිකො කුලපුත්තො ඉමෙහි චතූහි කාරණෙහි සතිසම්බොජ්ඣඞ්ගං සමුට්ඨාපෙත්වා තදෙව ධුරං කත්වා අභිනිවෙසං පට්ඨපෙත්වා අනුක්කමෙන අරහත්තං ගණ්හාති. සො යාව අරහත්තමග්ගා සතිසම්බොජ්ඣඞ්ගං භාවෙති නාම, ඵලෙ පත්තෙ භාවිතො නාම හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සත්ත ධම්මා **ධම්මවිචයසම්බොජ්ඣඞ්ගස්ස** උප්පාදාය සංවත්තන්ති පරිපුච්ඡකතා, වත්ථුවිසදකිරියා, ඉන්ද්රියසමත්තපටිපාදනා, දුප්පඤ්ඤපුග්ගලපරිවජ්ජනා, පඤ්ඤවන්තපුග්ගලසෙවනා, ගම්භීරඤාණචරියපච්චවෙක්ඛණා, තදධිමුත්තතාති. තත්ථ **පරිපුච්ඡකතා**ති ඛන්ධධාතුආයතනඉන්ද්රියබලබොජ්ඣඞ්ගමග්ගඞ්ගඣානසමථවිපස්සනානං අත්ථසන්නිස්සිතපරිපුච්ඡාබහුලතා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තවද, බොජක්‍ධඞ්ගයයි කවර අර්‍ත්‍ථයෙන් බොජක්‍ධඞ්ග වේද? අවබෝධය සඳහා පවතිත්යයි බොජක්‍ධඞ්ග වේද? අවබෝධය සඳහා පවතිත්යයි බොජ්ක්‍ධඞ්ගයෝයි, අවබෝධ කරත්නුයි බොජක්‍ධඞ්ගයෝයි, අනුව අවබෝධ කරත්නුයි බොජක්‍ධඞ්ගයෝසි, ප්‍රතිබෝධ කරත්නුයි බොජක්‍ධඞ්ගයෝසි, මනාව අවබෝධ කරත්නුයි බොජක්‍ධංගයෝයි මේ ආදී පටිසම්හිදා ක්‍රමයෙන්ද බෝධ්‍යංගාර්ථය දතයුතුය. ප්‍රශස්තවූ සුන්දරවූ බෝධ්‍යංගය හෝ සම්බෝධ්‍යංගය වේ. සතියම සම්බෝධ්‍යංගවූයේ සතිසම්බෝජක්‍ධඞ්ගයයි. ඒ සති සම්බෝජක්‍ධංගයයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ධම්මවිචයසම්බොජක්‍ධඞ්ගං** යනාදියෙහිද චතුරාර්ය සත්‍යධර්‍මයන් විමසන්නේනුයි ධම්මවිචය නමි. එය මනාව විමසීම ලක්‍ෂණකොට ඇත්තේ බැබලීම රසයකොට ඇත්තේය. නොමුළාව වැටහීමකොට ඇත්තේය. වීරභාවයෙන්ද ක්‍රමයෙන් සෙලවිය යුතු හෙයින්ද වීරිය නමි. එය දැඩිව ගැනීම ලක්‍ෂණයකොට ඇත. උපකාරවීම රසයකොට ඇත. ගිලා නොබැසීම වැටහීමයි. පිනවන්නේනුයි පීති නමි. පැතිරීම ලක්‍ෂණකොට ඇත. හෝ සතුටුවීම ලක්‍ෂණකොට ඇත. කයසිත පිනවීම රසයකොට ඇත. ඒවාම ප්‍රීතිමත් කරවීම වැටහීමකොට ඇත. කායචිත්ත දාහය සංසිදවන බැවින් පස්සද්ධි නමි. එය සංසිඳවීම ලක්‍ෂණයකොට ඇත්තේය. කායචිත්ත දාහය මැඩීම රසයකොට ඇත. කායචිත්තයන්ගේ නොසැලෙන්නාවූ සිසිල්බව වැටහීමකොට ඇත. එකඟ කරන බැවින් සමාධි නමි. එය නොවිසිරීම ලක්‍ෂණකොට ඇත්තේ හෝ නොපැතිරීම ලක්‍ෂණකොට ඇත්තේ වේ. චිත්ත චෛතසිකයන් එක්කිරීම රසයකොට ඇත. සිතේ පැවැත්ම වැටහීමකොට ඇත. මධ්‍යස්ථවීම් වශයෙන් උපෙක්‍ඛා නමි. එය නුවණින් සලකා බැලීම ලක්‍ෂණයකොට ඇත්තේ හෝ තැන්පත් වීම ලක්‍ෂණ කොට ඇත්තේ හෝ වේ. අඩුවැඩි නැති කිරීම රසයකොට ඇත. පක්‍ෂපාතිත්විය වැළැක්වීම රසයකොට ඇත්තේ හෝ වේ. මැදහත් බව වැහීමකොට ඇත. සෙස්ස කියනලද ක්‍රමය ඇත්තේමය. භාවෙති යනු වර්‍ධනය කරයි, වඩයි. උපදවයි යන අර්‍ත්‍ථයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "එහි ධර්‍මසතරක් සතිසම්බොජක්‍ධඞ්ගයාගේ ඉපදීම සඳහා පවතිත්යයි දතයුතුයි. ඒවා නම් සති සම්පජඤ්ඤය, මුළාවූ සිහි ඇති පුද්ගලයන් දුරලීම, එළඹ සිටි සිහිය ඇති පුද්ගලයන් ඇසුරු කිරීම, එහි ඇලීසිටීම යනුයි. අභික්කන්තාදීවූ සත් තැන්හි සතිසම්පජ්ඤඤ රහිතවූ බතට වැසූ කවුඩන් වැනිවූ මුළාවූ සිහි ඇති පුද්ගලයන් දුරලීමෙන් තිස්සදත්ත තෙරුන් අභයතෙරුන් වැනි එළඹසිටි සිහිය ඇති පුද්ගලයන් ඇසුරු කිරීමෙන් හා සිටීම් හිඳීම් ආදියෙහි සිහිය නැංවීම සඳහා නතුවූ යොමුවූ නැඹුරුවූ සිතෙන් සති සම්බෝජක්‍ධංගය උපදියි. එබැවින් ආදිකර්මික කුලපුත්තෙමේ මේ කරුණු සතරින් සතිසම්බොජක්‍ධඞ්ගය ඔසවා එයම ධුරයකොට ඇලීම පිහිටුවා කෙමෙන් රහත්බව ගනියි. හෙතෙම අරහත් මාර්ගය දක්වා සතිසම්බොජක්‍ධඞ්ගය වඩයිනමි. ඵලය පැමිණිකල්හි වඩනලද්දේ නම්වෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ධර්‍මසතක් ධර්‍මවිචය සම්බොධ්‍යංගයාගේ ඉපදීම සඳහා පවතියි. විමසීම, වස්තුව ප්‍රකට කිරීම, ඉන්‍ද්‍රිය සමතාව පිළියෙල කිරීම, අනුවණ පුද්ගලයන් දුරලීම, නුවණැති පුද්ගලයන් ඇසුරු කිරීම, ගැඹුරු ඥානචර්යාව සිහිකිරීම හා එහිම යෙදීම යනුයි. එහි පරිපුච්ඡකතා (විමසීම) යනු ස්කන්‍ධ ධාතු ආයතන ඉන්‍ද්‍රිය බල බොජ්ක්‍ධඞ්ග, මග්ගඞ්ගක්‍ධාන සමථ විපස්සනා යන මොවුන් පිළිබඳ අර්‍ත්‍ථසන්නිශ්‍රිත විචාරීමෙහි බහුලතාවයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 605,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**වත්ථුවිසදකිරියා**ති අජ්ඣත්තිකබාහිරානං වත්ථූනං විසදභාවකරණං. යදා හිස්ස කෙසනඛලොමා දීඝා හොන්ති, සරීරං වා උප්පන්නදොසඤ්චෙව සෙදමලමක්ඛිතඤ්ච, තදා අජ්ඣත්තිකං වත්ථු අවිසදං හොති අපරිසුද්ධං. යදා පන චීවරං ජිණ්ණං කිලිට්ඨං දුග්ගන්ධං වා හොති, සෙනාසනං වා උක්ලාපං, තදා බාහිරං වත්ථු අවිසදං හොති අපරිසුද්ධං. තස්මා කෙසාදිච්ඡෙදනෙන උද්ධංවිරෙචනඅධොවිරෙචනාදීහි සරීරසල්ලහුකභාවකරණෙන උච්ඡාදනනහාපනෙන ච අජ්ඣත්තිකවත්ථු විසදං කාතබ්බං. සූචිකම්මධොවනරජනපරිභණ්ඩකරණාදීහි බාහිරවත්ථු විසදං කාතබ්බං. එතස්මිඤ්හි අජ්ඣත්තිකබාහිරෙ වත්ථුම්හි අවිසදෙ උප්පන්නෙසු චිත්තචෙතසිකෙසු ඤාණම්පි අවිසදං හොති අපරිසුද්ධං අපරිසුද්ධානි දීපකපල්ලවට්ටිතෙලාදීනි නිස්සාය උප්පන්නදීපසිඛාය ඔභාසො විය. විසදෙ පන අජ්ඣත්තිකබාහිරෙ වත්ථුම්හි උප්පන්නෙසු චිත්තචෙතසිකෙසු ඤාණම්පි විසදං හොති පරිසුද්ධානි දීපකපල්ලවට්ටිතෙලාදීනි නිස්සාය උප්පන්නදීපසිඛාය ඔභාසො විය. තෙන වුත්තං – “වත්ථුවිසදකිරියා ධම්මවිචයසම්බොජ්ඣඞ්ගස්ස උප්පාදාය සංවත්තතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ඉන්ද්රියසමත්තපටිපාදනා** නාම සද්ධාදීනං ඉන්ද්රියානං සමභාවකරණං. සචෙ හිස්ස සද්ධින්ද්රියං බලවං හොති, ඉතරානි මන්දානි, තතො වීරියින්ද්රියං පග්ගහකිච්චං, සතින්ද්රියං උපට්ඨානකිච්චං, සමාධින්ද්රියං අවික්ඛෙපකිච්චං, පඤ්ඤින්ද්රියං දස්සනකිච්චං කාතුං න සක්කොති. තස්මා තං ධම්මසභාවපච්චවෙක්ඛණෙන වා, යථා වා මනසිකරොතො බලවං ජාතං, තථා අමනසිකාරෙන හාපෙතබ්බං. **වක්කලිත්ථෙරවත්ථු** චෙත්ථ නිදස්සනං. සචෙ පන වීරියින්ද්රියං බලවං හොති, අථ නෙව සද්ධින්ද්රියං අධිමොක්ඛකිච්චං කාතුං සක්කොති, න ඉතරානි ඉතරකිච්චභෙදං. තස්මා තං පස්සද්ධාදිභාවනාය හාපෙතබ්බං. තත්රාපි **සොණත්ථෙරස්ස වත්ථු** දස්සෙතබ්බං. එවං සෙසෙසුපි එකස්ස බලවභාවෙ සති ඉතරෙසං අත්තනො කිච්චෙසු අසමත්ථතා වෙදිතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "විසෙසතො පනෙත්ථ සද්ධාපඤ්ඤානං සමාධිවීරියානඤ්ච සමතං පසංසන්ති. බලවසද්ධො හි මන්දපඤ්ඤො මුධප්පසන්නො හොති, අවත්ථුම්හි පසීදති. බලවපඤ්ඤො මන්දසද්ධො කෙරාටිකපක්ඛං භජති, භෙසජ්ජසමුට්ඨිතො විය රොගො අතෙකිච්ඡො හොති. චිත්තුප්පාදමත්තෙනෙව කුසලං හොතීති අතිධාවිත්වා දානාදීනි අකරොන්තො නිරයෙ උප්පජ්ජති. උභින්නං සමතාය වත්ථුස්මිංයෙව පසීදති. බලවසමාධිං පන මන්දවීරියං සමාධිස්ස කොසජ්ජපක්ඛත්තා කොසජ්ජං අභිභවති. බලවවීරියං මන්දසමාධිං වීරියස්ස උද්ධච්චපක්ඛත්තා උද්ධච්චං අභිභවති. සමාධි පන වීරියෙන සංයොජිතො කොසජ්ජෙ පතිතුං න ලභති, වීරියං සමාධිනා සංයොජිතං උද්ධච්චෙ පතිතුං න ලභති. තස්මා තං උභයං සමං කත්තබ්බං. උභයසමතාය හි අප්පනා හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "වත්‍ථුවිසද කිරියා (වස්තුව ප්‍රකටකිරීම) යනු ආධ්‍යාත්මික බාහිර වස්තූන් ප්‍රකටබවට පත්කිරීමයි. යම් විටෙක මොහුගේ කෙස් නිය ලොම් දිග් වෙයිද ශරීරය හෝ උත්සන්නවූ දොස් ඇත්තේ දහඩිය හා අශූචියෙන් ගැවසී ගත්තේද එවිට ආධ්‍යාත්මික වස්තු අප්‍රකට වෙයි. අපිරිසිදු වෙයි. යම් විටෙක සිවුර දිරුණේ කිළිටිවූයේ දුගඳවූයේ වෙයිද සෙනසුන හෝ කුණු බැඳුනේ වේද බාහිර වස්තුව අප්‍රකට වෙයි. අපවිත්‍ර වෙයි. එහෙයින් කෙස් ආදිය කැපීමෙන් අද්ධවිරෙචන අධොවිරෙචන ආදීයෙන් සිරුර සැහැල්ලුබව ඇති කිරීමෙන් ඇඟ ඇලීම් නෑම් ආදියෙන්ද ආධ්‍යාත්මික වස්තුව ප්‍රකටකළයුතුය. පිරිසිදුකිරීම් සේදීම් පඬුපෙවීම් පිරියම්කිරීම් ආදියෙන් බාහිර වස්තුව ප්‍රකටකළයුතුය. මේ ආධ්‍යාත්මික බාහිර වස්තු අප්‍රකටවූකල්හි උපන්නාවූ චිත්ත චෛතසිකයන්හි ඥානයද අපිරිසුදුවෙයි. අපිරිසුදුවූ පහන් කබල්වට්ටි තෙල්ආදිය නිසා උපන් පහන් සිළුවෙහි ආලෝකය මෙනි. ආධ්‍යාත්මික බාහිර වස්තු ප්‍රකටකල්හි චිත්ත තෛසිකයන්හි උපන්නාවූ ඥානයද ප්‍රකටවෙයි. පිරිසුදුවෙයි. පිරිසුදුවූ පහන්කබලු වට්ටිතෙල් ආදිය නිසා උපන් පහන්සිළුවෙහි ආලෝකය මෙනි. එහෙයින්, වස්තු ප්‍රකටකිරීම ධම්මවිචය සම්බොධ්‍යංගයාගේ ඉපදීම සඳහා පවතීයයි කියනලදී."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉන්‍ද්‍රිය සමතාව පිළියෙල කිරීම නම් ශ්‍රද්ධාදී ඉන්‍ද්‍රියයන් සමභාවයට ගැනීමයි. ඉදින් ඔහුගේ ශ්‍රද්ධා ඉන්‍ද්‍රිය බලවත්වෙයිද අනෙක් ඒවා මඳ වේද එයින් වීර්ය ඉන්‍ද්‍රි දැඩිව ගැනීමේ කෘත්‍යයද ස්මෘති ඉන්‍ද්‍රි වැටහීමේ කෘත්‍යද සමාධි ඉන්‍ද්‍රිය නොවිසිර සිටිමේ කෘත්‍යයද ප්‍රඥා ඉන්‍ද්‍රිය දර්‍ශන කෘත්‍යයද කිරීමට නොහැකිවෙයි. ඉතිරි ඒවා ඉතිරි කෘත්‍යයන් කිරීමටද නොහැකිවෙයි. එබැවින් ඒ ධර්‍මස්වභාවය මෙනෙහි කිරීමෙන් හෝ යම්සේ මෙනෙහි කිරීමෙන් බලවත්වූ දෙයක් වේද එය එසේ මෙනෙහි නොකිරීමෙන් හෝ අඩුකළ යුතුය. වක්කලී ස්ථවිර වස්තුව මෙහිලා නිදර්‍ශනයයි. ඉදින් වීර්‍ය්‍ය ඉන්‍ද්‍රි බලවත්වෙයි නම් එවිට ශ්‍රද්ධාඉන්‍ද්‍රිය අධිමොක්‍ෂ (සිතේ ස්ථිරත්වය) කෘත්‍යය කිරීමට අසමත්වෙයි. සෙසු ඒවා සෙසු කෘත්‍ය භේදයන් කිරීමට අසමත්වෙයි. එහෙයින් එය පස්සද්ධිභාවනාවෙන් අඩුකළ යුතුයි. එහිද සොණ තෙරුන්ගේ කථාවස්තුව දැක්විය යුතුයි. මෙසේ අන්තන්හිද එකක බලවත්බව ඇතිකල්හි ඉතිරිවා තමන්ගේ කෘත්‍යයන්ගේ අසමත් වනබව දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙහිලා විශේෂ වශයෙන් ශ්‍රද්ධා ප්‍රඥාවන්ගේද සමාධි වීර්යයන්ගේද සමතාව පසසත්. බලවත් ශ්‍රද්ධාව ඇති මඳනුවණැත්තේ මෝඩ පැහැදීම් ඇත්තෙකි. නොසුදුසු වස්තුවෙහි පහදියි. බලවත් ප්‍රඥා ඇති මඳ සැදැහැ ඇත්තේ කෛරාටික පක්‍ෂය ඇසුරුකරයි. බෙහෙතින් හටගත් රෝගයක් මෙන් අසාධ්‍යවෙයි. සිත ඉපදවීම් මාත්‍රයකින්ම කුශලය වේයයි අතිධාවනය කොට දානාදිය නොකරන්නේ නිරයෙහි උපදියි. දෙකම සමව ඇති කල්හි (සුදුසු) වස්තුයෙහිම පහදියි. අඩුවීර්‍ය්‍යය ඇති බලවත් සමාධිය සමාධියේ කුසීත පක්‍ෂතාවෙන් කුසීත බව බලවත්කරයි. අඩු සමාධිය ඇති බලවත් වීර්යය විර්යයේ උද්ධච්ච පක්‍ෂතාවෙන් උද්ධච්චය බලවත්කරයි. සමාධිය වීර්යයෙන් එක්වූයේ කුසීතබවෙහි නොවැටෙයි. වීර්යය සමාධියෙන් එක්වූයේ උද්ධච්ච බවෙහි නොවැටෙයි. එබැවින් ඒ දෙක සමකළයුතුය. දෙකෙහි සමබවින් අර්පණාවවෙයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 607,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අපිච සමාධිකම්මිකස්ස බලවතීපි සද්ධා වට්ටති. එවඤ්හි සද්දහන්තො ඔකප්පෙන්තො අප්පනං පාපුණිස්සති. සමාධිපඤ්ඤාසු පන සමාධිකම්මිකස්ස එකග්ගතා බලවතී වට්ටති. එවඤ්හි සො අප්පනං පාපුණාති. විපස්සනාකම්මිකස්ස පඤ්ඤා බලවතී වට්ටති. එවඤ්හි සො ලක්ඛණපටිවෙධං පාපුණාති. උභින්නං පන සමතායපි අප්පනා හොතියෙව. සති පන සබ්බත්ථ බලවතී වට්ටති. සති හි චිත්තං උද්ධච්චපක්ඛිකානං සද්ධාවීරියපඤ්ඤානං වසෙන උද්ධච්චපාතතො කොසජ්ජපක්ඛිකෙන ච සමාධිනා කොසජ්ජපාතතො රක්ඛති. තස්මා සා ලොණධූපනං විය සබ්බබ්යඤ්ජනෙසු, සබ්බකම්මිකො අමච්චො විය ච සබ්බරාජකිච්චෙසු, සබ්බත්ථ ඉච්ඡිතබ්බා. තෙනාහ – “සති ච පන සබ්බත්ථිකා වුත්තා (සං· නි· 5.234) භගවතා. කිං කාරණා? චිත්තඤ්හි සතිපටිසරණං, ආරක්ඛපච්චුපට්ඨානා ච සති, න විනා සතියා චිත්තස්ස පග්ගහනිග්ගහො හොතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**දුප්පඤ්ඤපුග්ගලපරිවජ්ජනා** නාම ඛන්ධාදිභෙදෙසු අනොගාළ්හපඤ්ඤානං දුම්මෙධපුග්ගලානං ආරකා පරිවජ්ජනං. **පඤ්ඤවන්තපුග්ගලසෙවනා** නාම සමපඤ්ඤාසලක්ඛණපරිග්ගාහිකාය උදයබ්බයපඤ්ඤාය සමන්නාගතපුග්ගලසෙවනා. **ගම්භීරඤාණචරියපච්චවෙක්ඛණා** නාම ගම්භීරෙසු ඛන්ධාදීසු පවත්තාය ගම්භීරපඤ්ඤාය පභෙදපච්චවෙක්ඛණා. **තදධිමුත්තතා** නාම ඨානනිසජ්ජාදීසු ධම්මවිචයසම්බොජ්ඣඞ්ගසමුට්ඨාපනත්ථං නින්නපොණපබ්භාරචිත්තතා. තස්මා ආදිකම්මිකො කුලපුත්තො ඉමෙහි සත්තහි කාරණෙහි ධම්මවිචයසම්බොජ්ඣඞ්ගං සමුට්ඨාපෙත්වා තදෙව ධුරං කත්වා අභිනිවෙසං පට්ඨපෙත්වා අනුක්කමෙන අරහත්තං ගණ්හාති. සො යාව අරහත්තමග්ගා ධම්මවිචයසම්බොජ්ඣඞ්ගං භාවෙති නාම, ඵලෙ පත්තෙ භාවිතො නාම හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එකාදස ධම්මා **වීරියසම්බොජ්ඣඞ්ගස්ස** උප්පාදාය සංවත්තන්ති – අපායභයපච්චවෙක්ඛණතා, ආනිසංසදස්සාවිතා, ගමනවීථිපච්චවෙක්ඛණතා, පිණ්ඩපාතාපචායනතා, දායජ්ජමහත්තපච්චවෙක්ඛණතා, සත්ථුමහත්තපච්චවෙක්ඛණතා, ජාතිමහත්තපච්චවෙක්ඛණතා, සබ්රහ්මචාරිමහත්තපච්චවෙක්ඛණතා, කුසීතපුග්ගලපරිවජ්ජනතා, ආරද්ධවීරියපුග්ගලසෙවනතා, තදධිමුත්තතාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ථ “නිරයෙසු පඤ්චවිධබන්ධනකම්මකරණතො පට්ඨාය මහාදුක්ඛං අනුභවනකාලෙපි, තිරච්ඡානයොනියං ජාලක්ඛිපකුමිනාදීහි ගහිතකාලෙපි, පාජනකණ්ටකාදිප්පහාරතුන්නස්ස පන සකටවහනාදිකාලෙපි, පෙත්තිවිසයෙ අනෙකානිපි වස්සසහස්සානි එකං බුද්ධන්තරම්පි ඛුප්පිපාසාහි ආතුරීභූතකාලෙපි, කාලකඤ්ජිකඅසුරෙසු සට්ඨිහත්ථඅසීතිහත්ථප්පමාණෙන අට්ඨිචම්මමත්තෙනෙව අත්තභාවෙන වාතාතපාදිදුක්ඛානුභවනකාලෙපි න සක්කා වීරියසම්බොජ්ඣඞ්ගං උප්පාදෙතුං. අයමෙව තෙ භික්ඛු කාලො”ති එවං **අපායභයං පච්චවෙක්ඛන්තස්සාපි** වීරියසම්බොජ්ඣඞ්ගො උප්පජ්ජති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තවද සමාධි භාවනාව කරන්නාගේ බලවත්වූද ශ්‍රද්ධාව වටී. මෙසේ අදහමින් සිතතහවුරු කරන්නෙ අර්පණාවට පැමිණෙයි. සමාධි ප්‍රඥාවන් අතුරෙන් සමාධිය කරන්නාගේ එකඟබව වටියි. මෙසේ හෙතෙම අර්පණාවට පැමිණෙයි. විදර්‍ශනාව කරන්නාගේ බලවත් ප්‍රඥාව වටියි. මෙසේ හෙතෙම (ත්‍රි) ලක්‍ෂණ අවබෝධයට පැමිණෙයි. දෙකේම සමතාවෙන්ද අර්පණාව වේමය. සියලු තන්හි සතිය බලවත්වන්නේ වටියි. සතිය වනාහි සිත උද්ධච්චයට පක්‍ෂපාතීවූ ශ්‍රද්ධාවීර්ය ප්‍රඥාවන්ගේ වශයෙන් උද්ධච්ඡයට වැටීමෙන්ද කුසීත බවට පක්‍ෂවූ සමාධියෙන් කුසිතබවට වැටීමෙන්ද රකියි. එබැවින් ඒ සතිය සියලු ව්‍යංජනයන්හි ලුණු දැමීමක් මෙන්ද සියලු රාජකාර්‍ය්‍යයන්හි සියලු කටයුතුවල නිරත අමාත්‍යයකු මෙන්ද සියලුතන්හි කැමතිවිය යුතුය. එහෙයින් කියනලදී: ‘සතිය වනාහි සියලුතන්හි අර්‍ත්‍ථයයි භාග්‍යවතුන් වහන්සේ විසින් පවසන ලදී. කුමක් හෙයින්ද යත්? සිත සතිය පිළිසරණකොට ඇත්තේය. සතිය ආරක්‍ෂාව, වැටහීමකොට ඇත්තේය. සතියෙන් තොරව සිතේ දැඩි කිරීම හා යටපත් කිරීම නොවෙයි’ යනුවෙනි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අනුවණ පුද්ගලයන් දුරලීම නම් ස්කන්‍ධාදී භේදයන්හි නොබැසගත් ප්‍රඥාව ඇති නුනුවණ පුද්ගලයන් දුරින් දුරුකිරීමයි. පැනවත් පුද්ගලයන් ඇසුරුකිරීම නම් සම පණස් ලක්‍ෂණ විමසන්නාවූ උදයව්‍යය ප්‍රඥාවෙන් යුක්තවූ පුද්ගලයන් ඇසුරුකිරිමයි. ගැඹුරුඥානචර්යාව මෙනෙහිකිරීම නම්: ගැඹුරුවූ ස්කන්‍ධාදියෙහි පවතින ගැඹුරු ප්‍රඥාවෙන් ප්‍රභේදයන් මෙනෙහි කිරීමයි. එහි යෙදී සිටීම නම් සිටීම් හිඳීම් ආදියෙහි ධම්මවිචය සම්බොජක්‍ධංය නංවාලනු සඳහා නැඹුරුවූ යොමුවූ නතුවූ සිතැති බවයි. එබැවින් ආදිකර්මික කුලපුත්‍ර තෙමේ මේ කරුණු සතින් ධම්මවිචය සම්බෝධංගය නඟා සිටුවා එයම ධුරය කොට සිත ඇලීම පිහිටුවා අනුක්‍රමයෙන් රහත්බව ගනියි. හෙතෙම අර්හත්මාර්‍ගය දක්වා ධම්මවිචය සම්බොජ්ක්‍ධංගය වඩයි නම්වේ. ඵලය පැමිණි කල්හි වැඩුවේ නම් වෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "විරිය සම්බොජක්‍ධංගයේ ඉපදීම සඳහා එකොළොස් ධර්‍ම කෙනෙක් පවතිත්: අපායභය පච්චචෙක්‍ඛනතා (අපායබිය මෙනෙහි කිරීම), ආනිසංසදස්සාවිතා (අනුසස් දක්නා බව), ගමනවීථි පච්චවෙක්‍ඛනතා (ගමන්මග මෙනෙහි කිරීම), පිණ්ඩපාතාපචායනතා (පිණ්ඩාහාරයට ගරු කිරීම) දායජ්ජමහත්තපච්ච වෙක්‍ඛනතා (දායාදමහත්වය සැලකීම), සත්‍ථුමහත්තපච්චවෙක්‍ඛනතා (ශාසතෘමහත්වය සැලකීම) ජාතිමහත්තපච්චවෙක්‍ඛනතා (ජාතිමහත්වය සැලකීම). සබ්‍රහ්මචාරිමහත්තපච්ච වෙක්‍ඛනතා (සබ්‍රහමචාරිමහත්වය සැලකීම), කුසීතපුග්ගල පරිවජ්ජනතා (කුසීතපුද්ගලයන් දුරලීම), ආරද්ධවිරිය පුග්ගල සෙවනතා (පටන්ගත් වීර්ය ඇති පුද්ගලයින් ඇසුරු කිරිම), තදධිමුත්තතා (එහි නියැලී සිටීම) යන මේවායි."
                    },
                    {
                        "type": "paragraph",
                        "text": "එහි, නිරයන්හි පස් ආකාර බන්‍ධන කර්‍ම කිරීමේ පටන් මහදුකක් විදින කල්හිද තිරිසන් යෝනියෙහි දැල්, උගුල් කෙම් ආදියෙහි ගන්නාලද කල්හිද කෙවිටි කටු ආදී පහරින් විදන ලද්දහුගේ ගැල් ඇදීම් ආදි කල්හිද ප්‍රෙතවිෂයෙහි නොයෙක් වසර දහස්ගණන් එක් බුද්ධාන්තරයකුදු සාපිසාදියෙන් මැඩුණු කල්හිද, කාලකඤජක අසුරයන් අතුරෙහි සැටරියන් අසුරියන් පමණවූ අටසම්පමණක්මවූ ආතමභාවයෙන් අවුසුළං ආදී දුක් විඳින කල්හිද වීර්ය සම්බොජක්‍ධංගය උපදවීමට නොහැකිය. භිකෂුව මේ ඔබට සුදුසු කාලයමයයි මෙසේ අපායභය සලකන්නහුටද වීර්ය සම්බොජක්‍ධංගය උපදියි"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 609,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“න සක්කා කුසීතෙන නව ලොකුත්තරධම්මා ලද්ධුං, ආරද්ධවීරියෙනෙව සක්කා, අයමානිසංසො වීරියස්සා”ති එවං **ආනිසංසදස්සාවිනොපි** උප්පජ්ජති. “සබ්බබුද්ධපච්චෙකබුද්ධමහාසාවකෙහි ගතමග්ගොව ගන්තබ්බො, සො ච න සක්කා කුසීතෙන ගන්තු”න්ති එවං **ගමනවීථිං පච්චවෙක්ඛන්තස්සාපි** උප්පජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යෙ තං පිණ්ඩපාතාදීහි උපට්ඨහන්ති, ඉමෙ තෙ මනුස්සා නෙව ඤාතකා, න දාසකම්මකරා, නාපි තං නිස්සාය ජීවිස්සාමාති තෙ පණීතානි පිණ්ඩපාතාදීනි දෙන්ති. අථ ඛො අත්තනො කාරානං මහප්ඵලතං පච්චාසීසමානා දෙන්ති. සත්ථාරාපි ‘අයං ඉමෙ පච්චයෙ පරිභුඤ්ජිත්වා කායදළ්හීබහුලො සුඛං විහරිස්සතී’ති න එවං සම්පස්සතා තුය්හං පච්චයා අනුඤ්ඤාතා, අථ ඛො ‘අයං ඉමෙ පරිභුඤ්ජමානො සමණධම්මං කත්වා වට්ටදුක්ඛතො මුච්චිස්සතී’ති තෙ පච්චයා අනුඤ්ඤාතා. සො දානි ත්වං කුසීතො විහරන්තො න තං පිණ්ඩපාතං අපචායිස්සසි. ආරද්ධවීරියස්සෙව හි පිණ්ඩාපචායනං නාම හොතී”ති එවං **පිණ්ඩපාතාපචායනං පච්චවෙක්ඛන්තස්සාපි** උප්පජ්ජති මහාමිත්තත්ථෙරස්ස විය පිණ්ඩපාතියතිස්සත්ථෙරස්ස විය ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "**මහාමිත්තත්ථෙරො** කිර කස්සකලෙණෙ නාම පටිවසති. තස්ස ච ගොචරගාමෙ එකා මහාඋපාසිකා ථෙරං පුත්තං කත්වා පටිජග්ගති. සා එකදිවසං අරඤ්ඤං ගච්ඡන්තී ධීතරං ආහ – “අම්ම, අසුකස්මිං ඨානෙ පුරාණතණ්ඩුලා, අසුකස්මිං ඛීරං, අසුකස්මිං සප්පි, අසුකස්මිං ඵාණිතං, තව භාතිකස්ස අය්යමිත්තස්ස ආගතකාලෙ භත්තං පචිත්වා ඛීරසප්පිඵාණිතෙහි සද්ධිං දෙහි, දත්වා ත්වඤ්ච භුඤ්ජෙය්යාසි. අහං පන හිය්යො පක්කං පාරිවාසිකභත්තං කඤ්ජියෙන භුත්තම්හී”ති. දිවා කිං භුඤ්ජිස්සසි, අම්මාති? සාකපණ්ණං පක්ඛිපිත්වා කණතණ්ඩුලෙහි අම්බිලයාගුං පචිත්වා ඨපෙහි, අම්මාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ථෙරො චීවරං පාරුපිත්වා පත්තං නීහරන්තොව තං සද්දං සුත්වා අත්තානං ඔවදි – “මහාඋපාසිකා කිර කඤ්ජියෙන පාරිවාසිකභත්තං භුඤ්ජි, දිවාපි කණපණ්ණම්බිලයාගුං භුඤ්ජිස්සති, තුය්හං අත්ථාය පන පුරාණතණ්ඩුලාදීනි ආචික්ඛති. තං නිස්සාය ඛො පනෙසා නෙව ඛෙත්තං න වත්ථුං න භත්තං න වත්ථං පච්චාසීසති, තිස්සො පන සම්පත්තියො පත්ථයමානා දෙති. ත්වං එතිස්සා තා සම්පත්තියො දාතුං සක්ඛිස්සසි, න සක්ඛිස්සසීති, අයං ඛො පන පිණ්ඩපාතො තයා සරාගෙන සදොසෙන සමොහෙන න සක්කා ගණ්හිතු”න්ති පත්තං ථවිකාය පක්ඛිපිත්වා ගණ්ඨිකං මුඤ්චිත්වා නිවත්තිත්වා කස්සකලෙණමෙව ගන්ත්වා පත්තං හෙට්ඨාමඤ්චෙ, චීවරඤ්ච චීවරවංසෙ ඨපෙත්වා, “අරහත්තං අපාපුණිත්වා න නික්ඛමිස්සාමී”ති වීරියං අධිට්ඨහිත්වා නිසීදි. දීඝරත්තං අප්පමත්තො හුත්වා නිවුත්ථභික්ඛු විපස්සනං වඩ්ඪෙත්වා පුරෙභත්තමෙව අරහත්තං පත්වා විකසමානමිව පදුමං මහාඛීණාසවො සිතං කරොන්තොව නික්ඛමි. ලෙණද්වාරෙ රුක්ඛම්හි අධිවත්ථා දෙවතා –"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කුසීන තැනැත්තකු විසින් නවලෝකොත්තර ධර්‍මය ලැබීමට නොහැකිය. පටන්ගත් වීර්යය ඇත්තහු විසින්ම ලැබිය හැකිය. මෙය වීර්යයේ ආනිසංසයයි මෙසේ ආනිසං දකින්නාටද උපදියි. බුදු පසේබුදු මහසව්වන් විසින් ගිය මගම යායුතුය. කුසීතයකු විසින් එයද යාමට නොහැකියයි මෙසේ ගමන් මග සලකන්නාටද උපදියි."
                    },
                    {
                        "type": "paragraph",
                        "text": "යමෙක් ඔහුට පිණ්ඩපාතාදියෙන් උවටැන් කරත්ද, ඒ මින්ස්සු ඔහුගේ ඥතීහු නොවෙත්, දැසිකම්කරුවෝ නොවෙත්, ඔහු නිසා ජීවත් වෙමුයි ඔහුට ප්‍රණීතවූ පිණ්ඩපාතාදිය නොදෙති. ඉක්බිති තමන් උදෙසා මහත්ඵලබවක් බලාපොරොත්තු වෙමින් දෙත් ශාස්තෘන්වහන්සේ විසින්ද මෙතෙම මේ ප්‍රත්‍යයන් අනුභවකොට කායශක්ති බහුලව සුවසේ වෙසෙන්නේයයි මෙසේ බලමින් නුඹලාට ප්‍රත්‍යය නොඅනුදන්නාලදී. මෙතෙම මේ ප්‍රත්‍යයන් වළඳමින් මහණදම් කොට සසරදුකින් මිදෙන්නේයයි නුඹලාට ප්‍රත්‍යය අනුදන්නා ලදී. ඒ ඔබ දැන් කුසීතව වසමින් ඒ පිණ්ඩාහාරයට ගරු නොකරන්නෙහි. අරඹූ වීර්‍ය්‍යය ඇත්තහුටම පිණ්ඩාහාරයට ගරුකිරීම නම් වෙයි. මෙසේ පිණ්ඩාහාරයට ගරුකිරීම මෙනෙහි කරන්නාටම උපදියි මහාමිත්ත තෙරුන්ගේද පිණ්ඩපාතිය තිස්ස තෙරුන්ගේද මෙනි."
                    },
                    {
                        "type": "paragraph",
                        "text": "මහාමිත්ත තෙරුන්ගේද පිණ්ඩපාතිය තිස්ස තෙරුන්ගේද මෙනි. මහාමිත්ත තෙරණුවෝ කස්සක නම් ලෙනෙහි වෙසෙති. ඔහුගේ ගොදුරු ගමෙහි එක් උවැසියක් තෙරුන් පුතුන්කොට පිළිදැඟුම් කරයි. ඕතොමෝ දිනක් අරණට යන්නී දියණියට, ‘දියණියනි, අසුවල් තන්හි පැරණි සහල්ද අසුවල් තන්හි කිරිද අසුවල් තන්හි ගිතෙල්ද අසුවල් තන්හි පැණිද ඇත. ඔබගේ සොහොයුරු ආර්ය මිත්ත පැමිණිකල්හි බත් පිස කිරිගිතෙල් පැණි සමඟ දෙව. නුඹද අනුභව කරව. මම ඊයේ පිසූ හීල්බත් කැඳ සමඟ අනුභව කෙළෙමි’යි කීවාය. ‘මෑණියනි, දහවලට කුමක් අනුභව කරන්නෙහිදැ’යි දියණිය ඇසුවය. පළාවර්‍ග පිස සුන්සහලින් ඇඹුල් කැඳක් පිස තබන්න දියණිය’යි මව කීවාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙරුණුවෝ සිවුරු පොරවා පාත්‍රය (අතට) ගන්නාහුම ඒ හඬ අසා අසා තමන්ට අවවාද දුන්හ: ‘මහ උවැසිය වනාහි කැඳ සමඟ හීල්බත් කෑවාය දහවල් ද සුන්සහල් කොළ ඇඹුල් මුසු බතක් අනුභව කරන්නීය. නුම සඳහා පැරණි සහල් ආදිය ගැන කියයි. ඒ සඳහා මොතොමෝ කෙත් වත් බත් හා ඇඳුම් බලාපොරොත්තු නොවෙයි. ත්‍රිවිධ සම්පත් ප්‍රාර්‍ත්‍ථනාකරමින් දෙයි. නුඹ මැයට ඒ සම්පත් දීමට හැක්කෙහිද නොහැක්කෙහිද?’ යනුවෙනි. මේ පිණ්ඩපාතය නුඹ විසින් රාගසහිතව දේවෂ සහිතව මොහ සහිතව ගැනීමට නොහැකියයි පාත්‍රය පසුම්බියෙහි බහා ගැටඔටුව මුදු ආපසු හැරී කස්සක ලෙණටම ගොස් පාත්‍රයා ඇඳයටද සිවුර සිවුරුවැටෙහිද තබා රහත්බවට නොපැමිණ නොනික්මෙමැයි විර්යය අදිටන්කොට හුන්හ. දිගුකලක් අප්‍රමාදීව විසූ භික්‍ෂූන්වහන්සේ විදර්‍ශනා වඩා පෙරබතෙහිම රහත්බවට පත්ව පිපෙන පියුමක් මෙන් මහරහත්ව සිනහවක් පහළ කරමින්ම නික්මුණුසේක. ලෙන්දොර අධිගෘහීත දේවතාවා:"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 611,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "“නමො තෙ පුරිසාජඤ්ඤ, නමො තෙ පුරිසුත්තම;\nයස්ස තෙ ආසවා ඛීණා, දක්ඛිණෙය්යොසි මාරිසා”ති. –",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "උදානං උදානෙත්වා, “භන්තෙ, පිණ්ඩාය පවිට්ඨානං තුම්හාදිසානං අරහන්තානං භික්ඛං දත්වා මහල්ලකිත්ථියො දුක්ඛා මුච්චිස්සන්තී”ති ආහ. ථෙරො උට්ඨහිත්වා ද්වාරං විවරිත්වා කාලං ඔලොකෙන්තො “පාතොයෙවා”ති ඤත්වා පත්තචීවරං ආදාය ගාමං පාවිසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "දාරිකාපි භත්තං සම්පාදෙත්වා “ඉදානි මෙ භාතා ආගමිස්සති, ඉදානි මෙ භාතා ආගමිස්සතී”ති ද්වාරං ඔලොකයමානා නිසීදි. සා ථෙරෙ ඝරද්වාරං සම්පත්තෙ පත්තං ගහෙත්වා සප්පිඵාණිතයොජිතස්ස ඛීරපිණ්ඩපාතස්ස පූරෙත්වා හත්ථෙ ඨපෙසි. ථෙරො “සුඛං හොතූ”ති අනුමොදනං කත්වා පක්කාමි. සාපි තං ඔලොකයමානාව අට්ඨාසි. ථෙරස්ස හි තදා අතිවිය පරිසුද්ධො ඡවිවණ්ණො අහොසි, විප්පසන්නානි ඉන්ද්රියානි, මුඛං බන්ධනා පවුත්තතාලපක්කං විය අතිවිය විරොචිත්ථ."
                    },
                    {
                        "type": "paragraph",
                        "text": "මහාඋපාසිකා අරඤ්ඤතො ආගන්ත්වා “කිං, අම්ම, භාතිකො තෙ ආගතො”ති පුච්ඡි. සා සබ්බං තං පවත්තිං ආරොචෙසි. උපාසිකා “අජ්ජ මෙ පුත්තස්ස පබ්බජිතකිච්චං මත්ථකං පත්ත”න්ති ඤත්වා “අභිරමති තෙ, අම්ම, භාතා බුද්ධසාසනෙ, න උක්කණ්ඨතී”ති ආහ."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පිණ්ඩපාතිකතිස්සත්ථෙරවත්ථු** පන එවං වෙදිතබ්බං – මහාගාමෙ කිර එකො දලිද්දපුරිසො දාරුවික්කයෙන ජීවිකං කප්පෙති. සො තෙනෙව කාරණෙන නාමං ලභිත්වා දාරුභණ්ඩකමහාතිස්සො නාම ජාතො. සො එකදිවසං අත්තනො භරියං ආහ – “කිං අම්හාකං ජීවිතං නාම, සත්ථාරා දළිද්දදානස්ස මහප්ඵලභාවො කථිතො, මයඤ්ච නිබද්ධං දාතුං න සක්කොම, පක්ඛිකභත්තමත්තං දත්වා පුන උප්පන්නං සලාකභත්තම්පි දස්සාමා”ති. සා “සාධු සාමී”ති සම්පටිච්ඡිත්වා පුනදිවසෙ යථාලාභෙන පක්ඛිකභත්තං අදාසි. භික්ඛුසඞ්ඝස්ස ච පච්චයෙහි නිප්පරිස්සයකාලො හොති, දහරසාමණෙරා පණීතභොජනානි භුඤ්ජිත්වා “අයං ලූඛාහාරො”ති තෙසං පක්ඛිකභත්තං ගහිතමත්තකමෙව කත්වා තෙසං පස්සන්තානංයෙව ඡඩ්ඩෙත්වා ගච්ඡන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සා ඉත්ථී තං දිස්වා සාමිකස්ස කථෙසි, “මයා දින්නං ඡඩ්ඩෙන්තී”ති න පන විප්පටිසාරිනී අහොසි. තස්සා සාමිකො ආහ – “මයං දුග්ගතභාවෙන අය්යානං සුඛෙන පරිභුඤ්ජාපෙතුං නාසක්ඛිම්හ. කිං නු ඛො කත්වා අය්යානං මනං ගහෙතුං සක්ඛිස්සාමා”ති? අථස්ස භරියා ආහ – “කිං වදෙසි, සාමි, සපුත්තකා දුග්ගතා නාම නත්ථීති අයං තෙ ධීතා, ඉමං එකස්මිං කුලෙ ඨපෙත්වා ද්වාදස කහාපණෙ ගණ්හිත්වා එකං ඛීරධෙනුං ආහර, අය්යානං ඛීරසලාකභත්තං දස්සාම, එවං තෙසං චිත්තං ගණ්හිතුං සක්ඛිස්සාමා”ති. සො සාධූති සම්පටිච්ඡිත්වා තථා අකාසි. තෙසං පුඤ්ඤෙන සා ධෙනු සායං තීණි මාණිකානි, පාතො තීණි මාණිකානි ඛීරං දෙති. සායං ලද්ධං දධිං කත්වා පුනදිවසෙ තතො ගහිතනවනීතෙන සප්පිං කත්වා සසප්පිපරිසෙකං ඛීරසලාකභත්තං දෙන්ති. තතො පට්ඨාය තස්ස ගෙහෙ සලාකභත්තං පුඤ්ඤවන්තාව ලභන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "‘ශ්‍රෙෂ්ඨ පුරුෂය ඔබට නමස්කාර වේවා! පුරුෂොත්තමය ඔබට නමස්කාර වේවා! පින්වත, ඔබගේ ආශ්‍රවයෝ ක්‍ෂයවූවාහුද ඔබ දක්‍ෂිණාවට සුදුස්සෙක්වූවෙහිය’යි"
                    },
                    {
                        "type": "unindented",
                        "text": "උදන් අනන්නී ‘ස්වාමීනි, පිඬු පිවිසි ඔබ වැනි රහතන්වහන්සේලාට භික්‍ෂාවදී මහලු ස්ත්‍රීහු දුකින් මිදෙතියි කීවාය. තෙරණුවෝ නැඟිට දොර හැර කල්බලන්නාහු උදෑසනමයයි දැන පාසිවුරු ගෙන ගමට පිවිසුනහ."
                    },
                    {
                        "type": "paragraph",
                        "text": "දැරියද බත් පිළියෙළ කොට දැන් මගේ සොහොයුරා එන්නේය, දැන් එන්නේයයි දොරටුව බලමින් හුන්නාය. ඕතොමෝ තෙරුන් ගෙදොරට සපැමිණි කල්හි පාත්‍රය ගෙන ගිතෙල් පැණි යෙදූ කිරිපිඩුඅහර පුරවා අතෙහි තැබුවාය. තෙරණුවෝ සුවපත්වේවායි අනුමෙවෙනි වදාරා වැඩියහ. ඕතොමෝත් උන්වහන්සේ දෙස බලමින් සිටියාය. එදින තෙරුන්වහන්සේගේ සමේ පැහැය බෙහෙවින් පිවිතුරුවූයේ විය. පසන් ඉඳුරෝවූහ. මුහුණ නටුවෙන් මිදුණු තල් ගෙඩියක් මෙන් අතිශයින්ම බැබලීය."
                    },
                    {
                        "type": "paragraph",
                        "text": "මහඋවැසිය, වනයෙන් අවුත් ‘කිම දරුව? ඔබගේ සොහොයුරා අවේදැයි ඇසුවාය. ඕතොමෝ සියලු පවත් සැළකළාය. උවැසිය අද මපුතණුවන්ගේ පැවිදි කිස මුදුන් පැමිණියේයයි දැන දරුව ඔබගේ සොහොයුරා බුදු සසුනෙහි ඇලෙයි. උකටලී නොවෙයි කීවාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "පිණ්ඩපාතික තෙරුන්ගේ කථාවස්තුව මෙසේ දතයුතුය: මාගම එක් දිළිඳු පුරුෂයෙක් දැව විකිණීමෙන් දිවි ගෙවයි. හෙතෙම එකරුනින්ම නම ලබා දාරුභණ්ඩක මහා තිස්ස නම් වූයේය. හෙතෙම එක් දිනක් තම බිරියට ‘අපගේ ජීවිතය නම් කිමෙක්ද? ශාස්තාන්වහන්සේ විසින් දිළිඳු දානයේ මහත්ඵල භාවය කියනලදී. අපිත් නිබඳව දීමට නොහැක්කෝ වෙමු. වාරබතක් පමණක්දී යළි ඇතිකල්හි ලහබතක්ද දෙන්නෙමු’යි කීවේය. ඒ මැනවි ස්වාමිනියි පිළිගෙන දෙවැනි දිනයෙහි ලැබුනු පරිද්දෙන් වාරබතක් දුන්නාය. බික්සඟනටද ප්‍රත්‍යයන්ගෙන් නොඅඩු කලක් විය. කුඩා සාමණේරවරු ප්‍රණීත භෝජන වළඳා මේ රළු අහරකැයි ඔවුන්ගේ වාරබත ගත් පමණින්ම ඔවුන් බලාසිටියදීම ඉවත දමා යති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඒ ස්ත්‍රිය එය දැක සැමියාට මාදුන් දෙය ඉවතදමතියි කීවාය. එතෙකුදුවුවත් විපිළිසර නොවූවාය. ඇයගේ සැමියා මෙසේ කීවේය. ‘අපි දිළිඳු බවින් ආර්‍ය්‍යයන්ට සුවසේ වළඳවන්නට නොහැක්කම්හ. කුමක්නම්කොට ආර්‍ය්‍යයන්ගේ සිත ගැනීමට හැක්කමෝද?’ ඉක්බිති ඔහුට බිරිඳ මෙසේ කීවාය: කුමක් කියහිද? දරුවන් සහිතවූ දිළින්දෝ නම් ඇත්ද? මෝ ඔබේ දුවයි. මැය එක් කුලයක තබා කහවණු දොළසක් ගෙන එක් කිරිදෙනක් ගෙනෙනු මැනව. ආර්‍ය්‍යවරුන්ට කිරිසලාක බතක් දෙන්නෙමු. මෙසේ ඔවුන්ගේ සිත ගැනීමට හැකි වන්නෙමු.’ හෙතෙම මැනවයි පිළිගෙන එසේ කළේය. ඔවුන්ගේ පිනෙන් ඒ දෙන සවස මාණික (දොණසතර) තුනක්ද උදය මාණික තුනක්ද කිරි දෙයි. සවස ලැබූ කිරි දී බවට පමුණුවා දෙවන දිනයෙහි එයින් ගත් නවතීත (වෙඩරු) වලින් ගිතෙල්කොට ගිතෙල් මුසු කිරිසලාක බතක් දෙයි එතැන්පටන් ඔහුගේ ගෙහි ලහබත පින්වත්තුම ලබති."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 613,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සො එකදිවසං භරියං ආහ – “මයං ධීතු අත්ථිතාය ලජ්ජිතබ්බතො ච මුත්තා, ගෙහෙ ච නො භත්තං අය්යානං පරිභොගාරහං ජාතං. ත්වං යාව අහං ආගච්ඡාමි, තාව ඉමස්මිං කල්යාණවත්තෙ මා පමජ්ජි. අහං කිඤ්චිදෙව කත්වා ධීතරං මොචෙස්සාමී”ති. සො එකං පදෙසං ගන්ත්වා උච්ඡුයන්තකම්මං කත්වා ඡහි මාසෙහි ද්වාදස කහාපණෙ ලභිත්වා “අලං එත්තකං මම ධීතු මොචනත්ථායා”ති තෙ කහාපණෙ දුස්සන්තෙ බන්ධිත්වා “ගෙහං ගමිස්සාමී”ති මග්ගං පටිපජ්ජි."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්මිං සමයෙ අම්බරියමහාවිහාරවාසී පිණ්ඩපාතියතිස්සත්ථෙරො “තිස්සමහාවිහාරං ගන්ත්වා චෙතියං වන්දිස්සාමී”ති අත්තනො වසනට්ඨානතො මහාගාමං ගච්ඡන්තො තමෙව මග්ගං පටිපජ්ජි. සො උපාසකො ථෙරං දූරතොව දිස්වා “එකකොව අගන්ත්වා ඉමිනා අය්යෙන සද්ධිං එකං ධම්මකථං සුණන්තො ගමිස්සාමි. සීලවන්තො හි සබ්බකාලං දුල්ලභා”ති වෙගෙන ථෙරං සම්පාපුණිත්වා අභිවාදෙත්වා සද්ධිං ගච්ඡන්තො වෙලාය උපකට්ඨාය චින්තෙසි – “මය්හං හත්ථෙ පුටකභත්තං නත්ථි, අය්යස්ස ච භික්ඛාකාලො සම්පත්තො, අයඤ්ච මෙ පරිබ්බයො හත්ථෙ අත්ථි, එකං ගාමද්වාරං පත්තකාලෙ අය්යස්ස පිණ්ඩපාතං දස්සාමී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්සෙවං චිත්තෙ උප්පන්නමත්තෙයෙව එකො පුටකභත්තං ගහෙත්වා තං ඨානං සම්පත්තො. උපාසකො තං දිස්වා, “භන්තෙ, ථොකං ආගමෙථා”ති වත්වා තං උපසඞ්කමිත්වා ආහ – “කහාපණං තෙ, භො පුරිස, දම්මි, තං මෙ පුටකභත්තං දෙහී”ති. සො චින්තෙසි – “ඉමං භත්තං ඉමස්මිං කාලෙ මාසකම්පි න අග්ඝති, අයඤ්ච මය්හං එකවාරෙනෙව කහාපණං දෙති, භවිස්සතෙත්ථ කාරණ”න්ති චින්තෙත්වා “නාහං කහාපණෙන දෙමී”ති ආහ. එවං සන්තෙ ද්වෙ ගණ්හ, තීණි ගණ්හාති ඉමිනා නියාමෙන සබ්බෙපි තෙ කහාපණෙ දාතුකාමො ජාතො. ඉතරො “අඤ්ඤෙපිස්ස අත්ථී”ති සඤ්ඤාය “න දෙමි”ච්චෙව ආහ. අථ නං සො ආහ – “සචෙ මෙ, භො, අඤ්ඤෙපි අස්සු, තෙපි දදෙය්යං. න ඛො පනාහං අත්තනො අත්ථාය ගණ්හාමි, එතස්මිං මෙ රුක්ඛමූලෙ එකො අය්යො නිසීදාපිතො, තුය්හම්පි කුසලං භවිස්සති, දෙහි මෙ භත්ත”න්ති. තෙන හි, භො, ගණ්හ, ආහර තෙ කහාපණෙති කහාපණෙ ගහෙත්වා පුටකභත්තං අදාසි. උපාසකො භත්තං ගහෙත්වා හත්ථෙ ධොවිත්වා ථෙරං උපසඞ්කමිත්වා “පත්තං නීහරථ, භන්තෙ”ති ආහ. ථෙරො පත්තං නීහරිත්වා උපඩ්ඪභත්තෙ දින්නෙ පත්තං පිදහි. උපාසකො ආහ – “අයං, භන්තෙ, එකස්සෙව පටිවිසො, න සක්කා මයා ඉතො භුඤ්ජිතුං. තුම්හාකංයෙව මෙ අත්ථාය ඉමං පරියෙසිත්වා ලද්ධං, ගණ්හථ නං මං අනුකම්පං උපාදායා”ති. ථෙරො “අත්ථි එත්ථ කාරණ”න්ති ගහෙත්වා සබ්බං පරිභුඤ්ජි. උපාසකො ධමකරණෙන පානීයං පරිස්සාවෙත්වා අදාසි. තතො නිට්ඨිතභත්තකිච්චෙ ථෙරෙ උභොපි මග්ගං පටිපජ්ජිංසු."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "හෙතෙතම එක් දිනෙක බිරියට, අපි දුව ඇති බැවින් ලජ්ජාවිය යුතු බවින් මිදුනෙමු. අපගේ ගෙහිද ආර්‍ය්‍යයන්ගේ පරිභෝගයට සුදුසු බත්ද හට ගැණින. මා එන තෙක් මේ යහපත් ක්‍රියාමාර්ගයෙහි පමා නොවව. මම යම් කිසිවක්කොට දියණිය මුදාගන්නෙමි’යි කීවේය. හෙතෙම එක් පෙදෙසකට ගොස් උක් ඇඹරුම් හලක වැඩකොට සමසකින් කහවණු දෙළසක් ලැබ මගේ දුව මුදා ගැනීම සඳහා මෙපමණක් ඇතැයි ඒ කහවණු දසරුවෙහි බැඳ ගෙදර යමැයි මගට පිළිපන්නේය."
                    },
                    {
                        "type": "paragraph",
                        "text": "එසමයෙහි අම්බරියවිහාරවාසී පිණ්ඩපාතිය තිස්ස තෙරණුවෝ තිස්ස මහා විහාරයට ගොස් සෑය වඳින්නෙමැයි තමන් වසන තැනින් මහගමට වඩින්නාහු ඒ මගටම පිළිපන්හ. ඒ උවසුතෙමේ තෙරුන් දුරදීම දැක තනිව නොගොස් මේ ආර්‍ය්‍යයන්වහන්සේ සමඟ එක් ධර්‍මකථාවක් අසමින් යන්නෙමි. සිල්වතුන් නම් හැම කල්හිම ලැබීම අමාරුයයි ඉක්මණින් තෙරුන් වෙතට පැමිණ වැඳ සමඟ යන්නේ (වළඳන) වේලාව ළං වූවිට, මෙසේ සිතුවේය: ‘මගේ අතේ බත්මුලක් නැත. ආර්‍ය්‍යයන්වහන්සේගේද භික්‍ෂා කාලය සපැමිණියේය. මාගේ මේ වියදම් මුදලද අතේ ඇත. එක් ගම්දොරකට පැමිණි කල ආර්‍ය්‍යයන්වහ්නසේට පිණ්ඩපාතය දෙමි’"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඔහුට මෙසේ සිත උපන් කෙණෙහි එක් පුද්ගලයෙක් බත්මුලක් ගෙන එතැනට පැමිණියේය. උවසු තෙමේ ඔහු දැක ස්වාමීනි, බලාපොරොත්තු වන්නැයි පවසා ඒ පුද්ගලයා වෙතට ගොස් ‘පින්වත් පුරුෂය, ඔබට කහවණුවක් දෙමි මට මේ බත්මුල දෙව’යි කීවේය. හෙතෙම මේ බත මෙකල මාසකයකයකුදු නොවටියි. මෙතෙමේත් මට එකවරින්ම කහවණුවක් දෙයි. මෙහි කුමන හෝ කරුණක් ඇතැයි සිතුවේය. සිතා මම කහවණුවකට නොදෙමියි කීවේය. එසේ නම් දෙකක් ගනුව, තුනක් ගනුවයි මේ ක්‍රමයෙන් සියලුම කහවණු ඔහුට දෙනු කැමැත්තේ විය. ඒ පුද්ගලයා මොහුට වෙනත් කහවණුද ඇතැයි හැඟීමෙන් නොදෙමැයි කීවේය. එවිට උපාසක තෙමේ ඔහුට මෙසේ කීය. ‘පින්වත, ඉදින් මට තවත් ඇත්නම් ඒවාද දෙන්නෙමි. මම මෙය මා සඳහා නොගනිමි. මවිසින් මේ ගසමුල එක් ආර්‍ය්‍යයන්වහන්සේ නමක් හිඳුවනලදසේක. මට බත්මුල දෙන්න. නුඹටද පින් සිදු වන්නේය.’ ‘පින්වත, එසේ නම් ගන්න. ඔබගේ කහවණු ගෙනෙව’යි කහවණු ගෙන බත්මුල දුන්නේය. උවසුතෙමේ බත ගෙන අත දොවා තෙරුන් වෙත එළඹ ස්වාමීනි, පාත්‍රය එළවනු මැනවැයි කීවේය. තෙරුන්වහන්සේ පාත්‍රය එළවා බත් අඩක් දුන් කල්හි අත වැසූහ. උවසු තෙමේ, ‘ස්වාමීනි, මේ එකම කොටසකි. මෙයින් මට අනුභව කිරීමට නොහැක. මවිසින් නුඹවහන්සේම උදෙසා සොයා ලබනලද්දකි. මෙය මට අනුකම්පා උපදවා ගනුමැනවැ’යි කීවේය. තෙරණුවෝ මෙහි යම් කරුනක් ඇතැයි ගෙන සියල්ල වැළඳූහ. උවසුතෙමේ පෙරහනින් දිය පෙරා දුන්නේය. ඉක්බිති තෙරුන්වහන‍්සේ බත්කිස නිමවූකල්හි දෙදෙනාමමගට පිළිපන්හ."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 615,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ථෙරො උපාසකං පුච්ඡි – “කෙන කාරණෙන ත්වං න භුඤ්ජසී”ති. සො අත්තනො ගමනාගමනවිධානං සබ්බං කථෙසි. ථෙරො තං සුත්වා සංවෙගප්පත්තො චින්තෙසි – “දුක්කරං උපාසකෙන කතං, මයා පන එවරූපං පිණ්ඩපාතං පරිභුඤ්ජිත්වා එතස්ස කතඤ්ඤුනා භවිතබ්බං. සප්පායසෙනාසනං ලභිත්වා තත්ථෙව ඡවිමංසලොහිතෙසු සුක්ඛන්තෙසුපි නිසින්නපල්ලඞ්කෙනෙව අරහත්තං අප්පත්වා න උට්ඨහිස්සාමී”ති. සො තිස්සමහාවිහාරං ගන්ත්වා ආගන්තුකවත්තං කත්වා අත්තනො පත්තසෙනාසනං පවිසිත්වා පච්චත්ථරණං අත්ථරිත්වා තත්ථ නිසින්නො අත්තනො මූලකම්මට්ඨානමෙව ගණ්හි. සො තාය රත්තියා ඔභාසමත්තම්පි නිබ්බත්තෙතුං නාසක්ඛි. පුනදිවසතො පට්ඨාය භික්ඛාචාරපලිබොධං ඡින්දිත්වා තදෙව කම්මට්ඨානං අනුලොමපටිලොමං විපස්සි. එතෙනුපායෙන විපස්සන්තො සත්තමෙ අරුණෙ සහ පටිසම්භිදාහි අරහත්තං පත්වා චින්තෙසි – “අතිවිය මෙ කිලන්තං සරීරං, කිං නු ඛො මෙ ජීවිතං චිරං පවත්තිස්සති, න පවත්තිස්සතී”ති. අථස්ස අප්පවත්තනභාවං දිස්වා සෙනාසනං පටිසාමෙත්වා පත්තචීවරමාදාය විහාරමජ්ඣං ගන්ත්වා භෙරිං පහරාපෙත්වා භික්ඛුසඞ්ඝං සන්නිපාතෙසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "සඞ්ඝත්ථෙරො “කෙන භික්ඛුනාසඞ්ඝො සන්නිපාතිතො”ති පුච්ඡි. මයා, භන්තෙති. කිමත්ථං සප්පුරිසාති. භන්තෙ, අඤ්ඤං කම්මං නත්ථි, යෙසං පන මග්ගෙ වා ඵලෙ වා කඞ්ඛා අත්ථි, තෙ මං පුච්ඡන්තූති. සප්පුරිස තාදිසා නාම භික්ඛූ අසන්තං ගුණං න කථෙන්ති, අම්හාකං එත්ථ කඞ්ඛා නත්ථි. කිං පන තෙ සංවෙගකාරණං අහොසි, කිං පච්චයං කත්වා අරහත්තං නිබ්බත්තන්ති. භන්තෙ, ඉමස්මිං මහාගාමෙ වල්ලියවීථියං දාරුභණ්ඩකමහාතිස්සො නාම උපාසකො අත්තනො ධීතරං බහි ඨපෙත්වා ද්වාදස කහාපණෙ ගණ්හිත්වා තෙහි එකං ඛීරධෙනුං ගහෙත්වා සඞ්ඝස්ස ඛීරභත්තසලාකං පට්ඨපෙසි, සො “ධීතරං මොචෙස්සාමී”ති ඡ මාසෙ යන්තසාලාය භතිං කත්වා ද්වාදස කහාපණෙ ලභිත්වා “ධීතරං මොචෙස්සාමී”ති අත්තනො ගෙහං ගච්ඡන්තො අන්තරාමග්ගෙ මං දිස්වා භික්ඛාචාරවෙලාය සබ්බෙපි තෙ කහාපණෙ දත්වා පුටකභත්තං ගණ්හිත්වා සබ්බං මය්හං අදාසි. අහං තං පිණ්ඩපාතං පරිභුඤ්ජිත්වා ඉධාගන්ත්වා සප්පායසෙනාසනං ලභිත්වා “පිණ්ඩාපචායනකම්මං කරිස්සාමී”ති විසෙසං නිබ්බත්තෙසිං, භන්තෙති. තං ඨානං සම්පත්තා චතස්සොපි පරිසා ථෙරස්ස සාධුකාරං අදංසු. සකභාවෙන සණ්ඨාතුං සමත්ථො නාම නාහොසි. ථෙරො සඞ්ඝමජ්ඣෙ නිසීදිත්වා කථෙන්තො කථෙන්තොව “මය්හං කූටාගාරං දාරුභණ්ඩකමහාතිස්සස්ස හත්ථෙන ඵුට්ඨකාලෙයෙව චලතූ”ති අධිට්ඨාය අනුපාදිසෙසාය නිබ්බානධාතුයා පරිනිබ්බායි."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තෙරුන්වහන්සේ ‘කුමන කරුණක් නිසා නුඹ අනුභව නෞකෙළෙහිදැයි ඇසූහ. හෙතෙම තමන්ගේ සියලු ගමනාගමන විධානය කීවේය තෙරණුවෝ එය අසා සංවේගයට පත්වූවාහු උවසුවා විසින් අමාරු වැඩක් කරනලදී. මවිසින් මෙබඳුවූ පිණ්ඩපාතයක් වළඳා මොහුට කෙළෙහි ගුණ දන්නකු වියයුතුය. සුදුසු සෙනසුනක් ලැබ එහිම සම් මස් ලේ වියලීගියද හුන් පළඟින්ම රහත්බවට නොපැමිණ නොනැගිටිමැ’යි සිතූහ. උන්වහන්සේ තිස්සමහා විහාරයට වැඩමවා ආගන්තුකවත් කොට තමාට ලැබුණු සෙනසුනට පිවිස පසුතුරුන අතුරා එහි වැඩ හුන්නාහු මූලකර්‍මස්තානයම ගත්හ. හෙතෙම එම රාත්‍රියෙහි ආලෝක මාත්‍රයකුදු ඉපදවීමට නොහැකි වූයේය. දෙවැනි දිනයෙහි පටන් භික්‍ෂාචාර බාධකයන් සිඳ එම කර්‍මස්ථානයම අනුලෝම පටිලෝම වශයෙන් බැලීය. මේ ක්‍රමයෙන් විදර්‍ශනා වඩන්නේ සත්වැනි අරුණෙහි පටිසම්භිදාවන් සමඟ රහත්බවට පැමිණ, ‘මගේ ශරීරය අතිශයින්ම ක්ලාන්තය. කිම මගේ ආයුසංස්කාරය බොහෝ කල් පවතීද නැත්දැය සිතුවේය. ඉක්බිති නොපවතින බව දැන සෙනසුන සකස්කොටබා පාසිවුරු ගෙන විහාරයමැදට ගොස් බෙරය හඬවා බික්සඟන රුස්කරවූයේ ය."
                    },
                    {
                        "type": "paragraph",
                        "text": "සංඝස්ථවිර ‘කවුරුන් බික්සඟන රුස්කරවූයේ දැ’යි පිළිවිසූහ. ‘ස්වාමීනි, මවිසිනැ’යි කීවේය. ‘සත්පුරුෂය, කුමක් සඳහාද?’ ‘ස්වාමීනි, වෙනත් වැඩක් නැත. යමෙකුට මාර්‍ගයෙහි හෝ ඵලයෙහි හෝ සැකයක් ඇත්ද ඔවුහු මා විමසත්වා’යි කීවේය. ‘සත්පුරුෂය, කුමක් සඳහාද?’ ‘ස්වාමීනි, වෙනත් වැඩක් නැත. යමෙකුට මාර්‍ගයෙහි හෝ ඵලයෙහි හෝ ඵලයෙහි හෝ සැකයක් ඇත්ද ඔවුහු මා විමසත්වා’යි කීවේය. ‘සත්පුරුෂය, ඔබ වැනි භික්‍ෂුහු නොපවත්නා ගුණයක් නොකියත්. අපට මෙහි සැකයක් නැත. ඔබගේ සංවෙග කාරණය කුමක්වීද? කුමක් ප්‍රත්‍යකොට රහත්බව ඉපදවීදැ’යි අසූහ. ‘සුවාමීනි. මේ මාගම වල්ලිය වීථියෙහි දාරුභණ්ඩක මහාතිස්ස නම් උපාසක තෙමේ තමන්ගේ දියණිය පිටත තබා දොළොස් කහවණුවක් ගෙන ඒවායින් කිරි දෙනක් ගෙන සංඝයාට කිරි සලාක බතක් පිහිටවූයේය. හෙමෙ දියණිය මුදා ගන්නෙමැයි සමසක් යන්ත්‍ර ශාලාවක බැළකොට දොළොස් කහවණුවක් ලැබ දුව මුදාගනිමැයි තමාගේ ගෙදර යන්නේ අතරමගදී මා දැක පිඬු හැසිරෙන වේලෙහි ඔහුගේ සියලු කහවණුදි බත්මුලක් ගෙන සියල්ල මට දුන්නේය. මම ඒ පිණ්ඩපාතය වළඳා මෙහි අවුත් සුදුසු සෙනසුනක් ලැබ පිණ්ඩපාතයට සැලකීමේ කර්‍මය කරමැයි විශේෂයක් ඉපදවූයෙමි ස්වාමීනි’යි කීවේය. එතැනට සැපැමිණි සිවු පිරිසම තෙරුන්ට සාධුකාර දුන්නාහුය. ස්වකීය ස්වභාවයෙන් සිටින්නට සමතෙක් නම් නොවූයේය. තෙරණුවෝ සඟමැද හිඳ කථා කරමින්ම මගේ කුළුගෙය (සිරුර බහා තැබූ දෙන) දාරුභණ්ඩක මහාතිස්සගේ අතින් පැහැසූ කෙණෙහිම සෙලෙවේවායි අදිටන් කොට අනුපාදිසෙස නිවනින් පිරිනිවන් පෑහ."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 617,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කාකවණ්ණතිස්සමහාරාජා “එකො කිර ථෙරො පරිනිබ්බුතො”ති සුත්වා විහාරං ගන්ත්වා සක්කාරසම්මානං කත්වා කූටාගාරං සජ්ජෙත්වා ථෙරං තත්ථ ආරොපෙත්වා “ඉදානි චිතකට්ඨානං ගමිස්සාමා”ති උක්ඛිපන්තො චාලෙතුං නාසක්ඛි. රාජා භික්ඛුසඞ්ඝං පුච්ඡි – “අත්ථි, භන්තෙ, ථෙරෙන කිඤ්චි කථිත”න්ති. භික්ඛූ ථෙරෙන කථිතවිධානං ආචික්ඛිංසු. රාජා තං උපාසකං පක්කොසාපෙත්වා “තයා ඉතො සත්තදිවසමත්ථකෙ කස්සචි මග්ගපටිපන්නස්ස භික්ඛුනො පුටකභත්තං දින්න”න්ති පුච්ඡි. ආම, දෙවාති. කෙන තෙ නියාමෙන දින්නන්ති? සො තං කාරණං සබ්බං ආරොචෙසි. අථ නං රාජා ථෙරස්ස කූටාගාරට්ඨානං පෙසෙසි – “ගච්ඡ තං ථෙරං සඤ්ජාන, සො වා අඤ්ඤො වා”ති. සො ගන්ත්වා සාණිං උක්ඛිපිත්වා ථෙරස්ස මුඛං දිස්වා සඤ්ජානිත්වා ද්වීහි හත්ථෙහි හදයං සන්ධාරෙන්තො රඤ්ඤො සන්තිකං ගන්ත්වා, “දෙව, මය්හං අය්යො”ති ආහ. අථස්ස රාජා මහාපසාධනං දාපෙසි. තං පසාධෙත්වා ආගතං “ගච්ඡ භාතික මහාතිස්ස මය්හං, අය්යාති වත්වා කූටාගාරං උක්ඛිපා”ති ආහ. උපාසකො “සාධු, දෙවා”ති ගන්ත්වා ථෙරස්ස පාදෙ වන්දිත්වා උභොහි හත්ථෙහි උක්ඛිපිත්වා අත්තනො මත්ථකෙ අකාසි. තස්මිංයෙව ඛණෙ කූටාගාරං ආකාසෙ උප්පතිත්වා චිතකමත්ථකෙ පතිට්ඨාසි. තස්මිං කාලෙ චිතකස්ස චතූහිපි කණ්ණෙහි සයමෙව අග්ගිජාලා උට්ඨහිංසූති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“මහන්තං ඛො පනෙතං සත්ථු දායජ්ජං, යදිදං සත්ත අරියධනානි නාම, තං න සක්කා කුසීතෙන ගහෙතුං. යථා හි විප්පටිපන්නං පුත්තං මාතාපිතරො ‘අයං අම්හාකං අපුත්තො’ති පරිබාහිරං කරොන්ති, සො තෙසං අච්චයෙන දායජ්ජං න ලභති, එවං කුසීතොපි ඉදං අරියධනදායජ්ජං න ලභති, ආරද්ධවීරියොව ලභතී”ති **දායජ්ජමහත්තං පච්චවෙක්ඛතොපි** උප්පජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“මහා ඛො පන තෙ සත්ථා. සත්ථුනො හි තෙ මාතුකුච්ඡිම්හි පටිසන්ධිං ගහණකාලෙපි, අභිනික්ඛමනෙපි, අභිසම්බොධියම්පි, ධම්මචක්කප්පවත්තනයමකපාටිහාරියදෙවොරොහනආයුසඞ්ඛාරවොස්සජ්ජනෙසුපි, පරිනිබ්බානකාලෙපි දසසහස්සිලොකධාතු කම්පිත්ථ. යුත්තං නු තෙ එවරූපස්ස සත්ථුනො සාසනෙ පබ්බජිත්වා කුසීතෙන භවිතු”න්ති එවං **සත්ථුමහත්තං පච්චවෙක්ඛතොපි** උප්පජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“ජාතියාපි ත්වං ඉදානි න ලාමකජාතිකො, අසම්භින්නාය මහාසම්මතපවෙණියා ආගතඔක්කාකරාජවංසෙ ජාතොසි, සුද්ධොදනමහාරාජස්ස ච මහාමායාදෙවියා ච නත්තා, රාහුලභද්දස්ස කනිට්ඨො, තයා නාම එවරූපෙන ජිනපුත්තෙන හුත්වා න යුත්තං කුසීතෙන විහරිතු”න්ති එවං **ජාතිමහත්තං පච්චවෙක්ඛතොපි** උප්පජ්ජති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කාවන්තිස් මහරජ තෙමේ එක් තෙරණුකෙනෙක් පිරිනිවන් පෑහයි අසා විහාරයට ගොස් සත්කාර සම්මානකොට කුළුගෙයක් පිළියෙළ කරවා තෙරුන් එහි තබා දැන් චිත්කස්ථානයට යම්භයි ඔසවන්නාහු සෙලවීමට නොහැකිවූහ. රජතෙමේ ‘තෙරුන් කිසිවක් කියන ලදදැ’යි බික්සඟන විමසීය. භික්‍ෂුහු තෙරුන් විසින් කියන ලද විධිය පැවසූහ. රජතෙමේ ඒ උවසුවා ගෙන්වා ‘ඔබ විසින් මෙයින් සත් දිනකට මත්තෙහි මගට පිළිපන් කිසියම් භික්‍ෂුවකට බත්මුලක් දෙන ලදදැයි ඇසීය. ‘එසේය දේවයිනි’යි පැවසීය. ‘ඔබවිසින් කවර අයුරකින් දෙන ලද්දේද?’ හෙතෙම ඒ සියලු කාරණය පැවසීය. ඉක්බිති රජතෙමේ ‘යව, හෙතෙමේද අනෙකෙක්දැයි හැඳින ගනුව’යි ඔහු කුළුගෙය තිබෙන තැනට යැවීය. හෙතෙම ගොස් තිරය ඔසවා තෙරුන්ගේ මුහුණ දැක හැඳින දෙඅතින් උරය අල්ලාගෙන රජු සමීපයට ගොස් දේවයිනි, මගේ ආර්‍ය්‍යයන්වහන්සේයයි පැවසීය. ඉක්බිති රජතෙමේ ඔහුට මහා පළඳනාවක් දෙවූයේය. සැරසී ආ ඔහුට රජතෙමේ, ‘සොහොයුරු මහාතිස්ස, යව මගේ ආර්‍ය්‍යයන් වහන්සේට වැඳ කුළුගෙය ඔසවවයි පැවසීය. උවසුතෙමේ ‘මැනව දේවයිනි’යි ගොස් තෙරුන්ගේ පාදයන් විවිර කොට දෑතින්ම ඔසවා තම හිසමත තැබීය. එකෙණෙහිම කුළුගෙය අහසට නැඟී සෑය මත්තෙහි පිහිටියේය. එවේලෙහි සෑයේ සිවු කොණින්ම ගිනිදැල් තෙමේම නැංගේය."
                    },
                    {
                        "type": "paragraph",
                        "text": "යම් මේ සප්ත ආර්‍ය්‍ය ධනයක් වේද ඒ මේ ශාස්තෘ දායාදය ඉතා මහත්ය. එය කුසීතයකු විසින් ගත නොහැකිය යම්සේ මව්පියෝ නොමඟට පත් පුතකු මේ අපේ පුතෙක් නොවේයයි පිට කරත්ද හෙතෙම ඔවුන්ගේ ඇවෑමෙන් දායාද නොලබයිද එසේ කුසීතයාද මේ ආර්‍ය්‍යධන දායාදය නොලබයි. ඇරඹූ විර්‍ය්‍ය ඇත්තාම ලබන්නේයයි දායාද මහත්වය සැලකීමෙන්ද උපදියි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඔබගේ ශාස්තෘවරයා ශ්‍රේෂ්ඨය. ඔබගේ ශාස්තෘවරයා මව්කුස පිළිසිඳ ගන්නා කාලයෙහිද අභිනිෂ්ක්‍රමණයෙහිදීද බුද්ධත්වයේදීද දම්සක් පැවතුම් යමා මහ පෙළහර දේවාරොහන ආයුසංස්කාර හරණ යන අවස්ථාවන්හිද පිරිනිවන් පානා කල්හිද දසදහසක් ලෝකධාතුව කම්පාවූයේය. එබඳුවූ ශාස්තෘශාසනයෙහි පැවිදිව කුසීතයකු වීමට ඔබට සුදුසුදැයි මෙසේ ශාස්තෘමහත්වය සැලකීමෙන්ද උපදියි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ජාතියෙන්ද ඔබ දැන් පහත් ජාතිකයෙක් නොවෙහි. නොබිඳුණු මහා සම්මත පරපුරෙන් ආ ඔක්කාක රාජවංශයෙහි උපන්නෙහි. සුද්ධොදන මහරජුගේත් මහාමහායා දේවියගේත් මුණුබුරුවූ රාහුල භද්‍රයන්ගේ කනිෂ්ඨයෙහි. ඔබ එවැනි ජින පුත්‍රයකුවී කුසීතයකුව විසීමට නොසුදුසුයයි මෙසේ ජාතිමහත්වය සැලකීමෙන්ද උපදියි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 619,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“සාරිපුත්තමොග්ගල්ලානා චෙව අසීති මහාසාවකා ච වීරියෙනෙව ලොකුත්තරධම්මං පටිවිජ්ඣිංසු, ත්වං එතෙසං සබ්රහ්මචාරීනං මග්ගං පටිපජ්ජසි, න පටිපජ්ජසී”ති එවං **සබ්රහ්මචාරිමහත්තං පච්චවෙක්ඛතොපි** උප්පජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කුච්ඡිං පූරෙත්වා ඨිතඅජගරසදිසෙ විස්සට්ඨකායිකචෙතසිකවීරියෙ කුසීතපුග්ගලෙ පරිවජ්ජෙන්තස්සාපි, ආරද්ධවීරියෙ පහිතත්තෙ පුග්ගලෙ සෙවන්තස්සාපි, ඨානනිසජ්ජාදීසු විරියුප්පාදනත්ථං නින්නපොණපබ්භාරචිත්තස්සාපි උප්පජ්ජති. තස්මා ආදිකම්මිකො කුලපුත්තො ඉමෙහි එකාදසහි කාරණෙහි වීරියසම්බොජ්ඣඞ්ගං සමුට්ඨාපෙත්වා තදෙව ධුරං කත්වා අභිනිවෙසං පට්ඨපෙත්වා අනුක්කමෙන අරහත්තං ගණ්හාති. සො යාව අරහත්තමග්ගා වීරියසම්බොජ්ඣඞ්ගං භාවෙති නාම, ඵලෙ පත්තෙ භාවිතො නාම හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එකාදස ධම්මා **පීතිසම්බොජ්ඣඞ්ගස්ස** උප්පාදාය සංවත්තන්ති – බුද්ධානුස්සති, ධම්මසඞ්ඝසීලචාගදෙවතානුස්සති උපසමානුස්සති, ලූඛපුග්ගලපරිවජ්ජනතා, සිනිද්ධපුග්ගලසෙවනතා, පසාදනීයසුත්තන්තපච්චවෙක්ඛණතා, තදධිමුත්තතාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "බුද්ධගුණෙ අනුස්සරන්තස්සාපි හි යාව උපචාරා සකලසරීරං ඵරමානො පීතිසම්බොජ්ඣඞ්ගො උප්පජ්ජති, ධම්මසඞ්ඝගුණෙ අනුස්සරන්තස්සාපි, දීඝරත්තං අඛණ්ඩං කත්වා රක්ඛිතං චතුපාරිසුද්ධිසීලං පච්චවෙක්ඛන්තස්සාපි, ගිහිනො දසසීලං පඤ්චසීලං පච්චවෙක්ඛන්තස්සාපි, දුබ්භික්ඛභයාදීසු පණීතභොජනං සබ්රහ්මචාරීනං දත්වා “එවංනාම අදම්හා”ති චාගං පච්චවෙක්ඛන්තස්සාපි, ගිහිනොපි එවරූපෙ කාලෙ සීලවන්තානං දින්නදානං පච්චවෙක්ඛන්තස්සාපි, යෙහි ගුණෙහි සමන්නාගතා දෙවත්තං පත්තා, තථාරූපානං ගුණානං අත්තනි අත්ථිතං පච්චවෙක්ඛන්තස්සාපි, සමාපත්තියා වික්ඛම්භිතෙ කිලෙසා සට්ඨිපි සත්තතිපි වස්සානි න සමුදාචරන්තීති පච්චවෙක්ඛන්තස්සාපි, චෙතියදස්සනබොධිදස්සනථෙරදස්සනෙසු අසක්කච්චකිරියාය සංසූචිතලූඛභාවෙ බුද්ධාදීසු පසාදසිනෙහාභාවෙන ගද්රභපිට්ඨෙ රජසදිසෙ ලූඛපුග්ගලෙ පරිවජ්ජෙන්තස්සාපි, බුද්ධාදීසු පසාදබහුලෙ මුදුචිත්තෙ සිනිද්ධපුග්ගලෙ සෙවන්තස්සාපි, රතනත්තයගුණපරිදීපකෙ පසාදනීයසුත්තන්තෙ පච්චවෙක්ඛන්තස්සාපි, ඨානනිසජ්ජාදීසු පීතිඋප්පාදනත්ථං නින්නපොණපබ්භාරචිත්තස්සාපි උප්පජ්ජති. තස්මා ආදිකම්මිකො කුලපුත්තො ඉමෙහි එකාදසහි කාරණෙහි පීතිසම්බොජ්ඣඞ්ගං සමුට්ඨාපෙත්වා තදෙව ධුරං කත්වා අභිනිවෙසං පට්ඨපෙත්වා අනුක්කමෙන අරහත්තං ගණ්හාති. සො යාව අරහත්තමග්ගා පීතිසම්බොජ්ඣඞ්ගං භාවෙති නාම, ඵලෙ පත්තෙ භාවිතො නාම හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සාරිපුත්ත මොග්ගල්ලාන දෙදෙනා මෙන්ම අසූ මහ සව්වෝද විර්යයෙන්ම ලෝකෝත්තර ධර්‍මයන් අවබෝධ කළාහුය. නුඹ ඒ සබ්‍රම්සරුන්ගේ මගට පිළිපන්නෙහිද නොපිළිපන්නෙහිදැයි මෙසේ සබ්‍රහ්මචාරි මහත්වය සැලකීනේද උපදියි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කුසපුරා සිටි පිඹුරකුසේ අත්හළ කායිකචෛතසික වීර්ය ඇති කුසීත පුද්ගලයන් දුරලන්නාටද ඇරඹූ විර්ය ඇති ප්‍රධාන වීර්යයෙහි යෙදුණු පුද්ගලයන් ඇසුරු කරන්නාටද සිටීම් හිඳීම් ආදියෙහි වීර්ය ඉපදවීම සඳහා නතුවූ යොමුවූ නැඹුරුවූ සිතැත්තාටද උපදියි. එබැවින් ආදිකර්මික කුලපුත්‍ර තෙමේ මේ එකොළොස් ආකාර කරුණින් වීර්ය සම්බෝධ්‍යංගය නංවා එයම ධුරය කොට සිත නිරත කොට අනුක්‍රමයෙන් රහත්බව ගනියි. හෙතෙම රහත් මග දක්වා වීරිය සම්බොජක්‍ධඞගය වඩයි නමි. ඵලය පැමිණි කල වඩන ලද්දේ නම් වෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "එකොළොස් ධර්‍ම කෙනෙක් පීති සම්බෝජක්‍ධංගයාගේ ඉපදීම සඳහා පවතිත්. බුද්ධානුස්සතිය, ධම්ම සංඝ සීල චාග දෙවතා අනුස්සති, උපසමානුස්සතිය, රළු පුද්ගලයන් දුරලීම, මෘදු පුද්ගලයන් ඇසුරු කිරීම, ප්‍රසාදය ඇති කරවන සූත්‍රාන්තයන් මෙනෙහි කිරීම එහිම නියුක්ත වීම යනුවෙනි."
                    },
                    {
                        "type": "paragraph",
                        "text": "බුදුගුණයෙන් සිහි කරන්නාටද උපචාරය තෙක් සියල් සිරුරෙහි පැතිරෙමින් පීති සමාබොජක්‍ධඞ්ගය උපදියි. දහම් සඟුන් ගුණ සිහි කරන්නාටද බොහෝ කලක් නොකඩ කොට රක්නාලද සතර සංවරසීලය ප්‍රත්‍යවේක්‍ෂා කරන්නාටද දසසිල් පන්සිල් සිහිකරන ගිහියාටද දුර්භික්‍ෂභායාදියෙහි සබ්‍රම්සරුන්ට මෙබඳු නම් ප්‍රණීත භෝජනයක් දුනිමියි ත්‍යාගය සිහි කරන්නාටද එබඳු කල්හි සිල්වතුන්ට දෙනලද දානය සිහිපත් කරන ගිහියාටද යම් ගුණයන්ගෙන් යුක්තවූවාහු දේවත්වයට පැමිණියාහුද එබඳු ගුණයන් තමන් වෙත ඇති බව සිහිපත් කරන්නාටද සමවතින් කෙලෙසුන් මැඩපැවැත්වූකල්හි අවුරුදු සැටක්ද සැත්තෑවක්ද නොපවතිතැයි සිහි කරන්නාටද චෛත්‍ය දර්‍ශන බෝධිදර්‍ශන ස්ථවිරදර්‍ශනයන්හිදී නොසකස් ක්‍රියාවෙන් ප්‍රකට කළ රළුබව ඇති, බුද්ධාදීන් කෙරෙහි ප්‍රසාදවත්බවක් සෙනෙහවත්බවක් නොමැති කමින් කොටළුවකු පිටෙහි දූවිලි මෙන් වූ රළු පුද්ගලයන් දුරලන්නාටද බුද්ධාදීන් කෙරෙහි පැහැදීම් බහුලවූ මෙලෙක් සිතැති සිනිඳු පුද්ගලයන් ඇසුරු කරන්නාටද රත්නත්‍රය ගුන ප්‍රකටවන පැහැඳීම් ඇතිකරවන සුලු සූත්‍රාන්තයන් සිහි කරන්නාටද සිටීම් හිදීම් ආදියෙහි ප්‍රීතිය ඉපදවීම් සඳහා නැමුණු නතුවූ නැඹුරුවූ සිත ඇත්තාටද උපදියි. එබැවින් ආදිකර්මික කුලපුත්‍ර තෙමේ මේ එකොළොස් ආකර කරුණින් පීතිසම්බෝජක්‍ධඞ්ගය උපදවා එයම ධුරය කොට අභිනිවේශය පිහිටුවා අනුක්‍රමයෙන් රහත්බව ගනී. හෙතෙම රහත් මග දක්වා පීති සම්බෝජක්‍ධඞ්ගය වඩයි නමි. ඵලය පැමිණිකල්හි වඩන ලද්දේ නම්වෙයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 621,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සත්ත ධම්මා **පස්සද්ධිසම්බොජ්ඣඞ්ගස්ස** උප්පාදාය සංවත්තන්ති – පණීතභොජනසෙවනතා, උතුසුඛසෙවනතා, ඉරියාපථසුඛසෙවනතා, මජ්ඣත්තපයොගතා, සාරද්ධකායපුග්ගලපරිවජ්ජනතා, පස්සද්ධකායපුග්ගලසෙවනතා, තදධිමුත්තතාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පණීතඤ්හි සිනිද්ධං සප්පායභොජනං භුඤ්ජන්තස්සාපි, සීතුණ්හෙසු ච උතූසු ඨානාදීසු ච ඉරියාපථෙසු සප්පායඋතුඤ්ච ඉරියාපථඤ්ච සෙවන්තස්සාපි පස්සද්ධි උප්පජ්ජති. යො පන මහාපුරිසජාතිකො සබ්බඋතුඉරියාපථක්ඛමො හොති, න තං සන්ධායෙතං වුත්තං. යස්ස සභාගවිසභාගතා අත්ථි, තස්සෙව විසභාගෙ උතුඉරියාපථෙ වජ්ජෙත්වා සභාගෙ සෙවන්තස්ස උප්පජ්ජති. මජ්ඣත්තපයොගො වුච්චති අත්තනො ච පරස්ස ච කම්මස්සකතපච්චවෙක්ඛණා. ඉමිනා මජ්ඣත්තපයොගෙන උප්පජ්ජති. යො ලෙඩ්ඩුදණ්ඩාදීහි පරං විහෙඨයමානො විචරති, එවරූපං සාරද්ධකායං පුග්ගලං පරිවජ්ජෙන්තස්සාපි, සංයතපාදපාණිං පස්සද්ධකායං පුග්ගලං සෙවන්තස්සාපි, ඨානනිසජ්ජාදීසු පස්සද්ධිඋප්පාදනත්ථාය නින්නපොණපබ්භාරචිත්තස්සාපි උප්පජ්ජති. තස්මා ආදිකම්මිකො කුලපුත්තො ඉමෙහි සත්තහි කාරණෙහි පස්සද්ධිසම්බොජ්ඣඞ්ගං සමුට්ඨාපෙත්වා තදෙව ධුරං කත්වා අභිනිවෙසං පට්ඨපෙත්වා අනුක්කමෙන අරහත්තං ගණ්හාති. සො යාව අරහත්තමග්ගා පස්සද්ධිසම්බොජ්ඣඞ්ගං භාවෙති නාම, ඵලෙ පත්තෙ භාවිතො නාම හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එකාදස ධම්මා **සමාධිසම්බොජ්ඣඞ්ගස්ස** උප්පාදාය සංවත්තන්ති – වත්ථුවිසදකිරියතා, ඉන්ද්රියසමත්තපටිපාදනතා, නිමිත්තකුසලතා, සමයෙ චිත්තස්ස පග්ගණ්හනතා, සමයෙ චිත්තස්ස නිග්ගණ්හනතා, සමයෙ සම්පහංසනතා, සමයෙ අජ්ඣුපෙක්ඛනතා, අසමාහිතපුග්ගලපරිවජ්ජනතා, සමාහිතපුග්ගලසෙවනතා, ඣානවිමොක්ඛපච්චවෙක්ඛණතා, තදධිමුත්තතාති. තත්ථ **වත්ථුවිසදකිරියතා** ච **ඉන්ද්රියසමත්තපටිපාදනතා** ච වුත්තනයෙනෙව වෙදිතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**නිමිත්තකුසලතා** නාම කසිණනිමිත්තස්ස උග්ගහකුසලතා. **සමයෙ චිත්තස්ස පග්ගණ්හනතා**ති යස්මිං සමයෙ අතිසිථිලවීරියතාදීහි ලීනං චිත්තං හොති, තස්මිං සමයෙ ධම්මවිචයවීරියපීතිසම්බොජ්ඣඞ්ගසමුට්ඨාපනෙන තස්ස පග්ගණ්හනං. **සමයෙ චිත්තස්ස නිග්ගණ්හනතා**ති යස්මිං සමයෙ අච්චාරද්ධවීරියතාදීහි උද්ධතං චිත්තං හොති, තස්මිං සමයෙ පස්සද්ධිසමාධිඋපෙක්ඛාසම්බොජ්ඣඞ්ගසමුට්ඨාපනෙන තස්ස නිග්ගණ්හනං. **සමයෙ සම්පහංසනතා**ති යස්මිං සමයෙ චිත්තං පඤ්ඤාපයොගමන්දතාය වා උපසමසුඛානධිගමෙන වා නිරස්සාදං හොති, තස්මිං සමයෙ අට්ඨසංවෙගවත්ථුපච්චවෙක්ඛණෙන සංවෙජෙති. **අට්ඨ සංවෙගවත්ථූනි** නාම – ජාතිජරාබ්යාධිමරණානි චත්තාරි, අපායදුක්ඛං පඤ්චමං, අතීතෙ වට්ටමූලකං දුක්ඛං, අනාගතෙ වට්ටමූලකං දුක්ඛං, පච්චුප්පන්නෙ ආහාරපරියෙට්ඨිමූලකං දුක්ඛන්ති. රතනත්තයගුණානුස්සරණෙන ච පසාදං ජනෙති. අයං වුච්චති “සමයෙ සම්පහංසනතා”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ධර්‍ම සතක් පස්සද්ධි සම්බෝජක්‍ධංගය ඉපදීම සඳහා පවතියි. ප්‍රණීත භෝජන සේවනය කරනබව, සෘතු සුඛසේවනය කරනබව, ඉරියව් සුවය සෙව්නා බව, මැදහත් ප්‍රයෝග ඇතිබව, දාහසහිත පුද්ගලයන් දුරලන බව, සන්සුන් කාය සහිත පුද්ගලයන් ඇසුරු කරනබව, එහිම නිරතවීම යනුවෙනි. ප්"
                    },
                    {
                        "type": "paragraph",
                        "text": "රණීතවූ සිනිඳු ගැලපෙන බොජුන් වළඳන්නාටද ශීත උෂ්ණ සෘතුන්හිද සිටීම් ආදී ඉරියව් වළදීද ගැලපෙන සෘතුව, ඉරියව්ව ඇසුරු කරන්නාටද ශාන්ත බව උපදියි. යමෙක් වනාහි මහාපුරුෂ ජාතිකයෙක් වේද හෙතෙම සියලු සෘතු ඉරියව් ඉවසන්නෙක්ම වෙයි. මෙය ඔහු සඳහා නොකියනලදී. යමෙකුට අනුකූලතා හා අනනුකූලතා ඇත්ද අනනුකූල සෘතු ඉරියව් අතහැර අනුකූල සෘතු ඉරියව් ඇසුරු කරන ඔහුට උපදියි. තමන්ගේද අනුන්ගේද කරනලද කර්‍මයන් පිළිබඳ ප්‍රත්‍යවේක්‍ෂාව මධ්‍යස්ථප්‍රයෝගයයි කියනුලැබේ. මේ මධ්‍යස්ථ ප්‍රයෝගයෙන්ද උපදියි. යමෙක් ගල්මුඟුරු ආදියෙන් අනුන් වෙහෙසෙමින් වෙසෙයිද මෙබඳුවූ දැඩි සිරුර ඇති පුද්ගලයන් දුරලන්නාටද උපදියි. සංවරවූ අත්පා ඇති සන්සුන් කය ඇති පුද්ගලයන් ඇසුරු කරන්නාටද උපදියි. සිටීම් හිඳීම් ආදියෙහි සන්සුන් බව උපදවන සඳහා නතුවූ යොමුවූ නැඹුරුවූ සිතැත්තාටද උපදියි. එබැවින් ආදිකර්මික කුලපුත්‍ර තෙමේ එයම ධුරය කොට අභිනිවේශය පිහිටුවා අනුකුමයෙන් රහත්බව ගනියි. හෙතෙම රහත් මග දක්වා පස්සද්ධි ස‍්ම්බොජක්‍ධඞ්ගය වඩයි නමි. ඵලය පැමිණි කල වඩනලද්දේ නම් වෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "එකොළොස් ධර්‍මකෙනෙක් සමාධි සම්බෝධ්‍යංගය ඉපදීම සඳහා පවතිත්. වස්තුව ප්‍රකට කරනබව, ඉන්‍ද්‍රියසමතාව සපයනබව, නිමිති ගැනීමේ කුශලතාව, සුදුසු කල්හි සි දැඩිකර ගැනීම, සුදුසු කල්හි සත යටපත් කරගැනීම, සුදුසුකල්හි සිත සතුටුකර ගැනීම, සුදුසුකල්හි මධ්‍යස්ථවීම, සමාහිත නොවූ පුද්ගලයන් දුරලීම, සමාහිත පුද්ගලයන් ඇසුරු කිරීම, ධ්‍යාන විමොක්‍ෂයන් ප්‍රත්‍යවේක්‍ෂා කිරීම, හා එහි නියැලී සිටීම යනුයි. එහි වස්තුව ප්‍රකටකිරීමද ඉන්‍ද්‍රි සමතාව පිළියෙල කිරීමද කියනලද ක්‍රමයෙන්ම දතයුතුයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "නිමිති ගැනීමේ කුශලතාව නම් කසිණ නිමිත්ත උද්ග්‍රහණය කිරීමේ දක්‍ෂතාවයි. සුදුසු කාලයෙහි සිත දැඩිකර ගැනීම යනු යම් විටෙක ඉතා ලිහිල් වීර්‍ය්‍යාදීන්ගෙන් සිත සැඟවුනේ වෙයි. එකල්හි ධම්මවිචයවිරිය පීති සම්බොධ්‍යංගයන් ඔසවා ගැනීමෙන් ඒ සිත දැඩි කොට ගැනීමයි. සුදුසු කාලයෙහි සිත යටපත් කරගැනීම යනු යම් විටෙක අතිශයින් ඇරඹූ වීර්ය බව ආදියෙන් සිත නොසන්සුන්වූයේ වෙයිද එවිය පස්සදධි උපෙක්‍ඛා සම්බෝධ්‍යංගයන් නැංවීමෙන් එය යටපත් කිරීමයි. සුදුසු කල්හි සිත සතුටු කරගැනීම යනු යම් විටෙක සිත ප්‍රඥාව යෙදීමේ අඩුබවින් හෝ සංසිඳීමේ සුවයට නොපැමිණීමෙන් හෝ ආස්වාද රහිතවූයේ වෙයි. එවිට සංවේග වස්තු අට සිහි කිරීමෙන් සංවේගයට පත්වෙයි. සංවේග වස්තු අට නම්: ජාති ජරා ව්‍යාධි මරණ සතරද පස්වැනිවූ අපාය දුකද අතීතයෙහි සංසාරමූලක දුකද අනාගතයෙහි සංසාරමූලක දුකද වර්‍තමානයෙහි ආහාර සෙවීම මුල්කොට ඇති දුකද යනුයි. රතනත්‍රය ගුණ සිහිකිරීමෙන්ද පැහැදීම ඇතිකරයි. මේ සුදුසුකාලයෙහි සිත සතුටු කර ගැනීමයි කියනුලැබේ."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 623,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**සමයෙ අජ්ඣුපෙක්ඛනතා** නාම යස්මිං සමයෙ සම්මාපටිපත්තිං ආගම්ම අලීනං අනුද්ධතං අනිරස්සාදං ආරම්මණෙ සමප්පවත්තං සමථවීථිපටිපන්නං චිත්තං හොති, තදාස්ස පග්ගහනිග්ගහසම්පහංසනෙසු න බ්යාපාරං ආපජ්ජති සාරථි විය සමප්පවත්තෙසු අස්සෙසු. අයං වුච්චති “සමයෙ අජ්ඣුපෙක්ඛනතා”ති. **අසමාහිතපුග්ගලපරිවජ්ජනතා** නාම උපචාරං වා අප්පනං වා අප්පත්තානං වික්ඛිත්තචිත්තානං පුග්ගලානං ආරකා පරිවජ්ජනං. **සමාහිතපුග්ගලසෙවනතා** නාම උපචාරෙන වා අප්පනාය වා සමාහිතචිත්තානං සෙවනා භජනා පයිරුපාසනා. **තදධිමුත්තතා** නාම ඨානනිසජ්ජාදීසු සමාධිඋප්පාදනත්ථංයෙව නින්නපොණපබ්භාරචිත්තතා. එවඤ්හි පටිපජ්ජතො එස උප්පජ්ජති. තස්මා ආදිකම්මිකො කුලපුත්තො ඉමෙහි එකාදසහි කාරණෙහි සමාධිසම්බොජ්ඣඞ්ගං සමුට්ඨාපෙත්වා තදෙව ධුරං කත්වා අභිනිවෙසං පට්ඨපෙත්වා අනුක්කමෙන අරහත්තං ගණ්හාති. සො යාව අරහත්තමග්ගා සමාධිසම්බොජ්ඣඞ්ගං භාවෙති නාම, ඵලෙ පත්තෙ භාවිතො නාම හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්ච ධම්මා **උපෙඛාසම්බොජ්ඣඞ්ගස්ස** උප්පාදාය සංවත්තන්ති – සත්තමජ්ඣත්තතා, සඞ්ඛාරමජ්ඣත්තතා, සත්තසඞ්ඛාරකෙලායනපුග්ගලපරිවජ්ජනතා, සත්තසඞ්ඛාරමජ්ඣත්තපුග්ගලසෙවනතා තදධිමුත්තතාති. තත්ථ ද්වීහාකාරෙහි **සත්තමජ්ඣත්තතං** සමුට්ඨාපෙති “ත්වං අත්තනො කම්මෙන ආගන්ත්වා අත්තනොව කම්මෙන ගමිස්සසි, එසොපි අත්තනො කම්මෙන ආගන්ත්වා අත්තනොව කම්මෙන ගමිස්සති, ත්වං කං කෙලායසී”ති එවං කම්මස්සකතපච්චවෙක්ඛණෙන ච, “පරමත්ථතො සත්තොයෙව නත්ථි, සො ත්වං කං කෙලායසී”ති එවං නිස්සත්තපච්චවෙක්ඛණෙන චාති. ද්වීහෙවාකාරෙහි **සඞ්ඛාරමජ්ඣත්තතං** සමුට්ඨාපෙති “ඉදං චීවරං අනුපුබ්බෙන වණ්ණවිකාරඤ්චෙව ජිණ්ණභාවඤ්ච උපගන්ත්වා පාදපුඤ්ඡනචොළකං හුත්වා යට්ඨිකොටියා ඡඩ්ඩනීයං භවිස්සති, සචෙ පනස්ස සාමිකො භවෙය්ය, නාස්ස එවං විනස්සිතුං දදෙය්යා”ති එවං අස්සාමිකභාවපච්චවෙක්ඛණෙන ච, “අනද්ධනියං ඉදං තාවකාලික”න්ති එවං තාවකාලිකභාවපච්චවෙක්ඛණෙන චාති. යථා ච චීවරෙ, එවං පත්තාදීසුපි යොජනා කාතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සත්තසඞ්ඛාරකෙලායනපුග්ගලපරිවජ්ජනතා**ති එත්ථ යො පුග්ගලො ගිහී වා අත්තනො පුත්තධීතාදිකෙ, පබ්බජිතො වා අත්තනො අන්තෙවාසිකසමානුපජ්ඣායකාදිකෙ මමායති, සහත්ථෙනෙව නෙසං කෙසච්ඡෙදනසූචිකම්මචීවරධොවනරජනපත්තපචනාදීනි කරොති, මුහුත්තම්පි අපස්සන්තො “අසුකො සාමණෙරො කුහිං, අසුකො දහරො කුහි”න්ති භන්තමිගො විය ඉතො චිතො ච ඔලොකෙති, අඤ්ඤෙන කෙසච්ඡෙදනාදීනං අත්ථාය “මුහුත්තං තාව අසුකං පෙසෙථා”ති යාචියමානොපි “අම්හෙපි තං අත්තනො කම්මං න කාරෙම, තුම්හෙ නං ගහෙත්වා කිලමිස්සථා”ති න දෙති, අයං **සත්තකෙලායනො** නාම. යො පන චීවරපත්තථාලකකත්තරයට්ඨිආදීනි මමායති, අඤ්ඤස්ස හත්ථෙන පරාමසිතුම්පි න දෙති, තාවකාලිකං යාචිතො “මයම්පි ඉමං ධනායන්තා න පරිභුඤ්ජාම, තුම්හාකං කිං දස්සාමා”ති වදති, අයං **සඞ්ඛාරකෙලායනො** නාම."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සුදුසුකල්හි මධ්‍යස්ථවීම යනු යම් විටෙක සම්‍යක් ප්‍රතිපත්තියට පැමිණ යටපත් නොවූ නොසන්සුන් නොවූ ආස්වාද සහිතවූ අරමුණෙහි සමව පැවතියාවූ සමථ වීථියට පිළිපන්නාවූ සිතක්වේද? එකල්හි ඔහුට දැඩිකිරීම් යටපත් කිරීම් සතුටුවීම් ආදියෙහි ව්‍යාපාරයක් (නිරතවීමක්) නොවේ. සමව පැවති අශ්වයන් ඇතිවිට රියදුරකුට මෙනි. මෙය සුදුසු කාලයෙහි මධ්‍යස්ථාවීමයයි කියනු ලැබේ. සමාහිත නොවූ පුද්ගලයන් දුරලීම යනු උපචාරයට හෝ අර්පණාවට හෝ නොපත් විසුරුණු සිතැති පුද්ගලයන් දුරින් දුරුකිරීමයි. සමාහිත පුද්ගලයන් ඇසුරුකිරීම යනු උපචාරයෙන් හෝ අර්පණාවෙන් හෝ සන්සුන් සිතැති පුද්ගලයන් ඇසුරුකිරීමයි, එක්ව විසීමයි. එහිම නිරතව සිටීම යනු සිටීම් හිඳීම් ආදියෙහි සමාධිය උපදවීම සඳහාම නතුවූ යොමුවූ නැඹුරුවූ සිතැතිබවයි. මෙසේ පිළපදින්නාට මෙය උපදියි. එබැවින් ආදිකර්මික කුලපුත් තෙමේ මේ එකොළොස් කරුණින් සමාධිය නංවා එයම ධුරය කොට අභිනිවේශය පිහිටුවා අනුක්‍රමයෙන් රහත්බව ගනියි. හෙතෙම රහත්මග දක්වා සමාධි බොධ්‍යංගය වඩයි නම් වේ. ඵලය පැමිණිකල වඩන ලද්දේ නමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ධර්‍මපසක් උපෙක්‍ෂා සම්බෝධ්‍යංගයාගේ ඉපදීම සඳහා පවතියි. සත්‍වමධ්‍යස්ථතාව, සංස්කාර මධ්‍යස්ථතාව. සත්‍වසංස්කාරම්මත්‍වයෙන් ගත් පුද්ගලයන් දුරලීම, සත්‍වසංස්කාර කෙරෙහි මධ්‍යස්ථබව ඇති පුද්ගලයන් ඇසුරු කිරීම, සත්‍ව මධ්‍යස්ථතාව නඟා සිටුවයි. නුඹ තමන්ගේ කර්‍මයෙන් අවුත් තමන්ගේ කර්‍මයෙන්ම යන්නෙහි. මෙතෙමේත් තමාගේ කර්‍මයෙන්ම අවුත් තමාගේ කර්‍මයෙන්ම යන්නේය. නුඹ කුමක් මමත්වයෙන් ගන්නෙහිදැයි මෙසේ කරනලද කර්‍මයන් මෙනෙහිකිරීමෙන්ද පරමාර්‍ත්‍ථ වශයෙන් සත්වයෙක් නැත. ඒ ඔබ කුමක් මමායනයෙන් ගන්නෙහිදැයි මෙසේ නිස්සත්ව වශයෙන් මෙනෙහි කිරීමෙන්ද යනුවෙනි. ආකාර දෙකින් සංස්කාර මධ්‍යස්ථතාව නංවාලයි. මේ සිවුර පිළිවෙළින් පැහැය වෙනස්වීමටද දිරනබවටකද එළඹ පාපිසින රෙදිකඩක්වී සැරමිටි කෙළවරින් ඉවත්කළ යුත්තක්බවට පත්වන්නේය. ඉදින් මෙයට අයිතිකරු වන්නේ නම් එයට මෙසේ විනාශවීමට ඉඩ නොදෙන්නේය. මෙසේ අස්වාමිකබව මෙනෙහි කිරීමෙන්ද මෙය කල්නොපවතින්නකි, තාවකාලිකවූවැකැයි මෙසේ තාවකාලික බව මෙනෙහි කිරීමෙන්ද යනුයි. සිවුරෙහි යම්සේද පාත්‍රාදියෙහිද එසේ යෝජනා කළ යුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "සත්වසංස්කාර මමත්වයෙන් ගන්නා පුද්ගලයන් දුරලීම යනු යම් පුද්ගලයෙක් ගිහිවූයේ තමන්ගේ පුතුන් හා දූවරුන් ආදීන්ද පැවිදිවූයේ තමන්ගේ අතවැසි සමාන උපාද්‍යායකාදීන්ද මමත්වයෙන් ගනියි. සියතින්ම ඔවුන්ගේ කෙස් කැපීම් පිරිසිදු කිරීම් සිවුරු සේදීම් පඬුපෙවීම් පාත්‍රපිසීම් ආදිය කරයි. මොහොතකට හෝ නොදකින්නේ අසූවල් හෙරණ කොහිද අසුවල් දරුවා කොහිදැයි නැතිගත් මුවකු මෙන් ඔබිමොබ බලයි. අනෙකෙකු විසින් කෙස් කැපීම් ආදීයක් සඳහා මොහොතකට අසුවලා එවන්නැයි අයදිනු ලබන්නේද අපිද ඔහුලවා තමාගේම වැඩක්වත් නොකරවමු. නුඹලා ඔහුගෙන වෙහෙසවන්නාහුයයි නොදෙයි. මේ සත්වයන් මමත්වයෙන් ගැනීමයි. යමෙක් වනාහි සිවුරු පාත්‍ර තලි සැරයටි ආදිය මමත්වයෙන් ගිනියිද අනෙකකුගේ අතින් පැහැසීමටද නොදෙයි. කෙටිකලකට ඉල්වන ලද්දේ අපිද මෙය ධනයක්කොට සැලකීමෙන් පරිභෝග නොකරමු. නුඹට කෙසේ දෙන්නෙමුදැයි කියයිද මෙය සංස්කාර මමත්වයයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 625,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යො පන තෙසු ද්වීසුපි වත්ථූසු මජ්ඣත්තො උදාසිනො, අයං **සත්තසඞ්ඛාරමජ්ඣත්තො** නාම. ඉති අයං උපෙක්ඛාසම්බොජ්ඣඞ්ගො එවරූපං සත්තසඞ්ඛාරකෙලායනපුග්ගලං ආරකා පරිවජ්ජෙන්තස්සාපි, සත්තසඞ්ඛාරමජ්ඣත්තපුග්ගලං සෙවන්තස්සාපි, ඨානනිසජ්ජාදීසු තදුප්පාදනත්ථං නින්නපොණපබ්භාරචිත්තස්සාපි උප්පජ්ජති. තස්මා ආදිකම්මිකො කුලපුත්තො ඉමෙහි පඤ්චහි කාරණෙහි උපෙක්ඛාසම්බොජ්ඣඞ්ගං සමුට්ඨාපෙත්වා තදෙව ධුරං කත්වා අභිනිවෙසං පට්ඨපෙත්වා අනුක්කමෙන අරහත්තං ගණ්හාති. සො යාව අරහත්තමග්ගා උපෙක්ඛාසම්බොජ්ඣඞ්ගං භාවෙති නාම, ඵලෙ පත්තෙ භාවිතො නාම හොති. ඉති ඉමෙපි සත්ත බොජ්ඣඞ්ගා ලොකියලොකුත්තරමිස්සකාව කථිතා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සම්මාදිට්ඨිං භාවෙතී**ති අට්ඨඞ්ගිකස්ස මග්ගස්ස ආදිභූතං සම්මාදිට්ඨිං බ්රූහෙති වඩ්ඪෙති. සෙසපදෙසුපි එසෙව නයො. එත්ථ පන සම්මාදස්සනලක්ඛණා **සම්මාදිට්ඨි**. සම්මාඅභිනිරොපනලක්ඛණො **සම්මාසඞ්කප්පො**. සම්මාපරිග්ගාහලක්ඛණා **සම්මාවාචා**. සම්මාසමුට්ඨාපනලක්ඛණො **සම්මාකම්මන්තො**. සම්මාවොදාපනලක්ඛණො **සම්මාආජීවො**. සම්මාපග්ගහලක්ඛණො **සම්මාවායාමො**. සම්මාඋපට්ඨානලක්ඛණා **සම්මාසති**. සම්මාසමාධානලක්ඛණො **සම්මාසමාධි**."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙසු එකෙකස්ස තීණි තීණි කිච්චානි හොන්ති. සෙය්යථිදං, සම්මාදිට්ඨි තාව අඤ්ඤෙහිපි අත්තනො පච්චනීකකිලෙසෙහි සද්ධිං මිච්ඡාදිට්ඨිං පජහති, නිරොධං ආරම්මණං කරොති, සම්පයුත්තධම්මෙ ච පස්සති තප්පටිච්ඡාදකමොහවිධමනවසෙන අසම්මොහතො. සම්මාසඞ්කප්පාදයොපි තථෙව මිච්ඡාසඞ්කප්පාදීනි ච පජහන්ති, නිරොධඤ්ච ආරම්මණං කරොන්ති. විසෙසතො පනෙත්ථ සම්මාසඞ්කප්පො සහජාතධම්මෙ සම්මා අභිනිරොපෙති, සම්මාවාචා සම්මා පරිග්ගණ්හාති, සම්මාකම්මන්තො සම්මා සමුට්ඨාපෙති, සම්මාආජීවො සම්මා වොදාපෙති, සම්මාවායාමො සම්මා පග්ගණ්හාති, සම්මාසති සම්මා උපට්ඨාති, සම්මාසමාධි සම්මා පදහති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අපි චෙසා සම්මාදිට්ඨි නාම පුබ්බභාගෙ නානාක්ඛණා නානාරම්මණා හොති, මග්ගකාලෙ එකක්ඛණා එකාරම්මණා. කිච්චතො පන දුක්ඛෙ ඤාණන්තිආදීනි චත්තාරි නාමානි ලභති. සම්මාසඞ්කප්පාදයොපි පුබ්බභාගෙ නානක්ඛණා නානාරම්මණා හොන්ති, මග්ගකාලෙ එකක්ඛණා එකාරම්මණා. තෙසු සම්මාසඞ්කප්පො කිච්චතො නෙක්ඛම්මසඞ්කප්පො අවිහිංසාසඞ්කප්පො අබ්යාපාදසඞ්කප්පොති තීණි නාමානි ලභති. සම්මාවාචාදයො තයො පුබ්බභාගෙ විරතියොපි හොන්ති චෙතනායොපි, මග්ගක්ඛණෙ පන විරතියොව. සම්මාවායාමො සම්මාසතීති ඉදම්පි ද්වයං කිච්චතො සම්මප්පධානසතිපට්ඨානවසෙන චත්තාරි නාමානි ලභති. සම්මාසමාධි පන පුබ්බභාගෙපි මග්ගක්ඛණෙපි සම්මාසමාධියෙව."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යමෙක් වනාහි මේවස්තු දෙකෙහිම මැදහත්වූයේ උදාසීනවුයේ වේද මෙතෙම සත්‍ව සංස්කාර මධ්‍යස්ථවූයේ නමි. මෙසේ මේ උපෙක්‍ෂා සම්බෝධංගය මෙසේ සත්වසංස්කාර මමත්වයෙන් ගන්නා පුද්ගලයන් දුරින්ම දුරලන්නාටද සත්‍වසංස්කාර මධ්‍යස්ථාව ඇති පුද්ගලයන් ඇසුරු කරන්නාටද සිටීම් හිඳීම් ආදියෙහි එය ඉපදවීම සඳහා නතුවූ යොමුවූ නැඹුරුවූ සිතැත්තාටද උපදියි. එබැවින් ආදිකර්මික කුලපුත්‍ර තෙමේ මේ පස් කරුණින් උපෙක්‍ෂා සම්බෝධ්‍යංගය නගා සිටුටා එයම වගකීමකොට අභිනිවේශය පිහිටුවා අනුක්‍රමයෙන් රහත්බව ගනියි. හෙතෙම රහත් මග දක්වා උපෙක්‍ෂා සම්බොධංගය වඩයි නමි. ඵලය පැමිණිකල වඩනලද්දේ නමි. මෙසේ මේ සප්ත බෞධ්‍යංගයෝ ලෞකික ලෝකොත්තර වශයෙන් මිශ්‍රකවම කියනලද්දාහ."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සම්මාදිට්ඨිං භාවෙති** යනු අෂ්ඨාංගික මාර්‍ගයෙහි මුලටම ඇති සම්‍යක්දෘෂ්ටිය වඩයි. වර්‍ධනයකරයි. සෙසු පදයන්හිද මේ ක්‍රමයමැයි. මෙහි වනාහි මනාදැකීම ලක්‍ෂණ කොට ඇත්තේ සම්මාදිට්ඨියයි. මනාව සිත අරමුණට යොමුකිරීම ලක්‍ෂණකොට ඇත්තේ සම්මා සංකප්පයි. මනාව හාත්පසින් ගැනීම ලක්‍ෂණකොට ඇත්තේ සම්මාවාචායි. මනාව නංවාතැබීම (සමුට්ඨාපන) ලක්‍ෂණකොට ඇත්තේ සම්මාකම්මන්තයි. මනාව පිරිසිදු කිරීම (වොදාපන) ලක්‍ෂණ කොට ඇත්තේ සම්මා ආජීවයි. මනා උත්සාහය (පග්ගහ) ලක්‍ෂණ කොට ඇත්තේ සම්මාවායාමයි. මනා වැටහීම (උපට්ඨාන) ලක්‍ෂණ කොට ඇත්තේ සම්මා සතියි. මනාව එකඟකිරීම (සමාධාන) ලක‍්‍ෂණකොට ඇත්තේ සම්මා සමාධියි."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඒවා අතුරින් එකිනෙකට කෘත්‍ය තුනතුන වෙයි. කෙලෙසද යත්? සම්‍යක් දෘෂ්ටිය වනාහි අන්‍යවූද තමන්ට විරුද්ධවූ කෙලෙසුන් සමඟ මිථ්‍යාදෘෂ්ටිය දුරලයි. නිරෝධය අරමුණු කරයි. එය වළක්වන මෝහය විනාශ කිරීම් වශයෙන් නොමුළා වීමෙන් එක්ව යෙදෙන ධර්‍මයන්ද දකියි. සම්මාසංකප්ප ආදිහුද එසේම මිත්‍ථ්‍යාසංකල්පාදීන් දුරුකරත්, නිරෝධයද අරමුණුකරත්, මෙහි විශේෂ වශයෙන් සම්‍යක් සංකල්පය එකට හටගන්නා ධර්‍මයන් අරමුණට යොමුකරයි. සම්මාවාචාව හාත්පසින් ගනියි. සම්මාකම්මන්තය මනාව නංවා තබයි. සම්මා ආජීවය මනාව පිරිසිදුකරයි. සම්මා වායාමය මනාව උත්සාහකරයි. සම්මා සතිය මනාව වටහා දෙයි. සම්මා සමාධිය මනාව එකඟ කරවයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "තවද මේ සම්මාදිට්ඨිය නම්පූර්‍වභාගයෙහි නොයෙක් ක්‍ෂණ ඇත්තේද නොයෙක් අරමුණු ඇත්තේද වෙයි. මාර්‍ගකාලයෙහි ඒකක්‍ෂණිකද ඒකාරම්මණිකද වෙයි. කාත්‍ය වශයෙන් දුක්‍ඛෙ ඤාණ ආදී වශයෙන් නම් සතරක් ලබයි. සම්‍යක් සංකල්පාදීහුද පූර්‍වභාගයෙහි නානක්‍ෂණිකද නානාරම්මණිකද වෙති. මාර්‍ග කාලයෙහි එකක්‍ෂණිකද එකාරම්මණිකද වෙති. ඔවුනතුරින් සම්‍යක් සංකල්පය කෘත්‍ය වශයෙන් නෙක්‍ඛම්ම සංකප්පය ආදීවූ නම් තුනක් ලබයි. සම්මාවාචාදී තුන විරතීහුද වෙති. චෙතනාවෝද වෙති. මාර්‍ගක්‍ෂණයෙහි විරතීහුමයි. සම්මාවායාම, සම්මා සති යන මේ දෙකද කාත්‍ය වශයෙන් (සතර) සම්‍යක් ප්‍රධාන (සතර) සතිපට්ඨාන වශයෙන් නම් සතරක් ලබයි. සම්මා සමාධිය වනාහි පූර්‍වභාගයෙහිද මාර්‍ගක්‍ෂණයෙහිද සම්මා සමාධියමයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 627,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉති ඉමෙසු අට්ඨසු ධම්මෙසු භගවතා නිබ්බානාධිගමාය පටිපන්නස්ස යොගිනො බහුකාරත්තා පඨමං සම්මාදිට්ඨි දෙසිතා. අයඤ්හි “පඤ්ඤාපජ්ජොතො පඤ්ඤාසත්ථ”න්ති (ධ· ස· 16, 20, 29, 34) ච වුත්තා. තස්මා එතාය පුබ්බභාගෙ විපස්සනාඤාණසඞ්ඛාතාය සම්මාදිට්ඨියා අවිජ්ජන්ධකාරං විධමිත්වා කිලෙසචොරෙ ඝාතෙන්තො ඛෙමෙන යොගාවචරො නිබ්බානං පාපුණාති. තෙන වුත්තං – “නිබ්බානාධිගමාය පටිපන්නස්ස යොගිනො බහුකාරත්තා පඨමං සම්මාදිට්ඨි දෙසිතා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සම්මාසඞ්කප්පො පන තස්සා බහුකාරො, තස්මා තදනන්තරං වුත්තො. යථා හි හෙරඤ්ඤිකො හත්ථෙන පරිවත්තෙත්වා පරිවත්තෙත්වා චක්ඛුනා කහාපණං ඔලොකෙන්තො ‘අයං කූටො, අයං ඡෙකො”ති ජානාති, එවං යොගාවචරොපි පුබ්බභාගෙ විතක්කෙන විතක්කෙත්වා විතක්කෙත්වා විපස්සනාපඤ්ඤාය ඔලොකයමානො “ඉමෙ ධම්මා කාමාවචරා, ඉමෙ ධම්මා රූපාවචරාදයො”ති ජානාති. යථා වා පන පුරිසෙන කොටියං ගහෙත්වා පරිවත්තෙත්වා පරිවත්තෙත්වා දින්නං මහාරුක්ඛං තච්ඡකො වාසියා තච්ඡෙත්වා කම්මෙ උපනෙති, එවං විතක්කෙන විතක්කෙත්වා විතක්කෙත්වා දින්නධම්මෙ යොගාවචරො පඤ්ඤාය “ඉමෙ ධම්මා කාමාවචරා, ඉමෙ ධම්මා රූපාවචරා”තිආදිනා නයෙන පරිච්ඡින්දිත්වා කම්මෙ උපනෙති. තෙන වුත්තං – “සම්මාසඞ්කප්පො පන තස්සා බහුකාරො, තස්මා තදනන්තරං වුත්තො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ස්වායං යථා සම්මාදිට්ඨියා, එවං සම්මාවාචායපි උපකාරකො. යථාහ – “පුබ්බෙ ඛො, ගහපති, විතක්කෙත්වා විචාරෙත්වා පච්ඡා වාචං භින්දතී”ති (ම· නි· 1.463). තස්මා තදනන්තරං සම්මාවාචා වුත්තා."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මා පන ඉදඤ්චිදඤ්ච කරිස්සාමාති පඨමං වාචාය සංවිදහිත්වා ලොකෙ කම්මන්තෙ පයොජෙන්ති, තස්මා වාචා කායකම්මස්ස උපකාරිකාති සම්මාවාචාය අනන්තරං සම්මාකම්මන්තො වුත්තො."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුබ්බිධං පන වචීදුච්චරිතං, තිවිධං කායදුච්චරිතං පහාය උභයසුචරිතං පූරෙන්තස්සෙව යස්මා ආජීවට්ඨමකසීලං පූරෙති, න ඉතරස්ස. තස්මා තදුභයානන්තරං සම්මාආජීවො වුත්තො."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං සුද්ධාජීවෙන “පරිසුද්ධො මෙ ආජීවො”ති එත්තාවතා පරිතොසං කත්වා සුත්තප්පමත්තෙන විහරිතුං න යුත්තං, අථ ඛො සබ්බඉරියාපථෙසු ඉදං වීරියමාරභිතබ්බන්ති දස්සෙතුං තදනන්තරං සම්මාවායාමො වුත්තො."
                    },
                    {
                        "type": "paragraph",
                        "text": "තතො ආරද්ධවීරියෙනාපි කායාදීසු චතූසු වත්ථූසු සති සූපට්ඨිතා කාතබ්බාති දස්සනත්ථං තදනන්තරං සම්මාසති දෙසිතා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "මේ මේ ධර්‍ම අට අතුරින් භාග්‍යවතුන්වහ්නසේ විසින් නිර්‍වාණාධිගමය සඳහා පිළිපන් යෝගියාට බොහෝ උපකාරවත් බැවින් පළමුව සම්‍යක් දෘෂ්ටිය දේශනා කරනලදී. ‘ප්‍රඥා ප්‍රදීපයය. ප්‍රඥා ආයුධය යන මෙයද කියනලදී. එබැවින් පූර්‍වභාගයෙහි විදර්‍ශනා ඥාන සංඛ්‍යාතවූ මේ සම්‍යක්දෘෂ්ටියෙන් අවිදු අඳුර නසා කෙලෙස් සොරුන් වනසමින් යෝගාවචරයා සුරැකිව නිවනට පමුණුවයි. එබැවින්, නිවන් අවබෝධයට පිළිපන් යෝගියාට බොහෝ උපකාරවත් බැවින් සමෘක්දෘෂ්ටිය පළමුව දේශනා කරනලැදැ’යි කියන ලදී."
                    },
                    {
                        "type": "paragraph",
                        "text": "සම්මාසංකල්පය එයට (සම්මාදිට්ඨියට) උපකාරවත්ය. එහෙයින් ඊට අනතුරුව කියනලදී. රන් පිරික්සන්නෙක් අතින් පෙරල පෙරලා ඇසින් කහවණුව බලන්නේ මෙය වංචාසහගතය, මෙය මනාව තනා ඇතැයි දැන ගනියිද එසේ යෝගාවචර තෙමේද පූර්‍වභාගයෙහි චිතර්‍කනයෙන් චිතර්‍කනය කරමින් විදසුන් නුවණින් බලමින් මේ ධර්‍ම කාමාචාරය, මේ ධර්‍මයෝ රූපාවචරයෝසි දැන ගනියි. යම්සේ වනාහි පුරුෂයෙකු විසින් කෙළවරින් ගෙන පෙරල පෙරලා දුන් මහගසක් වඩුවෙක් වෑයෙන් සැස කටයුත්තට යොමු කරයිද මෙසේ චිතර්‍කයෙන් චිතර්‍කනය කරමින් දෙනලද ධර්‍මයන් යෝගාවචර තෙමේ මේ කාමාවචරයෝය, මේ රූපාවචරයෝය ආදි ක්‍රමයෙන් පිරිසිඳිමින් ක්‍රියාවෙහි යොදයි. එබැවින් ‘සම්‍යක් සංකල්පය ඒ සම්‍යක් දෘෂ්ටියට උපකාරය, එහෙයින් ඊට අනතුරුව කියන ලදැ’යි සඳහන් කරනලදී."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඒ මේ සම්‍යක් සංකල්පය සම්‍යක් දෂ්ටියට යම්සේද එසේ සම්මා වාචාවටද උපකාරකය. ‘ගෘහපති පුත්‍රය, මුලදීම විතර්‍කනය කොට විචාරණය කොට පසුව වචනයට නඟයි’යි යම්සේ කියන ලද්දේද එබැවින් ඊට අනතුරුව සම්මා වාචාව ප්‍රකාශ කරනලදී."
                    },
                    {
                        "type": "paragraph",
                        "text": "යම් හෙයකින් වනාහි මේ මේ දෙය කරන්නෙමුයයි පළමුව වචනයෙන් සංවිධානය කොට ලොව කර්‍මාන්තයන්හි යොදවත්ද එබැවින් වචනය කායකර්‍මයට උපකාරීයයි සම්මාවාචාවට අනතුරුව සම්‍යක් කර්‍මාන්තය කියනලදී."
                    },
                    {
                        "type": "paragraph",
                        "text": "සිවු ආකාර වාග් දුශ්චරිතයත් තුන් ආකාර කාය දුශ්චරිතයත් අත්හැර උභය සුචරිතයෙහි යෙදෙන්නාට යම්හෙයකින් ආජීවාෂ්ටමක ශීලය පිරෙයිද, අන්‍යයාට නොවේ, එහෙයින් ඒ දෙකට අනතුරුව සම්මා ආජීවය කියනලදී."
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙසේ පිරිසිදු ආජීවය ඇති තැනැත්තා විසින් මගේ ආජීවය පිරිසුදුයයි මෙපමණකින් නිදිගත් පමණින් වාසය කිරීමට නොසුදුසුය. සියලු ඉරියව්වල මේ වීර්යය ඇරඹිය යුතුයයි දැක්වීමට ඊට අනතුරුව සම්මාවායාමය කියනලදී."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉක්බිති ඇරඹූ වීර්යය ඇත්තා විසින්ද කායාදී සතරවස්තූන්හි සිහිය මනාව පිහිටුවිය යුතුයයි දැක්වීම සඳහා ඊට අනතුරුව සම්මාසතිය දෙසනලදී."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 629,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යස්මා පන එවං සූපට්ඨිතා සති සමාධිස්ස උපකාරානුපකාරානං ධම්මානං ගතියො සමන්වෙසිත්වා පහොති එකත්තාරම්මණෙ චිත්තං සමාධෙතුං, තස්මා සම්මාසතියා අනන්තරං සම්මාසමාධි දෙසිතොති වෙදිතබ්බො. ඉති අයම්පි අට්ඨඞ්ගිකො මග්ගො ලොකියලොකුත්තරමිස්සකොව කථිතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අජ්ඣත්තං රූපසඤ්ඤී**තිආදීසු අජ්ඣත්තරූපෙ පරිකම්මවසෙන අජ්ඣත්තං රූපසඤ්ඤී නාම හොති. අජ්ඣත්තඤ්හි නීලපරිකම්මං කරොන්තො කෙසෙ වා පිත්තෙ වා අක්ඛිතාරකාය වා කරොති, පීතපරිකම්මං කරොන්තො මෙදෙ වා ඡවියා වා හත්ථපාදතලෙසු වා අක්ඛීනං පීතකට්ඨානෙ වා කරොති, ලොහිතපරිකම්මං කරොන්තො මංසෙ වා ලොහිතෙ වා ජිව්හාය වා අක්ඛීනං රත්තට්ඨානෙ වා කරොති, ඔදාතපරිකම්මං කරොන්තො අට්ඨිම්හි වා දන්තෙ වා නඛෙ වා අක්ඛීනං සෙතට්ඨානෙ වා කරොති. තං පන සුනීලං සුපීතං සුලොහිතකං සුඔදාතකං න හොති, අවිසුද්ධමෙව හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**එකො බහිද්ධා රූපානි පස්සතී**ති යස්සෙවං පරිකම්මං අජ්ඣත්තං උප්පන්නං හොති, නිමිත්තං පන බහිද්ධා. සො එවං අජ්ඣත්තං පරිකම්මස්ස බහිද්ධා ච අප්පනාය වසෙන “අජ්ඣත්තං රූපසඤ්ඤී එකො බහිද්ධා රූපානි පස්සතී”ති වුච්චති. **පරිත්තානී**ති අවඩ්ඪිතානි. **සුවණ්ණදුබ්බණ්ණානී**ති සුවණ්ණානි වා හොන්ති දුබ්බණ්ණානි වා, පරිත්තවසෙනෙව ඉදං අභිභායතනං වුත්තන්ති වෙදිතබ්බං. **තානි අභිභුය්යා**ති යථා නාම සම්පන්නගහණිකො කටච්ඡුමත්තං භත්තං ලභිත්වා “කිං එත්ථ භුඤ්ජිතබ්බං අත්ථී”ති සඞ්කඩ්ඪිත්වා එකකබලමෙව කරොති, එවමෙව ඤාණුත්තරිකො පුග්ගලො විසදඤාණො “කිං එත්ථ පරිත්තකෙ ආරම්මණෙ සමාපජ්ජිතබ්බං අත්ථි, නායං මම භාරො”ති තානි රූපානි අභිභවිත්වා සමාපජ්ජති, සහ නිමිත්තුප්පාදෙනෙවෙත්ථ අප්පනං පාපෙතීති අත්ථො. **ජානාමි පස්සාමී**ති ඉමිනා පනස්ස ආභොගො කථිතො. සො ච ඛො සමාපත්තිතො වුට්ඨිතස්ස, න අන්තොසමාපත්තියං. **එවංසඤ්ඤී හොතී**ති ආභොගසඤ්ඤායපි ඣානසඤ්ඤායපි එවංසඤ්ඤී හොති. අභිභවසඤ්ඤා හිස්ස අන්තොසමාපත්තියම්පි අත්ථි, ආභොගසඤ්ඤා පන සමාපත්තිතො වුට්ඨිතස්සෙව."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අප්පමාණානී**ති වඩ්ඪිතප්පමාණානි, මහන්තානීති අත්ථො. **අභිභුය්යා**ති එත්ථ පන යථා මහග්ඝසො පුරිසො එකං භත්තවඩ්ඪිතකං ලභිත්වා “අඤ්ඤම්පි හොතු, කිං එතං මය්හං කරිස්සතී”ති තං න මහන්තතො පස්සති, එවමෙව ඤාණුත්තරො පුග්ගලො විසදඤාණො “කිං එත්ථ සමාපජ්ජිතබ්බං, නයිදං අප්පමාණං, න මය්හං චිත්තෙකග්ගතාකරණෙ භාරො අත්ථී”ති තානි අභිභවිත්වා සමාපජ්ජති, සහ නිමිත්තුප්පාදෙනෙවෙත්ථ අප්පනං පාපෙතීති අත්ථො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යම්යෙහයකින් මෙසේ මනාව පිහිටුවන ලද සිහිය සමාධියට උපකාරක හා අපකාරක ධර්‍මයන්ගේ ස්වභාවයන් විමසා ඒකත්‍වාරම්මණයක සිත එකඟ කිරීමට සමත් වෙයි. එහෙයින් සම්මාසතියට අනතුරුව සම්මාසමාධිය දෙසන ලද්දේයයි දතයුතුය. මෙසේ මේ අෂ්ඨාංගික මාර්‍ගයද ලෞකික ලෝකොත්තර මිශ්‍රකවම කියනලදී."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අජක්‍ධත්තං රූපසඤ්ඤී** යනාදියෙහි ආධ්‍යාත්මික රූපයෙහි පරිකර්‍ම (පිළියෙළවීම්) වශයෙන් අජක්‍ධත්තං රූපසඤ්ඤී නම් වෙයි. ආධ්‍යාත්මික නීල පරිකර්‍මය කරන්නෙ කෙස්වල හෝ පිතෙහි හෝ කලුඉංගිරියාවෙහි හෝ කරයි. පීත ( කහ පැහැය) පරිකර්‍මය කරන්නේ මේදයෙහි හෝ සමෙහි හෝ අත්පාතලයන්හි හෝ ඇස්වල කසාවන් තන්හි හෝ කරයි. ලෝහිත (ලේ පැහැය) පරිකර්‍මය කරන්නෙ මසෙහි හෝ ලෙයෙහි හෝ දිවෙහි හෝ ඇස්වල රතු තන්හි හෝ කරයි. ඔදාත (සුදු පැහැය) පරිකර්‍මය කරන්නෙ ඇටෙහි හෝ දත්හි හෝ නියෙහි හෝ ඇස්වල සුදු තන්හි හෝ කරයි. එය වනාහි මනාව නිල්වූයේ මනාව කසාවන්වූයේ මනාව රත්පැහැවූයේ මනාව සුදුවූයේ නොවේ. අපිරිසුදුම වෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**එකොබහිද්ධාරූපානි පස්සති** යනු යමෙකුට මෙසේ ආධ්‍යාත්මික පරිකර්‍මය උපන්නේ වෙයිද නිමිත්තද බාහිරය. හෙතෙම මෙසේ ආධ්‍යාත්මික පරිකර්‍මයාගේද බාහිර අර්පණාවගේද වශයෙන් ‘ආධ්‍යාත්මික රූප සංඥා ඇති කෙනෙක් බාහිර රූප දකීය’යි කියනු ලැබේ. **පරිත්තානි** යනු නොවැඩුණුයි. **සුවණ්ණදුඛ්ඛණ්ණානි** යනු මනා පැහැය ඇත්තේ හෝ වෙයි. දුර්වර්ණ වූයේ වෙයි. පරිත්ත වශයෙන්ම මෙම අභිභායතනය කියනලදැයි දතයුතුයි. තානි අභිභුය්‍ය යනු යම්සේ නම් තදින් කුසගිනි ඇත්තෙක් හැන්දක් පමණ බත්ලැබ කිම මෙහි කෑයුතු දෙයක් තිබේදැයි එකතුකොට එක් බත්පිඩක් කරයිද මෙසේම ඥානයෙන් ශ්‍රෙෂ්ඨවූ පුද්ගලතෙමේ ප්‍රකටවූ ඥානය ඇත්තේ කිම මෙහි කුඩා අරමුණෙහි සමවැදියයුත්තක් ඇත්ද මෙය මට බරක් නොවේයයි ඒ රූප යටපත්කොට සවදියි. නිමිත්ත ඉපදීමත් සමගම මෙහි අර්‍පණාවට පමුණුවයි යන අරුත්ය. **ජානාමි පස්සාමි** යන මෙයින් මෙහි ආභොගය (සිතා බැලීම) කියනලදී. එයද සමවතින් නැගීසිටියහුටය. සමාපත්තිය අතුරෙහි නොවේ. **එවං සඤ්ඤී හොති **යනු ආභොග සංඥාවෙන්කද ධ්‍යානසංඥාවෙන්ද එබඳු සංඥා ඇත්තෙවෙයි. ඔහුට අභිභව සංඥාව සමාපත්තිය අතුරෙහිම ඇත. ආභොග සංඥාව වූකලී සමාපත්තියෙන් නැගී සිටි තැනැත්තාටමවේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අප්පමාණානි** යනු මහත්වූ, වැඩූ ප්‍රමාණය යන අර්‍ත්‍ථයි. **අභිභුය්‍ය** යන මෙහි යම්සේ දැඩි කුසගින්න ඇති පුරුෂයෙක් එක් බත් වැඩුමක් ලැබ අනිකක්ද වේවා! අනිකක්ද වේවා මෙය මට කවර වැඩක් නම් කරයිදැයි එය මහත්සේ නොදකියිද මෙසේම ශ්‍රෙෂ්ඨඥානය ඇති පුද්ගල තෙමේද ප්‍රකටවූ විඥානය ඇත්තේ එහි සමවැදියයුත්ත කුමක්ද? මෙය අප්‍රමාණ නොවේ. මගේ සිත එකඟ කිරීමෙහි බරක් ඇතැයි ඒවා යටපත්කොට සමවදියි. නිමිත්ත ඉපදීමත් සමඟම මෙහි අර්‍පණාවට පැමිණේයයි අර්‍ත්‍ථයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 631,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**අජ්ඣත්තං අරූපසඤ්ඤී**ති අලාභිතාය වා අනත්ථිකතාය වා අජ්ඣත්තරූපෙ පරිකම්මසඤ්ඤාවිරහිතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**බහිද්ධා රූපානි පස්සතී**ති යස්ස පරිකම්මම්පි නිමිත්තම්පි බහිද්ධාව උප්පන්නං, සො එවං බහිද්ධා පරිකම්මස්ස චෙව අප්පනාය ච වසෙන “අජ්ඣත්තං අරූපසඤ්ඤී එකොව බහිද්ධා රූපානි පස්සතී”ති වුච්චති. සෙසමෙත්ථ චතුත්ථඅභිභායතනෙ වුත්තනයමෙව. ඉමෙසු පන චතූසු පරිත්තං විතක්කචරිතවසෙන ආගතං, අප්පමාණං මොහචරිතවසෙන, සුවණ්ණං දොසචරිතවසෙන, දුබ්බණ්ණං රාගචරිතවසෙන. එතෙසඤ්හි එතානි සප්පායානි, සා ච නෙසං සප්පායතා විත්ථාරතො විසුද්ධිමග්ගෙ චරියනිද්දෙසෙ වුත්තා."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඤ්චමඅභිභායතනාදීසු **නීලානී**ති සබ්බසඞ්ගාහකවසෙන වුත්තං. **නීලවණ්ණානී**ති වණ්ණවසෙන. **නීලනිදස්සනානී**ති නිදස්සනවසෙන, අපඤ්ඤායමානවිවරානි අසම්භින්නවණ්ණානි එකනීලානෙව හුත්වා දිස්සන්තීති වුත්තං හොති. **නීලනිභාසානී**ති ඉදං පන ඔභාසවසෙන වුත්තං, නීලොභාසානි නීලප්පභායුත්තානීති අත්ථො. එතෙන නෙසං සුවිසුද්ධතං දස්සෙති. විසුද්ධවණ්ණවසෙනෙව හි ඉමානි චත්තාරි අභිභායතනානි වුත්තානි. “නීලකසිණං ගණ්හන්තො නීලස්මිං නිමිත්තං ගණ්හාති පුප්ඵස්මිං වා වත්ථස්මිං වා වණ්ණධාතුයා වා”තිආදිකං පනෙත්ථ කසිණකරණඤ්ච පරිකම්මඤ්ච අප්පනාවිධානඤ්ච සබ්බං විසුද්ධිමග්ගෙ විත්ථාරතො වුත්තමෙව. ඉමානි පන අට්ඨ අභිභායතනජ්ඣානානි වට්ටානිපි හොන්ති වට්ටපාදකානිපි විපස්සනාපාදකානිපි දිට්ඨධම්මසුඛවිහාරානිපි අභිඤ්ඤාපාදකානිපි නිරොධපාදකානිපි, ලොකියානෙව පන න ලොකුත්තරානීති වෙදිතබ්බානි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**රූපී රූපානි පස්සතී**ති එත්ථ අජ්ඣත්තං කෙසාදීසු නීලකසිණාදීසු නීලකසිණාදිවසෙන උප්පාදිතං රූපජ්ඣානං රූපං, තං අස්ස අත්ථීති රූපී. **බහිද්ධා රූපානි පස්සතී**ති බහිද්ධාපි නීලකසිණාදීනි රූපානි ඣානචක්ඛුනා පස්සති. ඉමිනා අජ්ඣත්තබහිද්ධාවත්ථුකෙසු කසිණෙසු උප්පාදිතජ්ඣානස්ස පුග්ගලස්ස චත්තාරිපි රූපාවචරජ්ඣානානි දස්සිතානි. **අජ්ඣත්තං අරූපසඤ්ඤී**ති අජ්ඣත්තං න රූපසඤ්ඤී, අත්තනො කෙසාදීසු අනුප්පාදිතරූපාවචරජ්ඣානොති අත්ථො. ඉමිනා බහිද්ධාපරිකම්මං කත්වා බහිද්ධාව උප්පාදිතජ්ඣානස්ස පුග්ගලස්ස රූපාවචරජ්ඣානානි දස්සිතානි."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**අජක්‍ධත්තං අරූපසඤ්ඤී** යනු නොලැබෙන බැවින් හෝ නොමැති බැවින් අධ්‍යාත්ම රූපයෙහි පරිකර්‍මසංඥා විරහිතවූ කෙනෙකි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**බහිද්ධා රූපානි පස්සති** යනු යමෙකුගේ පරිකර්‍මයද නිමිත්තද බාහිරවම උපන්නේවේද හෙතෙම මෙසේ බාහිර පරිකර්‍මයාගේ වශයෙන්ම අධ්‍යාත්ම අරූපසංඥා ඇත්තේ බාහිරව රූප දකීයයි කියනුලැබේ. මෙහි සෙස්ස සතරවැනි අභිභායතනයෙහි කියනලද ක්‍රමය ඇත්තේමය. මේ සතරෙහි පරිත්තය විතර්‍කචරිත වශයෙන් එන ලදී. අප්‍රමාණය මොහචරිත වහයෙනි. මනාවර්‍ණය දේවෂ චරිත වශයෙනි දුරුවර්‍ණය රාගචරිත වශයෙනි. මොවුන්ට ඒවා සත්ප්‍රායයෝයි (සුදුසු, ගැලපෙන ඒවායි). මොවුන්ගේ ඒ ගැලපෙනබවද විස්තර වශයෙන් විසුද්ධිමග්ගයෙහි චරියා නිර්දේශයෙහිදී කියනලදී."
                    },
                    {
                        "type": "paragraph",
                        "text": "පස්වැනි අභිභායතනාදියෙහි **නීලානි** යනු සියල්ල ඇතුළත්වන පරිද්දෙන් කියනලදී. **නීලවණ්ණානි** යනු වර්‍ණ වශයෙනි**. නීලනිදස්සනානි** යනු නිදසුන් වශයෙන් නොපෙනෙන සිදුරු ඇති, නොමුසු පැහැය ඇති තනි නිල්මවී දක්නා ලැබේයයි කියන ලද්දේවෙයි. **නීලනිභසානි** යන මෙය බැබලීම් වශයෙන් කියනලදී. නිල්පැහැය ඇති නිල්පැහැයෙන් යුක්තවූ යන අර්‍ත්‍ථයි. මෙයින් ඔවුන්ගේ මනාව පිරිසිදු බව දක්වනුලැබේ. පිරිසුදු වර්‍ණ වශයෙන්ම මේ සතර අභිභායතන කියනලදී. නීල කසිණය උද්ග්‍රහණය කරමින් නිලෙහි නිමිත්ත ගනියි. මලෙහි හෝ වස්ත්‍රයෙහි හෝ වර්‍ණධාතුවෙහි හෝයි ආදිකර්මිකයා විසින් මෙහි කසිණ කිරීමද පරිකර්‍මයද අර්පණා විධානයද යන සියල්ල විසුද්ධිමග්ගයෙහිදී විසිත්ර වශයෙන් කියනලද්දේමය. මේ අභිභායතනධ්‍යාන අට වට්ටයද වෙයි. වට්ටපාදකද විපස්සනා පාදකද දිට්ඨධම්මසුඛවිහාරද අභිඥාපාදකද වෙයි. මේවා ලෞකිකමය: ලෝකෝත්තර නොවේයයි දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "**රූපී රූපානි පස්සති **යන මෙහි අධ්‍යාත්ම කේශාදියෙහි නීලකසිණාදි වශයෙන් උපදවන ලද රූපධ්‍යානයයි. ඒ රූපය ඔහුට ඇත්තේනුයි රූපී නමි. **බහිද්ධාරූපානි පස්සති** යනු බාහිරවූද නීලකසීණාදීවූ රූප ධ්‍යාන ඇසින් බලයි, මෙයින් ආධ්‍යාත්මික බාහිර වස්තූන්ට අයත් කසිණයන්හි උපදවනලද ධ්‍යාන ඇති පුද්ගලයාගේ රූපාවචරධ්‍යාන සතරද දක්වනලදී. **අජක්‍ධතතං අරූපසඤ්ඤී** යනු ආධ්‍යාත්මිකවූ රූප සංඥා නැත්තේයි. තමන්ගේ කෙස් ආදියෙහි නූපදවන ලද රූපාවචරධ්‍යාන ඇත්තේ යන අරුත්ය. මෙයින් බාහිර පරිකර්‍මය කොට බාහිරවම උපදවනලද ධ්‍යාන ඇත්තාගේ රූපාවචරධ්‍යාන දක්වනලදී."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 633,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**සුභන්ත්වෙව අධිමුත්තො හොතී**ති ඉමිනා සුවිසුද්ධෙසු නීලාදීසු වණ්ණකසිණෙසු ඣානානි දස්සිතානි. තත්ථ කිඤ්චාපි අන්තොඅප්පනායං සුභන්ති ආභොගො නත්ථි, යො පන විසුද්ධං සුභං කසිණාරම්මණං කත්වා විහරති, සො යස්මා “සුභන්ති අධිමුත්තො හොතී”ති වත්තබ්බතං ආපජ්ජති, තස්මා එවං දෙසනා කතා. පටිසම්භිදාමග්ගෙ පන “කථං සුභන්ත්වෙව අධිමුත්තො හොතීති විමොක්ඛො – ඉධ භික්ඛු මෙත්තාසහගතෙන චෙතසා එකං දිසං ඵරිත්වා විහරති…පෙ… මෙත්තාය භාවිතත්තා සත්තා අප්පටික්කූලා හොන්ති. කරුණාසහගතෙන…පෙ… මුදිතාසහගතෙන…පෙ… උපෙක්ඛාසහගතෙන චෙතසා එකං දිසං ඵරිත්වා විහරති…පෙ… උපෙක්ඛාය භාවිතත්තා සත්තා අප්පටික්කූලා හොන්ති. එවං සුභන්ත්වෙව අධිමුත්තො හොතීති විමොක්ඛො”ති (පටි· ම· 1.212) වුත්තං. **සබ්බසො රූපසඤ්ඤාන**න්තිආදීසු යං වත්තබ්බං, තං සබ්බං විසුද්ධිමග්ගෙ වුත්තමෙව."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පථවිකසිණං භාවෙතී**ති එත්ථ පන සකලට්ඨෙන කසිණං, පථවි එව කසිණං **පථවිකසිණං**. පරිකම්මපථවියාපි උග්ගහනිමිත්තස්සාපි පටිභාගනිමිත්තස්සාපි තං නිමිත්තං ආරම්මණං කත්වා උප්පන්නජ්ඣානස්සාපි එතං අධිවචනං. ඉධ පන පථවිකසිණාරම්මණං ඣානං අධිප්පෙතං. තං හෙස භාවෙති. **ආපොකසිණා**දීසුපි එසෙව නයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමානි පන කසිණානි භාවෙන්තෙන සීලානි සොධෙත්වා පරිසුද්ධසීලෙ පතිට්ඨිතෙන ය්වාස්ස දසසු පලිබොධෙසු පලිබොධො අත්ථි, තං උපච්ඡින්දිත්වා කම්මට්ඨානදායකං කල්යාණමිත්තං උපසඞ්කමිත්වා අත්තනො චරියානුකූලවසෙන යං යස්ස සප්පායං, තං තෙන ගහෙත්වා කසිණභාවනාය අනනුරූපං විහාරං පහාය අනුරූපෙ විහරන්තෙන ඛුද්දකපලිබොධුපච්ඡෙදං කත්වා සබ්බං භාවනාවිධානං අපරිහාපෙන්තෙන භාවෙතබ්බානි. අයමෙත්ථ සඞ්ඛෙපො, විත්ථාරො පන විසුද්ධිමග්ගෙ (විසුද්ධි· 1.38 ආදයො) වුත්තො. කෙවලඤ්හි තත්ථ විඤ්ඤාණකසිණං නාගතං, තං අත්ථතො ආකාසකසිණෙ පවත්තවිඤ්ඤාණං. තඤ්ච ඛො ආරම්මණවසෙන වුත්තං, න සමාපත්තිවසෙන. තඤ්හි අනන්තං විඤ්ඤාණන්ති ආරම්මණං කත්වා එස විඤ්ඤාණඤ්චායතනසමාපත්තිං භාවෙන්තො විඤ්ඤාණකසිණං භාවෙතීති වුච්චති. ඉමානිපි දස කසිණානි වට්ටානිපි හොන්ති වට්ටපාදකානිපි විපස්සනාපාදකානිපි දිට්ඨධම්මසුඛවිහාරත්ථානිපි අභිඤ්ඤාපාදකානිපි නිරොධපාදකානිපි, ලොකියානෙව පන න ලොකුත්තරානීති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**සුභනේතව අධිමුතේතා හොති** යන මෙයින් සුපිරිසුදුවූ නීලාදී වර්‍ණකසිණයන්හි ධ්‍යානයෝ දක්වනලද්දාහ. එහි අර්‍පණාව තුළ සුභයයි කිසි ආභෝගයක් නැත. යමෙක් වනාහි සුපිරිසුදු සුභ කසිණාරම්මණයක් කොට වසයිද හෙතෙම යම්හෙයකින් සුභයයි සිතාගන්නා ලද්දේවේයයි කිවයුතුබවට පැමිණෙයි. එහෙයින් මෙබඳු දේශනාවක් කරනලදී. පටිසම්හිදා මග්ගයෙහි වනාහි කෙසේ සුභයයි තීරණය කරනලද්දේ විමෝක්‍ෂය වේදයත් මේ සසුනෙහි භික්‍ෂුව මෛත්‍රීසහගත සිතින් එක් දිශාවක් -පෙ- පතුරුවා වාසය කරයිද මෛත්‍රිය වැඩූ බැවින් සත්වයෝ පිළිකුල් නොවූවෝ වෙත්. කරුණා - මුදිතා උපේක්‍ෂා සහගත සිතින් එක් දිශාවක් -පො- පතුරුවා වෙසෙයිද උපේක්‍ෂාව වැඩූ බැවින් සත්වයෝ පිළිකුල් නොවූවෝ වෙත් මෙසේ සුභයයි, තීරණය කරනලද්දේ විමොක්‍ෂය වේයයි කියනලදී. **සබ්බසො රූපසඤ්ඤානං** යන ආදියෙහි යමක් කිවයුතුද ඒ සියල්ල විසුද්ධිමග්ගයෙහිදී කියනලදී."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පඨවිකසිණං භාවෙති** යන මෙහි සියලු අර්‍ත්‍ථයෙන් කසිණයයි, පෘථිවියෙහිම කසිණයවූයේ පටවිකසිණයි. පරිකර්‍ම පෘථිවියෙහිද උද්ග්‍රහනිමිත්තේද පටිභාග නිමිත්තේද ඒ නිමිත්ත අරමුණුකොට උපන්නාවූද ධ්‍යානයට මෙය නමකි. මෙහි වනාහි පෘථිවිකසිණාරම්මණවූ ධ්‍යානය අදහස් කරනලදී. හෙතෙම එය වඩයි. අපෝ කසිණාදියෙහිද මේ ක්‍රමයමැයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "මේ කසීණ වඩන්නාවූ ශීලයන් පිරිසුදුකොට සුපිරිසුදු ශීලයෙහි පිහිටි තැනැත්තා විසින් ඔහුට දශවිධ පළිබෝධයන් අතුරින් යම් පළිබෝධයක් වේද එය සිඳ කමටහන් දෙන්නාවූ කලණමිතුරෙකු වෙත එළඹ තමන්ගේ චරිතයට අනුකූල පරිද්දෙන් යමක් යමෙකුට යෝග්‍ය වේද එය ගෙන කසිණ භාවනාවට නොගැලපෙන විහාරය අතහැර සුදුසු තැනක වෙසෙමින් කුඩා බාධක නසා සියලු භාවනා විධානයන් අත්නොහාරිමින් වැඩියයුතුය. මෙහි මේ කෙටි විවරණයයි. විස්තර විසුද්ධිමග්ගයෙහි කියනලදි. හුදෙක් එහි විඤ්ඤාණ කසිණය නොආවේය. එය අර්‍ත්‍ථවශයෙන් ආකාස කසිණයෙහි පැවති විඤ්ඤාණයයි. එයද අරමුණු වශයෙන් කියනලදී. සමාපත්ති වශයෙන් නොවේ. එය විඥානය අනන්තයි අරමුණුකොට විඤ්ඤාණඤ්චායතන සමාපත්තිය වඩන තැන්ත්තේ විඤ්ඤාණ කසිණය වඩන්නේයයි කියනුලැබේ. මේ දස කසිණයෝද වට්ටද වෙත්. වට්ටපාදකද විදර්‍ශනාපාදකද දිට්ඨධම්මසුඛිවිහාර අර්‍ත්‍ථයෝද අභිඥාපාදකයෝද නිරෝධපාදකයෝද වෙත්. ලෞකික මෙන්ම ලෝකෝත්තරද වෙත්."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 635,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**අසුභසඤ්ඤං භාවෙතී**ති අසුභසඤ්ඤා වුච්චති උද්ධුමාතකාදීසු දසසු ආරම්මණෙසු උප්පන්නා පඨමජ්ඣානසහගතා සඤ්ඤා, තං භාවෙති බ්රූහෙති වඩ්ඪෙති, අනුප්පන්නං උප්පාදෙති, උප්පන්නං අනුරක්ඛතීති අත්ථො. දසන්නං පන අසුභානං භාවනානයො සබ්බො විසුද්ධිමග්ගෙ (විසුද්ධි· 1.102 ආදයො) විත්ථාරිතොයෙව. **මරණසඤ්ඤං භාවෙතී**ති සම්මුතිමරණං, ඛණිකමරණං, සමුච්ඡෙදමරණන්ති තිවිධම්පි මරණං ආරම්මණං කත්වා උප්පජ්ජනකසඤ්ඤං භාවෙති, අනුප්පන්නං උප්පාදෙති, උප්පන්නං අනුරක්ඛතීති අත්ථො. හෙට්ඨා වුත්තලක්ඛණා වා මරණස්සතියෙව ඉධ මරණසඤ්ඤාති වුත්තා, තං භාවෙති උප්පාදෙති වඩ්ඪෙතීති අත්ථො. භාවනානයො පනස්සා විසුද්ධිමග්ගෙ (විසුද්ධි· 1.167 ආදයො) විත්ථාරිතොයෙව. **ආහාරෙ පටිකූලසඤ්ඤං භාවෙතී**ති අසිතපීතාදිභෙදෙ කබළීකාරෙ ආහාරෙ ගමනපටිකූලාදීනි නව පටිකූලානි පච්චවෙක්ඛන්තස්ස උප්පජ්ජනකසඤ්ඤං භාවෙති, උප්පාදෙති වඩ්ඪෙතීති අත්ථො. තස්සාපි භාවනානයො විසුද්ධිමග්ගෙ විත්ථාරිතොයෙව. **සබ්බලොකෙ අනභිරතිසඤ්ඤං භාවෙතී**ති සබ්බස්මිම්පි තෙධාතුකෙ ලොකෙ අනභිරතිසඤ්ඤං උක්කණ්ඨිතසඤ්ඤං භාවෙතීති අත්ථො. **අනිච්චසඤ්ඤං භාවෙතී**ති පඤ්චන්නං උපාදානක්ඛන්ධානං උදයබ්බයඤ්ඤථත්තපරිග්ගාහිකං පඤ්චසු ඛන්ධෙසු අනිච්චන්ති උප්පජ්ජනකසඤ්ඤං භාවෙති. **අනිච්චෙ දුක්ඛසඤ්ඤං භාවෙතී**ති අනිච්චෙ ඛන්ධපඤ්චකෙ පටිපීළනසඞ්ඛාතදුක්ඛලක්ඛණපරිග්ගාහිකං දුක්ඛන්ති උප්පජ්ජනකසඤ්ඤං භාවෙති. **දුක්ඛෙ අනත්තසඤ්ඤං භාවෙතී**ති පටිපීළනට්ඨෙන දුක්ඛෙ ඛන්ධපඤ්චකෙ අවසවත්තනාකාරසඞ්ඛාතඅනත්තලක්ඛණපරිග්ගාහිකං අනත්තාති උප්පජ්ජනකසඤ්ඤං භාවෙති. **පහානසඤ්ඤං භාවෙතී**ති පඤ්චවිධං පහානං ආරම්මණං කත්වා උප්පජ්ජනකසඤ්ඤං භාවෙති. **විරාගසඤ්ඤං භාවෙතී**ති පඤ්චවිධමෙව විරාගං ආරම්මණං කත්වා උප්පජ්ජනකසඤ්ඤං භාවෙති. **නිරොධසඤ්ඤං භාවෙතී**ති සඞ්ඛාරනිරොධං ආරම්මණං කත්වා උප්පජ්ජනකසඤ්ඤං භාවෙති. නිබ්බානං ආරම්මණං කත්වා උප්පජ්ජනකසඤ්ඤන්තිපි වදන්ති. එත්ථ ච සබ්බලොකෙ අනභිරතසඤ්ඤා, අනිච්චසඤ්ඤා, අනිච්චෙ දුක්ඛසඤ්ඤාති ඉමාහි තීහි සඤ්ඤාහි බලවවිපස්සනා කථිතා. පුන අනිච්චසඤ්ඤං භාවෙතීතිආදිකාහි දසහි සඤ්ඤාහි විපස්සනාසමාරම්භොව කථිතො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**අසුභසඤ්ඤාං භාවෙති** යනු උද්ධමාතකආදීවූ දස අසුභාරම්මණයන්හි උපන්නාවූ ප්‍රථමධ්‍යානයෙන් යුක්ත සංඥාව අසුභසඤ්ඤායයි කියනුලැබේ. එය වඩයි. දියුණු කරයි. වර්‍ධනය කරයි. නූපන් අසුභ සංඥාව උපදවයි. උපන් අසුභ සංඥාව ආරක්ෂා කරයි. යනාර්‍ත්‍ථයි. දශ අශූභයන්ගේ සියලු භාවනාක්‍රමය විසුද්ධිමග්ගයෙහිදී විස්තර කරනලදී. **මරණසඤ්ඤං භාවෙති** යනු සම්මුති මරණය ක‍්‍ෂණික මරණය, සමුචේඡද මරණය යන ත්‍රිවිධ වූම මරණය අරමුණුකොට උපදින සංඥාව වඩයි. නූපන් සංඥාව උපදවයි. උපන් සංඥාව ආරක්‍ෂා කරයි යන අර්‍ත්‍ථයයි. යට කියනලද ලක්‍ෂණ ඇති මරණසතියම මෙහි මරණසඤ්ඤායයි කියනලදී. එය වඩයි. දියුණු කරයි. වධර්‍නය කරයි යන අර්‍ත්‍ථයයි. මෙහි භාවනාක්‍රමය විසුද්ධිමග්ගයේදී විස්තර කරන ලද්දේමය. **ආහාරෙ පටික්කුලසඤ්ඤං භාවෙති** යනු අසිත (කනලද) පීත (බොනලද ආදී ප්‍රභේද ඇති කබලිංකාර (පිඬු වශයෙන් අනුභව කරන) ආහාරයෙහි ගමනපටිකකූල ආදීවූ පටිකකූල නවය මෙනෙහි කරන්නාට උපදින සංඥාව වඩයි දියුණු කරයි වර්‍ධනය කරයි යන අර්‍ත්‍ථයි. එහිද භාවනාක්‍රමය විසුද්ධි මග්ගයෙහි විස්තර කරන ලද්දේමය. **සබ්බලොකෙ අනභිරතසඤ්ඤං භාවෙති** යනු සියලුම ත්‍රෛධාතුකවූ ලෝකයෙහි නොඇලුණු සංඥාව, උකටලී සංඥාව වඩයි යන අරුත්ය. **අනිච්චසඤ්ඤං** භාවෙති යනු පංච උපාදන ස්කන්‍ධයන්ගේ හටගැනීම විනාශය, වෙනස්වීම ඇතුළත් කොට ඇත්තාවූ පංචස්කන්‍ධයන්හි අනිත්‍යයි උපදින සංඥාව වඩයි. **අනිචේච දුක්‍ඛසඤ්ඤං** භාවති යනු අනිත්‍යවූ ස්කන්‍ධ පංචකයෙහි පෙළීම් සංඛ්‍යාතවූ දුක්‍ඛලක්‍ෂණය ඇතුළත්වන දුකයයි උපදින සංඥාව වඩයි. **දුක්ඛේ අනත්තසඤ්ඤං** භාවෙති යනු පෙළීම් අරුතින් දුක්වූ ස්කන්‍ධපංචකයෙහි තමන්වසඟයෙහි නොපවත්නා ආකාර සංඛ්‍යාතවූ අනාත්ම ලක්‍ෂණය ඇතුළත් කොට ඇති අනාත්මයයි උපදින සංඥාව වඩයි **පභානසඤ්ඤං භාවෙති** යනු පස් අාකර ප්‍රභානය අරමුණු කොට උපදින සංඥාව වඩයි. **විරාගසඤ්ඤං භාවෙති** යනු පස් ආකාරවූම විරාගය අරමුණු කොට උපදින සංඥාව වඩයි. **නිරොධසඤ්ඤං භාවෙති** යනු සංස්කාර නිරෝධය අරමුණු කොටගෙන උපදින සංඥාවවඩයි. නිවන අරමුණුකොට උපදින සංඥාව නමැයිද කියත්. මෙහිද සබ්බලොකෙ අනභිරතසඤ්ඤා, අනිච්චසඤ්ඤා, අනිච්චේදුක්‍ඛසඤ්ඤා යන මේ සංඥා තුනෙන් බලවත් විදර්‍ශනාව කියනලදී. යළි අනිත්‍යසංඥාව වඩයි යනාදීවූ දස සංඥාවන්ගෙන් විදර්‍ශනාසමාරම්භයම කියනලදී."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 637,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**බුද්ධානුස්සති**න්තිආදීනි වුත්තත්ථානෙව."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පඨමජ්ඣානසහගත**න්ති පඨමජ්ඣානෙන සද්ධිං ගතං පවත්තං, පඨමජ්ඣානසම්පයුත්තන්ති අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සද්ධින්ද්රියං භාවෙතී**ති පඨමජ්ඣානසහගතං කත්වා සද්ධින්ද්රියං භාවෙති බ්රූහෙති වඩ්ඪෙති. එස නයො සබ්බත්ථ."
                    },
                    {
                        "type": "centered",
                        "text": "අපරඅච්ඡරාසඞ්ඝාතවග්ගවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කායගතාසතිවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "**චෙතසා ඵුටො**ති එත්ථ දුවිධං ඵරණං ආපොඵරණඤ්ච දිබ්බචක්ඛුඵරණඤ්ච. තත්ථ ආපොකසිණං සමාපජ්ජිත්වා ආපෙන ඵරණං ආපොඵරණං නාම. එවං ඵුටෙපි මහාසමුද්දෙ සබ්බා සමුද්දඞ්ගමා කුන්නදියො අන්තොගධාව හොන්ති. ආලොකං පන වඩ්ඪෙත්වා දිබ්බචක්ඛුනා සකලසමුද්දදස්සනං දිබ්බචක්ඛුඵරණං නාම. එවං ඵුටෙපි මහාසමුද්දෙ සබ්බා මහාසමුද්දඞ්ගමා කුන්නදියො අන්තොගධාව හොන්ති. **අන්තොගධා තස්සා**ති තස්ස භික්ඛුනො භාවනාය අබ්භන්තරගතාව හොන්ති. **විජ්ජාභාගියා**ති එත්ථ සම්පයොගවසෙන විජ්ජං භජන්තීති විජ්ජාභාගියා, විජ්ජාභාගෙ විජ්ජාකොට්ඨාසෙ වත්තන්තීතිපි විජ්ජාභාගියා. තත්ථ විපස්සනාඤාණං මනොමයිද්ධි ඡ අභිඤ්ඤාති අට්ඨ විජ්ජා, පුරිමෙන අත්ථෙන තාහි සම්පයුත්තධම්මාපි විජ්ජාභාගියා. පච්ඡිමෙන අත්ථෙන තාසු යා කාචි එකා විජ්ජා විජ්ජා, සෙසා විජ්ජාභාගියාති එවං විජ්ජාපි විජ්ජාසම්පයුත්තධම්මාපි විජ්ජාභාගියාතෙව වෙදිතබ්බා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**මහතො සංවෙගායා**ති මහන්තස්ස සංවෙගස්ස අත්ථාය. උපරිපදද්වයෙපි එසෙව නයො. එත්ථ ච මහාසංවෙගො නාම විපස්සනා, මහාඅත්ථො නාම චත්තාරො මග්ගා, මහායොගක්ඛෙමො නාම චත්තාරි සාමඤ්ඤඵලානි. අථ වා මහාසංවෙගො නාම සහ විපස්සනාය මග්ගො, මහාඅත්ථො නාම චත්තාරි සාමඤ්ඤඵලානි, මහායොගක්ඛෙමො නාම නිබ්බානං. **සතිසම්පජඤ්ඤායා**ති සතියා ච ඤාණස්ස ච අත්ථාය. **ඤාණදස්සනපටිලාභායා**ති දිබ්බචක්ඛුඤාණාය. **දිට්ඨධම්මසුඛවිහාරායා**ති ඉමස්මිංයෙව පච්චක්ඛෙ අත්තභාවෙ සුඛවිහාරත්ථාය. **විජ්ජාවිමුත්තිඵලසච්ඡිකිරියායා**ති විජ්ජාවිමුත්තීනං ඵලස්ස පච්චවෙක්ඛකරණත්ථාය. එත්ථ ච විජ්ජාති මග්ගපඤ්ඤා, විමුත්තීති තංසම්පයුත්තා සෙසධම්මා. තෙසං ඵලං නාම අරහත්තඵලං, තස්ස සච්ඡිකිරියායාති අත්ථො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**කායොපි පස්සම්භතී**ති නාමකායොපි කරජකායොපි පස්සම්භති, වූපසන්තදරථො හොති. **විතක්කවිචාරාපී**ති එතෙ ධම්මා දුතියජ්ඣානෙන වූපසම්මන්ති නාම, ඉධ පන ඔළාරිකවූපසමං සන්ධාය වුත්තං. **කෙවලා**ති සකලා, සබ්බෙ නිරවසෙසාති අත්ථො. **විජ්ජාභාගියා**ති විජ්ජාකොට්ඨාසියා, තෙ හෙට්ඨා විභජිත්වා දස්සිතාව."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**බුද්ධානුස්සතිං** යනාදිය කියනලද අරුත් ඇත්තේමය."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පටමජ්ක්‍ධානසහගතං** යනු ප්‍රථමධ්‍යානය සමඟ ගිය, පැවති, ප්‍රථමධ්‍යානයෙන් යුක්තවූ යන අරුත්ය."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සද්ධින්‍ද්‍රියං භවෙති** යනු ප්‍රථමධ්‍යානය සමඟ එක්කොට ශ්‍රද්ධා ඉන්‍ද්‍රිය වඩයි, දියුණු කරයි. වර්‍ධනය කරයි. සියලු තන්හි මෙම ක්‍රමයයි."
                    },
                    {
                        "type": "centered",
                        "text": "",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කායගතාසති වර්ගය",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "**චෙතසාඵුටො** යන මෙහි අපොඵරණ හා දිබ්බචක්‍ඛුඵරණ යන දෙයාකාර පැතිරවීමයි. එහි අපොකසිණයට සමවැදී ජලයෙන් පැතිරවීම ආපොඵරණ නමි. මෙසේ පැතිරවූ මහසමුදුරෙහි සියලුම සමුදුරට යන කුඩා නදීහු ඇතුළත් වූවෝම වෙත්. ආලෝකය වඩා දිවැසින් සියලු සාගරය දැකීම දිබ්බචක්‍ඛුඵරණ නමි. මෙසේ පැතිරවූ කල්හිද මහ සමුදුරෙහි සියලුම සමුදුරට යන කුඩානදීහු ඇතුළත් වූවෝම වෙති. **අන්තොගධා තස්ස** යනු ඒ භික්‍ෂුවගේ භාවනාවට ඇතුළත් වූවෝම වෙත්. **විජ්ජාභාගියා** යන මෙහි එක්ව යෙදීම් වශයෙන් විද්‍යාව ඇසුරු කෙරේනුයි විජ්ජභාගියා නමි. එහි විපස්සනා ඤාණය මනොමයිද්ධි ඤාණය හා ඡඅභිඤ්ඤා යන විද්‍යා අටයි. මුල් අර්‍ත්‍ථයෙන් ඒවායින් (ඒ විද්‍යාවන්ගෙන්) යුක්තවූ ධර්‍මයෝද විච්චාභාගිය නම් වෙත්. පසු අර්‍ත්‍ථයෙන් ඒවා අතුරෙන් යම්කිසි එක් විද්‍යාවක් විද්‍යාවයි. සෙස්ස විජ්ජාභාගියයි මෙසේ විදයාවද විද්‍යාසම්ප්‍රයුක්ත ධර්‍මද විජ්ජාභාගියෝමයි දතයුතුය."
                    },
                    {
                        "type": "paragraph",
                        "text": "**මභතා සංවෙගාය** යනු මහත් සංවේගය සඳහාය. මත්තෙහි පදදෙකෙහිද මේ ක්‍රමයමයි. මෙහිද මහාසංවේගය නම් විදර්‍ශනාවයි. මහා අර්‍ත්‍ථය නම් සතර මාර්‍ගයයි. මහායොගක්‍ඛෙම නම් සාමඤ්ඤඵල සතරයි. නැතහොත් මහාසංවේගය යනු විදර්‍ශනාව සමඟවූ මාර්‍ගයයි. මහා අර්‍ත්‍ථය නම් සාමඤඤ්ඵල සතරයි. මහායොගක්‍ඛෙම නම් නිවනයි. **සතිසම්පජඤ්ඤාය **යනු ස්මෘතියද ඥානයද සඳහායි. ඤාණදස්සනපටිලාභාය යනු දිබ්බචක්‍ඛු ඤාණය සඳහායි. **දිට්ඨධම්මසුඛවිහාරාය** යනු මේ ප්‍රත්‍යක්‍ෂවූ ආත්මභාවයෙහි සුවසේ විසීම සඳහායි. **විජ්ජාවිමුත්තිඵලසච්ජිකිරියාය** යනු විදයාවිමුක්තීන්ගේ ඵලය ප්‍රත්‍යවේක්‍ෂා කිරීම සඳහායි. මෙහිද විජ්ජා යනු මාර්‍ග ප්‍රඥාවයි. විමුත්ති යනු ඒ සමඟ වූ සෙසු ධර්‍මයෝයි. ඔවුන්ගේ ඵලය යනු අරහත්ඵලයයි. එය ප්‍රත්‍යක්‍ෂ කිරීම සඳහා යන අරුත්ය."
                    },
                    {
                        "type": "paragraph",
                        "text": "**කායොපි පස්සම්හති** යනු නාමකායද කරජකාය (මවුපියන් නිසා හටගත් ශරීරය) ද සංසිඳෙයි, සංසිඳුණු දාහය ඇත්තේ වෙයි. චිතක්කවිචාරාපි යනු මේ ධර්‍මයෝ ද්විතීයධ්‍යානයෙන් සංසිදෙත් නමි. මෙහි වනාහි ඕළාරික (රළු) සංසිඳීම සඳහා කියනලදී. කෙවලා යනු සියල්ලෝ, ඉතිරි නැතියන අරුත්ය. විජ්ජාභාගියා යනු විද්‍යාකොටඨාශයන්ට අයත්වූවෝයි. ඔවුහු යට බෙදා දක්වන ලද්දාහුමය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 639,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**අවිජ්ජා පහීයතී**ති අට්ඨසු ඨානෙසු වට්ටමූලකං බහලන්ධකාරං මහාතමං අඤ්ඤාණං පහීයති. **විජ්ජා උප්පජ්ජතී**ති අරහත්තමග්ගවිජ්ජා උප්පජ්ජති. **අස්මිමානො පහීයතී**ති අස්මීති නවවිධො මානො පහීයති. **අනුසයා**ති සත්ත අනුසයා. **සංයොජනානී**ති දස සංයොජනානි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පඤ්ඤාපභෙදායා**ති පඤ්ඤාය පභෙදගමනත්ථං. **අනුපාදාපරිනිබ්බානායා**ති අපච්චයපරිනිබ්බානස්ස සච්ඡිකිරියත්ථාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අනෙකධාතුපටිවෙධො හොතී**ති අට්ඨාරසන්නං ධාතූනං ලක්ඛණපටිවෙධො හොති. **නානාධාතුපටිවෙධො හොතී**ති තාසංයෙව අට්ඨාරසන්නං ධාතූනං නානාභාවෙන ලක්ඛණපටිවෙධො හොති. **අනෙකධාතුපටිසම්භිදා හොතී**ති ඉමිනා ධාතුභෙදඤාණං කථිතං. ධාතුපභෙදඤාණං නාම “ඉමාය ධාතුයා උස්සන්නාය ඉදං නාම හොතී”ති ජානනපඤ්ඤා. තං පනෙතං ධාතුභෙදඤාණං න සබ්බෙසං හොති, බුද්ධානමෙව නිප්පදෙසං හොති. තං සම්මාසම්බුද්ධෙන සබ්බසො න කථිතං. කස්මා? තස්මිං කථිතෙ අත්ථො නත්ථීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පඤ්ඤාපටිලාභායා**තිආදීනි සොළස පදානි පටිසම්භිදාමග්ගෙ “සප්පුරිසසංසෙවො, සද්ධම්මසවනං, යොනිසොමනසිකාරො, ධම්මානුධම්මපටිපත්ති. ඉමෙ ඛො, භික්ඛවෙ, චත්තාරො ධම්මා භාවිතා බහුලීකතා පඤ්ඤාපටිලාභාය සංවත්තන්ති …පෙ… නිබ්බෙධිකපඤ්ඤතාය සංවත්තන්තී”ති එවං මාතිකං ඨපෙත්වා විත්ථාරිතානෙව. වුත්තඤ්හෙතං (පටි· ම· 3.4) –"
                    },
                    {
                        "type": "paragraph",
                        "text": "**පඤ්ඤාපටිලාභාය සංවත්තන්තී**ති. “කතමො පඤ්ඤාපටිලාභො? චතුන්නං මග්ගඤාණානං, චතුන්නං ඵලඤාණානං, චතුන්නං පටිසම්භිදාඤාණානං, ඡන්නං අභිඤ්ඤාඤාණානං, තෙසත්තතීනං ඤාණානං, සත්තසත්තතීනං ඤාණානං ලාභො පටිලාභො පත්තිසම්පත්ති ඵස්සනා සච්ඡිකිරියා උපසම්පදා, පඤ්ඤාපටිලාභාය සංවත්තන්තීති අයං පඤ්ඤාපටිලාභො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පඤ්ඤාවුද්ධියා සංවත්තන්තී**ති. “කතමා පඤ්ඤාවුද්ධි? සත්තන්නඤ්ච සෙක්ඛානං පුථුජ්ජනකල්යාණකස්ස ච පඤ්ඤා වඩ්ඪති, අරහතො පඤ්ඤා වඩ්ඪිතවඩ්ඪනා, පඤ්ඤාවුද්ධියා සංවත්තන්තීති අයං පඤ්ඤාවුද්ධි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පඤ්ඤාවෙපුල්ලාය සංවත්තන්තී**ති. “කතමං පඤ්ඤාවෙපුල්ලං? සත්තන්නඤ්ච සෙක්ඛානං පුථුජ්ජනකල්යාණකස්ස ච පඤ්ඤා වෙපුල්ලං ගච්ඡති, අරහතො පඤ්ඤා වෙපුල්ලං ගතා, පඤ්ඤාවෙපුල්ලාය සංවත්තන්තීති ඉදං පඤ්ඤාවෙපුල්ලං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**මහාපඤ්ඤතාය සංවත්තන්තී**ති. “කතමා මහාපඤ්ඤා? මහන්තෙ අත්ථෙ පරිග්ගණ්හාතීති මහාපඤ්ඤා, මහන්තෙ ධම්මෙ…පෙ… මහන්තා නිරුත්තියො, මහන්තානි පටිභානානි, මහන්තෙ සීලක්ඛන්ධෙ, මහන්තෙ සමාධිපඤ්ඤාවිමුත්තිවිමුත්තිඤාණදස්සනක්ඛන්ධෙ, මහන්තානි ඨානාට්ඨානානි, මහන්තා විහාරසමාපත්තියො, මහන්තානි අරියසච්චානි, මහන්තෙ සතිපට්ඨානෙ, සම්මප්පධානෙ, ඉද්ධිපාදෙ, මහන්තානි ඉන්ද්රියානි, මහන්තානි බලානි, මහන්තෙ බොජ්ඣඞ්ගෙ, මහන්තෙ අරියමග්ගෙ, මහන්තානි සාමඤ්ඤඵලානි, මහාභිඤ්ඤායො, මහන්තං පරමත්ථං නිබ්බානං පරිග්ගණ්හාතීති මහාපඤ්ඤා, මහාපඤ්ඤතාය සංවත්තන්තීති අයං මහාපඤ්ඤා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**අවිඡ්ඡා පහීයති** යනු ස්ථාන අටක සංසාරමුලකවූ දැඩි අඳුරුබව ඇතිකරන්නාවූ මහා කලුවරක්වූ නොදැනීමක් දුරුවේය යනුයි. විජ්ජා උප්පජ්ජති යනු අරහත් මාර්‍ග විද්‍යාව උපදියි. **අස්මිමානො පහීයති** යනු මම වෙමැයි ගන්නා නවවිධවූ මානය දුරුවෙයි. අනුසයා යනු අනුසය සතයි. **සංයොජනා** යනු සංයොජන දහයයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පඤ්ඤාපභෙදාය** යනු ප්‍රඥාවගේ ප්‍රභේදයන්ට පැමිණීම සඳහායි**. අනුපාදා පරිනිබ්බානාය** යනු ප්‍රත්‍යරහිත පරිනිර්‍වාණය පසක්කරනු සඳහායි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අනෙකධාතුපටිවෙධො හොති** යනු අටළොස් ධාතූන්ගේ ලක්‍ෂණාවබෝධය වෙයි. **නානාධාතුපටිවෙධො හොති** යනු ඒ අටළොස් ධාතූන්ගේම විවිධත්වයෙන් ලක්‍ෂණ පටිවෙධය වෙයි**. අනෙකධාතුපටිසම්හිදා හොති** යන මෙයින් ධාතුප්‍රභේද ඥානය කියනලදී. ධාතුප්‍රභේදඥානයනම් මෙම ධාතුවේ උත්සන්න බව නිසා මේ නම වේයයි දැනගන්නා ප්‍රඥාවයි. මේ ධාතුප්‍රභදඥානය සියලු ශ්‍රාවකයන්ටම නොවෙයි. බුදුවරුන්ටම ඉතිරියක්නැතිවම වෙයි. එය සම්බුදුන්වහන්සේ විසින් සර්‍වප්‍රකාරයෙන් නොකියන ලදී. කුමක් හෙයින්ද යත්? එය කීකල්හි අර්‍ත්‍ථයක් නැති බැවිනි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පඤ්ඤාපටිලාභාය** යන ආදී සොළොස් පදයේ පටිසම්හිදා මග්ගයේදී’ ‘සත්පුරුසයන් ඇසුරු කිරීම, සද්ධාර්‍මශවණය, යොනිසොමනසිකාරය, ධම්මානධම්මපටිපත්තිය යන මේ ධර්‍මසතර මහණෙනි, වඩනලද්දේ වැඩිදියුණු කරනලද්දේ ප්‍රඥා ප්‍රතිලාභය සඳහා පවතියි. -පෙ- තියුණු වැටහීම සඳහා පවතී’යයි මෙසේ මාතෘකා තබා විස්තර කරනලද්දේමය. මෙයද කියනලදී:"
                    },
                    {
                        "type": "paragraph",
                        "text": "‘ප්‍රඥා ප්‍රතිලාභය සඳහා පවතී යනු කවර නම් ප්‍රඥා ප්‍රතිලායක්ද යත්? සතර මාර්‍ග ඥානයන්ගේ, සතර ඵලඥානයන්ගේ, සතර පටිසම්හිදා ඥානයන්ගේ, සවැදැරුම් අභිඥාඥානයන්ගේ තෙසැත්තෑ ඥානයන්ගේ සත්සැත්තෑඥානයන්ගේ ලාභය, ප්‍රතිලාභය, පැමිණීම, සමාපත්තිය, ස්පර්‍ශකිරීම, පසක් කිරීම, එළැඹීම, ප්‍රඥාප්‍රතිලාභය සඳහා පවතීයන මේ ප්‍රඥා ප්‍රතිලාභයයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘ප්‍රඥාවගේ වැඩීම සඳහා පවතින් යන්නෙන් කවරනම් ප්‍රඥාවැඩීමක්ද යත්? ශෛක්‍ෂයන් සත්දෙනාගේද කල්‍යාණ පෘථග්ජනයාගේද ප්‍රඥාව වැඩෙයි. රහතන්වහන්සේගේ වැඩුණු ප්‍රඥාවේ වැඩීම වෙයි. ප්‍රඥාවර්‍ධනය සඳහා පවතී යන්නෙහි මේ ප්‍රඥා වැඩීමයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘ප්‍රඥාවේ විපුලත්වය සඳහා පවතිත්’ යැයිකවර ප්‍රඥා විපුලත්වයක්දයත්? ශෛක්‍ෂයන් සත්දෙනාගේද පෘථග්ජන කල්‍යාණයාගේද ප්‍රඥාව විපුලත්වයට යයි. රහතන්වහන්සේගේ ප්‍රඥාව විපුලත්වයට ගියේයි. ප්‍රඥාවේ විපුලත්වය සඳහා පවතිත් යන්නෙහි මේ ප්‍රඥාවිපුලත්වයයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**‘මහාපඤ්ඤතාය සංවත්තන්ති’** මහාප්‍රඥා ඇතිබව සඳහා පවතින් යන්නෙහි කවර මහා ප්‍රඥාවක්ද යත්? මහත් අර්ථයන් පරීක්ෂා කෙරේනුයි මහාපඤ්ඤ නමි. මහත් ධර්‍මයන් -පො- මහත් නිරුක්තීන්, මහත් ප්‍රතිභානයන් මහත් ශීලස්කන්‍ධයන් මහත් සමාධී ප්‍රඥා විමුක්ති විමුක්තිඥානදර්‍ශනස්කන්‍ධයන් මහත් ස්ථානාස්ථානයන් මහාවිහාරසම්පත්තීන් මහත් ආර්‍ය්‍යසත්‍යයන් මහත් සතිපට්ඨානයන් සම්‍යක් ප්‍රධානයන් සාද්ධිපාදයන් මහත් ඉන්‍ද්‍රියයන් මහත් බලයන් මහත් බෝධ්‍යංගයන්, මහත්වූ ආර්‍ය්‍ය අෂ්ටාංගික මාර්‍ගය, මහත් ශ්‍රමණඵලයන් මහා අභිඥාවන් මහත් පරමාර්‍ත්‍ථයවූ නිර්‍වාණය පරීක්‍ෂා කොට දනීනුයි මහාපඤ්ඤ නමි. මහාප්‍රඥා ඇතිබව සඳහා පවතිත්යන්නෙහි මේ මහාප්‍රඥාවයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 641,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**පුථුපඤ්ඤතාය සංවත්තන්තී**ති. “කතමා පුථුපඤ්ඤා? පුථු නානාක්ඛන්ධෙසු ඤාණං පවත්තතීති පුථුපඤ්ඤා. පුථු නානාධාතූසු, පුථු නානාආයතනෙසු, පුථු නානාපටිච්චසමුප්පාදෙසු, පුථු නානාසුඤ්ඤතමනුපලබ්භෙසු, පුථු නානාඅත්ථෙසු, ධම්මෙසු, නිරුත්තීසු, පටිභානෙසු, පුථු නානාසීලක්ඛන්ධෙසු, සමාධිපඤ්ඤාවිමුත්තිවිමුත්තිඤාණදස්සනක්ඛන්ධෙසු, පුථු නානාඨානාට්ඨානෙසු, පුථු නානාවිහාරසමාපත්තීසු, පුථු නානාඅරියසච්චෙසු, පුථු නානාසතිපට්ඨානෙසු, සම්මප්පධානෙසු, ඉද්ධිපාදෙසු, ඉන්ද්රියෙසු, බලෙසු, බොජ්ඣඞ්ගෙසු, පුථු නානාඅරියමග්ගෙසු, පුථු නානාසාමඤ්ඤඵලෙසු, පුථු නානාඅභිඤ්ඤාසු ඤාණං පවත්තතීති පුථුපඤ්ඤා. පුථු නානාජනසාධාරණෙ ධම්මෙ සමතික්කම්ම පරමත්ථෙ නිබ්බානෙ ඤාණං පවත්තතීති පුථුපඤ්ඤා. පුථුපඤ්ඤතාය සංවත්තන්තීති අයං පුථුපඤ්ඤා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**විපුලපඤ්ඤතාය සංවත්තන්තී**ති. “කතමා විපුලපඤ්ඤා? විපුලෙ අත්ථෙ පරිගණ්හාතීති විපුලපඤ්ඤා…පෙ… විපුලං පරමත්ථං නිබ්බානං පරිගණ්හාතීති විපුලපඤ්ඤා, විපුලපඤ්ඤතාය සංවත්තන්තීති අයං විපුලපඤ්ඤා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ගම්භීරපඤ්ඤතාය සංවත්තන්තී**ති. “කතමා ගම්භීරපඤ්ඤා? ගම්භීරෙසු ඛන්ධෙසු ඤාණං පවත්තතීති ගම්භීරපඤ්ඤා. පුථුපඤ්ඤාසදිසො විත්ථාරො. ගම්භීරෙ පරමත්ථෙ නිබ්බානෙ ඤාණං පවත්තතීති ගම්භීරපඤ්ඤා, ගම්භීරපඤ්ඤතාය සංවත්තන්තීති අයං ගම්භීරපඤ්ඤා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අසාමන්තපඤ්ඤතාය සංවත්තන්තී**ති. “කතමා අසාමන්තපඤ්ඤා? යස්ස පුග්ගලස්ස අත්ථවවත්ථානතො අත්ථපටිසම්භිදා අධිගතා හොති සච්ඡිකතා ඵස්සිතා පඤ්ඤාය. ධම්මනිරුත්තිපටිභානවවත්ථානතො පටිභානපටිසම්භිදා අධිගතා හොති සච්ඡිකතා ඵස්සිතා පඤ්ඤාය, තස්ස අත්ථෙ ච ධම්මෙ ච නිරුත්තියා ච පටිභානෙ ච න අඤ්ඤො කොචි සක්කොති අභිසම්භවිතුං, අනභිසම්භවනීයො ච සො අඤ්ඤෙහීති අසාමන්තපඤ්ඤො."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුථුජ්ජනකල්යාණකස්ස පඤ්ඤා අට්ඨමකස්ස පඤ්ඤාය දූරෙ විදූරෙ සුවිදූරෙ න සන්තිකෙ න සාමන්තා, පුථුජ්ජනකල්යාණකං උපාදාය අට්ඨමකො අසාමන්තපඤ්ඤො. අට්ඨමකස්ස පඤ්ඤා සොතාපන්නස්ස පඤ්ඤාය දූරෙ…පෙ… අට්ඨමකං උපාදාය සොතාපන්නො අසාමන්තපඤ්ඤො. සොතාපන්නස්ස පඤ්ඤා සකදාගාමිස්ස පඤ්ඤාය. සකදාගාමිස්ස පඤ්ඤා අනාගාමිස්ස පඤ්ඤාය. අනාගාමිස්ස පඤ්ඤා අරහතො පඤ්ඤාය. අරහතො පඤ්ඤා පච්චෙකබුද්ධස්ස පඤ්ඤාය දූරෙ විදූරෙ සුවිදූරෙ න සන්තිකෙ න සාමන්තා, අරහන්තං උපාදාය පච්චෙකබුද්ධො අසාමන්තපඤ්ඤො. පච්චෙකබුද්ධඤ්ච සදෙවකඤ්ච ලොකං උපාදාය තථාගතො අරහං සම්මාසම්බුද්ධො අග්ගො අසාමන්තපඤ්ඤො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**‘පුථුපඤ්ඤතාය සංවත්තනති’** පැතිරසිටි (වෙන්වෙන්වූ) ප්‍රඥා ඇතිබව සඳහා පවතිත් යන්නෙහි වෙන් වෙන්වූ ප්‍රඥාව කවරේදයත්, වෙන්වෙන්වූ නොයෙක් ස්කන්‍ධයන්හි ඥානය පවතීයයි (පුථුපඤ්ඤා) වෙන්වෙනවූ ප්‍රඥාව නමි. වෙන් වෙන්වූ නොයෙක් ධාතූන්හි, වෙන්වෙන්වූ නොයෙක් ආයතනයන්හි, වෙන්වෙන්වූ නොයෙක් ප්‍රතීත්‍යසමුත්පාදයන්හි වෙන්වෙන්වූ නොයෙක් ශූන්‍යතානුලබ්ධයන්හි වෙන්වෙන්වූ නොයෙක් ප්‍රතිභානයන්හි වෙන්වෙන්වූ නොයෙක් ශීලස්කන්‍ධයන්හි සමාධි විමුත්තීන්හි වෙන්වෙන්වූ නොයෙක් නිමුක්තිඥාන දර්‍ශනස්කන්‍ධයන්හි සමාධි විමුත්තීන්හි වෙන්වෙන්වූ නොයෙක් විමුක්තිඥාන දර්‍ශනස්කන්‍ධයන්හි වෙන්වෙන්වූ නොයෙක් ස්ථානාස්ථානයන්හි වෙන්වෙන්වූ නොයෙක් විහාරසමාපත්තීන්හි වෙන්වෙන්වූ නොයෙක් ආර්‍ය්‍යසත්‍යයන්හි වෙන්වෙන්වූ නොයෙක් සතිපට්ඨානයන්හි සම්‍යක් ප්‍රධානයන්හි සෘද්ධිපාදයන්හි ඉන්‍ද්‍රියයන්හි බලයන්හි බොධ්‍යංගයන්හි නොයෙක් ආර්‍ය්‍යමාර්‍ගයන්හි වෙන්වෙන්වූ නොයෙක් ශ්‍රමණ ඵලයන්හි වෙන්වෙන්වූ නොයෙක් අභිඥාවන්හි ඥානය පවතීනුයි පුථුපඤ්ඤානමි. වෙන් වෙන්වූ නොයෙක් ජනසාධාරණ ධර්‍මයන් ඉක්මවා පරමාර්‍ත්‍ථයවූ නිර්‍වාණයෙහි ඥානය පවතීනුයි පූථූපඤ්ඤානමි. වෙන්වෙන්වූ ප්‍රඥා ඇති බව සඳහා පවතිත් යන්නෙහි මේ පුථුපඤ්ඤානමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**‘විපුල පඤ්ඤාතාය සංවත්තනතී’** පැතුරුණු ප්‍රඥාව ඇතිබව සඳහා පවතිත් යන්නෙහි පැතුරුණු ප්‍රඥාව කවරේදයත්? පැතුරුණු අර්‍ත්‍ථයන්හි පරීක්‍ෂා කෙරේනුයි පැතුරුණු ප්‍රඥානමි. -පෙ- පැතුරුණු පරමාර්ථයවූ නිර්වාණය පරීක්‍ෂා කොට ගනීනුයි පැතුරුණු ප්‍රඥානමි. පැතුරුණු ප්‍රඥාව ඇතිබව සඳහා පවතිත් යන්නෙහි මේපැතුරුණු ප්‍රඥාවයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**‘ගම්භීරපඤ්ඤතාය සංවත්තනති’** ගැඹුරු ප්‍රඥා ඇතිබව සඳහා පවතිත් යන්නෙහි ගැඹුරු ප්‍රඥාව කවරේද යත්? ගැඹුරුවූ ස්කන්‍ධයන්හි ඥානය පවතීනුයි ගැඹුරු ප්‍රඥාව කවරේද යත්? ගැඹුරුවූ ස්කන්‍ධයන්හි ඥානය පවතීනුයි ගැඹුරු ප්‍රඥාව නමි. විස්තරය පුථුපඤ්ඤා යන්නට සමානය. ගැඹුරුවූ පරමාර්‍ත්‍ථමය නිර්‍වාණයෙහි ඥානය පවතීනුයි ගැඹුරු ප්‍රඥාවනමි. ගැඹුරු ප්‍රඥාව ඇතිබව සඳහා පවතිත් යන්නෙහි මේ ගැඹුරු ප්‍රඥාවයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**‘අසමාන්තපඤ්ඤතාය සංවත්තනති’** අසාමන්ත (අසමීප) ප්‍රඥාව කවරේදයත්? යම්කිසි පුද්ගලයකුට අර්‍ත්‍ථ නිගමනය කිරීම් වශයෙන් අර්‍ත්‍ථ පටිසම්භිදාව අවබෝදවූයේ වේද ප්‍රඥාවෙන් පසක්කරනලද්දේ ස්පර්‍ශ කරනලද්දේවේද ප්‍රඥාවෙන් පසක් කරනලද්දේ ස්පර්‍ශ කරනලද්දේ වේද ධර්‍මනිරුක්තිප්‍රතිභාන නිගමනය කිරීම් වශයෙන් පටිභාන පටිසම්භිදාව අවබෝද කරනලද්දේ ප්‍රඥාවෙන් පසක්කරනලද්දේ ස්පර්‍ශ කරනලද්දේ වේද ඔහුට අර්‍ත්‍ථයෙහිද ධර්‍මයෙහිද නිරුක්තියෙහිද ප්‍රතිභානයෙහිද ලඟාවීමට (යටපත් කිරීමට) අන්කිසිවෙක් සමත් නොවෙයි. හෙතෙම අනුන් විසින් ලඟාවිය නොහැක්කේනුයි අසාමන්ත ප්‍රඥා ඇත්තේ නම් වෙයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "කල්‍යාණ පෘථග්ජන පුද්ගලයාගේ ප්‍රඥාව අටවැන්නහුගේ (රහතන්වහන්සේගේ) ප්‍රඥාවෙන් දුරෙහිය. ඈතය. ඉතා දුරෙහි. සමීපයෙහි නොවේ. ලඟ නොවේ. කල්‍යාණ පෘථග්ජනයා ඇසුරුකොට (සලකන විට) අටවැනි පුද්ගලයා අසමාන්ත (අසමීප) ප්‍රඥා ඇත්තෙකි. සෝවාන් තැන්තාගේ ප්‍රඥාව සකෘදාගාමී තැනැත්තාගේ ප්‍රඥාවෙන්, සකෘදාගාමී තැනැත්තාගේ ප්‍රඥාව අනාගාමී තැනැත්තාගේ ප්‍රඥාවෙන්, අනාගාමී තැනැත්තාගේ ප්‍රඥාව රහතන්වහන්සේගේ ප්‍රඥාවෙන් රහතන් වහන්සේගේ ප්‍රඥාව පසේබුදුන් වහන්සේගේ ප්‍රඥාවෙන් දුරෙහිය. ඈතය, ඉතා දුරෙහිය. සමීපයෙහි නොවේ. ලඟ නොවේ. රහතන්වහන්සේ ගෙන සලකන විට පසේබුදුන්වහන්සේ අසාමන්ත ප්‍රඥා ඇත්තෙකි. පසේබුදුන්වහන්සේද සදේවක ලෝකයාද ගෙන සලකනවිට තථාගතවූ අරහත් සම්මාසම්බුදුරජාණන්වහන්සේ අග්‍රයහ. අසාමන්ත ප්‍රඥා ඇතිසේක."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 643,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පඤ්ඤාපභෙදකුසලො පභින්නඤාණො…පෙ… තෙ පඤ්හං අභිසඞ්ඛරිත්වා අභිසඞ්ඛරිත්වා තථාගතං උපසඞ්කමිත්වා පුච්ඡන්ති ගූළ්හානි ච පටිච්ඡන්නානි ච, කථිතා විසජ්ජිතා ච තෙ පඤ්හා භගවතා හොන්ති නිද්දිට්ඨකාරණා, උපක්ඛිත්තකා ච තෙ භගවතා සම්පජ්ජන්ති. අථ ඛො භගවා තත්ථ අතිරොචති යදිදං පඤ්ඤායාති අග්ගො අසාමන්තපඤ්ඤො, අසාමන්තපඤ්ඤතාය සංවත්තන්තීති අයං අසාමන්තපඤ්ඤා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**භූරිපඤ්ඤතාය සංවත්තන්තී**ති. “කතමා භූරිපඤ්ඤා? රාගං අභිභුය්යතීති භූරිපඤ්ඤා, අභිභවිතාති භූරිපඤ්ඤා. දොසං, මොහං, කොධං, උපනාහං, මක්ඛං, පලාසං, ඉස්සං, මච්ඡරියං, මායං, සාඨෙය්යං, ථම්භං, සාරම්භං, මානං, අතිමානං, මදං, පමාදං, සබ්බෙ කිලෙසෙ, සබ්බෙ දුච්චරිතෙ, සබ්බෙ අභිසඞ්ඛාරෙ, සබ්බෙ භවගාමිකම්මෙ අභිභුය්යතීති භූරිපඤ්ඤා, අභිභවිතාති භූරිපඤ්ඤා. රාගො අරි, තං අරිං මද්දනිපඤ්ඤාති භූරිපඤ්ඤා, දොසො, මොහො…පෙ… සබ්බෙ භවගාමිකම්මා අරි, තං අරිං මද්දනිපඤ්ඤාති භූරිපඤ්ඤා. භූරි වුච්චති පථවී, තාය පථවිසමාය විත්ථතාය විපුලාය පඤ්ඤාය සමන්නාගතොති භූරිපඤ්ඤො. අපිච පඤ්ඤාය එතං අධිවචනං භූරි මෙධා පරිණායිකාති, භූරිපඤ්ඤතාය සංවත්තන්තීති අයං භූරිපඤ්ඤා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පඤ්ඤාබාහුල්ලාය සංවත්තන්තී**ති. “කතමං පඤ්ඤාබාහුල්ලං? ඉධෙකච්චො පඤ්ඤාගරුකො හොති පඤ්ඤාචරිතො පඤ්ඤාසයො පඤ්ඤාධිමුත්තො පඤ්ඤාධජො පඤ්ඤාකෙතු පඤ්ඤාධිපතෙය්යො විචයබහුලො පවිචයබහුලො ඔක්ඛායනබහුලො සමොක්ඛායනබහුලො සම්පෙක්ඛායනධම්මො විභූතවිහාරී තච්චරිතො තග්ගරුකො තබ්බහුලො තන්නින්නො තප්පොණො තප්පබ්භාරො තදධිමුත්තො තදාධිපතෙය්යො, යථා ගණගරුකො වුච්චති ගණබාහුලිකොති, චීවරගරුකො පත්තගරුකො සෙනාසනගරුකො වුච්චති සෙනාසනබාහුලිකොති, එවමෙවං ඉධෙකච්චො පඤ්ඤාගරුකො හොති පඤ්ඤාචරිතො…පෙ… තදාධිපතෙය්යො, පඤ්ඤාබාහුල්ලාය සංවත්තන්තීති ඉදං පඤ්ඤාබාහුල්ලං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සීඝපඤ්ඤතාය සංවත්තන්තී**ති. “කතමා සීඝපඤ්ඤා? සීඝං සීඝං සීලානි පරිපූරෙතීති සීඝපඤ්ඤා. සීඝං සීඝං ඉන්ද්රියසංවරං, භොජනෙ මත්තඤ්ඤුතං, ජාගරියානුයොගං, සීලක්ඛන්ධං, සමාධි-පඤ්ඤා-විමුත්ති-විමුත්තිඤාණදස්සනක්ඛන්ධං පරිපූරෙතීති සීඝපඤ්ඤා. සීඝං සීඝං ඨානාට්ඨානානි පටිවිජ්ඣති. විහාරසමාපත්තියො පරිපූරෙති. අරියසච්චානි පටිවිජ්ඣති. සතිපට්ඨානෙ භාවෙති. සම්මප්පධානෙ ඉද්ධිපාදෙ ඉන්ද්රියානි බලානි බොජ්ඣඞ්ගෙ අරියමග්ගං භාවෙතීති සීඝපඤ්ඤා. සීඝං සීඝං සාමඤ්ඤඵලානි සච්ඡිකරොතීති සීඝපඤ්ඤා. සීඝං සීඝං අභිඤ්ඤායො පටිවිජ්ඣතීති සීඝපඤ්ඤා. සීඝං සීඝං පරමත්ථං නිබ්බානං සච්ඡිකරොතීති සීඝපඤ්ඤා, සීඝපඤ්ඤතාය සංවත්තන්තීති අයං සීඝපඤ්ඤා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "‘ප්‍රඥාප්‍රභෙදයන්හි දක්‍ෂවූ විශේෂ විභාගයට පැමිණි ප්‍රඥා ඇති -පෙ- ඔවුහු ප්‍රශ්න පිළියෙළ කරමින් තථාගතයන්වහන්සේ වෙත එළඹ ගූඨවූද සැඟවුණ අරුත් ඇත්තාවූද ප්‍රශ්න අසති. භාග්‍යවතුන්වහන්සේ විසින් ඒ ප්‍රශ්නයෝ කියනලද්දාහුද විසඳන ලද්දාහුදවෙත්. ඉක්බිති භාග්‍යවතුන්වහන්සේම එහිලා අතිශයින් බබලනසේක. යම් මේ ප්‍රඥාවක් වේද එම ප්‍රඥාවෙනි’ යන්නෙන් අග්‍රය. අසාමනතයප්‍රඥා ඇත්තෝය. අසාමනතප්‍රඥාව සඳහා පවතිත් යන්නෙහි මේ අසාමන්ත ප්‍රඥාවයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**‘භූරි පඤ්ඤතාය සංවත්තනති’** යන්නෙහි **භූරිපඤ්ඤාච** කවරේද යත්? රාගය මැඩපවත්වන්නේනුයි භූරිපඤ්ඤ නමි. මැඩපවත්වනලද්දේනුයි **භූරිපඤ්ඤා** නමි. දොස, මොහ, කොධ, උපනාහ, මක්‍ඛ, පලාස, ඉස්සා, මච්ඡරිය මයා, සාඨෙය්‍ය, ථම්භ, සාරම්භ, මාන, අතිමාන, මද, පමාද යන සියලු කෙලෙසුන් සියලු දුසිරිත් සියලු අභිසංස්කාරයන් සියලු භවගාමී කර්‍මයන් මැඩපවත්වන්නේනුයි භූරිපඤ්ඤනමි. මැඩපවත්වනලද්දේනුයි භූරිපඤ්ඤ නමි. රාගය සතුරෙකි. ඒ සතුරා මඩනා ප්‍රඥාව යන්නෙන් භූරිපඤ්ඤායි ද්වේෂය, මොහය -පෙ- සියලුභවගාමීකර්‍ම සතුරෙකි. ඒ සතුරා මඩනා ප්‍රඥාව යන්නෙන් භූරිපඤ්ඤායි. පෘථිවිය භූරියයි කියනුලැබේ. ඒ පෘථිවිය සමානව පළල්වූද මහත්වූද ප්‍රඥාවෙන් යුක්තවූයේයි භූරි ප්‍රඥා ඇත්තෙනමි. තවද ප්‍රඥාවට මෙය නමෙකි. **‘භූරි මෙධා පරිණායිකා’** යනු හෙයින්ද **භූරිපඤ්ඤනමි. ‘භූරිපඤ්ඤතාය සංවත්තන්ති’ **යන්නෙහි මේ භූරිපඤ්ඤායි."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘පඤ්ඤාබාහුල්ලාය සංවත්තනති’ යන්නෙහි ප්‍රඥාබාහුල්‍යය කවරේද යත්? මෙහි කිසිවෙක් ප්‍රඥාගරුකවූයේ වෙයි. ප්‍රඥාචරිත ඇත්තේ, ප්‍රඥා ආසය ඇත්තේ, ප්‍රඥාධිමුක්තවූයේ, ප්‍රඥාධවජවූයේ, ප්‍රඥාකේතුවූයේ, ප්‍රඥාව අධිපති කොඇත්තේ, පරීක්‍ෂාබහුලවූයේ, දැඩිපරීක්‍ෂාව බහුලකොට ඇත්තේ, ගැඹුරට යොමුවීම බහුලකොට ඇත්තේ, මනාව විමසා බැලීම ස්වභාවයකොට ඇත්තේ, ප්‍රකට පැවැතුම් ඇත්තේ, එය චරිතයකොටඇත්තේ, එය ගරුකකොට ඇතේතේ, එය බහුලකොට ඇත්තේ, එයට නතුවූයේ, එයට යොමු වූයේ එදෙසට නැඹුරු වූයේ, එහි ඇලී සිටින්නේ, එය අධිපතිකොටඇත්තේයි. යම්සේ ගණයා (සමුහයා) ගෙන්බරවූ තැනැත්තේ ගනබාහුලිකයි කියනුලැබේද චීවරගරුක පත්තගරුක සෙනාසනගරුක තැනැත්තේ සෙනාසනබාහුලිකයයි කියනුලැබේද මෙසේම මෙහි කිසිවෙක් ප්‍රඥාගරුකවූයේ වෙයි. ප්‍රඥාචරිතවූයේ -පෙ- ප්‍රඥාව අධිපතිකොට ඇත්තේ වෙයි. ‘ප්‍රඥාබාහුල්‍යය සඳහා පවතිත්’ යන්නෙහි මේ ප්‍රඥාබාහුල්‍යයයි"
                    },
                    {
                        "type": "paragraph",
                        "text": "**‘සීඝපඤ්ඤතාය සංවත්තන්ති’** යන්නෙහි සීඝපඤ්ඤා යනු කවරේදයත්? වහවහා සිල් සපුරන්නේනුයි සීඝපඤ්ඤා නමි. වහවහා ඉන්‍ද්‍රි සංවරය, බොජුනෙහි පමණ දන්නාබව, අවදියෙන් සිටීම, ශීලස්කන්‍ධය, සමාධි, ප්‍රඥා විමුක්ති විමුක්තිඥාන දර්‍ශන ස්කන්‍ධයන් වහවහා සපුරන්නේනුයි සීඝපඤ්ඤා නමි. වහවහා තැන නොතැන දනීනුයි, විහාර සමවත් සපුරන්නේයි ආර්‍ය සත්‍යයන් අවබෝධ කරන්නේයි සතිපට්ඨානයන් වඩන්නේයි සම්‍යක්ප්‍රධානයන් සෘද්ධිපාදයන් ඉනද්‍රයයන් බලයන් බොධ්‍යංගයන් ආර්යමාර්‍ගය වඩන්නේනුයි සීඝපඤ්ඤානමි. වහවහා ශ්‍රමණඵලයන් පසක් කෙරේනුයි සීඝපඤ්ඤානමි. වහවහා අභිඥාවන් දැනගනීනුයි සීඝපඤ්ඤානමි. වහවහා පරමාර්ථමය වූ නිර්වාණය ප්‍රත්‍යක්‍ෂ කෙරේනුයි සීඝපඤ්ඤානමි. සීඝපඤ්ඤතාය සංවත්තනතී යන්නෙහි මේ සීඝපඤ්ඤාවයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 645,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**ලහුපඤ්ඤතාය සංවත්තන්තී**ති. “කතමා ලහුපඤ්ඤා? ලහුං ලහුං සීලානි පරිපූරෙතීති ලහුපඤ්ඤා…පෙ… ලහුපඤ්ඤතාය සංවත්තන්තීති අයං ලහුපඤ්ඤා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**හාසපඤ්ඤතාය සංවත්තන්තී**ති. “කතමා හාසපඤ්ඤා? ඉධෙකච්චො වෙදබහුලො තුට්ඨිබහුලො හාසබහුලො පාමොජ්ජබහුලො සීලානි පරිපූරෙතීති හාසපඤ්ඤා…පෙ… පරමත්ථං නිබ්බානං සච්ඡිකරොතීති හාසපඤ්ඤා, හාසපඤ්ඤතාය සංවත්තන්තීති අයං හාසපඤ්ඤා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ජවනපඤ්ඤතාය සංවත්තන්තී**ති. “කතමා ජවනපඤ්ඤා? යං කිඤ්චි රූපං අතීතානාගතපච්චුප්පන්නං, යා කාචි වෙදනා, යා කාචි සඤ්ඤා, යෙ කෙචි සඞ්ඛාරා, යංකිඤ්චි විඤ්ඤාණං අතීතානාගතපච්චුප්පන්නං අජ්ඣත්තං වා බහිද්ධා වා ඔළාරිකං වා සුඛුමං වා හීනං වා පණීතං වා යං දූරෙ සන්තිකෙ වා, සබ්බං විඤ්ඤාණං අනිච්චතො ඛිප්පං ජවතීති ජවනපඤ්ඤා, දුක්ඛතො, අනත්තතො ඛිප්පං ජවතීති ජවනපඤ්ඤා. චක්ඛුං…පෙ… ජරාමරණං අතීතානාගතපච්චුප්පන්නං අනිච්චතො, දුක්ඛතො, අනත්තතො ඛිප්පං ජවතීති ජවනපඤ්ඤා. රූපං අතීතානාගතපච්චුප්පන්නං අනිච්චං ඛයට්ඨෙන, දුක්ඛං භයට්ඨෙන, අනත්තා අසාරකට්ඨෙනාති තුලයිත්වා තීරයිත්වා විභාවයිත්වා විභූතං කත්වා රූපනිරොධෙ නිබ්බානෙ ඛිප්පං ජවතීති ජවනපඤ්ඤා…පෙ… ජරාමරණනිරොධෙ නිබ්බානෙ ඛිප්පං ජවතීති ජවනපඤ්ඤා. රූපං…පෙ… ජරාමරණං අතීතානාගතපච්චුප්පන්නං ඛයධම්මං වයධම්මං විරාගධම්මං නිරොධධම්මන්ති තුලයිත්වා තීරයිත්වා විභාවයිත්වා විභූතං කත්වා ජරාමරණනිරොධෙ නිබ්බානෙ ඛිප්පං ජවතීති ජවනපඤ්ඤා, ජවනපඤ්ඤතාය සංවත්තන්තීති අයං ජවනපඤ්ඤා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**තික්ඛපඤ්ඤතාය සංවත්තන්තී**ති. “කතමා තික්ඛපඤ්ඤා? ඛිප්පං කිලෙසෙ ඡින්දතීති තික්ඛපඤ්ඤා. උප්පන්නං කාමවිතක්කං, ව්යාපාදවිතක්කං, විහිංසාවිතක්කං උප්පන්නුප්පන්නෙ පාපකෙ අකුසලෙ ධම්මෙ නාධිවාසෙති පජහති විනොදෙති බ්යන්තීකරොති අනභාවං ගමෙතීති තික්ඛපඤ්ඤා. උප්පන්නං රාගං, දොසං, මොහං…පෙ… සබ්බෙ භවගාමිකම්මෙ නාධිවාසෙති පජහති විනොදෙති බ්යන්තීකරොති අනභාවං ගමෙතීති තික්ඛපඤ්ඤා. එකස්මිං ආසනෙ චත්තාරො අරියමග්ගා චත්තාරි සාමඤ්ඤඵලානි චතස්සො පටිසම්භිදායො ඡ අභිඤ්ඤායො අධිගතා හොන්ති සච්ඡිකතා ඵස්සිතා පඤ්ඤායාති තික්ඛපඤ්ඤා, තික්ඛපඤ්ඤතාය සංවත්තන්තීති අයං තික්ඛපඤ්ඤා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**‘ලහුපඤ්ඤතාය සංවත්තනති’** යන්නෙහි ලහුපඤ්ඤා යනු කවරේදයත්? ඉක්මණින් ඉක්මණින් ශීලයන් සපුරන්නේනුයි ලහුපඤ්ඤානමි. -පෙ- ඉක්මණින් ඉක්මණින් ශීලයන් සපුරන්නේනුයි ලහපඤ්ඤානමි. -පෙ- ඉක්මණින් ඉක්මණින් පරමාර්ථමයවූ නිර්‍වාණය පසක්කෙරේනුයි ලහුපඤ්ඤානමි. ලහපඤ්ඤතාය සංවත්තන්ති යන මෙහි මේ ලහුපඤ්ඤානම් වේ."
                    },
                    {
                        "type": "paragraph",
                        "text": "**හාසුපඤ්ඤතාය සංවත්තන්ති** යන්නෙහි හාසුපඤ්ඤා යනු කවරේදයත්? මෙහි යම්කිසි සතුටුබහුලවූ විඳීම් බහුලවූ තුටුවීම් බහුලවූ තැනැත්තෙක් සිල් සපුරන්නේනුයි හාසුපඤ්ඤානමි -පෙ- පරමාර්ථමයවූ නිර්‍වාණය පසක්කරන්නේනුයි හාසුපඤ්ඤානමි. **හාසුපඤ්ඤතාය සංවත්තනති** යන්නෙහි මේ හාසුපඤ්ඤානමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ජවනපඤ්ඤතාය සංවත්තන්ති** යන්නෙහි ජවනපඤ්ඤා යනු කවරේදයත්? අතීත අනාගත හා වර්‍තමානයන්ට අයත්වූ යම්කිසි රූපයක් යම්කිසි වේදනාවක්, යම්කිසි සංඥාවක්, යම්කිසි සංස්කාරයක්, යම්කිසි විඥානයක් අතීත අනාගත හා වර්‍තමානයන්ට අයත්වූ ආධ්‍යාත්මිකවූ හෝ බාහිරවූ රළුවූ හෝ මෘදුවූ හීන වූ හෝ ප්‍රණීතවූ දුරෙහිවූ හෝ සමීපයෙහිවූ රළුවූ හෝ මෘදුවූ හීන වූ හෝ ප්‍රණීතවූ දුරෙහිවූ හෝ සමීපයෙහිවූ සියලුම විඤ්ඤාණය අනිත්‍ය වශයෙන් වහා දිවේනුයි ජවනපඤ්ඤානමි. දුක් වශයෙන් අනාත්ම වශයෙන් වහා දිවේනුයි ජවන පඤ්ඤානමි. අතීත අනාගතහා වර්‍තමානයන්ට අයත්වූ ඇස -පෙ- ජරාමරණ අනිත්‍යවශයෙන් දු:ඛවශයෙන් අනාත්ම වශයෙන් වහා දිවේනුයි ජවනපඤ්ඤා නමි. අතීත අනාගත හා වර්‍තමානවූ රූපය වැයවීම් අරුතින් අනිත්‍යය, බියදනවසුලු අරුතින් දුක්‍ඛ්ය, නිසරු අරුතින් අනාත්මයයි සසඳා තීරණයකොට ප්‍රකටකොට පැහැදිලිකොට රූපනිරෝධයවූ නිවනෙහි වහා දිවේනුයි ජවනපඤ්ඤානමි. -පෙ- ජරාමරණයන්ගේ නිරෝධයවූ නිවනෙහි වහා දිවේනුයි ජවනපඤ්ඤානමි. රූපය -පෙ- ජරාමරණය අතීත අනාගත හා වර්‍තමානයන්හි උපන්නෙකි. අනිත්‍යය, සංස්කෘතය, ප්‍රතීත්‍යසමුත්පන්නය: ක්‍ෂයවීම ස්වභාවකොට ඇත. විනාශය ස්වභාවකොට ඇත. අත්හැරීම ස්වභාවකොට ඇත. නිරොධය ස්වභාවකොට ඇතැයි සසඳා තීරණයකොට ප්‍රකටකොට පැහැදිලිකොට ජරාමරණ නිරෝදයවූ නිවනෙහි වහා දිවේනුයි ජවනපඤ්ඤා නමි. ‘ජවනපඤ්ඤතාය සංවත්තන්ති යන්නෙහි මේ ජවනපඤ්ඤානමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**තික්‍ඛපඤ්ඤතාය සංවත්තනති** යන්නෙහි තික්‍ඛපඤ්ඤායනු කවරේදයත්? වහා කෙලෙසුන් සිඳින්නේනුයි තික්‍ඛපඤ්ඤානමි. උපන් කාමවිතර්කය ව්‍යාපාද විතර්කය, විහිංසා විතර්කය, උපනුපන් පවිටු අකුසල් දහම් නොඉවසයි. පහකරයි දුරුකරයි විනාශකරයි. නොපවත්නා බවට පමුණුවයි. යන්නෙන් තික්‍ඛපඤ්ඤායි. උපන් රාගය, ද්වේෂය, මෝහය -පෙ- සියලු භවගාමී කර්‍මයන් නොඉවසයි. පහකරයි. දුරුකරයි. විනාශ කරයි. නොපවත්නා බවට පමුණුවයි යන්නෙන් තික්‍ඛපඤ්ඤායි. එකම අසුනෙක්හි සතර ආර්‍ය්‍යමාර්‍ග, සතර ශ්‍රමණඵල සතර ප්‍රතිසම්භිදා අභිඥාසය, අවබෝධ කරන්ලද්දාහු වෙත්. ප්‍රඥාවෙන් පසක් කරන ලද්දාහුය, ස්පර්‍ශකරන ලද්දාහුයයි තික්‍ඛපඤ්ඤානමි"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 647,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**නිබ්බෙධිකපඤ්ඤතාය සංවත්තන්තී**ති. “කතමා නිබ්බෙධිකපඤ්ඤා? ඉධෙකච්චො සබ්බසඞ්ඛාරෙසු උබ්බෙගබහුලො හොති උත්තාසබහුලො උක්කණ්ඨනබහුලො අරතිබහුලො අනභිරතිබහුලො බහිමුඛො න රමති සබ්බසඞ්ඛාරෙසු, අනිබ්බිද්ධපුබ්බං අප්පදාලිතපුබ්බං ලොභක්ඛන්ධං නිබ්බිජ්ඣති පදාලෙතීති නිබ්බෙධිකපඤ්ඤා, අනිබ්බිද්ධපුබ්බං අප්පදාලිතපුබ්බං දොසක්ඛන්ධං, මොහක්ඛන්ධං, කොධං, උපනාහං…පෙ… සබ්බෙ භවගාමිකම්මෙ නිබ්බිජ්ඣති පදාලෙතීති නිබ්බෙධිකපඤ්ඤා, නිබ්බෙධිකපඤ්ඤතාය සංවත්තන්තීති අයං නිබ්බෙධිකපඤ්ඤා”."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං පටිසම්භිදාමග්ගෙ වුත්තනයෙනෙවෙත්ථ අත්ථො වෙදිතබ්බො. කෙවලඤ්හි තත්ථ බහුවචනං, ඉධ එකවචනන්ති අයමෙව විසෙසො. සෙසං තාදිසමෙවාති. ඉමා ච පන සොළස මහාපඤ්ඤා ලොකියලොකුත්තරමිස්සකාව කථිතා."
                    },
                    {
                        "type": "centered",
                        "text": "කායගතාසතිවග්ගවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අමතවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "**අමතං තෙ, භික්ඛවෙ, න පරිභුඤ්ජන්තී**ති මරණවිරහිතං නිබ්බානං න පරිභුඤ්ජන්තීති අත්ථො. නනු ච නිබ්බානං ලොකුත්තරං, කායගතාසති ලොකියා, කථං තං පරිභුඤ්ජන්තා අමතං පරිභුඤ්ජන්තීති? තං භාවෙත්වා අධිගන්තබ්බතො. කායගතඤ්හි සතිං භාවෙන්තො අමතමධිගච්ඡති, අභාවෙන්තො නාධිගච්ඡති. තස්මා එවං වුත්තං. එතෙනුපායෙන සබ්බත්ථ අත්ථො වෙදිතබ්බො. අපි චෙත්ථ **විරද්ධ**න්ති විරාධිතං නාධිගතං. **ආරද්ධ**න්ති පරිපුණ්ණං. **පමාදිංසූ**ති පමජ්ජන්ති. **පමුට්ඨ**න්ති සම්මුට්ඨං විස්සරිතං නට්ඨං වා. **ආසෙවිත**න්ති ආදිතො සෙවිතං. **භාවිත**න්ති වඩ්ඪිතං. **බහුලීකත**න්ති පුනප්පුනං කතං. **අනභිඤ්ඤාත**න්ති ඤාතඅභිඤ්ඤාය අජානිතං. **අපරිඤ්ඤාත**න්ති ඤාතපරිඤ්ඤාවසෙනෙව අපරිඤ්ඤාතං. **අසච්ඡිකත**න්ති අපච්චක්ඛකතං. සෙසං සබ්බත්ථ උත්තානත්ථමෙවාති."
                    },
                    {
                        "type": "centered",
                        "text": "අමතවග්ගවණ්ණනා.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "මනොරථපූරණියා අඞ්ගුත්තරනිකාය-අට්ඨකථාය සහස්සසුත්තන්තපරිමාණස්ස එකකනිපාතස්ස සංවණ්ණනා නිට්ඨිතා.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**නිබ්බෙධිකපඤ්ඤතාය සංවත්තන්තී** නිබේබධිකපඤ්ඤා යනු කවරේදයත්? මෙහි යම් කිසිවෙක් සියලු සංස්කාරයන්හි උද්වේගය බහුල කොට ඇත්තේ, උත්‍රාස බහුල කොට ඇත්තේ කළකිරීම බහුල කොට ඇත්තේ, නොඇලීම බහුල කොට ඇත්තේ, අනභිරතිය බහුලකොට ඇත්තේ, පරාංමුඛවූයේ සියලු සංස්කාරයන්හි නොඇලෙයි. නොකැඩුණු, නොපැළුණු ලොභස්කන්‍ධය සිඳියි, පළාලයි යන්නෙන් නිබේබධික පඤ්ඤා නමි. නොකැඩුණු, නොපැළුණු දොසක්‍ඛන්‍ධය, මොහක්‍ඛන්‍ධය ක්‍රොධය, උපනාහය -පෙ- සියලු භවගාමී කර්‍මයන් සිඳියි පළාලයි යන්නෙන් නිබේබධිකපඤ්ඤානමි. නිබේබධික පඤ්ඤාව සඳහා පවතිත් යන්නෙහි මේ නිබේබධිකපඤ්ඤාවයි."
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙසේ පටිසමභිදා මග්ගයෙහි කියනලද අයුරින්ම අර්ථය දත යුතුය. හුදෙක් එහි බහුවචනයය. මෙහි එකවචනයය යන මෙයම විශේෂයයි. සෙස්ස එබඳුමය. මේ සොළොස් මහා ප්‍රඥාවද ලෞකික ලෝකෝත්තර මිශ්‍රකවම කියනලදී."
                    },
                    {
                        "type": "centered",
                        "text": "",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අමෘත වර්ගය",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "**අමතං තෙ භික්‍ඛවෙ න පරිභූඤ්ජන්ති** යනු මරණයෙන් තොරවූ නිවන නොවිඳිති යන අර්ථයි. නිවන ලෝකෝත්තරවූයේ කායගතාසතිය ලෞකික වූයේ නොවේද? කෙසේනම් එය නොවිඳින්නාහු අමෘතය නොවිඳිත්දයත්? එය වඩා අවබෝධ කටයුතු බැවිනි. කායගතාසතිය වඩන්නේ අමෘතය අවබෝධ කරයි. නොවඩන්නේ අවබෝධ නොකරයි එබැවින් මෙසේ කියනලදී. මේ අයුරින් සියලු තන්හි අර්ථය දතයුතුය. තවද මෙහි **විරද්ධං** යනු වළකනු ලැබූයි. අවබෝධ නොකළා වූයි. **ආරද්ධං **යනු සපිරුණුයි. **පමාදිංසු** යනු පමාවෙත් යනුයි. **පමුට්ඨං** යනු මුළාවට පත්වූ අමතක කළ හෝ නැසීගිය යනුයි. **ආසෙවිතං** යනු මුලසිට සෙවුනාලදයි. **භාවිතං** යනු වඩනාලදයි **බහුලීකතං** යනු යළියළිත් කරනලදයි. **අනභිඤ්ඤාතං **යනු ප්‍රකට අභිඥාවෙන් නොදන්නාලදයි. **අපරිඤ්ඤාතං** යනු ප්‍රකට පරිඤ්ඤා වශයෙන් වෙන්කොට නොදන්නාලද යනුයි. **අසච්ජිකතං** යනු ප්‍රත්‍යක්‍ෂ නොකරනලදයි. **සච්ඡිකතං** යනු ප්‍රත්‍යක්‍ෂකරනලද යනුයි. සෙස්ස සියලු තන්හි පැහැදිලි අරුත් ඇත්තේමය."
                    },
                    {
                        "type": "centered",
                        "text": "",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "මනොරථපුරණි නම්වූ අංගුත්තරනිකායට්ඨකථාවෙහි සූත්‍රාන්ත දහසකින් පරිමිතවූ එක්කනිපාත වර්‍ණනාව නිමියේයි.",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ],
    "bookId": 14,
    "pageOffset": 0,
    "collection": "atta"
}