{
    "filename": "dn-1-8",
    "bookId": 10,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 356,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "8",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "සීහනාදසුත්තං{1}",
                        "level": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "1. එවං මෙ සුතං: එකං සමයං භගවා උජුඤ්ඤායං{2} විහරති කණ්ණකත්ථලෙ{3} මිගදායෙ. අථ ඛො අචෙලො කස්සපො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං{4} කථං සාරාණීයං{5} වීතිසාරෙත්වා එකමන්තං අට්ඨාසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. එකමන්තං ඨිතො ඛො අචෙලො කස්සපො භගවන්තං එතදවොච: “සුතම්මෙතං{6} භො ගොතම, ‘සමණො ගොතමො සබ්බං තපං ගරහති, සබ්බං තපස්සිං ලූඛාජීවිං එකංසෙන උපක්කොසති උපවදතී’ති. යෙ තෙ භො ගොතම එවමාහංසු ‘සමණො ගොතමො සබ්බං තපං ගරහති, සබ්බං තපස්සිං ලූඛාජීවිං එකංසෙන උපක්කොසති උපවදතී’ති. කච්චි තෙ භොතො ගොතමස්ස වුත්තවාදිනො? න ච භවන්තං ගොතමං අභූතෙන අබ්භාචික්ඛන්ති? ධම්මස්ස චානුධම්මං බ්යාකරොන්ති? න ච කොචි සහධම්මිකො වාදානුවාදො ගාරය්හං ඨානං ආගච්ඡති? අනබ්භක්ඛාතුකාමා හි මයං භවන්තං ගොතම”න්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. යෙ තෙ කස්සප එවමාහංසු: ‘සමණො ගොතමො සබ්බං තපං ගරහති. සබ්බං තපස්සිං ලූඛාජීවිං එකංසෙන උපක්කොසති උපවදතී’ති න මෙ තෙ වුත්තවාදිනො. අබ්භාචික්ඛන්ති ච පන මං තෙ අසතා අභූතෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදාහං කස්සප එකච්චං තපස්සිං ලූඛාජීවිං පස්සාමි දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපන්නං. ඉධ පනාහං කස්සප එකච්චං තපස්සිං ලූඛාජීවිං පස්සාමි දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදාහං{7} කස්සප එකච්චං තපස්සිං අප්පදුක්ඛවිහාරිං පස්සාමි දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපන්නං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කස්සප සීහනාද සුත්තං, කෙසුචි. බුද්ධසීහනාදසුත්තන්තිපි. අට්ටකථා. මහාසීහනාදසුත්තං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. උරුඤායං - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "3. කණ්ණථලෙ - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "4. සම්මොදනියං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. සාරණීයං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "6. සුතමෙතං - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "7. ඉධපනාහං - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "8",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "සිංහනාද සූත්‍රය",
                        "level": 3
                    },
                    {
                        "format": 13,
                        "text": "1. මා විසින් මෙසේ අසන ලදී: එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ උජුඤ්ඤා, නුවර නිසා කණ්ණකත්‍ථල නම් මුවලැව්හි වැඩ වසන සේක. එ කලැ අචෙල කාශ්‍යප තෙම භාග්‍යවතුන් වහන්සේ වෙත එළැඹියේ ය. එළැඹැ ඔඛ හා සතුටු විය. සතුටට කරුණු වූ සිතැ රැඳැවියැ යුතු වූ කථා කොට නිමවා එකත්පසැ සිටියේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "2. එකත්පසැ සිටියා වූ ම අචෙලකාශ්‍යප තෙම භාග්‍යවතුත් වහන්සේට “භවද් ගෞතමයිනි, ‘මහණ ගොයුම්හු සියලු තපස ගරහති’ යි, ‘රළු දිවිපෙවෙත් ඇති හැම තවුසාට එකාන්තයෙන් ආක්‍රොශ කෙරෙති’ යි, ‘පිරිහෙලා බෙණෙති’යි මෙ පවත් මා විසින් අසන ලද. භවද් ගෞතමයිනි, යම් කෙනෙක් ‍ ‘මහණ ගොයුම්හු සියලු තපස ගරහති’යි, ‘රළු දිවිපෙවෙත් ඇති හැම තවුසාට ඒකාන්තයෙන් ආක්‍රොශ කෙරෙති’යි, ‘පිරිහෙලා බෙණෙති’යි මෙසේ කීහු නම්, කිමෙක් ද, ඔහු භවද් ගෞතමයන් කී දෑ ම කියත් ද? භවද්ගෞතමයනට අභූතයෙන් (නොවූ දැයින්) දොස් නො කියත් ද? භවද් ගෞතමයන් කී දෑ අනුව ම කරුණු කියත් ද? ඔබේ කිසි වාදයෙක් (ඔබේ වචනයෙක්) හෝ අනුවාදයෙක් (ඔබ කී බස අනුව අනුන් කී වචනයෙක්) හෝ කරුණු සහිත වැ නුවණැත්තත් විසින් ගැරැහිය යුතු තැනට නො පැමිණේ ද? (කිම, හැම අයුරින් ම ඔබගේ වාදයෙහි ගැරැහියැ යුතු කාරණයෙක් නැද්ද?) අපි භවද් ගෞතමයනට අභූතයෙන් දොස් නඟනු නො කැමැත්තම්හ” යි ‍මෙය කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "3. “කාශ්‍යපය, ‘මහණ ගොයුම්හු සියලු තපසට ගරහති’ යි, ‘රළු දිවිපෙවෙත් ඇති හැම තවුසාට ඒකාන්තයෙන් ආක්‍රොශ කෙරෙති’ යි. ‘පිරිහෙලා බෙණෙති’යි, යම් කෙනෙක් කියත් නම්, ඔහු මා කී දෑ කියන්නෝ නො වෙති. ඔහු මට නැති දැයින් බොරුවෙන් දොස් නගන්නාහු ද වෙති. ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, මෙහි මිනිසුන්ගේ දර්‍ශනොපචාරය ඉක්මැ, දැක්කැ හැකි පිරිසිදු දිවැසින් කාබුන් මරණින් මතු, සැපයෙන් පහ වූ, දුකට පිහිටි, විවශ ව වැටෙන තැන වූ නිරයට පැමිණි, කටුක දිවි පෙවෙත් ඇති වැ සිටි එක්තරා තවුසකු මම දකිමි. කාශ්‍යපය, මෙහි මිනිසුන්ගේ දර්‍ශනොපචාරය ඉක්මැ දක්කැ හැකි, පිරිසිදු දිවැසින්, කාබුන් මරණින් මතු, මනා ගති ඇති සඟ ලොවට පැමිණි, කටුක දිවිපෙවෙත් ඇති වැ සිටි එක්තරා තවුසකු ද මම දකිමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, මෙහි මිනිසුන්ගේ දකුම් ඉම ඉක්මැ, දැක්කැ හැකි පිරිසිදු දිවැසින්, කාබුන් මරණින් මතු, සැප නැති, නපුරු ගති ඇති, විවස ව පතිත වන තැන වූ නිරයට පැමිණි, මද වූ දුක් විහරණ ඇති වැ සිටි එක්තරා තවුසකු මම දකිමි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 358,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉධපනාහං කස්සප එකච්චං තපස්සිං අප්පදුක්ඛවිහාරිං පස්සාමි දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යො’හං කස්සප ඉමෙසං තපස්සීනං එවං ආගතිඤ්ච ගතිඤ්ච චුතිඤ්ච උපපත්තිඤ්ච යථාභූතං පජානාමි. සො’හං කිං සබ්බං තපං ගරහිස්සාමි, සබ්බං වා තපස්සිං ලූඛාජීවිං එකංසෙන උපක්කොසිස්සාමි උපවදිස්සාමි?"
                    },
                    {
                        "type": "paragraph",
                        "text": "4. සන්ති කස්සප එකෙ සමණබ්රාහ්මණා පණ්ඩිතා නිපුණා කතපරප්පවාදා වාළවෙධිරූපා වොභින්දන්තා{1} මඤ්ඤෙ චරන්ති පඤ්ඤාගතෙන දිට්ඨිගතානි. තෙහි’පි මෙ සද්ධිං එකච්චෙසු ඨානෙසු සමෙති{2} එකච්චෙසු ඨානෙසු න සමෙති{2}. යන්තෙ එකච්චං වෙදන්ති සාධූ’ති, මයම්පි තං එකච්චං වදෙම සාධූ’ති. යන්තෙ එකච්චං වෙදන්ති න සාධූ’ති, මයම්පි තං එකච්චං වදෙම න සාධූ’ති. යන්තෙ එකච්චං වෙදන්ති සාධූ’ති, මයං තං එකච්චං වදෙම න සාධූ’ති. යන්තෙ එකච්චං වෙදන්ති න සාධූ’ති, මයං තං එකච්චං වදෙම සාධූ’ති. යං මයං එකච්චං වදෙම සාධූ’ති, පරෙ’පි තං එකච්චං වදන්ති සාධූ’ති. යං මයං එකච්චං වදෙම න සාධූ’ති, පරෙ’පි තං එකච්චං වෙදන්ති න සාධූ’ති. යං මයං එකච්චං වදෙම න සාධූ’ති, පරෙ’පි තං එකච්චං වෙදන්ති සාධූ’ති. යං මයං එකච්චං වදෙම සාධූ’ති, පරෙ’පි තං එකච්චං වදන්ති න සාධූ’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ත්යාහං උපසඞ්කමිත්වා එවං වදාමි: යෙසු නො ආවුසො ඨානෙසු න සමෙති, තිට්ඨන්තු තානි ඨානානි. යෙසු ඨානෙසු සමෙති, තත්ථ විඤ්ඤූ සමනුයුඤ්ජන්තං සමනුගාහන්තං සමනුභාසන්තං සත්ථාරා වා සත්ථාරං සඞ්ඝෙන වා සඞ්ඝං: “යෙ ඉමෙසං භවතං ධම්මා අකුසලා අකුසලසඞ්ඛාතා, සාවජ්ජා සාවජ්ජසඞ්ඛාතා අසෙවිතබ්බා අසෙවිතබ්බසඞ්ඛාතා න අලමරියා න අලමරියසඞ්ඛාතා කණ්හා කණ්හසඞ්ඛාතා, කො ඉමෙ ධම්මෙ අනවසෙසං පහාය වත්තති, සමණො වා ගොතමො පරෙ වා පන භොන්තො ගණාචරියා?”ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. තෙ හින්දත්තා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සමෙන්ති - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, මෙහි මිනිසුන්ගේ දැකුම් ඉම ඉක්මැ දැක්කැ හැකි පිරිසිදු දිවැසින්, කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට පැමිණි, මඳ දුක් විහරණ ඇති වැ සිටි එක්තරා තවුසකු මම දකිමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, යම්බඳු වූ මම් මේ තවුසන්ගේ ආගතියක් (පෙරැ භවයෙහි යම් තැනෙකින් සැව මෙහි උපන්නෝ නම් එ තැනත්), ගතියත් (මෙයින් සැව යෑ යුතු තැනත්), ච්‍යුතියත් (ඒ මතු භවයෙන් ච්‍යුත වීමත්), උප්පත්තියත් (ඒ ච්‍යුතියෙන් පසු ව උපදනා තැනත්) මෙසේ තත් වූ පරිදි දනිම් ද, ඒ මම් කුමට සියලූ තපසට හෝ ගරහම් ද? කටුක දිවිපෙවෙත් ඇති හැම තවුසාට හෝ එකාන්තයෙන් පරිභව කෙරෙම් ද? අවඥා කෙරෙම් ද?",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "4. කාශ්‍යපය, පණ්ඩිත වූ, තියුණු නුවණැති, මෙරමා හා කළ වාද ඇති, වාලවෙධි ධනුර්ධරයන් බඳු වූ ඇතැම් මහණ බමුණු කෙනෙක් තමන් ප්‍රඥායෙන් අනුන්ගේ දෘෂ්ටින් බිඳැ හෙළන්නන් මෙන් වැ හැසිරෙත්. ඔවුන් හා ද ඇතැම් තන්හි මගේ දහම් සම වෙයි. ඇතැම් තන්හි සම නො වෙයි. ඔහු යම් එක්තරා දැයක් ‘මැනැවැ’යි කියත් ද, අපි දු ඒ එක්තරා දැය ‘මැනැවැ’යි කියමු. යම් එක්තරා දැයක් නො මැනැවැයි ඔහු කියත් ද, අපි දු ඒ එක්තරා දැය ‘නොමැනැවැ’යි කියමු. යම් එක්තරා දැයක් ‘මැනැවැ’යි ඔහු කියත් ද, ඒ එක්තරා දැය ‘නො මැනැවැ’යි අපි කියමු. යම් එක්තරා දැයක් ‘නො මැනැවැ’යි ඔහු කියත් ද, ඒ එක්තරා දැය ‘මැනැවැ’යි අපි කියමු. යම් එක්තරා දැයක් ‘මැනැවැ’යි අපි කියමු ද, අන්හු ද ඒ එක්තරා දැය ‘මැනැවැ’යි කියත්. යම් එක්තරා දැයක් ‘නො මැනැවැ’යි අපි කියමු ද, අන්හු ද ඒ එක්තරා දැය ‘නො මැනැවැ’යි කියත්. යම් එක්තරා දැයක් ‘නො මැනැවැ’යි අපි කියමු ද, අන්හු ද ඒ එක්තරා දැය ‘මැනැව’යි කියත්. යම් එක්තරා දෙයක් ‘මැනැවැ’යි අපි කියමු ද, ඒ එක්තරා දැය ‘නො මැනැවැ’යි අන්හු කියත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මම් ඔවුන් කරා එළැඹ මෙසේ කියමි: “ඇවැත්නි, අප දහම් යම් තන්හි සම නො වේ ද, ඒ තන්හු සිටිත් වා. යම් තන්හි සම වේ නම් ඒ තන්හි ලා නුවණැත්තෝ ‘අකුසල් වූත් අකුශලසඞ්ඛ්‍යාත වූත් (අකුසල් යැ සි වෙන් කරන ලද්දා වූත්), සාවද්‍ය (සදොස්) වූත් සාවද්‍යසඞ්ඛ්‍යාත වූත් (සදොස් යැ යි වෙන් කරන ලද්දා වූත්), අසෙවිතව්‍ය (නො සෙවියැ යුතු) වූත්, අසෙවිතව්‍ය සඞ්ඛ්‍යාත වූත් (නො සෙවිය යුතු යැ යි වෙන් කොට තබන ලද්දා වූත්), ආර්‍යභාවයට නොසමත් වූත්, ආර්‍යභාවයට නො සමත් සේ වෙන් කොට තබන ලද්දා වූත්, කෘෂ්ණ වූත්, කෘෂ්ණසඞ්ඛ්‍යාත වූත් (කළු යැ යි වෙන් කොට තබන ලද්දා වූත්) මේ භවතුන්ගේ යම් ධර්‍ම කෙනෙක් වෙත් නම්, කවර කෙනෙක් මෙකී දහම් නිරවශේෂයෙන් බැහැරැ කොට පවත්නෝ ද ? ශ්‍රමණ ගෞතමයෝ ද නැත හොත් අන් භවද් ගණාචාර්‍යයෝ දැ?”යි එක් ශාසතෘවරයකු හා තවත් ශාසතෘවරයකු ද එක් ශ්‍රාවකගණයක් හා තවත් ශ්‍රාවකගණයක් ද සසඳා ලබ්ධිය විචාරත් වා. කරුණු විචාරත් වා. ලබ්ධියත් කරුණුත් දෙක ම විචාරත් වා.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 360,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඨානං ඛො පනෙතං කස්සප විජ්ජති යං විඤ්ඤූ සමනුයුඤ්ජන්තා සමනුගාහන්තා සමනුභාසන්තා එවං වදෙය්යුං: “යෙ ඉමෙසං භවතං ධම්මා අකුසලා අකුසලසඞ්ඛාතා සාවජ්ජා සාවජ්ජසඞ්ඛාතා අසෙවිතබ්බා අසෙවිතබ්බසඞ්ඛාතා න අලමරියා න අලමරියසඞ්ඛාතා කණ්හා කණ්හසඞ්ඛාතා, සමණො ගොතමො ඉමෙ ධම්මෙ අනවසෙසං පහාය වත්තති, යං වා පන භොන්තො පරෙ ගණාචරියා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉතිහ කස්සප විඤ්ඤූ සමනුයුඤ්ජන්තා සමනුගාහන්තා සමනුභාසන්තා අම්හෙව තත්ථ යෙභුෙය්යන පසංසෙය්යුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "5. අපරම්පි නො කස්සප විඤ්ඤූ සමනුයුඤ්ජන්තං සමනුගාහන්තං සමනුභාසන්තං සත්ථාරා වා සත්ථාරං සඞ්ඝෙන වා සඞ්ඝං: “යෙ ඉමෙසං භවතං ධම්මා කුසලා කුසලසඞ්ඛාතා අනවජ්ජා අනවජ්ජසඞ්ඛාතා සෙවිතබ්බා සෙවිතබ්බසඞ්ඛාතා අලමරියා අලමරියසඞ්ඛාතා සුක්කා සුක්කසඞ්ඛාතා, කො ඉමෙ ධම්මෙ අනවසෙසං සමාදාය වත්තති සමණො වා ගොතමො පරෙ වා පන භොන්තො ගණාචරියා?” ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඨානං ඛො පනෙතං කස්සප විජ්ජති යං විඤ්ඤූ සමනුයුඤ්ජන්තා සමනුගාහන්තා සමනුභාසන්තා එවං වදෙය්යුං: “යෙ ඉමෙසං භවතං ධම්මා කුසලා කුසලසඞ්ඛාතා අනවජ්ජා අනවජ්ජසඞ්ඛාතා සෙවිතබ්බා සෙවිතබ්බසඞ්ඛාතා අලමරියා අලමරියසඞ්ඛාතා සුක්කා සුක්කසඞ්ඛාතා. සමණො ගොතමො ඉමෙ ධම්මෙ අනවසෙසං සමාදාය වත්තති යං වා පන භොන්තො පරෙ ගණාචරියා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉතිහ කස්සප විඤ්ඤූ සමනුයුඤ්ජන්තා සමනුගාහන්තා සමනුභාසන්තා අම්හෙව තත්ථ යෙභුෙය්යන පසංසෙය්යුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "6. අපරම්පි නො කස්සප විඤ්ඤූ සමනුයුඤ්ජන්තං සමනුගාහන්තං සමනුභාසන්තං සත්ථාරා වා සත්ථාරං සඞ්ඝෙන වා සඞ්ඝං: “යෙ ඉමෙසං භවතං ධම්මා අකුසලා අකුසලසඞ්ඛාතා සාවජ්ජා සාවජ්ජසඞ්ඛාතා අසෙවිතබ්බා අසෙවිතබ්බසඞ්ඛාතා න අලමරියා න අලමරියසඞ්ඛාතා කණ්හා කණ්හසඞ්ඛාතා කො ඉමෙ ධම්මෙ අනවසෙසං පහාය වත්තති ගොතමසාවකසඞ්ඝො වා පරෙ වා පන භොන්තො ගණාචරියසාවකසඞ්ඝා?”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, නුවණැත්තෝ ලබ්ධි විචාරන්නාහු, කරුණු විචාරන්නාහු, ලබ්ධිත් කරුණුත් දෙක ම විචාරන්නාහු, “මේ භවතුන්ගේ අකුශල වූත් අකුශලසඞ්ඛ්‍යාත වූත්, සාවද්‍ය වූත්, සාවද්‍යසඞ්ඛ්‍යාත වූත්, අසෙවිතව්‍ය වූත්, අසෙවිතව්‍යසඞ්ඛ්‍යාත වූත්, ආර්‍යභාවයට නොසමත් වූත්, ආර්‍යභාවයට නොසමත් යැ යි වෙන් කොට තබන ලද්දා වූත්, කෘෂ්ණ වූත්, කෘෂ්ණසඞ්ඛ්‍යාත වූත් යම් දහම් කෙනෙක් වෙත් නම්, ශ්‍රමණගෞතමයෝ මේ හැම දහම් නිරවශෙෂයෙන් බැහැරැ කොට පවතිත්. අන් භවද් ගණාචාර්‍යයෝ වනාහි යම් තමක් (අල්පමාත්‍රයක්)ම බැහැරැ කොට පවතිත්” යැ යි මෙසේ කියන්නාහුය යන මේ කාරණය ඇත්තේ ම ය. ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, මෙසේ නුවණැත්තෝ ලබ්ධි විචාරන්නාහු කරුණු විචාරන්නාහු ලබ්ධිත් කරුණුත් විචාරන්නාහු අප ම එහි ලා බෙහෙවින් පසස්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "5. අනෙ‍කෙක් ද ඇත. කාශ්‍යපය, ‘මේ භවතුන්ගේ කුශල වූත් කුශලසඞ්ඛ්‍යාත වූත්, අනවද්‍ය වූත් අනවද්‍යසඞ්ඛ්‍යාත වූත්, සෙවිතව්‍ය වූත් සෙවිතව්‍යසඞ්ඛ්‍යාත වූත්, අලමාර්‍ය (ආර්‍යභාවයට සමත්) වූත් අලමාර්‍යසඞ්ඛ්‍යාත වූත්, ශුක්ල වූත් ශුක්ලසඞ්ඛ්‍යාත වූත් යම් ධර්‍ම කෙනෙක් වෙත් ද, කවරෙක් නම් මේ දහම් නිරවශේෂයෙන් සමාදන් කොට ගෙන පවත්නෝ ද? මහණ ගොයුම්හු ද? නැත හොත් අන් භවත් ගණාචාර්‍යයෝ දැ?”යි නුවණැත්තෝ ලබ්ධි විචාරත් වා. කරුණු විචාරත් වා. ලබ්ධිත් කරුණුත් දෙක ම විචාරත් වා.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, නුවණැත්තෝ ලබ්ධි විචාරන්නාහු, කරුණු විචාරන්නාහු, ලබ්ධිත් කරුණුත් දෙක ම විචාරන්නාහු, “මේ භවතුන්ගේ කුශල වූත් කුශලසඞ්ඛ්‍යාත වූත් අනවද්‍ය වූත් අනවද්‍යසඞ්ඛ්‍යාත වූත් සෙවිතව්‍ය වූත් සෙවිතව්‍යසඞ්ඛ්‍යාත වූත් අලමාර්‍ය වූත් අලමාර්‍යසඞ්ඛ්‍යාත වූත් ශුක්ල වූත් ශුක්ලසඞ්ඛ්‍යාත වූත් යම් දහම් කෙනෙක් වෙත් නම්, මහණ ගොයුම්හු මේ දහම් නිරව‍ශෙෂයෙන් සමාදන් කොට ගෙන පවතියි. අන්‍ය භවත් ගණචාර්‍යයෝ වූ කලි යම් තමක් ම හෝ සමාදන් කොට පවතිත් යැ යි මෙසේ කියන්නාහ යන මේ කාරණය ඇත්තේ ම ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, මෙසේ නුවණැත්තෝ ලබ්ධි විචාරන්නාහු කරුණු විචාරන්නාහු ලබ්ධිත් කරුණුත් විචාරන්නාහු අප ම එහි ලා බෙහෙවින් පසස්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "6. අනෙකෙක් ද ඇත. කාශ්‍යපය, ‘මේ භවතුන්ගේ අකුශල වූත් අකුශලසඞ්ඛ්‍යාත වූත්, සාවද්‍ය වූත් සාවද්‍යසඞ්ඛ්‍යාත වූත්, අසෙවිතව්‍ය වුත් අසෙවිතව්‍යසඞ්ඛ්‍යාත වූත්, ආර්‍යභාවයට නොසමත් වූත් ආර්‍යභාවයට නොසමත් යැ යි කියන ලද්දා වූත්, කෘෂ්ණ වූත් කෘෂ්ණසඞ්ඛ්‍යාත වූත් යම් ධර්‍මකෙනෙක් වෙත් නම්, කවරෙක් මෙකී දෑ නිරවශෙෂයෙන් පහ කොට පවතී ද? ගෞතමශ්‍රාවක සඞ්ඝයා ද නැත හොත් අන් භවත් ගණාචාර්‍යශ්‍රාවක සමූහයෝ දැ? යි නුවණැත්තෝ ශාස්තෘවරයා හා ශාස්තෘවරයා හෝ ශ්‍රාවකගණයා හා ශ්‍රාවකගණයා හෝ සසඳා ලබ්ධි විචාරත් වා. කරුණු විචාරත් වා. ලබ්ධිත් කරුණුත් විචාරත්වා. ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 362,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඨානං ඛො පනෙතං කස්සප විජ්ජති යං විඤ්ඤූ සමනුයුඤ්ජන්තා සමනුගාහන්තා සමනුභාසන්තා එවං වදෙය්යුං: “යෙ ඉමෙසං භවතං ධම්මා අකුසලා අකුසලසඞ්ඛාතා සාවජ්ජා සාවජ්ජසඞ්ඛාතා අසෙවිතබ්බා අසෙවිතබ්බසඞ්ඛාතා න අලමරියා න අලමරියසඞ්ඛාතා කණ්හා කණ්හසඞ්ඛාතා, ගොතමසාවකසඞ්ඝො ඉමෙ ධම්මෙ අනවසෙසං පහාය වත්තති, යං වා පන භොන්තො පරෙ ගණාචරියසාවකසඞ්ඝා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉතිහ කස්සප විඤ්ඤූ සමනුයුඤ්ජන්තා සමනුගාහන්තා සමනුභාසන්තා අම්හෙව තත්ථ යෙභුෙය්යන පසංසෙය්යුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "7. අපරම්පි නො කස්සප විඤ්ඤූ සමනුයුඤ්ජන්තං සමනුගාහන්තං සමනුභාසන්තං සත්ථාරා වා සත්ථාරං සඞ්ඝෙන වා සඞ්ඝං: “යෙ ඉමෙසං භවතං ධම්මා කුසලා කුසලසඞ්ඛාතා අනවජ්ජා අනවජ්ජසඞ්ඛාතා සෙවිතබ්බා සෙවිතබ්බසඞ්ඛාතා අලමරියා අලමරියසඞ්ඛාතා සුක්කා සුක්කසඞ්ඛාතා, කො ඉමෙ ධම්මෙ අනවසෙසං සමාදාය වත්තති? ගොතමසාවකසඞ්ඝො වා, පරෙ වා පන භොන්තො ගණාචරියසාවකසඞ්ඝා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඨානං ඛො පනෙතං කස්සප විජ්ජති යං විඤ්ඤූ සමනුයුඤ්ජන්තා සමනුගාහන්තා සමනුභාසන්තා එවං වදෙය්යුං “යෙ ඉමෙසං භවතං ධම්මා කුසලා කුසලසඞ්ඛාතා අනවජ්ජා අනවජ්ජසඞ්ඛාතා සෙවිතබ්බා සෙවිතබ්බසඞ්ඛාතා අලමරියා අලමරියසඞ්ඛාතා සුක්කා සුක්කසඞ්ඛාතා, ගොතමසාවකසඞ්ඝො ඉමෙ ධම්මෙ අනවසෙසං සමාදාය වත්තති, යං වා පන භොන්තො පරෙ ගණාචරියසාවකසඞ්ඝා’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉතිහ කස්සප විඤ්ඤූ සමනුයුඤ්ජන්තා සමනුගාහන්තා සමනුභාසන්තා අම්හෙව තත්ථ යෙභුෙය්යන පසංසෙය්යුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "8. අත්ථි කස්සප මග්ගො අත්ථි පටිපදා යථා පටිපන්නො සාමඤ්ඤෙව ඤස්සති සාමං දක්ඛිති “සමණො’ව ගොතමො කාලවාදී භූතවාදී අත්ථවාදී ධම්මවාදී විනයවාදී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච කස්සප මග්ගො කතමා පටිපදා යථා පටිපන්නො සාමඤ්ඤෙව ඤස්සති සාමං දක්ඛිති “සමණො’ව ගොතමො කාලවාදී භූතවාදී අත්ථවාදී ධම්මවාදී විනයවාදී?”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, නුවණැත්තෝ ලබ්ධි විචාරන්නාහු, කරුණු විචාරන්නාහු, ලබ්ධිත් කරුණුත් දෙක ම විචාරන්නාහු, ‘මේ භවතුන්ගේ අකුසල් වූත් අකුසල් යි දන්නා ලද්දා වූත්, සදොස් වූත් සදොස් යි දන්නා ලද්දා වූත්, නොසෙවියැ යුතු වූත් නොසෙවියැ යුතු හ යි දන්නා ලද්දා වූත් අරියබව් ලබනුවට නොසමත් වූත්, අරියබව් ලබනුවට නොසමත් හ යි දන්නා ලද්දා වූත්, කළු වූත්, කළු යැ යි දන්නා ලද්දා වූත් යම් දහම් කෙනෙක් වෙත් නම්, ගොයුම්සවුමුළුව ම මෙකී දෑ නොඉතිරි කොට දුරැලා සිටී. අන් ගණැදුරන්ගේ සවුමුළුහු යම්තමක් ම දුරැ ලා සිටිත්’ යැ යි මෙසේ කියන්නාහ යන මේ කරුණ ඇත්තේ ම ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, මෙසේ නුවණැත්තෝ ලබ්ධි විචාරන්නාහු කරුණු විචාරන්නාහු ලබ්ධිත් කරුණුත් විචාරන්නාහු අප ම එහි බෙහෙවින් පසස්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "7. කාශ්‍යපය, අනෙකෙක් ද ඇත. මේ භවතුන්ගේ කුසල් වූත් කුසල් යි දන්නා ලද්දාවූත්, නිදොස් වූත් නිදොස් යි දන්නා ලද්දාවූත්, ‍සෙවියැ යුතු වූත් සෙවියැ යුතු හ යි දන්නා ලද්දාවූත්, අරියබව් ලබනුවට සමත් වූත් අරියබව් ලබනුවට සමත්හ යි දන්නා ලද්දාවූත්, සුදු වූත් සුදු යැ යි දන්නා ලද්දාවූත් යම් දහම් කෙනෙක් වෙත් න‍ම්, කවරෙක් මේ දැ මුළුල්ල ම සමාදන් කොට ගෙන පවතී ද? ගොයුම්සවුමුළුව ද නැත හොත් අන් භවත් සවුමුළුහු දැ? යි ශාස්තෘහු හා ශාසතෘහු ද, සවුමුළුව හා සවුමුළුව ද සසඳා නුවණැත්තෝ අප ලබ්ධිය විචාරත් වා, කරුණු විචාරත් චා, ලබ්ධිත් කරුණුත් දෙක ම විචාරත් වා.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, නුවණැත්තෝ ලබ්ධි විචාරන්නාහු, කරුණු විචාරන්නාහු, ලබ්ධිත් කරුණුත් විවාරන්නාහු, ‘මේ භවතුන්ගේ කුසල් වූත් කුසල් යි දන්නා ලද්දාවූත්, නිදොස් වූත් නිදොස් යි දන්නා ලද්දාවූත්, සෙවියැ යුතු වූත් සෙවියැ යුතු යැ යි දන්නා ලද්දාවූත්, අරියබවට සමත් වූත් අරියබවට සමත්හ යි දන්නා ලද්දාවූත්, සුදු වූත් සුදුහ යි දන්නා ලද්දාවූත් යම් දහම් කෙනෙක් වෙත් නම්, ගොයුම්සවුමුළුව ම මේ දහම් මුළුල්ල සමාදන් කොට ගෙන පවතී. භවත් අන් ගණැඳුරුමුළුහු යම්තමක් ම සමාදන් කොට ගෙන පවතිත් යැ’ යි මෙසේ කියන්නාහ යන මේ කරුණ විද්‍යාමාන ම ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, මෙසේ නුවණැත්තෝ ලබ්ධි විචාරන්නාහු කරුණු විචාරන්නාහු, ලබ්ධිත් කරුණුත් විචාරන්නාහු, අප ම එහි බෙහෙවින් පසස්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "8. කාශ්‍යපය, යම්සේ පිළිපන් තැනැත්තේ “මහණ ගොයුම්හු ම කල් සලකා කථා කරන සුල්ලෝ ය, ඇත්ත ම කියන සුල්ලෝ ස, දෙලෝ වැඩ ඇසිරු කොට ම කියන සුල්ලෝ ය, නවලොවුතුරාදහම් ඇසිරු කොට කියන සුල්ලෝ ය, විනය ඇසිරු කොට ම කියන සුල්ලෝ යැ” යි තෙමේ ම දන්නේ නම්, තෙමේ ම දක්නේ නම්, ඒ මඟ ඇත. ඒ පිළිවෙත ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, යම්සේ පිළිපන් තැනැත්තේ ... තෙමේ ම දන්නේ නම්, තෙමේ ම දක්නේ නම්, ඒ මඟ කවරේ ද? ඒ පිළිවෙත කවරේ ද?",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 364,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අයමෙව අරියො අට්ඨඞ්ගිකො මග්ගො. සෙය්යථිදං: සම්මාදිට්ඨි සම්මාසඞ්කප්පො සම්මාවාචා සම්මාකම්මන්තො සම්මාආජීවො සම්මාවායාමො සම්මාසති සම්මාසමාධි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො කස්සප මග්ගො අයං පටිපදා, යථා පටිපන්නො සාමඤ්ඤෙව ඤස්සති සාමං දක්ඛිති ‘සමණො’ව ගොතමො කාලවාදී භූතවාදී අත්ථවාදී ධම්මවාදී විනයවාදී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "9. එවං වුත්තෙ අචෙලො කස්සපො භගවන්තං එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "“ඉමෙපි ඛො ආවුසො ගොතම තපොපක්කමා එකෙසං සමණබ්රාහ්මණානං සාමඤ්ඤසඞ්ඛාතා ච බ්රහ්මඤ්ඤසඞ්ඛාතා ච: අචෙලකො හොති මුත්තාචාරො, හත්ථාපලෙඛනො, න එහිභදන්තිකො, න තිට්ඨභදන්තිකො, නාභිහටං, න උද්දිස්සකටං, න නිමන්තනං සාදියති. සො න කුම්භිමුඛා පටිග්ගණ්හාති, න කළොපිමුඛා පටිග්ගණ්හාති, න එළකමන්තරං, න දණ්ඩමන්තරං, න මුසලමන්තරං, න ද්වින්නං භුඤ්ජමානානං, න ගබ්භිනියා, න පායමානාය, න පුරිසන්තරගතාය, න සංකිත්තීසු, න යත්ථ සා උපට්ඨිතො හොති, න යත්ථ මක්ඛිකා සණ්ඩසණ්ඩචාරිනී, න මච්ඡං න මංසං. න සුරං න මෙරයං න ථුසොදකං පිවති. සො එකාගාරිකො වා හොති එකාලොපිකො, ද්වාගාරිකො වා හොති ද්වාලොපිකො, සත්තාගාරිකො වා හොති සත්තාලොපිකො, එකිස්සාපි දත්තියා යාපෙති, ද්වීහිපි දත්තීහි යාපෙති, සත්තහිපි දත්තීහි යාපෙති, එකාහිකම්පි ආහාරං ආහාරෙති, ද්වීහිකම්පි ආහාරං ආහාරෙති, සත්තාහිකම්පි ආහාරං ආහාරෙති. ඉති එවරූපං අද්ධමාසිකම්පි පරියායභත්තභොජනානුයොගමනුයුත්තො විහරති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "සම්මාදිට්‍ඨි, සම්මාසඞ්කප්ප, සම්මාවාචා, සම්මාකම්මන්ත, සම්මාආජීව, සම්මාවායාම, සම්මාසති, සම්මාසමාධි යන මේ අරි අටැඟි මඟ ම ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, යම්සේ පිළිපන් තැනැත්තේ “මහණ ගොයුම්හු ම කල් සලකා කියන සුලුහ, ඇත්ත ම කියන සුලුහ, වැඩ ඇසිරැ ම කියන සුලුහ, විනය ඇසිරැ ම කියන සුලුහ” යි තෙමේ ම දන්නේ නම් තෙමේ ම දක්නේ නම් මේ ඒ මඟය, මේ ඒ පිළිවෙත ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "9. මෙසේ වදාළ කල්හි අවෙලකාශ්‍යප තෙම භාග්‍යවතුන් වහන්සේට මෙසේ කී ය:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ඇවැත් ගොයුමාණනි, ඇතැම් මහණ බමුණන්ගේ මහණකමැ යි කියන ලද, බමුණුකමැ යි කියන ලද මේ තවකම් (තවුස්දම්) කෙනෙක් ඇත්හ: අවෙලක (බහාලූ පිළි ඇතියේ) වෙයි. මුක්තාචාර (හරනා ලද ආචාර ඇතියේ) වෙයි. හස්තාවලෙහනක (බොජුන් කිස නිමි කලැ අත ලෝනේ) වෙයි. න එහිහදන්තික (වඩින්නැ වහන්සැ යි කැඳවන ලදුයේ නො එන්නේ) වෙයි. න තිට්ඨභදන්තික (වැඩ සිටින්නැ යි කියන ලදුයේ නො සිටුනේ) වෙයි. අභිහට භෝජනය (තමා එන්නට පළමු ගෙනා බොජුන්) නො ඉවසයි. උද්දිස්සකට භෝජනය (තමා උදෙසා පිළියෙල කළ බොජුන්) නො ඉවසයි. නිමන්ත්‍රණය (බොජුන් සඳහා අසෝ තැනට වඩින්නැ යි කළ නිමැතුම) නො ඉවසයි. කුම්භිමුඛයෙන් (කුඹුමුවින් - පිසූ බත් ලූ බඳුනින්) නඟා දුන් අහර නො පිළිගනී. කලොපිමුඛයෙන් (ඉකිළි පැස්මුවින්){1} නඟා දුන් අහර නො පිළිගනී. එළිපත අතරැ කොට දුන් අහර ‍ නො පිළිගනී. දංඩක් අතරැ කොට දුන් අහර නො පිළිගනී. මොහොලක් අතරැ කොට දුන් අහර නො පිළිගනී. වළඳන දෙදෙනකුන්ගෙන් එකකු නැගී සිටැ දුන් අහර නො පිළිගනී. ගැබින්නක දුන් අහර, (දරුවාට) කිරි පොවන්නියක දුන් අහර, සැමියා අතරට ගිය ස්ත්‍රියක දුන් අහර නො පිළිගනී. දුඛික්සෙමෙහි (සමාදන් කොට පිළියෙල කළ බොජුන් අතුරෙන් ගෙන) දුන් අහර නො පිළිගනී. යම් තැනෙක බල්ලෙක් එළැඹ සිටියේ නම් ඌට නොදී ගෙනවුත් දුන් අහර, යම් තැනෙක මැස්සෝ රැස් රැස් වැ හැසිරෙන්නාහු නම් එ තැනින් දුන් අහර නො පිළිගනී. දියමස් ‍ගොඩමස් නො පිළිගනී. රහමෙර නො බොයි. සෞවීරකය (සියලු ශශ්‍යසම්භාරයෙන් කළ කාඩිය) නො බොයි. හේ එකාගාරික (එක් ගෙයකින් ම අහර ලැබ නවත්නේ) හෝ එකාලොපික (එක් බත් පි‍‍ඬෙකින් ම යැපෙන්නේ) වෙයි. ද්වාගාරික (දෙගෙයෙකින් අහර ලැබ නවත්නේ) හෝ ද්වාලොපික (දෙබත් පිඬුයෙකින් ම යැපෙන්නේ) වෙයි. සත්තාගාරික (සත් ගෙයෙකින් අහර ලැබ නවත්නේ) හෝ සත්තාලොපික (සත් අහරපි‍ඬෙකින් ම යැපෙන්නේ) වෙයි. එක් දත්තියෙක (කුඩා තලියෙක) බතින් ද යැපෙයි, දත්ති දෙකෙක බතින් ද යැපෙයි. දත්ති සතෙක බතින් ද යැපෙයි. දවසක් හැර දවසක් ද අහර ගනී. දෙදවසක් හැර දවසක් ද අහර ගනී. සත් දවසක් හැර දවසක් ද අහර ගනි. මෙසේ මෙබඳු වූ අඩමසක් හැර දවසක් ද වාර බත් වැළැඳීමේ ව්‍රතයේ යෙදුණේ වෙසෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඉකිළි (උක්ඛලි) නම් බත් පිසන වළඳ යි. පැස නම් බත් ලන පසයි."
                    }
                ]
            }
        },
        {
            "pageNum": 366,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "10. ඉමෙ’පි ඛො ආවුසො ගොතම තපොපක්කමා එතෙසං සමණබ්රාහ්මණානං සාමඤ්ඤසඞ්ඛාතා ච බ්රහ්මඤ්ඤසඞ්ඛාතා ච: සාකභක්ඛො වා හොති, සාමාකභක්ඛො වා හොති, නීවාරභක්ඛො වා හොති, දද්දුලභක්ඛො වා හොති, හටභක්ඛො වා හොති, කණභක්ඛො වා හොති, ආචාමභක්ඛො වා හොති, පිඤ්ඤාකභක්ඛො වා හොති, තිණභක්ඛො වා හොති, ගොමයභක්ඛො වා හොති, වනමූලඵලාහාරො යාපෙති පවත්තඵලභොජී."
                    },
                    {
                        "type": "paragraph",
                        "text": "11. ඉමෙ’පි ඛො ආවුසො ගොතම තපොපක්කමා එකෙසං සමණබ්රාහ්මණානං සාමඤ්ඤසඞ්ඛාතා ච බ්රහ්මඤ්ඤසඞ්ඛාතා ච: සාණානි පි ධාරෙති, මසාණානි පි ධාරෙති, ඡවදුස්සානි පි ධාරෙති, පංසුකූලානි පි ධාරෙති, තිරීටානි පි ධාරෙති, අජිනම්පි ධාරෙති, අජිනක්ඛිපම්පි ධාරෙති, කුසචීරම්පි ධාරෙති, වාකචීරම්පි ධාරෙති, ඵලකචීරම්පි ධාරෙති, කෙසකම්බලම්පි ධාරෙති, වාලකම්බලම්පි ධාරෙති, උලූකපක්ඛිකම්පි ධාරෙති, කෙසමස්සුලොචකො’පි හොති කෙසමස්සුලොචනානුයොගමනුයුත්තො, උබ්භට්ඨකො’පි හොති ආසනපටික්ඛිත්තො, උක්කුටිකො’පි හොති උක්කුටිකප්පධානමනුයුත්තො, කණ්ටකාපස්සයිකො’පි හොති, කණ්ටකාපස්සයෙ සෙය්යං කප්පෙති, ඵලකසෙය්යම්පි කප්පෙති, ථණ්ඩිලසෙය්යම්පි කප්පෙති, එකපස්සයිකො’පි හොති, රජොජල්ලධරො අබ්භොකාසිකො’පි හොති යථාසන්ථතිකො, වෙකටිකො’පි හොති විකටභොජනානුයොගමනුයුත්තො, අපානකො’පි හොති අපානකත්තමනුයුත්තො, සායතතියකම්පි{1} උදකොරොහණානුයොගමනුයුත්තො විහරතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "12. “අචෙලකො චෙ’පි කස්සප හොති මුත්තාචාරො හත්ථාපලෙඛනො -පෙ- සත්තාහිකම්පි ආහාරං ආහාරෙති. ඉති එවරූපං අද්ධමාසිකම්පි පරියායභත්තභොජනානුයොගමනුයුත්තො විහරති. තස්ස චායං සීලසම්පදා චිත්තසම්පදා පඤ්ඤාසම්පදා අභාවිතා හොති අසච්ඡිකතා. අථ ඛො සො ආරකා’ව සාමඤ්ඤා, ආරකාව බ්රහ්මඤ්ඤා."
                    },
                    {
                        "type": "paragraph",
                        "text": "යතො ඛො කස්සප භික්ඛු අවෙරං අබ්යාපජ්ජං මෙත්තචිත්තං භාවෙති, ආසවානඤ්ච ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති. අයං වුච්චති කස්සප භික්ඛු සමණො ඉති’පි බ්රාහ්මණො ඉති’පි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සායංතතියකන්ති පි පාඨො."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "10. ඇවැත් ගොයුමා‍ණනි, ඇතැම් මහණබමුණන්ගේ ‘මහණකම්’ යැ යි කියන ලද, ‘බමුණුකම්’ යැ යි කියන ලද මේ තවකම් (තවුස්දම්) කෙනෙක් වෙති: අමුපලා බුදිනේ හෝ වෙයි. බොඩහමු බුදිනේ හෝ වෙයි. සියදා වි (හූරු හැල්) බුදිනේ හෝ වෙයි. සම් ලියා ලූ කසට බුදිනේ හෝ වෙයි. ලහටු ද දිය සෙවෙල් ද බුදිනේ හෝ වෙයි. සහල් කුඩු කන්නේ හෝ වෙයි. දඹුබත් කන්නේ හෝ වෙයි. මුරුවට කන්නේ හෝ වෙයි. තණකොළ කන්නේ හෝ වෙයි. ගොම කන්නේ හෝ වෙයි. වන මුල් පල අහර කොටැත්තේ තමා ම වැටුණු පල වළඳනුයේ හෝ යැපෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "11. ඇවැත් ගොයුමාණනි, ඇතැම් මහණබමුණන්ගේ ‘මහණුවම්’ යැ යි කියන ලද, ‘බමුණුවම්’ යැ යි කියන ලද මේ තවකම් කෙනෙක් වෙති: හණවැහැරි ද දරයි. අන් හූ හා හන නූල් මුසු කොට වියූ වස්ත්‍ර දරයි. මිනියෙන් බැහැර කොට ලූ වසත්‍ර දරයි. ඉවතැ ලූ කඩමාලු රෙදි දරයි. රිටිසුඹුළුයෙන් වියූ වස්ත්‍ර දරයි. අඳුන්මුවසම් දරයි. මැදින් පැළුැ අඳුන්මුව සම් දරයි. කුසතණ ගොතා කළ වැහැරි ද දරයි. නියඳවැහැරි ද දරයි. මිනිස් කෙහෙයෙන් කළ කම්බිලි ද දරයි. අස්වලග ලොමින් කළ කම්බිලි දරයි. මහමුහුණු පියාපත් ගොතා කළ වස්ත්‍ර දරයි. කෙහෙ රවුලු ඉදිරීමෙහි යෙදු‍ණේ කෙසමස්සුලොවක ද වෙයි. පිළිකෙවු කළ අසුන් ඇත්තේ නැගී සිටුනේ වෙයි. උත්කුටුක වූයේ ද උත්කුටුකවීර්‍ය්‍යයෙහි යෙදුණේ උත්කුටුක (වැ පැන පැන යන්නේ)ද වෙයි. කණ්ටකාපස්සයික (බිමැ කටු ගසා ඊ මතැ සමක් අතුරා එහි ඉඳුම් හිටුම් ඈ කරනුයේ) ද වෙයි. බිමැ කටු ගසා ඊ මතැ ලූ ඇතිරියෙහි ශයනය කෙරෙයි. පුවරුයෙහි ශයනය කරන්නේ ද වෙයි. ථණ්ඩිලසෙය්‍යාව (පිල්කඩෙහි ශයනය) කරන්නේ ද වෙයි. එකපස්සයික (එක් ඇලයෙකින් හෝනේ) ද වෙයි. රජස්දැලි දරනුයේ එළිමහනැ වසනුයේ ද වෙයි. අතුරන ලද පරිදි වූ (වෙනස් නොකොට) අස්නැ හිඳුනේ ද වෙයි. විකෘතභෝජනයෙහි (ගූථානුභවයෙහි) යෙදුණේ වෛකෘතික ද වෙයි. අපානකත්‍වයෙහි (සිහිල් දිය නොපීමෙහි) යෙදුණේ සිහිල් දිය නො බොන්නේ ද වෙයි. සවස තෙවැනි කොට (උදේ මද්දහන සවස යන තුන් වේලෙහි පව් සෝදා හරිනු පිණිස) දියට බැස්මෙහි යෙදුණේ වෙසෙයි යනු යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "12. “කාශ්‍යපය, ඉදින් අචෙලකත් වේ ද, මුක්තාචාරත් (හරන ලද ආචාර ඇත්තේත්) වේ ද, හස්තාවලෙහනව්‍රත ඇතියේත් වේ ද ... සත් දවසකට වරක් අහර ගනී ද, මෙසේ මෙ බඳු වූ අඩමසක් හැර දවසක් ද වාරබත් වැළැඳිමේ ව්‍රතයේ යෙදුණේ වෙසේ ද, එහෙත් ඔහු විසින් මේ ශීලසම්පත්තියත් චිත්තසම්පත්තියත් ප්‍රඥාසම්පත්තියත් නො වඩන ලදුයේ පසක් නො කරන ලදුයේ වේ නම්, එසේ කලැ හේ මහණුවම් කෙරෙන් දුරැ ම සිටියේ වෙයි, බමුණුවම් කෙරෙන් දුරැ ම සිටියේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, යම් හෙයෙකින් ම භික්‍ෂු තෙම ද්වෙශ වෛර රහිත, දොම්නස් ව්‍යාපාද රහිත ‍මෙත් සිත වඩා ද, ආස්‍රවයන්ගේ ක්‍ෂයයෙන් අනාස්‍රව වූ චිතතවිමුක්තියත් (ඵලසමාධියත්) ප්‍රඥාවිමුක්තියත් (ඵලඥානයත්) මෙ අත්බව්හි ම තෙමේ විශිෂ්ට ඥානයෙන් දැන, පසක් කොට, ලැබැ වෙසේ ද, කාශ්‍යපය, මේ භික්‍ෂු තෙම මහණ නමුදු බමුණු නමුදු වේ යැ යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 368,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "13. සාකභක්ඛො චෙ’පි කස්සප හොති සාමාකභක්ඛො චෙ’පි කස්සප හොති -පෙ- වනමූලඵලාහාරො යාපෙති පවත්තඵලභොජී. තස්ස චායං සීලසම්පදා චිත්තසම්පදා පඤ්ඤාසම්පදා අභාවිතා හොති අසච්ඡිකතා. අථ ඛො සො ආරකා’ව සාමඤ්ඤා ආරකා’ව බ්රහ්මඤ්ඤා."
                    },
                    {
                        "type": "paragraph",
                        "text": "යතො ඛො කස්සප භික්ඛු අවෙරං අබ්යාපජ්ජං මෙත්තචිත්තං භාවෙති, ආසවානඤ්ච ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති, අයං වුච්චති කස්සප භික්ඛු සමණො ඉති’පි බ්රාහ්මණො ඉති’පි."
                    },
                    {
                        "type": "paragraph",
                        "text": "14. සාණානි චෙ’පි කස්සප ධාරෙති මසාණානි’පි ධාරෙති -පෙ- සායතතියකම්පි උදකොරොහණානුයොගමනුයුත්තො විහරති, තස්ස චායං සීලසම්පදා චිත්තසම්පදා පඤ්ඤාසම්පදා අභාවිතා හොති අසච්ඡිකතා. අථ ඛො සො ආරකා’ව සාමඤ්ඤා ආරකා’ව බ්රහ්මඤ්ඤා."
                    },
                    {
                        "type": "paragraph",
                        "text": "යතො ඛො කස්සප භික්ඛු අවෙරං අබ්යාපජ්ජං මෙත්තචිත්තං භාවෙති ආසවානඤ්ච ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති. අයං වුච්චති කස්සප භික්ඛු සමණො ඉතිපි බ්රාහ්මණො ඉතිපීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "15. එවං වුත්තෙ අචෙලො කස්සපො භගවන්තං එතදවොච: දුක්කරං භො ගොතම සාමඤ්ඤං දුක්කරං බ්රහ්මඤ්ඤන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“පකති ඛො එසා කස්සප ලොකස්මිං දුක්කරං සාමඤ්ඤං දුක්කරං බ්රහ්මඤ්ඤන්ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "අචෙලකො චෙ’පි කස්සප හොති මුත්තාචාරො -පෙ- ඉති එවරූපං අද්ධමාසිකම්පි පරියායභත්තභොජනානුයොගමනුයුත්තො විහරති. ඉමාය ච කස්සප මත්තාය ඉමිනා ච තපොපක්කමෙන සාමඤ්ඤං වා අභවිස්ස බ්රහ්මඤ්ඤං වා දුක්කරං සුදුක්කරං, නෙතං අභවිස්ස කල්ලං වචනාය දුක්කරං සාමඤ්ඤං දුක්කරං බ්රහ්මඤ්ඤ”න්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "16. සක්කා ච පනෙතං අභවිස්ස කාතුං ගහපතිනා වා ගහපතිපුත්තෙන වා අන්තමසො කුම්භදාසියා’පි: “හන්දාහං අචෙලකො හොමි මුත්තාචාරො -පෙ- ඉති එවරූපං අද්ධමාසිකම්පි පරියායභත්තභොජනානුයොගමනුයුත්තො විහරාමී”ති. යස්මා ච ඛො කස්සප අඤ්ඤත්රෙව ඉමාය මත්තාය අඤ්ඤත්ර ඉමිනා තපොපක්කමෙන සාමඤ්ඤං වා හොති බ්රහ්මඤ්ඤං වා දුක්කරං සුදුක්කරං, තස්මා එතං කල්ලං වචනාය දුක්කරං සාමඤ්ඤං දුක්කරං බ්රහ්මඤ්ඤන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "13. කාශ්‍යපය, තවුස් තෙමේ ඉදින් අමුපලා බුදිනුයේ වේ ද, බොඩහමු බුදිනුයේ වේ ද, ... තමන් ම වැටුණු ඵල බුදින සුලු වූයේ වන මුල් පල අහර කොටැත්තේ යැපේ ද, ඔහු විසින් මේ ශීලසම්පත්තියත් චිත්තසම්පත්තියත් ප්‍රඥාසම්පත්තියත් නො වඩන ලදුයේ පසක් නො කරන ලදුයේ වේ නම්, එසේ කලැ හේ මහණකමින් දුරෙහි ම බමුණුකමින් දුරෙහි ම සිටියේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, යම් හෙයෙකින් ම භික්‍ෂු තෙම ද්වේෂරහිත ව්‍යාපාදරහිත මෙත්සිත වඩා ද, ආස්‍රවයන්ගේ ද ක්‍ෂයයෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලඥානයත් තෙමේ ම මේ අත්බව්හි ම වෙසෙසි නුවණින් දැන, පසක් කොට ලැබ වෙසේ ද, කාශ්‍යපය, මේ භික්‍ෂු තෙම මහණ නමුදු බමුණු නමුදු වේ යැ යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "14. කාශ්‍යපය, තවුස් තෙමේ ඉඳින් හණවැහැරියත් දරා ද භණනූල් අන් හූ හා මුසු කොට වියූ වස්ත්‍රත් දරා ද ... සවස තෙවැනි කොට දියට බැසීමෙහි යෙදුණේ වෙසේ ද, ඔහු විසින් මේ ශීලසම්පත්තියත් චිත්තසම්පත්තියත් ප්‍රඥාසම්පත්තියත් නො වඩනා ලදුයේ පසක් නොකරන ලදුයේ වේ නම්, එසේ කලැ හේ මහණකමින් දුරෙහි ම බමුණුකමින් දුරෙහි ම සිටියේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, යම් හෙයෙකින් ම භික්‍ෂු තෙම ද්වේෂ රහිත ව්‍යාපාද රහිත මෙත් සිත වඩා ද, ආස්‍රවයන්ගේ ද ක්‍ෂයයෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලඥනයත් තෙමේ ම මෙ අත්බව්හි ම වෙසෙසි නුවණින් දැන පසක් කොට ලැබ වෙසේ ද, කාශ්‍යපය, මේ භික්‍ෂු තෙම මහණ නමුදු බමුණු නමුදු වේ යැ යි කියනු ලැබේ”.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "15. භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ කල්හි, කාශ්‍යප තෙම “භවද් ගෞතමයිනි, මහණකම දුෂ්කර ය. බමුණුකම දුෂ්කර යැ”යි භාග්‍යවතුන් වහන්සේට කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“කාශ්‍යපය, ‘මහණකම දුෂ්කර ය, බමුණුකම් දුෂ්කර යැ’ යන මෙය ලොවැ ප්‍රකෘති කථාව ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, තවුස් තෙම අචෙලකත් වේද, මුක්තාචාරත් වේ ද .... මෙසේ අඩමසකට වරක් (අඩමසක් හැර දවසක්) මෙබඳු වාර බත් වැළැඳීමේ යෙදුණේ වෙසේ ද, කාශ්‍යපය, මෙ පමණින් ම මේ (සුළු තවකමින් ම) මහණකම හෝ බමුණුකම දුෂ්කරත් ඉතා දුෂ්කරත් වන්නේ නම්, ‘මහණකම දුෂ්කර යැ සි, බමුණුකම දුෂ්කර යැ’ යන්න කීමට යෝග්‍ය නො වන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "16. කාශ්‍යපය, ගැහැවියක්හු විසින් හෝ ගැහැවිපුතක්හු විසින් හෝ යටත් පිරිසෙයින් කළදැස්සක විසින් නුමුදු “මම දැන් අචෙලක වෙමි, මුක්තාචාර වෙමි ... මෙසේ අඩමසක් හැර දවසක් දැ යි මෙබඳු වාර බත් වැළැඳී‍මේ යෙදුණෙම් වෙසෙමි”යි මේ තවකම් කරන්නට හැක්කේ වන්නේය. කාශ්‍යපය, යම් හෙයෙකින් මෙ පමණින් (මේ මඳ පිළිවෙතින්) වෙන් ව ම, මේ තවකමින් වෙන් ව ම මහණකම හෝ බමුණුකම දුෂ්කරත් සුදුෂ්කරත් වේ නම්, එහෙයින් ‘මහණකම් දුෂ්කර ය, බමුණුකම් දුෂ්කර යැ’ යි මෙය කියන්නට යෝග්‍ය ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 370,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යතො ඛො කස්සප භික්ඛු අවෙරං අබ්යාපජ්ජං මෙත්තචිත්තං භාවෙති, ආසවානඤ්ච ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති, අයං වුච්චති කස්සප භික්ඛු සමණො ඉති’පි බ්රාහ්මණො ඉති’පි."
                    },
                    {
                        "type": "paragraph",
                        "text": "17. සාකභක්ඛො චෙ’පි කස්සප හොති -පෙ- වනමූලඵලාහාරො යාපෙති පවත්තඵලභොජී. ඉමාය ච කස්සප මත්තාය ඉමිනා තපොපක්කමෙන සාමඤ්ඤං වා අභවිස්ස බ්රහ්මඤ්ඤං වා දුක්කරං සුදුක්කරං, නෙතං අභවිස්ස කල්ලං වචනාය ‘දුක්කරං සාමඤ්ඤං දුක්කරං බ්රහ්මඤ්ඤන්ති’."
                    },
                    {
                        "type": "paragraph",
                        "text": "සක්කා ච පනෙතං අභවිස්ස කාතුං ගහපතිනා වා ගහපතිපුත්තෙන වා අන්තමසො කුම්භදාසියාපි: ‘හන්දාහං සාකභක්ඛො වා හොමි, -පෙ- වනමූලඵලාහාරො යාපෙමි පවිත්තඵලභොජී’ති. යස්මා ච ඛො කස්සප අඤ්ඤත්රෙව ඉමාය මත්තාය අඤ්ඤත්ර ඉමිනා තපොපක්කමෙන සාමඤ්ඤං වා හොති බ්රහ්මඤ්ඤං වා දුක්කරං සුදුක්කරං, තස්මා එතං කල්ලං වචනාය ‘දුක්කරං සාමඤ්ඤං දුක්කරං බ්රහ්මඤ්ඤන්ති’."
                    },
                    {
                        "type": "paragraph",
                        "text": "යතො ඛො කස්සප භික්ඛු අවෙරං අබ්යාපජ්ජං මෙත්තචිත්තං භාවෙති, ආසවානඤ්ච ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති, අයං වුච්චති කස්සප භික්ඛු සමණො ඉති’පි බ්රාහ්මණො ඉති’පි."
                    },
                    {
                        "type": "paragraph",
                        "text": "18. සාණානි චෙ’පි, කස්සප ධාරෙති මසාණානිපි ධාරෙති -පෙ- සායතතියකම්පි උදකොරොහණානුයොගමනුයුත්තො විහරති. ඉමාය ච කස්සප මත්තාය ඉමිනා තපොපක්කමෙන සාමඤ්ඤං වා අභවිස්ස බ්රහ්මඤ්ඤං වා දුක්කරං සුදුක්කරං, නෙතං අභවිස්ස කල්ලං වචනාය ‘දුක්කරං සාමඤ්ඤං දුක්කරං බ්රහ්මඤ්ඤන්ති’."
                    },
                    {
                        "type": "paragraph",
                        "text": "සක්කා ච පනෙතං අභවිස්ස කාතුං ගහපතිනා වා ගහපතිපුත්තෙන වා අන්තමසො කුම්භදාසියාපි: ‘හන්දාහං සාණානිපි ධාරෙමි, මසාණානිපි ධාරෙමි, -පෙ- සායතතියකම්පි උදකොරොහණානුයොගමනුයුත්තො විහරාමී’ති. යස්මා ච ඛො කස්සප අඤ්ඤත්රෙව ඉමාය මත්තාය අඤ්ඤත්ර ඉමිනා තපොපක්කමෙන සාමඤ්ඤං වා හොති බ්රහ්මඤ්ඤං වා දුක්කරං සුදුක්කරං, තස්මා එතං කල්ලං වචනාය ‘දුක්කරං සාමඤ්ඤං දුක්කරං බ්රහ්මඤ්ඤන්ති’."
                    },
                    {
                        "type": "paragraph",
                        "text": "යතො ඛො කස්සප භික්ඛු අවෙරං අබ්යාපජ්ජං මෙත්තචිත්තං භාවෙති, ආසවානඤ්ච ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති. අයං වුච්චති කස්සප භික්ඛු සමණො ඉතිපි බ්රාහ්මණො ඉති’පීති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, යම් කලෙක පටන් භික්‍ෂු තෙම වෛර නැති ව්‍යාපාද නැති මෙත්සිත වඩා නම් ආස්‍රවයන්ගේ ක්‍ෂයයෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලඥානයත් මේ අත්බව්හි ම තෙමේ වෙසෙසි නුවණින් දැන පසක් කොට ලැබ වෙසේ නම්, කාශ්‍යපය, මෙහි භික්‍ෂුතෙම මහණ යැ යි දු බමුණු යැ යි දු කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "17. කාශ්‍යපය, ඉදින් තවුස් තෙම අමු පලා කන්නේ වේ ද ... තමන් ම වැටුණු පල බුදින සුලු වූයේ වෙනෙහි මුල් පල අහර කොට යැපේ ද, කාශ්‍යපය, මෙ පමණින් ම මේ තවකමින් ම මහණකම හෝ බමුණුකම දුෂ්කරත් සුදුෂ්කරත් වන්නේ නම් ‘මහණකම දුෂ්කර යැ, බමුණුකම් දුෂ්කර යැ’ යි කියන්නට යෝග්‍ය නො වන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, ගැහැවියකු විසින් හෝ ගැහැවිපුතක්හු විසින් හෝ යටත් පිරිසෙයින් කළදැස්සක විසින් නමුදු “මම දැන් අමුපලා කන්නෙම් වෙමි ... ස්වයම්පතිත ඵලභෝජි ව වනමූලඵලහාර ඇත්තෙම් යැපෙමි’යි මේ තවකම් කරන්නට හැකි වන්නේ ය. කාශ්‍යපය, යම් හෙයෙකින් ම මේ මඳ පිළිවෙතින් වෙන් ව ම මෙ තවකමින් වෙන් ව ම මහණකම හෝ බමුණුකම දුෂ්කරත් සුදුෂ්කරත් වේ ද, එ හෙයින් ‘මහණකම දුෂ්කර ය, බමුණුකම දුෂ්කර යැ’ යි මෙය කියනුවට යෝග්‍ය ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, යම් කලෙක පටන් භික්‍ෂු තෙම වෛර නැති ව්‍යාපාද නැති මෙත්සිත වඩා නම් ආස්‍රවයන්ගේ ක්‍ෂයයෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලඥානයත් මේ අත්බව්හි ම තෙමේ වෙසෙසි නුවණින් දැන පසක් කොට ලැබ වෙසේ නම්, කාශ්‍යපය, මේ භික්‍ෂු තෙම මහණ නමුදු බමුණු නමුදු වේ යැ යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "18. කාශ්‍යපය, ඉදින් තවුස් තෙම හණවැහැරි දරා ද, හණනූල් මුසු අන්හුයින් වියූ වස්ත්‍ර දරා ද ... සවස තෙවෙනි කොට දියේ බැසීමෙහි යෙදුණේ වෙසේ ද, කාශ්‍යපය, මේ මඳ පිළිවෙතින් මේ තවකමින් දුෂ්කරත් සුදුෂ්කරත් වූ මහණකමෙක් බමුණුකමෙක් වන්නේ නම් ‘ මහණකම දුෂ්කර යැ බමුණුකම දුෂ්කර යැ’ යි මෙය කියන්නට යෝග්‍ය නො වන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘මම් දැන් හණවැහැරි දරමි, හණනූල් අන්නූල් හා මුසු කොට වියූ වස්ත්‍ර දරමි ... සවස තෙවෙනි කොටැති ව දියෙහි ගැලීමෙහි යෙදුණෙම් වෙසෙමි’යි ගැහැවියකු විසින් හෝ ගැහැවිපුතක්හු විසින් හෝ යටත් පිරිසෙයින් කළදැස්සක විසිනුදු මෙය කරන්නට හැකි වන්නේ ය. කාශ්‍යපය, යම් හෙයෙකින් මේ මඳ පිළිවෙත හැර ම මේ තවකම් හැර ම, මහණකම් හෝ බමුණුකම් දුෂ්කරත් සුදුෂ්කරත් වේ ද, එහෙයින් ‘මහණකම් දුෂ්කර ය, බමුණුකම් දුෂ්කර යැ’ යි මෙය කියන්නට යෝග්‍ය ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, යම් කලෙක පටන් භික්‍ෂු තෙම වෛර නැති ව්‍යාපාද නැති මෙත්සිත වඩා ද ආස්‍රවයන්ගේ ක්‍ෂයයෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලඥානයත් මෙ අත්බව්හි ම තෙමේ වෙසෙසි නුවණින් දැන, පසක් කොට ලැබ වෙසේ ද, කාශ්‍යපය, මේ භික්‍ෂු තෙම මහණ නමුදු බමුණු නමුදු වේ යැ යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 372,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "19. එවං වුත්තෙ අචෙලො කස්සපො භගවන්තං එතදවොච: “දුජ්ජානො භො ගොතම සමණො දුජ්ජානො බ්රාහ්මණො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“පකති ඛො එසා කස්සප ලොකස්මිං ‘දුජ්ජානො සමණො දුජ්ජානො බ්රාහ්මණො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "20. අචෙලකො චෙ’පි, කස්සප හොති -පෙ- ඉති එවරූපං අද්ධමාසිකම්පි පරියායභත්තභොජනානුයොගමනුයුත්තො විහරති. ඉමාය කස්සප මත්තාය ඉමිනා තපොපක්කමෙන සමණො වා අභවිස්ස බ්රාහ්මණො වා දුජ්ජානො සුදුජ්ජානො, නෙතං අභවිස්ස කල්ලං වචනාය ‘දුජ්ජානො සමණො දුජ්ජානො බ්රාහ්මණො’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සක්කා ච පනෙසො අභවිස්ස ඤාතුං ගහපතිනා වා ගහපතිපුත්තෙන වා අන්තමසො කුම්භ දාසියාපි: අයං අචෙලකො හොති මුත්තාචාරො -පෙ- ඉති එවරූපං අද්ධමාසිකම්පි පරියායභත්තභොජනානුයොගමනුයුත්තො විහරතීති. යස්මා ච ඛො කස්සප අඤ්ඤත්රෙව ඉමාය මත්තාය අඤ්ඤත්ර ඉමිනා තපොපක්කමෙන සමණො වා හොති බ්රාහ්මණො වා දුජ්ජානො සුදුජ්ජානො, තස්මා එතං කල්ලං වචනාය දුජ්ජානො සමණො දුජ්ජානො බ්රාහ්මණො’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යතො ඛො කස්සප භික්ඛු අවෙරං අබ්යාපජ්ජං මෙත්තචිත්තං භාවෙති, ආසවානඤ්ච ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති, අයං වුච්චති කස්සප භික්ඛු සමණො ඉතිපි බ්රාහ්මණො ඉති’පීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "21. සාකභක්ඛො චෙ’පි කස්සප හොති සාමාකභක්ඛො චෙ’පි කස්සප හොති -පෙ-වනමූලඵලාහාරො යාපෙති පවත්තඵලභොජී. ඉමාය ච කස්සප මත්තාය ඉමිනා තපොපක්කමෙන සමණො වා අභවිස්ස බ්රාහ්මණො වා දුජ්ජානො සුදුජ්ජානො, නෙතං අභවිස්ස කල්ලං වචනාය ‘දුජ්ජානො සමණො දුජ්ජානො බ්රාහ්මණො’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සක්කා ච පනෙසො අභවිස්ස ඤාතුං ගහපතිනා වා ගහපතිපුත්තෙන වා අන්තමසො කුම්භදාසියාපි: ‘අයං සාකභක්ඛො වා හොති සාමාකභක්ඛො වා -පෙ- වනමූලඵලාහාරො යාපෙති පවත්තඵලභොජී’ති. යස්මා ච ඛො කස්සප අඤ්ඤත්රෙව ඉමාය මත්තාය අඤ්ඤත්ර ඉමිනා තපොපක්කමෙන සමණො වා හොති බ්රාහ්මණො වා දුජ්ජානො සුදුජ්ජානො, තස්මා එතං කල්ලං වචනාය ‘දුජ්ජානො සමණො දුජ්ජානො බ්රාහ්මණො’ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "19. මෙසේ වදාළ කල්හි අචෙලකාශ්‍යප තෙම භාග්‍යවතුන් වහන්සේට, “භවද් ගෞතමයිනි, මහණ තෙම දුකසේ දත යුතු ය, බමුණු තෙම දුකසේ දත යුතු යැ” යි මේ වචන කීය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“කාශ්‍යපය, ‘මහණ තෙමේ දුකසේ දත යුතු ය, බමුණු තෙම දුකසේ දත යුතු ය’ යන මෙය ලොවැ ප්‍රකෘති කථාව ම ය.” ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "20. කාශ්‍යපය, ඉදින් තවුස් තෙම අචෙලක වේ ද, ... මෙසේ මෙබඳු අර්‍ධමාසික පර්‍යායභක්‍තභෝජනව්‍රතයෙහි යෙදුණේ වෙසේ ද, කාශ්‍යපය, මේ මඳ පිළිවෙතින්, මේ තවකමින් දුකසේ දතයුතු ඉතා දුකසේ දතයුතු මහණෙක් බමුණෙක් වන්නේ නම්, ‘මහණ තෙම දුකසේ දත යුත්තේ ය, බමුණු තෙම දුකසේ දත යුත්තේ යැ’ යන මෙය කියන්නට යෝග්‍ය නො වන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ගැහැවියකු හෝ ගැහැවිපුතක්හු හෝ යටත් පිරිසෙයින් කළදැස්සක හෝ විසිනුදු ‘මේ තෙමේ අචෙලක වෙයි, මුක්තාචාර වෙයි ... මෙසේ මෙබඳු ආර්‍ධමාසික වූ ද පර්‍යායභක්තභෝජනව්‍රතයෙහි යෙදුණේ වෙසේ යැ’ යි ඔහු දත හැකි වන්නේ ය. කාශ්‍යපය, යම් හෙයෙකින් මේ මඳ පිළිවෙත හැර ම මේ තවකම් හැර ම මහණ තෙමේ හෝ බමුණු තෙමේ හෝ දුකසේ දත යුතු වේ ද, ඉතා දුකසේ දත යුතු වේ ද, එහෙයින් ‘මහණ තෙම දුකසේ දත යුතු ය, බමුණු තෙම දුකසේ දත යුතු යැ’යි මෙය කියත්නට යෝග්‍ය ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, යම් කලෙක පටන් භික්‍ෂු තෙම වෛර නැති, ව්‍යාපාද නැති, මෙත්සිත වඩා ද, ආස්‍රවයන්ගේ ක්‍ෂයයෙන් අනාස්‍රව වූ ඵලසමාධිය ද ඵලඥානය ද මෙ අත්බව්හි ම තෙමේ වෙසෙසි නුවණින් දැන පසක් කොට ලැබ වෙසේ ද, කාශ්‍යපය, මෙ භික්‍ෂු තෙම මහණ යැ යි ද බමුණු යැ යි ද කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "21. කාශ්‍යපය, තවුස් තෙම ඉදින් අමු පලා කන්නේ වේ ද, බොඩහමු කන්නේ වේ ද, ... ස්වයංපතිතඵල වළඳන සුලු වූයේ වනමුල් පල ආහාර කොටැත්තේ යැපේ ද, කාශ්‍යපය, මේ මඳ පිළිවෙතින් මේ තවකමින් දුකසේ දතයුතු ඉතා දුකසේ දතයුතු මහණෙක් හෝ බමුණෙක් වන්නේ නම්, ‘මහණා දුකසේ දත යුතු ය, බමුණා දුකසේ දත යුතු ය’ යන මෙය කියන්නට යෝග්‍ය නො වන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මෙ තෙම අමුපලා කන්නේ හෝ වෙයි, බොඩහමු කන්නේ හෝ වෙයි ... ස්වයම්පතිතඵලභොජි වූයේ වනමුල් පල ආහාර කොටැත්තේ යැපේ යැ’ යි ගැහැවියකු විසිනුදු ගැහැවිපුතකු විසිනුදු යටත් පිරිසෙයින් කළදැස්සක විසිනුදු ඔහු දත හැකි වන්නේ ය. (එහෙයිනි.) කාශ්‍යපය, යම් හෙයෙකින් මේ මඳ පිළිවෙතින් අන් තන්හි ම, මේ තවකමින් අන් තන්හි ම, දුක‍සේ දත යුතු වූ ඉතා දුකසේ දත යුතු වූ මහණ තෙමේ හෝ බමුණු තෙමේ වේ ද, එහෙයින් මහණ දුකසේ දත යුතු ය, බමුණා දුකසේ දත යුතු ය යන මෙය කියන්නට යෝග්‍ය ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 374,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යතො ඛො කස්සප භික්ඛු අවෙරං අබ්යාපජ්ජං මෙත්තචිත්තං භාවෙති, ආසවානඤ්ච ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති, අයං වුච්චති කස්සප භික්ඛු සමණො ඉති’පි බ්රාහ්මණො ඉති’පි."
                    },
                    {
                        "type": "paragraph",
                        "text": "22. සාණානි චෙ’පි කස්සප ධාරෙති, මසාණානි’පි ධාරෙති -පෙ- සායතතියකම්පි උදකොරොහණානුයොගමනුයුත්තො විහරති, ඉමාය ච කස්සප මත්තාය ඉමිනා තපොපක්කමෙන සමණො වා අභවිස්ස බ්රාහ්මණො වා දුජ්ජානො සුදුජ්ජානො, නෙතං අභවිස්ස කල්ලං වචනාය ‘දුජ්ජානො සමණො දුජ්ජානො බ්රාහ්මණො’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සක්කා ච පනෙසො අභවිස්ස ඤාතුං ගහපතිනා වා ගහපතිපුත්තෙන වා අන්තමසො කුම්භදාසියාපි: ‘අයං සාණානිපි ධාරෙති මසාණානි’පි ධාරෙති -පෙ- සායතතියකම්පි උදකොරොහණානුයොගමනුයුත්තො විහරතී’ති. යස්මා ච ඛො කස්සප අඤ්ඤත්රෙව ඉමාය මත්තාය අඤ්ඤත්ර ඉමිනා තපොපක්කමෙන සමණො වා හොති බ්රාහ්මණො වා දුජ්ජානො සුදුජ්ජානො, තස්මා එතං කල්ලං වචනාය ‘දුජ්ජානො සමණො දුජ්ජානො බ්රාහ්මණො’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යතො ඛො කස්සප භික්ඛු අවෙරං අබ්යාපජ්ජං මෙත්තචිත්තං භාවෙති, ආසවානඤ්ච ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති. අයං වුච්චති කස්සප භික්ඛු සමණො ඉති’පි බ්රාහ්මණො ඉති’පීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "23. එවං වුත්තෙ අචෙලො කස්සපො භගවන්තං එතදවොච: “කතමා පන සා භො ගොතම සීලසම්පදා, කතමා චිත්තසම්පදා, කතමා පඤ්ඤාසම්පදා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ කස්සප තථාගතො ලොකෙ උප්පජ්ජති අරහං -පෙ- භගවා. සො ඉමං ලොකං -පෙ- සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදෙති. සො ධම්මං දෙසෙති -පෙ- බ්රහ්මචරියං පකාසෙති. තං ධම්මං සුනාති ගහපති වා -පෙ- සො තං ධම්මං සුත්වා තථාගතෙන සද්ධං පටිලභති. සො තෙන සද්ධාපටිලාභෙන සමන්නාගතො ඉති පටිසඤ්චික්ඛති: සම්බාධො ඝරාවාසො -පෙ- ‘යන්නූනාහං කෙසමස්සුං ඔහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජෙය්යන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, යම් කලෙක පටන් වනාහි භික්‍ෂු තෙම වෛර නැති ව්‍යාපාද නැති මෙත්සිත වඩා ද, ආස්‍රවයන්ගේ ක්‍ෂයයෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලඥානයත් මෙ අත්බව්හි ම තෙමේ විශිෂ්ටඥානයෙන් දැන පසක් කොට ලැබ වෙසේ ද, කාශ්‍යපය, මේ භික්‍ෂු තෙම මහණ යැ යි ද බමුණු යැ යි ද කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "22. කාශ්‍යපය, තවුස් තෙම ඉදින් හණවැහැරි දරා ද, හණනූල් මුසු හුයින් වියූ වස්ත්‍ර දරා ද, ... සවස තෙවෙනි කොට දියේ ගැලීමේ යෙදුණේ වෙසේ ද, කාශ්‍යපය, මේ මද පිළිවෙතිනුත් මේ තවකමිනුත් දුකසේ දතයුතු, ඉතා දුකසේ දතයුතු මහණෙක් හෝ බමුණෙක් වන්නේ නම් ‘මහණා දුකසේ දත යුතු ය, බමුණා දුකසේ දත යුතු යැ’ යන මෙය කියන්නට නො නිසි වන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘මෙ තෙම හණවැහැරි ද දරයි, මිශ්‍රක වස්ත්‍ර ද දරයි ... සවස තෙවෙනි කොට ද (ත්‍රිසන්‍ධ්‍යායෙහි ද) දියේ ගැලීමේ යෙදුණේ වෙසේ’ යැ යි ගැහැවියකු විසිනුදු ගැහැවිපුතක්හු විසිනුදු යටත් පිරිසෙයින් කළදැස්සක විසිනුදු මොහු දත හැකි ද වන්නේ ය. කාශ්‍යපය, යම් හෙයෙකින් ම මේ මඳ පිළිවෙතින් අන් තන්හි ම, මේ තවකමින් අන් තන්හි ම, දුකසේ දැන ගත යුතු ය, ඉතා දුකසේ දැන ගත යුතු මහණ තෙමේ හෝ බමුණු තෙමේ වේ ද, එහෙයින් ‘මහණා දුකසේ දැන ගත යුතු ය, බමුණා දුකසේ දැන ගත යුතු ය’ යන මෙය කියන්නට නිසි ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, යම් කලෙක පටන් භික්‍ෂු තෙම ‍ද්වේෂ නැතිවැ ව්‍යාපාද නැති වැ මෙත්සිත වඩා ද, ආස්‍රවයන්ගේ ක්‍ෂයයෙන් ආස්‍රව නැති ඵලසමාධියත් ඵලඥානයත් මේ අත්බව්හි ම තෙමේ විශිෂ්ට නුවණින් දැන පසක් කොට ලැබ වෙසේ ද, කාශ්‍යපය, මේ භික්‍ෂු තෙම ශ්‍රමණ නමුදු බ්‍රාහ්මණ නමුදු වේ යැ යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "23. මෙසේ වදාළ කල්හි අවෙලකාශ්‍යප තෙම “භවද් ගෞතමයිනි, ඒ ශිලසම්පත් කවරේ ද? ඒ චිත්තසම්පත් කවරේ ද? ඒ ප්‍රඥාසම්පත් කවරේ දැ?’’ යි මෙය භාග්‍යවතුන් වහන්සේ වෙතින් විචාළේ ය. (භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, මෙ ලොවැ අර්හත් වූ ... භාග්‍යවත් තථාගත තෙම පහළ වෙයි. හේ මේ ලෝකය ... තෙමේ ම දැන පසක් කොට පවසයි. හේ දහම් දෙසයි ... බඹසර පවසයි. ඒ දහම් ගැහැවියෙක් හෝ ... අසයි. හේ ඒ දහම් අසා තථාගත බුදුහු කෙරෙහි සැදැහැ පිළිලබයි (උපදවයි). හේ ඒ සැදැහැ ලැබීමෙන් යුත් වූයේ, ගිහිගෙය සම්බාධ ඇත්තේය ... ‘මම කෙහෙ රවුලු බා හැර කසාවත් හැඳ ගිහිගෙන් නික්මැ සසුන් වන්නෙම් නම් යෙහෙකැ’යි හේ සලකයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 376,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සො අපරෙන සමයෙන -පෙ- අනගාරියං පබ්බජති. සො එවං පබ්බජිතො සමානො පාතිමොක්ඛසංවරසංවුතො විහරති -පෙ- සමාදාය සික්ඛති සික්ඛාපදෙසු -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "24. කථඤ්ච කස්සප භික්ඛු සීලසම්පන්නො හොති? ඉධ කස්සප භික්ඛු පාණාතිපාතං පහාය පාණාතිපාතා පටිවිරතො හොති -පෙ- ඉදම්පි’ස්ස හොති සීලසම්පදාය. -පෙ- [යථා සාමඤ්ඤඵලෙ එවං විත්ථාරෙතබ්බං]"
                    },
                    {
                        "type": "paragraph",
                        "text": "යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති. සෙය්යථිදං: සන්තිකම්මං -පෙ- ඔසධීනං පටිමොක්ඛො ඉති වා ඉති එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදමස්ස හොති සීලසම්පදාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "ස ඛො සො කස්සප භික්ඛු එවං සීලසම්පන්නො න කුතොචි භයං සමනුපස්සති යදිදං සීලසංවරතො. සෙය්යථාපි කස්සප රාජා ඛත්තියො මුද්ධාවසිත්තො නිහතපච්චාමිත්තො න කුතොචි භයං සමනුපස්සති යදිදං පච්චත්ථිකතො, එවමෙව ඛො කස්සප භික්ඛු එවං සීලසම්පන්නො න කුතොචි භයං සමනුපස්සති යදිදං සීලසංවරතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "සො ඉමිනා අරියෙන සීලක්ඛන්ධෙන සමන්නාගතො, අජ්ඣත්තං අනවජ්ජසුඛං පටිසංවෙදෙති. එවං ඛො කස්සප භික්ඛු සීලසම්පන්නො හොති. අයං ඛො කස්සප සීලසම්පදා -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "25. කථඤච කස්සප භික්ඛු ඉන්ද්රියෙසු ගුත්තද්වාරො හොති? ඉධ කස්සප භික්ඛු චක්ඛුනා රූපං දිස්වා නිමිත්තග්ගාහී හොති නානුබ්යඤ්ජනග්ගාහී -පෙ- චක්ඛුන්ද්රියෙ සංවරං ආපජ්ජති. සොතෙන සද්දං සුත්වා -පෙ- ඝාණෙන ගන්ධං ඝායිත්වා -පෙ- ජිව්හාය රසං සායිත්වා -පෙ- කායෙන ඵොට්ඨබ්බං ඵුසිත්වා -පෙ- මනසා ධම්මං විඤ්ඤාය න නිමිත්තග්ගාහී හොති නානුබ්යඤ්ජනග්ගාහී -පෙ- මනින්ද්රියෙ සංවරං ආපජ්ජති. සො ඉමිනා අරියෙන ඉන්ද්රියසංවරෙන සමන්නාගතො අජ්ඣත්තං අබ්යාසෙකසුඛං පටිසංවෙදෙති. එවං ඛො කස්සප භික්ඛු ඉන්ද්රියෙසු ගුත්තද්වාරො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "26. කථඤ්ච කස්සප භික්ඛු සතිසම්පජඤ්ඤෙන සමන්නාගතො හොති? ඉධ කස්සප භික්ඛු අභික්කන්තෙ පටික්කන්තෙ සම්පජානකාරී හොති. -පෙ- ගතෙ ඨිතෙ නිසින්නෙ සුත්තෙ ජාගරිතෙ භාසිතෙ තුණ්හීභාවෙ සම්පජානකාරී හොති. එවං ඛො කස්සප භික්ඛු සතිසම්පජඤ්ඤෙන සමන්නාගතො හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "හේ මෑත කලැ ... සසුන් වදී. හේ මෙසේ පැවිදි වූයේ ම පාතිමෝක්‍ඛසංවරයෙන් සංවෘතව වෙසෙයි ... සමාදන් කොට ගෙන සිකපදන්හි හික්මෙයි",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "24. කාශ්‍යපය, කෙසේ නම් මහණ සිල්වත් වේ ද? කාශ්‍යපය, මෙහි මහණ තෙම පණිවා හැරැ පණිවායෙන් වැළැක්කේ වෙයි ... මේ ඔහුගේ ශීලසම්පත් වේ. [යට සාමඤ්ඤඵල සූත්‍රයෙහි දැක්වුණු පරිදි විස්තර කටයුතු.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "යම්සේ වනාහි ඇතැම් භවද් මහණ බමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, ශාන්තිකර්‍මය ... මුල් බෙහෙත් බැහැරැ කිරීම් යන මෙබඳු වූ තිරශ්චීනවිද්‍යායෙන් මිථ්‍යාආජීවයෙන් ජීවිකා ‍කෙරෙත් ද, මේ ආදි වූ හෝ මෙබඳු වූ තිරශ්චීනවිද්‍යායෙන් මිථ්‍යාආජීවයෙන් හේ වැළැක්කේ වේ. මේ ඔහුගේ ශීලසම්පත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කාශ්‍යපය, හේ මහණ මෙසේ සිල්වත් වූයේ, ශීලසංවරයෙන් කොයිනුදු බියක් නො දකී. මුදුනැ අබිසෙස් ලත්, නැසූ පසමිතුරන් ඇති, කැත් රජෙක් පසමිතුරකුගෙත් කොයිනුදු බියක් නො දකී ද, එසේ ම මහණ තෙම ශීලසංවරයෙන් (අසංවර නැති බැවින්) කොයිනුදු බියක් නො දකී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හේ මේ ආර්‍ය්‍යශීලස්‍කන්‍ධයෙන් සමත්විත වූයේ තමා කෙරෙහි වූ නිදොස්බව් සුවය විඳී. කාශ්‍යපය, මෙසේ මහණ සිල්වත් වෙයි. කාශ්‍යපය, මේ ඒ ශීලසම්පත් ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "25. කාශ්‍යපය, කෙසේ නම් මහණ තෙම ඉන්ද්‍රියයන්හි වැසූ දොර ඇත්තේ වේ ද? කාශ්‍යපය, මෙ සස්නැ මහණ තෙම ඇසින් රූපයක් දැක නිමිත්තග්‍රාහී නො වෙයි. අනුව්‍යඤ්ජනග්‍රාහී නො වෙයි ... චක්‍ෂුරින්‍ද්‍රියයෙහි සංවරයට පැමිණෙයි. කනින් හඬක් අසා ... නැහැයෙන් ගඳක් අසා ... දිවෙන් රසක් ආස්වාදන කොට ... කයින් ස්ප්‍රෂ්ටව්‍යයක් ස්‍පර්‍ශ කොට ... මනසින් දහමක් දැන ... නිමිත්තග්‍රාහී නො වෙයි. අනුව්‍යඤ්ජනග්‍රාහි නො වෙයි ... මනින්ද්‍රියයෙහි සංවරයට පැමිණෙයි. හේ මේ ආර්‍ය වූ ඉන්‍ද්‍රියසංවරයෙන් සමන්විත වූයේ, සිය සතන්හි නොකිලිටි අධිචිත්තසුඛය විඳී. කාශ්‍යපය, මහණ තෙම මෙසේ ඉඳුරන්හි වැසූ දොරැත්තේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "26. කාශ්‍යපය, කෙසේ නම් මහණ තෙම සතිසම්පජඤ්ඤයෙන් යුක්ත වේ ද? ඇවැත්නි, මෙහි මහණ තෙම ඉදිරියට යෑමෙහි ද පෙරළා ඊමෙහි ද නුවණින් දැන (එය) කරන සුලු වෙයි ... ගමනෙහි, සිටීමෙහි, හිඳීමෙහි, නිදීමෙහි, නිදි වැරීමෙහි, කීමෙහි, නිහඬ වීමෙහි, නුවණින් දැන (එය) කරන සුලු වෙයි. කාශ්‍යපය, මහණ තෙමේ මෙසේ සතිසම්පජඤ්ඤයෙන් සමන්විත වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 378,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "27. කතඤ්ච ආවුසො භික්ඛු සන්තුට්ඨො හොති? ඉධාවුසො භික්ඛු සන්තුට්ඨො හොති කායපාරිහාරිකෙන චීවරෙන -පෙ- කුච්ඡිපාරිහාරිකෙන පිණ්ඩපාතෙන. සො යෙන යෙනෙව පක්කමති සමාදායෙව පක්කමති. එවං ඛො ආවුසො භික්ඛු සන්තුට්ඨො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "28. සො ඉමිනා අරියෙන සීලක්ඛන්ධෙන සමන්නාගතො, ඉමිනා’ච අරියෙන ඉන්ද්රියසංවරෙන සමන්නාගතො ඉමිනා’ච අරියෙන සතිසම්පජඤ්ඤෙන සමන්නාගතො ඉමාය ච අරියාය සන්තුට්ඨියා සමන්නාගතො විවිත්තං සෙනාසනං භජති අරඤ්ඤං රුක්ඛමූලං පබ්බතං කන්දරං ගිරිගුහං සුසානං වනපත්ථං අබ්භොකාසං පලාලපුඤ්ජං. සො පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො නිසීදති පල්ලඞ්කං ආභුජිත්වා උජුං කායං පණිධාය පරිමුඛං සතිං උපට්ඨපෙත්වා."
                    },
                    {
                        "type": "paragraph",
                        "text": "29. සො ලොකෙ අභිජ්ඣං පහාය විගතාභිජ්ඣෙන චෙතසා විහරති. අභිජ්ඣාය චිත්තං පරිසොධෙති -පෙ- ප්යාපාදපදොසං පහාය අව්යාපන්නචිත්තො විහරති -පෙ- ථීනමිද්ධං පහාය විගතථීනමිද්ධො විහරති -පෙ- උද්ධච්චකුක්කුච්චං පහාය අනුද්ධතො විහරති -පෙ- විචිකිච්ඡං පහාය තිණ්ණවිචිකිච්ඡො විහරති. අකථංකථි කුසලෙසු ධම්මෙසු, විචිකිච්ඡාය චිත්තං පරිසොධෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි ආවුසො පුරිසො ඉණං ආදාය කම්මන්තෙ පයොජෙය්ය. තස්ස තෙ කම්මන්තා සමිජ්ඣෙය්යුං -පෙ- සො තතො නිදානං ලභෙථ පාමොජ්ජං, අධිගච්ඡෙය්ය සොමනස්සං. සෙය්යථාපි ආවුසො පුරිසො ආබාධිකො අස්ස දුක්ඛිතො -පෙ- සො අපරෙන සමයෙන තම්හා ආබාධා මුච්චෙය්ය -පෙ- සො තතො නිදානං ලභෙථ පාමොජ්ජං, අධිගච්ඡෙය්ය සොමනස්සං. සෙය්යථාපි ආවුසො පුරිසො බන්ධනාගාරෙ බද්ධො අස්ස, සො අපරෙන සමයෙන තම්හා බන්ධනා මුච්චෙය්ය -පෙ- සො තතො නිදානං ලභෙථ පාමොජ්ජං, අධිගච්ඡෙය්ය සොමනස්සං. සෙය්යථාපි ආවුසො පුරිසො දාසො අස්ස අනත්තාධීනො -පෙ- සො අපරෙන සමයෙන තම්හා දාසව්යා මුච්චෙය්ය -පෙ- සො තතො නිදානං ලභෙථ පාමොජ්ජං, අධිගච්ඡෙය්ය සොමනස්සං. සෙය්යථාපි ආවුසො පුරිසො සධනො සභොගො කන්තාරද්ධානමග්ගං පටිපජ්ජෙය්ය -පෙ- සො අපරෙන සමයෙන තං කන්තාරං නිත්ථරෙය්ය -පෙ- සො තතො නිදානං ලභෙථ පාමොජ්ජං, අධිගච්ඡෙය්ය සොමනස්සං. එවමෙව ඛො ආවුසො භික්ඛු යථා ඉණං යථා රොගං යථා බන්ධනාගාරං යථා දාසව්යං යථා කන්තාරද්ධානමග්ගං ඉමෙ පඤ්චනීවරණෙ අප්පහීණෙ අත්තනි සමනුපස්සති. සෙය්යථාපි ආවුසො ආනණ්යං යථා ආරොග්යං යථා බන්ධනමොක්ඛං යථා භුජිස්සං යථා ඛෙමභූමිං, එවමෙව ඛො ආවුසො භික්ඛු ඉමෙ පඤ්චනීවරණෙ පහීණෙ අත්තනි සමනුපස්සති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "27. ඇවැත්නි, කෙසේ නම් මහණ තෙම සතුටු සිතැත්තේ වේ ද? ඇවැත්නි, මෙ සස්නෙහි මහණ තෙම කායපරිහරණයට ප්‍රමාණ වූ සිවුරෙන් ද ... කුක්‍ෂිපරිහරණයට ප්‍රමාණ වූ පිණ්ඩපාතයෙන් ද සතුටු වෙයි. හේ යම් යම් තැනකට යේ ද තමා සතු අටපිරිකර පමණක් ගෙන ම යෙයි. ඇවැත්නි, මහණ තෙම මෙසේ ම සතුටු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "28. හේ මේ ශ්‍රේෂ්ඨ ශීලස්කන්‍ධයෙන් සමන්විත වුයේ, මෙ ම ඉන්‍දියසංවරයෙන් සමන්විත වූයේ, මෙම ශ්‍රේෂ්ඨ සතිසම්පජඤ්ඤයෙන් සමන්විත වූයේ, මේ ආර්‍ය්‍ය සන්තුෂ්ටියෙන් ද සමන්විත වූයේ, අරණ්‍ය වෘක්‍ෂමූල පර්‍වත කඳුරැලි ගිරිගුහා සොහොන් වනප්‍රස්ත අභ්‍යවකාශ පිදුරුරැසින් (ගිරිලෙන් පරිද්දෙන්) කළ ගුහා යන මේ ජනයාගෙන් හිස් වූ සෙනස්නක් භජනය කරයි. හේ පසුබත්හි පිණ්ඩපාතයෙන් පෙරළා ආයේ, පලක් බැඳ කය ඇද නැති සේ පිහිටුවා, සිහිය කමටහන් අරමුණට යොමු කොට තබා හිඳියි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "29. හෙ තෙම ලොව කෙරෙහි අභිධ්‍යාව දුරු කොට, අභිධ්‍යාව පහ වූ සිතින් උපලක්‍ෂිත වැ වෙසෙයි. අභිධ්‍යාව කෙරෙන් සිත පිරිසිදු කෙරෙයි ... ව්‍යාපාද දෝෂය දුරැ ලා ව්‍යාපාද රහිත සිතැත්තේ වෙසෙයි ... ස්ත්‍යානමිද්ධය දුරැ ලා පහ වූ ස්ත්‍යානමිද්ධය ඇත්තේ වෙසෙයි ... උද්‍ධච්චකුක්කුච්ච දෙක දුරැ ලා අනුද්‍ධත වැ වෙසෙයි … විචිකිත්සාව දුරැ ලා තරණය කළ විචිකිත්සා ඇත්තේ කුසල් දහම්හි සැක නැත්තේ වෙසෙයි. විචිකිත්සාව කෙරෙන් සිත පිරිසිදු කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, යම්සේ පුරුෂයෙක් ණයක් ගෙන කර්‍මාන්ත යොදන්නේ ද, ඔහුගේ ඒ කර්‍මාන්ත සමෘද්ධ වන්නේ ද ... හේ ඒ කරුණින් සතුට ලබන්නේ ද, සොම්නසට පැමිණෙන්නේ ද, ඇවැත්නි, යම්සේ පුරුෂයෙක් ගිලන් වූයේ දුඃඛිත වන්නේ ද, ... හේ මෑත කලෙක ඒ ගිලන් බැවින් මිදෙන්නේ ද, ... හේ ඒ කරුණින් සතුට ලබන්නේ ද, සොම්නසට පැමිණෙන්නේ ද, ඇවැත්නි, යම්සේ පුරුෂයෙක් දඟගෙහි බඳනා ලද්දේ වන්නේ ද, හේ මෑත කාලයෙහි ඒ බැඳුමෙන් මිදෙන්නේ ද ... හේ ඒ කරුණින් සතුට ලබන්නේ ද සොම්නසට පැමිණෙන්නේ ද, ඇවැත්නි, යම්සේ පුරුෂයෙක් තමා අයත් පැවැතුම් නැති දාසයෙක් වන්නේ ද, ... හේ මෑත කලැ ඒ දාස බැවින් මිදෙන්නේ ද ... හේ ඒ කරුණින් සතුට ලඉන්නේ ද සොම්නසට පැමිණෙන්නේ ද, ඇවැත්නි, යම්සේ ධනය ඇති භෝග ඇති පුරුෂයෙක් දික් කතරමඟකට බස්නේ ද ... හේ පසු කලැ ඒ කතර තරණය කොට එයින් නික්මැ යන්නේ ද, හේ ඒ කරුණින් සතුට ලබන්නේ ද සොම්නසට පැමිණෙන්නේ ද, ඇවැත්නි, එසේ ම මහණ තෙම ණයක් මෙන් ලෙඩක් මෙන් දඟගෙයක් මෙන් දාස බවක් මෙන් දුරු කතරමඟක් මෙන් තමා කෙරෙහි පහ නො වූ මේ නීවරණ පස දකී. ඇවැත්නි, ණය නැති බව යම්සේ ද, ආරෝග බව යම්සේ ද, බැඳුමෙන් මිදීම යම්සේ ද, නිවහල් බව යම්සේ ද, උවදුරු නැති බිම යම්සේ ද, එසේ ම මහණ තෙම මේ පඤ්ච නීවරණයන් තමා කෙරෙහි ප්‍රහීණ වූවන් දකී.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 380,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "30. තස්සිමෙ පඤ්චනීවරණෙ පහීනෙ අත්තනි සමනුපස්සතො පාමොජ්ජං ජායති. පමුදිතස්ස පීති ජායති. පීතිමනස්ස කායො පස්සම්භති. පස්සද්ධකායො සුඛං වෙදෙති. සුඛිනො චිත්තං සමාධියති. සො විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි -පෙ- පඨමං ඣානං උපසම්පජ්ජ විහරති. -පෙ- දුතියං ඣානං -පෙ- තතියං ඣානං -පෙ- චතුත්ථං ඣානං උපසම්පජ්ජ විහරති. ඉදම්පි’ස්ස හොති චිත්තසම්පදාය. අයං ඛො සා කස්සප චිත්තසම්පදා."
                    },
                    {
                        "type": "paragraph",
                        "text": "31. සො එවං සමාහිතෙ චිත්තෙ -පෙ- ඤාණදස්සනාය චිත්තං අභිනීහරති අභිනින්නාමෙති -පෙ- ඉදම්පිස්ස හොති පඤ්ඤාසම්පදාය. -පෙ- නාපරං ඉත්ථත්තායාති පජානාති. ඉදම්පි’ස්ස හොති පඤ්ඤාසම්පදාය. අයං ඛො සා කස්සප පඤ්ඤාසම්පදා."
                    },
                    {
                        "type": "paragraph",
                        "text": "32. ඉමාය ච කස්සප සීලසම්පදාය ඉමාය ච චිත්තසම්පදාය ඉමාය ච පඤ්ඤාසම්පදාය අඤ්ඤා සීලසම්පදා චිත්තසම්පදා පඤ්ඤාසම්පදා උත්තරිතරා වා පණීතතරා වා නත්ථි."
                    },
                    {
                        "type": "paragraph",
                        "text": "33. සන්ති කස්සප එකෙ සමණබ්රාහ්මණා සීලවාදා. තෙ අනෙකපරියායෙන සීලස්ස වණ්ණං භාසන්ති. යාවතා කස්සප අරියං පරමං සීලං, නාහං තත්ථ අත්තනො සමසමං සමනුපස්සාමි. කුතො භිෙය්යා? අථ ඛො අහමෙව තත්ථ භිෙය්යා යදිදං අධිසීලං."
                    },
                    {
                        "type": "paragraph",
                        "text": "34. සන්ති කස්සප එකෙ සමණබ්රාහ්මණා තපොජිගුච්ඡාවාදා. තෙ අනෙකපරියායෙන තපොජිගුච්ඡාය වණ්ණං භාසන්ති. යාවතා කස්සප අරියා පරමා තපොජිගුච්ඡා, නාහං තත්ථ අත්තනො සමසමං සමනුපස්සාමි. කුතො භිෙය්යා? අථ ඛො අහමෙව තත්ථ භිෙය්යා යදිදං අධිජෙගුච්ඡං."
                    },
                    {
                        "type": "paragraph",
                        "text": "35. සන්ති කස්සප එකෙ සමණබ්රාහ්මණා පඤ්ඤාවාදා. තෙ අනෙකපරියායෙන පඤ්ඤාය වණ්ණං භාසන්ති. යාවතා කස්සප අරියා පරමා පඤ්ඤා, නාහං තත්ථ අත්තනො සමසමං සමනුපස්සාමි. කුතො භිෙය්යා? අථ ඛො අහමෙව තත්ථ භිෙය්යා යදිදං අධිපඤ්ඤා."
                    },
                    {
                        "type": "paragraph",
                        "text": "36. සන්ති කස්සප එකෙ සමණබ්රාහ්මණා විමුත්තිවාදා. තෙ අනෙකපරියායෙන විමුත්තියා වණ්ණං භාසන්ති. යාවතා කස්සප අරියා පරමා විමුත්ති, නාහං තත්ථ අත්තනො සමසමං සමනුපස්සාමි, කුතො භිෙය්යා? අථ ඛො අහමෙව තත්ථ භිෙය්යා යදිදං අධිවිමුත්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "30. මේ පඤ්ච නීවරණයන් තමා කෙරෙහි ප්‍රහීණ වූවන් දක්නා ඔහුට සතුට උපදී. සතුටු වූවහුට ප්‍රීතිය උපදී. සිතැ ප්‍රීතිය ඇත්තහුගේ කය සංහි‍‍ඳෙයි. සංහුන් කයැත්තේ සුව විඳී. සුවැත්තහුගේ සිත සමාධිගත වෙයි. හේ කාමයන් කෙරෙන් වෙන් ව ම, අකුසල් දහමුන් කෙරෙන් වෙන් ව ම ... පළමු දහන් ලැබ වෙසෙයි ... දෙවෙනි දහන් ලැබ වෙසෙයි ... තෙවෙනි දහන් ලැබ වෙසෙයි ... සිවුවන දහන් ලැබ වෙසෙයි. මේ ඔහුගේ චිත්තසම්පත් ය. කාශ්‍යපය, මේ ඒ චිත්තසම්පත්තිය යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "31. හෙතෙම මෙසේ සිත සමාධිගත කල්හි ... දර්‍ශනඥාන‍ය පිණිස සිත එළවා තබයි, නැඹුරු කෙරෙයි ... මේ ඔහුගේ ප්‍රඥාසම්පත් වේ ... ‘මේ රහත්බව් පිණිස කටයුතු වූ අනෙකෙක් නැතැ’යි දැන ගනී. මේ ද ඔහුගේ ප්‍රඥාසම්පත් වේ. කාශ්‍යපය, මේ ඒ ප්‍රඥාසම්පත්තිය යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "32. කාශ්‍යපය, මේ ශීලසම්පත්තියට, මේ චිත්තසම්පත්තියට, මේ ප්‍රඥාසම්පත්තියට වඩා උත්තරිතර වූ ප්‍රණීතතර වූ අන් සීලසම්පතෙක්, චිත්තසම්පතෙක්, ප්‍රඥාසම්පතෙක් නැත.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "33. කාශ්‍යපය, ශීලවාදි වූ ඇතැම් මහණබමුණු කෙනෙක් ඇත. ඔහු නොයෙක් කරුණින් ශීලයේ ගුණ කියත්. කාශ්‍යපය, යම් පමණ ආර්‍ය වූ (නොකිලිටි) උතුම් ශීලයෙක් ඇද්ද, එහි තමාට සමසම වූ (මගේ ශීලයට සම ශීලයෙන් මා හා සම වූ) කිසිවකු මම් නො දකිමි. වැඩිතරම් එකකු කොයින් දකිම් ද? වැලි මම් ම යම් උතුම් ශීලයෙක් වේ නම් එහි හැමට වැඩි තරම් (උතුම්) වෙමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "34. කාශ්‍යපය, තපොජුගුප්සාවාදී වූ ඇතැම් මහණබමුණු කෙනෙක් ඇත. ඔහු නොයෙක් කරුණින් තපොජුගුප්සාවේ (කෙලෙසුන් තවන කෙලෙස්නට පිළිකුල් කරන වීර්‍යයේ) ගුණ කියත්. කාශ්‍යපය, යම් පමණ ආර්‍ය වූ පරම තපොජුගුප්සාවෙක් වේ ද, එහි මම් තමාට සමසමයකු නො දකිමි. වැඩිතරම් එකකු කොයින් දකිම් ද? වැලිදු යම් අධිජුගුප්සාවෙක් (මාර්‍ගඵලසම්ප්‍රයුක්ත වීර්‍යයෙක්) වේ නම් එහි මම ම හැමව වැඩිතරම් වෙමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "35. කාශ්‍යපය, ප්‍රඥාවාදී වූ ඇතැම් මහණබමුණු කෙනෙක් ඇත. ඔහු නොයෙක් කරුණින් ප්‍රඥාවේ ගුණ කියත්. කාශ්‍යපය, යම් පමණ ආර්‍ය වූ පරම ප්‍රඥාවෙක් වේ ද, එහි මම තමාට සමසමයකු නො දකිමි. වැඩිතරම් එකකු කොයින් දකිම් ද? වැලි දු යම් අධිප්‍රඥාවෙක් (මාර්‍ගඵලසම්ප්‍රයුක්ත ප්‍රඥාවෙක්) වේ ද, මම ම එහි හැමට වැඩිතරම් වෙමි. ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "36. කාශ්‍යපය, විමුක්තිවාදී වූ ඇතැම් මහණබමුණු කෙනෙක් ඇත. ඔහු නොයෙක් කරුණින් විමුක්තියේ ගුණ කියත්. කාශ්‍යපය, යම් පමණ ආර්‍ය වූ පරම විමුක්තියෙක් වේද, එහි මම් තමාට සමසමයකු නො දකිමි. වැඩිතරම් එකකු කොයින් දකිම් ද? වැලි දු යම් අධිවිමුක්තියෙක් (සමුච්‍ඡෙද, ප්‍රතිප්‍රශ්‍රබ්ධි, නිංසරණ යන ත්‍රිවිධ පරම විමුක්තියෙක්) වේ ද එහි මම ම හැමට වැඩිතරම් වෙමි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 382,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "37. ඨානං ඛො පනෙතං කස්සප විජ්ජති යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං: “සීහනාදං ඛො සමණො ගොතමො නදති. තඤ්ච ඛො සුඤ්ඤාගාරෙ නදති නො පරිසාසූ”ති. තෙ ‘මා හෙවන්ති’ස්සු වචනීයා. “සීහනාදඤ්ච සමණො ගොතමො නදති, පරිසාසු ච නදතී”ති එවමස්සු කස්සප වචනීයා."
                    },
                    {
                        "type": "paragraph",
                        "text": "38. ඨානං ඛො පනෙතං කස්සප විජ්ජති යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං: “සීහනාදඤ්ච සමණො ගොතමො නදති, පරිසාසු ච නදති. නො ච ඛො විසාරදො නදතී”ති. තෙ ‘මා හෙවන්ති’ස්සු වචනීයා. “සීහනාදඤ්ච සමණො ගොතමො නදති, පරිසාසු ච නදති, විසාරදො ච නදතී”ති. එවමස්සු කස්සප වචනීයා."
                    },
                    {
                        "type": "paragraph",
                        "text": "39. ඨානං ඛො පනෙතං කස්සප විජ්ජති යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං: “සීහනාදඤ්ච සමණො ගොතමො නදති, පරිසාසු ච නදති, විසාරදො ච නදති, නො ච ඛො නං පඤ්හං පුච්ඡන්තී”ති. තෙ ‘මා හෙවන්ති’ස්සු වචනීයා “සීහනාදං ච සමනො ගොතමො නදති. පරිසාසු ච නදති, විසාරදො ච නදති, පඤ්හඤ්ච නං පුච්ඡන්තී”ති. එවමස්සු කස්සප වචනීයා."
                    },
                    {
                        "type": "paragraph",
                        "text": "40. ඨානං ඛො පනෙතං කස්සප විජ්ජති යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං: “සීහනාදඤ්ච සමණො ගොතමො නදති, පරිසාසු ච නදති, විසාරදො ච නදති, පඤ්හං ච නං පුච්ඡන්ති, නො ච ඛො තෙසං පඤ්හං පුට්ඨො බ්යාකරොතී”ති. තෙ ‘මා හෙවන්ති’ස්සු වචනීයා. “සීහනාදඤ්ච සමණො ගොතමො නදති. පරිසාසු ච නදති, විසාරදො ච නදති, පඤ්හං ච නං පුච්ඡන්ති. පඤ්හඤ්ච නෙසං පුට්ඨො බ්යාකරොතී”ති. එවමස්සු කස්සප වචනීයා."
                    },
                    {
                        "type": "paragraph",
                        "text": "41. ඨානං ඛො පනෙතං කස්සප විජ්ජති යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං: “සීහනාදඤ්ච සමණො ගොතමො නදති, පරිසාසු ච නදති -පෙ- පඤහඤ්ච නෙසං පුට්ඨො බ්යාකරොති, නො ච ඛො පඤ්හස්ස වෙය්යාකරණෙන චිත්තං ආරාධෙතී”ති. තෙ ‘මා හෙවන්ති’ස්සු වචනීයා. “සීහනාදං ච සමණො ගොතමො නදති, -පෙ- පඤ්හස්ස වෙය්යාකරණෙන චිත්තං ආරාධෙතී”ති. එවමස්සු කස්සප වචනීයා."
                    },
                    {
                        "type": "paragraph",
                        "text": "42. ඨානං ඛො පනෙතං කස්සප විජ්ජති යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං: “සීහනාදඤ්ච සමණො ගොතමො නදති, පරිසාසු ච නදති -පෙ- වෙය්යාකරණෙන චිත්තං ආරාධෙති, නො ච ඛො සොතබ්බං මඤ්ඤන්තී”ති. තෙ ‘මා හෙවන්ති’ස්සු වචනීයා: “සීහනාදඤ්ච සමණො ගොතමො නදති -පෙ- පඤ්හස්ස ච වෙය්යාකරණෙන චිත්තං ආරාධෙති. සොතබ්බඤ්චස්ස මඤ්ඤන්තී”ති. එවමස්සු කස්සප වචනීයා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "37. කාශ්‍යපය, “මහණ ගොයුම් වනාහි සිහනද ද කෙරෙයි. එ ද වනාහි පිරිස්හි නො ව ශූන්‍යාගාරයෙක (හිස් ගෙයෙක හුදෙකලා වැ හිඳ) කෙරේ යැ” යි අන් තොටු පිරිවැජ්ජෝ මෙසේ කියන්නාහ” යන යමෙක් ඇද්ද, ඒ කාරණය විද්‍යාමාන ම ය. “එසේ නො කියැ යුතු යැ”යි ඔහු කියැ යුතු වන්නාහ. “මහණ ගොයුම් සිංහනාද ද කෙරෙයි. එ ද පිරිස්හි කෙරේ” යැ යි කාශ්‍යපය, ඔහු මෙසේ කියැ යුතු වන්නාහ. (ඔවුනට මෙසේ කියැ යුතු).",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "38. කාශ්‍යපය, “මහණ ගොයුම් සිංහනාද ද කෙරෙයි. එ ද පිරිස්හි කෙරෙයි. එහෙත් විශාරද ව නො කෙරේ” යැ යි අන්තොටු පිරිවැජ්ජෝ මෙසේ කියන්නාහ” යන මේ කාරණය විද්‍යාමාන ම ය. “එසේ නො කියැ යුතු” යැ යි ඔහු කියැ යුතු වන්නාහ. “මහණ ගොයුම් සිංහනාදත් කෙරේ. එ ද පිරිස්හි කෙරේ. විශාරද ව ද කෙරේ” යැ යි, කාශ්‍යපය, ඔහු මෙසේ කියැ යුතු වන්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "39. කාශ්‍යපය, “මහණ ගොයුම් සිංහනාද ද කෙරෙයි. එ ද පිරිස්හි කෙරෙයි. විශාරද ව ද කෙරෙයි. එහෙත් අන්හු ඔහු පැණ නො විචාරති”යි මෙසේ අන්තොටු පිරිවැජියෝ කියන්නාහ” යන යමෙක් ඇද්ද, මේ කාරණය විද්‍යාමානම ය. ඔහු “එසේ නොකියැ යුතු” යැ යි කියැ යුතු වන්නාහ. මහණ ගොයුම් සිංහනාද ද කෙරෙයි. පිරිස්හි ද එය කෙරෙයි. විශාරද ව ද කෙරෙයි. ප්‍රශ්න ද (ඔබෙන්) විචාරත් යැ යි මෙසේ ඔහු කියැ යුතු වන්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "40. කාශ්‍යපය, “මහණ ගොයුම් සිංහනාද ද කෙරෙයි. එය පිරිස්හි ද කෙරෙයි. විශාරද ව ද කෙරෙයි. ප්‍රශ්න ද ඔහු විචාරත්. එහෙත් ඔවුන්ගේ ප්‍රශ්න විචාරන ලද්දේ නො විසඳා යැ යි අන්තොටු පිරිවැජියෝ මෙසේ කියන්නාහ” යන යමෙක් ඇද්ද, ඒ කාරණය විද්‍යාමාන ම ය. “එසේ නො කියැ” යුතු යැ යි ඔහු කියැ යුතු වන්නාහ. “මහණ ගොයුම් සිංහනාද ද කෙරෙයි. එය පිරිස්හි ද කෙරෙයි. විශාරද ව ද කෙරෙයි. ප්‍රශ්න ද ඔහු විචාරත්. ඔහු විසින් පැණ විචාරන ලද්දේ විසඳා” යැ යි කාශ්‍යපය, මෙසේ ඔහු කියැ යුතු වන්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "41. කාශ්‍යපය, “මහණ ගොයුම් සිංහනාද ද කෙරෙයි. එය පිරිස්හි ද කෙරෙයි ... ප්‍රශ්න ද ඔවුන් විසින් විචාරන ලදුයේ විසඳයි. එහෙත් පැණ විසැඳීමෙන් ඔවුන් සිත් නො ම ගනී යැයි මෙසේ අන්තොටු පිරිවැජියෝ කියන්නාහු ය” යන යමෙක් ඇද්ද, මේ කරුණ විද්‍යාමාන ය, “එසේ නො කියැ යුතු” යැ යි ඔහු කියැ යුතු වන්නාහ. “මහණ ගොයුම් සිංහනාද ද කෙරෙයි ... පැණ ද විසැඳීමෙන් ඔවුන් සිත් ගනී” යැ යි කාශ්‍යපය, මෙසේ කියැ යුතු වන්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "42. කාශ්‍යපය, “මහණ ගොයුම් සිංහනාද ද කෙරෙයි. එ ද පිරිස්හි කෙරෙයි. එ ද පිරිස්හි කෙරෙයි ... පැණ විසැඳීමෙන් ඔවුන්ගේ සිත් ද ගනී. එහෙත් අන්හු ඔහු බස් ඇසිය යුතු කොට නො සිතත්” යැ යි මෙසේ අන්තොටු පිරිවැජියෝ කියන්නාහ” යන යමෙක් ඇද්ද, මේ කරුණ විද්‍යාමාන ය. “එසේ නො කියැ යුතු” යැ යි ඔහු කියැ යුතු වන්නාහ. “මහණ ගොයුම් සිංහනාද ද කෙරෙයි ... පැණ විසඳීමෙන් සිත් ද ගනී. ඔහු බස් ඇසිය යුතු කොට අන්හු ද සිතත්” යැ යි මෙසේ ඔහු කියැ යුතු වන්නාහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 384,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "43. ඨානං ඛො පනෙතං කස්සප විජ්ජති යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං: “සීහනාදඤ්ච සමණො ගොතමො නදති, පරිසාසු ච නදති -පෙ- සොත්තබ්බඤ්චස්ස මඤ්ඤන්ති. නො ච ඛො සුත්වා චස්ස පසීදන්තී”ති. තෙ ‘මා හෙවන්ති’ස්සු වචනීයා. “සීහනාදඤ්ච සමණො ගොතමො නදති -පෙ- සොතබ්බඤ්චස්ස මඤ්ඤන්ති. සුත්වා චස්ස පසීදන්තී”ති. එවමස්සු කස්සප වචනීයා."
                    },
                    {
                        "type": "paragraph",
                        "text": "44. ඨානං ඛො පනෙතං කස්සප විජ්ජති යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං: “සීහනාදඤ්ච සමණො ගොතමො නදති, පරිසාසු ච නදති -පෙ- සුත්වා චස්ස පසීදන්ති, නො ච ඛො පසන්නා පසන්නාකාරං කරොන්තී”ති. තෙ ‘මා හෙවන්ති’ස්සු වචනීයා. “සීහනාදං ච සමණො ගොතමො නදති -පෙ- සුත්වා චස්ස පසීදති, පසන්නා ච පසන්නාකාරං කරොන්තී”ති. එවමස්සු කස්සප වචනීයා."
                    },
                    {
                        "type": "paragraph",
                        "text": "45. ඨානං ඛො පනෙතං කස්සප විජ්ජති යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං: “සීහනාදඤ්ච සමණො ගොතමො නදති, පරිසාසු ච නදති -පෙ- පසන්නා ච පසන්නකාරං කරොති නො ච ඛො තථත්තාය පටිපජ්ජන්තී”ති. තෙ ‘මා හෙවන්ති’ස්සු වචනීයා. “සීහනාදං ච සමණො ගොතමො නදති -පෙ- පසන්නා ච පසන්නාකාරං කරොන්තී”ති. තථත්තාය ච පටිපජ්ජන්තී”ති එවමස්සු කස්සප වචනීයා."
                    },
                    {
                        "type": "paragraph",
                        "text": "46. ඨානං ඛො පනෙතං කස්සප විජ්ජති යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං: “සීහනාදඤ්ච සමණො ගොතමො නදති -පෙ- තථත්තාය ච පටිපජ්ජතන්ති, නො ච ඛො පටිපන්නා ආරාධෙන්තී”ති. තෙ ‘මා හෙවන්ති’ස්සු වචනීයා. “සීහනාදඤ්ච සමණො ගොතමො නදති පරිසාසු ච නදති, විසාරදො ච නදති, පඤ්හඤ්ච නා පුච්ඡන්ති, පඤ්හඤ්ච නෙසං පුට්ඨො බ්යාකරොති, පඤ්හස්ස ච වෙය්යාකරණෙන චිත්තං ආරාධෙති, සොතබ්බඤ්චස්ස මඤ්ඤන්ති, සුත්වා චස්ස පසීදන්ති, පසන්නා ච පසන්නාකාරං කරොන්ති, තථත්තාය ච පටිපජ්ජන්ති පටිපන්නා ච ආරාධෙන්තී”ති. එවමස්සු කස්සප වචනීයා."
                    },
                    {
                        "type": "paragraph",
                        "text": "47. එකමිදාහං කස්සප සමයං රාජගහෙ විහරාමි ගිජ්ඣකූටෙ පබ්බතෙ. තත්ර මං අඤ්ඤතරො තපබ්රහ්මචාරී නිග්රොධො නාම අධිජෙගුච්ඡෙ පඤ්හං පුච්ඡි. තස්සාහං අධිජෙගුච්ඡෙ පඤ්හං පුට්ඨො බ්යාකාසිං. බ්යාකතො ච පන මෙ අත්තමනො අහොසි පරං විය මත්තායාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "43. කාශ්‍යපය, “මහණ ගොයුම් සිංහනාද ද කෙරෙයි. පිරිස්හි ද නද ‍දෙයි ... ඔහු බස් ඇසියැ යුතු කොට අන්හු ද සිතත්. එහෙත් ඔහු බස් අසා අන්හු නො පහදිත්” යැ යි අන්තොටු පිරිවැජියෝ මෙසේ කියන්නාහ, යන යමෙක් ඇද්ද, මේ කාරණය විද්‍යාමාන ය. “එසේ නො කියැ යුතු” යැ යි ඔහු කියැ යුතු වන්නාහ. මහණ ගොයුම් සිංහනාද ද කෙරෙයි ... අන්හු ද ඔහු බස් ඇසියැ යුතු කොට සිතත්. ඔහු බස් අසා ද පහදිති”යි. කාශ්‍යපය, මෙසේ ඔහු කියැ යුතු වන්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "44. කාශ්‍යපය, “මහණ ගොයුම් සිංහනාද ද කෙරෙයි. පිරිස්හි ද නද දෙ යි ... ඔහු බස් අසා ද පහදිත්. එහෙත් පැහැදුණෝ පැහැදුණු අයුරක් නො කෙරෙත් යැ යි මෙසේ අන්තොටු පිරිවැජියෝ කියන්නාහ” යන යමෙක් ඇද්ද, මේ කාරණය විද්‍යාමාන ය. “එසේ නො කියැ යුතු” යැ යි ඔහු කියැ යුතු වන්නාහ. “මහණ ගොයුම් සිංහනාද ද කෙරෙයි ... ඔහු බස් අසා ද පහදිත්. පැහැදුණාහු ද පැහැදුණු අයුරක් කෙරෙත් යැ” යි කාශ්‍යපය, ඔහු මෙසේ කියැ යුතු වන්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "45. කාශ්‍යපය, “මහණ ගොයුම් සිංහනාද ද කෙරෙයි. පිරිස්හි ද නාද කෙරෙයි ... පැහැදුණාහු ද පැහැදුණු අයුරක් කෙරෙත්. එහෙත් තථා භාවය පිණිස (ධර්‍මානුධර්‍මප්‍රතිපත්ති පුරනු පිණිස) නො ම පිළිපදිත් යැ යි අන්තොටු පිරිවැජියෝ මෙසේ කියන්නාහු” යන යමෙක් ඇද්ද මේ කාරණය විද්‍යාමාන ය. “එසේ ‍නො කියැ යුතු” යැ යි ඔහු කියැ යුතු වන්නාහ. “මහණ ගොයුම් සිංහනාද ද කෙරෙයි ... පැහැදුණෝ ද පැහැදුණු අයුරක් කෙරෙත්. ධර්‍මානුධර්‍මප්‍රතිපත්ති පුරනු පිණිස ද පිළිපදිතැ” යි කාශ්‍යපය, ඔහු මෙසේ කියැ යුතු වන්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "46. කාශ්‍යපය, “මහණ ගොයුම් සිංහනාද කෙරෙයි ... ධර්‍මානුධර්‍මප්‍රතිපත්ති පුරනු පිණිස ද පිළිපදිත්. එසේ පිළිපන්නෝ ද (එයින් ඒ ගොයුම්හුගේ) සිත් නො ගනිත්” යැ යි මෙසේ අන්තොටු පිරිවැජියෝ කියන්නාහ” යන යමෙක් ඇද්ද, කාශ්‍යපය, මේ කාරණය විද්‍යාමාන ය. “එසේ නො කියැ යුතු” යැ යි ඔහු කියැ යුතු වන්නාහ. “මහණ ගොයුම් සිංහනාද ද කෙරෙයි. පිරිස්හි ද නාද කෙරෙයි. විශාරද ව ද නාද කෙරෙයි. අන්හු ප්‍රශ්න ද ඔහු පුළුවුසිත්. ඔවුන් විසින් පුළුවුස්නා ලද්දේ ප්‍රශ්න ද විසැඳීමෙත් ඔවුන් සිත් ගනී. ඔහු ද ඒ මහණ ගොයුම් බස් ඇසිය යුතු කොට ද සිතත්, ඔහු බස් අසා ද පහදිත්. පැහැදුණාහු ද පැහැදුණු අයුරක් කෙරෙත්. තථාත්‍වය පිණිස (ධර්‍මානුධර්‍ම ප්‍රතිපත්ති පුරනු පිණිස) ද පිළිපදිත්. (එසේ) පිළිපන්නාහු ද ඒ මහණ ගොයුම්හු සිත් ගනිත් යැ” යි කාශ්‍යපය, ඔහු මෙසේ කියැ යුතු වන්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "47. කාශ්‍යපය, මම් එක් සමයෙක රජගහ නුවරැ ගිජුකුළු පව්වෙහි වෙසෙමි. එ සමයෙහි න්‍යග්‍රොධ නම් එක්තරා තපොබ්‍රහ්මචාරී (උතුම් තපස් කරන) පිරිවැජියෙක් අධිජුගුප්සායෙහි පැණයක් මා විචාළේ ය. අධිජුගුප්සායෙහි පැණ විචාරන ලද මම් ඔහුට එය විසඳා කීයෙමි. මා විසින් එසේ විසදන ලද කල්හි හේ ඉතා මහත් සේ සතුටු විය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 386,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "48. “කො හි භන්තෙ භගවතො ධම්මං සුත්වා න අත්තමනො අස්ස පරං විය මත්තාය? අහම්පි භන්තෙ භගවතො ධම්මං සුත්වා අත්තමනො පරං විය මත්තාය. අභික්කන්තං භන්තෙ, අභික්කන්තං භන්තෙ. සෙය්යථාපි භන්තෙ නික්කුජ්ජිතං වා උක්කුජ්ජෙය්ය, පටිච්ඡන්නං වා විවරෙය්ය, මූළ්හස්ස වා මග්ගං ආචික්ඛෙය්ය, අන්ධකාරෙ වා තෙලපජ්ජොතං ධාරෙය්ය චක්ඛුමන්තො රූපානි දක්ඛන්තීති, එවමෙව භගවතා අනෙකපරියායෙන ධම්මො පකාසිතො. එසාහං භන්තෙ භගවන්තං සරණං ගච්ඡාමි ධම්මඤ්ච භික්ඛුසඞ්ඝඤ්ච. ලභෙය්යාහං භන්තෙ භගවතො සන්තිකෙ පබ්බජ්ජං, ලභෙය්යං උපසම්පදන්ති”."
                    },
                    {
                        "type": "paragraph",
                        "text": "49. “යො ඛො කස්සප අඤ්ඤතිත්ථියපුබ්බො ඉමස්මිං ධම්මවිනයෙ ආකඞ්ඛති පබ්බජ්ජං, ආකඞ්ඛති උපසම්පදං, සො චත්තාරො මාසෙ පරිවසති. චතුන්නං මාසානං අච්චයෙන ආරද්ධචිත්තා භික්ඛූ තං පබ්බාජෙන්ති, උපසම්පාදෙන්ති භික්ඛුභාවාය. අපි ච මෙත්ථ පුග්ගලවෙමත්තතා විදිතා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "50. “සචෙ භන්තෙ අඤ්ඤතිත්ථියපුබ්බා ඉමස්මිං ධම්මවිනයෙ ආකඞ්ඛන්තා පබ්බජ්ජං, ආකඞ්ඛන්තා උපසම්පදං චත්තාරො මාසෙ පරිවසන්ති, චතුන්නං මාසානං අච්චයෙන ආරද්ධචිත්තා භික්ඛූ තං පබ්බාජෙන්ති, උපසම්පාදෙන්ති භික්ඛුභාවාය. අහං චත්තාරි වස්සානි පරිවසිස්සාමි. චතුන්නං වස්සානං අච්චයෙන ආරද්ධචිත්තා භික්ඛූ පබ්බාජෙන්තු, උපසම්පාදෙන්තු භික්ඛුභාවායා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "51. අලත්ථ ඛො අචෙලො කස්සපො භගවතො සන්තිකෙ පබ්බජ්ජං අලත්ථුසම්පදං. අචිරූපසම්පන්නො ඛො පනායස්මා කස්සපො එකො වූපකට්ඨො අප්පමත්තො ආතාපී පහිතත්තො විහරන්තො, න චිරස්සෙව යස්සත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජන්ති, තදනුත්තරං බ්රහ්මචරියපරියොසානං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහාසි. “ඛීණා ජාති. වුසිතං බ්රහ්මචරියං. කතං කරණීයං. නාපරං ඉත්ථත්තායා”ති අබ්භඤ්ඤාසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අඤ්ඤතරො ච ඛො පනායස්මා කස්සපො අරහතං අහොසීති."
                    },
                    {
                        "type": "centered",
                        "text": "සීහනාදසුත්තං නිට්ඨිතං අට්ඨමං.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "48. (එවිට අචෙලකාශ්‍යප මෙය කී ය:) “වහන්ස, කවරෙක් නම් භාග්‍යවතුන් වහන්සේගේ දහම් අසා ඉතා මහත් සේ සතුටු නො වන්නේ ද, වහන්ස, දේශනාව අභිකාන්තය. වහන්ස, යම්සේ යටිකුරු කොට තැබූවක් උඩුකුරු කරන්නේ ද, පිළිසන් දැයක් හෝ විවෘත කරන්නේ ද, මංමුළා වූවකුට මඟ කියන්නේ ද, ඇස් ඇතියෝ රූප දක්නාහ යි අඳුරෙහි තෙල් පහනක් දරන්නේ ද, එ පරිද්දෙන් ම භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් කරුණින් දහම් පැවසිණ. වහන්ස, ඒ මම් භාග්‍යවතුන් වහන්සේ ද ධර්‍මය ද භික්‍ෂුසඞ්ඝයා ද සරණ යෙමි. වහන්ස, මම භාග්‍යවතුන් වහන්සේගේ සමීපයෙහි පැවිද්ද ලබම් වා. උපසපුව ලබම් වා”.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "49. “කාශ්‍යපය, පෙරැ අන්තොටු වූ යමෙක් මෙ සස්නෙහි පැවිද්ද කැමැත්තේ නම්, උපසපුව කැමැත්තේ නම්, හේ සිවු මසක් පිරිවෙස් වසයි. සිවු මස ඇවෑමෙන් ආරාධිත සිතැති භික්‍ෂූහු ඔහු පැවිදි කෙරෙත්. භික්‍ෂුභාවය පිණිස උපසපන් කෙරෙත්. එහෙත් මෙහි මා විසින් පුද්ගලනානාත්‍වය දන්නා ලදැ” යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "50. එවිට පිරිවැජි තෙම “වහන්ස, ඉදින් පෙර අන්තොටු වූවෝ මෙ සස්නැ පැවිද්ද කැමැති වන්නාහු උපසපුව කැමැති වන්නාහු සිවු මසක් පිරිවෙස් වසත් නම්, සිවු මස ඇවෑමෙන් ආරාධිත සිත් ඇති භික්‍ෂූහු ඔහු පැවිදි කෙරෙත් නම්, භික්‍ෂු බව පිණිස උපසපන් කෙරෙත් නම්, මම් සිවු වසක් පිරිවෙස් වසන්නෙමි. සිවු වස ඇවෑමෙන් සතුටු වූ සිතැති භික්ෂූහු මා පැවිදි කෙරෙත් වා. භික්‍ෂුභාවය පිණිස මා උපසපන් කෙරෙත් වා” යි කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "51. අචෙලකාශ්‍යප තෙම භාග්‍යවතුන් වහන්සේ වෙතැ පැවිද්ද ලදුයේ ම ය, උපසපුව ද ලදුයේ ම ය. ආයුෂ්මත් කාශ්‍යප තෙමේ උපසපන් වූ නොබෝ කල් ඇතියේ ම හුදෙකලා වූයේ, විවික්ත වූයේ, නොපමා වූයේ, කෙලෙස් තවන වැර ඇතියේ, නිවන් කරා මෙහෙයූ සිතැති ව වසනුයේ, යමක් සඳහා කුලපුත්‍රෙයෝ මොනොවට ම ගිහිගෙන් නික්මැ සසුන් වදිත්, ඒ නිරුත්තර වූ මාර්‍ගබ්‍රහ්මචර්‍ය්‍යාවසානය (රහත් පලය) නොබෝ කලෙකින් ම මෙ අත්බව්හි ම තෙමේ විශිෂ්ට ඥානයෙන් දැන, පසක් කොට, පැමිණ (ලැබ) විසී ය. (එසේ වසනුයේ) “භවොත්පත්තීය ක්‍ෂීණ විය, මඟබඹසර වැසැ නිමැවිණ, එය සඳහා කටයුතු දෑ කරන ලද, මෙ රහත්බව් පිණිස තවත් කටයුතු දැයෙක් නැතැ”යි (පස්විකුම් නුවණින්) දැනැ ගත්තේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආයුෂ්මත් කාශ්‍යපයෝ රහතුන් අතුරෙහි එක්තරා කෙනෙක් වූහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "අට වන සිංහනාදසූත්‍රය නිමියේ ය.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ]
}