{
    "filename": "dn-1-12",
    "pages": [
        {
            "pageNum": 540,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "12",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "ලොහිච්චසුත්තං",
                        "level": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "1. එවං මෙ සුතං. එකං සමයං භගවා **කොසලෙසු** චාරිකං චරමානො මහතා භික්ඛුසඞ්ඝෙන සද්ධිං පඤ්චමත්තෙහි භික්ඛුසතෙහි යෙන **සාලවතිකා** තදවසරි. තෙන ඛො පන සමයෙන **ලොහිච්චො** බ්රාහ්මණො සාලවතිකං අජ්ඣාවසති සත්තුස්සදං සතිණකට්ඨොදකං සධඤ්ඤං රාජභොග්ගං රඤ්ඤා පසෙනදිනා කොසලෙන දින්නං රාජදායං බ්රහ්මදෙය්යං."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. තෙන ඛො පන සමයෙන ලොහිච්චස්ස බ්රාහ්මණස්ස එවරූපං පාපකං දිට්ඨිගතං උප්පන්නං හොති: ඉධ සමණො වා බ්රාහ්මණො වා කුසලං ධම්මං අධිගච්ඡෙය්ය, කුසලං ධම්මං අධිගන්ත්වා න පරස්ස ආරොචෙය්ය. කිං හි පරො පරස්ස කරිස්සති? සෙය්යථාපි නාම පුරාණං බන්ධනං ඡින්දිත්වා අඤ්ඤං නවං බන්ධනං කරෙය්ය? එවං සම්පදමිදං පාපකං ලොභධම්මං වදාමි. කිං හි පරො පරස්ස කරිස්සතී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. අස්සොසි ඛො ලොහිච්චො බ්රාහ්මණො: සමණො ඛලු භො ගොතමො සක්යපුත්තො සක්යකුලා පබ්බජිතො කොසලෙසු චාරිකං චරමානො මහතා භික්ඛුසඞ්ඝෙන සද්ධිං පඤ්චමත්තෙහි භික්ඛුසතෙහි සාලවතිකං අනුප්පත්තො. තං ඛො පන භවන්තං ගොතමං එවං කල්යාණො කිත්තිසද්දො අබ්භුග්ගතො: ඉතිපි සො භගවා අරහං සම්මාසම්බුද්ධො විජ්ජාචරණසම්පන්නො සුගතො ලොකවිදූ අනුත්තරො පුරිසදම්මසාරථි සත්ථා දෙවමනුස්සානං බුද්ධො භගවා. සො ඉමං ලොකං සදෙවකං සමාරකං සබ්රහ්මකං, සස්සමණබ්රාහ්මණිං පජං සදෙවමනුස්සං සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදෙති. සො ධම්මං දෙසෙති ආදිකල්යාණං මජ්ඣෙකල්යාණං පරියො__සා__නකල්යාණං සාත්ථං සබ්යඤ්ජනං කෙවලපරිපුණ්ණං පරිසුද්ධං බ්රහ්මචරියං පකාසෙති. සාධු ඛො පන තථාරූපානං අරහතං දස්සනං හොතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "4. අථ ඛො ලොහිච්චො බ්රාහ්මණො භෙසිකං නහාපිතං ආමන්තෙසි: එහි ත්වං සම්ම භෙසිකෙ, යෙන සමණො ගොතමො තෙනුපසඞ්කම. උපසඞ්කමිත්වා මම වචනෙන සමණං ගොතමං අප්පාබාධං අප්පාතඞ්කං ලහුට්ඨානං බලං ඵාසුවිහාරං පුච්ඡ: ලොහිච්චො භො ගොතම බ්රාහ්මණො භවන්තං ගොතමං අප්පාබාධං අප්පාතඞ්කං ලහුට්ඨානං බලං ඵාසුවිහාරං පුච්ඡතීති. එවඤ්ච වදෙහි: අධිවාසෙතු කිර භවං ගොතමො ලොහිච්චස්ස බ්රාහ්මණස්ස ස්වාතනාය භත්තං සද්ධිං භික්ඛුසඞ්ඝෙනාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "12",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "ලොහිච්ච සූත්‍රය",
                        "level": 3
                    },
                    {
                        "format": 13,
                        "text": "1. මා විසින් මෙසේ අසන ලදි. එක් සමයක භාග්‍යවතුන් වහන්සේ භික්‍ෂූන් පන්සියක් පමණ වූ මහත් මහණමුළුවක් හා **කොසොල් **රටැ සැරි සරන සේක්, **සාලවතිකා** නම් ගමට බට සේක. එ සමයෙහි **ලෝහිච්ච** බමුණු තෙම (මිනිස් ගව මියු ඇත් අස් ඈ) සතුන්ගෙන් ගැවැසුණු, තණ දඬු දිය ඇති, බොහෝ ධාන්‍ය ඇති, පසේනදී කොසොල් රජුහු විසින් බඹදෙයෙන් තමහට පමුණු කොට දුන් රාජභෝග්‍ය වූ රාජදාය වූ සාලවතිකා ගමට අධිපති වැ වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "2. එ සමයෙහි ලෝහිච්ව බමුණුහට “මෙහි මහණෙක් හෝ බමුණෙක් හෝ කුසල් දහම් ලබන්නේ නම්, කුසල් දහම් ලැබ එය මෙරමාට නො කියැ යුතු ය. (තමන් ලත් කුසල් දම් තෙමේ ම ගරු කොට විසිය යුතු.) අනෙකෙක් (අනුසාසිතයෙක් අනෙකකුට) (අනුසාසකයක් හට) කවර වැඩක් නම් කරන්නේ ද? තමාගේ පරණ බැඳුමක් සිඳ අන්අළුත් බැඳුමක් කරන්නේ යම්සේ ද, මෙ පරහට කීමේ රුචියත් එසේ ම ලාමක වූ ලෝභ ධර්මයෙකැ යි කියමි. අනෙකෙක් අනෙකක්හට කුමක් නම් කරන්නේ දැ?”යි මෙසේ වූ ලාමක මිසදිටෙක් උපන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "3. ලෝහිච්ච බමුණු තෙම (රටෙහි පැතිරැ ගිය) මතු දැක්වෙන කථාව ඇසී යැ. “භවත්නි, සැහැපුත් වූ, සැහැකුලෙන් නික්මැ පැවැදි වූ මහණගොයුම්හු වනාහි මහණුන් පන්සියක් පමණ වූ මහත් මහණමුළුවක් හා කොසොල්රටැ සැරි සරනුවෝ සාලවතිකාවට පැමිණියහ. ඒ භාග්‍යවත්හු මේ මේ කරුණින් රහත්හ, සම්මාසම්බුදුහ, විදුයෙන් හා සරණින් හා යුතුවහ, සුගතහ, ලොව දතුවහ, තමනට වැඩිතරම් එකක්හු නැති පුරිස්දම් සැරියහ, දෙව්මිනිස්නට සථරහ, බුදු හ, භගවත් හ. ඔබ දෙවියන් සහිත මරුන් සහිත බඹුන් සහිත මේ ලොව - මහණ බමුණන් සහිත දෙව්මිනිසුන් සහිත මේ සත්මුළුව තුමූ ම සිය වෙසෙසි නුවණන් දැන පසක් කොට ලොවට දන්වති. ඔබ මුල කලණ මැද කලණ අග කලණ වූ, මනා අරුත් ඇති, පිරිපුන් වියඳුන් ඇති, හැම සැටියෙන් පිරිපුන්, පිරිසිදු දහම් දෙසති. එසේ දෙසනුවෝ සසුන්බඹසර පවසති. එබඳු රහතුන් දැක්ම වූ කලි මනා එකෙකැ’යි ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ පිළිබඳ මෙසේ වූ මහා කිතුහඞෙක් උස් වැ නැංගේ වේ” යනු යැ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "4. එක්බිති ලෝහිච්ච බමුණු භෙසිකා නම් නැහැවියා බණවා, “සගය, භෙසිකා, මහණ ගොයුම් වෙත යා. ගොස් ‘පින්වත් ගොයුමාණනි, ලෝහිච්ච බමුණු පින්වත් ගොයුමාණන් ආබාධ නැති නියා, නීරෝග නියා, හෑල්ලු පැවැතුම් ඇති නියා, කාබල ඇති නියා, සුව විහරණ ඇති නියා විචාරා’යි මා බසින් මහණ ගොයුමාණන් ආබාධ නැති නියා, රෝග නැති නියා, හෑල්ලු පැවැතුම් ඇති නියා, කාබල ඇතී නියා විචාරව. පින්වත් ගොයුමාණෝ මහණමුළුව හා සෙට දවසට ලෝහිච්ච බමුණාගේ බත ඉවසත් වා යි ද කියව”යි කී ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 542,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "5. එවං භන්තෙති ඛො භෙසිකා නහාපිතො ලොහිච්චස්ස බ්රාහ්මණස්ස පටිස්සුත්වා යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො භෙසිකා නහාපිතො භගවන්තං එතදවොච: ලොහිච්චො භන්තෙ බ්රාහ්මණො භගවන්තං අප්පාබාධං අප්පාතඞ්කං ලහුට්ඨානං බලං ඵාසුවිහාරං පුච්ඡති. එවඤ්ච වදෙති. අධිවාසෙතු කිර භන්තෙ භගවා ලොහිච්චස්ස බ්රාහ්මණස්ස ස්වාතනාය භත්තං සද්ධිං භික්ඛුසඞ්ඝෙනාති. අධිවාසෙසි භගවා තුණ්හීභාවෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "6. අථ ඛො භෙසිකා නහාපිතො භගවතො අධිවාසනං විදිත්වා උට්ඨායාසනා භගවන්තං අභිවාදෙත්වා පදක්ඛිණං කත්වා යෙන ලොහිච්චො බ්රාහ්මණො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ලොහිච්චං බ්රාහ්මණං එතදවොච: අවොචුම්හා ඛො මයං භන්තෙ තව වචනෙන තං භගවන්තං. ලොහිච්චො භන්තෙ බ්රාහ්මණො භගවන්තං අප්පාබාධං අප්පාතඞ්කං ලහුට්ඨානං බලං ඵාසුවිහාරං පුච්ඡති. එවඤ්ච වදෙති: අධිවාසෙතු කිර භන්තෙ භගවා ‘ලොහිච්චස්ස බ්රාහ්මණස්ස ස්වාතනාය භත්තං සද්ධිං භික්ඛුසඞ්ඝෙනා’ති. අධිවුත්ථඤ්ච පන තෙන භගවතාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "7. අථ ඛො ලොහිච්චො බ්රාහ්මණො තස්සා රත්තියා අච්චයෙන සකෙ නිවෙසනෙ පණීතං ඛාදනීයං භොජනීයං පටියාදාපෙත්වා භෙසිකං නහාපිතං ආමන්තෙසි: එහි ත්වං සම්ම භෙසිකෙ යෙන සමණො ගොතමො තෙනුපසඞ්කම. උපසඞ්කමිත්වා සමණස්ස ගොතමස්ස කාලං ආරොචෙහි: කාලො භො ගොතම නිට්ඨිතං භත්තන්ති. එවං භන්තෙ’ති ඛො භෙසිකා නහාපිතො ලොහිච්චස්ස බ්රාහ්මණස්ස පටිස්සුත්වා යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතො ඛො භෙසිකා නහාපිතො භගවතො කාලං ආරොචෙසි: කාලො භන්තෙ. නිට්ඨිතං භත්තන්ති. අථ ඛො භගවා පුබ්බන්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය සද්ධිං භික්ඛුසඞ්ඝෙන යෙන සාලවතිකා තෙනුපසඞ්කමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "8. තෙන ඛො පන සමයෙන භෙසිකා නහාපිතො භගවන්තං පිට්ඨිතො පිට්ඨිතො අනුබද්ධො හොති. අථ ඛො භෙසිකා නහාපිතො භගවන්තං එතදවොච: “ලොහිච්චස්ස භන්තෙ බ්රාහ්මණස්ස එවරූපං පාපකං දිට්ඨිගතං උප්පන්නං: ඉධ සමණො වා බ්රාහ්මණො වා කුසලං ධම්මං අධිගච්ඡෙය්ය, කුසලං ධම්මං අධිගන්ත්වා න පරස්ස ආරොචෙය්ය. කිං හි පරො පරස්ස කරිස්සති. සෙය්යථාපි පුරාණං බන්ධනං ඡින්දිත්වා අඤ්ඤං නවං බන්ධනං කරෙය්ය, එවං සම්පදමිදං පාපකං ලොභධම්මං වදාමි. කිං හි පරො පරස්ස කරිස්සතී”ති. සාධු භන්තෙ භගවා ලොහිච්චං බ්රාහ්මණං එතස්මා පාපකා දිට්ඨිගතා විවෙචෙතූ”ති. “අප්පෙවනාම සියා භෙසිකෙ අප්පෙවනාම සියා භෙසිකෙ”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "5. “එසේ ය, ස්වාමිනි”යි භෙසිකා නැහැවි ලෝහිච්ච බමුණුට පිළිවදන් දී භාග්‍යවතුත් වහන්සේ වෙත ගියේ ය. ගොස් ඔබ වැඳ පසෙක හුන්නේ ය. පසෙක හුන් ම භෙසිකා නැහැවී “වහන්ස, ලෝහිච්ච බමුණු භාග්‍යවතුන් වහන්සේ නිරාබාධ නියා, නීරෝග නියා, හෑල්ලු පැවැතුම් ඇති නියා, කාබල ඇති නියා, සැප විහරණ ඇති නියා විචාරයි. වහන්ස, භාග්‍යවතුන් වහන්සේ බික්සඟන හා සෙට දවසට ලෝභිච්ච බමුණාගේ බත ඉවසන සේක් ව”යි මෙසේත් කියා යැ යි භාග්‍යවතුන් වහන්සේ ට මෙය කී ය. භාග්‍යවතුන් වහන්සේ නිහඬ බැවින් එය ඉවැසූ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "6. ඉක්බිති භෙසිකා නැහැවි තෙම භාග්‍යවතුන් වහන්සේ ඉවැසූ නියා දැන, හුනස්නෙන් නැගී, භාග්‍යවතුන් වහන්සේ වැඳ පැදකුණු කොට, ලෝහිච්ච බමුණ කරා ගියේ ය. ගොස් “වහන්ස, ලෝහිච්ව බමුණු භාග්‍යවතුන් වහන්සේ නිරාබාධ නියා, නීරෝග නියා හෑල්ලු පැවැතුම් ඇති නියා, කාබල ඇති නියා, සුව වුසුම් ඇති නියා විචාරයි. වහන්ස, භාග්‍යවතුන් වහන්සේ බික්සඟන හා සෙට පිණිස ලෝහිච්ච බමුණුහුගේ බත ඉවසන සේක් ව යි මෙසේ ලෝහිච්ච බමුණු කියායැ යි ඒ භාග්‍යවතුන් වහන්සේට ඔබ වචනයෙන් සැළ කළම්හ”යි ලෝහිච්ච බමුණාට කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "7. ඉක්බිත්තෙන් ලෝහිච්ච බමුණු එ රැය ඇවෑමෙන් සිය නිවෙස්හි ප්‍රණීත ඛාද්‍ය භෝජ්‍ය පිළියෙල කරවා භෙසිකා නැහැවියා බණවා, “සගය, භෙසිකා, මෙහි එව, තෝ මහණගොයුමන් කරා යා. ගොස් ‘පින්වත් ගොයුමාණනි, වඩිනුවට කල් යැ. බත පිළියෙළ කොට නිම වී යැ’යි මහණ ගොයුමාණනට කල් දන්වව’යි කී ය. ‘එසේ ය ස්වාමිනි’ යි කියා ම භෙසිකා නැහැවි ලෝහිච්ච බමුණාට පිළිවදන් දී භාග්‍යවතුන් වහන්සේ කරා ගියේ ය. ගොස් භාග්‍යවතුන් වැඳ පසෙක සිටියේ ය. පසෙක සිටියාවූ භෙසිකා නැහැවි “වහන්ස, වඩිනුවට කල් ය. බත පිළියෙල කොට නිම වීයැ” යි සැළ කෙළේ ය. ඉක්බිති භාග්‍යවතුන් වහන්සේ පෙරවරුයෙහි හැඳ පෙරෙව පාසිවුරු ගෙන මහණගණයා හා ශාලවතිකා ගමට වැඩි සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "8. එ කල්හි භෙසිකා නැහැවි භාග්‍යවතුන් වහන්සේ පසුපසින් ඔබ හා ම ගියේ වෙයි. එ කලැ භෙසිකා නැහැවි “වහන්ස, මෙහි මහණෙක් හෝ බමුණෙක් හෝ කුසල්දහම් ලැබ ගන්නේ නම්, කුසල් දහම් ලැබැ එය පරහට නො කිය යුතු ය. අනෙකෙක් අනෙකකුට කවර වැඩක් නම් කරන්නේ ද? පැරැණි බැඳුම සිඳ අන් අළුත් බැඳුමක් කරන්නේ යම්සේ ද, මෙද එසේම ලාමක ලෝභධර්මයෙකැයි කියමි. අනෙකෙක් අනෙකකුට කවර වැඩක් කරන්නේ දැ?’ යි ලෝහිච්ච බමුණාට මෙබඳු ලාමක මිසදිටෙක් උපන. වහන්ස, භාග්‍යවතුන් වහන්සේ ලෝහිච්ච බමුණහු මේ ලාමක මිසදිටෙන් මුදන සේක් වා” යි භාග්‍යවතුන් වහන්සේට කී ය. “භෙසිකා, මැනැව, එය වනු ඇත. භෙසිකා, මැනැව. එය වනු ඇතැ” යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 544,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "9. අථ ඛො භගවා යෙන ලොහිච්චස්ස බ්රාහ්මණස්ස නිවෙසනං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදි. අථ ඛො ලොහිච්චො බ්රාහ්මණො බුද්ධප්පමුඛං භික්ඛුසඞ්ඝං පණීතෙන ඛාදනීයෙන භොජනීයෙන සහත්ථා සන්තප්පෙසි සම්පවාරෙසි. අථ ඛො ලොහිච්චො බ්රාහ්මණො භගවන්තං __භු__ත්තාවිං ඔනීතපත්තපාණිං අඤ්ඤතරං නීචං ආසනං ගහෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො ලොහිච්චං බ්රාහ්මණං භගවා එතදවොච: “සච්චං කිර තෙ ලොහිච්ච, එවරූපං පාපකං දිට්ඨිගතං උප්පන්නං: ඉධ සමණො වා බ්රාහ්මණො වා කුසලං ධම්මං අධිගච්ඡෙය්ය, කුසලං ධම්මං අධිගන්ත්වා න පරස්ස ආරොචෙය්ය, කිං හි පරො පරස්ස කරිස්සති? සෙය්යථාපි නාම පුරාණං බන්ධනං ඡින්දිත්වා අඤ්ඤං නවං බන්ධනං කරෙය්ය, එවං සම්පදමිදං පාපකං ලොභධම්මං වදාමි. කිං හි පරො පරස්ස කරිස්සතී?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“එවං භො ගොතම”."
                    },
                    {
                        "type": "paragraph",
                        "text": "10. “තං කිං මඤ්ඤසි ලොහිච්ච? නනු ත්වං සාලවතිකං අජ්ඣාවසසී”?ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“එවං භො ගොතම”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යො නු ඛො ලොහිච්ච, එවං වදෙය්ය ‘ලොහිච්චො බ්රාහ්මණො සාලවතිකං අජ්ඣාවසති. යා සාලවතිකාය සමුදයසඤ්ජාති ලොහිච්චො’ව තං බ්රාහ්මණො එකකො පරිභුඤ්ජෙය්ය, න අඤ්ඤෙසං දදෙය්යා’ති. එවංවාදී සො යෙ තං උපජීවන්ති, තෙසං අන්තරායකරො වා හොති නො වා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අන්තරායකරො භො ගොතම”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අන්තරායකරො සමානො ලොහිච්ච හිතානුකම්පී වා තෙසං හොති අහිතානුකම්පී වා”?ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අහිතානුකම්පී භො ගොතම”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අහිතානුකම්පිස්ස මෙත්තං වා තෙසු චිත්තං පච්චුපට්ඨිතං හොති සපත්තකං වා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“සපත්තකං භො ගොතම”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“සපත්තකෙ චිත්තෙ පච්චුපට්ඨිතෙ මිච්ඡාදිට්ඨි වා හොති සම්මාදිට්ඨි වා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“මිච්ඡාදිට්ඨි භො ගොතම”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“මිච්ඡාදිට්ඨිස්ස ඛො අහං ලොහිච්ච, ද්වින්නං ගතීනං අඤ්ඤතරං ගතිං වදාමි: නිරයං වා තිරච්ඡානයොනිං වා”."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "9. ඉක්බිත්තෙන් භාග්‍යවතුන් වහන්සේ ලෝහිච්ච බමුණාගේ ගෙට එළැඹි සේක. එළැඹ පණවන ලද අස්නැ වැඩ හුන් සේක. එ කලැ ලෝහිච්ච බමුණු බුදුපාමොක් බික්සඟන ප්‍රණීත ඛාද්‍ය භෝජ්‍යයෙන් සියතිත් සැතැප්වී ය, මොනොවට පැවැරී ය. එයින් පසු ලෝහිච්ච බමුණු දන් වැළැඳූ, පාත්‍රයෙන් ඉවතට ගත් අතැති භාග්‍යවතුන් වහන්සේට එක් පසෙක එක්තරා මිටි අස්නක් ගෙන හිඳ ගන්නේ ය. එක් පසෙක හිඳ ගත්තා වූ ම ලෝහිච්ච බමුණා අමතා, “ලෝහිච්චයෙනි, මෙහි මහණෙක් හෝ බමුණෙක් හෝ කුසල් දහම් ලැබ ගන්නේ තම්, කුසල් දහම ලැබ එය මෙරමාහට නො කියැ යුතු. අනෙකෙක් අනෙකකුට කවර වැඩක් නම් කරන්නේ ද? පරණ බැඳුම් සිඳ අන් අළුත් බැඳුමක් කරන්නේ යම්සේ ද, එසේ ම මෙ කරුණ ද ලාමක ලෝභ ධර්මයෙකැ යි කියමි. අනෙකෙක් අනෙකකුට කවර වැඩක් නම් කරන්නේ දැ?”යි මෙසේ ලාමක මිසදිටෙක් තොපට උපන්නේ ල. ඒ සැබෑ දැ? යි භාග්‍යවතුන් වහන්සේ අසා වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[ලෝහිච්ච:] “එසේ ය, පින්වත් ගොයුමාණනි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "10. [භාග්‍යවත්හු:] “ලෝහිච්චයෙනි, ඒ කිමැ යි සිතවූ ද? තෙපි සාලවතිකාවට අධිපති වැ වසනුවෝ නො වහු ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[ලෝහිච්ච:] “එසේ ය, පින්වත් ගොයුමාණනි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[භාග්‍යවත්හු:] “ලෝහිච්ච බමුණු සාලවතිකාවව අධිපති වැ වෙසෙයි. සාලවතිකා ගමෙහි උපන් යම් ධනධාන්‍යයෙක් ඇත් නම්, එය ලෝහිච්ච බමුණා ම එකලා වැ වළඳන්නේ නම්, අනුනට නො දෙන්නේ නම් මැනැවැ’යි යමෙක් කියන්නේ ද, මෙසේ කියන හෙ තෙම තොප නිසා ජීවත් වන ඥාතිපරිජනආදීනට ලැබෙන දැයට අන්තරාය කරන්නෙක් හෝ නො කරන්නෙක් වේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[ලෝහිච්ච:] “පින්වත් ගොයුමාණනි, හේ ඔවුන් ලබන ඒ දැයට අනතුරු කරන්නෙක් ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[භාග්‍යවත්හු:] “ලෝහිච්චය, ලාභයට අන්තරාය කරන්නේ ම හෙතෙම ඔවුනට හිතානුකම්පා ඇතියෙක් හෝ හිතානුකම්පා නැතියෙක් වේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[ලෝහිච්ච:] “පින්වත් ගොයුමාණනි, හිතානුකම්පා නැතියෙක් වේ.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[භාග්‍යවත්හු:] “හිතානුකම්පා නැතියහුට ඔවුන් කෙරෙහි එළැඹ සිටියේ මිතුරු සිත ද, තැත හොත් සතුරු සිත ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[ලෝහිච්ච:] “සතුරු සිත ය, පින්වත් ගොයුමාණනි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[භාග්‍යවත්හු:] “සතුරු සිත එළැඹ සිටි කල්හි මිසදිට් හෝ වේ ද, නැත හොත් සම්දිට් වේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[ලෝහිච්ච:] “පින්වත් ගොයුමාණනි, මිසදිට් වේ.” ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[භාග්‍යවත්හු:] “ලෝහිච්චය, මම මිසදිට් ගතුවාහට දෙ ගති අතුරෙන් නිරය හෝ තිරිසන් යෝනිය හෝ යන එක්තරා ගතියක් කියමි.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 546,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "11. තං කිම්මඤ්ඤසි ලොහිච්ච, නනු රාජා පසෙනදි කොසලො කාසිකොසලං අජ්ඣාවසතී?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“එවං භො ගොතම”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යො නු ඛො ලොහිච්ච, එවං වදෙය්ය: ‘රාජා පසෙනදි කොසලො කාසිකොසලං අජ්ඣාවසති. යා කාසිකොසලෙ සමුදයසඤ්ජාති, රාජා’ව තං පසෙනදී කොසලො එකකො පරි__භු__ඤ්ජෙය්ය, න අඤ්ඤෙසං දදෙය්යා’ති. එවංවාදී සො යෙ රාජානං පසෙනදිං කොසලං උපජීවන්ති තුම්හෙ චෙව අඤ්ඤෙ ච, තෙසං අන්තරායකරො වා හොති, නො වා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අන්තරායකරො භො ගොතම”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අන්තරායකරො සමානො හිතානුකම්පී වා තෙසං හොති අහිතානුකම්පී වා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අහිතානුකම්පී, භො ගොතම”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අහිතානුකම්පිස්ස ලොහිච්ච, මෙත්තං වා තෙසු චිත්තං පච්චුපට්ඨිතං සපත්තකං වා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“සපත්තකං භො ගොතම”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“සපත්තකෙ චිත්තෙ පච්චුපට්ඨිතෙ මිච්ඡාදිට්ඨි වා හොති සම්මාදිට්ඨි වා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“මිච්ඡාදිට්ඨි භො ගොතම”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“මිච්ඡාදිට්ඨිස්ස ඛො අහං ලොහිච්ච, ද්වින්නං ගතීනං අඤ්ඤතරං ගතිං වදාමි නිරයං වා තිරච්ඡානයොනිං වා”."
                    },
                    {
                        "type": "paragraph",
                        "text": "12. ඉති කිර ‘ලොහිච්ච යො එවං වදෙය්ය: ලොහිච්චො බ්රාහ්මණො සාලවතිකං අජ්ඣාවසති. යා සාලවතිකාය සමුදයසඤ්ජාති, ලොහිච්චො’ව තං බ්රාහ්මණො එකකො පරි__භු__ඤ්ජෙය්ය, න ච අඤ්ඤෙසං දදෙය්යා’ති. එවංවාදී සො යෙ තං උපජීවන්ති, තෙසං අන්තරායකරො හොති. අන්තරායකරො සමානො අහිතානුකම්පී හොති. අහිතානුකම්පිස්ස සපත්තකං චිත්තං පච්චුපට්ඨිතං හොති. සපත්තකෙ චිත්තෙ පච්චුපට්ඨිතෙ මිච්ඡාදිට්ඨි හොති. එවමෙව ඛො ලොහිච්ච යො එවං වදෙය්ය: “ඉධ සමණො වා බ්රාහ්මණො වා කුසලං ධම්මං අධිගච්ඡෙය්ය, කුසලං ධම්මං අධිගන්ත්වා න පරස්ස ආරොචෙය්ය, කිං හි පරො පරස්ස කරිස්සති? සෙය්යථාපි නාම පුරාණං බන්ධනං ඡින්දිත්වා අඤ්ඤං නවං බන්ධනං කරෙය්ය, එවං සම්පදමිදං පාපකං ලොභධම්මං වදාමි. කිං හි පරො පරස්ස කරිස්සතී”ති. එවංවාදී සො යෙ තෙ කුලපුත්තා තථාගතප්පවෙදිතං ධම්මවිනයං ආගම්ම එවරූපං උළාරං විසෙසං අධිගච්ඡන්ති: සොතාපත්තිඵලම්පි සච්ඡිකරොන්ති, සකදාගාමිඵලම්පි සච්ඡිකරොන්ති, අනාගාමිඵලම්පි සච්ඡිකරොන්ති, අරහත්තම්පි සච්ඡිකරොන්ති, යෙචිමෙ දිබ්බා ගබ්භා පරිපාචෙන්ති දිබ්බානං භවානං අභිනිබ්බත්තියා, තෙසං අන්තරායකරො හොති. අන්තරායකරො සමානො අහිතානුකම්පී හොති. අහිතානුකම්පිස්ස සපත්තකං චිත්තං පච්චුපට්ඨිතං හොති. සපත්තකෙ චිත්තෙ පච්චුපට්ඨිතෙ මිච්ඡාදිට්ඨි හොති. මිච්ඡාදිට්ඨිස්ස ඛො අහං ලොහිච්ච, ද්වින්නං ගතීනං අඤ්ඤතරං ගතිං වදාමි නිරයං වා තිරච්ඡානයොනිං වා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "11. ලෝහිච්චය, ඒ කිමැ යි සිතහි ද ‘පසේනදී කොසොල්රජ කසී කොසොල් දෙ රටට අධිපති වැ වෙසෙයි?",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[ලෝහිච්ච:] “එසේය පින්වත් ගොයුමාණනි”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කසීකොසොල් දෙ රටැ යම් ධනධාන්‍යයෙක් උපදනේ නම් එය පසේනදී කොසොල්රජ ම එකලා වැ වළඳන්නේ නම්, අනුනට නො දෙන්නේ නම් මැනැවැ යි යමෙක් මෙසේ කියන්නේ ද, මෙසේ කියන ඒ තැනැන්නේ පසේනදී කොසොල් රජු නිසා ජීවත් වන තොප ද අනුන් ද ඒ හැම දෙනාගේ ලාභයට අන්තරාය කරන්නෙක් වේ ද, නැත හොත් අන්තරාය නොකරන්නේ වේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[ලෝහිච්ච:] “පින්වත් ගොයුමාණනි, ලාභයට අන්තාරය කරන්නෙක් වෙයි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[භාග්‍යවත්හු:] “ලාභයට අන්තරාය කරන්නේ ම ඔවුනට හිතානුකම්පී වේ ද, නැත හොත් අහිතානුකම්පී වේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[ලෝහිච්ච:] “පින්වත් ගොයුමාණනි, අහිතානුකම්පී වෙයි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[භාග්‍යවත්හු:] “අහිතානුකම්පීහට ඔවුන් කෙරෙහි එළැඹ සිටියේ මිතුරු සිත ද, නැත හොත් සතුරු සිත ද?” ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[ලෝහිච්ච:] “සතුරු සිත ය, පින්වත් ගොයුමාණනි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[භාග්‍යවත්හු:] “සතුරු සිත එළැඹ සිටි කලැ හේ මිසදිටු වේ ද නැත හොත් සම්දිටු වේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[ලෝහිච්ච:] “මිසදිටු වෙයි, පින්වත් ගොයුමාණනි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[භාග්‍යවත්හු:] “ලෝහිච්චය, මිසදිටුවාහට නිරය හෝ තිරිසන් යොන හෝ මේ දෙගතියෙන් එක්තරා ගතියක් මම කියමි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "12. ලෝහිච්චය, ‘ලෝහිච්ච බමුණා සාලවතිකාවට අධිපති වැ වෙසේ. සාලවතිකායෙහි උපදනා තාක් සියලු ධනධාන්‍ය ලෝහිච්ච බමුණා ම එකලා වැ වළඳන්නේ නම්, අනුනට නො දන්නේ නම් මැනැවැ’යි යමෙක් මෙසේ කියන්නේ ද, මෙසේ කියන හෙ තෙම තොප නිසා ජීවත් වන හැම දෙනාට ලාභාන්තරායකර වෙයි. ලාභාන්තරාය කරන්නේ ම අහිතානුකම්පී වේ. අහිතානුකම්පී තැනැත්තහුට සතුරු සිත එළැඹ සිටියේ වෙයි. සතුරු සිත එළැඹ සිටි කලැ මිසදිටු වෙයි. එ පරිද්දෙන් ම, ලෝහිච්චය, ‘මෙහි මහණෙක් හෝ බමුණෙක් හෝ කුසල් දහම් ලබන්නේ ය. කුසල් දහම් ලැබ මෙරමාහට නො කියැ යුතු යැ’යි ද, ‘අනෙකෙක් අනෙකකුට කවර වැඩක් කරන්නේ දැ’යි ද, පරණ බැඳුම සිඳ අන් අළුත් බැඳුමක් කරන්නේ යම් සේ ද, එසේම මේ කරුණ ලෝභධර්මයෙකැ යි කියමි’ යි ද, ‘අනෙකෙක් අනෙකකුට කවර වැඩක් කරන්නේ දැ’යි ද යමෙක් මෙසේ කියන්නේ නම්, මෙසේ කියන හෙ තෙම -  යම් කුලපුත් කෙනෙක් තථාගත බුදුහු දෙසූ දහම්විනය ඇති මේ සසුන් නිසා සෝවාන්පල පසක් කෙරෙත් ද, සෙදැගැමිපල පසක් කෙරෙත් ද, අනගැමිපල පසක් කෙරෙත් ද, රහත්පල පසක් කෙරෙත් ද, (එයට නො පොහොසත්) යම් කෙනෙක් දෙව්ලෝහි උපදිනු පිණිස දෙව්ගබ් මුහුකුරවත් ද (දෙව්ලෝ යන පිළිවෙත් පුරත් ද), හේ ඔවුනට ලාභාන්තරායකර වේ. ලාභාන්තරායකරය කරනුයේ ම අහිතානුකම්පී වෙයි. අහිතානුකම්පී පුඟුලා ට සතුරු සිත එළැඹ සිටියේ වෙයි. සතුරු සිත එළැඹ සිටි කල්හි මිසදිටු වෙයි. ලෝහිච්චය, මේ මිසදිටුහට (මතු) නිරාගතිය හෝ තිරිසන් යොන හෝ මේ දෙගතියෙන් එක්තරා ගතියක් කියමි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 548,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "13. ඉති කිර ලොහිච්ච යො එවං වදෙය්ය: ‘රාජා පසෙනදි කොසලො කාසිකොසලං අජ්ඣාවසති, යා කාසිකොසලෙ සමුදයසඤ්ජාති, රාජා’ව තං පසෙනදි කොසලො එකකො පරිභුඤ්ජෙය්ය, න අඤ්ඤෙසං දදෙය්යා’ති. එවංවාදී සො යෙ රාජානං පසෙනදිං කොසලං උපජීවන්ති තුම්හෙ චෙව අඤ්ඤෙ ච, තෙසං අන්තරායකරො හොති. අන්තරායකරො සමානො අහිතානුකම්පී හොති. අහිතානුකම්පිස්ස සපත්තකං චිත්තං පච්චුපට්ඨිතං හොති. සපත්තකෙ චිත්තෙ පච්චුපට්ඨිතෙ මිච්ඡාදිට්ඨි හොතී. එවමෙව ඛො ලොහිච්ච, යො එවං වදෙය්ය: ‘ඉධ සමණො වා බ්රාහ්මණො වා කුසලං ධම්මං අධිගච්ඡෙය්ය, කුසලං ධම්මං අධිගන්ත්වා න පරස්ස ආරොචෙය්ය, කිං හි පරො පරස්ස කරිස්සති? සෙය්යථාපි නාම පුරාණං බන්ධනං ඡින්දිත්වා අඤ්ඤං නවං බන්ධනං කරෙය්ය, එවං සම්පදමිදං පාපකං ලොභධම්මං වදාමි. කිං හි පරො පරස්ස කරිස්සතී’ති? එවංවාදී සො යෙ තෙ කුලපුත්තා තථාගතප්පවෙදිතං ධම්මවිනයං ආගම්ම එවරූපං උළාරං විසෙසං අධිගච්ඡන්ති: සොතාපත්තිඵලම්පි සච්ඡිකරොන්ති, සකදාගාමිඵලම්පි සච්ඡිකරොන්ති, අනාගාමිඵලම්පි සච්ඡිකරොන්ති, අරහත්තම්පි සච්ඡිකරොන්ති, යෙ චිමෙ දිබ්බා ගබ්භා පරිපාචෙන්ති දිබ්බානං භවානං අභිනිබ්බත්තියා, තෙසං අන්තරායකරො හොති. අන්තරායකරො සමානො අහිතානුකම්පී හොති. අහිතානුකම්පිස්ස සපත්තකං චිත්තං පච්චුපට්ඨිතං හොති. සපත්තකෙ චිත්තෙ පච්චුපට්ඨිතෙ මිච්ඡාදිට්ඨි හොති. මිච්ඡාදිට්ඨිස්ස ඛො අහං ලොහිච්ච, ද්වින්නං ගතීනං අඤ්ඤතරං ගතිං වදාමි නිරයං වා තිරච්ඡානයොනිං වා."
                    },
                    {
                        "type": "paragraph",
                        "text": "14. තයො ඛො’මෙ ලොහිච්ච සත්ථාරො යෙ ලොකෙ චොදනාරහා, යො ච පනෙවරූපෙ සත්ථාරො චොදෙති, සා චොදනා භූතා තච්ඡා ධම්මිකා අනවජ්ජා. කතමෙ තයො? ඉධ ලොහිච්ච, එකච්චො සත්ථා යස්සත්ථාය අගාරස්මා අනගාරියං පබ්බජිතො හොති, ස්වාස්ස සාමඤ්ඤත්ථො අනනුප්පත්තො හොති, සො තං සාමඤ්ඤත්ථං අනනුපාපුණිත්වා සාවකානං ධම්මං දෙසෙති: ඉදං වො හිතාය ‘ඉදං වො සුඛායා’ති. තස්ස සාවකා න සුස්සූසන්ති, න සොතං ඔදහන්ති, න අඤ්ඤා චිත්තං උපට්ඨපෙන්ති, වොක්කම්ම ච සත්ථුසාසනා වත්තන්ති. සො එවමස්ස චොදෙතබ්බො: “ආයස්මා ඛො යස්සත්ථාය අගාරස්මා අනගාරියං පබ්බජිතො, සො තෙ සාමඤ්ඤත්ථො අනනුප්පත්තො. තං ත්වං සාමඤ්ඤත්ථං අනනුපාපුණිත්වා සාවකානං ධම්මං දෙසෙසි ‘ඉදං වො හිතාය ඉදං වො සුඛායා’ති. තස්ස තෙ සාවකා න සුස්සූසන්ති. න සොතං ඔදහන්ති. න අඤ්ඤා චිත්තං උපට්ඨපෙන්ති වොක්කම්ම ච සත්ථුසාසනා වත්තන්තී”ති. සෙය්යථාපි නාම ඔස්සක්කන්තියා වා උස්සක්කෙය්ය{1}, පරම්මුඛිං වා ආලිඞ්ගෙය්ය, එවං සම්පදමිදං පාපකං ලොභධම්මං වදාමි. කිං හි පරො පරස්ස කරිස්සති?” අයං ඛො ලොහිච්ච, පඨමො සත්ථා යො ලොකෙ චොදනාරහො, යො ච පනෙවරූපං සත්ථාරං චොදෙති, සා චොදනා භූතා තච්ඡා ධම්මිකා අනවජ්ජා."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උස්සුක්කෙය්ය - කෙසුචි."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "13. ලෝහිච්චය, ‘පසේනදී කොසොල්රජ කසී කොසොල් දෙ රටට අධිපති ව වෙසෙයි. කසී කොසොල් දෙරටැ උපදනා යම් ධනධාන්‍ය රැසෙක් වේ නම්, එය පසේනදී කොසොල්රජ ම එකලා වැ වළඳන්නේ නම්, අනුනට නො දෙන්නේ නම් මැනැවැයි යමෙක් මෙසේ කියන්නේ නම්, එසේ කියනසුලු හෙතෙම පසේනදී කොසොල්රජු නිසා යැපෙන තොපටත් අනුනටත් ලාභාන්තරායකර වෙයි. ලාභාන්තරාය කරන්නේ ම හිතානුකම්පා නැත්තේ වෙයි. හිතානුකම්පා නැතියහුට සතුරු සිත එළැඹ සිටියේ වෙයි. සතුරු සිත එළැඹ සිටි කලැ මිසදිටු වෙයි. ලෝභිච්වය, එසේ ම ‘මෙහි මහණෙක් හෝ බමුණෙක් හෝ කුසල් දහම් ලබන්නේ ය, කුසල් දහම් ලැබ, මෙරමාහට නො දෙසියැ යුතු යැයි ද අනෙකෙක් අනෙකකුට කවර වැඩක් කරන්නේ ද? පරණ බැඳුමක් සිඳ අන් අළුත් බැඳුමක් කරන්නේ යම්සේ ද, එසේ මේ කරුණ ලාමක ලෝභධර්මයෙකැ යි කියමි. අනෙකෙක් අනෙකකුට කුමක් කරන්නේ දැ?’ යි යමෙක් මෙසේ කියන්නේ ද, මෙසේ කියන හෙ තෙම යම් කුලපුත් කෙනෙක් බුදුන් වදහළ දහම් විනය නිසා සෝවාන්පලයත් පසක් කෙරෙත් නම්, සෙදැගැමිපලයත් පසක් කෙරෙත් නම්, අනාගැමිපලයත් පසක් කෙරෙත් නම්, රහත්පලයත් පසක් කෙරෙත් නම්, මෙසේ වූ මහත් ගුණ විශේෂ ලබත් නම්, දිව්‍යභවයන්ගේ පහළ වීම පිණිස දෙව්ගබ් මුහුකුරවත් නම්, ඔවුන් හැමට ලාභාන්තරායකර වෙයි. ලාභාන්තරාය කරන්නේ ම ඔවුනට හිතානුකම්පා නැත්තේ වෙයි. හිතානුකම්පා නැත්තහුට සතුරු සිත එළැඹ සිටී. සතුරු සිත එළැඹ සිටි කල්හි මිසදිටු වෙයි. මිසදිටුහට මතු නිරය හෝ තිරිසන් යෝන හෝ මේ දෙ ගති අතුරෙන් එක්තරා ගතියක් මම කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "14. ලෝහිච්චය, යම් ශාස්තෘ කෙනෙක් ලොවැ චෝදනා ලැබිය. යුත්තෝ ද, යමෙකුත් මෙබඳු ශාස්තෘනට චෝදනා කෙරේ ද, ඒ චෝදනාව ඇත්තත් සත්‍යත් දැහමින් නොවැරැදිත් වේ ද, එසේ වූ මේ ශාස්තෘහු තිදෙනෙකි. කවර තිදෙනෙක් ද යත්: ලෝභිච්චය, මෙහි එක්තරා ශාස්තෘවරයෙක් යමක් පිණිස ගිහිගෙන් නික්මැ පැවිද්දට වන්නේ වේ ද, ඒ ශ්‍රාමණ්‍යාර්‍ථය (මහණදමේ ඵලය) ඔහු විසින් නො ලද්දේ වෙයි. හේ ඒ ශ්‍රාමණ්‍යාර්‍ථය නො ලැබ ‘මෙය තොපට වැඩ පිණිස වේ. මෙය තොපට සුව පිණිස වේ’ යැ යි සව්වනට දහම දෙසයි. ඔහුගේ සව්වෝ ඔහු බස අසන්නට කැමැති නො වෙත්. ඔහුට කන් යොමු නො කෙරෙත්. දැන ගැන්ම පිණිස සිත නො එළවත්. ඒ ශාස්තෘහුගේ අනුශාසනයෙන් වෙන් ව ම පවතිත්. ‘ආයුෂ්මත්හු වනාහි යමක් පිණිස ගිහිගෙන් නික්මැ පැවිදි බවට පැමිණියෝ ද, ඔබ විසින් ඒ ශ්‍රාමණ්‍යාර්‍ථය නො ලද්දේ වෙයි. ඔබ ඒ ශ්‍රාමණ්‍යාර්‍ථය නො ලැබ ‘මෙය තොපට වැඩ පිණිස වේ. මෙය තොපට සුව පිණිස වේ’ යැ යි සව්වනට දහම දෙසති. ඒ ඔබ බස සව්වෝ අසනු නො රිසියෙත්. එයට කන් යොමු නො කරත්. දැන ගැන්මෙහි සිත නො එළවත්. ශාස්තෘ වූ ඔබගේ අනුශාසනයෙන් වෙන් ව ද පවතිත්’ යි ඒ ශාස්තෘ තෙම මෙසේ චෝදනා කරනු ලැබිය යුතු වන්නේ ය. යම්සේ ඉවත් වැ යන්නියක වෙතට යන්නේ ද, නොකැමැත්තෙන් පිටුපා සිටි තැනැත්තිය වැලැඳ ගන්නේ ද, මෙසේ මේ කරුණ ලාමක ලෝභධර්‍මයක් කොට කියමි. එබඳු ශාස්තෘ වූ අන් තැනැත්තේ අනෙකකුට කවර වැඩක් නම් කරන්නේ ද? ලෝහිච්චය, යම් ශාස්තෘවරයෙක් ලොවැ චෝදනා ලැබිය යුතු ද, මේ ඒ පළමු වන ශාස්තෘ ය. යමෙකුත් මෙබඳු ශාස්තෘහට චෝදනා කෙරේ නම්, ඒ චෝදනාව ඇත්ත ය, සත්‍ය ය, දැහැමි ය, නොවැරැදි ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 550,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "15. පුනචපරං ලොහිච්ච ඉධෙකච්චො සත්ථා යස්සත්ථාය අගාරස්මා අනගාරියං පබ්බජිතො හොති, ස්වාස්ස සාමඤ්ඤත්ථො අනනුප්පත්තො හොති. සො තං සාමඤ්ඤත්ථං අනනුපාපුණිත්වා සාවකානං ධම්මං දෙසෙති ‘ඉදං වො හිතාය ඉදං වො සුඛායා’ති. තස්ස තෙ සාවකා සුස්සූසන්ති, සොතං ඔදහන්ති, අඤ්ඤා චිත්තං උපට්ඨපෙන්ති, න ච වොක්කම්ම සත්ථුසාසනා වත්තන්ති. සො එවමස්ස චොදෙතබ්බො: “ආයස්මා ඛො යස්සත්ථාය අගාරස්මා අනගාරියං පබ්බජිතො, සො තෙ සාමඤ්ඤත්ථො අනනුප්පත්තො. තං ත්වං සාමඤ්ඤත්ථං අනනුපාපුණිත්වා සාවකානං ධම්මං දෙසෙසි ‘ඉදං වො හිතාය ඉදං වො සුඛායා’ති. තස්ස තෙ සාවකා සුස්සූසන්ති, සොතං ඔදහන්ති, අඤ්ඤා චිත්තං උපට්ඨපෙන්ති, න ච වොක්කම්ම සත්ථුසාසනා වත්තන්ති. සෙය්යථාපි නාම සකං ඛෙත්තං ඔහාය පරඛෙත්තං නිඩ්ඩායිතබ්බං{1} මඤ්ඤෙය්ය, එවං සම්පදමිදං පාපකං ලොභධම්මං වදාමි. කිං හි පරො පරස්ස කරිස්සතී”ති. අයං ඛො ලොහිච්ච, දුතියො සත්ථා යො ලොකෙ චොදනාරහො, යො ච පනෙවරූපං සත්ථාරං චොදෙති, සා චොදනා භූතා තච්ඡා ධම්මිකා අනවජ්ජා."
                    },
                    {
                        "type": "paragraph",
                        "text": "16. පුනචපරං ලොහිච්ච ඉධෙකච්චො සත්ථා යස්සත්ථාය අගාරස්මා අනගාරියං පබ්බජිතො හොති, ස්වාස්ස සාමඤ්ඤත්ථො අනුප්පත්තො හොති. සො තං සාමඤ්ඤත්ථං අනුපාපුණිත්වා සාවකානං ධම්මං දෙසෙති ‘ඉදං වො හිතාය ඉදං වො සුඛායා’ති. තස්ස සාවකා න සුස්සූසන්ති, න සොතං ඔදහන්ති, න අඤ්ඤා චිත්තං උපට්ඨපෙන්ති, වොක්කම්ම ච සත්ථුසාසනා වත්තන්ති. සො එවමස්ස චොදෙතබ්බො: “ආයස්මා ඛො යස්සත්ථාය අගාරස්මා අනගාරියං පබ්බජිතො, සො තෙ සාමඤ්ඤත්ථො අනුප්පත්තො. තං ත්වං සාමඤ්ඤත්ථං අනුපාපුණිත්වා සාවකානං ධම්මං දෙසෙසි ‘ඉදං වො හිතාය ඉදං වො සුඛායා’ති. තස්ස තෙ සාවකා න සුස්සූසන්ති, න සොතං ඔදහන්ති, න අඤ්ඤා චිත්තං උපට්ඨපෙන්ති, වොක්කම්ම ච සත්ථුසාසනා වත්තන්ති. සෙය්යථාපි නාම පුරාණං බන්ධනං ඡින්දිත්වා අඤ්ඤං නවං බන්ධනං කරෙය්ය, එවං සම්පදමිදං පාපකං ලොභධම්මං වදාමි, කිං හි පරො පරස්ස කරිස්සතී”ති. අයං ඛො ලොහිච්ච, තතියො සත්ථා යො ලොකෙ චොදනාරහො, යො ච පනෙවරූපං සත්ථාරං චොදෙති, සා චොදනා භූතා තච්ඡා ධම්මිකා අනවජ්ජා."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. නිද්දායිතබ්බං - කෙසුචි."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "15. තව ද අනෙකක් කියම්. ලෝහිච්චය, මෙහි එක්තරා ශාස්තෘවරයෙක් යමක් පිණිස පැවිද්දට වන්නේ වේ ද, ඔහු විසින් ඒ ශ්‍රාමණ්‍යාර්‍ථය නො ලදුයේ වෙයි. හේ ඒ ශ්‍රාමණ්‍යාර්‍ථය නො ලැබ, ‘මෙය තොපට වැඩ පිණිස වේ. මෙය තොපට සුව පිණිස වේ’ යැ යි සව්වනට දහම් දෙසයි. ඒ සව්වෝ ඔහු බස් අසනු කැමැති වෙත්. කන් යොමු කෙරෙත්. දැන ගැන්ම පිණිස සිත එළවා තබත්. ඒ ශාස්තෘහුගේ අනුශාසනයෙන් ඉවත් ව නො පවතිත්. “ආයුෂ්මත් තෙමේ යමක් පිණිස ගිහිගෙන් නික්ම පැවිද්දට පැමිණියේ ද, ඔබ විසින් ඒ ශ්‍රාමණ්‍යාර්‍ථය නො ලද්දේ ය. ඔබ ඒ ශ්‍රාමණ්‍යාර්‍ථය නො ලැබ ‘මෙය තොපට වැඩ පිණිස වේ, මෙය තොපට සුව පිණිස වේ’ යැ යි සව්වනට දහම දෙසති. සව්වෝ ඒ ඔබගේ වචනය අසනු කැමැති වෙත්. කන් යොමු කෙරෙත්. දැන ගැන්ම පිණිස සිත එළවා තබත්. ශාස්තෘශාසනයෙන් ඉවත් වැ නො ද පවතිත්. සිය කෙත හැරැ දමා අනුන්ගේ කෙතක් (වල් පැලෑටි උදුරා) ශුද්ධ කළ යුතු කොට සිතන්නේ යම්සේ ද, එසේ මේ කරුණ ලාමක වූ ලෝභධර්‍මයක් කොට කියමි. එබඳු ශාස්තෘ වූ අන් තැනැත්තේ අනෙකකුට කවර වැඩක් කරන්නේ දැ”යි ඒ ශාස්තෘ තෙම චෝදනා ලැබිය යුතු වන්නේ ය. ලෝභිච්වය, ලොව, යමෙක් චෝදනාර්හ නම්, මේ ඒ දෙවෙනි ශාස්තෘ ය. යමෙකුත් මෙබඳු ශාස්තෘවරයකුට චෝදනා කෙරේ නම්, ඒ චෝදනාව භූත ය, සත්‍ය ය, දැහැමි ය, නො වැරැදි ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "16. තව ද අනෙකක් කියමි. ලෝහිච්චය, මෙහි එක්තරා ශාස්තෘවරයෙක් යමක් පිණිස ගිහිගෙන් නික්ම පැවිද්දට වන්නේ වේ ද, ඔහු විසින් ඒ ශ්‍රාමණ්‍යාර්‍ථය ලදුයේ වෙයි. හේ ඒ ශ්‍රාමණ්‍යාර්‍ථය ලැබ, ‘මෙය තොපට වැඩ පිණිස වෙයි. මෙය තොපට සුව පිණිස වේ’ යැ යි සව්වනට දහම් දෙසයි. සව්වෝ ඔහු බස අසන්නට නො කැමති වෙත්, ඔහුට කන් යොමු නොකෙරෙත්. දැන ගනු පිණිස සිත එළවා නො තබත්. ඒ ශාස්තෘහුගේ අනුශාසනයෙන් බැහැර ව ද පවතිත්. හෙ තෙම මෙසේ චෝදනා ලැබිය යුතු වන්නේ ය: “ආයුෂ්මත් වනාහි යමක් පිණිස ගිහිගෙන් පැවිද්දට වන්නේ වේ ද, ඔබ විසින් ඒ ශ්‍රාමණ්‍යාර්‍ථය ලද්දේ ය. ඔබ ඒ ශ්‍රාමණ්‍යාර්‍ථය ලැබ, ‘මෙය තොපට වැඩ පිණිස වේ. මෙය තොපට හිත පිණිස වේ’ යැ යි සව්වනට දහම් දෙසති. සව්වෝ ඒ ඔබේ බස් අසනු කැමැති නො වෙත්. ඔබ බසට කන් යොමු නො කෙරෙත්. දැන ගැන්මට සිත එළවා නො තබත්. ඹබ අනුශාසනයෙන් බැහැර ව ද පවතිත්. පරණ බැඳුමක් සිඳ අන් අළුත් බැඳුමක් කරන්නේ යම්සේ ද, මෙසේ මෙ කරුණ ලාමක ලෝභධර්‍මයක් කොට කියමි. එ බඳු ශාස්තෘ වූ අන් තැනැත්තේ අනෙකකුට කවර වැඩක් නම් කරන්නේ දැ”යි ඒ ශාස්තෘ තෙමේ චෝදනා ලැබිය යුතු වන්නේ ය. ලෝභිච්චය, ලොවැ යමෙක් චෝදනා ලැබීමට සුදුසු ද, මේ ඒ තෙවෙනි ශාස්තෘ ය. යමෙකුත් මෙබඳු ශාස්තෘ හට චෝදනා කෙරේ නම්, ඒ චෝදනාව භූත ය, සත්‍ය ය, දැහැමි ය, නොවැරැදි ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 552,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො ලොහිච්ච තයො සත්ථාරො යෙ ලොකෙ චොදනාරහා, යො ච පනෙවරූපෙ සත්ථාරො චොදෙති, සා චොදනා භූතා තච්ඡා ධම්මිකා අනවජ්ජා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "17. එවං වුත්තෙ ලොහිච්චො බ්රාහ්මණො භගවන්තං එතදවොච: “අත්ථි පන භො ගොතම කො චි සත්ථා යො ලොකෙ න චොදනාරහො?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අත්ථි ඛො ලොහිච්ච සත්ථා යො ලොකෙ න චොදනාරහො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“කතමො පන සො භො ගොතම සත්ථා යො ලොකෙ න චොදනාරහො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "18. ඉධ ලොහිච්ච තථාගතො ලොකෙ උප්පජ්ජති අරහං සම්මාසම්බුද්ධො විජ්ජාචරණසම්පන්නො සුගතො ලොකවිදූ අනුත්තරො පුරිසදම්මසාරථි සත්ථා දෙවමනුස්සානං බුද්ධො භගවා. සො ඉමං ලොකං සදෙවකං සමාරකං සබ්රහ්මකං සස්සමණබ්රාහ්මණිං පජං සදෙවමනුස්සං සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදෙති. සො ධම්මං දෙසෙති ආදිකල්යාණං මජ්ඣෙකල්යාණං පරියොසානකල්යාණං සාත්ථං සබ්යඤ්ජනං කෙවලපරිපුණ්ණං පරිසුද්ධං බ්රහ්මචරියං පකාසෙති. තං ධම්මං සුණාති ගහපති වා ගහපතිපුත්තො වා අඤ්ඤතරස්මිං වා කුලෙ පච්චාජාතො. සො තං ධම්මං සුත්වා තථාගතෙ සද්ධං පටිලභති. සො තෙන සද්ධාපටිලාභෙන සමන්නාගතො ඉති පටිසංචික්ඛති: “සම්බාධො ඝරාවාසො රජාපථො{1}. අබ්භොකාසො පබ්බජ්ජා. නයිදං සුකරං අගාරං අජ්ඣාවසතා එකන්තපරිපුණ්ණං එකන්තපරිසුද්ධං සඞ්ඛලිඛිතං බ්රහ්මචරියං චරිතුං. යන්නූනාහං කෙසමස්සුං ඔහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජෙය්ය”න්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "19. සො අපරෙන සමයෙන අප්පං වා භොගක්ඛන්ධං පහාය මහන්තං වා භොගක්ඛන්ධං පහාය අප්පං වා ඤාතිපරිවට්ටං පහාය මහන්තං වා ඤාතිපරිවට්ටං පහාය කෙසමස්සුං ඔහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජති. සො එවං පබ්බජිතො සමානො පාතිමොක්ඛසංවරසංවුතො විහරති ආචාරගොචරසම්පන්නො අණුමත්තෙසු වජ්ජෙසු භයදස්සාවී, සමාදාය සික්ඛති සික්ඛාපදෙසු කායකම්මෙන සමන්නාගතො කුසලෙන, පරිසුද්ධාජීවො සීලසම්පන්නො ඉන්ද්රියෙසු ගුත්තද්වාරො භොජනෙ මත්තඤ්ඤූ සතිසම්පජඤ්ඤෙන සමන්නාගතො සන්තුට්ඨො."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. රජොපථො - කත්ථචි"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ලෝභිච්චය, ලොවැ යම් කෙනෙක් චොදනාර්‍හ ද, මේ ඒ තුන් ශාස්තෘහු ය. යමෙකුත් මෙබඳු ශාස්තෘනට චෝදනා කෙරේ ද, ඒ චෝදනාව සැබෑ ය, සත්‍ය ය, දැහැමි ය, නො වැරැදි ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "17. මෙසේ වදාළ කල්හි ලෝහිච්ච බමුණු “පින්වත් ගොයුමාණනි, යමෙක් ලොවැ චෝදනා නො ලැබිය යුතු නම්, එසේ වූ කිසි ශාස්තෘවරයෙකුත් ඇද්ද?”යි භාග්‍යවතුන් වහන්සේ (අතින්) විචාළේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ලෝහිච්චය, යමෙක් ලොව චෝදනා ලැබිය යුතු නො වේ ද, එසේ වූ ශාස්තෘවරයෙක් ඇත් ම යැ”යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“පින්වත් ගොයුමාණනි, යමෙක් ලොවැ චෝදනාර්හ තො වේ නම්, ඒ ශාස්තෘ තෙම කවරේ දැ?” යි ලෝභිච්ච බමුණු පුළුවුත.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "18. ලෝභිච්වය, මෙහි අර්හත් වූ සම්‍යක්සම්බුද්ධ වූ විද්‍යාචරණසම්පන්න වූ සුගත වූ ලෝකවිත් වූ නිරුත්තර පුරුෂදම්‍යසාරථි වූ දෙව්මිනිස්නට ශාස්තෘ වූ බුද්ධ වූ භගවත් වූ තථාගත තෙමේ ලොවැ පහළ වෙයි. හේ දෙවියන් සහිත වූ මරුන් සහිත වූ බඹුන් සහිත වූ මේ ලෝකය ද, මහණබමුණන් සහිත සම්මත දෙවියන් (රජුන්) හා සෙසු මිනිසුන් හා සහිත සත්ත්‍වප්‍රජාව ද තෙමේ විශිෂ්ට නුවණින් දැන, ප්‍රත්‍යක්‍ෂ කොට, (ඔවුනට) අවබෝධ කරවයි. හේ දහම් දෙසනුයේ ආදියෙහි භද්‍රක (නිවරද) කොට, මධ්‍යයෙහි භද්‍රක කොට, අවසනැ භද්‍රක කොට, අර්ථ සහිත කොට, ව්‍යඤ්ජන සහිත කොට, සර්‍වප්‍රකාරයෙන් පරිපූර්‍ණ කොට පරිශුද්ධ කොට දහම් දෙසයි. (එසේ දෙසනුයේ ශික්‍ෂාත්‍රයයෙන් සංගෘහිත වූ) ශාසනබ්‍රහ්මචර්‍යය ප්‍රකාශ කෙරෙයි. ගැහැවියෙක් හෝ ගැහැවිපුතෙක් හෝ අන් එක්තරා කුලයෙක උපන්නෙක් හෝ ඒ ධර්‍මය අසයි. හේ ඒ දහම් අසා තථාගත බුදුරජුහු කෙරෙහි සැදැහැ ඇති කෙරෙයි. හේ ඒ ශ්‍රද්ධාලාභයෙන් සමන්විත වූයේ, ‘ගිහිගෙයි විසීම සම්බාධයෙකි, රජස්පථයෙකි, පැවිද්ද (සම්බාධ නැති) අභ්‍යවකාශය (එළිමහන) වැන්න. ගිහිගෙයි වසන්නහු විසින් එකාන්තයෙන් පිරිසිදු කොට, ශඞ්ඛලිඛිතයක් සේ කොට මේ බඹසර සරන්නට පහසු නො වේ. (එබැවින්) මම් කෙහෙරවුලු බහවා, කසාවත් හැඳ පෙරෙවැ, ගිහිගෙන් පැවිදිබිමට වදනෙම් නම් යෙහෙකැ”යි මෙසේ නුවණින් සලකයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "19. හේ පසු කලෙක අල්ප වූ හෝ සම්පත් රැස හැරැ, මහත් වූ හෝ සම්පත් රැස හැරැ, මඳ වූ හෝ නෑපිරිස හැරැ, මහත් වූ හෝ නෑපිරිස හැරැ, කෙහෙරවුලු බහවා, කසාවත් හැඳ පෙරෙවැ, ගිහිගෙන් පැවිදිබිම්ට වදී. හේ මෙසේ පැවිදි වූයේ ම පාතිමොක්ඛසංවරයෙන් සමන්විත වූයේ, ආචාරයෙන් හා ගෝචරයෙන් හා යුක්ත වූයේ, ස්වල්පමාත්‍ර වූ ද වරදෙහි බිය දක්නේ, නොවැරැදි වූ කායවාක්කර්‍මයෙන් සමන්විත වූයේ, එහෙයින් ම පිරිසිදු ආජීව ඇතියේ, සිල්වත් වූයේ, ඉන්ද්‍රියයන්හි වැසූ දොර ඇතියේ, බොජුන්හි පමණ දන්නේ, (සත් තන්හි) සිහියෙත් හා නුවණින් හා යුක්ත වූයේ, සිවුපසයෙහි තුත් වැදෑරුම් සතුටින් සතුටු වූයේ, ශික්‍ෂාපදයන්හි සමාදන් වැ ගෙන හික්මෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 554,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "20. කථඤ්ච ලොහිච්ච භික්ඛු සීලසම්පන්නො හොති? ඉධ ලොහිච්ච භික්ඛු පාණාතිපාතං පහාය පාණාතිපාතා පටිවිරතො හොති නිහිතදණ්ඩො නිහිතසත්ථො ලජ්ජී දයාපන්නො සබ්බපාණභූතහිතානුකම්පී විහරති. ඉදම්පි’ස්ස හොති සීලස්මිං. අදින්නාදානං පහාය අදින්නාදානා පටිවිරතො හොති දින්නාදායී දින්නපාටිකඞ්ඛී අථෙනෙන සුචිභූතෙන අත්තනා විහරති. ඉදම්පි’ස්ස හොති සීලස්මිං. අබ්රහ්මචරියං පහාය බ්රහ්මචාරී හොති ආරාචාරී{1} විරතො මෙථුනා ගාමධම්මා. ඉදම්පි’ස්ස හොති සීලස්මිං. මුසාවාදං පහාය මුසාවාදා පටිවිරතො හොති සච්චවාදී සච්චසන්ධො ථෙතො{2} පච්චයිකො අවිසංවාදකො ලොකස්ස. ඉදම්පි’ස්ස හොති සීලස්මිං. පිසුණං වාචං පහාය පිසුණාය වාචාය පටිවිරතො හොති: ඉතො සුත්වා න අමුත්ර අක්ඛාතා ඉමෙසං භෙදාය, අමුත්ර වා සුත්වා න ඉමෙසං අක්ඛාතා අමූසං භෙදාය; ඉති භින්නානං වා සන්ධාතා, සංහිතානං වා අනුප්පදාතා, සමග්ගාරාමො සමග්ගරතො සමග්ගනන්දී සමග්ගකරණිං වාචං භාසිතා හොති. ඉදම්පි’ස්ස හොති සීලස්මිං. ඵරුසං වාචං පහාය ඵරුසාය වාචාය පටිවිරතො හොති. යා සා වාචා නෙළා කණ්ණසුඛා පෙමනීයා{3} හදයඞ්ගමා පොරී බහුජනකන්තා බහුජනමනාපා, තථාරූපිං{4} වාචං භාසිතා හොති. ඉදම්පි’ස්ස හොති සීලස්මිං. සම්ඵප්පලාපං පහාය සම්ඵප්පලාපා පටිවිරතො හොති කාලවාදී භූතවාදී අත්ථවාදී ධම්මවාදී විනයවාදී. නිධානවතිං වාචං භාසිතා හොති කාලෙන සාපදෙසං පරියන්තවතිං අත්ථසඤ්හිතං. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "21. සො බීජගාමභූතගාමසමාරම්භා පටිවිරතො හොති. එකභත්තිකො හොති රත්තූපරතො පටිවිරතො විකාලභොජනා. නච්චගීතවාදිතවිසූකදස්සනා පටිවිරතො හොති. මාලාගන්ධවිලෙපනධාරණමණ්ඩනවිභූසනට්ඨානා පටිවිරතො හොති. උච්චාසයනමහාසයනා පටිවිරතො හොති. ජාතරූපරජතපටිග්ගහණා පටිවිරතො හොති. ආමකධඤ්ඤපටිග්ගහණා පටිවිරතො හොති. ආමකමංසපටිග්ගහණා පටිවිරතො හොති. ඉත්ථිකුමාරිකපටිග්ගහණා පටිවිරතො හොති. දාසිදාසපටිග්ගහණා පටිවිරතො හොති -"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අනාචාරී - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ඨෙතො - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. පෙමනියා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. එවරූපිං - කත්ථචි"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "20. ලෝහිච්චය, මහණ තෙමේ කෙසේ නම් සිල්වත් වේ ද යත්: ලෝභිච්වය, මෙහි මහණ තෙමේ ප්‍රාණඝාතය හැරැලා ප්‍රාණඝාතයෙන් වෙසෙසින් වැළැක්කේ වෙයි. බහා තැබු දඬුමුගුරු ඇත්තේ (දඬුමුගුරු නො දරන්නේ), බහා තැබූ ආයුධ ඇත්තේ (ආයුධ නො දරන්නෝ), පවට පිළිකුල් කරන්නෝ, මෛත්‍රියට පැමිණියේ (මෛත්‍රියෙන් යුක්ත වූයේ), සියලු සතුන් කෙරෙහි හිතානුකම්පා ඇති වැ වෙසේ. මේ ද ඔහුගේ ශීලයෙක් වේ. හේ අදත්තාදානය හැරැ ලා නොදුන් දෑ ගැන්මෙන් වැළැක්කේ වෙයි. දුන් දැය ම පිළිගන්නාසුලු වූයේ, දුන් දැය ම කැමැති වැ ඉවසනසුලු වූයේ, නොසොර වූ පිරිසිදු සිතින් යුතු වැ වෙසේ. මේ ද ඔහුගේ ශීලයෙක් වේ. හේ අබ්රමසර දුරැ ලා බඹසර සරන්නෝ වෙයි. ගැමිදහමක් වූ මෙවුන්දමින් දුරු වැ හැසිරෙන්නේ, එයින් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ. හේ බොරු කීම දුරැ ලා බොරු කීමෙන් වැළැක්කේ වෙයි. ඇත්ත කියනසුලු වූයේ, ඇත්තෙන් ඇත්ත ගළපා කියන්නේ, තහවුරු වැ පිහිටි කථා ඇත්තේ, ඇදැහිය යුතු කථා ඇත්තේ, ලොව නො රවටන්නේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ. හේ කේලාම් කීම දුරැ ලා කේලාම් කීමෙන් වැළැක්කේ වේ. මේ තැනින් අසා මොවුන් (ඔවුන්ගෙන්) බිඳුවනු පිණිස එතැන්හි නො කියනසුලු වූයේ, එ තැනින් අසා ඔවුන් (මොවුන්ගෙන්) බිඳුවනු පිණිස මේ තන්හි නො කියනසුලු වූයේ, මෙසේ බිඳුණවුන් ගළපන්නෝ (සමග කරන්නේ) ද, එකට ගැළැපුණවුන් (සමගියට පැමිණියවුන්) හට රුකුල් දෙන්නේ ද වෙයි. සමගියෙන් සිටින්නවුන් හා වාසය කැමැත්තේ, සමගියෙන් වසන්නවුනට කැමැත්තේ, සමග වැ සිටින්නවුනට සතුටු වනුයේ, සමගිය ඇති කරන බස් කියන්නෝ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ. හෝ රළු බිණුම් දුරැ ලා රළු බස් දෙඩුමෙන් වැළැක්කේ වෙයි. නිදොස්, කන්කලු, පෙම් උපදවන, පහසුවෙන් සිතැ වැදගන්නා, නොගැමි, බොහෝ දෙනාට ප්‍රිය, බොහෝ දෙනාගේ මන වඩන යම් බසෙක් වේ ද, එබඳු වූ බස් කියන්නේ වෙයි. මෙ ද ඔහුගේ ශීලයෙක් වේ. හේ බොල් හිස් දෙඩැවිලි හැරැලා බොල් දෙඩැවිල්ලෙන් වැළැක්කේ වෙයි. සුදුසු කාලවේලායෙහි කථා කරනසුලු වූයේ, ඇත්ත ම කියනසුලු වූයේ, වැඩ සලසන බසක් ම කියනසුලු වූයේ, නව ලොවුතුරුදහම් ඇසුරු කොට ම කියනසුලු වූයේ, හික්මීම ඇති කරන බසක් ම කියනසුලු වූයේ, සිතැ තබා ගන්නට සුදුසු වූ, කරුණු සහිත වූ, ඉමක් කොනක් ඇති (ප්‍රමාණවත් වූ), දෙලෝ වැඩ හා සම්බද්ධ වූ ම බසක් සුදුසු කාලයෙහි කියන්නේ වෙයි. මෙ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "21. හේ බීජසමූහ (පැළ වන දෑ) ද, භූතසමූහ (පැළ වුණු දෑ) ද සිඳීමෙන් බිඳීමෙන් වැළැක්කේ වෙයි. රෑ බොජුනෙන් වැළැක්කේ, එක් වේලේ වළඳන බත් ඇත්තේ, නොකල්බොජුනෙන් වැළැක්කේ වෙයි. නටනු ගනු වයනු විසුළුදසුන් යන මෙයින් වැළැක්කේ වෙයි. ඇඟැ අඩු තැන් පිරැවීමට, ඇඟ සැරැසීමට කරුණු වන මල්ගඳවිලෙවුන් දැරීමෙන් වැළැක්කේ වෙයි. පමණ ඉක්මි උසසුන් ද, නොකැප වූ මහඅසුන් ද යන දෙකින් ම වැළැක්කේ වෙයි. රන් රිදී මසු කහවණ පිළිගැන්මෙන් වැළැක්කේ වෙයි. අමු ධාන්‍ය පිළිගැන්මෙන් වැළැක්කේ වෙයි. අමු මස් පිළිගැන්මෙන් වැළැක්කේ වෙයි. ස්ත්‍රීන් කුමාරිකාවන් පිළිගැන්මෙන් වැළැක්කේ වෙයි. දැසිදසුන් පිළිගැන්මෙන් වැළැක්කේ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 556,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අජෙළකපටිග්ගහණා පටිවිරතො හොති. කුක්කුටසූකරපටිග්ගහණා පටිවිරතො හොති. හත්ථිගවාස්සවළවාපටිග්ගහණා පටිවිරතො හොති. ඛෙත්තවත්ථුපටිග්ගහණා පටිවිරතො හොති. දූතෙය්යපහිණගමනානුයොගා පටිවිරතො හොති. කයවික්කයා පටිවිරතො හොති. තුලාකූටකංසකූටමානකූටා පටිවිරතො හොති. උක්කොටනවඤ්චනනිකතිසාචියොගා පටිවිරතො හොති. ඡෙදනවධබන්ධනවිපරාමොසආලොපසහසාකාරා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "22. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි __භු__ඤ්ජිත්වා තෙ එවරූපං බීජගාමභූතගාමසමාරම්භං අනුයුත්තා විහරන්ති, සෙය්යථිදං: මූලබීජං ඛන්ධබීජං ඵලුබීජං අග්ගබීජං බීජබීජමෙව පඤ්චමං. ඉති වා ඉති එවරූපා බීජගාමභූතගාමසමාරම්භා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "23. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි __භු__ඤ්ජිත්වා තෙ එවරූපං සන්නිධිකාරපරිභොගං අනුයුත්තා විහරන්ති, සෙය්යථිදං: අන්නසන්නිධිං පානසන්නිධිං වත්ථසන්නිධිං යානසන්නිධිං සයනසන්නිධිං ගන්ධසන්නිධිං ආමිසසන්නිධිං. ඉති වා ඉති එවරූපා සන්නිධිකාරපරිභොගා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "24. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි __භු__ඤ්ජිත්වා තෙ එවරූපං විසූකදස්සනං අනුයුත්තා විහරන්ති, සෙය්යථිදං: නච්චං ගීතං වාදිතං පෙක්ඛං අක්ඛානං පාණිස්සරං වෙතාලං කුම්භථූනං සොභනකං චණ්ඩාලං වංසං ධොපනකං හත්ථියුද්ධං අස්සයුද්ධං මහිසයුද්ධං උසභයුද්ධං අජයුද්ධං මෙණ්ඩයුද්ධං කුක්කුටයුද්ධං වට්ටකයුද්ධං දණ්ඩයුද්ධං මුට්ඨියුද්ධං නිබ්බුද්ධං උය්යොධිකං බලග්ගං සෙනාබ්යූහං අණීකදස්සනං. ඉති වා ඉති එවරූපා විසූකදස්සනා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "එළුවන් බැටෙඑවන් පිළිගැන්මෙන් වැළැක්කේ වෙයි. කුකුළන් හූරන් පිළිගැන්මෙන් වැළැක්කේ වෙයි. ඇතුන් අසුන් වෙළෙඹුන් ගෙරින් පිළිගැන්මෙන් වැළැක්කේ වෙයි. කෙත්වතු පිළිගැන්මෙන් වැළැක්කේ වෙයි. ගිහියනට දූත මෙහෙවර කිරීමෙහි ද ගෙන් ගෙට පණිවුඩ පණත් ගෙන යෑමෙහි ද යෙදීමෙන් වැළැක්කේ වෙයි. වෙළෙඳ ගනුදෙනුයෙන් වැළැක්කේ වෙයි. හොරතරාදියෙන් කිරුමෙන්, බොරු රන් පෑමෙන්, හොර මිනුම්වලින් මිනුමෙන් වැළැක්කේ වෙයි. අල්ලස් ගෙන හිමියන් නොහිමි කිරිමෙන්, නානා උපායයෙන් අනුන් රැවැටීමෙන්, අගනා දැයට හුරු නොඅගනා දැයක් පෙන්නා කරන මායායෙන්, මෙ කී නොකී හැම කෛරාටික කම්වලින් ම වැළැක්කේ වෙයි. අත් පා ආදිය සිඳීමෙන් ද, මැරීමෙන් ද, රැහැන් ආදියෙන් බැඳීමෙන් ද, සැහැසිකම් කිරීමෙන් ද වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "22. යම්සේ සමහර භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, මූලවීජ ද (හිඟුරු ආදි පැළ වන මුල් ද), ස්කන්‍ධ වීජ ද (නුග ආදි පැළ වන කඳ ද), පරුවීජ ද (උක් උණ බට ආදි පැළ වන පුරුක් ද), අග්‍රවීජ ද (ඉරිවේරිය ආදි පැළ වන දලු ද), පස් වනු වීජවීජ ද (වී ආදි පැළ වන ඇට ද) යන මෙ කී වීජසමුහ ද (පැළ වත දෑ ද) භූතසමූහ ද (පැළ වුණු දෑ ද) පෙළීමෙහි (සිඳුම් බිදුම් තැළුම් යැ යි) කියන ලද සමාරම්භයෙහි යෙදුණෝ වෙසෙත් ද, හෙ තෙමේ මෙ හෝ මෙ බඳු වූ වීජග්‍රාමභූතග්‍රාමසමාරම්භයෙන් වැළැක්කේ වෙයි. මෙම ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "23. යම්සේ ඇතැම් භවත් මහණබමුණූ කෙනෙක් සැදැහැයෙන් දුන් බොජුන් වළඳා, කන දෑ රැස් කොට තබා ගැන්ම, බොන් දෑ රැස් කොට තබා ගැන්ම, වස්ත්‍ර රැස් කොට තබා ගැන්ම (රිය ගැල් ආදිය පාවහන් ආදිය ද යන) යාන රැස් කොට තබා ගැන්ම, ඉහතැ කී දෑ හැර (තවත් තල සහල් ඈ වුවමනා) පසය රැස් කොට තබා ගැන්ම යන මෙසේ වූ සන්නිධිකාරපරිභෝගයෙහි (පසය රැස් කොට තබා ගෙන වැළැඳීමෙහි) යෙදී වෙසෙත් ද, හෙ තෙමේ මේ හෝ මෙබඳු වූ හෝ සන්නිධිකාර පරිභෝගයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "24. යම්සේ සමහර භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, නැටුම් ගැයුම් වැයුම්, නටසමජ්ජා (නළුවන් සමූහයක් එක් වැ ජනසමූහයා ඉදිරියේ දක්වන නැටුම්), ආඛ්‍යාන (මහාභාරතාදිය කීම හෝ ඇසීම), පාණිස්වර (අතින් ලොහොබෙර ගැසුම හෝ අත්තල ගැසුම), වේතාල (දඬුමුවා තාළම්පට ගැසීම් හෝ මතුරු දපා මළසිරුරු නැගිටුවීම), කුම්හථූන (සිවුරස් බෙර වැයුම), ශෝභනක (රංගබලිකරණය හෙවත් රඟමඩුල්ලෙහි දී දේවතාවනට ස්තෝත්‍ර වශයෙන් නාන්දිගීත ගායනය හෝ ප්‍රතිහානචිත්‍ර කිරීම), සණදොවුන් කෙළිය (හෝ අයෝගුඩක්‍රීඩාව), උණගස් ඔසොවා ගෙන කරන ක්‍රීඩාව, අස්ථිධාවනය (මළවුන්ගේ ඇට සෝදා සුවඳ කවා තබා නකත්සෙමෙහි ඊ වටා සිට උත්සව කිරීම), ඇත්පොර, අස්පොර, මියුපොර, ගොන්පොර, එළුපොර, බැටෙළුපොර, කුකුළුපොර, වටුපොර, පොලුහරඹ, මිටුයුද, මල්ලපොර, යුද පවත්තා තැන් දක්නට යෑම, බළසෙන් ගණිනා තැන් දක්නට යෑම යන මෙබඳු විසුළු දස්නෙහි යෙදී වෙසෙත් ද, හෙ තෙමේ මේ හෝ මෙ බඳු වූ විසුළු දස්නෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 558,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "25. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං ජූතප්පමාදට්ඨානානුයොගං අනුයුත්තා විහරන්ති, සෙය්යථිදං: අට්ඨපදං දසපදං ආකාසං පරිහාරපථං සන්තිකං ඛලිකං ඝටිකං සලාකාහත්ථං අක්ඛං පඞ්ගචීරං වඞ්කකං මොක්ඛචිකං චිඞ්ගුලකං පත්තාළ්හකං රථකං ධනුකං අක්ඛරිකං මනෙසිකං යථාවජ්ජං. ඉති වා ඉති එවරූපා ජූතප්පමාදට්ඨානානුයොගා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "26. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි __භු__ඤ්ජිත්වා තෙ එවරූපං උච්චාසයනමහාසයනං අනුයුත්තා විහරන්ති, සෙය්යථිදං: ආසන්දිං පල්ලඞ්කං ගොනකං චිත්තකං පටිකං පටලිකං තූලිකං විකතිකං උද්දලොමිං එකන්තලොමිං කට්ඨිස්සං කොසෙය්යං කුත්තකං හත්ථත්ථරං අස්සත්ථරං රථත්ථරං අජිනප්පවෙණිං කාදලිමිගපවරපච්චත්ථරණං සඋත්තරච්ඡදං උභතොලොහිතකූපධානං ඉති වා ඉති එවරූපා උච්චාසයනමහාසයනා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "27. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි __භු__ඤ්ජිත්වා තෙ එවරූපං මණ්ඩනවිභූසනට්ඨානානුයොගං අනුයුත්තා විහරන්ති, සෙය්යථීදං: උච්ඡාදනං පරිමද්දනං නහාපනං සම්බාහනං ආදාසං අඤ්ජනං මාලාවිලෙපනං මුඛචුණ්ණකං මුඛලෙපනං හත්ථබන්ධං සිඛාබන්ධං දණ්ඩකං නාළිකං ඛග්ගං ඡත්තං චිත්රෑපාහනං උණ්හීසං මණිං වාළවීජනිං ඔදාතානි වත්ථානි දීඝදසානි. ඉති වා ඉති එවරූපා මණ්ඩනවිභූසනට්ඨානානුයොගා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "28. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි __භු__ඤ්ජිත්වා තෙ එවරූපං තිරච්ඡානකථං අනුයුත්තා විහරන්ති, සෙය්යථිදං: රාජකථං චොරකථං මහාමත්තකථං සෙනාකථං භයකථං යුද්ධකථං අන්නකථං පානකථං වත්ථකථං සයනකථං මාලාකථං ගන්ධකථං ඤාතිකථං යානකථං ගාමකථං නිගමකථං නගරකථං ජනපදකථං ඉත්ථිකථං පුරිසකථං [කුමාරකථං කුමාරිකථං] සූරකථං විසිඛාකථං කුම්භට්ඨනකථං පුබ්බපෙතකථං නානත්තකථං ලොකක්ඛායිකං සමුද්දක්ඛායිකං ඉතිභවාභවකථං. ඉති වා ඉති එවරූපාය තිරච්ඡානකථාය පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "25. යම්සේ සමහර භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළදා, අටපාකෙළිය, දසපාකෙළිය, අහස්දූකෙළිය, මඬුලු පැනුම්, සන්තිකාක්‍රීඩාව, දාදුකෙළිය, කල්ලි ගැසුම්, සලාඅත්කෙළිය, ගුළකෙළිය, කොළනළා පිඹුම්, කෙළිනඟුලින් හෑම, කරණම් ගැසුම්, කන්නංගුරුවා කෙළිය, කොළනැළියෙන් වැලි ඈ මැනුම, ක්‍රීඩාරථ පැදැවීම, කුඩා දුන්නේ විදීම, ඇකිරිකෙළිය (පිටේ හෝ අහසේ අකුරු ඇඳ ඒ කියැවීම), සිතු දැය කීමේ ක්‍රීඩාව, විකලාංගානුකරණය (කනුන් කොරුන් යන ආදීන් සේ ඉරියවු පැවැත්වීම) යන මෙබඳු වූ පමාවට කරුණු වූ දූකෙළියෙහි යෙදී වෙසෙත් ද, හෙ තෙමේ මේ හෝ මේ බඳු වූ පමාවට කරුණු වූ දූකෙළියෙහි යෙදීමෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "26. යම්සේ ඇතැම් භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, දික්සඟළා පුටු ය, පළඟය, මහකොඳුපලසය, වියමනෙන් විසිතුරු කළ එළුලොම්මුවා ඇතිරිය, එළුලොම්මුවා සුදු ඇතිරිය, ගනමල් යෙදූ එළුලොම් ඇතිරිය, තිලිය (පුලුන් මෙත්තය), සිංහරූපාදි රූපවලින් විසිතුරු කළ එළුලොම් ඇතිරිය, දෙපැත්තේ ම ලොම් ඇති එළුලොම්මුවා ඇතිරිය, එක් පැත්තේ පමණක් ලොම් ඇති එළුලොම්මුවා ඇතිරිය, රන්කසුකම් කළ පසතුරුණ, කොසෙය්‍ය හුයින් වියූ ඇතිරිය, ඇතු පිට එළන ඇතිරිය, අසු පිටැ එළන ඇතිරිය, රියැ එළන ඇතිරිය, ඇඳට සරි ලන සේ අඳුන් දිවිසමින් මසා කළ ඇතිරිය, කෙහෙල්මුවසමින් කළ මහඟු පසතුරුණ, ඉස්දොර පාමුල රත්කන්වයින් තබා ඇති රතු උඩුවියන් සහිත මහඟු යහන යන මෙබඳු වූ උස්යහන් මහයහන් පරිහරණය කිරීමෙහි යෙදී වෙසෙද් ද, හෙ තෙමේ මේ හෝ මෙ බඳු වූ උස්සහන් මහයහන් පරිභෝගයෙන් වැළැක්කේ වෙයි. ‍මේ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "27. යම්සේ ඇතැම් භවත් මහණඛමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, සුවඳසුණුයෙන් ඇඟ ඉළීම, අත්පාඈහි මනා සටහන් ගන්වනුවට තෙල් ගා මැඩීම්, සුවඳ දියෙන් නෑවීම, උරහිස්ඈහි මස් වැඩෙනුවව මුගුරින් තැළීම, කැඩපතින් මුහුණ බැලීම, අලංකාර වශයෙන් අඳුන් ගෑම, මල් පැලැඳීම හා විලෙවුන් දැරීම, මුවසුණු මුවවිලෙවුන් දැරීම, හස්තාභරණ දැරීම, හිසැ කුඩුම්බිය බැඳීම, විසිතුරු සරයටි දැරීම, විසිතුරු බෙහෙත්නළ දැරීම, කඩු දැරීම, විසිතුරු කුඩ දැරීම, විසිතුරු පාවහන් දැරීම, නලල්පට බැඳීම, සිළුමිණ පැලැඳීම, විසිතුරු සෙමෙර වල්විදුනා දැරීම, දික් දාවලු ඇති සුදු රෙදි හැඳීම යන ආදී ඇඟ අඩු තැන් පිරැවීමටත් ඇඟ සැරැසීමටත් කරුණු වන දෑ පරිභෝග කිරීමෙහි යෙදී වෙසෙත් ද, ඒ මහණ තෙමේ මේ හෝ මේ බඳු දෑ පරිභෝග කිරීමෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "28. යම්සේ වනාහි ඇතැම් භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, රාජකථා චෝරකථා මහාමාත්‍යකථා සේනාකථා භයකථා යුද්ධකථා ආහාරකථා පානකථා වස්ත්‍රකථා ශයනකථා මාලාකථා ගන්‍ධකථා ඥාතිකථා යානකථා ග්‍රාමකථා නිගමකථා නගරකථා ජනපදකථා ස්ත්‍රීකථා පුරුෂකථා (කුමාරකථා කුමාරිකථා) ශූරකථා වීථිකථා කුම්භස්ථානකථා නානාත්‍වකථා ලෝකාඛ්‍යායිකාකථා සමුද්‍රාඛ්‍යායිකථා ඉතිභවාභවකථා යන මෙ බඳු වූ තිරශ්වීන කථාවන්හි යෙදී වෙසෙත් ද, ඒ මහණ තෙමේ මෙ කී හෝ මෙයින් අන්‍ය වූ හෝ මේ බඳු කථාවලින් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 560,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "29. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං විග්ගාහිකකථං අනුයුත්තා විහරන්ති, සෙය්යථීදං: න ත්වං ඉමං ධම්මවිනයං ආජානාසි. අහං ඉමං ධම්මවිනයං ආජානාමි. කිං ත්වං ඉමං ධම්මවිනයං ආජානිස්සසි? මිච්ඡාපටිපන්නො ත්වමසි. අහමස්මි සම්මාපටිපන්නො. සහිතං මෙ, අසහිතං තෙ{1}. පුරෙ වචනීයං පච්ඡා අවච. පච්ඡා වචනීයං පුරෙ අවච. ආචිණ්ණං තෙ විපරාවත්තං ආරොපිතො තෙ වාදො. නිග්ගහීතො ත්වමසි. චර වාදප්පමොක්ඛාය. නිබ්බෙඨෙහි වා සචෙ පහොසීති. ඉති වා ඉති එවරූපාය විග්ගාහිකකථාය පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "30. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං දූතෙය්යපහිණගමනානුයොගමනුයුත්තා විහරන්ති, සෙය්යථිදං: රඤ්ඤං රාජමහාමත්තානං ඛත්තියානං බ්රාහ්මණානං ගහපතිකානං කුමාරානං “ඉධ ගච්ඡ අමුත්රාගච්ඡ. ඉදං හර. අමුත්ර ඉදං ආහරා”ති. ඉති වා ඉති එවරූපා දූතෙය්යපහිණගමනානුයොගා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "31. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි __භු__ඤ්ජිත්වා තෙ කුහකා ච හොන්ති ලපකා ච නෙමිත්තිකා ච නිප්පෙසිකා ච ලාභෙන ච ලාභං නිජිගිංසිතාරො. ඉති වා ඉති එවරූපා කුහනලපනා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "32. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති, සෙය්යථිදං: අඞ්ගං නිමිත්තං උප්පාතං සුපිනං ලක්ඛණං __මූ__සිකච්ඡින්නං අග්ගිහොමං දබ්බිහොමං ථුසහොමං __කණහොමං__ තණ්ඩුලහොමං සප්පිහොමං තෙලහොමං මුඛහොමං ලොහිතහොමං අඞ්ගවිජ්ජා වත්ථුවිජ්ජා ඛත්තවිජ්ජා සිවවිජ්ජා භූතවිජ්ජා භූරිවිජ්ජා අහිවිජ්ජා විසවිජ්ජා විච්ඡිකවිජ්ජා මූසිකවිජ්ජා __ස__කුණවිජ්ජා වායසවිජ්ජා පක්කජ්ඣානං සරපරිත්තානං මිගපක්ඛං. ඉති වා ඉති එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සංහිතං මෙ, අසංහිතං තෙ__?__"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "29. යම්සේ ඇතැම් භවත් මහණබමුණෝ සැදැහැයෙන් දුන්බොජුන් වළඳා, “තෝ මේ දහම් විනය නො දනිහි. මම් ම මේ දහම් විනය දනිමි. මේ දහම විනය කිමැ යි තෝ දනිහි ද? තෝ වරදවා පිළිපන්නෙහි. මම මැනැවින් පිළිපන්නෙම් වෙමි. මා බස කරුණු සහිත ය. තා බස කරුණු රහිත ය. තෝ පළමුයෙත් කියැ යුත්ත පසු වැ කීයෙහි ය. පසු වැ කියැ යුත්ත පළමුයෙන් කීයෙහි ය. තා කලක් ම පුහුණු කළ දැය මාගේ එක් වචනයෙන් ම පෙරැළී ගියේ ය. මා විසින් තට දොස් නැගිණ. මා විසින් නිගන්න ලද්දෙහි. මා නැඟූ දොසින් මිදෙන්නට හැසිරෙව (ඒ ඒ තැන ගොස් උගනුව). හැකි නම් එය විසඳව” යන ආදීන් මෙබඳු වූ උනුන් බැණ දොඩා ගැනුම්හි යෙදෙත් ද, ඒ මහණ තෙමේ මේ කී හෝ අන් මෙබඳු වූ හෝ බැණ දොඩා ගැන්මෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "30. යම්සේ සමහර භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා “මෙහි යන්නැ. අසෝ තැනට එන්නැ. මෙය ගෙනැ යන්නැ. අසෝ තැනට මෙය ගෙනෙන්නැ”යි කළ නියෝග පිළිගෙන, රජුන්ගේ රජමහඇමතියන්ගේ ක්‍ෂත්‍රියයන්ගේ බමුණන්ගේ ගැහැවියන්ගේ රජ කුමරුවන්ගේ මෙ බඳු දූත මෙහෙවරෙහි, පණිවුඩ ගෙන යෑමෙහි යෙදී වෙසෙත් ද, ඒ මහණ තෙමේ මෙ කී හෝ අන් මෙ වැනි වූ හෝ දූත මෙහෙවරින්, පණිවුඩ ගෙන යෑමෙන් වැළැක්කේ වෙයි. මෙ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "31. යම්සේ සමහර භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, කුහකකම් කරන්නෝ වෙත් ද, ලාභසත්කාර පතා අනුන් සිත් ඇදෙන සේ වූ චාටු බස් දොඩන්නෝ වෙත් ද, සිවු පසය ලබනු සඳහා කයින් හෝ බසින් ඇඟැවීම කරන්නෝ වෙත් ද, ලාභාපේක්‍ෂායෙන් අනුනට ගරහන්නෝ වෙත් ද, ලාභයෙන් ලාභය සොයන්නෝ වෙත් ද, ඒ මහණ තෙමේ මෙ කී ද යම් බඳු වූ ද කුහනලපනවලින් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "32. යම්සේ ඇතැම් භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, අංගශාස්ත්‍රය, නිමිත්තශාස්ත්‍රය, උත්පාතලක්‍ෂණය, ස්වප්නශාස්ත්‍රය, ලක්‍ෂණශාස්ත්‍රය, මුෂකච්ඡින්නවිද්‍යාව, අග්නිහෝමය, දර්වීහෝමය, තුෂහෝමය, කණහොමය, තණ්ඩුලහෝමය, සර්පිෂ්හෝමය, තෛලහෝමය, මුඛහෝමය, ලෝහිතහෝමය, අංගවිද්‍යාව, වාස්තුවිද්‍යාව, ක්‍ෂාත්‍රවිද්‍යාව, ශිවවිද්‍යාව, භූතවිද්‍යාව, භූරිවිද්‍යාව, අහිවිද්‍යාව, විෂවිද්‍යාව, වෘශ්චිකවිද්‍යාව, මූෂකවිද්‍යාව, ශාකුනවිද්‍යාව, වායසවිද්‍යාව, පක්වධ්‍යානය, ශරපරිත්‍රාණය, මෘගපක්‍ෂය යන මෙ කී හෝ මෙබඳු වූ හෝ තිරශ්චීනවිද්‍යායෙන්, මිථ්‍යාජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ මේ කී ද මේ බඳු වූ ද තීරශ්චීනවිද්‍යායෙන් මිථ්‍යාජීවයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 562,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "33. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි __භු__ඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති, සෙය්යථිදං: මණිලක්ඛණං වත්ථලක්ඛණං දණ්ඩලක්ඛණං අසිලක්ඛණං උසුලක්ඛණං ධනුලක්ඛණං ආවුධලක්ඛණං ඉත්ථිලක්ඛණං පුරිසලක්ඛණං කුමාරලක්ඛණං කුමාරිලක්ඛණං දාසලක්ඛණං දාසිලක්ඛණං හත්ථිලක්ඛණං අස්සලක්ඛණං මහිසලක්ඛණං උසභලක්ඛණං ගොලක්ඛණං අජලක්ඛණං මෙණ්ඩලක්ඛණං කුක්කුටලක්ඛණං වට්ටකලක්ඛණං ගොධාලක්ඛණං කණ්ණිකාලක්ඛණං කච්ඡපලක්ඛණං මිගලක්ඛණං. ඉති වා ඉති එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "34. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි __භු__ඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති සෙය්යථිදං: “රඤ්ඤං නිය්යානං භවිස්සති. රඤ්ඤං අනිය්යානං භවිස්සති. අබ්භන්තරානං රඤ්ඤං උපයානං භවිස්සති. බාහිරානං රඤ්ඤං අපයානං භවිස්සති. බාහිරානං රඤ්ඤං උපයානං භවිස්සති. අබ්භන්තරානං රඤ්ඤං අපයානං භවිස්සති. අබ්භන්තරානං රඤ්ඤං ජයො භවිස්සති. බාහිරානං රඤ්ඤං පරාජයො භවිස්සති. බාහිරානං රඤ්ඤං ජයො භවිස්සති. අබ්භන්තරානං රඤ්ඤං පරාජයො භවිස්සති. ඉති ඉමස්ස ජයො භවිස්සති. ඉමස්ස පරාජයො භවිස්සති.” ඉති වා ඉති එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "35. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි __භු__ඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති. සෙය්යථීදං: “චන්දග්ගාහො භවිස්සති. සුරියග්ගාහො භවිස්සති. නක්ඛත්තග්ගාහො භවිස්සති. චන්දිමසුරියානං පථගමනං භවිස්සති. චන්දිමසුරියානං උප්පථගමනං භවිස්සති. නක්ඛත්තානං පථගමනං භවිස්සති. නක්ඛත්තානං උප්පථගමනං භවිස්සති. උක්කාපාතො භවිස්සති. දිසාඩාහො භවිස්සති. භූමිචාලො භවිස්සති. දෙවදුන්දුභි භවිස්සති. චන්දිමසුරියනක්ඛත්තානං උග්ගමනං ඔගමනං සංකිලෙසං වොදානං භවිස්සති. එවංවිපාකො චන්දග්ගාහො භවිස්සති. එවංවිපාකො සුරියග්ගාහො භවිස්සති. __එවංවිපාකො නක්ඛත්තග්ගාහො භවිස්සති__. එවංවිපාකං චන්දිමසුරියානං පථගමනං භවිස්සති. එවංවිපාකං චන්දිමසුරියානං උප්පථගමනං භවිස්සති. එවංවිපාකං නක්ඛත්තානං පථගමනං භවිස්සති. එවංවිපාකං නක්ඛත්තානං උප්පථගමනං භවිස්සති. එවංවිපාකො උක්කාපාතො භවිස්සති. එවංවිපාකො දිසාඩාහො භවිස්සති. එවංවිපාකො භූමිචාලො භවිස්සති. එවංවිපාකො දෙවදුන්දුභි භවිස්සති. එවංවිපාකං චන්දිමසුරියනක්ඛත්තානං උග්ගමනං ඔගමනං සඞ්කිලෙසං වොදානං භවිස්සති.” ඉති වා ඉති එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "33. යම්සේ ඇතැම් භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, මිණිලකුණු, වත්ලකුණු, දඬුලකුණු, කඩුලකුණු, ඊලකුණු, දුනුලකුණු, අවිලකුණු, ඉතිරිලකුණු, පුරිස්ලකුණු, කුමරලකුණු, කුමරිලකුණු, දස්ලකුණු, දැසිලකුණු, ඇත්ලකුණු, අස්ලකුණු, මියුලකුණු, වහප්ලකුණු, ගොන්කුණු, එළුලකුණු, බැටෙළුලකුණු, කුකුළුලකුණු, වටුලකුණු, ගොය්ලකුණු, කැණිලකුණු, කසුබුලකුණු, මුවලකුණු යන ආදි මෙ බඳු තිරශ්චීන විද්‍යායෙන්, මෙ බඳු මිථ්‍යාජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ මේ කී ද මෙබඳු වූ ද තීරශ්චීන විද්‍යායෙන් මිථ්‍යාජීවයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "34. යම්සේ ඇතැම් පින්වත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, “අසෝ දිනැ අසෝ නැකැතින් (යුද සඳහා) සිය නුවරින් අසෝ රජුන්ගේ නික්මීම වන්නේ ය. අසෝ නැකැතින් පෙරළා සිය නුවරට ඊම වන්නේ ය. අසෝ නැකැතින් පිටතැ සිටින සතුරු රජුන් හමු වන්නට රට තුළ හුන් රජුන්ගේ යෑම වන්නේ ය. අසෝ නැකැතින් පිටතැ සිටින සතුරු රජුන්ගේ ඉවත් වැ යෑම වන්නේ ය. අසෝ නැකැතින් රට තුළැ සිටින රජුන් කරා පිටතැ සිටින සතුරු රජුන්ගේ පැමිණීම වන්නේ ය. අසෝ නැකැතින් ඇතුළතැ සිටින රජුන්ගේ ඉවත් වැ යෑම වන්නේ ය. රට ඇතුළතැ සිටින රජුනට ජය වන්නේ ය. පිටතැ සිටින සතුරු රජුනට පරාජය වන්නේ ය. පිටතැ සිටින සතුරු රජුනට ජය වන්නේ ය. රට තුළැ සිටින රජුනට පරාජය වන්නේ යැ” යි මෙසේ ‘මොහුට ජය වන්නේ ය. මොහුට පරාජය වන්නේ යැ’ යි කියමින් මෙ බඳු වූ තිරශ්චීනවිද්‍යායෙන්, මෙ බඳු වූ මිථ්‍යාජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ ‍මේ හෝ මේ බඳු වූ තිරශ්චිනවිද්‍යායෙන්, මිථ්‍යාජීවයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "35. යම්සේ වනාහි ඇතැම් භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, “අසෝ දිනැ චන්‍ද්‍රග්‍රහණය වන්නේ ය. අසෝ දිනැ සූර්‍යග්‍රහණය වන්නේ ය. අසෝ දිනැ සඳ හිරු දෙදෙනා නිසි මගින් යෑම වන්නේ ය. අසෝ දිනැ ඔවුන් නොමඟින් යැම වන්නේ ය. අසෝ දිනැ නකත්තරුන් නිසිමගින් යෑම වන්නේය. අසෝ දිනැ ඔවුන් නොමඟින් යෑම වන්නේ ය. අසෝ දිනැ උල්කාපතනය වන්නේ ය. දිග්දාහය වන්නේ ය. භූමිකම්පනය වන්නේ ය. වැසි නැති වැ අහස් ගෙරැවුම් වන්නේ ය. සඳහිරුන්ගේ ද නකත් තරුන්ගේ ද උදාව බැසීම කෙලෙසීම පිරිසිදුබව වන්නේ ය. චන්‍ද්‍රග්‍රහණය ලොවට මෙබඳු පල ගෙනැ දෙන්නේ ය. සූර්‍යග්‍රහණය මෙබඳු පල ගෙනැ දෙන්නේ ය. නක්‍ෂත්‍රග්‍රහණය මෙබඳු පල ගෙනැ දෙන්නේ ය. සඳ හිරුන් නිසි මගින් යෑම මෙබඳු පල ගෙනැ දෙන්නේ ය. සඳ හිරුන් දෙදෙනාගේ නොමගින් යෑම මේ බඳු පල ගෙනැ දෙන්නේ ය. නකත්තරුවල පථගමනය මෙබඳු පල ගෙනැ දෙන්නේ ය. ඔවුන්ගේ උත්පථගමනය මෙ බඳු පල ගෙනැ දෙන්නේ ය. උල්කාපතනය මෙ බදු පල ගෙනැ දෙන්නේ ය. දිග්දාහය මෙබඳු පල ගෙනැ දෙන්නේ ය. භූමිකම්පනය මෙබඳු පල ගෙනැ දෙන්නේ ය. වැසි නැති වැ අහස්ගෙරැවුම් මෙබඳු පල දෙන්නේ ය. සඳහිරුන්ගේ ද නකත්තරුවල ද උදාවත් බැසීමත් කෙලෙසීමත් පිරිසිදු වීමත් මෙ බඳු පල දෙන්නේ යැ” යි කියනුවෝ, මෙ බඳු තීරශ්චිනවිද්‍යායෙන් මෙ බඳු මිථ්‍යාජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ මේ හෝ මේ බඳු වූ තිරශ්චීනවිද්‍යායෙන්, මිථ්‍යාජීවිකායෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 564,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "36. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි __භු__ඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති. සෙය්යථිදං: “සුබ්බුට්ඨිකා භවිස්සති. දුබ්බුට්ඨිකා භවිස්සති. සුභික්ඛං භවිස්සති. දුබ්භික්ඛං භවිස්සති. ඛෙමං භවිස්සති. භයං භවිස්සති. රොගො භවිස්සති. ආරොග්යං භවිස්සති. මුද්දා ගණනා සංඛානං කාවෙය්යං ලොකායතං.” ඉති වා ඉති එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "37. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති. සෙය්යථිදං: ආවාහනං විවාහනං සංවදනං විවදනං සංකිරණං විකිරණං සුභගකරණං දුබ්භගකරණං විරුද්ධගබ්භකරණං ජිව්හානිත්ථම්භනං හනුසංහනනං හත්ථාභිජප්පනං හනුජප්පනං කණ්ණජප්පනං ආදාසපඤ්හං කුමාරිපඤ්හං දෙවපඤ්හං ආදිච්චුපට්ඨානං මහතුපට්ඨානං අබ්භුජ්ජලනං සිරිව්හායනං. ඉති වා ඉති එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "38. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි __භු__ඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති. සෙය්යථිදං: සන්තිකම්මං පණිධිකම්මං භූතකම්මං භූරිකම්මං වස්සකම්මං වොස්සකම්මං වත්ථුකම්මං වත්ථුපරිකිරණං ආචමනං නහාපනං ජුහනං වමනං විරෙචනං උද්ධවිරෙචනං අධොවිරෙචනං සීසවිරෙචනං කණ්ණතෙලං නෙත්තතප්පනං නත්ථුකම්මං අඤ්ජනං පච්චඤ්ජනං සාලාකියං සල්ලකත්තියං දාරකතිකිච්ඡා මූලභෙසජ්ජානං අනුප්පදානං ඔසධීනං පටිමොක්ඛො. ඉති වා ඉති එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "36. යම්සේ ඇතැම් පින්වත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, “මේ සමයෙහි වැසි වස්නේ ය. මේ සමයෙහි නියං වන්නේ ය. මේ සමයෙහි රට සුභික්‍ෂ වන්නේ ය. මේ සමයෙහි රට දුර්භික්‍ෂ වන්නේ ය. මේ සමයෙහි රටට උවදුරු වන්නේ ය. මේ සමයෙහි රටට බිය වන්නේ ය. මේ කලැ රෝග වන්නේ ය. මේ කලැ රෝග නැති බව වන්නේ යැ” යි පලාපල කීම ද, මුද්‍රාව (ඇඟිලි පුරුක්හි සංඥා තබා ගිණීම) ද, ගණනාව (එක දෙක යන ආදීන් ගිණීම) ද, කාව්‍යශාස්ත්‍රය, ලෝකායතශාස්ත්‍රය යන මේ හෝ මෙ බඳු තිරශ්චින විද්‍යායෙන්, මිථ්‍යාආජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ මේ හෝ මෙ බඳු වූ තිරශ්චිනවිද්‍යායෙන්, මිථ්‍යාආජීවයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "37. යම්සේ ඇතැම් පින්වත් මහණබඹුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, ආවාහ සඳහා නකත් කීම, විවාහ සඳහා නකත් කීම, වෙන් වූ අඹුසැමියන් එක් වන්නට නකත් කීම, අඹුසැමියන් වෙන් වන්නට නකත් කීම, දුන් ණය රැස් කිරීමට නකත් කීම, මුදල් ණයට පොලියට දීමට නකත් කීම, සෞභාග්‍යය ඇති වනුවට යන්ත්‍ර මන්ත්‍රාදිය කැරැ දීම, බිම් පාලු වන්නට හදි හූනියම් කිරීම, නැසෙන්නට යන දරුගබ් රැකෙන්නට පිළියම් කිරීම, දිවගුලු බැඳීම, මන්ත්‍රාදියේ බලයෙන් හනු තද කිරීම, අත් පෙරැළෙන්නට මතුරු දැපීම, හනු පෙරැළෙන්නට මතුරු දැපීම, කන් අගුලු වැටෙන්නට මතුරැ දැපීම, කැඩපතෙහි දේවතාවේශය කොට ප්‍රශ්න ඇසීම, කුමරියක ලවා පේන කියැවීම, දෙව්දැස්සක ලවා පේන කියැවීම, ජීවිකා පිණිස හිරු පිදීම, මහබඹු පිදීම, මතුරු දපා මුවින් ගිනිජල් විහිදුවීම, මතුරු දපා සිරිකත කැඳවීම යන මේ හෝ අන් මෙ බඳු වූ තිරශ්චීනවිද්‍යායෙන්, මිථ්‍යාජීවයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "38. යම්සේ ඇතැම් පින්වත් මහණබමුනෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, ශාන්තිකර්‍ම, ප්‍රණිධිකර්‍ම, භූරිකර්‍ම, පණ්ඩකයා පිරිමියකු කිරීම, පිරිමියා පණ්ඩකයකු කිරීම, වාස්තුකර්‍ම, වාස්තු පරිකිරණ, මතුරු දපා මුව දෙවුම, මතුරු දපා අනුන් නෑවීම, සෙත් පතා ගිනි පිදීම, ගිහියනට වමන කැරැවීම, බඩ විරේක කැරැවීම, ළය විරේකයට බේත් දීම, වස්ති කිරීම, ශීර්‍ෂවිරේචන බේත් දීම, කන් ලෙඩට තෙල් පිසැ දීම, ගිහියන් සඳහා ඇස පටලයට සිසිල ගන්වන නෙත්තෙල් පිසීම, ගිහියනට නස්‍ය දීම, කාරම් අඳුන් සාදා දීම, ඇස සිසිල ගන්වන අඳුන සාදා දීම, ගිහියන්ගේ ඇසැ උල්ඇන ලෙඩට බේත් කිරීම, ගිහියනට ශල්‍ය කර්‍ම කිරීම, ළදරුවන්ගේ ලෙඩට පිළියම් කිරීම, මුල් බෙහෙත් දීම (කායචිකිත්සාව) කාරම් බේත් බැඳ වණ සුව වූ පසු ඒවා ගළවා දැමීම යැ” යි මේ ආදී වූ හෝ මෙබඳු වූ තිරශ්චිනවිද්‍යායෙන්, මිථ්‍යාආජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ මේ හෝ මෙ බඳු වූ තිරශ්චීන විද්‍යායෙන්, මිථ්‍යාජීවයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 566,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "39. ස ඛො සො ලොහිච්ච භික්ඛු එවං සීලසම්පන්නො න කුතොචි භයං සමනුපස්සති යදිදං සීලසංවරතො. සෙය්යථාපි මාණව ඛත්තියො මුද්ධාවසිත්තො නිහතපච්චාමිත්තො න කුතොචි භයං සමනුපස්සති යදිදං පච්චත්ථිකතො. එවමෙව ඛො ලොහිච්ච භික්ඛු එවං සීලසම්පන්නො න කුතොචි භයං සමනුපස්සති යදිදං සීලසංවරතො. සො ඉමිනා අරියෙන සීලක්ඛන්ධෙන සමන්නාගතො අජ්ඣත්තං අනවජ්ජසුඛං පටිසංවෙදෙති. එවං ඛො ලොහිච්ච භික්ඛු සීලසම්පන්නො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "40. කථඤ්ච ලොහිච්ච භික්ඛු ඉන්ද්රියෙසු ගුත්තද්වාරො හොති? ඉධ ලොහිච්ච භික්ඛු චක්ඛුනා රූපං දිස්වා න නිමිත්තග්ගාහී හොති නානුබ්යඤ්ජනග්ගාහී. යත්වාධිකරණමෙතං චක්ඛුන්ද්රියං අසංවුතං විහරන්තං අභිජ්ඣා දොමනස්සා පාපකා අකුසලා ධම්මා අන්වාස්සවෙය්යුං, තස්ස සංවරාය පටිපජ්ජති. රක්ඛති චක්ඛුන්ද්රියං. චක්ඛුන්ද්රියෙ සංවරං ආපජ්ජති. සොතෙන සද්දං සුත්වා -පෙ- ඝානෙන ගන්ධං ඝායිත්වා -පෙ- ජිව්හාය රසං සායිත්වා -පෙ- කායෙන ඵොට්ඨබ්බං ඵුසිත්වා -පෙ- මනසා ධම්මං විඤ්ඤාය න නිමිත්තග්ගාහී හොති නානුබ්යඤ්ජනග්ගාහී. යත්වාධිකරණමෙතං මනින්ද්රියං අසංවුතං විහරන්තං අභිජ්ඣාදොමනස්සා පාපකා අකුසලා ධම්මා අන්වාස්සවෙය්යුං, තස්ස සංවරාය පටිපජ්ජති. රක්ඛති මනින්ද්රියං. මනින්ද්රියෙ සංවරං ආපජ්ජති. සො ඉමිනා අරියෙන ඉන්ද්රියසංවරෙන සමන්නාගතො අජ්ඣත්තං අබ්යාසෙකසුඛං පටිසංවෙදෙති. එවං ඛො ලොහිච්ච භික්ඛු ඉන්ද්රියෙසු ගුත්තද්වාරො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "41. කථඤ්ච ලොහිච්ච භික්ඛු සතිසම්පජඤ්ඤෙන සමන්නාගතො හොති? ඉධ ලොහිච්ච භික්ඛු අභික්කන්තෙ පටික්කන්තෙ සම්පජානකාරී හොති. ආලොකිතෙ විලොකිතෙ සම්පජානකාරී හොති. සම්මිඤ්ජිතෙ පසාරිතෙ සම්පජානකාරී හොති. සඞ්ඝාටිපත්තචීවරධාරණෙ සම්පජානකාරී හොති. අසිතෙ පීතෙ ඛායිතෙ සායිතෙ සම්පජානකාරී හොති. උච්චාරපස්සාවකම්මෙ සම්පජානකාරී හොති. ගතෙ ඨිතෙ නිසින්නෙ සුත්තෙ ජාගරිතෙ භාසිතෙ තුණ්හීභාවෙ සම්පජානකාරී හොති. එවං ඛො ලොහිච්ච භික්ඛු සතිසම්පජඤ්ඤෙන සමන්නාගතො හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "39. ලෝහිච්චය, ඒ මහණ තෙමේ මෙසේ ශීලසම්පන්න වූයේ, ශීලසංවරහේතුයෙන් කිසි ම එක ද අසංවරතායෙකින් පහළ වියැ හැකි බියක් නො දකී. ලෝහිච්චය, ක්‍ෂත්‍රියාභිෂේකයෙන් අභිෂේක ලත්, වැනැසූ සතුරන් ඇති ක්‍ෂත්‍රියයෙක් කිසි ම එක ද සතුරකුගෙන් වියැ හැකි බියක් යම්සේ නො දක්නේ ද, එසේ ම මහණ තෙමේ මෙ පරිද්දෙන් ශීලසම්පන්න වූයේ, ශීලසංවරහේතුයෙන් කිසි ම එක ද අසංවරයෙකින් වියැ හැකි බියක් නො දකී. හේ මේ ආර්‍ය්‍ය ශීලස්කන්‍ධයෙන් සමන්විත වූයේ සිය සතන්හි නිදොස් වූ කායික වෛතසික සුඛය විඳී. ලෝහිච්චය, මෙසේ මහණ තෙමේ ශීලසම්පන්න වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "40. ලෝහිච්චය, මහණ තෙමේ කෙසේ තම ඉඳුරන්හි වැසූ දොර ඇත්තේ වේ ද යත්: ලෝහිච්චය, මෙ සස්නෙහි මහණ තෙමේ ඇසින් රූපයක් දැක ශුභාදිවශයෙන් එහි ලකුණු නො ගන්නේ වේ. ශුභාදිවශයෙන් අත්පා ආදි අවයවයන්ගේ ආකාර සිතට නො ගන්නේ වේ. යම් කරුණෙකින් වක්‍ෂුරින්ද්‍රිය වසා නොගෙන වසන්නහුගේ චිත්තසත්තානය විෂමලොභ දොම්නස් ආදි ලාමක අකුශල ස්වභාවයෝ ලුහුබඳනාහු ද ඒ වක්‍ෂුරින්ද්‍රියයාගේ සංවරය පිණිස හේ පිළිපදී. චක්‍ෂුරින්ද්‍රියය රකී. වක්‍ෂුරින්ද්‍රියයෙහි සංවරයට පැමිණේ. කනින් හඬ අසා ... නාසායෙන් ගඳ ආඝ්‍රාණය කොට ... දිවෙන් රස ආස්වාදය කොට ... කයින් ස්ප්‍රෂ්ටව්‍යය (ඇඟට හැපෙන දෑ) ස්පර්‍ශ කොට ... සිතින් ධර්‍මාලම්බන දැන ශුභාදිවශයෙන් එහි ලකුණු ගන්නේ නො වේ. ශුභාදිවශයෙන් ආකාර සිතට ගන්නේ නො වේ. යම් කරුණෙකින් ශ්‍රොත්‍රෙන්‍ද්‍රියය ... ඝ්‍රාණෙන්‍ද්‍රියය .... ජීහ්වේන්‍ද්‍රියය ... කායෙන්ද්‍රියය ... මනන්‍ද්‍රියය සංවර කොට නොගෙන වසන්නහුගේ චිත්තසන්තානය විෂමලෝභ දොම්නස් ආදි ලාමක අකුශල ස්වභාවයෝ ලුහුබඳනාහු ද, ඒ ශ්‍රොත්‍රෙන්ද්‍රියයාගේ ... ඝ්‍රාණෙන්ද්‍රියයාගේ ... ජිහ්වේන්‍ද්‍රියයාගේ ... කායෙන්ද්‍රියයාගේ ... මනඉන්‍ද්‍රියයාගේ සංවරය පිණිස පිළිපදී. ශ්‍රොත්‍ර ... ඝ්‍රාණ ... ජීහ්වා ... කාය ... මනන්‍ද්‍රියය රකී. එහි සංවරයට පැමිණේ. හේ මේ ආර්‍ය්‍ය වූ ඉන්‍ද්‍රියසංවරයෙන් සමන්විත වූයේ සිය සතන්හි අව්‍යාසෙකසුඛය (කෙලෙසුන්ගෙන් මිශ්‍ර නොවීමෙන් වූ පිරිසිදු අධිචිත්තසුඛය) විඳී. ලෝහිච්චය, මෙසේ මහණ තෙමේ ඉන‍්ද්‍රියයන්හි වැසූ දොර ඇත්තේ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "41. ලෝහිච්චය, මහණ තෙමේ කෙසේ නම් ස්මෘතිසම්ප්‍රජානනයෙන් (සිහි නුවණින්) සමන්විත වේ ද යත්: ලෝහිච්චය, මෙ සස්නෙහි මහණ තෙමේ ඉදිරියට යෑමෙහි ද පෙරළා ඊමෙහි ද මනා නුවණින් දැන ම (එය) කරනුයේ වෙයි. ඉදිරි බැලීමෙහි, අනුදික් බැලීමෙහි (වට පිට බැලීමෙහි) මනා නුවණින් දැන ම (එය) කරනුයේ වෙයි. අත් පා ආදිය හැකිළීමේහි, දිගු කිරීමෙහි නුවණින් දැන ම (එය) කරනුයේ වෙයි. සඟළසිවුර ද පාත්‍රය ද සෙසු සිවුරු ද දැරීමෙහි නුවණින් දැන ම කරන්නේ වෙයි. ආහාර ගැන්මෙහි, පැන් පීමෙහි, පිටිකැවිලි ආදිය කෑමෙහි, මී ආදිය රස විඳීමෙහි නුවණින් දැන ම කරනුයේ වෙයි. මල මූ පහ කිරීමෙහි නුවණින් දැන ම කරනු‍යේ වෙයි. ගමනෙහි සිටීමෙහි හිඳීමෙහි නිදීමෙහි කථා කිරීමෙහි නොබිණිමෙහි නුවණින් දැන ම කරනුයේ වෙයි. ලෝභිච්වය, මෙසේ මහණ තෙම සිහි නුවණින් සමන්විත වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 568,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "42. කථඤ්ච ලොහිච්ච භික්ඛු සන්තුට්ඨො හොති? ඉධ ලොහිච්ච භික්ඛු සන්තුට්ඨො හොති කායපරිහාරියෙන චීවරෙන කුච්ඡිපරිහාරියෙන පිණ්ඩපාතෙන. සො යෙන යෙනෙව පක්කමති සමාදායෙව පක්කමති. සෙය්යථාපි ලොහිච්ච පක්ඛී සකුණො යෙන යෙනෙව ඩෙති සපත්තභාරො’ව ඩෙති, එවමෙව ඛො ලොහිච්ච භික්ඛු සන්තුට්ඨො හොති කායපරිහාරියෙන චීවරෙන කුච්ඡිපරිහාරියෙන පිණ්ඩපාතෙන. සො යෙන යෙනෙව පක්කමති සමාදායෙව පක්කමති. එවං ඛො ලොහිච්ච භික්ඛු සන්තුට්ඨො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "43. සො ඉමිනා ච අරියෙන සීලක්ඛන්ධෙන සමන්නාගතො ඉමිනා ච අරියෙන ඉන්ද්රියසංවරෙන සමන්නාගතො ඉමිනා ච අරියෙන සතිසම්පජඤ්ඤෙන සමන්නාගතො ඉමාය ච අරියාය සන්තුට්ඨියා සමන්නාගතො විවිත්තං සෙනාසනං භජති අරඤ්ඤං රුක්ඛමූලං පබ්බතං කන්දරං ගිරිගුහං සුසානං වනපත්ථං අබ්භොකාසං පලාලපුඤ්ජං. සො පච්ඡා__භ__ත්තං පිණ්ඩපාතපටික්කන්තො නිසීදති පල්ලඞ්කං ආ__භු__ජිත්වා උජුං කායං පණිධාය පරිමුඛං සතිං උපට්ඨපෙත්වා."
                    },
                    {
                        "type": "paragraph",
                        "text": "44. සො අභිජ්ඣං ලොකෙ පහාය විගතාභිජ්ඣෙන චෙතසා විහරති. අභිජ්ඣාය චිත්තං පරිසොධෙති. බ්යාපාදපදොසං පහාය අබ්යාපන්නචිත්තො විහරති සබ්බපාණභූතහිතානුකම්පී. බ්යාපාදපදොසා චිත්තං පරිසොධෙති. ථිනමිද්ධං පහාය විගතථිනමිද්ධො විහරති ආලොකසඤ්ඤී සතො සම්පජානො ථිනමිද්ධා චිත්තං පරිසොධෙති. උද්ධච්චකුක්කුච්චං පහාය අනුද්ධතො විහරති අජ්ඣත්තං වූපසන්තචිත්තො. උද්ධච්චකුක්කුච්චා චිත්තං පරිසොධෙති. විචිකිච්ඡං පහාය තිණ්ණවිචිකිච්ඡො විහරති අකථංකථී කුසලෙසු ධම්මෙසු. විචිකිච්ඡාය චිත්තං පරිසොධෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "45. සෙය්යථාපි ලොහිච්ච පුරිසො ඉණං ආදාය කම්මන්තෙ පයොජෙය්ය, තස්ස තෙ කම්මන්තා සමිජ්ඣෙය්යුං, සො යානි ච පොරාණානි ඉණමූලානි තානි ච බ්යන්තීකරෙය්ය, සියා චස්ස උත්තරිං අවසිට්ඨං දාරභරණාය, තස්ස එවමස්ස: “අහං ඛො පුබ්බෙ ඉණං ආදාය කම්මන්තෙ පයොජෙසිං. තස්ස මෙ තෙ කම්මන්තා සමිජ්ඣිංසු. සො’හං යානි ච පොරාණානි ඉණමූලානි තානි ච බ්යන්තීඅකාසිං. අත්ථි ච මෙ උත්තරිං අවසිට්ඨං දාරභරණායා”ති. සො තතො නිදානං ලභෙථ පාමොජ්ජං, අධිගච්ඡෙය්ය සොමනස්සං-"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "42. ලෝභිච්චය, කෙසේ නම් මහණ තෙමේ ලද පමණෙහි සතුටු වේ ද යත්: ලෝභිච්චය, මේ සස්නෙහි මහණ තෙමේ කායපරිහරණයට ප්‍රමාණ වූ සිවුරින් ද කුක්ෂිපරිහරණයට ප්‍රමාණ වූ ආහාරයෙන් ද සතුටු වෙයි. හේ යම් යම් තැනකට නික්මැ යේ ද, අට පිරිකර පමණක් ගෙන ම නික්මෙයි. ලෝභිච්චය, (පියා හඹනුවට තරම්) අත්තටු ඇති කුරුලු තෙමේ යම් යම් තැනක ට පියා හඹා යේ නම්, පියාපත් බර සහිත ව ම යම් සේ පියා හඹා ද, එසේ ම ඒ මහණ තෙමේ කායපරිහරණයට ප්‍රමාණ වූ සිවුරින් ද කුක්ෂිපරිහරණයට ප්‍රමාණ වූ ආහාරයෙන් ද සතුටු වෙයි. හේ යම් යම් තැනකට යේ ද, පා සිවුරු (ආදි අට පිරිකර) රැගෙන ම යයි. ලෝභිච්චය, මෙසේ මහණ තෙමේ ලද පසයෙහි සතුටු වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "43. ලෝභිච්චය, ඒ මහණ තෙමේ මේ ආර්‍ය්‍ය ශීලස්කන්‍ධයෙන් ද සමන්විත වූයේ, මේ ආර්‍ය්‍ය ඉන්‍ද්‍රියසංවරයෙන් ද සමන්විත වූයේ, මේ ආර්‍ය්‍ය ස්මෘතිසම්ප්‍රජානනයෙන් ද සමන්විත වූයේ, මේ ආර්‍ය්‍ය සන්තුෂ්ටියෙන් ද සමන්විත වූයේ, අරණ්‍ය වෘක්‍ෂමූල පර්‍වත කඳුරැලි ගිරිගුහා සොහොන් වනපෙත් (වනප්‍රස්ථ) අභ්‍යවකාශ (එළිමහන්) පිදුරුලෙන් යන මෙ කී ජනශුන්‍ය කිසි සෙනස්නක් භජනය කෙරෙයි. හේ පිඬු සෙවීමෙන් පෙරළා ආයේ, පසුබත් සෙමෙහි පලක් බැඳ උඩු කය කෙළින් පිහිටුවා කමටහනට යොමු කොට සිහි එළවා හිඳී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "44. හේ ලොවැ (පඤ්ච උපාදානස්කන්‍ධය කෙරෙහි) ඇල්ම හැර, විෂ්කම්භණප්‍රාහාණයෙන් (යට පත් කිරීමෙන්) පහ වූ අභිජ්ඣායෙන් යුත් සිතින් වෙසෙයි. අභිජ්ඣාව කෙරෙන් සිත පිරිසිදු කෙරෙයි. ව්‍යාපාද ප්‍රද්වේෂය (ක්‍රෝධය) හැර, ව්‍යාපාද රහිත සිතැත්තේ, සියලු පණ ඇති සතුන් කෙරේ හිතානුකම්පා ඇති වැ වෙසෙයි. ක්‍රෝධය කෙරෙන් සිත පිරිසිදු කෙරෙයි. ස්ත්‍යානමිද්ධය හැර, පහ වූ ස්ත්‍යානමිද්ධය ඇත්තේ, දව රෑ දෙක්හි ම දුටු එළිය හඳුනන හැකි පිරිසිදු සංඥා ඇත්තේ, සිහියෙනුත් නුවණිනුත් යුක්ත වූයේ වෙසෙයි. ස්ත්‍යානමිද්ධය කෙරෙන් සිත පිරිසිදු කෙරෙයි. උදහසත් (සිතැ නොසංහුන්බවත්) කුකුසත් (කළ නො කළ දැයෙහි පසුතැවිල්ලත්) සිතින් දුරැ ලා අනුද්ධත වැ (නොසංහුන් බැවින් තොර වැ), සංහිඳුණු ස්වකීය විත්තසන්තානය ඇත්තේ, උදහස් කුකුස් දෙක කෙරෙන් සිත පිරිසිදු කෙරෙයි. සැකය දුරැ ලා, පහ වූ සැක ඇත්තේ, කුසල් දහම්හි සැක නො කරනුයේ, සැකය කෙරෙන් සිත පිරිසිදු කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "45. ලෝහිච්චය, යම්සේ පුරුෂයෙක් ණය මුදලක් ගෙන කර්‍මාන්ත කරන්නේ ද, ඔහුගේ ඒ කර්‍මාන්ත සමෘද්ධ වන්නේ නම්, හෝ යම් පරණ ණය මුදල් වී නම්, ඒ සියල්ල ගෙවා අවසන් කරන්නේ ද, මත්තෙහි ඉතිරි වූ යමක් ඇත් නම්, එය අඹුදරුවන් රක්නා පිණිස වන්නේ ද, එසේ වූ ඔහුට “මම පළමුයෙන් ණයට මුදල් ගෙන කර්‍මාන්ත කෙළෙමි. ඒ මාගේ කර්‍මාන්ත සමෘද්ධ විය. ඒ මම්, යම් පරණ ණය මුදල් වී නම්, එය ගෙවා අවසන් කෙළෙමි. අඹුදරුවන් රක්නට වැඩිපුර ඉතිරි වූ මුදලෙක් ද මට ඇතැ” යි මෙසේ සිතෙක් වන්නේ ද, හෝ ඒ ණය නැතිබව කරණ කොට ගෙන සතුට ලබන්නේ ද, සොම්නසට පැමිණෙන්නේ ද - ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 570,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "46. සෙය්යථාපි ලොහිච්ච පුරිසො ආබාධිකො අස්ස දුක්ඛිතො බාළ්හගිලානො, භත්තං චස්ස නච්ඡාදෙය්ය, න චස්ස කායෙ බලමත්තා, සො අපරෙන සමයෙන තම්හා ආබාධා මුච්චෙය්ය, භත්තඤ්චස්ස ඡාදෙය්ය, සියා චස්ස කායෙ බලමත්තා, තස්ස එවමස්ස: “අහං ඛො පුබ්බෙ ආබාධිකො අහොසිං දුක්ඛිතො බාළ්හගිලානො. භත්තං ච මෙ නච්ඡාදෙසි. න චස්ස මෙ ආසි කායෙ බලමත්තා. සො’ම්හි එතරහි තම්හා ආබාධා මුත්තො භත්තඤ්ච මෙ ඡාදෙති. අත්ථි ච මෙ කායෙ බලමත්තා”ති. සො තතො නිදානං ලභෙථ පාමොජ්ජං, අධිගච්ඡෙය්ය සොමනස්සං-"
                    },
                    {
                        "type": "paragraph",
                        "text": "47. සෙය්යථාපි ලොහිච්ච පුරිසො බන්ධනාගාරෙ බද්ධො අස්ස, සො අපරෙන සමයෙන තම්හා බන්ධනාගාරා මුච්චෙය්ය සොත්ථිනා අබ්බයෙන, න චස්ස කිඤ්චි භොගානං වයො, තස්ස එවමස්ස: “අහං ඛො පුබ්බෙ බන්ධනාගාරෙ බද්ධො අහොසිං. සො’ම්හි එතරහි තම්හා බන්ධනාගාරා මුත්තො සොත්ථිනා අබ්බයෙන. නත්ථි ච මෙ කිඤ්චි භොගානං වයො”ති. සො තතො නිදානං ලභෙථ පාමොජ්ජං, අධිගච්ඡෙය්ය සොමනස්සං-"
                    },
                    {
                        "type": "paragraph",
                        "text": "48. සෙය්යථාපි ලොහිච්ච පුරිසො දාසො අස්ස අනත්තාධීනො පරාධීනො න යෙනකාමඞ්ගමො, සො අපරෙන සමයෙන තම්හා දාසබ්යා මුච්චෙය්ය අත්තාධීනො අපරාධීනො භූජිස්සො යෙනකාමඞ්ගමො, තස්ස එවමස්ස: “අහං ඛො පුබ්බෙ දාසො අහොසිං අනත්තාධීනො පරාධීනො න යෙනකාමඞ්ගමො. සො’ම්හි එතරහි තම්හා දාසබ්යා මුත්තො අත්තාධීනො අපරාධීනො භූජිස්සො යෙනකාමඞ්ගමො’ති. සො තතො නිදානං ලභෙථ පාමොජ්ජං, අධිගච්ඡෙය්ය සොමනස්සං-"
                    },
                    {
                        "type": "paragraph",
                        "text": "49. සෙය්යථාපි ලොහිච්ච පුරිසො සධනො සභොගො කන්තාරද්ධානමග්ගං පටිපජ්ජෙය්ය දුබ්භික්ඛං සප්පටිභයං, සො අපරෙන සමයෙන තං කන්තාරං නිත්ථරෙය්ය, සොත්ථිනා ගාමන්තං අනුපාපුණෙය්ය ඛෙමං අප්පටිභයං, තස්ස එවමස්ස: “අහං ඛො පුබ්බෙ සධනො සභොගො කන්තාරද්ධානමග්ගං පටිපජ්ජිං දුබ්භික්ඛං සප්පටිභයං. සො’ම්හි එතරහි තං කන්තාරං තිණ්ණො සොත්ථිනා ගාමන්තං අනුප්පත්තො ඛෙමං අප්පටිභය”න්ති. සො තතො නිදානං ලභෙථ පාමොජ්ජං, අධිගච්ඡෙය්ය සොමනස්සං-"
                    },
                    {
                        "type": "paragraph",
                        "text": "50. එවමෙව ඛො ලොහිච්ච භික්ඛු යථා ඉණං යථා රොගං යථා බන්ධනාගාරං යථා දාසබ්යං යථා කන්තාරද්ධානමග්ගං, එවං ඉමෙ පඤ්ච නීවරණෙ අප්පහීණෙ අත්තනි සමනුපස්සති. සෙය්යථාපි ලොහිච්ච ආනණ්යං යථා ආරොග්යං, යථා බන්ධනා මොක්ඛං, යථා භූජිස්සං, යථා ඛෙමන්තභූමිං, එවමෙව ඛො ලොහිච්ච භික්ඛු ඉමෙ පඤ්ච නීවරණෙ පහීණෙ අත්තනි සමනුපස්සති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "46. ලෝභිච්චය, යම් සේ පුරුෂයෙක් රෝගී වූයේ, දුකට පැමිණියේ, දැඩි ලෙස ගිලන් වන්නේ ද, ඔහුට බතුත් නො රිසියෙන්නේ ද, ඔහුගේ ඇඟපත ශක්ති පමණකුත් නො වන්නේ ද, හෝ මෑත කාලයෙහි ඒ ආබාධයෙන් මිදෙන්නේ නම්, ඔහුට බතුත් රිසියෙන්නේ නම්, ඔහු ඇඟපත ශක්තිය ද වන්නේ තම්, “මම් වූ කලි පෙරැ දුකට පත්, දැඩි ගිලන්බව් ඇති ලෙඩෙක් වීමි. මට අහර ද රිසි නො වී ය. මා ඇඟපත ශක්තිය ද නො වී ය. ඒ මම් දැන් ඒ ලෙඩින් මිදුණෙම් වෙමි. ඒ මට අහර ද රිසියෙයි. මා ඇඟපත ශක්තිය ද ඇතැ” යි ඔහුට මෙසේ සිතෙක් වන්නේ නම්, හේ ඒ කරුණින් සතුට ලබන්නේ ද, සොම්නසට පැමිණෙන්නේද -",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "47. ලෝභිච්චය, යම් සේ පුරුෂයෙක් හිරගෙහි බැඳුණේ වන්නේ ද, හේ පසු කලෙක ධනය වියදම් නො කොට පහසුවෙන් ඒ හිර ගෙන් මිදෙන්නේ ද, (ඒ හේතුයෙන්) ඔහුගේ කිසි භෝගවිනාශයෙක් නො වන්නේ ද, “මම් වූ කලි පෙරැ හිර ගෙහි බැඳුණෙම් වීමි. ඒ මම දැන් ධන වියදම් නො කොට පහසුවෙන් ඒ හිර ගෙන් මිදුණෙම් වෙමි. මාගේ භෝගයනට කිසි විනාශයෙක් ද නැතැ”යි ඔහුට මෙසේ සිතෙක් වන්නේ ද, හේ ඒ කරුණින් සතුට ලබන්නේ ද, සොම්නසට පැමිණෙන්නේ ද -",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "48. ලෝහිච්චය, යම්සේ තමා අයත් පැවැතුම් නැති, අනුත් අයත් පැවැතුම් ඇති, කැමැති අතෙක යන්නට අවසර නැති දාස පුරුෂයෙක් වන්නේ ද, හේ මෑත භාගයෙහි තමා අයත් පැවැතුම් ඇතියේ, පරා අයත් පැවැතුම් නැතියේ, නිදහස් වූයේ, කැමැති අතෙක යෑ හැකි වූයේ, ඒ දාසභාවයෙන් මිදෙන්නේ ද, එසේ වූ ඔහුට “මම් වූ කලි පෙරැ තමා අයත් පැවැතුම් නැති, පරා අයත් පැවැතුම් ඇති, කැමැති අතෙක යෑ නො හැකි දාසයෙක් වීමි. ඒ මම් දැන් ඒ දාසභාවයෙන් මිදුණෙම්, තමා අයත් පැවැතුම් ඇතියෙම්, පරා අයත් පැවැතුම් නැතියෙම්, නිදහස් වූයෙම් කැමැති අතෙක යෑ හැකියෙම් වෙමි” යි මෙසේ සිතෙක් වන්නේ ද, හේ ඒ කරුණින් සතුට ලබන්නේ ද, සොම්නසට පැමිණෙන්නේ ද -",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "49. ලෝභිච්චය, යම්සේ ධනවත් වූ භෝගසම්පත් ඇති පුරුෂයෙක් දුර්ලභ ආහාර ඇති, උවදුරු ඇති, දිය නැති දික් මඟකට බස්නේ ද, හේ පසු කලෙක සුවසේ ඒ නිරුදක පෙදෙස ඉක්මැ යන්නේ ද, උවදුරු නැති විපත් නැති ගම්මානයකට බස්නේ ද, එසේ වූ ඔහුට “මම් වූ කලි පෙර ධන ඇතියෙම්, භෝගසම්පත් ඇතියෙම්, දිය නැති, ආහාරදුර්ලභ, ප්‍රතිභය සහිත දික් මඟකට බටුයෙමි. ඒ මම් දැන් සුවසේ ඒ කාන්තාරය තරණය කෙළෙමි. නිරුපද්‍රැත භයරහිත ගමකට පැමිණයෙම් වෙමි”යි සිතෙක් වන්නේ ද, හෝ ඒ කරුණින් සතුට ලබන්නේ ද, සොම්නසට පැමිණෙන්නේ ද -",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "50. ලෝභිච්චය, එසේ ම මහණ තෙමේ ණයක් මෙන් ලෙඩක් මෙන් හිරගෙයක් මෙන් වහල්බවක් මෙන් දිය නැති දික්මඟක් ‍මෙන් (පිළිවෙළින්) මේ පහ නොවූ නීවරණ පස තමා කෙරෙහි දකී. ලෝභිච්චය, ණය නැති බව යම්සේ ද, ලෙඩ නැති බව යම්සේ ද, හිරගෙන් මිදුණුබව යම්සේ ද, නිවහල්බව යම්සේ ද, උවදුරු නැති බිම යම්සේ ද, එසේ ම (පිළිවෙළින්) මේ පහ වූ නීවරණ පස (හෙවත් නීවරණ පසේ දුරු වීම) තමා කෙරෙහි දකී.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 572,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "51. තස්සිමෙ පඤ්ච නීවරණෙ පහීණෙ අත්තනි සමනුපස්සතො පාමොජ්ජං ජායති. පමුදිතස්ස පීති ජායති. පීතිමනස්ස කායො පස්සම්භති. පස්සද්ධකායො සුඛං වෙදෙති. සුඛිනො චිත්තං සමාධියති."
                    },
                    {
                        "type": "paragraph",
                        "text": "52. සො විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහරති. සො ඉමමෙව කායං විවෙකජෙන පීතිසුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස විවෙකජෙන පීතිසුඛෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "53. සෙය්යථාපි ලොහිච්ච දක්ඛො න්හාපකො වා න්හාපකන්තෙවාසී වා කංසථාලෙ න්හානීයචුණ්ණානි ආකිරිත්වා උදකෙන පරිප්ඵොසකං පරිප්ඵොසකං සන්නෙය්ය, සායං න්හානීයපිණ්ඩි ස්නෙහානුගතා ස්නෙහපරෙතා සන්තරබාහිරා ඵුටා ස්නෙහෙන න ච පග්ඝරණී, එවමෙව ඛො ලොහිච්ච භික්ඛු ඉමමෙව කායං විවෙකජෙන පීතිසුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස විවෙකජෙන පීතිසුඛෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "54. යම්පි ලොහිච්ච භික්ඛු විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහරති, සො ඉමමෙව කායං විවෙකජෙන පීතිසුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස විවෙකජෙන පීතිසුඛෙන අප්ඵුටං හොති. ඉදම්පි’ස්ස හොති සමාධිස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "55. යස්මිං ඛො ලොහිච්ච සත්ථරි සාවකො එවරූපං උළාරං විසෙසං අධිගච්ඡති අයම්පි ඛො ලොහිච්ච සත්ථා යො ලොකෙ න චොදනාරහො යො ච පනෙවරූපං සත්ථාරං චොදෙති, සා චොදනා අභූතා අතච්ඡා අධම්මිකා සාවජ්ජා."
                    },
                    {
                        "type": "paragraph",
                        "text": "56. පුන ච පරං ලොහිච්ච භික්ඛු විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියං ඣානං උපසම්පජ්ජ විහරති. සො ඉමමෙව කායං සමාධිජෙන පීතිසුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස සමාධිජෙන පීතිසුඛෙන අප්ඵුටං හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "51. තමා කෙරෙහි පහ වූ මේ නීවරණ පස දක්නා ඔහුට සතුට උපදී. සතුටු වූවහුට ප්‍රිතීය උපදී. සිතැ ප්‍රීතිය ඇත්තහුගේ නාමකය සංහිඳේ. සංහුන් නාමකය ඇත්තේ සුව විඳී. සුවැතියහු සිත සමාධිගත වේ (එකඟ වේ).",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "52. හේ කාමයන්ගෙන් වෙන් ව ම, අකුසල් දහමුන්ගෙන් ද වෙන් ව ම, විතර්‍කසහිත, විවාරසහිත, විවේකයෙන් (නීවරණ පහ වීමෙන්) උපන් ප්‍රීතියත් සුවයත් ඇති පළමු ධ්‍යානය ලැබ වෙසේ. ‍හේ මේ කරජකය ම විවේකයෙන් උපත් ප්‍රීතීසුඛයෙන් තෙමයි. සියල්ල ම තෙමයි, පුරා ලයි, සියල්ල ම ස්පර්‍ශ කෙරෙයි. සියලු අඟ පසඟ ඇති ඔහු මුළු කයෙහි ඒ විවේකයෙන් උපන් ප්‍රීතිසුඛයෙන් පැතිරැ වැද නොගත් (නොපහස්නා ලද) කිසි ද තැනෙක් නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "53. ලෝභිච්චය, යම්සේ කපුවෙක් (කිලිඟෙක්) හෝ කපුවකුගේ (කිලිඟකුගේ) අතවැස්සෙක් හෝ ලොහොතලියෙක නාන සුණු බහා දිය ඉස ඉස පිඩු කරන්නේ ද, ඒ නාන සුණුපිඬ කාවැදුණු දිය ඇත්තේ, හැම තැන ම දියෙන් යුක්ත වූයේ, ඇතුළත පිටත සියල්ල ම දියෙන් පැතිරැ ගියේ, දිය නො වගුරුවන්නේත් වේ ද, ලෝභිච්වය, එසේ ම මහණ තෙමේ මේ කරජකය ම විවේකයෙන් උපන් ප්‍රීතිසුඛයෙන් තෙමයි, සියල්ල ම තෙමයි, පුරා ලයි, සියල්ල ම ස්පර්‍ශ කෙරෙයි. ඔහුගේ සියලු අඟ පසඟ ඇති මුළු කයෙහි විවේකජ ප්‍රීතිසුඛයෙත් පැතිර වැද නොගත් කිසි ද තැ‍නෙක් නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "54. ලෝභිච්වය, මහණ තෙම කාමයන්ගෙන් වෙන් ව ම, අකුසල් දහමුන්ගෙන් ද වෙන් ව ම, විතර්‍කසහිත, විචාරසහිත, විවේකයෙන් උපන් ප්‍රීතියත් සුවයත් ඇති යම් පළමු දහනක් ලැබ වෙසේ ද, හෝ ඒ විවේකජ ප්‍රීතීසුබයෙන් මේ කය ම තෙමයි, මුළුල්ල ම තෙත් කෙරෙයි, පුරා ලයි, හාත්පස පැතිරැ ගනී. ඔහුගේ සියලු කයැ විවේකජ ප්‍රීතිසුඛයෙන් නො පැතිරැ ගත් කිසිදු තැනෙක් නො වෙයි. මේ ද ඔහුගේ සමාධියෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "55. ලෝහිච්වය, යම් ශාස්තෘවරයකු නිසා සවු තෙම මෙබඳු මහත් ගුණවිශේෂයක් ලබා ද, ලෝහිච්චය, මේ යමෙක් ලොවැ චෝදනාවට නොසුදුසු නම් එසේ වූ ශාස්තෘවරයෙකි. යමෙක් මෙබඳු ශාස්තෘහට චෝදනා කෙරේ නම්, ඒ චෝදනාව අභූතය, අසත්‍ය ය, නො දැහැමි ය, වරද සහිත ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "56. ලෝහිච්චය, නැවැත ද (අනෙකක් කියමි:) මහණ තෙමේ විතර්‍කවිචාරයන්ගේ සංහිඳීමෙන්, සිය සතන්හි උපන්, සිය සතන් පහදවන (ශ්‍රද්ධාව හා එක් වැ යෙදුණු), සිතැ එකඟ බව ඇත, විතර්‍කය නැති, විචාරය නැති, සමාධියෙන් උපන්, ප්‍රීතියත් සුවයත් ඇති, දෙවෙනි ධාන්‍යායට පැමිණ වෙසෙයි. හේ මේ කරජ කය ම සමාධියෙන් උපන් ප්‍රීතිසුඛයෙන් තෙමයි. සියල්ල ම තෙත් කෙරෙයි, පුරා ලයි, හැම තැන ම ස්පර්‍ශ කෙරෙයි. ඔහුගේ කයේ විවේකයෙන් උපන් ප්‍රීතිසුඛයෙන් පැතිරැ නොගත් කිසි ද තැනෙක් නො වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 574,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "57. සෙය්යථාපි ලොහිච්ච උදකරහදො __ගම්භීරො__ උබ්භිදොදකො, තස්ස නෙවස්ස පුරත්ථිමාය දිසාය උදකස්ස ආයමුඛං, න දක්ඛිණාය දිසාය උදකස්ස ආයමුඛං, න පච්ඡිමාය දිසාය උදකස්ස ආයමුඛං, න උත්තරාය දිසාය උදකස්ස ආයමුඛං, දෙවො ච න කාලෙන කාලං සම්මා ධාරං අනුප්පවෙච්ඡෙය්ය, අථ ඛො තම්හාව උදකරහදා සීතා වාරිධාරා උබ්භිජ්ජිත්වා තමෙව උදකරහදං සීතෙන වාරිනා අභිසන්දෙය්ය පරිසන්දෙය්ය පරිපූරෙය්ය පරිප්ඵරෙය්ය, නාස්ස කිඤ්චි සබ්බාවතො උදකරහදස්ස සීතෙන වාරිනා අප්ඵුටං අස්ස, එවමෙව ඛො ලොහිච්ච භික්ඛු ඉමමෙව කායං සමාධිජෙන පීතිසුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස සමාධිජෙන පීතිසුඛෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "58. යම්පි ලොහිච්ච භික්ඛු විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියං ඣානං උපසම්පජ්ජ විහරති, සො ඉමමෙව කායං සමාධිජෙන පීතිසුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස සමාධිජෙන පීතිසුඛෙන අප්ඵුටං හොති. ඉදම්පි’ස්ස හොති සමාධිස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "59. යස්මිං ඛො ලොහිච්ච සත්ථරි සාවකො එවරූපං උළාරං විසෙසං අධිගච්ඡති අයම්පි ඛො ලොහිච්ච සත්ථා යො ලොකෙ න චොදනාරහො යො ච පනෙවරූපං සත්ථාරං චොදෙති සා චොදනා අභූතා අතච්ඡා අධම්මිකා සාවජ්ජා."
                    },
                    {
                        "type": "paragraph",
                        "text": "60. පුන ච පරං ලොහිච්ච භික්ඛු පීතියා ච විරාගා උපෙක්ඛකො ච විහරති සතො සම්පජානො සුඛඤ්ච කායෙන පටිසංවෙදෙති. යන්තං අරියා ආචික්ඛන්ති ‘උපෙක්ඛකො සතිමා සුඛවිහාරී’ති, තං තතියං ඣානං උපසම්පජ්ජ විහරති. සො ඉමමෙව කායං නිප්පීතිකෙන සුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස නිප්පීතිකෙන සුඛෙන අප්ඵුටං හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "57. ලෝභිච්චය, සමසේ යටැ උල්පතින් මතු වන දිය ඇති ගැඹුරු විලෙක් වේ ද, එයට පෙරදිගින් දිය ඇතුළු වන මඟෙක් නො වන්නේ ද, දකුණු දෙසින් ද දිය ඇතුළු වන මඟෙක් නොවන්නේ ද, පැසිම් දිගින් ද දිය ඇතුළු වන මඟෙක් නොවන්නේ ද, උතුරු දෙසින් ද දිය වැද ගන්නා මඟෙක් නො වන්නේ ද, වැස්ස ද කලින් කලැ සුදුසු පරිදි නො වසින්නේ ද, එතෙකුදු වුවත් ඒ විලෙන් සිහිල් දියදහර මතු වී ඒ විල ම සිහිල් දියෙන් තෙමන්නේ ද, හැම පරිදි තෙමන්නේ ද, පුරා ලන්නේ ද, හැම තැන ම වැද ගෙන පැතිරැ සිටින්නේ ද, ඒ මුළු විලෙහි සිසිල් දිය පැතිරැ වැද නොගත් කිසි ද තැනෙක් නො මැත් ද, ලෝහිච්චය, එසේ ම මහණ තෙමේ මෙ කරජ කය ම සමාධියෙන් උපන් ප්‍රීතිසුඛයෙන් තෙමයි, හැම තැන ම තෙත් කෙරෙසි, පුරා ලයි, හැම තැන ම පැතිරැ වැද ගනී. ඔහුගේ ඒ සියලු කයේ සමාධියෙන් උපන් ප්‍රීතිසුඛය පැතිර වැද නො ගත් කිසි ද තැ‍නෙක් නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "58. ලෝහිච්චය, මහණ තෙම විතර්‍කවිචාරයන් සංහිඳීමෙන් තමා කෙරෙහි පැහැදීම ඇති කරන, සිතැ එකඟ බව ඇති, විතර්‍කරහිත, විචාර රහිත, සමාධියෙන් පහළ වූ, ප්‍රීතිය හා සුඛවේදනාව හා ඇති යම් දෙවනි ධ්‍යානයකට පැමිණැ වෙසේ ද, හේ මේ කය ම සමාධියෙන් උපන් ප්‍රීතිසුඛයෙන් තෙමයි. හැම තැන ම තෙත් කෙරෙයි, පුරා ලයි. හැම තැත ම පැතිරැ වැදැ ගනී. ඔහුගේ ඒ සියලු කයැ සමාධියෙන් උපන් ප්‍රීතිසුඛය පැතිරැ වැද නොගත් කිසි ද තැනෙක් නො වෙයි. මේ ද ඔහුගේ සමාධියෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "59. ලෝහිච්චය, යම් ශාස්තෘවරයකු නිසා සවු තෙම මෙබඳු මහත් ගුණවෙසෙසක් ලබා ද, ලෝභිච්චය, මේත් ලොවැ චෝදනාවට නොසුදුසු වූ ශාස්තෘවරයෙකි. යමෙක් මෙබඳු ශාස්තෘහට චෝදනා කෙරේ නම්, ඒ චෝදනාව අභූතය, අතථ්‍ය ය, නො දැහැමි ය, වරද සහිත ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "60. නැවැත ද (අනෙකක් කියමි:) ලෝහිච්වය, මහණ තෙමේ ප්‍රීතියගේ ද විරාගයෙන් (පහ වීමෙන්, සංහිඳීමෙන්), උපේක්‍ෂක වැ, සිහියෙන් හා නුවණින් හා යුක්ත වැ වෙසෙයි. (දහන්) සුවය ද කයින් විඳී. ආර්‍යයෝ යම් ධ්‍යානයක් හේතු කොට ගෙන ධ්‍යානලාභියා ඇරැබැ ‘උපේක්‍ෂාව ඇත්තේ, සිහි ඇත්තේ, සුඛවිහරණ ඇත්තේ යැ’ යි කියත් ද, හේ (එසේ වූ) ඒ තෙවෙනි ධ්‍යානයට පැමිණ වෙසේ. හේ මේ කය ම නිෂ්ප්‍රීතික සුඛයෙන් තෙමයි. හැම පරිදි තෙත් කෙරෙයි. පුරා ලයි. හැම තැන ම පැතිර වැදැ ගනී. ඔහුගේ කයෙහි ඒ නිෂ්ප්‍රීතීක සුඛයෙන් පැතිර නොගත් කිසි ද තැනෙක් නො වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 576,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "61. සෙය්යථාපි ලොහිච්ච උප්පලිනියං වා පදුමිනියං වා පුණ්ඩරීකිනියං වා අප්පෙකච්චානි උප්පලානි වා පදුමානි වා පුණ්ඩරීකානි වා උදකෙ ජාතානි උදකෙ සංවද්ධානි උදකානුග්ගතානි අන්තොනිමුග්ගපොසීනි, තානි යාවචග්ගා යාව ච මූලා සීතෙන වාරිනා අභිස්සන්නානි පරිස්සන්නානි පරිපූරානි පරිප්ඵුටානි, නාස්සා කිඤ්චි සබ්බාවතං උප්පලානං වා පදුමානං වා පුණ්ඩරීකානං වා සීතෙන වාරිනා අප්ඵුටං අස්ස, එවමෙව ඛො ලොහිච්ච භික්ඛු ඉමමෙව කායං නිප්පීතිකෙන සුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස නිප්පීතිකෙන සුඛෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "62. යම්පි ලොහිච්ච භික්ඛු පීතියා ච විරාගා උපෙක්ඛකො ච විහරති සතො සම්පජානො සුඛඤ්ච කායෙන පටිසංවෙදෙති, යං තං අරියා ආචික්ඛන්ති ‘උපෙක්ඛකො සතිමා සුඛවිහාරී’ති තං තතියං ඣානං උපසම්පජ්ජ විහරති සො ඉමමෙව කායං නිප්පීතිකෙන සුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති, නාස්ස කිඤ්චි සබ්බාවතො කායස්ස නිප්පීතිකෙන සුඛෙන අප්ඵුටං හොති, ඉදම්පි’ස්ස හොති සමාධිස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "63. යස්මිං ඛො ලොහිච්ච සත්ථරි සාවකො එවරූපං උළාරං විසෙසං අධිගච්ඡති, අයම්පි ඛො ලොහිච්ච සත්ථා යො ලොකෙ න චොදනාරහො. යො ච පනෙවරූපං සත්ථාරං චොදෙති, සා චොදනා අභූතා අතච්ඡා අධම්මිකා සාවජ්ජා."
                    },
                    {
                        "type": "paragraph",
                        "text": "64. පුන ච පරං ලොහිච්ච භික්ඛු සුඛස්ස ච පහානා දුක්ඛස්ස ච පහානා පුබ්බෙව සොමනස්සදොමනස්සානං අත්ථඞ්ගමා අදුක්ඛමසුඛං උපෙක්ඛාසතිපාරිසුද්ධිං චතුත්ථං ඣානං උපසම්පජ්ජ විහරති. සො ඉමමෙව කායං පරිසුද්ධෙන චෙතසා පරියොදාතෙන ඵරිත්වා නිසින්නො හොති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස පරිසුද්ධෙන චෙතසා පරියොදාතෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "65. සෙය්යථාපි ලොහිච්ච පුරිසො ඔදා__තෙ__න වත්ථෙන සසීසං පාරුපිත්වා නිසින්නො අස්ස, නාස්ස කිඤ්චි සබ්බාවතො කායස්ස ඔදාතෙන වත්ථෙන අප්ඵුටං අස්ස, එවමෙව ඛො ලොහිච්ච භික්ඛු ඉමමෙව කායං පරිසුද්ධෙන චෙතසා පරියොදාතෙන ඵරිත්වා නිසින්නො හොති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස පරිසුද්ධෙන චෙතසා පරියොදාතෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "66. යම්පි ලොහිච්ච භික්ඛු සුඛස්ස ච පහානා දුක්ඛස්ස ච පහානා පුබ්බෙව සොමනස්සදොමනස්සානං අත්ථඞ්ගමා අදුක්ඛමසුඛං උපෙක්ඛාසතිපාරිසුද්ධිං චතුත්ථං ඣානං උපසම්පජ්ජ විහරති, සො ඉමමෙව කායං පරිසුද්ධෙන චෙතසා පරියොදාතෙන ඵරිත්වා නිසින්නො හොති, නාස්ස කිඤ්චි සබ්බාවතො කායස්ස පරිසුද්ධෙන චෙතසා පරියොදාතෙන අප්ඵුටං හොති. ඉදම්පි’ස්ස හොති සමාධිස්මිං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "61. ලෝහිච්චය, යම්සේ උපුල් විලෙක හෝ පියුම් විලෙක හෝ පඬෙර විලෙක හෝ ඇතැම් උපුල් හෝ පියුම් හෝ පඬෙර හෝ දියෙහි උපන්නේ, දියෙහි වැඩුණේ, දියෙන් නොනැඟුණේ, දිය තුළැ ම ගිලී වැඩෙනුයේ ද, ඒ හැම අක් දක්වාත් මුල් දක්වාත් සිසිල් දියෙන් තෙමුණේ, හැම පරිදි තෙත් වූයේ, පිරී ගියේ, හැම තැන් ම පැතිරැ වැද ගත්තේ වේ ද, ඒ විලෙහි සියලු උපුල්වලැ හෝ පියුම්වලැ හෝ පඬෙරවලැ හෝ සිසිල් දිය පැතිරැ නොගත් තැ‍නෙක් හෝ වන්නේ ද, ලෝහිච්චය, එසේ ම මහණ තෙමේ මේ කය ම නිෂ්ප්‍රීතික සුඛයෙන් තෙමයි. හාත්පසින් තෙමයි. පුරා ලයි. හැම පරිදි පැතිරැ වැද ගනී. ඔහුගේ සියලු කයෙහි නිෂ්ප්‍රීතික සුඛයෙන් පැතිරැ වැද නොගත් කිසි ද තැනෙක් නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "62. ලෝහිච්චය, මහණ තෙම් ප්‍රීතිය ද හැරැ ලීමෙන් උපේක්‍ෂාව ඇත්තේ සිහි ඇති වැ නුවණ ඇති වැ වෙසේ. සුවයත් නාමකයින් විඳී. ‘උපේක්‍ෂා ඇත්තේ සිහි ඇත්තේ සුව වුසුම් ඇත්තේයැ’යි ආර්‍යයෝ යමක්හු දක්වත් නම්, ඒ තෙවෙනි ධ්‍යානය ලැබ වෙසේ. හේ නිෂ්ප්‍රීතික සුවයෙන් මෙ කය ම තෙමයි. කය සියල්ල ම තෙත් කෙරෙයි. පුරා ලයි. පැතිරැ වැදගනී. ඔහුගේ සියලු කයෙහි නිෂ්ප්‍රීතික සුඛයෙන් පැතිරැ වැද නො ගත් කිසි ද තැනෙක් නොවෙයි යන යමක් ඇද් ද, මේ ද ඔහුගේ සමාධියෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "63. ලෝහිච්චය, යම් ශාස්තෘවරයකු කෙරෙහි වැස සවු තෙම මෙබඳු මහත් ගුණ වෙසෙසක් ලබා නම්, මේත් ලෙවැ චෝදනාවට නො සුදුසු වූ ශාස්තෘවරයෙකි. යමෙක් මෙබඳු ශාස්තෘහට චෝදනා කෙරේ නම්, ඒ චෝදනාව අභූතය, අතථ්‍ය ය, නො දැහැමි ය, වරද සහිත ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "64. නැවැත ද (අනෙකක් කියමි:) ලෝහිච්චය, මහණ තෙමේ සුඛ වේදනාව ද දුරැ ලීමෙන්, දුඃඛ වේදනාව ද දුරැ ලීමෙන්, පළමු කොට ම සොම්නස් දොම්නස් දෙදෙනාගේ පහ වීමෙන්, දුක් ද නොවූ, සුව ද නොවූ, උපේක්‍ෂා ස්මෘති යන මොවුන්ගේ පිරිසුදු බව ඇති සතර වන ධ්‍යානය ලැබ වෙසෙයි. හේ මේ කය ම පිරිසිදු ප්‍රභාස්වර සිතින් පැතිරැ වැද ගෙන හුන්නේ වෙයි. ඔහුගේ සියලු කයෙහි පිරිසිදු ප්‍රභාස්වර සිතින් පැතිරැ වැද නො නොගෙන සිටි කිසි ද තැනෙක් නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "65. ලෝහිච්චය, යම්සේ පුරුෂයෙක් සුදු වතින් හිසින් වටා පෙරෙවැ හුන්නේ වේ නම්, ඔහුගේ කයෙහි සුදු වතින් වැද නොගත් (නො වැසුණ) කිසි ද තැනෙක් නො වන්නේ ද, ලෝහිච්චය, එසේ ම මහණ තෙම් මේ කය ම පිරිසිදු ප්‍රභාස්වර සිතින් පැතිරැ වැද ගෙන හුන්නේ වෙයි. ඔහු කයැ පිරිසිදු පබසර සිතින් වැද ගෙන නොසිටි කිසි ද තැනෙක් නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "66. ලෝහිච්චය, මහණ තෙම් සුඛවේදනාව ද දුක් වේදනාව ද පහ කිරීමෙන්, පළමුවෙන් ම සොම්නස් දොම්නසුන් පහ වැ යෑමේන්, දුක් ද නොවූ සුව ද නො වූ, උපේක්‍ෂාවත් ස්මෘතියත් යන මොවුන්ගේ පිරිසිදු බව ඇති සිවුවන දහන් ලැබැ වෙසෙයි. එයින් හෙ තෙම මේ කය ම පිරිසිදු පබසර සිතීන් පැතිරැ ගෙන හුන්නේ වෙයි. ඔහුගේ සියලු කයෙහි පිරිසිදු පබසර සිතින් පැතිරැ නොගත් කිසි ද තැනෙක් නොවෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 578,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "67. යස්මිං ඛො ලොහිච්ච සත්ථරි සාවකො එවරූපං උළාරං විසෙසං අධිගච්ඡති, අයම්පි ඛො ලොහිච්ච සත්ථා යො ලොකෙ න චොදනාරහො. යො ච පනෙවරූපං සත්ථාරං චොදෙති, සා චොදනා අභූතා අතච්ඡා අධම්මිකා සාවජ්ජා."
                    },
                    {
                        "type": "paragraph",
                        "text": "68. පුන ච පරං ලොහිච්ච සො භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ ඤාණදස්සනාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො එවං පජානාති: අයං ඛො මෙ කායො රූපී චාතුම්මහාභූතිකො මාතාපෙත්තිකසම්භවො ඔදනකුම්මාසූපචයො අනිච්චුච්ඡාදනපරිමද්දනභෙදනවිද්ධංසනධම්මො. ඉදං ච පන මෙ විඤ්ඤාණං එත්ථ සිතං එත්ථ පටිබද්ධන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "69. සෙය්යථාපි ලොහිච්ච මණි වෙළුරියො සුභො ජාතිමා අට්ඨංසො සුපරිකම්මකතො අච්ඡො විප්පසන්නො අනාවිලො සබ්බාකාරසම්පන්නො, තත්රස්ස සුත්තං ආවුතං නීලං වා පීතං වා ලොහිතං වා ඔදාතං වා පණ්ඩුසුත්තං වා. තමෙනං චක්ඛුමා පුරිසො හත්ථෙ කරිත්වා පච්චවෙක්ඛෙය්ය: “අයං ඛො මණි වෙළුරියො සුභො ජාතිමා අට්ඨංසො සුපරිකම්මකතො අච්ඡො විප්පසන්නො අනාවිලො සබ්බාකාරසම්පන්නො. තත්රිදං සුත්තං ආවුතං නීලං වා පීතං වා ලොහිතං වා ඔදාතං වා පණ්ඩුසුත්තං වා”ති. එවමෙව ඛො ලොහිච්ච භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ ඤාණදස්සනාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො එවං පජානාති: අයං ඛො මෙ කායො රූපී චාතුම්මහාභූතිකො මාතාපෙත්තිකසම්භවො ඔදනකුම්මාසූපචයො අනිච්චුච්ඡාදනපරිමද්දනභෙදනවිද්ධංසනධම්මො. ඉදං ච පන මෙ විඤ්ඤාණං එත්ථ සිතං එත්ථ පටිබද්ධන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "70. යම්පි ලොහිච්ච භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ -පෙ- එවං පජානාති -පෙ- ඉදං ච පන මෙ විඤ්ඤාණං එත්ථ සිතං එත්ථ පටිබද්ධන්ති, ඉදම්පි’ස්ස හොති පඤ්ඤාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "71. යස්මිං ඛො ලොහිච්ච සත්ථරි සාවකො එවරූපං උළාරං විසෙසං අධිගච්ඡති, අයම්පි ඛො ලොහිච්ච සත්ථා යො ලොකෙ න චොදනාරහො. යො ච පනෙවරූපං සත්ථාරං චොදෙති, සා චොදනා අභූතා අතච්ඡා අධම්මිකා සාවජ්ජා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "67. ලෝහිච්චය, යම් ශාස්තෘවරයකු කෙරෙහි සවු තෙම මෙබඳු උදාර ගුණ වෙසෙසක් ලබා නම්, මේ ද ලොවැ චෝදනාර්‍හ නොවූ ශාස්තෘවරයෙකි. යමෙක් මෙබඳු ශාස්තෘහට චෝදනා කෙරේ තම්, ඒ චෝදනාව අභූත ය, අතථ්‍ය ය, අධාර්මික ය, සාවද්‍ය ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "68. තව ද (අනෙකක් කියමි:) ලෝහිච්චය, ඒ මහණ තෙමේ මෙසේ එකඟ වූ සිත පිරිසිදු වූ කල්හි, දීප්තිමත් වූ කල්හි, කිලිටි නැති වූ කල්හි, පහ වූ විත්තෝපක්ලේශ ඇති කල්හි, මෘදු වූ කල්හි, විදර්‍ශනා භාවනාවට යෝග්‍ය කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පැමිණි කල්හි, විදර්‍ශනාඥානය පිණිස (පරිකර්‍ම) සිත එයට අභිමුඛ කෙරෙයි, ඒ අතට නමා හරියි. හේ “මගේ මේ කය වූ කලි රූපවත් ය, සතර මහාභූතයන් ගෙන් හැදුණේ ය. මාපියන්ගේ ශුක්‍රශොණිතයෙන් උපන්නේ ය. බත් කොමු ආදි අහරින් වැඩුණේ ය. අනිස බව ද, දුගඳ හැරනුවට සුවඳ විලෙවුන් ගැල්වියැ යුතු බව ද, ලෙඩ දුරැලනුවට පිරිමැදුම් ඈ කළ යුතු බව ද, එසේ කළ ද බිඳෙන බව ද, විසිරෙන බව ද යන මේ දෑ ස්වභාවය කොටැත්තේ ය. මාගේ මේ සිත ද මෙහි ලැග්ගේ ය. මෙහි බැඳුණේ යැ” යි මෙසේ දැන ගනී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "69. ලෝහිච්චය, යම්සේ ‍සොඳුරු වූ, පිරිසිදු ආකරයෙක පහළ වූ, අටැස් වූ, මොනොවට පිරියම් කළ, සියුම් වූ, වෙසෙසින් පහන් වූ, පිවිතුරු වූ, ධෝවනාදි සියලු ආකාරයෙන් යුත් වෙරළුමිණෙක් වන්නේ ද, එහි නිල් වූ හෝ රන්වන් වූ හෝ රත්වන් හෝ සුදුවන් හෝ පඬුවන් හෝ හුයෙක් අවුනන ලද්දේ වන්නේ ද, එය ඇස් ඇති පුරුෂයෙක් අතෙහි කොට, “මේ වූ කලි සොඳුරු වූ, පිරිසිදු ආකරයෙහි උපන්, ඇටැස් වූ, මොනොවට පිරියම් කළ, සියුම් වූ, වෙසෙසින් පහන් වූ, පිවිතුරු වූ, සියලු ධෝවනාදි ආකාරයෙන් සම්පූර්‍ණ වූ වෙරළුමිණෙක. මෙහි නිල් වූ හෝ රන්වන් වූ හෝ පඬුවන් වූ හෝ සුදුවන් වූ හෝ මේ හුයෙක් අවුනන ලදුයේ වේ යැ” යි සලකා බලන්නේ ද, ලෝහිච්චය, එපරිද්දෙන්ම මහණ තෙමේ මෙසේ සමාධි ගත සිත පිරිසිදු කල්හි, දීප්තිමත් වූ කල්හි, කෙලෙස් යටපත් වූ කල්හි, උපක්ලේශයන් පහ වූ කල්හි, මෘදු වූ කල්හි, කර්‍මණ්‍ය වූ කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පැමිණි කල්හි, විදර්‍ශනාඥානය පිණිස සිත අභිමුඛ කෙරෙයි, ඒ අතට නමා හරියි. හෙ තෙම “මාගේ මේ කය වූ කලි රූපී ය. සතර මහාභූතයන්ගෙන් හැදුණේ ය. මාපියන්ගේ ශුක්‍රශොණිතයෙන් නිපන්නේ ය. බත් කොමු ආදි අහරින් වැඩුණේ ය. අනිස බව ද, දුගඳ හරනට සුවඳ විලෙවුන් ඉසියැ යුතු බව ද, ලෙඩ දුරැ ලනුවට පිරිමැදුම් ඈ කළ යුතු බව ද, ඒ කළත් බිදෙන බව ද, විසිරෙන බව ද යන මේ දෑ ස්වභාවය කොටැත්තේ ය. මාගේ මේ සිත ද මෙහි ලැග ගත්තේය. මෙහි බැඳු‍ණේ යැ”යි මෙසේ දැන ගනී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "70. ලෝහිච්චය, මහණ මෙසේ සමාධිගත සිත පිරිසිදු කල්හි ... මාගේ මේ සිත ද මෙහි ලැග ගත්තේ ය. මෙහි බැඳුණේ යැ’යි මෙසේ දනී යන යමක් ඇද්ද, මේ ද ඔහුගේ ප්‍රඥාවෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "71. ලෝහිච්චය, යම් ශාස්තෘවරයකු කෙරෙහි ශ්‍රාවක තෙම් මෙබඳු උදාර ගුණවිශේෂයක් ලබා නම්, ලෝහිච්චය, මෙ ද ලොවැ චෝදනාර්‍හ නොවූ ශාස්තෘවරයෙකි. යමෙකුත් මෙබඳු ශාස්තෘහට චෝදනා කෙරේ නම්, ඒ චෝදනාව අභූත ය, අතථ්‍ය ය, අධාර්මික ය, සාවද්‍ය ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 580,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "72. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ මනොමයං කායං අභිනිම්මිනනාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො ඉමම්හා කායා අඤ්ඤං කායං අභිනිම්මිනාති රූපිං මනොමයං සබ්බඞ්ගපච්චඞ්ගිං අහීනින්ද්රියං."
                    },
                    {
                        "type": "paragraph",
                        "text": "73. සෙය්යථාපි ලොහිච්ච පුරිසො මුඤ්ජම්හා ඉසිකං පවාහෙය්ය, තස්ස එවමස්ස: ‘අයං මුඤ්ජො, අයං ඉසිකා. අඤ්ඤො මුඤ්ජො, අඤ්ඤා ඉසිකා. මුඤ්ජම්හා ත්වෙව ඉසිකා පබාළ්හා’ති. සෙය්යථාපි වා පන ලොහිච්ච පුරිසො අසිං කොසියා පවාහෙය්ය, තස්ස එවමස්ස: ‘අයං අසි අයං කොසි. අඤ්ඤො අසි අඤ්ඤා කොසි. කොසියා ත්වෙව අසි පබාළ්හො’ති. සෙය්යථාපි වා පන ලොහිච්ච පුරිසො අහිං කරණ්ඩා උද්ධරෙය්ය, තස්ස එවමස්ස: ‘අයං අහි, අයං කරණ්ඩො. අඤ්ඤො අහි, අඤ්ඤො කරණ්ඩො. කරණ්ඩා ත්වෙව අහි උබ්භතො’ති. එවමෙව ඛො ලොහිච්ච භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ මනොමයං කායං අභිනිම්මිනනාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො ඉමම්හා කායා අඤ්ඤං කායං අභිනිම්මිනාති රූපිං මනොමයං සබ්බඞ්ගපච්චඞ්ගිං අහීනින්ද්රියං."
                    },
                    {
                        "type": "paragraph",
                        "text": "74. යම්පි ලොහිච්ච භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ -පෙ- අඤ්ඤං කායං අභිනිම්මිනාති රූපිං මනොමයං සබ්බඞ්ගපච්චඞ්ගිං අභීනින්ද්රියං, ඉදම්පි’ස්ස හොති පඤ්ඤාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "75. යස්මිං ඛො ලොහිච්ච සත්ථරි සාවකො එවරූපං උළාරං විසෙසං අධිගච්ඡති. අයම්පි ඛො ලොහිච්ච සත්ථා යො ලොකෙ න චොදනාරහො. යො ච පනෙවරූපං සත්ථාරං චොදෙති, සා චොදනා අභූතා අතච්ඡා අධම්මිකා සාවජ්ජා."
                    },
                    {
                        "type": "paragraph",
                        "text": "76. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ ඉද්ධිවිධාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති: එකො’පි හුත්වා බහුධා හොති. බහුධාපි හුත්වා එකො හොති. ආවීභාවං තිරොභාවං තිරොකුඩ්ඩං තිරොපාකාරං තිරොපබ්බතං අසජ්ජමානො ගච්ඡති සෙය්යථාපි ආකාසෙ. පඨවියා’පි උම්මුජ්ජනිමුජ්ජං කරොති සෙය්යථාපි උදකෙ. උදකෙ’පි අභිජ්ජමානෙ ගච්ඡති සෙය්යථාපි පඨවියං. ආකාසෙ’පි පල්ලඞ්කෙන කමති සෙය්යථාපි පක්ඛී සකුණො. ඉමෙ’පි චන්දිමසුරියෙ එවංමහිද්ධිකෙ එවංමහානුභාවෙ පාණිනා පරාමසති පරිමජ්ජති. යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "72. හේ මෙසේ සමාහිත වූ සිත පිරිසිදු වූ කල්හි, දීප්තිමත් වූ කල්හි, කෙලෙස් නොමැති වූ කල්හි, උපක්ලෙශ පහ වූ කල්හි, මෘදු වූ කල්හි, කර්‍මණ්‍ය වූ (ඍද්ධි ඉපැදැවීමට යෝග්‍ය වූ) කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පැමිණි කල්හි, මනෝමය ශරීරයක් මවා පානු පිණිස සිත යොමු කෙරෙයි, නැඹුරු කෙරෙයි. හේ මේ සිරුරෙන් රූපී වූ, සියලු අඟපසඟින් යුත්, විකල නො වූ ඉඳුරන් ඇති මනෝමය ශරීරයක් මවා පායි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "73. ලෝහිච්චය, යම්සේ පුරුෂයෙක් මුදුතණගසෙකින් තණකූර (=තණ බඩය) ඇද මෑත් කරන්නේ ද, ඔහුට ‘මේ මුදුතණගස ස, මේ එහි තණකූරය. තණ ගස එකෙකි, එහි කූර අනෙකෙකි. මුදුතණ ගස කෙරෙන් ම එහි කූර මෑත් කරන ලද්දේ යැ’ යි මෙසේ සිතෙක් වන්නේ ද, ලෝහිච්චය, යම්සේ පුරුෂයෙක් කඩුවක් කොපුවෙන් ඇද මෑත් කරන්නේ ද, ඔහුට ‘මේ කඩුව ය, මේ කොපුව ය. කඩුව එකෙක, කොපුව අනෙකෙක. කොපුයෙන් ම කඩුව ඇද මෑත් කරන ලද්දේයැ’යි මෙසේ සිතෙක් වන්නේ ද, ලෝහිච්චය, යම්සේ වනාහි පුරුෂයෙක් නයකු සැවයෙන් ඇද වෙන් කරන්නේ ද, ඔහුට ‘මේ නයා ය, මේ සැව ය. නයා එකෙක, සැවය අනෙකෙක. සැවය කෙරෙන් ම නයා ඇද වෙන් කරන ලද්දේ යැ’යි මෙසේ සිතෙක් වන්නේ ද, ලෝහිච්චය, එපරිද්දෙන් ම මහණ තෙම මෙසේ සමාධිගත සිත පිරිසිදු කල්හි, දීප්තිමත් වූ කල්හි, කෙලෙස් රහිත වූ කල්හි, උපක්ලේශයන් පහ වැ ගිය කල්හි, මෘදු වූ කල්හි, කර්‍මණ්‍ය වූ කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පත් කල්හි, මනෝමය ශරීරයක් මවා පානු පිණිස සිත යොමු කෙරෙසි, නැඹුරු කෙරෙයි. හේ මේ ශරීරයෙන් රූපී වූ මනෝමය වූ සියලු අඟපසඟින් යුත් වූ අවිකල ඉඳුරන් ඇති අන් සිරුරක් මවා පායි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "74. ලෝහිච්චය, මහණ තෙම මෙසේ සමාධිගත සිත පිරිසිදු වූ කල්හි ... රූපී වූ මනෝමය වූ සියලු අඟපසකින් යුත් අවිකල ඉඳුරන් ඇති අන් සිරුරක් මවා පායි යන යමක් ඇද්ද, මේ ද ඔහුගේ ප්‍රඥාවෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "75. ලෝහිච්චය, යම් ශාස්තෘවරයකු කෙරෙහි ශ්‍රාවක තෙම මෙබඳු මහත් ගුණ වෙසෙසකට පැමිණේ නම්, ලෝහිච්චය, මේ ද ලොවැ චෝදනාර්‍හ නොවූ ශාස්තෘවරයෙකි. යමෙකුත් මෙබඳු වු ශාස්තෘහට චෝදනා කෙරේ නම්, ඒ චෝදනාව අභූත ය, අතථ්‍ය ය, අධාර්මික ය, සාවද්‍ය ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "76. හේ මෙසේ සමාහිත සිත පිරිසිදු වූ කල්හි, දීප්තිමත් වූ කල්හි, කෙලෙස් රහිත වූ කල්හි, උපක්ලේශයන් පහ වැ ගිය කල්හි, මෘදු වූ කල්හි, කර්‍මණ්‍ය (=සෘද්ධියට යෝග්‍ය) කල්හි, ස්ථිත කල්හි, නිශ්චලත්‍වයට පැමිණි කල්හි, ඍද්ධිවිධඥානය පිණිස (අභිඥාපාදක පරිකර්‍ම) සිත මෙහෙයයි, නැඹුරු කෙරෙයි. හේ අනේකවිධ වූ ඍද්ධිවිධය (ඍද්ධි කොට්ඨාසය) නැවත නැවත අනුභව කෙරෙයි (හෙවත් නාම කයින් ස්පර්‍ශ කෙරෙයි, ප්‍රත්‍යක්‍ෂ කෙරෙයි, ලබයි): පියෙවියෙන් එකෙක් වැ සිටැ ද (සෘද්ධි බලයෙන්) බහු ප්‍රකාර ද වී යලි දු එකෙක් වෙයි. තමාගේ ප්‍රකට බව කෙරෙයි (පෙනී සිටී). අප්‍රකට බව කෙරෙයි (නොපෙනී සිටියි). බිත්තියෙන් පිටතට, පවුරෙන් පිටතට, පර්‍වතයෙන් පිටතට අහසෙහි මෙන් කිසිවෙක නො ගැටෙනුයේ මැදින් විනිවිද යෙයි. දියෙහි මෙන් පොළොවෙහි ද යටට බැසීම (ගිලීම), උඩට නැගීම (මතු වීම) කෙරෙයි. නො බිඳෙන (යට නො බස්නා) දියෙහි පොළොවෙහි සේ යෙයි. පක්‍ෂ ඇති සකුණයකු මෙන් අහසෙහි ද පලඟින් (=ඌරුබද්ධාසනයෙත්) යෙයි. මේසා මහර්ද්ධි ඇති මහත් අනුභාව ඇති මේ සඳ හිරු දෙදෙනා ද අතින් පරාමර්‍ශන කෙරෙයි (=අල්ලයි), (ඔබමොබ අත යවා) පිරිමදියි. බඹලොව තෙක් ද කයින් වශය පවත්වයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 582,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "77. සෙය්යථාපි ලොහිච්ච දක්ඛො කුම්භකාරො වා කුම්භකාරන්තෙවාසී වා සුපරිකම්මකතාය මත්තිකාය යං යදෙව භාජනවිකතිං ආකඞ්ඛෙය්ය තං තදෙව කරෙය්ය අභිනිප්ඵාදෙය්ය, සෙය්යථා වා පන ලොහිච්ච දක්ඛො දන්තකාරො වා දන්තකාරන්තෙවාසී වා සුපරිකම්මකතස්මිං දන්තස්මිං යං යදෙව දන්තවිකතිං ආකඞ්ඛෙය්ය තං තදෙව කරෙය්ය අභිනිප්ඵාදෙය්ය, සෙය්යථා වා පන ලොහිච්ච දක්ඛො සුවණ්ණකාරො වා සුවණ්ණකාරන්තෙවාසී වා සුපරිකම්මකතස්මිං සුවණ්ණස්මිං යං යදෙව සුවණ්ණවිකතිං ආකඞ්ඛෙය්ය තං තදෙව කරෙය්ය අභිනිප්ඵාදෙය්ය, එවමෙව ඛො ලොහිච්ච භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ ඉද්ධිවිධාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති: එකො’පි හුත්වා බහුධා හොති. -පෙ- යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙති. යම්පි ලොහිච්ච භික්ඛු එවං සමාහිතෙ චිත්තෙ -පෙ- යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙති, ඉදම්පි’ස්ස හොති පඤ්ඤාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "78. යස්මිං ඛො ලොහිච්ච සත්ථරි සාවකො එවරූපං උළාරං විසෙසං අධිගච්ඡති, අයම්පි ඛො ලොහිච්ච සත්ථා යො ලොකෙ න චොදනාරහො. යො ච පනෙවරූපං සත්ථාරං චොදෙති, සා චොදනා අභූතා අතච්ඡා අධම්මිකා සාවජ්ජා."
                    },
                    {
                        "type": "paragraph",
                        "text": "79. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ දිබ්බාය සොතධාතුයා චිත්තං අභිනීහරති අභිනින්නාමෙති. සො දිබ්බාය සොතධාතුයා විසුද්ධාය අතික්කන්තමානුසිකාය උභො සද්දෙ සුණාති දිබ්බෙ ච මානුසෙ ච යෙ දූරෙ සන්තිකෙ ච. සෙය්යථාපි ලොහිච්ච පුරිසො අද්ධානමග්ගපටිපන්නො, සො සුණෙය්ය භෙරිසද්දම්පි මුදිඞ්ගසද්දම්පි සඞ්ඛපණවදෙණ්ඩිමසද්දම්පි, තස්ස එවමස්ස: භෙරිසද්දො ඉති’පි මුදිඞ්ගසද්දො ඉති’පි සඞ්ඛපණවදෙණ්ඩිමසද්දො ඉති’පි. එවමෙව ඛො ලොහිච්ච භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ දිබ්බාය සොතධාතුයා චිත්තං අභිනීහරති අභිනින්නාමෙති. සො දිබ්බාය සොතධාතුයා විසුද්ධාය අතික්කන්තමානුසිකාය උභො සද්දෙ සුණාති දිබ්බෙ ච මානුසෙ ච යෙ දූරෙ සන්තිකෙ ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "80. යම්පි ලොහිච්ච භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ -පෙ- උභො සද්දෙ සුණාති දිබ්බෙ ච මානුසෙ ච යෙ දූරෙ සන්තිකෙ ච, ඉදම්පි’ස්ස හොති පඤ්ඤාය."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "77. ලෝභිච්වය, යම්සේ දක්‍ෂ කුඹලෙක් හෝ කුඹලක්හුගේ අතැවැස්සෙක් හෝ මොනොවට පිරියම් කළ (=සකස් කළ) මැට්ටෙන් යම් යම් භාජන විශේෂයක් කැමැත්තේ නම්, ඒ ඒ දැය ම කරන්නේ ද, මොනොවට නිපදවන්නේ ද – ලෝභිච්වය, යම්සේ දක්‍ෂ දන්තකාරයෙක් (ඇත්දතින් විසිතුරු රූ ඈ කරන්නෙක්) හෝ දන්තකාරයක්හු අතැවැස්සෙක් හෝ මොනොවට පිරියම් කළ දතෙහි යම් යම් දන්තවිකෘතියක් තමා කැමැති තම්, ඒ ඒ දැය ම කරන්නේ ද නිපදවන්නේ ද – ලෝභිච්වය, යම්සේ දක්ෂ රන්කරුවෙක් හෝ රන්කරුවක්හු අතවැස්සෙක් හෝ මොනවට පිරියම් කළ රනෙහි යම් යම් ස්වර්ණවිකෘතියක් තමා කැමැත්තේ නම්, එය එය ම කරන්නේද, නිපදවන්නේද - එසේ ම ලෝභිච්වය, මහණ තෙමේ මෙසේ සමාහිත සිත පිරිසිදු කල්හි, පර්‍ය්‍යවදාත කල්හි, අංගණ රහිත කල්හි, උපක්ලේශ පහ වූ කල්හි, මෘදු වූ කල්හි, කර්‍මණ්‍ය කල්හි, ස්ථිත කල්හි, අචල බවට පැමිණැ සිටි කල්හි ඍද්ධිවිධය පිණිස සිත යොමු කෙරෙයි, නමා ලයි. හේ එකෙක් වැ බොහෝ පරිදි වේ ... බඹලොව තෙක් ද කයින් වශය පවත්වයි යන අනෙකවිධ සෘද්ධිවිධ අනුභව කෙරෙයි. ලෝභිච්වය, මහණ මෙසේ සිත සමාහිත වැ පිරිසිදු වූ කල්හි … බඹලොව දක්වා ද කයින් වශය පවත්වයි, අ‍නෙකවිධ සෘද්ධිවිධ අනුභව කෙරේ යන යමක් ඇද්ද, මේ ද ඔහුගේ ප්‍රඥාවෙක් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "78. ලෝභිච්වය, යම් ශාස්තෘවරයකු ‍කෙරෙහි සවු තෙම මෙබඳු මහත් ගුණවෙසෙසකට පැමිණේ නම්, මේ ද ලොවැ චෝදනාර්‍හ නො වූ ශාස්තෘවරයෙකි. යමෙක් මෙබඳු ශාස්තෘහට චෝදනා කෙරේ නම්, ඒ ‍චෝදනාව අභූත ය, අතථ්‍ය ය, අධාර්මික ය, සාවද්‍ය ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "79. හේ මෙසේ සිත සමාහිත වැ පිරිසිදු වූ කල්හි, දීප්තිමත් වූ කල්හි, කෙලෙස් රහිත වූ කල්හි, උපක්ලේශ පහ වැ ගිය කල්හී, මෘදු වූ කල්හි, කර්‍මණ්‍ය වූ කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පැමිණි කල්හි, දිව්‍යශ්‍රෝත්‍රධාතුව පිණිස (=දිවකන් නුවණ පිණිස) සිත යොමු කෙරෙයි, නැඹුරු කෙරෙයි. හේ පිරිසිදු වූ, මිනිසුන්ගේ ශ්‍රවණෝපචාරය ඉක්ම සිටි දිවකනින් දිව්‍ය වූ ද මානුෂක වූ ද දුරැ වූ ද ළඟැ වූ ද ද්විවිධ ශබ්ද ම අසයි. ලෝභිච්වය, යම්සේ මිනිසෙක් දික් මඟකට පිළිපන්නේ ද, හෝ බෙර හඬත් මිහිඟුබෙර හඬත් පණාබෙර හඬත් ගැටබෙර හඬත් යම් සේ අසන්නේ ද, ඒ අසන ඔහුට මේ බෙර හඬැයි කියාත් මේ මිහිඟුබෙර හඬැ යි කියාත් මේ සක් හඬ යැ, මේ පණාබෙර හඬ යැ, මේ ගැටබෙර හඬ යැ යි කියාත් මෙසේ සිතෙක් වන්නේ ද, ලෝභිච්වය, එපරිද්දෙන් ම මහණ තෙමේ මෙසේ සිත සමාහිත වූ වැ පිරිසිදු වූ කල්හි, දීප්තිමත් වූ කල්හි, කෙලෙස් රහිත වූ කල්හි, උපක්ලේශ පහ වැ ගිය කල්හි, මෘදු කල්හි, කර්‍මණ්‍ය (කර්‍මක්‍ෂම) වූ කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පැමිණි කල්හි, දිව්‍යශ්‍රොත්‍රධාතුව පිණිස සිත යොමු කෙරෙයි, නැඹුරු කෙරෙයි. හේ පිරිසිදු වූ, මිනිසුන්ගේ ශ්‍රවණෝපචාරය ඉක්මි දිවකන්නුවණින් දිව්‍ය වූත් මානුෂක වූත්, දුරැ වූත් ළඟැ වුත් ද්විවිධ ශබ්ද අසයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "80. ලෝහිච්චය, ඒ මහණ මෙසේ සිත සමාධිගත වැ පිරිසිදු වූ කල්හි ... දිව්‍ය වූ ද මානුෂක වූ ද, දුරැ වූ ද ළඟැ වූ ද ද්විවිධ ශබ්ද අසයි යන යමෙක් ඇද්ද, මේ ද ඔහුගේ ප්‍රඥාවෙක් වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 584,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "81. යස්මිං ඛො ලොහිච්ච සත්ථරි සාවකො එවරූපං උළාරං විසෙසං අධිගච්ඡති, අයම්පි ඛො ලොහිච්ච සත්ථා යො ලොකෙ න චොදනාරහො යො ච පනෙවරූපං සත්ථාරං චොදෙති, සා චොදනා අභූතා අතච්ඡා අධම්මිකා සාවජ්ජා."
                    },
                    {
                        "type": "paragraph",
                        "text": "82. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ චෙතොපරියඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො පරසත්තානං පරපුග්ගලානං චෙතසා චෙතො පරිච්ච පජානාති: සරාගං වා චිත්තං සරාගං චිත්තන්ති පජානාති. වීතරාගං වා චිත්තං වීතරාගං චිත්තන්ති පජානාති. සදොසං වා චිත්තං සදොසං චිත්තන්ති පජානාති. වීතදොසං වා චිත්තං වීතදොසං චිත්තන්ති පජානාති. සමොහං වා චිත්තං සමොහං චිත්තන්ති පජානාති. වීතමොහං වා චිත්තං වීතමොහං චිත්තන්ති පජානාති. සඞ්ඛිත්තං වා චිත්තං සඞ්ඛිත්තං චිත්තන්ති පජානාති. වික්ඛිත්තං වා චිත්තං වික්ඛිත්තං චිත්තන්ති පජානාති. මහග්ගතං වා චිත්තං මහග්ගතං චිත්තන්ති පජානාති. අමහග්ගතං වා චිත්තං අමහග්ගතං චිත්තන්ති පජානාති. සඋත්තරං වා චිත්තං සඋත්තරං චිත්තන්ති පජානාති. අනුත්තරං වා චිත්තං අනුත්තරං චිත්තන්ති පජානාති. සමාහිතං වා චිත්තං සමාහිතං චිත්තන්ති පජානාති. අසමාහිතං වා චිත්තං අසමාහිතං චිත්තන්ති පජානාති. විමුත්තං වා චිත්තං විමුත්තං චිත්තන්ති පජානාති. අවිමුත්තං වා චිත්තං අවිමුත්තං චිත්තන්ති පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "83. සෙය්යථාපි ලොහිච්ච ඉත්ථි වා පුරිසො වා දහරො වා යුවා මණ්ඩනජාතිකො ආදාසෙ වා පරිසුද්ධෙ පරියොදාතෙ අච්ඡෙ වා උදකපත්තෙ සකං මුඛනිමිත්තං පච්චවෙක්ඛමානො සකණිකං වා සකණිකන්ති ජානෙය්ය, අකණිකං වා අකණිකන්ති ජානෙය්ය, එවමෙව ඛො ලොහිච්ච භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ චෙතොපරියඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො පරසත්තානං පරපුග්ගලානං චෙතසා චෙතො පරිච්ච පජානාති: සරාගං වා චිත්තං සරාගං චිත්තන්ති පජානාති. වීතරාගං වා චිත්තං වීතරාගං චිත්තන්ති පජානාති. සදොසං වා චිත්තං සදොසං චිත්තන්ති පජානාති. වීතදොසං වා චිත්තං වීතදොසං චිත්තන්ති පජානාති. සමොහං වා චිත්තං සමොහං චිත්තන්ති පජානාති. වීතමොහං වා චිත්තං වීතමොහං චිත්තන්ති පජානාති. සඞ්ඛිත්තං වා චිත්තං -පෙ- වික්ඛිත්තං වා චිත්තං -පෙ- මහග්ගතං වා චිත්තං -පෙ- අමහග්ගතං වා චිත්තං -පෙ- සඋත්තරං වා චිත්තං -පෙ- අනුත්තරං වා චිත්තං -පෙ- සමාහිතං වා චිත්තං -පෙ- අසමාහිතං වා චිත්තං -පෙ- විමුත්තං වා චිත්තං විමුත්තං චිත්තන්ති පජානාති. අවිමුත්තං වා චිත්තං අවිමුත්තං චිත්තන්ති පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "84. යම්පි ලොහිච්ච භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ -පෙ- අවිමුත්තං වා චිත්තං අවිමුත්තං චිත්තන්ති පජානාති, ඉදම්පි’ස්ස හොති පඤ්ඤාය."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "81. ලෝහිච්චය, යම් ශාස්තෘවරයකු කෙරෙහි සවු තෙම මෙබඳු මහත් ගුණ වෙසෙසකට පැමිණේ නම්, ලෝහිච්චය, මේ ද ලොවැ චෝදනාර්‍හ නොවූ ශාස්තෘවරයෙකි. යමෙක් මෙබඳු ශාස්තෘහට චෝදනා කෙරේ නම්, ඒ චෝදනාව අභූතය, අතථ්‍ය ය, අධාර්මික ය, සාවද්‍ය ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "82. හේ මෙසේ සිත එකඟ වැ පිරිසිදු වූ කල්හි, දීප්තිමත් වූ කල්හි, කෙලෙස් රහිත වූ කල්හි, උපක්ලේශ පහ වැ ගිය කල්හි, මෘදු වූ කල්හි, කර්‍මක්‍ෂම වූ කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පැමිණි කල්හි, චෙතස්පර්‍යායඥානය පිණිස (=අනුත්ගේ සිත පිරිසිඳ දන්නා නුවණ පිණිස) සිත යොමු කෙරෙයි, නැඹුරු කෙරෙයි. හේ අන් සත්ත්‍වයන්ගේ අන් පුද්ගලයන්ගේ සිත සිය සිතින් පිරිසිඳැ දනියි: රාග සහිත සිත රාග සහිත සිතැ යි දනියි. රාග රහිත සිත රාග රහිත සිතැ යි දනියි. ද්වේෂ සහිත සිත ද්වේෂ සහිත සිතැයි දනී. ද්වේෂරහිත සිත ද්වේෂරහිත සිතැ යි දනී. මෝහසහිත සිත මෝහසහිත සිතැ යි දනී. මෝහරහිත සිත මොහරහිත සිතැ යි දනී. සංක්‍ෂිප්ත (=හැකුළුණූ) සිත හැකුළුණු සිතැ යි දනී. වික්‍ෂිප්ත (=විසුරුණු) සිත විසුරුණු සිතැ යි දනී. මහද්ගත සිත මහද්ගත සිතැ යි දනී. අමහද්ගත සිත අමහද්ගත සිතැ යි දනී. සොත්තර සිත සොත්තර සිතැ යි දනී. අනුත්තර සිත අනුත්තර සිතැ යි දනී. සමාහිත සිත සමාහිත සිතැ යි දනී. අසමාහිත සිත අසමාහිත සිතැ යි දනී. විමුක්ත (=මිදුණු) සිත විමුක්ත සිතැ යි දනී. අවිමුක්ත (=නොමිදුණු) සිත අවිමුක්ත සිතැ යි දනී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "83. ලෝහිච්චය, යම්සේ සැරැසෙනසුලු ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ ළදරුවෙක් හෝ තරුණයෙක් හෝ පිරිසිදු දීප්තිමත් කැඩපතෙක හෝ පහන් දියබඳුනෙක හෝ සිය මුවසටහන පිරික්සා බලන්නේ තලකැලැල් ආදි දොස් ඇති තැන් සදොස් තැනැ යි දන්නේ ද, එ කී දොස් නැති තැන දොස් නැතැ යි දන්නේ ද, ලෝහිච්චය, එ පරිද්දෙන් ම මහණ තෙමේ මෙසේ සිත සමාහිත වැ පිරිසිදු වූ කල්හි, දීප්ත වූ කල්හි, කෙලෙස් නැති වූ කල්හි, උපක්ලේ පහ වැ ගිය කල්හි, මෘදු වූ කල්හි, කර්‍මක්‍ෂම වූ කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පැමිණි කල්හි, පරසිත් දන්නා නුවණ පිණිස සිත යොමු කෙරෙයි, නැඹුරු කෙරෙයි. හේ අන් සතුන්ගේ, අන් පුඟුලන්ගේ සිත සිය සිතින් පිරිසිඳැ දනී. සරාග සිත සරාග සිතැ යි දනී. වීතරාග සිත වීතරාග සිතැ යි දනී. සද්වේෂ සිත සද්වේෂ සිතැ යි දනී. වීත ද්වේෂ සිත වීතද්වේෂ සිතැ යි දනී. සමොහ සිත සමෝහ සිතැ යි දනී. වීතමෝහ සිත වීතමෝහ සිතැ සි දනී. සංක්‍ෂිප්ත සිත සංක්‍ෂිප්ත සිතැ යි දනී. වික්ෂිප්ත සිත වික්‍ෂිප්ත සිතැයි දනී. මහද්ගත සිත මහද්ගත සිතැ යි ... අමහද්ගත සිත අමහද්ගත සිතැ යි ... සොත්තර සිත සොත්තර සිතැ යි ... අනුත්තර සිත අනුත්තර සිතැ යි ... සමාහිත සිත සමාහිත සිතැ යි ... අසමාහිත සිත අසමාහිත සිතැ යි ... විමුක්ත සිත විමුක්ත සිතැ යි ... අවිමුක්ත සිත අවිමුක්ත සිතැ යි දනී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "84. ලෝහිච්චය, මහණ තෙම මෙසේ සිත සමාධිගත වැ පිරිසිදු වූ කල්හි ... අවිමුක්ත සිත අවිමුක්ත සිතැ යි දනී යන යමක් ඇද්ද, මේත් ඔහුගේ ප්‍රඥාවෙක් වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 586,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "85. යස්මිං ඛො ලොහිච්ච සත්ථරි සාවකො එවරූපං උළාරං විසෙසං අධිගච්ඡති, අයම්පි ඛො ලොහිච්ච සත්ථා යො ලොකෙ න චොදනාරහො. යො ච පනෙවරූපං සත්ථාරං චොදෙති, සා චොදනා අභූතා අතච්ඡා අධම්මිකා සාවජ්ජා."
                    },
                    {
                        "type": "paragraph",
                        "text": "86. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ පුබ්බෙනිවාසානුස්සතිඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති. සෙය්යථිදං: එකම්පි ජාතිං ද්වෙ’පි ජාතියො තිස්සො’පි ජාතියො චතස්සො’පි ජාතියො පඤ්ච’පි ජාතියො දස’පි ජාතියො වීසම්පි ජාතියො තිංසම්පි ජාතියො චත්තාරීසම්පි ජාතියො පඤ්ඤාසම්පි ජාතියො ජාතිසතම්පි ජාතිසහස්සම්පි ජාතිසතසහස්සම්පි අනෙකෙ’පි සංවට්ටකප්පෙ අනෙකෙ’පි විවට්ටකප්පෙ අනෙකෙ’පි සංවට්ටවිවට්ටකප්පෙ ‘අමුත්රාසිං එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො අමුත්ර උපපාදිං. තත්රාපාසිං එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො ඉධූපපන්නො’ති. ඉති සාකාරං සඋද්දෙසං අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "87. සෙය්යථාපි ලොහිච්ච පුරිසො සකම්හා ගාමා අඤ්ඤං ගාමං ගච්ඡෙය්ය, තම්හා’පි ගාමා අඤ්ඤං ගාමං ගච්ඡෙය්ය, සො තම්හා ගාමා සකඤ්ඤෙව ගාමං පච්චාගච්ඡෙය්ය, තස්ස එවමස්ස: ‘අහං ඛො සකම්හා ගාමා අමුං ගාමං අගච්ඡිං. තත්ර එවං අට්ඨාසිං එවං නිසීදිං එවං අභාසිං එවං තුණ්හී අහොසිං. තම්හාපි ගාමා අමුං ගාමං අගච්ඡිං. තත්රාපි එවං අට්ඨාසිං එවං නිසීදිං එවං අභාසිං එවං තුණ්හී අහොසිං. සො’ම්හි තම්හා ගාමා සකඤ්ඤෙව ගාමං පච්චාගතො’ති. එවමෙව ඛො ලොහිච්ච භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ පුබ්බෙනිවාසානුස්සතිඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති. සෙය්යථිදං: එකම්පි ජාතිං ද්වෙ’පි ජාතියො තිස්සො’පි ජාතියො චතස්සො’පි ජාතියො පඤ්ච’පි ජාතියො දස’පි ජාතියො වීසම්පි ජාතියො තිංසම්පි ජාතියො චත්තාරීසම්පි ජාතියො පඤ්ඤාසම්පි ජාතියො ජාතිසතම්පි ජාතිසහස්සම්පි ජාතිසතසහස්සම්පි, අනෙකෙ’පි සංවට්ටකප්පෙ අනෙකෙ’පි විවට්ටකප්පෙ අනෙකෙ’පි සංවට්ටවිවට්ටකප්පෙ ‘අමුත්රාසිං එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො අමුත්ර උපපාදිං. තත්රාපාසිං එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො ඉධූපපන්නො’ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "85. ලෝහිච්චය, යම් ශාස්තෘවරයකු කෙරෙහි සවු තෙම මෙබඳු මහත් ගුණ වෙසෙසක් ලබා නම්, ලෝහිච්චය, මේ ද ලොවැ චෝදනාර්‍හ නොවූ ශාස්තෘවරයෙකි. යමෙක් මෙබඳු ශාස්තෘහට චෝදනා කෙරේ නම්, ඒ චෝදනාව අභූත ය, අතථ්‍ය ය, අධාර්මික ය, සාවද්‍ය ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "86. හෙ තෙමෙ මෙසේ සිත සමාහිත වැ පිරිසිදු වූ කල්හි, දීප්ත වූ කල්හි, කෙලෙස් නැති වූ කල්හි, උපක්ලේශ පහ වැ ගිය කල්හි, මෘදු වූ කල්හි, කර්‍මක්‍ෂම වූ කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පත් කල්හි, පූර්‍වෙනිවාසනානුස්මෘති ඥානය (=පෙර වුසු කඳ පිළිවෙළ දක්නා නුවණ) ලබනු පිණිස සිත යොමු කෙරෙයි. හේ එක් ජාතියක් ද ජාති දෙකක් ද ජාති තුනක් ද ජාති සතරක් ද ජාති පසක් ද ජාති දසයක් ද ජාති විස්සක් ද ජාති තිසක් ද ජාති සතළිසක් ද ජාති පනසක් ද ජාති සියක් ද ජාති දහසක් ද ජාති සුවහසක් ද, බොහෝ සංවර්‍ත කල්ප ද, බොහෝ විවර්‍ත කල්ප ද, බොහෝ සංවර්‍ත විවර්‍ත කල්ප ද, “අසෝ තන්හි මේ නම් ඇතියෙම් වීමි. මෙ ගොත් ඇතියෙම් වීමි. මෙබඳු පැහැ ඇතියෙම් වීමි. මෙබඳු ආහාර ඇතියෙම් වීමි. මෙ බඳු සුව දුක් විඳින්නෙම් වීම්. මෙ බඳු (මෙතෙක්) ආයු කෙළවර කොටැතියෙම් වීමි. ඒ මම් එයින් සැවැ අසෝ තැන උපනිමි. එහි ද මේ නම් ඈතියෙම් වීම්. මෙ ගොත් ඇතියෙම් වීමි, මෙ බඳු පැහැ සටහන් ඇතියෙම් වීමි. මෙ බඳු ආහාර ඇතියෙම් වීමි. මෙබඳු සුවදුක් විඳින්නෙම් වීමි. මෙතෙක් ආයු සීමාවක් ඇතීයෙම් වීමි. ඒ මම් එයින් සැව මෙහි උපනිමි”යි මෙසේ අනෙකවිධ වූ නම් ගොත් විසින් උද්දේශ සහිත වූ බහුවිධ වූ පුර්‍වෙනිවාසය සිහි කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "87. ලෝහිච්චය, යම්සේ පුරුෂයෙක් සිය ගමින් අන් ගමකට යන්නේ ද, ඒ ගමිනුත් අන් ගමකට යන්නේ ද, (නැවත) හේ එගමින් සිය ගමට ම වටාලා එන්නේ ද, එසේ වූ ඔහුට “මම් වූ කලි සිය ගමින් අසෝ ගමට ගියෙමි. එහි ද මෙසේ සිටියෙමි, මෙසේ හුන්නෙමි, මෙසේ කීමි, මෙසේ නිහඬ වීමි. ඒ ගමිනුත් අසෝ ගමට ගියෙමි. එහි ද මෙසේ සිටියෙමි, මෙසේ උන්නෙමි, මෙසේ කීමි, මෙසේ නිහඬ වීමි. ඒ මම් ඒ ගමින් සිය ගමට ම පෙරළා ආයෙම් වෙමි”යි ඔහුට මෙ බඳු සිතෙක් වන්නේ ද – ලෝහිච්චය, එපරිද්දෙන් ම මහණ තෙමේ මෙසේ සිත සමාහිත වැ පිරිසිදු කල්හි, දීප්ත කල්හි, කෙලෙස් රහිත කල්හි, උපක්ලේශ පහ වැ ගිය කල්හි, මෘදු වූ කල්හි, කර්‍මක්‍ෂම වූ කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පැමිණි කල්හි, පෙරැ වුසූ කඳ පිළිවෙළ සිහි කරන නුවණ පිණිස සිත මොනොවට යොමු කෙරෙයි, මොනොවට නැඹුරු කෙරෙයි. හේ එක් ජාතියක් ද, ජාති දෙකක් ද, ජාති තුතක් ද, ජාති සතරක් ද, ජාති පසක් ද, ජාති දසයක් ද, ජාති විස්සක් ද, ජාති තිසක් ද, ජාති සතළිසක් ද ජාති පනසක් ද, ජාති සියයක් ද, ජාති දහසක් ද, ජාති සුවහසක් ද, බොහෝ සංවර්‍ත කල්ප ද, බොහෝ විවර්‍ත කල්ප ද, බොහෝ සංවර්‍ත විවර්‍ත කල්පද, “අසෝ තන්හි මෙ නම් ඇතියෙම් වීමි, මේ බදු ගොත් ඇතියෙම් වීමි, මෙ බඳු පැහැ ඇතියෙම් වීමි, මේ බඳු ආහාර ඇතියෙම් වීමි, මෙ බඳු සුවදුක් විඳුනෙම් වීමි, මෙ බඳු ආයු සීමා ඇතියෙම් වීමි, ඒ මම් එයින් සැව අසෝ තැන උපනිමි. එහි ද මෙ නම ඇතියෙම්, මෙ ගොත් ඇතියෙම්, මෙ බඳු පැහැසටහන් ඇතියෙම් මෙ බඳු ආහාර ඇතියෙමි, මේ බඳු සුවදුක් විඳින්නෙම් වීමි, මෙතෙක් ආයු සීමා ඇතියෙම් වීමි. ඒ මම එයින් සැවැ මෙහි උපනිමි’යි -",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 588,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉති සාකාරං සඋද්දෙසං අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති. යම්පි ලොහිච්ච භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ -පෙ- අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති. ඉදම්පි’ස්ස හොති පඤ්ඤාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "88. යස්මිං ඛො ලොහිච්ච සත්ථරි සාවකො එවරූපං උළාරං විසෙසං අධිගච්ඡති, අයම්පි ඛො ලොහිච්ච සත්ථා යො ලොකෙ න චොදනාරහො. යො ච පනෙවරූපං සත්ථාරං චොදෙති, සා චොදනා අභූතා අතච්ඡා අධම්මිකා සාවජ්ජා."
                    },
                    {
                        "type": "paragraph",
                        "text": "89. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ සත්තානං චුතූපපාතඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සති චවමානෙ උපපජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති: ‘ඉමෙ වත භොන්තො සත්තා කායදුච්චරිතෙන සමන්නාගතා වචීදුච්චරිතෙන සමන්නාගතා මනොදුච්චරිතෙන සමන්නාගතා අරියානං උපවාදකා මිච්ඡාදිට්ඨිකා මිච්ඡාදිට්ඨිකම්මසමාදානා. තෙ කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපන්නා. ඉමෙ වා පන භොන්තො සත්තා කායසුචරිතෙන සමන්නාගතා වචීසුචරිතෙන සමන්නාගතා මනොසුචරිතෙන සමන්නාගතා අරියානං අනුපවාදකා සම්මාදිට්ඨිකා සම්මාදිට්ඨිකම්මසමාදානා. තෙ කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නා’ති. ඉති දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සති චවමානෙ උපපජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "90. සෙය්යථාපි ලොහිච්ච මජ්ඣෙ සිංඝාටකෙ පාසාදො. තත්ථ චක්ඛුමා පුරිසො ඨිතො පස්සෙය්ය මනුස්සෙ ගෙහං පවිසන්තෙ’පි නික්ඛමන්තෙ’පි රථියා වීථිසඤ්චරන්තෙ’පි මජ්ඣෙ සිංඝාටකෙ නිසින්නෙ’පි. තස්ස එවමස්ස: එතෙ මනුස්සා ගෙහං පවිසන්ති. එතෙ නික්ඛමන්ති. එතෙ රථියා වීථිසඤ්චරන්ති. එතෙ මජ්ඣෙ  සිංඝාටකෙ නිසින්නා’ති. එවමෙව ඛො ලොහිච්ච භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ සත්තානං චුතූපපාතඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සති චවමානෙ උපපජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති: ඉමෙ වත භොන්තො සත්තා කායදුච්චරිතෙන සමන්නාගතා වචීදුච්චරිතෙන සමන්නාගතා මනොදුච්චරිතෙන සමන්නාගතා අරියානං උපවාදකා මිච්ඡාදිට්ඨිකා මිච්ඡාදිට්ඨිකම්මසමාදානා -"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "මේ පරිද්දෙන් ආකාර සහිත වූ උද්දෙශ සහිත වූ පෙරැ වුසූ නන් වැදෑරුම් කඳපිළිවෙළ සිහි කෙරෙයි. ලෝහිච්චය, මහණ තෙම මෙසේ සිත සමාහිත වැ පිරිසිදු කල්හි … අනෙකවිධ වූ පෙරැ වුසූ කඳපිළිවෙළ සිහි කෙරෙයි යන යමෙක් ඇද්ද, මෙ ද ඔහුගේ ප්‍රඥාවෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "88. ලෝහිච්චය, යම් ශාස්තෘවරයකු කෙරෙහි සවු තෙම මෙබඳු මහත් ගුණ වෙසෙසක් ලබා නම්, ලෝහිච්චය, මේ ද ලොවැ චෝදනාර්‍හ නො වූ ශාස්තෘවරයෙක් වේ. යමෙක් මෙබඳු ශාස්තෘවරයකුට චෝදනා කෙරේ නම්, ඒ චෝදනාව අභූත ය, අතථ්‍ය ය, අධාර්මික ය, සාවද්‍ය ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "89. හේ මෙසේ සිත සමාහිත වැ පිරිසිදු කල්හි, දීප්ත කල්හි, කෙලෙස් නැති කල්හි, උපක්ලේශ පහ වූ කල්හි, මෘදු වූ කල්හි, කර්‍මක්‍ෂම වූ කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පැමිණි කල්හි, සත්ත්‍වයන්ගේ ච්‍යුති උප්පත්ති දක්නා නුවණ පිණිස සිත යොමු කෙරෙයි, නැඹුරු කෙරෙයි. හේ පිරිසිදු වූ, මිනිසුන්ගේ දර්‍ශනෝපචාරය ඉක්මැ දැක්කැ හැකි දිවැසින්, ‘අහෝ! මේ භවත් සත්ත්‍වයෝ කායදුශ්චරිතයෙන් සමන්විතයහ, වාග්දුශ්චරිතයෙන් සමන්විතයහ, මනෝදුශ්චරිතයෙන් සමන්විතයහ, ආර්‍යොපවාද කළහ, මිසදිටු වශයෙන් ගත් මිථ්‍යාව්‍රත ඇතියහ. ඒ මොහු කරජකය බිඳීමෙන් මරණින් මතු සැපයෙන් පහ වූ, දුෂ්ටකර්ම හේතුයෙන් හටගත් ගතිය වූ, (කර්‍මයට තමන් පරවශ බැවින්) තමනට අවශ වැ වැටෙන තැන වූ නිරයට වන්නාහ. මෙ භවත් සත්ත්‍වයෝ වූ කලි කායසුචරිතයෙන් සමන්විතයහ, වාක්සුචරිතයෙන් සමන්විතයහ, මනඃසුචරිතයෙන් සමන්විතයහ, ආර්‍ය්‍යයනට උපවාද නො කළහ, සම්දිටු ගත්තාහ, සම්දිටු වශයෙන් ගත් ශීලාදිය ඇත්තාහ. ඒ මොහු කාබුන් මරණින් මතු ශෝභන වූ ගති ඇති සඟලොවට වන්නාහ’ යි මරණාසන්න වූ ද, එකෙණෙහි පිළිසිඳ ගන්නා වූ ද, හීන වූ ද, උසස් වූ ද, මනා පැහැ සටහන් ඇති වූ ද, නොමනා පැහැ සටහන් ඇති වූ ද, සුගතියට පැමීණියා වූ ද, දුගතියට පැමිණියා වූ ද, කර්‍මය වූ පරිදි ඒ ඒ භවයට ගියා වූ ද සත්ත්‍වයන් දකී. මෙසේ හේ පිරිසිදු වූ, මානුෂක විෂය ඉක්මැ පැවැති දිවැසින් හීන ප්‍රණීත, සුවර්‍ණ දුර්‍වර්‍ණ, සුගත දුර්ගත සත්ත්‍වයත් දකී. කර්‍මය වූ පරිදි ඒ ඒ භවය කරා එළඹැ සිටී සත්ත්‍වයන් දකී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "90. ලෝහිච්චය, යම්සේ සතර මං හන්දියෙක මහල් සහිත ගෙයෙක් වන්නේ ද, එහි උඩු මහලෙහි ඇස් ඇති පුරුෂයෙක් සිටියේ ගෙට පිවිසෙනවුනුත් ‍ගෙන් නික්මෙනවුනුත් වීථියෙහි ඈත මෑත යන එනවුනුත්, සිවුමංහන්දිය මැද හුන්නවුනුත් දක්නේ ද, ඒ දක්නා ඔහුට “මේ මිනිස්සු ගෙට පිවිසෙත්. මේ මිනිස්සු ‍ගෙන් නික්මෙත්. මේ මිනිස්සු වීදියෙහි ඈත මෑත යෙත්, මොහු සිවුමංහන්දිය මැද හුන්නෝ වෙත් යැ” යි මෙසේ සිතෙක් වන්නේ ද, ලෝහිච්චය, එ පරිදි ම එ මහණ තෙමේ මෙසේ සිත සමාහිත වැ පිරිසිදු කල්හි දීප්තිමත් කල්හි කෙලෙස් නැති කල්හි උපක්ලේශ පහ වූ කල්හි මෘදු කල්හි කර්‍මක්‍ෂම කල්හි ස්ථිත කල්හි නිශ්චල බවට පැමිණි කල්හි, සත්ත්‍වයන්ගේ ච්‍යුති උප්පත්ති දක්නා නුවණ ලබනු පිණිස සිත යොමු කෙරෙයි, නැඹුරු කෙරෙයි. හේ මානුෂක විෂයය ඉක්මි පිරිසිදු වූ දිවැසින් “අහෝ, මේ භවත් සත්හු කායදුශ්චරිතයෙන් සමන්විතයහ, වාග්දුශ්චරිතයෙන් සමන්විතයභ, මනොදුශ්චරිතයෙන් සමන්විතයහ, ආර්‍ය්‍යයනට උපවාද කළහ, මිසදිටුවහ, මිසදිටු වශයෙන් ගත් ව්‍රත ඇතියහ. ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 590,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තෙ කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපන්නා. ඉමෙ වා පන භොන්තො සත්තා කායසුචරිතෙන සමන්නාගතා වචීසුචරිතෙන සමන්නාගතා මනොසුචරිතෙන සමන්නාගතා අරියානං අනුපවාදකා සම්මාදිට්ඨිකා සම්මාදිට්ඨිකම්මසමාදානා. තෙ කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නා’ති. ඉති දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සති චවමානෙ උපපජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති. යම්පි ලොහිච්ච භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ -පෙ- සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති, ඉදම්පි’ස්ස හොති පඤ්ඤාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "91. යස්මිං ඛො ලොහිච්ච සත්ථරි සාවකො එවරූපං උළාරං විසෙසං අධිගච්ඡ__ති__, අයම්පි ඛො ලොහිච්ච සත්ථා යො ලොකෙ න චොදනාරහො. යො ච පනෙවරූපං සත්ථාරං චොදෙති, සා චොදනා අභූතා අතච්ඡා අධම්මිකා සාවජ්ජා."
                    },
                    {
                        "type": "paragraph",
                        "text": "92. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ ආසවානං ඛයඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො ඉදං දුක්ඛන්ති යථාභූතං පජානාති. අයං දුක්ඛසමුදයො’ති යථාභූතං පජානාති. අයං දුක්ඛනිරොධො’ති යථාභූතං පජානාති. අයං දුක්ඛනිරොධගාමිනී පටිපදා’ති යථාභූතං පජානාති. ඉමෙ ආසවා’ති යථාභූතං පජානාති. අයං ආසවසමුදයො’ති යථාභූතං පජානාති. අයං ආසවනිරොධො’ති යථාභූතං පජානාති. අයං ආසවනිරොධගාමිනී පටිපදා’ති යථාභූතං පජානාති. තස්ස එවං ජානතො එවං පස්සතො කාමාසවාපි චිත්තං විමුච්චති. භවාසවාපි චිත්තං විමුච්චති. අවිජ්ජාසවාපි චිත්තං විමුච්චති. විමුත්තස්මිං විමුත්තමිති ඤාණං හොති. ඛීණා ජාති, වුසිතං බ්රහ්මචරියං, කතං කරණීයං, නාපරං ඉත්ථත්තායා’ති පජානාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඒ මොහු කා බුන් මරණින් මතු, සැපයෙන් පහ වූ, දුෂ්ට කර්‍මයෙන් උපන් ගතිය වූ, තමතට තමන් අවශ්‍ය වැ වැටෙන තැන වූ නිරයට වන්හ. එහෙත් මේ භවත් සත්ත්‍වයෝ වූ කලි කායසුවරිතයෙන් සමන්විතයහ, වාක්සුචරිතයෙන් සමන්විතයහ, මනඃසුචරිතයෙන් සමන්විතයහ, ආර්‍ය්‍යයනට උපවාද නො කළහ, සම්දිටු ගත්හ, සම්දිටු විසින් ගත් ශීලාදිය ඇත්තාහ. මොහු කා බුන් මරණින් මතු ශෝභන ගති ඇති සගලොවට වන්නාහ”යි මෙසේ මරණාසන්න වූ ද, එකෙණෙහි පිළිසඳ ගත්තාවූ ද, පහත් වූ ද, උසස් වූ ද, මනා පැහැ සටහන් ඇති වූ ද, නො මතා පැහැ සටහන් ඇති වූ ද, සුගතියට පැමිණියා වූ ද, දුගතියට පැමිණියා වූ ද, කර්‍මය වූ පරිදි ඒ ඒ භවයට ගිය සත්ත්‍වයන් දකී. මෙසේ පිරිසිදු වූ, මානුෂක විෂයය ඉක්මැ පැවැති දිවැසින් හීන ප්‍රණීත සුවර්‍ණ දූර්‍වර්‍ණ සුගත දුර්‍ගත සත්ත්‍වයන් දකී. කම් වූ පරිදි ඒ ඒ භවය කරා එළැඹැ සිටි සත්ත්‍වයන් දකී. ලෝහිච්චය, මහණ තෙම මෙසේ සිත සමාහිත වැ පිරිසිදු කල්හි ... සුගත දුර්ගත වූ කම් වූ පරිදි ඒ ඒ භවය කරා එළැඹැ සිටි සතුන් දකී යන යමෙක් ඇද්ද, මේ ද ඔහුගේ ප්‍රඥාවෙක් වෙයි."
                    },
                    {
                        "format": 13,
                        "text": "91. ලෝහිච්චය, යම් ශාස්තෘවරයකු කෙරෙහි සවු තෙම මෙබඳු මහත් ගුණ වෙසෙසක් ලබා නම්, ලෝහිච්චය, මේ ද ලොවැ චෝදනාර්‍හ නොවූ ශාස්තෘවරයෙකි. යමෙක් මෙබඳු ශාස්තෘහට චෝදනා කෙරේ නම්, ඒ චෝදනාව අභූත ය, අතථ්‍යය, අධාර්මික ය, සාවද්‍ය ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "92. හේ මෙසේ සමාහිත සිත පිරිසිදු වැ දීප්ත වැ නිකෙලෙස් වැ උපක්ලේශ පහ වැ මෘදු වැ කර්‍මක්‍ෂම වැ ස්ථිත වැ නිශ්චල බවට පැමිණැ සිටි කල්හි, ආස්‍රවයන්ගේ ක්‍ෂයය (විනාශය) පිණිස සිත මොනොවට යොමු කෙරෙයි, මොනොවට නැඹුරු කෙරෙයි. හෙ තෙමේ ‘මේ දුකැ’ යි ඇති සැටියෙන් දනී. ‘මේ දුක් ඉපැද්මට කාරණයැ’ යි ඇති සැටියෙන් දනී. ‘මේ දුක් වැනැස්මැ’යි (නිවනැ’ යි) ඇති සැටියෙන් දනී. ‘මේ දුක් වැනැස්මට යන පිළිවෙතැ’යි ඇති සැටියෙන් දනී. ‘මොහු ආස්‍රවයෝ යැ’යි ඇති සැටියෙන් දනී. ‘මේ ආස්‍රවයන් ඉපැද්මට කරුණැ’යි ඇති සැටියෙන් දනී. ‘මේ ආස්‍රවනිරෝධයැ’ යි ඇති සැටියෙන් දනී. ‘මේ ආස්‍රවනිරෝධගාමිනී ප්‍රතිපත්ති යැ’යි ඇති සැටියෙන් දනී. මෙසේ දන්නා මෙසේ දක්නා ඔහු සිත කාමාස්‍රවය කෙරෙන් ද මිදේ. ඔහු සිත භවාස්‍රවය කෙරෙන් ද මිදේ. ඔහු සිත අවිද්‍යාස්‍රවය කෙරෙන් ද මිදේ. (එසේ සිත) මිදුණු කල්හි ‘මා සිත ආඝ්‍රව කෙරෙන් මිදුණේ යැ’ යි (ප්‍රත්‍යවේක්‍ෂණ) ඥානය වේ. ‘භවෝත්පත්තිය ක්ෂීණ විය (හෙවත් නැවැත භවයෙහි නොඋපදනා ස්වභාවයට පැමිණියෙමි). ‘මඟබඹසර වැස නිමැවිණි. (සිවු සස්හි සතර මඟින්) කළ යුතු සොළොස් වැදෑරුම් කිස කොටැ නිමැවිණි. මේ බව පිණිස (=මේ ක්ලේශක්‍ෂයය පිණිස) යලි දු කටයුතු දැයෙක් නැතැ’යි හ දනී.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 592,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "93. සෙය්යථාපි ලොහිච්ච පබ්බතසඞ්ඛෙපෙ උදකරහදො අච්ඡො විප්පසන්නො අනාවිලො. තත්ථ චක්ඛුමා පුරිසො තීරෙ ඨිතො පස්සෙය්ය සිප්පිකම්බුකම්පි සක්ඛරකඨලම්පි මච්ඡගුම්බම්පි චරන්තම්පි තිට්ඨන්තම්පි. තස්ස එවමස්ස: අයං ඛො උදකරහදො අච්ඡො විප්පසන්නො අනාවිලො. තත්රිමෙ සිප්පිසම්බුකා’පි සක්ඛරකඨලා’පි චරන්ති’පි තිට්ඨන්ති’පීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "94. එවමෙව ඛො ලොහිච්ච භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ ආසවානං ඛයඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො ඉදං දුක්ඛන්ති යථාභූතං පජානාති. අයං දුක්ඛසමුදයො’ති යථාභූතං පජානාති. අයං දුක්ඛනිරොධො’ති යථාභූතං පජානාති. අයං දුක්ඛනිරොධගාමිනී පටිපදා’ති යථාභූතං පජානාති. ඉමෙ ආසවා’ති යථාභූතං පජානාති. අයං ආසවසමුදයො’ති යථාභූතං පජානාති. අයං ආසවනිරොධො’ති යථාභූතං පජානාති. අයං ආසවනිරොධගාමිනී පටිපදා’ති යථාභූතං පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "95. තස්ස එවං ජානතො එවං පස්සතො කාමාසවා’පි චිත්තං විමුච්චති. භවාසවා’පි චිත්තං විමුච්චති. අවිජ්ජාසවා’පි චිත්තං විමුච්චති. විමුත්තස්මිං විමුත්තමිති ඤාණං හොති. ඛීණා ජාති, වුසිතං බ්රහ්මචරියං, කතං කරණීයං, නාපරං ඉත්ථත්තායාති පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "96. යස්මිං ඛො ලොහිච්ච සත්ථරි සාවකො එවරූපං උළාරං විසෙසං අධිගච්ඡති, අයම්පි ඛො ලොහිච්ච සත්ථා යො ලොකෙ න චොදනාරහො. යො ච පනෙවරූපං සත්ථාරං චොදෙති, සා චොදනා අභූතා අතච්ඡා අධම්මිකා සාවජ්ජාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "97. එවං වුත්තෙ, ලොහිච්චො බ්රාහ්මණො භගවන්තං එතදවොච: සෙය්යථාපි භො ගොතම පුරිසො පුරිසං නරකප්පපාතං පපතන්තං කෙසෙසු ගහෙත්වා උද්ධරිත්වා ථලෙ පතිට්ඨාපෙය්ය, එවමෙවාහං භොතා ගොතමෙන නරකප්පපාතං පපතන්තො උද්ධරිත්වා ථලෙ පතිට්ඨාපිතො. අභික්කන්තං භො ගොතම අභික්කන්තං භො ගොතම. සෙය්යථාපි භො ගොතම නික්කුජ්ජිතං වා උක්කුජ්ජෙය්ය පටිච්ඡන්නං වා විවරෙය්ය මූළ්හස්ස වා මග්ගං ආචික්ඛෙය්ය අන්ධකාරෙ වා තෙලපජ්ජොතං ධාරෙය්ය චක්ඛුමන්තො රූපානි දක්ඛින්තීති. එවමෙව භොතා ගොතමෙන අනෙකපරියායෙන ධම්මො පකාසිතො. එසාහං භවන්තං ගොතමං සරණං ගච්ඡාමි ධම්මඤ්ච භික්ඛුසඞ්ඝඤ්ච. උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "ලොහිච්චසුත්තං නිට්ඨිතං ද්වාදසමං.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "93. ලෝහිච්චය, යම්සේ කඳු මුදුනෙකැ වූ, පහන් වූ, වෙසෙසින් පහන් වූ, නොකැලැඹුණු (=බොර නො වූ) දිය විලෙක් වන්නේ ද, එහි ඉවුරෙහි ඇස් ඇති මිනිසෙක් සිටියේ, එහි තුළැ හැසිරෙන්නා වූත් සිටුනා වූත් සිප්පිබෙල්ලනුත් සක්බෙල්ලනුත් කැටකැබිලිතිත් මත්ස්‍යසමූහයාත් දක්නේ ද, (එසේ දක්නා) ඔහුට “මේ දියවිල පහන් ය. වෙසෙසින් පහන් ය, නො කැලැඹුණේ ය. මෙහි මේ සිප්පිහුත් සක්බෙල්ලෝත් කැට කැබලිතීත් මත්ස්‍ය සමුහයෝත් හැසිරෙන්නෝත් සිටින්නෝත් වෙති” යි මෙසේ සිතෙක් වන්නේ ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "94. ලෝහිච්චය, එපරිද්දෙන් ම මහණ තෙමේ මෙසේ සමාහිත සිත පිරිසිදු වැ දිප්තිමත් වැ, නිකෙලෙස් වැ, උපක්ලේශ පහ වැ, මෘදු වැ, කර්‍මණ්‍ය වැ, ස්ථිත වැ, නිශ්චලතාවට පැමිණි කල්හි, ආස්‍රවක්‍ෂයඥානය පිණිස සිත යොමු කෙරෙයි, නැඹුරු කෙරෙයි. හේ ‘මේ දුකැ’යි ඇති සැටියෙන් දනී. ‘මෙ දුකට කරුණැ’යි ඇති සැටියෙන් දනී. ‘මේ දුක් වැනැස්මැ’යි ඇති සැටියෙන් දනී. ‘මේ දුක් වැනැස්මට පමුණුවන පිළිවෙතැ’යි ඇති සැටියෙන් දනී. ‘මොහු ආස්‍ර‍වයහ’යි ඇති සැටියෙන් දනී. මේ ආස්‍රවසමුදය යැ (ඉපැද්මට කරුණැ)’යි ඇති සැටියෙන් දනී. ‘මේ ආස්‍ර‍වනිරොධයැ’යි ඇති සැටියෙන් දනී. ‘මේ ආස්‍රවනිරෝධයට පැමිණෙන පිළිවෙතැ’යි ඇති සැටියෙන් දනී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "95. මෙසේ දන්නා, මෙසේ දක්නා, ඔහුගේ සිත කාමාස්‍ර‍වය කෙරෙන් ද මිදේ, භවාස්‍රවය කෙරෙන් ද මිදේ, අවිද්‍යාස්‍රවය කෙරෙන් ද මිදේ, මිදුණු කල්හි ‘මිදුණේ යැ’යි දැනීම වේ. භවෝත්පත්තිය ක්‍ෂීණ විය. මාර්‍ගබ්‍රහ්මචර්‍යය වැස නිමවන ලද්දේ ය. (සිවු සස්හි සිවු මගින්) කටයුතු (සොළොස් වැදෑරුම්) කෘත්‍යය කොටැ නිමැවිණ. මෙබව පිණිස (=මේ ක්ලේශක්‍ෂයය පිණිස) කළ යුතු අන් කිසිත් නැතැ’යි හේ දනී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "96. ලෝහිච්චය, යම් ශාස්තෘවරයකු කෙරෙහි සවු තෙම මෙබඳු උදාර ගුණ විශේෂයට පැමිණේ නම්, ලෝහිච්චය, මේ ශාස්තෘ තෙමේ ද ලොවැ චෝදනාර්‍හ නො වේ. යමෙක් මෙබඳු ශාස්තෘහට චෝදනා කෙරේ නම්, ඒ චෝදනාව අභූත ය, අතථ්‍ය ය, නොදැහැමිය, වරද සහිත ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "97. මෙසේ වදාළ කල්හි ලෝහිච්ච බමුණු තෙම, “භවද් ගෞතමයන් වහන්ස, යම්සේ පුරුෂයෙක් නරාවළක වැටෙන පුරුෂයකු හිසකෙසින් ගෙන ඔසොවා ගොඩැ සිටුවන්නේ ද, එසේ ම නිරාවළැ වැටෙන මම් භවද් ගෞතමයන් වහන්සේ විසින් ඔසවා ගොඩැ පිහිටුවන ලදිමි. භවද් ගෞතමයන් වහන්ස, අභිකාන්ත යැ. භවද් ගෞතමයන් වහන්ස, අභිකාන්ත යැ. වහන්ස, යම්සේ යටිකුරු කොට තබන ලද්දක් උඩුකුරු කරන්නේ හෝ වේ ද, වැසුණු දැයක් විවෘත කරන්නේ හෝ වේ ද, මංමුළා වූවකුට මඟ කියන්නේ හෝ වේ ද, ‘ඇස් ඇතියන් රූප දකිති’ යි අඳුරෙහි තෙල්පහනක් දරන්නේ හෝ වේ ද, එපරිද්දෙන් ම භවද් ගෞතමයන් වහන්සේ විසින් නොයෙක් කරුණින් දහම් පැවැසිණ. වහන්ස, ඒ මම් භවද් ගෞතමයන් වහන්සේ ද ධර්‍මය ද භික්‍ෂුසඞ්ඝයා ද සරණ යෙමි. වහන්ස, භවද් ගෞතමයන් වහන්සේ මා අද පටන් කොට දිවිහිමියෙන් සරණ ගිය උවසකු සේ සලකන සේක් වා” යී භාග්‍යවතුන් වහන්සේට සැළ කෙළේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 16,
                        "text": "දොළොස්වන ලෝහිච්ච සූත්‍ර‍ය නිමියේ ය.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ],
    "bookId": 10,
    "pageOffset": 0,
    "collection": "mula"
}