{
    "filename": "dn-1-6",
    "bookId": 10,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 324,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "6",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "මහාලිසුත්තං",
                        "level": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "1. එවං මෙ සුතං: එකං සමයං භගවා වෙසාලියං විහරති මහාවනෙ කූටාගාරසාලායං."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන සම්බහුලා කොසලකා ච බ්රාහ්මණදූතා මාගධකා ච බ්රාහ්මණදූතා වෙසාලියං පටිවසන්ති කෙනචිදෙව කරණීයෙන. අස්සොසුං ඛො තෙ කොසලකා ච බ්රාහ්මණදූතා මාගධකා ච බ්රාහ්මණදූතා, “සමණො ඛලු භො ගොතමො සක්යපුත්තො සක්යකුලා පබ්බජිතො වෙසාලියං විහරති මහාවනෙ කූටාගාරසාලායං. තං ඛො පන භවන්තං ගොතමං එවං කල්යාණො කිත්තිසද්දො අබ්භුග්ගතො: ‘ඉති’පි සො භගවා අරහං සම්මාසම්බුද්ධො විජ්ජාචරණසම්පන්නො සුගතො ලොකවිදූ අනුත්තරො පුරිසදම්මසාරථි සත්ථා දෙවමනුස්සානං බුද්ධො භගවා’ති. සො ඉමං ලොකං සදෙවකං සමාරකං සබ්රහ්මකං සස්සමණබ්රාහ්මණිං පජං සදෙවමනුස්සං සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදෙති. සො ධම්මං දෙසෙති ආදිකල්යාණං මජ්ඣෙකල්යාණං පරියොසානකල්යාණං සාත්ථං සබ්යඤ්ජනං කෙවලපරිපුණ්ණං පරිසුද්ධං බ්රහ්මචරියං පකාසෙති. සාධු ඛො පන තථාරූපානං අරහතං දස්සනං හොතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. අථ ඛො තෙ කොසලකා ච බ්රාහ්මණදූතා මාගධකා ච බ්රාහ්මණදූතා යෙන මහාවනං කූටාගාරසාලා තෙනුපසඞ්කමිංසු. තෙන ඛො පන සමයෙන ආයස්මා නාගිතො භගවතො උපට්ඨාකො හොති. අථ ඛො තෙ කොසලකා ච බ්රාහ්මණදූතා මාගධකා ච බ්රාහ්මණදූතා යෙනායස්මා නාගිතො තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා ආයස්මන්තං නාගිතං එතදවොචුං: “කහං නු ඛො භො නාගිත, එතරහි සො භවං ගොතමො විහරති? දස්සනකාමා හි මයං තං භවන්තං ගොතමන්ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“අකාලො ඛො ආවුසො භගවන්තං දස්සනාය. පටිසල්ලීනො භගවා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො තෙ කොසලකා ච බ්රාහ්මණදූතා මාගධකා ච බ්රාහ්මණදූතා තත්ථෙව එකමන්තං නිසීදිංසු: “දිස්වා’ව මයං තං භවන්තං ගොතමං ගමිස්සාමා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. ඔට්ඨද්ධො’පි ලිච්ඡවී මහතියා ලිච්ඡවීපරිසාය සද්ධිං යෙන මහාවනං කූටාගාරසාලා යෙනායස්මා නාගිතො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මන්තං නාගිතං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතො ඛො ඔට්ඨද්ධො’පි ලිච්ඡවී ආයස්මන්තං නාගිතං එතදවොච: “කහං නු ඛො භන්තෙ නාගිත, එතරහි සො භගවා විහරති අරහං සම්මාසම්බුද්ධො? දස්සනකාමා හි මයං තං භගවන්තං අරහන්තං සම්මාසම්බුද්ධන්ති.”"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "6.",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "මහාලි සූත්‍රය",
                        "level": 3
                    },
                    {
                        "format": 13,
                        "text": "1. මා විසින් මෙසේ අසන ලදි: එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ විසල්පුර අසල මහවෙනෙහි කුළාරහල් මඟ වෙහෙරෙහි වැඩැ වසන සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එ සමයෙහි වූ කලි කොසොල් රට වැසි බොහෝ බමුණු දූතයෝ ද මගද රට වැසි බොහෝ බමුණු දූතයෝ ද කිසි යම් ඇවැසි කටයුත්තෙකින් විසල් පුරැ (අවුත්) වෙසෙති. කොසොල් රටින් පැමිණි ද මගදරටින් පැමිණි ද එ බමුණු දූතයෝ රටේ පැතිරැ පැවැති මේ කතාව ඇසූහ: (මෙ බඳු කතාවෙක් ඔවුන් කනැ වැටිණ.) “සැහැකුළෙන් නික් මැ පැවිදි වූ සැහැපුත් මහණ ගොයුම් තෙමේ වනාහි (මෙ සමයෙහි) විසල්පුරැ මහවෙනෙහි කුළාරහල් වෙහෙරැ වෙසෙයි. ‘ඒ භගවත් තෙමේ මේ මේ කරුණිනුත් රහත් ය, සම්මාසම්බුදු ය, විද්‍යාචරණ සම්පන්න ය, සුගත ය, ලොකවිත් ය, නිරුත්තර පුරුෂදම්‍යසාරථී ය, දෙව්මිනිස්නට ශාස්තෘ ය, බුද්ධ ය, භගවත් යැ’ යී ඒ පින්වත් ගොයුම්හු පිළිබඳ කලණ කිත් හඬ උස් වැ නැංගේ ය. ඒ පින්වත් ගොයුම් තෙමේ දෙවියන් සහිත මරුන් සහිත බඹුන් සහිත මේ ලොව, මහණ බමුණන් සහිත දෙව් මිනිසුන් සහිත සත් වග තෙමේ ම වෙසෙසින් දැන පසක් කොට (ලොවට) දන්වයි. හේ මුල කලණ වූ මැද කලණ වූ අග කලණ වූ අරුත් සහිත අකුරු සපුව සහිත හැම ලෙසින් පිරිපුන් දහම් දෙසයි. පිරිසිදු බඹසර පවසයි. එ බඳු වූ රහතුන් දැක්ම වූ කලි හිත වැඩ එළවනුයේ වෙයි”යනු යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "2. ඉක්ඛිති, කොසොල් රටින් ද මගද රටින් ද පැමිණ ඒ බමුණුදූතයෝ මහවෙනෙහි කුළාරහල් වෙහෙරට එළැඹියහ. එ සමයෙහි නාගිත තෙරණුවෝ භාග්‍යවතුන් වහන්සේගේ උවටු වෙති. ඉක්බිති ඒ දෙරටින් ම ආ බමුණු දූතයෝ නාගිත තෙරුන් කරා ගියහ. ගොස්, ‘පින්වත් තාගිතයිති, දැන් ඒ පින්වත් ගොයුමාණෝ කොහි වෙසෙත් ද? අපි වනාහි ඒ භවත් ගොයුමාණන් දක්නා රිසියම්හ’යි කීහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ඇවැත්නි, භාග්‍යවතුන් වහන්සේ දක්නට (දැන්) කල් නො වේ ම ය. භාග්‍යවතුන් වහන්සේ (දැන්) පිළිසලනෙහි යෙදුණු සේක් වෙති”යී (නාගිත තෙරණුවෝ වදාළහ.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එ විටැ ඒ බමුණු දූතයෝ ‘අපි ඒ පින්වත් ගොයුමාණන් දැකැ ම යන්නම්හ’ යී එහි ම එක් පසෙකැ හිඳ ගත්හ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "3. ඔට්ඨද්ධ ලිච්ඡවි තෙමේ ද මහත් ලිච්ජවි පිරිසක් හා මහවනයට කුළාරහලට, එහි නාගිත තෙරුන් වෙත එළැඹියේ ය. එළැඹ, නාගිත තෙරුන් වැඳ පසෙකැ සිටියේ ය. පසෙකැ සිටි ඔට්ඨද්ධ ලිච්ඡවි තෙමේ ද නාගිත තෙරුනට “වහන්ස, දැන් ඒ භාග්‍යවත් අර්හත් සම්‍යක්සම්බුද්ධයන් වහන්සේ කොහි වසන සේක් ද? අපි ඒ භගවත් රහත් සම්මාසම්බුදුන් දක්නා රිස්සමෝ”යී මෙ බස් කී ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 326,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“අකාලො ඛො මහාලි භගවන්තං දස්සනාය. පටිසල්ලීනො භගවා”ති. ඔට්ඨද්ධොපි ලිච්ඡවී තත්ථෙව එකමන්තං නිසීදි. “දිස්වාව අහං තං භගවන්තං ගමිස්සාමි අරහන්තං සම්මාසම්බුද්ධන්ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "4. අථ ඛො සීහො සමණුද්දෙසො යෙනායස්මා නාගිතො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මන්තං නාගිතං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. ‘එකමන්තං ඨිතො ඛො සීහො සමණුද්දෙසො ආයස්මන්තං නාගිතං එතදවොච: එතෙ භන්තෙ කස්සප, සම්බහුලා කොසලකා ච බ්රාහ්මණදූතා මාගධකා ච බ්රාහ්මණදූතා ඉධූපසඞ්කන්තා භගවන්තං දස්සනාය. ඔට්ඨද්ධො’පි ලිච්ඡවී මහතියා ලිච්ඡවීපරිසාය සද්ධිං ඉධූපසඞ්කන්තො භගවන්තං දස්සනාය. සාධු භන්තෙ කස්සප ලභතං එසා ජනතා භගවන්තං දස්සනායා’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘තෙන හි සීහ, ත්වඤ්ඤෙව භගවතො ආරොචෙහීති’. ‘එවං භන්තෙ’ති ඛො සීහො සමණුද්දෙසො ආයස්මතො නාගිතස්ස පටිස්සුත්වා යෙන භගවා තෙනුපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතො ඛො සීහො සමණුද්දෙසො භගවන්තං එතදවොච: “එතෙ භන්තෙ සම්බහුලා කොසලකා ච බ්රාහ්මණදූතා මාගධකා ච බ්රාහ්මණදූතා ඉධූපසඞ්කන්තා භගවන්තං දස්සනාය, ඔට්ඨද්ධො’පි ලිච්ඡවී මහතියා ලිච්ඡවීපරිසාය සද්ධිං ඉධූපසඞ්කන්තො භගවන්තං දස්සනාය. සාධු භන්තෙ ලභතං එසා ජනතා භගවන්තං දස්සනායා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තෙන හි සීහ විහාරපච්ඡායායං ආසනං පඤ්ඤාපෙහී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“එවං භන්තෙ’ති ඛො සීහො සමණුද්දෙසො භගවතො පටිස්සුත්වා විහාරපච්ඡායායං ආසනං පඤ්ඤාපෙසි. අථ ඛො භගවා විහාරා නික්ඛම්ම විහාරපච්ඡායායං පඤ්ඤත්තෙ ආසනෙ නිසීදි."
                    },
                    {
                        "type": "paragraph",
                        "text": "5. අථ ඛො තෙ කොසලකා ච බ්රාහ්මණදූතා මාගධකා ච බ්රාහ්මණදූතා යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදිංසු. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදිංසු. ඔට්ඨද්ධො’පි ලිච්ඡවී මහතියා ලිච්ඡවීපරිසාය සද්ධිං යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ඔට්ඨද්ධො ලිච්ඡවී භගවන්තං එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "“පුරිමානි භන්තෙ දිවසානි පුරිමතරානි සුනක්ඛත්තො ලිච්ඡවිපුත්තො යෙනාහං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා මං එතදවොච: ‘යදග්ගෙ අහං මහාලි, භගවන්තං උපනිස්සාය විහරාමි න චිරං තීණි වස්සානි, දිබ්බානි හි ඛො රූපානි පස්සාමි පියරූපානි කාමූපසංහිතානි රජනීයානි. නො ච ඛො දිබ්බානි සද්දානි සුණාමි පියරූපානි කාමූපසංහිතානි රජනීයානී”ති. සන්තානෙව නු ඛො භන්තෙ සුනක්ඛත්තො ලිච්ඡවිපුත්තො දිබ්බානි සද්දානි නාස්සොසි පියරූපානි කාමූපසංහිතානි රජනීයානි උදාහු අසන්තානී”? ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "“මහාලිය, භාග්‍යවතුන් වහන්සේ දක්නට දත් නොකල් ය. භාග්‍යවතුන් වහන්සේ දැන් පිළිසලනෙහි යෙදී හිඳිනා සේකැ”යී තෙරණුවෝ වදාළහ. ඔට්ඨද්ධ ලිච්ඡවී තෙමේත් “ඒ භාග්‍යවත් අර්‍හත් සම්‍යක්සම්බුද්ධයන් වහන්සේ දැකැ ම යන්නෙමි”යී එහි ම එක් පසෙකැ හිඳැ ගත්තේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "4. එකල්හි වනාහි සිංහ නම් හෙරණ නාගිත තෙරුන් කරා ගියේ ය. ගොස් තෙරුන් වැඳ, පසෙකැ සිටියේ ය. පසෙකැ සිටි හෙරණ තෙම කාශ්‍යපයන් වහන්ස, මේ කොසොල් රටින් ද මගද රටින් ද පැමිණැ සිටින බමුණු දූතයෝ භාග්‍යවතුන් වහන්සේ දක්නට මෙහි එළැඹියාහ. ඔට්ඨද්ධ ලිච්ඡවී ද මහත් ලිච්ඡවී පිරිසක් හා කැටුව භාග්‍යවතුන් වහන්සේ දකිනු පිණිස මෙහි එළැඹියේ වෙයි. කාශ්‍යපයන් වහන්ස, මේ ජනමුළුව භාග්‍යවතුන් වහන්සේ දක්නට ලබතොත් මැනැවැ”යී සැළ කෙළේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“සිංහය, එසේ වී නම්, තෙපි ම භාග්‍යවතුන් වහන්සේට සැළ කරව”යී (තෙරණුවෝ වදාළහ.) “එසේ ය, වහන්සැ’ යී ම සිංහ හෙරණ තෙම නාගිත තෙරුනට පිළිවදන් දී භාග්‍යවතුන් වහන්සේ කරා ගියේ ය, ගොස්, භාග්‍යවතුන් වහන්සේ වැඳ පසෙක සිටියේ ය. එසේ සිට, “වහන්ස, කොසොල් මගද යන දෙ රටින් පැමිණි මේ බොහෝ වූ බමුණු දූතයෝ භාග්‍යවතුන් වහන්සේ දක්නා පිණිස මෙහි එළැඹියෝ වෙති. ඔට්ඨද්ධ ලීව්ජවී ද මහත් ලිච්ජවි පිරිසක් කැටුව භාග්‍යවතුන් වහන්සේ දක්නා පිණිස මෙහි එළැඹියේ වෙයි. වහන්ස, මේ ජනමුළුව භාග්‍යවතුන් වහන්සේ දක්නට ලබතොත් මැනැවැ”යී කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“සිංහය, එසේ නම් විහාරප්‍රාක්ඡායායෙහි (වෙහෙර ඉදිරි පසැ සෙවණෙහි) අස්නක් පණවව”යී (භාග්‍යවතුන් වහන්සේ වදාළ සේක).",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“එසේ ය වහන්සැ”යී ම සිංහ හෙරණ භාග්‍යවතුන් වහන්සේට පිළිවදන් දී වෙහෙර ඉදිරියේ සෙවණෙහි අස්නක් පැණැවී ය. එ විටැ භාග්‍යවතුන් වහන්සේ වෙහෙරින් නික්මැ වෙහෙර ඉදිරි පසැ සෙවණෙහි පැණැවුණු අස්නැ වැඩැහුන් සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "5. ඉක්බිති ඒ කොසොල් මගද දෙරටින් ආ බමුණු දූතයෝ භාග්‍යවතුන් වෙත එළැඹියාහ, එළැඹැ ඔබ හා සතුටු වූහ. සතුටු වියැ යුතු සිහි කටයුතු (සිතැ රැඳවියැ යුතු) කතා නිමවා පසෙකැ හිඳ ගත්හ. ඔට්ඨද්ධ ලිච්ජවි ද මහත් ලිච්ඡවි පිරිස හා භාග්‍යවතුන් වහන්සේ වෙත එළැඹියේ ය. එළැඹැ ඔබ වැඳැ පසෙක හිඳැ ගත්තේ ය. එසේ පසෙකැ හිඳැ ගත් ම ඔට්ඨද්ධ ලිච්ජවි තෙම භාග්‍යවතුන් වහන්සේට මෙසේ කී ය:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, ඊයේ දවසැ ද එයිනුත් පෙර දිනවල ද ලිච්ඡවී පුත්‍ර සුනක්ඛත්ත තෙමේ මා වෙත ආයේ ය. අවුත් මට ‘මහාලිය, යම් දිනෙක පටන් තුන් හවුරුදු පමණ වූ නොබෝ කලක් මම් භාග්‍යවතුන් වහන්සේ ඇසුරු කොටැ විසිම් ද, ඒ කාලය තුළැ කම්රස යුත් මිහිරි වූ, සිත් අලවන දෙව් රූ වූ කලි දිටිමි. වැලි කම්රස ඇති, මිහිරි වූ, සිත් අලවන දෙව් හඬ නො ම ඇසීමි’ යී කී ය. වහන්ස, ලිච්ඡවිපුත්‍ර සුනක්ඛත්තයා ඇත්තා වූ ම මිහිරි කම්රස ඇති සිත් අලවන දෙව් හඬ නො ඇසී ද? නැතහොත් නැත්තාවූ ම එසේ වූ දෙව්හඬ නො ඇසී ද?” (යනු යී).",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 328,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“සන්තානෙව ඛො මහාලි සුනක්ඛත්තො ලිච්ඡවිපුත්තො දිබ්බානි සද්දානි නාස්සොසි පියරූපානි කාමූපසංහිතානි රජනීයානි නො අසන්තානී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "6. “කො නු ඛො භන්තෙ හෙතු කො පච්චයො, යෙන සන්තානෙව සුනක්ඛත්තො ලිච්ඡවිපුත්තො දිබ්බානි සද්දානි නාස්සොසි පියරූපානි කාමූපසංහිතානි රජනීයානි, නො අසන්තානී?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“ඉධ මහාලි භික්ඛුනො පුරත්ථිමාය දිසාය එකංසභාවිතො සමාධි හොති දිබ්බානං රූපානං දස්සනාය පියරූපානං කාමූපසංහිතානං රජනීයානං, නො ච ඛො දිබ්බානං සද්දානං සවණාය පියරූපානං කාමූපසංහිතානං රජනීයානං. සො පුරත්ථිමාය දිසාය එකංසභාවිතෙ සමාධිම්හි දිබ්බානං රූපානං දස්සනාය පියරූපානං කාමූපසංහිතානං රජනීයානං, නො ච ඛො දිබ්බානං සද්දානං සවණාය පියරූපානං කාමූපසංහිතානං රජනීයානං. පුරත්ථිමාය දිසාය දිබ්බානි රූපානි පස්සති පියරූපානි කාමූපසංහිතානි රජනීයානි, නො ච ඛො දිබ්බානි සද්දානි සුණාති පියරූපානි කාමූපසංහිතානි රජනීයානි. තං කිස්ස හෙතු: එවං හෙතං මහාලි හොති භික්ඛුනො පුරත්ථිමාය දිසාය එකංසභාවිතෙ සමාධිම්හි දිබ්බානං රූපානං දස්සනාය පියරූපානං කාමූපසංහිතානං රජනීයානං, නො ච ඛො දිබ්බානං සද්දානං සවණාය පියරූපානං කාමූපසංහිතානං රජනීයානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "7. පුන ච පරං මහාලි භික්ඛුනො දක්ඛිණාය දිසාය -පෙ- පච්ඡිමාය දිසාය -පෙ- උත්තරාය දිසාය -පෙ- උද්ධමධො තිරියං එකංසභාවිතො සමාධි හොති දිබ්බානං රූපානං දස්සනාය පියරූපානං කාමූපසංහිතානං රජනීයානං, නො ච ඛො දිබ්බානං සද්දානං සවනාය පියරූපානං කාමූපසංහිතානං රජනීයානං. සො උද්ධමධො තිරියං එකංසභාවිතෙ සමාධිම්හි දිබ්බානං රූපානං දස්සනාය පියරූපානං කාමූපසංහිතානං රජනීයානං, නො ච ඛො දිබ්බානං සද්දානං සවණාය පියරූපානං කාමූපසංහිතානං රජනීයානං, උද්ධමධො තිරියං දිබ්බානි රූපානි පස්සති පියරූපානි කාමූපසංහිතානි රජනීයානි, නො ච ඛො දිබ්බානි සද්දානි සුණාති පියරූපානි කාමූපසංහිතානි රජනීයානි. තං කිස්ස හෙතු? එවං හෙතං මහාලි හොති භික්ඛුනො දක්ඛිණාය දිසාය -පෙ- උද්ධමධො තිරියං එකංසභාවිතෙ සමාධිම්හි දිබ්බානං රූපානං දස්සනාය පියරූපානං කාමූපසංහිතානං රජනීයානං, නො ච ඛො දිබ්බානං සද්දානං සවනාය පියරූපානං කාමූපසංහිතානං රජනීයානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "8. ඉධ මහාලි භික්ඛුනො පුරත්ථිමාය දිසාය එකංසභාවිතො සමාධි හොති දිබ්බානං සද්දානං සවණාය පියරූපානං කාමූපසංහිතානං රජනීයානං, නො ච ඛො දිබ්බානං රූපානං දස්සනාය පියරූපානං කාමූපසංහිතානං රජනීයානං. සො පුරත්ථිමාය දිසාය එකංසභාවිතෙ සමාධිම්හි දිබ්බානං සද්දානං සවණාය පියරූපානං කාමූපසංහිතානං රජනීයානං, නො ච ඛො දිබ්බානං රූපානං දස්සනාය පියරූපානං කාමූපසංහිතානං රජනීයානං. පුරත්ථිමාය දිසාය දිබ්බානි සද්දානි සුණාති පියරූපානි කාමූපසංහිතානි රජනීයානි, නො ච ඛො දිබ්බානි රූපානි පස්සති පියරූපානි කාමූපසංහිතානි රජනීයානි. තං කිස්ස හෙතු: එවං හෙතං මහාලි හොති භික්ඛුනො පුරත්ථිමාය දිසාය එකංසභාවිතෙ සමාධිම්හි දිබ්බානං සද්දානං සවණාය පියරූපානං කාමූපසංහිතානං රජනීයානං, නො ච ඛො දිබ්බානං රූපානං දස්සනාය පියරූපානං කාමූපසංහිතානං රජනීයානං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "“මහාලිය, නැත්තා වූ දෙව් හඬ නො ව ඇත්තා වූ ම මිහිරි වූ, කම්රස යුත් සිත් අදනා දෙව්හඬ ලිච්ඡවීපුත්‍ර සුනක්ඛත්ත තෙම නො ඇසී යැ”යී (භාග්‍යවතුන් වහන්සේ වදාළ සේක.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "6. “වහන්ස, යම් හෙයෙකින් ලිච්ඡවීපුත්‍ර සුනක්බත්තයා නැත්තා වූ හඬක් නො ව ඇත්තා වූ ම, මිහිරි වූ, කම්රස යුත්, සිත් අදනා දෙව්හඩ නො ඇසී නම්, එයට හේතු කවර යැ? ප්‍රත්‍යයය කවරයැ?” (යී මහාලී පුළුවුත).",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“මහාලිය, මෙහි මහණක්හු විසින් මිහිරි වූ, කම් රසයෙන් යුත්, සිත් අලවන දෙව් රූ දක්නා පිණිස පෙර දිගට සමාධිය එක්කොටසක් වඩන ලද්දේ වෙයි ද, මිහිරි වූ කම්රසයෙන් යුත්, සිත් අලවන දෙව්හඩ අසනු පිණිස සමාධිය වඩන ලද්දේ නො වෙයි ද, හේ එසේ මිහිරි වූ … දෙව්හඬ අසනු පිණිස නො වැ දෙව් රූ දක්නා පිණිස පෙර දිගට සමාධිය එක් කොටසක් වඩනා ලද කල්හි පෙර දිගැ වූ මිහිරි … දෙව්රූ දකී. එහෙත් මිහිරි … දෙව්හඬ නො අසයි. ඒ කවර හෙයින යත්: මහාලිය, මහණ විසින් මිහිරි වූ … දෙව් හඬ අසනු පිණිස නො වැ මිහිරි වූ … දෙව් රූ පිළිබඳ එක් කොටසක් ම පිණිස පෙර දිගට සමාධිය වඩන ලද කල්හි මෙය මෙසේ වෙයි. එහෙයිනි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "7. තවද මහාලිය, මහණහු විසින් මිහිරි වූ කම්රසයෙන් යුත්, සිත් අලවන දෙව්හඬ අසනු පිණිස නොවැ, මිහිරි වූ … දෙව්රූ දක්නා පිණිස දකුණු දෙසට, … පැසිම් දෙසට, … උතුරු දෙසට, … උඩ දෙසට, … යට දෙසට, … සරසට සමාධිය එක් කොටසක් වඩන ලද්දේ වෙයි ද, හේ මිහිරි වූ ... දෙව්හඬ අසනු පිණිස නොවැ, මිහිරි වූ … දෙව් රූ දක්නා පිණිස දකුණු දෙසට … උඩ දෙසට ... යට දෙසට … සරසට සමාධිය එක් කොටසක් වඩන ලද කල්හි, මිහිරි වූ … දෙව් රූ දකී, එහෙත් මිහිරි වූ … දෙව්හඬ නො අසයි. ඒ කවර හෙයින යත්: මහාලිය, එ මහණහු විසින් මිහිරි වූ ... දෙවිහඬ අසනු පිණිස නො වැ, මිහිරි වූ දෙව් රූ දක්නා පිණිස දකුණු දෙසට … උඩ දෙසට … යට දෙසට … සරසට සමාධිය එක් කොටසක් වඩනා ලද කල්හි මෙය මෙසේ ම වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "8. මහාලිය, මෙහි මහණහු විසින් මිහිරි වූ කම්රසයෙන් යුත් සිත් අලවන දෙව්රූ දක්නා පිණිස නො වැ මිහිරි වූ … දෙව්හඬ අසනු පිණිස පෙර දිගට සමාධිය එක් කොටසක් වඩන ලද්දේ වෙයි නම්, එසේ හෙ තෙම, මිහිරි වූ … දෙව්රූ දක්නා පිණිස නො වැ මිහිරි … දෙව්හඬ අසනු පිණිස පෙරදිගට එක් කොටසක් සමාධිය වැඩු කල්හි, පෙර දිගැ, මිහිරි … දෙව්හඬ අසයි. මිහිරි … දෙව් රූ නො ම දකී. ඒ කවර හෙයින යත්: මහාලිය, මහණහු විසින් මිහිරි වූ … දෙව් රූ දක්නා පිණිස නොවැ, මිහිරි වූ … දෙව් හඬ අසනු පිණිස පෙර දිගට සමාධිය එක් කොටසක් වැඩූ කල්හි මෙය මෙසේ වෙයි. එ හෙයිනි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 330,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "9. පුන ච පරං මහාලි භික්ඛුනො දක්ඛිණාය දිසාය -පෙ- පච්ඡිමාය දිසාය -පෙ- උත්තරාය දිසාය -පෙ- උද්ධමධො තිරියං එකංසභාවිතො සමාධි හොති දිබ්බානං සද්දානං සවණාය පියරූපානං කාමූපසංහිතානං රජනීයානං, නො ච ඛො දිබ්බානං රූපානං දස්සනාය පියරූපානං කාමූපසංහිතානං රජනීයානං. සො දක්ඛිණාය දිසාය -පෙ- තිරියං එකංසභාවිතෙ සමාධිම්හි දිබ්බානං සද්දානං සවණාය පියරූපානං කාමූපසංහිතානං රජනීයානං, නො ච ඛො දිබ්බානං රූපානං දස්සනාය පියරූපානං කාමූපසංහිතානං රජනීයානං. උද්ධමධො තිරියං දිබ්බානි සද්දානි සුණාති පියරූපානි කාමූපසංහිතානි රජනීයානි, නො ච ඛො දිබ්බානි රූපානි පස්සති පියරූපානි කාමූපසංහිතානි රජනීයානි. තං කිස්ස හෙතු? එවං හෙතං මහාලි හොති භික්ඛුනො දක්ඛිණාය දිසාය -පෙ- තිරියං එකංසභාවිතෙ සමාධිම්හි දිබ්බානං සද්දානං සවණාය පියරූපානං කාමූපසංහිතානං රජනීයානං, නො ච ඛො දිබ්බානං රූපානං දස්සනාය පියරූපානං කාමූපසංහිතානං රජනීයානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "10. ඉධ මහාලි භික්ඛුනො පුරත්ථිමාය දිසාය උභයංසභාවිතො සමාධි හොති දිබ්බානඤ්ච රූපානං දස්සනාය පියරූපානං කාමූපසංහිතානං රජනීයානං, දිබ්බානඤ්ච සද්දානං සවණාය පියරූපානං කාමූපසංහිතානං රජනීයානං. සො පුරත්ථිමාය දිසාය උභයංසභාවිතෙ සමාධිම්හි දිබ්බානඤ්ච රූපානං දස්සනාය පියරූපානං කාමූපසංහිතානං රජනීයානං, දිබ්බානඤ්ච සද්දානං සවණාය පියරූපානං කාමූපසංහිතානං රජනීයානං, පුරත්ථිමාය දිසාය දිබ්බානි ච රූපානි පස්සති පියරූපානි කාමූපසංහිතානි රජනීයානි, දිබ්බානි ච සද්දානි සුණාති පියරූපානි කාමූපසංහිතානි රජනීයානි. තං කිස්ස හෙතු? එවං හෙතං මහාලි හොති භික්ඛුනො පුරත්ථිමාය දිසාය උභයංසභාවිතෙ සමාධිම්හි දිබ්බානඤ්ච රූපානං දස්සනාය පියරූපානං කාමූපසංහිතානං රජනීයානං, දිබ්බානඤ්ච සද්දානං සවණාය පියරූපානං කාමූපසංහිතානං රජනීයානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "11. පුන ච පරං මහාලි, භික්ඛුනො දක්ඛිණාය දිසාය -පෙ- පච්ඡිමාය දිසාය -පෙ- උත්තරාය දිසාය -පෙ- උද්ධමධො තිරියං උභයංසභාවිතො සමාධි හොති දිබ්බානඤ්ච රූපානං දස්සනාය පියරූපානං කාමූපසංහිතානං රජනීයානං, දිබ්බානඤ්ච සද්දානං සවණාය පියරූපානං කාමූපසංහිතානං රජනීයානං. සො දක්ඛිණාය දිසාය -පෙ- උද්ධමධො තිරියං උභයංසභාවිතෙ සමාධිම්හි දිබ්බානඤ්ච රූපානං දස්සනාය පියරූපානං කාමූපසංහිතානං රජනීයානං. දිබ්බානඤ්ච සද්දානං සවණාය පියරූපානං කාමූපසංහිතානං රජනීයානං. උද්ධමධො තිරියං දිබ්බානි රූපානි පස්සති පියරූපානි කාමූපසංහිතානි රජනීයානි, දිබ්බානි ච සද්දානි සුණාති පියරූපානි කාමූපසංහිතානි රජනීයානි. තං කිස්ස හෙතු? එවං හෙතං මහාලි හොති භික්ඛුනො උද්ධමධො තිරියං උභයංසභාවිතෙ සමාධිම්හි දිබ්බානඤ්ච රූපානං දස්සනාය පියරූපානං කාමූපසංහිතානං රජනීයානං, දිබ්බානඤ්ච සද්දානං සවණාය පියරූපානං කාමූපසංහිතානං රජනීයානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො මහාලි හෙතු අයං පච්චයො, යෙන සන්තානෙව සුනක්ඛත්තො ලිච්ඡවිපුත්තො දිබ්බානි සද්දානි නාස්සොසි පියරූපානි කාමූපසංහිතානි රජනීයානි නො අසන්තානී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "12. “එතාසං නූන භන්තෙ සමාධිභාවනානං සච්ඡිකිරියාහෙතු භික්ඛූ භගවති බ්රහ්මචරියං චරන්තී”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "9. තව ද මහාලිය, මහණහු විසින් මිහිරි වූ කම්රසයෙන් යුත් සිත් අලවන දෙව්රූ දක්නා පිණිස නොවැ මිහිරි වූ … දෙව් හඬ අසනු පිණිස දකුණු දිගට … පැසිම් දිගට … උතුරු දිගට … උඩට … යටට … සරසට සමාධිය එක් කොටසක් වඩන ලද්දේ වෙයි ද, හේ මිහිරි වූ … දෙව් රූ දක්නා පිණිස නොවැ මිහිරි වූ … දෙව්හඩ අසනු පිණිස දකුණු දිගට … උඩට ... යටට ... සරසට වඩන ලද සමාධිය ඇති කල්හි මිහිරි වූ … දෙව් රූ නො දකී, (එහෙත්) මිහිරි වූ … දෙව්හඬ අසයි. ඒ කවර හෙයින? යත්: මහාලිය, මිහිරි වූ … දෙව් රූ දක්නට නොවැ, මිහිරි වූ … දෙව් හඬ අසනුවට දකුණු දිගට … උඩට … යටට ... සරසට සමාධිය එක් කොටසක් වැඩූ කල්හි මෙය මෙසේ වෙයි. එහෙයිනි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "10. මහාලිය, මෙහි මහණක්හු විසින් මිහිරි වූ කම්රසයෙන් යුත් සිත් අලවන දෙව්රූ දක්නා පිණිස ද, මිහිරි වූ … දෙව්හඬ අසනු පිණිස ද යන දෙ කොටස ම පිණිස පෙර දිගට සමාධිය වඩන ලද්දේ වෙයි ද, හේ මිහිරි වූ … දෙව් රූ දක්නා පිණිස ද මිහිරි වූ … දෙව් හඬ අසනු පිණිස දැ යි මෙසේ දෙ කොටස ම පිණිස (තමා විසින්) වඩනා ලද සමාධිය ඇති කල්හි මිහිරි වූ … පෙර දිගැ දෙව් රූ ද දකී, මිහිරි වූ … පෙර දිගැ දෙව් හඬ ද අසයි. ඒ කවර හෙයින? යත්: මහාලිය, මහණහු විසින් මිහිරි වූ … දෙව් රූ දක්නට ද, මිහිරි වූ … දෙව් හඬ අසනුවට දැ යි මෙසේ මේ දෙ කොටස ම පිණිස පෙර දිගට වඩන ලද සමාධිය ඇති කල්හි මෙය මෙසේ වෙයි. එහෙයිනි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "11. තව ද මහාලිය, මහණහු විසින් මිහිරි වූ ... දෙව් රූ දක්නා පිණිස ද, මිහිරි වූ … දෙව් හඬ අසනු පිණිස දැ යි මේ දෙ කොටස ම පිණිස දකුණු දිගට … උඩ දෙසට ... යට දෙසට ... සරසට සමාධිය වඩන ලද්දේ වෙයි ද, හේ එසේ … දෙව් රූ දක්නා පිණිස ද දෙව් හඬ අසනු පිණිස දැයි මෙ පරිද්දෙන් මේ දෙ කොටස ම පිණිස දකුණු දිගට … උඩ දෙසට ... යට දෙසට ... සරසට (තමා විසින්) වඩනා ලද සමාධිය ඇති කල්හි, … දෙව් රූ ද දකී, … දෙව් හඬ ද අසයි. ඒ කවර හෙයින? යත්: මහාලිය, මහණහු විසින් මිහිරි වූ … දෙව් රූ දක්නා පිණිස ද … දෙව් හඬ අසනු පිණිස දැ යි (මෙසේ) මේ දෙකොටස ම පිණිස දකුණු දිගට … උඩ දෙසට ... යට දෙසට ... සරසට වඩන ලද සමාධිය ඇති කල්හි මෙය මෙසේ වෙයි. එහෙයිනි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“මහාලිය, යම් හෙයෙකින් ලිච්ඡවීපුත්‍ර සුනක්ඛත්තයා නැත්තා වූ නොවැ ඇත්තා වූ ම මිහිරි, කම්රෙසෙන් යුත් සිත් අදනා දෙව් හඬ නො ඇසී ද, මේ එයට හේතුව යැ, මේ එයට ප්‍රත්‍යය යැ”(යී භාග්‍යවතුන් වහන්සේ වදාළ සේක.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "12. “වහන්ස, භික්‍ෂූහු මෙසේ මේ සමාධීන් පසක් කරනු පිණිස භාග්‍යවතුන් වහන්සේ වෙත බඹසර රකිත් යැ යි සිතමි” යී (මහාලි කී ය.)",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 332,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "13. න ඛො මහාලි, එතාසං සමාධිභාවනානං සච්ඡිකිරියාහෙතු භික්ඛූ මයි බ්රහ්මචරියං චරන්ති. අත්ථි ඛො මහාලි, අඤ්ඤෙ’ව ධම්මා උත්තරිතරා ච පණීතතරා ච, යෙසං සච්ඡිකිරියාහෙතු භික්ඛූ මයි බ්රහ්මචරියං චරන්තීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "14. කතමෙ පන තෙ භන්තෙ ධම්මා උත්තරිතරා ච පණීතතරා ච, යෙසං සච්ඡිකිරියාහෙතු භික්ඛූ භගවති බ්රහ්මචරියං චරන්තීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "15. ඉධ මහාලි, භික්ඛු තිණ්ණං සංයොජනානං පරික්ඛයා සොතාපන්නො හොති අවිනිපාතධම්මො නියතො සම්බොධිපරායණො. අයං’පි ඛො මහාලි, ධම්මො උත්තරිතරො ච පණීතතරො ච යස්ස සච්ඡිකිරියාහෙතු භික්ඛූ මයි බ්රහ්මචරියං චරන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං මහාලි, භික්ඛු තිණ්ණං සංයොජනානං පරික්ඛයා රාගදොසමොහානං තනුත්තා සකදාගාමී හොති සකිදෙව ඉමං ලොකං ආගන්ත්වා දුක්ඛස්සන්තං කරොති. අයම්පි ඛො මහාලි, ධම්මො උත්තරිතරො ච පණීතතරො ච යස්ස සච්ඡිකිරියාහෙතු භික්ඛූ මයි බ්රහ්මචරියං චරන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං මහාලි, භික්ඛු පඤ්චන්නං ඔරම්භාගියානං සංයොජනානං පරික්ඛයා ඔපපාතිකො හොති තත්ථ පරිනිබ්බායී, අනාවත්තිධම්මො තස්මා ලොකා. අයම්පි ඛො මහාලි, ධම්මො උත්තරිතරො ච පණීතතරො ච යස්ස සච්ඡිකිරියාහෙතු භික්ඛූ මයි බ්රහ්මචරියං චරන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං මහාලි, භික්ඛු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති. අයම්පි ඛො මහාලි, ධම්මො උත්තරිතරො ච පණීතතරො ච යස්ස සච්ඡිකිරියාහෙතු භික්ඛූ මයි බ්රහ්මචරියං චරන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො තෙ මහාලි ධම්මා උත්තරිතරා ච පණීතතරා ච යෙසං සච්ඡිකිරියාහෙතු භික්ඛූ මයි බ්රහ්මචරියං චරන්තී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "16. “අත්ථි පන භන්තෙ මග්ගො, අත්ථි පටිපදා එතෙසං ධම්මානං සච්ඡිකිරියායා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අත්ථි ඛො මහාලි, මග්ගො, අත්ථි පටිපදා, එතෙසං ධම්මානං සච්ඡිකිරියායා”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "13. “මහාලිය, මහණහු මේ සමාධීන් පසක් කරනු පිණිස මා කෙරෙහි බඹසර නො රකිත්. මහාලිය, යම් දෑ පසක් කරනු පිණිස මහණහු මා වෙත බඹසර රකිත් නම්, ඒ වඩා උසස් වූ වඩා උතුම් වූ අන්‍ය වූ ම දහම් කෙතෙක් ඇතියහ” (යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "14. වහන්ස, යමක් පසක් කරනු පිණිස භික්‍ෂූහු භාග්‍යවතුන් වහන්සේ කෙරේ බඹසර රකිත් නම් ඒ වඩා උසස් වූ වඩා උතුම් අන් දහම්හු කවුරු දැ?” (යී මහාලී පුළුවුත.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "15. “මහාලිය, මෙ සස්නැ මහණ තෙමේ තුන් සංයොජනයන් (සක්කායදිට්ඨි, විචිකිච්ඡා, සීලබ්බතපරාමාස යන තුන) නැසීමෙන් අපායනට නො වැටෙන සුලු, මාර්‍ගධර්‍මනියාමයෙන් නිශ්චිත ගති ඇති, සම්බෝධිය (මතු තුන් මඟ) පරම ගතිය කොටැති, සෝවාන් පුගුලෙක් වේ ද, මහාලිය, යම් දහමක් පසක් කරනු පිණිස මහණහු මා කෙරෙහි බඹසර සරත් නම්, ඒ මේ දහම් ද (සෝවාන් මඟ ද) යට කී සමාධීන්ට වඩා උසස් ය, වඩා උතුම් ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද මහාලිය, මහණ තෙමේ තුන් සංයෝජනයන් නැසී යෑමෙන් රා දොස් මොහො තුන තුනී වීමෙන් සෙදැගැමි වේ. එක් වරක් ම මෙ ලොවට අවුත් දුක් කෙළවර කෙරෙයි. මහාලිය, යම් දහමක් පසක් කරනු පිණිස මහණහු මා වෙතැ බඹසර සරත් නම්, මේ දහම ද යට කී සමාධීන්ට වඩා උසස් ය, වඩා උතුම් ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද මහාලිය, මහණ තෙමේ ඕරම්භාගිය (කාමභවය භජනය කරන) සංයොජන පස මුළුල්ල ම නැසීමෙන් ඕපපාතක අත්බව ලබන්නෙක් වෙයි. (ශුද්ධාවාස බඹලොවැ උපදින්නේ වෙයි.) එ බඹලොව්හි ම පිරිනිවෙන සුලු වෙයි. එ ලොවින් (නැවැත පිළිසඳ ගැනුම් විසින්) මෙහි නො එන සුලු වෙයි. මහාලිය, යම් දහමක් පසක් කරනු පිණිස මහණහු මා වෙතැ බඹසර සරත් නම්, මෙය ද උඩ කී සමාධීන්ට වඩා උසස්ය, වඩා උතුම් ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද මහාලිය, මහණ තෙමේ ආස්‍රවයන් ක්ෂීණවීමෙන් ආස්‍රව රහිත වූ අර්හත්ත්‍වඵල සමාධිය ද අර්හත්ත්‍වඵල ඥානය ද මෙ අත්බව්හි ම තෙමේ විශිෂ්ටඥානයෙන් පසක් කොටැ ලැබ ගෙන වෙසෙයි. මහාලිය, යමක් පසක් කරනු පිණිස මහණහු මා වෙතැ බඹසර සරත් නම්, මෙය ද යට කී සමාධීන්ට වඩා උසස් ය, වඩා උතුම් ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහාලිය, මහණහු යම් දහම් කෙනකුන් පසක් කරන කරුණින් (පසක් කරනු පිණිස) මා වෙතැ බඹසර සෙරෙත් නම්, මේ යට කී සමාධීන්ට වඩා උසස් වූ, වඩා උතුම් වූ ඒ දහම්හු”යැ යි (වදාළ සේක.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "16. (එ විටැ මහාලි තෙම) ‘වහන්ස, (ඔබ වදාළ) මෙකී දහමුන් පසක් කරනුවට මඟෙක් ඇත්තේ ද? පිළිපැද්මෙක් ඇත්තේ ද?” යි (විචාළේ ය.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“මහාලිය, මේ දහම් පසක් කරනුවට මඟෙක් ඇත්තේ ය, පිළිපැද්මෙක් ඇත්තේ යැ” යි (භාග්‍යවතුන් වහන්සේ වදාළ සේක.)",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 334,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "17. “කතමො පන භන්තෙ මග්ගො, කතමා පටිපදා, එතෙසං ධම්මානං සච්ඡිකිරියායා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අයමෙව අරියො අට්ඨඞ්ගිකො මග්ගො, සෙය්යථිදං? සම්මාදිට්ඨි සම්මාසඞ්කප්පො සම්මාවාචා සම්මාකම්මන්තො සම්මාආජීවො සම්මාවායාමො සම්මාසති සම්මාසමාධි. අයං ඛො මහාලි මග්ගො අයං පටිපදා, එතෙසං සච්ඡිකිරියාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "18. එකදාහං මහාලි සමයං කොසම්බියං විහරාමි ඝොසිතාරාමෙ. අථ ඛො ද්වෙ පබ්බජිතා මණ්ඩිස්සො ච පරිබ්බාජකො ජාලියො ච දාරුපත්තිකන්තෙවාසී යෙනාහං තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා මම සද්ධිං සම්මොදිංසු, සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං අට්ඨංසු. එකමන්තං ඨිතා ඛො තෙ ද්වෙ පබ්බජිතා මං එතදවොචුං. “කින්නුඛො ආවුසො ගොතම, තං ජීවං තං සරීරං? උදාහු අඤ්ඤං ජීවං අඤ්ඤං සරීර?”න්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තෙන හාවුසො සුණාථ සාධුකං මනසි කරොථ භාසිස්සාමී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“එවමාවුසො”ති ඛො තෙ ද්වෙ පබ්බජිතා මම පච්චස්සොසුං. අහං එතදවොචං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "19. ඉධාවුසො තථාගතො ලොකෙ උප්පජ්ජති අරහං සම්මාසම්බුද්ධො (යථා සාමඤ්ඤඵලෙ එවං විත්ථාරෙතබ්බං). -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්සිමෙ පඤ්චනීවරණෙ පහීනෙ අත්තනි සමනුපස්සතො පාමොජ්ජං ජායති. පමුදිතස්ස පීති ජායති. පීතිමනස්ස කායො පස්සම්භති. පස්සද්ධකායො සුඛං වෙදෙති. සුඛිනො චිත්තං සමාධියති."
                    },
                    {
                        "type": "paragraph",
                        "text": "20. සො විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමජ්ඣානං උපසම්පජ්ජ විහරති. සො ඉමමෙව කායං විවෙකජෙන පීතිසුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස විවෙකජෙන පීතිසුඛෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි ආවුසො දක්ඛො න්හාපකො වා න්හාපකන්තෙවාසී වා කංසථාලෙ න්හානීයචුණ්ණානි ආකිරිත්වා උදකෙන පරිප්ඵොසකං පරිප්ඵොසකං සන්දෙය්ය. සායං න්හානීයපිණ්ඩි ස්නෙහානුගතා ස්නෙහපරෙතා සන්තරබාහිරා ඵුටා ස්නෙහෙන න ච පග්ඝරණී."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො ආවුසො භික්ඛු ඉමමෙව කායං විවෙකජෙන පීතිසුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස විවෙකජෙන පීතිසුඛෙන අප්ඵුටං හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "17. “වහන්ස, මේ දහම් පසක් කරනුවට ඇති ඒ මඟ, ඒ පිළිපැදීම කවරේ ද?” (යි මහාලි පුළුවුත.) ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(එ විට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක:)\n“ඒ මේ අරී අටැඟි මඟ ම ය. එ නම්: සම්‍යග්දෘෂ්ටිය, සම්‍යක්සංකල්පය, සම්‍යග්වචනය, සම්‍යක්කර්‍මාන්තය, සම්‍යගාජීවය, සම්‍යග්ව්‍යායාමය, සම්‍යක්ස්මෘතිය, සම්‍යක්සමාධිය යන අට ය. මහාලිය, එකී දහම් පසක් කරනුවට මේ ම මඟ ය, මේ ම පිළිපැද්ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "18. මහාලිය, මම් එක් කලෙක කොසොඹෑ නුවරට නොදුරෙහි වූ ඝෝසිතාරාමයෙහි වෙසෙමි. එ කලැ මණ්ඩිස්ස නම් පිරිවැජි ද, ලීමුවා පයක් දරන පිරිවැජ්ජක්හු අතැවැසි ජාලිය නම් පිරිවැජි දෑ යි මේ දෙ පැවිද්දෝ මා වෙත එළැඹැ මා හා සතුටු වූහ. සතුටු වියැ යුතු සිතැ රැදැවියැ යුතු කතා නිමවා පසෙකැ සිටියහ. පසෙකැ සිටි ඒ දෙ පැවිද්දෝ “කිමෙක් ද ඇවැත්නි, ගොයුම් තෙමේ ‘ජීවයත් හේ ම ද? ශරිරයත් හේ ම ද? (ජීවයත් ශරීරයත් දෙක ම එකක් ද?) නො හොත් ජීවය එකෙකුත් ශරීරය අනෙකෙකුත් වේ ද?”යි විචාළහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ඇවැත්නි, එසේ වී නම් අසවු. මොනොවට මෙනෙහි කරවු. කියන්නෙමි”යි (මම් කීමි.) ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "‘එසේ ය. ඇවැත්නි’යි ඒ දෙ පැවිද්දෝ මට පිළිවදන් දුන්හ. මම් මතු දැක්වෙන මේ දැ කීයෙමි."
                    },
                    {
                        "format": 13,
                        "text": "19. “ඇවැත්නි, රහත් වූ සම්මාසම්බුදු වූ … තථාගත තෙම ලොවැ පහළ වෙයි [යටැ සාමඤඤඑලසූත්‍රයෙහි ආ පරිදි ම විස්තර කළ යුතු.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තමා කෙරෙහි මෙ නීවරණ පස නැසුණවුන් දක්නා ඔහුට සතුට උපදී. සතුටු වූවහුට ප්‍රීතිය උපදී. ප්‍රීත සිතැත්තහුගේ කය සංසිඳෙයි. සංසුන් කයැත්තේ සුව විඳී. සුවැත්තහුගේ සිත එකඟ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "20. හේ කාමයන්ගෙන් වෙන් වැ ම සෙසු අකුසල් දහමුන් ගෙන් (ද) වෙන් වැ ම, විතර්‍ක සහිත විචාර සහිත, විවේකයෙන් උපන්, ප්‍රීතියත් සුවයත් ඇති පළමු දහන් ලැබැ වෙසේ. හේ මේ කය ම විවේකයෙන් උපන් පීතී සුවයෙන් තෙමයි, හාත්පසින් තෙමයි, පුරා ලයි, හාත්පසින් ස්පර්‍ශ කෙරෙයි. ඔහුගේ සියලු අඟ පසඟින් යුත් මුළුකයෙහි විවෙකජ පීති සුවය පැතිරැ වැදැ නො ගත් කිසි ද තැනෙක් නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, යම් සේ සමත් කිලිඟෙක් හෝ කිලිඟකුගේ අතැවැස්සෙක් හෝ ලොහොතලියෙක නානසුණු බහා දිය ඉස ඉස පිඩු කරන්නේ ද, ඒ නානසුණු පිඬ කා වැදුණු දිය ඇත්තේ හැම තැන ම දියෙන් යුක්ත වූයේ, ඇතුළතත් පිටතත් සහිත වැ හැමතැත ම දියෙන් පැතිරැ ගියේ, දියත් නො වගුරුවන්නේ වේ ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, එසේ ම මහණ තෙමේ මේ කරජ කය ම විවේකජ ප්‍රීතිසුඛයෙන් තෙමයි, හාත්පසින් තෙමයි, පුරා ලයි, හාත්පසින් ස්පර්‍ශ කෙරෙයි. සියලු අඟ පසඟ ඇති ඔහුගේ මුළුකයෙහි විවේකජ ප්‍රීතිසුඛයෙන් පැතිරැ වැදැ නො ගත් කිසි ද තැනෙක් නො වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 336,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යො නු ඛො ආවුසො භික්ඛු එවං පස්සති, කල්ලං නු ඛො තස්සෙතං වචනාය තං ජීවං තං සරීරන්ති වා අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති වා? ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යො සො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති, කල්ලං තස්සෙතං වචනාය තං ජීවං තං සරීරන්ති වා අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති වාචි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අහං ඛො පනෙතං ආවුසො එවං ජානාමි එවං පස්සාමි. අථ ච පනාහං න වදාමි තං ජීවං තං සරීරන්ති වා අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති වාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "21. පුන ච පරං ආවුසො භික්ඛු විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියජ්ඣානං උපසම්පජ්ජ විහරති. සො ඉමමෙව කායං සමාධිජෙන පීතිසුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස සමාධිජෙන පීතිසුඛෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "22. සෙය්යථාපි ආවුසො උදකරහදො ගම්භීරො උබ්භිදොදකො - (යථා සාමඤ්ඤඵලෙ එවං විත්ථාරෙතබ්බං.)"
                    },
                    {
                        "type": "paragraph",
                        "text": "නාස්ස කිඤ්චි සබ්බාවතො උදකරහදස්ස සීතෙන වාරිනා අප්ඵුටං අස්ස, එවමෙව ඛො ආවුසො භික්ඛු ඉමමෙව කායං සමාධිජෙන පීතිසුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස සමාධිජෙන පීතිසුඛෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "23. පුන ච පරං ආවුසො භික්ඛු පීතියා ච විරාගා උපෙක්ඛකො ච විහරති සතො සම්පජානො, සුඛඤ්ච කායෙන පටිසංවෙදෙති, යං තං අරියා ආචික්ඛන්ති: උපෙක්ඛකො සතිමා සුඛවිහාරීති තතියජ්ඣානං උපසම්පජ්ජ විහරති. සො ඉමමෙව කායං නිප්පීතිකෙන සුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස නිප්පීතිකෙන සුඛෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "24. සෙය්යථා’පි ආවුසො උප්පලිනියං වා පදුමිනියං වා -පෙ- පුණ්ඩරීකානං වා සීතෙන වාරිනා අප්ඵුටං අස්ස."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, යම් මහණෙක් මෙසේ දනී නම්, මෙසේ දකී නම්, ‘ඒ ම ජීව යැ ඒ මැ ශරිරයැ’ යි හෝ ‘ජීවය අනෙකෙක, ශරීරය අනෙකෙකැ’ යී හෝ ඔහු විසින් කියන්නට යුතු දැ?” යි මම ඇසීමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ඇවැත්නි, යම් මහණෙක් මෙසේ දනී නම්, මෙසේ දකී නම්, ‘ජීවයත් ශරීරයත් එකක් මැ යැ’ යි හෝ ‘ඒ වෙන වෙන දෙකෙකැ’ යි හෝ කියනු ඔහුට යුතු යැ” යී (දෙ පැවිද්දෝ කීහ.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, මම් වූ කලි මෙසේ දනිම් මෙසේ දකිමි. එහෙත් මම ‘හේ ම ජීව යැ, හේ ම ශරීර යැ’ යී හෝ ‘ජීවය අනෙකෙක, ශරීරය අනෙකෙකැ’ යී හෝ නො කියමි යි (මම් කීමි.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "21. ඇවැත්නි, තව ද මහණ තෙමේ විතර්‍ක විවාර සංහිඳීමෙන් සිය සතත්හි උපන්, සිය සතන් පහද වන සිත එකඟ බව ඇති, විතර්‍කය නැති විචාරය තැති, සමාධියෙන් උපන් ප්‍රීතියත් සුවයත් ඇති, දෙවෙනි දහනට පැමිණැ වෙසෙයි. හේ මේ කරජ කය ම සමාධියෙන් උපන් ප්‍රීතීසුඛයෙන් තෙමයි. හාත්පසින් තෙමයි, පුරා ලයි. හැම තැන ම ස්පර්‍ශ කෙරෙයි. ඔහු කයැ විවේකජ ප්‍රීතිසුඛයෙන් පැතිරැ නොගත් කිසි ද තැනෙක් නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "22. ඇවැත්නි, යම් සේ යටැ උල්පතින් මතු වන දිය ඇති ගැඹුරු විලෙක් වේ ද, [යටැ සාමඤ්ඤඵල සූත්‍රයෙහි ආ පරිදි මෙ තැන විස්තර කළ යුතු.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඒ මුළු විලෙහි ශීතල ජලය පැතිරැ වැද නොගත් කිසි ද තැනෙක් නො මැත්තේ ද, ඇවැත්නි, එසේ ම මහණ තෙමෙ මේ කරජ කය ම සමාධියෙන් උපන් ප්‍රීතිසුඛයෙන් තෙමයි. හැම තැන ම තෙත් කෙරෙයි, පුරා ලයි. හැම තැත ම පැතිරැ ගනී. ඔහුගේ ඒ සියලු කයෙහි සමාධියෙන් උපන් ප්‍රීතීසුඛයෙන් පැතිරැ නො ගත් කිසි ද තැනෙක් නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "23. තව ද ඇවැත්නි, මහණ තෙම ප්‍රීතියගේ ද සංහිඳීමෙන් උපපේක්‍ෂායෙන් ද යුතු වැ, සිහියෙන් හා නුවණින් හා යුතු වැ වෙසෙයි. සුවය ද කයින් විඳී. ආර්‍ය්‍යයෝ යම් ධ්‍යානයක් හේතු කොට ගෙන ධ්‍යානලාභියා ඇරැබැ ‘උපෙක්ෂාව ඇත්තේ ය, සිහි ඇත්තේ ය, සුඛවිහරණ ඇත්තේ යැ’යි කියත් ද, හෝ එසේ වූ ඒ තෙවෙනි දහනට පැමිණැ වෙසෙයි. හේ මේ කය ම නිෂ්ප්‍රීතීක සුඛයෙන් තෙමයි. මුළුල්ල ම තෙත් කෙරෙයි, පුරාලයි. හැම තැන ම ස්පර්‍ශ කෙරෙයි. ඔහුගේ කයෙහි ඒ නිෂ්ප්‍රීතික සුඛයෙන් පැතිරැ නොගත් කිසි ද තැනෙක් නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "24. ඇවැත්නි, යම් සේ උපුල් විලෙක හෝ පියුම් විලෙක හෝ ... පඬෙරවලැ හෝ සිහිල් දියෙන් පැතිරැ නො ගත් තැනෙක් නො වන්නේ ද, ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 338,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො ආවුසො භික්ඛු ඉමමෙව කායං නිප්පීතිකෙන සුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස නිප්පීතිකෙන සුඛෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යො නු ඛො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති, කල්ලං නු ඛො තස්සෙතං වචනාය ‘තං ජීවං තං සරීරන්ති’ වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති’ වා? ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යො සො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති. කල්ලං තස්සෙතං වචනාය ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති’ වා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අහං ෙඛා පනෙතං ආවුසො එවං ජානාමි, එවං පස්සාමි. අථ ච පනාහං න වදාමි ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති වාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "25. පුන ච පරං ආවුසො භික්ඛු සුඛස්ස ච පහානා දුක්ඛස්ස ච පහානා පුබ්බෙව සොමනස්සදොමනස්සානං අත්ථගමා අදුක්ඛමසුඛං උපෙක්ඛාසතිපාරිසුද්ධිං චතුත්ථං ඣානං උපසම්පජ්ජ විහරති. සො ඉමමෙව කායං පරිසුද්ධෙන චෙතසා පරියොදාතෙන ඵරිත්වා නිසින්නො හොති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස පරිසුද්ධෙන චෙතසා පරියොදාතෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි ආවුසො පුරිසො ඔදාතෙන වත්ථෙන සසීසං පාරුපිත්වා නිසින්නො අස්ස, නාස්ස කිඤ්චි සබ්බාවතො කායස්ස ඔදාතෙන වත්ථෙන අප්ඵුටං අස්ස, එවමෙව ඛො ආවුසො භික්ඛු ඉමමෙව කායං පරිසුද්ධෙන චෙතසා පරියොදාතෙන ඵරිත්වා නිසින්නො හොති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස පරිසුද්ධෙන චෙතසා පරියොදාතෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යො නු ඛො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති, කල්ලං නු ඛො තස්සෙතං වචනාය ‘තං ජීවං තං සරීරන්ති’ වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති’ වා? ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යො සො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති. කල්ලං තස්සෙතං වචනාය ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති’ වා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අහං ෙඛා පනෙතං ආවුසො එවං ජානාමි, එවං පස්සාමි. අථ ච පනාහං න වදාමි ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති වාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "එසේ ම, ඇවැත්නි, මහණ තෙම් මේ කය ම නිෂ්ප්‍රිතික සුඛයෙන් තෙමයි, හාත්පසිත් තෙමයි, පුරා ලයි, මුළුල්ල ම ස්පර්‍ශ කෙරෙයි. ඔහු මුළු කයෙහි නිෂ්ප්‍රිතීක සුඛයෙන් පැතිරැ වැද නො ගත් කිසි ද තැ‍නෙක් නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, යමෙක් මෙසේ දනී නම්, මෙසේ දකී නම්, ‘ජීවයත් හේ ම යැ, ශරීරයත් හේ මැ යැ’ යී හෝ ‘ජීවය අනෙකක, ශරීරය අනෙකකැ’යි ඔහු විසින් කියන්නට යුතු වේ දැ? යී [මම ඇසීමි.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ඇවැත්නි, යම් මහණෙක් මෙසේ දන්නේ නම්, මෙසේ දක්නේ නම්, ‘ජීවයත් හේ මැ යැ, ශරීරයත් හේ මැ යැ’යි හෝ ‘ජීවය අනෙකෙක, ශරීරය අනෙකෙකැ’ යි හෝ මෙය කියන්නට ඔහුට යුතු යැ” යි [දෙ පිරිවැජියෝ කීහ.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, මම් වූ කලි මෙය මෙසේ දනිමි, මෙසේ දකිමි. එහෙත් මම ‘ජීවයත් හේ ම ය, ශරීරයත් හේ මැ යැ’ යි හෝ ‘ජීවය අනෙකෙක, ශරීරය අනෙකෙකැ’ යී හෝ නො කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "25. තව ද ඇවැත්නි, මහණ තෙම සුඛ වේදනාව ද දුක් වේදනාව ද දුරැ ලීමෙන්, පළමු කොට ම සොම්නස් සොම්නස් දෙක පහ වීමෙන්, දුක් නො වූ සුඛ ද නො වූ, උපේක්‍ෂාස්මෘතියෙන් පිරිසිදු වූ සිවු වන දහන ලැබැ වෙසෙයි. හේ මේ කය ම පිරිසිදු පබසර සිතින් පැතිරැ ගෙන හුන්නේ වෙයි. ඔහු සියලු කයැ පිරිසිදු පබසර සිතින් නොපහස්නා ලද කිසි ද තැනෙක් නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, යම්සේ පුරුෂයෙක් සුදු වතින් හිස ඇතුළු මුළු කය ම වසා ගෙන හුන්නේ වේ නම්, ඔහු මුළු කයෙහි සුදු වතිත් වැදැ නො ගත් (නොවැසුණු) කිසි ද තැනෙක් නො වන්නේ ද, ඇවැත්නි, එසේ ම මහණතෙම මෙ කය ම පිරිසිදු පබසර සිතිත් පැතිරැ ගෙත හුන්නේ වෙයි. ඔහු මුළු කය පිරිසිදු පබසර සිතින් නො පහස්නා ලද කිසි ද තැනෙක් නොවෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, යම් මහණෙක් මෙසේ දනී නම්, මෙසේ දකී නම්, ‘ජීවයත් හේ මැ යැ, ශරීරයත් හේ මැ’ යැ යි හෝ ‘ජීවය අනෙකෙක, ශරීරය අනෙකෙකැ’ යි හෝ මෙය කියන්නට ඔහුට යුතු දැ? යි [මම් ඇසීමි.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ඇවැත්නි, යම් මහණෙක් මෙසේ දනී නම්, මෙසේ දකී නම්, ‘ජීවයත් හේ මැ යැ, ශරීරයත් හේ මැ යැ’ යී හෝ ‘ජීවය අනෙකෙක, ශරීරය අනෙකකැ’යි හෝ මෙය කියන්නට ඔහුට යුතු යැ” යි [දෙ පිරිවැජියෝ කීහ.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, මම් වූ කලි මෙය මෙසේ දනිමි, මෙසේ දකිමි. එතෙකුදු වුවත් ‘ජීවයත් හේ මැ යැ, ශරීරයත් හේ මැ යැ’ යී හෝ ‘ජීවය අනෙකෙක, ශරීරය අනෙකෙකැ’යි හෝ මම් නො කියමි යි [මම් කීමි.]",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 340,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "26. පුන ච පරං ආවුසො සො භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ ඤාණදස්සනාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො එවං පජානාති ‘අයං ඛො මෙ කායො රූපී චාතුම්මහාභූතිකො මාතාපෙත්තිකසම්භවො ඔදනකුම්මාසූපචයො අනිච්චුච්ඡාදනපරිමද්දනභෙදනවිද්ධංසනධම්මො. ඉදඤ්ච පන මෙ විඤ්ඤාණං එත්ථ සිතං එත්ථ පටිබද්ධන්ති. සෙය්යථාපි ආවුසො මණි වෙළුරියො -පෙ- සබ්බාකාරසම්පන්නො, තත්ර සුත්තං ආවුතං නීලං වා -පෙ- පණ්ඩුසුත්තං වා, තමෙනං චක්ඛුමා පුරිසො හත්ථෙ කරිත්වා පච්චවෙක්ඛෙය්ය ‘අයං ඛො මණි වෙළුරියො -පෙ- සබ්බාකාරසම්පන්නො, තත්ර සුත්තං ආවුතං නීලං වා -පෙ- පණ්ඩුසුත්තං වා’ති. එවමෙව ඛො ආවුසො භික්ඛු එවං සමාහිතෙ චිත්තෙ -පෙ- ඤාණදස්සනාය චිත්තං අභිනීහරති -පෙ- සො එවං පජානාති ‘අයං ඛො කායො රූපී -පෙ- ඉදං ච පන මෙ විඤ්ඤාණං එත්ථ සිතං එත්ථ පටිබද්ධන්ති’."
                    },
                    {
                        "type": "paragraph",
                        "text": "යො නු ඛො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති, කල්ලන්නු ඛො තස්සෙනං වචනාය ‘තං ජීවං තං සරීරන්ති’ වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති’ වා? ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යො සො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති. කල්ලං තස්සෙතං වචනාය ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති’ වා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අහං ෙඛා පනෙතං ආවුසො එවං ජානාමි, එවං පස්සාමි. අථ ච පනාහං න වදාමි ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති වාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "27. පුන ච පරං ආවුසො භික්ඛු එවං සමාහිතෙ චිත්තෙ -පෙ- මනොමයං කායං අභිනිම්මිනතාය චිත්තං අභිනීහරති -පෙ- සෙය්යථාපි ආවුසො පුරිසො මුඤ්ජම්හා ඊසිකං පබ්බාහෙය්ය -පෙ- එවමෙව ඛො ආවුසො භික්ඛු එවං සමාහිතෙ චිත්තෙ -පෙ- මනොමයං කායං අභිනිම්මිනතාය චිත්තං අභිනීහරති -පෙ- සො ඉමම්හා කායා අඤ්ඤං කායං අභිනිම්මිනාති -පෙ- අභිනින්ද්රයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යො නු ඛො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති, කල්ලන්නු ඛො තස්සෙතං වචනාය ‘තං ජීවං තං සරීරන්ති’ වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති’ වා? ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යො සො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති. කල්ලං තස්සෙතං වචනාය ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති’ වා”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "26. ඇවැත්නි, තව ද ඒ මහණ තෙම මෙසේ සිත සමාධිගත කල්හි, පිරිසිදු වූ කල්හි, දීප්තිමත් වූ කල්හි, කිලිටි පහ වැ ගිය කල්හි, පහ වූ චිත්තොපක්ලේශ ඇති කල්හි, මොළොක් වූ කල්හි, විදර්‍ශනාභාවනාවට යෝග්‍ය වූ කල්හි, ස්ථිත කල්හි, නිසලබවට පැමිණ කල්හි, විවසුන්නුවණ පිණිස සිත අභිමුඛ කෙරෙයි. එය අතට නමා හරී. හෙ තෙම ‘මගේ මේ කය වූ කලි රූපවත් ය. සිවු මහාභූතයන්ගෙන් සැදුණේ ය. මාපියන්ගේ ශුක්‍රශොණිතයෙන් උපන්නේ ය. බත් කොමු ඈ අහරින් වැඩුණේ ය. අනිස බව ද, දුගඳ හරනුවට සුවඳවිලෙවුත් ඉලියැ යුතු බව ද, ලෙඩ දුරැලනුවට පිරිමැදුම් ඈ කළ යුතු බව ද, එසේ කළ ද බිදෙන බව ද, විසිරෙන බව ද යන මේ දෑ ස්වභාවය කොටැත්තේ ය. මගේ මේ සිත ද මෙහි ලැග්ගේ ය. මෙහි බැඳුණේ යැ’යි මෙසේ දැන ගනී. ඇවැත්නි, ... සියලු අයුරින් පිරිපුන් වෙරෙළුමිණෙක් යම් සේ ද එහි නිල් හුයෙක් ... පඬුවන් හුයෙක් හෝ අවුනන ලද්දේ වේ ද, ඇස් ඇති පුරුෂයෙක් එය අතෙහි කොට ‘මේ ... සියලු අයුරින් පිරිපුන් වෙරෙළු මිණෙක. මෙහි නිල් පැහැ හුයෙක් හෝ ... පඬුවන් හුයෙක් හෝ අවුනන ලදැ යි සලකා බලන්නේ ද, ඇවැත්නි, එ පරිද්දෙන් ම මහණ තෙම මෙසේ සිත සමාහිත කල්හි ... විවසුන්නුවණ පිණිස සිත යොමු කෙරෙයි ... හේ ‘මගේ මේ කය වනාහි රූපවත් ය ... මගේ මේ සිත ද මෙහි ලැග්ගේ ය, මෙහි බැඳුණේ යැ’යි මෙසේ දැන ගනී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, යම් මහණෙක් මෙසේ දන්නේ තම මෙසේ දක්නේ නම්, ‘එය ම ජිව යැ, එය ම ශරීර යැ’ යි හෝ ‘අනෙකෙක් ජීව යැ අනෙකෙක් ශරීර යැ’යි හෝ මෙය කියන්නට යුතු දැ? [යි මම ඇසීමි.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ඇවැත්නි, යම් මහණෙක් මෙසේ දනී නම්, මෙසේ දකී නම්, ඔහු විසින් ‘ජීවයත් හේ මැ යැ ශරීරයත් හේ මැ යැ’ යි හෝ ‘ජීවය අනෙකෙක ශරීරය අනෙකැ’යි හෝ කියන්නට යුතු යැ”යි [පිරිවැජියෝ කීහ.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, මම් වූ කලි මෙය දනිමි, මෙය දකිමි. එහෙත් ‘ජීවයත් හේ මැ යැ, ශරීරයත් හේ මැ යැ’යි හෝ ‘ජීවය අනෙකෙක, ශරීරය අනෙකෙකැ’සි හෝ නො කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "27. ඇවැත්නි, තව ද මහණ තෙම මෙසේ සිත සමාහිත කල්හි ... මනොමය ශරීරයක් මවනු පිණිස සිත යොමු කෙරෙයි ... ඇවැත්නි, යම්සේ මිනිසෙක් මුදු තණ ගසෙකින් තණබඩය බැහැරැ කරන්නේ ද, ඇවැත්නි, එ පරිද්දෙන් ම මහණ තෙම සිත මෙසේ සමාහිත කල්හි ... මනොමය ශරීරයක් මවන්නට සිත යොමු කෙරෙයි ... හේ මේ කයින් ... නො පිරිහුණු ඉඳුරන් ඇති අන් කයක් මවයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, යම් මහණෙක් මෙසේ දනී නම්, මෙසේ දකී නම්, ‘ජීවයත් හේ මැ යැ, ශරීරයත් හේ මැ’ යි හෝ ‘ජීවය අනෙකෙක, ශරීරය අනෙකෙකැ’යි හෝ මෙය කියන්නට යුතු දැ?යි [මම් ඇසීම්].",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ඇවැත්නි, යම් මහණෙක් මෙසේ දනී නම්, මෙසේ දකී නම්, ඔහු විසින් ‘ජීවයත් හේ මැ යැ, ශරීරයත් හේ මැ යැ’යි හෝ ‘ජීවය අනෙකක ශරීරය අනෙකෙකැ’යි හෝ කියන්නට යුතු යැ”යි [පිරිවැජියෝ කීහ.]",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 342,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අහං ෙඛා පනෙතං ආවුසො එවං ජානාමි එවං පස්සාමි. අථ ච පනාහං න වදාමි ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති වාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "28. පුන ච පරං ආවුසො භික්ඛු එවං සමාහිතෙ චිත්තෙ -පෙ- ඉද්ධිවිධාය චිත්තං අභිනීහරති -පෙ- සෙය්යථාපි ආවුසො දක්ඛො කුම්භකාරොවා කුම්භකාරන්තෙවාසී වා සුපරිකම්මකතාය මත්තිකාය යං යදෙව භාජනවිකතිං ආකඞඛෙය්ය තං තදෙව කරෙය්ය -පෙ- එවමෙව ඛො ආවුසො භික්ඛු එවං සමාහිතෙ චිත්තෙ -පෙ- ඉද්ධිවිධාය චිත්තං අභිනීහරති -පෙ- සො අනෙකවිහිතං ඉද්ධිවිධං පච්චනුහොති -පෙ- යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යො නු ඛො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති, කල්ලන්නු ඛො තස්සෙතං වචනාය ‘තං ජීවං තං සරීරන්ති’ වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති’ වා? ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යො සො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති. කල්ලං තස්සෙතං වචනාය ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති’ වා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අහං ෙඛා පනෙතං ආවුසො එවං ජානාමි එවං පස්සාමි. අථ ච පනාහං න වදාමි ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති වාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "29. පුන ච පරං ආවුසො භික්ඛු එවං සමාහිතෙ චිත්තෙ -පෙ- දිබ්බාය සොතධාතුයා චිත්තං අභිනීහරති -පෙ- සො දිබ්බාය සොතධාතුයා -පෙ- උභො සද්දෙ සුනාති දිබ්බෙ ච මානුසෙ ච -පෙ- සෙය්යථාපි ආවුසො පුරිසො අද්ධානමග්ගපටිපන්නො, සො සුණෙය්ය භෙරිසද්දම්පි -පෙ- තස්ස එවමස්ස භෙරිසද්දො ඉතිපි -පෙ- එවමෙව ඛො ආවුසො භික්ඛු එවං සමාහිතෙ චිත්තෙ -පෙ- දිබ්බාය සොතධාතුයා චිත්තං අභිනීහරති -පෙ- දිබ්බාය සොතධාතුයා -පෙ- උභො සද්දෙ සුණාති දිබ්බෙ ච මානුසෙ ච යෙ දූරෙ සන්තිකෙ ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "යො නු ඛො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති, කල්ලන්නු ඛො තස්සෙතං වචනාය ‘තං ජීවං තං සරීරන්ති’ වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති’ වා? ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යො සො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති. කල්ලං තස්සෙතං වචනාය ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති’ වා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අහං පනෙතං ආවුසො එවං ජානාමි එවං පස්සාමි. අථ ච පනාහං න වදාමි ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති වාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, මම් වූ කලි මෙය දනිමි, මෙය දකිමි. එහෙත් ‘ජීවයත් හේ මැ යැ, ශරීරයත් හේ මැ යැ’යි හෝ ‘ජීවය අනෙකෙක, ශරීරය අනෙකෙකැ’යි හෝ නො කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "28. ඇවැත්නි, තව ද මහණ තෙම මෙසේ සිත සමාහිත කල්හි ... ඍද්ධි කොටස් ලබනු පිණිස සිත යොමු කෙරෙයි ... ඇවැත්නි, යම්සේ දක්‍ෂ වූ කුඹලෙක් හෝ කුඹලක්හු අතැවැස්සෙක් මොනොවට සකස් කළ මැටියෙන් යම් යම් ම බඳුන් වෙසෙසක් කැමැති වන්නේ නම්, එය එය ම කරන්නේ ද, ... ඇවැත්නි, එසේ ම මහණ තෙම මෙසේ සිත සමාහිත කල්හි ... ඍද්ධි කොටස් ලබනු පිණිස සිත යොමු කෙරෙයි ... හේ අනෙකවිධ වූ ඍද්ධි කොටස් පසක් කෙරෙයි (ලබයි) ... බඹලොව දක්වාත් කයින් වශයෙහි පවත්වයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, යම් මහණෙක් මෙසේ දනී නම්, මෙසේ දකී නම්, ‘ජීවයත් හේ මැ යැ ශරීරයත් හේ මැ යැ’ යි හෝ ‘ජීවය අනෙකෙක ශරීරය අනෙකෙකැ’ යි හෝ ඔහු විසින් මෙය කියන්නට යුතු දැ? යි [මම ඇසීමි.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ඇවැත්නි, යම් මහණෙක් මෙසේ දනී නම්, මෙසේ දකී නම්, ඔහු විසින් ‘ජීවයත් හේ මැ යැ, ශරීරයත් හේ මැ යැ’යි හෝ ‘ජීවය අනෙකෙක ශරීරය අනෙකෙකැ’යි හෝ කියන්නට යුතු යැ”යි [පිරිවැජියෝ කීහ.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, මම් වූ කලි මෙය දනිමි, මෙය දකිමි. එහෙත් ‘ජීවයත් හේ මැ යැ, ශරීරයත් හෝ මැ යැ’යි හෝ ‘ජීවය අනෙකක, ශරීරය අනෙකෙකැ’යි හෝ නො කියමී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "29. ඇවැත්නි, තව ද මහණ තෙම් මෙසේ සිත සමාහිත කල්හි ... දිවකන් නූවණ පිණිස සිත යොමු කෙරෙයි ... හේ දිවකනින් ... දිව්‍ය වූ ද මානුෂක වූ ද උභය ශබ්ද ම අසයි ... ඇවැත්නි, යම්සේ මිනිසෙක් දික් මඟකට පිළිපන්නේ නම්, හේ බෙරහඬත් ... අසන්නේ ද, ‘මේ බෙරහඩැ’යි ... ඔහුට මෙසේ සිතෙක් වන්නේ ද, ඇවැත්නි, ඒ පරිද්දෙන් ම මහණ තෙම මෙසේ සිත සමාහිත කල්හි ... දිවකන් නුවණ පිණිස සිත යොමු කෙරෙයි ... හේ දිවකනින් දිව්‍ය වූ ද මානුෂක වූ ද දුරැ වූ ද ළඟැ වූ ද උභය ශබ්ද ම අසයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, යම් මහණෙක් මෙසේ දනී නම්, මෙසේ දකී නම්, ඔහු විසින් ‘ජීවයත් හේ මැ යැ, ශරීරයත් හේ මැ යැ’යි හෝ ‘ජීවය අනෙකෙක ශරීරය අනෙකෙකැ’යි හෝ කියන්නට යුතු දැ?”යි [මම්ඇසීමි.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ඇවැත්නි, යම් මහණෙක් මෙසේ දනී නම්, මෙසේ දකී නම්, ඔහු විසින් ‘ජීවයත් හේ මැ යැ, ශරිරයත් හේ මැ යැ’යි හෝ ‘ජීවය අනෙකෙක, ශරීරය අනෙකෙකැ’යි හෝ කියන්නට යුතු යැ”යි [පිරිවැජියෝ කීහ.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, මම වූ කලි මෙය දනිමි, මෙය දකිමි. එහෙත් ‘ජීවයත් හේ මැ යැ ශරීරයත් හේ මැ යැ’යි හෝ ‘ජීවය අනෙකෙක, ශරීරය අනෙකකැ’යි හෝ නො කියමි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 344,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "30. පුන ච පරං ආවුසො භික්ඛු එවං සමාහිතෙ චිත්තෙ -පෙ- චෙෙතාපරියඤාණාය චිත්තං අභිනීහරති -පෙ- සො පරසත්තානං පරපුග්ගලානං චෙතසා චෙතො පරිච්ච පජානාති. සරාගං වා චිත්තං සරාගං චිත්තන්ති පජානාති -පෙ- අවිමුත්තං වා චිත්තං අවිමුත්තං චිත්තන්ති පජානාති. සෙය්යථාපි ආවුසො ඉත්ථි වා පුරිසො වා -පෙ- ආදොසෙ වා -පෙ- උදකපත්තෙ සකං මුඛනිමිත්තං පච්චවෙක්ඛමානො සකණිකං වා සකණිකන්ති ජානෙය්ය, අකණිකං වා අකණිකන්ති ජානෙය්ය, එවමෙව ඛො ආවුසො භික්ඛු එවං සමාහිතෙ චිත්තෙ -පෙ- චෙෙතාපරියඤාණාය චිත්තං අභිනීහරති -පෙ- සො පරසත්තානං පරපුග්ගලානං චෙතසා චෙතො පරිච්ච පජානාති, සරාගං වා චිත්තං සරාගං චිත්තන්ති පජානාති -පෙ- අවිමුත්තං වා චිත්තං අවිමුත්තං චිත්තන්ති පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යො නු ඛො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති, කල්ලන්නු ඛො තස්සෙතං වචනාය ‘තං ජීවං තං සරීරන්ති’ වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති’ වා? ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යො සො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති. කල්ලං තස්සෙතං වචනාය ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති’ වා “ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අහං පනෙතං ආවුසො එවං ජානාමි එවං පස්සාමි. අථ ච පනාහං න වදාමි ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති වාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "31. පුන ච පරං ආවුසො භික්ඛු එවං සමාහිතෙ චිත්තෙ -පෙ- පුබ්බෙනිවාසානුස්සතිඤාණාය චිත්තං අභිනීහරති -පෙ- සො අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති, සෙය්යථිදං එකම්පි ජාතිං -පෙ- අනෙකෙ’පි සංවට්ටවිවට්ටකප්පෙ: අමුත්රාසිං එවන්නාමො එවංගොත්තො -පෙ- ඉති සාකාරං සඋද්දෙසං අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යො නු ඛො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති, කල්ලන්නු ඛො තස්සෙතං වචනාය ‘තං ජීවං තං සරීරන්ති’ වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති’ වා? ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යො සො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති. කල්ලං තස්සෙතං වචනාය ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති’ වා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අහං පනෙතං ආවුසො එවං ජානාමි එවං පස්සාමි. අථ ච පනාහං න වදාමි ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති වාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "32. පුන ච පරං ආවුසො භික්ඛු එවං සමාහිතෙ චිත්තෙ -පෙ- සත්තානං චුතූපපාතඤාණාය චිත්තං අභිනීහරති -පෙ- සො දිබ්බෙන චක්ඛුනා -පෙ- සත්තෙ පස්සති චවමානෙ උපපජ්ජමානෙ -පෙ- සුගතෙ දුග්ගතෙ යථා කම්මූපගෙ සත්තෙ පජානාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "30. ඇවැත්නි, තව ද මහණ තෙම මෙසේ සිත සමාහිත කල්හි ... පරසිත් දන්නා නුවණ පිණිස සිත යොමු කෙරෙයි ... හේ අන් සතුන්ගේ අන් පුඟුලන්ගේ සිත් තම සිතින් පිරිසිඳ දනී. හේ සරාග සිත සරාග සිතැ යි ද දනී ... නොමිදුණු සිත නො මිදුණු සිතැ යි ද දනී. ඇවැත්නි, ... ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ යම්සේ කැටපතෙක හෝ ... දිය බඳුනෙක හෝ මුවසටහන පිරික්සා බලනුයේ තලකැලැල් සහිත වූවක් තලකැලැල් සහිත යැ යි දැන ගන්නේ ද, තලකැලැල් රහිත වූවක් තලකැලැල් රහිත යැ යි දැන ගන්නේ ද, ඇවැත්නි, එ පරිද්දෙන් ම මහණ තෙම මෙසේ සිත සමාහිත කල්හි ... පරසිත් දන්නා නුවණ පිණිස සිත යොමු කෙරෙයි ... හෝ අන් සතුන්ගේ අත් පුඟුලන්ගේ සිත තම සිතින් පිරිසිඳ දැන ගනී. හේ සරාග සිත සරාග සිතැ යි ද ... නොමිදුණු සිත නොමිදුණු සිතැ යි ද දැන ගනී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, යම් මහණෙක් මෙසේ දකී නම්, මෙසේ දකී නම්, ඔහු විසින් ‘ජීවයත් හේ මැ යැ ශරීරයත් හේ මැ යැ’යි හෝ ‘ජීවය අනෙකෙක ශරීරය අනෙකෙකැ’ යි හෝ කියන්නට යුතු ද?යි [මම ඇසීම්.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ඇවැත්නි, යම් මහණෙක් මෙසේ දනී නම්, මෙසේ දකී නම්, ඔහු විසින් ‘ජීවයත් හේ මැ යැ, ශරිරයත් හේ මැ යැ’යි හෝ ‘ජීවය අනෙකක ශරීරය අනෙකෙකැ’යි හෝ කියන්නට යුතු යැ”යි [පිරිවැජියෝ කීහ.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, මම් වූ කලි මෙය දනිමි, මෙය දකිමි. එහෙත් ‘ජීවයත් හේ මැ යැ ශරිරයත් හේ මැ යැ’යි හෝ ‘ජීවය අනෙකෙක, ශරීරය අනෙකෙකැ’යි හෝ නො කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "31. ඇවැත්නි, තව ද මහණ තෙම මෙසේ සිත සමාහිත කල්හි ... පෙරැ වූසූ කඳ පිළිවෙළ දන්නා නුවණ පිණිස සිත යොමු කෙරෙයි ... හෝ එක් ජාතියක් ද ... නොයෙක් සංවර්‍තතවිවර්‍තත කල්ප ද යන අනෙකවිධ පූර්‍වනිවාසය සිහි කරයි. ‘අසෝ තැන මෙනම් ඇත්තෙම් මෙබඳු ගොත් ඇත්තෙම් වීම් ... මෙසේ ආකාරසහිත උද්දෙශ සහිත නොයෙක් වැදෑරුම් පෙරැ වුසූ කඳපිළිවෙළ සිහි කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, යම් මහණෙක් මෙසේ දනී නම්, මෙසේ දකී නම්, ඔහු විසින් ‘ජීවයත් හේ මැ යැ ශරීරයත් හේ මැ යැ’යි හෝ ‘ජීවය අනෙකෙක ශරිරය අනෙකෙකැ’යි හෝ මෙය කියන්නට යුතු ද?යි [මම් ඇසීම්.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ඇවැත්නි, යම් මහණෙක් මෙසේ දනී නම්, මෙසේ දකී නම්, ඔහු විසින් ‘ජීවයත් හේ මැ යැ, ශරීරයත් හේ මැ යැ’යි හෝ ‘ජීවය අනෙකෙක ශරිරය අනෙකෙකැ’යි හෝ කියන්නට යුතු යැ”යි [පිරිවැජියෝ කීහ.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, මම් වූ කලි මෙසේ දනිමි, මෙසේ දකිමි. එහෙත් ‘ජීවයත් හේ මැ යැ ශරිරයත් හේ මැ යැ’සි හෝ ‘ජීවය අනෙකෙක ශරීරය අනෙකෙකැ’යි හෝ මම් නො කියමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "32. ඇවැත්නි, තව ද මහණ තෙම මෙසේ සිත සමාහිත කල්හි ... සත්ත්‍වයන්ගේ ච්‍යුති උප්පත්ති දන්නා නුවන පිණිස සිත මෙහෙයයි ... හේ ... දිවැසින් මැරෙන මැරී උපදනා ... කම් වූ පරිදි සුගතියට දුගතියට පැමිණි සත්ත්‍වයත් දැන ගනී.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 346,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි ආවුසො පබ්බතසඞ්ඛෙපෙ උදකරහදො අච්ඡො විප්පසන්නො අනාවිලො, තත්ථ චක්ඛුමා පුරිසො තීරෙ ඨිතො පස්සෙය්ය සිප්පිසම්බුකම්පි සක්ඛරකඨලම්පි මච්ඡගුම්බම්පි චරන්තම්පි තිට්ඨන්තම්පි, තස්ස එවමස්ස: අයං ඛො උදකරහදො අච්ඡො විප්පසන්නො අනාවිලො, තත්රිමෙ සිප්පිසම්බුකා’පි සක්ඛරකඨලා’පි මච්ඡගුම්භා’පි චරන්ති’පි තිට්ඨන්ති’පීති, එවමෙව ඛො ආවුසො භික්ඛු සමාහිතෙ චිත්තෙ -පෙ- ආසවානං ඛයඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො ඉදං දුක්ඛන්ති යථාභූතං පජානාති -පෙ- අයං ආසවනිරොධගාමිනී පටිපදාති යථාබූතං පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්ස එවං ජානතො එවං පස්සතො කාමාසවා’පි චිත්තං විමුච්චති. භවාසවා’පි චිත්තං විමුච්චති. අවිජ්ජාසවා’පි චිත්තං විමුච්චති. විමුත්තස්මිං විමුත්තමිති ඤාණං හොති. ‘ඛීණා ජාති, වුසිතං බ්රහ්මචරියං, කතං කරණීයං, නාපරං ඉත්ථත්තායාති පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "33. යො ඛො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති, කල්ලං නු ඛො තස්සෙතං වචනාය ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති’වා?ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යො සො ආවුසො භික්ඛු එවං ජානාති එවං පස්සති. න කල්ලං තස්සෙතං වචනාය ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති’ වා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අහං ෙඛා පනෙතං ආවුසො එවං ජානාමි එවං පස්සාමි. අථ ච පනාහං න වදාමි ‘තං ජීවං තං සරීරන්ති’වා ‘අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති වාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "34. ඉදමවොච භගවා. අත්තමනො ඔට්ඨද්ධො ලිච්ඡවී භගවතො භාසිතං අභිනන්දීති."
                    },
                    {
                        "type": "centered",
                        "text": "මහාලිසුත්තං නිට්ඨිතං ඡට්ඨං.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, යම්සේ කඳුමුදුනෙක වූ, පහන් වූ, වෙසෙසින් පෑදුණු, බොර නොවූ දිය විලෙක් වන්නේ ද, එහි ඉවුරැ ඇස් ඇති මිනිසෙක් සිටියේ එය තුළැ හැසිරෙන ද සිටුනා ද සිප්පි බෙල්ලනුත් සක්බෙල්ලනුත් කැටකැබිලිතිත් මත්ස්‍යසමූහත් දක්නේ ද, එසේ දක්නා ඔහුට ‘මේ දිය විල පහන් ය. වෙසෙසින් පැහැදුණේ ය. නො කැලැඹුණේ ය. මෙහි මේ සිප්පිහුත් සක්බෙල්ලෝත් කැටකැබිලිතිත් මත්ස්‍ය සමූහයෝත් හැසිරෙන්නෝ ද සිටින්නෝ ද වෙති’යි මෙසේ සිතෙක් වන්නේ ද, ඇවැත්නි, එ පරිද්දෙන් ම මහණ තෙමේ මෙසේ සිත සමාහිත කල්හි ආස්‍රවක්‍ෂයඥානය පිණිස සිත යොමු කෙරෙයි, නැඹුරු කෙරෙයි. හේ ‘මේ දුකැ’යි ඇතිසැටියෙන් දනී … මේ ආස්‍රව නිරෝධගාමිනී ප්‍රතිපත්තිය යැ’ යි ඇති සැටියෙන් දනී. ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "මෙසේ දන්නා මෙසේ දක්නා ඔහු සිත කාමාස්‍රවය කෙරෙන් ද මිදේ. සිත භවාස්‍රවය කෙරෙන් ද මිදේ. සිත අවිද්‍යාස්‍රවය කෙරෙන් ද මිදේ. මිදුණු කල්හි මිදුණේ යැ යී දැනීම වේ. ‘භවෝත්පත්තිය ක්‍ෂීණ විය. මඟ බඹසර වැස නිමැවිණ. කළයුතු දෑ කරණ ලදී. මේ රහත් බව පිණිස අන් කටයුත්තෙක් නැතැ’යි හේ දනී."
                    },
                    {
                        "format": 13,
                        "text": "33. ඇවැත්නි, යම් මහණෙක් මෙසේ දනී නම්, මෙසේ දකී තම්, ‘ජීවයත් හේ මැ යැ, ශරීරයත් හේ මැ යැ’යී හෝ ‘ජීවය අනෙකෙක, ශරීරය අනෙකෙකැ’යී මෙය කියන්නට ඔහුට යුතු දැ? යී [මම් ඇසීමි]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ඇවැත්නි, යම් මහණෙක් මෙසේ දනී නම්, මෙසේ දකී නම්, ‘ජීවයත් හේ මැ යැ, ශරීරයත් හේ මැ’ යි හෝ ‘ජීවය අනෙකෙක, ශරීරය අනෙකෙකැ’ යී හෝ කියන්නට ඔහුට යුතු නො වේ” [යැ යි දෙ පිරිවැජියෝ කීහ.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, මම් වූ කලී මෙය මෙසේ දනිමි, මෙසේ දකිමි. එහෙත් ‘ජීවයත් හේ මැ යැ, ශරීරයත් හේ මැ යැ’යි හෝ ‘ජීවය අනෙකෙක, ශරීරය අනෙකකැ’යි කියා හෝ මම් නො කියමි. [මෙසේ ඒ දෙපිරිවැජියනට මම් කීමි.]",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "34. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. ඔට්ඨද්ධ ලිච්ඡවී තෙමේ සතුටු සිතැත්තේ භාග්‍යවතුන් වහන්සේගේ වචනය පිළිගත්තේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 16,
                        "text": "සවන මහාලි සූත්‍ර‍ය නිමියේ ය.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ]
}