{
    "filename": "dn-1-4",
    "pages": [
        {
            "pageNum": 222,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "සොණදණ්ඩසුත්තං",
                        "level": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "1. එවං මෙ සුතං. එකං සමයං භගවා **අඞ්ගෙසු** චාරිකං චරමානො මහතා භික්ඛුසඞ්ඝෙන සද්ධිං පඤ්චමත්තෙහි භික්ඛුසතෙහි යෙන **චම්පා** තදවසරි. තත්ර සුදං භගවා චම්පායං විහරති **ගග්ගරාය** පොක්ඛරණියා තීරෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන **සොණදණ්ඩො** බ්රාහ්මණො චම්පං අජ්ඣාවසති සත්තුස්සදං සතිණකට්ඨොදකං සධඤ්ඤං රාජභොග්ගං රඤ්ඤා මාගධෙන සෙනියෙන **බිම්බිසාරෙන** දින්නං රාජදායං බ්රහ්මදෙය්යං."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. අස්සොසුං ඛො චම්පෙය්යකා බ්රාහ්මණගහපතිකා “සමණො ඛලු භො ගොතමො සක්යපුත්තො සක්යකුලා පබ්බජිතො අඞ්ගෙසු චාරිකං චරමානො මහතා භික්ඛුසඞ්ඝෙන සද්ධිං පඤ්චමත්තෙහි භික්ඛුසතෙහි චම්පං අනුප්පත්තො, චම්පායං විහරති ගග්ගරාය පොක්ඛරණියා තීරෙ. තං ඛො පන භවන්තං ගොතමං එවං කල්යාණො කිත්තිසද්දො අබ්භුග්ගතො: “ඉතිපි සො භගවා අරහං සම්මාසම්බුද්ධො විජ්ජාචරණසම්පන්නො සුගතො ලොකවිදූ අනුත්තරො පුරිසදම්මසාරථි සත්ථා දෙවමනුස්සානං බුද්ධො භගවා’ති. සො ඉමං ලොකං සදෙවකං සමාරකං සබ්රහ්මකං සස්සමණබ්රාහ්මණිං පජං සදෙවමනුස්සං සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදෙති. සො ධම්මං දෙසෙති ආදිකල්යාණං මජ්ඣෙකල්යාණං පරියොසානකල්යාණං සාත්ථං සබ්යඤ්ජනං කෙවලපරිපුණ්ණං පරිසුද්ධං බ්රහ්මචරියං පකාසෙති. සාධු ඛො පන තථාරූපානං අරහතං දස්සනං හොතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. අථ ඛො චම්පෙය්යකා බ්රාහ්මණගහපතිකා චම්පාය නික්ඛමිත්වා සඞ්ඝසඞ්ඝී ගණීභූතා යෙන ගග්ගරා පොක්ඛරණී තෙනුපසඞ්කමන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "4. තෙන ඛො පන සමයෙන සොණදණ්ඩො බ්රාහ්මණො උපරිපාසාදෙ දිවාසෙය්යං උපගතො හොති. අද්දසා ඛො සොණදණ්ඩො බ්රාහ්මණො චම්පෙය්යකෙ බ්රාහ්මණගහපතිකෙ චම්පාය නික්ඛමිත්වා සඞ්ඝසඞ්ඝී ගණීභූතෙ යෙන ගග්ගරා පොක්ඛරණී තෙනුපසඞ්කමන්තෙ. දිස්වා ඛත්තං ආමන්තෙසි: “කින්නු ඛො භො ඛත්තෙ චම්පෙය්යකා බ්රාහ්මණගහපතිකා චම්පාය නික්ඛමිත්වා සඞ්ඝසඞ්ඝී ගණීභූතා යෙන ගග්ගරා පොක්ඛරණී තෙනුපසඞ්කමන්තී?”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "සොණදණ්ඩ සූත්‍රය",
                        "level": 3
                    },
                    {
                        "format": 13,
                        "text": "1. මා විසින් මෙසේ අසන ලදි: එක් සමයෙක්හි භාග්‍යවතුත් වහන්සේ භික්ෂූන් පන්සියක් පමණ වූ මහත් පැවිදිමුළුවක් හා අංග රටෙහි සැරිසරන සේක්, චම්පා නුවරට වැඩි සේක. භාග්‍යවතුන් වහන්සේ එහි ඒ චම්පා නුවර සමීපයෙහි ගර්‍ගරා පොකුණු තෙරැ වසන සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එ සමයෙහි සොණදණ්ඩ බමුණු තෙමේ බහුජනාකිර්‍ණ වූ, තණ දඬු දිය සුලභ වූ, බොහෝ ධන ධාන්‍ය ඇති, රජුහුගෙන් ලත් නින්දගම් වූ (රාජස්‍වරූපයෙන් පරිභෝග කට යුතු වූ), මගධ රටට අධිපති සේනිය බිම්බිසාර රජු විසින් දූන් රාජදායාද්‍ය වූ, ශ්‍රේෂ්ඨ ත්‍යාගය වූ චම්පා නුවරැ වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "2. චම්පා නුවරැ වැසි බමුණුගැහැවියෝ (රටෙහි පැතිරැ පැවැති) මතු දැක්වෙන කථාව ඇසූහ: “භවත්නි, ශාක්‍යපුත්‍ර වූ, ශාක්‍යකුලයෙන් නික්මැ පැවිදි වූ, ශ්‍රමණ ගෞතම තෙමේ වූ කලි භික්‍ෂූන් පන්සියක් පමණ වූ මහපැවිදිමුළුවක් හා අඟුරටැ සැරි සරනුයේ, චම්පාවට පැමිණියේ, එය අසලැ, ගර්‍ගරා පොකුණ තෙරැ වෙසෙයි. ඒ භගවත් තෙමේ මේ මේ කරුණින් අර්හත් ය, සම්‍යක්සම්බුද්ධ ය,විද්‍යාචරණසම්පන්න ය, සුගත ය, ලොකවිත් ය, නිරුත්තර පුරුෂදම්‍යසාරථී ය, දෙව්මිනිසුනට ශාස්තෘ ය, බුද්‍ධ ය, භගවත් ය. හේ දෙවියන් සහිත මරුන් සහිත බඹුන් සහිත මේ ලොව, මහණබමුණන් සහිත දෙවි මිනිසුන් සහිත මේ සත්ත්‍වවර්‍ගයා, තමා ම සිය විශිෂ්ඨ නුවණින් දැන පසක් කොට ලොවට දන්වයි. ආදිකල්‍යාණ මධ්‍යකල්‍යාණ පර්යවසානකල්‍යාණ වූ (සතිපට්ඨානාදි) මනා අර්ථ ඇති, මනා (සම්පූර්‍ණ) ව්‍යංජන ඇති, සර්‍වාකාර පරිපූර්‍ණ, පිරිසිදු දහමක් දෙසයි. එසේ දෙසනුයේ ද, සියලු සසුන්බඹසර පවසයි. එබඳු රහතුන් දැක්ම වූ කලි හිත වැඩ ගෙනැ දෙන්නෙකැ’යි ඒ භවද් ගෞතමයන් වහන්සේ පිළිබඳ මෙසේ උතුම් වූ කීර්තිශබ්දයෙක් උස් වැ නැංගේ ය” යනු යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "3. ඉක්බිති චම්පාපුර වැසි බමුණෝත් ගැහැවියෝත් චම්පායෙන් නික්මැ බොහෝ බොහෝ වැ රැස් වූවෝ, එකි එකී පැත්තෙහි මුළු මුළු වැ නුවරිත් පිටතැ දි මහ මුළුවෙක් වැ එකතු වූවෝ, ගර්‍ගරා පොකුණ අතට යෙති.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "4. එ සමයෙහි සොණදණ්ඩ බමුණු තෙමේ තමා පහයැ උඩු මහලෙහි දවයහනට පැමිණියේ වෙයි. හේ (කවළියෙන් බලනුයේ) චම්පායෙන් නික්මැ බොහො බොහෝ වී රැස් වැ, එක් එක් පසැ මුළු මුළු වැ, නුවරින් පිටතැ දී මහ මුළුවක් වැ එකතු වැ ගර්‍ගරා පොකුණ අතට යන චම්පාවාසී බමුණන් ද ගැහැවියන් ද දක්කේ ය. දැක ක්‍ෂත්තෘහු බණවා “භවත් කෂත්තෘව, කවර හෙයින් චම්පාවාසී බමුණොත් ගැහැවියෝත් චම්පායෙන් නික්මැ බොහො බොහෝ වී රැස් වැ එකි එකී පසැ මුළු මුළු වැ නුවරින් පිටතැ දී මහ මුළුවෙක් වැ එකතු වැ ගර්‍ගරා පොකුණ කරා යෙත් දැ ‍‍‍?” යි විචාළේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 224,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“අත්ථි ඛො භො සමණො ගොතමො සක්යපුත්තො සක්යකුලා පබ්බජිතො අඞ්ගෙසු චාරිකං චරමානො මහතා භික්ඛුසඞ්ඝෙන සද්ධිං පඤ්චමත්තෙහි භික්ඛුසතෙහි චම්පං අනුප්පත්තො චම්පායං විහරති ගග්ගරාය පොක්ඛරණියා තීරෙ. තං ඛො පන භවන්තං ගොතමං එවං කල්යාණො කිත්තිසද්දො අබ්භුග්ගතො: ‘ඉතිපි සො භගවා අරහං සම්මාසම්බුද්ධො විජ්ජාචරණසම්පන්නො සුගතො ලොකවිදූ අනුත්තරො පුරිසදම්මසාරථි සත්ථා දෙවමනුස්සානං බුද්ධො භගවා’ති. තමෙතෙ භවන්තං ගොතමං දස්සනාය උපසඞ්කමන්තී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "5. තෙන හි භො ඛත්තෙ යෙන චම්පෙය්යකා බ්රාහ්මණගහපතිකා තෙනුපසඞ්කම. උපසඞ්කමිත්වා චම්පෙය්යකෙ බ්රාහ්මණගහපතිකෙ එවං වදෙහි: “සොණදණ්ඩො භො බ්රාහ්මණො එවමාහ: ‘ආගමෙන්තු කිර භවන්තො සොණදණ්ඩො’පි බ්රාහ්මණො සමණං ගොතමං දස්සනාය උපසඞ්කමිස්සතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘එවං භො’ති ඛො සො ඛත්තා සොණදණ්ඩස්ස බ්රාහ්මණස්ස පටිස්සුත්වා යෙන චම්පෙය්යකා බ්රාහ්මණගහපතිකා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා චම්පෙය්යකෙ බ්රාහ්මණගහපතිකෙ එතදවොච: “සොණදණ්ඩො භො බ්රාහ්මණො එවමාහ: “ආගමෙන්තු කිර භවන්තො, සොණදණ්ඩො’පි බ්රාහ්මණො සමණං ගොතමං දස්සනාය උපසඞ්කමිස්සතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "6. තෙන ඛො පන සමයෙන නානාවෙරජ්ජකානං බ්රාහ්මණානං පඤ්චමත්තානි බ්රාහ්මණසතානි චම්පායං පටිවසන්ති කෙනචිදෙව කරණීයෙන. අස්සොසුං ඛො තෙ බ්රාහ්මණා: ‘සොණදණ්ඩො කිර බ්රාහ්මණො සමණං ගොතමං දස්සනාය උපසඞ්කමිස්සතී’ති. අථ ඛො තෙ බ්රාහ්මණා යෙන සොණදණ්ඩො බ්රාහ්මණො තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා සොණදණ්ඩං බ්රාහ්මණං එතදවොචුං: ‘සච්චං කිර භවං සොණදණ්ඩො සමණං ගොතමං දස්සනාය උපසඞ්කමිස්සතී’?”ති"
                    },
                    {
                        "type": "paragraph",
                        "text": "“එවං ඛො මෙ භො හොති අහම්පි සමණං ගොතමං දස්සනාය උපසඞ්කමිස්සාමී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "7. “මා භවං සොණදණ්ඩො සමණං ගොතමං දස්සනාය උපසඞ්කමි. න අරහති භවං සොණදණ්ඩො සමණං ගොතමං දස්සනාය උපසඞ්කමිතුං. සචෙ භවං සොණදණ්ඩො සමණං ගොතමං දස්සනාය උපසඞ්කමිස්සති, භොතො සොණදණ්ඩස්ස යසො හායිස්සති සමණස්ස ගොතමස්ස යසො අභිවඩ්ඪිස්සති. යම්පි භොතො සොණදණ්ඩස්ස යසො හායිස්සති සමණස්ස ගොතමස්ස යසො අභිවඩ්ඪිස්සති. ඉමිනා පඞ්ගෙන න අරහති භවං සොණදණ්ඩො සමණං ගොතමං දස්සනාය උපසඞ්කමිතුං. සමණො ත්වෙව ගොතමො අරහති භවන්තං සොණදණ්ඩං දස්සනාය උපසඞ්කමිතුං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "“භවත, කාරණයෙක් ඇත: ශාක්‍යපුත්‍ර වූ, ශාක්‍යකුලයෙන් නික්මැ, පැවැදි වූ ශ්‍රමණ ගෞතම තෙමේ අංග රටැ සැරි සරනුයේ, භික්‍ෂූන් පන්සියක් පමණ වූ මහත් මහණමුළුවක් හා චම්පාවට පැමිණියේ, චම්පා පුර සමීපයේ වූ ගර්‍ගරා නම් පොකුණ අද්දරැ වෙසෙයි. ‘ඒ භගවත් තෙමේ මේ මේ කරුණින් අර්හත් ය, සම්‍යක්සම්බුද්ධ ය, විද්‍යාචරණ සම්පන්න ය, සුගත ය, ලොකවිත් ය, නිරුත්තර පුරුෂදම්‍යසාරථි ය, දෙව්මිනිසුනට ශාස්තෘ ය, බුද්ධ ය, භගවත් යැ යි මෙසේ ඒ භවද් ගෞතමයා පිළිබඳ භද්‍ර වූ ගුණඝොෂයෙක් උස් වැ නැංගේ ය. මොහු ඒ භවද් ගෞතමයා දක්නා පිණිස එහි යෙත්” යැ යි ක්‍ෂත්තෘ ‍ තෙම කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "5. “භවත් ක්‍ෂත්තෘව, එසේ වී නම්, ඒ චම්පාවාසී බමණූ ගැහැවියන් වෙත එළැඹ ඔවුනට “හවත්හු (මොහොතක්) බලා පොරොත්තු වෙත්වා. සොණදණ්ඩ බමුණාත් ශ්‍රමණ ගෞතමයන් දක්නට එහි යන්නේයැ’ යි සැළ කරව” යි කී ය. ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "‘එසේ ය භවතැ’යි කියා ක්‍ෂත්තෘ තෙමේ සොණදණ්ඩ බමුණාට පිළිවදන් දී, චම්පාවාසී ඒ බමුණු ගැහැවියන් කරා එළැඹ “භවත්නි, භවත්හු බලා පොරොත්තු වෙත් වා. සොණදණ්ඩ බමුණු ද ශ්‍රමණ ගෞතමයා දක්නට එහි යන්නේ” යැ යි දැන්වී ය."
                    },
                    {
                        "format": 13,
                        "text": "6. එ සමයෙහි වනාහි නොයෙක් විදෙසින් පැමිණි පන්සියක් පමණ බමුණෝ කිසි කටයුත්තක් පිණිස චම්පා නුවරැ වෙසෙත්. ඒ බමුණෝ ‘සොණදණ්ඩ බමුණා මහණ ගොයුම්හු දක්නට යෙත් ලු’යි ඇසූහ. ඉක්බිති ඔහු සොණදණ්ඩ බමුණා කරා ගියහ. ගොස් “භවත් සොණදණ්ඩ තෙමේ මහණ ගොයුමන් දක්නට යන්නේ ල යනු සැබෑ ද?”යි විචාළහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“භවත්නි, (සැබෑ ය) ‘මමත් මහණ ගොයුමන් දක්නට යන්නෙමි’යි මට මෙසේ සිතෙක් වේ” යැ යි සොණදණ්ඩ තෙමේ කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "7. එ බස් අසා ඔහු කියන්නෝ, “භවත් සොණදණ්ඩ තෙමේ මහණ ගොයුමන් දක්නට නො යේ වා. භවත් සොණදණ්ඩ තෙමේ මහණ ගොයුමන් දක්නට නො නිසි වේ. ඉදින් භවත් සොණදණ්ඩ තෙමේ මහණ ගොයුමන් දක්නට යන්නේ නම්, භවත් සොණදණ්ඩයාගේ යශස් පිරිහෙන්නේ ය, මහණ ගොයුමන්ගේ යශස් වැඩෙන්නේ ය, ‘භවත් සොණදණ්ඩයාගේ යශස් පිරිහෙන්නේ ය, මහණ ගොයුමන්ගේ යශස් වැඩෙන්නේ ය’ යන යමෙක් ඇද්ද මේ කරුණින් භවත් සොණදණ්ඩ තෙමේ මහණ ගොයුම්හු දක්නා පිණිස එහි යන්නට නො නිසි ය. මහණ ගොයුමාණන් ම භවත් සොණදණ්ඩයන් දකින්නට එනු නිසි ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 226,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "භවං හි සොණදණ්ඩො උභතො සුජාතො මාතිතො ච පිතිතො ච, සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා, අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "යම්පි භවං සොණදණ්ඩො උභතො සුජාතො මාතිතො ච පිතිතො ච, සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා, අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන. ඉමිනා පඞ්ගෙන න අරහති භවං සොණදණ්ඩො සමණං ගොතමං දස්සනාය උපසඞ්කමිතුං. සමණො ත්වෙව ගොතමො අරහති භවන්තං සොණදණ්ඩං දස්සනාය උපසඞ්කමිතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි සොණදණ්ඩො අඩ්ඪො මහද්ධනො මහාභොගො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි සොණදණ්ඩො අජ්ඣායකො මන්තධරො තිණ්ණං වෙදානං පාරගූ සනිඝණ්ඩුකෙටුභානං සාක්ඛරප්පභෙදානං ඉතිහාසපඤ්චමානං, පදකො, වෙය්යාකරණො, ලොකායතමහාපුරිසලක්ඛණෙසු අනවයො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි සොණදණ්ඩො අභිරූපො දස්සනීයො පාසාදිකො පරමාය වණ්ණපොක්ඛරතාය සමන්නාගතො බ්රහ්මවණ්ණී බ්රහ්මවච්චසී අක්ඛුද්දාවකාසො දස්සනාය -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි සොණදණ්ඩො සීලවා වුද්ධසීලී වුද්ධසීලෙන සමන්නාගතො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි සොණදණ්ඩො කල්යාණවාචො කල්යාණවාක්කරණො පොරියා වාචාය සමන්නාගතො විස්සට්ඨාය අනෙලගලාය අත්ථස්ස විඤ්ඤාපනියා -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි සොණදණ්ඩො බහුන්නං ආචරියපාචරියො තීණි මාණවකසතානි මන්තෙ වාචෙති. බහූ ඛො පන නානාදිසා නානාජනපදා මාණවකා ආගච්ඡන්ති භොතො සොණදණ්ඩස්ස සන්තිකෙ මන්තත්ථිකා මන්තෙ අධීයිතුකාමා -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි සොණදණ්ඩො ජිණ්ණො වුද්ධො මහල්ලකො අද්ධගතො වයො අනුප්පත්තො. සමණො ගොතමො තරුණො චෙව තරුණපබ්බජිතො ච -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි සොණදණ්ඩො රඤ්ඤො මාගධස්ස සෙනියස්ස බිම්බිසාරස්ස සක්කතො ගරුකතො මානිතො පූජිතො අපචිතො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි සොණදණ්ඩො බ්රාහ්මණස්ස පොක්ඛරසාතිස්ස සක්කතො ගරුකතො මානිතො පූජිතො අපචිතො -පෙ-."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "‘භවත් සොණදණ්ඩ තෙමේ මවුපසින් ද පියපසින් ද යන දෙපසින් මැ අභිජාත ය. සත්වන මීමුතු යුවල තෙක් පිරිසිදු මවුකුස ඇත්තේ ය. ජාතිවාදයෙන් (කුල පිළිබඳ තෙප්ලෙන්) නොහෙළන ලද්දේ ය. නො ගරහන ලද්දේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත් සොණදණ්ඩ තෙමේ මවුපසින් ද පියපසින් ද යන දෙ පසින් මැ අභිජාත ය. සත්වන මීමුතු යුවල තෙක් පිරිසිදු මවුකුස ඇතියේ ය, ‘ජාතිවාදයෙන් ඉවත නො හෙළන ලද්දේ ය, නො ගරහන ලද්දේ ය’ යන යමෙක් ඇද්ද, මේ කරුණෙනුත් භවත් සොණදණ්ඩ තෙමේ මහණ ගොයුම්හු දක්නට යනු නො වටී. මහණ ගොයුමන් ම භවත් සොණදණ්ඩයා දක්නට එනු වටී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද භවත් සොණදණ්ඩ තෙමේ වූ කලි ආඪ්‍ය ය, මහත් ධන ඇත්තේ ය, මහද්භෝග ඇත්තේ ය ...‍",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත් සොණදණ්ඩ තෙමේ වූ කලී වේද හදාරන්නෙක. වේදයන් සිතැ ලා දරන්නෙක. නිඝණ්ටු කෛටහශාස්ත්‍ර සහිත, අක්‍ෂරප්‍රභෙද (ශික්‍ෂා හා නිරුක්ති) සහිත, ඉතිහාසය පස්වනු කොටැති ත්‍රිවෙදයන්ගේ පරතෙර පැමිණියෙක, පදපාඨ දන්නෙක. එයින් අන්‍ය සියලු ව්‍යාකරණ විධි ද දන්නෙක. ලොකායන ශාස්ත්‍රයෙහිත් මහාපුරුෂලක්‍ෂණ ශාසත්‍රයෙහිත් නිපුණයෙක … ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "භවත් සොණදණ්ඩ තෙමේ වූ කලි විශිෂ්‍ට රූපශෝභා ඇත්තෙක, දකුම් කටයුතු ය, ප්‍රසාද එළවන සුලු ය, උතුම් වර්‍ණ‍සෞන්‍දර්‍ය්‍යයෙන් සමන්විත ය, උතුම් රන්වන් පැහැත්තෙක, උතුම් ශරීරප්‍රභා ඇත්තෙක. (ආරෝහපරිණාහසම්පත්තියෙන් ද අවයවයන්ගේ පරිපූර්‍ණත්‍වයෙන් ද) සිරුරෙහි දැක්මට නොමඳ වූ අවකාශ ඇත්තෙක ..."
                    },
                    {
                        "format": 13,
                        "text": "භවත් සොණදණ්ඩ තෙමේ සිල්වත් ය, වැඩුණු සිල් ඇත්තේ ය, වැඩුණු ශීලයෙන් යුක්ත ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත් සොණදණ්ඩ තෙමේ කලණ තෙපුල් ඇත්තේ, කලණ මිහිරි බස් කිය‍න්නේ, නිදොස් වූ කෙලතොලු නොවූ, කී අරුත අඟවනු සමත් සිලිටි බසින් සමන්විත ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත් සොණදණ්ඩ තෙමේ බොහෝ දෙනාට ආචාර්‍ය ද ප්‍රාචාර්‍ය ද වූයේ, තුන්සියක් මාණවකයනට වේදයන් කියවයි. වේදයන් ප්‍රයෝජන කොටැති, වේද හදාරනු කැමැති බොහෝ මාණවකයෝ නන් දෙසින් නන්රටින් භවත් සොණදණ්ඩයා වෙත එත් ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත් සොණදණ්ඩ තෙමේ වූ කලි ජරාජීර්ණ ය, වයොවෘද්ධ ය, මහලු ය, බොහෝ කල් ඉක්මැවූයෙක, පැසිම් වයසට පැමිණියෙක. මහණ ගොයුම් තෙමේ තරුණ ද වේ. තරුණ පැවිද්දෙක් ද වේ ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත් සොණදණ්ඩ තෙමේ වූ කලි මගධාධිපති සෙතිය බිම්බිසාර රජහු විසින් සත්කාර කරන ලද්දෙක, ගුරුකාර කරන ලද්දෙක, බුහුමන් කරන ලද්දෙක, පුදන ලද්දෙක, යටත් පැවැතුම් දක්වන ලද්දෙක ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත් සොණදණ්ඩ තෙමේ වූ කලි පොකුරුසැත් බමුණා විසින් සත්කෘත ද ගුරුකෘත ද මානීත ද පූජිත ද අපචිත ද වේ ...",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 228,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "භවං හි සොණදණ්ඩො චම්පං අජ්ඣාවසති සත්තුස්සදං සතිණකට්ඨොදකං සධඤ්ඤං රාජභොග්ගං රඤ්ඤා මාගධෙන සෙනියෙන බිම්බිසාරෙන දින්නං රාජදායං බ්රහ්මදෙය්යං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යම්පි භවං සොණදණ්ඩො චම්පං අජ්ඣාවසති සත්තුස්සදං සතිණකට්ඨොදකං සධඤ්ඤං රාජභොග්ගං රඤ්ඤා මාගධෙන සෙනියෙන බිම්බිසාරෙන දින්නං රාජදායං බ්රහ්මදෙය්යං, ඉමිනාපඞ්ගෙන න අරහති භවං සොණදණ්ඩො සමණං ගොතමං දස්සනාය උපසඞ්කමිතුං. සමණො ත්වෙව ගොතමො අරහති භවන්තං සොණදණ්ඩං දස්සනාය උපසඞ්කමිතුන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "8. එවං වුත්තෙ සොණදණ්ඩො බ්රාහ්මණො තෙ බ්රාහ්මණෙ එතදවොච: තෙන හි භො මමපි සුණාථ, යථා මයමෙව අරහාම තං භවන්තං ගොතමං දස්සනාය උපසඞ්කමිතුං නත්වෙව අරහති සො භවං ගොතමො අම්හාකං දස්සනාය උපසඞ්කමිතුං. සමණො ඛලු භො ගොතමො උභතො සුජාතො මාතිතො ච පිතිතො ච, සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා, අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "යම්පි භො සමණො ගොතමො උභතො සුජාතො මාතිතො ච පිතිතො ච, සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා, අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන, ඉමිනාපඞ්ගෙන න අරහති සො භවං ගොතමො අම්හාකං දස්සනාය උපසඞ්කමිතුං. අථ ඛො මයමෙව අරහාම තං භවන්තං ගොතමං දස්සනාය උපසඞ්කමිතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො මහන්තං ඤාතිසඞ්ඝං ඔහාය පබ්බජිතො ....."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො පහූතං හිරඤ්ඤසුවණ්ණං ඔහාය පබ්බජිතො භූමිගතඤ්ච වෙහාසට්ඨඤ්ච ....."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො දහරො’ව සමානො යුවා සුසු කාළකෙසො භද්රෙන යොබ්බ__නෙ__න සමන්නාගතො පඨමෙන වයසා අගාරස්මා අනගාරියං පබ්බජිතො ....."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො අකාමකානං මාතාපිතුන්නං අස්සුමුඛානං රුදන්තානං කෙසමස්සුං ඔහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජිතො ....."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො අභිරූපො දස්සනීයො පාසාදිකො පරමාය වණ්ණපොක්ඛරතාය සමන්නාගතො බ්රහ්මවණ්ණී බ්රහ්මවච්චසී අක්ඛුද්දාවකාසො දස්සනාය ....."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො සීලවා අරියසීලී කුසලසීලී කුසලසීලෙන සමන්නාගතො ....."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "භවත් සොණදණ්ඩ තෙමේ වූ කලි බහුජනාකීර්‍ණ, තණ දඬු දිය යන මෙයින් යුක්ත, බොහෝ ධාන්‍ය ඇති, රජුගෙන් ලත් ස්‍වකීය පරිභෝග වස්තු වූ, රජුගේ දායාද්‍ය වූ, සෙතිය බිම්බිසාර මහරජුහු දුන් ‍ශ්‍රේෂ්ඨ ත්‍යාගය වූ චම්පානුවරට අධිපති වැ වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත් සොණදණ්ඩ තෙමේ බහුජනාකීර්‍ණ ... චම්පානුවරට අධිපති වැ වෙසේ ය යන යම් කරුණෙක් ඇද්ද, මේ කරුණිනුත් භවත් සොණදණ්ඩ තෙම මහණ ගොයුම්හු දක්නට යනු නොනිසි ය. මහණ ගොයුම් තෙමේ ම භවත් සොණදණ්ඩයා දක්නට එනු සුදුසු යැ”සි කීහ.‍",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "8. මෙසේ කී කල්හි සොණදණ්ඩ බමුණු තෙමේ ඒ බමුණනට කියනුයේ, “භවත්නි, එසේ වී නම් ඒ භවද්ගෞතමයන් අප දක්නට ඊම නොවැ අප ම ඔබ දක්නට යනු සුදුසු බවට මා කියන බස් ද අසවු: ‘භවත්නි, මහණ ගොයුම්හු වූ කලි මවුපසින් ද පියපසින් ද යන දෙපසින් මැ අභිජාතයහ, සත් වන මීමුතු යුවල තෙක් පිරිසිදු මවුකුස ඇත්තෝ ය. ජාතිවාදයෙන් නො හෙළන ලද්දෝ ය, නො ගරහන ලද්දෝ ය.’",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘මහණ ගොයුම්හු මවුපසින් ද පියපසින් ද යන දෙපසින් ම අභිජාතයහ … නොගරහන ලද්දෝ ය’ යන යමෙක් ඇද්ද, මේ කරුණිනුදු ඒ භවද්ගෞතමයෝ අප දක්නට එන්නට නො නිස්සහ. වැළි අපි ම ඔබ දක්නට යනු නිස්සම්හ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි මහත් නෑමුළුව පියා පැවිදි වූවෝය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි පොළොව යට ද පොළොව මත්තෙහි ද වූ මහත් හිරණ්‍යස්‍වර්‍ණ හැරැ පියා පැවිදි වූවෝ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි සොඳුරු යොවුනෙන්, (තුන් වයසින්) පළමු වයසින් යුත් වූවෝ ම, තරුණ වූවෝ ම, මනා කළු කෙහෙ ඇති වැ යොවුන් වියෙහි සිටියෝ ම ගිහි ගෙන් නික්මැ පැවිදි බිමට වන්නෝ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි මවුපියන් ඔබ පැවිදි වනුවට නොකැමැති වැ කඳුළු පිරුණු මුහුනු ඇති වැ හඬද්දී එය නොතකා කෙහෙ රවුළු බා දමා කසා වත් හැඳ ගිහි ගෙන් නික්මැ පැවිද්දට වන්නෝ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි විශිෂ්‍ට රූප සම්පත් ඇත්තෝ ය, දැකුම් කටයුතු හ, ප්‍රසාදජනක හ, උතුම් වර්‍ණසෞන්‍දර්‍යයෙන් සමන්විත හ, බඹහු සේ උතුම් රන් පැහැ ඇත්තෝ ය, උත්තම ශරීරප්‍රඟා ඇත්තෝ ය, සිය සිරුරෙඟි දැක්මට නොමඳ වූ අවකාශ ඇත්තෝ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි සිල්වත් හ, පිරිසිදු සිල් ඇත්තෝ ය, නිදොස් සිල් ඇත්තෝ ය, නිදොස් ශීලයෙත් සමන්විත හ ...",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 230,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො කල්යාණවාචො කල්යාණවාක්කරණො පොරියා වාචාය සමන්නාගතො විස්සට්ඨාය අනෙලගලාය අත්ථස්ස විඤ්ඤාපනියා. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො බහූනං ආචරියපාචරියො. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො ඛීණකාමරාගො විගතචාපල්ලො. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො කම්මවාදී කිරියවාදී අපාපපුරෙක්ඛාරො බ්රහ්මඤ්ඤාය පජාය. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො උච්චා කුලා පබ්බජිතො අසම්භින්නඛත්තියකුලා. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො අඩ්ඪා කුලා පබ්බජිතො මහද්ධනා මහාභොගා. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණං ඛලු භො ගොතමං තිරොරට්ඨා තිරොජනපදා __පඤ්හං__ සම්පුච්ඡිතුං ආගච්ඡන්ති. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණං ඛලු භො ගොතමං අනෙකානි දෙවතාසහස්සානි පාණෙහි සරණං ගතානි. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණං ඛලු භො ගොතමං එවං කල්යාණො කිත්තිසද්දො අබ්භුග්ගතො ‘ඉතිපි සො භගවා අරහං සම්මාසම්බුද්ධො විජ්ජාචරණසම්පන්නො සුගතො ලොකවිදූ අනුත්තරො පුරිසදම්මසාරථි සත්ථා දෙවමනුස්සානං බුද්ධො භගවා’ ති. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො ද්වත්තිංසමහාපුරිසලක්ඛණෙහි සමන්නාගතො. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො එහිසාගතවාදී සඛිලො සම්මොදකො අබ්භාකුටිකො උත්තානමුඛො පුබ්බභාසී. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො චතුන්නං පරිසානං සක්කතො ගරුකතො මානිතො පූජිතො අපචිතො. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණෙ ඛලු භො ගොතමෙ බහූ දෙවා ච මනුස්සා ච අභිප්පසන්නා. -පෙ-"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "මහණ ගොයුම්හු වූ කලි කලණ තෙපුල් ඇත්තෝ ය, කලණ මිහිරි බස් කියන්නෝ ය, නිදොස් වූ, කෙලතොලු නොවූ, කී අරුත හඟවනු සමත් සිලිටි බසින් සමන්විතයෝ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි බොහෝ දෙනාට ආචාර්‍ය ද ප්‍රාචාර්‍ය ද වෙති ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි පහ වූ කාමරාග ඇත්තෝ ය, පහ වූ චපල බව් ඇත්තෝ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි කර්‍මවාදි ද ක්‍රියාවාදි ද වෙති. ලොවුතුරා දහම් පුරඃසර කොට පවතිති. සැරියුත් මුගලන් ඈ බමුණු පිරිසට නායක වැ හැසිරෙති (නොහොත් තමනට විරුද්ධ වූ බමුණු පිරිසට පවා අහිතක් නොසිතා හිත සුව ම පතන්නෝ හැසිරෙති) ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි අමිශ්‍ර (පිරිසිදු) කැත්කුලය වූ උසස් කුලයෙන් නික්මැ පැවිදි වූවෝ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි මහත් ධන ඇති මහත් භෝග ඇති සමෘද්ධ කුලයෙන් නික්මැ පැවිදි වූවෝ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුමන් කරා පිට රටින් පිට දනවුයෙන් පැණ පුළුවුස්නට එති ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, නොයෙක් දහස් ගණන් දෙවියෝ මහණ ගොයුමන් දිවිහිමියෙන් සරණ ගියහ ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, ‘මේ මේ කරුණින් ඒ භගවත් තෙමේ අර්හත් ය, සම්‍යක්සම්බුද්ධ ය, විද්‍යාචරණසම්පන්න ය, සුගත ය, ලොකවිත් ය, නිරුත්තර පුරුෂදම්‍යසාරථි ය, දෙව්මිනිසුන්හට ශාස්තෘ ය, බුද්ධ ය, භගවත් යැ’ යි මහණ ගොයුමාණන් පිළිබඳ වැ මෙසේ වූ යහපත් ගුණඝෝෂයෙක් ඉතා උස් වැ නැංගේ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි දෙතිස් මහපුරිස්ලකුණුවලින් සමන්විත හ ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි,මහණ ගොයුම්හු වූ කලි තමන් වෙත පැමිණෙන්නවුන් ‘එන්න, මෙහි ආ සේ මැනැවැ’යි කියා පිළිගන්නා සුලු හ, කනට සුව එළවන තෙපුල් බණන්නෝ ය, පිළිසඳරෙඟි දක්‍ෂ හ, බැම නො හකුළුවන්නෝ ය, සුලභ කථා ඇත්තෝ ය, පැමිණියවුනට තුමු පළමුයෙන් කථා කරන සුලු හ ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි (මහණ මෙහෙණි උවසු උවැසි යන) සිවු පිරිස් විසින් සත්කාර කරන ලදු හ, ගුරුකාර කරන ලදු හ, බුහුමන් කරන ලදු හ, පුදන ලදු හ, යටත් පැවැතුම් දක්වන ලදු හ ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුමන් කෙරෙහි වනාහි බොහෝ දෙවියෝත් මිනිස්සුත් වෙසෙසින් පහන් හ ...",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 232,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො යස්මිං ගාමෙ වා නිගමෙ වා පටිවසති, න තස්මිං ගාමෙ වා නිගමෙ වා අමනුස්සා මනුස්සෙ විහෙඨෙන්ති -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො සඞ්ඝී ගණී ගණාචරියො පුථුතිත්ථකරානං අග්ගමක්ඛායති -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "යථා ඛො පන භො එකෙසං සමණබ්රාහ්මණානං යථා වා තථා වා යසො සමුදාගච්ඡති න හෙවං සමණස්ස ගොතමස්ස යසො සමුදාගතො. අථ ඛො අනුත්තරාය විජ්ජාචරණසම්පදාය සමණස්ස ගොතමස්ස යසො සමුදාගතො....."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණං ඛලු භො ගොතමං රාජා මාගධො සෙනියො බිම්බිසාරො සපුත්තො සභරියො සපරිසො සාමච්චො පාණෙහි සරණං ගතො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණං ඛලු භො ගොතමං රාජා පසෙනදී කොසලො සපුත්තො සභරියො සපරිසො සාමච්චො පාණෙහි සරණං ගතො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණං ඛලු භො ගොතමං බ්රාහ්මණො පොක්ඛරසාතී සපුත්තො සභරියො සපරිසො සාමච්චො පාණෙහි සරණං ගතො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො රඤ්ඤො මාගධස්ස සෙනියස්ස බිම්බිසාරස්ස සක්කතො ගරුකතො මානිතො පූජිතො අපචිතො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො රඤ්ඤො පසෙනදිස්ස කොසලස්ස සක්කතො ගරුකතො මානිතො පූජිතො අපචිතො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො බ්රාහ්මණස්ස පොක්ඛරසාතිස්ස සක්කතො ගරුකතො මානිතො පූජිතො අපචිතො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො චම්පං අනුප්පත්තො චම්පායං විහරති ගග්ගරාය පොක්ඛරණියා තීරෙ. යෙ ඛො පන භො කෙචි සමණා වා බ්රාහ්මණා වා අම්හාකං ගාමක්ඛෙත්තං ආගච්ඡන්ති, අතිථී නො තෙ හොන්ති. අතිථී ඛො පනම්හෙහි සක්කාතබ්බා ගරුකාතබ්බා මානෙතබ්බා පූජෙතබ්බා අපචෙතබ්බා. යම්පි භො සමණො ගොතමො චම්පං අනුප්පත්තො චම්පායං විහරති ගග්ගරාය පොක්ඛරණියා තීරෙ. අතිථම්හාකං සමණො ගොතමො. අතිථි ඛො පනම්හෙහි සක්කාතබ්බො ගරුකාතබ්බො මානෙතබ්බො පූජෙතබ්බො අපචෙතබ්බො. ඉමිනාපඞ්ගෙන න අරහති සො භවං ගොතමො අම්හාකං දස්සනාය උපසඞ්කමිතුං. අථ ඛො පන මයමෙව අරහාම තං භවන්තං ගොතමං දස්සනාය උපසඞ්කමිතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "එත්තකෙ ඛො අහං භො තස්ස භොතො ගොතමස්ස ගුණෙ පරියාපුණාමි. නො ච ඛො සො භවං ගොතමො එත්තකවණ්ණො. අපරිමාණවණ්ණො හි සො භවං ගොතමො”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයම්හු තුමූ යම් ගමෙක නියම්ගමෙක හෝ වෙසෙත් නම්, එ ගමැ හෝ නියම්ගමැ හෝ වසන මිනිස්නට යක්කු පීඩා නො කෙරෙත් ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි මහ සඟපිරිස් ඇත්තෝ ය, ගණනායක හ, ගණාචාර්‍ය හ, බොහෝ තීර්‍ථංකරයන් අතුරෙහි අග්‍ර හ යි කියනු ලැබෙති ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "යම් සේ වනාහි ඇතැම් මහණබමුණන්ගේ යශස අචේලකතා ආදි පිටතට පෙන්වන යම්තම් ව්‍රතමාත්‍රයෙකින් වැඩෙතත් මහණ ගොයුමන්ගේ වූ කලි යශස එසේ වැඩුණෙක් නො වේ. වැලි තමන් තුළැ ම වූ නිරුත්තර විද්‍යාචරණසම්පතින් වැඩුණේ වෙයි ...‍‍",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුමන් වූ කලි මගධාධිපති සෙනිය බිම්බිසාර රජ තෙමේ දරුවන් හා බිරියන් හා පිරිස් හා ඇමැත්තන් හා සමග දිවි හිම කොට සරණ ගියේ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුමන් වූ කලි කොශලාධිපති පසේනදී රජ තෙමේ දරුවන් හා බිරියන් හා පිරිස් හා ඇමැත්තත් හා සමග දිවි හිමියෙන් සරණ ගියේ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි පොකුරුසැත් බමුණු තෙමේ දරුවන් හා බිරියන් හා පිරිස් හා ඇමැත්තන් හා සමග දිවිහිමියෙන් සරණ ගියේ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි මගධාධිපති සෙනිය බිම්සර මහරජුහු විසින් සත්කෘත ද ගුරුකෘත ද මානිත ද පූජිත ද අපචිත ද වෙති ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි කොශලාධිපති පසෙනදි රජුහු විසින් සත්කෘත ද ගුරුකෘත ද අපචිත ද වෙති ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි පොකුරුසැත් බමුණුහු විසින් සත්කෘත ද ගුරුකෘත ද මානිත ද පූජිත ද අපචිත ද වෙති ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වනාහි (දැන්) චම්පාවට පැමිණියෝ චම්පාවට නොදුරු තන්හි වූ ගර්‍ගරා පොකුණතෙරැ වෙසෙති. භවත්නි, යම් කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ අපේ ගම්කෙතට එත් නම් උහු අපට අමුත්තෝ වෙත්. අමුත්තෝ වනාහි අප විසින් සත්කාර කළ යුත්තෝ ය, ගුරුකාර කළ යුත්තෝ ය, බුහුමන් කළ යුත්තෝ ය, පිදියැ යුත්තෝ ය, යටත් පැවැතුම් දැක්වියැ යුත්තෝ ය. යම් හෙයෙකින් මහණ ගොයුම්හු චම්පාවට පැමිණියෝ චම්පාව සමීපයේ ගර්‍ගරා පොකුණ තෙරැ වෙසෙත් ද, එ හෙයින් ඔබ අපේ අමුත්තෝ ය. ඒ අමුත්තෝ චනාභි අප විසින් සත්කාර කටයුතු හ, ගරු කටයුතු හ, බුහුමන් කටයුතු භ, පිදියැ යුතු හ, යටත් පැවැතුම් දැක්වියැ යුතු හ. මේ කරුණිනුත් ඒ භවද්ගෞතමයන් අප දක්නට එනු නො වටී. වැළි අපි ම ඔබ දක්නට යෑ යුතු වමු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, ඒ භවද්ගෞතමයන් පිළිබඳ වූ මෙ පමණක් ගුණ මම දනිමි. එහෙත් ඒ භවත් ගෞතමයෝ නම් මෙ පමණක් ම ගුණ ඇත්තෝ නො වෙති. වැළි දු ඔබ පමණ කට නොහැකි ගුණ ඇත්තෝ ය” යනු යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 234,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "9. එවං වුත්තෙ තෙ බ්රාහ්මණා සොණදණ්ඩං බ්රාහ්මණං එතදවොචුං: ‘යථා ඛො භවං සොණදණ්ඩො සමණස්ස ගොතමස්ස වණ්ණෙ භාසති ඉතො චෙ’පි සො භවං ගොතමො යොජනසතෙ විහරති, අලමෙව සද්ධෙන කුලපුත්තෙන දස්සනාය උපසඞ්කමිතුං අපි පුටොසෙන{1}. තෙන හි භො සබ්බෙව මයං සමණං ගොතමං දස්සනාය උපසඞ්කමිස්සාමා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො සොණදණ්ඩො බ්රාහ්මණො මහතා බ්රාහ්මණගණෙන සද්ධිං යෙන ගග්ගරා __පො__ක්ඛරණී තෙනුපසඞ්කමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "10. අථ ඛො සොණදණ්ඩස්ස බ්රාහ්මණස්ස තිරොවනසණ්ඩගතස්ස එවං චෙතසො පරිවිතක්කො උදපාදි: "
                    },
                    {
                        "type": "paragraph",
                        "text": "“අහඤ්චෙව ඛො පන සමණං ගොතමං පඤ්හං පුච්ඡෙය්යං, තත්ර චෙ මං සමණො ගොතමො එවං වදෙය්ය: ‘න ඛො එස බ්රාහ්මණ පඤ්හො එවං පුච්ඡිතබ්බො, එවං නාමෙස බ්රාහ්මණ පඤ්හො පුච්ඡිතබ්බො’ති. තෙන මං අයං පරිසා පරිභවෙය්ය: ‘බාලො සොණදණ්ඩො බ්රාහ්මණො අබ්යත්තො, නාසක්ඛි සමණං ගොතමං යොනිසො පඤ්හං පුච්ඡිතුන්ති’. යං ඛො පනායං පරිසා පරිභවෙය්ය, යසො’පි තස්ස හායෙථ, යස්ස ඛො පන යසො හායෙථ භොගා’පි තස්ස හායෙය්යුං. යසොලද්ධා ඛො පනම්හාකං භොගා. මඤ්චෙව ඛො පන සමණො ගොතමො පඤ්හං පුච්ඡෙය්ය, තස්ස චාහං පඤ්හස්ස වෙය්යාකරණෙන චිත්තං න ආරාධෙය්යං, තත්ර චෙ මං සමණො ගොතමො එවං වදෙය්ය: ‘න ඛො එස බ්රාහ්මණ පඤ්හො එවං ව්යාකාතබ්බො. එවං නාමෙස බ්රාහ්මණ පඤ්හො ව්යාකාතබ්බො’ති, තෙන මං අයං පරිසා පරිභවෙය්ය: ‘බාලො සොණදණ්ඩො බ්රාහ්මණො, අබ්යත්තො නාසක්ඛි සමණස්ස ගොතමස්ස පඤ්හස්ස වෙය්යාකරණෙන චිත්තං ආරාධෙතුන්ති. යං ඛො පනායං පරිසා පරිභවෙය්ය, යසො’පි තස්ස හායෙථ. යස්ස ඛො පන යසො හායෙථ භොගාපි තස්ස හායෙය්යුං. යසොලද්ධා ඛො පනම්හාකං භොගා. අහඤ්චෙව ඛො පන එවං සමීපගතො සමානො අදිස්වා’ව සමණං ගොතමං නිවත්තෙය්යං, තෙන මං අයං පරිසා පරිභවෙය්ය: ‘බාලො සොණදණ්ඩො බ්රාහ්මණො අබ්යත්තො මානත්ථද්ධො භීතො ච. නො විසහි සමණං ගොතමං දස්සනාය උපසඞ්කමිතුං. කථං හි නාම සමීපගතො සමානො අදිස්වා සමණං ගොතමං නිවත්තිස්සතී?’ති. යං ඛො පනායං පරිසා පරිභවෙය්ය යසො’පි තස්ස හායෙථ. යස්ස ඛො පන යසො හායෙථ, භොගා’පි තස්ස හායෙය්යුං, යසොලද්ධා ඛො පනම්හාකං භොගා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "11. අථ ඛො සොණදණ්ඩො බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. චම්පෙය්යකාපි ඛො බ්රාහ්මණගහපතිකා අප්පෙකච්චෙ භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. අප්පෙකච්චෙ භගවතා සද්ධිං සම්මොදිංසු. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදිංසු. අප්පෙකච්චෙ යෙන භගවා තෙනඤ්ජලිං පනාමෙත්වා එකමන්තං නිසීදිංසු. අප්පෙකච්චෙ නාමගොත්තං සාවෙත්වා එකමන්තං නිසීදිංසු. අප්පෙකච්චෙ තුණ්හීභූතා එකමන්තං නිසීදිංසු."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පුටංසෙනාති’පි පාඨො කෙසුචි පොත්ථකෙසු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "9. මෙසේ කී කල්හි ඒ බමුණෝ සොණදණ්ඩ බමුණා බණවා, “භවත් සොණදණ්ඩ ය, භවත් සොණදණ්‍ඩයා, මහණ ගොයුමන්ගේ ගුණ කියන සැටියෙන් ඒ හවද්ගෞතමයන් මෙයින් යොදුන් සියක් දුරැ වසතත්, සැදැහැති කුලපුතුහු විසින් පාථෙය (මග වියදම්) ගෙන ද ඔබ දක්නට එළැඹෙනු වටී ම ය. එ බැවින් භවත්නි, අපි සියල්ලෝ ම ඒ මහණ ගොයුමන් දක්නට යන්නමු”යි කීහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති සොණදණ්ඩ බමුණු තෙමෙ මහත් බඹුණු ගණයා හා ගර්‍ගරා පොකුණ අතට ගියේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "10. එ කල්හි වනාහි වනලැහැබ තුළට පිවිසි සොණදණ්ඩ බමුණාට මෙසේ චිත්‍තසංකල්පනාවෙක් පහළ විය:",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "“ඉදින් මම් මහණ ගොයුමන් අතින් ප්‍රශ්නයක් විචාරන්නෙම් නම්, (එවිට) ‘බමුණ, මේ පැණය මෙසේ නොචිචාළ මනා යැ’යි මහණ ගොයුම්හු මට කියන්නෝ නම්, එයින් මේ පිරිස ‘සොණදණ්ඩයා අනුවණ ය, නොවියත් ය, මහණ ගොයුමන් අතින් නුවණින් පැණ විචාරන්නට ‍නො හැකි වීයැ’ යි මා නිගන්නාහ. මේ පිරිස යමකු නිගන්නාහු නම්, ඔහුගේ යශස් ද පිරිහෙන්නේ ය. යමක්හුගේ යශස් පිරිහෙන්නේ නම්, ඔහුගේ භෝග සම්පත් ද පිරිහෙන්නේ ය. අපේ භෝග‍යෝ වනාහි යශස් හේතුවෙන් ලැබුණෝ ය. තව ද මහණ ගොයුම්හු මා අතින් පැණ විචාරන්නෝ නම්, ඒ පැණ විසැඳීමෙන් මම ඔවුන්ගේ සිත් නො ගත්තෙම් නම්, එහි දී මහණ ගොයුම්හු ‘බමුණ, මේ පැණය මෙසේ විසඳියැ යුතු නො වේ. බමුණ, මෙය විසැඳියැ යුත්තේ මෙසේ ම යැ’යි මට කියන්නෝ නම්, එයින් මේ පිරිස මට ‘සොණදණ්ඩ බමුණා අනුවණ ය, නොවියත් ය, පැණ විසැඳීමෙන් මහණ ගොයුමන්ගේ සිත ගන්නට නො හැකි වී ය’ යි නිගා කරන්නාහ. මේ පිරිස යමක්හට නිගා කරන්නාහු නම්, ඔහු යශස් ද පිරිහෙන්නේ ය. යමකුගේ යශස පිරිහෙන්නේ නම්, ඔහුගේ භෝග ද පිරිහෙන්නේ ය. අපේ භෝගසම්පත් වනාහි යශස් හේතුයෙන් ලැබුණු දෑ ය. මමත් මෙසේ ළඟට පැමිණියෙම් ම මහණ ගොයුමන් නොදැක පෙරළා යන්නෙම් නම්, එයින් මේ පිරිස ‘සොණදණ්ඩ බමුණා අනුවණ ය, නොවියත් ය, දැඩි මන් ඇත්තේ ය, බිය ගත්තේ ද වේ, මහණ ගොයුමන් දකිනු පිණිස එළැඹෙන්නට නො හැකි විය. මෙසේ ළඟට පැමිණියේ ම මහණ ගොයුමන් නොදැක කෙසේ නම් පෙරළා යෑ හැකි වන්නේ දැ?’ යි මට පරිභව කරන්නාහ. මෙ පිරිස යමකුට පරිහව කරන්නාහු නම් ඔහුගේ යශස ද පිරිහෙන්නේ ය. යමකුගේ යශස පිරිහෙන්නේ නම්, ඔහුගේ භෝගයෝ ද පිරිහෙන්නාහ. අපේ භෝගයෝ යශස්හේතුවෙන් ලද්දෝ ය (එ බැවිනි)” යනු යි."
                    },
                    {
                        "format": 13,
                        "text": "11. ඉක්බිති සොණදණ්ඩ බමුණා භාග්‍යවතුන් වහන්සේ කරා එළැඹියේ ය. එළැඹ, භාග්‍යචතුත් වහන්සේ හා පිළිසඳර කතා කෙළේ ය. සිතැ රැඳවිය යුතු වූ පිළිසඳර කතා අවසන් කොට පසෙක ඉඳගත්තේ ය. චම්පානගරවාසී බමුණෝත් ගැහැවියෝත් කෙනෙක් භාග්‍යවතුන් වහන්සේ ආදරයෙන් වැඳ පසෙක ඉඳගත්හ. කෙනෙක් භාග්‍යවතුන් වහන්සේ හා පිළිසඳර කතා කළහ. සිතැ රැඳවියැ යුතු පිළිසඳර කොට නිමවා පසෙක හිඳගත්හ. කෙනෙක් භාග්‍යවතුත් වහන්සේ දෙසට ඇඳිලි නමා වැඳ පසෙක ඉඳගත්හ. කෙනෙක් නම් ගොත් අස්වා පසෙක ඉඳගත්හ. කෙනෙක් නිහඬ වැ පසෙක ඉඳගත්හ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 236,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "12. තත්රපි සුදං සොණදණ්ඩො බ්රාහ්මණො එතදෙව බහුලමනුවිතක්කෙන්තො නිසින්නො හොති: “අහං චෙව ඛො පන සමණං ගොතමං පඤ්හං පුච්ඡෙය්යං තත්ර චෙ මං සමණො ගොතමො එවං වදෙය්ය ‘න ඛො එස බ්රාහ්මණ පඤ්හො පුච්ඡිතබ්බො’ති, තෙන මං අයං පරිසා පරිභවෙය්ය ‘බාලො සොණදණ්ඩො බ්රාහ්මණො අබ්යත්තො, නාසක්ඛි සමණං ගොතමං යොනිසො පඤ්හං පුච්ඡිතුන්ති’. යං ඛො පනායං පරිසා පරිභවෙය්ය යසොපි තස්ස හායෙථ. යස්ස ඛො පන යසො හායෙථ භොගාපි තස්ස හායෙය්යුං. යසොලද්ධා ඛො පනම්හාකං භොගා. මඤ්චෙව ඛො පන සමණො ගොතමො පඤ්හං පුච්ඡෙය්ය, තස්ස චාහං පඤ්හස්ස වෙය්යාකරණෙන චිත්තං න ආරාධෙය්යං, තත්ර චෙ මං සමණො ගොතමො එවං වදෙය්ය ‘න ඛො එස බ්රාහ්මණ, පඤ්හො එවං ව්යාකාතබ්බො, එවං නාමෙස බ්රාහ්මණ පඤ්හො ව්යාකාතබ්බො’ති, තෙන මං අයං පරිසා පරිභවෙය්ය: ‘බාලො සොණදණ්ඩො බ්රාහ්මණො අබ්යත්තො, නාසක්ඛි සමණස්ස ගොතමස්ස පඤ්හස්ස වෙය්යාකරණෙන චිත්තං ආරාධෙතුන්ති’. යං ඛො පනායං පරිසා පරිභවෙය්ය යසො’පි තස්ස හායෙථ. යස්ස ඛො පන යසො හායෙථ භොගාපි තස්ස හායෙය්යුං. යසොලද්ධා ඛො පනම්හාකං භොගා. අහො වත මං සමණො ගොතමො සකෙ ආචරියකෙ තෙවිජ්ජකෙ පඤ්හං පුච්ඡෙය්ය. අද්ධාවතස්සාහං චිත්තං ආරාධෙය්යං පඤ්හස්ස වෙය්යාකරණෙනා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "13. අථ ඛො භගවතො සොණදණ්ඩස්ස බ්රාහ්මණස්ස චෙතසා චෙතොපරිවිතක්කමඤ්ඤාය එතදහොසි: “විහඤ්ඤති ඛො අයං සොණදණ්ඩො බ්රාහ්මණො සකෙන චිත්තෙන. යන්නූනාහං සොණදණ්ඩං බ්රාහ්මණං සකෙ ආචරියකෙ තෙවිජ්ජකෙ පඤ්හං පුච්ඡෙය්යන්ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා සොණදණ්ඩං බ්රාහ්මණං එතදවොච: “කතීහි පන බ්රාහ්මණ අඞ්ගෙහි සමන්නාගතං බ්රාහ්මණා බ්රාහ්මණං පඤ්ඤපෙන්ති බ්රාහ්මණො’ස්මීති ච වදමානො සම්මා වදෙය්ය න ච පන මුසාවාදං ආපජ්ජෙය්යා?”ති"
                    },
                    {
                        "type": "paragraph",
                        "text": "14. අථ ඛො සොණදණ්ඩස්ස බ්රාහ්මණස්ස එතදහොසි: යං වත නො අහොසි ඉච්ඡිතං, යං ආකඞ්ඛිතං, යං අධිප්පෙතං, යං අභිපත්ථිතං ‘අහො වත මං සමණො ගොතමො සකෙ ආචරියකෙ තෙවිජ්ජකෙ පඤ්හං පුච්ඡෙය්ය, අද්ධා වතස්සාහං චිත්තං ආරාධෙය්යං පඤ්හස්ස වෙය්යාකරණෙනා’ති, තත්ර මං සමණො ගොතමො සකෙ ආචරියකෙ තෙවිජ්ජකෙ පඤ්හං පුච්ඡති. අද්ධා වතස්සාහං චිත්තං ආරාධෙස්සාමි පඤ්හස්ස වෙය්යාකරණෙනා’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "15. අථ ඛො සොණදණ්ඩො බ්රාහ්මණො අබ්භුන්නාමෙත්වා කායං අනුවිලොකෙත්වා පරිසං භගවන්තං එතදවොච: “පඤ්චහි භො ගොතම, අඞ්ගෙහි සමන්නාගතං බ්රාහ්මණා බ්රාහ්මණං පඤ්ඤාපෙන්ති ‘බ්රාහ්මණො’ස්මීති ච වදමානො සම්මා වදෙය්ය න ච පන මුසාවාදං ආපජ්ජෙය්ය. කතමෙහි පඤ්චහි? "
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භො ගොතම බ්රාහ්මණො උභතො සුජාතො හොති මාතිතො ච පිතිතො ච, සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා, අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන. අජ්ඣායකො හොති මන්තධරො තිණ්ණං වෙදානං පාරගූ සනිඝණ්ඩුකෙටුභානං සාක්ඛරප්පභෙදානං ඉතිහාසපඤ්චමානං පදකො වෙය්යාකරණො ලොකායතමහාපුරිසලක්ඛණෙසු අනවයො:"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "12. එහි ද සොණදණ්ඩ තෙමේ “මම මහණ ගොයුමන් අතින් ප්‍රශ්න විචාරන් නෙම් නම්, (එ විටැ) ‘බමුණ, මේ පැණය මෙසේ නො විචාළ මනා යැ’යි මහණ ගොයුම්හු මට කියන්නෝ නම්, එයින් මේ පිරිස ‘සොණදණ්ඩයා අනුවණ ය, නොවියත් යැ’ යි මට පරිභව කරන්නාහ. මේ පිරිස යමකුට පරිභව කරන්නාහු නම් ඔහුගේ යශස ද පිරිහෙන්නේ ය. යමකුගේ යශස පිරිහෙන්නේ නම්, ඔහුගේ භෝගයෝ ද පිරිහෙන්නාහ. අපේ භෝගයෝ යශස්හේතුයෙන් ලද්දෝ ය. (එ බැවිනි.) මහණ ගොයුමන් ස්‍වකීය ආචාර්‍යවාදය වූ ත්‍රිවිද්‍යාවිෂයයෙහි පැණ විචාරතොත් යෙහෙක. එසේ කලැ පැණ විසැඳීමෙන් ඒකාන්තයෙන් ම ඔබ සිත් ගත හැකි වන්නෙමි”යි මේ සිතිවිල්ල ම බෙහෙවින් සිතමිත් හුන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "13. එ කලැ වනාහි භාග්‍යචතුත් වහන්සේට සිය සිතින් සොණදණ්ඩ බමුණාගේ සිත දැක්මෙන් “මේ සොණදණ්ඩ බමුණා සිය සිතිවිල්ලෙන් වෙහෙසෙයි. මම මොහුගෙන් සිය ආචාර්‍යවාද වූ ත්‍රිවිද්‍යාවිෂයයෙහි ප්‍රශ්නයක් විචාරන්නෙම් නම් යෙහෙකැ”යි මෙ සිත වී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ සොණදණ්ඩ බමුණා අමතා, “බමුණ, අංග කීයෙකින් සමන්විතයහු බමුණකු කොට බමුණෝ පණවත් ද? (අංග කීයෙකින් සමන්විතයා) ‘මම බමුණෙකිමි’යි කියන්නේ ද? බොරු කීමකට නො පැමිණෙන්නේ දැ?”යි මෙය අසා වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "14. එ විටැ සොණදණ්ඩ බමුණාට “මහණ ගොයුමන් මගෙන් සිය ආචාර්‍යවාදය වූ ත්‍රිවිද්‍යාවිෂයයෙහි පැණ විචාළොත් යෙහෙක, පැණ විසැඳීමෙන් එකාන්තයෙන් ඔවුන් සිත ගත හෙන්නෙමි’යි යමක් අප විසින් රුස්නා ලද ද, යමක් ඇවෙක්සිණි ද, යමක් අදහස් කරණලද ද, යමක් වෙසෙසින් පැනිණි ද, එහි ලා ඔබ මගෙන් සිය ඇදුරන් ඉගැන්වූ ත්‍රිවිද්‍යාවිෂයයෙහි ප්‍රශ්න විචාරති. ඒකාන්තයෙත් මම පැණ විසැදීමෙන් ඔබ සිත සතුටු කරන්නෙමි”යි මෙ සිත වී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "15. ඉක්බිති සොණදණ්ඩ බමුණු තෙමෙ කය සෘජු කොට, හාත්පස බමුණු ගැහැවි පිරිස දෙස බලා, භාග්‍යවතුන් වහන්සේට මෙය කී ය: “භවත් ගෞතමයිනි, බමුණෝ අංග පසෙකිත් යුත්තහු බමුණකු කොට පණවත්. හේ ‘මම බමුණුමි’යි කියනුයේ (එය) මැනැවින් ම කියන්නේ ය. බොරු කීමකට නො පැමිණෙන්නේ ය. කවර අංග පසෙකින් ද? යත්:",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "“භවද්ගෞතමයිනි, මෙහි බමුණු තෙමේ මවු පසින් ද පිය පසින් ද යන දෙපසින් මැ අභිජාත ය, සත්වන මීමුතු යුවල තෙක් පිරිසිදු මවු කුස ඇතියේ ය, ජාතිවාදයෙන් නො හෙළන ලද්දේ ය, නො ගරහන ලද්දේ ය. වේද හදාරන්නෙක් වෙයි, වේදයන් සිතැ ලා දරන්නෙක් වෙයි, නිඝණ්ඩු ද කෛටභශාස්ත්‍ර ද සහිත, ශික්‍ෂා හා නිරුක්ති සහිත, ඉතිහාසය පස්වනු කොටැති, ත්‍රිවෙදයන්ගේ පර තෙරට පැමිණියෙක් වෙයි. පදපාඨ දන්නෙක් වෙයි සියලු ව්‍යාකරණ විධි ද දන්නෙක් වෙයි. ලෝකායත ශාස්ත්‍රයෙහිත් මහාපුරුෂලක්‍ෂණ ශාස්ත්‍රයෙහිත් නිපුණයෙක් වෙයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 238,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අභිරූපො හොති දස්සනීයො පාසාදිකො පරමාය වණ්ණපොක්ඛරතාය සමන්නාගතො, බ්රහ්මවණ්ණී බ්රහ්මවච්චසී අක්ඛුද්දාවකාසො දස්සනාය. සීලවා හොති වුද්ධසීලී වුද්ධසීලෙන සමන්නාගතො, පණ්ඩිතො ච හොති මෙධාවී, පඨමො වා දුතියො වා සුජං පග්ගණ්හන්තානං. ඉමෙහි ඛො භො ගොතම පඤ්චහි අඞ්ගෙහි සමන්නාගතං බ්රාහ්මණා බ්රාහ්මණං පඤ්ඤාපෙන්ති. බ්රාහ්මණො’ස්මීති ච වදමානො සම්මා වදෙය්ය න ච පන මුසාවාදං ආපජ්ජෙය්යාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "16. “ඉමෙසං පන බ්රාහ්මණ පඤ්චන්නං අඞ්ගානං සක්කා එකං අඞ්ගං ඨපෙත්වා චතූහි අඞ්ගෙහි සමන්නාගතං බ්රාහ්මණං පඤ්ඤාපෙතුං බ්රාහ්මණො’ස්මීති ච වදමානො සම්මා වදෙය්ය න ච පන මුසාවාදං ආපජ්ජෙය්යා?”ති"
                    },
                    {
                        "type": "paragraph",
                        "text": "17. “සක්කා භො ගොතම. ඉමෙසං හි භො ගොතම පඤ්චන්නං අඞ්ගානං වණ්ණං ඨපයාම. කිං හි වණ්ණො කරිස්සති? යතො ඛො භො ගොතම බ්රාහ්මණො උභතො සුජාතො හොති මාතිතො ච පිතිතො ච, සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා, අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන. අජ්ඣායකො ච හොති මන්තධරො, තිණ්ණං වෙදානං පාරගූ සනිඝණ්ඩුකෙටුභානං සාක්ඛරප්පභෙදානං ඉතිහාසපඤ්චමානං, පදකො, වෙය්යාකරණො, ලොකායතමහාපුරිසලක්ඛණෙසු අනවයො. සීලවා ච හොති වුද්ධසීලී වුද්ධසීලෙන සමන්නාගතො, පණ්ඩිතො ච හොති මෙධාවී පඨමො වා දුතියො වා සුජං පග්ගණ්හන්තානං. ඉමෙහි ඛො භො ගොතම චතූහඞ්ගෙහි සමන්නාගතං බ්රාහ්මණා බ්රාහ්මණං පඤ්ඤාපෙන්ති බ්රාහ්මණො’ස්මීති ච වදමානො සම්මා වදෙය්ය, න ච පන මුසාවාදං ආපජ්ජෙය්යා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "18. “ඉමෙසං පන බ්රාහ්මණ චතුන්නං අඞ්ගානං සක්කා එකං අඞ්ගං ඨපයිත්වා තීහි අඞ්ගෙහි සමන්නාගතං බ්රාහ්මණං පඤ්ඤාපෙතුං බ්රාහ්මණො’ස්මීති ච වදමානො සම්මා වදෙය්ය න ච පන මුසාවාදං ආපජ්ජෙය්යා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "19. “සක්කා භො ගොතම. ඉමෙසං හි භො ගොතම චතුන්නං අඞ්ගානං මන්තෙ ඨපයාම. කිං හි මන්තා කරිස්සන්ති? යතො ඛො භො ගොතම බ්රාහ්මණො උභතො සුජාතො හොති මාතිතො ච පිතිතො ච, සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා, අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන, සීලවා ච හොති වුද්ධසීලී වුද්ධසීලෙන සමන්නාගතො, පණ්ඩිතො ච හොති මෙධාවී, පඨමො වා දුතියො වා සුජං පග්ගණ්හන්තානං. ඉමෙහි ඛො භො ගොතම චතූහඞ්ගෙහි සමන්නාගතං බ්රාහ්මණා බ්රාහ්මණං පඤ්ඤාපෙන්ති බ්රාහ්මණො’ස්මීති ච වදමානො සම්මා වදෙය්ය න ච පන මුසාවාදං ආපජ්ජෙය්යා”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "විශිෂ්ට රූපශෝභා ඇත්තේ, දැකුම් කටයුත්තේ, ප්‍රසාද එළවත සුලු වූයේ, උතුම් වර්‍ණසෞන්‍දර්‍යයෙන් සමන්විත වූයේ වෙයි. උතුම් රන්වන් පැහැ ඈතියේ ය. උතුම් ශරීරප්‍රභා ඇතියේ ය. ආරෝහ පරිණාහ සම්පත්තියෙන් හා අවයවයන්ගේ පරිපුර්‍ණත්‍වයෙන් හා සිරුරෙහි දැකීමට නොමඳ වූ අවකාශ ඇතියේ වෙයි. වැඩුණු සිල් ඇත්තේ, වැඩුණු ශීලයෙන් සමන්විත වූයේ, සිල්වත් වෙයි. පණ්ඩිත ද නුවණැත්තේ ද එහෙයින් ම යාග සැන්ද ඔසොවන්නවුන් අතුරෙහි පළමු වැන්නා හෝ දෙවැන්නා වෙයි. භවද්ගෞතමයිනි, මෙ අංග පසින් සමන්විතයා බමුණකු කොට බමුණෝ පණවත්. හේ ‘මම බමුණෙකිමි’ යි කියන්නේ මොනොවට කියන්නේ ය, බොරු කීමට නොවැටෙන්නේ ය යනු යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "16. [භාග්‍යවතුත් වහන්සේ:] “බමුණ, මෙ අංග පස අතුරෙත් එක් අංගයක් හැර අංග සතරෙකින් සමන්විතයක්හු බමුණකු කොට පණවන්නට හැක්කේ ද? (එසේ පැනැවීමෙන්) ‘මම බමුණෙකිමි’යිත් කියන්නේ නො වැරැදිලෙස කිය හැකි වන්නේ ද? බොරු, කීමකට නො පැමිණෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "17. [සොණදණ්ඩ:] “හැකි ය, භවද් ගෞතමයිනි. භවද්ගෞතමයිනි, මේ අංග පස අතුරෙන් වර්‍ණසෞන්දර්‍ය්‍ය හැරැ ලමු. වර්‍ණය කුමක් කරන්නේ ද? භවද් ගෞතමයිනි, යම් හෙයෙකින් බමුණු තෙමේ මවුපියදෙපසින් අභිජාත වේ නම්, සත්වන මීමුතු යුවල තෙක් පිරිසිදු මවුකුස ඇතියේ නම් ජාතිවාදයෙන් නො හෙළන ලද්දේ නම්, නො ගරහනලද්දේ නම්, වේද හදාරන්නෙක්, වේද සිතැ ලා දරන්නෙක්, නිඝණ්ඩු කෛටභශාස්ත්‍ර ද සහිත, ශික්‍ෂා හා නිරුක්ති සහිත, ඉතිහාසය පස්වනු කොටැති, තුන් වේදයන්ගේ පරතෙර පැමිණියෙක් වේ නම්, පදපාඨ ද සියලු ව්‍යාකරණ විධි ද දන්නෙක්, ලොකායන ශාස්ත්‍රයෙහිත් මහාපුරුෂලක්‍ෂණවිද්‍යායෙහිත් නිපුණයෙක් වේ නම්, වැඩුණු සිල් ඇත්තේ, වැඩුණු ශීලයෙන් යුක්ත වූයේ සිල්වත් වේ නම්, පණ්ඩිතත් නුවණැත්තේත්, එ හෙයින් ම යාග සැන්ද ඔසොවන්නන් අතුරෙහි පළමු හෝ දෙවෙනිත් වේ නම්, භවද් ගෞතමයිනි, මෙ කී අංග සතරින් සමන්විතයා බමුණකු කොට බමුණෝ පණවත්. හේ ‘බමුණෙකිමි’ යි කියන්නේ ද මොනොවට ම කියන්නේ ය, බොරු කීමකට නො වැටෙන්නේ ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "18. [භාග්‍යවතුත් වහන්සේ:] ‘බමුණ, මේ අංග සතරින් එකක් හැර අංග තුනෙකින් යුක්තයක්හු බමුණකු කොට පණවන්නට හැක්කේ ද? හේ ‘මම බමුණෙකිමි’යිත් කියන්නේ නොවැරැදි ලෙස කියැ හැකි වන්නේ ද? බොරු කීමකට නො වැටෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "19. [සොණදණ්ඩ:] “භවද් ගෞතමයිනි, හැක්කේ ය. භවද් ගෞතමයිනි, මේ අංග සතරින් වේදයන් හැරැ දමමු. වේදයෝ කුමක් කරන්නෝ ද? භවද් ගෞතමයිනි, යම් හෙයෙකින් බමුණු තෙමේ මාපිය දෙපසින් අභිජාත වේ නම්, සත්වන මීමුතු යුවල තෙක් පිරිසිදු මවුකුස ඇතියේ නම්, ජාතිවාදයෙන් නො හෙළන ලදුයේ නොගරහන ලදුයේ නම්, වැඩුණු සිල් ඇති වැඩුණු සිලින් යුත් සිල්වතෙක් වේ නම්, පණ්ඩිතත් නුවණැතිත් එ හෙයින් ම යාග සැන්ද ඔසොවන්නන් අතුරෙහි පළමු හෝ දෙවෙනිත් වේ නම්, භවද් ගෞතමයිනි, මේ අංග තුනින් සමත්විතයා බමුණකු කොට බමුණෝ පණවත්. හේ ‘මම බමුණුමි’යි කියනුයේ ද කරුණු සහිත වැ ම කියන්නේ ය, බොරු කීමකට ද නො පැමිණෙන්නේ ය”.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 240,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "20. “ඉමෙසං පන බ්රාහ්මණ තිණ්ණං අඞ්ගානං සක්කා එකං අඞ්ගං ඨපෙත්වා ද්වීහඞ්ගෙහි සමන්නාගතං බ්රාහ්මණං පඤ්ඤාපෙතුං, බ්රාහ්මණොස්මීති ච වදමානො සම්මා වදෙය්ය න ච පන මුසාවාදං ආපජ්ජෙය්යා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "21. “සක්කා භො ගොතම. ඉමෙසං හි භො ගොතම තිණ්ණං අඞ්ගානං ජාතිං ඨපයාම. කිං හි ජාති කරිස්සති? යතො ඛො භො ගොතම බ්රාහ්මණො සීලවා ච හොති වුද්ධසීලී වුද්ධසීලෙන සමන්නාගතො, පණ්ඩිතො ච හොති මෙධාවී පඨමො වා දුතියො වා සුජං පග්ගණ්හන්තානං. ඉමෙහි ඛො භො ගොතම ද්වීහඞ්ගෙහි සමන්නාගතං බ්රාහ්මණා බ්රාහ්මණං පඤ්ඤාපෙන්ති. බ්රාහ්මණො’ස්මීති ච වදමානො සම්මා වදෙය්ය න ච පන මුසාවාදං ආපජ්ජෙය්යා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "22. එවං වුත්තෙ තෙ බ්රාහ්මණා සොණදණ්ඩං බ්රාහ්මණං එතදවොචුං: “මා භවං සොණදණ්ඩො එවං අවච. මා භවං සොණදණ්ඩො එවං අවච. අපවදතෙව භවං සොණදණ්ඩො වණ්ණං, අපවදති මන්තෙ, අපවදති ජාතිං. එකංසෙන භවං සොණදණ්ඩො සමණස්සෙව ගොතමස්ස වාදං අනුපක්ඛන්දතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "23. අථ ඛො භගවා තෙ බ්රාහ්මණෙ එතදවොච: “සචෙ ඛො තුම්හාකං බ්රාහ්මණා එවං හොති, ‘අප්පස්සුතො ච සොණදණ්ඩො බ්රාහ්මණො, අකල්යාණවාක්කරණො ච සොණදණ්ඩො බ්රාහ්මණො, දුප්පඤ්ඤො ච සොණදණ්ඩො බ්රාහ්මණො, න ච පහොති සොණදණ්ඩො බ්රාහ්මණො සමණෙන ගොතමෙන සද්ධිං අස්මිං වචනෙ පටිමන්තෙතුන්ති, තිට්ඨතු සොණදණ්ඩො බ්රාහ්මණො, තුම්හෙ මයා සද්ධිං මන්තව්හො. සචෙ පන තුම්හාකං බ්රාහ්මණා එවං හොති: “බහුස්සුතො ච සොණදණ්ඩො බ්රාහ්මණො, කල්යාණවාක්කරණො ච සොණදණ්ඩො බ්රාහ්මණො, පණ්ඩිතො ච සොණදණ්ඩො බ්රාහ්මණො, පහොති ච සොණදණ්ඩො බ්රාහ්මණො සමණෙන ගොතමෙන සද්ධිං අස්මිං වචනෙ පටිමන්තෙතුන්ති’ තිට්ඨථ තුම්හෙ, සොණදණ්ඩො බ්රාහ්මණො මයා සද්ධිං පටිමන්තෙතූ”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "24. එවං වුත්තෙ සොණදණ්ඩො බ්රාහ්මණො භගවන්තං එතදවොච: “තිට්ඨතු භවං ගොතමො. තුණ්හී භවං ගොතමො හොතු. අහමෙව තෙසං සහධම්මෙන පටිවචනං කරිස්සාමී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො සොණදණ්ඩො බ්රාහ්මණො තෙ බ්රාහ්මණෙ එතදවොච: “මා භවන්තො එවං අවචුත්ථ, මා භවන්තො එවං අවචුත්ථ: ‘අපවදතෙව භවං සොණදණ්ඩො වණ්ණං, අපවදති මන්තෙ, අපවදති ජාතිං, එකංසෙන. භවං සොණදණ්ඩො සමණස්සෙව ගොතමස්ස වාදං අනුපක්ඛන්දතී’ති. නාහං භො අපවදාමි වණ්ණං වා මන්තෙ වා ජාතිං වා”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "20. [භාග්‍යවතුන් වහන්සේ:] “බමුණ, මේ අංග තුනින් එක් අංගයක් හැරැ දමා අංග දෙකෙකින් සමත්විතයහු බමුණකු කොට පැණැවියැ හැක්කේ ද? හේ ‘මම බමුණෙකිමි’යිත් කියනුයේ, කරුණු සහිත වැ කියැ හැකි වන්නේ ද? බොරු කීමකට නො පැමිණෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "21. [සොණදණ්ඩ:] “භවද්ගෞතමයිනි, හැක්කේ ය. භවද්ගෞතමයිනි, මේ අංග තුනෙන් ජාතිය හැරැ දමමු. ජාතිය කුමක් කරන්නේ ද? භවද්‍ගෞතමයිනි, යම් හෙයකින් බමුණු තෙමේ වැඩුණු සිල් ඇත්තේ, වැඩුණු සිලින් යුත් වූයේ සිල්වත් වේ ද, පණ්ඩිතත් නුවණැත්තේත් එහෙයින් ම යාග සැන්ද ඔසොවන්නන් අතුරෙහි පළමු හෝ දෙවෙනිත් වේ ද, භවද්ගෞතමයිනි, මේ අංග දෙකින් සමන්විතයක්හු බමුණකු කොට බමුණෝ පණවත්. හේ ද ‘මම බමුණුමි’ යිත් කියනුයේ කරුණු සහිත වැ කියන්නේ ය, බොරු කීමකට නො පැමිණෙන්නේ ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "22. මෙසේ කී කල්හි ඒ බමුණෝ සොණදණ්ඩ බමුණුහට “භවත් සොණදණ්ඩ තෙමේ මෙසේ නො කියා වා. භවත් සොණදණ්ඩ තෙමේ මෙසේ නො කියා වා. භවත් සොණදණ්ඩ තෙමේ වර්‍ණසෞන්‍දර්‍ය්‍යය බැහැර කෙරේ ම ය, භවත් සොණදණ්ඩ වේදයන් බැහැර කෙරේ ම ය, ජාතිය බැහැරැ කෙරේ ම ය. භවත් සොණදණ්ඩ තෙමේ එකාත්තයෙන් ශ්‍රමණ ගෞතමයන්ගේ සමයයට වැදැ ගනී” යැ යි මේ වවන කීහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "23. එ විට භාග්‍යවතුත් වහන්සේ ඒ බමුණනට වදාරන සේක්: “බමුණනි, ඉදින් සොණදණ්ඩ බමුණා අල්පශ්‍රැත යැ යි ද නොමනා බස් දොඩන්නෙකැ යි ද නුවණ නැත්තෙකැ යි ද, මේ වචනයෙහි ශ්‍රමණ ගෞතමයන් හා සාකච්ඡා කරන්නට සමත් නො වෙතැයි’ ද කියා තොපට මෙසේ සිතෙක් වේ නම්, සොණදණ්ඩ බමුණු තෙමේ සිටි වා. තෙපි මා හා සාකච්ඡා කරවු. බමුණනි, ඉදින් සොණදණ්ඩ බමුණු තෙමේ බහුශ්‍රැත යැ යි ද, මනා වචන කියන්නෙකැ යි ද, පණ්ඩිත යැ යි ද, මේ වචනයෙහි ශ්‍රමණගෞතමයන් හා සාකච්ඡා කරන්නට සමත් වෙතැ යි ද කියා මෙසේ තොපට සිතෙක් වේ නම්, තෙපි සිටිවු. සොණදණ්ඩ බමුණු තෙමේ ම මා හා සාකච්ඡා කෙරේ වා” යි මෙය වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "24. මෙසේ වදාළ කල්හි, සොණදණ්ඩ බමුණු තෙම “භවද්ගෞතම තෙමේ සිටී වා, භවද්ගෞතම තෙමේ නිහඬ වේ වා. මම ම ඔවුනට කරුණු සහිත වැ උත්තර දෙන්නෙමි” ය භාග්‍යවතුන් වහන්සේට කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති සොණදණ්ඩ බමුණු ඒ බමුණන් බණවා “භවත්හු ‘භවත් සොණදණ්ඩයා වර්‍ණය බැහැර කෙරෙයි, වේදයන් බැහැර කෙරෙයි, ජාතිය බැහැර කෙරෙයි, එකාන්තයෙන් භවත් සොණදණ්ඩ තෙමේ ශ්‍රමණ ගෞතමයන්ගේ සමයයට වැද ගනී’ යැ යි මෙසේ නො කියත් වා. මම වර්‍ණය හෝ වේදයන් හෝ ජාතිය හෝ බැහැර නො කරමි” යි කී ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 242,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "25. තෙන ඛො පන සමයෙන සොණදණ්ඩස්ස බ්රාහ්මණස්ස භාගිනෙය්යා **අඞ්ගකො** නාම මාණවකො තස්සං පරිසායං නිසින්නො හොති. අථ ඛො සොණදණ්ඩො බ්රාහ්මණො තෙ බ්රාහ්මණෙ එතදවොච: “පස්සන්ති නො භොන්තො ඉමං අඞ්ගකං මාණවකං අම්හාකං භාගිනෙය්යන්ති?”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“එවං භො”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අඞ්ගකො ඛො භො මාණවකො අභිරූපො දස්සනීයො පාසාදිකො පරමාය වණ්ණපොක්ඛරතාය සමන්නාගතො බ්රහ්මවණ්ණී බ්රහ්මවච්චසී අක්ඛුද්දාවකාසො දස්සනාය. නාස්ස ඉමිස්සං පරිසායං සමසමො අත්ථි වණ්ණෙන, ඨපෙත්වා සමණං ගොතමං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අඞ්ගකො ඛො භො මාණවකො අජ්ඣායකො මන්තධරො, තිණ්ණං වෙදානං පාරගූ සනිඝණ්ඩුකෙටුභානං සාක්ඛරප්පභෙදානං ඉතිහාසපඤ්චමානං. පදකො වෙය්යාකරණො ලොකායතමහාපුරිසලක්ඛණෙසු අනවයො. අහමස්ස මන්තෙ වාචෙතා."
                    },
                    {
                        "type": "paragraph",
                        "text": "අඞ්ගකො ඛො භො මාණවකො උභතො සුජාතො මාතිතො ච පිතිතො ච, සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා, අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන. අහමස්ස මාතාපිතරො ජානාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අඞ්ගකො ඛො භො මාණවකො පාණම්පි හනෙය්ය අදින්නම්පි ආදියෙය්ය පරදාරම්පි ගච්ඡෙය්ය මුසාපි භණෙය්ය මජ්ජම්පි පිවෙය්ය, එත්ථදානි භො කිං වණ්ණො කරිස්සති, කිං මන්තා, කිං ජාති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "යතො ඛො භො බ්රාහ්මණො සීලවා ච හොති වුද්ධසීලී වුද්ධසීලෙන සමන්නාගතො, පණ්ඩිතො ච හොති මෙධාවී පඨමො වා දුතියො වා සුජං පග්ගණ්හන්තානං. ඉමෙහි ඛො භො ද්වීහඞ්ගෙහි සමන්නාගතං බ්රාහ්මණා බ්රාහ්මණං පඤ්ඤාපෙන්ති. බ්රාහ්මණො’ස්මීති ච වදමානො සම්මා වදෙය්ය, න ච පන මුසාවාදං ආපජ්ජෙය්යා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "26. “ඉමෙසං පන බ්රාහ්මණ, ද්වින්නං අඞ්ගානං සක්කා එකං අඞ්ගං ඨපයිත්වා එකෙන අඞ්ගෙන සමන්නාගතං බ්රාහ්මණං පඤ්ඤාපෙතුං, බ්රාහ්මණො’ස්මීති ච වදමානො සම්මා වදෙය්ය. න ච පන මුසාවාදං ආපජ්ජෙය්යා?”ති"
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හිදං භො ගොතම. සීලපරිධොතා හි භො ගොතම පඤ්ඤා. පඤ්ඤාපරිධොතං සීලං. යත්ථ සීලං තත්ථ පඤ්ඤා, යත්ථ පඤ්ඤා තත්ථ සීලං. සීලවතො පඤ්ඤා, පඤ්ඤවතො සීලං. සීලපඤ්ඤාණං ච පන ලොකස්මිං අග්ගමක්ඛායති. සෙය්යථාපි භො ගොතම හත්ථෙන වා හත්ථං ධොවෙය්ය, පාදෙන වා පාදං ධොවෙය්ය, එවමෙව ඛො භො ගොතම සීලපරිධොතා පඤ්ඤා, පඤ්ඤාපරිධොතං සීලං. යත්ථ සීලං තත්ථ පඤ්ඤා, යත්ථ පඤ්ඤා තත්ථ සීලං. සීලවතො පඤ්ඤා, පඤ්ඤවතො සීලං. සීලපඤ්ඤාණඤ්ච පන ලොකස්මිං අග්ගමක්ඛායති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "25. එ වේලෙහි සොණදණ්ඩ බමුණාගේ බෑනණු වූ අඞ්ගක නම් මාණවක තෙමේ ඒ පිරිසෙහි හුන්නේ වෙයි. ඉක්බිති සොණදණ්ඩ බමුණු “භවත්හු අප බෑනණු වූ මේ අඞ්ගක මාණවකයා දකිත් දැ?” යි කී ය.‍",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“භවත, එසේ යැ” යි බමුණෝ කීහ. ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(එ විට සොණදණ්ඩ බමුණු මෙසේ කී ය:)\n“භවත්නි, අඞ්ගක මාණවක තෙමේ විශිෂ්‍ට රූපය ඇත්තේ ය, දැකුම් කටයුතු ය, උතුම් වර්‍ණසෞන්‍දර්‍ය්‍යයෙන් යුක්ත ය, උතුම් රන් පැහැ ඇත්තේ ය, උතුම් සිරුරපැහැ ඇත්තේ ය, සිය සිරුර දැක්මට නොමඳ අවකාශ ඇත්තේ ය. ශ්‍රමණ ගෞතමයත් හැර මේ පිරිසෙහි හැම අයුරින් ම ඔහුට සම එකෙක් නැත.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, අඞ්ගක මාණවක තෙමේ වේද හදාරන්නෙක, වේදමන්ත්‍රයන් සිත්හි ලා දරන්නෙක, නිඝණ්ඩු ද කෛටභශාස්ත්‍ර ද සහිත අක්‍ෂරප්‍රභෙද සහිත ත්‍රිවෙදයෙහි පාරප්‍රාප්තයෙක. පදපාඨ දන්නෙක, සියලු ව්‍යාකරණ විධිත් දන්නෙක, ලෝකායතශාස්ත්‍රයෙහි ද මහාපුරුෂලක්‍ෂණවිද්‍යායෙහි ද නිපුණයෙක. මොහුට වේද කියැවූ තනැත්තේ මම ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, අඞ්ගක මාණවක තෙමේ මවු පිය යන දෙ පසින් ම අභිජාත ය, සත් වන මීමුතු යුවල තෙක් පිරිසිදු මවුකුස ඇත්තෙක, ජාතිවාදයෙන් නොහෙළන ලද්දෙක, නොගරහන ලද්දෙක. මම මොහුගේ මවු පියන් දනිමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, අඞ්ගක මාණවකයා වනාහි ප්‍රාණඝාත ද කරන්නේ නම්, නොදුන් දෑත් ගන්නේ නම්, පරඹුවන් කරා යන්නේ නම්, බොරුත් කියන්නේ නම්, මත්පැනුත් බොන්නේ නම්, භවත්නි, මෙහි වර්‍ණසෞන්‍දර්‍ය්‍යය කුමක් කරන්නේ ද (බමුණු බව රක්නට සමත් වන්නේ ද)? වේදයෝ කුමක් කරන්නෝ ද? ජාතිය කුමක් කරන්නේ ද?",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, යම් හෙයෙකින් බමුණු තෙමේ වැඩුණු සිල් ඇත්තේ, වැඩුණු සිලින් යුත් වූයේ, සිල්වත් වේ ද, පණ්ඩිත වේ ද, නුවණැති වේ ද, යාග සැන්ද ඔසොවන්නන් අතුරෙහි පළමු හෝ දෙවෙනි වේ ද, භවත්නි, මේ අඞ්ග දෙකින් සමන්විතයා වූ කලී බමුණකු කොට බමුණෝ පණවත්. හේ ‘මම බමුණුමි’යි කියන්නේ ද කරුණු සහිත වැ කියන්නේ ය, බොරු කීමකට නො පැමිණෙන්නේ ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "26. [භාග්‍යවතුන් වහන්සේ:] බ්‍රාහ්මණය, මේ අඞ්ග දෙකින් එක් අඞ්ගයක් හැරැ දමා එක් අඞ්ගයෙකින් සමන්විතයා බමුණකු කොට පණවන්නට හැක්කේ ද? හේ ‘බමුණෙකිමි’යි කියන්නේ, කරුණු සහිත වැ කියන්නේ ද? බොරු කීමකට නො පැමිණෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[සොණදණ්ඩ:] භවද්ගෞතමයිනි, මෙය නො වේ ම ය. භවද්ගෞතමයිනි, ප්‍රඥාව ශීලයෙන් පිරිසිදු වෙයි. ශීලය ප්‍රඥායෙන් පිරිසිදු වෙයි. යම් තැනෙක ශීලය වේ නම්, එහි ප්‍රඥාව වේ. යම් තැනෙක ප්‍රඥාව වේ නම් එහි ශීලය වේ. සිල්වත්හට නුවණ වේ. නුවණැත්තාට සිල් ඇති වේ. ශීල ප්‍රඥා දෙක වූ කලි ලොවැ අග්‍ර යැ යි කියනු ලැබේ. භවද් ගෞතමයිනි, යම් සේ අතින් අත හෝ පයින් පය හෝ සෝදන්නේ ද, එසේ ම ප්‍රඥාව ශීලයෙන් පරිශොධිත වේ. ශීලය ප්‍රඥායෙන් පරිධොත වේ. යම් තැනෙක ශීලය වේ නම්, .... ශීල ප්‍රඥා දෙක වූ කලි ලොවැ අග්‍ර යැ යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 244,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“එවමෙතං බ්රාහ්මණ. සීලපරිධොතා හි බ්රාහ්මණ පඤ්ඤා, පඤ්ඤාපරිධොතං සීලං. යත්ථ සීලං තත්ථ පඤ්ඤා, යත්ථ පඤ්ඤා තත්ථ සීලං. සීලවතො පඤ්ඤා, පඤ්ඤවතො සීලං. සීලපඤ්ඤාණඤ්ච පන ලොකස්මිං අග්ගමක්ඛායති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“කතමං පන තං බ්රාහ්මණ සීලං? කතමා සා පඤ්ඤා”? ති"
                    },
                    {
                        "type": "paragraph",
                        "text": "“එත්තකපරමා’ව මයං භො ගොතම එතස්මිං අත්ථෙ. සාධු වත භවන්තංයෙව ගොතමං පටිභාතු එතස්ස භාසිතස්ස අත්ථො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තෙන හි බ්රාහ්මණ සුණාහි, සාධුකං මනසිකරොහි, භාසිස්සාමී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“එවං භො’ති ඛො සොණදණ්ඩො බ්රාහ්මණො භගවතො පච්චස්සොසි. භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "25. “ඉධ බ්රාහ්මණ තථාගතො ලොකෙ උප්පජ්ජති අරහං සම්මාසම්බුද්ධො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "(යථා සාමඤ්ඤඵලෙ එවං විත්ථාරෙතබ්බං.) එවං ඛො බ්රාහ්මණ භික්ඛු සීලසම්පන්නො හොති. ඉදං ඛො තං බ්රාහ්මණ සීලං -පෙ-. පඨමං ඣානං උපසම්පජ්ජ විහරති ..... දුතියං ඣානං උපසම්පජ්ජ විහරති. -පෙ- තතියං ඣානං උපසම්පජ්ජ විහරති. -පෙ- චතුත්ථං ඣානං උපසම්පජ්ජ විහරති. -පෙ- අයං ඛො සො බ්රාහ්මණ සමාධි -පෙ- ආසවානං ඛයඥාණාය චිත්තං අභිනීහරති, අභිනින්නාමෙති -පෙ- නාපරං ඉත්ථත්තායාති පජානාති, ඉදම්පි’ස්ස හොති පඤ්ඤාය. අයං ඛො සා බ්රාහ්මණ, පඤ්ඤා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "26. එවං වුත්තෙ සොණදණ්ඩො බ්රාහ්මණො භගවන්තං එතදවොච: “අභික්කන්තං භො ගොතම, අභික්කන්තං භො ගොතම. සෙය්යථාපි භො ගොතම නික්කුජ්ජිතං වා උක්කුජ්ජෙය්ය පටිච්ඡන්නං වා විවරෙය්ය මූළ්හස්ස වා මග්ගං ආචික්ඛෙය්ය අන්ධකාරෙ වා තෙලපජ්ජොතං ධාරෙය්ය චක්ඛුමන්තො රූපානි දක්ඛින්තීති, එවමෙව භොතා ගොතමෙන අනෙකපරියායෙන ධම්මො පකාසිතො. එසාහං භවන්තං ගොතමං සරණං ගච්ඡාමි ධම්මඤ්ච භික්ඛුසඞ්ඝඤ්ච. උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතං. අධිවාසෙතු ච මෙ භවං ගොතමො ස්වාතනාය භත්තං සද්ධිං භික්ඛුසඞ්ඝෙනා”ති. අධිවාසෙසි භගවා තුණ්හීභාවෙන."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "[භාග්‍යවතුන් වහන්සේ:] බ්‍රාහ්මණය, මෙය එසේ ය. බ්‍රාහ්මණය, ප්‍රඥාව ශීලයෙන් පිරිසිදු වේ. ශීලය ප්‍රඥායෙන් පිරිසිදු වේ. සිල් ඇති තැන ප්‍රඥාව වේ. ප්‍රඥාව ඇති තැන සිල් වේ. සිල්ඇත්තහුට ප්‍රඥාව ඇත. ප්‍රඥාව ඇත්තහුට සිල් ඇත. ශීල ප්‍රඥා දෙක වනාහි ලොවැ අග්‍ර යැ යි කියනු ලැබේ. ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "බ්‍රාහ්මණය, ඒ ශීලය කවර යැ? ඒ ප්‍රඥාව කවර යැ?"
                    },
                    {
                        "format": 13,
                        "text": "[සොණදණ්ඩ:] භවද් ගෞතමයිනි, මේ කරුණෙහි මේ ශීල ප්‍රඥා යන වචන දෙක දැනීම ම පරම කොටැත්තමු. (මේ වචන දනු විනා එහි අර්‍ථාදි වශයෙන් මෙයින් වැඩියක් නො දනිමු.) යාච්ඤා කරම්හ. භවද් ගෞතමයනට ම මේ වචනයේ අර්ථ වැටහේ වා (භවද් ගෞතමයෝ ම මෙහි අර්‍ථ වදාරත් වා).",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[භාග්‍යවතුන් වහන්සේ:] “බමුණ, එසේ නම් අසන්නැ. මොනොවට මෙනෙහි කරන්නැ. එය කියන්නෙමි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "සොණදණ්ඩ තෙමේ ‘භවත, එසේ යැ’යි භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්නේ ය. භාග්‍යවතුන් වහන්සේ මතු දැක්වෙන ධර්‍මය වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "25. “බමුණ, අර්හත් වූ සම්‍යක්සම්බුද්ධ වූ ... තථාගත තෙමේ මෙ ලොවැ පහළ වෙයි ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(සාමඤ්ඤඵලසුත්තයෙහි ආ සේ විස්තර කළ යුතු.) … බමුණ, මෙසේ මහණ තෙමේ ශීලසම්පන්න වෙයි. බමුණ, මේ ඒ ශීලය යි. ... පළමු ධ්‍යානය ලැබ වෙසෙයි … දෙවෙනි ධ්‍යානය ලැබ වෙසෙයි ... තෙවෙනි ධ්‍යානය ලැබ වෙසෙයි … සිවු වන ධ්‍යානය ලැබ වෙසෙයි ... බමුණ, මේ ඒ සමාධියයි. ආශ්‍රවක්‍ෂයඥානය පිණිස සිත යොමු කෙරෙයි, නැඹුරු කෙරෙයි. ‘මේ ක්ලෙශක්‍ෂයය පිණස කළ යුතු අන් කිසිත් නැතැ’යි දැනැ ගනී. මේ ඔහුගේ ප්‍රඥාව වේ. බමුණ, මේ ඒ ප්‍රඥාව ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "26. මෙසේ වදාළ කල්හි සොණදණ්ඩ බ්‍රාහ්මණ තෙම, “භවද් ගෞතමයිනි, ධර්‍මදේශනා අභිකාන්ත ය. භවද් ගෞතමයිනි, ධර්‍මදේශනාව අභිකාන්ත ය. භවද් ගෞතමයිනි, යම්සේ යැටිකුරු කොට තැබූ බඳුනක් උඩුකුරු කරන්නේ හෝ වේ ද, වැසුණු දැයක් විවෘත කරන්නේ හෝ වේ ද, මංමුළා වූවකුට මඟ හෝ කියන්නේ වේ ද, ‘ඇස් ඇතියන් රූප දකිතැ’ යි අඳුරෙහි තෙල්පහනක් දල්වන්නේ හෝ වේ ද, භවද්ගෞතමයිනි. එ පරිද්දෙන් ම, භවද්ගෞතමයන් විසින් මට නොයෙක් අයුරින් ධර්‍මය පැවැසිණ. භවද්ගෞතමයිනි, ඒ මම භවද් ගෞතමයන් වහන්සේ ද ධර්‍මය ද භික්‍ෂුසංඝයා ද සරණ යෙමි. භවද් ගෞතමයන් වහන්සේ අද පටන් මා දිවි හිම් කොට සරණ ගිය උපාසකයකු කොට සලකන සේක් වා. භවද්ගෞතමයන් වහන්සේ භික්‍ෂුසංඝයා හා සෙට දවසට මගේ බත ඉවසන සේක්වා” යි කීයේ ය. භාග්‍යවතුන්වහන්සේ නිහඬ බැවින් එය ඉවැසූ සේක.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 246,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "27. අථ ඛො සොණදණ්ඩො බ්රාහ්මණො භගවතො අධිවාසනං විදිත්වා උට්ඨායාසනා භගවන්තං අභිවාදෙත්වා පදක්ඛිණං කත්වා පක්කාමි. අථ ඛො සොණදණ්ඩො බ්රාහ්මණො තස්සා රත්තියා අච්චයෙන සකෙ නිවෙසනෙ පණීතං ඛාදනීයං භොජනීයං පටියාදාපෙත්වා භගවතො කාලං ආරොචාපෙසි: කාලො භො ගොතම, නිට්ඨිතං භත්තන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "28. අථ ඛො භගවා පුබ්බන්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය සද්ධිං භික්ඛුසඞ්ඝෙන යෙන සොණදණ්ඩස්ස බ්රාහ්මණස්ස නිවෙසනං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදි. අථ ඛො සොණදණ්ඩො බ්රාහ්මණො බුද්ධපමුඛං භික්ඛුසඞ්ඝං පණීතෙන ඛාදනීයෙන භොජනීයෙන සහත්ථා සන්තප්පෙසි සම්පවාරෙසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "29. අථ ඛො සොණදණ්ඩො බ්රාහ්මණො භගවන්තං භුත්තාවිං ඔනීතපත්තපාණිං අඤ්ඤතරං නීචං ආසනං ගහෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො සොණදණ්ඩො බ්රාහ්මණො භගවන්තං එතදවොච: "
                    },
                    {
                        "type": "paragraph",
                        "text": "“අහඤ්චෙව ඛො පන භො ගොතම පරිසගතො සමානො ආසනා වුට්ඨහිත්වා භවන්තං ගොතමං අභිවාදෙය්යං, තෙන මං සා පරිසා පරිභවෙය්ය. යං ඛො පන සා පරිසා පරිභවෙය්ය යසො’පි තස්ස හායෙථ. යස්ස ඛො පන යසො හායෙථ භොගාපි තස්ස හායෙය්යුං. යසොලද්ධා ඛො පනම්හාකං භොගා."
                    },
                    {
                        "type": "paragraph",
                        "text": "අහඤ්චෙව ඛො පන භො ගොතම, පරිසගතො සමානො අඤ්ජලිං පග්ගණ්හෙය්යං, ආසනා මෙ තං භවං ගොතමො පච්චුට්ඨානං ධාරෙතු."
                    },
                    {
                        "type": "paragraph",
                        "text": "අහඤ්චෙව ඛො පන භො ගොතම පරිසගතො සමානො වෙඨනං ඔමුඤ්චෙය්යං, සිරසා මෙ තං භවං ගොතමො අභිවාදනං ධාරෙතු."
                    },
                    {
                        "type": "paragraph",
                        "text": "අහඤ්චෙව ඛො පන භො ගොතම යානගතො සමානො යානා පච්චොරොහිත්වා භවන්තං ගොතමං අභිවාදෙය්යං, තෙන මං සා පරිසා පරිභවෙය්ය. යං ඛො පන සා පරිසා පරිභවෙය්ය යසො’පි තස්ස හායෙථ. යස්ස ඛො පන යසො හායෙථ භොගාපි තස්ස හායෙය්යුං. යසොලද්ධා ඛො පනම්හාකං භොගා."
                    },
                    {
                        "type": "paragraph",
                        "text": "අහඤ්චෙව ඛො පන භො ගොතම යානගතො සමානො පතොදලට්ඨිං අබ්භුන්නාමෙය්යං, යානා මෙ තං භවං ගොතමො පච්චොරොහනං ධාරෙතු."
                    },
                    {
                        "type": "paragraph",
                        "text": "අහඤ්චෙව ඛො පන භො ගොතම යානගතො සමානො ඡත්තං අපනාමෙය්යං, සිරසා මෙ තං භවං ගොතමො අභිවාදනං ධාරෙතූ”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා සොණදණ්ඩං බ්රාහ්මණං ධම්මියා කථාය සන්දස්සෙත්වා සමාදපෙත්වා සමුත්තෙජෙත්වා සම්පහංසෙත්වා උට්ඨායාසනා පක්කාමීති."
                    },
                    {
                        "type": "centered",
                        "text": "සොණදණ්ඩසුත්තං නිට්ඨිතං චතුත්ථං.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "27. ඉක්බිත්තෙන් සොණදණ්ඩ බමුණු තෙමේ භාග්‍යවතුත් වහන්සේගේ ඉවැසීම් දැන, හුනස්නෙන් නැගී සිට, භාග්‍යවතුන් වහන්සේ ආදරයෙන් වැඳ පැදකුණු කොට නික්මැ ගියේ ය. ඉන් පසු සොණදණ්ඩ බමුණු තෙම ඒ රැය ඇවෑමෙන් සිය ගෙහි ප්‍රණීත ඛාද්‍ය භොජ්‍ය පිළියෙල කරවා ‘ භවද්ගෞතමයන් වහන්ස, බත පිළියෙල කොට නිමියේ ය. දැන් වඩින්නට කාලය වේ යැ’ යි භාග්‍යවතුන් වහන්සේට කල් දන්වා යැවී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "28. ඉක්බිත්තෙන් භාග්‍යවතුන් වහන්සේ පෙරවරු හැඳ පෙරෙවැ පාසිවුරු ගෙන බික්සඟන හා සොණදණ්ඩ බමුණාගේ ගෙට එළැඹි සේක. එළැඹ පණවා තුබුණු අස්නෙහි වැඩ හුන් සේක. එ කල්හි සොණදණ්ඩ බමුණු තෙමේ බුදුපාමොක් සඟන ප්‍රණීත ඛාද්‍යභොජ්‍යයෙන් සියතින් සැතැප්වී ය, පැවැරැවී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "29. එයට පසු සොණදණ්ඩ බමුණු තෙම වළඳා අවසන් කළ, පාත්‍රයෙන් ඉවතට ගත් අතැති භාග්‍යවතුත් වහන්සේට එක් පසෙක එක්තරා මිටි අස්නක් ගෙන හිඳ ගත්තේ ය. එකත්පසෙක හුන් සොණදණ්ඩ තෙම භාග්‍යවතුන් වහන්සේට මේ බස් පැවැසී ය:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“භවද්ගෞතමයිනි, මම් වූ කලි පිරිස් මැදට පැමිණියෙම් ම අස්නෙන් නැගී සිට භවත් ගෞතමයන් වැන්දෙම් වීම් නම්, එයින් ඒ පිරිස මට බැණ වදිති. යමකුට ඒ පිරිස බැණ වදිත් නම් ඔහුගේ යශස් ද පිරිහෙන්නේ ය. යමක්හුගේ යශස් පිරිහෙන්නේ ද, ඔහුගේ භෝග සම්පත් ද පිරිහෙන්නේ ය. අපේ භෝගසම්පත් වූ කලි යශසින් ලබන ලද්දේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද භවද්ගෞතමයිනි, මම් පිරිසට පැමිණියෙම් ම දොහොත් මුදුන් තැබුයෙම් වීම් නම්, එය මා හුනස්නෙන් නැගී සිටිම් කොට භවද්ගෞතමයන් වහන්සේ සලකන සේක් වා.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද භවද්ගෞතමයෙනි, මම් පිරිස් මැදට ගියෙම් ම හිස්වෙළුම මුදා හෙළූයෙම් වීම් නම්, භවද්ගෞතමයන් වහන්සේ එය මා හිස නමා කළ වැඳීමක් කොට සලකන සේක් වා.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද භවද්ගෞතමයිනි, මම් යානයක් නැඟ උන්නෙම් ම එයින් බැස, භවද්ගෞතමයන් වහන්සේ වැන්දෙම් නම්, එයින් ඒ පිරිස මට පරිභව කරති. එසේ පරිභව ලද්දහුගේ යශස් ද පිරිහේ. යශසින් පිරිහුණහුගේ භෝග ද පිරිහෙන්නේ ය. අපේ භෝගයෝ යශසින් ලබන ලද්දෝ ය. (එ බැවිනි)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවද්ගෞතමයින්, මම් වනාහි යානයක් නැඟ උන්නෙම් ම කෙවිට ඉදිරියට නමා ලීම් නම්, එය මා යානයෙන් බැසීම කොට භවද්ගෞතමයන් වහන්සේ සලකන සේක් වා.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද මම් යානයෙක උන්නෙම් ම ඡත්‍රය ඉවතට නමා හෙළීම් නම්, එය මා හිස නමා කළ වැඳීමක් කොට භවද්ගෞතමයන් වහන්සේ සලකන සේක් වා.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉන් පසු භාග්‍යවතුන් වහන්සේ සොණදණ්ඩ බමුණාට දැහැමි කතායෙන් දෙලෝ වැඩ දක්වා, කුසල් දහම් ගන්වා, කුසල් වැඩුමෙහි උත්සාහවත් කොට, ඔහු තූළැ වූ ගුණ දක්වා සතුටු කොට, හුනස්නෙන් නැඟී නික්මැ වැඩි සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 16,
                        "text": "සිවුවන සොණදණ්ඩ සූත්‍රය නිමියේ ය.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ],
    "bookId": "10",
    "pageOffset": 0
}