{
    "filename": "dn-1-5",
    "pages": [
        {
            "pageNum": 248,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "කූටදන්තසුත්තං",
                        "level": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "1. එවං මෙ සුතං. එකං සමයං භගවා මගධෙසු චාරිකං චරමානො මහතා භික්ඛුසඞ්ඝෙන සද්ධිං පඤ්චමත්තෙහි භික්ඛුසතෙහි, යෙන **ඛාණුමතං** නාම මගධානං බ්රාහ්මණගාමො තදවසරි. තත්ර සුදං භගවා ඛාණුමතෙ විහරති අම්බලට්ඨිකායං."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන **කූටදන්තො** බ්රාහ්මණො ඛාණුමතං අජ්ඣාවසති සත්තුස්සදං සතිණකට්ඨොදකං සධඤ්ඤං රාජභොග්ගං රඤ්ඤා මාගධෙන සෙනියෙන **බිම්බිසාරෙන** දින්නං රාජදායං බ්රහ්මදෙය්යං."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන කූටදන්තස්ස බ්රාහ්මණස්ස මහායඤ්ඤො උපක්ඛටො හොති. සත්ත ච උසභසතානි සත්ත ච වච්ඡතරසතානි සත්ත ච වච්ඡතරීසතානි සත්ත ච අජසතානි සත්ත ච උරබ්භසතානි ථූනූපනීතානි හොන්ති යඤ්ඤත්ථාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. අස්සොසුං ඛො ඛාණුමතකා බ්රාහ්මණගහපතිකා: “සමණො ඛලු භො ගොතමො සක්යපුත්තො සක්යකුලා පබ්බජිතො මගධෙසු චාරිකං චරමානො මහතා භික්ඛුසඞ්ඝෙන සද්ධිං පඤ්චමත්තෙහි භික්ඛුසතෙහි ඛාණුමතං අනුප්පත්තො ඛාණුමතෙ විහරති අම්බලට්ඨිකායං."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘තං ඛො පන භවන්තං ගොතමං එවං කල්යාණො කිත්තිසද්දො අබ්භුග්ගතො’: ඉතිපි සො භගවා අරහං සම්මාසම්බුද්ධො විජ්ජාචරණසම්පන්නො සුගතො ලොකවිදූ අනුත්තරො පුරිසදම්මසාරථි සත්ථා දෙවමනුස්සානං බුද්ධො භගවා’ති. සො ඉමං ලොකං සදෙවකං සමාරකං සබ්රහ්මකං සස්සමණබ්රාහ්මණිං පජං සදෙවමනුස්සං සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදෙති. සො ධම්මං දෙසෙති ආදිකල්යාණං මජ්ඣෙකල්යාණං පරියොසානකල්යාණං සාත්ථං සබ්යඤ්ජනං කෙවලපරිපුණ්ණං පරිසුද්ධං බ්රහ්මචරියං පකාසෙති. සාධු ඛො පන තථාරූපානං අරහතං දස්සනං හොතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ඛාණුමතකා බ්රාහ්මණගහපතිකා ඛාණුමතා නික්ඛමිත්වා සඞ්ඝසඞ්ඝී ගණීභූතා යෙන අම්බලට්ඨිකා තෙනුපසඞ්කමන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "කූටදන්ත සූත්‍රය",
                        "level": 3
                    },
                    {
                        "format": 13,
                        "text": "1. මා විසින් මෙසේ අසන ලදි. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ පන්සියක් භික්‍ෂූන් පමණ වූ මහත් පැවිදිමුළුවක් හා මගධ රටැ, සැරි සරන සේක්, මගධ රටැ **ඛාණුමත** නම් බමුණු ගමට වැඩි සේක. භාග්‍යවතුන් වහන්සේ ඒ ඛාණුමත ගමැ අඹයැටිඋයන්හි වැඩ වසන සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එ සමයෙහි වනාහි **කුළුදත්** (කූටදන්ත) බඹුණු තෙමේ මගධාධිපති සේනිය **බිම්බිසාර** රජුහු විසින් දුන් රාජදායාද්‍යය වූ, ශ්‍රේෂ්ඨ ත්‍යාගය වූ, බහු ජනාකීර්ණ වූ, තණ දඬු දිය සුලභ වූ, බොහෝ ධන ධාන්‍ය ඇති, රාජස්වරූපයෙන් පරිභෝග කටයුතු වූ ඛාණුමත ගමැ වෙසෙයි. ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එ සමයෙහි කුළුදත් බඹුණුහුගේ මහායාගයෙක් පිළියෙල කැරුණේ වෙයි. සත්සියක් ගොන් ද, සත්සියක් නාඹුවස්සෝ ද, සත්සියක් නාඹුවැස්සියෝ ද, සත්සියක් එළුවෝ ද, සත්සියක් තරුණ බැටෙළුවෝ ද (පොරගසන එළුවෝ ද තවත් සත්සියය බැගින් බොහෝ මෘගපක්ෂීහු ද) යාග පිණිස යාග ටැඹ වෙතට පමුණුවන ලදහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "2. ඛාණුමත ගමැ වැසි බමුණෝ ද ගැහැවියෝ ද රටෙහි පැතිරැ පැවැති භාග්‍යවතුන් වහන්සේ පිළිබඳ මතු දැක්වෙන යස ගී ඇසූහ: “භවත්නි, ශාක්‍යපුත්‍රවූ, ශාක්‍යකුලයෙන් නික්මැ පැවිදි වූ මහණ ගොයුම්හු භික්‍ෂූන් පන්සියක් පමණ වූ මහත් පැවිදිමුළුවක් හා මගධ රටැ සැරි සරනුවෝ ඛාණුමතයට පැමිණියෝ ඛාණුමතයට සමීපයෙහි වූ අඹයැටි වෙනෙහි වෙසෙති.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘ඒ භගවත් තෙමේ මේ මේ කරුණින් අර්හත් ය, සම්‍යක්සම්බුද්ධ ය, විද්‍යාචරණසම්පන්න ය, සුගත ය, ලෝකවිත් ය, නිරුත්තර පුරුෂදම්‍යසාරථි ය, දෙව්මිනිස්නට ශාස්තෘ ය, බුද්ධ ය, භගවත් ය. හේ දෙවියන් සහිත මරුන් සහිත බඹුන් සහිත මේ ලොව, අවශේෂ මහණබමුණන් සහිත දෙව්මිනිසුන් සහිත මේ සත්ත්‍වවර්‍ගයා තෙමේ ම සිය විශිෂ්ට නුවණින් දැන පසක් කොට ලොවට දන්වයි. ආදිකල්‍යාණ මධ්‍යකල්‍යාණ පර්යවසානකල්‍යාණ වූ, (සතිපට්ඨානාදී) මනා අරුත් ඇති, සම්පූර්‍ණ ව්‍යඤ්ජන ඇති, හැම අයුරින් පිරිපුන්, පිරිසිදු දහම් දෙසයි. එසේ දෙසනුයේ සියලු සසුන් බඹසර පවසයි. එබඳු රහතුන් දැක්ම වූ කලි හිත වැඩ සලසන්නෙකැ’ යි ඒ භවද්ගෞතමයන් පිළිබඳ මෙසේ වූ උතුම් යසගීයෙක් උස් වැ නැංගේ ය” යනු යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති ඛාණුමත ගමැ වැසි බමුණෝ ද ගැහැවියෝද ඛාණුමතයෙන් නික්මැ බොහො බොහෝ වැ මුළු මුළු වූවෝ, එකි එකී පැත්තෙඟි මුළු දුන්නෝ, ගමින් පිටතැ දී මහ මුළුවෙක් වැ එකතු වූවෝ අඹයැටි උයන අතට යෙති.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 250,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "3. තෙන ඛො පන සමයෙන කූටදන්තො බ්රාහ්මණො උපරිපාසාදෙ දිවාසෙය්යං උපගතො හොති. අද්දසා ඛො කූටදන්තො බ්රාහ්මණො ඛාණුමතකෙ බ්රාහ්මණගහපතිකෙ ඛාණුමතා නික්ඛමිත්වා සඞ්ඝසඞ්ඝී ගණීභූතෙ යෙන අම්බලට්ඨිකා තෙනුපසඞ්කමන්තෙ. දිස්වා **ඛත්තං** ආමන්තෙසි: “කින්නු ඛො භො ඛත්තෙ ඛාණුමතකා බ්රාහ්මණගහපතිකා ඛාණුමතා නික්ඛමිත්වා සඞ්ඝසඞ්ඝී ගණීභූතා යෙන අම්බලට්ඨිකා තෙනුපසඞ්කමන්තී”? ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අත්ථි ඛො භො සමණො ගොතමො සක්යපුත්තො සක්යකුලා පබ්බජිතො මගධෙසු චාරිකං චරමානො මහතා භික්ඛුසඞ්ඝෙන සද්ධිං පඤ්චමත්තෙහි භික්ඛුසතෙහි ඛාණුමතං අනුප්පත්තො ඛාණුමතෙ විහරති අම්බලට්ඨිකායං. තං ඛො පන භවන්තං ගොතමං එවං කල්යාණො කිත්තිසද්දො අබ්භුග්ගතො: ඉතිපි සො භගවා අරහං සම්මාසම්බුද්ධො විජ්ජාචරණසම්පන්නො සුගතො ලොකවිදූ අනුත්තරො පුරිසදම්මසාරථි සත්ථා දෙවමනුස්සානං බුද්ධො භගවා’ති. තමෙතෙ භවන්තං ගොතමං දස්සනාය උපසඞ්කමන්තී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "4. අථ ඛො කූටදන්තස්ස බ්රාහ්මණස්ස එතදහොසි “සුතං ඛො පන මෙ තං: සමණො ගොතමො තිවිධං යඤ්ඤසම්පදං සොළසපරික්ඛාරං ජානාතීති. න ඛො පනාහං ජානාමි තිවිධං යඤ්ඤසම්පදං සොළසපරික්ඛාරං. ඉච්ඡාමි චාහං මහායඤ්ඤං යජිතුං. යන්නූනාහං සමණං ගොතමං උපසඞ්කමිත්වා තිවිධං යඤ්ඤසම්පදං සොළසපරික්ඛාරං පුච්ඡෙය්යන්ති”."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො කූටදන්තො බ්රාහ්මණො ඛත්තං ආමන්තෙසි “තෙන හි භො ඛත්තෙ යෙන ඛාණුමතකා බ්රාහ්මණගහපතිකා තෙනුපසඞ්කම. උපසඞ්කමිත්වා ඛාණුමතකෙ බ්රාහ්මණගහපතිකෙ එවං වදෙහි ‘කූටදන්තො භො බ්රාහ්මණො එවමාහ: ආගමෙන්තු කිර භවන්තො. කූටදන්තො’පි බ්රාහ්මණො සමණං ගොතමං දස්සනාය උපසඞ්කමිස්සතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘එවං භො’ති ඛො සො ඛත්තා කූටදන්තස්ස බ්රාහ්මණස්ස පටිස්සුත්වා යෙන ඛාණුමතකා බ්රාහ්මණගහපතිකා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ඛාණුමතකෙ බ්රාහ්මණගහපතිකෙ එතදවොච “කූටදන්තො භො බ්රාහ්මණො එවමාහ: ආගමෙන්තු කිර භොන්තො. කූටදන්තො’පි බ්රාහ්මණො සමණං ගොතමං දස්සනාය උපසඞ්කමිස්සතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "5. තෙන ඛො පන සමයෙන අනෙකානි බ්රාහ්මණසතානි ඛාණුමතෙ පටිවසන්ති ‘කූටදන්තස්ස බ්රාහ්මණස්ස මහායඤ්ඤං අනුභවිස්සාමා’ති. අස්සොසුං ඛො තෙ බ්රාහ්මණා ‘කූටදන්තො කිර බ්රාහ්මණො සමණං ගොතමං දස්සනාය උපසඞ්කමිස්සතී’ති. අථ ඛො තෙ බ්රාහ්මණා යෙන කූටදන්තො බ්රාහ්මණො තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා කූටදන්තං බ්රාහ්මණං එතදවොචුං ‘සච්චං කිර භවං කූටදන්තො සමණං ගොතමං දස්සනාය උපසඞ්කමිස්සතී?’ති"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "3. එ සමයෙහි කුළුදත් බමුණු තෙමේ තමා පහයැ උඩු මහලෙහි දවයහන් පැමිණියේ වේ. හේ (කවළියෙන් බලනුයේ) ඛාණුමතයෙන් නික්මැ බොහො බොහෝ රැස් වැ එකි එකී පසැ මුළු මුළු වැ, ගමින් පිටතැ දී මහමුළුවෙක් වැ එකතු වැ, අඹයැටිය කරා යන ඛාණුමත ගමැ වැසි බමුණන් ද ගැහැවියන් ද දිටී ය. දැක **ඛත්තූහු** (අසන තැන් බණුවා) බණවා “භවත් ඛත්තුව, කවර හෙයින් ඛාණූමත ගමැ වැසි බමුණෝත් ගැහැවියෝත් ඛාණුමතයෙන් නික්මැ බොහො බොහෝ වැ රැස් වී තැනින් තැත මුළු මුළු වැ, ගමින් පිටතැ දී මහමුළුවක් වැ එකතු වැ අඹයැටිය දෙසට යෙත් දැ? යි” යි විචාළේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“භවත, කරුණෙක් ඇත. සැහැපුත් වූ, සැහැකුලෙන් නික්මැ පැවිදි වූ, මහණ ගොයුම්හු භික්‍ෂූන් පන්සියක් පමණ වූ මහ පැවිදි මුළුවක් හා මගද රටැ සැරි සරනුවෝ ඛාණුමත ගමට පැමිණියෝ එය අසලැ අඹයැටි උයන්හි වෙසෙති. ඒ පින්වත් ගොයුම් තෙමේ මේ මේ කරුණින් රහත් ය, සම්මාසම්බුදු ය, විදුසරණ දෙකින් යුතු ය, සුගත ය, ලොව දන්නේ යැ, නොදැමුණන් දමනුයෙහි හැමට ම වැඩි සැරි දෑ ය, දෙව්මිනිස්නට සසු ය, බුදු ය, භගවත් යැ’යි මෙසේ ඔබ පිළිබඳ උතුම් යසගීයෙක් උස් වැ නැංගේ ය. මොහු පින්වත් ගොයුමාණන් දක්නට එහි යෙත්”යැ යි ඛත්තු තෙමේ කීය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "4. එ විටැ, කුළුදත් බමුණාට, “මහණ ගොයුම්හු තුන් යාගසම්පත් හා සොළොස් පිරිකර දනිතැ යි මා විසින් ඇසිණ. මම් වූ කලි තෙවැදෑරුම් යාගසම්පතත් සොළොස් පිරිකරත් නො දනිමි. වැලි දු මහයාගයක් යදනට මම් රිසියෙමි. මහණ ගොයුමාණන් කරා එළැඹ තෙවැදෑරුම් යාගසම්පතත් සොළොස් පිරිකරත් විචාළෙම් නම් යෙහෙකැ” යි මේ සිත වී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති කුළුදත් බමුණා ඛත්තූහු බණවා, “භවත් ඛත්තුව, එසේ වී නම් ඛාණුමත ගමැ වැසි ඒ බමුණු ගැහැවියන් වෙත එළැඹෙන්න. එළැඹ ‘භවත්නි, භවත්හු කුඩා තමක් බලා පොරොත්තු වෙත් වා. කුළුදත් බමුණා ද මහණ ගොයුමාණන් දක්නට එන්නේ යැ යි මෙසේ කීයේ යැ’ යි මෙ පරිදි සැළ කරන්නැ”යි කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘භවත, එසේ යැ’යි කියා ඒ ඛත්තු තෙම කුළුදත් බමුණාට පිළිවදන් දී ඛාණුමත ගමැ වැසි බමුණන් ද ගැහැවියන් ද කරා එළැඹියේ ය. එළැඹ, ඔවුනට “භවත්නි, භවත්හු කුඩා තමක් බලා පොරොත්තු වෙත් වා. කුළුදත් බමුණා ද මහණ ගොයුමාණන් දක්නට එන්නේ යැ’යි කුළුදත් බමුණු මෙසේ කීහ”යි මේ පවත් සැළ කෙළේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "5. එ සමයෙහි වනාහි බොහෝ සිය ගණන් බමුණෝ ‘කුළුදත් බමුණාගේ මහා යාගය වළඳන්නමු’යි ඛාණුමතයෙහි වෙසෙත්. ඒ බමුණෝ ‘කුළුදත් බමුණා මහණ ගොයුමාණන් දක්නට ඔබ කරා යෙතැ’යි ඇසූහ. ඉක්බිති ඔහු කුළුදත් බමුණු කරා එළැඹුණහ. එළැඹ ‘පින්වත් කුළුදත් තෙමේ මහණ ගොයුමාණන් දක්නට යන්නේ ල. ඒ සැබෑ දැ?’ යි ඇසූහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 252,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“එවං ඛො මෙ භො හොති: අහම්පි සමණං ගොතමං දස්සනාය උපසඞ්කමිස්සාමී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "6. “මා භවං කූටදන්තො සමණං ගොතමං දස්සනාය උපසඞ්කමි. න අරහති භවං කූටදන්තො සමණං ගොතමං දස්සනාය උපසඞ්කමිතුං. සචෙ භවං කූටදන්තො සමණං ගොතමං දස්සනාය උපසඞ්කමිස්සති භොතො කූටදන්තස්ස යසො හායිස්සති. සමණස්ස ගොතමස්ස යසො අභිවඩ්ඪිස්සති. යම්පි භොතො කූටදන්තස්ස යසො හායිස්සති. සමණස්ස ගොතමස්ස යසො අභිවඩ්ඪිස්සති, ඉමිනාපඞ්ගෙන න අරහති භවං කූටදන්තො සමණං ගොතමං දස්සනාය උපසඞ්කමිතුං. සමණො ත්වෙව ගොතමො අරහති භවන්තං කූටදන්තං දස්සනාය උපසඞ්කමිතුං"
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි කූටදන්තො උභතො සුජාතො මාතිතො ච පිතිතො ච, සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා, අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන. යම්පි භවං කූටදන්තො උභතො සුජාතො මාතිතො ච පිතිතො ච සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා, අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන, ඉමිනාපඞ්ගෙන න අරහති භවං කූටදන්තො සමණං ගොතමං දස්සනාය උපසඞ්කමිතුං. සමණො ත්වෙව ගොතමො අරහති භවන්තං කූටදන්තං දස්සනාය උපසඞ්කමිතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි කූටදන්තො අඩ්ඪො මහද්ධනො මහාභොගො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි කූටදන්තො අජ්ඣායකො මන්තධරො ති__ණ්ණං__ වෙදානං පාරගූ සනිඝණ්ඩුකෙටුභානං සාක්ඛරප්පභෙදානං ඉතිහාසපඤ්චමානං, පදකො වෙය්යාකරණො ලොකායතමහාපුරිසලක්ඛණෙසු අනවයො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි කූටදන්තො අභිරූපො දස්සනීයො පාසාදිකො පරමාය වණ්ණපොක්ඛරතාය සමන්නාගතො, බ්රහ්මවණ්ණී බ්රහ්මවච්චසී අක්ඛුද්දාවකාසො දස්සනාය -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි කූටදන්තො සීලවා වුද්ධසීලී වුද්ධසීලෙන සමන්නාගතො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි කූටදන්තො කල්යාණවාචො කල්යාණවාක්කරණො පොරියා වාචාය සමන්නාගතො විස්සට්ඨාය අනෙලගලාය අත්ථස්ස විඤ්ඤාපනියා -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි කූටදන්තො බහුන්නං ආචරියපාචරියො. තීණි මාණවකසතානි මන්තෙ වාචෙති. බහූ ඛො පන නානාදිසා නානාජනපදා මාණවකා ආගච්ඡන්ති භොතො කූටදන්තස්ස සන්තිකෙ මන්තත්ථිකා මන්තෙ අධියිතුකාමා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "“හවත්ති, මමත් මහණ ගොයුමාණන් දක්නට ඔබ වෙත් යන්නෙමැ යි මට මෙසේ සිතෙක් වේ ම යැ”යි කුළුදත් පැවැසී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "6. [එ බස් අසා එ බමුණෝ කුළුදතුට මෙසේ කීහු:]\n“පින්වත් කුළුදත් තෙමේ මහණ ගොයුමන් දක්නට නො යේ වා. පින්වත් කුළුදත් තෙමේ මහණ ගොයුමාණන් දක්නට යන්නට නො නිස්සේ ය. ඉදින් පින්වත් කුළුදත් තෙමේ මහණ ගොයුමාණන් දක්නට යන්නේ නම්, පින්වත් කුළුදතුගේ යශස් පිරිහෙන්නේ ය, මහණ ගොයුමාණන්ගේ යශස් වැඩෙන්නේ ය. ‘පින්වත් කුළුදතුගේ යශස් පිරිහෙන්නේ ය, මහණ ගොයුමාණන්ගේ යශස් වැඩෙන්නේ’ය යන යමෙක් ඇද්ද, මේ කරුණිනුත් පින්වත් කුළුදත් තෙමේ මහණ ගොයුමාණන් දක්නට යනුවට නො නිස්සේ ය. මහණ ගොයුම්හු ම පින්වත් කුළුදතු දක්නට එනුවට නිස්සෝ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පින්වත් කුළුදත් තෙමේ මවු පිය දෙපසින් ම අභිජාත ය. සත්වන මීමුතු යුවල තෙක් පිරිසිදු මවුකුස ඇත්තේ ය. කුල පිළිබඳ තෙප්ලෙන් නො හෙලන ලද්දේ ය, නො ගරහන ලද්දේ ය. පින්වත් කුළුදත් තෙමේ මවු පිය දෙපසින් ම අභිජාත ය … නො ගරහන ලද්දේ ය යන යමෙක් ඇද්ද, මේ කරුණිනුත් පින්වත් කුළුදත් තෙමේ මහණ ගොයුමන් දක්නට යන්නට නො නිස්සේ ය. මහණ ගොයුම්හු ම පින්වත් කුළුදතු දක්නට එන්නට නිස්සේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පින්වත් කුළුදත් තෙමේ ඉසුරුමත් ය, මහත් ධන ඇත්තේ ය, මහත් භෝග ඇත්තේ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පින්වත් කුළුදත් තෙමේ වේද හදාරන්නේ ය, වේදමන්ත්‍රයන් සිත්හි ලා දරන්නේ ය, නිඝණ්ඩු ද කෛටභශාස්ත්‍ර ද සහිත, ශික්‍ෂා හා නිරුක්ති සහිත, ඉතිහාසය පස්වනු කොටැති තුන් වේදයන්ගේ පර තෙර පත්තේ ය, පදපාඨ දන්නේය, සෙසු සියලු වියරණ විදි ද දන්නේ ය, ලෝකායතශාස්ත්‍රයෙහිත් මහාපුරුෂලක්‍ෂණ විද්‍යායෙහිත් නිපුණ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පින්වත් කුළුදත් තෙමේ අන්හට වැඩි තරම් වූ රූ සපුව ඇත්තේ ය, දැකුම් කටයුතු ය, දක්නහුට ප්‍රසාද එළවන සුලු ය, උතුම් පැහැසපුයෙත් යුතු ය, උතුම් රන්වන් පැහැ ඇත්තේ ය, උතුම් සිරුරු පැහැ ඇත්තේ ය, සිය සිරුරු සෙස්සන් විසින් දක්නට නොමඳ අවකාශ ඇත්තේ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පින්වත් කුළුදත් තෙමේ සිල්වත් ය, වැඩුණු සිල් ඇත්තේ ය, වැඩුණු ශීලයෙන් යුක්ත ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පින්වත් කුළුදත් තෙමේ කලණ තෙපුල් ඇත්තේ ය, කලණ මිහිරි බස් කියන්නේ ය, නිදොස්, නොකෙලතොලු, කී දෑ හඟවනු හැකි සිලිටි බසින් සමන්විත ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පින්වත් කුළුදත් තෙමේ බොහෝ දෙනාට ආචාර්‍ය්‍ය ද ප්‍රාචාර්‍ය්‍ය ද වෙයි. තුන්සියක් බමුණු දරුවනට වේදයන් කියවයි. නන් දෙසින් නන් දනව්වෙන් බොහෝ බමුණු දරුවෝ වේදය ඉගැන්ම පතනුවෝ, වේදයන් උගනු කැමැත්තෝ පින්වත් කුළුදත්හු වෙත එති ...",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 254,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "භවං හි කූටදන්තො ජිණ්ණො වුද්ධො මහල්ලකො අද්ධගතො වයො අනුප්පත්තො. සමණො ගොතමො තරුණො චෙව තරුණපබ්බජිතො ච -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි කූටදන්තො රඤ්ඤො මාගධස්ස සෙනියස්ස බිම්බිසාරස්ස සක්කතො ගරුකතො මානිතො පූජිතො අපචිතො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි කූටදන්තො බ්රාහ්මණස්ස පොක්ඛරසාතිස්ස සක්කතො ගරුකතො මානිතො පූජිතො අපචිතො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "භවං හි කූටදන්තො ඛාණුමතං අජ්ඣාවසති සත්තුස්සදං සතිණකට්ඨොදකං සධඤ්ඤං රාජභොග්ගං රඤ්ඤා මාගධෙන සෙනියෙන බිම්බිසාරෙන දින්නං රාජදායං බ්රහ්මදෙය්යං. යම්පි භවං කූටදන්තො ඛාණුමතං අජ්ඣාවසති සත්තුස්සදං සතිණකට්ඨොදකං සධඤ්ඤං රාජභොග්ගං රඤ්ඤා මාගධෙන සෙනියෙන බිම්බිසාරෙන දින්නං රාජදායං බ්රහ්මදෙය්යං. ඉමිනාපඞ්ගෙන න අරහති භවං කූටදන්තො සමණං ගොතමං දස්සනාය උපසඞ්කමිතුං. සමණො ත්වෙව ගොතමො අරහති භවන්තං කූටදන්තං දස්සනාය උපසඞ්කමිතුන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "7. එවං වුත්තෙ කූටදන්තො බ්රාහ්මණො තෙ බ්රාහ්මණෙ එතදවොච: "
                    },
                    {
                        "type": "paragraph",
                        "text": "“තෙන හි භො මමපි සුණාථ යථා මයමෙව අරහාම තං භවන්තං ගොතමං දස්සනාය උපසඞ්කමිතුං, නත්වෙව අරහති සො භවං ගොතමො අම්හාකං දස්සනාය උපසඞ්කමිතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "“සමණො ඛලු භො ගොතමො උභතො සුජාතො මාතිතො ච පිතිතො ච, සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන. යම්පි භො සමණො ගොතමො උභතො සුජාතො මාතිතො ච පිතිතො ච, සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා, අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන. ඉමිනාපඞ්ගෙන න අරහති සො භවං ගොතමො අම්හාකං දස්සනාය උපසඞ්කමිතුං. අථ ඛො මයමෙව අරහාම තං භවන්තං ගොතමං දස්සනාය උපසඞ්කමිතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො මහන්තං ඤාතිසඞ්ඝං ඔහාය පබ්බජිතො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො පහූතං හිරඤ්ඤසුවණ්ණං ඔහාය පබ්බජිතො භූමිගතඤ්ච වෙහාසට්ඨඤ්ච -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො දහරො’ව සමානො යුවා සුසු කාළකෙසො භද්රෙන යොබ්බනෙන සමන්නාගතො පඨමෙන වයසා අගාරස්මා අනගාරියං පබ්බජිතො -පෙ-."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "පින්වත් කුළුදත් තෙමේ ජරායෙන් දැදුරැ ය, වයසින් වැඩුණේ ය, මහලු ය, බොහෝ කල් ඉක්මැවූයෙක, පැසිම් වියට පැමිණියෙක. මහණ ගොයුම්හු වූ කලි ළදරුත් ළදරු පැවිද්දෙකුත් වේ ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පින්වත් කුළුදත් තෙමේ මගධාධිපති සේනිය බිම්බිසාර රජහු විසින් සත්කාර කරන ලද්දෙක, ගරු කරන ලද්දෙක, බුහුමන් කරන ලද්දෙක, පුදන ලද්දෙක, යටත් පැවැතුම් දක්වන ලද්දෙක ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පින්වත් කුළුදත් තෙමේ පොකුරුසැත් බමුණහු විසින් සත්කාර කැරුණෙක, ගරු කැරුණෙක, බුහුමන් කැරුණෙක, පිදුණෙක, යටත් පැවැතුම් දැක්වුණෙක ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පින්වත් කුළුදත් තෙමේ බොහෝ ජනයා ගැවැසුණු, තණ දඬු දිය ඇති, බොහෝ ධන ධාන්‍ය ඇති, රජුගෙන් ලත් නින්දගම් වූ රජුගේ ත්‍යාගය වූ, සේනිය බිම්බිසාර රජු දුන් උතුම් දානවස්තු වූ ඛාණුමත ගමට ඉසුරු වැ වෙසේ. පින්වත් කුළුදත් තෙමේ බොහෝ ජනයා ගැවැසුණු ... ඛාණුමත ගමට ඉසුරු වැ වෙසේ ය යන යමෙක් ඇද්ද, මේ කරුණිනුත් පින්වත් කුළුදත් තෙමේ මහණ ගොයුමන් දක්නට යන්නට නො නිස්සේ ය. මහණ ගොයුම්හු ම පින්වත් කුළුදතු දක්නට නිසි හ” යනු යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "7. මෙසේ (ඔවුන්) කී කලැ කුළුදත් බමුණා ඒ, බමුණනට මේ බස් කී ය:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“භවත්නි, එසේ වී නම්, මහණ ගොයුමාණන් අප දක්නට එනුවට වඩා අප ඔබ දක්නට යෑමෙහි සුදුසු වන සැටි දක්වන මා බස් ද අසවු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“භවත්නි, මහණ ගොයුම්හු වූ කලි වූ පිය දෙ පසින් ම අභිජාත ය, සත් වන මීමුතු යුවල තෙක් පිරිසිදු මවුකුස ඇත්තෝ ය. ජාතිවාදයෙන් නො හෙළන ලද්දෝ ය, නො ගරහන ලද්දෝ ය. … මහණ ගොයුම්හු මවුපිය දෙපසින් ම අභිජාතයහ … නො හෙළන ලද්දෝ ය, නො ගරහන ලද්දෝ ය යන යමක් ඇද්ද, මේ කරුණිනුදු ඒ පින්වත් ගොයුම්හු අප දක්නට එන්නට නො නිස්සහ. වැළි අපි ම ඔබ දක්නට යන්නට නිස්සම්හ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි මහත් නෑමුළුව පියා පැවිද වූවෝ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි පොළෝ යට ද පොළෝ මතු පිට ද වූ මහත් රන් අමුරන් හැරැ පියා පැවිදි වූවෝ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි සොඳුරු යොවුනෙන්, (වයස් තුන අතුරෙන්) පළමු වයසින් යුත් වූවෝ ම, තරුණ වූවෝ ම, මනා කළු කෙහෙ ඇති වැ යොවුන් වියැ සිටියෝ ම ගිහි ගෙන් නික්මැ පැවිදි බිමට වන්නෝ ය ...",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 256,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො අකාමකානං මාතාපිතුන්නං අස්සුමුඛානං රුදන්තානං කෙසමස්සුං ඔහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජිතො -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො අභිරූපො දස්සනීයො පාසාදිකො පරමාය වණ්ණපොක්ඛරතාය සමන්නාගතො බ්රහ්මවණ්ණී බ්රහ්මවච්චසී අක්ඛුද්දාවකාසො දස්සනාය -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො සීලවා අරියසීලී කුසලසීලී කුසලසීලෙන සමන්නාගතො -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො කල්යාණවාචො කල්යාණවාක්කරණො පොරියා වාචාය සමන්නාගතො විස්සට්ඨාය අනෙලගලාය අත්ථස්ස විඤ්ඤාපනියා -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොත__මො__ බහුන්නං ආචරියපාචරියො -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො ඛීණකාමරාගො විගතචාපල්ලො -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො කම්මවාදී කිරියවාදී අපාපපුරෙක්ඛාරො බ්රහ්මඤ්ඤාය පජාය -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො උච්චාකුලා පබ්බජිතො අස__ම්භි__න්නඛත්තියකුලා -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො අඩ්ඪා කුලා පබ්බජිතො මහද්ධනා මහාභොගා -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණං ඛලු භො ගොතමං තිරොරට්ඨා තිරොජනපදා සම්පුච්ඡිතුං ආගච්ඡන්ති -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණං ඛලු භො ගොතමං අනෙකානි දෙවතාසහස්සානි පාණෙහි සරණං ගතානි -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණං ඛලු භො ගොතමං එවං කල්යාණො කිත්තිසද්දො අබ්භුග්ගතො ‘ඉතිපි සො භගවා අරහං සම්මාසම්බුද්ධො විජ්ජාචරණසම්පන්නො සුගතො ලොකවිදූ අනුත්තරො පුරිසදම්මසාරථි සත්ථා දෙවමනුස්සානං බුද්ධො භගවා’ ති -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො ද්වත්තිංසමහාපුරිසලක්ඛණෙහි සමන්නාගතො -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො එහිසාගතවාදී සඛිලො සම්මොදකො අබ්භාකුටිකො උත්තානමුඛො පුබ්බභාසී -පෙ-"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි ඔබ පැවිදි වන්නා නො කැමැති මාපියන් කඳුළු පිරි මුහුණ ඇති වැ හඬද්දී එය නොතකා කෙහෙ රවුළු බා පියා කසා වත් හැඳ ගිහි ගෙන් නික්මැ පැවිද්දට බටුවෝ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු කලි හැමට වැඩි තරම් රූ සිරි ඇත්තෝ ය, දක්නවුන් සිතැ පැහැදීම් පහළ කරවන සුලුහ, උතුම් පැහැ සපුයෙන් යුතුහ. උතුම් රන් පැහැ ඇත්තෝ ය, උතුම් සිරුරු පබ ඇත්තෝ ය. සිය සිරුරැ දැක්මට නොමඳ ඔවස් ඇත්තෝ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි සිල්වත්හ, පිරිසිදු සිල් ඇත්තෝ ය, නිදොස් ශීලයෙන් යුත්හ ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණ ගොයුම්හු වූ කලි කලණ තෙපුල් ඇත්තෝ ය, කලණ මිහිරි බස් තෙපලන්නෝ ය, නිදොස් වූ ‍නොකෙලතොලු වූ කී දෑ හඟවනු සමත් සිලිටි බසින් සමන්විතයෝ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි බොහෝ දෙනාට ආචාර්‍ය ද ප්‍රචාර්‍ය්‍ය ද වෙති ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි පහ වූ කාමරාග ඇත්තෝ ය, පහ වූ චපල බව් ඇත්තෝ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්ති, මහණ ගොයුම්හු වූ කලි කර්‍මවාදිත් ක්‍රියවාදිත් වෙති. නව ලොවුතුරා දහම් පුරස්සර කොට වැටෙති. සැරියුත් මුගලන් ඈ බමුණු පිරිසට ද නායක වැ හැසිරෙති ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්ති, මහණ ගොයුම්හු වූ කලි පිරිසිදු කැත් කුල වූ උසස් කුලයෙන් නික්මැ පැවිදි වූවෝ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි මහත් ධන ඇති මහත් භෝග ඇති ඉසුරුමත් කුලයෙන් නික්මැ පැවිදි වූවෝ ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුමන් කරා පිට රටින් පිට දනවුයෙන් පැණ පුළුවුස්නට එති ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, නොයෙක් දහස් ගණත් දෙවියෝ මහණ ගොයුමන් දිවිහිමියෙන් සරණ ගියහ ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුමාණන්ගේ වූ කලි “මේ මේ කරුණින් ඒ භගවත් තෙමේ රහත් ය, සම්මාසම්බුදු ය, විදු සරණින් යුතු ය, සුගත ය, ලොව දන්නේ ය, ලොවුතුරා නරදම්සැරි ය, දෙව්මිනිස්නට සසු ය, සිවු සස් දතුයේ ය, භගවත් යැ”යි මෙසේ වූ උතුම් වූ යසගී උස් වැ නැංගේ යැ ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි දෙතිස් මහ පුරිස්ලකුණින් යුතු ය ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි තමන් වෙත එන්නවුන් ‘එන්න, මෙහි ආ යේ මැනැවැ’යි පිළිගන්නා සුලු හ, කණට සුව එළවන තෙපුල් තෙපලන්නෝ ය, පිළිසඳරෙහි දක්‍ෂය හ, බැම නොහකුළුවන්නෝ ය, සුලභ කථා ඇත්තෝ ය, පැමිණයනට තුමූ පළමුයෙන් කථා කරන සුලුහ ...",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 258,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො චතුන්නං පරිසානං සක්කතො ගරුකතො මානිතො පූජිතො අපචිතො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණෙ ඛලු භො ගොතමෙ බහූ දෙවා ච මනුස්සා ච අභිප්පසන්නා -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො යස්මිං ගාමෙ වා නිගමෙ වා පටිවසති, න තස්මිං ගාමෙ වා නිගමෙ වා අමනුස්සා මනුස්සෙ විහෙඨෙන්ති -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො සඞ්ඝී ගණී ගණාචරියො පුථුතිත්ථකරානං අග්ගමක්ඛායති. "
                    },
                    {
                        "type": "paragraph",
                        "text": "යථා ඛො පන භො එකෙසං සමණබ්රාහ්මණානං යථා වා තථා වා යසො සමුදාගච්ඡති, න හෙවං සමණස්ස ගොතමස්ස යසො සමුදාගතො. අථ ඛො අනුත්තරාය විජ්ජාචරණසම්පදාය සමණස්ස ගොතමස්ස යසො සමුදාගතො -පෙ-."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණං ඛලු භො ගොතමං රාජා මාගධො සෙනියො බිම්බිසාරො සපුත්තො සභරියො සපරිසො සාමච්චො පාණෙහි සරණං ගතො. සමණං ඛලු භො ගොතමං රාජා පසෙනදී කොසලො සපුත්තො සභරියො සපරිසො සාමච්චො පාණෙහි සරණං ගතො. සමණං ඛලු භො ගොතමං බ්රාහ්මණො පොක්ඛරසාතී සපුත්තො සභරියො සපරිසො සාමච්චො පාණෙහි සරණං ගතො. සමණො ඛලු භො ගොතමො රඤ්ඤො මාගධස්ස සෙනියස්ස බිම්බිසාරස්ස සක්කතො ගරුකතො මානිතො පූජිතො අපචිතො. සමණො ඛලු භො ගොතමො රඤ්ඤො පසෙනදිස්ස කොසලස්ස සක්කතො ගරුකතො මානිතො පූජිතො අපචිතො. සමණො ඛලු භො ගොතමො බ්රාහ්මණස්ස පොක්ඛරසාතිස්ස සක්කතො ගරුකතො මානිතො පූජිතො අපචිතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "සමණො ඛලු භො ගොතමො ඛාණුමතං අනුප්පත්තො, ඛාණුමතෙ විහරති අම්බලට්ඨිකායං. යෙ ඛො පන කෙචි සමණා වා බ්රාහ්මණා වා අම්හාකං ගාමක්ඛෙත්තං ආගච්ඡන්ති, අතිථී නො තෙ හොන්ති. අතිථී ඛො පනම්හෙහි සක්කාතබ්බා ගරුකාතබ්බා මානෙතබ්බා පූජෙතබ්බා අපචෙතබ්බා. යම්පි භො සමණො ගොතමො ඛාණුමතං අනුප්පත්තො ඛාණුමතෙ විහරති අම්බලට්ඨිකායං. අතිථම්හාකං සමණො ගොතමො, අතිථි ඛො පනම්හෙහි සක්කාතබ්බො ගරුකාතබ්බො මානෙතබ්බො පූජෙතබ්බො අපචෙතබ්බො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි සිවු පිරිස් විසින් සත්කාර කරන ලදුහ, ගුරුකාර කරන ලදුහ, බුහුමන් කරන ලදුහ, පුදන ලදුහ, යටත් පැවැතුම් දක්වන ලදුහ ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුමාණන් කෙරෙහි බොහෝ දෙව්මිනිස්සු වෙසෙසින් පහන්හ ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි යම් ගමෙක හෝ නියම් ගමෙක වෙසෙත් නම්, එ ගමැ හෝ නියම් ගමැ වැසි මිනිස්නට යක්කු පීඩා නො කෙරෙත් ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි මහ සඟපිරිස් ඇත්තෝ ස, ගණ නායකයහ, ගණාචාර්‍ය්‍යය හ. බොහෝ තීර්ථංකරයන් අතුරෙහි අග්හ යි කියනු ලැබෙති ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "යම්සේ වනාහි ඇතැම් මහණබමුණන්ගේ යශස අචෙලකතාදි පිටතට පෙනෙන යම්තම් ව්‍රතමාත්‍රයෙකින් වැඩෙතත් මහණ ගොයුමන්ගේ යශස වූ කලි එසේ වැඩුණේ නො වේ. වැලි තමන් තුළැ ම වූ නිරුත්තර විද්‍යාචරණසම්පතින් වැඩුණේ වේ ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුමන් වූ කලි මගධාධිපති සේනිය බිම්බිසාර රජ තෙමේ දරුවන් බිරියන් සහිත වැ පිරිස් හා ඇමැත්තන් හා සමග දිවි හිම් කොට සරණ ගියේ ය ...\nභවත්නි, මහණ ගොයුමන් වූ කලි කොශලාධිපති පසේනදී රජ තෙමේ දරුවන් හා බිරියන් හා පිරිස් හා ඇමැත්තන් හා සහිත වැ දිවි හිම් කොට සරණ ගියේ ය ...\nභවත්නි, මහණ ගොයුමන් වූ කලි පොකුරුසැත් බමුණු තෙමේ දරුවන් බිරියන් පිරිස් හා ඇමැත්තන් සහිත වැ දිවි හිම් කොට සරණ ගියේ ය ...\nභවත්නි, මහණ ගොයුම්හු වූ කලි මගධ රටට අධිපති සේනිය බිම්බිසාර රජහු විසින් සත්කෘත ද ගුරුකෘත ද මානිත ද පූජිත ද අපචිත ද වෙති ...\nභවත්නි, මහණ ගොයුම්හු වූ කලි කොශලාධිපති පසේනදී රජහු විසින් සත්කෘත ද ගුරුකෘත ද මානිත ද පූජිත ද අපචිත ද වෙති ...\nභවත්නි, මහණ ගොයුම්හු වූ කලි පොකුරුසැත් බමුණා විසින් සත්කෘත ද ගුරුකෘත ද මානිත ද පූජිත ද අපචිත ද වෙති ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මහණ ගොයුම්හු වූ කලි දැන් ඛාණුමතයට පැමිණියෝ ඛාණුමතය සමීපයෙහි අඹයැටි වෙනෙහි (අම්බලට්ඨිකා වනයෙහි) වෙසෙති. භවත්නි, යම් කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ අප ගම් කෙතට එත් නම්, ඔහු අපට අමුතු වෙති. අමුත්තෝ වනාහි අප විසින් සත්කාර කටයුතුහ, ගුරුකාර කටයුතුහ, මානනීයහ, පූජනීයහ, අපචයනීයහ. භවත්නි, යම් හෙයකින් මහණ ගොයුම්හු ඛාණුමතයට පැමිණියෝ, ඛාණුමතය සමීපයෙහි අඹයැටියෙහි වෙසෙත් ද, එහෙයින් ඔබ අප අමුත්තෝ ය. අමුත්තෝ වනාහි අප විසින් සත්කාර කටයුතුහ, ගුරුකාර කටයුතුහ, බුහුමන් කටයුතුහ, පිදියැ යුතුහ, යටත් පැවැතුම් දැක්වියැ යුතුහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 260,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉමිනාපඞ්ගෙන නාරහති සො භවං ගොතමො අම්හාකං දස්සනාය උපසඞ්කමිතුං. අථ ඛො මයමෙව අරහාම තං භවන්තං ගොතමං දස්සනාය උපසඞ්කමිතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "එත්තකෙ ඛො අහං භො තස්ස භොතො ගොතමස්ස වණ්ණෙ පරියාපුණාමි. නො ච ඛො සො භවං ගොතමො එත්තකවණ්ණො. අපරිමාණවණ්ණො හි සො භවං ගොතමො’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "8. එවං වුත්තෙ තෙ බ්රාහ්මණා කූටදන්තං බ්රාහ්මණං එතදවොචුං: “යථා ඛො භවං කූටදන්තො සමණස්ස ගොතමස්ස වණ්ණෙ භාසති ඉතො චෙ’පි සො භවං ගොතමො යොජනසතෙ විහරති, අලමෙව සද්ධෙන කුලපුත්තෙන දස්සනාය උපසඞ්කමිතුං අපි පුටංසෙනාපි{1}. තෙන හි භො සබ්බෙව මයං සමණං ගොතමං දස්සනාය උපසඞ්කමිස්සමා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "9. අථ ඛො කූටදන්තො බ්රාහ්මණො මහතා බ්රාහ්මණගණෙන සද්ධිං යෙන අම්බලට්ඨිකා යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. ඛාණුමතිකා’පි ඛො බ්රාහ්මණගහපතිකා අප්පෙකච්චෙ භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු, අප්පෙකච්චෙ භගවතා සද්ධිං සම්මොදිංසු. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදිංසු. අප්පෙකච්චෙ යෙන භගවා තෙනඤ්ජලිං පණාමෙත්වා එකමන්තං නිසීදිංසු. අප්පෙකච්චෙ නාමගොත්තං සාවෙත්වා එකමන්තං නිසීදිංසු. අප්පෙකච්චෙ තුණ්හීභූතා එකමන්තං නිසීදිංසු."
                    },
                    {
                        "type": "paragraph",
                        "text": "10. එකමන්තං නිසින්නො ඛො කූටදන්තො බ්රාහ්මණො භගවන්තං එතදවොච: “සුතං මෙතං භො ගොතම සමණො ගොතමො තිවිධං යඤ්ඤසම්පදං සොළසපරික්ඛාරං ජානාතීති. න ඛො පනාහං ජානාමි තිවිධං යඤ්ඤසම්පදං සොළසපරික්ඛාරං. ඉච්ඡාමි චාහං මහායඤ්ඤං යජිතුං. සාධු මෙ භවං ගොතමො තිවිධං යඤ්ඤසම්පදං සොළසපරික්ඛාරං දෙසෙතූ”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තෙන හි බ්රාහ්මණ සුණොහි සාධුකං මනසිකරොහි භාසිස්සාමී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘එවං භො’ති ඛො කූටදන්තො බ්රාහ්මණො භගවතො පච්චස්සොසි. භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "11. “භූතපුබ්බං බ්රාහ්මණ රාජා **මහාවිජිතො** නාම අහොසි, අඩ්ඪො මහද්ධනො මහාභොගො පහූතජාතරූපරජතො පහූතවිත්තූපකරණො පහූතධනධඤ්ඤො පරිපුණ්ණකොසකොට්ඨාගාරො. අථ ඛො බ්රාහ්මණ රඤ්ඤො මහාවිජිතස්ස රහොගතස්ස පටිසල්ලීනස්ස එවං චෙතසො පරිවිතක්කො උදපාදි: “අධිගතා ඛො මෙ විපුලා මානුසකා භොගා. මහන්තං පඨවිමණ්ඩලං අභිවිජිය අජ්ඣාවසාමි. යන්නූනාහං මහායඤ්ඤං යජෙය්යං, යං මම’ස්ස දීඝරත්තං හිතාය සුඛායා”ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පුටොසෙනාපි - කෙසුචි පොත්ථකෙසු"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "මේ කරුණිනුත් ඒ පින්වත් ගොයුම්හු අප දක්නට එන්නට නො නිස්සහ. වැලි ඇපි ම ඒ භවද්ගෞතමයත් දක්නා පිණිස එළැඹෙන්නට නිසි වම්හ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හවත්නි, ඒ භවද් ගෞතමයන් පිළිබඳ වූ මෙතෙක් ගුණ මම දනිමි. එහෙත් පින්වත් ගොයුම්හු මෙ පමණක් ම ගුණ ඇත්තෝ නොවෙති. “ඔබ වූ කලි නො මිනියැ හැකි ගුණ ඇතියහ” යනු යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "8. මෙසේ කී කල්හි ඒ බමුණෝ කුළුදත් බමුණා බණවා, “පින්වත් කුළුදතු මහණ ගොයුමන්ගේ ගුණ වනන සැටියෙන්, ඒ පින්වත් ගොයුමන් මෙයින් සිය යොදුනක් දුරැ වසතත්, සැදැහැති කුලපුතුහු විසින් පාථෙය රැගෙන ද ඔබ දකිනු පිණිස එන්නට නිසි ම ය. එ බැවින්, භවත්නි, ඇපි සියල්ලමෝ මහණ ගොයුමන් දක්නට ඔබ වෙත එළඹෙන්නම්හ”යි කීහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "9. ඉක්බිත්තෙන් කුළුදත් බමුණා මහත් බමුණුගණයා හා අඹයැටියට භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළැඹැ භාග්‍යවතුන් වහන්සේ හා සතුටු විය. සතුටට කරුණු වූ, සිතැ රැඳැවිය යුතු වූ කථාව කැරැ නිමවා, පසෙක ඉඳගත්තේ ය. ඛාණුමත ගමැ වැසි බමුණෝ ද ගැහැවියෝ ද කෙනෙක් භාග්‍යවතුන් වහන්සේ ආදරයෙන් වැඳ පසෙක ඉඳ ගත්හ. කෙනෙක් භාග්‍යවතුන් වහන්සේ හා සතුටු වූහ. සතුටු වියැ යුතු සිතැ රැඳැවිය යුතු වූ කථා නිමවා පසෙක ඉඳ ගත්හ. කෙනෙක් භාග්‍යවතුන් වහන්සේ දසාවට ඇඳිලි බැඳගෙන පසෙක හුන්හ. කෙනෙක් නම්ගොත් අස්වා පසෙක ඉඳ ගත්හ. කෙනෙක් නිහඬ වැ පසෙක ඉඳ ගත්හ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "10. එක් පසෙකැ හුන්නා වූ ම කුළුදත් බමුණා, “පින්වත් ගොයුමාණනි, ‘මහණ ගොයුම්හු තෙවැදෑරුම් යාග සම්පතත් සොළොස් පිරිකරත් දනිති’යි මෙය මා විසින් අසන ලදි. මම් වූ කලි තෙවෑදෑරුම් යාග සම්පතත් සොළොස් පිරිකරත් නො ම දනිමි. වැලි දු මහායාගයක් යජනට මම් කැමැතියෙමි. යාච්ඤා කරමි. මට පින්වත් ගොයුම්හු තෙවැදෑරුම් යාග සම්පතුත් සොළොස් පිරිකරත් දෙසත් වා”යි භාග්‍යවතුන් වහන්සේට කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“බමුණ, එසේ වී නම් අසන්නැ. මොනොවට මෙනෙහි කරන්නැ. කියන්නෙමි”යි (භාග්‍යවතුන් වහන්සේ වදාළ සේක).",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘එසේ ය, පින්වතැ’යි කුළුදත් බමුණු භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වී ය. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "11. “පෙර වූවක් කියමි. බමුණ, ආඪ්‍ය වූ, මහත් ධන ඇති, මහත් භෝඟ ඇති, බොහෝ රන් රිදී ඇති, බොහෝ වස්තූපකරණ ඇති, බොහෝ ධන ධාන්‍ය ඇති, පිරිපුන් ගබඩා කොටුගුල් ඇති **මහාවිජිත** නම් ර‍ජෙක් විය. බමුණ, එ කලැ හුදෙකලා වැ චිත්තවිවේකයෙන් හුන් මහාවිජිත රජුට “මානුෂක මහත් භෝගසම්පත්හු මා විසින් ලබන ලද්දෝ ම ය. ඒ මම් මහත් පොළෝමඬුල්ල වෙසෙසින් දිනා හැමට අධිපති වැ වෙසෙමි. මට දික් කලක් හිත සුව පිණිස පවත්නා මහා යඥයක් යදින්නෙම් නම් මැනැවැ”යි මෙසේ චිත්ත සඞ්කල්පනාවෙක් පහළ විය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 262,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො බ්රාහ්මණ රාජා මහාවිජිතො පුරොහිතං බ්රාහ්මණං ආමන්තෙත්වා එතදවොච: ‘ඉධ මය්හං බ්රාහ්මණ රහොගතස්ස පටිසල්ලීනස්ස එවං චෙතසො පරිවිතක්කො උදපාදි: “අධිගතා ඛො මෙ විපුලා මානුසකා භොගා. මහන්තං පඨවිමණ්ඩලං අභිවිජිය අජ්ඣාවසාමි. යන්නූනාහං මහායඤ්ඤං යජෙය්යං, යං මම’ස්ස දීඝරත්තං හිතාය සුඛායා’ති. ඉච්ඡාමහං බ්රාහ්මණ මහායඤ්ඤං යජිතුං. අනුසාසතු මං භවං, යං මම’ස්ස දීඝරත්තං හිතාය සුඛායා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "12. එවං වුත්තෙ බ්රාහ්මණ පුරොහිතො බ්රාහ්මණො රාජානං මහාවිජිතං එතදවොච: ‘භොතො ඛො රඤ්ඤො ජනපදො සකණ්ටකො සඋප්පීළො. ගාමඝාතා’පි දිස්සන්ති, නිගමඝාතා’පි දිස්සන්ති, __නගරඝාතාපි දිස්සන්ති__, පන්ථදූහනා’පි දිස්සන්ති. භවං චෙ ඛො පන රාජා එවං සකණ්ටකෙ ජනපදෙ සඋප්පීළෙ බලිමුද්ධරෙය්ය, අකිච්චකාරී අස්ස තෙන භවං රාජා. සියා ඛො පන භොතො රඤ්ඤො එවමස්ස: ‘අහමෙතං දස්සුඛීලං වධෙන වා බන්ධෙන වා ජානියා වා ගරහාය වා පබ්බාජනාය වා සමූහනිස්සාමී’ති. න ඛො පනෙතස්ස දස්සුඛීලස්ස එවං සම්මා සමුග්ඝාතො හොති. යෙ තෙ හතාවසෙසකා භවිස්සන්ති, තෙ පච්ඡා රඤ්ඤො ජනපදං විහෙඨෙස්සන්ති. අපි ච ඛො ඉදං සංවිධානං ආගම්ම එවමෙතස්ස දස්සුඛීලස්ස සම්මා සමුග්ඝාතො හොති. තෙන හි භවං රාජා යෙ භොතො රඤ්ඤො ජනපදෙ උස්සහන්ති කසිගොරක්ඛෙ, තෙසං භවං රාජා බීජභත්තං අනුප්පදෙතු. යෙ භොතො රඤ්ඤො ජනපදෙ උස්සහන්ති වණිජ්ජාය, තෙසං භවං රාජා පාභතං අනුප්පදෙතූ. යෙ භොතො රඤ්ඤො ජනපදෙ උස්සහන්ති රාජපොරිසෙ, තෙසං භවං රාජා භත්තවෙතනං පකප්පතු. තෙ ච මනුස්සා සකම්මපසුතා රඤ්ඤො ජනපදං න විහෙඨෙස්සන්ති. මහා ච රඤ්ඤො රාසිකො භවිස්සති, ඛෙමට්ඨිතා ජනපදා අකණ්ටකා අනුප්පීළා. මනුස්සා ච මුදා මොදමානා උරෙ පුත්තෙ නච්චෙන්තා අපාරුතඝරා මඤ්ඤෙ විහරිස්සන්තී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "13. ‘එවං භො’ති ඛො බ්රාහ්මණ රාජා මහාවිජිතො පුරොහිතස්ස බ්රාහ්මණස්ස පටිස්සුත්වා යෙ රඤ්ඤො ජනපදෙ උස්සහිංසු කසිගොරක්ඛෙ, තෙසං රාජා මහාවිජිතො බීජභත්තං අනුප්පාදාසි.{1} යෙ රඤ්ඤො ජනපදෙ උස්සහිංසු වණිජ්ජාය, තෙසං රාජා මහාවිජිතො පාභතං අනුප්පාදාසි. යෙ රඤ්ඤො ජනපදෙ උස්සහිංසු රාජපොරිසෙ, තෙසං රාජා මහාවිජිතො භත්තවෙතනං පකප්පෙසි. තෙ ච මනුස්සා සකම්මපසුතා රඤ්ඤො ජනපදං න විහෙඨෙසුං. මහා ච රඤ්ඤො රාසිකො අහොසි, ඛෙමට්ඨිතා ජනපදා අකණ්ටකා අනුප්පීළා. මනුස්සා මුදා මොදමානා උරෙ පුත්තෙ නච්චෙන්තා අපාරුතඝරා මඤ්ඤෙ විහරිංසු."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අනුප්පාදෙසි - කෙසුචි පොත්ථකෙසු"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "බමුණ, ඉක්බිත්තෙන් මහාවිජිත රජ තෙම් පෙරෙවියා අමතා, “බමුණ, මෙහි හුදෙකලා වැ චිත්තවිවේකයෙන් හුන් මට ‘මානුෂක වූ මහත් භෝගයෝ මා විසින් ලදහ. ඒ මම් මහත් මිහිමඬල දිනා එයට අධිපති වැ වෙසෙමි. මට දික් කලක් භිත සුව පිණිස පවත්නා මහා යඥයක් කළොත් මැනැවැ යි මෙසේ චිත්තසංකල්පනාවෙක් උපන. බමුණ, මහා යඥයක් කරන්නට කැමැත්තෙමි. එහි ලා භවත් තෙමේ මට දික් කලක් හිත සුව පිණිස අනුශාසන කෙරේ වා” යි මේ බස් පැවැසී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "12. බමුණ, මෙසේ කී කල්හි පෙරෙවි බමුණා මහාවිජිත රජුට මෙය කී ය: “භවත් රජුහුගේ රට කටු සහිත (සොරඋවදුරු සහිත) වෙයි, සොර උවදුරින් මිරිකුණේ වෙයි. ගම් පැහැරුම් දක්නා ලැබේ. නියම්ගම් පැහැරුම් දක්නා ලැබේ. නුවර පැහැරුම් දක්නා ලැබේ. මං පැහැරුම් දක්නා ලැබේ. භවත් රජ තෙමේ ඉදින් මෙසේ සොර උවදුරු ඇති සොර උවදුරින් මිරිකුණු රටෙහි බදු කරවුවර ගන්නේ නම්, එයින් නොකටයුත්තක් කරන්නෙක් වන්නේ ය. ‘වධ කිරීමෙන් හෝ බැඳැ ලීමෙන් හෝ දඩ ගැසීමෙන් හෝ හිස මුඩු කැරැවීම් ආදී ගැරැහුමෙන් හෝ රටින් නෙරැපීමෙන් හෝ මේ දශ්‍යුකීලය (සොර හුල) මුලින් ම උදුරා ලන්නෙමි’ යි පින්වත් රජුට මෙසේ සිතක් විය හැක්ක. මෙසේ මේ සොර හුල මැනැවින් ඉදිරීමෙක් නො වේ ම ය. නසන ලද්දවුන්ගෙන් ඉතිරි වූ යම් සොරසතුරු කෙනෙක් වන්නෝ ද, ඔහු පසු වැ රජුගේ රට පෙළන්නාහ. එතෙකුදු වුවත් මේ මතු දැක්වෙන සංවිධානයට පැමිණ (මතු දැක්වෙන සේ පිළිපැදීමෙන්) මෙසේ මේ සොර හුල මොනොවට ඉදිරී යෑම වේ. එ බැවින් සිය රටෙහි යම් කෙනෙක් ගොවිතැන්හි ගෙරි රැකුම්හි උත්සාහ කෙරෙත් නම්, පින්වත් රජ තෙමේ ඔවුනට ධාන්‍ය බිජුවට ද බත් ද දේ වා. යම් කෙනෙක් පින්වත් රජුහුගේ රටෙහි වෙළෙඳාම පිණිස උත්සාහ කෙරෙත් ද, ඔවුනට රජ තෙමේ බඩු මිල දේ වා. පින්වත් රජුහුගේ රටෙහි යම් කෙනෙක් රාජකාර්‍ය්‍යයෙහි උත්සාහ කෙරෙත් ද, ඔවුනට පින්වත් රජ තෙමේ බත් වැටුප් දේ වා. ඒ මිනිස්සුත් තමන්ගේ වැඩපලෙහි යෙදුණේ රජුගේ රට නො පෙළන්නෝ ය. රජුගේ ධනධාන්‍ය රැස ද මහත් වන්නේ ය. ජනපදයෝ සොර උවදුරු නැත්තෝ, නො මිරිකුණෝ, නිරුපද්‍රැතභාවයේ සිටියෝ වන්නාහ. මිනිස්සු ද උනුන් කෙරෙහි සතුටු වන්නෝ, ඔරෙහි දරුවන් නටවන්නෝ, දොර නොවැසූ ගෙවල් ඇත්තවුන් මෙන් (බිය සැක නැති ව) වසන්නෝ ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "13. බමුණ, ‘භවත්, එසේයැ’ යි කියා ම ඒ මහාවිජිත රජ පිළිවදන් දී, රජුගේ රටෙහි ගොවිතැන්හි ගෙරිරැකුම්හි උත්සුක වූවනට බිජු ද බත් ද දෙවී ය. වෙළෙඳාමෙහි උත්සුක වූවනට බඩුමිල දෙවී ය. රාජකාර්‍යයෙහි යෙදුණවුනට බත්වැටුප් දෙවී ය. ඒ මිනිස්සු ද මෙසේ රජුගේ රට නො පෙළූහ. රජුගේ ද ධනධාන්‍ය රාශිය මහත් විය. ජනපදයෝ සොරසතුරු උවදුරින් මිදුණෝ නොමිරිකුණෝ නිරුපද්‍රැත බව්හි සිටියෝ වූහ. මිනිස්සු ඔවුනොවුන් හා සතුටු වන්නෝ දරුවත් ඔරෙහි නටවනුවෝ දොර නොවැසූ ගෙවල් ඇතියන් සේ (බිය සැක නැති වැ) වුසූහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 264,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "14. අථ ඛො බ්රාහ්මණ රාජා මහාවිජිතො පුරොහිතං බ්රාහ්මණං ආමන්තෙත්වා එතදවොච: “සමූහතො ඛො මෙ භො සො දස්සුඛීලො භොතො සංවිධානං ආගම්ම. මහා ච මෙ රාසිකො. ඛෙමට්ඨිතා ජනපදා අකණ්ටකා අනුප්පීළා. මනුස්සා මුදා මොදමානා උරෙ පුත්තෙ නච්චෙන්තා අපාරුතඝරා මඤ්ඤෙ විහරන්ති. ඉච්ඡාමහං බ්රාහ්මණ මහායඤ්ඤං යජිතුං. අනුසාසතු මං භවං, යං මම’ස්ස දීඝරත්තං හිතාය සුඛායා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තෙන හි භවං රාජා යෙ භොතො රඤ්ඤො ජනපදෙ ඛත්තියා අනුයුත්තා නෙගමා චෙව ජානපදා ච, තෙ භවං රාජා ආමන්තයතං, ‘ඉච්ඡාමහං භො මහායඤ්ඤං යජිතුං. අනුජානන්තු මෙ භොන්තො යං මම’ස්ස දීඝරත්තං හිතාය සුඛායා’ති. යෙ භොතො රඤ්ඤො ජනපදෙ අමච්චා පාරිසජ්ජා නෙගමා චෙව ජානපදා ච -පෙ- බ්රාහ්මණමහාසාලා නෙගමා චෙව ජානපදා ච, __ගහපතිනෙචයිකා නෙගමා චෙව ජානපදා ච__, තෙ භවං රාජා ආමන්තයතං: ‘ඉච්ඡාමහං භො මහායඤ්ඤං යජිතුං. අනුජානන්තු මෙ භවන්තො යං මම’ස්ස දීඝරත්තං හිතාය සුඛායා’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘එවං භො’ති ඛො බ්රාහ්මණ රාජා මහාවිජිතො පුරොහිතස්ස බ්රාහ්මණස්ස පටිස්සුත්වා යෙ රඤ්ඤො ජනපදෙ ඛත්තියා අනුයුත්තා නෙගමා චෙව ජානපදා ච, තෙ රාජා මහාවිජිතො ආමන්තෙසි: “ඉච්ඡාමහං භො මහායඤ්ඤං යජිතුං. අනුජානන්තු මෙ භොන්තො, යං මම’ස්ස දීඝරත්තං හිතාය සුඛායා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යජතං භවං රාජා යඤ්ඤං. යඤ්ඤකාලො මහාරාජා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යෙ රඤ්ඤො ජනපදෙ අමච්චා පාරිසජ්ජා නෙගමා චෙව ජානපදා ච -පෙ- බ්රාහ්මණමහාසාලා නෙගමා චෙව ජානපදා ච -පෙ- ගහපතිනෙචයිකා නෙගමා චෙව ජානපදා ච, තෙ රාජා මහාවිජිතො ආමන්තෙසි: “ඉච්ඡාමහං භො මහායඤ්ඤං යජිතුං. අනුජානන්තු මෙ භවන්තො, යං මම’ස්ස දීඝරත්තං හිතාය සුඛායා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යජතං භවං රාජා යඤ්ඤං. යඤ්ඤකාලො මහාරාජා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉතීමෙ චත්තාරො අනුමතිපක්ඛා තස්සෙව යඤ්ඤස්ස පරික්ඛාරා භවන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "15. රාජා මහාවිජිතො අට්ඨහි අඞ්ගෙහි සමන්නාගතො:"
                    },
                    {
                        "type": "paragraph",
                        "text": "උභතො සුජාතො මාතිතො ච පිතිතො ච, සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා,"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "14. බමුණ, ඉක්බිත්තෙන් මහාවිජිත රජ තෙමේ පෙරෙවියා අමතා, “භවත, මා විසින් භවත්හුගේ සංවිධානය පිළිපැද ඒ සොරසතුරු හුල මුලිත් උදුරන ලද්දේ ය. මගේ ධන ධාන්‍ය රැස ද මහත් ම ය. ජනපදයෝ අකණ්ටක වූවෝ, (සොර සතුරු උවදුරු නැත්තෝ) උවදුරින් නොමිරිකුණෝ, උවදුරු නැති බව්හි සිටියෝ ය. මිනිස්සු ඔවුනොවුන් හා සතුටු වන්නෝ, ඔරෙහි දරුවන් නටවන්නෝ, දොර නොවැසූ ගෙවල් ඇත්තවුන් සේ වෙසෙත්. බමුණ, මට දික් කලක් හිත සුව පිණිස පවත්නා මහා යඥයක් යදනට (මහ දනක් දෙන්නට) මම් කැමැත්තෙමි. පින්වත් තෙමේ මට අනුශාසන කෙරේ වා” හි මෙ බස් කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එ විට පෙරෙවි තෙමේ මෙසේ රජුට අනුශාසන කෙළේ ය: “එසේ නම්, පින්වත් රජුගේ රටෙහි තමා අනුව පවත්නා නියම්ගම්වැසි වූත් දනවුවැසි වූත් යම් ක්‍ෂත්‍රිය කෙනෙක් වෙත් තම්, පින්වත් රජ තෙමේ ඔවුන් අමතා, ‘භවත්නි, මට බොහෝ කල් හිත සුව පිණිස මම් මහ දනක් දෙනු කැමැත්තෙමි. භවත්හු එයට මට අනුදනිත් වා’යි කියා වා. පින්වත් වූ රජුගේ රටෙහි නියම්ගම්වැසි වූත් දනවුවැසි වූත් රාජසභාවට අයත් ඇමැතියෝ වෙත් ද, ... නියම්ගම් වැසි දනවුවැසි බමුණුමහසල්හු වෙත් ද ... නියම්ගම්වැසි දනවුවැසි මහ දනවත් ගැහැවි කෙනෙක් වෙත් ද, පින්වත් රජ තෙමේ ඔවුන් අමතා ‘භවත්නි, මට බොහෝ කල් හිත සුව පිණිස මම් මහ දනක් දෙනු රිසියෙමි. භවත්හු එයට මට අනුදනිත්වා’යි කියා වා”.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“බමුණ, ‘එසේ ය පින්වතැ’යි කියා ම මහාවිජිත රජ තෙමේ පෙරෙවි බමුණාට පිළිවදන් දී, සිය රටෙහි නියම්ගම්වැසි වූත් දනවුවැසි වූත් තමා අනුව පවත්තා ක්‍ෂත්‍රිය කෙනෙක් වූහු නම්, ඔවුන් අමතා, ‘පින්වත්නි, යමක් මට බොහෝ කල් හිත සුව පිණිස පවත්නේ ද, මම එසේ වූ යඥයක් යජන්නට (මහ දනක් දෙන්නට) කැමැත්තෙමි. පින්වත්හු එයට මට අනුදනිත්වා’යී කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘පින්වත් රජ තුමෝ යඥය යජත් වා (මහ දන් දෙත් වා). මහරජාණනි, මේ යඥයට කාලය වේ යැ’යි ඔහු කීහ. ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "සිය රටෙහි නියම්ගම්වැසි වූත් දනවුවැසි වූත් රාජසභාසද ඇමැති කෙනෙක් වූහු ද ... නියම්ගම්වැසි දනවුවැසි බමුණු මහසල් කුල කෙනෙක් වුහු ද, ... නියම්ගම්වැසි වූත් දනවුවැසි වූත් දන රැස් කරන ගැහැවි මහසල් කුල කෙනෙක් වූහු ද, මහාවිජිත රජ තෙමේ ඔවුන් හැම අමතා, ‘භවත්නි, යමක් මට බොහෝ කල් හිත සුව පිණිස පවත්නේ ද, එසේ වූ මහායඥයක් යජනු රිසියෙම්. පින්වත්හු මට එයට අනුදතිත් වා’යි දැන්වී ය."
                    },
                    {
                        "format": 13,
                        "text": "‘මහරජාණනි, මේ යඥයට කාලය ය. පින්වත් රජ තුමෝ යඥය කෙරෙත් වා’යි ඔහු කීහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මෙසේ ‍මේ අනුමති පක්‍ෂ සතර (අවසරය දෙන්නන් සතර වගය) එ ම යඥයට පිරිවර වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "15. මහාවිජිත රජ තෙමේ අංග අටෙකින් සමන්විත ය. (කවර අටඟින් ද? යත්:)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හේ මාපිය දෙපසින් ම අභිජාත ය, සත්වත මීමුතු යුවල තෙක් පිරිසිදු මවුකුස ඇත්තෙක.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 266,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන,"
                    },
                    {
                        "type": "paragraph",
                        "text": "අභිරූපො දස්සනීයො පාසාදිකො, පරමාය වණ්ණපොක්ඛරතාය සමන්නාගතො, බ්රහ්මවණ්ණී බ්රහ්මවච්චසී අක්ඛුවද්දාවකාසො දස්සනාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "අඩ්ඪො මහද්ධනො මහාභොගො පහූතජාතරූපරජතො ප__හූ__තවිත්තූපකරණො ප__හූ__තධනධඤ්ඤො පරිපුණ්ණකොසකොට්ඨාගාරො."
                    },
                    {
                        "type": "paragraph",
                        "text": "බලවා චතුරඞ්ගිනියා සෙනාය සමන්නාගතො අස්සවාය ඔවාදපටිකරාය, පතපති මඤ්ඤෙ පච්චත්ථිකෙ යසසා."
                    },
                    {
                        "type": "paragraph",
                        "text": "සද්ධො දායකො දානපති අනාවටද්වාරො, සමණබ්රාහ්මණකපණද්ධිකවණිබ්බකයාචකානං ඔපානභූතො, පුඤ්ඤානි කරොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "බහුස්සුතො තස්ස තස්ස සුතජාතස්ස. තස්ස තස්සෙව ඛො පන භාසිතස්ස අත්ථං ජානාති: ‘අයං ඉමස්ස භාසිතස්ස අත්ථො අයං ඉමස්ස භාසිතස්ස අත්ථො’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පණ්ඩිතො වියත්තො මෙධාවී පටිබලො අතීතානාගතපච්චුප්පන්නෙ අත්ථෙ චින්තෙතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "රාජා මහාවිජිතො ඉමෙහි අට්ඨහි අඞ්ගෙහි සමන්නාගතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉති ඉමානි’පි අට්ඨඞ්ගානි තස්සෙව යඤ්ඤස්ස පරික්ඛාරා භවන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "16. පුරොහිතො’පි බ්රාහ්මණො චතුහඞ්ගෙහි සමන්නාගතො:"
                    },
                    {
                        "type": "paragraph",
                        "text": "උභතො සුජාතො මාතිතො ච පිතිතො ච. සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා. අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "අජ්ඣායකො මන්තධරො තිණ්ණං වෙදානං පාරගූ සනිඝණ්ඩුකෙටුභානං සාක්ඛරප්පභෙදානං ඉතිහාසපඤ්චමානං පදකො වෙය්යාකරණො ලොකායතමහාපුරිසලක්ඛණෙසු අනවයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "සීලවා වුද්ධසීලී වුද්ධසීලෙන සමන්නාගතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "පණ්ඩිතො වියත්තො මෙධාවී පඨමො වා දුතියො වා සුජං පග්ගණ්හන්තානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුරොහිතො බ්රාහ්මණො ඉමෙහි චතූහඞ්ගෙහි සමන්නාගතො. ඉති ඉමානි’පි චත්තාරි අඞ්ගානි තස්සෙව යඤ්ඤස්ස පරික්ඛාරා භවන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ජාතිවාදයෙන් නොහෙළන ලද්දෙක, ගැරැහුම් නොලද්දෙක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "විශිෂ්ට රූප ශෝභා ඇත්තෙක, දැකුම් කටයුත්තෙක, ප්‍රසාද එළවන සුලු ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "උතුම් වර්‍ණසෞන්‍දර්‍යයෙන් යුක්ත ය, උතුම් රන් පැහැ ඇත්තෙක, උතුම් සිරුරු පැහැ ඇත්තෙක, සිය සිරුර අනුන් විසින් දක්නට නොමඳ අවකාශ ඇත්තෙක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආඪ්‍ය ය, මහද් ධන ඇත්තේ ය, මහද්භෝග ඇත්තේ ය, බොහෝ රන් රිදී ඇත්තේ ය, වස්තූපකරණ ඇත්තේ ය, බොහෝ ධන ධාන්‍ය ඇත්තේ ය, පිරිපුන් ගබඩා කොටාර ඇත්තේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බලවත් වූයේ, අණට කන් දෙන, ඔවා පිළිපදනා සිවුරඟ සෙනඟින් සමන්විත වූයේ, පසමිතුරන් සිය යස තෙදින් තවාලන්නාක් මෙන් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "සැදැහැත්තේ ය, දීමෙහි හුරු ය, දානපති ය, මහණුනට බමුණනට දුගියනට මගියනට පුලනුනට යදියනට නොවැසූ දොර ඇත්තේ ය, සිවුමං හන්දියෙක කැණූ පොකුණක් ‍මෙන් වැ දන් පින් කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඒ ඒ ඇසූ දෑ පිළිබඳ වැ බහුශ්‍රැත ය, මේ මෙබසෙහි අරුත ය, මේ මෙබසෙහි අරුත යැ යි ඒ ඒ කී බසෙහි අරුත් දනී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "නුවණැත්තේ ය, වියත් ය, අයුනා වත්මත් අරුත්හි සමත් ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහාවිජිත රජ තෙමේ මෙ අටඟින් සමන්විත ය. මෙසේ මේ අංග අට ද එම යඥයට පිරිවර වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "16. පෙරෙවි බමුණු ද සතර අංගයෙකින් යුත් වෙයි. (කවර සතරෙකින් ද යත්:) ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "මා පිය දෙපසින් ම අභිජාත ය, සතර වන මීමුතු යුවල තෙක් ම පිරිසිදු මවුකුස ඇත්තේ ය, ජාතිවාදයෙත් නො හෙළන ලද්දේ ය, නො ගරහන ලද්දේ ය. "
                    },
                    {
                        "type": "paragraph",
                        "text": "වේද හදාරන්නේ ය, නිඝණ්ඩු ද කෛටභශාස්ත්‍ර ද සහිත ශික්‍ෂා හා නිරුක්ති හා සහිත ඉතිහාසය පස්වනු කොටැති තුන් වේදයේ පරතෙරට පැමිණියේ ය, පදපාඨ දන්නේ ය, සෙසු සියලු වියරණ විදි ද දන්නේ ය, ලෝකායත ශාස්ත්‍රයෙහිත් මහාපුරුෂලක්‍ෂණ විද්‍යායෙහිත් නිපුණ ය. "
                    },
                    {
                        "type": "paragraph",
                        "text": "සිල්වත් ය, වැඩුණු සිල් ඇත්තේ ය, වැඩුණු ශීලයෙන් සමන්විත ය, "
                    },
                    {
                        "type": "paragraph",
                        "text": "පණ්ඩිත ය, ව්‍යක්ත ය, නුවණැත්තේ ය. යාග සැන්ද ඔසොවන්නවුන් අතුරෙහි පළමු හෝ දෙවෙනි තැනැත්තේ ය."
                    },
                    {
                        "format": 13,
                        "text": "පෙරෙවි බමුණු තෙමේ මේ සතර අංගයෙන් සමන්විත වෙයි. මෙසේ මේ සතර අංගයෝ ද එ ම යාගයට පිරිවර වෙත්.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 268,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "17. අථ ඛො බ්රාහ්මණ, පුරොහිතො බ්රාහ්මණො රඤ්ඤො මහාවිජිතස්ස පුබ්බෙව යඤ්ඤා තිස්සො විධා දෙසෙසි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "“සියා ඛො පන භොතො රඤ්ඤො මහායඤ්ඤං යිට්ඨුකාමස්ස කොචිදෙව විප්පටිසාරො ‘මහා වත මෙ භොගක්ඛන්ධො විගච්ඡිස්සතී’ති, සො භොතො රඤ්ඤො විප්පටිසාරො න කරණීයො. සියා ඛො පන භොතො රඤ්ඤො මහායඤ්ඤං යජමානස්ස කොචිදෙව විප්පටිසාරො ‘මහා වත මෙ භොගක්ඛන්ධො විගච්ඡතී’ති, සො භොතො රඤ්ඤො විප්පටිසාරො න කරණීයො. සියා ඛො පන භොතො රඤ්ඤො මහායඤ්ඤං යිට්ඨස්ස කොචිදෙව විප්පටිසාරො ‘මහා වත මෙ භොගක්ඛන්ධො විගතො’ති, සො භොතො රඤ්ඤො විප්පටිසාරො න කරණීයො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමා ඛො, බ්රාහ්මණ, පුරොහිතො බ්රාහ්මණො රඤ්ඤො මහාවිජිතස්ස පුබ්බෙව යඤ්ඤා තිස්සො විධා දෙසෙසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "18. අථ ඛො බ්රාහ්මණ, පුරොහිතො බ්රාහ්මණො රඤ්ඤො මහාවිජිතස්ස පුබ්බෙව යඤ්ඤා දසහාකාරෙහි පටිග්ගාහකෙසු විප්පටිසාරං පටිවිනොදෙසි: “ආගමිස්සන්ති ඛො භොතො යඤ්ඤං පාණාතිපාතිනො’පි පාණාතිපාතා පටිවිරතා’පි. යෙ තත්ථ පාණාතිපාතිනො, තෙසඤ්ඤෙව තෙන. යෙ තත්ථ පාණාතිපාතා පටිවිරතා, තෙ ආරබ්භ යජතං භවං, සජ්ජතං භවං, මොදතං භවං, චිත්තමෙව භවං අන්තරං පසාදෙතු. ආගමිස්සන්ති ඛො භොතො යඤ්ඤං අදින්නාදායිනො’පි අදින්නාදානා පටිවිරතා’පි -පෙ- කාමෙසු මිච්ඡාචාරිනො’පි කාමෙසු මිච්ඡාචාරා පටිවිරතාපි -පෙ- මුසාවාදිනො’පි මුසාවාදා පටිවිරතා’පි -පෙ- පිසුණවාචිනො’පි පිසුණාය වාචාය පටිවිරතා’පි -පෙ- ඵරුසවාචිනො’පි ඵරුසාය වාචාය පටිවිරතා’පි -පෙ- සම්ඵප්පලාපිනො’පි සම්ඵප්පලාපා පටිවිරතා’පි -පෙ- අභිජ්ඣාලුනො’පි අනභිජ්ඣාලුනො’පි -පෙ- බ්යාපන්නචිත්තා’පි අබ්යාපන්නචිත්තා’පි -පෙ- මිච්ඡාදිට්ඨිකා’පි සම්මාදිට්ඨිකා’පි. යෙ තත්ථ මිච්ඡාදිට්ඨිකා, තෙසඤ්ඤෙව තෙන. යෙ තත්ථ සම්මාදිට්ඨිකා, තෙ යජතං භවං, සජ්ජතං භවං, මොදතං භවං. චිත්තමෙව භවං අන්තරං පසාදෙතූ”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො බ්රාහ්මණ පුරොහිතො බ්රාහ්මණො රඤ්ඤො මහාවිජිතස්ස පුබ්බෙව යඤ්ඤා දසහාකාරෙහි පටිග්ගාහකෙසු විප්පටිසාරං පටිවිනොදෙසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "19. අථ ඛො බ්රාහ්මණ, පුරොහිතො බ්රාහ්මණො රඤ්ඤො මහාවිජිතස්ස මහායඤ්ඤං යජමානස්ස සොළසහාකාරෙහි චිත්තං සන්දස්සෙසි සමාදපෙසි සමුත්තෙජෙසි සම්පහංසෙසි: සියා ඛො පන භොතො රඤ්ඤො මහායඤ්ඤං යජමානස්ස කොචිදෙව වත්තා: “රාජා ඛො මහාවිජිතො මහායඤ්ඤං යජති. නො ච ඛො තස්ස ආමන්තිතා ඛත්තියා අනුයුත්තා නෙගමා චෙව ජානපදා ච. අථ ච පන භවං රාජා එවරූපං මහායඤ්ඤං යජතී”ති. එවම්පි භොතො රඤ්ඤො වත්තා ධම්මතො නත්ථි. භොතා ඛො පන රඤ්ඤා ආමන්තිතා ඛත්තියා අනුයුත්තා නෙගමා චෙව ජානපදා ච."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "17. බමුණ, ඉක්බිත්තෙන් පෙරෙවි බමුණු තෙමේ යඥයෙන් පෙරාතුව ම මහාවිජිත රජුට තුන් විධාවන් දැක්වී ය: ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "“මහා යාගයක් යජනු කැමැති පින්වත් රජහට “අහෝ! මා සතු භෝග රැසක් මතු නැසෙතැ’යි කිසි විපිළිසරක් විය හැක්ක. පින්වත් රජුහු විසින් එසේ වූ විපිළිසරක් නො කටයුතුය. මහා යාගයක් යජන පින්වත් රජුට ‘අහෝ මා සතු මහත් භෝග රැසක් දැන් නැසෙතැ’යි කිසි විපිළිසරක් වියැ හැක්ක. පින්වත් රජු විසින් එසේ වූ විපිළිසරක් නො කටයුත්තේ ය. මහායාගය යැජූ පින්වත් රජුට ‘අහෝ මා සතු මහත් භෝග රැසක් නැසී ගියේ වනැ’යි විපිළිසරක් වියැ හැක්ක. පින්වත් රජුහු විසින් එසේ වූ විපිළිසරක් නොකටයුත්තේ ය.”"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, පෙරෙවි බමුණු තෙමේ යඥයෙන් පෙරාතු ව ම මහාවිජිත රජුට මේ තුන් විධාවන් දෙසී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "18. බමුණ, ඉක්බිත්තෙන් පෙරෙවි බමුණු තෙම මහාවිජිත රජුට යඥයෙන් පෙරාතු ව ම දන් පිළිගන්නවුන් කෙරෙහි විපිළිසර දස අයුරෙකිත් දුරැ ලී ය. (ඒ මෙසේ ය:) “පින්වත්හුගේ යඥයට පණිවා කරන්නෝ ද පණිවායෙන් වැළැකුණෝ ද එන්නාහු ම ය. ඔවුන් අතුරෙහි යම් කෙනෙක් පණිවා කරන්නෝ නම් එයින් වරද ඔවුනට ම ය. ඔවුන් අතුරෙහි යම් කෙනෙක් පණිවායෙන් වැළැක්කෝ නම් භවත් තෙමේ ඔවුත් ඇරැබැ යජා වා. භවත් තෙමේ ඔවුන් ඇරැබැ පරිත්‍යාග කෙරේවා. භවත් තෙමේ සතුටු වේ වා. භවත් තෙමේ ඇතුළත සිත ම පහදා වා. පින්වත්හුගේ යඥයට අයිනාදන් කරන්නෝ ද අයිනාදනින් වැළැක්කෝ ද, … කාමයන්හි වරදවා හැසිරෙන්නෝ ද එයින් වැළැක්කෝ ද … මුසවා කියන්නෝ ද එයින් වැළැක්කෝ ද … පෙහෙසුන් තෙපලන්නෝ ද එයින් වැළැක්කෝ ද … පරොස්බස් බණින්නෝ ද එයින් වැළැක්කෝ ද … බොල් බස් දොඩන්නෝ ද එයින් වැළැක්කෝ ද … දැඩි ලොහොබියෝ ද දැඩිලොහොබි නොවන්නෝ ද … ද්වේෂ සහිත සිතැත්තෝ ද එබඳු සිත් නැත්තෝ ද … මිසදිටුවෝ ද සම්දිටුවෝ ද එන්නාහු ම ය. ඔවුනතුරෙහි යම් කෙනෙක් මිසදිටු ගතුවෝ නම් එයින් අවැඩ ඔවුනට ම ය. ඔවුනතුරෙහි යම් කෙනෙක් සම්දිටුහු නම් ඔවුන් අරමුණු කොට පින්වත් තෙමේ යාගය කෙරේ වා. පින්වත් තෙමේ සතුටු වේ වා. ඇතුළත සිත ම පින්වත් තෙමේ පහදා වා”යනු යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, පෙරෙවි බමුණු තෙමේ මහාවිජිත රජුට යාගයෙන් පෙරාතු ව ම මේ දසඅයුරින් යාග පිළිගන්නවුන් කෙරේ (වියැ හැකි) විපිළිසර දුරැ ලී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "19. බමුණ, ඉක්බිති පෙරෙවි බමුණු තෙම මහායඥය යජන මහාවිජිත රජුගේ සිතට සොළොස් අයුරෙකින් කරුණු දැක්වී ය, කරැණු ගැන්වී ය, එහි සිත තියුණු කෙළේ ය, එහි සිත තුටුපහටු කෙළේ ය. (ඒ මෙසේ ය:) “මහායඥයක් යජන පින්වත් රජහට ‘මහා විජිත රජ වනාහි මහායඥයක් යජයි. එහෙත් ඔහු විසින් නියම්ගම්වැසි වූ ද දනවුවැසි වූ ද අනුයුක්ත ක්‍ෂත්‍රියයෝ නො ම කැඳවන ලද්දාහ. එතෙකුදු වුවත් රජ තෙමේ මෙ බඳු මහායඥයක් යජා’යැ යි මෙසේ කියන්නකු ඇති වියැ හැකි ද, පින්වත් රජුට දහම් නයින් එසේ කියන්නෙක් නැත. (කවර හෙයින? යත්:) පින්වත් රජුහු විසින් නියම්ගම් වැසි වූ ද දනවුවැසි වූ ද අනුයුක්ත ක්‍ෂත්‍රියයෝ කැඳවන ලද්දාහ. (එ හෙයිනි).",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 270,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉමිනාපෙතං භවං රාජා ජානාතු. යජතං භවං, සජ්ජතං භවං, මොදතං භවං, චිත්තමෙව භවං අන්තරං පසාදෙතු."
                    },
                    {
                        "type": "paragraph",
                        "text": "20. සියා ඛො පන භොතො රඤ්ඤො මහායඤ්ඤං යජමානස්ස කොචිදෙව වත්තා ‘රාජා ඛො මහාවිජිතො මහායඤ්ඤං යජති, නො ච ඛො තස්ස ආමන්තිතා අමච්චා පාරිසජ්ජා නෙගමා චෙව ජානපදා ච -පෙ- බ්රාහ්මණමහාසාලා නෙගමා චෙව ජානපදා ච -පෙ- ගහපතිනෙචයිකා නෙගමා චෙව ජානපදා ච. අථ ච පන භවං රාජා එවරූපං මහායඤ්ඤං යජතී’ති. එවම්පි භොතො රඤ්ඤො වත්තා ධම්මතො නත්ථි. භොතා ඛො පන රඤ්ඤා ආමන්තිතා ගහපතිනෙචයිකා නෙගමා චෙව ජානපදා ච. ඉමිනාපෙතං භවං රාජා ජානාතු. යජතං භවං, සජ්ජතං භවං, මොදතං භවං, චිත්තමෙව භවං අන්තරං පසාදෙතු."
                    },
                    {
                        "type": "paragraph",
                        "text": "21. සියා ඛො පන භොතො රඤ්ඤො මහායඤ්ඤං යජමානස්ස කොචිදෙව වත්තා ‘රාජා ඛො මහාවිජිතො මහායඤ්ඤං යජති. නො ච ඛො උභතො සුජාතො මාතිතො ච පිතිතො ච, සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා, අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන. අථ ච පන භවං රාජා එවරූපං මහායඤ්ඤං යජතී’ති. එවම්පි භොතො රඤ්ඤො වත්තා ධම්මතො නත්ථි. භවං ඛො පන රාජා උභතො සුජාතො මාතිතො ච පිතිතො ච, සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා, අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන. ඉමිනාපෙතං භවං රාජා ජානාතු. යජතං භවං, සජ්ජතං භවං, මොදතං භවං, චිත්තමෙව භවං අන්තරං පසාදෙතු."
                    },
                    {
                        "type": "paragraph",
                        "text": "22. සියා ඛො පන භොතො රඤ්ඤො මහායඤ්ඤං යජමානස්ස කොචිදෙව වත්තා ‘රාජා ඛො මහාවිජිතො මහායඤ්ඤං යජති. නො ච ඛො අභිරූපො දස්සනීයො පාසාදිකො පරමාය වණ්ණපොක්ඛරතාය සමන්නාගතො බ්රහ්මවණ්ණී බ්රහ්මවච්චසී අඛුද්දාවකාසො දස්සනාය -පෙ- නො ච ඛො අඩ්ඪො මහද්ධනො මහාභොගො පහූතජාතරූපරජතො පහූතවිත්තූපකරණො පහූතධනධඤ්ඤො පරිපුණ්ණකොසකොට්ඨාගාරො -පෙ- නො ච ඛො බලවා චතුරඞ්ගිනියා සෙනාය සමන්නාගතො අස්සවාය ඔවාදපටිකරාය පතපති මඤ්ඤෙ පච්චත්ථිකෙ යසසා -පෙ- නො ච ඛො සද්ධො දායකො දානපති අනා__ව__ටද්වාරො සමණබ්රාහ්මණකපණද්ධිකවණිබ්බකයාචකානං ඔපානභූතො පුඤ්ඤානි කරොති -පෙ- නො ච ඛො බහුස්සුතො තස්ස තස්ස සුතජාතස්ස -පෙ- නො ච ඛො තස්ස තස්සෙව ඛො පන භාසිතස්ස අත්ථං ජානාති:"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "මේ කරුණින් ද, මෙය පින්වත් රජ තෙමේ දැන ගනී වා. පින්වත් තෙමේ යාගය කෙරේ වා, පින්වත් තෙමේ දන් දේ වා, පින්වත් තෙමේ යාගයට සතුටු වේ වා, පින්වත් තෙමේ ඇතුළත සිත පහදා වා.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "20. “මහාවිජිත රජ මහායාගයක් කරයි. එහෙත් ඔහු විසින් නියම්ගම්වැසි, දනවුවැසි පොහොසත් බමුණෝත් නො දන්වන ලදුහ. නියම්ගම්වැසි දනවුවැසි පොහොසත් ගැහැවියෝත් නො දන්වන ලදුහ. එතෙකුදු වුවත් ‘පින්වත් රජු මෙ බඳු මහා යාගයක් කරතැ යි මහා යාගයක් කරනු කැමැති පින්වත් රජුට කියන කිසිවෙක් ඇති විය හැක්කේ ද, පින්වත් රජුට කරුණු සහිත ව එසේ කියන්නෙක් නැත. පින්වත් රජුහු විසින් වනාහි නියම්ගම්වැසි දනවුවැසි සිය යහළුවෝත් අණ පිළිපදනා සෙස්සෝත් දන්වන ලදහ … පොහොසත් බමුණෝත් … පොහොසත් ගැහැවියෝත් දන්වන ලදුහ. මේ කාරණයෙනුත්, මෙය භවත් මහරජ තෙමේ දැනැ ගනී වා. පින්වත් තෙමේ යාගය කෙරේ වා, පින්වත් තෙමේ දානය දේ වා, පින්වත් තෙමේ සතුටු වේ වා, පින්වත් තෙමේ ඇතුළත සිත ම පහදා වා.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "21. ‘මහාවිජිත රජ තෙමේ මහායාගයක් කරයි. එහෙත් හේ මාපිය දෙපසින් අභිජාත නො වේ. සත් වන මීමුතු යුවල තෙක් පිරිසිදු මවු කුස ඇත්තේ නො වේ. ජාතිවාදයෙන් නො හෙළන ලද්දේ නො වේ. නො ගරහන ලද්දේ නො වේ. එහෙත් භවත් රජු මෙ බඳු මහ යාගයක් කරතැ’ යි මහායාගය කරන භවත් රජුට කියන කිසිවෙක් ඇති විය හැක්ක. එහෙත් භවත් රජහට කරුණු සහිත වැ එසේත් කියන්නෙක් නැත. පින්වත් රජ තෙමේ වූ කලි මා පිය දෙ පසින් අභිජාත ය, සත් වන මීමුතු යුවල තෙක් පිරිසිදු මවු කුස ඇත්තේ ය, ජාතිවාදයෙත් නො හෙළන ලද්දේ ය, නො ගරහන ලද්දේ ය. මේ කරුණිනුත් මෙය භවත් රජ තෙමේ දැනගනී වා. භවත් තෙමේ යාගය කෙරේ වා, භවත් තෙමේ දානය දේ වා, භවත් තෙමේ සතුටු වේ වා, භවත් තෙමේ ඇතුළත සිත ම පහදා වා.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "22. මහා යාගයක් යජනා පින්වත් රජහට “මහාවිජිත රජ වූ කලි මහා යාගයක් යදී. එහෙත් හේ මනා රූ ඇත්තේ නො වේ, දැකුම්කලු නො වේ. උතුම් පැහැ සපුයෙන් යුත් නො වේ. උතුම් පැහැ ඇත්තේ නො වේ. බඹහු වැනි කය ඇත්තේ නො වේ. දැක්මට මහත් ඔවස් ඇත්තේ නො වේ … ආඪ්‍ය ද නො වේ. මහත් ධන ඇත්තේ නො වේ. මහත් භෝග ඇත්තේ නො වේ. බොහෝ රන් රිදී ඇත්තේ නො වේ. බොහෝ වස්තූපකරණ ඇත්තේ නො වේ. බොහෝ ධනධාන්‍ය ඇත්තේ නො වේ. පිරිපුන් බඬුගුල් හා කොටුගුල් ඇත්තේ නො වේ … බසට කන් දෙන, ඔවා පිළිපදනා, බලවත් සිවුරඟ සෙනගින් සමන්විත නො වේ. සතුරන් සිය යසසින් තවතැ යි නො සිතම් … සැදැහැවත් දායකයෙක් දානපතියෙක් හළ දොරැත්තෙක් නො වෙයි. මහණ බමුණනට දුගියනට මගියනට යදිනට පුලනුනට සිවුමංහන්දියෙකැ පිහිටි ළිඳක් මෙන් වැ දන් පින් නො කෙරෙයි … ඒ ඒ ඇසූ දෑ පිළිබඳ ඇසූ පිරූ තැන් ඇත්තේ නො වෙයි … මේ මේ කියන ලද්දෙහි අරුත් ය, මේ මේ කියන ලද්දෙහි ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 272,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "‘අයං ඉමස්ස භාසිතස්ස අත්ථො අයං ඉමස්ස භාසිතස්ස අත්ථො’ති. -පෙ- නො ච ඛො පණ්ඩිතො වියත්තො මෙධාවී පටිබලො අතීතානාගතපච්චුප්පන්නෙ අත්ථෙ චින්තෙතුං -පෙ- අථ ච පන භවං රාජා එවරූපං මහායඤ්ඤං යජතී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවම්පි භොතො රඤ්ඤො වත්තා ධම්මතො නත්ථි. භවං ඛො පන රාජා -පෙ- පණ්ඩිතො වියත්තො මෙධාවී පටිබලො අතීතානාගතපච්චුප්පන්නෙ අත්ථෙ චින්තෙතුං. ඉමිනාපෙතං භවං රාජා ජානාතු. යජතං භවං, සජ්ජතං භවං, මොදතං භවං, චිත්තමෙව භවං අන්තරං පසාදෙතු."
                    },
                    {
                        "type": "paragraph",
                        "text": "23. සියා ඛො පන භොතො රඤ්ඤො මහායඤ්ඤං යජමානස්ස කොචිදෙව වත්තා: ‘රාජා ඛො මහාවිජිතො මහායඤ්ඤං යජති. නො ච ඛ්වස්ස පුරොහිතො බ්රාහ්මණො උභතො සුජාතො මාතිතො ච පිතිතො ච සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා. අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන. අථ ච පන භවං රාජා එවරූපං මහායඤ්ඤං යජතී’ති. එවම්පි භොතො රඤ්ඤො වත්තා ධම්මතො නත්ථි. භොතො ඛො පන රඤ්ඤො පුරොහිතො බ්රාහ්මණො උභතො සුජාතො මාතිතො ච පිතිතො ච සංසුද්ධගහණිකො යාව සත්තමා පිතාමහයුගා, අක්ඛිත්තො අනුපක්කුට්ඨො ජාතිවාදෙන. ඉමිනාපෙතං භවං රාජා ජානාතු. යජතං භවං, සජ්ජතං භවං, මොදතං භවං, චිත්තමෙව භවං අන්තරං පසාදෙතු."
                    },
                    {
                        "type": "paragraph",
                        "text": "24. සියා ඛො පන භොතො රඤ්ඤො මහායඤ්ඤං යජමානස්ස කොචිදෙව වත්තා ‘රාජා ඛො මහාවිජිතො මහායඤ්ඤං යජති. නො ච ඛ්වස්ස පුරොහිතො බ්රාහ්මණො අජ්ඣායකො මන්තධරො තිණ්ණං වෙදානං පාරගූ සනිඝණ්ඩුකෙටුභානං සාක්ඛරප්පභෙදානං ඉතිහාසපඤ්චමානං පදකො වෙය්යාකරණො ලොකායතමහාපුරිසලක්ඛණෙසු අනවයො -පෙ- "
                    },
                    {
                        "type": "paragraph",
                        "text": "නො ච ඛ්වස්ස පුරොහිතො බ්රාහ්මණො සීලවා වුද්ධසීලී වුද්ධසීලෙන සමන්නාගතො -පෙ- "
                    },
                    {
                        "type": "paragraph",
                        "text": "නො ච ඛ්වස්ස පුරොහිතො බ්රාහ්මණො පණ්ඩිතො වියත්තො මෙධාවී පඨමො වා දුතියො වා සුජං පග්ගණ්හන්තානං. අථ ච පන භවං රාජා එවරූපං මහායඤ්ඤං යජතී’ති. එවම්පි භොතො රඤ්ඤො වත්තා ධම්මතො නත්ථි."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අරුත් යැ යි ඒ ඒ භාෂිතයේ අරුත් නො දනී … පණ්ඩිත ද ව්‍යක්ත ද නුවණැති ද අයුනාවත්මන් දෑ සිතනු සමත් ද නො වේ … එහෙත් භවත් රජු මේ බඳු මහා යඥයක් යජතැ”යී මෙසේ දොස් කියන්නකු වියැ හැක්කේ ද, පින්වත් රජුහට එසේ කරුණූ සහිත වැ කියන්නෙක් නම් නැත."
                    },
                    {
                        "format": 13,
                        "text": "පින්වත් රජ තෙමේ වනාහි … පණ්ඩිත ය, ව්‍යක්ත ය, නුවණැත්තේ ය. අයුනාවත්මන්හි අරුත් සිතන්නට සමත් ය. මේ කරුණින් ද පින්වත් රජ තෙමේ (යඥයට කලැ යි) මෙය දනී වා. පින්වත් තෙමේ යඥය කෙරේ වා. පින්වත් තෙමේ දානය දේ වා. පින්වත් තෙමේ (ස්වකීය යඥයෙහි) සතුටු වේ වා, පින්වත් තෙමේ සිත ඇතුළත පැහැදැවීම ම කෙරේ වා.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "23. මහා යඥයක් යජනා පින්වත් රජුට “මහාවිජිත රජ වනාහි මහා යඥයක් කරයි. එහෙත් ඔහු පෙරවි බමුණු තෙමේ මාපිය දෙපසින් පිරිසිදු උපත ඇතියෙක් නො වේ. සත් වන මීමුතු යුවල තෙක් පිරිසිදු මවුකුස ඇතියෙක් නො වේ. ජාතිවාදයෙන් බැහැර නොකරත ලදුයෙක්, නොගරහන ලදුයෙක් නො වේ. එතෙකුදු වුවත් පින්වත් රජු මෙ බඳු මහායඥයක් කරතැ”යි කියන කිසිවකු ඇති විය හැකි වතොත්, පින්වත් රජුට කරුණු සහිත වැ එසේ කියන්නෙක් නම් නැත. පින්වත් රජුහුගේ පෙරෙවි බමුණු තෙමේ මවු පසින් ද පිය පසින් ද යන දෙ පසින් ම පිරිසිදු උපත ඇතියෙක් ය. සත්වන මීමුතු යුවල තෙක් පිරිසිදු මවු කුස ඇතියෙක් ය. ජාතිවාදයෙන් බැහැරැ නො කැරුණෙක් ය. ගැරැහුම් නොලදුයෙක් ය. මෙ කරුණින් ද පින්වත් රජ තෙමේ (යඥයට කලැ යි) මෙය දනී වා. පින්වත් තෙමේ යඥය කෙරේ වා. පින්වත් තෙමේ යාගය කෙරේ වා. පින්වත් තෙමේ ස්වකීය යඥයෙහි සතුටු වේ වා. පින්වත් තෙමේ සිත ඇතුළත පැහැදීම ම කෙරේ වා.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "24. මහා යඥයක් කරන පින්වත් රජුට, “මහාවිජිත රජ වනාහි මහා යඥයක් කෙරෙයි. එහෙත් ඔහු පෙරෙවි බමුණු තෙමේ වේද හදාරන්නෙක්, වේදය සිතැ දරන්නෙක්, නිඝණ්ටු කෙටුභශාස්ත්‍ර සහිත, අක්‍ෂරප්‍රභේද සහිත, ඉතිහාසය පස්වනු කොටැති තුන් වේදයන්හි පරතෙරට ගියෙක් නො වේ යැ යි ද, පද දන්නෙක්, වියරණෙහි නිපුනයෙක්, ලෝකායත ශාස්ත්‍රයෙහිත් මහාපුරුෂලක්‍ෂණ ශාස්ත්‍රයෙහිත් අනූනයෙක් නො වේ යැ යී ද ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඔහු පෙරෙවි බමුණා සිල්වතෙක්, වැඩුණු සිල් ඇත්තෙක්, වැඩුණු ශීලයෙන් සමන්විතයෙක් නො වේ යැ යි ද ...",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඔහු පෙරෙවි බමුණා පණ්ඩිත ද නො වේ යැ යි, ව්‍යක්ත ද නො වේ යැ යි, නූවණැති ද නො වේ යැ යි, හෝම සැන්ද ඔසොවන්නවුන් ගෙන් පළමු වැන්නා හෝ දෙවැන්නා හෝ නො වේ යැ යි, එතෙකුදු වුවත් පින්වත් මගරජ මෙ බඳු මහා යඥයක් කෙරේ යැ’යි ද කියන කිසිවකු ඇති විය හැක්ක. එහෙත් කරුණු සහිත වැ එසේ කියන්නෙක් නම් නැත.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 274,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "භොතො ඛො පන රඤ්ඤො පුරොහිතො බ්රාහ්මණො පණ්ඩිතො වියත්තො මෙධාවී පඨමො වා දුතියො වා සුජම්පග්ගණ්හන්තානං. ඉමිනා පෙතං භවං රාජා ජානාතු. යජතං භවං, සජ්ජතං භවං, මොදතං භවං, චිත්තමෙව භවං අන්තරං පසාදෙතූ’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො බ්රාහ්මණ, පුරොහිතො බ්රාහ්මණො රඤ්ඤො මහාවිජිතස්ස මහායඤ්ඤං යජමානස්ස සොළසහි ආකාරෙහි චිත්තං සන්දස්සෙසි, සමාදපෙසි, සමුත්තෙජෙසි, සම්පහංසෙසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "25. තස්මිං ඛො බ්රාහ්මණ යඤ්ඤෙ නෙව ගාවො හඤ්ඤිංසු, න අජෙළකා හඤ්ඤිංසු, න කුක්කුටසූකරා හඤ්ඤිංසු, න විවිධා පාණා සංඝාතං ආපජ්ජිංසු, න රුක්ඛා ඡිජ්ජිංසු{1} යූපත්ථාය, න දබ්බා ලූයිංසු බරිහිසත්ථාය.{2} යෙ’පි’ස්ස අහෙසුං දාසා’ති වා පෙස්සා’ති වා කම්මකරා’ති වා, තෙ’පි න දණ්ඩතජ්ජිතා න භයතජ්ජිතා න අස්සුමුඛා රුදමානා පරිකම්මානි අකංසු. අථ ඛො යෙ ඉච්ඡිංසු, තෙ අකංසු. යෙ න ඉච්ඡිංසු, න තෙ අකංසු. යං ඉච්ඡිංසු, තං අකංසු. යං න ඉච්ඡිංසු, න තං අකංසු. සප්පිතෙලනවනීතදධිමධුඵාණිතෙන චෙව සො යඤ්ඤො නිට්ඨානමගමාසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "26. අථ ඛො බ්රාහ්මණ ඛත්තියා අනුයුත්තා නෙගමා චෙව ජානපදා ච අමච්චා පාරිසජ්ජා නෙගමා චෙව ජානපදා ච, බ්රාහ්මණමහාසාලා නෙගමා __චෙව__ ජානපදා ච, ගහපතිනෙචයිකා නෙගමා චෙව ජානපදා ච පහූතං සාපතෙය්යං ආදාය රාජානං මහාවිජිතං උපසඞ්කමිත්වා එවමාහංසු: “ඉදං දෙව පහූතං සාපතෙය්යං දෙවඤ්ඤෙව උද්දිස්ස ආභතං. තං දෙවො පතිගණ්හාතූ”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අලං භො. මමපි ඉදං පහූතං සාපතෙය්යං ධම්මිකෙන බලිනා අභිසඞ්ඛතං. තඤ්ච වො හොතු ඉතො ච භිය්යො හරථා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "27. තෙ රඤ්ඤා පටික්ඛිත්තා එකමන්තං අපක්කම්ම එවං සම්මන්තෙසුං: “න ඛො එතං අම්හාකං පතිරූපං යං මයං ඉමානි සාපතෙය්යානි පුනදෙව සකානි ඝරානි පටිහරෙය්යාම. රාජා ඛො මහාවිජිතො මහායඤ්ඤං යජති. හන්දස්ස මයං අනුයාගිනො හොමා”ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. රුක්ඛෙ ඡින්දිංසු - කත්ථචි"
                    },
                    {
                        "type": "footnote",
                        "text": "2. පරිහිංසත්ථාය - කත්ථචි"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "පින්වත් රජුගේ පෙරෙවි බමුණා වනාහි පණ්ඩිත ය, ව්‍යක්ත ය, නුවණැත්තේ ය. හෝම සැන්ද ඔසොවන්නන් අතුරෙහි පළමු වැන්නා හෝ දෙවැන්නා ය. පින්වත් රජ තෙමේ මෙයිනුත් (යඥයට කාලය යැ යි) මෙය දනී වා. පින්වත් තෙමේ යාගය කෙරේ වා. පින්වත් තෙමේ යාගයෙහි සතුටු වේ වා. පින්වත් තෙමේ සිත ඇතුළත පැහැදීම ම කෙරේ වා”.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, ඒ පෙරෙවි බමුණා මහා යාගයක් කරන්නට සැරැසෙන මහාවිජිත රජුහුගේ සිත මේ සොළොස් අයුරින් කරුණු දක්වා මෙහෙයී ය, සිතට ගැන්වී ය, සිත උනන්දු කෙළේ ය, පැසැසීමෙන් සිත සතුටු කෙළේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "25. ඒ යාගයෙහි වූ කලි ගෙරීහු නො මරන ලදහ. එළුතිරෙළුවෝ නො මරන ලදහ. කුකුළෝ හූරෝ නො මරන ලදහ. නොයෙක් ලිහිණි ඈ සත්තු වනසට නො පැමිණියහ. යාග කණු පිණිස රුක්හු නො සිඳින ලදහ. යාගශාලාව පිරිකෙවීම පිණිස හෝ යාග බිමැ ඇතිරීම පිණිස කුස තණ නො සිඳින ලද්දේ ය. ඔහුගේ දාසයෝ යී හෝ මෙහෙකරුවෝ යී හෝ කම්කරුවෝ යී කියන ලද යම් කෙනෙක් වූහු නම්, ඔහුත් දඬු ගැන්මෙන් නො තෙජනු ලදුවෝ, බිය දැනැවීමෙන් නො තෙජනු ලදුවෝ, කඳුළෙන් තෙමුණු මුහුනු ඈති වැ නො ම හඬනුවෝ, (පිය බසින් ම මෙහෙයුණෝ) කටයුතු දෑ කළහ. වැලි දු යම් කෙනෙක් කැමැත්තෝ නම්, ඔහු එහි කටයුතු දැය කළහ. යම් කෙනෙක් නොකැමැත්තෝ තම්, ඔහු එය නො කළහ ... ගිතෙල් තලතෙල් වෙඬරු දිහි මී සකුරින් මුසු වූ කැඳ බත් ආදියෙන් ම ඒ යඥය නිමාවට පැමිණයේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "26. එ කල්හි නියම්ගම්වැසි වූත් දනවුවැසි වූත් එ රජුගේ කටයුතුවලැ යෙදී වසන බමුණෝ ද ක්‍ෂත්‍රියයෝ ද, නියම්ගම්වැසි වූත් දනවුවැසි වූත් ඇමැත්තෝ ද පිරිස්වැස්සෝ ද, නියම්ගම්වැසි වූත් දනවුවැසි වූත් බමුණු මහසල්කුල වැස්සෝ ද, නියම්ගම්වැසි වූත් දනවුවැසි වූත් ගැහැවි මහසල්කුල වැස්සෝ ද බොහෝ ධනය (ගැල් පුරා) නඟා ගෙන මහාවිජිත රජු කරා එළැඹ, “දේවයන් වහන්ස, මේ බොහෝ ධනය දේවයන් වහන්සේ ම උදෙසා ගෙනෙන ලද්දේ ය. එය දේවයන් වහන්සේ පිළිගන්නා සේක් වා”යී මෙසේ කීහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(එයසා,) “පින්වත්නි, (තොප ධනයෙන්) කම් නැත. මගේ ද දැහැමි කරවුවරින් රැස් කළ මේ බොහෝ ධනය ඇත්තේ ය. (එ බැවින් තොප ගෙනා) ඒ ධනයත් තොපට ම වේ වා. මොබිනුත් තවත් ගෙන යවු”යී රජ කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "27. ඔහු රජු විසින් නොගිවිස්නා ලද්දෝ එක් පැත්තකට ගොස්, “මේ ධන නැවැත අප ගෙවලට ගෙනැ යෑම අපට නො හොබනේ ය. මහාවිජිත රජු වූ කලී මහා යාගයක් කෙරෙයි. එ බැවින් අපි ඔහුට අනුයාග කරන්නමෝ වමු”යී මෙසේ කතා කැරැ ගත්හ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 276,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො බ්රාහ්මණ පුරත්ථිමෙන යඤ්ඤාවාටස්ස ඛත්තියා අනුයුත්තා නෙගමා චෙව ජානපදා ච දානානි පට්ඨපෙසුං. දක්ඛිණෙන යඤ්ඤාවාටස්ස අමච්චා පාරිසජ්ජා නෙගමා චෙව ජානපදා ච දානානි පට්ඨපෙසුං. පච්ඡිමෙන යඤ්ඤාවාටස්ස බ්රාහ්මණමහාසාලා නෙගමා චෙව ජානපදා ච දානානි පට්ඨපෙසුං. උත්තරෙන යඤ්ඤාවාටස්ස ගහපතිනෙචයිකා නෙගමා චෙව ජානපදා ච දානානි පට්ඨපෙසුං. "
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙසු’පි ඛො බ්රාහ්මණ යඤ්ඤෙසු නෙව ගාවො හඤ්ඤිංසු, න අජෙළකා හඤ්ඤිංසු, න කුක්කුටසූකරා හඤ්ඤිංසු, න විවිධා පාණා සංඝාතං ආපජ්ජිංසු, න රුක්ඛා __ඡි__ජ්ජිංසු යූපත්ථාය, න දබ්බා ලූයිංසු බරිහිසත්ථාය. යෙ’පි නෙසං අහෙසුං දාසා’ති වා පෙස්සා’ති වා කම්මකරා’ති වා, තෙ’පි න දණ්ඩතජ්ජිතා න භයතජ්ජිතා න අස්සුමුඛා රුදමානා පරිකම්මානි අකංසු. අථ ඛො යෙ ඉච්ඡිංසු, තෙ අකංසු. යෙ න ඉච්ඡිංසු, න තෙ අකංසු. යං ඉච්ඡිංසු, තං අකංසු, යං න ඉච්ඡිංසු, න තං අකංසු. සප්පිතෙලනවනීතදධිමධුඵාණිතෙන චෙව තෙ යඤ්ඤා නිට්ඨානමගමංසු."
                    },
                    {
                        "type": "paragraph",
                        "text": "28. ඉති චත්තාරො ච අනුමතිපක්ඛා, රාජා මහාවිජිතො අට්ඨහඞ්ගෙහි සමන්නාගතො, පුරොහිතො බ්රාහ්මණො චතූහඞ්ගෙහි සමන්නාගතො, තිස්සො ච විධා. අයං වුච්චති බ්රාහ්මණ තිවිධා යඤ්ඤසම්පදා සොළසපරික්ඛාරා’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "29. එවං වුත්තෙ, තෙ බ්රාහ්මණා උන්නාදිනො උච්චාසද්දමහාසද්දා අහෙසුං: “අහො යඤ්ඤො, අහො යඤ්ඤසම්පදා”ති. කූටදන්තො පන බ්රාහ්මණො තූණ්හීභූතො’ව නිසින්නො හොති. අථ ඛො තෙ බ්රාහ්මණා කූටදන්තං බ්රාහ්මණං එතදවොචුං: කස්මා පන භවං කූටදන්තො සමණස්ස ගොතමස්ස සුභාසිතං සුභාසිතතො නාබ්භනුමොදතී? ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නාහං භො සමණස්ස ගොතමස්ස සුභාසිතං සුභාසිතතො නාබ්භනුමොදාමි. මුද්ධාපි තස්ස විපතෙය්ය, යො සමණස්ස ගොතමස්ස සුභාසිතං සුභාසිතතො නාබ්භනුමොදෙය්ය. අපි ච මෙ භො එවං හොති: න සමණො ගොතමො එවමාහ: ‘එවං මෙ සුතන්ති වා එවං අරහති භවිතුන්ති’ වා. අපි ච සමණො ගොතමො: ‘එවං තදා ආසි ඉත්ථං තදා ආසි’ත්වෙව භාසති. තස්ස මය්හං භො එවං හොති: “අද්ධා සමණො ගොතමො තෙන සමයෙන රාජා වා අහොසි මහාවිජිතො යඤ්ඤසාමි, පුරොහිතො වා බ්රාහ්මණො තස්ස යඤ්ඤස්ස යාජෙතා’ති. අභිජානාති පන භවං ගොතමො එවරූපං යඤ්ඤං යජිත්වා වා යාජෙත්වා වා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජිතා?”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "බමුණ, ඉක්බිති (රජුගේ) දන්හලට පැදුම් දිගැ නිගම්වැසි වූත් දනවුවැසි වූත් රාජසේවක ක්‍ෂත්‍රියයෝ දන් (හල්) පිහිටුවූහ. රජුගේ දන්හලට දකුණු දිගැ නිගම්වැසි වූත් ජනවුවැසි වූත් ඇමැත්තෝත් පිරිස්වැස්සෝත් දන් (හල්) පිහිටුවූහ. (රජුගේ) දන්හලට පැසිම් දිගැ නිගම්වැසි වූත් ජනවුවැසි වූත් බමුණුමහසල්වැසියෝ දන් (හල්) පිහිටුවුහ. (රජුගේ) දන්හලට උතුරු දිගැ නිගම්වැසිවූත් ජනවුවැසි වූත් ගැහැවි මහසල් වැසියෝ දන් (හල්) පිහිටුවූහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, ඒ යාගයන්හි (දානයන්හි) ද ‍ගෙරිහු නො ම මරන ලදහ. එළුතිරෙළුවෝ නො ම මරණ ලදහ. කුකුළෝත් නො ම මරණ ලදහ. නන් සත්තු මරණයට නො පැමිණියහ. යාග සඳහා රුක්හු නො ම සිඳුනා ලදහ. වනමල් අවුණා මල් දම් කොටැ දන්හල වටා ලනු පිණිසත් හිඳ ගන්නට යාග බිමැ අතුරනු පිණිසත් කුස තණ නො ම සිඳුනා ලද්දේ ය. ඔවුන්ගේ දාසයෝ යී හෝ මෙහෙකරුවෝ යී හෝ කම්කරුවෝ යී කියන ලද යම් කෙනෙක් වූහු නම්, ඔහු දු දඬුයෙත් තෙජතා ලදුවෝ හෝ බිය දැනැවීමෙන් තෙජනා ලදුවෝ හෝ කඳුළු මුසු මුහුනැති වැ හඬන්නෝ හෝ එහි කටයුතු නො කළහ. වැලි කටයුතු කරනු කැමැතියෝ ම කටයුතු කළහ. නොකැමැතියෝ නො ම කළහ. ඒ යඥයෝ (දානයෝ) ගිතෙල් තලතෙල් වෙඬරු දිහි මී සකුරෙන් හා කැඳ බත් ආදියෙන් ම නිමාවට ගියහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "28. බමුණ, මෙසේ යාගය කිරිමට අනුමතිය දුන් පක්‍ෂ සතර ද, අටඟින් යුත් මහාවිජිත රජ ද, සිවුරඟින් යුත් පෙරෙවි බමුණා ද, තර ව පිහිටියැ යුතු තුන් තැන් ද යන මොහු තුන් වැදෑරුම් යාග සම්පතුත් සොළොස් යාග පිරිකරත් ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "29. භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ කල්හි, ඒ බමුණෝ “යාග නම් මෙසේ වුව මැනව, යාගසම්පත් නම් මේ මැ යැ”යි ගුගුරන්නෝ උස් හඬ ඇත්තෝ, මහහඬ ඇත්තෝ වූහ. කුළුදත් බමුණු වනාහි නිහඬ ව ම උන්නේ වෙයි. එ කලැ ඒ බමුණෝ කුළුදත් බමුණාට “පින්වත් කුළුදත් තෙමේ කවර හෙයින් මහණ ගොයුමාණන්ගේ සුබැසිය සුබැසි විසින් නො අනුමොවී දැ?”යී කීහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“මම් මහණ ගොයුමන් වහන්සේගේ සුබැසිය සුබැසි විසින් නොඅනුමෙවුනෙම් නො වෙමි. යමෙක් මහණ ගොයුමන් වහන්සේගේ සුබැසිය සුබැසි විසින් නො අනුමෙවුනේ වී තම්, ඔහු හිස ගිලි හෙන්නේ ය. වැලි ‘මා විසින් මෙය ඇසිණැ’ යී හෝ ‘මෙසේ වියැ යුතු යැ’ යී හෝ මහණ ගොයුමන් වහන්සේ මෙසේ නො වදාළ සේක. එහෙත් උන් වහන්සේ ‘එදා මෙසේ වී ය. එදා මෙ පරිද්දෙන් වී යැ’ යී ම වදාරන සේක. භවත්නි, ඒ මට ‘ඒකාන්තයෙන් මහණ ගොයුමන් වහන්සේ එ කලැ යාගස්වාමි වූ මහාවිජිත රජ හෝ වුව මැනැව, ඔහු යාගය කැරැවූ පෙරෙවි බමුණා හෝ වුව මැනැවැ’යී මෙසේ සිතෙක් වෙයි. පින්වත් ගොයුමාණන් මහත්සේ ‘මෙ බඳු යඥයක් යැද හෝ යදවා (දනක් දී හෝ දෙවා) කාබුන් මරණින් මතු මනා ගති ඇති සඟ ලොවට පැමිණෙන්නේ යැ’යි පිළින කරන සේක් දැ?”යී කුළුදත් බමුණු කී ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 278,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“අභිජානාමහං බ්රාහ්මණ එවරූපං යඤ්ඤං යජිත්වා වා යාජෙත්වා වා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජිතා. අහං තෙන සමයෙන පුරොහිතො බ්රාහ්මණො අහොසිං තස්ස යඤ්ඤස්ස යාජෙතා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "30. “අත්ථි පන භො ගොතම අඤ්ඤො යඤ්ඤො ඉමාය තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය අප්පට්ටතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො චා?” ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අත්ථි ඛො බ්රාහ්මණ අඤ්ඤො යඤ්ඤො ඉමාය තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය අප්පට්ටතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො චා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "31. කතමො පන සො භො ගොතම යඤ්ඤො ඉමාය තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය අප්පට්ටතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො චා?” ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යානි ඛො පන තානි බ්රාහ්මණ නිච්චදානානි අනුකූලයඤ්ඤානි සීලවන්තෙ පබ්බජිතෙ උද්දිස්ස දීයන්ති, අයං ඛො බ්රාහ්මණ යඤ්ඤො ඉමාය තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය අප්පට්ටතරො{1} ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො චා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "32. කො නු ඛො භො ගොතම හෙතු කො පච්චයො යෙන තං නිච්චදානං අනුකූලයඤ්ඤං ඉමාය තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය අප්පට්ටතරඤ්ච අප්පසමාරම්භතරඤ්ච මහප්ඵලතරඤ්ච මහානිසංසතරඤ්චා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "න ඛො බ්රාහ්මණ එවරූපං යඤ්ඤං උපසඞ්කමන්ති අරහන්තො වා අරහත්තමග්ගං වා සමාපන්නා. තං කිස්ස හෙතු? දිස්සන්ති හෙත්ථ බ්රාහ්මණ දණ්ඩප්පහාරා’පි ගලග්ගහා’පි. තස්මා එවරූපං යඤ්ඤං න උපසඞ්කමන්ති අරහන්තො වා අරහත්තමග්ගං වා සමාපන්නා. යානි ඛො පන තානි බ්රාහ්මණ නිච්චදානානි අනුකූලයඤ්ඤානි සීලවන්තෙ පබ්බජිතෙ උද්දිස්ස දීයන්ති, එවරූපං ඛො බ්රාහ්මණ යඤ්ඤං උපසඞ්කමන්ති අරහන්තො වා අරහත්තමග්ගං වා සමාපන්නා. තං කිස්ස හෙතු? න හෙත්ථ බ්රාහ්මණ දිස්සන්ති දණ්ඩප්පහාරාපි ගලග්ගාහාපි. තස්මා එවරූපං යඤ්ඤං උපසඞ්කමන්ති අරහන්තො වා අරහත්තමග්ගං වා සමාපන්නා. අයං ඛො බ්රාහ්මණ හෙතු අයං පච්චයො යෙන තං නිච්චදානං අනුකූලයඤ්ඤං ඉමාය තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය අප්පට්ටතරඤ්ච අප්පසමාරම්භතරඤ්ච මහප්ඵලතරඤ්ච මහානිසංසතරඤ්චා”ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අප්පට්ඨතරො - සමර "
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "“බමුණ මෙ බඳු යාගයක් කොට හෝ කරවා කාබුන්මරණිත් මතු මනා ගති ඇති සඟ ලොවට පැමිණෙන්නේ යැ’යි පිළින කෙරෙමි. එ සමයෙහි ඒ යාගය කරවූ පෙරෙවි බමුණා මම් වීම්”යී භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "30. “පින්වත් ගෞතමයන් වහන්ස, සොළොස් පිරිකරක් ඇති මේ තුන් වැදෑරුම් යාග සම්පතට වඩා අල්ප කටයුතු ඇති, අල්ප උත්සාහයෙන් සිදු කට හැකි (එහෙත්) වඩා මහත් පල ඇති, වඩා මහත් අනුසස් ඇති අන් යාගයෙක් ඇත්තේ දැ?”යී කුළුදත් බමුණා විචාළේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“බමුණ, සොළොස් පිරිකරක් ඇති මේ තුන් යාග සම්පතට වඩා අල්ප කටයුතු ඇති, අල්ප උත්සාහයෙන් සිදු කට හැකි, වඩා මහත් පල ඇති, වඩා මහත් අනුසස් ඇති අන් යාගයෙක් ඇත්තේ යැ”යී (භාග්‍යවතුන් වහන්සේ වදාළ සේක.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "31. “පින්වත් ගෞතමයන් වහන්ස, සොළොස් පිරිකරක් ඇති මේ තුන් යාග සම්පතට වඩා අල්ප කෘත්‍ය ඇති, වඩා අල්ප උත්සාහයෙන් සිදු කට හැකි, එහෙත් එයට වඩා මහත් පල ඇති, වඩා මහත් අනුසස් ඇති ඒ යාගය කවරේ ද?”යී (කුළුදත් ඇසී ය.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“බමුණ, සිල්වත් පැවිද්දන් උදෙසා කුලපරපුරෙහි දෙන යම් නිති දන් (හැම දා ම දෙන දන්) කෙනෙක් වෙත් නම්, බමුණ, ඒ මේ යාගය මෙ කී සොළොස් පිරිකරක් ඇති තුන් යාග සම්පතට වඩා අල්ප කෘත්‍ය ඇති අල්ප උත්සාහයෙන් සිදු කට හැකි, එහෙත් එයට වඩා මහත් පලත් මහත් අනුසසුත් ඇති එකෙකැ”යි (භාග්‍යවතුන් වහන්සේ වදාළ සේක.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "32. “පින්වත් ගෞතමයන් වහන්ස, ඒ නිති දෙන අනුකූල යඥය යමෙකින් සොළොස් පිරිකරක් ඇති මේ ත්‍රිවිධ යඥසම්පතට වඩා අල්ප කෘත්‍ය ඇතියෙක්, වඩා අල්පොත්සාහයෙන් සිදු කට හැකියෙක්, එහෙත් එයට වඩා මහත් පලක් මහත් අනුසසුත් ඇතියෙක් වන්නේ නම්, ඒ හේතුව ඒ ප්‍රත්‍යයය කවරේ ද?” (යී කුළුදත් පුළුවුත.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“බමුණ, එ බඳු යාගයකට (දානයකට) රහත්හු හෝ රහත්මඟ පිළිපන්නෝ හෝ නො ම එළැඹෙත්. ඒ කවර හෙයින් ද? යත්: බමුණ, එ බඳු මහා යඥයෙහි ‘පිළිවෙළින් සිටිවු’ යන ආදීන් කියා දන් ලබන්නවුනට දඬුයෙන් පැහැරුම් ද ගෙල ගැනුම් ද දක්නා ලැබේ. එහෙයින් එබඳු යඥයට රහත්හු හෝ රහත්මඟට පිළිපන්නෝ හෝ නො එළඹෙත්. බමුණ, සිල්වත් පැවිද්දන් උදෙසා කුලපරපුරෙහි දෙන යම් නිතිදන් කෙනෙක් වෙත් නම්, එබඳු යඥයට රහත්හු ද රහත්මඟට පිළිපන්නෝ ද එළැඹෙත්. ඒ කවර හෙයින? යත්: බමුණ, මේ බඳු යඥයෙහි දඬුයෙන් පැහැරුම් හෝ ගෙල ගැනුම් හෝ දක්නා නො ලැබේ. එහෙයින් මෙබඳු යඥයට රහත්හු ද රහත්මඟ වන්නෝ ද එළැඹෙත්. බමුණ, ඒ කුලපරපුරැ දෙන නිති දන යමෙකින් මෙ කී සොළොස් පිරිකරක් ඇති ත්‍රිවිධ යඥසම්පතට, වඩා අල්ප කටයුතු ඇති, අල්ප උත්සාහයෙන් සිදු කට හැකි, එහෙත් වඩා මහත්පල ද මහත් අනුසස් ද ඇති එකෙක් වේ නම්, මේ එයට හේතුව ය, මේ ප්‍රත්‍යය ය.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 280,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "33. “අත්ථි පන භො ගොතම අඤ්ඤො යඤ්ඤො ඉමාය ච තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය ඉමිනා ච නිච්චදානෙන අනුකූලයඤ්ඤෙන අප්පට්ටතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො චා”? ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අත්ථි ඛො බ්රාහ්මණ අඤ්ඤො යඤ්ඤො ඉමාය ච තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය ඉමිනා ච නිච්චදානෙන අනුකූලයඤ්ඤෙන අප්පට්ටතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො චා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“කතමො පන සො භො ගොතම යඤ්ඤො ඉමාය ච තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය ඉමිනා ච නිච්චදානෙන අනුකූලයඤ්ඤෙන අප්පට්ටතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො චා”? ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යො ඛො බ්රාහ්මණ චාතුද්දිසං සඞ්ඝං උද්දිස්ස විහාරං කරොති, අයං ඛො බ්රාහ්මණ යඤ්ඤො ඉමාය ච තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය ඉමිනා ච නිච්චදානෙන අනුකූලයඤ්ඤෙන අප්පට්ටතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො චා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "34. “අත්ථි පන භො ගොතම අඤ්ඤො යඤ්ඤො ඉමාය ච තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය ඉමිනා ච නිච්චදානෙන අනුකූලයඤ්ඤෙන ඉමිනා ච විහාරදානෙන අප්පට්ටතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො චා”? ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අත්ථි ඛො බ්රාහ්මණ අඤ්ඤො යඤ්ඤො ඉමාය ච තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය ඉමිනා ච නිච්චදානෙන අනුකූලයඤ්ඤෙන ඉමිනා ච විහාරදානෙන අප්පට්ටතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො චා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“කතමො පන සො භො ගොතම අඤ්ඤො යඤ්ඤො ඉමාය ච තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය ඉමිනා ච නිච්චදානෙන අනුකූලයඤ්ඤෙන ඉමිනා ච විහාරදානෙන අප්පට්ටතරො ච __අප්පසමාරම්භතරො ච__ මහප්ඵලතරො ච මහානිසංසතරො චා”? ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යො ඛො බ්රාහ්මණ පසන්නචිත්තො බුද්ධං සරණං ගච්ඡති, ධම්මං සරණං ගච්ඡති, සඞ්ඝං සරණං ගච්ඡති, අයං ඛො බ්රාහ්මණ යඤ්ඤො ඉමාය ච තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය ඉමිනා ච නිච්චදානෙන අනුකූලයඤ්ඤෙන ඉමිනා ච විහාරදානෙන අප්පට්ටතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො චා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "35. “අත්ථි පන භො ගොතම අඤ්ඤො යඤ්ඤො ඉමාය ච තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය ඉමිනා ච නිච්චදානෙන අනුකූලයඤ්ඤෙන ඉමිනා ච විහාරදානෙන ඉමෙහි ච සරණගමනෙහි අප්පට්ටතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො චා” ? ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "33. (කුළුදත්:) “පින්වත් ගෞතමයන් වහන්ස, මේ සොළොස් පිරිකරක් ඇති තුන් වැදෑරුම් යාගසම්පතටත් මේ කුලපරපුරෙහි දෙන නිති දනටත් වඩා මඳ කටයුතු ඇති, වඩා මඳ උත්සාහයෙකින් සිදු කට හැකි, එහෙත් මේ හැමට වඩා මහත් පලත් මහත් අනුසසුත් ඇති අන් යඥයෙක් ඇත් ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(භාග්‍යවතුන් වහන්සේ:) “බමුණ, මේ සොළොස් පිරිකරක් තුන්වැදෑරුම් යාගසම්පතටත් කුලපරපුරෙහි දෙන නිති දනටත් වඩා මඳ කටයුතු ඇති, වඩා මඳ උත්සාහයෙකින් සිදු කට හැකි, එහෙත් ඒ හැමට වඩා මහත් පලත් මහත් අනුසසුත් ඇති අන් යඥයෙක් ඇත.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(කුළුදත්:) “පින්වත් ගෞතමයන් වහන්ස, මේ සොළොස් පිරිකරක් ඇති තුන්වැදෑරුම් යාගසම්පතටත් … නිති දනටත් වඩා මඳ කටයුතු ඇති … වඩා මහත් අනුසස් ඇති ඒ යඥය කවරේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(භාග්‍යවතුන් වහන්සේ:) “බමුණ, යමෙක් වනාහි සතර දිගින් චඩනා භික්‍ෂුසංඝයා උදෙසා වෙහෙරක් කෙරේ නම්, ඒ මේ යඥය මෙහි පළමු කී ... තුත්වැදෑරුම් යාග සම්පතටත් … නිති දනටත් වඩා මද කටයුතු ඇති, වඩා මද උත්සාහයෙකින් සිදු කට හැකි, එහෙත් වඩා මහත් පල හා අනුසස් හා ඇති යඥයෙකි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "34. (කුළුදත්:) “පින්වත් ගෞතමයන් වහන්ස, මේ … ත්‍රිවිධ යඥසම්පතටත් … මෙ විහාරදානයටත් වඩා මඳ කටයුතු ඇති … වඩා මහත් පල හා අනුසස් හා ඇති අන් යඥයෙක් ඈත් ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(භාග්‍යවතුන් වහන්සේ:) “බමුණ, මේ ... ත්‍රිවිධ යඥසම්පතටත් … මේ විහාරදානයටත් වඩා මඳ කටයුතු ඇති … වඩා මහත්ඵල හා අනුසස් හා ඇති අන් යඥයෙක් ඈත.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(කුළුදත්:) “පින්වත් ගෞතමයන් වහන්ස, මේ … ත්‍රිවිධ යඥසම්පතටත් … මේ විහාරදානයටත් වඩා මද කටයුතු ඇති … වඩා මහත් පල හා අනුසස් හා ඇති ඒ අන් යඥය කවරේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(භාග්‍යවතුන් වහන්සේ:) “බමුණ, යමෙක් පහන් සිතැත්තේ බුදුන් සරණ යේ ද, දහම් සරණ යේ ද, සඟ සරණ යේ ද, බමුණ, ඒ මේ යඥය වූ කලී මේ පළමු කී … ත්‍රිවිධ යඥසම්පතටත් … විහාරදානයටත් වඩා මඳ කටයුතු ඇති … වඩා මහත් පල හා අනුසස් හා ඇති එකෙකි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "35. (කුළුදත්:) “පින්වත් ගෞතමයන් වහන්ස, මේ … ත්‍රිවිධ යඥසම්පතටත් … මේ සරණ ගමනයටත් වඩා මඳ කටයුතු ඇති … වඩා මහත් පල හා අනුසස් හා ඇති අන් යඥයෙක් ඇත්තේ ද?”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 282,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“අත්ථි ඛො බ්රාහ්මණ අඤ්ඤො යඤ්ඤො ඉමාය ච තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය ඉමිනා ච නිච්චදානෙන අනුකූලයඤ්ඤෙන ඉමිනා ච විහාරදානෙන ඉමෙහි ච සරණගමනෙහි අප්පට්ටතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො චා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො පන සො භො ගොතම අඤ්ඤො යඤ්ඤො ඉමාය ච තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය ඉමිනා ච නිච්චදානෙන අනුකූලයඤ්ඤෙන ඉමිනා ච විහාරදානෙන ඉමෙහි ච සරණගමනෙහි අප්පට්ටතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො චා”? ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යො ඛො බ්රාහ්මණ පසන්නචිත්තො සික්ඛාපදානි සමාදියති පාණාතිපාතා වෙරමණිං අදින්නාදානා වෙරමණිං කාමෙසුමිච්ඡාචාරා වෙරමණිං මුසාවාදා වෙරමණිං සුරාමෙරයමජ්ජපමාදට්ඨානා වෙරමණිං, අයං ඛො බ්රාහ්මණ යඤ්ඤො ඉමාය ච තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය ඉමිනා ච නිච්චදානෙන අනුකූලයඤ්ඤෙන ඉමිනා ච විහාරදානෙන ඉමෙහි ච සරණගමනෙහි අප්පට්ටතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො චා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "36. “අත්ථි පන භො ගොතම අඤ්ඤො යඤ්ඤො ඉමාය ච තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය ඉමිනා ච නිච්චදානෙන අනුකූලයඤ්ඤෙන ඉමිනා ච විහාරදානෙන ඉමෙහි ච සරණගමනෙහි ඉමෙහි ච සික්ඛාපදෙහි අප්පට්ටතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො චා”? ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අත්ථි ඛො බ්රාහ්මණ අඤ්ඤො යඤ්ඤො ඉමාය ච තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය ඉමිනා ච නිච්චදානෙන අනුකූලයඤ්ඤෙන ඉමිනා ච විහාරදානෙන ඉමෙහි ච සරණගමනෙහි ඉමෙහි ච සික්ඛාපදෙහි අප්පට්ටතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො චා”? ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“කතමො පන සො භො ගොතම යඤ්ඤො ඉමාය ච තිවිධාය යඤ්ඤසම්පදාය සොළසපරික්ඛාරාය ඉමිනා ච නිච්චදානෙන අනුකූලයඤ්ඤෙන ඉමිනා ච විහාරදානෙන ඉමෙහි ච සරණගමනෙහි ඉමෙහි ච සික්ඛාපදෙහි අප්පට්ටතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො චා?” ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "37. “ඉධ බ්රාහ්මණ, තථාගතො ලොකෙ උප්පජ්ජති අරහං සම්මාසම්බුද්ධො විජ්ජාචරණසම්පන්නො සුගතො ලෝකවිදූ අනුත්තරො පුරිසදම්මසාරථී සත්ථා දෙවම__නු__ස්සානං බුද්ධො භගවා. සො ඉමං ලොකං සදෙවකං සමාරකං සබ්රහ්මකං සස්සමණබ්රාහ්මණිං පජං සදෙවමනුස්සං සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදති. සො ධම්මං දෙසෙති ආදිකල්යාණං මජ්ඣෙකල්යාණං පරියොසානකල්යාණං සාත්ථං සබ්යඤ්ජනං කෙවලපරිපුණ්ණං පරිසුද්ධං බ්රහ්මචරියං පකාසෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "38. තං ධම්මං සුණාති ගහපති වා ගහපතිපුත්තො වා අඤ්ඤතරස්මිං වා කුලෙ පච්චාජාතො. සො තං ධම්මං සුත්වා තථාගතෙ සද්ධං පටිලභති. සො තෙන සද්ධාපටිලාභෙන සමන්නාගතො ඉති පටිසංචික්ඛති: ‘සම්බාධො ඝරාවාසො රජොපථො අබ්භොකාසො පබ්බජ්ජා. නයිදං සුකරං අගාරං අජ්ඣාවසතා එකන්තපරිසුද්ධං සඞඛලිඛිතං බ්රහ්මචරියං චරිතුං. යන්නූනාහං කෙසමස්සුං ඔහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජෙය්යන්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "(භාග්‍යවතුන් වහන්සේ:) “බමුණ, මේ … ත්‍රිවිධ යඥසම්පතටත් … මේ සරණගමනයටත් වඩා මඳ කටයුතු ඇති … වඩා මහත් පල හා අනුසස් හා ඇති අන් යඥයෙක් ඇත.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(කුළුදත්:) “පින්වත් ගෞතමයන් වහන්ස, මේ … ත්‍රිවිධ යඥසම්පතටත් … මේ සරණගමනයටත් වඩා මඳ කටයුතු ඇති … වඩා මහත් පල හා අනුසස් හා ඇති ඒ අන් යඥය කවරේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(භාග්‍යවතුන් වහන්සේ:) “බමුණ, යමෙක් පහන් සිතැති වැ (තිසරණයෙහි පිහිටා) පණිවායෙන් වැළැක්ම, අයිනාදනින් වැළැක්ම, කාමයන්හි වරදවා හැසිරීමෙන් වැළැක්ම, මුසවායෙන් වැළැක්ම, මදට පමාවට කරුණු වූ රහමෙරින් වැළැක්ම යන මේ සික කොටස් සමාදන් කොට ගන්නේ නම්, බමුණ මෙය මේ පළමු කී ත්‍රිවිධ යඥසම්පතටත් … මේ සරණගමනයටත් වඩා මඳ කටයුතු ඇති, … වඩා මහත් පල හා අනුසස් හා ඇති යඥයෙක.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "36. (කුළුදත්:) “පින්වත් ගෞතමයන් වහන්ස, මේ … ත්‍රිවිධ යඥසම්පතටත් මේ සික කොටස් සමාදන් කොට ගැන්මටත් වඩා මද කටයුතු ඇති … වඩා මහත්පල හා අනුසස් හා ඇති අන් යඥයෙක් ඇත් ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(භාග්‍යවතුන් වහන්සේ:) “බමුණ, මේ … ත්‍රිවිධ යඥසම්පතටත් … මේ සිල් කොටස් සමාදන් කොට ගැන්මටත් වඩා මද කටයුතු ඇති ... මහත් පල හා අනුසස් හා ඇති අන් යඥයෙක් ඇත.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(කුළුදත්:) “පින්වත් ගෞතමයන් වහන්ස, මේ ත්‍රිවිධ යඥසම්පතටත් ... මේ සිල් කොටස් සමාදන් කොට ගැන්මටත් වඩා මද කටයුතු ඇති … වඩා මහත් පල හා අනුසස් හා ඇති ඒ අන් සඥය කවරේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "37. (භාග්‍යවතුන් වහන්සේ:) “බමුණ, අර්හත් වූ, සම්‍යක්සම්බුද්ධ වූ, විද්‍යාචරණසම්පන්න වූ, සුගත වූ, ලෝකවිත් වූ, නිරුත්තර පුරුෂදම්‍යසාරථි වූ, දෙවිමිනිසුන්හට ශාස්තෘ වූ, සිවුසස් අවබෝධ කළ, භාග්‍යවත් වූ, තථාගත තෙමේ මෙ ලොවැ උපදී. හේ දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත මේ ලොව, – මහණබමුණන් සහිත, දෙව්මිනිසුන් සහිත සත්ත්‍වප්‍රජාව - තෙමේ ම විශිෂ්ට නුවණින් දැනැ පසක් කොට (ලොවට) දන්වයි. හේ මුල යහපත් මැද යහපත් අග යහපත්, අරුත් සහිත, ව්‍යංජනයෙන් නොඅඩු, හැම අතින් ම පිරිපුන් දහම් දෙසයි. පිරිසිදු සසුන් බඹසර හෙළි කෙරයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "38. ගැහැවියෙක් හෝ ගැහැවිපුතෙක් හෝ අන් එක්තරා කුලයෙකැ උපන්නෙක් හෝ ඒ දහම අසයි. හේ එ දහම අසා තථාගතයන් කෙරෙහි සැදැහැව ලබයි. හේ ඒ සැදැහැ ලැබීමෙන් යුත් වැ “ගිහි ගෙයි විසීම හිරහැර සහිත ය. කෙලෙස් දූලි ගැවැසි මගෙක. පැවිද්ද වූ කලී (කිසි අවහිර නැති) එළි මහනෙක. ගිහි ගෙහි වසන්නහු විසින් ඒකාන්තයෙන් පිරිපුන් කොට, ඒකාන්තයෙන් පිරිසිදු කොට, මේ සංඛලිඛිතක බ්‍රහ්මචර්‍යය පුරන්නට පහසු නො වේ. එ බැවින් මම් කෙහෙ රවුලු බහා කසාවත් හැඳ, ගිහි ගෙන් නික්ම පැවිද්දට වදනෙම් නම් යෙහෙකැ”යී මෙසේ නුවණින් සලකයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 284,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සො අපරෙන සමයෙන අප්පං වා භොගක්ඛන්ධං පහාය මහන්තං වා භොගක්ඛන්ධං පහාය අප්පං වා ඤාතිපරිවට්ටං පහාය මහන්තං වා ඤාතිපරිවට්ටං පහාය කෙසමස්සුං ඔහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජති. සො එවං පබ්බජිතො සමානො පාතිමොක්ඛසංවරසංවුතො විහරති ආචාරගොචරසම්පන්නො, අණුමත්තෙසු වජ්ජෙසු භයදස්සාවී. සමාදාය සික්ඛති සික්ඛාපදෙසු. කායකම්මවචීකම්මෙන සමන්නාගතො කුසලෙන, පරිසුද්ධාජීවො සීලසම්පන්නො ඉන්ද්රියෙසු ගුත්තද්වාරො භොජනෙ මත්තඤ්ඤූ සතිසම්පජඤ්ඤෙන සමන්නාගතො සන්තුට්ඨො."
                    },
                    {
                        "type": "paragraph",
                        "text": "39. කථඤ්ච බ්රාහ්මණ භික්ඛු සීලසම්පන්නො හොති? ඉධ බ්රාහ්මණ භික්ඛු පාණාතිපාතං පහාය පාණාතිපාතා පටිවිරතො හොති නිහිතදණ්ඩො නිහිතසත්ථො ලජ්ජී දයාපන්නො සබ්බපාණභූතහිතානුකම්පී විහරති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අදින්නාදානං පහාය අදින්නාදානා පටිවිරතො හොති දින්නාදායී දින්නපාටිකඞ්ඛී. අථෙනෙන සුචිභූතෙන අත්තනා විහරති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අබ්රහ්මචරියං පහාය බ්රහ්මචාරී හොති ආරාචාරී විරතො මෙථුනා ගාමධම්මා. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "මුසාවාදං පහාය මුසාවාදා පටිවිරතො හොති සච්චවාදී සච්චසන්ධො ථෙතො පච්චයිකො අවිසංවාදකො ලොකස්ස. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "පිසුණං වාචං පහාය පිසුණාය වාචාය පටිවිරතො හොති. ඉතො සුත්වා න අමුත්ර අක්ඛාතා ඉමෙසං භෙදාය. අමුත්ර වා සුත්වා න ඉමෙසං අක්ඛාතා අමූසං භෙදාය. ඉති භින්නානං වා සන්ධාතා, සංහිතානං වා අනුප්පදාතා සමග්ගාරාමො සමග්ගරතො සමග්ගනන්දී සමග්ගකරණිං වාචං භාසිතා හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඵරුසං වාචං පහාය ඵරුසාය වාචාය පටිවිරතො හොති. යා සා වාචා නෙලා කණ්ණසුඛා පෙම__නී__යා හදයඞ්ගමා පොරී බහුජනකන්තා බහුජනමනාපා, තථාරූපිං වාචං භාසිතා හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "සම්ඵප්පලාපං පහාය සම්ඵප්පලාපා පටිවිරතො හොති කාලවාදී භූතවාදී අත්ථවාදී ධම්මවාදී විනයවාදී. නිධානවතිං වාචං භාසිතා කාලෙන සාපදෙසං පරියන්තවතිං අත්ථසඤ්හිතං. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "හේ පසු කලෙකැ මඳ වූ හෝ ධනසම්පත් හැරැ, බොහෝ වූ හෝ ධනසම්පත් හැරැ, මඳ වූ හෝ නෑපිරිස හැරැ, මහත් වූ හෝ නෑ පිරිස හැරැ, කෙහෙ රවුලු බා, කසාවත් හැඳ, ගිහි ගෙන් පැවිදි බිමට වදී. හේ මෙසේ පැවිදි වූයේ ම, පාතිමෝක්ඛසංවරයෙන් ඇවුරුණේ, ආචාරයෙන් හා ගෝචරයෙන් හා සම්පූර්‍ණ වූයේ, මඳ වූ ද වරදෙහි බිය දක්නා සුලු වූයේ, සිකකොටස්හි සමාදන් කොටැ ගෙන හික්මෙයි. නිවැරැදි වූ කාවිසිකමින් යුත් වෙයි. පිරිසිදු දිවෙල ඇත්තේ වෙයි. සිල්වත් වෙයි. ඉඳුරන්හි වැසූ දොරැත්තේ වෙයි. බොජුනෙහි පමණ දන්නේ වෙයි. සිහිනුවණින් යුත් වෙයි. ලද පමණින් සතුටු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "39. බමුණ, කෙසේ නම් මහණ තෙමේ ශීලසම්පන්න වේ ද? යත්: බමුණ, මෙහි මහණ තෙමේ පණිවා හැරැ පණිවායෙන් වැළැක්කේ, ඉවතැ ලූ දඬු ඇත්තේ, ඉවතැ ලු අවි ඇත්තේ, ලජ්ජා ඇත්තේ, මෙත් සිතින් යුත් වූසේ, සියලු සතුන් කෙරෙහි ඉත සිතැති වැ වෙසෙයි. මේ ද ඔහුගේ ශීලයෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "අයිනාදන් හැරැ අයිනාදනින් වැළැක්කේ වෙයි. දුන් දැය ම ගන්නේ, දුන් දැය ම කැමැති වන්නේ, නොසොර වූ පිරිසිදු වූ සිතින් වෙසෙයි. මේ ද ඔහුගේ ශීලයෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "නොබඹසර හැරැ බඹසර රක්නේ, නොබඹසරින් දුරැ වැ වසනුයේ, ගැමිදහම් වූ මෙවුන්දමින් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මුසවා හැරැ මුසවායෙන් වැළැක්කේ, ඇත්ත කියන සුලු වූයේ, ඇත්තෙන් ඇත්ත ගළපනුයේ, තහවුරු කතා ඇත්තේ, හැදැහියැ යුතු බස් ඇත්තේ, ලොව නො රවටනුයේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් ‍වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පෙහෙසුන් බස් හැරැ, පෙහෙසුන් බසින් වැළැක්කේ වෙයි. මොවුන් ඔවුන්ගෙන් බිඳෙනු පිණිස ‍මොබින් අසා ඔබ්බෙහි නො කියන්නේ වෙයි. ඔවුන් මොවුන්ගෙන් බිඳෙනු පිණිස ඔබින් අසා මොබ්බෙහි කියන්නේ හෝ නො වෙයි. මෙසේ බිඳුණවුන් ගළපන්නේ ද ගැළැපුණවුනට අනුබල දෙන්නේ ද වෙයි. සමගියෙන් වසන්නවුන් කෙරෙහි වසන්නට කැමැත්තේ, සමගියෙන් වසන්නවුන් කෙරෙහි ඇලුණේ, සමගියෙන් වසන්නවුනට සතුටු වූයේ, සමගියේ ගුණ දක්වන වචන කියන්නේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පරොස් බස් හැරැ, පරොස් බසින් වැළැක්කේ වෙයි. යම් බසෙක් නිදොස් ද, කන්කලු ද, පෙම් උපදවා ද, සුවසේ ළෙහි වදනේ ද, සියුමැලි ද, බොහෝ දෙනාට ප්‍රිය ද, බොහෝ දෙනාට මනාප ද, එ බඳු බස් තෙපලන්නේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බොල් දෙඩැවිලි හැරැ, බොල් දෙඩැවිල්ලෙන් වැළැක්කේ වෙයි. කල් දැනැ කියනුයේ, සබ වස් ම කියනුයේ, වැඩ ඇති බස් ම කියනුයේ, දහම් අසළ බස් ම කියනුයේ, විනය අසළ බස් ම කියනුයේ, සුදුසු කලැ කරුණු සහිත, සීමා සහිත, අරුත් සහිත, සිතැ ලා දැරියැ යුතු බස් කියන්නේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 286,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "40. බීජගාමභූතගාමසමාරම්භා පටිවිරතො හොති. එකභත්තිකො හොති අත්තූපරතො විරතො විකාලභොජනා. නච්චගීතවාදිතවිසූකදස්සනා පටිවිරතො හොති. මාලාගන්ධවිලෙපනධාරණමණ්ඩණවිභූසනට්ඨානා පටිවිරතො හොති. උච්චාසයනමහාසයනා පටිවිරතො හොති. ජාතරූපරජතපටිග්ගහණා පටිවිරතො හොති. ආමකධඤ්ඤපටිග්ගහණා පටිවිරතො හොති. ආමකමංසපටිග්ගහණා පටිවිරතො හොති. ඉත්ථිකුමාරිකපටිග්ගහණා පටිවිරතො හොති. දාසිදාසපටිග්ගහණා පටිවිරතො හොති. අජෙළකපටිග්ගහණා පටිවිරතො හොති. කුක්කුටසූකරපටිග්ගහණා පටිවිරතො හොති. හත්ථිගවාස්සවළවාපටිග්ගහණා පටිවිරතො හොති. ඛෙත්තවත්ථුපටිග්ගහණා පටිවිරතො හොති. දූතෙය්යපහිණගම__නා__නුයොගා පටිවිරතො හොති. කයවික්කයා පටිවිරතො හොති. තුලාකූටකංසකූටමානකූටා පටිවිරතො හොති. උක්කොටනවඤ්චනනිකතිසාචියොගා පටිවිරතො හොති. ඡෙදනවධබන්ධනවිපරාමොසආලොපසහසාකාරා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "centered",
                        "text": "(චුල්ලසීලං නිට්ඨිතං.)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "41. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං බීජගාමභූතගාමසමාරම්භං අනුයුත්තා විහරන්ති, සෙය්යථිදං: මූලබීජං ඛන්ධබීජං ඵළුබීජං අග්ගබීජං බීජබීජමෙව පඤ්චමං. ඉති වා ඉතිඑවරූපා බීජගාමභූතගාමසමාරම්භා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "42. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං සන්නිධිකාරපරිභොගං අනුයුත්තා විහරන්ති, සෙය්යථිදං: අන්නසන්නිධිං පානසන්නිධිං වත්ථසන්නිධිං යානසන්නිධිං සයනසන්නිධිං ගන්ධසන්නිධිං ආමිසසන්නිධිං. ඉති වා ඉතිඑවරූපා සන්නිධිකාරපරිභොගා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "43. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං විසූකදස්සනං අනුයුත්තා විහරන්ති, සෙය්යථිදං: නච්චං ගීතං වාදිතං පෙක්ඛං අක්ඛානං පාණිස්සරං වෙතාලං කුම්භථූනං සොභනගරකං චණ්ඩාලං වංසං ධොපනං හත්ථියුද්ධං අස්සයුද්ධං මහිසයුද්ධං උසභයුද්ධං අජයුද්ධං මෙණ්ඩකයුද්ධං කුක්කුටයුද්ධං වට්ටකයුද්ධං දණ්ඩයුද්ධං මුට්ඨියුද්ධං නිබ්බුද්ධං උය්යොධිකං බලග්ගං සෙනාබ්යූහං අණීකදස්සනං. ඉති වා ඉතිඑවරූපා විසූකදස්සනා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "40. හේ පැල වන දෑ ද පැල වුණු දෑ ද සිඳුම ඈ විකොවුනෙන් වැළැක්කේ වෙයි. රෑ බොජුනෙන් වැළැක්කේ, විකල් බොජුනෙන් වෙන් වූයේ, එක් බතක් ඇත්තේ වෙයි. නටනු ගනු වයනු විසුළුදස්නෙන් වැළැක්කේ වෙයි. සැරැසීමටත් උනු තැත් පිරැවුමටත් කරුණු වූ මල් ගඳ විලෙවුන් දැරුමෙන් වැළැක්කේ වෙයි. උසස්නෙන් මහ අස්නෙන් වැළැක්කේ වෙයි. රන් රිදී පිළිගැන්මෙන් වැළැක්කේ වෙයි. අමු ධාන්‍ය පිළිගැන්මෙන් වැළැක්කේ වෙයි. අමු මස් පිළිගැන්මෙන් වැළැක්කේ වෙයි. ගැහැණුන් දැරියන් පිළිගැන්මෙන් වැළැක්කේ වෙයි. දැසිදසුන් පිළිගැන්මෙන් වැළැක්කේ වෙයි. එළුවන් තිරෙළුවන් පිළිගැන්මෙන් වැළැක්කේ වෙයි. කුකුළන් හූරන් පිළිගැන්මෙන් වැළැක්කේ වෙයි. ඇතුන් ගෙරින් අසුන් වෙළෙඹුන් පිළිගැන්මෙන් වැළැක්කේ වෙයි. කෙත් වත් පිළිගැන්මෙන් වැළැක්කේ වෙයි. ගිහිනට දූත මෙහෙවර කිරීමෙන්, ගෙන් ගෙට යන කුඩා මෙහෙවරින් යන දෙකෙන් ම වැළැක්කේ වෙයි. ගනුදෙනුයෙත් වැළැක්කේ වෙයි. තුලාකූට කංසකූට මානකූටයෙත් වැළැක්කේ වෙයි. උක්කෝටන වංචන නිකති සාචියෝගයෙන් වැළැක්කේ වෙයි. ඡේදන වධ බන්‍ධන විපරාමොස ආලොප සහසාකාර යන මෙයින් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශිලයෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 22,
                        "text": "(සුළු සිල් නිමියේ ය.)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "41. යම්සේ වනාහි ඇතැම් භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, පැල වන මුල්, පැල වන කඳ, පැල වන පුරුක්, පැල වන කොළිස්, පස් වනු පැල වන ඇට යන ‍මෙබඳු පැල වන දැයත් පැල වුණු දැයත් සිඳුම් බිඳුම් ආදියෙහි යෙදී වෙසෙත් ද, මෙසේ මේ හෝ මෙබඳු වූ පැල වන දැය පැල වුණු දැය සිඳුම් බිඳුම් ඈ විකොපනයෙන් හේ වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "42. යම්සේ වනාහි ඇතැම් භවත් මහණ බමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, අන්නසන්නිධි පානසන්නිධි වස්ත්‍රසන්නිධි යානසන්නිධි ශයනසන්නිධි ගන්‍ධසන්නිධි ආමිෂසන්නිධි යන මෙබඳු වූ සන්නිධිකාර පරිභොගයෙහි යෙදුණෝ වෙසෙත් ද, හේ මේ ආදී වූ හෝ අන් මෙබඳු වූ හෝ සන්නිධිකාර පරිභොගයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "43. යම්සේ වනාහි ඇතැම් භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, නැටුම් ගැයුම්, නට සමජ්ජා, ආඛ්‍යාන, පාණිස්වර, වෙතාල, කුම්භථූන, ශෝභනක, සණදොවුන්කෙළි, උන ගස් ඔසොවා ගෙන කෙරෙන ක්‍රීඩා, අස්ථිධාවන, ඇත්පොර, අස්පොර, මියුපොර, ගොන්පොර, එළුපොර, බැටෙළුපොර, කුකුළුපොර, වටුපොර, පොලුහරඹ, මිටුයුද, මල්ල පොර, යුද පවත්නා තැන් දක්නට යෑම, බලසෙන් ගණිනා තැන් දක්නට යෑම, බලසෙන් බෙදන තැනට යෑම, බල ඇණි දක්නට යෑම යන විසුළු දසුන්හි යෙදී වෙසෙත් ද, හෙ තෙමේ මේ ආදි වූ හෝ මෙබඳු වූ විසුළු දස්නෙන් වැළැක්කේ වෙයි. මේ ද ඔහු‍ගේ ශීලයෙක් වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 288,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "44. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං ජූතප්පමාදට්ඨානානුයොගං අනුයුත්තා විහරන්ති, සෙය්යථිදං: අට්ඨපදං දසපදං ආකාසං පරිහාරපථං සන්තිකං ඛලිකං ඝටිකං සලාකහත්ථං අක්ඛං පඞ්ගචීරං වඞ්කකං මොක්ඛචිකං චිඞ්ගුලකං පත්තාළ්හකං රථකං ධනුකං අක්ඛරිකං මනෙසිකං යථාවජ්ජං. ඉති වා ඉතිඑවරූපා ජූතප්පමාදට්ඨානානුයොගා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "45. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං උච්චාසයනමහාසයනං අනුයුත්තා විහරන්ති, සෙය්යථිදං: ආසන්දිං පල්ලඞ්කං ගොනකං චිත්තකං පටිකං පටලිකං තූලිකං විකතිකං උද්දලොමිං එකන්තලොමිං කට්ඨිස්සං කොසෙය්යං කුත්තකං හත්ථත්ථරං අස්සත්ථරං රථත්ථරං අජිනප්පවෙණිං කාදලිමිගපවරපච්චත්ථරණං සඋත්තරච්ඡදං උභතොලොහිතකූපධානං ඉති වා ඉතිඑවරූපා උච්චාසයනමහාසයනා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "46. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං මණ්ඩනවිභූසනට්ඨානානුයොගං අනුයුත්තා විහරන්ති, සෙය්යථීදං: උච්ඡාදනං පරිමද්දනං නහාපනං සම්බාහනං ආදාසං අඤ්ජනං මාලාවිලෙපනං මුඛචුණ්ණකං මුඛාලෙපනං හත්ථබන්ධං සිඛාබන්ධං දණ්ඩකං නාළිකං ඛග්ගං ඡත්තං චිත්රෑපාහනං උණ්හීසං මණිං වාළවීජනිං ඔදාතානි වත්ථානි දීඝදසානි. ඉති වා ඉතිඑවරූපා මණ්ඩනවිභූසනට්ඨානානුයොගා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "47. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං තිරච්ඡානකථං අනුයුත්තා විහරන්ති, සෙය්යථිදං: රාජකථං චොරකථං මහාමත්තකථං සෙනාකථං භයකථං යුද්ධකථං අන්නකථං පානකථං වත්ථකථං සයනකථං මාලාකථං ගන්ධකථං ඤාතිකථං යානකථං ගාමකථං නිගමකථං නගරකථං ජනපදකථං ඉත්ථිකථං පුරිසකථං [කුමාරකථං කුමාරිකථං] සූරකථං විසිඛාකථං කුම්භට්ඨානකථං පුබ්බපෙතකථං නානත්තකථං ලොකක්ඛායිකං සමුද්දක්ඛායිකං ඉතිභවාභවකථං. ඉති වා ඉතිඑවරූපාය තිරච්ඡානකථාය පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "44. යම් සේ වනාහි ඇතැම් භවත් මහණ බමුණෝ සැදැහෙන් දුන් බොජුන් වළඳා අටපාකෙළිය, දසපාකෙළිය, අහස් දූකෙළිය, මඬුලු පැනුම්, සන්තිකාක්‍රීඩාව, දාදු කෙළිය, කල්ලි ගැසුම්, සලාඅත්කෙළිය, ගුළකෙළිය, කොළනලා පිඹීම, කෙළිනගුලින් හෑම, කරනම් ගැසුම්, කන්නන්ගුරුවා කෙළිය, කොළනැලියෙන් වැලි ඈ මැනුම්, කෙළිරිය පැදවීම්, කුඩා දුන්නෙන් විදීම, ඈ කිරිකෙළිය, සිතු දෑ කීමේ ක්‍රීඩාව, විකලාංගානුකරණය යන මේ ආදී වූ හෝ මෙබඳු වූ, පමාවට කරුණු වූ දූකෙළියෙහි යෙදී වෙසෙත් ද, හෙ තෙමේ මේ ආදි හෝ මෙබඳු වූ දූකෙළියෙහි යෙදීමෙන් වැළැකියේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "45. යම් සේ වනාහි ඇතැම් භවත් මහණ බමුණෝ සැදැහෙන් දුන් බොජුන් වළඳා, දික්සඟළාපුටු ය, පලඟ ය, මහකොඳුපලස ය, වියමනෙන් විසිතුරු කළ එළුලොම්මුවා ඇතිරිය, රන්කසුකම් කළ පසතුරුණය, කොසෙය්ය හුයින් වියූ ඇතිරිය, අසු පිටැ එළන ඇතිරිය, රියැ එළන ඇතිරිය, ඇඳට සරි ලන සේ අඳුන් දිවිසමින් මසා කළ ඇතිරිය, කෙසෙල්මුවසමින් කළ මහඟු පසතුරුණ, ඉස්දොරැ පාමුලැ රතු කොට්ට තබා ඇති රතු උඩු වියන් සහිත මහඟු යහන යන මේ ආදි වූ හෝ මෙබඳු වූ උස්යහන් මහයහන් පරිහරණය කැරුමෙහි යෙදී වෙසෙද්ද හෙ තෙමේ මේ ආදි වූ හෝ මෙ බඳු වූ උස් යහන් මහ යහන් පරිභෝගයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "46. යම්සේ වනාහි ඇතැම් භවත් මහණබමුණෝ සැදැහැයෙන් දූන් බොජුන් වළඳා කුඩා දරුවන් කිරි සුවඳ හරනට සුවඳ සුණුයෙත් ඉලීම්, මනා සටහන් ගන්වනුවට අත් පා ඈහි තෙල් ගා මැඩීම්, සුවඳ දියෙන් නෑවීම්, මස් වැඩෙනුවට මුගුරින් තැළීම, කැඩපතිත් මුහුණ බැලීම්, සැරැසුම් විසින් අඳුන් ගෑම, මල් හා විලෙවුන් හා දැරිම්, මුව සුණු හා මුවවිලෙවුන් හා දැරීම්, අත්බරණ දැරීම්, හිසැ කුඩුම්බිය බැඳීම්, විසිතුරු සැරයැටි දැරීම්, විසිතුරු බෙහෙත් නළ දැරීම්, කඩු දැරීම්, විසිතුරු කුඩ දැරීම්, විසිතුරු පාවහන් දෑරීම්, නළල්පට බැඳීම, සිළුමිණි පැලැඳීම, විසිතුරු සෙමෙර වල්විදුනා දැරීම්, දික් දාවලු ඇති සුදු රෙදි හැඳීම යන ආදි ඇඟ අඩු තැන් පිරැවීමටත් ඇඟ සැරැසීමටත් කරුණු වූ දෑ පරිභොග කැරුමෙහි යෙදී වෙසෙද්ද, හේ මහණ එබඳු දැය පරිභොග කිරීමෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "47. යම්සේ වනාහි ඇතැම් භවත් මහණබමුණෝ සැදැහෙන් දුන් බොජුන් වළඳා, රාජකථා චෝරකථා මහාමාත්‍රකථා සේනාකථා භයකථා යුද්ධකථා ආහාරකථා පානකථා වස්ත්‍රකථා ශයනකථා ගන්‍ධකථා ඥාතිකථා යානකථා ග්‍රාමකථා නිගමකථා නගරකථා ජනපදකථා ස්ත්‍රීකථා පුරුෂකථා කුමරකථා කුමාරිකථා ශුරකථා කුම්භස්ථානකථා පූර්‍වප්‍රෙතකථා නානාත්‍වකථා ලොකාඛ්‍යායිකාකථා සමුද්‍රාඛායිකාකථා ඉතිභවාභවකථා යන මේ හෝ මෙබඳු වූ තිරිසන් කතාවලැ යෙදී වෙසෙත් ද, ඒ මහණ මේ ආදි හෝ මෙයින් අන්‍ය වූ හෝ මෙ බඳු කථාවලින් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 290,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "48. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං විග්ගාහිකකථං අනුයුත්තා විහරන්ති: සෙය්යථීදං: ‘න ත්වං ඉමං ධම්මවිනයං ආජානාසි, අහං ඉමං ධම්මවිනයං ආජානාමි. කිං ත්වං ඉමං ධම්මවිනයං ආජානිස්සසි? මිච්ඡාපටිපන්නො ත්වමසි, අහමස්මි සම්මා පටිපන්නො. සහිතම්මෙ අසහිතන්තෙ. පුරෙ වචනීයං පච්ඡා අවච. පච්ඡා වචනීයං පුරෙ අවච. අවිචිණ්ණං තෙ විපරාවත්තං. ආරොපිතො තෙ වාදො. නිග්ගහීතො’සි. චර වාදප්පමොක්ඛාය, නිබ්බෙඨෙහි වා සචෙ පහොසී’ති. ඉති වා ඉතිඑවරූපාය විග්ගාහිකකථාය පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "49. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං දූතෙය්යපහිණගමනානුයොගමනුයුත්තා විහරන්ති. සෙය්යථිදං: රඤ්ඤං රාජමහාමත්තානං ඛත්තියානං බ්රාහ්මණානං ගහපතිකානං කුමාරානං: ඉධ ගච්ඡ, අමුත්රාගච්ඡ, ඉදං හර, අමුත්ර ඉදං ආහරාති. ඉති වා ඉතිඑවරූපා දූතෙය්යපහිණගමනානුයොගා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "50. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ කුහකා ච හොන්ති ලපකා ච නෙමිත්තිකා ච නිප්පෙසිකා ච ලාභෙන __ච__ ලාභං නිජිගිංසිතාරො ච. ඉති වා ඉතිඑවරූපා කුහනලපනා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "centered",
                        "text": "(මජ්ඣිමසීලං නිට්ඨිතං.)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "51. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති. සෙය්යථිදං: අඞ්ගං නිමිත්තං උප්පාදං සුපිණං ලක්ඛණං මූසිකච්ඡින්නං අග්ගිහොමං දබ්බිහොමං ථුසහොමං කණහොමං තණ්ඩුලහොමං සප්පිහොමං තෙලහොමං මුඛහොමං ලොහිතහොමං අඞ්ගවිජ්ජා වත්ථුවිජ්ජා ඛත්තවිජ්ජා සිවවිජ්ජා භූතවිජ්ජා භූරිවිජ්ජා අහිවිජ්ජා විසවිජ්ජා විච්ඡිකවිජ්ජා මූසිකවිජ්ජා සකුණවිජ්ජා වායසවිජ්ජා පක්කජ්ඣානං සරපරිත්තානං මිගචක්කං. ඉති වා ඉතිඑවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "48. යම්සේ වනාහි ඇතැම් භවත් මහණ බමුණෝ සැදැහෙන් දුන් බොජුන් වළඳා, “තෝ මේ දහම් විනය නො දනිහි. මම් ම මේ දහම් විනය දනිමි. ‘කිමැ යි මේ දහම් විනය තෝ දනිහි ද? තෝ වරදවා පිළිපන්නෙහි. මම මැනැවින් පිළිපන්නෙම් වෙමි. මා බස කරුණු සහිත ය. තා බස කරුණු රහිත ය. තෝ පළමුවෙන් කියැ යුත්ත පසු වැ කීයෙහි ය. පසු වැ කියැ යුත්ත පළමුයෙන් කීයෙහි ය. තා කලක් ම පුහුණු කළ දැය මගේ එක් වචනයෙන් ම පෙරැළී ගියේ ය. මා විසින් තට දොස් නැගිණ. මා විසින් තෝ නිගැනුණෙහි. මා නැගූ දොසින් මිදෙන්නට හැසිරෙව. හැකි නම් එය විසඳව” යන ආදීන් මෙ බඳු වූ උනුන් බැණ දොඩා ගැනුම්හි යෙදී වෙසෙත් ද, එ මහණ තෙමේ මෙ කී හෝ අන් මෙබඳු වූ හෝ බැණ දොඩා ගැනුම්වලින් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලය වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "49. යම්සේ වනාහි ඇතැම් භවත් මහණබමුණෝ සැදැහෙන් දුන් බොජුන් වළඳා, “මෙහි යන්නැ, අසෝ තැතට එන්නැ, මෙය ගෙන යන්නැ, අසෝ තැනට මෙය ගෙනෙන්නැ” යී කළ නියෝග පිළිගෙන, රජුන්ගේ රජමහමැතියන්ගේ ක්‍ෂත්‍රියයන්ගේ බමුණන්ගේ ගැහැවියන්ගේ රජකුමරුවන්ගේ මෙබඳු දූත මෙහෙවරෙහි පණිවුඩ ගෙනැ යෑමෙහි යෙදී වෙසෙත් ද, ඒ මහණ තෙමේ මේ කී හෝ අන් මේ වැනි හෝ දූත මෙහෙවරින් පණිවුඩ ගෙනැ යෑමේන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලය වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "50. යම්සේ වනාහි ඇතැම් භවත් මහණබමුණෝ සැදැහෙන් දූන් බොජුන් වළඳා කුහක කම කරන්නෝ වෙත් ද, ලාභ සත්කාර පතා අනුත් සිත් ඇදෙන සේ වූ චාටු බස් දොඩන්නෝ වෙත් ද, සිවු පසය ලබනු සඳහා කයින් හෝ බසින් ඇඟවීම් කරන්නෝ වෙත් ද, ලාභාපේක්‍ෂායෙන් අනූනට ගරහන්නො වෙත් ද, ලාභයෙන් ලාභය සොයන්නෝ වෙත් ද, ඒ මහණ තෙමේ මේ කී හෝ මෙබඳු වූ හෝ කුහනලපනවලින් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලය වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 22,
                        "text": "(මැදුම් සිල් නිමියේය.)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "51. යම්සේ වනාහි සමහර මහණ බමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා අංගශාස්ත්‍රය, නිමිත්ත ශාස්ත්‍රය, උත්පාතලක්‍ෂණය, ස්වප්නශාස්ත්‍රය, පුරුෂලක්‍ෂණශාස්ත්‍රය, මුෂකච්ඡින්නවිද්‍යාව, අග්නිහෝමය, දර්වීහෝමය, තුෂහෝමය, කණහෝමය, තණ්ඩුලහෝමය, සර්පිෂ්හෝමය, තෛලහෝමය, මුඛහෝමය, ලෝහිතහෝමය, අංගවිද්‍යාව, වාස්තුවිද්‍යාව, ක්ෂාත්‍රවිද්‍යාව, ශිවවිද්‍යාව, භූතවිද්‍යාව, භූරීවිද්‍යාව, අහිවිද්‍යාව, විෂවිද්‍යාව, වෘෂ්චිකවිද්‍යාව, මූෂකවිද්‍යාව, ශාකුනවිද්‍යාව, වායසවිද්‍යාව, පක්වධ්‍යානය, ශරපරිත්‍රාණය, මෘශපක්‍ෂය යන මෙකී හෝ මෙබඳු වූ හෝ තිරශ්චීනවිද්‍යායෙන් මිථ්‍යාආජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ මේකී හෝ මෙබඳු තිරශ්චීන විද්‍යායෙන් මිථ්‍යාජීවයෙන් වැළැක්කේ වේ. මේ ද ඔහුගේ ශීලය වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 292,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "52. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති. සෙය්යථිදං: මණිලක්ඛණං වත්ථලක්ඛණං දණ්ඩලක්ඛණං අසිලක්ඛණං උසුලක්ඛණං ධනුලක්ඛණං ආවුධලක්ඛණං ඉත්ථිලක්ඛණං පුරිසලක්ඛණං කුමාරලක්ඛණං කුමාරිලක්ඛණං දාසලක්ඛණං දාසිලක්ඛණං හත්ථිලක්ඛණං අස්සලක්ඛණං මහිසලක්ඛණං උසභලක්ඛණං ගොලක්ඛණං අජලක්ඛණං මෙණ්ඩලක්ඛණං කුක්කුටලක්ඛණං වට්ටකලක්ඛණං ගොධාලක්ඛණං කණ්ණිකාලක්ඛණං කච්ඡපලක්ඛණං මිගලක්ඛණං. ඉති වා ඉති එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "53. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති, සෙය්යථිදං: රඤ්ඤං නිය්යානං භවිස්සති, රඤ්ඤං අනිය්යානං භවිස්සති, අබ්භන්තරානං රඤ්ඤං උපයානං භවිස්සති, බාහිරානං රඤ්ඤං අපයානං භවිස්සති, බාහිරානං රඤ්ඤං උපයානං භවිස්සති, අබ්භන්තරානං රඤ්ඤං අපයානං භවිස්සති, අබ්භන්තරානං රඤ්ඤං ජයො භවිස්සති, බාහිරානං රඤ්ඤං පරාජයො භවිස්සති, බාහිරානං රඤ්ඤං ජයො භවිස්සති, අබ්භන්තරානං රඤ්ඤං පරාජයො භවිස්සති. ඉති ඉමස්ස ජයො භවිස්සති. ඉමස්ස පරාජයො භවිස්සති. ඉති වා ඉතිඑවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "54. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති, සෙය්යථීදං: චන්දග්ගාහො භවිස්සති, සූරියග්ගාහො භවිස්සති, නක්ඛත්තග්ගාහො භවිස්සති, චන්දිමසූරියානං පථගමනං භවිස්සති, චන්දිමසූරියානං උප්පථගමනං භවිස්සති, නක්ඛත්තානං පථගමනං භවිස්සති, නක්ඛත්තානං උප්පථගමනං භවිස්සති, උක්කාපාතො භවිස්සති, දිසාඩාහො භවිස්සති, භූමිචාලො භවිස්සති, දෙවදුන්දුභි භවිස්සති, චන්දිමසූරියනක්ඛත්තානං උග්ගමනං ඔගමනං සංකිලෙසං වොදානං භවිස්සති, එවංවිපාකො චන්දග්ගාහො භවිස්සති, එවංවිපාකො සූරියග්ගාහො භවිස්සති, එවංවිපාකො නක්ඛත්තග්ගාහො භවිස්සති, එවංවිපාකං චන්දිමසූරියානං පථගමනං භවිස්සති, එවංවිපාකං චන්දිමසූරියානං උප්පථගමනං භවිස්සති, එවංවිපාකං නක්ඛත්තානං පථගමනං භවිස්සති, එවංවිපාකං නක්ඛත්තානං උප්පථගමනං භවිස්සති, එවංවිපාකො උක්කාපාතො භවිස්සති, එවංවිපාකො දිසාඩාහො භවිස්සති, එවංවිපාකො භූමිචාලො භවිස්සති, එවංවිපාකො දෙවදුන්දුභි භවිස්සති, එවංවිපාකං චන්දිමසූරියනක්ඛත්තානං උග්ගමනං ඔගමනං සඞ්කිලෙසං වොදානං භවිස්සති, ඉති වා ඉතිඑවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "52. යම්සේ වනාහි ඇතැම් පින්වත් මහණබමුණෝ සැදැහැයෙන් දූන් බොජුන් වළඳා, මිණිලකුණූය, දඬුලකුණූය, වත්ලකුණුය, කඩුලකුණුය, ඊ ලකුණුය, දුනුලකුණුය, අවිලකුණුය, ඉතිරිලකුණුය, පුරිස්ලකුණුය, කුමරලකුණුය, කුමරිලකුණුය, දස්ලකුණුය, දැසිලකුණුය, ඇත්ලකුණුය, අස්ලකුණුය,මියුලකුණුය, වහප්ලකුණුය, ගොන්ලකුණුය, එළුලකුණුය, බැටෙළුලකුණුය, කුකුළුලකුණුය, වටුලකුණුය, ගොය්ලකුණුය, කැණීලකුණුය, කසුබුලකුණුය, මුවලකුණුය යන ආදි මෙබඳු තිරශ්චීන විද්‍යායෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ මේ කී හෝ මෙබඳු දැයින් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "53. යම්සේ වනාහි ඇතැම් පින්වත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, ‘අසෝ දිනැ අසෝ නැකැතින් අසෝ රජුන් (යුද සඳහා) සිය නුවරින් නික්මීම වන්නේ ය, අසෝ නැකැතිත් පෙරළා සිය නුවරට ඊම වන්නේ ය. අසෝ නැකැතින් රට තුළැ හුන් රජුන් පිටතැ සිටින සතුරු රජුන් හමු වන්නට යෑම වන්නේ ය. අසෝ නැකැතිත් පිටතැ සිටින සතුරු රජුන් ඉවත් වැ යෑම වන්නේ ය. අසෝ නැකැතිත් පිටතැ සිටින සතුරු රජුන් රට තුළැ සිටින රජුන් කරා පැමිණීම වන්නේ ය. අසෝ නැකැතින් ඇතුළතැ සිටින රජුන්ගේ ඉවත් වැ යෑම වන්නේ ය … රට තුළැ රජුනට ජය වන්නේ ය. පිටතැ සිටින සතුරු රජුනට පරාජය වන්නේ ය. පිටතැ සිටින සතුරු රජුනට ජය වන්නේ ය. ඇතුළතැ සිටින රජුනට පරාජය වන්නේ යැ”යී මෙසේ ‘මොහුට ජය වන්නේ ය, මොහුට පරාජය වන්නේ යැ’යී කියමින් මෙබඳු තිරශ්චීනවිද්‍යායෙන්, මෙබඳු මිථ්‍යාආජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ මේ හෝ මෙබඳු වූ තීරශ්චීන විද්‍යායෙන් මිථ්‍යාආජීවයෙන් වැළැක්කේ වෙයි. ‍මේ ද ඔහුගේ ශීලය වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "54. යම්සේ වනාහි ඇතැම් පින්වත් මහණබමුණෝ සැදැහෙන් දුන් බොජුන් වළඳා, “අසෝ දිනැ චන්‍ද්‍රග්‍රහණය වන්නේ ය, අසෝ දිනැ සුර්‍ය්‍යග්‍රහණය වන්නේ ය, අසෝ දිනැ නක්‍ෂත්‍රග්‍රහණය වන්නේ ය, අසෝ දිනැ සඳහිරුන් නිසි මඟින් යෑම වන්නේ ය, අසෝ දිනැ ඔවුන් නොමඟින් යෑම වන්නේ ය, අසෝ දිනැ නකත්තරුන් සුමඟින් යෑම වන්නේ ය, අසෝ දිනැ ඔවුන් නොමඟින් යෑම වන්නේ ය, අසෝ දිනැ උල්කාපතනය වන්නේ ය … දිග්දාහය වන්නේ ය, … භූමිකම්පා වන්නේ ය, ... වැසි නැති වැ අහස් ගෙරැවුම් වන්නේ ය, … සඳහිරුත් නකත්තරුන් උදාව, බැසීම, කෙලෙසීම, පිරිසිදු බව වන්නේ ය, සූර්‍ය්‍යග්‍රහණය ලොවට මෙබඳු පල දෙන්නේ ය, චන්‍ද්‍රග්‍රහණය මෙබඳු පල දෙන්නේ ය, සඳහිරුන් සුමඟින් යෑම මෙබඳු පල ගෙනැ දෙන්නේ ය, ඔවුන් නොමඟින් යෑම මෙබඳු පල ගෙනැ දෙන්නේ ය, නකත්තරුන්ගේ නිසි මඟින් යෑම මෙබඳු පල ගෙනැ දෙන්නේ ය, ඔවුන් නොමඟින් යෑම මෙබඳු පල ගෙන දෙන්නේ ය, උල්කාපතනය මෙබඳු පල ගෙනැ දෙන්නේ ය, දිග්දාහය මෙබඳු පල ගෙනැ දෙන්නේ ය, භූමිකම්පනය මෙබඳු පල ගෙනැ දෙන්නේ ය, වැසි නැති වැ අහස් ගෙරැවුම් මෙබඳු පල ගෙන දෙන්නේ ය, සඳහිරුන්ගේ ද නකත්තරුන්ගේ ද උදාවත් බැසීමත් කෙලෙසීමත් පිරිසිදු වීමත් මෙබඳු මෙබඳු පල ගෙන දෙන්නේ යැ”යි කියනුවෝ, මෙබඳු තිරශ්චීන විද්‍යායෙන් මෙබඳු මිථ්‍යා ආජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ මේ හෝ මෙබඳු තිරශ්වීනවිද්‍යායෙන් මිථ්‍යා ආජීවයෙන් වැළැක්කේ වෙයි. ‍මේ ද ඔහුගේ ශීලය වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 294,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "55. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති: සෙය්යථිදං: සුබ්බුට්ඨිකා භවිස්සති, දුබ්බුට්ඨිකා භවිස්සති, සුභික්ඛං භවිස්සති, දුබ්භික්ඛං භවිස්සති, ඛෙමං භවිස්සති, භයං භවිස්සති, රොගො භවිස්සති, ආරොග්යං භවිස්සති, මුද්දා ගණනා සංඛානං කාවෙය්යං ලොකායතං, ඉති වා ඉතිඑවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "56. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති, සෙය්යථිදං: ආවාහනං විවාහනං සංවදනං විවදණං සංකිරණං විකිරණං සුභගකරණං දුබ්භගකරණං විරුද්ධගබ්භකරණං ජිව්හානිත්ථම්භනං හනුසංහනනං හත්ථාභිජප්පනං __හනුජප්පනං__ කණ්ණජප්පනං ආදාසපඤ්හං කුමාරිපඤ්හං දෙවපඤ්හං ආදිච්චුපට්ඨානං මහතුපට්ඨානං අබ්භුජ්ජලනං සිරව්හායනං. ඉති වා ඉතිඑවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "57. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති, සෙය්යථිදං: සන්තිකම්මං පණිධිකම්මං [භූතකම්මං] භූරිකම්මං වස්සකම්මං වොස්සකම්මං වත්ථුකම්මං වත්ථුපරිකිරණං ආචමනං නහාපනං ජුහනං වමනං විරෙචනං උද්ධවිරෙචනං අධොවිරෙචනං සීසවිරෙචනං කණ්ණතෙලං නෙත්තතප්පනං නත්ථුකම්මං අඤ්ජනං පච්චඤ්ජනං සාලාකියං සල්ලකත්තියං දාරකතිකිච්ඡා මූලභෙසජ්ජානං අනුප්පදානං ඔසධීනං පටිමොක්ඛො. ඉති වා ඉතිඑවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "55. යම්සේ වනාහි ඇතැම් පින්වත් මහණබමුණෝ සැදැහෙන් දුන් බොජුන් වළඳා, “මේ සමයෙහි වැසි වස්නේ ය, මේ සමයෙහි නියං වන්නේ ය, මේ සමයෙහි රට සුභික්‍ෂ වන්නේ ය, මේ සමයෙහි රට දුර්භික්‍ෂ වන්නේ ය, මේ සමයෙහි රටට උවදුරු නැති වන්නේ ය, මේ සමයෙහි රටට උවදුරු ඇති වන්නේ ය, මේ කලැ රෝග වන්නේ ය, මේ කලැ රෝග නැති බව වන්නේ යැ යී පලාපල කීම ද, මුද්‍රාව (ඇඟිලි පුරුක්හි සංඛ්‍යා තබා ගිණීම) ද, ගණනාව (එක දෙක යන ආදීන් ගණන් කිරීම) ද, සංඛ්‍යානය (පිණ්ඩගණනාව) ද, කව් සතර ද, ලෝකායත ශාස්ත්‍රය ද යන මේ හෝ අන් මේ බඳු වූ තිරශ්චීන විද්‍යායෙන්, මිථ්‍යා ආජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ මේ ආදි වූ හෝ අන් මෙබඳු වූ තිරශ්චීන විද්‍යායෙන්, මිථ්‍යාආජීවයෙන් වැළැක්කේ වෙයි. මේ ද ඔහු‍ගේ ශීලය වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "56. යම්සේ වනාහි ඇතැම් භවත් මහණබමුණෝ සැදහෙන් දුන් බොජුන් වළඳා, ආවාහ සඳහා නකත් කීම, විවාහ සඳහා නකත් කීම, වෙන් වූ අඹු සැමියන් එක් වන්නට නකත් කීම, දුන් ණය රැස් කිරීමට නකත් කීම, මුදල් ණයට පොලියට දීමට නකත් කීම, සෞභාග්‍යය ඇති වනුවට යන්ත්‍රාදිය කැරැ දීම, බිම පාලු වන්නට හදි හූනියම් කිරීම, නැසෙන්නට යන දරු ගබ් රැකෙන්නට පිළියම් කිරීම, දිවගුළු බැඳීම, මන්ත්‍රාදි බලයෙත් හනු තද කිරීම, අත් පෙරැළෙන්නට මතුරු දැපීම, කන් අගුළු වැටෙන්නට මතුරු දැපීම, කැඩපතැ දේවතාවෙශය කොටැ ප්‍රශ්න ඇසීම, කුමරියක ලවා පේන කියැවීම, දෙව්දැස්සක ලවා පේන කියවීම, ජීවිකා පිණිස හිරු පිදීම, මහබඹු පිදීම, මතුරු දපා මුවින් ගිනි ජල් විහිදුවීම, මතුරු දපා සිරිකත කැඳවීම යන මේ හෝ අන් මෙ බඳු වූ හෝ තිරශ්චීන විද්‍යායෙන් මිථ්‍යාආජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ මේ ආදි වූ ද, අන් මෙබඳු වූ ද ඒ තිරශ්චීන විද්‍යායෙන් මිථ්‍යාආජීවයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලය වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "57. යම්සේ වනාහි ඇතැම් භවත් මහණබමුණෝ සැදැහෙන් දුන් බොජුන් වළඳා, ශාන්තිකර්‍ම, වාස්තුපරිකිරණ, මතුරු දපා අනුන් නැවීම, සෙත් පතා ගිනි පිදීම, ගිහියනට වමන කැරැවීම, ළය විරේක කැරැවීම්, වස්ති කිරීම, ශීර්‍ෂ විරෙචන බේත් දීම, කන් ලෙඩට තෙල් පිසැ දීම, ගිහිනට ඇසැ සිසිල ගන්වන බේත් තෙල් පිසීම, ගිහියනට නශ්‍ය දීම, ගිහියනට ඇස පටලයට කාරම් අඳුන් සාදා දීම, ඇසට සිසිල ගන්වන අඳුන් සාදා දීම, ගිහියන්ගේ ඇසැ උල්ඇන ලෙඩට බේත් දීම, ගිහියනට ශල්‍යකර්‍ම කිරීම, ළදරුවන්ගේ ලෙඩවලට පිළියම් කිරීම, මුල් බෙහෙත් දීම, කාරම් බෙහෙත් දීම, කාරම් බේත් බැඳ වණ සුව වූ පසු ඒවා ගලවා දැමීම යැ’යී මේ ආදී අන් හෝ මෙබඳු තිරශ්චීන විද්‍යායෙන් මිථ්‍යාආජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ ඒ සියල්ලෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලය වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 296,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "58. අථ ඛො බ්රාහ්මණ, භික්ඛු එවං සීලසම්පන්නො න කුතොචි භයං සමනුපස්සති යදිදං සීලසංවරතො. සෙය්යථාපි බ්රාහ්මණ, ඛත්තියො මුද්ධාවසිත්තො{1} නිහතපච්චාමිත්තො න කුතොචි භයං සමනුපස්සති යදිදං පච්චත්ථිකතො. එවමෙව ඛො බ්රාහ්මණ, භික්ඛු එවං සීලසම්පන්නො න කුතොචි භයං සමනුපස්සති යදිදං සීලසංවරතො. සො ඉමිනා අරියෙන සීලක්ඛන්ධෙන සමන්නාගතො අජ්ඣත්තං අනවජ්ජසුඛං පටිසංවෙදෙති. එවං ඛො බ්රාහ්මණ, භික්ඛු සීලසම්පන්නො හොති."
                    },
                    {
                        "type": "centered",
                        "text": "(මහාසීලං නිට්ඨිතං)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "59. කථඤ්ච බ්රාහ්මණ, භික්ඛු ඉන්ද්රියෙසු ගුත්තද්වාරො හොති? ඉධ බ්රාහ්මණ, භික්ඛු චක්ඛුනා රූපං දිස්වා න නිමිත්තග්ගාහී හොති නානුබ්යඤ්ජනග්ගාහී. යත්වාධිකරණමෙනං චක්ඛුන්ද්රියං අසංවුතං විහරන්තං අභිජ්ඣා දොමනස්සා පාපකා අකුසලා ධම්මා අන්වාස්සවෙය්යුං, තස්ස සංවරාය පටිපජ්ජති. රක්ඛති චක්ඛුන්ද්රියං, චක්ඛුන්ද්රියෙ සංවරං ආපජ්ජති. සොතෙන සද්දං සුත්වා -පෙ- ඝානෙන ගන්ධං ඝායිත්වා -පෙ- ජිව්හාය රසං සායිත්වා -පෙ- කායෙන ඵොට්ඨබ්බං ඵුසිත්වා -පෙ- මනසා ධම්මං විඤ්ඤාය න නිමිත්තග්ගාහී හොති නානුබ්යඤ්ජනග්ගාහී. යත්වාධිකරණමෙනං මනින්ද්රියං අසංවුතං විහරන්තං අභිජ්ඣාදොමනස්සා පාපකා අකුසලා ධම්මා අන්වාස්සවෙය්යුං, තස්ස සංවරාය පටිපජ්ජති, රක්ඛති මනින්ද්රියං, මනින්ද්රියෙ සංවරං ආපජ්ජති. සො ඉමිනා අරියෙන ඉන්ද්රියසංවරෙන සමන්නාගතො අජ්ඣත්තං අබ්යාසෙකසුඛං පටිසංවෙදෙති. එවං ඛො බ්රාහ්මණ, භික්ඛු ඉන්ද්රියෙසු ගුත්තද්වාරො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "60. කථඤ්ච බ්රාහ්මණ, භික්ඛු සතිසම්පජඤ්ඤෙන සමන්නාගතො හොති? ඉධ බ්රාහ්මණ, භික්ඛු අභික්කන්තෙ පටික්කන්තෙ සම්පජානකාරී හොති, ආලොකිතෙ විලොකිතෙ සම්පජානකාරී හොති, සම්මිඤ්ජිතෙ පසාරිතෙ සම්පජානකාරී හොති, සඞ්ඝාටිපත්තචීවරධාරණෙ සම්පජානකාරී හොති, අසිතෙ පීතෙ ඛායිතෙ සායිතෙ සම්පජානකාරී හොති. උච්චාරපස්සාවකම්මෙ සම්පජානකාරී හොති. ගතෙ ඨිතෙ නිසින්නෙ සුත්තෙ ජාගරිතෙ භාසිතෙ තුණ්හීභාවෙ සම්පජානකාරී හොති. එවං ඛො බ්රාහ්මණ, භික්ඛු සතිසම්පජඤ්ඤෙන සමන්නාගතො හොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1.මුද්ධාභිසිත්තො - බෞ.ස.ස"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "58. බමුණ, මහණ තෙමේ මෙසේ ශීලසම්පන්න වූයේ, ශීලසංවර හේතුයෙන් කිසි ම එක ද අසංවරතායෙකිත් ඇති වියැ හැකි බියක් නො දකී. බමුණ, කැත් අබිසෙස්නෙන් මුදුනැ අබිසෙස් ලත්, වැනැසූ සතුරන් ඇති කැත් රජෙක් කිසි ම එක ද සතුරකුගෙන් වියැ හැකි මොන ම බියකුත් යම් සේ ‍නො දක්නේ ද, බමුණ, එසේ ම මහණ තෙමේ මෙ පරිද්දෙන් ශීල සම්පන්න වූයේ, ශීලසංවර හේතුයෙන් කිසි ම එක ද අසංවරයෙකින් ඉපැදියැ හැකි බියක් නො දකී. හේ මේ ආර්‍ය්‍ය ශීලස්කන්‍ධයෙන් සමන්විත වූයේ, සිය සතන්හි නිදොස් වූ කායික චෛතසික සුව විඳී. බමුණ, මෙසේ වනාහි මහණ තෙමේ ශීල සම්පන්න වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 22,
                        "text": "(මහ සිල් නිමියේ ය.)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "59. බමුණ, මහණ තෙමේ කෙසේ නම් ඉඳුරන්හි වැසූ දොරැත්තේ වේ ද? යත්: බමුණ, මේ සස්නැ මහණ තෙමේ ඇසින් රුවක් දැක සුබ ඈ විසින් එහි ලකුණු නොගන්නේ වේ. සුබ ඈ විසින් අත් පා ඈ අවයවවල අයුරු සිතට නො ගන්නේ වේ. යම් කරුණෙකින් චක්‍ෂුරින්ද්‍රියය නොවසාගෙන වසන්නහුගේ සිත්සතනට විසම ලොබ දොම්නස් ඈ ලාමක අකුසල් දහම්හු පුන පුනා වෑස්සෙත් ද, එහි ඒ චක්‍ෂුරින්ද්‍රියයාගේ සංවරය පිණිස හේ පිළිපදී. එය රැක ගනී එහි සංවරයට පැමිණේ. කනින් හඬ අසා … නැහැයෙන් ගඳ ආඝ්‍රණය කොට, … දිවෙන් රස ආස්වාද කොට … කයින් ස්ප්‍රෂ්ටව්‍ය ස්පර්‍ශ කොට … සිතින් දහම් අරමුණු දැන … සුබ ඈ විසින් එහි ලකුණු ගන්නේ නො වේ, සුබ ඈ විසින් අත් පා ඈ අවයවවල අයුරු සිතට ගත්තේ නො වේ. යම් කරුණෙකින් ශ්‍රොත්‍රෙන්ද්‍රියය … ඝ්‍රාණෙන්ද්‍රියය … ජීහ්වේන්‍ද්‍රියය ... කායෙන්ද්‍රියය ... මනඉන්ද්‍රියය සංවර කොට නොගෙන වසන්නහුගේ සිත්සතනට විසම ලොබ දොම්නස ආදී ලාමක අකුසල් දහම්හු පුන පුනා වෑස්සෙන්නෝ ද, ඒ ඉන්‍ද්‍රියයන්ගේ සංවරය පිණිස පිළිපදී. ශ්‍රොත්‍ර ... ඝ්‍රාණ ... ජිහ්වා ... කාය ... මන ඉන්‍ද්‍රියයාගේ සංවරය පිණිස පිළිපදී ... ඒ මනින්‍ද්‍රියය රැකැ ගනී. එහි සංවරයට පැමිණේ. හේ මේ ආර්‍ය්‍ය වූ ඉන්‍ද්‍රියයසංවරයෙන් සමන්විත වුයේ සිය සතන්හි කෙලෙසුන්ගෙන් තෙත් නොවීමෙන් වූ පිරිසිදු අධිචිත්තසුඛය විඳී. බමුණ, මෙසේ වනාහි මහණ තෙම ඉන්‍දියයන්හි වැසූ දොරැතියේ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "60. බමුණ, මහණ තෙම් කෙසේ නම් සතිසම්පජඤ්ඤයෙන් සමන්විත වේ ද? යත්: බමුණ, මේ සස්නැ මහණ ඉදිරි ගමනෙහි, පෙරළා ඊමෙහි, අත්පා ඈ හැකිළීමෙහි, දික් කිරීමෙහි, නුවණින් දැන ම එය කරනුයේ වෙයි. සඟළ සිවුර ද පාත්‍රය ද සෙසු සිවුරු ද දැරීමෙහි නුවණින් දැන ම කරන්නේ වෙයි. අහර ගැන්මෙහි, පැන් පීමෙහි, පිටි කැවිලි ඈ කෑමෙහි, රස විඳීමෙහි, මල මූ පහ කිරීමෙහි, යෑමෙහි, සිටුමෙහි, හිඳුමෙහි, පිබිදුමෙහි, බිණුමෙහි, නොබිණුමෙහි නුවණින් දැන කරනුයේ වෙයි. බමුණ, මෙසේ වනාහි මහණ තෙම සිහි නුවණින් සමන්විත වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 298,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "61. කථඤ්ච බ්රාහ්මණ, භික්ඛු සන්තුට්ඨො හොති? ඉධ බ්රාහ්මණ, භික්ඛු සන්තුට්ඨො හොති කායපරිහාරිකෙන චීවරෙන කුච්ඡිපරිහාරිකෙන පිණ්ඩපාතෙන. සො යෙන යෙනෙව පක්කමති සමාදායෙව පක්කමති. සෙය්යථාපි බ්රාහ්මණ, පක්ඛී සකුණො යෙන යෙනෙව ඩෙති සපත්තභාරොව ඩෙති, එවමෙව ඛො බ්රාහ්මණ, භික්ඛු සන්තුට්ඨො හොති කායපරිහාරිකෙන චීවරෙන කුච්ඡිපරිහාරිකෙන පිණ්ඩපාතෙන. සො යෙන යෙනෙව පක්කමති සමාදායෙව පක්කමති. එවං ඛො බ්රාහ්මණ, භික්ඛු සන්තුට්ඨො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "62. සො ඉමිනා ච අරියෙන සීලක්ඛන්ධෙන සමන්නාගතො, ඉමිනා ච අරියෙන ඉන්ද්රියසංවරෙන සමන්නාගතො, ඉමිනා ච අරියෙන සතිසම්පජඤ්ඤෙන සමන්නාගතො, ඉමාය ච අරියාය සන්තුට්ඨියා සමන්නාගතො, විවිත්තං සෙනාසනං භජති අරඤ්ඤං රුක්ඛමූලං පබ්බතං කන්දරං ගිරිගුහං සුසානං වනපත්ථං අබ්භොකාසං පලාලපුඤ්ජං. සො පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො නිසීදති පල්ලඞ්කං ආභුජිත්වා උජුං කායං පණිධාය පරිමුඛං සතිං උපට්ඨපෙත්වා."
                    },
                    {
                        "type": "paragraph",
                        "text": "63. සො අභිජ්ඣං ලොකෙ පහාය විගතාභිජ්ඣෙන චෙතසා විහරති. අභිජ්ඣාය චිත්තං පරිසොධෙති. බ්යාපාදපදොසං පහාය අබ්යාපන්නචිත්තො විහරති සබ්බපාණභූතහිතානුකම්පී. බ්යාපාදපදොසා චිත්තං පරිසොධෙති. ථිනමිද්ධං පහාය විගතථිනමිද්ධො විහරති ආලොකසඤ්ඤී සතො සම්පජානො. ථිනමිද්ධා චිත්තං පරිසොධෙති. උද්ධච්චකුක්කුච්චං පහාය අනුද්ධතො විහරති අජ්ඣත්තං වූපසන්තචිත්තො උද්ධච්චකුක්කුච්චා චිත්තං පරිසොධෙති. විචිකිච්ඡං පහාය තිණ්ණවිචිකිච්ඡො විහරති. අකථංකථී කුසලෙසු ධම්මෙසු. විචිකිච්ඡාය චිත්තං පරිසොධෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "64. සෙය්යථාපි බ්රාහ්මණ, පුරිසො ඉණං ආදාය කම්මන්තෙ පයොජෙය්ය, තස්ස තෙ කම්මන්තා සමිජ්ඣෙය්යුං, සො යානි ච පොරාණානි ඉණමූලානි තානි ච බ්යන්තීකරෙය්ය, සියා චස්ස උත්තරිං අවසිට්ඨං දාරභරණාය, තස්ස එවමස්ස: “අහං ඛො පුබ්බෙ ඉණං ආදාය කම්මන්තෙ පයොජෙසිං. තස්ස මෙ තෙ කම්මන්තා සමිජ්ඣිංසු. සො’හං යානි ච පොරාණානි ඉණමූලානි තානි ච බ්යන්තී අකාසිං. අත්ථි ච මෙ උත්තරිං අවසිට්ඨං දාරභරණායා”ති. සො තතොනිදානං ලභෙථ පාමොජ්ජං. අධිගච්ඡෙය්ය සොමනස්සං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "61. බමුණ, කෙසේ නම් මහණ තෙමේ ලද පමණෙහි සතුටු වේ ද? බමුණ, මෙහි මහණ තෙමේ කය වසා රක්නට පමණ වූ සිවුරෙන් ද, කුස ගිනි නිවන්නට පමණ වූ අහරින් ද සතුටු වෙයි. හේ යන යන අතැ අටපිරිකර පමණක් ගෙන ම නික්මෙයි. බමුණ, යම් සේ පියා හඹන කුරුළු තෙමේ යන යන තැනට පියාපත් බර ඇති ව ම පියා හඹා ද, එසේ ම මහණ තෙමේ කය වසා රක්නට පමණ වූ සිවුරින් ද කුස ගිති නිවන්නට පමණ වූ අහරින් ද සතුටු වෙයි. හේ තමා යන තැනට පාසිවුරු ඈ අටපිරිකර පමණක් ගෙන ම යෙයි. බමුණ, මෙසේ මහණ තෙමේ ලත් පසයෙහි සතුටු වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "62. බමුණ, ඒ මහණ මේ ආර්‍ය්‍ය ශීලස්කන්‍ධයෙන් ද සමන්විත වූයේ, මේ ආර්‍ය්‍ය ඉන්‍ද්‍රියසංවරයෙන් ද … මේ ආර්‍ය්‍යස්මෘතිසම්ප්‍රජන්‍යයෙන් ද … මේ ආර්‍ය්‍ය සන්තුෂ්ටියෙන් ද සමන්විත වූයේ, අරන් පවු කඳුරැලි ගිරිගුහා සොහොන් වනපෙත් එළිමහන් පිදුරුලෙන් යන මෙකී මිනිසුන්ගෙන් හිස් කිසි සෙනස්නක් බජයි. හේ පිඬු සෙවීමෙන් පෙරළා ආයේ පසුබතැ පලක් බැඳ උඩු කය කෙළින් තබා සිහිය කමටහනට යොමු කොට එළවා හිඳී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "63. හේ ලොවැ ඇල්ම හැර, පහ වූ අභිජඣායෙන් යුත් සිතින් වෙසෙයි. අභිජඣාව කෙරෙන් සිත පිරිසිදු කෙරෙයි. ප්‍රද්වේෂය හැර, ව්‍යාපාද රහිත සිතැත්තේ හැම පණ ඇති සතුන් කෙරේ හිතානුකම්පා ඇති වැ වෙසෙයි. ක්‍රෝධය කෙරෙන් සිත පිරිසිදු කෙරෙයි. ස්ත්‍යානමිද්ධය හැර, පහ වූ ස්ත්‍යානමිද්ධය ඇත්තේ, දව රෑ දෙක්හි ම දුටු එළිය අඳුනනු හැකි පිරිසිදු සංඥාව ඇත්තේ සිහියෙනුත් යුතු ව වෙසෙයි. මිද්ධය කෙරෙන් සිත පිරිසිදු කෙරෙයි. උදහසත් කුකුසත් සිතින් දුරැ ලා, නො උදහස් ව, සංහුන් සිය සිත් සතන් ඇත්තේ, උදහස් කුකුස් දෙක කෙරෙන් සිත පිරිසිදු කෙරෙයි. සැකය දුරැ ලා, පහ වූ සැක ඇත්තේ, කුසල් දහම්හි සැක නොකරනුයේ, සැකය කෙරෙන් සිත පිරිසිදු කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "64. බමුණ, යම්සේ මිනිසෙක් පොලියට ණය මුදලක් ගෙන කර්‍මාන්ත කරන්නේ ද, ඔහුගේ ඒ කර්‍මාන්තය සමෘද්ධ වන්නේ නම් හේ වූ තාක් හැම පරණ ණය ගෙවා අවසන් කරන්නේ ද, මත්තෙහි ඉතිරි වූ යමක් ඇතොත් එය අඹුදරුවන් රක්නා පිණිස වන්නේ ද, එසේ වූ ඔහුට “මම් පළමුවෙන් ණයට මුදල් ගෙන කර්‍මාන්ත කෙළෙමි. ඒ මාගේ කර්‍මාන්ත සමෘද්ධ විය. ඒ මම් වූ තාක් සියලු පරණ ණය ගෙවා අවසන් කෙළෙමි. අඹුදරුවන් රක්නා පිණිස ඉතිරි වූ මුදලෙක් ද මට ඇත්තේ යැ”යි මෙසේ සිතෙක් වන්නේ ය. හේ ඒ කරුණින් සතුට ලබන්නේ ය, සොම්නසට පැමිණෙන්නේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 300,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "65. සෙය්යථාපි බ්රාහ්මණ, පුරිසො ආබාධිකො අස්ස දුක්ඛිතො බාළ්හගිලානො, භත්තං චස්ස නච්ඡාදෙය්ය, න චස්ස කායෙ බලමත්තා. සො අපරෙන සමයෙන තම්හා ආබාධා මුච්චෙය්ය, භත්තඤ්චස්ස ඡාදෙය්ය, සියා චස්ස කායෙ බලමත්තා. තස්ස එවමස්ස: අහං ඛො පුබ්බෙ ආබාධිකො අහොසිං, දුක්ඛිතො බාළ්හගිලානො, භත්තං ච මෙ නච්ඡාදෙසි. න චස්ස මෙ ආසි කායෙ බලමත්තා. සො’ම්හි එතරහි තම්හා ආබාධා මුත්තො භත්තඤ්ච මෙ ඡාදෙති, අත්ථි ච මෙ කායෙ බලමත්තා’ති. සො තතොනිදානං ලභෙථ පාමොජ්ජං අධිගච්ඡෙය්ය සොමනස්සං."
                    },
                    {
                        "type": "paragraph",
                        "text": "66. සෙය්යථාපි බ්රාහ්මණ, පුරිසො බන්ධනාගාරෙ බද්ධො අස්ස. සො අපරෙන සමයෙන තම්හා බන්ධනා මුච්චෙය්ය සොත්ථිනා අබ්බයෙන. න චස්ස කිඤ්චි භොගානං වයො. තස්ස එවමස්ස: ‘අහං ඛො පුබ්බෙ බන්ධනාගාරෙ බද්ධො අහොසිං. සොම්හි එතරහි තම්හා බන්ධනා මුත්තො සොත්ථිනා අබ්බයෙන. නත්ථි ච මෙ කිඤ්චි භොගානං වයො’ති. සො තතොනිදානං ලභෙථ පාමොජ්ජං, අධිගච්ඡෙය්ය සොමනස්සං."
                    },
                    {
                        "type": "paragraph",
                        "text": "67. සෙය්යථාපි බ්රාහ්මණ, පුරිසො දාසො අස්ස අනත්තාධීනො පරාධීනො න යෙනකාමඞ්ගමො. සො අපරෙන සමයෙන තම්හා දාසබ්යා මුච්චෙය්ය, අත්තාධීනො අපරාධීනො භුජිස්සො යෙනකාමඞ්ගමො. තස්ස එවමස්ස: ‘අහං ඛො පුබ්බෙ දාසො අහොසිං අනත්තාධීනො පරාධීනො න යෙනකාමඞ්ගමො. සො’ම්හි එතරහි තම්හා දාසබ්යා මුත්තො අත්තාධීනො අපරාධීනො භුජිස්සො යෙනකාමඞ්ගමො’ති. සො තතො නිදානං ලභෙථ පාමොජ්ජං අධිගච්ඡෙය්ය සොමනස්සං."
                    },
                    {
                        "type": "paragraph",
                        "text": "68. සෙය්යථාපි බ්රාහ්මණ, පුරිසො සධනො සභොගො කන්තාරද්ධානමග්ගං පටිපජ්ජෙය්ය දුබ්භික්ඛං සප්පටිභයං. සො අපරෙන සමයෙන තං කන්තාරං නිත්ථරෙය්ය, සොත්ථිනා ගාමන්තං අනුපාපුණෙය්ය ඛෙමං අප්පටිභයං. තස්ස එවමස්ස: ‘අහං ඛො පුබ්බෙ සධනො සභොගො කන්තාරද්ධානමග්ගං පටිපජ්ජිං දුබ්භික්ඛං සප්පටිභයං. සො’ම්හි එතරහි තං කන්තාරං නිත්ථිණ්ණො සොත්ථිනා ගාමන්තං අනුප්පත්තො ඛෙමං අප්පටිභයන්ති. සො තතො නිදානං ලභෙථ පාමොජ්ජං අධිගච්ඡෙය්ය සොමනස්සං."
                    },
                    {
                        "type": "paragraph",
                        "text": "69. එවමෙව ඛො බ්රාහ්මණ, භික්ඛු යථා ඉණං යථා රොගං යථා බන්ධනාගාරං යථා දාසබ්යං යථා කන්තාරද්ධානමග්ගං. එවං ඉමෙ පඤ්ච නීවරණෙ අප්පහීනෙ අත්තනි සමනුපස්සති. සෙය්යථාපි බ්රාහ්මණ, ආනණ්යං යථා ආරොග්යං යථා බන්ධනා මොක්ඛං යථා භුජිස්සං යථා ඛෙමන්තභූමිං, එවමෙව ඛො බ්රාහ්මණ, භික්ඛු ඉමෙ පඤ්චනීවරණෙ පහීනෙ අත්තනි සමනුපස්සති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "65. බමුණ, යම්සේ මිනිසෙක් රෝගී වූයේ, දුකට පැමිණියේ, දැඩි ගිලන් වන්නේ ද, ඔහුට බතුත් නො රිසියෙන්නේ ද, ඔහුගේ ඇඟපත සවි පමණකුත් නො වන්නේ ද, හේ මෑත කලැ ඒ ලෙඩින් මිදෙන්නේ නම්, ඔහුට බතුත් රිසියේ නම්, ඔහු ඇඟ පත සවිය ද වන්නේ තම්, ඔහුට “මම් වූ කලි පෙරැ දුකට පත්, දැඩි ගිලන් ලෙඩෙක් වීමි. මට අහරත් ‍නො රිසි වී ය. ඇඟපතත් සවිය නො වී ය. ඒ මම් දැන් ඒ ලෙඩින් මිදුණෙම් වෙමි. ඒ මට අහරත් රිසියෙයි. ඇඟපතැ සවියත් ඇත්තේ යැ”යී මෙසේ සිතක් වතොත්, හේ එ කරුණින් සතුට ලබන්නේ ය, සොම්නසට පැමිණෙන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "66. බමුණ, යම්සේ මිනිසෙක් හිරගෙහි බැඳුණේ වන්නේ ද, හේ පසු කලෙක ධනය නො විසදා පහසුවෙන් එයින් මිදෙන්නේ ද, එයින් ඔහුගේ කිසි භෝග විනාශයෙක් නො වන්නේ ද, ඔහුට “මම් වූ කලි පෙරැ හිර ගෙහි බැඳුණෙම් වීමි. ඒ මම් දැන් ධන නො විසදා පහසුයෙන් එයින් මිදුණෙම් වෙමි. මාගේ භෝගයනට කිසි විනාශයෙකුත් නැතැ’ යි මෙසේ සිතෙක් වන්නේ ද, හේ එ කරුණින් සතුට ලබන්නේ ය, සොම්නසට පැමිණෙන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "67. බමුණ, තමා අයත් පැවැතුම් නැති, මෙරමා අයත් පැවැතුම් ඇති, කැමැති අතෙක යන්නට අවසර නැති, දාස පුරුෂයෙක් යම්සේ වන්නේ ද, හේ පසු කලෙක තමා අයත් පැවැතුම් ඇතියේ, මෙරමා, අයත් පැවැතුම් නැතියේ, නිදහස් වූයේ, කැමැති අතෙකැ යෑ හැකි වූයේ, ඒ දාසභාවයෙන් මිදෙන්නේ ද, එසේ වූ ඔහුව “මම් වූ කලි පෙරැ තමා අයත් පැවැතුම් නැති, මෙරමා අයත් පැවැතුම් ඇති, කැමැති අතෙක යෑ නොහැකි, දාසයෙකිම් වීමි. ඒ මම් දැන් ඒ දාස භාවයෙන් මිදුණෙම්, තමා අයත් පැවැතුම් ඇතියෙම්, මෙරමා අයත් පැවැතුම් නැතියෙම්, නිදහස් වූයෙම්, කැමැති අතෙක යෑ හැකියෙම් වෙමි”යී මෙසේ සිතෙක් වන්නේ ද, හේ එ කරුණින් සතුට ලබන්නේ ය, සොම්නසට පැමිණෙන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "68. බමුණ, යම්සේ ධනවත් භෝගසම්පත් ඇති පුරුෂයෙක් අහර හිඟ, උවදුරැති, දිය නැති දික් මඟකට බස්නේ ද, හේ පසු කලෙක සුව සේ ඒ නිරුදක පෙදෙස ඉක්මැ යන්නේ ද, උවදුරු නැති ගම්මානකට බස්නේ ද, එසේ වූ ඔහුට “මම් වූ කලි පෙරැ ධන ඇතියෙම්, භෝගසම්පත් ඇතියෙම්, දිය නැති අහර හිඟ බිය ඇති දික් මඟකට බටිමි. ඒ මම් දැන් සුවසේ ඒ කතර තිණූයෙම්. උවදුරු නැති බිය නැති ගමකට බටුයෙම් වෙමි’යී මෙසේ සිතෙක් වන්නේ ද, හේ එ කරුණින් සතුට ලබන්නේ ය, සොම්නසට පැමිණෙන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "69. බමුණ, එසේ ම මහණ තෙමේ ණයක් මෙන්, ලෙඩක් මෙන්, හිර ‍ගෙයක් මෙන්, වහල් බවක් මෙන්, දිය නැති දික් මඟක් මෙන් (පිළිවෙළින්) මේ නොපහවූ නීවරණ පස තමා කෙරෙහි දකී. ණය නැති බව සේ, නො ලෙඩ බව සේ, හිරෙන් මිදුණු බව සේ, උවදුරු නැති සේ (පිළිවෙළින්) මේ පහ වූ නීවරණ පස (හෙවත් මේ නීවරණ පසේ දුරු වූ අවස්ථාව) තමා කෙරෙහි දකී.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 302,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "70. තස්සිමෙ පඤ්චනීවරණෙ පහීනෙ අත්තනි සමනුපස්සතො පාමොජ්ජං{__1__} ජායති. පමුදිතස්ස පීති ජායති. පීතිමනස්ස කායො පස්සම්භති. පස්සද්ධකායො සුඛං වෙදෙති. සුඛිනො චිත්තං සමාධියති."
                    },
                    {
                        "type": "paragraph",
                        "text": "71. සො විවිච්චෙව කාමෙහි, විවිච්ච අකුසලෙහි ධම්මෙහි, සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමජ්ඣානං උපසම්පජ්ජ විහරති. සො ඉමමෙව කායං විවෙකජෙන පීතිසුඛෙන අභිසන්තෙති පරිසන්තෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස විවෙකජෙන පීතිසුඛෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "72. සෙය්යථාපි බ්රාහ්මණ, දක්ඛො න්හාපකො වා න්හාපකන්තෙවාසී වා කංසථාලෙ න්හානීයචුණ්ණානි ආකිරිත්වා උදකෙන පරිප්ඵොසකං පරිප්ඵොසකං සන්නෙය්ය, සායං න්හානීයපිණ්ඩි ස්නෙහානුගතා ස්නෙහපරෙතා සන්තරබාහිරා ඵුටා ස්නෙහෙන, න ච පග්ඝරණී."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො බ්රාහ්මණ, භික්ඛු ඉමමෙව කායං විවෙකජෙන පීතිසුඛෙන අභිසන්තෙති පරිසන්තෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස විවෙකජෙන පීතිසුඛෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො බ්රාහ්මණ, යඤ්ඤො පුරිමෙහි යඤ්ඤෙහි අප්පට්ඨතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "73. පුන ච පරං බ්රාහ්මණ, භික්ඛු විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියජ්ඣානං උපසම්පජ්ජ විහරති. සො ඉමමෙව කායං සමාධිජෙන පීතිසුඛෙන අභිසන්නෙති පරිසන්නෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස සමාධිජෙන පීතිසුඛෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "74. සෙය්යථාපි බ්රාහ්මණ, උදකරහදො ගම්භීරො උබ්භිදොදකො, තස්ස නෙවස්ස පුරත්ථිමාය දිසාය උදකස්ස ආයමුඛං, න දක්ඛිණාය දිසාය උදකස්ස ආයමුඛං, න පච්ඡිමාය දිසාය උදකස්ස ආයමුඛං, න උත්තරාය දිසාය උදකස්ස ආයමුඛං, දෙවො ච න කාලෙන කාලං සම්මා ධාරං අනුපවෙච්ඡෙය්ය, අථ ඛො තම්හා ව උදකරහදා සීතා වාරිධාරා උබ්භිජ්ජිත්වා තමෙව උදකරහදං සීතෙන වාරිනා අභිසන්නෙය්ය පරිසන්නෙය්ය පරිපූරෙය්ය පරිප්ඵරෙය්ය. නාස්ස කිඤ්චි සබ්බාවතො උදකරහදස්ස සීතෙන වාරිනා අප්ඵුටං අස්ස. එවමෙව ඛො බ්රාහ්මණ, භික්ඛු ඉමමෙව කායං සමාධිජෙන පීතිසුඛෙන අභිසන්නෙති පරිසන්නෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස සමාධිජෙන පීතිසුඛෙන අප්ඵුටං හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "70. මේ නීවරණ පස තමා කෙරෙහි පහ වූවා දක්නා ඔහුට සතුට උපදී. සතුටු වූවහුට ප්‍රීතිය උපදී. ප්‍රීතිය සිතැ ඇත්තහුගේ නම්කය සංහිඳේ. සංහුන් නම්කය ඇත්තේ සුව විඳී. සුවැත්තහු සිත අරමුණෙහි එකඟ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "71. හේ කාමයන්ගෙන් වෙන් ව ම සෙසු අකුසල් දහමුන්ගෙන් ද වෙන් ව ම, විතර්‍කසහිත, විචාරසහිත, විවේකයෙන් (නීවරණ පහ වීමෙන්) ප්‍රීතියත් සුවයත් ඇති, පළමු දහන ලැබ වෙසෙයි. හේ මේ කරජ කය ම විවේකයෙන් උපන් පීති සුවයෙන් තෙමයි, මුළුල්ල ම තෙමයි. පුරා ලයි, මුළුල්ල ම ස්පර්‍ශ කෙරෙයි. සියලු අඟ පසඟ ඇති ඔහු මුළු කයෙහි (ඒ පීති සුවයෙන්) පැතිර නොගත් කිසි ද තැනෙක් නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "72. බමුණ, යම්සේ දක්‍ෂ කිලිඟෙක් හෝ කිලිඟකුගේ අතැවැස්සෙක් හෝ ලොහො තලියෙක නාන සුණු බහා දිය ඉස ඉස පිඬු කරන්නේ ද, ඒ නාන සුණු පිඬ කාවැදුණු දියැත්තේ, හැම තැන ම දියෙන් යුත් වූයේ, ඇතුළත පිටත සහිත ව මුළුල්ල ම දියෙන් පැතිරැ ගියේ, දියත් නො වගුරුවන්නේ වේ ද, ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, එසේ ම මහණ තෙමේ මේ කරජ කය ම විවේකයෙන් උපන් පීතිසුවයෙන් තෙමයි, මුළුල්ල ම තෙමයි, පුරා ලයි, මුළුල්ල ම ස්පර්‍ශ කෙරෙයි. ඔහුගේ සියලු අඟ පසඟ ඇති කයෙහි විවෙකජ ප්‍රීතිසුඛයෙන් පැතිරැ වැදැ නොගත් කිසි ද තැනෙක් නො වෙයි. ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "බමුණ, මේ වූ කලි පළමු දැක්වුණු යඥයනට වඩා මඳ කටයුතු ඇති, වඩා මඳ තැතින් සිදු කට හැකි, එහෙත් වඩා මහත් පල ඇති වූත් වඩා මහත් අනුහස් ඇති වූත් යඥයෙකි."
                    },
                    {
                        "format": 13,
                        "text": "73. බමුණ, නැවැත ද (අනෙකක් කියම්.) මහණ තෙමේ විතර්‍ක විචාර දෙකේ සංහිඳීමෙන් සිය සතන්හි උපන්, සිය සතන් පහදවන, සිතැ එකඟ බව ඇති, විතර්‍කය නැති, විචාරය නැති, සමාධියෙන් උපන්, ප්‍රීතියත් සුවයත් ඇති දෙවෙනි දහනට පැමිණ වෙසෙයි. හේ මේ කරජ කය ම සමාධියෙන් උපන් ප්‍රීතිසුඛයෙන් තෙමයි, මුළුල්ල ම තෙත් කෙරෙයි, පුරා ලයි, හැම තැන ම පහසී. විවේකයෙන් උපන් ප්‍රීතිසුඛයෙන් පැතිරැ නොගත් ඔහු සියලු කයේ කිසි ද තැනෙක් නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "74. බමුණ, යම් සේ උල්පතින් මතු වන දිය ඇති විලෙක් වේ ද, එයට පෙර දිගින් දිය ඇතුළු වන මඟක් නොවතත්, දකුණු දිගිනුත් දිය වදිනා මඟක් නොවතත්, පැසිම් දිගිනුත් දිය වදිනා මඟක් නොවතත්, උතුරු දිගිනුත් දිය වදිනා මඟක් නොවතත්, වැස්සත් කලින් කලැ සුදුසු පරිදි නො වසිතත්, එහෙත් ඒ විලෙන් සිහිල් දිය දහර මතු වී ඒ විල ම සිහිල් දියෙන් තෙමන්නේ ද, මුළුල්ල තෙමන්නේ ද, පුරා ලන්නේ ද, හැම තැන ම වැද ගෙන සිටී ද, එයින් පැතිරැ වැද නොගත් තැනෙක් නො වන්නේ ද, එසේ ම, බමුණ, මහණ තෙමේ මේ කරජ කය ම සමාධියෙන් උපන් පීතිසුවයෙන් තෙමයි. හැම තැන ම තෙත් කෙරෙයි, පුරා ලයි, හැම තැන ම පැතිරැ වැද ගනී. ඔහුගේ කයේ සමාධියෙන් උපන් පීති සුවය පැතිරැ වැද නොගත් කිසි ද තැ‍නෙක් නො වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 304,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො බ්රාහ්මණ, යඤ්ඤො පුරිමෙහි යඤ්ඤෙහි අප්පට්ඨතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "75. පුන ච පරං බ්රාහ්මණ, භික්ඛු පීතියා ච විරාගා උපෙක්ඛකො ච විහරති සතො සම්පජානො, සුඛඤ්ච කායෙන පටිසංවෙදෙති. යන්තං අරියා ආචික්ඛන්ති උපෙක්ඛකො සතිමා සුඛවිහාරීති. තං තතියං ඣානං උපසම්පජ්ජ විහරති. සො ඉමමෙව කායං නිප්පීතිකෙන සුඛෙන අභිසන්නෙති පරිසන්නෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස නිප්පීතිකෙන සුඛෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "76. සෙය්යථාපි බ්රාහ්මණ, උප්පලිනියං වා පදුමිනියං වා පුණ්ඩරීකිනියං වා අප්පෙකච්චානි උප්පලානි වා පදුමානි වා පුණ්ඩරීකානි වා උදකෙ ජාතානි උදකෙ සංවද්ධානි{1} උදකානුග්ගතානි අන්තොනිමුග්ගපොසීනි, තානි යාව චග්ගා යාව ච මූලා සීතෙන වාරිනා අභිසන්නානි{2} පරිසන්නානි පරිපූරානි පරිප්ඵුටානි. නාස්ස කිඤ්චි සබ්බාවතං උප්පලානං වා පදුමානං වා පුණ්ඩරීකානං වා සීතෙන වාරිනා අප්ඵුටං අස්ස. එවමෙව ඛො බ්රාහ්මණ, භික්ඛු ඉමමෙව කායං නිප්පීතිකෙන සුඛෙන අභිසන්නෙති පරිසන්නෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස නිප්පීතිකෙන සුඛෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො බ්රාහ්මණ, යඤ්ඤො පුරිමෙහි යඤ්ඤෙහි අප්පට්ඨතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "77. පුන ච පරං බ්රාහ්මණ, භික්ඛු සුඛස්ස ච පහානා දුක්ඛස්ස ච පහානා පුබ්බෙව සොමනස්සදොමනස්සානං අත්ථඞ්ගමා අදුක්ඛමසුඛං උපෙක්ඛාසතිපාරිසුද්ධිං චතුත්ථං ඣානං උපසම්පජ්ජ විහරති. සො ඉමමෙව කායං පරිසුද්ධෙන චෙතසා පරියොදාතෙන ඵරිත්වා නිසින්නො හොති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස පරිසුද්ධෙන චෙතසා පරියොදාතෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "78. සෙය්යථාපි බ්රාහ්මණ, පුරිසො ඔදාතෙන වත්ථෙන සසීසං පාරුපිත්වා නිසින්නො අස්ස, නාස්ස කිඤ්චි සබ්බාවතො කායස්ස ඔදාතෙන වත්ථෙන අප්ඵුටං අස්ස. එවමෙව ඛො බ්රාහ්මණ, භික්ඛු ඉමමෙව කායං පරිසුද්ධෙන චෙතසා පරියොදාතෙන ඵරිත්වා නිසින්නො හොති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස පරිසුද්ධෙන චෙතසා පරියොදාතෙන අප්ඵුටං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො බ්රාහ්මණ, යඤ්ඤො පුරිමෙහි යඤ්ඤෙහි අප්පට්ඨතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො ච."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සංවුද්ධානි - __කෙසුචි__ පොත්ථකෙසු"
                    },
                    {
                        "type": "footnote",
                        "text": "2. අභිසන්දානි පරිසන්දානි - මඡසං, PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "බමුණ, මේ වූ කලි පළමු දැක්වුණු යඥයනට වඩා මඳ කටයුතු ඇති, වඩා මඳ තැතින් සිදු කට හැකි, එහෙත් එ හැමට වඩා මහත් පල ද මහත් අනුහස් ද ඇති යඥයෙක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "75. තව ද බමුණ, මහණ තෙමේ ප්‍රීතිය සංහිඳීමෙන් උපේක්‍ෂායෙන් යුතු ව, සිහියෙන් හා නුවණින් හා යුතු වැ වෙසෙයි. සුවය ද කයින් විඳී. අරී පුඟුලෝ යම් දහනක් හේතු කොට ගෙන දහන් ලැබුවහු ඇරැබ ‘මෙ තෙමේ උපේක්ෂාව ඇත්තේ ය, සිහි ඇත්තේ ය, සුව විසුම් ඇත්තේ යැ’ යී කියත් ද, හේ (එසේ වූ) ඒ තෙවෙනි දහන් පැමිණ (ලැබ) වෙසෙයි. හේ මේ කය ම ප්‍රීති රහිත සුවයෙන් තෙමයි, මුළුල්ල ම තෙත් කෙරෙයි, පුරා ලයි, හැම තැන ම පැතිර වැද ගනී. ඔහුගේ කයෙහි ඒ ප්‍රීතිරහිත සුවයෙන් පැතිරැ වැද නොගත් කිසි ද තැනෙක් නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "76. බමුණ, යම් සේ උපුල් විලෙක හෝ පියුම් විලෙක හෝ පඬෙර විලෙක හෝ ඇතැම් උපුල් හෝ පියුම් හෝ පඬෙර හෝ දියෙහි වැඩුණේ දියෙන් නොනැඟුණේ, දිය තුළැ ම ගිලී වැඩෙනුයේ ද, ඒ සියල්ල අග තෙක් ද මුල් තෙක් ද සිසිල් දියෙන් තෙමුණේ, මුළුල්ල ම තෙමුණේ පිරී ගියේ, හැම තැන ම පැතිරැ වැද ගත්තේ වේ ද, ඒ විලෙහි සියලු උපුල්වලැ හෝ පියුම්වලැ හෝ පඬෙරවලැ හෝ සිසිල් දිය පැතිරැ වැදැ නොගත් තැනෙක් නො වන්නේ ද, බමුණ, මහණ තෙමේ එ සේම මේ කය ම නිෂ්ප්‍රීතික සුඛයෙන් තෙමයි, හාත්පසින් තෙමයි, පුරා ලයි, මුළුල්ල ම පැතිරැ වැද ගනී. ඔහුගේ සියලු කයෙහි ඒ නිෂ්ප්‍රීතික සුඛයෙන් පැතිරැ වැදැ නොගත් කිසි ද තැ‍නෙක් නො වන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, මේ වනාහි පළමු දැක්වුණු යඥයනට වඩා මඳ කටයුතු ඇති, වඩා මඳ තැතින් සිදු කට හැකි, එහෙත් ඒ හැමට වඩා මහත් පල ද මහත් අනුසස් ද ඇති යඥයෙක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "77. තව ද බමුණ, මහණ තෙමේ සුව විඳුමත් දුරැලීමෙන්, දුක් විඳුමත් දුරැ ලීමෙන්, පළමු කොට ම සොම්නස් දොම්නස් දෙක දුරු වීමෙන්, නොදුක් ද නොසුව ද වූ, උපේක්‍ෂා ස්මෘති දෙකේ පිරිසිදු බව ඇති, සිවුවන දහන ලැබ වෙසෙයි. හේ මේ කය ම පිරිසිදු පබසර සිතින් පැතිරැ වැද ගෙන හුන්නේ වෙයි. ඔහුගේ සියලු කයෙහි පිරිසිදු පබසර සිතින් පැතිරැ වැදැ නොගත් කිසි ද තැනෙක් නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "78. යම්සේ, බමුණ, මිනිසෙක් හිස සහිත මුළු කය ම සුදු වතින් වසාගෙන හුන්නේ වී නම්, ඔහුගේ ඒ මුළු කයෙහි සුදු වතින් වැදැ නොගත් (නොවැසුණේ) කිසිදු තැනෙක් නොවන්නේ ද, බමුණ, එසේ ම මහණ තෙම මේ කය ම පිරිසිදු පබසර සිතින් පැතිරැ වැදැ ගෙන නොසිටි කිසි දු තැනෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, මේ වූ කලි පළමු කී යඥයනට වඩා මඳ කටයුතු ඇති, වඩා මඳ තැතිත් සිදු කට හැකි, එහෙත් එ හැමට වඩා මහත් පල ද මහත් අනුහස් ද ඇති යඥයෙක.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 306,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "79. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ{1} ඤාණදස්සනාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො එවං පජානාති: ‘අයං ඛො මෙ කායො රූපී චාතුම්මහාභූතිකො මාතාපෙත්තිකසම්භවො ඔදනකුම්මාසූපචයො අනිච්චුච්ඡාදනපරිමද්දනභෙදනවිද්ධංසනධම්මො, ඉදං ච පන මෙ විඤ්ඤාණං එත්ථ සිතං එත්ථ පටිබද්ධ’න්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "80. සෙය්යථාපි බ්රාහ්මණ, මණි වෙළුරියො සුභො ජාතිමා අට්ඨංසො සුපරිකම්මකතො අච්ඡො විප්පසන්නො අනාවිලො සබ්බාකාරසම්පන්නො, තත්රස්ස සුත්තං ආවුතං නීලං වා පීතං වා ලොහිතං වා ඔදාතං වා පණ්ඩුසුත්තං{2} වා. තමෙනං චක්ඛුමා පුරිසො හත්ථෙ කරිත්වා පච්චවෙක්ඛෙය්ය, ‘අයං ඛො මණි වෙළුරියො සුභො ජාතිමා අට්ඨංසො සුපරිකම්මකතො අච්ඡො විප්පසන්නො අනාවිලො සබ්බාකාරසම්පන්නො. තත්රිදං සුත්තං ආවුතං නීලං වා පීතං වා ලොහිතං වා ඔදාතං වා පණ්ඩුසුත්තං වා’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො බ්රාහ්මණ, භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ ඤාණදස්සනාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො එවං පජානාති: ‘අයං ඛො මෙ කායො රූපී චාතුම්මහාභූතිකො මාතාපෙත්තිකසම්භවො, ඔදනකුම්මාසූපචයො, අනිච්චුච්ඡාදනපරිමද්දනභෙදනවිද්ධංසනධම්මො. ඉදං ච පන මෙ විඤ්ඤාණං එත්ථ සිතං එත්ථ පටිබද්ධන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො බ්රාහ්මණ, __යඤ්ඤො පුරිමෙ__ යඤ්ඤෙහි අප්පට්ඨතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "81. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විග__තූ__පක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ මනොමයං කායං අභිනිම්මිනනාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො ඉමම්හා කායා අඤ්ඤං කායං අභිනිම්මිනාති රූපිං මනොමයං සබ්බඞ්ගපච්චඞ්ගිං අහීනින්ද්රියං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ආනෙජ්ජප්පත්තෙ - කත්ථචි."
                    },
                    {
                        "type": "footnote",
                        "text": "2. පණ්ඩුරසුත්තං - කත්ථචි."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "79. (බමුණ,) ඒ මහණ තෙමේ මෙසේ සිත එකඟ වූ කල්හි, පිරිසිදු වූ කල්හි, දීප්ත වූ කල්හි, කිලිටි පහ වූ කල්හි, පහ වැ ගිය චිත්තොපක්ලේශ ඇති කල්හි, මොළොක් වූ කල්හි, විචසුන් වඩනුවට යුහු වැ සිටි කල්හි, නිසල බවට පැමිණි කල්හි, විචසුන් නුවණ පිණිස (පිරියම්) සිත එයට යොමු කෙරෙයි, එයට නතු කෙරෙයි. (එසේ වූ) හේ ‘මා කය වූ කලි රූපවත් ය, සිවු මහාභූතයන්ගෙන් නිපන්නේ ය, මාපියන්ගේ ශුක්‍රශොනිතයෙන් උපන්නේ ය. බත් කොමු ඈ අහරින් වැඩුණේ ය. අනිසබව ද දුගඳ හරනුවට සුවඳ විලවුන් ඉළියැ යුතු බව ද, ලෙඩ දුරැ ලනුවට පිරිමැදුම් ඈ කළ යුතු බව ද, එසේ කළත් බිඳෙන බව ද, විසිරෙන බව ද යන මෙ කී දෑය ස්වභාව කොට ඇත්තේ ය. මා සිත ද මේ කයෙහි ලැග්ගේ ය. මෙහි බැඳුණේ ය”යී මෙසේ දැනැ ගනී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "80. බමුණ, යම්සේ සොඳුරු පිරිසිදු ආකරයෙක පහළ වූ, අටැස් වූ, මොනොවට පිරියම් කළ, සියුම් වූ, වෙසෙසින් පහන් වූ, පිවිතුරු වූ, දෙවුම් විදුම් ඈ හැම අයුරින් යුත් වෙරළුමිණෙක් වන්නේ ද, එහි නිල්වන් හෝ රන්වන් හෝ රත්වන් හෝ සුදුවන් හෝ පඬුවන් හෝ හුයෙක් අවුනන ලද්දේ වන්නේ නම් ඇස් ඇති පුරුෂයෙක් එය අතෙහි කොට, “මේ වූ කලි සොඳුරු, පිරිසිදු ආරෙක උපන්, අටැස්, මොනොවට පිරියම් කළ, සියුම්, වෙසෙසින් පහන්, පිවිතුරු, දෙවුම් විදුම් ඈ සියලු අයුරින් යුත් වෙරෙළු මිණෙක. මෙහි නිල්වන් හෝ රන්වන් හෝ රත්වන් හෝ සුදුවන් හෝ පඬුවන් හෝ මේ හුයෙක් අවුනන ලදුයේ වේ” ය යී සලකා බලන්නේ ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, එසේ ම මහණ තෙමේ මෙසේ සිත එකඟ වූ කල්හි, පිරිසිදු වූ කල්හි, දිමුත් වූ කල්හි, කෙලෙස් යට පත් වූ කල්හි, උපක්ලෙශ පහ වූ කල්හි, මොළොක් වූ කල්හි, (විවසුන් බවුනට) යුහු වැ සිටි කල්හි, නිසල බවට පැමිණි කල්හි, විවසුන් නුවණ පිණිස සිත යොමු කෙරෙයි. එයට නතු කෙරෙයි. (එසේ වූ) හෙ තෙමේ ‘මේ මා කය වූ කලි රූපවත් ය, සිවු මහාභූතයන්ගෙන් නිපන්නේ ය, මා පියන්ගේ ශුක්‍රශොනිතයෙන් උපන්නේ ය, බත් කොමු අහරින් වැඩුණේ ය, අනිසබව ද, දුගඳ හරනට සුවඳ විලෙවුත් ඉළිය යුතු බව ද, ලෙඩ දුරැ ලනුවට පිරිමැදුම් ඈ කළ යුතු බව ද, එය කළත් බිඳෙන බව ද, විසිරෙන බව ද යන මෙකී දෑ ස්වභාව කොටැත්තේ ය. මා සිත ද මේ කයෙහි ලැග්ගේ ය. මෙහි බැඳුණේ යැ’යී දැන ගනී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, මේ වූ කලි පළමු කී යඥයනට වඩා මඳ කටයුතු ඇති, වඩා මඳ තැතින් සිදු කට හැකි, (එහෙත්) වඩා මහත් පල හා අනුසස් හා ඇති යඥයෙක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "81. හේ මෙසේ සිත එකඟ වූ කල්හි, පිරිසිදු වූ කල්හි, දිමුත් වූ කල්හි, කෙලෙස් රහිත කල්හි, දුරැ වූ උපක්ලේශ ඇති කල්හි, මොළොක් වූ කල්හි, ඉදුහු ඉපැදවීමට යුහු වැ සිටි කල්හි, නිසල බව් පත් කල්හි, මන්මුවා (මනෝමය) සිරුරක් මවා පානු පිණිස සිත යොමු කෙරෙයි, නතු කෙරෙයි. හේ (මෙසේ) මෙ සිරුරින් රූමත්, හැම අඟ පසඟ ඇති, නොවිකළ ඉඳුරන් ඇති මන්මුවා සිරුරක් මවා පියයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 308,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි බ්රාහ්මණ, පුරිසො මුඤ්ජම්හා ඊසිකං{1} පබ්බාහෙය්ය, තස්ස එවමස්ස: “අයං මුඤ්ජො, අයං ඊසිකා. අඤ්ඤො මුඤ්ජො, අඤ්ඤා ඊසිකා. මුඤ්ජ__ම්හා__ ත්වෙව ඊසිකා පබ්බාළ්හා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථා වා පන බ්රාහ්මණ, පුරිසො අසි කොසියා පබ්බාහෙය්ය, තස්ස එවමස්ස “අයං අසි, අයං කොසි, අඤ්ඤො අසි, අඤ්ඤා කොසි, කොසියාත්වෙව අසි පබ්බාළ්හො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථා වා පන බ්රාහ්මණ, පුරිසො අහිං කරණ්ඩා උද්ධරෙය්ය, තස්ස එවමස්ස “අයං අහි, අයං කරණ්ඩො, අඤ්ඤො අහි, අඤ්ඤො කරණ්ඩො, කරණ්ඩා ත්වෙව අහි උබ්භතො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො බ්රාහ්මණ, භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ මනොමයං කායං අභිනිම්මින්නාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො ඉමම්හා කායා අඤ්ඤං කායං අභිනිම්මිනාති රූපිං මනොමයං සබ්බඞ්ගපච්චඞ්ගිං අහීනින්ද්රියං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො බ්රාහ්මණ, යඤ්ඤො පුරිමෙහි යඤ්ඤෙහි අප්පට්ඨතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "82. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ ඉද්ධිවිධාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො අනෙකවි__හි__තං ඉද්ධිවිධං පච්චනුභොති එකො’පි හුත්වා බහුධා හොති, බහුධා’පි හුත්වා එකො හොති, ආවීභාවං තිරොභාවං තිරොකුඩ්ඩං තිරොපාකාරං තිරොපබ්බතං අසජ්ජමානො ගච්ඡති සෙය්යථාපි ආකාසෙ. පඨවියා’පි උම්මුජ්ජනිමුජ්ජං කරොති සෙය්යථාපි උදකෙ. උදකෙ’පි අභිජ්ජමානෙ ගච්ඡති සෙය්යථාපි පඨවියං. ආකාසෙ’පි පල්ලඞ්කෙන කමති සෙය්යථාපි පක්ඛී සකුණො. ඉමෙ’පි චන්දිමසූරියෙ එවං මහිද්ධිකෙ එවං මහානුභාවෙ පාණිනා පරිමසති පරිමජ්ජති යාව බ්රහ්මලොකා’පි කායෙන වසං වත්තෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි බ්රාහ්මණ, දක්ඛො කුම්භකාරො වා කුම්භකාරන්තෙවාසී වා සුපරිකම්මකතාය මත්තිකාය යං යදෙව භාජනවිකතිං ආකඞ්ඛෙය්ය තං තදෙව කරෙය්ය අභිනිප්ඵාදෙය්ය;"
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථා වා පන බ්රාහ්මණ, දක්ඛො දන්තකාරො වා දන්තකාරන්තෙවාසී වා සුපරිකම්මකතස්මිං දන්තස්මිං යං යදෙව දන්තවිකතිං ආකඞ්ඛෙය්ය තං තදෙව කරෙය්ය අභිනිප්ඵාදෙය්ය;"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඉසිකං - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "බමුණ, යම්සේ පුරුෂයෙක් මුදුතණ ගසෙකින් මුදුකිලිල ඇද මෑත් කරන්නේ නම්, ඔහුට “මේ මුදුතණ ගස ය, මේ එහි මුදුකිලිල ය, තණ ගස එකෙක, එහි මුදුකිලිල අනෙකෙක, මුදු තණ ගසින් එහි කිලිල මෑත් කරනලදැ”යී මෙසේ සිතෙක් වන්නේ ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, යම් සේ හෝ පුරුෂයෙක් කඩුවක් කොපුවෙන් ඇදැ මෑත් කරන්නේ නම්, ඔහුට “මේ කඩුව ය, මේ කොපුව ය, කඩුව එකෙක, කොපුව අනෙකෙක, කොපුයෙන් ම් කඩුව ඇද මෑත් කරන ලදැ”යී මෙසේ සිතෙක් වන්නේ ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, යම්සේ වනාහි පුරුෂයෙක් නයකු සැවෙන් (සිතින්) ඇදැ නඟා ගන්නේ ද, ඔහුට “මේ නයා ය, මේ සැව ය, නයා එකෙක, සැවය අනෙකෙක, සැවයෙන් ම නයා ඉදිරිණැ”යී මෙසේ සිතෙක් වන්නේ ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, එසේ ම මහණ තෙමේ මේ උඩ කී පරිදි සිත එකඟ වූ කල්හි, පිරිසිදු වූ කල්හි, දීප්ත වූ කල්හි, කෙලෙස් රහිත කල්හි, පහ වූ උපක්ලෙශ ඇති කල්හි, මොළොක් වූ කල්හි, ඉදුහු වඩනුවට යුහු වැ සිටි කල්හි, නිසල බව් පත් කල්හි මන්මුවා සිරුරක් මවා පානුවට සිත යොමු කෙරෙයි, නමා හරියි. (එසේ වූ) හේ මේ සිරුරින් රූපවත් වූ, සියලු අඟපසඟින් යුත්, නොවිකළ ඉඳුරන් ඇති, මන්මුවා අන් සිරුරක් මවා පියයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, මේ වනාහි උඩ දැක්වුණු යඥයනට වඩා මඳ කටයුතු ඇති, වඩා මඳ තැතින් සිදු කට හැකි, (එහෙත්) එයට වඩා මහත් පල ද වඩා මහත් අනුසස් ද ඇති යඥයෙක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "82. හේ උඩ කී පරිදි සිත එකඟ වූ කල්හි, පිරිසිදු වූ කල්හි, දිමුත් වූ කල්හි, නිකෙලෙස් වූ කල්හි, උපක්ලේශ පහ වැ ගිය කල්හි, මොළොක් වූ කල්හි, (ඉදුහු වඩනුවට) යුහු වැ සිටි කල්හි, නිසල බව් පත් කල්හි, ඉදුවිද නුවණ පිණිස පිරියම් සිත මෙහෙයයි, නතු කෙරෙයි. (එසේ) හේ නොයෙක් වැදෑරුම් ඉදු කොටස් පුන පුනා පසක් කෙරෙයි. පියෙවියෙන් එකෙක් වැ සිට ද ඉදුබෙලෙන් බොහෝ වැදෑරුම් වෙයි. බොහෝ වැදෑරුම් විත් යලි එකෙක් ම වෙයි. තමාගේ පෙහෙළි බව කෙරෙයි, යලි නොපෙහෙළි බව කෙරෙයි. බිතුයෙන් පිටතට පවුරින් පිටතට පව්වෙන් පිටතට අහසෙහි මෙන් කිසිවෙකත් නොගැටෙනුයේ විනිවිද ගෙන යෙයි. දියෙහි මෙන් පොළොව්හි ද ගිලීම ද මතු විම ද කෙරෙයි. නොබිඳෙන දියෙහි පොළොව්හි සේ යෙයි. පියාපත් ඇති සකුනයකු සේ අහස්හි ද පලඟින් යෙයි. මේසා මහත් ඉදු ඇති, මහත් තෙද ඇති මේ සඳ හිරු දෙදෙනා ද අල්ලයි. අත යවා ඔබ මොබ පිරිමදී. බඹලොව දක්වා ද (මුළු ලොව) කයින් වීසි කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, යම් සේ කුඹලෙක් හෝ කුඹලක්හු අතැවැස්සෙක් හෝ මොනොවට පිරියම් කළ මැටියෙන් යම් යම් බදුන් වෙසෙසක් තෙමේ කැමැත්තේ නම් එය එය ම කරන්නේ ද, මොනොවට නිපදවන්නේ ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, යම්සේ හෝ සමත් දත්වඩුවෙක් හෝ ඔහු අතැවැස්සෙක් හෝ මොනොවට සකස් කළ දතෙක්හි යම් යම් විසිතුරු රූපාදියක් (දන්තවිකෘතියක්) කැමැත්තේ නම් එය එයම කරන්නේ ද, මොනොවට නිපදවන්නේ ද,",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 310,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථා වා පන බ්රාහ්මණ, දක්ඛො සුවණ්ණකාරො වා සුවණ්ණකාරන්තෙවාසී වා සුපරිකම්මකතස්මිං සුවණ්ණස්මිං යං යදෙව සුවණ්ණවිකතිං ආකඞ්ඛෙය්ය, තං තදෙව කරෙය්ය අභිනිප්ඵාදෙය්ය;"
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො බ්රාහ්මණ, භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ ඉද්ධිවිධාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති එකො’පි හුත්වා බහුධා හොති බහුධා’පි හුත්වා එකො හොති. ආවීභාවං තිරොභාවං තිරොකුඩ්ඩං තිරොපාකාරං තිරොපබ්බතං අසජ්ජමානො ගච්ඡති සෙය්යථා’පි ආකාසෙ. පඨවියා’පි උම්මුජ්ජනිමුජ්ජං කරොති සෙය්යථා’පි උදකෙ. උදකෙ’පි අභිජ්ජමානෙ ගච්ඡති සෙය්යථා’පි පඨවියං. ආකාසෙ’පි පල්ලඞ්කෙන කමති සෙය්යථාපි පක්ඛී සකුණො. ඉමෙ’පි චන්දිමසූරියෙ එවංමහිද්ධිකෙ එවංමහානුභාවෙ පාණිනා පරිමසති පරිමජ්ජති. යාව බ්රහ්මලොකා’පි කායෙන වසං වත්තෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො බ්රාහ්මණ, යඤ්ඤො පුරිමෙහි යඤ්ඤෙහි අප්පට්ඨතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "83. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විග__තූ__පක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ දිබ්බාය සොතධාතුයා චිත්තං අභිනීහරති, අභිනින්නාමෙති. සො දිබ්බාය සොතධාතුයා විසුද්ධාය අතික්කන්තමානුසිකාය උභො සද්දෙ සුණාති දිබ්බෙ ච මානුසෙ ච යෙ දූරෙ සන්තිකෙ ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "84. සෙය්යථා’පි බ්රාහ්මණ, පුරිසො අද්ධානමග්ගපටිපන්නො, සො සුණෙය්ය භෙරිසද්දම්පි මුදිඞ්ගසද්දම්පි සඞ්ඛපණවදෙණ්ඩිමසද්දම්පි. තස්ස එවමස්ස ‘භෙරිසද්දො ඉති’පි මුදිඞ්ගසද්දො ඉති’පි සඞ්ඛපණවදෙණ්ඩිමසද්දො ඉති’පි. එවමෙව ඛො බ්රාහ්මණ, භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ දිබ්බාය සොතධාතුයා චිත්තං අභිනීහරති, අභිනින්නාමෙති. සො දිබ්බාය සොතධාතුයා විසුද්ධාය අතික්කන්තමානුසිකාය උභො සද්දෙ සුණාති දිබ්බෙ ච මානුසෙ ච යෙ දූරෙ සන්තිකෙ ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො බ්රාහ්මණ, යඤ්ඤො පුරිමෙහි යඤ්ඤෙහි අප්පට්ඨතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො ච."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "බමුණ, යම්සේ හෝ සමත් රන්කරුවෙක් හෝ ඔහු අතැවැස්සෙක් හෝ මොනොවට සකස් කළ රනෙහි යම් යම් අබරණ ආදියක් (ස්වර්‍ණවිකෘතියක්) කැමැත්තේ එය නම් එයම කරන්නේ ද, නිපදවන්නේ ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, එ පරිද්දෙන් ම මෙසේ (උඩ කී පරිදි) සිත එකඟ වූ කල්හි, පිරිසිදු වූ කල්හි, පබසර වූ කල්හි, නිකෙලෙස් වූ කල්හි, පහ වූ උපක්ලේශ ඇති කල්හි, මොළොක් වූ කල්හි, ඉදුහ වඩනුවට යුහු වූ කල්හි, ස්ථිතකල්හි, නිසලබව් පත් කල්හි ඉදුවිද නුවණ පිණිස සිත මෙහෙයයි, මොනොවට නතු කෙරෙයි. (එසේ වූ) හේ නොයෙක් වැදෑරුම් ඉදු කොටස් පුන පුනා විඳී (ලබයි, පසක් කෙරෙයි). පියෙවියෙන් එකක් වැ ම සිට බොහෝ දෙනෙක් වෙයි. බොහෝ දෙනක් වැ යලි එකෙක් ම වෙයි. තෙමේ පෙනී සිටී, නොපෙනී ද සිටී. බිතුයෙන් පිටතට පවුරින් පිටතට පව්වෙන් පිටතට විනිවිද කිසිවෙක නොලැගී අහසෙහි සෙයින් යෙයි. පොළොව්හි ද දියෙහි මෙන් ගිලීමත් මතු වීමත් කෙරෙයි. පොළොව මතු පිටැ සේ නොබිඳෙන දියෙහි යෙයි. ඉගිලෙන පක්‍ෂියකු සේ පලඟින් අහසැ යෙයි. මේ සා මහත් ඉදුහ ඇති මේසා මහත් තෙද ඇති සඳ හිරුන් පවා අල්ලයි, පිරිමදියි. බඹලොව දක්වා ද කයින් තමා වසයෙහි පවත්වයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, මේ වනාහි මෙයින් පළමු කී සියලු යඥයනට වඩා මඳ කටයුතු ඇති ද වඩා මඳ තැනිත් සිදු කට හැකි ද වූ, එහෙත් ඒ හැමට වඩා මහ පල ද වඩා මහ අනුසස් ද ඇති යඥයෙක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "83. හේ මෙසේ සිත එකඟ වූ කල්හි, පිරිසිදු කල්හි, දීප්තිමත් වූ කල්හි, නිකෙලෙස් වූ කල්හි, උපක්ලේශ පහ වැ ගිය කල්හි, මොළොක් වූ කල්හි, (දිවකන් නුවණ වඩනුවට) යුහු වූ කල්හි, ස්ථිත කල්හි, නිසල බව් පත් කල්හි, දිවකන් නුවණ පිණිස සිත යොමු කෙරෙයි, නැඹුරු කෙරෙයි. (එසේ වූ) හේ පිරිසිදු වූ මිනිසුන්ගේ ඇසුම් ඉම ඉක්මැ සිටි දිවකනින් දෙවියන් අයත් වූ ද මිනිසුන් අයත් වූ ද දුරැ වූ ද ළඟැ වූ ද යන දෙවැදෑරුම් හැම හඬ ම අසයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "84. බමුණ, යම්සේ මිනිසෙක් දික් මඟකට පිළිපන්නේ නම්, හේ බෙර හඬත් මිහිඟු බෙර හඬත් සක් පණා ගැටබෙර හඬත් අසන්නේ නම්, එය අසන ඔහුට ‘මේ බෙර හඬැ’ යීත් ‘මේ මිහිඟු බෙර හඬැ’ යී ත් ‘මේ සක් පණා ගැටබෙර හඬැ’යීත් මෙසේ සිතෙක් වන්නේ නම්, බමුණ, එ පරිද්දෙන් ම මහණ තෙමේ මේ ලෙස සිත එකඟ වූ කල්හි, පිරිසිදු වූ කල්හි, දීප්තිමත් වූ කල්හි, නිකෙලෙස් වූ කල්හි, උපක්ලේශ පහ වැ ගිය කල්හි, මොළොක් වූ කල්හි, කර්‍මක්‍ෂම වැ සිටි කල්හි, නිසල බව් පත් කල්හි, දිවකන් නුවණ පිණිස සිත යොමු කෙරෙයි. ‍හේ පිරිසිදු වූ, මිනිසුන්ගේ දැකුම් ඉම ඉක්මැ වූ දිවකන් නුවණින් දිව්‍ය වූත් මානුෂ වූත් දුරැ වූත් ළඟැ වූත් දැ යී මෙසේ ‍දෙවැදෑරුම් වූ සියලු හඬ අසයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, මෙය පළමු දැක්වුණු යඥයනට වඩා මඳ කටයුතු ඇති, වඩා මඳ තැතෙකින් සිදු කට හැකි, ඒ හැමට වඩා මහත් පල ද ඇති මහත් අනුසස් ද ඇති යාගයෙකි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 312,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "85. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ චෙතොපරියඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො පරසත්තානං පරපුග්ගලානං චෙතසා චෙතො පරිච්ච පජානාති. සරාගං වා චිත්තං සරාගං චිත්තන්ති පජානාති, වීතරාගං වා චිත්තං වීතරාගං චිත්තන්ති පජානාති, සදොසං වා චිත්තං සදොසං චිත්තන්ති පජානාති, වීතදොසං වා චිත්තං වීතදොසං චිත්තන්ති පජානාති, සමොහං වා චිත්තං සමොහං චිත්තන්ති පජානාති, වීතමොහං වා චිත්තං වීතමොහං චිත්තන්ති පජානාති, සඞ්ඛිත්තං වා චිත්තං සඞ්ඛිත්තං චිත්තන්ති පජානාති, වික්ඛිත්තං වා චිත්තං වික්ඛිත්තං චිත්තන්ති පජානාති, මහග්ගතං වා චිත්තං මහග්ගතං චිත්තන්ති පජානාති, අමහග්ගතං වා චිත්තං අමහග්ගතං චිත්තන්ති පජානාති, සඋත්තරං වා චිත්තං සඋත්තරං චිත්තන්ති පජානාති, අනුත්තරං වා චිත්තං අනුත්තරං චිත්තන්ති පජානාති, සමාහිතං වා චිත්තං සමාහිතං චිත්තන්ති පජානාති, අසමාහිතං වා චිත්තං අසමාහිතං චිත්තන්ති පජානාති, විමුත්තං වා චිත්තං විමුත්තං චිත්තන්ති පජානාති, අවිමුත්තං වා චිත්තං අවිමුත්තං චිත්තන්ති පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "86. සෙය්යථා’පි බ්රාහ්මණ, ඉත්ථි වා පුරිසො වා දහරො වා යුවා මණ්ඩනජාතිකො ආදාසෙ වා පරිසුද්ධෙ පරියොදාතෙ අච්ඡෙ වා උදකපත්තෙ සකං මුඛනිමිත්තං පච්චවෙක්ඛමානො සකණිකං වා සකණිකන්ති ජානෙය්ය, අකණිකං වා අකණිකන්ති ජානෙය්ය."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො බ්රාහ්මණ, භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ චෙතොපරියඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සො පරසත්තානං පරපුග්ගලානං චෙතසා චෙතො පරිච්ච පජානාති: සරාගං වා චිත්තං සරාගං චිත්තන්ති පජානාති. වීතරාගං වා චිත්තං වීතරාගං චිත්තන්ති පජානාති. සදොසං වා චිත්තං සදොසං චිත්තන්ති පජානාති. වීතදොසං වා චිත්තං වීතදොසං චිත්තන්ති පජානාති. සමොහං වා චිත්තං සමොහං චිත්තන්ති පජානාති. වීතමොහං වා චිත්තං වීතමොහං චිත්තන්ති පජානාති. සඞ්ඛිත්තං වා චිත්තං -පෙ- වික්ඛිත්තං වා චිත්තං -පෙ- මහග්ගතං වා චිත්තං -පෙ- අමහග්ගතං වා චිත්තං -පෙ- සඋත්තරං වා චිත්තං -පෙ- අනුත්තරං වා චිත්තං -පෙ- සමාහිතං වා චිත්තං -පෙ- අසමාහිතං වා චිත්තං -පෙ- විමුත්තං වා චිත්තං විමුත්තං චිත්තති පජානාති. අවිමුත්තං වා චිත්තං අවිමුත්තං චිත්තන්ති පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො බ්රාහ්මණ, යඤ්ඤො පුරිමෙහි යඤ්ඤෙහි අප්පට්ඨතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො ච."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "85. හේ මෙසේ සිත එකඟ වූ කල්හි, පිරිසිදු වූ කල්හි, දීප්තිමත් වූ කල්හි, නිකෙලෙස් වූ කල්හි, උපක්ලේශ පහ වූ කල්හි, මොළොක් කල්හි, කර්‍මක්‍ෂම කල්හි, ස්ථිත කල්හි, නිසල බව් පත් කල්හි, පර සිත් දන්නා නුවණ පිණිස සිත යොමු කෙරෙයි. නැඹුරු කෙරෙයි. (එසේ වූ) හේ අන් සතුන්ගේ අන් පුගුලන්ගේ සිත සිය සිතින් පිරිසිඳැ දනියි. සරාග සිත සරාග සිතැ යි දනී. රාගරහිත සිත රාගරහිත සිතැ යි ද දනියි. සද්වේෂ සිත සද්වේෂ සිතැ යි ද දනී. ද්වේෂ රහිත සිත ද්වේෂ රහිත සිතැ යි ද දනියි. සමොහ සිත සමොහ සිතැ යි දනී. මෝහ රහිත සිත මෝහ රහිත සිතැ යි ද දනියි. හැකුළුණු සිත හැකුළුණු සිතැ යි ද දනියි. විසුරුණු සිත විසුරුණු සිතැ යි ද දනියි. මහද්ගත සිත මහද්ගත සිතැ යි ද දනියි. අමහද්ගත සිත අමහද්ගත සිතැ යි ද දනියි. සොත්තර සිත සොත්තර සිතැ යි ද දනියි. නිරුත්තර සිත නිරුත්තර සිතැ යි ද දනියි. එකඟ සිත එකඟ සිතැ යි ද දනී. නොඑකඟ සිත නොඑකඟ සිතැ යි ද දනියි. මිදුණු සිත මිදුණු සිතැ යි ද දනී. නොමිදුණු සිත නොමිදුණු සිතැ යි ද දනියි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "86. බමුණ, ළදරු වේවයි තරුණ වේවයි සැරැසෙන සුලු ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ පිරිසිදු පිවිතුරු කැඩපතෙක හෝ පහන් දියැති බඳුනෙක හෝ සිය මුව සටහන පිරික්සා බලන්නේ තලකැලැල් ඈ දොස් ඇති තැන් දොස් ඇති තැනැ යි දන්නේ ද, ඒ දොස් නැති තැන් දොස් නැති තැනැ යි දන්නේ ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, එ පරිද්දෙන් ම මහණ තෙමේ මෙසේ (උඩ කී පරිදි) සිත එකඟ වූ කල්හි, පිරිසිදු වූ කල්හි, නිකෙලෙස් වූ කල්හි, උපක්ලේශ පහ වැ ගිය කල්හි, මොළොක් වූ කල්හි, කර්‍මක්‍ෂම කල්හි, ස්ථිත කල්හි, නිසලබව් පත් කල්හි, පරසිත් දන්නා නුවණ පිණිස සිත මොනොවට යොමු කෙරෙයි, මොනොවට නතු කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හේ අන් සතුන්ගේ අන් පුගුලන් ගේ සිත සිය සිතින් පිරිසිඳැ දනී: සරාග සිත සරාග සිතැ යි ද දනී. වීතරාග සිත වීතරාග සිතැ යි ද දනී. සද්වේෂ සිත සද්වේෂ සිතැ යි ද … වීතද්වේෂ සිත වීතද්වේෂ සිතැ යි ද … සමෝහ සිත සමෝහ සිතැ යි ද … වීතමෝහ සිත වීතමෝහ සිතැ යි ද … සංක්‍ෂිප්ත සිත සංක්‍ෂිප්ත සිතැ යි ද … වික්ෂිප්ත සිත වික්ෂිප්ත සිතැ යි ද … මහද්ගත සිතැ මහද්ගත සිත යි ද … අමහද්ගත සිත අමහද්ගත සිතැ යි ද ... සොත්තර සිත සොත්තර සිතැ යි ද … නිරුත්තර සිත නිරුත්තර සිතැ යි ද ...සමාහිත සිත සමාහිත සිතැ යි ද … අසමාහිත සිත අසමාහිත සිතැ යි ද … විමුක්ත සිත විමුක්ත සිතැ යි ද … අවිමුක්ත සිත අවිමුක්ත සිතැ යි ද දනී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, මේ වනාහි පළඹු කී යඥයනට වඩා මඳ කටයුතු ඇති, වඩා මඳ තැතෙකින් සිදු කට හැකි ඒ හැමට වඩා මහත් පල ද ඇති, වඩා මහත් අනුහස් ද ඇති යාගයෙක.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 314,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "87. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ පුබ්බෙනිවාසානුස්සතිඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති සෙය්යථිදං: එකම්පි ජාතිං ද්වෙ’පි ජාතියො තිස්සො’පි ජාතියො චතස්සො’පි ජාතියො පඤ්චපි ජාතියො දසපි ජාතියො වීසම්පි ජාතියො තිංසම්පි ජාතියො චත්තාරීසම්පි ජාතියො පඤ්ඤාසම්පි ජාතියො ජාතිසතම්පි ජාතිසහස්සම්පි ජාතිසතසහස්සම්පි අනෙකෙ’පි සංවට්ටකප්පෙ අනෙකෙ’පි විවට්ටකප්පෙ අනෙකෙ’පි සංවට්ටවිවට්ටකප්පෙ “අමුත්රාසිං එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො අමුත්ර උපපාදිං. තත්රාපාසිං එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො ඉධූපපන්නො”ති. ඉති සාකාරං සඋද්දෙසං අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "88. සෙය්යථා’පි බ්රාහ්මණ, පුරිසො සකම්හා ගාමා අඤ්ඤං ගාමං ගච්ඡෙය්ය, තම්හාපි ගාමා අඤ්ඤං ගාමං ගච්ඡෙය්ය. සො තම්හා ගාමා සකඤ්ඤෙව ගාමං පච්චාගච්ඡෙය්ය, තස්ස එවමස්ස: “අහං ඛො සකම්හා ගාමා අමුං ගාමං අගච්ඡිං තත්ර එවං අට්ඨාසිං එවං නිසීදිං එවං අභාසිං එවං තුණ්හී අහොසිං. තම්හාපි ගාමා අමුං ගාමං අගච්ඡිං තත්රාපි එවං අට්ඨාසිං එවං නිසීදිං __එවං අභාසිං__ එවං තුණ්හී අහොසිං. සො’ම්හි තම්හා ගාමා සකඤ්ඤෙව ගාමං පච්චාගතො’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො බ්රාහ්මණ, භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ පුබ්බෙනිවාසානුස්සතිඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති සෙය්ය__ථි__දං: එකම්පි ජාතිං ද්වෙපි ජාතියො තිස්සොපි ජාතියො චතස්සොපි ජාතියො පඤ්චපි ජාතියො දසපි ජාතියො වීසම්පි ජාතියො තිංසම්පි ජාතියො චත්තාරීසම්පි ජාතියො පඤ්ඤාසම්පි ජාතියො ජාතිසතම්පි ජාතිසහස්සම්පි ජාතිසතසහස්සම්පි අනෙකෙපි සංවට්ටකප්පෙ අනෙකෙපි විවට්ටකප්පෙ අනෙකෙපි සංවට්ටවිවට්ටකප්පෙ අමුත්රාසිං එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො අමුත්ර උපපාදිං. තත්රාපාසිං එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො ඉධූපපන්නො”ති. ඉති සාකාරං සඋද්දෙසං අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "87. හේ මෙසේ සිත එකඟ වූ කල පිරිසිදු වැ දීප්ත වැ නිකෙලෙස් වැ, උපක්ලෙශ පහ වැ මෘදු වැ කර්‍මක්‍ෂම වැ නිසලබව් පත් වැ තහවුරු වැ සිටි කලැ පෙරැ වුසූ කඳපිළිවෙළ දක්නා නුවණ පිණිස සිත මොනොවට යොමු කෙරෙයි, මොනොවට නතු කෙරෙයි. (එසේ වූ) හේ “අසෝ තැනැ මේ නම් ඇතියෙම් වීම්, මේ ගොත් ඇතියෙම් වීම්, මෙබඳු පැහැසටහන් ඇතියෙම් වීම්, මෙබඳු අහරැතියෙම් වීමි, මෙබඳු සුව දුක් විඳිනුයෙම් වීමි, මෙබඳු ආයු කෙළවර ඇතියෙම් වීම්, ඒ මම් එයින් සැවැ අසෝ තැනැ උපනිමි. එහි දු මේ නම් ඇතියෙම් වීම්, මේ ගොත් ඇතියෙම් වීම්. මෙබඳු පැහැ සටහන් ඇතියෙම් වීම්, මෙ බඳු අහරැතියෙම් වීමි, මෙ බඳු සුව දුක් විඳිනුයෙම් වීමි. මෙබඳු ආයු සීමා ඇතියෙම් වීමි. ඒ මම් එයින් සැවැ මෙහි උපනිමි” යි මෙසේ එක් ජාතියක් ද ජාති දෙකක් ද ජාති තුනක් ද ජාති සතරක් ද ජාති පසක් ද ජාති දසයක් ද ජාති විස්සක් ද ජාති තිසක් ද ජාති සතළිසක් ද ජාති පනසක් ද ජාති සියක් ද ජාති දහසක් ද ජාති සුවහසක් ද, බොහෝ සංවර්‍ත කල්ප ද බොහෝ විවර්‍ත කල්ප ද බොහෝ සංවර්‍ත විවර්‍ත කල්ප ද මෙසේ නොයෙක් වැදෑරුම් කඳපිළිවෙළ සිහි කෙරෙයි. මෙසේ පැහැ සටහන් ඈ විසින් අයුරු සහිත, තම ගොත් විසින් උදෙසුම් සහිත බොහෝ වැදෑරුම් පෙර වුසූ කඳපිළිවෙළ සිහි කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "88. බමුණ, යම්සේ පුරුෂයෙක් සිය ගමින් අන් ගමකට යන්නේ ද, එ ගමිනුත් අන් ගමකට යන්නේ ද, යලි ඒ ගමින් සිය ගමට පෙරළා එන්නේ ද, එසේ වූ ඔහුට “මම් වූ කලි සිය ගමින් අසෝ ගමට ගියෙමි, එහි මෙසේ සිටියෙමි, මෙසේ හුන්නෙමි, මෙසේ කීමි, මෙසේ නිහඬ වීමි. එ ගමිනුත් අසෝ ගමට ගියෙමි, එහි දු මෙසේ සිටියෙමි, මෙසේ හුන්නෙමි, මෙසේ කීමි, මෙසේ නිහඬ වීමි, ඒ මම් එ ගමින් සිය ගමට ම පෙරළා ආයෙම් වෙමි”යී ඔහුට මෙබඳු සිතෙක් වන්නේ ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, එ පරිද්දෙන් ම මහණ තෙමේ මෙසේ සිත සමාහිත වැ පිරිසිදු වැ දීප්ත වැ නිකෙලෙස් වැ උපක්ලේශ පහ වැ මොළොක් වැ කර්‍මක්‍ෂම වැ නිසල බව් පත් වැ තහවුරු වැ සිටි කල්හි පෙරැ වුසු කඳපිළිවෙළ සිහි කරන නුවණ පිණිස සිත මොනොවට යොමු කෙරෙයි. මොනොවට නතු කෙරෙයි. හේ “අසෝ තැනැ මේ බඳු නම් ඇතියෙම් වීමි, මේ බඳු ගොත් ඇතියෙම් වීමි, මෙ බඳු පැහැ සටහන් ඇතියෙම් වීමි, මෙ බඳු අහර ඇතියෙම් වීම්, මෙ බඳු සුව දුක් විඳුනෙම් වීම්, මෙ බඳු ආයු සීමා ඇතියෙම් වීම්. ඒ මම් එයින් සැවැ අසෝ තැනැ උපනිමි, එහි ද මෙබඳු නම් ඇතියෙම් වීම්, මෙබඳු ගොත් ඇතියෙම් වීම්, මෙබඳු පැහැ සටහන් ඇතියෙම් වීම්, මෙ බඳු අහර ඇතියෙම් වීම්, මෙ බඳු සුවදුක් විඳුනෙම් වීම. මෙතෙක් ආයු සීමා ඇතියෙම් වීම්. ඒ මම් එසින් සැවැ මෙහි උපනිමි”යී මෙසේ එක් දැයක් ද දෙ දැයක් ද තෙ දැයක් ද සිවු දැයක් ද පස් දැයක් ද දස දැයක් ද විසි දැයක් ද තිස් දැයක් ද සාළිස් දැයක් ද පනස් දැයක් ද සිය දැයක් ද දහස් දැයක් ද සුවහස් දැයක් ද බොහෝ පිරිහෙන කප් ද බොහෝ වැඩෙන කප් ද බොහෝ පිරිහෙන වැඩෙන කප් දැ යී මෙසේ නොයෙක් වැදෑරුම් පෙරැ වුසූ කඳපිළිවෙළ සිහි කෙරෙයි. මෙ පරිද්දෙන් අයුරු සහිත උදෙසුම් සහිත පෙරැ වුසූ නොයෙක් වැදෑරුම් කඳපිළිවෙළ සිහි කෙරෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 316,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො බ්රාහ්මණ, යඤ්ඤො පුරිමෙහි යඤ්ඤෙහි අප්පට්ඨතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "89. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ සත්තානං චුතූපපාතඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සති චවමානෙ උපපජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති: ඉමෙ වත භොන්තො සත්තා කායදුච්චරිතෙන සමන්නාගතා වචීදුච්චරිතෙන සමන්නාගතා මනොදුච්චරිතෙන සමන්නාගතා අරියානං උපවාදකා මිච්ඡාදිට්ඨිකා මිච්ඡාදිට්ඨිකම්මසමාදානා. තෙ කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපන්නා. ඉමෙ වා පන භොන්තො සත්තා කායසුචරිතෙන සමන්නාගතා වචීසුචරිතෙන සමන්නාගතා මනොසුචරිතෙන සමන්නාගතා අරියානං අනුපවාදකා සම්මාදිට්ඨිකා සම්මාදිට්ඨිකම්මසමාදානා. තෙ කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නා’ති. ඉති දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සති චවමානෙ උපපජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "90. සෙය්යථාපි බ්රාහ්මණ, මජ්ඣෙ සිංඝාටකෙ{1} පාසාදො. තත්ථ චක්ඛුමා පුරිසො ඨිතො පස්සෙය්ය මනුස්සෙ ගෙහං පවිසන්තෙ’පි නික්ඛමන්තෙ’පි රථියා වීථිසඤ්චරන්තෙ’පි මජ්ඣෙ සිංඝාටකෙ{1} නිසින්නෙ’පි. තස්ස එවමස්ස, එතෙ මනුස්සා ගෙහං පවිසන්ති, එතෙ නික්ඛමන්ති, එතෙ රථියා වීථිසඤ්චරන්ති, එතෙ මජ්ඣෙ සිංඝාටකෙ{1} නිසින්නා’ති;"
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො බ්රාහ්මණ, භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ සත්තානං චුතූපපාතඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සති චවමානෙ උපපජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති: ඉමෙ වත භොන්තො සත්තා කායදුච්චරිතෙන සමන්නාගතා වචීදුච්චරිතෙන සමන්නාගතා මනොදුච්චරිතෙන සමන්නාගතා අරියානං උපවාදකා මිච්ඡාදිට්ඨිකා මිච්ඡාදිට්ඨිකම්මසමාදානා. තෙ කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපන්නා."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. __මජ්ඣෙ සිංඞ්ඝාටකං ?__"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "බමුණ, මේ පළමු දැක්වුණු යඥයනට වඩා මඳ කටයුතු ඇති වඩා මඳ තැතින් සිදු කට හැකි, වඩා මහත් පල ද වඩා මහත් අනුහස් ද ඇති යඥයෙක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "89. ඒ මහණ මෙසේ සිත සමාහිත වැ පිරිසිදු වැ දීප්ත වැ කෙලෙස් නැති වැ උපක්ලේශ පහ වැ මෘදු වැ කර්‍මක්‍ෂම වැ නිසල බව් පත් වැ තහවුරු වැ සිටි කල්හි සත්ත්‍වයත්ගේ ච්‍යුති උප්පත්ති දක්නා නුවණ පිණිස සිත මොනොවට යොමු කෙරෙයි, මොනොවට නැඹුරු කෙරෙයි. හේ පිරිසිදු වූ, මිනිසුන්ගේ දැකුම් ඉම ඉක්මැ දැක්කැ හැකි දිවැසින්, ‘අහෝ මේ භවත් සත්ත්‍වයෝ කායදුශ්චරිතයෙන් සමන්විතයහ, වාග්දුශ්චරිතයෙන් සමන්විතයහ, මනෝදුශ්චරිතයෙන් සමන්විතයහ, ආර්‍යොපවාද කළෝ ය. මිසදිට් ගතුවහ, මිසදිට් විසින් ගත් මිථ්‍යාව්‍රත ඇතියහ. ඔහු කා බුන් මරණින් මතු සුවින් තොර, නපුරු කමින් උපන් ගති වූ (කර්‍මයට තමන් යටත් බැවින්) තමනට අවශග වැ වැටෙන තැන් වූ නිරයට වන්නෝය. මේ භවත් සත්ත්වයෝ වූ කලි කායසුචරිතයෙන් වාක්සුචරිතයෙන් මනස්සුචරිතයෙන් සමන්විතයහ. ආර්‍යයනට උපවාද නොකොළෝය. සම්දිටු ගතුවහ. සමදිට් විසින් ගත් සිල් ඈ ඇතියහ. ඔහු කාබුන් මරණින් මතු හොබනා ගති ඇති සග ලොව් වන්නෝ යැ”යී මරණාසන්න වූ ද එ කෙණෙහි පිළිසඳ ගතුවන් වූ ද හීන වූ ද උසස් වූ ද මනා පැහැසටහන් ඇති වූ ද නොමනා පැහැසටහත් ඇති වූ ද සුගතියට පැමිණි ද දුගතියට පැමිණි ද කම් වූ පරිදි ඒ ඒ භවයට ගිය සතුන් දකී. මෙසේ හේ පිරිසිදු වූ, මිනිස් විසා ඉක්මැ සිටි දිවැසින් පහත් උසස් සුවන් දුවන් සුගී දුගී සතුන් දකී. කම් වූ පරිදි ඒ ඒ බව කරා එළැඹැ සිටි සතුන් දකී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "90. බමුණ, යම්සේ සිවුමං හන්දියෙකැ මහල් ඇති ගෙයෙක් වන්නේ ද, එහි උඩු මහලෙහි ඇස් ඇති පුරුෂයෙක් සිටියේ, ගෙ වදිනාවුනුත් ගෙන් නික්මෙනවුනුත් වීථියෙහි ඈත මෑත යත එනවුනුත් සිවුමංහන්දිය මැදැ හුන්නවුනුත් දක්නේ ද, ඒ දක්නා ඔහුට “මේ මිනිස්සු ගෙ වදිත්, මොහු ගෙන් නික්මෙත්. මොහු වෙයෙහි ඈත මෑත යෙත්. මොහු සිවුමංහන්දිය මැද හුන්නාහැ’යී මෙසේ සිතෙක් වන්නේ ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, එසේ ම මහණ තෙමේ සිත මේ පරිද්දෙන් එකඟ වැ පිරිසිදු වැ දිමුත් වැ නිකෙලෙස් වැ උපක්ලේශ නැති වැ මොළොක් වැ කර්‍මක්‍ෂම වැ නිසල බව් පත් වැ තහවුරු වැ සිටි කල්හි, සතුන්ගේ මැරුම් දිනුම් දක්නා නුවණ ලබනුවට සිත මොනොවට යොමු කෙරෙයි, මොනොවට නැඹුරු කෙරෙයි. හේ මිනිස් විසා ඉක්මැවූ පිරිසිදු දිවැසින් ‘අහෝ මේ භවත් සත්ත්‍වයෝ කාදුසිරියෙන් විසීදුසිරියෙන් මන්දුසිරියෙන් යුතුහ. අරීපුඟුලනට දොස් නැඟූහ. මිසදිට් ගතුවහ. මිසදිට් විසින් ගත් සදොස් වත් ඇතියහ. ඒ මොහු කාබුන් මරණින් මතු සුවෙන් පහ වූ නපුරු කමින් උපන් තමනට තමන් අවශග වැ වැටෙන තැන් වූ නිරා වන්නහ. -",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 318,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ වා පන භොන්තො සත්තා කායසුචරිතෙන සමන්නාගතා වචීසුචරිතෙන සමන්නාගතා මනොසුචරිතෙන සමන්නාගතා අරියානං අනුපවාදකා සම්මාදිට්ඨිකා සම්මාදිට්ඨිකම්මසමාදානා. තෙ කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නා’ති. ඉති දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සති චවමානෙ උපපජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො බ්රාහ්මණ, යඤ්ඤො පුරිමෙහි යඤ්ඤෙහි අප්පට්ඨතරො ච අප්පසමාරම්භතරො ච මහප්ඵලතරො ච මහානිසංසතරො ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "91. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ ආසවානං ඛයඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො ඉදං දුක්ඛන්ති යථාභූතං පජානාති. ‘අයං දුක්ඛසමුදයො’ති යථාභූතං පජානාති. ‘අයං දුක්ඛනිරොධො’ති යථාභූතං පජානාති. ‘අයං දුක්ඛනිරොධගාමිනීපටිපදා’ති යථාභූතං පජානාති. ‘ඉමෙ ආසවා’ති යථාභූතං පජානාති. ‘අයං ආසවසමුදයො’ති යථාභූතං පජානාති. ‘අයං ආසවනිරොධො’ති යථාභූතං පජානාති. ‘අයං ආසවනිරොධගාමිනීපටිපදා’ති යථාභූතං පජානාති. තස්ස එවං ජානතො එවං පස්සතො කාමාසවා’පි චිත්තං විමුච්චති. භවාසවා’පි චිත්තං විමුච්චති. අවිජ්ජාසවා’පි චිත්තං විමුච්චති. විමුත්තස්මිං විමුත්තමිති ඤාණං හොති. ඛීණා ජාති වුසිතං බ්රහ්මචරියං කතං කරණීයං නාපරං ඉත්ථත්තායා’ති පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "92. සෙය්යථාපි බ්රාහ්මණ, පබ්බතසඞ්ඛෙපෙ උදකරහදො අච්ඡො විප්පසන්නො අනාවිලො, තත්ථ චක්ඛුමා පුරිසො තීරෙ ඨිතො පස්සෙය්ය සිප්පිසම්බුකම්පි සක්ඛරකඨලම්පි මච්ඡගුම්බම්පි චරන්තම්පි තිට්ඨන්තම්පි. තස්ස එවමස්ස: අයං ඛො උදකරහදො අච්ඡො විප්පසන්නො අනාවිලො. තත්රිමෙ සිප්පිසම්බුකා’පි සක්ඛරකඨලා’පි මච්ඡගුම්බා’පි චරන්තිපි තිට්ඨන්තිපී’ති;"
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො බ්රාහ්මණ, භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ ආසවානං ඛයඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. ‘සො ඉදං දුක්ඛන්ති’ යථාභූතං පජානාති. ‘අයං දුක්ඛසමුදයො’ති යථාභූතං පජානාති. ‘අයං දුක්ඛනිරොධො’ති යථාභූතං පජානාති. ‘අයං දුක්ඛනිරොධගාමිනීපටිපදා’ති යථාභූතං පජානාති. ‘ඉමෙ ආසවා’ති යථාභූතං පජානාති. ‘අයං ආසවසමුදයො’ති යථාභූතං පජානාති. ‘අයං ආසවනිරොධො’ති යථාභූතං පජානාති. ‘අයං ආසවනිරොධගාමිනීපටිපදා’ති යථාභූතං පජානාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "එහෙත් මේ භවත් සත්ත්‍වයෝ වූ කලි කාසුසිරියෙන් විසීසුසිරියෙන් මන්සුසිරියෙන් යුතුවහ, අරීනට දොස් නොනැඟුවහ, සම්දිටුහ, සම්දිටු විසින් ගත් සිල් ඈ ඇතියහ. මොහු කා බුන් මරණින් මතු මනා ගති ඇති සග ලොව් වන්නහැ’යී මෙසේ මැරෙනු ළං වූ ද, පිළිසඳ ගත් කෙණෙහි වූ ද, පහත් වූ ද, උසස් වූ ද, මනා පැහැ සටහන් ඇති වූ ද, නොමනා පැහැ සටහන් ඇති වූ ද, සුගති පැමිණි ද, දුගති පැමිණි ද, කම් වූ පරිදි ඒ ඒ භවයට ගිය සතුන් දකී. මෙසේ පිරිසිදු වූ මිනිස් විසා ඉක්මැ පැවැති දිවැසින් උස් පහත් මනා පැහැති නොමනා පැහැති සුගී දුගී සතුන් දකී. කම් වූ පරිදි ඒ ඒ භවය කරා එළඹැ සිටි සතුන් දකී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, මේ වූ කලි පළමු දැක්වුණු යඤයනට වඩා මඳ කටයුතු ඇති, වඩා මඳ තැතින් සිදු කට හැකි, එහෙත් වඩා මහත් පල ද ඇති වඩා අනුහස් ද ඇති යඥයෙක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "91. හේ මෙසේ සිත එකඟ වැ පිරිසිදු වැ දිමුත් වැ නිකෙලෙස් වැ උපක්ලෙශ පහ වැ මොළොක් වැ කර්‍මක්‍ෂම වැ නිසලබව් පත් වැ තහවුරු වැ සිටි කල්හි, ආස්‍රවයන්ගේ වැනැස්ම පිණිස සිත මොනොවට යොමු කෙරෙයි, මොනොවට නතු කෙරෙයි. එසේ වූ හෙ තෙමේ ‘මේ දුකැ’යි ඇති සැටියෙන් දනී. ‘මේ දුක් උපදනා කරුණු යැ’ යී ඇති සැටියෙන් දනී. ‘මේ (දුක් වැනැස්මට අරමුණු වන) නිවනැ’ යි ඇති සැටියෙන් දනී. ‘මේ දුක් වැනැස්මට පමුණුවන පිළිවෙතැ’ යි ඇති සැටියෙන් දනී. ‘මොහු ආස්‍රවහ’ යී ඇති සැටියෙන් දනී, ‘මේ ආස්‍රව ඉපැත්මට කරුණු යැ’ යි ඇති සැටියෙන් දනී. ‘මේ ආස්‍රවනිරෝධයට අරමුණු වන නිවනැ’ යි ඇති සැටියෙන් දනී. ‘මේ ආස්‍රවනිරෝධයට පමුණුවන පිළිවෙත’ යි ඇති සැටියෙත් දනියි. මෙසේ දන්නා මෙසේ දක්නා ඔහුගේ සිත කාමාස්‍රවය කෙරෙන් ද මිදේ, භවාස්‍රවය කෙරෙන් ද මිදේ, අවිද්‍යාස්‍රවය කෙරෙන් ද මිදේ. එසේ මිදුණු කල්හි ‘මා සිත ආස්‍රව කෙරෙන් මිදිණැ’යී පස්විකුම් නුවණ වේ. බව උපත නැවැතිණ. මඟ බඹසර වැසැ නිමැවිණ. සිවු සස්හි සිවු මඟින් කළ යුතු සොළොස් වැදෑරුම් කිස කොටැ නිමැවිණ. මේ කෙලෙස් නසනු පිණිස තවත් කළ යුතු දැයෙක් නැතැ’යි හේ දනී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "92. බමුණ, යම්සේ කඳු මුදුනෙක වූ, පහන්, වෙසෙසින් පහන්, නොබොර විලෙක් වන්නේ නම්, එහි ඉවුරැ ඇස් ඇති මිනිසෙක් සිටියේ, එය තුළැ හැසිරෙන ද සිටුනා ද සිප්පිබෙල්ලනුත් සක්බෙල්ලනුත් කැට කැබැලිතිත් මස්කැලත් දක්නේ ද, (එසේ දක්නා) ඔහුට මේ විල පහන් ය, වෙසෙසින් පහන් ය, නොබොර ය. මෙහි “මේ සිප්පිහුත් සක්බෙල්ලෝත් කැටකැබැලිතිත් මස් කැලත් හැසිරෙන්නෝත් සිටින්නෝත් වෙති”යී මෙසේ සිතෙක් වන්නේ ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, එසේ ම මහණ තෙමේ මෙසේ සිත එකඟ වැ පිරිසිදු වැ දිමුත් වැ නිකෙලෙස් වැ උපක්ලේශ පහ වැ මොළොක් වැ කර්‍මක්‍ෂම වැ නිසලබව් පත් වැ තහවුරු වැ සිටි කල්හි ආස්‍ර‍වක්‍ෂයඥානය පිණිස සිත මොනොවට යොමු කෙරෙයි, මොනොවට නැඹුරු කෙරෙයි. හේ ‘මේ දුකැ’යි ඇති සැටියෙන් දනී. ‘මේ දුකට කරුණැ’ යි ඇති සැටියෙන් දනී. ‘මේ දුක් වැනැස්මැ’යි ඇති සැටියෙන් දනී. ‘මේ දුක්වැනැස්මට පමුණුවන පිළිවෙතැ’සි ඇති සැටියෙන් දනී. ‘මේ ආස්‍රවහ’ යී ඇති සැටියෙන් දනී. ‘මේ ආස්‍රවසමුදය යැ’යී ඇති සැටියෙන් දනී. ‘මේ ආස්‍රවනිරෝධය යැ’ යී ඇති සැටියෙන් දනී. ‘මේ ආස්‍රවනිරෝධගාමීනී පිළිවෙතැ’යී ඇති සැටියෙන් දනී.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 320,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තස්ස එවං ජානතො එවං පස්සතො කාමාසවා’පි චිත්තං විමුච්චති. භවාසවා’පි චිත්තං විමුච්චති. අවිජ්ජාසවා’පි චිත්තං විමුච්චති. විමුත්තස්මිං විමුත්තමිති ඤාණං හොති. ඛීණා ජාති, වුසිතං බ්රහ්මචරියං, කතං කරණීයං, නාපරං ඉත්ථත්තායා’ති පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයම්පි ඛො බ්රාහ්මණ, යඤ්ඤො පුරිමෙහි යඤ්ඤෙහි අප්පට්ඨතරො ච අප්පසමාරම්භතරො ච __මහප්ඵලතරො ච__ මහානිසංසතරො ච. ඉමාය ච බ්රාහ්මණ, යඤ්ඤසම්පදාය අඤ්ඤා යඤ්ඤසම්පදා උත්තරිතරා වා පණීතතරා වා නත්ථී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "93. එවං වුත්තෙ කූටදන්තො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම, අභික්කන්තං භො ගොතම. සෙය්යථාපි භො ගොතම නික්කුජ්ජිතං වා උක්කුජ්ජෙය්ය, පටිච්ඡන්නං වා විවරෙය්ය මූළ්හස්ස වා මග්ගං ආචික්ඛෙය්ය අන්ධකාරෙ වා තෙලපජ්ජොතං ධාරෙය්ය: චක්ඛුමන්තො රූපානි දක්ඛන්තීති. එවමෙව භොතා ගොතමෙන අනෙකපරියායෙන ධම්මො පකාසිතො. එසාහං භවන්තං ගොතමං සරණං ගච්ඡාමි ධම්මඤ්ච භික්ඛුසඞ්ඝං ච. උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතං. එසාහං භො ගොතම සත්ත ච උසභසතානි සත්ත ච වච්ඡතරසතානි, සත්ත ච වච්ඡතරීසතානි, සත්ත ච අජසතානි සත්ත ච උරබ්භසතානි මුඤ්චාමි, ජීවිතං දෙමි. හරිතානි චෙව තිණානි ඛාදන්තු සීතානි ච පානීයානි පිවන්තු, සීතො ච නෙසං වාතො උපවායතූති."
                    },
                    {
                        "type": "paragraph",
                        "text": "94. අථ ඛො භගවා කූටදන්තස්ස බ්රාහ්මණස්ස අනුපුබ්බීකථං කථෙසි සෙය්යත්ථිදං? දානකථං සීලකථං සග්ගකථං කාමානං ආදීනවං ඔකාරං සංකිලෙසං නෙක්ඛම්මෙ ච ආනිසංසං පකාසෙසි. යදා භගවා අඤ්ඤාසි කූටදන්තං බ්රාහ්මණං කල්ලචිත්තං මුදුචිත්තං විනීවරණචිත්තං උදග්ගචිත්තං පසන්නචිත්තං. අථ යා බුද්ධානං සාමුක්කංසිකා ධම්මදෙසනා, තං පකාසෙසි: දුක්ඛං සමුදයං නිරොධං මග්ගං."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි නාම සුද්ධං වත්ථං අපගතකාළකං සම්මදෙව රජනං පටිග්ගණ්හෙය්ය, එවමෙවං කූටදන්තස්ස බ්රාහ්මණස්ස තස්මිං යෙව ආසනෙ විරජං වීතමලං ධම්මචක්ඛුං උදපාදි: යං කිඤ්චි සමුදයධම්මං සබ්බන්තං නිරොධධම්මන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "95. අථ ඛො කූටදන්තො බ්රාහ්මණො දිට්ඨධම්මො පත්තධම්මො විදිතධම්මො පරියොගාළ්හධම්මො තිණ්ණවිචිකිච්ඡො විගතකථංකථො වෙසාරජ්ජප්පත්තො අපරප්පච්චයො සත්ථුසාසනෙ භගවන්තං එතදවොච: අධිවාසෙතු මෙ භවං ගොතමො ස්වාතනාය භත්තං සද්ධිං භික්ඛුසඞ්ඝෙනාති. අධිවාසෙසි භගවා තුණ්හීභාවෙන."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "මෙසේ දන්නා මෙසේ දක්නා ඔහු සිත කාමාස්‍රවයෙන් ද මිදෙයි. භවාස්‍රවයෙන් ද මිදෙයි. අවිද්‍යාස්‍රවයෙන් ද මිදෙයි. මිදුණු කල්හි ‘මිදුණේ ය’යී දැනීම වේ. “භවෝත්පත්තිය ක්‍ෂීණ විය. මහබඹසර වැස නිමැවිණ. සිවුමඟින් කළ යුතු සොළොස් කිස කොටැ නිමැවිණ. මෙ බව් පිණිස කළ යුතු තව කිසිත් නැතැ” යී හේ දනී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“බමුණ, මේ පළමු දැක්වුණු (සියලු) යඥයනට වඩා මඳ කටයුතු ඇති, වඩා මඳ තැතින් සිදු කටහැකි, (එහෙත්) වඩා මහත් පල ද ඇති, වඩා මහත් අනුසස් ද ඇති යඥය ය. බමුණ, මේ යාග සම්පතට වඩා මනෝඥවූ උතුම් වූ අන් යාගසම්පතෙක් නැත.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "93. භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ කල්හි කුළුදත් බමුණු තෙමේ, “වහන්ස, දෙසුම මනා ම ය. වහන්ස, දෙසුම මනා ම ය. වහන්ස, යම් සේ යැටිකුරු කොට තැබුණු බඳුනක් උඩුකුරු කරන්නේ හෝ වේ ද, වැසුණු යමක් වැසුම් හැර දක්වන්නේ හෝ වේ ද, මං මුළාවූවකුට මඟ කියන්නේ හෝ වේ ද, ‘ඇස් ඇතියන් රූප දකිතැ’යි අඳුරෙහි තෙල් පහනක් දල්වන්නේ හෝ වේ ද, වහන්ස, එසේ ම භාග්‍යවතුන් වහන්සේ විසින් මට නොයෙක් අයුරින් දහම පැවැසිණ, වහන්ස, ඒ මම් භාග්‍යවත් ගෞතමයන් වහන්සේ ද දහම ද බික් සඟන ද සරණ යෙමි. වහන්ස, අද පටන් දිව්හිම් කොට සරණ ගිය උපාසකයකු කොට භවද් ගෞතමයන් වහන්සේ මා දැන වදාරණ සේක් වා. භවද් ගෞතමයන් වහන්ස, ඒ මම් සත්සියක් ගොනුන් ද සත්සියක් නාඹු වස්සන් ද සත්සියක් නාඹු වැස්සියන් ද සත් සියක් එළුවන් ද සත්සියක් තරුණ බැටෙළුවන් ද මුදා ලමි. ඔවුනට දිවි දෙමි. නිල්තණ බුදිත්ව යි ද, සිහිල් පැන් බොත්ව යි ද, ඔවුනට සිහිල් පවන ද හමත්ව’යි කියායි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "94. ඉක්බිති භාග්‍යවතුන් වහන්සේ කුළුදත් බමුණුහට දානකථා, ශීලකථා, ස්වර්‍ගකථා, කාමාදීනව කථා, කාමයන්ගේ ලාමකබව, කාමයන්ගේ කෙලෙසීම, නෙක්ඛම්මයෙහි අනුසස් පැවසූ සේක. භාග්‍යවතුන් වහන්සේ යම් විටෙක කුළුදත් බමුණහු (ඒ දහම් ඇසීමෙන්) නීරෝග සිතැති වූවහු, මොළොක් සිතැති වූවහු, නීවරණයන්ගෙන් පහවූ සිතැත්තහු, ඔදවැඩීගිය පහන් සිතැත්තහු දත් සේක් ද, එකල්හි දුඃඛ සමුදය නිරෝධ මාර්‍ග යන බුදුවරුන්ගේ යම් සාමුත්කර්‍ෂකී ධර්‍මදේශනාවක් වේ නම් එය පැවසු සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "යම් සේ පිරිසිදු වූ පහ වූ කළු බව් ඇති වතෙක් මොනොවට ම රඳන් පිළිගන්නේ ද, එසේ ම කුළුදත් බමුණුහට එ අස්නෙහි ම, යමෙක් උපදනාසුලු නම් ඒ සියල්ල නැසෙන සුලු වේ යැ යි කෙලෙස් රජස් රහිත, කෙලෙස් මල රහිත දහම් ඇස පහළ විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "95. ඉක්බිති (මෙසේ) දුටු අරීසස් දහම් ඇති, පැමිණි අරීසස් දහම් ඇති, ප්‍රකට වූ අරිසස් දහම් ඇති, බැසැ ගත් අරීසස් දහම් ඇති, තීණු විසිකිස් ඇති, පහ වූ සැක ඇති, බුදුසස්නැ විසාරද බවට පැමිණි, පරප්‍රත්‍යය රහිත වූ කුළුදත් බමුණු තෙමේ ‘පින්වත් ගෞතම ‍තෙමේ සෙට දිනට මගේ බත බික් සඟන හා ඉවසා වා’යි භාග්‍යවතුන් වහන්සේට කී ය. භාග්‍යවතුන් වහන්සේ තුෂ්ණිම්භාවයෙන් එය ඉවැසූ සේක.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 322,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "97. අථ ඛො කූටදන්තො බ්රාහ්මණො භගවතො අධිවාසනං විදිත්වා උට්ඨායාසනා භගවන්තං අභිවාදෙත්වා පදක්ඛිණං කත්වා පක්කාමි. අථ ඛො කූටදන්තො බ්රාහ්මණො තස්සා රත්තියා අච්චයෙන සකෙ යඤ්ඤාවාටෙ පණීතං ඛාදනීයං භොජනීයං පටියාදාපෙත්වා භගවතො කාලං ආරොචාපෙසි: කාලො භො ගොතම, නිට්ඨිතං භත්තන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "98. අථ ඛො භගවා පුබ්බන්හසමයං නිවාසෙත්වා පත්තචීවරං ආදාය සද්ධිං භික්ඛුසඞ්ඝෙන යෙන කූටදන්තස්ස බ්රාහ්මණස්ස යඤ්ඤාවාටො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදි. අථ ඛො කූටදන්තො බ්රාහ්මණො බුද්ධපමුඛං භික්ඛුසඞ්ඝං පණීතෙන ඛාදනීයෙන භොජනීයෙන සහත්ථා සන්තප්පෙසි සම්පවාරෙසි. අථ ඛො කූටදන්තො බ්රාහ්මණො භගවන්තං භුත්තාවිං ඔනීතපත්තපාණිං අඤ්ඤතරං නීචං ආසනං ගහෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො කූටදන්තං බ්රාහ්මණං භගවා ධම්මියා කථාය සන්දස්සෙත්වා සමාදපෙත්වා සමුත්තෙජෙත්වා සම්පහංසෙත්වා උට්ඨායාසනා පක්කාමීති."
                    },
                    {
                        "type": "centered",
                        "text": "කූටදන්තසුත්තං නිට්ඨිතං පඤ්චමං.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "97. ඉක්බිති කුළුදත් බමුණු භාග්‍යවතුන් වහන්සේ ඉවැසූ නියා දැනැ හුනස්නෙන් නැඟී ඔබ වැඳැ පැදකුණු කොට නික්මුණේ ය. ඉන් පසු කුළුදත් බමුණු ඒ රැය ඇවෑමෙන් සිය යාගශාලායෙහි ප්‍රණීත ඛාද්‍ය භොජ්‍ය පිළියෙල කරවා, ‘පින්වත් ගෞතමයිනි, දැන් කල් ය. බත නිමියේ යැ’යී භාග්‍යවතුන් වහන්සේට කල් දැන්වී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "98. ඉක්බිති භාග්‍යවතුන් වහන්සේ පෙරවරුයෙහි හැඳැ පෙරෙවැ පා සිවුරු ගෙනැ බික් සඟන කැටුව කුළුදත් බමුණුගේ යාගාවාටය කරා එළැඹි සේක. එළැඹ පැනැවු අස්නැ වැඩහුන් සේක. එ කල්හි කුළුදත් බමුණු බුදුපාමොක් බික්සඟත ප්‍රණීත ඛාද්‍ය හොජ්‍යයෙන් සියතින් සැතැප්වී ය. පැවැරැවී ය. ඉන් පසු කුළුදත් බමුණු තෙමේ භාග්‍යවතුන් වහන්සේ වළඳා පාත්‍රයෙන් ඉවතට ගත් අත්ඇත්තවුත් දැනැ, මිටි අස්නක් ගෙන එක් පසෙක හිඳැගත්තේ ය. එසේ හුන් කුළුදත් බමුණුට භාග්‍යවතුන් වහන්සේ දැහැමි කතායෙන් කරුණු දක්වා ගුණදහම් ගන්වා ගුණදහම් වැඩීමෙහි උනන්දු කොට ගුණ වදාරා සිත සතුටු කොට හුනස්නෙන් නැගී නික්මි ‍සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 16,
                        "text": "පස්වනු කුළුදත් සුතුර නිමියේය.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ],
    "bookId": "10",
    "pageOffset": 0
}