[
    {
        "filename": "dn-mhv-4",
        "bookId": 11,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "266"
            },
            {
                "type": "centered",
                "text": "4.",
                "level": 3
            },
            {
                "type": "heading",
                "text": "මහාසුදස්සනසුත්තං",
                "level": 3
            },
            {
                "type": "paragraph",
                "text": "1. එවං මෙ සුතං එකං සමයං භගවා කුසිනාරායං විහරති උපවත්තනෙ මල්ලානං සාලවනෙ අන්තරෙන යමකසාලානං පරිනිබ්බානසමයෙ."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා ආනන්දො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා ආනන්දො භගවන්තං එතදවොච, “මා භන්තෙ, භගවා ඉමස්මිං කුඩ්ඩනගරකෙ උජ්ජඞ්ගලනගරකෙ සාඛානගරකෙ පරිනිබ්බායි. සන්ති භන්තෙ, අඤ්ඤානි මහානගරානි. සෙය්යථිදං, චම්පා රාජගහං සාවත්ථි සාකෙතං කොසම්බී බාරාණසී, එත්ථ භගවා පරිනිබ්බායතු. එත්ථ බහූ ඛත්තියමහාසාලා බ්රාහ්මණමහාසාලා ගහපතිමහාසාලා තථාගතෙ අභිප්පසන්නා, තෙ තථාගතස්ස සරීරපූජං කරිස්සන්තී”ති."
            },
            {
                "type": "paragraph",
                "text": "2. “මා හෙවං ආනන්ද, අවච මා හෙවං ආනන්ද, අවච කුඩ්ඩ්නගරකං උජ්ජඞ්ගලනගරකං සාඛා නගරකන්ති."
            },
            {
                "type": "centered",
                "text": "කුසාවති රාජධානි",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "භූතපුබ්බං ආනන්ද, රාජා මහාසුදස්සනො නාම අහොසි ඛන්තියො මුද්ධාවසිත්තො{1 මුද්ධාභිසීන්තො (කං)} චාතුරන්තො විජිතාවී ජනපදත්ථාවරියප්පත්තො. රඤ්ඤො ආනන්ද, මහාසුදස්සනස්ස අයං කුසිනාරා කුසාවතී නාම රාජධානී අහොසි. සා ඛො ආනන්ද කුසාවතී පුරත්ථිමෙන ච පච්ඡිමෙනච ද්වාදසයොජනානි අහොසි ආයාමෙන, උත්තරෙන ච දක්ඛිණෙන ච සත්තයොජනානි විත්ථාරෙන. කුසාවතී ආනන්ද, රාජධානී ඉද්ධා චෙව අහොසි වීතා ච බහුජනා ච ආකිණ්ණමනුස්සා ච සුභික්ඛා ච."
            },
            {
                "type": "page-break",
                "text": "268"
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි ආනන්ද, දෙවානං ආළකමන්දා නාම රාජධානී ඉද්ධා චෙව ඵීතා ච බහුජනා ච ආකිණ්ණයක්ඛා ච සුභික්ඛා ච, එවමෙව ඛො ආනන්ද, කුසාවතී රාජධානී ඉද්ධා චෙව අහොසි ඵීතා ච බහුජනා ච ආකිණ්ණමනුස්සා ච සුභික්ඛා ච. කුසාවතී ආනන්ද, රාජධානී දසහි සද්දෙහි අවිචිත්තා අහොසි දිවා චෙව රත්තිං ච. සෙය්යථිදං, හත්ථිසද්දෙන අස්සසද්දෙන රථසද්දෙන භෙරිසද්දෙන මුදිඞ්ගසද්දෙන වීණාසද්දෙන ගීතසද්දෙන සම්මසද්දෙන තාලසද්දෙන (සඞ්ඛසද්දෙන) අසනාථ පිවථ ඛාදථාති දසමෙන සද්දෙන."
            },
            {
                "type": "paragraph",
                "text": "3. කුසාවතී ආනන්ද, රාජධානී සත්තහි පාකාරෙහි පරික්ඛිත්තා අහොසි. එකො පාකාරො සොවණ්ණමයො, එකො රූපියමයො, එකො වෙළුරියමයො, එකො ඵළිකමයො, එකො ලොහිතඞ්කමයො{1 ලොහිතඞ්ගමයො (කං)} එකො මසාරගල්ලමයො, එකො සබ්බරතනමයො. කුසාවතියා ආනන්ද, රාජධානියා චතුන්නං වණ්ණානං ද්වාරානි අහෙසුං. එකං ද්වාරං සොවණ්ණමයං, එකං රූපියමයං, එකං වෙළුරියමයං, එකං ඵළිකමයං. එකෙකස්මිං ද්වාරෙ සත්ත සත්ත එසිකා නිඛාතා අහෙසුං. තිපොරිසඞ්ගා තිපොරිසනිඛාතා ද්වාදසපොරිසා උබ්බෙධෙන. එකා එසිකා සොවණ්ණමයා, එකා රූපියමයා, එකා වෙළුරියමයා, එකා ඵළිකමයා, එකා ලොහිතඞ්කමයා, එකා මසාරගල්ලමයා, එකා සබ්බරතනමයා."
            },
            {
                "type": "paragraph",
                "text": "කුසාවතී ආනන්ද, රාජධානී සත්තහි තාලපන්තීහි පරික්ඛිත්තා අහොසි. එකා තාලපන්ති සොවණ්ණමයා, එකා රූපියමයා, එකා වෙළුරියමයා, එකා ඵළිකමයා, එකා ලොහිතඞ්කමයා, එකා මසාරගල්ලමයා, එකා සබ්බරතනමයා. සොවණ්ණමයස්ස තාලස්ස සොවණ්ණමයො ඛන්ධො අහොසි, රූපියමයානි පත්තානි ච ඵලානි ච. රූපියමයස්ස තාලස්ස රූපියමයො ඛන්ධො අහොසි, සොවණ්ණමයානි පත්තානි ච ඵලානි ච. වෙළුරියමයස්ස තාලස්ස වෙළුරියමයො ඛන්ධො අහොසි, ඵළිකමයානි පත්තානි ච ඵලානි ච. ඵළිකමයස්ස තාලස්ස ඵළිකමයො ඛන්ධො අහොසි, වෙළුරියමයානි පත්තානි ච ඵලානි ච. ලොහිතඞ්කමයස්ස තාලස්ස ලොහිතඞ්කමයො ඛන්ධො අහොසි, මසාරගල්ලමයානි පත්තානි ච ඵලානි ච. මසාරගල්ලමයස්ස තාලස්ස මසාරගල්ලමයො ඛන්ධො අහොසි, ලොහිතඞ්කමයානි පත්තානි ච ඵලානි ච. සබ්බරතනමයස්ස තාලස්ස සබ්බරතනමයො ඛන්ධො අහොසි, සබ්බරතනමයානි පත්තානි ච ඵලානි ච. තාසං ඛො පනානන්ද, තාලපන්තීනං වාතෙරිතානං සද්දො අහොසි වග්ගු ච රජනීයො ච කමනීයො ච{2 ඛමනීයො (මඡසං)} මදනීයො ච. සෙය්යථාපි ආනන්ද, පඤ්චඞ්ගිකස්ස තූරියස්ස සුවිනීතස්ස සුප්පටිතාළිතස්ස කුසලෙහි සමන්නාහතස්ස සද්දො හොති වග්ගු ච රජනීයො ච කමනීයො ච මදනීයො ච. එවමෙව ඛො ආනන්ද, තාසං තාලපන්තීනං වාතෙරිතානං සද්දො අහොසි වග්ගු ච රජනීයො ච කමනීයො ච මදනීයො ච. යෙ ඛො පනානන්ද, තෙන සමයෙන කුසාවතියා රාජධානියා ධුත්තා අහෙසුං සොණ්ඩා පිපාසා, තෙ තාසං තාලපන්තීනං වාතෙරිතානං සද්දෙන පරිචාරෙසුං."
            },
            {
                "type": "page-break",
                "text": "270"
            },
            {
                "type": "centered",
                "text": "චක්කරතනං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "4. රාජා ආනන්ද, මහාසුදස්සනො සත්තහි රතනෙහි සමන්නාගතො අහොසි චතූහි ච ඉද්ධීහි. කතමෙහි සත්තහි? ඉධානන්ද, රඤ්ඤො මහාසුදස්සනස්ස තදහුපොසථෙ පණ්ණරසෙ සීසං නහාතස්ස උපොසථිකස්ස උපරිපාසාදවරගතස්ස දිබ්බං චක්කරතනං පාතුරහොසි සහස්සාරං සනෙමිකං සනාභිකං සබ්බාකාරපරිපූරං. දිස්වා රඤ්ඤො මහාසුදස්සනස්ස එතදහොසි: “සුතංඛො පනෙතං: යස්ස රඤ්ඤො ඛත්තියස්ස මුද්ධාභිසිත්තස්ස තදහුපොසථෙ පණ්ණරසෙ සීසං නහාතස්ස උපොසථිකස්ස උපරිපාසාදවරගතස්ස දිබ්බං චක්කරතනං පාතු භවති සහස්සාරං සනෙමිකං සනාභිකං සබ්බාකාරපරිපූරං, සො හොති රාජා චක්කවත්තීති. අස්සං නු ඛො අහං රාජා චක්කවත්තී”ති."
            },
            {
                "type": "paragraph",
                "text": "5. අථ ඛො ආනන්ද, රාජා මහාසුදස්සනො උට්ඨායාසනා එකංසං උත්තරාසඞ්ගං කරිත්වා, වාමෙන හත්ථෙන සුවණ්ණභිඞ්කාරං ගහෙත්වා දක්ඛිණෙන හත්ථෙන චක්කරතනං අබ්භුක්කිරි: පවත්තතු භවං චක්කරතනං, අභිවිජිනාතු භවං චක්කරතනන්ති. අථ ඛො තං ආනන්ද, චක්කරතනං පුරත්ථිමං දිසං පවත්ති’?{1 පවත්තති (ස්යා. කං.)} අන්වදෙව{2 අනුදෙව (ස්යා)} රාජා මහාසුදස්සනො සද්ධිං චතුරඞ්ගිනියා සෙනාය. යස්මිං ඛො පනානන්ද, පදෙසෙ චක්කරතනං පතිට්ඨාසි, තත්ථ රාජා මහාසුදස්සනො වාසං උපගඤ්ඡි සද්ධිං චතුරඞ්ගිනියා සෙනාය. යෙ ඛො පනානන්ද, පුරත්ථිමාය දිසාය පටිරාජානො, තෙ රාජානං මහාසුදස්සනං උපසඞ්කමිත්වා එවමාහංසු: එහි ඛො මහාරාජ, ස්වාගතං, තෙ මහාරාජ, සකන්තෙ මහාරාජ, අනුසාස මහාරාජාති. රාජා මහාසුදස්සනො එවමාහ පාණො න හන්තබ්බො අදින්නං නාදාතබ්බං කාමෙසු මිච්ඡා න චරිතබ්බා. මුසා න භාසිතබ්බා. මජ්ජං න පාතබ්බං. යථා භුත්තඤ්ච භුඤ්ජථාති. යෙ ඛො පනානන්ද, පුරත්ථිමාය දිසාය පටිරාජානො, රත රඤ්ඤො මහාසුදස්සනස්ස අනුයන්තා අහෙසුං. අථ ඛො තං ආනන්ද, චක්කරතනං පුරත්ථිමං සමුද්දං අජ්ඣොගාහෙත්වා{3 අජ්ඣොගාහෙත්වා (PTS)} පච්චුත්තරිත්වා දක්ඛිණං දිසං පවත්ති, දක්ඛිණං සමුද්දං අජ්ඣොගාහෙත්වා පච්චුත්තරිත්වා පච්ඡිමං දිසං පවත්ති, පච්ඡිමං සමුද්දං අජ්ඣොගාහෙත්වා පච්චුත්තරිත්වා උත්තරං දිසං පවත්ති, අන්වදෙව රාජා මහාසුදස්සනො සද්ධිං චතුරඞ්ගිනියා සෙනාය. යස්මිං ඛො පනානන්ද, පදෙසෙ චක්කරතනං පතිට්ඨාසි, තත්ථ රාජා මහාසුදස්සනො වාසං උපගඤ්ඡි සද්ධිං චතුරඞ්ගිනියා සෙනාය. යෙ ඛො පනානන්ද, උත්තරාය දිසාය පටිරාජානො, තෙ රාජානං මහාසුදස්සනං උපසඞ්කමිත්වා එවමාහංසු: එහි ඛො මහාරාජ, ස්වාගතං තෙ මහාරාජ, සකං තෙ මහාරාජ, අනුසාස මහාරාජාති. රාජා මහාසුදස්සනො එවමාහ: පාණො න හන්තබ්බො, අදින්නං නාදාතබ්බං, කාමෙසු මිච්ඡා න චරිතබ්බා, මුසා න භාසිතබ්බා, මජ්ජං න පාතබ්බං, යථා භුත්තඤ්ච භුඤ්ජථාති. යෙ ඛො පනානන්ද, උත්තරාය දිසාය පටිරාජානො, තෙ රඤ්ඤො මහාසුදස්සනස්ස අනුයන්තා{4 ආකයන්ත (මඡසං)} අහෙසුං."
            },
            {
                "type": "page-break",
                "text": "272"
            },
            {
                "type": "paragraph",
                "text": "6. අථ ඛො තං ආනන්ද, චක්කරතනං සමුද්දපරියන්තං පඨවිං අභිවිජිනිත්වා කුසාවතිං රාජධානිං පච්චාගන්ත්වා රඤ්ඤො මහාසුදස්සනස්ස අන්තෙපුරද්වාරෙ අත්ථකරණප්පමුඛෙ අක්ඛාහතං මඤ්ඤො අට්ඨාසි. රඤ්ඤො මහාසුදස්සනස්ස අන්තෙපුරං උපසොභයමානං. රඤ්ඤො ආනන්ද, මහාසුදස්සනස්ස එවරූපං චක්කරතනං පාතුරහොසි."
            },
            {
                "type": "centered",
                "text": "හත්ථිරතනං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "7. පුන ච පරං ආනන්ද, රඤ්ඤො මහාසුදස්සනස්ස හත්ථිරතනං පාතුරහොසි, සබ්බසෙතො සත්තප්පතිට්ඨො ඉද්ධිමා වෙහාසඞ්ගමො උපොසථො නාම නාගරාජා. තං දිස්වා රඤ්ඤො මහාසුදස්සනස්ස චිත්තං පසීදි: භද්දකං වත භො හත්ථියානං, සචෙ දමථං උපෙය්යාති. අථ ඛො තං ආනන්ද, හත්ථිරතනං සෙය්යථාපි නාම භද්දො හත්ථාජානීයො දීඝරත්තං සුපරිදන්තො, එවමෙව දමථං උපගඤ්ඡ. භූතපුබ්බං ආනන්ද, රාජා මහාසුදස්සනො තමෙව හත්ථිරතනං වීමංසමානො පුබ්බණ්හසමයං අභිරූහිත්වා සමුද්දපරියන්තං පඨවිං අනුයායිත්වා කුසාවතිං රාජධානිං පච්චාගන්ත්වා පාතරාසමකාසි. රඤ්ඤො ආනන්ද, මහාසුදස්සනස්ස එවරූපං හත්ථිරතනං පාතුරහොසි."
            },
            {
                "type": "centered",
                "text": "අස්සරතනං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "8. පුන ච පරං ආනන්ද, රඤ්ඤො මහාසුදස්සනස්ස අස්සරතනං පාතුරහොසි, සබ්බසෙතො කාළසීසො මුඤ්ජකෙසො ඉද්ධිමා වෙහාසඞ්ගමො වලාහකො නාම අස්සරාජා. තං දිස්වා රඤ්ඤො මහාසුදස්සනස්ස චිත්තං පසීදි: භද්දකං වත භො අස්සයානං සචෙ දමථං උපෙය්යාති. අථ ඛො තං ආනන්ද, අස්සරතනං සෙය්යථාපි නාම භද්දො අස්සාජානීයො දීඝරත්තං සුපරිදන්තො, එවමෙව දමථං උපගඤ්ඡි. භූතපුබ්බං ආනන්ද, රාජා මහාසුදස්සනො තමෙව අස්සරතනං වීමංසමානො පුබ්බණ්හසමයං අභිරුහිත්වා සමුද්දපරියන්තං පඨවිං අනුයායිත්වා කුසාවතිං රාජධානිං පච්චාගන්ත්වා පාතරාසමකාසි. රඤ්ඤො ආනන්ද, මහාසුදස්සනස්ස එවරූපං අස්සරතනං පාතුරහොසි."
            },
            {
                "type": "centered",
                "text": "මණිරතනං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "9. පුන ච පරං ආනන්ද, රඤ්ඤො මහාසුදස්සනස්ස මණිරතනං පාතුරහොසි. සො අහොසි මණි වෙළුරියො සුභො ජාතිමා අට්ඨංසො සුපරිකම්මකතො අච්ඡො විප්පසන්නො සබ්බාකාරසම්පන්නො. තස්ස ඛො පනානන්ද, මණිරතනස්ස ආභා සමන්තා යොජනං ඵුටා අහොසි. භූතපුබ්බං ආනන්ද, රාජා මහාසුදස්සනො තමෙව මණිරතනං වීමංසමානො චතුරඞ්ගිනිං සෙනං සන්නයහිත්වා මණිං ධජග්ගං ආරොපෙත්වා රත්තන්ධකාරතිමිසායං පායාසි. යෙ ඛො පනානන්ද, සමන්තා ගාමා අහෙසුං, තෙ තෙනොභාසෙන කම්මන්තෙ පයොජෙසුං දිවාති මඤ්ඤමානා. රඤ්ඤො ආනන්ද, මහාසුදස්සනස්ස එවරූපං මණිරතනං පාතුරහොසි."
            },
            {
                "type": "page-break",
                "text": "274"
            },
            {
                "type": "centered",
                "text": "ඉත්ථිරතනං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "10. පුන ච පරං ආනන්ද, රඤ්ඤො මහාසුදස්සනස්ස ඉත්ථිරතනං පාතුරහොසි, අභිරූපා දස්සනීයා පාසාදිකා පරමාය වණ්ණපොක්ඛරතාය සමන්නාගතා, නාතිදීඝා නාතිරස්සා නාතිකිසා නාතිථූලා නාතිකාළි නාච්චොදාතා අතික්කන්තා මානුසං වණ්ණං{1 මානුස්සිවණ්ණං - ස්යා. මානුසිවණ්ණං (මඡසං)} අප්පත්තා දිබ්බං වණ්ණං. තස්ස ඛො පනානන්ද, ඉත්ථිරතනස්ස එවරූපො කායසම්ඵස්සො හොති, සෙය්යථාපි නාම තූලපිචුනො වා කප්පාසපිචුනො වා. තස්ස ඛො පනානන්ද, ඉත්ථිරතනස්ස සීතෙ උණ්හානි ගත්තානි හොන්ති, උණ්හෙ සීතානි. තස්ස ඛො පනානන්ද, ඉත්ථිරතනස්ස කායතො චන්දනගන්ධො වායති. මුඛතො උප්පලගන්ධො. තං ඛො පනානන්ද, ඉත්ථිරතනං රඤ්ඤො මහාසුදස්සනස්ස පුබ්බුට්ඨායිනී අහොසි පච්ඡානිපාතිනී කිංකාරපටිසාවිනී මනාපචාරිනී පියවාදිනී. තං ඛො පනානන්ද, ඉත්ථිරතනං රාජානං මහාසුදස්සනං මනසාපි නො අතිචාරී{2 අතිචරී - කං.}. කුතො පන කායෙන. රඤ්ඤො ආනන්ද, මහාසුදස්සනස්ස එවරූපං ඉත්ථිරතනං පාතුරහොසි."
            },
            {
                "type": "centered",
                "text": "ගහපතිරතනං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "11. පුන ච පරං ආනන්ද, රඤ්ඤො මහාසුදස්සනස්ස ගහපතිරතනං පාතුරහොසි. තස්ස කම්මවිපාකජං දිබ්බචක්ඛු පාතුරහොසි, යෙන නිධිං පස්සති සස්සාමිකම්පි අස්සාමිකම්පි. සො රාජානං මහාසුදස්සනං උපසඞ්කමිත්වා එවමාහ: අප්පොස්සුක්කො ත්වං දෙව හොහි, අහං තෙ ධනෙන ධනකරණීයං කරිස්සාමීති. භූතපුබ්බං ආනන්ද, රාජා මහාසුදස්සනො තමෙව ගහපතිරතනං වීමංසමානො නාවං අභිරුහිත්වා මජ්ඣෙ ගඞ්ගාය නදියා සොතං ඔගාහිත්වා ගහපතිරතනං එතදවොච: අත්ථො මෙ ගහපති, හිරඤ්ඤසුවණ්ණෙනාති’ තෙන හි මහාරාජ, එකං තීරං නාව උපෙතූති. ඉධෙව මෙ ගහපති අත්ථො හිරඤ්ඤසුවණ්ණෙනාති. අථ ඛො තං ආනන්ද, ගහපතිරතනං උභොහි හත්ථෙහි උදකං ඔමසිත්වා පූරං හිරඤ්ඤ වණ්ණස්ස කුම්භිං උද්ධරිත්වා රාජානං මහාසුදස්සනං එතදවොච: අලමෙත්තාවතා මහාරාජ, කතමෙත්තාවතා මහාරාජ, පූජිතමෙත්තාවතා මහාරාජාති. රාජා මහාසුදස්සනො එවමාහ: අලමෙත්තාවතා ගහපති, කතමෙත්තාවතා ගහපති, පූජිතමෙත්තාවතා ගහපතීති. රඤ්ඤො ආනන්ද, මහාසුදස්සනස්ස එවරූපං ගහපතිරතනං පාතුරහොසි."
            },
            {
                "type": "page-break",
                "text": "276"
            },
            {
                "type": "centered",
                "text": "පරිනායකරතනං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "12. පුන ච පරං ආනන්ද, රඤ්ඤො මහාසුදස්සනස්ස පරිනායකරතනං පාතුරහොසි පණ්ඩිතො වියත්තො මෙධාවී පටිබලො රාජානං මහාසුදස්සනං උපයාපෙතබ්බං උපයාපෙතුං අපයාපෙතබ්බං අපයාපෙතුං. සො රාජානං මහාසුදස්සනං උපසඞ්කමිත්වා එවමාහ: අප්පොස්සුක්කො ත්වං දෙව හොහි, අහමනුසාසිස්සාමීති. රඤ්ඤො ආනන්ද, මහාසුදස්සනස්ස එවරූපං පරිණායකරතනං පාතුරහොසි: රාජා ආනන්ද, මහාසුදස්සනො ඉමෙහි සත්තහි රතනෙහි සමන්නාගතො අහොසි."
            },
            {
                "type": "centered",
                "text": "ඉද්ධිසමන්නාගමො",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "13. පුන ච පරං ආනන්ද, රාජා මහාසුදස්සනො චතූහි ඉද්ධීහි සමන්නාගතො අහොසි. කතමාහි චතූහි ඉද්ධීහි? ඉධ ආනන්ද, රාජා මහාසුදස්සනො අභිරූපො අහොසි දස්සනීයො පාසාදිකො පරමාය වණ්ණපොක්ඛරතාය සමන්නාගතො අතිවිය අඤ්ඤෙහි මනුස්සෙහි. රාජා ආනන්ද, මහාසුදස්සනො ඉමාය පඨමාය ඉද්ධියා සමන්නාගතො අහොසි."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං ආනන්ද, රාජා මහාසුදස්සනො දීඝායුකො අහොසි චිරට්ඨිතිකො අතිවිය අඤ්ඤෙහි මනුස්සෙහි. රාජා ආනන්ද, මහාසුදස්සනො ඉමාය දුතියාය ඉද්ධියා සමන්නාගතො අහොසි."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං ආනන්ද, රාජා මහාසුදස්සනො අප්පාබාධො අහොසි අප්පාතඞ්කො සමවෙපාකිනියා ගහණිසා සමන්නාගතො නාතිසීතාය නාච්චුණ්හාය අතිවිය අඤ්ඤෙහි මනුස්සෙහි. රාජා ආනන්ද, මහාසුදස්සනො ඉමාය තතියාය ඉද්ධියා සමන්නාගතො අහොසි."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං ආනන්ද, රාජා මහාසුදස්සනො බ්රාහ්මණගහපතිකානං පියො අහොසි මනාපො. සෙය්යථාපි ආනන්ද, පිතා පුත්තානං පියො හොති. මනාපො, එවමෙව ඛො ආනන්ද, රාජා මහාසුදස්සනො බ්රාහ්මණගහපතිකානං පියො අහොසි මනාපො රඤ්ඤො පි ආනන්ද, මහාසුදස්සනස්ස බ්රාහ්මණගහපතිකා පියා අහෙසුං මනාපා. සෙය්යථාපි ආනන්ද, පිතු පුත්තා පියා හොන්ති මනාපා, එවමෙව ඛො ආනන්ද, රඤ්ඤොපි මහාසුදස්සනස්ස බ්රාහ්මණගහපතිකා පියා අහෙසුං මනාපා. සෙය්යථාපි ආනන්ද, පිතු පුත්ත පියා හොන්ති මනාපා එවමෙව ඛො ආනන්ද රඤ්ඤො මහාසුදස්සනස්ස බ්රාහ්මණගහපතිකා පියා අහෙසුං මනාපා. "
            },
            {
                "type": "paragraph",
                "text": "භූතපුබ්බං ආනන්ද, රාජා මහාසුදස්සනො චතුරඞ්ගිනියා සෙනාය උය්යානභූමිං නිය්යාසි. අථ ඛො ආනන්ද, බ්රාහ්මණගහපතිකා රාජානං මහාසුදස්සනං උපසඞ්කමිත්වා එවමාහංසු ‘අතරමානො දෙව යාහි යථා තං මයං චිරතරං පස්සෙය්යාමා’ති. රාජා පි ආනන්ද, මහාසුදස්සනො සාරථිං ආමන්තෙසි අතරමානො සාරථි රථං පෙසෙහි යථාහං බ්රාහ්මණගහපතිකෙහි චිරතර පස්සී යය්යන්ති. රාජා ආනන්ද, මහාසුදස්සනො ඉමාය චතුත්ථියා{1 චතුත්ථාය (ස්යා)} ඉද්ධියා සමන්නාගතො අහොසි."
            },
            {
                "type": "paragraph",
                "text": "රාජා ආනන්ද, මහාසුදස්සනො ඉමාහි චතූහි ඉද්ධීහි සමන්නාගතො අහොසි."
            },
            {
                "type": "page-break",
                "text": "278"
            },
            {
                "type": "centered",
                "text": "පොක්ඛරණීමාපනං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "14. අථ ඛො ආනන්ද, රඤ්ඤො මහාසුදස්සනස්ස එතදහොසි: යන්නූනාහං ඉමාසු තාලන්තරිකාසු ධනුසතෙ ධනුසතෙ පොක්ඛරණියො මාපෙය්යන්ති. මාපෙසි ඛො ආනන්ද, රාජා මහාසුදස්සනො තාසු තාලන්තරිකාසු ධනුසතෙ ධනුසතෙ පොක්ඛරණියො. තා ඛො පනානන්ද පොක්ඛරණියො චතුන්නං වණ්ණානං ඉට්ඨකාහි චිතා අහෙසුං, එකා ඉට්ඨකා සොවණ්ණමයා, එකා රූපියමයා, එකා වෙළුරියමයා, එකා ඵළිකමයා. තාසු ඛො පනානන්ද, පොක්ඛරණීසු චත්තාරි චත්තාරි ච සොපාණානි අහෙසු චතුන්නං වණ්ණානං. එකං සොපාණං සොවණ්ණමයං, එකං රූපියමයං, එකං වෙළුරියමයං, එකං ඵළිකමයං. සොවණ්ණමයස්ස සොපාණස්ස සොවණ්ණමයා ථම්භා අහෙසුං, රූපියමයා සූචියො ච උණ්හීසඤ්ච. රූපියමයස්ස සොපාණස්ස රූපියමයා ථම්භා අහෙසුං, සොවණ්ණමයා සූචියො ච උණ්හීසඤ්ච. වෙළුරියමයස්ස සොපාණස්ස වෙළුරියමයා ථම්භා අහෙසුං, ඵළිකමයා සූචියො ච උණ්හීසඤ්ච. ඵළිකමයස්ස සොපාණස්ස ඵළිකමයා ථම්භා අහෙසුං, වෙළුරියමයා සූචියො ච උණ්හීසඤ්ච. "
            },
            {
                "type": "paragraph",
                "text": "තා ඛො පනානන්ද, පොක්ඛරණියො ද්වීහි වෙදිකාහි පරික්ඛිත්තා අහෙසුං එකා වෙදිකා සොවණ්ණමයා, එකා රූපියමයා. සොවණ්ණමයාය වෙදිතාය සොවණ්ණමයා ථම්භා අහෙසුං, රූපියමයා සූචියො ච උණ්හීසඤ්ච. රූපියමයාය වෙදිකාය රූපියමයා ථම්භා අහෙසුං, සොවණ්ණමයා සූචියො ච උණ්හීසඤ්ච. අථ ඛො ආනන්ද, රඤ්ඤො මහාසුදස්සනස්ස එතදහොසි “යන්නූනාහං ඉමාසු පොක්ඛරණීසු එවරූපං මාලං රොපාපෙය්යං: උප්පලං පදුමං කුමුදං පුණ්ඩරීකං සබ්බොතුකං සබ්බජනස්ස අනාවටන්ති. රොපාපෙසි ඛො ආනන්ද, රාජා මහාසුදස්සනො තාසු පොක්ඛරණීසු එවරූපං මාලං උප්පලං පදුමං කුමුදං පුණ්ඩරීකං සබ්බොතුකං සබ්බජනස්ස අනාවටං."
            },
            {
                "type": "paragraph",
                "text": "15. අථ ඛො ආනන්ද, රඤ්ඤො මහාසුදස්සනස්ස එතදහොසි: “යන්නූනාහං ඉමාසං පොක්ඛරණීනං තීරෙ නහාපකෙ පුරිසෙ ඨපෙය්යං යෙ ආගතාගතං ජනං නහාපෙස්සන්තී”ති. ඨපෙසි ඛො ආනන්ද, රාජා මහාසුදස්සනො තාසං පොක්ඛරණීනං තීරෙ නහාපකෙ පුරිසෙ යෙ ආගතාගතං ජනං නහාපෙසුං."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආනන්ද, රඤ්ඤො මහාසුදස්සනස්ස එතදහොසි: යන්නූනාහං ඉමාසං පොක්ඛරණීනං තීරෙ එවරූපං දානං පට්ඨපෙය්යං අන්නං අන්නත්ථිකස්ස{1 අන්නත්ථිතස්ස (ස්යා. කා. PTS)} පානං පානත්ථිකස්ස වත්ථං වත්ථත්ථිකස්ස යානං යානත්ථිකස්ස, සයනං සයනත්ථිකස්ස, ඉත්ථිං ඉත්ථත්ථිකස්ස, හිරඤ්ඤං හිරඤ්ඤත්ථිකස්ස, සුවණ්ණං සුවණ්ණත්ථිකස්සාති. පට්ඨපෙසි ඛො ආනන්ද, රාජා මහාසුදස්සනො තාසං පොක්ඛරණීනං තීරෙ එවරූපං දානං: අන්නං අන්නත්ථිකස්ස, පානං පානත්ථිකස්ස, වත්ථං වත්ථත්ථිකස්ස, යානං යානත්ථිකස්ස, සයනං සයනත්ථිකස්ස, ඉත්ථිං ඉත්ථත්ථිකස්ස, හිරඤ්ඤං හිරඤ්ඤත්ථිකස්ස, සුවණ්ණං සුවණ්ණත්ථිකස්සාති."
            },
            {
                "type": "page-break",
                "text": "280"
            },
            {
                "type": "paragraph",
                "text": "16. අථ ඛො ආනන්ද, බ්රාහ්මණගහපතිකා පහූතං සාපතෙය්යං ආදාය රාජානං මහාසුදස්සනං උපසඞ්කමිත්වා එවමාහංසු: ඉදං දෙව පහූතං සාපතෙය්යං දෙවඤ්ඤෙව උද්දිස්ස ආභතං, තං දෙවො පටිගණ්හාතූති. “අලං ගො, මමපීදං පහූතං සාපතෙය්යං ධම්මිකෙන බලිනා අභිසඞ්ඛතං තං වො හොතු, ඉතො ච භිෙය්යා හරථා”ති. තෙ රඤ්ඤා පටික්ඛිත්තා එකමන්තං අපක්කම්ම එවං සමචින්තෙසුං: ‘න ඛො එතං අම්හාකං පතිරූපං, යං මයං ඉමානි සාපතෙය්යානි පුනදෙව සකානි ඝරානි පටිහරෙය්යාමාති. යන්නූන මයං රඤ්ඤො මහාසුදස්සනස්ස නිවෙසනං මාපෙය්යාමා”ති. තෙ රාජානං මහාසුදස්සනං උපසඞ්කමිත්වා එවමාහංසු ‘නිවෙසනන්තෙ දෙව මාපෙස්සාමා’ති. අධිවාසෙසි ඛො ආනන්ද, රාජා මහාසුදස්සනො තුණ්හීභාවෙන. අථ ඛො ආනන්ද, සක්කො දෙවානමින්දො රඤ්ඤො මහාසුදස්සනස්ස චෙතසා චෙතො පරිවිතක්කමඤ්ඤාය විස්සකම්මං{1 විසුකම්මං - (කා)} දෙවපුත්තං ආමන්තෙසි, එහි ත්වං සම්ම විස්සකම්ම රඤ්ඤො මහාසුදස්සනස්ස නිවෙසනං මාපෙහි ධම්මං නාම පාසාදන්ති."
            },
            {
                "type": "paragraph",
                "text": "‘එවං භද්දන්ෙත’ති ඛො ආනන්ද, විස්සකම්මා දෙවපුත්තො සක්කස්ස දෙවානමින්දස්ස පටිස්සුත්වා, සෙය්යථාපි නාම බලවා පුරිසො සමිඤ්ජිතං වා බාහං පසාරෙය්ය පසාරිතං වා බාහං සමිඤ්ජෙය්ය, එවමෙවං දෙවෙසු තාවතිංසෙසු අන්තරහිතො, රඤ්ඤො මහාසුදස්සනස්ස පුරතො පාතුරහොසි. අථ ඛො ආනන්ද, විස්සකම්මා දෙවපුත්තො රාජානං මහාසුදස්සනං එතදවොච, නිවෙසනන්තෙ දෙව මාපෙස්සාමි ධම්මං නාම පාසාදන්ති. අධිවාසෙසි ඛො ආනන්ද, රාජා මහාසුදස්සනො තුණ්හීභාවෙන. මාපෙසි ඛො ආනන්ද, විස්සකම්මා දෙවපුත්තො රඤ්ඤො මහාසුදස්සනස්ස නිවෙසනං ධම්මං නාම පාසාදං."
            },
            {
                "type": "paragraph",
                "text": "17. ධම්මො ආනන්ද, පාසාදො පුරත්ථිමෙන ච පච්ඡිමෙන ච යොජනං ආයාමෙන අහොසි, උත්තරෙන ච දක්ඛිණෙන ච අද්ධයොජනං විත්ථාරෙන. ධම්මස්ස ආනන්ද, පාසාදස්ස තිපොරිසං උච්චත්තෙන වත්ථු චිතං අහොසි චතුන්නං වණ්ණානං ඉට්ඨකාහි, එකා ඉට්ඨකා සොවණ්ණමයා, එකා රූපියමයා, එකා වෙළුරියමයා, එකා ඵළිකමයා."
            },
            {
                "type": "paragraph",
                "text": "ධම්මස්ස ආනන්ද, පාසාදස්ස චතුරාසීති ථම්භසහස්සානි අහෙසුං චතුන්නං වණ්ණානං, එකො ථම්භො සොවණ්ණමයො, එකො රූපියමයො, එකො වෙළුරියමයො, එකො ඵළිකමයො. ධම්මො ආනන්ද, පාසාදො චතුන්නං වණ්ණානං ඵලකෙහි සන්ථතො අහොසි’"
            },
            {
                "type": "page-break",
                "text": "282"
            },
            {
                "type": "paragraph",
                "text": "එකං ඵලකං සොවණ්ණමයං, එකං රූපියමයං, එකං වෙළුරියමයං, එකං ඵළිකමයං. ධම්මස්ස ආනන්ද, පාසාදස්ස චතුවීසති සොපාණානි අහෙසුං චතුන්නං වණ්ණානං, එකං සොපාණං සොවණ්ණමයං එකං රූපියමයං, එකං වෙළුරියමයං, එකං ඵළිකමයං. -පෙ- ඵළිකමයස්ස සොපාණස්ස ඵළිකමයා ථම්භා අහෙසුං වෙළුරියමයා සූචියො ච උණ්හීසඤ්ච."
            },
            {
                "type": "paragraph",
                "text": "ධම්මෙ ආනන්ද, පාසාදෙ චතුරාසීතිකූටාගාරසහස්සානි අහෙසුං චතුන්නං වණ්ණානං: එකං කූටාගාරං සොවණ්ණමයං, එකං රූපියමයං, එකං වෙළුරියමයං, එකං ඵළිකමයං. සොවණ්ණමයෙ කූටාගාරෙ රූපියමයො පල්ලඞ්කො පඤ්ඤත්තො අහොසි, රූපියමයෙ කූටාගාරෙ සොවණ්ණමයො පල්ලඞ්කො පඤ්ඤත්තො අහොසි, වෙළුරියමයෙ කූටාගාරෙ දන්තමයො පල්ලඞ්කො පඤ්ඤත්තො අහොසි, ඵළිකමයෙ කූටාගාරෙ මසාරගල්ලමයො පල්ලඞ්කො පඤ්ඤත්තො අහොසි. සොවණ්ණමයස්ස කූටාගාරස්ස ද්වාරෙ රූපියමයො තාලො ඨිතො අහොසි, තස්ස රූපියමයො ඛන්ධො. සොවණ්ණමයානි පත්තානි ච ඵලානි ච. රූපියමයස්ස කූටාගාරස්ස ද්වාරෙ සොවණ්ණමයො තාලො ඨිතො අහොසි, තස්ස සොවණ්ණමයො ඛන්ධො, රූපියමයානි පත්තානි ච ඵලානි ච. වෙළුරියමයස්ස කූටාගාරස්ස ද්වාරෙ ඵළිකමයො තාලො ඨිතො අහොසි, තස්ස ඵළිකමයො ඛන්ධො, වෙළුරියමයානි පත්තානි ච ඵලානි ච. ඵළිකමයස්ස කූටාගාරස්ස ද්වාරෙ වෙළුරියමයො තාලො ඨිතො අහොසි, තස්ස වෙළුරියමයො ඛන්ධො, ඵළිකමයානි පත්තානි ච ඵලානි ච."
            },
            {
                "type": "paragraph",
                "text": "18. අථ ඛො ආනන්ද, රඤ්ඤො මහාසුදස්සනස්ස එතදහොසි: යන්නූනාහං මහාවියූහස්ස කූටාගාරස්ස ද්වාරෙ සබ්බසොවණ්ණමයං තාලවනං මාපෙය්යං යත්ථ දිවාවිහාරං නිසීදිස්සාමීති. මාපෙසි ඛො ආනන්ද, රාජා මහාසුදස්සනො මහාවියූහස්ස කූටාගාරස්ස ද්වාරෙ සබ්බසොවණ්ණමයං තාලවනං යත්ථ දිවාවිහාරං නිසීදි. ධම්මො ආනන්ද, පාසාදො ද්වීහි වෙදිකාහි පරික්ඛිත්තො අහොසි, එකා වෙදිකා සොවණ්ණමයා, එකා රූපියමයා. සොවණ්ණමයාය වෙදිකාය සොවණ්ණමයා ථම්භා අහෙසුං, රූපියමයා සූචියො ච උණ්හීසඤ්ච. රූපියමයාය වෙදිකාය රූපියමයා ථම්භා අහෙසුං, සොවණ්ණමයා සූචියො ච උණ්හීසඤ්ච."
            },
            {
                "type": "paragraph",
                "text": "19. ධම්මො ආනන්ද, පාසාදො ද්වීහි කිංකිණිකජාලෙහි{1 කිංකණිකජාලෙහි (ස්යා. කං)} පරික්ඛිත්තො අහොසි, එකං ජාලං සොවණ්ණමයං එකං රූපියමයං. සොවණ්ණමයස්ස ජාලස්ස රූපියමයා කිංකිණියො අහෙසුං. රූපියමයස්ස ජාලස්ස සොවණ්ණමයා කිංකිණියො අහෙසුං."
            },
            {
                "type": "page-break",
                "text": "284"
            },
            {
                "type": "paragraph",
                "text": "තෙසං ඛො පනානන්ද, කිංකිණිකජාලානං වාතෙරිතානං සද්දො අහොසි වග්ගු ච රජනීයො ච කමනීයො ච මදනීයො ච. සෙය්යථාපි ආනන්ද, පඤ්චඞ්ගිකස්ස තූරියස්ස සුවිනීතස්ස සුප්පටිතාළිතස්ස සුකුසලෙහි{1 කුසලෙහි (සීමු. ස්යා. කා. PTS)} සමන්නාහතස්ස සද්දො හොති වග්ගු ච රජනීයො ච කමනීයො ච මදනීයො ච, එවමෙව ඛො ආනන්ද, තෙසං කිංකිණිකජාලානං වාතෙරිතානං සද්දො අහොසි වග්ගු ච රජනීයො ච කමනීයො ච මදනීයො ච. යෙ ඛො පනානන්ද, තෙන සමයෙන කුසාවතියා රාජධානියා ධුත්තා අහෙසුං සොණ්ඩා පිපාසා. තෙ තෙසං කිංකිණිකජාලානං වාතෙරිතානං සද්දෙන පරිචාරෙසුං."
            },
            {
                "type": "paragraph",
                "text": "නිට්ඨිතො ඛො පනානන්ද, ධම්මො පාසාදො දුද්දික්ඛො අහොසි මුසති චක්ඛූනි. සෙය්යථාපි ආනන්ද, වස්සානං පච්ඡිමෙ මාසෙ සරදසමයෙ විද්ධෙ විගතවලාහකෙ දෙවෙ ආදිච්චො නහං අබ්භුග්ගමමානො{2 අබ්භුස්සත්තමානො (මඡසං)} දුද්දික්ඛො{3 දුදික්ඛො (PTS)} හොති මුසති චක්ඛූනි, එවමෙව ඛො ආනන්ද, ධම්මො පාසාදො දුද්දික්ඛො අහොසි මුසති චක්ඛූනි."
            },
            {
                "type": "paragraph",
                "text": "20. අථ ඛො ආනන්ද, රඤ්ඤො මහාසුදස්සනස්ස එතදහොසි: යන්නූනාහං ධම්මස්ස පාසාදස්ස පුරතො ධම්මං නාම පොක්ඛරණිං මාපෙය්යන්ති. මාපෙසි ඛො ආනන්ද, රාජා මහාසුදස්සනො ධම්මස්ස පාසාදස්ස පුරතො ධම්මං නාම පොක්ඛරණිං. ධම්මා ආනන්ද, පොක්ඛරණී පුරත්ථිමෙන ච පච්ඡිමෙන ච යොජනං ආයාමෙන අහොසි, උත්තරෙන දක්ඛිණෙන ච අද්ධයොජනං විත්ථාරෙන. ධම්මා ආනන්ද, පොක්ඛරණී චතුන්නං වණ්ණානං ඉට්ඨකාහි චිතා අහොසි, එකා ඉට්ඨකා සොවණ්ණමයා, එකා රූපියමයා, එකා වෙළුරියමයා, එකා ඵළිකමයා."
            },
            {
                "type": "paragraph",
                "text": "ධම්මාය ආනන්ද, පොක්ඛරණියා චතුවීසතිසොපාණානි අහෙසුං චතුන්නං වණ්ණානං, එකං සොපාණං සොවණ්ණමයං, එකං රූපියමයං, එකං වෙළුරියමයං, එකං ඵළිකමයං. සොවණ්ණමයස්ස සොපාණස්ස සොවණ්ණමයා ථම්භා අහෙසුං රූපියමයා සූචියො ච උණ්හීසඤ්ච. රූපියමයස්ස සොපාණස්ස රූපියමයා ථම්භා අහෙසුං සොවණ්ණමයා සූචියො ච උණ්හීසඤ්ච. වෙළුරියමයස්ස සොපාණස්ස වෙළුරියමයා ථම්භා අහෙසුං ඵළිකමයා සූචියො ච උණ්හීසඤ්ච. ඵළිකමයස්ස සොපාණස්ස ඵළිකමයා ථම්භා අහෙසුං වෙළුරියමයා සූචියො ච උණ්හීසඤ්ච."
            },
            {
                "type": "paragraph",
                "text": "ධම්මා ආනන්ද, පොක්ඛරණී ද්වීහි වෙදිකාහි පරික්ඛිත්තා අහොසි, එකා වෙදිකා සොවණ්ණමයා, එකා රූපියමයා. සොවණ්ණමයාය වෙදිකාය සොවණ්ණමයා ථම්භා අහෙසුං රූපියමයා සූචියො ච උණ්හීසඤ්ච. රූපියමයාය වෙදිකාය රූපියමයා ථම්භා අහෙසුං සොවණ්ණමයා සූචියො ච උණ්හීසඤ්ච."
            },
            {
                "type": "page-break",
                "text": "286"
            },
            {
                "type": "paragraph",
                "text": "ධම්මා ආනන්ද, පොක්ඛරණී සත්තහි තාලපන්තීහි පාරික්ඛිත්තා අහොසි, එකා තාලපන්ති සොවණ්ණමයා, එකා රූපියමයා, එකා වෙළුරියමයා, එකා ඵළිකමයා, එකා ලොහිතඞ්කමයා, එකා මසාරගල්ලමයා, එකා සබ්බරතනමයා. සොවණ්ණමයස්ස තාලස්ස සොවණ්ණමයො ඛන්ධො අහොසි රූපියමයානි පත්තානි ච ඵලානි ච. රූපියමයස්ස තාලස්ස රූපියමයො ඛන්ධො අහොසි සොවණ්ණමයානි පත්තානි ච ඵලානි ච. වෙළුරියමයස්ස තාලස්ස වෙළුරියමයො ඛන්ධො අහොසි ඵළිකමයානි පත්තානි ච ඵලානි ච. ඵළිකමයස්ස තාලස්ස ඵළිකමයො ඛන්ධො අහොසි වෙළුරියමයානි පත්තානි ච ඵලානි ච. ලොහිතඞ්කමයස්ස තාලස්ස ලොහිතඞ්කමයො ඛන්ධො අහොසි මසාරගල්ලමයානි පත්තානි ච ඵලානි ච. මසාරගල්ලමයස්ස තාලස්ස මසාරගල්ලමයො ඛන්ධො අහොසි ලොහිතඞ්කමයානි පත්තානි ච ඵලානි ච. සබ්බරතනමයස්ස තාලස්ස සබ්බරතනමයො ඛන්ධො අහොසි සබ්බරතනමයානි පත්තානි ච ඵලානි ච. තාසං ඛො පන ආනන්ද, තාලපන්තීනං වාතෙරිතානං සද්දො අහොසි වග්ගු ච රජනීයො ච කමනීයො ච මදනීයො ච. සෙය්යථාපි ආනන්ද, පඤ්චඞ්ගිකස්ස තූරියස්ස සුවිනීතස්ස සුප්පටිතාළිතස්ස කුසලෙහි සමන්නාහතස්ස සද්දො හොති වග්ගු ච රජනීයො ච කමනීයො ච මදනීයො ච, එවමෙව ඛො ආනන්ද, තාසං තාලපන්තීනං වාතෙරිතානං සද්දො අහොසි වග්ගු ච රජනීයො ච කමනීයො ච මදනීයො ච. යෙ ඛො පනානන්ද, තෙන සමයෙන කුසාවතියා රාජධානියා ධුත්තා අහෙසුං සොණ්ඩා පිපාසා, තෙ තාසං තාලපන්තීනං වාතෙරිතානං සද්දෙසු පරිචාරෙසුං."
            },
            {
                "type": "paragraph",
                "text": "නිට්ඨිතෙ ඛො පනානන්ද, ධම්මෙ පාසාදෙ ධම්මාය ච පොක්ඛරණියා රාජා මහාසුදස්සනො. යෙ{1 යෙ ඛො පනානන්ද (ස්යා, කා.)} තෙන සමයෙන සමණෙසු වා සමණසම්මතා බ්රාහ්මණෙසු වා බ්රාහ්මණසම්මතා තෙ සබ්බකාමෙහි සන්තප්පෙත්වා ධම්මං පාසාදං අභිරුහි."
            },
            {
                "type": "centered",
                "text": "පඨමභාණවාරො.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "288"
            },
            {
                "type": "centered",
                "text": "ඣානසමාපත්තිපටිලාභො",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "21. අථ ඛො ආනන්ද, රඤ්ඤො මහාසුදස්සනස්ස එතදහොසි: කිස්ස නු ඛො මෙ ඉදං කම්මස්ස ඵලං, කිස්ස කම්මස්ස විපාකො, යෙනාහං එතරහි එවං මහිද්ධිකො එවං මහානුභාවො ති. අථ ඛො ආනන්ද, රඤ්ඤො මහාසුදස්සනස්ස එතදහොසි: තිණ්ණං ඛො මෙ ඉදං කම්මානං ඵලං තිණ්ණං කම්මානං විපාකො, යෙනාහං එතරහි එවං මහිද්ධිකො එවං මහානුභාවො, සෙය්යථිදං: දානස්ස දමස්ස. සංයමස්සාති. අථ ඛො ආනන්ද, රාජා මහාසුදස්සනො යෙන මහාවියූහං කූටාගාරං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා මහාවියූහස්ස කූටාගාරස්ස ද්වාරෙ ඨිතො උදානං උදානෙසි. ‘තිට්ඨ කාමවිතක්ක, තිට්ඨ බ්යාපාදවිතක්ක, තිට්ඨ විහිංසාවිතක්ක. එත්තාවතා කාමවිතක්ක, එත්තාවතා බ්යාපාදවිතක්ක, එත්තාවතා විහිංසාවිතක්කාති."
            },
            {
                "type": "paragraph",
                "text": "22. අථ ඛො ආනන්ද, රාජා මහාසුදස්සනො මහාවියූහං කූටාගාරං පවිසිත්වා සොවණ්ණමයෙ පල්ලඞ්කෙ නිසින්නො විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහාසි. විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියං ඣානං උපසම්පජ්ජ විහාසි. පීතියා ච විරාගා උපෙක්ඛකො ච විහාසි. සතො ච සම්පජානො සුඛඤ්ච කායෙන පටිසංවෙදෙසි. යං තං අරියා ආචික්ඛන්ති. උපෙක්ඛකො සතීමා සුඛවිහාරීති තතියං ඣානං උපසම්පජ්ජ විහාසි. සුඛස්ස ච පහානා දුක්ඛස්ස ච පහානා පුබ්බෙව සොමනස්සදොමනස්සානං අත්ථඞ්ගමා අදුක්ඛමසුඛං උපෙක්ඛාසතිපාරිසුද්ධිං චතුත්ථං ඣානං උපසම්පජ්ජ විහාසි."
            },
            {
                "type": "paragraph",
                "text": "23. අථ ඛො ආනන්ද, රාජා මහාසුදස්සනො මහාවියූහා කූටාගාරා නික්ඛමිත්වා සොවණ්ණමයං කූටාගාරං පවිසිත්වා රූපියමයෙ පල්ලඞ්කෙ නිසින්නො මෙත්තාසහගතෙන චෙතසා එකං දිසං ඵරිත්වා විහාසි. තථා දුතියං, තථා තතියං, තථා චතුත්ථං, ඉති උද්ධමධො තිරියං සබ්බධි සබ්බත්තතාය සබ්බාවන්තං ලොකං මෙත්තාසහගතෙන චෙතසා විපුලෙන මහග්ගතෙන අප්පමාණෙන අවෙරෙන අබ්යාපජ්ජෙන ඵරිත්වා විහාසි. කරුණාසහගතෙන චෙතසා, -පෙ- මුදිතාසහගතෙන චෙතසා, -පෙ- උපෙක්ඛාසහගතෙන චෙතසා එකං දිසං ඵරිත්වා විහාසි. තථා දුතියං, තථා තතියං, තථා චතුත්ථං, ඉති උද්ධධොම තිරියං සබ්බධි සබ්බත්තතාය සබ්බාවන්තං ලොකං උපෙක්ඛාසහගතෙන චෙතසා විපුලෙන මහග්ගතෙන අප්පමාණෙන අවෙරෙන අබ්යාපජ්ජෙන ඵරිත්වා විහාසි."
            },
            {
                "type": "page-break",
                "text": "290"
            },
            {
                "type": "centered",
                "text": "නගරාදීනි",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "24. රඤ්ඤො ආනන්ද, මහාසුදස්සනස්ස චතුරාසීති නගරසහස්සානි අහෙසුං කුසාවතීරාජධානිපමුඛානි, චතුරාසීතිපාසාදසහස්සානි අහෙසුං ධම්මපාසාදපමුඛානි, චතුරාසීතිකූටාගාරසහස්සානි අහෙසුං මහාවියූහකූටාගාරපමුඛානි."
            },
            {
                "type": "paragraph",
                "text": "චතුරාසීතිපල්ලඞ්කසහස්සානි අහෙසුං සොවණ්ණමයානි රූපියමයානි දන්තමයානි සාරමයානි ගොණකත්ථිතානි පටිකත්ථතානි පටලිකත්ථතානි කදලිමිගපවරපච්චත්ථරණානි සඋත්තරච්ඡදානි උභතොලොහිතකූපධානානි. චතුරාසීතිනාගසහස්සානි අහෙසුං සොවණ්ණාලඞ්කාරානි සොවණ්ණධජානි හෙමජාලපටිච්ඡන්නානි උපොසථනාගරාජපමුඛානි, චතුරාසීතිඅස්සසහස්සානි අහෙසුං සොවණ්ණාලඞ්කාරානි සොවණ්ණධජානි හෙමජාලපටිච්ඡන්නානි වලාහකඅස්සරාජපමුඛානි, චතුරාසීතිරථසහස්සානි අහෙසුං සීහචම්මපරිවාරානි බ්යග්ඝචම්මපරිවාරානි දීපිචම්මපරිවාරානි පණ්ඩුකම්බලපරිවාරානි සොවණ්ණාලඞ්කාරානි සොවණ්ණධජානි හෙමජාලපටිච්ඡන්නානි වෙජයන්තරථපමුඛානි, චතුරාසීතිමණිසහස්සානි අහෙසුං මණිරතනපමුඛානි, චතුරාසීතිඉත්ථිසහස්සානි අහෙසුං සුභද්දාදෙවිපමුඛානි, චතුරාසීතිගහපතිසහස්සානි අහෙසුං ගහපතිරතනපමුඛානි, චතුරාසීතිඛත්තියසහස්සානි අහෙසුං අනුයන්තානි පරිනායකරතනපමුඛානි, චතුරාසීතිධෙනුසහස්සානි අහෙසුං ධුවසන්දනානි{1 දුහසන්දනානි - මඡසං} කංසූපධාරණානි, චතුරාසීතිවත්ථකොටිසහස්සානි අහෙසුං ඛොමසුඛුමානං කප්පාසිකසුඛුමානං කොසෙය්යසුඛුමානං කම්බලසුඛුමානං. රඤ්ඤො ආනන්ද, මහාසුදස්සනස්ස චතුරාසීතිථාලිපාකසහස්සානි සායං පාතං භත්තාභිහාරො අභිහරියිත්ථ."
            },
            {
                "type": "paragraph",
                "text": "25. තෙන ඛො පනානන්ද, සමයෙන රඤ්ඤො මහාසුදස්සනස්ස චතුරාසීති නාගසහස්සානි සායං පාතං උපට්ඨානං ගච්ඡන්ති. අථ ඛො ආනන්ද, රඤ්ඤො මහාසුදස්සනස්ස එතදහොසි: ඉමානි ඛො මෙ චතුරාසීති නාගසහස්සානි සායං පාතං උපට්ඨානං ආගච්ඡන්ති. යන්නූන වස්සසතස්ස වස්සසතස්ස අච්චයෙන ද්වෙචත්තාරීසං නාගසහස්සානි ද්වචත්තාරීසං නාගසහස්සානි සකිං සකිං උපට්ඨානං ආගච්ඡෙය්යුන්ති. අථ ඛො ආනන්ද, රාජා මහාසුදස්සනො පරිණායකරතනං ආමන්තෙසි, ‘ඉමානි ඛො මෙ සම්ම පරිණායකරතන චතුරාසීතිනාගසහස්සානි සායං පාතං උපට්ඨානං ආගච්ඡන්ති, තෙන හි සම්ම පරිණායකරතන වස්සසතස්ස වස්සසතස්ස අච්චයෙන ද්වෙචත්තාරීසං නාගසහස්සානි ද්වෙචත්තාරීසං නාගසහස්සානි සකිං සකිං උපට්ඨානං ආගච්ඡන්තූ’ති. ‘එවං දෙවා’ති ඛො ආනන්ද, පරිණායකරතනං රඤ්ඤො මහාසුදස්සනස්ස පච්චස්සොසි. අථ ඛො ආනන්ද, රඤ්ඤො මහාසුදස්සනස්ස අපරෙන සමයෙන වස්සසතස්ස වස්සසතස්ස අච්චයෙන ද්වෙචත්තාරීසං නාගසහස්සානි සකිං සකිං උපට්ඨානං ආගමංසු."
            },
            {
                "type": "page-break",
                "text": "292"
            },
            {
                "type": "centered",
                "text": "සුභද්දා යූපසඞ්කමනං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "26. අථ ඛො ආනන්ද, සුභද්දාය දෙවියා බහුන්නං වස්සානං බහුන්නං වස්සසහස්සානං අච්චයෙන එතදහොසි: චිරදිට්ඨො ඛො මෙ රාජා මහාසුදස්සනො. යන්නූනාහං රාජානං මහාසුදස්සනං දස්සනාය උපසඞ්කමෙය්යන්ති. අථ ඛො ආනන්ද, සුභද්දා දෙවී ඉත්ථාගාරං ආමන්තෙසි, “එථ තුම්හෙ සීසානි නහායථ, පීතානි වත්ථානි පාරුපථ, චිරදිට්ඨො නො රාජා මහාසුදස්සනො. රාජානං මහාසුදස්සනං දස්සනාය උපසඞ්කමිස්සාමා’ති. එවං අෙය්ය’ති ඛො ආනන්ද, ඉත්ථාගාරං සුභද්දාය දෙවියා පටිස්සුත්වා සීසානි නහායිත්වා පීතානි වත්ථානි පාරුපිත්වා යෙන සුභද්දා දෙවී තෙනුපසඞ්කමි. අථ ඛො ආනන්ද, සුභද්දා දෙවී පරිනායකරතනං ආමන්තෙසි: “කප්පෙහි සම්ම පරිණායකරතන චතුරඞ්ගිනිං සෙනං, චිරදිට්ඨො නො රාජා මහාසුදස්සනො, රාජානං මහාසුදස්සනං දස්සනාය උපසඞ්කමිස්සාමා”ති. ‘එවං දෙවී’ති ඛො ආනන්ද, පරිනායකරතනං සුභද්දාය දෙවියා පටිස්සුත්වා චතුරඞ්ගිනිං සෙනං කප්පාපෙත්වා සුභද්දාය දෙවියා පටිවෙදෙසි. ‘කප්පිතා ඛො දෙවි චතුරඞ්ගිනී සෙනා, යස්ස’දානි කාලං මඤ්ඤසී’ති. අථ ඛො ආනන්ද, සුභද්දා දෙවී චතුරඞ්ගිනියා සෙනාය සද්ධිං ඉත්ථාගාරෙන යෙන ධම්මො පාසාදො තෙනුපසඞ්කමි, උපසඞ්කමිත්වා ධම්මං පාසාදං අභිරුහිත්වා යෙන මහාවියූහං කූටාගාරං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා මහාවියූහස්ස කූටාගාරස්ස ද්වාරබාහං ආලම්බිත්වා අට්ඨාසි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආනන්ද, රාජා මහාසුදස්සනො සද්දං සුත්වා කින්නු ඛො මහතො විය ජනකායස්ස සද්දොති, මහාවියූහකූටාගාරා නික්ඛමන්තො අද්දස සුභද්දං දෙවිං ද්වාරබාහං ආලම්බිත්වා ඨිතං, දිස්වාන සුභද්දං දෙවිං එතදවොච: ‘එත්ථෙව දෙවී තිට්ඨ මා පාවිසී’ති. අථ ඛො ආනන්ද, රාජා මහාසුදස්සනො අඤ්ඤතරං පුරිසං ආමන්තෙසි: ‘එහි ත්වං අම්භො පුරිස, මහාවියූහා කූටාගාරා සොවණ්ණමයං පල්ලඞ්කං නීහරිත්වා සබ්බසොවණ්ණමයෙ තාලවනෙ පඤ්ඤපෙහී’ති. ‘එවං දෙවා’ති ඛො ආනන්ද, සො පුරිසො රඤ්ඤො මහාසුදස්සනස්ස පටිස්සුත්වා මහාවියූහා කූටාගාරා සොවණ්ණමයං පල්ලඞ්කං නීහරිත්වා සබ්බසොවණ්ණමයෙ තාලවනෙ පඤ්ඤපෙසි. අථ ඛො ආනන්ද, රාජා මහාසුදස්සනො දක්ඛිණෙන පස්සෙන සීහසෙය්යං කප්පෙසි පාදෙ පාදං අච්චාධාය සතො සම්පජානො."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආනන්ද, සුභද්දාය දෙවියා එතදහොසි: විප්පසන්නානි ඛො රඤ්ඤො මහාසුදස්සනස්ස ඉන්ද්රියානි පරිසුද්ධො ඡවිවණ්ණො පරියොදාතො, මා හෙව ඛො රාජා මහාසුදස්සනො කාලමකාසීති. රාජානං මහාසුදස්සනං එතදවොච: ඉමානි ඛො තෙ දෙව චතුරාසීතිනගරසහස්සානි කුසාවතීරාජධානිපමුඛානි. එත්ථ දෙව, ඡන්දං ජනෙහි ජීවිතෙ අපෙක්ඛං කරොහි ඉමානි තෙ දෙව චතුරාසීතිපාසාදසහස්සානි ධම්මපාසාදපමුඛානි, එත්ථ ඡන්දං ජනෙහි"
            },
            {
                "type": "page-break",
                "text": "294"
            },
            {
                "type": "paragraph",
                "text": "ජීවිතෙ අපෙක්ඛං කරොහි. ඉමානි තෙ දෙව චතුරාසීතිකූටාගාරසහස්සානි මහාවියූහකූටාගාරප්පමුඛානි. එත්ථ දෙව ඡන්දං ජනෙහි ජීවිතෙ අපෙක්ඛං කරොහි. ඉමානි තෙ දෙව, චතුරාසීතිපල්ලඞ්කසහස්සානි සොවණ්ණමයානි රූපියමයානි දන්තමයානි සාරමයානි ගොණකත්ථතානි පටිකත්ථතානි පටලිකත්ථතානි කදලිමිගපවරපච්චත්ථරණානි සඋත්තරච්ඡදානි උභතොලොහිතකූපධානානි. එත්ථ දෙව, ඡන්දං ජනෙහි ජීවිතෙ අපෙක්ඛං කරොහි. ඉමානි තෙ දෙව, චතුරාසීතිනාගසහස්සානි සොවණ්ණාලඞ්කාරානි සොවණ්ණධජානි හෙමජාලපටිච්ඡන්නානි උපොසථනාගරාජප්පමුඛානි. එත්ථ දෙව, ඡන්දං ජනෙහි ජීවිතෙ අපෙක්ඛං කරොහි. ඉමානි තෙ දෙව, චතුරාසීතිඅස්සසහස්සානි සොවණ්ණාලඞ්කාරානි සොවණ්ණධජානි හෙමජාලපටිච්ඡන්නානි වලාහකඅස්සරාජපමුඛානි. එත්ථ දෙව, ඡන්දං ජනෙහි ජීවිතෙ අපෙක්ඛං කරොහි. ඉමානි තෙ දෙව, චතුරාසීතිරථසහස්සානි සීහචම්මපරිවාරානි ඛ්යග්ඝචම්මපරිවාරානි දීපිචම්මපරිවාරානි පණ්ඩුකම්බලපරිවාරානි සොවණ්ණාලඞ්කාරානි සොවණ්ණධජානි හෙමජාලපටිච්ඡන්නානි වෙජයන්තරථප්පමුඛානි.{1 වෙජයන්තරථපමුඛානි (බහූසු) අඤ්ඤෙසු ඊදියෙසු ඨානෙසු පකාරස්ස දමිත්තං දිස්සතෙ.} එත්ථ දෙව, ඡන්දං ජනෙහි ජීවිතෙ අපෙක්ඛං කරොහි. ඉමානි තෙ දෙව, චතුරාසීතිමණිසහස්සානි මණිරතනප්පමුඛානි. එත්ථ දෙව, ඡන්දං ජනෙහි ජීවිතෙ අපෙක්ඛං කරොහි. ඉමානි තෙ දෙව, චතුරාසීතිඉත්ථිසහස්සානි ඉත්ථිරතනප්පමුඛානි. එත්ථ දෙව, ඡන්දං ජනෙහි ජීවිතෙ අපෙක්ඛං කරොහි. ඉමානි තෙ දෙව, චතුරාසීතිගහපතිසහස්සානි ගහපතිරතනප්පමුඛානි. එත්ථ දෙව, ඡන්දං ජනෙහි ජීවිතෙ අපෙක්ඛං කරොහි. ඉමානි තෙ දෙව, චතුරාසීතිඛත්තියසහස්සානි අනුයන්තානි පරිණායකරතනප්පමුඛානි. එත්ථ දෙව, ඡන්දං ජනෙහි ජීවිතෙ අපෙක්ඛං කරොහි. ඉමානි තෙ දෙව, චතුරාසීතිධෙනුසහස්සානි ධුවසන්දනානි කංසූපධාරණානි. එත්ථ දෙව, ඡන්දං ජනෙහි ජීවිතෙ අපෙක්ඛං කරොහි. ඉමානි තෙ දෙව, චතුරාසීතිවත්ථකොටිසහස්සානි ඛොමසුඛුමානං කප්පාසිකසුඛුමානං කොසෙය්යසුඛුමානං කම්බලසුඛුමානං. එත්ථ දෙව, ඡන්දං ජනෙහි, ජීවිතෙ අපෙක්ඛං කරොහි. ඉමානි තෙ දෙව, චතුරාසීතිථාලිපාකසහස්සානි සායං පාතං භත්තාභිහාරො අභිහරියති. එත්ථ දෙව, ඡන්දං ජනෙහි ජීවිතෙ අපෙක්ඛං කරොහී’ති."
            },
            {
                "type": "page-break",
                "text": "296"
            },
            {
                "type": "paragraph",
                "text": "27. එවං වුත්තෙ ආනන්ද, රාජා මහාසුදස්සනො සුභද්දං දෙවිං එතදවොච: දීඝරත්තං ඛො මං ත්වං දෙවි ඉට්ඨෙහි කන්තෙහි පියෙහි මනාපෙහි සමුදාචරිත්ථ, අථ ච පන මං ත්වං පච්ඡිමෙ කාලෙ අනිට්ඨෙහි අකන්තෙහි අප්පියෙහි අමනාපෙහි සමුදාචරසී”ති. “කථඤ්චරහි තං දෙව සමුදාචරාමී”ති. “එවං ඛො මං ත්වං දෙවි, සමුදාචර: සබ්බෙහෙව දෙව, පියෙහි මනාපෙහි නානාභාවො විනාභාවො අඤ්ඤථාභාවො. මා ඛො ත්වං දෙව සාපෙක්ඛො කාලමකාසි, දුක්ඛා සාපෙක්ඛස්ස කාලකිරියා, ගරහිතා ච සාපෙක්ඛස්ස කාලකිරියා. ඉමානි තෙ දෙව, චතුරාසීතිනගරසහස්සානි කුසාවතීරාජධානිප්පමුඛානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව චතුරාසීතිපාසාදසහස්සානි ධම්මපාසාදප්පමුඛානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව චතුරාසීතිකූටාගාරසහස්සානි මහාවියූහකූටාගාරප්පමුඛානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව චතුරාසීතිපල්ලඞ්කසහස්සානි සොවණ්ණමයානි රූපියමයානි දන්තමයානි සාරමයානි ගොණකත්ථතානි පටිකත්ථතානි පටලිකත්ථතානි කදලිමිගපවරපච්චත්ථරණානි සඋත්තරච්ඡදානි උභතොලොහිතකූපධානානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව, චතුරාසීතිනාගසහස්සානි සොවණ්ණාලඞ්කාරානි සොවණ්ණධජානි හෙමජාලපටිච්ඡන්නානි උපොසථනාගරාජප්පමුඛානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව, චතුරාසීතිඅස්සසහස්සානි සොවණ්ණාලඞ්කාරානි සොවණ්ණධජානි හෙමජාලපටිච්ඡන්නානි වලාහකඅස්සරාජප්පමුඛානි. එත්ථ දෙව, ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව, චතුරාසීතිරථසහස්සානි සීහචම්මපරිවාරානි බ්යග්ඝචම්මපරිවාරානි දීපිචම්මපරිවාරානි පණ්ඩුකම්බලපරිවාරානි සොවණ්ණාලඞ්කාරානි සොවණ්ණධජානි හෙමජාලපටිච්ඡන්නානි, වෙජයන්තරථප්පමුඛානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව, චතුරාසීතිමණිසහස්සානි මණිරතනප්පමුඛානි. එත්ථ දෙව, ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව, චතුරාසීතිඉත්ථිසහස්සානි සුභද්දාදෙවිපමුඛානි. එත්ථ දෙව, ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව, චතුරාසීතිගහපතිසහස්සානි ගහපතිරතනප්පමුඛානි. එත්ථ දෙව, ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව, චතුරාසීතිඛත්තියසහස්සානි අනුයන්තානි පරිණායකරතනප්පමුඛානි. එත්ථ දෙව, ඡන්දං පජහ ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව, චතුරාසීතිධෙනුසහස්සානි ධුවසන්දනානි කංසූපධාරණානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව, චතුරාසීතිවත්ථකොටිසහස්සානි ඛොමසුඛුමානං කප්පාසිකසුඛුමානං කොසෙය්යසුඛුමානං කම්බලසුඛුමානං. එත්ථ දෙව ඡන්දං පජහ ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව චතුරාසීතිථාලිපාකසහස්සානි සායං පාතං භත්තාභිහාරො අභිහරියති. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසී’ති."
            },
            {
                "type": "page-break",
                "text": "298"
            },
            {
                "type": "paragraph",
                "text": "28. එවං වුත්තෙ ආනන්ද, සුභද්දා දෙවී පරොදි අස්සූනි පවත්තෙසි. අථ ඛො ආනන්ද, සුභද්දාදෙවී අස්සූනි පමජ්ජිත්වා රාජානං මහාසුදස්සනං එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "සබ්බෙහෙව දෙව පියෙහි මනාපෙහි නානාභාවො විනාභාවො අඤ්ඤථාභාවො, මා ඛො ත්වං දෙව සාපෙක්ඛො කාලමකාසි, දුක්ඛා සාපෙක්ඛස්ස කාලකිරියා, ගරහිතා ච සාපෙක්ඛස්ස කාලකිරියා. ඉමානි තෙ දෙව චතුරාසීතිනගරසහස්සානි කුසාවතීරාජධානිප්පමුඛානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව චතුරාසීතිපාසාදසහස්සානි ධම්මපාසාදප්පමුඛානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව චතුරාසීතිකූටාගාරසහස්සානි මහාවියූහකූටාගාරප්පමුඛානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව චතුරාසීතිපල්ලඞ්කසහස්සානි සොවණ්ණමයානි රූපියමයානි දන්තමයානි සාරමයානි ගොණකත්ථතානි පටිකත්ථතානි පටලිකත්ථතානි කදලිමිගපවරපච්චත්ථරණානි සඋත්තරච්ඡදානි උභතොලොහිතකූපධානානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව චතුරාසීතිනාගසහස්සානි සොවණ්ණාලඞ්කාරානි සොවණ්ණධජානි හෙමජාලපටිච්ඡන්නානි උපොසථනාගරාජප්පමුඛානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව චතුරාසීතිඅස්සසහස්සානි සොවණ්ණාලඞ්කාරානි සොවණ්ණධජානි හෙමජාලපටිච්ඡන්නානි වලාහකඅස්සරාජප්පමුඛානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව චතුරාසීතිරථසහස්සානි සීහචම්මපරිවාරානි බ්යග්ඝචම්මපරිවාරානි දීපිචම්මපරිවාරානි පණ්ඩුකම්බලපරිවාරානි සොවණ්ණාලඞ්කාරානි සොවණ්ණධජානි හෙමජාලපටිච්ඡන්නානි වෙජයන්තරථපමුඛානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව චතුරාසීතිමණිසහස්සානි මණිරතනප්පමුඛානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව චතුරාසීතිඉත්ථිසහස්සානි ඉත්ථිරතනප්පමුඛානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව චතුරාසීතිගහපතිසහස්සානි ගහපතිරතනප්පමුඛානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව චතුරාසීතිඛත්තියසහස්සානි අනුයන්තානි පරිණායකරතනප්පමුඛානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව චතුරාසීතිධෙනුසහස්සානි ධුවසන්දනානි කංසූපධාරණානි. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව චතුරාසීතිවත්ථකොටිසහස්සානි ඛොමසුඛුමානං කප්පාසිකසුඛුමානං කොසෙය්යසුඛුමානං කම්බලසුඛුමානං. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසි. ඉමානි තෙ දෙව චතුරාසීතිථාලිපාකසහස්සානි සායං පාතං භත්තාභිහාරො අභිහරීයති. එත්ථ දෙව ඡන්දං පජහ, ජීවිතෙ අපෙක්ඛං මාකාසීති."
            },
            {
                "type": "page-break",
                "text": "300"
            },
            {
                "type": "centered",
                "text": "බ්රහ්මලොකූපගමනං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "29. අථ ඛො ආනන්ද, රාජා මහාසුදස්සනො න චිරස්සෙව කාලමකාසි. සෙය්යථාපි ආනන්ද, ගහපතිස්ස වා ගහපතිපුත්තස්ස වා මනුඤ්ඤං භොජනං භුත්තාවිස්ස භත්තසම්මදො හොති, එවමෙව ඛො ආනන්ද, රඤ්ඤො මහාසුදස්සනස්ස මාරණන්තිකා වෙදනා අහොසි. කාලකතො චානන්ද, රාජා මහාසුදස්සනො සුගතිං බ්රහ්මලොකං උපපජ්ජි. රාජා ආනන්ද, මහාසුදස්සනො චතුරාසීතිවස්සසහස්සානි කුමාරකීළිතං{1 කුමාරකීළං - මඡසං.} කීළි. චතුරාසීතිවස්සසහස්සානි ඔපරජ්ජං කාරෙසි. චතුරාසීතිවස්සසහස්සානි රජ්ජං කාරෙසි. චතුරාසීතිවස්සසහස්සානි ගිහීභූතො{2 ගිහිභූතො - මඡසං.} ධම්මෙ පාසාදෙ බ්රහ්මචරියං චරි.{3 බ්රහ්මචරියමචරී - කං.} සො චත්තාරො බ්රහ්මවිහාරෙ භාවෙත්වා කායස්ස භෙදා පරම්මරණා බ්රහ්මලොකූපගො අහොසි."
            },
            {
                "type": "paragraph",
                "text": "30. සියා ඛො පනානන්ද, එවමස්ස අඤ්ඤො නූන තෙන සමයෙන රාජා මහාසුදස්සනො අහොසීති. න ඛො පනෙතං ආනන්ද, එවං දට්ඨබ්බං. අහං තෙන සමයෙන රාජා මහාසුදස්සනො අහොසිං. මම තානි චතුරාසීතිනගරසහස්සානි කුසාවතීරාජධානිපමුඛානි, මම තානි චතුරාසීතිපාසාදසහස්සානි ධම්මපාසාදප්පමුඛානි, මම තානි චතුරාසීතිකූටාගාරසහස්සානි මහාවියූහකූටාගාරප්පමුඛානි, මම තානි චතුරාසීතිපල්ලඞ්කසහස්සානි සොවණ්ණමයානි රූපියමයානි දන්තමයානි සාරමයානි ගොණකත්ථතානි පටිකත්ථතානි පටලිකත්ථතානි කාදලිමිගපවරපච්චත්ථරණානි සඋත්තරච්ඡදානි උභතොලොහිතකූපධානානි, මම තානි චතුරාසීතිනාගසහස්සානි සොවණ්ණාලඞ්කාරානි සොවණ්ණධජානි හෙමජාලපටිච්ඡන්නානි උපොසථනාගරාජපමුඛානි, මම තානි චතුරාසීතිඅස්සසහස්සානි සොවණ්ණාලඞ්කාරානි සොවණ්ණධජානි හෙමජාලපටිච්ඡන්නානි වලාහකඅස්සරාජපමුඛානි, මම තානි චතුරාසීතිරථසහස්සානි සීහචම්මපරිවාරානි බ්යග්ඝචම්මපරිවාරානි දීපිචම්මපරිවාරානි පණ්ඩුකම්බලපරිවාරානි සොවණ්ණාලඞ්කාරානි සොවණ්ණධජානි හෙමජාලපටිච්ඡන්නානි වෙජයන්තරථපමුඛානි, මම තානි චතුරාසීතිමණිසහස්සානි මණිරතනප්පමුඛානි, මම තානි චතුරාසීතිඉත්ථිසහස්සානි සුභද්දාදෙවිප්පමුඛානි, මම තානි චතුරාසීතිගහපතිසහස්සානි ගහපතිරතනප්පමුඛානි, මම තානි චතුරාසීතිඛත්තියසහස්සානි අනුයන්තානි පරිනායකරතනපමුඛානි, මම තානි චතුරාසීතිධෙනුසහස්සානි ධුවසන්දනානි කංසූපධාරණානි, මම තානි චතුරාසීතිවත්ථකොටිසහස්සානි ඛොමසුඛුමානං කප්පාසිකසුඛුමානං කොසෙය්යසුඛුමානං කම්බලසුඛුමානං, මම තානි චතුරාසීතිථාලිපාකසහස්සානි සායං පාතං භත්තාභිහාරො අභිහරීයිත්ථ."
            },
            {
                "type": "page-break",
                "text": "302"
            },
            {
                "type": "paragraph",
                "text": "31. තෙසං ඛො පනානන්ද, චතුරාසීතිනගරසහස්සානං එකඤ්ඤෙව තං නගරං හොති, යං තෙන සමයෙන අජ්ඣාවසාමි යදිදං කුසාවතී රාජධානී."
            },
            {
                "type": "paragraph",
                "text": "තෙසං ඛො පනානන්ද, චතුරාසීතිපාසාදසහස්සානං එකොයෙව සො පාසාදො හොති, යන්තෙන සමයෙන අජ්ඣාවසාමි යදිදං ධම්මො පාසාදො."
            },
            {
                "type": "paragraph",
                "text": "තෙසං ඛො පනානන්ද, චතුරාසීතිකූටාගාරසහස්සානං එකඤ්ඤෙව තං කූටාගාරං හොති, යන්තෙන සමයෙන අජ්ඣාවසාමි යදිදං මහාවියූහං කූටාගාරං."
            },
            {
                "type": "paragraph",
                "text": "තෙසං ඛො පනානන්ද, චතුරාසීතිපල්ලඞ්කසහස්සානං එකො යෙව සො පල්ලඞ්කො හොති, යන්තෙන සමයෙන පරිභුඤ්ජාමි යදිදං සොවණ්ණමයො වා රූපියමයො වා දන්තමයො වා සාරමයො වා."
            },
            {
                "type": "paragraph",
                "text": "තෙසං ඛො පනානන්ද, චතුරාසීතිනාගසහස්සානං එකො යෙව සො නාගො හොති, යන්තෙන සමයෙන අභිරුහාමි යදිදං උපොසථො නාගරාජා."
            },
            {
                "type": "paragraph",
                "text": "තෙසං ඛො පනානන්ද, චතුරාසීතිඅස්සසහස්සානං එකො යෙව සො අස්සො හොති, යන්තෙන සමයෙන අභිරුහාමි යදිදං වලාහකො අස්සරාජා."
            },
            {
                "type": "paragraph",
                "text": "තෙසං ඛො පනානන්ද, චතුරාසීතිරථසහස්සානං එකො යෙව සො රථො හොති, යන්තෙන සමයෙන අභිරුහාමි යදිදං වෙජයන්තරථො."
            },
            {
                "type": "paragraph",
                "text": "තෙසං ඛො පනානන්ද, චතුරාසීතිඉත්ථිසහස්සානං එකායෙව සා ඉත්ථී හොති, යා තෙන සමයෙන පච්චුපට්ඨාහි. ඛත්තියිනී වා වෙස්සිනී{1 ඛත්තියානි - මඡසං.} වා."
            },
            {
                "type": "paragraph",
                "text": "තෙසං ඛො පනානන්ද, චතුරාසීතිවත්ථකොටිසහස්සානං එකං යෙව තං දුස්සයුගං හොති, යන්තෙන සමයෙන පරිදහාමි ඛොමසුඛුමං වා කප්පාසිකසුඛුමං වා කොසෙය්යසුඛුමං වා කම්බලසුඛුමං වා."
            },
            {
                "type": "paragraph",
                "text": "තෙසං ඛො පනානන්ද, චතුරාසීතිථාලිපාකසහස්සානං එකො යෙව සො ථාලිපාකො හොති, යතො නාලිකොදනපරමං භුඤ්ජාමි තදුපියඤ්ච සූපෙය්යං."
            },
            {
                "type": "page-break",
                "text": "304"
            },
            {
                "type": "paragraph",
                "text": "32. පස්සානන්ද, සබ්බෙතෙ සඞ්ඛාරා අතීතා නිරුද්ධා විපරිණතා. එවං අනිච්චා ඛො ආනන්ද, සඞ්ඛාරා, එවං අද්ධුවා ඛො ආනන්ද, සඞ්ඛාරා. එවං අනස්සාසිකා ඛො ආනන්ද, සඞ්ඛාරා. යාවඤ්චිදං ආනන්ද, අලමෙව සබ්බසඞ්ඛාරෙසු නිබ්බින්දිතුං, අලං විරජ්ජිතුං, අලං විමුච්චිතුං. ඡක්ඛත්තුං ඛො පනාහං ආනන්ද, අභිජානාමි ඉමස්මිං පදෙසෙ සරීරං නික්ඛිපිතා, තඤ්ච ඛො රාජා’ව සමානො චක්කවත්තී ධම්මිකො ධම්මරාජා චාතුරන්තො විජිතාවී ජනපදත්ථාවරියප්පත්තො සත්තරතනසමන්නාගතො. අයං සත්තමො සරීරනික්ඛෙපො. න ඛො පනාහං ආනන්ද, තං පදෙසං සමනුපස්සාමි සදෙවකෙ ලොකෙ සමාරකෙ සබ්රහ්මකෙ සස්සමණබ්රාහ්මණියා පජාය සදෙවමනුස්සාය යත්ථ තථාගතො අට්ඨමං සරීරං නික්ඛිපෙය්යාති."
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච භගවා. ඉදං වත්වා සුගතො අථාපරං එතදවොච සත්ථා:"
            },
            {
                "type": "gatha",
                "text": "අනිච්චා වත සඞ්ඛාරා උප්පාදවයධම්මිනො,\nඋප්පජ්ජිත්වා නිරුජ්ඣන්ති තෙසං වූපසමො සුඛො’ති."
            },
            {
                "type": "centered",
                "text": "මහාසුදස්සනසුත්තං නිට්ඨිතං චතුත්ථං.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "pages": {
            "266": {
                "pageNum": 266,
                "footnotesCount": 1
            },
            "268": {
                "pageNum": 268,
                "footnotesCount": 2
            },
            "270": {
                "pageNum": 270,
                "footnotesCount": 4
            },
            "272": {
                "pageNum": 272,
                "footnotesCount": 0
            },
            "274": {
                "pageNum": 274,
                "footnotesCount": 2
            },
            "276": {
                "pageNum": 276,
                "footnotesCount": 1
            },
            "278": {
                "pageNum": 278,
                "footnotesCount": 1
            },
            "280": {
                "pageNum": 280,
                "footnotesCount": 1
            },
            "282": {
                "pageNum": 282,
                "footnotesCount": 1
            },
            "284": {
                "pageNum": 284,
                "footnotesCount": 3
            },
            "286": {
                "pageNum": 286,
                "footnotesCount": 1
            },
            "288": {
                "pageNum": 288,
                "footnotesCount": 0
            },
            "290": {
                "pageNum": 290,
                "footnotesCount": 1
            },
            "292": {
                "pageNum": 292,
                "footnotesCount": 0
            },
            "294": {
                "pageNum": 294,
                "footnotesCount": 1
            },
            "296": {
                "pageNum": 296,
                "footnotesCount": 0
            },
            "298": {
                "pageNum": 298,
                "footnotesCount": 0
            },
            "300": {
                "pageNum": 300,
                "footnotesCount": 3
            },
            "302": {
                "pageNum": 302,
                "footnotesCount": 1
            },
            "304": {
                "pageNum": 304,
                "footnotesCount": 0
            }
        }
    },
    {
        "filename": "1-9-10-43-66",
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "267"
            },
            {
                "type": "centered",
                "text": "4.",
                "level": 3
            },
            {
                "type": "heading",
                "text": "මහාසුදස්සන සූත්‍රය",
                "level": 3
            },
            {
                "format": 13,
                "text": "1. මා විසින් මෙසේ අසන ලදී: එක් කලෙක පිරිනිවන් සමයෙහි භාග්‍යවතුන් වහන්සේ කුසිනාරා නුවර සමීපයෙහි වූ මල්ල රජුන්ගේ උපවර්තන නම් සල් වෙනෙහි යමා සල්රුක් අතරැ වැඩ වසන සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එ කල්හි අනඳ තෙරණුවෝ භාග්‍යවතුන් වහන්සේ කරා එළැඹුණහ. එළඹැ ඔබ සාදර වැ වැඳ එක් පසෙක උන්හ. එක් පසෙක හුන්නාවූ ම අනඳ තෙරණුවෝ, “වහන්ස, භාග්‍යවතුන් වහන්සේ ගල් සෙල් ඈයෙන් විසම වූ ශාඛා නගරයක් වූ මේ කුඩා නුවර දී නො පිරිනිවෙන සේක් වා. වහන්ස, චම්පා රාජගෘහ ශ්‍රාවස්ති සාකේත කෞශාම්බි වාරාණසී යන අන් මහ නුවරවල් ඇත. මේ නුවරෙක භාග්‍යවතුන් වහන්සේ පිරිනිවෙන සේක් වා. මේ නුවරවල තථාගතයන් වහන්සේ කෙරෙහි වෙසෙසින් පැහැදුණු බොහෝ කැත් මහසල්හු, බමුණු මහසල්හු, ගැහැවි මහසල්හු ඇත. ඔහු තථාගතයන් වහන්සේගේ සිරුරට පූජා කරන්නාහ” යි භාග්‍යවතුන් වහන්සේට සැළ කළාහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "2. “අනඳයෙනි, කුඩා නුවරෙකැ යි ගල් සෙල් ඈයින් විසම නුවරෙකැ යි අතු නුවරෙකැ යි මෙසේ නොකිය වු” (යැයි වදාරා මතු දැක්වෙන ඉකුත් වත් වදාළ සේක:)",
                "type": "paragraph"
            },
            {
                "format": 21,
                "text": "කුශාවතී රාජධානිය",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "“පෙරැ වූවක් කියමි. අනඳයෙනි, (පෙරැ) හිසැ අබිසෙස් ලද, සයුර හිම් කොට සතර මහදිවයිනට අදිපති වූ, පසමිතුරන් දිනු, දනවුහි තහවුරු බවට පැමිණි, සත්රුවනින් සමන්වාගත වූ මහසුදසුන් නම් කැත් රජෙක් විය. අනඳයෙනි, මේ කුසිනාරාව මහසුදසුන් රජුගේ කුශාවතී නම් රජදහන විය. අනඳයෙනි, ඒ කුශාවතී රජදහන පෙරැ දෙසින් ද පැසිම් දෙසින් ද දිගින් දොළොස් යොදුන් විය, උතුරු දෙසින් ද දකුණු දෙසින් ද පුලුලින් සත් යොදුන් විය. අනඳයෙනි, කුශාවතී රජදහන සමෘද්ධ ද හැම සැපතින් පිරුණේ ද, බොහෝ ජනයන් ඇත්තේ, මිනිසුන්ගෙන් ගැවැසුණේ ද, සුභික්ෂ ද විය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "269"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, දෙවියන්ගේ ආලකමන්දා නම් රාජධානිය යම්සේ සමෘද්ධත් හැම සැපතින් පිරුණේත් බොහෝ ජනයන් ඇත්තේත් යකුන්ගෙන් ගැවැසුණේත් සුභික්ෂත් වේ ද, එසේ ම අනඳයෙනි, කුශාවතී රාජධානිය සමෘද්ධ ද, සියලු සැපතින් පිරුණේ ද, බොහෝ ජනයන් ඇත්තේ ද, මිනිසුන්ගෙන් ගැවැසුණේ ද, සුභික්ෂ ද විය. අනඳයෙනි, කුශාවතී රාජධානිය රෑ ද දහවල් ද ඇත් හඬින් ද අස් හඬින් ද රිය හඬින් ද බෙර හඬින් ද මිහිඟුබෙර හඬින් ද වෙණ හඬින් ද ගී හඬින් ද (යහළුව යහළු වැ යි කැඳවන) පිය බස් හඬින් ද කස්තලු ආදියේ හඬින් ද ‘වළඳවු, කවු, බොවු’ යන දස වැනි හඩින් දැ යි දස හඩින් නොසිස් විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "3. අනඳයෙනි, කුශාවතී රාජධානිය සත් පවුරෙකින් පිරිකෙවුණේ විය. ඔවුන් අතුරෙන් එක් පවුරෙක් රන්මුවා විය, එකෙක් රිදීමුවා විය, එකෙක් වෙරළුමිණිමුවා විය, එකෙක් පළිඟුමුවා විය, එකෙක් රත්මිණිමුවා විය, එකෙක් මැසිරිගල්මුවා විය, එකෙක් සියල්රුවන්මුවා විය. අනඳයෙනි, කුශාවතී රාජධානියෙහි සතර වර්ණයන් සම්බන්ධ දොරවල් වූහ. එක් දොරෙක් රන්මුවා විය, එකෙක් රිදීමුවා විය, එකෙක් වෙරළුමිණිමුවා විය, එකෙක් පළිඟුමුවා විය. එක් එක් දොරෙහි පුරුෂප්‍රමාණ තුනක් (පසොළොස් රියනක්) වට වූ, පුරුෂ ප්‍රමාණ තුනක් (පසළොස් රියනක්) යට සිටුවන ලද, උසින් දොළොස් පුරුෂ ප්‍රමාණ (සැට රියන්) වූ සතෙක් සතෙක් ඉන්ද්‍රඛීලයෝ බිම කැන සිටුවන ලද්දාහු වූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, කුශාවතී රාජධානිය තල්රුක් සත් පෙලෙකින් පරික්ෂිප්ත විය. එක් තල්රුක් පෙලෙක් රන්මුවා විය, එකෙක් රිදීමුවා විය, එකෙක් වෙරළුමිණිමුවා විය, එකෙක් පළිඟුමුවා විය. එකෙක් රත්මිණිමුවා විය, එකෙක් මැසිරිගල්මුවා විය, එකෙක් සව්රුවන්මුවා විය. රන්මුවා තල් රුකැ කඳ රන් මුවා විය, කොළ ද පල ද රිදීමුවා වූහ, රිදීමුවා තල්රුකැ කඳ රිදීමුවා විය, කොළ ද පල ද රන්මුවා වූහ. වෙරළුමිණිමුවා තල්රුකැ කඳ වෙරළුමිණිමුවා විය, කොළ ද පල ද පළිඟුමුවා වූහ. පළිඟුමුවා තල්රුකැ කඳ පළිඟුමුවා විය. කොළ ද පල ද වෙරළුමිණිමුවා වූහ. රන්මිණිමුවා තල් රුකැ කඳ රත්මිණිමුවා විය, කොළ ද පල ද මැසිරිගල්මුවා වූහ. මැසිරිගල්මුවා තල්රුකැ කඳ මැසිරිගල්මුවා විය, කොළ ද පල ද මැසිරිගල්මුවා වූහ. සව්රුවන්මුවා තල්රුකැ කඳ සව්රුවන් මුවා විය. කොළ ද පල ද සව්රුවන්මුවා වූහ. අනඳයෙනි, සුළඟින් සැලුණු ඒ තාලවෘක්ෂ පංක්තීන්ගේ මිහිරි වූ ද සිත් අලවන්නාවූ ද කමනීය වූ ද සිත මත් කරන්නා වූ ද හඬෙක් විය. අනඳයෙනි, (ඇදීම් ලිහිල් කිරීම් ඈ විසින්) සුමුස්නා ලද මැදුම් පමණ ගන්වනු පිණිස මොනොවට පුන පුනා තළන ලද ඉතා සමත් වයුවන් විසින් වයන ලද පංචාඞ්ගික තූර්‍ය්‍යයාගේ යම්සේ මිහිරි වූ ද සිත් අලවන්නා වූ ද කමනීය වූ ද සිත මත් කරන්නා වූ ද හඬෙක් වේ ද, එසේ ම සුළඟින් සැලුණු ඒ තාලවෘක්ෂ පඞ්ක්තීන්ගේ ද මිහිරි වූ සිත් අදනා කමනීය වූ සිත් මත් කරන හඬෙක් විය. අනඳයෙනි එ සමයෙහි කුශාවතී රාජධානියෙහි සුරා සොඬ වූ, පුන පුනා සුරා බොනු රිසි යම් ධූර්ත කෙනෙක් වූහු ද, ඔහු සුළඟින් සැලුණු ඒ තල්රුක් පෙලවල හඩින් අත් පා සොලොවා නටමින් ක්‍රීඩා කළහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "271"
            },
            {
                "format": 21,
                "text": "සත්රුවන",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "4. අනඳයෙනි, මහසුදසුන් රජ සත් රුවනින් ද සතර ඉදුහයෙන් ද යුත් විය. කවර සත් රුවනෙකින් ද? යත්: අනඳයෙනි, ඒ පසොළොස් වක් පොහෝ ද (සුවඳදියෙන්) හිස් සෝදා නා සමාදන් වූ පෙහෙවස් ඇති ව මහඟු පහයැ මතු මහල්තලයට පැමිණි මහසුදසුන් රජුට දහසක් අර ඇති නිම්වලලු සහිත, නැබ මඬුලු සහිත, මෙසේ සියලු අයුරින් පිරිපුන් දෙව් සක් රුවන පහළ විය. එය දැක්මෙන් මහසුදසුන් රජහට මේ සිත විය, “පුණු පසළොස්වක් පොහො දිනැ ඉස් සෝ දා නා පෙහෙවස් සමාදන් කොට ගෙන පහයැ මතු මහල් තලයට පැමිණැ උන් මුදුනැ අබිසෙස් ලත් යම් කැත් රජක්හට දහසක් අර ඇති නිම්වළලු සහිත නැබ මඬුලු සහිත මෙසේ සියලු අයුරින් පිරිපුන් දෙව් සක්රුවන පහළ වන්නේ නම් ඔහු සක්විති රජු වෙති යි මෙය මා විසින් අසන ලද්දේ ම ය. මම් සක්විති වන්නෙම් දෝ?” යනු යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "5. අනඳයෙනි, ඉක්බිත්තෙන් මහ සුදසුන් රජ හුනස්නෙන් නැඟීසිට උතුරුසඟ එකස් කොට වමතින් කෙංඩිය ගෙන, ‘භවත් සක්රුවන, පෙරැළේ වා, භවත් සක් රුවන, සතර මහ දිවයින දිනා දේ වා’යි කියා දකුණතින් සක් රුවනට දිය ඉස්සේ ය. අනඳයෙනි, එ කල්හි එ සත්රුවන පෙර දිගට පෙරැළිණ. මහ සුදසුන් රජ සිවුරඟ සෙන් හා එය අනුව ම නික්මුණේ ය. අනඳයෙනි, යම් පෙදෙසෙක සක්රුවන පිහිටියේ ද (රැඳී සිටියේද) මහසුදසුන් රජ සිවුරඟ සෙන් හා එහි නවා තැනට එළැඹියේ ය. අනඳයෙනි, පෙර දිගැ යම් පිළිමල් රජ කෙනෙක් වූහු ද, ඔහු මහසුදසුන් රජු කරා එළැඹ “මහරජාණනි, වඩින්නැ! මහරජාණනි, ඔබ වැඩි සේ යහපත! මෙය ඔබගේ ය. අපට අනුශාසන කළ මැනැවැ” යි කී හ. මහසුදසුන් රජ තෙමේ ඔවුනට “පණිවා නො කළ යුතු, අයිනාදන් නො කළ යුතු, කාමයන්හි වැරැදැ නො හැසිරි යැ යුතු, මුසවා නො බිණි යැ යුතු, මත් පැන් නො පියැ යුතු. තොප වැලැඳු පරිදි ම මත්තෙහි ද රට වැලැ දියැ යුතු යැ”යි මෙසේ කී ය. අනඳයෙනි, පෙර දිගැ යම් පිළිමල් රජ කෙනෙක් වූහු ද, ඔහු මහ සුදසුන් රජු අනුව යන්නෝ වූහ. අනඳයෙනි, ඉක්බිති සක්රුවන පෙරදිග මුහුදට බැස යළි ගොඩ නැඟ දකුණු දිගට පෙරැළිණ ... දකුණු දිග මුහුදට බැස පෙරළා ගොඩ නැඟ පැසිම් දිගට පෙරැළිණ ... පැසිම් මුහුදට බැස ගොඩ නැඟ උතුරු දිගට පෙරැළිණ. මහසුදසුන් රජ ද සිවුරඟ සෙන් හා එය අනුව ම ගියේ ය. අනඳයෙනි, යම් පෙදෙසෙක සක්රුවන පිහිටියේ ද (රැඳී සිටියේ ද) මහසුදසුන් රජ සිවුරඟ සෙන් හා එහි නවාතැනට එළැඹියේ ය. අනඳයෙනි, උතුරු දිගැ යම් පිළිමල් රජ කෙනෙක් වුහු ද, ඔහු මහසුදසුන් රජු කරා එළැඹ “මහ රජාණනි, වඩින්නැ. මහරජාණනි, ඔබ වැඩි සේ යහපත මෙය ඔබ සතු ය. අපට අනුශාසනා කළ මැනවැ” යි කීහ. මහසුදසුන් රජ තෙමේ ඔවුනට “පණිවා නො කළ යුතු, අයිනාදන් නො කළ යුතු, කාමයන්හි වැරැදැ නො හැසිරියැ යුතු, මුසවා නො බිණියැ යුතු, මත් පැන් නො පියැ යුතු. තොප වැළැඳු පරිදි ම මත්තෙහි ද රට වැළැඳියැ යුතු යැ” යි මෙසේ කී ය. අනඳයෙනි, උතුරු දිගැ යම් පිළිමල් රජ කෙනෙක් වූහු ද, ඔහු මහසුදසුන් රජු අනුවැ යන්නෝ වූහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "273"
            },
            {
                "format": 13,
                "text": "6. අනඳයෙනි, ඉක්බිති ඒ සක්රුවන මුහුද හිම් කොට පොළොව දිනා, කුශාවතී රාජධානියට පෙරළා අවුත් මහසුදසුන් රජුගේ ඇතොවුර දොරැ විනිසමඬල ඉදිරියෙහි ඇතොවුර හොබවනුයේ අකුරැ ගැසූ කලෙක සෙයින් සිටියේ ය. අනඳයෙනි, මහසුදසුන් රජුට මෙ බඳු සක්රුවනෙක් පහළ විය.",
                "type": "paragraph"
            },
            {
                "format": 21,
                "text": "ඇත්රුවන",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "7. තවද අනෙකක් කියම්. අනඳයෙනි, මහසුදසුන් රජුට සිරුර මුළුල්ල සුදු වූ, කය සත් තැනෙකින් පොළොව පහස්නා, ඉදුමත්, අහසින් යන, උපෝසථ කුලයට අයත් ඇත් රජෙක් වූ ඇත්රුවනෙක් පහළ විය. එය දැක්මෙන්, ‘ඉදින් හීලෑ බවට පැමිණියේ වී නම් ඒකාන්තයෙන් යහපත් වූ ඇත් යානයෙකැ’යි මහසුදසුන් රජුගේ සිත පැහැදිණ. අනඳයෙනි, ඉක්බිත්තෙන් ඒ ඇත්රුවන බොහෝ කලක් මොනොවට හික්මුණු සොඳුරු අජානී ඇතෙක් යම් සේ ද එසේ ම හික්මුණු බවට පැමිණියේය. අනඳයෙනි, පෙරැ වූ දැයක් කියම්. මහසුදසුන් රජ එ ම ඇත් රුවන විමසනුයේ පෙරවරු වේලෙහි උහු අරා ගොස් මුහුද හිම් කොට ඇති මුළු පොළොව වටා හැවිද කුශාවතී රාජධානියට පෙරළා අවුත් උදේ බොජුන් වැළැඳීම කෙළේ ය. අනඳයෙනි, මහසුදසුන් රජහට මෙබඳු ඇත්රුවනෙක් පහළ විය.",
                "type": "paragraph"
            },
            {
                "format": 21,
                "text": "අස්රුවන",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "8. තව ද අනෙකක් කියම්. අනඳයෙනි, මහසුදසුන් රජුට අස් රුවනෙක් පහළ විය. ඒ කය මුළුල්ල සුදු වූ, කළු හිසක් ඇති, මුදු තෘණ බඳු කෙහෙ ඇති, ඉදුමත්, අහසින් යන, වලාහක නම් අස් රජ ය. උහු දැක්මෙන් ‘ඉදින් භික්මුණු බවට පැමිණියේ වී නම්, සොඳුරු අස් යානයෙකැ’ යි මහසුදසුන් රජුගේ සිත පැහැදුණේ ය. අනඳයෙනි, එ කල්හි ඒ අස් රුවන බොහෝ කලක් මනා ව දැමුණු සොඳුරු අජානී අසක්හු මෙන් ම දැමුණු බවට පැමිණියේ ය. ඒ පෙරැ වූ දැයක් කියම්. අනඳයෙනි, මහසුදසුන් රජ එ ම අස්රුවන විමසනුයේ පෙරවරු සෙමෙහි උහු අරා මුහුද හිම් කොටැති පොළොව වටා ගොස් කුශාවතී රාජධානියට පෙරළා අවුත් උදේ බොජුන් වැළැඳී ය. අනඳයෙනි, මහ සුදසුන් රජුට මෙබඳු අස්රුවනෙක් පහළ විය.",
                "type": "paragraph"
            },
            {
                "format": 21,
                "text": "මිණිරුවන",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "9. තව ද අනෙකක් කියම්. අනඳයෙනි, මහසුදසුන් රජුට මිණි රුවනෙක් පහළ විය. එය සොඳුරු වූ පිරිසිදු ආකරයෙහි උපන, අටැස්, මොනොවට පිරියම් කරන ලද, පැහැදිලි වූ, වෙසෙසින් පහන් වූ, සියලු අයුරින් සම්පූර්ණ වූ වෙරළුමිණෙක. අනඳයෙනි, ඒ මිණිරුවනේ එළිය හාත්පස යොත්නක් තැන් පැතිරැ පැවැත්තේ විය. අනඳයෙනි, ඒ පෙරැ දැයක් කියම්. මහසුදසුන් රජ එ ම මිණිරුවන විමසනුයේ, සිවුරඟ සෙන් සන්නාහ සන්නද්ධ කොට, මිණි රුවන දද මුදුනට නංවා, රෑ ගනඳුරෙහි නික්මුණේ ය. අනඳයෙනි, හාත්පසැ යම් ගම් කෙනෙක් වූහු ද, ඔහු ‘දහවලැ’ යි හඟනාහු, ඒ එළියෙන් වැඩ ඇරැඹුහු. අනඳයෙනි, මහසුදසුන් රජුට මෙ බඳු වූ මිණිරුවනෙක් පහළ විය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "275"
            },
            {
                "format": 21,
                "text": "ඉතිරි රුවන",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "10. තව ද අනෙකක් කියම්. අනඳයෙනි, මහසුදසුන් රජුට වෙසෙසි රූ ඇති, දකුම්කලු, සිත පහදවන, උතුම් පැහැසපුයෙන් යුත්, ඉතා නො උස්, ඉතා නොමිටි, ඉතා කෙට්ටු නොවූ, ඉතා නො තර, ඉතා නො කලු, ඉතා නොසුදු, මිනිස් පැහැසපුව ඉක්මැවූ, දෙව් පැහැසපුවට නො පැමිණි ස්ත්‍රියක් වූ ඉතිරි රුවන පහළ විය. අනඳයෙනි, ඉඹුල් පුලුනෙහි හෝ කපු පුලුනෙහි සෙයින් ඒ ඉතිරිරුවනගේ මොළොක් පහස වෙයි. අනඳයෙනි, ශීත සමයෙහි ඒ ඉතිරි රුවනගේ ගාත්‍රයෝ උණුසුම් වෙත්, උෂ්ණ සමයෙහි සිසිල් වෙත්. අනඳයෙනි, ඒ ස්ත්‍රිරත්නයාගේ කයින් සඳුන් සුවඳ හමයි, මුවින් මහනෙල් මල් සුවඳ හමයි. අනඳයෙනි, ඒ ස්ත්‍රීරත්නය මහසුදසුන් රජුට කලින් ම නැඟී සිටිනුයේ ද, වතාවත් නිමවා පසු වැ හිඳුනෙ ද, කුමක් කරම් දැ’ යි විමසා ම කරනුයේ ද, රජුට මන වඩනා දෑ ම කරනුයේද, පිය බස් ම තෙප්ලනුයේද වෙයි. අනඳයෙනි, ඒ ඉතිරි රුවන සිතිනුදු මහ සුදසුන් රජු ඉක්මැ නො හැසිරෙන්නේ විය (සිතිනුදු අනෙකකු නො පැතීය). කයින් එසේ හැසිරීමෙක් කොයින් ලැබේ ද? අනඳයෙනි, මහසුදසුන් රජුට මෙබඳු ඉතිරි රුවනෙක් පහළ විය.",
                "type": "paragraph"
            },
            {
                "format": 21,
                "text": "ගැහැවිරුවන",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "11. තව ද අනෙකක් කියම්. අනඳයෙනි, ඒ මහසුදසුන් රජුට ගැහැවි රුවනෙක් පහළ විය. යමෙකින් හිමියන් ඇත්තාවූ ද හිමියන් නැත්තා වූ ද නිධාන දක්නේ ද එසේ වූ කර්මවිපාකජ දිවැසෙක් ඒ ගැහැවි රුවනට පහළ විය. හේ මහසුදසුන් රජු කරා එළැඹ ‘දෙවියනි, ඔබ මන්දොත්සාහ වන්න, ඔබට ධනයෙන් කටයුතු දෑ මම් ධනයෙන් කැරැදෙන්නෙමි’ යි මෙසේ සැළ කෙළේ ය. ඒ පෙරැ වූවක් කියම්. අනඳයෙනි, මහසුදසුන් රජ එ ම ගැහැවි රුවන විමසනුයේ, නැවක නැඟ ගංගා නදිය මැදැ දිය පහරට බැස, ගැහැවිරුවන බණවා, ‘ගැහැවිය, මට අමු රනින් හා ශුද්ධ කළ රනින් ප්‍රයෝජන ඇතැ’ යි කී ය. ‘මහරජුනි, එසේ වී නම් එක් තෙරකට නැව එළැඹේව’ යි හේ කී ය. ‘ගැහැවිය , මෙහි දී ම මට හිරණ්‍ය ස්වර්ණයෙන් වැඩෙක් ඇතැ’ යි රජ කීය. අනඳයෙනි, එ කල්හි ඒ ගැහැවිරුවන දෝතින් දිය ස්පර්ශ කොට හිරණ්‍ය ස්වර්ණයෙන් පිරුණු සැළියක් ඔසොවා ගෙන මහසුදසුන් රජුට “මහරජුනි, මෙතෙකින් සෑහේ ද? මෙ තෙකින් කටයුත්ත කරන ලද්දේ වේ ද? මහරජුනි, මෙතෙකින් ඔබ වචනය පිදුණේ දැ?” යි කී ය. මහසුදසුන් රජ “ගැහැවිය මෙ තෙකින් සෑහෙයි, ගැහැවිය මෙතෙකින් කටයුත්ත කරන ලද ය, ගැහැවිය, මෙතෙකින් මා වචන පිදිණැ” යි කීය. අනඳයෙනි, මහසුදසුන් රජුට මෙබඳු වූ ගැහැවිරුවනෙක් පහළ විය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "277"
            },
            {
                "format": 21,
                "text": "පිරිනා රුවන",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "12. තව ද අනඳයෙනි, පණ්ඩිත වූ, ව්‍යක්ත වූ, ප්‍රකෘති ප්‍රඥා ඇති, මහසුදසුන් රජුහු කරා එළැඹැවියැ යුත්තහු එළඹවනනට ද, බැහැර කළ යුත්තහු බැහැර කරවන්නට සමර්ථ වූ පරිනායක රත්නය ද (පුත්‍ර රත්නය ද) පහළ විය. හෙ තෙම මහ සුදසුන් රජු කරා එළැඹ ‘දේවයිනි, ඔබ මන්දොත්සාහ වන්න, මම රට අනුසස්නෙමි’ යි මෙසේ කී ය. අනඳයෙනි, මහසුදසුන් රජුට මෙබඳු පරිනායක රත්නයෙක් පහළ විය. අනඳයෙනි, මහසුදසුන් රජ මේ සත් රුවනින් සමන්විත විය.",
                "type": "paragraph"
            },
            {
                "format": 21,
                "text": "ඍද්ධිසමන්වාගමය",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "13. තව ද,අනඳයෙනි, මහසුදසුන් රජ සතර සෘද්ධීන්ගෙන් සමන්විත විය. කවර සතර සෘද්ධීන්ගෙන් ද? යත්: අනඳයෙනි, මෙහි මහ සුදසුන් රජ වෙසෙස් රූ ඇත්තේ, (අතෘප්තිකර දසුන් ඇතියෙන්) දක්නට සුදුසු වූයේ, දුටුවන් පහදවනුයේ, සෙසු මිනිස්නට වඩා අතිසයින් උතුම් පැහැ සටහනින් සමන්විත වූයේ වී ය. අනඳයෙනි, මහසුදසුන් රජ මේ පළමු වන සෘද්ධියෙන් සමන්විත වී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "තව ද අනඳයෙනි, මහසුදසුන් රජ සෙසු මිනිස්නට වඩා දීර්ඝ ආයුෂ ඇත්තේ බොහෝ කල් සිටුනේ වී ය. අනඳයෙනි, මහ සුදසුන් රජ මේ දෙවෙනි සෘද්ධියෙන් සමන්විත වී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "තව ද අනඳයෙනි, මහ සුදසුන් රජ ආබාධ නැත්තේ, රෝග නැත්තේ, ඉතා ශීත ද නොවූ, ඉතා උෂ්ණ ද නොවූ, සෙසු මිනිස්නට වැඩි තරම් වූ සම ලෙස අහර පැසවන උදරාග්නියෙන් සමන්විත වී ය. අනඳයෙනි, මහසුදසුන් රජ මේ තෙවෙනි සෘද්ධියෙන් සමන්විත වී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "තව ද අනඳයෙනි, මහ සුදසුන් රජ බමුණනට ද ගැහැවියනට ද ප්‍රිය ද මනාප ද වී ය. අනඳයෙනි, පියා පුතුනට යම්සේ ප්‍රියත් මනාපත් වේ ද, එසේ ම මහසුදසුන් රජ බමුණනටත් ගැහැවියනටත් ප්‍රිය ද මනාප ද වී ය. අනඳයෙනී, මහසුදසුන් රජුට ද බමුණෝත් ගැහැවියෝත් පිය ද මනාප ද වූහ. අනඳයෙනි, යම්සේ පියාට පුත්‍රයෝ ප්‍රියත් මනාපත් වෙත් ද, එසේ ම මහ සුදසුන් රජුට ද බමුණෝත් ගැහැවියෝත් පිය ද මනාප ද වූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, පෙරැ දවසැ මහ සුදසුන් රජ සිවුරඟ සෙනඟින් උපලක්ෂිත වැ උයන් බිම බලා නික්මුණේ ය. අනඳයෙනි, එ කල්හි බමුණෝත් ගැහැවියෝත් මහසුදසුන් රජු කරා එළැඹ, දේවයිනි, යම්සේ අපි බොහෝ වේලාවක් ඔබ දැක්කැ හැකි වන නමෝ ද, එසේ නො යුහු වැ වඩින්නැ’ යි මෙසේ කීහ. අනඳයෙනි, මහසුදසුන් රජ ද රියැදුරා අමතා, ‘සැරිය, යම් සේ මම් බමුණු ගැහැවියන් විසින් බොහෝ වේලා දක්නා ලබනු හැකි වන්නෙම් ද, එසේ සෙමෙන් රිය යවව’ යි මෙසේ කී ය. අනඳයෙනි, මහ සුදසුන් රජ මේ සතර වන සෘද්ධියෙන් සමන්විත වී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, මහසුදසුන් රජ මේ සතර සෘද්ධීන් ගෙන් සමන්විත වී ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "279"
            },
            {
                "format": 21,
                "text": "පොකුණු මැවීම",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "14. අනඳයෙනි, එ කල්හි මහසුදසුන් රජහට, ‘මේ තල්රුක් අතරැ, දුනු සියක් දුනු සියක් තන්හි පොකුණු කැරැවීම් නම් යෙහෙකැ’ යි මේ සිත විය. අනඳයෙනි, මහසුදසුන් රජ තෙම ඒ තල්රුක් අතරැ දුනු සියයක් දුනුසියයක් තැනැ පොකුණු කැරැවී ය. අනඳයෙනි, ඒ පොකුණු සිවුවණක් ගඩොළුයෙන් බඳනා ලද්දාහු වූහ. එක් ගඩොළු කෙනෙක් රන්මුවා වූහ. එක් ගඩොළු කෙනෙක් රිදීමුවා වූහ, එක් ගඩොළු කෙනෙක් වෙරළුමිණි මුවා වූහ. එක් ගඩොළු කෙනෙක් පළිඟුමුවා වූහ. අනඳයෙනි, ඒ පොකුණුවලැ සිවු පැහැයෙන් නිමි සිවු සිවු හිණිමං කෙනෙක් වූහ. (එහි) එක් හිණෙක් රන්මුවා විය. එකෙක් රිදීමුවා විය, එකෙක් වෙරළුමිණිමුවා විය, එකෙක් පළිඟුමුවා විය. රන්මුවා හිණෙහි රන්මුවා ටැම්හු ද රිදීමුවා පියගැට ද හිණිහිස ද වූහ. රිදීමුවා හිණෙහි රිදීමුවා ටැම්හු ද රන්මුවා පියගැටද හිණිහිස ද වූහ. වෙරළුමිණිමුවා හිණෙහි වෙරළුමිණිමුවා ටැම්හු ද පළිඟුමුවා පියගැට ද හිණිහිස ද වූහ. පළිඟුමුවා හිණෙහි පළිඟුමුවා ටැම්හු ද වෙරළුමිණිමුවා පියගැට ද හිණිහිස ද වූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, ඒ පොකුණුහු වූ කලි පිල්කඩ දෙකෙකින් පිරිකෙවුණේ වූහ. එක් පිල්කඩෙක් රන්මුවා ද එක් පිල්කඩෙක් රිදීමුවා ද විය. රන්මුවා පිල්කඩෙහි රන්මුවා ටැම්හු ද රිදිමුවා පියගැට ද මුදුන ද වූහ. රිදීමුවා පිල් කඩෙහි රිදීමුවා ටැම්හු ද රන්මුවා පියගැට ද මුදුන ද වූහ. අනඳයෙනි, එ කල්හි මහසුදසුන් රජහට ‘මේ පොකුණුවලැ හැම සෘතුයෙහි ම පිපෙන සේ වූ උපුල් පියුම් කුමුදු පඞෙර (හෙළ පියුම්) යන මෙ බඳු මල් ගස් හැම දෙනාට ඇවුරුම් නැතිසේ සාධාරණ කොට රෝපණ කැරැවීම් නම් යෙහෙකැ’ යි මේ සිත විය. අනඳයෙනි, මහසුදසුන් රජ ඒ පොකුණුවලැ ඇවුරුම් නැතිසේ හැම දෙනාට සාධාරණ කොට හැම සෘතුයෙහි ම පිපෙන සේ වූ උපුල් පියුම් කුමුදු පඞෙර යන මෙ බඳු මල්ගස් රෝපණ කැරැවී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "15. අනඳයෙනි, එ කල්හි මහසුදසුන් රජුට මේ පොකුණුතෙරැ ආ ආ ජනයා නාවන ස්නාපයකයන් තැබීම් නම් යෙහෙකැ’ යි මේ සිත විය. අනඳයෙනි, මහසුදසුන් රජ පොකුණු තෙරැ ආ ආ ජනයා නාවන ස්නාපකයන් තැබී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති ‘මේ පොකුණු තෙරැ අහර කැමැත්තනුට අහරද, පැන් කැමැත්තහුට පැන් ද, වස්ත්‍ර කැමැත්තහුට වස්ත්‍ර ද, යාන කැමැත්තහුට යාන ද, යහන් කැමැත්නුට යහන් ද, ස්ත්‍රියක කැමැත්තහුට ස්ත්‍රිය ද, අමුරන් කැමැත්තහුට අමුරන් ද, රත්රන් කැමැත්තනුට රත්රන් දැ යි මෙසේ වූ දානයක් පිහිටුවීම් නම් යෙහෙකැ’ යි මහසුදසුන් රජුට මේ සිත විය. අනඳයෙනි, මහසුදසුන් රජ ඒ පොකුණුතෙරැ අහර කැමැත්තහුට අහර ද, පැන් කැමැත්තහුට පැන් ද, වස්ත්‍ර කැමැත්තහුට වස්ත්‍ර ද, යාන කැමැත්තනුට යාන ද, යහන් කැමැත්තහුට යහන් ද, ස්ත්‍රියක කැමැත්තහුට ස්ත්‍රිය ද, අමුරන් කැමැත්තහුට අමුරන් ද, රත්රන් කැමැත්තනුට රත්රන් දැ යි මෙසේ වූ දානයක් පිහිටුවී ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "281"
            },
            {
                "format": 13,
                "text": "16. අනඳයෙනි, එ කල්හි බමුණෝ ද ගැහැවියෝ ද බොහෝ වස්තුව ගෙන මහ සුදසුන් රජු කරා එළැඹ, ‘දේවයිනි, මේ බොහෝ වස්තුව දේවයන් වහන්සේ ම උදෙසා ගෙනෙන ලද්දේ ය. එය දේවයන් වහන්සේ පිළිගන්නා සේක් ව’ යි මෙසේ කීහ. ‘භවත්නි, කම් නැත. මගේ ද මේ බොහෝ වස්තුව දැහැමි අය බද්දෙන් පිළියෙල කැරුණේ ය, එය තොපට වේ වා, මෙයින් වැඩි පුර ද ගෙන යවු’ යැ යි රජ ඔවුන් දුන් වස්තුව පිළිකෙවී ය. රජු විසින් පිළිකෙවුණු ඔහු එක් පසකට ගොස්, ‘මේ වස්තූන් අපි නැවැත සිය ගෙවලට පෙරළා ගෙන යන්නමු යන යමෙක් ඇද්ද, මෙය අපට නො සුදුසු ම ය, අපි (මෙයින්) මහසුදසුන් රජුට ගෙයක් කරන්නමෝ නම් යෙහෙකැ’ යි මෙසේ සිතූහ. ඔහු මහසුදසුන් රජු වෙත එළැඹ ‘දේවයිනි, ඔබට ගෙයක් කරන්නමු’ යි මෙසේ සැළ කළාහ. අනඳයෙනි, මහසුදසුන් රජ නිහඩ බැවින් එය ඉවැසී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, එ කලැ සක්දෙවිඳු සිය සිතින් මහසුදසුන් රජුගේ සිතැ කල්පනාව දැන, විස්සම් දෙව්පුතු බණවා, ‘යහලු විස්සම්, තෝ මෙහි එව, මහසුදසුන් රජුට දහම් පා නම් ගෙයක් මවව’ යි කී ය. අනඳයෙනි, ‘එසේ ය, වහන්සැ’ යි කියා ම විස්සම් දෙව්පුත් සක් දෙවිඳුට පිළිවදන් දී ශක්තිමත් පුරුෂයකු වක් කළ අතක් දික් කරනු හෝ දික් කළ අතක් වක් කරනු සේ යුහු ව තව්තිසා දෙව්ලොවැ අතුරු දහන් වැ, මහසුදසුන් රජු ඉදිරියේ පහළ විය. අනඳයෙනි, ඉක්බිත්තෙන් විස්සම් දෙව්පුත් මහ සුදසුන් රජුට, ‘දේවයිනි, ඔබට නිවහනක්, දහම් නම් පහයක් මවන්නෙමි’ යි මෙ වචන කී ය, අනඳයෙනි, මහසුදසුන් රජ නිහඬ බැවින් (එය) ඉවැසී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "17. අනඳයෙනි, විස්සම් දෙව්පුත් මහසුදසුන් රජුට නිවහනක්, දහම් නම් පහයක් මැවී ය. අනඳයෙනි, දහම් පහය පෙර දෙසින් ද පැසිම් දෙසින් ද දිගින් යොදුනෙක් විය, උතුරු දෙසින් ද දකුණු දෙසින් ද පුලුලින් අඩ යොදුන් විය. අනඳයෙනි, දහම් පහයේ ගෙබිම එක්තරා ගඩොළුයෙක් රන්මුවා ද, එක්තරා ගඩොළුයෙක් රිදීමුවා ද එක්තරා ගඩොළුයෙක් වෙරළුමිණිමුවා ද, එක්තරා ගඩොළුයෙක් පළිඟුමුවා දැ යි සිවුවණක් ගඩොළුයෙන් උසින් තුන් බඹයක් නංවන ලද්දේ විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, දහම් පහයේ සිවුවන් ගඩොළුයෙන් නැංවුණු අසුසාර දහසෙක් ටැම්හු වූහ. එක් ටැඹෙක් රන්මුවා විය, එක් ටැඹෙක් රිදීමුවා ද එක් ටැඹෙක් වෙරළුමිණි මුවා ද එක් ටැඹෙක් පළිඟුමුවා ද විය. අනඳයෙනි, දහම් පහය, එක්තරා පෝරු කෙනෙක් රන්මුවා ද, එක්තරා පෝරු කෙනෙක් රිදීමුවා ද, එක්තරා පෝරු කෙනෙක් වෙරළුමිණිමුවා ද, එක්තරා පෝරු කෙනෙක් පළිඟුමුවා දැ යි සිවුවණක් පෝරුයෙන් අතුරන ලද්දේ විය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "283"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, දහම් පහයේ එක්තරා හිණෙක් රන්මුවා ද එක්තරා හිණෙක් රිදීමුවා ද එක්තරා හිණෙක් වෙරළුමිණිමුවා ද එක්තරා හිණෙක් පළිඟුමුවා දැ යි සතර වගයෙකින් නිමි සූවිසි හිණිමං කෙනෙක් වූහ. රන්මුවා හිණෙහි රන්මුවා ටැම්හු ද ... පළිඟුමුවා හිණෙහි පළිඟුමුවා ටැම්හු ද වෙරළු මිණි මුවා පියගැට ද හිණිහිස් ද වූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, දහම්පහයෙහි එක් කුළුගෙයෙක් රන්මුවා ද, එකෙක් රිදීමුවා ද එකෙක් වෙරළුමිණිමුවා ද එකෙක් පළිඟුමුවා දැ යි සිවුවගයෙක සුවාසූ දහසෙක් කුළුගෙවල් වූහ. රන්මුවා කුළුගෙහි රිදීමුවා පළඟෙක් පැනැවුණේ විය. රිදීමුවා කුළුගෙහි රන්මුවා පළඟෙක් පැනැවුණේ විය. වෙරළුමිණිමුවා කුළුගෙහි ඇත්දළමුවා පළඟෙක් පැනැවුණේ විය. පළිඟුමුවා කුළුගෙහි මැසිරිගල්මුවා පළඟෙක් පැනැවුණේ විය. රන්මුවා කුළු ගෙහි දොරැ රිදීමුවා තල්රුකෙක් සිටියේ විය. එහි කඳ රිදීමුවා ද පත්‍ර හා ඵල හා රන්මුවා ද වූහ. රිදීමුවා කුළුගෙයැ දෙරැ රන්මුවා තල් රුකෙක් සිටියේ විය. එහි කඳ රන්මුවා ද පත්‍ර හා ඵල හා රිදීමූවා ද වූහ. වෙරළුමිණිමුවා කුළුගෙයැ දොරැ පළිඟුමුවා තල්රුකෙක් සිටියේ විය. එහි කඳ පළිඟුමුවා ද පත්‍ර හා ඵල හා වෙරළුමිණිමුවා ද වූහ. පළිඟුමුවා කුළුගෙයැ දොරැ වෙරළුමිණිමුවා තල්රුකෙක් සිටියේ විය. එහි කඳ වෙරළුමිණිමුවා ද පත්‍ර හා ඵල හා පළිඟුමුවා ද වූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "18. අනඳයෙනි, එ කල්හි මහසුදසුන් රජුට “යම් තැනෙක මම් දිවාවිහරණ පිණිස හිඳිනෙම් ද, එහි සියල්ල රන්මුවා තල් වනයක් කැරැවීම් නම් යෙහෙකැ” යි මේ සිත විය. අනඳයෙනි, ඉක්බිති, යම් තැනෙක මහසුදසුන් රජ දිවා විහරණය පිණිස හිඳුනේ ද, එහි මහාව්‍යුහ කුළුගෙයැ දොරැ තල්වනයක් කැරැවී ය. අනඳයෙනි, දහම් පහය වෙදිකා (පිල්) දෙකෙකින් පිරිකෙවුණේ විය. එක් වෙදිකායෙක් රන්මුවා විය. අනෙක රිදිමුවා විය. රන්මුවා වෙදිකායෙහි රන්මුවා ටැම්හු ද රිදීමුවා පියගැට හා කණු හිස් හා වූහ. රිදීමුවා වෙදිකායෙහි රිදීමුවා ටැම්හු ද රන්මුවා පියගැට හා කණු හිස් හා වූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "19. අනඳයෙනි, දහම්පාය කිකිණි දල් දෙකෙකින් පිරිකෙවුණේ විය. එක් දැලෙක් රන්මුවා ද එක් දැලෙක් රිදීමුවා ද විය. රන්මුවා දැලෙහි රිදීමුවා කිකිණි (රහුගෙඩි) විය. රිදීමුවා දැලෙහි රන්මුවා කිකිණි (රහුගෙඩි) විය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "285"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, සුළඟින් සැලුණු ඒ කිකිණි දැල්හි මියුරු සිත්කලු මන වඩනා, (ප්‍රීතියෙන්) කුල්මත් කරන හඬෙක් විය. අනඳයෙනි, දක්ෂ වාදකයකු විසින් මොනොචට වැයූ මොනොවට ගැයූ පසැඟි තුරුවන් හඬ යම්සේ මියුරුත් සිත් අලවනුත් කන්කලුත් සිත කුල්මත් කරනුත් වේ ද, අනඳයෙනි, එසේ ම සුළඟින් සැලුණු ඒ කිකිණි දැලුන් හඬ මියුරු ද සිත් අලවනු ද මන වඩනු ද සිත් කුල්මත් කරනු ද විය. අනඳයෙනි, එ සමයෙහි කුසාවතී රජදහනැ සුරාසොඬ වූ මත් පැනෙහි ගිජු වූ ධූර්තයෝ වූහ. ඔහු ඒ සුළඟින් සැලුණු කිකිණි දැලුන් හඩින් ඉඳුරන් හැසිරැවූහ (ඊ වටා කිකිණිදැලුන් හඬ අනුව නැටීම් ආදිය කළාහ.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, නිමියා වූ දහම් පහය බැලිය නො හැකි විය. එය (අධික දීප්තියෙන්) ඇස් අඳුරු කෙරෙයි. අනඳයෙනි, වැසි සාරමසින් පැසිම් මසෙහි සරත් සමයෙහි බැබලුණු, පහ වූ වලා ඇති අහසැ නැගෙන හිරු යම්සේ බැලිය නො හැකි ද, ඇස් අඳුරු කෙරෙයි ද, එසේ ම අනඳයෙනි, දහම් පහය බැලිය නොහැකි විය, ඇස් අඳුරු කරන්නේ විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "20. අනඳයෙනි, ඉක්බිති මහ සුදසුන් රජුට, ‘දහම් පහය ඉදිරියෙහි දහම් නම් පොකුණක් කරවන්නෙම් වීම් නම් යෙහෙකැ’ යි මේ සිත විය. අනඳයෙනි, මහසුදසුන් රජ දහම් පාය ඉදිරියෙහි දහම් නම් පොකුණක් කැරැවීය. අනඳයෙනි, පෙර දෙසින්ද පැසිම් දෙසින් ද අයමින් යොදුනෙක් විය. උතුරු දිගින් ද දකුණු දිගින් ද පුලුලින් අඩයොදුන් විය. අනඳයෙනි, දහම් පොකුණ ඇතැම් උළු කෙනෙක් රන්මුවා ද ඇතැම් කෙනෙක් රිදීමුවා ද ඇතැම් කෙනෙක් වෙරළුමිණි මුවා ද ඇතැම් කෙනෙක් පළිඟුමුවා ද යි සිවුවණක් ගඩොළුයෙන් නංවන ලද්දේ විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, දහම් පොකුණෙහි, ඇතැම් කෙනෙක් රන්මුවා ද ඇතැම් කෙනෙක් රිදීමුවා ද ඇතැම් කෙනෙක් වෙරෙළුමිණි මුවා ද ඇතැම් කෙනෙක් පළිඟුමුවා දැ යි සිවුවණක් රුවනින් නිමියා වූ සූවිසි හිණි කෙනෙක් වූහ. රන්මුවා හිණෙහි රන්මුවා ටැම්හු ද රිදීමුවා පියගැට ද හිස් ද වූහ. රිදීමුවා හිණෙහි රිදීමුවා ටැම්හු ද රන්මුවා පියගැට ද හිස් ද වූහ. වෙරළු මිණිමුවා හිණෙහි වෙරෙළුමිණිමුවා ටැම්හු ද පළිඟුමුවා පියගැට ද හිස් ද වූහ. පළිඟුමුවා හිණෙහි පළිඟුමුවා ටැම්හු ද වෙරෙළුමිණිමුවා පියගැට ද හිස් ද වූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, දහම් පොකුණ එකක් රුවන්මුවා ද එකක් රිදීමුවා දැ යි පිල් දෙකෙකින් පිරිකෙවුණේ විය. රන්මුවා පිලෙහි රන්මුවා ටැම්හු ද රිදීමුවා පියගැට ද හිස් ද වූහ. රිදීමුවා පිලෙහි රිදී මුවා ටැම්හු ද රන්මුවා පිය ගැට ද හිස් ද වූහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "287"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, දහම් පොකුණ එක් තල්පෙලක් රන්මුවා ද එක් තල්පෙලක් රිදීමුවා ද එක් තල්පෙලක් වෙරළුමිණිමුවා ද එක් තල්පෙලක් පළිඟුමුවා ද එක් තල්පෙලක් රතුමිණිමුවා ද එක් තල් පෙලක් මැසිරිගල් මුවා ද එක් තල්පෙලක් සියලු රුවන්මුවා දැ යි සත් තල්පෙලෙකින් පිරිකෙවුණේ විය. රන්මුවා තල්රුකැ රන්මුවා කඳ ද රිදීමුවා පත්‍ර ද ඵල ද වූහ. රිදීමුවා තල් රුකෙහි රිදීමුවා කඳ ද රන්මුවා පත්‍ර ද ඵල ද වූහ. වෙරෙළුමිණිමුවා තල්රුකැ වෙරළුමිණිමුවා කඳ ද පළිඟුමුවා පත්‍ර ද ඵල ද වූහ. පළිඟුමුවා තල්රුකැ පළිඟුමුවා කඳ ද වෙරෙළුමිණිමුවා පත්‍ර ද ඵල ද වූහ. රත්මිණිමුවා තල්රුකැ රත්මිණිමුවා කඳ ද මැසිරිගල්මුවා පත්‍ර ද ඵල ද වූහ. මැසිරිගල්මුවා තල්රුකැ මැසිරිගල්මුවා කඳ ද රත්මිණිමුවා පත්‍ර ද ඵල ද වූහ. සියලු රුවන් මුවා තල් රුකැ සව්රුවන්මුවා කඳ ද සව්රුවන්මුවා පත් ද පල ද වූහ. අනඳයෙනි, සුළඟින් සැලුණු ඒ තල්රුක් පෙලේ මිහිරි වූ සිත් අලවන, කන්කලු වූ, සිත් මත් කරන හඬෙක් විය. අනඳයෙනි, සමත් තුරුවායකු විසින් මොනොවට වැයූ මොනොවට ගැයූ පසඟතුරුවන් ගොස යම්සේ මියුරුත් සිත් අලවනුත් කන්කලුත් සිත කුල්මත් කරනුත් වේ ද, අනඳයෙනි, එසේ ම සුළඟින් සැලුණු ඒ තල්රුක් පෙලේ හඬ මියුරු ද සිත් අලවනු ද කන්කලු ද සිත් කුල්මත් කරනු ද විය. අනඳයෙනි, එසමයෙහි කුසාවතී රජදහනැ සුරාසොඬ වූ මත් පැනෙහි ගිජු වූ යම් ධූර්ත කෙනෙක් වූහු ද, ඔහු ඒ තල්රුක් පෙලැ හඬින් එහි රැස් වැ ඉඳුරන් හැසිරැවූහ (නැටුම් ඈ කළාහ.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, දහම් පහය ද දහම් පොකුණ ද කරවා නිමැවූ කලැ මහ සුදසුන් රජ, එ සමයෙහි මහණුන් අතුරැ මහණ යැ යි සම්මත වූ ද බමුණන් අතුරැ බමුණු යැ යි සම්මත වූ ද යම් කෙනෙක් වූහු නම්, ඔවුන් රිසි රිසි හැම දැයින් සතපා, දහම් පහයට නැංගේ ය.",
                "type": "paragraph"
            },
            {
                "format": 22,
                "text": "පළමු බණවර යැ.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "289"
            },
            {
                "format": 21,
                "text": "දහන් සමවත් ලැබීම",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "21. අනඳයෙනි, ඉක්බිති “යම් හෙයෙකින් මම් දැන් මෙසේ මහර්ධි ඇතියෙම් ද මහත් ආනුභාව ඇතියෙම් ද, මෙය මගේ කවර කර්මයෙක ඵලයෙක් ද? කවර කර්මයෙක විපාකයෙක් ද?” යි මහ සුදසුන් රජුට මේ සිත විය. ඉක්බිති අනඳයෙනි, මහසුදසුන් රජුට යම් හෙයෙකින් මම් දන් මෙසේ මහත් සෘද්ධි ඇතියෙම්, මෙසේ මහත් ආනුභාව ඇතියෙම් වේම් ද, මෙය දාන දම සංයම යන තුන් පින් කම්වල ඵල ය, මේ තුන්පින්කම් වල විපාකය යැ’ යි මේ සිත විය. අනඳයෙනි, ඉක්බිති මහසුදසුන් රජ මහාව්‍යුහ කුළුගෙය කරා එළැඹියේ ය. එළැඹ, මහාව්‍යුහ කුළුගෙයැ දොරැ සිටියේ, “කාමවිතර්කය, සිටු. ව්‍යාපාද විතර්කය, සිටු. විහිංසාවිතර්කය, සිටු. කාමවිතර්කය, මෙතෙකින් නවතුව, ව්‍යාපාදවිතර්කය, මෙතෙකින් නවතුව, විහිංසාවිතර්කය, මෙ තෙකින් නවතුව” යි උදන් ඇනී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "22. අනඳයෙනි, එයට පසු මහසුදසුන් රජ මහාව්‍යුහ කුළුගෙයට වැද, රන්මුවා පළඟැ හුන්නේ, කාමයන් ගෙන් වෙන් වැ ම, අකුසල් දහමුන් ගෙන් වෙන් වැ ම, විතර්ක සහිත විචාර සහිත, විවේකයෙන් උපන්, ප්‍රීතියත් චිත්ත සුඛයත් ඇති, පළමු වන දහන ලැබ විසීය. විතර්ක විචාරයන් සංසිඳීමෙන්, තමා තුළැ පැහැදීම ඇති කරන, සිතැ එකඟ බව ඇති විතර්ක රහිත, විචාර රහිත, සමාධියෙන් උපන්, ප්‍රීතියත් සුඛයත් ඇති, දෙවෙනි දහන ලැබ විසී ය. ප්‍රීතිය ද පහ වීමෙන් උපේක්ෂා ඇත්තේ ද විසී ය. සිහි ඇත්තේ නුවණින් දන්නේ සුවය නාම කයින් වින්දේ ය. ‘උපේක්ෂක වූයේ සිහි ඇත්තේ සුව වුසුම් ඇත්තේ යැ’ යි යමක්හු ඇරැබැ ආර්‍ය්‍යයෝ කියත් ද, ඒ තෙවෙනි දහන ලැබ විසී ය. සුඛවේදනා ද පහ කිරීමෙන්, දුඃඛවේදනා ද පහ කිරීමෙන් කල් තබා ම සොම්නස් දොම්නසුන් බැහැරැ ලීමෙන් දුඃඛ වේදනා ද නැති සුඛ වේදනා ද නැති, උපේක්ෂා ව ද සිහිය ද යන දෙදෙනාගේ පිරිසිදු බව් ඇති සතර වැනි දහන ලැබ විසී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "23. අනඳයෙනි, ඉක්බිති මහසුදසුන් රජ මහාව්‍යුහ කූටාගාරයෙන් නික්මැ රන්මුවා කුළුගෙට වැද රිදීමුවා පළඟෙහි හුන්නේ, මෙත් සහගිය සිතින් එක් දෙසක් පැතිරැ විසී ය. එසේ දෙවෙනි දෙස ද තෙවෙනි දෙස ද සිවුවැනි දෙස ද, මෙසේ උඩ ද යට ද සරස ද හැම දෙසැ හැම දෙනා ම ආත්මසමතායෙන් (මේ අන් එකෙකැ යි වෙනසක් නොසිතා තමා හා සමබවට පැමිණැවීමෙන්) වෛර නැති ව්‍යාපාද නැති, මහත් වූ මහද්ගත වූ අප්‍රමාණ වූ මෙත්සහගිය සිතින් පැතිර විසී ය. එසේ ම කරුණා සහගත සිතින් ... මුදිතා සහගත සිතින් ... උපේක්ෂා සහගත සිතින් එක් දෙසක් පැතිරැ විසී ය. එසේ දෙවෙනි දෙස ද එසේ තෙවෙනි දෙස ද එසේ සිවුවැනි දෙස ද, මෙසේ උඩ ද යට ද සරස ද හැම දෙසෙහි ම හැම දෙනා ම ආත්මසමතායෙන් (මේ අන් එකෙකැ යි විභාග නො කොට තමා හා සමබවට පැමිණැවීමෙන්) වෛර නැති ව්‍යාපාද නැති මහත් වූ මහද්ගත වූ අප්‍රමාණ වූ උපේක්ෂාසහගත සිතින් පැතිර විසී ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "291"
            },
            {
                "format": 21,
                "text": "නගරාදීහු",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "24. අනඳයෙනි, මහසුදසුන් රජුට කුසාවතී රාජධානිය ප්‍රමුඛ කොටැති අසූසාර දහසෙක් නුවරවල් වූහ. දහම් පාය පාමොක් කොටැති සුවාසූ දහසෙක් ප්‍රාසාදයෝ වූහ. මහාව්‍යුහ කූටාගාරය ප්‍රමුඛ කොටැති සුවාසූ දහසෙක් කුළුගෙවල් වූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "රන්මුවා වූ ද රිදීමුවා වූ ද ඇත්දත්මුවා වූ ද දැවමුවා වූ ද කොඳපලස් අතුළ, සුදු එළුලොම්මුවා ඇතිරි අතුළ, ගන පුප් එළුලොම් ඇතිරි අතුළ, කෙහෙල් මුවසමින් කළ උතුම් පසතුරුණු ඇති, උඩුවියන් සහිත, හිස් දොර පාමුල යන දෙපසැ රතු කන්වයින් ඇති සුවාසූදහසෙක් පළඟහු වූහ. රන් අබරණින් සැදුණු රන් දද සහිත, රන්දැලින් වසන ලද, උපෝසථ ඇත් රජු පාමොක් කොටැති සුවාසූ දහසෙක් ඇත්තු වූහ. රන් අබරණින් සරසන ලද, රන් දද සහිත, රන්දැලින් පිළිසන් වලාහක අස්රජු පාමොක් කොටැති සුවාසූ දහසෙක් අස්සු වූහ. සිංහ සමින් වසන ලද, ව්‍යාඝ්‍ර සමින් වසන ලද, දිවි සමින් වසන ලද, පඬු පැහැ කම්බලයෙන් වසන ලද, රන් අබරණ ඇති, රන් දද ඇති, රන් දැලින් වසන ලද, විජයොත් රිය පාමොක් කොටැති රිය සුවාසූ දහසෙක් වූහ. මිණිරුවන පාමෙක් කොටැති සුවාසූදහසෙක් මිණිහු වූහ. සුභද්‍රා දේවිය පාමොක් කොටැති සුවාසූ දහසෙක් ස්ත්‍රීහු වූහ. ගැහැවිරුවන පාමෙක් කොටැති සූවාසු දහසෙක් ගැහැවියෝ වූහ. පරිනායක රත්නය පාමොක් කොටැති අනුව යන සුවාසූ දහසෙක් කැත්හු වූහ. හැම කල්හි කිරි දොවා ගත හැකි රන් සැට්ටයෙන් සරසන ලද සුවාසූ දහසෙක් දෙන්නු වූහ. සියුම් කොමු පිළී ද සියුම් කපු පිළි ද සියුම් පට පිළී ද සියුම් කම්බල දැ යි පිළී සුවාසූ කෙළ දහසෙක් විය. අනඳයෙනි, මහසුදසුන් රජුට උදේ සවස එළැවෙන බත්තලි සුවාසූ දහසෙක් විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "25. එ සමයෙහි මහ සුදසුන් රජුට සුවාසූ දහසෙක් ඇත්තු උදේ සවස උවටනට යෙත්. එ කලැ මහසුදසුන් රජුට “මේ සුවාසූ දහසෙක් ඇත්තු උදේ සවස මට උවටනට එත්. හවුරුදු සියයක් සියයක් ඇවෑමෙන් සතළිස් දෙදහසෙක් සතළිස් දෙදහසෙක් ඇත්තු එක් වරක් එක් වරක් මට උවටනට එන්නාහු නම් මැනැවැ” යි මේ සිත විය. ඉක්බිති අනඳයෙනි, මහසුදසුන් රජ පරිනායක රුවන බණවා, “සගය, පරිනායක රත්නය, මේ සුවාසූ දහසෙක් ඇත්තු උදේ සවස උවටනට එත්. සගය, පරිනායක රත්නය, එ බැවින් හවුරුදු සියයක් සියයක් ඇවෑමෙන් දෙසාළිස් දහසෙක් දෙසාළිස් දහසෙක් ඇත්තු එක් වරක් එක් වරක් උවටනට එත් වා” යි කී ය. අනඳයෙනි, ‘එසේ ය, දේවයිනි’ යි කියා පරිනායක රත්නය මහසුදසුන් රජුට පිළිවදන් ඇස්විය. අනඳයෙනි, එයට පසු කලැ හවුරුදු සියයක් සියයක් ඇවෑමෙන් ඇත්තු දෙසාළිස් දහසෙක් දෙසාළිස් දහසෙක් එක් වරක් එක් වරක් උවටනට ආහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "293"
            },
            {
                "format": 21,
                "text": "සුභද්‍රාව එළැඹීම",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "26. අනඳයෙනි, එ කලැ බොහෝ හවුරුදු ගණනෙක බොහෝ හවුරුදු දහස් ගණනෙක ඇවෑමෙන් සුභද්‍රා දේවියට, “මහ සුදසුන් රජ මා විසින් දුටු බොහෝ කල් ඇත්තේ ය. මම මහසුදසුන් රජු දක්නට ගියෙම් වීම් නම් යෙහෙකැ” යි මේ සිත විය. අනඳයෙනි, ඉක්බිති සුභදා දේවී ඇතොවුර බණවා, “තෙපි එවු. හිස් සෝදා නාවු. රන්වන් පිළි හැඳ පොරොවවු. මහසුදසුන් රජ අප විසින් දක්නා ලද බොහෝ කල් ඇත්තේ ය. මහ සුදසුන් රජු දක්නට එළැඹෙන්නම්හ” යි කිවු ය. ‘එසේ යැ ආර්‍ය්‍යාවෙනි’ යි ම ඇතොවුර සුභද්‍රා දේවියට පිළිවදන් දී, හිස් සෝද නා, රන්වන් පිළි හැඳ පෙරෙවැ සුභද්‍රා දේවිය කරා එළැඹියාහ. අනඳයෙනි, ඉක්බිති සුභද්‍රා දේවී පරිනායක රත්නය බණවා “සගය, පරිනායක රත්නය, සිවුරඟ සෙන් සදව. අප විසින් මහසුදසුන් රජ දක්නා ලද බොහෝ කල් ඇත්තේ ය. මහසුදසුන් රජු දක්නට එළඹෙන්නම්හ” යි කිවු ය. ‘එසේ යැ, දේවීනි’ යි කියා ම පරිනායක රත්නය සුභද්‍රා දේවියට පිළිවදන් දී, සිවුරඟ සෙන් සදවා, ‘දේවියනි, සිවුරඟ සෙන් සරසන ලදි. යම් ගමනකට සිතවු ද, එයට කල් වේ’ යැ යි සැළ කෙළේ ය. අනඳයෙනි, ඉක්බිති සුභද්‍රා දේවී සිවුරඟ සෙන් ද ඇතොවුර ද කැටුව දහම්පාය කරා එළැඹුණා ය. එළැඹ, දහම්පහය නැඟ, මහාව්‍යුහ කුළුගෙය කරා එළැඹ, එහි දොරබාවැ එල්බැ සිටියා ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, එ කල්හි මහ සුදසුන් රජ ඔවුන් එන හඬ අසා, “කිමෙක් ද? මහ ජන මුළුවෙක හඬ නියා!” යි සිතා, මහාව්‍යුහ කුළුගෙයින් නික්මෙන්නේ, දොර බා වැ එල්බැ සිටි සුභද්‍රා දේවිය දුටුයේය. දැක, “දේවිය, ඔහි ම සිටු, ඇතුළට නො වදුව” යි කී ය. අනඳයෙනි, ඉක්බිති මහසුදසුන් රජ එක්තරා මිනිසකු බණවා, ‘හෙම්බා මිනිස, තෝ මෙහි එව. මහාව්‍යුහ කුළුගෙන් රන්මුවා පළඟක් ගෙනවුත් සියල්ල රන්මුවා වූ තල් වෙනෙහි පණවව’ යි කී ය. ‘දේවයිනි, එසේ යැ’ යි කියා ම එ මිනිසා මහ සුදසුන් රජුට පිළිවදන් දී, මහාව්‍යුහ කුළුගෙයින් රන්මුවා පළඟක් ගෙනවුන් සියල්ල රන්මුවා තල්වෙනෙහි පැණැවී ය. අනඳයෙනි, ඉක්බිති මහසුදසුන් රජ දකුණු පයෙහි වම් පය මඳක් හයා තබා සිහි නුවණ ඇති වැ දකුණැලයෙන් සිංහශය්‍යායෙන් ශයනය කෙළේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, එ කලැ සුභද්‍රා දේවියට “මහසුදසුන් රජුගේ ඉඳුරෝ වෙසෙසින් පහන්හ. සිවිපැහැය පිරිසිදු ය, පබසර ය. මහ සුදසුන් රජ කලුරිය නො කෙරේ වා” යි මේ සිත විය. ඕ මහසුදසුන් රජුට මෙසේ කිවු ය: “දේවයිනි, කුශාවති රජදහන පාමොක් කොටැති මේ ඔබ සතු නුවර සුවාසූ දහසෙකි. දේවයිනි, මෙහි ඇල්ම උපදවන්න, දිවියෙහි අපේක්ෂාව කරන්න. දේවයිනි, දහම් පාය පාමොක් කොටැති ඔබ සතු මේ ප්‍රාසාද සුවාසූ දහයෙකි. දේවයිනි, මෙහී ඇල්ම උපදවන්න,",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "295"
            },
            {
                "type": "paragraph",
                "text": " ජීවිතය කෙරෙහි අපේක්ෂාව කරන්න. දේවයිනි, මහාව්‍යුහ කුළුගෙය පාමොක් කොටැති ඔබ සතු මේ කුළුගෙ සුවාසූ දහසෙක් වෙයි. මෙහි ඇල්ම උපදවන්න, ජීවිතයෙහි අපේක්ෂාව කරන්න. දේවයිනි, රන්මුවා ද රිදීමුවා ද ඇත්දත්මුවා ද දැවමුවා ද වූ කොඳුපලස් අතුළ, සුදු එළුලොම්මුවා ඇතිරි අතුළ, කෙහෙල්මුව සමින් කළ උතුම් පසතුරුණු ඇති උඩුවියන් සහිත, හිස්දොර පාමුල යන දෙ පසැ රතු කන්වයින් ඇති, සුවාසූ දහසෙක් ඔබ සතු පළඟහු ඇත. දේවයිනි, මෙහි ඡන්දය උපදවන්න, ජීවිතයෙහි අපේක්ෂාව කරන්න. දේවයිනි, රන් අබරණ ඇති, රන් දද ඇති, රන් දැලින් පිළිසන් උපෝසථ ඇත්රජු පාමොක් කොටැති මේ ඔබගේ සුවාසූ දහසෙක් ඇත්තු වෙති. දේවයිනි, මොවුන් කෙරෙහි ඇල්ම දනවන්න, ජීවිතයෙහි අපේක්ෂාව කරන්න. දේවයිනි, රන් අබරණ පලන්, රන් දද ඇති, රන් දැලින් පිළිසන්, වලාහක අස්රජු පාමොක් කොටැති, ඔබගේ මේ සුවාසූ දහසෙක් අස්සු වෙති. දේවයිනි, මොවුන් කෙරෙහි ඇල්ම දනවන්න, ජීවිතය කෙරෙහි අපේක්ෂාව කරන්න. දේවයිනි, සිංහ සමින් වසන ලද, ව්‍යාඝ්‍ර සමින් වසන ලද, දිවි සමින් වසන ලද, පඬු පැහැ කම්බලයෙන් වසන ලද, රන් අබරන සහිත, රන් දද සහිත, රන් දැලිනි පිළිසන්, විජයොත් රිය පාමොක් කොටැති, ඔබ සතු මේ රිය සුවාසූ දහස් කෙනෙක් වෙති. දේවයිනි, මෙහි ඡන්දය උපදවන්න, ජීවිතයෙහි අපේක්ෂාව කරන්න. දේවයිනි, මිණිරුවන පාමෙක් කොටැති මේ ඔබ සතු සුවාසූ දහසෙක් මිණිහු වෙති. දේවයිනි, මෙහි ඇල්ම දනවන්න, ජීවිතයෙහි අපේක්ෂාව කරන්න. දේවයිනි, ස්ත්‍රීරත්න ප්‍රමුඛ මේ ඔබගේ සුවාසූ දහසෙක් ස්ත්‍රීහු වෙති. දේවයිනි, මෙහි ඡන්දය දනවන්න, ජීවිතයෙහි අපේක්ෂාව කරන්න. දේවයිනි, ගැහැවිරුවන පාමොක් කොටැති මේ ඔබගේ ගැහැවියෝ සුවාසූ දහසෙක් වෙත්. දේවයිනි, මොවුන් කෙරෙහි ඡන්දය උපදවන්න., ජීවිතයෙහි අපේක්ෂාව කරන්න. දේවයිනි, පිරිනාරුවන් පාමොක් මේ ඔබගේ අනුගාමි වූ සුවාසූ දහසෙක් කැත්හු වෙති. දේවයිනි, මොවුන් කෙරෙහි ඡන්දය දනවන්න, ජීවිතයෙහි අපේක්ෂාව කරන්න. දේවයිනි, හැම කල්හි කිරි දොවාගත හැකි, රන් සැට්ටයෙන් සරසන ලද, ඔබ සතු මේ සුවාසූ දහසෙක් දෙන්නු වෙති. දේවයිනි, මෙහි ඡන්දය දනවන්න, ජීවිතයෙහි අපේක්ෂාව කරන්න. දේවයිනි, සියුම් කොමු පිළී ද සියුම් කපුපිළී ද සියුම් පටපිළී ද සියුම් කම්බල දැ යි සුවාසූ කෙළ දහසෙක් මේ ඔබ සතු පිළී ඇත. දේවයිනි, මෙහි ඡන්දය උපදවන්න, ජීවිතයෙහි අපේක්ෂාව කරන්න. දේවයිනි, මේ බත්සැළි සුවාසූ දහසක් වූ බතෙක් උදේ සවස දෙක්හි ම ඔබට එළැවෙයි. දේවයිනි, මෙහි ඡන්දය දනවන්න, ජීවිතයෙහි අපේක්ෂාව කරන්නැ” යි (සුභද්‍රා දේවී කිවු ය)."
            },
            {
                "type": "page-break",
                "text": "297"
            },
            {
                "format": 13,
                "text": "27. අනඳයෙනි, ඇය මෙසේ කී කල්හි මහසුදසුන් රජ සුභද්‍රා දේවියට මෙ බස් පැවැසී ය: “දේවීනි, තෙපි මට දික් කලක් ම ඉෂ්ට ප්‍රිය මනාප වචනයෙන් කතා කළහු ය. එහෙත් තෙපි මට මෙ පැසිම් සමයෙහි අනිෂ්ට අකාන්ත අප්‍රිය අමනාප වචනයෙන් කතා කරනු. “දේවයිනි, කෙසේ ඔබට කතා කරම් ද?” යි සුභද්‍රා දේවී විචාළා ය. “දේවීනි, මෙසේ මට කතා කරන්න: ‘දේවයිනි, ප්‍රිය මනාප සියලු දැයෙන් වෙන් වීම, බැහැරැ වීම, අන් පරිද්දෙකින් වීම ස්වභාවයෙක. දේවයිනි, ඔබ අපේක්ෂා ඇතිව නහමක් කලුරිය කෙරේ වා. අපේක්ෂා ඇත්තනුගේ කාල ක්‍රියාව දුක් ගෙන දෙයි, සාපේක්ෂ වුවහුගේ කාලක්‍රියාව ගර්හිත ය. දේවයිනි, කුශාවතී නගරය ප්‍රමුඛ කොටැති මේ ඔබගේ නුවර සුවාසූදහසෙක් ඇත. දේවයිනි, මෙහි ඇල්ම පියන්න. ජීවිතයෙහි අපේක්ෂාව නො කරන්න. දේවයිනි, දහම් පහා පාමොක් මේ පහා සුවාසූදහසෙක් ඔබට ඇත. මෙහි ඇල්ම පියන්න. ජීවිතයෙහි අපේක්ෂාව නො කරන්න. දේවයිනි, මහාව්‍යුහ කූටාගාර ප්‍රමුඛ මේ ඔබ සතු කූටාගාර සුවාසූ දහසෙක. මෙහි ඇල්ම පියන්න. ජීවිතයෙහි අපේක්ෂාව නහමක් කරන්න. දේවයිනි, රන්මුවා ද රිදීමුවා ද ඇත්දත්මුවා ද දැවමුවා ද, කොඳුපලස් අතුළ, සුදු එළුලොම්මුවා ඇතිරි අතුළ, ගනපුප් එළුලොම් ඇතිරි අතුළ, කෙහෙල්මුව සම්මුවා උතුම් පසතුරුණු අතුළ, උඩුවියන් සහිත, හිස්දෙර පාමුල යන දෙපසැ රතු කොට්ට ඇති සුවාසූදහසෙක් පළඟහු ඇත. දේවයිනි, මෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නහමක් කරන්න. දේවයිනි, රන් අබරණින් සැදුණු රන් දද ඇති රන් දැලින් පිළිසන් උපෝසථ ඇත්රජු පාමොක් කොටැති ඔබගේ මේ සුවාසූදහසෙක් ඇත්තු ඇත. දේවයිනි, මෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නහමක් කරන්න. දේවයිනි, රන් අබරණ පලන්, රන් දද සහිත, රන් දලින් පිළිසන්, වලාහක අස්රජු පාමොක් කොටැති ඔබගේ මේ සුවාසූදහසෙක් අස්සු වෙති. මොවුන් කෙරෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නහමක් කරන්න. දේවයිනි, සිංහසමින් වසන ලද, ව්‍යාඝ්‍රසමින් වසන ලද, දිවිසමින් වසන ලද, පාණ්ඩුකම්බලයෙන් වසන ලද, රන්අබරණින් සදන ලද, රන්දද සහිත රන් දැලින් පිළිසන් විජයොත්රිය පාමොක් සුවාසූදහසෙක් රිය ඔබට ඇත. දේවයිනි, මෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂා නො කරන්න. දේවයිනි, මිණිරුවන් පාමොක් මේ සුවාසූදසහසෙක් මිණිහූ ඔබට ඇත. මෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නො කරන්න. දේවයිනි, සුභද්‍රා දේවිය ප්‍රමුඛ සුවාසූදහසෙක් ස්ත්‍රීහු ඔබට ඇත. මෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නො කරන්න. දේවයිනි, ගැහැවිරුවන් පාමොක් සුවාසූ දහසෙක් ගැහැවිහු ඔබට ඇත. මෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නො කරන්න. දේවයිනි, පිරිනාරුවන් පාමොක් මේ අනුගාමී කැත්හු සුවාසූදහසෙක් ඔබට ඇත. මෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නහමක් කරන්න. දේවයිනි, හැම කල්හි දෙවියා හැකි කිරි ඇති රන්සැට්ට ඇඟැ ලැවුණු මේ සුවාසූදහසෙක් දෙන්නු ඔබට ඇත. මෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නො කරන්න. දේවයිනි, සියුම් කොමුපිළි ද සියුම් කපුපිළි ද සියුම් පටපිළි ද සම්බන්ධ මේ සුවහස් කෙළක් පිළි ඔබට ඇත. මෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නො කරන්නැ යි කියන්නා” යි මහසුදසුන් රජ කී ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "299"
            },
            {
                "format": 13,
                "text": "28. අනඳයෙනි, රජු මෙසේ කී කල්හි සුභද්‍රා දේවි හැඬුවා ය, කඳුළු හෙළුවා ය. අනඳයෙනි, ඉක්බිති සුභද්‍රා දේවි කඳුළු පිසැදමා මහසුදසුන් රජුට මෙසේ කිවු ය:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“දේවයිනි, ප්‍රිය මනාප හැම දෑ කෙරෙන් නානාභාවය විනාභාවය අන්‍යථාභාවය වේ. දේවයිනි, ඔබ අපේක්ෂා ඇති ව නහමක් කලුරිය කරන්න. සාපේක්ෂයාගේ කාලක්‍රියාව දුක් එළවයි. සාපේක්ෂයාගේ කාලක්‍රියාව ගර්භිත ද වේ. දේවයිනි, කුශාවති රාජධානිප්‍රමුඛ මේ ඔබේ නුවර සුවාසූදහසෙක් ඇත. දේවයිනි, මෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නො කරන්න. දේවයිනි, ධර්මප්‍රාසාදප්‍රමුඛ ඔබ සතු මේ ප්‍රාසාද සුවාසූදහසෙක. දේවයිනි, මෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නො කරන්න. දේවයිනි, මහාව්‍යුහ කූටාගාර ප්‍රමුඛ ඔබේ මේ කූටාගාර සුවාසූදහසෙක. මෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නහමක් කරන්න. දේවයිනි, ස්වර්ණමය ද රජතමය ද දන්තමය ද සාරමය ද වූ, කොඳුපලස් අතුළ, සුදු එළුලොම්මුවා ඇතිරි අතුළා කෙහෙල් මුව සමින් කළ උතුම් පසතුරුණු ඇති, උඩුවියන් සහිත, හිස්දොර පාමුල යන දෙපසැ රතු කන්වයින් තබන ලද ඔබගේ මේ පළඟ සුවසූදාහසෙකි. මෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නො කරන්න. දේවයිනි, පලන් රන් අබරණ ඇති රන් දද සහිත රන්දැලින් පිළිසන්, උපෝසථ ඇත් රජ ප්‍රමුඛ ඔබ සතු මේ සුවාසූදහසෙක් ඇත්තු ඇත. මොවුන් කෙරෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නහමක් කරන්න. දේවයිනි, රන්අබරණ පලන් රන්දද සහිත, රන්දැලින් පිළිසන් වලාහක අස්රජ පාමොක් කොටැති, මේ ඔබ සතු සුවාසූ දහසෙක් අස්සු ඇත. මොවුන් කෙරෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නහමක් කරන්න. දේවයිනි, සිහසමින් වැසූ, වගසමින් වැසූ, දිවිසමින් වැසූ, පාණ්ඩුකම්බලයෙන් වැසු, රන්අබරණින් සැදුණු, රන්දද සහිත, රන්දැලින් පිළිසන් විජයොත්රිය පාමොක් ඔබ සතු මේ රිය සුවායූදහසෙක. දේවයිනි, මෙහි ඇල්ම පියන්න, ජිවිතයෙහි අපේක්ෂාව නො කරන්න. දේවයිනි, මිණිරුවන් පාමොක් ඔබ සතු මේ සුවාසූදහසෙක් මිණිරුවන්හු ඇත. මෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නො කරන්න. දේවයිනි, ස්ත්‍රීරත්නප්‍රමුඛ ඔබ සතු මේ සුවාසූ දහසෙක් ස්ත්‍රීහු ය. දේවයිනි, මොවුන් කෙරෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නො කරන්න. දේවයිනි, ගැහැවිරුවන් පාමොක් ඔබ සතු මේ ගැහැවිහු සුවාසූදහසෙක. මොවුන් කෙරෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නො කරන්න, දේවයිනි, පිරිනාරුවන් පාමොක් ඔබගේ මේ අනුගාමි සුවාසූදහසෙක් කැත්හු ය. මොවුන් කෙරෙහි ඇල්ම පියන්න, ජීවිතයෙහි අපේක්ෂාව නො කරන්න. දේවයිනි, හැම දා ම දෙවියැ හැකි කිරි ඇති, රන් සැට්ට ඇඟැ ලැවුණු, මේ ඔබගේ සුවාසූදහසෙක් දෙන්නු ඇත. මොවුන් කෙරෙහි ඇල්ම පියන්න, ජීවිතය කෙරෙහි අපේක්ෂාව නො කරන්න. දේවයිනි, සියුම් කොමුපිළි ද සියුම් කපු පිළි ද සියුම් පටපිළි ද සියුම් කම්බල ද සම්බන්ධ ඔබ සතු සුවාසූ කෙළ දහසෙක් පිළී ඇත. දේවයිනි, මෙහි ඇල්ම පියන්න, ජීවිතය කෙරෙහි අපේක්ෂාව නො කරන්නැ” යනු යැ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "301"
            },
            {
                "format": 21,
                "text": "බඹලොව් යෑම",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "29. අනඳයෙනි, ඉක්බිති නොබෝ කලෙකින් මහ සුදසුන් රජ කලුරිය කෙළේ ය. අනඳයෙනි, මනහර බොජුනක් වැළැඳු ගැහැවියකුට හෝ ගැහැවි පුතක්හට යම්සේ බත්මතය වේ ද මහසුදසුන් රජුට ද එබඳු ම වූ මරණය අවසන් කොට ඇති වේදනාවෙක් විය. අනඳයෙනි, කලුරිය කළාවූ ද මහසුදසුන් රජ බඹලොවැ උපනි. අනඳයෙනි, මහසුදසුන් රජ සුවාසූදහසක් හවුරුදු කුමරකෙළි කෙළීය. සුවාසූදහසක් හවුරුදු යුවරජය කැරැවිය. සුවාසූදහසක් හවුරුදු රජය කැරැවිය. ගිහි ව මැ සුවාසූ දහසක් හවුරුදු දහම් පායෙහි බඹසර හසළේ ය. හේ සතර බඹවෙහෙර බවා කාබුන් මරණින් මතු බඹලෝ ගියේ විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "30. අනඳයෙනි, ‘එ සමයෙහි අනෙකෙක් මහසුදසුන් රජ වී’ යැ යි (තොපට මෙ බඳු සිතක්) වියැ හැක්ක. අනඳයෙනි, එය එසේ නො දත යුතු. එ සමයෙහි මම මහසුදසුන් රජ වීමි. කුශාවතී රාජධානිප්‍රමුඛ ඒ සුවාසූදහසෙක් නගරයෝ මගේ ය. ධර්මප්‍රාසාදප්‍රමුඛ සුවාසූදහසෙක් ප්‍රාසාදයෝ මගේ ය. මහාව්‍යුහකූටාගාරප්‍රමුඛ සුවාසූදහසෙක් කුළුගෙවල් මගේ ය. ස්වර්ණමය ද රජතමය ද දන්තමය ද සාරමය ද වූ කොඳුපලස් අතුළ සුදුඑළුලොමින් කළ ඇතිරි අතුළ, ගනපුප් එළුලොම් ඇතිරි අතුළ, උතුම් කෙසෙල්මුව සමින් කළ පසතුරුණු ඇති, උඩුවියන් සහිත, ඉස්දොර පාමුල යන දෙපසැ රතුකොට්ට තැබු ඒ සුවාසූදහසෙක් පළඟහු මගේ ය. රන් අබරණින් සැදි, රන්දද සහිත, රන්දැලින් පිළිසන් උපෝසථ ඇත් රජ ප්‍රමුඛ ඒ සුවාසූදහසෙක් ඇත්තු මගේ ය. රන් අබරණින් සැදි, රන්දද සහිත, රන්දැලින් පිළිසන් වලාහක අස්රජ ප්‍රමුඛ ඒ සුවාසූදහසෙක් අස්සු මගේ ය. සීසමින් සන්, වගසමින් සන්, දිවිසමින් සන්, පඬුඇඹුලින් සන්, රනබරණින් සැදි රන්දදැති, හෙම්දැලින් පිළිසන් විජයොත්රියපාමොක් ඒ සුවාසූදහසෙක් රියහු මගේ ය. මිණිරුවන්පාමොක් ඒ සුවාසූදහසෙක් මිණිහු මගේ ය. සුභද්‍රාදේවීප්‍රමුඛ සුවාසූදහසෙක් ඒ ස්ත්‍රීහු මා අයත් වූහ. ගැහැවිරුවන් පාමෙක් ඒ සුවාසූ දහසෙක් ගැහැවියෝ මා සතු වූහ. පරිණායකරත්න ප්‍රමුඛ අනුයන්තෘ වූ ඒ සුවාසූදහසෙක් කැත්හු මගේ ය. හැම දා දෙවියැකි කිරි ඇති රන්සැට්ට ඇඟ ලැවුණු ඒ සුවාසූ දහසෙක් දෙන්නු මා සතු වූහ. සියුම් කොමුපිළි ද සියුම් කපුපිළි ද සියුම් පටපිළි ද සියුම් කම්බල ද වූ සුවාසූ පිළි කෙළ දහස මා සතු විය. මට උදේ සවස ඒ තලි සුවාසූ දහසක් වූ බතෙක් එළැවිණ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "303"
            },
            {
                "format": 13,
                "text": "31. අනඳයෙනි, එ සමයෙහි කුශාවතී රාජධානිය වූ යම් නගරයෙක විසීම් ද, ඒ නුවර සුවාසූ දහසින් මේ එක් නගරයේ ම මම් විසීමි. (සෙසුනුවර වලැ දූපුත් ආදිහු වූසූහ.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, ඒ සුවාසූදහසක් ප්‍රාසාද අතුරෙන් යම් ධර්මනම් ප්‍රාසාදයෙක් වී ද මම් එහි ම විසීමි (සෙසු පහයන්හි අඹුදරු ආදිහු වුසූහ).",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, ඒ සුවාසූදහසක් කුළුගෙවලින් යම් මහාව්‍යුහ නම් කුළුගෙයෙක් වී ද, මම් එහි විසීමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, ඒ පළඟ සුවාසූදහසින්, රන්මුවා හෝ රිදීමුවා හෝ ඇත්දත්මුවා හෝ දැවමුවා හෝ යම් පළඟෙක් වී ද, ඒ එකක් මම් පරිභෝග කෙළෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, ඒ ඇතුන් සුවාසූදහසින්, උපෝසථ නම් යම් ඇත් රජෙක් වී ද, උහු ම මම් නැංගෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, ඒ අසුන් සුවාසූදහසින්, යම් වලාහක නම් අස්රජෙක් වී ද, උහු ම මම් නැංගෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, ඒ රිය සුවාසූදහසින් යම් විජයොත් නම් රියෙක් වී ද, එය ම මම නැංගෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, ඒ සුවාසූදහසක් ස්ත්‍රීන් අතුරෙන්, කැත්කුලැ වූ හෝ වෙළෙඳ කුලැ වූ හෝ යම් එකියක් මට උවටන් කළා ද, ඒ එක් ස්ත්‍රියක් ම විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, ඒ සුවාසූ පිළි කෙළ දහසින් සියුම් කොමුපිළියක් හෝ සියුම් කපුපිළියක් හෝ සියුම් පටපිළියක් හෝ සියුම් කම්බලයක් හෝ ඒ එක් පිළියුවලක් ම මම් හැන්දෙමි, පෙරැවීමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අනඳයෙනි, ඒ සුවාසූ බත්සැළි දහසින් යමෙකින් නැලියක් පරම කොටැති (නැලියකට නොවැඩි) බතකුත් එයට පමණ වූ සූපත් වැළැඳීම් නම් ඒ එක් බත් තලියෙක් ම විය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "305"
            },
            {
                "format": 13,
                "text": "32. බලවු අනඳයෙනි, ඒ සියලු සඛරහු ඉකුත් වූහ, නිරුද්ධ වූහ, පෙරැළුණහ. අනඳයෙනි, මෙසේ සඛරහු අනිත්‍ය ම ය, අනඳයෙනි, සඛරහු මෙසේ අධ්‍රැව ම ය. අනඳයෙනි, මෙසේ සඛරහු ආශ්වාස විරහිත ම ය. අනඳයෙනි, සියලු සඛර දහමුන් කෙරෙහි කලකිරෙන්නට ඉතා ම සුදුසු ය, නො ඇලෙන්නට ඉතා ම සුදුසු ය, එයින් මිදෙන්නට ඉතා ම සුදුසු ය, අනඳයෙනි, සවරක් ම මෙ පෙදෙසෙහි සිරුර බහා ලූයෙමි යි දනිමි. ඒ ද ධාර්මික වූ ධර්මරාජ වූ සයුරුහිම් සිවුමහදිවයිනට අධිපති වූ, පසමිතුරන් දිනු, දනවුහි තහවුරු බවට පැමිණි, සත්රුවනින් සමන්විත සක්විති රජෙක් වැ ම කෙළෙමි. මේ සත්වැනි ශරීරනිඃක්ෂේපය යැ. අනඳයෙනි, තථාගතයෝ දෙවියන් සහිත මරුන් සහිත බඹුන් සහිත ලොවෙහි, මහණබමුණන් සහිත දෙව්මිනිසුන් සහිත සත්වප්‍රජායෙහි යම් තැනෙක අටවැනිවරෙක සිරුර බහාලන්නෝ ද, එසේ වූ තැනක් මම් නො ම දකිමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මෙය වදාරා, සුගතයන් වහන්සේ නැවැත ගාථාබන්ධන විසින් අනෙකක් වූ මෙය වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "format": 14,
                "text": "“ඒකාන්තයෙන් සංස්කාරයෝ අනිත්‍යහ.\nඉපැත්ම වැනැස්ම සබා කොටැත්තාහ.\nඉපිදැ නැසෙත්.\nඒ සංස්කාරයන්ගේ සංහිඳීම සුව එළවන්නේ යි.”",
                "type": "gatha"
            },
            {
                "format": 16,
                "text": "සතර වැනි මහසුදසුන් සුතුර නිමියේ ය.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ]
    }
]