{
    "filename": "dn-2-10",
    "bookId": 11,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 504,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10.",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "පායාසිසුත්තං",
                        "level": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං මෙ සුතං: එකං සමයං ආයස්මා කුමාරකස්සපො කොසලෙසු චාරිකං චරමානො මහතා භික්ඛුසඞ්ඝෙන සද්ධිං පඤ්චමත්තෙහි භික්ඛුසතෙහි යෙන සෙතබ්යා නාම කොසලානං නගරං තදවසරි. තත්ර සුදං ආයස්මා කුමාරකස්සපො සෙතබ්යායං විහරති උත්තරෙන සෙතබ්යං සිංසපාවනෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන පායාසිරාජඤ්ඤො සෙතබ්යං අජ්ඣාවසති සත්තුස්සදං සතිණකට්ඨොදකං සධඤ්ඤං රාජභොග්ගං රඤ්ඤා පසෙනදිනා කොසලෙන දින්නං රාජදායං බ්රහ්මදෙය්යං."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන පායාසිස්ස රාජඤ්ඤස්ස එවරූපං පාපකං දිට්ඨිගතං උප්පන්නං හොති “ඉති පි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. අස්සොසුං ඛො සෙතබ්යකා බ්රාහ්මණගහපතිකා: “සමණො ඛලු භො කුමාරකස්සපො සමණස්ස ගොතමස්ස සාවකො කොසලෙසු චාරිකං චරමානො මහතා භික්ඛුසඞ්ඝෙන සද්ධිං පඤ්චමත්තෙහි භික්ඛුසතෙහි සෙතබ්යං අනුප්පත්තො සෙතබ්යායං විහරති උත්තරෙන සෙතබ්යං සිංසපාවනෙ. තං ඛො පන භවන්තං කුමාරකස්සපං එවං කල්යාණො කිත්තිසද්දො අබ්භුග්ගතො: පණ්ඩිතො බ්යත්තො මෙධාවී බහුස්සුතො චිත්තකථී කල්යාණපටිභානො වුද්ධො චෙව අරහා ච. සාධු ඛො පන තථාරූපානං අරහතං දස්සනං හොතී”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10.",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "පායාසි රාජන්‍ය සූත්‍රය",
                        "level": 3
                    },
                    {
                        "format": 13,
                        "text": "මා විසින් මෙසේ අසන ලදී: එක් සමයෙක්හි කුමර කසුප් මහ තෙරණුවෝ මහණුන් පන්සියක් පමණ වූ මහත් මහණ මුළුවක් කැටු වැ කොසොල් රටැ සැරි සරනුවෝ, කොසොල් රැටියන්ගේ සේතව්‍යා නම නුවරට වැඩියාහ. කුමරකසුප් මහ තෙරණුවෝ එහි සේතව්‍යා නුවරට නොදුරැ උතුරු දිගැ සිංසපා වනයෙහි (ඇට්ටේරිය කැලැයෙහි) වැඩ වෙසෙති.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එ සමයෙහි වනාහි පායාසි නම් රාජන්‍ය (අබිසෙස් නොලත් රජ) තෙම බහුජනාකීර්ණ වූ, තණ දඬු දිය යන මෙයින් යුක්ත වූ, බොහෝ ධාන්‍ය ඇති, රජුගෙන් ලත් තමාගේ පරිභොග වස්තුව වූ, රජුහු ගේ දායාද්‍යය වූ, පසේනදී කොසොල් රජුහු දුන් ශ්‍රෙෂ්ඨ ත්‍යාගය වූ සේතව්‍යා නගරයෙහි වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එකලැ පායාසී රාජන්‍යයාහට “මේ කරුණින් පරලොවෙක් නැත, මෙසේත් මෙයින් සැවැ පරලොවැ උපදනා සත් කෙනෙක් නැත, මෙසේත් මොනොවට කළ හෝ නපුරු සේ කළ කර්මයනට ඵල විපාක නැතැ” යි මෙබඳු වූ ලාමක දෘෂ්ටියෙක් උපන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "2. සේතව්‍යා නුවරැ වැසි බමුණෝ ද ගැහැවියෝ ද (රටෙහි පැතිරැ පැවැති) මතු දැක්වෙන කථාව ඇසූහ: “භවත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේගේ ශ්‍රාවක වූ කුමරකසුප් (කුමාරකාශ්‍යප) මහණ වහන්දෑ මහණුන් පන්සියයක් පමණ වූ මහත් මහණ මුළුවක් කැටුවැ කොසොල් රටැ සැරි සරනුවෝ, කොසොල් රැටියන්ගේ සේතව්‍යා නුවරට වැඩියාහු, එ නුවර උතුරු දිගැ නුවරට නොදුරෙහි වූ සිංසපා වනයෙහි වැඩ වෙසෙති, ඒ භවත් කුමර කසුප් වහන් දෑ පිළිබඳ වැ ‘මොහු පණ්ඩිත හ, ව්‍යක්ත හ, ප්‍රඥාවත් හ, බහුශ්‍රැත හ, චිත්‍රකථි හ (විසිතුරු කථා ඇත්තාහ), මනා වැටැහෙන නුවණ ඇත්තාහ, නුවණින් වැඩී සිටියාහු ද රහත්හු ද වෙති. එබඳු රහතුන් දැක්ම වූ කලී වැඩ සිදු කරන්නෙකැ’ යි මෙසේ වූ උතුම් කීර්ති ඝෝෂයෙක් උස් වැ නැංගේ ය” යනු යැ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 506,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "3. අථ ඛො සෙතබ්යකා බ්රාහ්මණගහපතිකා සෙතබ්යාය නික්ඛමිත්වා සඞ්ඝසඞ්ඝී ගණීභූතා උත්තරෙන මුඛා ගච්ඡන්ති යෙන සිංසපාවනං. තෙන ඛො පන සමයෙන පායාසි රාජඤ්ඤො උපරිපාසාදෙ දිවාසෙය්යං උපගතො හොති. අද්දසා ඛො පායාසි රාජඤ්ඤො සෙතබ්යකෙ බ්රාහ්මණගහපතිකෙ සෙතබ්යාය නික්ඛමිත්වා සඞ්ඝසඞ්ඝී ගණීභූතෙ උත්තරෙන මුඛෙ ගච්ඡන්තෙ යෙන සිංසපාවනං. දිස්වා ඛත්තං ආමන්තෙසි: කින්නු ඛො භො ඛත්තෙ සෙතබ්යකා බ්රාහ්මණගහපතිකා සෙතබ්යාය නික්ඛමිත්වා සඞ්ඝසඞ්ඝී ගණීභූතා උත්තරෙන මුඛා ගච්ඡන්ති යෙන සිංසපාවනන්ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "“අත්ථි ඛො භො සමණො කුමාරකස්සපො සමණස්ස ගොතමස්ස සාවකො කොසලෙසු චාරිකං චරමානො මහතා භික්ඛුසඞ්ඝෙන සද්ධිං පඤ්චමත්තෙහි භික්ඛුසතෙහි සෙතබ්යං අනුප්පත්තො, සෙතබ්යායං විහරති උත්තරෙන සෙතබ්යං සිංසපාවනෙ. තං ඛො පන භවන්තං කුමාරකස්සපං එවං කල්යාණො කිත්තිසද්දො අබ්භුග්ගතො: පණ්ඩිතො බ්යත්තො මෙධාවී බහුස්සුතො චිත්තකථී කල්යාණපටිභානො වුද්ධො චෙව අරහා චාති. තමෙනං තෙ භවන්තං කුමාරකස්සපං දස්සනාය උපසඞ්කමන්තී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තෙන හි භො ඛත්තෙ යෙන සෙතබ්යකා බ්රාහ්මණගහපතිකා තෙනුපසඞ්කම. උපසඞ්කමිත්වා සෙතබ්යකෙ බ්රාහ්මණගහපතිකෙ එවං වදෙහි: පායාසි භො රාජඤ්ඤො එවමාහ’ ආගමෙන්තු කිර භවන්තො, පායාසි පි රාජඤ්ඤො සමණං කුමාරකස්සපං දස්සනාය උපසඞ්කමිස්සති පුරා සමණො කුමාරකස්සපො සෙතබ්යකෙ බ්රාහ්මණගහපතිකෙ බාලෙ අබ්යත්තෙ සඤ්ඤාපෙති: ඉතිපි අත්ථි පරො ලොකො, අත්ථි සත්තා ඔපපාතිකා, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති. නත්ථි හි භො ඛත්තෙ පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො”ති. ‘එවං භො’ති ඛො සො ඛත්තා පායාසිස්ස රාජඤ්ඤස්ස පටිස්සුත්වා යෙන සෙතබ්යකා බ්රාහ්මණගහපතිකා තෙනුපසඞ්කමි, උපසඞ්කමිත්වා සෙතබ්යකෙ බ්රාහ්මණගහපතිකෙ එතදවොච: පායාසි භො රාජඤ්ඤො එවමාහ: ආගමෙන්තු කිර භවන්තො, පායාසි පි රාජඤ්ඤො සමණං කුමාරකස්සපං දස්සනාය උපසඞ්කමිස්සතී”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "3. එ කල්හි වනාහි සේතව්‍යා නුවර වැසි බමුණෝ ද ගැහැවියෝ ද සේතව්‍යායෙන් නික්මැ බොහෝ බොහෝ වැ රැස් වූවාහු, එකි එකී පැත්තෙහි මුළු මුළු වැ නුවරින් පිටත්හි දී මහ මුළුවෙක් වැ එකතු වූවාහු, උතුරු දිගට මුහුණු ලා සිංසපාවනය දෙසට යන්නාහු වෙත්. එ සමයෙහි වූකලී පායාසි රාජන්‍ය තෙම සිය පහයෙහි උඩු මහල් තලයෙහි දව යහනට පැමිණියේ වෙයි. හේ (කවළියෙන් බලනුයේ) සේතව්‍යායෙන් නික් මැ බොහෝ බොහෝ වී රැස් වැ, එකි එකී පස්හි මුළු මුළු වැ නුවරින් පිටතැ දී මහ මුළුවෙක් වැ එකතු වැ, උතුරු දෙසට මුහුණූ ලා සිංසපාවනය දෙසට යන සේතව්‍යවාසී බමුණන් ද ගැහැවියන් ද දුටුයේ ම ය. දැක ක්ෂත්තෘහු බණවා, ‘භවත් ක්ෂත්තෘව, සේතව්‍යාවාසී බමුණෝත් ගැහැවියෝත් සේතව්‍යායන් නික්මැ, බොහෝ බොහෝ වැ රැස් වැ එකි එකී පසැ මුළු මුළු වැ නුවරින් පිටත්හි දී මහ මුළුවෙක වැ එකතු වැ, උතුරු දිගට මුහුණු ලා සිංසපාවනය දෙසට කවර හෙයින් යෙත් දැ?” යි විචාළේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“භවත, කාරණයයෙක් ඇත. මහණ ගොයුමන් වහන්සේගේ සවු වූ කුමර කසුප් වහන් දෑ මහණුන් පන්සියක් පමණ වූ මහත් මහණ මුළුවක් කැටු වැ කොසොල් රටැ සැරිසනුවෝ කොසොල් රැටියන්ගේ සේතව්‍යා නම් නුවරට වැඩියාහු, සේතව්‍යාට උතුරු දිගැ නුවරට නොදුරු තැනැ සිංසපා වනයෙහි වැඩ වෙසෙති. ‘ඔහු පණ්ඩිත හ, ව්‍යක්ත හ, ප්‍රඥාවත් හ බහුශ්‍රැත හ, චිත්‍රකථි හ, කල්‍යාණප්‍රතිභාන ඇතියාහු, නුවණින් වැඩී සිටියෝ ද රහත් කෙනක් ද වෙති’ යි ඒ භවත් කුමර කසුප් වහන් දෑ පිළිබඳ වැ උතුම් වූ කීර්ති ඝෝෂයෙක් ඉතා උස් වැ නැංගේ වෙයි. ඔහු ඒ භවත් කුමරකසුප් වහන්දෑ දක්නට එහි යෙත්” යැ යි ක්ෂත්තෘ කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“එසේ වී නම් භවත් ක්ෂත්තෘව, සේත්‍යාවාසී ඒ බමුණන් ද ගැහැවියන් ද කරා එළැඹෙව. එළැඹැ ඔවුනට, “භවත්හු ඉවසත් වා (මා එන තුරු බලත් වා), කුමර කසුප් මහණ සේතව්‍යාවාසී වූ අඥාන අව්‍යක්ත බමුණනට ද ගැහැවියනට ද “මෙසේ මෙසේ පර ලොවෙක් ඇත, සැව පර ලොවැ උපදනා සත්තු ඇත, සුකෘත දුෂ්කෘත කර්මයනට ඵල විපාක ඇතැ’යි ගිවිස්නට පෙරාතුව ම පායාසි රාජන්‍ය ද කුමරකසුප් මහණහු දක්නට එළැඹෙන්නේ යැ’ යි මෙසේ කියව, භවත් ක්ෂත්තෘව, පර ලොවෙක් නැත, උපපාදුක (මෙයින් සැව පර ලොවැ උපදනා) සත්හු නැත. සුකෘත දුෂ්කෘත කර්මයනට ඵල විපාක නැතැ” යි පායාසි රාජන්‍ය කී ය. ‘එසේ යැ පින්වත’ යි ම එ ක්ෂත්තෘ තෙම පායාසී රජන්‍යයාට පිළිවදන් දී, සේත්‍යාවාසී ඒ බමුණන් ද ගැහැවියන් ද කරා එළැඹියේ ය. එළැඹැ ඔවුන් බණවා, “භවත්හු මඳක් ඉවසත්වා, පායාසී රාජන්‍ය ද කුමර කසුප් මහණහු දකින්නට එළැඹෙන්නේ යැ” යි සැළ කෙළේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 508,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "4. අථ ඛො පායාසි රාජඤ්ඤො සෙතබ්යකෙහි බ්රාහ්මණගහපතිකෙහි පරිවුතො යෙන සිංසපාවනං යෙනායස්මා කුමාරකස්සපො තෙනුපසඞ්කමි, උපසඞ්කමිත්වා ආයස්මතා කුමාරකස්සපෙන සද්ධිං සම්මොදි, සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. සෙතබ්යකාපි ඛො බ්රාහ්මණගහපතිකා අප්පෙකච්චෙ ආයස්මන්තං කුමාරකස්සපං අභිවාදෙත්වා එකමන්තං නිසීදිංසු, අප්පෙකච්චෙ ආයස්මතා කුමාරකස්සපෙන සද්ධිං සම්මොදිංසු, සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදිංසු. අප්පෙකච්චෙ යෙනායස්මා කුමාරකස්සපො තෙනඤ්ජලිං පනාමෙත්වා එකමන්තං නිසීදිංසු. අප්පෙකච්චෙ නාමගොත්තං සාවෙත්වා එකමන්තං නිසීදිංසු. අප්පෙකච්චෙ තුණ්හීභූතා එකමන්තං නිසීදිංසු."
                    },
                    {
                        "type": "paragraph",
                        "text": "5. එකමන්තං නිසින්නො ඛො පායාසි රාජඤ්ඤො ආයස්මන්තං කුමාරකස්සපං එතදවොච: “අහං හි භො කස්සප එවංවාදී එවංදිට්ඨිං ‘ඉති පි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නාහං රාජඤ්ඤ එවංවාදිං එවංදිට්ඨිං අද්දසං වා අස්සොසිං වා. කථ හි නාම එවං වදෙය්ය: ‘ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති. තෙන හි රාජඤ්ඤ තඤ්ඤෙවෙත්ථ පටිපුච්ඡස්සාමි, යථා තෙ ඛමෙය්ය, තථා නං බ්යාකරෙය්යාසි. තං කිම්මඤ්ඤසි රාජඤ්ඤ ඉමෙ චන්දිමසූරියා ඉමස්මිං වා ලොකෙ පරස්මිං වා, දෙවා වා තෙ මනුස්සා වා ති?’"
                    },
                    {
                        "type": "paragraph",
                        "text": "“ඉමෙ භො කස්සප චන්දිමසූරියා පරස්මිං ලොකෙ න ඉමස්මිං, දෙවා තෙ න මනුස්සා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“ඉමිනා පි ඛො තෙ රාජඤ්ඤ පරියායෙන එවං හොතු: ඉතිපි අත්ථි පරො ලොකො, අත්ථි සත්තා ඔපපාතිකා, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“කිඤ්චාපි භවං කස්සපො එවමාහ, අථ ඛො එවං මෙ එත්ථ හොති: ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "4. ඉක්බිති පායාසී රාජන්‍ය තෙම සේතව්‍යාවාසී බමුණන් ද ගැහාවියන් ද විසින් පිරිවැරුණේ, සිංසපාවනයට කුමරකසුප් මහතෙරුන් වැඩ ඉන්න තැනට පැමිණියේ ය. පැමිණ, කුමරකසුප් මහ තෙරුන් හා සතුටු විය, සතුටට කරුණූ වූ සිතැ රැඳවියැ යුතු වූ කථා නිමවා එක් පසෙක හිඳගත්තේ ය. සේතව්‍යා වාසී බමුණෝත් ගැහැවියෝත් කෙනෙක් කුමරකසුප් තෙරුන් ආදරයෙන් වැඳ එක් පසෙක හිඳ ගත්හ, ඇතැම් කෙනෙක් කුමරකසුප් මහ තෙරුන් හා සතුටු වූහ. සතුටට කරුණු වූ සිතැ රැඳවිය යුතු වූ කථා කොට නිමවා එක් පසෙක හිඳ ගත්හ. එක්තරා කෙනෙක් කුමරකසුප් මහ තෙරුන දිසාවට දොහොත් නමා වැඳ එක් පසෙක හිඳ ගත්හ, තව ද කෙනක් තමන් නම් ගොත් අස්වා එක් පෙසක හිඳ ගත්හ, සමහර දෙනෙක් නිහඬ වැ පසෙක හිඳගත්හ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "5. එක් පසෙක හුන් පායාසී රාජන්‍ය තෙම කුමරකසුප් මහතෙරුන් බණවා, “භවත් කාශ්‍යපයන් වහන්ස, මම් වනාහි ‘මෙසේත් මෙසේත් පර ලොවෙක් නැත, උපපාදුක (මෙයින් සැව පර ලොවැ උපදනා) සත්හු නැත, කුශලාකුශල කර්මයන් ගේ ඵල විපාක නැතැ’ යි මෙසේ වූ වාද ඇතියෙම් මෙසේ වූ දෘෂ්ටි ඇතියෙම් වෙමි” යි කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “රාජන්‍යයෙනි, මෙබඳු වාද ඇති, මෙබඳු දෘෂ්ටි ඇති එකකු නො ම දිටිමි, නො ද ඇසීමි. ‘මෙසේත් මෙසේත් පර ලොවෙක් නැතැ යි, උපපාදුක සත්තු නැතැ යි, කුශලාකුශල කර්මයන්ගේ ඵල විපාක නැතැ’ යි කවර කරුණෙකින් මෙසේ කියවු ද? එසේ නමේ රාජන්‍යයෙනි, මෙහි ඔබ ම පිළිවිසිමි. යම් සේ ඔබට රිසියෙන්නේ ද, එසේ එය විසඳන්න. රාජන්‍යයෙනි, ඒ කිමැ යි සිතවු ද? මේ සඳ දෙව් පුත් ද හිරු දෙව් පුත් ද යන දෙදෙනා මෙ ලොව්හි වෙත් ද? නැත හොත් පරලොව්හි වෙත් ද? ඔහු දෙවියෝ ද? නැත හොත් මිනිස්සු ද?",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසී - “කාශ්‍යපයන් වහන්ස, මේ සඳ දෙව්පුත් හිරු දෙව්පුත් දෙදෙන පරලොව්හි වෙත්. මෙ මිනිස් ලොව්හි නො වෙත්. ඔහු දෙවියෝ ය. මිනිස්සු නො වෙත්.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමාරකසුප් - “රාජන්‍යයෙනි, මෙ කරුණිනුත් ‘මෙසේත් මෙසේත් පර ලොවෙක් ඇත, උපපාදුක සත්වයෝ ඇත, කුශලාකුශල කර්මයන් ගේ ඵල විපාක ඇතැ’ ඔබට මෙබඳු සිතෙක් වේ වා.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්සේ මෙසේ වදාරතත් මට මෙහි, ‘මෙසේ මෙසේත් පර ලොවෙක් නැත, උපපාදුක සත්වයෝ නැත, කුශලාකුශල කර්මයන්ගේ ඵල විපාක නැතැ’ යි මෙබඳු සිතෙක් වෙයි.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 510,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "6. අත්ථි පන රාජඤ්ඤ පරියායො යෙන තෙ පරියායෙන එවං හොති: ‘ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "“අත්ථි භො කස්සප පරියායො යෙන මෙ පරියායෙන එවං හොති: ‘ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යථා කථං විය රාජඤ්ඤා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“ඉධ මෙ භො කස්සප මිත්තාමච්චා ඤාතිසාලොහිතා පාණාතිපාතී අදින්නාදායී කාමෙසුමිච්ඡාචාරී මුසාවාදී පිසුණවාචා ඵරුසවාචා සම්ඵප්පලාපී අභිජ්ඣාලූ බ්යාපන්නචිත්තා මිච්ඡාදිට්ඨී. තෙ අපරෙන සමයෙන ආබාධිකා හොන්ති දුක්ඛිතා බාළ්හගිලානා. යදාහං ජානාමි න දානි මෙ ඉමම්හා ආබාධා වුට්ඨහිස්සන්තී’ති ත්යාහං උපසඞ්කමිත්වා එවං වදාමි: සන්ති ඛො භො එකෙ සමණබ්රාහ්මණා එවංවාදිනො එවංදිට්ඨිනො යෙ තෙ පාණාතිපාතී අදින්නාදායී කාමෙසුමිච්ඡාචාරී මුසාවාදී පිසුනවාචා ඵරුසවාචා සම්ඵප්පලාපී අභිජ්ඣාලූ බ්යාපන්නචිත්තා මිච්ඡාදිට්ඨී. තෙ කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජිස්සන්තීති. භවන්තො ඛො පාණාතිපාතී අදින්නාදායී කාමෙසුමිච්ඡාචාරී මුසාවාදී පිසුණවාචා ඵරුසවාචා සම්ඵප්පලාපී අභිජ්ඣාලූ බ්යාපන්නචිත්තා මිච්ඡාදිට්ඨී. සචෙ තෙසං භවතං සමණබ්රාහ්මණානං සච්චං වචනං, භවන්තො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජිස්සන්ති. සචෙ භො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජෙය්යාථ, යෙන මෙ ආගන්ත්වා ආරොචෙය්යාථ: ‘ඉති පි අත්ථි පරො ලොකො, අත්ථි සත්තා ඔපපාතිකා, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති. භවන්තො ඛො පන මෙ සද්ධායිකා පච්චයිකා, යං භවන්තෙහි දිට්ඨං, යථා සාමං දිට්ඨං එවමෙතං භවිස්සතී’ති. තෙ මෙ ‘සාධූ’ති පටිස්සුත්වා නෙව ආගන්ත්වා ආරොචෙන්ති, න පන දූතං පහිණන්ති. අයම්පි ඛො භො කස්සප පරියායො යෙන මෙ පරියායෙන එවං හොති: ‘ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති.”"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "6. කුමරකසුප් - “රාජන්‍යයෙනි, ‘මෙසේත් මෙසේත් පර ලොවෙක් නැත, උපපාදුක සත්වයෝ නැත, කශලාකුශල කර්මයන්ගේ ඵල විපාක නැතැ’ යි යම් කරුණෙකින් ඔබට මෙසේ සිතෙක් වේ නම්, එසේ වූ කරුණෙක් ඇත් ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්ස, මෙසේත් මෙසේත් පර ලොවෙක් නැත, උපපාදුක සත්වයෝ නැත, කුශලාකුශල කර්මයන්ගේ ඵල විපාක නැතැ” යි යම් කරුණෙකින් මට මෙසේ සිතෙක් වේ නම්, ඒ කරුණෙක් ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “ඒ කෙබඳු ද, රාජන්‍යයෙනි.?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසි - “භවත් කාශ්‍යපයන් වහන්ස, මෙහි මගේ මිත්‍රාමාත්‍යයෝ ද සහලේ නෑයෝ ද පණිවා කරන්නෝ ද, අයිනාදන් කරන්නෝ, කාමයන්හි වැරැදැ හැසිරෙන්නෝ, මුසවා කියන්නෝ, පෙහෙසුන් තෙපලන්නෝ, පරොස් බස් බණන්නෝ, ප්‍රලාප දොඩන්නෝ, මෙරමා සතු දැයට ලෝභ බහුල කොටැත්තෝ, ක්‍රෝධයෙන් නපුරු වූ සිතැත්තෝ, මිසදිටු ගත්තෝ වූහ. ඔහු මෑත කලැ ආබාධ ඇත්තාහු, දුකට පැමිණියාහු, දැඩි ගිලන් වූවාහු වෙත්. ‘මොහු මේ ආබාධයෙන් නො මැ නැඟී සිටුනාහ’ යි යම් විටෙක දැන ගනිම් ද, එව විටැ ඔවුන් කරා එළැඹ, ‘භවත්නි, යම් කෙනෙක් පණිවා කරන සුලු ද, අයිනාදන් කරන සුලු ද, කාමයන්හි වැරැදැ හැසිරෙන සුලු ද, මුසවා කියන සුලු ද, පෙහෙසුන් තෙපලන සුලු ද, පරොස් බස් බණන සුලු ද, ප්‍රලාප දොඩන සුලු ද, මෙරමා සතු දැයට ලෝභ කරන සුලු ද, ක්‍රෝධයෙන් නපුරු වූ සිතැත්තෝ ද, මිසදිටු ගත්තෝ ද, ඔහු කාබුන් මරණින් මතු සැපයෙන් පහ වූ දුකට ස්ථාන වූ, විවස ව පතිත වන තැන වූ නිරයට (එහි ඉපැදීම් විසින්) පැමිණෙන්නාහ’ යි මෙබඳු වාද ඇති, මෙබඳු දෘෂ්ටි ඇති ඇතැම් බමුණු කෙනෙක් ඇත. භවත්හු වනාහි පණිවා කරන සුලු ද, අයිනාදන් කරන සුලු ද, කාමයන්හි වැරැදැ හැසිරෙන සුලු ද, බොරු කියන සුලු ද, පෙහෙසුන් බස් තෙපලන සුලු ද, පරොස් බස් බණන සුලු ද, හිස් බස් දොඩන සුලු ද, මෙරමා සතු දැය කෙරෙහි දැඩි ලෝභ උපදවන සුලු ද, ක්‍රෝධයෙන් නපුරු වූ සිත් ඇත්තෝ ද මිසදිටු ගත්තෝ ද වෙත්. ඉදින් ඒ භවත් මහණ බමුණන්ගේ වචනය සත්‍ය වී නම්, භවත්හු කාබුන් මරණින් මතු සැපයෙන් පහ වූ, දුකට තැන් වූ, විවස වැ වැටෙන තැන වූ නිරයට පැමිණියාහු නම්, යම් හෙයකින් තෙපි අවුත් ‘මෙසේ මෙසේත් පරලොව ඇත, උපපාදුක සත්වයෝ ඇත, කුශලාකුශල කර්මයන්ගේ ඵල විපාක ඇතැ’ යි කියන්නාහු නම් මැනැවි. භවත්හු වූ කලි මට ඇදැහියැ යුතු වචන ඇත්තෝ විශ්වාස කටයුතු වචන ඇත්තෝ වෙති. භවතුන් විසින් යමක් දක්නා ලද ද, එය මා විසින් ම දක්නා ලද්දෙක් යම බඳු ද එබඳු ම වන්නේ යැ” යි මෙසේ කියමි. ඔහු මට ‘මැනැවැ’ යි පිළිවදන් දී කලුරිය කළාහු, පෙරළා අවුත් නො මැ දන්වත්, දූතයකු ද නො එවත්. භවත් කාශ්‍යපයන් වහන්ස, යම් කරුණෙකින් මට ‘මෙසේ මෙසේත් පර ලොවෙක් නැත, උපපාදුක සත්හු නැත, කුශලාකුශල කර්මයන්ගේ ඵල විපාක නැතැ” යි මෙබඳු සිතෙක් වේ ද, එයට මේ ද එක් කරුණෙකි.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 512,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "‘තෙන හි රාජඤ්ඤ තඤ්ඤෙවෙත්ථ පටිපුච්ඡිස්සාමි. යථා තෙ ඛමෙය්ය තථා නං බ්යාකරෙය්යාසි. තං කිම්මඤ්ඤසි රාජඤ්ඤ? ඉධ තෙ පුරිසා චොරං ආගුචාරිං ගහෙත්වා දස්සෙය්යුං ‘අයං තෙ භන්තෙ චොරො ආගුචාරී, ඉමස්ස යං ඉච්ඡසි, තං දණ්ඩං පණෙහී’ති. තෙ ත්වං එවං වදෙය්යාසි තෙන හි භො ඉමං පුරිසං දළ්හාය රජ්ජුයා පච්ඡාබාහං ගාළ්හබන්ධනං බන්ධිත්වා ඛුරමුණ්ඩං කාරෙත්වා{1} ඛරස්සරෙන පණවෙන රථිකාය රථියං සිඞ්ඝාටකෙන සිඞ්ඝාටකං පරිනෙත්වා දක්ඛිණෙන ද්වාරෙන නික්ඛාමෙත්වා දක්ඛිණතො නගරස්ස ආඝාතනෙ{2} සීසං ඡින්දථා’ති. තෙ ‘සාධූ’ති පටිස්සුත්වා තං පුරිසං දළ්හාය රජ්ජුයා පච්ඡාබාහං ගාළ්හබන්ධනං බන්ධිත්වා ඛුරමුණ්ඩං කාරෙත්වා ඛරස්සරෙන පණවෙන රථියාය රථියං සිඞ්ඝාටකෙන සිඞ්ඝාටකං පරිනෙත්වා දක්ඛිණෙන ද්වාරෙන නික්ඛාමෙත්වා දක්ඛිණතො නගරස්ස ආඝාතනෙ{2} නිසීදාපෙය්යුං. ලභෙය්ය නු ඛො සො චොරො චොරඝාතෙසු ‘ආගමෙන්තු තාව භවන්තො චොරඝාතා අමුකස්මිං මෙ ගාමෙ වා නිගමෙ වා මිත්තාමච්චා ඤාතිසාලොහිතා, යාවාහං තෙසං උද්දස්සෙත්වා ආගච්ඡාමී’ති? උදාහු විප්පලපන්තස්සෙව චොරඝාතා සීසං ඡින්දෙය්යුන්ති?”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“න හි සො භො කස්සප චොරො ලභෙය්ය චොරඝාතෙසු: ආගමෙන්තු තාව භවන්තො චොරඝාතා අමුකස්මිං ගාමෙ වා නිගමෙ වා මිත්තාමච්චා ඤාතිසාලොහිතා, යාවාහං තෙසං උද්දස්සෙත්වා ආගච්ඡාමී’ති. අථ ඛො නං විප්පලපන්තස්සෙව චොරඝාතා සීසං ඡින්දෙය්යුන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“සො හි නාම රාජඤ්ඤ චොරො මනුස්සො මනුස්සභූතෙසු චොරඝාතෙසු න ලභිස්සති: ආගමෙන්තු තාව භොන්තො චොරඝාතා අමුකස්මිං මෙ ගාමෙ වා නිගමෙ වා මිත්තාමච්චා ඤාතිසාලොහිතා, යාවාහං තෙසං උද්දෙසෙත්වා ආගච්ඡාමී’ති. කිං පන තෙ මිත්තාමච්චා ඤාතිසාලොහිතා පාණාතිපාතී අදින්නාදායී කාමෙසුමිච්ඡාචාරී මුසාවාදී පිසුණවාචා ඵරුසවාචා සම්ඵප්පලාපී අභිජ්ඣාලූ බ්යාපන්නචිත්තා මිච්ඡාදිට්ඨී, තෙ කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපන්නා ලභිස්සන්ති නිරයපාලෙසු: “ආගමෙන්තු තාව භවන්තො නිරයපාලා යාව මයං පායාසිස්ස රාජඤ්ඤස්ස ගන්ත්වා ආරොචෙම ඉතිපි අත්ථි පරො ලොකො, අත්ථි සත්තා ඔපපාතිකා, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො?”ති. ඉමිනාපි ඛො තෙ රාජඤ්ඤ පරියායෙන එවං හොතු: ඉතිපි අත්ථි පරො ලොකො, අත්ථි සත්තා ඔපපාතිකා, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කරිත්වා - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අඝාටනෙ - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - රාජන්‍යයෙනි, එසේ වී නම්, මෙහි ඔබ ම පිළිවිසින්නෙමි. යම් සේ ඔබට රිසියෙන්නේ ද, එසේ එය විසඳන්න. රාජන්‍යයෙනි, එය කිමැ යි සිත වු ද? මෙහි ඔබේ පුරුෂයෝ වරද කරන සුලු සොරකු අල්ලා ගෙන, ‘ස්වාමීනි, මේ ඔබ අණ නො තකා වරද කරන සුලු සොරෙක. මොහුට යමක් කරනු රිස්සහු ද ඒ දඬුවම පමුණුවනු මැනැවැ’ යි කියා ඔබට දක්වන්නාහු නම්, ඔබ ඔවුනට ‘භවත්නි, එසේ වී නම්, මේ පුරුෂයා දළ රැහැණින් පිටිතල හයා දැඩි බැම්මෙන් බැඳ කරයෙන් හිස මුඩු කරවා, රළු හඬ ඇති වද බෙර වැයුමෙන් යුක්ත කොට වීදියෙන් වීදියට ද, සිවුමං හන්දියෙන් සිවුමං හන්දියට ද ගෙන ගොස් දකුණු දොරින් නික්මවා නුවරට දකුණු දිගැ වධ්‍යභූමියෙහි දී හිස සිඳිවු’ යැ යි මෙසේ කියන්නාහු ය. ඔහු ‘මැනැවැ’ යි ගිවිසැ ඒ පුරුෂයා දැඩි රැහැණින් පිටිතල හයා දැඩි බැම්මෙන් බැඳ කරයෙන් හිස මුඩු කරවා රළු හඬ ඇති වද බෙර වැයුමෙන් යුක්ත කොට වීදියෙන් වීදියට ද, සිවුමං හන්දියෙන් සිවුමං හන්දියට ද ගෙන ගොස්, දකුණු දොරින් නික්මවා නුවරට දකුණු දිගැ වධ්‍යස්ථානයෙහි හිඳුවන්නාහ. ඒ සොර තෙම ‘භවත් චෝරඝාතකයිනි, අසෝ ගමෙහි හෝ නියම් ගමෙහි හෝ මගේ මිත්‍රාමාත්‍යයෝ සහලේ නෑයෝ වෙත්. ඔවුනට මාත් මා සුරැකි කොට තුබූ බඩුත් දක්වා පිළිගන්වා, යම්තාක් කලෙකින් එන්නෙම් ද ඒ තාක් මොහොතක් බලත් වා’ යි කියන්නේ වී නම්, ඒ චෝරඝාතකයන් කෙරෙහි (චෝරඝාතකයන්ගෙන්) අවසරයක් ලැබිය හැකි වන්නේ ද? නො හොත් චෝරඝාතකයෝ ඔහු හඬද්දී ම හිස සිඳින්නා හු ද?",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසි - “භවත් කාශ්‍යපයන් වහන්ස, ‘භවත් චෝරඝාතකයිනි, අසෝ ගමැ හෝ නියම්ගමැ හෝ මගේ මිත්‍රාමාත්‍යයො සහලේ නෑයෝ වෙත්. ඔවුනට මාත් මා සුරැකි කොට තුබූ බඩුත් දක්වා පිළිගන්වා එනතුරු මොහොතක් බලත්වා’ යි කියන්නේ නුමුදු, ඒ සොර තෙම චෝරඝාතකයන් කෙරෙහි අවසරයක් නො ම ලබන්නේ ය. වැලි චෝරඝාතකයෝ ඔහු වැලැපෙද්දී ම ඔහු හිස සිඳුනාහු ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “රාජන්‍යයෙනි, මිනිස් ම වූ ඒ සොර තෙම මිනිස් වූ චෝරඝාතකයන වෙතැ ‘භවත් චෝරඝාතකයිනි, … මා එනතුරු බලත්ව යි කියන්නේ ද අවසරයක් නො මැ ලබන්නේ ය. එසේ කලැ ඔබේ පණිවා කරන සුලු අයිනාදන් කරන සුලු, කාමයන්හි වැරැදැ හැසිරෙන සුලු, බොරු කියන සුලු, පෙහෙසුන් බස තෙපලන සුලු, පරොස් බණන සුලු, හිස් බස දොඩන සුලු, මෙරමා සතු දැයට දැඩි ලෝභ කරන සුලු, ක්‍රෝධයෙන් නපුර වූ සිතැති, මිසදිටු වත් ඒ මිත්‍රාමාත්‍යයෝ ද සහලේ නෑයෝ ද, කාබුන් මරණින් මතු සැපයෙන් පහ වූ දුකට ස්ථාන වූ විවසවැ වැටෙන තැන වූ නිරයට පැමිණියාහු, ‘භවත් නිරාපල්ලනි, අප පායාසී රාජන්‍යයන් කරා ගොස් ‘මේ මේ කරුණිනුත් පරලොව ඇත, මේ මේ කරුණිනුත් උපපාදුක සත්වයෝ ඇත, මේ මේ කරුණිනුත් කුශලාකුශල කර්මයන්ගේ ඵල විපාක ඇතැ’යි කියා එන තෙක් බලත්වා” යි කියා නිරාපල්ලන් වෙත්හි (මෙහි එනනට) අවසරයක් ලැබියැ හැකි වන්නාහු ද? රාජන්‍යයෙනි, මේ කාරණයෙනුත් ‘මෙසේ මෙසේත් පරලොව ඇත. උපපාදුක සත්වයෝ ඇත. කුශලාකුශල කර්මයන් ගේ ඵල විපාක ඇතැ’යි සිතෙක් ඔබට වේ වා.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 514,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“කිඤ්චාපි භවං කස්සපො එවමාහ, අථ ඛො එවං මෙ එත්ථ හොති: ඉතිපි නත්ථි පරො ලොකො නත්ථි සත්තා ඔපපාතිකා නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "7. “අත්ථි පන රාජඤ්ඤ පරියායො යෙන තෙ පරියායෙන එවං හොති: ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකොති?”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“අත්ථි භො කස්සප පරියායො යෙන මෙ පරියායෙන එවං හොති: ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකොති”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යථා කථං විය රාජඤ්ඤා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“ඉධ මෙ භො කස්සප මිත්තාමච්චා ඤාතිසාලොහිතා පාණාතිපාතා පටිවිරතා අදින්නාදානා පටිවිරතා කාමෙසුමිච්ඡාචාරා පටිවිරතා මුසාවාදා පටිවිරතා පිසුනාය වාචාය පටිවිරතා ඵරුසාය වාචාය පටිවිරතා සම්ඵප්පලාපා පටිවිරතා අනභිජ්ඣාලූ අබ්යාපන්නචිත්තා සම්මාදිට්ඨී. තෙ අපරෙන සමයෙන ආබාධිකා හොන්ති දුක්ඛිතා බාළ්හගිලානා. යදාහං ජානාමි “න{1} දානි මෙ ඉමම්හා ආබාධා වුට්ඨහිස්සන්තී’ති. ත්යාහං උපසඞ්කමිත්වා එවං වදාමි: සන්ති ඛො භො එකෙ සමණබ්රාහ්මණා එවංවාදිනො එවංදිට්ඨිනො “යෙ තෙ පාණාතිපාතා පටිවිරතා අදින්නාදානා පටිවිරතා කාමෙසුමිච්ඡාචාරා පටිවිරතා මුසාවාදා පටිවිරතා පිසුනාය වාචාය පටිවිරතා ඵරුසාය වාචාය පටිවිරතා සම්ඵප්පලාපා පටිවිරතා අනභිජ්ඣාලූ අබ්යාපන්නචිත්තා සම්මාදිට්ඨී, තෙ කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්තී’ති. භවන්තො ඛො පාණාතිපාතා පටිවිරතා අදින්නාදානා පටිවිරතා කාමෙසුමිච්ඡාචාරා පටිවිරතා මුසාවාදා පටිවිරතා පිසුනාය වාචාය පටිවිරතා ඵරුසාය වාචාය පටිවිරතා සම්ඵප්පලාපා පටිවිරතා අනභිජ්ඣාලූ අබ්යාපන්නචිත්තා සම්මාදිට්ඨී. සචෙ තෙසං භවතං සමණබ්රාහ්මණානං සච්චං වචනං, භවන්තො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජිස්සන්ති. සචෙ භො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජෙය්යාථ, යෙන මෙ ආගන්ත්වා ආරොචෙය්යාථ: ‘ඉතිපි අත්ථි පරො ලොකො, අත්ථි සත්තා ඔපපාතිකා, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති. භවන්තො ඛො පන මෙ සද්ධායිකා පච්චයිකා, යං භවන්තෙහි දිට්ඨං, යථා සාමං දිට්ඨං එවමෙතං භවිස්සතී’ති. තෙ මෙ ‘සාධූ’ති පටිස්සුත්වා නෙව ආගන්ත්වා ආරොචෙන්ති, න පන දූතං පහිණන්ති. අයම්පි ඛො භො කස්සප පරියායො යෙන මෙ පරියායෙන එවං හොති: ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති”."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සසීකො - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්සේ මෙසේ වදාරතත්, මෙහි මට ‘මෙසේ මෙසේත් පර ලොවෙක් නැත. උපපාදුක සත්වයෝ නැත. කුශලාකුශල කර්මයන්ගේ ඵල විපාක නැතැ’ යි ම මෙසේ සිතෙක් වෙයි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "7. කුමරකසුප් - “රාජන්‍යයෙනි, මෙසේත් මෙසේත් පර ලොවෙක් නැතැ යි, උපපාදුක සත්වයෝ නැතැ යි, කශලාකුශල කර්මයන්ගේ ඵල විපාක නැතැ යි යම් කරුණෙකින් ඔබට මෙසේ සිතෙක් වේ නම්, එසේ වූ (තව ද) කරුණෙක් ඇද්ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්ස, යම් කරුණෙකින් මට ‘මෙ කරුණිනුත් පර ලොවෙක් නැතැ යි, උපපාදුක සත්වයෝ නැතැ යි, කුශලාකුශල කර්මයන්ගේ ඵල විපාක නැතැ” යි මෙසේ සිතෙක් වේ නම්, ඒ කරුණු ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමර කසුප් - “ඒ කෙසේ ද, රාජන්‍යයෙනි.?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසි - “භවත් කාශ්‍යපයෙනි, මෙහි මගේ මිත්‍රාමාත්‍යය කෙනෙක් සහලේ නෑ කෙනෙක් පණිවායෙන් වැළැක්කෝ, අයිනාදන් වැළැක්කෝ, කාමයන්හි වැරැදැ හැසිරීමෙන් වැළැක්කෝ, මුසවායෙන් වැළැක්කෝ, පෙහෙසුන් තෙප්ලෙන් වැළැක්කෝ, පරොස් බසින් වැළැක්කෝ, හිස් තෙප්ලෙන් වැළැක්කෝ, මෙරමා අයත් දැයට ගිජු නොවූවෝ, මෙරමා කෙරහි නපුරු සිත් නැත්තෝ, සම්දිට් ගත්තෝ වූහ. ඔහු මෑත භාගයෙහි හටගත් ආබාධ ඇත්තාහු, දුකට පත්තාහු, දැඩි ගිලන් වූවාහු වෙත්. මොහු මේ ආබාධයෙන් නො නැගිටුනාහ යි යම් විටෙක දැන ගනිම් ද, එකල්හි මම් ඔවුන් කරා එළැඹ, ‘භවත්නි, යම් කෙනෙක් පණිවායෙන් වැළැක්කාහුද, අයිනාදනින් වාළැක්කාහුද, කාමයන්හි වැරැදැ හැසිරීමෙන් වැළැක්කාහුද, මුසවායෙන් වැළැක්කාහුද, පෙහෙසුන් බසින් වැළැක්කාහුද, පරොස් බිණුමෙන් වැළැක්කාහුද, හිස් බස් දෙඩුමෙන් වැළැක්කාහුද, අභිධ්‍යාබහුල නො වෙත් ද, ව්‍යාපාදයෙන් නපුරු වූ සිත් නැත්තාහු වෙත් ද, සම්දිට් ගතුවාහු වෙත් ද, ඔහු කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට පැමිණෙන් යැ යි මෙසේ වූ වාද ඇති, මෙසේ වූ දෘෂ්ටි ඇති, ඇතැම් මහණ බමුණු කෙනෙක් ඇත. භවත්හු වනාහි පණිවායෙන් වැළැක්කාහ, අයිනාදනින් වැළැක්කාහ, කාමයන්හි වැරැදැ හැසිරීමෙන් වැළැක්කාහ, මුසවායෙන් වැළැක්කාහ, පෙහෙසුන් බසින් වැළැක්කාහ, පරොස් බැණුමෙන් වැළැක්කාහ, හිස් බස් දෙඩුමෙන් වැළැක්කාහ, මෙරමා සතු දැයට ගිජු නොවන්නාහ, ව්‍යාපාදයෙන් නපුරු වූ සිත් නැත්තාහ, සම්දිටු හ. ඉදින් ඒ භවත් මහණ බමුණන්ගේ බස් සැබෑ වී නම්, භවත් කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට පැමිණෙන්නාහ. භවත්නි, ඉදින් තෙපි කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට, පැමිණෙන්නාහු නම්, එකරුණින් ආවුත් මට ‘මෙසේත් පරලොව ඇත, උපපාදුක සත්හු ඇත, කුශලාකුශල කර්මයන්ගේ ඵල විපාක ඇතැ’යි දන්වවු. භවත්හු වනාහි මා විසින් හැදැහියැ යුතු වචන ඇත්තෝ විශ්වාස කටයුත්තෝ වහු. භවතුන් විසින් යමෙක් දක්නා ලද නම්, එය මා විසින් සියැසින් ම දක්නා ලද්දක් සේ ම වන්නේ යැ යි කීමි. ඔහු මට ‘මැනැවැ’ යි ගිවිසැ (කලුරිය කළාහු) පෙරළා අවුත් නො ම දන්වත්, දූතයකුදු නො ම එවත්. භවත් කාශ්‍යපයන් වහන්ස, යම් කරුණෙකින් මට ‘මෙසේත් පරලොවෙක් නැත, මෙසේත් උපපාදුක සත්හු නැත, මෙසේත් කුශලාකුශල කර්මයනට ඵල විපාක නැතැ’යි මෙබඳු සිතෙක් වේ නම් මේ ද ඒ එක් කරුණෙක.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 516,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“තෙන හි රාජඤ්ඤ උපමං තෙ කරිස්සාමි. උපමායපි ඉධෙකච්චෙ විඤ්ඤූ පුරිසා භාසිතස්ස අත්ථං ආජානන්ති. සෙය්යථාපි රාජඤ්ඤ පුරිසො ගූථකූපෙ සසීසකං නිමුග්ගො අස්ස. අථ ත්වං පුරිසෙ ආණාපෙය්යාසි: ‘තෙන හි භො තං පුරිසං තම්හා ගූථකූපා උද්ධරථා’ති. තෙ ‘සාධූ’ති පටිස්සුත්වා තං පුරිසං තම්හා ගූථකූපා උද්ධරෙය්යුං. තෙ ත්වං එවං වදෙය්යාසි: ‘තෙන හි භො තස්ස පුරිසස්ස කායා වෙළුපෙසිකාහි ගූථං සුනිම්මජ්ජිතං නිම්මජ්ජථා”ති. තෙ ‘සාධූ’ති පටිස්සුත්වා තස්ස පුරිසස්ස කායා වෙළුපෙසිකාහි ගූථං සුනිම්මජ්ජිතං නිම්මජ්ජෙය්යුං. තෙ ත්වං එවං වදෙය්යාසි: ‘තෙන හි භො තස්ස පුරිසස්ස කායං පණ්ඩුමත්තිකාය තික්ඛත්තුං සුබ්බට්ටිතං උබ්බට්ටෙථා’ති. තෙ තස්ස පුරිසස්ස කායං පණ්ඩුමත්තිකාය තික්ඛත්තුං සුබ්බට්ටිතං උබ්බට්ටෙය්යුං. තෙ ත්වං එවං වදෙය්යාසි: ‘තෙන හි භො තං පුරිසං තෙලෙන අබ්භඤ්ජිත්වා සුඛුමෙන චුණ්ණෙන තික්ඛත්තුං සුප්පධොතං කරොථා’ති. තෙ තං පුරිසං තෙලෙන අබ්භඤ්ජිත්වා සුඛුමෙන චුණ්ණෙන තික්ඛත්තුං සුප්පධොතං කරෙය්යුං. තෙ ත්වං එවං වදෙය්යාසි: ‘තෙන හි භො තස්ස පුරිසස්ස කෙසමස්සුං කප්පෙථා’ති. තෙ තස්ස පුරිසස්ස කෙසමස්සුං කප්පෙය්යුං. තෙ ත්වං එවං වදෙය්යාසි: ‘තෙන හි භො තස්ස පුරිසස්ස මහග්ඝඤ්ච මාලං මහග්ඝඤ්ච විලෙපනං මහග්ඝානි ච වත්ථානි උපහරථා’ති. තෙ තස්ස පුරිසස්ස මහග්ඝඤ්ච මාලං මහග්ඝඤ්ච විලෙපනං මහග්ඝානි ච වත්ථානි උපහරෙය්යුං. තෙ ත්වං එවං වදෙය්යාසි: ‘තෙන හි භො තං පුරිසං පාසාදං ආරොපෙත්වා පඤ්චකාමගුණානි උපට්ඨපෙථා’ති. තෙ තං පුරිසං පාසාදං ආරොපෙත්වා පඤ්චකාමගුණානි උපට්ඨපෙය්යුං. තං කිම්මඤ්ඤසි රාජඤ්ඤ? අපි නු තස්ස පුරිසස්ස සුන්හාතස්ස සුවිලිත්තස්ස සුකප්පිතකෙසමස්සුස්ස ආමුත්තමාලාභරණස්ස ඔදාතවත්ථවසනස්ස උපරිපාසාදවරගතස්ස පඤ්චහි කාමගුණෙහි සමප්පිතස්ස සමඞ්ගීභූතස්ස පරිචාරයමානස්ස පුනදෙව තස්මිං ගූථකූපෙ නිම්මුජ්ජිතුකම්යතා{1} අස්සා’ති”?"
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හිදං භො කස්සප”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තං කිස්ස හෙතු?”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“අසුචි භො කස්සප ගූථකූපො, අසුචි චෙව අසුචි සඞ්ඛාතො ච දුග්ගන්ධො ච දුග්ගන්ධසඞ්ඛාතො ච ජෙගුච්ඡො ච ජෙගුච්ඡසඞ්ඛාතො ච පටික්කූලො ච පටිකූලසඞ්ඛාතො චාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කාමතා (කෙචිසු)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “රාජන්‍යයිනි, ඔබට උපමාවක් කරන්නෙමි. මෙහි ඇතැම් නුවණැති පුරුෂයෝ උපමායෙනුදු කී වචනයේ අරුත් දැනැගන්නාහ. රාජන්‍යයෙනි, යම් සේ පුරුෂයෙක් අසූචි වළෙක හිස සහිත වැ ගිලුණේ වන්නේ නම්, එ කල තෙපි (සිය මෙහෙකරු) පුරුෂයනට, ‘භවත්නි, එසේ වී නම්, ඒ පුරුෂයා ඒ අසූචි වළෙන් ගොඩ ගනිවු’ යැ යි අණ කරන්නහු ද, ඔහු ‘මැනැවැ’යි පිළිවදන් දී, ඒ පුරුෂයා ඒ අසූචි වළෙන් ගොඩ නඟන්නාහු ද, (එ කලැ) ඔබ, ‘භචත්නි, එසේ වී නම් උන පතුරුවලින් ඒ පුරුෂයාගේ සිරුරෙන් අශුචි මොනොවට පිස පියවු’ යැ යි ඔවුනට මෙසේ කියන්නහු ද, ඔහු ‘මැනැවැ’යි පිළිවදන් දී, උන පතුරුවලින් ඒ පුරුෂයාගේ සිරුර කෙරෙන් අසූචි මොනොවට පිස පියන්නාහු ද, (එවිට) ඔබ ඔවුනට, භවත්නි එසේ වී නම්, ඒ පුරුෂයාගේ ශරීරය පඬුවන් මැටියෙන් තුන් වරක් මොනොවට උලවු’යැයි මෙසේ කියන්නහුද ද, (එ විට) ඔහු ඒ පුරුෂයාගේ සිරුර පඬුවන් මැටියෙන් තුන් වරක් උලන්නාහු ද, (එ කලැ) ඔබ ඔවුනට, ‘එසේ වී නම් භවත්නි, තෙපි ඒ පුරුෂයා තෙලින් ගහවා (තෙල් ගල්වා) සියුම් සුණුයෙන් තුන් වරක් මොනොවට ශුද්ධ කරවු’ යැ යි මෙසේ කියන්නාහු ද, ඔහු ඒ පුරුෂයා තෙල් ගල්වා සියුම් සුණුයෙන් තුන් වරක් මොනොවට ශුද්ධ කරන්නාහු ද (ඉක්බිති) ඔබ ඔවුනට, ‘භවත්නි, එසේ වී නම් තෙපි ඒ පුරුෂයාගේ දැලි රවුළු කපවු, සරහවු’ යැ යි කියන්නාහු ද එ විට ඔහු ඒ පුරුෂයාගේ දැළි රවුළු සරහන්නාහු ද, ඉක්බිති ඔබ ඔවුනට, ‘භවත්නි, එසේ වී නම්, ඒ පුරුෂයාට මහඟු මල්දම් ද මහඟු විලෙවුන් ද මහඟු වස්ත්‍ර ද එළවවු’ යැ යි මෙසේ කියන්නාහු ද, ඔහු ඔවුනට මහඟු මල්දම් ද මහඟු විලෙවුන් ද මහඟු වස්ත්‍ර ද එළවන්නාහු ද, ඔබ ඔවුනට, ‘භවත්නි, එසේ වී නම් ඒ පුරුෂයා පහයකට නංවා පස් කම් කොටසුන් එළවා තබවූ යැ යි කියන්නාහු ද, ඔහු ඒ පුරුෂයා පහයකට නංවා කම් කොටස් පස එළ වන්නාහු ද, රාජන්‍යයිනි, (එසේ කලා) එය කි මැ යි සිත වු ද? මොනොවට නා මොනොවට විලෙවුන් ගත් සිරුර ඇති, මොනොවට සරහන ලද කෙස් හා දැලි රවුළු ඇති, පලන් මල්දම් හා අභරණ ඇති, සුදු වත් හඳනා, මහඟු පහයෙක මතු මහළට පැමිණ හුන්, පස් කම් කොටසුන් ගෙන් පිහිටියකු වැ සමන්විත වැ ඉඳුරන් හසුරුවන ඔහුට නැවැත ද ඒ අසූචි වළෙහි ගිලෙනු රිසි බවෙක් වන්නේ ද?",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්ස, මෙය නො වේ මැ යැ”.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමර - “ඒ කවර හෙයින?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්ස, අසූචි වළ අපිරිසිදු ය, (මන නොවඩන්නේ ය) අසූචි කොටස් ම වූයේ ය, දුගඳ ය, දුගඳ කොටස් ම වූයේ ය. පිළිකුල් කටයුතු ය, පිළිකුල් කටයුතු කොටස් ම වූයේ ය, එහෙයිනි.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 518,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "‘එවමෙව ඛො රාජඤ්ඤ මනුස්සා දෙවානං අසුචී චෙව අසුචිසඞ්ඛාතා ච දුග්ගන්ධා ච දුග්ගන්ධසඞ්ඛාතා ච ජෙගුච්ඡා ච ජෙගුච්ඡසඞ්ඛාතා ච පටික්කූලා ච පටිකූලසඞ්ඛාතා ච. යොජනසතං ඛො රාජඤ්ඤ මනුස්සගන්ධො දෙවෙ උබ්බාධති. කිම්පන තෙ මිත්තාමච්චා ඤාතිසාලොහිතා පාණාතිපාතා පටිවිරතා අදින්නාදානා පටිවිරතා කාමෙසුමිච්ඡාචාරා පටිවිරතා මුසාවාදා පටිවිරතා පිසුණාය වාචාය පටිවිරතා ඵරුසාය වාචාය පටිවිරතා සම්ඵප්පලාපා පටිවිරතා අනභිජ්ඣාලූ අබ්යාපන්නචිත්තා සම්මාදිට්ඨී කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නා තෙ ආගන්ත්වා ආරොචෙස්සන්ති: ඉතිපි අත්ථි පරො ලොකො, අත්ථි සත්තා ඔපපාතිකා, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති? ඉමිනාපි ඛො තෙ රාජඤ්ඤ පරියායෙන එවං හොතු: ඉතිපි අත්ථි පරො ලොකො, අත්ථි සත්තා ඔපපාතිකා, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කිඤ්චාපි භවං කස්සපො එවමාහ, අථ ඛො එවං මෙ එත්ථ හොති: ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "8. “අත්ථි පන භො රාජඤ්ඤ පරියායො -පෙ- “"
                    },
                    {
                        "type": "paragraph",
                        "text": "“අත්ථි භො කස්සප පරියායො -පෙ- “"
                    },
                    {
                        "type": "paragraph",
                        "text": "“යථාකථං විය රාජඤ්ඤා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“ඉධ මෙ භො කස්සප මිත්තාමච්චා ඤාතිසාලොහිතා පාණාතිපාතා පටිවිරතා අදින්නාදානා පටිවිරතා කාමෙසුමිච්ඡාචාරා පටිවිරතා මුසාවාදා පටිවිරතා සුරාමෙරයමජ්ජපමාදට්ඨානා පටිවිරතා, තෙ අපරෙන සමයෙන ආබාධිකා හොන්ති දුක්ඛිතා බාළ්හගිලානා. යදාහං ජානාමි න දානි මෙ ඉමම්හා ආබාධා වුට්ඨහිස්සන්තීති ත්යාහං උපසඞ්කමිත්වා එවං වදාමි: සන්ති ඛො භො එකෙ සමණබ්රාහ්මණා එවංවාදිනො එවංදිට්ඨිනො ‘යෙ තෙ පාණාතිපාතා පටිවිරතා අදින්නාදානා පටිවිරතා කාමෙසුමිච්ඡාචාරා පටිවිරතා මුසාවාදා පටිවිරතා සුරාමෙරයමජ්ජපමාදට්ඨානා පටිවිරතා, තෙ කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති දෙවානං තාවතිංසානං සහබ්යතන්ති. භවන්තො ඛො පාණාතිපාතා පටිවිරතා අදින්නාදානා පටිවිරතා කාමෙසුමිච්ඡාචාරා පටිවිරතා මුසාවාදා පටිවිරතා සුරාමෙරයමජ්ජපමාදට්ඨානා පටිවිරතා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "කුමර - රාජන්‍යයෙනි, එසේ ම මිනිස්සු දෙවියනට අපිරිසිදු හ, අසූචි කොටස් ම වෙති, දුගඳ හ, දුගඳ කොටස් ම වෙති, පිළිකුල් කටයුතු හා පිළිකුල් කටයුතු කොටස් ම වෙති. රාජන්‍යයෙනි, මිනිස් ගඳ යොදුන් සියයක් ම දෙවියනට බාධන කෙරෙයි, කිමෙක් ද? ඔවුන්ගේ මිත්‍රාමාත්‍යයෝත් සහලේ නෑයෝත් පණිවායෙන් වැළකුණාහු, අයිනාදනින් වැළැකුණාහු, කාමයන්හි වරදවා හැසිරීමෙන් වැළැක්කාහු මුසවායෙන් වැළැක්කාහු, පෙහෙවුන් බසින් වැළැක්කාහු, පරොස් බසින් වැළැක්කාහු, හිස් බසින් වැළැක්කාහු, මෙරමා සතු දැයට ඇලුම් නැත්තාහු, නපුරු සිත් නැත්තාහු, සම්දිටු වූවාහු, කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට පැමිණියාහු ද, ඔහු අවුත් ‘මෙසේත් පර ලොව ඇත, සැව උපදනා සත්තු ඇත, කුශලාකුශල කර්මයන්ගේ ඵල විපාක ඇතැ’යි මෙහි අවුත් කියන්නාහු ද? රාජන්‍යයෙනි, මෙ කරුණින් ද ඔබට ‘මෙසේත් පර ලොව ඇත, මෙසේත සැව උපදනා සත්තු ඇත, කුශලාකුශල කර්මයන්ගේ ඵල විපාක ඇතැ’යි මෙසේ සිතෙක් වේ වා.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසි - “භවත් කාශ්‍යපයන් වහන්සේ මෙසේ වදාරතත්, මෙහි මට ‘මෙසේ මෙසේත් පරලොවෙක් නැත, උපපාදුක සත්වයෙක් නැත, කුශලාකුශලා කර්මයන්ගේ ඵල විපාක නැතැ’ යි මෙස් සිතෙක් වෙයි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "8. කුමරකසුප් - රාජන්‍යයෙනි, … යම් කරුණෙකින් ඔබට මෙසේ සිතෙක් වේ නම්, එසේ වූ තවත් කරුණෙක් ඇද්ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්ස, … කරුණෙක් ඇත.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “රාජන්‍යයෙනි, ඒ කෙසේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්ස, පණිවායෙන් වැළැකි, අයිනාදනින් වැළැකි, කාමයන්හි වරදවා හැසිරීමෙන් වැළැකි, මත් බව කරන පමාවට කරුණු වන රහමෙරින් වැළැකි, මගේ මිත්‍රාමාත්‍ය කෙනෙක් සහලේ නෑ කෙනෙක් මෙහි වූහ. මෑත කාලයෙහි ඔහු ආබාධ ඇත්තාහු, දුකට පැමිණියාහු, දැඩි ගිලන් වූවා හු ය. දැන් මොහු මේ ආබාධයෙන් නො ම නැගී සිටින්නාහ’ යි යම් කලෙක දැන ගනිම් ද, එ කලැ ඔවුන් කරා එළැඹැ, ‘භවත්නි, යම් කෙනෙක් පණිවායෙන් වැළැක්කාහු ද, අයිනාදනින් වැළැක්කාහු ද, කාමයන්හි වරදවා හැසිරීමෙන් වැළැක්කාහු ද, මුසවායෙන් වැළැක්කාහු ද, මදය කරන පමාවට කරුණු වූ රහමෙරින් වැළැක්කාහු ද, ඔහු කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට පැමිණෙත්, තව්තිසා වැසි දෙවියන් හා එක් වීමට පැමිණෙත්’ යැ යි මෙබඳ වාදූ ඇති, මෙබඳූ දෘෂ්ටි ඇති, ඇතැම් මහණ බමුණු කෙනෙක් ඇත. භවත්හු වූ කලි පණිවායෙන් වැළැක්කාහු ය, අයිනාදනින් වැළැක්කාහු ය, කාමමිථ්‍යාචාරයෙන් වැළැක්කාහු ය, මුසවායෙන් වැළැක්කාහු ය, මද්‍ය වූ ද ප්‍රමාදස්ථාන වූ ද රහමෙරින් වැළැක්කාහු ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 520,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සචෙ තෙසං භවතං සමණබ්රාහ්මණානං සච්චං වචනං, භවන්තො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජිස්සන්ති, දෙවානං තාවතිංසානං සහබ්යතං. සචෙ භො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජෙය්යාථ දෙවානං තාවතිංසානං සහබ්යතං, යෙන මෙ ආගන්ත්වා ආරොචෙය්යාථ ඉතිපි අත්ථි පරො ලොකො, අත්ථි සත්තා ඔපපාතිකා, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො ති. භවන්තො ඛො පන මෙ සද්ධායිකා පච්චයිකා, යං භවන්තෙහි දිට්ඨං, යථා සාමං දිට්ඨං, එවමෙතං භවිස්සතීති. තෙ මෙ ‘සාධූ’ති පටිස්සුත්වා නෙව ආගන්ත්වා ආරොචෙන්ති න පන දූතං පහිණන්ති. අයම්පි ඛො භො කස්සප පරියායො යෙන මෙ පරියායෙන එවං හොති: ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තෙන හි රාජඤ්ඤ තඤ්ඤෙවෙත්ථ පටිපුච්ඡිස්සාමි, යථා තෙ ඛමෙය්ය තථා නං බ්යාකරෙය්යාසි. යං ඛො පන රාජඤ්ඤ මානුසකං වස්සසතං, දෙවානං තාවතිංසානං එසො එකො රත්තින්දිවො. තාය රත්තියා තිංසරත්තියො මාසො, තෙන මාසෙන ද්වාදස මාසියො සංවච්ඡරො, තෙන සංවච්ඡරෙන දිබ්බං වස්සසහස්සං දෙවානං තාවතිංසානං ආයුප්පමාණං. යෙ තෙ මිත්තාමච්චා ඤාතිසාලොහිතා පාණාතිපාතා පටිවිරතා අදින්නාදානා පටිවිරතා කාමෙසුමිච්ඡාචාරා පටිවිරතා මුසාවාදා පටිවිරතා සුරාමෙරයමජ්ජපමාදට්ඨානා පටිවිරතා, තෙ කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නා දෙවානං තාවතිංසානං සහබ්යතං. සචෙ පන තෙසං එවං භවිස්සති: ‘යාව මයං ද්වෙ වා තීණි වා රත්තින්දිවානි දිබ්බෙහි පඤ්චහි කාමගුණෙහි සමප්පිතා සමඞ්ගීභූතා පරිචාරෙම, අථ මයං පායාසිස්ස රාජඤ්ඤස්ස ගන්ත්වා ආරොචෙය්යාම: ඉතිපි අත්ථි පරො ලොකො, අත්ථි සත්තා ඔපපාතිකා, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති. අපි නු තෙ ආගන්ත්වා ආරොචෙය්යුං: ඉතිපි අත්ථි පරො ලොකො, අත්ථි සත්තා ඔපපාතිකා, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති”?"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ඉදින් ඒ භවත් මහණ බමුණන් බස සැබෑ වී නම්, භවත් හු කාබුන් මරණින් මතු මනාගති ඇති සග ලොවට පැමිණෙන්නාහ, තව්තිසා වැසි දෙවියන් හා එක් වීමට පැමිණෙන්නාහ. භවත්නි, ඉදින් තෙපි කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට පැමිණෙන්නාහු නම, තව්තිසා වැසි දෙවියන් හා එක් වීමට පැමිණෙන්නාහු නම්, එ කලැ අවුත් ‘මෙසේත් පර ලොවක් ඇත, උපපාදුක සත්වයෝ ඇත, කුශලාකුශල කර්මයන්ගේ ඵල විපාක ඇතැ’ යි මට දන්වවු. භවත්හු වනාහි මා විසින් ඇදැහියැ යුතු වචන ඇත්තාහු ය, විශ්වාස කටයුතු වචන ඇත්තාහු ය, යමක් භවතුන් විසින් දක්නා ලද ද, යම් සේ මා තමා විසින් ම දක්නා ලද දැයක් සේ ම වන්නේ ය”. ඔහු ‘මැනැවැ’ යි මට පිළිවදන් දී අවුත් නො ම දන්වත්, දූතයකු නො ම එවත්. භවත් කාශ්‍යපයන් වහන්ස, “මෙසේ ත් පර ලොව නැත, මෙසේ උපපාදුක සත්තු නැත, මෙසේ කුශලාකුශල කර්මයනට ඵල විපාක නැතැ’යි යම් කරුණෙකින් මෙබඳු සිතෙක් වේ ද, මේ ද ඒ කරුණෙක් යැ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “රාජන්‍යයෙනි, මෙහි ඔබ ම පිළිවිසින්නෙමි. යම්සේ ඔබට රිසියෙන්නේ ද එසේ එය විසඳන්නැ. රාජන්‍යයෙනි, මිනිසුන් පිළිබඳ වූ යම් හවුරුදු සියයෙක් වේ ද, මෙය තව්තිසා වැසි දෙවියනට එක් රෑ දවාලෙක. ඒ රැයින් තිස් රැයෙක් (ඒ දෙවියනට) මසෙක, ඒ මසින් දොළොස් මසෙක් ඔවුනට හවුරුද්දෙක. ඒ හවුරුද්දෙන් දිව්‍ය වර්ෂ දහසෙක් තව්තිසා වැසි දෙවියන්ගේ ආයුෂ ප්‍රමාණය යැ. පණිවායෙන් වැළැකී, අයිනාදනින් වැළැකි, කාමමථ්‍යාචාරයන් වැළැකි, මුසවායෙන් වැළැකි, මද්‍ය වූ ප්‍රමාදස්ථාන වූ රහමෙරින් වැළැකි, යම් ඔබේ මිත්‍රාමාත්‍ය කෙනෙක් සහලේ නෑ කෙනෙක් වූහු ද, ඔහු කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට පැමිණියාහු, තව්තිසා වැසි දෙවියන් හා එක් වීමට පැමිණියාහු නම්, ඔවුනට ‘අපි රෑදාවල් දෙකක් හෝ තුනක් හෝ යම්තාක් කලක් දිව්‍ය පංචකාම ගුණයන්ගෙන් සමර්පිත වැ සමන්විත වැ ඉඳුරන් හසුරුවමෝ ද, එයින් පසු අපි ගොස් පායාසී රාජන්‍යයනට ‘මෙසේත් පර ලොවෙක් ඇතැ යි, මෙසේත් උපපාදුක සත්හු ඇතැ යි, මෙසේත් කුශලාකුශල කර්මයන්ගේ ඵල විපාක ඇතැ’ යි දන්වම්හ යි ඔවුනට මෙසේ සිතෙක් වන්නේ නම්, ඔහු අවුත් ‘මෙසේත් පර ලොව ඇතැ යි, මෙසේත් උපපාදුක සත්තු ඇතැ යි, මෙසේත් කුශලාකුශල කර්මයන් ගේ ඵල විපාක ඇතැ යි දැන් වියැ හැක්කාහු ද?”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 522,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භො කස්සප, අපි හි මයං භො කස්සප චිර කාලකතා පි භවෙය්යාම. කො පනෙතං භොතො කස්සපස්ස ආරොචෙති: අත්ථි දෙවා තාවතිංසාති වා, එවං දීඝායුකා දෙවා තාවතිංසා ති වා. න මයං භොතො කස්සපස්ස සද්දහාම අත්ථි දෙවා තාවතිංසා ති වා එවං දීඝායුෙකා දෙවා තාවතිංසා ති වා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“සෙය්යථාපි රාජඤ්ඤ ජච්චන්ධො පුරිසො න පස්සෙය්ය කණ්හ-සුක්කානි රූපානි, න පස්සෙය්ය නීලකානි රූපානි, න පස්සෙය්ය පීතකානි රූපානි, න පස්සෙය්ය ලොහිතකානි රූපානි, න පස්සෙය්ය මඤ්ජෙට්ඨිකානි රූපානි, න පස්සෙය්ය සමවිසමං, න පස්සෙය්ය තාරකරූපානි, න පස්සෙය්ය චන්දිමසූරියෙ. සො එවං වදෙය්ය ‘නත්ථි කණ්හසුක්කානි රූපානි, නත්ථි කණ්හසුක්කානං රූපානං දස්සාවී. නත්ථි නීලකානි රූපානි, නත්ථි නීලකානං රූපානං දස්සාවී. නත්ථි පීතකානි රූපානි, නත්ථි පීතකානං රූපානං දස්සාවී. නත්ථි ලොහිතකානි රූපානි, නත්ථි ලොහිතකානං රූපානං දස්සාවී. නත්ථි මඤ්ජෙට්ඨිකානි රූපානි, නත්ථි මඤ්ජෙට්ඨිකානං රූපානං දස්සාවී. නත්ථි සමවිසමං, නත්ථි සමවිසමස්ස දස්සාවී. නත්ථි තාරකරූපානි, නත්ථි තාරකරූපානං දස්සාවී. නත්ථි චන්දිමසූරියා, නත්ථි චන්දිමසූරියානං දස්සාවී. අහමෙතං න ජානාමි, අහමෙතං න පස්සාමි, තස්මා තං නත්ථිනි. සම්මා නු ඛො භො රාජඤ්ඤ වදමානො වදෙය්යා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භො කස්සප. අත්ථි කණ්හසුක්කානි රූපානි, අත්ථි කණ්හසුක්කානං රූපානං දස්සාවී. අත්ථි නීලකානි රූපානි, අත්ථි නීලකානං රූපානං දස්සාවී අත්ථි පීතකානි රූපානි, අත්ථි පීතකානං රූපානං දස්සාවී. අත්ථි ලොහිතකානි රූපානි, අත්ථි ලොහිතකානං රූපානං දස්සාවී. අත්ථි මඤ්ජෙට්ඨිකානි රූපානි, අත්ථි මඤ්ජෙට්ඨිකානං රූපානං දස්සාවී. අත්ථි සමවිසමං, අත්ථි සමවිසමස්ස දස්සාවී. අත්ථි තාරකරූපානි, අත්ථි තාරකරූපානං දස්සාවී. අත්ථි චන්දිමසූරියා, අත්ථි චන්දිමසූරියානං දස්සාවී. ‘අහමෙතං න ජානාමි, අහමෙතං න පස්සාමි, තස්මා තං නත්ථී’ති. න හි සො භො කස්සප සම්මා වදමානො වදෙය්යා”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්ස, මෙය නො ම වන්නේ ය. වැලි දු අපි (ඔවුන් එන විට) කලුරිය කළ බොහෝ කල් ඇත්තමෝ ද වන්නමු. තව්තිසා වැසි දෙවි කෙනෙක් ඇතැයි හෝ තව්තිසා වැසි දෙවියෝ මෙසේ දීර්ඝ වූ ආයුෂ ඇත්තෝ යැ යි හෝ කවරෙක් නම මෙය භවත් කාශ්‍යපයන් වහන්සේ ට දන්වා ද? තව්තිසා වැසි දෙවියෝ ඇතැ යි හෝ තව්තිසා වැසි දෙවියෝ මෙස් දීර්ඝ වූ ආයුෂයක් ඇත්තෝ යැ යි හෝ කියන භවත් කාශ්‍යපයන් වහන්සේ ගේ වචනය අපි නො අදහමු.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “රාජන්‍යයෙනි, යම්සේ ජාත්‍යන්ධ පුරුෂයෙක් සුදු කලු රූපයන් හො දක්නේ ද, නිල් පැහැති රූපයන් නො දක්නේ ද, කසාවන් රූපයන් නො දක්නේ ද, රතු පැහැ රූපයන් නො දක්නේ ද, මඳැටිය පැහැ රූපයන් නො දක්නේ ද, සම විසම තෑන් නො දක්නේ ද, තාරකා රූපයන් නො දක්නේ ද, හිර සඳ දෙක නො දක්නේ ද, හෙතෙම ‘සුදු කලු පැහැ රූප නැතැ යි, සුදු කලු රූ දක්නා කෙනෙක් ද නැතැ යි, නිල් පැහැ රූ නැතැ යි, නිල් පැහැ රූ දක්නා කෙනෙක් නැතැ යි, කහවන් රූ නැතැ යි, කහවන් රූ දක්නා කෙනෙක් නැතැ යි, රත් පැහැ රූ නැතැ යි රත් පැහැ රූ දක්නා කෙනෙක් නැතැ යි, මඳටිය පැහැ රූ නැතැ යි, මඳටිය පැහැ රූ දක්නා කෙනෙක් නැතැ යි, සමවිසම තැන් නැතැ යි, සම විසම තැන් දක්නා කෙනෙක් නැතැ යි, හිර සඳ නැති යි, හිර සඳ දක්නා කෙනෙක් නැතැ යි, ‘මම මෙය නො දනිමි, මම මෙය නො දකිමි, එ හෙයින් එය නැතැ’ යි මෙසේ කියන්නේ නම, රාජන්‍යයෙනි, එසේ කියන තැනැත්තේ මනා කොට කියන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්ස, එසේ කියනුයේ මනා කොට නො ම කියන්නේ ය. සුදු කලු රූ ඇත. සුදු කලු රූ දක්නේ ඇත. නිල් පැහැ රූ ඇත, නිල් පැහැ රූ දක්නේ ඇත. කහවන් රූ ඇත, කහවන් රූ දක්නේ ඇත. රත් පැහැ රූ ඇත, රත් පැහැ රූ දක්නේ ඇත. මඳටිය පැහැ රූ ඇත, මඳටිය පැහැ රූ දක්නේ ඇත. සම විසම තැන් ඇත, සම විසම තැන් දක්නේ ඇත. තාරකා රූප ඇත, තාරකා රූප දක්නේ ඇත. හිරු සඳු ඇත, හිරු සඳු දක්නේ ඇත. ‘මම මෙය නො දනිමි, මම මෙය නො දකිමි, එහෙයින් එය නැතැ’ යි කියන්නේ නම්, භවත් කාශ්‍යපයන් වහන්ස, හේ කියන්නේ මනා කොට නො ම කියන්නේ ය.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 524,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“එවමෙව ඛො ත්වං රාජඤ්ඤ ජච්චන්ධූපමො මඤ්ඤෙ පටිභාසි, යං මං ත්වං එවං වදෙසි: කො පනෙතං භොතො කස්සපස්ස ආරොචෙති: අත්ථි දෙවා තාවතිංසාති වා, එවං දීඝායුකා දෙවා තාවතිංසාති වා. න මයං භොතො කස්සපස්ස සද්දහාම අත්ථි දෙවා තාවතිංසාති වා එවං දීඝායුකා දෙවා තාවතිංසාති වා’ති. න ඛො රාජඤ්ඤ එවං පරො ලොකො දට්ඨබ්බො යථා ත්වං මඤ්ඤසි ඉමිනා මංසචක්ඛුනා. යෙ ඛො තෙ රාජඤ්ඤ සමණබ්රාහ්මණා අරඤ්ඤෙ වනපත්ථානි පන්තානි සෙනාසනානි පටිසෙවන්ති අප්පසද්දානි අප්පනිග්ගොසානි, තෙ තත්ථ අප්පමත්තා ආතාපිනො පහිතත්තා විහරන්තා දිබ්බං චක්ඛුං විසොධෙන්ති. තෙ දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන ඉමඤ්චෙව ලොකං පස්සන්ති පරඤ්ච, සත්තෙ ච ඔපපාතිකෙ. එවඤ්ච ඛො රාජඤ්ඤ පරො ලොකො දට්ඨබ්බො. නත්වෙව යථා ත්වං මඤ්ඤසි ඉමිනා මංසචක්ඛුනා. ඉමිනාපි ඛො තෙ රාජඤ්ඤ පරියායෙන එවං හොතු: ඉතිපි අත්ථි පරො ලොකො, අත්ථි සත්තා ඔපපාතිකා, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“කිඤ්චාපි භවං කස්සපො එවමාහ, අථ ඛො එවං මෙ එත්ථ හොති: ඉතිපි නත්ථි පත්තා පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො ති ."
                    },
                    {
                        "type": "paragraph",
                        "text": "9. “අත්ථි පන රාජඤ්ඤ පරියාසො -පෙ- “"
                    },
                    {
                        "type": "paragraph",
                        "text": "“අත්ථි භො කස්සප පරියාසො -පෙ- “"
                    },
                    {
                        "type": "paragraph",
                        "text": "“යථා කථං විය, රාජඤ්ඤාති”?"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “රාජන්‍යයෙනි, එ පරිද්දෙන් ම ‘තව්තිසා වැසි දෙවියෝ ඇතැ යි කියා හෝ තව්තිසා වැසි දෙවියෝ මෙසේ වූ දීර්ඝ ආයුෂයක් ඇත්තාහ යි කියා හෝ මෙය භවත් කාශ්‍යපයන් වහන්සේට කවරෙක් දන්වයි ද? තව්තිසා වැසි දෙවියෝ ඇතැයි කියා හෝ තව්තිසා වැසි දෙවියෝ මෙසේ දීර්ඝායුෂ ඇත්තෝ යැ යි කියා හෝ භවත් කාශ්‍යපයන් වහන්සේ වදාරන වචනය අපි නො ම හදහම්හ’ යි තෙපි යම් වචනයක් මෙසේ මට කියවු ද, එසේ වූ තෙපි මට ජාත්‍යන්ධ එකකු මෙන එළැඹ සිටිති (පෙනෙති). රාජන්‍යයෙනි, ඔබ සිතන පරිදි මේ මසැසින් මෙසේ පරලොව දැක්ක හැකි නො වේ. රාජන්‍යයෙනි, යම් මහණ බමුණු කෙනෙක් නිහඬ වූ මඳ ගිගුම් හඬ ඇති අරණ්‍යයන් වනප්‍රස්තයන් මිනිස්පියෙන් දුරැ පිහිටි සෙනසුන් සෙවිත් ද, ඔහු එහි නො පමා වැ කෙලෙස් තවන වැර ඇති වැ, ප්‍රතිපත්ති විෂයයෙහි මෙහෙයූ සිතැති වැ වසන්නාහු දිවැස පිරිසිදු කෙරෙත්. ඔහු පිරිසිදු වූ මිනිසැස ඉක්මැ පැවැති දිවැසින් මෙ ලොව ද පර ලොව ද උපපාදුක (මැරී පුනර්භවය ලබන) සත්වයන් ද දකිත්. රාජන්‍යයෙනි, මෙසේ ම පර ලොව දැක්කැ යුතු. ඔබ සිතන පරිදි මේ මසැසින් නො ම දැක්කැ හැක්ක. රාජන්‍යයෙනි, මෙ කරුණිනුත් ඔබට ‘මෙසේත් පර ලොව ඇත, මෙසේත් උපපාදුක සත්වයෝ ඇත, මෙසේත් සුකෘත දුෂ්කෘත කර්මයන්ගේ ඵල විපාක ඇතැ’ යි මෙසේ සිතෙක් වේ වා.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්සේ මෙසේ කියතුදු, වැලිත් ‘මෙසේත් පර ලොව නැත, මෙසේත් උපපාදුක සත්වයෝ නැත, මෙසේත් සුකෘත දුෂ්කෘත කර්මයන්ගේ ඵල විපාක නැතැ’යි මෙහි මට මෙසේ සිතෙක් වෙයි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "9. කුමරකසුප් - “රාජන්‍යයෙනි, … යම් කරුණෙකින් මෙසේ සිතෙක් වේ නම්, එබඳු වූ තව කරුණෙක් ඇද්ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්ස, … කරුණෙක් ඇත.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමර - “රාජන්‍යයෙනි, ඒ කෙසේ ද?” ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 526,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“ඉධාහං භො කස්සප පස්සාමි සමණබ්රාහ්මණෙ සීලවන්තෙ කල්යාණධම්මෙ ජීවිතුකාමෙ අමරිතුකාමෙ සුඛකාමෙ දුක්ඛපටික්කූලෙ. තස්ස මය්හං භො කස්සප “එවං හොති: සචෙ ඛො ඉමෙ භොන්තො සමණබ්රාහ්මණා සීලවන්තො කල්යාණධම්මා එවං ජානෙය්යුං: ‘ඉතො නො මතානං සෙෙය්යා භවිස්සතී’ති. ඉදානි මෙ භොන්තො සමණබ්රාහ්මණා සීලවන්තො කල්යාණධම්මා විසං වා ඛාදෙය්යුං, සත්ථං වා ආහරෙය්යුං, උබ්බන්ධිත්වා වා කාලං කරෙය්යුං, පපාතෙ වා පපතෙය්යුං. යස්මා ච ඛො ඉමෙ භොන්තො සමණබ්රාහ්මණා සීලවන්තො කල්යාණධම්මා න එවං ජානන්ති: ඉතො නො මතානං සෙෙය්යා භවිස්සතී ති, තස්මා ඉමෙ භොන්තො සමණබ්රාහ්මණා සීලවන්තො කල්යාණධම්මා ජීවිතුකාමා අමරිතුකාමා සුඛකාමා දුක්ඛපටිකූලා. අත්තානං න මාරෙන්ති’ති. අයම්පි භො කස්සප පරියොසා යෙන මෙ පරියායෙන එවං හොති: ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකොති”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තෙන හි රාජඤ්ඤ උපමන්තෙ කරිස්සාමි. උපමායපි ධෙකච්චෙ විඤ්ඤූ පුරිසා භාසිතස්ස අත්ථං ආජානන්ති. භූතපුබ්බං රාජඤ්ඤ අඤ්ඤතරස්ස බ්රාහ්මණස්ස ද්වෙ පජාපතියො අහෙසුං. එකිස්සා පුත්තො අහොසි දසවස්සුද්දෙසිකො වා ද්වාදසවස්සුද්දෙසිකො වා, එකා ගබ්භිනී උපවිජඤ්ඤා. අථ ඛො සො බ්රාහ්මණො කාලමකාසි. අථ ඛො සො මාණවකො මාතුසපත්තිං එතදවොච: ‘යමිදං භොති ධනං වා ධඤ්ඤං වා රජතං වා ජාතරූපං වා, සබ්බන්තං මය්හං, නත්ථි තුය්හෙත්ථ කිඤ්චි. පිතු මෙ භොති දායජ්ජං නිය්යාතෙහී’ති, එවං වුත්තෙ සා බ්රාහ්මණී තං මාණවකං එතදවොච: ‘ආගමෙහි තාව තාත යාව විජායාමි. සචෙ කුමාරකො භවිස්සති, තස්සපි එකදෙසො භවිස්සති, සචෙ කුමාරිකා භවිස්සති සාපි තෙ ඔපභොග්ගා භවිස්සතීති. දුතියම්පි ඛො සො මාණවකො මාතුසපත්තිං එතදවොච: ‘යමිදං භොති ධනං වා ධඤ්ඤං වා රජතං වා ජාතරූපං වා, සබ්බන්තං මය්හං. නත්ථි තුය්හෙත්ථ කිඤ්චි. පිතු මෙ භොති දායජ්ජං නිය්යාතෙහී’ති. දුතියම්පි ඛො සා බ්රාහ්මණී තං මාණවකං එතදවොච: ආගමෙහි තාව තාත යාව විජායාමි. සචෙ කුමාරකො භවිස්සති, තස්සපි එකදෙසො භවිස්සති, සචෙ කුමාරිකා භවිස්සති, සාපි තෙ ඔපභොග්ගා භවිස්සතී’ති. තතියම්පි ඛො සො මාණවකො මාතුසපත්තිං එතදවොච: ‘යමිදං භොති ධනං වා ධඤ්ඤං වා රජතං වා ජාතරූපං වා සබ්බන්තං මය්හං. නත්ථි තුය්හෙත්ථ කිඤ්චි. පිතු මෙ භොති දායජ්ජං නිය්යාතෙහී’ති. අථ ඛො සා බ්රාහ්මණී සත්ථං ගහෙත්වා ඔවරකං පවිසිත්වා උදරං ඔපාටෙසි: යාව ජනාමි යදි වා කුමාරකො යදි වා කුමාරිකා’ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්ස, මෙහි සිල්වත් වූ කලණ ගුණ ඇති ජීවත් වනු කැමැති, මැරෙනු නො කැමැති, සුව කැමැති, දුකට පිළිකුල් කරන මහණ බමුණන් දකිමි. භවත් කාශ්‍යපයන් වහන්ස, ඒ මට “ඉදින් මේ සිල්වත් කලණ ගුණ ඇති භවත් මහණ බමුණෝ ‘මෙයින් මළා වූ අපට පර ලොවැ සුගති, සැපත වන්නේ යැ’යි දන්නාහු නම්, මේ සිල්වත් ගුණවත් මහණ බමුණෝ වස හෝ කන්නාහ, අවියෙන් හෝ දිවි තොර කැරැ ගන්නාහ, ගෙලැ වැල ලා ගෙන එල්බැ හෝ මැරෙන්නාහ, ප්‍රපාතයෙක හෝ පනින්නාහ. යම් හෙයෙකින් මේ සිල්වත් ගුණවත් මහණ බමුණෝ ‘මෙයින් මළා වූ අපට මරණින් මතු සුගති සැපතක් වෙතැ’යි මෙසේ නො දනිත් ද, එ හෙයින් ජීවත් වනු කැමැත්තාහ, මැරෙනු නො කැමැත්තාහ, සුව කැමැත්තා හ, දුකට පිළිකුල් කරන්නාහ, තමන් නො මරන්නාහ” යි මෙසේ සිතෙක් වෙයි. භවත් කාශ්‍යපයන් වහන්ස, ‘යම් කරුණෙකින් මෙසේත් පරලොව නැත, උපපාදුක සත්වයෝ නැත, කුශලාකුශල කර්මයන්ගේ ඵල විපාක නැතැ’ යි මෙසේ සිතෙක් වෙයි ද, මේත් එයට කරුණෙකි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමර - “රාජන්‍යයෙනි, එසේ වී නම්, ඔබට උපමාවක් කරන්නෙමි. උපමායෙනුදු මෙහි ඇතැම් නුවණැති පුරුෂ කෙනෙක් කී බසේ අරුත් දැන ගනිත්. රාජන්‍යයෙනි, පෙරැ වූවක් කියමි. එක්තරා බමුණකුට දෙදනෙක් බිරියෝ වූහ. එකියකට දස හෝ දොළොස් හවුරුදු වයස් වූ එක් පුතෙක් විය. අනිත් බිරිය දරු ගබක් ඇත්තී වදන්නට ළං වූ කල් ඇත්තී වූ ය. එ කල්හි ඒ බමුණා කලුරිය කෙළේ ය. එ කල්හි ඒ මාණවක තෙම සෙවෙත් මව බණවා, පින්වතිය, මේ යම් ධනයෙක් හෝ ධාන්‍යයෙක් හෝ රිදීයෙක් හෝ රනෙක් හෝ වෙයි ද, ඒ සියල්ල මගේ යැ, ඔබට මෙහි කිසිත් නැත. භවතිය, පියාගෙන් මට උරුම වූ එ වස්තුව මට පවරව’ යි කී ය. මෙසේ කී කල්හි ඒ බැමිණී ඒ මාණවකයාට, ‘දරුව, මා වදන තෙක් බලා පොරොත්තු වව (මා වදන දරු) ඉදින් කුමරෙක් වී නම්, ඔහුටත් එක් කොටසෙක් අයත් වන්නේ ය, ඉදින් කුමරියක් වී නම්, ඕ ද තට පාදපරිචාරිකා වන්නී යැ’යි කිවු ය. දෙවෙනි වරද ඒ මාණවක තෙම සෙවෙත් මවට, ‘පිනවතිය, මේ යම් ධනයෙක් හෝ ධාන්‍යයෙක් හෝ රිදියෙක් හෝ රනෙක් හෝ ඇද්ද, ඒ සියල්ල මගේ ය, මෙහි කිසිත් ඔබට නැත. භවතිය, පියාගෙන් මට උරුම වූ ඒ වස්තුව මට පවරව’ යි කී ය. දෙවෙනි වර ද ඒ බැමිණි ඒ මාණවකහට, ‘දරුව, මා වදන තෙක් බලව, (මා වදන දරු) ඉඳින් කුමරෙක් වී නම් ඔහුටත් එක් කොටසෙක් අයත් වන්නේය, ඉදින් කුමරියක් වී නම්, ඕ ද තට පාදපරිචාරිකා වන්නී යැ’ යි කිවු ය. තෙවනු ද ඒ මාණවක සෙවෙත් මවට ‘පින්වතිය, මේ යම් ධනයෙක් හෝ ධාන්‍යයෙක් හෝ රිදියෙක් හෝ රනෙක් හෝ ඇද්ද, ඒ සියල්ල මා සතු යැ, මෙහි කිසිත් ඔබ සතු නො වෙයි. භවතිය, පියාගෙන් මට උරුම වූ ඒ වස්තුව මට පවරව’ යි කී ය. එකල්හි ඒ බැමිණි ආයුධයක් ගෙන යහන් ගබ වැද, එතෙක් කුසැ දරුවෙක් ඇද්ද නැත හොත් දැරියක් ඇත් දැ යි දැනැගනිමැ’ යි බඩ පැළුෑ දෑ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 528,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සා අත්තානඤ්චෙව ජීවිතඤ්ච ගබ්භඤ්ච සාපතෙය්යඤ්ච විනාසෙසි. යථා තං බාලා අබ්යත්තා අනයබ්යසනං ආපන්නා, අයොනිසො දායජ්ජං ගවෙසන්තී, එවමෙව ඛො ත්වං රාජඤ්ඤ බාලො අබ්යත්තො අනයබ්යසනං ආපජ්ජිස්සසි අයොනිසො පරලොකං ගවෙසන්තො, සෙය්යථාපි සා බ්රාහ්මණී බාලා අබ්යත්තා අනයබ්යසනං ආපන්නා අයොනිසො දායජ්ජං ගවෙසන්තී. න ඛො රාජඤ්ඤ සමණබ්රාහ්මණා සීලවන්තො කල්යාණධම්මා අපක්කං පරිපාචෙන්ති, අපි ච පරිපක්කං ආගමෙන්ති. පණ්ඩිතානං අත්ථො හි රාජඤ්ඤ සමණබ්රාහ්මණානං සීලවන්තානං කල්යාණධම්මානං ජීවිතෙන. යථා යථා ඛො රාජඤ්ඤ සමණබ්රාහ්මණා සීලවන්තො කල්යාණධම්මා චිරං දීඝමද්ධානතිට්ඨන්ති, තථා තථා බහුං පුඤ්ඤං පසවන්ති, බහුජනහිතාය ච පටිපජ්ජන්ති බහුජනසුඛාය ලොකානුකම්පාය අත්ථාය හිතාය සුඛාය දෙවමනුස්සානං. ඉමිනාපි ඛො තෙ රාජඤ්ඤ පරියායෙන එවං හොතු “ඉතිපි අත්ථි පරො ලොකො, අත්ථි සත්තා ඔපපාතිකා, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“කිඤ්චාපි භවං කස්සපො එවමාහ, අථ ඛො එවං මෙ එත්ථ හොති – ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "10. “අත්ථි පන රාජඤ්ඤ පරියායො -පෙ- ”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“අත්ථි භො කස්සප පරියායො -පෙ- ”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“යථා කථං විය රාජඤ්ඤා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“ඉධ මෙ භො කස්සප පුරිසා චොරං ආගුචාරිං ගහෙත්වා දස්සෙන්ති: ‘අයං භන්තෙ චොරො ආගුචාරී, ඉමස්ස යං ඉච්ඡසි තං දණ්ඩං පණෙහී’ති. ත්යාහං එවං වදාමි: ‘තෙන හි භො ඉමං පුරිසං ජීවන්තං යෙව කුම්භියා පක්ඛිපිත්වා මුඛං පිදහිත්වා අල්ලෙන චම්මෙන ඔනන්ධිත්වා අල්ලාය මත්තිකාය බහලාවලෙපනං කාරෙත්වා උද්ධනං ආරොපෙත්වා අග්ගිං දෙථා’ති. තෙ මෙ ‘සාධූ’ති පටිස්සුත්වා තං පුරිසං ජීවන්තං යෙව කුම්භියා පක්ඛිපිත්වා මුඛං පිදහිත්වා අල්ලෙන චම්මෙන ඔනන්ධිත්වා අල්ලාය මත්තිකාය බහලාවලෙපනං කාරෙත්වා උද්ධනං ආරොපෙත්වා අග්ගිං දෙන්ති. යදා මයං ජානාම ‘කාලකතො සො පුරිසො’ති අථ නං කුම්භිං ඔරොපෙත්වා උබ්භින්දිත්වා මුඛං විවරිත්වා සණිකං නිල්ලොකෙම ‘අප්පෙවනාමස්ස ජීවං නික්ඛමන්තං පස්සෙය්යාමා’ති. නෙවස්ස මයං ජීවං නික්ඛමන්තං පස්සාම. අයම්පි ඛො භො කස්සප පරියායො යෙන මෙ පරියායෙන එවං හොති: ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති.”"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ඕ තොමෝ, බාල වූ අව්‍යක්ත වූ ස්ත්‍රියක් යම්සේ නොමඟින් දෑවැද්ද සොයන්නී අනයව්‍යසනයට පැමිණියාද, එසේ ම තොමෝ ද ජීවිතය ද දරුගබ ද වස්තුව ද නසාලූ දෑය. එසේ ම රාජන්‍යයෙනි, යම්සේ ඒ අනුවණ නොවියත් ස්ත්‍රී නොමඟින් දෑවැද්ද සොයන්නී අන්‍යව්‍යවසනයට පැමිණියා ද, එසේ ම අනුවණ වූ නොවියත් වූ ඔබ නොමඟින් පර ලොව සොයන්නාහු අනයව්‍යසනයට පැමිණෙන්නාහු ය. රාජන්‍යයෙනි, සිල්වත් ගුණවත් මහණබමුණෝ නොමුහු කළ (නො ගෙවුණා වූ) ආයුෂය අතරැ නො ම සිඳ ලත්. එහෙත්, ඒ නුවණැත්තෝ ආයුෂයාගේ පරිපාකය බලාපොරොත්තු වෙත්. රාජන්‍යයෙනි, සිල්වත් ගුණවත් මහණ බමුණනට ජීවිතයෙන් වැඩ ඇත් ම ය. රාජන්‍යයෙනි, යම් යම් සේ ම සිල්වත් ගුණවත් මහණ බමුණෝ බොහෝ දික් කලක් සිටිත් ද, එසේ එසේ බොහෝ පින් රැස් කෙරෙත්, බොහෝ දෙනාට හිත පිණිස ද බොහෝ දෙනාට සුව පිණිස ද ලොවට අනුකම්පා පිණිස ද දෙව් මිනිස්නට වැඩ පිණිස ද හිත පිණිස ද, සුව පිණිස ද පිළිපදිත්. රාජන්‍යයෙනි, මේ කරුණිනුත් ඔබට ‘මෙසේත් පරලොව ඇත, උපපාදුක සත්වයෝ ඇත, කුශලාකුශල කර්මයන්ගේ ඵල විපාක ඇතැ’යි මෙසේ සිතෙක් වේ වා.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසි - ‘භවත් කාශ්‍යපයන් වහන්සේ මෙසේ කියතත්, මෙ කරුණෙහි මට වැලිදු ‘මෙසේත් පර ලොව නැතැ යි, උපපාදුක සත්වයෝ නැතැ යි, සුකෘත දුෂ්කෘත කර්මයනට ඵල විපාක නැතැ’ යි ම මෙබඳු සිතෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "10. කුමර කසුප් - “රාජන්‍යයෙනි … එයට කරුණෙක් ඇත් ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසි - “භවත් කාශ්‍යපයන් වහන්ස, … එයට කරුණෙක් ඇත.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “ඒ කෙසේ වූයෙක් ද, රාජන්‍යයෙනි?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසි - “භවත් කාශ්‍යපයන් වහන්ස, මෙහි මගේ පුරුෂයෝ වරද කළ සොරකු අල්ලා ගෙන, ‘ස්වාමීනි, මේ ඔබට වරද කළ සොරෙකි, මොහුට යමක් කරනු කැමැත්තාහු ද, ඒ දඬුවම පණවන්නැ’ යි දක්වත්. ඔවුනට මම, ‘භවත්නි, එසේ වී නම්, ජීවත් වන්නාවූ ම මේ පුරුෂයා සැළෙක බහා මුව වසා පියා, තෙත් සමින්, වෙළා, තෙත් මැටියෙන් ඝන ලෙස ආලේප කරවා උදුනට නඟා ගිනි දෙවු යැ යි මෙසේ කීමි. ඔහු ‘මැනැවැ’ යි මට පිළිවදන් දී ජීවත් වන්නාවූ ම ඒ පුරුෂයා සැළෙක බහා මුව වසාපියා, තෙත් සමින් වෙළා, තෙත් මැටියෙන් ඝන ලෙස ආලේප කරවා උදුනට නඟා ගිනි දුන්හ. යම්විටෙක ‘ඒ පුරුෂයා කලුරිය කෙළේ යැ යි අපි දැන ගත්තමෝ ද, එ විටැ ඒ සැළ (උදුනෙන්) බා, (පිටතැ වූ) ආලේපය බිඳ, මුව වසුන් හැරැ ‘නික්මෙන්නා වූ ඔහුගේ ජීවය දකින්නමෝ නම් ඉතා යෙහෙකැ’යි සෙමෙන් බැලූමු. අපි නික්මෙන්නා වූ ඔහුගේ ජීවය නො ම දුටුමු. භවත් කාශ්‍යපයන් වහන්ස, යම් කරුණෙකින් අපට, ‘මෙසේත් පර ලොව නැත, මෙසේ උපපාදුක සත්වයෝ නැත, මෙසේත් සුකෘත දුෂ්කෘත කර්මයනට ඵල විපාක නැතැ’ යි මෙබඳු සිතෙක් වේ ද, මේත් ඒ එක් කරුණෙක.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 530,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“තෙන හි රාජඤ්ඤ තඤ්ඤෙවෙත්ථ පටිපුච්ඡිස්සාමි, යථා තෙ ඛමෙය්ය තථා නං බ්යාකරෙය්යාසි. අභිජානාසි නො ත්වං රාජඤ්ඤ දිවාසෙය්යං උපගතො සුපිනකං පස්සිතා ආරාමරාමණෙය්යකං වනරාමණෙය්යකං භූමිරාමණෙය්යකං පොක්ඛරණීරාමණෙය්යකන්ති?”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“අභිජානාමහං භො කස්සප දිවාසෙය්යං උපගතො සුපිනකං පස්සිතා ආරාමරාමණෙය්යකං වනරාමණෙය්යකං භූමිරාමණෙය්යකං පොක්ඛරණීරාමණෙය්යකන්ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“රක්ඛන්ති තං තම්හි සමයෙ ඛුජ්ජා පි වාමනකා පි කෙළාසිකාපි කොමාරිකාපී?ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“එවං භො කස්සප රක්ඛන්ති මං තස්මිං සමයෙ ඛුජ්ජාපි වාමනකාපි කෙළාසිකාපි කොමාරිකාපී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අපි නු තා තුය්හං ජීවං පස්සන්ති පවිසන්තං වා නික්ඛමන්තං වා?ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භො කස්සප”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තා හි නාම රාජඤ්ඤ තුය්හං ජීවන්තස්ස ජීවන්තියො ජීවං න පස්සිස්සන්ති පවිසන්තං වා නික්ඛමන්තං වා. කිම්පන ත්වං කාලකතස්ස ජීවං පස්සිස්සසි පවිසන්තං වා නික්ඛමන්තං වා? ඉමිනාපි ඛො තෙ රාජඤ්ඤ පරියායෙන එවං හොතු: ඉතිපි අත්ථි පරො ලොකො, අත්ථි සත්තා ඔපපාතිකා, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“කිඤ්චාපි භවං කස්සපො එවමාහ, අථ ඛො එවං මෙ එත්ථ හොති; ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "11. “අත්ථි පන රාජඤ්ඤ පරියායො -පෙ- ”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“අත්ථි භො කස්සප පරියායො -පෙ- ”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“යථා කථං විය රාජඤ්ඤා?ති?”"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “එසේ වී නම් රාජන්‍යයෙනි, මෙහි ලා ඔබ ම පිළිවිසින්නමු. ඔබට යම් සේ රිසියෙන් නේ ද, එසේ එය විසඳන්න. රාජන්‍යයිනි, දිවා නින්දට බටුවාවූ ඔබ සිත්කලු ආරාම ද, සිත් කලු වන ද, සිත් කලු බිම් ද සිත්කලු පොකුණු ද සිහිනෙන් දුටුවා දනිත් ද (සිහි කෙරෙත් ද)?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසි - “භවත් කාශ්‍යපයන් වහන්ස, දහවල් නින්දට බටුවා වූ මම් සිත් කලු ආරාම ද සිත්කලු වන ද සිත්කලු බිම් ද සිත්කලු පොකුණු ද සිහිනෙන් දුටුවා දනිමි (සිහි කරමි)”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “ඒ වේලෙහි කුදු ගැහැනු ද මිටි ගැහැනු ද බාල දැරියෝ ද තරුණ දැරියෝ ද ඔබට රකවල් කෙරෙත් ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසි - “එසේ ය භවත් කාශ්‍යපයන් වහන්ස, එ වේලෙහි කුදු ගැහැනු ද මිටි ගැහැනු ද බාල දැරියෝ ද තුරුණු දැරියෝ ද මට රකවල් කෙරෙත්.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “ඔහු (එ වේලෙහි) පිවිසෙන හෝ නික්මෙන ඔබේ ජීවය දකිද්ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසි - “භවත් කාශ්‍යපයන් වහන්ස, මෙය නො වෙයි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “රාජන්‍යයෙනි, ඒ ස්ත්‍රීහු වූකලි තුමූ ජීවත් වන්නෝ ජීවත් වන ඔබේ පිවිසෙන හෝ නිකමෙන ජීවය නො දකිත්. කිමෙක් ද ඔබ කලුරිය කළාහුගේ පිවිසෙන හෝ නික්මෙන ජීවය දකිනු හැක්කාහු ද? රාජන්‍යයෙනි, මෙ කරුණිනුත් ‘මෙසේත් පර ලොව ඇත, උපපාදුක සත්වයෝ ඇත, සුකෘත දුෂ්කෘත කර්මයන්ගේ ඵල විපාක ඇතැ’ යි ඔබට මෙසේ සිතෙක් වේ වා.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසි - “භවත් කාශ්‍යපයන් වහන්සේ මෙසේ කියතුදු ‘මෙසේත් පරලොව නැතැ යි, උපපාදුක සත්තු නැතැ යි, සුකෘත දුෂ්කෘත කර්මයනට ඵල විපාක නැතැ’ යි මට මෙහි මෙබඳු සිතෙක් වෙයි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "11. කුමරකසුප් - “රාජන්‍යයෙනි, … එසේ කියන්නට කරුණෙක් ඇද්ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසි - “භවත් කාශ්‍යපයන් වහන්ස, … මෙසේ කියන්නට (තව) කරුණෙක් ඇත.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “ඒ කෙබඳු ද, රාජන්‍යයෙනි?”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 532,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“ඉධ මෙ භො කස්සප පුරිසා චොරං ආගුචාරිං ගහෙත්වා දස්සෙන්ති. අයං තෙ භන්තෙ චොරො ආගුචාරී, ඉමස්ස යං ඉච්ඡසි තං දණ්ඩං පණෙහී’ති. ත්යාහං එවං වදාමි: ‘තෙන හි භො ඉමං පුරිසං ජීවන්තං යෙව තුලාය තුලෙත්වා ජියාය අනස්සාසකං මාරෙත්වා පුනදෙව තුලාය තුලෙථා’ති. තෙ මෙ ‘සාධූ’ති පටිස්සුත්වා තං පුරිසං ජීවන්තං යෙව තුලාය තුලෙත්වා ජිසාය අනස්සාසකං මාරෙත්වා පුනදෙව තුලාය තුලෙන්ති. යදා සො ජීවති, තදා ලහුතරො ච හොති මුදුතරො ච කම්මඤ්ඤතරො ච. යදා පන සො කාලකතො හොති, තදා ගරුතරො ච හොති පත්ථින්නතරො ච අකම්මඤ්ඤතරො ච. අයම්පි ඛො භො කස්සප පරියාසො යෙන මෙ පරියායෙන එවං හොති: ‘ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“තෙන හි රාජඤ්ඤ උපමන්තෙ කරිස්සාමි. උපමායමිධෙකච්චෙ විඤ්ඤූ පුරිසා භාසිතස්ස අත්ථං ආජානන්ති. සෙය්යථාපි රාජඤ්ඤ පුරිසො දිවසං සන්තත්තං අයොගුළං ආදිත්තං සම්පජ්ජලිතං සජොතිභූතං තුලාය තුලෙය්ය. තමෙනං අපරෙන සමයෙන සීතං නිබ්බුතං තුලාය තුලෙය්ය. කදා නු ඛො සො අයොගුළො ලහුතරො වා හොති මුදුතරො වා කම්මඤ්ඤතරො වා? යදා වා ආදිත්ත සම්පජ්ජලිතො සජොතිභූතො, යදා වා සීතො නිබ්බුතො?ති”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“යදා සො භො කස්සප අයොගුළො තෙජොසහගතො ච හොති වායොසහගතො ච ආදිත්තො සම්පජ්ජලිතො සජොතිභූතො, තදා ලහුතරො ච හොති මුදුතරො ච කම්මඤ්ඤතරො ච. යදා ච පන සො අයොගුළො නෙව තෙජොසහගතො හොති න වායොසහගතො සීතො නිබ්බුතො, තදා ගරුතරො ච හොති පත්ථින්නතරො ච අකම්මඤ්ඤතරො චා ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“එවමෙව ඛො රාජඤ්ඤ යදා’යං කායො ආයුසහගතො ච හොති උස්මාසහගතො ච විඤ්ඤාණසහගතො ච, තදා ලහුතරො ච හොති මුදුතරො ච කම්මඤ්ඤතරො ච. යදා පනායං කායො නෙව ආයුසහගතො හොති න උස්මාසහගතො න විඤ්ඤාණසහගතො තදා ගරුතරො ච හොති පත්ථින්නතරො ච අකම්මඤ්ඤතරො ච. ඉමිනාපි ඛො තෙ රාජඤ්ඤ පරියායෙන එවං හොතු: ඉතිපි අත්ථි පරො ලොකො, අත්ථි සත්තා ඔපපාතිකා, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "පායාසි - “භවත් කාශ්‍යපයන් වහන්ස, මෙහි මගේ පුරුෂයෝ වරද කරු සොරකු අල්ලා ගෙන ‘ස්වාමීනි, මේ ඔබට වරද කළ සොරෙකි. යමක් කැමැත්තාහු නම්, ඒ දඬුවමක් මොහුට පමුණුවන්නැ’යි දක්වත්. මම් ඔවුන් බණවා, ‘එසේ වී නම් භවත්නි, ජීවත්වන්නා වූ ම මේ පුරුෂයා තරාදියෙන් කිරා හුස්ම ගත නොහැකි සේ කොට දුනුදියෙන් ගෙල වෙළා මරා යලිදු තරාදියෙන් කිරවු’ යැ යි මෙසේ කීමි. ඔහු මට ‘මැනැවැ’ යි පිළිවදන් දී, ජීවත් වන්නාවූ ම ඒ පුරුෂයා තරාදියෙන් කිරා හුස්ම ගත නො හෙන සේ දුනුදියෙන් ගෙළ වෙළා මරා යලිදු තරාදියෙන් කිරූහ. යම් කලෙක හේ ජීවත් වී ද, එ කලැ (ඔහු සිරුර) වඩා හෑල්ලු ද වඩා මොලොක් ද වඩා කර්මණ්‍ය ද විය. යම් විටෙක වනාහි හේ කලුරිය කෙළේ වේ ද, එ කලැ (ඔහු සිරුර) වඩා බර ද වඩා දැඩි ද වඩා අකර්මණ්‍ය ද වෙයි. භවත් කාශ්‍යපයන් වහන්ස, යම් කරුණෙකින් මට ‘මෙසේත් පරලොව නැත, උපපාදුක සත්වයෝ නැත, කුශලාකුශල කර්මයන්ගේ ඵල විපාක නැතැ’ යි මෙසේ සිතෙක් වෙයි ද, මේ ද ඒ එකේ කාරණයෙකි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “රාජන්‍යයිනි, එසේ වී නම් ඔබට උපමාවක් කරන්නමි. උපමායෙන් ද මෙහි ඇතැම් නුවණැති පුරුෂයෝ කියන ලද වචනයේ අරුත් දැනැගන්නාහ. රාජන්‍යයෙනි, යම් සේ පුරුෂයෙක් මුළු දවසෙහි ම රත් කරන ලද ගින්නෙන් ඇවිළ ගත්, ගින්නෙන් දිලියෙන, ගිනි දැල් සහිත යගුළියක් තරාදියෙන් කිරන්නේ නම්, පසු කලෙක සිසිල් වූ, නිවුණූ ඒ යගුළිය තරාදියෙන් කිරන්නේ නම්, කවර දා නම් ඒ යගුළිය වඩා හෑල්ලු හෝ වඩා මොළොක් හෝ වඩා කර්මණ්‍ය හෝ වෙයි ද? යම් විටෙක ගින්නෙන් ඇවිල ගත්තේ ගින්නෙන් දිලිසුණේ ගිනිදැල් සහිත වූයේ වී නම් එ විට ද නැත හොත් යම් විටෙක එය සිසිල් වූයේ නිවුණේ වී නම් එ විට ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්ස, යම් විටෙක ඒ යගුළිය ගිනි සහිතත් වේ ද වායු සහිතත් වේ ද, ගිනි ගත්තේ, ගින්නෙන් ඇවිළුණේ, ගිනිදැල් සහිත වේ ද, එ විටැ එය වඩා හෑල්ලු ද වඩා මොළොක් ද වඩා කර්මණ්‍ය ද වෙයි. යම් විටෙක වනාහි ඒ යගුළිය නො ම ගිනි සහිත වේ ද නො ම වායු සහිත වේ ද සිසිල් වේ ද නිවියේ වේ ද එවිට වඩා බර ද වඩා තද ද වඩා අකර්මණ්‍ය ද වෙයි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “රාජන්‍යයෙනි, එසේ ම යම් කලෙක වනාහි මේ සිරුර ආයුෂ සහිතත් වේ ද, උණූසුම් සහිතත් වේ ද, විඥාන සහිතත් වේ ද, එ කලැ වඩා හෑල්ලු ද වඩා මොළොක් ද වඩා කර්මණ්‍ය ද වෙයි. යම් කලෙක වනාහි මෙ සිරුර නො ම ආයුසහිත වේ ද, නො ම උණුසුම් සහිත වේ ද, නො ම විඥාන සහිත වේ ද, එ කලැ වඩා බර ද වඩා තෙද ද වඩා අකර්මණ්‍ය ද වෙයි. රාජන්‍යයෙනි, මෙ කරුණෙනුත් ඔබට ‘මෙසේත් පර ලොව ඇත, මෙසේත් උපපාදුක සත්හු ඇත, මෙසේත් සුකෘත දුෂ්කෘත කර්මයන්ගේ ඵල විපාක ඇතැ’ යි මෙබඳු සිතෙක් වේ වා.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 534,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“කිඤ්චාපි භවං කස්සපො එවමාහ අථ ඛො එවං මෙ එත්ථ හොති: ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "12. “අත්ථි පන රාජඤ්ඤ පරියායො -පෙ- ”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“අත්ථි භො කස්සප පරියායො -පෙ- ”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“යථා කථං විය රාජඤ්ඤාති”?"
                    },
                    {
                        "type": "paragraph",
                        "text": "“ඉධ මෙ භො කස්සප පුරිසා චොරං ආගුචාරිං ගහෙත්වා දස්සෙන්ති; ‘අයන්තෙ භන්තෙ චොරො ආගුචාරී, ඉමස්ස යං ඉච්ඡසි තං දණ්ඩං පණෙහී’ති. ත්යාහං එවං වදාමි; තෙන හි භො ඉමං පුරිසං අනුපහච්ච ඡවිඤ්ච චම්මඤ්ච මංසඤ්ච න්හාරුඤ්ච අට්ඨිඤ්ච අට්ඨිමිඤ්ජඤ්ච ජීවිතා වොරොපෙථා’ති. තෙ මෙ ‘සාධූ’ති පටිස්සුත්වා තං පුරිසං අනුපහච්ච ඡවිඤ්ච චම්මඤ්ච මංසඤ්ච න්හාරුඤ්ච අට්ඨිඤ්ච අට්ඨිමිඤ්ජඤ්ච ජීවිතා වොරොපෙන්ති. යදා සො ආමතො හොති, ත්යාහං එවං වදාමි: තෙන හි භො ඉමං පුරිසං උත්තානං නිපාතෙථ, අප්පෙවනාමස්ස ජීවං නික්ඛමන්තං පස්සෙය්යාමාති. තෙ තං පුරිසං උත්තානං නිපාතෙන්ති. නෙවස්ස මයං ජීවං නික්ඛමන්තං පස්සාම. ත්යාහං එවං වදාමි; තෙන හි භො ඉමං පුරිසං අවකුජ්ජං නිපාතෙථ, -පෙ- පස්සෙන නිපාතෙථ -පෙ- දුතියෙන පස්සෙන නිපාතෙථ, -පෙ- උද්ධං ඨපෙථ -පෙ- ඔමුද්ධකං ඨපෙථ -පෙ- පාණිනා ආකොටෙථ -පෙ- ලෙඩ්ඨුනා ආකොටෙථ -පෙ- දණ්ඩෙන ආකොටෙථ -පෙ- සත්ථෙන ආකොටෙථ -පෙ- ඔධුනාථ -පෙ- සන්ධුනාථ -පෙ- නිද්ධුනාථ, ‘අප්පෙව නාමස්ස ජීවං නික්ඛමන්තං පස්සෙය්යාමා’ති. තෙ තං පුරිසං අවකුජ්ජ නිපාතෙන්ති -පෙ- පස්සෙන නිපාතෙන්ති -පෙ- දුතියෙන පස්සෙන නිපාතෙන්ති -පෙ- උද්ධං ඨපෙන්ති -පෙ- ඔමුද්ධකං ඨපෙන්ති -පෙ- පාණිනා ආකොටෙන්ති -පෙ- ලෙඩ්ඪුනා ආකොටෙන්ති -පෙ- දණ්ඩෙන ආකොටෙන්ති -පෙ- සත්ථෙන ආකොටෙන්ති -පෙ- ඔධුනන්ති -පෙ- සන්ධුනන්ති -පෙ- නිද්ධුනන්ති. නෙවස්ස මයං ජීවං නික්ඛමන්තං පස්සාම. තස්ස තදෙව චක්ඛු හොති තෙ රූපා තඤ්චායතනං නප්පටිසංවෙදෙති. තදෙව සොතං හොති තෙ සද්දා තඤ්චායතනං නප්පටිසංවෙදෙති. තදෙව ඝානං හොති තෙ ගන්ධා තඤ්චායතනං නප්පටිසංවෙදෙති. සා යෙව ජිව්හා හොති තෙ රසා තඤ්චායතනං නප්පටිසංවෙදෙති. ස්වෙව කායො හොති තෙ ඵොට්ඨබ්බා තඤ්චායතනං නප්පටිසංවෙදෙති. අයම්පි ඛො භො කස්සප පරියායො යෙන මෙ පරියායෙන එවං හොති: ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති”."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්සේ එසේ කියතත්, වැලිදු මට ‘මෙසේත් පරලොව නැත, මෙසේත් උපපාදුක සත්හු නැත, මෙසේත් කුශලාකුශල කර්මයනට ඵල විපාක නැතැ’යි මෙහි මෙබඳු සිතෙක් වෙයි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "12. කුමර කසුප් - “රාජන්‍යයෙනි, … එසේ සිතන්නට කරුණෙක් ඇද්ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්ස, … එසේ සිතන්නට කරුණෙක් ඇත.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමර කසුප් - “ඒ කෙසේ වූයෙක් ද? රාජන්‍යයෙනි?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්ස, මෙහි මගේ සේවක පුරුෂයෝ, ‘ස්වාමීනි, මේ ඔබට වරද කළ සොරෙකි. මොහුට ඔබට රිසියෙන දඬුවමක් පණවන්නැ’යි කියා වරද කළ සොරකු අල්ලා ගෙනවුත් මට දක්වත්. මම් ඔවුනට, ‘එසේ වී නම් භවත්නි, මේ මිනිසා (මොහුගේ) සිවිය ද සම ද මස් ද නහර ද ඇට ද ඇට මිඳුලු ද නො නසා දිවියෙන් තොර කරවු’ යැ යි කියමි. ඔහු මට ‘මැනැවැ’ යි පිළිවදන් දී, සිවිය ද සම ද මස් ද නහර ද ඇට ද ඇට මිඳුලු ද නො නසා ඒ මිනිසා දිවියෙන් තොර කරති. යම් විටෙක ඔහුගේ ප්‍රාණය නිරුද්ධ වන්නට පටන්ගත්තේ වේ ද, එ විටැ මම් ඔවුන් බණවා, ‘භවත්නි, එසේ වී නම්, මොහුගේ නික්මෙන ජීවය දකුමෝ නම් යෙහෙකි. එහෙයින් මොහු උඩුකුරු කොට හොවවු’ යි කියමි. ඔහු ඒ මිනිසා උඩුකුරු කොට හොවත්. අපි ඔහුගේ නික්මෙන ජීවය නො දකුම්හ. ඔවුනට මම් එසේ වී නම් භවත්නි, මේ මිනිසාගේ නික්මෙන ජීවය දකුමෝ නම් යෙහෙක, එහෙයින් මේ මිනිසා යැටි කුරු කොට හොවවු ... ඇලයෙන් හොවවු … දෙවෙනි ඇලයෙන් හොවවු … උඩු අතට තබවු … යැටි අතට තබවු … අතින් තළවු … ගලින් තළවු … දංඩෙන් තළවු … අවියෙන් ගසවු ... මෙහාට පෙරළවු … එහාට පෙරළවු … එහාටත් මෙහාටත් පෙරළවු’ යැ යි මෙසේ කියමි. ඔහු ඒ මිනිසා යැටිකුරු කොට තබත් … ඇලයෙන් හොවත් … දෙවෙනි ඇලයෙන් හොවත් … උඩු අතට තබත් … යැටි අතට තබත් … අතින් තළත් … ගලින් තළත් … දංඩෙන් තළත් … අවියෙන් ගසත් … මෙහාට පෙරළත් … එහාට පෙරළත් … එහාටත් මෙහාටත් පෙරළත්. එහෙත් අපි ඔහුගේ නික්මෙන ජීවය නො දකිමු. ඔහුගේ ඒ ඇස ම වේ. ඒ රූපයෝ ම වෙත්. එහෙත් ඇස ඒ රූපායතනය පහළ නො කෙරෙයි. ඔහුගේ ඒ කන ම වේ. ඒ ශබ්දයෝ ම වෙත්. එහෙත් කන ඒ ශබ්දායතනය පහළ නො කෙරෙයි. ඒ නාසාව ම වේ. ඒ ගන්ධයෝ ම වෙත්. එහෙත් නාසාව ඒ ගන්ධායතනය පහළ නො කෙරෙයි. ඒ දිව ම වේවි. ඒ රසයෝ ම වෙත්. එහෙත් දිව ඒ රසායතනය පහළ නො කෙරෙයි. ඒ කය ම වේ. ඒ ස්ප්‍රෂ්ටව්‍යයෝ ම වෙත්. එහෙත් එය ඒ ස්ප්‍රෂ්ටව්‍යාතනය පහළ නො කෙරෙයි. භවත් කාශ්‍යපයන් වහන්ස, යම් කරුණෙකින් ‘මෙසේත් පර ලොව නැත, මෙසේත් උපපාදුක සත්වයෝ නැත, මෙසේත් කුශලාකුශල කර්මයන්ගේ ඵල විපාක නැතැ’ යි මට මෙබඳු සිතෙක් වේ නම්, මේ ඒ කරුණ ය.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 536,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“තෙන හි රාජඤ්ඤ උපමන්තෙ කරිස්සාමි. උපමායපිධෙකච්චෙ විඤ්ඤූ පුරිසා භාසිතස්ස අත්ථං ආජානන්ති. භූතපුබ්බං රාජඤ්ඤ අඤ්ඤතරො සඞ්ඛධමො සඞ්ඛං ආදාය පච්චන්තිමං ජනපදං අගමාසි. සො යෙනඤ්ඤතරො ගාමො තෙනුපසඞ්කමි, උපසඞ්කමිත්වා මජ්ඣෙ ගාමස්ස ඨිතො තික්ඛත්තුං සඞ්ඛං උපලාපෙත්වා සඞ්ඛං භූමියං නික්ඛිපිත්වා එකමන්තං නිසීදි. අථ ඛො රාජඤ්ඤ තෙසං පච්චන්තජානපදානං මනුස්සානං එතදහොසි: අම්භො කස්ස නු ඛො එසො සද්දො එවංරජනීයො එවංකමනීයො එවංමදනීයො එවංබන්ධනීයො එවංමුච්ඡනීයො?ති. සන්නිපතිත්වා තං සඞ්ඛධමං එතදවොචුං: අම්භො කස්ස නු ඛො එසො සද්දො එවං රජනීයො එවං කමනීයො එවං මදනීයො එවං බන්ධනීයො එවං මුච්ඡනීයො?ති. “එසො ඛො භො සඞ්ඛො නාම යස්සෙසො සද්දො එවං රජනීයො එවං කමනීයො එවං මදනීයො එවං බන්ධනීයො එවං මුච්ඡනීයො’ති. තෙ තං සඞ්ඛං උත්තානං නිපාතෙසුං: ‘වදෙහි භො සඞ්ඛ, වදෙහි භො සඞ්ඛා’ති. නෙව සො සඞ්ඛො සද්දමකාසි. තෙ තං සඞ්ඛං අවකුජ්ජං නිපාතෙසුං -පෙ- පස්සෙන නිපාතෙසුං -පෙ- දුතියෙන පස්සෙන නිපාතෙසුං -පෙ- උද්ධං ඨපෙසුං -පෙ- ඔමුද්ධකං ඨපෙසුං -පෙ- පාණිනා ආකොටෙසුං -පෙ- ලෙඩ්ඩුනා ආකොටෙසුං -පෙ- දණ්ඩෙන ආකොටෙසුං -පෙ- සත්ථෙන ආකොටෙසුං -පෙ- ඔධුනිංසු -පෙ- සන්ධුනිංසු -පෙ- නිද්ධුනිංසු: ‘වදෙහි භො සඞ්ඛ, වදෙහි භො සඞ්ඛා’ති. නෙව සො සඞ්ඛො සද්දමකාසි. අථ ඛො රාජඤ්ඤ තස්ස සඞ්ඛධමස්ස එතදහොසි: යාවබාලා ඉමෙ පච්චන්තජානපදා මනුස්සා. කථං හි නාම අසොනිසො සඞ්ඛසද්දං ගවෙසිස්සන්තී’ති. තෙසං පෙක්ඛමානානං සඞ්ඛං ගහෙත්වා තික්ඛත්තුං සඞ්ඛං උපලාපෙත්වා සඞ්ඛං ආදාය පක්කාමි. අථ ඛො රාජඤ්ඤ තෙසං පච්චන්තජානපදානං මනුස්සානං එතදහොසි: යදා කිර භො අයං සඞ්ඛො නාම පුරිසසහගතො ච හොති, වායාමසහගතො ච, වායුසහගතො ච, තදායං සඞ්ඛො සද්දං කරොති, යදා පනායං සඞ්ඛො නෙව පුරිසසහගතො හොති න වායාමසහගතො න වායුසහගතො, නායං සඞ්ඛො සද්දං කරොතී’ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “එසේ වී නම් රාජන්‍යයෙනි, ඔබට උපමාවක් කරන්නෙමි. මෙහි ඇතැම් නුවණැති පුරුෂයෝ උපමායෙන් කියන ලද වචනයේ අරුත් දැනගනිත්. පෙර වූවක් කියම්. රාජන්‍යයෙනි, එක්තරා සක් පිඹින්නෙක් සකක් ගෙන පසල් දනව්වකට ගියේ ය. හේ එක්තරා ගමක් කරා එළැඹියේ ය. එළැඹ ගම මැදැ සිටියේ, සක තුන් වරක් හඬවා සක බිමැ තබා එක් පසෙක හුන්නේ ය. රාජන්‍යයෙනි, එ කලැ ‘පින්වත්නි, මෙසේ ඇලුම් කටයුතු, මෙසේ සිත්කලු, මෙසේ අසන්නන් මත් කරන, මෙසේ සිත් බඳනට කරුණු වූ, මෙසේ අසන්නන් මුසපත් කරන මේ හඬ කවරක් හු ගේ දැ?’ යි ඒ පසල් දනවුවැසි මිනිස්නට මේ සිත විය. ඔහු රැස් වැ ඒ සක් පිඹින්නාහු බණවා, ‘හෙම්බා පුරුෂය, මෙසේ ඇලුම් කටයුතු, මෙසේ සිත්කලු, මෙසේ අසන්නන් මත් කරන, මෙසේ සිත් බඳනට කරුණු වු මෙසේ අසන්නන් මුසපත් කරණ මේ හඞ කවරක්හු ගේ දැ?’ විචාළාහ. ‘භවත්නි, යමක්හුගේ මෙසේ ඇලුම් කටයුතු, මෙසේ සිත්කලු, මෙසේ අසන්නන් මත් කරන, මෙසේ සිත් බඳනට කරුණු වු, මෙසේ අසන්නන් මුසපත් කරණ මේ හඞ යමක් හු ගේ ද එය මේ සක නමැ’ යි සක්පිඹින්නා කී ය. ඔහු ‘පින්වත්, සක හඬ නඟව, පින්වත් සක හඬ නඟව’ යි ඒ සක උඩුකුරු කොට හෙවූහ. සක හඞ නොම පැවැත් විය … ඔහු ඒ සක යටිකුරු කොට හෙවූහ ... පසෙකින් හෙවූහ … දෙවෙනි පසෙන් හෙවූ හ … මුදුන උඩට සිටිනා සේ තැබූහ … මුදුන යටට සිටුනා සේ තැබූහ … අත්ලෙන් තැළුෑහ … ගලින් තැළුෑහ … දංඩෙන් තැළුෑහ ... අවියෙන් ගැසූ හ … මෑතට පෙරළුෑහ … ඈතට පෙරළුෑහ. ‘පිනවත් සක, හඬ නඟව, පින්වත් සක හඬ නගව’ යි කියා ඈත මෑත පෙරැළුෑහ. (එහෙත්) සක හඬ නො ම පැවැත්වී ය. රාජන්‍යයෙනි, එ විට ඒ සක් පිඹින්නහුට ‘මේ පසල් දනවුවැසි මිනිස්සු කොතරම් අඥාන ද! මොහු කෙසේ නම් නො මඟින් සක් හඬ සොයන්නාහු දැ?”යි මේ සිත විය. හේ ඔවුන් බලා සිටියැ දී ම සක ගෙන තුන් වරක් සක හඬවා (සක පිඹ) එය රැගෙන නික්මැ ගියේ ය. රාජන්‍යයෙනි, ඉක්බිති ඒ පසල් දනවුවැසි මිනිස්නට, ‘භවත්නි, යම් විටෙක මේ සක මිනිසකු හා එක් වැ පැවැත්තේ ද, මිනිසාගේ උත්සාහය හා එක් වැ පැවැත්තේ ද, වායුව හා එක් වැ පැවැත්තේ ද, එකල මේ සක හඬ කෙරෙයි. යම් විටෙක වූ කලී මේ සක මිනිසකු හා එක් වැ නො පැවැත්තේ ද, මිනිසාගේ උත්සාහය හා එක් වැ නො පැවැත්තේ ද, වායුව හා එක් වැ නො පැවැත්තේ ද, එ විට හඬ නො කෙරේ යැ’ යි මේ සිත විය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 538,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො රාජඤ්ඤ යදායං කායො ආයුසහගතො ච හොති උස්මාසහගතො ච විඤ්ඤාණසහගතො ච, තදා අභික්කමතිපි පටික්කමතිපි තිට්ඨතිපි නිසීදතිපි සෙය්යම්පි කප්පෙති, චක්ඛුනාපි රූපං පස්සති, සොතෙනපි සද්දං සුණාති, ඝානෙනපි ගන්ධං ඝායති, ජිව්හායපි රසං සායති, කායෙනපි ඵොට්ඨබ්බං ඵුසති, මනසාපි ධම්මං විජානාති. යදා පනායං කායො නෙව ආයුසහගතො හොති, න උස්මාසහගතො ච න විඤ්ඤාණසහගතො ච, තදා නෙව අභික්කමති න පටික්කමති න තිට්ඨති න නිසීදති න සෙය්යං කප්පෙති, චක්ඛුනාපි රූපං න පස්සති, සොතෙනපි සද්දං න සුණාති, ඝානෙනපි ගන්ධං න ඝායති, ජිව්හායපි රසං න සායති, කායෙනපි ඵොට්ඨබ්බං න ඵුසති, මනසාපි ධම්මං න විජානාති. ඉමිනාපි ඛො තෙ රාජඤ්ඤ පරියායෙන එවං හොතු: ඉතිපි අත්ථි පරො ලොකො, අත්ථි සත්තා ඔපපාතිකා, අත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“කිඤ්චාපි භවං කස්සපො එවමාහ, අථ ඛො එවම්මෙ එත්ථ හොති: ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "13. “අත්ථි පන රාජඤ්ඤ පරියායො -පෙ-”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“අත්ථි භො කස්සප පරියායො -පෙ-”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“යථා කථං විය රාජඤ්ඤාති?”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“ඉධ මෙ භො කස්සප පුරිසා චොරං ආගුචාරිං ගහෙත්වා දස්සෙන්ති: අයං තෙ භන්තෙ චොරො ආගුචාරී, ඉමස්ස යං ඉච්ඡසි, තං දණ්ඩං පණෙහී’ති. ත්යාහං එවං වදාමි: තෙන හි භො ඉමස්ස පුරිසස්ස ඡවිං ඡින්දථ, අප්පෙවනාමස්ස ජීවං පස්සෙය්යාමා’ති. තෙ තස්ස පුරිසස්ස ඡවිං ඡින්දන්ති. නෙවස්ස මයං ජීවං පස්සාම. ත්යාහං එවං වදාමි: තෙන හි භො ඉමස්ස පුරිසස්ස චම්මං ඡින්දථ -පෙ- මංසං ඡින්දථ -පෙ- න්හාරුං ඡින්දථ -පෙ- අට්ඨිං ඡින්දථ -පෙ- අට්ඨිමිඤ්ජං ඡින්දථ, අප්පෙවනාමස්ස ජීවං පස්සෙය්යාමා’ති. තෙ තස්ස පුරිසස්ස චම්මං ඡින්දන්ති -පෙ- අට්ඨිමිඤ්ජං ඡින්දන්ති නෙවස්ස මයං ජීවං පස්සාම. අයම්පි ඛො භො කස්සප පරියායො, යෙන මෙ පරියායෙන එවං හොති: ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති.”"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "රාජන්‍යයෙනි, එ පරිදේදෙන් ම, යම් කලෙක මේ සිරුර ආයුෂ (ජීවිතෙන්ද්‍රිය) සහිත වේ ද, උණුසුම සහිත වේ ද, විඥාන සහිත වේ ද එ කලැ ඉදිරියට ද යෙයි, පෙරළා ද යෙයි, සිටුනේ ද වෙයි, හිඳුනේ ද වෙයි, ශයනය ද කෙරෙයි, ඇසින් රූප දක්නේ ද වෙයි, කනින් හඬ අසනුයේ ද වෙයි, නැහැයෙන් ගඳ අහනුයේ ද වෙයි, දිවෙන් රස විඳිනුයේ ද වෙයි, කයින් හැපෙන දෑ පහස්නේ ද වෙයි, මනසින් දහම් දන්නේ ද වෙයි. යම් කලෙක වූ කලී මෙ සිරුර නො ම ආයුෂ සහිත වේ ද, නො ම උණුසුම් සහිත වේ ද, නො ම විඥාන සහිත වේ ද, එ කලැ නො ම ඉදිරියට යෙයි, නො ම පෙරළා යෙයි, නො ම සිටියි, නො ම හිඳියි, නො ම ශයනය කෙරෙයි, ඇසින් රූප නො ම දක්නේ ද වෙයි, කනින් හඬ නො ම අසනුයේ ද වෙයි, නැහැයෙන් ගඳ නො ම අහනුයේ ද වෙයි, දිවෙන් රස නො ම විඳිනුයේ ද වෙයි, කයින් හැපෙන දෑ නො ම පහස්නේ ද වෙයි, මනසින් දහම් නො ම දන්නේ ද වෙයි. රාජන්‍යයෙනි, මෙ කරුණිනුදු ඔබට ‘මෙසේත් පරලොව ඇත, මෙසේත් උපපාදුක සත්හු ඇත, මෙසේත් සුකෘත දුෂ්කෘත කර්මයන්ගේ ඵල විපාක ඇතැ’යි මෙබඳු සිතෙක් වේ වා.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසි - “භවත් කාශ්‍යපයන් වහන්සේ මෙසේ වදාරතු දු, වැලිත් ‘මෙසේත් පර ලොව නැත, මෙසේත් උපපාදුක සත්හු නැත, කුශලාකුශල කර්මයන්ගේ ඵල විපාක නැතැ’යි මෙ කරුණෙහි මට මෙසේ සිතෙක් වේ.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "13. කුමරකසුප් - “රාජන්‍යයෙනි, … එයට කරුණෙක් ඇද්ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසි - “ඇත, භවත් කාශ්‍යපයන් වහන්ස.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “ඒ කෙබඳු එකෙක් ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසි - “භවත් කාශ්‍යපයන් වහන්ස, මෙහි මගේ සේවක පුරුෂයෝ වරද කළ සොරක්හු අල්ලා ගෙනවුත්, ‘ස්වාමීනි, මේ ඔබට වරද කළ සොරෙක. ඔබට රිසියෙන් දඬුවමක් මොහුට පණවන්නැ’යි කියා දක්වත්. මම් ඔවුනට, ‘එසේ වී නම්, භවත්නි, මේ මිනිසාගේ සිවිය සිඳලා මොහුගේ ජීවය දැක්කැ හෙන්නමෝ නම් යෙහෙකැ’ යි මෙසේ කියමි. ඔහු ඒ මිනිසාගේ සිවිය සිඳිත්. එහෙත් ඔහුගේ ජීවය අපි නො දකුම්හ. එ විට ඔවුනට ‘එසේ වී නම්, භවත්නි, මේ මිනිසාගේ සම සිඳ ලවු … මස සිඳ ලවු … නහර සිඳ ලවු … ඇට සිඳ ලවු ... ඇට මිඳුලු සිඳ ලවු. මේ මිනිසාගේ ජීවය දැක්ක හෙන්නමෝ නම් යෙහෙකැ’ යි මෙසේ කියමි. ඔහු ඒ මිනිසාගේ සම සිඳැ ලත් … ඇට මිඳුලු සිඳැ ලත්, එහෙත් අපි ඔහුගේ ජීවය නො දකුම්හ. භවත් කාශ්‍යපයන් වහන්ස, යම් කරුණෙකින් මට ‘මෙසේත් පර ලොව නැත, මෙසේත් උපපාදුක සත්වයෝ නැත, මෙසේත් සුකෘත දුෂ්කෘත කර්මයන්ගේ ඵල විපාක නැතැ’ යි මෙබඳු සිතෙක් වේ ද, මේ ද ඒ එක් කරුණෙකි.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 540,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“තෙන හි රාජඤ්ඤ උපමන්තෙ කරිස්සාමි. උපමායපි ඉධෙකච්චෙ විඤ්ඤූ පුරිසා භාසිතස්ස අත්ථං ආජානන්ති. භූතපුබ්බං රාජඤ්ඤ අඤ්ඤතරො අග්ගිකො ජටිලො අරඤ්ඤායතනෙ පණ්ණකුටියා වසති. අථ ඛො රාජඤ්ඤ අඤ්ඤතරො ජනපදෙ සත්ථො වුට්ඨාසි. අථ ඛො සො සත්ථො තස්ස අග්ගිකස්ස ජටිලස්ස අස්සමස්ස සාමන්තා එකරත්තිං වසිත්වා පක්කාමි. අථ ඛො රාජඤ්ඤ තස්ස අග්ගිකස්ස ජටිලස්ස එතදහොසි: ධන්නූනාහං යෙන සො සත්ථවාසො තෙනුපසඞ්කමෙය්යං, අප්පෙව නාමෙත්ථ කිඤ්චි උපකරණං අධිගච්ඡෙය්යන්ති. අථ ඛො සො අග්ගිකො ජටිලො කාලස්සෙව වුට්ඨාය යෙන සො සත්ථවාහො තෙනුපසඞ්කමි, උපසඞ්කමිත්වා අද්දස තස්මිං සත්ථවාහෙ දහරං කුමාරං මන්දං උත්තානසෙය්යකං ඡඩ්ඩිතං. දිස්වානස්ස එතදහොසි: න ඛො මෙතං පතිරූපං, යම්මෙ පෙක්ඛමානස්ස මනුස්සභූතො කාලකරෙය්ය. ධන්නූනාහං ඉමං දාරකං අස්සමං නෙත්වා ආපාදෙය්යං පොසෙය්යං වඩ්ඪෙය්යන්ති. අථ ඛො සො අග්ගිකො ජටිලො තං දාරකං අස්සමං නෙත්වා ආපාදෙසි පොසෙසි වඩ්ඪෙසි. යදා සො දාරකො දසවස්සුද්දෙසිකො වා හොති ද්වාදසවස්සුද්දෙසිකො වා, අථ ඛො තස්ස අග්ගිකස්ස ජටිලස්ස ජනපදෙ කිඤ්චිදෙව කරණීයං උප්පජ්ජි. අථ ඛො සො අග්ගිකො ජටිලො තං දාරකං එතදවොච: ‘ඉච්ඡාමහං තාත ජනපදං ගන්තුං, අග්ගිං තාත පරිචරෙය්යාසි. මා ච තෙ අග්ගි නිබ්බායි. සචෙ ච තෙ අග්ගි නිබ්බායෙය්ය, අයං වාසී, ඉමානි කච්ඨානි, ඉදං අරණිසහිතං, අග්ගිං නිබ්බත්තෙත්වා අග්ගිං පරිචරෙය්යාසී’ති. අථ ඛො සො අග්ගිකො ජටිලො තං දාරකං එවං අනුසාසිත්වා ජනපදං අගමාසි. තස්ස ඛිඩ්ඩාපසුතස්ස අග්ගි නිබ්බායි. අථ ඛො තස්ස දාරකස්ස එතදහොසි: පිතා ඛො මං එවං අවච: ‘අග්ගිං තාත පරිචරෙය්යාසි. මා ච තෙ අග්ගි නිබ්බායි. සචෙ ච තෙ අග්ගි නිබ්බායෙය්ය, අයං වාසී ඉමානි කට්ඨානි ඉදං අරණිසහිතං, අග්ගිං නිබ්බත්තෙත්වා අග්ගිං පරිචරෙය්යාසී’ති. යන්නූනාහං අග්ගිං නිබ්බත්තෙත්වා අග්ගිං පරිචරෙය්යන්ති. අථ ඛො සො දාරකො අරණිසහිතං වාසියා තච්ඡි: අප්පෙව නාම අග්ගිං අධිගච්ඡෙය්යන්ති. නෙව සො අග්ගිං අධිගච්ඡි. අරණිසහිතං ද්විධා ඵාලෙසි -පෙ- තිධා ඵාලෙසි -පෙ- චතුධා ඵාලෙසි -පෙ- පඤ්චධා ඵාලෙසි -පෙ- දසධා ඵාලෙසි -පෙ- සතධා ඵාලෙසි -පෙ- සකලිකං සකලිකං අකාසි -පෙ- සකලිකං සකලිකං කරිත්වා උදුක්ඛලෙ කොට්ටෙසි -පෙ- උදුක්ඛලෙ කොට්ටෙත්වා මහාවාතෙ ඔපුණි: අප්පෙවනාම අග්ගිං අධිගච්ඡෙය්යන්ති. නෙව සො අග්ගිං අධිගච්ඡි."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “රාජන්‍යයෙනි, එසේ වී නම් ඔබට උපමාවක් කරන්නෙමි. උපමායෙනුත් මෙහි ඇතැම් නුවණැති පුරුෂ කෙනෙක් කියන ලද වචනයේ අරුත් දැනගනිත්. රාජන්‍යයෙනි, පෙරැ වූවක් කියම්. එක්තරා ගිනි පුදන ජටිලයෙක් වෙනෙහි කොළ සෙවිලි කළ පැලෙක වෙසෙයි. රාජන්‍යයෙනි, එ කලැ දනව්වෙක එක්තරා වෙළෙඳ මුළුවෙක් නැඟී සිටියේ ය. (ගමන් ඇරැඹියේ ය). ඉක්බිති ඒ වෙළෙඳමුළුව ගිනි පුදන ජටිලයාගේ අසපුව සමීපයෙහි එක් රැයක් වැස නික්මැ ගියේ ය. එ කලැ ඒ ගිනිපුදන ජටිලයාට ‘ඒ වෙළෙඳ මුළුව වුසූ තැනට ගියෙම් නම් යෙහෙක. එහි දී කිසි උපකරණයක් ලදුයෙම් වීම් නම් යෙහෙකැ’යි මේ සිත වී ය. ඉක්බිති ඒ ගිනි පුදන ජටිලයා කලින් ම නැඟී සිට, ඒ වෙළෙඳ මුළුව රැඳී සිටි තැනට එළැඹියේ ය. එළැඹ, ඒ වෙළෙඳ මුළුව වුසූ තැන හැර දමා පියන ලද උඩුකුරු වැ හෝනා ඉතා කුඩා ළදරුවකු දිටීය. දැකීමෙන් ඔහුට ‘මා දැක්ක දී මිනිස් වූයෙක් කලුරිය කරන්නේ ය යන යමෙක් ඇද්ද, එය මට නො සුදුසු ය. මේ දරුවා අසපුවට ගෙන ගොස් ඇති දැඩි කෙළෙම් නම් පෝෂිත කෙළෙම් නම්, වඩා ගන්නෙම් නම් ඉතා යෙහෙකැ’ යි මේ සිත විය. ඉක්බිති ඒ ගිනි පුදන ජටිල තෙම ඒ දරුවා අසපුවට ගෙන ගොස් ඇති දැඩි කෙළේ ය, පෝෂිත කෙළේ ය, වඩා ගත්තේ ය. යම් කලෙක ඒ දරු දස වස් හෝ දොළොස් වස් ඇත්තේ වී ද, එ කලැ ඒ ගිනි පුදන ජටිලයාට දනව්වෙහි කිසියම් කටයුත්තක් උපන. එ කලැ හේ ගිනි පුදන ජටිල තෙම ඒ දරු බණවා, ‘දරුව, දනව්වට යන්නට කැමැත්තෙමි. දරුව, ගින්න පුදව, තාගේ ගින්න නො නිවේ වා, ඉදින් තගේ ගින්න නිවී ගියේ නම් - මේ වෑය මය, මේ දර ය, මේ ගිනි ගානා දඬු දෙක ය. (මෙයින්) ගිනි උපදවා ගිනි පුදව’ යි මෙ වචන කී ය. ඉක්බිති ඒ ගිනි පුදන ජටිල තෙම ඒ දරුවාට මෙසේ අනුශාසනා කොට දනව්වට ගියේ ය. ක්‍රීඩායෙහි යෙදුණු ඔහුගේ ගින්න නිවී ගියේ ය. එ විට ඒ දරුවා ට මා පියා මට ‘දරුව ගින්න පුදව, තගේ ගින්න නො නිවේ වා. ඉදින් තගේ ගින්න නිවී ගියේ නම්, මේ වෑය ය, මේ දර ය, මේ ගිනි ගානා දඬු දෙක ය (මෙයින්) ගිනි උපදවා ගිනි පුදව’ යි කීයේ ය. මම් ගිනි උපදවා, ගිනි පිදීම් නම් යෙහෙකැ’ යි මේ සිත විය. ඉක්බිති ඒ දරු තෙම ගිනි ලදිම් නම් යෙහෙකැ’ යි සිතා , ගිනි ගානා දඬු දෙක වෑයෙන සැස්සේ ය. (එහෙත්) හේ ගිනි නො ම ලැබී ය. ගිනි ගානා දඬු දෙක දෙකට පැළී ය … තුනට පැළී ය … සතරට පැළී ය … පසට පැළී ය … දහයට පැළී ය … සියයට පැළී ය … කැබැලි කැබැලි කෙළේ ය … කැබැලි කැබැලි කොට වනෙහි කෙටී ය … වනෙහි කොටා, ‘ගිනි ලදිම් නම් යෙහෙකැ’ යි සිතා, මහ සුළඟෙහි පිඹ හළේ ය. (එහෙත්) හේ ගිනි නො ම ලැබී ය. ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 542,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො සො අග්ගිකො ජටිලො ජනපදෙ තං කරණීයං තීරෙත්වා, යෙන සකො අස්සමො තෙනුපසඞ්කමි, උපසඞ්කමිත්වා තං දාරකං එතදවොච: ‘කච්චි තෙ තාත අග්ගි න නිබ්බුතො’ති. ඉධ මෙ තාත ඛිඩ්ඩාපසුතස්ස අග්ගි නිබ්බායි. තස්ස මෙ එතදහොසි: පිතා ඛො මං එවං අවච: අග්ගිං තාත පරිචරෙය්යාසි. මා ච තෙ තාත අග්ගි නිබ්බායි. සචෙ ච තෙ අග්ගි නිබ්බායෙය්ය අයං වාසී ඉමානි කට්ඨානි ඉදං අරණිසහිතං, අග්ගිං නිබ්බත්තෙත්වා අග්ගිං පරිචරෙය්යාසී ති. යන්නූනාහං අග්ගිං නිබ්බත්තෙත්වා අග්ගිං පරිචරෙය්යන්ති. අථ ඛ්වාහං තාත අරණිසහිතං වාසියා තච්ඡිං: අප්පෙවනාම අග්ගිං අධිගච්ඡෙය්යන්ති. නෙවාහං අග්ගිං අධිගච්ඡිං. අරණිසහිතං ද්විධා ඵාලෙසිං -පෙ- තිධා ඵාලෙසිං -පෙ- චතුධා ඵාලෙසිං -පෙ- පඤ්චධා ඵාලෙසිං -පෙ- දසධා ඵාලෙසිං -පෙ- සතධා ඵාලෙසිං -පෙ- සකලිකං සකලිකං අකාසිං -පෙ- සකලිකං සකලිකං කරිත්වා උදුක්ඛලෙ කොට්ටෙසිං -පෙ- උදුක්ඛලෙ කොට්ටෙත්වා මහාවාතෙ ඔඵුණිං අප්පෙව නාම අග්ගිං අධිගච්ඡෙය්යන්ති. නෙවාහං අග්ගිං අධිගච්ඡින්ති. අථ ඛො තස්ස අග්ගිකස්ස ජටිලස්ස එතදහොසි: යාව බාලො අයං දාරකො අබ්යත්තො, කථං හි නාම අයොනිසො අග්ගිං ගවෙසිස්සතී ති. තස්ස පෙක්ඛමානස්ස අරණිසහිතං ගහෙත්වා අග්ගිං නිබ්බත්තෙත්වා තං දාරකං එතදවොච: ‘එවං ඛො තාත අග්ගි නිබ්බත්තෙතබ්බො. නත්වෙව යථා ත්වං බාලො අබ්යත්තො අයොනිසො අග්ගිං ගවෙසීස්සතී ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො ත්වං රාජඤ්ඤ බාලො අබ්යත්තො අයොනිසො පරලොකං ගවෙසිස්සසි. පටිනිස්සජ්ජෙතං රාජඤ්ඤ පාපකං දිට්ඨිගතං. පටිනිස්සජ්ජෙතං රාජඤ්ඤ පාපකං දිට්ඨිගතං. මා තෙ අහොසි දීඝරත්තං අහිතාය දුක්ඛායා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“කිඤ්චාපි භවං කස්සපො එවමාහ, අථ ඛො නෙවාහං සක්කොමි{1} ඉදං පාපකං දිට්ඨිගතං පටිනිස්සජ්ජිතුං. රාජාපි මං පසෙනදි කොසලො ජානාති තිරොරාජානොපි: ‘පායාසිරාජඤ්ඤො එවංවාදී එවංදිට්ඨී: ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො ති. සචාහං භො කස්සප ඉදං පාපකං දිට්ඨිගතං පටිනිස්සජ්ජිස්සාමි, භවිස්සන්ති මෙ වත්තාරො: යාවබාලො පායාසි රාජඤ්ඤො යාවඅබ්යත්තො දුග්ගහිතග්ගාහීති. කොපෙනපි නං හරිස්සාමි, මක්ඛෙනපි නං හරිස්සාමි, පලාසෙනපි නං හරිස්සාමී ති.”"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සය්හාමි - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එ කලැ ඒ ගිනි පුදන ජටිල තෙම දනව්වෙහි ඒ කටයුත්ත නිමවා සිය අසපුවට පැමිණියේ ය. පැමිණ ඒ දරුවා ට ‘කිමෙක් ද දරුව, තගේ ගිනි නො නිවීයේ දැ?’ යි කී ය. ‘පියාණෙනි, මෙහි ක්‍රීඩායෙහි යෙදුණු මාගේ ගිනි නිවී ගියේ ය. ඒ මට ‘දරුව, ගිනි පුදව, තගේ ගින්න නො නිවේ ව, ඉදින තගේ ගින්න නිවී ගියේ වී නම්, ‘මේ වෑය ය, මේ දර ය, මේ ගිනි ගානා දඬු දෙක ය (මෙයින්) ගිනි නිපදවා ගිනි පුදව’ යි මා පියා මට කී ය. (එ බැවින්) මම් ගිනි නිපදවා ගිනි පිදීම් නම් යෙහෙකැ’ යි මට මේ සිත විය. පියාණනි, ඉක්බිති මම් ගිනි ලදිම් නම් යෙහෙකැ යි සිතා ගිනි ගානා දඬු දෙක වෑයෙන් සෑස්සෙමි. (එහෙත්) මම් ගිනි නො ලදිමි. ගිනි ගානා දඬු දෙක දෙකට පැළීමි … තුනට පැළීමි … සතරට පැළීමි … පසට පැළීමි … දසයට පැළීමි … සියයට පැළීමි … කැබැලි කැබැලි කෙළෙමි … කැබැලි කැබැලි කොට වනෙහි ලා කෙටීමි … වනෙහි ලා කොටා, ගිනි ලදිම් නම් මැනැවැ යි සිතා මහ සුළඟෙහි පිඹ හළෙමි. එහෙත් මම් ගිනි නො ලදිමි’ යි මෙ පවත් කී ය. ‘මේ දරු තෙම කොතරම් අනුවණ ද! කොතරම් අවියත් ද!! කෙසේ නම් නොමඟින් ගිනි සෙවී දැ!!!’ යි එ ගිනිපුදන ජටිලයාට මේ සිත විය. හේ ඔහු බලා සිටියැ දී ගිනිගානා දඬු දෙකක් ගෙන ගිනි නිපදවා, ‘දරුව, මෙසේ ම ගිනි ඉපැදැවියැ යුතු ය. අනුවණ වූ නොවියත් තෝ යම්සේ නොමඟින් ගිනි සෙවුයෙහි ද එසේ ගිනි ඉපිදැවියැ නො හැක්කැ’යි කී ය."
                    },
                    {
                        "format": 13,
                        "text": "රාජන්‍යයෙනි, අනුවණ වූ නොවියත් වූ ඔබ නො මඟින් පර ලොව සොයන්නාහ. රාජන්‍යයෙනි, තෙල ලාමක දෘෂ්ටිය බැහැර කරන්න. එය ඔබට දික් කලක් අවැඩ පිණිස දුක පිණිස නො වේ වා.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසි - “භවත් කාශ්‍යපයන් වහන්සේ මෙසේ වදාරතත්, වැලි මේ ලාමක දෘෂ්ටිය බැහැර කරන්නට මම් නො හැක්කෙමි. පායාසී රාජන්‍ය, ‘මෙසේත් පර ලොව නැත, උපපාදුක සත්වයෝ නැත, සුකෘත දුෂ්කෘත කර්මයන්ගේ ඵල විපාක නැතැ’ යි පායාසී රාජන්‍ය තෙම මෙබඳු වාද ඇත්තෙක, මෙබඳු දෘෂ්ටි ඇත්තෙකැ’ යි පසේනදී කොසොල් රජ ද මා දනී, පිටත දනවුහි රජුහු ද දනිත්. භවත් කාශ්‍යපයන් වහන්ස, ඉදින් මම් මේ ලාමක වූ දෘෂ්ටිය බැහැර කෙළෙම් වීම් නම් ‘මේ පායාසී රාජන්‍ය තෙම ඉතා බාලයෙක, ඉතා නොවියත් ය. කරුණු වරදවා ගන්නා සුල්ලෙකැ’ යි මට කියන්නෝ වන්නාහ. (එ බැවින්) ඔවුන් කෙරෙහි කෝපයෙනුත් මේ දෘෂ්ටිය ගෙන හැසිරෙන්නෙමි, ඔබ කී මනා කරුණු මකන ස්වභාවයෙන් යුක්තව ද ඒ දෘෂ්ටිය ගෙන හැසිරෙන්නෙමි, යුගග්‍රාහයෙන් ද ඔවුනට (එකට එක කිරීමක් වශයෙන් ද) මේ දෘෂ්ටිය ගෙන හැසිරෙන්නෙමි.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 544,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "14. “තෙන හි රාජඤ්ඤ උපමන්තෙ කරිස්සාමි. උපමායපිධෙකච්චෙ විඤ්ඤූ පුරිසා භාසිතස්ස අත්ථං ආජානන්ති. භූතපුබ්බං රාජඤ්ඤ මහාසකටසත්ථො සකටසහස්සං පුරත්ථිමා ජනපදා පච්ඡිමං ජනපදං අගමාසි. සො යෙන යෙන ගච්ඡති ඛිප්පමෙව පරියාදියති තිණකට්ඨොදකං හරිතකපණ්ණං. තස්මිං ඛො පන සත්ථෙ ද්වෙ සත්ථවාහා අහෙසුං, එකො පඤ්චන්නං සකටසතානං එකො පඤ්චන්නං සකටසතානං. අථ ඛො තෙසං සත්ථවාහානං එතදහොසි. අයං ඛො පන මහාසකටසත්ථො සකටසහස්සං. තෙ මයා යෙන යෙන ගච්ඡාම ඛිප්පමෙව පරියාදියති තිණකට්ඨොදකං හරිතකපණ්ණං. යන්නූන මයං ඉමං සත්ථං ද්විධා විභජෙය්යාම එකතො පඤ්ච සකටසතානි, එකතො පඤ්ච සකටසතානීති. තෙ තං සත්ථං ද්විධා විභජිංසු එකතො පඤ්ච සකටසතානි එකතො පඤ්ච සකටසතානි. එකො තාව සත්ථවාහො බහුං තිණඤ්ච කට්ඨඤ්ච උදකඤ්ච ආරොපෙත්වා සත්ථං පයාපෙසි. ද්වීහතීහං පයාතො ඛො පන සො සත්ථො අද්දස පුරිසං කාළං ලොහිතක්ඛං සන්නද්ධකලාපං කුමුදමාලිං අල්ලවත්ථං අල්ලකෙසං කද්දමමක්ඛිතෙහි චක්කෙහි භද්දෙන රථෙන පටිපථං ආගච්ඡන්තං. දිස්වා එතදවොච: ‘කුතො භො ආගච්ඡසී’ති ‘අමුකම්හා ජනපදා’ති. ‘කුහිං ගමිස්සසී’ති ‘අමුකං නාම ජනපදන්ති.’ ‘කච්චි භො පුරතො කන්තාරෙ මහාමෙඝො අභිප්පවුට්ඨො?’ති. එවං ඛො භො පුරතො කන්තාරෙ මහාමෙඝො අභිප්පවුට්ඨො. ආසිත්තොදකානි වටුමානි බහුං තිණඤ්ච කට්ඨඤ්ච උදකඤ්ච. ඡඩ්ඩෙථ භො පුරාණානි තිණානි කට්ඨානි උදකානි, ලහුභාරෙහි සකටෙහි සීඝසීඝං ගච්ඡථ. මා යොග්ගානි කිලමෙථාති. අථ ඛො සො සත්ථවාහො සත්ථිකෙ ආමන්තෙසි: අයං භො පුරිසො එවමාහ: පුරතො කන්තාරෙ මහාමෙඝො අභිප්පවුට්ඨො{1}, ආසිත්තොදකානි වටුමානි, බහුං තිණඤ්ච කට්ඨඤ්ච උදකඤ්ච. ඡඩ්ඩෙථ භො පුරාණානි තිණානි කට්ඨානි උදකානි, ලහුභාරෙහි සකටෙහි සීඝසීඝං ගච්ඡථ, මා යොග්ගානි කිලමෙථාති. ඡඩ්ඩෙථ භො පුරාණානි තිණානි කට්ඨානි උදකානි, ලහුභාරෙහි සකටෙහි සත්ථං පයාපෙථා’ති. ‘එවං භො’ති ඛො තෙ සත්ථිකා තස්ස සත්ථවාහස්ස පටිස්සුත්වා, ඡඩ්ඩෙත්වා පුරාණානි තිණානි කට්ඨානි උදකානි ලහුභාරෙහි සකටෙහි සත්ථං පයාපෙසුං. තෙ පඨමෙපි සත්ථවාසෙ න අද්දසංසු තිණං වා කට්ඨං වා උදකං වා. දුතියෙපි සත්ථවාසෙ -පෙ- තතියෙපි සත්ථවාසෙ -පෙ- චතුත්ථෙපි සත්ථවාසෙ -පෙ- පඤ්චමෙපි සත්ථවාසෙ -පෙ- ඡට්ඨෙපි සත්ථවාසෙ -පෙ- සත්තමෙපි සත්ථවාසෙ න අද්දසංසු තිණං වා කට්ඨං වා උදකං වා. සබ්බෙව අනයබ්යසනං ආපජ්ජිංසු. යෙ ච තස්මිං සත්ථෙ අහෙසුං මනුස්සා වා පසූ වා සබ්බෙ සො යක්ඛො අමනුස්සො භක්ඛෙසි. අට්ඨිකානෙව සෙසෙසි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අභිප්පවට්ඨො - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "14. කුමරකසුප් - “එසේ වී නම් රාජන්‍යයෙනි, ඔබට උපමාවක් කරන්නෙමි. උපමායෙනුත් මෙහි ඇතැම් නුවණැති පුරුෂයෝ කියන ලද වචනයේ අරුත් දැන ගන්නාහ. පෙරැ වූවක් කියම්. රාජන්‍යයෙනි, ගැල් දහසක් වූ මහ ගැල් මුළුවෙක් පෙර දිගැ දනව්වෙන් නික්මැ පැසිම් දිගැ දනව්වකට ගියේ ය. එය යම් යම් මඟෙකින් යෙයි ද, ඒ ඒ මඟ තණ දර දිය ද යටත් පිරිසෙයින් නිල් තණ කොළ ද ඉතිරි නො වැ අවසන් වෙයි. ඒ ගැල් මුළුයෙහි එකෙක් ගැල් පන්සියයකට ද තවෙකෙක් ගැල් පනිසියයකට දැ යි සාත්තු නායකයෝ දෙදනෙක් වූහ. එ කලැ ඒ සාත්තුනායකයනට ‘ගැල් දහසක් වූ මෙය මහ ගැල් මුළුවෙකි. ඒ අප යන යන මඟැ තණ දර දිය නිල් කොළ යන මේ සියල්ල වහා ම නො ඉතිරි වැ නිමාවට යෙයි. එක් කොටසකට ගැල් පන්සියයක් ද ඉතිරි කොටසටත් ගැල් පන්සියයක් දැ යි මේ ගැල්මුළුව දෙ කොටසට බෙදා ගන්නමෝ නම් ඉතා යෙහෙකි’ යි මේ සිත විය. ඔහු ඒ ගැල් මුළුව එක් කොටසකට ගැල් පන්සියය පන්සියය කොට දෙකට බෙදූහ. (ඔවුන් ගෙන්) පළමු කොට එක් ගැල් නාවෙක් බොහෝ තණ ද දර ද දිය ද (ගැල්හි) නංවා ගෙන ගැල් මුළුව පැදැවී ය. දෙතුන් දිනක් ගියා වූ ඒ ගැල්මුළුව ලේ පැහැ ඇස් ඇති බැඳගත් හියවුරු ඇති ගෙලැ පලන් හෙළ ඇඹුල මල්දම් ඇති, තෙත් වස්ත්‍ර ඇති, තෙත් කෙහෙ ඇති, මඩ වැකි සකින් යුත් සොඳුරු රියෙකින් ඉදිරියට එන කළු වන් මිනිසකු දිටී යැ. දැක ‘භවත, කොයින් එයි දැ?’යි විචාළේ ය. ‘අසෝ දනව්වෙන් එමි’ යි හේ කිව. ‘කොහි යන්නෙහි දැ?’යි අනෙකා ඇසී ය. ‘අසෝ නම් දනව්වට යෙමි’ යි පළමු තැනැත්තේ කී ය. ‘කිම භවත, ඉදිරි කතරෙහි මහ වැසි වට දැ?’ යි අනෙකා ඇසී ය. ‘එසේ ය. භවත, ඉදිරියේ කතරෙහි මහවැසි වට. මංහු ද කඳුරැලි ද දියෙන් පිරී ඇත. තණ ද දිය ද බොහෝ ඇත. භවත, පරණ වූ තණ දර දිය ඉවත ලව. ලුහු බර ඇති ගැලින් යුතු වැ වහ වහා යව. ගොනුන් නො වෙහෙස ව’ යි පළමු තැනැත්තා කීය. එ විට ඒ ගැල් නා තෙම ගැල්පදුවන් බණවා, ‘භවත්නි, ඉදිරි කතරෙහි මහවැසි වටැ’ යි, ‘මංහු ද කඳුරැලි ද දියෙන් තෙත් වැ ඇතැ’ යි, ‘තණ දර දිය ද බොහෝ යැ’ යි, ‘භවත්නි, පරණ තණ දර දිය ඉවත ලවු යැ’ යි, ‘ලුහු බර ඇති ගැලින් යුතු ව වහ වහා යන්නැ’ යි, ‘ගොනුන් නො වෙහෙසන්නැ’ යි මේ මිනිසා කියයි. ‘භවත්නි, පරණ තණ දර දිය ඉවත දමවු. ලුහු බර ඇති ගැලින් යුතු ව වහ වහා ගැල් මුළුව පදවවු යැ’ යි කී ය. ‘එසේ ය, පින්වතැ’ යි ඒ ගැල් පදුවෝ ඒ ගැල්නාවාට පිළිවදන් දී, පරණ තණ දර දිය ඉවත ලා, ලුහු බර ගැල් වලින් යුතු වැ ගැල්මුළුව පැදැවූහ. ඔහු පළමු ගැල් නවාතැනෙහි ද තණ හෝ දර හෝ දිය හෝ නො දුටුහ. දෙවෙනි ගැල් නවාතනෙහි ද … තෙවෙනි ගැල් නවාතනෙහි ද … සතර වන ගැල් නවාතනෙහි ද … පස් වන ගැල් නවාතනෙහි ද … සවන ගැල් නවාතනෙහි ද … සත්වන ගැල් නවාතනෙහි ද තණ හෝ දර හෝ දිය හෝ නො දුටුහ. සියල්ලෝ ම විනාශයට පැමිණියාහ. ඒ ගැල්මුළුයෙහි යම් මිනිස් කෙනෙක් හෝ සිවුපා කෙනෙක් හෝ වූහු ද ඒ සියල්ලන් ඒ නොමිනිස් යක් තෙම කෑයේ ය. ඇට පමණක් ඉතිරි කෙළේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 546,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යදා අඤ්ඤාසි දුතියො සත්ථවාහො බහුනික්ඛන්තො ඛො භො දානි සො සත්ථො’ති, බහුං තිණඤ්ච කඨඤ්ච උදකඤ්ච ආරොපෙත්වා සත්ථං පයාපෙසි. ද්වීගතීහං පයාතො ඛො පෙනසො සත්ථො අද්දස පුරිසං කාළං ලොහිතක්ඛං සන්නද්ධකලාපං කුමුදමාලිං අල්ලවත්ථං අල්ලකෙසං කද්දමමක්ඛිතෙහි චක්කෙහි භද්දෙන රථෙන පටිපථං ආගච්ඡන්තං, දිස්වා එතදවොච: කුතො භො ආගච්ඡසී’?ති. ‘අමුකම්හා ජනපදා’ති. ‘කුහිං ගමිස්සසී?’ති. ‘අමුකං නාම ජනපදන්ති.’ ‘කච්චි භො පුරතො කන්තාරෙ මහාමෙඝො අභිප්පවුට්ඨො?’ති. ‘එවං ඛො භො පුරතො කන්තාරෙ මහාමෙඝො අභිප්පවුට්ඨො. ආසිත්තොදකානි වටුමානි, බහුං තිණඤ්ච කට්ඨඤ්ච උදකඤ්ච. ඡඩ්ඩෙථ භො පුරාණානි තිණානි කට්ඨානි උදකානි, ලහුභාරෙහි සකටෙහි සීඝසීඝං ගච්ඡථ, මා යොග්ගානි කිලමෙථාති. අථ ඛො සො සත්ථවාහො සත්ථිකෙ ආමන්තෙසි: අයං භො පුරිසො එවමාහ’පුරතො කන්තාරෙ මහාමෙඝො අභිප්පවුට්ඨො, ආසිත්තොදකානි වටුමානි, බහුං තිණඤ්ච කට්ඨඤ්ච උදකඤ්ච. ඡඩ්ඩෙථ භො පුරාණානි තිණානි කට්ඨානි උදකානි, ලහුභාරෙහි සකටෙහි සීඝසීඝං ගච්ඡථ, මා යොග්ගානි කිලමෙථා’ති. අයං ඛො භො පුරිසො නෙව අම්හාකං මිත්තො න ඤාතිසාලොහිතො. කථං මයං ඉමස්ස සද්ධාය ගමිස්සාම? න ඛො ඡඩ්ඩෙතබ්බානි පුරාණානි තිණානි කට්ඨානි උදකානි යථාභතෙන භණ්ඩෙන සත්ථං පයාපෙථ. න නො පුරාණං ඡඩ්ඩෙස්සාමා’ති. ‘එවං භො ති ඛො තෙ සත්ථිකා තස්ස සත්ථවාහස්ස පටිස්සුත්වා යථාභතෙන භණ්ඩෙන සත්ථං පයාපෙසුං. තෙ පඨමෙ පි සත්ථවාසෙ න අද්දසංසු තිණං වා කට්ඨං වා උදකං වා. දුතියෙ පි සත්ථවාසෙ තතියෙ පි සත්ථවාසෙ චතුත්ථෙ පි සත්ථවාසෙ පඤ්චමෙ පි සත්ථවාසෙ ඡට්ඨෙ පි සත්ථවාසෙ සත්තමෙ පි සත්ථවාසෙ න අද්දසංසු තිණං වා කට්ඨං වා උදකං වා. තඤ්ච සත්ථං අද්දසංසු අනයබ්යසනං ආපන්නං. යෙ ච තස්මිං සත්ථෙ පි අහෙසුං මනුස්සා වා පසූ වා, තෙසඤ්ච අට්ඨිකානෙව අද්දසංසු තෙන යක්ඛෙන අමනුස්සෙන භක්ඛිතානං. අථ ඛො සො සත්ථවාහො සත්ථිකෙ ආමන්තෙසි: අයං ඛො භො සත්ථො අනයබ්යසනං ආපන්නො යථා තං තෙන බාලෙන සත්ථවාහෙන පරිණායකෙන. තෙනහි භො යානම්හාකං සත්ථෙ අප්පසාරානි පණියානි, තානි ඡඩ්ඩෙත්වා, යානි ඉමස්මිං සත්ථෙ මහාසාරානි පණියානි තානි ආදියථා’ති. ‘එවං භො’ති ඛො තෙ සත්ථිකා තස්ස සත්ථවාහස්ස පටිස්සුත්වා යානි සකස්මිං සත්ථෙ අප්පසාරානි පණියානි තානි ඡඩ්ඩෙත්වා යානි තස්මිං සත්ථෙ මහාසාරානි පණියානි තානි ආදියිත්වා සොත්ථිනා තං කන්තාරං නිත්ථරිංසු යථා තං පණ්ඩිතෙන සත්ථවාහෙන පරිණායකෙන."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "දෙවෙනි, ගැල් නා තෙම, ‘භවත්නි. ඒ ගැල් මුළුව නික්ම ගොස් බොහෝ කල් ගියේ වේ යැ’ යි යම් විටෙක දැන ගත්තේ ද, එ විටැ බොහෝ තණ ද දර ද දිය ද පටවා ගැල් මුළුව පිටත් කරැවී ය. ඒ ගැල්මුළුව දෙතුන් දිනක් ගියේ ම ලේ පැහැ ඇස් ඇති, බැඳ ගත් හියවුරු ඇති (ගෙලැදැරු) හෙළැඹුල් මල්දමක් ඇති, තෙත් වස්ත්‍ර ඇති, තෙත් කෙහෙ ඇති, මඩ වැකුණූ සකින් යුත් සොඳුරු රියෙකින් ඉදිරියට එන කළු පැහැ පුරුෂයකු දිටී ය. දැක ‘භවත කොයිබින් එයි දැ?’ යි විචාළේ ය. ‘අසෝ දනව්වෙනැ’ යි හේ කිව. ‘කොහි යෙහි දැ?’ යි අනෙකා පුළුවුත. ‘අසෝ නම් දනව්වට’ යි පළමු තැනැත්තා පිළිවදන් දුන. ‘භවත, කිමෙක් ද? ඉදිරියහි කතරෙහි මහවැසි වට දැ?’ යි අනෙකා පුළුවත. ’එසේ ය, භවත. ඉදිරියේ කතරෙහි මහවැසි වට, මංහු කඳුරැලි ද දියෙන් පිරී ගියාහ. බොහෝ තණ ද දර ද දිය ද (එහි) ඇත. භවත, පරණ තණ දර දිය ඉවත දමා පියවු. ලුහු බර ගැලින් වහ වහා යවු. ගොනුන් නො වෙහෙසවු’ යැ යි පළමු තැනැත්තා කී ය. එ විට ඒ ගැල්නා තෙම ගැල් පදුවන් බණවා, ‘භවත්නි, මේ පුරුෂයා ‘ඉදිරියෙහි කතරෙහි මහ වැසි වැස ඇත. මංහු ද කඳුරැලි ද දියෙන් පිරී ඇත. බොහෝ තණ ද දර ද දිය ද ඇත. භවත්නි, පරණ තණ දර දිය ඉවත දමා පියවු. ලුහු බර ඇති ගැලින් වහ වහා යවු. ගොනුන් නො වෙහෙසවු’ යැ යි කියයි. භවත්නි, මේ පුරුෂයා අපගේ මිතුරෙක් නො වේ, සහලේ නෑයෙකුත් නො වේ. කෙසේ අපි මොහුගේ බස හදහා යන්නමු ද? පරණ තණ දර දිය ද නො ම ඉවත දැමියැ යුතු. ගෙනෙන ලද හැම බඩුයෙන් ම යුතු ව ගැල් මුළුව පදවවු. අපගේ පරණ බඩු නො ම ඉවත ලන්නමු’ යි කී ය. ‘භවත්නි, එසේ යැ’ යි කියා ම ඒ ගැල් පදුවෝ ඒ ගැල් නාවාට පිළිවදන් දී, ගෙනා බඩුයෙන් යුතු ව ගැල්මුළුවැ පැදැවූහ. ඔහු පළමු ගැල් නවාතනෙහි ද තණ හෝ දර හෝ දිය හෝ නො දුටුවාහ. දෙවෙනි ගැල් නවාතනෙහි ද තෙවෙනි ගැල් නවාතනෙහි ද සතර වන ගැල් නවාතනෙහි ද පස්වන ගැල් නවාතනෙහි ද සවන ගැල් නවාතනෙහි ද සත්වන ගැල් නවාතනෙහි ද තණ හෝ දර හෝ දිය හෝ නො දුටුවාහ. එහෙත් විනාශයට පැමිණි ඒ පළමු ගැල්මුළුව දුටුවාහ. ඒ ගැල් මුළුවෙහිත් යම් මිනිස් කෙනෙක් හෝ සිවුපා කෙනෙක් හෝ වූහු ද ඒ නොමිනිස් යකුහු විසින් කන ලද ඔවුන්ගේ ඇට පමණක් දුටුවාහ. ඉක්බිති ඒ ගැල් නා තෙම ගැල්පදුවන් බණවා, ‘භවත්නි, ඒ අනුවණ අධිපති ගැල්නාවා කරණ කොට ගෙන එය වියැ යුතු ද, එසේ මේ ගැල් මුළුව විනාශයට පැමිණියේ ය. භවත්නි, එසේ වී නම්, අප ගැල් මුළුයෙහි යම් අගයෙන් අඩු වූ වෙළෙඳ බඩු ඇද්ද, ඒවා ඉවත දමා පියා, වේ වැනැසුණු ගැල්මුළුයෙහි මහත් අගය ඇති යම් වෙළෙඳ බඩු ඇත් නම් ඒවා ගනිවු’ යැ යි කී ය. ‘එසේ ය, පින්වතැ’ යි කියා ම ඒ ගැල්පදුවෝ ඒ ගැල්නාවාට පිළිවදන් දී, සිය ගැල් මුළුයෙහි මද අගය ඇති යම් වෙළෙඳ බඩු ඇද්ද, ඒවා ඉවත දමා පියා ඒ වැනැසුණු ගැල් මුළුයෙහි යම මහඟු බඩු ඇද්ද, ඒවා ගෙන, නුවණැති අධිපති ගැල්නාවකු කරණ කොට ගෙන එය යම් සේ වියැ යුතු ද, එසේ සුව සේ ඒ කතර තිණූහ (තරණය කළාහ).",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 548,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො ත්වං රාජඤ්ඤ බාලො අබ්යත්තො අනයබ්යසනං ආපජ්ජිස්සසි අයොනිසො පරලොකං ගවෙසන්තො, සෙය්යථාපි සො පුරිමො සත්ථවාහො. යෙ පි තව සොතබ්බං සද්දහාතබ්බං මඤ්ඤිසන්ති, තෙ පි අනයබ්යසනං ආපජ්ජිස්සන්ති, සෙය්යථාපි තෙ සත්ථිකා. පරිනිස්සජ්ජෙතං රාජඤ්ඤ පාපකං දිට්ඨිගතං, පටිනිස්සජ්ජෙතං රාජඤ්ඤ පාපකං දිට්ඨිගතං. මා තෙ අහොසි දීඝරත්තං අහිතාය දුක්ඛායා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“කිඤ්චාපි භවං කස්සපො එවමාහ, අථ ඛො නෙවාහං සක්කොමි ඉදං පාපකං දිට්ඨිගතං පටිනිස්සජ්ජිතුං. රාජාපි මං පස්සෙනදිකොසලො ජානාති තිරොරාජානො පි. පායාසිරාජඤ්ඤො එවංවාදී එවංදිට්ඨී: ‘ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති. චාහං භො කස්සප ඉදං පාපකං දිට්ඨිගතං පටිනිස්සජ්ජිස්සාමි, භවිස්සන්ති මෙ වත්තාරො: යාව බාලො පායාසිරාජඤ්ඤො යාව අබ්යත්තො යාව දුග්ගහිතගාහීති. කොපෙනපි නං හරිස්සාමි මක්ඛෙනපි නං හරිස්සාමි, පලාසෙනපි නං හරිස්සාමී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "15. “තෙන හි රාජඤ්ඤ උපමන්තෙ කරිස්සාමි. උපමායපීධෙකච්චෙ විඤ්ඤූ පුරිසා භාසිතස්ස අත්ථං ආජානන්ති. භූතපුබ්බං රාජඤ්ඤ අඤ්ඤතරො සූකරපොසකො පුරිසො සකම්හා ගාමා අඤ්ඤං ගාමං අගමාසි. තත්ථ අද්දස පහූතං සුක්ඛං ගූථං ඡඩ්ඩිතං. දිස්වානස්ස එතදහොසි: අයං ඛො බහුකො සුක්කගූථො ඡඩ්ඩිතො, මම ච සූකරභත්තා. යන්නූනාහං ඉතො සුක්ඛගූථං හරෙය්යන්ති. සො උත්තරාසඞ්ගං පත්ථරිත්වා පහූතං සුක්ඛගූථං ආකිරිත්වා භණ්ඩිකං බන්ධිත්වා සීසෙ උබ්බාහෙත්වා අගමාසි. තස්ස අන්තරාමග්ගෙ මහාඅකාලමෙඝො පාවස්සි. සො උග්ඝරන්තං පග්ඝරන්තං යාව අග්ගනඛා ගූථෙන මක්ඛිතො ගූථභාරං ආදාය අගමාසි. තමෙනං මනුස්සා දිස්වා එවමාහංසු: කච්චි නො ත්වං භණෙ උම්මත්තො, කච්චි විචෙතො? කථංහි නාම උග්ඝරන්තං පග්ඝරන්තං යාව අග්ගනඛා ගූථෙන මක්ඛිතො ගූථභාරං හරිස්සසී?’ති. ‘තුම්හෙ ඛ්වෙත්ථ භණෙ උම්මත්තා තුම්හෙ විචෙතා. තථා හි පන මෙ සූකරභත්තන්ති’. එවමෙව ඛො ත්වං රාජඤ්ඤ ගූථභාරිකූපමො මඤ්ඤෙ පටිභාසි. පටිනිස්සජ්ජෙතං රාජඤ්ඤ පාපකං දිට්ඨිගතං. පටිනිස්සජ්ජෙතං රාජඤ්ඤ පාපකං දිට්ඨිගතං. මා තෙ අහොසි දීඝරත්තං අහිතාය දුක්ඛායා”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "රාජන්‍යයෙනි, එසේ ම අනුවණ වූ නොවියත් වූ ඔබ, ඒ පළමු ගැල්නාවා පරිද්දෙන් නො නුවණින් (නොමඟින්) පර ලොව සොයනුවෝ විනාශයට පැමිණෙන්නාහු ය. යම් කෙනෙකුන් ඔබ බස ඇසියැ යුතු කොට, හැදැහියැ යුතු කොට සිතන්නාහු ද ඔහුත් (යට කී අනුවණ ගැල්නාවා අනුව ගිය) ගැල් පදුවන් මෙන් විනාශයට පැමිණෙන්නාහ. රාජන්‍යයෙනි, මේ ලාමක දෘෂ්ටිය දුරැලන්න, මේ ලාමක දෘෂ්ටිය බැහැර කරන්න. මෙය ඔබට දිගු කලක් ඇවැඩ පිණිස දුක් පිණිස නො පවතී වා”.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසි - “භවත් කාශ්‍යපයන් වහන්සේ මෙසේ කියතුදු වැලිත් මේ ලාමක දෘෂ්ටිය දුරැ ලන්නට නො හැක්කෙමි. ‘පායාසී රාජාන්‍ය මෙසේත් පරලොව නැතැ යි, උපපාදුක සත්තු නැතැ යි, කුශලාකුශල කර්මයනට ඵල විපාක නැතැ’ යි මෙබඳු වාද ඇත්තේ යැ යි, මෙබඳු දෘෂ්ටි ඇත්තේ යැ යි, පසේනදී කොසොල් රජ ද දනී, මෙයින් පිටත රටවලැ රජහුද දනිති. භවත් කාශ්‍යපයන් වහන්ස, ඉදින් මම මේ ලාමක දෘෂ්ටිය දුරැලීම් නම්, පායාසී රාජන්‍ය තෙම කොතරම් මහත් අනුවණයෙක් ද! කොතරම් මහත් නොවියතෙක් ද!! කොතරම් මහත් සේ කරුණු වරදවා ගත්තෙක්දැ !!! යි මට කියන්නෝ වන්නාහ. එබැවින් ඔවුන් කෙරේ කෝපයෙනුදු මේ දෘෂ්ටිය ගෙන හැසිරෙන්නෙමි, ඔවුන් කී දෑ මකන ස්වභාවයෙනුත් ඒ දෘෂ්ටිය ගෙන හැසිරෙන්නෙමි, ඔවුනට යුගග්‍රාහ වශයෙනුත් (එකට එක කරනු විසිනුත්) මේ දෘෂ්ටිය ගෙන හැසිරෙන්නෙමි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "15. කුමරකසුප් - “එසේ වී නම් රාජන්‍යයෙනි, ඔබට උපමාවක් කරන්නෙමි. මෙහි ඇතැම් නුවණැති මිනිස්සු උපමායෙනුත් කියන ලද වචනයේ අරුත් දැනගන්නාහ. රාජන්‍යයෙනි, පෙර දවසැ හූරන් රක්නා එක්තරා පුරුෂයෙක් සිය ගමින් අන් ගමකට ගියේ ය. හේ එහි (කිසි තැනක) දමා පියන ලද වියැළී ගිය බොහෝ අසූචි දිටී ය. දැකීමෙන් ඔහුට ‘මේ වනාහි දමාපියන ලද වියැළුණු බොහෝ අසූචි ය. මගේ හූරනට අහරෙක. මම මෙයින් වියැළි අසූචි ගෙන ගියෙම් නම් ඉතා යෙහෙකැ’ යි මේ සිත විය. හේ උතුරු සළුව එළා බොහෝ වියැළි අසූචි ගොඩගසා පොදියක් කොට බැඳ හිසින් උසුලා ගෙන ගියේ ය. ඔහු යන අතර මඟැදී මහ නොකල් වැස්සෙක් වැටිණි. හේ පයැ නිය අග තෙක් ම අසූචියෙන වැකුණේ, උඩින් වැගිරෙන, පහනින් පෙරෙන අසූච බර රැගෙන ගියේ ය. මිනිස්සු ඔහු දැක, ‘සගය කිමෙක් ද? තෝ උමතුයෙහි ද? කිමෙක් ද? විකල සිතැත්තෙහි ද? කෙසේ නම් තෝ අසූචියෙන් වැකුණෙහි නියගතෙක් ම උඩින් වැගිරෙන යැටින් පෙරෙන අසූචි බර රැගෙන යෙහි දැ?’ යි මෙසේ කීහ. ‘සගයෙනි, මේ කරුණෙහි ලා තෙපි ම උමතුවෝ ය, තෙපි ම විකල සිතැත්තෝ ය. එසේ මැ යැ මේ මගේ හූරනට ගෙනයන ආහර!’ යැ යි කී ය. රාජන්‍යයෙනි, එ පරිද්දෙන් ම ඔබ අසූචි ගෙන යන්නකු මෙන් පැනෙති. රාජන්‍යයෙනි, මේ ලාමක දෘෂ්ටිය බැහැර කරන්න. එය ඔබට දිගු කලක් ඇවැඩ පිණිස නො පවතීවා.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 550,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“කිඤ්චාපි භවං කස්සපො එවමාහ, අථ ඛො නෙවාහං සක්කොමි ඉදං පාපකං දිට්ඨිගතං පටිනිස්සජ්ජිතුං. රාජාපි මං පස්සෙනදිකොසලො ජානාති තිරොරාජානොපි: පායාසි රාජඤ්ඤො එවංවාදී එවංදිට්ඨී: ‘ඉතිපි නත්ථි පරො ලොකො. නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති. සචාහං භො කස්සප ඉදං පාපකං දිට්ඨිගතං පටිනිස්සජ්ජිස්සාමි, භවිස්සන්ති මෙ චත්තාරො: යාව බාලො පායාසිරාජඤ්ඤො අබ්යත්තො දුග්ගහිතග්ගාහීති. කොපෙනපි නං හරිස්සාමි, මක්ඛෙනපි නං හරිස්සාමි, පලාසෙනපි නං හරිස්සාමී ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "16. “තෙන හි රාජඤ්ඤ උපමන්තෙ කරිස්සාමි. උපමායපි ඉධෙකච්චෙ විඤ්ඤූ පුරිසා භාසිතස්ස අත්ථං ආජානන්ති. භූතපුබ්බං රාජඤ්ඤ ද්වෙ අක්ඛධුත්තා අක්ඛෙහි දිබ්බිංසු. එකො අක්ඛධුත්තො ආගතාගතං කලිං ගිලති. අද්දසා ඛො දුතියො අක්ඛධුත්තො තං අක්ඛධුත්තං ආගතාගතං කලිං ගිලන්තං. දිස්වා තං අක්ඛධුත්තං එතදවොච: ත්වං ඛො සම්ම එකන්තිකෙන ජිනාසි, දෙහි මෙ සම්ම අක්ඛෙ, පජ්ජොහිස්සාමී’ති.{1} ‘එවං සම්මා’ති ඛො සො අක්ඛධුත්තො තස්ස අක්ඛධුත්තස්ස අක්ඛෙ පාදාසි. අථ ඛො සො අක්ඛධුත්තො අක්ඛෙ විසෙන පරිභාවෙත්වා තං අක්ඛධුත්තං එතදවොච: එහි ඛො සම්ම අක්ඛෙහි දිබ්බිස්සාමාති. එවං සම්මා’ති ඛො සො අක්ඛධුත්තො තස්ස අක්ඛධුත්තස්ස පච්චස්සොසි. දුතියම්පි ඛො තෙ අක්ඛධුත්තා අක්ඛෙහි දිබ්බිංසු. දුතියම්පි ඛො සො අක්ඛධුත්තො ආගතාගතං කලිං ගිලති. අද්දසා ඛො දුතියො අක්ඛධුත්තො තං අක්ඛධුත්තං දුතියම්පි ආගතාගතං කලිං ගිලන්තං, දිස්වා තං අක්ඛධුත්තං එතදවොච: –"
                    },
                    {
                        "type": "gatha",
                        "text": "“ලිත්තං පරමෙන තෙජසා ගිලමක්ඛං පුරිසො න බුජ්ඣති,\nගිල රෙ ගිල පාපධුත්තක පච්ඡා තෙ කටුකං භවිස්සතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො ත්වං රාජඤ්ඤ අක්ඛධුත්තොපමො මඤ්ඤෙ පටිභාසි. පටිනිස්සජ්ජෙතං රාජඤ්ඤ පාපකං දිට්ඨිගතං, පටිනිස්සජ්ජෙතං රාජඤ්ඤ පාපකං දිට්ඨිගතං. මා තෙ අහොසි දීඝරත්තං අහිතාය දුක්ඛායා’ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පජහිස්සාමී ති - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්සේ එසේ වදාරතත් වැලිදු මම මේ ලාමක දෘෂ්ටිය බැහැර කරන්නට නො හැක්කෙමි. ‘පායාසී රාජන්‍ය තෙම ‘මෙසේත් පර ලොව නැතැ යි, උපපාදුක සත්වයෝ නැතැ යි, කුශලාකුශල කර්මයනට ඵල විපාක නැතැ’ යි මෙබඳු වාද ඇත්තේ යැ යි මෙබඳු දෘෂ්ටි ඇත්තේ යැ යි, පසේනදී කොසොල් රජ ද මා දනී. බැහැර ජනපද වල රජහු ද දනිති. භවත් කාශ්‍යපයන් වහන්ස, ඉදින් මම මේ ලාමක දෘෂ්ටිය දුරැලීම් නම්, ‘පායාසී රාජන්‍ය තෙම කොතරම් මහත් අනුවණයෙක් ද! කොතරම් මහත් අව්‍යක්තයෙක් ද!! කොතරම් මහත් ලෙස වැරදි ගැනුම් ගත්තෙක්දැ !!!’යි මට දොස් කියන්නෝ වන්නාහ. එබැවින් ඔවුන් කෙරේ කෝපයෙනුත් මේ දෘෂ්ටිය ගෙන හැසිරෙන්නෙමි, ඔබ කී දෑ මකන ස්වභාවයෙනුත් මේ දෘෂ්ටිය ගෙන හැසිරෙන්නෙමි, ඔවුනට එකට එක කරනු විසිනුත් මේ දෘෂ්ටිය ගෙන හැසිරෙන්නෙමි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "16. කුමරකසුප් - “රාජන්‍යයෙනි, එසේ වී නම් ඔබට උපමාවක් කරන්නෙමි. උපමායෙනුදු මෙහි ඇතැම් නුවණැති පුරුෂයෝ කියන ලද වචනයේ අරුත් දැනගන්නාහ. රාජන්‍යයෙනි, පෙරැ වූවක් කියමි. දූවරුවෝ{1} දෙදනෙක් පසැටින් දූ කෙළියාහ. එක් දූවරුවෙක් ආ ආ (පරදින පරදින) පසැට ගිලී. දෙවැනි දූවරු තෙම ඒ දූවරුවා පැරැදුණු පැරැදුණු පසැට ගිලින්නහු දිටී ය. දැක ඒ දූවරුවාට ‘යහලුව, තෝ ඒකාන්තයෙන් දිනහි ය. යහලුව, මට සියලු පස ඇට දෙව, බිලියමක් කරන්නෙමි’ යි කී ය. ‘යහලුව, එසේ යැ’ යි කියා ඒ දූවරුහට සියලු පසැට දුන්නේ ය. එ කලැ ඒ දූවරු තෙම පසැට විසයෙන් යොදා ඒ අනිත් දූවරුවා බණවා ‘යහලු, එව, පසැටින් කෙළින්නාමු’ යි කී ය. හේ ‘එසේ ය, යහලු’ යි කියා ම ඔහුට පිළිවදන් දුන. දෙවනු ද ඒ දූවරුවෝ පසැටින් කෙළියාහ. දෙවනු ද ඒ දූවරු තෙම පැරැදුණු පැරැදුණු පසැට ගිලියි. දෙවෙනි දූවරු තෙම දෙවනු ද ඒ දූවරුවා පස ඇට ගිලින්නාහු දිටී යැ. දැක ඒ දූවරුවාට,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘තියුණූ විසයෙන් තවරන ලද පසැට ගිලින පුරිස් එය (විස තවරා ඇති බව) නො දනී. බොල පවිටු දුහුව, ගිලැ පිය පසු වැ එය තට නපුරු වනු ඇතැ’ යි\nමෙ බස් පැවැසී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "රාජන්‍යයෙනි, මෙසේ ම ඔබ පසැට දුහු වකු (අක්ෂධූර්තයකු) මෙන පැනෙති. රාජන්‍යයෙනි. මේ ලාමක දෘෂ්ටිය බැහැර කරන්න. එය ඔබට දිගු කලක් ඇවැඩ පිණීස දුක් පිණිස නො වේ වා.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. දූ කෙළින්නෝ"
                    }
                ]
            }
        },
        {
            "pageNum": 552,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කිඤ්චාපි භවං කස්සපො එවමාහ, අථ ඛො නෙවාහං සක්කොමි ඉදං පාපකං දිට්ඨිගතං පටිනිස්සජ්ජිතුං. රාජා පි මං පස්සෙනදිකොසලො ජානාති, තිරොරාජානො පි: පායාසිරාජඤ්ඤො එවංවාදී එවංදිට්ඨී ‘ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති. සචාහං, භො කස්සප ඉදං පාපකං දිට්ඨිගතං පටිනිස්සජ්ජිස්සාමි, භවිස්සන්ති මෙවත්තාරො: ‘යාව බාලො පායාසි රාජඤ්ඤො අබ්යත්තො දුග්ගහිතගාහී’ති. කොපෙන පි නං හරිස්සාමි, මක්ඛෙනපි නං හරිස්සාමි, පලාසෙනපි නං හරිස්සාමී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "17. තෙන හි රාජඤ්ඤ උපමන්තෙ කරිස්සාමි. උපමාය පි ඉධෙකච්චෙ විඤ්ඤූ පුරිසා භාසිතස්ස අත්ථං ආජානන්ති. භූතපුබ්බං රාජඤ්ඤ අඤ්ඤතරො ජනපදො වුට්ඨාසි. අථ ඛො සහායකො සහායකං ආමන්තෙසි: ‘ආයාම සම්ම, යෙන සො ජනපදො තෙනුපසඞ්කමිස්සාම, අප්පෙවනාමෙත්ථ කිඤ්චි ධනං අධිගච්ඡෙය්යාමා’ති. ‘එවං සම්මා’ති ඛො සහායකො සහායකස්ස පච්චස්සොසි. තෙ යෙන සො ජනපදො යෙනඤ්ඤතරං ගාමපත්ථං තෙනුපසඞ්කමිංසු. තත්ථ අද්දසංසු පහූතං සාණං ඡඩ්ඩිතං. දිස්වා සහායකො සහායකං ආමන්තෙසි: ‘ඉදං ඛො සම්ම පහූතං සාණං ඡඩ්ඩිතං, තෙන හි සම්ම ත්වඤ්ච සාණභාරං බන්ධ, අහඤ්ච සාණභාරං බන්ධිස්සාමි. උභො සාණභාරං ආදාය ගමිස්සාමා’ති. ‘එවං සම්මා’ති ඛො සහායකො සහායකස්ස පටිස්සුත්වා සාණභාරං බන්ධිත්වා තෙ උභො පි සාණභාරං ආදාය යෙනඤ්ඤතරං ගාමපත්ථං තෙනුපසඞ්කමිංසු. තත්ථ අද්දසංසු පහූතං සාණසුත්තං ඡඩ්ඩිතං. දිස්වා සහායකො සහායකං ආමන්තෙසි: යස්ස ඛො සම්ම අත්ථාය ඉච්ඡෙය්යාම සාණං ඉදං පහූතං සාණසුත්තං ඡඩ්ඩිතං. තෙන හි සම්ම ත්වඤ්ච සාණභාරං ඡඩ්ඩෙහි, අහඤ්ච සාණභාරං ඡඩ්ඩෙස්සාමි, උභො සාණසුත්තභාරං ආදාය ගමිස්සාමා’ති. ‘අයං ඛො මෙ සම්ම සාණභාරො දූරාභතො ච සුසන්නද්ධො ච, අලං මෙ, ත්වං පජානාහී’ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්සේ මෙසේ වදාරතත්, වැලිදු මේ ලාමක දෘෂ්ටිය බැහැර කරන්නට මම නො සමතිමි. ‘පායාසි රාජන්‍ය තෙම ‘මෙසේ පරලොව නැත, උපපාදුක සත්හු නැත, කුශලාකුශල කර්මයනට ඵල විපාක නැතැ’ යි මෙසේ වාද ඇත්තෙකැ යි මෙබඳු දෘෂ්ටි ඇත්තෙකැ යි පසේනදි කොසොල් රජ ද දනී, පිටත් දනව්හි රජදරුවෝ ද දනිත්. භවත් කාශ්‍යපයන් වහන්ස, අදින් මම් මේ ලාමක දෘෂ්ටි ය හැරැපීම් නම්, ‘පායාසී රාජන්‍යයා කොතරම් මහත් අනුවණයෙක් ද! කොතරම් මහත් අව්‍යක්තයෙක් ද!! කොතරම් මහත් වැරැදි ගැනුම් ගත්තෙක් ද!!!’ යි මෙසේ මට ගරහා කියන්නෝ වන්නාහ. එ බැවින් මම් ඔවුන් කෙරෙහි කෝපයෙන් ද මේ දෘෂ්ටිය ගෙන හැසිරෙන්නෙමි, ඔබ කී දෑ මකන සැහැවියෙනුත් මේ දෘෂ්ටිය ගෙන හැසිරෙන්නෙමි, ඔවුනට එකට එක කරනු විසිනුත් මේ දෘෂ්ටිය ගෙන හැසිරෙන්නෙමි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "17. කුමරකසුප් - “එසේ වී නම් ඔබට උවමක් කරන්නෙමි. උපමායෙනුත් මෙහි ඇතැම් නුවණැති පුරුෂයෝ කී කරුණෙහි අරුත් දැන ගනිත්. රාජන්‍යයෙනි, පෙරැ වූවක් කියමි: එක්තරා දනව්වෙක් නැගී ගියේ ය (දනවු වැස්සෝ දනව්ව හැර දමා ගියාහ.) එ කලැ යහලුවෙක් යහලුවකු බණවා, ‘යහලුව, එමු. ඒ දනව්ව කරා යන්නම්හ. එහි දී කිසි ධනයක් ලදුමෝ නම් ඉතා යෙහෙකැ’ යි කී ය. ‘එසේ ය, යහලුවැ’ යි කියා ම අනිත් යහලු තෙම ඔහුට පිළිවදන් දුන. ඔහු ඒ දනව්වට ගොස් එහි එක්තරා ජනශුන්‍ය වූ ගමකට පැමිණියාහු ය. එහි දමා පියන ලද බොහෝ හන වැහැරී දුටුහ. දැක එක් යහලුවෙක් අනෙකා බණවා, ‘යහලුව, මේ හැරැ දමා පියන ලද බොහෝ හණ වැහැරී ය. එ බැවින් යහලුව, තෝත් හණ වැහැරි බරක් බඳුව, මමත් හණ වැහැරි බරක් බඳින්නෙමි. අපි දෙදෙනා ම හණවැහැරි බරක් ගෙන යන්නමු’ යි කී ය. ‘යහලුව, එසේ යැ’ යි අනෙකා සිය යහලුවාට පිළිවදන් දී, හණ වැහැරි බරක් බැඳ ඔහු දෙදෙනා ම එය ගෙන ජනයාගෙන් හිස් එක්තරා ගමකට ගියාහ. ඔහු එහි දී හැර දමා පියන ලද බොහෝ හණනූල් දුටුහ. දැක එක් යහලුවෙක් අනිත් යහලුවාට ‘යහලුව යම් ධනයක් සඳහා අපි හණවැහැරි ගෙන යනු කැමැතිවූ මු ද, මේ එයට වඩා අගනා ඉවත දමන ලද බොහෝ හනනූල් ඇත. එ බැවින් යහලුව, තෝත් හණවැහැරී බර ඉචත දමව, මමත් හණ වැහැරී බර ඉවත ලන්නෙමි. අපි දෙ දෙනා ම හණනූල් බරක් ගෙන යන්නම්හ’ යි කී ය. ‘යහලුව මේ හණ වැහැරී බර වනාහි මා විසින් දුරැ සිටම ගෙනෙන ලද්දෙක මොනොවට බඳනා ලද්දේ ය. මට හනනූලින් කම් නැත. කළ යුත්ත හෝ දනුව’ යි කී ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 554,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො සො සහායකො සාණභාරං ඡඩ්ඩෙත්වා සාණසුත්තභාරං ආදියි. තෙ යෙනඤ්ඤතරං ගාමපත්ථං තෙනුපසඞ්කමිංසු. තත්ථ අද්දසංසු පහූතා සාණියො ඡඩ්ඩිතා, දිස්වා සහායකො සහායකං ආමන්තෙසි: ‘යස්ස ඛො සම්ම අත්ථාය ඉච්ඡෙය්යාම සාණං වා සාණසුත්තං වා, ඉමා පහූතා සාණියො ඡඩ්ඩිතා. තෙන හි සම්ම ත්වඤ්ච සාණභාරං ඡඩ්ඩෙහි, අහඤ්ච සාණසුත්තභාරං ඡඩ්ඩෙස්සාමි, උභො සාණභාරං ආදාය ගමිස්සාමා’ති. ‘අයං ඛො මෙ සම්ම සාණභාරො දූරාභතො ච සුසන්නද්ධො ච, අලං මෙ ත්වං පජානාහී’ති. අථ ඛො සො සහායකො සාණසුත්තභාරං ඡඩ්ඩෙත්වා සාණභාරං ආදියි. තෙ යෙනඤ්ඤතරං ගාමපත්ථං තෙනුපසඞ්කමිංසු. තත්ථ අද්දසංසු පහූතං ඛොමං ඡඩ්ඩිතං -පෙ- පහූතං ඛොමසුත්තං ඡඩ්ඩිතං -පෙ- පහූතං ඛොමදුස්සං ඡඩ්ඩිතං -පෙ- පහූතං කප්පාසං ඡඩ්ඩිතං -පෙ- පහූතං කප්පාසිකසුත්තං ඡඩ්ඩිතං -පෙ- පහූතං කප්පාසිකදුස්සං ඡඩ්ඩිතං -පෙ- පහූතං අයං ඡඩ්ඩිතං -පෙ- පහූතං ලොහං ඡඩ්ඩිතං -පෙ- පහූතං තිපුං ඡඩ්ඩිතං පහූතං සීසං ඡඩ්ඩිතං දිස්වා -පෙ- පහූතං සජ්ඣුං ඡඩ්ඩිතං -පෙ- පහූතං සුවණ්ණං ඡඩ්ඩිතං. දිස්වා සහායකො සහායකං ආමන්තෙසි: ‘යස්ස ඛො සම්ම අත්ථාය ඉච්ඡෙය්යාම සාණං වා සාණසුත්තං වා සාණියො වා ඛොමං වා ඛොමසුත්තං වා ඛොමදුස්සං වා කප්පාසං වා කප්පාසිකසුත්තං වා කප්පාසිකදුස්සං වා අයං වා ලොහං වා තිපුං වා සීසං වා සජ්ඣුං වා, ඉදං පහූතං සුවණ්ණං ඡඩ්ඩිතං. තෙන හි සම්ම ත්වඤ්ච සාණභාරං ඡඩ්ඩෙහි, අහඤ්ච සජ්ඣුභාරං ඡඩ්ඩෙස්සාමි, උභො සුවණ්ණභාරං ආදාය ගමිස්සාමා’ති. ‘අයං ඛො මෙ සම්ම සාණභාරො දූරාභතො ච සුසන්නද්ධො ච අලං මෙ, ත්වං පජානාහී’ති. අථ ඛො සො සහායකො සජ්ඣුභාරං ඡඩ්ඩෙත්වා සුවණ්ණභාරං ආදියි. තෙ යෙන සකො ගාමො තෙනුපසඞ්කමිංසු. තත්ථ යො සො සහායකො සාණභාරං ආදාය අගමාසි. තස්ස නෙව මාතාපිතරො අභිනන්දිංසු, න පුත්තදාරා අභිනන්දිංසු, න මිත්තාමච්චා අභිනන්දිංසු. න ච තතොනිදානං සුඛං සොමනස්සං අධිගච්ඡි. යො පන සො සහායකො සුවණ්ණභාරං ආදාය අගමාසි, තස්ස මාතාපිතරොපි අභිනන්දිංසු, පුත්තදාරාපි අභිනන්දිංසු, මිත්තාමච්චා පි අභිනන්දිංසු, තතො නිදානඤ්ච සුඛං සොමනස්සං අධිගච්ඡි. එවමෙව ඛො ත්වං රාජඤ්ඤ සාණභාරිකූපමො මඤ්ඤෙ පටිභාසි. පටිනිස්සජ්ජෙතං රාජඤ්ඤ පාපකං දිට්ඨිගතං, පටිනිස්සජ්ජෙතං රාජඤ්ඤ පාපකං දිට්ඨිගතං. මා තෙ අහොසි දීඝරත්තං අහිතාය දුක්ඛායා”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "එවිට අනිත් යහලුවා තමා ගෙනා හන වැහැරී බර ඉවත දමා හණනූල් බරක් ගත්තේ ය. ඔහු මිනිසුන් හැර දමා ගිය එක්තරා ගමකට ගියාහ. එහි හැර දමා පියන ලද බොහෝ හණරෙදි (ගෝනි) දුටුහ. දැක පළමු සගයා දෙවැනි යහලුවා බණවා ‘යහලුව, යම් ධනයක් සඳහා අපි හණ හෝ හණ නූල් හෝ කැමැත්තමෝ ද, (එයට සුදුසු වූ) මේ හැරදමා පියන ලද බොහෝ හණරෙදි ඇත. යහලුව, එ බැවින් තෝත් හණවැහැරි බර ඉවත දමා පියව, මමත් හණනූල් බර ඉවත දමා පියන්නෙමි. අපි දෙදෙනා ම හණ රෙදි බරක් ගෙන යමු’ යි කී ය. ‘යහලුව, මේ හණ වැහැරි බර මා විසින් දුරැ සිට ගෙනෙන ලද්දේ ද මොනොවට බඳනා ලද්දේ ද වෙයි. මට හණ රෙද්දෙන් වැඩෙක් නැත. කළ යුත්තක් හෝ දනුව’ යි දෙවැන්නා කී ය. ඉක්බිති ඒ යහලු තෙම හණනූල් බර ඉවත දමා හණරෙදි බරක් ගත්තේ ය. ඔහු මිනිසුන් හැර දමා ගිය එක්තරා ගමකට පැමිණියාහ. එහි ඉවත දමා පියන ලද බොහෝ කොමුවැහැරි දුටුහ … ඉවත දමා පියන ලද බොහෝ කොමු නූල් දුටුහ … ඉවත දමා පියන ලද බොහෝ කොමු පිළී … ඉවත දමා පියන ලද බොහෝ කපු … ඉවත දමා පියන ලද බොහෝ කපු නූල් … ඉවත දමා පියන ලද බොහෝ කපු පිළී … ඉවත දමා පියන ලද බොහෝ යකඩ …ඉවත දමා පියන ලද බොහෝ තඹ … ඉවත දමා පියන ලද බොහෝ කලු ඊයම් … ඉවත දමා පියන ලද බොහෝ සුදු ඊයම් … ඉවත දමා පියන ලද බොහෝ රිදී … ඉවත දමා පියන ලද බොහෝ රන් දුටුහ. දැක පළමු යහලුවා දෙවැන්නා බණවා ‘යහලුව, යම් ධනයක් සඳහා හණ වැහැරි හෝ හණ නූල් හෝ හණ පිළී හෝ කොමු වැහැරි හෝ කොමු හූල් හෝ කොමු පිළී හෝ කපු හෝ කපු හූ හෝ කපු පිළී හෝ යකඩ හෝ තඹ හෝ කලු ඊයම් හෝ සුදු ඊයම් හෝ රිදී හෝ කැමැති වන්නමෝ ද, ඒ සඳහා ම (අපට ඇවැසි වූ) මේ හැර දමා පියන ලද බොහෝ රන් ලැබී ඇත. එ බැවින්, යහලුව, තෝත් හණවැහැරි බර ඉවත දමා පියව, මමත් රිදී බර ඉවත දමා පියන්නෙමි. අපි දෙදෙනා ම රන් බරක් ගෙන යම්හ’ යි කී. ‘යහලුව, මේ හණවැහැරි බර මා විසින් දුරැ සිට ගෙනෙන ලද්දේ ද මොනොවට බැඳ ගන්නා ලද්දේ ද වෙයි. එ බැවින් මට රනින් කම් නැත. තා කළ යුතු දැය තෝ ගනුව’ යි කී ය. එ විට ඒ පළමු යහලු තෙම රිදී බර ඉවත දමා පියා රන් බරක් ගත්තේ ය. ඔහු දෙදෙන සිය ගම කරා ගියාහ. ඔවුන් අතුරෙන් යම් යහලුවෙක හණ වැහැරි බර ගෙන ගියේ ද, ඔහුගේ මා පියෝ ඔහු නො ම පිළි ගත්හ. අඹු දරුවෝ ද ඔහු නො පිළිගත්හ. එ හෙයින් හේ සුවක් සොම්නසක් නො ලදුයේ ය. යම් යහලුවෙක් වනාහි රන් බරක් ගෙන ගියේ ද, ඔහුගේ මා පියෝ ද ඔහු පිළි ගත්හ, අඹුදරුවෝ ද ඔහු පිළිගත්හ. මිත්‍රාමාත්‍යයෝ ද පිළිගත්හ, එහෙයින් හේ සුවයත් සොම්නසත් ලැබී ය. රාජන්‍යයෙනි, එ පරිද්දෙන් ම ඔබ ද හණ වැහැරි ගෙන ගිය පුරුෂයා වැන්නකු සේ පෙනෙති. රාජන්‍යයෙනි, මේ ලාමක දෘෂ්ටිය බැහැර කරන්න. එය ඔබට දිගු කලක් අවැඩ පිණිස දුක් පිණිස නො වේ වා.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 556,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "18. “පුරිමෙනෙචාහං ඔපම්මෙන භොතො කස්සපස්ස අත්තමනො අභිරද්ධො. අපිචාහං ඉමානි විචිත්රානි පඤ්හපටිභානානි සොතුකාමො එවාහං භවන්තං කස්සපං පච්චනීකං කාතබ්බං අමඤ්ඤිස්සං. අභික්කන්තං භො කස්සප, අභික්කන්තං භො කස්සප! සෙය්යථාපි භො කස්සප, නික්කුජ්ජිතං වා උක්කුජ්ජෙය්ය, පටිච්ඡන්නං වා විවරෙය්ය, මූළ්හස්ස වා මග්ගං ආචික්ඛෙය්ය, අන්ධකාරෙ වා තෙලපජ්ජොතං ධාරෙය්ය: චක්ඛුමන්තො රූපානි දක්ඛන්තීති. එවමෙව භොතා කස්සපෙන අනෙකපරියායෙන ධම්මො පකාසිතො. එසාහං භො කස්සප තං භගවන්තං ගොතමං සරණං ගච්ඡාමි ධම්මඤ්ච භික්ඛුසඞ්ඝඤ්ච. උපාසකං මං භවං කස්සපො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතං. ඉච්ඡාමි චාහං භො කස්සප මහායඤ්ඤං යජිතුං. අනුසාසතු මං භවං කස්සපො යං මමස්ස දීඝරත්තං හිතාය සුඛායා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යථාරූපෙ ඛො රාජඤ්ඤ යඤ්ඤෙ ගාවො වා හඤ්ඤන්ති, අජෙළකා වා හඤ්ඤන්ති, කුක්කුටසූකරා වා හඤ්ඤන්ති, විවිධා වා පාණා සංඝාතං ආපජ්ජන්ති, පටිග්ගාහකා ච හොන්ති මිච්ඡාදිට්ඨී මිච්ඡාසඞ්කප්පා මිච්ඡාවාචා මිච්ඡාකම්මන්තා මිච්ඡාආජීවා මිච්ඡාවායාමා මිච්ඡාසතී මිච්ඡාසමාධී, එවරූපො ඛො රාජඤ්ඤ යඤ්ඤො න මහප්ඵලො හොති න මහානිසංසො න මහාජුතිකො න මහාවිප්ඵාරො. සෙය්යථාපි රාජඤ්ඤ කස්සකො බීජනඞ්ගලමාදාය වනං පවිසෙය්ය. සො තත්ථ දුක්ඛෙත්තෙ දුබ්භූමෙ අවිහතඛාණුකණ්ටකෙ බීජානි පතිට්ඨාපෙය්ය ඛණ්ඩානි පූතීනි වාතාතපහතානි අසාරාදානි අසුඛසයිතානි, දෙවො ච න කාලෙන කාලං සම්මා ධාරං අනුප්පවෙච්ඡෙය්ය. අපි නු තානි බීජානි වුද්ධිං ෙවරූළ්හිං වෙපුල්ලං ආපජ්ජෙය්ය? කස්සකො වා විපුලං ඵලං අධිගච්ඡෙය්යා”ති?"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "18. පායාසී - “පළමු උපමායෙන් ම මම් භවත් කාශ්‍යපයන් වහන්සේ ට සතුටු වීමි, වෙසෙසින් පැහැදිණිමි. එතෙකුදු වුවත් මේ විසිතුරු පැණ විසැඳුම් අසනු කැමැත්තෙම් ම භවත් කාශ්‍යපයන් වහන්සේට විරුද්ධ වැ කථා කළ යුතු කොට සිතිමි. භවත් කාශ්‍යපයන් වහන්ස, ඔබේ දෙසුම අභිකාන්ත යැ, භවත් කාශ්‍යපයන් වහන්ස, ඔබ දෙසුම වෙසෙසින් කාන්ත යැ. භවත් කාශ්‍යයන් වහන්ස, යම් සේ මුණින් නමා තබන ලද බඳුනක් උඩුකුරු කොට තබන්නේ ද, වැසුණු දැයක් වැහුම් හැර දක්වන්නේ හෝ වේ ද, මං මුළා වූවකුට මඟ කියන්නේ ද, ඇස් ඇතියන් මෙයින් රූප දකිති’ යි අඳුරෙහි තෙල් පහනක් දල වන්නේ හෝ වේ ද, එ පරිද්දෙන් ම භවත් කාශ්‍යපයන් වහන්සේ විසින් නොයෙක් කරුණින් දහම් පැවැසිණ. භවත් කාශ්‍යපයන් වහන්ස, ඒ මම් ඒ භගවත් ගෞතමයන් වහන්සේ ද, ධර්මය ද භික්ෂු සංඝයා ද සරණ යෙමි. භවත් කාශ්‍යපයන් වහන්සේ මා අද සිට දිවි හිම් කොට සරණ ගිය උවසුවකු කොට සලකන සේක් වා! භවත් කාශ්‍යපයන් වහන්ස, යම් ඒ යඥයක් මට දිගුකලක් වැඩ පිණිස වන්නේ ද එසේ වූ මහා යඥයක් යජනට (මහ දනක් දෙන්නට) කැමැත්තෙම් ද වෙමි. එහි ලා භවත් කාශ්‍යපයන් වහන්සේ මට අනුශාසනා කරන සේක්වා”.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “රාජන්‍යයෙනි, යම් බඳු යඥයෙක (දානයෙක) ගවයෝ හෝ මරනු ලැබෙත් ද, එළුවෝ තිරෙළුවෝ හෝ මරනු ලැබෙත් ද, කුකුළෝ හූරෝ හෝ මරනු ලැබෙත් ද, විවිධ ප්‍රාණීහු හෝ මරණයට පැමිණෙත් ද, එය පිළිගන්නෝත් මිථ්‍යා දෘෂ්ටි ඇත්තෝ, මිථ්‍යා සංකල්ප ඇත්තෝ, මිථ්‍යා වචන ඇත්තෝ, මිථ්‍යා කර්මාන්ත ඇත්තෝ, මිථ්‍යා ආජීවය ඇත්තෝ, මිථ්‍යා ව්‍යායාමය ඇත්තෝ, මිථ්‍යා ස්මෘතිය ඇත්තෝ, මිථ්‍යා සමාධිය ඇත්තෝ වෙත් ද, රාජන්‍යයෙනි, මෙබඳු වූ යඥය වූ කලී මහත් ඵල ඇත්තෝ නො වෙයි, මහත් අනුසස් ඇත්තේ නො වෙයි, මහත් බැබලීම් ඇත්තේ නො වෙයි, මහත් පැතිරීම් ඇත්තේ නො වෙයි. රාජන්‍යයෙනි, යම් බඳු වූ යඥයෙක (දානයෙක) වනාහි ගවයෝ නො ම මරනු ලැබෙද්ද, එළුවෝ තිරෙළුවෝ නො ම මරනු ලැබෙද්ද, කුකුළෝ හූරෝ නො ම මරනු ලැබෙද්ද, විවිධ ප්‍රාණීහු හෝ මරණයට නො පැමිණෙත් ද, ඒ යඥය පිළීගන්නෝත් සම්‍යක් දෘෂ්ටි ඇත්තාහු, සම්‍යක්සංකල්ප ඇත්තාහු, සම්‍යක් වචන ඇත්තාහු, සම්‍යක්කර්මාන්ත ඇත්තාහු, සම්‍යගාජීවය ඇත්තාහු, සම්‍යක් ව්‍යායාමය ඇත්තාහු, සම්‍යක් ස්මෘතිය ඇත්තාහු, සම්‍යක්සමාධිය ඇත්තාහු වෙත් ද, රාජන්‍යයෙනි, මෙබඳු වූ යඥය මහත් ඵල ඇත්තේ වෙයි, මහත් අනුසස් ඇත්තේ වෙයි, මහත් බැබැලීම් ඇත්තේ වෙයි, මහත් පැතිරීම් ඇත්තේ වෙයි. රාජන්‍යයෙනි, යම්සේ ගොවියෙක් බිජුවට හා නඟුල හා ගෙන වනයකට පිවිස්නේ ද, හේ එහි නො නසන ලද කණු කටු ඇති, නො සම වූ බිම් ඇති නිසරු කෙතෙක කැඩී ගිය කුණු වූ අවුසුළඟින් පෙළුනු, පොළොවේ සාරය නො ඇද ගන්නා වූ තවාණෙහි සුවසේ නො ම හොවනා ලද්දා වූ බිජුවට වපුරන්නේ නම්, මේඝයත් කලින් කලැ මොනොවට වැසි දහර නො වස්වන්නේ නම්, ඒ බීජයෝ වැඩීමට නැඟීමට මහත් බවට පැමිණෙන්නාහු ද? ගොවියා හෝ මහත් ඵල ලබන්නේ ද?”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 558,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“නොහිදං භො කස්සප”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“එවමෙව ඛො රාජඤ්ඤ යථාරූපෙ යඤ්ඤෙ ගාවො වා හඤ්ඤන්ති අජෙළකා වා හඤ්ඤන්ති කුක්කුටසූකරා වා හඤ්ඤන්ති විවිධා වා පාණා සංඝාතං ආපජ්ජන්ති, පටිග්ගාහකා ච හොන්ති. මිච්ඡාදිට්ඨී මිච්ඡාසඞ්කප්පා මිච්ඡාවාචා මිච්ඡාකම්මන්තා මිච්ඡාආජීවා මිච්ඡාවායාමා මිච්ඡාසතී මිච්ඡාසමාධී. එවරූපො ඛො රාජඤ්ඤ යඤ්ඤො න මහප්ඵලො හොති න මහානිසංසො න මහාජුතිකො න මහාවිප්ඵාරො. යථාරූපෙ ච ඛො රාජඤ්ඤ යඤ්ඤෙ නෙව ගාවො හඤ්ඤන්ති, න අජෙළකා හඤ්ඤන්ති, න කුක්කුටසූකරා හඤ්ඤන්ති, න විවිධා වා පාණා සඞ්ඝාතං ආපජ්ජන්ති, පටිග්ගාහකා ච හොන්ති සම්මාදිට්ඨී සම්මාසඞ්කප්පා සම්මාවාචා සම්මාකම්මන්තා සම්මාආජීවා සම්මාවායාමා සම්මාසතී සම්මාසමාධී, එවරූපො ඛො රාජඤ්ඤ යඤ්ඤො මහප්ඵලො හොති මහානිසංසො මහාජුතිකො මහාවිප්ඵාරො. සෙය්යථාපි රාජඤ්ඤ කස්සකො බීජනඞ්ගලං ආදාය වනං පවිසෙය්ය, සො තත්ථ සුඛෙත්තෙ සුභූමෙ සුවිහතඛාණුකණ්ටකෙ බීජානි පතිට්ඨාපෙය්ය අඛණ්ඩානි අපූතීනි අවාතාතපහතානි සාරාදානි සුඛසයිතානි. දෙවො ච කාලෙන කාලං සම්මා ධාරං අනුප්පවච්ඡෙය්ය. අපි නු තානි බීජානි වුද්ධිං ෙවරූළ්හිං වෙපුල්ලං ආපජ්ජෙය්යුං, කස්සකො වා විපුලං ඵලං අධිගච්ඡෙය්යාති?”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“එවං භො කස්සප.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“එවමෙව ඛො රාජඤ්ඤ යථාරූපෙ යඤ්ඤෙ නෙව ගාවො හඤ්ඤන්ති න අජෙළකා හඤ්ඤන්ති, න කුක්කුටසූකරා හඤ්ඤන්ති, න විවිධා වා පාණා සංඝාතං ආපජ්ජන්ති, පටිග්ගාහකා ච හොන්ති සම්මාදිට්ඨී සම්මාසඞ්කප්පා සම්මාවාචා සම්මාකම්මන්තා සම්මාආජීවා සම්මාවායාමා සම්මාසතී සම්මාසමාධී, එවරූපො ඛො රාජඤ්ඤ යඤ්ඤො මහප්ඵලො හොති මහානිසංසො මහාජුතිකො මහාවිප්ඵාරො”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "පායාසී - “භවත් කාශ්‍යපයන් වහන්ස, මෙය නො ම වන්නේ ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “රාජන්‍යයෙනි, එ පරිද්දෙන් ම යම්බඳු යඥයෙක ගවයෝ හෝ මරනු ලැබෙත් ද, එළුවෝ තිරෙළුවෝ හෝ මරනු ලැබෙත් ද, කුකුළෝ හූරෝ හෝ මරනු ලැබෙත් ද, විවිධ ප්‍රාණීහු හෝ මරණයට පැමිණෙත් ද, ඒ යඥය පිළිගන්නෝත් මිථ්‍යාදෘෂ්ටි ඇත්තෝ, මිථ්‍යා සංකල්ප ඇත්තෝ, මිථ්‍යා වචන ඇත්තෝ, මිථ්‍යා කර්මාන්ත ඇත්තෝ, මිථ්‍යා ආජීවය ඇත්තෝ, මිථ්‍යා ව්‍යායාමය ඇත්තෝ, මිථ්‍යා ස්මෘතිය ඇත්තෝ, මිථ්‍යා සමාධිය ඇත්තෝ වෙත් ද, රාජන්‍යයෙනි, මෙබඳු වූ යඥය වනාහි මහත්ඵල ඇත්තේ නො වේ, මහත් අනුසස් ඇත්තේ නො වේ, මහත් බැබැලීම් ඇත්තේ නො වේ, මහත් පැතිරීම් ඇත්තේ නො වේ. රාජන්‍යයෙනි, යම් බඳු වූ යඥයෙක වනාහි ගවයෝ නො ම මරනු ලැබෙත් ද, එළුවෝත් තිරෙළුවෝත් නො ම මරනු ලැබෙත් ද, කුකුළෝත් ඌරෝත් නො ම මරනු ලැබෙත් ද, විවිධ ප්‍රාණීහු හෝ මරණයට නො පැමිණෙත් ද, ඒ යඥය පිළි ගන්නෝත් සම්‍යග් දෘෂ්ටිය ඇත්තෝ, සම්‍යක් සංකල්පය ඇත්තෝ, සම්‍යග් වචනය ඇත්තෝ, සම්‍යගාජීවය ඇත්තෝ, සම්‍යග් ව්‍යායාමය ඇත්තෝ, සම්‍යක් ස්මෘතිය ඇත්තෝ, සම්‍යක් සමාධිය ඇත්තෝ වෙත් ද, රාජන්‍යයෙනි, මෙබඳු වූ යඥය මහත් ඵල ඇත්තේ, මහත් අනුසස් ඇත්තේ, මහත් බැබැලීම් ඇත්තේ, මහත් පැතිරීම් ඇත්තේ වෙයි. රාජන්‍යයෙනි, යම්සේ ගොවියෙක් බිජුවට හා නගුල හා ගෙන වනයකට පිවිස්නේ නම්, හේ එහි මොනොවට නසා පියන ලද කණු හා කටු හා ඇති, සමතලා බිම ඇති සරු කෙතෙක කැඩී නො ගිය, කුණු නො වූ අවුසුළං දෙකින් නො පහළ, පොළොවේ සාරය ඇද ගනුයෙහි සමත් තවාණෙහි සුව සේ හොවිනා ලද බීජයන් පිහිටුවන්නේ නම්, මේඝය ද කලින් කලැ මොනොවට වැසි දහර පිවිස්වන්නේ නම, ඒ බීජයෝ වැඩීමට නැඟීමට මහත් බවට පැමිණෙන්නාහු නම්, ගොවියා මහත්ඵල ලබන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පායාසී - “එසේ ම ය, භවත් කාශ්‍යපයන් වහන්ස.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමරකසුප් - “රාජන්‍යයෙනි, එ පරිද්දෙන් ම යම්බඳු වූ යඥයෙක ගවයෝ නො ම මරනු ලැබෙත් ද, එළුවෝත් තිරෙළුවෝත් නො ම මරනු ලැබෙත් ද, කුකුළෝත් ඌරෝත් නො ම මරනු ලැබෙත් ද, විවිධ ප්‍රාණීහු හෝ විනාශයට නො ම පැමිණෙත් ද, යඥය පිළිගන්නෝත් සම්‍යග් දෘෂ්ටි ඇත්තාහු, සම්‍යක් සංකල්පය ඇත්තාහු, සම්‍යග් වචනය ඇත්තාහු, සම්‍යක්කර්මාන්ත ඇත්තාහු, සම්‍යගාජීව ඇත්තාහු, සම්‍යග්ව්‍යායාම ඇත්තාහු සම්‍යක්ස්මෘති ඇත්තාහු, සම්‍යක්සමාධි ඇත්තාහු වෙත් ද, රාජන්‍යයෙනි, මෙබඳු වූ යඥය මහත් පල ඇත්තේ, මහත් අනුසස් ඇත්තේ, මහත් බැබැලීම් ඇත්තේ, මහත් පැතිරීම් ඇත්තේ වෙයි.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 560,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "19. අථ ඛො පායාසි රාජඤ්ඤො දානං පට්ඨපෙසි සමණබ්රාහ්මණකපණඩිකවණිබ්බකයාචකානං. තස්මිං ඛො පන දානෙ එවරූපං භොජනං දිය්යති කණාජකං බිලඞ්ගදුතියං, ධොරකානි ච{1} වත්ථානි ගුළගාලකානි. තස්මිං ඛො පන දානෙ උත්තරො නාම මාණවො බ්යාවටො අහොසි. සො දානං දත්වා එවමනුද්දිසති ‘ඉමිනාහං දානෙන පායාසිං රාජඤ්ඤමෙව ඉමස්මිං ලොකෙ සමාගඤ්ඡිං මා පරස්මින්ති.’ අස්සොසි ඛො පායාසි රාජඤ්ඤො ‘උත්තරො කිර මාණවො දානං දත්වා එවමනුද්දිසති ‘ඉමිනාහං දානෙන පායාසිං රාජඤ්ඤමෙව ඉමස්මිං ලොකෙ සමාගඤ්ඡිං මා පරස්මින්ති’. අථ ඛො පායාසි රාජඤ්ඤො උත්තරං මාණවං ආමන්තාපෙත්වා එතදවොච: සච්චං කිර ත්වං තාත උත්තර දානං දත්වා එවමනුද්දිසසි. ‘ඉමිනාහං දානෙන පායාසිං රාජඤ්ඤමෙව ඉමස්මිං ලොකෙ සමාගඤ්ඡිං මා පරස්මින්ති’?"
                    },
                    {
                        "type": "paragraph",
                        "text": "‘එවං භො’ති. “කිස්ස පන භො ත්වං තාත උත්තර දානං දත්වා එවමනුද්දිසසි. ‘ඉමිනාහං දානෙන පායාසිං රාජඤ්ඤමෙව ඉමස්මිං ලොකෙ සමාගච්ඡිං මා පරස්මින්ති නනු මයං තාත උත්තර පුඤ්ඤත්ථිකා දානස්සෙව ඵලං පාටිකඞ්ඛිනො?{2}“ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“භොතො ඛො පන දානෙ එවරූපං භොජනං දිය්යති කණාජකං බිලඞ්ගදුතියං. භවං පාදාපි න ඉච්ඡෙය්ය ඵුසිතුං, කුතො භුඤ්ජිතුං. ධොරකානි ච වත්ථානි ගුළගාළකානි යානි භවං පාදාපි න ඉච්ඡෙය්ය ඵුසිතුං, කුතො පරිදහිතුං. භවං ඛො පනම්හාකං පියො මනාපො, කථං මයං මනාපං අමනාපෙන සංයොජෙමා?”ති. “තෙන හි ත්වං තාත උත්තර යාදිසාහං භොජනං භුඤ්ජාමි තාදිසං භොජනං පට්ඨපෙහි. යාදිසානි චාහං වත්ථානි පරිදහාමි තාදිසානි ච වත්ථානි පට්ඨපෙහී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“එවං භො”ති ඛො උත්තරො මාණවො පායාසිරාජඤ්ඤස්ස පටිස්සුත්වා යාදිසං භොජනං පායාසි රාජඤ්ඤො භුඤ්ජති තාදිසං භොජනං පට්ඨපෙසි. යාදිසානි ච වත්ථානි පායාසි රාජඤ්ඤො පරිදහති තාදිසානි ච වත්ථානි පට්ඨපෙසි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ථෙරකානි - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ශුළ වාලකානි - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "19. ඉක්බිත්තෙන් පායාසී රාජන්‍ය තෙම මහණ බමුණනට දුගියනට මගියනට යදියනට දන් පිහිටු වී ය. ඒ දානයෙහි වනාහි කාඩි දෙවනු කොට ඇති නිවුඩු සහාලින් පිසූ බත් ඇති බොජුනෙක් දෙවෙයි. මහත් දාවලු ඇති දළ පිලී ද දෙවෙයි. ඒ දානයෙහි වූ කලී උත්තර නම් මාණවකයෙක් ව්‍යාපෘත විය. හේ දන් දී, මම මේ දානය කරණ කොට පායාසී රාජන්‍යයා හා ම මෙ ලොවේහි දී එක් වීමි. පර ලොව්හිදී ඔහු හා නොම එක් වෙම් වා’ යි මෙසේ පුන පුනා කියයි. පායාසී රාජන්‍ය තෙම “උත්තරමාණවක දන් දී, ‘මේ දානය කරණ කොට මම් පායාසී රාජන්‍යයා හා ම මෙලොව්හි දී එක් වීමි, පරලොව්හි දී නොම එක් වෙම්වා’ යි මෙසෙ පුන පුනා කියති” යි මෙ පවත් ඇසීය. ඉක්බිති පායාසී රාජන්‍ය තෙම උත්තර මාණවකයා කැඳවා ‘දරුව උත්තර ය, තෝ දන් දී ‘මේ දානය කරණ කොට මම් පායාසී රාජන්‍යයා හා ම මෙලොවෙහි දී එක් වීමි. පර ලොව්හි දී නො ම එක් වෙම් වා’ යි මෙසේ පුන පුනා කියහි ද? ඒ සැබෑද?’ යි විචාළේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘එසේ ය, සැබැවැ’ යි උත්තර මාණවක කී ය.\n“භවත් දරුව උත්තරය, තෝ දන් දී කවර හෙයින්, ‘මේ දානය කරණ කොට මම් පායාසී රාජන්‍යයා හා ම මෙ ලොව්හි දී එක් වීමි, පර ලොව්හි දී නො ම එක් වෙම් වා’ යි පුන පුනා කියහි ද? දරුව, උත්තරය, අපි පිනෙන් ප්‍රයෝජන ඇත්තමෝ, දානයේ විපාක කැමැත්තමෝ නො වමුදැ?” යි පායාසී රාජන්‍ය කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“භවත්හු ගේ දානයෙහි වූකලී කාඩි දෙවනු කොටැති නිවුඩු සහලින් පිසූ බත් ඇති මෙබඳු බොජුණෙක් දෙවෙයි. භවත්හු එය පයිනුදු පහස්නට නො කැමැති වනු ඇත. වළඳන්නට කොයින් කැමැති වන්නේ ද? භවත් තෙමේ යම් වස්ත්‍රයන් හඳින්නට තබා පයිනුදු පහසනට කැමැති නො වන්නේ ද, එසේ වූ මහත් දාවලු ඇති දළ පිලී දෙවයි. භවත් තෙමේ වූ කලී අපට ප්‍රිය ය, මනාප ය. අපි කෙසේ නම් මනාපයක්හු අමනාපයක්හු හා එක් කොට යොදමෝ දැ”යි උත්තරමාණවක කී ය. “එසේ වී නම් දරුව, උත්තරය, මම් යම් බඳු බොජුනක් වළඳම් ද, එ බඳු බොජුනක් දානයෙහි පිහිටුවව (පිළියෙල කොට තබව), යම් බඳු පිලී මම් හඳිම් ද, එසේ වූ පිලීත් දානයෙහි පිහිටුව ව” යි පායාසී රාජන්‍ය කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“එසේ ය, භවත” යැයි කියා ම උත්තර මාණවක තෙම පායාසී රාජන්‍යයාට පිළිවදන් දී, පායාසී රාජන්‍යයා යම් බඳු බොජුනක් වළඳයි ද, එබඳු බොජුනක් දන් පිණිස පිහිටුවී ය, යම් බඳු පිලී පායාසී රාජන්‍ය තෙම හදියි ද, එබඳු වූ පිලී දන් පිණිස පිහිටුවී ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 562,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො පායාසි රාජඤ්ඤො අසක්කච්චං දානං දත්වා අසහත්ථා දානං දත්වා අචිත්තීකතං දානං දත්වා අපවිද්ධං දානං දත්වා කායස්ස භෙදා පරම්මරණා චාතුමහාරාජිකානං දෙවානං සහබ්යතං උපපජ්ජි සුඤ්ඤං සෙරිස්සකං විමානං. යො පන තස්ස දානෙ බ්යාවටො අහොසි උත්තරො නාම මාණවො. සො සක්කච්චං දානං දත්වා සහත්ථා දානං දත්වා චිත්තීකතං දානං දත්වා අනපවිද්ධං දානං දත්වා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජි දෙවානං තාවතිංසානං සහබ්යතං."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන ආයස්මා ගවම්පති අභික්ඛණං සුඤ්ඤං සෙරිස්සකං විමානං දිවාවිහාරං ගච්ඡති. අථ ඛො පායාසි දෙවපුත්තො යෙනායස්මා ගවම්පති තෙනුපසඞ්කමි, උපසඞ්කමිත්වා ආයස්මන්තං ගවම්පතිං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතං ඛො පායාසිං දෙවපුත්තං ආයස්මා ගවම්පති එතදවොච; ‘කො’සි ත්වං ආවුසො?’ති. ‘අහං භන්තෙ පායාසි රාජඤ්ඤො’ති. “නනු ත්වං ආවුසො එවංදිට්ඨිකො අහොසි. ‘ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති?” “ස්වාහං භන්තෙ එවං දිට්ඨිකො අහොසිං; ‘ඉතිපි නත්ථි පරො ලොකො, නත්ථි සත්තා ඔපපාතිකා, නත්ථි සුකටදුක්කටානං කම්මානං ඵලං විපාකො’ති. අපි චාහං අෙය්යන කුමාරකස්සපෙන එතස්මා පාපකා දිට්ඨිගතා විවෙචිතො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යො පන තෙ ආවුසො දානෙ බ්යාවටො අහොසි උත්තරො නාම මාණවො, සො කුහිං උපපන්නො?’ති. “යො මෙ භන්තෙ දානෙ බ්යාවටො අහොසි උත්තරො නාම මාණවො, සො සක්කච්චං දානං දත්වා සහත්ථා දානං දත්වා චිත්තීකතං දානං දත්වා අනපවිද්ධං දානං දත්වා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නො දෙවානං තාවතිංසානං සහබ්යතං. අහං පන භන්තෙ අසක්කච්චං දානං දත්වා අසහත්ථා දානං දත්වා අචිත්තීකතං දානං දත්වා අපවිද්ධං දානං දත්වා කායස්ස භෙදා පරම්මරණා චාතුමහාරාජිකානං දෙවානං සහබ්යතං උපපන්නො සුඤ්ඤං සෙරිස්සකං විමානං. තෙන හි භන්තෙ ගවම්පති, මනුස්සලොකං ගන්ත්වා එවමාරොචෙහි: සක්කච්චං දානං දෙථ, සහත්ථා දානං දෙථ, චිත්තීකතං දානං දෙථ, අනපවිද්ධං දානං දෙථ. පායාසි රාජඤ්ඤො අසක්කච්චං දානං දත්වා"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ඉක්බිත්තෙන් පායාසී රාජන්‍ය තෙම නොසකසා දන් දී, සියතින් දන් නො දී, ගෞරව නැති ව දන් දී, ඉවත දමන දැයක් මෙන් දන් දී, කාබුන් මරණින් මතු සිවු මහරජයේ දෙවියන් හා එක් වීමට, සේරිස්සක නම් හිස වූ විමනකට උත්පත්ති විසින් පැමිණියේ ය. යම් උත්තර නම් මාණවකයෙක් ඔහුගේ දානයෙහි ව්‍යාපෘත වී ද, හේ සකසා දන් දී, ගෞරව ඇති වැ දන් දී, ඉවත ලන දැයක් මෙන් නොකොට ආදරෙයන් දන් දී, කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට තව්තිසා වැසි දෙවියන් හා එක් වීමට පැමිණියේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එ සමයෙහි වනාහි ආයුෂ්මත් ගවම්පති මහතෙරණුවෝ හිස් වූ සේරිස්සක නම් විමනට දිවා විහරණය පිණිස එක වන් වඩිති. එ කලැ පායාසී දෙව්පුත් ආයුෂ්මත් ගවම්පති තෙරුන් වෙත එළැඹියේ ය. එළැඹ ඔබ වැඳ එකත්පස් වැ සිටියේ ය. එකත්පස වැ සිටියාවූ ම පායාසී දෙව් පුතුට ආයුෂ්මත් ගවම්පති තෙරණුවෝ “ඇවැත්නි, තෙපි කවුරුදැ?” විචාළෝ ය. ‘වහන්ස, මම් පායාසී රාජන්‍ය වෙමි’ යි හේ උත්තර දුන. ‘ඇවැත්නි, තෙපි ‘මෙසේත් පර ලොව් නැත, උපපාදුක සත්වයෝ නැත, කුශලාකුශල කර්මයනට ඵල විපාක නැතැ’ යි මෙසේ වූ දෘෂ්ටි ඇත්තෝ නො වූහු දැ?’ යි තෙරණුවෝ පුළුවූත්හ. ‘වහන්ස, ඒ මම් ‘මෙසේත් පරලොව නැත, මෙසේත් උපපාදුක සත්වයො නැත, කුශලාකුශල කර්මයන්ගේ ඵල විපාක නැතැ’ යි මෙබඳු වූ දෘෂ්ටි ඇත්තෙකිම් වීමි. එහෙත් ආර්‍ය්‍ය වූ කුමාරකාශ්‍යපයන් වහන්සේ විසින් ඒ ලාමක දෘෂ්ටිය කෙරෙන් මම් වෙන් කරන ලදුයෙම් වෙමි’.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ඇවැනි, යම් උත්තර නම් වූ මාණවකයෙක් ඔබගේ දාන ක්‍රියායෙහි ව්‍යාපෘත වූයේ ද හේ කොහි උපන්නේ දැ?” යි තෙරණුවෝ පුළුවත්හ, “වහන්ස, යම් උත්තර නම් මාණවයෙක් මගේ දානයෙහි ව්‍යාපෘත වී ද, හේ සකසා දන් දී, සියතින් දන් දී, සැදැහැයෙන් දන් දී, ඉවතැ ලූ දැයක් සේ නො කොට සාදර වැ දන් දී, කාබුන් මරණින් මතු මනාගති ඇති සග ලොවට, තව්තිසා වැසි දෙවියන් හා එක් වීමට පැමිණියේ ය. වහන්ස, මම් වූ කලී නො සකසා දන් දී, නො සියතින් (අනුන් ලවා) දන් දී, ශ්‍රද්ධාගෞරව නැති වැ දන් දී, ඉවතැ ලූ දැයක් මෙන් කොට දන් දී, කාබුන් මරණින් මතු සිවු මහ රජයෙහි වැසි දෙවියන් හා එක් වීමට හිස් වූ මේ සේරිස්සක විමානයට උත්පත්ති විසින් පැමිණියෙමි. එ බැවින් වහන්ස, ගවම්පතිනි, මිනිස් ලෝ වැඩ කොටැ, ‘සකසා දන් දෙවු, සියතින් දන් දෙවු, ශ්‍රද්ධා ගෞරව උපදවා දන් දෙවු, ඉවත දැමූ දැයක් සේ නො කොට ආදර සහිත ව දන් දෙවු. පායාසි රාජන්‍යයා නොසකසා දන් දී, ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 564,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අසහත්ථා දානං දත්වා අචිත්තීකතං දානං දත්වා අපවිද්ධං දානං දත්වා කායස්ස භෙදා පරම්මරණා චාතුමහාරාජිකානං දෙවානං සහබ්යතං උපපන්නො සුඤ්ඤං සෙරිස්සකං විමානං. යො පන තස්ස දානෙ බ්යාවටො අහොසි උත්තරො නාම මාණවො, සො සක්කච්චං දානං දත්වා සහත්ථා දානං දත්වා චිත්තීකතං දානං දත්වා අනපවිද්ධං දානං දත්වා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නො දෙවානං තාවතිංසානං සහබ්යතන්ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා ගවම්පති මනුස්සලොකං ආගන්ත්වා එවමාරොචෙසි: “සක්කච්චං දානං දෙථ, සහත්ථා දානං දෙථ, චිත්තීකතං දානං දෙථ, අනපවිද්ධං දානං දෙථ. පායාසි රාජඤ්ඤො අසක්කච්චං දානං දත්වා අසහත්ථා දානං දත්වා අචිත්තීකතං දානං දත්වා අපවිද්ධං දානං දත්වා කායස්ස භෙදා පරම්මරණා චාතුමහාරාජිකානං දෙවානං සහබ්යතං උපපන්නො සුඤ්ඤං සෙරිස්සකං විමානං. යො පන තස්ස දානෙ බ්යාවටො අහොසි උත්තරො නාම මාණවො, සො සක්කච්චං දානං දත්වා සහත්ථා දානං දත්වා චිත්තීකතං දානං දත්වා අනපවිද්ධං දානං දත්වා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නො දෙවානං තාවතිංසානං සහබ්යතන්ති.”"
                    },
                    {
                        "type": "centered",
                        "text": "පායාසිරාජඤ්ඤසුත්තං නිට්ඨිතං දසමං.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "අපදානඤ්ච නිදාඤ්ච නිබ්බානඤ්ච සුදස්සනං,\nජනවසභඤ්ච ගොවින්දං සමයං සක්කමෙවච\nසතිපට්ඨානපායාසි මහාවග්ගස්ස සඞ්ගහො,{1}"
                    },
                    {
                        "type": "centered",
                        "text": "මහාවග්ගො නිට්ඨිතො දුතියො.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. මහාපදානං නිදානං නිබ්බානඤ්ච සුදස්සනං,\nජනවසභඤ්ච ගොවින්දං සමයං සක්කපඤ්හකං\nමහාසතිපද්ඨානඤ්ච පායාසි දසමං භවෙ. (කත්ථචි)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "නොසියතින් දන් දී, ගරුසැලැකිලි නැති වැ දන් දී, ඉවත ලූ දැයක් සේ කොට දන් දී, කාබුන් මරණින් මතු සිවුමහරජයෙහි දෙවියන් හා එක් වීමට ශූන්‍ය වූ සේරිස්සක නම් වියනකට පැමිණියේ ය. ඔහුගේ දානයහි ව්‍යාපෘත වූ උත්තර නම් යම් මාණවයෙක් වී ද හේ සකසා දන් දී, සියතින් දන් දී, ශ්‍රද්ධා ගෞරව ඇති වැ දන් දී ඉවත ලූ දැයක් සේ නො කොට සැලැකිලිමත් වැ දන් දී, කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට, තව්තිසා වැසි දෙවියන් හා එක් වීමට පැමිණීයේ යැ’ යි මෙසේ දන්වා වදාරනු මැනැවැ’ පායාසී රාජන්‍ය කී ය.”"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති ආයුෂ්මත් ගවම්පති තෙරණුවෝ මිනිස් ලොවට අවුත්, සකසා දන් දෙවු, සියතින් දන් දෙවු, ශ්‍රද්ධා ගෞරව උපදවා දන් දෙවු, ඉවත ලූ දැයක් සේ නො කොට සැලැකිලිමත් වැ දන් දෙවු. පායාසී රාජන්‍යයා නො සකසා දන් දී, නො සියතින් දන් දී, ශ්‍රද්ධා ගෞරව නො උපදවා දන් දී, ඉවත ලූ දැයක් සේ කොට දන් දී, කාබුන් මරණින් මතු සිවු මහරජයෙහි දෙවියන්ගේ සහභාවයට (දෙවියන් හා එක් වීමට), ශුන්‍ය විමානයකට පැමිණියේ ය. යම් උත්තර නම් මාණවයෙක් ඔහුගේ දානයෙහි ව්‍යාපෘත වී ද, හේ සකසා දන් දී, සියතින් දන් දී, ශ්‍රද්ධා ගෞරව උපදවා දන් දී ඉවත ලූ දැයක් සේ නො කොට සාදර වැ දන් දී කාබුන් මරණින් මතු මනාගති ඇති සග ලොවට, තව්තිසා වැසි දෙවියන්ගේ සහභාවයට (දෙවියන් හා එක් වීමට) පැමිණීයේ යැ” යි මෙසේ දැන්වූහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "දස වනු පායාසී රාජඤ්ඤ සූත්‍රය නිමියේ ය.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 20,
                        "text": "මහාවර්ගයේ උද්දාන ය :\nමහාපදාන, නිදාන, නිර්වාණ, සුදර්ශන, ජනවසභ, ගොවින්ද, සමය, සක්කපඤ්හ, මහාසතිපට්ඨාන, දස වන පායාසී සූත්‍රය ද යන මොවුන්ගෙන් මහාවර්ගයාගේ සංග්‍රහය වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 10,
                        "text": "දෙවෙනි මහාවර්ගය නිමියේ ය.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ]
}