{
    "filename": "dn-2-2",
    "pages": [
        {
            "pageNum": 80,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "2.",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": " මහානිදානසුත්තං",
                        "level": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "1. එවං මෙ සුතං: එකං සමයං භගවා **කුරූසු** විහරති **කම්මාසදම්මං**{1} නාම කුරූනං නිගමො. අථ ඛො ආයස්මා **ආනන්දො** යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා ආනන්දො භගවන්තං එතදවොච: “අච්ඡරියං භන්තෙ, අබ්භුතං භන්තෙ, යාව ගම්භීරො චායං භන්තෙ, පටිච්චසමුප්පාදො ගම්භීරාවභාසො ච. අථ ච පන මෙ උත්තානකුත්තානකො විය ඛායතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. මා හෙවං ආනන්ද අවච, මා හෙවං ආනන්ද අවච. ගම්භීරො චායං ආනන්ද, පටිච්චසමුප්පාදො ගම්භීරාවභාසො ච. එතස්ස ආනන්ද, ධම්මස්ස අනනුබොධා අප්පටිවෙධා එවමයං පජා තන්තාකුලකජාතා ගුළාගුණ්ඩිකජාතා{2} මුඤ්ජබබ්බජභූතා{3} අපායං දුග්ගතිං විනිපාතං සංසාරං නාතිවත්තති."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. අත්ථි ඉදප්පච්චයා ජරාමරණන්ති ඉති පුට්ඨෙන සතා ආනන්ද, අත්ථිති’ස්ස වචනීයං. කිම්පච්චයා ජරාමරණන්ති ඉති චෙ වදෙය්ය, ජාතිපච්චයා ජරාමරණන්ති ඉච්චස්ස වචනීයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි ඉදප්පච්චයා ජාතීති ඉති පුට්ඨෙන සතා ආනන්ද, අත්ථීති’ස්ස වචනීයං. කිම්පච්චයා ජාතීති ඉති චෙ වදෙය්ය, භවපච්චයා ජාතීති ඉච්චස්ස වචනීයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි ඉදප්පච්චයා භවො’ති ඉති පුට්ඨෙන සතා ආනන්ද, අත්ථීති’ස්ස වචනීයං. කිම්පච්චයා භවො’ති ඉති චෙ වදෙය්ය, උපාදානපච්චයා භවො’ති ඉච්චස්ස වචනීයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි ඉදප්පච්චයා උපාදානන්ති ඉති පුට්ඨෙන සතා ආනන්ද, අත්ථීති’ස්ස වචනීයං. කිම්පච්චයා උපාදානන්ති ඉති චෙ වදෙය්ය, තණ්හාපච්චයා උපාදානන්ති ඉච්චස්ස වචනීයං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කම්මාසධම්මං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ගුළාගුණ්ඪිකජාත - සීමු, ගුලගණ්ඩිකජාතා - දි. අට්ඨකථා, \nකුලගණ්ඪිකජාතා, ගුණගණ්ඪිකජාතා - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. මුඤ්ජපබ්බජභූතා - මඡසං, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "2.",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "මහානිදාන සූත්‍රය",
                        "level": 3
                    },
                    {
                        "format": 13,
                        "text": "1. මා විසින් මෙසේ අසන ලදි: එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ **කුරු** රටැ කුරු දනවු වැස්සන්ගේ **කල්මාෂදම්‍ය** නම් යම් නියම් ගමෙක් වී ද, එහි වැඩ වසන සේක. එ කල්හි ආයුෂ්මත් **අනඳ** තෙරණුවෝ භාග්‍යවතුන් වහන්සේ කරා එළැඹියහ. එළැඹ භාග්‍යවතුන් වහන්සේ වැඳ එක් පසෙක හිඳ ගත්හ. එක්පසෙක හුන් ආයුෂ්මත් අනඳ තෙරණුවෝ “වහන්ස, මේ ප්‍රතීත්‍යසමුපත්පාදය කොතරම් ගැඹුරු ද, කොතරම් ගැඹුරු පෙනුම් ඇත්තේ ද යනු ආශ්චර්‍ය්‍ය ය, අද්භූත ය. එතෙකුදු වුවත් මට එය ප්‍රකට වූවක් මෙන්, ඉතා ප්‍රකට වූවක් මෙන් වැටහේ යැ” යි කීහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "2. ආනන්දය, එසේ නො කිය. ආනන්දය එසේ නො කිය. ආනන්දය, මේ ප්‍රතීත්‍යසමුත්පාදය ගැඹුරු ද වේ, ගැඹුරු පෙනුම් ඇත්තේ ද වේ. ආනන්දය, මේ ධර්මය අනුබෝධ නො කිරීමෙන්, ප්‍රතිවේධ නො කිරීමෙන්, මෙසේ මේ සත්ත්වප්‍රජාව (පෙහෙර) හූකැටියක් මෙන් අවුල් වූවා, කැඳ ලූ පෙහෙර හූ මෙන් ගැට ගැසුණී නොහොත් කිරිලි කසල්ලක් බඳු වූවා, මුදුතණ බබුස් තණ සේ අවුල් වූවා සැපයෙන් පහ වූ, නපුරු ගති ඇති, විවශ ව පතිත වීම් ඇති අපාය ද සසර ද ඉක්ම නො යෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "3. ආනන්දය, ‘මේ යම් ප්‍රත්‍යයයෙකින් ජරාමරණ වේ නම්, එසේ වූ ප්‍රත්‍යයයෙක් ඇත් දැ?’ යි විචාරන ලද්දාහු විසින් ‘ඇතැ’ යි ඔහුට කිය යුතු. ‘කිමෙක ප්‍රත්‍යයයෙන් ජරාමරණ වේ දැ’ යි මෙසේ විචාරන්නේ නම් ‘ජාතිප්‍රත්‍යයයෙන් ජරාමරණ වේ යැ’ යි මෙසේ ඔහුට කිය යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආනන්දය, ‘මේ යම් ප්‍රත්‍යයයෙකින් ජාතිය (ඉපැත් ම)වේ නම්, එසේ වූ ප්‍රත්‍යයයෙක් ඇත් දැ?’ යි විචාරන ලද්දාහු විසින් ‘ඇතැ’ යි ඔහුට කිය යුතු. ‘කිමෙක ප්‍රත්‍යයයෙන් ජාතිය වේ දැ’ යි මෙසේ විචාරන්නේ නම් ‘භවප්‍රත්‍යයයෙන් ජාතිය වේ යැ’ යි මෙසේ ඔහුට කිය යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආනන්දය, ‘මේ යම් ප්‍රත්‍යයයෙකින් භවය වේ නම්, එසේ වූ ප්‍රත්‍යයයෙක් ඇත් දැ?’ යි විචාරන ලද්දාහු විසින් ‘ඇතැ’ යි ඔහුට කිය යුතු. ‘කිමෙක ප්‍රත්‍යයයෙන් භවය වේ දැ’ යි මෙසේ විචාරන්නේ නම් ‘උපාදානප්‍රත්‍යයයෙන් භවය වේ යැ’ යි මෙසේ ඔහුට කිය යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආනන්දය, ‘මේ යම් ප්‍රත්‍යයයෙකින් උපාදනය වේ නම්, එබඳු ප්‍රත්‍යයයෙක් ඇත් දැ?’ යි විචාරන ලද්දාහු විසින් ‘ඇතැ’ යි ඔහුට කිය යුතු. ‘කිමෙක ප්‍රත්‍යයයෙන් උපාදානය වේ දැ’ යි මෙසේ විචාරන්නේ නම් ‘තෘෂ්ණාප්‍රත්‍යයයෙන් උපාදානය වේ යැ’ යි මෙසේ ඔහුට කිය යුතු.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 82,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අත්ථි ඉදප්පච්චයා තණ්හා’ති ඉති පුට්ඨෙන සතා ආනන්ද, අත්ථීති’ස්ස වචනීයං. කිම්පච්චයා තණ්හා’ති ඉති චෙ වදෙය්ය, වෙදනාපච්චයා තණ්හා’ති ඉච්චස්ස වචනීයං,"
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි ඉදප්පච්චයා වෙදනා’ති ඉති පුට්ඨෙන සතා ආනන්ද, අත්ථීති’ස්ස වචනීයං. කිම්පච්චයා වෙදනා’ති ඉති චෙ වදෙය්ය, ඵස්සපච්චයා වෙදනා’ති ඉච්චස්ස වචනීයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි ඉදප්පච්චයා ඵස්සො’ති ඉති පුට්ඨෙන සතා ආනන්ද, අත්ථීති’ස්ස වචනීයං. කිම්පච්චයා ඵස්සො’ති ඉති චෙ වදෙය්ය, නාමරූපපච්චයා ඵස්සො’ති ඉච්චස්ස වචනීයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි ඉදප්පච්චයා නාමරූපන්ති ඉති පුට්ඨෙන සතා ආනන්ද, අත්ථීති’ස්ස වචනීයං. කිම්පච්චයා නාමරූපන්ති ඉති චෙ වදෙය්ය, විඤ්ඤාණපච්චයා නාමරූපන්ති ඉච්චස්ස වචනීයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි ඉදප්පච්චයා විඤ්ඤාණන්ති ඉති පුට්ඨෙන සතා ආනන්ද, අත්ථීති’ස්ස වචනීයං. කිම්පච්චයා විඤ්ඤාණන්ති ඉති චෙ වදෙය්ය, නාමරූපපච්චයා විඤ්ඤාණන්ති ඉච්චස්ස වචනීයං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉති ඛො ආනන්ද, නාමරූපපච්චයා විඤ්ඤාණං, විඤ්ඤාණපච්චයා නාමරූපං, නාමරූපපච්චයා ඵස්සො, ඵස්සපච්චයා වෙදනා, වෙදනාපච්චයා තණ්හා, තණ්හාපච්චයා උපාදානං, උපාදානපච්චයා භවො, භවපච්චයා ජාති, ජාතිපච්චයා ජරාමරණං සොකපරිදෙවදුක්ඛදොමනස්සුපායාසා සම්භවන්ති. එවමෙතස්ස කෙවලස්ස දුක්ඛක්ඛන්ධස්ස සමුදයො හොති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "4. “ජාතිපච්චයා ජරාමරණන්ති ඉති ඛො පනෙතං වුත්තං. තදානන්ද, ඉමිනාපෙතං පරියායෙන වෙදිතබ්බං යථා ජාතිපච්චයා ජරාමරණං: ජාති ච හි ආනන්ද, නාභවිස්ස සබ්බෙන සබ්බං සබ්බථා සබ්බං කස්සචි කිම්හිචි, සෙය්යථිදං: දෙවානං වා දෙවත්තාය, ගන්ධබ්බානං වා ගන්ධබ්බත්තාය, යක්ඛානං වා යක්ඛත්තාය, භූතානං වා භූතත්තාය, මනුස්සානං වා මනුස්සත්තාය, චතුප්පදානං වා චතුප්පදත්තාය. පක්ඛීනං වා පක්ඛීත්තාය, සිරිංසපානං වා සිරිංසපත්තාය{1}, තෙසං තෙසඤ්ච ආනන්ද, සත්තානං තථත්තාය{2} ජාති නාභවිස්ස, සබ්බසො ජාතියා අසති ජාතිනිරොධා අපි නු ඛො ජරාමරණං පඤ්ඤායෙථා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තස්මාතිහානන්ද, එසෙව හෙතු එතං නිදානං එස සමුදයො එස පච්චයො ජරාමරණස්ස යදිදං ජාති”."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සරීසපානං වා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. තදත්තාය - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ආනන්දය, ‘මේ යම් ප්‍රත්‍යයයෙකින් තෘෂ්ණාව වේ නම්, එසේ වූ ප්‍රත්‍යයයෙක් ඇත් දැ?’ යි මෙසේ විචාරන ලද්දාහු විසින් ‘ඇතැ’ යි ඔහුට කිය යුතු. ‘කිමෙක ප්‍රත්‍යයයෙන් තෘෂ්ණාව වේ දැ’ යි මෙසේ විචාරන්නේ නම් ‘වේදනාප්‍රත්‍යයයෙන් තෘෂ්ණාව වේ යැ’ යි මෙසේ ඔහුට කිය යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආනන්දය, ‘මේ යම් ප්‍රත්‍යයයෙකින් වේදනාව වේ නම්, එබඳු වූ ප්‍රත්‍යයයෙක් ඇත් දැ?’ යි මෙසේ විචාරන ලද්දාහු විසින් ‘ඇතැ’ යි ඔහුට කිය යුතු. ‘කිමෙක ප්‍රත්‍යයයෙන් වේදනාව වේ දැ’ යි මෙසේ විචාරන්නේ නම් ‘ස්පර්ශප්‍රත්‍යයයෙන් වේදනාව වේ යැ’ යි මෙසේ ඔහුට කිය යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආනන්දය, ‘මේ යම් ප්‍රත්‍යයයෙකින් ස්පර්ශය වේ නම්, එසේ වූ ප්‍රත්‍යයයෙක් ඇත් දැ?’ යි මෙසේ විචාරන ලද්දාහු විසින් ‘ඇතැ’ යි ඔහුට කිය යුතු. ‘කිමෙක ප්‍රත්‍යයයෙන් ස්පර්ශ්‍ය වේ දැ’ යි මෙසේ විචාරන්නේ නම් ‘නාමරූපප්‍රත්‍යයයෙන් සපර්ෂය වේ යැ’ යි මෙසේ ඔහුට කිය යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආනන්දය, ‘මේ යම් ප්‍රත්‍යයයෙකින් නාමරූප වේ නම්, එසේ වූ ප්‍රත්‍යයයෙක් ඇත් දැ?’ යි මෙසේ විචාරන ලද්දාහු විසින් ‘ඇතැ’ යි ඔහුට කිය යුතු. ‘කිමෙක ප්‍රත්‍යයයෙන් නාමරූප වේ දැ’ යි මෙසේ විචාරන්නේ නම් ‘විඥානප්‍රත්‍යයයෙන් නාමරූප වේ යැ’ යි මෙසේ ඔහුට කිය යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආනන්දය, ‘මේ යම් ප්‍රත්‍යයයෙකින් විඥානය වේ නම්, එසේ වූ ප්‍රත්‍යයයෙක් ඇත් දැ?’ යි විචාරන ලද්දාහු විසින් ‘ඇතැ’ යි ඔහුට කිය යුතු. ‘කිමෙක ප්‍රත්‍යයයෙන් විඥානය වේ දැ’ යි මෙසේ විචාරන්නේ නම් ‘නාමරූපප්‍රත්‍යයයෙන් විඥානය වේ යැ’ යි මෙසේ ඔහුට කිය යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආනන්දය, මෙසේ නාමරූපප්‍රත්‍යයයෙන් විඥාණය වේ. විඥාණප්‍රත්‍යයයෙන් නාමරූප වේ. නාමරූප ප්‍රත්‍යයයෙන් ස්පර්ශය වේ. ස්පර්ශ ප්‍රත්‍යයයෙන් වේදනාව වේ. වේදනාප්‍රත්‍යයයෙන් තෘෂ්ණාව වේ. තෘෂ්ණාප්‍රත්‍යයයෙන් උපාදානය වේ. උපාදානප්‍රත්‍යයයෙන් භවය වේ. භවප්‍රත්‍යයයෙන් ජාතිය වේ. ජාතිප්‍රත්‍යයයෙන් ජරාමරණ, ශෝක පරිදේව දුක් දොම්නස් උපායාස යන මොහු පහළ වෙත්. මෙසේ මේ සියලු දුක්රැසේ ඉපැත් ම වේ.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "4. “ආනන්දය, ‘ජාතිප්‍රත්‍යයයෙන් ජරාමරණ වේ’ යැ යි මෙසේ ම මෙය කියන ලදි. ආනන්දය, යම්සේ ජාතිප්‍රත්‍යයයෙන් ජරාමරණ වේද, මෙය මේ කරුණිනුත් දත යුතු: ආනන්දය, හැම අයුරින් ම හැම ලෙසින් ම ජාතිය කිසිවකුට කිසිදු තැනෙක නොවී නම්, විභාග විසින් - දෙවියන්ගේ දෙව්බව පිණිස හෝ ගඳෙව්වන්ගේ ගඳෙව්බව පිණිස හෝ යකුන්ගේ යක්බව පිණිස හෝ උපන් කවර හෝ සතුන්ගේ ඒ ලත් අත්බව පිණිස හෝ මිනිසුන්ගේ මිනිස්බව පිණිස හෝ සිවුපාවුන්ගේ සිවුපාබව පිණිස හෝ පක්ෂීන්ගේ පක්ෂී බව පිණිස හෝ සරීසෘපයන්ගේ (බඩ ගා යන සතුන්ගේ)සරීසෘප බව පිණිස හෝ ඒ ඒ සතුන්ගේ එසේ වීම පිණිස ජාතිය නො වී නම්, සර්වප්‍රකාරයෙන් ම ජාතිය නැති කල්හි ජාතියගේ නිරෝධයෙන් (අභාවයෙන්) ජරාමරණය පැනෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො ම වන්නේ යැ” යි අනඳ තෙරණුවෝ වදාළහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“එහෙයින් ආනන්දය, යම් මේ ජාතියෙක් වේ ද, ජරාමරණයට මෙය ම හේතු ය, මෙය ම නිදාන ය, මෙය ම සමුදය ය, මෙය ම ප්‍රත්‍යය ය.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 84,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "5. “භවපච්චයා ජාතීති ඉති ඛො පනෙතං වුත්තං. තදානන්ද, ඉමිනාපෙතං පරියායෙන වෙදිතබ්බං යථා භවපච්චයා ජාති: භවො ච හි ආනන්ද, නාභවිස්ස සබ්බෙන සබ්බං සබ්බථා සබ්බං කස්සචි කිම්හිචි, සෙය්යථිදං: කාමභවො රූපභවො අරූපභවො, සබ්බසො භවෙ අසති භවනිරොධා අපි නු ඛො ජාති පඤ්ඤායෙථා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තස්මාතිහානන්ද, එසෙව හෙතු එතං නිදානං එස සමුදයො එස පච්චයො ජාතියා යදිදං භවො”."
                    },
                    {
                        "type": "paragraph",
                        "text": "6. “උපාදානපච්චයා භවො’ති ඉති ඛො පනෙතං වුත්තං. තදානන්ද, ඉමිනාපෙතං පරියායෙන වෙදිතබ්බං යථා උපාදානපච්චයා භවො: උපාදානං ච හි ආනන්ද, නාභවිස්ස සබ්බෙන සබ්බං සබ්බථා සබ්බං කස්සචි කිම්හිචි, සෙය්යථිදං: කාමූපාදානං වා දිට්ඨූපාදානං වා සීලබ්බතූපාදානං වා අත්තවාදූපාදානං වා, සබ්බසො උපාදානෙ අසති උපාදානනිරොධා අපි නු ඛො භවො පඤ්ඤායෙථා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තස්මාතිහානන්ද, එසෙව හෙතු එතං නිදානං එස සමුදයො එස පච්චයො භවස්ස යදිදං උපාදානං”."
                    },
                    {
                        "type": "paragraph",
                        "text": "7. තණ්හාපච්චයා උපාදානන්ති ඉති ඛො පනෙතං වුත්තං. තදානන්ද, ඉමිනාපෙතං පරියායෙන වෙදිතබ්බං යථා තණ්හාපච්චයා උපාදානං: තණ්හා ච හි ආනන්ද, නාභවිස්ස සබ්බෙන සබ්බං සබ්බථා සබ්බං කස්සචි කිම්හිචි, සෙය්යථිදං: රූපතණ්හා සද්දතණ්හා ගන්ධතණ්හා රසතණ්හා ඵොට්ඨබ්බතණ්හා ධම්මතණ්හා, සබ්බසො තණ්හාය අසති තණ්හානිරොධා අපි නු ඛො උපාදානං පඤ්ඤායෙථා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තස්මාතිහානන්ද, එසෙව හෙතු එතං නිදානං එස සමුදයො එස පච්චයො උපාදානස්ස යදිදං තණ්හා”."
                    },
                    {
                        "type": "paragraph",
                        "text": "8. “වෙදනාපච්චයා තණ්හා’ති ඉති ඛො පනෙතං වුත්තං. තදානන්ද, ඉමිනා පෙතං පරියායෙන වෙදිතබ්බං යථා වෙදනාපච්චයා තණ්හා: වෙදනා ච හි ආනන්ද, නාභවිස්ස සබ්බෙන සබ්බං සබ්බථා සබ්බං කස්සචි කිම්හිචි, සෙය්යථිදං: චක්ඛුසම්ඵස්සජා වෙදනා සොතසම්ඵස්සජා වෙදනා ඝානසම්ඵස්සජා වෙදනා __ජිව්හාසම්ඵස්සජා වෙදනා__ කායසම්ඵස්සජා වෙදනා මනොසම්ඵස්සජා වෙදනා, සබ්බසො වෙදනාය අසති වෙදනානිරොධා අපි නු ඛො තණ්හා පඤ්ඤායෙථා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තස්මාතිහානන්ද, එසෙව හෙතු එතං නිදානං එස සමුදයො එස පච්චයො තණ්හාය යදිදං වෙදනා”."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "5. “භවප්‍රත්‍යයයෙන් ජාතිය වේ යැ යි මෙසේ ම මෙය කියන ලදි. ආනන්දය, යම්සේ භවප්‍රත්‍යයයෙන් ජාතිය වේ ද, එය මේ කරුණින් ද දත යුතු: ආනන්දය, කිසිවෙකුට කිසිදු තැනෙක හැම අයුරින් ම හැම ලෙසින් ම කාමභව, රූපභව, අරූපභව යන භවයෙක් නො වී නම්, හැම අයුරින් ම භව නැති කල්හි භවනිරෝධයෙන් ජාතියෙක් පැනෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො ම වන්නේ යැ” යි අනඳ තෙරණුවෝ වදාළහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, එහෙයින් යම් මේ භවයෙක් වේ ද, මෙය ම ජාතියට හේතු ය, මෙය ම ජාතියට නිදාන ය, මෙය ම ජාතියගේ සමුදය ය, මෙය ම ජාතියට ප්‍රත්‍යය ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "6. “උපාදාන ප්‍රත්‍යයයෙන් භවය වේ යැ යි මෙසේ ම මෙය කියන ලදි. ආනන්දය, උපාදානප්‍රත්‍යයයෙන් යම්සේ භවය වේ ද, එය මේ කරුණින් ද දත යුතු: ආනන්දය, කාමොපාදානය ද දෘෂ්ට්‍යුපාදාන ද ශීලව්‍රතෝපාදාන ද ආත්මවාදෝපදාන ද යන මේ උපාදානයෙක් හැම අයුරින් ම හැම ලෙසින් ම කිසිවක්හට කිසිදු තැනෙක නො වී නම්, හැම අයුරින් ම උපාදානයක් නැති කල්හි උපාදානනිරෝධයෙන් භවයෙක් පැනෙන්නේ ද”?",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො වේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, එහෙයින් යම් මේ උපාදානයෙක් වේද, මෙය ම භවයට හේතු ය, මෙය ම නිදානය ය, මෙය ම සමුදය ය, මෙය ම ප්‍රත්‍යය ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "7. “තෘෂ්ණාප්‍රත්‍යයයෙන් උපාදාන වේ යැ යි මෙසේ ම මෙය කියන ලදි. ආනන්දය, යම්සේ තෘෂ්ණාප්‍රත්‍යයයෙන් උපාදානය වේ ද, එය මේ කරුණිනුදු දත යුතු: ආනන්දය, රූපතෘෂ්ණා ශබ්දතෘෂ්ණා ගන්ධතෘෂ්ණා රසතෘෂ්ණා සප්‍රෂ්ටව්‍යතෘෂ්ණා යන මේ යම් තෘෂ්ණාවෙක් කිසිවක්හු පිළිබඳ ව කිසිදු තැනෙක හැම අයුරින් ම හැම ලෙසින් ම නො වී නම්, සර්වප්‍රකාරයෙන් ම තෘෂ්ණාව නැති කල්හි තෘෂ්ණාවගේ නිරෝධයෙන් උපාදානයෙක් පැනෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො වන්නේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, එහෙයින් තෘෂ්ණාසංඛ්‍යාත මෙය ම උපාදානයාගේ හේතු ය, මෙය ම නිදානය ය, මෙය ම සමුදය ය, මෙය ම තෘෂ්ණාවගේ ප්‍රත්‍යය ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "8. “වේදනාප්‍රත්‍යයයෙන් තෘෂ්ණාව වේ යැ යි මෙසේ ම මෙය කියන ලදි. ආනන්දය, යම්සේ වේදනාප්‍රත්‍යයයෙන් තෘෂ්ණාව වේ ද, එය මේ කරුණිනුත් දය යුතු: ආනන්දය, චක්ඛුසම්ඵස්සජ වේදනා ය, සෝතසම්ඵස්සජ වේදනා ය, ඝාණසම්ඵස්සජ වේදනා ය, ජිව්හාසම්ඵස්සජ වේදනා ය, කායසම්ඵස්සජ වේදනා ය, මනෝසම්ඵස්සජ වේදනා ය, යන මේ යම් වේදනාවෙක් කිසිවක්හට කිසිදු තැනෙක සියළු අයුරින් ම සියලු ලෙසින් ම නො වී නම්, හැම අයුරින් ම වේදනා නැති කල්හි වේදනා නිරෝධයෙන් තෘෂ්ණාව පැනෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො වන්නේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, එහෙයින් වේදනා යන මෙය ම තෘෂ්ණාවට හේතු වේ, මෙය ම නිදානය වේ, මෙය ම සමුදය වේ, මෙය ම ප්‍රත්‍යයය වේ.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 86,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "9. ඉති ඛො පනෙතං ආනන්ද, වෙදනං පටිච්ච තණ්හා, තණ්හං පටිච්ච පරියෙසනා, පරියෙසනං පටිච්ච ලාභො, ලාභං පටිච්ච විනිච්ඡයො, විනිච්ඡයං පටිච්ච ඡන්දරාගො, ඡන්දරාගං පටිච්ච අජ්ඣොසානං, අජ්ඣොසානං පටිච්ච පරිග්ගහො, පරිග්ගහං පටිච්ච මච්ඡරියං, මච්ඡරියං පටිච්ච ආරක්ඛො, ආරක්ඛාධිකරණං{1} පටිච්ච දණ්ඩාදාන-සත්ථාදාන-කලහ-විග්ගහ-විවාද-තුවන්තුවං-පෙසුඤ්ඤ-මුසාවාදා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "10. ආරක්ඛාධිකරණං දණ්ඩාදාන-සත්ථාදාන-කලහ-විග්ගහ-විවාද-තුවන්තුවං-පෙසුඤ්ඤ-මුසාවාදා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්තීති ඉති ඛො පනෙතං වුත්තං. තදානන්ද, ඉමිනාපෙතං පරියායෙන වෙදිතබ්බං යථා ආරක්ඛාධිකරණං දණ්ඩාදාන-සත්ථාදාන-කලහ-විග්ගහ-විවාද-තුවන්තුවං-පෙසිඤ්ඤ-මුසාවාදා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවන්ති: ආරක්ඛො ච හි ආනන්ද, නාභවිස්ස සබ්බෙන සබ්බං සබ්බථා සබ්බං කස්සචි කිම්හිචි, සබ්බසො ආරක්ඛෙ අසති ආරක්ඛනිරොධා අපි නු ඛො දණ්ඩාදාන-සත්ථාදාන-කලහ-විග්ගහ-විවාද-තුවන්තුවං-පෙසුඤ්ඤ-මුසාවාදා අනෙකෙ පාපකා අකුසලා ධම්මා සම්භවෙය්යුන්ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්මාතිහානන්ද, එසෙව හෙතු එතං නිදානං එස සමුදයො එස පච්චයො දණ්ඩාදාන-සත්ථාදාන-කලහ-විග්ගහ-විවාද-තුවන්තුවං-පෙසුඤ්ඤ-මුසාවාදානං අනෙකෙසං පාපකානං අකුසලානං ධම්මානං සම්භවාය යදිදං ආරක්ඛො."
                    },
                    {
                        "type": "paragraph",
                        "text": "11. මච්ඡරියං පටිච්ච ආරක්ඛො’ති ඉති ඛො පනෙතං වුත්තං. තදානන්ද, ඉමිනාපෙතං පරියායෙන වෙදිතබ්බං යථා මච්ඡරියං පටිච්ච ආරක්ඛො: මච්ඡරියං ච හි ආනන්ද, නාභවිස්ස සබ්බෙන සබ්බං සබ්බථා සබ්බං කස්සචි කිම්හිචි, සබ්බසො මච්ඡරියෙ අසති මච්ඡරියනිරොධා අපි නු ඛො ආරක්ඛො පඤ්ඤායෙථාති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්මාතිහානන්ද, එසෙව හෙතු එතං නිදානං එස සමුදයො එස පච්චයො ආරක්ඛස්ස යදිදං මච්ඡරියං."
                    },
                    {
                        "type": "paragraph",
                        "text": "12. පරිග්ගහං පටිච්ච මච්ඡරියන්ති ඉති ඛො පනෙතං වුත්තං. තදානන්ද, ඉමිනාපෙතං පරියායෙන වෙදිතබ්බං යථා පරිග්ගහං පටිච්ච මච්ඡරියං: පරිග්ගහො ච හි ආනන්ද, නාභවිස්ස සබ්බෙන සබ්බං සබ්බථා සබ්බං කස්සචි කිම්හිචි, සබ්බසො පරිග්ගහෙ අසති පරිග්ගහනිරොධා අපි නු ඛො මච්ඡරියං පඤ්ඤායෙථාති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්මාතිහානන්ද, එසෙව හෙතු එතං නිදානං එස සමුදයො එස පච්ච__යො__ මච්ඡරියස්ස යදිදං පරිග්ගහො."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ආරක්ඛං පටිච්ච ආරක්ඛාධීකරණං - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "9. “ආනන්දය, මෙසේ මේ වේදනාව නිසා තෘෂ්ණාව වේ. තෘෂ්ණාව නිසා පර්යේෂණය (අරමුණු සෙවීම) වේ. පර්යේෂණය නිසා ලාභය (අරමුණු ලැබීම) වේ. ලාභය නිසා විතර්කවිනිශ්චය (අරමුණෙහි ඉටු අනිටු බව විතර්කයෙන් නිශ්චය කොට ගැන් ම) වේ. විනිශ්චය නිසා ඡන්දරාගය (විතර්කිත වස්තුව කෙරෙහි ඇල්ම) වේ. ඡන්දරාගය නිසා අධ්‍යවසානය (මම ය, මගේ යැ යි බලවත් සනිටුහන) වේ. අධ්‍යවසානය නිසා පරිග්‍රහය (තෘෂ්ණා දෘෂ්ඨි විසින් මගේ යැ යි අයත් කරැ ගැන්ම) වේ. පරිග්‍රහය නිසා මසුරුබව වේ. මසුරුබව නිසා රැක්ම වේ. රැක්ම කරණකොට ගෙන දඬුමුගුරු දැරුම්, අවි දැරුම්, විග්‍රහ (විරෝධ පෑම්) විවාද, තුවංතුව වාද (ඇනුම් බැණුම්), මුසාබිණුම්, නෙයෙක් ලාමක අකුසල්දහම්හු පහළ වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "10. “රකවළ කරන කරුණෙන් දඬුමුගුරු දැරුම් අවි දැරුම් කලහ විග්‍රහ විවාද තුවන්තුවංවාද කේලාම් මුසාබස්, නොයෙක් අකුසල් දහම්හු පහළ වෙති යි මෙය මෙසේ ම කියන ලද්දේ ය. ආනන්දය, රකවළ කරන කරුණින් දඬුමුගුරු දැරුම් අවිදැරුම් කලහ විග්‍රහ විවාද තුවන්තුවංවාද කේලාම් මුසාමිණුම්, නොයෙක් අකුසල් දහම්හු යම්සේ පහළ වෙත් ද, එය මේ කරුණෙන් ද දත යුතු: ආනන්දය, කිසිවක්හුගෙත් කිසි තැනෙක්හිත් හැම අයුරින් ම හැම ලෙසින් ම රකවළෙක් නො වී නම්, හැම අයුරින් රකවළක් නැති කල්හි, රකවළ නැති බැවින් දඬුමුගුරු දැරුම් අවිදැරුම් කලහ විග්‍රහ විවාද තුවන්තුවංවාද කේලාම් මුසාබිණුම්, නොයෙක් අකුසල් දහම්හු පහළ වන්නාහු ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො වන්නේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, එහෙයින් දඬුමුගුරු දැරුම් අවිදැරුම් කලහ විග්‍රහ විවාද තුවන්තුවංවාද කේලාම් මුසා බිණුම් යන මොවුන්ගේ, නොයෙක් අකුසල් දහමුන්ගේ හට ගැන්මට වස්තුව රැක ගැන්ම යන මෙය ම හේතු ය. මෙය ම නිදානය, මෙය ම සමුදය ය, මෙය ම ප්‍රත්‍යය ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "11. “මසුරුබව නිසා රැක ගැන්ම වේ යැ යි මෙසේ මෙය කියන ලද්දේ ම ය. ආනන්දය, මසුරුබව නිසා රැක ගැන්ම යම්සේ වේ ද, එය මේ කරුණිනුදු දත යුතු: ආනන්දය, කිසිවක්හුගේ කිසි තැනෙක හැම අයුරින් හැම ලෙසින් මසුරු බවෙක් නො වී නම්, හැම අයුරින් ම මසුරු බව නැති කල්හි, මසුරු බව නැති වීමෙන් වස්තු රැක ගැන්මෙක් පැණෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො වන්නේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, එහෙයින් මසුරුබවය යන මෙය ම වස්තුව රැක ගැන්මට හේතු ය, මෙය ම නිදානය ය, මෙය ම සමුදය ය, මෙය ම ප්‍රත්‍යය ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "12. “පරිග්‍රහය (අයත් කොට ගැනීම) නිසා මසුරුබව වේ යැ යි මෙසේ මෙය කියන ලද්දේ ම ය. ආනන්දය, පරිග්‍රහය නිසා මසුරුබව යම්සේ වේ ද, එය මේ අයුරින් ද දත යුතු: ආනන්දය කිසිවක්හුගේ කිසි තැනෙකත් හැම අයුරින් හැම ලෙසින් ම පරිග්‍රහයෙක් නො වී නම්, හැම අයුරින් ම පරිග්‍රහයෙක් නැති කල්හි, පරිග්‍රහනිරෝධයෙන් මසුරුබවෙක් පැණෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො වන්නේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, එහෙයින් මසුරුබවට පරිග්‍රහය යන මෙය නිදානය, මෙය ම සමුදය ය, මෙය ම ප්‍රත්‍යය ය.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 88,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "13. “අජ්ඣොසානං පටිච්ච පරිග්ගහො’ති ඉති ඛො පනෙතං වුත්තං. තදානන්ද, ඉමිනාපෙතං පරියායෙන වෙදිතබ්බං යථා අජ්ඣොසානං පටිච්ච පරිග්ගහො: අජ්ඣොසානං ච හි ආනන්ද, නාභවිස්ස සබ්බෙන සබ්බං සබ්බථා සබ්බං කස්සචි කිම්හිචි, සබ්බසො අජ්ඣොසානෙ අසති අජ්ඣොසාන නිරොධා අපි නු ඛො පරිග්ගහො පඤ්ඤායෙථා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තස්මාතිහානන්ද, එසෙව හෙතු එතං නිදානං එස සමුදයො එස පච්චයො පරිග්ගහස්ස යදිදං අජ්ඣොසානං”."
                    },
                    {
                        "type": "paragraph",
                        "text": "14. “ඡන්දරාගං පටිච්ච අජ්ඣොසානන්ති ඉති ඛො පනෙතං වුත්තං. තදානන්ද, ඉමිනාපෙතං පරියායෙන වෙදිතබ්බං යථා ඡන්දරාගං පටිච්ච අජ්ඣොසානං: ඡන්දරාගො ච හි ආනන්ද, නාභවිස්ස සබ්බෙන ස__බ්බං__ සබ්බථා සබ්බං කස්සචි කිම්හිචි, සබ්බසො ඡන්දරාගෙ අසති ඡන්දරාගනිරොධා අපි නු ඛො අජ්ඣොසානං පඤ්ඤායෙථා?ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තස්මාතිහානන්ද, එසෙව හෙතු එතං නිදානං එස සමුදයො එස පච්චයො අජ්ඣොසානස්ස යදිදං ඡන්දරාගො”."
                    },
                    {
                        "type": "paragraph",
                        "text": "15. “විනිච්ඡයං පටිච්ච ඡන්දරාගො’ති ඉති ඛො පනෙතං වුත්තං. තදානන්ද, ඉමිනාපෙතං පරියායෙන වෙදිතබ්බං යථා විනිච්ඡයං පටිච්ච ඡන්දරාගො: විනිච්ඡයො ච හි ආනන්ද, නාභවිස්ස සබ්බෙන සබ්බං සබ්බථා සබ්බං කස්සචි කිම්හිචි, සබ්බසො විනිච්ඡයෙ අසති විනිච්ඡයනිරොධා අපි නු ඛො ඡන්දරාගො පඤ්ඤායෙථා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තස්මාතිහානන්ද, එසෙව හෙතු එතං නිදානං එස සමුදයො එස පච්චයො ඡන්දරාගස්ස යදිදං විනිච්ඡයො”."
                    },
                    {
                        "type": "paragraph",
                        "text": "16. “ලාභං පටිච්ච විනිච්ඡයො’ති ඉති ඛො පනෙතං වුත්තං. තදානන්ද, ඉමිනාපෙතං පරියායෙන වෙදිතබ්බං යථා ලාභං පටිච්ච විනිච්ඡයො: ලාභො ච හි ආනන්ද, නාභවිස්ස සබ්බෙන සබ්බං සබ්බථා ස__බ්බං__ කස්සචි කිම්හිචි, සබ්බසො ලාභෙ අසති ලාභනිරොධා අපි නු ඛො විනිච්ඡයො පඤ්ඤායෙථා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තස්මාතිහානන්ද, එසෙව හෙතු එතං නිදානං එස සමුදයො එස පච්චයො විනිච්ඡයස්ස යදිදං ලාභො”."
                    },
                    {
                        "type": "paragraph",
                        "text": "17. “පරියෙසනං පටිච්ච ලාභො’ති ඉති ඛො පනෙතං වුත්තං. තදානන්ද, ඉමිනාපෙතං පරියායෙන වෙදිතබ්බං යථා පරියෙසනං පටිච්ච ලාභො: පරියෙසනා ච හි ආනන්ද, නාභවිස්ස සබ්බෙන සබ්බං සබ්බථා සබ්බං කස්සචි කිම්හිචි, සබ්බසො පරියෙසනාය අසති පරියෙසනානිරොධා අපි නු ඛො ලාභො පඤ්ඤායෙථා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තස්මාතිහානන්ද, එසෙව හෙතු එතං නිදානං එස සමුදයො එස පච්චයො ලාභස්ස යදිදං පරියෙසනා”."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "13. “අධ්‍යවසානය (මම ය, මාගේ ය යි බලවත් සේ සනිටුහන් කිරීම) නිසා වස්තුපරිග්‍රහය වේ යැ යි මෙසේ ම මෙය කියන ලද්දේ ය. ආනන්දය, අධ්‍යවසානය නිසා වස්තුපරිග්‍රහය යම්සේ වේ ද, එය මෙ කරුණෙන් ද දත යුතු: ආනන්දය, කිසිවක්හුගේ කිසි ද තැනෙක අධ්‍යවසානයෙක් හැම අයුරින් හැම ලෙසින් නො වී නම්, හැම අයුරින් අධ්‍යවසානය නැති කල්හි, අධ්‍යවසානනිරෝධයෙන් වස්තුපරිග්‍රහයෙක් පැනෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො වන්නේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, එහෙයින් අධ්‍යවසානය යන යමෙක් ඇද්ද, පරිග්‍රහහයට මෙය ම හේතු ය, මෙය ම නිදානය ය, මෙය ම සමුදය ය, මෙය ම ප්‍රත්‍යය ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "14. “ඡන්දරාගය නිසා අධ්‍යවසානය වේ යැ යි මෙසේ ම මෙය කියන ලද්දේ ය. ආනන්දය, ඡන්දරාගය නිසා අධ්‍යවසානය යම්සේ වේ ද, එය මේ කරුණින් ද දත යුතු: ආනන්දය, කිසිවක්හුගේ කිසිතැනෙක හැම අයුරින් හැම ලෙසින් ම ඡන්දරාගයෙක් නො වී නම්, හැම අයුරින් ඡන්දරාගය නැති කල්හි, ඡන්දරාගනිරෝධයෙන් අධ්‍යවසානයෙක් පැනේනේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො වන්නේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, එහෙයින් ඡන්දරාගය යන මෙය ම අධ්‍යවසානයට හේතු ය, මෙය ම නිදානය ය, මෙය ම සමුදය ය, මෙය ම ප්‍රත්‍යය ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "15. “විනිශ්චය ය නිසා ඡන්දරාගය වේ යැ යි මෙසේ ම මෙය කියන ලද්දේ ය. ආනන්දය, යම්සේ විනිශ්චය නිසා ඡන්දරාගය වේ ද, එය මේ කාරණයෙනුදු දත යුතු: ආනන්දය, කිසිවක්හුගේ කිසිතැනෙක හැම අයුරින් හැම ලෙසින් ම විනිශ්චයයෙක් නො වී නම්, හැම අයුරින් විනිශ්චයයක් නැති කල්හි, විනිශ්චයයාගේ අභාවයෙන් ඡන්දරාගයෙක් පැනෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො වන්නේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, එහෙයින් විනිශ්චය යන යමෙක් වේ නම්, මෙය ම ඡන්දරාගයට හේතුය, මෙය ම නිදානය ය, මෙය ම සමුදය ය, මෙය ම ප්‍රත්‍ය ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "16. “ලාභය නිසා විනිශ්චයය වේයැ යි මෙසේ ම මෙය කියන ලදී. ආනන්දය, ලාභය නිසා විනිශ්චය යම්සේ වේ ද, එය මේ කරුණිනුත් දත යුතු: ආනන්දය, කිසිවක්හුගේ කිසි ද තැනෙක හැම අයුරින් හැම ලෙසින් ලාභයෙක් නො වී නම්, හැම අයුරින් ලාභයෙක් නැති කල්හි, ලාභයාගේ අභාවයෙන් විනිශ්චයයෙක් පැනෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො වන්නේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“එහෙයින් ආනන්දය, යම් ලාභයෙක් ඇත් නම්, මෙය ම විනිශ්චයට හේතුය, මෙය ම නිදානය ය, මෙය ම සමුදය ය, මෙය ම ප්‍රත්‍යය ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "17. “පර්යේෂණය නිසා ලාභය වේ යැ යි මෙසේ ම මෙය කියන ලද්දේ ය. ආනන්දය, යම්සේ පර්යේෂණය නිසා ලාභය වේ ද, එය මේ කරුණිනුත් දත යුතු: ආනන්දය, කිසිවක්හුගේ කිසි ද තැනෙක හැම අයුරින් හැම ලෙසින් ම පර්යේෂණයෙක් නොවී නම්, හැම අයුරින් ම පර්යේෂණයක් නැති කලැ, පර්යේෂණයාගේ අභාවයෙන් ලාභයෙක් පැනෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො වන්නේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, එහෙයින් පර්යේෂණ නම් වූ යමෙක් ඇද්ද, ලාභයට මෙය ම හේතුය, මෙය ම නිදානය ය, මෙය ම සමුදය ය, මෙය ම ප්‍රත්‍ය ය.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 90,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "18. තණ්හං පටිච්ච පරියෙසනා’ති ඉති ඛො පනෙතං වුත්තං. තදානන්ද, ඉමිනාපෙතං පරියායෙන වෙදිතබ්බං යථා තණ්හං පටිච්ච පරියෙසනා: තණ්හා ච හි ආනන්ද, නාභවිස්ස සබ්බෙන සබ්බං සබ්බථා සබ්බං කස්සචි කි__ම්හි__චි, සෙය්යථිදං: කාමතණ්හා භවතණ්හා විභවතණ්හා, සබ්බසො තණ්හානිරොධා අපි නු ඛො පරියෙසනා පඤ්ඤායෙථා?ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තස්මාතිහානන්ද, එසෙව හෙතු එතං නිදානං එස සමුදයො එස පච්චයො පරියෙසනාය යදිදං තණ්හා."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉති ඛො ආනන්ද, ඉමෙ ද්වෙ ධම්මා ද්වයෙන වෙදනාය එකසමොසරණා භවන්ති”."
                    },
                    {
                        "type": "paragraph",
                        "text": "19. “ඵස්සපච්චයා වෙදනා’ති ඉති ඛො පනෙතං වුත්තං. තදානන්ද, ඉමිනා පෙතං පරියායෙන වෙදිතබ්බං යථා ඵස්සපච්චයා වෙදනා: ඵස්සො ච හි ආනන්ද, නාභවිස්ස සබ්බෙන සබ්බං සබ්බථා සබ්බං කස්සචි කිම්හිචි, සෙය්යථිදං: චක්ඛුසම්ඵස්සො සොතසම්ඵස්සො ඝානසම්ඵස්සො ජිව්හාසම්ඵස්සො කායසම්ඵස්සො මනොසම්ඵස්සො, සබ්බසො ඵස්සෙ අසති ඵස්සනිරොධා අපි නු ඛො වෙදනා පඤ්ඤායෙථා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තස්මාතිහානන්ද, එසෙව හෙතු එතං නිදානං එස සමුදයො එස පච්චයො වෙදනාය යදිදං ඵස්සො”."
                    },
                    {
                        "type": "paragraph",
                        "text": "20. “නාමරූපපච්චයා ඵස්සො’ති ඉති ඛො පනෙතං වුත්තං. තදානන්ද, ඉමිනාපෙතං පරියායෙන වෙදිතබ්බං යථා නාමරූපපච්චයා ඵස්සො: යෙහි ආනන්ද, ආකාරෙහි යෙහි ලිඞ්ගෙහි යෙහි නිමිත්තෙහි යෙහි උද්දෙසෙහි නාමකායස්ස පඤ්ඤත්ති හොති, තෙසු ආකාරෙසු තෙසු ලිඞ්ගෙසු තෙසු නිමිත්තෙසු තෙසු උද්දෙසෙසු අසති අපි නු ඛො රූපකායෙ අධිවචනසම්ඵස්සො පඤ්ඤායෙථාති?”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යෙහි ආනන්ද, ආකාරෙහි යෙහි ලිඞ්ගෙහි යෙහි නිමිත්තෙහි යෙහි උද්දෙසෙහි රූපකායස්ස පඤ්ඤත්ති හොති, තෙසු ආකාරෙසු තෙසු ලිඞ්ගෙසු තෙසු නිමිත්තෙසු තෙසු උද්දෙසෙසු අසති අපි නු ඛො නාමකායෙ පටිඝසම්ඵස්සො පඤ්ඤායෙථා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "18. “තෘෂ්ණාව නිසා පර්යේෂණය වේ යැ යි මෙසේ ම මෙය කියන ලදී. ආනන්දය, යම්සේ තෘෂ්ණාව නිසා පර්යේෂණය වේ ද, එය මේ කරුණිනුත් දත යුතු: ආනන්දය, කිසිවක්හුගේ කිසිවෙකත් හැම අයුරින් ම හැම ලෙසින් ම කාමතෘෂ්ණා, භවතෘෂ්ණා, විභවතෘෂ්ණා යන තෘෂ්ණා අතුරෙන් එකකුත් හැම අයුරින් හැම ලෙසින් නො වී නම්, හැම අයුරින් තෘෂ්ණාව නැති කල්හි, තෘෂ්ණාවගේ අභාවයෙන් පර්යේෂණයෙක් පැනෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො වන්නේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, එහෙයින් තෘෂ්ණාව නම් වූ යමෙක් ඇද්ද, පර්යේෂණයට මෙය ම හේතුය, මෙය ම නිදානය ය, මෙය ම සමුදය ය, මෙය ම ප්‍රත්‍ය ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, මෙසේ වට්ටමූලක තෘෂ්ණාව සමුදාචාරතණ්හාව යන මේ දෙ දහම්හු වට්ඨමූලක - සමුදාචාර වශයෙන් කොටස් දෙකෙකින් වෙදනා සඞ්ඛ්‍යාත ප්‍රත්‍යයයෙන් එක ම ප්‍රත්‍යය ඇත්තාහු වෙති. (එක ම වේදනායෙන් උපදනාහු වෙති.)”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "19. “ස්පර්ශයප්‍රත්‍යයයෙන් වේදනාව වේ’ යැ යි මෙසේ ම මෙය කියන ලදි. ආනන්දය, යම්සේ ස්පර්ශයප්‍රත්‍යයයෙන් වේදනාව වේ ද, මෙ කරුණින් ද එය දත යුතු: ආනන්දය, කිසිවක්හුගේ කිසි තැනෙකත් චක්ඛුසම්ඵස්ස, සෝතසම්ඵස්ස, ඝාණසම්ඵස්ස, ජිව්හාසම්ඵස්ස, කායසම්ඵස්ස, මනොසම්ඵස්ස යන මේ ස්පර්ශයෙක් හැම අයුරින් හැම ලෙසින් ම නො වී නම්, හැම අයුරින් ම ස්පර්ශයෙක් නැති කල්හි, ස්පර්ශයාගේ අභාවයෙන් වේදනාවෙක් පැනෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස මෙය නො වන්නේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, එහෙයින් යම් ස්පර්ශයෙක් වේ ද, වේදනාවට මෙය ම හේතු ය, මෙය ම නිදානය ය, මෙය ම සමුදය ය, මෙය ම ප්‍රත්‍යය ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "20. “නාමරූපප්‍රත්‍යයයෙන් ස්පර්ශය වේ’ යැ යි මෙසේ ම මෙය කියන ලදි. ආනන්දය, නාමරූපප්‍රත්‍යයයෙන් යම්සේ ස්පර්ශය වේ ද, එය මේ කරුණෙනුත් දත යුතු: ආනන්දය, යම් ආකාරයන්ගෙන් යම් ලිඞ්ගයන්ගෙන් සංඥාදී ප්‍රඥප්තිය යම් නිමිත්තයන්ගෙන් යම් උද්දේසයන්ගෙන් නාමධර්මසමූහයට වේදනා (පැනවීම) වේ ද, ඒ ආකාරයන් ඒ ලිංගයන් ඒ නිමිත්තයන් ඒ උද්දේසයන් නැති කල්හි, රූපකයයෙහි අධිවචනසංස්පර්ශය (නාමස්කන්ධ වස්තු කොට ගෙන මනෝද්වාරයේ ශබ්දඥානානුගත ව උපදනා මනඃසංස්පර්ශය) පැනෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස මෙය නො වන්නේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, යම් ආකාරයන්ගෙන් යම් ලිඞ්ග - නිමිත්ත - උද්දේසයන්ගෙන් රූපකායයාගේ පැණවීම වේ නම්, ඒ ආකාර - ලිංග - නිමිත්ත - උද්දේසයන් නැති කල්හි නාමකායයෙහි ප්‍රතිඝසංස්පර්ශය (රූපස්කන්ධය වාස්තු කොට පස්දොරෙහි උපදනා ස්පර්ශය) පැනෙන්නේ ද?.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො වන්නේ ම ය.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 92,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“යෙහි ආනන්ද, ආකාරෙහි යෙහි ලිඞ්ගෙහි යෙහි නිමිත්තෙහි යෙහි උද්දෙසෙහි නාමකායස්ස ච රූපකායස්ස ච පඤ්ඤත්ති හොති, තෙසු ආකාරෙසු තෙසු ලිඞ්ගෙසු තෙසු නිමිත්තෙසු තෙසු උද්දෙසෙසු අසති අපි නු ඛො අධිවචනසම්ඵස්සො වා පටිඝසම්ඵස්සො වා පඤ්ඤායෙථා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යෙහි ආනන්ද, ආකාරෙහි යෙහි ලිඞ්ගෙහි යෙහි නිමිත්තෙහි යෙහි උද්දෙසෙහි නාමරූපස්ස පඤ්ඤත්ති හොති, තෙසු ආකාරෙසු තෙසු ලිඞ්ගෙසු තෙසු නිමිත්තෙසු තෙසු උද්දෙසෙසු අසති අපි නු ඛො ඵස්සො පඤ්ඤායෙථා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තස්මාතිහානන්ද, එසෙව හෙතු එතං නිදානං එස සමුදයො එස පච්චයො ඵස්සස්ස යදිදං නාමරූපං”."
                    },
                    {
                        "type": "paragraph",
                        "text": "21. “විඤ්ඤාණපච්චයා නාමරූපන්ති ඉති ඛො පනෙතං වුත්තං. තදානන්ද, ඉමිනාපෙතං පරියායෙන වෙදිතබ්බං යථා විඤ්ඤාණපච්චයා නාමරූපං. විඤ්ඤාණං ච හි ආනන්ද, මාතුකුච්ඡිස්මිං න ඔක්කමිස්සථ, අපි නු ඛො නාමරූපං මාතුකුච්ඡිස්මිං සමුච්චිස්සථා”ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“විඤ්ඤාණං ච හි ආනන්ද, මාතුකුච්ඡිං ඔක්කමිත්වා වොක්කමිස්සථ, අපි නු ඛො නාමරූපං ඉත්ථත්තාය අභිනිබ්බත්තිස්සථාති”?"
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“විඤ්ඤාණං ච හි ආනන්ද, දහරස්සෙව සතො වොච්ඡිජ්ජිස්සථ කුමාරකස්ස වා කුමාරිකාය වා, අපි නු ඛො නාමරූපං වුද්ධිං විරූළ්හිං වෙපුල්ලං ආපජ්ජිස්සථාති”?"
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තස්මාතිහානන්ද, එසෙව හෙතු එතං නිදානං එස සමුදයො එස පච්චයො නාමරූපස්ස යදිදං විඤ්ඤාණං”."
                    },
                    {
                        "type": "paragraph",
                        "text": "22. “නාමරූපපච්චයා විඤ්ඤාණන්ති ඉති ඛො පනෙතං වුත්තං. තදානන්ද, ඉමිනාපෙතං පරියායෙන වෙදිතබ්බං යථා නාමරූපපච්චයා විඤ්ඤාණං: විඤ්ඤාණං ච හි ආනන්ද, නාමරූපෙ පතිට්ඨං න ලභිස්සථ, අපි නු ඛො ආයතිං ජාතිජරාමරණං දුක්ඛසමුදයසම්භවො පඤ්ඤායෙථාති”?"
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං, භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තස්මාතිහානන්ද, එසෙව හෙතු එතං නිදානං එස සමුදයො එස පච්චයො විඤ්ඤාණස්ස, යදිදං නාමරූපං.”"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "“ආනන්දය, යම් ආකාර - ලිංග - නිමිත්ත - උද්දේසයන්ගෙන් නාමකායයාගේ හා රූපකායයාගේ හා පැනවීම වේ ද, ඒ ආකාර - ලිංග - නිමිත්ත - උද්දේසයන් නැති කල්හි අධිවචනසංස්පර්ශය (මනෝද්වාරිකස්පර්ශය) හෝ ප්‍රතිඝ සංස්පර්ශය (පඤ්චද්වාරිකස්පර්ශය) හෝ පැනෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො වන්නේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "“ආනන්දය, යම් ආකාර - ලිඞ්ග - නිමිත්ත - උද්දේසයන්ගෙන් නාමරූපයා ගේ පැණවීම වේද, ඒ ආකාර - ලිංග - නිමිත්ත - උද්දේසයන් නැති කල්හි ස්පර්ශයක් පැනෙන්නේ ද?”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“වහන්ස, මෙය නො වන්නේ ම ය.”"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, එහෙයින් මේ නාමරූප නම් වූ යමක් ඇද්ද, ස්පර්ශයට මෙය ම හේතු ය, මෙය ම නිදානය, මෙය ම සමුදය ය, මෙය ම ප්‍රත්‍ය ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "21. “විඥානප්‍රත්‍යයයෙන් නාමරූප වේ යැ යි මෙසේ ම මෙය කියන ලද්දේ ය. ආනන්දය, යම්සේ විඥානප්‍රත්‍යයයෙන් නාමරූපය වේ ද, එය මේ කරුණෙන් ද දත යුතු: ආනන්දය, විඥානය ද මව්කුසට නො බස්නේ නම් (මව්කුසැ ප්‍රතිසන්ධි වශයෙන් නො පහළ වන්නේ නම්) හුදු නාමරූපය (කලලාදිවශයෙන්මිශ්‍ර ව) මව්කුසැ පහළ වන්නේ ද?”’",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නොවන්නේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, විඥානය මවුකුසකට බැස (ප්‍රතිසන්ධිවශයෙන් පහළ වැ) පහ වන්නේ නම් (නිරුද්ධ වන්නේ නම්) නාමරූපය මෙබඳු (පරිපූර්ණ ස්කන්ධ) බව පිණිස වන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො වන්නේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, ළදරු වූ ම කුමරක්හුගේ හෝ කුමරියකගේ හෝ විඥානය සිඳෙන්නේ නම්, නාමරූපය වැඩීමට නැඟීමට විපුලබවට පැමිණෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො වන්නේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, එහෙයින් විඥානය, යන මෙය ම නාමරූපයට හේතු වේ, මෙය ම නිදානය වේ, මෙය ම සමුදය වේ, මෙයම ප්‍රත්‍යය වේ.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "22. “නාමරූපප්‍රත්‍යයයෙන් විඥානය වේ යැ යි මෙසේ ම මෙය කියන ලදි. ආනන්දය, යම්සේ නාමරූපප්‍රත්‍යයයෙන් විඥානය වේ ද, මේ කරුණෙනුත් එය දත යුතු: ආනන්දය, විඥානය ද නාමරූපයෙහි පිහිට නො ලබන්නේ නම්, මතු ජාතිජරාමරණ දුක්රැසේ හටගැන්ම පැනෙන්නේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නො වන්නේ ම ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, එහෙයින් මේ නාමරූප යැ යි යමෙක් ඇද්ද, විඥානයට මෙය ම හේතු ය, මෙය ම නිදාන ය ය, මෙය ම සමුදය ය, මෙය ම ප්‍රත්‍යය ය.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 94,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එත්තාවතා ඛො ආනන්ද, ජායෙථ වා ජීයෙථ වා මීයෙථ වා චවෙථ වා උපපජ්ජෙථ වා, එත්තාවතා අධිවචනපථො, එත්තාවතා නිරුත්තිපථො, එත්තාවතා විඤ්ඤත්තිපථො, එත්තාවතා පඤ්ඤාවචරං, එත්තාවතා වට්ටං වත්තති, (එත්තාවතා) ඉත්ථත්තං පඤ්ඤපනාය, යදිදං නාමරූපං සහ විඤ්ඤාණෙන අඤ්ඤමඤ්ඤපච්චයතා පවත්තති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "23. “කිත්තාවතා ච ආනන්ද, අත්තානං පඤ්ඤපෙන්තො පඤ්ඤපෙති; රූපිං වා හි ආනන්ද, පරිත්තං අත්තානං පඤ්ඤපෙන්තො පඤ්ඤපෙති ‘රූපී මෙ පරිත්තො අත්තා’ති, රූපිං වා හි ආනන්ද, අනන්තං අත්තානං පඤ්ඤපෙන්තො පඤ්ඤපෙති ‘රූපී මෙ අනන්තො අත්තා’ති, ‘අරූපිං වා හි ආනන්ද, පරිත්තං අත්තානං පඤ්ඤපෙන්තො පඤ්ඤපෙති ‘අරූපී මෙ පරිත්තො අත්තා’ති, අරූපිං වා හි ආනන්ද, අනන්තං අත්තානං පඤ්ඤපෙන්තො පඤ්ඤපෙති ‘අරූපී මෙ අනන්තො අත්තා’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "24. “තත්රානන්ද, යො සො රූපිං පරිත්තං අත්තානං පඤ්ඤපෙන්තො පඤ්ඤපෙති{1}, එතරහි වා සො රූපිං පරිත්තං අත්තානං පඤ්ඤපෙන්තො පඤ්ඤපෙති. තත්ථ භාවිං වා සො රූපිං පරිත්තං අත්තානං පඤ්ඤපෙන්තො පඤ්ඤපෙති. ‘අතථං වා පන සන්තං තථත්තාය උපකප්පෙස්සාමී’ති ඉති වා පනස්ස හොති. එවං සන්තං ඛො ආනන්ද, රූපිං පරිත්තත්තානුදිට්ඨි අනුසෙතීති ඉච්චාලං වචනාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "25. “තත්රානන්ද, යො සො රූපිං අනන්තං අත්තානං පඤ්ඤපෙන්තො පඤ්ඤපෙති, එතරහි වා සො රූපිං අනන්තං අත්තානං පඤ්ඤපෙන්තො පඤ්ඤපෙති. තත්ථ භාවිං වා සො රූපිං අනන්තං අත්තානං පඤ්ඤපෙන්තො පඤ්ඤපෙති. ‘අතථං වා පන සන්තං තථත්තාය උපකප්පෙස්සාමී’ති ඉති වා පනස්ස හොති. එවං සන්තං ඛො ආනන්ද, රූපිං අනන්තත්තානුදිට්ඨි අනුසෙතීති ඉච්චාලං වචනාය."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පඤ්ඤාපෙත්තො පඤ්ඤාපෙති - කත්ථචි."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "“ආනන්දය, යම් නාමරූපයෙක් විඥානය හා උනුනට ප්‍රත්‍යයභාවයෙන් පවත්නේ ද, මෙතෙකින් ම උපදනේ යැ යි හෝ දිරන්නේ යැ යි හෝ මැරෙන්නේ යැ යි හෝ ච්‍යුත වන්නේ යැ යි හෝ ච්‍යුත ව උපදනේ යැ යි හෝ පැනෙන්නේ ය, මෙතෙකින් (සිරිවඩ්ඩකාදී) ආරූඩ නාම ව්‍යවහාරයට මාර්ග (විෂය) වේ. මෙතෙකින් නිරුක්තියට (අර්ථානුගත වශයෙන් පැවැති ව්‍යවහාරයට) මාර්ග වේ. මෙතෙකින් ප්‍රඥප්තියට (පණ්ඩිතයා ය, ව්‍යක්තයා ය, යන ආදීන් ගුණ හඟවනු විසින් පැවැති ව්‍යවහාරයට) මාර්ගය වේ. මෙතෙකින් ප්‍රඥායෙන් දතයුතු ස්කන්ධ සඤ්චකය වේ. මෙතෙකින් (කර්ම ක්ලේශ විපාක යන) සසරවට වැටෙයි. මෙතෙකින් (වේදනාසංඥාදි) නාමප්‍රඥප්තිය පිණිස ඉත්ථම්භාවය හෙවත් පඤ්චස්කන්ධය වේ.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "23. “ආනන්දය, ආත්මය පනවන තැනැත්තේ කොතෙකින් එය පනවා ද යත්: ආනන්දය, රූපවත් වූ හෝ සූක්ෂම ආත්මයක් පනවන්නේ (නො වැඩූ පරිත්ත කසිණ රූපය සුක්ෂම ආත්ම යැ යි ගන්නේ) ‘මගේ ආත්මය රූපවත් ය, සූක්ෂම යැ’ යි පනවයි. ආනන්දය, රූපවත් වූ හෝ අනන්ත ආත්මයක් පනවන්නේ (වැඩූ කසිණ රූපය අනන්තාත්ම යැ යි ගන්නේ) ‘මගේ ආත්මය රූපවත් ය, අනන්ත යැ’ යි පනවයි. ආනන්දය, අරූපී වූ හෝ සූක්ෂම ආත්මයක් පනවන්නේ (නො වැඩු කසිණ නිමිත්ත ඉඟුළු අහස් හි පැවැති අරූපස්කන්ධ ආත්මය යි ගෙන) ‘මගේ ආත්මය අරූපී ය සූක්ෂම යැ’ යි පනවයි. ආනන්දය, අරූපී වූ හෝ අනන්ත ආත්මයක් පනවන්නේ (වැඩූ කසිණ නිමිත්ත ඉඟුළු අහස්හි පැවැති අරූපස්කන්ධය ආත්මය යි ගෙන) ‘මගේ ආත්මය අරූපී ය, අනන්ත යැ’ යි පනවයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "24. “ආනන්දය, ඔවුන් අතුරෙන් යමෙක් රූපී වූ සූක්ෂම ආත්මයක් පනවන්නේ පනවා ද, හෙතෙම මේ අත්බව්හි පමණක් පවත්නා වූ (මරණින් සිඳී යන) හෝ සියුම් ආත්මයක් පනවයි. එහි (ශාස්වත විසින් පරලොවෙහිත්) වන්නාවූ හෝ සියුම් වූ ආත්මයක් පනවනුයේ පණවයි. ‘අතථ වූ(පරවාදියා කියන ශාස්වත නො වූ ම) ආත්මය තථත්වය පිණිස (එහි යථාස්භාවය ඔහුට පිළිගැනෙන පිණිස) සමර්ථනය කරන්නෙමි’ යි මෙසේ හෝ ඔහුට සිතෙක් වෙයි. ආනන්දය, මෙසේ වූ ම රූපකසිණලාභියා කෙරෙහි සූක්ෂමාත්මානුදෘෂ්ටිය වැදහේ යැ යි (සන්තානානුගත වැ හෝනේ යැ යි) මෙසේ කියන්නට සුදුසු ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "25. “ආනන්දය, ඔවුන් අතුරෙන් යමෙක් රූපී වූ අනන්ත ආත්මයක් පනවනුයේ පනවා ද, හෙතෙම මේ අත්බව්හි පමණක් පවත්නා හෝ අනන්ත ආත්මයක් පනවනුයේ පනවයි. පරලොව්හිත් වන්නාවූ හෝ අනන්ත ආත්මයක් පණවනුයේ පනවයි. ‘අතථ වූ ම (පරවාදියා කියනා අවිද්‍යාමාන වූ ම) ආත්මය තථත්වය පිණිස (ඇති සැටිය ඔහුට පිළිගැනෙනු පිණිස) සමර්ථනය කරන්නෙමි’ යි මෙසේ හෝ සිතෙක් ඔහුට වෙයි. ආනන්දය, මෙසේ වූ ම රූපකසිණලාභියා කෙරෙහි අනන්තාත්මානුදෘෂ්ටිය වැදැ හෝනේ යැ යි (සන්තානානුගත ව පවත්නේ යැ යි) මෙසේ කියන්නට සුදුසු ය.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 96,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "26. “තත්රානන්ද, යො සො අරූපිං පරිත්තං අත්තානං පඤ්ඤපෙන්තො පඤ්ඤපෙති, එතරහි වා සො අරූපිං පරිත්තං අත්තානං පඤ්ඤපෙන්තො පඤ්ඤපෙති. තත්ථ භාවිං වා සො අරූපිං පරිත්තං අත්තානං පඤ්ඤපෙන්තො පඤ්ඤපෙති. ‘අතථං වා පන සන්තං තථත්තාය උපකප්පෙස්සාමී’ති ඉති වා පනස්ස හොති. එවං සන්තං ඛො ආනන්ද, අරූපිං පරිත්තත්තානුදිට්ඨි අනුසෙතීති ඉච්චාලං වචනාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "27. “තත්රානන්ද, යො සො අරූපිං අනන්තං අත්තානං පඤ්ඤපෙන්තො පඤ්ඤපෙති, එතරහි වා සො අරූපිං අනන්තං අත්තානං පඤ්ඤපෙන්තො පඤ්ඤපෙති. තත්ථ භාවිං වා සො අරූපිං අනන්තං අත්තානං පඤ්ඤපෙන්තො පඤ්ඤපෙති. ‘අතථං වා පන සන්තං තථත්තාය උපකප්පෙස්සාමී’ති ඉති වා පනස්ස හොති. එවං සන්තං ඛො ආනන්ද, අරූපිං අනන්තත්තානුදිට්ඨි අනුසෙතීති ඉච්චාලං වචනාය. එත්තාවතා ඛො ආනන්ද, අත්තානං පඤ්ඤපෙන්තො පඤ්ඤපෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "28. “කිත්තාවතාචානන්ද, අත්තානං න පඤ්ඤපෙන්තො න පඤ්ඤපෙති:"
                    },
                    {
                        "type": "paragraph",
                        "text": "රූපිං වා හි ආනන්ද, පරිත්තං අත්තානං න පඤ්ඤපෙන්තො න පඤ්ඤපෙති ‘රූපී මෙ පරිත්තො අත්තා’ති. රූපිං වා හි ආනන්ද, අනන්තං අත්තානං න පඤ්ඤපෙන්තො න පඤ්ඤපෙති ‘රූපී මෙ අනන්තො අත්තා’ති. අරූපිං වා හි ආනන්ද, පරිත්තං අත්තානං න පඤ්ඤපෙන්තො න පඤ්ඤපෙති ‘අරූපී මෙ පරිත්තො අත්තා’ති. අරූපිං වා හි ආනන්ද, අනන්තං අත්තානං න පඤ්ඤපෙන්තො න පඤ්ඤපෙති ‘අරූපී මෙ අනන්තො අත්තා’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "29. “තත්රානන්ද, යො සො රූපිං පරිත්තං අත්තානං න පඤ්ඤපෙන්තො න පඤ්ඤපෙති, එතරහි වා සො රූපිං පරිත්තං අත්තානං න පඤ්ඤපෙන්තො න පඤ්ඤපෙති. තත්ථ භාවිං වා සො රූපිං පරිත්තං අත්තානං න පඤ්ඤපෙන්තො න පඤ්ඤපෙති. ‘අතථං වා පන සන්තං තථත්තාය උපකප්පෙස්සාමී’ති ඉති වා පනස්ස න හොති. එවං සන්තං ඛො ආනන්ද, රූපිං පරිත්තත්තානුදිට්ඨි නානුසෙතීති ඉච්චාලං වචනාය."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "26. “ආනන්දය, ඔවුන් අතුරෙන් යමෙක් අරූපී වූ සියුම් ආත්මයක් පනවනුයේ පනවා ද, හේ දැන් පමණක් පවත්නා හෝ අරූපී වූ සියුම් ආත්මයක් පනවන්නේ පනවයි. පරලොව්හි පවත්නා වූ හෝ අරූපී වූ සියුම් ආත්මයක් පනවන්නේ පනවයි. ‘අතථ වූ ම ආත්මය තථත්වය පිණිස සමර්ථනය කරන්නෙමි’ යි මෙසේ හෝ සිතෙක් ඔහුට වෙයි. ආනන්දය, මෙසේ වූ ම අරූපකසිණලාභියා කෙරෙහි සූක්ෂමාත්මානුදෘෂ්ටිය වැදැ හෝනේ යැ යි මෙසේ කියනු සුදුසු ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "27. “ආනන්දය, ඔවුන් අතුරෙන් යමෙක් අරූපී වූ අනන්ත ආත්මයක් පනවනුයේ පනවා ද, හේ දැන් පමණක් පවත්නා හෝ අරූපී වූ අනන්ත ආත්මයක් පනවන්නේ පනවයි. පරලොව්හි ද පවත්නා හෝ අරූපි වූ අනන්ත ආත්මයක් පනවන්නේ පනවයි. ‘අතථ වූ ම ආත්මයක් තථත්වය පිණිස සමර්ථනය කරන්නෙමි’ යි මෙසේ හෝ ඔහුට සිතෙක් වෙයි. ආනන්දය, මෙසේ වූ ම අරූපකසිණලාභියා කෙරෙහි අනන්තාත්මානුදෘෂ්ටිය වැදැ හෝනේ යැ යි මෙසේ කියනු සුදුසු ය. ආනන්දය, ආත්මය පණවන්නේ මෙතෙකින් ම පනවයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "28. “ආනන්දය, ආත්මය, නො පනවන්නේ කොතෙකින් නො පනවා ද යත්:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආනන්දය රූපී වූ සියුම් ආත්මයක් නො පනවන්නේ ‘මගේ ආත්මය රූපවත් ය, සියුම් යැ’ යි හෝ නො පනවයි. ආනන්දය රූපී වූ අනන්ත ආත්මයක් නො පනවන්නේ ‘මගේ ආත්මය රූපවත් ය, අනන්ත යැ’ යි කියා හෝ නො පනවයි. ආනන්දය, අරූපී වූ සියුම් ආත්මයක් නො පනවන්නේ ‘මගේ ආත්මය අරූපී ය, සියුම් යැ’ යි කියා හෝ නො පණවයි. ආනන්දය, අරූපී වූ අනන්ත ආත්මයක් නො පනවන්නේ ‘මගේ ආත්මය අරූපී ය, අනන්ත යැ’ යි කි යා හෝ නො පනවයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "29. “ආනන්දය, ඔවුන් අතුරෙන් යමෙක් රූපී වූ සියුම් ආත්මයක් නො පනවන්නේ නො පනවා ද, හෙ තෙම දැන් (වර්ථමාන භවයෙහි) හෝ රූපවත් වූ සියුම් ආත්මයක් නො පනවන්නේ නො පනවයි. මතු භවයෙහි වන්නා වූ හෝ රූපවත් සියුම් ආත්මයක් නො පනවන්නේ නො පනවයිදු ‘අවිද්‍යාමාන වූ හෝ ආත්මයක් විද්‍යාමානත්වය පිණිස සමර්ථනය කරන්නෙමි’ යි මෙසේ හෝ සිතෙක් ඔහුට නො වෙයි. ආනන්ද ය, මෙසේ වූ ම රූපකසිණලාභියා අනුව සූක්ෂමාත්මානුදෘෂ්ටිය නො හෝනේ යැ යි මෙසේ කියනු සුදුසු ය.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 98,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "30. “තත්රානන්ද , යො සො රූපිං අනන්තං අත්තානං න පඤ්ඤපෙන්තො න පඤ්ඤපෙති, එතරහි වා සො රූපිං අනන්තං අත්තානං න පඤ්ඤපෙන්තො න පඤ්ඤපෙති. තත්ථ භාවිං වා සො රූපිං අනන්තං අත්තානං න පඤ්ඤපෙන්තො න පඤ්ඤපෙති. ‘අතථං වා පන සන්තං තථත්තාය උපකප්පෙස්සාමී’ති ඉති වා පනස්ස න හොති. එවං සන්තං ඛො ආනන්ද, රූපිං අනන්තත්තානුදිට්ඨි නානුසෙතීති ඉච්චාලං වචනාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "31. “තත්රානන්ද, යො සො අරූපිං පරිත්තං අත්තානං න පඤ්ඤපෙන්තො න පඤ්ඤපෙති, එතරහි වා සො අරූපිං පරිත්තං අත්තානං න පඤ්ඤපෙන්තො න පඤ්ඤපෙති. තත්ථ භාවිං වා සො අරූපිං පරිත්තං අත්තානං න පඤ්ඤපෙන්තො න පඤ්ඤපෙති. ‘අතථං වා පන සන්තං තථත්තාය උපකප්පෙස්සාමී’ති ඉති වා පනස්ස න හොති. එවං සන්තං ඛො ආනන්ද, අරූපිං පරිත්තත්තානුදිට්ඨි නානුසෙතීති ඉච්චාලං වචනාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "32. “තත්රානන්ද, යො සො අරූපිං අනන්තං අත්තානං න පඤ්ඤපෙන්තො න පඤ්ඤපෙති, එතරහි වා සො අරූපිං අනන්තං අත්තානං න පඤ්ඤපෙන්තො න පඤ්ඤපෙති. තත්ථ භාවිං වා සො අරූපිං අනන්තං අත්තානං න පඤ්ඤපෙන්තො න පඤ්ඤපෙති. ‘අතථං වා පන සන්තං තථත්තාය උපකප්පෙස්සාමී’ති ඉති වා පනස්ස න හොති. එවං සන්තං ඛො ආනන්ද, අරූපිං අනන්තත්තානුදිට්ඨි නානුසෙතීති ඉච්චාලං වචනාය. "
                    },
                    {
                        "type": "paragraph",
                        "text": "එත්තාවතා ඛො ආනන්ද, අත්තානං න පඤ්ඤපෙන්තො න පඤ්ඤපෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "33. “කිත්තාවතා ච ආනන්ද, අත්තානං සමනුපස්සමානො සමනුපස්සති;"
                    },
                    {
                        "type": "paragraph",
                        "text": "වෙදනං වා හි ආනන්ද, අත්තානං සමනුපස්සමානො සමනුපස්සති: ‘වෙදනා මෙ අත්තා’ති. ‘න හෙව ඛො මෙ වෙදනා අත්තා, අප්පටිසංවෙදනො මෙ අත්තා’ති ඉති වා හි ආනන්ද, අත්තානං සමනුපස්සමානො සමනුපස්සති. ‘න හෙව ඛො මෙ වෙදනා අත්තා, නොපි අප්පටිසංවෙදනො මෙ අත්තා, අත්තා මෙ වෙදයති වෙදනාධම්මො හි මෙ අත්තා’ති ඉති වා හි ආනන්ද, අත්තානං සමනුපස්සමානො සමනුපස්සති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "30. “ආනන්දය, ඔවුන් අතුරෙන් යමෙක් රූපවත් වූ අනන්ත ආත්මයක් නො පනවන්නේ නො පනවා නම්, හෙතෙම දැන් (මේ භවයෙහි) හෝ රූපවත් වූ අනන්ත ආත්මයක් නො පනවන්නෙ නො පනවයි. මතු භවයෙහි වන්නාවූ හෝ අනන්ත ආත්මයක් නො පනවන්නේ නො පනවයි. ‘අවිද්‍යාමාන වූ හෝ ආත්මයක් විද්‍යාමානත්වය පිණිස සමර්ථනය කරන්නෙමි’ යි මෙසේ සිතෙක් හෝ ඔහුට නො වෙයි. ආනන්දය, මෙසේ වූ ම අනන්තාත්මානුදෘෂ්ටිය රූපකසිණලාභියා කෙරෙහි නො ම හෝනේ යැ යි කියනු සුදුසු ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "31. “ආනන්දය, ඔවුන් අතුරෙන් යමෙක් අරූපී වූ සූක්ෂම ආත්මයක් නො පනවන්නේ නො පනවා නම්, හෙතෙම දැන් (මේ භවයෙහි) හෝ අරූපී වූ සූක්ෂම ආත්මයක් නො පනවන්නේ නො පනවයි. මතු භවයෙහි වන්නාවු හෝ අරූපී සූක්ෂම ආත්මයක් නො පනවන්නේ නො පනවයි. ‘අවිද්‍යාමාන වූ හෝ ආත්මයක් විද්‍යාමානත්වය පිණිස සමර්ථනය කරන්නෙමි’ යි මෙසේ සිතෙක් හෝ ඔහුට නො වෙයි. ආනන්දය, මෙසේ වූ ම අරූපකසිණලාභියා කෙරෙහි සූක්ෂමාත්මානුදෘෂ්ටිය නො ම හෝනේ යැ යි කියනු සුදුසු ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "32. “ආනන්දය, ඔවුන් අතුරෙන් යමෙක් අරූපී වූ අනන්ත ආත්මයක් නො පනවන්නේ නො පනවා නම්, හෙතෙම දැන් (මේ භවයෙහි) හෝ අරූපී අනන්ත ආත්මයක් නො පනවන්නේ නො පනවයි. මතු භවයෙහි වන්නාවු හෝ අරූපී අනන්ත ආත්මයක් නො පනවන්නේ නො පනවයි. ‘අවිද්‍යාමාන ආත්මයක් හෝ විද්‍යාමානත්වයෙන් සමර්ථනය කරන්නෙමි’ යි මෙසේ සිතෙක් හෝ ඔහුට නො වෙයි. ආනන්දය, මෙසේ වූ ම අරූපකසිණලාභියා කෙරෙහි ආනන්තාත්මානුදෘෂ්ටිය නො හෝනේ යැ යි කියනු සුදුසු ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආනන්දය, මෙතෙකින් ම ආත්මය නො පණවන්නේ නො පණවයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "33. “ආනන්දය, කොතෙකින් (දිට්ඨිසමනුපස්සනායෙන්) ආත්මයක් දක්නේ දකී ද යත්:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආනන්දය, වේදනාව ආත්ම යැ යි දක්නේ ‘වේදනාව මාගේ ආත්මය වේ’ යැ යි හෝ මෙසේ දකියි. ‘වේදනාව මගේ ආත්මය නො වේ’ මාගේ ආත්මය වේදනාරහිත යැ’ යි මෙසේ හෝ ආනන්දය, ආත්මයක් දක්නේ දකියි. ‘වේදනාව මගේ ආත්මය නො වේ ම ය, මගේ ආත්මය වේදනා රහිත ද නො වේ ම ය, ආත්මය විඳී, මගේ ආත්මය (වේදනාසම්ප්‍රයුක්ත බැවින්) විඳින ස්වභාව ඇත්තේ ම යැ’ යි මෙසේ හෝ ආනන්දය, ආත්මයක් දක්නේ දකී.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 100,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "34. තත්රානන්ද, යො සො එවමාහ: ‘වෙදනා, මෙ අත්තා’ති, සො එවමස්ස වචනීයො: ‘තිස්සො ඛො ඉමා ආවුසො වෙදනා: සුඛා වෙදනා දුක්ඛා වෙදනා අදුක්ඛමසුඛා වෙදනා. ඉමාසං ඛො ත්වං තිස්සන්නං වෙදනානං කතමං අත්තතො සමනුපස්සසී’ති. යස්මිං ආනන්ද, සමයෙ සුඛං වෙදනං වෙදෙති, නෙව තස්මිං සමයෙ දුක්ඛං වෙදනං වෙදෙති, න අදුක්ඛමසුඛං වෙදනං වෙදෙති, සුඛං යෙව තස්මිං සමයෙ වෙදනං වෙදෙති. යස්මිං ආනන්ද, සමයෙ දුක්ඛං වෙදනං වෙදෙති, නෙව තස්මිං සමයෙ සුඛං වෙදනං වෙදෙති, න අදුක්ඛමසුඛං වෙදනං වෙදෙති, දුක්ඛං යෙව තස්මිං සමයෙ වෙදනං වෙදෙති. යස්මිං ආනන්ද, සමයෙ අදුක්ඛමසුඛං වෙදනං වෙදෙති, නෙව තස්මිං සමයෙ සුඛං වෙදනං වෙදෙති, න දුක්ඛං වෙදනං වෙදෙති, අදුක්ඛමසුඛං යෙව තස්මිං සමයෙ වෙදනං වෙදෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "35. “සුඛාපි ඛො ආනන්ද, වෙදනා අනිච්චා සඞ්ඛතා පටිච්චසමුප්පන්නා ඛයධම්මා වයධම්මා විරාගධම්මා නිරොධධම්මා. දුක්ඛාපි ඛො ආනන්ද, වෙදනා අනිච්චා සඞ්ඛතා පටිච්චසමුප්පන්නා ඛයධම්මා වයධම්මා විරාගධම්මා නිරොධධම්මා. අදුක්ඛමසුඛාපි ඛො ආනන්ද, වෙදනා අනිච්චා සඞ්ඛතා පටිච්චසමුප්පන්නා ඛයධම්මා වයධම්මා විරාගධම්මා __නිරොධධම්මා__. තස්ස සුඛං වෙදනං වෙදයමානස්ස{1} ‘එසො මෙ අත්තා’ති හොති. තස්සා යෙව සුඛාය වෙදනාය නිරොධා ‘ව්යග්ගො මෙ අත්තා’ති හොති. දුක්ඛං වෙදනං වෙදයමානස්ස ‘එසො මෙ අත්තා’ති හොති. තස්සා යෙව දුක්ඛාය වෙදනාය නිරොධා ‘ව්යග්ගො මෙ අත්තා’ති හොති. අදුක්ඛමසුඛං වෙදනං වෙදයමානස්ස ‘එසො මෙ අත්තා’ති හොති. තස්සා යෙව අදුක්ඛමසුඛාය වෙදනාය නිරොධා ‘ව්යග්ගො මෙ අත්තා’ති හොති. ඉති සො දිට්ඨෙව ධම්මෙ අනිච්චං සුඛං දුක්ඛං වොකිණ්ණං{2} උප්පාදවයධම්මං අත්තානං සමනුපස්සමානො සමනුපස්සති. යො සො එවමාහ ‘වෙදනා මෙ අත්තා’ති. තස්මාතිහානන්ද, එතෙනපෙතං නක්ඛමති ‘වෙදනා මෙ අත්තා’ති සමනුපස්සිතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "36. “තත්රානන්ද , යො සො එවමාහ ‘නහෙව ඛො මෙ වෙදනා අත්තා, අප්පටිසංවෙදනො මෙ අත්තා’ති, සො එවමස්ස වචනීයො ‘යත්ථ පනාවුසො සබ්බසො වෙදයිතං නත්ථි, අපි නු ඛො තත්ථ අයමහමස්මී’ති{3} සියා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තස්මාතිහානන්ද, එතෙනපෙතං නක්ඛමති ‘නහෙව ඛො මෙ වෙදනා අත්තා, අප්පටිසංවෙදනො මෙ අත්තා’ති සමනුපස්සිතුං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. වෙදියමානස්ස - කත්ථචි."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අනිච්චසුඛදුක්ඛවොකිණ්ණං - කත්ථචි."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අහමස්මීති - සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "34. “ආනන්දය, ඔවුන් අතුරෙන් යමෙක් ‘වේදනාව මගේ ආත්මය යැ’ යි මෙසේ කියා ද, ‘ඇවැත්නි, සුඛවේදනා දුඃඛවේදනා, අදුඃඛාසුඛ වේදනා යි මේ වේදනා තුනෙකි. මේ තුන් වේදනාවන්ගෙන් තෝ කවර වේදනාවක් ආත්ම වශයෙන් දක්නෙහි දැ’ යි හෙ තෙම මෙසේ කිය යුතු (ඔහුගෙන් මෙසේ ප්‍රශ්න කටයුතු). ආනන්දය, යම් විටෙක (සත්ව තෙමේ) සුඛවේදනාව විඳී ද, එ සමයෙහි හේ දුඃඛවේදනාව නො ම විඳියි, අදුඃඛාසුඛවේදනාව ද නොම විඳියි, එසමයෙහි හේ සුඛ වේදනාව ම විඳියි. ආනන්දය, යම් විටෙක දුඃඛවේදනා විඳී ද, එ විටැ සුඛවේදනාව නොම විඳියි, අදුඃඛාසුඛවේදනාව ද නොම විඳියි, එසමයෙහි දුඃඛවේදනා ම විඳී. ආනන්දය, යම් විටෙක අදුඃඛාසුඛවේදනාව විඳී ද, එවිටැ සුඛවේදනාව නො ම විඳියි, දුඃඛවේදනාව ද නො ම විඳියි. අදුඃඛාසුඛවේදනාව ම එවිටැ විඳී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "35. “ආනන්දය, සුඛවේදනාව ද අනිත්‍ය ය, සංස්කෘත ය (ප්‍රත්‍යයයන් විසින් සකස් වූයේ ය), ප්‍රතීත්‍යසමුත්පන්න ය, ක්ෂයධර්මය (ක්ෂීණ වන සුලු ය), ව්‍යධර්මය, (වැනසෙන සුලු ය), විරාගධර්ම ය (පහ වන සුලු ය), නිරෝධධර්මය (නිරුද්ධවන සුලු ය). ආනන්දය, දුඃඛවේදනාව ද අනිත්‍ය ය, සංස්කෘත ය. ප්‍රතීත්‍යසමුත්පන්න ය, ක්ෂයධර්මය, ව්‍යධර්මය, විරාගධර්ම ය, නිරෝධධර්මය. ආනන්දය, අදුඃඛාසුඛවේදනාව ද අනිත්‍ය ය, සංස්කෘත ය, ප්‍රතීත්‍යසමුත්පන්න ය, ක්ෂයධර්මය, ව්‍යධර්මය, විරාගධර්ම ය, නිරෝධධර්මය. සුඛවේදනාව විඳුනා හට ‘මේ මගේ ආත්මය වේ’ යැ යි සිතෙක් වෙයි. ඒ සුඛවේදනාවගේ නිරෝධයෙන් ‘මේ මගේ ආත්මය ව්‍යග්‍ර වී (විසිර ගියේ යැ යි, පහ ව ගියේ යැ)’ යි සිතෙක් වෙයි. දුඃඛවේදනාව විඳුනාහට ‘මේ මගේ ආත්මය වේ ’ යැ යි සිතෙක් වෙයි. ඒ දුඃඛවේදනාවගේ ම නිරෝධයෙන් ‘මගේ ආත්මය ව්‍යග්‍ර වී’ යැ යි සිතෙක් වෙයි. අදුඃඛාසුඛවේදනාව විදුනාහට ‘මේ මගේ ආත්මය යැ’ යි සිතෙක් වෙයි. ඒ අදුඃඛාසුඛවේදනාව නිරුද්ධ වීමෙන් ‘මගේ ආත්මය ව්‍යග්‍ර වී යැ’ යි සිතෙක් වෙයි. මෙසේ හෙ තෙම මෙ අත්බව්හි ම ආත්මයක් දක්නේ අනිත්‍ය වූ සුඛ වූ දුක් වු අනිත්‍යාදී ලක්ෂණයන්ගෙන් මිශ්‍ර වූ (අදුඃඛාසුඛ වූ) උපදනසුලු නැසෙන සුලු රූපාදි ස්කන්ධයක් දකී. එහෙයින් ආනන්දය, ‘වේදනාව මගේ ආත්මයැ’ යි මෙය දක්නට මෙයිනුත් නො රිසියෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "36. “ආනන්දය, ඔවුන් අතුරෙන් යමෙක් ‘වේදනාව මගේ ආත්මය නොවේ ම ය, මගේ ආත්මය ප්‍රතිසංවේදනා රහිත යැ’ යි මෙසේ කියා නම්, ‘ඇවැත්නි, යම් තැනෙක හැම අයුරින් ම විඳීමෙක් නැත් නම්, එහි මේ මම් වෙමි’ යි කියැ යුතු කිසි ස්කන්ධධර්මයෙක් වන්නේ දැ?’ යි හෙ තෙම කිය යුතු. (ඔහුගෙන් ප්‍රශ්න කළ යුතු).",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය (මම වෙමි යි ගත යුතු කිසි ස්කන්ධයෙක් එහි) නොවේ ම යැ” යි (අනඳතෙරණුවෝ වාදාළහ.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, එහෙයින් ‘වේදනාව මගේ ආත්මය නොවේ ම ය, මගේ ආත්මය ප්‍රතිසංවේදනාරහිත යැ’යි මෙය දක්නට මෙයිනුත් නො රිසියෙ යි.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 102,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "37. තත්රානන්ද, යො සො එවමාහ ‘නහෙව ඛො මෙ වෙදනා අත්තා, නො’පි අප්පටිසංවෙදනො මෙ අත්තා, අත්තා මෙ වෙදෙති, වෙදනාධම්මො හි මෙ අත්තා’ති, සො එවමස්ස වචනීයො: ‘වෙදනා ච හි ආවුසො සබ්බෙන සබ්බං සබ්බථා සබ්බං අපරිසෙසා නිරුජ්ඣෙය්යුං, සබ්බසො වෙදනාය අසති වෙදනානිරොධා අපි නු ඛො තත්ථ අයමහමස්මී’ති සියා?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තස්මාතිහානන්ද, එතෙනපෙතං නක්ඛමති ‘නහෙව ඛො මෙ වෙදනා අත්තා, නො පි අප්පටිසංවෙදනො මෙ අත්තා, අත්තා මෙ වෙදයති, වෙදනාධම්මො හි මෙ අත්තා’ති සමනුපස්සිතුං.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "38. “යතො ඛො පනානන්ද, භික්ඛු නෙව වෙදනං අත්තානං සමනුපස්සති, නො පි අප්පටිසංවෙදනං අත්තානං සමනුපස්සති, නො පි ‘අත්තා මෙ වෙදයති වෙදනාධම්මො හි මෙ අත්තා’ති සමනුපස්සති, සො එවං අසමනුපස්සන්තො න ච කිඤ්චි ලොකෙ උපාදියති, අනුපාදියං න පරිතස්සති, අපරිතස්සං පච්චත්තං යෙව පරිනිබ්බායිස්සති. ඛීණා ජාති, වුසිතං බ්රහ්මචරියං, කතං කරණීයං, නාපරං ඉත්ථත්තායා’ති පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "39. “එවං විමුත්තචිත්තං ඛො ආනන්ද, භික්ඛුං යො එවං වදෙය්ය “හොති තථාගතො පරම්මරණා ඉති’ස්ස දිට්ඨී”ති තදකල්ලං. “න හොති තථාගතො පරම්මරණා ඉති’ස්ස දිට්ඨී”ති තදකල්ලං. “හොති ච න ච හොති තථාගතො පරම්මරණා ඉති’ස්ස දිට්ඨී”ති තදකල්ලං. “නෙව හොති, න න හොති තථාගතො පරම්මරණා ඉති’ස්ස දිට්ඨී”ති තදකල්ලං. තං කිස්ස හෙතු: යාවතා ආනන්ද, අධිවචනං, යාවතා අධිවචනපථො, යාවතා නිරුත්ති, යාවතා නිරුත්තිපථො, යාවතා පඤ්ඤත්ති, යාවතා පඤ්ඤත්තිපථො, යාවතා පඤ්ඤා, යාවතා පඤ්ඤාවචරං යාවතා වට්ටං වට්ටති,{1} තදභිඤ්ඤා විමුත්තො භික්ඛු “තදභිඤ්ඤා විමුත්තො භික්ඛු{2} න ජානාති න පස්සති ඉති’ස්ස දිට්ඨී”ති තදකල්ලං."
                    },
                    {
                        "type": "paragraph",
                        "text": "40. “සත්ත ඛො ඉමා ආනන්ද, විඤ්ඤාණට්ඨිතියො, ද්වෙ ආයතනානි, කතමා සත්ත:"
                    },
                    {
                        "type": "paragraph",
                        "text": "“සන්තානන්ද, සත්තා නානත්තකායා නානත්තසඤ්ඤිනො සෙය්යථාපි මනුස්සා එකච්චෙ ච දෙවා එකච්චෙ ච විනිපාතිකා. අයං පඨමා විඤ්ඤාණට්ඨිති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. යාවනා වට්ටං යාවනා වට්ටති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. විමුත්තං භික්ඛුං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "37. “ආනන්දය, ඔවුන් අතුරෙන් යමෙක් ‘වේදනාව මගේ ආත්මය නො වේ ම ය, මගේ ආත්මය වේදනාරහිතත් නො වේ ම ය, මගේ ආත්මය විඳියි, මගේ ආත්මය විඳින සුලු යැ’ යි යමෙක් මෙසේ කියා නම්, ‘ඇවැත්නි, වේදනාවෝත් හැම අයුරින් ම හැම සැටියෙන් ම නො ඉතිරි ව නිරුද්ධ වන්නාහු නම්, හැම අයුරින් ම වේදනාව නැති කල්හි, වේදනාවගේ නිරෝධයෙන් එහි ‘මේ මම් වෙමි’ යි කියා යුතු කිසිදු ස්කන්ධධර්මයෙක් වන්නේ දැ?යි  මෙසේ හෙ තෙම කියැ යුතු (ඔහුගෙන් ප්‍රශ්න කළයුතු). ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "“වහන්ස, (‘මේ මම් වෙමි’යි කිය යුතු කිසිත් වන්නේ ය යන) මෙය නො වේ ම ය.” "
                    },
                    {
                        "type": "paragraph",
                        "text": "ආනන්දය, එහෙයින් මෙයිනුත් වේදනාව මගේ ආත්මය නොවේ ම ය, වේදනා නො වනුයේත් මගේ ආත්මය නො වේ ම ය, (වේදනායෙන් අන්‍ය ධර්මයෙක් වූ) මගේ ආත්මය විඳියි, (එසේ වූ) මගේ ආත්මය විඳින සුලු යැ’ යි මෙසේ මෙය දක්නට නො රිසියෙයි."
                    },
                    {
                        "format": 13,
                        "text": "38. “ආනන්දය, යම් කලෙක මහණ වේදනාව ආත්ම කොට නො දකී ද, ආත්මය වේදනා නොවූවක් කොට හෝ නො දකී ද, ‘මගේ ආත්මය විඳියි, මගේ ආත්මය විඳුනා සුලු යැ’යි හෝ නො ම දකී ද, එසේ නො දක්නා හෙ තෙම ලොවැ කිසිත් (ආත්ම ආත්මීය වශයෙන්) නො ගනුයේ තෘෂ්ණා දෘෂ්ටි මාන යන තුන් පරිතස්සනායෙන් පරිතස්සනා නො කෙරෙයි. පරිතස්සනා නො කරන්නේ තෙමේ ම කෙලෙස් පිරිනිවනින් පිරිනිවෙයි, ‘සසර ඉපැත්ම ක්ෂීන වීයැ යි, මග බඹසර වැස නිමැවිණැ යි, කළ යුතු දෑ කරන ලද්දේ යැ යි, මේ රහත් බව පිණිස කළයුතු අනෙකක් නැතැ’ යි දැනගනී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "39. “ආනන්දය, මෙසේ (ආත්මදර්ශන නැති) මිදුණු සිතැති රහත් මහණහු ඇරැබ යමෙක් ‘තථාගත තෙම මරණින් මත්තෙහි වේ යැ යි මොහුගේ (රහත් වූවහුගේ) දෘෂ්ඨිය මෙසේ යැ’ යි කියන්නේ නම්, ඒ කීම (රහත් තෙම කිසිවක් නො දනී යැ යි කීයූවක් වන බැවින්) නො යුතු ය. ‘තථාගත තෙම මරණින් මත්තෙහි නොවේ යැ යි යනු මොහුගේ දෘෂ්ටියැ’ යි කියන්නේ නම්, එය නොයුතු ය. ‘තථාගත තෙම මරණින් මත්තෙහි වන්නේත් නො වන්නේත් වේ යැ යි යනු මොහුගේ දෘෂ්ටියැ’ යි කියන්නේ නම්, එය නො යුතු ය. ‘තථාගත තෙම මරණින් මතු නො ම වෙයි, නො ම නො වෙයි යනු මොහුගේ දෘෂ්ටියැ’ යි කියන්නේ නම්, එය නො යුතු ය. ඒ කවර හෙයින: ආනන්දය, ව්‍යවහාර යම් පමණ ද, ව්‍යවහාරවිෂය යම් පමණ ද, නිර්වචන යම් පමණ ද, නිර්වචනවිෂය යම් පමණ ද, ප්‍රඥප්තිය (පැණවීම) යම් පමණ ද, ප්‍රඥප්තිවිෂය යම් පමණ ද, ප්‍රඥාව යම් පමණ ද, ප්‍රඥායෙන් බැස ගත යුතු පඤ්චස්කන්ධය යම් පමණ ද, යම්තාක් සසරවට පවතී ද, රහත් මහණ එය වෙසෙසින් දැන මිදුණේ වෙයි. ‘එය දැන මිදුණු මහණ නො දනී, නො දකී, එබැවින් මොහුගේ දෘෂ්ඨිය මෙසේ යැ’ යි යම් කීමේක් ඇද්ද, එය නො යුතු යැ.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "40. ආනන්දය, මේ විඥානස්ථිති (විඥානය පිහිටි තැන්) සත් දෙනෙකි, මේ ආයතනයෝ දෙදෙනෙකි. විඥානස්ථිති සත කවරහ යත්:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආනන්දය, මනුෂ්‍යයෝ ද සමහර දෙවියෝ ද සමහර විනිපාතිකයෝ ද (වෙමානික ප්‍රේතයෝ) ද යන කායනානාත්වය හා සංඥානානාත්වය ඇති සත්ත්වයෝ ඇත. මේ ප්‍රථම විඥානස්ථිතිය යැ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 104,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“සන්තානන්ද, සත්තා නානත්තකායා එකත්තසඤ්ඤිනො සෙය්යථාපි දෙවා බ්රහ්මකායිකා පඨමාභිනිබ්බත්තා. අයං දුතියා විඤ්ඤාණට්ඨිති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“සන්තානන්ද, සත්තා එකත්තකායා නානත්තසඤ්ඤිනො සෙය්යථාපි දෙවා ආභස්සරා. අයං තතියා විඤ්ඤාණට්ඨිති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“සන්තානන්ද, සත්තා එකත්තකායා එකත්තසඤ්ඤිනො සෙය්යථාපි දෙවා සුභකිණ්හා. අයං චතුත්ථා{1} විඤ්ඤාණට්ඨිති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“සන්තානන්ද, සත්තා සබ්බසො රූපසඤ්ඤානං සමතික්කමා පටිඝසඤ්ඤානං අත්ථඞ්ගමා නානත්තසඤ්ඤානං අමනසිකාරා ‘අනන්තො ආකාසො’ති ආකාසානඤ්චායතනූපගා. අයං පඤ්චමා{2} විඤ්ඤාණට්ඨිති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“සන්තානන්ද, සත්තා සබ්බසො ආකාසානඤ්චායතනං සමතික්කම්ම ‘අනන්තං විඤ්ඤාණ’න්ති විඤ්ඤාණඤ්චායතනූපගා. අයං ඡට්ඨා{3} විඤ්ඤාණට්ඨිති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“සන්තානන්ද, සත්තා සබ්බසො විඤ්ඤාණඤ්චායතනං සමතික්කම්ම ‘නත්ථි කිඤ්චී’ති ආකිඤ්චඤ්ඤායතනූපගා. අයං සත්තමා{4} විඤ්ඤාණට්ඨිති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අසඤ්ඤසත්තායතනං, නෙවසඤ්ඤානාසඤ්ඤායතනමෙව දුතියං."
                    },
                    {
                        "type": "paragraph",
                        "text": "41. තත්රානන්ද, යායං පඨමා විඤ්ඤාණට්ඨිති නානත්තකායා නානත්තසඤ්ඤිනො සෙය්යථාපි මනුස්සා එකච්චෙ ච දෙවා එකච්චෙ ච විනිපාතිකා, යො නු ඛො ආනන්ද, තඤ්ච පජානාති, තස්සා ච සමුදයං පජානාති, තස්සා ච අත්ථඞ්ගමං පජානාති, තස්සා ච අස්සාදං පජානාති, තස්සා ච ආදීනවං පජානාති, තස්සා ච නිස්සරණං පජානාති, කල්ලං නු තෙන තදභිනන්දිතුන්ති?”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තත්රානන්ද, යායං දුතියා විඤ්ඤාණට්ඨිති -පෙ- යායං තතියා විඤ්ඤාණට්ඨිති -පෙ- යායං චතුත්ථා විඤ්ඤාණට්ඨිති -පෙ- යායං පඤ්චමා විඤ්ඤාණට්ඨිති -පෙ- යායං ඡට්ඨා විඤ්ඤාණට්ඨිති -පෙ- තත්රානන්ද, යායං සත්තමා විඤ්ඤාණට්ඨිති සබ්බසො විඤ්ඤාණඤ්චායතනං සමතික්කම්ම ‘නත්ථි කිඤ්චී ති ආකිඤ්චඤ්ඤායතනූපගා, යො නු ඛො ආනන්ද, තඤ්ච පජානාති, තස්සා ච සමුදයං පජානාති, තස්සා ච අත්ථඞ්ගමං පජානාති, තස්සා ච අස්සාදං පජානාති, තස්සා ච ආදීනවං පජානාති, තස්සා ච නිස්සරණං පජානාති, කල්ලං නු තෙන තදභිනන්දිතුන්ති?”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. චතුත්ථි - සීමු, මඡසං, ස්යා, PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. පඤ්චමි - සීමු, මඡසං, ස්යා, PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ඡට්ඨි - සීමු, මඡසං, ස්යා, PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "4. සත්තමි - සීමු, මඡසං, ස්යා, PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ආනන්දය, ප්‍රථමධ්‍යානයෙන් උපන් බ්‍රහ්මකායික දෙවියෝ ය යන කායනානාත්වය ඇති (ප්‍රමාණ විසින් කයින් වෙනස් වූ), සංඥාඑකත්වය ඇති (ප්‍රථම ධ්‍යාන සංඥා විසින් සමාන වූ) සත්ත්වයෝ ඇත. මේ දෙවෙනි විඥානස්ථිතිය යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආනන්දය, ආභස්වර (විහිදෙන ප්‍රභා ඇති) දෙවියෝ ය යන (ප්‍රභා විසින්) කායඑකත්වය ඇති (අවිතර්ක විචාර - අවිතර්ක අවිචාර ධ්‍යාන විසින්) සංඥානානාත්වය ඇති සත්ව කෙනෙක් ඇත. මේ තෙවෙනි විඥානස්ථිතියයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආනන්දය, ශුභකෘත්ස්නක දෙවියෝ ය යන කායඑකත්වය ඇති (චතුර්ථ ධ්‍යාන විසින්) සංඥා එකත්වය ඇති සත්ව කෙනෙක් ඇත. මේ සතරවන විඥානස්ථිතියයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආනන්දය, හැම අයුරින් ම රූපසංඥාවන් ඉක්මීමෙන් ප්‍රතිඝසංඥාවන් පහවීමෙන්, නානාත්වසංඥාවන් නො මෙනෙහි කිරීමෙන් ‘අහස අනන්ත යැ’ යි දහන් වඩා ආකානඤ්චායතන භූමියට පැමිණි සත්වයෝ ඇත. මේ පස්වන විඥානස්ථිති ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආනන්දය, සර්වප්‍රකාරයෙන් ආකාසානඤ්චායතන ඉක්ම ‘විඥානය අනන්තයැ’යි දහන් වඩා විඤ්ඤානඤ්චායතන භූමියට පැමිණි සත්වයෝ ඇත. මේ සවන විඥානස්ථීතියයි",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආනන්දය, සර්වප්‍රකාරයෙන් විඤ්ඤානඤ්චායතනය ඉක්ම ‘කිසිත් නැතැ’ යි නාස්තිභාවප්‍රඥප්තිය වඩා ආකිඤ්චඤ්ඤායතන භූමියට පැමිණි සත්වයෝ ඇත. මේ සත්වන විඥානස්ථිතිය යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "අසංඥසත්වායතනය ආයතන විසින් පළමු වැන්නයි නේවසඥ්ඤානාසඤ්ඤායතනය ම දෙවැන්න යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "41. “ආනන්දය, ඔවුන් අතුරෙන් මනුෂ්‍යයෝ ද ඇතැම් දෙවියෝ ද, ඇතැම් විනිපාතිකයෝ ද යන නානත්තාකය නානාත්තසඤ්ඤී වූ යම් මේ ප්‍රථම විඥානස්ථිතියෙක් වේ ද, යමෙක් එයත් දනී නම් එහි සමුදයත් (පහළ වන්නට කාරණයත්) දනී නම්, එහි නිරෝධයත් දනී නම්, එහි ආශ්වාදයත් (රසයත්) දනී නම්, එහි ආදීනවයත් දනී නම්, එහි නිඃසරණයත් (එයින් නික්මීමත්) දනී නම් ඔහු විසින් එය (මම ය යි, මාගේ ය’ යි) අභිනන්දනයට (පිළිගන්නට) සුදුසු ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය නොසුදුසු යැ.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, ඔවුන් අතුරෙන් යම් මේ දෙවෙනි විඥානස්ථිතියෙක් ඇද්ද … යම් මේ තෙවෙනි විඥානස්ථිතියෙක් ඇද්ද … යම් මේ සිවුවන විඥානස්ථිතියෙක් ඇද්ද … යම් මේ පස්වන විඥානස්ථිතියෙක් ඇද්ද … යම් මේ සවන විඥානස්ථිතියෙක් ඇද්ද … ආනන්දය, ඔවුන් අතුරෙන් සියලු අයුරින් විඤ්ඤාණඤ්චායතනය ඉක්ම ‘කිසිත් නැතැ’ යි ආකිඤ්චඤ්ඤායතන භූමියට පැමිණි සත්ත්ව කෙනෙක් ඇත් නම් ඔවුන් පිළිබඳ වූ යම් මේ සත්වන විඥානස්ථිතියෙක් වේ ද, ආනන්දය, යමෙක් ඒ විඥානස්ථිතියත් දනී ද, එයට කාරණයත් දනී ද, එහි නිරෝධයත් දනී ද, එහි රසයත් දනී ද, එහි ආදීනවයත් දනී ද, එහි නිඃසරණයත් දනී ද, එසේ දන්නා වූ ඔහු විසින් එය අභිනන්දනයට සුදුසු ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය සුදුසු නො වේ ම යැ.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 106,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“තත්රානන්ද, යදිදං අසඤ්ඤසත්තායතනං, යො නු ඛො ආනන්ද, තඤ්ච පජානාති, තස්ස ච සමුදයං පජානාති, තස්ස ච අත්ථඞ්ගමං පජානාති, තස්ස ච අස්සාදං පජානාති, තස්ස ච ආදීනවං පජානාති, තස්ස ච නිස්සරණං පජානාති, කල්ලං නු තෙන තදභිනන්දිතුන්ති?”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තත්රානන්ද, යදිදං නෙවසඤ්ඤානාසඤ්ඤායතනං, යො නු ඛො ආනන්ද, තඤ්ච පජානාති, තස්ස ච සමුදයං පජානාති, තස්ස ච අත්ථඞ්ගමං පජානාති, තස්ස ච අස්සාදං පජානාති, තස්ස ච ආදීනවං පජානාති, තස්ස ච නිස්සරණං පජානාති, කල්ලං නු තෙන තදභිනන්දිතුන්ති?”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“නො හෙතං භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යතො ඛො ආනන්ද, භික්ඛු ඉමාසඤ්ච සත්තන්නං විඤ්ඤාණට්ඨිතිනං, ඉමෙසඤ්ච ද්වින්නං ආයතනානං සමුදයඤ්ච අත්ථඞ්ගමඤ්ච අස්සාදඤ්ච ආදීනවඤ්ච නිස්සරණඤ්ච යථාභූතං විදිත්වා අනුපාදා විමුත්තො හොති. අයං වුච්චතානන්ද, භික්ඛු **පඤ්ඤාවිමුත්තො**."
                    },
                    {
                        "type": "paragraph",
                        "text": "42. “අට්ඨ ඛො ඉමෙ ආනන්ද, විමොක්ඛා. කතමෙ අට්ඨ:"
                    },
                    {
                        "type": "paragraph",
                        "text": "රූපී රූපානි පස්සති. අයං පඨමො විමොක්ඛො."
                    },
                    {
                        "type": "paragraph",
                        "text": "අජ්ඣත්තං අරූපසඤ්ඤී බහිද්ධා රූපානි පස්සති. අයං දුතියො විමොක්ඛො."
                    },
                    {
                        "type": "paragraph",
                        "text": "සුභන්තෙව අධිමුත්තො හොති. අයං තතියො විමොක්ඛො."
                    },
                    {
                        "type": "paragraph",
                        "text": "සබ්බසො රූපසඤ්ඤානං සමතික්කමා පටිඝසඤ්ඤානං අත්ථඞ්ගමා නානත්තසඤ්ඤානං අමනසිකාරා ‘අනන්තො ආකාසො’ති ආකා__සා__නඤ්චායතනං උපසම්පජ්ජ විහරති. අයං චතුත්ථො විමොක්ඛො."
                    },
                    {
                        "type": "paragraph",
                        "text": "සබ්බසො ආකාසානඤ්චායතනං සමතික්කම්ම ‘අනන්තං විඤ්ඤාණ’න්ති විඤ්ඤාණඤ්චායතනං උපසම්පජ්ජ විහරති. අයං පඤ්චමො විමොක්ඛො."
                    },
                    {
                        "type": "paragraph",
                        "text": "සබ්බසො විඤ්ඤාණඤ්චායතනං සමතික්කම්ම ‘නත්ථි කිඤ්චී’ති ආකිඤ්චඤ්ඤායතනං උපසම්පජ්ජ විහරති. අයං ඡට්ඨො විමොක්ඛො."
                    },
                    {
                        "type": "paragraph",
                        "text": "සබ්බසො ආකිඤ්චඤ්ඤායතනං සමතික්කම්ම නෙවසඤ්ඤානාසඤ්ඤායතනං උපසම්පජ්ජ විහරති. අයං සත්තමො විමොක්ඛො."
                    },
                    {
                        "type": "paragraph",
                        "text": "සබ්බසො නෙවසඤ්ඤානාසඤ්ඤායතනං සමතික්කම්ම සඤ්ඤාවෙදයිතනිරොධං උපසම්පජ්ජ විහරති. අයං අට්ඨමො විමොක්ඛො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො ආනන්ද, අට්ඨ විමොක්ඛා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "“ආනන්දය, ඔවුන් අතුරෙන් යම් මේ අසංඥසත්ත්වායතනයෙක් වේද, ආනන්දය, යමෙක් එයත් දනී ද, එහි සමුදයත් දනී ද, එහි නිරෝධයත් දනී ද, එහි රසයත් දනී ද, එහි දෝෂයත් දනී ද, එහි නික්මීමත් දනී ද, ඔහු විසින් එය අභිනන්දනයට පිළිගන්නට සුදුසු ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය සුදුසු නො වේ ම යැ.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, ඔවුන් අතුරෙන් යම් මේ නේවසඤ්ඤානාසඤ්ඤායතනයෙක් වේ ද, ආනන්දය, යමෙක් එයත් දනී ද, එයට කාරණයත් දනී ද, එහි නිරෝධයත් දනී ද, එහි රසයත් දනී ද, එහි නිඃසරණයත් දනී ද, ඔහු විසින් එය පිළිගන්නට සුදුසු ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙය සුදුසු නො වේ ම යැ.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ආනන්දය, යම් කලෙක මහණ මේ විඥානස්ථිති සතේ ද මේ ආයතන දෙක්හි ද සමුදයත්, අස්තගමයත්, ආස්වාදයත්, ආදීනවයත්, නිෂ්සරණයත් තතු වූ පරිදි දැන උපාදාන රහිත ව මිදුණේ වේ ද, ආනන්දය, මේ මහණ **ප්‍රඥාවිමුක්ත** (ප්‍රඥා බලයෙන් නාම රූප කයින් මිදුණේ) යැ යි කියනු ලැබේ.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "42. “ආනන්දය, මේ විමෝක්ෂයෝ අට දෙනෙකි. කවර අට දෙනෙක් ද යත්:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "රූපී වූයේ (තමාගේ කේසාදියෙහි නීලකසිණාදී වශයෙන් ඉපිදැවූ රූපධ්‍යාන සතරෙන් එකක් ඇත්තේ තමා කෙරෙහි වූ නීලකසිණාදී) රූපයන් ධ්‍යාන ඇසින් දකී. මේ පලමු විමෝක්ෂය යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "අධ්‍යාත්මයෙහි අරූපසංඥා ඇත්තේ (තමාගේ කේසාදින්හී ඉපැදැ වූ රූපසංඥා නැත්තේ, බාහිර අරමුණෙහි පිරියම් වඩා බාහිර අරමුණෙහි ම ඉපිදැ වූ රූපධ්‍යාන ඇත්තේ) බාහිර නීලකසිණාදී රූපයන් දකි. මේ දෙවෙනි විමෝක්ෂයයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(පිරිසිදු වූ නීලාදී වර්ණකසිණ අරමුණක් ගෙන) ‘ඒ අරමුණ ශුභ යැ’ යි එහි වැදගත්තේ වෙයි. මේ තෙවෙනි විමෝක්ෂයයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හැම අයුරින් ම රූපසංඥාවන් ඉක්මීමෙන් ප්‍රතිඝසංඥාවන් පහ ව යෑමෙන් නානත්වසංඥාවන් නොමෙනෙහි කිරීමෙන් ‘අහස අනන්ත’ යැ යි ආකාසානඤ්චායතනයට පැමිණ වෙසෙයි. මේ සිවුවන විමොක්ෂයයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හැම අයුරින් ම ආකාසානඤ්චායතනය ඉක්ම ‘විඥානය අනන්ත යැ’ යි විඥානඤ්චායතනයට පැමිණ වෙසෙයි. මේ පස්වන විමෝක්ෂයයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හැම අයුරින් ම විඥානඤ්චායතනය ඉක්ම ආකිඤ්චඤ්ඤායතන යට පැමිණ වෙසෙයි. මේ සවන විමෝක්ෂයයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හැම අයුරින් ම ආකිඤ්චඤ්ඤායතන ධ්‍යානය ඉක්ම නේවසඤ්ඤානාසඤ්ඤායතනට පැමිණ වෙසෙයි. මේ සත්වන විමෝක්ෂයයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හැම අයුරින් ම නේවසඤ්ඤානාසඤ්ඤායතනය ඉක්ම සඤ්ඤාවේදයිත නිරෝධයට පැමිණ වෙසෙයි. මේ අට වන විමෝක්ෂයයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආනන්දය, මේ විමෝක්ෂ අට යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 108,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“යතො ඛො ආනන්ද, භික්ඛු ඉමෙ අට්ඨ විමොක්ඛෙ අනුලොමම්පි සමාපජ්ජති, පටිලොමම්පි සමාපජ්ජති, අනුලොමපටිලොමම්පි සමාපජ්ජති, යත්ථිච්ඡකං යදිච්ඡකං යාවතිච්ඡකං සමාපජ්ජති පි වුට්ඨාති පි, ආසවානඤ්ච ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති, අයං වුච්චතානන්ද, භික්ඛු **උභතොභාගවිමුත්තො**. ඉමාය ච ආනන්ද, උභතොභාගවිමුත්තියා අඤ්ඤා උභතොභාගවිමුත්ති උත්තරීතරා වා පණීතතරා වා නත්ථී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදමවොච භගවා. අත්තමනො ආයස්මා ආනන්දො භගවතො භාසිතං අභිනන්දීති."
                    },
                    {
                        "type": "centered",
                        "text": "මහානිදානසුත්තං නිට්ඨිතං දුතියං.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "“ආනන්දය, යම් කලෙක මහණ තෙම මේ අෂ්ට විමෝක්ෂයන් අනුලොම්විසිනුත් (මුල පටන් අවසන දක්වාත්) සමවදී ද, පිළිලොම්විසිනුත් (අග සිට මුල දක්වාත්) සමවදී ද, අනුලොම්පිළිලොම් විසිනුත් සමවදී ද කැමැති තැනෙක, කැමැති සමවතකට, කැමැති තාක් කල් සමවැදීමත් එයින් නැගී සිටීමත් කෙරේ ද, ආස්‍රවයන් ද ක්ෂය කිරීමෙන් ආනාසුව වූ චිත්තවිමුක්තිය (ඵලසමාධිය) ද ප්‍රඥාවිමුක්තිය (ඵළඥානය) ද මේ අත්බව්හි ම තෙමේ වෙසෙසි නුවණින් දැන පසක් කොට සපයා වෙසේ ද, ආනන්දය, මේ මහණ **උභතෝභාගවිමුක්ත** (අරූපසමාපත්තියෙන් රූපකාය කෙරෙන් ද, මාර්ගයෙන් නාමකාය කෙරෙන් දැයි දෙපසින් ම මිදුණේ) යැ යි කියනු ලැබේ. ආනන්දය, මේ උභතෝභාගවිමුක්තියෙන් උත්තරීතර (මෙයට වැඩි තරම්) වූ ප්‍රණීතතර (මෙයට වඩා උතුම්) වූ උභතෝභාග විමුක්තියෙක් නැත.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. ආයුෂ්මත් අනඳ තෙරණුවෝ ආරාධිත සිත් ඇත්තාහු භාග්‍යවතුන් වහන්සේගේ වචනය පිළිගත්හ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 16,
                        "text": "දෙවැනි මහානිදාන සූත්‍රය නිමියේ යි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ],
    "bookId": 11,
    "pageOffset": 0,
    "collection": "mula"
}