{
    "filename": "dn-2-5",
    "bookId": 11,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 306,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5.",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "ජනවසභසුත්තං",
                        "level": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "1. එවං මෙ සුතං: එකං සමයං භගවා නාතිකෙ{1} විහරති ගිඤ්ජකාවසථෙ. තෙන ඛො පන සමයෙන භගවා පරිතො පරිතො ජනපදෙසු පරිචාරකෙ අබ්භතීතෙ කාලකතෙ උපපත්තීසු බ්යාකරොති, කාසිකොසලෙසු වජ්ජිමල්ලෙසු චෙතිවංසෙසු{2} කුරුපඤ්චාලෙසු මච්ඡසූරසෙනෙසු අසු අමුත්ර උපපන්නො අසු අමුත්ර උපපන්නො ති. පරොපඤ්ඤාසං නාතිකියා පරිචාරකා අබ්භතීතා කාලකතා පඤ්චන්නං ඔරම්භාගියානං සඤ්ඤොජනානං පරික්ඛයා ඔපපාතිකා තත්ථ පරිනිබ්බායිනො අනාවත්තිධම්මා තස්මා ලොකා. සාධිකා නවුති නාතිකියා පරිචාරකා අබ්භතීතා කාලකතා තිණ්ණං සඤ්ඤොජනානං පරික්ඛයා රාගදොසමොහානං තනුත්තා සකදාගාමිනො සකිදෙව{3} ඉමං ලොකං ආගන්ත්වා දුක්ඛස්සන්තං කරිස්සන්ති, සාතිරෙකානි පඤ්චසතානි නාතිකියා පරිචාරකා අබ්භතීතා කාලකතා, තිණ්ණං සඤ්ඤොජනානං පරික්ඛයා සොතාපන්නා අවිනිපාතධම්මා නියතා සම්බොධිපරායණා’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. අස්සොසුං ඛො නාතිකියා පරිචාරකා: භගවා කිර පරිතො පරිතො ජනපදෙසු පරිචාරකෙ අබ්භතීතෙ කාලකතෙ උපපත්තීසු බ්යාකරොති කාසිකොසලෙසු වජ්ජිමල්ලෙසු චෙතිවංසෙසු කුරුපඤ්චාලෙසු මච්ඡසූරසෙනෙසු අසු අමුත්ර උපපන්නො අසු අමුත්ර උපපන්නො’ති. පරොපඤ්ඤාසං නාතිකියා පරිචාරකා අබ්භතීතා කාලකතා පඤ්චන්නං ඔරම්භාගියානං සඤ්ඤොජනානං පරික්ඛයා ඔපපාතිකා තත්ථ පරිනිබ්බායිනො අනාවත්තිධම්මා තස්මා ලොකා. සාධිකා නවුති නාතිකියා පරිචාරකා අබ්භතීතා කාලකතා තිණ්ණං සඤ්ඤොජනානං පරික්ඛයා රාගදොසමොහානං තනුත්තා සකදාගාමිනො සකිදෙව ඉමං ලොකං ආගන්ත්වා දුක්ඛස්සන්තං කරිස්සන්ති. සාතිරෙකානි පඤ්චසතානි නාතිකියා පරිචාරකා අබ්භතීතා කාලකතා තිණ්ණං සඤ්ඤොජනානං පරික්ඛයා සොතාපන්නා අවිනිපාතධම්මා නියතා සම්බොධිපරායණා”ති. තෙන ච නාතිකියා පරිචාරකා අත්තමනා අහෙසුං පමුදිතා පීතිසොමනස්සජාතා භගවතො පඤ්හවෙය්යාකරණං{4} සුත්වා."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. නාදිකෙ - සීමු. ස්යා. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. චෙතියවංසෙසු - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. සකිංදෙවං - (කා.)"
                    },
                    {
                        "type": "footnote",
                        "text": "4. පඤ්හාවෙය්යාකරණං - (ස්යා කා)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "5.",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "ජනවසභ සූත්‍රය",
                        "level": 3
                    },
                    {
                        "format": 13,
                        "text": "1. මා විසින් මෙසේ අසන ලදී: එක් සමයෙක භාග්‍යවතුන් වහන්සේ ඥාතිකා ගමැ ගෙඩිගෙහි වැඩ වසන සේක. එ සෙමෙහි භාග්‍යවතුන් වහන්සේ කාසි කෝසල වජ්ජිමල්ල චේති වංස කුරු පඤ්චාල මච්ඡ සූරසේන යන වටා වටා දනවුහි ඉකුත් කලැ වුසූ කලුරිය කළ උවසුවන් ඇරැබැ ‘අසෝ තැනැත්තේ අසෝ තැනැ උපන, අසෝ තැනැත්තේ අසෝ තැනැ උපනැ’ යි ඔවුන්ගේ උපපත්ති විෂයයෙහි කරුණු හෙළි කැරැ වදාරන සේක. ඥාතිකාවාසි වූ ද පනසකට වැඩි තරම් වූ, ඉකුත් කලැ වූ, කලුරිය කළ උවසුවෝ අවරභාගික සංයෝජන පස නැසූ හෙයින් ඒ ශූද්ධාවාසයෙහි උපන්නාහු, එහි ම පිරිනිවෙනසුලු වූවාහු, එ ලොවින් වටාලා නො එන සුලු වෙත්. ඉකුත් කලැ සිටි, කලුරිය කළ, ඥාතිකාග්‍රාමවාසී අධිකයක් සහිත අනූවක් (අනූවකට වැඩි) උවසුවෝ, තුන් සංයෝජනයන් නැසූ හෙයින් රාග ද්වේෂ මෝහ තුනී වූ හෙයින්, සෙදැගැමි වූවාහු, එක් වරක් ම මෙලොවට අවුත් දුක් කෙළවර කරන්නාහ. අතිරේකයක් සහිත පන්සීයක් ඥාතිකාවාසී උපාසකයෝ ඉකුත් කලැ සිට කලුරිය කළාහු, තුන් සංයෝජනයන් නැසූ හෙයින් සෝවාන් වූවාහු, අපායට නොවැටෙන සුලු වූවාහු, රහත්බවට නියත වූවාහු, රහත් බව පිහිට කොටැත්තාහු වෙත්” යි ද වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "2. “භාග්‍යවතුන් වහන්සේ කාසි කෝසල දෙ රටෙහි ද වජ්ජි මල්ල දෙ රටෙහි චේතී වංස දෙ රටෙහි ද කුරු පංචාල දෙ රටෙහි ද මච්ඡ සූරසේන දෙ රටෙහි ද යන වටා වටා දනවුහි ළඟ ඉකුත් කලැ සිටි, කලුරිය කළ උවසුවන් ‘අසෝ තැනැත්තේ අසෝ තැනැ උපන, අසෝ තැනැත්තේ අසෝ තැනැ උපනැ’ යි උපපත්ති නිමිත්තෙන් ඔවුන් (මරණින් පසු තතු) හෙළි කරන සේක. ළඟ ඉකුත් කලැ සිටි, කලුරිය කළ ඥාතිකාවාසී පනසකට වැඩි ගණනක් උවසුවෝ, අවරභාගික සංයෝජන පස නැසූ හෙයින් ශුද්ධාවාසයෙහි උපන්නාහු, එහි දී පිරිනිවෙන සුලු වූවාහු, වටාලා එයින් මෙහි නො එන සුලු වෙත්. ඉකුත් කලැ සිටි, කලුරිය කළ, ඥාතිකාවාසී අනූවකට වැඩි ගණනක් උවසුවෝ තුන් සංයෝජන නැසූයෙන්, රාග ද්වේෂ මෝහ තුනී වූයෙන්, සෙද ගැමි වූවාහු, එක් වරක් ම මෙ ලොවට අවුත් දුක් කෙළවර කරන්නාහ. ඉකුත් කලැ, සිටි, කලුරිය කළ පන්සියකට වැඩි ගණනක් ඥාතිකාවාසී උවසුවෝ, තුන් සංයෝජන නැසූයෙන් සෝවාන් වූවාහු, අපායට නොවැටෙන සුලු වූවාහු, රහත් බවට නියත වූවාහු, රහත්ඵලය ප්‍රතිෂ්ඨා කොටැත්තාහු වෙත් යැ යි වදාරන සේකැ” යි ඥාතිකාග්‍රාමවාසී උපාසකයෝ භගවත් බුදුරජුන්ගේ ප්‍රශ්නව්‍යාකරණය අසා එයින් ද ගන්නා ලද සිතැත්තාහු, සතුටු වූවාහු, හටගත් ප්‍රීති හා සොම්නස් හා ඇත්තෝ වූහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 308,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "3. අස්සොසි ඛො ආයස්මා ආනන්දො: භගවා කිර පරිතො පරිතො ජනපදෙසු පරිචාරකෙ අබ්භතීතෙ කාලකතෙ උපපත්තීසු බ්යාකරොති. කාසිකොසලෙසු වජ්ජිමල්ලෙසු චෙතිවංසෙසු කුරුපඤ්චාලෙසු මච්ඡසූරසෙනෙසු අසු අමුත්ර උපපන්නො අසු අමුත්ර උපපන්නො ති. පරොපඤ්ඤාසනාතිකියා පරිචාරකා අබ්භතීතා කාලකතා පඤ්චන්නං ඔරම්භාගියානං සඤ්ඤොජනානං පරික්ඛයා ඔපපාතිකා තත්ථ පරිනිබ්බායිනො අනාවත්තිධම්මා තස්මා ලොකා. සාධිකා නවුති නාතිකිෙයා පරිචාරකා අබ්භතීතා කාලකතා තිණ්ණං සඤ්ඤොජනානං පරික්ඛයා රාගදොසමොහානං තනුත්තා සකදාගාමිනො සකිදෙව ඉමං ලොකං ආගන්ත්වා දුක්ඛස්සන්තං කරිස්සන්ති, සාතිරෙකානි පඤ්චසතානි නාතිකියා පරිචාරකා අබ්භතීතා කාලකතා තිණ්ණං සඤ්ඤොජනානං පරික්ඛයා සොතාපන්නා අවිනිපාතධම්මා නියතා සම්බොධිපරායණා ති. තෙන ච නාතිකියා පරිචාරකා අත්තමනා අහෙසුං පමුදිතා පීතිසොමනස්සජාතා භගවතො පඤ්හවෙය්යාකරණං සුත්වා”ති."
                    },
                    {
                        "type": "centered",
                        "text": "ආනන්ද පරිකථා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "4. අථ ඛො ආයස්මතො ආනන්දස්ස එතදහොසි: ඉමෙ ඛො පනාපි{1} අහෙසුං මාගධකා පරිචාරකා බහූ චෙව රත්තඤ්ඤූ ච අබ්භතීතා කාලකතා. සුඤ්ඤා මඤ්ඤෙ අඞ්ගමගධා අඞ්ගමාගධකෙහි{2} පරිචාරකෙහි අබ්භතීතෙහි කාලකතෙහි. තෙ ඛො පනාපි අහෙසුං බුද්ධෙ පසන්නා ධම්මෙ පසන්නා සඞ්ඝෙ පසන්නා සීලෙසු පරිපූරකාරිනො. තෙ අබ්භතීතා කාලකතා භගවතා අබ්යාකතා. තෙසම්පස්ස{3} සාධු වෙය්යාකරණං. බහුජනො පසීදෙය්ය තතො ගච්ඡෙය්ය සුගතිං. අයං ඛො පනාපි අහොසි රාජා මාගධො සෙනියො බිම්බිසාරො ධම්මිකො ධම්මරාජා හිතො බ්රාහ්මණගහපතිකානං නෙගමානඤ්චෙව ජානපදානඤ්ච. අපිස්සුදං මනුස්සා කිත්තයමානරූපා විහරන්ති ‘එවං නො සො ධම්මිකො ධම්මරාජා සුඛාපෙත්වා කාලකතො, එවං මයං තස්ස ධම්මිකස්ස ධම්මරඤ්ඤො විජිතෙ ඵාසු{4} විහරිම්හා’ති. සො ඛො පනාපි අහොසි බුද්ධෙ පසන්නො ධම්මෙ පසන්නො සඞ්ඝෙ පසන්නො සීලෙසු පරිපූරකාරී. අපිස්සුදං මනුස්සා එවමාහංසු ‘යාව මරණකාලාපි රාජා මාගධො සෙනියො බිම්බිසාරො භගවන්තං කිත්තයමානරූපො කාලකතො’ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පනපි - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අඞ්ගමාගධිකෙහි - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. තෙසම්පිස්ස - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. ඵාසුකං - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "3. “භාග්‍යවතුන් වහන්සේ කාසි කෝසල දෙ රටෙහි ද වජ්ජි මල්ල දෙ රටෙහි ද චේතී වංස දෙ රටෙහි ද කුරු පංචාල දෙ රටෙහි ද මච්ඡ සූරසෙන දෙ රටෙහිද යන වටා වටා දනවුහි ළඟ ඉකුත් කලැ සිටි කලුරිය කළ උවසුවන් ‘අසෝ තැනැත්තේ අසෝ තැනැ උපන, අසෝ තැනැත්තේ අසෝ තැන උපනැ’ යි ද උපපත්ති නිමිත්තෙන් (ඔවුන්ගේ මරණින් පසු ගතිය) හෙළි කරන සේක. ඉකුත් කලැ සිටි, කලුරිය කළ ඥාතිකාවාසි වූ පනසකට වැඩි ගණනක් උවසුවෝ අවරභාගික සංයෝජන පස නැසූ හෙයින් ශුද්ධාවාසයෙහි උපන්නාහු, එහි දී පිරිනිවෙන සුලු වූවාහු, වටාලා එයින් මෙහි නොඑන සුලු වෙතැ යි ද, ඉකුත් කලැ සිටි කලුරිය කළ ඥාතිකවාසී අනූවකට වැඩි ගණනක් උවසුවෝ තුන් සංයෝජන නැසූ හෙයින්, රාග ද්වේෂ මෝහ තුනී වූ හෙයින් සෙදැගැමි වූවාහු, එක් වරක් ම මෙ ලොවට අවුත් දුක් කෙළවර කරන්නාහ’ යි ද, ළඟ ඉකුත් කලැ සිටි, කලුරිය කළ පන්සියයකට වැඩි ගණනක් ඥතිකාවාසී උවසුවෝ තුන් සංයෝජන නැසූ හෙයින් සෝවාන් වූවාහු, අපායට නොවැටෙන සුලු වූවාහු, රහත් බවට නියත වූවාහු, රහත්ඵලය ප්‍රතිෂ්ඨා කොටැති යාහු වෙතැයි ද වදාරන සේක් ල, භාග්‍යවතුන් වහන්සේගේ ප්‍රශ්නව්‍යාකරණය අසා එයින් ඥාතිකාවාසී උවසුවෝ ආරාධිත සිතැත්තාහු, සතුටු වූවාහු, හටගත් ප්‍රීති හා සොම්නස් හා ඇත්තාහු ද වෙත් ලැ” යි අනඳ තෙරණුවෝ ඇසූහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "ආනන්ද පරිකථාව",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "4. එ කල්හි වනාහි අනඳ තෙරුනට මේ සිත විය: “ළඟ ඉකුත් කලැ සිටි, කලුරිය කළ, මගද රටැ වැසි චිරරාත්‍රඥ බොහෝ උවසුවෝ ද වූහ. ළඟ ඉකුත් කලැ සිට කළුරිය කළ අඟු මගද දෙරටැ වුසූ (අරීසවු) උවසුවන්ගෙන් මෙ දෙ රට හිස් වූ නියා යැ (හිස් වූවාක් මෙන් අන්‍යයනට පෙනෙයි). ඒ අඟු මගද දෙර ටැ වැසියෝ ද බුදුරජුන් කෙරෙහි පහන් ද දහම්හි පහන් ද සඟුන් කෙරෙහි පහන් ද සිල් පුරන සුලුද වූහ. ළඟ ඉකුත් කලැ කලුරිය කළ ඔහු භාග්‍යවතුන් වහන්සේ විසින් නො ම හෙළි කරන ලදූහ. ඔවුන්ගේ ද උපපත්තිය හෙළි කරනු මනා යැ. බොහෝ දෙනා පහදිනු ඇත. එයින් සුගතියට යනු ඇත. මේ මගධාධිපති ශ්‍රේණික බිම්බිසාර රජ ධාර්මික ද ධර්මරාජ ද බමුණු ගැහැවියනටත් නිගමවාසී ජනපදවාසී ජනයාටත් හිතකාමීද විය. මිනිස්සුද දැහැමි වූ, දැහැමින් රැජැයූ අපේ රජ රට සුවපත් කොට මෙසේ කලුරිය කෙළේ යැ’ යි ද, ‘මෙසේ අපි දැහැමි වූ දැහැමෙන් රජ වූ ඔබේ රටැ සුව සේ වුසූම්භ’ යි ද, එ රජුහු ගුණ වණන්නාහු ද වෙසෙත්. ඒ රජ ද බුදුරජුන් කෙරෙහි පහන් ද දහම්හි පහන් ද සඟුන් කෙරෙහි පහන් ද සිල් පුරන සුලු ද විය. කලුරිය කරන තෙක් දු මගධාධිපති ශ්‍රේණික බිම්බිසාර රජ භාග්‍යවතුන් වහන්සේගේ ගුණ වණන සුලු වැ වැස කලුරිය කෙළේ යැ’ යි මිනිස්සු ද මෙසේ කියත්. ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 310,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සො අබ්භතීතො කාලකතො භගවතා අබ්යාකතො. තස්ස පස්ස සාධු වෙය්යාකරණං. බහුජනො පසීදෙය්ය, තතො ගච්ඡෙය්ය සුගතිං. භගවතො ඛො පන සම්බොධි මගධෙසු. යත්ථ ඛො භගවතො සම්බොධි මගධෙසු, කථං තත්ථ භගවා මාගධකෙ පරිචාරකෙ අබ්භතීතෙ කාලකතෙ උපපත්තීසු න බ්යාකරය්ය? භගවා චෙව ඛො පන මාගධකෙ පරිචාරකෙ අබ්භතීතෙ කාලකතෙ උපපත්තීසු න බ්යාකරෙය්ය දීනමනා තෙනස්සු මාගධකා පරිචාරකා. යෙන ඛො පනස්සු දීනමනා මාගධකා පරිචාරකා කථං තෙ භගවා න බ්යාකරෙය්යාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "5. ඉදමායස්මා ආනන්දො මාගධකෙ පරිචාරකෙ ආරබ්භ එකො රහො අනුවිචින්තෙත්වා රත්තියා පච්චූසසමයං පච්චුට්ඨාය යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා ආනන්දො භගවන්තං එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සුතම්මෙතං භන්තෙ භගවා කිර පරිතො පරිතො ජනපදෙසු පරිචාරකෙ අබ්භතීතෙ කාලකතෙ උපපත්තීසු බ්යාකරොති කාසිකොසලෙසු වජ්ජිමල්ලෙසු චෙතිවංසෙසු කුරුපඤ්චාලෙසු මච්ඡසූරසෙනෙසු. අසු අමුත්ර උපපන්නො අසු අමුත්ර උපපන්නො ති. පරොපඤ්ඤාසං නාතිකියා පරිචාරකා අබ්භතීතා කාලකතා පඤ්චන්නං ඔරම්භාගියානං සඤ්ඤොජනානං පරික්ඛයා ඔපපාතිකා තත්ථ පරිනිබ්බායිනො අනාවත්තිධම්මා තස්මා ලොකා. සාධිකා නවුති නාතිකියා පරිචාරකා අබ්භතීතා කාලකතා තිණ්ණං සඤ්ඤොජනානං පරික්ඛයා රාගදොසමොහානං තනුත්තා සකදාගාමිනො සකිදෙව ඉමං ලොකං ආගන්ත්වා දුක්ඛස්සන්තං කරිස්සන්ති. සාතිරෙකානි පඤ්චසතානි නාතිකියා පරිචාරකා අබ්භතීතා කාලකතා තිණ්ණං සඤ්ඤොජනානං පරික්ඛයා සොතාපන්නා අවිනිපාතධම්මා නියතා සම්බොධිපරායණාති. තෙන ච නාතිකියා පරිචාරකා අත්තමනා අහෙසුං පමුදිතා පීතිසොමනස්සජාතා භගවතො පඤ්හවෙය්යාකරණං සුත්වාති. ඉමෙ ඛො පනාපි භන්තෙ අහෙසුං මාගධකා පරිචාරකා බහූ චෙව රත්තඤ්ඤූ ච අබ්භතීතා කාලකතා සුඤ්ඤා මඤ්ඤෙ අඞ්ගමගධා අඞ්ගමාගධකෙහි පරිචාරකෙහි අබ්භතීතෙහි කාලකතෙහි. තෙ ඛො පනාපි භන්තෙ අහෙසුං බුද්ධෙ පසන්නා ධම්මෙ පසන්නා සඞ්ඝෙ පසන්නා සීලෙසු පරිපූරකාරිනො. තෙ අබ්භතීතා කාලකතා භගවතා අබ්යාකතා."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "හේ ළඟ ඉකුත් කල්හි කලුරිය කෙළේ, භාග්‍යවතුන් වහන්සේ විසින් (මොහුගේ උපපත්තිය මෙසේ යැයි) නො ම හෙළිකරන ලද්දේය. ඔහුගේ උපපත්තිය ද හෙළි කරනු මනා යැ. බොහෝ දෙනා පහදිනු ඇත. එයින් සුගතියට යනු ඇත. භාග්‍යවතුන් වහන්සේගේ සම්බෝධිය මගද රටෙහි විය. යම් මගද රටෙක භාග්‍යවතුන් වහන්සේගේ සම්බෝධිය වී ද, එහි සමීපාතීත වූ කලුරිය කළ උවසුවන් කෙසේ නම් භාග්‍යවතුන් වහන්සේ (ඔවුන්ගේ) උපපත්තීන් නිමිත්තෙන් නො ම හෙළි කළ යුතු වන සේක් ද? භාග්‍යවතුන් වහන්සේ වනාහි සමීපාතීතයෙහි කලුරිය කළ මගද රට වැසි උවසුවන් ඔවුන්ගේ උපපත්ති නිමිත්තෙන් නො හෙළි කරන සේක් වූ නම්, එයින් මගද රටැ වැසි උවසුවෝ බැගෑපත් සිතැති වන්නාහ. මගද රටැ වැසි උවසුවෝ යම් කරුණෙකින් බැගැපත් සිතැති වන්නාහු ද, භාග්‍යවතුන් වහන්සේ කෙසේ නම් ඒ (උපපත්ති නිමිත්තෙන්) උවසුවන් හෙළි නො කරන සේක් ද? යනු යැ."
                    },
                    {
                        "format": 13,
                        "text": "5. අනඳ තෙරණුවෝ මගද රටැ වැසි උවසුවන් ඇරැබැ හුදෙකලා වැ රහසිගත වැ මෙසේ පුනපුනා සිතා, රෑ අලුය මැ නැඟී සිට, භගවත් බුදුරජුන් කරා එළැඹියාහ. එළැඹ ඔබ වැඳ, පසෙකැ හිඳගත්හ. පසෙකැ හිඳ ම භගවත් බුදුරජුනට මෙ බස් පැවැසූහ:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, භාග්‍යවතුන් වහන්සේ කාසි කෝසල දෙ රටෙහි ද වජ්ජි මල්ල දෙ රටෙහි ද චේතී වංස දෙ රටෙහි ද කුරු පංචාල දෙ රටෙහි ද මච්ඡ සූරසේන දෙ රටෙහි ද යන වටා වටා දනවුහි ළඟ ඉකුත් කලැ සිටි, කලුරිය කළ උවසුවන් ‘අසෝ තැනැත්තේ අසෝ තැනැ උපන, අසෝ තැනැත්තේ අසෝ තැනැ උපනැ’ යි උපපත්ති නිමිත්තෙන් (ඔවුන් මරණින් පසු තතු) හෙළි කරන සේක. ළඟ ඉකුත් කලැ සිටී, කලුරිය කළ ඥාතිකාවාසී පනසකට වැඩි ගණනෙක් උවසුවෝ අවරභාගික සංයෝජන පස නැසූයෙන් ශුද්ධාවාසයෙහි උපන්නාහු, එහි දී පිරිනිවෙන සුලු වූවාහු, වටාලා එයින් මෙහි නො එන සුලු වෙත්. ඉකුත් කලැ සිටී, කලුරිය කළ, ඥාතිකාවාසී අනූවකට වැඩි ගණනක් උවසුවෝ, තුන් සංයෝජන නැසූයෙන්, රාග ද්වේෂ මෝහ තුනී වූයෙන්, සෙදගැමි වූවාහු, එක් වරක් ම මෙ ලොවට අවුත් දුක් කෙළවර කරන්නාහ. ඉකුත් කලැ සිටි, කලුරිය කළ, පන්සියයට වැඩි ගණනක් ඥාතිකවාසී උවසුවෝ, තුන් සංයෝජන නැසූයෙන්, සෝවාන් වූවාහු, රහත් ඵලය ප්‍රතිෂ්ඨා කොටැත්තාහු වෙත්” යැ යි වඳාරන සේක. එයින් ඥාතිකාවාසී උවසුවෝ භාග්‍යවතුන් වහන්සේගේ ප්‍රශ්න ව්‍යාකරණය අසා ආරාධිත සිතැත්තෝ ප්‍රමුදිතයෝ උපන් ප්‍රීති හා සොම්නස් හා ඇත්තෝ වූහ. වහන්ස, ළඟ ඉකුත් කලැ කලුරිය කළ මගද රටැ වැසි චිරරාත්‍රඥ වූ මේ බොහෝ උවසුවෝ වූහ. අඟු මගද දෙරට ළඟ ඉකුත් කලැ කලුරිය කළ අඟුමගද වැසි උවසුවන් ගෙන් හිස් වූ සේ ය. වහන්ස, ඔහු ද බුදු රජු කෙරෙහි පැහැදුණා වූ, දහම්හි පැහැදුණාහු, සඟන කෙරෙහි පැහැදුණාහු, සිල් පුරන්නාහු වූහ. ළඟ ඉකුත් කලැ කලුරිය කළ ඔහු භාග්‍යවතුන් වහන්සේ විසින් නො හෙළි කරන ලදහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 312,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තෙසම්පස්ස සාධු වෙය්යාකරණං, බහුජනො පසීදෙය්ය තතො ගච්ඡෙය්ය සුගතිං. අයං ඛො පනාපි භන්තෙ, අහොසි රාජා මාගධො සෙනියො බිම්බිසාරො ධම්මිකො ධම්මරාජා හිතො බ්රාහ්මණගහපතිකානං නෙගමානඤ්චෙව ජානපදානඤ්ච. අපිස්සුදං මනුස්සා කිත්තයමානරූපා විහරන්ති. ‘එවං නො සො ධම්මිකො ධම්මරාජා සුඛාපෙත්වා කාලකතො, එවං මයං තස්ස ධම්මිකස්ස ධම්මරඤ්ඤො විජිතෙ ඵාසු විහරිම්හා’ති. සො ඛො පනාපි භන්තෙ, අහොසි බුද්ධෙ පසන්නො ධම්මෙ පසන්නො සඞ්ඝෙ පසන්නො සීලෙසු පරිපූරකාරී. අපිස්සුදං මනුස්සා එවමාහංසු ‘යාව මරණකාලා පි රාජා මාගධො සෙනියො බිම්බිසාරො භගවන්තං කිත්තයමානරූපො කාලකතො’ති. සො අබ්භතීතො කාලකතො භගවතා අබ්යාකතො, තස්ස පස්ස සාධු වෙය්යාකරණං බහුජනො පසීදෙය්ය තතො ගච්ඡෙය්ය සුගතිං, භගවතො ඛො පන භන්තෙ, සම්බොධි මගධෙසු. යත්ථ ඛො පන භන්තෙ, භගවතො සම්බොධි මගධෙසු කථං තත්ථ භගවා මාගධකෙ පරිචාරකෙ අබ්භතීතෙ කාලකතෙ උපපත්තීසු න බ්යාකරෙය්ය. භගවා චෙ ඛො පන භන්තෙ, මාගධකෙ පරිචාරකෙ අබ්භතීතෙ කාලකතෙ උපපත්තීසු න බ්යාකරෙය්ය, දීනමනා{1} තෙනස්සු මාගධකා පරිචාරකා. යෙන ඛො පනස්සු භන්තෙ දීනමනා මාගධකා පරිචාරකා, කථං තෙ භගවා න බ්යාකරෙය්යා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදමායස්මා ආනන්දො මාගධකෙ පරිචාරකෙ ආරබ්භ භගවතො සම්මුඛා පරිකථං කත්වා උට්ඨායාසනා භගවන්තං අභිවාදෙත්වා පදක්ඛිණං කත්වා පක්කාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "6. අථ ඛො භගවා අචිරපක්කන්තෙ ආයස්මන්තෙ ආනන්දෙ පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය නාතිකං පිණ්ඩාය පාවිසි. නාතිකෙ පිණ්ඩාය චරිත්වා පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො පාදෙ පක්ඛාලෙත්වා ගිඤ්ජකාවසථං පවිසිත්වා මාගධකෙ පරිචාරකෙ ආරබ්භ අට්ඨිකත්වා මනසි කත්වා සබ්බං චෙතෙසා සමන්නාහරිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදි “ගතිං ෙතසං ජානිස්සාමි අභිසම්පරායං යංගතිකා තෙ භවන්තො යංඅභිසම්පරායා”ති. අද්දසා ඛො භගවා මාගධකෙ පරිචාරකෙ යංගතිකා තෙ භවන්තො යංඅභිසම්පරායාති. අථ ඛො භගවා සායන්හසමයං පටිසල්ලානා වුට්ඨිතො ගිඤ්ජකාවසථා නික්ඛමිත්වා විහාරපච්ඡායායං පඤ්ඤත්තෙ ආසනෙ නිසීදි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. නිනනමනා - ස්යා. දීනමානා - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ඔවුන්ගේ ද (උප්පත්තිය) හෙළි කිරීම වේ වා යි යදිම්. එයින් බොහෝ දෙනා පහදිනු ඇත. සුගතියට යනු ඇත. වහන්ස, මගධාධිපති වූ මේ ශ්‍රේණික බිම්බිසාර රජ දැහැමි විය, දැහැමෙන් රජයන්නේ විය. බමුණනට ද ගැහැවියනට ද නියම්ගම්වැසියනට ද දනවු වැසියනට ද වැඩ කැමැති විය. තව ද මිනිස්සු ‘මෙසේ ඒ දහැමි වූ, දැහැමෙන් රැජැයූ බිම්සර රජ අප සුව පත් කොට කලුරිය කෙළේ ය. මෙසේ අපි දැහැමෙන් රැජැයූ ඒ දැහැමි රජුගේ රටෙහි පහසුවෙන් වුසුම්හ’ යි ඔහු ගුණ වණන සුලු ව වෙසෙත්. වහන්ස, තව ද එ රජ බුදුරජාණන් වහන්සේ කෙරෙහි පැහැදුණෙක, දහමෙහි පැහැදුණෙක, සඟන කෙරෙහි පැහැදුණෙක, සිල් පිරූයෙක. තව ද මිනිස්සු ‘මියැ යන තාක් ම මගධාධිපති වූ ශ්‍රේණික බිම්බිසාර රජ භාග්‍යවතුන් වහන්සේ වර්ණනා කරන සුලු වැ වැස කලුරිය කෙළේ යැ’ යි මෙසේ කියත්. ළඟ ඉකුත් කලැ සිටි, කලුරිය කළ හෙ තෙමෙ භාග්‍යවතුන් වහන්සේ විසින් හෙළි නො කරන ලදී. ඔහුගේ ද උපපත්තිය හෙළි කිරීම වේව යි යදිම්. බොහෝ දෙනා පහදිනු ඇත. එයින් සුගතියට යනු ඇත. වහන්ස, භාග්‍යවතුන් වහන්සේගේ සම්බෝධිය (බුදු බව ලැබීම) වූයේ මගද රටෙහි ය. වහන්ස, යම් මගද රටෙක භාග්‍යවතුන් වහන්සේගේ සම්බෝධිය වී නම්, එ මගද රටැ වුසූ, ළඟ ඉකුත් කල්හි වූ, කලුරිය කළ උවසුවන් කෙසේ නම් උපපත්තිය නිමිත්තෙන් හෙළි නො කරන සේක් ද? වහන්ස, ඉදින් භාග්‍යවතුන් වහන්සේ ළඟ ඉකුත් කල්හි වූ, කලුරිය කළ මගද රටැ වුසූ උවසුවන් උපපත්ති නිමිත්තෙන් හෙළි නො කරන සේක් වී නම්, මගද රටැ වැසි උවසුවෝ එයින් බැගෑපත් සිතැත්තෝ වන්නාහ. වහන්ස, යම් හෙයකින් මගද රටැ වැසි උවසුවෝ බැගෑපත් සිතැත්තෝ වන්නාහු නම්, කෙසේ නම් භාග්‍යවතුන් වහන්සේ ඔවුන් (උපපත්ති නිමිත්තෙන්) හෙළි නො කරන සේක් ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "අනඳ තෙරණුවෝ මගද රටැ වැසි උවසුවන් ඇරැබැ භගවත් බුදුරජුන් හමුයෙහි මේ විස්තර කථාව කොට, හුනස්නෙන් නැඟී, ඔබ වැඳ පැදැකුණු කොට නික්මියාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "6. එ කලැ, භාග්‍යවතුන් වහන්සේ අනඳ තෙරුන් නික්මැ ගිය නොබෝ කල්හි, පෙර වරු සමයෙහි හැඳ පෙරෙ වැ පා සිවුරු ගෙන, ඥාතික ගමට පිඬු පිණිස පිවිසි සේක. ඥාතික ගමෙහි පිඬු පිණිස හැසිර, පසුබත්හි පිඬු පා ගමනින් පෙරළා ඇක්මුණු සේක්, පා සෝදා ගිඤ්ජකාවසථයට (ගඩොළු ගෙට) වැඩ, මගද රට වැසි උවසුන් ඇරැබ, කරුණු සලකා මෙනෙහි කොට, සියල්ල සිතින් එක් කොට ගෙන, ‘ඒ භවත්හු යම්බඳු ඥානගතියක් ඇත්තාහු ද, යම්බඳු පරලොව් ගතියක් ඇත්තාහු ද, ඔවුන්ගේ ඒ ඥානගතිය, ඒ පරලොව ගතිය දැනගන්නෙමි’ යි සිතා පනවන ලද අස්නෙහි වැඩ හුන් සේක. ඒ භවත්හු යම් ඥානගතියක් ඇත්තාහු ද, යම් පරලෝ ගතියක් ඇත්තාහු ද, එසේ වූ මගද රටැ වුසූ ඒ උවසුවන් භාග්‍යවතුන් වහන්සේ දුටු සේක. එයින් පසු සවස් වේලේ සමවතින් නැඟී සිටි සේක්, ගඩොළු ගෙයින් නික් මැ වෙහෙරැ ඉදිරි පසැ සෙවණෙහි පන වන ලද අස්නෙහි වැඩ හුන් සේක.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 314,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "7. අථ ඛො ආයස්මා ආනන්දො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා ආනන්දො භගවන්තං එතදවොච. “උපසන්තපදිස්සො{1} භන්තෙ භගවා, භාතිරිව භගවතො මුඛවණ්ණො විප්පසන්නත්තා ඉන්ද්රියානං. සන්තෙන නූනජ්ජ භන්තෙ භගවා විහාරෙන විහාසී”ති. “යදෙව ඛො මෙ ත්වං ආනන්ද, මාගධකෙ පරිචාරකෙ ආරබ්භ සම්මුඛා පරිකථං කත්වා උට්ඨායාසනා පක්කන්තො, තදෙවාහං නාතිකෙ පිණ්ඩාය චරිත්වා පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො පාදෙ පක්ඛාලෙත්වා ගිඤ්ජකාවසථං පවිසිත්වා මාගධකෙ පරිචාරකෙ ආරබ්භ අට්ඨිකත්වා{2} මනසි කත්වා සබ්බං චෙතෙසා සමන්නාහරිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදිං ‘ගතිං තෙසං ජානිස්සාමි අභිසම්පරායං, යංගතිකා තෙ භවන්තො යංඅභිසම්පරායා’ති. අද්දසං ඛො අහං ආනන්ද, මාගධකෙ පරිචාරකෙ යංගතිකා තෙ භවන්තො යංඅභිසම්පරායාති."
                    },
                    {
                        "type": "centered",
                        "text": "ජනවසභාගමනං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "8. අථ ඛො ආනන්ද, අන්තරහිතො යක්ඛො සද්දමනුස්සාවෙසි: ‘ජනවසභො අහං භගවා, ජනවසභො අහං සුගතා”ති. “අභිජානාසි නො ත්වං ආනන්ද, ඉතො පුබ්බෙ එවරූපං නාමධෙය්යං සුතං යදිදං ජනවසභො”ති. “න ඛො අහං භන්තෙ, අභිජානාමි ඉතො පුබ්බෙ එවරූපං නාමධෙය්යං සුතං යදිදං ජනවසභො”ති. අපි ච මෙ භන්තෙ, ලොමානි හට්ඨානි ජනවසභො ති නාමධෙය්යං සුත්වා. තස්ස මය්හං භන්තෙ, එතදහොසි: න හි නූන සො ඔරකො යක්ඛො භවිස්සති යස්සිදං{3} එවරූපං නාමධෙය්යං සුපඤ්ඤත්තං යදිදං ජනවසභො’ති. "
                    },
                    {
                        "type": "paragraph",
                        "text": "“අනන්තරා ඛො ආනන්ද, සද්දපාතුභාවා උළාරවණ්ණො මෙ යක්ඛො සම්මුඛෙ පාතුරහොසි. දුතියම්පි සද්දමනුස්සාවෙසි: ‘බිම්බිසාරො අහං භගවා බිම්බිසාරො අහං සුගතා’ති. ඉදං සත්තමං ඛො අහං භන්තෙ, වෙස්සවණස්ස මහාරාජස්ස සහබ්යතං උපපජ්ජාමි. සො තතො චුතො මනුස්සරාජා භවිතුං පහොමි.{4}"
                    },
                    {
                        "type": "gatha",
                        "text": "ඉතො සත්ත තතො සත්ත සංසාරානි චතුද්දස,\nනිවාසමභිජානාමි යත්ථ මෙ වුසිතං පුරෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "දීඝරත්තං ඛො අහං භන්තෙ, අවිනිපාතො අවිනිපාතං සඤ්ජානාමි. ආසා ච පන මෙ සන්තිට්ඨති සකදාගාමිතායා ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උපසන්තපතිසො - කං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අට්ඨිංකත්වා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. යදිදං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. මනුස්සරාජා පි හොමි - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "7. එ කලැ අනඳ තෙරණුවෝ භගවත් බුදුරජුන් කරා එළඹියාහ. එළැඹ ඔබ වැඳ එක් පසෙක හුන්හ. අනඳ තෙරණුවෝ එක් පසෙක හුන්නාහු ම භාග්‍යවතුන් වහන්සේට “වහන්ස, භාග්‍යවතුන් වහන්සේ උපශාන්ත වූ දැකුම් ඇති සේක. ඉඳුරන් වෙසෙසින් පහන් බැවින් භාග්‍යවතුන් වහන්සේගේ මුඛවර්ණය බබළන සේ ය. වහන්ස, අද භාග්‍යවතුන් වහන්සේ ශාන්ත විභරණයෙකින් වුසූ සේකැ යි හඟිම්” යැ යි කීහ. එ විට භාග්‍යවතුන් වහන්සේ වදාරන සේක්, “අනඳයෙනි, යම් විටෙක තෙපි මගද රටැ වුසූ උවසුවන් ඇරැබැ මා හමුයෙහි වර්ණනා කථාව කොට හුනස්නෙන් නැඟී නික්මුණහු ද, එ විට ම මම් ඥාතික ගමැ පිඬු පිණිස හැසිර පසු බතැ පිණ්ඩපාතයෙන් පෙරළා ඇක්මුණෙම්, පා දෙවැ ගඩොළු ගෙට වැද මගද රටැ වුසූ උවසුවන් ඇරැබැ, කරුණු සලකා බලා මෙනෙහි කොට, සියල්ල සිතින් එක් කොට ගෙන, ඒ භවත්හු යම්බඳු ඥානගති ඇත්තෝ වූහු ද, යම්බඳු පරලොව් ඇත්තෝ වූහු ද, ඔවුන්ගේ ඒ ඥානගතිය, ඒ පරලොව් ගතිය දන ගන්නෙමි’ යි සිතා, පනවන ලද අස්නැ හිඳ ගතිමි. අනඳයෙනි, ඒ භවත්හු යම්බඳු ඥානගති ඇත්තෝ වූහු ද, යම්බඳු පරලොව් ගති ඇත්තෝ වූහු ද, එසේ වූ ගති ඇති මගද රටැ වූ ඒ උවසුවන් මම් දුටුයෙම් ම ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "ජනවසභයා පැමිණීම",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "8. අනඳයෙනි, එ කලා අතුරුදහන් වූ යක්ෂයෙක් ‘භාග්‍යවතුන් වහන්ස මම් ජනවසභයෙමි, සුගතයන් වහන්ස, මම් ජනවසභයෙමි’ යි හඬ ඇස්වී ය (ශබ්දයක් පැවැත් වී ය). අනඳයෙනි, ජනවසභ යන මේ නම තොප මෙයින් පෙරැ ඇසුවා දනිවු ද?” යි අසා වදාළ සේක. “වහන්ස, ජනවසභ යන මේ නම මෙයින් පෙරැ ඇසුවා නො ම දනිමි. එහෙත් වහන්ස, ජනවසභ යන නම ඇසීමෙන් මා ලොමුදහ ගත. වහන්ස, ඒ මට ‘ජනවසභ යන මෙබඳු නමෙක් යමකුහට පනවන ලද්දේ නම් හේ එසේ මෙසේ යකෙක් නො වන්නේ යැ” යි අනඳ තෙරුණුවෝ කිවු ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“අනඳයෙනි, හඬ නැඟෙන්නා හා ම උදාර වු සිරුරු පැහැ ඇති යක්ෂයෙක් මා ඉදිරියෙහි පහළ විය. දෙවනු වරැ ද හෙ තෙම ‘භාග්‍යවතුන් වහන්ස, මම් බිම්බිසාර වෙමි, සුගතයන් වහන්ස, මම් බිම්බිසාර වෙමි’ යි හඬ ඇස්වී ය. “වහන්ස, මේ සත්වන වර වෙසවුණු මහරජුගේ සහභාවයට පැමිණියෙමි. ඒ මම් මෙයින් සැව මිනිස් රජක්හු වන්නට හැක්කෙමි. ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "මේ දෙව්ලොවින් සැවැ සත් වරක් ද, ඒ මිනිස් ලොවින් සැවැ සත් වරක් ද’ යි මෙසේ යම් දෙව් මිනිස් දෙලොව්හි පෙරැ මා වුසූයේ ද, ඒ දෙ තන්හි ම හැම ලෙසින් කඳ පිළිවෙළ තුදුසක් විසීම දනිමි. "
                    },
                    {
                        "type": "paragraph",
                        "text": "වහන්ස, දික් කලක් ම අපායකට නො වැටුණෙම්, අපායට මගේ නොවැටීම දනිමි. සෙදගැමි බව පිණිස ද මගේ අපේක්ෂාව පවතී” යැයි ද හේ කී ය.\nතව ද ජනවසභ තෙම මතු දැක්වෙන කථාවත් කීය:"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 316,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "9. “අච්ඡරියමිදං ආයස්මතො ජනවසභස්ස යක්ඛස්ස, අබ්භුතමිදං ආයස්මතො ජනවසභස්ස යක්ඛස්ස. ‘දීඝරත්තං ඛො අහං භන්තෙ, අවිනිපාතො අවිනිපාතං සඤ්ජානාමීති ච වදෙසි, ආසා ච පන මෙ සන්තිට්ඨති සකදාගාමිතායාති ච වදෙසි. කුතො නිදානං පනායස්මා ජනවසභො යක්ඛො එවරූපං උළාරං විසෙසාධිගමං සඤ්ජානාතී?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“න අඤ්ඤත්ථ භගවා, තව සාසනා, න අඤ්ඤත්ථ සුගත තව සාසනා. යදග්ගෙ අහං භන්තෙ, භගවති එකන්තිකතො{1} අභිප්පසන්නො, තදග්ගෙ අහං භන්තෙ, දීඝරත්තං අවිනිපාතො අවිනිපාතං සඤ්ජානාමි. ආසා ච පන මෙ සන්තිට්ඨති සකදාගාමිතාය. ඉධාහං භන්තෙ, වෙස්සවණෙන මහාරාජෙන පෙසිතො විරූළ්හකස්ස මහාරාජස්ස සන්තිකෙ කෙනචිදෙවකරණීයෙන. අද්දසං භගවන්තං අන්තරාමග්ගෙ ගිඤ්ජකාවසථං පවිසිත්වා මාගධකෙ පරිචාරකෙ ආරබ්භ අට්ඨිකත්වා මනසිකත්වා සබ්බං චෙතෙසා සමන්නාහරිත්වා නිසින්නං ‘ගතිං තෙසං ජානිස්සාමි අභිසම්පරායං යංගතිකා තෙ භවන්තො යංඅභිසම්පරායාති. අනච්ඡරියං ඛො පනෙතං භන්තෙ, යං වෙස්සවණස්ස මහාරාජස්ස තස්සං පරිසායං භාසතො සම්මුඛා සුතං සම්මුඛා පටිග්ගහිතං යංගතිකා තෙ භවන්තො යංඅභිසම්පරායාති. තස්ස මය්හං භන්තෙ, එතදහොසි: භගවන්තඤ්ච දක්ඛාමි. ඉදඤ්ච භගවතො ආරොචෙස්සාමීති. ඉමෙ ඛො මෙ භන්තෙ, ද්වෙ පච්චයා භගවන්තං දස්සනාය උපසඞ්කමිතුං."
                    },
                    {
                        "type": "centered",
                        "text": "දෙවසභා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "10. පුරිමානි භන්තෙ, දිවසානි පුරිමතරානි තදහුපොසථෙ පණ්ණරසෙ වස්සූපනායිකාය පුණ්ණාය පුණ්ණමාය රත්තියා කෙවලකප්පා ච දෙවා තාවතිංසා සුධම්මායං සභායං සන්නිසින්නා හොන්ති සන්තීපතිතා, මහතී ච දිබ්බපරිසා{2} සමන්තතො සන්නිසින්නා හොන්ති{3} සන්තීපතිතා. චත්තාරො ච මහාරාජානො චතුද්දිසා නිසින්නා හොන්ති. පුරත්ථිමාය දිසාය ධතරට්ඨො මහාරාජා පච්ඡිමාභිමුඛො{4} නිසින්නො හොති දෙවෙ පුරක්ඛත්වා. දක්ඛිණාය දිසාය විරූළ්හකො මහාරාජා උත්තරාභිමුඛො නිසින්නො හොති දෙවෙ පුරක්ඛත්වා. පච්ඡිමාය දිසාය විරූපක්ඛො මහාරාජා පුරත්ථාභිමුඛො නිසින්නො හොති දෙවෙ පුරක්ඛත්වා. උත්තරාය දිසාය වෙස්සවණො මහාරාජා දක්ඛිණාභිමුඛො නිසින්නො හොති දෙවෙ පුරක්ඛත්වා. යදා භන්තෙ, කෙවලකප්පා ච දෙවා තාවතිංසා සුධම්මායං සභායං සන්නිසින්නා හොන්ති සන්නිපතිතා මහතී ච දිබ්බපරිසා සමන්තතො සන්නිසින්නා හොන්ති සන්නිපතිතා, චත්තාරො ච මහාරාජානො චතුද්දිසා නිසින්නා හොන්ති. ඉදං තෙසං හොති ආසනස්මිං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. එකන්තතො - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. දිබ්බා පරිසා - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. හොති - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "4. පච්ඡාභිමුකො - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "9. “වහන්ස, මම් දික් කලක් ම අපායට වැටීමක් නැත්තෙම්, අපායෙන් මිදුණු බව හඳුනමි’ යි ද තෙපි කියහු, සෙදැගැමි බව පිණිස මගේ අපේක්ෂාව ද පවත්නේ යැ යි ද කියනු. ආයුෂ්මත් ජනවසභ යක්ෂයාණන්ගේ මේ වචනය ආශ්චර්‍ය්‍ය ය, ආයුෂ්මත් ජනවසභ යක්ෂයාණන්ගේ මේ වචනය අද්භූත ය. ආයුෂ්මත් ජන වසභයෝ කවර හේතුවකින් මෙ බඳු මහත් අධිගම විශේෂයක් වූ නියා හඳුනත් ද?” යි මම් ඇසීමි. එ විට ජනවසභ තෙම මෙය කී ය:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“භාග්‍යවතුන් වහන්ස, ඔබ වහන්සේගේ සස්නෙන් බැහැරෙහි නො වේ, සුගතයන් වහන්ස, ඔබ වහන්සේගේ සස්නෙන් බැහැරෙහි නො වේ. වහන්ස, යම් දවසෙක (යෂ්ටිවනෝද්‍යානයෙහි දී පළමුවෙන් ම බණ අසා සෝවාන් වැ) භාග්‍යවතුන් වහන්සේ කෙරෙහි ඒකාන්ත වශයෙන් පැහැදිණිම් ද, වහන්ස, එතැන් පටන් කොට මම් දික් කලක් අපායයෙන් මිදුණෙම් වීමි. අපායට නොවැටීම හඳුනමි. සකෘදාගාමී බව පිණිස මගේ අපේක්ෂාව ද ඇත. වහන්ස, මෙහි මම් වෙසවුණු මහරජුහු විසින් කිසි කටයුත්තක් සඳහා විරූඪක මහරජු වෙත එවන ලදුයෙමි, මඟ අතුරෙහි දී භාග්‍යවතුන් වහන්සේ ගිඤ්ජකාවසථයට වැද මගද රටැ වුසූ උවසුවන් ඇරැබැ, වැඩ ඇතියක් කොට සලකා, මෙනෙහි කොට, සියල්ල සිතින් එක් තැන් කොට ගෙන, ඒ භවත්හු යම්බඳු ඥානගති ඇතියෝ ද යම්බඳු පරලොව් ගති ඇතියෝ ද, ඔවුන්ගේ ඒ ඥානගති හා පරලොව් ගති දැනගනිමි’ යි වැඩ හුන්නවුන් දිටිමි. වහන්ස, ඒ භවත්හු යම් ඥානගති ඇතියෝ යම් අභිසම්පරාය ගති ඇතියෝ වුහු ද එපවත් ඒ පිරිසෙහිදී පවසන වෙසවුණු මහරජුගේ වචනය ඔහු හමුහි මා ඇසුවා, ඔහු හමුයෙහි මා පිළිගත්තා පුදුම නො වේ. වහන්ස, ඒ මට ‘භාග්‍යවතුන් වහන්සේ ද දකින්නෙමි, මෙය ද භාග්‍යවතුන් වහන්සේට සැළ කරන්නෙමි’ යි මේ සිත විය. වහන්ස, මේ භාග්‍යවතුන් වහන්සේ දක්නා පිණිස මා එළඹෙනුවට කරුණු දෙක ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "දෙව් සබය",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "10. වහන්ස, පෙර දවසැ, බොහෝ දවසකට පෙරැ, ඒ පසොළොස්වක් පොහෝ දා, වැසි සෘතුව එළැඹි, පුරා සඳ ඇති රැයෙහි, සියලු තව්තිසා වැසි දෙවියෝ සුදම් සෙබෙහි එක් වැ හුන්නාහු, එක් රැස් වූවාහු වෙත්. මහත් දෙව් පිරිස්හු ද එක් වැ හුන්නාහු, එක්රැස් වූවාහු ද වෙත්. සිවුවරම් මහ රජදරුවෝ ද සිවු දිගැ හුන්නාහු වෙත්. පෙර දිගැ ධෘතරාෂ්ට්‍ර මහරජ පැසිම් දිගට මුහුණ ලා දෙවියන් පෙරටු කොට හුන්නේ වෙයි. දකුණු දිගැ විරූඪක මහරජ උතුරු දෙසට මුහුණ ලා දෙවියන් පෙරටු කොට හුන්නේ වෙයි. පැසිම්දිගැ විරූපාක්ෂ මහරජ පෙර දිගට මුහුණ ලා දෙවියන් පෙරටු කොට හුන්නේ වෙයි. උතුරු දිගැ වෙසවුණු මහරජ දකුණු දෙසට මුහුණ ලා දෙවියන් පෙරටු කොට හුන්නේ වෙයි. වහන්ස, යම් විටෙක සියලු තව්තිසාවැසි දෙවියෝ සුදම් සෙබෙහි එක් වැ හුන්නාහු, එක් රැස් වූවාහු වෙත් ද, මහත් දෙව්පිරිස්හු වටා එක් වැ හුන්නාහු, එක් රැස් වූවාහු වෙත් ද, එකල් හි සතර වරම් මහ රජ දරුවෝ සතර දිගැ හුන්නාහු වෙත්.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 318,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අථ පච්ඡා අම්හාකං ආසනං හොති. යෙ තෙ භන්තෙ, දෙවා භගවති බ්රහ්මචරියං චරිත්වා අධුනූපපන්නා තාවතිංසකායං, තෙ අඤ්ඤෙ දෙවෙ අතිරොචන්ති වණ්ණෙන චෙව යසසා ච. තෙනස්සුදං භන්තෙ, දෙවා තාවතිංසා අත්තමනා හොන්ති පමුදිතා පීතිසොමනස්සජාතා, “දිබ්බා වත භො කායා පරිපූරන්ති හායන්ති අසුරා කායා”ති. අථ ඛො භන්තෙ, සක්කො දෙවානමින්දො දෙවානං තාවතිංසානං සම්පසාදං විදිත්වා ඉමාහි ගාථාහි අනුමොදි:"
                    },
                    {
                        "type": "gatha",
                        "text": "මොදන්ති වත භො දෙවා තාවතිංසා සහින්දකා{1}\nතථාගතං නමස්සන්තා ධම්මස්ස ච සුධම්මතං.{2}"
                    },
                    {
                        "type": "gatha",
                        "text": "නචෙ දෙවෙ ච පස්සත්තා වණ්ණවන්තෙ යසස්සිනෙ{3}\nසුගතස්මිං බ්රහ්මචරියං චරිත්වාන ඉධාගතෙ."
                    },
                    {
                        "type": "gatha",
                        "text": "තෙ අඤ්ඤෙ අතිරොචන්ති වණ්ණෙන යසසායුනා\nසාවකා භූරිපඤ්ඤස්ස විසෙසූපගතා ඉධ."
                    },
                    {
                        "type": "gatha",
                        "text": "ඉදං දිස්වාන නන්දන්ති තාවතිංසා සහින්දකා,\nතථාගතං නමස්සන්තා ධම්මස්ස ච සුධම්මතන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "11. තෙන සුදං භන්තෙ, දෙවා තාවතිංසා භිය්යොසොමත්තාය අත්තමනා හොන්ති පමුදිතා පීතිසොමනස්සජාතා ‘දිබ්බා වත භො කායා පරිපූරන්ති හායන්ති අසුරා කායා’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භන්තෙ යෙනත්ථෙන දෙවා තාවතිංසා සුධම්මායං සභායං සන්නිසින්නා හොන්ති සන්නිපතිතා, තං අත්ථං චින්තයිත්වා තං අත්ථං මන්තයිත්වා වුත්තවචනාපි තං{4} චත්තාරො මහාරාජානො තස්මිං අත්ථෙ හොන්ති. පච්චනුසිට්ඨවචනාපි{5} තං චත්තාරො මහාරාජානො තස්මිං අත්ථෙ හොන්ති, සකෙසු සකෙසු ආසනෙසු ඨිතා අවිපක්කන්තා.{6}"
                    },
                    {
                        "type": "gatha",
                        "text": "“තෙ වුත්තවාක්යා රාජානො, පටිග්ගය්හානුසාසනිං\nවිප්පසන්නමනා සන්තා අට්ඨංසු සම්හි ආසනෙ”ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සඉන්දකා - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "2. මොදන්ති භො පුනර්දෙවාඃ තයත්රිංශ සශත්රකාං තථාගතං නමස්යන්තා ධර්මස්ය සුඛධර්මතාම් - මහාවස්තු."
                    },
                    {
                        "type": "footnote",
                        "text": "3. යසස්සිනො - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. වුත්තවචනා නාමිදං - කං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. පච්චනුසිට්ඨවචනා පි තං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "6. අයිපක්කන්තා - කං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "මේ ඔවුන්ගේ අසුන් ගැන්ම වේ. ඉක්බිති අපගේ අසුන් වෙයි. වහන්ස, යම් දෙව් කෙනෙක් භාග්‍යවතුන් වහන්සේ කෙරෙහි බඹසර හැසිරැ, තව්තිසා දෙව්මුළුවට අළුත පැමිණියාහු වෙත් ද, ඔහු වර්ණයෙන් ද යසසින් ද සෙසු දෙවියන් ඉක්මැ බබළත්. වහන්ස, එයින් තව්තිසාවැසි දෙවියෝ, “ප්‍රීතියෙක! දෙව් පිරිස් පිරේ, අසුර පිරිස් පිරිහේ” යැ යි ආරාධිත සිතැත්තෝ සතුටු වූවෝ, උපන් ප්‍රීති හා සොම්නස් හා ඇත්තෝ වෙත්. වහන්ස, එ කල්හි සක්දෙවිඳු තව්තිසාවැසි දෙවියන්ගේ පැහැදීම දැන,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ප්‍රීතියෙක! භවත්නි, ඉන්ද්‍රයා සහිත තව්තිසා වැසි දෙවියෝ තථාගතයන් වහන්සේ ද ධර්මයාගේ සුධර්මත්වය ද නමදනාහු,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘සුගතයන් වහන්සේ වෙත බඹසර හැසිර මෙහි පැමිණි, වර්ණවත්, යශස් ඇති, අළුත් දෙවියන් දක්නාහු සතුටු වෙත්’ යැ යි ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“මහ නුවණැති බුදුරජුන්ගේ සවු වූ, විශේෂාධිගමයට පැමිණි ඔහු මෙහි පැහැයෙන් ද යශසින් ද ආයුෂයෙන් ද අන් දෙවියන් ඉක්මැ බබළත්” යැ යි ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ඉන්ද්‍රයා සහිත තව්තිසා වැසි දෙවියෝ මෙය දැක, තථාගතයන් වහන්සේ ද, ධර්මයාගේ සුධර්මත්වය ද (සංඝයාගේ සුපිළිවෙත ද) නමදනාහු සතුටු වෙති’ යි ද කියා මේ ගාථාවලින් අනුමෝදන් විය (ඔවුන් අනුව සතුටු විය).{*}",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "11. වහන්ස, ‘ප්‍රීතියෙක! භවත්නි, දෙව්මුළුහු පිරෙත්, අසුරමුළුහු පිරිහෙති’ යි යන එ කරුණින් තව්තිසාවැසි දෙවියෝ බෙහෙවින් ආරාධිත සිතැත්තාහු, සතුටු වූවාහු, උපන් ප්‍රීති හා සොම්නස් හා ඇත්තාහු වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "වහන්ස, ඉක්බිත්තෙන් යම් කරුණෙකින් තව්තිසා වැසි දෙවියෝ සුදම් සෙබෙහි එක් වැ හුන්නාහු එක්රැස් වූවාහු වෙත් ද, එ කරුණ සිතා, එ කරුණ සාකච්ඡා කොට, සිවුවරම් මහ රජදරුවෝ සිය සිය අසුන්හි සිටියාහු, එයින් නැඟී නොගියාහු, (තෙතිස් දෙව් පුතුන් විසින්) එ කරුණෙහි කියන ලද වචන ඇත්තාහූ ද වෙත්, සිවුවරම් මහ රජ දරුවෝ එ කරුණෙහි යලි යලිත් අනුශාසිත වචන ඇත්තාහු, නැඟී නො ගියාහු සිය සිය අසුන්හි හුන්නාහු වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“තෙතිස් දෙව් පුතුන් විසින් කියන ලද වචන ඇති ඒ සිවු වරම් රජුහු ඔවුන්ගේ අනුශාසනිය පිළිගෙන වෙසෙසින් පහන් වූ සිතැත්තෝ ම සිය අසුන්හි රැඳුණහ.”",
                        "type": "paragraph"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "*. අරණ්‍යවාසි භික්ෂු සංඝයාට ආරක්ෂාව සැලැස්වීම කෙසේ කටයුතු දැයි සාකච්ඡා කිරීම ඒ කිරීමයි."
                    }
                ]
            }
        },
        {
            "pageNum": 320,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "13. අථ ඛො භන්තෙ උත්තරාය දිසාය උළාරො ආලොකො සඤ්ජායි, ඔභාසො පාතුරහොසි, අතික්කම්මෙව දෙවානං දෙවානුභාවං. අථ ඛො භන්තෙ සක්කො දෙවානමින්දො දෙවෙ තාවතිංසෙ ආමන්තෙසි. යථා ඛො මාරිසා නිමිත්තානි දිස්සන්ති උළාරො ආලොකො සඤ්ජායති. ඔභාසො පාතුභවති, බ්රහ්මා පාතුභවිස්සති. බ්රහ්මුනො හෙතං පුබ්බනිමිත්තං පාතුභාවාය යදිදං ආලොකො සඤ්ජායති ඔභාසො පාතුභවතී’ති."
                    },
                    {
                        "type": "gatha",
                        "text": "“යථා නිමිත්තා දිස්සන්ති බ්රහ්මා පාතුභවිස්සති,\nබ්රහ්මුනො හෙතං නිමිත්තං ඔභාසො විපුලො මහාති.”"
                    },
                    {
                        "type": "centered",
                        "text": "සනඞ්කුමාරකථා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "14. අථ ඛො භන්තෙ දෙවා තාවතිංසා යථාසකෙසු ආසනෙසු නිසීදිංසු ‘ඔභාසමෙතං ඤස්සාම යංවිපාකො භවිස්සති සච්ඡිකත්වා’ව නං ගමිස්සාමා ති. චත්තාරො පි මහාරාජානො යථාසකෙසු ආසනෙසු නිසීදිංසු “ඔභාසමෙතං ඤස්සාම යංවිපාකො භවිස්සති, සච්ඡිකත්වා’ව නං ගමිස්සාමා’ති. ඉදං සුත්වා දෙවා තාවතිංසා එකග්ගා සමාපජ්ජිංසු “ඔභාසමෙතං ඤස්සාම, යංවිපාකො භවිස්සති, සච්ඡිකත්වා’ව නං ගමිස්සාමා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යදා භන්තෙ බ්රහ්මා සනංකුමාරො දෙවානං තාවතිංසානං පාතුභවති ඔළාරිකං අත්තභාවං අභිනිම්මිනිත්වා පාතුභවති. යො ඛො පන භන්තෙ බ්රහ්මුනො පකතිවණ්ණො, අනභිසම්භවනීයො සො දෙවානං තාවතිංසානං චක්ඛුපථස්මිං. යදා භන්තෙ බ්රහ්මා සනංකුමාරො දෙවානං තාවතිංසානං පාතුභවති සො අඤ්ඤෙ දෙවෙ අතිරොචති වණ්ණෙන චෙව යසසා ච. සෙය්යථාපි භන්තෙ සොවණ්ණො විග්ගහො මානුසං විග්ගහං අතිරොචති, එවමෙව ඛො භන්තෙ යදා බ්රහ්මා සනංකුමාරො දෙවානං තාවතිංසානං පාතුභවති, සො අඤ්ඤෙ දෙවෙ අතිරොචති වණ්ණෙන චෙව යසසා ච. යදා භන්තෙ බ්රහ්මා සනංකුමාරො දෙවානං තාවතිංසානං පාතුභවති, න තස්සං පරිසායං කොචි දෙවො අභිවාදෙති වා පච්චුට්ඨෙති වා ආසනෙන වා නිමන්තෙති. සබ්බෙව තුණ්හීභූතා පඤ්ජලිකා පල්ලඞ්කෙන නිසීදන්ති ‘යස්සදා’නි දෙවස්ස ඉච්ඡිස්සති බ්රහ්මා සනංකුමාරො තස්ස දෙවස්ස පල්ලඞ්කෙ නිසීදිස්සතී’ති. යස්ස ඛො පන භන්තෙ දෙවස්ස බ්රහ්මා සනංකුමාරො පල්ලඞ්කෙ නිසීදති, උළාරං සො ලභති දෙවො වෙදපටිලාභං උළාරං සො ලභති දෙවො සොමනස්සපටිලාභං. සෙය්යථාපි භන්තෙ රාජා ඛත්තියො මුද්ධාවසිත්තො අධුනාභිසිත්තො රජ්ජෙන, උළාරං සො ලභති වෙදපටිලාභං, උළාරං සො ලභති සොමනස්සපටිලාභං. එවමෙව ඛො භන්තෙ යස්ස දෙවස්ස බ්රහ්මා සනංකුමාරො පල්ලඞ්කෙ නිසීදති උළාරං සො ලභති දෙවො වෙදපටිලාභං. උළාරං සො ලභති දෙවො සොමනස්සපටිලාභං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "13. වහන්ස, ඉක්බිත්තෙන් දෙවියන්ගේ දේවානුභාවය ද මැඩ ගෙන උතුරු දිග්හි මහත් එළියෙක් උපන, මහත් දීප්තියෙක් පහළ විය. වහන්ස, එ කල්හි සක්දෙවිඳු තව්තිසාවැසි දෙවියන් බණවා, “නිදුක්වරිනි, යම් හෙයකින් පෙර නිමිති දක්නා ලැබේ ද, එළියෙක් හටගනී ද, දීප්තියෙක් පහළ වෙයි ද, එ හෙයින් බ්‍රහ්ම තෙමේ පහළ වන්නේ ය. ‘මේ එළියෙක් හට ගනි, දීප්තියෙක් පහළ වෙයි’ යන යමෙක් ඇද්ද, මෙය බඹහුගේ පහළ වීමට පෙර නිමිත්ත යැ” යි කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘යම් සේ පෙරනිමිතිහු දක්නා ලැබෙත් ද එසේ එයට අනතුරු වැ බ්‍රහ්මයා පහළ වන්නේ ය. විපුල වූ මහත් වූ එළිය යන මෙය බඹහුගේ පහළ වීමට පෙරනිමිත්ත ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "සනත්කුමාර කථාව",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "14. වහන්ස, ඉක්බිති තව්තිසාවැසි දෙවියෝ ‘මේ එළිය කිමෙක් දැයි දනගන්නමු, මෙහි යම් ඵලයෙක් වන්නේ නම් එය පසක් කොට ම යන්නමු’ යි කියා තම තමන්ගේ අසුන්හි හුන්හ. සිවුවරම් මහරජුහු ද ‘මේ එළිය කිමෙක් දැ යි දැනගන්නමු. මෙහි යම් ඵලයෙක් වන්නේ නම් එය සියැසින් දැක ම යන්නමු’ යි කියා තම තමන්ගේ අසුන්හි හුන්හ. මෙය අසා තව්තිසා වැසි දෙවියෝ ‘මේ එළිය දැනගන්නමු, මෙහි යම් විපාකයෙක් වන්නේ නම් එය පසක් කොට ම යන්නමු’ යි එකඟ සිතැති වූහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "වහන්ස, යම් කලෙක සනත්කුමාර බ්‍රහ්ම තෙම තව්තිසා වැසි දෙවියන් ඉදිරියෙහි පහළ වන්නේ ද, එ කලැ හේ දළ අත්බවක් මවා ගෙන පහළ වෙයි. වහන්ස, බඹහුගේ යම් පියෙවි පැහැ සටහනෙක් ඇද්ද, එය තව්තිසා වැසි දෙවියන්ගේ චක්ෂුස්පථයෙහි නො පැමිණියැ හැකි වෙයි. (ඇසින් දැක්ක නො හෙයි). වහන්ස, යම් කලෙක සනත්කුමාර බ්‍රහ්ම තෙම තව්තිසා වැසි දෙවියන් ඉදිරියේ පහළ වන්නේ ද, එ කලැ හේ පැහැයෙන් ද යසසින් ද අන් දෙවියන් ඉක්මැ බබළයි. වහන්ස, යම්සේ රන්රුවෙක් මිනිස්රුව ඉක්මැ බබළන්නේ ද, වහන්ස, එසේ ම යම් කලෙක සනත් කුමාර බ්‍රහ්ම තෙම තව්තිසාවැසි දෙවියන් හමුයෙහි පහළ වන්නේ ද, එ කල්හි හේ පැහැයෙන් ද යසසින් ද අන් දෙවියන් ඉක්මැ බබළයි. වහන්ස, යම් විටෙක සනත්කුමාර බ්‍රහ්ම තෙම තව්තිසාවැසි දෙවියන් හමුයෙහි පහළ වන්නේ ද, එ කල්හි එ පිරිසෙහි කිසිදු දෙවියෙක් ඔහු නමදනේ හෝ දැක හුනස්නෙන් නැඟී සිටුනේ හෝ අස්නෙන් නිමතන්නේ නො වෙයි. සියල්ලෝ ම ‘දැන් සනත්කුමාර බ්‍රහ්ම තෙම යම් දෙවියකුගේ පළඟෙක ඉඳ ගනු කැමැති වන්නේ ද, එහි ඉඳගන්නේ යැ’ යි සිතා නිහඩවැ දොහොත් නමා පළඟින් හිඳිත්. වහන්ස, යම් දෙවියකුගේ පළඟෙහි (පුටුවෙහි) සනත්කුමාර බ්‍රහ්මයා ඉඳගන්නේ ද, ඒ දෙවි තෙම මහත් සතුට විඳියි, මහත් සොම්නස විඳියි. වහන්ස, රාජ්‍යයෙන් අළුත අභිෂේක ලැබූ, මූර්ධාවසික්ත වූ කැත් රජෙක් යම්සේ මහත් ප්‍රීතියක් විඳි ද, මහත් සොම්නසක් ලබා ද, වහන්ස, එසේ ම යම් දෙවියකුගේ පළඟෙහි සනත්කුමාර බ්‍රහ්ම තෙම ඉඳගන්නේ ද, හේ දෙවි මහත් ප්‍රීතියක් ලබයි, මහත් සොම්නසක් ලබයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 322,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "15. අථ භන්තෙ බ්රහ්මා සනංකුමාරො ඔළාරිකං අත්තභාවං අභිනිම්මිණිත්වා කුමාරවණ්ණී හුත්වා පඤ්චසිඛො දෙවානං තාවතිංසානං පාතුරහොසි. සො වෙහාසං අබ්භුග්ගන්ත්වා ආකාසෙ අන්තළික්ඛෙ පල්ලඞ්කෙන නිසීදි. සෙය්යථාපි භන්තෙ බලවා පුරිසො සුපච්චත්ථතෙ වා පල්ලඞ්කෙ සමෙ වා භූමිභාගෙ පල්ලඞ්කෙන නිසීදෙය්ය, එවමෙව ඛො භන්තෙ බ්රහ්මා සනංකුමාරො වෙහාසං අබ්භුග්ගන්ත්වා ආකාසෙ අන්තළික්ඛෙ පල්ලඞ්කෙන නිසීදිත්වා දෙවානං තාවතිංසානං සම්පසාදං විදිත්වා ඉමාහි ගාථාහි අනුමොදි:"
                    },
                    {
                        "type": "gatha",
                        "text": "“මොදන්ති වත භො දෙවා තාවතිංසා සහින්දකා,\nතථාගතං නමස්සන්තා ධම්මස්ස ච සුධම්මතං."
                    },
                    {
                        "type": "gatha",
                        "text": "නවෙ දෙවෙ ච පස්සන්තා වණ්ණවන්තෙ යසස්සිනෙ,\nසුගතස්මිං බ්රහ්මචරියං චරිත්වාන ඉධාගතෙ."
                    },
                    {
                        "type": "gatha",
                        "text": "තෙ අඤ්ඤෙ අතිරොචන්ති වණ්ණෙන යසසායුනා,\nසාවකා භූරිපඤ්ඤස්ස විසෙසූපගතා ඉධ."
                    },
                    {
                        "type": "gatha",
                        "text": "ඉදං දිස්වාන නන්දන්ති තාවතිංසා සහින්දකා,\nතථාගතං නමස්සන්තා ධම්මස්ස ච සුධම්මතන්ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "16. ඉදමත්ථං භන්තෙ බ්රහ්මා සනංකුමාරො භාසිත්ථ. ඉදමත්ථං භන්තෙ බ්රහ්මුනො සනංකුමාරස්ස භාසතො අට්ඨඞ්ගසමන්නාගතො සරො හොති: විස්සට්ඨො ච විඤ්ඤෙය්යො ච මඤ්ජු ච සවනීයො ච බින්දු ච අවිසාරී ච ගම්භීරො ච නින්නාදී ච. යථාපරිසං ඛො පන භන්තෙ බ්රහ්මා සනංකුමාරො සරෙන විඤ්ඤාපෙති. න චස්ස බහිද්ධා පරිසාය ඝොසො නිච්ඡරති. යස්ස ඛො පන භන්තෙ එවං අට්ඨඞ්ගසමන්නාගතො සරො හොති, සො වුච්චති ‘බ්රහ්මස්සරො’ති. අථ ඛො භන්තෙ බ්රහ්මා සනංකුමාරො තෙත්තිංස අත්තභාවෙ අභිනිම්මිනිත්වා දෙවානං තාවතිංසානං පච්චෙකපල්ලඞ්කෙසු පච්චෙකපල්ලඞ්කෙන නිසීදිත්වා දෙවෙ තාවතිංසෙ ආමන්තෙසි: “තං කිම්මඤ්ඤන්ති භොන්තො දෙවා තාවතිංසා. යාවඤ්ච සො භගවා බහුජනහිතාය පටිපන්නො බහුජනසුඛාය ලොකානුකම්පාය අත්ථාය හිතාය සුඛාය දෙවමනුස්සානං. යෙ හි කෙචි භො බුද්ධං සරණං ගතා ධම්මං සරණං ගතා සඞ්ඝං සරණං ගතා සීලෙසු පරිපූරකාරිනො, තෙ කායස්ස භෙදා පරම්මරණා අප්පෙකච්චෙ පරනිම්මිතවසවත්තීනං දෙවානං සහබ්යතං උපපජ්ජන්ති අප්පෙකච්චෙ නිම්මානරතීනං දෙවානං සහබ්යතං උපපජ්ජන්ති, අප්පෙකච්චෙ තුසිතානං දෙවානං සහබ්යතං උපපජ්ජන්ති, අප්පෙකච්චෙ යාමානං දෙවානං සහබ්යතං උපපජ්ජන්ති, අප්පෙකච්චෙ තාවතිංසානං දෙවානං සහබ්යතං උපපජ්ජන්ති, අප්පෙකච්චෙ චාතුම්මහාරාජිකානං දෙවානං සහබ්යතං උපපජ්ජන්ති. යෙ සබ්බනිහීනං කායං පරිපූරෙන්ති, තෙ ගන්ධබ්බකායං පරිපූරෙන්තී’ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "15. වහන්ස, ඉක්බිති සනත්කුමාර බ්‍රහ්ම තෙම දළ අත්බවක් මවා ගෙන සීබා පසක් කොට බැඳි හිසකෙහෙ ඇත්තේ පන්සිළු ගඳෙවු පුතු සෙයින් කුමරවෙස් ඇත්තේ තව්තිසා වැසි දෙවියන් අතරැ පහළ විය. හේ අහස් නැඟ ඈත අහසෙහි පළක් බැඳ හුන්නේ ය. වහන්ස, ශක්තිමත් පුරුෂයෙක් මොනොවට පසතුරුණෙන් වසන ලද පළඟෙක හෝ සම වූ බිම් පෙදෙසෙක හෝ යම්සේ පළක් බැඳ හිඳ ගන්නේ ද, වහන්ස, එසේ ම සනත්කුමාර බ්‍රහ්ම තෙම අහස් නැඟ ඈත අහසැ පළඟින් හිඳ තව්තිසා වැසි දෙවියන්ගේ පැහැදීම දැන, මේ ගාථාවලින් අනුමෝදනා කෙළේ ය: “මොදන්තිවත –පෙ– සුධම්මතන්ති”\nගාථාවල අදහස:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“භවත්නි ප්‍රීතියෙකි! ඉන්ද්‍රයා සහිත තව්තිසා වැසි දෙවියෝ තථාගතයන් වහන්සේට ද, ධර්මයාගේ සුධර්මත්වයට ද නමස්කාර කරමින්,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "සුගතයන් වහන්සේ වෙත බඹසර හැසිරැ මෙහි ආ වර්ණවත් වූ යශස් ඇති අළුත් දෙවියන් ද දකිමින් ප්‍රමුදිත වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහත් නුවණ ඇති බුදුරජුන්ගේ ශ්‍රාවක වූ විශේෂාධිගමයට පැමිණි ඒ දෙවියෝ වර්ණයෙන් ද යශසින් ද ආයුෂයෙන් ද අන් දෙවියන් ඉක්මැ බබළත්. ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මෙය දැක, ඉන්ද්‍රයා සහිත වූ තව්තිසා වැසි දෙවියෝ තථාගතයන් වහන්සේ ද ධර්ම සුධර්මත්වය ද නමඳනාහු සතුටු වෙත්.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "16. වහන්ස, සනත්කුමාර බ්‍රහ්ම තෙම මේ කාරණය කී ය. වහන්ස, මෙ කරුන පවසන සනත්කුමාර බඹහුගේ, සුවසේ නික්මෙන්නාවූ ද අරුත් වහා ම හෙළි කරන්නාවූ ද මිහිරි වූ ද කනට සුව එළවන්නාවූ ද එකට කැටි වූ ද නොවිසිරැ පවත්නා වූ ද ගැඹුරු වූ ද රැව් දෙන්නා වූ දැ යි මෙ කී අංග අටින් සමන්විත හඩෙක් වෙයි. වහන්ස, පිරිසේ පමණට ම සනත්කුමාර බ්‍රහ්ම තෙම හඩින් දන්වයි. ඔහුගේ හඬ පිරිසෙන් පිටතට නොද නික්මෙයි. වහන්ස, යමකුට මෙසේ වූ අංග අටින් යුත් හඬෙක් වේද හේ බ්‍රහ්මස්වරය ඇත්තේ යැයි කියනු ලැබේ. වහන්ස, ඉක්බිති සනත්කුමාර බ්‍රහ්ම තෙම අත්බව් තෙතිසක් මවා ගෙන තව්තිසා වැසි දෙවියන්ගේ එකි එකී පළඟෙක වෙන වෙන ම පළක් බැඳ හිඳ, ඒ දෙවියන් බණවා මෙසේ කීය: “පින්වත් තව්තිසාවැසි දෙවියෝ එය කිමැ යි සිතත් ද? ඒ භාග්‍යවතුන් වහන්සේ කොතරම් මහත් ලෙස බොහෝ දෙනාට හිත පිණිස බොහෝ දෙනාට සුව පිණිස ලොවට අනුකම්පා පිණිස දෙව්මිනිස්නට වැඩ පිණිස හිත පිණිස සුව පිණිස පිළිපන් සේක් ද! භවත්නි, යම් කිසි කෙනෙක් බුදුරජුන් සරණ ගියෝ ද දහම් සරණ ගියෝ ද සඟ සරණ ගියෝ ද, සිල් පිරිපුන් කරන සුල්ලෝ ද, ඔහු ඇතැම් කෙනෙක් කාබුන් මරණින් මතු පරනිර්මිතවශවර්තී දෙවියන්ගේ සහභාවයට පැමිණෙත්, ඇතැම් කෙනෙක් නිර්මාණරතී දෙවියන්ගේ සහභාවයට පැමිණෙත්, ඇතැම් කෙනෙක් තුෂිත දෙවියන්ගේ සහභාවයට පැමිණෙත්, ඇතැම් කෙනෙක් යාම දෙවියන්ගේ සහභාවයට පැමිණෙත්, ඇතැම් කෙනෙක් ත්‍රායස්ත්‍රිංශත් දෙවියන්ගේ සහභාවයට පැමිණෙත්, ඇතැම් කෙනෙක් චාතුර්මහාරාජික දෙවියන්ගේ සහභාවයට පැමිණෙත්. යම් කෙනෙක් හැමට ම පහත් දෙව්මුළුවක් සපුරන්නාහු නම් (දෙව් පිරිසෙක උපදින්නාහු නම්) ඔහු ගඳෙවු මුළුව පිරිපුන් කෙරෙත් (ගන්ධර්ව නිකායයෙහි උපදිත්) යැ” යි (කී ය.)",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 324,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉදමත්ථං භන්තෙ බ්රහ්මා සනංකුමාරො භාසිත්ථ. ඉදමත්ථං භන්තෙ බ්රහ්මුනො සනංකුමාරස්ස භාසතො ඝොසො යෙව. දෙවා මඤ්ඤන්ති ය්වායං මම පල්ලඞ්කෙ, ස්වායං එකො’ව භාසතී’ති."
                    },
                    {
                        "type": "gatha",
                        "text": "“එකස්මිං භාසමානස්මිං සබ්බෙ භාසන්ති නිම්මිතා{1}\nඑකස්මිං තුණ්හිමාසීනෙ සබ්බෙ තුණ්හීභවන්ති තෙ."
                    },
                    {
                        "type": "gatha",
                        "text": "තදා සු දෙවා මඤ්ඤන්ති තාවතිංසා සහින්දකා,\nය්වායං මම පල්ලඞ්කස්මිං ස්වායං එකො’ව භාසතීති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "17. අථ ඛො භන්තෙ බ්රහ්මා සනංකුමාරො එකත්තෙන අත්තානං උපසංහාසි. එකත්තෙන අත්තානං උපසංහරිත්වා සක්කස්ස දෙවානමින්දස්ස පල්ලඞ්කෙ පල්ලඞ්කෙන නිසීදිත්වා දෙවෙ තාවතිංසෙ ආමන්තෙසි:"
                    },
                    {
                        "type": "centered",
                        "text": "ඉද්ධිපාද භාවනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "18. තං කිම්මඤ්ඤන්ති භොන්තො දෙවා තාවතිංසා යාවසුපඤ්ඤත්තා චිමෙ තෙන භගවතා ජානතා පස්සතා අරහතා සම්මාසම්බුද්ධෙන චත්තාරො ඉද්ධිපාදා පඤ්ඤත්තා ඉද්ධිපහුතාය ඉද්ධිවිසවිතාය ඉද්ධිවිකුබ්බනතාය. කතමෙ චත්තාරො? ඉධ භො භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. විරියසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. චිත්තසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉමෙ ඛො භො තෙන භගවතා ජානතා පස්සතා අරහතා සම්මාසම්බුද්ධෙන චත්තාරො ඉද්ධිපාදා පඤ්ඤත්තා ඉද්ධිපහුතාය ඉද්ධිවිසවිතාය ඉද්ධිවිකුබ්බනතාය. යෙ හි කෙචි භො අතීතමද්ධානං සමණා වා බ්රාහ්මණා වා අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොසුං, සබ්බෙ තෙ ඉමෙසං යෙව චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා. යෙපි හි කෙචි භො අනාගතමද්ධානං සමණා වා බ්රාහ්මණා වා අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොස්සන්ති, සබ්බෙ තෙ ඉමෙසංයෙව චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා. යෙපි හි කෙචි භො එතරහි සමණා වා බ්රාහ්මණා වා අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොන්ති සබ්බෙ තෙ ඉමෙසං යෙව චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා. "
                    },
                    {
                        "type": "paragraph",
                        "text": "පස්සන්ති නො භොන්තො දෙවා තාවතිංසා මම පි මං එවරූපං ඉද්ධානුභාවන්ති?"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. එකස්ය භාෂමානස්ය සර්වෙ භාෂන්ති නිර්මිතාඃ එකස්ය තුෂණීම්භූතස්ය සර්වෙ තුෂ්ණීම්භවන්ති තෙ. (දිව්යාවදාන)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": " වහන්ස, මෙ කරුණ සනත්කුමාර බ්‍රහ්ම තෙමේ පැවැසී ය. වහන්ස, මෙ කරුණ පවසන සනත්කුමාර බඹහුගේ ඝෝෂය පමණෙකි. යමෙක් මගේ පළඟෙහි වේ ද හේ එකලා ව ම කථා කෙරේ යැ යි දෙවියෝ හඟිත්."
                    },
                    {
                        "format": 13,
                        "text": "“එකක්හු කථා කරන කල්හි නිර්මිත වූ සියල්ලෝ කථා කෙරෙත්. එකක්හු නිහඬ වැ හුන් කල්හි එ සියල්ලෝ නිහඩ වෙත්. ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "එ දා ඉන්ද්‍රයා සහිත තව්තිසා වැසි දෙවියෝ ‘යමෙක් මගේ පළඟෙහි වේ ද හේ ම හුදෙකලා වැ කථා කෙරේ යැ’ යි සිතත්.”"
                    },
                    {
                        "format": 13,
                        "text": "17. වහන්ස, ඉක්බිත්තෙන් සනත්කුමාර බ්‍රහ්ම තෙම තමා එකත්වයෙන් එළැවී ය (බොහෝ බව හැර එක් සිරුරෙකින් පෙනී සිටියේ ය). තමා එකත්වයෙන් එළවා (එකෙක් ව ම පෙනී) සක්දෙවිඳුගේ පළඟෙහි පළක් බැඳ හිඳ තව්තිසාවැසි දෙවියන් අමතා මෙය කී ය:",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "සෘද්ධිපාද භාවනා",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "18. භවත් තව්තිසාවැසි දෙවියෝ එය කිමැ යි සිතත් ද? දන්නා වූ දක්නා වූ ඒ රහත් සම්මාසම්බුදු රජුන් විසින් සෘද්ධිප්‍රභූතාව පිණිස (සෘද්ධි ඉපැදැවීමෙහි සමත් බව පිණිස), සෘද්ධියෙහි පුහුණු වූ වශීභාවය පිණිස, සෘද්ධිවිකුවර්ණතාව පිණිස (සෘද්ධියෙන් විවිධ රූප මවනු පිණිස) මේ සතර සෘද්ධිපාදයෝ ඉතා මනා කොට පණවන ලද්දාහු ය. ඒ කවර සතර සෘද්ධිපාදයෝ ද? යත්: භවත්නි, මෙහි මහණ තෙම කර්තුකාමතා ඡන්දය අධිපති කොට ලත් සමාධියෙන් ද ප්‍රධානවීර්‍ය්‍යයෙන් ද සමන්වාගත සෘද්ධිපාදය වඩයි. වීර්‍ය්‍යය අධිපති කොට ලැබූ සමාධියෙන් ද ප්‍රධානවීර්‍ය්‍යයෙන් ද සමන්වාගත සෘද්ධිපාදය වඩයි. චිත්තය අධිපති කොට ලත් සමාධියෙන් ද ප්‍රධාන වීර්‍ය්‍යයෙන් ද සමන්වාගත සෘද්ධිපාදය වඩයි. විමංසාව අධිපති කොට ලත් සමාධියෙන් ද ප්‍රධාන වීර්‍ය්‍යයෙන් ද සමන්වාගත සෘද්ධිපාදය වඩයි. භවත්නි, මොහු වනාහි දන්නා දක්නා ඒ භගවත් අර්හත් සම්‍යක්සම්බුද්ධයන් වහන්සේ විසින් සෘද්ධිප්‍රභූතාව පිණිස සෘද්ධියෙහි ප්‍රගුණ වශීභාවය පිණිස, සෘද්ධිවිකුර්වණතාව පිණිස, පණවන ලද සතර සෘද්ධිපාදයෝ ය. භවත්නි, අතීත කාලයෙහි යම් මහණ කෙනෙක් හෝ බමුණු කෙනෙක් නොඑක්වැදෑරුම් සෘද්ධිවිධ ලැබූහු ද, ඒ සියල්ලෝ මේ සතර සෘද්ධිපාදයන් ම වැඩූ බැවින් බහුලී කෘත බැවින්, එය ලැබූහ. අනාගත කාලයෙහිත් යම් මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ නොයෙක් වැදෑරුම් සෘද්ධිවිධ ලබන්නාහු ද, ඒ සියල්ලෝ ම මේ සතර සෘද්ධිපාදයන් ම වැඩූ බැවින්, බහුලවශයෙන් කළ බැවින් එය ලබනනාහ. භවත්නි, යම් කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ දැන් නොයෙක් වැදෑරුම් සෘද්ධිවිධ ලබත් ද, ඒ සියල්ලෝ ම මේ සතර සෘද්ධිපාද වැඩූ බැවින් බහුල වශයෙන් කළ බැවින් එය ලබත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“භවත් තව්තිසාවැසි දෙවියෝ මගේ ද එ බඳු වූ මේ සෘද්ධ්‍යනුභාවය දකිත් ද?” යි (සනත් කුමාර ඇසී ය.)",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 326,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "‘එවං මහාබ්රහ්මෙ’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘අහම්පි ඛො භො ඉමෙසං යෙව චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා එවං මහිද්ධිකො එවංමහානුභාවො’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදමත්ථං භන්තෙ බ්රහ්මා සනංකුමාරො භාසිත්ථ. ඉදමත්ථං භන්තෙ බ්රහ්මා සනංකුමාරො භාසිත්වා දෙවෙ තාවතිංසෙ ආමන්තෙසි."
                    },
                    {
                        "type": "centered",
                        "text": "ඔකාසාධිගමා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "19. තං කිම්මඤ්ඤන්ති භොන්තො දෙවා තාවතිංසා යාවඤ්චීදං තෙන භගවතා ජානතා පස්සතා අරහතා සම්මාසම්බුද්ධෙන තයො ඔකාසාධිගමා අනුබුද්ධා සුඛස්ස අධිගමාය. කතමෙ තයො? ඉධ භො එකච්චො සංසට්ඨො විහරති කාමෙහි, සංසට්ඨො අකුසලෙහි ධම්මෙහි. සො අපරෙන සමයෙන අරියධම්මං සුණාති, යොනිසො මනසි කරොති, ධම්මානුධම්මං පටිපජ්ජති. සො අරියධම්මසවනං ආගම්ම යොනිසොමනසිකාරං ධම්මානුධම්මපටිපත්තිං අසංසට්ඨො විහරති කාමෙහි, අසංසට්ඨො අකුසලෙහි ධම්මෙහි. තස්ස අසංසට්ඨස්ස කාමෙහි අසංසට්ඨස්ස අකුසලෙහි ධම්මෙහි උප්පජ්ජති සුඛං. සුඛා භිය්යො සොමනස්සං. සෙය්යථාපි භො මුදා පාමොජ්ජං ජායෙථ, එවමෙව ඛො භො අසංසට්ඨස්ස කාමෙහි අසංසට්ඨස්ස අකුසලෙහි ධම්මෙහි උප්පජ්ජති සුඛං. සුඛා භිය්යො සොමනස්සං. අයං ඛො භො තෙන භගවතා ජානතා පස්සතා අරහතා සම්මාසම්බුද්ධෙන පඨමො ඔකාසාධිගමො අනුබුද්ධො සුඛස්ස අධිගමාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුනචපරං භො ඉධෙකච්චස්ස ඔළාරිකා කායසඞ්ඛාරා අප්පටිප්පස්සද්ධා හොන්ති, ඔළාරිකා වචීසඞ්ඛාරා අප්පටිප්පස්සද්ධා හොන්ති, ඔළාරිකා චිත්තසඞ්ඛාරා අප්පටිප්පස්සද්ධා හොන්ති. සො අපරෙන සමයෙන අරියධම්මං සුණාති යොනිසො මනසි කරොති ධම්මානුධම්මං පටිපජ්ජති. තස්ස අරියධම්මසවනං ආගම්ම යොනිසො මනසිකාරං ධම්මානුධම්මප්පටිපත්තිං ඔළාරිකා කායසඞ්ඛාරා පටිප්පස්සම්භන්ති, ඔළාරිකා වචීසඞ්ඛාරා පටිප්පස්සම්භන්ති, ඔළාරිකා චිත්තසඞ්ඛාරා පටිප්පස්සම්භන්ති. තස්ස ඔළාරිකානං කායසඞ්ඛාරානං පටිප්පස්සද්ධියා ඔළාරිකානං වචීසඞ්ඛාරානං පටිප්පස්සද්ධියා ඔළාරිකානං චිත්තසඞ්ඛාරානං පටිප්පස්සද්ධියා උප්පජ්ජති සුඛං. සුඛා භිය්යො සොමනස්සං. සෙය්යථාපි භො මුදා පාමොජ්ජං ජායෙථ, එවමෙව ඛො භො ඔළාරිකානං කායසඞ්ඛාරානං පටිප්පස්සද්ධියා ඔළාරිකානං වචීසඞ්ඛාරානං පටිප්පස්සද්ධියා ඔළාරිකානං චිත්තසඞ්ඛාරානං පටිප්පස්සද්ධියා උප්පජ්ජති සුඛං. සුඛා භිය්යො සොමනස්සං. අයං ඛො භො තෙන භගවතා ජානතා පස්සතා අරහතා සම්මාසම්බුද්ධෙන දුතියො ඔකාසාධිගමො අනුබුද්ධො සුඛස්ස අධිගමාය."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "“එසේ ය, මහාබ්‍රහ්මයෙනි” යි දෙව්හු කීහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“භවත්නි, මම් ද මේ සතර සෘද්ධිපාදයන් වැඩූ බැවින්, බහුල වශයෙන් කළ බැවින් මෙසේ මහර්ද්ධි ඇති යෙම්, මෙසේ මහානුභාව ඇතියෙම් වෙමි” යි (සනත්කුමාර කී ය).",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "වහන්ස, සනත්කුමාර බ්‍රහ්ම තෙම මෙ කරුණ කී ය. වහන්ස, සනත්කුමාර බඹ තෙම මෙ කරුණ කියා තව්තිසාවැසි දෙවියන් අමතා මෙය පැවැසී ය:",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "අවකාශාධිගමයෝ",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "19. භවත් තව්තිසාවැසි දෙවියෝ එය කිමෙකැ යි සිතත් ද? දන්නා දක්නා ඒ භගවත් අර්හත් සම්‍යක්සම්බුද්ධෝත්තමයන් වහන්සේ විසින් සුව ලබනු පිණිස මේ අවකාශාධිගම (ඉඩ ලැබෙන මාර්ග) තුනෙක් ම දැන වදාරන ලදි. කවර තුනෙක් ද? යත්: භවත්නි, මෙහි එක්තරා පුරුෂයෙක් කාමයන් හා යෙදුණු සිතැත්තේ අකුසල් දහමුන් හා යෙදුණු සිතැත්තේ වෙසෙයි. හේ පසු කලෙක ආර්ය ධර්මය (බුදුරජුන් වදාළ බණ) අසයි, එය (ධර්මානුධර්ම ප්‍රතිපත්තියට) උපාය (මාර්ගය) වශයෙන් මෙනෙහි කෙරෙයි, නවලොවුතුරා දහමට අනුලොම් දහම් වූ පූර්වභාග ප්‍රතිපත්තිය පිළිපදී. හේ ආර්‍ය්‍ය ධර්මය ඇසීම ද යෝනිසෝමනස්කාරය ද ධර්මානුධර්මප්‍රතිපත්තිය ද නිසා කාමයන් හා නොයෙදුණු සිතැති ව අකුශලධර්මයන් හා නොයෙදුණු සිතැති වැ වෙසෙයි. කාමයන් හා නොයෙදුණු සිතැති, අකුශල ධර්මයන් හා නො යෙදුණු සිතැති ඔහුට පළමු දහන් සුව පහළ වෙයි. පළමු දහන්සුව හේතුයෙන් (දහන් සමවත්හි යෙදී ඉඳීමෙන්) වඩාත් සොම්නස උපදී. භවත්නි, යම් සේ සතුටින් බලවත් සොම්නස උපදනේ ද, එසේ ම කාමයන් හා නොයෙදුණු, අකුසල් දහමුන් හා නොයෙදුණු තැනැත්ත හු ට සුවයෙක් උපදී, සුවයෙන් වඩාත් සොම්නස උපදී. භවත්නි, දන්නා දක්නා ඒ භගවත් අර්හත් සම්‍යක්සම්බුද්ධයන් වහන්සේ විසින් සුව ලබනු පිණිස මේ පළමු වන අවකාශාධිගමය දැන වදාරන ලද්දේය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, තව ද මෙහි එක්තරා කෙනකුගේ ඖදාරික වූ කායසංස්කාරයෝ නොසංසිඳුණාහු වෙත් ද, ඖදාරික වූ වාක්සංස්කාරයෝ නොසංසිඳුණාහු වෙත් ද, ඖදාරික චිත්ත සංස්කාරයෝ නො සංසිඳුණාහු වෙත් ද හේ පසු කාලයෙහි ආර්‍ය්‍යධර්මය අසයි, එය ධර්මානුධර්මප්‍රතිපත්තියට උපාය වශයෙන් මෙනෙහි කරයි. ධර්මානුධර්මය (නව ලොවුතුරා දහමට අනුලොම් දහම්වූ පූර්වභාගප්‍රත්තිය) පිළිපදී. ආර්‍ය්‍යධර්මශ්‍රවණයද යෝනිසෝමනස්කාරය ද ධර්මානුධර්මප්‍රතිපත්තිය ද නිසා ඔහුගේ ඖදාරික වූ කායසංස්කාරයෝ සංසිඳෙත්, ඖදාරික වූ වාක්සංස්කාරයෝ සංසිඳෙත්, ඖදාරික වූ චිත්තසංස්කාරයෝ සංසිඳෙත්. ඖදාරික කායසංස්කාරයන් සංසිඳීමෙන් ඖදාරික වාක්සංස්කාරයන් සංසිඳීමෙන්, ඖදාරික චිත්තසංස්කාරයන් සංසිඳීමෙන් (නිරෝධ සමාපත්තියෙන් නැඟීසිටුනා) ඔහුට (වතුර්ථධ්‍යානික ඵලසමාපත්ති) සැපය උපදී. (එයින් නැඟී සිටි ඔහුට) මතු මත්තෙහි, සොම්නස උපදී. භවත්නි, දන්නා දක්නා ඒ භගවත් අර්හත් සම්‍යක් සම්බුද්ධයන් වහන්සේ විසින් සුව ලබනු පිණිස දැන වදාරන ලද මේ දෙවෙනි අවකාශාධිගමය යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 328,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං භො ඉධෙකච්චො ඉදං කුසලන්ති යථාභූතං නප්පජානාති. ඉදං අකුසලන්ති යථාභූතං නප්පජානාති. ඉදං සාවජ්ජං ඉදං අනවජ්ජං, ඉදං සෙවිතබ්බං ඉදං න සෙවිතබ්බං, ඉදං හීනං ඉදං පණීතං, ඉදං කණ්හසුක්කසප්පටිභාගන්ති යථාභූතං නප්පජානාති. සො අපරෙන සමයෙන අරියධම්මං සුණාති, යොනිසො මනසි කරොති, ධම්මානුධම්මං පටිපජ්ජති. සො අරියධම්මසවනං ආගම්ම යොනිසොමනසිකාරං ධම්මානුධම්මප්පටිපත්තිං ඉදං කුසලන්ති යථාභූතං පජානාති, ඉදං අකුසලන්ති යථාභූතං පජානාති. ඉදං සාවජ්ජං ඉදං අනවජ්ජං, ඉදං සෙවිතබ්බං ඉදං න සෙවිතබ්බං, ඉදං හීනං ඉදං පණීතං, ඉදං කණ්හසුක්කසප්පටිභාගන්ති යථාභූතං පජානාති. තස්ස එවං ජානතො එවං පස්සතො අවිජ්ජා පහීයති, විජ්ජා උප්පජ්ජති. තස්ස අවිජ්ජාවිරාගා විජ්ජුප්පාදා උප්පජ්ජති සුඛං, සුඛා භිය්යො සොමනස්සං. සෙය්යථාපි භො මුදා පාමොජ්ජං ජායෙථ, එවමෙව ඛො භො අවිජ්ජාවිරාගා විජ්ජුප්පාදා උප්පජ්ජති සුඛං සුඛා භිය්යො සොමනස්සං. අයං ඛො භො තෙන භගවතා ජානතා පස්සතා අරහතා සම්මාසම්බුද්ධෙන තතියො ඔකාසාධිගමො අනුබුද්ධො සුඛස්ස අධිගමාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො භො තෙන භගවතා ජානතා පස්සතා අරහතා සම්මාසම්බුද්ධෙන තයො ඔකාසාධිගමා අනුබුද්ධා සුඛස්ස අධිගමායාති. ඉදමත්ථං භන්තෙ, බ්රහ්මා සනංකුමාරො භාසිත්ථ. ඉදමත්ථං භන්තෙ බ්රහ්මා සනංකුමාරො භාසිත්වා දෙවෙ තාවතිංසෙ ආමන්තෙසි:"
                    },
                    {
                        "type": "centered",
                        "text": "සතිපට්ඨානා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "20. තං කිම්මඤ්ඤන්ති භොන්තො දෙවා තාවතිංසා, යාව සුපඤ්ඤත්තාචිමෙ තෙන භගවතා ජානතා පස්සතා අරහතා සම්මාසම්බුද්ධෙන. චත්තාරො සතිපට්ඨානා කුසලස්සාධිගමාය. කතමෙ චත්තාරො? ඉධ භො භික්ඛු අජ්ඣත්තං කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. අජ්ඣත්තං කායෙ කායානුපස්සී විහරන්තො තත්ථ සම්මා සමාධියති, සම්මා විප්පසීදති. සො තත්ථ සම්මාසමාහිතො සම්මාවිප්පසන්නො බහිද්ධා පරකායෙ ඤාණදස්සනං අභිනිබ්බත්තෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අජ්ඣත්තං වෙදනාසු වෙදනානුපස්සී විහරති, -පෙ- බහිද්ධා පරවෙදනාසු ..... ඤාණදස්සනං අභිනිබ්බත්තෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අජ්ඣත්තං චිත්තෙ චිත්තානුපස්සී විහරති -පෙ- බහිද්ධා පරචිත්තෙ ඤාණදස්සනං අභිනිබ්බත්තෙති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "භවත්නි, තව ද මෙහි එක්තරා පුඟුලෙක් ‘මේ කුසල යැ’ යි තත් වූ පරිදි නො දනී. ‘මේ අකුසලැ’ යි තත් වූ පරිදි නොදනී. මේ නිවැරදිය, මේ වැරැදි ය, මේ සෙවියැ යුතු ය, මේ නොසෙවිය යුතු ය, මේ පහත් ය, මේ උතුම් ය, මේ කුශලාකුශල සප්‍රතිභාගධර්ම යැ යි තත්ත්වාකාරයෙන් නො දනී. හේ පසුකාලයෙහි ආර්‍ය්‍යධර්මය අසයි, එය ධර්මානුධර්ම ප්‍රතිපත්තියට උපාය වශයෙන් මෙනෙහි කරයි. නවලොවුතුරා ද මට අනුලොම් වූ ධර්මය පිළිපදී. හෙ තෙම ආර්‍ය්‍ය ධර්මය ඇසීම ද, යෝනිසෝමනස්කාරය ද, ධර්මානුධර්මප්‍රතිපත්තිය ද නිසා ‘මේ කුසලැ’යි තත් වූ පරිදි දැන ගනී. ‘මේ අකුසලැ’ යි තත් වූ පරිදි දැනගනී. ‘මේ වරද සහිත යැ’ යි ‘මේ වරද රහිත යැ’ යි ‘මේ සෙවිය යුතු යැ’ යි ... ‘මේ නො සෙවිය යුතු යැ’ යි ... ‘මේ හීන යැ’ යි ... ‘මේ ප්‍රණීත යැ’ යි ‘මේ කුශලාකුශල සප්‍රතිභාග ධර්ම යැ’ යි තත් වූ පරිදි දැන ගනී. මෙසේ දන්නා, මෙසේ දක්නා ඔහුගේ අවිද්‍යාව ප්‍රහීණ වේ, විද්‍යාව උපදී. අවිද්‍යාව පහ වීමෙන් විද්‍යාව ඉපැදීමෙන් සුවය පහළ වේ. සුවය පහළ වීමෙන් වඩාත් (මතු මත්තෙහි) සොම්නස උපදී. භවත්නි, යම් සේ සතුටින් බලවත් සොම්නස උපදී ද, එසේ ම අවිද්‍යාව පහ වීමෙන් විද්‍යාව (රහත්මඟනුවණ පහළ වීමෙන් රහත්මඟ පල සුව) පහළ වේ. ඒ සුවය පහළ වීමෙන් (සමවතින් නැඟී සිටියාහට) මතු මත්තෙහි සොම්නස උපදී. භවත්නි, මේ වනාහි දන්නා දක්නා ඒ භගවත් අර්හත් සම්‍යක්සම්බුද්ධයන් වහන්සේ විසින් සුව ලබනු පිණිස දැන වදාරන ලද තෙවෙනි අවකාශාධිගමය යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මේ වනාහි දන්නා දක්නා ඒ භාග්‍යවතුන් වහන්සේ විසින් සුව ලබනු පිණිස දැන වදාරන ලද අවකාශාධිගම තුන යැ. වහන්ස, සනත්කුමාර බ්‍රහ්ම තෙම මෙ කරුණ පැවැසී ය. හේ මෙ කරුණ පවසා, තව්තිසා වැසි දෙවියන් බණවා මෙසේ කී ය:",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "සිහිවටන් ",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "භවත් තව්තිසාවැසි දෙවියෝ එය කිමැ යි සිතත් ද? දන්නා දක්නා ඒ භගවත් අර්හත් සම්‍යක් සම්බුද්ධයන් වහන්සේ විසින් (මාර්ගඵල) කුශල ප්‍රතිලාභය පිණිස මේ සතර සීවටන්හු කොතරම් මැනැවින් පණවා වදාරන ලදහු ද! ඒ කවර සතර දෙනෙක් ද? යත්: භවත්නි, මෙහි මහණ තෙම තමාගේ කයෙහි කායානුපස්සනාව කරන සුලු වූයේ කෙලෙස් තවන වැර ඇතියේ, සම්‍යක්ප්‍රඥා ඇත්තේ සිහි ඇත්තේ, (කාය සංඛ්‍යාත) ලෝකය කෙරෙහි අභිධ්‍යාව ද දොම්නස ද මැඩ වෙසෙයි. ආධ්‍යාත්මික කයෙහි කායානුපස්සී ව වසනුයේ එහි මොනොවට සිත පිහිටුවයි (සිත එකඟ කෙරෙයි). (එසේ වූ ඔහු) සිත මොනොවට පහදී. හේ එහි මොනොවට සමාධිගත වූයේ මොනොවට පහන් වූයේ බැහැරැ අනුන්ගේ කයෙහි (අනුන්ගේ කය අරමුණු කොට) දර්ශනඥානය උපදවයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තමා කෙරෙහි වූ වේදනාවන්හි වේදනානුපස්සී ව ... වෙසෙයි පිටත්හි අනුන්ගේ වේදනාවන්හි දර්ශනඥානය උපදවයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තමාගේ සිතෙහි චිත්තානුපස්සී වැ වෙසෙයි. පිටත්හි අනුන්ගේ සිත්හි දර්ශනඥානය උපදවයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 330,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අජ්ඣත්තං ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. අජ්ඣත්තං ධම්මෙසු ධම්මානුපස්සී විහරන්තො තත්ථ සම්මා සමාධියති, සම්මා විප්පසීදති. සො තත්ථ සම්මා සමාහිතො සම්මා විප්පසන්නො බහිද්ධා පරධම්මෙසු ඤාණදස්සනං අභිනිබ්බත්තෙති. ඉමෙ ඛො භො තෙන භගවතා ජානතා පස්සතා අරහතා සම්මාසම්බුද්ධෙන චත්තාරො සතිපට්ඨානා පඤ්ඤත්තා කුසලස්ස අධිගමායාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදමත්ථං භන්තෙ බ්රහ්මා සනංකුමාරො භාසිත්ථ. ඉදමත්ථං භන්තෙ බ්රහ්මා සනංකුමාරො භාසිත්වා දෙවෙ තාවතිංසෙ ආමන්තෙසි."
                    },
                    {
                        "type": "centered",
                        "text": "සමාධිපරික්ඛාරා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "21. තං කිම්මඤ්ඤන්ති භොන්තො දෙවා තාවතිංසා යාවසුපඤ්ඤත්තාචිමෙ තෙන භගවතා ජානතා පස්සතා අරහතා සම්මාසම්බුද්ධෙන සත්ත සම්මාසමාධිපරික්ඛාරා සම්මාසමාධිස්ස භාවනාය සම්මාසමාධිස්ස පාරිපූරියා. කතමෙ සත්ත? සම්මාදිට්ඨි සම්මාසංකප්පො සම්මාවාචා සම්මාකම්මන්තො සම්මාආජීවො සම්මාවායාමො සම්මාසති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යා ඛො භො ඉමෙහි සත්තහි අඞ්ගෙහි චිත්තස්ස එකග්ගතා පරික්ඛතා, අයං වුච්චති භො අරියො සම්මාසමාධි සඋපනිසො ඉතිපි සපරික්ඛාරො ඉතිපි. සම්මාදිට්ඨිස්ස භො සම්මාසඞ්කප්පො පහොති, සම්මාසඞ්කප්පස්ස සම්මාවාචා පහොති, සම්මාවාචස්ස සම්මාකම්මන්තො පහොති. සම්මාකම්මන්තස්ස සම්මාආජීවො පහොති. සම්මාආජීවස්ස සම්මාවායාමො පහොති, සම්මාවායාමස්ස සම්මාසති පහොති, සම්මාසතිස්ස සම්මාසමාධි පහොති, සම්මාසමාධිස්ස සම්මාඤාණං පහොති, සම්මාඤාණස්ස සම්මාවිමුත්ති පහොති. යං හි තං භො සම්මා වදමානො වදෙය්ය, ස්වාක්ඛාතො භගවතා ධම්මො සන්දිට්ඨිකො අකාලිකො එහිපස්සිකො ඔපනයිකො පච්චත්තං වෙදිතබ්බො විඤ්ඤූහි අපාරුතා අමතස්ස ද්වාරා’ති, ඉද මෙතං සම්මා වදමානො වදෙය්ය. ස්වාක්ඛාතො හි භො භගවතා ධම්මො සන්දිට්ඨිකො අකාලිකො එහිපස්සිකො ඔපනයිකො{1} පච්චත්තං වෙදිතබ්බො විඤ්ඤූහි. අපාරුතා අමතස්ස ද්වාරාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඔපනෙය්යකො - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "අධ්‍යාත්මයෙහි (නාමසන්තානගත) ධර්මයන්හි ධර්මානුපස්සී ව කෙලෙස් තවන වැර ඇත්තේ සම්‍යක්ප්‍රඥායෙන් දන්නේ, සිහි ඇත්තේ, ධර්ම සංඛ්‍යාත ලෝකයෙහි අභිධ්‍යා ද දොම්නස් ද බැහැර කොට වෙසෙයි. අධ්‍යාත්මයෙහි ධර්මයන්හි ධර්මානුදර්ශී ව වසන්නේ එහි මොනොවට සිත පිහිටුවයි. (එයින්) එහි මොනොවට සිත පහදී. හේ එහි මොනොවට සමාහිත (එකඟ සිතැති) වූයේ මොනොවට පහන් වූයේ පිටත් හි අනුන්ගේ (නාමසන්තානගත) ධර්මයන් කෙරෙහි දර්ශනඥානය උපදවයි. හවත්නි, මොහු වනාහි දන්නා දක්නා ඒ භගවත් අර්හත් සම්‍යක් සම්බුද්ධයන් වහන්සේ විසින් කුසල් දහම් පිළිලබනු පිණිස පණවන ලද සතර සීවටන්හු ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "වහන්ස, සනත්කුමාර බ්‍රහ්ම තෙම මෙ කරුණ සැළ කෙළේ ය. වහන්ස, සනත් කුමාර බ්‍රහ්ම මෙ කරුණ සැළ කොට, තව්තිසාවැසි දෙවියන් බණවා මෙය කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "සමාධිපරිෂ්කාරධර්ම",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "21. භවත් තව්තිසාවැසි දෙවියෝ එය කිමැ යි සිතත් ද? දන්නා දක්නා ඒ භගවත් අර්හත් සම්‍යක් සම්බුද්ධයන් වහන්සේ විසින් සම්‍යක් සමාධිය වඩනු පිණිස සම්‍යක්සමාධිය පිරිපුන් කරනු පිණිස, මේ සම්‍යක්සමාධිපරිෂ්කාර ධර්මයෝ (පරිවාර ධර්මයෝ) සත් දෙනෙක් කොතරම් මනා කොට පණවන ලද්දා හු ද! ඒ කවර සත් දෙනෙක් ද? යත්: සම්‍යක්දෘෂ්ටිය, සම්‍යක්සංකල්පය, සම්‍යග්වචනය, සම්‍යක්කර්මාන්තය, සම්‍යගාජීවය, සම්‍යග්ව්‍යායාම ය, සම්‍යක්ස්මෘතිය යන මොහු ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භවත්නි, මේ සත් අංගයන් විසින් යම් සිත එකඟ බවෙක් පිරිවරන ලද ද, භවත්නි, ඒ මේ ආර්‍ය්‍ය සම්‍යක් සමාධිය උපනිඃශ්‍රය සහිත යැ යි ද පරිවාර සහිත යැ යි ද කියනු ලැබේ. භවත්නි, සම්‍යක්දෘෂ්ටියෙහි පිහිටියාහට සම්‍යක්සංකල්පය පවතී, සම්‍යක් සංකල්පය ඇත්තාහට සම්‍යග්වචනය පවතී, සම්‍යග්වචනය ඇත්තහුට සම්‍යක්කර්මාන්තය පවතී, සම්‍යක්කර්මාන්තය ඇත්තහුට සම්‍යගාජීවය පවතී, සම්‍යගාජීවය ඇත්තහුට සම්‍යග්ව්‍යායාමය පවතී, සම්‍යග්ව්‍යායාමය ඇත්තහුට සම්‍යක්ස්මෘතිය පවතී, සම්‍යක්ස්මෘතිය ඇත්තහුට සම්‍යක් සමාධිය පවතී, සම්‍යක් සමාධිය ඇත්තහු ට සම්‍යග් ඥානය පවතී, සම්‍යග් ඥානය ඇත්තහු ට සම්‍යග්විමුක්තිය පවතී, භවත්නි, යමක් පිළිබඳ වැ මනා කොට කියන තැනැත්තේ, “මේ ධර්මය භාග්‍යවතුන් වහන්සේ විසින් මොනොවට වදාරන ලද්දේ ය, සාන්දෘෂ්ටික ය, අකාලික ය, ‘එව බලව’ යි දැක්විය යුත්තේ ය, සිය සතන්හි එළැවියයුත්තේ ය, නුවණැත්තන් විසින් තම තමන් කෙරෙ හි ලා දත යුත්තේ ය, අමා දොරවල් අරනා ලදුහ” යි කියන්නේ නම්, හේ මේ දහම පිළිබඳ වැ ම ය. ‘භවත්නි, භාග්‍යවතුන් වහන්සේ විසින් ධර්මය මොනොවට වදාරන ලද්දේ ය, එය සාන්දෘෂ්ටික ය, අකාලිකය, එව බලව යි දැක්විය යුත්තේ ය, සිය සතන් හි එළැවිය යුත්තේ ය, නුවණැත්තන් විසින් තම තමන් කෙරෙහි ලා දත යුත්තේ ය, අමා දොරවල් අරනා ලදුහ” යි මනා කොට කියන තැනැත්තේ මෙය කියන්නේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 332,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යෙ හි කෙචි භො බුද්ධෙ අවෙච්චප්පසාදෙන සමන්නාගතා, ධම්මෙ අවෙච්චප්පසාදෙන සමන්නාගතා, සඞ්ඝෙ අවෙච්චප්පසාදෙන සමන්නාගතා, අරියකන්තෙහි සීලෙහි සමන්නාගතා. යෙ චිමෙ ඔපපාතිකා ධම්මවිනීතා සාතිරෙකානි චතුවීසතිසතසහස්සානි මාගධකා පරිචාරකා අබ්භතීතා කාලකතා තිණ්ණං සඤ්ඤොජනානං පරික්ඛයා සොතාපන්නා අවිනිපාතධම්මා නියතා සම්බොධිපරායණා. අත්ථි චෙවෙ ත්ථ සකදාගාමිනො."
                    },
                    {
                        "type": "gatha",
                        "text": "අත්ථායං{1} ඉතරා පජා පුඤ්ඤභාගාති මෙ මනො,\nසබ්බාතුං නොපි සක්කොමි මුසාවාදස්ස ඔත්තපන්ති.{2}"
                    },
                    {
                        "type": "paragraph",
                        "text": "22. ඉදමත්ථං භන්තෙ බ්රහ්මා සනංකුමාරො භාසිත්ථ. ඉදමත්ථං භන්තෙ, බ්රහ්මුනො සනංකුමාරස්ස භාසතො වෙස්සවණස්ස මහාරාජස්ස එවං චෙතසො පරිවිතක්කො උදපාදි. ‘අච්ඡරියං වත භො. අබ්භුතං වත භො, එවරූපොපි නාම උළාරො සත්ථා භවිස්සති, එවරූපං උළාරං ධම්මක්ඛානං, එවරූපා උළාරා විසෙසාධිගමා පඤ්ඤායිස්සන්තී’ති. අථ භන්තෙ බ්රහ්මා සනංකුමාරො වෙස්සවණස්ස මහාරාජස්ස චෙතසා චෙතො පරිවිතක්කමඤ්ඤාය වෙස්සවණං මහාරාජානං එතදවොච: “තං කිම්මඤ්ඤති භවං වෙස්සවණො මහාරාජා. අතීතම්පි අද්ධානං එවරූපො උළාරො සත්ථා අහොසි, එවරූපං උළාරං ධම්මක්ඛානං, එවරූපා උළාරා විසෙසාධිගමා පඤ්ඤායිංසු. අනාගතම්පි අද්ධානං එවරූපො උළාරො සත්ථා භවිස්සති. එවරූපං උළාරං ධම්මක්ඛානං, එවරූපා උළාරා විසෙසාධිගමා පඤ්ඤායිස්සන්තී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "23. ඉදමත්ථං භන්තෙ බ්රහ්මා සනංකුමාරො දෙවානං තාවතිංසානං අභාසි, ඉදමත්ථං වෙස්සවණො මහාරාජා බ්රහ්මුනො සනංකුමාරස්ස දෙවානං තාවතිංසානං භාසතො සම්මුඛා සුතං සම්මුඛා පටිග්ගහිතං සයං පරිසායං ආරොචෙසි. ඉදමත්ථං ජනවසභො යක්ඛො වෙස්සවණස්ස මහාරාජස්ස සයං පරිසායං භාසතො සම්මුඛා සුතං සම්මුඛා පටිග්ගහිතං භගවතො ආරොචෙසි. ඉදමත්ථං භගවා ජනවසභස්ස යක්ඛස්ස සම්මුඛා සුත්වා සම්මුඛා පටිග්ගහෙත්වා සාමඤ්ච අභිඤ්ඤාය ආයස්මතො ආනන්දස්ස ආරොචෙසි. ඉදමත්ථං ආයස්මා ආනන්දො භගවතො සම්මුඛා සුත්වා සම්මුඛා පටිග්ගහෙත්වා ආරොචෙසි භික්ඛූනං භික්ඛුනීනං උපාසකානං උපාසිකානං ‘තයිදං බ්රහ්මචරියං ඉද්ධඤ්චෙව ඵීතඤ්ච විත්ථාරිතං බාහුජඤ්ඤං පුථුභූතං යාව දෙවමනුස්සෙහි සුප්පකාසිතන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "ජනවසභසුත්තං පඤ්චමං.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අථායං - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ඔත්තප්පන්ති - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "භවත්නි, යම් කෙනෙක් බුදුරජුන් කෙරෙහි දැන පැහැදීමෙන් යුක්ත ද, දහම් කෙරෙහි දැන පැහැදීමෙන් යුක්ත ද, සඟන කෙරෙහි දැන පැහැදීමෙන් යුක්ත ද, ආර්‍ය්‍යකාන්ත (ආර්‍ය්‍යයන් විසින් මැනැවැ යි සම්මත වූ) ශීලයන්ගෙන් සමන්විත ද, තව ද යම් කෙනෙක් ආර්‍ය්‍ය මාර්ගධර්මයෙහි හික්මුණාහු ඕපපාතික උත්පත්තිය ලැබූ, මගධ රටැ වුසූ, තුන් සංයෝජනයන් නසා ලීමෙන් සෝවාන් වූ, අපායකට නොවැටෙන සුලු, රහත් බවට නියත වූ, රහත්ඵලය පිහිට කොටැති, සමීප අතීතයෙහි කලුරිය කළ උවසුවෝ අතිරේකයක් සහිත සූවිසි ලක්ෂයෙක් වෙත්. මෙහි සෙදැගැමිහු ද, ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ශුද්ධාවාසයෙහි උපදනට හේතු වූ පුණ්‍ය භාග (පින් කොටස්) ඇති බැවින් එහි උපන් අනාගාමී හු දැ යි යන මේ තවත් සත්ත්ව කෙනෙක් ද ඇත යනු මගේ හැඟීම යි. මුසවා කෙරෙන් බිය වන්නෙම් ඔවුන් ගණනින් නියම කොට කියන්නට නොහැක්කෙමි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "22. වහන්ස, මෙ කරුණ සනත්කුමාර බ්‍රහ්ම පැවැසී. වහන්ස, මෙ කරුණ පවසන සනත්කුමාර බඹහුගේ වචනය අසා වෙසමුණු මහරජුට “භවත්නි, ආශ්චර්‍ය්‍යයෙක! භවත්නි, පුදුමයෙක! මෙ බඳු වූත් උදාර ශාස්තෘවරයෙක් වේ ද! මෙබඳු වූත් උදාර ධර්මකථාවෙක් වේ ද! මෙබඳු මහත් විශේෂාධිගම කෙනෙක් පැණෙත් දැ!” යි මෙසේ චිත්තසංකල්පනාවෙක් උපන. වහන්ස, ඉක්බිත්තෙන් සනත්කුමාර බ්‍රහ්ම තෙම සිය සිතින් වෙසමුණු මහරජුගේ චිත්තපරිවිතර්කය දැන ඔහුට “පින්වත් වෙසවුණු මහරජාණෝ එය කිමැ යි සිතත් ද? ඉකුත් කල්හිත් මෙ බඳු උදාර ශාස්තෘවරයෙක්, මෙ බඳු උදාර ධර්මකථාවෙක් වී ය. මෙබඳු උදාර විශේෂාධිගම කෙනෙක් පැනුණාහු ය, මතු කල්හිත් මෙබඳු උදාර ශාස්තෘවරයෙක්, මෙබඳු උදාර ධර්මකථාවෙක් වන්නේ ය. මෙබඳු උදාර විශේෂාධිගම කෙනෙක් පැනෙන්නාහු යැ” යි මෙ බස් පැවැසී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "23. වහන්ස, සනත්කුමාර බ්‍රහ්ම තෙම තව්තිසාවැසි දෙවියනට මෙ කරුණ පැවැසී ය. වෙසවුණු මහරජ තව්තිසා වැසි දෙවියනට මෙ කරුණ කියන සනත්කුමාර බඹුහුගේ වචනය අසා, ඔහු හමුයෙහි අසන ලද්ද, ඔහු හමුයෙන් අසා පිළිගන්නා ලද්ද තෙමේ සිය පිරිසෙහි දැන්වී ය. තම පිරිසෙහි මෙ කරුණ කියන වෙසවුණු මහරජුගේ වචනය ඔහු හමුයෙහි අසන ලද්ද, ඔහු හමුයෙන් පිළිගන්නා ලද්ද ජනවසභ යක් තෙමේ භාග්‍යවතුන් වහන්සේට සැළ කෙළේ ය. භාග්‍යවතුන් වහන්සේ මෙ කරුණ කියන ජනවසභ යක්ෂයාගේ වචනය අසා, ඔහු වචනය පිළිගෙන, තමන් වහන්සේ ද (සිය නුවණින් බලා) වෙසෙසින් දැන, අනඳ තෙරුනට දැන්වූ සේක. අනඳ තෙරණුවෝ මෙ කරුණ භාග්‍යවතුන් වහන්සේගේ හමුයෙන් අසා, හමුයෙහි දී පිළිගෙන, “ඒ මේ ශාසන බ්‍රහ්මචර්‍ය්‍යය යම්තාක් කල් දෙව් මිනිසුන් විසින් මොනොවට ප්‍රකාශිත වන්නේ ද, ඒ තාක් ම වැඩුණේ ද සමෘද්ධ ද පතළේ ද බොහෝ දෙනා අතරැ ප්‍රසිද්ධ ද ස්ථිර ද වේ යැ මහණුනට මෙහෙණිනට උවසුවනට උවැසියනට සැළ කළහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පස්වන ජනවසභ සූත්‍රය නිමියේ ය.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ]
}