{
    "filename": "dn-3-7",
    "bookId": 12,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 236,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "7.",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": " ලක්ඛණසුත්තං",
                        "level": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "1. එවං මෙ සුතං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි ‘භික්ඛවො’ති. ‘භදන්තෙ’ති{1} තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ද්වත්තිංසිමානි භික්ඛවෙ මහාපුරිසස්ස මහාපුරිසලක්ඛණානි යෙහි සමන්නාගතස්ස මහාපුරිසස්ස ද්වෙව ගතියො භවන්ති අනඤ්ඤා: සචෙ අගාරං අජ්ඣාවසති රාජා හොති චක්කවත්තී ධම්මිකො ධම්මරාජා චාතුරන්තො විජිතාවී ජනපදත්ථාවරියප්පත්තො සත්තරතනසමන්නාගතො. තස්සිමානි සත්ත රතනානි භවන්ති සෙය්යථිදං: චක්කරතනං හත්ථිරතනං අස්සරතනං මණිරතනං ඉත්ථිරතනං ගහපතිරතනං පරිණායකරතනමෙව සත්තමං. පරොසහස්සං ඛො පනස්ස පුත්තා හොන්ති සූරා වීරඞ්ගරූපා පරසෙනප්පමද්දනා. සො ඉමං පඨවිං සාගරපරියන්තං අදණ්ඩෙන අසත්ථෙන ධම්මෙන අභිවිජිය අජ්ඣාවසති. සචෙ ඛො පන අගාරස්මා අනගාරියං පබ්බජති, අරහං හොති සම්මාසම්බුද්ධො ලොකෙ විවත්තච්ඡදො{2} කතමානි තානි භික්ඛවෙ ද්වත්තිංස මහාපුරිසස්ස මහාපුරිසලක්ඛණානි යෙහි සමන්නාගතස්ස මහාපුරිසස්ස ද්වෙව ගතියො භවන්ති අනඤ්ඤා? සචෙ අගාරං අජ්ඣාවසති, රාජා හොති චක්කවත්තී -පෙ- සචෙ ඛො පන අගාරස්මා අනගාරියං පබ්බජති, අරහං හොති සම්මාසම්බුද්ධො ලොකෙ විවත්තච්ඡදො."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. ඉධ භික්ඛවෙ මහාපුරිසො සුප්පතිට්ඨිතපාදො හොති. යම්පි භික්ඛවෙ මහාපුරිසො සුප්පතිට්ඨිතපාදො හොති, ඉදම්පි භික්ඛවෙ මහාපුරිසස්ස මහාපුරිසලක්ඛණං භවති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. භද්දන්තෙ ති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. විවටච්ඡදො - ස්යා. කම්. විවට්ටච්ඡදො - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "7.",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "ලක්ඛණ සූත්‍රය",
                        "level": 3
                    },
                    {
                        "format": 13,
                        "text": "1. මා විසින් මෙසේ අසන ලදි:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර නිසා දෙව්රම් නම් වූ අනේපිඬු සිටුහුගේ අරමෙහි වැඩවසන සේක. එහි දී භාග්‍යවතුන් වහන්සේ ‘මහණෙනි’යි භික්ෂූන් ඇමතූසේක. ‘පින්වතුන් වහන්සැ’යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළසේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“මහණෙනි, යමෙකින් සමන්විත මහ පුරිස්හට නිෂ්ඨා දෙකෙක් ම වේ ද, අන් තෙවැන්නෙක් නැද්ද, එසේ වූ මහපුරිස්හුගේ මහ පුරිස් ලකුණු දෙතිසෙක් වෙත්. ඔහු පිළිබඳ වූ ඒ නිෂ්ඨා දෙක නම්:\nඉදින් ගිහි ගෙහි වසන්නේ නම්, දැහැමි වූ (දස කුසල් දහම් රක්නා), දැහැමෙන් රජය ලැබ රජ වූ, සිවුසයුර ඉම් කොටැති සිවු මහදිවයිනට නායක වූ, සතුරන් දිනූ, දනවුහි තහවුරු බවට පැමිණි, සත් රුවනින් සමන්වාගත වූ, සක්විති රජෙක් වෙයි. සක්රුවන, ඇත්රුවන, අස්රුවන, මිණිරුවන, ඉතිරිරුවන, ගැහැවිරුවන, සත්වනු පුත්රුවන ම යැ යි ඔහුට මේ සත්රුවන් කෙනෙක් වෙත්. ශූර, වීර ඇඟ රුව ඇති, සතුරු සෙන් මඩිනුයෙහි බුහුටි වූ පුත්තු අයිරා දහස් දෙනෙක් ඔහුට වෙත්. ඒ සක්විති තෙමේ සයුරහිම් කොට මේ පොළොව දඬුවමින් තොර වැ අවියෙන් තොර වැ දැහැමෙන් දිනා එයට අධිපති වැ වෙසෙයි. ඉදින් ගිහිගෙන් නික්මැ පැවිදි බිම වදනේ වී නම්. පෙරළා ලූ කෙලෙස් සෙවෙණි ඇති, රහත් සම්මාසම්බුදුවරයෙක් වෙයි. මහණෙනි, යම් දෙතිස් මහපුරිස් ලකුණින් යුත් මහ පුරිස්හට ගති දෙකෙක්ම වේ ද, අන් තෙවැන්නෙක් නො වේ ද, ඉදින් ගිහි ගෙහි වසන්නේ නම් … සක්විති රජ වන්නේ ද, ගිහිගෙන් නික්ම පැවිදි වන්නේ නම්, ලොවැ කෙලෙස් සෙවෙණි පෙරළා ලූ රහත් සම්මාසම්බුදුවරයෙක් වන්නේ ද, මහපුරිස්හුගේ එසේ වූ දෙතිස් මහපුරිස් ලකුණු කවුරු ද? යත්:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "2. මහණෙනි, මෙහි මහ පුරිස් තෙමේ සුපිහිටි පා ඇත්තේ වෙයි. මහණෙනි ‘මහපුරිස්තෙමෙ සුපිහිටි පා ඇත්තේය’ යන යමෙක් ඇද්ද, මෙය මහපුරිස්හුගේ මහපුරිස් ලකුණෙක් වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 238,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං භික්ඛවෙ මහාපුරිසස්ස හෙට්ඨාපාදතලෙසු චක්කානි ජාතානි හොන්ති සහස්සාරානි සනෙමිකානි සනාභිකානි සබ්බාකාරපරිපූරානි.{1} යම්පි භික්ඛවෙ මහාපුරිසස්ස හෙට්ඨාපාදතලෙසු චක්කානි ජාතානි හොන්ති සහස්සාරානි සනෙමිකානි සනාභිකානි සබ්බාකාරපරිපූරානි, ඉදම්පි භික්ඛවෙ මහාපුරිසස්ස මහාපුරිසලක්ඛණං භවති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං භික්ඛවෙ මහාපුරිසො ආයතපණ්හි හොති -පෙ- දීඝඞ්ගුලි හොති -පෙ- මුද්රතළුනහත්ථපාදො හොති -පෙ- ජාලහත්ථපාදො හොති -පෙ- උස්සඞ්ඛපාදො හොති -පෙ- එණිජඞ්ඝො හොති -පෙ- ඨිතකො’ව අනොනමන්තො උභොහි පාණිතලෙහි ජණ්ණුකානි පරිමසති පරිමජ්ජති -පෙ- කොසොහිතවත්ථගුය්හො හොති -පෙ- සුවණ්ණවණ්ණො හොති කඤ්චනසන්නිභත්තචො -පෙ- සුඛුමච්ඡවි හොති සුඛුමත්තා ඡවියා රජොජල්ලං කායෙ න උපලිප්පති -පෙ- එකෙකලොමො හොති, එකෙකානි ලොමානි ලොමකූපෙසු ජාතානි -පෙ- උද්ධග්ගලොමො හොති, උද්ධග්ගානි ලොමානි ජාතානි නීලානි අඤ්ජනවණ්ණානි කුණ්ඩලාවත්තානි{2} පදක්ඛිණාවත්තකජාතානි -පෙ- බ්රහ්මුජ්ජුගත්තො හොති -පෙ- සත්තුස්සදො හොති -පෙ- සීහපුබ්බද්ධකායො හොති -පෙ- චිතන්තරංසො -පෙ- නිග්රොධපරිමණ්ඩලො හොති, යාවතක්වස්ස කායො, තාවතක්වස්ස බ්යාමො, යාවතක්වස්ස බ්යාමො තාවතක්වස්ස කායො -පෙ- සමවත්තක්ඛන්ධො හොති -පෙ- රසග්ගසග්ගී හොති -පෙ- සීහහනු හොති -පෙ- චත්තාළීසදන්තො හොති -පෙ- සමදන්තො හොති -පෙ- අවිරළදන්තො හොති -පෙ- සුසුක්කදාඨො හොති -පෙ- පහූතජිව්හො හොති -පෙ- බ්රහ්මස්සරො හොති, කරවීකභාණී -පෙ- අභිනීලනෙත්තො හොති -පෙ- ගොපඛුමො හොති -පෙ- උණ්ණා භමුකන්තරෙ ජාතා හොති ඔදාතා මුදුතූලසන්නිභා. යම්පි භික්ඛවෙ මහාපුරිසස්ස උණ්ණාභමුකන්තරෙ ජාතා හොති ඔදාතා මුදුතූලසන්නිභා ඉදම්පි භික්ඛවෙ මහාපුරිසස්ස මහාපුරිසලක්ඛණං භවති. පුන ච පරං භික්ඛවෙ මහාපුරිසො උණ්හීසසීසො හොති. යම්පි භික්ඛවෙ මහාපුරිසො උණ්හීසසීසො හොති, ඉදම්පි භික්ඛවෙ මහාපුරිසස්ස මහාපුරිසලක්ඛණං භවති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සබ්බාකාර පරිපූරාණි සුවිභත්තනතරාණි - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. කුණ්ඩලාවට්ටානි - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "තව ද අනෙකක් කියමි. මහ පුරිස්හුගේ යැටි පතුල්හි දහසක් දැවි ඇති, නිම්වළලු සහිත, නාභි සහිත හැම අයුරින් පිරිපුන් මොනොවට බෙදුණු අතර ඇති, සක් ලකුණෝ පහළ වූවාහු වෙත්. මහණෙනි, පුරිස්හුගේ යැටි පතුල්හි දහසක් දැවි ඇති, නිම්වළලු සහිත, නාභිසහිත, හැම අයුරින් පිරිපුන්, මොනොවට බෙදුණු අතර ඇති, සක් ලකුණෝ පහළ වූවාහු වෙත් යන යමෙක් ඇද්ද, මෙය ද මහණෙනි, මහපුරිස්හුගේ ලකුණෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද අනෙකෙකි. මහණෙනි, මහපුරිස් තෙමේ දික් විලුම් ඇත්තේ වෙයි … දික් ඇඟිලි ඇත්තේ වෙයි … මොළොක් වූ තුරුණු අතුල් පතුල් ඇත්තේ වෙයි … දැල් කවුළුවකට බඳු අත් පා ඇත්තේ වෙයි … මත්තෙහි ගොප් ඇටය පිහිටි පා ඇත්තේ වෙයි … ඕළු මුවන්ගේ බඳු කෙංඩා ඇත්තේ වෙයි … සිටියේ ම නො නැමෙනුයේ දෙ අත්ලෙන් දෙ දන ස්පර්‍ශ කෙරෙයි, පිරිමදියි … කොපුයෙහි ගිලුණු වස්තු ගුහ්‍යය ඇත්තේ වෙයි … රන් බඳු පැහැ ඇත්තේ, කසුන් පැහැ සිවිය ඇත්තේ වෙයි … සියුම් සිවිය ඇත්තේ වෙයි; සිවිය සියුම් බැවින් කයෙහි රජස් දැලි නො ලැගෙයි … එකෙකී ලොම් ඇත්තේ වෙයි. රෝමකූපයන්හි තනි තනි ම වැ (එකෙක් එකෙක් ම) ලොම් හට ගත්තේ වෙයි … උඩුකුරු අක්ඇති ලොම් ඇත්තේ වෙයි. උඩුකුරු වූ අක් ඇති, නිල් පැහැ අඳුන්වන්, කොඩොල් බඳු වක් වූ, දකුණට කරකැවුණු ලොම්හු හටගත්තාහු වෙත් … බඹහුගේ බඳු ඍජු (නොනැමුණු) සිරුරු ඇත්තේ වෙයි … කයැ දෙ අත් පිටු ඈ උස් වැ මතු වූ සත් තැනක් ඇත්තේ වෙයි … සීරදහක්හුගේ පෙරඩ කය බඳු පිරුණු කය ඇත්තේ වෙයි … පිරුණු (මොනොවට තැනුණු) පිටතුරු ඇත්තේ වෙයි … නුගරුකක් බඳු පිරිමඬුලු (සමප්‍රමාණ) කය ඇත්තේ වෙයි … ඔහුගේ කය යම් පමණ ද ඔහුගේ බඹය ද එ පමණ ම ය. ඔහුගේ බඹය යම් පමණ ද ඔහුගේ කයත් එ පමණ ම ය (කයේ උස පමණ ම බඹය ද වෙයි) … සම වට ගෙල ඇත්තේ වෙයි … (සත් සියක්) රසනහර තුඩු දුන් ගෙල ඇත්තේ වෙයි … සීරදක්හුගේ බඳු හනු ඇත්තේ වෙයි … සම සතලිසක් දත් ඇත්තේ වෙයි … සම වූ දත් ඇත්තේ වෙයි … අතරැ විවර නැති සේ පිහිටි දත් ඇත්තේ වෙයි … ඉතා සුදු දළ ඇත්තේ වෙයි … පුළුල් දිව ඇත්තේ වෙයි … බඹහුගේ බඳු කටහඬ ඇත්තේ, කුරවිකෙවිල්ලනගේ බඳු මධුර නාද ඇත්තේ වෙයි … ඉතා නිල් නෙතැත්තේ වෙයි … රත්පැහැ ලමා වස්සක්හුගේ බඳු ඇස්මඬල ඇත්තේ වෙයි … සුදු මොළොක් පුලුන් රොදක් බඳු ඌර්‍ණ රෝමයක් දෙබැම අතරැ හටගත්තේ වෙයි. මහණෙනි, යම් සුදු වූ මොළොක් වූ පුලුන් රොදක් බඳු ඌර්‍ණ රෝමයෙක් ද බැම අතරැ හටගත්තේ ද, මහණෙනි, මෙය ද මහපුරිස්හුගේ මහපුරිස් ලකුණෙක් වෙයි. තව ද අනෙකෙකි. මහපුරිස් තෙමේ උෂ්ණිෂ ශීර්‍ෂ වෙයි. (නළල් පටින් වෙළුණක්හු බඳු පිරිපුන් නළල් තල ද පිරිපුන් හිස ද ඇත්තේ වෙයි). මහණෙනි, මහපුරිස් තෙමෙ උෂ්ණීෂ ශීර්‍ෂ වෙයි යන යමෙක් ඇද්ද මෙය ද මහණෙනි, මහපුරිස්හුගේ මහපුරිස් ලකුණෙක් වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 240,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉමානි ඛො තානි භික්ඛවෙ ද්වත්තිංස මහාපුරිසස්ස මහාපුරිසලක්ඛණානි යෙහි සමන්නාගතස්ස මහාපුරිසස්ස ද්වෙව ගතියො භවන්ති අනඤ්ඤා. සචෙ අගාරං අජ්ඣාවසති, රාජා හොති චක්කවත්තී -පෙ- සචෙ ඛො පන අගාරස්මා අනගාරියං පබ්බජති, අරහං හොති සම්මාසම්බුද්ධො ලොකෙ විවත්තච්ඡදො."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. ඉමානි ඛො භික්ඛවෙ ද්වත්තිංස මහාපුරිසස්ස මහාපුරිසලක්ඛණානි බාහිරකා පි ඉසයො ධාරෙන්ති. නො ච ඛො තෙ ජානන්ති ‘ඉමස්ස කම්මස්ස කතත්තා ඉදං ලක්ඛණං පටිලභතී’ති."
                    },
                    {
                        "type": "centered",
                        "text": "සුප්පතිට්ඨිතපාදලක්ඛණං (1)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො දළ්හසමාදානො අහොසි කුසලෙසු ධම්මෙසු අවත්ථිතසමාදානො, කායසුචරිතෙ වචීසුචරිතෙ මනොසුචරිතෙ, දානසංවිභාගෙ සීලසමාදානෙ උපොසථුපවාසෙ මත්තෙය්යතාය පෙත්තෙය්යතාය සාමඤ්ඤතාය බ්රහ්මඤ්ඤතාය කුලෙජෙට්ඨාපචායිතාය අඤ්ඤතරඤ්ඤතරෙසු ච අධිකුසලෙසු ධම්මෙසු. සො තස්ස කම්මස්ස කතත්තා උපචිතත්තා උස්සන්නත්තා විපුලත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති. සො තත්ථ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිග්ගණ්හාති, දිබ්බෙන ආයුනා දිබ්බෙන වණ්ණෙන දිබ්බෙන සුඛෙන දිබ්බෙන යසෙන දිබ්බෙන ආධිපතෙෙය්යන දිබ්බෙහි රූපෙහි දිබ්බෙහි සද්දෙහි දිබ්බෙහි ගන්ධෙහි දිබ්බෙහි රසෙහි දිබ්බෙහි ඵොට්ඨබ්බෙහි. සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉමං මහාපුරිසලක්ඛණං පටිලභති. සුප්පතිට්ඨිතපාදො හොති, සමං පාදං භූමියං නික්ඛිපති, සමං උද්ධරති, සමං සබ්බාවන්තෙහි පාදතලෙහි භූමිං ඵුසති. සො තෙන ලක්ඛණෙන සමන්නාගතො සචෙ අගාරං අජ්ඣාවසති රාජා හොති චක්කවත්තී ධම්මිකො ධම්මරාජා චාතුරන්තො විජිතාවී ජනපදත්ථාවරියප්පත්තො සත්තරතනසමන්නාගතො. තස්සිමානි සත්තරතනානි භවන්ති, සෙය්යථිදං චක්කරතනං හත්ථිරතනං අස්සරතනං මණිරතනං ඉත්ථිරතනං ගහපතිරතනං පරිණායකරතනමෙව සත්තමං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "මහණෙනි, මොහු වනාහි යමෙකින් යුත් මහ පුරිස්හුහේ ගති දෙකෙක් ම වේ ද, අන් තෙවැන්නෙක් නො වේ ද, ගිහිගෙහි වුසුවොත් … සක්විති වන්නේ ද, ගිහි ගෙන් නික්ම ලොවැ කෙලෙස් සෙවෙණි පෙරළාලූ රහත් සම්මාසම්බුදුවරයෙක් වන්නේ ද, එසේ වූ මහ පුරිසක්හු පිළිබඳ වූ ඒ දෙතිස් මහ පුරිස් ලකුණුහු වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "3. මහණෙනි, ඒ මේ දෙතිස් මහ පුරිස් ලකුණුහු සස්නෙන් බැහැරැ වූ ඍෂීහු ද සිත්හි ලා දරත්. ඔහු එය සිත්හි නො දරන්නාහු නම්, මෙබඳු කර්‍මයක් කළ බැවින් මෙ නම් ලකුණ ලබා යැ යි නො දන්නාහු ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "සුප්‍රතිෂ්ඨිත පාද ලක්ෂණය (1)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, තථාගත තෙමේ පෙර දෑහි පෙර බෙවෙහි පෙරැ වුසූ තන්හි දී, පෙරැ මිනිස් වූයේ ම (පෙරැ මිනිස් වැ ඉපැද සිටි කල්හි) කුසල් දහම්හි දැඩි ගැනුම් ඇත්තේ, නිසල සමාදන් ඇත්තේ වී ද, කාය සුචරිතයෙහි ද වාක් සුචරිතයෙහි ද මනස්සුචරිතයෙහි ද, තමා ලත් කොටස බෙදා දී වැළඳීමෙහි ද, පන්සිල් ඈ සිල්සමාදන් වැ ගැන්මෙහි ද, පෙහෙවස් වුසුම්හි ද මවට කටයුතු වතාවත්හි ද පියාට කටයුතු වතාවත්හි ද මහණුනට කටයුතු සත්කාරයෙහි ද, බමුණනට කටයුතු සත්කාරයෙහි ද, කුලදෙටුවන් පුදන බව්හි ද, තවත් මෙ බඳුවූ අන් අන් වෙසෙසි කුසල් දහම්හි දැඩි ගැනුම් ඇත්තේ නිසල සමාදන් ඇත්තේ වී ය යන යමෙක් ඇද්ද, හෙ තෙම ඒ කර්‍ම කළ බැවින්, පුන පුනා කළ බැවින්, ඒ කර්‍මයාගේ උත්සන්න බැවින් අප්‍රමාණ බැවින් කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට පැමිණෙයි. එහි ඒ මහපුරිස් තෙමෙ දෙව් ආයෙන් ද, දෙව් පැහැයෙන් ද, දෙව් සැපයෙන් ද, දෙව් යසසින් ද, දෙව් අදිපති බැවින් ද, දෙව් රුවින් ද, දෙව් හඬින් ද, දෙව් ගඳින් ද, දෙව් රෙසෙන් ද, දෙව් පහසින් ද යන දස කරුණෙකින් අන් දෙවියන් ඉක්මැ සිටී. හේ එයින් සැව මේ මිනිසත් බවට පැමිණියේ ම මේ මහපුරිස් ලකුණු ලබයි. හේ සුපිහිටි පා ඇත්තේ වෙයි, බිමැ සම ලෙස පා තබයි, සම ලෙස පා නඟයි. සියලු අවයවයෙන් යුත් පත්ලෙන් සමලෙස බිම පහසී (පාගායි). හේ ඒ ලකුණින් සමන්විතවූයේ, ඉදින් ගිහි ගෙහි වසන්නේ වී නම්, දසකුසල් දහම් රක්නා, දැහැමෙන් රජ වූ, සිවු සයුර හිම් කොටැති සිවු මහදිවයිනට නායක වූ, සතුරන් දිනූ, දනවුහි තහවුරු බවට පැමිණි, සත් රුවනින් සමන්වාගත වූ සක්විති රජෙක් වෙයි. සක්රුවන ඇත්රුවන අසරුවන මිණිරුවන ඉතිරිරුවන ගැහැවිරුවන සත් වනු පුත්රුවන ම යැයි ඔහුට මේ සත් රුවන් කෙනෙක් වෙත්.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 242,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පරොසහස්සං ඛො පනස්ස පුත්තා භවන්ති සූරා වීරඞ්ගරූපා පරසෙනප්පමද්දනා. සො ඉමං පඨවිං සාගරපරියන්තං අඛිලමනිමිත්තමකණ්ටකං ඉද්ධං ඵීතං ඛෙමං සිවං නිරබ්බුදං අදණ්ඩෙන අසත්ථෙන ධම්මෙන සමෙන අභිවිජිය අජ්ඣාවසති. රාජා සමානො කිං ලභති? අවික්ඛම්භියො හොති කෙනචි මනුස්සභූතෙන පච්චත්ථිකෙන පච්චාමිත්තෙන. රාජා සමානො ඉදං ලභති. සචෙ ඛො පන අගාරස්මා අනගාරියං පබ්බජති, අරහං හොති සම්මාසම්බුද්ධො ලොකෙ විවත්තච්ඡදො. බුද්ධො සමානො කිං ලභති? අවික්ඛම්භියො{1} හොති. අබ්භන්තරෙහි වා බාහිරෙහි වා පච්චත්ථිකෙහි පච්චාමිත්තෙහි රාගෙන වා දොසෙන වා මොහෙන වා සමණෙන වා බ්රාහ්මණෙන වා දෙවෙන වා මාරෙන වා බ්රහ්මුනා වා කෙනචි වා ලොකස්මිං. බුද්ධො සමානො ඉදං ලභති. එතමත්ථං භගවා අවොච."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ථෙතං වුච්චති:"
                    },
                    {
                        "type": "gatha",
                        "text": "සච්චෙ ච ධම්මෙ ච දමෙ ච සංයමෙ\nසොචෙය්යසීලාලයුපොසථෙසු ච,\nදානෙ අහිංසාය අසාහසෙ රතො\nදළ්හං සමාදාය සමත්තමාචරි{2}"
                    },
                    {
                        "type": "gatha",
                        "text": "සො තෙන කම්මෙන දිවං අපක්කමි{3} \nසුඛං ච ඛිඩ්ඩාරතියො ච අන්වභි \nතතො චවිත්වා පුනරාගතො ඉධ\nසමෙහි පාදෙහි ඵුසී වසුන්ධරං."
                    },
                    {
                        "type": "gatha",
                        "text": "බ්යාකංසු වෙය්යඤ්ජනිකා සමාගතා\nසමප්පතිට්ඨස්ස න හොති ඛම්භනා,\nගිහිස්ස වා පබ්බජිතස්ස වා පුන{4} \nතං ලක්ඛණං භවති තදත්ථජොතකං."
                    },
                    {
                        "type": "gatha",
                        "text": "අක්ඛම්භියො හොති අගාරමාවසං\nපරාභිභූ සත්තුභි සත්තුමද්දනො,\nමනුස්සභූතෙනිධ හොති කෙනචි\nඅක්ඛම්භියො තස්ස ඵලෙන කම්මුනො."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අක්ඛම්භියො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සමන්තමාවරි - ස්යා. කම්."
                    },
                    {
                        "type": "footnote",
                        "text": "3. සමක්කමි - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. ඛන - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ශූර වූ, වීර ඇඟ රුවැති, සතුරු සෙන් මඩිනුයෙහි බුහුටි, අයිරාදහස් පුත් කෙනෙක් ඔහුට වෙත්. හේ සයුර හිම් කොටැති, සතුරන් නමැති හුල් නැති, උවදුරට කරුණු නැති, සතුරන් නමැති කටු නැති (නොහොත් සොරුන් සතුරන් නැති), සමෘද්ධ වූ සැපතින් පිරුණු, බිය රහිත, උවදුරු නැති, සොර සතුරු කැලැල් නැති මේ පොළොව දඬුයෙන් අවියෙන් තොර වැ දැහැමෙන් අත්පත් කොට ගෙන, නායක වැ වෙසෙයි. හෙ තෙමෙ රජ වන්නේ කුමක් නම් ලබා ද? හේ මිනිස් වූ කිසිදු සතුරු පසමිතුරක්හු විසින් නො මැඩැ ලියැ හැක්කේ වෙයි. රජ වනුයේ හේ මේ අනුසස් ලබයි. ඉදින් හෙ තෙමෙ ගිහි ගෙන් නික්මැ පැවිදි වන්නේ නම්, රහත් වූ ලොවැ සිඳ පෙරළා හළ කෙලෙස් සෙවෙණි ඇති සම්මා සම්බුදුවරයෙක් වෙයි. හේ බුදු වූයේ ම කුමක් නම් ලබා ද? ඇතුළතැ හෝ බැහැරතැ සිටි සතුරන් විසින්, පසමිතුරන් විසින් රාගයෙන් හෝ ද්වේෂයෙන් හෝ මෝහයෙන් හෝ මහණක්හු විසින් හෝ බමුණක්හු විසින් හෝ දෙවියක්හු විසින් හෝ මරක්හු විසින් හෝ බඹක්හු විසින් හෝ ලොවැ කිසිදු එකක්හු විසින් මැඩැලියැ නොහැක්කේ වෙයි. බුදු වූයේ ම මේ අනුසස් ලබයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භගවත්හු මෙ කරුණ වදාළහ. එහි මේ අර්‍ථය ම ගාථාබන්ධනයෙන් කියනු ලැබේ:{1}",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“හෙ තෙම සබවස්හි ද දස අකුසල්දහම්හි ද ඉඳුරන් දමනුයෙහි ද සිල් හැවුරුමෙහි ද තුන්දොරින් පිවිතුරු බව්හි ද සිල්රැක්මෙහි ද පෙහෙවස් වුසුම්හි ද දීමෙහි ද මෙරමා නොපෙළීමෙහි ද රෞද්‍ර නොවූ ක්‍රියාහි ද ඇලුණේ එය තරයේ සමාදන් ව ගෙන, නිමාවට ම පිරී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හේ ඒ කුසල් කමින් දෙව්ලෝ පැමිණියේ ය. සැප ද කෙළිසුව ද පස්කම් ද හේ වැළැඳුයේ ය. එයින් සැව නැවැත මෙහි ආයේ, සම දෙපත්ලෙන් පොළොව පැහැසී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "රජගෙට සපැමිණි ගත ලකුණු කියන බමුණෝ “සම ලෙස බිමැ පිහිටුනා පතුල් ඇතියහුගේ සිටි තැනින් සැලීමෙක් නොවෙයි”ද, “ඒ සුපිහිටි පා ලකුණ ගිහියකු හෝ පැවිද්දකු හෝ පිළිබඳ වූ ඒ අරුත පවසනුයේ වේ යැ”යි ද පැවැසූහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හේ ගිහි ගෙහි වසන්නේ නම්, සතුරන් විසින් නො මැඩැලියැ හැකි, අනුන් මැඩැ පවත්වනුයෙහි සමත්, සතුරන් මඩනා සක්විත්තෙක් වෙයි. ඒ කම්හුගේ ඵලයෙන් මිනිස් වූ කිසිවකු විසිනුත් සෙලැවියැ නො හැක්කේ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. මේ ගාථාබන්ධන අනඳතෙරුන්ගේ යැ අටුවා ඇදුරෝ කීහ."
                    }
                ]
            }
        },
        {
            "pageNum": 244,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "සචෙ ච පබ්බජ්ජමුපෙති තාදිසො\nනෙක්ඛම්මඡන්දාභිරතො විචක්ඛණො,\nඅග්ගො න සො ගච්ඡති ජාතු ඛම්භතං\nනරුත්තමො එසහි තස්ස ධම්මතා’ති."
                    },
                    {
                        "type": "centered",
                        "text": "පාදතලෙසු චක්කලක්ඛණං (2)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "4. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො බහුජනස්ස සුඛාවහො අහොසි, උබ්බෙගං උත්තාසං භයං අපනුදිතා ධම්මිකං ච රක්ඛාවරණගුත්තිං සංවිධාතා සපරිවාරං ච දානං අදාසි. සො තස්ස කම්මස්ස කතත්තා උපචිතත්තා උස්සන්නත්තා විපුලත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති -පෙ- සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉමං මහාපුරිසලක්ඛණං පටිලභති. හෙට්ඨා පාදතලෙසු චක්කානි ජාතානි හොන්ති සහස්සාරානි සනෙමිකානි සනාභිකානි සබ්බාකාරපරිපූරානි සුවිභත්තන්තරානි. සො තෙන ලක්ඛණෙන සමන්නාගතො සචෙ අගාරං අජ්ඣාවසති රාජා හොති චක්කවත්තී -පෙ- රාජා සමානො කිං ලභති? මහාපරිවාරො හොති, මහා’ස්ස හොන්ති පරිවාරා බ්රාහ්මණගහපතිකා නෙගමජානපදා ගණකා මහාමත්තා. අනීකට්ඨා දොවාරිකා අමච්චා පාරිසජ්ජා රාජානො භොගියා කුමාරා. රාජා සමානො ඉදං ලභති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සචෙ අගාරස්මා අනගාරියං පබ්බජති, අරහං හොති සම්මාසම්බුද්ධො ලොකෙ විවත්තච්ඡදො. බුද්ධො සමානො කිං ලභති? මහාපරිවාරො හොති, මහා’ස්ස හොන්ති පරිවාරා භික්ඛූ භික්ඛුනියො උපාසකා උපාසිකායො දෙවා මනුස්සා අසුරා නාගා ගන්ධබ්බා. බුද්ධො සමානො ඉදං ලභති. එතමත්ථං භගවා අවොච තත්ථෙතං වුච්චති:"
                    },
                    {
                        "type": "gatha",
                        "text": "පුරෙ පුරත්ථා පුරිමාසු ජාතිසු\nමනුස්සභූතො බහුනං සුඛාවහො,\nඋබ්බෙගඋත්තාසභයාපනූදනො\nගුත්තීසු රක්ඛාවරණෙසු උස්සුකො."
                    },
                    {
                        "type": "gatha",
                        "text": "සො තෙන කම්මෙන දිවං සමක්කමි\nසුඛඤ්ච ඛිඩ්ඩා රතියො ච අන්වභි,\nතතො චවිත්වා පුනරාගතො ඉධ\nචක්කානි පාදෙසු දුවෙසු වින්දති\nසමන්තනෙමීනි සහස්සරානි ච."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "එ බඳුවූ ඒ නුවණැත්තේ මහණදහම්හි ඇලුණේ ඉදින් පැවිදි වන්නේ නම්, ලොවට අගපත් වූයේ, හැම සත්නට උතුම් වූයේ, කිසි කලෙකත් මෙරමා ගෙන් සැලෙන බවට නො පැමිණෙයි. මේ ඒ මහාපුරිස්හු පිළිබඳ ධර්‍මතා යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "පාදතලයන්හි චක්‍රලක්ෂණ (2)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "4. මහණෙනි, තථාගත තෙම පෙර දෑහි පෙර බෙවෙහි, පෙරැ වුසූ තන්හි, පෙරැ මිනිස් වූයේ ම උද්වේග (සොර ආදීන්ගෙන් වන) බිය ද, උත්‍රාස (යක් ආදීන්ගෙන් වන උවදුරු) බිය ද දුරැලනුයේ දැහැමි රකවරණ සලසනුයේ බොහෝ දෙනාගේ සුව පහසුව පිණිස වූයේ ය, පිරිවෙර සහිත ව දන් දුන්නේ ය යන යමෙක් ඇද්ද, හෙ තෙමෙ ඒ කර්‍ම කළ බැවින්, පුනපුනා කළ බැවින්, ඒ කර්‍මයාගේ උත්සන්න බැවින් අප්‍රමාණ බැවින් කාබුන් මරණින් මතු මනා ගති ඇති සග ලොව උපදී … හේ එයින් සැව, මෙ මිනිස් බවට ආයේ ම, මේ මහපුරිස් ලකුණ ලබයි. ඔහුගේ යැටි පතුල්හි දහසක් දැවි ඇති, නිම් වළලු සහිත, නැබ සහිත, හැම අයුරින් පිරිපුන්, මොනොවට බෙදුණු අතර ඇති, සක්ලකුණු පහළ වූවෝ වෙත්. ඒ ලකුණෙන් සමන්විත හෙ තෙමෙ ඉදින් ගිහි ගෙහි වසන්නේ නම් … සක්විති රජ වෙයි. රජ වූයේ ම කුමක් ලබා ද? මහ පිරිවර ඇත්තේ වෙයි. ඔහුගේ ඒ පිරිවර බමුණන් හා ගැහැවියෝ ය, නිගම්වැස්සන් හා දනවු වැස්සෝය, ගණකයන් (රජුගේ අයවැය ගණින්නන්) හා මහ ඇමැත්තෝ ය, සෙනඟ රක්නා ඇමැත්තෝ ය, දොරටු පල්ලෝ ය, පිරිස ද (පරපුරෙන් ම රජ පිරිසැ වූ) ඇමැත්තෝ ය, රජ දරුවෝ ය, ගම් මුදලියෝ ය, රජකුමරහු ය යන මහත් පිරිවර ඔහුට වෙයි. රජ වන්නේ හේ මෙකී දෑ ලබයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉදින් ගිහිගෙන් නික්ම පැවිදි වන්නේ නම්, ලොවැ පෙරැළු කෙලෙස් සෙවෙණි ඇති රහත් සම්මාසම්බුදුවරයෙක් වෙයි. බුදු වනුයේ කුමක් ලබා ද? මහපිරිවර ඇත්තේ වෙයි. මහණහුය, මෙහෙණියෝ ය, උවසුවෝ ය, උවැසියෝ ය, දෙව්හු ය, මිනිස්සු ය, අසුරයෝ ය, නාගයෝ ය, ගඳෙවුහු යැ යි මහ පිරිවර ඔහුට වෙයි. බුදු වනුයේ මෙය ලබයි. භාග්‍යවතුන් වහන්සේ මෙ කරුණ වදාළසේක. එහි ගාථා බන්ධන වශයෙන් මෙය කියනු ලැබේ:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“පෙරැ බොහෝ පූර්‍ව කාලයෙහි පළමු ජාතීන්හි දී මිනිස් වූයේ බොහෝ දෙනාට සුව එළැවි ය. උද්වේග උත්‍රාස නිසා උපදනා බිය දුරු කරන්නේ විය. ගොපනයෙහි ද රක්ෂාවරණයෙහි ද උත්සුක විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හේ ඒ කර්‍මයෙන් දෙව්ලෝ ගියේ ය. දෙව්ලෝ සුව ද දිව්‍ය ක්‍රීඩා හා පංචකාරම රතීන් ද වින්දේ ය. එයින් සැව, නැවත මෙහි ආයේ, හාත්පස නිම්වළලු ඇති, දහසක් දැවි ආදිය ඇති සක් ලකුණු දෙපත්ලෙහි ලබයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 246,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "බ්යාකංසු වෙය්යඤ්ජනිකා සමාගතා,\nදිස්වා කුමාරං සතපුඤ්ඤලක්ඛණං\nපරිවාරවා හෙස්සති සත්තුමද්දනො\nතථා හි චක්කානි සමන්තනෙමිනි."
                    },
                    {
                        "type": "gatha",
                        "text": "සචෙ න පබ්බජ්ජමුපෙති තාදිසො,\nවත්තෙති චක්කං පඨවිං පසාසති\nතස්සානුයුත්තා’ධ{1} භවන්ති ඛත්තියා\nමහායසං සම්පරිවාරයන්ති නං."
                    },
                    {
                        "type": "gatha",
                        "text": "සචෙ ච පබ්බජ්ජමුපෙති තාදිසො,\nනෙක්ඛම්මඡන්දාභිරතො විචක්ඛණො\nදෙවා මනුස්සා සුරයක්ඛ{2}රක්ඛසා \nගන්ධබ්බනාගා විහගා චතුප්පදා\nඅනුත්තරං දෙවමනුස්සපූජිතං\nමහායසං සංපරිවාරයන්ති නන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "ආයතපණ්හිතාදිනි තීනි ලක්ඛණානි (3-5)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "5. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො පාණාතිපාතං පහාය පාණාතිපාතා පටිවිරතො අහොසි, නිහිතදණ්ඩො නිහිතසත්ථො ලජ්ජී දයාපන්නො සබ්බපාණභූතහිතානුකම්පී විහාසි. සො තස්ස කම්මස්ස කතත්තා උපචිතත්තා උස්සන්නත්තා විපුලත්තා -පෙ- සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉමානි තීණි මහාපුරිසලක්ඛණානි පටිලභති. ආයතපණ්හි ච හොති, දීඝඞ්ගුලි ච බ්රහ්මුජුගත්තො ච. සො තෙහි ලක්ඛණෙහි සමන්නාගතො, සචෙ අගාරං අජ්ඣාවසති, රාජා හොති චක්කවත්තී -පෙ- රාජා සමානො කිං ලභති? දීඝායුකො හොති චිරට්ඨිතිකො, දීඝමායුම්පාලෙති. න සක්කා හොති අන්තරා ජීවිතා වොරොපෙතුං කෙනචි මනුස්සභූතෙන පච්චත්ථිකෙන පච්චාමිත්තෙන. රාජා සමානො ඉදං ලභති -පෙ- බුද්ධො සමානො කිං ලභති? දීඝායුකො හොති චිරට්ඨිනිකො, දීඝමායුම්පාලෙති, න සක්කා හොති අන්තරා ජීවිතා වොරොපෙතුං පච්චත්ථිකෙහි පච්චාමිත්තෙහි සමණෙන වා බ්රාහ්මණෙන වා දෙවෙන වා මාරෙන වා බ්රහ්මුනා වා කෙනචි වා ලොකස්මිං. බුද්ධො සමානො ඉදං ලභති. "
                    },
                    {
                        "type": "paragraph",
                        "text": "එතමත්ථං භගවා අවොච. තත්ථෙතං වුච්චති:"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. තස්සානු යත්තා ච - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සත්ත (කම්)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "රජගෙට රැස්වූ නිමිත්තපාඨක බමුණෝ සිය පින් ලකුණු ඇති, කුමරහු දැක, මෙ තෙම මහත් පිරිවර ඇති, සතුරන් මඩින සක්විති රජෙක් වන්නේ ය. එසේ හෙයින් ම එයට පෙර නිමිති විසින් පතුල්හි හාත්පස නිම්වළලු ඇති සක්ලකුණු ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉදින් එබඳු තැනැත්තේ පැවිද්දට නො පැමිණේ නම්, අණසක පවත්වයි, පෘථිවියට අනුශාසන කෙරේ. ඔහුට මෙහි ක්ෂත්‍රියයෝ අනුයුක්ත වෙත්. මහත් යශස් ඇත්තාහු ඔහු හාත්පස පිරිවරත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉදින් නෛෂ්කාම්‍යඡන්දයෙහි ඇලුණු එබඳු ඒ නුවණැත්තේ පැවිදි බවට පැමිණෙන්නේ නම්, දෙවියෝ ද මිනිස්සු ද අසුරයෝ ද යක්ෂයෝ ද රකුසෝ ද, ගන්ධර්‍වයෝ ද, නාගයෝ ද, පක්ෂීහු ද, සිවුපාවෝ ද අනුත්තර වූ දෙව්මිනිසුන් විසින් පුදන ලද මහත් යසස් ඇති ඔහු පිරිවරත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "ආයතපණ්හිතාදි තුන් ලකුණු (3, 4, 5)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "5. මහණෙනි, තථාගත තෙමේ පළමු ජාතීන්හි, පෙරැ සසරෙහි, පෙරැ වුසූ තන්හි පෙරැ මිනිස් වූයේ ම ප්‍රාණඝාතය හැර, ප්‍රාණඝාතයෙන් වැළැක්කේ වී ය, බහා තබන ලද දඬු ඇත්තේ, බහා තබන ලද ශස්ත්‍ර ඇත්තේ, පණිවායෙහි ලජ්ජා ඇත්තේ, සත්වයන් කෙරෙහි දයායෙන් යුක්ත වූයේ, සියලු සතුන් කෙරෙහි හිතානුකම්පා ඇති වැ විසීය යන යමෙක් ඇද්ද, හෙ තෙමෙ ඒ කර්‍මය කළ බැවින්, රැස් කළ බැවින්, උත්සන්න බැවින්, අප්‍රමාණ බැවින්, කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට පැමිණෙයි. හේ එයින් සැව, මේ මිනිස්බවට පැමිණියේ ම, මේ මහ පුරිස් ලකුණු තුන ලබයි. හේ දික් විලුම් ඇත්තේ වෙයි, දිගැඟිලි ඇත්තේ ද වෙයි. බඹහට බඳු ඍජු ශරීරය ඇත්තේ වෙයි. ඒ ලක්ෂණයන්ගෙන් සමන්විත වූ හෙ තෙමේ ඉදින් ගිහි ගෙහි වසන්නේ නම්, … සක්විති රජෙක් වෙයි. රජ වනුයේ කුමක් ලබා ද? හේ බොහෝ කල් ජීවත් වනුයේ දීර්ඝායුෂ්ක වෙයි. දීර්ඝ ආයුෂයක් රක්ෂා කෙරෙයි. මනුෂ්‍ය වූ කිසි සතුරකු විසින් පසමිතුරකු විසින් අතරැ දිවියෙන් තොර කරන්නට නො හැකි වෙයි. රජ වනුයේ මෙය ලබයි … බුදු වනුයේ කුමක් ලබා ද? බොහෝ කල් ජීවත් වනුයේ දීර්ඝායුෂ්ක වෙයි, දීර්ඝ ආයුෂ පාලනය කෙරෙයි. කිසි සතුරු පසමිතුරු මහණකු විසින් හෝ බමුණකු විසින් හෝ දෙවියකු විසින් හෝ මරකු විසින් හෝ බඹකු විසින් හෝ ලොවැ කිසිවකුදු විසින් අතරැ දිවියෙන් තොර කරන්නට නො හැකි වෙයි. බුදු වන්නේ මෙය ලබයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙ කරුණ වදාළ සේක. එහි මෙය ගාථායෙන් මෙසේ කියනු ලැබේ:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 248,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "මරණවධ{1}භයත්තනො විදිත්වා\nපටිවිරතො පරමාරණායහොසි{2}\nතෙන සුචරිතෙන සග්ගමගමා{3} \nසුකතඵලවිපාකමනුභොසි."
                    },
                    {
                        "type": "gatha",
                        "text": "චවිය පුනරිධාගතො සමානො\nපටිලභති ඉධ තීණි ලක්ඛණානි,\nභවති විපුලදීඝපාසණ්හිකො\nබ්රහ්මා’ව සුජු සුභො සුජාතගත්තො."
                    },
                    {
                        "type": "gatha",
                        "text": "සුභුජො සුසු සුසණ්ඨිතො සුජාතො\nමුදුතඵණඞ්ගුලියස්ස හොන්ති දීඝා,\nතීභි පුරිසවරග්ගලක්ඛණෙහි\nචිරයපනාය{4}කුමාරමාදිසන්ති."
                    },
                    {
                        "type": "gatha",
                        "text": "භවති යදි ගිහී චිරං යපෙති\nචිරතරං පබ්බජති යදි තතො හි\nයාපයති වසිද්ධි භාවනාය\nඉති දීඝායුකතාය තන්නිමිත්තන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "සත්තුස්සදතාලක්ඛණං (6)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "6. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො දාතා අහොසි පණීතානං රසිතානං ඛාදනීයානං භොජනීයානං සායනීයානං ලෙහනීයානං පානානං, සො තස්ස කම්මස්ස කතත්තා -පෙ- තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉමං මහාපුරිසලක්ඛණං පටිලභති, සත්තුස්සදො හොති. සත්තස්ස උස්සදා හොන්ති: උභොසු හත්ථෙසු උස්සදා හොන්ති, උභොසු පාදෙසු උස්සදා හොන්ති, උභොසු අංසකූටෙසු උස්සදා හොන්ති, ඛන්ධෙ උස්සදො හොන්ති. සො තෙන ලක්ඛණෙන සමන්නාගතො සචෙ අගාරං අජ්ඣාවසති රාජා හොති චක්කවත්තී -පෙ- රාජා සමානො කිං ලභති? ලාභී හොති පණීතානං රසිතානං ඛාදනීයානං භොජනීයානං සායනීයානං ලෙහනීයානං පානානං. රාජා සමානො ඉදං ලභති. බුද්ධො සමානො කිං ලභති? ලාභී හොති පණීතානං රසිතානං ඛාදනීයානං භොජනීයානං සායනීයානං ලෙහනීයානං පානානං. බුද්ධො සමානො ඉදං ලභති. එතමත්ථං භගවා අවොච. තත්ථෙතං වුච්චති:"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. මරණ (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. මාරණාය හොති (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "3. තෙන සො සුචරිතෙන සග්ගමගමාසී (ස්යා)"
                    },
                    {
                        "type": "footnote",
                        "text": "4. චිරයාපතාය (ස්යා)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "‘තමහට මරණ වධයෙන් උපන් බිය දැන, මෙරමා නැසීමෙන් වැළැක්කේ විය. ඒ කුශලකර්‍මයෙන් ස්වර්‍ගයට පැමිණියේ ය. කුශල කර්‍මයාගේ ඵලවිපාකය අනුභව කෙළේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "දෙව්ලොවින් සැව, නැවැත මෙහි ආයේ ම, ලක්ෂණ තුනක් ලබයි. මහත් වූ දික් විලුම් ඇත්තේ වෙයි. බඹහු මෙන් මොනොවට ඍජු වූයේ ශෝභන වෙයි, මොනොවට උපන් ගාත්‍ර ඇත්තේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "යහපත් බාහු ඇත්තේ, තරුණ වූයේ, මනා සටහන් ඇත්තේ, මොනොවට උපන්නේ වෙයි, ඔහුගේ මොළොක් තරුණ ඇඟිල්ලෝ දික් වෙත්. මෙකී ශ්‍රේෂ්ඨ වූ තුන් මහ පුරිස් ලකුණින් කුමරහු බොහෝ කල් ජීවත් වනු පිණිස (සමතක්හු කොට) නිමිත්තපාඨකයෝ දක්වත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉදින් ගිහි වන්නේ නම්, බොහෝ කල් ජීවත් වේ. ඉදින් පැවිදි වන්නේ නම්, වශීතාප්‍රාප්ත වූයේ, ඍද්ධි භාවනායෙන් යුක්ත වූයේ, එයට වඩා බෝකල් ජීවත් වෙයි. මෙසේ දීර්ඝායුෂ්ක බවට ඒ ලකුණැ යි කීහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "සප්තෝත්සද ලක්ෂණ (6)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "6. මහණෙනි, තථාගත තෙමේ පෙර දෑහි, පෙර සසරෙහි, පළමු වුසූ තන්හි, පෙරැ මිනිස් වූයේ ම ප්‍රණීත වූ රසවත් වූ කෑ යුතු දෑ ද, බුදියැ යුතු දෑ ද, රස වින්ද යුතු දෑ ද, ලෙවියැ යුතු දෑ ද, අෂ්ට පානයන් ද දෙන්නේ වි ය යන යමෙක් ඇද්ද, හේ ඒ කර්‍මය කළ බැවින්, රැස් කළ බැවින්, ඒ කර්‍මයාගේ උත්සන්න බැවින්, මහත් බැවින්, කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට පැමිණෙයි … හේ එයින් සැව මේ මිනිස් බවට පැමිණියේ ම මෙ මහ පුරිස්ලකුණ ලබයි: සත් තැනෙක උත්සන්න වෙයි: සත් තැනෙක්හි පිරිපුන් මස් ඇති වෙයි: දෙ පිටු අත්ලෙහි පිරිපුන් මස් ඇති වෙයි. දෙ පිටු පතුල්හි පිරිපුන් මස් ඇති වෙයි, දෙ උරහිස්හි පිරිපුන් මස් ඇති වෙයි, කරෙහි පිරිපුන් මස් ඇති වෙයි. හෙ තෙමේ ඒ සප්ත උත්සද ලක්ෂණයෙන් සමන්විත වූයේ, ඉදින් ගිහි ගෙහි වෙසේ නම්, … සක්විති රජ වෙයි. රජ වන්නේ මෙය ලබයි. ප්‍රණීත වූ රසවත් වූ ඛාද්‍ය භෝජ්‍ය ලෙහ්‍ය පෙයයන් ලබන සුලු වෙයි. රජ වනුයේ මෙය ලබයි. බුදු වනුයේ කුමක් ලබා ද? ප්‍රණීත වූ රසවත් වූ ඛාද්‍ය භෝජ්‍ය ලෙහ්‍ය පෙයයන් ලබන සුලු වෙයි. බුදු වනුයේ මෙය ලබයි. භාග්‍යවතුන් වහන්සේ මෙ කරුණ වදාළ සේක. එහි ගාථාබන්ධනයෙන් මෙය කියනු ලැබෙයි:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 250,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "ඛජ්ජභොජනං අථ ලෙය්යසායියං\nඋත්තමග්ගරසදායකො අහු.\nතෙන සො සුචරිතෙන කම්මුනා\nනන්දනෙ චිරමභිප්පමොදති."
                    },
                    {
                        "type": "gatha",
                        "text": "සත්තචුස්සදො ඉධාධිගච්ඡති\nහත්ථපාදමුදුතලඤ්ච වින්දති,\nආහු බ්යඤ්ජනනිමිත්තකොවිදා\nඛජ්ජ භොජ්ජ රසලාභිතාය නං."
                    },
                    {
                        "type": "gatha",
                        "text": "තං ගිහිස්සපි තදත්ථජොතකං\nපබ්බජ්ජම්පි ච තදාධිගච්ඡති,\nඛජ්ජභොජනස්ස ලාභිරුත්තමං\nආහු සබ්බගිහිබන්ධනච්ඡිදන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "කරචරණමුදුජාලතාලක්ඛණානි (7-8)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "7. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො චතූහි සඞ්ගහවත්ථූහි ජනං සඞ්ගාහකො අහොසි දානෙන පෙය්යවජ්ජෙන{1} අත්ථචරියාය සමානත්තතාය, සො තස්ස කම්මස්ස කතත්තා -පෙ- සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉමානි ද්වෙ මහාපුරිසලක්ඛණානි පටිලභති. මුදුතළුණහත්ථපාදො ච හොති ජාලහත්ථපාදො ච. සො තෙහි ලක්ඛණෙහි සමන්නාගතො, සචෙ අගාරං අජ්ඣාවසති, රාජා හොති චක්කවත්තී -පෙ- රාජා සමානො කිං ලභති? සුසඞ්ගහිතපරිජනො හොති, සුසඞ්ගහිතාස්ස හොන්ති බ්රාහ්මණගහපතිකා නෙගමජානපදා ගණකා මහාමත්තා අනීකඨා දොවාරිකා අමච්චා පාරිසජ්ජා රාජානො භොගියා කුමාරා. රාජා සමානො ඉදං ලභති. බුද්ධො සමානො කිං ලභති? සුසඞ්ගහිතපරිජනො හොති, සුසඞ්ගහිතා’ස්ස හොන්ති භික්ඛූ භික්ඛුණියො උපාසකා උපාසිකායො දෙවා මනුස්සා අසුරා නාගා ගන්ධබ්බා. බුද්ධො සමානො ඉදං ලභති. එතමත්ථං භගවා අවොච. තත්ථෙතං වුච්චති:"
                    },
                    {
                        "type": "gatha",
                        "text": "දානම්පි චත්ථචරියතඤ්ච{2} \nපියවදනංච සමාඡන්දතංච{3}\nකරිය චරිය සුසඞ්ගහං බහූන්නං{4}\nඅනවමතෙන ගුණෙන යාති සග්ගං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පියවාචෙන (ස්යා. කම්.)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. දානම්පි ච අත්ථචරියතම්පි ච (PTS)"
                    },
                    {
                        "type": "footnote",
                        "text": "3. පියවාදිතං ච සමානාත්තතං ච (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "4. බහූනං (මඡසං)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "‘ලෝකොත්තම තෙමේ ඛාද්‍ය භෝජ්‍ය ලෙහ්‍ය ස්වාද්‍ය යන අග්‍ර රස දෙන්නේ විය. හේ ඒ කුශල කර්‍මයෙන් බොහෝ කල් නදුනුයනෙහි වෙසෙසින් ප්‍රමුදිත වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මෙහි උත්සන්න වූ සත් තැනක් ලබයි. මෘදු වූ අතුල් පතුල් ද ලබයි. ඛාද්‍ය භෝජ්‍ය රස ලබන බවට එය ලකුණෙකැ’යි ලක්ෂණ ශාස්ත්‍රඥයෝ කීහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඒ ලක්ෂණය ගිහියාටත් ඒ අර්‍ථය ප්‍රකාශ කරන්නේ වෙයි. පැවිදි වන්නේ ද එය ලබයි. එය උතුම් ඛාද්‍ය භෝජ්‍ය රස ලබන සුලු, සියලු ගිහිබැඳුම් සිඳිනා කෙනකු පවසයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "කරවරණමෘදුතාජාලතාලක්ෂණ (7, 8)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "7. මහණෙනි, තථාගත තෙමේ පළමු දෑහි පළමු අත්බව්හි, පළමු වාසස්ථානයන්හි පෙරැ මිනිස්වූයේ ම, දානයෙන් ප්‍රිය වචනයෙන් අර්‍ථචර්‍ය්‍යායෙන් සමානාත්මතායෙන් යන සතර සංග්‍රහ වස්තූන්ගෙන් ජනයාට සංග්‍රහ කරන්නේ වී ය යන යමෙක් ඇද්ද, හේ ඒ කර්‍මය කළ බැවින් රැස් කළ බැවින්, ඒ කර්මයාගේ උත්සන්න බැවින්, මහත් බැවින්, කාබුන් මරණින් මතු, මනා ගති ඇති සග ලොවට පැමිණෙයි. හේ එයින් සැව, මෙ මිනිස්බවට ආයේ ම මේ මහපුරිස් ලකුණු දෙක ලබයි: හේ මොළොක් තරුණ අතුල් පතුල් ඇත්තේ ද දැල් කවුළුවකට බඳු අත් පා ඇත්තේ ද වෙයි. හේ ඒ ලකුණුවලින් සමන්විත වූයේ, ඉදින් ගිහි ගෙයි වසන්නේ නම් ... සක්විති රජ වෙයි. රජවන්නේ කුමක් ලබයි ද? (සිවු සඟරා වතින්) මොනොවට සංග්‍රහ කරන ලද පිරිවර ජනයා ඇත්තේ වෙයි. ඔහු විසින් බමුණු ගැහැවි ජනයෝ ද, නිගම් වැසි දනවු වැසි ජනයෝ ද, අයවැය ගණන් කරන්නෝ ද, මහා මාත්‍රයෝ ද, සෙනාඞ්ගරක්නා හස්ත්‍යාචාර්‍ය්‍යාදීහු ද ඇමැතියෝ ද පරම්පරාගත වැ රජ පිරිසෙහි වූවෝ ද, රජහු ද, රජුන්ගෙන් ලත් භෝග සම්පත් ඇත්තෝ ද, රජකුමරුවෝ ද යන මොහු හැම ඔහු විසින් මොනොවට සංග්‍රහ කරන ලද්දාහු වෙත්. රජ වන්නේ මෙය ලබයි. බුදු වන්නේ කුමක් ලබා ද? යත්: මොනොවට සංග්‍රහ කරන ලද පරිවාර ජනයා ඇත්තේ වෙයි. ඔහු විසින් මහණහු ද මෙහෙණෝ ද උවසුවෝ ද උවැසියෝ ද දෙවියෝ ද මිනිස්සු ද අසුරයෝ ද නාගයෝ ද ගන්ධර්‍වයෝ ද මොනොවට සංග්‍රහ කරන ලද්දාහු වෙත්. බුදු වන්නේ මෙය ලබයි. භාග්‍යවතුන් වහන්සේ මෙ කරුණ වදාළ සේක. එහි එය මෙසේ ගාථායෙන් කියනු ලැබේ:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘හෙ තෙම දානය ද අර්‍ථචර්‍ය්‍යාව ද ප්‍රියවාදිතාව ද සමානාත්මතාව ද කොට බොහෝ දෙනාට මැනැවින් සංග්‍රහ කොට, අනින්දිත (ප්‍රශස්ත) ගුණ හෙයින් ස්වර්‍ගයට යෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 252,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "චවීය පුනරිධාගතො සමානො\nකරචරණමුදුතලඤ්ච ජාලිනො ච,\nඅතිරුචිරසුවග්ගුදස්සනෙය්යං\nපටිලභති දහරො සුසු කුමාරො."
                    },
                    {
                        "type": "gatha",
                        "text": "භවති පරිජනස්සවො විධෙෙය්යා\nමහිමිම මාවසතෙ{1} සුසඞ්ගහිතො,\nපියවදූ හිතසුඛතං ජිගිංසමානො{2} \nඅභිරුචිතානි ගුණානි ආචරන්තො.{3}"
                    },
                    {
                        "type": "gatha",
                        "text": "යදි ච ජහති සබ්බකාමභොගං\nකථයති ධම්මකථං ජිනො ජනස්ස,\nවචනපටිකරස්සාභිප්පසන්නා\nසුත්වාන ධම්මනුධම්මමාචරන්තී{4}ති"
                    },
                    {
                        "type": "centered",
                        "text": "උස්සඞ්ඛපාදඋද්ධග්ගලොමතාලක්ඛණානි (9-10)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "8. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො අත්ථූපසංහිතං ධම්මූපසංහිතං වාචම්භාසිතා අහොසි, බහුජනං නිදංසෙසි, පාණීනං හිතසුඛාවහො ධම්මයාගී. සො තස්ස කම්මස්ස කතත්තා උපවිතත්තා -පෙ- සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉමානි ද්වෙ මහාපුරිස ලක්ඛණානි පටිලභති, උස්සඞ්ඛපාදො ච හොති උද්ධග්ගලොමො ච. සො තෙහි ලක්ඛණෙහි සමන්නාගතො සචෙ අගාරං අජ්ඣාවසති, රාජා හොති චක්කවත්තී -පෙ- රාජා සමානො කිං ලභති? අග්ගො ච හොති සෙට්ඨො ච පාමොක්ඛො ච උත්තමො ච පවරො ච කාමභොගීනං. රාජා සමානො ඉදං ලභති -පෙ- බුද්ධො සමානො කිං ලභති? අග්ගො ච හොති සෙට්ඨො ච පාමොක්ඛො ච උත්තමො ච පවරො ච සබ්බසත්තානං. බුද්ධො සමානො ඉදං ලභති. එතමත්ථං භගවා අවොච. තත්ථෙතං වුච්චති:"
                    },
                    {
                        "type": "gatha",
                        "text": "අත්ථධම්මසහිතං{5} පුරෙ ගිරං\nඑරයං බහුජනං නිදංසයි,\nපාණිනං හිතසුඛාවහො අහු\nධම්මයාගමයජී{6} අමච්ඡරී."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. මහිමං ආවයතෙ (සීමු. මඡසං.)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. ජිගීසමානො (මඡසං.)"
                    },
                    {
                        "type": "footnote",
                        "text": "3. ආවරති (සීමු. මඡසං.)"
                    },
                    {
                        "type": "footnote",
                        "text": "4. සුත්වාන ධම්මානුධම්ම මාවරන්ති (මඡසං.)"
                    },
                    {
                        "type": "footnote",
                        "text": "5. අත්ථධම්මසංහිතං (කම්. PTS.)"
                    },
                    {
                        "type": "footnote",
                        "text": "6. ධම්මයාගං අස්සජි (කම්)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "එයින් සැව නැවත මෙහි ආයේ ම ළදරු වූයේ, ඉතා සිවුමැලි වූයේ, ඉතා පැහැපත්, ඉතා මනෝඥ, දැකුම් කටයුතු, මොළොක් වූ අතුල් පතුල් ද ජාලලක්ෂණ ද ලබයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පිරිවර ජන තෙමේ කීකරු වේ. කටයුත්තෙහි මෙහෙයැවියැ හැකි වේ. මොනොවට සංග්‍රහ කරන ලද්දේ මෙ පොළොවෙහි වෙසෙයි. පිය බස් කියන්නේ, හිත සුව සොයනුයේ, වෙසෙසින් සිත්කලු වූ ගුණයන් වඩන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉදින් සියලු පස්කම් සුව හරනේ නම් පව් දිනූයේ (බුදු වූයේ) දහම් දෙසයි. උන්වහන්සේගේ දේශනාව අසා ඉතා පහන්වූවාහු, වචනය පිළිපදනාහු ධර්‍මානුධර්‍ම ප්‍රතිපත්ති පුරත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "උත්ශංඛපාද උර්ධවාග්‍රලොමතා ලක්ෂණ (9,10)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "8. මහණෙනි, “තථාගත තෙමේ පළමු දෑහි, පළමු භවයෙහි, පළමු වුසූ තන්හි, පෙරැ මිනිස් වූයේ ම බොහෝ දෙනාට දෙලෝ වැඩ ඇසුරු කළ, දශ කුශලකර්‍මපථ ඇසුරු කළ වචන කියන්නේ වීය. බොහෝ දෙනාට දෙලෝ වැඩ දැක්වී ය. සත්නට හිතසුව එළවනුයේ, ධර්‍මදානය කරන්නේ වීය” යන යමෙක් ඇද්ද, ඒ කර්‍මය කළ බැවින්, රැස් කළ බැවින්, ඒ කර්‍මයාගේ උත්සන්න බැවින්, මහත් බැවින්, කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට යෙයි … හේ එයින් සැව මේ මිනිස් බවට ආයේ ම මේ මහ පුරිස් ලකුණු දෙක ලබයි. මත්තෙහි වූ ගොප් ඇට ඇති පා ඇත්තේ ද, උඩුකුරු වූ අක් ඇති ලොම් ඇත්තේ ද වෙයි. හේ ලකුණුවලින් සමන්විත වූයේ, ඉදින් ගිහි ගෙහි වසන්නේ නම් … සක්විති රජ වෙයි … රජ වනුයේ කුමක් ලබා ද? සියලු සත්නට අග්‍ර ද ශ්‍රේෂ්ඨ ද ප්‍රමුඛ ද උත්තම ද ප්‍රවර ද වෙයි. බුදු වනුයේ කුමක් ලබා ද? සියලු සත්නට ද අග්‍ර ද ශ්‍රේෂ්ඨ ද ප්‍රමුඛ ද උත්තම ද ප්‍රවර ද වෙයි. බුදු වනුයේ මෙය ලබයි.” භාග්‍යවතුන් වහන්සේ මේ කාරණය වදාළ සේක. එහි මෙය ගාථායෙන් මෙසේ කියනු ලැබේ:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“පෙරැ අර්‍ථ හා ධර්‍ම හා නිඃශ්‍රිත වූ වචන කියනුයේ, බොහෝ දෙනාට දෙලෝ වැඩ දැක්වීය. ප්‍රාණීනට හිත සුව එළවන්නේ විය, නො මසුරු වැ ධර්‍මයාගය කෙළේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 254,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "තෙන සො සුචරිතෙන කම්මුනා\nසුගතිං වජති තත්ථ මොදති\nලක්ඛණානි ච දුවෙ ඉධාගතො\nඋත්තමප්පමුඛතාය{1} වින්දති."
                    },
                    {
                        "type": "gatha",
                        "text": "උබ්භමුප්පතිතලොමවාසසො\nපාදගණ්ඨිරහු සාධු සණ්ඨිතා.\nමංසලොහිතා චිතා තචොත්ථටා\nඋපරිචරණා ච සොභනා{2} අහු."
                    },
                    {
                        "type": "gatha",
                        "text": "ගෙහමාවසති චෙ තථාවිධො\nඅග්ගතං වජති කාමභොගිනං,\nතෙන උත්තරිතරො න විජ්ජති\nජම්බුදීපමභිභුය්ය ඉරියති."
                    },
                    {
                        "type": "gatha",
                        "text": "පබ්බජම්පි ච අනොමනික්කමො\nඅග්ගතං වජති සබ්බපාණිනං,\nතෙන උත්තරිතරො න විජ්ජති\nසබ්බලොකමභිභුය්ය විහරතී’ති."
                    },
                    {
                        "type": "centered",
                        "text": "එණිජඞ්ඝලක්ඛණං (11)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "9. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො සක්කච්චං වාචෙතා අහොසි සිප්පං වා විජ්ජං වා චරණං වා කම්මං වා, ‘කින්ති මෙ ඛිප්පං විජානෙය්යුං, කින්ති’මෙ ඛිප්පං පටිපජ්ජෙය්යුං න චිරං කිලිස්සෙය්යුන්ති. සො තස්ස කම්මස්ස කතත්තා -පෙ- සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉදං මහාපුරිසලක්ඛණං පටිලභති. එණිජඞ්ඝො හොති. සො තෙන ලක්ඛණෙන සමන්නාගතො, සචෙ අගාරං අජ්ඣාවසති රාජා හොති චක්කවත්තී -පෙ- රාජා සමානො කිං ලභති? යානි තානි රාජාරහානි රාජඞ්ගානි රාජූපභොගානි රාජානුච්ඡවිකානි, තානි ඛිප්පං පටිලභති රාජා සමානො ඉදං ලභති -පෙ- බුද්ධො සමානො කිං ලභති? යානි තානි සමණාරහානි සමණඞ්ගානි සමණූපභොගානි සමණානුච්ඡවිකානි, තානි ඛිප්පං පටිලභති. බුද්ධො සමානො ඉදං ලභති. එතමත්ථං භගවා අවොච. තත්ථෙතං වුච්චති:"
                    },
                    {
                        "type": "gatha",
                        "text": "සිප්පෙසු විජ්ජාචරණෙසු කම්මසු{3} \nකථං විජානෙය්යු{4} ලහුන්ති ඉච්ඡති.\nයදූපඝාතාය න හොති කස්සචි\nවාචෙති ඛිප්පං න චිරං කිලිස්සති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උත්තම සුඛතාය (ස්යා.) උත්තම පමුඛතාය (කම්) උත්තමපමුඛතාය සුඛානි (සීමු)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. උපරිජානු සොභනා (ස්යා.) පපරි ච පන සොභනා (PTS.)"
                    },
                    {
                        "type": "footnote",
                        "text": "3. කම්මෙසු - (මඡසං.)"
                    },
                    {
                        "type": "footnote",
                        "text": "4. විජානෙය්යුං - (මඡසං)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "හෙ තෙමේ ඒ කුශලකර්‍ම බලයෙන් ස්වර්‍ගයට යෙයි, එහි සතුටු වෙයි. මෙහි ආයේ උතුම් සැප ඇති වන බවට නිමිති වූ ලකුණු දෙකක් ලබයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හේ තෙමේ උඩට නැමුණු ලොම් ඇත්තේ වෙයි. පාගැට (ගොප් ඇට) මොනොවට පිහිටියේ වෙයි. ඔහුගේ කෙණ්ඩා ද මසින් ලෙයින් පිරුණාහු, සිවියෙන් වැසුණාහු ශෝභන වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉදින් එබඳු පුද්ගල තෙමේ ගෙහි වසන්නේ නම්, කාම අතුරෙහි අග්‍ර බවට යෙයි. ඔහුට වඩා උතුම් වූවක් ඇති නො වෙයි. දඹදිව (මහපොළොව) අභිභවා වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "අලාමක විහරණ ඇති හෙ තෙමේ පැවිදි වන්නේ ද සියලු සත්නට අක් බවට යෙයි. ඔහුට වැඩිතරම් කිසිවෙක් නොමැති වෙයි. හේ මුළු ලොව අබිබවා වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "ඒණිජඞ්ඝා ලක්ෂණය (11)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "9. මහණෙනි, “තථාගත තෙම පෙර භවයෙහි පළමු වුසූ තන්හි පෙරැ මිනිස් වූයේ ම, කෙසේ නම් මොහු ශිල්ප ද විද්‍යා ද චරණ ධර්‍ම (ශීලය) ද කර්‍මස්වකතාව ද වහා දැනගන්නාහු ද, කෙසේ නම් මොහු වහා ඒ දෑ පිළිපදනාහු ද, බොහෝ කල් නො වෙහෙසෙන්නාහු දැ යි ඒ ශිල්පාදිය සකසා කියවන්නේ විය” යන යමෙක් ඇද්ද හේ ඒ කර්‍මය කළ බැවින් කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට යෙයි … එයින් සැව මේ මිනිසත්බවට ආයේ ම මේ මහ පුරිස් ලකුණ ලබයි. ඕලු මුවන්ගේ බඳු කෙණ්ඩා ඇත්තේ වෙයි. එ ලකුණින් යුත් හෙ තෙම ඉදින් ගිහි ගෙහි වසන්නේ නම් … සක්විති රජ වෙයි … රජ වන්නේ කුමක් ලබා ද? රජක්හට සුදුසු වූ ඇත් අස් ආදි යාන ද, රජුනට අවයව වූ සේනා ද, රජුනට උපභෝග වූ යම් දෑ ඇද්ද, රජුනට නිසි වූ තවත් යම් දෑ ඇද්ද, ඒ සියල්ල වහා ලබයි … බුදු වනුයේ කුමක් ලබන්නේ ද? ශ්‍රමණයනට සුදුසු වූ ශ්‍රමණාවයව වූ ශ්‍රමණයන්ගේ උපභෝග පරිභෝග වූ ශ්‍රමණයනට නිසි වූ යම් දෑ ඇද්ද, ඒවා වහා ලබයි. බුදු වනුයේ මෙය ලබයි. භාග්‍යවතුන් වහන්සේ මෙ කරුණ වදාළ සේක. එහි මෙය ගාථා බන්ධනයෙන් කියනු ලැබේ:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ශිල්පයන්හි ද විද්‍යා හා චරණයන්හි ද කර්‍මස්වකතායෙහි ද කෙසේ වහා දැන ගන්නේ දැ යි හේ කැමැති වෙයි. යමෙක් කිසිවකුගේත් විනාශය පිණිස නොවේ ද, යමක් උගන්නට බොහෝ කල් නො වෙහෙසෙන්නේ ද, එපරිදදෙන් ඒ දෑ වහා උගන්වයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 256,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "තං කම්මං කත්වා කුසලං සුඛුද්රයං{1} \nජඞ්ඝා මනුඤ්ඤා ලභතෙ සුසණ්ඨිතා,\nවට්ටා සුජාතා අනුපුබ්බමුග්ගතා\nඋද්ධග්ගලොමා සුඛුමත්තචොත්ථටා."
                    },
                    {
                        "type": "gatha",
                        "text": "එණෙය්යජඞ්ඝො’ති තමාහු පුග්ගලං\nසම්පත්තියා ඛිප්පමිධාහු ලක්ඛණං,\nගෙහානුලොමානි යදාභිකඞ්ඛති\nඅපබ්බජං ඛිප්පමිධාධිගච්ඡති."
                    },
                    {
                        "type": "gatha",
                        "text": "සචෙ ච පබ්බජ්ජමුපෙති තාදිසො\nනෙක්ඛම්මඡන්දාභිරතො විචක්ඛණො,\nඅනුච්ඡවිකස්ස යදානුලොමිකං\nතං වින්දති ඛිප්පමනොමවික්කමො’ති.{2}"
                    },
                    {
                        "type": "centered",
                        "text": "සුඛුමච්ඡවිලක්ඛණං (12)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "10. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො සමණං වා බ්රාහ්මණං වා උපසඞ්කමිත්වා පරිපුච්ඡිතා අහොසි: කිං භන්තෙ කුසලං, කිං අකුසලං, කිං සාවජ්ජං, කිං අනවජ්ජං, කිං සෙවිතබ්බං, කිං නසෙවිතබ්බං, කිම්මෙ කරීයමානං දීඝරත්තං අහිතාය දුක්ඛාය අස්ස, කිං වා පන මෙ කරීයමානං දීඝරත්තං හිතාය සුඛාය අස්සා? ති. සො තස්ස කම්මස්ස කතත්තා උපවිතත්තා -පෙ- සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉදං මහාපුරිසලක්ඛණං පටිලභති. සුඛුමච්ඡවි හොති සුඛුමත්තා ඡවියා රජොජල්ලං කායෙ න උපලිප්පති. සො තෙන ලක්ඛණෙන සමන්නාගතො, සචෙ අගාරං අජ්ඣාවසති, රාජා හොති චක්කවත්තී -පෙ- රාජා සමානො කිං ලභති? මහාපඤ්ඤො හොති, නාස්ස හොති කොචි පඤ්ඤාය සදිසො වා, සෙට්ඨො වා කාමභොගීනං. රාජා සමානො ඉදං ලභති -පෙ- බුද්ධො සමානො කිං ලභති? මහාපඤ්ඤො හොති පුථුපඤ්ඤො හාසපඤ්ඤො ජවනපඤ්ඤො තික්ඛපඤ්ඤො නිබ්බෙධිකපඤ්ඤො, නාස්ස හොති කොචි පඤ්ඤාය සදිසො වා, සෙට්ඨො වා සබ්බසත්තානං. බුද්ධො සමානො ඉදං ලභති. එතමත්ථං භගවා අවොච. තත්ථෙතං වුච්චති:"
                    },
                    {
                        "type": "gatha",
                        "text": "පුරෙ පුරත්ථා පුරිමාසු ජාතිසු\nඅඤ්ඤාතුකාමො පරිපුච්ඡිතා අහු,\nසුස්සූසිතා පබ්බජිතං උපාසිතා\nඅත්ථන්තරො අත්ථකථං නිසාමයි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සුඛින්ද්රියං - (කම්)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. ඛිප්පමනොමනික්කමො - (ස්යා. PTS.)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "කුසල් වූ සුව වඩන ඒ කර්‍මය කිරිමෙන් මොනොවට පිහිටි, වට වූ, මනාසේ හටගත්, පිළිවෙළින් නැංගාවූ, සියුම් සිවියෙන් වැසුණු, මන වඩන ජඞ්ඝා (කෙණ්ඩා) ද, අක් උඩුකුරු ව සිටි රෝම ද ලබයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(එසේ වූ) ඒ පුද්ගලයා එණෙය්‍යජඞ්ඝ (ඕළුමුවන්ගේ කෙණ්ඩා බඳු කෙණ්ඩා ඇත්තේ) යැ යි ලක්ෂණපාඨකයෝ කීහු. ඒ ලක්ෂණය මෙහි දී වහා සම්පත් ලබනුවට නිමිත්ත යැ යි කීහු. පැවිදි නො වන්නේ යම් කලෙක ගිහිගෙට අනුලොම් වූ (සුදුසු වූ) දෑ කැමැති වේ ද, ඒ කල එය ද මෙහි දී වහා ලබයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "නෛෂ්කාම්‍ය ඡන්දයෙහි ඇලුණු නුවැණැති අලාමක විහරණ ඇති එබඳු පුද්ගල තෙමේ ඉඳින් පැවිදි වන්නේ ද, ඔහුට සුදුසු වූ අනුලොම් වූ යම් දැයෙක් ඇද්ද, එය වහා ලබයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "ශුක්ෂ්මච්ඡවිලක්ෂණය (12)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "10. මහණෙනි, තථාගත තෙමේ පළමු දෑහි, පළමු භවයෙහි, පළමු වුසූ තන්හි, පෙරැ මිනිස් වූයේ ම, මහණකු හෝ බමුණකු හෝ කරා එළැඹ “වහන්ස, කුසල් නම් කිම? අකුසල් නම් කිම? කිමෙක් වරද සහිත ද? කිමෙක් වරද රහිත ද? කිමෙක් සෙවියැ යුතු ද? කිමෙක් නො සෙවියැ යුතු ද? මා විසින් කිමෙක් කරනු ලබනුයේ බොහෝ කල් අහිත පිණිස දුක් පිණිස වන්නේ ද? මා විසින් කිමෙක් හෝ කරනු ලබනුයේ බොහෝ කල් හිත පිණිස සුව පිණිස වන්නේ දැ?” පුන පුනා ‘විචාරන්නේ විය’ යන යමෙක් ඇද්ද, හේ ඒ කර්‍මය කළ බැවින්, රැස් කළ බැවින් කාබුන් … මරණින් මතු මනා ගති ඇති සග ලොවට යෙයි … හේ එයින් සැව, මෙ මිනිස් බවට ආයේ ම, මේ මහ පුරිස් ලකුණ ලබයි. සියුම් සිවිය ඇත්තේ වෙයි. සිවිය සියුම් බැවින් රජස් දැලි කයෙහි නො ලැගෙයි. ඒ ලක්ෂණයෙන් යුත් හෙ තෙමේ ඉදින් ගිහි ගෙයි වසන්නේ නම්, … සක්විති රජ වෙයි. රජ වනුයේ කුමක් ලබයි ද? මහා ප්‍රඥා ඇත්තේ වෙයි. කාමභෝගීන් අතුරෙහි ප්‍රඥායෙන් ඔහුට සමානයෙක් හෝ වැඩි තරම් වූයෙක් හෝ නො වෙයි. රජ වනුයේ මෙය ලබයි … බුදු වනුයේ කුමක් ලබයි ද? මහ නුවණැත්තේ වෙයි, (ස්කන්ධාදී නානාතන්හි) පැතිරැ පැවැති නුවණැත්තේ වෙයි, සතුට බහුල ව මගපල පසක් කරන නුවණැත්තේ වෙයි, ස්කන්ධාදියෙහි වහා දිවෙන නුවණැත්තේ වෙයි, තියුණු නුවණැත්තේ වෙයි, විනිවිද යන නුවණ ඇත්තේ වෙයි, සියලු සතුන් අතුරෙහි මොහුට නුවණින් සමාන හෝ විශිෂ්ට වූ කිසිවෙක් නො වෙයි. බුදු වනුයේ මෙය ලබයි. භාග්‍යවතුන් වහන්සේ මෙ කරුණ වදාළ සේක, එහි මෙය (ගාථායෙන්) කියනු ලැබෙයි:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘පෙරැ ඉතා පෙරැ පළමු ජාතීන්හි දී, දැනගනු කැමැත්තේ, ප්‍රශ්න පුළුවුස්නේ විය. ඇසියැටි වනුයේ පැවිද්දහු ඇසුරු කරන්නේ විය. අරුත් දැන ගන්නා සිතැත්තේ අර්‍ථකථනය ඇසී ය. ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 258,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "පඤ්ඤාපටිලාභගතෙන{1} කම්මුනා\nමනුස්සභූතො සුඛුමච්ඡවී අහු,\nබ්යාකංසු උප්පාදනිමිත්තකොවිදා\nසුඛුමානි අත්ථානි අවෙච්ච දක්ඛිති."
                    },
                    {
                        "type": "gatha",
                        "text": "සචෙ න පබ්බජ්ජමුපෙති තාදිසො\nවත්තෙති චක්කං පඨවිං පසාසති.\nඅත්ථානුසත්ථිසු පරිග්ගහෙසු ච\nන තෙන සෙෙය්යා සදිසො ච විජ්ජති."
                    },
                    {
                        "type": "gatha",
                        "text": "සචෙ ච පබ්බජ්ජමුපෙති තාදිසො\nනෙක්ඛම්මඡන්දාභිරතො විචක්ඛණො,\nපඤ්ඤාවිසිට්ඨං ලභතෙ අනුත්තරං\nපප්පොති බොධිං වරභූරිමෙධසො’ති."
                    },
                    {
                        "type": "centered",
                        "text": "සුවණ්ණවණ්ණතාලක්ඛණං (13)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "11. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො අක්කොධනො අහොසි අනුපායාසබහුලො, බහුම්පි වුත්තො සමානො නාභිසජ්ජි, න කුප්පි, න බ්යාපජ්ජි නප්පතිත්ථියි, න කොපඤ්ච දොසඤ්ච අප්පච්චයඤ්ච පාත්වාකාසි. දාතා ච අහොසි සුඛුමානං මුදුකානං අත්ථරණානං පාපුරණානං{2} ඛොමසුඛුමානං කප්පාසිකසුඛුමානං කොසෙය්යසුඛුමානං කම්බලසුඛුමානං. සො තස්ස කම්මස්ස කතත්තා උපචිතත්තා -පෙ- සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉමං මහාපුරිසලක්ඛණං පටිලභති. සුවණ්ණවණ්ණො හොති කඤ්චනසන්නිභත්තචො. සො තෙන ලක්ඛණෙන සමන්නාගතො, සචෙ අගාරං අජ්ඣාවසති, රාජා හොති චක්කවත්තී. -පෙ- රාජා සමානො කිං ලභති? ලාභී හොති සුඛුමානං මුදුකානං අත්ථරණානං පාපුරණානං ඛොමසුඛුමානං කප්පාසිකසුඛුමානං කොසෙය්යසුඛුමානං කම්බලසුඛුමානං. රාජා සමානො ඉදං ලභති -පෙ- බුද්ධො සමානො කිං ලභති? ලාභී හොති සුඛුමානං මුදුකානං අත්ථරණානං පාපුරණානං ඛොමසුඛුමානං. කප්පාසිකසුඛුමානං කොසෙය්යසුඛුමානං කම්බලසුඛුමානං. බුද්ධො සමානො ඉදං ලභති. එතමත්ථං භගවා අවොච. තත්ථෙතං වුච්චති:"
                    },
                    {
                        "type": "gatha",
                        "text": "1. අක්කොධඤ්ච අධිට්ඨහි අදාසි{3} \nදානඤ්ච වත්ථානි සුඛුමානි සුච්ඡවීනි.\nපුරිමතරභවෙ ඨිතො’භිවිස්සජි{4}\nමහිමිව සුරො අභිවස්සං,"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පඤ්ඤාපටිලාභකතෙන - (PTS)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. පාරවුණානං - (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "3. අදසී ච - (PTS)"
                    },
                    {
                        "type": "footnote",
                        "text": "4. අභිවිස්සජි - (මඡසං)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "මිනිස් වූයේ, ප්‍රඥාව ලබනු පිණිස පැවැති කර්‍මයෙන් සියුම් සිවි ඇත්තේ විය, උත්පාද ශාස්ත්‍රයෙහි ද ලක්ෂණ ශාස්ත්‍රයෙහි ද දක්ෂ පඬිහු මෙ තෙම සියුම් අරුත් අවබෝධකොට දක්නේ යැ යි පැවැසූහ."
                    },
                    {
                        "format": 13,
                        "text": "එබඳු තැනැත්තේ ඉදින් පැවිද්දට නොපැමිණෙන්නේ නම්, අණ සක පවත්වයි, පොළොව පාලනය කෙරෙයි, අර්ථානුශාසනයන්හි ද, අර්ථානාර්ථ පිරිසිඳ දැන්මෙහිද, උන්වහන්සේට වැඩිතරම් හෝ සමාන වූ හෝ එකෙක් නොමැති වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එබඳු තැනැත්තේ නෙක්ඛම්ම ඡන්දයෙහි ඇලුණේ, ඉදින් පැවිද්දට පැමිණෙන්නේ නම්, විශිෂ්ට ප්‍රඥාව ලබයි, උතුම් වූ මහත් නුවණැත්තේ නිරුත්තර බෝධියට (සම්‍යක්සම්බුද්ධත්වයට) පැමිණෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "ස්වර්‍ණවර්‍ණතාලක්ෂණය (13)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "11. මහණෙනි, තථාගත තෙමේ පළමු දෑහි, පළමු බෙවෙහි, පළමු වුසූ තන්හි පෙරැ මිනිස් වූයේ නොකිපෙන සුලු වූයේ, උපායාස බහුල කොට නැත්තේ විය. බොහෝ සේ ද කියන ලදුයේ ම ක්‍රෝධ වශයෙන් නො ගැටුණේ ය, නො කිපුණේ ය, සිතැ කුණු ඇති බවට (ව්‍යාපාදයට) නො පැමිණියේ ය. ක්‍රෝධය සිතැ නො පිහිටුවී ය, කෝපයත් ද්වේෂයත් නො සතුටත් පහළ නො කෙළේ ය. සියුම් වූ මොළොක් වූ ඇතිරිලි ද, පොරෝනා ද, සියුම් කොමු පිළී ද සියුම් කපුපිළි ද සියුම් තිහිරි පිළි ද සියුම් පලස් ද දෙන්නේත් විය, යන යමෙක් ඇද්ද, හේ ඒ කර්‍මය කළ බැවින්, රැස් කළ බැවින් කාබුන් මරණින් මතු මනාගති ඇති සග ලොවට පැමිණියේ ය. එයින් සැව මේ මිනිස් බවට ආයේ ම මේ මහපුරිස් ලකුණ ලබයි. හේ රන්වන් වෙයි. රන් බඳු පැහැති සිවිය ඇත්තේ වෙයි. හේ ඒ ලකුණින් සමන්විත වූයේ ගිහිගෙහි වසන්නේ නම් සක්විති රජ වෙයි … රජ වනුයේ කුමක් ලබයි ද? සියුම් වූ මොළොක් වූ ඇතිරිලි ද පිළි ද සියුම් තිහිර පිළි ද සියුම් පලස් ද ලබන්නේ වෙයි. රජ වනුයේ මෙය ලබයි … බුදු වනුයේ කුමක් ලබයි ද? සියුම් වූ මොළොක් වූ ඇතිරිලි ද පොරෝනා ද සියුම් කොමු පිළි ද සියුම් සියුම් කොමු පිළි ද, සියුම් කපු පිළි ද, සියුම් තිහිරි පිළි ද සියුම් පලස් ද ලබන්නේ වෙයි. බුදු වනුයේ මෙය ලබයි.” භාග්‍යවතුන් වහන්සේ මේ කරුණ වදාළ සේක. එහි මෙය ගාථායෙන් කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘පළමු බෙවෙහි සිටියේ අක්‍රෝධය ද ඉටී ය, පොළොව තෙමන මේඝය මෙන් දන් ද දුන්නේ ය. සියුම් වූ මනා පැහැති වස්ත්‍ර ද දුන්නේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 260,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "2. තං කත්වාන ඉතො චුතො දිවං\nඋපපජ්ජ{1} සුකතඵලවිපාකමනුභුත්වා,\nකණකතනුසන්නිභො ඉධාභිභවති\nසුරවරතරොරිව ඉන්දො."
                    },
                    {
                        "type": "gatha",
                        "text": "3. ගෙහමාවසති නරො අපබ්බජ්ජ\nමිච්ඡාමහතිමහිං අනුසාසතී \nපසය්හ ස හී ච සත්තරතනං \nපටිලභති විමල{2} සුඛුමච්ඡවිං සුචිඤ්ච."
                    },
                    {
                        "type": "gatha",
                        "text": "4. ලාභී අච්ඡාදනවත්ථමොක්ඛපාපුරණානං{3}\nභවති සදි අනාගාරියතං උපෙති.\nස හි{4} පුරිමකතඵලං අනුභවති\nන භවති කතස්ස පනාසො’ති."
                    },
                    {
                        "type": "centered",
                        "text": "කොසොහිතවත්ථගුය්හතාලක්ඛණං (14)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "12. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමංභවං පුරිමං නිකෙතං පුබ්බෙමනුස්සභූතො සමානො චිරප්පනට්ඨෙ සුචිරප්පවාසිනො ඤාතී මිත්තෙ සුහජ්ජෙ සඛිනො සමානෙතා අහොසි. මාතරම්පි පුත්තෙන සමානෙතා අහොසි පුත්තම්පි මාතරා සමානෙතා අහොසි, පිතරම්පි පුත්තෙන සමානෙතා අහොසි, පුත්තම්පි පිතරා සමානෙතා අහොසි, භාතරම්පි භාතරා සමානෙතා අහොසි, භාතරම්පි භගිනියා සමානෙතා අහොසි, භගිනිම්පි භාතරා සමානෙතා අහොසි, සමඞ්ගීකත්වා ච අබ්භනුමොදිතා අහොසි. සො තස්ස කම්මස්ස කතත්තා -පෙ- සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉදං මහාපුරිසලක්ඛණං පටිලභති, කොසොහිතවත්ථගුය්හො හොති. සො තෙන ලක්ඛණෙන සමන්නාගතො සචෙ අගාරං අජ්ඣාවසති රාජා හොති චක්කවත්තී -පෙ- රාජා සමානො කිං ලභති? පහූතපුත්තො හොති, පරොසහස්සං ඛො පනස්ස පුත්තා භවන්ති සූරා වීරඞ්ගරූපා පරසෙනප්පමද්දනා. රාජා සමානො ඉදං ලභති -පෙ- බුද්ධො සමානො කිං ලභති? පහූත පුත්තො හොති අනෙකසහස්සං ඛො පනස්ස පුත්තා භවන්ති සූරා වීරඞ්ග රූපා පරසෙනප්පමද්දනා. බුද්ධො සමානො ඉදං ලභති. එතමත්ථං භගවා අවොච. තත්ථෙතං වුච්චති:"
                    },
                    {
                        "type": "gatha",
                        "text": "පුරෙ පුරත්ථා පුරිමාසු ජාතිසු\nචිරප්පනට්ඨෙ සුචිරප්පවාසිනො,\nඤාතී සුහජ්ජෙ සඛිනො සමානයී\nසමඞ්ගිකත්වා{5} අනුමොදිතා අහු."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උපපජ්ජි - (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. විපුල - (ස්යාම) විපුලං - (PTS)"
                    },
                    {
                        "type": "footnote",
                        "text": "3. පාවුරණානං (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "4. සාහිතො - (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "5. සමග්ගිං කත්වා - (ස්යා PTS)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ඒ කර්‍මය කොට මෙයින් සැව, දෙව්ලෝ පැමිණ, කුසල් පල විඳ, මෙ ලොව්හි දී දෙවියනට ශ්‍රේෂ්ඨ වූ ඉන්ද්‍රයා මෙන් රන් බඳු පැහැති සිරුර ඇත්තේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඒ මිනිස් තෙම අප්‍රව්‍රජ්‍යාව (ගිහිබව) කැමැති වන්නේ, ගිහිගෙහි වසන්නේ නම්, මහත් පොළොව අබිබවා අනුශාසන කෙරෙයි (පාලනය කෙරෙයි.) හේ වනාහි මහත් වූ ද සියුම් වූ ද මනා පැහැත්තාවූ ද ඉතා උතුම් වස්ත්‍ර ලබයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉදින් පැවිද්දට පැමිණෙන්නේ නම්, හඳනා වස්ත්‍ර හා සෙසු වස්ත්‍ර ද (කොඳුපලස් ඈ) පාමොක් පොරෝනා ද ලබන සුලු වෙයි. හේ වනාහි පළමු අත් බව්හි කළ කුශලයන්ගේ ඵලය විඳියි. කළ කුශලයේ විපාක නොදී වැනැසී යෑමෙක් ද නො වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "කොෂාවහිත වස්ත්‍රගුහ්‍යතා ලක්ෂණය (14)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "12. මහණෙනි, පළමු දෑහි, පළමු වුසූ තන්හි, පෙරැ මිනිස් වුයේ ම බොහෝ කල් දක්නට නැති වැ ගිය, ඉතා බොහෝ කල් පිට රටැ වුසූ නෑයන් ද මිතුරන් ද සුහෘදයන් ද යහළුවන් ද එක් තැනට පමුණුවන්නේ (ගළපන්නේ) වී ය, මව ද පුතු හා හමු කරන්නේ විය, පුතු ද මව හා හමු කරන්නේ විය, පියා ද පුතු හා හමු කරන්නේ විය, පුතා ද පියා හා හමු කරන්නේ විය, සොහොවුරා ද සොහොවුරා හා හමු කරන්නේ විය, සොහොවුරා ද සොහොවිරිය හා හමු කරන්නේ විය, සොහොවිරිය ද සොවුරා හා හමු කරන්නේ විය, සොහොවිරිය ද සොහොවිරිය හා හමු කරන්නේ විය. සමගිඑකතු කොට ද එයට සතුටු වන්නේ විය යන යමෙක් ඇද්ද, ඒ කර්‍මය කළ බැවින් රැස් කළ බැවින්, හෙ තෙමේ කා බුන් මරණින් මතු මනා ගති ඇති සග ලොවට පැමිණියේ ය … එයින් සැව, මේ මිනිස් බවට ආයේ ම මේ මහ පුරිස් ලකුණ බලයි. කොෂාවහිත වස්ත්‍රගුහ්‍ය ලක්ෂණය ඇත්තේ වෙයි. හේ ඒ ලක්ෂණයෙන් සමන්විත ඉදින් ගිහිගෙහි වසන්නේ නම් … සක්විති රජ වෙයි. රජ වනුයේ කුමක් ලබයි ද? බොහෝ පුතුන් ඇත්තේ වෙයි. ඔහුට ශූර වූ (බිය නො ගන්නා) මූර්තිමත් වීර්‍ය්‍යය බඳු වූ සතුරු සෙන් මඩනට සමත්, දහසකට වැඩි තරම් පුත්‍රයෝ වෙත් … බුදු වූ යේ කුමක් ලබයි ද? බොහෝ පුතුන් ඇත්තේ වෙයි. ඔබට වනාහි ශූර වූ උතුම් වීර සාර ස්වභාවය ඇති ප්‍රතිපක්ෂ සෙනා මඩින්නට පොහොසත් ශ්‍රාවක පුත්‍රයෝ ද නොයෙක් දහස් ගණන් වෙත්. බුදු වනුයේ මේ අනුසස් ලබයි.” භාග්‍යවතුන් වහන්සේ මේ කාරණය වදාළ සේක. එහි මෙය ගාථා බන්ධනයෙන් මෙසේ කියනු ලැබේ:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“පෙරැ, බොහෝ පෙරැ, පළමු දෑහි, බොහෝ කල් නො දක්නා ලද ඉතා බොහෝ කල් වෙන් ව වුසූ නෑයන් ද මිතුරන් ද යහළුවන් ද එකතු කෙළේ ය. සමගි කොට ද එයට සතුටු විය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 262,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "සො තෙන{1} කම්මෙන දිවං අපක්කමි{2}\nසුඛඤ්ච ඛිඩ්ඩා රතියො ච අන්වභී.\nතතො චවිත්වා පුනරාගතො ඉධ\nකොසොහිතං වින්දති වත්ථඡාදියං."
                    },
                    {
                        "type": "gatha",
                        "text": "පහූතපුත්තො භවතී තථාවිධො\nපරොසහස්සං ච භවන්ති අත්රජා.\nසූරා ච වීරා ච{3} අමිත්තතාපනා\nගිහිස්ස පීතිං ජනනා පියංවදා."
                    },
                    {
                        "type": "gatha",
                        "text": "බහූතරා පබ්බජිතස්ස ඉරීයතො\nභවන්ති පුත්තා වචනානුසාරිනො.\nගිහිස්ස වා පබ්බජිතස්ස වා පුන\nතං ලක්ඛණංභවති{4} තදත්ථජොතකන්ති,"
                    },
                    {
                        "type": "centered",
                        "text": "පඨමභාණවාරො නිට්ඨිතො.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "පරිමණ්ඩල-අනොනම-ජ’ණ්ණුපරිමසනලක්ඛණානි (15,16)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "13. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො මහාජනසඞ්ගහං සමෙක්ඛමානො සමං ජානාති, සාමං ජානාති, පුරිසං ජානාති, පුරිසවිසෙසං ජානාති අයමිදමරහති අයමිදමරහතී’ති. තත්ථ තත්ථ පුරිසවිසෙසකරො පුරෙ අහොසි. සො තස්ස කම්මස්ස කතත්තා -පෙ- සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉමානි ද්වෙ මහාපුරිසලක්ඛණානි පටිලභති. නිග්රොධපරිමණ්ඩලො ච හොති, ඨිතකො’ව අනොනමන්තො උභොහි පාණීතලෙහි ජණ්ණුකානි පරිමසති පරිමජ්ජති. සො තෙහි ලක්ඛණෙහි සමන්නාගතො සචෙ අගාරං අජ්ඣාවසති රාජා හොති චක්කවත්තී -පෙ- රාජා සමානො කිං ලභති? අඩ්ඪො හොති මහද්ධනො මහාභොගො පහූතජාතරූපරජතො පහූතවිත්තූපකරණො පහූතධනධඤ්ඤො පරිපුණ්ණකොසකොට්ඨාගාරො. රාජා සමානො ඉදං ලභති. -පෙ- බුද්ධො සමානො කිං ලභති? අඩ්ඪො හොති මහද්ධනො මහාභොගො. තස්සිමානි ධනානි හොන්ති, සෙය්යථිදං සද්ධාධනං සීලධනං හිරිධනං ඔත්තප්පධනං සුතධනං චාගධනං පඤ්ඤාධනං. බුද්ධො සමානො ඉදං ලභති. එතමත්ථං භගවා අවොච. තත්ථෙතං වුච්චති:"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ස තෙන - (කම්)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. සමක්කමි - (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "3. විරඞ්ගරූපා - (කම්)"
                    },
                    {
                        "type": "footnote",
                        "text": "4. ජායති - (මඡසං)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "හේ ඒ කර්‍මයෙන් දෙව්ලෝ ගියේ ය. දෙව් සුව ද ක්‍රීඩාරතීන් ද අනුභව කෙළේ ය. එයින් සැව, යලි මෙහි ආයේ කොශාවහිත වස්ත්‍රගුහ්‍යතා ලක්ෂණය ලබයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එබඳු තැනැත්තේ බොහෝ පුතුන් ඇත්තේ වෙයි. ගිහි වූ මොහුට ශූර වූ ද වීර වූ ද සතුරන් මඩනුයෙහි පොහොසත් වූ, ප්‍රීතිය උපදවන්නා වූ, පිය බස් තෙපලන දහසකට වැඩි දෙනෙක් පුත්‍රයෝ වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පැවිදි වැ වසන්නහුට ඉතා බොහෝ වූ, වචනය පිළිපදනා, ශ්‍රාවක පුත්‍රයෝ වෙත්. ඒ (කොශාවහිත වස්ත්‍රගුහ්‍ය) ලක්ෂණය ගිහියාට හෝ වැලි පැවිදි වූවාහට හෝ ඒ අරුත පවසන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පළමු බණවර යැ.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 21,
                        "text": "පරිමණ්ඩලතා - අනවනත - ජානුපරාමර්‍ශනතා ලක්ෂණ (15,16)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "13. මහණෙනි, තථාගත තෙමේ පළමු දෑහි, පළමු බෙවෙහි, පළමු වුසූ තන්හි, පෙරැ මිනිස් වූයේ ම මහජනයාට සංග්‍රහ කිරීම සම ව දකිනුයේ (ඒ ඒ තැනැත්හු හා) සම වූවහු දනී, තෙමේ දනී, පුරුෂයා දනී, පුරුෂයන්ගේ වෙසෙස දනී, මෙ තෙමේ මෙයට සුදුසු ය, මෙ තෙමේ මෙයට සුදුසු යැ යි ඒ ඒ දැයෙහි පුරුෂයන්ගේ වෙසෙස දැන කටයුතු කරනුයේ විය යන යමෙක් ඇද්ද, හේ ඒ කර්‍මය කළ බැවින්, රැස් කළ බැවින්, කාබුන් මරණින් මතු මනාගති ඇති, සග ලොවට යෙයි. හේ එයින් සැව මෙ මිනිස් බවට ආයේ ම මේ මහ පුරිස් ලකුණු දෙක ලබයි. නුග රුකක් සේ සම පමණ ඇත්තේ වෙයි. සිටියේ ම නො නැමෙන්නේ දෙ අත්ලෙන් දෙදන පිරිමදියි, හේ ඒ ලකුණුවලින් සමන්විත වූයේ, ඉදින් ගිහි ගෙහි වසන්නේ නම් … සක්විති රජ වෙයි. රජ වනුයේ කුමක් ලබයි ද? ආඪ්‍ය වෙයි, මහත් ධන ඇත්තේ වෙයි, මහත් භෝග ඇත්තේ වෙයි. බොහෝ රන් රිදී ඇත්තේ, බොහෝ වස්තු උපකරණ ඇත්තේ, බොහෝ ධන ධාන්‍ය ඇත්තේ, පිරිපුන් වස්තු ගබඩා හා කොටුගුල් ඇත්තේ වෙයි. රජ වනුයේ මෙය ලබයි. … බුදු වනුයේ කුමක් ලබයි ද? ආඪ්‍ය වෙයි, මහත් ධන ඇත්තේ වෙයි, මහත් භෝග ඇත්තේ වෙයි. ඔහුට ශ්‍රද්ධාධනය, ශීලධනය. හිරිධනය, ඔත්තප්පධනය, ශ්‍රැතධනය, ත්‍යාගධනය, ප්‍රඥාධනය යන මේ ධනයෝ වෙත්. බුදු වනුයේ මෙය ලබයි. භාග්‍යවතුන් වහන්සේ මෙ කරුණ වදාළ සේක. එහි මෙය ගාථායෙන් කියනු ලැබෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 264,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "තුලිය පටිවිචය{1} චින්තයිත්වා\nමහාජනසඞ්ගහනං{2} සමෙක්ඛමානො,\nඅයමිදමරහතීති තත්ථ තත්ථ\nපුරිසවිසෙසකරො පුරෙ අහොසි."
                    },
                    {
                        "type": "gatha",
                        "text": "{3}ස හි ච පන ඨිතො අනොනමන්තො\nඵුසති කරෙහි උභොහි ජණ්ණුකානි,\nමහිරුහපරිමණ්ඩලො අහොසි\nසුචරිතකම්මවිපාකසෙසකෙන."
                    },
                    {
                        "type": "gatha",
                        "text": "බහුවිවිධ නිමිත්ත ලක්ඛණඤ්ඤූ\nඅභිනිපුණා මනුජාවියා කරිංසු,\nබහුවිවිධානි ගිහීනමරහානි\nපටිලභති දහරො සුසු කුමාරො."
                    },
                    {
                        "type": "gatha",
                        "text": "ඉධ මහීපති’ස්ස කාමභොගී\nගිහිපටිරූපකා බහූ භවන්ති,\nයදි ච ජහති සබ්බකාමභොගං\nලභති අනුත්තරමුත්තමං ධනග්ගන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "සීහපුබ්බද්ධකායාදිනි තීණි ලක්ඛණානි (17 - 19)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "14. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො බහුනො ජනස්ස අත්ථකාමො අහොසි හිතකාමො ඵාසුකාමො යොගක්ඛෙමකාමො ‘කින්ති මෙ සද්ධාය වඩ්ඪෙය්යුං, සීලෙන වඩ්ඪෙය්යුං, සුතෙන වඩ්ඪෙය්යුං,{4} චාගෙන වඩ්ඪෙය්යුං, ධම්මෙන වඩ්ඪෙය්යුං, පඤ්ඤාය වඩ්ඪෙය්යුං, ධනධඤ්ඤෙන වඩ්ඪෙය්යුං, ඛෙත්තවත්ථුනා වඩ්ඪෙය්යුං, ද්විපදචතුප්පදෙහි වඩ්ඪෙය්යුං, පුත්තදාරෙහි වඩ්ඪෙය්යුං, දාසකම්මකරපොරිසෙහි වඩ්ඪෙය්යුං, ඤාතීහි වඩ්ඪෙය්යුං, මිත්තෙහි වඩ්ඪෙය්යුං, බන්ධවෙහි වඩ්ඪෙය්යු’න්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පටිවිචය - (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. මහාජනං සඞ්ගාහතං - (කම්)"
                    },
                    {
                        "type": "footnote",
                        "text": "3. මහිංච - (මඡසං) සමා ච පන - (ස්යා)"
                    },
                    {
                        "type": "footnote",
                        "text": "4. සුතෙන වඩ්ඨෙය්යුං - (ස්යා)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "‘පෙර ජාතියෙහි නුවණින් කිරා බලා, නැවැත නැවැත පිරික්සා සිතා, මහජනයාට සංග්‍රහ කිරීම සම ව අපේක්ෂා කරනුයේ, ‘මෙ තෙමේ මෙය ලබන්නට සුදුසු වේ යැ’ යි ඒ ඒ තන්හි පුරුෂයන්ගේ වෙසෙස දැන සංග්‍රහ කරනුයේ විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඒ කර්‍මයාගේ ඉතිරි වූ විපාකයෙන් හේ සිටියේ ම නො නැමෙනුයේ දෙ අත්ලෙන් දෙ දණහිස් ස්පර්ශ කෙරෙයි, නුග රුකෙක පිරිමඩුල්ල මෙන් පිරිමඩුලු වූ සිරුර ඇත්තේ විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බොහෝ විවිධ නිමිත්ත ලක්ෂණ දන්නා ඉතා සියුම් නුවණැති බමුණු පඬිහු ‘ළදරු වූ ළපැටි වූ මේ කුමර ගෘහස්ථයනට සුදුසු වූ බොහෝ වූ ද විවිධ වූ ද වස්තූන් ලබතැ යි ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉදින් මෙහි රජෙක් වී නම් මොහුට ගිහියනට සුදුසු වූ කාමසම්පත් විඳිනුවට අවශ්‍ය වූ බොහෝ උපකරණයෝ වෙත්. ඉදින් සියලු කම්සැපත් අත් හරනේ නම්, නිරුත්තර වූ උතුම් ආර්ය ධනය ලබන්නේ යැ’ යි ද හෙළි කොට කීහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "සිංහපූර්‍වාර්ධකායාදි ත්‍රි ලක්ෂණ (17, 18, 19)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "14. මහණෙනි, තථාගත තෙමේ පළමු දෑහි, පළමු බෙවෙහි, පළමු වුසූ තන්හි, පෙරැ මිනිස් වූයේ ම, “මේ සත්වයෝ කෙසේ නම් සැදැහැයෙන් වැඩෙන්නාහු ද? ශීලයෙන් වැඩෙන්නාහු ද? සුභාෂිතශ්‍රවණයෙන් වැඩෙන්නාහු ද? ත්‍යාගගුණයෙන් වැඩෙන්නාහු ද? ලෞකික ධර්‍මයෝ වැඩෙන්නාහු ද? ප්‍රඥායෙන් වැඩෙන්නාහු ද? ධනධාන්‍යයෙන් වැඩෙන්නාහු ද? කෙත්වතින් වැඩෙන්නාහු ද? දෙපා සිවුපා සතුන්ගෙන්, අඹුදරුවන්ගෙන් දැසි දස් කම්කරු පුරුෂයන්ගෙන් නෑයන්ගෙන් මිතුරන්ගෙන්, (පරම්පරාගත) බන්ධුන්ගෙන් වැඩෙන්නාහු දැ?’යි බොහෝ දෙනාට වැඩ කැමැති වූයේ, අභ්‍යුදය කැමැති වූයේ සැප කැමැති වූයේ, නිරුපද්‍රැත බව කැමැති වූයේ විය. ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 266,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සො තස්ස කම්මස්ස කතත්තා -පෙ- සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉමානි තීනි මහාපුරිසලක්ඛණානි පටිලභති, සීහපුබ්බද්ධකායො ච හොති චිතන්තරංසො ච සමවත්තක්ඛන්ධො ච. සො තෙහි ලක්ඛණෙහි සමන්නාගතො සචෙ අගාරං අජ්ඣාවසති රාජා හොති චක්කවත්තී. රාජා සමානො කිං ලභති? අපරිහානධම්මො හොති, න පරිහායති ධනධඤ්ඤෙන ඛෙත්තවත්ථුනා ද්විපදචතුප්පදෙහි පුත්තදාරෙහි දාසකම්මකරපොරිසෙහි ඤාතීහි මිත්තෙහි බන්ධවෙහි, න පරිහායති සබ්බසම්පත්තියා. රාජා සමානො ඉදං ලභති. -පෙ- බුද්ධො සමානො කිං ලභති? අපරිහානධම්මො හොති, න පරිහායති සද්ධාය සීලෙන සුතෙන චාගෙන පඤ්ඤාය න පරිහායති සබ්බසම්පත්තියා. බුද්ධො සමානො ඉදං ලභති. එතමත්ථං භගවා අවොච. තත්ථෙතං වුච්චති:"
                    },
                    {
                        "type": "gatha",
                        "text": "සද්ධාය සීලෙන සුතෙන බුද්ධියා\nචාගෙන ධම්මෙන බහූහි සාධුහි\nධනෙන ධඤ්ඤෙන ච ඛෙත්තවත්ථුනා\nපුත්තෙහි දාරෙහි චතුප්පදෙහි ච."
                    },
                    {
                        "type": "gatha",
                        "text": "ඤාතීහි මිත්තෙහි ච බන්ධවෙහි ච\nබලෙන වණ්ණෙන සුඛෙන චූභයං,\nකථං න හායෙය්යුං පරෙ’ති ඉච්ඡති\nඉදං සමිද්ධං ච{1} පනාභිකඞ්ඛති."
                    },
                    {
                        "type": "gatha",
                        "text": "ස සීහපුබ්බද්ධසුසණ්ඨිතො අහු\nසමවත්තක්ඛන්ධො ච චිතන්තරංසො\nපුබ්බෙ සුචිණ්ණෙන කතෙන කම්මුනා\nඅහානියං පුබ්බනිමිත්තමස්ස තං."
                    },
                    {
                        "type": "gatha",
                        "text": "ගිහීපි ධඤ්ඤෙන ධනෙන වඩ්ඪති\nපුත්තෙහි දාරෙහි චතුප්පදෙහි ච,\nඅකිඤ්චනො පබ්බජිතො අනුත්තරං\nපප්පොති සම්බොධිමහානධම්මතන්ති.{2}"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අත්ථස්ස මිද්ධි ච - (මඡසං) අද්ධං සමිද්ධං ච (ස්යා)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. පප්පෙංති බොධිං අසහාන ධම්මතන්ති - (මඡසං)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "“හෙ තෙමේ ඒ කර්‍මය කළ බැවින්, රැස් කළ බැවින් … කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට ගියේ ය. හේ එයින් සැව, මේ මිනිසත් බවට ආයේ ම, මේ මහ පුරිස්ලකුණු තුන ලබයි. සිංහයාගේ පෙරඩ කය මෙන් පරිපූර්‍ණ වූ (පූර්වාර්ධ අපරාර්ධ යන) සියලු සිරුර ඇත්තේ වෙයි. මසින් පිරුණු පිටිකර ඇත්තේ වෙයි. සම ව වට වූ කඳ ඇත්තේ වෙයි. හේ ඒ ලකුණුවලින් සමන්විත වූයේ, ඉදින් ගිහිගෙහි වසන්නේ නම්, … සක්විති රජ වෙයි. රජ වනුයේ කුමක් ලබයි ද? නො පිරිහෙන ස්වභාවය ඇත්තේ වෙයි, ධනධාන්‍යයෙන් කෙත්වතුයෙන්, දෙපාසිවුපාවන්ගෙන්, අඹුදරුවන්ගෙන්, දැසි දස් කම්කරු පුරුෂයන්ගෙන් නෑයන්ගෙන්, මිතුරන්ගෙන්, බන්ධූන්ගෙන් නො පිරිහෙයි. සියලු සැපතින් නො පිරිහෙයි. රජ වනුයේ මෙය ලබයි. බුදු වනුයේ කුමක් ලබයි ද? නොපිරිහෙන සැහැවි ඇත්තේ වෙයි. ශ්‍රද්ධායෙන්, ශීලයෙන්, ශ්‍රැතයෙන්, ත්‍යාගයෙන්, ප්‍රඥායෙන් නො පිරිහෙයි. සියලු සැපතින් නො පිරිහෙයි. බුදු වනුයේ මෙය ලබයි.” භාග්‍යවතුන් වහන්සේ මෙ කරුණ වදාළසේක. එහි මෙය (ගාථායෙන්) මෙසේ කියනු ලැබේ:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ශ්‍රද්ධායෙන් ද ශීලයෙන් ද ශ්‍රැතයෙන් ද ප්‍රඥායෙන් ද ත්‍යාගයෙන් ද ධර්‍මයෙන් ද යන බොහෝ සාධු ගුණවලින් ද, ධනයෙන් ද ධාන්‍යයෙන් ද කෙත්වතුයෙන් ද දරුවන්ගෙන් ද භාර්යාවන්ගෙන් ද සිවුපාවුන්ගෙන් ද ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "නෑයන්ගෙන් ද මිත්‍රයන්ගෙන් ද බන්ධූන්ගෙන් ද ශරීරශක්තියෙන් ද වර්‍ණයෙන් සැපයෙන් යන දෙකින් දැ අන්‍යයෝ කෙසේ නම් නො පිරිහෙන්නාහු ද?’යි හේ කැමැති වෙයි. මේ අනුන්ගේ සමෘද්ධිය හේ පතයි."
                    },
                    {
                        "format": 13,
                        "text": "පෙරැ කරන ලද, මොනොවට රැස් කරන ලද ඒ කර්‍ම හේතුයෙන් හෙ තෙමේ සිංහයකුගේ පෙරඩ කය බඳුව පිරිපුන් ව සුපිහිටි, කයැත්තේ විය. සම ව වට වූ, මසින් පිරුණු පිටිකර ඇත්තේ විය. තථාගතයන් වහන්සේ නො පිරිහෙන ඒ කර්‍මය ඒ ලක්ෂණත්‍රයයාගේ ලැබීමට පෙර නිමිති වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමර තෙමේ ඉදින් ගිහි ව සිටී නම්, ධනයෙන් ද ධාන්‍යයෙන් ද දූ පුතුන්ගෙන් ද භාර්යාවන්ගෙන් ද සිවුපාවන්ගෙන් ද වැඩෙයි. ඉදින් කිසි ධන රැස් කිරීමෙක් නැති පැවිද්දෙක් වී නම්, නිරුත්තර වූ නොපිරිහෙන ධර්‍මතා වූ බුදුබවට පැමිණේ’යැ යි ලක්ෂණශාස්ත්‍රඥ බමුණෝ පැවැසූහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 268,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "රසග්ගසග්ගිතාලක්ඛණං (20)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "15. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො සත්තානං අවිහෙඨකජාතිකො අහොසි පාණිනා වා ලෙඩ්ඩුනා වා දණ්ඩෙන වා සත්ථෙන වා. සො තස්ස කම්මස්ස කතත්තා උපචිතත්තා -පෙ- සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉමං මහාපුරිසලක්ඛණං පටිලභති, රසග්ගසග්ගී හොති, උද්ධග්ගාස්ස රසහරණීයො ගීවාය ජාතා හොන්ති සමාභිවාහිනියො.{1} සො තෙන ලක්ඛණෙන සමන්නාගතො සචෙ අගාරං අජ්ඣාවසති රාජා හොති චක්කවත්තී -පෙ- රාජා සමානො කිං ලභති? අප්පාබාධො හොති අප්පාතඞ්කො සමවෙපාකිනියා ගහනියා- සමන්නාගතො නාතිසීතාය නාච්චුණ්හාය. රාජා සමානො ඉදං ලභති. බුද්ධො සමානො කිං ලභති? අප්පාබාධො හොති අප්පාතඞ්කො සමවෙපාකිනියා ගහණියා සමන්නාගතො නාතිසීතාය නාච්චුණ්හාය මජ්ඣිමාය පධානක්ඛමාය. බුද්ධො සමානො ඉදං ලභති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එතමත්ථං භගවා අවොච. තත්ථෙතං වුච්චති:"
                    },
                    {
                        "type": "gatha",
                        "text": "න පාණිදණ්ඩෙහි පනාථ ලෙඩ්ඩුනා\nසත්ථෙන වා මරණවධෙන වා පුන,\nඋබ්බාධනාය පරිතජ්ජනාය වා\nන හෙඨයී ජනතමහෙඨකො අහු."
                    },
                    {
                        "type": "gatha",
                        "text": "තෙනෙව සො සුගතිසු පෙච්ච මොදති\nසුඛප්ඵලං කරිය සුඛානි වින්දති,\nසමොජසා{2} රසහරණී සුසණ්ඨිතා\nඉධාගතො ලභති රසග්ගසග්ගිතං."
                    },
                    {
                        "type": "gatha",
                        "text": "තෙනාහු නං අතිනිපුණා විචක්ඛණා\nඅයං නරො සුඛබහුලො භවිස්සති\nගිහිස්ස වා පබ්බජිතස්ස වා පුන{3} \nතං ලක්ඛණං භවති තදත්ථජොතකන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සමාභිවාහිත්ව යො - (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. සම්පජ්ජසා - (PTS) පා මුඤ්ජසා - (ස්යා) සාමඤ්චසා - (කම්)"
                    },
                    {
                        "type": "footnote",
                        "text": "3. පන - (ස්යං)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 21,
                        "text": "රසග්‍රාසාග්‍රතා ලක්ෂණය (20)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "15. මහණෙනි, තථාගත තෙමේ පෙර දෑහි, පෙර බෙවෙහි, පෙරැ වුසූ තන්හි, පෙරැ මිනිස් වූයේ ම අතින් හෝ කැටින් හෝ දඬුමුගුරෙන් හෝ අවියෙන් හෝ සතුන් නො පෙළන ස්වභාවය ඇත්තේ විය යන යමෙක් ඇද්ද, හේ ඒ කර්‍මය කළ බැවින් රැස් කළ බැවින්, කාබුන් මරණින් මතු මනා ගති ඇති සග ලෝ ගියේ ය. හේ එයින් සැව මේ මිනිස් බවට ආයේ ම, මේ මහපුරිස් ලකුණ ලබයි. අග්‍ර රස එළවන රස නහර ඇත්තේ වෙයි. ඔහුගේ ග්‍රීවායෙහි උඩුකුරු වැ කෙළින් නැඟී සිටි සම ව රසය එළවන රස නහරයෝ හටගත්තාහු වෙත්. හේ ඒ ලකුණින් සමන්විත වූයේ ඉදින් ගිහිගෙහි වසන්නේ නම්, … සක්විති රජ වෙයි. රජ වනුයේ කුමක් ලබයි ද? ඉතා ශීත ද නොවූ, ඉතා උෂ්ණ ද නොවූ, සමවෙපාකිනි වූ කර්‍මජ තේජෝධාතුයෙන් සමන්විත වූයේ, නීරෝග වෙයි, නිදුක් වෙයි. රජ වනුයේ මෙය ලබයි. බුදු වනුයේ කුමක් ලබා ද? යත්: ඉතා ශීත ද නොවූ, ඉතා උෂ්ණ ද නොවූ මධ්‍යම වූ ප්‍රධන් වීර්ය වඩනුවට පොහොසත් වූ. කර්‍මජ තේජෝධාතුයෙන් සමන්විත වූයේ, නීරෝග වෙයි, නිදුක් වෙයි. බුදු වනුයේ මෙය ලබයි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. එහි මෙය ගාථායෙන් මෙසේ කියනු ලැබේ:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘හේ අතින් හෝ දඬු මුගුරින් හෝ නොහොත් කැටින් හෝ අවියෙන් හෝ, තවද සිර ගෙහි ලෑමෙන් හෝ තරවටු කිරීමෙන් හෝ ජනතාව නො පෙළී ය. හේ ජනතාව නොපෙළන්නෙක් විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එ හෙයින් ම පර ලෝ ගොස් සුගතීන්හි සතුටු වෙයි. සැප පල දෙන කර්ම කිරීමෙන් සුව විඳී. මොනොවට රස එළවන්නාවූ රසනහරයෝ තුමූ ම මොනොවට පිහිටියාහු වෙත්. මෙසේ මෙහි (මේ මිනිස්බවට) පැමිණියේ රසග්‍රාසාග්‍රිතාව (අග්‍රරසනහර ඇති බව) ලබයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එ හෙයින් ඉතා සියුම් නුවණැති (නිමිත්තපාඨක) පඬිහු ඔබට ‘මෙ මිනිස් තෙමේ සුව බහුල කොටැති වන්නේ’ ය. නැවැත ද ගිහියකුට හෝ පැවිද්දකුට හෝ ඒ කරුණ හෙළි කරන ඒ ලක්ෂණය වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 270,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "අභිනීලනෙත්ත- ගොපඛුමලක්ඛණානි (21, 22)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "16. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො න ච විසටං න ච විසාචි{1} න ච පන විචෙය්ය පෙක්ඛිතා, උජුං තථා පසටමුජුමනො පියචක්ඛුනා බහුජනං උදික්ඛිතා අහොසි. සො තස්ස කම්මස්ස කතත්තා -පෙ- සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉමානි ද්වෙ මහාපුරිසලක්ඛණානි පටිලභති. අභිනීලනෙත්තො ච හොති ගොපඛුමො ච. සො තෙහි ලක්ඛණෙහි සමන්නාගතො, සචෙ අගාරං අජ්ඣාවසති රාජා හොති චක්කවත්තී -පෙ- රාජා සමානො කිං ලභති? පියදස්සනො හොති, බහුනො ජනස්ස පියො හොති මනාපො බ්රාහ්මණගහපතිකානං නෙගමජානපදානං ගණකානං මහාමත්තානං අනීකට්ඨානං දොවාරිකානං අමච්චානං පාරිසජ්ජානං රාජූනං භොගියානං කුමාරානං. රාජා සමානො ඉදං ලභති -පෙ- බුද්ධො සමානො කිං ලභති? පියදස්සනො හොති, බහුනො ජනස්ස පියො හොති මනාපො භික්ඛූනං භික්ඛුනීනං උපාසකානං උපාසිකානං දෙවානං මනුස්සානං අසුරානං නාගානං ගන්ධබ්බානං. බුද්ධො සමානො ඉදං ලභති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එතමත්ථං භගවා අවොච. තත්ථෙතං වුච්චති:"
                    },
                    {
                        "type": "gatha",
                        "text": "න ච විසටං න ච විසාචී{1} \nන ච පන විචෙය්ය පෙක්ඛිතා\nඋජුං තථා පසටමුජුමනො \nපියචක්ඛුනා බහුජනං උදික්ඛිතා."
                    },
                    {
                        "type": "gatha",
                        "text": "සුගතීසු සො ඵලවිපාකං\nඅනුභවති තත්ථ මොදති.\nඉධ ච පන භවති ගොපඛුමො\nඅභිනීලනෙත්තනයනො සුදස්සනො."
                    },
                    {
                        "type": "gatha",
                        "text": "අභියොගිනො ච නිපුණා\nබහූ පන නිමිත්තකොවිදා\nසුඛුමනයනකුසල මනුජා,\nපියදස්සනො’ති අභිනිද්දිසන්ති නං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. න ච විසාවිතං - (PTS) න ච විසාවි - (ස්යා)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 21,
                        "text": "අභිනීලනේත්‍ර ගොපඛුමතා ලක්ෂණ (21, 22)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "16. “මහණෙනි, තථාගත තෙමේ පළමු දෑහි, පළමු බෙවෙහි, පළමු වුසූ තන්හි පෙරැ මිනිස් වූයේ ම, කෝපයෙන් ඇස් ඔරවා බලන්නේ නො වී ය, (ක්‍රෝධපර වැ) හිස ඇළ කොට ඇස් කොනින් බලන්නේ ද නො වී ය. ක්‍රෝධපර ව අනුන් දෙස රහසින් රවා බලන්නේ ද නො වී ය. ඍජු ව ද ඇස් පුරා ද ඍජු සිත් ඇත්තේ සිය ඇසින් බොහෝ දෙනා දෙස බලන්නේ විය යන යමෙක් ඇද්ද, හේ ඒ කර්මය කළ බැවින් කා බුන් මරණින් මතු මනා ගති ඇති සග ලොවට ගියේ ය. හේ එයින් සැව මේ මිනිස් බවට ආයේ ම, මේ මහපුරිස්ලකුණු දෙක ලබයි. වෙසෙසින් නිල්වන් වූ ඇස් ඇත්තේ වෙයි, එකෙණෙහි උපන් රතු වස්සකුගේ ඇස් පියුම් (ඇස්ගුළිය) බඳු ඇස් පියුම් ඇත්තේ වෙයි. මේ ලක්ෂණවලින් සමන්විත වූයේ, ඉදින් ගිහිගෙහි වසන්නේ නම්, … සක්විති රජ වෙයි. රජ වන්නේ කුමක් ලබයි ද? ප්‍රිය වූ දැකුම් ඇත්තේ වෙයි. බමුණනට, ගැහැවියනට, නිගම්වැසියනට දනවුවැසියනට, ගණකයනට, මහාමාත්‍රයනට, සෙනාඞ්ගරක්ෂකයනට, ද්වාරපාලයනට, පරම්පරාගත වැ රාජපර්ෂද්හි වූවනට, රජුනට, රාජදෙය භෝග සම්පත් විඳුනවුනට රජකුමරුවනට, යන බොහෝ දෙනාට ප්‍රිය මනාප වෙයි. රජ වනුයේ මෙය ලබයි … බුදු වනුයේ කුමක් ලබයි ද? ප්‍රිය දැකුම් ඇත්තේ වෙයි. බොහෝ දෙනාට ප්‍රිය වෙයි, මනවඩන්නේ වෙයි. මහණුනට මෙහෙණනට උවසුවනට උවැසියනට දෙවියනට මිනිස්නට අසුරයනට නාගයනට ගඳෙව්වනට ප්‍රිය වෙයි, මනාප වෙයි. බුදු වනුයේ මෙය ලබයි.” ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙ කරුණ වදාළ සේක. එහි මෙය (ගාථායෙන්) කියනු ලැබේ:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘ක්‍රෝධයෙන් ඇස් ඔරවා ද නො බලන්නේ විය. කෝපයෙන් හිස ඇළ කොට ඇස් කොනින් බලන්නේ ද නො වී ය. රහසින් අනුන් දෙස රවා බලන්නේ ද නො වී ය. ඍජු ලෙස, ඇසපුරා, ඍජු සිතැති ව, ප්‍රිය ඇසින් බොහෝ දෙනා දෙස බලන්නේ විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හේ එහි ඵලවිපාකය සුගතීන්හි විඳීයි. එයින් එහි සතුටු වෙයි, නැවැත මෙහි උපදනේ ද, එ කෙණෙහි උපන් වස්සකුගේ බඳු ඇසිපියුම් ඇත්තේ, වෙසෙසින් නිල් වූ ඇස් ඇත්තේ, ශෝභන දැකුම් ඇත්තේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ලක්ෂණශාස්ත්‍ර හැදෑරීමෙහි යෙදුණු සියුම් නුවණැති, නිමිති සතර දන්නා, සියුම් නේත්‍රවිද්‍යායෙහි දක්ෂ වූ බමුණෝ ‘ප්‍රිය දර්ශන ඇත්තේ යැ’යි ඔහු වෙසෙසින් දක්වත්.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 272,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "පියදස්සනො ගිහී පි සන්තො ච\nභවති බහුජනපියායිතො,\nයදි ච න භවති ගිහී සමණො හොති\nපියො බහූනං සොකනාසනො’ති."
                    },
                    {
                        "type": "centered",
                        "text": "උණ්හීසසීසලක්ඛණ (23)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "17. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො බහුජනපුබ්බඞ්ගමො අහොසි කුසලෙසු ධම්මෙසු බහුජනානං පාමොක්ඛො කායසුචරිතෙ වචීසුචරිතෙ මනොසුචරිතෙ දානසංවිභාගෙ සීලසමාදානෙ උපොසථුපවාසෙ මත්තෙය්යතාය පෙත්තෙය්යතාය සාමඤ්ඤතාය බ්රහ්මඤ්ඤතාය කුලෙ ජෙට්ඨාපචායිතාය අඤ්ඤතරඤ්ඤතරෙසු ච අධිකුසලෙසු ධම්මෙසු. සො තස්ස කම්මස්ස කතත්තා -පෙ- සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉමං මහාපුරිසලක්ඛණං පටිලභති, උණ්හීසසීසො හොති. සො තෙන ලක්ඛණෙන සමන්නාගතො සචෙ අගාරං අජ්ඣාවසති රාජා හොති චක්කවත්තී -පෙ- රාජා සමානො කිං ලභති? මහා’ස්ස ජනො අන්වායිකො හොති, බ්රාහ්මණගහපතිකා නෙගමජානපදා ගණකා මහාමත්තා අනීකට්ඨා දොවාරිකා අමච්චා පාරිසජ්ජා රාජානො භොගියා කුමාරා. රාජා සමානො ඉදං ලභති. -පෙ- බුද්ධො සමානො කිං ලභති? මහාස්ස ජනො අන්වායිකො හොති භික්ඛූ භික්ඛුනියො උපාසකා උපාසිකායො දෙවා මනුස්සා අසුරා නාගා ගන්ධබ්බා. බුද්ධො සමානො ඉදං ලභති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එතමත්ථං භගවා අවොච. තත්ථෙතං වුච්චති:"
                    },
                    {
                        "type": "gatha",
                        "text": "පුබ්බඞ්ගමො සුචරිතෙසු අහු\nධම්මෙසු ධම්මචරියාය{1} අභිරතො,\nඅන්වායිකො බහුජනස්ස අහු\nසග්ගෙසු වෙදයිත්ථ පුඤ්ඤඵලං."
                    },
                    {
                        "type": "gatha",
                        "text": "වෙදියිත්වා සො සුචරිතස්ස ඵලං\nඋණ්හීස සීසත්තමිධජ්ඣගමා\nබ්යාකංසු බ්යඤ්ජනනිමිත්තධරා\nපුබ්බඞ්ගමො බහුජනස්ස{2} හෙස්සති."
                    },
                    {
                        "type": "gatha",
                        "text": "පටිභොගියා මනුජෙසු ඉධ\nපුබ්බෙව තස්ස අභිහරන්ති තදා\nයදිඛත්තියො භවති භූමිපති\nපටිහාරකබහුජනෙ{3} ලභති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ධම්මචරියාභිරතො - (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. පුබ්බඞ්ගමො බහුජනං - (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "3. පටහාරකං බහුජනො - (මඡසං)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ගිහි වන්නේ ද ප්‍රිය දැකුම් ඇත්තේ, බොහෝ ජනයා විසින් ප්‍රිය කරන ලද්දේ වෙයි. ඉදින් ගිහි නොවන්නේ නම්, බොහෝ දෙනාට ප්‍රිය වූ, ජනයාගේ ශෝක නසන ශ්‍රමණයෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "ඌෂ්ණීෂශීර්ෂලක්ෂණය (23)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "17. “මහණෙනි, ‘පළමු දෑහි, පළමු බෙවෙහි, පළමු වුසූ තන්හි, පෙරැ මිනිස් වූයේ ම කුසල් දහම් හි බොහෝ දෙනාට ගණදෙටු විය, කායසුචරිතයෙහි ද වාක්සුචරිතයෙහි ද මනස්සුචරිතයෙහි ද දන් දීමෙහි ද ශීල සමාදානයෙහි ද පෙහෙවස් වුසුම්හි ද මවට උවටන්හි ද පියාට උවටන්හි ද මහණුන් පිදීමෙහි ද බමුණන් පිදීමෙහි ද කුලදෙටුවන් පිදීමෙහි ද තව තවත් අධිකුශලධර්මයන්හි ද බොහෝ දෙනාට ප්‍රමුඛ විය’ යන යමෙක් ඇද් ද, හේ, ඒ කර්ම කළ හෙයින් … කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට යෙයි. හේ එයින් සැව මේ මිනිසත් බවට ආයේ ම මේ මහ පුරිස් ලකුණ ලබයි. හේ නලල්පට බන් සෙයින් පිරිපුන් නලල ද පිරිපුන් හිස ද ඇත්තේ වෙයි. හේ ඒ ලක්ෂණයෙන් යුක්ත වූයේ, ඉදින් ගිහිගෙයි වසන්නේ නම් … සක්විති රජ වෙයි. රජ වනුයේ කුමක් ලබයි ද? මහා ජන තෙමේ ඔහු අනුව යන්නේ වෙයි. බමුණුගැහැවියෝ ද නියම්ගම් දනවු වැසියෝ ද ගණකයෝ ද මහාමාත්‍රයෝ ද සෙනාඞ්ගරක්ෂකයෝ ද ද්වාරපාලයෝ ද ඇමැතියෝ ද පරම්පරාගත ව රජපර්ෂත්හි වූවෝ ද, රජුහු ද, රාජ දත්ත භෝග ලැබ පරිභෝග කරන්නෝ ද, රජකුමරුවෝ ද ඔහු අනුව යන්නෝ වෙත්. රජ වනුයේ මෙය ලබයි. … බුදු වනුයේ කුමක් ලබා ද? මහණ, මෙහෙණ උවසු උවැසි දෙවි මිනිස් අසුර නාග ගන්ධර්ව යන මහා ජනයා ඔහු අනුව යන්නේ වෙයි. බුදු වනුයේ මෙය ලබයි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙ කරුණ වදාළ සේක. එහි මෙය මෙසේ ගාථායෙන් කියනු ලැබේ:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හේ සුචරිත ධර්මයන්හි පුරෝගාමී විය, ධර්මචර්යායෙහි ඇලුණේ විය. එහි බොහෝ දෙනා ඔහු අනුව යන්නේ විය. එහි පින්පල සගලොව්හි දී වින්දේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හේ සුචරිතයේ ඵලය විඳ, මෙහි උෂ්ණීශීර්ෂ බව ලැබී ය. ලක්ෂණ ශාස්ත්‍රධරයෝ ‘මෙ තෙමේ බොහෝ දෙනාට පුරෝගාමී වන්නේ යැ’යි පැවැසූහ,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මෙහි මිනිසුන් අතුරෙහි වතාවත් කරුවෝ ඒ කල්හි පළමු ළදරු වියෙහි ම ඔහුට කුදුමහත් වතාවත් එළවත්. ඉදින් පොළොවට අධිපති රජෙක් වී නම්, හේ වතාවත් කරන බොහෝ ජනයන් ලබයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 274,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "අථ චෙපි පබ්බජති සො මනුජො\nධම්මෙසු හොති පගුණො විසාවී.\nතස්සානුසාසනිගුණාභිරතො\nඅන්වායිකො බහුජනො භවතී’ති."
                    },
                    {
                        "type": "centered",
                        "text": "එකෙකලොමතාඋණ්ණාලක්ඛණානි. (24, 25)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "18. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො මුසාවාදං පහාය මුසාවාදා පටිවිරතො අහොසි, සච්චවාදී සච්චසන්ධො ථෙතො පච්චයිකො අවිසංවාදකො ලොකස්ස, සො තස්ස කම්මස්ස කතත්තා උපචිතත්තා -පෙ- සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉමානි ද්වෙ මහාපුරිසලක්ඛණානි පටිලභති: එකෙකලොමො ච හොති, උණ්ණා ච භමුකන්තරෙ ජාතා හොති ඔදාතා මුදුතූලසන්නිභා. සො තෙහි ලක්ඛණෙහි සමන්නාගතො සචෙ අගාරං අජ්ඣාවසති රාජා හොති චක්කවත්තී. රාජා සමානො කිං ලභති? මහා’ස්ස ජනො උපවත්තති බ්රාහ්මණගහපතිකා නෙගමජානපදා ගණකා මහාමත්තා අනීකට්ඨා දොවාරිකා අමච්චා පාරිසජ්ජා රාජානො භොගියා කුමාරා. රාජා සමානො ඉදං ලභති -පෙ- බුද්ධො සමානො කිං ලභති? මහා’ස්ස ජනො උපවත්තති භික්ඛූ භික්ඛුනියො උපාසකා උපාසිකායො දෙවා මනුස්සා අසුරා නාගා ගන්ධබ්බා. බුද්ධො සමානො ඉදං ලභති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එතමත්ථං භගවා අවොච. තත්ථෙතං වුච්චති:"
                    },
                    {
                        "type": "gatha",
                        "text": "සච්චප්පටිඤ්ඤො පුරිමාසු ජාතිසු\nඅද්වෙජ්ඣවාචො අලිකං අවජ්ජයි\nන සො විසංවාදයිතා පි කස්සචි\nභූතෙන තච්ඡෙන තථෙන භාසයි.{1}"
                    },
                    {
                        "type": "gatha",
                        "text": "සෙතා සුසුක්කා මුදුතූලසන්නිභා\nඋණ්ණාසුජාතා{2} භමුකන්තරෙ අහු\nන ලොමකූපෙසු දුවෙ අජායිසුං\nඑකෙකලොමූපචිතඞ්ගවා අහු."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. තොසයි - (PTS)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. උණ්ණසුජාතා - (මඡසං)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ඉදින් ඒ මිනිස් තෙමේ පැවිදි වන්නේ නම්, ධර්මයන්හි (ධ්‍යාන සමාපත්ති ධර්මයන්හි) පුහුණු වූ, පුරුදු කළ වශිතා ඇතියෙක් වෙයි. ඔහුගේ අනුශාසන ගුණයෙහි ඇලුණු බොහෝ ජනයා ඔහු අනුව යන්නේ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "එකෛකලෝමතා - ඌර්ණාලක්ෂණාදීහු (24, 25)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "18. “මහණෙනි, ‘තථාගත තෙමේ පළමු දෑහි, පළමු බෙවෙහි, පළමු වුසූ තන්හි, පෙරැ මිනිස් වූයේ ම මුසවා හැරැ මුසවායින් වැළැක්කේ, ඇත්ත කියන සුලු වූයේ, ඇත්තෙන් ඇත්ත ගළපනුයේ, තහවුරු බස් ඇත්තේ, හැදැහිය යුතු බස් ඇත්තේ, ලොව නො රවටනුයේ වීය’ යන යමෙක් ඇද්ද, හේ ඒ කර්මය කළ බැවින්, ඒ කර්මය රැස් කළ බැවින් … කා බුන් මරණින් මතු මනා ගති ඇති සග ලොවට පැමිණෙයි. හේ එයින් සැව මේ මිනිස් බවට ආයේ ම මේ මහ පුරිස්ලකුණු දෙක ලබයි: එක් එක් ලෝම කූපයෙහි එක් එක් ලෝමයක් ඇත්තේ ද වෙයි, දෙ බැම අතුරෙහි සුදු පැහැති මොළොක් පුලුන් රොදක් බඳු වූ ඌර්ණරෝමයෙක් ද හටගත්තේ වෙයි. හේ ඒ ලක්ෂණයන්ගෙන් සමන්විත වූයේ, ඉදින් ගිහි ගෙහි වසන්නේ නම් … සක්විති රජ වෙයි. රජ වනුයේ කුමක් ලබන්නේ ද? බමුණෝ ය, ගැහැවියෝ ය, නිගම්වැස්සෝ ය, දනවුවැස්සෝ ය, ගණකයෝ ය, මහාමාත්‍රයෝ ය, සෙනාඞ්ගරක්ෂකයෝ ය, ද්වාරපාලයෝ ය, අමාත්‍යයෝ ය, පරම්පරාගත වැ රාජපර්ෂත්හි වූවෝ ය, රජුහු ය, රාජදත්ත භෝග ඇත්තෝ ය, රජකුමරුවෝ ය යන මහා ජනයෝ ඔහු අදහස අනුවැ පවත්නාහ. රජ වනුයේ මෙය ලබයි … බුදු වනුයේ කුමක් ලබා ද? භික්ෂු භික්ෂුණී උපාසක උපාසිකා දිව්‍ය මනුෂ්‍ය අසුර නාග ගන්ධර්ව යන මහා ජනයා ඔබ අදහස අනුව පවතී. බුදු වනුයේ මෙය ලබයි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙ කරුණ වදාළ සේක. එහි මෙය ගාථායෙන් කියනු ලැබේ:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“පෙර දෑහි සත්‍ය ප්‍රතිඥා ඇත්තේ, දෙසැටියෙකින් නො පැවැති ඒකාන්ත වචන ඇත්තේ, මුසා බස් දුරැලී ය. හේ කිසිවකුත් නො රවටන්නේ විය, සත්‍ය වූ තථ්‍ය වූ තත්ත්වාකාර වූ වචනයෙන් කථා කෙළේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(එයින්) සුදු පැහැති, ඉතා සුදු වූ, මොළොක් පුලුන් බඳු වූ උර්ණාවෙක් දෙබැම අතුරෙහි මැනැවින් හට ගත්තේ විය. ලෝමකූපයන්හි එකෙක දෙකෙක් නො වී ය. එකි එකී ලොම්කුයෙහි එක් එක් ලෝමයක් ම හට ගත් සිරුර ඇත්තේ වී ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 276,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තං ලක්ඛණඤ්ඤූ බහවො සමාගතා\nබ්යාකංසු උප්පාදනිමිත්තකොවිදා.\nඋණ්ණා ච ලොමා ච යථා සුසණ්ඨිතා\nඋපවත්තතී ඊදිසකං බහුජ්ජනො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ගිහිම්පි සන්තං උපවත්තතී ජනො\nබහු පුරත්ථා පකතෙන කම්මුනා\nඅකිඤ්චනං පබ්බජිතං අනුත්තරං\nබුද්ධම්පි සන්තං උපවත්තති ජනො’ති."
                    },
                    {
                        "type": "centered",
                        "text": "චත්තාළීසදන්ත - අවිරලදන්ත - ලක්ඛණාදීනි (26, 27)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "19. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො පිසුණං වාචං පහාය පිසුණාය වාචාය පටිවිරතො අහොසි. ඉතො සුත්වා න අමුත්ර අක්ඛාතා ඉමෙසම්භෙදාය, අමුත්ර වා සුත්වා න ඉමෙසං අක්ඛාතා අමූසම්භෙදාය. ඉති භින්නානං වා සන්ධාතා සංහිතානං වා අනුප්පදාතා සමග්ගාරාමො සමග්ගරතො සමග්ගනන්දි සමග්ගකරණිං වාචං භාසිතා අහොසි, සො තස්ස කම්මස්ස කතත්තා -පෙ- සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉමානි ද්වෙ මහාපුරිසලක්ඛණානි පටිලභති: චත්තාළීසදන්තො ච හොති අවිරළදන්තො ච. සො තෙහි ලක්ඛණෙහි සමන්නාගතො සචෙ අගාරං අජ්ඣාවසති රාජා හොති චක්කවත්තී -පෙ- රාජා සමානො කිං ලභති? අභෙජ්ජපරිසො හොති අභෙජ්ජා’ස්ස හොන්ති පරිසා බ්රාහ්මණගහපතිකා නෙගමජානපදා ගණකා මහාමත්තා අණීකට්ඨා දොවාරිකා අමච්චා පාරිසජ්ජා රාජානො භොගියා කුමාරා. රාජා සමානො ඉදං ලභති? -පෙ- බුද්ධො සමානො කිං ලභති? අභෙජ්ජපරිසො හොති අභෙජ්ජා’ස්ස හොන්ති පරිසා භික්ඛූ භික්ඛුනියො උපාසකා උපාසිකායො දෙවා මනුස්සා අසුරා නාගා ගන්ධබ්බා. බුද්ධො සමානො ඉදං ලභති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එතමත්ථං භගවා අවොච. තත්ථෙතං වුච්චති:"
                    },
                    {
                        "type": "gatha",
                        "text": "වෙභූතියං සංහිතභෙදකාරිං\nභෙදප්පවඩ්ඪනවිවාදකාරිං\nකලහප්පවඩ්ඪනඅකිච්චකාරිං,\nසහිතානං භෙදජනනිං න භණි."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "උත්පාදශාස්ත්‍ර නිමිත්තශාස්ත්‍රයන්හි දක්ෂ වූ ශරීරලක්ෂණ දන්නා බොහෝ දෙනෙක් රැස්වූවාහු, “මොහු සිරුරැ ඌර්ණාව ද ලෝමයෝ ද යම්සේ මොනොවට පිහිටියාහු ද, එහෙයින් බොහෝ දෙනා මෙබන්දහු අදහස් අනුව පවතී යැ”යි එය පැවැසූහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පූර්ව ජාතීන්හි කරන ලද කර්ම හේතුයෙන් බහු ජන තෙමේ ගිහි වැ ඉන්නා වූ ද කුමරු අනුව යෙයි. බොහෝ දෙනා කිසි ධන රැස් කිරීමක් නැති, පැවිදි වැ බුදු වූ ම ඔබ අනුව යෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "චත්වාරිංශත්දන්ත - අවිරලදන්තතාදි - ලක්ෂණ (26, 27)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "19. මහණෙනි, “තථාගත තෙමේ පළමු දෑහි, පළමු බෙවෙහි, පළමු වුසූ තන්හි, පෙරැ මිනිස් වූයේ ම කේලාම් බස් හැර, කේලාම් බසින් වැළැක්කේ විය, මෙතැනින් අසා, මොවුන්ගේ බිඳීම පිණිස පිණිස එ තැන්හි නො කියන්නේ විය, එ තැන්හි හෝ අසා, ඔවුන්ගේ බිඳීම පිණිස, මොවුනට නො කියන්නේ විය, මෙසේ බිඳුණුවන් ගළපන්නේ ද, ගැළපුණවුනට අනුබල දෙන්නේ ද විය, සමගියෙන් සිටිනවුනට කැමැත්තේ, සමගියෙන් සිටිනවුන් කෙරෙහි ඇලුණේ, සමගියෙන් සිටිනවුනට සතුටු වූයේ, සමගිය ඇති කරන බස් කියන්නේ විය” යන යමෙක් ඇද්ද, හේ ඒ කර්මය කළ බැවින් … සග ලොවට ගියේය. හේ එයින් ච්‍යුත වූයේ මෙ මිනිස්බවට ආයේ ය, මේ මහපුරිස් ලකුණු දෙක ලබයි: දත් සාළිසක් ඇත්තේ, විරළ නොවූ දත් ඇත්තේ ද වෙයි. හේ ඒ ලක්ෂණයන්ගෙන් සමන්විත වූයේ, ඉදින් ගිහි ගෙහි වසන්නේ නම් … සක්විති රජ වෙයි. රජ වනුයේ කුමක් ලබයි ද? නො බිඳියැ හැකි පිරිස් ඇත්තේ වෙයි, බ්‍රාහ්මණ ගෘහපති නිගමවාසී ජනපදවාසී ගණක මහාමාත්‍ර සෙනාඞ්ගරක්ෂක ද්වාරපාල අමාත්‍ය පාරිෂද්‍ය රාජ කුමාර යන ඔහුගේ පිරිස්හු නොබිඳියැ හැක්කාහු වෙත්. රජ වනුයේ මෙය ලබයි. බුදු වනුයේ කුමක් ලබා ද? නොබිඳියැ හැකි පිරිස් ඇත්තේ වෙයි. භික්ෂු භික්ෂුණී උපාසක උපාසිකා දිව්‍ය මනුෂ්‍ය අසුර නාග ගන්ධර්ව යන ඔබ පිරිස්හු නොබිඳියැ හැක්කාහු වෙත්. බුදු වනුයේ මෙය ලබයි”.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. එහි මෙය (ගාථායෙන්) කියනු ලැබේ:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘හේ පෙර අත්බව්හි ගැළපුණවුන් (සමගියෙන් සිටිනවුන් බිඳුවන්නේ හෝ භේදවැඩෙන විවාද පහළ කරන්නේ හෝ කලහ වැඩෙන නොකටයුතු කරන්නේ හෝ නො වීය. ගැළපුණුවුන්ගේ භේද උපදවන වචන ද නො කීයේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 278,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "අවිවාදවඩ්ඪනකාරිං සුගිරං\nභින්නානං සන්ධිජනනිං අභණි.\nකලහං ජනස්ස පනුදී සමඞ්ගී\nසංහිතෙහි නන්දති පමොදති ච"
                    },
                    {
                        "type": "gatha",
                        "text": "සුගතීසු සො ඵලවිපාකං\nඅනුභවති තත්ථ මොදති.\nදන්තා ඉධ හොන්ති අවිරළා සහිතා\nචතුරො දසස්ස මුඛජා සුසණ්ඨිතා."
                    },
                    {
                        "type": "gatha",
                        "text": "යදි ඛත්තියො භවති භූමිපති\nඅවිභෙදියා’ස්ස පරිසා භවන්ති\nසමණො ච හොති විරජො වීතමලො\nපරිසා’ස්ස හොති අනුගතා අචලා’ති."
                    },
                    {
                        "type": "centered",
                        "text": "පහූතජිව්හා - බ්රහ්මස්සර ලක්ඛණානි (28, 29)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "20. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො ඵරුසං වාචං පහාය ඵරුසාය වාචාය පටිවිරතො අහොසි. යා සා වාචා නෙලා කණ්ණසුඛා පෙමනීයා හදයඞ්ගමා පොරී බහුජනකන්තා බහුජනමනාපා, තථාරූපිං වාචං භාසිතා අහොසි. සො තස්ස කම්මස්ස කතත්තා උපචිතත්තා -පෙ- සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉමානි ද්වෙ මහාපුරිසලක්ඛණානි පටිලභති. පහූත ජිව්හො ච හොති බ්රහ්මස්සරො ච කරවීකභාණී. සො තෙහි ලක්ඛණෙහි සමන්නාගතො සචෙ අගාරං අජ්ඣාවසති රාජා හොති චක්කවත්තී -පෙ- රාජා සමානො කිං ලභති? ආදෙය්යවාචො හොති, ආදියන්ති’ස්ස වචනං බ්රාහ්මණගහපතිකා නෙගමජානපදා ගණකා මහාමත්තා අකනිට්ඨා දොවාරිකා අමච්චා පාරිසජ්ජා රාජානො භොගියා කුමාරා. රාජා සමානො ඉදං ලභති -පෙ- බුද්ධො සමානො කිං ලභති? ආදෙය්යවාචො හොති, ආදියන්ති’ස්ස වචනං භික්ඛූ භික්ඛුනියො උපාසකා උපාසිකායො දෙවා මනුස්සා අසුරා නාගා ගන්ධබ්බා. බුද්ධො සමානො ඉදං ලභති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එතමත්ථං භගවා අවොච. තත්ථෙතං වුච්චති:"
                    },
                    {
                        "type": "gatha",
                        "text": "අක්කොසභණ්ඩනවිහෙසකාරිං\nඋබ්බාධකං{1} බහුජනමද්දනං\nබාළ්හං ගිරං සො න භණි ඵරුසං\nමධුරං භණි සුසඤ්හිතං සඛිලං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උබ්බාධකරං - (මඡසං)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "විවාද වැඩීම කරන සුලු නොවූ, බිඳුණවුනට සමගිය උපදවන සුලු වචන කීයේ ය. සමඞ්ගී … ජනයාගේ කලහ දුරු කෙළේ ය. සමගියෙහි පිහිටියවුන් හා සතුටු වෙයි, ප්‍රමුදිත ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "සුගතීන්හි ඵලවිපාක විඳියි, එහි සතුටු වෙයි. මෙහි උපන් ඔහුගේ දත් අවිරළ වේ, එකට සම්බන්ධ වෙයි. ඔහුගේ දන්තයෝ සතළිසෙක් මොනොවට පිහිටියාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉදින් පොළොවට ස්වාමී වූ ක්ෂත්‍රියයෙක් වී නම්, ඔහුගේ පිරිස්හු නො බිඳැලිය හැකි වෙත්. ඉදින් මහණ වන්නේ නම්, පහ වූ කෙලෙස් ධූලි ඇතියේ, පහ වූ කෙලෙස්මල ඇතියේ වෙයි. ඔබ පිරිස ඔබ අනුව ගියේ ස්ථිර වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "ප්‍රහූතජිහ්වතා - බ්‍රහ්මස්වරතා - ලක්ෂණ (28, 29)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "20. මහණෙනි, “පළමු දෑහි පළමු භවයෙහි, පළමු වුසූ තන්හි, පෙරැ මනුෂ්‍ය වනුයේ පරොස් බස් හැර, පරොස් බසින් වැළැක්කේ විය. නිදොස් වූ, කනට සැප වූ, පෙම් කටයුතු වූ, සිතැ වැදැ ගන්නා, නියැරියනට සුදුසු වූ, බොහෝ දෙනාට කාන්ත වූ, බොහෝ දෙනාගේ මන වඩන්නා වූ යම් වචනයෙක් වේ ද, එබඳු වචන කියන්නේ වී ය යන යමෙක් ඇද්ද, හේ ඒ කර්මය කළ බැවින් රැස් කළ බැවින් … සග ලොවට ගියේ ය. හේ එයින් සැව, මේ මිනිස්බවට ආයේ ම මේ මහපුරිස් ලකුණු දෙක ලබයි: දික් පුලුල් වූ දිව ඇත්තේ වෙයි, බඹහුගේ බඳු ගැඹුරු හඬ ඇත්තේ, කුරවි කොවුලකුගේ බඳු මිහිරි හඬ ඇත්තේ වෙයි. හේ ඒ ලක්ෂණයන්ගෙන් සමන්විත වූයේ, ඉදින් ගිහිගෙහි වසන්නේ ද, … සක්විති රජ වෙයි. රජ වනුයේ කුමක් ලබා ද? පිළිගත යුතු වචන ඇත්තේ වෙයි, බමුණෝ ද ගැහැවියෝ ද නිගම්වැසි දනවුවැසි ජනයෝ ද ගණකයෝ ද මහාමාත්‍රයෝ ද සේනාඞ්ග රක්ෂකයෝ ද ද්වාරපාලයෝ ද ඇමැතියෝ ද පරම්පරාගත ව රාජපර්ෂද්හි වූවෝ ද රජුහු ද රජහු දුන් භෝගසම්පත් බුත්ති විඳින්නෝ ද රජකුමරුවෝ ද යන ඔහුගේ පිරිස්හු ඔහු බස් පිළිගනිත්: රජ වනුයේ මෙය ලබයි … බුදු වනුයේ කුමක් ලබා ද? පිළිගත යුතු වචන ඇත්තේ වෙයි. මහණ මෙහෙණෝ ද උවසුඋවැසියෝ ද දෙව්හු ද මිනිස්සු ද අසුරයෝ ද නාගයෝ ද ගඳෙවුහු ද ඔබ වචන පිළිගනිත්. බුදු වනුයේ මෙය ලබයි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙ කරුණ වදාළ සේක. එහි මේ (ගාථායෙන්) කියනු ලැබේ:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“හෙ තෙමේ ආක්‍රෝශ කලහ හිංසා යන මේ දෑ කරවන, සිත පෙළන, මහජනයාගේ සිත් රිදුවන. කැකුළු වූ පරොස් බස් නො බිණුයේ ය. ඉතා ප්‍රේම සහිත වූ මෘදු වූ මිහිරි බස් බිණූයේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 280,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "මනසො පියා හදයගාමිනියො\nවාචා සො එරයති කණ්ණසුඛා\nවාචා සුචිණ්ණඵලමනුභවි\nසග්ගෙසු වෙදය පුඤ්ඤඵලං."
                    },
                    {
                        "type": "gatha",
                        "text": "වෙදිත්වා සො සුචරිතස්ස ඵලං\nබ්රහ්මස්සරත්තමිධජ්ඣගමා.\nජිව්හා’ස්ස හොති විපුලා පුථුලා\nආදෙය්යවාක්යවචනො භවති."
                    },
                    {
                        "type": "gatha",
                        "text": "ගිහිනො’පි ඉජ්ඣති යථා භණතො\nඅථ චෙ පබ්බජති සො මනුජො\nආදියන්ති’ස්ස වචනං ජනතා\nබහුනො බහුං සුභණිතං{1} භණතො’ති."
                    },
                    {
                        "type": "centered",
                        "text": "සීහහනුලක්ඛණං (30)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "21. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො සම්ඵප්පලාපං පහාය සම්ඵප්පලාපා පටිවිරතො අහොසි, කාලවාදී භූතවාදී අත්ථවාදී ධම්මවාදී විනයවාදී නිධානවතිං වාචං භාසිතා කාලෙන සාපදෙසං පරියන්තවතිං අත්ථසංහිතං. සො තස්ස කම්මස්ස කතත්තා -පෙ- සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉමං මහාපුරිසලක්ඛණං පටිලභති, සීහහනු හොති. සො තෙන ලක්ඛණෙන සමන්නාගතො සචෙඅගාරං අජ්ඣාවසති රාජා හොති චක්කවත්තී -පෙ- රාජා සමානො කිං ලභති? අප්පධංසියො හොති කෙනචි මනුස්සභූතෙන පච්චත්ථිකෙන පච්චාමිත්තෙන. රාජා සමානො ඉදං ලභති -පෙ- බුද්ධො සමානො කිං ලභති? අප්පධංසියො හොති අබ්භන්තරෙහි වා බාහිරෙහි වා පච්චත්ථිකෙහි පච්චාමිත්තෙහි රාගෙන වා දොසෙන වා මොහෙන වා සමණෙන වා බ්රාහ්මණෙන වා දෙවෙන වා මාරෙන වා බ්රහ්මුනා වා කෙනචි වා ලොකස්මිං. බුද්ධො සමානො ඉදං ලභති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එතමත්ථං භගවා අවොච. තත්ථෙතං වුච්චති:"
                    },
                    {
                        "type": "gatha",
                        "text": "සම්ඵප්පලාපං න අබුද්ධතන්තිං{2} \nඅවිකිණ්ණවචනබ්යප්පථො අහොසි.\nඅහිතමපි ච අපනුදි\nහිතමපි ච බහුජනසුඛඤ්ච අභණි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සුසහිතං - (ස්යා)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. න සම්ඵප්පලාපං න මුද්ධතං - (මඡසං)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "හේ සිතට ප්‍රිය වූ, සිතැ වැදැගන්නාවූ, කනට සැප වූ, වචන කියයි. වාක්සුචරිතයාගේ ඵලය හේ වින්දේ ය. ස්වර්ගයන්හි (වාක්සුචරිතමය) පිනේ පල වින්දේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හේ සුචරිතයේ විපාක ලැබීමෙන් මෙහි දී, බ්‍රහ්මස්වර බව ලැබී ය. ඔහුගේ දිව දික් ද පුලුල් ද වෙයි. හේ පිළිගත යුතු වචන ඇත්තේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "යම්සේ කියන ගෘහස්ථයාගේ ද වචනය සිදු වන්නේ ද ඉදින් ඒ මිනිස් තෙමේ පැවිදි වන්නේ නම් බොහෝ ජනයාට බොහෝ වූ මනාප වචන කියන ඔබගේ වචන ජනතාවෝ පිළිගනිත් යැ යි නෛමිත්තකයෝ කීහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "සිංහහනු - ලක්ෂණය (30)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "21. මහණෙනි, “තථාගත තෙමේ පළමු දෑහි, පළමු භවයෙහි, පළමු වුසූ තන්හි, පෙරැ මිනිස් වූයේ ම සම්ඵප්‍රලාපය හැර, සම්ඵප්‍රලාපයෙන් වැළැක්කේ, කල් දැන කියනුයේ, සත්‍යය ම කියනුයේ, වැඩ සලසන බසක් ම කියනුයේ, කුසල් දහම් අසළ බසක් ම කියනුයේ, විනය අසළ බසක් ම කියනුයේ විය, සිතැ තබා ගන්නට නිසි වූ, කරුණු සහිත වූ, සසීම වූ අර්ථනිඃශ්‍රිත වූ වචන සුදුසු කල්හි කියන්නේ වී ය” යන යමෙක් ඇද්ද, හෙ තෙමේ ඒ කර්මය කළ බැවින් … සග ලොවට පැමිණියේ ය. එයින් සැව මෙ මිනිස් බවට ආයේ ම මේ මහපුරිස්ලකුණ ලබයි: හේ සිංහයකුගේ යැටි හනුව සේ පිරුණු උඩු යැටි දෙහනු ඇත්තේ වෙයි. ඒ ලක්ෂණයෙන් සමන්විත වූ හෙ තෙමේ ඉදින් ගිහි ගෙහි වසන්නේ නම්, … සක්විති රජ වෙයි. රජ වනුයේ කුමක් ලබා ද? මිනිස් වූ කිසි දු සතුරෙකු විසින්, පසමිතුරකු විසින්, නෙරැපියැ නො හැක්කේ වෙයි. රජ වනුයේ මෙය ලබයි … බුදු වනුයේ කුමක් ලබා ද? අන් සත්නට උපදනා පරිදි රාගය විසින් හෝ ද්වේෂය විසින් හෝ මෝහය විසින් හෝ මෙසේ අභ්‍යන්තරික සතුරන් පසමිතුරන් විසින් හෝ මහණක්හු විසින් හෝ බමුණක්හු විසින් හෝ දෙවියකු විසින් හෝ මරකු විසින් හෝ බඹකු විසින් හෝ මෙසේ බාහිරක සතුරන් පසමිතුරන් විසින් හෝ ලොවැ කිසි දු කෙනකු විසින් හෝ නෙරැපියැ නොහැක්කේ වෙයි. බුදු වනුයේ මෙය ලබයි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මේ කාරණය වදාළ සේක. එහි මෙය (ගාථා වචන විසින්) කියනු ලැබේ:",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "“හේ පැණවතුන්ගේ වචන පරම්පරාවක් නොවූ සම්ඵප්‍රලාප නො දෙඩී ය. හේ නොවිසුරුණු වචනයැ යි කියන ලද වාඞ්මාර්ගය ඇත්තේ විය. අවැඩ හා බැඳුණු බස් ද දුරැ ලී ය. අභිවෘද්ධිදායක වූ ද බොහෝ දෙනාට සුව එළවන්නාවූ ද බස් බිණී ය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 282,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "තං කත්වා ඉතො චුතො දිවමුපපජ්ජි\nසුකතඵලවිපාකමනුභොසි\nචවිය පුනරිධාගතො සමානො\nද්විදුගමවරතරහනුත්තමලත්ථ."
                    },
                    {
                        "type": "gatha",
                        "text": "රාජා හොති සුදුප්පධංසියො\nමනුජින්දො මනුජාධිපති මහානුභාවො,\nතිදිවපුරවරසමො භවති\nසුරවරතරො රිව ඉන්දො."
                    },
                    {
                        "type": "gatha",
                        "text": "ගන්ධබ්බාසුරයක්ඛරක්ඛසෙභි \nසුරෙහි න හි භවති සුප්පධංසියො,\nතථත්තො යදි භවති තථාවිධො\nඉධ දිසා ච පටිදිසා ච විදිසාචාති."
                    },
                    {
                        "type": "centered",
                        "text": "සමදන්ත - සුසුක්කදාඨා - ලක්ඛණානි (31, 32)",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "22. යම්පි භික්ඛවෙ තථාගතො පුරිමං ජාතිං පුරිමං භවං පුරිමං නිකෙතං පුබ්බෙ මනුස්සභූතො සමානො මිච්ඡාආජීවං පහාය සම්මාආජීවෙන ජීවිකං කප්පෙසි තුලාකූට-කංසකූට-මානකූට-උක්කොටන-වඤ්චනනිකති-සාචියොග-ඡෙදන-වධබන්ධන විපරාමොස-ආලොප-සහසාකාරා පටිවිරතො අහොසි. සො තස්ස කම්මස්ස කතත්තා උපචිතත්තා උස්සන්නත්තා විපුලත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති. සො තත්ථ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හාති දිබ්බෙන ආයුනා දිබ්බෙන වණ්ණෙන දිබ්බෙන සුඛෙන දිබ්බෙන යසෙන දිබ්බෙන ආධිපතෙය්යන දිබ්බෙහි රූපෙහි දිබ්බෙහි සද්දෙහි දිබ්බෙහි ගන්ධෙහි දිබ්බෙහි රසෙහි දිබ්බෙහි ඵොට්ඨබ්බෙහි: සො තතො චුතො ඉත්ථත්තං ආගතො සමානො ඉමානි ද්වෙ මහාපුරිසලක්ඛණානි පටිලභති, සමදන්තො ච හොති සුසුක්කදාඨො ච."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "එය කොට මෙයින් සැව, දෙව්ලොවට පැමිණියේ ය. මොනොවට කළ කර්මයාගේ ඵලවිපාක වින්දේ ය. එයින් සැව, නැවැත මෙහි ආයේ ම, සිංහහනු ලක්ෂණය ලද්දේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මිනිස්නට ඉන්ද්‍ර වූ, මනුෂ්‍යාධිපති වූ, මහ තෙදැති, කිසිසේත් බැහැරැ නො කටහැකි රජෙක් වෙයි, සක්දෙව් බඳු වෙයි. සුරශ්‍රේෂ්ඨ වූ ඉන්ද්‍රයා බඳු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉදින් එබඳු ස්වභාවය ඇත්තේ, එබඳු ලක්ෂණ ඇත්තේ මෙහි උපදනේ ද, සතර දිග ද අනුදිග ද උඩ යට දෙදිග ද වසන ගඳෙවු යක් රකුස් දෙව් යන කිසි දු කෙනෙකු විසින් හෙලාලි යැ නො හැක්කේ වෙයි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "සමදන්ත - සුශුක්ල දංෂ්ට්‍රා ලක්ෂණ (31, 32)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "22. මහණෙනි, “තථාගත තෙමේ පළමු දෑහි පළමු භවයෙහි, පළමු වුසූ තන්හි, පෙරැ මිනිස් වූයේ ම මිථ්‍යා ආජීවය හැර, සම්‍යගාජීවයෙන් දිවි පැවැත්වී ය, තුලාකූට (තරාදියෙන් කරන වඤ්චාව) කංසකූට (රන් තලුතැටියෙන් කරන වඤ්චාව,) මානකූට (මිනීමෙන් කරන වඤ්වාව,) උත්කොටන (අල්ලස් ගෙන නොහිමියන් හිමියන් කිරීම,) වංචන (නොයෙක් උපායෙන් අනුන් රැවැටීම,) නිකති (බොරු රන් බොරු මැණික් ආදිය දීමෙන් කරන වඤ්චාව) සාචියෝග (උත්කොටනාදි ක්‍රියා) ඡේදන වධ බන්ධන විපරාමොස (සැඟැවි සිට අන් සතු දෑ පැහැරැ ගැන්ම,) ආලෝප (ගම්පැහැරුම් නුවර පැහැරුම් ආදිය.) සහසාකාර (බලාත්කාරයෙන් ගැන්ම) යන මෙයින් වැළක්කේ වී ය” යන යමෙක් ඇද්ද, හේ ඒ කර්මය කළ බැවින්, රැස් කළ බැවින්, බොහෝ සේ කළ බැවින්, මහත් කොට කළ බැවින්, කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට පැමිණෙයි. හේ දිව්‍ය ආයුෂයෙන් ද දිව්‍ය වර්ණයෙන් ද දිව්‍ය සැපයෙන් ද දිව්‍ය යශසින් ද දිව්‍ය ආධිපත්‍යයෙන් ද දිව්‍ය රූපයන්ගෙන් ද දිව්‍ය ශබ්දයන්ගෙන් ද දිව්‍ය ගන්ධයන්ගෙන් ද දිව්‍ය රසයන්ගෙන් ද දිව්‍ය ස්ප්‍රෂ්ටව්‍යයන්ගෙන් ද යන කරුණු දශයෙකින් අන් දෙවියන් ඉක්මැ (මැඩලා) සිටියි. හේ එයින් සැව, මෙ මිනිස්බවට ආයේ ම, මෙ මහපුරිස් ලකුණු දෙක ලබයි: සමදත් ඇත්තේ ද, ඉතා සුදු පැහැ දත් ඇත්තේ ද වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 284,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සො තෙහි ලක්ඛණෙහි සමන්නාගතො සචෙ අගාරං අජ්ඣාවසති, රාජා හොති චක්කවත්තී ධම්මිකො ධම්මරාජා චාතුරන්තො විජිතාවී ජනපදත්ථාවරියප්පත්තො සත්තරතනසමන්නාගතො. තස්සිමානි සත්ත රතනානි භවන්ති: සෙය්යථිදං චක්කරතනං හත්ථිරතනං අස්සරතනං මණිරතනං ඉත්ථිරතනං ගහපතිරතනං පරිණායකරතනමෙව සත්තමං. පරොසහස්සං ඛො පනස්ස පුත්තා භවන්ති සූරා වීරඞ්ගරූපා පරසෙනප්පමද්දනා. සො ඉමං පඨවිං සාගරපරියන්තං අඛීලමනිමිත්තමකණ්ටකං ඉද්ධං ඵීතං ඛෙමං සිවං නිරබ්බුදං අදණ්ඩෙන අසත්ථෙන ධම්මෙන සමෙන අභිවිජිය අජ්ඣාවසති. රාජා සමානො කිං ලභති? සුචිපරිවාරො හොති, සුචී’ස්ස හොන්ති පරිවාරා බ්රාහ්මණගහපතිකා නෙගම ජානපදා ගණකා මහාමත්තා අනීකට්ඨා දොවාරිකා අමච්චා පාරිසජ්ජා රාජානො භොගියා කුමාරා. රාජා සමානො ඉදං ලභති. සචෙ ඛො පන අගාරස්මා අනගාරියා පබ්බජති අරහං හොති සම්මාසම්බුද්ධො ලොකෙ විවත්තච්ඡදො. බුද්ධො සමානො කිං ලභති? සුචිපරිවාරො හොති, සුචි’ස්ස හොන්ති පරිවාරා භික්ඛූ භික්ඛුනියො උපාසකා උපාසිකායො දෙවා මනුස්සා අසුරා නාගා ගන්ධබ්බා. බුද්ධො සමානො ඉදං ලභති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එතමත්ථං භගවා අවොච. තත්ථෙතං වුච්චති:"
                    },
                    {
                        "type": "gatha",
                        "text": "මිච්ඡාජීවඤ්ච අවස්සජි සමෙන වුත්තිං\nසුචිනා සො ජනයිත්ථ ධම්මිකෙන\nඅහිතමපි ච අපානුදි{1}\nහිතමපි ච බහුජනසුඛඤ්ච ආචරි.{2}"
                    },
                    {
                        "type": "gatha",
                        "text": "සග්ගෙ වෙදයති නරො සුඛඵලානි\nකරිත්වා නිපුණෙභි විදූහි \nසබ්භි වණ්ණිතානි තිදිවපුරවරසමො\nඅභිරමති රතිඛිඩ්ඩාසමඞ්ගී."
                    },
                    {
                        "type": "gatha",
                        "text": "ලද්ධා{3} මානුසකං භවං තතො,\nචවිත්වා{4} සුකතඵලවිපාකං\nසෙසකෙන පටිලභති ලපනජං\nසමමපි සුචි සුසුක්කං.{5}"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අපනුදී - (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. අචරි - (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "3. ලද්ධාන - (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "4. වචිත්වාන - (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "5. ලද්ධාන මනුසසකං භවං තතො චවිය පුන, සුකත, ඵලවිපාක. යෙ සකෙන පටිලභති ලපනජං සම්මපි සුචි ච සුවිසුද්ධ සුසුකකං - (ස්යා)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "හේ ඒ ලක්ෂණයන්ගෙන් සමන්විත වූයේ, ඉදින් ගිහිගෙහි වසන්නේ වී නම්, දැහැමි වූ ධර්මරාජ වූ, සිවුසයුර ඉම් කොටැති සිවු මහ දිවයිනට නායක වූ, සතුරන් දිනූ, දනවුහි තහවුරු බවට පැමිණි, සත් රුවනින් සමන්වාගත සක්විති රජෙක් වෙයි. ඇත්රුවන, අස්රුවන, මිණිරුවන, ඉතිරිරුවන, ගැහැවිරුවන, සත්වනු පුත්රුවන ම යැ යි ඔහුට මේ සත් රුවන් කෙනෙක් වෙත්. ශූර, වීර, ඇඟරුව ඇති, සතුරුසෙන් මඬිනුයෙහි බුහුටි, අයිරා දහස් පුත් කෙනෙක් ඔහුට වෙත්. ඒ සක්විති තෙමේ සයුර හිම් කොට මෙ පොළොව, සතුරු ජන නැමැති හුල්නැති, සතුරු බිය නිමිති නැති, සතුරු ජන නැමැති කටු නැති, නිරුපද්‍රැත, නිවුණු සැනැහුණු, සතුරු අර්බුද නැති ක්ෂේම භූමියක් කොට, දඬුවමින් තොර වැ අවියෙන් තොර වැ, දැහැමින් දිනා අධිපති වැ වෙසෙයි. රජ වනුයේ කුමක් ලබයි ද? හේ පිරිසිදු පිරිවර ඇත්තේ වෙයි. නියම්ගම් වැසි දනව්වැසි ජනයෝ ද, බමුණු ගැහැවියෝ ද, ගණකයෝ ද මහාමාත්‍රයෝ ද, සෙනාඞ්ගරක්ෂකයෝ ද, ද්වාරපාලයෝ ද, පරම්පරාගත වැ රජපර්ෂදෙහි වූ ඇමැත්තෝ ද, රජුහු දුන් භෝගසම්පත් විඳුනා ප්‍රභූහු ද, රජුහු ද රජකුමරු වෝ ද යන ඔහුගේ පිරිසිදු පිරිවරජනයෝ ගණනින් මහත් වෙති. රජ වනුයේ මෙය සපුරා ලබයි. ඉදින් ගිහි ගෙන් නික්මැ, සස්නැ පැවිදි වන්නේ නම්, අර්හත් වූ ලොවැ බැහැර කොට හළ කෙලෙස් සෙවෙණි ඇති, සම්මාසම්බුදුවරයෙක් වෙයි. බුදු වනුයේ කුමක් ලබයි ද? පිරිසිදු පිරිවර ඇත්තේ වෙයි. ඔබට භික්ෂූ ද භික්ෂූණීහු ද උපාසකයෝ ද උපාසිකාවෝ ද දෙවියෝ ද මිනිස්සු ද අසුරයෝ ද නාගයෝ ද ගන්ධර්වයෝ දැ යි මේ පවිත්‍ර වූ පිරිවර සව්වෝ වෙත්. බුදු වනුයේ මෙය ලබයි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මේ කාරණය වදාළ සේක. එහි මෙය (ගාථා වචන විසින්) කියනු ලැබේ:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හෙ තෙමේ මිථ්‍යාආජීවය ද බැහැරැ ලීය. දැහැමෙන් සෙමෙන් පවිත්‍ර ආජීවයෙන් දිවිපැවැත්ම ඉපැදැවී ය. අහිත දෑ ද බැහැරකෙළේ ය. බොහෝ දෙනාට හිත වැඩ ද බොහෝ දෙනාට සුවය ද සිදු කෙළේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මනුෂ්‍ය වූ හෙ තෙමේ නිපුණ වූ නුවණැති සත්පුරුෂයන් විසින් වර්ණිත වූ පින් කම් කොට, ස්වර්ගයෙහි සැප විපාක විඳියි. ඒ දිව්‍ය සුඛක්‍රීඩායෙන් යුක්ත වැ සක්දෙවිඳු සේ වෙසෙසින් සුව විඳ වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එයින් සැව මිනිසත් බව ලැබ, ඉතිරි කුශලවිපාකයෙන් සම වූ ද ඉතා සුදු වූ ද දත් ලබයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 286,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "තං වෙය්යඤ්ජනිකා සමාගතා \nබහවො බ්යාකංසු නිපුණසම්මතා මනුජා\nසුචිජනපරිවාරගණො භවති\nදිජසමසුක්කසුචිසොභනදන්තො."
                    },
                    {
                        "type": "gatha",
                        "text": "රඤ්ඤො හොති බහුජනො\nසුචිපරිවාරො මහතිං මහිං අනුසාසකො,\nපසය්හ න ච ජනපදතුදනං\nහිතමපි ච බහුජනසුඛඤ්ච චරන්ති."
                    },
                    {
                        "type": "gatha",
                        "text": "අථ චෙ පබ්බජති භවති විපාපො\nසමණො සමිතරජො විවත්තඡද්දො,\nවිගතදරථකිලමථො\nඉමමපි ච පරමපි ච{1} පස්සති ලොකං."
                    },
                    {
                        "type": "gatha",
                        "text": "තස්සොවාදකරා බහු ගිහී ච පබ්බජිතා ච\nඅසුචිගරහිතං{2} ධුනන්ති පාපං,\nස හි සුචිභි පරිවුතො භවති\nමලඛීලකලිකිලෙසෙ පනුදෙතී ති{3}"
                    },
                    {
                        "type": "centered",
                        "text": "ලක්ඛණසුත්තං නිට්ඨිතං සත්තමං.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඉමමජි ච පරමථි ච - (PTS), පරම්පි පරම්පි ච - (ස්යා)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. අපුචිං ගරහිතං - (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "3. තස්සොවාදකරා බහුගිහී ච, පබ්බජිතො ච අසුචිවිශරහිත - තනුදි පාපස්ස හි සුචිහි පරිවුතො, භවති මලඛිලක කිලෙසෙ පනුදෙති - (ස්යා)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "පණ්ඩිතසම්මත වූ බොහෝ ලක්ෂණ පාඨක බමුණෝ රැස් වූවාහු, ‘මෙ තෙමේ දෙවරක් උපන් සම වූ සුදු වූ පිරිසිදු වූ ශෝභන දත් ඇත්තේ පිරිසිදු ජනයන් පිරිවර මුළුව කොටැත්තේ වේ’ යැ යි ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "රජ වූ මොහුට බොහෝ දෙනා පිරිසිදු පිරිවර වෙයි. මහ පොළොව අත් කොට ගෙන පාලනය කරන්නේ ය. අන් කෙනෙකුගෙන් මොහුගේ රටට පීඩාවෙක් නො වෙයි. එ දනවුහි වැස්සෝ උනුනට හිතවැඩ ද බොහෝ දෙනාට සුවය ද සිදු කෙරෙත් යැ යි ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉදින් මෙ තෙමේ පැවිදි වන්නේ නම්, පහ වූ පව් ඇති, සංසිඳුවූ කෙලෙස් දූලි ඇති, බැහැරැ කළ කෙලෙස් සෙවෙනි ඇති, පහ වූ කායික පීඩා හා ක්ලාන්ති ඇති ශ්‍රමණයෙක් වනුයේ, මෙ ලොව ද පර ලොව ද දකී යැ යි ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඔබගේ අවවාද පිළිපදනා බොහෝ ගිහියෝ ද පැවිද්දෝ ද අශුචි සෙයින් ගර්හිත වූ පාපය වනසත්. හේ වනාහි පිරිසිදු දහමින් පිරිවැරුණේ වෙයි. රාගාදි කෙලෙස් නැමැති මල ද කණු කටු ද ද්වේෂ නැමැති පාපය ද සියලු කෙලෙසුන් ද ප්‍රහීණ කරන්නේ යැ’යි ද කියා පැවැසූහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "සත්වනු ලක්ෂණ සූත්‍රය නිමියේ යැ.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ]
}