[
    {
        "filename": "dn-ptkv-5",
        "bookId": 12,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "166"
            },
            {
                "type": "centered",
                "text": "5",
                "level": 3
            },
            {
                "type": "heading",
                "text": "සම්පසාදනියසුත්තං",
                "level": 3
            },
            {
                "type": "centered",
                "text": "සාරිපුත්ත-සීහනාදො{1 දුතියභාගෙ දීඝ II 130 පිට්ඨෙ}",
                "level": 1
            },
            {
                "type": "paragraph",
                "text": "1. එවං මෙ සුතං:"
            },
            {
                "type": "paragraph",
                "text": "එකං සමයං භගවා නාළන්දායං{2 නාලන්දායං - මඡසං.} විහරති පාවාරිකම්බවනෙ. අථ ඛො ආයස්මා සාරිපුත්තො යෙන භගවා තෙනුපසඞ්කමි, උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා සාරිපුත්තො භගවන්තං එතදවොච: “එවං පසන්නො අහං භන්තෙ භගවති, න චාහු න ච භවිස්සති න චෙතරහි විජ්ජති අඤ්ඤො සමණො වා බ්රාහ්මණො වා භගවතා භිෙය්යාභිඤ්ඤතරො යදිදං සම්බොධියන්ති”."
            },
            {
                "type": "paragraph",
                "text": "“උළාරා ඛො තෙ අයං සාරිපුත්ත ආසභී වාචා භාසිතා, එකංසො ගහිතො, සීහනාදො නදිතො: ‘එවං පසන්නො අහං භන්තෙ භගවති, න චාහු න ච භවිස්සති න චෙතරහි විජ්ජති අඤ්ඤො සමණො වා බ්රාහ්මණො වා භගවතා භිෙය්යා’භිඤ්ඤතරො යදිදං සම්බොධියන්ති’, කිං තෙ{3 කිංනු - PTS. කිං නු ඛො තෙ - ස්යා.} සාරිපුත්ත යෙ තෙ අහෙසුං අතීතමද්ධානං අරහන්තො සම්මාසම්බුද්ධා, සබ්බෙ තෙ භගවන්තො චෙතසා චෙතො පරිච්ච විදිතා, එවංසීලා තෙ භගවන්තො අහෙසුං ඉති පි, එවංධම්මා තෙ භගවන්තො අහෙසුං ඉතිපි, එවංපඤ්ඤා තෙ භගවන්තො අහෙසුං ඉති පි, එවංවිහාරී තෙ භගවන්තො අහෙසුං ඉති පි, එවංවිමුත්තා තෙ භගවන්තො අහෙසුං ඉතිපී?ති”"
            },
            {
                "type": "paragraph",
                "text": "“නො හෙතං භන්තෙ”."
            },
            {
                "type": "paragraph",
                "text": "“කිං පන තෙ සාරිපුත්ත යෙ තෙ භවිස්සන්ති අනාගතමද්ධානං අරහන්තො සම්මාසම්බුද්ධා, සබ්බෙ තෙ භගවන්තො චෙතසා චෙතො පරිච්ච විදිතා, එවංසීලා තෙ භගවන්තො භවිස්සන්ති ඉති පි, එවංධම්මා -පෙ- එවංපඤ්ඤා, එවංවිහාරී. එවංවිමුත්තා තෙ භගවන්තො භවිස්සන්ති ඉතිපී?ති”."
            },
            {
                "type": "page-break",
                "text": "168"
            },
            {
                "type": "paragraph",
                "text": "“නො හෙතං භන්තෙ”."
            },
            {
                "type": "paragraph",
                "text": "“කිං පන තෙ සාරිපුත්ත අහං එතරහි අරහං සම්මාසම්බුද්ධො චෙතසා චෙතො පරිච්ච විදිතො එවං සීලො භගවා ඉති පි එවංධම්මො එවංපඤ්ඤො එවංවිහාරී එවංවිමුත්තො භගවා ඉතිපී”?ති."
            },
            {
                "type": "paragraph",
                "text": "“නො හෙතං භන්තෙ”."
            },
            {
                "type": "paragraph",
                "text": "“එත්ථ හි{1 එත්ථ ච හි. - මඡසං.} තෙ සාරිපුත්ත අතීතානාගතපච්චුප්පන්නෙසු අරහන්තෙසු සම්මාසම්බුද්ධෙසු චෙතොපරියඤාණං නත්ථි. අථ කිඤ්චරහි තෙ අයං සාරිපුත්ත උළාරා ආසභී වාචා භාසිතා, එකංසො ගහිතො, සීහනාදො නදිතො “එවංපසන්නො අහං භන්තෙ භගවති, න චාහු න ච භවිස්සති න චෙතරහි විජ්ජති අඤ්ඤො සමණො වා බ්රාහ්මණො වා භගවතා භිෙය්යා’භිඤ්ඤතරො යදිදං සම්බොධියන්ති?”."
            },
            {
                "type": "paragraph",
                "text": "“න ඛො මෙං{2 න ඛො පනෙතං. - සීමු. ස්යා.} භන්තෙ අතීතානාගතපච්චුප්පන්නෙසු අරහන්තෙසු සම්මාසම්බුද්ධෙසු චෙතොපරියඤාණං අත්ථි. අපි ච ඛො මෙ භන්තෙ ධම්මන්වයො විදිතො. සෙය්යථාපි භන්තෙ රඤ්ඤො පච්චන්තිමං නගරං දළහුද්දාධාපං{3 දළහුද්ධාප. මඡ්ය, දළහද්ධාලං. - ස්යා.} දළ්හපාකාරතොරණං එකද්වාරං, තත්රස්ස දොවාරිකො පණ්ඩිතො බ්යත්තො{4 වියත්තො - ස්යා. PTS.} මෙධාවී අඤ්ඤාතානං නිවාරෙතා, ඤාතානං පවෙසෙතා, සො තස්ස නගරස්ස සමන්තා{5 සාමන්තා - සීමු. ස්යා.} අනුපරියායපථං අනුක්කමමානො{6 අනුක්කමන්තෙ - PTS.} න පස්සෙය්ය පාකාරසන්ධිං වා පාකාරවිවරං වා අන්තමසො බිළාරනිස්සක්කමනමත්තම්පි, තස්ස එවමස්ස, යෙ කෙචි ඔළාරිකා පාණා ඉමං නගරං පවිසන්ති වා නික්ඛමන්ති වා, සබ්බෙ තෙ ඉමිනා’ව ද්වාරෙන පවිසන්ති වා නික්ඛමන්ති වා’ති. එවමෙව ඛො මෙ භන්තෙ ධම්මන්වයො විදිතො. යෙ තෙ භන්තෙ අහෙසුං අතීතමද්ධානං අරහන්තො සම්මාසම්බුද්ධා, සබ්බෙ තෙ භගවන්තො පඤ්චනීවරණෙ පහාය චෙතසො උපක්කිලෙසෙ පඤ්ඤාය දුබ්බලීකරණෙ, චතූසු{7 චතුසුං - PTS.} සතිපට්ඨානෙසු සුප්පතිට්ඨිතචිත්තා, සත්තසම්බොජ්ඣඞ්ගෙ යථාභූතං භාවෙත්වා අනුත්තරං සම්මාසම්බොධිං අභිසම්බුජ්ඣිංසු."
            },
            {
                "type": "page-break",
                "text": "170"
            },
            {
                "type": "paragraph",
                "text": "යෙපි තෙ භවිස්සන්ති. අනාගතමද්ධානං අරහන්තො සම්මාසම්බුද්ධා, සබ්බෙ තෙ භගවන්තො පඤ්චනීවරණෙ පහාය චෙතසො උපක්කිලෙසෙ පඤ්ඤාය දුබ්බලීකරණෙ, චතූසු සතිපට්ඨානෙසු සුප්පතිට්ඨිතචිත්තා සත්ත සම්බොජ්ඣඞ්ගෙ{1 බොජ්ඣංපෙ - PTS.} යථාභූතං භාවෙත්වා අනුත්තරං සම්මාසම්බොධිං අභිසම්බුජ්ඣිස්සන්ති. භගවා පි භන්තෙ එතරහි අරහං සම්මාසම්බුද්ධො පඤ්චනීවරණෙ පහාය චෙතසො උපක්කිලෙසෙ පඤ්ඤාය දුබ්බලීකරණෙ, චතූසු සතිපට්ඨානෙසු සුප්පතිට්ඨිතචිත්තො සත්ත සම්බොජ්ඣඞ්ගෙ යථාභූතං භාවෙත්වා අනුත්තරං සම්මාසම්බොධිං අභිසම්බුද්ධො."
            },
            {
                "type": "paragraph",
                "text": "2. ඉදාහං{2 ඉධාහං - මඡසං.}, භන්තෙ, යෙන භගවා තෙනුපසඞ්කමිං ධම්මසවණාය.{3 ධම්මස්සවණාය - මඡසං. ධම්මසවනාය - PTS.} තස්ස මෙ භන්තෙ භගවා ධම්මං දෙසෙසි.{4 දෙසෙති - මඡසං.} උත්තරුත්තරං පණීතපණීතං කණ්හසුක්කසප්පටිභාගං. යථා යථා මෙ භන්තෙ භගවා ධම්මං දෙසෙසි උත්තරුත්තරං{5 උත්තාරුත්තරිං - ස්යා. PTS.} පණීතපණීතං කණ්හසුක්කසප්පටිභාගං, තථා තථාහං තස්මිං ධම්මෙ අභිඤ්ඤා ඉධෙකච්චං ධම්මං ධම්මෙසු නිට්ඨමගමං, සත්ථරි පසීදිං, ‘සම්මාසම්බුද්ධො වත සො භගවා, ස්වාක්ඛාතො භගවතා ධම්මො, සුපටිපන්නො{6 සුප්පටිපන්නො සාවකසංඝො - මඡසං.} භගවතො සාවකසඞ්ඝො’ති."
            },
            {
                "type": "centered",
                "text": "කුසලධම්මදෙසනා",
                "level": 1
            },
            {
                "type": "paragraph",
                "text": "3. අපරං පන භන්තෙ එතදානුත්තරියං, යථා භගවා ධම්මං දෙසෙති කුසලෙසු ධම්මෙසු. තත්රිමෙ කුසලා ධම්මා: සෙය්යථිදං චත්තාරො සතිපට්ඨානා, චත්තාරො සම්මප්පධානා, චත්තාරො ඉද්ධිපාදා, පඤ්චින්ද්රියානි, පඤ්ච බලානි, සත්ත බොජ්ඣඞ්ගා, අරියො අට්ඨඞ්ගිකො මග්ගො. ඉධ භන්තෙ භික්ඛු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡි කත්වා උපසම්පජ්ජ විහරති. එතදානුත්තරියං භන්තෙ කුසලෙසු ධම්මෙසු. තං භගවා අසෙසමභිජානාති තං භගවතො අසෙසමභිජානතො උත්තරි අභිඤ්ඤෙය්යං නත්ථි. යදභිජානං අඤ්ඤො සමණො වා බ්රාහ්මණො වා භගවතා භිෙය්යා’භිඤ්ඤතරො අස්ස යදිදං කුසලෙසු ධම්මෙසු."
            },
            {
                "type": "page-break",
                "text": "172"
            },
            {
                "type": "centered",
                "text": "ආයතනපණ්ණත්ති",
                "level": 1
            },
            {
                "type": "paragraph",
                "text": "4. අපරං පන භන්තෙ එතදානුත්තරියං, යථා භගවා ධම්මං දෙසෙති ආයතනපණ්ණත්තීසු{1 ආයතනපඤ්ඤත්තීසු - PTS.}. ඡයිමානි භන්තෙ අජ්ඣත්තිකබාහිරානි ආයතනානි: චක්ඛුව{2 චක්ඛුඤ්චෙව - සීමු. මඡසං.} ච රූපානි ච සොතඤ්ච{3 සො තඤ්චෙව - PTS.} සද්දා ච, ඝානඤ්ච{4 ඝාණඤ්චෙව - PTS.} ගන්ධා ච, ජිව්හා ච{5 ජිව්හාචෙව - PTS.} රසා ච, කායො ච{6 කායොචෙව - PTS.} ඵොට්ඨබ්බා ච{7 ඵොට්ඨබ්බ චෙව - සීමු.} මනො ච{8 මනොචෙව - PTS.} ධම්මා ච. එතදානුත්තරියං භන්තෙ ආයතනපණ්ණත්තීසු. තං භගවා අසෙසමභිජානාති. තං භගවතො අසෙසමභිජානතො උත්තරිං අභිඤ්ඤෙය්යං නත්ථි, යදභිජානං අඤ්ඤො සමණො වා බ්රාහ්මණො වා භගවතා භිෙය්යාභිඤ්ඤතරො අස්ස යදිදං ආයතනපණ්ණත්තීසු."
            },
            {
                "type": "centered",
                "text": "ගබ්භාවක්කන්තිදෙසනා",
                "level": 1
            },
            {
                "type": "paragraph",
                "text": "5. අපරං පන භන්තෙ එතදානුත්තරියං, යථා භගවා ධම්මං දෙසෙති ගබ්භාවක්කන්තීසු. චතස්සො ඉමා භන්තෙ ගබ්භාවක්කන්තියො: ඉධ භන්තෙ එකච්චො අසම්පජානො මාතුකුච්ඡිං ඔක්කමති, අසම්පජානො මාතුකුච්ඡිස්මිං ඨාති, අසම්පජානො මාතුකුච්ඡිම්හා නික්ඛමති. අයං පඨමා ගබ්භාවක්කන්ති. පුන ච පරං භන්තෙ ඉධෙකච්චො සම්පජානො මාතුකුච්ඡිං ඔක්කමති, අසම්පජානො මාතුකුච්ඡිස්මිං ඨාති, අසම්පජානො මාතුකුච්ඡිම්හා නික්ඛමති. අයං දුතියා ගබ්භාවක්කන්ති. පුන ච පරං භන්තෙ ඉධෙකච්චො සම්පජානො{9 සම්පජානො පි - PTS.} මාතුකුච්ඡිං ඔක්කමති, සම්පජානො මාතුකුච්ඡිස්මිං ඨාති, සම්පජානො මාතුකුච්ඡිම්හා{10 මාතුකුච්ඡිස්මා - PTS.} නික්ඛමති. අයං තතියා ගබ්භාවක්කන්ති. පුන ච පරං, භන්තෙ ඉධෙකච්චො සම්පජානො මාතුකුච්ඡිං ඔක්කමති, සම්පජානො මාතුකුච්ඡිස්මිං ඨාති, සම්පජානො මාතුකුච්ඡිම්හා නික්ඛමති. අයං චතුත්ථි{11 චතුත්ථ - මඡසං.} ගබ්භාවක්කන්ති. එතදානුත්තරියං භන්තෙ ගබ්භාවක්කන්තීසු."
            },
            {
                "type": "centered",
                "text": "ආදෙසනවිධා දෙසනා",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "6. අපරං පන භන්තෙ එතදානුත්තරියං, යථා භගවා ධම්මං දෙසෙති ආදෙසනවිධාසු. චතස්සො ඉමා භන්තෙ ආදෙසනවිධා. ඉධ භන්තෙ එකච්චො නිමිත්තෙන ආදිසති ‘එවම්පි තෙ මනො, ඉත්ථම්පි තෙ මනො, ඉතිපි තෙ චිත්තන්ති’. සො බහුං චෙපි ආදිසති තථෙව තං හොති, නො අඤ්ඤථා. අයං පඨමා ආදෙසනවිධා."
            },
            {
                "type": "page-break",
                "text": "174"
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං භන්තෙ ඉධෙකච්චො න හෙව ඛො නිමිත්තෙන ආදිසති, අපි ච ඛො මනුස්සානං වා අමනුස්සානං වා දෙවතානං වා සද්දං සුත්වා ආදිසති’. එවම්පි තෙ මනො, ඉත්ථම්පි තෙ මනො, ඉතිපි තෙ චිත්තන්ති’. සො බහුං චෙපි ආදිසති, තථෙව තං හොති, නො අඤ්ඤථා. අයං දුතියා ආදෙසනවිධා. පුන ච පරං භන්තෙ ඉධෙකච්චො න හෙව ඛො නිමිත්තෙන ආදිසති, නාපි මනුස්සානං වා අමනුස්සානං වා දෙවතානං වා සද්දං සුත්වා ආදිසති. අපි ච ඛො විතක්කයතො විචාරයතො විතක්කවිප්ඵාරසද්දං සුත්වා ආදිසති ‘එවම්පි තෙ මනො, ඉත්ථම්පි තෙ මනො, ඉතිපි තෙ චිත්තන්ති’. සො බහුං චෙපි ආදිසති තථෙව තං හොති නො අඤ්ඤථා. අයං තතියා ආදෙසනවිධා. පුන ච පරං භන්තෙ ඉධෙකච්චො න හෙව ඛො නිමිත්තෙන ආදිසති, නාපි මනුස්සානං වා අමනුස්සානං වා දෙවතානං වා සද්දං සුත්වා ආදිසති, නාපි විතක්කයතො විචාරයතො විතක්කවිප්ඵාරසද්දං සුත්වා ආදිසති, අපි ච ඛො විතක්කවිචාරසමාධිසමාපන්නස්ස චෙතසා චෙතො පරිච්ච පජානාති – යථා ඉමස්ස භොතො මනොසඞ්ඛාරා පණිහිතා. තථා ඉමස්ස චිත්තස්ස අනන්තරා ඉමං නාම විතක්කං විතක්කෙස්සතීති. සො බහුඤ්චෙපි ආදිසති, තථෙව තං හොති නො අඤ්ඤථාති. අයං චතුත්ථා ආදෙසනවිධා. එතදානුත්තරියං භන්තෙ ආදෙසනවිධාසු."
            },
            {
                "type": "centered",
                "text": "දස්සනසමාපත්ති-දෙසනා",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "7. අපරං පන භන්තෙ එතදානුත්තරියං යථා භගවා ධම්මං දෙසෙති දස්සනසමාපත්තීසු. චතස්සො ඉමා භන්තෙ දස්සනසමාපත්තියො: ඉධ භන්තෙ එකච්චො සමණො වා බ්රාහ්මණො වා ආතප්පමන්වාය පධානමන්වාය අනුයොගමන්වාය අප්පමාදමන්වාය සම්මාමනසිකාරමන්වාය තථාරූපං චෙතොසමාධිං ඵුසති යථා සමාහිතෙ චිත්තෙ ඉමමෙව කායං උද්ධං පාදතලා අධො කෙසමත්ථකා තචපරියන්තං පූරං නානප්පකාරස්ස අසුචිනො පච්චවෙක්ඛති: අත්ථි ඉමස්මිං කායෙ කෙසා ලොමා නඛා දන්තා තචො මංසං නහාර{1 න්හාරු - ස්යා. PTS.} අට්ඨි{2 අට්ඨි - ස්යා. PTS.} අට්ඨිමිඤ්ජා{3 අට්ඨිමිඤ්ජං - මඡසං.} වක්කං හදයං යකනං කිලොමකං පිහකං පප්ඵාසං අන්තං අන්තගුණං උදරියං කරීසං පිත්තං සෙම්හං පුබ්බො ලොහිතං සෙදො මෙදො අස්සු වසා ඛෙළො සිඞ්ඝානිකා ලසිකා මුත්තන්ති. අයං පඨමා දස්සනසමාපත්ති."
            },
            {
                "type": "page-break",
                "text": "176"
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං භන්තෙ ඉධෙකච්චො සමණො වා බ්රාහ්මණො වා ආතප්පමන්වාය -පෙ- තථාරූපං චෙතොසමාධිං ඵුසති, යථා සමාහිතෙ චිත්තෙ ඉමඤ්චෙව කායං උද්ධං පාදතලා අධො කෙසමත්ථකා තචපරියන්තං පූරං නානප්පකාරස්ස අසුචිනො පච්චවෙක්ඛති: අත්ථි ඉමස්මිං කායෙ කෙසා ලොමා නඛා දන්තා -පෙ- ලසිකා මුත්තන්ති. අතික්කම්ම ච පුරිසස්ස ඡවිමංස ලොහිතං අට්ඨිං පච්චවෙක්ඛති. අයං දුතියා දස්සනසමාපත්ති."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං භන්තෙ ඉධෙකච්චො සමණො වා බ්රාහ්මණො වා ආතප්පමන්වාය -පෙ- තථාරූපං චෙතොසමාධිං ඵුසති යථා සමාහිතෙ චිත්තෙ ඉමඤ්චෙව කායං උද්ධං පාදතලා අධො කෙසමත්ථකා තචපරියන්තං පූරං නානප්පකාරස්ස අසුචිනො පච්චවෙක්ඛති: අත්ථි ඉමස්මිං කායෙ කෙසා ලොමා -පෙ- ලසිකා මුත්තන්ති, අතික්කම්ම ච පුරිසස්ස ඡවිමංස ලොහිතං අට්ඨිං පච්චවෙක්ඛති. පුරිසස්ස ච විඤ්ඤාණසොතං පජානාති උභයතො අබ්බොච්ඡින්නං ඉධ ලොකෙ පතිට්ඨිතං ච පරලොකෙ පතිට්ඨිතං ච. අයං තතියා දස්සනසමාපත්ති."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං භන්තෙ ඉධෙකච්චො සමණො වා බ්රාහ්මණො වා ආතප්පමන්වාය -පෙ- ලසිකා මුත්තන්ති අතික්කම්ම ච පුරිසස්ස ඡවිමංසලොහිතං අට්ඨිං පච්චවෙක්ඛති. පුරිසස්ස ච විඤ්ඤාණසොතං පජානාති උභයතො අබ්බොච්ඡින්නං ඉධ ලොකෙ අප්පතිට්ඨිතඤ්ච පරලොකෙ අප්පතිට්ඨිතඤ්ච. අයං චතුත්ථා දස්සනසමාපත්ති. එතදානුත්තරියං භන්තෙ දස්සනසමාපත්තීසු."
            },
            {
                "type": "centered",
                "text": "පුග්ගලපණ්ණත්තිදෙසනා",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "8. අපරං පන භන්තෙ එතදානුත්තරියං, යථා භගවා ධම්මං දෙසෙති පුග්ගලපණ්ණත්තීසු.{1 පුග්ගලපඤ්ඤත්තිසු - සීමු.} සත්තිමෙ භන්තෙ පුග්ගලා: උභතොභාගවිමුත්තො, පඤ්ඤාවිමුත්තො, කායසක්ඛී, දිට්ඨිප්පත්තො, සද්ධාවිමුත්තො, ධම්මානුසාරී, සද්ධානුසාරී. එතදානුත්තරියං භන්තෙ පුග්ගලපණ්ණත්තීසු."
            },
            {
                "type": "centered",
                "text": "පධානදෙසනා",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "9. අපරං පන භන්තෙ එතදානුත්තරියං යථා භගවා ධම්මං දෙසෙති පධානෙසු. සත්තිමෙ භන්තෙ සම්බොජ්ඣඞ්ගා: සතිසම්බොජ්ඣඞ්ගො, ධම්මවිචයසම්බොජ්ඣඞ්ගො, වීරිය{2 වීරිය.... - මඡසං.}සම්බොජ්ඣඞ්ගො, පීතිසම්බොජ්ඣඞ්ගො, පස්සද්ධිසම්බොජ්ඣඞ්ගො, සමාධිසම්බොජ්ඣඞ්ගො, උපෙක්ඛාසම්බොජ්ඣඞ්ගො. එතදානුත්තරියං භන්තෙ පධානෙසු."
            },
            {
                "type": "page-break",
                "text": "178"
            },
            {
                "type": "centered",
                "text": "පටිපදාදෙසනා",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "10. අපරං පන භන්තෙ එතදානුත්තරියං යථා භගවා ධම්මං දෙසෙති පටිපදාසු. චතස්සො ඉමා භන්තෙ පටිපදා: දුක්ඛා පටිපදා දන්ධාභිඤ්ඤා, දුක්ඛා පටිපදා ඛිප්පාභිඤ්ඤා, සුඛා පටිපදා දන්ධාභිඤ්ඤා, සුඛා පටිපදා ඛිප්පාභිඤ්ඤා’ති. තත්ර භන්තෙ යායං පටිපදා දුක්ඛා දන්ධාභිඤ්ඤා, අයං භන්තෙ පටිපදා උභයෙනෙව හීනා අක්ඛායති දුක්ඛත්තා ච දන්ධත්තා ච. තත්ර භන්තෙ යායං පටිපදා දුක්ඛා ඛිප්පාභිඤ්ඤා, අයං පන භන්තෙ පටිපදා දුක්ඛත්තා හීනා අක්ඛායති. තත්ර භන්තෙ යායං පටිපදා සුඛා දන්ධාභිඤ්ඤා, අයං පන භන්තෙ පටිපදා දන්ධත්තා හීනා අක්ඛායති. තත්ර භන්තෙ යායං පටිපදා සුඛා ඛිප්පාභිඤ්ඤා, අයං පන භන්තෙ පටිපදා උභයෙනෙව පණීතා අක්ඛායති සුඛත්තා ච ඛිප්පත්තා ච. එතදානුත්තරියං භන්තෙ පටිපදාසු."
            },
            {
                "type": "centered",
                "text": "භස්සසමාචාරාදි-දෙසනා",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "11. අපරං පන භන්තෙ එතදානුත්තරියං යථා භගවා ධම්මං දෙසෙති භස්සසමාචාරෙ. ඉධ භන්තෙ එකච්චො න චෙව මුසාවාදුපසංහිතං වාචං භාසති, න ච වෙභූතියං න ච පෙසුණියං{1 පෙසුනිය - මඡසං.} න ච සාරම්භජං ජයාපෙක්ඛො, මන්තා මන්තා ච වාචං භාසති නිධානවතිං කාලෙන. එතදානුත්තරියං භන්තෙ භස්සසමාචාරෙ."
            },
            {
                "type": "paragraph",
                "text": "12. අපරං පන භන්තෙ එතදානුත්තරියං, යථා භගවා ධම්මං දෙසෙති පුරිසසීලසමාචාරෙ. ඉධ භන්තෙ එකච්චො චස්ස සද්ධො ච, න ච කුහකො, න ච ලපකො, න ච නෙමිත්තිකො, න ච නිප්පෙසිකො, න ච ලාභෙන ලාභං නිජිහිංසනකො{2 නිජිගීංසනකො - ස්යා. නිජිගීසනකො - මඡසං.} ඉන්ද්රියෙසු ගුත්තද්වාරො, භොජනෙ මත්තඤ්ඤූ, සමකාරී, ජාගරියානුයොගමනුයුත්තො, අතන්දිතො, ආරද්ධවීරියො, ඣායී, සතිමා, කල්යාණපටිභානො, ගතිමා, ධිතිමා, මතිමා, න ච කාමෙසු ගිද්ධො, සතො ච නිපකො ච."
            },
            {
                "type": "paragraph",
                "text": "එතදානුත්තරියං භන්තෙ පුරිසසීලසමාචාරෙ."
            },
            {
                "type": "page-break",
                "text": "180"
            },
            {
                "type": "centered",
                "text": "අනුසාසනවිධාදෙසනා",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "13. අපරං පන භන්තෙ එතදානුත්තරියං යථා භගවා ධම්මං දෙසෙති අනුසාසනවිධාසු. චතස්සො ඉමා භන්තෙ අනුසාසනවිධා. ජානාති භන්තෙ භගවා පරං පුග්ගලං පච්චත්තං යොනිසො මනසිකාරා, ‘අයං පුග්ගලො යථානුසිට්ඨං තථා පටිපජ්ජමානො, තිණ්ණං සඤ්ඤොජනානං පරික්ඛයා සොතාපන්නො භවිස්සති අවිනිපාතධම්මො නියතො සම්බොධිපරායණො’ති. ජානාති භන්තෙ භගවා පරං{1 අපරා - මඡසං. පරපුග්ගලං - PTS.} පුග්ගලං පච්චත්තං යොනිසොමනසිකාරා, – අයං පුග්ගලො යථානුසිට්ඨං තථා පටිපජ්ජමානො තිණ්ණං සඤ්ඤොජනානං පරික්ඛයා රාගදොසමොහානං තනුත්තා සකදාගාමී භවිස්සති, සකිදෙව ඉමං ලොකං ආගන්ත්වා දුක්ඛස්සන්තං කරිස්සතීති."
            },
            {
                "type": "paragraph",
                "text": "ජානාති භන්තෙ භගවා පරං පුග්ගලං පච්චත්තං යොනිසො මනසිකාරා, අයං පුග්ගලො යථානුසිට්ඨං තථා පටිපජ්ජමානො පඤ්චන්නං ඔරම්භාගියානං සඤ්ඤොජනානං පරික්ඛයා ඔපපාතිකො භවිස්සති, තත්ථ පරිනිබ්බායී අනාවත්තිධම්මො තස්මා ලොකාති."
            },
            {
                "type": "paragraph",
                "text": "ජානාති භන්තෙ භගවා පරං පුග්ගලං පච්චත්තං යොනිසො මනසිකාරා, – අයං පුග්ගලො යථානුසිට්ඨං තථා පටිපජ්ජමානො ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡි කත්වා උපසම්පජ්ජ විහරිස්සතීති."
            },
            {
                "type": "paragraph",
                "text": "එතදානුත්තරියං භන්තෙ අනුසාසනවිධාසු."
            },
            {
                "type": "centered",
                "text": "පරපුග්ගලවිමුත්තිඤාණදෙසනා",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "14. අපරං පන භන්තෙ එතදානුත්තරියං යථා භගවා ධම්මං දෙසෙති පරපුග්ගලවිමුත්තිඤාණෙ. ජානාති භන්තෙ භගවා පරං පුග්ගලං පච්චත්තං යොනිසොමනසිකාරා, අයං පුග්ගලො තිණ්ණං සඤ්ඤොජනානං පරික්ඛයා සොතාපන්නො භවිස්සති අවිනිපාතධම්මො නියතො සම්බොධිපරායණො’ති. ජානාති භන්තෙ භගවා පරං පුග්ගලං පච්චත්තං යොනිසො මනසිකාරා, අයං පුග්ගලො තිණ්ණං සඤ්ඤොජනානං පරික්ඛයා රාගදොසමොහානං තනුත්තා සකදාගාමී භවිස්සති සකිදෙව ඉමං ලොකං ආගන්ත්වා දුක්ඛස්සන්තං කරිස්සතී’ති."
            },
            {
                "type": "page-break",
                "text": "182"
            },
            {
                "type": "paragraph",
                "text": "ජානාති භන්තෙ භගවා පරං පුග්ගලං පච්චත්තං යොනිසො මනසිකාරා, ‘අයං පුග්ගලො පඤ්චන්නං ඔරම්භාගියානං සඤ්ඤොජනානං පරික්ඛයා ඔපපාතිකො භවිස්සති තත්ථ පරිනිබ්බායී අනාවත්තිධම්මා තස්මා ලොකා’ති."
            },
            {
                "type": "paragraph",
                "text": "ජානාති භන්තෙ භගවා පරං පුග්ගලං පච්චත්තං යොනිසො මනසිකාරා ‘අයං පුග්ගලො ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤා විමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡි කත්වා උපසම්පජ්ජ විහරිස්සතී ති. එතදානුත්තරියං භන්තෙ පරපුග්ගලවිමුත්තිඤාණෙ."
            },
            {
                "type": "centered",
                "text": "සස්සතවාදදෙසනා",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "15. අපරං පන භන්තෙ එතදානුත්තරියං යථා භගවා ධම්මං දෙසෙති සස්සතවාදෙසු. තයො මෙ භන්තෙ සස්සතවාදා. ඉධ භන්තෙ එකච්චො සමණො වා බ්රාහ්මණො වා ආතප්පමන්වාය පධානමන්වාය අනුයොගමන්වාය අප්පමාදමන්වාය සම්මා මනසිකාරවන්වාය තථාරූපං චෙතොසමාධිං ඵුසති, යථා සමාහිතෙ චිත්තෙ අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති සෙය්යථිදං: එකම්පි ජාතිං ද්වෙ පි ජාතියො තිස්සො පි ජාතියො චතස්සො පි ජාතියො පඤ්ච පි ජාතියො දස පි ජාතියො වීසම්පි{1 වීසතිම්පි - PTS.} ජාතියො තිංසම්පි ජාතියො චත්තාළිසම්පි{2 චත්තාලිසම්පි - ස්යා. චත්තාරීසං - PTS.} ජාතියො පඤ්ඤාසම්පි ජාතියො ජාතිසතම්පි ජාතිසහස්සම්පි ජාතිසතසහස්සම්පි අනෙකානි පි ජාතිසතානි අනෙකානි පි ජාතිසහස්සානි අනෙකානි පි ජාතිසතසහස්සානි, අමුත්රාසිං එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවං සුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො අමුත්ර උදපාදිං{3 උප්පාදි - PTS.}. තත්රාපාසිං එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො ඉධූපපන්නො’ති. ඉති සාකාරං සඋද්දෙසං අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති. සො එවමාහ. අතීතම්පාහං{4 අතීතං වාහං - ස්යා. අතීතම්පිහං - PTS.} අද්ධානං ජානාමි ‘සංවට්ටි{5 සංවට්ටි වා... විවට්ටි වා - සීමු.} පි ලොකො විවට්ටි පි’ ති. අනාගතම්පාහං අද්ධානං ජානාමි ‘සංවට්ටිස්සති වා ලොකො විවට්ටිස්සති වා ති. සස්සතො අත්තා ච ලොකො ච වඤ්ඣො කූටට්ඨො{6 කුටට්ටො - ස්යා.} එසිකට්ඨායි ඨිතො තෙ’ච සත්තා සන්ධාවන්ති සංසරන්ති චවන්ති උපපජ්ජන්ති, අත්ථිත්වෙව සස්සතිසමන්ති. අයං පඨමො සස්සතවාදො."
            },
            {
                "type": "page-break",
                "text": "184"
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං භන්තෙ ඉධෙකච්චො සමණො වා බ්රාහ්මණො වා ආතප්පමන්වාය -පෙ- තථාරූපං චෙතොසමාධිං ඵුසති යථා සමාහිතෙ චිත්තෙ අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති. සෙය්යථිදං{1 සෙය්යථිදං - මඡසං.} එකම්පි සංවට්ටවිවට්ටං ද්වෙ පි සංවට්ටවිවට්ටානි තීනි පි සංවට්ටවිවට්ටානි චත්තාරි පි සංවට්ටවිවට්ටානි පඤ්ච පි සංවට්ටවිවට්ටානි දස පි සංවට්ටවිවට්ටානි අමුත්රාසිං එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො අමුත්ර උදපාදිං, තත්රාපාසිං එවන්නාමො එවංගොත්තො -පෙ- එවමායුපරියන්තො, සො තතො චුතො ඉධූපපන්නො’ති. ඉති සාකාරං සඋද්දෙසං අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති. සො එවමාහ: අතීතම්පාහං අද්ධානං ජානාමි ‘සංවට්ටි වා ලොකො විවට්ටි වා ලොකො. අනාගතඤ්ච ඛවාහං අද්ධානං ජානාමි සංවට්ටිස්සති වා ලොකො විවට්ටිස්සති වාති. සස්සතො අත්තා ච ලොකො ච වඤ්ඣො කූටට්ඨො එසිකට්ඨායී ඨිතො තෙ’ච සත්තා සන්ධාවන්ති සංසරන්ති චවන්ති උපපජ්ජන්ති, අත්ථිත්වෙව සස්සතිසමන්ති. අයං භන්තෙ දුතියො සස්සතවාදො."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං භන්තෙ ඉධෙකච්චො සමණො වා බ්රාහ්මණො වා ආතප්පමන්වාය -පෙ- තථාරූපං චෙතොසමාධිං ඵුසති යථා සමාහිතෙ චිත්තෙ අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති. සෙය්යථිදං: -පෙ- දස පි සංවට්ටවිවට්ටානි වීසම්පි සංවට්ටවිවට්ටානි තිංසම්පි සංවට්ටවිවට්ටානි චත්තාළීසම්පි සංවට්ටවිවට්ටානි ‘අමුත්රාසිං එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො අමුත්ර උදපාදිං. තත්රාපාසිං එවංනාමො -පෙ- එවමායුපරියන්තො. සො තතො චුතො ඉධූපපන්නො’ති. ඉති සාකාරං සඋද්දෙසං අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති. සො එවමාහ: අතීතම්පාහං අද්ධානං ජානාමි සංවට්ටි පි ලොකො විවට්ටි පී’ති. අනාගතම්පාහං අද්ධානං ජානාමි ‘සංවට්ටිස්සති පි ලොකො විවට්ටිස්සති පී’ති. ‘සස්සතො අත්තා ච ලොකො ච වඤ්ඣො කූටට්ඨො එසිකට්ඨායී ඨිතො, තෙ’ච සත්තා සන්ධාවන්ති සංසරන්ති චවන්ති උපපජ්ජන්ති, අත්ථිත්වෙව සස්සතිසමන්ති. අයං භන්තෙ තතියො සස්සතවාදො. එතදානුත්තරියං භන්තෙ සස්සතවාදෙසු."
            },
            {
                "type": "page-break",
                "text": "186"
            },
            {
                "type": "centered",
                "text": "පුබ්බෙනිවාසානුස්සතිඤාණදෙසනා",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "13. අපරං පන භන්තෙ එතදානුත්තරියං, යථා භගවා ධම්මං දෙසෙති පුබ්බෙනිවාසානුස්සතිඤාණෙ. ඉධ භන්තෙ එකච්චො සමණො වා බ්රාහ්මණො වා ආතප්පමන්වාය -පෙ- තථාරූපං චෙතොසමාධිං ඵුසති යථාසමාහිතෙ චිත්තෙ අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති - සෙය්යථිදං එකම්පි ජාතිං ද්වෙ පි ජාතියො තිස්සො පි ජාතියො චතස්සො පි ජාතියො පඤ්ච පි ජාතියො දස පි ජාතියො වීසම්පි ජාතියො තිංසම්පි ජාතියො චත්තාළීසම්පි ජාතියො පඤ්ඤාසම්පි ජාතියො සතම්පි ජාතියො සහස්සම්පි ජාතියො සතසහස්සම්පි ජාතියො අනෙකෙ පි සංවට්ටකප්පෙ අනෙකෙ පි විවට්ටකප්පෙ අනෙකෙ පි සංවට්ටවිවට්ටකප්පෙ -පෙ- ඉති සාකාරං සඋද්දෙසං අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති. සන්ති භන්තෙ දෙවා{1 සත්තා - ස්යා.} යෙසං න සක්කා ගණනාය වා සංඛානෙන{2 සංඛාතො - PTS.} වා ආයුං සඞ්ඛාතුං, අපි ච යස්මිං යස්මිං අත්තභාවෙ අභිනිවුත්ථපුබ්බො{3 අභිනිවුට්ඨපුබ්බො - මඡසං.} හොති යදි වා රූපීසු යදි වා අරූපීසු යදි වා සඤ්ඤීසු යදි වා අසඤ්ඤීසු යදි වා නෙවසඤ්ඤීනාසඤ්ඤීසු. ඉති සාකාරං සඋද්දෙසං අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති. එතදානුත්තරියං භන්තෙ පුබ්බෙනිවාසානුස්සති ඤාණෙ."
            },
            {
                "type": "centered",
                "text": "චුතූපපාතඤාණදෙසනා",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "14. අපරං පන භන්තෙ එතදානුත්තරියං යථා භගවා ධම්මං දෙසෙති සත්තානං චුතූපපාතඤාණෙ. ඉධ භන්තෙ එකච්චො සමණො වා බ්රාහ්මණො වා ආතප්පමන්වාය -පෙ- තථාරූපං චෙතොසමාධිං ඵුසති යථා සමාහිතෙ චිත්තෙ දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සති චවමානෙ උපපජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති; ඉමෙ වත භොන්තො සත්තා කායදුච්චරිතෙන සමන්නාගතා වචීදුච්චරිතෙන සමන්නාගතා මනොදුච්චරිතෙන සමන්නාගතා අරියානං උපවාදකා මිච්ඡාදිට්ඨිකා මිච්ඡාදිට්ඨිකම්මසමාදානා. තෙ කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපන්නා. ඉමෙ වා පන භොන්තො සත්තා කායසුචරිතෙන සමන්නාගතා වචීසුචරිතෙන සමන්නාගතා මනොසුචරිතෙන සමන්නාගතා අරියානං අනුපවාදකා සම්මාදිට්ඨිකා සම්මාදිට්ඨිකම්මසමාදානා. තෙ කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නා’ති. ඉති දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සති චවමානෙ උපපජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති. එතදානුත්තරියං භන්තෙ සත්තානං චුතූපපාතඤාණෙ."
            },
            {
                "type": "page-break",
                "text": "188"
            },
            {
                "type": "centered",
                "text": "ඉද්ධිවිධදෙසනා",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "15. අපරං පන භන්තෙ එතදානුත්තරියං යථා භගවා ධම්මං දෙසෙති ඉද්ධිවිධාසු. ද්වෙ’මා භන්තෙ ඉද්ධිවිධායො.{1 ඉද්ධියෙ - PTS.} අත්ථි භන්තෙ ඉද්ධි යා සාසවා සඋපධිකා නො අරියා’ති වුච්චති. අත්ථි භන්තෙ ඉද්ධි යා අනාසවා අනුපධිකා අරියා’ති. කතමා ච භන්තෙ ඉද්ධි යා සාසවා{2 ඉද්ධිසාසවා - මඡසං.} සඋපධිකා නො අරියා’ති වුච්චති? ඉධ භන්තෙ එකච්චො සමණො වා බ්රාහ්මණො වා ආතප්පමන්වාය -පෙ- තථාරූපං චෙතොසමාධිං ඵුසති යථා සමාහිතෙ චිත්තෙ අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති: එකො පි හුත්වා බහුධා හොති, බහුධා පි හුත්වා එකො හොති, ආවිභාවං තිරොභාවං තිරොකුඩ්ඩං{3 තිරොක්ටටං - මඡසං.} තිරොපාකාරං තිරොපබ්බතං අසජ්ජමානො{4 අභිජ්ජමානො - PTS.} ගච්ඡති සෙය්යථාපි ආකාසෙ. පඨවියා පි උම්මුජ්ජනිමුජ්ජං කරොති සෙය්යථාපි උදකෙ. උදකෙ පි අභිජ්ජමානෙ ගච්ඡති සෙය්යථාපි පඨවියං. ආකාසෙ පි පල්ලඞ්කෙන කමති සෙය්යථාපි පක්ඛී සකුණො. ඉමෙ පි චන්දිමසූරියෙ{5 මූරියෙ - මඡසං.} එවංමහිද්ධිකෙ එවංමහානුභාවෙ පාණිනා පරිමසති{6 පරාමසති - (සීමු.)} පරිමජ්ජති. යාව බ්රහ්මලොකා පි කායෙන වසං වත්තෙති. අයං භන්තෙ ඉද්ධි යා සාසවා සඋපධිකා නො අරියා ති වුච්චති."
            },
            {
                "type": "paragraph",
                "text": "කතමා පන භන්තෙ ඉද්ධි යා අනාසවා අනුපධිකා අරියා ති වුච්චති? ඉධ භන්තෙ භික්ඛු සචෙ ආකඞ්ඛති පටිකූලෙ අප්පටිකූලසඤ්ඤී විහරෙය්යන්ති, අප්පටිකූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති අප්පටිකූලෙ පටිකූලසඤ්ඤී විහරෙය්යන්ති, පටිකූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති පටිකූලෙ ච අප්පටිකූලෙ ච අප්පටිකූලසඤ්ඤී විහරෙය්යන්ති අප්පටිකූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති පටිකූලෙ ච අප්පටිකූලෙ ච පටිකූලසඤ්ඤී විහරෙය්යන්ති, පටිකූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති පටිකූලඤ්ච අප්පටිකූලඤ්ච තදුභයං අභිනිවජ්ජෙත්වා උපෙක්ඛකො විහරෙය්යං සතො සම්පජානො’ති, උපෙක්ඛකො තත්ථ විහරති සතො සම්පජානො. අයං පන භන්තෙ ඉද්ධි අනාසවා අනුපධිකා අරියා ති වුච්චති. එතදානුත්තරියං භන්තෙ ඉද්ධිවිධාසු. තං භගවා අසෙසමභිජානාති. තං භගවතො අසෙසමභිජානතො උත්තරිං අභිඤ්ඤෙය්යං නත්ථි, යදභිජානං අඤ්ඤො සමණො වා බ්රාහ්මණො වා භගවතා භීෙය්යා’භිඤ්ඤතරො අස්ස යදිදං ඉද්ධිවිධාසු."
            },
            {
                "type": "page-break",
                "text": "190"
            },
            {
                "type": "paragraph",
                "text": "16. යන්තං භන්තෙ සද්ධෙන කුලපුත්තෙන පත්තබ්බං ආරද්ධවීරියෙන ථාමවතා පුරිසථාමෙන පුරිසවීරියෙන පුරිසපරක්කමෙන පුරිසධොරය්හෙන, අනුප්පත්තං තං භගවතා. න ච භන්තෙ භගවා කාමෙසු කාමසුඛල්ලිකානුයොගමනුයුත්තො හීනං ගම්මං පොථුජ්ජනිකං අනරියං අනත්ථසංහිතං, න ච අත්තකිලමථානුයොගමනුයුත්තො දුක්ඛං අනරියං අනත්ථසංහිතං. චතුන්නං ච භගවා ඣානානං ආභිචෙතසිකානං දිට්ඨධම්මසුඛවිහාරානං නිකාමලාභී අකිච්ඡලාභී අකසිරලාභී."
            },
            {
                "type": "centered",
                "text": "අනුයොගදානප්පකාරො",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "සචෙ මං භන්තෙ එවං පුච්ඡෙය්ය ‘කින්නු ඛො ආවුසො සාරිපුත්ත, අහෙසුං අතීතමද්ධානං අඤ්ඤෙ සමණා වා බ්රාහ්මණා වා භගවතා භීෙය්යා’භිඤ්ඤතරා සම්බොධියන්ති? එවං පුට්ඨො අහං භන්තෙ නො’ති වදෙය්යං. ‘කිං පනාවුසො සාරිපුත්ත භවිස්සන්ති අනාගතමදධානං අඤ්ඤෙ සමණා වා බ්රාහ්මණා වා භගවතා භීෙය්යා’භිඤ්ඤතරා සම්බොධියන්ති?’ එවං පුට්ඨො අහං භන්තෙ ‘නො’ති වදෙය්යං . ‘කිං පනාවුසො සාරිපුත්ත, අත්ථෙතරහි අඤ්ඤො සමණො වා බ්රාහ්මණො වා භගවතා භිෙය්යා’භිඤ්ඤතරො සම්බොධියන්ති?” එවං පුට්ඨො අහං භන්තෙ ‘නො’ති වදෙය්යං. සචෙ පන මං භන්තෙ එවං පුච්ඡෙය්ය “කින්නු ඛො ආවුසො සාරිපුත්ත අහෙසුං අතීතමද්ධානං අඤ්ඤෙ සමණා වා බ්රාහ්මණා වා භගවතා සමසමා සම්බොධියන්ති?’ එවං පුට්ඨො අහං භන්තෙ ‘එවන්ති වදෙය්යං. ‘කිං පනාවුසො සාරිපුත්ත, භවිස්සන්ති අනාගතමද්ධානං අඤ්ඤෙ සමණා වා බ්රාහ්මණා වා භගවතා සමසමා සම්බොධියන්ති?’ එවං පුට්ඨො අහං භන්තෙ ‘එවන්ති’ වදෙය්යං. ‘කිං පනාවුසො සාරිපුත්ත අත්ථෙතරහි අඤ්ඤෙ සමණා වා බ්රාහ්මණා වා භගවතා සමසමා සම්බොධියන්ති?’ එවං පුට්ඨො අහං භන්තෙ‘නො’ති වදෙය්යං. සචෙ පන මං භන්තෙ එවං පුච්ඡෙය්ය, ‘කිං පනායස්මා සාරිපුත්තො එකච්චං අබ්භනුජානාති එකච්චං නාබ්භනුජානාතී?’ති. එවං පුට්ඨො අහං භන්තෙ එවං බ්යාකරෙය්යං ‘සම්මුඛා මෙතං ආවුසො භගවතො සුතං, සම්මුඛා පටිග්ගහිතං: අහෙසුං අතීතමද්ධානං අරහන්තො සම්මාසම්බුද්ධා මයා සමසමා සම්බොධියන්ති. සම්මුඛා මෙතං ආවුසො භගවතො සුතං, සම්මුඛා පටිග්ගහිතං: භවිස්සන්ති අනාගතමද්ධානං අරහන්තොසම්මාසම්බුද්ධා මයා සමසමා සම්බොධියන්ති. සම්මුඛා මෙතං ආවුසො භගවතො සුතං සම්මුඛා පටිග්ගහිතං:"
            },
            {
                "type": "page-break",
                "text": "192"
            },
            {
                "type": "paragraph",
                "text": "“අට්ඨානමෙතං අනවකාසො යං එකිස්සා ලොකධාතුයා ද්වෙ අරහන්තො සම්මාසම්බුද්ධා අපුබ්බං අචරිමං උප්පජ්ජෙය්යුං, නෙතං ඨානං විජ්ජතී”ති. එකච්චාහං භන්තෙ එවං පුට්ඨො එවං බ්යාකරමානො වුත්තවාදී චෙව භගවතො හොමි, න ච භගවන්තං අභූතෙන අබ්භාචික්ඛාමි, ධම්මස්ස චානුධම්මං බ්යාකරොමි, න ච කොචි සහධම්මිකො. වාදානුපාතො{1 වාදනුවාදො - මඡසං.} ගාරය්හං ඨානං ආගච්ඡතී?ති”"
            },
            {
                "type": "paragraph",
                "text": "17. “තග්ඝත්වං සාරිපුත්ත එවං පුට්ඨො එවං බ්යාකරමානො වුත්තවාදී චෙව මෙ හොති න ච මං අභූතෙන අබ්භාචික්ඛසි, ධම්මස්ස චානුධම්මං බ්යාකරොසි, න ච කොචි සහධම්මිකො වාදානුපාතො ගාරය්හං ඨානං ආගච්ඡතී”ති."
            },
            {
                "type": "centered",
                "text": "අච්ඡරියබ්භුතානි",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "18. එවං වුත්තෙ ආයස්මා උදායී භගවන්තං එතදවොච: “අච්ඡරියං භන්තෙ අබ්භුතං භන්තෙ තථාගතස්ස අප්පිච්ඡතා සන්තුට්ඨිතා සල්ලෙඛතා. යත්ර හි නාම තථාගතො එවංමහිද්ධිකො එවංමහානුභාවො, අථ ච පන නෙවත්තානං පාතුකරිස්සති. එකමෙකං චෙපි ඉතො භන්තෙ ධම්මං අඤ්ඤතිත්ථියා පරිබ්බාජකා අත්තනි සමනුපස්සෙය්යුං, තෙ තාවතකෙනෙව පටාකං පරිහරෙය්යුං. අච්ඡරියං භන්තෙ අබ්භුතං භන්තෙ තථාගතස්ස අප්පිච්ඡතා සන්තුට්ඨිතා සල්ලෙඛතා. යත්ර හි නාම තථාගතො එවංමහිද්ධිකො එවංමහානුභාවො. අථ ච පන නෙවත්තානං පාතුකරිස්සතී”ති."
            },
            {
                "type": "paragraph",
                "text": "19. “පස්ස ඛො ත්වං උදායි: තථාගතස්ස අප්පිච්ඡතා සන්තුට්ඨිතා සල්ලෙඛතා. යත්ර හි නාම තථාගතො එවංමහිද්ධිකො එවංමහානුභාවො, අථ ච පන නෙවත්තානං පාතුකරිස්සති. එකමෙකං චෙපි ඉතො උදායි ධම්මං අඤ්ඤතිත්ථියා පරිබ්බාජකා අත්තනි සමනුපස්සෙය්යුං, තෙ තාවතකෙනෙව පටාකං පරිහරෙය්යුං. පස්ස ඛො ත්වං උදායි: තථාගතස්ස අප්පිච්ඡතා සන්තුට්ඨිතා සල්ලෙඛතා. යත්ර හි නාම තථාගතො එවංමහිද්ධිකො එවංමහානුභාවො, අථ ච පන නෙවත්තානං පාතුකරිස්සතී”ති."
            },
            {
                "type": "paragraph",
                "text": "20. අථ ඛො භගවා ආයස්මන්තං සාරිපුත්තං ආමන්තෙසි: “තස්මාතිහ{2 යස්මා - ස්යා.} ත්වං සාරිපුත්ත ඉමං ධම්මපරියායං අභික්ඛණං භාසෙය්යාසි භික්ඛූනං භික්ඛුනීනං උපාසකානං උපාසිකානං. යෙසම්පි හි සාරිපුත්ත මොඝපුරිසානං භවිස්සති තථාගතෙ කඞ්ඛා වා විමති වා තෙසමිමං{3 තෙසම්පි ඉමං - PTS. තෙසම්පි මං - ස්යා.} ධම්මපරියායං සුත්වා යා තථාගතෙ කඞ්ඛා වා විමති වා සා පහීයිස්සතී”ති. "
            },
            {
                "type": "paragraph",
                "text": "ඉති හිදං ආයස්මා සාරිපුත්තො භගවතො සම්මුඛා සම්පසාදං පවෙදෙසි. තස්මා ඉමස්ස වෙය්යාකරණස්ස සම්පසාදනීයන්ත්වෙව අධිවචනන්ති."
            },
            {
                "type": "centered",
                "text": "සම්පසාදනීයසුත්තං නිට්ඨිතං පඤ්චමං.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "pages": {
            "166": {
                "pageNum": 166,
                "footnotesCount": 3
            },
            "168": {
                "pageNum": 168,
                "footnotesCount": 7
            },
            "170": {
                "pageNum": 170,
                "footnotesCount": 6
            },
            "172": {
                "pageNum": 172,
                "footnotesCount": 11
            },
            "174": {
                "pageNum": 174,
                "footnotesCount": 3
            },
            "176": {
                "pageNum": 176,
                "footnotesCount": 2
            },
            "178": {
                "pageNum": 178,
                "footnotesCount": 2
            },
            "180": {
                "pageNum": 180,
                "footnotesCount": 1
            },
            "182": {
                "pageNum": 182,
                "footnotesCount": 6
            },
            "184": {
                "pageNum": 184,
                "footnotesCount": 1
            },
            "186": {
                "pageNum": 186,
                "footnotesCount": 3
            },
            "188": {
                "pageNum": 188,
                "footnotesCount": 6
            },
            "190": {
                "pageNum": 190,
                "footnotesCount": 0
            },
            "192": {
                "pageNum": 192,
                "footnotesCount": 3
            }
        }
    },
    {
        "filename": "1-9-10-44-77",
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "167"
            },
            {
                "type": "centered",
                "text": "5.",
                "level": 3
            },
            {
                "type": "heading",
                "text": "සම්පසාදනීය සූත්‍රය",
                "level": 3
            },
            {
                "format": 15,
                "text": "ශාරිපුත්‍ර සිංහනාදය",
                "type": "centered",
                "level": 1
            },
            {
                "format": 13,
                "text": "1. මා විසින් මෙසේ අසන ලදී:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ නාලන්දා නුවර සමීපයේ වූ පාවාරික සිටුහුගේ අඹ වෙනෙහි වැඩ වසන සේක. එ කල්හි සැරියුත් තෙරණුවෝ භාග්‍යවතුන් වහන්සේ කරා එළැඹියහ. එළැඹ ඔබ වැඳ එකත්පස වැ උන්හ. සැරියුත් තෙරණුවෝ එසේ එකත් පස්වැ උන්නාහු ම ‘වහන්ස, යම සම්බෝධිඥානයෙක් වේ ද, එහි ලා (එයින්) භාග්‍යවතුන් වහන්සේට වැඩි තරම් නුවණ ඇති අන් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ පෙරත් නො වීය, මතුත් නො වන්නේ ය, දැනුත් නැතැ යි මෙස් භාග්‍යවතුන් වහන්සේ කෙරේ පැහැදුණෙම් වෙමි’ යි මෙ වචන වදාළහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“ශාරිපුත්‍රයෙනි, ‘වහන්ස, යම සම්බෝධිඥානයෙක් වේ ද, එයින් භාග්‍යවතුන් වහන්සේට වැඩි තරම් නුවණ ඇති අන් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ පෙරත් නො වීය, මතුත් නො වන්නේ ය, දැනුත් නැතැ’ යි මෙසේ භාග්‍යවතුන් වහන්සේ කෙරෙහි පැහැදුණෙම් වෙමි’ යි තොප විසින් උදාර වූ අභීත වචනයෙක් කියන ලද. ඒකාන්තයෙක් ගන්නා ලද. සිංහනාදයෙක් පවත්වන ලද. කිමෙක් ද ශාරිපුත්‍රයෙනි, ඉකුත් කල්හි යම් අර්හත් සම්මාසම්බුදු කෙනෙක් වූහු ද ඒ සියලු භගවත්හු ඔවුන් වහන්සේගේ සිත් තොප සිතින් පිරිසිඳ ‘ඒ භගවත්හු මෙබඳු සිල් ඇත්තෝ වූහයි, මෙබඳු දහම් ඇත්තෝ වූහ යි, ඒ භගවත්හු මෙස් වූ ප්‍රඥා ඇත්තෝ වූහ යි, ඒ භගවත්හු මෙබඳු විහරණ ඇත්තෝ වූහ යි, ඒ භගවත්හු මෙබඳු විමුක්තියක් ඇත්තෝ වූහ’ යි කියා තොප විසින් දැනගන්නා ලද්දාහු දැ?” යි භාග්‍යවතුන් වහන්සේ අසා වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වහන්ස මෙය එසේ දැනගන්නා ලද්දේ නො වේ” යැ යි තෙරණුවෝ වදාළහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“කිම ශාරිපුත්‍රයෙනි, ‘මතු කල්හි යම් අර්හත් සම්මාසම්බුදු කෙනෙක් වන්නාහු නම්, ඒ භගවත්හු මෙ බඳු සිල් ඇත්තෝ වන්නාහ, මෙබඳු දහම් ඇත්තෝ වන්නාහ … මෙබඳු විමුක්ති ඇත්තෝ වන්නාහ’ යි ඔවුන් වහන්සේගේ සිත් තොප සිතින් පිරිසිඳ ඒ භගවත්හු තොප විසින් දන්නා ලද්දාහු දැ” යි භාග්‍යවතුන් වහන්සේ අසා වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "169"
            },
            {
                "format": 13,
                "text": "“මෙය එසේ නො දන්නා ලදැ” යි තෙරණුවෝ වදාළහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“කිම ශාරිපුත්‍රයෙනි, මෙ සමයෙහි මම් අර්හත් සම්‍යක්සම්බුද්ධ වෙමි. මේ භගවත්හු මෙසේ වූ සිල් ඇත්තෝය, මෙසේ වූ දහම් ඇත්තෝ ය, මෙසේ වූ ප්‍රඥා ඇත්තෝය, මෙසේ වූ විහරණ ඇත්තෝය, මෙසේ වූ විමුකති ඇත්තෝ යැ යි ද මා සිත තොප සිතින් පිරිසිඳ දැනගන්නා ලද දැ?” යි භාග්‍යවතුන් වහන්සේ පුළුවුත් සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“මෙය එසේ නො ම දැනගන්නා ලදැ” යි තෙරණුවෝ වදාළහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“ශාරිපුත්‍රයෙනි, මෙහි ලා ඉකුත් කලැ වූ ද, මතු කල්හි වන්නාවූ ද, දැන් ඇත්තාවූ ද රහත් සම්මාසම්බුදුවරුන් විෂයයෙහි ඔවුන් සිත් පිරිසිඳ දැන්මෙක් තොපට නැත. එසේ කලැ කවර නම් සැටියෙකින් තොප විසින් ‘වහන්ස, යම් සම්බෝධිඥානයෙක් වේ ද එයින් භාග්‍යවතුන් වහන්සේට වැඩි තරම් නුවණ ඇති අන් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ පෙරත් නො වී ය, මතුත් නොවන්නේ ය, දැනුත් නැතැ යි මෙසේ භාග්‍යවතුන් වහන්සේ කෙරෙහි පැහැදුණෙම් වෙමි’ යි තොප විසින් මේ උදාර වූ ශ්‍රේෂ්ඨ වචනය කියන ලද ද? ඒකාංශය ගන්නා ලද ද, සිංහනාදය පවත්වන ලද දැ?” යි භාග්‍යවතුන් වහන්සේ පුළුවත් සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වහන්ස, අතීත අනාගය වර්තමාන රහත් සම්මාසම්බුදුවරුන් විෂයයෙහි ඔබ සිත් පිරිසිඳ දන්නා නුවණෙක් මට නැත. වහන්ස, එහෙත් මට අනුමානඥානය ප්‍රකට ව ඇත. වහන්ස, යම්සේ රජක්හුගේ තර වූ පවුරුපා ඇති, දැඩි පවුරු තොරණ ඇති, එක් දොරක් ඇති පසල් නුවරෙක් වන්නේ ද, එහි නොදන්නා ලදුවන් වළක්වන, දන්නා ලදුවන් පිවිස්වන, පණ්ඩිත වූ ව්‍යක්ත වූ, නුවණ ඇති ද්වාරපාලයෙක් වන්නේ ද, හෙ තෙම් එනුවර හාත්පසැ පවුරු මඟ ඔස්සේ යනුයේ ප්‍රාකාරසන්ධියක් (ගඩොළු දෙකක් ගිලිහී ගිය තැනක්) හෝ ප්‍රාකාර විවරයක් (පවුර සිඳීගිය තැනක්) හෝ යටත් පිරිසෙයින් බළලකු රිංගා පිට වන පමණ සිදුරකුදු නො දක්නේ ද, එවිට ඔහුට යම් මහත් සත්ත්ව කෙනෙක් මෙ නුවරට වදනාහු නම්, මෙයින් නික්මෙන්නාහු නම් හෝ, උහු හැම මේ දොරින් ම පිවිසෙන්නෝ ද නික්මෙන්නෝ ද වෙත්’ යැ යි මෙසේ සිතෙක් වන්නේද, එ පරිද්දෙ ම වහන්ස, ගිය කලැ යම් රහත් සම්මාසම්බුදු කෙනෙක් වූහු ද, ඒ සියලු භගවත්හු ම සිත කෙලසන, නුවණ දුඹුල් කරන, පංච නීවරණයන් දුරු කොට, සිවු සීවටන්හි මොනොවට පිහිටි සිතැත්තෝ, සම්බෝධ්‍යංග සත තත් වූ පරිදි වඩා, නිරුත්තර සම්‍යක් සම්බෝධිය ලදුවහ. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "171"
            },
            {
                "type": "paragraph",
                "text": "මතු කලැ යම් රහත් සම්මාසම්බුදු කෙනෙක් වන්නාහු නම් ඒ භගවත්හු ද සිත කෙලෙසන නුවණ දුබල කරන පංච නීවරණයන් දුරැලා, සතර සීවටන්හි සුපිහිටි සිතැත්තෝ, සත් සම්බෝධ්‍යඞ්ග තත්වූ පරිදි වඩා නිරුත්තර සම්‍යක්සම්බෝධිය ලබන්නාහ. වහන්ස, මෙ සමයෙහි රහත් සම්මා සම්බුදු වූ භාග්‍යවතුන් වහන්සේ ද සිත කිලිටි කරන නුවණ දුබල කරන පංචනීවරණයන් දුරැලා සතර සීවටන්හි සුපිහිටි සිතැති ව, නිසි ලෙසින් සත් සම්බෝධ්‍යංග වඩා නිරුත්තර සම්‍යක්සම්බෝධිය ලද සේකි” යි අනුමාන දැන්ම මට ප්‍රකට විය."
            },
            {
                "format": 13,
                "text": "2. වහන්ස, මෙහි මම් දහම් අසනු පිණිස භාග්‍යවතුන් වහන්සේ වෙත එළැඹියෙමි. වහන්ස, ඒ මට යම්සේ භාග්‍යවතුන් වහන්සේ වඩ වඩා උතුම් ලෙස, වඩ වඩා ප්‍රණීත ලෙස, ප්‍රතිබාහන සහිත කොට කුශලාකුශල ධර්මයන් (කුසලුන් ප්‍රතිබාහනය කොට අකුසල් ද අකුසලුන් ප්‍රතිබාහනය කොට කුසලුන් ද සිටුනා නියාව ඔවුනට සරි ලෙස ලැබෙන විපාක ද සහිත කොට) දෙසූ සේක් ද, ඒ ඒ සැටියෙන් ඒ දෙසූ ධර්මයෙහි එක්තරා ධර්මයක් වෙසෙයි නුවණින් දැන සිවුසස් දහම්හි නිෂ්ඨාවට පැමිණියෙමි. ‘ඒකාන්තයෙන් ඒ භාග්‍යවතුන් වහන්සේ සම්‍යක්සම්බුද්ධ සේක, භාග්‍යවතුන් වහන්සේ විසින් ධර්මය මොනොවට වදාරන ලද්දේය. ඔබගේ ශ්‍රාවක සංඝයාද සුප්‍රතිපන්න යැ’ යි ශාස්තෲන් වහන්සේ කෙරෙහි පැහැදුණෙමි.",
                "type": "paragraph"
            },
            {
                "format": 21,
                "text": "කුශල ධර්ම දේශනා",
                "type": "centered",
                "level": 1
            },
            {
                "format": 13,
                "text": "3. වහන්ස, යම්සේ භාග්‍යවතුන් වහන්සේ කුශලධර්ම විෂයයයෙහි දහම් දෙසන සේක්ද, මෙය ඔබ කෙරෙහි වූ අන් අනුත්තරිය (එයට වැඩි අන් එකක්හු නැති) ගුණයෙකි. එහි ලා සතර සීවටන්හුය, සතර සම්‍යක්ප්‍රධානයෝ ය, සතර ඍද්ධිපාදයෝ ය, පංච ඉන්ද්‍රියයෝ ය, පංච බලයෝ ය, සප්ත බෝධ්‍යඞ්ගයෝ ය, ආර්යඅෂ්ටාඞ්ගික මාර්ගය ය යන මොහු ඒ කුශලධර්මයෝ ය. වහන්ස, මෙහි භික්ෂූ තෙම ආස්‍රව නැසීමෙන් අනාස්‍රව වූ චෙතොවිමුක්තිය (ඵලසමාධිය) ද, ප්‍රඥාවිමුක්තිය (ඵල ඤාණය) ද, මෙ අත්බව්හි දී ම තෙමේ ම වෙසෙසි නුවණින් පසක් කොට ලැබගෙන වෙසෙයි. එය භාග්‍යවතුන් වහන්සේ සර්වප්‍රකාරයෙන් ම වෙසෙසි නුවණින් දන්නා සේක. මෙය කුශලධර්ම විෂයයෙහි භාග්‍යවතුන් වහන්සේගේ අනුත්තරිය ගුණයෙකි. යමක් දන්නා අන් මහණෙක් හෝ බමුණෙක් හෝ භාග්‍යවතුන් වහන්සේට වඩා කුශල ධර්ම විෂයයෙහි දන්නෙක් ඇතැයි නො කියැ හැක්ක. ඒ හැම නිශ්ශෙෂයෙන් වෙසෙසි නුවණින් දන්නා භාග්‍යවතුන් වහන්සේ විසින් එයින් මත්තෙහි දතයුතු දැයෙක් නැත.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "173"
            },
            {
                "format": 21,
                "text": "ආයතනප්‍රඥප්ති",
                "type": "centered",
                "level": 1
            },
            {
                "format": 13,
                "text": "4. වහන්ස, භාග්‍යවතුන් වහන්සේ ආයතන ප්‍රඥප්ති විෂයයෙහි යම්සේ දහම් දෙසන සේක් ද, මෙය ද අන් අනුත්තරිය ගුණයෙකි. වහන්ස, භාග්‍යවතුන් වහන්සේ වදාළ මේ ආධ්‍යාත්මික බාහිර ආයතන සයෙකි. ඇස ද රූප ද, කන ද හඬ ද, නැහැය ද ගඳ ද, දිව ද රස ද, කය ද හැපෙන දෑ ද, මනස ද දහම් ද යන මොහුය. වහන්ස, මෙය ආයතන ප්‍රඥප්ති විෂයයෙහි භාග්‍යවතුන් වහන්සේගේ අනුත්තරීය ගුණයෙකි. එය භාග්‍යවතුන් වහන්සේ නිශ්ශෙෂයෙන් වෙසෙසි නුවණින් දන්නා සේක. ආයතන ප්‍රඥප්ති විෂයයෙහි යමක් දන්නා අන් මහණකු හෝ බමුණකු හෝ භාග්‍යවතුන් වහන්සේට වඩා දැනුම් ඇත්තකු වෙතැයි නො කියැ හැක්ක. ඒ සියල්ල නිශ්ශෙෂ කොට වෙසෙසි නුවණින් දන්නා භාග්‍යවතුන් වහන්සේ විසින් එයින් මත්තෙහි (ඒ සම්බන්ධයෙන්) දත යුතු දැයෙක් නැත.",
                "type": "paragraph"
            },
            {
                "format": 21,
                "text": "ගර්භාවක්‍රාන්ති දේශනා",
                "type": "centered",
                "level": 1
            },
            {
                "format": 13,
                "text": "5. වහන්ස, භාග්‍යවතුන් වහන්සේ ගර්භාවක්‍රාන්ති විෂයයෙහි යම්සේ දහම් දෙසන සේක් ද, මෙය ද අන් අනුත්තරීය ගුණයෙකි. වහන්ස, (භාග්‍යවතුන් වහන්සේ වදාළ) මේ ගර්භාවක්‍රාන්ති සතරෙකි: මෙහි එක්තරා සත්වයෙක් දැනුම් නැත්තේ (සිහිමුළා ව) මවු කුස පිවිසෙයි. දැනුම් නැත්තේ මවු කුසෙහි වෙසෙයි, දැනුම් නැත්තේ මවු කුසින් නික්මෙයි. මේ පළමු ගර්භාවක්‍රාන්තිය යි. තව ද වහන්ස, මෙහි එක්තරා සත්ත්වයෙක් දැනුම් ඇත්තේ මවු කුස වදී. දැනුම් නැත්තේ මවු කුසැ වෙසෙයි, දැනුම් නැත්තේ මවු කුසින් බිහි වෙයි. මේ දෙවෙනි ගර්භාවක්‍රාන්තිය යි. තව ද, වහන්ස, මෙහි එක්තරා සත්ත්වයෙක් දැනුම් ඇත්තේ මවු කුස පිවිසෙයි, දැනුම් ඇත්තේ මවු කුසැ වෙසෙයි, දැනුම් නැත්තේ මවු කුසින් බිහි වෙයි. මේ තෙවෙනි ගර්භාවක්‍රාන්තිය යි. තව ද මෙහි එක්තරා සත්වයෙක් දැනුම් ඇත්තේ මවු කුස පිවිසෙයි, දැනුම් ඇත්තේ මවු කුසැ වෙසෙයි, දැනුම් ඇත්තේ මවු කුසින් බිහි වෙයි. වහන්ස, ගර්භාවක්‍රාන්ති විෂයයෙහි මේ දැනීම අනුත්තරිය ගුණයෙකි.",
                "type": "paragraph"
            },
            {
                "format": 21,
                "text": "ආදේශනවිධා දේශනා",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "6. වහන්ස, තව ද ආදේසනා කොට්ඨාස විෂයයෙහි මෙරමා සිත් පවත්නා සැටි බලා යම්සේ භාග්‍යවතුන් වහන්සේ දහම් දෙසනා සේක් ද, මෙය ද භාග්‍යවතුන් වහන්සේ කෙරෙහි වූ අනුත්තරීය ගුණයෙකි. වහන්ස, මේ ආදේසනා කොටස්හු සතර දෙනෙකි. වහන්ස, එක්තරා එකෙක් ‘තා මනස මෙසේ ය, තා මනස මෙබඳුය. තා සිත මෙසේ යැ’ යි නිමිත්තෙන් කියා පායි. ඔහු බොහෝ වුව ද කියත් නමුදු ඒ එසේ ම වේ, අන් සැටියෙකින් නොවේ. මේ පළමු වැනි ආදේසනා කොට්ඨාසය යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "175"
            },
            {
                "format": 13,
                "text": "තව ද වහන්ස, මෙහි ඇතැම් එකෙක් නිමිත්තෙන් මෙරමා පැවැතුම් දැන නො ම කියයි. වැලිදු මනුෂ්‍යයන්ගේ හෝ අමනුෂ්‍යයන්ගේ හෝ දේවතාවන්ගේ කථා ශබ්දය අසා ‘තා මනස මෙසේ ය, තා මනස මෙබඳු ය, තා සිත මෙසේ යැ’යි කියා පායි. ඔහු බොහෝවක් ම කියතුදු ඒ එසේ ම වෙයි, අන් සැටියෙකින් නො වෙයි. මේ දෙවෙනි ආදේසනා කොට්ඨාසය යි. වහන්ස, තව ද එක්තරා එකෙක් නිමිත්තෙන් නො ම කියයි. මිනිසුන්ගේ හෝ නොමිනිසුනගේ හෝ දෙවියන්ගේ කතා හඬ අසා ද නො කියයි. වැලිදු විතර්ක කරන, විචාර කරන තැනැත්තහුගේ විතර්ක විචාර ශබ්දය අසා ‘තා මනස මෙසේ ය, තා මනස මෙබඳු ය, තා සිත මෙසේ යැ’යි ප්‍රකාශ කෙරෙයි. ඔහු බොහෝවක් ම කියතුදු ඒ එසේ ම වෙයි. අන් පරිද්දෙකින් නො වෙයි, මේ තුන්වැනි ආදේසනා කොට්ඨාසය යි. තව ද වහන්ස, මෙහි එක්තරා පුද්ගලයෙක් නිමිනත්තෙනුදු නො ම කියයි, මිනිසුන්ගේ හෝ නොමිනිසුනගේ හෝ දේවතාවන්ගේ හෝ ශබ්දය අසා නො ද කියයි. විතර්ක කරන විචාර කරන තැනැත්තක්හුගේ විතර්ක විචාර ශබ්දය අසා ද නො ම කියයි. වැලිදු විතර්ක විචාර සහිත සමාධියට සමවන්නක්හුගේ සිත ‘මේ භවත්හුගේ මනස් සංස්කාරයෝ යම්සේ පිහිටියාහු ද, එසේ මේ සිතට අනතුරු ව මෙ නම් කල්පනාවක් කරන්නේ යැ’යි සිය සිතින් පිරිසිඳ දනී. ඔහු බොහොවක් කියතුදු ඒ එසේ ම වෙයි, අන් සැටියෙකින් නො වෙයි. මේ සිවුවැනි ආදේසනා භාගය යි. වහන්ස, ආදේශනා භාග විෂයයෙහි (අනුන්ගේ අදහස් දැන කීම් අතුරෙහි) මේ භාග්‍යවතුන් වහන්සේගේ ආදේශන භාගය ම අනුත්තරිය වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 21,
                "text": "දර්ශනසමාපත්ති දේශනා",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "7. වහන්ස, දර්ශනසමාපත්ති විෂයයෙහි භාග්‍යවතුන් වහන්සේ යම්සේ දහම් දෙසන සේක් ද, වහන්ස, මෙය ම අනුත්තරිය වෙයි. වහන්ස මෙහි දර්ශනසමාපත්තිහු සතර දෙනෙක් වෙත්. වහන්ස, මෙහි ඇතැම් මහණෙක් හෝ බමුණෙක් හෝ උත්සාහ කොට, වීර්ය කොට, පුන පුනා වැර වඩා, සම්‍යක් මනස්කාරය නිසා (නුවණ නිසා) යම් සමාධියෙකින් සිත මනා වැ පිහිටි කල්හි පත්ලෙන් උඩ හිස කෙහෙ මතුයෙන් යටැ සම හිම් කොටැති නන් අයුරු අශුචියෙන් පිරුණු මෙ ම සිරුර නුවණින් සලකා බලා ද එසේ වූ (ප්‍රථමධ්‍යාන) චිත්ත සමාධිය ස්පර්ශ කෙරෙයි. හේ එයින් ‘මෙ කයෙහි කෙස් ඇත, ලොම් ඇත, නිය දත් සම නහර ඇට ඇටමිදුළු වකුගඩු හදමස අක්මාව දළබුව බඩදිව පපුමස අතුනු අතුනුබහන නොදිරූ අහර මල පිත සෙම පූයා ලේ ඩහදිය මේද තෙල කඳුළු වුරුණුතෙල කෙල සොටු සඳමිදුලු මූත්‍ර ඇතැ’ යි මේ අශුචීන් පස් විකයි. මේ පළමුවන දර්ශන සමාපත්තිය ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "177"
            },
            {
                "format": 13,
                "text": "වහන්ස, තවද මෙහි එක්තරා මහණෙක් හෝ බමුණෙක් හෝ උත්සාහ කොට … යම් සමාධියෙකින් සිත මනාවැ පිහිටි කල්හි ‘මෙ කයෙහි කෙස් ඇත, ලොම් ඇත. නිය ඇත, දත් ඇත … සඳමිදුලු ඇත, මූත්‍ර ඇතැ’ යි පත්ලෙන් උඩ හිසැකේ මත්තෙන් යට, සම ඉම් කොට නන් අයුරු අශුචියෙන් පිරුණු මේ කයත් නුවණින් බලයි ද, පුරුෂයාගේ සිවි මස් ලේ ඉක්මැ ඇට නුවණින් බලයි ද, මේ (ඇට අරමුණුකොට ඉපැදැවූ දිවැස පාදක කොටැති ධ්‍යානසමාපත්තිය) දෙවෙනි දර්ශනසමාපත්තිය යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, තවද මෙහි ඇතැම් මහණෙක් හෝ බමුණෙක් හෝ උත්සාහ කොට … යම් සමාධියෙකින් සිත මනාවැ පිහිටි කල්හි ‘මෙ කයෙහි කෙස් ඇත, ලොම් ඇත, නිය ඇත … සඳමිදුලු ඇත, මූත්‍ර ඇතැ’ යි පත්ලෙන් උඩ හිසකේ මත්තෙන් යට සම හිම් කොට, නන් අයුරු අශුචියෙන් පිරුණු මේ කයත් නුවණින් බලයි ද, පුරුෂයාගේ සිවි මස් ලේ ඉක්මැ ඇට නුවණින් බලයි ද, මේ පූර්වභාග අපරභාග යන දෙපසින් අතරැ නොසිඳී පැවැති, මෙලොවැ ද පිහිටි පරලොව්හි ද පිහිටි පුරුෂයාගේ විඥාන ස්‍රොතස දනී ද මේ (ශෛක්ෂ පෘථග්ජනයන්ගේ චෙතස්පර්‍ය්‍යායඥානය) තෙවෙනි දර්ශනසමාපත්තිය ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "තව ද වහන්ස, මෙහි එක්තරා මහණෙක් හෝ බමුණෙක් හෝ උත්සාහ කොට … සඳමිදුලු ඇත, මූත්‍ර ඇතැයි … නුවණින් බලයි ද, පුරුෂයාගේ සිවි මස් ලේ ඉක්මැ ඇට පස්විකයිද, (පූර්වාපර භාග වශයෙන්) දෙපසින් ම අතරැ නොසිඳුණු ඡන්දරාගවශයෙන් මොලව්හි ද නොපිහිටි, පරලොව්හි ද නොපිහිටි පුරුෂයාගේ විඥාන ස්‍රොතස දනී. මේ (රහත්හුගේ චෙතස්පර්යායඥානය) සතර වන දර්‍ශන සමාපත්තිය ය. වහන්ස, දර්ශනසමාපත්ති විෂයයෙහි භාග්‍යවතුන් වහන්සේගේ මේ ධර්ම දේශනාව අනුත්තරිය ය.",
                "type": "paragraph"
            },
            {
                "format": 21,
                "text": "පුද්ගලප්‍රඥප්ති දේශනා",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "8. වහන්ස, තවද භාග්‍යවතුන් වහන්සේ පුද්ගල ප්‍රඥප්ති විෂයයෙහි යම්සේ දහම් දෙසන සේක් ද, මෙය අනුත්තරීය ය. වහන්ස, උභතෝභාගවිමුක්ත ය, ප්‍රඥාවිමුක්ත ය, කායසාත්ෂී ය, දෘෂ්ටිප්‍රාප්ත ය, ශ්‍රද්ධාවිමුක්ත ය, ධර්මානුසාරී ය, ශ්‍රද්ධානුසාරී යැ යි මේ පුද්ගලයෝ සත් දෙනෙකි.",
                "type": "paragraph"
            },
            {
                "format": 21,
                "text": "ප්‍රධාන දේශනා",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "9. වහන්ස, තවද ප්‍රධාන (භාවනානුයොග) විෂයයෙහි භාග්‍යවතුන් වහන්සේ යම්සේ දහම් දෙසනා සේක් ද මෙය අනුත්තරීය ය. වහන්ස, සතිසම්බොජ්ඣඞ්ගය, ධම්මවිචයසම්බොජ්ඣඞ්ගය, විරියසම්බොජ්ඣඞ්ගය, පීතිසම්බොජ්ඣඞ්ගය පස්සද්ධිසම්බොජ්ඣඞ්ගය, සමාධිසම්බොජ්ඣඞ්ගය, උපෙක්ඛා සම්බොජ්ඣඞ්ගයැ යි මේ සම්බොධ්‍යඞ්ග සතෙකි. ප්‍රධාන විෂයයෙහි භාග්‍යවතුන් වහන්සේගේ මේ ධර්ම දේශනාව අනුත්තරීය ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "179"
            },
            {
                "format": 21,
                "text": "ප්‍රතිපත්ති දේශනා",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "10. වහන්ස, තව ද ප්‍රතිපත්ති විෂයයෙහි භාග්‍යවතුන් වහන්සේ යම්සේ දහම් දෙසන සේක් ද මෙය අනුත්තරීය ය. දන්ධාභිඤ්ඤ දුක්ඛපටිපදා ය, ඛිප්පාභිඤ්ඤ දුක්ඛ පටිපදා ය, දන්ධාභිඤ්ඤ සුඛපටිපදා ය, ඛිප්පාභිඤ්ඤ සුඛපටිපදා යැ යි මේ ප්‍රතිපත්ති සතරෙකි. මොවුන්ගෙන් යම් දන්ධාභිඤ්ඤ දුක්ඛපටිපදාවෙක් ඇද්ද, මෙය දුක් බැවින් ද දන්ධ බැවින් දැ යි යන දෙ කරුණින් ම හීන යැ යි කියනු ලැබේ. වහන්ස එහි යම් ඛිප්පාභිඤ්ඤ දුක්ඛ පටිපදාවෙක් ඇද්ද මෙය දුක් බැවින් හීන යැයි කියනු ලැබේ. වහන්ස, එහි යම් දන්ධාභිඤ්ඤ සුඛ පටිපදාවෙක් ඇද්ද, මෙය දන්ධ බැවින් හීන යැ යි කියනු ලැබේ. වහන්ස, එහි යම් ඛිප්පාභිඤ්ඤ සුඛපටිපදාවෙක් ඇද්ද, මෙය සුඛ බැවින් ද, ඛිප්පාභිඤ්ඤ බැවින් දැ යි දෙ කරුණින් ම උතුමැ යි කියනු ලැබේ. වහන්ස, ප්‍රතිපත් විෂයයෙහි භාග්‍යවතුන් වහන්සේගේ මේ ධර්මදේශනාව අනුත්තරීය ය.",
                "type": "paragraph"
            },
            {
                "format": 21,
                "text": "භස්සසමාචාරාදි දේශනා",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "11. තව ද අනෙකෙක. වහන්ස, භාග්‍යවතුන් වහන්සේ වාක්සමාචාර විෂයයෙහි (කථාකිරීම පිළිබඳ ව) යම්සේ දහම් දෙසන සේක් ද මෙය අනුත්තරීය ය. වහන්ස, මෙහි එක්තරා මහණෙක් අතරතුරැ මුසවා මුසු කළ බස් නො බෙණෙයි. උනුන් බිඳුවන බස් නො බෙණෙයි. කේලාම් බස් නො බෙණෙයි. (එකට දෙකක් කෙරෙමි යි) සැහැසීමෙන් උනුන් කතා නො කියයි. දිනීම අපේක්ෂා කොට ඇති ව නො කියයි. නුවණින් පිරික්සා සුදුසු කාලයෙහි සිතැ තබා ගත යුතු බස් කියයි. වහන්ස, වාක් සමාචාර විෂයයෙහි මය අනුත්තරීය යැ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "12. තව ද අනෙකෙක. වහන්ස, භාග්‍යවතුන් වහන්සේ ඒ ඒ පුද්ගලයන්ගේ පිරිසිදු ශීල විෂයයෙහි ද පිරිසිදු මනඃසමාචාර විෂයයෙහි ද යම්සේ දහම් දෙසනසේක් ද මෙය අනුත්තරීය යැ. වහන්ස, මෙහි එක්තරා මහණෙක් (ශීලයෙහි ද මනඃ සමාචාරයෙහි ද පිහිටියේ) සත්‍ය කථා ඇත්තේ ද සැදැහැ ඇත්තේ ද වන්නේ ය. කුහක නො වන්නේ ය. චාටු කථා නො කියන්නේ ය. ප්‍රත්‍යයාශායෙන් ඉඟි දෙඩුම් නො දොඩන්නේ ය, ලාභාශායෙන් මෙරමාට ගරහන්නෙක් ද නොවන්නේ ය. ලාභයෙන් ලාභය සොයන්නෙක් ද නොවන්නේ ය. ඉඳුරන්හි වැසූ දොරැත්තෙක් වන්නේ ය, බොජුනෙහි පමණ දන්නෙක් වන්නේ ය. (විෂමාචාර හැර) සම ව හැසිරෙන්නෙක් වන්නේ ය. නිදි දුරැලීමෙහි යෙදුණෙක් වන්නේ ය. අලස නො වූයෙක්, රුකුළු වැර ඇතියෙක්, ධ්‍යානයෙහි ඇලුණෙක්, සිහි ඇතියෙක්, කලණ නුවණ ඇතියෙක්, සුන්දර ප්‍රතිභාන සම්පත් ඇතියෙක්, ගතිමතෙක් (නොඇසූ දහම් දැන ගැන්මෙහි සමත් නුවණැතියෙක්) ධෘතිමතෙක් (ධාරණයෙහි සමත් ප්‍රඥා ඇතියෙක්) මතිමතෙක් (අනුමාන ප්‍රඥා ඇතියෙක්) වන්නේය. කාමයන්හි ගිජුවූයෙක් නො වන්නේ ය. (අභික්‍රමණාදියෙහි) එළඹ සිටි සිහි ඇත්තේ, අභික්‍රමණාදි සත් තන්හි පැවැති විවසුන් නුවණ ඇත්තේ වන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, පුරුෂශිල සමාචාර විෂයයෙහි මෙය අනුත්තරීය යැ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "181"
            },
            {
                "format": 21,
                "text": "අනුශාසනවිධා දේශනා",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "13. තව ද අනෙකෙක. වහන්ස, අනුශාසන කොටස්හි භාග්‍යවතුන් වහන්සේ යම්සේ දහම් දෙසනා සේක් ද, මෙය අනුත්තරීය යැ. වහන්ස, මේ අනුශාසන විධා සතරෙක: මේ පුඟුල් තෙමේ අනුශාසන පරිදි පිළිපදිනුයේ, තුන් සංයෝජනයන් නැසීමෙන්, අපායෙහි නොවැටෙන සුලු වූ, ධර්මයෙන් නියත වූ, ඉදිරි තුන් මඟට අවශ්‍යයෙන් පැමිණියැ යුතු සෝවාන් පුඟුලෙක් වන්නේ යැ’ යි භාග්‍යවතුන් වහන්සේ යෝනිසෝමනස්කාරයෙන් අන් පුඟුලා තමන් වහන්සේ ම දන්නා සේක. මේ පුඟුල් තෙම තුන් සංයෝජනයන් නැසීමෙන් රාග ද්වේෂ මෝහයන් තුනී කිරීමෙන් සකෘදාගාමී වන්නේ ය, එක් වරක් ම මේ ලෝකයට අවුත් දුක් කෙළවර කරන්නේ යැ’ යි භාග්‍යවතුන් වහන්සේ යෝනිසෝමනස්කාරයෙන් තමන් වහන්සේ ම අන් පුඟුලා දන්නා සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මේ පුඟුල් තෙම ඔරම්භාගීය සංයෝජන නැසීමෙන් මරණින් මතු ශුද්ධාවාසයෙහි උපදින, එහිදී පිරිනිවෙන සුලු, එ ලොවින් මෙහි පෙරළා නො එන සුලු අනාගාමියෙක් වන්නේයැ’ යි භාග්‍යවතුන් වහන්සේ යෝනිසෝමනස්කාරයෙන් තමන් වහන්සේ ම අන් පුඟුල්හු දන්නා සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘මේ පුඟුල් තෙම ආස්‍රවයන් නැසීමෙන් අනාස්‍රව වූ ඵල සමාධිය ද ඵල ප්‍රඥාව ද මෙ අත්බව්හි ම තෙමේ ම වෙසෙසි නුවණින් දැන, පසක් කොට, ලැබ වසන්නේ යැ’යි භාග්‍යවතුන් වහන්සේ යෝනිසෝමනස්කාරයෙන් තමන් වහන්සේ ම අන් පුඟුල්හු දන්නා සේක. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, අනුශාසනවිධාවන්හි මෙය අනුත්තරීය ය.",
                "type": "paragraph"
            },
            {
                "format": 21,
                "text": "පරපුද්ගල විමුක්තිඥාන දේශනා",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "14. වහන්ස, තව ද සෝවාන් ආදී අන් පුඟුලන් ඒ ඒ මඟින් කෙලෙසුන් ගෙන් මිදෙනු දැන්මෙහි යම්සේ භාග්‍යවතුන් වහන්සේ දහම් දෙසන සේක් ද, මෙය අනුත්තරීය ය. වහන්ස, මේ පුඟුල් තෙමෙ තුන් සංයෝජනයන් නැසීමෙන් අවාහි නොවැටෙන සුලු, රහත් බවට නියත වූ, උපරිමාර්ගත්‍රය සංඛ්‍යාත සම්බෝධිය පරායණ කොටැත්තේ සෝවාන් වූයෙකැ’යි තමන් වහන්සේ ම දන්නා සේක. වහන්ස, ‘මේ පුඟුල් තෙමේ තුන් සංයෝජනයන් නැසීමෙන්, රාග ද්වේෂ මෝහයන් තුනී වීමෙන් සකෘදාගාමී වන්නේ යැ යි, එක් වරක් ම මේ ලොවට අවුත් දුක් කෙළවර කරන්නේ යැ’ යි භාග්‍යවතුන් වහන්සේ තමන් වහන්සේගේ ම උපාය මනස්කාරයෙන් අන් පුඟුලා දන්නා සේක.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "183"
            },
            {
                "format": 13,
                "text": "වහන්ස, මේ පුඟුල් තෙම ඔරම්භාගිය සංයෝජන පස නැසීමෙන් (ශුද්ධාවාසයෙහි) ඔපපාතික වැ උපදනේය, එහිදී ම පිරිනිවෙන්නේයැ. ඒ බඹලොවින් මේ කාමලෝකයට උත්පත්ති වශයෙන් පෙරැළී නොඑන සුලු යැ යි භග්‍යවතුන් වහන්සේ තමන් වහන්සේගේ උපාය මනස්කාරයෙන් ඒ අන් පුඟුලා දන්නා සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, ‘මේ පුඟුලා ආස්‍රවයන්ගේ ක්ෂයයෙන් ආස්‍රවරහිත වූ ඵලසමාධිය ද ඵලඥානය ද මෙ අත්බව්හිදී ම තෙමේ ම වෙසෙි නුවණින් දැන පසක් කොට ලැබ වසන්නේ යැ’ යි භාග්‍යවතුන් වහන්සේ තමන් වහන්සේගේ උපාය මනස්කාරයෙන් අන් පුඟුලා දැනගන්නා සේක. වහන්ස, අන්‍ය පුද්ගලයන්ගේ මිදීම දැන්මෙහි (භාග්‍යවතුන් වහන්සේගේ) මේ ගුණය අනුත්තරීය ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "15. තව ද වහන්ස, භාග්‍යවතුන් වහන්සේ ශාශ්වතවාද විෂයයෙහි යම්සේ දහම් දෙසනා සේක් ද, මෙය අනුත්තරීය ය. වහන්ස, (ඔබ වහන්සේ වදාළ පරිදි) මේ ශාශ්වත වාද තුනෙකි. වහන්ස, මෙහි කිසි මහණෙක් හෝ බමුණෙක් හෝ වීර්යය ප්‍රත්‍යය කොට ගෙන (වැර වඩා), උත්සාහය ප්‍රත්‍යය කොට ගෙන (උත්සාහ වඩා) පුන පුනා වීර්යයෙහි යෙදීමට පැමිණ, නොපමා බවට පැමිණ (එළැඹැ සිටි සිහිය නිසා), නුවණ නිසා, යම් සමාධියෙකින් සිත මනා වැ පිහිටි කල්හි අනේකවිධ වූ පෙරවුසූ කඳ පිළිවෙල සිහි කෙරෙයි ද, එසේ වූ චිත්තසමාධියක් ලබයි. ඒ මෙසේ යි: ‘අසෝ තැනැ වීමි, එහි මෙ නම් ඇතියෙම් වීමි, මෙ නම් ගෝත්‍ර ඇතියෙම් වීමි. මෙබඳු පැහැ ඇතියෙම් වීමි, මෙබඳු ආහාර ඇතියෙම් වීමි, මෙබඳු සුවදුක් විඳින්නෙම් වීමි, මෙතෙක් වයස් සීමා ඇතියෙම් වීමි, ඒ මම් එයින් සැව අසෝ තැනැ උපනිමි, එහිද මෙ නම් ඇතියෙම් වීමි, මෙ නම් ගෝත්‍ර ඇතියෙම් වීමි, මෙබඳු පැහැ ඇතියෙම් වීමි, මෙබඳු ආහාර ඇතියෙම් වීමි, මෙබඳු සුවදුක් විඳින්නෙම් වීමි, මෙතෙක් ආයු සීමාවක් ඇතියෙම් වීමි, ඒ මම් එයින් සැව මෙහි උපනිමි’ යි මෙසේ එක් ජාතියක් ද ජාති දෙකක් ද, ජාති තුනක්ද, ජාති සතරක් ද, ජාති පසක් ද, ජාති දශයක් ද, ජාති විස්සක් ද, ජාති තිසක් ද, ජාති සතළිසක් ද, ජාති පනසක් ද, ජාති සියයක්, ජාති දහසක් ද, ජාති සියදහසක් ද, නොයෙක් සියගණන් ජාතීන් ද, නොයෙක් දහස් ගණන් ජාතීන් ද, නොයෙක් සියදහස් ගණන් ජාතීන් ද, මෙසේ පැහැසටහන් ආදි ආකාර සහිත කොට නාම ගොත්‍ර වශයෙන් උද්දේශ සහිත කොට නොයෙක් වැදෑරුම් පෙරැ වුසූ කඳ පිළිවෙළ සිහි කෙරෙයි. හේ තෙමේ “ලෝකය නැසුණේ යැ යි හෝ හටගත්තේ යැ යි හෝ අතීත කාලය ද මම් දනිමි. ‘ලෝකය නැසෙන්නේ යැ යි ද හට ගන්නේ යැ’ යි ද අනාගත කාලය ද මම් දනිමි. ආත්මය ද ලෝකය ද ශාශ්වත ය වඳ ය (කිසිවක් නො උපදවන්නෝය), ගිරිකුළක් සේ නිසල වැ සිටියේ ය, ගැඹුරු වළ කැන සිටුවන ලද ඉඳු කිලක් සේ තහවුරු වැ සිටියේ ය. ඒ සත්වයෝ ම මෙයින් අන් තැනට දුවත්, භවයෙන් භවයට යෙත්, ච්‍යුත වෙත්, උපදිත්. (ආත්මයත් ලෝකයත්) මහා පෘථිවි ආදි ශාශ්වතීනට (සදාභාවී වස්තූනට) සම ව විද්‍යමාන මැ යැ” යි මෙසේ කියයි. මේ පළමු වන ශාශ්වතවාදය යැ."
            },
            {
                "type": "page-break",
                "text": "185"
            },
            {
                "format": 13,
                "text": "තව ද අනෙකක් කියම්. වහන්ස, මෙහි එක්තරා මහණෙක් හෝ බමුණෙක් හෝ වීර්යය ප්‍රත්‍යය කොට ගෙන (වැර වඩා) ... යම් සමාධියෙකින් සිත සමාධි ගත් වූ කල්හි ‘අසෝ තැනැ මෙනම් ඇතියෙම්, මෙස් වූ ගොත් ඇතියෙම්, මෙබඳු පැහැ සටහන් ඇතියෙම්, මෙබඳු ආහාර ඇතියෙම්, මෙබඳු සුවදුක් විඳිනා සුල්ලෙම්, මෙතෙක් ආයු සීමාවක් ඇතියෙම් වීමි, ඒ මම් එයින් සැව අසෝ තැන උපනිමි. එහි ද මෙ නම් ඇත්තෙම් මෙසේ වූ ගොත් ඇතියෙම්, … මෙ තෙක් ආයු සීමාවක් ඇත්තෙම් වීමි. ඒ මම් එයින් සැව මෙහි උපනිමියි මෙසේ අනේකවිධ වූ පෙර වුසූ කඳ පිළිවෙළ සිහි කෙරෙයි ද, එසේ වූ චිත්තසමාධියක් ලබයි. හෙ තෙම එයින් උක්ත පරිදි ආකාර සහිත කොට උද්දේශ සහිත කොට අනෙකවිධ පූර්වේනිවාසය සිහි කෙරෙයි. එසේ වූ හෙ තෙමේ ‘ලෝකය නැසුණේ යැ යි හෝ හැදුණේ යැ යි අතීත කාලය ද මම් දනිමි. ලෝකය නැසෙන්නේ යැ යි හෝ හැදෙන්නේ යැ යි හෝ අනාගත කාලය ද මම් දනිමි. (ඒ මා දන්නා පරිදි) ආත්මය ද ලෝකය ද ශාශ්වත ය, වඳ ය, ගිරිකුළක් සේ සිටියේ ය, ගැඹුරු වළැ සිටුවන ලද ඉඳු කිලක් සේ තහවුරුවැ සිටියේ ය, ඒ සත්වයෝ ම මෙයින් අන් තැනට දිවෙත්, භවයෙන් භවයට යෙත්, මැරෙත්, උපදිත්. (ආත්මයත් ලෝකයත්) මහා පෘථිවිආදි ශාශ්වතීනට සම ව විද්‍යමාන ම යැ” යි කියයි. වහන්ස, මේ දෙවෙනි ශාශ්වත වාදය යැ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "තව ද අනෙකක් කියමි. වහන්ස, මෙහි එක්තරා මහණෙක් හෝ බමුණෙක් හෝ වැර වඩා ... යම් සමාධියෙකින් සිත සමාහිත කල්හි ‘අසෝ තැනැ මෙ නම් ඇත්තෙම්, මෙස් වූ ගොත් ඇත්තෙම්, මෙබඳු පැහැසටහන් ඇත්තෙම්, මෙබඳු ආහාර ඇත්තෙම්, මෙසේ වූ සුවදුක් විඳිනා සුල්ලෙම්, මෙතෙක් ආයු සීමා ඇත්තෙම් වීමි. ඒ මම් එයින් සැව අසෝ තැන උපනිමි. එහි ද මෙ නම් ඇත්තෙම් ... මෙතෙක් ආයු සීමා ඇත්තෙම් වීමි. ඒ මම් එයින් සැව මෙහි උපනිමි’යි ... සංවර්ත විවර්ත කල්ප දශයක් ද, සංවර්තවිවර්ත කල්ප විස්සක් ද, සංවර්තවිවර්ත කල්ප තිසක් ද, සංවර්තවිවර්ත කල්ප සතළිසක් ද පූර්වේනිවාසය සිහි කෙරෙයි. හේ මෙසේ ආකාර සහිත කොට උද්දේශ සහිත කොට අනෙකවිධ පූර්වේනිවාසය සිහි කෙරෙයි. හෙ තෙමේ ලෝකය (මෙසේ) නැසුණේ යැ යි ද (මෙසේ) සැදුණේ යැ යි ද අතීත කාලය ද මම් දනිමි යි. ලෝකය නැසෙන්නේ යැයි ද හැදෙන්නේ යැ යි ද අනාගත කාලයත් මම් දනිමි යි, ආත්මය ද ලෝකය ද ශාශ්වත ය, වඳ ය, ගිරිකුළක් සේ සිටුනේ ය, තරවැ සිටුනා ඉඳුකිලක් සේ තහවුරු ය. ඒ සත්හු ම මෙයින් අන් තැනට දිවෙත්, භවයෙන් භවයට යෙත්, මැරෙත්, උපදිත්. ශාශ්වත වස්තූනට සම ව ස්ථිර ව විද්‍යමාන ම යැ” යි කියයි. වහන්ස, මේ තුන්වැනි ශාශ්වතවාදය යැ. වහන්ස, මෙසේ ශාශ්වතවාද තත්ත්ව ප්‍රකාශන විෂයයෙහි (භාග්‍යවතුන් වහන්සේගේ) මේ අනුත්තර බව වේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "187"
            },
            {
                "format": 21,
                "text": "පූර්‍වෙනිවාසානුස්මෘති ඤාණ දේශනා",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "13. වහන්ස, යම්සේ භාග්‍යවතුන් වහන්සේ පූර්වේනිවාසානුස්මෘතිඥානවිෂයයෙහි දහම් දෙසා ද, මේ (ඔබ පිළිබඳ) අන් අනුත්තර බවෙකි. වහන්ස, මෙහි එක්තරා මහණෙක් හෝ බමුණෙක් හෝ වැර වඩා ... යම් බඳු සමාධියෙකින් සිත සමාහිත කල්හි, ... එක් ජාතියක් ද, ජාති දෙකක් ද, ජාති තුනක් ද, ජාති සතරක් ද, ජාති පසක් ද, ජාති දශයක් ද, ජාති විස්සක් ද, ජාති තිසක් ද, ජාති සතළිසක් ද, ජාති පනසක් ද, ජාති සියයක් ද, ජාති දහසක් ද, ජාති සියදහසක් ද, නොයෙක් සංවර්ත කල්ප ද, නොයෙක් විවර්ත කල්ප ද, නොයෙක් සංවර්ත විවර්ත කල්ප ද සිහි කෙරෙයි. මෙසේ ආකාර සහිත කොට උද්දේශ සහිත කොට, අනේකවිධ වූ පූර්වේනිවාසය සිහි කරයි. වහන්ස, පිණ්ඩගණනායෙන් හෝ අච්ඡිද්‍ර මනෝගණනායෙන් හෝ යම් කෙනෙකුන්ගේ ආයුෂය ගණින්නට නොහැක්කේ ද එසේ වූ දීර්ඝායුෂ්ක දෙවි කෙනෙක් ඇත. එතෙකුදු වුවත් රූපී වූ හෝ අරූපී වූ හෝ සංඥි වූ හෝ අසංඥි වූ හෝ නෛවසංඥ නාසංඥ වූ හෝ දෙවියන් අතුරෙහි යම් යම් අත්බැවෙක වුසූ විරූ වේ ද, (ඒ හැම එකකුගේ ම පූර්වේනිවවාසය භාග්‍යවතුන් වහන්සේ දැන වදාරන සේක.) මෙසේ ආකාර සහිත කොට උද්දේශ සහිත කොට අනෙකවිධ වූ පූර්වේනිවාසය සිහි කරන සේක. වහන්ස, පූර්වේනිවාසානුස්මෘතිඥාන විෂයයෙහි මේ (භාග්‍යවතුන් වහන්සේගේ) අනුත්තර බව යැ.",
                "type": "paragraph"
            },
            {
                "format": 21,
                "text": "චුතූපපාත ඤාන දේශනා",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "14. වහන්ස, සත්වයන්ගේ ච්‍යුත්‍යුපපාද ඥාන විෂයයෙහි යම්සේ භාග්‍යවතුන් වහන්සේ දහම් දෙසනා සේක් ද, මෙ (ඔබ ගේ) තවද අනුත්තර බවෙකි. වහන්ස, මෙහි එක්තරා මහණෙක් හෝ බමුණෙක් හෝ වැර වඩා … යම් සමාධියෙකින් සිත සමාහිත කල්හි ‘ඛේදයෙක! මේ භවත් සත්වයෝ කායදුශ්චරිතයෙන් සමන්විත හ, වාග් දුශ්චරිතයෙන් සමන්විත හ, මනෝදුශ්චරිතයෙන් සමන්විත හ, ආර්යයනට උපවාද කරන්නාහ, මිසදිට් හ, මිථ්‍යාදෘෂ්ටික කර්ම සමාදාන ඇත්තාහ, ඔහු කාබුන් මරණින් මතු සැපයෙන් පහ වූ විවශ ව පතිත වන ස්ථානය වූ නිරයට වන්නාහ. එතෙකුදු වුවත් මේ සත්හු වූකලි කාය සුචරිතයෙන් සමන්විත හ, වාක් සුචරිතයෙන් සමන්විත හ, මනඃ සුචරිතයෙන් සමන්විත හ, ආර්යයනට උපවාද නොකරන්නේ ය, සම්දිට් හ, සම්‍යක් දෘෂ්ටික කර්ම සමාදාන ඇත්තාහ, ඔහු කාබුන් මරණින් මතු මනා ගති ඇති ස්වර්ග ලෝකයට වන්නාහ’ යි මිනිසුන්ගේ දර්ශනෝපචාරය ඉක්මැ දැක්කැ හැකි වූ විශුද්ධ වූ දිවැසින් මරණාසන්න වූ ද එ කෙණෙහි උපන්නාවූ ද පහත් වූ ද උසස් වූ මනා පැහැපත් වූ ද, නොමනා පැහැති වූ ද, මනාගති ඇත්තා වූ ද නොමනා ගති ඇත්තාවූ ද, නම් වූ පරිදි එළැඹැ සිටි සත්වයන් දනී මෙසේ මිනිසුන්ගේ දර්ශනෝපචාරය ඉක්මැ දැක්කැ හැකි වූ විශුද්ධ වූ දිවැසින් මරණාසන්න වූ ද, එ කෙණෙහි උපන්නාවූ ද, පහත් වූ ද, උසස් වූ ද, මනා ගති ඇත්තාවූ ද, නොමනා ගති ඇත්තාවූ ද, කම් වූ පරිදි එළැඹ සිටි සත්වයන් කී. වහන්ස, සත්වයන්ගේ ච්‍යුති උප්පත්ති දැන්මෙහි භාග්‍යවතුන් වහන්සේගේ මේ අනුත්තර බව වේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "189"
            },
            {
                "format": 21,
                "text": "ඍද්ධිවිධ දේශනා",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "15. වහන්ස, යම්සේ භාග්‍යවතුන් වහන්සේ ඍද්ධි ක්‍රියා විෂයයෙහි දහම් දෙසන සේක් ද, මෙය ද ඔබගේ අන් අනුත්තර බවෙකි. වහන්ස, මේ ඍද්ධිවිධාවෝ දෙදෙනෙකි. වහන්ස, යමෙක් සදොස් යැයි දෝෂාරෝපණ සහිත යැ යි ආර්ය නො වේ යැ යි කියනු ලැබේ ද එසේ වූ ඍද්ධියෙක් ඇත. වහන්ස, යමෙක් නිදොස් යැයි දෝෂාරෝපණ රහිත යැ යි ආර්ය යැ යි කියනු ලැබේ ද, එසේ වූ ඍද්ධියෙක් ද ඇත. වහන්ස, යමෙක් සදොසැ යි දෝෂාරෝපණ සහිත යැ යි ආර්ය නොවේ යැ යි කියනු ලැබේ ද ඒ ඍද්ධිය කවර ද? වහන්ස, මෙහි එක්තරා මහණෙක් හෝ බමුණෙක් හෝ වැර වඩා ... යම් සමාධියෙකින් සිත සමාහිත කල්හි නොයෙක් වැදෑරුම් ඍද්ධි කොටස් ප්‍රත්‍යක්ෂ කෙරෙයි ද එසේ වූ චිත්තසමාධියක් ස්පර්ශ කෙරෙයි. පියෙවියෙන් එකෙක් වූ හෙ තෙමේ බොහො දෙනෙකුන් සේ පැනෙයි. බොහෝ දෙනෙකුන් සේ වැ යලි එකෙක් ම වැ පැනෙයි. පැනෙන බවට, නො පැනෙන බවට පැමිණෙයි. බිත්තියෙන් පිටතට ද පවුරෙන් පිටතට ද, පර්වතයෙන් පිටතට ද අහසෙහි මෙන් නො ගැටෙනුයේ යෙයි. දියෙහි මෙන් පොළොවෙහි ද ගැලීම මතු වීම කෙරෙයි. පොළොවෙහි මෙන් නො බිඳෙන දියෙහි (දිය නොබිඳෙන සේ) යෙයි. පියාපත් ඇති පක්ෂියකු සේ අහසෙහි ද පළඟින් යෙයි. මේසා මහ ඉදුමත් මේසා මහ තෙදැති මේ සඳ හිරුන්ද අත්ලෙන් ස්පර්ශ කෙරෙයි, පිරිමදියි. බඹ ලොව තෙක් ම ද කයින් වශයෙහි පවත්වයි. වහන්ස, යමෙක් සදොස් ද දෝෂාරෝපණ සහිත ද, ආර්ය යැ යි කියනු නො ලැබේ ද, මේ ඒ ඍද්ධිය යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, යමෙක් නිදොස් යැ යි දෝෂාරෝපණ රහිත යැ යි ආර්ය යැ යි කියනු ලැබේ ද, ඒ ඍද්ධිය කවර ද? වහන්ස, මෙහි මහණ තෙම පිළිකුල් දැයෙහි පිළිකුල් සංඥාව නැති වැ වෙසෙම් වා යි ඉදින් කැමැති වේ ද එහි පිළිකුල් සංඥා නැති වැ වෙසෙයි. ඉදින් නොපිළිකුල් දැයෙහි පිළිකුල් සංඥා නැති වැ වෙසෙම් වා යි කැමැති වේ ද, එහි පිළිකුල් සංඥා නැති වැ වෙසෙයි. ඉදින් පිළිකුල් දැයෙහිත් නොපිළිකුල් දැයෙහිත් නොපිළිකුල් සංඥා ඇති වැ වෙසෙම් වා යි කැමැති වේ ද එහි පිළිකුල් සංඥා නැති වැ වෙසෙයි. ඉදින් පිළිකුල් දැයෙහිත් නොපිළිකුල් දැයෙහිත් පිළිකුල් සංඥාව ඇති වැ වෙසෙම් වා යි කැමැති වේ ද එහි පිළිකුල් සංඥාව ඇතිවැ වෙසෙයි. ඉදින් පිළිකුල් දැය ද නොපිළිකුල් දැය ද ඒ දෙක ම ද හැර සිහි ඇත්තේ නුවණින් දන්නේ එහි උපේක්ෂක වැ වෙසෙම් වා යි කැමැති වේ ද, සිහි ඇත්තේ නුවණින් දන්නේ එහි උපේක්ෂක වැ වෙසෙයි. වහන්ස, මේ වූ කලි දොස් නැති දෝෂාරෝපණ නැති ආර්ය ඍද්ධියැ යි කියනු ලැබේ. වහන්ස, ඍද්ධිවිධාවන් අතුරෙහි මෙය නිරුත්තර වේ. එය භාග්‍යවතුන් වහන්සේ මුළුල්ල ම වෙසෙසි නුවණින් දන්නා සේක. යමක් වෙසෙසින් දන්නා අන් මහණෙක් හෝ බමුණෙක් හෝ යම් ඍද්ධි විධාවන්හි භාග්‍යවතුන් වහන්සේට වඩා බොහෝ සෙයින් දන්නේ යැ යි කියැ යුතු වේ ද, (එවැන්නෙක් නැත.) එය මුළුල්ල ම දන්නා භාග්‍යවතුන් වහන්සේ විසින් තවත් වෙසෙසින් දත යුතු දැයෙක් නැත.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "191"
            },
            {
                "format": 13,
                "text": "16. වහන්ස, සැදැහැවත් ආරබ්ධ වීර්ය ඇති, ස්ථීර වීර්ය ඇති පුරුෂ ස්ථාමය ඇති, පුරුෂ වීර්යය ඇති. පුරුෂ පරාක්‍රමය ඇති ධුර වහන සමර්ථ මහා පුරුෂ වු කුල පුතක්හු විසින් යමක් ලැබියැ යුතු ද භාග්‍යවතුන් වහන්සේ විසින් එය ලබන ලද්දේ ය. වහන්ස, භාග්‍යවතුන් වහන්සේ හීන වූ ග්‍රාම්‍ය වූ පුහුදුනන් විසින් සෙවියැ හැකි, ආර්යයන් විසින් නො සෙවියැ හැකි, අනර්ථයෙන් යුක්ත වූ කාමසුඛල්ලිකානුයෝගයෙහි නොයෙදුණු සේක. දුඃඛ යුක්ත වූ අනාර්ය වූ අනර්ථ නිඃශ්‍රිත වූ ආත්මක්ලමථානු යෝගයෙහි ද නොයෙදුණු සේක. භාග්‍යවතුන් වහන්සේ වූ කලි කාමාවචර සිත් ඉක්මැ සිටි, දෘෂ්ටධර්ම සුඛවිහාර වූ සතර ධ්‍යානයන් කැමැති සේ ලබන සුලු වූ සේක, නිදුකින් ඒ ලබන සුලු වූ සේක, මහත් සේ එය ලබන සුලු වූ සේක.",
                "type": "paragraph"
            },
            {
                "format": 21,
                "text": "අනුයෝගදාන - ප්‍රකාරය",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "වහන්ස, ඉදින් ‘ඇවැත් ශාරිපුත්‍රයෙනි, සම්බෝධි විෂයයෙහි භාග්‍යවතුන් වහන්සේට වඩා විශිෂ්ට ඥානය ඇති අන් මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ ඇද්දැ?’ යි ඉදින් මා විචාරන්නේ නම්, වහන්ස, එසේ විචාරන ලද මම් ‘නැතැ’ යි කියන්නෙමි. ‘කිමෙක් ද ඇවැත් ශාරිපුත්‍රයෙනි, සම්බෝධියෙහි භාග්‍යවතුන් වහන්සේට වඩා විශිෂ්ට ඥානය ඇති අන් මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ අනාගත කාලයෙහි වන්නාහු දැ?’ යි ඉදින් මා විචාරන්නේ නම් වහන්ස, එසේ විචාරනු ලැබූ මම් ‘නො වන්නාහ’ යි කියන්නෙමි. ‘කිමෙක් ද ඇවැත් ශාරිපුත්‍රයෙනි, සම්බෝධියෙහි භාග්‍යවතුන් වහන්සේට වඩා විශිෂ්ට ඥානය ඇති අන් මහණෙක් හෝ බමුණෙක් හෝ දැන් ඇත් දැ?’ යි මා විචාරන්නේ නම්, වහන්ස, එසේ විචාරන ලද, මම් ‘නැතැ’ යි කියන්නෙමි. වහන්ස, ‘සම්බෝධියෙහි භාග්‍යවතුන් වහන්සේට සම සම වූ නුවණ ඇති අන් මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ වුහු දැ?’ යි ඉදින් මා විචාරන්නේ නම් වහන්ස, මෙසේ විචාරන ලද මම් ‘එසේ යැ’ යි කියන්නෙමි. ‘කිමෙක් ද ඇවැත් ශාරිපුත්‍රයෙනි, සම්බෝධියෙහි භාග්‍යවතුන් වහන්සේට සම සම වූ අන් මහණ බමුණු කෙනෙක් අනාගත කාලයෙහි වන්නාහු දැ?’ යි මා විචාරන්නේ නම්, එසේ විචාරනු ලැබූ මම් ‘එසේ යැ’ යි කියන්නෙමි. ‘කිමෙක්ද ශාරිපුත්‍රයෙනි, සම්බෝධියෙහි භාග්‍යවතුන් වහන්සේට සම සම වූ අන් මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ දැන් ඇත් දැ?’ යි මා විචාරන්නේ නම්, වහන්ස, එසේ විචාරනු ලැබූ මම් ‘නැතැ’ යි කියන්නෙමි, ‘කිමෙක් ද ඇවැත් ශාරිපුත්‍රයෝ එක්තරා මහණ බමුණු කෙනෙකු පිළිගන්නාහු එක්තරා මහණ බමුණු කෙනකු නො පිළිගන්නාහු දැ?’ යි මා පුළුවුස්නේ නම් එසේ විචාරනු ලැබූ මම් ‘ඇවැත්නි, “සම්බෝධියෙහි මා හා සම සම වූ රහත් සම්මා සමබුදුවරු අතීත කාලයෙහි වූහ” යන මෙය මා විසින් භාග්‍යවතුන් වහන්සේගේ හමුයෙහි අසන ලද්දේ ය, භාග්‍යවතුන් වහන්සේගේ සම්මුඛයෙහි පිළිගන්නා ලද්දේය. “ඇවැත්නි, සම්බෝධියෙහි මා හා සම සම වූ රහත් සම්මා සම්බුදුවරු අනාගත කාලයෙහි වන්නාහ” යි යන මෙය මා විසින් භාග්‍යවතුන් වහන්සේ හමුයෙහිදී අසා සම්මුඛයෙහිදී පිළිගන්නා ලද්දේය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "193"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි එක් ලෝකධාතුවෙක රහත් සම්මාසම්බුදුවරු දෙනමෙක් ඉදිරි පසු නො වැ එක් විටම පහළ වන්නාහ යන මෙය නො කරුණෙක, සිදු වන්නට අවකාශ නැත්තෙක. මෙ කරුණ විද්‍යමාන නො වේ’ යැ යි යන මෙය මා විසින් භාග්‍යවතුන් වහන්සේ හමුයෙහිදී අසා ඔබ හමුයෙහිදී පිළිගන්නා ලද්දෙකැ’යි මෙසේ පවසන්නෙමි. ‘වහන්ස, මෙසේ විචාරනු ලැබූ මම් මෙපරිද්දෙන් එක්තරා ශාස්තෘකෙනකු පිළිගන්නා බව පවසනුයෙම්, භාග්‍යවතුන් වහන්සේ වදාළ වචනයක් ම කියන්නෙකිම් වෙම් ද? භාග්‍යවතුන් වහන්සේට අභූතයෙන් දොස් නො ගන්නෙකිම් වෙම් ද? නව ලොවුතුරා දහමට අනුකූල ධර්ම වූ පූර්වභාග ප්‍රතිපත්තිය පවසනුයෙම් වෙම් ද? කරුණු සහිත කිසි වාදයෙක් ගැරැහියැ යුතු තැනට පැමිණෙයි දැ?’ යි (සැරියුත් තෙරණුවෝ වදාළහ.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "17. “ශාරිපුත්‍රයෙනි, එසේ වී නම් අසන්න. එසේ විචාරන ලදු ව යට කී සේ විසඳන තෙපි මා කී දැයක් ම කියන්නෝ වහු, මට අභූතයෙන් දොස් නඟන්නෝ නො වහු, ධර්මයට අනුකූල ධර්මය ද පවසන්නෝ වහු, කරුණු සහිත කිසි දු වාදයෙක් ගැරැහියැ යුතු තැනට නොපැමිණේ” යැ යි භාග්‍යවතුන් වහන්සේ වදාළ සේක. ",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "18. මෙසේ වදාළ කලැ උදායී තෙරණුවෝ ‘වහන්ස, යම්බඳු වූ තථාගත්යන් වහන්සේ මෙසේ මහත් ඍද්ධි ඇති සේක්, මෙසේ මහත් තෙද ඇති සේක් වැලි දු එසේ තමා හෙළි නො කරන සේක. එසේ වූ තථාගතයන් වහන්සේගේ අල්පේච්ඡතාව, සන්තුෂ්ටතාව, සංලේඛිතාව ආශ්චර්ය ය, අද්භූත යැ’ යි කීහ.\n__missing translation here__"
            },
            {
                "format": 13,
                "text": "19. “උදායීනි, යම්බඳු තථාගතයෝ මෙසේ මහත් ඍද්ධි ඇත්තෝ ද, මහත් තෙදැත්තෝ ද එහෙත් තමන් නො ම හෙළි කරන්නෝය. බලවු, උදායීනි, එහි තථාගතයන්ගේ අල්පේච්ඡතාව, සන්තුෂ්ටතාව, සංලේඛිතාව, කොතරම් ආශ්චර්ය ද! උදායීනි, මෙයින් එක් එක් දහමක් නමුදු අන්තොටු පිරිවැජ්ජෝ තමන් කෙරෙහි දක්නාහු නම් එතෙකින්ම ඔහු කොඩි ඔසොවා ගෙන, නුවර සිසාරා හැවිදුනාහ. උදායීනි, යම්බඳු වූ තථාගතයෝ මෙසේ මහත් ඍද්ධි ඇත්තෝ ද මහත් තෙද ඇත්තෝ ද එහෙත් තමන් හෙළි නො කරන්නාහ. බලවු, උදායීනි, තථාගතයන්ගේ අල්පේච්ඡතාව, සන්තුෂ්ටතාව, සංලේඛිතාව ආශ්චර්ය ය!",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "20. භාග්‍යවතුන් වහන්සේ මෙසේ වදාරා ඉක්බිති සැරියුත් තෙරුන් බණවා, ශාරීපුත්‍රයෙනි, එසේ වී නම් තෙපි මේ ධර්මපර්යාය මහණුනට, මෙහෙණියනට, උවසුවනට, උවැසියනට එක්වන් කියවු. ශාරීපුත්‍රයෙනි, යම් හිස් පුරුෂ කෙනකුනට තථාගතයන් කෙරෙහි සැකයෙක් හෝ විමතියෙක් හෝ වන්නේ ද, ඔවුනට මේ ධර්මපර්යායය ඇසීමෙන් තථාගතයන් කෙරෙහි යම් සැකයෙක් හෝ විමතියෙක් හෝ වී නම්, එය ප්‍රහීණ වන්නේ යැ” යි වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ ම සැරියුත් තෙරණුවෝ භාග්‍යවතුන් වහන්සේ හමුයෙහි සිය පැහැදීම දැන්වූහ. එහෙයින් මේ නිර්ගාථක සූත්‍රයට ‘සම්පසාදනීය’ සූත්‍රය යන නම විය.",
                "type": "paragraph"
            },
            {
                "format": 16,
                "text": "පස්වනු සම්පසාදනීය සූත්‍රය නිමියේ යැ.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ]
    }
]