{
    "filename": "dn-3-2",
    "bookId": 12,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 58,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "2",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "උදුම්බරිකසුත්තං",
                        "level": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "1. එවං මෙ සුතං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකං සමයං භගවා රාජගහෙ විහරති ගිජ්ඣකූටෙ පබ්බතෙ. තෙන ඛො පන සමයෙන නිග්රොධො පරිබ්බාජකො උදුම්බරිකාය පරිබ්බාජකාරාමෙ පටිවසති මහතියා පරිබ්බාජකපරිසාය සද්ධිං තිංසමත්තෙහි පරිබ්බාජකසතෙහි. අථ ඛො සන්ධානො ගහපති දිවා දිවස්ස{1} රාජගහා නික්ඛමි භගවන්තං දස්සනාය. අථ ඛො සන්ධානස්ස ගහපතිස්ස එතදහොසි: අකාලො ඛො තාව භගවන්තං දස්සනාය, පටිසල්ලීනො භගවා, මනොභාවනීයානම්පි භික්ඛූනං අසමයො දස්සනාය. පටිසල්ලීනා මනොභාවනීයා භික්ඛූ. යන්නූනාහං යෙන උදුම්බරිකාය පරිබ්බාජකාරාමො යෙන නිග්රොධො පරිබ්බාජකො තෙනුපසඞ්කමෙය්යන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. අථ ඛො සන්ධානො ගහපති යෙන උදුම්බරිකාය පරිබ්බාජකාරාමො යෙන නිග්රොධො පරිබ්බාජකො තෙනුපසඞ්කමි. තෙන ඛො පන සමයෙන නිග්රොධො පරිබ්බාජකො මහතියා පරිබ්බාජකපරිසාය සද්ධිං නිසින්නො හොති උන්නාදිනියා උච්චාසද්දමහාසද්දාය අනෙකවිහිතං තිරච්ඡානකථං කථෙන්තියා - සෙය්යථිදං: රාජකථං චොරකථං මහාමත්තකථං සෙනාකථං භයකථං යුද්ධකථං අන්නකථං පානකථං වත්ථකථං සයනකථං මාලාකථං ගන්ධකථං ඤාතිකථං යානකථං ගාමකථං නිගමකථං නගරකථං ජනපදකථං ඉත්ථිකථං පුරිසකථං සූරකථං විසිඛාකථං කුම්භට්ඨානකථං පුබ්බපෙතකථං නානත්තකථං ලොකක්ඛායිකං සමුද්දක්ඛායිකං ඉතිභවාභවකථං ඉති වා. අද්දසා ඛො නිග්රොධො පරිබ්බාජකො සන්ධානං ගහපතිං දූරතො’ව ආගච්ඡන්තං. දිස්වා සකං පරිසං සණ්ඨපෙසි: අප්පසද්දා භොන්තො හොන්තු, මා භොන්තො සද්දමකත්ථ. අයං සමණස්ස ගොතමස්ස සාවකො ආගච්ඡති සන්ධානො ගහපති. යාවතා ඛො පන සමණස්ස ගොතමස්ස සාවකා ගිහී ඔදාතවසනා රාජගහෙ පටිවසන්ති, අයං තෙසං අඤ්ඤතරො සන්ධානො ගහපති. අප්පසද්දකාමා ඛො පනෙතෙ ආයස්මන්තො අප්පසද්දවිනීතා අප්පසද්දස්ස වණ්ණවාදිනො. අප්පෙවනාම අප්පසද්දං පරිසං විදිත්වා උපසඞ්කමිතබ්බං මඤ්ඤෙය්යා ති. එවං වුත්තෙ තෙ පරිබ්බාජකා තුණ්හී අහෙසුං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. දිවා දිවස්සෙව - ස්යා. PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "2.",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "උදුම්බරික සීහනාද සූත්‍රය",
                        "level": 3
                    },
                    {
                        "format": 13,
                        "text": "1. මා විසින් මෙසේ අසන ලදී:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවරට නොදුරු නොළං තන්හි වූ ගිජුකුළු පව්වෙහි වැඩ වසන සේක. එ සමයෙහි න්‍යග්‍රෝධ නම් පිරිවැජි තෙමේ තුන් දහසක් පමණ වූ මහත් පිරිවැජි පිරිසක් හා උදුම්බරිකා දේවියගේ පිරිවැජි අරමෙහි වෙසෙයි. එ කල්හි සන්ධාන නම් ගෘහපති භාග්‍යවතුන් වහන්සේ දක්නා පිණිස ඉරමුදුන් වේලෙසහි රජගහ නුවරින් නික්මිණ. එ කලැ ඔහුට ‘තව ම භාග්‍යවතුන් වහන්සේ දක්නට නො කල් ම ය. භාග්‍යවතුන්වහන්සේ චිත්ත විවේකයෙන් වැඩ ඉන්නා සේක. සිත වඩන භික්ෂූන් ද දක්නට කාලය නො වේ. සිතවඩන භික්ෂූහු චිත්ත විවේකයෙන් උන්නාහු වෙති. උදුම්බරිකා දේවියගේ පිරිවැජි අරමට, න්‍යග්‍රෝධ පිරිවැජියා කරා ගියෙම් වීම් නම් යෙහෙකැ යි මේ සිත විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "2. එ කල්හි සන්ධාන ගෘහපති තෙම උදුම්බරිකා දේවියගේ පිරිවැජි අරම කරා, න්‍යග්‍රෝධ පිරිවැජියා වෙතට ගියේ ය. එ සමයෙහි න්‍යග්‍රෝධ පිරිවැජි තෙම උන්නාදී වැ ඝෝෂයෙන් යුක්ත වැ උස් හඬ මහ හඬ ඇති වැ, මහත් පිරිවැජි පිරිස හා රාජකථා, චොරකථා, මහාමාත්‍යකථා, සෙනාකථා, භයකථා, යුද්ධකථා, අන්නකථා, පානකථා, වස්ත්‍රකථා, මාලාකථා, ගන්ධකථා, ඥාතිකථා, යානකථා, ග්‍රාමකථා, නිගමකථා, නගරකථා, ජනපදකථා, ස්ත්‍රීකථා, පුරුෂකථා, සූරකථා, විසිඛාකථා, කුම්භස්ථානකථා, පූර්වප්‍රෙතකථා, නානාත්වකථා, ලෝකාඛ්‍යායිකා, සමුද්‍රාඛ්‍යායිකා, ඉතිභවාභවකථා යන මේ කථා හෝ මෙ බඳු වූ තිරශ්චීන කථා කියමින් හුන්නේ වෙයි. න්‍යග්‍රෝධ පිරිවැජි තෙම එන්නාහූ සන්ධාන ගෘහපතියා දුටුතේ ය. දැක ‘භවත්හු නිහඬ වෙත් වා. භවත්නි, ශබ්ද නො කරවු. මහණ ගොයුමන්ගේ සවු වූ මේ සන්ධාන ගෘහපති එයි. මහණ ගොයුමන්ගේ සවු වූ සුදු වත් හඳිනා, යම් පමණ ගිහි කෙනෙක් රජගහ නුවරැ වෙසෙත් ද, මේ සන්ධාන ගෘහපති ඔවුන්ගෙන් එක්තරා කෙනෙක. මේ ආයුෂ්මතුන් නිහඬ බව කැමැත්තෝ ය, නිහඬ බව්හි හික්මුණෝ ය, නිහඬ බවේ ගුණ කියන්නෝ ය. නිහඬ පිරිස දැන මෙහි එළැඹියැ යුතු යැ යි සිතුවොත් යෙහෙකැ” යි කියා සිය පිරිස නිහඬ කෙළේ ය. මෙසේ කී කල්හි ඒ පිරිවැජියෝ නිහඬ වූහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 60,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "3. අථ ඛො සන්ධානො ගහපති යෙන නිග්රොධො පරිබ්බාජකො තෙනුපසඞ්කමි, උපසඞ්කමිත්වා නිග්රොධෙන පරිබ්බාජකෙන සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරානීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො සන්ධානො ගහපති නිග්රොධං පරිබ්බාජකං එතදවොච: අඤ්ඤථා ඛො ඉමෙ භොන්තො අඤ්ඤතිත්ථියා පරිබ්බාජකා සංගම්ම සමාගම්ම උන්නාදිනො උච්චාසද්දමහාසද්දා අනෙකවිහිතං තිරච්ඡානකථං ඉති වා අනුයුත්තා විහරන්ති - සෙය්යථිදං රාජකථං -පෙ- ඉතිභවාභව කථං අඤ්ඤථා ඛො{1} පන සො භගවා අරඤ්ෙඤ වනපත්ථානි පන්තානි සෙනාසනානි පටිසෙවන්ති අප්පසද්දානි අප්පනිග්ඝොසානි විජනවාතානි මනුස්සරාහස්සෙය්යකානි පටිසල්ලානසාරුප්පානී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං වුත්තෙ නිග්රොධො පරිබ්බාජකො සන්ධානං ගහපතිං එතදවොච: යග්ඝෙ ගහපති ජානෙය්යාසි, කෙන සමණො ගොතමො සද්ධිං සල්ලපති? කෙන සාකච්ඡං සමාපජ්ජති? කෙන පඤ්ඤාවෙය්යත්තියං ආපජ්ජති. සුඤ්ඤාගාරහතා සමණස්ස ගොතමස්ස පඤ්ඤා, අපරිසාවචරො සමණො ගොතමො, නාලං සල්ලාපාය. සො අන්තමන්තානෙව{1} සෙවති. සෙය්යථාපි නාම ගො කාණා පරියන්තචාරිනී අන්තමන්තානෙව සෙවති. එවමෙව සුඤ්ඤාගාරහතා සමණස්ස ගොතමස්ස පඤ්ඤා, අපරිසාවචරො සමණො ගොතමො, නාලං සල්ලාපාය. සො අන්තමන්තානෙව සෙවති. ඉඞ්ඝ ගහපති, සමණො ගොතමො ඉමං පරිසං ආගච්ඡෙය්ය, එකපඤ්හෙනෙව නං සංසාදෙය්යාම,{2} තුච්ඡකුම්භීව නං මඤ්ඤෙ ඔරොධෙය්යාමා’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "4. අස්සොසි ඛො භගවා දිබ්බාය සොතධාතුයා විසුද්ධාය අතික්කන්තමානුසකාය සන්ධානස්ස ගහපතිස්ස නිග්රොධෙන පරිබ්බාජකෙන සද්ධිං ඉමං කථාසල්ලාපං. අථ ඛො භගවා ගිජ්ඣකූටා පබ්බතා ඔරොහිත්වා යෙන සුමාගධාය තීරෙ මොරනිවාපො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා සුමාගධාය තීරෙ මොරනිවාපෙ අබ්භොකාසෙ චඞ්කමි. අද්දසා ඛො නිග්රොධො පරිබ්බාජකො භගවන්තං සුමාගධාය තීරෙ මොරනිවාපෙ අබ්භොකාසෙ චඞ්කමන්තං. දිස්වාන සකං පරිසං සණ්ඨපෙසි: අප්පසද්දා භොන්තො හොන්තු, මා භොන්තො සද්දමකත්ථ, අයං සමණො ගොතමො සුමාගධාය තීරෙ මොරනිවාපෙ අබ්භොකාසෙ චඞ්කමති. අප්පසද්දකාමො ඛො පන සො ආයස්මා, අප්පසද්දස්ස වණ්ණවාදී. අප්පෙවනාම අප්පසද්දං පරිසං විදිත්වා උපසඞ්කමිතබ්බං මඤ්ඤෙය්ය. සචෙ සමණො ගොතමො ඉමං පරිසං ආගච්ඡෙය්ය, ඉමං තං පඤ්හං පුච්ඡෙය්යාම ‘කො නාම සො භන්තෙ භගවතො ධම්මො යෙන භගවා සාවකෙ විනෙති, යෙන භගවතා සාවකා විනීතා අස්සාසප්පත්තා පටිජානන්ති අජ්ඣාසයං ආදිබ්රහ්මචරියන්ති? එවං වුත්තෙ තෙ පරිබ්බාජකා තුණ්හී අහෙසුං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අඤ්ඤතාච පන - PTS. අන්යපන්තානෙව - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "1. "
                    },
                    {
                        "type": "footnote",
                        "text": "2. සංහරෙය්යාම - කම්."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "3. එ කල්හි සන්ධාන ගෘහපති න්‍යග්‍රෝධ පිරිවැජියා කරා එළඹියේ ය. එළැඹ න්‍යග්‍රෝධ පිරිවැජියා හා සතුටු විය. සතුටු විය යුතු සිතැ රැඳැවිය යුතු කථාව අවසන් කොට එකත් පසෙක හුන්නේ ය. එකත් පසෙක හුන්නාවූ ම සන්ධාන ගෘහපති තෙම න්‍යග්‍රෝධ පිරිවැජියාට මෙය කී ය: “මේ භවත් අන්තොටු පිරිවැජියෝ එක්තැන් ව එක්රැස් ව ඝෝෂා ඇත්තාහු, උස් හඬ මඟ හඬ ඇත්තාහු, රාජකථා ... ඉතිභවා භව කථා යන මේ හෝ මෙබඳු වූ අනෙකවිධ තිරශ්චීන කථාහි යෙදුණහු අන් සැටියෙකින් වෙසෙත්. ඒ භාග්‍යවතුන් වහන්සේ ස්වල්ප භඩ ඇති, මඳ භඩ ඇති, ජනවාත රහිත වූ, හුදෙකලා වැ කරන කටයුතුවලට සුදුසු වූ, ඒකීභාවයට යෝග්‍ය වූ අරණ්‍ය වනප්‍රස්ථයන්, ගොදුරු ගමට දුරැ සෙනසුන් සෙව්නාහු අන් සැටියෙකින් ම වෙසෙත්” (යනුයි).",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මෙසේ කී කල්හි න්‍යග්‍රෝධ පිරිවැජි තෙම, සන්ධාන ගෘහපතියාට මෙය කී ය: “එසේ නම් ගැහැවිය දැන ගන්න. මහණ ගොයුම් කවරකු හා කතා බස් කෙරේ ද? කවරකු හා සාකච්ඡාවට බස්නේ ද? කවරකු හා උතුරු පිළිතුරු කතායෙන් ප්‍රඥාව්‍යක්තතාවට පැමිණේ ද? මහණගොයුම්හුගේ ප්‍රඥාව ශූන්‍යාගාරයන්හි ම නටුයේ ය. මහණ ගොයුම් අවිසාරද බැවින් පිරිස් මැදට බස්නට නො හැක්කේ ය. ආලාපසංලාපයට සමත් නො වෙයි. ඇඟේ කිසිවක් හැපෙතැ යි මඟ හැර හැර යන එකැස් කණ දෙනක සේ ප්‍රශ්න අසතැ යි බියෙන් ගමින් බොහෝ දුරැවූ සෙනසුන් සෙව්නේ ය. එබැවින් දැනගනුව, ගැහැවිය, මහණ ගොයුම් මේ පිරිසට ආවොත් එක් ප්‍රශ්නයෙන් ම ඔහු යටපත් කරන්නමු, හිස් කළයක් (ඒ මේ අත පෙරළා බැඳ තබන්නාක්) සෙයින් වාද කථායෙන් බැඳ තබන්නෙමු” (යනු යි).",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "4. භාග්‍යවතුන් වහන්සේ මනුෂ්‍ය විෂය සීමා ඉක්මි පිරිසිදු දිවකන් නුවණින් සන්ධාන ගෘහපතිහු න්‍යග්‍රෝධ පිරිවැජියා හා කැරෙන මේ කථාසංලාපය අසා වදාළසේක. ඉක්බිති ගිජුකුළු පව්වෙන් බැස, සුමාගධා පොකුණු තෙරැ වූ මයුරනිවාප නම් තැනට වැඩි සේක. වැඩ එහි සුමාගධා පොකුණු තෙරැ මයුර නිවාපයෙහි එළිමහනෙහි සක්මන් කළසේක. න්‍යග්‍රෝධ පිරිවැජි තෙම සුමාගධාතීරයෙහි මයුර නිවාපයෙහි එළිමහනැ සක්මන් කරන භාග්‍යවතුන් වහන්සේ දිටී ය. දැක සිය පිරිස බණවා, ‘භවත්හු නිහඬ වෙත් වා. භවත්නි, ශබ්ද නො කරවූ. මේ ශ්‍රමණ ගෞතම තෙමේ සුමාගධාව තෙරැ මයුර නිවාපයෙහි පිළිමිහනැ සක්මන් කෙරෙයි. ඒ ආයුෂ්මත් තෙමේ නිහැඬියාව කැමැත්තේ, නිහඬ බවැ ගුණ කියන සුලු ය. මෙ පිරිස නිහඬ වැ ඉඳිනාහු දැන එළැඹියැ යුතු කොට සිතුයේ වී නම් ඉතා යෙහෙක. ඉදින් ශ්‍රමණ ගෞතම තෙමේ මෙ පිරිස කරා ආයේ වී නම්, ‘වහන්ස’ භාග්‍යවතුන් වහන්සේ යම් දහමෙකින් ශ්‍රාවකයන් හික්මවන සේක්ද භාග්‍යවතුන් වහන්සේ විසින් යම් දහමෙකින් හික්මවන ලද සව්වෝ සතුටට පැමිණියාහු උත්තම නිඃශ්‍රයයක්, ආදිම බ්‍රහ්මචර්‍ය්‍යක් (ලොවුතුරා මඟක්) තමන් සතුටට කාරණ යැ යි) පිළින කෙරෙත් ද, භාග්‍යවතුන් වහන්සේගේ ඒ ධර්මය කවරේ වේ ද?’යි මේ පැණය විචාරන්නමු’ යි කී ය. මෙසේ කී කලැ ඒ පිරිවැජියෝ නිහඬ වූහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 62,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "තපොජිගුච්ඡාවාදා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "5. අථ ඛො භගවා යෙන නිග්රොධො පරිබ්බාජකො තෙනුපසඞ්කමි. අථ ඛො නිග්රොධො පරිබ්බාජකො භගවන්තං එතදවොච: එතු ඛො භන්තෙ භගවා, ස්වාගතං භන්තෙ භගවතො. චිරස්සං ඛො භන්තෙ භගවා ඉමං පරියායමකාසි යදිදං ඉධාගමනාය. නිසීදතු භන්තෙ භගවා, ඉදමාසනං පඤ්ඤත්තන්ති. නිසීදි භගවා පඤ්ඤත්තෙ ආසනෙ. නිග්රොධො පි ඛො පරිබ්බාජකො අඤ්ඤතරං නීචං ආසනං ගහෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො නිග්රොධං පරිබ්බාජකං භගවා එතදවොච: ‘කායනුත්ථ නිග්රොධ එතරහි කථාය සන්නිසින්නා? කා ච පන වො අන්තරා කථා විප්පකතා?ති. එවං වුත්තෙ නිග්රොධො පරිබ්බාජකො භගවන්තං එතදවොච: “ඉධ මයං භන්තෙ අද්දසාම භගවන්තං සුමාගධාය තීරෙ මොරනිවාපෙ අබ්භොකාසෙ චඞ්කමන්තං. දිස්වාන එවං අවොචුම්හා: සචෙ සමණො ගොතමො ඉමං පරිසං ආගච්ඡෙය්ය, ඉමං තං පඤ්හං පුච්ඡෙය්යාම: කො නාම සො භන්තෙ භගවතො ධම්මො යෙන භගවා සාවකෙ විනෙති, යෙන භගවතා සාවකා විනීතා අස්සාසප්පත්තා පටිජානන්ති අජ්ඣාසයං ආදිබ්රහ්මචරියන්ති?” අයං ඛො නො භන්තෙ අන්තරා කථා විප්පකතා, අථ භගවා අනුප්පත්තො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“දුජ්ජානං ඛො පනෙතං නිග්රොධ තයා අඤ්ඤදිට්ඨිකෙන අඤ්ඤඛන්තිකෙන අඤ්ඤරුචිකෙ අඤ්ඤත්රායොගෙන අඤ්ඤත්රාචරියකෙන ‘යෙනාහං සාවකෙ විනෙමි, යෙන මයා සාවකා විනීතා අස්සාසප්පත්තා පටිජානන්ති අජ්ඣාසයං ආදිබ්රහ්මචරියන්ති. ඉඞ්ඝ ත්වං මං නිග්රොධ සකෙ ආචරියකෙ අධිජෙගුච්ඡෙ පඤ්හං පුච්ඡ “කථං සන්තා නු ඛො භන්තෙ තපොජිගුච්ඡා පරිපුණ්ණා හොති, කථං අපරිපුණ්ණා”?ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "6. එවං වුත්තෙ තෙ පරිබ්බාජකා උන්නාදිනො උච්චාසද්දා මහාසද්දා අහෙසුං, “අච්ඡරියං වත භො අබ්භුතං වත භො සමණස්ස ගොතමස්ස මහිද්ධිකතා මහානුභාවතා, යත්ර හි නාම සකවාදං ඨපෙස්සති, පරවාදෙන පවාරෙස්සතී”ති. අථ ඛො නිග්රොධො පරිබ්බාජකො තෙ පරිබ්බාජකෙ අප්පසද්දෙ කත්වා භගවන්තං එතදවොච: “මයං ඛො භන්තෙ තපොජිගුච්ඡාවාදා තපොජිගුච්ඡාසාරා{1} තපොජිගුච්ඡං අල්ලීනා{2} විහරාම. කථං සන්තා නු ඛො භන්තෙ තපොජිගුච්ඡා පරිපුණ්ණා හොති, කථං අපරිපුණ්ණා?ති”"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. තපොජිගුච්ඡා සාරදො - කම්."
                    },
                    {
                        "type": "footnote",
                        "text": "2. තපොජිගුච්ඡා අලලීනා - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "5. එ කල්හි භාග්‍යවතුන් වහන්සේ න්‍යග්‍රෝධ පිරිවැජි කරා වැඩි සේක. එ විට න්‍යග්‍රෝධ පිරිවැජිතෙම “වහන්ස, භාග්‍යවතුන් වහන්සේ වඩනා සේක් වා. වහන්ස, භාග්‍යවතුන් වහන්සේ මෙහි වැඩි සේ මැනැව. වහන්ස, භාග්‍යවතුන් වහන්සේ මෙහි වඩනා පිණිස යම් ගමන වාරයෙක් වේ ද, බොහෝ කලෙකින් ඒ ගමනවාරය කළ සේක. වහන්ස, භාග්‍යවතුන් වහන්සේ වැඩහිඳිනා සේක් වා. මේ අස්නෙක් පැනැවිණැ” යි භාග්‍යවතුන් වහන්සේට මෙ බස් කී ය. භාග්‍යවතුන් වහන්සේ ප්‍රඥප්තාසනයෙහි වැඩ හුන් සේක. න්‍යග්‍රෝධ පිරිවැජි ද එක්තරා මිටි අස්නක් ගෙන පසෙක උන්නේ ය. භාග්‍යවතුන් වහන්සේ පසෙක උන්නාවූ ම න්‍යග්‍රෝධ පිරිවැජියා බණවා, “න්‍යග්‍රෝධයෙනි, දැන් තෙපි කවර කථාවෙකින් හුන්නහු ද? තොප අතර කවර කථාවෙක් අඩාළ වී ද?”යි අසා වදාළ සේක. මෙසේ වදාළ කලැ න්‍යග්‍රෝධ පිරිවැජිතෙම “වහන්ස, මෙහි සුමාගධා පොකුණු තෙරැ මයුර නිවාපයෙහි එළිමහනැ සක්මන් කරන භාග්‍යවතුන් වහන්සේ දුටුමු. දැක, ‘ඉදින් ශ්‍රමණ ගෞතමයෝ මේ පිරිස කරා වඩනාහුනම්, ‘වහන්ස, භාග්‍යවතුන් වහන්සේ යම් දහමෙකින් ශ්‍රාවකයන් හික්මවන සේක් ද, භාග්‍යවතුන් වහන්සේ විසින් යම් දහමෙකින් හික්මවන ලද සව්වෝ සතුටට පැමිණියාහු උත්තම නිඃශ්‍රය වූ පැරැණිතම බඹසරක් පිළින කෙරෙත් ද, භාග්‍යවතුන් වහන්සේගේ ඒ ධර්මය කවරේ වේ ද?’යි මේ පැණය ඔබ විචාරන්නමු’යි කිම්හ. වහන්ස, අප අතරැ මේ කථාව අඩාළ විය. එ කලැ, භාග්‍යවතුන් වහන්සේ වැඩි සේක”යි පැවැසීය."
                    },
                    {
                        "format": 13,
                        "text": "“න්‍යග්‍රෝධයෙනි, ‘යමෙකින් මම් සව්වන් භික්මවන්නෙම් ද, මා විසින් යමෙකින් හික්මවන ලද සව්වෝ සතුටට පැමිණියාහු, උත්තමධාරය වූ පැරණිතම බඹසරක් පිළින කෙරෙත් ද, එය අන්‍යදෘෂ්ටික වූ අන්‍යලබ්ධික වූ අන්‍යරූචික වූ අන්‍ය ප්‍රතිපත්තියෙක යෙදුණු, අන්‍ය තීර්ථායතනයෙක ඇදුරු වූ තොප විසින් දත නො හැක්ක. එබැවින් න්‍යග්‍රෝධයිනි, ‘වහන්ස, කෙසේ වූ තපොජුගුප්සාව පරිපූර්ණ වේද? කෙසේ වූ තපොජුගුප්සාව අපරිපූර්ණ වේ ද?’යි තෙපි ස්චකීය ආචාර්‍ය්‍ය වාදය වූ අධිජේගුච්ඡයෙහි (රූක්ෂ පිළිවෙතින් අතිශයින් පව් බැහැරැ ලීමෙහි) මා විචාරවු”යැ යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "6. මෙසේ වදළ කලැ, ඒ පිරිවැජියෝ ‘ස්වකීය වාදය පසෙක තබා පරවාදයෙන් පවරන සේ වූ මහණ ගොයුමන්ගේ මහ ඉදුමත් බව අසිරිය, මහ තෙද බලඇති බව පුදුම යැ! යි ඝෝෂා පවත්වනුවෝ උස් හඬැත්තාහු මහත් හඬැත්තාහු වූහ, ඉක්බිති න්‍යග්‍රෝධ පිරිවැජි ඒ පිරිවැජ්ජන් නිහඬ කොට, ‘වහන්ස, අපි තපොජුගුප්සාවාදය (රළු පිළිවෙතින් පව් අරැ ලියැ යුතුය යන දෘෂ්ටිය) ඇත්තමෝ, තපොජුගුප්සාව සාරය කොටැත්තමෝ තපොජුගුප්සාවාදයෙහි ඇලුණමෝ වසම්හ. වහන්ස, කෙබඳු වූ ම තපොජුගුප්සාව පරිපූර්ණ වේ ද? කෙබඳු වූ ම තපොජුගුප්සාව පරිපූර්ණ නො වේ ද?”යි භාග්‍යවතුන් වහන්සේගෙන් මේ පැණය පුළුවුත.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 64,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“ඉධ නිග්රොධ තපස්සී අචෙලකො හොති, මුත්තාචාරො හත්ථාපලෙඛනො,{1} නඑහිභදන්තිකො, නතිට්ඨභදන්තිකො, නාභිහටං න උද්දිස්සකටං න නිමන්තනං සාදියති. සො න කුම්භිමුඛා පටිගණ්හාති, න කලොපිමුඛා පටිගණ්හාති. න එළකමන්තරං, න දණ්ඩමන්තරං, න මුසලමන්තරං, න ද්වින්නං භුඤ්ජමානානං, න ගබ්භිනියා, න පායමානාය, න පුරිසන්තරගතාය, න සංකිත්තීසු, න යත්ථ සා උට්ඨිතො හොති, න යත්ථ මක්ඛිකා සණ්ඩසණ්ඩචාරිනී, න මච්ඡං, න මංසං, න සුරං, න මෙරයං, න ථුසොදකං පිවති. සො එකාගාරිකො වා හොති එකාලොපිකො, ද්වාගාරිකො වා හොති ද්වා ලොපිකො, සත්තාගාරිකො වා හොති සත්තාලොපිකො, එකිස්සාපි දත්තියා යාපෙති, ද්වීහි පි දත්තීහි යාපෙති -පෙ- සත්තහි පි දත්තීහි යාපෙති. එකාහිකම්පි ආහාරං ආහාරෙති, ද්වාහිකම්පි{2} ආහාරං ආහාරෙති තීහිකම්පි... චතූහිකම්පි... පඤ්චාහිකම්පි... ඡාහිකම්පි... සත්තාහිකම්පි ආහාරං ආහාරෙති -පෙ- ඉති එවරූපං අද්ධමාසිකම්පි පරියායභත්තභොජනානුයොගමනුයුත්තො විහරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සො සාකභක්ඛො වා හොති, සාමාකභක්ඛො වා හොති, නීවාරභක්ඛො වා හොති, දද්දුලභක්ඛො වා හොති, හටභක්ඛො වා හොති, කණ්භක්ඛො වා හොති, ආචාමභක්ඛො වා හොති, පිඤ්ඤාකභක්ඛො වා හොති, තිණභක්ඛො වා හොති, ගොමයභක්ඛො වා හොති, වනමූලඵලාහාරො යාපෙති පවත්තඵලභොජී."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. හත්ථාවලෙඛනො - කම්."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ද්වීහිතම්පි - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "එවිට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n“න්‍යග්‍රෝධයෙනි, මෙහි තපස්වී තෙම නිරුවත් වෙයි, සිට ගෙන මල මූ පහකිරීම් ආදිවශයෙන් තොරවූ ශිෂ්ටාචාර ඇත්තේ වෙයි, කෑම කා අත ලෝනේ ය. මෙහි වඩින්නැ වහන්සැ යි බික් පිළිගන්නට කැඳවූ විට නො එන්නේ ය. මෙහි වැඩ සිටින්නැ’යි අයැදු විට නො සිටී, වේලායෙන් පළමු එළවූ බොජුන් නො පිළිගනී, තමා උදෙසා පිළියෙල කළ බොජුන් නො පිළිගනී, නිමන්ත්‍රණය නො ඉවසයි. හෙ තෙම සැළිමුවින් නඟා දුන් බොජුන් නො පිළිගනී. සැළිපසින් නඟා දුන් බොජුන් නො පිළිගනී. එළිපත අතරැ කොට (එළිපතින් එහා පැත්තේ සිට) තුබූ බොජුන් නො පිළිගනී. දංඩක් අතරැ කොට තුබූ බොජුන් නො පිළිගනී. මොහොලක් අතරැ කොට තුබූ බොජුන් නො පිළිගනී. බොජුන් වළඳන දෙදෙනෙකුගෙන් එකකු නැඟී එළැවූ බොජුන් නො පිළිගනී. ගැබින්නක දුන් බොජුන් නො පිළිගනී. කිරිපොවන්නියක එළැවූ බොජුන් නො පිළිගනී. පුරුෂයකු හා වාසයට ගිය ස්ත්‍රියක දුන් බොජුන් නො පිළිගනී. කිහිප දෙනෙකුගේ සම්මාදමින් පිළියෙල කොට එළැවූ බොජුන් නො පිළිගනී. ළඟ හුන් සුනඛයාට නොදී තමාට දුන් අහර නො පිළිගනී. මැස්සන් කැටි කැටි ව ගැවැසෙන තැනදී දුන් අහර නො පිළිගනී. දියමස් නො වළඳයි. ගොඩමස් නො වළඳයි. සුරා නො බොයි. පුෂ්පාසවාදි ආසව නො බොයි. සොවිරකය (සියලු ශශ්‍යසම්භාරයෙන් කළ කාඩිය) නොබොයි. හේ ඒකාගාරික (එක් ගෙයෙකින් පමණක් අහර ලැබ නවත්නේ) හෝ ඒකාලෝපික (එක් බත් පිඬෙකින් පමණක් යැපෙන්නේ) හෝ වෙයි. සාප්තාගාරික (සත් ගෙයෙකින් පමණක් අහර ලැබ නවත්නේ හෝ සත් අහර පිඬෙකින් පමණක් යැපෙන්නේ) වෙයි. එක් දත්තියෙක (කුඩා තලියෙක) බතින් ද යැපෙයි. දත්ති (කුඩා තලි) දෙකෙක බතින් ද යැපෙයි, ... දත්ති සතෙක බතින් ද යැපෙයි. දවසක් හැර දවසක් ද අහර ගනී. දෙ දවසක් හැර දවසක් ද අහර ගනී. තුන් දවසක් ... සතර වසක් … පස් දවසක් ... ස දවසක් ... සත් දවසක් හැර දවසක් ද අහර ගනී ... මෙසේ මේ අයුරින් අඩ මසක් හැර දවසක් ද වාර බත් වැළඳීමේ ව්‍රතයේ යෙදුණේ වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හේ අමු පලා බුදින්නේ හෝ වෙයි, බොඩහමු බුදින්නේ හෝ වෙයි. සියදා වී (ඌරුහැල්) බුදින්නේ හෝ වෙයි. සම් ලියාලූ කසට බුදින්නේ හෝ වෙයි. ලහටු ද දිය සෙවෙල් ද බුදින්නේ හෝ වෙයි. සහල්කුඩු බුදින්නේ හෝ වෙයි. දඹු බත් කන්නේ හෝ වෙයි. මුරුවට කන්නේ හෝ වෙයි. තණකොළ කන්නේ හෝ වෙයි. ගොම කන්නේ හෝ වෙයි. තමන් ම වැටුණු පල වළඳනුයේ, වනැ මුල් පල අහර කොටඇත්තේ යැපෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 66,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "7. සො සාණානි පි ධාරෙති, මසාණානි පි ධාරෙති, ඡවදුස්සානි පි ධාරෙති, පංසුකූලානි පි ධාරෙති, තිරීටානි පි ධාරෙති, අජිනානි පි ධාරෙති, අජිනක්ඛිපම්පි ධාරෙති, කුසචීරම්පි ධාරෙති, වාකචීරම්පි ධාරෙති, ඵලකචීරම්පි ධාරෙති, කෙසකම්බලම්පි ධාරෙති, වාළකම්බලම්පි ධාරෙති, උලූකපක්ඛම්පි ධාරෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කෙසමස්සුලොචකොපි හොති කෙසමස්සුලොචනානුයොගමනුයුත්තො, උබ්භට්ඨකො පි{1} හොති ආසනපටික්ඛිත්තො, උක්කුටිකො පි හොති උක්කුටිකප්පධානමනුයුත්තො, කණ්ටකාපස්සයිකො පි හොති කණ්ටකාපස්ෙස සෙය්යං කප්පෙති, ඵලකසෙය්යම්පි කප්පෙති, ථණ්ඩිලසෙය්යම්පි කප්පෙති, එකපස්සයිකො පි හොති රජොජල්ලධරො, අබ්භොකාසිකො පි හොති යථාසන්ථතිකො, වෙකටිකො පි හොති විකටභොජනානුයොගමනු යුත්තො, ආපානකො පි හොති අපානකත්තමනුයුත්තො, සායංතතියකම්පි උදකොරොහනානුයොගමනුයුත්තො විහරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තං කිම්මඤ්ඤසි නිග්රොධ යදි එවං සන්තෙ තපොජිගුච්ඡා පරිපුණ්ණා වා හොති අපරිපුණ්ණා වා?ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අද්ධා ඛො භන්තෙ එවං සන්තෙ තපොජිගුච්ඡා පරිපුණ්ණා හොති නො අපරිපුණ්ණා”ති."
                    },
                    {
                        "type": "centered",
                        "text": "තපො උපක්කිලෙසා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "8. “එවං පරිපුණ්ණාය පි ඛො අහං නිග්රොධ තපොජිගුච්ඡාය අනෙකවිහිතෙ උපක්කිලෙසෙ වදාමී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යථාකථං පන භන්තෙ භගවා එවං පරිපුණ්ණාය තපොජිගුච්ඡාය අනෙකවිහිතෙ උපක්කිලෙසෙ වදතී?ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“ඉධ නිග්රොධ තපස්සී තපං සමාදියති, සො තෙන තපසා අත්තමනො හොති පරිපුණ්ණසංකප්පො. යම්පි නිග්රොධ තපස්සී තපං සමාදියති, සො තෙන තපසා අත්තමනො හොති පරිපුණ්ණසංකප්පො. අයම්පි ඛො නිග්රොධ තපස්සිනො උපක්කිලෙසො’ හොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උභට්ඨකොපි - ස්යා. උබහටකො පි - කම්."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "7. හේ හණ වැහැරි ද දරයි, අන් හූ හා හණ නූල් මුසු කොට වියූ වස්ත්‍ර දරයි, මිණියෙන් බැහැරකෙකාට ලූ වස්ත්‍ර දරයි, ඉවතැ ලූ කඩමාලු රෙදි දරයි, රිටි සුඹුලුයෙන් වියු වස්ත්‍ර දරයි, අඳුන් මුවසම් දරයි. මැදින් පළන ලද කුර සහිත අඳුන් මුව සම් දරයි, කුසතණ ගොතා කළ වැහැරි ද දරයි, නියඳ වැහැරි ද දරයි, මිනිස් කෙහෙයෙන් කළ කම්බිලි ද දරයි. අස්වලග ලොමින් කළ කම්බිලි ද දරයි, මහමුහුණු පියා පතින් කළ වැහැරිද දරයි,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කේසමස්සු ලෝචනානුයෝගයෙහි යෙදුණේ කෙහෙ රවුලු උදුරන්නේ වෙයි, පිළිකෙවු කළ අසුන් ඇත්තේ නැගී (සෘජුව) සිටුනේ වෙයි. උක්කුටිකප්පධානයෙහි (එළිල්ලෙන් හිඳගෙණ කරන වීර්‍ය්‍යයෙහි) යෙදුණේ උත්කුටුක (පැන පැන යන්නේ) ද වෙයි, කණ්ටකාපස්සයික ව්‍රත රක්නේ කටුමැස්සෙහි ශයනය කෙරෙයි, පුවරුයෙහි ශයනය ද කෙරෙයි, බිමැ ශයනය ද කෙරෙයි, එක් ඇලයකින් හෝනේ ද වෙයි, රජස් දැලි දරනුයේ එළිමහනේ වසනුයේ ද වෙයි. අතුරන ලද පරිදි වූ අස්නැ භිඳුනේ ද වෙයි, විකෘත භෝජනයෙහි (ගූථානුභවයෙහි) යෙදුණේ වෛකෘතික ව්‍රතය රක්නේ වෙයි, සිහිල් දිය නො බොනුයේ අපානක ව්‍රතය (සිහිල් දිය නොබොන වත) රක්නේවෙයි, සවස තෙවැනි කොට උදේ මද්දහන සවස යන තුන් වේලෙහි (පව් සෝදන්නට) දියට බසිනුයෙහි යෙදුණේ වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "න්‍යග්‍රෝධයෙනි, එය කිමැයි සිතවූද? ඉදින් මෙසේ ඇති කල්හි තපො ජුගුප්සාව පරිපූර්ණ වේ ද? පරිපූණ නො වේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙසේ ඇති කල්හි තපෝජුගුප්සාව පරිපූණ වෙයි, අපරිපූණ නො වෙයි” පිරිවැජි කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "තප උපක්ලෙෂයෝ",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "8. “න්‍යග්‍රෝධයෙනි, මෙසේ පරිපූර්ණ වූ ද තපොජුගුප්සාවෙහි අනෙකවිධ උපක්ලේශයන් කියමි” යි භාග්‍යවතුන් වහන්සේ වදාළ සේක. ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "“වහන්ස, කෙසේ නම් භාග්‍යවතුන් වහන්සේ මෙසේ පරිපූර්ණ වූ ද තපොජුගුප්සාවෙහි අනෙකවිධ උපක්ලේශයන් වදාරන සේක් ද?” යි පිරිවැජි පුළුවුත."
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “න්‍යලෝධයෙනි, මෙහි තවුස් තෙම තපස සමාදන් කොට ගනී. හේ ඒ තපසින් සතුටු වූ සිතැත්තේ, අවසන් කළ සංකල්ප ඇත්තේ (තෘප්ත වූයේ) වෙයි. න්‍යග්‍රෝධයිනි, තවුස් තෙම යම් තපසක් සමාදන් කොට ගනී නම්, හෝ ඒ තපසින් සතුටු වේ නම්, තෘප්ත වේ නම්, න්‍යග්‍රෝධයෙනි, මෙය ද තවුස් හට උපක්ලේශයෙක් වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 68,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී තපං සමාදියති. සො තෙන තපසා අත්තානුක්කංසෙති පරං වම්භෙති. යම්පි නිග්රොධ තපස්සී තපං සමාදියති. සො තෙන තපසා අත්තානුක්කංසෙති. පරං වම්භෙති. අයම්පි නිග්රොධ තපස්සිනො උපක්කිලෙසො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී තපං සමාදියති. සො තෙන තපසා මජ්ජුති මුච්ඡති පමාදමාපජ්ජති.{1} යම්පි නිග්රොධ තපස්සී තපං සමාදියති, සො තෙන තපසා මජ්ජති මුච්ඡති පමාදමාපජ්ජති, අයම්පි ඛො නිග්රොධ තපස්සිනො උපක්කිලෙසො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී තපං සමාදියති. තෙන තපසා ලාභසක්කාරසිලොකං අභිනිබ්බත්තෙති. සො තෙන ලාභසක්කාරසිලොකෙන අත්තමානො හොති පරිපුණ්ණසංකප්පො. යම්පි නිග්රොධ තපස්සී තපං සමාදියති, සො තෙන තපසා ලාභසක්කාරසිලොකං අභිනිබ්බත්තෙති, සො තෙන ලාභසක්කාරසිලොකෙන අත්තමනො හොති පරිපුණ්ණසංකප්පො. අයම්පි ඛො නිග්රොධ තපස්සිනො උපක්කිලෙසො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී තපං සමාදියති. සො තෙන තපසා ලාභසක්කාර සිලොකං අභිනිබ්බත්තෙති. සො තෙන ලාභසක්කාරසිලොකෙන අත්තානුක්කංසෙති පරං වම්භෙති. යම්පි නිග්රොධ තපස්සී තපං සමාදියති, සො තෙන තපසා ලාභසක්කාරසිලොකං අභිනිබ්බත්තෙති, සො තෙන ලාභසක්කාරසිලොකෙන අත්තානුක්කංසෙති, පරං වම්භෙති. අයම්පි ඛො නිග්රොධ තපස්සිනො උපක්කිලෙසො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී තපං සමාදියති. සො තෙන තපසා ලාභසක්කාරසිලොකං අභිනිබ්බත්තෙති. සො තෙන ලාභසක්කාරසිලොකෙන මජ්ජති මුච්ඡති පමාදමාපජ්ජති. යම්පි ඛො නිග්රොධ තපස්සී තපං සමාදියති, සො තෙන තපසා ලාභසක්කාරසිලොකං අභිනිබ්බත්තෙති, සො තෙන ලාභසක්කාරසිලොකෙන මජ්ජති මුච්ඡති පමාද මාපජ්ජති. අයම්පි ඛො නිග්රොධ තපස්සිනො උපක්කිලෙසො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී තපං සමාදියති, භොජනෙසු වොදාසං ආපජ්ජති ‘ඉදං මෙ ඛමති, ඉදං මෙ නක්ඛමතී’ති. සො යඤ්ච{2} ඛ්වස්ස නක්ඛමති තං සාපෙක්ඛො පජහති. යං පනස්ස ඛමති තං ගථිතො{3} මුච්ඡිතො අජ්ෙඣාපන්නො අනාදීනවදස්සාවී අනිස්සරණපඤ්ඤො පරිභුඤ්ජති -පෙ- අයම්පි ඛො නිග්රොධ තපස්සිනො උපක්කිලෙසො හොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. මදමාපජ්ජති - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. යංහි - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ගථිතො - සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයිනි, තවුස් තෙමේ තපස සමාදන් කොට ගනී. හේ ඒ තපසින් තමා හුවා තබයි, මෙරමා හෙලා දකී. න්‍යග්‍රෝධයෙනි, තවුසකු තපස සමාදන් කොට ගෙන එයින් තමා හුවා තබනු ද මෙරමා හෙලා දකිනු ද යන මෙය ද තවුස්හට උපක්ලේශයෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙමෙ තපස සමාදන් කොට ගනී. හේ එයින් මත් වෙයි, මුසපත් වෙයි, පමාවට පැමීණෙයි. න්‍යග්‍රෝධයෙනි, තවුසක්හු තපස සමාදන් කොට ගෙන එයින් මත් වනු, මුසපත් වනු පමාවට පැමිණෙනු ද තවුස්හට උපක්ලේශයෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "න්‍යග්‍රෝධයෙනි, තව ද තවුස් තෙමේ තපස සමාදන් කොට ගනී, ඒ තපසින් ලාභ සත්කාර කීර්ති උපදවයි. හේ ඒ ලාභ සත්කාර කීර්තියෙන් සතුටු වෙයි, පරිපූර්ණ සංකල්ප ඇත්තේ වෙයි. න්‍යග්‍රෝධයෙනි, තවුසක්හු තපස සමාදන් කොට ගෙන එයින් ලාභ සත්කාර කීර්ති උපදවනු ද ඔහු එයින් සතුටු වනු ද පරිපූර්ණ මනොරථ ඇති වනු ද තවුස් හට උපක්ලේශයෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙමේ තපස සමාදන් කොට ගනී. හෝ එයින් ලාභ සත්කාර කීර්ති උපදවයි. හේ ඒ ලාභ සත්කාර කීර්තියෙන් තමා හුවා තබයි, මෙරමා හෙලා දකී. න්‍යග්‍රෝධයෙනි, තවුසක්හු තපස සමාදන් කොට ගෙන එයින් ලාභ සත්කාර කීර්ති උපදවනු ද එයින් තමා හුවා තබනු ද මෙරමා හෙලා දකිනු ද යන මෙය තවුස්හට උපක්ලේශයෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙමේ තපස සමාදන් කොට ගනී. හේ ඒ තපසින් ලාභ සත්කාර කීර්ති උපදවයි. හේ එයින් මත් වෙයි, මුස පත් වෙයි, පමාවට පැමිණෙයි. න්‍යග්‍රෝධයෙනි, තවුසක්හු තපස සමාදන් කොට ගෙන එයින් ලාභ සත්කාර කීර්ති උපදවනු ද එයින් මත් වනු ද මුස පත් වනු ද පමාවනු ද යන මෙ හැම තවුස්හට උපක්ලේශ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙමේ තපස සමාදන් කොට ගනී. හෝ (තමා ලත්) බොජුන්හි මෙය ‘මට රිසියෙයි, මෙය නො රිසියෙයි’ කියා දෙකොටසකට බෙදන බවට පැමිණෙයි. හේ තමාට නො රිසියෙන බොජුන් තෘෂ්ණා සහිත ව බැහැර කෙරෙයි. තමාට රිසියෙන බොජුන් ගිජු වූයේ මුස පත් වූයේ, එහි ලැගුණේ, ආදීනවමාත්‍රා දු නො දක්නේ ප්‍රත්‍යවේක්ෂණ මාත්‍රා පරිභෝග මාත්‍රා ද නො දන්නේ වළඳයි ... මෙය ද න්‍යග්‍රෝධයෙනි, තවුස්හට උපක්ලේශ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 70,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී තපං සමාදියති ලාභසක්කාරසිලොකනිකන්තිහෙතු ‘සක්කරිස්සන්ති මං රාජානො රාජමහාමත්තා ඛත්තියා බ්රාහ්මණා ගහපතිකා තිත්ථියා’ති. -පෙ- අයම්පි ඛො නිග්රොධ තපස්සිනො උපක්කිලෙසො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී අඤ්ඤතරං සමණං වා බ්රාහ්මණං වා අපසාදෙතා{1} හොති: කිම්පනායං සම්බහුලාජීවො{2} සබ්බං සම්භක්ඛෙති. සෙය්යථිදං මූලබීජං ඛන්ධබීජං ඵළුබීජං අග්ගබීජං බීජබීජමෙව පඤ්චමං අසනිවිචක්කං දන්තකූටං සමණප්පවාදෙනාති -පෙ- අයම්පි ඛො නිග්රොධ තපස්සිනො උපක්කිලෙසො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "9. පුන ච පරං නිග්රොධ තපස්සී පස්සති අඤ්ඤතරං සමණං වා බ්රාහ්මණං වා කුලෙසු සක්කරියමානං ගරුකරියමානං මානියමානං පූජියමානං දිස්වා තස්ස එවං ‘හොති ඉමඤ්හි නාම සම්බහුලාජීවං කුලෙසු සක්කරොන්ති ගරු කරොන්ති මානෙන්ති පූජෙන්ති, මං පන තපස්සිං ලූඛාජීවිං කුලෙසු න සක්කරොන්ති න ගරු කරොන්ති න මානෙන්ති න පූජෙන්තී’ති, ඉති සො ඉස්සාමච්ඡරියං කුලෙසු උප්පාදෙතා හොති -පෙ- අයම්පි ඛො නිග්රොධ තපස්සිනො උපක්කිලෙසො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී ආපාතකනිසාදී{3} හොති. යම්පි ඛො නිග්රොධ තපස්සි ආපාතකනිසාදී හොති අයම්පි ඛො නිග්රොධ තපස්සිනො උපක්කිලෙසො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී අත්තානං ආදස්සයමානො කුලෙසු චරති ඉදම්පි මෙ තපස්මිං ඉදම්පි මෙ තපස්මින්ති. -පෙ- අයම්පි ඛො නිග්රොධ තපස්සිනො උපක්කිලෙසො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී කිඤ්චිදෙව පටිච්ඡන්නං සෙවති සො ‘ඛමති තෙ ඉදන්ති?’ පුට්ඨො සමනො අක්ඛමමානං ආහ ‘ඛමතී’ති ඛමමානං ආහ ‘නක්ඛමතී’ති. ඉති සො සම්පජානමුසා භාසිතා හොති -පෙ- අයම්පි ඛො නිග්රොධ තපස්සිනො උපක්කිලෙසො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී තථාගතස්ස සන්තඤ්ඤෙව පරියායං අනුඤ්ඤෙය්යං නානුජානාති -පෙ- අයම්පි ඛො නිග්රොධ තපස්සිනො උපක්කිලෙසො හොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අපරාසෙතා - කම්."
                    },
                    {
                        "type": "footnote",
                        "text": "2. බහුලාජීවො - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ආපාථකනිසාදි - සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙමේ ‘රජුන් ද රාජ මහාමාත්‍යයන් ද ක්ෂත්‍රියයන් ද බ්‍රාහ්මණයන් ද ගෘහපතියන් ද තිර්ථකයන් ද මට සත්කාර කරතැ’යි ලාභ සත්කාර කීර්ති අපේක්ෂායෙන් තපස සමාදන් කොට ගනී ද ... මෙය ද තවුස්හට උපක්ලේශ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, ‘කිමෙක් ද? මෙ තෙම පසය බහුල කොට ඇති වැ දිවි පවත්වන්නේ, මූලවීජ, ස්කන්ධවීජ, පරුවීජ, අග්‍රවීජ, පස්වනු වීජවීජ යන හැම දැයක් ම කා දමයි. මොහුගේ දත් (එයට හසු වන සියල්ල සුණු විසුණු කරන) මහ හෙන සකක් වැන්න, එහෙත් ශ්‍රමණ නාමයෙන් මොහු හඳුනති’යි කියා තවුස් තෙමේ කිසි යම් මඟණකු හෝ බමුණකු හෝ හෙලා දක්නේ වේ ද, මෙය ද තවුස්හට උපක්ලේශ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "9. තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙම කුලයන්හි සත්කාර කරනු ලබන, ගෞරව කරනු ලබන, බුහුමන් කරනු ලබන, පුදනු ලබන කිසි යම් මහණකු හෝ බමුණකු හෝ දකී ද, දැකීමෙන් ‘පසය බහුල කොටැති වැ දිවි පවත්වන මොහුට කුලයන්හි සත්කාර කරත්, ගෞරව කරත්, බුහුමන් කරත්, පුදත්. රූක්ෂ වැ ජීවත් වන මට වනාහි කුලයන්හි සත්කාර නො කරත්, ගෞරව නො කරත්, බුහුමන් නො කරත්, පූජා නො කරත්’ යැ යි ඔහුට මෙසේ සිතෙක් වෙයි ද, හෙ තෙමේ මෙසේ කුලයන් කෙරෙහි ඊර්ෂ්‍යයාවත් මාත්සර්යයත් උපදවන්නේ වෙයි ද … න්‍යග්‍රෝධයෙනි, මෙය ද තවුස්හට උපක්ලේශ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙමේ තපස් කරනුයේ මිනිසුනට පෙනෙන තන්හි හිඳුනේ වෙයි ද, න්‍යග්‍රෝධයෙනි, මේ මිනිසුනට පෙනෙන තන්හි හිඳ තපස් කරන බව තවුස්හට උපක්ලේශයෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙම මේ ද මගේ තපස යි මේ ද මගේ තපසැ යි තමාගේ ගුණ දක්වනුයේ කුලයන්හි හැසිරෙයි ද ... න්‍යග්‍රෝධයෙනි, මෙය ද තවුස්හට උපක්ලේශයෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙම තමාගේ කිසි දොසක් සඟොවා ගෙන හැසිරෙයි ද, මෙය ඔබට කැප ද?’ යි විචාරන ලදුයේ ම නො කැප දැය කැප යැ යි කියයි ද, කැප දැය කැප නො වේ යැ යි කියයි ද, මෙසේ හෙ තෙමේ දදැන මුසවා කියන්නේ වේ ද … න්‍යග්‍රෝධයෙනි, මෙය ද තවුස්හට උපක්ලේශයෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, දහම් දෙසන තථාගතයන්ගේ හෝ තථාගත ශ්‍රාවකයකුගේ හෝ අනුදැනියැ යුතු (මැනැවැ යි අනුමෙවියැ යුතු) ඇත්තා වූ ම දේශනාව නො අනුදනී ද ... න්‍යග්‍රෝධය, මෙය ද තවුස්භට උපක්ලේශයෙක් වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 72,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී කොධනො හොති උපනාහී. යම්පි නිග්රොධ තපස්සී කොධනො හොති උපනාහී, අයම්පි ඛො නිග්රොධ තපස්සිනො උපක්කිලෙසො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී මක්ඛී හොති. පළාසී{1} -පෙ- උස්සුකී හොති මච්ඡරී -පෙ- සඨො හොති මායාවී -පෙ- ථද්ධො හොති අතිමානී -පෙ- පාපිච්ඡො හොති පාපිකානං ඉච්ඡානං වසං ගතො -පෙ- මිච්ඡාදිට්ඨිකො හොති අන්තග්ගාහිකාය දිට්ඨියා සමන්නාගතො -පෙ- සන්දිට්ඨිපරාමාසී හොති ආධානග්ගාහී දුප්පටිනිස්සග්ගී. යම්පි නිග්රොධ තපස්සී සන්දිට්ඨපරාමාසී හොති ආධානග්ගාහී දුප්පටිනිස්සග්ගී, අයම්පි ඛො නිග්රොධ තපස්සිනො උපක්කිලෙසො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තං කිම්මඤ්ඤසි නිග්රොධ යදි මෙ තපොජිගුච්ඡා උපක්කිලෙසා වා අනුපක්කිලෙසා වා?ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“අද්ධා ඛො ඉමෙ භන්තෙ තපොජිගුච්ඡා උපක්කිලෙසා නො අනුපක්කිලෙසා. ඨානං ඛො පනෙතං භන්තෙ විජ්ජති, යං ඉධෙකච්චො තපස්සී සබ්බෙහෙව ඉමෙහි උපක්කිලෙසෙහි සමන්නාගතො අස්ස, කො පන වාදො අඤ්ඤතරඤ්ඤතරෙනා?”ති."
                    },
                    {
                        "type": "centered",
                        "text": "පරිසුද්ධපපටිකප්පත්ති-කථා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "10. ඉධ නිග්රොධ තපස්සී තපං සමාදියති, සො තෙන තපසා න අත්තමනො හොති න පරිපුණ්ණසංකප්පො. යම්පි නිග්රොධ තපස්සී තපං සමාදියති, සො තෙන තපසා න අත්තමනො හොති න පරිපුණ්ණසංකප්පො. එවං සො තස්මිං ඨානෙ පරිසුද්ධො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී තපං සමාදියති. සො තෙන තපසා න අත්තානුක්කංසෙති, න පරං වම්භෙති. යම්පි නිග්රොධ තපස්සී තපං සමාදියති, සො තෙන තපසා න අත්තානුක්කංසෙති, න පරං වම්භෙති. එවං සො තස්මිං ඨානෙ පරිසුද්ධො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "11. පුන ච පරං නිග්රොධ තපස්සී තපං සමාදියති. සො තෙන තපසා න මජ්ජති න මුච්ඡති න පමාදමාපජ්ජති. යම්පි නිග්රොධ තපස්සී තපං සමාදියති. සො තෙන තපසා න මජ්ජති න මුච්ඡති න පමාදමාපජ්ජති. එවං සො තස්මිං ඨානෙ පරිසුද්ධො හොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පලාසී - ස්යා. PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුසෙක් ක්‍රෝධ කරන සුලු වෙයි. වෛර බඳින සුලු වෙයි. න්‍යග්‍රෝධයෙනි, තවුසෙක් ක්‍රෝධ කරන සුලු ය, වෛර බඳින සුලු ය යන මෙය ද තවුස්හට උපක්ලේශයෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුසෙක් ගුණමකු වෙයි. උතුමන් තමා හා සම කොට සිතන්නේ වෙයි, ඊර්ෂ්‍යා කරන්නේ වෙයි, මසුරු වෙයි, කෛරාටික වෙයි, කළ වරද සඟොවන මායා ඇත්තේ වෙයි, තෙත් ගති නැත්තේ කරුණාව නැත්තේ තද ගති ඇත්තේ වෙයි, අධිකමාන ඇත්තේ වෙයි. ලාමක ඊප්සා ඇත්තේ ලාමක ඊප්සාවනට වශග වූයේ වෙයි, උච්ඡේදදාෂ්ටියෙන් සමන්විත මිසදිටුවෙක් වෙයි. තමා ගත් දෘෂ්ටිය පරාමර්ශනය කරනුයේ, දැඩි කොට ගත්තේ, බැහැරැ කැරැවිය නො හැකි සේ ගත් දෘෂ්ටි ඇත්තේ වෙයි. න්‍යග්‍රෝධයෙනි, ගුණමකු වෙයි ... තමා ගත් දෘෂ්ටිය පරාමර්ශන කරනුයේ දැඩි කොට ගත්තේ, බැහැර කැරැවිය නො හැකි දෘෂ්ටි ඇත්තේ වෙයි යන යමෙක් ඇද්ද, මෙය ද තවුස්හට උපක්ලේශයෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“න්‍යග්‍රෝධයෙනි, එය කිමැ යි සිතවු ද? මේ තපෝජුගුප්සාවෝ උපක්ලේශ ඇත්තෝ ද? නැත හොත් උපක්ලේශ නැත්තෝ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මේ තපෝජුගුප්සාවෝ උපක්ලේශ ඇත්තෝ වෙත්, උපක්ලේශ නැත්තෝ නො වෙත්. වහන්ස, මෙහි එක්තරා තවුසෙක් මේ සියලු උපක්ලේශයන්ගෙන් සමන්විත වන්නේ ය යන මේ කාරණය ඒකාන්තයෙන් ඇත්තේ ය. එක්තරා උපක්ලේශයෙකින් සමන්විත වන්නේ ය යනු කියනු ම කවරේ ද?” යි තවුසා කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "පරිශුද්ධ ප්‍රපාටිකාප්‍රාප්ති කථා",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "10. න්‍යග්‍රෝධයෙනි, මෙහි තවුස් තෙම තපස සමාදන් කොට ගනී. හේ තපසින් ආරාධිත සිතැත්තේ නො වෙයි, පරිපූර්ණ සංකල්ප ඇත්තේ නො වෙයි. මෙසේ හෙ තෙම එ තන්හි පිරිසිදු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙම තපස සමාදන් කොට ගනී. හේ ඒ තපසින් තමා හුවා නො තබයි, මෙරමා හෙලා නො දකි. මෙසේ හේ එ තන්හි පිරිසිදු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "11. තව ද න්‍යග්‍රෝධයෙනි,තවුස් තෙම තපස සමාදන් කොට ගනී. හේ ඒ තපසින් මත් නො වෙයි, මුස පත් නො වෙයි, පමාවට නො පැමිණෙයි. න්‍යග්‍රෝධයෙනි, යම් හෙයකින් තවුසා තපස සමාදන් කොට ගනී ද හේ ඒ තපසින් මත් නො වෙයිද මුස පත් නො වෙයිද පමාවකට නො පැමිණෙයිද මෙසේ හෙ තෙම එ කරුණෙහි පිරිසිදු වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 74,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී තපං සමාදියති. සො තෙන තපසා ලාභසක්කාරසිලොකං අභිනිබ්බත්තෙති. සො තෙන ලාභසක්කාරසිලොකෙන න අත්තමනො හොති න පරිපුණ්ණසංකප්පො. යම්පි නිග්රොධ තපස්සී තපං සමාදියති සො තෙන තපසා ලාභසක්කාරසිලොකං අභිනිබ්බත්තෙති. සො තෙන ලාභසක්කාරසිලොකෙන න අත්තමනො හොති න පරිපුණ්ණසංකප්පො. එවං සො තස්මිං ඨානෙ පරිසුද්ධො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී තපං සමාදියති. සො තෙන තපසා ලාභසක්කාරසිලොකං අභිනිබ්බත්තෙති. සො තෙන ලාභසක්කාරසිලොකෙන න අත්තානුක්කංසෙති න පරං වම්භෙති. යම්පි නිග්රොධ තපස්සී තපං සමාදියති සො තෙන තපසා ලාභසක්කාරසිලොකං අභිනිබ්බත්තෙති. සො තෙන ලාභසක්කාරසිලොකෙන න අත්තානුක්කංසෙති න පරං වම්භෙති. එවං සො තස්මිං ඨානෙ පරිසුද්ධො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී තපං සමාදියති. සො තෙන තපසා ලාභසක්කාරසිලොකං අභිනිබ්බත්තෙති. සො තෙන ලාභසක්කාරසිලොකෙන න මජ්ජති න මුච්ඡති න පමාදමාපජ්ජති. යම්පි නිග්රොධ තපස්සී තපං සමාදියති සො තෙන තපසා ලාභසක්කාරසිලොකං අභිනිබ්බත්තෙති. සො තෙන ලාභසක්කාරසිලොකෙන න න මජ්ජති න මුච්ඡති න පමාදමාපජ්ජති. එවං සො තස්මිං ඨානෙ පරිසුද්ධො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී තපං සමාදියති. භොජනෙසු න වොදාසං ආපජ්ජති ‘ඉදං මෙ ඛමති, ඉදං මෙ නක්ඛමතී’ති. සො යඤ්ච ඛ්වස්ස නක්ඛමති තං අනපෙක්ඛො පජහති. යං පනස්ස ඛමති තං අගථිතො අමුච්ඡිතො අනජ්ඣාපන්නො ආදීනවදස්සාවී නිස්සරණපඤ්ඤො පරිභුඤ්ජති, එවං සො තස්මිං ඨානෙ පරිසුද්ධො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී න තපං සමාදියති, ලාභසක්කාරසිලොකනිකන්තිහෙතු ‘සක්කරිස්සන්ති මං රාජානො රාජමහාමත්තා ඛත්තියා බ්රාහ්මණා ගහපතිකා තිත්ථියා’ති. එවං සො තස්මිං ඨානෙ පරිසුද්ධො හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙම තපස සමාදන් කොට ගනී. හේ ඒ තපසින් ලාභ සත්කාර කීර්ති උපදවයි, හේ ඒ ලාභ සත්කාර කීර්තියෙන් ආරාධිත සිතැත්තේ නො වෙයි. පිරිපුන් සංකල්ප ඇත්තේ නො වෙයි. න්‍යග්‍රෝධයෙනි, යම් හෙයකින් ම තවුස් තෙම තපස සමාදන් කොට ගනී ද, හේ ඒ තපසින් ලාභ සත්කාර කීර්ති උපදවා ද, හේ ලාභ සත්කාර කීර්තියෙන් ආරාධිත සිතැත්තේ නො වෙයි ද, පිරිපුන් මනෝරථය ඇත්තේ නො වෙයි ද, මෙසේ හේ එ කරුණෙහි පිරිසිදු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙම තපස සමාදන් කොට ගනී. හේ ඒ තපසින් ලාභ සත්කාර කීර්ති උපදවයි. හේ ලාභ සත්කාර කීර්තියෙන් තමා හුවා නො තබයි. මෙරමා හෙලා නො දකී. න්‍යග්‍රෝධයෙනි, යම් හෙයකින් තවුස් තෙම තපස සමාදන් කොට ගනී ද, ඒ තපසින් ලාභ සත්කාර කීර්ති උපදවා ද, හේ ඒ ලාභ සත්කාර කීර්තියෙන් තෙම හුවා නො තබා ද, මෙරමා හෙලා නො දකී ද, මෙසේ හෙ තෙම එ කරුණෙහි පිරිසිදු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙම තපස සමාදන් කොට ගනී. හේ ඒ තපසින් ලාභ සත්කාර කීර්ති උපදවයි, හේ ඒ ලාභ සත්කාර කීර්තියෙන් මත් නො වෙයි, මුසපත් නො වෙයි, පමාවකට නො පැමිණෙයි. න්‍යග්‍රෝධයෙනි, යම් හෙයකින් තවුස් තෙම තපස සමාදන් කොට ගනී ද, හේ ඒ තපසින් ලාභ සත්කාර කීර්ති උපදවා ද, හේ ඒ ලාභ සත්කාර කීර්තියෙන් මත් නො වේ ද, පමාවකට නො පැමිණේ ද, මෙසේ හේ එ කරුණෙහි පිරිසිදු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "න්‍යග්‍රෝධයෙනි, තව ද තවුස් තෙම තපස සමාදන් කොට ගනී ද, ‘මෙය මට රිසියෙයි, මෙය මට නො රිසියෙයි’ කියා බොජුන්හි දෙකොටසකට බෙදීමට නො පැමිණෙයි ද, තමාට නොරිසි දැය ආශා නැති ව බැහැර කෙරේ ද, තමාට රිසි දැය ගිජු නො වූයේ මුස පත් නො වූයේ, සිතින් එහි නො ගිලුණේ, ආදීනව දක්නා සුලු වූයේ, ප්‍රතිග්‍රහණ ප්‍රත්‍යවෙක්ෂණ ප්‍රමාණ දන්නේ වළඳා ද, මෙසේ හේ එ කරුණෙහි පිරිසිදු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙම ‘රාජ රාජමහාමාත්‍ය ක්ෂත්‍රිය බ්‍රහ්මණ ගෘහපති තිර්‍ථක යන මොවුන් මට සත්කාර කරති’යි ලාභ සත්කාර කීර්තියෙහි ඇලුම් හෙයින් තපස සමාදන් කොට නො ගනී ද, මෙසේ හේ එ කරුණෙහි පිරිසිදු වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 76,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී අඤ්ඤතරං සමණං වා බ්රාහ්මණං වා නාපසාරෙතා හොති: කිම්පනායං සම්බහුලාජීවො සබ්බං සම්භක්ඛෙති. සෙය්යථිදං, මූලබීජං ඛන්ධබීජං ඵළුබීජං අග්ගබීජං බීජබීජමෙව පඤ්චමං, අසනිවිචක්කං දන්තකූටං සමණප්පවාදෙනාති, එවං සො තස්මිං ඨානෙ පරිසුද්ධො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී පස්සති අඤ්ඤතරං සමණං වා බ්රාහ්මණං වා කුලෙසු සක්කරියමානං ගරුකරියමානං මානියමානං පූජියමානං. දිස්වා තස්ස න එවං හොති: ඉමඤ්හි නාම සම්බහුලාජීවිං කුලෙසු සක්කරොන්ති ගරුකරොන්ති මානෙන්ති පූජෙන්ති. මං පන තපස්සිං ළුඛාජීවිං කුලෙසු න සක්කරොන්ති න ගරුකරොන්ති න මානෙන්ති න පූජෙන්තීති, ඉති සො ඉස්සාමච්ඡරියං කුලෙසු අනුප්පාදෙතා හොති, එවං සො තස්මිං ඨානෙ පරිසුද්ධො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී න ආපාතකනිසාදී හොති එවං සො තස්මිං ඨානෙ පරිසුද්ධො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී න අත්තානං අදස්සයමානො කුලෙසු චරති ‘ඉදම්පි මෙ තපස්මිං, ඉදම්පි මෙ තපස්මින්ති’, එවං සො තස්මිං ඨානෙ පරිසුද්ධො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී න කිඤ්චිදෙව පටිච්ඡන්නං සෙවති, සො ‘ඛමති තෙ ඉදන්ති?’ පුට්ඨො සමානො අක්ඛමමානං ආහ නක්ඛමතීති. ඛමමානං ආහ ඛමතී ති, ඉති සො සම්පජානමුසා න භාසිතා හොති. එවං සො තස්මිං ඨානෙ පරිසුද්ධො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී තථාගතස්ස වා තථාගතසාවකස්ස වා ධම්මං දෙසෙන්තස්ස සන්තං යෙව පරියායං අනුඤ්ඤෙය්යං අනුජානාති, එවං සො තස්මිං ඨානෙ පරිසුද්ධො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී අක්කොධනො හොති අනුපනාහී. යම්පි නිග්රොධ තපස්සී අක්කොධනො හොති අනුපනාහී, එවං සො තස්මිං ඨානෙ පරිසුද්ධො හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙම ‘කිමෙක් ද? පසය බහුල කොට ඇති වැ දිවි පවත්වන මේ තෙමේ මූලබීජ, ස්කන්ධබිජ, පරුබීජ, අග්‍රබිජ, පස් වනු බිජ බිජ ම දැ යි යන සියල්ල කා දමයි, මොහුගේ දත් (එයට හසු වන සියල්ල සුණුවිසුණු කරන) මහත් හෙන සකක් වැන්න, එහෙත් ශ්‍රමණ නාමයෙන් මොහු හඳුනති’ යි කිසි මහණකු හෝ බමුණකු හෙලා දක්නේ නො වේ ද, මෙසේ හේ එ කරුණෙහි පිරිසිදු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුසෙක් කුලයන්හි සත්කාර කරනු ලබන, ගෞරව කරනු ලබන, බුහුමන් කරනු ලබන, පුදනු ලබන එක්තරා මහණකු හෝ බමුණකු හෝ දක්නේ ද, දැකීමෙන් “පසය බහුල කොටැති ව දිවි පවත්වන මොහුටත් කුලයන්හි සත්කාර කරත්, ගරු කරත්, බුහුමන් කරත්, පූජා කරත්, රූක්ෂ පැවැත්මෙන් දිවි පවත්වන තපස් වූ මට කුලයන්හි සත්කාර නො කරත්, ගරු නො කරත්, බුහුමන් නො කරත්, පූජා නො කරත් යැ” යී ඔහුට මෙසේ සිතෙක් නො වන්නේ ද, මෙසේ හෙ තෙමේ කුලයන් කෙරෙහි ඊර්‍ෂ්‍යා මාත්සර්ය නො උපදවන්නේ වේ ද, මෙසේ හෝ එ කරුණෙහි පිරිසිදු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙම “මේත් මගේ තපෝගුණයෙක, මේත් මගේ තපෝගුණයෙකැ”යි තමා දක්වනුයේ කුලයන්හි නො හැසිරෙයි ද, මෙසේ හේ එ කරුණෙහි පිරිසිදු වෙයි."
                    },
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙම කිසි දු පිළිසන් තැනක් නො සෙවී ද (කිසි දොසක් සඟොවා ගෙන නො හැසිරෙයි ද), හෙ තෙම ‘මෙය ඔබට කැප ද?’ යි විචාරන ලදුයේ ම, කැප නො වන දැය ‘නො කැප යැ’ යි කියා ද, කැප වන දය ‘කැප යැ’ යි කියා ද, මෙසේ හේ දැන දන මුසවා නො බෙණෙන්නේ ද, මෙපරිද්දෙන් හේ එ කරුණෙහි පිරිසිදු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙම දහම් දෙසන්නා වූ තථාගතයන්ගේ හෝ තථාගත ශ්‍රාවකයකුගේ හෝ අනුදත යුතු වූ ම (අනුමෙවියැ යුතු වූ ම) ධර්ම කථාව අනුදනී ද, මෙසේ හේ එ කරුණෙහි පිරිසිදු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙම ක්‍රෝධ නො කරන්නේ වෛර නො බඳින්නේ වේ ද, න්‍යග්‍රෝධයෙනි, ‘තවුසා ක්‍රෝධ නො කරන්නේ ය, වෛර නො බඳින්නේ ය’ යන යමෙක් ඇද්ද, මෙසේ එ කරුණෙහි තවුස් තෙම පිරිසිදු වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 78,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං නිග්රොධ තපස්සී අමක්ඛී හොති අපලාසී -පෙ- අනුස්සුකී හොති අමච්ඡරී -පෙ- අසඨො හොති අමායාවී -පෙ- අත්ථද්ධො හොති අනතිමානී -පෙ- න පාපිච්ඡො හොති න පාපිකානං ඉච්ඡානං වසං ගතො, න මිච්ඡාදිට්ඨිකො හොති න අන්තග්ගාහිකාය දිට්ඨියා සමන්නාගතො -පෙ- න සන්දිට්ඨිපරාමාසී හොති න ආධානග්ගාහී සුප්පටිනිස්සග්ගී. යම්පි නිග්රොධ තපස්සී න සන්දිට්ඨිපරාමාසී හොති න ආධානග්ගාහී සුප්පටිනිස්සග්ගී, එවං සො තස්මිං ඨානෙ පරිසුද්ධො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තං කිම්මඤ්ඤසි නිග්රොධ? යදි එවං සන්තෙ තපොජිගුච්ඡා පරිසුද්ධා වා හොති අපරිසුද්ධා වා?ති”"
                    },
                    {
                        "type": "paragraph",
                        "text": "අද්ධා ඛො භන්තෙ එවං සන්තෙ තපොජිගුච්ඡා පරිසුද්ධා හොති නො අපරිසුද්ධා, අග්ගප්පත්තා ච සාරප්පත්තා චා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“න ඛො නිග්රොධ එත්තාවතා තපොජිගුච්ඡා අග්ගප්පත්තා ච හොති සාරප්පත්තා ච. අපි ච ඛො පපටිකප්පත්තා ව{1} හොතී”ති."
                    },
                    {
                        "type": "centered",
                        "text": "පරිසුද්ධත්වප්පත්තකතා - කථා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "12. “කිත්තාවතා පන භන්තෙ තපොජිගුච්ඡා අග්ගප්පත්තා ච හොති සාරප්පත්තා ච. සාධු මෙ භන්තෙ භගවා තපොජිගුච්ඡාය අග්ගඤ්ඤෙව පාපෙතු, සාරඤ්ඤෙව පාපෙතූ”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“ඉධ නිග්රොධ තපස්සී චාතුයාමසංවරසංවුතො හොති. කථඤ්ච, නිග්රොධ තපස්සී චාතුයාමසංවරසංවුතො හොති?"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පපටිකපත්තාව - කම්."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "තව ද න්‍යග්‍රෝධයෙනි, තවුස් තෙමේ ගුණමකු නො වේ ද, යුගග්‍රාහී නො වේ ද ... ඊර්‍ෂ්‍යා නො කරන්නේ මසුරු බව් නො කරන්නේ වේ ද ... ශඨ නො වන්නේ වංචා නැත්තේ වේ ද ... තද ගති නැත්තේ අධික මාන නැත්තේ වේ ද ... ලාමක ආශා නැත්තේ ලාමක ආශාවනට වශග නො වූයේ වේ ද ... මිසදිටු නො වනුයේ අන්තග්‍රාහික මිසදිටුයෙන් යුක්ත නො වේ ද ... තමා ගත් දෘෂ්ටිය පරාමර්ශනය නො කරනුයේ දැඩි ගැනුම් නැත්තේ පහසුයෙන් බැහැරැ කළ හැකි දෘෂ්ටි ඇත්තේ වේ ද, න්‍යග්‍රෝධයෙනි, මේ තවුස් තෙමේ තමා ගත් දෘෂ්ටිය පරාමර්ශනය නො කරන්නේ ය, දඩි ගැනුම් නැත්තේ ය, පහසුවෙන් බැහැරැ කට හැකි දෘෂ්ටි ඇත්තේ ය යන යමෙක් ඇද්ද, මෙසේ හේ එ කරුණෙහි පිරිසිදු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“න්‍යග්‍රෝධයෙනි, එය කිමැ යි සිතහි ද? ඉදින් මෙසේ ඇති කල්හි තපෝජුගුප්සාව පිරිසිදු හෝ වේ ද? අපිරිසිදු හෝ වේ ද?”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙසේ ඇති කල්හි තපෝජුගුප්සාව ඒකාන්තයෙන් පිරිසිදු වෙයි, අපිරිසිදු නො වේ, මුදුන් පැමිණියේ වේ, හරයට පැමිණියේ වේ යැ” යි පිරිවැජියා කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“න්‍යග්‍රෝධයෙනි, මෙ තෙකින් තපෝජුගුප්සාව මුදුන් පැමිණියේ ද නො වේ, හරයට පැමිණියේ ද නො වේ. වැලිදු පිට සුඹුලට පැමිණියේ ම වේ” යැ යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "පරිශුද්ධ - ත්වක්ප්‍රාප්තකතා - කථාව",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "12. “වහන්ස, තපෝජුගුප්සාව කොතෙකින් මුදුන් පැමිණියේ වේ ද, හරයට පැමිණියේ වේ ද? යාච්ඤා කරම්. වහන්ස, භාග්‍යවතුන් වහන්සේ මට තපෝජුගුප්සාවගේ මුදුන ම දක්වා දම් දෙසන සේක් වා, හරය ම දක්වා දම් දෙසන සේක් වා” යි පිරිවැජි කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“න්‍යග්‍රෝධයෙනි, මෙහි තවුස් තෙමේ චාතුර්යාම සංවරයෙන් හැවුරුණේ වෙයි. න්‍යග්‍රෝධයෙනි, තවුස් තෙමේ කෙසේ නම් චාතුර්යාම සංවරයෙන් හැවුරුණේ වේ ද? යත්:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 80,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉධ නිග්රොධ තපස්සී න පාණමතිපාතෙති, න පාණමතිපාතාපයති, න පාණමතිපාතයතො සමනුඤ්ඤො හොති. න අදින්නං ආදියති, න අදින්නං ආදියාපෙති, න අදින්නං ආදියතො සමනුඤ්ඤො හොති, න මුසා භණති, න මුසා භණාපෙති, න මුසා භණතො සමනුඤ්ඤො හොති, න භාවිතමාසිංසති, න භාවිතමාසිංසාපෙති, න භාවිතමාසිංසතො සමනුඤ්ඤො හොති. එවං ඛො නිග්රොධ තපස්සී චාතුයාමසංවරසංවුතො හොති, යතො ඛො නිග්රොධ තපස්සී චාතුයාමසංවරසංවුතො හොති, අදුං චස්ස හොති තපස්සිතාය. සො අභිහරති නො හීනායාවත්තති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සො විවිත්තං සෙනාසනං භජති අරඤ්ඤං රුක්ඛමූලං පබ්බතං කන්දරං ගිරිගුහං සුසානං වනපත්ථං අබ්භොකාසං පලාලපුඤ්ජං. සො පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො නිසීදති පල්ලඞ්කං ආභුජිත්වා, උජුං කායං පණිධාය, පරිමුඛං සතිං උපට්ඨපෙත්වා. සො අභිජ්ඣං ලොකෙ පහාය විගතාභිජ්ඣෙන චෙතසා විහරති, අභිජ්ඣාය චිත්තං පරිසොධෙති. බ්යාපාදපදොසං පහාය අබ්යාපන්නචිත්තො විහරති, සබ්බපාණභූතහිතානුකම්පීබ්යාපාදපදොසාචිත්තං පරිසොධෙති. ථිනමිද්ධං පහාය විගතථිනමිද්ධො විහරති, ආලොකසඤ්ඤී සතො සම්පජානො ථිනමිද්ධා චිත්තං පරිසොධෙති. උද්ධච්චකුක්කුච්චං පහාය අනුද්ධතො විහරති, අජ්ඣත්තං වූපසන්තචිත්තො උද්ධච්චකුක්කුච්චා චිත්තං පරිසොධෙති. විචිකිච්ඡං පහාය තිණ්ණවිචිකිච්ඡො විහරති, අකථංකථී කුසලෙසු ධම්මෙසු, විචිකිච්ඡාය චිත්තං පරිසොධෙති. සො ඉමෙ පඤ්චනීවරණෙ පහාය චෙතසො උපක්කිලෙසෙ පඤ්ඤාය දුබ්බලීකරණෙ, මෙත්තාසහගතෙන චෙතසා එකං දිසං ඵරිත්වා විහරති, තථා දුතියං, තථා තතියං, තථා චතුත්ථං. ඉති උද්ධමධො තිරියං සබ්බධි සබ්බත්තතාය සබ්බාවන්තං ලොකං මෙත්තාසහගතෙන චෙතසා විපුලෙන මහග්ගතෙන අප්පමාණෙන අවෙරෙන අබ්යාපජ්ජෙන ඵරිත්වා විහරති. කරුණාසහගතෙන චෙතසා -පෙ- මුදිතාසහගතෙන චෙතසා -පෙ- උපෙක්ඛාසහගතෙන චෙතසා එකං දිසං ඵරිත්වා විහරති, තථා දුතියං, තථා තතියං, තථා චතුත්ථං. ඉති උද්ධමධො තිරියං සබ්බධි සබ්බත්තතාය සබ්බාවන්තං ලොකං උපෙක්ඛාසහගතෙන චෙතසා විපුලෙන මහග්ගතෙන අප්පමාණෙන අවෙරෙන අබ්යාපජ්ජෙන ඵරිත්වා විහරති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "න්‍යග්‍රෝධයෙනි, මෙහි තවුස් තෙම පණිවා නො කෙරෙයි, පණිවා නො කරවයි, පණිවා කරන්නක්හට නො ම අනුදන්නේ වෙයි. මෙරමා අයත් නො දුන් දෑ නො ගනී, නො දුන් දෑ නො ද ගන්වයි, නො දුන් දැය ගන්නහුට අනුදන්දෙන් ද නො වෙයි. බොරු නො කිය යි, බොරු නො ද කියව යි, බොරු කියන්නහුට අනුදන්නේ ද නො වෙයි. පස් කම් සුව සෙව්නේ නො වෙයි, පස් කම් ගුණ සෙවවන්නේ නො වෙයි, පස් කම් ගුණ සෙවුනාහට අනුදන්නේ ද නො වෙයි. න්‍යග්‍රෝධයෙනි, මෙසේ තවුස් තෙමේ චාතුර්යාම සංවරයෙන් හැවුරුණේ වෙයි. මෙය ඔහුගේ තවුස් බව වෙයි. හේ එය මතුමත්තට ගෙන යෙයි (වඩයි), ගිහි බවට නො පෙරැළෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හෙ තෙමේ අරණක්, රුක්මුලක්, පව්වක්, කඳුරක්, ගීරි ලෙනක්, සොහොනක්, වනපෙතක්, එළි මහනක්, පිදුරු ගොඩක් යන මේ කිසි විවික්ත වූ යම් සෙනස්නක් බෙපේයි. හේ පිණ්ඩපාතයෙන් පෙරළා ආයේ පසු බත්හි පළක් බැඳ කය සෘජු කොට පිහිටුවා, සිහිය කමටහනට යොමු කොට එළවා හිඳියි. හේ ලොවැ (අත්බව කෙරෙහි) ඇල්ම හැර, (විෂ්කම්භණ ප්‍රහාණ වශයෙන්) පහ වූ අභිධ්‍යාව ඇති සිතින් වෙසෙයි. අභිධ්‍යාව කෙරෙන් සිත පිරිසිදු කෙරෙයි. ව්‍යාපාද සංඛ්‍යාත ප්‍රද්වේෂ්ය (ක්‍රෝධය) පහ කොට, ව්‍යාපාද රහිත සිතැත්තේ, සියලු පණ ඇති සතුන් කෙරේ අනුකම්පා ඇති වැ වෙසෙයි. (විෂ්කම්භණ වශයෙන්) ක්‍රෝධය කෙරෙන් සිත පිරිසිදු කෙරෙයි. ස්ත්‍යාන මිද්ධය හැර පහ වූ ස්ත්‍යාන මිද්ධය ඇතිව, දව රෑ දෙක්හි ම දුටු එළිය හඳුනනු හැකි පිරිසිදු සංඥා ඇත්තේ, ස්මෘතිමත් වැ, නුවණ ඇති ව, ස්ත්‍යාන මිද්ධය කෙරෙන් සිත පිරිසිදු කෙරෙයි. උද්ධච්වය ද (සිතැ නො සංහුන් බව ද) කුක්කුච්චය ද (කළ නො කළ දයෙහි පසුතැවිල්ල ද) සිතින් දුරැලා, සංසුන් වූයේ සංහිඳුණු සිත් සතන් ඇත්තේ, උද්ධච්ච කුක්කුච්ව දෙක කෙරෙන් සිත පිරිසිදු කෙරෙයි. විචිකිච්ඡාව (සැකය) දුරැලා, තිණූ (ඉක්මි) සැක ඇත්තේ, කුසල් දහම්හි සැක නො කරනුයේ වෙසෙයි, විචිකිච්ඡාව කෙරෙන් සිත පිරිසිදු කෙරෙයි. හේ නුවණ දුබල කරන, සිත කෙලෙසන මේ පංච නීවරණයන් (විෂ්කම්භණ ප්‍රහාණයෙන්) පහ කොට, මෛත්‍රීසහිත සිතින් එක් දිසාවක් පැතිරැගෙන වෙසෙයි. එසේ ම දෙවෙනි දිශාව ද, තෙවෙනි දිශාව ද, සිවුවැනි දිශාව ද, මෛත්‍රී සහිත සිතින් පැතිර වෙසෙයි. මෙසේ උඩ ද යට ද සරස ද යන හැම තන්හි සර්වාත්මතායෙන් (තමා හා සම කොට) සර්වසත්ත්‍වවත් (සියලු සතුන් ඇති) ලෝකය (හෙවත් මුළු ලොව) (ස්ඵරණ වශයෙන්) විපුල වූ, (භූමි වශයෙන්) මහද්ගත වූ (ආලම්බන වශයෙන්) අප්‍රමාණ වූ ව්‍යපාද රහිත (දොම්නස් නැති බැවින්) නිදුක් වූ මෛත්‍රී සහගත සිතින් පැතිරැ ගෙන වෙසෙයි. … කරුණා සහගත සිතින් … මුදිතාසහගත සිතින් ... උපෙක්ෂා සහගත සිතින් එක් දිශාවක් පැතිර ගෙන වෙසෙයි, එසේ දෙවෙනි දිශාව ද තෙවෙනි දිශාව ද සිවුවැනි දිශාව ද පැතිරැගෙන වෙසෙයි. මෙසේ උඩ ද යට ද සරස ද හැම තන්හි සර්වාත්මතායෙන් සර්වවත් ලොකය විපුල වූ මහද්ගත වූ අප්‍රමාණ වූ, වෛර නැති දොම්නස් නැති උපෙක්ෂා සහගත සිතින් පැතිර ගෙන වෙසෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 82,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තං කිම්මඤ්ඤසි නිග්රොධ යදි එවං සන්තෙ තපොජිගුච්ඡා පරිසුද්ධා වා හොති. නො අපරිසුද්ධා,"
                    },
                    {
                        "type": "paragraph",
                        "text": "“අද්ධා ඛො භන්තෙ එවං සන්තෙ තපොජිගුච්ඡා පරිසුද්ධා හොති නො අපරිසුද්ධා, අග්ගප්පත්තා ච සාරප්පත්තා’චා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“න ඛො නිග්රොධ එත්තාවතා තපොජිගුච්ඡා අග්ගප්පත්තා ච හොති සාරප්පත්තා ච, අපි ච ඛො තචප්පත්තා හොතී”ති."
                    },
                    {
                        "type": "centered",
                        "text": "පරිසුද්ධඵෙග්ගුපත්තකතා - කථා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "13. “කිත්තාවතා ච ඛො පන භන්තෙ තපොජිගුච්ඡා අග්ගප්පත්තා ච හොති සාරප්පත්තා ච? සාධු මෙ භන්තෙ භගවා තපොජිගුච්ඡාය අග්ගඤ්ඤෙව පාපෙතු සාරඤ්ඤෙව පාපෙතූ”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“ඉධ නිග්රොධ තපස්සී චාතුයාමසංවරසංවුතො හොති. කථඤ්ච පන නිග්රොධ තපස්සී චාතුයාම සංවරසංවුතො හොති. -පෙ- යතො ඛො නිග්රොධ තපස්සී එවං චාතුයාමසංවරසංවුතො හොති අදුං චස්ස හොති තපස්සිතාය. සො අභිහරති නො හීනායාවත්තති. සො විවිත්තං සෙනාසනං භජති -පෙ- සො ඉමෙ පඤ්චනීවරණෙ පහාය චෙතසො උපක්කිලෙසෙ පඤ්ඤාය දුබ්බලීකරණෙ මෙත්තාසහගතෙන චෙතසා -පෙ- ඵරිත්වා වාහරති. සො අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති, සෙය්යථිදං එකම්පි ජාතිං ද්වෙ පි ජාතියො තිස්සො පි ජාතියො චතස්සො පි ජාතියො පඤ්ච පි ජාතියො දස පි ජාතියො වීසම් පි ජාතියො තිංසම්පි ජාතියො චත්තාළීසම්පි ජාතියො පඤ්ඤාසම්පි ජාතියො ජාතිසතම්පි ජාතිසහස්සම්පි ජාතිසතසහස්සම්පි, අනෙකානි පි ජාතිසතානි අනෙකානි පි ජාතිසහස්සානි අනෙකානිපි ජාතිසතසහස්සානි, අනෙකෙ පි සංවට්ටකප්පෙ අනෙකෙ පි විවට්ටකප්පෙ අනෙකෙ පි සංවට්ටවිවට්ටකප්පෙ: අමුත්රාසිං එවන්නාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො අමුත්ර උදපාදිං. තත්රාපාසිං එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො ඉධූපපන්නො”ති. ඉති සාකාරං සඋද්දෙසං අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තං කිම්මඤ්ඤසි නිග්රොධ, යදි එවං සන්තෙ තපොජිගුච්ඡා පරිසුද්ධා වා හොති අපරිසුද්ධා වා?”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "“න්‍යග්‍රෝධයෙනි, ඉදින් මෙසේ ඇති කල්හි තපෝජුගුප්සාව පිරිසිදු ද නොහොත් අපිරිසිදු ද?” යි භාග්‍යවතුන් වහන්සේ අසා වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙසේ ඇති කල්හි ඒකාන්තයෙන් තපෝජුගුප්සාව පිරිසිදු වෙයි, අපිරිසිදු නො වෙයි, අග්‍රප්‍රාප්ත ද සාරප්‍රාප්ත ද වේ” යැ යි පිරිවැජි කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“න්‍යග්‍රෝධයෙනි, මෙ පමණෙකින් තපෝජුගුප්සාව අග්‍රප්‍රාප්ත ද සාරප්‍රාප්ත ද නො වේ ම ය. වැලි එහි පොත්ත බඳු බවට පැමිණියේ වේ” යැ යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "පරිශුද්ධ ඵල්ගුප්‍රාප්තකතා කථාව",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "13. “වහන්ස, කොපමණෙකින් තපෝජුගුප්සාව අග්‍රප්‍රාප්ත සාරප්‍රාප්තත් වේ ද? යාච්ඤා කරම්, වහන්ස, භාග්‍යවතුන් වහන්සේ මට තපෝජුගුප්සාවේ අග ම (දේශනයෙන්) පමුණුවන සේක් වා, භරය ම (දේශනායෙන්) පමුණුවන සේක් වා” යි පිරිවැජි කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“න්‍යග්‍රෝධයෙනි, මෙහි තවුස් තෙම චාතුර්යාම සංවරයෙන් හැවුරුණේ වෙයි. කෙසේ නම් තවුස් තෙම චාතුර්යාම සංවරයෙන් හැවුරුණේ වේ ද? යත්: ... න්‍යග්‍රෝධයෙනි යම් කලෙක තවුස් තෙම මෙසේ වාතුර්යාම සංවරයෙන් හැවුරුණේ වේ ද, එය ඔහුගේ තපස්වී බව වෙයි. හෙ තෙම එය වඩ යි, ගිහි බවට පෙරළා නො හැරෙයි: හේ ... විවික්ත සෙනස්නක් බෙජෙයි. හේ සිත කෙලෙසන, ප්‍රඥාව දුබල කරන මේ පංච නීවරණ දුරුකොට, මෛත්‍රීසහගත සිතින් … පැතිර ගෙන වෙසෙයි. හේ අනෙකවිධ පෙරැවුසූ කඳ පිළිවෙළ සිහි කෙරෙයි: “අසෝ තැනැ මෙනම් ඇති වීමි, මෙගොත් ඇති වීමි, මෙවන් පැහැ ඇත්තෙම් වීමි, මෙවන් අහර ඇත්තෙම් වීමි, මෙ බඳු සුවදුක් විඳුනෙම් වීමි, මෙ තෙක් ආයු සිමා ඇතියෙම් වීමි, ඒ මම් එයින් සැව අසෝ තැන උපනිමි. එහි ද මෙනම් ඇත්තෙම්, මෙබඳු ගොත් ඇත්තේතම්, මෙබඳු පැහැ ඇත්තෙම්, මෙබඳු අහර ඇත්තෙම්, මෙසේ සුවදුක් විඳුනෙම්, මෙසේ වූ ආයු ශීමා ඇතියෙම් වීමි. ඒ මම් එයින් සැව, මෙහි උපනිමි’යි. මෙසේ එක් ජාතියක් ද ජාති දෙකක් ද ජාති තුනක් ද ජාති සතරක් ද ජාති පසක් ද ජාති දහයක් ද ජාති විස්සක් ද ජාති තිසක් ද ජාති සතළිසක් ද ජාති පනසක් ද ජාති සියයක් ද ජාති දහසක් ද ජාති සිය දහසක් ද නොයෙක් සිය ගණන් ජාතීන් ද නොයෙක් දහස් ගණන් ජාතීන් ද නොයෙක් සිය දහස් ගණන් ජාතීන් ද නොයෙක් සංවර්ත කල්ප ද නොයෙක් විවර්ත කල්පද නොයෙක් සංවර්ත විවර්ත කල්ප දැ යි ආකාර සහිත උද්දේස සහිත නොයෙක් වැදෑරුම් පෙරැවුසූ කඳ පිළිවෙළ සිහි කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "න්‍යග්‍රෝධයෙනි, එය කිමැයි සිතවූ ද? ඉදින් මෙසේ ඇති කල්හි තපෝජුගුප්සාව පිරිසිදු වේ ද? නැත හොත් අපිරිසිදු වේ ද?” යි භාග්‍යවතුන් වහන්සේ අසා වදාළ සේක.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 84,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“අද්ධා ඛො භන්තෙ එවං සන්තෙ තපොජිගුච්ඡා පරිසුද්ධා හොති නො අපරිසුද්ධා, අග්ගප්පත්තා ච සාරප්පත්තා චා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“න ඛො නිග්රොධ එත්තාවතා තපොජිගුච්ඡා අග්ගප්පත්තා ච හොති සාරප්පත්තා ච. අපි ච ඛො ඵෙග්ගුප්පත්තා හොතී”ති."
                    },
                    {
                        "type": "centered",
                        "text": "පරිසුද්ධ අග්ගප්පත්තසාරප්පත්තකතා - කථා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "14. “කිත්තාවතා පන භන්තෙ තපොජිගුච්ඡා අග්ගප්පත්තා ච හොති සාරප්පත්තා ච? සාධු මෙ භන්තෙ භගවා තපොජිගුච්ඡාය අග්ගඤ්ඤෙව පාපෙතු සාරඤ්ඤෙව පාපෙතූ”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“ඉධ නිග්රොධ තපස්සී චාතුයාමසංවරසංවුතො හොති. කථඤ්ච නිග්රොධ තපස්සී චාතුයාමසංවරසංවුතො හොති -පෙ- යතො ඛො නිග්රොධ තපස්සී චාතුයාමසංවරසංවුතො හොති, අදුං චස්ස හොති තපස්සිතාය. සො අභිහරති නො හීනායාවත්තති. සො විවිත්තං සෙනාසනං භජති -පෙ- සො ඉමෙ පඤ්ච නීවරණෙ පහාය චෙතසො උපක්කිලෙසෙ පඤ්ඤාය දුබ්බලීකරණෙ, මෙත්තාසහගතෙන චෙතසා -පෙ- උපෙක්ඛාසහගතෙන චෙතසා විපුලෙන මහග්ගතෙන අප්පමාණෙන අවෙරෙන අබ්යාපජ්ජෙන ඵරිත්වා විහරති. සො අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති. සෙය්යථිදං එකම්පි ජාතිං ද්වෙපි ජාතියො -පෙ- ඉති සාකාරං සඋද්දෙසං අනෙක විහිතං පුබ්බෙනිවාසං අනුස්සරති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සො දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සති චවමානෙ උපපජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති “ඉමෙ වත භොන්තො සත්තා කායදුච්චරිතෙන සමන්නාගතා වචීදුච්චරිතෙන සමන්නාගතා මනොදුච්චරිතෙන සමන්නාගතා අරියානං උපවාදකා මිච්ඡාදිට්ඨිකා මිච්ඡාදිට්ඨිකම්මසමාදානා, තෙ කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපන්නා. ඉමෙ වා පන භොන්තො සත්තා කායසුචරිතෙන සමන්නාගතා වචීසුචරිතෙන සමන්නාගතා මනොසුචරිතෙන සමන්නාගතා අරියානං අනුපවාදකා සම්මාදිට්ඨිකා සම්මාදිට්ඨිකම්මසමාදානා. තෙ කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නා”ති. තං කිම්මඤ්ඤසි නිග්රොධ යදි එවං සන්තෙ තපොජිගුච්ඡා පරිසුද්ධා වා හොති අපරිසුද්ධා වා?”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙසේ ඇති කල්හි තපෝජුගුප්සාව ඒකාන්තයෙන් පිරිසිදු වෙයි, අපිරිසිදු නො වෙයි, අග්‍රප්‍රාප්ත ද සාරප්‍රාප්ත ද වේ යැ”යි පිරිවැජි කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“න්‍යග්‍රෝධයෙනි, මෙතෙකින් තපෝජුගුප්සාව අග්‍රප්‍රාප්ත ද සාරප්‍රාප්ත ද නො වෙයි. වැලි දු එහි ඵළයට පැමිණියේ වේ” යැ යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "පරිශුද්ධ - අග්‍රප්‍රාප්තසාරප්‍රාප්තතා - කථාව",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "14. “වහන්ස, කොතෙකින් තපෝජුගුප්සාව අග්‍රප්‍රාප්තත් සාරප්‍රාප්තත් වේ ද? යාච්ඤා කරම්, වහන්ස, භාග්‍යවතුන් වහන්සේ මට තපෝජුගුප්සාවගේ කෙළවර ම සාරය ම (දේශනායෙන්) පමුණුවන සේක් වා” යි පිරිවැජි කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“න්‍යග්‍රෝධයෙනි, මෙහි තවුස් තෙම චාතුර්යාම සංවරයෙන් හැවුරුණේ වෙයි. න්‍යග්‍රෝධයෙනි, කෙසේ නම් තවුස් තෙම චාතුර්යාම සංවරයෙන් හැවුරුණේ වේ ද? ... යම් විටෙක තවුස් තෙම චාතුර්යාම සංවරයෙන් හැවුරුණේ වේ ද, එය ඔහුගේ තවුස් බව වේ. හෙ තෙම එය මතු මත්තට ගෙන යයි, ගිහි බවට නො පෙරැළෙයි. හේ ... විවික්ත සෙනස්නක් බෙජෙයි ... සිත කෙලෙසන, නුවණ දුබල කරන, මේ පංව නීවරණයන් ප්‍රහීණ කොට, විපුල වූ මහද්ගත වූ අප්‍රමාණ වූ අවෛර වූ දොම්නස් රහිත වූ මෛත්‍රී සහගත සිතින් … උපෙක්ෂා සහගත සිතින් පැතිර ගෙන වෙසෙයි. හේ එක් ජාතියක් ද ජාති දෙකක් ද ... මෙසේ ආකාර සහිත ව උද්දෙස සහිත ව අනෙකවිධ වූ පෙර වුසූ කඳ පිළිවෙළ සිහි කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හේ මිනිසුන්ගේ දකුම් ඉම ඉක්මා පැවැති පිරිසිදු දිවැසින් ‘අහෝ, මේ භවත් සත්වයෝ කායදුශ්චරිතයෙන් යුක්ත වූවාහු, වාග්දුශ්චරිතයෙන් යුක්ත වූවාහු, මනෝදුශ්චරිතයෙන් යුක්ත වූවාහු, ආර්යෝපවාද කරන්නාහු, මිසදිටු ගත්තාහු, මිථ්‍යාදෘෂ්ටිකර්ම සමාදාන ඇත්තෝ වූහ. ඒ මොහු කාබුන් මරණින් මතු සැපයෙන් පහ වූ, දුකට ස්ථාන වූ, සතුන් විවශ ව පතිත වන තැන වූ නිරයට වන්නාහ. මේ සත්හු වූ කලී කායසුචරිතයෙන් යුක්ත වූවාහු, වාක්සුචරිතයෙන් යුක්ත වූවාහු, මනස්සුචරිතයෙන් යුක්ත වූවාහු, ආර්යයනට උපවාද නො කළාහු, සම්දිට් ඇත්තාහු, සම්‍යග්දෘෂ්ටි විසින් ගත් කර්ම සමාදාන ඇත්තාහු ය. ඒ මොහු කාබුන් මරණින් මතු සැපයට ස්ථාන වූ සඟ ලොවට පැමිණියාහ’ යි පහත් වූ ද, උසස් වූ ද, සුරූප වූ ද, විරූප වූ ද, ධනවත් වූ ද, දිළිඳු වූ ද, තම තමන්ගේ කර්මයට අනුරූප වැ එළ බැ සිටියා වූ මරණාසන්න වූ ද, එ කෙණෙහි උපන්නා වූ ද, සත්ත්‍වයන් දකියි. න්‍යග්‍රෝධයිනි, එය කිමැයි සිතවු ද? ඉදින් මෙසේ ඇති කල්හි තපෝජුගුප්සාව පිරිසිදු ද නොහොත් නො පිරිසිදු ද?” යි අසා වදාළ සේක.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 86,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“අද්ධා ඛො භන්තෙ එවං සන්තෙ තපොජිගුච්ඡා පරිසුද්ධා හොති, නො අපරිසුද්ධා, අග්ගප්පත්තා ච සාරප්පත්තා චා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“එත්තාවතා ඛො නිග්රොධ තපොජිගුච්ඡා අග්ගප්පත්තා ච හොති සාරප්පත්තා ච. ඉති ඛො නිග්රොධ{1} යං මං ත්වං අවචාසි: කො නාම සො භන්තෙ භගවතො ධම්මො යෙන භගවා සාවකෙ විනෙති, යෙන භගවතා සාවකා විනීතා අස්සාසප්පත්තා පටිජානන්ති අජ්ඣාසයං ආදිබ්රහ්මචරියන්ති. ඉති ඛො තං නිග්රොධ ඨානං උත්තරිතරඤ්ච පණීතතරඤ්ච යෙනාහං සාවකෙ විනෙමි, යෙන මයා සාවකා විනීතා අස්සාසප්පත්තා පටිජානන්ති අජ්ඣාසයං ආදිබ්රහ්මචරියන්ති”."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං වුත්තෙ තෙ පරිබ්බාජකා උන්නාදිනො උච්චාසද්දමහාසද්දා අහෙසුං “එත්ථ මයං අනස්සාම සාචරියකා, එත්ථ මයං පනස්සාම සාචරියකා න මයං ඉතො භිය්යො උත්තරිතරං පජානාමා”ති."
                    },
                    {
                        "type": "centered",
                        "text": "නිග්රොධස්ස පජ්ඣායනං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "15. යදා අඤ්ඤාසි සන්ධානො ගහපති ‘අඤ්ඤදත්ථු ඛො’ දානිමෙ අඤ්ඤතිත්ථියා පරිබ්බාජකා භගවතො භාසිතං සුස්සූසන්ති, සොතං ඔදහන්ති, අඤ්ඤාචිත්තං උපට්ඨපෙන්තී’ති. අථ නිග්රොධං පරිබ්බාජකං එතදවොච: ඉති ඛො භන්තෙ නිග්රොධ යං මං ත්වං අවචාසි, ‘යග්ඝෙ ගහපති ජානෙය්යාසි කෙන සමණො ගොතමො සද්ධිං සල්ලපති? කෙන සාකච්ඡං සමාපජ්ජති? කෙන පඤ්ඤාවෙය්යත්තියං සමාපජ්ජති? සුඤ්ඤාගාරහතා සමණස්ස ගොතමස්ස පඤ්ඤා, අපරිසාවචරො සමණො ගොතමො නාලං සල්ලාපාය, සො අන්තමන්තානෙව සෙවති. සෙය්යථාපි නාම ගො කාණා පරියන්තචාරිනී අන්තමන්තානෙව සෙවති. එවමෙව සුඤ්ඤාගාරහතං සමණස්ස ගොතමස්ස පඤ්ඤා, අපරිසාවචරො සමණො ගොතමො, නාලං සල්ලාපාය, සො අන්තමන්තානෙව සෙවති. ඉංඝ ච ගහපති සමණො ගොතමො ඉමං පරිසං ආගච්ඡෙය්ය, එකපඤ්හෙනෙව නං සංසාදෙය්යාම, තුච්ඡකුම්භී’ව නං මඤ්ඤෙ ඔරොධෙය්යාමා”ති. අයං ඛො සො භන්තෙ භගවා අරහං සම්මාසම්බුද්ධො ඉධානුප්පත්තො. අපරිසාවචරං පන නං කරොථ, ගොකාණං පරියන්තචාරිනිං කරොථ, එකපඤ්හෙනෙව නං සංසාදෙථ, තුච්ඡකුම්භීව නං මඤ්ඤෙ ඔරොධෙථා”ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අථ නං නිග්රොධං - කම්."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "“වහන්ස, මෙසේ ඇති කල්හි තපෝජුගුප්සා ව ඒකාන්තයෙන් පිරිසිදු වේ. අපිරිසිදු නො වේ, අග්‍රප්‍රාප්ත ද සාරප්‍රාප්ත ද වේ” යැ යි පිරිවැජි කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“න්‍යග්‍රෝධයිනි, තපෝජුගුප්සාවාදී තීර්ථකයන්ගේ සමය පරිදි තපෝජුගුප්සාව මෙතෙකින් අග්‍රප්‍රාප්ත ද සාරප්‍රාප්ත ද වේ. න්‍යග්‍රෝධයිනි, ‘යමෙකින් භාග්‍යවතුන් වහන්සේ විසින් ශ්‍රාවකයෝ හික්මවන ලද්දාහු, සතුටට පැමිණියාහු උත්තම නිඃශ්‍රය වූ පැරැණිතම බඹසරක් පිළින කෙරෙද් ද, භාග්‍යවතුන් වහන්සේගේ ඒ ධර්මය කවරේ ද?” යි යම් වචනයක් තෙපි මට කිවු ද (යම් ප්‍රශ්නයක් තෙපි මා විචාළහු ද), එහි ලා මා විසින් හික්මවන ලද ශ්‍රාවකයෝ මෙයින් සතුටට පැමිණියම්හ යි උත්තමානිඃශ්‍රය වූ යම් ආදි බ්‍රහ්මචර්යයක් පිළින කෙරෙත් ද, න්‍යග්‍රෝධයෙනි, මෙසේ ඒ කාරණය මේ ඉහත කී හැමට ම වඩා ශ්‍රේෂ්ඨ ද වඩා උතුම් ද වේ” යැ යි වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මෙසේ වදාළ කල්හි ඒ පිරිවැජියෝ “මෙහි ආචාර්යයා සහිත වූ, අපි නටුවම්භ, මෙහි ආචාර්යයා සහිත වූ අපි වැනසුණම්හ. අපි මෙයට වැඩි තරම් කිසිවක් මෙයට වඩා ශේෂ්ඨ දැයක් නො දන්මහ”යි උද්ඝෝෂවත් වූවාහු උස් භඩ මහ හඩ ඇත්තෝ වූ හ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "න්‍යග්‍රෝධයාගේ ප්‍රධ්‍යානය",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "15. සන්ධාන ගෘහපති තෙතම යම් විටෙක මේ අන්තොටු පිරිවැජියෝ භාග්‍යවතුන් වහන්සේගේ වචනය අසනු කැමැත්තාහ යි, එයට කන් එළවත් යැ යි, දැන ගැන්ම පිණිස සිත යොමු කෙරෙත් යැ යි දැන ගත්තේ ද, එ කල්හි න්‍යග්‍රෝධ පිරිවැජියා අමතා “වහන්ස, න්‍යග්‍රෝධයෙනි, ‘එසේ නම් ගැහැවීය, දනුව. කවරකු හා මහණ ගොයුම් කතාබස් කෙරේ ද? කවරකු හා සාකච්ඡාවට බස්නේ ද? කවරකු හා උතුරු පිළිතුරු කතායෙන් ප්‍රඥාව්‍යක්තතාවට පැමිණේ ද? මහණ ගොයුම්හුගේ ප්‍රඥාව ශුන්‍යයාගාරයන්හි ම නටුයේ ය. මහණ ගොයුම් අවිසාර ද බැවින් පිරිස් මැදට බස්නට නො හැක්කේ ය. ආලාපසංලාපයට සමත් නො වෙයි. කිසිවක් ඇඟැ හැපෙතැයි බියෙන් මඟ හැර යන එකැස් කණ දෙනක මෙන් ප්‍රශ්න අසතැ යි බියෙන් ගමින් බොහෝ දුරැ සෙනසුන් සෙව්නේ ය. එ බැවින් දැන ගනුව ගැහැවිය, මහණ ගොයුම් මේ පිරිසට ආවොත් එක් ප්‍රශ්නයෙන් ම ඔහු යටපත් කරන්නමු. හිස් කළයක් (ඒ මේ අත පෙරළා බැඳ තබන්නාක්) සෙයින් වාද කථායෙන් බැඳ තබන්නමු” යි මෙසේ ඔබ මට යම් වචනයක් කීවෙන් ද, වහන්ස, ඒ අර්හත් සම්‍යක්සම්බුද්ධ භාග්‍යවතුන් වහන්සේ දැන් මෙහි වැඩ ඉන්නා සේක. උන්වන්හසේ පිරිස් මැදට නො බස්නකු කරන්න, මඟැ අයින් වෙවි යන දෙනක වැන්නකු කරන්න. එක් ප්‍රශ්නයෙකින් ම උන්වහන්සේ යටපත් කරන්න, හිස් කළයක් මෙන් උන්වහන්සේ පෙරළා බැඳ තබන්නා යි කී ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 88,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "16. “එවං වුත්තෙ නිග්රොධො පරිබ්බාජකො තුණ්හීභූතො මඞ්කුභූතො පත්තක්ඛන්ධො අධොමුඛො පජ්ඣායන්තො අප්පටිභාණො නිසීදි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා නිග්රොධං පරිබ්බාජකං තුණ්හීභූතං මඞ්කුභූතං පත්තක්ඛන්ධං අධොමුඛං පජ්ඣායන්තං අප්පටිභාණං විදිත්වා නිග්රොධං පරිබ්බාජකං එතදවොච; “සච්චං කිර නිග්රොධ භාසිතා තෙ එසා වාචා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“සච්චං භන්තෙ භාසිතා මෙ එසා වාචා යථා බාලෙන යථා මූළ්හෙන යථා අකුසලෙනා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තං කිම්මඤ්ඤසි නිග්රොධ, කින්ති තෙ සුතං පරිබ්බාජකානං වුද්ධානං මහල්ලකානං ආචරියපාචරියානං භාසමානානං යෙ තෙ අහෙසුං අතීතමද්ධානං අරහන්තො සම්මාසම්බුද්ධා, එවං සු තෙ භගවන්තො සංගම්ම උන්නාදිනො උච්චාසද්දමහාසද්දා අනෙකවිහිතං තිරච්ඡානකථං අනුයුත්තා විහරිංසු, සෙය්යථිදං රාජ කථං චොරකථං -පෙ- ඉතිභවාභවකථං ඉති වා, සෙය්යථාපි ත්වං එතරහි සාචරියකො? උදාහු එවං සු තෙ භගවන්තො අරඤ්ෙඤවනපත්ථානි පන්තානි සෙනාසනානි පටිසෙවන්ති අප්පසද්දානි අප්පනිග්ඝොසානි විජනවාතානි මනුස්සරාහසෙය්යකානි පටිසල්ලානසාරුප්පානි, සෙය්යථාපාහං එතරහී?”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“සුතං මෙතං භන්තෙ පරිබ්බාජකානං වුද්ධානං මහල්ලකානං ආචරියපාචරියානං භාසමානානං: ‘යෙ තෙ අහෙසුං අතීතමද්ධානං අරහන්තො සම්මාසම්බුද්ධා, න එවං සු තෙ භගවන්තො සංගම්ම සමාගම්ම උන්නාදිනො උච්චාසද්දමහාසද්දා අනෙකවිහිතං තිරච්ඡානකථං අනුයුත්තා විහරන්ති, සෙය්යථිදං රාජකථං චොරකථං -පෙ- ඉතිභවාභවකථං ඉති වා, සෙය්යථාපාහං එතරහි සාචරියකො. එවං සු තෙ භගවන්තො අරඤ්ඤවනපත්ථානි පන්තානි සෙනාසනානි පටිසෙවන්ති අප්පසද්දානි අප්පනිග්ඝොසානි විජනවාතානි මනුස්සරාහසෙය්යකානි පටිසල්ලානසාරුප්පානි සෙය්යථාපි භගවා එතරහී”’ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "16. මෙසේ කී කල්හි න්‍යග්‍රෝධ පිරිවැජි තෙම නිහඬ වූයේ තෙද නැත්තේ, කර බා ගත්තේ, යටට හෙලූ මුහුණ ඇත්තේ, සිතිවිලි සිතනුයේ, කිසිත් වටහාගත නො හැකිව හුන්නේ ය. ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "එ කලැ භාග්‍යවතුන් වහන්සේ න්‍යග්‍රෝධ පිරිවැජියා නිහඬ වැ තෙද නැති වැ කර බා ගත්තකු ව යටට හෙලූ මුහුණ ඇති වැ සිතිවිලි සිතමින් වැටහෙන නුවණක් නැති වැ හුන්නහු දැන, ඔහු බණවා, ‘න්‍යග්‍රෝධයෙනි, සැබෑ ද? තොප ඒ වවන කීවා ද?’ යි අසා වදාළ සේක."
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, එවැනි බසක් කියන්නට තරම් ම අඥාන වූ මූඪ වූ අදක්ෂ වූ මා විසින් ඒ වචන කියන ලද,” යි පිරිවැජි කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“න්‍යග්‍රෝධයෙනි. ඒ කිමැ යි සිතවූ ද? කරුණු කියන්නා වූ, වයසින් වැඩී සිටි, මහළු වූ තොපගේ ආචාර්ය ප්‍රාචාර්යයන්ගේ වචනය තොප විසින් කෙසේ අසන ලද ද? ඉකුත් කල්හි යම් රහත් සම්මාසම්බුදු කෙනෙක් වූහු නම්, ඒ භාග්‍යවත්හු එක් රැස් ව එක් රැස් වැ ඝෝෂවත් ව උස්හඬ මහ හඬ ඇති ව, ඇදුරා සහිත ව, අද තොප කරන නියායෙන් රාජ කථා චෝර කථා ... ඉතිභවාභව කථා ය යන අනෙකවිධ තිරශ්චීන කථායෙහි යෙදී වුසූහු ද? නොහොත් දැන් මා කරන සෙයින් ඒ භගවත්හු අල්පශබ්ද ඇති, මඳ වූ හඬ ඇති, ජනවාත විරහිත, මන්ත්‍රණාදි මිනිසුන්ගේ රහස් ක්‍රියාවනට සුදුසු ව පිහිටි, විවේකයට නිසි වූ, වෙනෙහි දුර සෙනසුන්, වඩාත් දුරැ වූ මනුෂෙයාපචාර විරහිත සෙනසුන් සෙවිත් දැ?”යි භාග්‍යවතුන් වහන්සේ පුළුවුත් සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, ඉකුත් කල්හි යම් රහත් සම්මාසම්බුදු කෙනෙක් වූහු නම්, ඒ භගවත්හු එක් රැස් ව එක් රැස් වැ ඝෝෂවත් ව උස් හඬ මහ හඬ ඇති ව, ඇදුරා සහිත වැ අද මා කරන නියායෙන් රාජ කථා චෝර කථා ... ඉතිභවාභවකථා යන අනෙකවිධ තිරශ්චීන කථායෙහි යෙදී නො වූසූහ. දැන් භාග්‍යවතුන් වහන්සේ සෙයින් අල්පශබ්ද ඇති, මඳ වූ හඬ ඇති, ජනවාත විරහිත, මන්ත්‍රණාදි මිනිසුන්ගේ රහස් ක්‍රියාවනට සුදුසු ව පිහිටි, විවේකයට නිසි වූ, වනයෙහි දුරැ පිහිටි සෙනසුන්, මනුෂෙයාපචාර විරහිත වඩාත් දුරැ සෙනසුන් සෙවිත්” යැ යි මේ පිළිබඳ ව කරුණු කියනු වයෝවෘද්ධ වූ මහලු වූ ආචාර්ය ප්‍රාචාර්ය වූ පිරිවැජියන්ගේ මේ වචනය මා විසින් අසන ලද” යි පිරිවැජි කී ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 90,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“තස්ස තෙ නිග්රොධ විඤ්ඤුස්ස සතො මහල්ලකස්ස න එතදහොසි: බුද්ධො සො භගවා බොධාය ධම්මං දෙසෙති, දන්තො සො භගවා දමථාය ධම්මං දෙසෙති, සන්තො සො භගවා සමථාය ධම්මං දෙසෙති, තිණ්ණො සො භගවා තරණාය ධම්මං දෙසෙති, පරිනිබ්බුතො සො භගවා පරිනිබ්බානාය ධම්මං දෙසෙතී?”ති."
                    },
                    {
                        "type": "centered",
                        "text": "බ්රහ්මචරියපරියොසාන-සච්ඡිකිරියා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "17. “එවං වුත්තෙ නිග්රොධො පරිබ්බාජකො භගවන්තං එතදවොච: “අච්චයො මෙ භන්තෙ අච්චගමා යථා බාලං යථා මූළ්හං යථා අකුසලං, ස්වාහං එවං භගවන්තං අවචාසිං. තස්ස මෙ භන්තෙ භගවා අච්චයං අච්චයතො පටිගණ්හාතු ආයතිං සංවරායා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තග්ඝ ත්වං නිග්රොධ අච්චයො අච්චගමා යථාබාලං යථා මූළ්හං යථා අකුසලං, යො මං ත්වං එවං අවචාසි. යතො ච ඛො ත්වං නිග්රොධ අච්චයං අච්චයතො දිස්වා යථාධම්මං පටිකරොසි, තන්තෙ මයං පටිගණ්හාම, වුද්ධි හෙසා නිග්රොධ අරියස්ස විනයෙ, යො අච්චයං අච්චයතො දිස්වා යථාධම්මං පටිකරොති, ආයතිං සංවරං ආපජ්ජති. අහං ඛො පන නිග්රොධ එවං වදාමි: “එතු විඤ්ඤූ පුරිසො අසඨො අමායාවී උජුජාතිකො. අහමනුසාසාමි, අහං ධම්මං දෙසෙමි: යථානුසිට්ඨං තථා පටිපජ්ජමානො යස්සත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජන්ති, තදනුත්තරං බ්රහ්මචරියපරියොසානං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරිස්සති සත්ත වස්සානි."
                    },
                    {
                        "type": "paragraph",
                        "text": "තිට්ඨන්තු නිග්රොධ සත්ත වස්සානි. එතු විඤ්ඤූ පුරිසො අසඨො අමායාවී උජුජාතිකො, අහමනුසාසාමි, අහං ධම්මං දෙසෙමි. යථානුසිට්ඨං තථා පටිපජ්ජමානො යස්සත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජන්ති, තදනුත්තරං බ්රහ්මචරියපවයොසානං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරිස්සති ඡ වස්සානි -පෙ- පඤ්ච වස්සානි -පෙ- චත්තාරි වස්සානි -පෙ- තීණි වස්සානි -පෙ- ද්වෙ වස්සානි -පෙ- එකං වස්සං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "“න්‍යග්‍රෝධයෙනි, විඥ වූ ම මහළු වූ ඒ තොපට, ‘ඒ භගවත් තෙමේ සත්‍යාවබෝධය කෙළේ ම මෙරමාගේ සත්‍යයාවබෝධය පිණිස දහම් දෙසයි, ඒ භගවත් තෙමේ ඉන්‍ද්‍රයදමනයෙන් දාන්ත වූයේ ම අනුන්ගේ ඉන්‍ද්‍රය දමනය පිණිස දහම් දෙසයි, ඒ භගවත් තෙමේ ශාන්ත වූයේ ම අනුන්ගේ ශාන්තිය පිණිස දහම් දෙසයි, ඒ භගවත් තෙමේ ඔඝතරණය කෙළේ ම අනුන්ගේ ඔඝතරණය පිණිස දහම් දෙසයි, ඒ භාග්‍යවත් තෙමේ කෙලෙස් පිරිනිවනින් පිරිනිවියේ ම අනුන්ගේ කෙලෙස් නිවනු පිණිස දහම් දෙසා’ යැ යි මේ සිත නො වී ද?” යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "17. මෙසේ වදාළ කල්හි, න්‍යග්‍රෝධ පිරිවැජි තෙම ‘වහන්ස, වරද තෙම යම්සේ බාලයකු, යම්සේ මූඪයකු, යම්සේ අදක්ෂයකු ඉක්මැයේ ද (මැඩගෙන යේ ද), එසේ ම වරද බාල වූ මූඪ වූ අදක්ෂ වූ මා ඉක්මැ (මැඩගෙන) ගියේ ය. ඒ මම්, භාග්‍යවතුන් වහන්සේට එසේ කීයෙමි. වහන්ස, මගේ මතු සංවරය පිණිස භාග්‍යවතුන් වහන්සේ මගේ වරද වරද වශයෙන් පිළිගන්නා සේක් වා (වරද වශයෙන් පිළිගන්නා මට ක්ෂමාව දෙන සේක්වා)’ යි කී ය."
                    },
                    {
                        "format": 13,
                        "text": "“එ බැවින් න්‍යග්‍රෝධයෙනි, යම් බඳු තෙපි මට එසේ කීහු ද වරද තෙම යම්සේ අනුවණයකු, මුළාවූවකු, අදක්ෂයකු ඉක්ම යේ ද, එසේ ම තොප ද ඉක්මා ගියේ ය. න්‍යග්‍රෝධයෙනි, යම් හෙයෙකින් තෙපි වරද වරද වශයෙන් දැක, ධර්මය වූ පරිදි එයට පිළියම් කරවු ද, තොප කරන ඒ දැය අපි පිළිගනිමු. න්‍යග්‍රෝධයෙනි, යමෙක් වරද වරද වශයෙන් දැක, එයට ධර්මය වූ පරිදි පිළියම් කෙරේ ද, මත්තෙහි සංවරයට පැමිණේ ද, මෙය ආර්ය විනයයෙහි වැඩිමෙක. න්‍යග්‍රෝධයෙනි, මම් වූ කලි මෙසේ කියමි: ‘ඇති වරද නො සඟොවන, නැති ගුණ නො පෙන්වන සුලු, සෘජු ස්වභාවය ඇති, සිහි නුවණ ඇති පුරුෂ තෙමේ පැමිණේ වා. මම් උපදෙස් දෙමි, මම් දහම් දෙසමි. මගේ අනුශාසන පරිදි පිළිපදනේ, කුල පුත්තු යමක් පිණිස මැනැවින් ගිහි ගෙන් නික්ම පැවිදි බිම් වදිත් නම්, ඒ නිරුත්තර මාර්ග බ්‍රහ්මචර්යාවසානය (රහත් ඵලය) හෝ මෙ අත්බව්හි ම සත් වසක් ඇතුළත, තෙමේ ම විශිෂ්ට ඥානයෙන් දැන සාක්ෂාත් කොට, ලැබ වසන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "න්‍යග්‍රෝධයෙනි, සත් වසෙක් තිබේ වා. ඇති වරද නො සඟොවන, නැති ගුණ නො පෙන්වන සුලු, ඍජු ස්වභාවය ඇති, සිහි නුවණැති පුරුෂ තෙමේ පැමිණේ වා. මම් උපදෙස් දෙමි, මම් දහම් දෙසමි. මගේ අනුශාසන පරිදි පිළිපදනේ, යමක් පිණිස කුලපුත්තු මැනැවින් ගිහි ගෙන් නික්ම, පැවිදි බිම් වදිත් නම්, ඒ නිරුත්තර මාර්ග බ්‍රහ්මචර්යාවසානය (රහත් ඵලය) හෝ මෙ අත්බව්හි ම ස වසක් තුළ ... පස් වසක් තුළ ... සිවු වසක් තුළ ... තුන් වසක් තුළ ... දෙ වසක් තුළ ... එක් වසක් තුළ තෙමේ ම වෙසෙසි නුවණින් දැන පසක් කොට, ලැබ වසන්නේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 92,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තිට්ඨතු නිග්රොධ එකං වස්සං. එතු විඤ්ඤූ පුරිසො අසඨො අමායාවී උජුජාතිකො. අහමනුසාසාමි, අහං ධම්මං දෙසෙමි. යථානුසිට්ඨං තථා පටිපජ්ජමානො යස්සත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජන්ති, තදනුත්තරං බ්රහ්මචරියපරියොසානං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරිස්සති සත්ත මාසානි."
                    },
                    {
                        "type": "paragraph",
                        "text": "තිට්ඨන්තු නිග්රොධ සත්ත මාසානි -පෙ- ඡ මාසානි -පෙ- පඤ්ච මාසානි -පෙ- -පෙ- චත්තාරි මාසානි -පෙ- තීණි මාසානි -පෙ- ද්වෙ මාසානි -පෙ- එකමාසං -පෙ- අඩ්ඪමාසං."
                    },
                    {
                        "type": "paragraph",
                        "text": "තිට්ඨතු නිග්රොධ අඩ්ඪමාසො. එතු විඤ්ඤූ පුරිසො අසඨො අමායාවී උජුජාතිකො, අහමනුසාසාමි, අහං ධම්මං දෙසෙමි, යථානුසිට්ඨං තථා පටිපජ්ජමානො යස්සත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජන්ති තදනුත්තරං බ්රහ්මචරියපරියොසානං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරිස්සති සත්තාහං."
                    },
                    {
                        "type": "centered",
                        "text": "පරිබ්බාජකානං පජ්ඣායනං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "18. සියා ඛො පන තෙ නිග්රොධ එවමස්ස: අන්තෙවාසිකම්යතා නො සමණො ගොතමො එවමාහා ති. න ඛො පනෙතං නිග්රොධ එවං දට්ඨබ්බං, යො එව තෙ ආචරියො සො එව තෙ ආචරියො හොතු."
                    },
                    {
                        "type": "paragraph",
                        "text": "සියා ඛො පන තෙ නිග්රොධ එවමස්ස: උද්දෙසා නො චාවෙතුකාමො සමණො ගොතමො එවමාහා ති. න ඛො පනෙතං නිග්රොධ එවං දට්ඨබ්බං. යො එව තෙ උද්දෙසො, සො එව තෙ උද්දෙසො හොතු."
                    },
                    {
                        "type": "paragraph",
                        "text": "සියා ඛො පන තෙ නිග්රොධ එවමස්ස: ආජීවා නො චාවෙතුකාමො සමණො ගොතමො එවමාහා ති. න ඛො පනෙතං නිග්රොධ එවං දට්ඨබ්බං. යො එව තෙ ආජීවො සො එව තෙ ආජීවො හොතු."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "න්‍යග්‍රෝධයෙනි, එක් වසෙක් තිබේ වා. ශඨ නො වූ මායාවී නොවූ සෘජු ජාතික නුවණැති පුරුෂ තෙමේ පැමිණේ වා. මම් අනුශාසන කරමි, මම් දහම් දෙසමි. මගේ අනුශාසන පරිදි පිළිපදනේ, යමක් සඳහා කුලපුත්තු මැනැවින් ගිහි ගෙන් නික්මැ පැවිදි බිම වදිත් නම්, ඒ නිරුත්තර මාර්ගබ්‍රහ්මචර්යාවසානය (රහත් ඵලය) හෝ මේ අත්බව්හි ම සත් මසක් තුළ තෙමේ ම වෙසෙසි නුවණින් දැන පසක් කොට, ලැබ වසන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "න්‍යග්‍රෝධයෙනි, සත් මසෙක් තිබේ වා. අශඨ වූ අමායාවී වූ සෘජු ජාතික වූ නුවණැති පුරුෂ තෙමේ පැමිණේ වා. මම් අනුශාසන කරම්, මම් දහම් දෙසමි. මගේ අනුශාසන පරිදි පිළිපදනේ, යමක් සඳහා කුලපුත්තු මැනැවින් ගිහි ගෙන් නික්මැ පැවිදි බිම වදිත් නම්, ඒ නිරුත්තර මාර්ගබ්‍රහ්මචර්යාවසානය (රහත් ඵලය) හෝ මෙ අත්බව්හිම ස මසක් තුළ ... පස් මසක් තුළ ... සිවු මසක් තුළ ... තුන් මසක් තුළ ... දෙ මසක් තුළ ... එක් මසක් තුළ ... අඩ මසක් තුළ තෙමේ ම වෙසෙසි නුවණින් දන පසක් කොට ලැබ වසන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "න්‍යග්‍රෝධයෙනි, අඩ මසෙක් තිබේ වා. අශඨ වූ අමායාවි සෘජු ජාතික විඥ පුරුෂ තෙමේ පැමිණේ වා. මම් අනුශාසන කරමි, මම් දහම් දෙසමි. මා අනුශාසන කළ පරිදි පිළිපදනේ, යමක් පිණිස කුලපුත්තු මොනොවට ම ගිහි ගෙන් නික්ම, පැවිදි බිම වදිත් ද, ඒ නිරුත්තර මාර්ගබ්‍රහ්මචර්යාවසානය (රහත් බව) හෝ මෙ අත්බව්හි ම සතියක් තුළ තෙමේ ම වෙසෙසි නුවණින් දෘන පසක් කොට ලැබ වසන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "18. න්‍යග්‍රෝධයෙනි, තමාගේ අතැවැස්සකු කැරැගනු කැමැති වැ මහණ ගොයුම් තෙම මෙසේ කීයේ දෝ හෝ යි තොපට මෙසේ සිතක් විය හැක්ක. න්‍යග්‍රෝධයෙනි, මෙය එසේ නො දත යුතු. යමෙක් තොපගේ ආචාර්ය වී ද, හේ ම තොප ගේ ආචාර්ය වේ වා."
                    },
                    {
                        "format": 13,
                        "text": "න්‍යග්‍රෝධයෙනි, ‘මහණ ගොයුම්හු අපගේ ධර්මතන්ත්‍රෝද්ග්‍රහණයෙන් අප බැහැර කරනු රිසි වැ මෙසේ කියතැ යි තොපට මෙසේ සිතක් වියැ හැක්ක. න්‍යග්‍රෝධයෙනි, මෙය එසේ නො ම දත යුතු. තොපගේ යම් ධර්මතන්ත්‍ර ඉගැන්මෙක් වේ ද, එය ම තොපගේ ඉගැන්ම වේ වා.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "න්‍යග්‍රෝධයෙනි, ‘මහණ ගොයුම්හු අපගේ ජීවිකාවෘත්තියෙන් අප බැහැර කරනු කැමැති ව මෙසේ කියතැ යි තොපට මෙසේ සිතක් විය හැක්ක. න්‍යග්‍රෝධයෙනි, මෙය එසේ නො ම දත යුතු. තොපගේ යම් ජීවිකාවෘත්තියෙක් වේ ද එයම තොපගේ ජීවිකාවෘත්තිය වේ වා.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 94,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සියා ඛො පන තෙ නිග්රොධ එවමස්ස: යෙ නො ධම්මා අකුසලා අකුසලසඞ්ඛාතා සාචරියකානං, තෙසු පතිට්ඨාපෙතුකාමො සමණො ගොතමො එවමාහා ති. න ඛො පනෙතං නිග්රොධ එවං දට්ඨබ්බං අකුසලා චෙව වො ධම්මා{1} හොන්තු අකුසලසඞ්ඛාතා ච සාචරියකානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "සියා ඛො පන තෙ නිග්රොධ එවමස්ස: යෙ නො ධම්මා කුසලා කුසලසඞ්ඛාතා සාචරියකානං. තෙහි විවෙචෙතුකාමො සමණො ගොතමො එවමාහා ති. න ඛො පනෙතං නිග්රොධ එවං දට්ඨබ්බං, කුසලා චෙව වො ධම්මා හොන්තු කුසලසඞ්ඛාතා ච සාචරියකානං. ඉති ඛ්වාහං නිග්රොධ නෙව අන්තෙවාසිකම්යතා එවං වදාමි, නපි උද්දෙසා චාවෙතුකාමො එවං වදාමි. නපි ආජීවා චාවෙතුකාමො එවං වදාමි, නපි යෙ ච වො ධම්මා{2} අකුසලා අකුසලසඞ්ඛාතා සාචරියකානං තෙසු පතිට්ඨාපෙතුකාමො එවං වදාමි. නපි යෙ ච වො ධම්මා කුසලා කුසලසඞ්ඛාතා සාචරියකානං තෙහි විවෙචෙතුකාමො එවං වදාමි. සන්ති ච ඛො නිග්රොධ අකුසලා ධම්මා අප්පහීනා සංකිලෙසිකා පොනොභවිකා{3} සදරා{4} දුක්ඛවිපාකා ආයතිං ජාතිජරාමරණියා, යෙසාහං පහානාය ධම්මං දෙසෙමි. යථා පටිපන්නානං වො සංකිලෙසිකා ධම්මා පහීයිස්සන්ති, වොදානීයා ධම්මා අභිවඩ්ඪිස්සන්ති, පඤ්ඤාපාරිපූරිං වෙපුල්ලත්තඤ්ච දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරිස්සථා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "19. “එවං වුත්තෙ තෙ පරිබ්බාජකා තුණ්හීභූතා මඞ්කුභූතා පත්තක්ඛන්ධා අධොමුඛා පජ්ඣායන්තා අප්පටිභානා නිසීදිංසු, යථා තං මාරෙන පරියුට්ඨිතචිත්තා. අථ ඛො භගවතො එතදහොසි: සබ්බෙ පි මෙ මොඝපුරිසා ඵුට්ඨා පාපිමතා. යත්ර හි නාම එකස්සපි න එවං භවිස්සති “හන්ද මයං අඤ්ඤාණත්ථම්පි සමණෙ ගොතමෙ බ්රහ්මචරියං චරාම, කිං කරිස්සති සත්තාහො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා උදුම්බරිකාය පරිබ්බාජකාරාමෙ සීහනාදං නදිත්වා, වෙහාසං අබ්භුග්ගන්ත්වා, ගිජ්ඣකූටෙ පබ්බතෙ පච්චුට්ඨාසි{5} සන්ධානො පන ගහපති තාවදෙව රාජගහං පාවිසී ති."
                    },
                    {
                        "type": "centered",
                        "text": "උදුම්බරිකසුත්තං නිට්ඨිතං දුතියං.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. වො නෙ ධම්මා - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. න පි යෙ නෙ ධම්මා - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. පොනොබ්භවිකා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. සද්දරා - PTS. කම්. සදරථා - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. පච්චුපට්ඨාසි - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "න්‍යග්‍රෝධයෙනි, ‘අකුසල් කොටසට අයත් කොට ඇදුරා සහිත අප වීසින් කියන ලද අකුසල් වූ යම් ධර්ම කෙනෙක් වෙත් නම්, එහි අප පිහිටුවනු කැමැති ව, මහණ ගොයුම්හු මෙසේ කිය තැ’ යි තොපට මෙසේ සිතක් වියැ හැක්ක. න්‍යග්‍රෝධයෙනි, මෙය එසේ නො ම දත යුතු. ඇදුරා සහිත තොප විසින් අකුසල් කොටසට අයත් යැ යි කියන ලද අකුසල් වූ ඒ ධර්මයෝ එසේ ම වෙත් වා.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "න්‍යග්‍රෝධයෙනි, “කුසල් කොටසට අයත් කොට ඇදුරා සහිත අප විසින් කියන ලද යම් කුසල් දහම් කෙනෙක් වෙත් නම්, එයින් අප බැහැරැ කරනු කැමැති වැ මහණ ගොයුම්හු මෙසේ කිය තැ’ යි මෙසේ සිතක් තොපට විය හැක්ක. න්‍යග්‍රෝධයෙනි, මෙය එසේ නො ම දත යුතු. ඇදුරා සහිත තොපගේ කුසලසංඛ්‍යාත වූ ඒ කුසල් දහම්හු එසේ ම වෙත් වා. න්‍යග්‍රෝධයෙනි, අතැවැසි කැරැගනු කැමැත්තෙන් මෙසේ නො ම කියමි. තොපගේ ඉගැන්මෙන් බැහැරැ කරනු කැමැති ව මෙසේ නො ද කියමි. තොපගේ ජීවිකාවෘත්තියෙන් බැහැර කරනු කැමැති ව මෙසේ නො ද කියමි. ඇදුරා සහිත තොප අකුසල් යැ යි අකුසල් කොටසට ඇතුළත් යැ යි සලකන ලද දහම් හි තොප පිහිටුවනු කැමැති ව මෙසේ නො ද කියමි. ඇදුරා සහිත තොප කුසල් යැ යි කුසල් කොටසට අයත් යැයි පිළිගත් දහම් කෙරෙන් තොප බැහැර කරනු කැමැති ව මෙසේ නො ද කියමි. න්‍යග්‍රෝධයෙනි, යම් කෙනෙකුන්ගේ ප්‍රහාණය පිණිස මම් දහම් දෙසම් ද, සිත් සතන් කෙලෙසන, පුනර්භවය පිණිස පවත්නා, කෙලෙස් පෙළුම් සහිත වූ, දුක් විපාක ගෙන දෙන, මතු ජාතිජරාමරණයට ප්‍රත්‍යය වූ (තොප සිත්සතන්හි) අප්‍රහීණ වූ ඒ අකුසල ධර්ම කෙනෙක් ඇත් ම ය. යම් සේ පිළිපන් තොපගේ ඒ සිත් කෙලෙසන ස්වභාවයෙන් ප්‍රහීණ වන්නාහු ද, සිත් සතන් පිරිසිදු කරන ධර්මයෝ තොප සිත් සතන්හි වැඩෙන්නාහු ද, මාර්ගප්‍රඥාවගේ පරිපූර්ණත්‍වයත් ඵල ප්‍රඥාවගේ විපුලත්වයත් මේ අත්බව්හි ම තුමු ම වෙසෙසි නුවණින් දැන පසක් කොට ලැබ වසවූ ද, එසේ වනු පිණිස මම් දහම් දෙසමි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "19. භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ කල්හි, මාරයා විසින් මඩනා ලද සිතැත්තාහු යම් සේ ද, එසේ ඒ පිරිවැජියෝ නිහඬ ව, තෙද නැති ව, කර බා ගත්තෝ වැ, බිමට හෙලූ මුහුණු ඇති ව, සිතිවිලි සිතන්නාහු වැටහෙන නුවණ නැතියෝ ව හුන්හ. එ කල, භාග්‍යවතුන් වහන්සේට, ‘එසේ නම් අපි දැනගනු පිණිස නුමුදු මහණ ගොයුම් කෙරෙහි බඹසර කරමු’ යි ‘සත් දින අපිට කවර අපහසුවක් කරන්නේ ද’ යි මෙසේ සිතෙක් යම් ඒ පිරිවැජියන් අතුරෙහි එකකුට දු නො වන්නේද, එ පමණට ම මේ සියලු ම හිස් පුරුෂයෝ පාපි වූ මරහු විසින් ස්පර්‍ග කරන ලදහ’ යි මේ සිත විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිත්තෙන් භාග්‍යවතුන් වහන්සේ උදුම්බරිකාවගේ පිරිවැජි අරමැ මෙසේ පරවාදච්ඡේදක ස්වවාද සමුත්ථාපක අභීත නාදය පවත්වා, අහස් නැඟ, ගිජුකුළු පව්වෙහි පිහිටි සේක. සන්ධාන ගෘහපති එ කෙණෙහි ම රජගහ පුරයට පිවිසියේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 16,
                        "text": "දෙවෙනි උදුම්බරික සීහනාද සූත්‍රය නිමියේ ය.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ]
}