{
    "filename": "dn-3-4",
    "bookId": 12,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 136,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "අග්ගඤ්ඤසුත්තං",
                        "level": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "1. එවං මෙ සුතං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකං සමයං භගවා සාවත්ථියං විහරති පුබ්බාරාමෙ මිගාරමාතුපාසාදෙ. තෙන ඛො පන සමයෙන වාසෙට්ඨාභාරද්වාජා භික්ඛූසු පරිවසන්ති{1} භික්ඛුභාවං ආකඞ්ඛමානා. අථ ඛො භගවා සායණ්හසමයං පටිසල්ලානා වුට්ඨිතො පාසාදා ඔරොහිත්වා පාසාදපච්ඡායායං{2} අබ්භොකාසෙ චඞ්කමති. අද්දසා ඛො වාසෙට්ඨො භගවන්තං සායණ්හසමයං පටිසල්ලානා වුට්ඨිතං පාසාදා ඔරොහිත්වා පාසාදපච්ඡායායං අබ්භොකාසෙ චඞ්කමන්තං. දිස්වාන භාරද්වාජං ආමන්තෙසි: “අයං ආවුසො භාරද්වාජ භගවා සායණ්හසමයං පටිසල්ලානා වුට්ඨිතො පාසාදා ඔරොහිත්වා පාසාදපච්ඡායායං අබ්භොකාසෙ චඞ්කමති. ආයාමාවුසො භාරද්වාජ යෙන භගවා තෙනුපසඞ්කමිස්සාම. අප්පෙවනාම ලභෙය්යාම භගවතො සන්තිකා{3} ධම්මිං කථං සවණායා”ති. ‘එවමාවුසො’ති ඛො භාරද්වාජො වාසෙට්ඨාස්ස පච්චස්සොසි. අථ ඛො වාසෙට්ඨාභාරද්වාජා යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා භගවන්තං චඞ්කමන්තං අනුචඞ්කමිංසු."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. අථ ඛො භගවා වාසෙට්ඨං ආමන්තෙසි: ‘තුම්හෙ ඛ්වත්ථ වාසෙට්ඨා බ්රාහ්මණජච්චා බ්රාහ්මණකුලීනා බ්රාහ්මණකුලා අගාරස්මා අනගාරියං පබ්බජිතා. කච්චි වො වාසෙට්ඨා බ්රාහ්මණා න අක්කොසන්ති න පරිභාසන්තී?ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තග්ඝ නො භන්තෙ බ්රාහ්මණා අක්කොසන්ති පරිභාසන්ති අත්තරූපාය පරිභාසාය පරිපුණ්ණාය නො අපරිපුණ්ණායා?ති”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යථා කථං පන වො වාසෙට්ඨා බ්රාහ්මණා අක්කොසන්ති පරිභාසන්ති අත්තරූපාය පරිභාසාය පරිපුණ්ණාය නො අපරිපුණ්ණායා?ති”."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පටිවසති - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "2. පාසාදච්ඡායායං - කම්."
                    },
                    {
                        "type": "footnote",
                        "text": "3. සම්මුඛා - ස්යා. කම්."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4.",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "අග්ගඤ්ඤ සූත්‍රය",
                        "level": 3
                    },
                    {
                        "format": 13,
                        "text": "1. මා විසින් මෙසේ අසන ලදී:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත්නුවර නිසා මිගාරමාතුපාසාද නම් වූ පූර්වාරාමයෙහි වැඩ වසන සේක. එ සමයෙහි වාශිෂ්ඨ භාරද්වාජ යන හෙරණ දෙ නම භික්ෂුභාවය (උපසපුව) පතන්නාහු භික්ෂූන් කෙරෙහි පිරිවෙසෙත්, එකල්හි භාග්‍යවතුන් වහන්සේ සවස් වේලෙහි පලසමවතින් නැගී සිටිසේක්. පහයෙන් බැස, පහය ඉදිරියෙහි සෙවණෙහි එළිමහනෙහි සක්මන් කරන සේක. වාශිෂ්ඨ හෙරණ තෙම, සවස් වේලෙහි පලසමවතින් නැගී සිට පහයෙන් බැස, පහය ඉදිරියෙහි සෙවණැ එළීමහනෙහි සක්මන් කරන භාග්‍යවතුන් වහන්සේ දිටී. දැක භාරද්වාජ හෙරණහු බණවා, ‘ඇවැත්නි, භාරද්වාජයෙනි, මේ භාග්‍යවතුන් වහන්සේ සවස් වේලේ පලසමවතින් නැගී සිට පහයෙන් බැස, පහය ඉදිරියෙහි සෙවණැ එළිමහනෙහි සක්මන් කරන සේක. ඇවැත්නි, භාරද්වාජයෙනි, එමු. භාග්‍යවතුන් වහන්සේ කරා එළැඹෙන්නමු. භාග්‍යවතුන් වහන්සේ වෙතින් ධර්‍ම කථාවක් අසන්නට ලබන්නමෝ නම් ඉතා යෙහෙකැ’ යි කී ය. ‘එසේ ය, ඇවැත්නි’ යි කියා ම භාරද්වාජ තෙම වාශිෂ්ඨයාට පිළිවදන් දුන. ඉක්බිති වාශිෂ්ඨ භාරද්වාජ දෙ නම භාග්‍යවතුන් වහන්සේ කරා ගියහ. ගොස් ඔබ වැඳ, සක්මන් කරන භාග්‍යවතුන් වහන්සේ අනුව සක්මන් කළහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "2. එකල්හි භාග්‍යවතුන් වහන්සේ වාශිෂ්ඨයා බණවා, ‘වාශිෂ්ඨයෙනි, තෙපි වූ කලි බ්‍රාහ්මණජාතික වූ බ්‍රාහ්මණයන් අතුරෙහි කුලසම්පන්න වූ බ්‍රාහ්මණ කුලය හැර ගිහිගෙන් නික්ම සසුන් වන්නෝ වහු. කිමෙක් ද වාශිෂ්ඨයෙනි, තොපට බ්‍රාහ්මණයෝ ආක්‍රොශ නො කෙරෙත් ද? පරිභව නො කෙරෙත් දැ?’ යි අසා වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘වහන්ස, එකාන්තයෙන් ම බ්‍රාහ්මණයෝ අපරිපූර්‍ණ නො වූ (අතරැ නොනැවැති) පරිපුර්‍ණවූ (නිරතුරු වූ) තමනට හුරු වූ පරිභව වචනයෙන් අපට ආක්‍රොශ කෙරෙත්, පරිභව කෙරෙත්’ යැ යි හේ කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘වාශිෂ්ඨයෙනි, අපරිපූර්‍ණ නොවූ පරිපූර්‍ණ ම වූ තමනට හුරු වූ පරිභව වචනයෙන් කෙසේ නම් තොපට බ්‍රාහ්මණයෝ ආක්‍රොශ පරිභව කෙරෙත් දැ?’ යි භාග්‍යවතුන් වහන්සේ පුළුවුත් සේක.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 138,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "බ්රාහ්මණා භන්තෙ එවමාහංසු: “බ්රාහ්මණො’ව සෙට්ඨො වණ්ණො හීනා අඤ්ඤෙ වණ්ණා බ්රාහ්මණො’ව සුක්කො වණ්ණො, කණ්හා අඤ්ඤෙ වණ්ණා{1}. බ්රාහ්මණා’ව සුජ්ඣන්ති නො අබ්රාහ්මණා බ්රාහ්මණා ව බ්රහ්මුනො පුත්තා ඔරසා මුඛතො ජාතා බ්රහ්මජා බ්රහ්මනිම්මිතා බ්රහ්මදායාදා. තෙ තුම්හෙ සෙට්ඨං වණ්ණං හිත්වා හීනමත්ථු වණ්ණං අජ්ඣුපගතා, යදිදං මුණ්ඩකෙ සමණකෙ ඉබ්භෙ කණ්හෙ බන්ධුපාදාපච්චෙ. තයිදං න සාධු, තයිදං නප්පටිරූපං, යං තුම්හෙ සෙට්ඨං වණ්ණං හිත්වා හීනමත්ථ වණ්ණං අජ්ඣුපගතා, යදිදං මුණ්ඩකෙ සමණකෙ ඉබ්භෙ කණ්හෙ බන්ධුපාදාපච්චෙ”ති. එවං ඛො නො භන්තෙ බ්රාහ්මණා අක්කොසන්ති පරිභාසන්ති අත්තරූපාය පරිභාසාය පරිපුණ්ණාය නො අපරිපුණ්ණායා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“තග්ඝ වො වාසෙට්ඨා බ්රාහ්මණා පොරාණං අසරන්තා එවමාහංසු: බ්රාහ්මණො’ව සෙට්ඨො වණ්ණො, හීනා අඤ්ඤෙ වණ්ණා. බ්රාහ්මණො ව සුක්කො වණ්ණො, කණ්හා අඤ්ඤෙ වණ්ණා, බ්රාහ්මණා’ව සුජ්ඣන්ති නො අබ්රාහ්මණා, බ්රාහ්මණා’ව බ්රහ්මුනො පුත්තා ඔරසා මුඛතො ජාතා බ්රාහ්මජා බ්රහ්මනිම්මිතා බ්රහ්මදායාදා”ති. දිස්සන්ති ඛො පන වාසෙට්ඨා බ්රාහ්මණානං බ්රාහ්මණියො උතුනියො’පි ගබ්භිනියො’පි විජායමානා’පි පායමානා’පි. තෙ ච බ්රාහ්මණා යොනිජා’ව සමානා එවමාහංසු: බ්රාහ්මණො’ව සෙට්ඨො වණ්ණො -පෙ- පුත්තා ඔරසා -පෙ- බ්රහ්මදායාදා”ති. තෙ ච බ්රහ්මානඤ්චෙව අබ්භාචික්ඛන්ති මුසා ච භාසන්ති බහුඤ්ච අපුඤ්ඤං පසවන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "චාතුවණ්ණසුද්ධි",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3. චත්තාරො’ මෙ වාසෙට්ඨා වණ්ණා, ඛත්තියා බ්රාහ්මණා වෙස්සා සුද්දා. ඛත්තියො’පි ඛො වාසෙට්ඨා ඉධෙකච්චො පාණාතිපාතී හොති අදින්නාදායී කාමෙසුමිච්ඡාචාරී මුසාවාදී පිසුණවාචො ඵරුසවාචො සම්ඵප්පලාපී අභිජ්ඣාලු බ්යාපන්නචිත්තො මිච්ඡාදිට්ඨී. ඉති ඛො වාසෙට්ඨා යෙ’මෙ ධම්මා අකුසලා අකුසලසඞ්ඛාතා සාවජ්ජා සාවජ්ජසඞ්ඛාතා අසෙවිතබ්බා අසෙවිතබ්බසඞ්ඛාතා න අලමරියා න අලමරියසඞ්ඛාතා, කණ්හා කණ්හවිපාකා විඤ්ඤුගරහිතා, ඛත්තියෙ පි තෙ ඉධෙකච්චෙ සන්දිස්සන්ති. බ්රාහ්මණො පි ඛො වාසෙට්ඨා -පෙ- වෙස්සො පි ඛො වාසෙට්ඨා -පෙ- සුද්දො පි ඛො වාසෙට්ඨා ඉධෙකච්චො පාණාතිපාතී හොති අදින්නාදායී -පෙ- මිච්ඡාදිට්ඨී. ඉති ඛො වාසෙට්ඨා යෙ’ මෙ ධම්මා අකුසලා අකුසලසඞ්ඛාතා -පෙ- කණ්හා කණ්හවිපාකා විඤ්ඤුගරහිතා, සුද්දෙ පි තෙ ඉධෙකච්චෙ සන්දිස්සන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කණහො අඤ්ඤො වණ්ණො - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "“වහන්ස, ‘බ්‍රාහ්මණ වර්‍ණය ම ශ්‍රේෂ්ඨ ය, අන්‍ය වර්‍ණයෝ පහත් හ. බ්‍රාහ්මණවංශය ම ශුක්ලවර්‍ණ ය, ඉතිරි තුන් වංශයෝ ම කෘෂ්ණවර්‍ණ හ. බ්‍රාහ්මණයෝ ම ශුද්ධ වෙත්. බ්‍රාහ්මණ නොවූවෝ ශුද්ධ නොවෙත්. බ්‍රාහ්මණයෝ ම බඹහුගේ මුවින් බිහි වූ, බඹහුගෙන් උපන්, බඹහු විසින් මවන ලද, (වේදවේදාඞ්ගාදි) බඹහුගේ දෑවැද්දට උරුම කරු වූ, බඹහුගේ ඔෳරස පුත්‍රයෝ ය. ඒ තෙපි ශ්‍රෂ්ඨ වර්‍ණය හැරැදමා, ගැහැවි වූ කලු වූ මාරපාක්ෂික වූ, බඹහුගේ පයින් උපන් මුඩු මහණුන් වූ හීන වර්‍ණයකට බටුවෝ වහු. ශ්‍රේෂ්ඨ වර්‍ණය හැරැලා ගැහැවි වූ කලු වූ මාරපාක්ෂික වූ බඹහුගේ පයින් උපන් මුඩුමහණුන් වූ හීන වර්‍ණයකට පැමිණියහු ය යන යමෙක් ඇද්ද, එය නො මැනව, එය නො සුදුස යැ’ යි, වහන්ස, මෙසේ අපරිපූර්‍ණ නො වූ, පරිපූර්‍ණ ම වූ, තමනට හුරුවූ ගැරහුම් බසින් අපට ආක්‍රොශ කෙරෙත්, පරිභව කෙරෙත්” යැ යි වාශිෂ්ඨ තෙම කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘වාශිෂ්ඨයෙනි, බ්‍රාහ්මණයෝ එකාන්තයෙන් ම පුරාණ කථාව (ලෝකෝත්පත්තිචර්යාවංශය) සිහි නො කරන්නාහු. ‘බ්‍රාහ්මණයෝ ම ශ්‍රේෂඨ වර්‍ණය ය, අන් වර්‍ණයෝ හීනයහ, බ්‍රාහ්මණයෝ ම ශුක්ල වර්‍ණය ය, අන්‍ය වර්‍ණයෝ කෘෂ්ණයහ, අබ්‍රාහ්මණයෝ නො ව බ්‍රාහ්මණයෝ ම ශුද්ධ වෙත්, බ්‍රාහ්මණයෝ ම බ්‍රාහ්මයාගේ මුඛයෙන් බිහි වූ, බ්‍රහ්මයාගෙන් උපන් බ්‍රහ්මයා විසින් මවන ලද, බ්‍රහ්මයාගේ දායාද වූ, බ්‍රහ්මයාගේ ඔෳරස පුත්‍රයෝ’ යි කියත්. වාශිෂ්ඨයෙනි, බ්‍රාහ්මණයන්ගේ ඔසප් වූ ද, ගැබිනි වූ ද, වදන්නාවූ ද, (දරුවනට) කිරි පොවන්නාවූ ද බැමිණියෝ දක්නා ලැබෙත්. ඒ බමුණෝ යෝනියෙන් උපන්නෝ වන්නාහු බ්‍රාහ්මණවර්‍ණය ම ශ්‍රේෂ්ඨය … බ්‍රහ්මයෝ ම බ්‍රහ්මයාගේ දායාද වූ බ්‍රහ්මයාගේ ඔෳරසපුත්‍රයෝ යැ යි මෙසේ කියත්. එසේ කියන්නාහු බ්‍රහ්මයාට ම නින්දා කෙරෙත්, මුසවා තෙපලත්, බොහෝ අකුසල් ද රැස් කෙරෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3. වාශිෂ්ඨයෙනි, ක්ෂත්‍රිය, බ්‍රාහ්මණ, වෛශ්‍ය, ශුද්‍ර යැ යි මේ වර්‍ණ සතරෙකි. වාශිෂ්ඨයෙනි, මෙහි එක්තරා ක්ෂත්‍රියයෙක් ද පණිවා කරන සුලු වෙයි. නොදුන් දෑ ගන්නා සුලු වෙයි. කාමයන්හි වරදවා හැසිරෙන සුලු වෙයි. මසුවා බණන සුලු වෙයි. පෙහෙසුන් තෙප්ලන සුලු වෙයි. පරොස් බස් කියන සුලු වෙයි. සම්ඵප්‍රලාප දොඩන සුලු වෙයි. අභිධ්‍යා බහුල වෙයි. ව්‍යාපාදයට පැමිණි සිතැත්තේ වෙයි. මිසදිටි ගත්තෙක් වෙයි. වාශිෂ්ඨයෙනි, මෙසේ අකුසල් යැයි කියන ලද, අකුසල් ම වූ, වරද සහිත යැයි කියන ලද, වරද සහිත ම වූ, නොසෙවියැ යුතු යැ යි කියන ලද, නොසෙවියැයුතු ම වූ, ආර්යභාවයට නොපොහොසත් යැ යි කියන ලද, ආර්යභාවය සිදු කිරීමෙහි නො පොහොසත් ම වූ. කෘෂ්ණවිපාක ඇති, කෘෂ්ණම වූ, නුවණැත්තන් විසින් ගරහන ලද, යම් පාප ධර්‍ම කෙනක් වෙත් ද, ඒ ඇතැම් ලාමක ධර්‍මයෝ මෙහි ක්ෂත්‍රියයා කෙරෙහි ද දක්නා ලැබෙත්, … බ්‍රාහ්මණයා කෙරෙහි ද දක්නා ලැබෙත්. වෛශ්‍යයා කෙරෙහි ද දක්නා ලැබෙත් … ශුද්‍රයා කෙරෙහි ද දක්නා ලැබෙත්."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 140,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඛත්තියො පි ඛො වාසෙට්ඨා ඉධෙකච්චො පාණාතිපාතා පටිවිරතො හොති. අදින්නාදානා පටිවිරතො, කාමෙසු මිච්ඡාචාරා පටිවිරතො, මුසාවාදා පටිවිරතො, පිසුනාය වාචාය පටිවිරතො, ඵරුසාය වාචාය පටිවිරතො, සම්ඵප්පලාපා පටිවිරතො, අනභිජ්ඣාලු අබ්යාපන්නචිත්තො සම්මාදිට්ඨී. ඉති ඛො වාසෙට්ඨා යෙ’ මෙ ධම්මා කුසලා කුසලසඞ්ඛාතා අනවජ්ජා අනවජ්ජසඞ්ඛාතා සෙවිතබ්බා සෙවිතබ්බසඞ්ඛාතා අලමරියා අලමරියසඞ්ඛාතා සුක්කා සුක්කවිපාකා විඤ්ඤුප්පසත්ථා, ඛත්තියෙ පි තෙ වාසෙට්ටා ඉධෙකච්චෙ සන්දිස්සන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "බ්රාහ්මණො පි ඛො වාසෙට්ඨා -පෙ- වෙස්සො පි ඛො වාසෙට්ඨා -පෙ- සුද්දො පි ඛො වාසෙට්ඨා ඉධෙකච්චො පාණාතිපාතා පටිවිරතො හොති -පෙ- අනභිජ්ඣාලු අබ්යාපන්නචිත්තො සම්මාදිට්ඨී. ඉති ඛො වාසෙට්ඨා යෙ’මෙ ධම්මා කුසලා කුසලසඞ්ඛාතා අනවජ්ජා අනවජ්ජසඞ්ඛාතා සෙවිතබ්බා සෙවිතබ්බසඞ්ඛාතා අලමරියා අලමරියසඞ්ඛාතා සුක්කා සුක්කවිපාකා විඤ්ඤුප්පසත්ථා,{1} සුද්දෙපි තෙ ඉධෙකච්චෙ සන්දිස්සන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙසු ඛො වාසෙට්ඨා චතූසු වණ්ණෙසු එවං උභයවොකිණ්ණෙසු වත්තමානෙසු කණ්හසුක්කෙසු ධම්මෙසු විඤ්ඤුගරහිතෙසු චෙව විඤ්ඤුප්පසත්ථෙසු ච. යදෙත්ථ බ්රාහ්මණා එවමාහංසු: බ්රාහ්මණො’ව සෙට්ඨො වණ්ණො, හීනා අඤ්ඤෙ වණ්ණා. බ්රාහ්මණො’ව සුක්කො වණ්ණො කණ්හා අඤ්ඤෙ වණ්ණා, බ්රාහ්මණා’ව සුජ්ඣන්ති නො අබ්රාහ්මණා, බ්රාහ්මණා’ව බ්රහ්මුනො පුත්තා ඔරසා මුඛතො ජාතා බ්රහ්මජා බ්රහ්මනිම්මිතා බ්රහ්මදායාදා”ති. තං තෙසං විඤ්ඤූ නානුජානන්ති. තං කිස්ස හෙතු? ඉමෙසං හි වාසෙට්ඨා චතුන්නං වණ්ණානං යො හොති භික්ඛු අරහං ඛීණාසවො වුසිතවා කතකරණීයො ඔහිතභාරො අනුප්පත්තසදත්ථො පරික්ඛීණභවසංයොජනො සම්මදඤ්ඤාවිමුත්තො, සො නෙසං{2} අග්ගමක්ඛායති. ධම්මෙනෙව නො අධම්මෙන. ධම්මො හි වාසෙට්ඨා සෙට්ඨො ජනෙතස්මිං දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරායෙව{3}."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. විඤ්ඤූපසත්ථා (ස්යා)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. තෙසං - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අභිසම්පරායඤ්ච. - (මඡසං. PTS.)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "වාශිෂ්ඨයෙනි, මෙහි ඇතැම් ක්ෂත්‍රියයෙක් ද පණිවායෙන් වැළැක්කේ වෙයි, අයිනාදනින් වැළැක්කේ වෙයි, කාමයන්හි වරදවා හැසිරීමෙන් වැළැක්කේ වෙයි, මුසවායෙන් වැළැක්කේ වෙයි, පෙහෙසුන් තෙප්ලෙන් වැළැක්කේ වෙයි, පරොස් බසින් වැළැක්කේ වෙයි, සම්ඵප්‍රලාපයෙන් වැළැක්කේ වෙයි, අභිධ්‍යා නැත්තේ වෙයි, ව්‍යාපාදසහිත සිත් නැත්තේ වෙයි, සම්දිටු ගත්තේ වෙයි. වාශිෂ්ඨයෙනි, මෙසේ කුශල යැ යි කියන ලද කුසල් ම වූ, වරද රහිත යැ යි කියන ලද, වරද රහිත ම වූ, සෙවියැ යුතු යැ යි කියන ලද, සෙවියැ යුතු ම වූ, ආර්යභහාවය සිදු කිරීමෙහි පොහොසත් යැ යි කියන ලද, ආර්යභාවය සිදු කිරීමෙහි පොහොසත් ම වූ ශුක්ලවිපාක ඇති, ශුක්ල ම වූ, නුවණැත්තන් විසින් පසස්නා ලද යම් ධර්‍ම කෙනෙක් වෙත් ද, ඒ ඇතැම් දහම්හු මෙහි ක්ෂත්‍රියයා කෙරෙහි ද දක්නා ලැබෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "වාශිෂ්ඨයෙනි, මෙහි බ්‍රාහ්මණයා ද … වෛශ්‍යයා ද … ශුද්‍රයා ද පණිවායෙන් වැළැක්කේ වෙයි, අයිනාදනින් වැළැක්කේ වෙයි, කාමමිථ්‍යාචාරයෙන් වැළැක්කේ වෙයි, මුසවායෙන් වැළැක්කේ වෙයි, පෙහෙසුන් තෙප්ලෙන් වැළැක්කේ වෙයි, පරොස් බසින් වැළැක්කේ වෙයි, සම්ඵප්‍රලාපයෙන් වැළැක්කේ වෙයි, අභිධ්‍යා නැත්තේ වෙයි, ව්‍යාපාද සහිත සිත් නැත්තේ වෙයි, සම්දිටු ගත්තේ වෙයි. වාශිෂ්ඨයෙනි, මෙසේ කුසල් යැ යි කියන ලද, කුසල් ම වූ, වරද රහිත යැ යි කියන ලද වරද රහිත ම වූ, සෙවියැ යුතු යැ යි කියන ලද සෙවියැ යුතු ම වූ, ආර්යභාවය සිදු කිරීමෙහි පොහොසත් යැ යි කියන ලද, ආර්යභාවය සිදු කිරීමෙහි පොහොසත් ම වූ, ශුක්ලවිපාක ඇති, ශුක්ල ම වූ, නුවණැත්තන් විසින් පසස්නා ලද යම් ධර්‍ම කෙනෙක් වෙත් ද, ඒ ඇතැම් දහම්හු මෙහි බ්‍රාහ්මණයා කෙරෙහි ද, … වෛශ්‍යයා කෙරෙහි ද ශුද්‍රයා කෙරෙහි ද දක්නා ලැබෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "වාශිෂ්ඨයෙනි, මේ සතර වර්‍ණයන් මෙසේ නුවණැත්තන් විසින් ගරහන ලද දහම්හි ද නුවණැත්තන් විසින් පසස්නා ලද දහම්හි ද, කෘෂ්ණ ධර්‍මයන්හි ද ශුක්ලධර්‍මයන් හි දැ යි මෙසේ කුශලාකුශල යන විවිධ ධර්‍මයන්ගෙන් ම මිශ්‍ර ව පවත්නා කල්හි, බ්‍රාහ්මණවර්‍ණය ම ශ්‍රේෂ්ඨ යැ යි ඉතර වර්‍ණයෝ හීනහ යි, බ්‍රාහ්මණවර්‍ණය ම සුදු යැ යි, සෙසු වර්‍ණයෝ කලු හ යි, බ්‍රාහ්මණයෝ ම ශුද්ධ වෙත් යැ යි, බ්‍රාහ්මණ නොවුවෝ ශුද්ධ නො වෙත් යැ යි, බ්‍රාහ්මණයෝ ම බ්‍රහ්මයාගෙන් උපන්, බ්‍රහ්මයා විසින් මවන ලද, බ්‍රහ්මදායදා වූ, බ්‍රහ්මයාගේ මුවින් උපන් ඔෳරස පුත්‍රයෝ හ යි යම් වචනයක් කියත් ද, ඔවුන්ගේ ඒ වචනය නුවණැත්තෝ නො අනුදනිත්. ඒ කවර හෙයින? යත්: වාශිෂ්ඨයෙනි, මේ සතර වර්‍ණ අතුරෙන් කවරකට අයත් වුව ද යම් මහණෙක් රහත් ද, ක්ෂීණාස්‍රව ද, වුසු මඟ බඹසර ඇත්තේ ද, කොට නිමි කටයුතු ඇත්තේ ද, පැමිණි ස්වාර්ථය (රහත් බව) ඇත්තේ ද, හැම ලෙසින් නැසූ භවබන්ධන ඇත්තේ ද, මොනොව ට දැන මිදුණේ ද, හෙ තෙමේ ඒ හැම දෙනා අතුරෙහි අග්‍ර යැ යි කියනු ලැබේ. ඒ ද අධර්‍මයෙන් නොව ධර්‍මයෙන් ම ය. වාශිෂ්ඨයෙනි, ධර්‍මය ම සත්මුළුයෙහි මෙ ලොව්හි ද පරලොව්හි ද ශ්‍රේෂ්ඨ ය. එහෙයිනි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 142,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "4. තදමිනාපෙතං වාසෙට්ඨා පරියායෙන වෙදිතබ්බං යථා ධම්මොව සෙට්ඨො ජනෙතස්මිං දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරායෝච. ජානාති ඛො පන වාසෙට්ඨා රාජා පසෙනදි කොසලො “සමණො ගොතමො අනුත්තරො සක්යකුලා පබ්බජිතො”ති. සක්යා ඛො පන වාසෙට්ඨා රඤ්ඤො පසෙනදිනො කොසලස්ස අනන්තරා අනුයුත්තා භවන්ති. කරොන්ති ඛො වාසෙට්ඨා සක්යා රඤ්ඤෙ පසෙනදිම්හි කොසලෙ නිපච්චකාරං අභිවාදනං පච්චුඨානං අඤ්ජලිකම්මං සාමීචිකම්මං. ඉති ඛො වාසෙට්ඨා යං කරොන්ති සක්යා රඤ්ඤෙ පසෙනදිම්හි කොසලෙ නිපච්චකාරං අභිවාදනං පච්චුට්ඨානං අඤ්ජලිකම්මං සාමීචිකම්මං, කරොති තං රාජා පසෙනදි කොසලො තථාගතෙ නිපච්චකාරං අභිවාදනං පච්චුට්ඨානං අඤ්ජලිකම්මං සාමීචිකම්මං. නනු{1} ‘සුජාතො සමණො ගොතමො, දුජ්ජාතො{2}’හමස්මි, බලවා සමණො ගොතමො දුබ්බලො’හමස්මි, පාසාදිකො සමණො ගොතමො දුබ්බණ්ණො’හමස්මි, මහෙසක්ඛො සමණො ගොතමො, අප්පෙසක්ඛො’ හමස්මී”ති. අථ ඛො නං ධම්මං යෙව සක්කරොන්තො ධම්මං ගරුකරොන්තො ධම්මං මානෙන්තො ධම්මං පූජෙන්තො ධම්මං අපචායමානො එවං රාජා පසෙනදි කොසලො තථාගතෙ නිපච්චකාරං කරොති අභිවාදනං පච්චුට්ඨානං අඤ්ජලිකම්මං සාමීචිකම්මං. ඉමිනා’පි ඛො එතං වාසෙට්ඨා පරියායෙන වෙදිතබ්බං යථා ධම්මො’ව සෙට්ඨො ජනෙ’තස්මිං දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරාෙය{3}ච. තුම්හෙ ඛ්වත්ථ වාසෙට්ඨා නානාජච්චා නානානාමා නානාගොත්තා නානාකුලා අගාරස්මා අනගාරියං පබ්බජිතා. ‘කෙ තුම්හෙ?’ති පුට්ඨා සමානා, ‘සමණා සක්යපුත්තියම්හා’ති පටිජානාථ. යස්ස ඛො පනස්ස වාසෙට්ඨා තථාගතෙ සද්ධා නිවිට්ඨා මූලජාතා පතිට්ඨිතා දළ්හා අසංහාරියා{4} සමණෙන වා බ්රාහ්මණෙන වා දෙවෙන වා මාරෙන වා බ්රහ්මුනා වා කෙනචි වා ලොකස්මිං, තස්සෙතං කල්ලං වචනාය: භගවතො’ම්හි පුත්තො ඔරසො මුඛතො ජාතො ධම්මජො ධම්මනිම්මිතො ධම්මදායාදො’ති. තං කිස්ස හෙතු? තථාගතස්ස හෙතං වාසෙට්ඨා අධිවචනං ධම්මකායො ඉති පි, බ්රහ්මකායො ඉති පි, ධම්මභූතො ඉති පි, බ්රහ්මභූතො ඉති පි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. නනං. මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "2. දුජාතො. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අභිසම්පරායංච - (මඡසං. සීමු.)"
                    },
                    {
                        "type": "footnote",
                        "text": "4. අසංහාරිකා PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "4. වාශිෂ්ඨයෙනි, මෙ ලොව්හි ද, පර ලොව්හි ද ජන මුළුයෙහි ධර්‍මය ම ශ්‍රේෂ්ඨ වන නියා මේ කරුණින් ද දත යුතු. වාශිෂ්ඨයෙනි. ‘මහණ ගොයුම් ශාක්‍යකුලයෙන් නික්මැ පැවිදි වූ නිරුත්තර කෙනෙකැ’ යි පසේනදී කොසොල් රජ දනී. වාශිෂ්ඨයෙනි, ශාක්‍යයෝ වනාහි පසේනදී කොසොල් රජුහට අතරක් නැති (කුලවශයෙන් සමාන වූ) ඔහු අනුව යන්නෝ වෙත්. වාශිෂ්ඨයෙනි, ශාක්‍යයෝ පසේනදී කොසොල් රජු කෙරෙහි ආදරය දැක්වීම ද වැඳීම ද දැක නැගීසිටීම ද ඇඳිලිබැඳීම ද (දැක මගින් ඉවත් වීම් ආදි) වත් දැක්වීම් ද කෙරෙත්. වාශිෂ්ඨයෙනි, මෙසේ ශාක්‍යයෝ පසේනදි කොසොල් රජු කෙරෙහි ආදරය ද වැඳීම ද දැක නැගී සිටීම ද ඇඳිලිබැඳීමද වත් දැක්වීම ද යන යමක් කෙරෙත් ද, පසේනදී කොසොල් රජ තෙම තථාගතයන් කෙරෙහි ඒ ආදර දැක්වීම ද වැඳීම ද දැක අස්නෙන් නැගීසිටීම ද ඇඳිලි බැඳීම ද වත් දැක්වීම ද යන සියල්ල කෙරෙයි. ‘මහණ ගොයුම් සුජාත ය, මම දුර්ජාතයෙමි’ යි කියා හෝ ‘මහණ ගොයුම් බලවත් ය, මම දුඹුලිමි’ යි කියා හෝ ‘මහණ ගොයුම දැකුම් කලු ය, මම් දැකුම් කලු නො වෙමි’ යි කියා හෝ ‘මහණගොයුම් මහායශස්ක ය, මම් අල්පයශස්ක වෙමි’ යි කියා හෝ හෙ තෙමේ එසේ නො කෙරෙයි. වැලි ධර්‍මයට ම සත්කාර කරනුයේ, ධර්‍මයට ම ගෞරව කරනුයේ, ධර්‍මයට ම බුහුමන් කරනුයේ, ධර්‍මයට ම පුදනුයේ, ධර්‍මයට ම යටත් පැවැතුම් දක්වනුයේ, මෙසේ පසේනදී කොසොල් රජ තෙම තථාගතයන් කෙරෙහි ආදර දැක්වීම ද වැඳීම ද දැක හුනස්නෙන් නැඟී සිටීම ද ඇඳිලිබැදීම ද වත් දැක්වීම ද යන මෙ හැම කෙරෙයි. වාශිෂ්ඨයෙනි, මෙ කරුණිනුත් ‘මේ ජන මුළුයෙහි දිටුදැමියෙහි ද පරලොව්හි ද ධර්‍මය ම උතුම්’ වන නියා දත යුතු. වාශිෂ්ඨයෙනි, තෙපි වූ කලි නානා ජාතියට අයත් වන්නාහු නානා ගොත්‍රයට අයත් වන්නාහු, නානා කුලයට අයත් වන්නාහු ගිහිගෙන් නික්මැ සස්නැ පැවිදි වූහු ය. ‘තෙපි කවුරු දැ?’ යි විචාරනු ලද්දහු ම ‘අපි ශාක්‍යපුත්‍රීය ශ්‍රමණයම්හ’ යි පිළින කරවු. වාශිෂ්ඨයෙනි, තථාගතයන් කෙරෙහි යමකුගේ සැදැහැව නොසැලී පිහිටියේද මුල්බැස ගෙන සිටියේද දැඩි වූයේද එය මහණකු හෝ බමුණකු හෝ දෙවියකු හෝ මරකු හෝ බඹකු හෝ ලොවැ කිසි ද කෙනකු විසින් සෙලැවියැ හැකි නො වේ නම්, ඒ ආර්යශ්‍රාවකයා විසින් ‘මම් භාග්‍යවතුන් වහන්සේගේ මුවින් උපන් ධර්‍මයෙන් උපන් ධර්‍මයෙන් නිර්මිත වූ ධර්‍මයට දායාද වූ ඔෳරස (ළෙහිදා) පුත් වෙමි’ යි ඔහු විසින් මේ වචනය කියනු සුදුසු ය. ඒ කවර හෙයින් ද? යත්: වාශිෂ්ඨයෙනි, ධර්‍මකාය යනු ද බ්‍රහ්මකාය යනු ද ධර්‍මභූත යනු ද බ්‍රහ්මභූත යනු දැ යි මෙ හැම තථාගතයනට නම් ය. එ හෙයිනි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 144,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "5. හොති ඛො සො වාසෙට්ඨා සමයො යං කදාචි කරහචි දීඝස්ස අද්ධුනො අච්චයෙන අයං ලොකො සංවට්ටති. සංවට්ටමානෙ ලොකෙ යෙභුෙය්යන සත්තා ආභස්සරසංවත්තනිකා හොන්ති. තෙ තත්ථ හොන්ති මනොමයා පීතිභක්ඛා සයම්පභා අන්තලික්ඛචරා සුභට්ඨායිනො චිරං දීඝමද්ධානං තිට්ඨන්ති. හොති ඛො සො වාසෙට්ඨා සමයො යං කදාචි කරහචි දීඝස්ස අද්ධුනො අච්චයෙන අයං ලොකො විවට්ටති. විවට්ටමානෙ ලොකෙ යෙභුෙය්යන සත්තා ආභස්සරකායා චවිත්වා ඉත්ථත්තං ආගච්ඡන්ති. තෙ’ධ හොන්ති මනොමයා පීතිභක්ඛා සයම්පභා අන්තලික්ඛචරා සුභට්ඨායිනො, චිරං දීඝමද්ධානං තිට්ඨන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "රසපඨවිපාතුභාවො",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "6. එකොදකීභූතං ඛො පන වාසෙට්ඨා තෙන සමයෙන හොති අන්ධකාරො අන්ධකාරතිමිසා. න චන්දිමසූරියා පඤ්ඤායන්ති, න නක්ඛත්තානි තාරකරූපානි පඤ්ඤායන්ති, න රත්තින්දිවා පඤ්ඤායන්ති, න මාසද්ධමාසා{1} පඤ්ඤායන්ති, න උතුසංවච්ඡරා පඤ්ඤායන්ති, න ඉත්ථිපුමා{2} පඤ්ඤායන්ති. සත්තා සත්තාත්වෙව සඞ්ඛං ගච්ඡන්ති. අථ ඛො තෙසං වාසෙට්ඨා සත්තානං කදාචි කරහචි දීඝස්ස අද්ධුනො අච්චයෙන රසා පඨවී උදකස්මිං සමතානි{3} සෙය්යථාපි නාම පයසො{4} තත්තස්ස{5} නිබ්බායමානස්ස උපරි සන්තානකං හොති, එව මෙව ඛො සා පාතුරහොසි. සා අහොසි වණ්ණසම්පන්නා ගන්ධසම්පන්නා රසසම්පන්නා. සෙය්යථාපි නාම සම්පන්නං වා සප්පි සම්පන්නං වා නවනීතං, එවංවණ්ණා අහොසි, සෙය්යථාපි නාම ඛුද්දමධු{6} අනෙළකං{7} එවමස්සාදා අහොසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො වාසෙට්ඨා අඤ්ඤතරො සත්තො ලොලජාතිකො, ‘අම්භො කිමෙවිදං භවිස්සතී’ති රසං පඨවිං අඞ්ගුලියා සායි. තස්ස රසං පඨවිං අඞ්ගුලියා සායතො අච්ඡාදෙසි, තණ්හා චස්ස{8} ඔක්කමි. අඤ්ඤෙ’පි ඛො වාසෙට්ඨා සත්තා තස්ස සත්තස්ස දිට්ඨානුගතිං ආපජ්ජමානා රසං පඨවිං අඞ්ගුලියා සායිංසු. නෙසං රසං පඨවිං අඞ්ගුලියා සායතං අච්ඡාදෙසි, තණ්හා ච තෙසං ඔක්කමි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. මාසඩ්ඪමාසා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. න ඉත්ථිපුරිසා. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. සමතනි - මඡසං. සමත්තානි - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. පායාසො - (සී.)"
                    },
                    {
                        "type": "footnote",
                        "text": "5. තක්කස්ස - (සීමු)"
                    },
                    {
                        "type": "footnote",
                        "text": "6. ඛුද්දං මධු - කම්. ඛුද්දමධු - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "7. අනෙලක - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "8. පස්ස - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "5. වාශිෂ්ඨයෙනි, දික් කලක් ඇවෑමෙන් කිසි යම් සමයෙක මෙ ලොව වැනැසෙන්නේ ද, එසේ වූ කැලයෙක් වෙයි. එසේ ලොව නැසෙන කල්හි සත්වයෝ බෙහෙවින් ආභස්සර බඹලොවැ උපන්නාහු වෙති. ඔහු එහි ධ්‍යානචිත්ත බලයෙන් උපන්නෝ වෙති, ප්‍රීතිය ම ආහාර කොටැත්තාහු වෙයි, තුමූ ම (සිය සිරුරු පෙබෙන් බබලන්නාහු වෙති.) අහසින් යන්නාහු වෙති. සිත්කලු වස්ත්‍රාභරණ හැඳ පැලැඳ සිටින්නාහු වෙති. එහි ඔහු ඉතා බොහෝ කලක් සිටිත්. වාශිෂ්ඨයෙනි, දික් කලක් ඇවෑමෙන් කිසි සමයෙක මෙ ලොව හටගන්නේ ද, එසේ වූ කාලයෙක් වෙයි. ඒ ලොව හට ගන්නා සමයෙහි බෙහෙවින් සත්හු ආභස්සර බ්‍රහ්මනිකායයෙන් සැව මෙ මිනිසත් බවට පැමිණෙත්. ඔහු මෙහි ධ්‍යාන සිතින් උපන්නාහු, ප්‍රීතිය ම ආහාර කොටැත්තාහු, සිය සිරුරු පෙබෙන් බබළන්නාහු, අහසින් යන්නාහු, සිත්කලු වස්ත්‍රාභරණ ඇති වැ සිටින්නාහු ඉතා බොහෝ කලක් එසේ සිටිත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "6. වාශිෂ්ඨයෙනි, එ සමයෙහි සියලු සක්වළ එක් මැ දිය කඳෙක් වැ සිටියි. අඳුරෙක් මහ ගනඳුරෙක් ම වෙයි. සඳු හිරුහු නො පැනෙත්, නකත්හු තරුහු නො පැනෙත්. රෑ දාවල්හු නො පැනෙත්, මාස පක්ෂයෝ නො පැනෙත්. ඍතු සංවත්සරයෝ නො පැනෙත්, ස්ත්‍රී පුරුෂයෝ නො පැනෙත්. සත්වයෝ සත්වයෝ යැ යි ම ව්‍යවහාරයට පැමිණෙත්. වාශිෂ්ඨයෙනි, ඉක්බිති යම්සේ නිවෙන්නාවූ හුණු කිරි මත්තෙහි යොදයෙක් වේ ද, එසේ ම රස පොළොව ඒ දිය මතුයෙහි සිසාරා පැතිරගෙන පහළ විය. එය වර්‍ණ සම්පන්න ද ගන්ධ සම්පන්න ද රස සම්පන්න ද විය. මනාකොට නිපැයුණු ගිතෙලෙක් හෝ වෙඬුරෙක් යම්බඳු වේ ද, ඒ රස පොළොව එබඳු පැහැ ඇත්තේ ද විය. නිදොස් වූ (පිළවුන් නැති) දඬුවැල්බෑ මීවදයෙක් යම් බඳු වේ ද, ඒ රස පොළොවේ රසය ද එබඳු විය."
                    },
                    {
                        "format": 13,
                        "text": "වාශිෂ්ඨයෙනි, එක්තරා ලෝල ස්වභාවය ඇති සත්වයෙක් භවත්නි, මේ කුමක් විය යුතු දැ?’ යි රස පොළොව මඳක් ඇඟිල්ලෙන් ගෙන දිවැ ගෑයේ ය. රස පොළොව ඇඟිල්ලෙන් මඳක් ගෙන දිවැ ගෑ ඔහුට එය ප්‍රිය විය. එහි තෘෂ්ණාව ද ඔහු සිතට බැස ගත.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 146,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "චන්දිමසූරියාදිපාතුභාවො",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො තෙ වාසෙට්ඨා සත්තා රසං පඨවිං හත්ථෙහි ආලුප්පකාරකං උපක්කමිංසු පරිභුඤ්ජිතුං. යතො ඛො තෙ{1} වාසෙට්ඨා සත්තා රසං පඨවිං හත්ථෙහි ආලුප්පකාරකං උපක්කමිංසු පරිභුඤ්ජිතුං. අථ ඛො තෙසං වාසෙට්ඨා සත්තානං සයම්පභා අන්තරධායි. සයම්පභාය අන්තරහිතාය චන්දිමසූරියා පාතුරහෙසුං. චන්දිමසූරියෙසු පාතුභූතෙසු, නක්ඛත්තානි තාරකරූපානි පාතුරහෙසුං, රත්තින්දිවා පඤ්ඤායිංසු. රත්තින්දිවෙසු පඤ්ඤායමානෙසු, මාසද්ධමාසා පඤ්ඤායිංසු. මාසද්ධමාසෙසු පඤ්ඤායමානෙසු උතුසංවච්ඡරා පඤ්ඤායිංසු. එත්තාවතා ඛො වාසෙට්ඨා අයං ලොකො පුන විවට්ටො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "7. අථ ඛො තෙ වාසෙට්ඨා සත්තා රසං පඨවිං පරිභුඤ්ජන්තා තම්භක්ඛා{2} තදහාරා චිරං දීඝමද්ධානං අට්ඨංසු. යථා යථා ඛො තෙ වාසෙට්ඨා සත්තා රසං පඨවිං පරිභුඤ්ජන්තා තම්හක්ඛා තදාහාරා චිරං දීඝමද්ධානං අට්ඨංසු, තථා තථා තෙසං වාසෙට්ඨා සත්තානං රසං පඨවිං පරිභුඤ්ජන්තානං ඛරත්තඤ්චෙව කායස්මිං ඔක්කමි, වණ්ණවෙවණ්ණතා{3} ච පඤ්ඤායිත්ථ. එකිදං සත්තා වණ්ණවන්තො හොන්ති, එකිදං සත්තා දුබ්බණ්ණා. තත්ථ යෙ තෙ සත්තා වණ්ණවන්තො, තෙ දුබ්බණ්ණෙ සත්තෙ අතිමඤ්ඤන්ති. ‘මයමෙතෙහි වණ්ණවන්තතරා, අම්හෙහෙතෙ දුබ්බණ්ණතරා’ති. තෙසං වණ්ණාතිමානප්පච්චයා මානාතිමානජාතිකානං රසං පඨවී අන්තරධායි. රසාය පඨවියා අන්තරහිතාය සන්නිපතිංසු. සන්නිපතිත්වා අනුත්ථුනිංසු අහොරසං අහොරසන්ති. තදෙතරහි පි මනුස්සා කිඤ්චිදෙව සුරසං{4} ලභිත්වා එවමාහංසු අහොරසං අහොරසන්ති. තදෙව පොරාණං අග්ගඤ්ඤං අක්ඛරං අනුසරන්ති නත්වෙවස්ස අත්ථං ආජානන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. යථො ඛො වාසෙට්ඨ (සීමු)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. තබ්හක්කා - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. වණ්ණවෙවජ්ජතා ච - කෙසුචි"
                    },
                    {
                        "type": "footnote",
                        "text": "4. සාධුරසං - ස්යා. PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "වාශිෂ්ඨයෙනි, අන් සත්හු ද ඒ සත්වයාගේ දෘෂ්ටානුගතියට පැමිණෙන්නාහු (ඒ සත්වයා කළ දෑ දැක එය අනුගමනය කරන්නාහු) රසපොළොව ඇඟිල්ලෙන් ගෙන ලෙවැ කෑහ. රස පොළොව ඇඟිල්ලෙන් ගෙන ලෙවැ කන ඔවුනට එය ප්‍රිය විය. එය කෙරෙහි තෘෂ්ණාව ද ඔවුන් සිතට බැස ගත. වාශිෂ්ඨයෙනි, එකල්හි ඒ සත්හු රස පොළොව පිඬු කොට කඩාගෙන වළඳන්නට පටන්ගත්හ. වාශිෂ්ඨයෙනි, එසේ කරන කල්හි ඒ සත්වයන්ගේ ස්වයම්ප්‍රභාව අතුරුදහන් විය. එය අතුරුදහන් වූ පසු සඳ හිරුහු ප්‍රකට වූහ. සඳු හිරුන් ප්‍රකට වූ පසු නකත් තරුහු ප්‍රකට වූහ. රෑ දාවල් පැනුණහ. රෑ දාවල් පැනෙන කල්හි මාස පක්ෂයෝ පැනුණහ. මාසපක්ෂයන් පැනෙන කල්හි ඍතු සංවත්සරයෝ පහළ වූහ. වාශිෂ්ඨයෙනි, මෙ තෙකින් මෙ ලොව යලි දු පහළ වූයේ වෙයි."
                    },
                    {
                        "format": 13,
                        "text": "7. වාශිෂ්ඨයෙනි, එ කල්හි, ඒ සත්වයෝ රසපොළොව පරිභෝග කරන්නාහු, එය වළඳන්නාහු, එය ම ආහාර කොටැත්තාහු බොහෝ දික් කලක් සිටියාහ. වාශිෂ්ඨයෙනි, යම් යම් සේ ම ඒ සත්වයෝ රසපොළොව පරිභෝග කරන්නාහු, එය වළඳන්නාහු, එයි ම ආහාර කොට ඇත්තාහු ඉතා බොහෝ කලක් සිටියාහු ද, එසේ එසේ ම ඒ සතුන්ගේ සිරුරෙහි රළු බව ඇති විය, නො පැහැපත් බව පැනිණ. ඔවුන් අතුරෙහි ඇතැම් සත් කෙනෙක් පැහැපත් ද ඇතැම් සත් කෙනෙක් නො පැහැපත් ද වෙත්, ඔවුන් අතුරෙන් යම් කෙනෙක් පැහැපත් වූහු ද, ඔහු අපි මොවුනට වඩා පැහැපත්තම්හ මොහු අපට වඩා පැහැයෙන් අඩුහ’ යි නොපැහැපත්තන් ඉක්මැ සිතක් (පහත් කොට සලකත්). වර්‍ණාතිමාන හේතුයෙන් මානාතිමාන ස්වභාවය ඇති ඔවුන්ගේ ඒ රස පොළොව අතුරුදහන් විය. රස පොළොව අතුරදහන් වූ කල්හි, ඔහු එක් රැස්වූහ. එක්රැස් වැ ‘අහෝ පෘථිවි රස ය, අහෝ පෘථිවි රසයැ’යි පුනපුනා කීහ. අද ද මිනිස්සු මනාප රසයක් ලැබ, ‘අහෝ රස ය, අහෝ රස යැ’ යි මෙසේ කියත්. ඒ පැරැණි ලොකොත්පත්ති වංශකථාව අනුව යෙත්. එහෙත් එහි අරුත් නො දනිත්. ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 148,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "භූමිපප්පටකපාතුභාවො",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "8. අථ ඛො තෙසං වාසෙට්ඨා සත්තානං රසාය පඨවියා අන්තරහිතාය භූමිපප්පටකො{1} පාතුරහොසි. සෙය්යථාපි නාම අහිච්ඡත්තකො එවමෙව පාතුරහොසි. සො අහොසි වණ්ණසම්පන්නො ගන්ධසම්පන්නො රසසම්පන්නො. සෙය්යථාපි නාම සම්පන්නං වා සප්පි සම්පන්නං වා නවනීතං එවංවණ්ණො අහොසි. සෙය්යථාපි නාම ඛුද්දමධු අනෙළකං එවමස්සාදො අහොසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො තෙ වාසෙට්ඨා සත්තා භූමිපප්පටකං උපක්කමිංසු පරිභුඤ්ජිතුං තෙ තං පරිභුඤ්ජන්තා තම්භක්ඛා තදාහාරා චිරං දීඝමද්ධානං අට්ඨංසු. යථා යථා ඛො තෙ වාසෙට්ඨා සත්තා භූමිපප්පටකං පරිභුඤ්ජන්තා තම්භක්ඛා තදාහාරා චිරං දීඝමද්ධානං අට්ඨංසු, තථා තථා තෙසං වාසෙට්ඨා සත්තානං භිය්යොසොමත්තාය ඛරත්තඤ්චෙ ව කායස්මිං ඔක්කමි, වණ්ණවෙවණ්ණතා ච පඤ්ඤායිත්ථ. එකිදං සත්තා වණ්ණවන්තො හොන්ති, එකිදං සත්තා දුබ්බණ්ණා. තත්ථ යෙ තෙ සත්තා වණ්ණවන්තො, තෙ දුබ්බණ්ණෙ සත්තෙ අතිමඤ්ඤන්ති මයමෙතෙහි වණ්ණවන්තතරා, අම්හෙහෙතෙ දුබ්බණ්ණතරා’ති. තෙසං වණ්ණාතිමානපච්චයා මානාතිමානජාතිකානං භූමිපප්පටකො අන්තරධායි."
                    },
                    {
                        "type": "centered",
                        "text": "බදාලතාපාතුභාවො",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "9. භූමිපප්පටකෙ අන්තරහිතෙ බදාලතා{2} පාතුරහොසි. සෙය්යථාපි නාම කලම්බුකා,{3} එවමෙව පාතුරහොසි. සා අහොසි වණ්ණසම්පන්නා ගන්ධසම්පන්නා රසසම්පන්නා. සෙය්යථාපි නාම සම්පන්නං වා සප්පි සම්පන්නං වා නවනීතං, එවංවණ්ණා අහොසි. සෙය්යථාපි නාම ඛුද්දමධු අනෙළකං, එවමස්සාදා අහොසි. අථ ඛො තෙ වාසෙට්ඨා සත්තා බදාලතං උපක්කමිංසු පරිභුඤ්ජිතුං තෙ තං පරිභුඤ්ජන්තා තම්භක්ඛා තදාහාරා චිරං දීඝමද්ධානං අට්ඨංසු. යථා යථා ඛො තෙ වාසෙට්ඨා සත්තා බදාලතං පරිභුඤ්ජන්තා තම්භක්ඛා තදාහාරා චිරං දීඝමද්ධානං අට්ඨංසු, තථා තථා තෙසං වාසෙට්ඨා සත්තානං භිය්යොසොමත්තාය ඛරත්තඤ්චෙව කායස්මිං ඔක්කමි වණ්ණවෙවණ්ණතා ච{4} පඤ්ඤායිත්ථ. එකිදං සත්තා වණ්ණවන්තො හොන්ති, එකිදං සත්තා දුබ්බණ්ණා. තත්ථ යෙ තෙ සත්තා වණ්ණවන්තො, තෙ දුබ්බණ්ණෙ සත්තෙ අතිමඤ්ඤන්ති ‘මයමෙතෙහි වණ්ණවන්තතරා, අම්හෙහෙතෙ දුබ්බණ්ණතරා’ති. තෙසං වණ්ණාතිමානපච්චයා මානාතිමානජාතිකානං බදාලතා අන්තරධායි. බදාලතාය අන්තරහිතාය සන්නිපතිංසු, සන්නිපතිත්වා අනුත්ථුනිංසු ‘අහු වත නො, අහායි වත නො බදාලතා’ති. තදෙතරහිපි මනුස්සා කෙනචිදෙව දුක්ඛධම්මෙන ඵුට්ඨා එවමාහංසු: ‘අහු වත නො, අහායි වත නො’ති. තදෙව පොරාණං අග්ගඤ්ඤං අක්ඛරං අනුසරන්ති{5}, නත්වෙවස්ස අත්ථං ආජානන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. භූමිප්පාටිකා - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. පදාලතා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. කලම්බකා - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. 27 වණ්ණවෙජ්ජතා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. අනුපතන්ති PTS, අනුස්සරන්ති - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "8. වාශිෂ්ඨයෙනි, එසමයෙහි ඒ සත්නට රස පොළොව අතුරුදහන් වූ කල්හි, භූමිපප්පටකය (බිම් පප්පඩම්) පහළ වී ය. යම්සේ නාහතු පහළ වන්නේ ද, එ මෙන්ම එය පහළ වීය. එය පැහැපැත් ද සුවඳවත් ද රසවත් ද විය. මොනොවට නිපැයුණු ගිතෙල් යම් සේ ද, මොනොවට නිපැයුණු වෙඬරු යම් සේ ද, එය එබඳු පැහැ ඇත්තේ විය, පිළවුන් නැති දඬුවැල බෑ මීය යම්සේ ද, එය එබඳු රස ඇත්තේ විය."
                    },
                    {
                        "format": 13,
                        "text": "වාශිෂ්ඨයෙනි, එ කල්හි ඒ සත්හු භූමිපර්‍පටකය වළඳන්නට පටන් ගත්හ. ඔහු එය පරිභෝග කරන්නාහු එය වළඳන්නාහු එය අහර කොට ඇත්ත හු ඉතා දික් කලක් සිටියාහ. වාශිෂ්ඨයෙනි, යම් යම්සේ ඒ සත්හු භූමිපර්‍පටකය පරිභෝග කරන්නාහු, එය වළඳන්නාහු, එය අහර කොටැත්තාහු, ඉතා බොහෝ කලක් සිටියාහු ද, එසේ එසේ ම බොහෝසෙයින් ඒ සතුන්ගේ කයෙහි රළු බව ද බැස ගත, පැහැය අඩු බවද පැනිණ. ඇතැම් සත් කෙනෙක් පැහැපත් වෙත්, ඇතැම් කෙනෙක් නො පැහැපත් වෙත්. ඔවුන් අතුරෙන් යම් සත් කෙනෙක් පැහැපත් වෙත් ද, ඔහු ‘අපි මොවුනට වඩා පැහැපතතම්හ. මොහු අපට වඩා පැහැයෙන් අඩු හ’ යි නො පැහැපත් සතුන් ඉක්මැ සිතත් (අවමන් කෙරෙත්). මානාතිමානය ස්වභාවය කොටැති ඔවුන්ගේ ඒ පැහැය නිසා ඇති වූ අතිමාන කාරණයෙන් භූමිපර්‍පටකය අතුරුදහන් විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "9. භූමිපර්‍පටකය අතුරුදහන් වූ කල්හි බදාලතාව පහළ විය. විල්පලා යම් සේ ද ඒ බදාලතාව ද එසේ ම පහළ විය. එය පැහැපත් ද සුවඳවත් ද රසවත් ද විය. මොනොවට නිපැයුණු ගිතෙල් හෝ මොනොවට නිපැයුණු වෙඬරු යම බඳු ද, එය එබඳු පැහැ ඇත්තේ විය. පිළවුන් නැති දඬුවල් බෑ මීයක් යම් බඳු ද එසේ ම එය මිහිර රසැත්තේ විය. වාශිෂ්ඨයිනි, එකල්හි ඒ සත්හු බදාලතාව වළඳන්නට පටන්ගත්හ. ඔහු එය පරිභෝග කරන්නාහු, එය වළඳන්නාහු, එය ආහාර කොටැත්තාහු, ඉතා බොහෝ කලක් සිටියාහ. වාශිෂ්ඨයිනි, යම් යම් සේ ම ඒ සත්වයෝ බදාලතාව පරිභෝග කරන්නාහු, එය වළඳන්නාහු, එය අහර කොටැත්තාහු, ඉතා බොහෝ කලක් සිටියාහු ද, එසේ එසේ ම බොහෝ සෙයින් ඒ සතුන්ගේ කයෙහි රළු බව ද ඇති විය. පැහැ අඩුබව ද පැනිණ. ඇතැම් සත් කෙනෙක් පැහැපත් වෙත්. ඇතැම් කෙනෙක් නොපැහැපත් වෙත්. ඔවුන් අතුරෙන් යම් සත් කෙනෙක් පැහැපත් වෙත් ද, ඔහු ‘අපි මොවුනට වඩා පැහැපත් වම්හ, මොහු අපටත් වඩා පැහැයෙන් අඩු හ’ යි නොපැහැපත් සතුන් ඉක්මැ සිතත්. මානාතිමානජාතික වූ ඔවුන්ගේ වර්‍ණාතිම නප්‍රත්‍යය හෙයින් බදාලතාව අතුරුදහන් විය. බදාලතාව අතුරුදහන් වූ කල්හි ඔහු එක්රැස් වූහ. එක් රැස් වැ (මිහිරි රසැති බදාලතාව) අපට ඇති විය. එය දැන් නැති වී යැ’යි පුනපුනා කීහ. දැනුදු මිනිස්සු කිසි දුකෙකි, පැහැසුණාහු ‘අපට ඇති විය, දැන නැති වී යැ’ යි මෙසේ කියත්. ඒ පැරැණි වංශකථාව අනුව යෙත්. වැලිදු එහි අර්‍ථය නො දනිත්."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 150,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "අකට්ඨපාකසාලිපාතුභාවො",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "8. අථ ඛො තෙසං වාසෙට්ඨා සත්තානං බදාලතාය අන්තරහිතාය අකට්ඨපාකො සාලි පාතුරහොසි අකණො අථුසො සුද්ධො සුගන්ධො තණ්ඩුලඵලො{1} යං තං සායං සායමාසාය ආහරන්ති. පාතො තං හොති පක්කං පටිවිරූළ්හං, යං තං පාතො පාතරාසාය ආහරන්ති, සායං තං හොති පක්කං පටිවිරූළ්හං, නාපදානං පඤ්ඤායති. අථ ඛො තෙ වාසෙට්ඨා සත්තා අකට්ඨපාකං සාලිං පරිභුඤ්ජන්තා තම්භක්ඛා තදාහාරා චිරං දීඝමද්ධානං අට්ඨංසු."
                    },
                    {
                        "type": "centered",
                        "text": "ලිඞ්ගපාතුභාවො",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "9. යථා යථා ඛො තෙ වාසෙට්ඨා සත්තා අකට්ඨපාකං සාලිං පරිභුඤ්ජන්තා තම්භක්ඛා තදාහාරා චිරං දීඝමද්ධානං අට්ඨංසු, තථා තථා තෙසං වාසෙට්ඨා සත්තානං භිය්යොසොමත්තාය ඛරත්තඤ්චෙව කායස්මිං ඔක්කමි, වණ්ණවෙවණ්ණතා ච පඤ්ඤායිත්ථ. ඉත්ථියා ච ඉත්ථිලිඞ්ගං පාතුරහොසි, පුරිසස්ස ච පුරිසලිඞ්ගං. ඉත්ථි ච සුදං ‘පුරිසං අතිවෙලං උපනිජ්ඣායති, පුරිසො ච ඉත්ථිං. තෙසං අතිවෙලං අඤ්ඤමඤ්ඤං උපනිජ්ඣායතං සාරාගො උදපාදි, පරිළාහො කායස්මිං ඔක්කමි. තෙ පරිළාහපච්චයා මෙථුනං ධම්මං පටිසෙවිංසු. යෙ ඛො පන තෙ වාසෙට්ඨා තෙන සමයෙන සත්තා පස්සන්ති මෙථුනං ධම්මං පටිසෙවන්තෙ, අඤ්ඤෙ පංසුං ඛිපන්ති, අඤ්ඤෙ සෙට්ඨිං ඛිපන්ති, අඤ්ඤෙ ගොමයං ඛිපන්ති ‘නස්ස වසලී නස්ස වසලී{2}, කථං හි නාම සත්තො සත්තස්ස එවරූපං කරිස්සතී’ති. තදෙතරහි පි මනුස්සා එකච්චෙසු ජනපදෙසු වධුයා{3} නිබ්බුය්හමානාය{4} අඤ්ඤෙ පංසුං ඛිපන්ති, අඤ්ඤෙ සෙට්ඨිං ඛිපන්ති, අඤ්ඤෙ ගොමයං ඛිපන්ති. තදෙව පොරාණං අග්ගඤ්ඤං අක්ඛරං අනුසරන්ති, නත්වෙවස්ස අත්ථං ආජානන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "මෙථුනධම්මසමාචාරො",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "10. අධම්මසම්මතං ඛො{5} පන වාසෙට්ඨා යං තෙන සමයෙන හොති, තදෙතරහි ධම්මසම්මතං. යෙ ඛො පන වාසෙට්ඨා තෙන සමයෙන සත්තා මෙථුනං ධම්මං පටිසෙවන්ති, තෙමාසම්පි ද්වෙමාසම්පි න ලභන්ති ගාමං වා නිගමං වා පවිසිතුං. යතො ඛො පන තෙ වාසෙට්ඨා සත්තා තස්මිං සමයෙ අසද්ධම්මෙ අතිවෙලං පාතබ්යතං ආපජ්ජිංසු, අථ ඛො අගාරානි උපක්කමිංසු කාතුං, තස්සෙව අසද්ධම්මස්ස පටිච්ඡාදනත්ථං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. තණ්ඩුලත්ථලො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. නස්ස අසුචි නස්ස අසුචි ති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. වධනියා - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. නිවය්හමානාය - මඡසං. නිග්ගය්හමානාය - කම්."
                    },
                    {
                        "type": "footnote",
                        "text": "5. අධම්මසම්මතං තං ඛො - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "8. වාශිෂ්ඨයෙනි, ඉක්බිත්තෙන් ඒ සත්නට බදාලතාව අතුරුදහන් වූ කල්හි නොසෑ පොළවෙහි හටගෙන පැසෙන, කුඩු නැති, දහවෙයියා නැති, සුවඳවත සහල් ම ඵල කොට ඇති හැල් වෙසෙසෙක් පහළ විය, යම් සහලක් සවස් වේලෙහි සවස් බොජුනට ගෙනෙත් ද, පසු දින උදාසනැ එය පැසුණේ යලි දු වැඩුණේ වෙයි. කපා නොගන්නා ලද තැනක් ව (නොඅඩු ව) පැනෙයි. වාශිෂ්ඨයෙනි, එකල්හි ඒ සත්වයෝ නො සාන ලද බිමෙහි හටගෙන පැසුණු හැල්සහල් පරිභෝග කරන්නාහු, එය ම වළඳන්නාහු, එය ම ආහාර කොටැත්තාහු, ඉතා බොහෝ කලක් සිටියාහ."
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "9. වාශිෂ්ඨයෙනි, යම්සේ යම්සේ ඒ සත්හු නො සෑ බිමැ හටගෙන පැසුණු හැල්සහල් පරිභෝග කරන්නාහු, එය ම වළඳන්නාහු, එය ම ආහාර කොටැත්තාහු, ඉතා බොහෝ කලක් සිටියාහු ද, එසේ එසේ ඒ සතුන්ගේ සිරුරෙහි බොහෝ සෙයින් රළුබව පහළ විය, නොපැහැපත් බවද පැනිණ. ස්ත්‍රියට ස්ත්‍රීලිංගය ද, පුරුෂයාට පුරුෂලිංගය ද පහළ විය. ස්ත්‍රී ද වූ කලී ඉතා බොහෝ වේලාවක් පුරුෂයා දෙස බලාඉඳී, පුරුෂයා ද ස්ත්‍රිය දෙස බොහෝ වේලා බලාඉඳී. මෙසේ ඉතා බොහෝ වේලා ඔවුනොවුන් දෙස බලා ඉන්නා ඔවුනට සරාගය පහළ විය. රාගපරිදාහය කයෙහි බැස ගත්තේ ය. ඔහු රාගපරිදාහ හේතුයෙන් මෙවුන්දම් සෙවූහ. වාශිෂ්ඨයෙනි, එ සමයෙහි යම් සත්ව කෙනෙක් මෙවුන්දම සෙවුනාවුන් දකිත් ද ඒ අන්‍යයෝ ‘වසලිය, නැසෙව, වසලිය, වැනැසෙව. කෙසේ නම් සතෙක් සතක්හට මෙබන්දක් කරන්නේ දැ’ යි කිය, පස් දමාගසත්, අන් කෙනෙක් අළු දමාගසත්, තව කෙනෙක් ගොම දමාගසත්. දැනුදු ඇතැම් දනවුහි මිනිස්සු එය කරත්. ස්ත්‍රියක ගෙනයනු ලබන කල්හි අන් කෙනෙක් පස් දමාගසත්, අන් කෙනෙක් අළු දමාගසත්, තව කෙනෙක් ගොම දමාගසත්. ඒ පැරැණි ලොකොත්පත්තිවංශ කථාව අනුව යෙත්. එහෙත් එහි අදහස නො ම දනිත්."
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "10. වාශිෂ්ඨයෙනි, එ සමයෙහි පස් දමාගැසුම් ආදි විසින් අධර්‍මයැ යි සම්මත වූ යමෙක් වී ද, එය දැන් ධර්‍ම යැ යි සම්මත වැ ඇත. වාශිෂ්ඨයෙනි, එ සමයෙහි යම් සත්ත්ව කෙනෙක් වනාහි මෙවුන්දම් සෙවිත් ද, ඔහු තුන් මසකුදු නැත හොත් දෙ මසකුදු ගමකට හෝ නියම්ගමකට හෝ පිවිසෙන්නට අවසර නො ලබත්. වාශිෂ්ඨයෙනි, එ සමයෙහි සත්වයෝ යම් හෙයෙකින් අසද්ධර්‍මයෙහි (මෙවුන්දම්හි) ඉතා බොහෝ වේලාවක් යෙදිය යුතු බවට පැමිණියාහු ද, එහෙයින් ම ඒ අසද්ධර්‍මය වසා ලනු පිණිස ගෙවල් කරන්නට පටන්ගත්හ."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 152,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො වාසෙට්ඨා අඤ්ඤතරස්ස සත්තස්ස අලසජාතිකස්ස එතදහොසි: “අම්භො කිමෙටාහං විහඤ්ඤාමි සාලිං ආහරන්තො සායං සායමාසාය පාතො පාතරාසාය? යන්නූනාහං සාලිං ආහරෙය්යං සකිදෙව{1} සායපාතරාසායා”ති. අථ ඛො සො වාසෙට්ඨා සත්තො සාලිං ආහාසි සකිදෙව සායපාතරාසාය. අථ ඛො වාසෙට්ඨා අඤ්ඤතරො සත්තො යෙන සො සත්තො තෙනුපසඞ්කමි, උපසඞ්කමිත්වා තං සත්තං එතදවොච: “එහි භො සත්ත සාලාහාරං ගමිස්සාමා”ති. “අලං භො සත්ත ආහටො{2} මෙ සාලි සකිදෙව සායපාතරාසායා”ති. අථ ඛො සො වාසෙට්ඨා සත්තො තස්ස සත්තස්ස දිට්ඨානුගතිං ආපජ්ජමානො සාලිං ආහාසි සකිදෙව ද්වීහාය. ‘එවම්පි කිර භො සාධූ’ති. අථ ඛො වාසෙට්ඨා අඤ්ඤතරො සත්තො යෙන සො සත්තො තෙනුපසඞ්කමි, උපසඞ්කමිත්වා තං සත්තං එතදවොච: “එහි භො සාලාහාරං ගමිස්සාමා”ති. “අලං භො සත්ත ආහෙටා මෙ සාලි සකිදෙව ද්වීහායා”ති. අථ ඛො සො වාසෙට්ඨා සත්තො තස්ස සත්තස්ස දිට්ඨානුගතිං ආපජ්ජමානො සාලිං ආහාසි සකිදෙව චතූහාය, ‘එවම්පි කිර භො සාධූ’ති. -පෙ- අථ ඛො සො වාසෙට්ඨා සත්තො තස්ස සත්තස්ස දිට්ඨානුගතිං ආපජ්ජමානො සාලිං ආහාසි සකිදෙව අට්ඨාහාය, ‘එවම්පි කිර භො සාධූ’ති. යතො ඛො තෙ වාසෙට්ඨා සත්තා සන්නිධිකාරකං සාලිං උපක්කමිංසු පරිභුඤ්ජිතුං, අථ කණො පි තණ්ඩුලං පරියොනද්ධි, ථුසො පි තණ්ඩුලං පරියොනද්ධි, ලූනම්පි නප්පටිවිරූළ්හං අපදානං පඤ්ඤායිත්ථ, සණ්ඩසණ්ඩා සාලයො{3} අට්ඨංසු."
                    },
                    {
                        "type": "centered",
                        "text": "සාලිවිභාගො",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො තෙ වාසෙට්ඨා සත්තා සන්නිපතිංසු, සන්නිපතිත්වා අනුත්ථුනිංසු, ‘පාපකා වත භො ධම්මා සත්තෙසු පාතුභූතා, මයං හි පුබ්බෙ මනොමයා අහුම්හ පීතිගක්ඛා සයම්පභා අන්තලික්ඛචරා සුභට්ඨායිනො චිරං දීඝමද්ධානං අට්ඨම්හ{4} තෙසං නො අම්හාකං කදාචි කරහචි දීඝස්ස අද්ධුනො අච්චයෙන රසා පඨවී උදකස්මිං සමතානි. සා අහොසි වණ්ණසම්පන්නා ගන්ධසම්පන්නා රසසම්පන්නා. තෙ මයං රසං පඨවිං හත්ථෙහි ආලුප්පකාරකං උපක්කමිම්හ පරිභුඤ්ජිතුං, තෙසං නො රසපඨවිං හත්ථෙහි ආලුප්පකාරකං උපක්කමතං පරිභුඤ්ජිතුං සයම්පභා අන්තරධායි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සකිංදෙව - කම්."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ආහතො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. සාලියො - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "4. අට්ඨම්හා - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "වාශිෂ්ඨයෙනි, එ කල්හි එක්තරා අලස ගති ඇති සතක්හට “භවත්නි, උදේ බොජුන් පිණිස උදාසන ද හවස බොජුන් පිණිස සවස් කල්හි ද හැල් ගෙන එනුයෙම් මම් කුමට මෙසේ වෙහෙසෙම් ද? උදේ හවස දෙක්හි ම බොජුන් පිණිස එක් වරට ම හැල්ගෙන ආයෙම් වීම් නමැ යෙහෙකැ” යි මේ සිත විය. වාශිෂ්ඨයෙනි. ඒ සත් තෙම උදේ සවස බොජුන් පිණිස එක්වර ම හැල් ගෙනායේ ය. එ කලැ එක්තරා සත්වයෙක් ඒ සත්වයා කරා එළැඹි යේ ය. එළැඹ ඔහුට ‘භවත් සත්වය, එව, හැල් ගෙන ඊමට යම්හ’ යි කී ය. ‘භවත් සත්වය, කම් නැත. උදේ සවස බොජුන් පිණිස මා විසින් එක් වර ම හැල් ගෙනෙන ලදැ’ යි හේ කී ය. වාශිෂ්ඨයෙනි, එ විට ඒ සත්ව තෙම ඒ (එක් වර දෙවේලට ම හැල් ගෙනා) සත්වයාගේ දෘෂ්ටානුගතියට (ඔහු කළා දුටු දැය අනුව යෑමට) පැමිණෙනුයේ, ‘භවත්නි, මෙසේත් යහපතැ’ යි කිය දෙදවසකට එක් වරක් හැල් ගෙනායේ ය. වාශිෂ්ඨයෙනි, එ කල්හි එක්තරා සත්වයෙක් (ඒ දෙදවසකට එක් වරක් හැල් ගෙනා) සත්වයා කරා එළැඹියේ ය, එළැඹ, ‘භවත් සත්වය, හැල් ගෙනීමට යම්හ’ යි කී ය. ‘භවත් සත්වය, එයින් කම් නැත. මා විසින් දෙදවසකට ම (පොහොනා පමණ) හැල් එක් වරට ම ගෙනෙන ලදැ’ යි ඒ සත්ව තෙම කී ය, වාශිෂ්ඨයෙනි, එ විට ඒ සත්ව තෙම අනෙකා කළා දුටු දෑ අනුව යන්නේ, ‘භවත්නි, මෙසේත් යහපතැ’ යි කියා එක් වර ම සතර දිනකට පොහොණා පමණ හැල් ගෙන්යේ ය. … එකල්හි ඒ සත් තෙම අනෙකා කළා දුටු දෑ අනුව යනුයේ, ‘භවත්නි, මෙසේත් යහපතැ’ යි කියා එක් වර ම අට දවසකට පහොනා පමණ හැල් ගෙනායේ ය. වාශිෂ්ඨයෙනි, ඒ සත්වයෝ යම් කලෙක හැල් රැස් කොට තබා පරිභෝග කරන්නට පටන් ගත්තු ද, එකල්හි කුඩු ද සහල වසා ගත්තේ ය. දහවෙයියා ද සහාල වසා ගත්තේ ය. හැල් කපා ගත් තැන ද යලි නො වඩුණේ ය. හැල් කපා ගත් තැන ද ඌන ව පැනුණේ ය. හැල්හු පඳුරු පඳුරු වැ සිටියාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "වාශිෂ්ඨයෙනි, එ කල් හි ඒ සත්වයෝ එක් තැනකට රැස්වූහ. රැස් ව උනුන් හා මෙසේ කතා කැරැගත්හ: භවත්නි, ඛෙදයෙක! ලාමක ස්වභාවයෝ සත්වයන් කෙරෙහි පහළ වූහ. අපි පෙරැ මනෝමය වූ, ප්‍රීතිය භෝජනය කොටැති ව ස්වයම්ප්‍රභ ව, ශොභන වස්ත්‍රාභරණ ඇති ව සිටින්නමෝ ඉතා බොහෝ කල් සිටුම්හ. ඒ අපට කිසි කලෙක්හි ඉතා බොහෝ කලක් ඇවෑමෙන් රස පොළොව දියෙහි පැතිරැගෙන සිටියේය. එය පැහැවත් ද සුවඳවත් ද රසවත් ද විය. ඒ අපි රස පොළොව අත්වලින් පිඬුකොට ගෙන වළඳන්නට පටන් ගතුම්හ. රස පොළොව අත්වලින් පිඬු කොට ගෙන වළදන්නට පටන්ගත් අපගේ ස්වයම්ප්‍රභාව අතුරුදහන් විය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 154,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තාය අන්තරහිතාය චන්දිමසූරියා{1} පාතුරහෙසුං. චන්දිමසූරියෙසු පාතුභූතෙසු නක්ඛත්තානි තාරකරූපානි පාතුරහෙසුං, නක්ඛත්තෙසු තාරකරූපෙසු පාතුභූතෙසු රත්තින්දිවා පඤ්ඤායිංසු. රත්තින්දිවෙසු පඤ්ඤායමානෙසු මාසද්ධමාසා පඤ්ඤායිංසු. මාසද්ධමාසෙසු පඤ්ඤායමානෙසු උතුසංවච්ඡරා පඤ්ඤායිංසු. තෙ මයං රසං පඨවිං පරිභුඤ්ජන්තා තම්භක්ඛා තදාහාරා චිරං දීඝමද්ධානං අට්ඨම්හ. තෙසං නො පාපකානඤ්ඤෙව අකුසලානං ධම්මානං පාතුභාවා රසා පඨවී අන්තරධායි. රසාය පඨවියා අන්තරහිතාය භූමිපප්පටකො පාතුරහොසි. සො අහොසි වණ්ණසම්පන්නො ගන්ධසම්පන්නො රසසම්පන්නො. තෙ මයං භූමිපප්පටකං උපක්කමිම්හ පරිභුඤ්ජිතුං. තෙ මයං තං පරිභුඤ්ජන්තා තම්භක්ඛා තදාහාරා චිරං දීඝමද්ධානං අට්ඨම්හ. තෙසං නො පාපකානඤ්ඤෙව අකුසලානං ධම්මානං පාතුභාවා භූමිපප්පටකෙ අන්තරධායි. භූමිපප්පටකෙ අන්තරහිතෙ බදාලතා පාතුරහොසි. සා අහොසි වණ්ණසම්පන්නා ගන්ධසම්පන්නා රසසම්පන්නා. තෙ මයං බදාලතං උපක්කමිම්හ පරිභුඤ්ජිතුං. තෙ මයං තං පරිභුඤ්ජන්තා තම්භක්ඛා තදාහාරා චිරං දීඝමද්ධානං අට්ඨම්හ. තෙසං නො පාපකානඤ්ඤෙව අකුසලානං ධම්මානං පාතුභාවා බදාලතා අන්තරධායි. බදාලතාය අන්තරහිතාය අකට්ඨපාකො සාලි පාතුරහොසි, අකණො අථුසො සුද්ධො සුගන්ධො තණ්ඩුලඵලො. යං තං සායං සායමාසාය ආහරාම, පාතො තං හොති පක්කං පටිවිරූළ්හං. යං තං පාතො පාතරාසාය ආහරාම, සායන්තං හොති පක්කං පටිවිරූළ්හං. නාපදානං පඤ්ඤායිත්ථ. තෙ මයං අකට්ඨපාකං සාළිං පරිභුඤ්ජන්තා තම්භක්ඛා තදාහාරා චිරං දීඝමද්ධානං අට්ඨම්හ. තෙසං නො පාපකානඤ්චෙව අකුසලානං ධම්මානං පාතුභාවා කණො පි තණ්ඩුලං පරියොනද්ධි, ථුසො පි තණ්ඩුලං පරියොනද්ධි, ලූනම්පි නප්පටිවිරූළ්හං, අපදානං පඤ්ඤායිත්ථ, සණ්ඩසණ්ඩා සාලයො ඨිතා. යන්නූන මයං සාලිං විභජෙය්යාම, මරියාදං ඨපෙය්යාමා’ති. අථ ඛො තෙ වාසෙට්ඨ සත්තා සාලිං විභජිංසු, මරියාදං ඨපෙසුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "11. අථ ඛො වාසෙට්ඨා අඤ්ඤතරො සත්තො ලොලජාතිකො සකං භාගං පරිරක්ඛන්තො අඤ්ඤතරං භාගං අදින්නං ආදියිත්වා පරිභුඤ්ජි. තමෙනං අග්ගහෙසුං, ගහෙත්වා එතදවොචුං: ‘පාපකං වත භො සත්ත කරොසි, යත්ර හි නාම සකං භාගං පරිරක්ඛන්තො අඤ්ඤතරං භාගං අදින්නං ආදියිත්වා පරිභුඤ්ජස්සසි{2}. මාස්සු භො සත්ත පුනපි එවරූපමකාසී’ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. චන්දිමසුරියා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. පරිභුඤ්ජි - ස්යා. පරිභුඤ්ජසි - (සීමු)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "එය අතුරුදහන් වූ කල්හි සඳහිරුහූ ප්‍රකට වූහ. සඳුහිරුන් පහළවූ කල්හි නක්ෂත්‍රයෝ ද තාරකාරූපයෝ ද ප්‍රකට වූහ. නක්ෂත්‍රතාරකාරූප ප්‍රකට වූ පසු රෑදාවල්හු පැනුණහ. රෑදාවල් පැනෙන කල්හි මාස පක්ෂයෝ පැනුණහ. මාසපක්ෂයන් පැනෙන කල්හි ඍතුසංවස්තරයෝ පැනුණහ. ඒ අපි රස පොළොව පරිභෝග කරන්නමෝ, එය වළඳන්නමෝ, එය ආහාර කොටැ ගත්තමෝ, ඉතා බොහෝ කලක් සිටියම්හ. ඒ අපට ලාමක අකුසල් දහම් පහළ වීමෙන් ම රසපොළොව අතුරුදහන් විය. රස පොළොව අතුරුදහන් වූ කල්හි භූමිපර්‍පටකය පහළ විය. ඒ අපි භූමිපර්‍පටකය පරිභෝග කරන්නට පටන් ගතුම්හ. ඒ අපි එය පරිභෝග කරන්නමෝ, එය වළඳන්නමෝ එය ම ආහාර කොට ඇත්තමෝ ඉතා බොහෝ කලක් සිටියම්හ. ඒ අපට ලාමක අකුසල් දහමුන් පහළ වීමෙන් භූමිපර්‍පටකය අතුරුදහන් විය. භූමිපර්‍පටකය අතුරුදහන් වූ කල්හි බදාලතාව පහළ විය. එය පැහැවත් සුවඳවත් රසවත් විය. ඒ අපි බදාලතාව පරිභෝග කරන්නට පටන් ගතුමු. එය පරිභෝග කරන්නමෝ, එය වළඳන්නමෝ, එය ම ආහාර කොටැත්තමෝ ඉතා බොහෝ කලක් සිටියම්හ. ඒ අපට ලාමක අකුශල ධර්‍ම පහළ වීමෙන් බදාලතාව අතුරුදහන් විය. බදාලතාව අතුරුදහන් වූ කල්හි කුඩු නැති දහවෙයියා නැති පිරිසිදු සුවඳැති සහල ම ඵල කොටැති නො සානා ලද බිමැ හටගෙන පැසෙන හැල් වෙසෙසෙක් පහළ විය. සවස් කලැ සවස් බොජුනට යම් සහලක් ගෙනෙත් ද පසුදිනැ උදාසනැ එය පැසුණේ යලි දු වැඩුණේ වෙයි. කපා නොගන්නා ලද තැනෙක් ම (නොඅඩු ව) පැහුණේ ය. ඒ අපි නො සාන ලද බිමැ හටගෙන පැසුණු හැල්සහල් පරිභෝග කරන්නමෝ, එය ම වළඳන්නමෝ, එය ම අහර කොටැත්තමෝ, ඉතා බොහෝ කලක් සිටියම්හ. ඒ අපට ලාමක අකුසල් දහම් පහළ වීමෙන් ම කුඩු ද සහල වසාගෙන බැඳී සිටියේ ය. දහවෙයියා ද සහල වසා බැඳී සිටියේ ය. කපා ගන්නා ලද තැන ද යලි නො නැඟුණේ ය. ඌනත්වය පැනුණේ ය. පඳුරු පඳුරු වැ හැල්හු සිටියාහ. අපි හැල් (අප අතරැ) වෙන වෙන ම බෙදා ගන්නමෝ නම්, ඉම් තබන්නමෝ නම් මැනැවැ” යි මෙසේ කතා කැරැගත්හ. වාශිෂ්ඨයෙනි, ඉක්බිති ඒ සත්වයෝ හැල් බෙදූහ. ඉම් තැබූහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "11. වාශිෂ්ඨයෙනි, එ කල්හි ලොල්පියෙවි ඇති එක්තරා සතෙක් සිය කොටස රැකගනුයේ තමාට නො දෙන ලද එක්තරා කොටසක් ගෙන පරිභෝග කෙළේ ය. (සෙස්සෝ) ඔහු අල්ලා ගත්හ, අල්ලා ගෙන ‘භවත් සත්වය, යම් බඳු තෝ සිය කොටස රකිනුයෙහි තමහට නොදුන් එක්තරා කොටසක් ගෙන පරිභෝග කෙළෙහි ද, ඒ තෝ ඒකානත්තයෙන් ලාමක දැයක් කෙළෙහි ය. භවත් සත්වය, යලිත් මෙබන්දක් නහමක් කරව’ යි කී හ. ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 156,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "‘එවං භො’ති ඛො වාසෙට්ඨා සො සත්තො තෙසං සත්තානං පච්චස්සොසි. දුතියම්පි ඛො වාසෙට්ඨ සො සත්තො සකං භාගං පරිරක්ඛන්තො අඤ්ඤතරං භාගං අදින්නං ආදියිත්වා පරිභුඤ්ජි. තමෙනං අග්ගහෙසුං, ගහෙත්වා එතදවොචුං: ‘පාපකං වත භො සත්ත කරොසි, යත්ර හි නාම සකං භාගං පරිරක්ඛන්තො අඤ්ඤතරං භාගං අදින්නං ආදියිත්වා පරිභුඤ්ජිස්සි. මාස්සු භො සත්ත පුනපි එවරූපමකාසී’ති. තතියම්පි ඛො වාසෙට්ඨා සො සත්තො සකං භාගං පරිරක්ඛන්තො අඤ්ඤතරං භාගං අදින්නං ආදියිත්වා පරිභුඤ්ජි. තමෙනං අග්ගහෙසුං, ගහෙත්වා එතදවොචුං: පාපකං වත භො සත්ත කරොසි, යත්ර හි නාම සකං භාගං පරිරක්ඛන්තො අඤ්ඤතරං භාගං අදින්නං ආදියිත්වා පරිභුඤ්ජිස්සසි. මාස්සු භො සත්ත පුනපි එවරූපමකාසී’ති. අඤ්ඤෙ පාණිනා පහරිංසු, අඤ්ඤෙ ලෙඩ්ඩුනා{1} පහරිංසු, අඤ්ඤෙ දණ්ඩෙන පහරිංසු. තදග්ගෙ ඛො පන වාසෙට්ඨා අදින්නාදානං පඤ්ඤායති, ගරහා පඤ්ඤායති, මුසාවාදො පඤ්ඤායති, දණ්ඩාදානං පඤ්ඤායති."
                    },
                    {
                        "type": "centered",
                        "text": "මහාසම්මතරාජා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "12. අථ ඛො තෙ වාසෙට්ඨා සත්තා සන්නිපතිංසු, සන්නිපතිත්වා අනුත්ථුනිංසු “පාපකා වත භො ධම්මා සත්තෙසු පාතුභූතා, යත්ර හි නාම අදින්නාදානං පඤ්ඤායිස්සති, ගරහා පඤ්ඤායිස්සති, මුසාවාදො පඤ්ඤායිස්සති, දණ්ඩාදානං පඤ්ඤායිස්සති. යන්නූන මයං එකං සත්තං සම්මන්නෙය්යාම, යො{2} නො සම්මා ඛීයිතබ්බං ඛීයෙය්ය, සම්මා ගරහිතබ්බං ගරහෙය්ය, සම්මා පබ්බාජෙතබ්බං පබ්බාජෙය්ය. මයං පනස්ස සාලීනං භාගං අනුප්පදස්සාමා”ති. අථ ඛො තෙ වාසෙට්ඨා සත්තා යො නෙසං සත්තො අභිරූපතරො ච දස්සනීයතරො ච පාසාදිකතරො ච මහෙසක්ඛතරො ච, තං සත්තං උපසඞ්කමිත්වා එතදවොචුං: එහි භො{3} සත්ත, සම්මා ඛීයිතබ්බං ඛීය, සම්මා ගරහිතබ්බං ගරහ, සම්මා පබ්බාජෙතබ්බං පබ්බාජෙහි. මයං පන තෙ සාලීනං භාගං අනුප්පදස්සාමා”ති. ‘එවං භො’ති ඛො වාසෙට්ඨා සො සත්තො තෙසං සත්තානං පටිස්සුණිත්වා, සම්මා ඛීයිතබ්බං ඛීයි, සම්මා ගරහිතබ්බං ගරහි, සම්මා පබ්බාජෙතබ්බං පබ්බාජෙසි. තෙ පනස්ස සාලීනං භාගං අනුප්පදංසු. මහාජනසම්මතො’ති ඛො වාසෙට්ඨා ‘මහාසම්මතො මහාසම්මතො’ත්වෙව පඨමං අක්ඛරං උපනිබ්බත්තං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ලෙණ්ඩුනා - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ඛො - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. සො - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "වාශිෂ්ඨයෙනි, ඒ සත්ව තෙම ‘එසේ ය භවත්නි’ යි කියා ම ඒ සත්නට පිළිවදන් දුන. වාශිෂ්ඨයෙනි, දෙවෙනි වර ද ඒ සත් තෙම සිය කොටස රකිනුයෙහි, තමාට නොදුන් එක්තරා කොටසක් ගෙන පරිභෝග කළේය. සෙස්සෝ ඔහු අල්ලා ගත්හ. අල්ලා ගෙන, ‘භවත් සත්වය, යම්බඳු තෝ සිය කොටස රකිනුයෙහි, තමාට නොදුන් එක්තරා කොටසක් ගෙන පරිභෝග කෙරෙහි ද, ඒ තෝ ලාමක දැයක් කෙරෙහි ය. භවත් සත්වය, යලිත් මෙබන්දක් නො කරව’ යි කී හ. වාශිෂ්ඨයෙනි, තෙවෙනි වර ද ඒ සත් තෙම සිය කොටස රකිනුයෙහි, තමාට නො දුන් කොටසක් ගෙන පරිභෝග කළේ ය. සෙස්සෝ ඔහු අල්ලා ගත්හ. අල්ලා ගෙන, ‘භවත් සත්වය, යම් බඳු තෝ සිය කොටස රකිනුයෙහි, තමාහට නොදුන් එක්තරා කොටසක් ගෙන පරිභෝග කෙරෙහි ද, ඒ තෝ ලාමක දැයක් ම කෙරෙහි ය. භවත් සත්වය, යලිත් මෙබන්දක් නහමක් කරව’ යි කී හ. කෙනෙක් අතින් පහළහ. කෙනෙක් කැටින් පහළහ. කෙනෙක් දංඩෙන් පහළහ, වාශිෂ්ඨයෙන, එතැන් පටන් කොට අයිනාදන පැනෙයි, ගැරැහුම පැනෙයි, මුසා බිණීම පැනෙයි, දඬු ගැනුම් පැනෙයි."
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "12. වාශිෂ්ඨයෙනි, ඉක්බිති ඒ සත්වයෝ එක් රැස් වූ හ. එක්රැස් වැ, “භවත්නි, ඛේදයෙක! යම් කෙනෙකු කෙරෙහි අයිනාදන පැනෙන්නේ ද, ගැරැහුම පැනෙන්නේ ද, මුසා බිණීම පැනෙන්නේ ද, දඬු ගැන්ම පැනෙන්නේ ද, ඒ සතුන් කෙරෙහි එසේ වූ ලාමක අකුශල ධර්‍ම කෙනෙක් පහළ වූහ. යමෙක් අපගෙන් දොස්නැගිය යුත්තාට මොනොවට දොස්නගන්නේ ද ගැරැහිය යුත්තහු ට මොනොවට ගරහන්නේ ද, නෙරැපිය යුත්තහු මොනොවට නෙරපන්නේ ද, අපි එසේ වූ එක් සත්වයකු සම්මත කැරැගනුමෝ නම් ඉතා යෙහෙක. අපි වූ කලී ඔහුට හැල් කොටසක් දෙන්නමු” යි කතා කැරැගත්හ. වාශිෂ්ඨයෙනි, එ කල්හි ඒ සත්වයෝ යම් සත්වයෙක් ඔවුන් අතුරෙහි වඩා රූපසම්පන්න ද, වඩා දැකුම්කලු ද, වඩා සිත පහදවන සුලු ද, වඩා මහ තෙදැත්තේ ද, ඒ සත්වයා කරා එළැඹ, ‘භවත් සත්වය, මෙහි එන්න, දොස්නැගියැ යුත්තාට නිසිපරිදි දොස් නගන්න, ගැරැහිය යුත්තාට මොනොවට ගරහන්න, නෙරැපිය යුත්තහු මොනොවට නෙරපන්න. අපි වනාහි ඔබට හැල් කොටසක් දෙන්නමු” යි මෙ බස් කීහ. ‘භවත්නි, එසේ යැ’ යි කියා ම ඒ සත්ත්ව තෙම ඔවුනට පිළිවදන් දී දොස් නැගිය යුත්තහුට මොනොවට දොස් නැගීය, ගැරැහිය යුත්තහුට ගැරැහී ය, නෙරැපිය යුත්තහු මොනොවට නෙරැපී ය. ඔව්හු ඔහුට හැල් කොටසක් දුන්හ. වාශිෂ්ඨයෙනි. මහා ජනාය විසින් සම්මත හෙයින් ම ඔහුට ‘මහාසම්මත ය, මහාසම්මත යැ’ යි ම පළමු නම් වහර ඇති විය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 158,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඛෙත්තානං අධිපතීති ඛො වාසෙට්ඨා ‘ඛත්තියො ඛත්තියො’ත්වෙව දුතියං අක්ඛරං උපනිබ්බත්තං. ධම්මෙන පරෙ{1} රඤ්ජෙතීති ඛො වාසෙට්ඨා ‘රාජා, රාජා’ත්වෙව තතියං අක්ඛරං උපනිබ්බත්තං. ඉති ඛො වාසෙට්ඨා එවමෙතස්ස ඛත්තියමණ්ඩලස්ස පොරාණෙන අග්ගඤ්ඤෙන අක්ඛරෙන අභිනිබ්බත්ති අහොසි. තෙ සඤ්ඤෙව සත්තානං අනඤ්ඤෙසං,{2} සදිසානඤ්ඤෙව නො අසදිසානං. ධම්මෙනෙව, නො අධම්මෙන. ධම්මො හි වාසෙට්ඨා සෙට්ඨො ජනෙ’තස්මිං දිට්ඨෙචෙව ධම්මෙ අභිසම්පරාෙයච."
                    },
                    {
                        "type": "centered",
                        "text": "බ්රාහ්මණමණ්ඩලං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "13. අථ ඛො තෙසං වාසෙට්ඨා සත්තානඤ්ඤෙව එකච්චානං එතදහොසි: පාපකා වත භො ධම්මා සත්තෙසු පාතුභූතා, යත්ර හි නාම අදින්නාදානං පඤ්ඤායිස්සති, ගරහා පඤ්ඤායිස්සති, මුසාවාදො පඤ්ඤායිස්සති, දණ්ඩාදානං පඤ්ඤායිස්සති, පබ්බාජනං පඤ්ඤායිස්සති. යන්නූන මයං පාපකෙ අකුසලෙ ධම්මෙ වාහෙය්යාමා”ති. තෙ පාපකෙ අකුසලෙ ධම්මෙ බාහෙසුං{3}. පාපකෙ අකුසලෙ ධම්මෙ බාහෙන්තීති ඛො වාසෙට්ඨා ‘බ්රාහ්මණා බ්රාහ්මණා’ත්වෙව පඨමං අක්ඛරං උපනිබ්බත්තං. තෙ අරඤ්ඤායතනෙ පණ්ණකුටියො කරිත්වා පණ්ණකුටීසු ඣායන්ති, වීතඞ්ගාරා වීතධූමා පන්නමුසලා සායං සායමාසාය පාතො පාතරාසාය ගාමනිගමරාජධානියො ඔසරන්ති ඝාසමෙසානා{4} තෙ ඝාසං පටිලභිත්වා පුනදෙව අරඤ්ඤායතනෙ පණ්ණකුටීසු ඣායන්ති. තමෙනං මනුස්සං දිස්වා එවමාහංසු: ‘ඉමෙ ඛො භො සත්තා අරඤ්ඤායතනෙ පණ්ණකුටියො කරිත්වා පණ්ණකුටීසු ඣායන්ති, විතඞ්ගාරා වීතධූමා පන්නමුසලා සායං සායමාසාය පාතො පාතරාසාය ගාමනිගමරාජධානියො ඔසරන්ති ඝාසමෙසානා. තෙ ඝාසං පටිලභිත්වා පුනදෙව අරඤ්ඤායතනෙ පණ්ණකුටීසු ඣායන්ති ඣායන්තීති ඛො පන වාසෙට්ඨා ‘ඣායකා ඣායකා’ත්වෙව දුතියං අක්ඛරං උපනිබ්බත්තං. තෙසඤ්ඤෙව ඛො වාසෙට්ඨා සත්තානං එකච්චෙ සත්තා අරඤ්ඤායතනෙ පණ්ණකුටීසු තං ඣානං අනභිසම්භුණමානා ගාමසාමන්තං නිගමසාමන්තං ඔසරිත්වා ගන්ථෙ කරොන්තො අච්ඡන්ති. තමෙනං මනුස්සා දිස්වා එවමාහංසු: ඉමෙ ඛො භො සත්තා අරඤ්ඤායතනෙ පණ්ණකුටීසු තං ඣානං අනභිසමගුණමානා ගාමසාමන්තං නිගමසාමන්තං ඔසරිත්වා ගත්ථෙ කරොන්තො අච්ඡන්ති! න’දානි මෙ ඣායන්ති, න’දානි මෙ ඣායන්තී ති ඛො වාසෙට්ඨා අජ්ඣායකා අජ්ඣායකා’ත්වෙව තතියං අක්ඛරං උපනිබ්බත්තං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පරෙසං - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අඤ්ඤෙසං - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. වාහෙසුං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. ඝාසමෙසමානා - මඡසං. ඝාසමේසනා - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "වාශිෂ්ඨයෙනි, කෙත්නට අධිපති වී නු යි ‘ක්ෂත්‍රිය ය, ක්ෂත්‍රිය යැ’ යි ම දෙවෙනි නම් වහර ඇති විය. වාශිෂ්ඨයෙනි, දැහැමින් මෙරමා රඳවානු යි (සුවපත් කෙර්නු යි පිණවානු යි) ‘රජ ය, රජ’ යැ යි කියා ම තෙවෙනි නම් වහර ඇති විය. වාශිෂ්ඨයෙනි, මෙසේ පැරැණි වූ අග්‍ර යැ යි දන්නා ලද නම් වහරින් ක්ෂත්‍රිය මණ්ඩලයාගේ ආරම්භය විය. එ ද ඒ සත්වයනට ම ය, අන් සත්වකෙනෙකුට නො වේ. සමාන සත්වයනට ම ය, අසමාන සත්ව කෙනෙකුට නො වේ. ධර්‍මයෙන් ම ය, අධර්‍මයෙන් නො වේ. වාශිෂ්ඨයෙනි, එහෙයින් මේ ජනයා කෙරෙහි මෙ ලොව්හි ද පරලොව්හි ද ධර්‍මය ම ශ්‍රේෂ්ඨ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "13. වාශිෂ්ඨයිනි, එක්බිති ඒ ඇතැම් සත්ව කෙනකුට, “භවත්නි, ඛේදයෙක! යම් කෙනකු කෙරෙහි අයිනාදන පැනෙන්නේ ද, ගැරහුම පැනෙන්නේ ද, මුසවා ව පැනෙන්නේ ද, දඬු ගැන්ම පැනෙන්නේ ද, රටින් නෙරැපීම පැනෙන්නේ ද එසේ වූ සතුන් කෙරෙහි ලාමක ධර්‍මයෝ පහළ වූවාහු වෙයි. අපි ලාමක වූ අකුශල ධර්‍මයන් බාහනය (බැහැර ලීම) කරනනමෝ නම් යෙහෙකැ” යි මේ සිත විය. ඔහු ලාකම වූ අකුශල ධර්‍ම බාහනය කළහ (බැහැරැ ලූහ). වාශිෂ්ඨයෙනි, ලාමක වූ අකුශල ධර්‍මයන් වාහනය කෙරෙත් (බැහැර ලත්) නු යි ම ‘බ්‍රාහ්මණයෝ ය, බ්‍රාහ්මණයෝ ය’ කියා ම පළමු නාම ව්‍යවහාරය පහළ විය. ඔහු තුමූ වන පෙදෙස්හි පන්සල් කොට ගෙන එහි ධ්‍යාන කෙරෙත්. (පිස කැව යුතු දැයක් නැති බැවින්) පහවූ අඟුරු ඇත්තාහු පහ වූ දුම් ඇත්තාහු, කොටා පිසියැ යුතු දැයක් නැති බැවින් බිමට වන් මොහොල් ඇත්තාහු (අඟුරු දුම් මොහොල් යන මේ කිසිවකුත් නැත්තාහු), සවස් බොජුන පිණිස සවස ද, උදේ බොජුන් පිණිස උදාසන ද අහර සොයනුවෝ ගම් නියම් ගම් රජදහන්වලට බසිත්. ඔහු අහර ලැබගෙන් පෙරළා ගොස් වන පෙදෙස්හි පන්සල්හි ධ්‍යාන කෙරෙත්. වාශිෂ්ඨයෙනි, ‘ධ්‍යාන කෙරෙත්, ධ්‍යාන කෙරෙත් නු’ යි ම ‘ධ්‍යායකයෝ ය, ධ්‍යායකයෝ යැ’ යි කියා ම දෙවෙනි නම් වහරෙක් ඔවුනට ඇති විය. වාශිෂ්ඨයිනි, ඒ සත්වයන් ම අතුරෙන් ඇතැම් කෙනෙක් වන පෙදෙසෙහි පන්සල්හි ඒ දහන් වඩීම නොකළ හැක වන්නාහු ගම් අසලට නියම්ගම් අසලට බැස, ග්‍රන්ථ කෙරෙමින් ඉඳිත්, මිනිස්සු ඔවුන් දැක, “භවත්නි, මේ සත්හු වෙනෙහි පන්සල්හි ඒ ධ්‍යාන කළ නො හැක්කාහු, ගම් අසලට නියම්ගම් අසලට බැස, ග්‍රන්ථ කෙරෙමින් ඉඳිත්.” වාශිෂ්ඨයිනි, ‘දැන් මොහු ධ්‍යාන නො කෙරෙත්, දැන් මොහු ධ්‍යාන නොකෙරෙත්’ නු යි මොහු ‘අධ්‍යායකයෝ’ යැ යි ම ඔවුනට තෙවෙනි නම් වහරෙක් උපන්නේය. "
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 160,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "හීනසම්මතං ඛො පන වාසෙට්ඨා යං තෙන සමයෙන හොති, තදෙතරහි සෙට්ඨසම්මතං. ඉති ඛො වාසෙට්ඨා එවමෙතස්ස බ්රාහ්මණමණ්ඩලස්ස පොරාණෙන අග්ගඤ්ඤෙන අක්ඛරෙන අභිනිබ්බත්ති අහොසි. තෙසඤ්ඤෙව සත්තානං අනඤ්ඤෙසං, සදිසානඤ්ඤෙව නො අසදිසානං, ධම්මෙනෙව, නො අධම්මෙන. ධම්මො හි වාසෙට්ඨා සෙට්ඨො ජනෙ’තස්මිං දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරාෙයච."
                    },
                    {
                        "type": "centered",
                        "text": "වෙස්සමණ්ඩලං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "14. තෙසඤ්ඤෙව ඛො වාසෙට්ඨා සත්තානං එකච්චෙ සත්තා මෙථුනං ධම්මං සමාදාය විස්සුතං කම්මන්තෙ{1} පයොජෙසුං. මෙථුනං ධම්මං සමාදාය විස්සුතං කම්මන්තෙ පෙයාජෙන්තීති ඛො වාසෙට්ඨා වෙස්සා වෙස්සාත්වෙව අක්ඛරං උපනිබ්බත්තං. ඉති ඛො වාසෙට්ඨා එවමෙතස්ස වෙස්සමණ්ඩලස්ස පොරාණෙන අග්ගඤ්ඤෙන අක්ඛරෙන අභිනිබ්බත්ති අහොසි, තෙසඤ්ඤෙව සත්තානං අනඤ්ඤෙසං සදිසානඤ්ඤෙව නො අසදිසානං ධම්මෙනෙව නො අධම්මෙන. ධම්මො හි වාසෙට්ඨා සෙට්ඨො ජනෙ’තස්මිං දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරාෙයච."
                    },
                    {
                        "type": "centered",
                        "text": "සුද්දමණ්ඩලං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "15. තෙසඤ්ඤෙව ඛො වාසෙට්ඨා සත්තානං යෙ තෙ සත්තා අවසෙසා තෙ ළුද්දාචාරා{2} ඛුද්දාචාරා අහෙසුං. ළුද්දාචාරා ඛුද්දාචාරාති ඛො වාසෙට්ඨා සුද්දා සුද්දාත්වෙව අක්ඛරං උපනිබ්බත්තං. ඉති ඛො වාසෙට්ඨා එවමෙතස්ස සුද්දමණ්ඩලස්ස පොරාණෙන අග්ගඤ්ඤෙන අක්ඛරෙන අභිනිබ්බත්ති අහොසි. තෙසඤ්ඤෙව සත්තානං අනඤ්ඤෙසං, සදිසානඤ්ඤෙව නො අසදිසානං, ධම්මෙනෙව නො අධම්මෙන. ධම්මො හි වාසෙට්ඨා සෙට්ඨො ජනෙ’තස්මිං දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරාෙයච."
                    },
                    {
                        "type": "paragraph",
                        "text": "16. අහු ඛො සො වාසෙට්ඨා සමයො යං ඛත්තියො පි සකං ධම්මං ගරහමානො අගාරස්මා අනගාරියං පබ්බජති, ‘සමණො භවිස්සාමී’ති. බ්රාහ්මණොපි ඛො වාසෙට්ඨා සකං ධම්මං ගරහමානො අගාරස්මා අනගාරියං පබ්බජති, ‘සමණො භවිස්සාමී’ති, වෙස්සොපි ඛො වාසෙට්ඨා සකං ධම්මං ගරහමානො අගාරස්මා අනගාරියං පබ්බජති, ‘සමණො භවිස්සාමී’ති, සුද්දොපි ඛො වාසෙට්ඨා සකං ධම්මං ගරහමානො අගාරස්මා අනගාරියං පබ්බජති ‘සමණො භවිස්සාමී’ති. ඉමෙහි ඛො වාසෙට්ඨා චතූහි මණ්ඩලෙහි සමණමණ්ඩලස්ස අභිනිබ්බත්ති අහොසි, තෙසඤ්ඤෙව සත්තානං අනඤ්ඤෙසං, සදිසානඤ්ඤෙව නො අසදිසානං, ධම්මෙනෙව නො අධම්මෙන. ධම්මො හි වාසෙට්ඨා සෙට්ඨො ජනෙ’තස්මිං දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරාෙයච."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. විසසුතකම්මත්තො - PTS. විසුං කම්මන්තෙ - (සීමු.)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. ලුද්දාචාරා - (සී.)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "වාශිෂ්ඨයෙනි, එ සමයෙහි යම් ඒ අධ්‍යායකත්වය (ධ්‍යාන නො කරන බව) පහත් යැ යි සම්මත වී ද, එය දැන් උසස් යැ යි සම්මත ය. වාශිෂ්ඨයිනි, මෙසේ පැරැණි අග්‍ර යැ යි ගන්නා ලද නම්වහරින් ඒ බ්‍රාහ්මණ මණ්ඪලයාගේ නිපැත්ම විය. එ ද ඒ සත්වයනට ම ය. අන් සත්ව කෙනෙකුට නො වේ. සමාන සත්වයනට මය, අසමාන සත්වයනට නො වේ. ධර්‍මයෙන් ම ය, අධර්‍මයෙන් නො වේ. වාශිෂ්ඨයෙනි, ධර්‍මය ම මෙලොවහි ද පරලොව්හි ද මේ ජනයා කෙරෙහි උසස් ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "14. වාශිෂ්ඨයෙනි, ඒ සතුන් අතුරෙහි ම ඇතැම් කෙනෙක් මෛථූන ධර්‍ම සේවනය කොට ඒ ඒ අවස්ථාහි නැඟුණු (හෝ ප්‍රකට වූ) ගවපාලනාදි කර්‍මාන්තයන් කළහ. මෛථුනධර්‍ම ගෙන ඒ ඒ අවස්ථාහි නැඟුණු හෝ ප්‍රකට කර්‍මාන්ත කෙරෙත් නු යි ‘වෛශ්‍යයෝ ය, වෛශ්‍යයෝ යැ’ යි ම නම් වහර උපන. වාශිෂ්ඨයිනි, මෙසේ ම පැරැණි වූ. අග්‍ර යැ යි දන්නා ලද නම් වහරින් වෛශ්‍යමණඩලායාගේ ආරම්භය විය. එ ද ඒ සතුන් පිළිබඳ ව ම ය. අන් සත් කෙනකු පිළිබඳ ව නො වේ. සමානයන් පිළිබඳ ව ම ය. අසමානයන් පිළිබඳ ව නො වේ. ධර්‍මයෙන් ම ය, අධර්‍මයෙන් නො වේ. වාශිෂ්ඨයෙනි, ධර්‍මය ම මේ ජනයා කෙරෙහි මෙ ලොව්හි ද පර ලොව්හි ද ශ්‍රේෂ්ඨ ය."
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "15. වාශිෂ්ඨයෙනි, ඒ සත්වයන් අතුරෙහි ම යම් කෙනෙක් රෞද්‍රාචාර ක්ෂුද්‍රාචාර ඇත්තෝ වූහු ද, මොහු රෞද්‍රාචාර ඇත්තාහ, ක්ෂුද්‍රාචාර ඇත්තාහ යි කියා ම, ඔවුනට ‘ශුද්‍රයෝය ශුද්‍රයෝ යැ’ යි ම නම්වහර උපන. වාශිෂ්ඨයෙනි, මෙසේ අග්‍රයැ යි දන්නා ලද පැරැණි නම් වහරින් මේ ශුද්‍රගණයාගේ ආරම්භය විය. එ ද ඒ සත්වයන් පිළිබඳ ව ම ය, අන් සත්ව කෙනෙකු පිළිබඳ ව නො වේ. සමානයන් පිළිබඳ ව ම ය, අසමානයන් පිළිබඳ ව නො වේ. ධර්‍මයෙන් ම ය, අධර්‍මයෙන් නො වේ. වාශිෂ්ඨයෙනි, එහෙයින් මෙලෝහි ද පරලෝහි ද ධර්‍මය ම මේ ජනයා කෙරෙහි ශ්‍රේෂ්ඨ ය."
                    },
                    {
                        "format": 13,
                        "text": "16. වාශිෂ්ඨයෙනි, යම් හෙයෙකින් ක්ෂත්‍රියයාත් සිය දහමට ගරහනුයේ මහණ වන්නෙමි යි ගිහිගෙන් නික්ම පැවිදි බිම් වදනේ ද, බ්‍රාහ්මණයාත් සිය දහමට ගරහනුයේ මහණ වන්නෙමි යි ගිහි ගෙන් නිකමැ පැවිදිබිම් වදනේ ද, වෛශ්‍යයාත් සිය දහමට ගරහමින් ගිහි ගෙන් නික්ම පැවිදිබිම් වදනේ ද, ශුද්‍රයාත් සිය දහමට ගරහනුයේ මහණ වන්නෙමි යි පැවිදි බිම් වදනේ ද, එසේ වූ කාලයෙක් විය. (එ කල්හි) මේ සතර මණ්ඩලයන්ගෙන් ම ශ්‍රමණමණ්ඩලයාගේ ආරම්භය විය. එ ද ඒ සත්වයන් පිළිබඳ ම ය, අන් සත්ව කෙනෙකු පිළිබඳ නො වේ. සමානයන් පිළිබඳ වැ ම ය, අසමානයන් පිළිබඳ වැ නො වේ. ධර්‍මයෙන් ම ය. අධර්‍මයෙන් නො වේ. වාශිෂ්ඨයෙනි, එහෙයින් මෙ ලොව්හි ද පර ලොව් හි ද ධර්‍මය ම ජනයා කෙරෙහි ශ්‍රේෂ්ඨ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 162,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "දුච්චරිතාදිකථා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඛත්තියොපි ඛො වාසෙට්ඨා කායෙන දුච්චරිතං චරිත්වා, වාචාය දුච්චරිතං චරිත්වා, මනසා දුච්චරිතං චරිත්වා, මිච්ඡාදිට්ඨිකො, මිච්ඡාදිට්ඨිකම්මසමාදානො මිච්ඡාදිට්ඨිකම්මසමාදානහෙතු කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජති. බ්රාහ්මණො පි ඛො වාසෙට්ඨා -පෙ- වෙස්සො පි ඛො වාසෙට්ඨා -පෙ- සුද්දොපි ඛො වාසෙට්ඨා -පෙ- සමණොපි ඛො වාසෙට්ඨා කායෙන දුච්චරිතං චරිත්වා, වාචාය දුච්චරිතං චරිත්වා, මනසා දුච්චරිතං චරිත්වා, මිච්ඡාදිට්ඨිකො මිච්ඡාදිට්ඨිකම්මසමාදානො මිච්ඡාදිට්ඨිකම්මසමාදානහෙතු කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඛත්තියොපි ඛො වාසෙට්ඨා කායෙන සුචරිතං චරිත්වා, වාචාය සුචරිතං චරිත්වා, මනසා සුචරිතං චරිත්වා, සම්මාදිට්ඨිකො සම්මාදිට්ඨිකම්මසමාදානො සම්මාදිට්ඨිකම්මසමාදානහෙතු කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති. බ්රාහ්මණොපි ඛො වාසෙට්ඨා -පෙ- වෙස්සොපි ඛො වාසෙට්ඨා -පෙ- සුද්දොපි ඛො වාසෙට්ඨා -පෙ- සමණොපි ඛො වාසෙට්ඨා කායෙන සුචරිතං චරිත්වා -පෙ- සග්ගං ලොකං උපපජ්ජති. ඛත්තියො පි ඛො වාසෙට්ඨා කායෙන ද්වයකාරී, වාචාය ද්වයකාරී, මනසා ද්වයකාරී, විමිස්සදිට්ඨිකො විමිස්සදිට්ඨිකම්මසමාදානො විමිස්සදිට්ඨිකම්මසමාදානහෙතු කායස්ස භෙදා පරම්මරණා සුඛදුක්ඛපටිසංවෙදී{1} හොති. බ්රාහ්මණොපි ඛො වාසෙට්ඨා -පෙ- වෙස්සොපි ඛො වාසෙට්ඨා -පෙ- සුද්දොපි ඛො වාසෙට්ඨා -පෙ- සමණොපි ඛො වාසෙට්ඨා කායෙන ද්වයකාරී, වාචාය ද්වයකාරී, මනසා ද්වයකාරී, විමිස්සදිට්ඨිකො විමිස්සදිට්ඨිකම්මසමාදානො විමිස්සදිට්ඨිකම්මසමාදානහෙතු කායස්ස භෙදා පරම්මරණා සුඛදුක්ඛප්පටිසංවෙදී හොති."
                    },
                    {
                        "type": "centered",
                        "text": "බොධිපක්ඛියභාවනා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "16. ඛත්තියොපි ඛො වාසෙට්ඨා කායෙන සංවුතො, වාචාය සංවුතො, මනසා සංවුතො, සත්තන්නං බොධිපක්ඛියානං ධම්මානං භාවනමන්වාය දිට්ඨෙව ධම්මෙ පරිනිබ්බාති{2}."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සුඛදුක්ඛප්පටිසංවෙදී - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. පරිනිබ්බායති - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 15,
                        "text": "දුශ්චරිතාදිකථා",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "වාශිෂ්ඨයෙනි, ක්ෂත්‍රියයා ද කයින් දුසිරිත් කොට, වචනයෙන් දුසිරිත් කොට, මනසින් දුසිරිත් කොට, මිසදිටු වැ, මිථ්‍යාදෘෂ්ටිකර්‍මසමාදාන ඇති වැ, මිථ්‍යාදෘෂ්ටිකර්‍මසමාදාන හේතුයෙන් කාබුන් මරණින් මතු, සැප නැති දුකට ස්ථාන වු, විවස ව පතිත වන තැන වූ නිරයට පැමීණෙයි. වාශිෂ්ඨයෙනි, බ්‍රාහ්මණයා ද ... වෛශ්‍යයා ද … ශුද්‍රයා ද … ශ්‍රමණයා ද කයින් දුසිරිත් කොට, වචනයෙන් දුසිරිත් කොට, සිතින් දුසිරිත් කොට, මිථ්‍යාදෘෂ්ටික වැ මිථ්‍යාදෘෂ්ටි කර්‍මසමාදාන ඇති වැ මිථ්‍යාදෘෂ්ටිකර්‍මසමාදාන හේතුයෙන් කාබන් මරණින් මතු, සැප නැති, දුකට තැන් වූ, විවස වැ පතිත වන තැන වූ නිරයට පැමිණෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "වාශිෂ්ඨයෙනි, ක්ෂත්‍රියයා ද කයින් සුසිරි පුරා, වචනයෙන් සුසිරි පුරා, සම්‍යග්දෘෂ්ටිකර්‍මසමාදාන ඇති වැ සිතින් සුසිරි පුරා, සම්‍යග්දෘෂ්ටික වැ සම්‍යග්දෘෂ්ටිකර්‍මසමාදාන හේතුයෙන් කාබුන් මරණින් මතු, මනා ගති ඇති සග ලොවට පැමිණෙයි. වාශිෂ්ඨයෙනි, බ්‍රාහ්මණයා ද … වෛශ්‍යයා ද … ශුද්‍රයා ද … ශ්‍රමණයා ද කයින් සුසිරි පුරා … සග ලොවට යෙයි. වාශිෂ්ඨයෙනි, ක්ෂත්‍රියයා ද (විටෙක් කුසල් ද විටෙක අකුසල් දැයි) කුශලාකුශල දෙක ම කරන සුලු වූයේ, වචනයෙන් කුශලාකුශල දෙක ම කරන සුලු වූයේ, සිතින් කුසලාකුශල දෙක ම කරන සුලු වූයේ, (විටෙක සම්‍යග්දෘෂ්ටික ද විටෙක මිථ්‍යාදෘෂ්ටික දැ යි) මිශ්‍ර දෘෂ්ටි ඇතියේ, මිශ්‍රදෘෂ්ටික සර්‍මසමාදාන ඇතියේ, මිශ්‍රදෘෂ්ටික කර්‍මසමාදාන හේතුයෙන් කාබුන් මරණින් මතු සුව දුක් විඳුනේ වෙයි. වාශිෂ්ඨයෙනි, බ්‍රාහ්මණයා ද … වෛශ්‍යයා ද … ශුද්‍රයා ද … ශ්‍රමණයා ද කයින් කුසල් අකුසල් දෙක ම කරන සුලු වූයේ, … වචනයෙන් කුසල් අකුසල් දෙක ම කරන සුලු වූයේ, … මනසින් කුසල් අකුසල් දෙක ම කරන සුලු වූයේ, මිශ්‍ර දෘෂ්ටි ඇතියේ, මිශ්‍රදෘෂ්ටික කර්‍මසමාදාන ඇත්තේ, මිශ්‍රදෘෂ්ටිකකර්‍මසමාදාන හේතුයෙන් කාබුන් මරණින් මතු සුව දුක විඳුනේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "16. වාශිෂ්ඨයෙනි, ක්ෂත්‍රියයා ද කයින් සංවෘත වූයේ (හැවුරුණේ), වචනයෙන් හැවුරුණේ, සිතින් හැවුරුණේ, සත් කොටසකට අයත් වූ (සත්තිස්) බොධිපාක්ෂික ධර්‍මයන් වැඩීමට බැස, මෙ අත්බව්හි ම (කෙලෙස් පිරිනිවනින්) පිරිනිවෙයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 164,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "බ්රාහ්මණො පි ඛො වාසෙට්ඨා, වෙස්සොපි ඛො වාසෙට්ඨා, සුද්දොපි ඛො වාසෙට්ඨා, සමණො පි ඛො වාසෙට්ඨා කායෙන සංවුතො, වාචාය සංවුතො, මනසා සංවුතො, සත්තන්නං බොධිපක්ඛියානං ධම්මානං භාවනමන්වාය දිට්ඨෙව ධම්මෙ පරිනිබ්බාති. ඉමෙසං හි වාසෙට්ඨා චතුන්නං වණ්ණානං යො හොති භික්ඛු අරහං ඛීණාසවො වුසිතවා කතකරණීයො ඔහිතභාරො අනුප්පත්තසදත්ථො පරික්ඛීණභවසඤ්ඤොජනො සම්මදඤ්ඤාවිමුත්තො, සො නෙසං අග්ගමක්ඛායති. ධම්මෙනෙව නො අධම්මෙන. ධම්මො හි වාසෙට්ඨා සෙට්ඨො ජනෙ’තස්මිං දිට්ඨෙ චෙව ධම්මෙ අභිසම්පරාෙයච. බ්රහ්මුනා පි වාසෙට්ඨා සනඞ්කුමාරෙන ගාථා භාසිතා:"
                    },
                    {
                        "type": "gatha",
                        "text": "17. “ඛත්තියො සෙට්ඨො ජනෙ’තස්මිං යෙ ගොත්තපටිසාරිනො,{1}\nවිජ්ජාචරණසම්පන්නො සො සෙට්ඨො දෙවමානුසෙ”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සා ඛො පනෙසා වාසෙට්ඨා ගාථා බ්රහ්මුනා සනඞ්කුමාරෙන සුගීතා නො දුග්ගීතා, සුභාසිතා නො දුබ්භාසිතා, අත්ථසංහිතා{2} නො අනත්ථසංහිතා, අනුමතා මයා, අහම්පි වාසෙට්ඨා එවං වදාමි:"
                    },
                    {
                        "type": "gatha",
                        "text": "“ඛත්තියො සෙට්ඨො ජනෙ’තස්මිං යෙ ගොත්තපටිසාරිනො, විජ්ජාචරණසම්පණ්ණො, සො සෙට්ඨො දෙවමානුසෙ”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදමවොච භගවා. අත්තමනා වාසෙට්ඨාභාරද්වාජා භගවතො භාසිතං අභිනන්දුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "අග්ගඤ්ඤසුත්තං නිට්ඨිතං චතුත්ථං.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පටිසාරිණො - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අත්ථසඤ්හිතා"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "වාශිෂ්ඨයෙනි, මේ සතර වර්‍ණයන්ගෙන් (කවර වර්‍ණයෙකට අයත් වූව ද) රහත් වූ, නැසූ ආශ්‍රව ඇති, වැස අවසන් කළ මඟබඹසර ඇති, සිවුමඟින් කළයුතු කෘත්‍ය කොට නිමැවූ, බහා තැබූ ස්කන්ධභාරය ඇති, මඟ පිළිවෙළින් පැමිණි ස්වාර්‍ථය (රහත් බව) ඇති හැම ලෙසින් ම ක්ෂයයට පැමිණැවූ බවබැඳුම් ඇති මොනොවට (මනා ව නුවණින්) දැන කෙලෙසුන්ගෙන් මිදුණූ මහණෙක් වේ ද, හෙ තෙමේ ඒ හැම දෙනාට ම අග්‍ර යැ යි කියනු ලැබේ. ඒ ද ධර්‍මයෙන් ම ය. අධර්‍මයෙන් නො වේ. වාශිෂ්ඨයෙනි, එහෙයින් ධර්‍මය මෙ ලොව්හි ද පරලොව්හි ද මේ ජනයා කෙරෙහි ශ්‍රේෂ්ඨ වෙයි. වාශිෂ්ඨයෙනි, සනත්කුමාර බ්‍රහ්මයා විසින් ද කියන ලද ගාථාවෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "17. “යම් කෙනෙක් සිය ගෝත්‍රය සිහිකරන්නෝ ඇත් ද, ඒ ජනයා අතුරෙහි ක්ෂත්‍රියයා ශ්‍රේෂ්ඨ ය. යමෙක් විද්‍යායෙනුත් චරණධර්මයෙනුත් යුක්ත ද ඒ සම්‍යක් සම්බුද්ධ තෙමේ දෙවිමිනිසුන් අතුරෙහි ශ්‍රේෂ්ඨ ය”. ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "වාශිෂ්ඨයෙනි, ඒ ගාථාව වූ කලි සනත්කුමාර බඹුහු විසින් මොනොවට ගයන ලදී. නොමනා කොට ගයන ලද්දේ නො වෙයි. මොනොවට කියන ලද්දේ වෙයි. නොමනා කොට කියන ලද්දෙක් නොවෙයි. අර්ථ නිඃශ්‍රිතය. අනර්ථනිඃශ්‍රිත නො වේ. මා විසින් ද අනුමත වෙයි. වාශිෂ්ඨයෙනි, මමත් මෙසේ කියමි:"
                    },
                    {
                        "format": 13,
                        "text": "“යම් කෙනෙක් සිය ගෝත්‍ර සිහිකරන්නෝ ඇත් ද, ඒ ඒ ජනයා අතුරෙහි ක්ෂත්‍රියයා ශ්‍රේෂ්ඨ ය. යමෙක් විද්‍යායෙනුත් චරණධර්මයෙනුත් යුක්ත ද ඒ සම්‍යක් සම්බුද්ධ තෙමේ දෙවිමිනිසුන් අතුරෙහි ශ්‍රේෂ්ඨ ය”.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙ වදාළ සේක. වාශිෂ්ඨ භාරද්වාජ දෙදනා සතුටු සිතැත්තාහු භාග්‍යවතුන් වහන්සේගේ වචනය ආදරෙයන් පිළිගත්හ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 16,
                        "text": "සතරවන අග්ගඤ්ඤ සූත්‍රය නිමියේ යැ.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ]
}