[
    {
        "filename": "dn-ptkv-3",
        "bookId": 12,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "96"
            },
            {
                "type": "centered",
                "text": "3",
                "level": 3
            },
            {
                "type": "heading",
                "text": "චක්කවත්තිසුත්තං",
                "level": 3
            },
            {
                "type": "paragraph",
                "text": "1. එවං මෙ සුතං: එකං සමයං භගවා මගධෙසු විහරති මාතුලායං. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි භික්ඛවො’ති. ‘භදන්තෙ’ති තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "අත්තදීපා භික්ඛවෙ විහරථ අත්තසරණා අනඤ්ඤසරණා, ධම්මදීපා ධම්මසරණා අනඤ්ඤසරණා. කථඤ්ච පන භික්ඛවෙ භික්ඛු අත්තදීපො විහරති අත්තසරණො අනඤ්ඤසරණො, ධම්මදීපො ධම්මසරණො අනඤ්ඤසරණො?"
            },
            {
                "type": "paragraph",
                "text": "ඉධ භික්ඛවෙ භික්ඛු කායෙ කායානුපස්සී විහරති, ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු වෙදනානුපස්සී -පෙ- චිත්තෙ චිත්තානුපස්සී, -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. එවං ඛො භික්ඛවෙ භික්ඛු අත්තදීපො විහරති අත්තසරණො අනඤ්ඤසරණො, ධම්මදීපො ධම්මසරණො අනඤ්ඤසරණො."
            },
            {
                "type": "paragraph",
                "text": "ගොචරෙ භික්ඛවෙ චරථ සකෙ පෙත්තිකෙ විසයෙ. ගොචරෙ භික්ඛවෙ චරතං සකෙ පෙත්තිකෙ විසයෙ න ලච්ඡති මාරො ඔතාරං, න ලච්ඡති මාරො ආරම්මණං. කුසලානං භික්ඛවෙ ධම්මානං සමාදානහෙතු එවමිදං පුඤ්ඤං පවඩ්ඪති."
            },
            {
                "type": "page-break",
                "text": "98"
            },
            {
                "type": "paragraph",
                "text": "2. භූතපුබ්බං භික්ඛවෙ රාජා දළ්හනෙමි නාම අහොසි චක්කවත්තී ධම්මිකො රාජා චාතුරන්තො විජිතාවී ජනපදත්ථාවරියප්පත්තො සත්තරතනසමන්නාගතො. තස්සිමානි සත්තරතනානි අහෙසුං, සෙය්යථිදං: චක්කරතනං හත්ථිරතනං අස්සරතනං මණිරතනං ඉත්ථිරතනං ගහපතිරතනං පරිණායකරතනමෙව සත්තමං. පරොසහස්සං ඛො පනස්ස පුත්තා අහෙසුං සූරා වීරඞ්ගරූපා පරසෙනප්පමද්දනා. සො ඉමං පඨවිං සාගරපරියන්තං අදණ්ඩෙන අසත්ථෙන ධම්මෙන{1 ධම්මෙන සමෙන - ස්යා. කම්.} අභිවිජිය අජ්ඣාවසි. අථ ඛො භික්ඛවෙ රාජා දළ්හනෙමි බහුන්නං වස්සානං බහුන්නං වස්සසතානං බහුන්නං වස්සසහස්සානං අච්චයෙන අඤ්ඤතරං පුරිසං ආමන්තෙසි: “යදා ත්වං අම්භො පුරිස පස්සෙය්යාසි දිබ්බං චක්කරතනං ඔසක්කිතං, ඨානා චුතං, අථ මෙ ආරොචෙය්යාසී”ති. ‘එවං දෙවා’ති ඛො භික්ඛවෙ සො පුරිසො රඤ්ඤො දළ්හනෙමිස්ස පච්චස්සොසි. අද්දසා ඛො භික්ඛවෙ සො පුරිසො බහුන්නං වස්සානං බහුන්නං වස්සසතානං බහුන්නං වස්සසහස්සානං අච්චයෙන දිබ්බං චක්කරතනං ඔසක්කිතං ඨානා චුතං. දිස්වාන යෙන රාජා දළ්හනෙමි තෙනුපසඞ්කමි, උපසඞ්කමිත්වා රාජානං දළ්හනෙමිං එතදවොච: යග්ඝෙ දෙව ජානෙය්යාසි දිබ්බං තෙ චක්කරතනං ඔසක්කිතං ඨානා චුතන්ති."
            },
            {
                "type": "paragraph",
                "text": "3. අථ ඛො භික්ඛවෙ රාජා දළ්හනෙමි ජෙට්ඨපුත්තං කුමාරං ආමන්තෙත්වා{2 ආමන්තාපෙත්වා - මඡසං.} එතදවොච: දිබ්බං කිර මෙ තාත කුමාර චක්කරතනං ඔසක්කිතං ඨානා චුතං. සුතං ඛො පන මෙතං ‘යස්ස රඤ්ඤො චක්කවත්තිස්ස දිබ්බං චක්කරතනං ඔසක්කති, ඨානා චවති, න’දානි තෙන රඤ්ඤා චිරං ජීවිතබ්බං හොතී’ති. භුත්තා ඛො පන මෙ මානුසිකා කාමා, සමයො’දානි මෙ දිබ්බෙ කාමෙ පරියෙසිතුං. එහි ත්වං තාත කුමාර ඉමං සමුද්දපරියන්තං පඨවිං පටිපජ්ජ. අහං පන කෙසමස්සුං ඔහාරෙත්වා, කාසායානි වත්ථානි අච්ඡාදෙත්වා, අගාරස්මා අනගාරියං පබ්බජිස්සාමී”ති. අථ ඛො භික්ඛවෙ රාජා දළ්හනෙමි ජෙට්ඨපුත්තං කුමාරං සාධුකං රජ්ජෙ සමනුසාසිත්වා, කෙසමස්සුං ඔහාරෙත්වා, කාසායානි වත්ථානි අච්ඡාදෙත්වා, අගාරස්මා අනගාරියං පබ්බජි."
            },
            {
                "type": "page-break",
                "text": "100"
            },
            {
                "type": "paragraph",
                "text": "සත්තාහපබ්බජිතෙ ඛො පන භික්ඛවෙ රාජිසිම්හි දිබ්බං චක්කරතනං අන්තරධායි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භික්ඛවෙ අඤ්ඤතරො පුරිසො යෙන රාජා ඛත්තියො මුද්ධාභිසිත්තො{1 මුද්ධාවසිත්තො - ස්යා. PTS.} තෙනුපසඞ්කමි. උපසඞ්කමිත්වා රාජානං ඛත්තියං මුද්ධාභිසිත්තං එතදවොච: යග්ඝෙ දෙව ජානෙය්යාසි දිබ්බං චක්කරතනං අන්තරහිතන්ති. අථ ඛො භික්ඛවෙ රාජා ඛත්තියො මුද්ධාභිසිත්තො දිබ්බෙ චක්කරතනෙ අන්තරහිතෙ අනත්තමනො අහොසි. අනත්තමනතඤ්ච පටිසංවෙදෙසි. සො යෙන රාජිසි තෙනුපසඞ්කමි. උපසඞ්කමිත්වා රාජිසිං එතදවොච: යග්ඝෙ දෙව ජානෙය්යාසි දිබ්බං චක්කරතනං අන්තරහිතන්ති. එවං වුත්තෙ භික්ඛවෙ රාජිසි රාජානං ඛත්තියං මුද්ධාභිසිත්තං එතදවොච: ‘මා ඛො ත්වං තාත දිබ්බෙ චක්කරතනෙ අන්තරහිතෙ අනත්තමනො අහොසි, මා අනත්තමනතඤ්ච පටිසංවෙදෙසි න හි තෙ තාත දිබ්බං චක්කරතනං පෙත්තිකං දායජ්ජං. ඉඞ්ඝ ත්වං තාත අරියෙ චක්කවත්තිවත්තෙ වත්තාහි. ඨානං ඛො පනෙතං විජ්ජති යන්තෙ අරියෙ චක්කවත්තිවත්තෙ වත්තමානස්ස තදහුපොසථෙ පණ්ණරසෙ සීසං න්හාතස්ස{2 සීසං න්හාතස්ස - PTS. සීසන්හානස්ස - ස්යා.} උපොසථිකස්ස උපරිපාසාදවරගතස්ස දිබ්බං චක්කරතනං පාතු භවිස්සති සහස්සාරං සනෙමිකං සනාභිකං සබ්බාකාරපරිපූර”න්ති."
            },
            {
                "type": "paragraph",
                "text": "4. “කතමං පන තං දෙව අරියං චක්කවත්තිවත්තන්ති”?"
            },
            {
                "type": "paragraph",
                "text": "“තෙන හි ත්වං තාත ධම්මං යෙව නිස්සාය ධම්මං සක්කරොන්තො ධම්මං ගරුකරොන්තො{3 ගරුං කරොන්තො - මඡසං.} ධම්මං මානෙන්තො ධම්මං පූජෙන්තො ධම්මං අපචායමානො, ධම්මද්ධජො ධම්මකේතු ධම්මාධිපතෙෙය්යා ධම්මිකං රක්ඛාවරණගුත්තිං සංවිදහස්සු අන්තොජනස්මිං."
            },
            {
                "type": "paragraph",
                "text": "ධම්මං යෙව නිස්සාය -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "බලකායස්මිං ධම්මං යෙව නිස්සාය ඛත්තියෙසු අනනුස්සුතෙසු{4 අනනුස්සුතෙසු - මඡසං.}."
            },
            {
                "type": "page-break",
                "text": "102"
            },
            {
                "type": "paragraph",
                "text": "ධම්මංයෙව නිස්සාය -පෙ- බ්රාහ්මණගහපතිකෙසු,"
            },
            {
                "type": "paragraph",
                "text": "ධම්මංයෙව නිස්සාය -පෙ- නෙගමජානපදෙසු,"
            },
            {
                "type": "paragraph",
                "text": "ධම්මංයෙව නිස්සාය සමණබ්රාහ්මණෙසු,"
            },
            {
                "type": "paragraph",
                "text": "ධම්මංයෙව නිස්සාය -පෙ- මිගපක්ඛීසු."
            },
            {
                "type": "paragraph",
                "text": "මා ච තෙ තාත විජිතෙ අධම්මකාරො පවත්තිත්ථ."
            },
            {
                "type": "paragraph",
                "text": "යෙ ච තෙ තාත විජිතෙ අධනා අස්සු, තෙසඤ්ච ධනමනුප්පදෙය්යාසි{1 ධනමනුප්පදජ්ජය්යොසි - කම්.}"
            },
            {
                "type": "paragraph",
                "text": "යෙ ච තෙ තාත විජිතෙ සමණබ්රාහ්මණා මදප්පමාදා පටිවිරතා ඛන්තිසොරච්චෙ නිවිට්ඨා එකමත්තානං දමෙන්ති, එකමත්තානං සමෙන්ති, එකමත්තානං පරිනිබ්බාපෙන්ති. තෙ කාලෙන කාලං උපසඞ්කමිත්වා පරිපුච්ඡෙය්යාසි පරිඤ්හෙය්යාසි: කිං භන්තෙ කුසලං, කිං අකුසලං, කිං සාවජ්ජං කිං අනවජ්ජං, කිං සෙවිතබ්බං කිං න සෙවිතබ්බං, කිං මෙ කරීයමානං දීඝරත්තං අහිතාය දුක්ඛාය අස්ස, කිං වා පන මෙ කරීයමානං දීඝරත්තං හිතාය සුඛාය අස්සා?”ති. තෙසං සුත්වා යං අකුසලං තං අභිනිවජ්ජෙය්යාසි, යං කුසලං තං සමාදාය වත්තෙය්යාසි."
            },
            {
                "type": "paragraph",
                "text": "ඉදං ඛො තාත අරියං චක්කවත්තිවත්ත”න්ති."
            },
            {
                "type": "paragraph",
                "text": "“එවං දෙවා”ති ඛො භික්ඛවෙ රාජා ඛත්තියො මුද්ධාභිසිත්තො රාජිසිස්ස පටිස්සුත්වා අරියෙ චක්කවත්තිවත්තෙ{2 අරියං චක්කවත්තිවත්තං - කම්.} වත්ති. තස්ස අරියෙ චක්කවත්තිවත්තෙ වත්තමානස්ස තදහුපොසථෙ පණ්ණරසෙ සීසං න්හාතස්ස උපොසථිකස්ස උපරිපාසාදවරගතස්ස දිබ්බං චක්කරතනං පාතුරහොසි සහස්සාරං සනෙමිකං සනාභිකං සබ්බාකාරපරිපූරං."
            },
            {
                "type": "paragraph",
                "text": " දිස්වාන රඤ්ඤො ඛත්තියස්ස මුද්ධාභිසිත්තස්ස එතදහොසි: සුතං ඛො පන මෙතං යස්ස රඤ්ඤො ඛත්තියස්ස මුද්ධාභිසිත්තස්ස තදහුපොසථෙ පන්නරසෙ සීසං න්හාතස්ස උපොසථිකස්ස උපරිපාසාදවරගතස්ස දිබ්බං චක්කරතනං පාතුභවති. සහස්සාරං සනෙමිකං සනාභිකං සබ්බාකාරපරිපූරං, සො හොති රාජා චක්කවත්තීති. අස්සං නු ඛො අහං රාජා චක්කවත්තී”ති."
            },
            {
                "type": "page-break",
                "text": "104"
            },
            {
                "type": "paragraph",
                "text": "5. අථ ඛො භික්ඛවෙ රාජා ඛත්තියො මුද්ධාභිසිත්තො උට්ඨායාසනා, එකංසං උතරාසඞ්ගං කරිත්වා වාමෙන හත්ථෙන භිඞ්කාරං ගහෙත්වා දක්ඛිණෙන හත්ථෙන චක්කරතනං අබ්භුක්කිරි, ‘පවත්තතු භවං චක්කරතනං, අභිවිජිනාතු භවං චක්කරතන’න්ති. අථ ඛො තං භික්ඛවෙ චක්කරතනං පුරත්ථිමං දිසං පවත්ති, අන්වදෙව රාජා චක්කවත්තී සද්ධිං චතුරඞ්ගිනියා සෙනාය. යස්මිං ඛො පන භික්ඛවෙ පදෙසෙ චක්කරතනං පතිට්ඨාසි, තත්ථ රාජා චක්කවත්තී වාසං උපගඤ්ඡි සද්ධිං චතුරඞ්ගිනියා සෙනාය. යෙ ඛො පන භික්ඛවෙ පුරත්ථිමාය දිසාය පටිරාජානො, තෙ රාජානං චක්කවත්තිං උපසඞ්කමිත්වා එවමාහංසු: එහි ඛො මහාරාජ, ස්වාගතං තෙ මහාරාජ, සකන්තෙ මහාරාජ, අනුසාස මහාරාජා’ති."
            },
            {
                "type": "paragraph",
                "text": "රාජා චක්කවත්තී එවමාහ:"
            },
            {
                "type": "paragraph",
                "text": "පාණො නහන්තබ්බො. අදින්නං නාදාතබ්බං කාමෙසුමිච්ඡා න චරිතබ්බා. මුසා න භාසිතබ්බා. මජ්ජං න පාතබ්බං. යථාභුත්තඤ්ච භුඤ්ජථා’ති."
            },
            {
                "type": "paragraph",
                "text": "යෙ ඛො පන භික්ඛවෙ පුරත්ථිමාය දිසාය පටිරාජානො තෙ රඤ්ඤො චක්කවත්තිස්ස අනුයුත්තා{1 අනුයන්තා - සීමු.} අහෙසුං."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො තං භික්ඛවෙ චක්කරතනං පුරත්ථිමං සමුද්දං අජ්ඣොගාහිත්වා පච්චුත්තරිත්වා දක්ඛිණං දිසං පවත්ති -පෙ- අනුයුත්තා අහෙසුං."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො තං භික්ඛවෙ චක්කරතනං දක්ඛිණං සමුද්දං අජ්ඣොගාහිත්වා පච්චුත්තරිත්වා පච්ඡිමං දිසං පවත්ති, අන්වදෙව රාජා චක්කවත්තී සද්ධිං චතුරඞ්ගිනියා සෙනාය. යස්මිං ඛො පන භික්ඛවෙ පදෙසෙ දිබ්බං චක්කරතනං පතිට්ඨාසි, තත්ථ රාජා චක්කවත්තී වාසං උපගඤ්ඡි සද්ධිං චතුරඞ්ගිනියා සෙනාය. යෙ ඛො පන භික්ඛවෙ පච්ඡිමාය දිසාය පටිරාජානො, තෙ රාජානං චක්කවත්තිං උපසඞ්කමිත්වා එවමාහංසු: එහි ඛො මහාරාජ, ස්වාගතං තෙ මහාරාජ, සකන්තෙ මහාරාජ, අනුසාස මහාරාජා’ති."
            },
            {
                "type": "page-break",
                "text": "106"
            },
            {
                "type": "paragraph",
                "text": "රාජා චක්කවත්තී එවමාහ:"
            },
            {
                "type": "paragraph",
                "text": "පාණො න හන්තබ්බො, අදින්නං නාදාතබ්බං, කාමෙසු මිච්ඡා න චරිතබ්බා, මුසා න භාසිතබ්බා, මජ්ජං න පාතබ්බං, යථා භුත්තඤ්ච භුඤ්ජථා’ති. යෙ ඛො පන භික්ඛවෙ පච්ඡිමාය දිසාය පටිරාජානො, තෙ රඤ්ඤො චක්කවත්තිස්ස අනුයුත්තා{1 අනුයන්තා - මඡසං.} අහෙසුං."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො තං භික්ඛවෙ චක්කරතනං පච්ඡිමං සමුද්දං අජ්ජෙඣාගාහිත්වා පච්චුත්තරිත්වා උත්තරං දිසං පවත්ති. අන්වදෙව රාජා චක්කවත්තී සද්ධිං චතුරඞ්ගිනියා සෙනාය. යස්මිං ඛො පන භික්ඛවෙ පදෙසෙ දිබ්බං චක්කරතනං පතිට්ඨාසි, තත්ථ රාජා චක්කවත්තී වාසං උපගඤ්ඡි සද්ධිං චතුරඞ්ගිනියා සෙනාය. යෙ ඛො පන භික්ඛවෙ උත්තරාය දිසාය පටිරාජානො තෙ රාජානං චක්කවත්තිං උපසඞ්කමිත්වා එවමාහංසු: එහි ඛො මහාරාජ, ස්වාගතං{2 සාගතං - PTS.} තෙ මහාරාජ, ස කන්තෙ මහාරාජ, අනුසාස මහාරාජා’ති. රාජා චක්කවත්තී එවමාහ: පාණො න හන්තබ්බො, අදින්නං නාදාතබ්බං, කාමෙසු මිච්ඡා න චරිතබ්බා, මුසා න භාසිතබ්බා, මජ්ජං නපාතබ්බං, යථාභුත්තඤ්ච භුඤ්ජථා’ති."
            },
            {
                "type": "paragraph",
                "text": "යෙ ඛො පන භික්ඛවෙ උත්තරාය දිසාය පටිරාජානො තෙ රඤ්ඤො චක්කවත්තිස්ස අනුයුත්තා අහෙසුං."
            },
            {
                "type": "paragraph",
                "text": "6. අථ ඛො තං භික්ඛවෙ චක්කරතනං සමුද්දපරියන්තං පඨවිං{3 පඨවිං - මඡසං.} අභිවිජිනිත්වා තමෙව රාජධානිං පච්චාගන්ත්වා රඤ්ඤො චක්කවත්තිස්ස අන්තෙපුරද්වාරෙ අත්ථකරණප්පමුඛෙ{4 අට්ටකරණප්පමුඛෙ - සීමු.} අක්ඛාහතං මඤ්ඤෙ අට්ඨාසි, රඤ්ඤො චක්කවත්තිස්ස අන්තෙපුරං උපසොභයමානං. -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "දුතියො පි ඛො භික්ඛවෙ රාජා චක්කවත්තී -පෙ- තතියො පි ඛො භික්ඛවෙ රාජා චක්කවත්තී -පෙ- චතුත්ථො පි ඛො භික්ඛවෙ රාජා චක්කවත්තී -පෙ- පඤ්චමො පි ඛො භික්ඛවෙ රාජා චක්කවත්තී -පෙ- ඡට්ඨො පි ඛො භික්ඛවෙ රාජා චක්කවත්තී -පෙ- සත්තමො පි ඛො භික්ඛවෙ රාජා චක්කවත්තී බහුන්නං වස්සානං බහුන්නං වස්සසතානං බහුන්නං වස්සසහස්සානං අච්චයෙන අඤ්ඤතරං පුරිසං ආමන්තෙසි: යදා ත්වං අම්භො පුරිස පස්සෙය්යාසි දිබ්බං චක්කරතනං ඔසක්කිතං ඨානා චුතං, අථ මෙ ආරොචෙය්යාසී’ති. ‘එවං දෙවා’ති ඛො භික්ඛවෙ සො පුරිසො රඤ්ඤො චක්කවත්තිස්ස පච්චස්සොසි. අද්දසා ඛො භික්ඛවෙ සො පුරිසො බහුන්නං වස්සානං බහුන්නං වස්සසතානං බහුන්නං වස්සසහස්සානං අච්චයෙන දිබ්බං චක්කරතනං ඔසක්කිතං ඨානා චුතං. දිස්වාන යෙන රාජා චක්කවත්තී තෙනුපසඞ්කමි, උපසඞ්කමිත්වා රාජානං චක්කවත්තිං එතදවොච: යග්ඝෙ දෙව ජානෙය්යාසි දිබ්බන්තෙ චක්කරතනං ඔසක්කිතං ඨානා චුතන්ති."
            },
            {
                "type": "page-break",
                "text": "108"
            },
            {
                "type": "paragraph",
                "text": "7. අථ ඛො භික්ඛවෙ රාජා චක්කවත්තී ජෙට්ඨපුත්තං කුමාරං ආමන්තෙත්වා එතදවොච: “දිබ්බං කිර මෙ තාත කුමාර චක්කරතනං ඔසක්කිතං ඨානා චුතං. සුතං ඛො පන මෙ තං යස්ස රඤ්ඤො චක්කවත්තිස්ස දිබ්බං චක්කරතනං ඔසක්කති ඨානා චවති, න’දානි තෙන රඤ්ඤා චිරං ජීවිතබ්බං හොතී’ති. භුත්තා ඛො පන මෙ මානුසිකා කාමා, සමයො’දානි මෙ දිබ්බෙ කාමෙ පරියෙසිතුං. එහි ත්වං තාත කුමාර, ඉමං සමුද්දපරියන්තං පඨවිං පටිපජ්ජ, අහං පන කෙසමස්සුං ඔහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජිස්සාමී”ති. අථ ඛො භික්ඛවෙ රාජා චක්කවත්තී ජෙට්ඨපුත්තං කුමාරං සාධුකං රජ්ජෙ සමනුසාසිත්වා, කෙසමස්සුං ඔහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජි. සත්තාහපබ්බජිතෙ ඛො පන භික්ඛවෙ රාජිසිම්හි දිබ්බං චක්කරතනං අන්තරධායි. අථ ඛො භික්ඛවෙ අඤ්ඤතරො පුරිසො -පෙ- අන්තරහිතන්ති. අථ ඛො භික්ඛවෙ රාජා ඛත්තියො මුද්ධාභිසිත්තො දිබ්බෙ චක්කරතනෙ අන්තරහිතෙ අනත්තමනො අහොසි. අනත්තමනතඤ්ච පටිසංවෙදෙසි. නො ච ඛො රාජිසිං උපසඞ්කමිත්වා අරියං චක්කවත්තිවත්තං පුච්ඡි. සො සමතෙනෙව සුදං ජනපදං පසාසති. තස්ස සමතෙන ජනපදං පසාසතො පුබ්බෙනාපරං ජනපදා න පබ්බන්ති, යථා තං පුබ්බකානං රාජූනං අරියෙ චක්කවත්තිවත්තෙ වත්තමානානං."
            },
            {
                "type": "paragraph",
                "text": "8. අථ ඛො භික්ඛවෙ අමච්චා පාරිසජ්ජා ගණකා මහාමත්තා අනීකට්ඨා දොවාරිකා මන්තස්සාජීවිනො සන්නිපතිත්වා රාජානං ඛත්තියං මුද්ධාභිසිත්තං උපසඞ්කමිත්වා එතදවොචුං: “න ඛො තෙ දෙව සමතෙන සුදං ජනපදං පසාසතො පුබ්බෙනාපරං ජනපදා පබ්බන්ති, යථා තං පුබ්බකානං රාජූනං අරියෙ චක්කවත්තිවත්තෙ වත්තමානානං. සංවිජ්ජන්ති ඛො තෙ දෙව විජිතෙ අමච්චා පාරිසජ්ජා ගණකා මහාමත්තා අනීකට්ඨා දොවාරිකා මන්තස්සාජීවිනො, මයඤ්චෙව අඤ්ඤෙ ච, යෙ මයං අරියං චක්කවත්තිවත්තං ධාරෙම. ඉඞ්ඝ ත්වං දෙව අම්හෙ අරියං චක්කවත්තිවත්තං පුච්ඡ. තස්ස තෙ මයං අරියං චක්කවත්තිවත්තං පුට්ඨා බ්යාකරිස්සාමා”ති."
            },
            {
                "type": "centered",
                "text": "ආයුවණ්ණාදිපරිහාණිකථා",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භික්ඛවෙ රාජා ඛත්තියො මුද්ධාභිසිත්තො අමච්චෙ පාරිසජ්ජෙ ගණෙක මහාමත්තෙ අනීකට්ඨෙ දොවාරිකෙ මන්තස්සාජීවිනො සන්නිපාතාපෙත්වා අරියං චක්කවත්තිත්තං පුච්ඡි."
            },
            {
                "type": "page-break",
                "text": "110"
            },
            {
                "type": "paragraph",
                "text": "තස්ස තෙ අරියං චක්කවත්තිවත්තං පුට්ඨා බ්යාකරිංසු. තෙසං සුත්වා ධම්මිකං හි ඛො රක්ඛාවරණගුත්තිං සංවිදහි. නො ච ඛො අධනානං ධනමනුප්පාදාසි{1 ධනමනුප්පදාසි - මඡසං.}. අධනානං ධනෙ අනනුප්පදියමානෙ දාළිද්දියං{2 දලිද්දිසං - PTL දලිද්දිසං - ස්යා} වෙපුල්ලමගමාසි. දාළිද්දියෙ වෙපුල්ලං ගතෙ අඤ්ඤතරො පුරිසො පරෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියි. තමෙනං අග්ගහෙසුං ගහෙත්වා රඤ්ඤො ඛත්තියස්ස මුද්ධාභිසිත්තස්ස දස්සෙසුං අයං දෙව පුරිසො පරෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියී’ති. එවං වුත්තෙ භික්ඛවෙ රාජා ඛත්තියො මුද්ධාභිසිත්තො තං පුරිසං එතදවොච: “සච්චං කිරත්වං අම්භො පුරිස පරෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියී?{3 ආදියයී - ස්යා.}“ති. “සච්චං දෙවා”ති. “කිං කාරණා?”ති. “න හි දෙව ජීවාමී”ති."
            },
            {
                "type": "paragraph",
                "text": "9. අථ ඛො භික්ඛවෙ රාජා ඛත්තියො මුද්ධාභිසිත්තො තස්ස පුරිසස්ස ධනමනුප්පාදාසි “ඉමිනා ත්වං අම්භො පුරිස ධනෙන අත්තනා ච ජීවාහි, මාතාපිතරො ච පොසෙහි, පුත්තදාරඤ්ච පොසෙහි, කම්මන්තෙ ච පයොජෙහි, සමණබ්රාහ්මණෙසු උද්ධග්ගිකං දක්ඛිණං පතිට්ඨපෙහි{4 පතිට්ඨාපෙති - මඡසං.} සොවග්ගිකං සුඛවිපාකං සග්ගසංවත්තනිකන්ති”. “එවං දෙවා”ති ඛො භික්ඛෙව සො පුරිසො රඤ්ඤො ඛත්තියස්ස මුද්ධාභිසිත්තස්ස පච්චස්සොසි. අඤ්ඤතරො පි ඛො භික්ඛවෙ පුරිසො පරෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියි. තමෙනං අග්ගහෙසුං ගහෙත්වා රඤ්ඤො ඛත්තියස්ස මුද්ධාභිසිත්තස්ස දස්සෙසුං “අයං දෙව පුරිසො පරෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියී”ති. එවං වුත්තෙ භික්ඛවෙ රාජා ඛත්තියො මුද්ධාභිසිත්තො තං පුරිසං එතදවොච: “සච්චං කිර ත්වං අම්භො පුරිස පරෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියී”ති. “සච්චං දෙවා”ති. “කිං කාරණා?”ති. “නහි දෙව ජීවාමී”ති. අථ ඛො භික්ඛවෙ රාජා ඛත්තියො මුද්ධාභිසිත්තො තස්ස පුරිසස්ස ධනමනුප්පදාසි “ඉමිනා ත්වං අම්භො පුරිස ධනෙන අත්තනා ච ජීවාහි, මාතාපිතරො ච පොසෙහි, පුත්තදාරඤ්ච පොසෙහි, කම්මන්තෙ ච පයොජෙහි, සමණබ්රාහ්මණෙසු{5 සමණෙසු බ්රාහ්මණෙසු - බහූසු.} උද්ධග්ගිකං දක්ඛිණං පතිට්ඨපෙහි, සොවග්ගිකං සුඛවිපාකං සග්ගසංවත්තනිකන්ති’. “එවං දෙවා”ති ඛො භික්ඛවෙ සො පුරිසො රඤ්ඤො ඛත්තියස්ස මුද්ධාභිසිත්තස්ස පච්චස්සොසි."
            },
            {
                "type": "paragraph",
                "text": "අස්සොසුං ඛො භික්ඛවෙ මනුස්සා: යෙ කිර භො පරෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියන්ති, තෙසං රාජා ධනමනුප්පදෙතී{6 ධනමනුප්පදෙසී -PTS.}’ති. සුත්වාන තෙසං එතදහොසි “යන්නූන මයම්පි පරෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියෙය්යාමා”ති."
            },
            {
                "type": "page-break",
                "text": "112"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භික්ඛවෙ අඤ්ඤතරො පුරිසො පරෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියි. තමෙනං අග්ගහෙසුං ගහෙත්වා රඤ්ඤො ඛත්තියස්ස මුද්ධාභිසිත්තස්ස දස්සෙසුං “අයං දෙව පුරිසො පරෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියී”ති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ භික්ඛවෙ රාජා ඛත්තියො මුද්ධාභිසිත්තො තං පුරිසං එතදවොච: “සච්චං කිර ත්වං අම්භො පුරිස, පරෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියී”ති. “සච්චං දෙවා”ති. “කිං කාරණා?”ති. “න හි දෙව ජීවාමී”ති. අථ ඛො භික්ඛවෙ රඤ්ඤො ඛත්තියස්ස මුද්ධාභිසිත්තස්ස එතදහොසි: “සචෙ ඛො අහං යො යො පි පරෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියිස්සති, තස්ස තස්ස ධනමනුප්පදස්සාමි, එවමිදං අදින්නාදානං පවඩ්ඪිස්සති. යන්නූනාහං ඉමං පුරිසං සුනිසෙධං නිසෙධෙය්යං මූලඡෙජ්ජං{1 මූලසච්චං - මඡසං.} කරෙය්යං, සීසමස්ස ඡින්දෙය්ය”න්ති."
            },
            {
                "type": "paragraph",
                "text": "10. අථ ඛො භික්ඛවෙ රාජා ඛත්තියො මුද්ධාභිසිත්තො පුරිසෙ ආණාපෙසි: “තෙන හි භණෙ ඉමං පුරිසං දළ්හාය රජ්ජුයා පච්ඡාබාහං ගාළ්හබන්ධනං බන්ධිත්වා ඛුරමුණ්ඩං කරිත්වා, ඛරස්සරෙන පණවෙනරථියා රථිං සිඞ්ඝාටකෙන සිඞ්ඝාටකං පරිනෙත්වා දක්ඛිණෙන ද්වාරෙන නික්ඛාමෙත්වා දක්ඛිණතො නගරස්ස සුනිසෙධං නිසෙධෙථ, මූලඡෙජ්ජං කරොථ, සීසමස්ස ඡින්දථා”ති. ‘එවං දෙවා’ති ඛො භික්ඛවෙ තෙ පුරිසා රඤ්ඤො ඛත්තියස්ස මුද්ධාභිසිත්තස්ස පටිස්සුත්වා තං පුරිසං දළ්හාය රජ්ජුයා පච්ඡාබාහං{2 පච්ඡාබාහුං - ස්යා.} ගාළ්හබන්ධනං බන්ධිත්වා ඛුරමුණ්ඩං කරිත්වා, ඛරස්සරෙන පණවෙන රථියා{3 රථියාය රථියං - ස්යා.} රථිං සිඞ්ඝාටකෙන සිඞ්ඝාටකං පරිනෙත්වා, දක්ඛිණෙන ද්වාරෙන නික්ඛාමෙත්වා,{4 නික්ඛමන්ව - සීමු. මඡසං. PPS.} දක්ඛිණතො නගරස්ස සුනිසෙධං නිසෙධෙසුං මූලඡෙජ්ජං අකංසු, සීසමස්ස ඡින්දිංසු. අස්සොසුං ඛො භික්ඛවෙ මනුස්සා, “යෙ කිර භො පරෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියන්ති, තෙ රාජා සුනිසෙධං නිසෙධෙති, මූලඡෙජ්ජං කරොති, සීසානි තෙසං ඡින්දතී”ති. සුත්වාන තෙසං එතදහොසි: යන්නූන මයම්පි තිණ්හානි සත්ථානි කාරාපෙස්සාම{5 කාරාපෙයකම - ස්යා.} තිණ්හානි සත්ථානි කාරාපෙත්වා යෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියිස්සාම, තෙ සුනිසෙධං නිසෙධෙස්සාම, මූලඡෙජ්ජං කරිස්සාම, සීසානි තෙසං ඡින්දිස්සාමා”ති. තෙ තිණ්හානි සත්ථානි කාරාපෙසුං, තිණ්හානි සත්ථානි කාරාපෙත්වා ගාමඝාතම්පි උපක්කමිංසු කාතුං, නිගමඝාතම්පි උපක්කමිංසු කාතුං, නගරඝාතම්පි උපක්කමිංසු කාතුං, පන්ථදුහනම්පි{6 පත්ථදුහනම්පි - මඡසං.} උපක්කමිංසු කාතුං. යෙසං තෙ අදින්නං ථෙය්යසඞ්ඛාතං ආදියන්ති, තෙ සුනිසෙධං නිසෙධෙන්ති, මූලඡෙජ්ජං කරොන්ති, සීසානි තෙසං ඡින්දන්ති. ඉති ඛො භික්ඛවෙ අධනානං ධනෙ අනනුප්පදියමානෙ දාළිද්දියං වෙපුල්ලමගමාසි, දාළිද්දියෙ වෙපුල්ලං ගතෙ අදින්නාදානං වෙපුල්ලමගමාසි, අදින්නාදානෙ වෙපුල්ලං ගතෙ සත්ථං වෙපුල්ලමගමාසි. සත්ථෙ වෙපුල්ලං ගතෙ පාණාතිපාතො වෙපුල්ලමගමාසි. පාණාතිපාතෙ වෙපුල්ලං ගතෙ තෙසං සත්තානං ආයු පි පරිහායි, වණ්ණො පි පරිහායි, තෙසං ආයුනාපි පරිහායමානානං වණ්ණෙනපි පරිහායමානානං අසීතිවස්සසහස්සායුකානං මනුස්සානං පුත්තා චත්තාරීසං වස්සසහස්සායුකා අහෙසුං."
            },
            {
                "type": "page-break",
                "text": "114"
            },
            {
                "type": "paragraph",
                "text": "11. චත්තාරීසංවස්සසහස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු අඤ්ඤතරො පුරිසො පරෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියි. තමෙනං අග්ගහෙසුං. ගහෙත්වා රඤ්ඤො ඛත්තියස්ස මුද්ධාභිසිත්තස්ස දස්සෙසුං “අයං දෙව පුරිසො පරෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියී”ති. එවං වුත්තෙ භික්ඛවෙ රාජා ඛත්තියො මුද්ධාභිසිත්තො තං පුරිසං එතදවොච: “සච්චං කිර ත්වං අම්භො පුරිස පරෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියී?”ති. “න හි දෙවා”ති සම්පජානමුසා අභාසි. ඉති ඛො භික්ඛවෙ අධනානං ධනෙ අනනුප්පදීයමානෙ දාළිද්දියං වෙපුල්ලමගමාසි. දාළිද්දියෙ වෙපුල්ලං ගතෙ අදින්නාදානං වෙපුල්ලමගමාසි. අදින්නාදානෙ වෙපුල්ලං ගතෙ සත්ථං වෙපුල්ලමගමාසි. සත්ථෙ වෙපුල්ලං ගතෙ පාණාතිපාතො වෙපුල්ලමගමාසි, පාණාතිපාතෙ වෙපුල්ලං ගතෙ මුසාවාදො වෙපුල්ලමගමාසි, මුසාවාදෙ වෙපුල්ලං ගතෙ තෙසං සත්තානං ආයු පි පරිහායි, වණ්ණො පි පරිහායි. තෙසං ආයුනා පි පරිහායමානානං වණ්ණෙන පි පරිහායමානානං චත්තාරීසවස්සසහස්සායුකානං මනුස්සානං වීසතිවස්සසහස්සායුකා පුත්තා අහෙසුං. වීසතිවස්සසහස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු අඤ්ඤතරො පුරිසො පරෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියි. තමෙනං අඤ්ඤතරො පුරිසො රඤ්ඤො ඛත්තියස්ස මුද්ධාභිසිත්තස්ස ආරොචෙසි: “ඉත්ථන්නාමො දෙව පුරිසො පරෙසං අදින්නං ථෙය්යසඞ්ඛාතං ආදියී”ති පෙසුඤ්ඤමකාසි. ඉති ඛො භික්ඛවෙ අධනානං ධනෙ අනනුප්පදීයමානෙ දාළිද්දියං වෙපුල්ලමගමාසි. දාළිද්දියෙ වෙපුල්ලං ගතෙ අදින්නාදානං වෙපුල්ලමගමාසි. අදින්නාදානෙ වෙපුල්ලං ගතෙ සත්ථං වෙපුල්ලමගමාසි. සත්ථෙ වෙපුල්ලං ගතෙ පාණාතිපාතො වෙපුල්ලමගමාසි. පාණාතිපාතෙ වෙපුල්ලං ගතෙ මුසාවාදො වෙපුල්ලමගමාසි. මුසාවාදෙ වෙපුල්ලං ගතෙ පිසුණා වාචා වෙපුල්ලමගමාසි. පිසුණාය වාචාය වෙපුල්ලං ගතාය තෙසං සත්තානං ආයු පි පරිහායි වණ්ණො පි පරිහායි. තෙසං ආයුනා පි පරිහායමානානං වණ්ණෙන පි පරිහායමානානං වීසතිවස්සසහස්සායුකානං මනුස්සානං දසවස්සසහස්සායුකා පුත්තා අහෙසුං."
            },
            {
                "type": "paragraph",
                "text": "12. දසවස්සසහස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු එකිදං සත්තා වණ්ණවන්තො හොන්ති, එකිදං සත්තා දුබ්බණ්ණා. තත්ථ යෙ තෙ සත්තා දුබ්බණ්ණා, තෙ වණ්ණවන්තෙ සත්තෙ අභිජ්ඣායන්තා පරෙසං දාරෙසු චාරිත්තං ආපජ්ජිංසු. ඉති ඛො භික්ඛවෙ අධනානං ධනෙ අනනුප්පදීයමානෙ දාළිද්දියං වෙපුල්ලමගමාසි. දාළිද්දියෙ වෙපුල්ලං ගතෙ -පෙ- කාමෙසු මිච්ඡාචාරො වෙපුල්ලමගමාසි, කාමෙසු මිච්ඡාචාරෙ වෙපුල්ලං ගතෙ තෙසං සත්තානං ආයු පි පරිහායි වණ්ණො පි පරිහායි. තෙසං ආයුනා පි පරිහායමානානං වණ්ණෙන පි පරිහායමානානං දසවස්සසහස්සායුකානං මනුස්සානං පඤ්චවස්සසහස්සායුකා පුත්තා අහෙසුං."
            },
            {
                "type": "page-break",
                "text": "116"
            },
            {
                "type": "paragraph",
                "text": "13. පඤ්චවස්සසහස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු ද්වෙ ධම්මා වෙපුල්ලමගමංසු ඵරුසා වාචා සම්ඵප්පලාපො ච. ද්වීසු ධම්මෙසු වෙපුල්ලං ගතෙසු තෙසං සත්තානං ආයු පි පරිහායි, වණ්ණො පි පරිහායි. තෙසං ආයුනා පි පරිහායමානානං වණ්ණෙන පි පරිහායමානානං පඤ්චවස්සසහස්සායුකානං මනුස්සානං අප්පෙකච්චෙ අඩ්ඪතෙය්යවස්සසහස්සායුකා අප්පෙකච්චෙ ද්වෙවස්සසහස්සායුකා පුත්තා අහෙසුං. අඩ්ඪතෙය්යවස්සසහස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු අභිජ්ඣාව්යාපාදා{1 අභිජ්ඣාවාපාදො - PTS.} වෙපුල්ලමගමංසු. අභිජ්ඣාව්යාපාදෙසු වෙපුල්ලං ගතෙසු තෙසං සත්තානං ආයු පි පරිහායි, වණ්ණො පි පරිහායි. තෙසං ආයුනා පි පරිහායමානානං වණ්ණෙන පි පරිහායමානානං අඩ්ඪතෙය්යවස්සසහස්සායුකානං මනුස්සානං වස්සසහස්සායුකා පුත්තා අහෙසුං. වස්සසහස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු මිච්ඡාදිට්ඨි වෙපුල්ලමගමාසි. මිච්ඡාදිට්ඨියා වෙපුල්ලං ගතාය තෙසං සත්තානං ආයු පි පරිහායි, වණ්ණො පි පරිහායි. තෙසං ආයුනා පි පරිහාය මානානං වණ්ණෙනපි පරිහායමානානං වස්සසහස්සායුකානං මනුස්සානං පඤ්චවස්සසතායුකා පුත්තා අහෙසුං. පඤ්චවස්සසතායුකෙසු භික්ඛවෙ මනුස්සෙසු තයො ධම්මා වෙපුල්ලමගමංසු. අධම්මරාගො විසමලොභො මිච්ඡාධම්මො. තීසු ධම්මෙසු වෙපුල්ලං ගතෙසු තෙසං සත්තානං ආයු පි පරිහායි, වණ්ණො පි පරිහායි. තෙසං ආයුනා පි පරිහායමානානං වණ්ණෙන පි පරිහායමානානං පඤ්ච වස්සසතායුකානං මනුස්සානං අප්පෙකච්චෙ අඩ්ඪතෙය්යවස්සසතායුකා, අප්පෙකච්චෙ ද්වෙවස්සසතායුකා පුත්තා අහෙසුං. අඩ්ඪතෙය්යවස්සසතායුකෙසු භික්ඛවෙ මනුස්සෙසු ඉමෙ ධම්මා වෙපුල්ලමගමංසු. අමත්තෙය්යතා අපෙත්තෙය්යතා අසාමඤ්ඤතා අබ්රහ්මඤ්ඤතා න කුලෙජෙට්ඨාපචායිතා."
            },
            {
                "type": "paragraph",
                "text": "14. ඉති ඛො භික්ඛවෙ අධනානං ධනෙ අනනුප්පදීයමානෙ දාළිද්දියං වෙපුල්ලමගමාසි. දාළිද්දියෙ වෙපුල්ලං ගතෙ අදින්නාදානං වෙපුල්ලමගමාසි. අදින්නාදානෙ වෙපුල්ලං ගතෙ සත්ථං වෙපුල්ලමගමාසි. සත්ථෙ වෙපුල්ලං ගතෙ පාණාතිපාතො වෙපුල්ලමගමාසි. පාණාතිපාතෙ වෙපුල්ලං ගතෙ මුසාවාදො වෙපුල්ලමගමාසි. මුසාවාදෙ වෙපුල්ලං ගතෙ පිසුණා වාචා වෙපුල්ලමගමාසි. පිසුණාය වාචාය වෙපුල්ලං ගතාය කාමෙසු මිච්ඡාචාරො වෙපුල්ලමගමාසි. කාමෙසු මිච්ඡාචාරෙ වෙපුල්ලං ගතෙ ද්වෙ ධම්මා වෙපුල්ලමගමංසු, ඵරුසා වාචා සම්ඵප්පලාපො ච. ද්වීසු ධම්මෙසු වෙපුල්ලං ගතෙසු අභිජ්ඣාව්යාපාදා’ වෙපුල්ලමගමංසු. අභිජ්ඣාව්යාපාදෙසු වෙපුල්ලං"
            },
            {
                "type": "page-break",
                "text": "118"
            },
            {
                "type": "paragraph",
                "text": "ගතෙසු මිච්ඡාදිට්ඨි වෙපුල්ලමගමාසි. මිච්ඡාදිට්ඨියා වෙපුල්ලං ගතාය තයො ධම්මා වෙපුල්ලමගමංසු, අධම්මරාගො විසමලොභො මිච්ඡාධම්මො. තීසු ධම්මෙසු වෙපුල්ලං ගතෙසු ඉමෙ ධම්මා වෙපුල්ලමගමංසු, අමත්තෙය්යතා අපෙත්තෙය්යතා අසාමඤ්ඤතා අබ්රහ්මඤ්ඤතා න කුලෙජෙට්ඨාපචායිතා. ඉමෙසු ධම්මෙසු වෙපුල්ලං ගතෙසු තෙසං සත්තානං ආයු පි පරිහායි, වණ්ණොපි පරිහායි. තෙසං ආයුනා පි පරිහායමානානං වණ්ණෙන පි පරිහායමානානං අඩ්ඪතෙය්යවස්සසතායුකානං මනුස්සානං වස්සසතායුකා පුත්තා අහෙසුං."
            },
            {
                "type": "centered",
                "text": "දසවස්සායුකසමයො",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "15. භවිස්සති භික්ඛවෙ සො සමයො යං ඉමෙසං මනුස්සානං දසවස්සායුකා පුත්තා භවිස්සන්ති. දසවස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු පඤ්චවස්සිකා{1 පඤ්චමාසිකා - කම්.} කුමාරිකා අලම්පතෙය්යා භවිස්සන්ති. දසවස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු ඉමානි රසානි අන්තරධායිස්සන්ති, සෙය්යථිදං සප්පි නවනීතං තෙලං මධු ඵාණිතං ලොණං. දසවස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු කුද්රෑසකො අග්ගං භොජනානං{2 අග්ගභොජනං -} භවිස්සති. සෙය්යථාපි භික්ඛවෙ එතරහි සාලිමංසොදනො අග්ගං භොජනානං, එවමෙව ඛො භික්ඛවෙ දසවස්සායුකෙසු මනුස්සෙසු කුද්රෑසකො අග්ගං භොජනානං භවිස්සති. දසවස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු දසකුසලකම්මපථා සබ්බෙන සබ්බං අන්තරධායිස්සන්ති, දසඅකුසලකම්මපථා අතිබ්යා{3 අතිවිය - PTS. ස්යා.} දිප්පිස්සන්ති. දසවස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු කුසලන්තිපි න භවිස්සති. කුතො පන කුසලස්ස කාරකො. දසවස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු යෙ තෙ භවිස්සන්ති අමත්තෙය්යා අපෙත්තෙය්යා අසාමඤ්ඤා අබ්රහ්මඤ්ඤා න කුලෙ ජෙට්ඨාපචායිනො, තෙ පුජ්ජා ච{4 පූජා - ස්යා.} භවිස්සන්ති පාසංසා ච. සෙය්යථාපි භික්ඛවෙ එතරහි මත්තෙය්යා{5 මෙත්තස්යා - PTS.} පෙත්තෙය්යා සාමඤ්ඤා බ්රහ්මඤ්ඤා කුලෙ ජෙට්ඨාපචායිනො පුජ්ජා ච පාසංසා ච, එවමෙව ඛො භික්ඛවෙ දසවස්සායුකෙසු මනුස්සෙසු යෙ තෙ භවිස්සන්ති අමත්තෙය්යා අපෙත්තෙය්යා අසාමඤ්ඤා අබ්රහ්මඤ්ඤා න කුලෙ ජෙට්ඨාපචායිනො, තෙ පුජ්ජා ච භවිස්සන්ති පාසංසා ච. දසවස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු න භවිස්සති මාතා ති වා මාතුච්ඡා ති වා මාතුලානී ති වා ආචරියභරියා ති වා{6 ‘පිතා තිවා පිතුච්ඡති’ වා ඉති අධිකො පාඨො ස්යාමපොත්ථකෙසු දිස්සති.} ගරූනං දාෙරා{7 දාරො - සීමු.} ති වා. සම්භෙදං ලොකො ගමිස්සති යථා අජෙළකා කුක්කුටසූකරා සොණසිගාලා{8 සොණසිඞ්ගාලා - මඡසං.}."
            },
            {
                "type": "page-break",
                "text": "120"
            },
            {
                "type": "paragraph",
                "text": "16. දසවස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු තෙසං සත්තානං අඤ්ඤමඤ්ඤම්හි තිබ්බො ආඝාතො පච්චුපට්ඨිතො භවිස්සති, තිබ්බො බ්යාපාදො, තිබ්බො මනොපදොසො, තිබ්බං වධකචිත්තං මාතුපි පුත්තම්හි, පුත්තස්ස පි මාතරි, පිතු පි පුත්තම්හි පුත්තස්ස පි පිතරි, භාතු පි භාතරි භාතුපි භගිනියා, භගිනියා පි භාතරි, තිබ්බො ආඝාතො පච්චුපට්ඨිතො භවිස්සති තිබ්බො බ්යාපාදො තිබ්බො මනොපදොසො තිබ්බං වධකචිත්තං. සෙය්යථාපි භික්ඛවෙ මාගවිකස්ස මිගං දිස්වා තිබ්බො ආඝාතො පච්චුපට්ඨිතො හොති තිබ්බො බ්යාපාදො තිබ්බො මනොපදොසො තිබ්බං වධකචිත්තං එවමෙව ඛො භික්ඛවෙ දසවස්සායුකෙසු මනුස්සෙසු තෙසං සත්තානං අඤ්ඤමඤ්ඤම්හි තිබ්බො ආඝාතො පච්චුපට්ඨිතො භවිස්සති තිබ්බො බ්යාපාදො තිබ්බො මනොපදොසො තිබ්බං වධකචිත්තං මාතුපි පුත්තම්හි, පුත්තස්ස පි මාතරි, පිතු පි පුත්තම්හි, පුත්තස්ස පි පිතරි, භාතු පි භාතරි, භාතු පි භගිනියා, භගිනියා පි භාතරි, තිබ්බො ආඝාතො පච්චුපට්ඨිතො භවිස්සති, තිබ්බො බ්යාපාදො, තිබ්බො මනොපදොසො, තිබ්බං වධකචිත්තං. දසවස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු සත්තාහං සත්ථන්තරකප්පො භවිස්සති. තෙ අඤ්ඤමඤ්ඤම්හි මිගසඤ්ඤං පටිලභිස්සන්ති. තෙසං තිණ්හානි සත්ථානි හත්ථෙසු පාතුභවිස්සන්ති. තෙ තිණ්හෙන සත්ථෙන ‘එස මිගො එස මිගො’ති අඤ්ඤමඤ්ඤං ජීවිතා වොරොපෙස්සන්ති{1 වොරොපිස්සති - ස්යා.}."
            },
            {
                "type": "centered",
                "text": "ආයුවණ්ණාදිවඩ්ඪනකථා",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "17. අථ ඛො තෙසං භික්ඛවෙ සත්තානං එකච්චානං එවං භවිස්සති, ‘මා ච මයං කඤ්චි{2 කිඤ්චි - කාම්.}, මා ච අම්හෙ කොචි, යන්නූන මයං තිණගහණං වා වනගහණං වා රුක්ඛගහණං වා නදීවිදුග්ගං වා පබ්බතවිසමං වා පවිසිත්වා වනමූලඵලාහාරා යාපෙය්යාමා’ති. තෙ තිණගහණං වා වනගහණං වා රුක්ඛගහණං වා නදීවිදුග්ගං වා පබ්බතවිසමං වා පවිසිත්වා සත්තාහං වනමූලඵලාහාරා යාපෙස්සන්ති{3 යාපෙය්යත්ති - PTS.}. තෙ තස්ස{4 තත්ථ - සීමු.} සත්තාහස්ස අච්චයෙන තිණගහණා වනගහණා රුක්ඛගහණා නදීවිදුග්ගා පබ්බතවිසමා නික්ඛමිත්වා අඤ්ඤමඤ්ඤං ආලිඞ්ගිත්වා සභාගායිස්සන්ති සමස්සාසිස්සන්ති ‘දිට්ඨා භො සත්ත ජීවසි, දිට්ඨා භො සත්ත ජීවසී’ති. අථ ඛො තෙසං භික්ඛවෙ සත්තානං එවං භවිස්සති ‘මයං ඛො අකුසලානං ධම්මානං සමාදානහෙතු එවරූපං ආයතං ඤාතික්ඛයං පත්තා යන්නූන මයං කුසලං කරෙය්යාම."
            },
            {
                "type": "page-break",
                "text": "122"
            },
            {
                "type": "paragraph",
                "text": "කිං කුසලං කරෙය්යාම? යන්නූන මයං පාණාතිපාතා විරමෙය්යාම, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්යාමා”ති. තෙ පාණාතිපාතා විරමිස්සන්ති. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තෙ කුසලානං ධම්මානං සමාදානහෙතු ආයුනා පි වඩ්ඪිස්සන්ති වණ්ණෙන පි වඩ්ඪිස්සන්ති. තෙසං ආයුනා පි වඩ්ඪමානානං වණ්ණෙන පි වඩ්ඪමානානං දසවස්සායුකානං මනුස්සානං වීසතිවස්සායුකා පුත්තා භවිස්සන්ති. අථ ඛො තෙසං භික්ඛවෙ සත්තානං එවං භවිස්සති, “මයං ඛො කුසලානං ධම්මානං සමාදානහෙතු ආයුනා පි වඩ්ඪාම, වණ්ණෙන පි වඩ්ඪාම. යන්නූන මයං භිෙය්යාසොමත්තාය කුසලං කරෙය්යාම. කිං කුසලං කරෙය්යාම? යන්නූන මයං අදින්නාදානා විරමෙය්යාම, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්යාමා’ති. තෙ පාණාතිපාතා විරමිස්සන්ති අදින්නාදානා විරමිස්සන්ති. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තෙ කුසලානං ධම්මානං සමාදානහෙතු ආයුනා’පි වඩ්ඪිස්සන්ති, වණ්ණෙන පි වඩ්ඪිස්සන්ති. තෙසං ආයුනාපි වඩ්ඪමානානං වණ්ණෙනපි වඩ්ඪමානානං වීසතිවස්සායුකානං මනුස්සානං චත්තාලීසතිවස්සායුකා පුත්තා භවිස්සන්ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො තෙසං භික්ඛවෙ සත්තානං එවං භවිස්සති ‘මයං ඛො කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪාම, වණ්ණෙනපි වඩ්ඪාම. යන්නූන මයං භිෙය්යාසොමත්තාය කුසලං කරෙය්යාම. කිං කුසලං කරෙය්යාම? යන්නූන මයං කාමෙසුමිච්ඡාචාරා විරමෙය්යාම, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්යාමා’ති. තෙ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමෙසුමිච්ඡාචාරා විරමිස්සන්ති. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තෙ කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪිස්සන්ති වණ්ණෙන පි වඩ්ඪිස්සන්ති. තෙසං ආයුනාපි වඩ්ඪමානානං වණ්ණෙනපි වඩ්ඪමානානං චත්තාලීසවස්සායුකානං මනුස්සානං අසීතිවස්සායුකා පුත්තා භවිස්සන්ති."
            },
            {
                "type": "paragraph",
                "text": "18. අථ ඛො තෙසං භික්ඛවෙ සත්තානං එවං භවිස්සති ‘මයං ඛො කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪාම වණ්ණෙනපි වඩ්ඪාම. යන්නූන මයං භිෙය්යාසොමත්තාය කුසලං කරෙය්යාම. කිං කුසලං කරෙය්යාම? යන්නූන මයං මුසාවාදා විරමෙය්යාම, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්යාමා’ති. තෙ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමෙසුමිච්ඡාචාරා විරමිස්සන්ති, මුසාවාදා විරමිස්සන්ති. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තෙ කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪිස්සන්ති වණ්ණෙනපි වඩ්ඪිස්සන්ති."
            },
            {
                "type": "page-break",
                "text": "124"
            },
            {
                "type": "paragraph",
                "text": "තෙසං ආයුනාපි වඩ්ඪමානානං වණ්ණෙනපි වඩ්ඪමානානං අසීතිවස්සායුකානං මනුස්සානං සට්ඨිවස්සසතායුකා පුත්තා භවිස්සන්ති. අථ ඛො තෙසං භික්ඛවෙ සත්තානං එවං භවිස්සති ‘මයං ඛො කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪාම, වණ්ණෙනපි වඩ්ඪාම. යන්නූන මයං භිෙය්යාසොමත්තාය කුසලං කරෙය්යාම. කිං කුසලං කරෙය්යාම? යන්නූන මයං පිසුණාය වාචාය වරමෙය්යාම ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්යාමා’ති. තෙ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමෙසුමිච්ඡාචාරා විරමිස්සන්ති, මුසාවාදා විරමිස්සන්ති. පිසුණාය වාචාය විරමිස්සන්ති. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තෙ කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪිස්සන්ති වණ්ණෙනපි වඩ්ඪිස්සන්ති. තෙසං ආයුනාපි වඩ්ඪමානානං වණ්ණෙනපි වඩ්ඪමානානං සට්ඨිවස්සසතායුකානං මනුස්සානං වීසතිවස්සසතායුකා පුත්තා භවිස්සන්ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො තෙසං භික්ඛවෙ සත්තානං එවං භවිස්සති ‘මයං ඛො කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪාම වණ්ණෙනපි වඩ්ඪාම. යන්නූන මයං භිෙය්යාසොමත්තාය කුසලං කරෙය්යාම. කිං කුසලං කරෙය්යාම? යන්නූන මයං ඵරුසාය වාචාය විරමෙය්යාම. ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්යාමා’ති. තෙ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමෙසුමිච්ඡාචාරා විරමිස්සන්ති, මුසාවාදා විරමිස්සන්ති. පිසුණාය වාචාය විරමිස්සන්ති, ඵරුසාය වාචාය විරමිස්සන්ති. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තෙ කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪිස්සන්ති වණ්ණෙනපි වඩ්ඪිස්සන්ති. තෙසං ආයුනාපි වඩ්ඪමානානං වණ්ණෙනපි වඩ්ඪමානානං වීසතිවස්සසතායුකානං මනුස්සානං චත්තාරීසංජබ්බස්සසතායුකා පුත්තා භවිස්සන්ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො තෙසං භික්ඛවෙ සත්තානං එවං භවිස්සති ‘මයං ඛො කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪාම වණ්ණෙනපි වඩ්ඪාම. යන්නූන මයං භිෙය්යාසොමත්තාය කුසලං කරෙය්යාම. කිං කුසලං කරෙය්යාම? යන්නූන මයං සම්ඵප්පලාපා විරමෙය්යාම, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්යාමා’ති. තෙ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමෙසුමිච්ඡාචාරා විරමිස්සන්ති, මුසාවාදා විරමිස්සන්ති. පිසුණාය වාචාය විරමිස්සන්ති, ඵරුසාය වාචාය විරමිස්සන්ති, සම්ඵප්පලාපා විරමිස්සන්ති. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තෙ කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪිස්සන්ති වණ්ණෙනපි වඩ්ඪිස්සන්ති. තෙසං ආයුනාපි වඩ්ඪමානානං වණ්ණෙනපි වඩ්ඪමානානං චත්තාරීසංජබ්බස්සසතායුකානං මනුස්සානං ද්වෙවස්සසහස්සායුකා පුත්තා භවිස්සන්ති."
            },
            {
                "type": "page-break",
                "text": "126"
            },
            {
                "type": "paragraph",
                "text": "19. අථ ඛො තෙසං භික්ඛවෙ සත්තානං එවං භවිස්සති ‘මයං ඛො කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪාම, වණ්ණෙනපි වඩ්ඪාම. යන්නූන මයං භිෙය්යාසොමත්තාය කුසලං කරෙය්යාම. කිං කුසලං කරෙය්යාම? යන්නූන මයං අභිජ්ඣං පජහෙය්යාම, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්යාමා’ති. තෙ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමෙසුමිච්ඡාචාරා විරමිස්සන්ති, මුසාවාදා විරමිස්සන්ති. පිසුණාය වාචාය විරමිස්සන්ති, ඵරුසාය වාචාය විරමිස්සන්ති, සම්ඵප්පලාපා විරමිස්සන්ති. අභිජ්ඣං පජහිස්සන්ති, ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තෙ කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪිස්සන්ති වණ්ණෙනපි වඩ්ඪිස්සන්ති. තෙසං ආයුනාපි වඩ්ඪමානානං වණ්ණෙනපි වඩ්ඪමානානං ද්වෙවස්සසහස්සායුකානං මනුස්සානං චත්තාරිවස්සසහස්සායුකා පුත්තා භවිස්සන්ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො තෙසං භික්ඛවෙ සත්තානං එවං භවිස්සති ‘මයං ඛො කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪාම, වණ්ණෙනපි වඩ්ඪාම. යන්නූන මයං භිෙය්යාසොමත්තාය කුසලං කරෙය්යාම. කිං කුසලං කරෙය්යාම? යන්නූන මයං ව්යාපාදං පජහෙය්යාම, ඉදං කුසලං ‘ධම්මං සමාදාය වත්තෙය්යාමා’ති. තෙ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමෙසුමිච්ඡාචාරා විරමිස්සන්ති, මුසාවාදා විරමිස්සන්ති. පිසුණාය වාචාය විරමිස්සන්ති, ඵරුසාය වාචාය විරමිස්සන්ති, සම්ඵප්පලාපා විරමිස්සන්ති, අභිජ්ඣං පජහිස්සන්ති, ව්යාපාදං පජහිස්සන්ති. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තෙ කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪිස්සන්ති වණ්ණෙනපි වඩ්ඪිස්සන්ති. තෙසං ආයුනාපි වඩ්ඪමානානං වණ්ණෙනපි වඩ්ඪමානානං චත්තාරීවස්සසසහස්සායුකානං{1 චත්තාරිවස්සසහස්සායුකානං - (මඡසං. PTC)} මනුස්සානං අට්ඨවස්සසහස්සායුකා පුත්තා භවිස්සන්ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො තෙසං භික්ඛවෙ සත්තානං එවං භවිස්සති ‘මයං ඛො කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪාම, වණ්ණෙනපි වඩ්ඪාම. යන්නූන මයං භිෙය්යාසොමත්තාය කුසලං කරෙය්යාම. කිං කුසලං කරෙය්යාම? යන්නූන මයං මිච්ඡාදිට්ඨිං පජහෙය්යාම, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්යාමා’ති. තෙ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමෙසුමිච්ඡාචාරා විරමිස්සන්ති, මුසාවාදා විරමිස්සන්ති. පිසුණාය වාචාය විරමිස්සන්ති, ඵරුසාය වාචාය විරමිස්සන්ති, සම්ඵප්පලාපා විරමිස්සන්ති, අභිජ්ඣං පජහිස්සන්ති, ව්යාපාදං පජහිස්සන්ති, මිච්ඡා දිට්ඨිං පජහිස්සන්ති. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තෙ කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪිස්සන්ති වණ්ණෙනපි වඩ්ඪිස්සන්ති. තෙසං ආයුනාපි වඩ්ඪමානානං වණ්ණෙනපි වඩ්ඪමානානං අට්ඨවස්සසහස්සායුකානං මනුස්සානං වීසතිවස්සසහස්සායුකා පුත්තා භවිස්සන්ති,"
            },
            {
                "type": "page-break",
                "text": "128"
            },
            {
                "type": "paragraph",
                "text": "20. අථ ඛො තෙසං භික්ඛවෙ සත්තානං එවං භවිස්සති: ‘මයං ඛො කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪාම, වණ්ණෙනපි වඩ්ඪාම. යන්නූන මයං භිෙය්යාසොමත්තාය කුසලං කරෙය්යාමාති. කිං කුසලං කරෙය්යාම? යන්නූන මයං තයො ධම්මෙ පජහෙය්යාම අධම්මරාගං විසමලොභං මිච්ඡාධම්මං, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්යාමා’ති. තෙ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමෙසුමිච්ඡාචාරා විරමිස්සන්ති, මුසාවාදා විරමිස්සන්ති, පිසුණාය වාචාය විරමිස්සන්ති, ඵරුසාය වාචාය විරමිස්සන්ති, සම්ඵප්පලාපා විරමිස්සන්ති, අභිජ්ඣං පජහිස්සන්ති, ව්යාපාදං පජහිස්සන්ති, මිච්ඡාදිට්ඨිං පජහිස්සන්ති. තයො ධම්මෙ පජහිස්සන්ති: අධම්මරාගං විසමලොභං මිච්ඡාධම්මං. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තෙ කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪිස්සන්ති, වණ්ණෙනපි වඩ්ඪිස්සන්ති, තෙසං ආයුනාපි වඩ්ඪමානානං වණ්ණෙනපි වඩ්ඪමානානං වීසතිවස්සසහස්සායුකානං මනුස්සානං චත්තාරීවස්සසහස්සායුකා පුත්තා භවිස්සන්ති,"
            },
            {
                "type": "paragraph",
                "text": "21. අථ ඛො තෙසං භික්ඛවෙ සත්තානං එවං භවිස්සති ‘මයං ඛො කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪාම වණ්ණෙනපි වඩ්ඪාම. යන්නූන මයං භිෙය්යාසොමත්තාය කුසලං කරෙය්යාම. කිං කුසලං කරෙය්යාම? යන්නූන මයං මත්තෙය්යා අස්සාම පෙත්තෙය්යා අස්සාම සාමඤ්ඤා බ්රහ්මඤ්ඤා කුලෙජෙට්ඨාපචායිනො, ඉදං කුසලං ධම්මං සමාදාය වත්තෙය්යාමා’ති. තෙ පාණාතිපාතා විරමිස්සන්ති, අදින්නාදානා විරමිස්සන්ති, කාමෙසුමිච්ඡාචාරා විරමිස්සන්ති, මුසාවාදා විරමිස්සන්ති, පිසුණාය වාචාය විරමිස්සන්ති, ඵරුසාය වාචාය විරමිස්සන්ති, සම්ඵප්පලාපා විරමිස්සන්ති, අභිජ්ඣං පජහිස්සන්ති, ව්යාපාදං පජහිස්සන්ති, මිච්ඡා දිට්ඨිං පජහිස්සන්ති. තයො ධම්මෙ පජහිස්සන්ති අධම්මරාගං විසමලොභං මිච්ඡාධම්මං, මත්තෙය්යා භවිස්සන්ති පෙත්තෙය්යා සාමඤ්ඤා බ්රහ්මඤ්ඤා කුලෙජෙට්ඨාපචායිනො. ඉදං කුසලං ධම්මං සමාදාය වත්තිස්සන්ති. තෙ කුසලානං ධම්මානං සමාදානහෙතු ආයුනාපි වඩ්ඪිස්සන්ති වණ්ණෙනපි වඩ්ඪිස්සන්ති. තෙසං ආයුනාපි වඩ්ඪමානානං වණ්ණෙනපි වඩ්ඪමානානං චත්තාරිසංවස්සසහස්සායුකානං මනුස්සානං අසීතිවස්සසහස්සායුකා පුත්තා භවිස්සන්ති. අසීතිවස්සසහස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු පංචවස්සසතිකා කුමාරිකා අලම්පතෙය්යා භවිස්සන්ති. අසීතිවස්සසහස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු තයො ආබාධා භවිස්සන්ති ඉච්ඡා අනසනං ජරා."
            },
            {
                "type": "page-break",
                "text": "130"
            },
            {
                "type": "centered",
                "text": "සඞ්ඛරාජුප්පත්ති",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "22. අසීතිවස්සසහස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු අයං ජම්බුදීපො ඉද්ධො චෙව භවිස්සති ඵීතො ච, කුක්කුටසම්පාතිකා{1 කුක්කුටසම්යාතිකා - ස්යා.} ගාමනිගමජනපද රාජධානියො.{2 ගාමනිගම ජනපද රාජධානියො - කම්. ගාමනිගමරාජධානියො - මඡසං.} අසීතිවස්සසහස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු අයං ජම්බුදීපො අවීචි මඤ්ඤෙ ඵුටො භවිස්සති මනුස්සෙහි, සෙය්යථාපි නළවනං සරවනං{3 සාරවනං - ස්යා.} වා."
            },
            {
                "type": "paragraph",
                "text": "අසීතිවස්සසහස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු අයං බාරාණසී කෙතුමතී නාම රාජධානී භවිස්සති ඉද්ධා චෙව ඵීතා ච බහුජනා ච ආකිණ්ණමනුස්සා ච සුභික්ඛා ච. අසීතිවස්සසහස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු ඉමස්මිං ජම්බුදීපෙ චතුරාසීති නගරසහස්සානි භවිස්සන්ති කෙතුමතීරාජධානිපමුඛානි. අසීතිවස්සසහස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු කෙතුමතියා රාජධානියා සංඛො නාම රාජා උප්පජ්ජිස්සති චක්කවත්තී ධම්මිකො ධම්මරාජා චාතුරන්තො විජිතාවී ජනපදත්ථාවරියප්පත්තො සත්තරතනසමන්නාගතො. තස්සිමානි සත්තරතනානි භවිස්සන්ති, සෙය්යථිදං, චක්කරතනං හත්ථිරතනං අස්සරතනං මණිරතනං ඉත්ථිරතනං ගහපතිරතනං පරිනායකරතනමෙව සත්තමං. පරොසහස්සං ඛො පනස්ස පුත්තා භවිස්සන්ති සූරා වීරඞ්ගරූපා පරසෙනප්පමද්දනා. සො ඉමං පථවිං සාගරපරියන්තං අදණ්ඩෙන අසත්ථෙන ධම්මෙන අභිවිජිය අජ්ඣාවසිස්සති."
            },
            {
                "type": "centered",
                "text": "මෙත්තෙය්යබුද්ධුප්පාදො",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "23. අසීතිවස්සසහස්සායුකෙසු භික්ඛවෙ මනුස්සෙසු මෙත්තෙෙය්යා නාම භගවා ලොකෙ උප්පජ්ජිස්සති අරහං සම්මාසම්බුද්ධො විජ්ජාචරණසම්පන්නො සුගතො ලොකවිදූ අනුත්තරො පුරිසදම්මසාරථි සත්ථා දෙවමනුස්සානං බුද්ධො භගවා. සෙය්යථාපාහං එතරහි ලොකෙ උප්පන්නො අරහං සම්මාසම්බුද්ධො විජ්ජාචරණසම්පන්නො සුගතො ලොකවිදූ අනුත්තරො පුරිසදම්මසාරථි සත්ථා දෙවමනුස්සානං බුද්ධො භගවා. සො ඉමං ලොකං සදෙවකං සමාරකං සබ්රහ්මකං සස්සමණබ්රාහ්මණිං පජං සදෙවමනුස්සං සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදෙස්සති, සෙය්යථාපහං එතරහි ඉමං ලොකං සදෙවකං සමාරකං සබ්රහ්මකං සස්සමණබ්රාහ්මණිං පජං සදෙවමනුස්සං සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදෙමි. සො ධම්මං දෙසෙස්සති ආදිකල්යාණං මජ්ඣෙකල්යාණං පරියොසානකල්යාණං සාත්ථං සබ්යඤ්ජනං කෙවලපරිපුණ්ණං පරිසුද්ධං බ්රහ්මචරියං පකාසෙස්සති. සෙය්යථාපාහං එතරහි ධම්මං දෙසෙමි ආදිකල්යාණං මජ්ඣෙකල්යාණං පරියොසානකල්යාණං සාත්ථං සබ්යඤ්ජනං කෙවලපරිපුණ්ණං පරිසුද්ධං බ්රහ්මචරියං පකාසෙමි. සො අනෙකසතසහස්සං භික්ඛුසංඝං පරිහරිස්සති සෙය්යථාපහං එතරහි අනෙකසතං භික්ඛුසංඝං පරිහරාමි."
            },
            {
                "type": "page-break",
                "text": "132"
            },
            {
                "type": "paragraph",
                "text": "24. අථ ඛො භික්ඛවෙ සඞ්ඛො නාම රාජා යො සො යූපො රඤ්ඤා මහාපනාදෙන කාරාපිතො, තං යූපං උස්සාපෙත්වා අජ්ඣාවසිත්වා තං දත්වා විස්සජ්ජෙත්වා{1 විසජ්ජිත්ව (මඡසං)} සමණබ්රාහ්මණකපණද්ධිකවණිබ්බකයාචකානං දානං දත්වා{2 දදිත්වා (PTS)} මෙත්තෙය්යස්ස භගවතො අරහතො සම්මාසම්බුද්ධස්ස සන්තිකෙ කෙසමස්සුං ඔහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජිස්සති. සො එවං පබ්බජිතො සමානො එකො වූපකට්ඨෙ අප්පමත්තො ආතාපී පහිතත්තො විහරන්තො න චිරස්සෙව යස්සත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජන්ති, තදනුත්තරං බ්රහ්මචරියපරියොසානං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරිස්සති."
            },
            {
                "type": "paragraph",
                "text": "25. අත්තදීපා භික්ඛවෙ විහරථ අත්තසරණා අනඤ්ඤසරණා, ධම්මදීපා ධම්මසරණා අනඤ්ඤසරණා. "
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ භික්ඛු අත්තදීපො විහරති අත්තසරණො අනඤ්ඤසරණො, ධම්මදීපො ධම්මසරණො අනඤ්ඤසරණො?"
            },
            {
                "type": "paragraph",
                "text": "ඉධ භික්ඛවෙ භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. එවං ඛො භික්ඛවෙ භික්ඛු අත්තදීපො විහරති අත්තසරණො අනඤ්ඤසරණො, ධම්මදීපො ධම්මසරණො අනඤ්ඤසරණො."
            },
            {
                "type": "centered",
                "text": "භික්ඛුනො ආයුවණ්ණාදිවඩ්ඪනකථා",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "26. ගොචරෙ භික්ඛවෙ චරථ සකෙ පෙත්තිකෙ විසයෙ. ගොචරෙ භික්ඛවෙ චරන්තා සකෙ පෙත්තිකෙ විසයෙ ආයුනා පි වඩ්ඪිස්සථ, වණ්ණෙන පි වඩ්ඪිස්සථ, සුඛෙන පි වඩ්ඪිස්සථ, භොගෙන පි වඩ්ඪිස්සථ, බලෙන පි වඩ්ඪිස්සථ. කිඤ්ච භික්ඛවෙ භික්ඛුනො ආයුස්මිං? ඉධ භික්ඛවෙ භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාර-සමන්නාගතං ඉද්ධිපාදං භාවෙති, වීරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසා සමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. සො ඉමෙසං චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා ආකඞ්ඛමානො කප්පං වා තිට්ඨෙය්ය කප්පාවසෙසං වා. ඉදං ඛො භික්ඛවෙ භික්ඛුනො ආයුස්මිං."
            },
            {
                "type": "page-break",
                "text": "134"
            },
            {
                "type": "paragraph",
                "text": "කිඤ්ච භික්ඛවෙ භික්ඛුනො වණ්ණස්මිං? ඉධ භික්ඛවෙ භික්ඛු සීලවා හොති පාතිමොක්ඛසංවරසංවුතො විහරති ආචාරගොචරසම්පන්නො අණුමත්තෙසු වජ්ජෙසු භයදස්සාවී, සමාදාය සික්ඛති සික්ඛාපදෙසු. ඉදං ඛො භික්ඛවෙ භික්ඛුනො වණ්ණස්මිං."
            },
            {
                "type": "paragraph",
                "text": "කිඤ්ච භික්ඛවෙ භික්ඛුනො සුඛස්මිං? ඉධ භික්ඛවෙ භික්ඛු විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං{1 පඨමජ්ඣානං සීමු, (PTS)} උපසම්පජ්ජ විහරති. විතක්කවිචාරානං වූපසමා -පෙ- දුතියං ඣානං -පෙ- තතියං ඣානං -පෙ- චතුත්ථං ඣානං උපසම්පජ්ජ විහරති. ඉදං ඛො පන භික්ඛවෙ භික්ඛුනො සුඛස්මිං."
            },
            {
                "type": "paragraph",
                "text": "කිඤ්ච භික්ඛවෙ භික්ඛුනො භොගස්මිං? ඉධ භික්ඛවෙ භික්ඛු මෙත්තාසහගතෙන චෙතසා එකං දිසං ඵරිත්වා විහරති, තථා දුතියං, තථා තතියං, තථා චතුත්ථං, ඉති උද්ධමධො තිරියං සබ්බධි සබ්බත්තතාය සබ්බාවන්තං ලොකං මෙත්තාසහගතෙන චෙතසා විපුලෙන මහග්ගතෙන අප්පමාණෙන අවෙරෙන අබ්යාපජ්ජෙන{2 අබ්යපජ්ඣෙනං (සීමු. PTS)} ඵරිත්වා විහරති. ඉධ භික්ඛවෙ භික්ඛු කරුණාසහගතෙන චෙතසා -පෙ- මුදිතාසහගතෙන චෙතසා -පෙ- උපෙක්ඛාසහගතෙන චෙතසා එකං දිසං ඵරිත්වා විහරති, තථා දුතියං, තථා තතියං, තථා චතුත්ථං. ඉති උද්ධමධො තිරියං සබ්බධි සබ්බත්තතාය සබ්බාවන්තං ලොකං උපෙක්ඛාසහගතෙන චෙතසා විපුලෙන මහග්ගතෙන අප්පමාණෙන අවෙරෙන අබ්යාපජ්ජෙන ඵරිත්වා විහරති. ඉදං ඛො භික්ඛවෙ භික්ඛුනො භොගස්මිං."
            },
            {
                "type": "paragraph",
                "text": "කිඤ්ච භික්ඛවෙ භික්ඛුනො බලස්මිං? ඉධ භික්ඛවෙ භික්ඛු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති. ඉදං ඛො භික්ඛවෙ භික්ඛුනො බලස්මිං."
            },
            {
                "type": "paragraph",
                "text": "නාහං භික්ඛවෙ අඤ්ඤං එකබලම්පි සමනුපස්සාමි යං එවං දුප්පසහං යථයිදං භික්ඛවෙ මාරබලං කුසලානං භික්ඛවෙ ධම්මානං සමාදානහෙතු එවමිදං පුඤ්ඤං පවඩ්ඪතීති."
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච භගවා. අත්තමනා තෙ භික්ඛූ භගවතො භාසිතං අභිනන්දුන්ති."
            },
            {
                "type": "centered",
                "text": "චක්කවත්තිසීහනාදසුත්තං නිට්ඨිතං තතියං.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "pages": {
            "96": {
                "pageNum": 96,
                "footnotesCount": 0
            },
            "98": {
                "pageNum": 98,
                "footnotesCount": 2
            },
            "100": {
                "pageNum": 100,
                "footnotesCount": 4
            },
            "102": {
                "pageNum": 102,
                "footnotesCount": 2
            },
            "104": {
                "pageNum": 104,
                "footnotesCount": 1
            },
            "106": {
                "pageNum": 106,
                "footnotesCount": 4
            },
            "108": {
                "pageNum": 108,
                "footnotesCount": 0
            },
            "110": {
                "pageNum": 110,
                "footnotesCount": 6
            },
            "112": {
                "pageNum": 112,
                "footnotesCount": 6
            },
            "114": {
                "pageNum": 114,
                "footnotesCount": 0
            },
            "116": {
                "pageNum": 116,
                "footnotesCount": 1
            },
            "118": {
                "pageNum": 118,
                "footnotesCount": 8
            },
            "120": {
                "pageNum": 120,
                "footnotesCount": 4
            },
            "122": {
                "pageNum": 122,
                "footnotesCount": 0
            },
            "124": {
                "pageNum": 124,
                "footnotesCount": 0
            },
            "126": {
                "pageNum": 126,
                "footnotesCount": 1
            },
            "128": {
                "pageNum": 128,
                "footnotesCount": 0
            },
            "130": {
                "pageNum": 130,
                "footnotesCount": 3
            },
            "132": {
                "pageNum": 132,
                "footnotesCount": 2
            },
            "134": {
                "pageNum": 134,
                "footnotesCount": 2
            }
        }
    },
    {
        "filename": "1-9-10-44-75",
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "97"
            },
            {
                "type": "centered",
                "text": "3.",
                "level": 3
            },
            {
                "type": "heading",
                "text": "චක්‍රවර්ති සිංහනාද සූත්‍රය",
                "level": 3
            },
            {
                "format": 13,
                "text": "1. මා විසින් මෙසේ අසන ලදී:\nඑක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ මගධ රටැ මාතුලා නුවරැ වැඩවසන සේක. එහි දී භාග්‍යවතුන් වහන්සේ ‘මහණෙනි’ යි භික්ෂූන් ඇමැතූ සේක. ‘පින්වතුන් වහන්සැ’ යි ඒ භික්ෂූහු ඔබට පිළිවදන් දුන්හ. භාග්‍යවතුන් වහන්සේ මේ මතු දැක්වෙන ධර්මය වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ආත්මය හෙවත් ලොවී ලොව්තුරා දහම් ද්වීප කොට ඇත්තෝ වැ, ආත්මය ශරණ කොට ඇත්තෝ වැ, අන් සරණයක් අපේක්ෂා නො කරන්නෝ වැ, ධර්මය ද්වීප කොටැත්තෝ වැ, ධර්මය ශරණ කොටැත්තෝ වැ, අන් සරණයක් නැත්තෝ වැ වසවු. මහණෙනි, මහණ තෙම කෙසේ නම් ආත්මය ද්වීප කොටැති වැ, ආත්මය ශරණ කොටැති වැ, අනන්‍ය ශරණ වැ, ධර්මය ද්වීප කොටැති වැ, ධර්මය ශරණ කොටැති වැ අනන්‍ය ශරණ වැ වෙසේ ද? යත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මෙහි මහණ තෙමේ කයෙහි කායානුපස්සී වැ (කය අනුව බලන්නෙක් වැ), කෙලෙස් තවන වැර ඇති වැ, නුවණින් දන්නේ, එළඹැ සිටි සිහි ඇත්තේ, ලොවෙහි (කයෙහි) අභිධ්‍යාවත් දොම්නසත් බැහැර කොට වෙසෙයි. වේදනාවන්හි වේදනානුපස්සී වැ … සිතෙහි චිත්තානුපස්සී වැ … ධර්මයන්හි (සංඥා සංස්කාරයන්හි) ධම්මානුපස්සී වැ කෙලෙස් තවන වැර ඇති වැ, නුවණින් දන්නේ, එළැඹැ සිටි සිහිඇත්තේ, ලොවෙහි (සංඥා සංස්කාර ස්කන්ධයන්හි) අභිධ්‍යාව ද දොම්නස ද බැහැරැ කොට වෙසෙයි. මහණෙනි, මෙසේ ම මහණ තෙම ආත්මද්වීප වැ ආත්ම ශරණ වැ අනන්‍ය ශරණ වැ ධර්මද්වීප වැ ධර්ම ශරණ වැ අනන්‍ය ශරණ වැ වෙසෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, තමන් සතු වූ, පියාගෙන් තමනට උරුම වැ පැමිණි හැසිරීමට නිසි පෙදෙසෙහි හැසිරෙවු. පියාගෙන් උරුම ව ආ හැසිරීමට නිසි පෙදෙසෙහි හැසිරෙන්නවුන්ගේ සිදුරක් මාර තෙමේ නො දකින්නේ ය, අරමුණක් මාර තෙමේ නො ලබන්නේ ය. මහණෙනි, කුශල ධර්ම සමාදන් කොට ගෙන පවත්නා හෙයින් මෙසේ මේ පින් වැඩෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "99"
            },
            {
                "format": 13,
                "text": "2. මහණෙනි, පෙරැ වූවක් කියම්. පෙරැ දැහැමි වූ දැහැමින් රජය කරවන්නා වූ, සතර මහ සයුරුහිම් කොටැති (සිවු මහ දිවයින වූ) මුළු පොළොවට අධිපති වූ, සියලු සතුරන් දිනූ, (කිසිවකු විසිනුත් සොලොවාලියැ නො හැකි බැවින්) දනවුහි ස්ථීර බවට පැමිණී, සත් රුවනින් සමන්විත දළ්හනේමි නම් වූ සක්විති රජෙක් විය. චක්‍රරත්නය, හස්තිරත්නය, අශ්වරත්නය, මණිරත්නය, ස්ත්‍රී රත්නය, ගෘහපතිරත්නය, සත්වැනි පරිනායකරත්නය ම යැ යි ඔහුට මේ සත් රුවන් කෙනෙක් වූහ. බාන සුලු නොවූ, මූර්තිමත් වීර්යය බඳු ශරීර ඇති, පර සෙන් මඩිනු සමත් වූ, දහසකට වැඩි පුත්‍ර කෙනෙක් ඔහුට වූහ. එ සක්විති තෙම සයුරහිම් මෙ මහ පොළොව දඬුවමින් තොර වැ අවියෙන් තොර වැ, දැහැමෙන් සෙමෙන් දිනා අධිපති වැ විසී ය. මහණෙනි, එ කල්හි දළ්හනේමි රජ තෙමෙ හවුරුදු බොහෝ ගණනෙක, හවුරුදු සිය ගණනෙක, හවුරුදු දහස් ගණනෙක ඇවෑමෙන් එක්තරා මිනිසකු බණවා, ‘එම්බා පුරුෂය, යම් විටෙක තෝ දෙව් සක්විති රුවන තුබූ තැනින් ඉවත් වැ සිටියා, තුබූ තැනින් පහ වැ සිටියා දුටුයෙහි වී නම්, එ විටැ මට දන්වව’ යි කී ය. මහණෙනි. එ පුරිස් තෙමෙ ‘එසේ ය දේවයන් වහන්සැ’ යි ම දළ්හනේමි රජු බස් මුදුනින් පිළිගත. මහණෙනි, හේ පුරිස් තෙම බොහෝ හවුරුදු ගණනෙක, බොහෝ හවුරුදු සිය ගණනෙක, බොහෝ හවුරුදු දහස් ගණනෙක ඇවෑමෙන් දෙව් සක්රුවන තුබූ තැනින් ඉවත් වූවා, පහ වැ සිටියැ දිටී ය. දැක, දළ්හනේමි රජු කරා එළඹියේ ය. එළඹ ඔහුට, ‘දේවයන් වහන්ස, දනැ ගන්න. ඔබගේ දෙව් සක්රුවන ඉවත් විය, තුබූ තැනින් පහ වියැ’ යි සැළ කෙළේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "3. මහණෙනි, එ විටැ දළ්හනේමි රජ තෙම දෙටුපුත් කුමරු කැඳවා, ‘දරුව, මගේ දෙව් සක්රුවන ඉවත් වී ල, තුබූ තැනින් පහ වී ල. ‘යම් සක්විති රජක්හුගේ දෙව් සක්රුවන ඉවත් වේ ද, තුබූ තැනින් පහ වේ ද, දැන් එ රජු විසින් බොහෝ කල් ජීවත් විය හැකි නො වේ’යන මෙය මා විසින් අසන ලදී. මිනිසුන් විසින් වින්දැ හැකි කාමයෝ මා විසින් විඳුනා ලදුහ. දැන් මට දිව්‍ය කාම සම්පත් සොයන්නට කල් පැමිණියේ වෙයි. දරුව, කුමාරය, මෙහි එව. මේ මුහුදුහිම් පොළොව තෝ අනුභව කරව. මම් වනාහි කෙහෙ රවුලු බහවා, කසා වත් හැඳ, ගිහි ගෙයින් පැවිදි බිමට වදනෙමි’ යි මෙ බස් පැවැසී ය. මහණෙනි, ඉක්බිති දළ්හනේමි සක්විති තෙමෙ දෙටුපුත් කුමර හට මනොවට රජයෙහි අනුසැසැ (මෙසේ රජය කරව යි අනුශාසාන කොට), කෙහෙරවුලු බහවා, කසාවත් හැඳ ගිහිගෙන් නික්ම පැවිදි බිම් වන.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "101"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ඒ රාජර්ෂිහු පැවිදි වැ සත් දවස් ගියකලැ දෙව් සක්රුවන අතුරුදහන් විය. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "මහණෙනි, එ කල්හි එක්තරා මිනිසෙක් මුදුනැ ලත් අභිෂේක ඇති එ රජු කරා එළැඹියේ ය. එළැඹ මූර්ධාභිෂික්ත වූ එ රජහට, ‘දේවයිනි, දැන ගන්න, දෙව් සක්රුවන අතුරුදහන් අතුරුදහන් වී යැ’ සැළ කෙළේ ය. මහණෙනි, ඉක්බිති මූර්ධාභිෂික්ත ඒ ක්ෂත්‍රිය රාජ තෙම දෙව් සක්රුවන අතුරුදහන් වූ කලැ නො සතුටු සිතැති විය. නො සතුටු සිතැති බව ද දැන්වී ය. හේ රාජර්ෂිහු කරා එළැඹියේ ය. එළැඹ ඔහුට ‘දේවයිනි, දෙව් සක්රුවන අතුරුදහන් වී යැ’ යි සැළ කෙළේ ය. මහණෙනි. මෙසේ කී කල්හි රාජර්ෂි තෙමෙ මූර්ධාභිෂික්ත ඒ කැත් රජුහට දරුව, දෙව් සක්රුවන අතුරුදහන් වූ කල්හි නො සතුටු නො වව, නොසතුටු බව නො පළ කරව, දෙව් සක්රුවන තට පියාගෙන් ලැබෙන දෑවෙද්දක් නො වේ, ‘දරුව, දැන් තෝ අරී (නිදොස්) සක්විති වත් පුරව, අරී (නිදොස්) සක්විති වත් පුරන, ඒ පණුරැස් පොහෝ දිනැ හිස සෝදා නා, පෙහවස් සමාදන් කොට ගෙන, පහයැ මතු මාළට පැමිණ ඉන්නා තාහට දහසක් දැවි ඇති නිම් වළලු සහිත, නැබ සහිත, හැම අයුරින් ම පිරිපුන් දෙව් සක්රුවන පහළ වන්නේ ය යන යමෙක් ඇද්ද, මේ කාරණය විද්‍යාමාන යැ’ යි කී ය."
            },
            {
                "format": 13,
                "text": "4. “දේවයිනි, ඒ අරී (නිදොස්) සක්විති වන කවර යැ?”යි රජ පුළුවත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“දරුව එසේ නම්, (දශ කුශලකර්‍ම පථ) ධර්‍මය ම ඇසුරු කොට (දශ කුශලකර්‍ම පථ) ධර්‍මයට ම සත්කාර කරමින්, (දශ කුශලකර්‍ම පථ) ධර්‍මයට ම ගරු කරමින්, (දශ කුශලකර්‍ම පථ) ධර්‍මයට ම බුහුමන් කරමින්, (දශ කුශලකර්‍ම පථ) ධර්‍මය ම පුදමින්, (දශ කූශලකර්‍ම පථ) ධර්‍මය ම යටත් පැවැත්ම දක්වමින්, (දශ කූශලකර්‍ම පථ) ධර්‍මය ම ධ්වජයක් සේ පෙරටු කැරැගත්තෙක් වැ, (දශ කුශලකර්‍ම පථ) ධර්‍මය ම කුන්තයක් සේ ඔසොවා ගත්තෙක් වැ (දශ කුශලකර්‍ම පථ) ධර්‍මය ම ආධිපත්‍යය කොට ඇත්තෙක් වැ, (හැම ක්‍රියාවක දශ කුශලකර්‍ම පථ වශයෙන්ම කරන්නෙක් වැ) (පුත්‍ර දාරාදි) අන්තෝජනයා කෙරෙහි ධාර්මික වූ රක්ෂාවරණගුප්තිය සංවිධාන කරව.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ධර්‍මය ම ඇසුරු කොට … බලසෙන් කෙරෙහි ධාර්මික වූ රක්ෂාවරණගුප්තිය සංවිධානය කරව.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ධර්‍මය ම ඇසුරු කොට … යටත් වූ අනුයුක්ත ක්ෂිත්‍රයයන් කෙරෙහි ද ධාර්මික වූ රක්ෂාවරණගුප්තිය සංවිධාන කරව.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "103"
            },
            {
                "format": 13,
                "text": "ධර්‍මය ම ඇසුරු කොට … බමුණන් කෙරෙහි ද ගැහැවියන් කෙරෙහි ද ධාර්මික වූ රක්ෂාවරණගුප්තිය සංවිධාන කරව.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ධර්‍මය ම ඇසුරු කොට … නියම්ගම්වැසි දනවුවැසි ජනයා කෙරෙහි ද ධාර්මික වූ රක්ෂාවරණගුප්තිය සංවිධාන කරව.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ධර්‍මය ම ඇසුරු කොට … මහණුන් කෙරෙහි ද (බාහිත පාපි) බමුණන් කෙරෙහි ද ධාර්මික වූ රක්ෂාවරණගුප්තිය සංවිධාන කරව.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ධර්‍මය ම ඇසුරු කොට … මෘගපක්ෂීන් කෙරෙහි ද ධාර්මික වූ රක්ෂාවරණගුප්තිය සංවිධාන කරව.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "දරුව, තගේ රටෙහි අධර්‍මක්‍රියා නොපවත්නා ලෙසට කටුයුතු සලසව.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "දරුව, තා රටෙහි යම් කෙනෙක් ධනය නැත්තාහු ද, ඔවුනට ධනය දෙව.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "දරුව, තා රටෙහි යම් මහණ බමුණු කෙනෙක් මදයෙන් හා ප්‍රමාදයෙන් වැළැක්කාහු, ක්ෂාන්තියෙහි ද සෞරත්‍යෙයෙහි ද (කායික වාචසික සුවරිතයෙහි ද) පිහිටියාහු එක ම තම සිත දමනය කෙරෙත් ද, එකම තම සිත සංහිඳුවත් ද, එක ම තම සිත පිරිනිවත් ද, ඔවුන් කරා කලින් කලැ එළැඹ, “වහන්ස, කුසල් කවර යැ? අකුසල් කවර යැ? වරද කවර යැ? නිවරද කවර යැ? සෙවියැ යුත්ත කවර යැ? නොසෙවියැ යුත්ත කවර යැ? මා කරන කිමෙක් නම් බොහෝ කලක් අවැඩ පිණිස දුක් පිණිස පවත්නේ ද? මා කරන කිමෙක් හෝ බොහෝ කලක් වැඩ පිණිස සුව පණිස පවත්නේ දැ?” යි නැවත නැවත විචාරව පුන පුනා ප්‍රශ්න කරව. ඔවුන් කී බස් අසා යමෙක් අකුසල් වේ ද, එය බැහැර කරව. යමෙක් කුසල් වේ ද, එය සමාදන් කොට ගෙන පවතුව. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "දරුව, මේ අරී සක්විතිවත නම් වේ” යැ යි රාජර්ෂි කී ය."
            },
            {
                "format": 13,
                "text": "“එසේ යැ දේවයිනි”යි කියා ම, මහණෙනි, මුදුනැ අබිසෙස් ලත් ඒ කැත් රජ රාජර්ෂිහට පිළිවදන් දී අරී සක්විති වතෙහි පැවැත්තේ ය. අරී සක්විති වත්හි පවත්නා, ඒ පසොළොස්වක් පුණු පොහෝදා හිස සෝදා නා, සමාදන් කොට ගත් පෙහෙවස් ඇති වැ, පහයැ මතු මහල් තලයට නැංගාවූ ඔහුට දහසක් අර ඇති, නිම්වලලු සහිත, නැබ සහිත, හැම අයුරින් පිරිපුන් දෙව් සක්රුවන පහළ විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එය දැක්මෙන් මූර්ධාභිෂික්ත වූ ඒ කැත් රජුහට මේ සිත විය : ‘එ පුණුපොහෝ දින හිස සෝදා නා සමාදන් කොට ගත් පෙහෙවස් ඇති වැ පහයැ මතු මහල් තලයට නැගී හුන්, අරී සක්විති වත්හි පවත්නා මුදුනැ අබිසෙස් ලත් යම් කැත් රජක්හට දහසක් අර ඇති නිම්වළලු සහිත, නැබ සහිත, හැම අයුරින් පිරිපුන් දෙව් සක්රුවන පහළ වේ ද, හෙ තෙමේ සක්විති රජ වේ යැ” යි මෙය මා විසින අසන ලදී. මම් සක්විති රජ වන්නෙම් දෝ?’ යි යනු ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "105"
            },
            {
                "format": 13,
                "text": "5. මහණෙනි, ඉක්බිති මූර්ධාභිෂික්ත වූ ඒ කැත් රජ තෙම හුනස්නෙන් නැගී, උතුරු සළුව එකස් කොට පෙරෙවැ, වම් අතින් කෙංඩිය ගෙන, ‘භවත් චක්‍රරත්නය පෙරැළේ වා, භවත් චක්‍රරත්නය දිශාවෙන් දිනා ව’ යි දකුණතින් සක්රුවනට දිය ඉස්සේ ය. මහණෙනි, එ කලැ ඒ සක්රුවන පෙර දෙසට පෙරැළිණ. සක්විති රජ ද සිවුරග සෙන් හා එය අනුව ම ගියේ ය. මහණෙනි, යම් පෙදෙසෙක සක් රුවන පිහිටියේ ද, සක්විති රජ එ තන්හි සිවුරඟ සෙන් හා වුසුම් ගත්තේ ය. මහණෙනි, පෙර දෙසැ යම් පිළිමල් රජ කෙනෙක් වුහු ද, ඔහු සක්විති රජු කරා එළැඹ, ‘මහරජුනි, වඩින්න, මහරජුනි, ඔබ මෙහි වැඩි නියා යහපත. මහරජුනි, මේ සියල්ල ඔබ සතු ය. මහරජුනි, අපට අනුශාසන කරන්නැ’ යි කීහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එ විට සක්විති රජ ඔවුන් බණවා,",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“ප්‍රාණවධ නො කටයුතු, අයිනාදන් නො කට යුතු, කාමයන්හි වරදවා නො හැසිරියැ යුතු, මුසවා නො බිණියැ යුතු, මත් පැන් නො පියැ යුතු, තමන් සතු දෑ පරිභෝග කළ පරිදි ම දැහැමෙන් පරිභෝග කරවු” යැ යි මෙසේ කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි පෙර දෙසැ යම් පිළිමල් රජ කෙනෙක් වුහු ද, ඔහු සක්විති රජුට අනුකූල වූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ඉක්බිති සක්රුවන පෙරදිගැ මුහුද වැද ගොඩ නැඟ දකුණු දිගට පෙරැළිණ … දකුණු දිග යම් පිළිමල් රජ කෙනෙක් වුහු ද, ඔහු සක්විති රජුට අනුකූල වූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ඉක්බිති ඒ සක්රුවන දකුණු දිග මුහුද වැද ගොඩ නැඟ පැසිම් දිගට පෙරැළිණ. එය අනුව ම සක්විති රජ සිවුරඟ සෙන් හා ගියේ ය. මහණෙනි, යම් පෙදෙසෙක දෙව් සක්රුවන පිහිටියේ ද, සක්විති රජ එහි සිවුරඟ සෙන් හා ලැගුම් ගත්තේ ය. මහණෙනි, පැසිම් දිගැ යම් පිළිමලා රජ කෙනෙක් වුහු ද, ඔහු සක්විති රජු කරා එළැඹ, ‘මහරජුනි, වඩින්න. මහරජුනි, ඔබ වැඩි සේ යහපත. මහරජුනි, මේ සියල්ල ඔබ සතු ය. මහරජුනි, අනුශාසනා කරන්නැ’ යි කීහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "107"
            },
            {
                "format": 13,
                "text": "එ විටැ සක්විති රජ,",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘ප්‍රාණවධ නො කළ යුතු, අයිනාදන් නොකළ යුතු, කාමමිථ්‍යාචාර නො කළ යුතු, මුසවා නොබිණියැ යුතු, මත් පැන් නො පියැ යුතු. තමන් පරිභෝග කළ රට එ පරිද්දෙන් ම පරිභොග කරවු’ යැ යි මෙසේ කී ය. මහණෙනි. පැසිම් දිගැ යම් පිළිමල් රජ කෙනෙක් වුහු ද, ඔහු ඒ සක්විති රජු අනුව යන්නෝ වූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ඉක්බිත්තෙන් ඒ සක්රුවන පැසිම් මුහුද වැද ගොඩ නැඟ, උතුරු දෙසට පෙරැළිණ. සක්විති රජ ද එය අනුව ම සිවුරඟ සෙන් හා ගියේ ය. මහණෙනි, යම් පෙදෙසක දෙව් සක්රුවන රැදුණේ ද, සක්විති රජ සිවුරඟ සෙන් හා එහි වාසයට එළැඹියේ ය. මහණෙනි, උතුරු දිගැ යම් පිළිමල් රජ කෙනෙක් වූහු ද ඔහු සක්විති රජහු කරා එළැඹ, ‘මහරජුනි, වඩින්න. මහරජුනි, ඔබ වැඩි සේ යහපත. මහරජුනි, මෙ හැම ඔබ සතු ය. මහරජුනි, අනුශාසනා කළ මැනවැ’ යි කීහ. සක්විති රජ ඔවුන් බණවා: ‘පණිවා නො කළ යුතු, අයිනාදන් නොකළ යුතු, කාමයන්හි වරදවා නො හැසිරියැ යුතු, මුසවා නොබිණියැ යුතු, මත්පැන් නො පියැ යුතු, වැළඳු පරිදි ම සිය රට වළඳවු’ යැ යි මෙසේ කී ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි. උතරු දෙසැ යම් පිළිමල් රජ කෙනෙක් වුහු නම්, ඔහු සක්විති රජහු අනුවැ යන්නෝ වූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "6. මහණෙනි, ඉක්බිත්තෙන් ඒ සක්රුවන මුහුදුහිම් පොළොව දිනා, ඒ රජදහනට ම පෙරළා අවුත්, සක්විති රජුහුගේ ඇතොවරු බබලවනුයේ, ඇතොවුර දොරැ යුක්ති පසිඳිනා හලැ අක්දෙරියෙහි අකුර ගැසුවාක් මෙන් සිටියේ ය …",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, දෙවෙනි සක්විති රජ ද … තෙවෙනි සක්විති රජ ද … සතර වැනි සක්විති රජ ද … පස්වැනි සක්විති රජ ද … සවැනි සක්විති රජ ද … සත්වැනි සක්විති රජ ද බොහෝ හවුරුදු ගණනක්, බොහෝ හවුරුදු සිය ගනණක්, බොහෝ හවුරුදු දහස් ගණනක් ඇවෑමෙන් එක්තරා මිනිසකු බණවා, ‘හෙම්බා පුරුෂය, තෝ යම් විටෙක දෙව් සක්විති රුවන තුබූ තැනින් ඉවත් වැ සිටියැ, තුබූ තැනින් පහ වැ සිටියැ දුටුයෙහි වී නම්, එවිට මට දන්වව’ යි කී ය. ‘එසේ ය, දේවයිනි’ යි එ රජුහු බස මුදුනින් පිළිගත. මහණෙනි, හේ පුරිස් තෙම බොහෝ හවුරුදු ගණනක්, බොහෝ හවුරුද සිය ගණනක්, බොහෝ හවුරුදු දහස් ගණනක් ඇවෑමෙන් දෙව් සක්රුවන තුබූ තැනින් ඉවත් වූවා, පහ වැ සිටියැ දිටී ය. දැක, සක්විති රජු කරා එළැඹ, ‘දේවයිනි, දැනගන්න, ඔබගේ දෙව් සක්රුවන ඉවත් විය, තුබූ තැනින් පහ වියැ’ යි සැළ කෙළේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "109"
            },
            {
                "format": 13,
                "text": "7. මහණෙනි, එ කලැ සක්විති රජ තෙම දෙටුපුත් කුමරහු බණවා, ‘දරුව, මගේ දෙව් සක්රුවන ඉවත් වී ල, තුබූ තැනින් පහ වී ල. යම් සක්විති රජක්හුගේ දෙව් සක්රුවන ඉවත් වේ ද, තුබු තැනින් පහ වේ ද, දැන් එ සක්විති රජුහු විසින් බොහෝ කල් ජීවත් වියැ හැකි නො වේ’ යැ යි මෙය මා විසින් අසන ලද. මිනිසුන් විසින් වින්දැයුතු කාමයෝ මා විසින් විඳුනා ලදහ. දැන් දෙව් කම් සැපත් සොයන්නට කල් පැමිණියේ වෙයි. දරුව, කුමාරය, මෙහි එව. මේ මුහුදුහිම් පොළොව තෝ අනුභව කරව. මම් වනාහි කෙහෙ රවුලු බහවා, කසාවත් හැඳ, ගිහි ගෙන් පැවිදි බිමට වදනෙමි’ යි කී ය. මහණෙනි, ඉක්බිති සක්විති රජ තෙම දෙටුපුත් කුමරහට රජයෙහි මොනවට අනුසැස, කෙහෙ රවුලු බහවා, කසාවත් හැඳ, ගිහි ගෙන් නික්මැ පැවිදි බිම් වනි. මහණෙනි, ඒ රාජර්ෂීහු පැවිදි වැ සතියක් ගිය කලැ දෙව් සක්රුවන අතුරුදහන් විය. මහණෙනි, එකලහි එක්තරා පුරුෂයෙක් … දෙව් සක්රුවන අතුරුදහන් වී යැ’යි රජහට දැන්වී ය. මහණෙනි, ඉක්බිති මුදුනැ අබිසෙස් ලත් එ කැත් රජ තහෙම දෙව් සක්රුවන අතුරුදහන් වූ කල්හි නො සතුටු විය. නො සතුටු බව පළ කෙළේ ය. එහෙත් රාජර්ෂීහු කරා එළැඹ අරී සක්විතිවත් නො විචාළේ ය. හේ සිය මතයෙන් ම රට පාලනය කෙරෙයි. සිය මතයෙන් ම රට පාලනය කරන ඔහුගේ දනවුහු පසු කලැ අරී සක්විති වත්හි පවත්නා පෙරැසිටි රජුන්ගේ දනවු සෙයින් නො වැඩෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "8. මහණෙනි, එ කල්හි ඇමැතියෝ ද රාජපර්ෂද්හි වූවෝ ද ගණකයෝ ද මහාමාත්‍රයෝ ද බල ඇණිහි සිටුනා හස්ත්‍යාචාර්යාදිහු ද දොරටුපල්හු ද මන්ත්‍රාජීවිහු (උපදෙස් දෙන්නෝ) ද එක් රැස් ව මූර්ධාභිෂික්ත කැත් රජුහු කරැ එළැඹ “දේවයිනි, ස්වමතයෙන් රට පාලනය කරන ඔබගේ දනුවුහු පෙරැ සිටි අරී සක්විති වත්හි පැවැති රජුන්ගේ දනවු සෙයින් නො වැඩෙත්. දේවයිනි, යම් බඳු වූ අපිත් අන්‍යයෝත් අරී සක්විති වත් සිත්හිලා දරමෝ ද, එසේ වූ ඇමතියෝ ද රාජපර්ෂදට අයත්හු ද ගණකයෝ ද මහාමාත්‍යයෝ ද අනීකස්ථයෝ ද මන්ත්‍රාජීවිහු ද ඔබ රටැ ඇත්හ. එබැවින් දේවයිනි, ඔබ අරී සක්විතිවත් අප විචාරන්න. ඔබ විසින් අරී සක්විති වත් විචාරනු ලැබූ අපි ඔබට එය පවසන්නමෝ වෙ දැ” යි කීහ.",
                "type": "paragraph"
            },
            {
                "format": 21,
                "text": "ආයුෂ පිරිහීම පිළිබඳ කථා",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ඉක්බිත්තෙන් ඒ මූර්ධාභිෂික්ත කැත් රජ ඇමතියන් ද රාජපර්ෂදෙහි වූවන් ද ගණකයන් ද මහාමාත්‍රයන් ද අනිකස්ථයන් ද ද්වාරපාලයන් ද මන්ත්‍රාජීවින් ද රැස් කරවා, අරී සක්විති වත් විචාළේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "111"
            },
            {
                "format": 13,
                "text": "එ රජහු විසින් අරී සක්විති වත් පුළුවුස්නා ලද ඔහු ඔහුට එය පැවැසූහ. හෙ තෙමෙ ඔවුන් කී බස් අසා දැහැමි රකවළ යෙදී ය. වැලි දිළින්දනට ධනය නො දුන්නේය. දිළින්දනට ධනය නො දෙනු ලබන කල්හි දිළිඳු බව විපුලත්වයට පැමිණියේ ය. දිළිඳු බව මහත් වැ ගිය කල්හි එක්තරා මිනිසෙක් අනුන් සතු නොදුන් දැයක් සොර සිතින් ගත්තේ ය. මිනිස්සු ඔහු අල්ලා ගත්හ. අල්ලා ගෙන මුදුනැ අබිසෙස් ලත් ඒ කැත් රජහට ‘දේවයිනි, මෙ පුරිස් තෙම මෙර මා සතු නො දුන් දැයක් සොර සිතින් ගත්තේ යැ’ යි දැක්වූ හ. මහණෙනි, මෙසේ ඔවුන් කී කලැ, මූර්ධාභිෂික්ත ඒ කැත් රජ ‘එම්බා පුරුෂය, සැබෑ ද? තෝ මෙරමා සතු දැයක් සොර සිතින් ගත්තෙහි දැ?’ යි රජ පුළුවුත. ‘සැබෑව, දේවයිනි’ යි හේ කිව. ‘කවර හෙයිනැ?’ යි රජ පුළුවුත. ‘දේවයිනි, දිවි රකිනු නො හැක්කෙමි’ යි හේ කිව.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "9. මහණෙනි, එක ලැ ඒ මූර්ධාභිෂික්ත කැත් රජ ‘එම්බා පුරුෂය, තෝ මේ ධනයෙන් තෙමේ ද ජීවත්වව මා පියන් ද පෝෂිත කරව, අඹු දරුවන් ද පෝෂිත කරව, කර්‍මාන්ත ද යොදව, මහණුන් කෙරෙහි බමුණන් කෙරෙහි සගසුවට හිත වූ, සැප විපාක දෙන, සුගතිය පිණිස පවත්නා, මතු මතු බිම්හි පල දෙන දක්ෂිණාව පිහිටුවව’ යි කියා, ඒ පුරුෂයාට ධනය දුන්නේ ය. මහණෙනි, ‘එසේ ය, දේවයිනි’ යි කියා ම ඒ පුරුෂ තෙම ඒ මූර්ධාභිෂික්ත කැත් රජුහු බස මුදුනින් පිළිග්තේ ය. මහණෙනි, අන් එක්තරා පුරුෂයෙක් ද මෙරමා සතු නොදුන් දෑ සොර සිතින් ගත්තේ ය. මිනිස්සු ඔහු අල්ලා ගත්හ. අල්ලාගෙන මූර්ධාභිෂික්ත කැත් රජහට ‘දේවයිනි, මේ පුරිස් මෙරමා සතු නොදුන් දෑ සොර සිතින් ගතැ’ යි දැක්වූහ. මෙසේ කී කලැ එ රජ ‘එම්බා පුරිස, තෝ මෙරමා සතු දෑ සොර සිතින් ගතුයෙහි සැබෑ දැ?’ යි විචාළේ ය. ‘සැබෑව දේවයිනි’ යි හේ කිව. ‘කවර හෙයිනැ?’ යි රජ විචාළේ ය. ‘දේවයිනි, දිවි පවත්වනු නො හැක්කෙමි’ යි හේ කිව. මහණෙනි, එ කලැ එ රජ ‘එම්බා පුරිස, මේ ධනයෙන් තෝ තෙම්ත් යැපෙව, මා පියන් ද පෝෂිත කරව, අඹු දරුවන් ද පෝෂිත කරව, කර්‍මාන්ත ද යොදව, මහණ බමුණන් කෙරෙහි මතු මත්තෙහි පල දෙන, සුගතියට හිත වූ, සඟ සුව පිණිස පවත්නා දක්ෂිණාව පිහිටුවව, (දන් දෙව)’ යි ඒ මිනිසාට ධනය දුන්න ය. ‘එසේ ය, දේවයිනි’ යි කියා ම හේ පුරිස් තෙම ඒ රජු බස මුදුනෙන් පිළිගත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘භවත්නි, යම් කෙනෙක් මෙරමා සතු ධනය සොරා ගනිත් ද, ඔවුනට රජ තෙම ධනය දෙන්නේ යැ’ යි මිනිස්සු ඇසූහ. ඇසීමෙන්, ඔවුනට අපිත් මෙරමා සතු දෑ සොර ගනුමෝ නම් යෙහෙකැ’ යි මේ සිත විය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "113"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එ කල්හි එක්තරා පුරුෂයෙක් මෙරමා සතු දැයක් සොරා ගත්තේ ය. මිනිස්සු ඔහු අල්ලා ගත්හ. අල්ලා ගෙන ‘දේවයිනි, මේ පුරිස් තෙම මෙරමා සතු දෑ සොර සිතින් ගත්තේ යැ’යි රජුහට දැක්වී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘සැබෑ ද? තෝ මෙරමා සතු දැය සොරා ගත්තෙහි දැ?’ යි රජ පුළුවුත. ‘ එසේ යැ දේවයිනි’ යි හේ කී ය. ‘කවර හෙයින් දැ?’ යි රජ පුළුවුත. ‘දේවයිනි, දිවි පැවැත්විය නො හැක්කෙමි. එ හෙයිනැ’යි හේ කිව. එ විට ‘මෙරමා සතු දැය සොරා ගන්නා ගන්නා හැම එකකුට ම මම් ධනය දෙන්නෙම් වීම් නම් මෙසේ මේ නොදුන් දෑ සොරා ගැන්ම වැඩෙන්නේ ය. මේ මිනිසා යලි අයිනාදන් නො කළ හැකි වන සේ කළෙම් නම්, මුලින් ම සිඳැලූයෙම් නම්, මොහුගේ හිස සිඳලූයෙම් නම් යෙහෙකැ’යි එ රජහට මේ සිත විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "10. මහණෙනි, ඉක්බිත්තෙන් ඒ මූර්ධාභිෂික්ත ක්ෂත්‍රිය රාජ තෙම ‘සගයෙනි, එසේ වී නම්, තෙපි මේ මිනිස් දැඩි රැහැනින් දෙ අත් පිටට කොට තරයේ බැඳ, කරයෙන් හිස මුඩු කොට, රළු හඬ ඇති පණා බෙර හඬින් යුක්ත කොට වීථියෙන් වීථියට මංසන්ධියන් මංසන්ධියට ගෙන ගොස්, දකුණු දොරින් නික්මවා, නුවරට දකුණු දික්හි දී යලි වරද නො කළ හැකි සේ කරවු. මුලින් ම සිඳීම කරවු, මොහු හිස සිඳිවු’ යැයි ඇණැවී ය. මහණෙනි, ඒ පුරුෂයෝ ‘එසේ ය, දේවයිනි’ යි කියා ම එ රජු බස මුදුනින් පිළිගෙන, ඒ මිනිසා දැඩි රැහැනින් දොහොත් පිටට කොට තරයේ බැඳ කරයෙන් හිස මුඩු කොට, රළු හඬ ඇති පණාබෙරින් යුක්ත කොට, වීථියෙන් වීථියට, මංහන්දියෙන් මංහන්දියට පමුණුවා, දකුණු දොරින් නික්මවා, නුවරට දකුණු දිගැදී යළි වරදක් නො කළ හැකියකු කළහ, ඔහු මුලින් සිඳැලූහ, ඔහු හිස සිඳැලූහ. මහණෙනි, ‘යම් කෙනෙක් මෙරමා සතු නොදුන් දෑ ගනිත් නම්, රජහු ඔවුන් යලි එ බඳු වරදක් නො කළ හැකි වන සේ කරති යි, ඔවුන් මුල් සිඳුමෙන් සිඳිති යි, ඔවුන් හිස සිඳලති’ යි මිනිස්සු ඇසූහ. ඇසීමෙන් ඔවුනට අපිත් තියුණු ආයුධ කරවන්නමෝ නම්, තියුණු ආයුධ කරවා, යම් කෙනකුන් සතු නොදුන් දෑ, ගනුමෝ නම්, ඔවුන් දිවි තොර කරන්නමෝ නම්, මුලින් සිඳලන්නමෝ නම්, ඔවුන් හිස් සිඳ ලන්නමෝ නම් මැනැව’ යි සිත විය. ඔහු තියුණු අවි කැරැවූහ. තියුණු අවි කරවා, ගම් වොලෝ ගන්නට ද පටන් ගත්හ, නියම්ගම් වොලෝ ගන්නට ද පටන් ගත්හ. නුවරවල් වොලෝ ගන්නට ද පටන්ගත්හ. මං පැහැරීම කරන්නට ද පටන්ගත්හ. ඔහු යම් කෙනෙකුන් සතු දෑ සොරා ගනිත් ද, ඔවුන් දිවි තොර කෙරෙත්, මුලින් සිඳීම කෙරෙත්, ඔවුන් හිස සිඳීත්. මහණෙනි, මෙසේ දිළින්දනට ධනය දෙනු නො ලබන කල්හි දිළිඳු බව වැඩීමට ගියේ ය. දිළිඳු බව වැඩීමට ගිය කල්හි නොදුන් දෑ සොරා ගැන්ම වැඩීමට ගියේ ය. නොදුන් දෑ සොරා ගැන්ම වැඩීමට ගිය කල අවි දැරීම වැඩීමට ගියේ ය. අවි දැරීම වැඩීමට ගිය කල්හි ප්‍රාණඝාතය වැඩීමට ගියේ ය. ප්‍රාණඝාතය වැඩීමට ගිය කල්හි ඒ සත්වයන්ගේ ආයුෂ ද පිරිහිණ, වර්ණය ද පිරිහිණ, අසූදහසක් හවුරුදු ආයුෂ ඇති, ආයුෂයෙන් ද පිරිහෙන, වර්ණයෙන් ද පිරිහෙන මිනිසුන්ගේ දරුවෝ හවුරුදු සතළිස් දහසක් ආයුෂ ඇත්තෝ වූහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "115"
            },
            {
                "format": 13,
                "text": "11. මහණෙනි, සතළිස් දහසක් අවුරුදු ආයු ඇති මිනිසුන් අතුරෙහි එක්තරා පුරුෂයෙක් අනුන් සතු නොදුන් දැයක් සොරා ගත්තේ ය. මිනිස්සු ඔහු අල්ලා ගත්හ. අල්ලා ගෙන මුර්ධාභිෂික්ත කැත් රජහට ‘දේවයිනි, මේ පුරිස් තෙම මෙරමා සතු දෑ සොරා ගත්තේ’ යැයි දැක්වූහ. මහණෙනි, ඔවුන් එසේ කී කල්හි එ රජ ‘එම්බා පුරිස, තෝ මෙරමා සතු දෑ සොරා ගත්තෙහි ද? ඒ සැබෑ දැ?’ යි පුළුවුත. ‘දේවයිනි, නැතැ’ යි (සොරා නො ගතිමියි) හේ දැන බොරු කීයේ ය. මහණෙනි, මෙසේ දිළින්දනට ධනය නොදෙනු ලබන කලැ අයිනාදන් වැඩීමට ගියේ ය. අයිනාදන වැඩීමට ගිය කලැ අවි දැරීම වැඩීමට ගියේ ය. අවි දැරීම වැඩීමට ගිය කලැ ප්‍රාණවධය වැඩීමට ගියේ ය. ප්‍රාණවධය වැඩීමට ගිය කලැ බොරුකීම වැඩීමට ගියේ ය. බොරුකීම වැඩීමට ගිය කලැ ඒ සත්වයන්ගේ ආයුෂ ද පිරිහිණ, වර්ණය ද පිරිහිණ. ආයුෂයෙන් ද පිරිහෙන, වර්ණයෙන් ද පිරිහෙන සතලිස්දහසක් හවුරුදු පරමායු ඇති ඒ මිනිසුන්ගේ දරුවෝ විසිදහස් හවුරුදු ආයු ඇත්තෝ වූහ. මහණෙනි, විසිදහස් හවුරුදු ආයු ඇති ඒ මිනිසුන් අතුරෙහි එක්තරා මිනිසෙක් අනුන් සතු දැයක් සොරා ගත්තේ ය. එක්තරා පුරුෂයෙක් රජුහට ‘දේවයිනි, මෙ නම් පුරුෂයා මෙරමා සතු දෑ සොරා ගත්තේ යැ’ යි ඔහු ඇරැබැ කේලාම් කී ය. මහණෙනි, මෙසේ දිළින්දනට ධනය නො දෙනු ලබන කල්හි දිළිඳු බව වැඩීමට ගියේ ය. දිළිඳු බව වැඩීමට ගිය කලැ අයිනාදන් වැඩීමට ගියේ ය. අයිනාදන් වැඩීමට ගිය කලැ අවි දැරීම වැඩීමට ගියේ ය. අවි දැරීම වැඩීමට ගිය කලැ ප්‍රාණවධය වැඩීමට ගියේ ය. ප්‍රාණවධය වැඩීමට ගිය කලැ මුසාවාදය වැඩීමට ගියේ ය. මුසාවාදය වැඩීමට ගිය කලැ කේලාම් කීම වැඩීමට ගියේ ය. කේලාම් කීම වැඩීමට ගිය කලැ ඒ සතුන්ගේ ආයුෂ ද පිරිහිණ, වර්ණය ද පිරිහිණ. ආයුෂයෙන් ද පිරිහෙන වර්ණයෙන් ද පිරිහෙන හවුරුදු විසිදහසක් ආයු ඇති ඒ මිනිසුන්ගේ දරුවෝ අවුරුදු දසදහසකට ආයු ඇත්තෝ වූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "12. මහණෙනි, අවුරුද දස දහසක් ආයු ඇති මිනිසුන් අතුරෙහි ඇතැම් සත්හු වර්ණවත් වෙත්, ඇතැම් කෙනෙක් දුර්‍චර්‍ණ වෙත්, ඔවුන් අතුරෙන් යම් සත්ව කෙනෙක් දුර්‍වර්‍ණ ද, ඔහු වර්‍ණවත් සත්වයන් දෙස සරාග සිතින් බලන්නාහු, ඒ මෙරමා අඹුවන් කෙරෙහි වරදවා හැසිරෙන බවට පැමිණියහ. මහණෙනි, මෙසේ දිළින්දනට ධනය නො දෙනු ලබන කල්හි දිළිඳු බව වැඩීමට පැමිණියේ ය. දිළිඳු බව වැඩීමට පැමිණි කල්හි … කාමයන්හි වරදවා හැසිරීම වැඩීමට ගියේ ය. කාමයන්හි වරදවා හැසිරීම වැඩීමට ගිය කල්හි ඒ සත්වයන්ගේ ආයුෂ ද පිරිහිණ, වර්‍ණය ද පිරිහිණ. ආයුෂයෙන් ද පිරිහෙන, වර්‍ණයෙන් ද පිරිහෙන හවුරුදු දස දහසක් ආයු ඇති මිනිසුන්ගේ දරුවෝ හවුරුදු පන්දහසක් ආයු ඇත්තෝ වූහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "117"
            },
            {
                "format": 13,
                "text": "13. මහණෙනි, පන්දහසක් හවුරුදු ආයු ඇති මිනිසුන් අතුරෙහි පරුෂ වචනය ද සම්ඵප්‍රලාප ද යන දෙ අකුසල්හු වැඩීමට ගියහ. ඒ දෙ අකුසල් වැඩීමට කිය කලැ ඒ සත්වයන්ගේ ආයු ද පිරිහිණ, වර්‍ණය ද පිරිහිණ. ආයුෂයෙන් ද පිරිහෙන වර්‍ණයෙන් ද පිරිහෙන, හවුරුදු පන්දහසක් ආයු ඇති මිනිසුන්ගේ ඇතැම් දරුවෝ හවුරුදු දෙදහස් පන්සියක් ද ඇතැම් දරුවෝ හවුරුදු දෙදහසක් ද ආයු ඇත්තෝ වූහ. මහණෙනි, හවුරුදු දෙදහස් පන්සියක් ආයු ඇති මිනිසුන් අතුරෙහි අභිධ්‍යාවත් ව්‍යාපාදයත් යන දෙ අකුසල් දහම්හු වැඩීමට පැමිණියහ. අභිධ්‍යා ව්‍යාපාදයන් වැඩීමට ගිය කල්හි ඒ සත්වයන්ගේ ආයු ද පිරිහිණ, පැහැය ද පිරිහිණ. ආයුෂයෙන් ද වර්‍ණයෙන් ද පිරිහෙන ඒ වර්ෂ දෙදහස් පන්සියක් ආයු ඇති මිනිසුන්ගේ දරුවෝ වර්ෂ දහසක් ආයු ඇත්තෝ වූහ. මහණෙනි, වර්ෂ දහසක් ආයු ඇති මිනිසුන් අතුරෙහි මිථ්‍යා දෘෂ්ටිය වැඩීමට ගියේ ය. මිත්‍යා දෘෂ්ටිය වැඩීමට ගිය කලැ ඒ සතුන්ගේ ආයුෂ ද පිරිහිණ, වර්‍ණය ද පිරිහිණ. ආයුෂයෙන් ද පිරිහෙන, වර්‍ණයෙන් ද පිරිහෙන, වර්ෂ දහසක් ආයු ඇති මිනිසුන්ගේ දරුවෝ හවුරුදු පන්සියක් ආයු ඇත්තෝ වූහ. මහණෙනි, හවුරුදු පන්සියක් ආයු ඇති මිනිසුන් අතුරෙහි අධර්ම රාගය ද විෂම ලෝභය ද මිථයාධර්මය ද යන තුන් අකුසල ධර්මයෝ වැඩීමට ගියහ. ඒ තුන් අකුශල ධර්මයන් වැඩීමට ගිය කල්හි, ඒ සත්වයන්ගේ ආයුෂ ද පිරිහිණ, වර්‍ණය ද පිරිහිණ. ආයුෂයෙන් ද පිරිහෙන, වර්‍ණයෙන් ද පිරිහෙන පන්සියක් හවුරුද ආයු ඇති ඒ මිනිසුන්ගේ ඇතැම් දරුවෝ දෙසිය පනසක් හවුරුදු ආයු ඇත්තෝ වූහ. ඇතැම් දරුවෝ දෙසියයක් හවුරුදු ආයු ඇත්තෝ වූහ. මහණෙනි, හවුරුදු දෙසිය පනසක් ආයු ඇති මිනිසුන් කෙරෙහි මවට සත්කාර නො කරන බව, පියාට සත්කාර නො කරන බව, මහණුනට ගරු නො කරන බව, බමුණනට ගරු නො කරන බව, කුලෙහි වැඩි සිටියනට යටත් පැවැතුම් නැති බව යන මේ ලාමක දහම්හු වැඩීමට පැමිණියහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "14. මහණෙනි, මෙසේ දිළින්දනට ධනය නොදෙනු ලබන කල්හි, දිළිදු බව වැඩීමට ගියේ ය. දිළිඳු බව වැඩීමට ගිය කල්හි අදත්තාදානය වැඩීමට ගියේ ය. අදත්තාදානය වැඩීමට ගිය කල්හි ආයුධ වැඩීමට ගියේ ය. ආයුධ වැඩීමට ගිය කල්හි ප්‍රාණඝාතය වැඩීමට ගියේය. ප්‍රාණඝාතය වැඩීමට ගිය කල්හි මුසාවාදය වැඩීමට ගියේ ය. මුසාවාදය වැඩීමට ගිය කල්හි පිසුණාවාචාව (කේලාම් කීම) වැඩීමට ගියේ ය. පිසුණාවාචාව වැඩීමට ගිය කල්හි කාමමිථ්‍යාචාරය වැඩීමට ගියේ ය. කාමමිථ්‍යාචාරය වැඩීමට ගිය කල්හි පරුෂ වචනයත් සම්ඵප්‍රලාපයත් යන දෙ අකුසල්හු වැඩීමට ගියහ. ඒ දෙඅකුසල් වැඩීමට ගිය කල්හි, අභිධ්‍යාවත් ව්‍යාපාදයත් වැඩීමට ගියහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "119"
            },
            {
                "format": 13,
                "text": "අභිධ්‍යාව්‍යාපාදයන් වැඩීමට ගිය කල්හි මිථ්‍යාදෘෂ්ටිය වැඩීමට ගියේ ය. මිථ්‍යාදෘෂ්ටිය වැඩීමට ගිය කල්හි අධර්මරාග, විෂමලෝභ, මිථ්‍යාධර්ම යන තුන් ලාමක ධර්මයෝ වැඩීමට පැමිණියහ. ඒ තුන් දහමුන් වැඩීමට ගිය කල්හි, මවට සත්කාර නොකරන බව, පියාට සත්කාර නොකරන බව, මහණුනට ගරු නො කිරීම, බමුණනට ගරු නොකරීම, කුලෙහි වැඩි සිටියනට යටත් පැවැතුම නැති බව යන මේ පාපධර්මයෝ වැඩීමට ගියහ. මේ පාපධර්මයන් වැඩීමට ගිය කල්හි, ඒ සත්වයන්ගේ ආයුෂ ද පිරිහිණ, වර්‍ණය ද පිරිහිණ. ආයුෂයෙන් ද පිරිහෙන, වර්‍ණයෙන් ද පිරිහෙන හවුරුදු දෙසියපනසක් ආයු ඇති මිනිසුන්ගේ දරුවෝ හවුරුදු සියයක් ආයු ඇත්තෝ වූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "15. මහණෙනි, මේ මිනිසුන්ගේ දරුවෝ යම් කලෙක දස හවුරුද පරමායු ඇත්තෝ වෙත් ද, එසේ වූ කාලයෙක් වන්නේ ය. මහණෙනි, දසවස් ආයු ඇති මිනිසුන් අතුරෙහි, පස් හැවිරිදි කුමරියෝ පතිකුලයට යෑමට සුදුසු වන්නාහ. මහණෙනි. දශවර්ෂායුෂ්ක මිනිසුන් අතුරෙහි ගිතෙල් වෙඬරු තලතෙල් මී සකුරු ලුණු යන මේ රසයෝ අතුරුදහන් වන්නාහ. මහණෙනි, දශවර්ෂායුෂ්ක මිනිසුන් අතුරෙහි කුද්‍රෑසක ධාන්‍යය (හමු) බොජුන් අතුරෙහි අග්‍ර වන්නේ ය. මහණෙනි, දැන් මස සහිත හැල් සාල් බත මිනිසුන්ගේ පිළිගැන්ම පරිදි බොජුන් අතුරෙහි අග්‍ර වේ ද, එසේ ම දසවස් ආයු ඇති මිනිසුන් කෙරෙහි කුද්‍රෑසක ධාන්‍යය (හමු) බොජුන් අතුරෙන් අග්‍ර වන්නේ ය. මහණෙනි, දස වස් ආයු ඇති මිනිසුන් අතුරෙන් දශකුශල කර්මපථයෝ හැම ලෙසින් ම අතුරු දහන් වන්නාහ. දශ අකුශල කර්මපථ ඉතා ම දීප්ත වන්නාහ. මහණෙනි, දශවර්ෂ යුෂ්ක මිනිසුන් කෙරෙහි කුශල යැ යන නම පවා නො වන්නේ ය. කුසල් කරන්නෙක් කොයින් වේ ද? මහණෙනි, දශවර්ෂායුෂ්ක මිනිසුන් අතුරෙහි යම් කෙනෙක් මවට ගරු නො කරනුවෝ, පියාට ගරු නො කරනුවෝ, මහණුනට ගරු නො කරනුවෝ, බමුණනට ගරු නො කරනුවෝ, කුලෙහි වැඩි සිටියනට යටත් පැවැතුම් නැත්තෝ වෙත් ද, ඔහු පූජ්‍ය ද ප්‍රශංසාර්හ ද වන්නාහ. මහණෙනි, මෙ කලැ මව කෙරෙහි මොනොවට පිළිපදනාහු, පියා කෙරෙහි මොනොවට පිළිපදනාහු, මහණුන් කෙරෙහි මොනොවට පිළිපදනාහු, බමුණන් කෙරෙහි මොනොවට පිළිපදනාහු, කුලයෙහි වැඩි සිටියනට යටත් පැවැතුම් ඇතියාහු යම්සේ පූජ්‍යයත් ප්‍රශංසාර්හත් වෙත් ද, මහණෙනි, එ සේ ම දශවර්ෂායුෂ්ක මිනිසුන් අතුරෙහි යම් කෙනෙක් මව කෙරෙහි මොනොවට නො පිළිපදනාහු ද, පියා කෙරෙහි මොනොවට නො පිළිපදනාහු ද, මහණුන් කෙරෙහි මොනොවට නො පිළිපදානාහු ද, බමුණන් කෙරෙහි මොනොවට නො පිළිපදනාහු ද, කුලයෙහි වැඩි සිටියනට යටත් පැවැතුම් නැතියාහු ද, ඔහු පුජ්‍ය ද ප්‍රශංසාර්හ ද වන්නාහ. මහණෙනි, දශවාර්ෂයුෂ්ක මිනිසුන් කෙරෙහි මෑණියෝ යැ යි හෝ සුළු මෑණියෝ යි නැන්දැණියෝ යි හෝ ඇදුරු බිරින්දෑ යි හෝ සුළු පිය දෙටුපිය ආදින්ගේ බිරියෝ යි කියා හෝ (හැඟීමෙක්) නො වන්නේ ය. එළුවෝ බැටෙළුවෝ කුකුළෝ හූරෝ බල්ලෝ කැණහිල්ලු යම්සේ ද, එසේ ම ලෝවැසි තෙමේ (කුලසීමාව බිඳ) මිශ්‍රභාවයට යන්නේ ය. (කුල සිරිත් නොතකා ඔවුන් පාවාගන්නාහ.)"
            },
            {
                "type": "page-break",
                "text": "121"
            },
            {
                "format": 13,
                "text": "16. මහණෙනි, දශවර්ෂායුෂ්ක මිනිසුන් අතුරෙහි, ඒ සත්වයන්ගේ උනුන් කෙරෙහි දැඩි වෛරයෙක්, දැඩි ව්‍යාපාදයෙක්. දැඩි මනඃප්‍රද්වේෂයෙක් දැඩි වධක චිත්තයෙක් එළැඹ සිටියේ වන්නේ ය. පුතු කෙරෙහි මවගේ ද, මව කෙරෙහි පුතුගේ ද, පුතු කෙරෙහි පියාගේ ද, පියා කෙරෙහි පුතුගේ ද, බෑයා කෙරෙහි බෑයාගේ ද, බිහිනිය කෙරෙහි බෑයාගේ ද, බෑයා කෙරෙහි බිහිනියගේ ද, දැඩි ආඝාතයෙක්, දැඩි ව්‍යාපාදයෙක්, දැඩි චිත්ත ප්‍රද්වේෂයෙක්, දැඩි වධක චිත්තයෙක් එළැඹ සිටියේ වන්නේ ය. මහණෙනි, යම්සේ මුවවැද්දකුට මුවකු දැක්මෙන් දැඩි ආඝාතයෙක්, දැඩි ද්වේෂයෙක්, දැඩි චිත්ත ප්‍රද්වේෂයෙක්, දැඩි වධක චිත්තයෙක් එළැඹ සිතුනේ වේ ද, මහණෙනි, එසේ ම මිනිසුන් දශවර්ෂායුෂ්ක කල්හි ඒ සත්වයන්ගේ උනුන් කෙරෙහි දැඩි ආඝාතයෙක්, දැඩි ව්‍යාපාදයෙක්, දැඩි චිත්ත ප්‍රද්වේෂයෙක්, දැඩි වධක චිත්තයෙක් එළැඹ සිටියේ වන්නේ ය. මහණෙනි, මිනිසුන් දශවර්ෂායුෂ්ක කල්හි සත් දවසක් ශස්ත්‍රාන්තඃකල්පය වන්නේ ය. ඔහු ඔවුනොවුන් කෙරෙහි මෘගසංඥාව (මේ මුවෙකැ යි හැඟීම) ලබන්නාහ. ඔවුන්ගේ අත්හි තියුණු අවි පහළ වන්නේ ය. ඔහු තියුණු අවියෙන් ‘මේ මුවෙක, මේ මුවෙකැ’ යි ඔවුනොවුන් දිවියෙන් තොර කරන්නාහ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "",
                "level": "1"
            },
            {
                "format": 13,
                "text": "17. මහණෙනි, එ කල්හි ඒ සතුන් අතුරෙන් ඇතැම් කෙනෙකුට ‘අපි කිසිවකුදු දිවියෙන් තොර නො කරමෝ වා, කිසිවෙක් අප ද දිවියෙන් තොර නො කෙරේවා අපි තණහඬුවකට හෝ වනලැහැබකට හෝ රුක්බැද්දකට හෝ අන්තර්ද්විපාදි නදීන්ගේ දුර්ගමස්ථානයකට හෝ කඳුවලින් විෂම වූ තැනකට හෝ වැද, වෙනෙහි මුල් පල ආහාර කොටැති වැ යැපෙන්නමෝ නම් යෙහෙකැ’ යි මෙසේ සිතෙක් වන්නේ ය. ඔහු තණහඬුවකට හෝ වනලැහැබකට හෝ රුක්බද්දකට හෝ නදීවිදුර්ගයකට හෝ පර්‍වත විෂමයකට හෝ පිවිස සත් දවසක් වනමූලඵල ආහාර කොටැති ව යැපෙන්නාහ. ඔහු එහි සතිය ඇවෑමෙන් තණහඬුවෙන් වනලැහැබෙන් රුක්බැද්දෙන් නදීවිදුර්ගයෙන් පර්‍වතවිෂමයෙන් නික්ම, උනුන් වැලැඳගෙන, භවත් සත්වය, ‘පිනෙකි! තව ම ජීවත් වෙහි! වූ සේ යහපති! තව ම ජීවත් වෙහි’ යැ යි උනුන් හා සතුටු වන්නාහ, උනුන් අස්වසන්නාහ. මහණෙනි, එ කල්හි ඒ සත්නට, ‘අපි වනාහි අකුසල් දහම් සමාදන් කොට ගත් හෙයින් මෙබඳු වූ මහත් ඥාතිවිනාශයකට පත්තම්හ. අපි කුසල් කරමෝ නම් යෙහෙක.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "123"
            },
            {
                "format": 13,
                "text": "කවර කුසලක් කරමෝ ද? අපි ප්‍රාණඝාතයෙන් වළකින්නමෝ නම්, මේ කුසල් දහම සමාදන් කොට ගෙන පවතින්නමෝ නම් යෙහෙකැ’ යි මෙසේ සිතෙක් වන්නේ ය. කුසල් දහම් සමාදන් කොට ගත් හෙයින් ඔහු ආයුෂයෙන් ද වැඩෙන්නාහ, පැහැයෙන් ද වැඩෙන්නාහ. ආයුෂයෙන් ද වැඩෙන, පැහැයෙන් ද වැඩෙන දශවර්ෂායුෂ්ක වූ ඒ මිනිසුන්ගේ දරුවෝ විසි හවුරුද්දක් ආයු ඇත්තෝ වන්නාහ. එ කල්හි, මහණෙනි, ඒ සත්නට, ‘අපි, කුසල් දහම් සමාදන් කොට ගත් හෙයින් ආයුෂයෙන් ද වැඩෙමු, වර්‍ණයෙන් ද වැඩෙමු, අපි තවත් බොහෝ සෙයින් කුසල් කරන්නමෝ නම් යෙහෙක. කවර කුසලක් කරන්නමෝ ද? අපි අදත්තාදානයෙන් වළකන්නමෝ නම්, මේ කුසල් දහම සමාදන් කොට ගෙන පවත්නමෝ නම් යෙහෙකැ’ යි මෙසේ සිතෙක් වන්නේ ය. ඔහු පණිවායෙන් වළක්නාහ, අයිනාදනින් වළක්නාහ. මේ කුසල් දහම් සමාදන් කොට ගෙන පවතින්නාහ. ඔහු කුසල් දහම් සමාදන් කොට ගැනුම් හෙයින් ආයුෂයෙන් ද වැඩෙන්නාහ, වර්‍ණයෙන් ද වැඩෙන්නාහ. ආයුෂයෙන් ද වැඩෙන, වර්‍ණයෙන් ද වැඩෙන, විසි හවුරුදු ආයු ඇති ඒ මිනිසුන්ගේ දරුවෝ හවුරුදු සතලිසක් ආයු ඇතියෝ වන්නාහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එ කල්හි ඒ සත්නට, ‘අපි වූ කලි කුසල් දහම් සමාදන් කොට ගැනීමේ හේතුයෙන් ආයුෂයෙන් ද වැඩෙමු, වර්‍ණයෙන් ද වැඩෙමු. අපි වඩාත් කුසල් කරන්නමෝ නම් යෙහෙක. කවර කුසලක් කරන්නමෝ ද? අපි කාමයන්හි වරදවා හැසිරීමෙන් වැළැක්කමෝ නම්, මේ කුසල් දහම සමාදන් කොට ගෙන පැවැත්තමෝ නම් යෙහකැ’ යි මේ සිත වන්නේ ය. ඔහු ප්‍රාණඝාතයෙන් වළකින්නාහ, අයිනාදනින් වළකින්නාහ, කාමයන්හි වරදවා හැසිරීමෙන් වළකින්නාහ. මේ කුසල් දහම් සමාදන් කොට ගෙන පවතින්නාහ. ඔහු කුසල් දහම් සමාදන් කොට ගැනීම් හෙයින් ආයුෂයෙන් ද වැඩෙන්නාහ, වර්‍ණයෙන් ද වැඩෙන්නාහ. ආයුෂයෙන් ද වැඩෙන, වර්‍ණයෙන් ද වැඩෙන, සතළිස් වසක් ආයු කොටැති ඒ මිනිසුන්ගේ දරුවෝ අසූ හවුරුදු ආයු ඇත්තෝ වන්නාහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "18. මහණෙනි, එ කල්හි ඒ සත්නට, ‘අපි වනාහි කුසල් දහම් සමාදන් කොට ගැනුම් හෙයින් ආයුෂයෙන් ද වැඩෙමු, වර්‍ණයෙන් ද වැඩෙමු. අපි වඩාත් කුසල් කරමෝ නම් යෙහෙක. කවර කුසලක් කරන්නමෝ ද? අපි මුසවා බිණීමෙන් වැළැක්කමෝ නම්, මේ කුසල් දහම සමාදන් කොට ගෙන පැවැත්තමෝ නම් යෙහෙකැ’ යි මෙසේ සිතෙක් වන්නේ ය. ඔහු පණිවායෙන් වළක්නාහ, අයිනාදනින් වළක්නාහ, කාමයන්හි වරදවා හැසිරීමෙන් වළක්නාහ, මුසවා බිණීමෙන් වළක්නාහ. මේ කුසල් දහම් සමාදන් කොට ගෙන පවත්නාහ. ඔහු කුසල් දහම් සමාදන් කොට ගැනුම් හෙයින් ආයුෂයෙන් ද වැඩෙන්නාහ, වර්‍ණයෙන් ද වැඩෙන්නාහ. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "125"
            },
            {
                "type": "paragraph",
                "text": "ආයුෂයෙන් ද වැඩෙන, වර්‍ණයෙන් ද වැඩෙන, අසූවසකට ආයු ඇති ඒ මිනිසුන්ගේ දරුවෝ එක්සිය සැට හවුරුදු ආයු ඇත්තෝ වන්නාහ. මහණෙනි, එ කල්හි ඒ සත්නට ‘අපි වනාහි කුසල් දහම් සමාදන් කොට ගැනුම් හෙයින් ආයුෂයෙන් ද වැඩෙමු, වර්‍ණයෙන් ද වැඩෙමු. අපි වඩාත් කුසල් කරමෝ නම් යෙහෙක. කවර කුසලක් කරමෝ ද? අපි පෙහෙසුන් තෙප්ලෙන් වළක්නමෝ නම්, මේ කුසල් දහම සමාදන් කොට ගෙන පවත්නමෝ නම් යෙහෙකැ’ යි මෙසේ සිතෙක් වන්නේ ය. ඔහු පණිවායෙන් වළකින්නාහ, අයිනාදනින් වළකින්නාහ, කාමයන්හි වරදවා හැසිරීමෙන් වඪකින්නාහ, මුසවායෙන් වළකින්නාහ, පෙහෙසුන් තෙප්ලෙන් වළකින්නාහ. මේ කුසල් දහම් සමාදන් කොට ගෙන පවත්නාහ. ඔහු කුසල් දහම් සමාදන් කොට ගැනුම් හෙයින් ආයුෂයෙන් ද වැඩෙන්නාහ. වර්‍ණයෙන් ද වැඩෙන්නාහ. ආයුෂයෙන් ද වැඩෙන වර්‍ණයෙන් ද වැඩෙන, එක්සිය සැටවසක් ආයු ඇති ඒ මිනිසුන්ගේ දරුවෝ තෙසියවිසි හවුරුද්දකට ආයු ඇත්තෝ වන්නාහ."
            },
            {
                "format": 13,
                "text": "මහණෙනි, එ කල්හි ඒ සත්නට, ‘අපි වූ කලි කුශලධර්ම සමාදාන හේතුයෙන් ආයුෂයෙන් ද වර්‍ණයෙන් ද වැඩෙමු. අපි වඩාත් කුසල් කරමෝ නම් යෙහෙක. කවර කුසලක් කරමෝ ද? අපි පරොස් බසින් වළක්නමෝ නම්, මේ කුසල් දහම සමාදන් කොට ගෙන පවත්නමෝ නම් යෙහෙකැ’ යි මෙසේ සිතෙක් වන්නේ ය. ඔහු පණිවායෙන් වළක්නාහ, අයිනාදනින් වළකින්නාහ, කාමමිථාචාරයෙන් වළකින්නාහ, මුසාවාදයෙන් වළකින්නාහ, පෙහෙසුන් තෙපලෙන් වළක්නාහ, පරොස් බසින් වළකින්නාහ, මේ කුසල් දහම් සමාදන් කොට ගෙන පවත්නාහ. ඔහු කුසල් දහම් සමාදන් කොට ගැනුම් හෙයින් ආයුෂයෙන් ද වැඩෙන්නාහ, වර්‍ණයෙන් ද වැඩෙන්නාහ. ආයුෂයෙන් ද වැඩෙන, වර්‍ණයෙන් ද වැඩෙන, තෙවිසි විසි වසක් ආයු ඇති ඒ මිනිසුන්ගේ මිනිසුන්ගේ දරුවෝ හසිය සතළිස් හවුරුද්දකට ආයු ඇතියෝ වන්නාහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එ කල්හි ඒ සත්නට, ‘අපි වූ කලි කුශල ධර්ම සමාදාන හේතුයෙන් ආයුෂයෙන් ද වර්‍ණයෙන් ද වැඩෙමු. අපි වඩාත් කුසල් කරමෝ නම් යෙහෙක. කවර කුසලක් කරමෝ ද? අපි සම්ප්‍රඵලාපයෙන් වළක්නමෝ නම්, මේ කුසල් දහම සමාදන් කොට ගෙන පවත්නමෝ නම් යෙහෙකැ’ යි මෙසේ සිතෙක් වන්නේ ය. ඔහු පණිවායෙන් වළක්නාහ, අයිනාදනින්, කාමමිථාචාරයෙන්, මුසාවාදයෙන්, පිසුණාවාචායෙන් වළක්නාහ. සම්ඵප්‍රලාපයෙන් වළක්නාහ. මේ කුසල් දහම් සමාදන් කොට ගෙන පවත්නාහ. ඔහු කුශල ධර්ම සමාදාන හේතුයෙන් ආයුෂයෙන් ද, වර්‍ණයෙන් ද වැඩෙන්නාහ. ආයුෂයෙන් ද වැඩෙන, වර්‍ණයෙන් ද වැඩෙන, හසිය සතළිස් හවුරුද්දකට ආයු ඇති ඒ මිනිසුන්ගේ දරුවෝ හවුරුදු දෙදහසකට ආයු ඇතියෝ වන්නාහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "127"
            },
            {
                "format": 13,
                "text": "19. මහණෙනි, එ කල්හි ඒ සත්නට, ‘අපි වූකලි කුශලධර්ම සමාදාන හේතුයෙන් ආයුෂයෙන් ද, වර්‍ණයෙන් ද වැඩෙමු. අපි වඩාත් කුසල් කරමෝ නම් යෙහෙක. කවර කුසලක් කරමෝ ද? අපි අභිධ්‍යාව දුරැලන්නමෝ මේ කුසල් දහම සමාදන් කොටගෙන් පවත්නමෝ නම් යෙහෙකැ’ යි මෙසේ සිතෙක් වන්නේ ය. ඔහු ප්‍රාණඝාතයෙන්, අදත්තාදානයෙන්, කාමමිථ්‍යාචාරයෙන්, මෘෂාවාදයෙන්, පෛශුන්‍යයෙන්, පරුෂවචනයෙන්, සම්ඵප්‍රලාපයෙන් වළකින්නාහ, අභිධ්‍යාව දුරැලන්නාහ. මේ කුසල් දහම් සමාදන් කොට ගෙන පවතින්නාහ. ඔහු කුශලධර්ම සමාදාන හේතුයෙන් ආයුෂයෙන් ද වර්‍ණයෙන් ද වැඩෙන්නාහ. ආයුෂයෙන් ද වර්‍ණයෙන් ද වැඩෙන, දෙදහසක් හවුරුද්දට ආයු ඇති ඒ මිනිසුන්ගේ දරුවෝ සාරදහස් හවුරුද්දකට ආයු ඇත්තෝ වන්නාහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එ කල්හි ඒ සත්නට, ‘අපි වූ කලි කුශලධර්ම සමාදාන හේතුයෙන් ආයුෂයෙන් ද, වර්‍ණයෙන් ද වැඩෙමු. අපි වඩාත් කුසල් කරමෝ නම් යෙහෙක. කවර කුසලක් කරමෝ ද? අපි ව්‍යාපාදය බැහැර කරමෝ නම්, මේ කුසල් දහම (ව්‍යාපාද ප්‍රහාණය) සමාදන් කොට ගෙන පවත්නමෝ නම් යෙහෙකැ’ යි මෙසේ සිතෙක් වන්නේ ය. ඔහු ප්‍රාණඝාතයෙන්, අදත්තාදානයෙන්, කාමමිථ්‍යාචාරයෙන්, මුසාවාදයෙන්, පිසුණාවාචායෙන්, ඵරුසවාචයෙන්, සම්ඵප්‍රලාපයෙන් වළකින්නාහ. අභිධ්‍යාව බැහැර කරන්නාහ. ව්‍යාපාදය බැහැර කරන්නාහ. මේ කුසල් දහම් සමාදන් කොට ගෙන පවතින්නාහ. කුසල් දහම් සමාදාන් කොට ගැනුම් හේතුයෙන් ඔහු ආයුෂයෙන් ද වර්‍ණයෙන් ද වැඩෙන්නාහ. ආයුෂයෙන් ද වර්‍ණයෙන් ද වැඩෙන, සාරදහසක් හවුරුද්දට ආයු ඇති ඒ මිනිසුන්ගේ දරුවෝ අවුරුදු අටදහසක් ආයු ඇත්තෝ වන්නාහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එ කල්හි ඒ සත්නට, ‘අපි වූකලි කුශලධර්ම සමාදාන හේතුයෙන් ආයුෂයෙන් ද, වර්‍ණයෙන් ද වැඩෙමු. අපි වඩාත් කුසල් කරමෝ නම් යෙහෙක. කවර කුසලක් කරමෝ ද? අපි මිථ්‍යා දෘෂ්ටිය බැහැර කරමෝ නම්, මේ (මිථ්‍යාදෘෂ්ටි ප්‍රහාණමය) කුශලධර්මය සමාදන් කොට ගෙන පවත්නමෝ නම් යෙහෙකැ’ යි මෙසේ සිතෙක් වන්නේ ය. ඔහු ප්‍රාණඝාතයෙන්, අදත්තාදානයෙන්, කාමමිථ්‍යාචාරයෙන්, මුසාවාදයෙන්, පිසුණාවාචායෙන්, ඵරුසවාචායෙන්, සම්ඵප්‍රලාපයෙන් වළකින්නාහ. අභිධ්‍යාව, ව්‍යාපාදය බැහැර කරන්නාහ. මිථ්‍යාදෘෂ්ටිය බැහැර කරන්නාහ. මේ කුසල් දහම් සමාදන් කොට ගෙන පවතින්නාහ. කුශලධර්ම සමාදාන හේතුයෙන් ඔහු ආයුෂයෙන් ද වර්‍ණයෙන් ද වැඩෙන්නාහ. ආයුෂයෙන් ද වර්‍ණයෙන් ද වැඩෙන, අටදහසක් හවුරුද්දට ආයු ඇති ඒ මිනිසුන්ගේ දරුවෝ වර්ෂ විසිදහසකට ආයුෂ ඇත්තෝ වන්නාහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "129"
            },
            {
                "format": 13,
                "text": "20. මහණෙනි, එ කල්හි ඒ සත්නට, ‘අපි වූකලි කුශලධර්ම සමාදාන හේතුයෙන් ආයුෂයෙන් ද, වර්‍ණයෙන් ද වැඩෙමු. අපි වඩාත් කුසල් කරමෝ නම් යෙහෙක. කවර කුසලක් කරමෝ ද? අපි අධර්ම රාගය, විෂම ලෝභය, මිථ්‍යාධර්මය යන මේ තුන් ලාමක ධර්ම දුරැලන්නමෝ නම්, මේ කුශලධර්මය සමාදන් කොට ගෙන පවත්නමෝ නම් යෙහෙකැ’ යි මෙසේ සිතෙක් වන්නේ ය. ඔහු ප්‍රාණඝාතයෙන්, අදත්තාදානයෙන්, කාමමිථ්‍යාචාරයෙන්, මුසාවාදයෙන්, පිසුණාවාචායෙන්, ඵරුෂවාචායෙන්, සම්ඵප්‍රලාපයෙන් වළකින්නාහ. අභිධ්‍යාව, ව්‍යාපාදය, මිථ්‍යාදෘෂ්ටිය දුරැ ලන්නාහ. අධර්ම රාගය, විෂම ලෝභය, මිථ්‍යාධර්මය යන තුන් පාපධර්ම බැහැර කරන්නාහ. මේ කුසල් දහම් සමාදන් කොට ගෙන පවතින්නාහ. ඔහු කුශලධර්ම සමාදාන හේතුයෙන් ආයුෂයෙන් ද, වර්‍ණයෙන් ද වැඩෙන්නාහ. ආයුෂයෙන් ද වර්‍ණයෙන් ද වැඩෙන, හවුරුදු විසිදහසක් ආයු ඇති ඒ මිනිසුන්ගේ දරුවෝ හවුරුදු සතළිස් දහසකට ආයු ඇතියෝ වන්නාහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "21. මහණෙනි, එ කල්හි ඒ සත්නට, ‘අපි වනාහි කුශලධර්ම සමාදාන හේතුයෙන් ආයුෂයෙන් ද, වර්‍ණයෙන් ද වැඩෙමු. අපි වඩාත් කුසල් කරමෝ නම් යෙහෙක. කවර කුශලයක් කරමෝ ද? අපි මව කෙරෙහි මොනවට පිළිපදින්නමෝ, පියා කෙරෙහි මොනොවට පිළිපදින්නමෝ, මහණුනට සත්කාර කරන්නමෝ, බමුණනට සත්කාර කරන්නමෝ, කුලයෙහි වැඩි සිටියනට යටත් පැවැතුම් ඇත්තමෝ වන්නමු නම්, මේ කුශල ධර්ම සමාදන් කොට ගෙන පවත්නමෝ නම් යෙහෙකැ’ යි මෙසේ සිතෙක් වන්නේ ය. ඔහු ප්‍රාණඝාතයෙන්, අදත්තාදානයෙන්, කාමමිථ්‍යාචාරයෙන්, මුසාවාදයෙන්, පිසුණාවාචායෙන්, ඵරුසවාචායෙන්, සම්ඵප්‍රලාපයෙන් වළකින්නාහ. අභිධ්‍යාව, ව්‍යාපාදය, මිථ්‍යාදෘෂ්ටිය බැහැර ලන්නාහ. අධර්ම රාගය, විෂමලෝභ, මිථ්‍යාධර්මය යන තුන් පාපධර්ම බැහැර කරන්නාහ. මවුට සත්කාර කරන්නෝ, පියාට සත්කාර කරන්නෝ, මහණුනට සත්කාර කරන්නෝ, බමුණනට සත්කාර කරන්නෝ, කුලයෙහි වැඩි සිටියනට යටත් පැවැතුම් දක්වන්නෝ වන්නාහ. මේ කුසල් දහම් සමාදන් කොට ගෙන පවතින්නාහ. ඔහු කුශල ධර්ම සමාදාන හේතුයෙන් ආයුෂයෙන් ද, වර්‍ණයෙන් ද වැඩෙන්නාහ. ආයුෂයෙන් ද වර්‍ණයෙන් ද වැඩෙන, හවුරුදු සතළිස් දහසකට ආයු ඇති ඒ මිනිසුන්ගේ දරුවෝ හවුරුදු අසූ දහසක් ආයු ඇතියෝ වන්නාහ. මහණෙනි, අවුරුදු අසූදහසක් ආයු ඇති මිනිසුන් අතුරෙහි පන්සියක් හවුරුදු වයස් වූ කුමරියෝ පතිකුලයට යෑමට සුදුසු වන්නාහ. මහණෙනි, අසූදහසක් හවුරුදු ආයු ඇති මිනිසුන් අතුරෙහි ආහාරතෘෂ්ණාව ද ආහාරක්ලාන්තිය ද මහලු වීම ද යන තුන් ආබාධ කෙනෙක් ම වන්නාහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "131"
            },
            {
                "type": "centered",
                "text": "",
                "level": "1"
            },
            {
                "format": 13,
                "text": "22. මහණෙනි, මිනිසුන් හවුරුදු අසූදහසක් ආයු ඇතියන් වූ කල්හි මේ දඹදිව සමෘද්ධ (ධාන්‍යාදියෙන් සම්පන්න) ද, ස්ථිත (වස්ත්‍රාදියෙන් පරිපූර්ණ) ද වන්නේ ය. ගම් නියම්ගම් දනවු රජදහන්හු වහළ මතුයෙන් ගමෙකින් ගමකට කුකුළකු විසින් යෑ හැකි වන් සේ ඒකාබද්ධ වැ පිහිටි දහස්ගණන් ගෙවලින් යුක්ත වන්නාහ. මහණෙනි, අසූ දහසක් හවුරුදු ආයු ඇති මිනිසුන් ඇති වන කල්හි මේ දඹදිව උනවනයක් බටවනයක් සේ, අවීචිය මෙන් මිනිසුන්ගෙන් අතුරු සිදුරු නැති සේ ගැවැසුණේ වන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මිනිසුන් වස් අසූදහසක් ආයු ඇත්තන් වන කල්හි, මේ බරණැස් නුවර සමෘද්ධ වූ ද ආඪ්‍ය වූ ද බොහෝ ජනයා ඇත්තා වූ ද මිනිසුන්ගෙන් ආකීර්‍ණ වූ ද සුලභ ආහාර ඇත්තාවූ ද කේතුමති නම් රජ දහනෙක් වන්නේ ය. මහණෙනි, මිනිසුන් අසූදහසක් හවුරුදු ආයු ඇත්තවුන් වූ කල්හි මෙ දඹදිව්හි කේතුමතී රාජධානිය පාමොක් කොටැති සුවාසූ දහසක් නගරයෝ වන්නාහ. මහණෙනි, මිනිසුන් අසූදහසක් හවුරුදු ආයු ඇතියන් වූ කල්හි කේතුමති රාජධානියෙහි ධාර්මික වූ ධර්මරාජ වූ සිවු සයුරු හිම් කොට සතර මහාද්වීපයට අධිපති වූ, සියලු සතුරන් දිනූ, දනවුහි තහවුරු බවට පැමිණි, සත්රුවනින් යුත් ශංඛ නම් සක්විති රජෙක් පහළ වන්නේ ය. ඔහුට චක්‍රරත්නය, හස්තිරත්නය, අශ්වරත්නය, මණිරත්නය, ස්ත්‍රීරත්නය, ගෘහපතිරත්නය, සත්වන පරිනායක රත්නයැ යි මේ සප්ත රත්න කෙනෙක් වන්නාහ. ඔහුට බාන සුලු නොවූ මූර්තිමත් වීර්යය බඳු ශරීර ඇති, පර සෙන් මඩිනු සමත් වූ, දහසකට වැඩි දරු කෙනෙක් වන්නාහ. හෙ තෙම සයුරුහිම් මෙ මහ පොළොව දඬුවමින් තොර වැ, අවියෙන් තොර වැ, දැහැමෙන් සෙමෙන් ජය ගෙන අධිපති වැ වසන්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "",
                "level": "1"
            },
            {
                "format": 13,
                "text": "23. මහණෙනි, මිනිසුන් හවුරුදු අසූදහසකට පරමායුෂ ඇත්තවුන් වූ කල්හි, අර්හත් වූ සම්‍යක්සම්බුද්ධ වූ, විද්‍යාචරණ සම්පන්න වූ, සුගත වූ, ලොව දන්නා, නිරුත්තර පුරුෂදම්‍යසාරථි වූ, දෙව්මිනිස්නට ශාස්තෘ වූ, සිවුසස් අවබෝධ කළ, සියලු භාග්‍යගුණ ඇති, මෛත්‍රෙය නම් භාග්‍යවත් තෙම ලොවැ උපදින්නේ ය. යම්සේ මම් මෙ සමයෙහි දෙවියන් සහිත මරුන් සහිත බඹුන් සහිත මේ ලෝකය ද, මහණ බමුණන් සහිත, දෙව් මිනිසුන් සහිත සත්වප්‍රජාව ද තෙමේ ම වෙසෙසි ණුවණින් දැන පසක් කොට පළ කෙරෙම් ද, එසේ ම ඒ මෛත්‍රෙය බුදුරජ ද දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, මේ ලෝකය ද, මහණ බමුණන් සහිත, දෙව් මිනිසුන් සහිත සත්වප්‍රජාව ද තෙමේ ම වෙසෙසි නුවණින් දැන, පසක් කොට දන්වන්නේ ය. යම්සේ මම් මෙ සමයහි ආදි කල්‍යාණ, මධ්‍ය කල්‍යාණ, පර්යවසාන කල්‍යාණ වූ, අර්ථ සහිත ව්‍යඤ්ජන සහිත වූ දහම් දෙසම් ද, හැම ලෙසින් පිරිපුන් වූ, පිරිසිදු බඹසර ප්‍රකාශ කරම් ද, එසේ ම ඒ බුදුරජ තෙමේ ද ආදිකල්‍යාණ, මධ්‍ය කල්‍යාණ, පර්යවසාන කල්‍යාණ වූ, අර්ථ සහිත ව්‍යංජන සහිත වූ දහම් දෙසන්නේ ය. හැම ලෙසින් පිරිපුන් වූ පිරිසිදු බඹසර ප්‍රකාශ කරන්නේ ය. යම්සේ මම් මෙ සමයෙහි නොයෙක් සිය ගණන් භික්ෂු සඞ්ඝයා පරිහරණය කෙරෙම් ද, එසේ ම ඒ බුදුරජ නොයක් සියදහස් ගණන් භික්ෂු සඞ්ඝයා පරිහරණය කරන්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "133"
            },
            {
                "format": 13,
                "text": "24. මහණෙනි, එ කල්හි ශඞ්ඛ නම් ඒ සක්විති රජ තෙම, පෙරැ මහාපනාද රජහු විසින් කරවන ලද යම් ප්‍රාසාදයෙක් වේ ද, (ගංගානදියෙහි ගිලී ඇති) ඒ පහය (ගඟෙන්) මත්තට නංවා, කලක් එහි වැස, මහණ බමුණු දුගී මගී පුලනු යදි ආදීනට එය පරිත්‍යාග කොට හැර දමා කෙහෙ රවුලු බහවා කසාවත් හැඳ ගිහිගෙයින් නික්මැ භගවත් අර්හත් මෛත්‍රෙය සම්මාසම්බුදු රජුහු වෙතැ, පැවිදි වන්නේ ය. හෙ තෙම මෙසේ පැවිදි වූයේ ම, හුදෙකලා වූයේ, කයින් සිතින් විවික්ත වූයේ, නොපමා වූයේ, කෙලෙස් තවන වැර ඇතියේ, නිවන් කරා මෙහෙයූ සිතැත්තේ, මඳ කලෙකින් ම යමක් පිණිස කුල දරුවෝ ගිහි ගෙන් නික්ම මනා කොට ම සසුන් වදිත් නම්, ඒ නිරුත්තර වූ සසුන් බඹසරැ අවසන වූ රහත්පලය වත්මනු බෙවෙහි ම තමා ම දැන පසක් කො සපයා වසන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "25. මහණෙනි, (එබැවින්) ආත්මය (ලොවී ලොවුතුරා දහම්) ද්වීප කොටැත්තෝ වැ ආත්මය ශරණ කොටැත්තෝ වැ අන් ශරණයක් අපේක්ෂා නො කරන්නෝ වැ, ධර්මය ද්වීප කොටැත්තෝ වැ ධර්මය ශරණ කොටැත්තෝ වැ, අන් ශරණයක් නැත්තෝ වැ වසවු.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, කෙසේ නම් මහණ තෙම ආත්මය ද්වීප කොටැති වැ, ආත්මය ශරණ කොටැති වැ, අන් ශරණයක් නැත්තෙක් වැ වෙසේ ද? ධර්මය ද්වීප කොටැති වැ, ධර්මය ශරණ කොටැති වැ, අන් ශරණයක් නැති වැ වෙසේ ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි මෙහි මහණ තෙම කයෙහි කය අනුව බලනුයේ, කෙලෙස් තවන වැර ඇත්තේ, නුවණින් දන්නේ, එලැඹැවු සිහි ඇත්තේ, ලොවෙහි (කයෙහි) අභිධ්‍යාවත් දොම්නසත් පහ කොට වෙසෙයි. වේදනාවන්හි ... සිතෙහි … ධර්මයන්හි ධර්ම අනුව බලනුයේ කෙලෙස් තවන වැර ඇත්තේ නුවණින් දන්නේ එළැඹැවූ සිහි ඇත්තේ, ලොවෙහි (ධර්මයන්හි) අභිධ්‍යාවත් දොම්නසත් පහ කොට වෙසෙයි. මහණෙනි, මෙසේ ම මහණ තෙම ආත්මය ද්වීප කොටැති වැ, ආත්මය ශරණ කොටැති වැ අන් ශරණයක් නැති වැ, ධර්මය ද්වීප කොටැති වැ ධර්මය ශරණ කොටැති වැ, අන් ශරණයක් නැති වැ වෙසෙයි. ",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "26. මහණෙනි, තමන් සතු වූ පියාගෙන් තමනට උරුම වැ ආ හැසිරීමට නිසි පෙදෙසෙහි හැසිරෙවු. තෙපි පියාගෙන් උරුම වැ ආ හැසිරීමට නිසි පෙදෙසෙහි හැසිරෙන්නහු, ආයුෂයෙන් ද වැඩෙන්නහු, වර්‍ණයෙන් ද වැඩෙන්නහු, සුවයෙන් ද වැඩෙන්නහු, භෝගයෙන් ද වැඩෙන්නහු, බලයෙන් ද වැඩෙන්නහු ය. මහණෙනි, මහණහුගේ ආයුෂයට කරුණු කවරේ ද? මහණෙනි, මෙහි මහණ තෙම ඡන්ද සමාධිය ප්‍රධාන කොටැති සංස්කාරයන්ගෙන් සමන්විත වූ ඍද්ධිපාදය වඩයි. වීර්ය සමාධිය … චිත්ත සමාධිය … වීමංසා සමාධිය ප්‍රධාන කොටැති සංස්කාරයන්ගෙන් සමන්විත වූ ඍද්ධිපාදය වඩයි. හේ මේ සතර ඍද්ධිපාද වැඩූ බැවින් බහුල කොට කළ බැවින් කැමැති වන්නේ කල්පයක් හෝ කල්පයකට වැඩි කලක් හෝ සිටියැ හැකි වන්නේ ය. මහණෙනි, මෙය වනාහි මහණහුගේ ආයුෂයට කරුණ වෙයි."
            },
            {
                "type": "page-break",
                "text": "135"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මහණහුගේ වර්‍ණයට කාරණ කවරේ ද? මහණෙනි, මෙහි මහණ තෙම සිල්වත් වේ ද, පාමොක් හැවුරුමෙන් හැවුරුණේ, ආචාර ගොචර දෙකින් යුක්ත වූයේ, අනුමාත්‍ර වරදෙහි ද බිය දක්නා සුලු වූයේ වෙසේ ද, සමාදන් කොට ගෙන සිකපදන්හි හික්මේ ද, මහණෙනි, මෙය මහණහුගේ වර්‍ණයට කාරණ වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මහණහුගේ සුවයට කාරණ කවරේ ද? මහණෙනි, මෙහි මහණ තෙම කාමයන්ගෙන් වෙන් වැ ම, අකුසල් දහමුන්ගෙන් වෙන් ව ම, විතර්ක සහිත, විචාර සහිත, විවේකයෙන් උපන් ප්‍රීතිය හා සුවය ඇති, පළමු දහන ලැබ වෙසෙයි. විතර්ක විචාරයන් සංහිඳීමෙන් … දෙවෙනි දහන … තෙවෙනි දහන … සිවුවන දහන ලැබ වෙසෙයි. මහණෙනි, මේ වනාහි මහණහුගේ සුවයට කාරණ වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මහණහුගේ භෝගයට කාරණ කවරේ ද? මහණෙනි, මෙහි මහණ තෙම මෛත්‍රී සහගත සිතින් එක් දෙසක් පැතිරැ ගෙන වෙසෙයි, එසේ දෙවෙනි දෙස, එසේ තෙවෙනි දෙස, එසේ සිවුවන දෙස, මෙසේ උඩ, යට, සරස, හැම තැන, සියලු ලොව මහත් වූ මහද්ගත වූ අප්‍රමාණ වූ වෛර රහිත වූ ක්‍රෝධ රහිත වූ මෛත්‍රී සහගත සිතින් පැතිර ගෙන වෙසෙයි. මහණෙනි, මෙහි මහණ තෙම කරුණා සහගත සිතින් … මුදිතා සහගත සිතින් … උපේක්ෂා සහගත සිතින් එක් දෙසක් පැතිර ගෙන වෙසෙයි. එසේ දෙවෙනි දෙස, එසේ තෙවෙනි දෙස, එසේ සිවුවන දෙස, මෙපරිද්දෙන උඩ, යට, සරස, හැම තැන, සියලු ලොව මහත් වූ මහද්ගත වූ අප්‍රමාණ වූ වෛර රහිත වූ, ක්‍රෝධ රහිත වූ උපේක්ෂා සහගත සිතින් පැතිරැ ගෙන වෙසයි. මහණෙනි, මෙය මහණහුගේ භෝගයට කාරණ වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මහණහුගේ බලයට කාරණ කවරේ ද? මහණෙනි, මෙහි මහණ තෙම ආස්‍රවයන්ගේ විනාශයෙන් ආස්‍රව රහිත වූ ඵල සමාධිය ද ඵල ඥානය ද මෙ අත්බව්හි ම තෙමේ ම වෙසෙසි නුවණින් දැන, පසක් කොට ලැබ වෙසෙයි. මහණෙනි, මෙය වනාහි මහණහුගේ බලයට කාරණ වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මාර බලය සේ දුක ස් මැඩැලියැ යුතු වූ අන් එක ද බලයක් මම් (නුවණැසින්) නො දකිමි. (එය ද මේ රහත් පල තෙම මැඩ ලයි.) මහණෙනි, මෙසේ කුශල ධර්මයන්ගේ සමාදාන හේතුයෙන් මේ (ලොවුතුරා) පින ද (රහත් පලය තෙක් ම) වැඩේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. ආරාධිත සිතැති ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ වචනය පිළිගත්හ.",
                "type": "paragraph"
            },
            {
                "format": 16,
                "text": "තෙවෙනි චක්‍රවර්ති සිංහනාද සූත්‍රය නිමියේ යැ.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ]
    }
]