{
    "filename": "dn-3-8",
    "bookId": 12,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 288,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "8.",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "සිගාලසුත්තං",
                        "level": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "1. එවං මෙ සුතං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකං සමයං භගවා රාජගහෙ විහරති වෙළුවනෙ කලන්දකනිවාපෙ. තෙන ඛො පන සමයෙන සිගාලකො{1} ගහපතිපුත්තො කාලස්සෙව වුට්ඨාය රාජගහා නික්ඛමිත්වා අල්ලවත්ථො අල්ලකෙසො පඤ්ජලිකො පුථුද්දිසා{2} නමස්සති, පුරත්ථිමං දිසං දක්ඛිණං දිසං පච්ඡිමං දිසං උත්තරං දිසං හෙට්ඨිමං දිසං උපරිමං දිසං."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. අථ ඛො භගවා පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය රාජගහං පිණ්ඩාය පාවිසි. අද්දසා ඛො භගවා සිගාලකං ගහපතිපුත්තං කාලස්සෙව වුට්ඨාය රාජගහා නික්ඛමිත්වා අල්ලවත්ථං අල්ලකෙසං පඤ්ජලිකං පුථුද්දිසා නමස්සන්තං, පුරත්ථිමං දිසං දක්ඛිණං දිසං පච්ඡිමං දිසං උත්තරං දිසං හෙට්ඨිමං දිසං උපරිමං දිසං. දිස්වාන සිගාලකං ගහපතිපුත්තං එතදවොච: කින්නු ඛො ත්වං ගහපතිපුත්ත කාලස්සෙව උට්ඨාය රාජගහා නික්ඛමිත්වා අල්ලවත්ථො අල්ලකෙසො පඤ්ජලිකො පුථුද්දිසා නමස්සසි, පුරත්ථිමං දිසං දක්ඛිණං දිසං පච්ඡිමං දිසං උත්තරං දිසං හෙට්ඨිමං දිසං උපරිමං දිසන්ති?”"
                    },
                    {
                        "type": "paragraph",
                        "text": "“පිතා මං භන්තෙ කාලං කරොන්තො එවං අවච: ‘දිසා තාත නමස්සෙය්යාසී’ති. සො ඛො අහං භන්තෙ පිතු වචනං සක්කරොන්තො ගරුකරොන්තො මානෙන්තො පූජෙන්තො කාලස්සෙව වුට්ඨාය රාජගහා නික්ඛමිත්වා අල්ලවත්ථො අල්ලකෙසො පඤ්ජලිකො පුථුද්දිසා නමස්සාමි, පුරත්ථිමං දිසං -පෙ- උපරිමං දිසන්ති”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“න ඛො ගහපතිපුත්ත අරියස්ස විනයෙ එවං ඡද්දිසා නමස්සිතබ්බා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "“යථා කථං පන භන්තෙ අරියස්ස විනයෙ ඡද්දිසා නමස්සිතබ්බා? සාධු මෙ භන්තෙ භගවා තථා ධම්මං දෙසෙතු යථා අරියස්ස විනයෙ ඡදිදිසා නමස්සිතබ්බා”ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සිඞ්ගාලකො (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. පුථුදිසා (මඡසං)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "8.",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "සිගාලක සූත්‍රය",
                        "level": 3
                    },
                    {
                        "format": 13,
                        "text": "1. මා විසින් මෙසේ අසන ලදි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ රජගහ නුවර නිසා කලන්දක නිවාප නම් වූ වෙළුවන අරමැ වැඩ වසන සේක. එ කල්හි සිගාලක නම් ගැහැවි පුත් කලින් ම (උදාසනක් සේ ම) නැඟී සිට, රජගහ නුවරින් නික්මැ ගොස්, තෙත් රෙදි ඇත්තේ, තෙත් කෙහෙ ඇත්තේ, දොහොත් මුදුනැ තබා ගත්තේ පෙර දෙස ද, දකුණු දෙස ද, අවර දෙස ද, උතුරු දෙස ද, යට දෙස ද, උඩ දෙස ද යන බොහෝ දිශාවන් වඳී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "2. එ කල්හි භාග්‍යවතුන් වහන්සේ පෙරවරු සමයෙහි හැඳ පෙරෙවැ, පා සිවුරු ගෙන, රජගහ නුවරට පිඬු පිණිස පිවිසි සේක. භාග්‍යවතුන් වහන්සේ, කලින් ම නැඟී සිට රජගහ නුවරින් නික්මැ, තෙත් වස්ත්‍ර ඇති ව, තෙත් කෙහෙ ඇතිව, දොහොත් මුදුනැ තබා ගෙන, පෙර දෙස ද, දකුණු දෙස ද, අවර දෙස ද, උතුරු දෙස ද, යට දෙස ද, උඩ දෙස ද, දකුණු දෙස ද, අවර දෙස ද, උතුරු දෙස ද, යට දෙස ද, උඩ දෙස ද, වඳනා සිගාලක ගැහැවි පුතු දුටු සේක් ම ය. දැක, ඔහු බණවා, ‘ගැහැවි පුත, කවර හෙයින් තෙපි කල් තබා ම නැඟී සිට රජගහ නුවරින් නික්මැ, තෙත් වස්ත්‍ර ඇත්තෙහි, තෙත් කෙහෙ ඇත්තෙහි, දොහොත් මුදුන් තබාගෙන, පෙර දෙස, දකුණු දෙස, අවර දෙස, උතුරු දෙස, යට දෙස, උඩ දෙස යන බොහෝ දිශාවන් වඳිවු දැ?” යි අසා වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“වහන්ස, මා පියා කලුරිය කරනුයේ, ‘දරුව, දිශාවන් වඳුව’ යි මට මෙසේ කී ය. වහන්ස, ඒ මම් පියාගේ වචනයට සත්කාර කරනුයෙම්, ගරුකාර කරනුයෙම්, බුහුමන් කරනුයෙම්, පූජා කරනුයෙම්, කලින් ම නැඟී සිට රජගහ පුරයෙන් නික්මැ, තෙත් රෙදි ඇති ව, තෙත් කෙහෙ ඇති ව, දොහොත් මුදුනැ තබාගෙන, පෙර දෙස … උඩ දෙස වඳිමී’ යි (සිගාලක තෙමේ) කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘ගැහැවි පුත, ආර්‍ය්‍ය විනයයෙහි ස දෙස්හු මෙසේ නො වැන්ද යුත්තාහ’ යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘වහන්ස, කෙසේ නම් ආර්‍ය්‍ය විනයයෙහි ස දෙස්හු වැන්ද යුත්තාහු ද? වහන්ස, ආර්‍ය්‍යවිනයයෙහි යම්සේ ස දෙස්හු වැන්ද යුත්තාහු නම්, එසේ භාග්‍යවතුන් වහන්සේ මට දහම් දෙසන සේක් වා’ යි ගැහැවි පුත් කී ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 290,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "3. තෙන හි ගහපතිපුත්ත සුණාහි, සාධුකං මනසි කරොහි, භාසිස්සාමී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "‘එවං භන්තෙ’ති ඛො සිගාලො ගහපතිපුත්තො භගවතො පච්චස්සොසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "“යතො ඛො ගහපතිපුත්ත අරියසාවකස්ස චත්තාරො කම්මකිලෙසා පහීණා හොන්ති, චතූහි ඨානෙහි පාපකම්මං න කරොති, ඡ ච භොගානං අපායමුඛානි න සෙවති, සො එවං චුද්දසපාපකාපගතො, ඡද්දිසාපටිච්ඡාදී,{1} උභයලොකවිජයාය පටිපන්නො හොති. තස්ස අයං චෙව ලොකො ආරද්ධො හොති පරො ච ලොකො. සො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති."
                    },
                    {
                        "type": "centered",
                        "text": "කම්මකිලෙසා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "4. කතමස්ස චත්තාරො කම්මකිලෙසා පහීනා හොන්ති? පාණාතිපාතො ඛො ගහපතිපුත්ත කම්මකිලෙසො, අදින්නාදානං කම්මකිලෙසො, කාමෙසු මිච්ඡාචාරො කම්මකිලෙසො, මුසාවාදො කම්මකිලෙසො. ඉමස්ස චත්තාරො කම්මකිලෙසා පහීණා හොන්තී”ති. ඉදමවොච භගවා. ඉදං වත්වා{2} සුගතො, අථාපරං එතදවොච සත්ථා:"
                    },
                    {
                        "type": "gatha",
                        "text": "පාණාතිපාතං අදින්නාදානං මුසාවාදො ච වුච්චති\nපරදාරගමනඤ්චෙව නප්පසංසන්ති පණ්ඩිතා’ති."
                    },
                    {
                        "type": "centered",
                        "text": "අගතිගමනානි",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "5. කතමෙහි චතූහි ඨානෙහි පාපකම්මං කරොති? ඡන්දාගතිං ගච්ඡන්තො පාපකම්මං කරොති, දොසාගතිං ගච්ඡන්තො පාපකම්මං කරොති, මොහාගතිං ගච්ඡන්තො පාපකම්මං කරොති, භයාගතිං ගච්ඡන්තො පාපකම්මං කරොති. යතො ඛො ගහපතිපුත්ත අරියසාවකො නෙව ඡන්දාගතිං ගච්ඡති, න දොසාගතිං ගච්ඡති, න මොහාගතිං ගච්ඡති, න භයාගතිං ගච්ඡති, ඉමෙහි චතූහි ඨානෙහි පාපකම්මං න කරොතී’ති. ඉදමවොච භගවා ඉදං වත්වා සුගතො අථාපරං එතදවොච සත්ථා:"
                    },
                    {
                        "type": "gatha",
                        "text": "ඡන්දා දොසා භයා මොහා යො ධම්මං අතිවත්තති,\nනිහීයති තස්ස යසො{3}කාළපක්ඛෙ’ව චන්දිමා."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඡද්දිසා පටිච්ඡාදි හොති (ස්යා)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. වත්වාන (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "3. යසො තස්ස - (මඡසං)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "3. ‘ගැහැවි පුත, එසේ වී නම් අසව, මොනොවට මෙනෙහි කරව, කියන්නෙමි’ යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එසේ ය, වහන්සැ’ යි ම සිගාලක ගැහැවි පුත් භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "“ගැහැවි පුත, යම් හෙයෙකින් ආර්‍ය්‍යශ්‍රාවකයාගේ සතර කර්මක්ලේශයෝ ප්‍රහීණ වෙත් ද, යම් හෙයෙකින් ආර්‍ය්‍ය ශ්‍රාවක තෙම සතර කරුණෙකින් පව්කම් නො කරයි ද, යම් හෙයෙකින් භෝගයන්ගේ විනාශමුඛ සයත් නො සෙවී ද, හෙ තෙමේ මෙසේ තුදුස් ලාමක කම්වලින් පහ වූයේ ස දිසාවන් වසාලනුයේ, දෙලෝ ජය ගැන්ම පිණිස පිළිපන්නේ වෙයි. ඔහු විසින් මෙලොව ද ආරාධිත වෙයි, පරලොව ද ආරධිත වෙයි. හේ කාබුන් මරණින් මතු මනාප ගති ඇති ස්වර්ග ලෝකයට පැමිණෙයි."
                    },
                    {
                        "format": 21,
                        "text": "කර්ම ක්ලේශ",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "4. ඔහුගේ කවර සතර දෙනෙක් කර්ම ක්ලේශයෝ (අත්බව කිලිටි කරන කර්ම) ප්‍රහීණ වෙත් ද? ගහැවිපුත, ප්‍රාණඝාතය වනාහි කර්ම ක්ලේශයෙකි, අදත්තාදානය කර්ම ක්ලේශයෙකි, කාමයන්හි වරදවා හැසිරීම කර්ම ක්ලේශයෙකි, මෘෂාවාදය කර්මක්ලේශයෙකි. ඔහුගේ මේ ක්ලේශයෝ ප්‍රහීණ වෙත්. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගතයන් වහන්සේ මෙය වදාරා, ශාස්තෘ වූ භාග්‍යවතුන් වහන්සේ නැවැත ගාථා බන්ධන වශයෙන් අනෙකක් වූ මෙය වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පණීවා ද, අයිනාදන් ද, මුසවා යැ යි යමෙක් කියනු ලැබේ නම් එය ද, පරඹුන් කරා යෑම ද යන මේ දෑ නුවණැත්තෝ නො පසසත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "අගති ගමන",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "5. (ආර්‍ය්‍ය ශ්‍රාවක තෙමේ) කවර සතර කරුණෙකින් පව්කම් නො කෙරේ ද යත්: (පුහුදුන්තෙමේ), ඡන්දයෙන් අගතියට යනුයේ (කො කටයුත්තක් කරනුයේ) පව්කම් කරයි, ද්වේෂයෙන් අගතියට යනුයේ පව්කම් කරයි, බියෙන් අගතියට යනුයේ පව්කම් කරයි, මෝහයෙන් අගතියට යනුයේ පවකම් කරයි. ගැහැවිපුත, යම් හෙයෙකින් ආර්‍ය්‍යශ්‍රාවක තෙමේ ඡන්දයෙන් අගතියට නො ම යන්නේ ද, ද්වේෂයෙන් අගතියට නො ම යන්නේ ද, බියෙන් අගතියට නොම යන්නේ ද, මෝහයෙන් අගතියට නො ම යන්නේ ද, හේ මේ සතර කරුණින් පව්කම් නො කෙරෙයි. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක, ශාස්තෘ වූ සුගතයන් වහන්සේ මෙය වදාරා, නැවත ගාථාබන්ධන වශයෙන් අනෙකක් වූ මේ වචන ද වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "‘ඡන්දයෙන් ද ද්වේෂයෙන් ද බියෙන් ද මෝහයෙන් ද යමෙක් යුක්තිධර්මය ඉක්මැ යේ ද, කළුවර පසැ සඳුහු මෙන්, ඔහුගේ යශස පිරිහෙයි.’",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 292,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "ඡන්දා දොසා භයා මොහා යො ධම්මං නාතිවත්තති,\nආපූරති තස්ස යසො{1} සුක්කපක්ඛෙ ව{2} චන්දිමා’ති."
                    },
                    {
                        "type": "centered",
                        "text": "ඡ අපායමුඛානි",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "6. කතමානි ඡ භොගානං අපායමුඛානි න සෙවති? සුරාමෙරයමජ්ජපමාදට්ඨානානුයොගො ඛො ගහපතිපුත්ත භොගානං අපායමුඛං. විකාලවිසිඛාචරියානුයොගො භොගානං අපායමුඛං. සමජ්ජාභිචරණං භොගානං අපායමුඛං, ජූතප්පමාදට්ඨානානුයොගො භොගානං අපායමුඛං. පාපමිත්තානුයොගො භොගානං අපායමුඛං ආලස්සානුයොගො භොගානං අපායමුඛං."
                    },
                    {
                        "type": "centered",
                        "text": "මජ්ජපානාදීනවා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඡ ඛො’මෙ ගහපතිපුත්ත ආදීනවා සුරාමෙරයමජ්ජපමාදට්ඨානානුයොගෙ: සන්දිට්ඨිකා ධනජානි, කලහප්පවඩ්ඪනී, රොගානං ආයතනං, අකිත්තිසඤ්ජනනී, කොපීනනිදංසනී පඤ්ඤාය දුබ්බලිකරණීත්වෙව ඡට්ඨං පදං භවති. ඉමෙ ඛො ගහපතිපුත්ත ඡ ආදීනවා සුරාමෙරයමජ්ජපමාදට්ඨානානුයොගෙ."
                    },
                    {
                        "type": "centered",
                        "text": "විකාලචරියාදීනවා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඡ ඛො’මෙ ගහපතිපුත්ත ආදීනවා විකාලවිසිඛාචරියානුයොගෙ: අත්තාපි’ස්ස අගුත්තො අරක්ඛිතො හොති පුත්තදාරො පි’ස්ස අගුත්තො අරක්ඛිතො හොති, සාපතෙය්යම්පි’ස්ස අගුත්තං අරක්ඛිතං හොති, සඞ්කියො ච හොති පාපකෙසු ඨානෙසු, අභූතවචනං ච තස්මිං රූහති, බහූනඤ්ච දුක්ඛධම්මානං පුරක්ඛතො හොති. ඉමෙ ඛො ගහපතිපුත්ත ඡ ආදීනවා විකාලවිසිඛාචරියානුයොගෙ."
                    },
                    {
                        "type": "centered",
                        "text": "සමජ්ජාභිචරණාදීනවා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඡ ඛො’මෙ ගහපතිපුත්ත ආදීනවා සමජ්ජාභිචරණෙ: ක්ව{3} නච්චං, ක්ව ගීතං, ක්ව වාදිතං, ක්ව අක්ඛානං, ක්ව පාණිස්සරං, ක්ව කුම්භථුණන්ති? ඉමෙ ඛො ගහපතිපුත්ත ඡ ආදීනවා සමජ්ජාභිචරණෙ."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. යසො තස්ස (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. ජුණ්හපක්ඛෙව (කම්)"
                    },
                    {
                        "type": "footnote",
                        "text": "3. කුවං (PTS)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "යමෙක් ඡන්දයෙන් ද ද්වේෂයෙන් ද බියෙන් ද මෝහයෙන් ද යුක්තිධර්මය ඉක්මැ නො යේ ද, ඔහුගේ යශස පුර පසැ සඳුහු මෙන් වැඩෙයි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "අපායමුඛ සය",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "6. හේ භෝගයන්ගේ කවර විනාශමුඛ සයක් නො සෙවි ද යත්: ගැහැවි පුත, මත් බවට ප්‍රමාදයට කරුණු වූ රහමෙර පීමෙහි යෙදීම භෝගයන්ගේ විනාශ මුඛයෙකි. නොකල්හි වීථිසංචාරයෙහි යෙදීම භෝගයන්ගේ විනාශ මුඛයෙකි. උත්සව දර්ශනය පිණිස යෑම භෝගයන්ගේ විනාශ මුඛයෙකි. ප්‍රමාදයට කාරණයක් වූ දූකෙළියෙහි යෙදීම භෝගයන්ගේ විනාශ මුඛයෙකි. පාපමිත්‍රයන් හා පුන පුනා එක් වීම භෝගයන්ගේ විනාශ මුඛයෙකි. අලසබව්හි නැවත නැවත යෙදීම භෝගයන්ගේ විනාශ මුඛයෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "මද්‍යපානාදීනව ",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "ගැහැවි පුත, මත්බවටත් ප්‍රමාදයටත් කාරණ වූ රහමෙර පීමෙහි පුන පුනා යෙදීමෙහි මේ දොස් සයෙකි: මෙ ලොවැදීම වන ධන හානිය, කලහ වැඩීම, රෝගයනට කෙතක් වීම. අපකීර්ති ඉපැදැවීම, කයෙහි ගුහ්‍යස්ථාන විවෘත කොට හැසිරීම, නුවණ දුර්වල කිරීම යන සවැනි කාරණය ද වෙයි. ගැහැවි පුත, මදයට ප්‍රමාදයට කාරණ වූ රහමෙර පීමෙහි මේ දොස් සය වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "විකාලචරියාදීනව",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "ගැහැවි පුත, නොකල්හි වීථි සඤ්චාරයෙහි පුන පුනා යෙදීමෙහි මේ දොස් සයෙකි: තමේ ද සංගොපිත නො වූ යේ නො රක්නාලද්දේ වෙයි. ඔහුගේ අඹුදරුවෝ ද අසංගෝපිත වූවාහු නොරක්නා ලද්දාහු වෙත්, ඔහුගේ වස්තුව ද සංගොපිත නො වූයේ නොරක්නා ලද්දේ වෙයි. පාප ක්‍රියාවන්හි සැක කටයුත්තෙක් ද වෙයි, අභූත දෝෂ කථා ද ඔහු කෙරෙහි නැඟෙයි, තවත් බොහෝ දුක් දොම්නසුන් විසින් පෙරටු කරන ලද්දේ වෙයි, (බොහෝ දුක් ඔහු පසු පස එයි). ගැහැවි පුත, මොහු සදෙන නොකල්හි වීථිසඤ්චාරයෙහි පුන පුනා යෙදීමෙහි දෝෂයෝ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "සමද්‍යාභිචරණාදීනව",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "ගැහැවි පුත, උත්සව දර්ශනයට යාමෙහි මේ දොස් සයෙකි: කොහි නැටුම් ඇද්ද? කොහි ගැයුම් ඇත්ද? කොහි වැයුම් ඇද්ද? ආඛ්‍යාන (රාමායණාදී කථා කීම) කොහි ඇද්ද? අත්තාලම් ඈ ගැසීම කොහි ඇද්ද? කළ පිඹීම් ආදිය කොහි ඇද්ද? යි සොයා හැවිදිත්. උත්සව දර්ශනයට යෑමෙහි මේ ආදීනව සය ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 294,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "ජූතප්පමාදාදීනවා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඡ ඛො’මෙ ගහපතිපුත්ත ආදීනවා ජූතප්පමාදට්ඨානානුයොගෙ: ජයං වෙරං පසවති, ජිතො විත්තමනුසොචති, සන්දිට්ඨිකා ධනජානි, සභාගතස්ස{1} වචනං න රූහති, මිත්තාමච්චානං පරිභූතො හොති, ආවාහවිවාහකානං අපත්ථිතො හොති, අක්ඛධුත්තො අයං පුරිසපුග්ගලො නාලං දාරභරණායා’ති. ඉමෙ ඛො ගහපතිපුත්ත ඡ ආදීනවා ජූතප්පමාදට්ඨානානුයොගෙ."
                    },
                    {
                        "type": "centered",
                        "text": "පාපමිත්තානුයොගාදීනවා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඡ ඛො’මෙ ගහපතිපුත්ත ආදීනවා පාපමිත්තානුයොගෙ: යෙ ධුත්තා, යෙ සොණ්ඩා, යෙ පිපාසා, යෙ නෙකතිකා, යෙ වඤ්චනිකා, යෙ සාහසිකා. ත්යාස්ස මිත්තා හොන්ති, තෙ සහායා. ඉමෙ ඛො ගහපතිපුත්ත ඡ ආදීනවා පාපමිත්තානුයොගෙ."
                    },
                    {
                        "type": "centered",
                        "text": "ආලස්සාදීනවා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඡ ඛො’මෙ ගහපතිපුත්ත ආදීනවා ආලස්සානුයොගෙ: අතිසීතන්ති කම්මං න කරොති, අතිඋණ්හන්ති කම්මං න කරොති, අතිසායන්ති කම්මං න කරොති, අතිපාතො’ති කම්මං න කරොති, අතිජාතො’ස්මීති කම්මං න කරොති, අතිධාතො’ස්මීති කම්මං න කරොති. තස්ස එවං කිච්චාපදෙසබහුලස්ස විහරතො අනුප්පන්නා චෙව භොගා නුප්පජ්ජන්ති, උප්පන්නා ච භොගා පරික්ඛයං ගච්ඡන්ති. ඉමෙ ඛො ගහපති පුත්ත ඡ ආදීනවා ආලස්සානුයොගෙ”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදමවොච භගවා, ඉදං වත්වා සුගතො අථාපරං එතදවොච සත්ථා:"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සහායෙ තස්ස (කම්)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 21,
                        "text": "ද්‍යුතප්‍රමාදාදීනව",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "ගැහැවි පුත, ප්‍රමාදයට කාරණ වූ දූ කෙළියෙහි යෙදීමෙහි මේ දොස් සයෙකි: දිනනුයේ (පැරැදුණුහු තුළ) වෛර උපදවයි, පැරැදුණේ (නටුවාවූ) වස්තුව අනු සොවී. තමා දැක්කැදී ම ධනහානිය වේ. සභාවට ගිය ඔහුගේ වචන නො නැඟේ. මිත්‍රාමාත්‍යයන් විසින් පිරිහෙලන ලද්දෙක් වෙයි. ‘මේ පුරුෂපුද්ගල තෙමේ අක්ෂධූර්තයෙකැ’ යි අඹුදරුවන් රක්නට නො සමත් වේ යැ’ යි ආවාහක විවාහකයන් විසින් නො පතන ලදුයේ වෙයි. ගැහැවි පුත, මොහු ප්‍රමාදයට කාරණ වූ දූකෙළියෙහි පුනපුනා යෙදුම්හි දෝෂයෝ සදෙන වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "පාපමිත්‍රානුයොගාදීනව",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "ගැහැවි පුත, පාපමිත්‍රානුයෝගයෙහි (ලාමක මිතුරන් ඇසුරු කැරැම්හි) මේ දෝෂ සයෙකි: අක්ෂධූර්ත (දූකෙළියෙහි යෙදුණු) යම් කෙනෙක් වෙත් ද ඔහු ඔහුට මිත්‍ර වෙත්, සහාය වෙත්, යම ඉතිරි සොඬ ආදි සොඬහු වෙත් ද, ඔහු ඔහුට මිත්‍ර වෙත්, සහාය වෙත්, බීමෙහි ලොල්වූ යම් කෙනෙක් වෙත් ද, ඔහු පාපමිත්‍රානුයුක්තයාට මිත්‍ර වෙත්, සහාය වෙත්, යම් නෛකතික (බොරුරන් ආදිය දී රවටන) කෙනෙක් වෙත් ද, ඔහු ඔහුට මිත්‍ර වෙත්, සහාය වෙත්, යම් වංචනික (සම්මුඛ වචනයෙන් රවටන) කෙනෙක් වෙත් ද, ඔහු ඔහුට මිත්‍ර වෙත්, සහාය වෙත්, ගම් පැහැරීම් ආදි සාහසික කර්මයන්හි යෙදුණු යම් කෙනෙක් වෙත් ද, ඔහු පාපමිත්‍රානුයෝගියාට මිත්‍ර වෙත්, සහාය වෙත්. ගැහැවි පුත, පාපමිත්‍රානුයෝගයෙහි මේ දොස් සය ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "ආලස්‍යාදීනව",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "ගැහැවි පුත, අලසබව්හි යෙදීමෙහි මේ දෝෂයෝ ස දෙනෙක් වෙත්. ඉතා ශීත යැයි කර්මාන්ත නො කෙරෙයි, ඉතා උෂ්ණයැ යි කර්මාන්ත නො කෙරෙයි. ඉතා සවස් කාලය වී යැ යි කර්මාන්ත නො කෙරෙයි. ඉතා උදාසන යැ යි කර්මාන්ත නො කෙරෙයි, ඉතා බඩ සා ඇත්තෙමි යි කර්මාන්ත නො කෙරෙයි, ඉතා වැඩියක් අහර ගතිමි යි කර්මාන්ත නො කෙරෙයි. මෙසේ කටයුතු අතපසු කිරීම බහුල කොට ඇති ඔහුට නූපන් භෝගයෝ නො උපදිත්; උපන් භෝගයෝ ද විනාශයට යෙත්. ගැහැවි පුතුනි, මේ අලසබව්හි යෙදීමෙහි දොස් සය ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. ශාස්තෘ වූ සුගතයන් වහන්සේ මෙය වදාරා යලි ගාථා බන්ධන වශයෙන් අනෙකක් වූ මෙය වදාළ සේක.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 296,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "7. “හොති පානසඛා නාම හොති සම්මියසම්මියො\nයො ච අත්ථෙසු ජාතෙසු සහායො හොති සො සඛා. 1"
                    },
                    {
                        "type": "gatha",
                        "text": "උස්සූරසෙය්යා පරදාරසෙවනා\nවෙරප්පසඞ්ගො{1} ච අනත්ථතා ච\nපාපා ච මිත්තා සුකදරියතා ච\nඑතෙ ඡ ඨානා පුරිසං ධංසයන්ති. 2",
                        "level": 2
                    },
                    {
                        "type": "gatha",
                        "text": "පාපමිත්තො පාපසඛො පාපආචාරගොචරො\nඅස්මා ලොකා පරම්හා ච උභයා ධංසතෙ නරො. 3"
                    },
                    {
                        "type": "gatha",
                        "text": "අක්ඛිත්ථියො වාරුණී නච්චගීතං \nදිවාසොප්පං පාරිචරියා අකාලෙ\nපාපා ච මිත්තා සුකදරියතා ච\nඑතෙ ඡ ඨානා පුරිසං ධංසයන්ති. 4",
                        "level": 2
                    },
                    {
                        "type": "gatha",
                        "text": "අක්ඛෙහි දිබ්බන්ති සුරං පිවන්ති\nයන්තිත්ථියො පාණසමා පරෙසං\nනිහීනසෙවී න ච වුද්ධසෙවී{2} \nනිහීයරෙ කාළපක්ඛෙ’ව චන්දො. 5",
                        "level": 2
                    },
                    {
                        "type": "gatha",
                        "text": "යො වාරුණී අධනො අකිඤ්චනො\nපිපාසො පිවං පාපං ගතො{3} \nඋදකමිව ඉණං විගාහති\nඅකුලං{4} කාහිති ඛිප්පමත්තනො. 6",
                        "level": 2
                    },
                    {
                        "type": "gatha",
                        "text": "න දිවාසොප්පසීලෙන රත්තිමුට්ඨානදෙස්සිනා{5},\nනිච්චං මත්තෙන සොණ්ඩෙන සක්කා ආවසිතුං ඝරං. 7"
                    },
                    {
                        "type": "gatha",
                        "text": "අතිසීතං අතිඋණ්හං අතිසායමිදං අහු,\nඉති විස්සට්ඨකම්මන්තෙ අත්ථා අච්චෙන්ති මාණවෙ. 8"
                    },
                    {
                        "type": "gatha",
                        "text": "යො’ධ සීතඤ්ච උණ්හඤ්ච තිණා භිෙය්යා න මඤ්ඤති\nකරං පුරිසකිච්චානි සො සුඛා{6} න විහායතී”ති. 9"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. වෙරප්පසවො (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. වුද්ධිසෙවි (ස්යා), බුද්ධිසෙවි (කම්)"
                    },
                    {
                        "type": "footnote",
                        "text": "3. පිපාසොසි අත්ථපාගතො (ස්යා), පිපාසො පි සමප්පපාගසො (කම්) පප ගතො (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "4. ආකුලං (ස්යා, කම්)"
                    },
                    {
                        "type": "footnote",
                        "text": "5. රත්තිනුට්ඨානදස්සිනා (PTS)"
                    },
                    {
                        "type": "footnote",
                        "text": "6. සුඛං (මඡසං)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "7. පානසඛ නම් (මත් පැන් බොන තැනැදී පමණක් යහලු වූ) යහලුවෙක, සම්මීය සම්මීය නම් (හමු වූ තැනදී පමණක් මිතුරු කම් අඟවන) යහලුවෙක, වැඩ ඇති වූ කල්හි යමෙක් යහලු වේ ද එසේ වූ යහලුවෙක් ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉරු උදා වන තෙක් නිදීම ය, පරඹුවන් සෙවීම ය, වෛර බහුල බව ය, අවැඩ කරන බව ය, පාප මිත්‍රයෝ ය, තද මසුරු බව ය යන මේ කරුණු සය පුරුෂයා වනසයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ලාමක මිතුරන් ඇති, ලාමක යහලුවන් ඇති, ලාමක වූ ආචාර ගෝචර ඇති මිනිස් තෙමේ මොලොවින් ද පරලොවින් ද යන දෙපසින් ම වැනැසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "දූ කෙළීම ය, පරඹුවන් කරා යෑම ය, මත්පැන් පීම ය, නැටුම් ගැයුම් සොයා යෑම ය, දහවල් නිදීම ය, නොකල්හි වීථි සංචාරය ය, පාප මිත්‍රයෝ ය, දැඩි මසුරු බව ය යන මේ කරුණු සය මිනිසා වනසයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පසැටින් කෙළිත්, රො බොත්, අනුන් ප්‍රාණ සම ව රක්නා අඹුවන් කරා යෙත්. පිරිහුණවුන් සෙව්නාහුයැ වැඩුණවුන් නො සෙව්නාහු ය. ඔහු කළුවර පසැ සඳු සෙයින් පිරිහෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ධනය නැති දිළිඳු වූ යමෙක් මත්පැන් බොනුයේ පොකුණක් වෙත් ගියක්හු පැන් බොන්නා සේ මත්පැන් බීමෙහි ගිජු වූයේ ද, හේ ණය ගැති බවට බැසගනී. වහා සිය කුලය අකුලයක් (පිරිහුණු කුලයක්) කරන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "දහවල් නිදන සුලු, රෑ පිබිදැ සිටීම නොරිසියෙන, නිතර මත් වූ. සොඬ වූ තැනැත්තහු විසින් ගෙහි වසන්නට නො හැක්ක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ධනයෝ ‘දැන් ඉතා ශීත ය, ඉතා ඌෂ්ණ ය, ඉතා සවස් යැ’ යි හරන ලද කර්මාන්ත ඇති මිනිසුන් ඉක්මැ යෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මෙහි යමෙක් ශීතයත් උෂ්ණයත් තණපතකට වැඩියෙන් නො තකා ද, පුරුෂ කාර්යයන් කරන හෙ තෙමේ සැපය අත් නො හරී.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 298,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "මිත්තපතිරූපකා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "8. චත්තාරො’ මෙ ගහපතිපුත්ත අමිත්තා මිත්තපතිරූපකා{1} වෙදිතබ්බා. අඤ්ඤදත්ථුහරො අමිත්තො මිත්තපතිරූපකො වෙදිතබ්බො, වචීපරමො අමිත්තො මිත්තපතිරූපකො වෙදිතබ්බො, අනුප්පියභාණී අමිත්තො මිත්තපතිරූපකො වෙදිතබ්බො, අපායසහායො අමිත්තො මිත්තපතිරූපකො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතූහි ඛො ගහපතිපුත්ත ඨානෙහි අඤ්ඤදත්ථුහරො අමිත්තො මිත්තපතිරූපකො වෙදිතබ්බො."
                    },
                    {
                        "type": "gatha",
                        "text": "අඤ්ඤදත්ථුහරො හොති අප්පෙන බහුමිච්ඡති,\nභයස්ස කිච්චං කරොති සෙවති අත්ථකාරණා.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො ගහපතිපුත්ත චතූහි ඨානෙහි අඤ්ඤදත්ථුහරො අමිත්තො මිත්තපතිරූපකො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතූහි ඛො ගහපතිපුත්ත ඨානෙහි වචීපරමො අමිත්තො මිත්තපතිරූපකො වෙදිතබ්බො. අතීතෙන පටිසන්ථරති{2} අනාගතෙන පටිසන්ථරතිං, නිරත්ථකෙන සඞ්ගණ්හාති, පච්චුප්පන්නෙසු කිච්චෙසු බ්යසනං දස්සෙති. ඉමෙහි ඛො ගහපතිපුත්ත චතූහි ඨානෙහි වචීපරමො අමිත්තො මිත්තපතිරූපකො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතූහි ඛො ගහපතිපුත්ත ඨානෙහි අනුප්පියභාණී අමිත්තො මිත්තපතිරූපකො වෙදිතබ්බො. පාපකම්පි’ස්ස{3} අනුජානාති, කල්යාණම්පි’ස්ස අනුජානාති, සම්මුඛා’ස්ස වණ්ණං භාසති, පරම්මුඛා’ස්ස අවණ්ණං භාසති. ඉමෙහි ඛො ගහපතිපුත්ත චතූහි ඨානෙහි අනුප්පියභාණී අමිත්තො මිත්තපතිරූපකො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතූහි ඛො ගහපතිපුත්ත ඨානෙහි අපායසහායො අමිත්තො මිත්තපතිරූපකො වෙදිතබ්බො: සුරාමෙරයමජ්ජපමාදට්ඨානානුයොගෙ සහායො හොති, විකාලවිසිඛාචරියානුයොගෙ සහායො හොති, සමජ්ජාභිචරණෙ සහායො හොති, ජූතප්පමාදට්ඨානානුයොගෙ සහායො හොති. ඉමෙහි ඛො ගහපති පුත්ත චතූහි ඨානෙහි අපායසහායො අමිත්තො මිත්තපතිරූපකො වෙදිතබ්බො’ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. මිත්තපටිරූපකා (සීමු)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. පටිසන්ධරති (කම්)"
                    },
                    {
                        "type": "footnote",
                        "text": "3. පාපකම්මමපිස්ස (ස්යා)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 21,
                        "text": "මිත්‍රප්‍රතිරූපකයෝ",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "8. ගැහැවිපුත, මිත්‍ර ප්‍රතිරූපක වූ (මිතුරු වෙසින් පැනෙන) සතර අමිත්‍රයෝ දත යුතු හ. මිත්‍රප්‍රතිරූපක අඤ්ඤදත්ථුහර අමිත්‍රයා දතයුතු, මිත්‍රප්‍රතිරූපක වචීපරම අමිත්‍රයා දත යුතු. මිත්‍රප්‍රතිරූපක අනුප්‍රියභාණී අමිත්‍රයා දත යුතු. මිත්‍රප්‍රතිරූපක අපායසහාය අමිත්‍රයා දත යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ගැහැවිපුත, සතර කරුණෙකින් මිත්‍රප්‍රතිරූපක වූ අඤ්ඤදත්ථුහර (ඒකාන්තයෙන් කිසිවක් හැරගෙන ම යන) අමිත්‍රයා දත යුතු:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඒකාන්තයෙන් සිය මිතුරා ගෙන් කිසිවක් හැරගෙන ම යන්නේ වෙයි. අල්ප දැයෙකින් (ස්වල්ප දැයක් දී) බොහෝ දෑ ලබන්නට පතයි. තමාට බියක (උවදුරක්) උපන් කලහි පමණක් මිතුරාගේ කටයුතු කෙරෙයි. තමාගේ වැඩ ම කරුණු කොට මිතුරා සෙවී. ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "ගැහැවි පුත, මේ සතර කරුණින් මිත්‍රප්‍රතිරූපකවූ අඤ්ඤදත්ථුහර අමිත්‍රයා දත යුතු."
                    },
                    {
                        "format": 13,
                        "text": "ගැහැවිපුත, මේ සතර කරුණින් මිත්‍රප්‍රතිරූපක වචීපරම (වචනය ම පරම කොටැති) අමිත්‍රයා දත යුතු: අතීතයෙන් සඞ්ග්‍රහ කෙරෙයි, අනාගතයෙන් සඞ්ග්‍රහ කෙරෙයි. නිරර්ථක කථායෙන් සඞ්ග්‍රහ කෙරෙයි. වර්තමාන කාර්‍ය්‍යයන්හි ව්‍යසන දක්වයි. ගැහැවිපුත, මේ සතර කරුණින් වචීපරම වූ මිත්‍රප්‍රතිරූපක අමිත්‍රයා දත යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ගැහැවි පුත, සතර කරුණෙකින් අනුප්‍රියභාණී (අනුකූල වූ පිය බස් කියන) මිත්‍රප්‍රතිරූපක අමිත්‍රයා දතයුතු: (පවක් කරමි යි කී කලැ ඒ) ඔහුගේ පාප ක්‍රියාව ද (මැනැවැ යි) අනුදනී, (පිනක් කරමැ යි කී කලැ ඒ) ඔහුගේ පින් කිරිය ද අනුදනී, සම්මුඛයෙහි ඔහුගේ ගුණ කියි, අසම්මුඛයෙහි ඔහුගේ අගුණ කියි. ගැහැවිපුත, මේ සතර කරුණින් මිත්‍රප්‍රතිරූපක වූ අනුප්‍රියභාණී අමිත්‍රයා දත යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ගැහැවිපුත, සතර කරුණෙකින් මිත්‍රප්‍රතිරූපක වූ අපායසහාය වූ (වස්තු විනාශ කිරීමෙහි යහළු වූ) අමිත්‍රයා දතයුතු: මත් බවට ප්‍රමාදයට කරුණු වූ රහමෙර පීමේ යෙදීමෙහි යහළු වෙයි, නොකල්හි වීථි සංචාරයේ යෙදීමෙහි යහළු වෙයි. නෘත්‍යගීතාදිය දකිනු අසනු පිණිස යෑමෙහි යහළු වෙයි, ප්‍රමාදයට කාරණ වූ දූකෙළියේ යෙදීමෙහි යහළු වෙයි. ගැහැවිපුත, මේ සතර කරුණින් අපාය සහාය වූ මිත්‍ර ප්‍රතිරූපක අමිත්‍රයා දත යුතු.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 300,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉදමවොච භගවා, ඉදං වත්වා සුගතො අථාපරං එතදවොච සත්ථා:"
                    },
                    {
                        "type": "gatha",
                        "text": "“අඤ්ඤදත්ථුහරො මිත්තො යො ච මිත්තො වචීපරො,{1} \nඅනුප්පියඤ්ච යො ආහ අපායෙසු ච යො සඛා.\nඑතෙ අමිත්තෙ චත්තාරො ඉති විඤ්ඤාය පණ්ඩිතො,\nආරකා පරිවජ්ජෙය්ය මග්ගං පටිභයං යථා”ති.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "සුහදමිත්තා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "9. චත්තාරො’ මෙ ගහපතිපුත්ත මිත්තා සුහදා වෙදිතබ්බා: උපකාරො{2} මිත්තො සුහදො වෙදිතබ්බො, සමානසුඛදුක්ඛො මිත්තො සුහදො වෙදිතබ්බො, අත්ථක්ඛායී මිත්තො සුහදො වෙදිතබ්බො, ආනුකම්පකො මිත්තො සුහදො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතූහි ඛො ගහපතිපුත්ත ඨානෙහි උපකාරො මිත්තො සුහදො වෙදිතබ්බො. පමත්තං රක්ඛති, පමත්තස්ස සාපතෙය්යං රක්ඛති, භීතස්ස සරණං හොති, උප්පන්නෙ කිච්චකරණීයෙ තද්දිගුණං භොගං අනුප්පදෙති. ඉමෙහි ඛො ගහපතිපුත්ත චතූහි ඨානෙහි උපකාරො මිත්තො සුහදො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතූහි ඛො ගහපතිපුත්තඨානෙහි සමානසුඛදුක්ඛො මිත්තො සුහදො වෙදිතබ්බො: ගුය්හමස්ස ආචික්ඛති, ගුය්හමස්ස පරිගූහති, ආපදාසු න විජහති, ජීවිතම්පි’ස්ස අත්ථාය පරිච්චත්තං හොති. ඉමෙහි ඛො ගහපතිපුත්ත චතූහි ඨානෙහි සමානසුඛදුක්ඛො මිත්තො සුහදො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතූහි ඛො ගහපතිපුත්ත ඨානෙහි අත්ථක්ඛායී මිත්තො සුහදො වෙදිතබ්බො: පාපා නිවාරෙති, කල්යාණෙ නිවෙසෙති, අස්සුතං සාවෙති, සග්ගස්ස මග්ගං ආචික්ඛති. ඉමෙහි ඛො ගහපතිපුත්ත චතූහි ඨානෙහි අත්ථක්ඛායී මිත්තො සුහදො වෙදිතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතූහි ඛො ගහපතිපුත්ත ඨානෙහි අනුකම්පකො මිත්තො සුහදො වෙදිතබ්බො: අභවෙනස්ස න නන්දති, භවෙනස්ස නන්දති, අවණ්ණං භණමානං නිවාරෙති, වණ්ණං භණමානං පසංසති. ඉමෙහි ඛො ගහපතිපුත්ත චතූහි ඨානෙහි අනුකම්පකො මිත්තො සුහදො වෙදිතබ්බො”ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. වචීපරමො (ස්යා)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. උපකාරකො (ස්යා)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. ශාස්තෘ වූ සුගතයන් වහන්සේ මෙය වදාරා, අනතුරු වැ ගාථාබන්ධන විසින් අනෙකක් වූ මේ වචන වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“යමෙක් අඤ්ඤදත්ථුහර මිත්‍ර නම් වේ ද යමෙක් වචීපරම මිත්‍රනම් වේ ද, යමෙක් අනුප්‍රියභාණී වේ ද, යමෙක් ධන විනාශක ක්‍රියාහි යහලු වේ ද, මෙසේ මේ සතර අමිතුරන් නුවණැත්තේ දැන, උවදුරු ඇති මාර්ගයක් සේ දුරින් ම දුරු කරන්නේ ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "සුහෘන්මිත්‍රයෝ",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "9. ගැහැවි පුත, මේ සුහෘද වූ සතර මිතුරෝ දත යුතු හ: උපකාරී වූ සුහද මිතුරා දත යුතු. සමාන සුඛ දුඃඛ වූ සුහද සුමිතුරා දත යුතු. අර්ථාඛ්‍යායී (වැඩට නිසි කරුණු ම කියන) සුහද මිතුරා දත යුතු. ආනුකම්පක (අනුකම්පා කරන) සුහද මිතුරා දත යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ගැහැවි පුත, සතර කරුණෙකින් උපකාරී වූ සුහෘද මිත්‍රයා දතයුතු: මත් වැ වැදැහෙන මිතුරා රැකගනී, මත් වැ වැදැහෙන්නාහුගේ ධනය රැක දෙයි, බියට පැමිණි මිතුරාට පිහිට වෙයි, කළයුතු කාර්‍ය්‍යයක් උපන් කලැ අවශ්‍ය ප්‍රමාණය මෙන් දෙගුණයක් ධනය දෙයි. ගැහැවි පුත, ම සතර කරුණින් උපකාරී වූ සුහෘද මිතුරා දත යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ගැහැවි පුත, සතර කරුණෙකින් සමාන සුව දුක් ඇති (සැප දුක් දෙක්හි ම සමාන වැ හිතෛෂී ව පවත්නා) මිතුරා දත යුතු: සැඟෙවියැ යුතු රහස් සිය මිතුරාට නොසඟොවා කියයි, ඒ මිතුරාගේ සැඟෙවියැ යුතු රහස් සඟොවා රකියි, විපත්තීන්හිදී නො අත්හරී, මිතුරා විසින් ඔහු පිණිස සිය දිවි වුව ද පරිත්‍යක්ත වෙයි (සිය දිවි ද නො තකා මිතුරාගේ කටයුතු කැරැදෙයි). ගැහැවිපුත, මේ සතර කරුණින් සමාන සුඛ දුඃඛ සුහද මිතුරා දත යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ගැහැවි පුත, සතර කරුණෙකින් අර්ථාඛ්‍යායී (දෙලෝවැඩ පවසන) සුහද මිතුරා දත යුතු: පවින් වළක්වයි, පිනෙහි යොදාලයි, පෙරැ නො ඇසූ දහම් අස්වයි, සුගතියට මඟ කියා දෙයි. ගැහැවිපුත, මේ සතර කරුණින් අර්ථාඛ්‍යායී සුහද මිතුරා දත යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ගැහැවි පුත, සතර කරුණෙකින් ආනුකම්පක සුහෘද මිත්‍රයා දත යුතු: ඔහුගේ පිරිහීමෙන් නො සතුටු වෙයි, ඔහුගේ අභිවෘද්ධියෙන් සතුටු වෙයි, මිතුරාගේ අගුණ කියන්නහු වළක්වයි, මිතුරාගේ ගුණ කියන්නහු පසසයි, ගැහැවි පුත, මේ සතර කරුණින් ආනුකම්පක (අනුකම්පා කරන) සුහද මිතුරා දත යුතු.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 302,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉදමවොච භගවා, ඉදං වත්වා සුගතො, අථාපරං එතදවොච සත්ථා:"
                    },
                    {
                        "type": "gatha",
                        "text": "10. “උපකාරො ච යො මිත්තො යො ච මිත්තො සුඛෙ දුඛෙ{1} \nඅත්ථක්ඛායී ච යො මිත්තො යො ච මිත්ෙතා’නුකම්පකො.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "එතෙ පි මිත්තෙ චත්තාරො ඉති විඤ්ඤාය පණ්ඩිතො\nසක්කච්චං පයිරුපාසෙය්ය මාතා පුත්තං’ව ඔරසං.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "පණ්ඩිතො සීලසම්පන්නො ජලං අග්ගී ව භාසති\nභොගෙ සංහරමානස්ස භමරස්සෙව ඉරීයතො\nභොගා සන්නිචයං යන්ති වම්මිකො’වුපචීයති.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "එවං භොගෙ සමාහත්වා{2} අලමත්තො කුලෙ ගිහී\nචතුධා විභජෙ භොගෙ ස වෙ මිත්තානි ගන්ථති.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "එකෙන භොගෙ භුඤ්ජෙය්ය ද්වීහි කම්මං පයොජයෙ\nචතුත්ථඤ්ච නිධාපෙය්ය ආපදාසු භවිස්සතී”ති.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "ඡද්දිසාපටිච්ඡාදනං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "11. කථඤ්ච ගහපතිපුත්ත අරියසාවකො ඡද්දිසාපටිච්ඡාදී හොති? ඡයිමා ගහපතිපුත්ත දිසා වෙදිතබ්බා: පුරත්ථිමා දිසා මාතාපිතරො වෙදිතබ්බා දක්ඛිණා දිසා ආචරියා වෙදිතබ්බා. පච්ඡිමා දිසා පුත්තදාරා වෙදිතබ්බා. උත්තරා දිසා මිත්තාමච්චා වෙදිතබ්බා. හෙට්ඨිමා දිසා දාසකම්මකරා වෙදිතබ්බා. උපරිමා දිසා සමණබ්රාහ්මණා වෙදිතබ්බා."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සුඛෙ දුක්ඛෙ ච යෙ සඛා (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. සමාහරිත්වා (ස්යා)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළසේක. ශාස්තෘ වූ සුගතයන් වහන්සේ මෙය වදාරා, අනතුරු වැ (ගාථාබන්ධන විසින්) අනෙකක් වූ මේ වචන වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "10. “යම් උපකාරී මිතුරෙක් වේද, සුවදුක් දෙක්හි ම යමෙක් යහළු ද, යම් මිතුරෙක් දෙලෝ වැඩට මඟ කියන්නේ ද, යම් මිතුරෙක් අනකම්පා කරන්නේ ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මෙසේ නුවණැත්තේ මේ සතර මිතුරන් ම දැන, මව ළෙහි දා පුතක්හු සෙයින් සත්කාර කොට ඇසුරු කරන්නේ ය,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(සැබෑමිතුරන් ඇසුරු කරන) නුවණැති සිල්වත් තැනැත්තේ දිලියෙන ගින්නක් සේ බබලයි. (මල නො පෙළා) මල් පැණි රැස් කොට මි බඳින බමරක්හු සෙයින් (මෙරමා නො පෙ ළා) භෝග රැස් කරන්නහුගේ භොගසම්පත්හු වැඩීමට යෙත්. ක්‍රමයෙන් සුඹසක් පස්කැට රැස් කොට බඳිනු ලබන්නාක් මෙනි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මෙසේ භෝගයන් එක්රැස් කොට ගිහිගෙහි වසන්නට සමර්ථ වූ ගෘහස්ථ තෙම භෝගයන් සතර කොටසක් කොට බෙදන්නේ ය. හේ ඒකාන්තයෙන් මිතුරන් බැඳගනී (බිඳී යනු නොදී රැකගන්නට සමත් වෙයි).",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එක් කොටසෙකින් භෝගසම්පත් වළඳන්නේ ය, කොටස් දෙකෙකින් (කෘෂි වණික්කර්මාදි) කර්මාන්ත යොදන්නේ ය, විපතක් පැමිණි කල්හි ප්‍රයෝජන පිණිස වන්නේ යැ යි සලකා සතර වන කොටස නිදහන් කොට තබන්නේ ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 21,
                        "text": "සදිසා වැඳීම",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "11. ගැහැවි පුත, කෙසේ නම් ආර්‍ය්‍යශ්‍රාවක තෙමේ සදිසා හවුරන්නේ වේ ද? ගැහැවි පුත, මේ ස දිසා දත යුතු: මාපියෝ පෙර දිසාව යැ යි දත යුතු. ආචාර්යයෝ දකුණු දෙස යැ යි දත යුතුහ. අඹුදරුවෝ පැසිම් දෙස යැ යි දත යුතු හ. මිත්‍රාමාත්‍යයෝ උතුරු දෙස යැ යි දත යුතු හ. දැසි දස් කම්කරුවෝ යට දෙසැ යි තද යුතු හ. මහණ බමුණෝ උඩ දෙස යැයි දත යුතු හ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 304,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පඤ්චහි ඛො ගහපතිපුත්ත ඨානෙහි පුත්තෙන පුරත්ථිමා දිසා මාතාපිතරො පච්චුපට්ඨාතබ්බා: භතො නෙ සම්භරිස්සාමි{1}, කිච්චං නෙසං කරිස්සාමි, කුලවංසං ඨපෙස්සාමි, දායජ්ජං පටිපච්ඡාමි{2}, අථ වා පන පෙතානං කාලකතානං දක්ඛිණං අනුප්පදස්සාමී”ති. ඉමෙහි ඛො ගහපතිපුත්ත පඤ්චහි ඨානෙහි පුත්තෙන පුරත්ථිමා දිසා මාතාපිතරො පච්චුපට්ඨිතා පඤ්චහි ඨානෙහි පුත්තං අනුකම්පන්ති: පාපා නිවාරෙන්ති, කළ්යාණෙ නිවෙසෙන්ති, සිප්පං සික්ඛාපෙන්ති, පතිරූපෙන දාරෙන සංයොජෙන්ති, සමයෙ දායජ්ජං නිය්යාතෙන්ති{3}. ඉමෙහි ඛො ගහපතිපුත්ත පඤ්චහි ඨානෙහි පුත්තෙන පුරත්ථිමා දිසා මාතාපිතරො පච්චුපට්ඨිතා ඉමෙහි පඤ්චහි ඨානෙහි පුත්තං අනුකම්පන්ති. එවමස්ස එසා පුරත්ථිමා දිසා පටිච්ඡන්නා හොති ඛෙමා අප්පටිභයා."
                    },
                    {
                        "type": "paragraph",
                        "text": "12. පඤ්චහි ඛො ගහපතිපුත්ත ඨානෙහි අන්තෙවාසිනා දක්ඛිණා දිසා ආචරියා පච්චුපට්ඨාතබ්බා: උට්ඨානෙන, උපට්ඨානෙන, සුස්සුසාය, පාරිචරියාය, සක්කච්චං සිප්පපටිග්ගහණෙන{4}."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙහි ඛො ගහපතිපුත්ත පඤ්චහි ඨානෙහි අන්තෙවාසිනා දක්ඛිණා දිසා ආචරියා පච්චුපට්ඨිතා, පඤ්චහි ඨානෙහි අන්තෙවාසිං අනුකම්පන්ති: සුවිනීතං විනෙන්ති, සුග්ගහිතං ගාහාපෙන්ති, සබ්බසිප්පසුතං සමක්ඛායිනො භවන්ති, මිත්තාමච්චෙසු පටියාදෙන්ති{5}, දිසාසු පරිත්තාණං කරොන්ති. ඉමෙහි ඛො ගහපතිපුත්ත පඤ්චහි ඨානෙහි අන්තෙවාසිනා දක්ඛිණා දිසා ආචරියා පච්චුපට්ඨිතා, ඉමෙහි පඤ්චහි ඨානෙහි අන්තෙවාසිං අනුකම්පන්ති. එවමස්ස එසා දක්ඛිණා දිසා පටිච්ඡන්නා හොති ඛෙමා අප්පටිභයා."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. නෙසං භරිස්සාමි (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. පටිපජ්ජාමි (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "3. නිය්ය දෙන්ති (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "4. සිප්පං පටිග්ගහණෙන (ස්යා) සිප්පඋග්ගහණෙන (කම්)"
                    },
                    {
                        "type": "footnote",
                        "text": "5. පටිවෙදෙන්ති (ස්යා)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ගැහැවි පුත, කරුණු පසෙකින් පුතු විසින් පෙර දෙස වූ මාපියෝ උපස්ථාන කළ යුතු: ඔවුන් විසින් පෝෂිත වූ මම් මහලු ව සිටින ඔවුන් පෝෂිත කරන්නෙමි යි ද, ඔවුනට (මාපියනට) පැමිණි කටයුතු (ඔවුන් වෙනුනවට) මම් කරන්නෙමි යි ද, (මා පිය සතු වස්තුව නො නසා රක්නෙම්) කුල පරපුර රැකගන්නෙමි යි ද, මා පියන්ගෙන් ලත් දෑවෑද්ද (ඔවුන් ඔවා පරිදි පවත්වන්නෙම්) බුත්ති විඳින්නෙමි යි ද, නැවැත, කලුරිය කළ පරලෝ ගි මාපියනට (දන් දී) පින් දෙන්නෙමි යි දැ යි මේ කරුණු පසින් පුතු විසින් පෙර දිසා වූ මා පියෝ උපස්ථිත වූහු (උවතන් කරනු ලදහු) කරුණු පසෙකින් පුතුට අනුකම්පා කෙරෙත්. (මාපියෝ) පුතු පවින් වළක්වත්, පිනෙහි යොදාලත්, ශිල්ප හදාරවත්, සුදුසු වූ ස්ත්‍රියක හා සංයුක්ත කෙරෙත් (ස්ත්‍රියක පාවා දෙත්), සුදුසු කල්හි දෑවෑද්ද (උරුම වූ වස්තුව) පවරා දෙත්. ගැහැවි පුත, මෙකී කරුණු පසින් පුත්‍රයා විසින් පූර්ව දිශාව වූ මා පියෝ උවටන් කරනු ලැබුවාහු, මේ දෙවැනි ව කී කරුණු පසින් පුතුට අනුග්‍රහ කරත්. මෙසේ ඔහු විසින් මේ පූර්ව දිශාව (එයින් බියක් නො එන පරිදි) උපද්‍රව රහිත කොට ප්‍රතිභය රහිත කොට හවුරන ලද්දේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "12. ගැහැවිපුත, දකුණ දිග වූ ආචාර්යයෝ අතවැස්සා විසින් පස් කරුණෙකින් උපස්ථාතව්‍ය වෙත් (උවතන් කළ යුතු වෙත්): ඇදුරුහු දැක හුනස්නෙන් නැඟී සිටීමෙන් ද, උවටන් කිරීමෙන් ද, උගන්වන දෑ අසනු කැමැතිවීමෙන් ද (නොහොත් හදහා ඇසීමෙන් ද), වතාවත් කිරීමෙන් ද උගන්වන ශිල්ප සකසා පිළගැනීමෙන් ද යන මේ කරුණු පසිනි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ගැහැවිපුත, අතවැස්සා විසින් මේ කරුණු පසින් දක්ෂිණදිශා සංඛ්‍යාත ආචාර්යයෝ උපස්ථිත වූහු, කරුණු පසෙකින් අතවැස්සාට අනුග්‍රහ කරත්: අතවැස්සා මොනොවට හික්මවත්, ඔහුට මොනොවට උගන්වත්, තමන් අසා ගත් සියලු ශිල්ප (අතවැස්සාට) මොනොවට කියන්නාහු වෙත්. මිත්‍රාමාත්‍යයන් කෙරෙහි පිහිටුවති, දිශාවන්හි ආරක්ෂාව සලස්වත්. ගැහැවිපුත, මේ කරුණු පසින් උපස්ථිත වූ (උවටන් කරනු ලැබූ) ආචාර්යයෝ කරුණු පසෙකින් අතවැස්සාට අනුකම්පා කරත්. මෙසේ ඔහු විසින් මේ දක්ෂිණ දිශාව උපද්‍රව රහිත කොට, ප්‍රතිභය රහිත කොට හවුරන ලද්දේ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 306,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "13. පඤ්චහි ඛො ගහපතිපුත්ත ඨානෙහි සාමිකෙන පච්ඡිමා දිසා භරියා පච්චුපට්ඨාතබ්බා: සම්මානනාය අනවමානනාය,{1} අනතිචරියාය, ඉස්සරියවොස්සග්ගෙන, අලඞ්කාරානුප්පදානෙන. ඉමෙහි ඛො ගහපතිපුත්ත පඤ්චහි ඨානෙහි සාමිකෙන පච්ඡිමා දිසා භරියා පච්චුපට්ඨිතා, පඤ්චහි ඨානෙහි සාමිකං අනුකම්පති: සුසංවිහිතකම්මන්තා ච හොති, සුසංගහිතපරිජනා ච{2}, අනතිචාරිනී ච, සම්භතං අනුරක්ඛති, දක්ඛා ච හොති අනලසා සබ්බකිච්චෙසු. ඉමෙහි ඛො ගහපතිපුත්ත පඤ්චහි ඨානෙහි සාමිකෙන පච්ඡිමා දිසා භරියා පච්චුපට්ඨිතා ඉමෙහි පඤ්චහි ඨානෙහි සාමිකං අනුකම්පති. එවමස්ස එසා පච්ඡිමා දිසා පටිච්ඡන්නා හොති ඛෙමා අප්පටිභයා."
                    },
                    {
                        "type": "paragraph",
                        "text": "14. පඤ්චහි ඛො ගහපතිපුත්ත ඨානෙහි කුලපුත්තෙන උත්තරා දිසා මිත්තාමච්චා පච්චුපට්ඨාතබ්බා: දානෙන, පෙය්යවජ්ජෙන{3}, අත්ථචරියාය සමානත්තතාය, අවිසංවාදනතාය. ඉමෙහි ඛො ගහපතිපුත්ත පඤ්චහි ඨානෙහි කුලපුත්තෙන උත්තරා දිසා මිත්තාමච්චා පච්චුපට්ඨිතා පඤ්චහි ඨානෙහි කුලපුත්තං අනුකම්පන්ති: පමත්තං රක්ඛන්ති, පමත්තස්ස සාපතෙය්යං රක්ඛන්ති, භීතස්ස සරණං හොන්ති, ආපදාසු න විජහන්ති, අපරපජා චස්ස පටිපූජෙන්ති. ඉමෙහි ඛො ගහපතිපුත්ත පඤ්චහි ඨානෙහි කුලපුත්තෙන උත්තරා දිසා මිත්තාමච්චා පච්චුපට්ඨිතා ඉමෙහි පඤ්චහි ඨානෙහි කුලපුත්තං අනුකම්පන්ති. එවමස්ස එසා උත්තරා දිසා පටිච්ඡන්නා හොති ඛෙමා අප්පටිභයා."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අවිමානනාය (ස්යා PTS)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. සඞ්ගහිත පරිජනා ච (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "3. පියවජ්ජනෙ (ස්යා කම්)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "13. ගැහැවිපුත, කරුණු පසෙකින් සැමියා විසින් පැසිම් දෙස වූ භාර්‍ය්‍යාව උපස්ථාතව්‍ය (උවටන් කළ යුතු) වෙයි: සම්භාවන වචනයෙන් ද අවමන් බස් නොකීමෙන් ද, පරඹුවන් කරා නො යෑමෙන් ද, ගෙහි කටයුතුවල අධිපති බව ඇයට බාර දීමෙන් ද, තමන් පහොසත් පරිදි ඇඳුම් පැලැඳුම් සපයා දීමෙන්ද යන කරුණු පසිනි. ගැහැවි පුත, මේ කරුණු පසින් සැමියා විසින් පශ්චිමදිශා සංඛ්‍යාත භාර්‍ය්‍යාව උවටන් කරනු ලැබුවා, කරුණු පසෙකින් සැමියාට අනුකම්පා කෙරෙයි: (කැඳබත් පිසීම් ඈ විසින් කලට වේලාවට) මනා කොට කරන ලද කර්මාන්ත ඇත්තී ද වෙයි, මොනොවට සංග්‍රහ කරන ලද පරිවාර ජනයා ඇත්තී ද වෙයි, සැමියා හැර අන් පුරුෂයකු සිතිනුදු නො පතන්නී වෙයි, සැමියා විසින් ගෙනෙන ලද ධනය රකියි, සියලු කටයුත්තෙහි දක්ෂ ද නොමැලි ද වෙයි. ගැහැවිපුත, මේ කරුණු පසින් සැමියා විසින් පශ්චිම දිශාසංඛ්‍යාත භාර්‍ය්‍යාව උපස්ථිත වූවා (උවටන් කරන ලද්දි) මේ පසුවැ කී කරුණු පසින් සැමියාට අනුග්‍රහ කෙරෙයි. මෙසේ ඔහු විසින් මේ පැසිමදෙස නිරුපද්‍රැත ව, ප්‍රතිභය රහිත ව හවුරන ලද්දේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "14. ගැහැවි පුත, කුලපුතු විසින් කරුණු පසෙකින් උත්තර දිශා නැමැති මිත්‍රමාත්‍යයෝ (මිත්‍රයෝ ද සැප දුක දෙකෙහි එක් වැ කටයුතු කරන්නෝ ද) උවටන් කළයුතු හ: දානයෙන් ද ප්‍රිය වචනයෙන් ද අර්ථචර්‍ය්‍යායෙන් ද සමානාත්මතායෙන් ද නොරවටන බැවින් ද යන පසිනි. ගැහැවි පුත, මේ පස් කරුණින් කුලපුතු විසින් උත්තර දිශාව වූ මිත්‍රාමාත්‍යයෝ උවටන් කරන ලද්දාහු, කරුණු පසෙකින් කුලපුතුට අනුකම්පා කරත්: රහමෙරින් මත් වූවහු රැකගනිත්, මත් වැ හොත්තහුගේ වස්තුව රැක දෙත්, උවදුරකට පැමිණියාහට පිහිට වෙත්, විපත්හි දී අත් නො හරිත්, ඔහුගේ දරුමුනුබුරනට ද මමත්වයෙන් සංග්‍රහ කරත්. ගැහැවිපුත, මේ කරුණු පසින් කුලපුතු විසින් උත්තරදිශා සංඛ්‍යාත මිත්‍රාමාත්‍යයෝ උවටන් කරන ලදුවෝ, පසු වැ කී කරුණු පසින් කලුපුතුට අනුග්‍රහ කෙරෙත්. මෙසේ ඔහු විසින් මේ උතුරු දෙස නිරුපද්‍රැත කොට, ප්‍රතිභය රහිත කොට, හවුරන ලද්දේ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 308,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "15. පඤ්චහි ඛො ගහපතිපුත්ත ඨානෙහි අයිරකෙන{1} හෙට්ඨිමා දිසා දාසකම්මකරා පච්චුපට්ඨාතබ්බා: යථාබලං කම්මන්තසංවිධානෙන, භත්තවෙතනානුප්පදානෙන, ගිලානුපට්ඨානෙන, අච්ඡරියානං රසානං සංවිභාගෙන, සමයෙ වොස්සග්ගෙන. ඉමෙහි ඛො ගහපතිපුත්ත පඤ්චහි ඨානෙහි අයිරකෙන හෙට්ඨිමා දිසා දාසකම්මකරා පච්චුපට්ඨිතා පඤ්චහි ඨානෙහි අයිරකං අනුකම්පන්ති. පුබ්බුට්ඨායිනො ච හොන්ති, පච්ඡානිපාතිනො ච දින්නාදායිනො ච, සුකතකම්මකරා ච, කිත්තිවණ්ණහරා ච. ඉමෙහි ඛො ගහපතිපුත්ත පඤ්චහි ඨානෙහි අයිරකෙන හෙට්ඨිමා දිසා දාසකම්මකරා පච්චුපට්ඨිතා ඉමෙහි පඤ්චහි ඨානෙහි අයිරකං අනුකම්පන්ති. එවමස්ස එසා හෙට්ඨිමා දිසා පටිච්ඡන්නා හොති ඛෙමා අප්පටිභයා."
                    },
                    {
                        "type": "paragraph",
                        "text": "16. පඤ්චහි ඛො ගහපතිපුත්ත ඨානෙහි කුලපුත්තෙන උපරිමා දිසා සමණබ්රාහ්මණා පච්චුපට්ඨාතබ්බා: මෙත්තෙන කායකම්මෙන මෙත්තෙන වචීකම්මෙන, මෙත්තෙන මනොකම්මෙන, අනාවටද්වාරතාය, ආමිසානුප්පදානෙන. ඉමෙහි ඛො ගහපතිපුත්ත පඤ්චහි ඨානෙහි කුලපුත්තෙන උපරිමා දිසා සමණබ්රාහ්මණා පච්චුපට්ඨිතා ඡහි ඨානෙහි කුලපුත්තං අනුකම්පන්ති. පාපා නිවාරෙන්ති, කල්යාණෙ නිවෙසෙන්ති, කල්යාණෙන මනසා අනුකම්පන්ති, අස්සුතං සාවෙන්ති, සුතං පරියොදපෙන්ති, සග්ගස්ස මග්ගං ආචික්ඛන්ති. ඉමෙහි ඛො ගහපතිපුත්ත ඡහි ඨානෙහි කුලපුත්තෙන උපරිමා දිසා සමණබ්රාහ්මණා පච්චුපට්ඨිතා ඉමෙහි ඡහි ඨානෙහි කුලපුත්තං අනුකම්පන්ති. එවමස්ස එසා උපරිමා දිසා පටිච්ඡන්නා හොති ඛෙමා අප්පටිභයා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදමවොච භගවා. ඉදං වත්වා සුගතො අථාපරං එතදවොච සත්ථා:"
                    },
                    {
                        "type": "gatha",
                        "text": "17. “මාතාපිතා දිසා පුබ්බා ආචරියා දක්ඛිණා දිසා\nපුත්තදාරා දිසා පච්ඡා මිත්තාමච්චා ච උත්තරා.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "දාසකම්මකරා හෙට්ඨා උද්ධං සමණබ්රාහ්මණා\nඑතා දිසා නමස්සෙය්ය අලමත්තො කුලෙ ගිහී.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අසසිරකෙන (මඡසං)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "15. ගැහැවි පුත, කරුණු පසෙකින් ස්වාමියා විසින් යට දිසාව යැ යි කියන ලද දැසි දස් කම්කරුවෝ උවටන් කළ යුතු හ: ඔවුන්ගේ ශක්තියට අනුරූප ලෙස කර්මාන්ත විධාන කිරීමෙන් ද බත් වැටුප් දීමෙන් ද, ගිලන් වූ කල ඔවුනට නිසි උපස්ථාන යොදාලීමෙන් ද, මිහිර රස බොජුන් (තමා හුදෙකලාව නො වළඳා) ඔවුනටත් දීමෙන් ද සුදුස කාලයන්හි වැඩෙන් මුදා හැරීමෙන් ද යන පසිනි. ගැහැවි පුත, මේ කරුණු පසින් ස්වාමියා විසින් යට දෙස යැ යි කියන ලද දැසි දස් කඹුරෝ උවටන් කරන ලද්දාහු මේ කරුණු පසෙකින් ස්වාමියාට අනුග්‍රහ කරත්: ස්වාමියාට පළමුවෙන් ම නැඟී සිටින්නාහු ද වෙත්, ස්වාමියාට පසු ව නිදන්නාහු ද වෙත්, (කිසිත් හොරා නොගන්නාහු) ස්වාමියා දුන් දැය ම ගන්නා සුලු වෙත්, මනා කොට කරන ලද කර්මාන්ත ඇත්තාහු ද වෙත්, ස්වාමියාගේ ගුණ කථාව පතුරුවන්නාහු ද වෙත්. ගැහැවිපුත, මේ පස් කරුණින් ස්වාමියා විසින් යට දෙස නැමැති දැසි දස් කඹුරෝ උවටන් කරනු ලැබුවාහු, පසු වැ කී කරුණු පසින් ස්වාමියාට අනුග්‍රහ කරත්. මෙසේ ඔහු විසින් මේ යට දෙස නිරුපද්‍රැත කොට ප්‍රතිභය රහිත කොට හවුරන ලද්දේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "16. ගැහැවි පුත, කරුණු පසෙකින් කුලපුතු විසින් උපරිම දිශාසංඛ්‍යාත මහණ බමුණෝ උවටන් කළ යුතු හ: මෛත්‍රී සහගත කායකර්මයෙන්, මෛත්‍රී සහගත වාක්කර්මයෙන්, මෛත්‍රී සහගත මනඃකර්මයෙන්, නො වැසූ දොර ඇති බැවින්, ආහාරපාන සැපයීමෙන් යන පසිනි. ගැහැවිපුත, මේ පස් කරුණින් කුලපුතු විසින් උඩ දිසාව යැ යි කියන ලද මහණ බමුණෝ උපස්ථිත වූවාහු, කරුණු සයෙකින් කුලපුතුට අනුග්‍රහ කෙරෙත්: පවින් වළකාලත්, පිණෙහි යොදාලත්, කලන සිතින් අනුග්‍රහ කෙරෙත්, නො ඇසූ විරූ දහම් අස්වත්, අසා ඇති දහම් (සැක දුරැලැවීමෙන්) පිරිසිදු කරවත්, සුගතියට මඟ කියත්. ගැහැවිපුත, මේ කරුණු සයින් කුලපුතු විසින් උපරිම දිශාසංඛ්‍යාත මහණ බමුණෝ උවටන් කරන ලද්දාහු, මේ කරුණු සයින් කුපුතුට අනුග්‍රහ කෙරෙත්. මෙසේ ඔහු විසින් මේ උඩ දෙස නිරපද්‍රැත කොට, ප්‍රතිභය රහිත කොට, හවුරන ලද්දේ වෙයි.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. ශාස්තෘ වූ සුගතයන් වහන්සේ මෙය වදාරා ගාථා බන්ධන විසින් අනෙකක් වූ මේ වචන වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මා පියෝ පෙර දෙස ය. ආචාර්යයෝ දකුණු දෙස ය, අඹුදරුවෝ පැසිම් දෙස ය, මිත්‍රාමාත්‍යයෝ උතුරු දෙස ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "දැසි දස් කඹුරෝ යට දෙස ය, මහණ බමුණෝ උඩ දෙස ය. කුලයෙහි (කුලය රැක්මෙහි) සමර්ථ ස්වභාවය ඇති ගෘහස්ථ තෙමේ මේ ස දිසා නමඳනේය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 310,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "පණ්ඩිතො සීලසම්පන්නො සණ්හො ච පටිභානවා,\nනිවාතවුත්ති අත්ථද්ධො තාදිසො ලභතෙ යසං.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "උට්ඨානකො අනලසො ආපදාසු න වෙධති,\nඅච්ඡින්නවුත්ති මෙධාවී තාදිසො ලභතෙ යසං.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "සඞ්ගාහකො මිත්තකරො වදඤ්ඤූ වීතමච්ඡරො,\nනෙතා විනෙතා අනුනෙතා තාදිසො ලභතෙ යසං.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "දානඤ්ච පෙය්යවජ්ජඤ්ච අත්ථචරියා ච යා ඉධ,\nසමානත්තතා ච ධම්මෙසු තත්ථ තත්ථ යථාරහං,",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "එතෙ ඛො සඞ්ගහා ලොකෙ රථස්සාණී’ව යායතො,\nඑතෙ ච සඞ්ගහා නාස්සු න මාතා පුත්තකාරණා,\nලභෙථ මානං පූජං වා පිතා වා පුත්තකාරණා.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "යස්මා ච සඞ්ගහෙ එතෙ සමවෙක්ඛන්ති{1} පණ්ඩිතා,\nතස්මා මහත්තං පප්පොන්ති පාසංසා ච භවන්ති තෙ”ති.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "18. එවං වුත්තෙ සිගාලකො{2} ගහපතිපුත්තො භගවන්තං එතදවොච: අභික්කන්තං භන්තෙ, අභික්කන්තං භන්තෙ. සෙය්යථාපි භන්තෙ නික්කුජ්ජිතං වා උක්කුජ්ජෙය්ය, පටිච්ඡන්නං වා විවරෙය්ය, මූළ්හස්ස වා මග්ගං ආචික්ඛෙය්ය, අන්ධකාරෙ වා තෙලපජ්ජොතං ධාරෙය්ය චක්ඛුමන්තො රූපානි දක්ඛන්තීති. එවමෙව භගවතා අනෙකපරියායෙන ධම්මො පකාසිතො. එසාහං භන්තෙ භගවන්තං සරණං ගච්ඡාමි, ධම්මඤ්ච භික්ඛුසංඝඤ්ච. උපාසකං මං භගවා ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "සිගාලසුත්තං නිට්ඨිතං අට්ඨමං.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සම්මපෙක්ඛන්ති (මඡසං)"
                    },
                    {
                        "type": "footnote",
                        "text": "2. සිඞ්ගාලොවාදසුත්තංතං (PTS)"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "පණ්ඩිත වූ, සිල්වත්, සියුම් අරුත් දන්නා, වැටැහෙන නුවණැති, යටත් පැවැතුම් ඇති, හැඩි දැඩි නොවූ, එබඳු තැනැත්තේ යශස් ලබයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "නැඟී සිටුනා (උට්ඨානවීර්ය යුක්ත) අලස නො වූ තැනැත්තේ ආපදාවන්හිදී නො සැලෙයි. අඛණ්ඩ වෘත්ති ඇති, ස්ථානොචිත ප්‍රඥා ඇති, එ බඳු තැනැත්තේ යශස් ලබයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "සිවු සඟරාවතින් සංග්‍රහ කරන, මිතුරන් සොයන, වදාන්‍ය වූ, පහ වූ මසුරු බව ඇති, කරුණු දක්වා මඟ පෙන්වන, හික්මවන, පුන පුනා මඟ පෙන්වන, එබඳු තැනැත්තේ යශස් ලබයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "දානය ද ප්‍රිය වචන ද මෙහි යම් අර්ථචර්‍ය්‍යාවෙක් වේ නම් එය ද, ඒ ඒ පුඟුලා කෙරෙහි සුදුසු පරිදි, ධර්මයන්හි සුදුසු පරිදි සමානාත්මතාව ද, ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "යන මොහු යන්නාවූ රියකට එහි ඇණය මෙන් ලොවැ සඞ්ග්‍රහයෝ ය. මේ සංග්‍රහයෝ නො මැත්තාහු නම්, පුතුගේ කරුණින් මව හෝ පුතුගේ කරුණින් පියා හෝ බුහුමනක් හෝ පූජාවකේ හෝ නොලබන්නේ ය."
                    },
                    {
                        "format": 13,
                        "text": "යම් හෙයෙකින් පණ්ඩිතයෝ මේ සඞ්ග්‍රහයන් මොනොවට දක්නාහු ද, එහයෙින් මහත්ත්වයට පැමිණෙත්. ඔහු සෙසු ලෝ වැස්සා විසින් පැසැසියැ යුත්තෝ ද වෙත්.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "18. මෙසේ වදාළ කල්හි ගැහැවිපුත් සිගාලක තෙමේ භාග්‍යවතුන් වහන්සේට, “වහන්ස, අභිකාන්ත යැ, වහන්ස, අභිකාන්ත යැ. වහන්ස, යම්සේ යටිකුරු කළ දැයක් උඩුකුරු කරන්නේ හෝ වේ ද, වැසුණු දැයක් විවෘත කරන්නේ හෝ වේ ද, මුළා වූවක්හට මඟ කියන්නේ හෝ වේ ද, ‘ඇස් ඇතියන් රෑප දකිති’ යි අඳුරෙහි තෙල් පහනක් දරන්නේ හෝ වේ ද, එ පරිද්දෙන් ම භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් කාරණයෙන් ධර්මය පැවැසිණ. වහන්ස, ඒ මම් භාග්‍යවතුන් වහන්සේ සරණ යෙමි, ධර්මය ද භික්ෂුසඞ්ඝයා ද සරණ යෙමි. වහන්ස, භාග්‍යවතුන් වහන්සේ මා අද පටන් කොට යව්දව් සරණ ගිය උවසක්හු කොට සලකන සේක් ව’ යි මේ වචන කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 16,
                        "text": "අට වැනි සිගාලක සූත්‍රය නිමියේ යැ.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ]
}