{
    "filename": "dn-3-6",
    "bookId": 12,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 194,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "6.",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "පාසාදිකසුත්තං",
                        "level": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "1. එවං මෙ සුතං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකං සමයං භගවා සක්කෙසු විහරති, වෙධඤ්ඤා නාම සක්යා, තෙසං අම්බවනෙ පාසාදෙ."
                    },
                    {
                        "type": "centered",
                        "text": "නිගණ්ඨනාතපුත්තකාලකිරියා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන නිගණ්ඨො නාතපුත්තො{1} පාවායං අධුනා කාලකතො හොති. තස්ස කාලකිරියාය භින්නා නිගණ්ඨා ද්වෙධිකජාතා භණ්ඩනජාතා කලහජාතා විවාදාපන්නා අඤ්ඤමඤ්ඤං මුඛසත්තීහි විතුදන්තා විහරන්ති “න ත්වං ඉමං ධම්මවිනයං ආජානාසි, අහං ඉමං ධම්මවිනයං ආජානාමි. කිං ත්වං ඉමං ධම්මවිනයං ආජානිස්සසි! මිච්ඡාපටිපන්නො ත්වමසි, අහමස්මි සම්මාපටිපන්නො. සහිතම්මෙ, අසහිතන්තෙ. පුරෙ වචනීයං පච්ඡා අවච, පච්ඡා වචනීයං පුරෙ අවච. අචිණ්ණං න්තෙ විපරාවත්තං, ආරොපිතො තෙ වාදො, නිග්ගහිතො ත්වමසි චර වාදප්පමොක්ඛාය, නිබ්බෙඨෙහි වා සචෙ පහොසී”ති. වධො යෙව ඛො{2} මඤ්ඤෙ නිගණ්ඨෙසු නාතපුත්තියෙසු අනුවත්තති යෙ පි නිගණ්ඨස්ස නාතපුත්තස්ස සාවකා ගිහී ඔදාතවසනා, තෙ තෙසු නිගණ්ඨෙසු නාතපුත්තියෙසු නිබ්බින්නරූපා විරත්තරූපා පටිවානරූපා, යථා තං දුරක්ඛාතෙ ධම්මවිනයෙ දුප්පවෙදිතෙ අනිය්යානිකෙ අනුපසමසංවත්තනිකෙ අසම්මාසම්බුද්ධප්පවෙදිතෙ භින්නථූපෙ අප්පටිසරණෙ."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. නාටපුත්තො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. වධො යෙවෙකො - කම්."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "6.",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "පාසාදික සූත්‍රය",
                        "level": 3
                    },
                    {
                        "format": 13,
                        "text": "1. මා විසින් මෙසේ අසන ලදී;",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ ශාක්‍ය ජනපදයෙහි වෙධඤ්ඤ නම් යම් ශාක්‍ය රජදරු කෙනෙක් වූහු ද, ඔවුන්ගේ අඹ වෙනෙහිවූ ප්‍රාසාදයෙහි වැඩ වසන සේක.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "එ සමයෙහි වූ කලි ඥාතපුත්‍ර නිර්ග්‍රන්ථ තෙමේ පාවා නුවරෙහි දී නොබෝ දවසකට පෙරැ කලුරිය කෙළේ වෙයි. ඔහුගේ කාලක්‍රියායෙන් පසු නොමනා කොට කියන ලද, නොමනා කොට දන්වනලද, නෛර්යාණික නොවූ, කෙලෙස් නිවීම පිණිස නො පවත්නා වූ සම්‍යක්සම්බුද්ධ නොවූවවක්හු විසින් ප්‍රකාශිත වූ බිඳීගිය ස්තූපය ඇති (මළාවූ ශාස්තෘහු ඇති), ශාස්තෘහුගේ අභාවයෙන් පිළිසරණක් නැත්තා වූ සස්නෙක්හි යම්සේ වියැ යුතු ද, එසේ ම ඔහුගේ ශ්‍රාවක වූ නිවටුහු භේදභින්න වූවාහු, දෙ කොටසකට බෙදී ගියාහු, උපන් අරගල ඇත්තාහු, උපන් කලහ ඇත්තාහු, විවාදයට බටුවාහු, “තෝ මේ දහම් විනය නො දනී, මම් මේ දහම් විනය දනිමි, කිම තෝ මේ දහම් විනය දැනගත්තෙහි ද! තෝ වරදවා පිළිපන්නෙහි, මම් මොනොවට පිළිපන්නෙමි. මා කී වචන අර්ථයුක්ත ය, තගේ වචන අර්ථරහිත ය. පළමුවෙන් කියැ යුත්ත තෝ පසු ව කීයෙහි, පසු ව කියැයුත්ත පළමුයෙන් කීයෙහි. තා බොහෝ කලක් පුහුණු කළ දෑ මගේ වාදය නිසා පෙරැළී ගියේ ය. තා මත්තෙහි මා විසින් වාදය ආරෝපිත ය. තෝ මා විසින් නිගන්නා ලද්දෙහි. වාදයෙන් මිදෙනු පිණිස (උත්තර සොය සොයා) හැවිදුව. ඉදින් හැක්කෙහි නම් මා නැඟු වාදයෙන් මිදී ගනුව” යි උනුන් වචන නැමැති අඩයැටියෙන් විදුනාහු වෙසෙත්. ඥාතපුත්‍රයාගේ අතැවැස්සන් අතුරෙහි උනුන් මරාගැන්මක් මෙන් පවතී. ඥාතපුත්‍ර නිර්ග්‍රන්ථයාගේ ශ්වේතවස්ත්‍රධාරී යම් ගෘහී ශ්‍රාවක කෙනෙක් වෙත් ද, උහුත් ඥාතපුත්‍රයාගේ අතැවැසි නිවටුන් කෙරෙහි කලකිරුණු ස්වභාවය ඇත්තාහු ආදර රහිත ස්වභාවය ඇත්තාහු, පළමු දැක්වූ සත්කාර ගුරුකාර හැර පසුබැස ගිය ස්වභාවය ඇත්තාහු වෙත්.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 196,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "2. අථ ඛො චුන්දො සමණුද්දෙසො පාවායං වස්සං වුත්ථො,{1} යෙන සාමගාමො යෙනායස්මා ආනන්දො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මන්තං ආනන්දං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො චුන්දො සමණුද්දෙසො ආයස්මන්තං ආනන්දං එතදවොච: නිගණ්ඨො භන්තෙ නාතපුත්තො පාවායං අධුනා කාලකතො. තස්ස කාලකිරියාය භින්නා නිගණ්ඨා ද්වෙධිකජාතා -පෙ- භින්නථූපෙ අප්පටිසරණෙ’ති. එවං වුත්තෙ ආයස්මා ආනන්දො චුන්දං සමණුද්දෙසං එතදවොච: අත්ථි ඛො ඉදං ආවුසො චුන්ද, කථාපාභතං භගවන්තං දස්සනාය. ආයාමාවුසො චුන්ද, යෙන භගවා තෙනුපසංකමිස්සාම. උපසඞ්කමිත්වා භගවතො එතමත්ථං ආරොචෙස්සාමා’ති.{2}"
                    },
                    {
                        "type": "paragraph",
                        "text": "‘එවං භන්තෙ’ති ඛො චුන්දො සමණුද්දෙසො ආයස්මතො ආනන්දස්ස පච්චස්සොසි. අථ ඛො ආයස්මා ච ආනන්දො චුන්දො ච සමණුද්දෙසො යෙන භගවා තෙනුපසඞ්කමිංසු, උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නො ඛො ආයස්මා ආනන්දො භගවන්තං එතදවොච: අයං භන්තෙ චුන්දො සමණුද්දෙසො එවමාහ: “නිගණ්ඨො භන්තෙ නාතපුත්තො පාවායං අධුනා කාලකතො. තස්ස කාලකිරියාය භින්නා නිගණ්ඨා ද්වෙධිකජාතා -පෙ- භින්නථූපෙ අප්පටිසරණෙ”ති."
                    },
                    {
                        "type": "centered",
                        "text": "අසම්මා සම්බුද්ධප්පවෙදිත - ධම්මවිනයො",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3. “එවං හෙතං චුන්ද අසම්මාසම්බුද්ධප්පවෙදිතෙ ධම්මවිනයෙ හොති දුරක්ඛාතෙ ධම්මවිනයෙ දුප්පවෙදිතෙ අනිය්යානිකෙ අනුපසමසංවත්තනිකෙ අසම්මාසම්බුද්ධප්පවෙදිෙත, ඉධ චුන්ද සත්ථා ච හොති අසම්මාසම්බුද්ධො, ධම්මො ච දුරක්ඛාතො දුප්පවෙදිතො අනිය්යානිකො අනුපසමසංවත්තනිකො අස්ම්මාසම්බුද්ධප්පවෙදිතො, සාවකො ච තස්මිං ධම්මෙ න ධම්මානුධම්මප්පටිපන්නො විහරති න සාමීචිපටිපන්නො න අනුධම්මචාරී, වොක්කම්ම ච තම්හා ධම්මා වත්තති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. මස්සං වුට්ඨො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ආරොචෙය්යාමා - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "2. එ කල්හි චුන්ද සමණුද්දෙසයෝ පාවා නුවරෙහි වස් වුසූවෝ, සාමගාමයෙහි අනඳ තෙරුන් කරා එළැඹියෝ ය. එළැඹ ආයුෂ්මත් අනඳ තෙරුන් ආදරයෙන් වැඳ, පසෙක හිඳගත්හ. පසෙක හුන්නා වූ ම චුන්ද සමනුද්දෙසයෝ ආයුෂ්මත් අනඳ තෙරුනට ‘වහන්ස, ඥාතපුත්‍ර නිර්ග්‍රන්ථ තෙමේ පාවා නුවරැදී, නොබෝ කල්හි කලුරිය කෙළේ වෙයි. ඔහුගේ කාලක්‍රියායෙන් ... බිඳීගිය ස්තූප ඇති, පිළිසරණක් නැති සස්නෙක්හි යම්සේ වියැ යුතු ද, එසේ ම ඔහු සවු නිවටහු භේදභින්න වූවාහු, දෙකොටසකට බෙදී ගියාහු … වෙත් යැ’ යි සැළ කළෝ ය. මෙසේ සැළ කළ කල්හි අනඳ තෙරණුවෝ චුන්ද සමනුද්දෙසයනට ඇවැත් චුන්දයෙනි, භාග්‍යවතුන් වහන්සේ දක්නා පිණිස මෙය කථාප්‍රාභෘතයෙක් (කතා පඬුරෙක් වැ) ඇත. ඇවැත් චුන්දයෙනි, එමු. භාග්‍යවතුන් වහන්සේ කරා යන්නමු. ගොස් මෙ කරුණ භාග්‍යවතුන් වහන්සේට සැළ කරන්නමෝ වේ දැ” යි වදාළහ. ‘එසේ ය, වහන්සැ’ යි කියා ම චුන්ද සමනුද්දසයෝ අනඳ තෙරුනට පිළිවදන් දුන්හ. ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති අනඳ තෙරණුවෝ ද චුන්ද සමණුද්දෙස ද භාග්‍යවතුන් වහන්ස කරා එළැඹියහ. එළැඹ භාග්‍යවතුන් වහන්සේ ආදරයෙන් වැඳ, එක් පසෙක හිඳගත්හ. එක් පසෙක හුන්නාවූ ම අනඳ තෙරණුවෝ ‘වහන්ස, ඥාතපුත්‍ර නිර්ග්‍රන්ථ පාවා නුවරැදී කලුරිය කෙළේ යැ යි, ඔහුගේ කාලක්‍රියායෙන් … බිඳීගිය ස්තූප ඇති, පිළිසරණක් නැති සස්නෙකැ යම්සේ වියැ යුතු ද, එසේ ම ඔහු සවු නිවටහු භේදභින්න වූවාහු, දෙ කොටසකට බෙදීගියාහු … වෙත් යැ’ යි මෙසේ මේ චුන්ද සමණුද්දෙසයෝ කියති’යි මෙ පවත් සැළ කළහ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "3. එවිට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: “චුන්දයෙනි, නොමනා කොට කියන ලද, නොමනා කොට දන්වන ලද, නෛර්යාණික නොවූ, කෙලෙස් නිවීම පිණිස නො පවත්නාවූ, අසම්‍යක්සම්බුද්ධයක්හු විසින් ප්‍රකාශිත වූ සස්නෙක්හි මෙය මෙසේ ම වෙයි. චුන්දයෙනි, මෙහි ශාස්තෘ තෙමේ සම්‍යක්සම්බුද්ධත් නො වේ ද, ධර්මයත් නො මනා කොට දෙසන ලද ද, නොමනා කොට දන්වන ලද ද, අනෛර්යාණික ද, කෙලෙස් සංසිඳීම පිණිස නො පවත්නේ ද, අසම්‍යක්සම්බුද්ධයක්හු විසින් ප්‍රකාශිත ද, ශ්‍රාවක තෙමේත් ඒ දහම්හි ධර්මානුධර්මප්‍රතිපන්න වැ, නිසි පිළිවෙත්හි පිළිපන් වැ අනුධර්මචාරී වැ නො වෙසෙයි. හේ ඒ ධර්මයෙන් ඉවතට පැන පැන පවතී.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 198,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සො එවමස්ස වචනීයො “තස්ස තෙ ආවුසො ලාභා, තස්ස තෙ සුලද්ධං, සත්ථා ච තෙ අසම්මාසම්බුද්ධො ධම්මො ච දුරක්ඛාතො දුප්පවෙදිතො අනිය්යානිකො අනුපමසංවත්තනිකො අසම්මාසම්බුද්ධප්පවෙදිතො, ත්වඤ්ච තස්මිං ධම්මෙ න ධම්මානුධම්මපටිපන්නො විහරසි න සාමීචිපටිපන්නො න අනුධම්මචාරී, වොක්කම්ම ච තම්හා ධම්මා වත්තසී”ති. ඉති ඛො චුන්ද සත්ථා පි තත්ථ ගාරය්හො, ධම්මොපි තත්ථ ගාරය්හො, සාවකො ච තත්ථ එවං පාසංසො. යො ඛො චුන්ද එවරූපං සාවකං එවං වදෙය්ය “එතායස්මා තථා පටිපජ්ජතු යථා තෙ සත්ථාරා ධම්මො දෙසිතො පඤ්ඤත්තො”ති, යො ච තං සමාදපෙති යඤ්ච සමාදපෙති යො ච සමාදපිතො තථත්තාය පටිපජ්ජති, සබ්බෙ තෙ බහුං අපුඤ්ඤං පසවන්ති. තං කිස්ස හෙතු? එවං හෙතං චුන්ද හොති දුරක්ඛාතෙ ධම්මවිනයෙ දුප්පවෙදිතෙ අනිය්යානිකෙ අනුපසමසංවත්තනිකෙ අසම්මාසම්බුද්ධප්පවෙදිතෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "4. ඉධ පන චුන්ද සත්ථා ච හොති අසම්මාසම්බුද්ධො, ධම්මො ච දුරක්ඛාතො දුප්පවෙදිතො අනිය්යානිකො අනුපසමසංවත්තනිකො අසම්මාසම්බුද්ධප්පවෙදිතො, සාවකො ච තස්මිං ධම්මෙ ධම්මානුධම්මප්පටිපන්නො විහරති සාමීචිපටිපන්නො අනුධම්මචාරී, සමාදාය තං ධම්මං වත්තති. සො එවමස්ස වචනීයො “තස්ස තෙ ආවුසො අලාභා, තස්ස තෙ දුල්ලද්ධං, සත්ථා ච තෙ අසම්මාසම්බුද්ධො, ධම්මො ච දුරක්ඛාතො දුප්පවෙදිතො අනිය්යානිකො අනුපසමසංවත්තනිකො අසම්මාසම්බුද්ධප්පවෙදිතො. ත්වඤ්ච තස්මිං ධම්මෙ ධම්මානුධම්මප්පටිපන්නො විහරසි සාමීචිපටිපන්නො අනුධම්මචාරී, සමාදාය තං ධම්මං වත්තසී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉති ඛො චුන්ද සත්ථාපි තත්ථ ගාරය්හො, ධම්මොපි තත්ථ ගාරය්හො, සාවකො පි තත්ථ එවං ගාරය්හො. යො ඛො චුන්ද එවරූපං සාවකං එවං වදෙය්ය. “අද්ධායස්මා ඤායපටිපන්නො ඤායමාරාධෙස්සතී”ති. යො ච පසංසති යඤ්ච පසංසති යො ච පසංසිතො භිය්යොසොමත්තාය වීරියං ආරභති. සබ්බෙ තෙ බහුං අපුඤ්ඤං පසවන්ති. තං කිස්ස හෙතු? එවං හෙතං චුන්ද හොති දුරක්ඛාතෙ ධම්මවිනයෙ දුප්පවෙදිතෙ අනිය්යානිකෙ අනුපසමසංවත්තනිකෙ අසම්මාසම්බුද්ධප්පවෙදිතෙ."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "‘ඇවැත්නි, ඒ තොප මේ ධර්මානුධර්මප්‍රතිපත්ති ආදීහු ලාභයෝ ය, ඒ තොප විසින් මිනිසත් බව ද මොනොවට ලදුයේ ය, තොපගේ ශාස්තෘ ද අසම්‍යක්සම්බුද්ධ ය, තොපගේ ධර්මය ද දුරාඛ්‍යාත ය, දුෂ්ප්‍රවෙදිත ය, අනෛර්යාණික ය, ව්‍යුපශමය පිණිස නො පවත්නේය, අසම්‍යක්සම්බුද්ධයක්හු විසින් ප්‍රකාශිත ය. තෙපිත් ඒ ධර්‍මයෙහි ධර්‍මානුධර්මප්‍රතිපන්න වැ නො වසහු. නිසි පිළිවෙත්හි නො පිළිපන්නහු අනුධර්‍මචාරී නො වහු. ඒ දහමින් ඉවතට පැන පවතිහු” යැ යි හෙතෙම මෙසේ කියැ යුතු වන්නේ ය, (ඔහුට මෙසේ කියැ යුතු ය). චුන්දයෙනි, මෙසේ එහි ශාස්තෘ ද ඒකාන්තයෙන් ගර්හා ලබනු සුදුසු ය, එහි ධර්මය ද ගර්හා ලැබියැ යුතු ය. එහි ශ්‍රාවක තෙමේ ම මෙසේ පැසැසුම් ලැබියැ යුතු ය. චුන්දයෙනි, යමෙක් වූ කලි මෙබඳු සව්වක්හට, ‘ආයුෂ්මත් තෙමේ ඒ වා යම් සේ තාගේ ශාස්තෘහු විසින් දහම් දෙසන ලද ද, පනවන ලද ද, එසේ පිළිපදී ව’ යි මෙසේ කියන්නේ ද, යමෙකුත් එය සමාදන් කරවා ද, යමකුත් සමාදන් කරවා ද (යමකු ලවා ගන්වා ද), යමෙකුත් සමාදන් කරවන ලදුයේ එය පුරාලනු පිණිස පිළිපදී ද, ඒ සියල්ලෝ බොහෝ අකුසල් රැස් කෙරෙත්. ඒ කවර හෙයින? යත්: චුන්දයෙනි, නො මනා කොට කියන ලද, නො මනා කොට දන්වන ලද, අනෛර්යාණික වූ, කෙලෙස් නිවීම පිණිස නො පවත්නා වූ අසම්‍යක්සම්බුද්ධයක්හු විසින් ප්‍රකාශිත වූ සස්නෙක්හි මෙය මෙසේ ම වෙයි. එ හෙයිනි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "4. චුන්දයෙනි, මෙහි (එක්තරා) ශාස්තෘවරයෙක් වනාහි අසම්‍යක්සම්බුද්ධ ද වෙයි. ධර්මය ද නොමනා කොට කියන ලද්දේ ද, නොමනා කොට දන්වන ලද්දේ ද, අනෛර්යාණික ද, කෙලෙස් නිවීම පිණිස නො පවත්නේ ද, අසම්‍යක්සම්බුද්ධයක්හු විසින් ප්‍රකාශිත ද වෙයි. එ දහම්හි ශ්‍රාවකයා ද ධර්මානුධර්මප්‍රතිපන්න වැ, නිසි පිළිවෙත්හි පිළිපන්නෙක් වැ, අනුධර්මචාරී වැ වෙසෙයි, ඒ දහම සමාදන් කොට ගෙන පවතී. ‘ඇවැත්නි, ඒ තොපට අලාභ ය, ඒ තොප විසින් මිනිස්බව නපුරු කොට ලබන ලද්දෙකි. තොපගේ ශාස්තෘ ද අසම්‍යක්සම්බුද්ධ ය, (තොපගේ) ධර්මය ද නොමනා කොට කියන ලද්දේ ය, නොමනා කොට දන්වන ලද්දේ ය, අනෛර්යාණික ය, කෙලෙස් නිවීම පිණිස නො පවත්නෙක, අසම්‍යක්සමබුද්ධයක්හු විසින් ප්‍රකාශිත ය, තෙපි ද ඒ දහම්හි ධර්මානුධර්ම ප්‍රතිපන්න ව එයට නිසි පිළිවෙත්හි පිළිපන්නෝ ව අනුධර්මචාරී වැ වසහු. ඒ ධර්මය සමාදන් කොට ගෙන වසහු’ යැ යි, මෙසේ ඒ ශ්‍රාවක තෙමේ කියැ යුතු වන්නේය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "චුන්දයෙනි, මෙසේ ම එහි ශාස්තෘ ද ගැරැහුම් ලැබියැ යුතු ය. එහි ධර්‍මය ද ගැරැහුම් ලැබියැ යුතු ය, එහි ශ්‍රාවකයා ද මෙසේ ගැරැහුම් ලැබියැ යුතු ය. චුන්දයෙනි, යමෙක් වනාහි එබඳු ශ්‍රාවකයකුට ‘ආයුෂ්මත් තෙමේ ඒකාන්තයෙන් න්‍යායප්‍රතිපන්න ය, න්‍යායය (මුක්තිය ලබන පිළිවෙත) සම්පූර්‍ණ කරන්නේ යැ’ යි මෙසේ කියන්නේ ද යමෙක් එසේ පසසන්නේද, යමක්හු පසස්නේද, යමෙක් පසස්නා ලදුයේ බොහෝ සේ වැර වඩා ද ඒ සියල්ලෝ ම බොහෝ පව් රැස් කෙරෙත්, ඒ කවර හෙයින යත්: චුන්දයෙනි, නො මනා කොට කියන ලද, නොමනා කොට පවසන ලද, නෛර්යාණික නොවූ, කෙලෙස් නිවීම පිණිස නොපවත්නා වූ, අසම්‍යක්සම්බුද්ධයක්හු විසින් ප්‍රකාශිත වූ සස්නෙක මෙය මෙසේ ම වෙයි, එ හෙයිනි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 200,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "සම්මාසම්බුද්ධප්පවෙදිත - ධම්මවිනයො",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "5. ඉධ පන චුන්ද සත්ථා ච හොති සම්මාසම්බුද්ධො ධම්මො ච ස්වාක්ඛාතො සුප්පවෙදිතො නිය්යානිකො උපසමසංවත්තනිකො සම්මාසම්බුද්ධප්පවෙදිතො, සාවකො ච තස්මිං ධම්මෙ න ධම්මානුධම්මපටිපන්නො විහරති න සාමීචිපටිපන්නො න අනුධම්මචාරී, වොක්කම්ම ච තම්හා ධම්මා වත්තති. සො එවමස්ස වචනීයො. “තස්ස තෙ ආවුසො අලාභා, තස්ස තෙ දුල්ලද්ධං, සත්ථා ච තෙ සම්මාසම්බුද්ධො, ධම්මො ච ස්වාක්ඛාතො සුප්පවෙදිතො නිය්යානිකො උපසමසංවත්තනිකො සම්මාසම්බුද්ධප්පවෙදිතො, ත්වඤ්ච තස්මිං ධම්මෙ න ධම්මානුධම්මපටිපන්නො විහරසි න සාමීචිපටිපන්නො න අනුධම්මචාරී, වොක්කම්ම ච තම්හා ධම්මා වත්තසී”ති. ඉති ඛො චුන්ද සත්ථාපි තත්ථ පාසංසො, ධම්මො පි තත්ථ පාසංසො, සාවකො ච තත්ථ එවං ගාරය්හො, යො ඛො චුන්ද එවරූපං සාවකං එවං වදෙය්ය “එතායස්මා තථා පටිපජ්ජතු යථා තෙ සත්ථාරා ධම්මො දෙසිතො පඤ්ඤත්තො”ති. යො ච සමාදපෙති යං ච සමාදපෙති යො ච සමාදපිතො තථත්තාය පටිපජ්ජති, සබ්බෙ තෙ බහුං පුඤ්ඤං පසවන්ති. තං කිස්ස හෙතු? එවං හෙතං චුන්ද හොති ස්වාක්ඛාතෙ ධම්මවිනයෙ සුප්පවෙදිතෙ නිය්යානිකෙ උපසමසංවත්තනිකෙ සම්මාසම්බුද්ධප්පවෙදිතෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "6. ඉධ පන චුන්ද සත්ථා ච හොති සම්මාසම්බුද්ධො, ධම්මො ච ස්වාක්ඛාතො සුප්පවෙදිතො නිය්යානිකො උපසමසංවත්තනිකො සම්මාසම්බුද්ධප්පවෙදිතො, සාවකො ච තස්මිං ධම්මෙ ධම්මානුධම්මපටිපන්නො විහරති, සාමීචිපටිපන්නො අනුධම්මචාරී, සමාදාය තං ධම්මං වත්තති, සො එවමස්ස වචනීයො: තස්ස තෙ ආවුසො ලාභා, තස්ස තෙ සුලද්ධං, සත්ථා ච තෙ සම්මාසම්බුද්ධො ධම්මො ච ස්වාක්ඛාතො සුප්පවෙදිතො නිය්යානිකො උපසමසංවත්තනිකො සම්මාසම්බුද්ධප්පවෙදිතො, ත්වඤ්ච තස්මිං ධම්මෙ ධම්මානුධම්මපටිපන්නො විහරසි, සාමීචිපටිපන්නො අනුධම්මචාරී, සමාදාය තං ධම්මං වත්තසී”ති. ඉති ඛො චුන්ද සත්ථා පි තත්ථ පාසංසො, ධම්මො පි තත්ථ පාසංසො, සාවකො පි තත්ථ එවං පාසංසො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "5. චුන්දයෙනි, මෙහි ශාස්තෘ තෙමේත් සම්‍යක්සම්බුද්ධ වේ ද, ධර්මයත් මොනොවට කියන ලද්දේ, මොනොවට දන්වන ලද්දේ, නෛර්යාණික වූයේ, කෙලෙස් නිවීම පිණිස පවත්නේ සම්‍යක්සම්බුද්ධයක්හු විසින් ප්‍රකාශිත වූයේ වේ ද, ශ්‍රාවකයා වනාහි ඒ දහමෙහි ධර්මානුධර්මප්‍රතිපන්න නො වූයේ, නිසි පිළිවෙතට නොපිළිපන්නේ, අනුධර්මචාරී නොවූයේ වෙසේ ද, ඒ ඒ පිළිවෙතින් පිටත පැන පැන වෙසෙයි ද, හෙ තෙමේ මෙසේ කියැ යුතු වන්නේ ය: ‘ඇවැත්නි, ඒ තොපට අලාභ ය, ඒ තොප විසින් මිනිස්බව නපුරු කොට ලද්දේ ය. තොපගේ ශාස්තෘ ද සම්‍යක්සම්බුද්ධ ය, ධර්මය ද මොනවට කියන ලද්දේ ය, මොනොවට දනවන ලද්දේ ය, නෛර්යාණික ය, කෙලෙස් නිවීම පිණිස පවත්නේ ය, සම්‍යක්සම්බුද්ධයක්හු විසින් ප්‍රකාශිත ය. එහෙත් තෙපි ඒ ධර්මයෙහි ධර්මානුධර්මප්‍රතිපන්න නො වැ, නිසි පිළිවෙත්හි පිළිපන්නෙක් නො වැ, අනුධර්මචාරී නො වැ වෙසෙවු. ඒ ධර්මයෙන් පිටත පැන පැන පවත්හු’ යැ යි (මෙසේ හෙ තෙම) දොස් නැගියැ යුතු වන්නේ ය. චුන්දයෙනි, මෙසේ එහි ශාස්තෘ ද පැසැසිය යුත්තේ ය, එහි ධර්මය ද පැසැසිය යුත්තේ ය, එහෙත් එහි ශ්‍රාවකයා මෙසේ ගැරැහියැ යුත්තේ ය. චුන්දයෙනි, යමෙක් වනාහි මෙබඳු ශ්‍රාවකයකුට ‘ආයුෂ්මත්හු එත් වා, යම් සේ තොපගේ ශාස්තෘහු විසින් දහම් දෙසන ලද ද පණවන ලද ද, එසේ පිළිපදිත් ව යි මෙසේ කියැ යුතු වන්නේ ය. එහි යමෙකුත් සමාදන් කරවා ද, යමක්හුත් සමාදන් කරවා ද, යමෙකුත් සමාදන් කරවන ලදුයේ, එය පුරනු පිණිස පිළිපදී ද ඒ සියල්ලෝ ම බොහෝ පින් රැස් කෙරෙත්. ඒ කවර හෙයින්? යත්: චුන්දයෙනි, මොනොවට කියන ලද, මොනොවට දන්වන ලද, නෛර්යාණික වූ, කෙලෙස් නිවීම පිණිස පවත්නා වූ, සම්‍යක්සම්බුද්ධයක්හු විසින් ප්‍රකාශිත වූ සස්නෙක්හි මෙය මෙසේ ම වෙයි. එ හෙයිනි."
                    },
                    {
                        "format": 13,
                        "text": "6. චුන්දයෙනි, මෙහි වනාහි ශාස්තෘ තෙමේත් සම්‍යක්සම්බුද්ධ වේ ද, ධර්මයත් මොනොවට කියන ලද්දේ, මොනොවට දන්වන ලද්දේ, නෛර්යාණික වූයේ, කෙලෙස් නිවීම පිණිස පවත්නේ, සම්‍යක්සම්බුද්ධයක්හු විසින් පවසන ලද්දේ වේ ද, ශ්‍රාවක තෙමේ ද ඒ දහම්හි ධර්මානුධර්මප්‍රතිපන්න වැ නිසි පිළිවෙත්හි පිළිපන්නෙක් වැ අනුධර්මචාරී වැ වෙසේ ද, ඒ ධර්මය සමාදන් කොටගෙන පවතී ද, හෙ තෙමේ මෙසේ කියැ යුතු වන්නේ ය: ‘ඇවැත්නි, ඒ නොපට ලාභ ය, ඒ තොප විසින් මිනිස් බව මොනොවට ලද්දේ ය, තොපගේ ශාස්තෘ ද සම්‍යක් සම්බුද්ධ ය, ධර්මයත් ස්වාඛ්‍යාත ද සුප්‍රවේදිත ද නෛර්යාණික ද, කෙලෙස් නිවීම පිණිස පවත්නේ ද, සම්‍යක්සම්බුද්ධප්‍රකාශිත ද වෙයි. තොපිත් ඒ ධර්මයෙහි ධර්මානුධර්මප්‍රතිපන්න වැ, නිසි පිළිවෙතට පිළිපන්නෝ වැ, අනුධර්මචාරී වැ වසහු. ඒ ධර්මය සමාදන් කොට ගෙන පවතිහු’ යැ යි (මෙසේ කියැ යුතුවන්නේ ය). චුන්දයෙනි, මෙසේ ම එහි ශාස්තෘ ද පැසැසියැ යුත්තේ ය, එහි ධර්මය ද පැසැසියැ යුත්තේ ය, එහි ශ්‍රාවක තෙමේ ද පැසැසියැ යුත්තේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 202,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යො ඛො චුන්ද එවරූපං සාවකං එවං වදෙය්ය “අද්ධායස්මා ඤායපටිපන්නො ඤායමාරාධෙස්සතී”ති. යො ච පසංසති යං ච පසංසති, යො ච පසංසිතො භිය්යොසොමත්තාය වීරියං ආරභති, සබ්බෙ තෙ බහුං පුඤ්ඤං පසවන්ති. තං කිස්ස හෙතු? එවං හෙතං චුන්ද හොති ස්වාක්ඛාතෙ ධම්මවිනයෙ සුප්පවෙදිතෙ නිය්යානිකෙ උපසමසංවත්තනිකෙ සම්මාසම්බුද්ධප්පවෙදිතෙ."
                    },
                    {
                        "type": "centered",
                        "text": "සාවකානුතාපකරා සත්ථුකාලකිරියා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "7. ඉධ පන චුන්ද සත්ථා ච ලොකෙ උදපාදි අරහං සම්මාසම්බුද්ධො, ධම්මො ච ස්වාක්ඛාතො සුප්පවෙදිතො නිය්යානිකො උපසමසංවත්තනිකො සම්මාසම්බුද්ධප්පවෙදිතො, අවිඤ්ඤාපිතත්ථා චස්ස හොන්ති සාවකා සද්ධිම්මෙ න ච නෙසං කෙවලපරිපූරං බ්රහ්මචරියං ආවිකතං හොති උත්තානීකතං සබ්බසඞ්ගාහපදකතං සප්පාටිහීරකතං යාව දෙවමනුස්සෙහි සුප්පකාසිතං, අථ නෙසං සත්ථුනො අන්තරධානං හොති. එවරූපො ඛො චුන්ද සත්ථා සාවකානං කාලං කතො ආනුතප්පො හොති. තං කිස්ස හෙතු? සත්ථා ච නො ලොකෙ උදපාදි අරහං සම්මාසම්බුද්ධො, ධම්මො ච ස්වාක්ඛාතො සුප්පවෙදිතො නිය්යානිකො උපසමසංවත්තනිකො සම්මාසම්බුද්ධප්පවෙදිතො, අවිඤ්ඤාපිතත්ථා චම්හ සද්ධම්මෙ, න ච නො කෙවලපරිපූරං බ්රහ්මචරියං ආවීකතං හොති උත්තානීකතං සබ්බසඞ්ගාහපදකතං සප්පාටිහීරකතං යාව දෙවමනුස්සෙහි සුප්පකාසිතං, අථ නො සත්ථුනො අන්තරධානං හොතී”ති. එවරූපො ඛො චුන්ද සත්ථා සාවකානං කාලකතො අනුතප්පො හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "චුන්දයෙනි, යමෙක් වනාහි මෙබඳු ශ්‍රාවකයකුට ‘ඒකාන්තයෙන් ආයුෂ්මත්හු මුක්තිමාර්ගයට පිළිපන්නෝ ය, න්‍යාය ධර්මය සපුරාලන්නෝ යැ’යි මෙසේ කියන්නේ ද, යමෙකුත් මෙසේ පසස්නේ ද, යමක්හුත් පසස්නේ ද, යමෙක් පසස්නා ලද්දේත් බොහෝ සෙයින් වැර වඩන්නේ ද, ඒ සියල්ලෝ බොහෝ පින් රැස් කරන්නාහ. ඒ කවර හෙයින? යත්: චුන්දයෙනි, මොනොවට කියන ලද මොනොවට දන්වන ලද, නෛර්යාණික වූ, කෙලෙස් නිවීම පිණිස පවත්නා වූ, සම්‍යක්සම්බුද්ධයක්හු විසින් ප්‍රකාශිත වූ සස්නෙහි මෙය මෙසේ ම ය. එ හෙයිනි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "7. චුන්දයෙනි, මෙහි වූ කලි අර්හත් වූ සම්‍යක්සම්බුද්ධ වූ ශාස්තෘ ද ලොවැ උපන්නේ ය. ධර්මය ද ස්වාඛ්‍යාත ය, සුප්‍රවේදිත ය, නෛර්යාණික ය, ක්ලේශෝපශමය පිණිස පවත්නේ ය, සම්‍යක්සම්බුද්ධයක්හු විසින් ප්‍රකාශිත ය, ඔහුගේ ශ්‍රාවකයෝ සද්ධර්මයෙහි අවබෝධ කරවන ලද අර්ථ ඇත්තෝ නො වෙත් ද, හැම සැටියෙන් පිරිපුන් වූ සසුන් බඹසර ඔවුනට හෙළි කරන ලද්දේ ප්‍රකට කරන ලද්දේ සියලු ශාසනාර්ථයන් එකට කැටි කොට දක්වන ලද්දේ, සසර දුක් දුරැලීමෙහි ප්‍රයෝජනවත් සේ කොට දෙසන ලද්දේ, දෙව්ලොව පටන් කොට මිනිස්ලොව තෙක් සියලු තන්හී මොනොවට ප්‍රකාශ කරන ලද්දේ නො වේ ද, එකල්හි ඔවුන්ගේ ශාස්තෘහුගේ පිරිනිවීම වේ ද, චුන්දයෙනි, මෙබඳු වූ ශාස්තෘ තෙමේ කලුරිය කෙළේ ශ්‍රාවකයනට අනුතාපකර (පසුතැවිල්ල ඇති කරනුයේ) වෙයි. ඒ කවර හෙයින? යත්: ‘අර්හත් සම්‍යක්සම්බුද්ධ වූ අපගේ ශාස්තෘ තෙමේ ලොවැ පහළ විය, ධර්මය ස්වාඛ්‍යාත ද සුප්‍රවේදිත ද නෛර්යාණික ද ක්ලේශෝපශමය පිණිස පවත්නේ ද, සම්‍යක්සම්බුද්ධයක්හු විසින් ප්‍රකාශිත ද විය. එහෙත් අපි ඒ සද්ධර්මයෙහි අවබෝධ නො කරවන ලද අර්ථ ඇත්තෝ වම්හ, කේවලපරිපූර්ණ වූ ශාසන බ්‍රහ්මචර්යය අපට නො ම හෙළි කරන ලද්දේ වෙයි, නො ම ප්‍රකට කරන ලද්දේ වෙයි, සියලු ශාසනාර්ථයන් එකට කැටි කොට නො දක්වන ලද්දේ වෙයි. දුක් දුරැ ලීමෙහි ප්‍රයෝජනවත් සේ කොට නො දෙසන ලද්දේ වෙයි, සියලු දෙව්මිනිසුන් අතුරෙහි මැනවින් ප්‍රකාශ කරන ලද්දේ නො වෙයි. එතෙකුදු වුවත් අපේ ශාස්තෘහුගේ අන්තර්ධානය වී යැ’ යි ඔවුනට පසුතැවිල්ල වෙයි. චුන්දයෙනි, මෙබඳු වූ ශාස්තෘ තෙමේ කලුරිය කළේ ශ්‍රාවකයනට පසුතැවිල්ල ඇති කරන්නේ වෙයි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 204,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "සාවකානං අනානුතප්පා සත්ථුකාලකිරියා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "8. ඉධ පන චුන්ද සත්ථා ච ලොකෙ උදපාදි අරහං සම්මාසම්බුද්ධො. ධම්මො ච ස්වාක්ඛාතො සුප්පවෙදිතො නිය්යානිකො උපසමසංවත්තනිකො සම්මාසම්බුද්ධප්පවෙදිතො. විඤ්ඤාපිතත්ථා චස්ස හොන්ති සාවකා සද්ධම්මෙ, කෙවලඤ්ච තෙසං පරිපූරං බ්රහ්මචරියං ආවිකතං හොති උත්තානීකතං සබ්බසඞ්ගාහපදක්තං සප්පාටිහීරකතං යාව දෙවමනුස්සෙහි සුප්පකාසිතං අථ නෙසං සත්ථුනො අන්තරධානං හොති එවරූපො ඛො චුන්ද සත්ථා සාවකානං කාලකතො අනානුතප්පො හොති. තං කිස්ස හෙතු? සත්ථා ච නො ලොකෙ උදපාදි අරහං සම්මාසම්බුද්ධො. ධම්මො ච ස්වාක්ඛාතො සුප්පවෙදිතො නිය්යානිකො උපසමසංවත්තනිකො සම්මාසම්බුද්ධප්පවෙදිතො විඤ්ඤාපිතත්ථා චම්හා සද්ධම්මෙ, කෙවලඤ්ච නො පරිපූරං බ්රහ්මචරියං ආවිකතං හොති උත්තානීකතං සබ්බසඞ්ගාහපදකතං සප්පාටිහීරකතං යාව දෙවමනුස්සෙහි සුප්පකාසිතං, අථ නො සත්ථුනො අන්තරධානං හොතී”ති. එවරූපො ඛො චුන්ද සත්ථා සාවකානං කාලකතො අනානුතප්පො හොති."
                    },
                    {
                        "type": "centered",
                        "text": "බ්රහ්මචරියඅපරිපූරාදි කථා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "9. එතෙහි චෙ පි චුන්ද අඞ්ගෙහි සමන්නාගතං බ්රහ්මචරියං හොති, නො ච ඛො සත්ථා ච හොති ථෙරො රත්තඤ්ඤූ චිරපබ්බජිතො අද්ධගතො වයො අනුප්පත්තො, එවං තං බ්රහ්මචරියං අපරිපූරං හොති තෙනඞ්ගෙන. යතො ච ඛො චුන්ද එතෙහි චෙ පි අඞ්ගෙහි සමන්නාගතං බ්රහ්මචරියං හොති සත්ථාච හොති ථෙරො රත්තඤ්ඤූ චර පබ්බජිතො අද්ධගතො වයො අනුප්පත්තො, එවං තං බ්රහ්මචරියං පරිපූරං හොති තෙනඞ්ගෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "එතෙහි චෙ පි චුන්ද අඞ්ගෙහි සමන්නාගතං බ්රහ්මචරියං හොති, සත්ථා ච හොති ථෙරො රත්තඤ්ඤූ චිරපබ්බජිතො අද්ධගතො වයො අනුප්පත්තො, නො ච ඛවස්ස ථෙරා භික්ඛු සාවකා හොන්ති වියත්තා විනීතා විසාරදා පත්තයොගක්ඛෙමා, අලං සමක්ඛාතුං සද්ධම්මස්ස, අලං උප්පන්නං පරප්පවාදං සහ ධම්මෙහි සුනිග්ගහිතං නිග්ගහෙත්වා සප්පාටිහාරියං ධම්මං දෙසෙතුං, එවං තං බ්රහ්මචරියං අපරිපූරං හොති තෙනඞ්ගෙන."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "8. චුන්දයෙනි, මෙහි වනාහි අර්හත් සම්‍යක්සම්බුද්ධ වූ ශාස්තෘ තෙමෙ ලොවැ පහළ විය. නෛර්යාණික වූ, කෙලෙස් නිවීම පිණිස පවත්නා වූ ධර්මය ද මොනොවට වදාරන ලද්දේ වෙයි. සම්‍යක්සම්බුද්ධයක්හු විසින් ප්‍රකාශිත ද වෙයි. ඔහුගේ ශ්‍රාවකයෝ ද සද්ධර්මයෙහි අවබෝධ කරවන ලද අර්ථ ඇත්තෝ වෙත්. ඔවුනට කේවල පරිපූර්ණ ශාසන බ්‍රහ්මචර්යය ද හෙළි කරන ලද්දේ, ප්‍රකට කරන ලද්දේ, සියලු ශාසනාර්ථයන් එකට කැටි කොට දක්වන ලද්දේ, දුක් බැහැරැලීමෙහි ප්‍රයෝජනවත් කොට දෙසන ලද්දේ, දෙවිමිනිසුන් තාක් මොනොවට ප්‍රකාශ කරණ ලද්දේ වෙයි. එකල්හි ඔවුන්ගේ ශාස්තෘහුගේ අන්තර්ධානය වෙයි. චුන්දයෙනි, මෙබඳු වූ ශාස්තෘ තෙමේ කලුරිය කළේ ශ්‍රාවකයනට අනුතාප කර නො වෙයි. ඒ කවර හෙයින? ‘අර්හත් සම්‍යක්සම්බුද්ධ වූ අපගේ ශාස්තෘ තෙම ලොව පහළ විය, නෛර්යාණික වූ කෙලෙස් නිවීම පිණිස පවත්නාවූ, ධර්මය ද මොනොවට වදාරන ලද්දේ ද මොනොවට දන්වන ලද්දේ ද වෙයි, සම්‍යක්සම්බුද්ධයක්හු විසින් ප්‍රකාශිත ද වෙයි. අපි ද ඒ සද්ධර්මයෙහි අවබෝධ කරවන ලද අර්ථ ඇත්තමෝ වම්හ. අපට කේවල පරිපූර්ණ වූ ශාසනබ්‍රහ්මචර්යය හෙළි කරන ලද්දේ, පෙහෙළි කරන ලද්දේ, වෙයි. ඒ ධර්මයන් සියලු ශාසනාර්ථ කැටි කොට දක්වන ලද්දේ, දුක් දුරැලීමට ප්‍රයෝජනවත් සේ කොට දෙසන ලද්දේ, දෙව්මිනිසුන් තාක් සියලු දෙනා අතුරෙහි මොනොවට ප්‍රකාශ කරන ලද්දේ වෙයි. එ කල්හි අපගේ ශාස්තෘහුගේ අන්තර්ධානය වූයේ යැ’යි ඔහු දනිත්. එහෙයිනි. චුන්දයෙනි, මෙබඳු වූ ශාස්තෘ තෙමේ කලුරිය කෙළේ ශ්‍රාවකයනට අනුතාපකර නො වෙයි."
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "9. චුන්දයෙනි, ඉදින් සසුන් බඹසර මේ අඞ්ගවලින් සමන්විත වේ ද, එහෙත් ශාස්තෘ තෙමේ ස්ථවිර නො වේ ද, චිරරාත්‍රඥ නො වේ ද, පැවිදි වූ බොහෝ කල් ඇත්තේ නො වේ ද, දික් කලක් ඉක්මියේ නො වේ ද, පැසිම් වයසට පැමිණියේ නො වේ ද, මෙසේ ඒ ශාසනබ්‍රහ්මචර්යය ඒ අඞ්ගයෙන් අපරිපූර්ණ වේ (අඩු වේ). චුන්දයෙනි, යම් හෙයෙකින් ශාසනබ්‍රහ්මචර්යය මේ අඞ්ගවලිනුත් සමන්විත වේ ද, ශාස්තෘ තෙමේත් ස්ථවිරත් රාත්‍රඥත්, පැවිදි වූ බොහෝ කල් ඇතියේත් දික් කලක් ඉක්මියේත් පැසිම් වයසට පැමිණියේත් වේ ද, මෙසේ ඒ බඹසර ඒ අඞ්ගයෙන් පරිපූර්ණ වේ."
                    },
                    {
                        "format": 13,
                        "text": "චුන්දයෙනි, සසුන් බඹසර මේ අඞ්ගවලින් පරිපූර්ණ වන්නේ නමුදු, ශාස්තෘ තෙමේත් ස්ථවිරත් රාත්‍රඥත් පැවිදි වූ බොහෝ කල් ඇතියේත් දික් කලක් ඉක්මියේත් පැසිම්වයසට පැමිණියේත් වේ ද, වැලිදු ඔහුට ව්‍යක්ත වූ විනීත වූ විසාරද වූ, රහත්බවට පැමිණියාවූ, සද්ධර්මය මොනොවට කියන්නට සමර්ථ වූ, උපන්නාවූ පරවාදය කරුණු සහිත ව මොනොවට නිගහා දුක් දුරැලීම පිණිස ප්‍රයෝජනවත් වන සේ කොට දහම් දෙසන්නට සමර්ථ වූ, ස්ථවිර වූ, ශ්‍රාවක භික්ෂූහු නො වෙත් ද, මෙසේ මේ අඞ්ගයෙන් ඒ සසුන් බඹසර අපරිපූර්ණ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 206,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "10. යතො ච ඛො චුන්ද එතෙහි ද්වෙහි පි අඞ්ගෙහි සමන්නාගතං බ්රහ්මචරියං හොති, සත්ථා ච හොති ථෙරො රත්තඤ්ඤූ චිරපබ්බජිතො අද්ධගතො වයො අනුප්පත්තො, ථෙරා චස්ස භික්ඛු සාවකා හොන්ති වියත්තා විනීතා විසාරදා පත්තයොගක්ඛෙමා, අලං සමක්ඛාතුං සද්ධම්මස්ස අලං උප්පන්නං පරප්පවාදං සහ ධම්මෙහි සුනිග්ගහිතං නිග්ගහෙත්වා සප්පාටිහාරියං ධම්මං දෙසෙතුං, එවං තං බ්රහ්මචරියං පරිපූරං හොති තෙනඞ්ගෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "එතෙහි චෙපි චුන්ද අඞ්ගෙහි සමන්නාගතං බ්රහ්මචරියං හොති, සත්ථා ච හොති ථෙරො රත්තඤ්ඤූ චිරපබ්බජිතො අද්ධගතො වයො අනුප්පත්තො ථෙරා චස්ස භික්ඛු සාවකා හොන්ති වියත්තා විනීතා විසාරදා -පෙ- අලං උප්පන්නං පරප්පවාදං සහ ධම්මෙහි සුනිග්ගහිතං නිග්ගහෙත්වා සප්පාටිහාරියං ධම්මං දෙසෙතුං, නො ච ඛ්වස්ස මජ්ඣිමා භික්ඛු සාවකා හොන්ති, විනීතා -පෙ- මජ්ඣිමා චස්ස භික්ඛු සාවකා හොන්ති -පෙ- නො ච ඛ්වස්ස නවා භික්ඛු සාවකා හොන්ති ව්යත්තා -පෙ- නවා චස්ස භික්ඛු සාවකා හොන්ති -පෙ- නො ච ඛවස්ස ථෙරා භික්ඛුනියො සාවිකා හොන්ති ව්යත්තා -පෙ- ථෙරා චස්ස භික්ඛුනියො සාවිකා හොන්ති -පෙ- නො ච ඛ්වස්ස මජ්ඣිමා භික්ඛුනියො සාවිකා හොන්ති ව්යත්තා -පෙ- මජ්ඣිමා චස්ස භික්ඛුනියො සාවිකා හොන්ති ව්යත්තා -පෙ- නො ච ඛ්වස්ස නවා භික්ඛුනියො සාවිකා හොන්ති -පෙ- න වා චස්ස භික්ඛුනියො සාවිකා හොන්ති ව්යත්තා -පෙ- නො ච ඛ්වස්ස උපාසකා සාවකා හොන්ති ගිහී ඔදාතවසනා බ්රහ්මචාරිනො ව්යත්තා -පෙ- උපාසකා චස්ස සාවකා හොන්ති ගිහී ඔදාතවසනා බ්රහ්මචාරිනො ව්යත්තා -පෙ- නො ච ඛ්වස්ස උපාසකා සාවකා හොන්ති ගිහී ඔදාතවසනා කාමභොගිනො ව්යත්තා -පෙ- උපාසකා චස්ස සාවකා හොන්ති ගිහී ඔදාතවසනා කාමභොගිනො ව්යත්තා -පෙ- නො ච ඛ්වස්ස උපාසිකා සාවිකා හොන්ති ගිහිනියො ඔදාතවසනා බ්රහ්මචාරිනියො ව්යත්තා -පෙ- උපාසිකා චස්ස සාවිකා හොන්ති ගිහිනියො ඔදාතවසනා බ්රහ්මචාරිනියො ව්යත්තා -පෙ- නො ච ඛ්වස්ස උපාසිකා සාවිකා හොන්ති ගිහිනියො ඔදාතවසනා කාමභොගිනියො ව්යත්තා -පෙ- උපාසිකා චස්ස සාවිකා හොන්ති ගිහිනියො ඔදාතවසනා කාමභොගිනියො ව්යත්තා -පෙ- නො ච ඛ්වස්ස බ්රහ්මචරියං හොති ඉද්ධඤ්චෙව ඵිතඤ්ච විත්ථාරිතං බාහුජඤ්ඤං පුථුභූතං යාව දෙවමනුස්සෙහි සුප්පකාසිතං -පෙ- බ්රහ්මචරියං චස්ස හොති ඉද්ධඤ්චෙව ඵිතඤ්ච විත්ථාරිතං බාහුජඤ්ඤං පුථුභූතං යාව දෙව මනුස්සෙහි සුප්පකාසිතං, නො ච ඛො ලාභග්ගයසග්ගප්පත්තං, එවං තං බ්රහ්මචරියං අපරිපූරං හොති තෙනඞ්ගෙන."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "10. චුන්දයෙනි, යම් හෙයෙකින් සසුන් බඹසර මේ අඞ්ගවලින් සමන්විතත් වේ ද, ශාස්තෘ තෙමේත් ස්ථවිරත් රාත්‍රඥත් පැවිදි වූ බොහෝ කල් ඇතියේත් දික් කලක් ඉක්මියේත් පැසිම් වයසට පැමිණියේත් වේ ද, ඔහුට ව්‍යක්ත වූ විනීත වූ විසාරද වූ, රහත් බවට පැමිණියාවූ, සද්ධර්මය මොනොවට කියන්නට සමර්ථ වූ, උපන් පරවාදය කරුණු සහිත ව මොනොවට නිගහා, දුක් දුරැලීම පිණිස ප්‍රයෝජනවත් වන සේ කොට දහම් දෙසන්නට සමත් වූ, ස්ථවිර වූ, ශ්‍රාවක භික්ෂූහු වෙත් ද, මෙසේ ඒ සසුන් බඹසර මේ අඞ්ගයෙන් පරිපූර්ණ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "චුන්දයෙනි, සසුන් බඹසර මේ අඞ්ගවලිනුත් සමන්විත වේ ද, ශාස්තෘ තෙමේත් ස්ථවිරත් රාත්‍රඥත් චිරප්‍රවුජිතත් දික් කලක් ඉක්මියේත් පැසිම් වයසට පැමිණියේත් වේ ද, ඔහුට ව්‍යක්ත වූ විනීත වූ විසාරද වූ රහත් බවට පැමිණියා වූ, සද්ධර්මය මොනොවට කියන්නට සමත් වූ, උපන් පරප්‍රවාදය කරුණු සහිත ව මොනොවට නිගහා, දුක් දුරලනුවට ප්‍රයෝජනවත් සේ කොට දහම් දෙසන්නට සමත් වූ, ස්ථවිර වූ භික්ෂුශ්‍රාවකයෝ වෙත් ද, එහෙත් ඔහුට ව්‍යක්ත වූ … මැදුම් වයසෙහි සිටි භික්ෂුශ්‍රාවකයෝ නැත් ද, ව්‍යක්ත වූ … නවක භිකෂුශ්‍රාවකයෝ නො වෙත් ද, ව්‍යක්ත වූ … ස්ථවිර වූ ශ්‍රාවිකා භික්ෂුණිහූ නො වෙත් ද, ඔහුට ව්‍යක්ත වූ … ස්ථවිර වූ ශ්‍රාවිකා භික්ෂුණිහු වෙත් ද … එහෙත් ඔහුට ව්‍යක්ත වූ … මැදිම් වයස්හි සිටි ශ්‍රාවිකා භික්ෂුණීහු නො වෙත් ද, … ඉදින් ව්‍යක්ත වූ … මැදුම් වයස්හි සිටි ශ්‍රාවිකා භික්ෂුණීහු වෙත් ද … එහෙත් ව්‍යක්ත වූ … නවක භික්ෂුණී ශ්‍රාවිකාවෝ නො වෙත් ද, … ඉදින් ව්‍යක්ත වූ … නවක භික්ෂුණී ශ්‍රාවිකාවෝ වෙත් ද, … එහෙත් ඔහුට ව්‍යක්ත වූ, සුදුවත් හඳනා ගෘහී බ්‍රහ්මචාරී උපාසක ශ්‍රාවකයෝ නො වෙත් ද … ඉදින් ඔහුට ව්‍යක්ත වූ සුදුවත් හඳනා ගෘහී බ්‍රහ්මචාරී උපාසක ශ්‍රාවකයෝ වෙත් ද, … එහෙත් ගෘහී වූ සුදුවත් හඳනා කාමභෝගි වූ ව්‍යක්ත උපාසක ශ්‍රාවකයෝ ඔහුට නො වෙත් ද, … ඉදින් ගෘහී වූ සුදුවත් හඳනා කාමභෝගී වූ ව්‍යක්ත උපාසක ශ්‍රාවකයෝ ඔහුට වෙත් නමුදු සුදු වත් හඳනා ගෘහස්ථ බ්‍රහ්මචාරිණී වූ ව්‍යක්ත උපාසිකා ශ්‍රාවිකාවෝ නො වෙත් ද, … ඉදින් ඔහුට සුදු වත් හඳනා ගෘහස්ථ බ්‍රහ්මචාරිණී වූ ව්‍යක්ත උපාසිකා ශ්‍රාවිකාවෝ වෙත් නුමුත් සුදුවත් හඳනා ගෘහස්ථ වූ කාමභෝගී වූ ව්‍යක්ත උපාසිකා ශ්‍රාවිකාවෝ නො වෙත් ද, එ හෙයින් … ඔහුගේ ශාසනබ්‍රහ්මචර්යය සමෘද්ධ ද, වෘද්ධිප්‍රාප්ත ද, පැතිරැගියේ ද, බොහෝ දෙනා විසින් දන්නා ලද්දේ ද, පුළුල් වූයේ ද, නුවණැති සියලු දෙව් මිනිසුන් අතරැ මොනොවට ප්‍රකාශිත ද නො වෙයි. ... ඔහුගේ ශාසනබ්‍රහ්මචර්යය සමෘර්ධ ද වෘද්ධිප්‍රාප්ත ද පැතිරැගියේ ද, බොහෝ දෙනා විසින් දන්නා ලද්දේ ද, පුළුල් වූයේ ද නුවණැති සියලු දෙව් මිනිසුන් අතරැ මොනොවට ප්‍රකාශිත ද වන්නේ නමුදු ලාභයෙන් යශසින් අගපත් නො වෙයි නම්, මෙසේ ඒ සස්න ඒ අඞ්ගයෙන් අපරිපූර්ණ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 208,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "11. යතො ච ඛො චුන්ද එතෙහි ද්විහිපි අඞ්ගෙහි සමන්නාගතං බ්රහ්මචරියං හොති සත්ථා ච හොති ථෙරො රත්තඤ්ඤූ චිරපබ්බජිතො අද්ධගතො වයො අනුප්පත්තො, ථෙරා චස්ස භික්ඛූ සාවකා හොන්ති වියත්තා විනීතා විසාරදා -පෙ- අලං සප්පාටිහාරියං ධම්මං දෙසෙතුං, මජ්ඣිමා චස්ස භික්ඛු සාවකා හොන්ති, නවා චස්ස භික්ඛු සාවකා හොන්ති, ථෙරා චස්ස භික්ඛුනියො සාවිකා හොන්ති, මජ්ඣිමා චස්ස භික්ඛුනියො සාවිකා හොන්ති, උපාසකා චස්ස සාවකා හොන්ති ගිහී ඔදාතවසනා බ්රහ්මචාරිනො උපාසකා චස්ස සාවකා හොන්ති ගිහී ඔදාතවසනා බ්රහ්මචාරිනො උපාසකා චස්ස සාවකා හොන්ති ගිහී ඔදාතවසනා කාමභොගිනො. උපාසිකා චස්ස සාවිකා හොන්ති ගිහිනියො ඔදාතවසනා බ්රහ්මචාරිනියො. උපාසිකා චස්ස සාවිකා හොන්ති ගිහිනියො ඔදාතවසනා කාමභොගිනියො, බ්රහ්මචරියං චස්ස හොති ඉද්ධඤ්චෙව ඵිතඤ්ච විත්ථාරිතං බාහුජඤ්ඤං පුථුභූතං යාව දෙවමනුස්සෙහි සුප්පකාසිතං ලාභග්ගප්පත්තඤ්ච යසග්ගප්පත්තඤ්ච, එවං තං බ්රහ්මචරියං පරිපූරං හොති තෙනඞ්ගෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "12. අහං ඛො පන චුන්ද එතරහි සත්ථා ලොකෙ උප්පන්නො අරහං සම්මාසම්බුද්ධො, ධම්මො ච ස්වාක්ඛාතො සුප්පවෙදිතො නිය්යානිකො උපසමසංවත්තනිකො සම්මාසම්බුද්ධප්පවෙදිතො. විඤ්ඤාපිතත්ථා ච මෙ සාවකා සද්ධම්මෙ, කෙවලඤ්ච තෙසං පරිපූරං බ්රහ්මචරියං ආවිකතං උත්තානීකතං සබ්බසඞ්ගාහපදකතං සප්පාටිහීරකතං යාව දෙවමනුස්සෙහි සුප්පකාසිතං. අහං ඛො පන චුන්ද එතරහි සත්ථා ථෙරො රත්තඤ්ඤූ චිරපබ්බජිතො. අද්ධගතො වයො අනුප්පත්තො. සන්ති ඛො පන මෙ චුන්ද එතරහි ථෙරා භික්ඛූ සාවකා වියත්තා විනීතා විසාරදා පත්තයොගක්ඛෙමා, අලං සමක්ඛාතුං සද්ධම්මස්ස, අලං උප්පන්නං පරප්පවාදං සහධම්මෙහි සුනිග්ගහිතං නිග්ගහෙත්වා සප්පාටිහාරියං ධම්මං දෙසෙතුං. සන්ති ඛො පන මෙ චුන්ද එතරහි මජ්ඣිමා භික්ඛූ සාවකා -පෙ- සන්ති ඛො පන මෙ චුන්ද එතරහි මජ්ඣිමා භික්ඛූ සාවකා -පෙ- සන්ති ඛො පන මෙ චුන්ද එතරහි නවා භික්ඛූ සාවකා -පෙ- සන්ති ඛො පන මෙ චුන්ද එතරහි ථෙරා භික්ඛුනියො සාවිකා -පෙ- සන්ති ඛො පන මෙ චුන්ද එතරහි මජ්ඣිමා භික්ඛුනියො සාවිකා -පෙ- සන්ති ඛො පන මෙ චුන්ද එතරහි නවා භික්ඛුනියො සාවිකා -පෙ- සන්ති ඛො පන මෙ චුන්ද එතරහි උපාසකා සාවකා ගිහී ඔදාතවසනා බ්රහ්මචාරිනො -පෙ- සන්ති ඛො පන මෙ චුන්ද එතරහි උපාසකා සාවකා ගිහී ඔදාතවසනා කාමභොගිනො -පෙ- සන්ති ඛො පන මෙ චුන්ද එතරහි උපාසිකා සාවිකා ගිහිනියො ඔදාතවසනා බ්රහ්මචාරිනියො -පෙ- සන්ති ඛො පන මෙ චුන්ද එතරහි උපාසිකා සාවිකා ගිහිනියො ඔදාතවසනා කාමභොගිනියො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "11. චුන්දයෙනි, යම් හෙයකින් ශාසනය මේ අඞ්ගවලින් සමන්විත වේ ද, ශාස්තෘ තෙමේත් ස්ථවිර ද රාත්‍රඥ ද චිරප්‍රව්‍රජිත ද දික් කලක් ඉක්මියේ ද පැසිම් වයසට පැමිණියේ ද වේ නම් කෙලෙස්නසනුවට ප්‍රයෝජනවත් සේ දහම් දෙසන්නට සමත් ව්‍යක්ත වූ විනීත වූ විසාරද වූ ස්ථවිර භික්ෂූ ශ්‍රාවකයෝත් ඔහුට වෙත් නම්, මැදුම් වයස්හි වූ … භික්ෂු ශ්‍රාවකයෝත් ඔහුට වෙත් නම්, නවක භික්ෂුශ්‍රාවකයෝත් ඔහුට වෙත් නම්, ස්ථවිර වූ භික්ෂුණී ශ්‍රාවිකාවෝත් ඔහුට වෙත් නම්, මැදුම් වයස්හි වූ භික්ෂුණී ශ්‍රාවිකාවෝත් ඔහුට වෙත් නම්, නවක භික්ෂුණී ශ්‍රාවිකාවෝත් ඔහුට වෙත් නම්, සුදුවත් හඳනා ගෘහී බ්‍රහ්මචාරී උපාසක ශ්‍රාවකයෝත් ඔහුට වෙත් නම්, සුදු වත් හඳනා ගෘහී කාමභෝගී උපාසක ශ්‍රාවකයෝත් ඔහුට වෙත් නම්, සුදු වත් හඳනා ගෘහස්ථබ්‍රහ්මචාරිණී උපාසිකා ශ්‍රාවිකාවෝත් ඔහුට වෙත් නම්, සුදු වත් හඳනා ගෘහස්ථ කාමභෝගිනී උපාසිකා ශ්‍රාවිකාවෝත් ඔහුට වෙත් නම්, ඔහුගේ ඒ සස්න සමෘද්ධ ද වෘද්ධිප්‍රාප්ත ද පැතිරැගියේ ද, බොහෝ දෙනා විසින් දන්නා ලද්දේ ද, පුළුල් වූයේ ද, නුවණැති සියලු දෙවිමිනිසුන් අතරැ සුප්‍රකාශිත ද ලාභයෙන් අග්‍රප්‍රාප්ත ද යශසින් අග්‍රප්‍රාප්ත ද වේ. මෙසේ ඒ සස්න ඒ අඞ්ගයෙන් පරිපූර්ණ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "12. චුන්දයෙනි, මම් වූ කලි මේ සමයෙහි පහළ වූ අර්හත් සම්‍යක්සම්බුද්ධයෙමි. ඒ සම්‍යක්සම්බුද්ධ වූ මා විසින් සුප්‍රවෙදිත වූ ධර්මය ද මොනොවට කියන ලද්දේ ය, මොනොවට දන්වන ලද්දේය. නෛර්යාණික ය, ක්ලේශෝපශමය පිණිස පවත්නේ ය. මගේ ශ්‍රාවකයෝ ද සද්ධර්මයෙහි අවබෝධකරවන ලද අර්ථ ඇත්තෝ ය. ඔවුන්ගේ සියලු සසුන් බඹසර පරිපූර්ණ ය, හෙළි කරන ලද්දේ ය, පෙහෙළි කරන ලද්දේ ය, සියලු ධර්මය කැටි කොට දක්වන ලද්දේ ය, දුක් දුරැලනුවට ප්‍රයෝජනවත් සේ දෙසන ලද්දේ ය, නුවණැති සියලු දෙවියන් මිනිසුන් අතරැ සුප්‍රකාශිත ය. චුන්දයෙනි, මම් වූ කලි මෙ සමයෙහි ස්ථවිර වූ චිරරාත්‍රඥ වූ, පැවිදි වූ බොහෝ කල් ඇති, දික් කලක් ඉක්මැ ගිය, පැසිම් වයසට පැමිණි ශාස්තෘ වෙමි. චුන්දයෙනි, දැන් ව්‍යක්ත වූ විනීත වූ විසාරද වූ, රහත් බවට පැමිණි, දහම් කියන්නට සමත් වූ, උපන් පරප්‍රවාදය කරුණු දක්වා මොනොවට නිගහා, දුක් දුරැලීමට ප්‍රයෝජනවත් වන සේ දහම් දෙසන්නට සමත් වූ ස්ථවිර භික්ෂු වූ මගේ ශ්‍රාවකයෝ වෙත්. චුන්දයෙනි, දැන් … මධ්‍යම වයස්ක භික්ෂු වූ මගේ ශ්‍රාවකයෝ වෙත්. දැන් ... නවක භික්ෂු වූ මගේ ශ්‍රාවකයෝ වෙත්. චුන්දයෙනි, දැන් … ස්ථවිර භික්ෂුණී වූ මගේ ශ්‍රාවිකාවෝ වෙත් … මධ්‍යමවයස්ක භික්ෂුණි වූ මගේ ශ්‍රාවිකාවෝ වෙත්. නවක භික්ෂුණී වූ මගේ ශ්‍රාවිකාවෝ වෙත්, චුන්දයෙනි, දැන් … සුදුවත් හඳනා බ්‍රහ්මචාරී වූ ගෘහස්ථ ශ්‍රාවකයෝ මට වෙත්. දැන් … සුදු වත් හඳනා කාමභෝගී වූ ගෘහස්ථ ශ්‍රාවකයෝ මට වෙත්. චුන්දයෙනි, දැන් … සුදු වත් හඳනා බ්‍රහ්මචාරීණී වූ ගෘහස්ථ ශ්‍රාවිකාවෝ මට වෙත්. දැන් … සුදු වත් හඳනා කාමභෝගී වූ ගෘහස්ථ ශ්‍රාවිකාවෝ මට වෙත්. ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 210,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එතරහි ඛො පන මෙ චුන්ද බ්රහ්මචරියං ඉද්ධං චෙව ඵීතඤ්ච විත්ථාරිතං බාහුජඤ්ඤං පුථුභූතං යාවදෙව මනුස්සෙහි සුප්පකාසිතං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යාවතා ඛො චුන්ද එතරහි සත්ථාරො ලොකෙ උප්පන්නා, නාහං චුන්ද අඤ්ඤං එකසත්ථාරම්පි සමනුපස්සාමි එවං ලාභග්ගයසග්ගප්පත්තං යථරිවාහං. යාවතා ඛො පන චුන්ද එතරහි සඞ්ඝො වා ගණො වා ලොකෙ උප්පන්නො, නාහං චුන්ද අඤ්ඤං එකසංඝම්පි සමනුපස්සාමි එවං ලාභග්ගයසග්ගප්පත්තං යථරිවායං චුන්ද භික්ඛුසඞ්ඝො. යං ඛො තං චුන්ද සම්මා වදමානො වදෙය්ය සබ්බාකාරපරිපූරං අනූනං අනධිකං ස්වාක්ඛාතං කෙවලපරිපූරං බ්රහ්මචරියං සුප්පකාසිතන්ති, ඉදමෙව තං සම්මා වදමානො වදෙය්ය සබ්බාකාරසම්පන්නං -පෙ- සුප්පකාසිතන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "13. උද්දකො සුදං{1} චුන්ද රාමපුත්තො එවං වාචං භාසති: පස්සං න පස්සතීති. කිඤ්ච පස්සං න පස්සතී?ති. ඛුරස්ස සාධු නිසිතස්ස තලමස්ස පස්සති, ධාරඤ්ච ඛ්වස්ස න පස්සති. ඉදං වුච්චති චුන්ද පස්සං න පස්සති. යං ඛො පනෙතං චුන්ද උද්දකෙන රාමපුත්තෙන භාසිතං හීනං ගම්මං පොථුජ්ජනිකං අනරියං අනත්ථසංහිතං ඛුරමෙව සන්ධාය, යඤ්ෙචතං චුන්ද සම්මා වදමානො වදෙය්ය ‘පස්සං න පස්සතී’ති, ඉදමෙෙවතං සම්මා වදමානො වදෙය්ය ‘පස්සං න පස්සතී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කිඤ්ච පස්සං න පස්සතී?ති: එවං සබ්බාකාරසම්පන්නං සබ්බාකාරපරිපූරං අනූනං අනධිකං ස්වාක්ඛාතං කෙවලපරිපූරං බ්රහ්මචරියං සුප්පකාසිතන්ති, ඉති හෙතං පස්සති ඉදමෙත්ථ අපකඩ්ඪෙය්ය, එවං තං පරිසුද්ධතරං අස්සාති, ඉති හෙතං න පස්සති. ඉදමෙත්ථ උපකඩ්ඪෙය්ය, එවං තං පරිසුද්ධතරං අස්සාති ඉති හෙතං න පස්සති. ඉදං වුච්චති පස්සං න පස්සතීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උදකො සුදං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "චුන්දයෙනි, දැන් වනාහි මගේ සස්න සමෘද්ධ ද වෘද්ධිප්‍රාප්ත ද, පැතිර ගියේ ද බොහෝ දෙනා විසින් දන්නා ලද්දේ ද, පුළුල් වූයේ ද, නුවණැති දෙව් මිනිසුන් අතරැ ප්‍රකාශිත ද වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "චුන්දයෙනි, මෙ සමයෙහි යම් පමණ දෙනෙක් ශාස්තෘහු ලොවැ පහළ වූහු ද, මා සේ ලාභයෙන් යශසින් අග පත් අන් එක ද ශාස්තෘවරයකු මම් නො දකිමි. චුන්දයෙනි, මෙ සමයෙහි යම් පමණ සඟ පිරිසෙක් හෝ ගණමුළුවෙක් ලොවැ පහළ වී ද, මේ භික්ෂූසඞ්ඝයා සේ ලාභයෙන් යශසින් අග පත් අන් එක ද සඟ පිරිසක් මම් නො දකිමි. චුන්දයෙනි,සියලු කාරණයෙන් සැපැයුණු, සියලු කාරණයෙන් පිරිපුන්, අඩු ද වැඩි ද නො වූ, මොනොවට කියන ලද, සියල්ලෙන් පිරිපුන්, මොනොවට ප්‍රකාශිත වූ ශාසන බ්‍රහ්මචර්යයැ යි යමක් ඇරැබැ මොනොවට කියන තැනැත්තේ කියන්නේ ද, හෙ තෙමේ මෙ සස්න ඇරැබැ ම සියලු කාරණයෙන් සැපැයුණු … මොනොවට ප්‍රකාශිත වූ බ්‍රහ්මචර්යයැ යි මොනොවට කියනුයේ කියන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "13. චුන්දයෙනි, රාම පුත්‍ර උද්‍රක තෙමේ ‘දක්නේ නො දකී’ යැ යි මෙසේ වූ වචනයක් කියයි. කුමක් දක්නේ නො දකී ද? යත්: මොනොවට මුවහත් කරන ලද ඒ කරකැත්තෙක තලය හේ දකී. එහෙත් එහි මූනත වූ කලී හේ නො දකී. චුන්දයෙනි, දක්නේ නො දකි යි යනු මේ යැ යි කියනු ලැබේ. චුන්දයෙනි, රාමපුත්‍ර උද්‍රකයා විසින් ම මේ හීන වූ ග්‍රාම්‍ය වූ පුහුදුනනට ම සුදුසු වූ ආර්ය නොවූ, ආශ්‍රිත නොවූ යම් වචනයෙක් කියන ලද ද, එහෙත් ‘දක්නේ නො දකී’ යැ යි මොනොවට කියන තැනැත්තේ යමක් සඳහා කියන්නේ නම්, ‘දක්නේ නො දකී’ යැ යි මේ සස්න සඳහා ම කියන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමක් දක්නේ නො දකී ද? යත්: මෙසේ මේ සසුන් බඹසර සියලු කරුණින් සැපැයුණේ ය, සියලු කරුණින් සපිරුණේ ය. අඩුත් නැත, වැඩිත් නැත. මොනොවට දෙසන ලද්දේ ය, සියලු අංගයෙන් පරිපූර්ණ ය. මනා කොට පවසන ලද්දේ යැ’ යි මෙසේ ම හේ මෙ සස්න දකී. මෙහි මෙනම් කොටස බැහැරැ කරන්නේ ය (බැහැරැ කළ යුතුය). මෙසේ එය වඩා පිරිසිදු වෙතැ යි මෙසේ හේ නො ම දකී. මෙහි (මෙ සස්නට) මෙ නම් කොටසක් පිටතින් ඇද ගන්නේ ය (ඇද ගත යුතුය). මෙසේ එය වඩා පිරිසිදු වන්නේ යැ යි මෙසේ මෙය හේ නො ම දකී. මෙය ‘දක්නේ නො දකී’ යැ යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 212,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යං ඛො තං චුන්ද සම්මා වදමානො වදෙය්ය “සබ්බාකාරසම්පන්නං -පෙ- බ්රහ්මචරියං සුප්පකාසිතන්ති” ඉදමෙව තං සම්මා වදමානො වදෙය්ය සබ්බාකාරසම්පන්නං සබ්බාකාරපරිපූරං අනූනං අනධිකං ස්වාක්ඛාතං කෙවලපරිපූරං බ්රහ්මචරියං සුප්පකාසිතන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "සඞ්ගායිතබ්බා ධම්මා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "14. තස්මාතිහ චුන්ද යෙ වො මයා ධම්මා අභිඤ්ඤා දෙසිතා, තත්ථ සබ්බෙහෙව සඞ්ගම්ම සමාගම්ම අත්ථෙන අත්ථං බ්යඤ්ජනෙන බ්යඤ්ජනං සඞ්ගායිතබ්බං න විවදිතබ්බං. යථයිදං බ්රහ්මචරියං අද්ධනියං අස්ස චිරට්ඨිතිකං. තදස්ස බහුජනහිතාය බහුජනසුඛාය ලොකානුකම්පාය අත්ථාය හිතාය සුඛාය දෙවමනුස්සානං. කතමෙ ච වො චුන්ද ධම්මා මයා අභිඤ්ඤා දෙසිතා යත්ථ සබ්බෙහෙව සඞ්ගම්ම සමාගම්ම අත්ථෙන අත්ථං බ්යඤ්ජනෙන බ්යඤ්ජනං සඞ්ගායිතබ්බං න විවදිතබ්බං, යථයිදං බ්රහ්මචරියං අද්ධනියං අස්ස චිරට්ඨිතිකං, තදස්ස බහුජනහිතාය බහුජනසුඛාය ලොකානුකම්පාය අත්ථාය හිතාය සුඛාය දෙවමනුස්සානං සෙය්යථිදං: චත්තාරො සතිපට්ඨානා, චත්තාරො සම්මප්පධානා, චත්තාරො ඉද්ධිපාදා, පඤ්චින්ද්රියානි, පඤ්ච බලානි, සත්ත බොජ්ඣඞ්ගා, අරියො අට්ඨඞ්ගිකො මග්ගො. ඉමෙ ඛො තෙ චුන්ද ධම්මා මයා අභිඤ්ඤා දෙසිතා. යත්ථ සබ්බෙහෙව සඞ්ගම්ම සමාගම්ම අත්ථෙන අත්ථං බ්යඤ්ජනෙන බ්යඤ්ජනං සඞ්ගායිතබ්බං, න විවදිතබ්බං, යථයිදං බ්රහ්මචරියං අද්ධනියං අස්ස චිරට්ඨිතිකං, තදස්ස බහුජනහිතාය බහුජනසුඛාය ලොකානුකම්පාය අත්ථාය හිතාය සුඛාය දෙවමනුස්සානං."
                    },
                    {
                        "type": "centered",
                        "text": "සඤ්ඤාපෙතබ්බ විධි",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "15. තෙසං ච වො චුන්ද සමග්ගානං සම්මොදමානානං අවිවදමානානං සික්ඛිතබ්බං අඤ්ඤතරො සබ්රහ්මචාරී සංඝෙ ධම්මං භාසෙය්ය. තත්ර චෙ තුම්හාකං එවමස්ස “අයං ඛො ආයස්මා අත්ථඤ්චෙව මිච්ඡා ගණ්හාති, බ්යඤ්ජනානි ච මිච්ඡා රොපෙතී”ති. තස්ස නෙව අභිනන්දිතබ්බං, නප්පටික්කොසිතබ්බං. අනභිනන්දිත්වා අප්පටික්කොසිත්වා සො එවමස්ස වචනීයො “ඉමස්ස නු ඛො ආවුසො අත්ථස්ස ඉමානි වා බ්යඤ්ජනානි එතානි වා බ්යඤ්ජනානි කතමානි ඔපායිකතරානි ඉමෙසං වා බ්යඤ්ජනානං අයං වා අත්ථො එසො වා අත්ථො, කතමො ඔපායිකතරො?ති”"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "මොනොවට කියන තැනැත්තේ ‘සියලු අයුරින් සැපැයුණු … සසුන් බඹසර මොනවට පැවැසිණැ’ යි යමක් ඇරැබැ කියන්නේ නම්, එසේ කියන තැනැත්තේ ‘සියලු අයුරින් සැපැයුණු, සියලු අයුරින් පිරිපුන්, අඩුත් නොවූ වැඩිත් නොවූ මොනොවට වදාරන ලද, හැම ලෙසින් පිරිපුන්, බඹසර මොනොවට පවසන ලදැ’ යි මෙ සසුන් බඹසර ඇරැබැ ම එය කියන්නේ ය (කිය යුතු ය.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "14. චුන්දයෙනි, එ හෙයින් මෙහි මා විසින් වෙසෙසි නුවණින් දැන තොපට යම් දහම් දෙසන ලද ද, එහි තොප සියලු දෙනා විසින් ම, යම්සේ මෙ සසුන් බඹසර දික් කලක් පැවැති යැ හැකි වන්නේ ද බොහෝ කලක් සිටි යැ හැකි වන්නේ ද, එසේ එක් වැ එක්රැස් වැ අර්ථයෙන් අර්ථය ද ව්‍යංජනය ද සසඳනුවන් ව සැඟැයිය යුතු ය. එය බොහෝ දෙනාට හිත පිණිස, බොහෝ දෙනාට සුව පිණිස, ලොවට අනුකම්පා පිණිස, දෙව්මිනිස්නට වැඩ පිණිස හිත පිණිස සුව පිණිස වන්නේ ය, ඒ දහම්හු නම්: සතර සතිපට්ඨානයෝ ය, සතර සම්‍යක්ප්‍රධානයෝ ය, සතර ඍද්ධිපාදයෝ ය, පඤ්ච ඉන්ද්‍රියෝ ය, පඤ්ච බල ය, සප්ත බොධ්‍යඞ්ගයෝ ය, ආර්ය අෂ්ටාඞ්ගික මාර්ගය යන මොහු ය. චුන්දයෙනි, සියලු දෙනා විසින් ම එක් වැ එක්රැස් වැ යමෙක අරුතින් අරුතද අකුරින් අකුර ද සසඳනුවන් ව, යම්සේ මේ බඹසර දික්කලක් පැවැති යැ හැකි වන්නේ ද, බොහෝ කලක් සිටියැ හැකි වන්නේ ද, එසේ සැඟැයියැ යුතු ද, විවාද නො කළ යුතු ද ඒ මා විසින් වෙසෙසි නුවණින් දැන දෙසන ලද මේ දහම්හු ය. එසේ එය සංගායනා කිරීම බොහෝ දෙනාට හිත පිණිස, බොහෝ දෙනාට සුව පිණිස, ලොවට අනුකම්පා පිණිස, දෙව්මිනිස්නට වැඩ පිණිස හිත පිණිස සුව පිණිස වන්නේ ය."
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "15. චුන්දයෙනි, සමග වූ සතුටු වන්නා වූ විවාද නො කරන්නා වූ ඒ තොප විසින් මෙසේ හික්මි යැ යුතු (උගත යුතු): එක්තරා සබ්‍රරම්සැරියෙක් සඞ්ඝයා කෙරෙහි දහම් දෙසන්නේ නම්, එහි තොපට ‘මේ ආයුෂ්මත්හු වූකලි අර්ථය ද වරදවා ගනී, ව්‍යඤ්ජන ද වරදවා නංවා යැ’යි මෙසේ සිතෙක් වන්නේ නම්, මොහුගේ වචනය නො ම පිළිගත යුතු, නො ද පිළිකෙවු කළ යුතු. නො පිළිගෙන, නො ද පිළිකෙවු කොට, “ඇවැත්නි, මේ අර්ථයට මොහු ව්‍යඤ්ජනයෝ ද නැත හොත් තුලු ව්‍යඤ්ජනයෝ ද? කවර ව්‍යඤ්ජන කෙනෙක් වඩා යෝග්‍ය ද? මේ ව්‍යඤ්ජනයන්ගේ අර්ථය මෙය ද? නැත හොත් එය ද? කවර අර්ථයෙක් වඩා යෝග්‍ය වේ දැ?” යි හෙ තෙමේ මෙසේ විචාළ යුතු වන්නේ ය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 214,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සො චෙ එවං වදෙය්ය “ඉමස්ස ඛො ආවුසො අත්ථස්ස ඉමානෙව බ්යඤ්ජනානි ඔපායිකතරානි යානෙව එතානි{1} ඉමෙසං බ්යඤ්ජනානං, අයමෙව අත්ථො ඔපායිකතරො යානෙව එසො’ති, සො නෙව උස්සාදෙතබ්බො න අපසාදෙතබ්බො. අනුස්සාදෙත්වා අනපසාදෙත්වා ස්වෙ ව සාධුකං සඤ්ඤාපෙතබ්බො, තස්ස ච අත්ථස්ස තෙසං ච බ්යඤ්ජනානං නිසන්තියා."
                    },
                    {
                        "type": "paragraph",
                        "text": "අපරොපි චෙ චුන්ද සබ්රහ්මචාරී සඞ්ඝෙ ධම්මං භාසෙය්ය. තත්ර චෙ තුම්හාකං එවමස්ස “අයං ඛො ආයස්මා අත්ථං හි ඛො මිච්ඡා ගණ්හාති, බ්යඤ්ජනානි සම්මා රොපෙතී”ති. තස්ස නෙව අභිනන්දිතබ්බං නප්පටික්කොසිතබ්බං. අනභිනන්දිත්වා අප්පටික්කොසිත්වා සො එවමස්ස වචනීයො “ඉමෙසං නු ඛො ආවුසො බ්යඤ්ජනානං අයං වා අත්ථො එසො වා අත්ථො, කතමො ඔපායිකතරො?”ති, සො චෙ එවං වදෙය්ය “ඉමෙසං ඛො ආවුසො බ්යඤ්ජනානං අයමෙව අත්ථො ඔපායිකතරො, යා චෙව එසො”ති. සො නෙව උස්සාදෙතබ්බො න අපසාදෙතබ්බො. අනුස්සාදෙත්වා අනපසාදෙත්වා ස්වෙව සාධුකං සඤ්ඤාපෙතබ්බො තස්සෙව අත්ථස්ස නිසන්තියා."
                    },
                    {
                        "type": "paragraph",
                        "text": "අපරො පන චුන්ද සබ්රහ්මචාරී සඞ්ඝෙ ධම්මං භාසෙය්ය, තත්ර චෙ තුම්හාකං එවමස්ස “අයං ඛො ආයස්මා අත්ථං හි ඛො සම්මා ගණ්හාති, බ්යඤ්ජනානි මිච්ඡා රොපෙතී”ති. තස්ස නෙව අභිනන්දිතබ්බං නප්පටික්කොසිතබ්බං. අනභිනන්දිත්වා අප්පටික්කොසිත්වා, සො එවමස්ස වචනීයො “ඉමස්ස නු ඛො ආවුසො අත්ථස්ස ඉමානෙව බ්යඤ්ජනානි එතානි වා බ්යඤ්ජනානි, කතමානි ඔපායිකතරානී?”ති. සො චෙ එවං වදෙය්ය “ඉමස්ස නු ඛො ආවුසො අත්ථස්ස ඉමානෙව බ්යඤ්ජනානි ඔපායිකතරා ව යානි චෙව එතානීති,{1} සො නෙව උස්සාදෙතබ්බො න අපසාදෙතබ්බො. අනුස්සාදෙත්වා අනපසාදෙත්වා ස්වෙව සාධුකං සඤ්ඤාපෙතබ්බො තෙසඤ්ඤෙව බ්යඤ්ජනානං නිසන්තියා."
                    },
                    {
                        "type": "paragraph",
                        "text": "අපරොපි චෙ චුන්ද සබ්රහ්මචාරී සඞ්ඝෙ ධම්මං භාසෙය්ය. තත්ර චෙ තුම්හාකං එවමස්ස “අයං ඛො ආයස්මා අත්ථඤ්චෙව සම්මා ගණ්හාති, බ්යඤ්ජනානි ච සම්මා රොපෙතී”ති, තස්ස ‘සාධූ’ති භාසිතං අභිනන්දිතබ්බං අනුමොදිතබ්බං. තස්ස ‘සාධූ’ති භාසිතං අභිනන්දිත්වා අනුමොදිත්වා සො එවමස්ස වචනීයො “ලාභා නො ආවුසො සුලද්ධං නො ආවුසො, යෙ මයං ආයස්මන්තං තාදිසං බ්රහ්මචාරිං පස්සාම එවං අත්ථුපෙතං බ්යඤ්ජනුපෙතන්ති.”"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. යාචෙව ඔතානි - සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ඉදින් හේ ඇවැත්නි, මේ අර්ථයට මේ ව්‍යඤ්ජන ම වඩා සුදුසු ය. මේ ව්‍යඤ්ජනයනට මා විසින් කියන ලද මේ යම් අර්ථ කෙනෙක් ඇද්ද, මේ අර්ථ ම වඩා සුදුසු ය. යම් තෙල අර්ථයෙක් ඇද්ද, එය නො ම හුවා දැක්වි යැ යුතු, නො ද බැහැරැ කළ යුතු. නො ම හුවා දක්වා, නො ම බැහැර කොට, ‘ඒ අර්ථය ද ඒ ව්‍යඤ්ජනයන් ද’ සලකා බලනු පිණිස හේ ම මොනොවට දැන්වියැ යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "චුන්දයෙනි, අන් සබ්රම්සැරියෙකුත්, සඞ්ඝයා කෙරෙහි දහම් කියන්නේ නම්, ‘මේ ආයුෂ්මත් තෙම අර්ථය වරදවා ගනී, ව්‍යඤ්ජනයන් මොනොවට නංවා’ යැ යි එහි තොපට මෙසේ සිතෙක් වන්නේ නම්, ඔහුගේ වචන නො ම පිළිගත් යුතු නො ද පිළිකෙවු කළ යුතු. සතුටු ද නො වී, නො ද පිළිකෙවු කොට, ‘ඇවැත්නි, මේ ව්‍යඤ්ජනයන්ගේ මේ අර්ථය ද? නැත හොත් තෙල අර්ථය ද? මෙයින් කවර එකෙක් වඩා යෝග්‍ය දැ?’ යි මෙසේ හේ කියැ යුතු ය. ඉදින් ‘ඇවැත්නි, මේ ව්‍යංජනයන්ගේ (ශබ්දයන්ගේ) යම් තෙල අරුතෙක් වේ ද, ඒ මේ අරුත ම වඩා යෝග්‍ය යැ’ යි හෙ තෙමෙ මෙසේ කියන්නේ නම්, හේ නො ම හුවා දැක්විය යුතු, නො ද හෙලා දැක්ක යුතු. නො ම හුවා දක්වා, නො ද හෙලා දැක, එහි අරුත් සලකා බලනු පිණිස හේ ම මොනොවට දැන්වියැ යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "චුන්දයෙනි, අන් සබ්රම්සැරියෙක් සඞ්ඝයා කෙරෙහි දහම් කියන්නේ නම්, ‘මේ ආයුෂ්මත්හු අර්ථය වූකලි මොනොවට ගනිත්, ව්‍යඤ්ජනයන් වරදවා නංවතී’ යි තොපට මෙසේ සිතෙක් වන්නේ නම් ඔහුගේ වචනයට නො ම සතුටු වියැ යුතු, එය නො ද පිළිකෙවු කළ යුතු. එයට නො ම සතුටු ව, නො ද පිළිකෙවු කොට, ‘ඇවැත්නි, මේ අර්ථයාගේ (මේ අර්ථය පවසන) ව්‍යඤ්ජනයෝ මොහු ම ද? නැත හොත් තුලුහු ද? කවර ව්‍යඤ්ජන කෙනෙක් වඩා යෝග්‍ය දැ?’ යි හේ මෙසේ කියැ යුතු (ඔහුගෙන් මෙසේ ප්‍රශ්න කළ යුතු.) ඉදින් හෙ තෙම් “ඇවැත්නි, (මා කී) යම් තෙල ව්‍යඤ්ජන කෙනෙක් වෙත් ද, මේ අර්ථයට ඒ ව්‍යඤ්ජනයෝ ම වඩා යෝග්‍ය වෙත්” යැ යි මෙසේ කියන්නේ නම්, හේ නො ම හුවා කියැ යුතු නො ද හෙලා කියැ යුතු. හුවා නො කියා, හෙලා ද නො කියා, ඒ ව්‍යඤ්ජනයන් ම සලකා බලනු පිණිස හේ ම මොනොවට දැන්වියැ යුතු.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "චුන්දයෙනි, අන් සබ්රම්සැරියෙක් ද සඞ්ඝයා කෙරෙහි දහම් කියන්නේ නම්, ඉදින් එහි ලා ‘මේ ආයුෂ්මත්හු වනාහි අර්ථය ද මොනොවට ගනී, ව්‍යඤ්ජනයන් ද මොනොවට නංවා යැ’ යි තොපට මෙසේ සිතෙක් වන්නේ නම්, ‘මැනැවැ’ යි ඔහුගේ වචනයට සතුටු වියැ යුතු , අනුමෙවියැ යුතු. ඔහුගේ වචනයට 'මැනැවැ යි සතුටු වැ, අනුමෙවැ‘ඇවැත්නි, යම්බඳු වූ අපි මෙසේ අරුත් දන්නා, ව්‍යංජන දන්නා ආයුෂ්මත් වූ ඔබ වැනි සබ්රම්සරක්හු දක්නමෝ ද, ඇවැත්නි ඒ අපට ලාභයෝ ය, ඇවැත්නි, ඒ අප විසින් (අත්බව) මොනොවට ලදුයේ යැ’යි හේ මෙසේ කියැ යුතු වන්නේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 216,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "පච්චයානුඤ්ඤාතකාරණං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "16. න වො අහං චුන්ද දිට්ඨධම්මිකානං යෙව ආසවානං සංවරාය ධම්මං දෙසෙමි. න පනාහං චුන්ද සම්පරායිකානං යෙව ආසවානං පටිඝාතාය ධම්මං දෙසෙමි. දිට්ඨධම්මිකානං චෙවාහං චුන්ද ආසවානං සංවරාය ධම්මං දෙසෙමි. සම්පරායිකානඤ්ච ආසවානං පටිඝාතාය. තස්මා තිහ චුන්ද යං වො මයා චීවරං අනුඤ්ඤාතං, අලං වො තං යාවදෙව සීතස්ස පටිඝාතාය, උණ්හස්ස පටිඝාතාය, ඩංසමකසවාතාතපසරිංසපසම්ඵස්සානං පටිඝාතාය, යාවදෙව හිරිකොපීනපටිච්ඡාදනත්ථං. යො වො මයා පිණ්ඩපාතො අනුඤ්ඤාතො, අලං වෙසො යාවදෙව ඉමස්ස කායස්ස ඨිතියා යාපනාය විහිංසූපරතියා බ්රහ්මචරියානුග්ගහාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉති පුරාණඤ්ච වෙදනං පටිහඞ්ඛාමි නවඤ්ච වෙදනං න උප්පාදෙස්සාමි, යාත්රා ච මෙ භවිස්සති අනවජ්ජතා ච ඵාසුවිහාරො චාති. යං වො මයා සෙනාසනං අනුඤ්ඤාතං, අලං වො තං යාවදෙව සීතස්ස පටිඝාතාය උණ්හස්ස පටිඝාතාය ඩංසමකසවාතාතපසරිංසපසම්ඵස්සානං පටිඝාතාය යාවදෙව උතුපරිස්සයවිනොදනං පටිසල්ලානාරාමත්ථං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යො වො මයා ගිලානපච්චයභෙසජ්ජපරික්ඛාරො අනුඤ්ඤාතො, අලං වො සො යාවදෙව උප්පන්නානං වෙය්යාබාධිකානං වෙදනානං පටිඝාතාය අබ්යාපජ්ජපරමතායා ති."
                    },
                    {
                        "type": "centered",
                        "text": "සුඛල්ලිකානුයොගා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "17. ඨානං ඛො පනෙතං චුන්ද විජ්ජති, යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං “සුඛල්ලිකානුයොගමනුයුත්තා සමණා සක්යපුත්තියා විහරන්තී”ති. එවං වාදිනො චුන්ද අඤ්ඤතිත්ථියා පරිබ්බාජකා එවමස්සු වචනීයා “කතමො සො ආවුසො සුඛල්ලිකානුයොගො? සුඛල්ලිකානුයොගා හි බහූ අනෙකවිහිතා නානප්පකාරකා”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "16. චුන්දයිනි, මේ ලොවැ (ප්‍රත්‍යය පර්යේෂණ ප්‍රත්‍යය පරිභෝග හේතුයෙන්) උපදනා කාමාස්‍රවාදි ආස්‍රව හැවුරුම පිණිස පමණක් තොපට දහම් නො දෙසමි. චුන්දයෙනි, (කලහ හේතුයෙන් උපදනා) පරලොවැ දී දුක් විපාක දෙන ආස්‍රවයන් නැසීම පිණිස පමණක් දහම් නො දෙසමි. චුන්දයෙනි, තොපට මෙලොවැ උපදනා ආස්‍රවයන්ගේ සංවරය පිණිස ද, පරලොවැ විපාක දෙන ආස්‍රවයන්ගේ විනාශය පිණිස ද තොපට දහම් දෙසමි. චුන්දයෙනි, එහෙයින් මෙහි මා විසින් තොපට යම් සිවුරෙක් අනුදන්නා ලද ද, එය යම්තාක් ම ශීතය නැසීම පිණිස උණුසුම නැසීම පිණිස, ඇටලේ මැස්සන් මදුරුවන් සර්පයන් අවු සුළං යන මොවුන්ගේ ස්පර්ශය වැළැක්වීම පිණිස, හිරි කොවන අඞ්ග වසාලනු පිණිස සමත් ම වෙයි. තොපට මා විසින් යම් පිණ්ඩපාතයෙක් අනුදන්නා ලද්දේ ද, එය යම්තාක් ම මෙ රූපකය සිටුනා පිණිස, “මෙසේ පැරැණි බඩගිනි වේදනාව නසන්නෙමි, අළුත් බඩගිනි වේදනාවක් නො උපදවන්නෙමි, මෙයින් මගේ ජීවිත යාත්‍රාව ද වන්නේ ය, නිවරද බව ද පහසු විහරණය ද වන්නේ යැ” යි යැපෙනු පිණිස වෙහෙසින් වළකිනු පිණිස, බඹසරට අනුග්‍රහ පිණිස සමත් ම වෙයි."
                    },
                    {
                        "format": 13,
                        "text": "මා විසින් තොපට යම් සෙනස්නෙක අනුදන්නා ලද ද, එය යම්තාක් ම ශීත නසනු පිණිස, උෂ්ණය නසනු පිණිස ඇට මැසි මදුරු අවු සුළං සර්ප යන මොවුන්ගේ ස්පර්ශය වළක්වනු පිණිස ඍතුවිපර්යාසයෙන් වන උවදුරු දුරැලීම පිණිස, චිත්තවිවේකයෙහි ඇලෙනු පිණිස සෑහෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මා විසින් තොපට යම් බෙහෙතක් පිරිකරෙක් අනුදන්නා ලද ද, එය තොපට උපදනා යම්තාක් රෝගවේදනා වැළැක්ම පිණිස, ව්‍යාබාධ නැති බව (නිදුක් බව) පරම කොට ඇති බව පිණිස සෑහෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "17. චුන්දයෙනි, ශ්‍රමණශාක්‍යපුත්‍රීයයෝ සුඛල්ලිකානුයෝගයෙහි (සුව සෙවිනුයෙහි) ඇලී වෙසෙත් යැ’ යි අන්තොටු පිරිවැජ්ජෝ මෙසේ කියන්නාහු ය’ යන මේ කාරණයෙක් ඇත. චුන්දයෙනි, මෙසේ කියන අන්තොටු පිරිවැජියෝ “ඇවැත්නි, ඒ කවර සුඛල්ලිකානුයෝගයෙක් ද? (සුව සෙවිනුයෙහි ඇලීමෙක් ද?) සුඛල්ලිකානුයෝගයෝ (සුව සෙවිනුයෙහි ඇලීම්) වූ කලි බොහෝ හ, නොයෙක් වැදෑරුම් හ, නන් අයුරු හ” යි මෙසේ කියැ යුතු වන්නාහ. (අන්තොටු පිරිවැජ්ජනට මෙසේ කියැ යුතු)"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 218,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "චත්තාරො’මෙ චුන්ද සුඛල්ලිකානුයොගා හීනා ගම්මා පොථුජ්ජනිකා අනරියා අනත්ථසංහිතා න නිබ්බිදාය න විරාගාය න නිරොධාය න උපසමාය න අභිඤ්ඤාය න සම්බොධාය න නිබ්බානාය සංවත්තන්ති. කතමෙ චත්තාරො? ඉධ චුන්ද එකච්චො බාලො පාණෙ වධිත්වා වධිත්වා අත්තානං සුඛෙති පීණෙති. අයං පඨමො සුඛල්ලිකානුයොගො. පුන ච පරං චුන්ද ඉධෙකච්චො අදින්නං ආදියිත්වා ආදිසිත්වා අත්තානං සුඛෙති පීණෙති. අයං දුතියො සුඛල්ලිකානුයොගො. පුන ච පරං චුන්ද ඉධෙකච්චො මුසා භණිත්වා භණිත්වා අත්තානං සුඛෙති පීණෙති. අයං තතියො සුඛල්ලිකානු යොගො. පුන ච පරං චුන්ද ඉධෙකච්චො පඤ්චහි කාමගුණෙහි සමප්පිතො සමඞ්ගීභූතො පරිචාරෙති. අයං චතුත්ථො සුඛල්ලිකානුයොගො. ඉමෙ ඛො චුන්ද චත්තාරො සුඛල්ලිකානුයොගා හීනා ගම්මා පොථුජ්ජනිකා අනරියා අනත්ථසංහිතා න නිබ්බිදාය න විරාගාය න නිරොධාය න උපසමාය න අභිඤ්ඤාය න සම්බොධාය න නිබ්බානාය සංවත්තන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "18. ඨානං ඛො පනෙතං චුන්ද විජ්ජති, යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං ‘ඉමෙ චත්තාරො සුඛල්ලිකානුයොගෙ අනුයුත්තා සමණා සක්යපුත්තියා”ති. තෙ වො ‘මා හෙවන්තිස්සුවචනීයා. න තෙ සම්මා වදමානා වදෙය්යුං අබ්භාචික්ඛෙය්යුං අසතා අභූතෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "චත්තාරො’මෙ චුන්ද සුඛල්ලිකානුයොගා එකන්තනිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තන්ති. කතමෙ චත්තාරො? ඉධ චුන්ද භික්ඛු විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහරති. අයං පඨමො සුඛල්ලිකානුයොගො. පුන ච පරං චුන්ද භික්ඛු විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියං ඣානං උපසම්පජ්ජ විහරති. අයං දුතියො සුඛල්ලිකානුයොගො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "චුන්දයෙනි, හීන වූ ග්‍රාම්‍ය වූ, පෘථග්ජනයන් අයත් වූ අනාර්ය වූ අවැඩ ඇසුරු කළාවූ සුඛල්ලිකානුයෝගයෝ (සුව සෙවිනුයෙහි ඇලීම්) සතරෙකි, ඔහු සසරැ කලකිරෙනු පිණිස, නොඇල්ම පිණිස, කෙලෙස් නසනු පිණිස, කෙලෙස් සංසිඳෙනු පිණිස, විශිෂ්ටඥානය පිණිස, සම්බෝධිය පිණිස, නිවන් පිණිස නො පවතිත්. කවර සතර දෙනෙක් ද? යත්: චුන්දයෙනි, මෙහි එක්තරා අනුවණයෙක් පණිවා කොට කොට තමා සුව පත් කෙරෙයි, තමා පිණවයි. මේ පළමු වන කාමසුඛල්ලිකානුයෝගය යි. තව ද චුන්දයෙනි, මෙහි එක්තරා අනුවණයෙක් අයිනාදන් කොට කොට තමා සුව පත් කෙරෙයි, තමා පිණවයි. මේ දෙවෙනි සුඛල්ලිකානුයෝගය යි. තව ද චුන්දයෙනි, මෙහි එක්තරා අනුවණයෙක් මුසවා බැණ බැණ තමා සුව පත් කෙරෙයි, තමා පිණවයි. මේ තෙවෙනි සුඛල්ලිකානුයෝගය යි. තව ද චුන්දයෙනි, මෙහි එක්තරා අනුවණයෙක් පස්කම් ගුණයෙන් සමර්පිත වැ යුක්ත වැ ඉඳුරන් හසුරුවයි. මේ සිවු වන සුඛල්ලිකානුයෝගය යි. චුන්දයෙනි, සතර සුඛල්ලිකානුයෝගයෝ හීන හ, ග්‍රාම්‍ය හ, පුහුදුනන් අයත් හ, අනාර්ය හ, අනර්ථනිඃශ්‍රිත හ, සසරැ කලකිරෙනු පිණිස නො පවත්නා හ, විරාගය පිණිස නො පවත්නාහ, නිරෝධය පිණිස නො පවත්නාහ, කෙලෙස් සංසිඳීම පිණිස නො පවත්නාහ, විශිෂ්ටඥානය පිණිස නො පවත්නාහ, සම්බෝධිය පිණිස නො පවත්නාහ, නිවන පිණිස නො පවත්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "18. චුන්දයෙනි, ‘ශ්‍රමණ ශාක්‍යපුත්‍රීයයෝ මේ සතර කාමසුඛල්ලිකානුයන්හි යෙදුනෝ ව වෙසෙත් යැ’ යි මෙසේ අන් තොටු පිරිවැජ්ජෝ කියන්නාහ යන මේ කාරණය වූකලි ඇත. (එසේ කියන) ඔහු ‘එසේ නො කියවු’ යැ යි කියැ යුතු වන්නාහ. ඔහු තොපට මොනොවට නිවැරැදි ලෙස නො කියන්නෝ ම එසේ කියන්නාහ. නැති දැයින් නොවූ දැයින් දොස් කියන්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "චුන්දයෙනි, මේ සුඛල්ලිකානුයෝගයෝ සතර දෙනෙකි. ඔහු ඒකාන්තයෙන් සසරැ කලකිරෙනු පිණීස, විරාගය පිණිස, නිරෝධය පිණිස, ක්ලේශෝපශමය පිණිස, විශිෂ්ටඥානය පිණිස, සම්බෝධිය පිණිස, නිර්වාණය පිණිස පවත්නාහ. කවර සතර දෙනෙක් ද? යත්: චුන්දයෙනි, මෙහි මහණ තෙම කාමයන්ගෙන් වෙන් ව ම, අකුසල් දහමුන්ගෙන් වෙන් ව ම, විතර්ක සහිත, විචාර සහිත, විවේකයෙන් උපන්, ප්‍රීතිය හා සුවය හා ඇති ප්‍රථම ධ්‍යානයට පැමිණ වෙසෙයි. මේ පළමු වන සුඛල්ලිකානුයෝගය යි. තව ද චුන්දයෙනි, මෙහි මහණ තෙමෙ විතර්ක විචාරයන් සංසිඳිමෙන්, තමා තුළ පැහැදීම ඇති කරන, සිත එකඟබව ඇති, විතර්ක රහිත විචාර රහිත සමාධියෙන් උපන්, ප්‍රීතිය හා සැපය හා ඇති ද්විතීය ධ්‍යානයට පැමිණ වෙසෙයි. මේ දෙවෙනි සුඛල්ලිකානුයෝගය යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 220,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "පුන ච පරං චුන්ද භික්ඛු පීතියා ච විරාගා -පෙ- තං තතියං ඣානං උපසම්පජ්ජ විහරති. අයං තතියො සුඛල්ලිකානුයොගො. පුන ච පරං චුන්ද භික්ඛු සුඛස්ස ච පහානා දුක්ඛස්ස ච පහානා -පෙ- චතුත්ථං ඣානං උපසම්පජ්ජ විහරති. අයං චතුත්ථො සුඛල්ලිකානුයොගො. ඉමෙ ඛො චුන්ද චත්තාරො සුඛල්ලිකානුයොගෙ එකන්තනිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "18. ඨානං ඛො පනෙතං චුන්ද විජ්ජති, යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං “ඉමෙ චත්තාරො සුඛල්ලිකානුයොගා අනුයුත්තා සමණා සක්යපුත්තියා විහරන්තී”ති. තෙ වො එවං ති’ස්සු වචනීයා සම්මා තෙ වො වදමානා වදෙය්යුං, න තෙ වො අබ්භාචික්ඛෙය්යුං අසතා අභූතෙන."
                    },
                    {
                        "type": "centered",
                        "text": "සුඛල්ලිකානුයොගානිසංසා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඨානං ඛො පනෙතං චුන්ද විජ්ජති, යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං ‘ඉමෙ පන ආවුසො චත්තාරො සුඛල්ලිකානුයොගෙ අනුයුත්තානං විහරතං කති ඵලානි කතානිසංසා පාටිකඞ්ඛා?”ති. එවංවාදිනො චුන්ද අඤ්ඤතිත්ථියා පරිබ්බාජකා එවමස්සු වචනීයා “ඉමෙ ඛො ආවුසො චත්තාරො සුඛල්ලිකානුයොගෙ අනුයුත්තානං විහරතං චත්තාරි ඵලානි චත්තාරො ආනිසංසා පාටිකඞ්ඛා. කතමෙ චත්තාරො? ඉධාවුසො භික්ඛු තිණ්ණං සඤ්ඤොජනානං පරික්ඛයා සොතාපන්නො හොති අවිනිපාතධම්මො නියතො සම්බොධිපරායනො. ඉදං පඨමං ඵලං පඨමො ආනිසංසො. පුන ච පරං ආවුසො භික්ඛු තිණ්ණං සඤ්ඤොජනානං පරික්ඛයා රාගදොසමොහානං තනුත්තා සකදාගාමී හොති සකිදෙව ඉමං ලොකං ආගන්ත්වා දුක්ඛස්සන්තං කරොති. ඉදං දුතියං ඵලං දුතියො ආනිසංසො. පුන ච පරං ආවුසො භික්ඛු පඤ්චන්නං ඔරම්භාගියානං සඤ්ඤොජනානං පරික්ඛයා ඔපපාතිකො හොති තත්ථ පරිනිබ්බායී අනාවත්තිධම්මො තස්මා ලොකා’ති. ඉදං තතියං ඵලං තතියො ආනිසංසො. පුන ච පරං ආවුසො භික්ඛු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති. ඉදං චතුත්ථං ඵලං චතුත්ථො ආනිසංසො. ඉමෙ ඛො ආවුසො චත්තාරො සුඛල්ලිකානුයොගෙ අනුයුත්තානං විහරතං ඉමානි චත්තාරි ඵලානි චත්තාරො ආනිසංසා පාටිකඞ්ඛා”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "චුන්දයෙනි, තව ද මහණ තෙමෙ ප්‍රීතිය ද පහ වීමෙන් … ඒ තෘතීය ධ්‍යානයට පැමිණ වෙසෙයි. මේ තෙවෙනි සුඛල්ලිකානුයෝගය යි. චුන්දයෙනි, තව ද මහණ තෙමෙ සුඛවේදනාව ද පහ කිරීමෙන් … චතුර්ථ ධ්‍යානයට පැමිණ වෙසෙයි. මේ සිවුවැනි සුඛල්ලිකානුයෝගය යි. චුන්දයෙනි, මේ සතර සුඛල්ලිකානුයෝගයෝ ඒකාන්තයෙන් සසර කලකිරෙනු පිණිස, විරාගය පිණිස, නිරෝධය පිණිස, ක්ලේශෝපශමය පිණිස, විශිෂ්ටඥානය පිණිස, සම්බෝධිය පිණිස, නිර්වාණය පිණිස පවතිත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "18. චුන්දයෙනි, ‘ශාක්‍යපුත්‍රීය ශ්‍රමණයෝ මේ සතර සුඛල්ලිකානුයන්හි යෙදී වෙසෙත්’ යැ යි අන්තොටු පිරිවැජ්ජෝ කියන්නාහ යන මේ කාරණය ඇත. ‘එසේ යැ’ යි ඔහු කියැ යුත්තාහ (ඔවුනට පිළිතුරු දියැ යුතු.) ඔහු මොනොවට කියන්නාහු. නැති දැයින් නොවූ දැයින් තොපට දොස් නො කියන්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "චුන්දයෙනි, ‘ඇවැත්නි, මේ සතර සුඛල්ලිකානුයෝගයන්හි යෙදී වසනවුන් විසින් ඵල කීයෙක්, අනුසස් කීයෙක් කැමැති වියැ යුතු දැ'? යි අන්තොටු පිරිවැජ්ජෝ මෙසේ පුළුවුස්නාහ’ යන මේ කාරණය වූ කලි ඇත. චුන්දයෙනි, මෙසේ පුළුවුස්නා අන්තොටු පිරිවැජියෝ මෙසේ කිය යුතු (අන් තොටු පිරිවැජියනට මෙසේ පිළිතුරු දියැ යුතු:) “ඇවැත්නි, මේ සතර කාමසුඛල්ලිකානුයෝගයන්හි යෙදී වසන්නවුන් විසින් සතර ඵල කෙනෙක් සතර ආනිසංස කෙනෙක් කැමැති වියැ යුතු හ. කවර සතර දෙනෙක් ද? යත්: ඇවැත්නි, මෙහි මහණ තෙමෙ තුන් සංයෝජනයන් ක්ෂය කිරීමෙන් අපායට නොවැටෙන සුලු, ධර්මනියාමයෙන් නියත වූ. උපරිමාර්ගත්‍රයය පරායණය කොටැති (අවශ්‍යයෙන් පැමිණියැ යුතු) සෝවාන් පුඟුලෙක් වෙයි. මේ පළමු වන ඵලය යැ, පළමු වන අනුසස යැ. ඇවැත්නි, තව ද මහණ තෙමෙ තුන් සංයෝජනයන්ගේ පරික්ෂයයෙන්, රාග ද්වේෂ මෝහයන් තුනී වීමෙන් සෙදැගැමි වෙයි, එක් වරක් ම මේ කාම ලෝකයට අවුත් දුක් කෙළවර කෙරෙයි. මේ දෙවෙනි ඵලය යි, දෙවෙනි අනුසස යි. ඇවැත්නි, තව ද, මහණ තෙමෙ අවරභාගික සංයෝජන පස ක්ෂය වීමෙන් ශුද්ධාවාස බඹලොව්හි උපදනේ, එහි පිරිනිවෙන සුලු වූයේ, ඒ ලොවින් මෙහි පෙරළා නොඑන සුලු වෙයි. මේ තෙවෙනි ඵලය යැ, තෙවෙනි අනුසස යැ. තවද ඇවැත්නි, මහණ තෙමෙ ආස්‍රවයන්ගේ ක්ෂයයෙන් ආස්‍රව රහිත වූ ඵලසමාධියත් ඵලඥානයත් මෙ අත්බව්හි ම තෙමේ වෙසෙසි නුවණින් දැන පසක් කොට, එයට පැමිණ වෙසෙයි. මේ සතර වන ඵලය යැ, සතර වන අනුසස යැ. ඇවැත්නි, සතර සුඛල්ලිකානුයෝගයන්හි යෙදී වසනවුන් විසින් මේ සතර ඵල, සතර අනුසස් කැමැති වියැ යුතු යැ යි, (ඒ අන්තොටු පිරිවැජියනට) කියැ යුතු."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 222,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "ඛීණාසවානං අභබ්බඨානානි",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "19. ඨානං ඛො පනෙතං චුන්ද විජ්ජති, යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං “අට්ඨිතධම්මා සමණා සක්යපුත්තියා විහරන්තී”ති. එවං වාදිනො චුන්ද අඤ්ඤතිත්ථියා පරිබ්බාජකා එවමස්සු වචනීයා: අත්ථි ඛො ආවුසො තෙන භගවතා ජානතා පස්සතා අරහතා සම්මාසම්බුද්ධෙන සාවකානං ධම්මා දෙසිතා පඤ්ඤත්තා යාවජීවං අනතික්කමනීයා. සෙය්යථාපි ආවුසො ඉන්දඛීලො වා අයොඛීලො වා ගම්භීරනෙමො සුනිඛාතො අචලො අසම්පවෙධී, එවමෙව ඛො ආවුසො තෙන භගවතා ජානතා පස්සතා අරහතා සම්මාසම්බුද්ධෙන සාවකානං ධම්මා දෙසිතා පඤ්ඤත්තා යාවජීවං අනතික්කමනීයා. යො සො ආවුසො භික්ඛු අරහං ඛීණාසවො වුසිතවා කතකරණීයො ඔහිතභාරො අනුප්පත්තසදත්ථො පරික්ඛීණභවසඤ්ඤොජනො සම්මදඤ්ඤා විමුත්තො අභබ්බො සො නව ඨානානි අජ්ඣාචරිතුං: අභබ්බො ආවුසො ඛීණාසවො භික්ඛු සංචිච්ච පාණං ජීවිතා වොරොපෙතුං. අභබ්බො ඛීණාසවො භික්ඛු අදින්නං ථෙය්යසඞ්ඛාතං ආදියිතුං, අභබ්බො ඛීණාසවො භික්ඛු මෙථුනං ධම්මං පටිසෙවිතුං, අභබ්බො ඛීණාසවො භික්ඛු සම්පජානමුසා භාසිතුං, අභබ්බො ඛීණාසවො භික්ඛු සන්නිධිකාරකං කාමෙ පරිභුඤ්ජිතුං, සෙය්යථාපි පුබ්බෙ ආගාරිකභූතො. අභබ්බො ඛීණාසවො භික්ඛු ඡන්දාගතිං ගන්තුං, අභබ්බො ඛීණාසවො භික්ඛු දොසාගතිං ගන්තුං, අභබ්බො ඛීණාසවො භික්ඛු මොහාගතිං ගන්තුං, අභබ්බො ඛීණාසවො භික්ඛු භයාගතිං ගන්තුං. යො සො ආවුසො භික්ඛු අරහං ඛීණාසවො වුසිතවා කතකරණීයො ඔහිතභාරො අනුප්පත්තසදත්ථො පරික්ඛීණභවසඤ්ඤොජනො සම්මදඤ්ඤා විමුත්තො, අභබ්බො සො ඉමානි නව ඨානානි අජ්ඣාචරිතු”න්ති."
                    },
                    {
                        "type": "centered",
                        "text": "පඤ්හබ්යාකරණානි",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "20. ඨානං ඛො පනෙතං චුන්ද විජ්ජති යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං “අතීතං ඛො අද්ධානං ආරබ්භ සමණො ගොතමො අතීරකං{1} ඤාණදස්සනං පඤ්ඤපෙති, නො ච ඛො අනාගතං අද්ධානං අරබ්භ අතීරකං ඤාණදස්සනං පඤ්ඤපෙති. තයිදං කිංසු තයිදං කථංසූ?”ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අතිරෙකං - සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "19. චුන්දයෙනි, ‘මේ ශාක්‍යපුත්‍රීය ශ්‍රමණයන් ස්ථීර ස්වභාවයක් නැති වැ වෙසෙතැ’ යි අන්තොටු පිරිවැජියෝ මෙසේ කියන්නාහ යන මේ කාරණය විද්‍යමාන ය. චුන්දයෙනි, මෙසේ කියන සුලු අන්තොටු පිරිවැජියෝ මෙසේ කියැ යුත්තාහ (අන්තොටු පිරිවැජියනට මෙසේ උත්තර දියැ යුතු) : ඇවැත්නි, දන්නා දක්නා අර්හත් සම්‍යක්සම්බුද්ධ වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් සව්වනට දෙසන ලද පනවන ලද දිවිහිමියෙන් නො ඉක්මියැයුතු දහම්හු ඇත්හ. පොළවැ ගැඹුරට පිවිසී, බිමැ මොනොවට සිටුවන ලද, නො සැලෙන, කම්පිත නො වන ඉන්ද්‍රකීලයෙක් හෝ අයස්කීලයෙක් යම්සේ ද, ඇවැත්නි, එසේ ම දන්නා දක්නා අර්හත් සම්‍යක්සම්බුද්ධ වූ ඒ භගවත්හු විසින් දිව්හිමියෙන් නොඉක්මියැ යුතු ධර්මයෝ දෙසන ලද හ, පනවන ලද හ. ඇවැත්නි, ක්ෂීණ ආස්‍රව ඇති, වැස නිමැවූ මඟබඹසර ඇති සිවුමඟින් කොට නිමැවූ කෘත්‍ය ඇති, බහා තුබූ කෙලෙස් බර ඇති, පැමිණි ස්වාර්ථය (රහත්බව) ඇති, හැම අයුරින් නැසූ භවබන්ධන ඇති, මනානුවණින් දැන මිදුණු යම් රහත් මහණෙක් වේ ද, හේ නව තැනක් ඉක්මැ හැසිරෙන්නට නො හැකි වෙයි: ඇවැත්නි, රහත් මහණ තෙමෙ දැන සතක්හු දිවියෙන් තොර කරන්නට නො හැකි වෙයි. රහත් මහණ තෙමෙ නොදුන් දැයක් සොර සිතින් ගන්නට නො හැකි වෙයි. රහත් මහණ තෙමෙ මෙවුන්දම් සෙවිනුවට නො හැකි වෙයි. රහත් මහණ තෙමෙ දැන මුසාබස් කියන්නට නො හැකි වෙයි. රහත් මහණ තෙමෙ, පෙරැ ගිහි වැ සිටියේ යම්සේ ද එසේ, කාමයන් රැස් කොට ගෙන පරිභෝග කරන්නට නො හැක වෙයි. රහත් මහණ තෙමෙ ඡන්දයෙන් අගතියට යන්නට නො හැකි වෙයි. රහත් මහණ තෙමෙ ද්වේශයෙන් අගතියට යන්නට නො හැකි වෙයි. රහත් මහණ තෙමෙ මෝහයෙන් අගතියට යන්නට නො හැකි වෙයි. රහත් මහණ තෙමෙ බියෙන් අගතියට යන්නට නො හැකි වෙයි. ඇවැත්නි, කළ ආස්‍රව ඇති, වැස නිමැවූ මඟබඹසර ඇති, සතර මඟින් කොටැ නිමැවූ කෘත්‍ය ඇති, බහා තුබූ කෙලෙස් බර ඇති, පැමිණි ස්වාර්ථය (රහත් බව) ඇති, සියලු අයුරින් නැසූ භවබන්ධන ඇති, මොනොවට නුවණින් දැනැ මිදුණු යම් රහත් මහණෙක් වේ ද, හෙ තෙමෙ මේ නව තැන් ඉක්මැ හැසිරෙන්නට නො හැකි වේ යැ යි (ඔවුනට) කියැ යුතු."
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "20. චුන්දයෙනි, ‘මහණ ගොයුම් තෙමෙ ඉකුත් කල ඇරැබැ අසීම වූ ඥානදර්ශනය පනවයි, එහෙත් අනා කල ඇරැබැ අසීම වූ ඥානදර්ශනය නො පනවයි, එයි (ඒ අනාගතඥානදර්ශනය නොපැණවීම) කිමෙක් ද? ඒ කවර හෙයින් දැ?’ යි අන්තොටු පිරිවැජියෝ මෙසේ කියන්නාහ’ යන මේ කාරණය ඇත."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 224,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තෙ ච අඤ්ඤතිත්ථියා පරිබ්බාජකා අඤ්ඤවිහිතකෙන ඤාණදස්සනෙන අඤ්ඤවිහිතකං ඤාණදස්සනං පඤ්ඤාපෙතබ්බං මඤ්ඤන්ති, යථරිව බාලා අබ්යත්තා. අතීතං ඛො චුන්ද අද්ධානං ආරබ්භ තථාගතස්ස සතානුසාරි ඤාණං හොති. සො යාවතකං ආකඞ්ඛති තාවතකං අනුස්සරති. අනාගතඤ්ච ඛො අද්ධානං ආරබ්භ තථාගතස්ස බොධිජං ඤාණං උප්පජ්ජති ‘අයමන්තිමා ජාති, නත්ථිදානි පුනබ්භවො’ති. අතීතඤ්චෙපි ඛො චුන්ද හොති අභූතං අතච්ඡං අනත්ථසංහිතං, න තං තථාගතො බ්යාකරොති. අතීතඤ්චෙපි චුන්ද හොති භූතං තච්ඡං අනත්ථසංහිතං, තම්පි තථාගතො න බ්යාකරොති. අතීතඤ්චෙපි චුන්ද හොති භූතං තච්ඡං අත්ථසංහිතං, තත්ර කාලඤ්ඤූ තථාගතො හොති තස්ස පඤ්හස්ස වෙය්යාකරණාය. අනාගතං චෙපි චුන්ද හොති අභූතං අතච්ඡං අනත්ථසංහිතං -පෙ- පච්චුප්පන්නං චෙපි චුන්ද හොති අභූතං අතච්ඡං අනත්ථසංහිතං න තං තථාගතො බ්යාකරොති. පච්චුප්පන්නඤ්චෙපි චුන්ද හොති භූතං තච්ඡං අනත්ථසංහිතං තම්පි තථාගතො න බ්යාකරොති. පච්චුප්පන්නඤ්චෙපි චුන්ද හොති භූතං තච්ඡං අත්ථසංහිතං, තත්ර කාලඤ්ඤූ තථාගතො හොති තස්ස පඤ්හස්ස වෙය්යාකරණාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "21. ඉති ඛො චුන්ද අතීතානාගතපච්චුප්පන්නෙසු ධම්මෙසු තථාගතො කාලාවාදී භූතවාදී අත්ථවාදී ධම්මවාදී විනයවාදී. තස්මා ‘තථාගතො’ති වුච්චති. යඤ්ච ඛො චුන්ද සදෙවකස්ස ලොකස්ස සමාරකස්ස සබ්රහ්මකස්ස සස්සමණබ්රාහ්මණියා පජාය සදෙවමනුස්සාය දිට්ඨං සුතං මුතං විඤ්ඤාතං පත්තං පරියෙසිතං අනුවිචරිතං මනසා, සබ්බං තථාගතෙන අභිසම්බුද්ධං. තස්මා ‘තථාගතො’ති වුච්චති. යඤ්ච චුන්ද රත්තිං තථාගතො අනුත්තරං සම්මාසම්බොධිං අභිසම්බුජ්ඣති, යඤ්ච රත්තිං අනුපාදිසෙසාය නිබ්බානධාතුයා පරිනිබ්බායති, යං එතස්මිං අන්තරෙ භාසති ලපති නිද්දිසති, සබ්බං තං තථෙව හොති නො අඤ්ඤථා. තස්මා ‘තථාගතො’ති වුච්චති. යථාවාදී චුන්ද තථාගතො තථාකාරී, යථාකාරී තථාවාදී. ඉති යථාවාදී තථාකාරී, යථාකාරී තථාවාදී, තස්මා ‘තථාගතො’ති වුච්චති. සදෙවකෙ ලොකෙ චුන්ද සමාරකෙ සබ්රහ්මකෙ සස්සමණබ්රාහ්මණියා පජාය සදෙවමනුස්සාය තථාගතො අභිභූ අනභිභූතො අඤ්ඤදත්ථුදසො වසවත්තී. තස්මා ‘තථාගතො’ති වුච්චති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ඒ අන්තොටු පිරිවැජියෝ වූකලි අව්‍යක්ත අන්ධබාලයන් සේ අනෙකක් ඇරැබැ පැවැති ඥානදර්‍ශනයෙකින් අනෙකක් ඇරැබැ පවත්නා ඥානදර්‍ශනයක් පැනැවියැ යුතු කොට හඟිත්. චුන්දයෙනි, තථාගතයාහට ඉකුත් කල ඇරැබැ සතානුසාරි නුවණ (පෙරවුසූ අත්බව් සිහි කරන) නුවණ වෙයි. හෙ තෙමෙ (එයින්) යම් පමණ කැමැති වේ ද, එපමණ සිහි කෙරෙයි. අනා කල් ඇරැබැ වූ කලි තථාගතයාහට ‘මේ කෙළවරැ ඉපැත්ම ය, දැන් මෙයින් මත්තෙහි භවයෙක් නැතැ’ යි බෝධිජ ඥානය උපදී. චුන්දයෙනි, ඉකුත් කාල පිළිබඳ වුව ද යමෙක් අභූත ද අහත්‍ය ද, අනර්ථ නිඃශ්‍රිත ද එය තථාගත තෙමෙ නො පවසයි. ඉකුත් කල පිළිබඳ වූ ද යමෙක් භූත ද සත්‍ය ද එහෙත් අනර්ථනිඃශ්‍රිත ද, එයත් තථාගත තෙමේ නො පවසයි. ඉකුත්කල පිළිබඳ වූ ද යමෙක් භූත ද, සත්‍ය ද අර්ථ නිඃශ්‍රිත ද, ඒ පැනය විසැඳීමෙහි තථාගත තෙමේ කාලඥ වෙයි. චුන්දයෙනි, අනාකල් පිළිබඳ වූ ද යමෙක් අභූත ද අසත්‍ය ද අනර්ථ නිඃශ්‍රිත ද, … වත්මන් කල පිළිබඳ වූ ද යමෙක් අභූත ද අසත්‍ය ද අනර්ථනිඃශ්‍රිත ද, එය තථාගත තෙමේ නො පවසයි. චුන්දයෙනි, වත්මන් කල පිළිබඳ වූ ද යමෙක් භුත ද සත්‍ය ද එහෙත් අනර්ථනිඃශ්‍රිත ද, එයත් තථාගත තෙමෙ නො පවසයි. වත්මන් කල පිළිබඳ වුව ද යමෙක් භූත ද සත්‍ය ද අර්ථනිඃශ්‍රිත ද, ඒ පැනය විසැඳීමෙහි තථාගත තෙමේ කියැ යුතු කල් දන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "21. චුන්දයෙනි. මෙසේ අතීත අනාගත වර්තමාන ධර්මයන්හි තථාගත තෙමේ කල් දැන කියන සුලු ද, වූ දැයක් ම කියන සුලු ද, වැඩක් ම කියන සුලු ද, දහමක් ම කියන සුලු ද, විනය ම කියන සුලු ද වෙයි, එ හෙයින් තථාගත යැ යි කියනු ලැබේ. චුන්දයෙනි, දෙවියන් සහිත මරුන් සහිත වූ බඹුන් සහිත වූ ලෝවැස්සා විසින්, දෙව් මිනිසුන් සහිත, මහණබමුණන් සහිත සත්වප්‍රජාව විසින් යමෙක් දැක්ක යුතු ද, ඇසිය යුතු ද, යමෙක් යමෙක් ආඝ්‍රාණයත් ආස්වාදනයත් ස්පර්ශනයත් කළ යුතු ද, දන්නා ලද ද, ප්‍රාප්ත ද (ලබන ලද ද), පිරියෙස්නා ලද ද, සිතින් කල්පනා කරන ලද ද, ඒ සියල්ල තථාගතයන් විසින් වෙසෙසින් අවබෝධ කරන ලද්දේ ය. එහෙයින් තථාගත යැ යි කියනු ලැබේ. චුන්දයෙනි, යම් රැයෙක තථාගත තෙමේ නිරුත්තර සම්‍යක්සම්බෝධිය අවබෝධ කෙරෙයි ද, යම් රැයෙක අනුපාදිශේෂ නිර්වාණධාතුයෙන් පිරිනිවෙයි ද, මේ දෑතුරෙහි හෙ තෙමෙ යමක් කියා ද, පවසා ද, දක්වා ද, ඒ සියල්ල ඒ කී පරිදි ම වේ, අන් සැටියෙකින් නො වේ. එහෙයින් ‘තථාගත’ යැ යි කියනු ලැබේ. චුන්දයෙනි, තථාගත තෙමේ යම් සේ කියන සුලු ද, එසේ ම කරන සුලු ය, යම් සේ කරන සුලු ද, එසේ ම කියන සුලු ය. මෙසේ තථාගත තෙමේ යථාවාදී තථාකාරී ද යථාකාරී තථාවාදි ද වේ. එහෙයින් ‘තථාගත’ යැ යි කියනු ලැබේ. චුන්දයෙනි, දෙවියන් සහිත මරුන් සහිත බඹුන් සහිත, ලොව්හි, මහණබමුණන් සහිත දෙව්මිනිසුන් සහිත සත්වප්‍රජායෙහි තථාගත තෙමෙ මෙරමා මැඩලනුයේ ය, මෙරමා විසින නො මැඩලන ලද්දේ ය, සිියල්ල දක්නේ ය, මෙරමා සිය වශයෙහි පවත්වන්නේ ය. එ හෙයින් ‘තථාගත’ යැ යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 226,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "අබ්යාකතට්ඨානානි",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "22. ඨානං ඛො පනෙතං චුන්ද විජ්ජති, යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං “කින්නු ඛො ආවුසො හොති තථාගතො පරම්මරණා? ඉදමෙව සච්චං, මොඝමඤ්ඤන්ති? එවංවාදිනො චුන්ද අඤ්ඤතිත්ථියා පරිබ්බාජකා එවමස්සු වචනීයා “අබ්යාකතං ඛො ආවුසො භගවතා: හොති තථාගතො පරම්මරණා, ඉදමෙව සච්චං මොඝමඤ්ඤන්ති.” ඨානං ඛො පනෙතං චුන්ද විජ්ජති, යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං කිං පනාවුසො න හොති තථාගතො පරම්මරණා. ඉදමෙව සච්චං, මොඝමඤ්ඤන්ති?” එවංවාදිනො චුන්ද අඤ්ඤතිත්ථියා පරිබ්බාජකා එවමස්සු වචනීයා “එතම්පි ඛො ආවුසො භගවතා අබ්යාකතං: න හොති තථාගතො පරම්මරණා, ඉදමෙව සච්චං මොඝමඤ්ඤන්ති’. ඨානං ඛො පනෙතං චුන්ද විජ්ජති, යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං “කිං පනාවුසො හොති ච න හොති ච තථාගතො පරම්මරණා ඉදමෙව සච්චං මොඝමඤ්ඤන්ති.” එවංවාදිනො චුන්ද අඤ්ඤතිත්ථියා පරිබ්බාජකා එවමස්සු වචනීයා: “අබ්යාකතං ඛො පනෙතං ආවුසො භගවතා හොති ච න හොති තථාගතො පරම්මරණා ඉදමෙව සච්චං මොඝමඤ්ඤන්ති”."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඨානං ඛො පනෙතං චුන්ද විජ්ජති යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං ‘කිම්පනාවුසො නෙව හොති න න හොති තථාගතො පරම්මරණා, ඉදමෙව සච්චං මොඝ මඤ්ඤන්ති. එවංවාදිනො චුන්ද අඤ්ඤතිත්ථියා පරිබ්බාජකා එවමස්සු වචනීයා “එවම්පි ඛො ආවුසො භගවතා අබ්යාකතං: නෙව හොති න න හොති තථාගතො පරම්මරණා, ඉදමෙව සච්චං, මොඝමඤ්ඤන්ති”. ඨානං ඛො පනෙතං චුන්ද විජ්ජති යං. අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං: “කස්මා පනෙතං ආවුසො සමණෙන ගොතමෙන අබ්යාකතන්ති?” එවං වාදිනො චුන්ද අඤ්ඤතිත්ථියා පරිබ්බාජකා එවමස්සු වචනීයා: “නහෙතං ආවුසො අත්ථසංහිතං න ධම්මසංහිතං න ආදිබ්රහ්මචරියකං න නිබ්බිදාය න විරාගාය න නිරොධාය න උපසමාය න අභිඤ්ඤාය න සම්බොධාය න නිබ්බානාය සංවත්තති. තස්මා තං භගවතා අබ්යාකතන්ති.”"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "22. චුන්දයෙනි, “ඇවැත්නි, කිමෙක් ද? තථාගත තෙමේ මරණින් මත්තෙහි වන්නේ ද? මෙය ම සත්‍යත් අන් සියල්ල මොඝත් (අසාරත්) වේ දැ? යි අන්තොටු පිරිවැජියෝ කියන්නාහුය” යන මේ කරුණ ඇත. චුන්දයෙනි, මෙසේ කියන අන්තොටු පිරිවැජ්ජෝ “ඇවැත්නි, තථාගත තෙමේ මරණින් මත්තෙහි වන්නේ ද? මෙය ම සත්‍යත් අන් සියල්ල මොඝත් වේ දැ? යි භගවත්හු විසින් මෙය නො කියන ලදැ” යි මෙසේ කියැ යුතු හ. “ඇවැත්නි, කිමෙක් ද? තථාගත තෙමේ මරණින් මත්තෙහි නො වන්නේ ද? මෙය ම සත්‍ය ද? සෙස්ස හිස් දැ?’ යි අන්තොටු පිරිවැජ්ජෝ මෙසේ කියන්නාහ” යන මේ කාරණය ඇත. එසේ කියන අන්තොටු පිරිවැජ්ජෝ, ඇවැත්නි, තථාගත තෙමේ මරණින් මත්තෙහි නො වන්නේ ය, මෙය ම සත්‍ය ය, සෙස්ස හිස යැ’ යි මෙසේත් භගවත්හු විසින් නො කියන ලදැ’යි මෙසේ කිය යුතු වන්නාහ."
                    },
                    {
                        "format": 13,
                        "text": "“කිමෙක් ද? ඇවැත්නි තථාගත තෙමේ මරණින් මත්තෙහි වන්නේත් නොවන්නේත් වේ ද? මෙය ම සත්‍ය ද? සෙස්ස හිස් දැ?’ යි අන්තොටු පිරිවැජ්ජෝ මෙසේ අසන්නාහුය” යන මේ කාරණය ඇත. චුන්දයෙනි, මෙසේ කියන අන්තොටු පිරිවැජ්ජෝ, ඇවැත්නි, තථාගත තෙමේ මරණින් මත්තෙහි වන්නේත් වේ නොවන්නේත් වේ යැ යි භගවත්හු විසින් නො කියන ලදැ”යි මෙසේ කියැ යුතු වන්නාහ. චුන්දයෙනි, “ඇවැත්නි, කිමෙක් ද? තථාගත තෙමේ මරණින් මත්තෙහි නො ම වන්නේත් නො ම නොවන්නේත් වේ ද? මෙය ම සත්‍ය ද? සෙස්ද හිස් දැ?’ යි අන්තොටු පිරිවැජියෝ මෙසේ කියන්නාහ” යන මේ කාරණය වනාහි ඇත. චුන්දයෙනි, මෙසේ කියත් අන්තොටු පිරිවැජ්ජෝ, ‘ඇවැත්නි, තථාගත තෙමේ මරණින් මත්තෙහි නො ම වන්නේත් නො ම නොවන්නේත් වේ යැ යි මෙය ම සත්‍ය ය, සෙස්ස හිස් යැ යි මෙසේ ද භගවත්හු විසින් නො පවසන ලදැ” යි මෙසේ කියැ යුතු වන්නාහ. චුන්දයෙනි, “ඇවැත්නි, මහණ ගොයුම්හු විසින් මෙය කවර හෙයින් අප්‍රකාශිත දැ’ යි අන්තොටු පිරිවැජ්ජෝ මෙසේ කියන්නාහ” යන මේ කාරණය ඇත. චුන්දයෙනි, මෙසේ කියන අන්තොටු පිරිවැජියෝ, “ඇවැත්නි, මෙය අර්ථනිඃශ්‍රිත ද නො වේ, ධර්මනිඃශ්‍රිත ද නො වේ. මාර්ගබ්‍රහ්මචර්යාවට මුල් ද නොවේ. සසරැ කලකිරෙනු පිණිස, නො පවතී, විරාගය පිණිස නො පවතී, නිරෝධය පිණිස නො පවතී, ක්ලේශෝපශමය පිණිස නො පවතී, විශිෂ්ට ඥානය පිණිස නො පවතී, සම්බෝධිය පිණිස නො පවතී නිර්වාණය පිණිස නො පවතී. එ හෙයින් එය භගවත්හු විසින් නො පවසන ලදැ” යි මෙසේ කියැ යුතු වන්නාහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 228,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "බ්යාකතට්ඨානානි",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "23. ඨානං ඛො පනෙතං චුන්ද විජ්ජති යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං “කිං පනාවුසො සමණෙන ගොතමෙන බ්යාකතන්ති?” එවං වාදිනො චුන්ද අඤ්ඤතිත්ථියා පරිබ්බාජකා එවමස්සු වචනීයා: “ඉදං දුක්ඛන්ති ඛො ආවුසො භගවතා බ්යාකතං. අයං දුක්ඛසමුදයො’ති ඛො ආවුසො භගවතා බ්යාකතං, අයං දුක්ඛනිරොධො’ති ඛො ආවුසො භගවතා බ්යාකතං, අයං දුක්ඛනිරොධගාමිනී පටිපදා’ති ඛො ආවුසො භගවතා බ්යාකතන්ති”."
                    },
                    {
                        "type": "paragraph",
                        "text": "24. ඨානං ඛො පනෙතං චුන්ද විජ්ජති යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං “කස්මා පනෙතං ආවුසො සමණෙන ගොතමෙන බ්යාකතන්ති? එවං වාදිනො චුන්ද අඤ්ඤතිත්ථියා පරිබ්බාජකා එවමස්සු වචනීයා: “එතඤ්හි ආවුසො අත්ථසංහිතං, එතං ධම්මසංහිතං, එතං ආදිබ්රහ්මචරියකං, එකන්තනිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තති. තස්මා තං භගවතා බ්යාකතන්ති.”"
                    },
                    {
                        "type": "centered",
                        "text": "පුබ්බන්තසහගතා දිට්ඨිනිස්සයා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "යෙ පි තෙ චුන්ද පුබ්බන්තසහගතා දිට්ඨිනිස්සයා, තෙපි වො මයා බ්යාකතා යථා තෙ බ්යාකාතබ්බා. යථා ච තෙ න බ්යාකාතබ්බා කිං වො අහං තෙ තත්ථ බ්යාකරිස්සාමි? යෙ පි තෙ චුන්ද අපරන්තසහගතා දිට්ඨිනිස්සයා, තෙපි වො මයා බ්යාකතා, යථා තෙ බ්යාකාතබ්බා. යථා ච තෙ න බ්යාකාතබ්බා කිං වො අහං තෙ තත්ථ බ්යාකරිස්සාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "25. කතමෙ ච තෙ චුන්ද පුබ්බන්තසහගතා දිට්ඨිනිස්සයා යෙ වො මයා බ්යාකතා යථා තෙ බ්යාකාතබ්බා? සන්ති ඛො චුන්ද එකෙ සමණබ්රාහ්මණා එවංවාදිනො එවංදිට්ඨිනො: ‘සස්සතො අත්තා ච ලොකො ච’ ඉදමෙව සච්චං මොඝමඤ්ඤන්ති. සන්ති පන චුන්ද එකෙ සමණබ්රාහ්මණා එවං වාදිනො එවං දිට්ඨිනො: ‘අසස්සතො අත්තා ච ලොකො ච, සස්සතො ච අසස්සතො ච අත්තා ච ලොකො ච, නෙව සස්සතො නාසස්සතො අත්තා ච ලොකො ච, සයංකතො අත්තා ච ලොකො ච, පරකතො අත්තා ච ලොකො ච, සයං කතො ච පර කතො ච අත්තා ච ලොකො ච, අසයංකාරො අපරකාරො අධිච්චසමුප්පන්නො අත්තා ච ලොකො ච, ඉදමෙව සච්චං මොඝමඤ්ඤන්ති. සස්සතං සුඛදුක්ඛං, අසස්සතං සුඛදුක්ඛං, සස්සතඤ්ච අසස්සතඤ්ච සුඛදුක්ඛං, නෙව සස්සතං නාසස්සතං සුඛදුක්ඛං, සයංකතං සුඛදුක්ඛං, පරංකතං සුඛදුක්ඛං, සයං කතඤ්ච පරං කතඤ්ච සුඛදුක්ඛං, අසයංකාරං අපරංකාරං අධිච්චසමුප්පන්නං සුඛදුක්ඛං. ඉදමෙව සච්චං මොඝමඤ්ඤන්ති”."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "23. චුන්දයෙනි, “ඇවැත්නි, මහණ ගොයුම්හු විසින් කිමෙක් නම් පවසන ලද දැ?’ යි අන්තොටු පිරිවැජියෝ මෙසේ අසන්නාහ” යන මේ කාරණය වනාහි ඇත. චුන්දයෙනි, මෙසේ කියන අන්තොටු පිරිවැජියෝ “ඇවැත්නි, මේ දුකැ යි ම භගවත්හු විසින් පවසන ලදි, මේ දුක් උපදනා හේතුව යැ යි ම භගවත්හු විසින් පවසන ලදී. මේ දුක් වැනැස්ම යැ යි ම භගවත්හු විසින් පවසන ලදි. මේ දුක් වැනැස්මට යන පිළිවෙතැ යි ම භගවත්හු විසින් පවසන ලදැ” යි මෙසේ කියැ යුතු වන්නාහ."
                    },
                    {
                        "format": 13,
                        "text": "24. චුන්දයෙනි, “ඇවැත්නි, කවර හෙයින් මෙය මහණ ගොයුම්හු විසින් පවසන ලද දැ?’යි අන්තොටු පිරිවැජියෝ මෙසේ පුළුවුස්නාහ” යන මෙ කරුණ ඇත. චුන්දයෙනි, එසේ පුළුවුස්නා අන්තොටු පිරිවැජියෝ මෙසේ කියැ යුතු: “ඇවැත්නි, මෙය අර්ථනිඃශ්‍රිත ය, මෙය ධර්මනිඃශ්‍රිත ය, මෙය මාර්ගබ්‍රහ්මචර්යාවට මුල ය. මෙය ඒකාන්තයෙන් සසරැ කලකිරෙනු පිණිස පවතී, විරාගය පිණිස නිරෝධය පිණිස ක්ලේශෝපශමය පිණිස විශිෂ්ට ඥානය පිණිස, සම්බෝධිය පිණිස, නිවන පිණිස පවතී. එහෙයින් එය භගවත්හු විසින් පවසන ලදැ’ යි (කියැ යුතු.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "චුන්දයෙනි, පූර්වාන්තය (පෙරැ පැවැති ස්කන්ධ කොටස) පිළිබඳ වූ යම් දෘෂ්ටි කෙනෙක් ඇද්ද, ඔහු ද ඔවුන් පැවැසියැ යුතු පරිදි මා විසින් ප්‍රකාශිත හ. ඔහු යම්සේ නො පැවැසියැ යුතු නම් කිම? මම් එහි තොපට එය පවසන්නෙම් ද? චුන්දයෙනි, අපරාන්තසහගත (මතු ස්කන්ධ කොටස පිළිබඳ වූ) යම් දෘෂ්ටි කෙනෙක් ඇද්ද, ඔවුන් හෙළි කළ යුතු පරිද්දෙන් ඔහු ද මා විසින් ප්‍රකාශිත හ. යම් හැටියෙකින් ඔහු හෙළි නො කළ යුතු නම්, කිම? එහි මම් ඔවුන් තොපට හෙළි කරන්නෙම් ද?"
                    },
                    {
                        "format": 13,
                        "text": "25. චුන්දයෙනි, පැවැසියැ යුතු පරිද්දෙන් මා විසින් තොපට හෙළි කරන ලද පූර්වාන්ත සහගත දෘෂ්ටීහු කවුරු ද? යත්: චුන්දයෙනි, ‘ආත්මයත් ලෝකයත් ශාශ්වත යැ’යි මෙය ම සත්‍ය ය, සෙස්ස හිස් යැ’ යි මෙසේ වාද ඇති, මෙසේ වූ දෘෂ්ටි ඇති ඇතැම් මහණ බමුණු කෙනෙක් ඇත. චුන්දයෙනි, ‘ආත්මයත් ලෝකයත් අශාශ්වත යැ යි ද, ආත්මයත් ලෝකයත් ශාශ්වතත් අශාශ්වතත් වේ යැ යි ද, ආත්මයත් ලෝකයත් ශාශ්වතත් නො ම වේ අශාශ්වතත් නො ම වේ යැ යි ද, ආත්මයත් ලෝකයත් ස්වයංකෘත ය යි ද, ආත්මයත් ලෝකයත් පරකෘත යැ යි ද, ආත්මයත් ලෝකයත් ස්වයංකෘතත් පරකෘතත් වේයැ යි ද, ආත්මයත් ලෝකයත් ස්වයාකාර ද පරකාර ද නො වේ, යදෘච්ඡාසමුත්පන්න යැ යි ද, මෙය ම සත්‍ය යැ යි, සෙස්ස හිස් යැ’ යි මෙසේ වාද ඇති, මෙසේ වූ දෘෂ්ටි ඇති ඇතැම් මහණ බමුණු කෙනෙක් ඇත.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 230,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "26. තත්ර චුන්ද යෙ තෙ සමණබ්රාහ්මණා එවංවාදිනො එවංදිට්ඨිනො සස්සතො අත්තා ච ලොකො ච, ඉදමෙව සච්චං මොඝමඤ්ඤන්ති. ත්යාහං උපසඞ්කමිත්වා එවං වදාමි: අත්ථිනු ඛො ඉදං, ආවුසො, වුච්චති සස්සතො අත්තා ච ලොකො චා?”ති යඤ්ච ඛො තෙ එවමාහංසු ‘ඉදමෙව සච්චං, මොඝමඤ්ඤන්ති, තං තෙසං නානුජානාමි. තං කිස්ස හෙතු? අඤ්ඤථාසඤ්ඤිනො පි හෙත්ථ චුන්ද සන්තෙකෙ සත්තා. ඉමාය පි ඛො අහං චුන්ද පඤ්ඤත්තියා නෙව අත්තනා සමසමං සමනුපස්සාමි කුතො භිය්යො. අථ ඛො අහමෙව තත්ථ භිය්යො යදිදං අධිපඤ්ඤත්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "27. තත්ර චුන්ද යෙ තෙ සමණබ්රාහ්මණා එවංවාදිනො එවංදිට්ඨිනො “සස්සතො අත්තා ච ලොකො ච, අසස්සතො අත්තා ච ලොකො ච, සස්සතො ච අසස්සතො ච අත්තා ච ලොකො ච, නෙව සස්සතො නාසස්සතො අත්තා ච ලොකො ච, සයං කතො අත්තා ච ලොකො ච, පරංකතො අත්තා ච ලොකො ච, සයං කතො ච පරකතො ච අත්තා ච ලොකො ච, අසයංකාරො අපරකාරො අධිච්චසමුප්පන්නො අත්තා ච ලොකො ච, සස්සතං සුඛදුක්ඛං; අසස්සතං සුඛදුක්ඛං, සස්සතඤ්ච අසස්සතඤ්ච සුඛදුක්ඛං, නෙව සස්සතං නාසස්සතං සුඛදුක්ඛං, සයංකතං සුඛදුක්ඛං, පරකතං සුඛදුක්ඛං, සයං කතංච පරකතං ච සුඛදුක්ඛං අසයංකාරං අපරකාරං අධිච්චසමුප්පන්නං සුඛදුක්ඛං ඉදමෙව සච්චං මොඝමඤ්ඤන්ති”. ත්යාහං උපසඞ්කමිත්වා එවං වදාමි “අත්ථි ඛො ඉදං ආවුසො වුච්චති අසයංකාරං අපරකාරං අධිච්චසමුප්පන්නං සුඛදුක්ඛන්ති?” යඤ්ච ඛො තෙ එවමාහංසු ඉදමෙව සච්චං, මොඝමඤ්ඤන්ති’. තං තෙසං නානුජානාමි, තං කිස්ස හෙතු? අඤ්ඤථාසඤ්ඤිනො පි හෙත්ථ චුන්ද සන්තෙකෙ සත්තා. ඉමාය පි ඛො අහං චුන්ද පඤ්ඤත්තියා නෙව අත්තනා සමසමං සමනුපස්සාමි කුතො භිය්යො. අථ ඛො අහමෙව තත්ථ භිය්යො යදිදං අධිපඤ්ඤත්ති. ඉමෙ ඛො තෙ චුන්ද පුබ්බන්තසහගතා දිට්ඨිනිස්සයා, යෙ තෙ මයා බ්යාකතා යථා තෙ බ්යාකාතබ්බා යථා ච තෙ න බ්යාකාතබ්බා, කිං වො අහං තෙ තත්ථ බ්යාකරිස්සාමී?”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "26. සුව දුක් ශාශ්වත ය, සුවදුක් අශාශ්වත ය, සුවදුක් ශාශ්වත ද අශාශ්වත ද වේ, සුවදුක් ශාශ්වත ද නො ම වේ. ආශාශ්වත ද නො ම වේ, සුවදුක් ස්වයංකෘත ය, සුවදුක් පරකෘත ය, සුව දුක් ස්වයංකෘත ද පරකෘත ද වේ. සුවදුක් ස්වයංකාර ද නො වේ, පරකාර ද නො වේ, යදෘච්ඡාසමුත්පන්න ය, මෙය ම සත්‍ය ය, සෙස්ස හිස් යැ යි මෙසේ වූ වාද ඇති, මෙසේ වූ දෘෂ්ටි ඇති ඇතැම් මහණ බමුණූ කෙනෙක් ඇත. චුන්දයෙනි, එහි ‘ආත්මයත් ලෝකයත් ශාශ්වත යැ’ යි ‘මෙය ම සත්‍ය යැ සෙස්ස හිස් යැ’ යි මෙසේ වාද ඇති, මෙසේ දෘෂ්ටි ඇති යම් මහණ කෙනෙක් බමුණුකෙනෙක් ඇද්ද, මම් ඔවුන් කරා එළැඹ, ‘ඇවැත්නි, ආත්මයත් ලෝකයත් ශාශ්වත යැ යි කියනු ලැබේ යන මෙය ඇත්ත දැ?’ යි මෙසේ විචාරමි. ඔහු ‘මෙය ම සත්‍ය ය සෙස්ස හිස් යැ’ යි මෙසේ යම් වචනයක් කියත් ද, ඔවුන්ගේ ඒ වචනය නො අනුදනිමි. ඒ කවර හෙයින්ද? චුන්දයෙනි, මෙහි අන් සැටියෙකින් හඟිනා ඇතැම් සත්ව කෙනෙක් ඇත. චුන්දයෙනි, මේ දෘෂ්ටි ප්‍රඥප්තියෙන් ද තමාහට සමසමයක් හු නො ම දකිමි. තමාට වැඩි තරම් එකකු කොයින් දකිම් ද? වැලිදු අධිප්‍රඥප්ති (විශේෂ පැනවීම) යන යමෙක් ඇද්ද, එහි මම ම වැඩිතරම් වෙමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "27. චුන්දයෙනි, එහි ‘ආත්මයත් ලෝකයත් ශාශ්වත යැ’ යි ‘ආත්මයත් ලෝකයත් අශාශ්වත යැ’ යි ‘ආත්මයත් ලෝකයත් ශාශ්වතත් අශාශ්වතත් වේ’ යැ යි ‘ආත්මයත් ලෝකයත් ශාශ්වත ද නො ම වේ, අශාශ්වත ද නො ම වේ’ යැ යි, ‘ආත්මයත් ලෝකයත් ස්වයංකෘත යැ’ යි ‘ආත්මයත් ලෝකයත් පරකෘත යැ’ යි ‘ආත්මයත් ලෝකයත් ස්වයංකෘත ද පරකෘත ද වේ යැ’ යි ‘ආත්මයත් ලෝකයත් ස්වයංකාර ද නො වේ, පරකාර ද නොවේ යදෘච්ඡාසමුත්පන්න යැ’ යි, ‘සුඛදුඃඛ දෙක ශාශ්වත යැ’ යි ‘සුඛ දුඃඛ දෙක අශාශ්වත යැ’ යි, ‘සුඛ දුඃඛ දෙක ශාශ්වතත් අශාශ්වතත් වේ යැ’ යි ‘සුඛ දුඃඛ දෙක ශාශ්වතත් නො ම වේ අශාශ්වතත් නො ම වේ යැ’ යි, ‘සුඛදුඃඛ දෙක ස්වයංකෘත යැ’ යි, ‘සුඛ දුඃඛ දෙක පරකෘත යැ’ යි, ‘සුඛ දුඃඛ දෙක ස්වයංකෘත ද පරකෘත ද වේ යැ’ යි ‘සුඛ දුඃඛ දෙක ස්වයංකාර ද පරකාර ද නො ව යදෘච්ඡාසමුත්පන්න යැ, ‘මෙය ම් සත්‍ය ය සෙස්සහිස් යැ’ යි, මසේ වූ වාද ඇති මේ බඳු වූ දෘෂ්ටි ඇති යම් මහණ කෙනෙක් බමුණු කෙනෙක් ඇද්ද, මම ඔවුන් කරා එළැඹ, ‘ඇවැත්නි, සුඛ දුඃඛ ස්වයංකාර ද පරකාර ද නොව යදෘච්ඡාසමුත්පන්න යැ යි කියනු ලැබේ’ යන මෙය ඇත්ත දැ? යි විචාරමි. ඔහු ‘මෙය ම සත්‍ය ය, සෙස්ස හිස් යැ’ යි යම් වචනයක් කියත් ද, ඔවුන්ගේ ඒ වචනය නො අනුදනිමි. ඒ කවර හෙයින? යත්: චුන්දයෙනි, මෙහි අන් සැටියෙකින් හඟිනා ඇතැම් සත්ව කෙනෙක් ඇත. චුන්දයෙනි, මේ දෘෂ්ටිප්‍රඥප්තියෙන් ද තමාහට සමසමයක්හු නො ම දකිමි. තමාහට වැඩිතරම් එකකු කොයින් දකිම් ද? වැලි දු අධිප්‍රඥප්ති යන යමෙක් ඇද්ද, එහි මම ම වැඩිතරම් වෙමි. චුන්දයෙනි, මොහු පැවැසියැ යුතු පරිදි මා විසින් පවසන ලද පූර්‍වාන්තය පිළිබඳ වූ දෘෂ්ටීහු ය. යම්සේ ඔහු නො පැවැසියැ යුතු නම්, කිම? එහි මම් තොපට ඒ පවසන්නෙම් ද?",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 232,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "අපරන්තසහගතා දිට්ඨිනිස්සයා",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "28. කතමෙ ච චුන්ද අපරන්තසහගතා දිට්ඨිනිස්සයා යෙ තෙ මයා බ්යාකතා යථා තෙ බ්යාකාතබ්බා? යථා ච තෙ න බ්යාකාතබ්බා කිං වො අහං තෙ තත්ථ බ්යාකරිස්සාමී?”ති. සන්ති චුන්ද එකෙ සමණබ්රාහ්මණා එවංවාදිනො එවංදිට්ඨිනො: “රූපී අත්තා හොති අරොගො පරම්මරණා, ඉදමෙව සච්චං, මොඝමඤ්ඤන්ති.” සන්ති පන චුන්ද එකෙ සමණබ්රාහ්මණා එවංවාදිනො එවංදිට්ඨිනො “නාරූපී අත්තා හොති -පෙ- රූපී ච අරූපී ච අත්තා හොති -පෙ- නෙව රූපී නාරූපී අත්තා හොති -පෙ- සඤ්ඤී අත්තා හොති -පෙ- අසඤ්ඤී අත්තා හොති, -පෙ- නෙවසඤ්ඤීනාසඤ්ඤී අත්තා හොති, -පෙ- අත්තා උච්ඡිජ්ජති විනස්සති, න හොති පරම්මරණා, ඉදමෙව සච්චං, මොඝමඤ්ඤන්ති.” තත්ර චුන්ද යෙ තෙ සමණබ්රාහ්මණා එවංවාදිනො එවංදිට්ඨිනො, රූපී අත්තා හොති අරොගො පරම්මරණා, ඉදමෙව සච්චං, මොඝමඤ්ඤන්ති. ත්යාහං උපසඞ්කමිත්වා එවං වදාමි: අත්ථි ඛො ඉදං ආවුසො, වුච්චති “රූපී අත්තා හොති අරොගො පරම්මරණා?”ති. යං ඛො තෙ එවමාහංසු “ඉදමෙව සච්චං, මොඝමඤ්ඤන්ති” තං තෙසං නානුජානාමි. තං කිස්ස හෙතු? අඤ්ඤථාසඤ්ඤිනො පි හෙත්ථ චුන්ද සන්තෙකෙ සත්තා. ඉමායපි ඛො අහං චුන්ද පඤ්ඤත්තියා නෙව අත්තනා සමසමං සමනුපස්සාමි කුතො භිය්යො. අථ ඛො අහමෙව තත්ථ භිය්යො යදිදං අධිපඤ්ඤත්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "29. තත්ර චුන්ද යෙ තෙ සමණබ්රාහ්මණා එවංවාදිනො එවංදිට්ඨිනො අරූපී අත්තා හොති -පෙ- රූපී ච අරූපී ච අත්තා හොති -පෙ- නෙව රූපී නාරූපී අත්තා හොති -පෙ- සඤ්ඤී අත්තා හොති -පෙ- අසඤ්ඤී අත්තා හොති -පෙ- නෙවසඤ්ඤීනාසඤ්ඤී අත්තා හොති -පෙ- අත්තා උච්ඡිජ්ජති විනස්සති, න හොති පරම්මරණා, ඉදමෙව සච්චං, මොඝමඤ්ඤන්ති.” ත්යාහං උපසඞ්කමිත්වා එවං වදාමි: අත්ථි ඛො ඉදං ආවුසො, වුච්චති “අත්තා උච්ඡිජ්ජති විනස්සති, න හොති පරම්මරණා ති?” මඤ්ච ඛො තෙ චුන්ද එවමාහංසු. ඉදමෙව සච්චං, මොඝමඤ්ඤන්ති, තං තෙසං නානුජානාමි. තං කිස්ස හෙතු? අඤ්ඤථාසඤ්ඤිනොපි හෙත්ථ චුන්ද සන්තෙ’කෙ සත්තා. ඉමායපි ඛො අහං චුන්ද පඤ්ඤත්තියා නෙව අත්තනා සමසමං සමනුපස්සාමි කුතො භිය්යො? අථ ඛො අහමෙව තත්ථ භිය්යො යදිදං අධිපඤ්ඤත්ති. ඉමෙ ඛො තෙ චුන්ද අපරන්තසහගතා දිට්ඨිනිස්සයා, යෙ තෙ මයා බ්යාකතා යථා තෙ බ්යාකාතබ්බා. යථා ච තෙ න බ්යාකාතබ්බා, කිං වො අහං තෙ තත්ථ බ්යාකරිස්සාමී”ති"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "28. චුන්දයෙනි, යම්සේ හෙළි කළ යුතු නො වෙත් නම්, ‘එහි මම් කුමට එය පවසන්නෙම් දැ?’ යි කියැ යුතු වූ, හෙළි කළ යුතු පරිදි මා විසින් හෙළි කරන ලද්දාවූ අපරාන්ත සහගත (අනාගත ස්කන්ධ කොටස පිළිබඳ වූ) දෘෂ්ටීහු කවරහ? යත්: චුන්දයෙනි, ‘ආත්මය රූපවත් ය, මරණින් මතු අරෝග යැ. මෙය ම සත්‍ය ය, සෙස්ස හිස් යැ’ යි මෙසේ කියන, මෙබඳු දෘෂ්ටි ඇති ඇතැම් මහණ බමුණු කෙනෙක් ඇත. ‘ආත්මය රූපරහිත ය … ආත්මය රූපවත් ද අරූපවත් ද වෙයි … ආත්මය රූපවත් ද නොම වෙයි, අරූපවත් ද නො ම වෙයි … ආත්මය සංඥාවත් වෙයි … ආත්මය සංඥා නැත්තේ වේ … ආත්මය සංඥා ඇත්තේ ද වේ ... සංඥාව නැත්තේ ද වේ … ආත්මය මරණින් පසු මුල් සුන් වෙයි, වැනැසෙයි, මරණින් මත්තෙහි නො වෙයි, මෙය ම සත්‍ය ය, සෙස්ස හිස් යැ’ යි මෙසේ කියන, මෙබඳු දෘෂ්ටි ඇතැම් මහණ බමුණු කෙනෙක් ඇත. චුන්දයෙනි, එහි යම් මහණ බමුණු කෙනෙක් ආත්මය රූපවත්ය, මරණින් මත්තෙහි අරෝග යැ, මෙය ම සත්‍ය ය, සෙස්ස හිස් යැ’ යි කියත් ද, මම් ඔවුන් කරා එළැඹ, ‘ඇවැත්නි, ආත්මය රූපවත් ය. මරණින් මතු අරෝග යැ’ යි තොප විසින් යම් වචනයෙක් කියනු ලැබේ ද, එය ඇත්තේ දැ? (එය හුදු වචනමාත්‍රයක් නො ව තොපගේ දෘෂ්ටි දැ?’) යි විචාරමි. ‘මෙය ම සත්‍ය යැ, සෙස්ස හිස් යැ’ යි යමක් මෙසේ ඔහු කියත් ද, ඔවුන්ගේ ඒ වචනය නො අනුදනිමි. ඒ කවර හෙයින? චුන්දයෙනි, මෙහි මෙයට වෙනස් සංඥා ඇති එක්තරා සත්ව කෙනෙක් ඇත්හ. චුන්දයෙනි, මේ දෘෂ්ටිප්‍රඥප්තියෙන් ද තමාට සමසම එකක්හු නො දකිමි, වැඩි තරම් එකකු කොයින් දකිම් ද? වැලි දු යම් අධිප්‍රඥප්තියෙක් වේ ද එයින් මම ම එහි වැඩි තරම් වෙමි."
                    },
                    {
                        "format": 13,
                        "text": "29. චුන්දයෙනි, එහි යම් මහණ බමුණු කෙනෙක් ‘ආත්මය රූප රහිත වෙයි … ආත්මය රූපවත් ද රූපරහිත ද වෙයි … ආත්මය රූපවත් ද නො ම වෙයි, රූපරහිත ද නොම වෙයි … ආත්මය සංඥා ඇත්තේ වෙයි … ආත්මය සංඥා නැත්තේ වෙයි ... ආත්මය සංඥීත් (සංඥාව ඇත්තේත්) නො ම වෙයි, අසංඥීත් නො ම වෙයි … ආත්මය මුල්සුන් වෙයි, වැනැසෙයි මරණින් මතු නො වෙයි. මෙය ම සත්‍ය ය, සෙස්ස හිස් යැ’ යි මෙසේ කියත් ද, මම් ඔවුන් කරා එළැඹ, “ඇවැත්නි. ආත්මය උච්ඡින්න වේ, වැනසේ, මරණින් මතු නො වේ, මෙය ම සත්‍යය ය, සෙස්ස හිස්යැ’ යි යමක් කියනු ලැබේ ද එය (ඒ දෘෂ්ටිය) ඔබට ඇත්දැයි?” යි මෙසේ විචාරමි. ‘මෙය ම සත්‍ය ය, සෙස්ස හිස්යැ’ යි මෙසේ යමක් ම ඔහු කියත් ද, ඔවුන්ගේ ඒ වචනය නො අනුදනිමි, ඒ කවර හෙයින? යත්: චුන්දයෙනි, මෙහි ඇතැම් සත්ව කෙනෙක් වෙනස් සංඥා ඇත්තාහු ද වෙත්. (එහෙයිනි.) චුන්දයෙනි, මේ දෘෂ්ටිප්‍රඥප්තියෙන් ද තමා හා සමසමයකු මම් නො ම දකිමි. තමාට වැඩිතරම් එකක්හු කොයින් දකිම් ද? වැලි දු යම් අධිප්‍රඥප්තියෙක් වේ ද එහි මම ම වැඩිතරම් වෙමි. චුන්දයෙනි, හෙළි කළ යුතු පරිද්දෙන් මා විසින් හෙළි කරන ලද, යම්සේ නොපැවැසියයුතු නම් ‘කුමට එය තොපට පවසන්නෙම් දැ’ යි මා විසින් නො පවසන ලද, අපරාන්තසහගත වූ දෘෂ්ටීහු මොහු ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 234,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "30. ඉමෙසං ච චුන්ද පුබ්බන්තසහගතානං දිට්ඨිනිස්සයානං ඉමෙසං ච අපරන්තසහගතානං දිට්ඨිනිස්සයානං පහානාය සමතික්කමාය එවං මයා චත්තාරො සතිපට්ඨානා දෙසිතා පඤ්ඤත්තා. කතමෙ චත්තාරො? ඉධ චුන්ද භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣා දොමනස්සං. වෙදනාසු -පෙ- චිත්තෙසු -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙසං ච චුන්ද පුබ්බන්තසහගතානං දිට්ඨිනිස්සයානං ඉමෙසං ච අපරන්තසහගතානං දිට්ඨිනිස්සයානං පහානාය සමතික්කමාය. එවං මයා ඉමෙ චත්තාරො සතිපට්ඨානා දෙසිතා පඤ්ඤත්තා ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "31. තෙන ඛො පන සමයෙන ආයස්මා උපවාණො භගවතො පිට්ඨිතො හොති භගවන්තං විජයමානො. අථ ඛො ආයස්මා උපවාණො භගවන්තං එතදවොච: අච්ඡරියං භන්තෙ අබ්භුතං භන්තෙ, පාසාදිකො වතායං භන්තෙ ධම්මපරියා යො, සුපාසාදිකො වතායං භන්තෙ ධම්මපරියායො. කො නාමායං භන්තෙ ධම්මපරියායො?”ති. “තස්මා තිහ ත්වං උපවාණ ඉමං ධම්මපරියායං පාසාදිකොත්වෙව නං ධාරෙහී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදමවොච භගවා අත්තමනො ආයස්මා උපවාණො භගවතො භාසිතං අභිනන්දීති."
                    },
                    {
                        "type": "centered",
                        "text": "පාසාදිකසුත්තං නිට්ඨිතං ඡට්ඨං.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "30. චුන්දයෙනි, මේ පූර්‍වාන්ත සහගත දෘෂ්ටීන්ගේ ද මේ අපරාන්ත සහගත දෘෂ්ටීන්ගේ ද ප්‍රහාණය පිණිස ඉක්මීම පිණිස, මා විසින් මෙසේ සතර සතිපට්ඨානයෝ දෙසන ලදහ, පනවන ලදහ. කවර සතරෙක් ද? යත්: චුන්දයෙනි, මෙහි මහණ තෙම කෙලෙස් තවන වැර ඇත්තේ, නුවණින් දන්නේ, සිහි ඇත්තේ, ලොවැ අභිධ්‍යාව හා දොම්නස හා දුරු කොට, කයෙහි කායානුපස්සී වැ වෙසෙයි. වේදනාවන්හි … චිත්තයන්හි … කෙලෙස් තවන වැර ඇත්තේ, නුවණින් දන්නේ, සිහි ඇත්තේ, ලොවැ අභිධ්‍යාව හා දොම්නස හා දුරු කොට, ධර්‍මයන්හි ධම්මානුපස්සී වැ වෙසෙයි. චුන්දයෙනි, මේ පූර්‍වාන්තසහගත දෘෂ්ටීන්ගේ ද මේ අපරාන්ත සහගත දෘෂ්ටීන්ගේ ද ප්‍රහාණය පිණිස, ඉක්මීම පිණිස, මෙසේ මා විසින් සතර සතිපට්ඨානයෝ දෙසන ලද හ, පනවන ලදහ.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "31. එ සමයෙහි උපවාණ තෙරණුවෝ භාග්‍යවතුන්වහන්සේට පවන් සලනුවෝ ඔබ පිටුපසින් සිටියාහු වෙත්. එ කලැ උපවාණ තෙරණුවෝ ‘වහන්ස, ආශ්වර්‍ය්‍ය ය, වහන්ස, අද්භූත ය, වහන්ස, මේ ධර්‍මපර්‍ය්‍යායය ඒකාන්තයෙන් ප්‍රසාද එළවන සුලු ය, වහන්ස, මේ ධර්‍ම පර්‍ය්‍යායය කිනම් දැ? යි ඇසූහ. ‘උපවාණයෙනි, එහෙයින් මෙහි මේ ධර්‍ම පර්යාය ‘පාසාදිකයැ’ යි කියා ම සලකවු යැ’ යි වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළසේක. ආයුෂ්මත් උපවාණ තෙරණුවෝ සතුටු සිතැත්තාහු භාග්‍යවතුන් වහන්සේගේ වචනය සතුටින් පිළිගත්හ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 16,
                        "text": "සවැනි පාසාදික සූත්‍රය නිමියේ යැ.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ]
}