{
    "filename": "sn-2-9",
    "bookId": 17,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 422,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "9. භික්ඛුසංයුත්තං",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. පඨමො වග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "9. 1. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මොග්ගල්ලානසුත්තං{1}",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "395. එවං මෙ සුතං: එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තත්ර ඛො ආයස්මා මහාමොග්ගල්ලානො භික්ඛූ ආමන්තෙසි: ආවුසො භික්ඛවොති. ආවුසොති ඛො තෙ භික්ඛූ ආයස්මතො මහාමොග්ගල්ලානස්ස පච්චස්සොසුං. ආයස්මා මහාමොග්ගල්ලානො එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ මය්හං ආවුසො රහොගතස්ස පතිසල්ලීනස්ස එවං චෙතසො පරිවිතක්කො උදපාදි: “අරියො තුණ්හීභාවො අරියො තුණ්හීභාවොති වුච්චති. කතමො නු ඛො අරියො තුණ්හීභාවො”ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්ස මය්හං ආවුසො එතදහොසි: “ඉධ භික්ඛු විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියං ඣානං උපසම්පජ්ජ විහරති. අයං වුච්චති අරියො තුණ්හීභාවො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සො ඛ්වාහං{2} ආවුසො, විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියං ඣානං උපසම්පජ්ජ විහරාමි.{3} තස්ස මය්හං ආවුසො ඉමිනා විහාරෙන විහරතො විතක්කසහගතා සඤ්ඤාමනසිකාරා සමුදාචරන්ති. අථ ඛො මං ආවුසො, භගවා ඉද්ධියා උපසඞ්කමිත්වා එතදවොච: “මොග්ගල්ලාන, මොග්ගල්ලාන, මා බ්රාහ්මණ අරියං තුණ්හීභාවං පමාදො. අරියෙ තුණ්හීභාවෙ චිත්තං සණ්ඨාපෙහි. අරියෙ තුණ්හීභාවෙ චිත්තං එකොදිං{4} කරොහි. අරියෙ තුණ්හීභාවෙ චිත්තං සමාදහා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සො ඛ්වාහං ආවුසො, අපරෙන සමයෙන විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියං ඣානං උපසම්පජ්ජ විහාසිං.{5} යං හි තං ආවුසො, සම්මා වදමානො වදෙය්ය, “සත්ථාරා අනුග්ගහිතො සාවකො මහාභිඤ්ඤතං පත්තො”ති, මමං තං සම්මා වදමානො වදෙය්ය “සත්ථාරා අනුග්ගහිතො සාවකො මහාභිඤ්ඤතං පත්තො”ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කොලිතසුත්ත - මඡසං. ස්යා. කොලිත-උද්දාන - සී 1."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ඛොහං - සීමු. සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "3. විහරිං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. එකොදිභාවං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. විහරාමි - මඡසං. ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 4,
                        "text": "9. භික්ඛු සංයුක්තය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. ප්‍රථම වර්ගය",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "9. 1. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මොග්ගල්ලාන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "395. මා විසින් මෙසේ අසන ලදි: එක්කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයෙහි ජේතවන නම් වූ අනේපිඬු සිටුහුගේ අරම්හි වැඩවසන සේක. එහි දී ආයුෂ්මත් මහමුගලන් තෙරණුවෝ ‘ඇවැත්නි, මහණෙනි’ යි භික්ෂූන් ඇමතූහ. ‘ඇවැත්නි’ යි ඒ භික්ෂූහු ආයුෂ්මත් මහමුගලන් තෙරණුවන්ට පිළිවදන් ඇස්වූහ. ආයුෂ්මත් මහමුගලන් තෙරණුවෝ මෙය වදාළහ:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, මෙහි එකලා වූ විවේකයෙන් යුත් මට “ආර්‍ය්‍ය තුෂ්ණීම්භාවය, ආර්‍ය්‍ය තුෂ්ණිම්භාවය යි කියනු ලැබේ. කිමෙක් නම් ආර්‍ය්‍ය තුෂ්ණිම්භාවය වේ දැ”යි මෙබඳු චිත්තවිතර්‍කයෙක් පහළ විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, ඒ මට “මෙහි මහණ තෙමේ විතර්‍කවිචාරයන්ගේ සන්හිඳීමෙන් ස්වසන්තානයෙහි පැහැදීම් ඇති සිතේ උතුම් එකඟබැව් වඩන විතර්‍ක රහිත විචාර රහිත සමාධියෙන් හටගත් ප්‍රීතිය හා සැපය ඇති ද්වීතීයධ්‍යානය උපදවා වෙසේ නම් මේ ආර්‍ය්‍ය වූ තූෂ්ණීම්භාවය ය යි කියනු ලැබේ”යි මේ සිත විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, ඒ මම විතර්‍කවිචාරයන්ගේ සන්හිඳිමෙන් සියසතන්හි පැහැදීම ඇති සිතේ උතුම් එකඟ බැව් වඩන විතර්‍කරහිත විචාරරහිත සමාධියෙන් හටගත් ප්‍රීතිය හා සැපය ඇති ද්වීතීයද්ධ්‍යානය උපදවා වෙසෙමි. ඇවැත්නි, මේ විහරණයෙන් වෙසෙන මට විතර්‍ක සහගත වූ සංඥාමනසකාරයෝ පවතිත්. ඇවැත්නි, එකල්හි භාග්‍යවතුන් වහන්සෙ ඍද්ධියෙන් මා වෙත වැඩ “මුගලන, මුගලන, බමුණ, ආර්‍යතූෂ්ණීම්භාවය නො වරදව. ආර්‍යතූෂ්ණීම්භාවයෙහි සිත එකඟ කරව. ආර්‍යතූෂ්ණීම්භාවයෙහි සිත නගාලව යි” මෙය වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, ඒ මම අන් කලෙක විතර්‍කවිචාරයන්ගේ සන්හිඳීමෙන් සිය සතන්හි පැහැදීම ඇති සිතේ එකඟබැව් වඩන විතර්‍කරහිත වූ විචාර රහිත වූ සමාධියෙන් හටගත් ප්‍රීතිය හා සැපය ඇති ද්වීතීයධ්‍යානය උපදවා විසීමි. ඇවැත්නි, සත්‍යය කියන්නෙක් “ශාස්තෲන් වහන්සේ විසින් අනුගෘහීත වූ ශ්‍රාවකයෙක් ෂඩභිඥා ඇති බවට පැමිණියේ ය” යි යමකු සඳහා කියන්නෙ නම්, සත්‍යය කියන්නා “ශාස්තෲන් වහන්සේ විසින් අනුගෘහීත වූ ශ්‍රාවකයෙක් ෂඩභිඥා ඇති බවට පැමිණියේ ය” යි මා සඳහා කියන්නේ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 424,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "9. 1. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සාරිපුත්තසුත්තං{1}",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "396.** සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ර ඛො ආයස්මා සාරිපුත්තො භික්ඛූ ආමන්තෙසි: ආවුසො භික්ඛවොති. ආවුසොති ඛො තෙ භික්ඛූ ආයස්මතො සාරිපුත්තස්ස පච්චස්සොසුං. ආයස්මා සාරිපුත්තො එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ මය්හං ආවුසො, රහොගතස්ස පතිසල්ලීනස්ස එවං චෙතසො පරිවිතක්කො උදපාදි: “අත්ථි නු ඛො තං කිඤ්චි ලොකස්මිං යස්ස මෙ විපරිනාමඤ්ඤථාභාවා උප්පජ්ජෙය්යුං සොකපරිදෙවදුක්ඛදොමනස්සුපායාසා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්ස මය්හං ආවුසො, එතදහොසි: “නත්ථි ඛො තං කිඤ්චි ලොකස්මිං යස්ස මෙ විපරිනාමඤ්ඤථාභාවා උප්පජ්ජෙය්යුං සොකපරිදෙවදුක්ඛදොමනස්සුපායාසා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං වුත්තෙ ආයස්මා ආනන්දො ආයස්මන්තං සාරිපුත්තං එතදවොච: “සත්ථුපි ඛො තෙ ආවුසො, සාරිපුත්ත විපරිනාමඤ්ඤථාභාවා නූප්පජ්ජෙය්යුං සොකපරිදෙවදුක්ඛදොමනස්සුපායාසා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සත්ථුපි ඛො මෙ ආවුසො, විපරිණාමඤ්ඤථාභාවා නූප්පජ්ජෙය්යුං සොකපරිදෙවදුක්ඛදොමනස්සුපායාසා. අපි ච මෙ එවමස්ස: මහෙසක්ඛො වත භො සත්තො අන්තරහිතො මහිද්ධිකො මහානුභාවො. සචෙ හි භගවා චිරං දීඝමද්ධානං තිට්ඨෙය්ය, තදස්ස බහුජනහිතාය බහුජනසුඛාය ලොකානුකම්පාය අත්ථාය හිතාය සුඛාය දෙවමනුස්සානන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තථා හි පනායස්මතො සාරිපුත්තස්ස දීඝරත්තං අහිඞ්කාරමමිංකාරමානානුසයා සුසමූහතා. තස්මා ආයස්මතො සාරිපුත්තස්ස සත්ථුපි විපරිණාමඤ්ඤථාභාවා නූප්පජ්ජෙය්යුං සොකපරිදෙවදුක්ඛදොමනස්සුපායාසාති."
                    },
                    {
                        "type": "centered",
                        "text": "9. 1. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මහානාගසුත්තං{2}",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "397. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන ආයස්මා ච සාරිපුත්තො ආයස්මා ච මහාමොග්ගල්ලානො රාජගහෙ විහරන්ති වෙළුවනෙ කලන්දකනිවාපෙ එකවිහාරෙ. අථ ඛො ආයස්මා සාරිපුත්තො සායණ්හසමයං පතිසල්ලාණා වුට්ඨිතො යෙනායස්මා මහාමොග්ගල්ලානො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මතා මහාමොග්ගල්ලානෙන සද්ධිං සම්මොදි -පෙ- එකමන්තං නිසින්නො ඛො ආයස්මා සාරිපුත්තො ආයස්මන්තං මහාමොග්ගල්ලානං එතදවොච: විප්පසන්නානි ඛො තෙ ආවුසො මොග්ගල්ලාන, ඉන්ද්රියානි. පරිසුද්ධො මුඛවණ්ණො පරියොදාතො, සන්තෙන නූනායස්මා මහාමොග්ගල්ලානො අජ්ජ විහාරෙන විහාසීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උපතිස්සසුත්තං - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ඝටසුත්තං - මඡසං. ඝට - උද්දාන"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "9. 1. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සාරිපුත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "396. **සැවැත්නුවර-**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "එහි දී ආයුෂ්මත් සැරියුත් තෙරණුවෝ ‘ඇවැත්නි, මහණෙනි’යි භික්ෂූන් ඇමතූහ. ඒ භික්ෂුහු ‘ඇවැත්නි’යි ආයුෂ්මත් සැරියුත් තෙරණුවන්ට පිළිවදන් ඇස්සූහ. ආයුෂ්මත් සැරියුත් තෙරණුවෝ මෙය වදාළහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, මෙහි එකලා ව විවෙකී ව හුන් මට “යම්බඳු මට විපරිණාම අන්‍යථාභාවයෙන් (=යමක් පෙරෙළීම වෙනස් වීම නිසා) සෝක පරිදේව දුක්ඛ දොමනස්ස උපායාසයෝ උපදනාහු නම් එබඳු කිසිවක් ලොව ඇද්දෝ” යි මෙබඳු චිත්තවිතර්‍කයෙක් පහළ විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, ඒ මට “යම්බඳු මට විපරිණාම - අන්‍යථාභාවයෙන් සෝක පරිදේව දුක්ඛ දොමනස්ස උපායාසයෝ උපදනාහු නම් එබඳු කිසිවක් ලොව නැතැ” යි මෙ සිත විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මෙසේ වදාළ කල්හි ආයුෂ්මත් ආනන්ඳ තෙරණුවෝ ආයුෂ්මත් සැරියුත් තෙරණුවන්ට “ඇවැත්නි, ශාරීපුත්‍රයෙනි, ශාස්තෲන් වහන්සේගේ ද විපරිණාම අන්‍යථාභාවයෙන් ඔබ වහන්සේට සෝක පරිදේව දුක්ඛ දොමනස්ස උපායාසයෝ නූපදනාහු දැ”යි මෙය කීහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, ශාස්තෲන් වහන්සේගේ ද විපරිණාම අන්‍යථාභාවයෙන් මට සෝක පරිදේව දුක්ඛ දොමනස්ස උපායාසයෝ නූපදනාහු ය. වැලිදු මට “පින්වත්නි, ඒකාන්තයෙන් මහේශාක්‍ය වු මහත් ඍද්ධි ඇති මහත් ආනුභාව ඇති සත්වයෙක් අතුරුදන් වූයේ ය. ඉදින් භාග්‍යවතුන් වහන්සේ බොහෝ දිගුකලක් සිටුනා සේක් නම් එය බොහෝ ජනයාට හිත පිණිස බොහෝ ජනයාට සැප පිණිස ලොවට අනුකම්පා පිණිස දෙවිමිනිසුන්ට වැඩ පිණිස, හිත පිණිස සුව පිණිස වන්නේ ය යි මෙසේ සිතෙන්නේ ය",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඒ එසේ මැයි: ආයුෂ්මත් සැරියුත් තෙරුන් වහන්සේ විසින් දිගු කලෙක අභිංකාරමමිඞ්කාරමානානුසයෝ මැනවින් උපුටා හරිණ ලදහ. එහෙයින් ආයුෂ්මත් සැරියුත් තෙරුන් වහන්සේට ශාස්තෲන් වහන්සේගේ ද විපරිණාම අන්‍යථාභාවයෙන් සෝක පරිදෙව දුක්ඛ දෝමනස්ස උපායාසයෝ නූපදනාහ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "9. 1. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මහානාග සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "397. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි ආයුෂ්මත් සැරියුත් තෙරණුවෝ ද, ආයුෂ්මත් මහමුගලන් තෙරණුවෝ ද රජගහනුවර සමීපයෙහි කලන්ඳකනිවාප නම් වේළුවනාරාමයෙහි එක වෙහෙර (=එක ම ගර්‍භයක) වෙසෙති. එකල්හි ආයුෂ්මත් සැරියුත් තෙරණුවෝ සවස්කල පලසමවතින් නැගී සිටියාහු ආයුෂ්මත් මහමුගලන් තෙරණුවන් කරා එළඹියහ. එළඹ ආයුෂ්මත් මහමුගලන් තෙරණුවන් සමඟ සතුටු වූහ ... එකත්පසෙක හුන් ආයුෂ්මත් සැරියුත් තෙරණුවෝ ආයුෂ්මත් මහමුගලන් තෙරණුවන්ට මෙය කීහ: “ඇවැත්නි, මොග්ගල්ලානයෙනි, ඔබගේ ඉඳුරෝ වෙසෙසින් පහන්හ. මූහුණුපැහැය පිරිසිදු ය වෙසෙසින් බබලන්නේ ය ආයුෂ්මත් මහමුගලන් තෙරණුවෝ අද ඒකාන්තයෙන් ශාන්ත වූ විහරණයකින් වූසූහූ ය” යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 426,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඔළාරිකෙන ඛො අහං ආවුසො; අජ්ජ විහාරෙන විහාසිං. අපි ච මෙ අහොසි ධම්මී කථාති. “කෙන සද්ධිං පනායස්මතො මහාමොග්ගල්ලානස්ස අහොසි ධම්මී කථා”ති? භගවතා ඛො මෙ ආවුසො, සද්ධිං අහොසි ධම්මී කථාති. “දූරෙ ඛො ආවුසො, භගවා එතරහි සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. කින්නු ඛො ආයස්මා මහාමොග්ගල්ලානො භගවන්තං ඉද්ධියා උපසඞ්කමි, උදාහු භගවා ආයස්මන්තං මහාමොග්ගල්ලානං ඉද්ධියා උපසඞ්කමීති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "නඛ්වාහං ආවුසො, භගවන්තං ඉද්ධියා උපසඞ්කමිං. නපි මං භගවා ඉද්ධියා උපසඞ්කමි. අපි ච මෙ යාවතා භගවා එත්තාවතා දිබ්බං චක්ඛුං විසුජ්ඣි දිබ්බා ච සොතධාතු. භගවතොපි යාවතාහං එත්තාවතා දිබ්බං චක්ඛුං විසුජ්ඣි, දිබ්බා ච සොතධාතූති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යථා කථං පනායස්මතො මහාමොග්ගල්ලානස්ස භගවතා සද්ධිං අහොසි ධම්මී කථාති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධාහං ආවුසො, භගවන්තං එතදවොචං: “ආරද්ධවිරියො ආරද්ධවිරියො”ති භන්තෙ වුච්චති. කිත්තාවතා නු ඛො භන්තෙ, ආරද්ධවිරියො හොතීති? එවං වුත්තෙ මං ආවුසො, භගවා එතදවොච: ඉධ මොග්ගල්ලාන භික්ඛු ආරද්ධවිරියො විහරති: “කාමං තචො ච නහාරූ ච අට්ඨී ච අවසිස්සතු සරීරෙ, උපසුස්සතු මංසලොහිතං. යං තං පුරිසථාමෙන පුරිසවිරියෙන පුරිසපරක්කමෙන පත්තබ්බං, න තං අපාපුණිත්වා විරියස්ස සණ්ඨානං භවිස්සතී”ති. එවං ඛො මොග්ගල්ලාන, ආරද්ධවිරියො හොතීති. එවං ඛො මෙ ආවුසො, භගවතා සද්ධිං අහොසි ධම්මී කථාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි ආවුසො, හිමවතො පබ්බතරාජස්ස පරිත්තා පාසාණසක්ඛරා යාවදෙව උපනික්ඛෙපනමත්තාය. එවමෙව ඛො මයං ආයස්මතො මහාමොග්ගල්ලානස්ස යාවදෙව උපනික්ඛෙපනමත්තාය. ආයස්මා හි මහාමොග්ගල්ලානො මහිද්ධිකො මහානුභාවො, ආකඞ්ඛමානො කප්පං තිට්ඨෙය්යාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි ආවුසො, මහතියා ලොණඝටාය පරිත්තා ලොණසක්ඛරා යාවදෙව උපනික්ඛෙපනමත්තාය. එවමෙව මයං ආයස්මතො සාරිපුත්තස්ස යාවදෙව උපනික්ඛෙපනමත්තාය. ආයස්මා හි සාරිපුත්තො භගවතා අනෙකපරියායෙන ථොමිතො වණ්ණිතො පසත්ථො:"
                    },
                    {
                        "type": "paragraph",
                        "text": "“සාරිපුත්තොව පඤ්ඤාය සීලෙන උපසමෙන ච,යොපි පාරඞ්ගතො භික්ඛු එතාව{1} පරමො සියා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉති හෙතෙ උභො මහානාගා අඤ්ඤමඤ්ඤස්ස සුභාසිතං සුලපිතං සමනුමොදිංසූති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. එසොව - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ඇවැත්නි , අද මම ඖදාරික (දිබ්බචක්ඛු - දිබ්බසොතධාතු විසය වූ) විහරණයකින් විසීමි. එහෙත් මාගේ දැහැමි කතාවෙක් වී ය. ආයුෂ්මත් මහමුගලන් තෙරණුවන්ගේ දැහැමි කතාව කවරකු සමග වී ද? ඇවැත්නි, මාගේ දැහැමි කතාව භාග්‍යවතුන් වහන්සේ ම සමග වී ය. ඇවැත්නි, භාග්‍යවතුන් වහන්සේ දැන් දුරෙහි ම සැවැත්නුවර සමීපයෙහි ජේතවන නම් අනේපිඬු මහසිටුහුගේ අරම්හි වැඩ වසන සේක. කිමෙක් ද? ආයුෂ්මත් මහමුගලන් තෙරණුවෝ ඍද්ධියෙන් භාග්‍යවතුන් වහන්සේ වෙත එළඹියාහු ද? නැතහොත් භාග්‍යවතුන් වහන්සේ ඍද්ධියෙන් ආයුෂ්මත් මහමුගලන් තෙරණුවන් වෙත වැඩි සේක් දැ යි?",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, මම ඍද්ධියෙන් භාග්‍යවතුන් වහන්සේ වෙත නො ම එළඹියෙමි. භාග්‍යවතුන් වහන්සේ ද ඍද්ධියෙන් මා වෙත නො එළඹි සේක. එහෙත් භාග්‍යවතුන් වහන්සේ යම්තාක් (දුරෙහි වූ) ද, ඒ තාක් මාගේ දිවැස ද දිවකණ ද (භාග්‍යවතුන් වහන්සේ දැකීම පිණිස ඇසීම පිණිස) විශුද්ධ (=යොමු ) විය. මම යම්තාක් දුරෙහි ද,ඒ තාක් භාග්‍යවතුන් වහසේගේ ද දිවැසත් දිවකණත් විශුද්ධ විය",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඒ කෙසේ නම් භාග්‍යවතුන් වහසේ සමග ආයුෂ්මත් මහමුගලන් තෙරණුවන්ගේ දැහැමි කතාව වී ද?",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, මෙහි මම භාග්‍යවතුන් වහසේට ‘වහන්ස, ආරබ්ධවීර්‍ය්‍ය ය, ආරබ්ධවීර්‍ය්‍ය ය යි කියනු ලැබේ වහන්ස, කෙතෙකින් ආරබ්ධවීර්‍ය්‍ය වේ දැ’ යි මෙය සැළකෙළෙමි. ඇවැත්නි, මෙසේ සැළකළ කල්හි භාග්‍යවතුන් වහන්සේ මට මෙය වදාළ සේක: මොග්ගල්ලානය, මෙහි මහණ තෙමේ “ඒකාන්තයෙන් සිරුරෙහි සිවියත් නහරත් ඇටත් ඉතිරි වේවා, මස් ලේ වියලේවා, පුරුෂ ශක්තියෙන් පුරුෂවිර්‍යයෙන් පුරුෂපරාක්‍රමයෙන් ඒ යමක් ලැබිය යුතු නම් එය නො ලබා වීර්‍ය්‍යයාගේ සිටීමෙක් නොවන්නේ ය”යි පටන් ගන්නා ලද වීර්‍ය්‍ය ඇති ව වෙසෙයි. මොග්ගල්ලානය, මෙසේ ආරබ්ධවීර්‍ය්‍ය වේ ය”යි. ඇවැත්නි, මෙසේ භාග්‍යවතුන් වහන්සේ සමග මාගේ දැහැමි කතාව විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, යම් සේ කුඩා ගල් කැටක් හිමවත් පවුරජුගේ (මහත් බව සඳහා) ලක් තැබීම (උපමා කිරීම) පිණිස පමණක් ම වේ ද, එසෙසින් ම අපි දු ආයුෂ්මත් මහමුගලන් තෙරුන්ගේ (ඍද්ධිමහත්තත්වය සඳහා) ලක් තැබීම පිණිස පමණක් ම වෙමු. ආයුෂ්මත් මහමුගලන් තෙරණුවෝ මහත් ඍද්ධි ඇත්තාහ. මහත් අනුභාව ඇත්තාහ. කැමැත්තෝ නම් ආ‍යුෂකල්පය ම සිටිනාහු ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "යම් සේ කුඩා ලුණුකැටක් (සක්වල මුවවිට හා බඹලොව හිම් කොට පිහිටි) ලුණු කළයක (මහත්බව සඳහා) ලක් තැබිම පිණිස පමණක් වේ ද, එසෙයින් ම අපි දු ආයුෂ්මත් සැරියුත් තෙරණුවන්ගේ (ප්‍රඥාමහත්ත්වය සඳහා) ලක් තැබීම පිණිස පමණක් ම වෙමු. ආයුෂ්මත් සැරියුත් තෙරණුවෝ භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් අයුරෙන් ස්තුති කරණ ලදහ. වර්‍ණනා කරණ ලදහ. පසස්නා ලදහ:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ප්‍රඥාවෙන් ද ශීලයෙන් ද ව්‍යුපශමයෙන් ද සැරියුත් තෙරණුවෝ ම ශ්‍රෙෂ්ඨයහ. යම් කිසි මහණෙක් පරතෙරට (නිවනට) පැමිණියේ නම් හෙතෙම සැරියුත් තෙරණුවන් ම පරම කොට ඇත්තෙ වන්නේ ය (තෙරුන්ට වඩාඋත්තරිතරයෙක් නැත.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මෙසේ මේ මහානාගයෝ (මහරහත්) දෙනම මැනැවින් බණන ලද ඔවුනොවුන්ගේ සුබැසිය සතුටින් පිළිගත්හ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 428,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "9. 1. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නවභික්ඛුසුත්තං{1}",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "398. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන අඤ්ඤතරො නවො භික්ඛු පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො විහාරං පවිසිත්වා අප්පොස්සුක්කො තුණ්හීභූතො සඞ්කසායති, න භික්ඛූනං වෙය්යාවච්චං කරොති චීවරකාරසමයෙ. අථ ඛො සම්බහුලා භික්ඛූ යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නා ඛො තෙ භික්ඛූ භගවන්තං එතදවොචුං: “ඉධ භන්තෙ, අඤ්ඤතරො නවො භික්ඛු පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො විහාරං පවිසිත්වා අප්පොස්සුක්කො තුණ්හීභූතො සඞ්කසායති. න භික්ඛූනං වෙය්යාවච්චං කරොති චීවරකාරසමයෙ”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා අඤ්ඤතරං භික්ඛුං ආමන්තෙසි, “එහි ත්වං භික්ඛු මම වචනෙන තං භික්ඛුං ආමන්තෙහි, සත්ථා තං ආවුසො ආමන්තෙතී”ති. එවං භන්තෙති ඛො සො භික්ඛු භගවතො පටිස්සුත්වා යෙන සො භික්ඛු තෙනුපසඞ්කමි. උපසඞ්කමිත්වා තං භික්ඛුං එතදවොච: “සත්ථා තං ආවුසො, ආමන්තෙතී”ති. එවමාවුසොති ඛො සො භික්ඛු තස්ස භික්ඛුනො පටිස්සුත්වා යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා -පෙ- එකමන්තං නිසින්නං ඛො තං භික්ඛුං භගවා එතදවොච: “සච්චං කිර ත්වං භික්ඛු, පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො විහාරං පවිසිත්වා අප්පොස්සුක්කො තුණ්හීභූතො සංකසායසි, න භික්ඛූනං වෙය්යාවච්චං කරොසි චීවරකාරසමයෙති? අහම්පි ඛො භන්තෙ, සකං කිච්චං කරොමීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා තස්ස භික්ඛුනො චෙතසා චෙතොපරිවිතක්කමඤ්ඤාය භික්ඛූ ආමන්තෙසි: මා ඛො තුම්හෙ භික්ඛවෙ, එතස්ස භික්ඛුනො උජ්ඣායිත්ථ. එසො ඛො භික්ඛවෙ, භික්ඛු චතුන්නං ඣානානං ආභිචෙතසිකානං{2} දිට්ඨධම්මසුඛවිහාරානං නිකාමලාභී අකිච්ඡලාභී අකසිරලාභී. යස්ස චත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජන්ති, තදනුත්තරං බ්රහ්මචරියපරියොසානං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතීති. ඉදමවොච භගවා. ඉදං වත්වා සුගතො අථාපරං එතදවොච සත්ථා:"
                    },
                    {
                        "type": "paragraph",
                        "text": "නයිදං සිථිලමාරබ්භ නයිදං අප්පෙන ථාමසා,නිබ්බානං අධිගන්තබ්බං සබ්බගන්ථප්පමොචනං{3}."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයඤ්ච දහරො භික්ඛු අයමුත්තමපොරිසො,ධාරෙති අන්තිමං දෙහං ජෙත්වා මාරං සවාහිනින්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. නවසුත්තං - මඡසං. භව - උද්දාන."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අභිචෙතසිකානං - සීමු. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. සබ්බදුක්ඛප්පමොචනං - මඡසං. PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "9. 1. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නවභික්ඛු සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "398.** සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි එක්තරා නව මහණෙක් පසුබත පිණ්ඩපාතයෙන් වැළකුනේ වෙහෙරට පිවිස නිරුත්සක ව නිහඬව වෙසෙයි. සිවුරු කරණ සමයෙහි භික්ෂූන්ට වතාවත් නො කෙරෙයි. ඉක්බිති බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්හු. එකත්පසෙක හුන් ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙය සැළ කළහ: වහන්ස, මෙහි එක්තරා නවක මහණෙක් පසුබත පිණ්ඩපාතයෙන් වැළකුනේ වෙහෙරට පිවිස නිරුත්සුක ව නිහඬ ව වෙසෙයි. සිවුරු කරණ සමයෙහි භික්ෂූන්ට වතාවත් නො කෙරේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි භාග්‍යවතුන් වහන්සේ එක්තරා මහණකු ඇමතූ සේක: “මහණ එව, තෝ මාගේ වචනයෙන් ඇවැත්නි, ශාස්තෲන් වහන්සේ තොප අමතන සේකැ”යි ඒ මහණ අමතව. “වහන්ස, එසේ ය” යි ඒ මහණ තෙමේ භාග්‍යවතුන් වහන්සේට පිළිවදන් අස්වා ඒ මහණ කරා එළඹියේ ය. එළඹ “ඇවැත්නි, ශාස්තෲන් වහන්සේ තොප අමතන සේකැ”යි ඒ මහණහට මෙය කී ය. ඒ මහණ තෙමේ “ඇවැත්නි, එසේ ය”යි ඒ මහණහට පිළිවදන් අස්වා භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ ... එකත්පසෙක හුන් ඒ මහණහට භාග්‍යවතුන් වහන්සේ: “මහණ තෝ පසුබත පිණ්ඩපාතයෙන් වැළකුනේ වෙහෙරට පිවිස නිරුත්සුක වූයේ නිහඬ ව වෙසෙහි, සිවුරු කරණ සමයෙහි භික්ෂූන්ට වතාවත් නො කෙරෙහි, සැබෑ දැ” යි මෙය වදාළ සේක. “වහන්ස, මම සිය කට යුතු කෙරෙමි යි”.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි භාග්‍යවතුන් වහන්සේ සිය සිතින් ඒ මහණහුගේ චිත්තපරිවිතර්‍කය දැන භික්ෂූන් ඇමතූ සේක: මහණෙනි, තෙපි තෙල මහණහට නහමක් අවමන් කරවු. “මහණෙනි, තෙල මහණ තෙමේ උතුම් සිත ඇසුරු කළ ඉහාත්මයෙහි සැපවිහරණ වූ සතර ධ්‍යානයන් කැමැති සේ ලබන්නෙක. නිදුකින් ලබන්නෙක. මහත් සේ ලබන්නෙක. යමක් පිණිස කුල පුත්‍රයෝ මැනවින් ගිහිගෙන් නික්ම පැවිද්දට පැමිණෙද්ද, මගබඹසර අවසන් කොට ඇති ඒ අනුත්තර වූ අර්‍හත්වය මේ අත්බැව්හි ම තෙමේ විශිෂ්ටඥානයෙන් දැන පසක් කොට ලබා වාසය කෙරේ” යි. භාග්‍යවතුන් වහන්සේ මෙය වදාළෙ සේක. මෙය වදාරා සුගත වූ ශාස්තෲන් වහන්සේ වැලි අන් අයුරින් මෙය වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "සියලු ග්‍රන්ථයන් මුදන මේ නිවන ශිථිලවීර්‍ය්‍යයෙන් අවබෝධ නො කට හැකිය. මේ නිවන ස්වල්ප වූ ශක්තියකින් ලැබිය නො හැකි ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මේ දහර මහණෙකි. උතුම් පුරුෂයෙක් වූ මෙතෙමේ සේනා සහිත මරු දිනා අන්තිම ශරීරය දරණේ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 430,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "9. 1. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සුජාතසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "399. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා සුජාතො යෙන භගවා තෙනුපසඞ්කමි. අද්දසා ඛො භගවා ආයස්මන්තං සුජාතං දූරතොව ආගච්ඡන්තං. දිස්වාන භික්ඛූ ආමන්තෙසි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "උභයෙනෙවායං භික්ඛවෙ, කුලපුත්තො සොභති: යඤ්ච අභිරූපො දස්සනීයො පාසාදිකො පරමාය වණ්ණපොක්ඛරතාය සමන්නාගතො, යස්ස චත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජ්ජන්ති, තදනුත්තරං බ්රහ්මචරියපරියොසානං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතීති. ඉදමවොච: භගවා -පෙ- සත්ථා:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සොභති වතායං භික්ඛු උජුභූතෙන චෙතසා,විප්පමුත්තො{1} විසඤ්ඤුත්තො අනුපාදාය නිබ්බුතො,ධාරෙති අන්තිමං දෙහං ජෙත්වා මාරං සවාහිනින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "9. 1. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ලකුණ්ටකභද්දියසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "400. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා ලකුණ්ටකභද්දියො යෙන භගවා තෙනුපසඞ්කමි. අද්දසා ඛො භගවා ආයස්මන්තං ලකුණ්ටකභද්දියං දූරතොව ආගච්ඡන්තං. දිස්වාන භික්ඛූ ආමන්තෙසි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "පස්සථ නො තුම්හෙ භික්ඛවෙ, එතං භික්ඛුං ආගච්ඡන්තං දුබ්බණ්ණං දුද්දසිකං ඔකොටිමකං භික්ඛූනං පරිභූතරූපන්ති? එවං භන්තෙ. එසො ඛො භික්ඛවෙ, භික්ඛු මහිද්ධිකො මහානුභාවො, න ච සා සමාපත්ති සුලභරූපා යා තෙන භික්ඛුනා අසමාපන්නපුබ්බා. යස්ස චත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජන්ති, තදනුත්තරං බ්රහ්මචරියපරියොසානං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතීති. ඉදමවොච භගවා -පෙ- සත්ථා:"
                    },
                    {
                        "type": "paragraph",
                        "text": "හංසා කොඤ්චා මයූරා ච හත්ථියො පසදා මිගා,සබ්බෙ සීහස්ස භායන්ති නත්ථි කායස්මිං තුල්යතා."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව මනුස්සෙසු දහරො චෙපි පඤ්ඤවා,සො හි තත්ථ මහා හොති නෙව බාලො සරීරවාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. විප්පයුත්තො - මඡසං. ස්යා. PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "9. 1. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සුජාත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "399. **සැවැත්නුවර-**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි ආයුෂ්මත් සුජාත තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. භාග්‍යවතුන් වහන්සේ එන්නා වූ සුජාත තෙරුන් දුර දී ම දුටු සේක. දැක භික්ෂූන් ඇමතූ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මේ කුලදරු තෙමේ කරුණු දෙකෙකින් හොබී: “විශිෂ්ට රූප ඇත්තේ දැකුම්කලු වූයේ පැහැ එලවන උතුම් වර්‍ණ සෞන්දර්‍ය්‍යයෙන් යුක්ත වූයේ ය” යන යම් කරුණෙකුත් වේ ද, “යමක් පිණිස කුලපුත්‍රයෝ මැනවින් ගිහිගෙන් නික්ම පැවිද්දට වදිත් නම් මහබඹසර අවසන් කොට ඇති ඒ අනුත්තර වූ අර්‍හත්ත්වය මේ අත් බැව්හි ම තෙමේ විශිෂ්ටඥානයෙන් දැන පසක් කොට ලබා වාසය කෙරෙයි” යන යම් කරුණෙකුත් වේ ද යන කරුණු දෙකෙනි. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක … ශාස්තෲන් වහන්සේ මෙද වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මේ මහණ තෙමේ ඍජු වූ සිතින් ඒකාන්තයෙන් හොබී. කෙලෙසුන් කෙරෙන් මිදුනේ සංයෝජනයන්ගෙන් වෙන් වූයේ උපාදානරහිත ව නිවියේ සේනා සහිත මරු දිනා අන්තිමශරීරය දරණේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "9. 1. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ලකුණ්‌ටකභද්‌දිය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "400. **සැවැත්නුවර-**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි ආයුෂ්මත් ලකුණ්ටකභද්දිය තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ලකුණ්ටකභද්දිය තෙරුන් දුර දී ම එනුවන් දුටු සේක. දැක භික්ෂූන් ඇමතූ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, තෙපි තෙල එන්නා වූ දුර්‍වණ නපුරු දැකුම් ඇති මිටි වූ භික්ෂූන් විසින් අවමන් කරණ ලද ස්වරූප ඇති මහණ දකිවු ද? වහන්ස, එසේ ය. මහණෙනි, මේ මහණ තෙමේ මහත් ඍද්ධි ඇත්තෙකි. මහත් ආනුභාව ඇත්තෙකි. ඒ මහණහු විසින් නො සමවන්විරූ යම් සමවතෙක් වේ ද, එබඳු සමවතෙක් සුලබ නො වේ. කුලපුත්‍රයෝ යමක් පිණිස මැනවින් ගිහිගෙන් නික්ම පැවිද්දට පැමිණෙද්ද, මගබඹසර අවසන් කොට ඇති ඒ අනුත්තරඅර්‍හත්වය මේ අත්බැව්හි ම තෙමේ විශිෂ්ටඥානයෙන් දැන පසක් කොට පැමිණ වෙසේ ය යි. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක … ශාස්තෲන් වහන්සේ මෙය ද වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හංසයෝත් කොස්වාලිහිණියෝත් මොනරුත් ඇත්තුත් තිත් මුවෝත් සියල්ලෝ සිංහයාගෙන් බති. කයෙහි සමබවෙක් (පමණ ගිණීමෙක්) නැත.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එසෙයින් ම මිනිසුන් අතර නුවණැත්තේ ඉදින් ලදරු වූයේ ද, හෙතෙමේ ම එහි පූජ්‍ය වෙයි. බාල (අඥ) තෙමේ මහත් සිරුරක් ඇත්තේ ද නො ම පූජ්‍ය වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 432,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "9. 1. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "විසාඛපඤ්චාලිපුත්තසුත්තං{1}",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "401. එකං සමයං භගවා වෙසාලියං විහරති මහාවනෙ කූටාගාරසාලායං. තෙන ඛො පන සමයෙන ආයස්මා විසාඛො පඤ්චාලිපුත්තො උපට්ඨානසාලායං භික්ඛූ ධම්මියා කථාය සන්දස්සෙති සමාදපෙති සමුත්තෙජෙති සම්පහංසෙති, පොරියා වාචාය විස්සට්ඨාය අනෙලගලාය{2} අත්ථස්ස විඤ්ඤාපනියා පරියාපන්නාය අනිස්සිතාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා සායන්හසමයං පතිසල්ලානා වුට්ඨිතො යෙනුපට්ඨානසාලා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදි. නිසජ්ජ ඛො භගවා භික්ඛූ ආමන්තෙසි: කො නු ඛො භික්ඛවෙ, උපට්ඨානසාලායං භික්ඛූ ධම්මියා කථාය සන්දස්සෙති සමාදපෙති සමුත්තෙජෙති සම්පහංසෙති පොරියා වාචාය විස්සට්ඨාය අනෙලගලාය{2} අත්ථස්ස විඤ්ඤාපනියා පරියාපන්නාය අනිස්සිතායාති? ආයස්මා භන්තෙ, විසාඛො පඤ්චාලිපුත්තො උපට්ඨානසාලායං භික්ඛූ ධම්මියා කථාය සන්දස්සෙති සමාදපෙති සමුත්තෙජෙති සම්පහංසෙති, පොරියා වාචාය විස්සට්ඨාය අනෙලගලාය අත්ථස්ස විඤ්ඤාපනියා පරියාපන්නාය අනිස්සිතායාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා ආයස්මන්තං විසාඛං පඤ්චාලිපුත්තං ආමන්තෙසි: සාධු, සාධු, විසාඛ, සාධු ඛො ත්වං විසාඛ, භික්ඛූ ධම්මියා කථාය සන්දස්සෙසි සමාදපෙසි සමුත්තෙජෙසි සම්පහංසෙසි, පොරියා වාචාය විස්සට්ඨාය අනෙලගලාය{2} අත්ථස්ස විඤ්ඤාපනියා පරියාපන්නාය අනිස්සිතායාති. ඉදමවොච භගවා. ඉදං වත්වා සුගතො අථාපරං එතදවොච සත්ථා:"
                    },
                    {
                        "type": "paragraph",
                        "text": "න භාසමානං ජානන්ති මිස්සං බාලෙහි පණ්ඩිතං,භාසමානඤ්ච ජානන්ති දෙසෙන්තං අමතං පදං."
                    },
                    {
                        "type": "paragraph",
                        "text": "භාසයෙ ජොතයෙ ධම්මං පග්ගණ්හෙ ඉසිනං ධජං,සුභාසිතධජා ඉසයො ධම්මො හි ඉසිනං ධජොති."
                    },
                    {
                        "type": "centered",
                        "text": "9. 1. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නන්දසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "402. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා නන්දො භගවතො මාතුච්ඡපුත්තො ආකොටිතපච්චාකොටිතානි චීවරානි පාරුපිත්වා අක්ඛීනි අඤ්ජිත්වා අච්ඡං පත්තං ගහෙත්වා යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො ආයස්මන්තං නන්දං භගවා එතදවොච:"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. විසාඛසුත්තං - මඡසං. විසාඛ - උද්දාන"
                    },
                    {
                        "type": "footnote",
                        "text": "2. අනෙලමූගාය - සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "9. 1. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "විසාඛ පඤ්චාලිපුත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "401. එක් කලෙක භාග්‍යවතුන් වහන්සේ විශාලාමහනුවර මහවෙනෙහි කූටගාර ශාලාවෙහි වැඩ වසන සේක. එකල්හි (පඤ්චාලිරාජ දුහිතෘ පුත්‍ර බැවින්) පඤ්චාලිපුත්‍ර වූ ආයුෂ්මත් විශාඛ තෙරණුවෝ නො පැකුළුණු කෙලතොලු නො වු (=නිදොස් වූ) අර්‍තවය අඟවන සිවුසස් නො හැර පවසන සසරට නිසි නො වූ නාගරික (=පුරවැසිබස් සෙයින් මිහිරි වූ) වචනයෙන් දැහැමි කතාවෙන් උවටැන් හලෙහි භික්ෂූන් කරුණු දක්වති. සමාදන් කරවති. තෙද ගන්වති. සතුටු කරවති.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ සවස් කල පලසමවතින් නැගී සිටි සේක් උවටැන්හල වෙත එළඹි සේක. එළඹ පණවන ලද අසුන්හි වැඩහුන් සේක වැඩ හිඳ භාග්‍යවතුන් වහන්සේ භික්ෂූන් ඇමතූ සේක. මහණෙනි, කවරෙක් නො පැකුළුණු කෙලතොලු නුවු (=නිදොස් වූ) අරුත් අඟවන සිවුසස් පවසන සසරට නිසි නො වූ මිහිරි වචනයෙන් දැහැමි කතායෙන් උවටැන් හලෙහි භික්ෂූන් කරුණු දක්වා ද, සමාදන් කරවා ද, තෙද ගන්වා ද, සතුටු කෙරේ දැ යි? වහන්ස පඤ්චාලි පුත්‍ර වූ ආයුෂ්මත් විසාඛ තෙරණුවෝ නො පැකුළුණු නිදොස් වූ අරුත් හඟවන සිවුසස් පවසන සසරට නිසි නො වූ මිහිරි වචනයෙන් දැහැමි කතාවෙන් උවටැන්හලෙහි භික්ෂූන් කරුණු දක්වත්, සමාදන් කරවත්, තෙද ගන්වත්, සතුටු කෙරෙති යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් පඤ්චාලිපුත්‍ර වූ විසාඛ තෙරුන් ඇමතූ සේක. විසඛ, මැනැවි. මැනැවි. විසාඛ, තෙපි නො පැකුළුණු නිදොස් වූ අරුත් හඟවන සිවුසස් පවසන සසර ඇසුරු නො කළ මධුර වචනයෙන් දැහැමි කථායෙන් භික්ෂූන් කරුණු දක්වවු. සමාදන් කරවවු, තෙද ගන්වවු, සතුටු කරවවු යි. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගත වූ ශාස්තෲන් වහන්සේ මෙය වදාරා වැලි දු මෙය වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බාලයන් හා එක් වූ කථික (පණ්ඩිතයා) ලෝවැස්සෝ නො දනිත් අමාපදය දෙසන කථික (පණ්ඩිතයා) දැන ගණිත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ධර්මය කියන්නේ ය. බබුලුවන්නේ ය. සෘෂීන්ගේ ධ්වජ ය දැඩි කොට ගන්නේ ය. සෘෂීහු සුභාෂිතය ධ්වජ කොට ඇත්තාහ. නව ලොවුතුරු දහම සෘෂීන්ගේ ධ්වජ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "9. 1. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නන්‌ද සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "402. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි භාග්‍යවතුන් වහන්සේ සුලුමවුපුත් ආයුෂ්මත් නන්ඳ ස්ථවිර තෙමේ කොළන ලද පිළිකොළන ලද (මටසිලුටු සිහින්) සිවුරු පොරවා. ඇස් අඳුනෙන් සදා වෙසෙසින් පහන් පැහැති පාත්‍රයක් ගෙණ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් ආයුෂ්මත් නන්ඳහට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 434,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "න ඛො තෙ තං නන්ද, පතිරූපං කුලපුත්තස්ස සද්ධා අගාරස්මා අනගාරියං පබ්බජිතස්ස යං ත්වං ආකොටිතපච්චාකොටිතානි චීවරානි පාරුපෙය්යාසි, අක්ඛීනි ච අඤ්ජෙය්යාසි, අච්ඡඤ්ච පත්තං ධාරෙය්යාසි. එතං{1} ඛො තෙ නන්ද පතිරූපං කුලපුත්තස්ස සද්ධා අගාරස්මා අනගාරියං පබ්බජිතස්ස යං ත්වං ආරඤ්ඤකො ච අස්සසි පිණ්ඩපාතිකො ච පංසුකුලිකො ච කාමෙසු ච අනපෙක්ඛො විහරෙය්යාසීති. ඉදමවොච භගවා -පෙ- එතදවොච සත්ථා:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කදාහං නන්දං පස්සෙය්යං ආරඤ්ඤං පංසුකූලිකං,අඤ්ඤාතුඤ්ඡෙන{2} යාපෙන්තං කාමෙසු අනපෙක්ඛිනන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා නන්දො අපරෙන සමයෙන ආරඤ්ඤකො වාසි පිණ්ඩපාතිකො ච පංසුකූලිකො ච කාමෙසු ච අනපෙක්ඛො විහාසීති."
                    },
                    {
                        "type": "centered",
                        "text": "9. 1. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තිස්සසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "403. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා තිස්සො භගවතො පිතුච්ඡාපුත්තො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි, දුක්ඛී දුම්මනො අස්සූනි පවත්තයමානො. අථ ඛො භගවා ආයස්මන්තං තිස්සං එතදවොච: කිං ත්වං තිස්ස, එකමන්තං නිසින්නො දුක්ඛී දුම්මනො අස්සූනි පවත්තයමානොති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "තථා හි පන මං භන්තෙ, භික්ඛූ සමන්තා වාචාසන්නිතොදකෙන{3} සඤ්ජම්භරිං අකංසූති. තථා හි පන ත්වං තිස්ස, වත්තා නො ච වචනක්ඛමො, න ඛො තෙ තං තිස්ස පතිරූපං කුලපුත්තස්ස සද්ධා අගාරස්මා අනගාරියං පබ්බජිතස්ස, යං ත්වං වත්තා නො ච වචනක්ඛමො. එතං ඛො තෙ තිස්ස පතිරූපං කුලපුත්තස්ස සද්ධා අගාරස්මා අනගාරියං පබ්බජිතස්ස යං ත්වං වත්තා ච අස්සසි{4} වචනක්ඛමො චාති. ඉදමවොච භගවා -පෙ- එතදවොච සත්ථා:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කින්නු කුජ්ඣසි මා කුජ්ඣි අක්කොධො තිස්ස තෙ වරං,කොධමානමක්ඛවිනයත්ථං හි තිස්ස බ්රහ්මචරියං වුස්සතීති."
                    },
                    {
                        "type": "centered",
                        "text": "9. 1. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ථෙරනාමකසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "404. එකං සමයං භගවා රාජගහෙ විහරති වෙළුවනෙ කලන්දකනිවාපෙ. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු ථෙරනාමකො එකවිහාරී චෙව හොති එකවිහාරස්ස ච වණ්ණවාදී. සො එකො ගාමං පිණ්ඩාය පවිසති. එකො පටික්කමති. එකො රහො නිසීදති. එකො චඞ්කමං අධිට්ඨාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. එවං - සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අඤ්ඤාභුඤ්ජෙන - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. වාචාය සන්නිතොදකෙන - මඡසං. ස්යා. PTS. සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "4. අස්ස - මඡසං. ආසි - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "නන්ඳ, යම්බඳු තෝ කොළන ලද පිළිකොළන ලද සිවුරු පොරවන්නෙහි නම්, ඇස් අඳුනෙන් සදන්නෙහි නම්, වෙසෙසින් පහන් පැහැති පාත්‍රයක් දරන්නෙහි නම් එය සැදැහැයෙන් ගිහිගෙන් නික්ම පැවිද්දට පැමිණි කුලපුත්‍ර වූ තොපට නිසි නො වේ. නන්ඳ යම්බඳු තෝ ආරණ්‍යක ද පිණ්ඩපාතික ද පංසුකූලික ද වන්නෙහි නම්, කාමයන්හිත් නිරපේක්ෂක ව වෙසෙන්නෙහි නම්, සැදැයෙන් ගිහිගෙන් නික්ම සස්නෙහි පැවිදි වූ කුලපුත්‍ර වූ තොපට මෙය සුදුසු වේ මැ යි. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක ... ශාස්තෲන් වහන්සේ මෙ ද වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආරණ්‍යක වූ පංසුකූලික වූ ප්‍රකට කුලයන්හි ම නොව ගෙපිළිවෙළින් පිඬු සිඟීමෙන් යැපෙන්නා වූ කාමයන්හි නිරපෙක්ෂක වූ නන්ඳයන් මම කවදා දක්නෙම් ද?",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිත් ආයුෂ්මත් නන්ඳ තෙමේ මෑත භාගයෙහි ආරණ්‍යක ද පිණ්ඩපාතික ද පංසුකූලික ද විය. කාමයන්හි නිරපේක්ෂක ව විසී ය.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "9. 1. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තිස්‌ස සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "403. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි භාග්‍යවතුන් වහන්සේගේ නැන්දනියගේ පුත් වූ ආයුෂ්මත් තිස්ස ස්ථවිර තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ දුක් ඇත්තේ හටගත් දොම්නස් ඇත්තේ කඳුලු වගුරවමින් එකත්පසෙක හුන්නේ ය. ඉක්බිති භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් තිස්සහට - තිස්ස, තෝ කුමක් හෙයින් දුක් ඇත්තෙහි හටගත් දොම්නස් ඇත්තෙහි කඳුලු වගුරුවමින් එකත්පසෙක හුන්නෙහි දැයි මෙය වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "වහන්ස, එය එසේ මැයි: භික්ෂූහු වචනකෙවිටෙන් මට හාත්පස මතුමතුයෙහි විද්දාහු ය. තිස්ස, එය එසේ මැයි. තෝ (මෙරමාහට) කියන්නෙකි. මෙරමා වදන් නො ම ඉවසන්නෙකි. තිස්ස, යම්බඳු තෝ කියන්නෙක් වෙහි ද, මෙරමා වදන් නො ඉවසන්නෙක් වෙහි ද, සැදැහැයෙන් ගිහිගෙන් නික්ම පැවිද්දට වන් කුලපුත්‍ර වූ තට එය නිසි නො වේ. තිස්ස, යම්බඳු තෝ කියන්නෙහිත් මෙරමා වදන් ඉවසන්නෙහිත් වන්නෙහි නම් සැදැහැයෙන් ගිහිගෙන් නික්ම පැවිදිවන් කුලපුත්‍ර වූ තට මෙය නිසි වේ මැ යි. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක ... ශාස්තෲන් වහන්සේ මෙය ද වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "කුමක් හෙයින් කිපෙහි ද? නො කිපෙව. තිස්ස, තට නො කිපීම උතුමි. තිස්ස ක්‍රොධය ,මානය, මකුගුණය දුරු කිරීම පිණිස ම බඹසර වෙසේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "9. 1. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ථෙරනාම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "404. එක්කලෙක භාග්‍යවතුන් වහන්සේ රජගහනුවර සමීපයෙහි කලන්දකනිවාප නම් වේළුවනාරාමයෙහි වැඩවසන සේක. එකල්හි ථෙර නම් එක්තරා මහණෙක් එකලා ව වෙසෙන්නේ ද එකලා ව විසීමෙහි ගුණ කියන්නේ ද වෙයි. හෙතෙමේ එකලා ව ගමට පිඬු පිණිස පිවිසෙහි. එකලා ව පෙරලා එයි. එකලා ව රහසිගත ව හිඳි. එකලා ව සක්මනට නගී.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 436,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො සම්බහුලා භික්ඛූ යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නා ඛො තෙ භික්ඛූ භගවන්තං එතදවොචුං: ඉධ භන්තෙ අඤ්ඤතරො භික්ඛු ථෙරනාමකො එකවිහාරී එකවිහාරස්ස ච වණ්ණවාදීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා අඤ්ඤතරං භික්ඛුං ආමන්තෙසි: එහි ත්වං භික්ඛු මම වචනෙන ථෙරං භික්ඛුං ආමන්තෙහි “සත්ථා තං ආවුසො, ථෙර ආමන්තෙතී”ති. ‘එවං භන්තෙ’ති ඛො සො භික්ඛු භගවතො පටිස්සුත්වා යෙනායස්මා ථෙරො භික්ඛු තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මන්තං ථෙරං එතදවොච: “සත්ථා තං ආවුසො, ථෙර ආමන්තෙතී”ති. ‘එවමාවුසො’ති ඛො ආයස්මා ථෙරො තස්ස භික්ඛුනො පටිස්සුත්වා යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො ආයස්මන්තං ථෙරං භගවා එතදවොච: සච්චං කිර ත්වං ථෙර එකවිහාරී, එකවිහාරස්ස ච වණ්ණවාදීති? එවං භන්තෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "යථා කථං පන ත්වං ථෙර, එකවිහාරී එකවිහාරස්ස ච වණ්ණවාදීති? ඉධාහං භන්තෙ, එකො ගාමං පිණ්ඩාය පවිසාමි. එකො පටික්කමාමි. එකො රහො නිසීදාමි. එකො චඞ්කමං අධිට්ඨාමි. එවං ඛ්වාහං භන්තෙ එකවිහාරී, එකවිහාරස්ස ච වණ්ණවාදීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථෙසො ථෙර එකවිහාරො, න සො නත්ථීති වදාමි. අපි ච ථෙර, යථා එකවිහාරො විත්ථාරෙන පරිපුණ්ණො හොති, තං සුණාහි, සාධුකං මනසි කරොහි, භාසිස්සාමීති. එවං භන්තෙති ඛො ථෙරො භික්ඛු භගවතො පච්චස්සොසි. භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කථං ච ථෙර එකවිහාරො විත්ථාරෙන පරිපුණ්ණො හොති? ඉධ ථෙර යං අතීතං තං පහීනං, යං අනාගතං තං පටිනිස්සට්ඨං. පච්චුප්පන්නෙසු ච අත්තභාවපටිලාභෙසු ඡන්දරාගො සුප්පටිවිනීතො. එවං ඛො ථෙර එකවිහාරො විත්ථාරෙණ පරිපුණ්ණො හොතීති. ඉදමවොච භගවා. ඉදං වත්වා සුගතො අථාපරං එතදවොච සත්ථා:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සබ්බාභිභුං සබ්බවිදුං සුමෙධංසබ්බෙසු ධම්මෙසු අනූපලිත්තං,සබ්බං ජහං තණ්හක්ඛයෙ විමුත්තංතමහං නරං එකවිහාරීති බ්රෑමීති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "එකල්හි බොහෝ භික්ෂූහූ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්හ. එකත්පසෙක හුන් ඒ භික්ෂූහූ භාග්‍යවතුන් වහන්සේට “වහන්ස, මෙහි ථේර නම් එක්තරා මහණෙක් එකලා ව වෙසෙන්නේත් එකලා ව විසීමෙහි ගුණ කියන්නේත් වේ ය” යි මෙය සැළකළහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි භාග්‍යවතුන් වහන්සේ එක්තරා මහණකු ඇමතූ සේක: මහණ, එව, තෝ ‘ඇවැත්නි, ථේරයෙනි, ශාස්තෲන් වහන්සේ තොප අමතන සේකැ’ යි මාගේ වචනයෙන් ථේර මහණ අමතව. ‘වහන්ස, එසේ ය’ යි ඒ මහණ තෙමේ භාග්‍යවතුන් වහන්සේට පිළිවදන් අස්වා ආයුෂ්මත් ථේර මහණ වෙත එළඹියේ ය. එළඹ, ආයුෂ්මත් ථේර මහණහට ‘ඇවැත්නි ථේරයෙනි, ශාස්තෲන් වහන්සේ තොප අමතන සේකැ’ යි මෙය කී ය. ‘ඇවැත්නි, එසේ ය’ යි ආයුෂ්මත් ථේර මහණ තෙමේ ඒ මහණහට පිළිවදන් අස්වා භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් ආයුෂ්මත් ථේරහට භාග්‍යවතුන් වහන්සේ: ථේර, තෝ එකලා ව වෙසෙන්නෙහි, එකලා ව විසීමෙහි ගුණ කියන්නෙහිත් සැබෑ දැ යි මෙය වදාළහ. වහන්ස , එසේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ථේර, කෙසේ නම් එකලා ව වෙසෙන්නේ එකලා ව විසීමෙහි ගුණ කියන්නේත් වෙහි ද? වහන්ස, මෙහි මම එකලා ව ගමට පිඬු පිණිස පිවිසෙමි එකලා ව පෙරලා එමි. එකලා ව රහසිගතව හිඳිමි. එකලා ව සක්මනට නගිමි. වහන්ස, මෙසේ මම එකලා ව වෙසෙන්නෙම් එකලා ව විසීමෙහි ගුණ කියන්නෙම් ද වෙමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ථේර, මේ එකලා විහරණය ඇත්තේ ය. එය නැත්තේ නොවේ ය යි කියමි. වැලි දු ථේර, යම් සේ එකලා විහරණය විතර විසින් පිරිපුන් වේ ද, එය අසව. මැනවින් මෙනෙහි කරව. කියන්නෙමි යි. වහන්ස, එසේ ය යි ථේර මහණ භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වී ය. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ථේර, කෙසේ නම් එකලා විහරණය විතර විසින් පිරිපුන් වේ ද, ථේර, මෙහි අතීත වූ (ස්කන්ධපඤ්චකයෙහි ) යම් ජන්ඳරාගයෙක් වී නම් එය ප්‍රහීණ ය. අනාගත වූ (ස්කන්ධපඤ්චකයෙහි) යම් ජන්ඳරාගයෙක් වී නම් එය දුරු කරණ ලද්දේ ය. වත්මන් අත්බැව් පිළිලැබුම්හි ඡන්ඳරාගය මැනවින් හික්මවන (=මඩනා) ලද්දේ ය. ථේර, මෙසේ එකලා විහරණය පිරිපුන් වෙයි. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගත වූ ශාස්තෲන් වහන්සේ මෙය වදාරා යළි මෙය ද වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "සියල්ල (ස්කන්ධ ධාතු ආයතන ත්‍රිවිධ භව) මැඩ ලූ, ඒ සියල්ල දන්නා, මනා නුවණ ඇති, ඒ සියලු දහම්හි නො ඇලුනු, ඒ සියල්ල දුරු කළ තෘෂ්ණාක්ෂයසඞ්ඛාත නිවන අරමුණු කොට මිදුනු ඒ මිනිසා එකලා විහරණ ඇත්තේ ය යි මම කියමි යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 438,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "9. 1. 11.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මහාකප්පිනසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "405. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "  අථ ඛො ආයස්මා මහාකප්පිනො යෙන භගවා තෙනුපසඞ්කමි. අද්දසා ඛො භගවා ආයස්මන්තං මහාකප්පිනං දූරතොව ආගච්ඡන්තං. දිස්වාන භික්ඛූ ආමන්තෙසි “පස්සථ නො තුම්හෙ භික්ඛවෙ, එතං භික්ඛුං ආගච්ඡන්තං ඔදාතකං තනුකං තුඞ්ගනාසික”න්ති? “එවං, භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": "“එසො ඛො, භික්ඛවෙ, භික්ඛු මහිද්ධිකො මහානුභාවො. න ච සා සමාපත්ති සුලභරූපා යා තෙන භික්ඛුනා අසමාපන්නපුබ්බා. යස්ස චත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජන්ති තදනුත්තරං බ්රහ්මචරියපරියොසානං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතී”ති. ඉදමවොච භගවා. ඉදං වත්වාන සුගතො අථාපරං එතදවොච සත්ථා:"
                    },
                    {
                        "type": "gatha",
                        "text": "ඛත්තියො සෙට්ඨො ජනෙතස්මිං, \nයෙ ගොත්තපටිසාරිනො,විජ්ජාචරණසම්පන්නො, සො සෙට්ඨො දෙවමානුසෙ."
                    },
                    {
                        "type": "gatha",
                        "text": "දිවා තපති ආදිච්චො, රත්තිමාභාති චන්දිමා,\nසන්නද්ධො ඛත්තියො තපති, ඣායී තපති බ්රාහ්මණො,\nඅථ සබ්බමහොරත්තං{1} බුද්ධො තපති තෙජසා”ති. එකාදසමං."
                    },
                    {
                        "type": "centered",
                        "text": "9. 1. 12.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සහායකසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "406. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": " අථ ඛො ද්වෙ භික්ඛූ සහායකා ආයස්මතො මහාකප්පිනස්ස සද්ධිවිහාරිනො යෙන භගවා තෙනුපසඞ්කමිංසු. අද්දසා ඛො භගවා තෙ භික්ඛූ දූරතොව ආගච්ඡන්තෙ. දිස්වාන භික්ඛූ ආමන්තෙසි “පස්සථ නො තුම්හෙ, භික්ඛවෙ, එතෙ භික්ඛූ සහායකෙ ආගච්ඡන්තෙ කප්පිනස්ස සද්ධිවිහාරිනො”ති? “එවං, භන්තෙ”."
                    },
                    {
                        "type": "paragraph",
                        "text": " “එතෙ ඛො තෙ භික්ඛූ මහිද්ධිකා මහානුභාවා. න ච සා සමාපත්ති සුලභරූපා, යා තෙහි භික්ඛූහි අසමාපන්නපුබ්බා. යස්ස චත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජන්ති තදනුත්තරං බ්රහ්මචරියපරියොසානං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරන්තී”ති. ඉදමවොච භගවා. ඉදං වත්වාන සුගතො අථාපරං එතදවොච සත්ථා:"
                    },
                    {
                        "type": "gatha",
                        "text": "සහායා වතිමෙ භික්ඛූ චිරරත්තං සමෙතිකා,\nසමෙති නෙසං සද්ධම්මො, ධම්මෙ බුද්ධප්පවෙදිතෙ."
                    },
                    {
                        "type": "gatha",
                        "text": "සුවිනීතා කප්පිනෙන ධම්මෙ අරියප්පවෙදිතෙ,\nධාරෙන්ති අන්තිමං දෙහං, ජෙත්වා මාරං සවාහිනින්ති."
                    },
                    {
                        "type": "centered",
                        "text": "වග්ගො පඨමො",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තස්සුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "කොලිතො උපතිස්සො ච ඝටො චාපි පවුච්චති,\nනවො සුජාතො භද්දි ච, විසාඛො නන්දො තිස්සො ච,\nථෙරනාමො ච කප්පිනො, සහායෙන ච ද්වාදසාති."
                    },
                    {
                        "type": "centered",
                        "text": "භික්ඛුසංයුත්තං සමත්තං.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**නිදානවග්ගස්ස සංයුත්තුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "අභිසමයො ධාතු ච අනමතග්ගෙන කස්සපො,\nලාභසක්කාරරාහුල ලක්ඛණොපම්මභික්ඛුහි,\nනිදානවග්ගො දුතියො පූරිතොති පවුච්චතීති.{2}"
                    },
                    {
                        "type": "centered",
                        "text": "නිදානවග්ගො නිට්ඨිතො.{3}",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අහොරත්තිං - සී. 1, 2 මඡසං, PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. උද්දානගාථායො පන ස්යාමමරම්ම සීහල පොත්ථකෙසු විසදිසාව දිස්සන්ති."
                    },
                    {
                        "type": "footnote",
                        "text": "3. දිස්සතෙයං අතිරෙක ගාථා - සී 1, 2“දසබල සෙලප්පභවා නිබ්බාණමහාසමුද්දපරියන්තා,අට්ඨංගමග්ගසලිලා ජිනවචනනදී චිරං වහතූ”ති"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "9. 1. 11.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මහාකප්‌පින සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "405. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි ආයුෂ්මත් මහාකප්පින තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. භාග්‍යවතුන් වහන්සේ එන්නා වූ ආයුෂ්මත් මහාකප්පින තෙරුන් දුර දී ම දුටු සේක. දැක භික්ෂූන් ඇමතූ සේක: මහණෙනි, තෙපි එන්නා වූ සුදු සිහින් උස් නැහැයක් ඇති තෙල මහණ දකිවු ද? වහන්ස, එසේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, තෙල මහණ තෙමේ මහත් ඍද්ධි ඇත්තෙකි. මහත් ආනුභාව ඇත්තෙකි. ඒ මහණහු විසින් යම් සමවතක් නො සමවන් විරූ නම් එබඳු සමවතක් නො ම සුලබ ය. කුලපුත්‍රයෝ යමක් පිණිස මැනවින් ගිහිගෙන් නික්ම පැවිද්දට පැමිණෙත් නම් මගබඹසර අවසන් කොට ඇති අනුත්තර වූ ඒ අර්‍හත්ත්වය මේ අත්බැව්හි ම තෙමේ ම විශිෂ්ටඥානයෙන් දැන පසක් කොට පැමිණ වෙසේ ය යි. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගත වූ ශාස්තෲන් වහන්සේ මෙය වදාරා වැලි මෙය ද වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "යම් කෙනෙක් ග්‍රෝත්‍රය ප්‍රතිඥා කෙරත් නම් මේ ප්‍රජාව කෙරෙහි ක්ෂත්‍රියයා ශ්‍රේෂ්ඨ ය. අෂ්ටවිද්‍යා පසළොස්චරණ ධර්‍මයන්ගෙන් සමන්විත වූ ඒ භාග්‍යවතුන් වහන්සේ දෙවිමිනිසුන් කෙරෙහි ශ්‍රේෂ්ඨහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "හිරු දහවල් බබලයි. සඳු රෑ බබල යි. ක්ෂත්‍රිය තෙමේ සන්නාහ සන්නද්ධ වූයේ බබලයි. රහත් බමුණු තෙමේ ධ්‍යාන කරනේ බබලයි. වැලි, බුදුරජානන් වහන්සේ මුළු රෑ දාවල් තෙදින් බබලති යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "9. 1. 12.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සහායක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "406.** සැවැත්නුවර-**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි ආයුෂ්මත් මහාකප්පින තෙරුන්ගේ සද්ධිවිහාරික වූ යහලු භික්ෂූහූ දෙනමක් භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. භාග්‍යවතුන් වහන්සේ එන්නා වූ ඔවුන් දුරදී ම දුටු සේක. දැක භික්ෂූන් ඇමැතූ සේක: මහණෙනි, තෙපි මහාකප්පිනගේ සද්ධිවිහාරික වූ තෙල එන යහලු භික්ෂූන් දෙනම දකිවු ද? වහන්ස, එසේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, තෙල භික්ෂූහූ මහත් ඍද්ධි ඇතියහ. මහත් ආනුභාව ඇතියහ. ඒ භික්ෂූන් විසින් යම් සමවතක් නො සමවන් විරූ නම් එවැනි සමවතක් නො ම සුලබ ය. කුලපුත්‍රයෝ යමක් පිණිස මැනවින් ගිහිගෙන් නික්ම පැවිද්දට පැමිණෙද්ද, මගබඹසර අවසන් කොට ඇති ඒ අනුත්තර අර්‍හත්ත්වය මේ අත්බැව්හි ම තෙමේ ම විශිෂ්ටඥානයෙන් දැන පසක් කොට පැමිණ වෙසෙති යි. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගත වූ ශාස්තෲන් වහන්සේ මෙය වදාරා වැලි මෙය ද වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මේ යහලු භික්ෂූහු දිගුකලක් සමෙතිකා (මනා සේ සැසඳීම් වසයෙන් සම වූ සම්මදිට්ඨි ආදි ලබ්ධි) ඇතියෝ ම ය. (එහෙයින් ම දැන්) බුදුරජුන් විසින් පැවසූ ධර්‍ම්යෙහි ඔවුන්ගේ ප්‍රතිපත්ශාසන ධර්‍ම්ය සම වේ. (හොබනේ වේ.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආර්‍ය්‍ය බුදුරජුන් දෙසූ ධර්මයෙහි කප්පින විසින් මැනැවින් හික්මවන ලද ඔහු සේනා සහිත මරු දිනා අවසන් සිරුර දරත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 11,
                        "text": "පළමුවන වර්ගය යී.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "__tester__"
                    },
                    {
                        "type": "unindented",
                        "text": "__tester__"
                    },
                    {
                        "type": "paragraph",
                        "text": ""
                    },
                    {
                        "type": "paragraph",
                        "text": ""
                    },
                    {
                        "type": "paragraph",
                        "text": ""
                    },
                    {
                        "type": "paragraph",
                        "text": "end"
                    }
                ],
                "footnotes": []
            }
        }
    ]
}