[
    {
        "filename": "sn-ndnv-4",
        "bookId": 17,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "298"
            },
            {
                "type": "heading",
                "text": "4. කස්සපසංයුත්තං",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. කස්සපවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "4. 1. 1",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සන්තුට්ඨිසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "284. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "සන්තුට්ඨොයං භික්ඛවෙ, කස්සපො ඉතරීතරෙන චීවරෙන, ඉතරීතරචීවරසන්තුට්ඨියා ච වණ්ණවාදී, න ච චීවරහෙතු අනෙසනං අප්පතිරූපං ආපජ්ජති, අලද්ධා ච චීවරං න පරිතස්සති. ලද්ධා ච චීවරං අගධිතො{1 අගථිතො - සීමු. සී1, 2.} අමුච්ඡිතො අනජ්ඣාපන්නො ආදිනවදස්සාවී නිස්සරණපඤ්ඤො පරිභුඤ්ජති."
            },
            {
                "type": "paragraph",
                "text": "සන්තුට්ඨොයං භික්ඛවෙ, කස්සපො ඉතරීතරෙන පිණ්ඩපාතෙන, ඉතරීතරපිණ්ඩපාතසන්තුට්ඨියා ච වණ්ණවාදී. න ච පිණ්ඩපාතහෙතු අනෙසනං අප්පතිරූපං ආපජ්ජති, අලද්ධා ච පිණ්ඩපාතං න පරිතස්සති, ලද්ධා ච පිණ්ඩපාතං අගධිතො{2 අගථිතො - සීමු. සී1, 2.} අමුච්ඡිතො අනජ්ඣාපන්නො ආදිනවදස්සාවී නිස්සරණපඤ්ඤො පරිභුඤ්ජති."
            },
            {
                "type": "paragraph",
                "text": "සන්තුට්ඨොයං භික්ඛවෙ, කස්සපො ඉතරීතරෙන සෙනාසනෙන, ඉතරීතරසෙනාසනසන්තුට්ඨියා ච වණ්ණවාදී, න ච සෙනාසන හෙතු අනෙසනං අප්පතිරූපං ආපජ්ජති. අලද්ධා ච සෙනාසනං න පරිතස්සති. ලද්ධා ච සෙනාසනං අගධිතො{3 අගථිතො - සීමු. සී1, 2.} අමුච්ඡිතො අනජ්ඣාපන්නො ආදීනවදස්සාවී නිස්සරණ පඤ්ඤො පරිභුඤ්ජති."
            },
            {
                "type": "paragraph",
                "text": "සන්තුට්ඨොයං භික්ඛවෙ, කස්සපො ඉතරීතරෙන ගිලානපච්චයභෙසජ්ජපරික්ඛාරෙන, ඉතරීතරගිලානපච්චයභෙසජ්ජපරික්ඛාරසන්තුට්ඨියා ච වණ්ණවාදී, න ච ගිලානපච්චයභෙසජ්ජපරික්ඛාරහෙතු අනෙසනං අප්පතිරූපං ආපජ්ජති. අලද්ධා ච ගිලානපච්චයභෙසජ්ජපරික්ඛාරං න පරිතස්සති. ලද්ධා ච ගිලානපච්චයභෙසජ්ජපරික්ඛාරං අගධිතො, අමුච්ඡිතො අනජ්ඣාපන්නො ආදීනවදස්සාවී නිස්සරණපඤ්ඤො පරිභුඤ්ජති."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ භික්ඛවෙ, එවං සික්ඛිතබ්බං, සන්තුට්ඨා භවිස්සාම ඉතරීතරෙන චීවරෙන, ඉතරීතරචීවරසන්තුට්ඨියා වණ්ණවාදිනො. න ච චීවරහෙතු අනෙසනං අප්පතිරූපං ආපජ්ජිස්සාම. අලද්ධා ච චීවරං න ච පරිතස්සිස්සාමං{4 න ච පරිතස්සිස්සාම - මඡසං.} ලද්ධා ච චීවරං අගධිතා අමුච්ඡිතා අනජ්ඣාපන්නා ආදීනවදස්සාවිනො නිස්සරණපඤ්ඤා පරිභුඤ්ජිස්සාම. (එවං සබ්බං කත්තබ්බං).{5 දිස්සතෙයං අන්තරිතපාඨො සබ්බත්ථ. තථාපි න යුජ්ජති විය ඩායති.} සන්තුට්ඨා භවිස්සාම ඉතරීතරෙන පිණ්ඩපාතෙන -පෙ- සන්තුට්ඨා භවිස්සාම ඉතරීතරෙන සෙනාසනෙන -පෙ- සන්තුට්ඨා භවිස්සාම ඉතරීතරෙන ගිලානපච්චයභෙසජ්ජපරික්ඛාරෙන, ඉතරීතරගිලානපච්චයභෙසජ්ජපරික්ඛාරසන්තුට්ඨියා ච වණ්ණවාදිනො. න ච ගිලානපච්චයභෙසජ්ජපරික්ඛාරහෙතු අනෙසනං අප්පතිරූපං ආපජ්ජිස්සාම. අලද්ධා ච ගිලානපච්චයභෙසජ්ජපරික්ඛාරං න පරිතස්සිස්සාම. ලද්ධා ච ගිලානපච්චයභෙසජ්ජපරික්ඛාරං අගධිතා අමුච්ඡිතා අනජ්ඣාපන්නා ආදීනවදස්සාවිනො නිස්සරණපඤ්ඤා පරිභුඤ්ජිස්සාමාති. එවං හි ඛො භික්ඛවෙ සික්ඛිතබ්බං."
            },
            {
                "type": "paragraph",
                "text": "කස්සපෙන වා හි වො භික්ඛවෙ, ඔවදිස්සාමි යො වා පනස්ස{6 යො වා පන - සීමු.} කස්සපසදිසො ඔවදිතෙහි ච පන වො තථත්තාය පටිපජ්ජිතබ්බන්ති."
            },
            {
                "type": "page-break",
                "text": "300"
            },
            {
                "type": "centered",
                "text": "4. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනොත්තාපීසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "285. එවං මෙ සුතං, එකං සමයං ආයස්මා ච මහාකස්සපො ආයස්මා ච සාරිපුත්තො බාරාණසියං විහරන්ති ඉසිපතනෙ මිගදායෙ. අථ ඛො ආයස්මා සාරිපුත්තො සායණ්හසමයං පටිසල්ලානා වුට්ඨිතො යෙනායස්මා මහාකස්සපො තෙනුපසංකමි. උපසඞ්කමිත්වා ආයස්මතා මහාකස්සපෙන සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා සාරිපුත්තො ආයස්මන්තං මහාකස්සපං එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "“වුච්චති හිදං ආවුසො කස්සප, අනාතාපී අනොත්තාපී;{1 අනොත්තාප්පී - මඡසං.} අභබ්බො සම්බොධාය අභබ්බො නිබ්බානාය, අභබ්බො අනුත්තරස්ස යොගක්ඛෙමස්ස අධිගමාය, ආතාපී ච ඔත්තාපී ච භබ්බො සම්බොධාය, භබ්බො නිබ්බානාය, භබ්බො අනුත්තරස්ස යොගක්ඛෙමස්ස අධිගමායා”ති."
            },
            {
                "type": "paragraph",
                "text": "“කිත්තාවතා නු ඛො ආවුසො, අනාතාපී හොති අනොත්තාපී{2 අනොත්තාප්පී - මඡසං.} අභබ්බො සම්බොධාය, අභබ්බො නිබ්බානාය, අභබ්බො අනුත්තරස්ස යොගක්ඛෙමස්ස අධිගමාය? කිත්තාවතා ච පනාවුසො, ආතාපී හොති ඔත්තාපී භබ්බො සම්බොධාය, භබ්බො නිබ්බානාය, භබ්බො අනුත්තරස්ස යොගක්ඛෙමස්ස අධිගමායා”ති?"
            },
            {
                "type": "paragraph",
                "text": "ඉධාවුසො, භික්ඛු අනුප්පන්නා මෙ පාපකා අකුසලා ධම්මා උප්පජ්ජමානා අනත්ථාය සංවත්තෙය්යුන්ති න ආතප්පං කරොති. උප්පන්නා මෙ පාපකා අකුසලා ධම්මා අප්පහීයමානා අනත්ථාය සංවත්තෙය්යුන්ති න ආතප්පං කරොති. අනුප්පන්නා මෙ කුසලා ධම්මා නූප්පජ්ජමානා{3 අනුප්පජ්ජමානා - ස්යා. සී 2.} අනත්ථාය සංවත්තෙය්යුන්ති න ආතප්පං කරොති. උප්පන්නා මෙ කුසලා ධම්මා නිරුජ්ඣමානා අනත්ථාය සංවත්තෙය්යුන්ති න ආතප්පං කරොති. එවං ඛො ආවුසො, අනාතාපී හොති."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්චාවුසො, අනොත්තාපී{4 අනොත්තාප්පී - මඡසං.} හොති?"
            },
            {
                "type": "paragraph",
                "text": "ඉධාවුසො, භික්ඛු අනුප්පන්නා මෙ පාපකා අකුසලා ධම්මා උප්පජ්ජමානා අනත්ථාය සංවත්තෙය්යුන්ති න ඔත්තපති.{5 ඔත්තප්පති - මඡසං. PTS.} උප්පන්නා මෙ පාපකා අකුසලා ධම්මා අප්පහීයමානා අනත්ථාය සංවත්තෙය්යුන්ති න ඔත්තපති.{6 ඔත්තප්පති - මඡසං. PTS.} අනුප්පන්නා මෙ කුසලා ධම්මා නූප්පජ්ජමානා{7 අනුප්පජ්ජමානා - ස්යා. සී 2.} අනත්ථාය සංවත්තෙය්යුන්ති න ඔත්තපති.{8 ඔත්තප්පති - මඡසං. PTS.} උප්පන්නා මෙ කුසලා ධම්මා නිරුජ්ඣමානා අනත්ථාය සංවත්තෙය්යුන්ති න ඔත්තපති.{9 ඔත්තප්පති - මඡසං. PTS.} එවං ඛො ආවුසො අනොත්තාපී{10 අනොත්තාප්පී - මඡසං.} හොති."
            },
            {
                "type": "paragraph",
                "text": "එවං ඛො ආවුසො, අනාතාපී අනොත්තාපී{11 අනොත්තාප්පී - මඡසං.} අභබ්බො සම්බොධාය, අභබ්බො නිබ්බානාය, අභබ්බො අනුත්තරස්ස යොගක්ඛෙමස්ස අධිගමාය."
            },
            {
                "type": "page-break",
                "text": "302"
            },
            {
                "type": "paragraph",
                "text": "කථඤ්චාවුසො, ආතාපී හොති?"
            },
            {
                "type": "paragraph",
                "text": "ඉධාවුසො භික්ඛු අනුප්පන්නා මෙ පාපකා අකුසලා ධම්මා උප්පජ්ජමානා අනත්ථාය සංවත්තෙය්යුන්ති ආතප්පං කරොති. උප්පන්නා මෙ පාපකා අකුසලා ධම්මා අප්පහීයමානා අනත්ථාය සංවත්තෙය්යුන්ති ආතප්පං කරොති. අනුප්පන්නා මෙ කුසලා ධම්මා නූප්පජ්ජමානා අනත්ථාය සංවත්තෙය්යුන්ති ආතප්පං කරොති. උප්පන්නා මෙ කුසලා ධම්මා නිරුජ්ඣමානා අනත්ථාය සංවත්තෙය්යුන්ති ආතප්පං කරොති. එවං ඛො ආවුසො, ආතාපී හොති."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්චාවුසො, ඔත්තාපී{1 ඔත්තප්පී - මඡසං.} හොති?"
            },
            {
                "type": "paragraph",
                "text": "ඉධාවුසො, භික්ඛු අනුප්පන්නා මෙ පාපකා අකුසලා ධම්මා උප්පජ්ජමානා අනත්ථාය සංවත්තෙය්යුන්ති ඔත්තපති. උප්පන්නා මෙ පාපකා අකුසලා ධම්මා අප්පහීයමානා අනත්ථාය සංවත්තෙය්යුන්ති ඔත්තපති. අනුප්පන්නා මෙ කුසලා ධම්මා නූප්පජ්ජමානා අනත්ථාය සංවත්තෙය්යුන්ති ඔත්තපති. උප්පන්නා මෙ කුසලා ධම්මා නිරුජ්ඣමානා අනත්ථාය සංවත්තෙය්යුන්ති ඔත්තපති. එවං ඛො ආවුසො, ඔත්තාපී{2 ඔත්තප්පී - මඡසං.} හොති."
            },
            {
                "type": "paragraph",
                "text": "එවං ඛො ආවුසො, ආතාපී ඔත්තාපී{3 ඔත්තප්පී - මඡසං.} භබ්බො සම්බොධාය, භබ්බො නිබ්බානාය, භබ්බො අනුත්තරස්ස යොගක්ඛෙමස්ස අධිගමායාති."
            },
            {
                "type": "centered",
                "text": "4. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "චන්දූපමසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "286. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "චන්දූපමා භික්ඛවෙ, කුලානි උපසඞ්කමථ අපකස්සෙව කායං, අපකස්ස{4 අපකස්සෙව - සීමු.} චිත්තං, නිච්චනවකා කුලෙසු{5 නිච්චං නව්යා කුලෙසු - සී 2.} අප්පගබ්භා. සෙය්යථාපි භික්ඛවෙ, පුරිසො ජරූදපානං වා ඔලොකෙය්ය පබ්බතවිසමං වා නදීවිදුග්ගං වා අපකස්සෙව කායං, අපකස්ස චිත්තං, එවමෙව ඛො භික්ඛවෙ, චන්දූපමා කුලානි උපසඞ්කමථ අපකස්සෙව කායං, අපකස්ස{6 අපකස්සෙව - සීමු.} චිත්තං, නිච්චනවකා කුලෙසු අප්පගබ්භා. කස්සපො භික්ඛවෙ, චන්දූපමො කුලානි උපසඞ්කමති අපකස්සෙව කායං අපකස්ස{7 අපකස්සෙව - සීමු.} චිත්තං, නිච්චනවකො කුලෙසු අප්පගබ්භො."
            },
            {
                "type": "paragraph",
                "text": "තං කිම්මඤ්ඤථ භික්ඛවෙ, කථංරූපො භික්ඛු අරහති කුලානි උපසඞ්කමිතුන්ති?"
            },
            {
                "type": "paragraph",
                "text": "“භගවම්මූලකා නො භන්තෙ ධම්මා, භගවන්නත්තිකා, භගවම්පටිසරණා. සාධු වත භන්තෙ, භගවන්තඤ්ඤෙව පටිභාතු එතස්ස භාසිතස්ස අත්ථො. භගවතො සුත්වා භික්ඛූ ධාරෙස්සන්තී”ති."
            },
            {
                "type": "page-break",
                "text": "304"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා ආකාසෙ පාණිං චාලෙසි. සෙය්යථාපි භික්ඛවෙ, අයං ආකාසෙ පාණි න සජ්ජති, න ගය්හති, න බජ්ඣති, එවමෙව ඛො භික්ඛවෙ, යස්ස කස්සචි භික්ඛුනො කුලානි උපසඞ්කමතො කුලෙසු චිත්තං න සජ්ජති, න ගය්හති න බජ්ඣති “ලභන්තු ලාභකාමා, පුඤ්ඤකාමා කරොන්තු පන පුඤ්ඤානී”ති. යථා සකෙන ලාභෙන අත්තමනො හොති සුමනො, එවං පරෙසං ලාභෙන අත්තමනො හොති සුමනො. එවරූපො ඛො භික්ඛවෙ, භික්ඛු අරහති කුලානි උපසඞ්කමිතුං. කස්සපස්ස භික්ඛවෙ, කුලානි උපසඞ්කමතො කුලෙසු චිත්තං න සජ්ජති, න ගය්හති, න බජ්ඣති “ලභන්තු ලාභකාමා, පුඤ්ඤකාමා කරොන්තු පුඤ්ඤානී”ති. යථා සකෙන ලාභෙන අත්තමනො හොති සුමනො, එවං පරෙසං ලාභෙන අත්තමනො හොති සුමනො. එවරූපො ඛො භික්ඛවෙ, භික්ඛු අරහති කුලානි උපසඞ්කමිතුං."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤථ භික්ඛවෙ, කථංරූපස්ස භික්ඛුනො අපරිසුද්ධා ධම්මදෙසනා හොති, කථංරූපස්ස භික්ඛුනො පරිසුද්ධා ධම්මදෙසනා හොතීති? “භගවම්මූලකා නො භන්තෙ ධම්මා, භගවන්නෙත්තිකා භගවම්පටිසරණා. සාධු වත භන්තෙ, භගවන්තඤ්ඤෙව පටිභාතු එතස්ස භාසිතස්ස අත්ථො. භගවතො සුත්වා භික්ඛූ ධාරෙස්සන්තී”ති."
            },
            {
                "type": "paragraph",
                "text": "තෙන හි භික්ඛවෙ සුණාථ, සාධුකං මනසි කරොථ. භාසිස්සාමීති. එවං භන්තෙති ඛො තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "යො හි කොචි භික්ඛවෙ, භික්ඛු එවඤ්චිත්තො පරෙසං ධම්මං දෙසෙති: “අහො වත මෙ ධම්මං සුණෙය්යුං, සුත්වා ච පන ධම්මං පසීදෙය්යුං, පසන්නා ච මෙ පසන්නාකාරං කරෙය්යු”න්ති. එවරූපස්ස ඛො භික්ඛවෙ, භික්ඛුනො අපරිසුද්ධා ධම්මදෙසනා හොති."
            },
            {
                "type": "paragraph",
                "text": "යො ච ඛො භික්ඛවෙ, භික්ඛු එවඤ්චිත්තො පරෙසං ධම්මං දෙසෙති: “ස්වාක්ඛාතො භගවතා ධම්මො සන්දිට්ඨිකො අකාලිකො එහිපස්සිකො ඔපනයිකො පච්චත්තං වෙදිතබ්බො විඤ්ඤූහීති. අහො වත මෙ ධම්මං සුණෙය්යුං, සුත්වා ච පන ධම්මං ආජානෙය්යුං, ආජානිත්වා ච පන තථත්තාය පටිපජ්ජෙය්යු”න්ති. ඉති ධම්මසුධම්මතං පටිච්ච පරෙසං ධම්මං දෙසෙති. කාරුඤ්ඤං පටිච්ච පරෙසං ධම්මං දෙසෙති. අනුද්දයං පටිච්ච පරෙසං ධම්මං දෙසෙති. අනුකම්පං උපාදාය පරෙසං ධම්මං දෙසෙති. එවරූපස්ස ඛො භික්ඛවෙ, භික්ඛුනො පරිසුද්ධා ධම්මදෙසනා හොති."
            },
            {
                "type": "paragraph",
                "text": "කස්සපො භික්ඛවෙ, එවංචිත්තො පරෙසං ධම්මං දෙසෙති: “ස්වාක්ඛාතො භගවතා ධම්මො සන්දිට්ඨිකො අකාලිකො එහිපස්සිකො ඔපනයිකො පච්චත්තං වෙදිතබ්බො විඤ්ඤූහීති. අහොවත මෙ ධම්මං සුණෙය්යුං, සුත්වා ච පන ධම්මං ආජානෙය්යුං, ආජානිත්වා ච පන තථත්තාය පටිපජ්ජෙය්යු”න්ති. ඉති ධම්මසුධම්මතං පටිච්ච පරෙසං ධම්මං දෙසෙති. කාරුඤ්ඤං පටිච්ච පරෙසං ධම්මං දෙසෙති. අනුද්දයං පටිච්ච පරෙසං ධම්මං දෙසෙති. අනුකම්පං උපාදාය පරෙසං ධම්මං දෙසෙති.{1 කාරුඤ්ඤං පටිච්ච අනුද්දයං පටිච්ච අනුකම්පං උපාදාය පරෙසං ධම්මං දෙසෙති - මඡසං.}"
            },
            {
                "type": "paragraph",
                "text": "කස්සපෙන වා හි වො භික්ඛවෙ, ඔවදිස්සාමි, යො වා පනස්ස කස්සපසදිසො. ඔවදිතෙහි ච පන වො තථත්තාය පටිපජ්ජිතබ්බන්ති."
            },
            {
                "type": "page-break",
                "text": "306"
            },
            {
                "type": "centered",
                "text": "4. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කුලූපගසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "287. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤථ භික්ඛවෙ, කථංරූපො භික්ඛු අරහති කුලූපගො හොතුං, කථංරූපො භික්ඛු අරහති න කුලූපගො{1 කුලූපකො - මඡසං. ස්යා.} හොතුන්ති? “භගවම්මූලකා නො භන්තෙ, ධම්මා -පෙ- භගවතො සුත්වා භික්ඛූ ධාරෙස්සන්තී”ති. -පෙ- භගවා එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "යො හි කොචි භික්ඛවෙ, භික්ඛු එවංචිත්තො කුලානි උපසඞ්කමති. “දෙන්තුයෙව මෙ, මා නාදංසු.{2 මා අදංසු - සීමු. සී 1, 2.} බහුඤ්ඤෙව{3 සුබහුඤ්ඤෙව - සී 1, 2. බහුකඤ්ඤෙව - මඡසං. ස්යා. PTS.} මෙ දෙන්තු මා ථොකං. පණීතඤ්ඤෙව මෙ දෙන්තු මා ලූඛං. සීඝඤ්ඤෙව මෙ දෙන්තු මා දන්ධං. සක්කච්චඤ්ඤෙව මෙ දෙන්තු මා අසක්කච්ච”න්ති. තස්ස චෙ භික්ඛවෙ, භික්ඛුනො එවංචිත්තස්ස කුලානි උපසඞ්කමතො න දෙන්ති, තෙන භික්ඛු සන්දීයති. සො තතොනිදානං දුක්ඛං දොමනස්සං පටිසංවෙදයති. ථොකං දෙන්ති නො බහුකං, තෙන භික්ඛු සන්දීයති. සො තතොනිදානං දුක්ඛං දොමනස්සං පටිසංවෙදයති. ලූඛං දෙන්ති නො පණීතං, තෙන භික්ඛු සන්දීයති. සො තතොනිදානං දුක්ඛං දොමනස්සං පටිසංවෙදයති. දන්ධං දෙන්ති නො සීඝං, තෙන භික්ඛු සන්දීයති. සො තතොනිදානං දුක්ඛං දොමනස්සං පටිසංවෙදයති. තෙන භික්ඛු සන්දීයති. සො තතොනිදානං දුක්ඛං දොමනස්සං පටිසංවෙදයති. අසක්කච්චං දෙන්ති, නො සක්කච්චං. තෙන භික්ඛු සන්දීයති. සො තතොනිදානං දුක්ඛං දොමනස්සං පටිසංවෙදයති. එවරූපො ඛො භික්ඛවෙ, භික්ඛු න අරහති කූලූපගො හොතුං."
            },
            {
                "type": "paragraph",
                "text": "යො ච ඛො භික්ඛවෙ, භික්ඛු එවංචිත්තො කුලානි උපසඞ්කමති “තං කුතෙත්ථ ලබ්භා පරකුලෙසු – දෙන්තු යෙව මෙ, මා නාදංසු. බහුඤ්ඤෙව මෙ දෙන්තු මා ථොකං. පණීතඤ්ඤෙව මෙ දෙන්තු මා ලූඛං. සීඝඤ්ඤෙව මෙ දෙන්තු මා දන්ධං. සක්කච්චඤ්ඤෙව මෙ දෙන්තු මා අසක්කච්ච”න්ති. තස්ස මෙ භික්ඛවෙ, භික්ඛුනො එවංචිත්තස්ස කුලානි උපසඞ්කමතො න දෙන්ති. තෙන භික්ඛු න සන්දීයති. සො න තතොනිදානං දුක්ඛං දොමනස්සං පටිසංවෙදයති. ථොකං දෙන්ති නො බහුකං, තෙන භික්ඛු න සන්දීයති. සො න තතොනිදානං දුක්ඛං දොමනස්සං පටිසංවෙදයති. ලූඛං දෙන්ති නො පණීතං, තෙන භික්ඛු න සන්දීයති. සො න තතොනිදානං දුක්ඛං දොමනස්සං පටිසංවෙදයති. දන්ධං දෙන්ති නො සීඝං, තෙන භික්ඛු න සන්දීයති. සො න තතොනිදානං දුක්ඛං දොමනස්සං පටිසංවෙදයති. අසක්කච්චං දෙන්ති නො සක්කච්චං, තෙන භික්ඛු න සන්දීයති. සො න තතොනිදානං දුක්ඛං දොමනස්සං පටිසංවෙදයති. එවරූපො ඛො භික්ඛවෙ, භික්ඛු අරහති කුලූපගො හොතුං."
            },
            {
                "type": "paragraph",
                "text": "කස්සපො භික්ඛවෙ, එවංචිත්තො කුලානි උපසඞ්කමති: “තං කුතෙත්ථ ලබ්භා පරකුලෙසු – දෙන්තු යෙව මෙ, මා නාදංසු, බහුකඤ්ඤෙව මෙ දෙන්තු මා ථොකං, පණීතඤ්ඤෙව මෙ දෙන්තු, මා ලූඛං. සීඝඤ්ඤෙව මෙ දෙන්තු මා දන්ධං, සක්කච්චඤ්ඤෙව මෙ දෙන්තු,” මා අසක්කච්චන්ති."
            },
            {
                "type": "page-break",
                "text": "308"
            },
            {
                "type": "paragraph",
                "text": "තස්ස චෙ භික්ඛවෙ, කස්සපස්ස එවංචිත්තස්ස කුලානි උපසඞ්කමතො න දෙන්ති, තෙන කස්සපො න සන්දීයති. සො න තතොනිදානං දුක්ඛං දොමනස්සං පටිසංවෙදයති. ථොකං දෙන්ති නො බහුකං, තෙන කස්සපො න සන්දීයති. සො න තතොනිදානං දුක්ඛං දොමනස්සං පටිසංවෙදයති. ලූඛං දෙන්ති නො පණීතං, තෙන කස්සපො න සන්දීයති. සො න තතොනිදානං දුක්ඛං දොමනස්සං පටිසංවෙදයති. දන්ධං දෙන්ති නො සීඝං, තෙන කස්සපො න සන්දීයති. සො න තතොනිදානං දුක්ඛං දොමනස්සං පටිසංවෙදයති. අසක්කච්චං දෙන්ති නො සක්කච්චං, තෙන කස්සපො න සන්දීයති. සො න තතොනිදානං දුක්ඛං දොමනස්සං පටිසංවෙදයති."
            },
            {
                "type": "paragraph",
                "text": "කස්සපෙන වා හි වො තෙ භික්ඛවෙ, ඔවදිස්සාමි, යො වා පනස්ස කස්සපසදිසො. ඔවදිතෙහි ච පන වො තෙ තථත්තාය පටිපජ්ජිතබ්බන්ති."
            },
            {
                "type": "centered",
                "text": "4. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ජිණ්ණසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "288. එවං මෙ සුතං: එකං සමයං භගවා රාජගහෙ විහරති වෙළුවන කලන්දක නිවාපෙ."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා මහාකස්සපො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො ආයස්මන්තං මහාකස්සපං භගවා එතදවොච: ජිණ්ණොසිදානි ත්වං කස්සප. ගරුකානි ඛො තෙ{1 ගරුකානි ච තෙ - මඡසං. ස්යා. PTS.} ඉමානි සාණානි පංසුකූලානි නිබ්බසනානි. තස්මාතිහ ත්වං කස්සප, ගහපතිකානි චෙව චීවරානි ධාරෙහි, නිමන්තණෙසු{2 නිමන්තනානි - මඡසං. ස්යා. PTS.} ච භුඤ්ජාහි, මමඤ්ච සන්තිකෙ විහරාහීති."
            },
            {
                "type": "paragraph",
                "text": "අහං ඛො භන්තෙ, දීඝරත්තං ආරඤ්ඤකො චෙව ආරඤ්ඤකත්තස්ස ච වණ්ණවාදී, පිණ්ඩපාතිකො චෙව පිණ්ඩපාතිකත්තස්ස ච වණ්ණවාදී, පංසුකූලිකො චෙව පංසුකූලිකත්තස්ස ච වණ්ණවාදී, තෙචීවරිකො චෙව තෙචීවරිකත්තස්ස ච වණ්ණවාදී, අප්පිච්ඡො චෙව අප්පිච්ඡතාය ච වණ්ණවාදී, සන්තුට්ඨො චෙව සන්තුට්ඨියා ච වණ්ණවාදී, පවිවිත්තො චෙව පවිවෙකස්ස ච වණ්ණවාදී, අසංසට්ඨො චෙව අසංසග්ගස්ස ච වණ්ණවාදී, ආරද්ධවීරියො චෙව වීරියාරම්භස්ස ච වණ්ණවාදී."
            },
            {
                "type": "paragraph",
                "text": "කිම්පන ත්වං කස්සප, අත්ථවසං සම්පස්සමානො දීඝරත්තං ආරඤ්ඤකො චෙව ආරඤ්ඤකත්තස්ස ච වණ්ණවාදී, (එවං පෙය්යාලො.) පිණ්ඩපාතිකො චෙව -පෙ- පංසුකූලිකො චෙව -පෙ- තෙචීවරිකො චෙව -පෙ- අප්පිච්ඡො චෙව -පෙ- සන්තුට්ඨො චෙව -පෙ- පවිවිත්තො චෙව -පෙ- අසංසට්ඨො චෙව -පෙ- ආරද්ධවීරියො චෙව වීරියාරම්භස්ස ච වණ්ණවාදීති?"
            },
            {
                "type": "page-break",
                "text": "310"
            },
            {
                "type": "paragraph",
                "text": "“ද්වෙ ඛොහං භන්තෙ, අත්ථවසෙ සම්පස්සමානො දීඝරත්තං ආරඤ්ඤකො චෙව ආරඤ්ඤකත්තස්ස ච වණ්ණවාදී -පෙ- පිණ්ඩපාතිකො චෙව -පෙ- පංසුකූලිකො චෙව -පෙ- තෙචීවරිකො චෙව -පෙ- අප්පිච්ඡො චෙව -පෙ- සන්තුට්ඨො චෙව -පෙ- පවිවිත්තො චෙව -පෙ- අසංසට්ඨො චෙව -පෙ- ආරද්ධවිරියො චෙව වීරියාරම්භස්ස ච වණ්ණවාදී: අත්තනා ච දිට්ඨධම්මසුඛවිහාරං සම්පස්සමානො - පච්ඡිමඤ්චජනතං අනුකම්පමානො ‘අප්පෙවනාම පච්ඡිමා ජනතා දිට්ඨානුගතිං ආපජ්ජෙය්ය.{1 ආපජ්ජෙය්යුං - මඡසං.} යෙ කිර තෙ අහෙසුං බුද්ධානුබුද්ධසාවකා, තෙ දීඝරත්තං ආරඤ්ඤකා චෙව අහෙසුං ආරඤ්ඤකත්තස්ස ච වණ්ණවාදිනො, පිණ්ඩපාතිකා චෙව අහෙසුං -පෙ- පංසුකූලිකා චෙව අහෙසුං -පෙ- තෙචීවරිකා චෙව අහෙසුං -පෙ- අප්පිච්ඡා චෙව අහෙසුං -පෙ- සන්තුට්ඨා චෙව අහෙසුං -පෙ- පවිවිත්තා චෙව අහෙසුං -පෙ- අසංසට්ඨා චෙව අහෙසුං -පෙ- ආරද්ධවිරියා චෙව අහෙසුං විරියාරම්භස්ස ච වණ්ණවාදිනොති. තෙ තථත්තාය පටිපජ්ජිස්සන්ති. තෙසං තං භවිස්සති දීඝරත්තං හිතාය සුඛාය.”"
            },
            {
                "type": "paragraph",
                "text": "ඉමෙ ඛොහං භන්තෙ, ද්වෙ අත්ථවසෙ සම්පස්සමානො දීඝරත්තං ආරඤ්ඤකො චෙව ආරඤ්ඤකත්තස්ස ච වණ්ණවාදී, පිණ්ඩපාතිකො චෙව -පෙ- පංසුකූලිකො චෙව -පෙ- තෙචීවරිකො චෙව -පෙ- අප්පිච්ඡො චෙව -පෙ- සන්තුට්ඨො චෙව -පෙ- පවිවිත්තො චෙව -පෙ- අසංසට්ඨො චෙව -පෙ- ආරද්ධවිරියො චෙව විරියාරම්භස්ස ච වණ්ණවාදීති."
            },
            {
                "type": "paragraph",
                "text": "සාධු, සාධු, කස්සප, බහුජනහිතාය කිර ත්වං කස්සප, පටිපන්නො බහුජනසුඛාය ලොකානුකම්පාය අත්ථාය හිතාය සුඛාය දෙවමනුස්සානං. තස්මාතිහ ත්වං කස්සප, සාණානි චෙව පංසුකූලානි ධාරෙහි නිබ්බසනානි, පිණ්ඩාය ච චරාහි, අරඤ්ඤෙ ච විහරාහීති."
            },
            {
                "type": "centered",
                "text": "4. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඔවාදසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "289. **රාජගහෙ-**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා මහාකස්සපො යෙන භගවා තෙනුපසඞ්කමි -පෙ- එකමන්තං නිසින්නං ඛො ආයස්මන්තං මහාකස්සපං භගවා එතදවොච: ඔවද කස්සප භික්ඛූ. කරොහි කස්සප භික්ඛූනං ධම්මිං කථං. අහං වා කස්සප, භික්ඛූ ඔවදෙය්යං ත්වං වා, අහං වා භික්ඛූනං ධම්මිං කථං කරෙය්යං ත්වං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුබ්බචා ඛො භන්තෙ භගවා, එතරහි භික්ඛූ දොවචස්සකරණෙහි ධම්මෙහි සමන්නාගතා, අක්ඛමා, අප්පදක්ඛිණග්ගාහිනො අනුසාසනිං. ඉධාහං භන්තෙ, අද්දසං භණ්ඩුඤ්ච නාම භික්ඛුං ආනන්දස්ස සද්ධිවිහාරිං, ආභිඤ්ජිකඤ්ච නාම භික්ඛුං අනුරුද්ධස්ස සද්ධිවිහාරිං, අඤ්ඤමඤ්ඤං සුතෙන අච්චාවදන්තෙ “එහි භික්ඛු, කො බහුතරං භාසිස්සති, කො සුන්දරතරං භාසිස්සති, කො චිරතරං භාසිස්සතී”ති."
            },
            {
                "type": "page-break",
                "text": "312"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා අඤ්ඤතරං භික්ඛුං ආමන්තෙසි: “එහි ත්වං භික්ඛු, මම වචනෙන භණ්ඩුඤ්ච භික්ඛුං ආනන්දස්ස සද්ධීවිහාරිං, ආභිඤ්ජිකඤ්ච භික්ඛුං අනුරුද්ධස්ස සද්ධිවිහාරිං ආමන්තෙහි සත්ථා ආයස්මන්තෙ ආමන්තෙතී”ති. එවං භන්තෙති ඛො සො භික්ඛු භගවතො පටිස්සුත්වා යෙන තෙ භික්ඛූ තෙනුපසඞ්කමි. උපසඞ්කමිත්වා තෙ භික්ඛූ එතදවොච: “සත්ථා ආයස්මන්තෙ ආමන්තෙතී”ති. ‘එවමාවුසො’ති ඛො තෙ භික්ඛූ තස්ස භික්ඛුනො පටිස්සුත්වා යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නෙ ඛො පන තෙ භික්ඛූ භගවා එතදවොච: සච්චං කිර තුම්හෙ භික්ඛවෙ, අඤ්ඤමඤ්ඤං සුතෙන අච්චාවදථ, “එහි භික්ඛු කො බහුතරං භාසිස්සති, කො සුන්දරතරං භාසිස්සති, කො චිරතරං භාසිස්සතී”ති. එවං භන්තෙති."
            },
            {
                "type": "paragraph",
                "text": "කින්නු මෙ තුම්හෙ භික්ඛවෙ, එවං ධම්මං දෙසිතං ආජානාථ? “එථ තුම්හෙ භික්ඛවෙ, අඤ්ඤමඤ්ඤං සුතෙන අච්චාවදථ: ‘එහි භික්ඛු, කො බහුතරං භාසිස්සති, කො සුන්දරතරං භාසිස්සති, කො චිරතරං භාසිස්සතී”ති. ‘නො හෙතං භන්තෙ, නො චෙ කිර තුම්හෙ භික්ඛවෙ, එවං ධම්මං දෙසිතං අජානාථ, අථ කිඤ්චරහි තුම්හෙ මොඝපුරිසා, කිං ජානන්තා කිං පස්සන්තා එවං ස්වාක්ඛාතෙ ධම්මවිනයෙ පබ්බජිතා සමානා අඤ්ඤමඤ්ඤං සුතෙන අච්චාවදථ: “එහි භික්ඛු කො බහුතරං භාසිස්සති, කො සුන්දරතරං භාසිස්සති, කො චිරතරං භාසිස්සතී”ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො තෙ භික්ඛූ භගවතො පාදෙසු සිරසා නිපතිත්වා භගවන්තං එතදවොචුං: අච්චයො නො භන්තෙ, අච්චගමා යථාබාලෙ, යථා මූළ්හෙ, යථා අකුසලෙ යෙ මයං එවං ස්වාක්ඛාතෙ ධම්මවිනයෙ පබ්බජිතා සමානා අඤ්ඤමඤ්ඤං සුතෙන අච්චාවදිම්හා “එහි භික්ඛු කො බහුතරං භාසිස්සති, කො සුන්දරතරං භාසිස්සති, කො චිරතරං භාසිස්සතී”ති. තෙසං නො භන්තෙ, භගවා අච්චයං අච්චයතො පතිගණ්හාතු ආයතිං සංවරායාති."
            },
            {
                "type": "paragraph",
                "text": "තඞ්ඝ තුම්හෙ භික්ඛවෙ, අච්චයො අච්චගමා, යථා බාලෙ යථා මූළ්හෙ යථා අකුසලෙ, යෙ{1 යං - සී 1.} තුම්හෙ එවං ස්වාක්ඛාතෙ ධම්මවිනයෙ පබ්බජිතා සමානා අඤ්ඤමඤ්ඤං සුතෙන අච්චාවදිත්ථ: “එහි භික්ඛු, කො බහුතරං භාසිස්සති, කො සුන්දරතරං භාසිස්සති, කො චිරතරං භාසිස්සතී”ති. යතො ච ඛො තුම්හෙ භික්ඛවෙ, අච්චයං අච්චයතො දිස්වා යථාධම්මං පටිකරොථ, තං වො මයං අච්චයං පටිගණ්හාම.{2 පටිග්ගණ්හාම - මඡසං.} වුද්ධි හෙසා භික්ඛවෙ, අරියස්ස විනයෙ යො අච්චයං අච්චයතො දිස්වා යථාධම්මං පටිකරොති, ආයතිඤ්ච සංවරං ආපජ්ජතීති."
            },
            {
                "type": "page-break",
                "text": "314"
            },
            {
                "type": "centered",
                "text": "4. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය ඔවාදසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "290.**සාවත්ථියං-{1 රාජගහෙ විහරති වෙළුවනෙ - මඡසං. ස්යා.}**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා මහාකස්සපො යෙන භගවා තෙනුපසඞ්කමි -පෙ- එකමන්තං නිසින්නං ඛො ආයස්මන්තං මහාකස්සපං භගවා එතදවොච: ඔවද කස්සප භික්ඛූ, කරොහි කස්සප භික්ඛූනං ධම්මිං කථං. අහං වා කස්සප භික්ඛූ ඔවදෙය්යං, ත්වං වා. අහං වා භික්ඛූනං ධම්මිං කථං කරෙය්යං, ත්වං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුබ්බචා ඛො භන්තෙ, එතරහි භික්ඛූ දොවචස්සකරණෙහි ධම්මෙහි සමන්නාගතා අක්ඛමා අප්පදක්ඛිණග්ගාහිනො අනුසාසනිං. යස්ස කස්සචි භන්තෙ,{2 භන්තෙ භික්ඛුනො - සී 1.} සද්ධා නත්ථි කුසලෙසු ධම්මෙසු, හිරි{3 හිරී - මඡසං.} නත්ථි කුසලෙසු ධම්මෙසු, ඔත්තප්පං නත්ථි කුසලෙසු ධම්මෙසු, විරියං නත්ථි කුසලෙසු ධම්මෙසු, පඤ්ඤා නත්ථි කුසලෙසු ධම්මෙසු, තස්ස යා රත්ති වා දිවසො වා ආගච්ඡති{4 ආගච්ඡන්ති - සීමු.}, හානියෙව පාටිකඞ්ඛා කුසලෙසු ධම්මෙසු, නො වුද්ධි."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භන්තෙ කාලපක්ඛෙ චන්දස්ස යා රත්ති වා දිවසො වා ආගච්ඡති, හායතෙව වණ්ණෙන, හායති මණ්ඩලෙන, හායති ආභාය, හායති ආරොහපරිණාහෙන. එවමෙව ඛො භන්තෙ, යස්ස කස්සචි සද්ධා නත්ථි කුසලෙසු ධම්මෙසු, හිරි නත්ථි -පෙ- ඔත්තප්පං නත්ථි -පෙ- විරියං නත්ථි -පෙ- පඤ්ඤා නත්ථි -පෙ- කුසලෙසු ධම්මෙසු, තස්ස යා රත්ති වා දිවසො වා ආගච්ඡති, හානියෙව පාටිකඞ්ඛා කුසලෙසු ධම්මෙසු, නො වුද්ධි."
            },
            {
                "type": "paragraph",
                "text": "අස්සද්ධො පුරිසපුග්ගලොති භන්තෙ, පරිහානමෙතං. අහිරිකො පුරිසපුග්ගලොති භන්තෙ, පරිහානමෙතං අනොත්තාපී පුරිසපුග්ගලොති භන්තෙ, පරිහානමෙතං. කුසීතො පුරිසපුග්ගලොති භන්තෙ, පරිහානමෙතං. දුප්පඤ්ඤො පුරිසපුග්ගලොති භන්තෙ, පරිහානමෙතං. කොධනො පුරිසපුග්ගලොති භන්තෙ, පරිහානමෙතං. උපනාහී පුරිසපුග්ගලොති භන්තෙ, පරිහානමෙතං. න සන්ති භික්ඛූ ඔවාදකාති භන්තෙ, පරිහානමෙතං."
            },
            {
                "type": "paragraph",
                "text": "යස්ස කස්සචි භන්තෙ, සද්ධා අත්ථි කුසලෙසු ධම්මෙසු, හිරි අත්ථි කුසලෙසු ධම්මෙසු, ඔත්තප්පං අත්ථි කුසලෙසු ධම්මෙසු, විරියං අත්ථි කුසලෙසු ධම්මෙසු, පඤ්ඤා අත්ථි කුසලෙසු ධම්මෙසු, තස්ස යා රත්ති වා දිවසො වා ආගච්ඡති, වුද්ධියෙව පාටිකඞ්ඛා කුසලෙසු ධම්මෙසු, නො පරිහානි."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භන්තෙ, ජුණ්හපක්ඛෙ චන්දස්ස යා රත්ති වා දිවසො වා ආගච්ඡති, වඩ්ඪතෙව වණ්ණෙන, වඩ්ඪති මණ්ඩලෙන, වඩ්ඪති ආභාය, වඩ්ඪති ආරොහපරිණාහෙන. එවමෙව ඛො භන්තෙ යස්ස කස්සචි සද්ධා අත්ථි කුසලෙසු ධම්මෙසු, හිරි අත්ථි -පෙ- ඔත්තප්පං අත්ථි -පෙ- විරියං අත්ථි -පෙ- පඤ්ඤා අත්ථි කුසලෙසු ධම්මෙසු, තස්ස යා රත්ති වා දිවසො වා ආගච්ඡති, වුද්ධියෙව පාටිකඞ්ඛා කුසලෙසු ධම්මෙසු, නො පරිහානි."
            },
            {
                "type": "page-break",
                "text": "316"
            },
            {
                "type": "paragraph",
                "text": "සද්ධො පුරිසපුග්ගලොති භන්තෙ, අපරිහානමෙතං. හිරිමා පුරිසපුග්ගලොති භන්තෙ, අපරිහානමෙතං. ඔත්තාපී පුරිසපුග්ගලොති භන්තෙ, අපරිහානමෙතං. ආරද්ධවිරියො පුරිසපුග්ගලොති භන්තෙ, අපරිහානමෙතං. පඤ්ඤවා පුරිසපුග්ගලොති භන්තෙ, අපරිහානමෙතං. අක්කොධනො පුරිසපුග්ගලොති භන්තෙ, අපරිහානමෙතං. අනුපනාහී පුරිසපුග්ගලොති භන්තෙ, අපරිහානමෙතං. සන්ති භික්ඛූ ඔවාදකාති භන්තෙ, අපරිහානමෙතන්ති."
            },
            {
                "type": "paragraph",
                "text": "සාධු සාධු කස්සප, යස්ස කස්සචි කස්සප, සද්ධා නත්ථි කුසලෙසු ධම්මෙසු, හිරි නත්ථි -පෙ- ඔත්තප්පං නත්ථි -පෙ- විරියං නත්ථි -පෙ- පඤ්ඤා නත්ථි කුසලෙසු ධම්මෙසු, තස්ස යා රත්ති වා දිවසො වා ආගච්ඡති, හානියෙව පාටිකඞ්ඛා කුසලෙසු ධම්මෙසු, නො වුද්ධි."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි කස්සප, කාලපක්ඛෙ චන්දස්ස යා රත්ති වා දිවසො වා ආගච්ඡති, හායතෙව වණ්ණෙන, හායති මණ්ඩලෙන, හායති ආභාය, හායති ආරොහපරිණාහෙන, එවමෙව ඛො කස්සප, යස්ස කස්සචි සද්ධා නත්ථි කුසලෙසු ධම්මෙසු, හිරි නත්ථි -පෙ- ඔත්තප්පං නත්ථි -පෙ- විරියං නත්ථි -පෙ- පඤ්ඤා නත්ථි කුසලෙසු ධම්මෙසු, තස්ස යා රත්ති වා දිවසො වා ආගච්ඡති, හානියෙව පාටිකඞ්ඛා කුසලෙසු ධම්මෙසු, නො වුද්ධි."
            },
            {
                "type": "paragraph",
                "text": "අස්සද්ධො පුරිසපුග්ගලොති කස්සප, පරිහානමෙතං. අහිරිකො -පෙ- අනොත්තාපී -පෙ- කුසීතො -පෙ- දුප්පඤ්ඤො -පෙ- කොධනො -පෙ- උපනාහී පුරිසපුග්ගලොති කස්සප, පරිහානමෙතං. න සන්ති භික්ඛූ ඔවාදකාති කස්සප, පරිහානමෙතං."
            },
            {
                "type": "paragraph",
                "text": "යස්ස කස්සචි කස්සප, සද්ධා අත්ථි කුසලෙසු ධම්මෙසු. හිරි -පෙ- ඔත්තප්පං -පෙ- විරියං -පෙ- පඤ්ඤා අත්ථි කුසලෙසු ධම්මෙසු, තස්ස යා රත්ති වා දිවසො වා ආගච්ඡති, වුද්ධියෙව පාටිකඞ්ඛා කුසලෙසු ධම්මෙසු, නො පරිහානි."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි කස්සප, ජුණ්හපක්ඛෙ චන්දස්ස යා රත්ති වා දිවසො වා ආගච්ඡති, වඩ්ඪතෙව වණ්ණෙන, වඩ්ඪති මණ්ඩලෙන, වඩ්ඪති ආභාය, වඩ්ඪති ආරොහපරිණාහෙන. එවමෙව ඛො කස්සප, යස්ස කස්සචි සද්ධා අත්ථි කුසලෙසු ධම්මෙසු, හිරි අත්ථි -පෙ- ඔත්තප්පං අත්ථි -පෙ- විරියං අත්ථි -පෙ- පඤ්ඤා අත්ථි කුසලෙසු ධම්මෙසු, තස්ස යා රත්ති වා දිවසො වා ආගච්ඡති, වුද්ධියෙව පාටිකඞ්ඛා කුසලෙසු ධම්මෙසු, නො පරිහානි."
            },
            {
                "type": "paragraph",
                "text": "සද්ධො පුරිසපුග්ගලොති කස්සප, අපරිහානමෙතං. හිරිමා -පෙ- ඔත්තාපී -පෙ- ආරද්ධවිරියො -පෙ- පඤ්ඤවා -පෙ- අක්කොධනො -පෙ- අනුපනාහී පුරිසපුග්ගලොති කස්සප, අපරිහානමෙතං. සන්ති භික්ඛූ ඔවාදකාති කස්සප, අපරිහානමෙතන්ති."
            },
            {
                "type": "page-break",
                "text": "318"
            },
            {
                "type": "centered",
                "text": "4. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තතිය ඔවාදසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "291. **සාවත්ථියං-{1 රාජගහෙ කලන්දක නිවාපෙ - මඡසං. ස්යා.}**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා මහාකස්සපො යෙන භගවා තෙනුපසඞ්කමි -පෙ- එකමන්තං නිසින්නං ඛො ආයස්මන්තං මහාකස්සපං භගවා එතදවොච: “ඔවද කස්සප, භික්ඛූ, කරොහි කස්සප, භික්ඛූනං ධම්මිං කථං. අහං වා කස්සප, භික්ඛූ{2 භික්ඛූනං - මඡසං.} ඔවදෙය්යං ත්වං වා. අහං වා භික්ඛූනං ධම්මිං කථං කරෙය්යං, ත්වං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුබ්බචා ඛො භන්තෙ,{3 භන්තෙ භගවා - සීමු.} එතරහි භික්ඛූ, දොවචස්සකරණෙහි ධම්මෙහි සමන්නාගතා, අක්ඛමා, අප්පදක්ඛිණග්ගාහිනො අනුසාසනින්ති."
            },
            {
                "type": "paragraph",
                "text": "තථා හි පන කස්සප පුබ්බෙ ථෙරා භික්ඛූ ආරඤ්ඤකා චෙව අහෙසුං ආරඤ්ඤකත්තස්ස ච වණ්ණවාදිනො. පිණ්ඩපාතිකා චෙව අහෙසුං පිණ්ඩපාතිකත්තස්ස ච වණ්ණවාදිනො. පංසුකූලිකා චෙව අහෙසුං පංසුකූලිකත්තස්ස ච වණ්ණවාදිනො. තෙචීවරිකා චෙව අහෙසුං තෙචීවරිකත්තස්ස ච වණ්ණවාදිනො. අප්පිච්ඡා චෙව අහෙසුං අප්පිච්ඡතාය ච{4 අප්පිච්ඡාය ච - සීමු. සී 2.} වණ්ණවාදිනො. සන්තුට්ඨා චෙව අහෙසුං සන්තුට්ඨියා{5 සන්තුට්ඨිතාය ච - සී 2.} ච වණ්ණවාදිනො. පවිවිත්තා චෙව අහෙසුං පවිවෙකස්ස ච වණ්ණවාදිනො. අසංසට්ඨා චෙව අහෙසුං අසංසග්ගස්ස ච වණ්ණවාදිනො. ආරද්ධවිරියා චෙව අහෙසුං විරියාරම්භස්ස ච වණ්ණවාදිනො."
            },
            {
                "type": "paragraph",
                "text": "තත්ර යො හොති භික්ඛු ආරඤ්ඤකො චෙව ආරඤ්ඤකත්තස්ස ච වණ්ණවාදී, පිණ්ඩපාතිකො චෙව පිණ්ඩපාතිකත්තස්ස ච වණ්ණවාදී, පංසුකූලිකො චෙව පංසුකූලිකත්තස්සච වණ්ණවාදී, තෙචීවරිකො චෙව තෙචීවරිකත්තස්ස ච වණ්ණවාදී, අප්පිච්ඡො චෙව අප්පිච්ඡතාය ච වණ්ණවාදී, සන්තුට්ඨො චෙව සන්තුට්ඨියා ච වණ්ණවාදී, පවිවිත්තො චෙව පවිවෙකස්ස ච වණ්ණවාදී, අසංසට්ඨො චෙව අසංසග්ගස්ස ච වණ්ණවාදී, ආරද්ධවිරියො චෙව විරියාරම්භස්ස ච වණ්ණවාදී, තං ථෙරා භික්ඛූ ආසනෙන නිමන්තෙන්ති “එහි භික්ඛු, කො නාමායං{6 කොනාමො අයං - සීමු. සී 1, 2.} භික්ඛු, භද්දකො වතායං භික්ඛු. සික්ඛාකාමො වතායං භික්ඛු, එහි භික්ඛු, ඉදං ආසනං නිසීදාහී”ති."
            },
            {
                "type": "paragraph",
                "text": "තත්ර කස්සප, නවානං භික්ඛූනං එවං හොහි. ‘යො කිර සො හොති භික්ඛු ආරඤ්ඤකො චෙව ආරඤ්ඤකත්තස්ස ච වණ්ණවාදී, පිණ්ඩපාතිකො චෙව -පෙ- පාංසුකූලිකො චෙව -පෙ- තෙචීවරිකොව චෙව -පෙ- අප්පිච්ඡො චෙව -පෙ- සන්තුට්ඨො චෙව -පෙ- පවිවිත්තො චෙව -පෙ- අසංසට්ඨො චෙව -පෙ- ආරද්ධවිරියො චෙව විරියාරම්භස්ස ච වණ්ණවාදී, තං ථෙරා භික්ඛූ ආසනෙන නිමන්තෙන්ති “එහි භික්ඛු කො නාමායං, භද්දකො වතායං භික්ඛු සික්ඛාකාමොවතායං භික්ඛු “එහි භික්ඛු, ඉදං ආසනං නිසීදාහීති. තෙ තථත්තාය පටිපජ්ජන්ති. තෙසං තං හොති දීඝරත්තං හිතාය සුඛාය."
            },
            {
                "type": "page-break",
                "text": "320"
            },
            {
                "type": "paragraph",
                "text": "එතරහි පන කස්සප, ථෙරා භික්ඛූ න චෙව ආරඤ්ඤකා න ච ආරඤ්ඤකත්තස්ස වණ්ණවාදිනො. න චෙව පිණ්ඩපාතිකා න ච පිණ්ඩපාතිකත්තස්ස වණ්ණවාදිනො. න චෙව පංසුකූලිකා න ච පංසුකූලිකත්තස්ස ච වණ්ණවාදිනො. න චෙව තෙචීවරිකා න ච තෙචීවරිකත්තස්ස වණ්ණවාදිනො. න චෙව අප්පිච්ඡා න ච අප්පිච්ඡතාය ච වණ්ණවාදිනො. න චෙව සන්තුට්ඨා න ච සන්තුට්ඨියා ච වණ්ණවාදිනො. න චෙව පවිවිත්තා න ච පවිවෙකස්ස ච වණ්ණවාදිනො. න චෙව අසංසට්ඨා න ච අසංසග්ගස්ස ච වණ්ණවාදිනො. න චෙව ආරද්ධවිරියා න ච විරියාරම්භස්ස වණ්ණවාදිනො."
            },
            {
                "type": "paragraph",
                "text": "තත්ර යො හොති භික්ඛු ඤාතො යසස්සී ලාභී චීවරපිණ්ඩපාතසෙනාසනගිලානපච්චයභෙසජ්ජපරික්ඛාරානං, තං ථෙරා භික්ඛූ ආසනෙන නිමන්තෙන්ති “එහි භික්ඛු, කො නාමායං භික්ඛු, භද්දකො වතායං භික්ඛු, සබ්රහ්මචාරිකාමො වතායං භික්ඛු, එහි භික්ඛු, ඉදං ආසනං, නිසීදාහී”ති."
            },
            {
                "type": "paragraph",
                "text": "තත්ර කස්සප නවානං භික්ඛූනං එවං හොති: “යො කිර සො හොති භික්ඛු ඤාතො යසස්සී ලාභී චීවරපිණ්ඩපාතසෙනාසනගිලානපච්චයභෙසජ්ජපරික්ඛාරානං, තං ථෙරා භික්ඛූ ආසනෙන නිමන්තෙති “එහි භික්ඛු කොනාමායං භික්ඛු, භද්දකො වතායං භික්ඛු: සබ්රහ්මචාරිකාමො වතායං භික්ඛු, එහි භික්ඛු, ඉදං ආසනං, නිසීදාහීති. තෙ තථත්තාය පටිපජ්ජන්ති. තෙසං තං හොති දීඝරත්තං අහිතාය දුක්ඛාය."
            },
            {
                "type": "paragraph",
                "text": "යං හි තං කස්සප, සම්මාවදමානො වදෙය්ය උපද්දුතා බ්රහ්මචාරී බ්රහ්මචාරූපද්දවෙන, අභිභවනා{1 අභිපත්ථනා - මඡසං.} බ්රහ්මචාරී බ්රහ්මචාරාභිභවනෙනාති{2 බ්රහ්මචාරී අභිපත්ථන්තොති - මඡසං.} එවංහිතං කස්සප සම්මාවදන්තො වදෙය්ය{3 බ්රහ්මචාරී අභිපත්ථන්තොති - මඡසං.} උපද්දුතා බ්රහ්මචාරී බ්රහ්මචාරුපද්දවෙන අභිභවනා බ්රහ්මචාරී බ්රහ්මචාරාභිභවනෙනාති."
            },
            {
                "type": "centered",
                "text": "4. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඣානාභිඤ්ඤසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "292. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "අහං භික්ඛවෙ, යාවදෙ ආකඞ්ඛාමි විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමජ්ඣානං උපසම්පජ්ජ විහරාමි. කස්සපොපී භික්ඛවෙ, යාවදෙ{4 යාවදෙ - මඡසං.} ආකඞ්ඛති විවිච්චෙ ව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමජ්ඣානං උපසම්පජ්ජ විහරති."
            },
            {
                "type": "page-break",
                "text": "322"
            },
            {
                "type": "paragraph",
                "text": "අහං භික්ඛවෙ, යාවදෙ{1 යාවදෙව - සීමු.} ආකඞ්ඛාමි විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියං ඣානං උපසම්පජ්ජ විහරාමි. කස්සපොපි භික්ඛවෙ, යාවදෙ{2 යාවදෙව - සීමු.} ආකඞ්ඛති විතක්කවිචාරානං වූපසමා -පෙ- දුතියංඣානං උපසම්පජ්ජ විහරති."
            },
            {
                "type": "paragraph",
                "text": "අහං භික්ඛවෙ, යාවදෙ ආකඞ්ඛාමි පීතියා ච විරාගා උපෙක්ඛකො ච විහරාමි’ සතො ච සම්පජානො සුඛං ච කායෙන පටිසංවෙදෙමි. යං තං අරියා ආචික්ඛන්ති ‘උපෙක්ඛකො සතිමා සුඛවිහාරී’ති තතියං ඣානං උපසම්පජ්ජ විහරාමි. කස්සපොපි භික්ඛවෙ, යාවදෙ ආකඞ්ඛති -පෙ- තතියං ඣානං උපසම්පජ්ජ විහරති."
            },
            {
                "type": "paragraph",
                "text": "අහං භික්ඛවෙ, යාවදෙ ආකඞ්ඛාමි සුඛස්ස ච පහාණා දුක්ඛස්ස ච පහාණා පුබ්බෙව සොමනස්ස දොමනස්සානං අත්ථගමා අදුක්ඛමසුඛං උපෙක්ඛාසතිපාරිසුද්ධිං චතුත්ථං ඣානං උපසම්පජ්ජ විහරාමි. කස්සපොපි භික්ඛවෙ, යාවදෙ ආකඞ්ඛති සුඛස්ස ච පහානා දුක්ඛස්ස ච පහාණා -පෙ- චතුත්ථං ඣානං උපසම්පජ්ජ විහරති."
            },
            {
                "type": "paragraph",
                "text": "අහං භික්ඛවෙ, යාවදෙ ආකඞ්ඛාමි සබ්බසො රූපසඤ්ඤානං සමතික්කමා පටිඝසඤ්ඤානං අත්ථගමා නානත්තසඤ්ඤානං අමනසිකාරා ‘අනන්තො ආකාසො’ති ආකාසානඤ්චායතනං උපසම්පජ්ජ විහරාමි. කස්සපොපි භික්ඛවෙ, යාවදෙ ආකඞ්ඛති සබ්බසො රූපසඤ්ඤානං සමතික්කමා -පෙ- ආකාසානඤ්චායතනං උපසම්පජ්ජ විහරති."
            },
            {
                "type": "paragraph",
                "text": "අහං භික්ඛවෙ, යාවදෙ ආකඞ්ඛාමි සබ්බසො ආකාසානඤ්චායතනං සමතික්කම්ම ‘අනන්තං විඤ්ඤාණ’න්ති විඤ්ඤාණඤ්චායතනං උපසම්පජ්ජ විහරාමි. කස්සපොපි භික්ඛවෙ, යාවදෙ ආකඞ්ඛති සබ්බසො ආකාසානඤ්චායතනං සමතික්කම්ම ‘අනන්තං විඤ්ඤාණ’න්ති විඤ්ඤාණඤ්චායතනං උපසම්පජ්ජ විහරති."
            },
            {
                "type": "paragraph",
                "text": "අහං භික්ඛවෙ, යාවදෙ ආකඞ්ඛාමි සබ්බසො විඤ්ඤාණඤ්චායතනං සමතික්කම්ම ‘නත්ථි කිඤ්චි’ති ආකිඤ්චඤ්ඤායතනං උපසම්පජ්ජ විහරාමි. කස්සපොපි භික්ඛවෙ, යාවදෙ ආකඞ්ඛති -පෙ- ආකිඤ්චඤ්ඤායතනං උපසම්පජ්ජ විහරති."
            },
            {
                "type": "paragraph",
                "text": "අහං භික්ඛවෙ, යාවදෙ ආකඞ්ඛාමි සබ්බසො ආකිඤ්චඤ්ඤායතනං සමතික්කම්ම නෙවසඤ්ඤානාසඤ්ඤායතනං උපසම්පජ්ජ විහරාමි. කස්සපොපි භික්ඛවෙ, යාවදෙ ආකඞ්ඛති -පෙ- නෙවසඤ්ඤානාසඤ්ඤායතනං උපසම්පජ්ජ විහරති."
            },
            {
                "type": "paragraph",
                "text": "අහං භික්ඛවෙ, යාවදෙ ආකඞ්ඛාමි සබ්බසො නෙවසඤ්ඤානාසඤ්ඤායතනං සමතික්කම්ම සඤ්ඤාවෙදයිතනිරොධං උපසම්පජ්ජ විහරාමි. කස්සපොපි භික්ඛවෙ -පෙ- සඤ්ඤාවෙදයිතනිරොධං උපසම්පජ්ජ විහරති."
            },
            {
                "type": "page-break",
                "text": "324"
            },
            {
                "type": "paragraph",
                "text": "අහං භික්ඛවෙ, යාවදෙ ආකඞ්ඛාමි අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොමි: එකොපි හුත්වා බහුධා හොමි, බහුධාපි හුත්වා එකො හොමි. ආවීභාවං තිරොභාවං තිරොකුඩ්ඩං තිරොපාකාරං තිරොපබ්බතං අසජ්ජමානො ගච්ඡාමි, සෙය්යථාපි ආකාසෙ. පඨවියාපි උම්මුජ්ජනිමුජ්ජං කරොමි සෙය්යථාපි උදකෙ. උදකෙපි අභෙජ්ජමානෙ ගච්ඡාමි සෙය්යථාපි පඨවියං. ආකාසෙපි පල්ලඞ්කෙන වඞ්කමාමි{1 කමාමි - මඡසං.} සෙය්යථාපි පක්ඛි සකුණො. ඉමෙපි චන්දිමසූරියෙ එවම්මහිද්ධිකෙ එවම්මහානුභාවෙ පාණිනා පරාමසාමි පරිමජ්ජාමි. යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙමි. කස්සපොපි භික්ඛවෙ, යාවදෙ ආකඞ්ඛති අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති -පෙ- යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙති."
            },
            {
                "type": "paragraph",
                "text": "අහං භික්ඛවෙ, යාවදෙ ආකඞ්ඛාමි දිබ්බාය සොතධාතුයා විසුද්ධාය අතික්කන්තමානුසිකාය උභො සද්දෙ සුණාමි දිබ්බෙ ච මානුසෙ ච යෙ දූරෙ සන්තිකෙ ච. කස්සපොපි භික්ඛවෙ, යාවදෙ ආකඞ්ඛති දිබ්බාය සොතධාතුයා උභොසද්දෙ සුණාති -පෙ- යෙ දූරෙ සන්තිකෙ ච."
            },
            {
                "type": "paragraph",
                "text": "අහං භික්ඛවෙ, යාවදෙ ආකඞ්ඛාමි, පරසත්තානං පරපුග්ගලානං චෙතසා චෙතො පරිච්ච පජානාමි: සරාගං වා චිත්තං සරාගං චිත්තන්ති පජානාමි. වීතරාගං වා චිත්තං වීතරාගං චිත්තන්ති පජානාමි. සදොසං වා චිත්තං -පෙ- වීතදොසං වා චිත්තං -පෙ- සමොහං වා චිත්තං -පෙ- වීතමොහං වා චිත්තං -පෙ- සංඛිත්තං වා චිත්තං -පෙ- වික්ඛිත්තං වා චිත්තං -පෙ- මහග්ගතං වා චිත්තං -පෙ- අමහග්ගතං වා චිත්තං -පෙ- සඋත්තරං වා චිත්තං -පෙ- අනුත්තරං වා චිත්තං -පෙ- සමාහිතං වා චිත්තං -පෙ- අසමාහිතං වා චිත්තං -පෙ- විමුත්තං වා චිත්තං -පෙ- අවිමුත්තං වා චිත්තං අවිමුත්තං චිත්තන්ති පජානාමි. කස්සපොපි භික්ඛවෙ, යාවදෙ ආකඞ්ඛති පරසත්තානං පරපුග්ගලානං චෙතසා චෙතො පරිච්ච පජානාති: සරාගං වා චිත්තං සරාගං චිත්තන්ති පජානාති -පෙ- අවිමුත්තං වා චිත්තං අවිමුත්තං චිත්තන්ති පජානාති."
            },
            {
                "type": "paragraph",
                "text": "අහං භික්ඛවෙ, යාවදෙ ආකඞ්ඛාමි අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරාම - සෙය්යථිදං: “එකම්පි ජාතිං ද්වෙපි ජාතියො තිස්සොපි ජාතියො චතස්සොපි ජාතියො පඤ්චපි ජාතියො දසපි ජාතියො වීසම්පි ජාතියො තිංසම්පි ජාතියො චත්තාළීසම්පි ජාතියො පඤ්ඤාසම්පි ජාතියො ජාතිසතම්පි ජාතිසහස්සම්පි ජාතිසතසහස්සම්පි, අනෙකෙපි සංවට්ටකප්පෙ අනෙකෙපි විවට්ටකප්පෙ අනෙකෙපි සංවට්ටවිවට්ටකප්පෙ “අමුත්රාසිං එවං නාමො එවං ගොත්තො එවං වණ්ණො එවමාහාරො එවං සුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො අමුත්ර උදපාදිං. තත්රාපාසිං එවන්නාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවං සුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො ඉධූපපන්නො”ති. ඉති සාකාරං සඋද්දෙසං අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරාමි. කස්සපොපි භික්ඛවෙ, යාවදෙ ආකඞ්ඛති අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති - සෙය්යථිදං: “එකම්පි ජාතිං -පෙ- ඉධූපපන්නො”ති. ඉති සාකාරං සඋද්දෙසං අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති."
            },
            {
                "type": "page-break",
                "text": "326"
            },
            {
                "type": "paragraph",
                "text": "අහං භික්ඛවෙ, යාවදෙ ආකඞ්ඛාමි දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සාමි: චවමානෙ උපපජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාමි. ‘ඉමෙ වත භොන්තො සත්තා කායදුච්චරිතෙන සමන්නාගතා වචීදුච්චරිතෙන සමන්නාගතා මනොදුච්චරිතෙන සමන්නාගතා අරියානං උපවාදකා මිච්ඡාදිට්ඨිකා මිච්ඡාදිට්ඨිකම්මසමාදානා. තෙ කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපන්නා. ඉමෙ වා පන භොන්තො සත්තා කායසුචරිතෙන සමන්නාගතා වචීසුචරිතෙන සමන්නාගතා මනොසුචරිතෙන සමන්නාගතා අරියානං අනුපවාදකා සම්මාදිට්ඨිකා සම්මාදිට්ඨිකම්මසමාදානා. තෙ කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නා’ති. ඉති දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සාමි: චවමානෙ උපපජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාමි. කස්සපොපි භික්ඛවෙ, යාවදෙ ආකඞ්ඛති දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සති -පෙ- චවමානෙ උපපජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති."
            },
            {
                "type": "paragraph",
                "text": "අහං භික්ඛවෙ, ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරාමි. කස්සපොපි භික්ඛවෙ, ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතීති."
            },
            {
                "type": "centered",
                "text": "4. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "භික්ඛුනූපස්සයසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "293. එකං සමයං ආයස්මා මහාකස්සපො සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. අථ ඛො ආයස්මා ආනන්දො පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය යෙනායස්මා මහාකස්සපො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මන්තං මහාකස්සපං එතදවොච: “ආයාම භන්තෙ, කස්සප, යෙනඤ්ඤතරො භික්ඛුනූපස්සයො තෙනුපසඞ්කමිස්සාමා”ති."
            },
            {
                "type": "paragraph",
                "text": "ගච්ඡ ත්වං ආවුසො ආනන්ද, බහුකිච්චො ත්වං බහුකරණීයොති."
            },
            {
                "type": "paragraph",
                "text": "දුතියම්පි ඛො ආයස්මා ආනන්දො ආයස්මන්තං මහාකස්සපං එතදවොච: “ආයාම භන්තෙ කස්සප, යෙනඤ්ඤතරො භික්ඛුනූපස්සයො තෙනුපසඞ්කමිස්සාමා”ති."
            },
            {
                "type": "paragraph",
                "text": "ගච්ඡ ත්වං ආවුසො ආනන්ද, බහුකිච්චො ත්වං බහුකරණීයොති."
            },
            {
                "type": "paragraph",
                "text": "තතියම්පි ඛො ආයස්මා ආනන්දො, ආයස්මන්තං මහාකස්සපං එතදවොච: “ආයාම භන්තෙ කස්සප, යෙනඤ්ඤතරො භික්ඛුනූපස්සයො තෙනුපසඞ්කමිස්සාමා”ති."
            },
            {
                "type": "page-break",
                "text": "328"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා මහාකස්සපො පුබ්බන්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය ආයස්මතා ආනන්දෙන පච්ඡාසමණෙන යෙනඤ්ඤතරො භික්ඛුනූපස්සයො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදි."
            },
            {
                "type": "paragraph",
                "text": "අථඛො සම්බහුලා භික්ඛුනියො යෙනායස්මා මහාකස්සපො තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා ආයස්මන්තං මහාකස්සපං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නා ඛො තා භික්ඛුනියො ආයස්මා මහාකස්සපො ධම්මියා කථාය සන්දස්සෙසි සමාදපෙසි සමුත්තෙජෙසි සම්පහංසෙසි. අථ ඛො ආයස්මා මහාකස්සපො තා භික්ඛුනියො ධම්මියා කථාය සන්දස්සෙත්වා සමාදපෙත්වා සමුත්තෙජෙත්වා සම්පහංසෙත්වා උට්ඨායාසනා පක්කමි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ථුල්ලතිස්සා භික්ඛුනී අනත්තමනා අනත්තමනවාචං නිච්ඡාරෙසි: “කිං පනය්යො{1 පන අය්යො - මඡසං. ස්යා. PTS.} මහාකස්සපො අය්යස්ස ආනන්දස්ස වෙදෙහමුනිනො සම්මුඛා ධම්මං භාසිතබ්බං මඤ්ඤති? සෙය්යථාපි නාම සූචිවාණිජකො සූචිකාරස්ස සන්තිකෙ සූචිං වික්කෙතබ්බං මඤ්ඤෙය්ය, එවමෙවං අය්යො මහාකස්සපො අය්යස්ස ආනන්දස්ස වෙදෙහමුනිනො සම්මුඛා ධම්මං භාසිතබ්බං මඤ්ඤතී”ති."
            },
            {
                "type": "paragraph",
                "text": "අස්සොසි ඛො ආයස්මා මහාකස්සපො ථුල්ලතිස්සාය භික්ඛුනියා ඉමං වාචං භාසමානාය. අථ ඛො ආයස්මා මහාකස්සපො ආයස්මන්තං ආනන්දං එතදවොච: කින්නු ඛො ආවුසො ආනන්ද, අහං සූචිවාණිජකො, ත්වං සූචිකාරො? උදාහු අහං සූචිකාරො, ත්වං සූචිවාණිජකො”ති? ඛමථ{2 ඛම - මඡසං.} භන්තෙ කස්සප, බාලො මාතුගාමොති."
            },
            {
                "type": "paragraph",
                "text": "ආගමෙහි ත්වං ආවුසො ආනන්ද, මා තෙ සඞ්ඝො උත්තරිං{3 උත්තරි - මඡසං.} උපපරික්ඛි."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤසි ආවුසො ආනන්ද? අපි නු ත්වං භගවතො සම්මුඛා භික්ඛුසඞ්ඝෙ උපනීතො: “අහං භික්ඛවෙ, යාවදෙ ආකඞ්ඛාමි, විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහරාමි. ආනන්දොපි භික්ඛවෙ, යාවදෙ ආකඞ්ඛති විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහරතී”ති?"
            },
            {
                "type": "paragraph",
                "text": "‘නො හෙතං භන්තෙ’."
            },
            {
                "type": "paragraph",
                "text": "අහං ඛො ආවුසො භගවතො සම්මුඛා භික්ඛුසඞ්ඝෙ උපනීතො: “අහං භික්ඛවෙ, යාවදෙ ආකඞ්ඛාමි විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහරාමි. කස්සපොපි භික්ඛවෙ, යාවදෙ ආකඞ්ඛති විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි -පෙ- පඨමං ඣානං උපසම්පජ්ජ විහරතී”ති."
            },
            {
                "type": "paragraph",
                "text": "(නවන්නං අනුපුබ්බවිහාරසමාපත්තීනං පඤ්චන්නඤ්ච අභිඤ්ඤාණං පෙය්යාලො{4 අභිඤ්ඤානං විත්ථාරො වෙදිතබ්බො - මඡසං.}.)"
            },
            {
                "type": "page-break",
                "text": "330"
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤසි ආවුසො ආනන්ද, අපි නු ත්වං භගවතො සම්මුඛා භික්ඛුසඞ්ඝෙ උපනීතො “අහං භික්ඛවෙ, ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරාමි. ආනන්දොපි භික්ඛවෙ, ආසවානං ඛයා අනාසවං චෙතො විමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතී”ති?"
            },
            {
                "type": "paragraph",
                "text": "‘නො හෙතං භන්තෙ.’"
            },
            {
                "type": "paragraph",
                "text": "අහං ඛො ආවුසො භගවතො සම්මුඛා භික්ඛුසඞ්ඝෙ උපනීතො “අහං භික්ඛවෙ, ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා විහරාමි. කස්සපොපි භික්ඛවෙ ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතී”ති."
            },
            {
                "type": "paragraph",
                "text": "සත්තරතනං වා සො ආවුසො නාගං අඩ්ඪට්ඨරතනං වා තාලපත්තිකාය ඡාදෙතබ්බං මඤ්ඤෙය්ය, යො මෙ ඡ අභිඤ්ඤා ඡාදෙතබ්බං මඤ්ඤෙය්යාති."
            },
            {
                "type": "paragraph",
                "text": "චවිත්ථ ච පන ථුල්ලතිස්සා භික්ඛුනී බ්රහ්මචරියම්හාති."
            },
            {
                "type": "centered",
                "text": "4. 1. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "චීවරසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "294. එකං සමයං ආයස්මා මහාකස්සපො රාජගහෙ විහරති වෙළුවනෙ කලන්දකනිවාපෙ. තෙන ඛො පන සමයෙන ආයස්මා ආනන්දො දක්ඛිණාගිරිස්මිං{1 දක්ඛිණගිරිස්මිං - මඡසං.} චාරිකං චරති මහතා භික්ඛුසඞ්ඝෙන සද්ධිං. තෙන ඛො පන සමයෙන ආයස්මතො ආනන්දස්ස තිංසමත්තා සද්ධිවිහාරිනො භික්ඛූ සික්ඛං පච්චක්ඛාය හීනායාවත්තා භවන්ති යෙභුය්යෙන කුමාරභූතා. අථ ඛො ආයස්මා ආනන්දො දක්ඛිණාගිරිස්මිං යථාභිරන්තං{2 යථාභිරත්තං - සීමු. සී 1, 2.} චාරිකං චරිත්වා යෙන රාජගහං වෙළුවනං කලන්දකනිවාපො, යෙනායස්මා මහාකස්සපො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මන්තං මහාකස්සපං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො ආයස්මන්තං ආනන්දං ආයස්මා මහාකස්සපො එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "“කති නු ඛො ආවුසො ආනන්ද අත්ථවසෙ පටිච්ච භගවතා කුලෙසු තිකභොජනං පඤ්ඤත්තන්ති?”"
            },
            {
                "type": "paragraph",
                "text": "තයො ඛො භන්තෙ කස්සප, අත්ථවසෙ පටිච්ච භගවතා කුලෙසු තිකභොජනං පඤ්ඤත්තං: දුම්මඞ්කූනං පුග්ගලානං නිග්ගහාය, පෙසලානං භික්ඛූනං ඵාසුවිහාරාය, මා පාපිච්ඡා පක්ඛං නිස්සාය සඞ්ඝං භින්දෙය්යුං, කුලානුද්දයතාය ච.{3 කුලානුදකතාය ච - ස්යා.} ඉමෙ ඛො භන්තෙ කස්සප, තයො අත්ථවසෙ පටිච්ච භගවතා කුලෙසු තිකභොජනං පඤ්ඤත්තන්ති."
            },
            {
                "type": "page-break",
                "text": "332"
            },
            {
                "type": "paragraph",
                "text": "අථ කිඤ්චරහි ත්වං ආවුසො ආනන්ද ඉමෙහි නවෙහි භික්ඛූහි ඉන්ද්රියෙසු අගුත්තද්වාරෙහි භොජනෙ අමත්තඤ්ඤූහි ජාගරියං අනනුයුත්තෙහි සද්ධිං චාරිකං චරසි? සස්සඝාතං මඤ්ඤෙ චරසි. කුලූපඝාතං මඤ්ඤෙ චරසි. ඔලුජ්ජති{1 උල්ලුජ්ජති - සීමු. සීමු අට්ඨකථා.} ඛො තෙ ආවුසො ආනන්ද, පරිසා පලුජ්ජන්ති ඛො තෙ ආවුසො නවප්පායා. න චායං කුමාරකො මත්තමඤ්ඤාතීති."
            },
            {
                "type": "paragraph",
                "text": "“අපි මෙ භන්තෙ, කස්සප, සිරස්මිං පලිතානි ජාතානි. අථ ච පන මයං අජ්ජාපි ආයස්මතො මහාකස්සපස්ස කුමාරකවාදා න මුච්චාමා”ති."
            },
            {
                "type": "paragraph",
                "text": "තථා හි පන ත්වං ආවුසො ආනන්ද, ඉමෙහි නවෙහි භික්ඛූහි ඉන්ද්රියෙසු අගුත්තද්වාරෙහි භොජනෙ අමත්තඤ්ඤූහි ජාගරියං අනනුයුත්තෙහි සද්ධිං චාරිකං චරසි, සස්සඝාතං මඤ්ඤෙ චරසි, කුලූපඝාතං මඤ්ඤෙ චරසි. ඔලුජ්ජති ඛො තෙ ආවුසො ආනන්ද, පරිසා. පලුජ්ජන්ති ඛො තෙ ආවුසො නවප්පායා. න වායං කුමාරකො මත්තමඤ්ඤාතීති."
            },
            {
                "type": "paragraph",
                "text": "අස්සොසි ඛො ථුල්ලනන්දා භික්ඛුනී “අය්යෙන කිර මහාකස්සපෙන අය්යො ආනන්දො වෙදෙහමුනි කුමාරකවාදෙන අපසාදිතො”ති. අථ ඛො ථුල්ලනන්දා භික්ඛුනී අනත්තමනා අනත්තමනවාචං නිච්ඡාරෙසි. “කිං පන අය්යො මහාකස්සපො අඤ්ඤතිත්ථියපුබ්බො සමානො අය්යං ආනන්දං වෙදෙහමුනිං කුමාරකවාදෙන අපසාදෙතබ්බං මඤ්ඤතී”ති."
            },
            {
                "type": "paragraph",
                "text": "අස්සොසි ඛො ආයස්මා මහාකස්සපො ථුල්ලනන්දාය භික්ඛුනියා ඉමං වාචං භාසමානාය. අථ ඛො ආයස්මා මහාකස්සපො ආයස්මන්තං ආනන්දං එතදවොච: තග්ඝාවුසො ආනන්ද, ථුල්ලනන්දාය භික්ඛුනියා සහසා අප්පටිසඞ්ඛා වාචා භාසිතා. යතොහං{2 යත්වාහං - මඡසං. යතො ඛොහං - සී 1, 2.} ආවුසො කෙසමස්සුං ඔහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජිතො, නාභිජානාමි අඤ්ඤං සත්ථාරං උද්දිසිතුං අඤ්ඤත්ර තෙන භගවතා අරහතා සම්මාසම්බුද්ධෙන."
            },
            {
                "type": "paragraph",
                "text": "පුබ්බෙ මෙ ආවුසො අගාරිකභූතස්ස සතො එතදහොසි. “සම්බාධො ඝරාවාසො රජාපථො{3 රජොපථො - සීමු.} අබ්භොකාසො පබ්බජ්ජා. නයිදං සුකරං අගාරං අජ්ඣාවසතා එකන්තපරිපුණ්ණං එකන්තපරිසුද්ධං සඞ්ඛලිඛිතං බ්රහ්මචරියං චරිතුං, යන්නූනාහං කෙසමස්සුං ඔහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජෙය්ය”න්ති. සො ඛො අහං{4 සො ඛ්වාහං - මඡසං. සයා. PTS.} ආවුසො අපරෙන සමයෙන පටපිලොතිකානං සඞ්ඝාටිං කරිත්වා{5 කාරෙත්වා - මඡසං.} යෙ ලොකෙ අරහන්තො තෙ උද්දිස්ස කෙසමස්සුං ඔහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජිං."
            },
            {
                "type": "page-break",
                "text": "334"
            },
            {
                "type": "paragraph",
                "text": "සො එවං පබ්බජිතො සමානො අද්ධානමග්ගපටිපන්නො අද්දසං භගවන්තං අන්තරා ච රාජගහං අන්තරා ච නාලන්දං බහුපුත්තෙ චෙතියෙ නිසින්නං. දිස්වාන මෙ එතදහොසි: සත්ථාරඤ්ච වතාහං පස්සෙය්යං භගවන්තමෙව පස්සෙය්යං, සුගතඤ්ච වතාහං පස්සෙය්යං, භගවන්තමෙව පස්සෙය්යං, සම්මාසම්බුද්ධඤ්ච වතාහං පස්සෙය්යං භගවන්තමෙව පස්සෙය්යන්ති. සො ඛොහං ආවුසො තත්ථෙව භගවතො පාදෙසු සිරසා නිපතිත්වා භගවන්තං එතදවොච: “සත්ථා මෙ භන්තෙ භගවා. සාවකොහමස්මි. සත්ථා මෙ භන්තෙ භගවා. සාවකොහමස්මී”ති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ මං ආවුසො, භගවා එතදවොච: “යො ඛො කස්සප එවං සබ්බචෙතසා සමන්නාගතං සාවකං ආජානඤ්ඤෙව වදෙය්ය ජානාමීති, අපස්සඤ්ඤෙව වදෙය්ය පස්සාමීති, මුද්ධාපි තස්ස විපතෙය්ය. අහං ඛො පන කස්සප ජානඤ්ඤෙව වදාමි ජානාමීති, පස්සඤ්ඤෙව වදාමි පස්සාමී”ති."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ තෙ කස්සප එවං සික්ඛිතබ්බං: “තිබ්බං මෙ හිරොත්තප්පං පච්චුපට්ඨිතං භවිස්සති ථෙරෙසු නවෙසු{1 නවකෙසු - සීමු.} මජ්ඣිමෙසූ”ති. එවං හි තෙ කස්සප සික්ඛිතබ්බං."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ තෙ කස්සප, එවං සික්ඛිතබ්බං: “යං කිඤ්චි ධම්මං සුණිස්සාමි.{2 සුස්සාමි - සීමු. PTS. සී 1, 2.} කුසලූපසංහිතං, සබ්බං තං අට්ඨිකත්වා මනසිකත්වා සබ්බචෙතසා සමන්නාහරිත්වා ඔහිතසොතො ධම්මං සුණිස්සාමී”ති. එවං හි තෙ කස්සප සික්ඛිතබ්බං."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ තෙ කස්සප, එවං සික්ඛිතබ්බං “සාතසහගතා ච මෙ කායගතාසති න විජහිස්සතී”ති. එවං හි තෙ කස්සප සික්ඛිතබ්බන්ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො මං ආවුසො, භගවා ඉමිනා ඔවාදෙන ඔවාදිත්වා උට්ඨායාසනා පක්කාමි."
            },
            {
                "type": "paragraph",
                "text": "සත්තාහමෙව ඛො අහං ආවුසො සාණො{3 සරනො - මඡසං.} රට්ඨපිණ්ඩං භුඤ්ජිං. අථ අට්ඨමියා අඤ්ඤා උදපාදි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආවුසො, භගවා මග්ගා ඔක්කම්ම යෙනඤ්ඤතරං රුක්ඛමූලං තෙනුපසඞ්කමි. අථ ඛොහං ආවුසො පටපිලොතීනං සඞ්ඝාටිං චතුග්ගුණං පඤ්ඤාපෙත්වා භගවන්තං එතදවොචං: “ඉධ භන්තෙ, භගවා නිසීදතු, යං මමස්ස{4 මම අස්ස - සීමු. සී 1.} දීඝරත්තං හිතාය සුඛායා”ති. නිසීදි ඛො ආවුසො භගවා පඤ්ඤත්තෙ ආසනෙ. නිසජ්ජ ඛො මං ආවුසො භගවා එතදවොච: “මුදුකා ඛො ත්යායං කස්සප, පටපිලොතීනං සඞ්ඝාටී”ති. පතිගණ්හාතු මෙ භන්තෙ භගවා පටපිලොතීනං සඞ්ඝාටි, අනුකම්පං උපාදායාති."
            },
            {
                "type": "page-break",
                "text": "336"
            },
            {
                "type": "paragraph",
                "text": "ධාරෙස්සසි පන මෙ ත්වං කස්සප සාණානි පංසුකූලානි නිබ්බසනානීති? ධාරෙස්සාමහං භන්තෙ භගවතො සාණානි පංසුකූලානි නිබ්බසනානීති."
            },
            {
                "type": "paragraph",
                "text": "සො ඛො අහං ආවුසො පටපිලොතීනං සඞ්ඝාටිං භගවතො පාදාසිං. අහං පන භගවතො සාණානි පංසුකූලානි නිබ්බසනානි පටිපජ්ජිං. යං හි තං ආවුසො සම්මා වදමානො වදෙය්ය “භගවතො පුත්තො ඔරසො මුඛතො ජාතො ධම්මජො ධම්මනිම්මිතො ධම්මදායාදො පටිග්ගහෙතා.{1 පටිග්ගහිතානි - මඡසං. ස්යා. PTS. පටිග්ගහිතො - සී 1, 2.} සාණානි පංසුකූලානි නිබ්බසනානී”ති, මමං තං සම්මා වදමානො වදෙය්ය “භගවතො පුත්තො ඔරසො මුඛතො ජාතො ධම්මජො ධම්මනිම්මිතො ධම්මදායාදො පටිග්ගහෙතා සාණානි පංසුකූලානි නිබ්බසනානී”ති."
            },
            {
                "type": "paragraph",
                "text": "අහං ඛො ආවුසො යාවදෙ ආකඞ්ඛාමි විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහාරාමි."
            },
            {
                "type": "paragraph",
                "text": "අහං ඛො ආවුසො යාවදෙව ආකඞ්ඛාමි -පෙ- (නවන්නං අනුපුබ්බ විහාරසමාපත්තීනං පඤ්චන්නඤ්ච අභිඤ්ඤානං එවං විත්ථාරො වෙදිතබ්බො.{2 අභිඤ්ඤාණං එවං විත්ථාරෙතබ්බා - සීමු.})"
            },
            {
                "type": "paragraph",
                "text": "අහං ඛො ආවුසො ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරාමි."
            },
            {
                "type": "paragraph",
                "text": "සත්තරතනං වා සො ආවුසො{3 සත්තරතනං වා ආවුසො - මඡසං. PTS.} නාගං අඩ්ඪට්ඨරතනං වා තාලපත්තිකාය ඡාදෙතබ්බං මඤ්ඤෙය්ය, යො මෙ අභිඤ්ඤා ඡාදෙතබ්බං මඤ්ඤෙය්යාති."
            },
            {
                "type": "paragraph",
                "text": "චවිත්ථ ච පන ථුල්ලනන්දා භික්ඛුනී බ්රහ්මචරියම්හාති."
            },
            {
                "type": "centered",
                "text": "4. 1. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තථාගතපරම්මරණසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "295. එකං සමයං ආයස්මා ච මහාකස්සපො ආයස්මා ච සාරිපුත්තො බාරාණසියං විහරන්ති ඉසිපතනෙ මිගදායෙ. අථ ඛො ආයස්මා සාරිපුත්තො සායන්හසමයං පතිල්ලානා වුට්ඨිතො යෙනායස්මා මහාකස්සපො තෙනුපසඞ්කමි -පෙ- එකමන්තං නිසින්නො ඛො ආයස්මා සාරිපුත්තො ආයස්මන්තං මහාකස්සපං එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "කින්නු ඛො ආවුසො, කස්සප හොති තථාගතො පරම්මරණාති?"
            },
            {
                "type": "paragraph",
                "text": "අබ්යාකතං ඛො එතං ආවුසො, භගවතා “හොති තථාගතො පරම්මරණා”ති."
            },
            {
                "type": "page-break",
                "text": "338"
            },
            {
                "type": "paragraph",
                "text": "කිං පනාවුසො, න හොති තථාගතො පරම්මරණාති?"
            },
            {
                "type": "paragraph",
                "text": "එතම්පි{1 එවම්පි ඛො - මඡසං. PTS.} ඛො ආවුසො, අබ්යාකතං භගවතා “න හොති තථාගතො පරම්මරණා”ති."
            },
            {
                "type": "paragraph",
                "text": "කින්නු ඛො ආවුසො, හොති ච න හොති ච තථාගතො පරම්මරණාති?"
            },
            {
                "type": "paragraph",
                "text": "අබ්යාකතං ඛො එතං ආවුසො භගවතා, “හොති ච න හොති ච තථාගතො පරම්මරණා”ති."
            },
            {
                "type": "paragraph",
                "text": "කිං පනාවුසො, නෙව හොති න න හොති තථාගතො පරම්මරණාති?"
            },
            {
                "type": "paragraph",
                "text": "එතම්පි ඛො ආවුසො, අබ්යාකතං භගවතා “නෙව හොති න න හොති තථාගතො පරම්මරණා”ති."
            },
            {
                "type": "paragraph",
                "text": "කස්මා චෙතං ආවුසො, අබ්යාකතං භගවතාති?"
            },
            {
                "type": "paragraph",
                "text": "න හෙතං ආවුසො අත්ථසංහිතං ආදිබ්රහ්මචරියකං, න නිබ්බිදාය න විරාගාය න නිරොධාය න උපසමාය න අභිඤ්ඤාය න සම්බොධාය න නිබ්බානාය සංවත්තති. තස්මා තං අබ්යාකතං භගවතාති."
            },
            {
                "type": "paragraph",
                "text": "අථ කිඤ්චරහාවුසො,{2 කිඤ්චරහි ආවුසො - සී 1, 2.} බ්යාකතං භගවතාති?"
            },
            {
                "type": "paragraph",
                "text": "ඉදං දුක්ඛන්ති ඛො ආවුසො, බ්යාකතං භගවතා. අයං දුක්ඛසමුදයොති බ්යාකතං භගවතා. අයං දුක්ඛනිරොධොති බ්යාකතං භගවතා. අයං දුක්ඛනිරොධගාමිනී පටිපදාති බ්යාකතං භගවතාති."
            },
            {
                "type": "paragraph",
                "text": "කස්මා චෙතං ආවුසො බ්යාකතං භගවතාති?"
            },
            {
                "type": "paragraph",
                "text": "එතං හි ආවුසො, අත්ථසංහිතං, එතං ආදිබ්රහ්මචරියකං, එතං නිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තති. තස්මා තං භගවතා බ්යාකතන්ති."
            },
            {
                "type": "centered",
                "text": "4. 1. 13.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සද්ධම්මපතිරූපකසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "296. එකං සමයං භගවා සාවත්ථියං විහරති -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා මහාකස්සපො යෙන භගවා තෙනුපසඞ්කමි -පෙ- එකමන්තං නිසින්නො ඛො ආයස්මා මහාකස්සපො භගවන්තං එතදවොච:"
            },
            {
                "type": "page-break",
                "text": "340"
            },
            {
                "type": "paragraph",
                "text": "කො නු ඛො භන්තෙ, හෙතු කො පච්චයො යෙන පුබ්බෙ අප්පතරානි චෙව සික්ඛාපදානි අහෙසුං, බහුතරා ච භික්ඛූ අඤ්ඤාය සණ්ඨහිංසු? කො පන භන්තෙ. හෙතු කො පච්චයො යෙනෙතරහි බහුතරානි චෙව සික්ඛාපදානි අප්පතරාච භික්ඛූ අඤ්ඤාය සණ්ඨහන්තිති?"
            },
            {
                "type": "paragraph",
                "text": "එවං හෙතං කස්සප, හොති. සත්තෙසු හායමානෙසු, සද්ධම්මෙ අන්තරධායමානෙ, බහුතරානි චෙව සික්ඛාපදානි හොන්ති. අප්පතරා ච භික්ඛූ අඤ්ඤාය සණ්ඨහන්ති."
            },
            {
                "type": "paragraph",
                "text": "න තාව කස්සප, සද්ධම්මස්ස අන්තරධානං හොති, යාව න සද්ධම්මපතිරූපකං ලොකෙ උප්පජ්ජති. යතො ච ඛො කස්සප සද්ධම්මපතිරූපකං ලොකෙ උප්පජ්ජති, අථ සද්ධම්මස්ස අන්තරධානං හොති. සෙය්යථාපි කස්සප, න තාව ජාතරූපස්ස අන්තරධානං හොති යාව න ජාතරූපපතිරූපකං ලොකෙ උප්පජ්ජති. යතො ච ඛො කස්සප ජාතරූපපතිරූපකං ලොකෙ උප්පජ්ජති, අථ ජාතරූපස්ස අන්තරධානං හොති. එවමෙව ඛො කස්සප, න තාව සද්ධම්මස්ස අන්තරධානං හොති, යාව න සද්ධම්මපතිරූපකං ලොකෙ උප්පජ්ජති. යතො ච ඛො කස්සප සද්ධම්මපතිරූපකං ලොකෙ උප්පජ්ජති, අථ සද්ධම්මස්ස අන්තරධානං හොති."
            },
            {
                "type": "paragraph",
                "text": "න ඛො කස්සප, පඨවීධාතු සද්ධම්මං අන්තරධාපෙති න ආපොධාතු සද්ධම්මං අන්තරධාපෙති න තෙජොධාතු සද්ධම්මං අන්තරධාපෙති. න වායොධාතු සද්ධම්මං අන්තරධාපෙති. අථ ඛො ඉධෙව තෙ උප්පජ්ජන්ති මොඝපුරිසා යෙ ඉමං සද්ධම්මං අන්තරධාපෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි කස්සප, නාවා ආදිකෙනෙව ඔපිලවති, න ඛො කස්සප, එවං සද්ධම්මස්ස අන්තරධානං හොති."
            },
            {
                "type": "paragraph",
                "text": "පඤ්ච ඛො මෙ කස්සප, ඔක්කමණියා ධම්මා සද්ධම්මස්ස සම්මොසාය අන්තරධානාය සංවත්තන්ති. කතමෙ පඤ්ච?"
            },
            {
                "type": "paragraph",
                "text": "ඉධ කස්සප, භික්ඛූ භික්ඛුනියො උපාසකා උපාසිකායො සත්ථරි අගාරවා විහරන්ති අප්පතිස්සා, ධම්මෙ අගාරවා විහරන්ති අප්පතිස්සා, සඞ්ඝෙ අගාරවා විහරන්ති අප්පතිස්සා, සික්ඛාය අගාරවා විහරන්ති අප්පතිස්සා, සමාධිස්මිං අගාරවා විහරන්ති අප්පතිස්සා. ඉමෙ ඛො කස්සප, පඤ්ච ඔක්කමණියා ධම්මා සද්ධම්මස්ස සම්මොසාය අන්තරධානාය සංවත්තන්ති."
            },
            {
                "type": "page-break",
                "text": "342"
            },
            {
                "type": "paragraph",
                "text": "පඤ්ච ඛො මෙ කස්සප, ධම්මා සද්ධම්මස්ස ඨිතියා අසම්මොසාය අනන්තරධානාය සංවත්තන්ති. කතමෙ පඤ්ච? ඉධ කස්සප, භික්ඛූ භික්ඛුනියො උපාසකා උපාසිකායො සත්ථරි සගාරවා විහරන්ති සප්පතිස්සා, ධම්මෙ සගාරවා විහරන්ති සප්පතිස්සා, සඞ්ඝෙ සගාරවා විහරන්ති සප්පතිස්සා, සික්ඛාය සගාරවා විහරන්ති සප්පතිස්සා, සමාධිස්මිං සගාරවා විහරන්ති සප්පතිස්සා ඉමෙ ඛො කස්සප, පඤ්ච ධම්මා සද්ධම්මස්ස ඨිතියා අසම්මොසාය අනන්තරධානාය සංවත්තන්තීති."
            },
            {
                "type": "centered",
                "text": "කස්සපවග්ගො පඨමො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තස්සුද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "සන්තුට්ඨඤ්ච අනොත්තාපී චන්දොපමං කුලූපගං,\nජිණ්ණං තයො ච ඔවාදා ඣානාභිඤ්ඤා උපස්සයං,\nචීවරං පරම්මරණං සද්ධම්මපතිරූපකන්ති."
            },
            {
                "type": "centered",
                "text": "කස්සපසංයුත්තං සමත්තං.",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ],
        "pages": {
            "298": {
                "pageNum": 298,
                "footnotesCount": 6
            },
            "300": {
                "pageNum": 300,
                "footnotesCount": 11
            },
            "302": {
                "pageNum": 302,
                "footnotesCount": 7
            },
            "304": {
                "pageNum": 304,
                "footnotesCount": 1
            },
            "306": {
                "pageNum": 306,
                "footnotesCount": 3
            },
            "308": {
                "pageNum": 308,
                "footnotesCount": 2
            },
            "310": {
                "pageNum": 310,
                "footnotesCount": 1
            },
            "312": {
                "pageNum": 312,
                "footnotesCount": 2
            },
            "314": {
                "pageNum": 314,
                "footnotesCount": 4
            },
            "316": {
                "pageNum": 316,
                "footnotesCount": 0
            },
            "318": {
                "pageNum": 318,
                "footnotesCount": 6
            },
            "320": {
                "pageNum": 320,
                "footnotesCount": 4
            },
            "322": {
                "pageNum": 322,
                "footnotesCount": 2
            },
            "324": {
                "pageNum": 324,
                "footnotesCount": 1
            },
            "326": {
                "pageNum": 326,
                "footnotesCount": 0
            },
            "328": {
                "pageNum": 328,
                "footnotesCount": 4
            },
            "330": {
                "pageNum": 330,
                "footnotesCount": 3
            },
            "332": {
                "pageNum": 332,
                "footnotesCount": 5
            },
            "334": {
                "pageNum": 334,
                "footnotesCount": 4
            },
            "336": {
                "pageNum": 336,
                "footnotesCount": 3
            },
            "338": {
                "pageNum": 338,
                "footnotesCount": 2
            },
            "340": {
                "pageNum": 340,
                "footnotesCount": 0
            },
            "342": {
                "pageNum": 342,
                "footnotesCount": 0
            }
        }
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "299"
            },
            {
                "format": 4,
                "text": "4. කස්සප සංයුක්තය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. කස්සප වර්ගය",
                "level": 2
            },
            {
                "type": "centered",
                "text": "4.1.1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සන්‌තුට්‌ඨ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "284. **සැවැත්නුවර-**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මේ කාශ්‍යප තෙමේ ඉතරීතර චීවරයෙන් (රූක්‍ෂප්‍රණීතාදීන් ලද පරිදි යම් කිසි සිවුරකින්) සන්තුෂ්ට - සතුටු වූයේ වෙයි ඉතරීතරචීවර සන්තොසයෙහි ගුණ කියනසුලු වූයේ, සිවුරු හේතුවෙන් අයුතු සෙවුමට නුසුදුසු පිළිවෙතට නො ද පැමිණෙයි. සිවුරු නො ලැබ නො ද තැවෙයි. සිවුරු ලැබ ද ගිජු නො වූයේ, මුසපත් නො වූයේ, තෘෂ්ණායෙන් නො වළදනා ලදුයේ දොස් දක්නා සුලු වූයේ, ප්‍රත්‍යවෙක්‍ෂාඥාන ඇතියේ පරිභෝග කෙරෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මේ කාශ්‍යප තෙමේ ඉතරීතර පිණ්ඩපාතයෙන් සතුටු වූයේ ඉතරීතර පිණ්ඩපාත සංතුෂ්ටියෙහි ගුණ කියනසුලු වූයේ, පිණ්ඩපාත හේතුවෙන් අනුලොම් නොවූ අයුරු සෙවුමට නො ද පැමිණෙයි. පිණ්ඩපාතය නො ලැබ ද නො තැවෙයි. පිණ්ඩපාතය ලැබ ද ගිජු නුවූයේ, මුසපත් නුවූයේ, තෘෂ්ණාවෙන් යටපත් නො වූයේ එහි දොස් දක්න සුලු වූයේ ප්‍රත්‍යවෙක්‍ෂාඥාන ඇතියේ පරිභොග කෙරෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මේ කාශ්‍යප තෙමේ යම් කිසි සෙනසුනකින් සතුටු වූයේ, යම්කිසි සෙනසුනකින් සතුටු වීමෙහි ගුණ කියනසුලු වූයේ, සෙනසුන් හේතුවෙන් නුසුදුසු සෙවුමට නො ද පැමිණෙයි. සෙනසුන නො ලැබ ද නො තැවෙයි. සෙනසුන ලැබ ද ගිජු නො වූයේ, මුසපත් නො වූයේ, තෘෂ්ණාවෙන් නො මැඩුනේ එහි දොස් දක්නාසුලු වූයේ, පස්විකුම් නුවණ ඇතියේ පරිභෝග කෙරෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මේ කාශ්‍යප තෙමේ ලද යම් කිසි ගිලන්පස බෙහෙසත් පිරිකරකින් සතුටු වූයේ, යම් කිසි ගිලන්පස බෙහෙසත් පිරිකරකින් සතුටු වීමෙහි ගුණ කියනසුලු වූයේ, ගිලන්පස බෙහෙසත් පිරිකර හේතුවෙන් නුසුදුසු අයුක්තානේවෂණයට නො ද පැමිණෙයි. ගිලන්පස බෙහෙසත් පිරිකර නො ලැබ ද නො තැවෙයි. ගිලන්පස බෙහෙසත් පිරිකර ලැබ ද ගිජු නො වූයේ, මුසපත් නො වූයේ තෘෂ්ණායෙන් නො වෙළුනේ, එහි දොස් දක්නාසුලු වුයේ, තිඃසරණප්‍රඥා ඇතියේ පරිභොග කෙරෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එහෙයින් මහණෙනි, මෙහි මෙසේ හික්මිය යුතු. ඉතරෙතර චීවරයෙන් සතුටු වන්නමෝ ඉතරෙතර චීවරසංතුෂ්ටියෙහි ගුණ කියන්නමෝ වන්නෙමු. සිවුරු හේතු කොට අප්‍රතිරූප අයුක්තානේවෂණයට නො ද පැමිණෙන්නෙමු. සිවුරු නො ලැබ ද නො තැවෙන්නෙමු. සිවුරු ලැබ ද ගිජු නො වන්නමෝ, මුසපත් නො වූවමෝ, තෘෂ්ණායෙන් නොමැඩුනමෝ, දෝස් දක්නාසුලු වූවමෝ, නිඃසරණප්‍රඥා ඇත්තමෝ පරිභෝග කරන්නෙමු. යම් කිසි පිණ්ඩපාතයකින් සතුටු වන්නෙමු … යම් කිසි සෙනසුනකින් සතුටු වූවමෝ වන්නෙමු … යම් කිසි ගිලන්පස බෙහෙසත් පිරිකරකින් සතුටු වූවමෝ, යම් කිසි ගිලන්පස බෙහෙසත් පිරිකරකින් සතුටු වීමෙහි ගුණ කියනසුල්ලමෝ වන්නෙමු. ගිලන්පස බෙහෙසත් පිරිකර හේතු කොට නුසුදුසු අයුතු අන්වෙෂණයට නො ද පැමිණෙන්නෙමු. ගිලන්පස බෙහෙසත් පිරිකර ලැබ ද ගිජු නො වූවමෝ, මුසපත් නො වූවමෝ තෘෂ්ණාවෙන් නො වැළදුනමෝ, දොස් දක්නා සුලු වූවමෝ, නිඃසරණප්‍රඥා ඇත්තමෝ පරිභෝග කරන්නෙමු යි. මහණෙනි, තොප විසින් මෙසේ හික්මිය යුතු මැ යි. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, කාශ්‍යප හා සම වන්නට නොද යමෙක් කාශ්‍යප හා සම වන්නේ නම් (එබන්දකු වන්නට) හෝ තොපට අවවාද කරමි අවවාද කරණ ලද තොප විසිනුදු ඒ පිණිස පිළිපැදිය යුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "301"
            },
            {
                "type": "centered",
                "text": "4. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනොත්‌තාපී සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "285. මා විසින් මෙසේ අසන ලදී: එක් කලෙක ආයුෂ්මත් මහසුප් තෙරණුවෝ ද ආයුෂ්මත් සැරියුත් තෙරණුවෝද, බරණැස් නුවර සමීපයෙහි මිගදාය නම් වූ ඉසිපතනාරාමයෙහි වැඩ වෙසෙති. එකල්හි ආයුෂ්මත් සැරියුත් තෙරණුවෝ සවස් කලැ පලසමවතින් නැගී සිටි සේක් ආයුසමත් මහසුප් තෙරණුවන් වෙත එළඹියහ එළඹ ආයුෂ්මත් මහසුප් සමග සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථා කොට නිමවා එකත්පසෙක වැඩ හුන්හ. එකත්පසෙක වැඩහුන් ආයුෂ්මත් සැරියුත් තෙරණුවෝ ආයුෂ්මත් මහසුප් තෙරණුවන්ට මෙය කීහ:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“ඇවැත්නි, කාශ්‍යපයෙනි, කෙලෙස් තවන වැර නැත්තේ පවට බිය නැත්තේ සම්බෝධිය පිණිස නො නිසි ය. නිවන පිණිස නො නිසි ය. අනුත්තර වූ අරහත්ත්වය පිණිස නො නිසි ය. කෙලෙස් තවන වීර්ය්‍යය ඇත්තේ ම පවට බිය ඇත්තේ ම සම්බොධිය පිණිස නිසි ය. නිවන පිණිස නිසි ය. අනුත්තර අර්හත්ත්වය ලැබීම පිණිස නිසි ය”යි මෙය කියනු ලැබෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“ඇවැත්නි, කොපමණෙකින් කෙලෙස් තවන වැර නැත්තේ පවට බිය නැත්තේ සම්බොධිය පිණිස නො නිසි වේ ද, නිවන පිණිස නො නිසි වේද, අනුත්තර අරහත්ත්වය ලැබීම පිණිස නො නිසි වේ ද? ඇවැත්නි, කොපමණකින් කෙලෙස් තවන වැර ඇත්තේ පවට බිය ඇත්තේ සම්බොධිය පිණිස නිසි වේ ද, නිවන පිණිස නිසි වේද, අනුත්තර අරහත්ත්වය ලැබීම පිණිස නිසි වේ දැ” යි?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, මෙහි මහණ තෙමේ නූපන් ලාමක අකුශලධර්මයෝ උපදනාහු මට අනර්ථය පිණිස පවතින්නාහ යි වීර්ය්‍යය නො කෙරේ ද, උපන් ලාමක අකුශල ධර්මයෝ ප්‍රහීණ නො වන්නාහු මට අනර්ථය පිණිස පවත්නාහ යි වීර්ය්‍යය නො කෙරේද, නූපන් කුශල ධර්මයෝ නූපදනාහු මට අනර්ථය පිණිස පවත්නාහ යි වීර්ය්‍යය නො කෙරේ ද, උපන් කුශලධර්මයෝ නිරුද්ධ වන්නාහු මට අනර්ථය පිණිස පවත්නාහ යි වීර්ය්‍යය නො කෙරේ ද, ඇවැත්නි, මෙසේ කෙලෙස් තවන වීර්ය්‍යය නැත්තේ වේ. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": " ඇවැත්නි, කෙසේ නම් පවට බිය නැත්තේ වේ ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, මෙහි මහණ තෙමේ නූපන් ලාමක අකුශලධර්මයෝ උපදනාහු මට අනර්ථය පිණිස පවත්නාහ යි බියපත් නො වේ ද, උපන් ලාමක අකුශලධර්මයෝ ප්‍රහීණ නො වන්නාහු මට අනර්ථය පිණිස පවත්නාහ යි බියපත් නො වේ ද, නූපන් කුශලධර්මයෝ නූපදනාහු මට අනර්ථය පිණිස පවත්නාහ යි බියපත් නො වේ ද, උපන් කුශලධර්මයෝ නිරුද්ධ වන්නාහු මට අනර්ථය පිණිස පවත්නාහ යි බියපත් නො වේ ද, ඇවැත්නි, මෙසේ පවට බිය නැත්තේ වේ. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, මෙසේ කෙලෙස් තවන වැර නැත්තේ, පවට බිය නැත්තේ, සම්බොධිය පිණිස නොනිසි වේ, නිවන පිණිස නො නිසි වේ. අනුත්තර අරහත්ත්වය ලැබීම පිණිස නො නිසි වේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "303"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, කෙසේ කෙළෙස් තවන වැර ඇත්තේ වේ ද? ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, මෙහි මහණ තෙමේ නූපන් ලාමක අකුශලධර්මයෝ උපදනාහු මට අනර්ථය පිණිස පවත්නාහ යි වීර්ය්‍යය කෙරේ ද, උපන් ලාමක අකුශලධර්මයෝ ප්‍රහීණ නො වන්නාහු මට අනර්ථය පිණිස පවත්නාහ යි වීර්ය්‍යය කෙරේ ද, නූපන් කුශලධර්මයෝ නූපදනාහු මට අනර්ථය පිණිස පවත්නාහ යි වීර්ය්‍යය කෙරේ ද, උපන් කුශලධර්මයෝ නිරුද්ධ වන්නාහු මට අනර්ථය පිණිස පවත්නාහ යි වීර්ය්‍යය කෙරේ ද; ඇවැත්නි, මෙසේ කෙළෙස් තවන වැර ඇත්තේ වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, කෙසේ පවට බිය ඇත්තේ වේ ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, මෙහි මහණ තෙමේ නූපන් ලාමක අකුශලධර්මයෝ උපදනාහු මට අනර්ථය පිණිස පවත්නාහ යි බයි ද, උපන් ලාමක අකුශලධර්මයෝ ප්‍රහීණ නො වන්නාහු මට අනර්ථය පිණිස පවත්නාහ යි බයි ද, නූපන් කුශල ධර්මයෝ නූපදනාහු මට අනර්ථය පිණිස පවත්නාහ යි බයි ද, උපන් කුශලධර්මයෝ නිරුද්ධවන්නාහු මට අනර්ථය පිණිස පවත්නාහ යි බයි ද, ඇවැත්නි, මෙසේ පවට බිය ඇත්තේ වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, මෙසේ කෙලෙස් තවන වැර ඇත්තේ පවට බිය ඇත්තේ සම්බොධිය පිණිස නිසි වේ. නිවන පිණිස නිසි වේ. අනුත්තර අරහත්ත්වය ලැබීම පිණිස නිසි වේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "4. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "චන්‌දූපම සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "286. **සැවැත්නුවර-**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, (කිසිවකු කෙරෙහි නො ඇලෙමින් අහස් නගින) චන්ද්‍රයා වැනිව සත්ථවාදියෙන්) කය ඉවත් කොට ම සිත ඉවත් කොට ම නිති (ආගන්තුකයකු මෙන්) අලුත් ව කුලයන්හි ප්‍රගල්භ (ගැටීම්) රහිතව කුලයන් වෙත එළඹෙවු. මහණෙනි, යම් සේ පුරුෂයෙක් ගරාවැටුනු ලිඳක් හෝ කඳුබෑවුමක් හෝ ගංඉවුරු බුන් තැනක් හෝ කය ඉවත් කොට ම සිත ඉවත් කොට ම බලන්නේ ද, මහණෙනි එසෙයින් ම චන්ද්‍රයා වැනි ව කය ඉවත් කොට ම සිත ඉවත් කොට ම නිතර අලුත් ව, කුලයන්හි නො ගැටී කුලයන් වෙත එළඹෙවු. මහණෙනි, කසුප් තෙමේ සඳ වැනි ව කය ඉවත් කොට ම සිත ඉවත් කොට ම නිතර අලුත් ව කුලයන්හි නො ගැටී කුලයන් වෙත එළඹෙයි. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ඒ කිමැයි හඟීවු ද, කෙබඳු මහණෙක් කුලයන් වෙත එළඹෙන්නට නිසි දැ යි? ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "“වහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේ නේතෘ කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේ පිහිට කොට ඇත්තාහ. වහන්ස, මේ භාෂිතයෙහි අර්ථය භාග්‍යවතුන් වහන්සේට ම වැටහේවා, මැනවි. (ඒ අර්ථය) භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු දරන්නාහ” යි. "
            },
            {
                "type": "page-break",
                "text": "305"
            },
            {
                "format": 13,
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ අහසෙයි අත සැලූහ. මහණෙනි, යම් සේ මේ අත අහසෙහි නො ඇලේ ද, නො ගැණේ ද, නො බැඳේ ද, මහණෙනි, එසෙයින් ම කුලයන් වෙත එළඹෙන යම් කිසි මහණකුගේ සිත “ලබනු කැමැත්තෝ ලබත්වා. පින් කැමැත්තෝ පින් කෙරෙත්වා” යි කුලයන්හි නො ඇලේ ද, නො ගැණේ ද, නො බැඳේ ද, තමහට ලැබීමෙන් යම් සේ සතුටු සිත් ඇත්තේ මනා සිත් ඇත්තේ වේ නම් එසේ ම මෙරමාහට ලැබීමෙනුත් සතුටු සිත් ඇත්තේ මනා සිත් ඇත්තේ වේ ද, මහණෙනි, මෙබඳු මහණ තෙමේ කුලයන් වෙත එළඹෙන්නට නිසි ය. මහණෙනි, කුලයන් වෙත එළඹෙන කසුප්හුගේ සිත “ලබනු කැමැත්තෝ ලබත්වා, පින් කැමැත්තෝ පින් කෙරෙත්වා” යි කුලයන්හි නො ඇලෙයි. නො ගැණෙයි. නො බැඳෙයි. තමහට ලැබීමෙන් යම් සේ සතුටු සිත් ඇත්තේ මනා සිත් ඇත්තේ වේ නම් මෙරමාහට ලැබීමෙනුත් සතුටු සිත් ඇත්තේ මනා සිත් ඇත්තේ වෙයි. මහණෙනි, මෙබඳු මහණ තෙමේ කුලයන් වෙත එළඹෙන්නට නිසි ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ඒ කිමැ යි හඟිවු ද, කෙබඳු මහණහුගේ දම්දෙසුම අපිරිසිදු ද, කෙබඳු මහණහුගේ දම්දෙසුම පිරිසිදු දැ යි? “වහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේ නේතෘ කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේ පිළිසරණ කොට ඇත්තාහ. වහන්ස, මේ දේශනාවෙහි අර්ථය භාග්‍යවතුන් වහන්සේට ම වැටහේවා, මැනවි. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු දරන්නාහ” යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එසේ නම් අසවු, මැනවින් මෙනෙහි කරවු, කියන්නෙමි යි. වහන්ස, එසේ ය යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් අස්වූහ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යම් කිසි මහණෙක් “මගේ දහම් අසන්නාහු නම්, අසාත් පහන් වන්නාහු නම්, පහන් වූවහුත් මට පහන් අයුරු (ප්‍රකාශ) කරන්නාහු නම් ඉතා මැනැවැ” යි මෙබඳු සිත් ඇත්තේ මෙරමාහට දහම් දෙසා ද, මහණෙනි, මෙබඳු මහණහුගේ දම් දෙසුම අපිරිසිදු වෙයි. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යම් කිසි මහණෙක් මෙබඳු සිත් ඇත්තේ මෙරමාහට දහම් දෙසාද- “භාග්‍යවතුන් වහන්සේ විසින් ධර්මය ස්වාක්ඛ්‍යාත ය, සාන්දෘෂ්ටික ය, අකාලික ය, එහිපස්සීක ය, ඔපනයික ය, විඥයන් විසින් තමන් තමන් විසින් ම දත යුතු යි. මාගේ ධර්මය අසන්නාහු නම්, අසාත් ධර්මය අවබෝධ කරන්නාහු නම්, අවබෝධ කොටත් ඒ පිණිස පිළිපදනාහු නම් ඉතා මැනැවැ” යි මෙසේ ධර්මසුධර්මත්වය නිසා මෙරමාහට දහම් දෙසා ද, කරුණාව නිසා මෙරමාහට දහම් දෙසා ද, අනුද්දයාව නිසා මෙරමාහට දහම් දෙසා ද, අනුකම්පාව නිසා මෙරමාහට දහම් දෙසා ද, මහණෙනි, මෙබඳු මහණහුගේ දම්දෙසුම පිරිසිදු වේ. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, කාශ්‍යප තෙමේ මෙබඳු සිත් ඇත්තේ මෙරමාහට දහම් දෙසයි: “භාග්‍යවතුන් වහන්සේ විසින් ධර්මය ස්වාක්ඛ්‍යාත ය, සන්දෘෂ්ටික ය, අකාලිකය, එහිපස්සික ය, ඔපනයික ය, විඥයන් විසින් තමතමා කෙරෙහි ලා දත යුතු යි මාගේ ධර්මය අසන්නාහු නම්, අසාත් ධර්මය අවබෝධ කරන්නාහු නම්, අවබෝධ කොටත් ඒ පිණිස පිළිපදනාහු නම් ඉතා මැනැවැ” යි මෙසේ ධර්මසුධර්මත්වය නිසා මෙරමාහට දහම් දෙසයි. කරුණාව නිසා මෙරමාහට දහම් දෙසායි අනුද්දයාව නිසා මෙරමාහට දහම් දෙසායි. අනුකම්පාව නිසා මෙරමාහට දහම් දෙසයි. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ඒ කාශ්‍යප හා සමාන වන්නට හෝ යමෙක් කාශ්‍යප බඳු වන්නේ නම් (එබන්දකු වන්නට හෝ) ඒ තොපට අවවාද කරමි. අවවාද කරන ලද්දා වූ ද තොප විසින් ඒ පිණිස පිළිපැදිය යුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "307"
            },
            {
                "type": "centered",
                "text": "4. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කුලූපක සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "287. **සැවැත්නුවර-**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ඒ කිමැයි හඟිවු ද, කෙබඳු මහණ තෙමේ කුලුපග වන්නට නිසි ද, කෙබඳු මහණ තෙමේ කුලුපග වන්නට නො නිසි දැ යි? වහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තාහ … “භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂුහු දරන්නාහුය” … භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යම් කිසි මහණෙක් “මට එකැතින් ම දෙත්වා, නො ම නො දෙත්වා. මට බොහෝවක් ම දෙත්වා, ස්වල්පයක් නො දෙත්වා. මට පිණි වූවක් ම දෙත්වා, කුළු වූවක් නො දෙත්වා. මට වහා ම දෙත්වා. ලස් ව නො දෙත්වා. මට සකසා ම දෙත්වා, නො සකසා නො දෙත්වා” යි මෙබඳු සිත් ඇත්තේ කුලයන් වෙත එළඹේ ද, මහණෙනි, මෙබඳු සිත් ඇති ව කුලයන් වෙත එළඹෙන ඒ මහණහට ඉදින් නො දෙද්ද, එයින් මහණ තෙමේ පෙළෙයි. ඒ හේතු කොට ගෙණ හෙතෙමේ දුකක් දොම්නසක් විඳියි. ඉදින් ටිකක් දෙද්ද, බොහෝවක් නො දෙද්ද, එයින් මහණ තෙමේ පෙළෙයි. හෙතෙමේ ඒ හේතු කොට ගෙණ දුකක් දොම්නසක් විඳියි. ඉදින් කුළු වූවක් දෙද්ද, පිණි වූවක් නො දෙද්ද, එයින් මහණ තෙමේ පෙළෙයි. හෙතෙමේ ඒ හෙතු කොට ගෙණ දුකක් දොම්නසක් විඳියි. ඉදින් ලස් ව දෙද්ද, වහා නො දෙද්ද, එයින් මහණ තෙමේ පෙළෙයි. හෙතෙමේ ඒ හේතු කොට ගෙණ දුකක් දොම්නසක් විඳියි. ඉදින් නො සකසා දෙද්ද, සකසා නො දෙද්ද, එයින් මහණ තෙමේ පෙළෙයි. හෙතෙමේ ඒ හෙතු කොට ගෙණ දුකක් දොම්නසක් විඳියි. මහණෙනි, මෙබඳු මහණ තෙමේ කුලුපග වන්නට නො නිසි ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යම් කිසි මහණෙක් “මට එකැතින් ම දෙත්වා, නො ම නො දෙත්වා. මට බොහෝවක් ම දෙත්වා, ටිකක් නො දෙත්වා, මට පිණි වූවක් ම දෙත්වා, කුළු වූවක් නො දෙත්වා. මට වහා ම දෙත්වා, ලස් ව නො දෙත්වා. මට සකසා ම දෙත්වා, නො සකසා නො දෙත්වායි-මෙය මෙහි අනුන්ගේ කුලයන්හි කොයින් ලැබිය හැකි දැ” යි මෙබඳු සිත් ඇත්තේ කුලයන් කරා එළඹේ ද, මහණෙනි, මෙබඳු සිත් ඇති ව කුලයන් කරා එළඹෙන ඒ මහණහට ඉදින් නො දෙද්ද, එයින් මහණ තෙමේ නො පෙළෙයි හෙතෙමේ ඒ හෙතු කොට ගෙණ දුකක් දොම්නසක් නො විඳියි. ඉදින් මඳක් දෙද්ද, බොහෝවක් නො දෙද්ද, එයින් මහණ තෙමේ නො පෙළෙයි. හෙතෙමේ ඒ හේතු කොට ගෙණ දුකක් දොම්නසක් නො විඳියි. ඉදින් කුළු වූවක් දෙද්ද, පිණි වූවක් නො දෙද්ද, එයින් මහණ තෙමේ නො පෙළෙයි. හෙතෙමේ ඒ හේතු කොට ගෙණ දුකක් දොම්නසක් නො විඳියි. ඉදින් ලස් ව දෙද්ද, වහා නො දෙද්ද, එයින් මහණ තෙමේ නො පෙළෙයි. හෙතෙමේ ඒ හේතු කොට ගෙණ දුකක් දොම්නසක් නො විඳියි. ඉදින් නො සකසා දෙද්ද, සකසා නො දෙද්ද, එයින් මහණ තෙමේ නො පෙළෙයි. හෙතෙමේ ඒ හේතු කොට ගෙණ දුකක් දොම්නසක් නො විඳියි. මහණෙනි, මෙබඳු මහණ තෙමේ කුලුපග වන්නට නිසි ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, කාශ්‍යප තෙමේ “මට එකැතින් ම දෙත්වා, නො ම නො දෙත්වා. මට බොහෝවක් ම දෙත්වා, මදක් නො දෙත්වා. මට පිණි වූවක් ම දෙත්වා, කුළු වූවක් නො දෙත්වා, මට වහා ම දෙත්වා, ලස් ව නො දෙත්වා, මට සකසා ම දෙත්වා, නො සකසා නො දෙත්වාය” යි මෙය මෙහි අනුන්ගේ කුලයන්හි කොයින් ලැබිය හැකි දැ” යි මෙබඳු සිත් ඇත්තේ කුලයන් වෙත එළඹෙයි. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "309"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මේ බඳු සිත් ඇති ව කුලයන් වෙත එළඹෙන ඒ කසුප්හට ඉදින් නො දෙද්ද, එයින් කසුප් තෙමේ නො පෙළෙයි. හෙතෙමේ ඒ හේතු කොට ගෙන දුකක් දොම්නසක් නො විඳියි. ඉදින් මදක් දෙද්ද, බොහෝවක් නො දෙද්ද, එයින් කසුප් තෙමේ නො පෙළෙයි. හෙතෙමේ ඒ හේතු කොට ගෙණ දුකක් දොම්නසක් නො විඳියි. ඉඳින් කුළු වූවක් දෙද්ද, පිණි වූවක් නො දෙද්ද, එයින් කසුප් තෙමේ නො පෙළෙයි. හෙතෙමේ ඒ හේතු කොට ගෙණ දුකක් දොම්නසක් නො විඳියි. ඉදින් සල් ව දෙද්ද, වහා නො දෙද්ද, එයින් කසුප් තෙමේ නො පෙළෙයි. හෙතෙමේ ඒ හේතු කොට ගෙණ දුකක් දොම්නසක් නො විඳියි. ඉඳින් නො සකසා දෙද්ද, සකසා නො දෙද්ද, එයින් කසුප් තෙමේ නො පෙළෙයි. හෙතෙමේ ඒ හේතු කොට ගෙණ දුකක් දොම්නසක් නො විඳියි. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, කාශ්‍යපයන් හා සමාන වන්නට හෝ යමෙක් කසුප් බඳු වන්නේ නම් (එබන්දකු වන්නට හෝ) ඒ තොපට අවවාද කරමි. අවවාද කරන ලද්දා වූ තොප විසින් ද ඒ පිණිස පිළිපැදිය යුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "4. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ජිණ්‌ණ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "288. මා විසින් මෙසේ අසන ලදි: එක් කලෙක භාග්‍යවතුන් වහන්සේ රජගහනුවර සමීපයෙහි කලඥක නිවාප නම් වූ වේළුවනාරාමයෙහි වැඩ වසන සේක. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි ආයුෂ්මත් මහකසුප් තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් ආයුෂ්මත් මහසුප්හට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. කාෂ්‍යප, දැන් තෙපි මහලු වහු. හණපිලියෙන් කළ (භාග්‍යවතුන් විසින් පළමු පොරොවා හළ බැවින්) නිබ්බසන වූ (නැවත නැවත කළ ගෙත්තම් ඇති) මේ පවුල් සිවුරු (දැරීම) තොපට බර ය. කස්සප, එහෙයින් දැන් තෙපි (පාංශුකූලිකාඞ්ගාදිය හැර) ගැහැවි සිවුරු ද දරවු. ලහබත් ආදි නිමන්ත්‍රණයන්හි ද වළදවු, මා ලඟ ද වෙසෙවු.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, මම දිගුකලක් ආරණ්‍යක ද, ආරණ්‍යක බැව්හි ගුණ බණනුයේ ද, පිණ්ඩපාතික ද, පිණ්ඩපාතික බැව්හි ගුණකියනුයේ ද, පාංසුකූලික ද, පාංසුකූලික බැව්හි ගුණ කියණුයේ ද, තෙචීචරික ද,තෙචීචරික බැව්හි ගුණ කියනුයේ ද, අල්පෙච්ඡ ද, අල්පෙච්ඡ බැව්හි ගුණ කියනුයේ ද, සන්තුෂ්ට ද, සන්තුෂ්ට බැව්හි ගුණ කියනුයේ ද, ප්‍රවිවික්ත ද, ප්‍රවිවෙකයෙහි ගුණ කියනුයේ ද, අසංසෘෂ්ට ද, අසංසර්ගයෙහි ගුණ කියනුයේ ද, ආරබ්ධවීර්ය්‍යය ද, වීර්ය්‍යාරම්හයෙහි ගුණ කියනුයේ ද වෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කාශ්‍යප, තෙපි කිනම් ප්‍රයෝජනයක් දක්නහු දිඟුකලක් ආරණ්‍යක ද, ආරණ්‍යක බැව්හි ගුණ කියනුයේ ද? පිණ්ඩපාතික ද ... පංසූකූලික ද ... තෙචීචරික ද ... අල්පෙච්ඡ ද ... සන්තුෂ්ට ද … ප්‍රවිවික්ත ද … අසංසෘෂ්ට ද … ආරබ්ධවීර්ය්‍ය ද වීර්ය්‍යාරම්හයෙහි ගුණ කියනුයේ දැ යි?",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "311"
            },
            {
                "format": 13,
                "text": "වහන්ස, මම ප්‍රයෝජන දෙකක් දකිමින් දිගුකලක් ආරණ්‍යක ද ආරණ්‍යක බැව්හි ගුණ කියනුයේ ද වෙමි පිණ්ඩපාතික ද … පාංශුකූලික ද ... තෙචීචරිකද ... අල්පෙච්ඡ ද ... සන්තුෂ්ට ද ... ප්‍රවිවික්තද ... අසංසෘෂ්ට ද ... ආරබ්ධවීර්ය්‍ය ද වීර්ය්‍යාරම්භයෙහි ගුණ කියනුයේ ද වෙමි: තමාගේ ඉහාත්ම සැපවිහරණය දකිමිනුත් “පශ්චිම ජනතාව දෘෂ්ටානුගතියට පැමිණෙන්නේ නම් මැනවැ” යි පශ්චිම ජනතාවට අනුකම්පා කරමිනුත් ය. යම් ඒ බුදු අනුබුදු සව්වෝ වූහු ද ඔහු දිගුකලක් අරණ්‍යක ද අරණ්‍යක බැව්හි ගුණ කියනුවෝ ද වූහ පිණ්ඩපාතික ද ... වූහ. පාංශුකූලික ද ... වූහ. තෙචීචරක ද වූහ අල්පෙච්ඡ ද ... වූහ සන්තුෂ්ට ද … වූහ ප්‍රවිවික්ත ද … වූහ අසංසෘෂ්ට ද වූහ. ආරබ්ධවීර්ය්‍ය ද වීර්ය්‍යාරම්භයෙහි ගුණ කියනුවෝ ද වූහ. ඔහු ඒ පිණීස පිළිපදනාහ. ඔවුනට එය දිගුකලක් හිත පිණීස සැප පිණීස වන්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "වහන්ස, මම මේ ප්‍රයෝජන දෙක දකිමින් දිගුකලක් ආරණ්‍යක ද ආරණ්‍යක බැව්හි ගුණ කියනුයේ ද ... පිණ්ඩපාතික ද ... පාංශුකූලික ද ... තෙචීචරික ද ... අල්පෙච්ඡ ද ... සන්තුෂ්ට ද … ප්‍රවිවික්ත ද ... අසංසෘෂ්ට ද ... ආරබ්ධවීර්ය්‍ය ද වීර්ය්‍යාරම්භයෙහි ගුණ කියනුයේ ද වෙමි."
            },
            {
                "format": 13,
                "text": "කාශ්‍යප, මැනවි, මැනවි. කාශ්‍යප, තෙපි බොහෝ ජනයාට හිත පිණිස, බොහෝ ජනයාට සුව පිණිස ලොවට අනුකම්පා පිණීස දෙව් මිනිසුන්ට හිත වැඩ පිණිස පිළිපන්නහු ය. කාෂ්‍යප, එහෙයින් තෙපි හණපිලියෙන් කළ පරිභෝගයෙන් මාලු වූ පවුල්සිවුරුම දරවු. පිඬු පිණිසත් හැසිරෙවු වෙනෙහිත් වෙසෙවු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "4. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඔවාද සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "289.** රජගහනුවර-**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකල්හි ආයුෂ්මත් මහසුප් තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එකත්පසෙක හුන් ආයුෂ්මත් මහසුප්හට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: “කස්සප, භික්ෂූන්ට අවවාද කරව. කස්සප, භික්ෂූන්ට දැහැමි කතා කරව. කස්සප, මම හෝ භික්ෂූන්ට අවවාද කරන්නෙමි. තෙපි හෝ (අවවාද කරවු.) මම හෝ භික්ෂූන්ට දැහැමි කතා කරන්නෙමි. තෙපි හෝ (කරවු)” යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ස්වාමිනි, භාග්‍යවතුන් වහන්ස, දැන් භික්ෂූහු නො කිකරුහ. නො කිකරු බව කරණ දැයින් යුත්තයහ. නො ඉවසන්නෝ ය, අනුශාසනාව නුහුරට ගන්නෝ ය. වහන්ස, මෙහි මම ආනන්දගේ සද්ධිවිහාරික වූ භණඩු නම් මහණ ද, අනුරුද්ධගේ සද්ධිවිහාරික වූ ආභිඤජික නම් මහණ ද “මහණ, එව, කවරෙක් (ධර්මකථාවෙහි) ඉතා වැඩියක් කියන්නේ ද, කවරෙක් ඉතා සොඳුරු කොට කියන්නේද, කවරෙක් බොහෝ වේලාවක් කියන්නේ දැ” යි උගත්කමින් ඔවුනොවුන් ඉක්මවා කියනුවන් දිටිමි යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "313"
            },
            {
                "format": 13,
                "text": "එකල්හි භාග්‍යවතුන් වහන්සේ, මහණ, එව, තෝ මාගේ වචනයෙන් “ශාස්තෲන් වහන්සේ ආයුෂ්මතුන් කැඳවන සේකැ” යි ආනන්දගේ සද්ධි විහාරික වූ භණ්ඩු නම් මහණ ද, අනුරුද්ධගේ සද්ධිවිහාරික වූ ආභිඤජික නම් මහණ ද කැඳව” යි එක්තරා මහණකු ඇමතූ සේක. වහන්ස, එසේ යයි ඒ මහණ තෙමේ භාග්‍යවතුන් වහන්සේට පිළිතුරු දී ඒ භික්ෂූන් වෙත එළඹියේ ය. එළඹ ඒ භික්ෂූන්ට “ශාස්තෲන් වහන්සේ ආයුෂ්මතුන් අමතන සේකැ”යි මෙය කී ය. “ඇවැත්නි, එසේ ය” යි ඒ භික්ෂූහු ඒ මහණහට පිළිතුරුදී භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ වඳ එකත්පසෙක හුන්හ. එකත්පසෙක හුන් ඒ භික්ෂූන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “මහණෙනි, සැබෑ ද තෙපි “මහණ, එව කවරෙක් ඉතා වැඩියක් කියන්නේ ද, කවරෙක් ඉතා සොඳුරු (මිහිරි) කොට කියන්නේ ද, කවරෙක් බොහෝ වේලාවක් කියන්නේ දැ” යි උගත්කමින් ඔවුනොවුන් ඉක්මවා කියවු ද? වහන්ස, එසේ ය යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, “තෙපි එවු, ‘මහණ එව කවරෙක් ඉතා වැඩියක් බණන්නේ ද, කවරෙක් ඉතා සොඳුරු කොට, බණන්නේ ද, කවරෙක් බොහෝ වෙලාවක් බණන්නේ දැ’ යි උගත්කමින් ඔවූනොවුන් ඉක්මවා කියවු” යි මවිසින් එසේ දෙසු දහමක් කිම, තෙපි දන්නහු ද? වහන්ස, මෙය නො වේ ම ය. මහණෙනි, තෙපි මා විසින් “මෙසේ දහම් දෙසන ලදැ”යි ඉදින් නො දන්නාහු නම් එසේ කල්හි, මොඝ (හිස්) පුරුෂයෙනි, තෙපි දැන් කුමක් හෙයින් කුමක් දන්නාහු, කුමක් දක්නාහු මෙසේ ස්වාක්ඛ්‍යාත ධර්මවිනයෙහි - ශාසනයෙහි පැවිදි වූවාහු, “මහණ, එව, කවරෙක් ඉතා වැඩියක් බණන්නේද, කවරෙක් ඉතා සොඳුරු කොට බණන්නේ ද, කවරෙක් බොහෝ වෙලාවක් බණන්නේ දැ”යි ශ්‍රැතයෙන් ඔවුනොවුන් එක්මවා කියවු ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ පාහි හිසින් වැටී, “වහන්ස, යම් බඳු අපි මෙසේ ස්වාක්ඛ්‍යාත වූ ශාසනයෙහි පැවිදි වූවාහු ම “මහණ එව, කවරෙක් ඉතා වැඩියක් බණන්නේද, කවරෙක් ඉතා සොඳුරු කොට බණන්නේ ද, කවරෙක් බොහෝ වේලාවක්‌ බණන්නේ දැ”යි ශ්‍රැතයෙන් ඔවුනොවුන් ඉක්මවා කීම්හ, අපගේ වරද බාලයන් සේ මෝඩයන් සේ අදක්ෂයන් සේ ඒ අප ඉක්මවා ගියේ ය. වහන්ස, භාග්‍යවතුන් වහන්සේ ඒ අපගේ වරද ආයති සංවරය පිණිස වරද වශයෙන් පිළිගන්නා සේක්වා\" යි. යචචා කළහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යම් බඳු තෙපි මෙසේ ස්වාක්ඛ්‍යාත වූ සසුනෙහි පැවිදි වූවාහු ම ‘මහණ, එව, කවරෙක් ඉතා වැඩියක් කියන්නේ ද, කවරෙක් සොඳුරු කොට කියන්නේ ද, කවරෙක් බොහෝ වෙලාවක් කියන්නේ දැ” යි ශ්‍රැතයෙන් ඔවුනොවුන් ඉක්මවා කීවහු ද, බාලයන් සේ මෝඩයන් සේ අදක්ෂයන් සේ ඒකාන්තයෙන් වරද ඒ තොප ඉක්ම ගියේ ය. මහණෙනි, යම් හෙයකින් තෙපි වරද වරද වශයෙන් දැක දහම් වූ පරිදි පිළියම් කරවු ද, තොපගේ ඒ වරද අපි පිළිගණිමු මහණෙනි, යමෙක් වරද වරද වශයෙන් දැක දහම් වූ පරිදි පිළියම් කෙරේ ද, මතුත් සංවරයට පැමිණේ ද, ආර්ය්‍යශාසනයෙහි මේ වැඩීමෙකි යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "315"
            },
            {
                "type": "centered",
                "text": "4. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දෙවන ඔවාද සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "290. **සැවැත්නුවර-**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකල්හි ආයුෂ්මත් මහසුප් තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය … එකත්පසෙක හුන් ආයුෂ්මත් මහසුප්හට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක කස්සප, භික්‍ෂූන්ට අවවාද කරවු කස්සප, භික්‍ෂූන්ට දැහැමි කතා කරවු. කස්සප, මම හෝ භික්‍ෂූන්හට අවවාද කරන්නෙමි. තෙපි හෝ (අවවාද කරවු.) කස්සප, මම හෝ භික්‍ෂූන්ට දැහැමි කතා කරන්නෙමි. තෙපි හෝ (දැහැමි කතා කරවු යි.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ස්වාමිනි, භාග්‍යවතුන් වහන්ස, දැන් භික්‍ෂූහු දුර්වවහ. දුවවබැව් කරණ දහමින් සමන්විතහ. නො ඉවසන්නෝ ය. අනුශාසනාව නුහුරට ගන්නෝ ය. වහන්ස, යම් කිසිවකුට කුසල් දහම්හි සැදැහැ නැද්ද, කුසල්දහම්හි හිරි නැද්ද, කුසල්දහම්හි ඔතප් නැද්ද, කුසල්දහම්හි වැර නැද්ද, කුසල්දහම්හි නුවණ නැද්ද, ඔහුට යම් රැයෙක් හෝ දවාලෙක් හෝ පැමිණේ නම් කුසල්දහම්හි පිරිහීම ම කැමති විය යුතු. වැඩීම කැමති විය නොහේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, යම් සේ කලුවරපස සඳට යම් රැයෙක් හෝ දවාලෙක් හෝ පැමිණේ නම් සඳ පැහැයෙන් පිරිහේ ම ය, මඬලින් පිරිහේ ම ය, දීප්තියෙන් පිරිහේම ය, උසමහතින් පිරිහේ ම ය. වහන්ස, එසෙයින් ම යම් කිසිවකුහට කුසල්දහම්හි සැදැහැ නැද්ද, … හිරි නැද්ද, … ඔතප් නැද්ද, ... වැර නැද්ද, කුසල්දහම්හි නුවණ නැද්ද, ඔහුට යම් රැයෙක් හෝ දවාලෙක් හෝ පැමිණේ නම් කුසල්දහම්හි පිරිහීම ම කැමති විය යුතු. වැඩීම කැමති විය නොහේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, ‘සැදහැ නැති පුරුෂපුද්ගලයා’ යන මෙය පිරිහීමෙකි වහන්ස, ‘හිරි නැති පුරුෂපුද්ගලයා’ යන මෙය පිරිහීමෙකි. වහන්ස, ‘ඔතප් නැති පුරුෂපුද්ගලයා’ යන මෙය පිරිහීමෙකි. වහන්ස, ‘කුසීත පුරුෂපුද්ගලයා, යන මෙය පිරිහීමෙකි. වහන්ස, ‘දුෂ්ප්‍රාඥ පුරුෂපුද්ගලයා’ යන මෙය පිරිහීමෙකි. වහන්ස, ‘කිපෙනසුලු පුරුෂපුද්ගලයා’ යන මෙය පිරිහීමෙකි. වහන්ස, ’බද්ධවෛර ඇති පුරුෂපුද්ගලයා’ යන මෙය පිරිහීමෙකි වහන්ස, අවවාද කරණ භික්‍ෂූහු නැත්තාහ යන’ මෙය පිරිහීමෙකි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, යම් කිසිවකුට කුසල්දහම්හි සැදැහැ ඇද්ද, කුසල්දහම්හි හිරි ඇද්ද, කුසල්දම්හි ඔතප් ඇද්ද, කුසල්දහම්හි වැර ඇද්ද, කුසල්දහම්හි නුවණ ඇද්ද, ඔහුට යම් රැයෙක් හෝ දවාලෙක් පැමිණේ නම් කුසල්දහම්හි වැඩීම ම කැමති විය යුතු. පිරිහීම කැමති විය නොහේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, පුරපස සඳට යම් රැයෙක් හෝ දවාලෙක් හෝ පැමිණේ නම් පැහැයෙන් වැඩේ ම ය. මඬලින් වැඩේ ම ය. දීප්තියෙන් වැඩේ ම ය. උසමහතින් වැඩේ ම ය. වහන්ස, එසෙයින් ම යම් කිසිවකුට කුසල්දහම්හි සැදැහැ ඇද්ද, … හිරි ඇද්ද, … ඔතප් ඇද්ද, … වැර ඇද්ද, කුසල්දහම්හි නුවණ ඇද්ද, ඔහුට යම් රැයෙක් හෝ දවාලෙක් හෝ පැමිණේ නම් කුසල්දහම්හි වැඩීම ම කැමති විය යුතු. පිරිහීම කැමැති විය නොහේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "317"
            },
            {
                "format": 13,
                "text": "වහන්ස, ‘සැදැහැති පුරුෂපුද්ගලයා’ යන මෙය නො පිරිහීමෙකි. වහන්ස, ‘හිරි ඇති පුරුෂපුද්ගලයා’ යන මෙය නො පිරිහීමෙකි. වහන්ස, ‘ඔතප් ඇති පුරුෂපුද්ගලයා’ යන මෙය නො පිරිහීමෙකි. වහන්ස, ‘ඇරඹූ වෑර ඇති පුරුෂපුද්ගලයා යන මෙය නො පිරිහීමෙකි. වහන්ස, ‘නුවණැති පුරුෂපුද්ගලයා’ යන මෙය නො පිරිහිමෙකි. වහන්ස, ‘නො කිපෙනසුලු පුරුෂපුද්ගලයා’ යන මෙය නො පිරිහීමෙකි. වහන්ස, ‘බද්දවෛරය නැති පුරුෂපුද්ගලයා’ යන මෙය නො පිරිහීමෙකි. වහන්ස, ‘අවවාද කරණ භික්ෂූහු ඇත්තාහ’ යන මෙය නො පිරිහීමෙකි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සප, මැනවි, මැනවි. කස්සප, යම් කිසිවකුට කුසල්දහම්හි සැදැහැ නැද්ද ... හිරි නැද්ද … ඔතප් නැද්ද … වැර නැද්ද, කුසල් දහම්හි නුවණ නැද්ද, ඔහුට යම් රැයෙක් හෝ දවාලෙක් හෝ පැමිණේ නම් කුසල්දහම්හි හානිය ම කැමති විය යුතු. වැඩිම කැමති විය නො හේ. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සප, යම් සේ කලුවරපස සඳට යම් රැයෙක් දවාලෙක් හෝ පැමිණේ නම් පැහැයෙන් පිරිහේ ම ය. මඬලින් පිරිහේම ය. දීප්තියෙන් පිරිහේ ම ය. උසමහතින් පිරිහේ ම ය. කස්සප, එසෙයින් ම යම් කිසිවකුහට කුසල් දහම්හි සැදැහැ නැද්ද ... හිරි නැද්ද … ඔතප් නැද්ද ...වැර නැද්ද, කුසල්දහම්හි නුවණ නැද්ද, ඔහුට යම් රැයෙක් හෝ දවාලෙක් හෝ පැමිණේ නම් කුසල්දහම් හි පිරිහීම ම කැමති විය යුතු. වැඩීම කැමති විය නොහේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සප, ‘සැදැහැ නැති පුරුෂපුද්ගලයා’ යන මෙය පිරිහීමෙකි. හිරි නැති … ඔතප් නැති … කුසිත … නුවණ නැති … කිපෙනසුලු … කස්සප, ‘බද්දවෛර ඇති පුරුෂපුද්ගලයා’ යන මෙය පිරිහීමෙකි. කස්සප, ‘අවවාද කරණ භික්ෂූහු නැත්තාහ’ යන මෙය පිරිහීමෙකි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සප, යම් කිසිවකුහට කුසල්දහම්හි සැදැහැ ඇද්ද, හිරි … ඔතප් ... වැර … කුසල්දහම්හි නුවණ ඇද්ද, ඔහුට යම් රැයෙක් හෝ දවාලෙක් හෝ පැමිණේ නම් කුසල්දහම්හි වැඩීම ම කැමැති විය යුතු ය. පිරීහීම කැමති නො විය යුතු යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සප, යම්සේ පුර සඳට යම් රැයෙක් හෝ දවාලෙක් හෝ පැමිණේ නම් පැහැයෙන් වැඩේ ම ය. මඬලින් වැඩේ ම ය. දීප්තියෙන් වැඩේ ම ය. උස්මහතින් වැඩේ ම ය. කස්සප, එසෙයින් ම යම් කිසිවකුහට කුසල්දහම්හි සැදැහැ ඇද්ද … හිරි ඇද්ද … ඔතප් ඇද්ද ... වැර ඇද්ද, කුසල්දහම්හි නුවන ඇද්ද, ඔහුට යම් රැයෙක් හෝ දවාලෙක් හෝ පැමිණේ නම් කුසල්දහම්හි වැඩීම ම කැමැති විය යුතු. පිරිහීම කැමති නො විය යුතු යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සප, ‘සැදැහැති පුරුෂපුද්ගලයා’ යන මෙය නො පිරිහීමෙකි. හිරි ඇති ... ඔතප් ඇති …  ඇරඹු වෙර ඇති ... නුවණ ඇති … නො  කිපෙන සුලු … ‘බද්ධවෛරය නැති පුරුෂපුද්ගලයා’ යන මෙය නො පිරිහීමෙකි. කස්සප, ‘අවවාද කරණ භික්ෂූහු ඇත්තාහ’ යන මෙය නො පිරිහීමෙකි යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "319"
            },
            {
                "type": "centered",
                "text": "4. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තෙවන ඔවාද සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "291. **සැවැත්නුවර-**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකල්හි ආයුෂ්මත් මහසුප් තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය ... එකත්පසෙක හුන් ආයුෂ්මත් මහසුප්හට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: කස්සප, භික්ෂූන්ට අවවාද කරව. කස්සප භික්ෂූන්ට දැහැමි කතා කරව. කස්සප, මම හෝ භික්ෂූන්ට අවවාද කරන්නෙමි. තෙපි හෝ (අවවාද කරවු.) මම හෝ භික්ෂූන්ට දැහැමි කතා කරන්නෙමි. තෙපි හෝ (කරවු ) යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, දැන් භික්ෂූහු දුවවහ. දුවවබව කරණ දහමින් සමන්විතහ. නො ඉවසන්නෝය. අනුශාසනාව නුහුරට ගන්නෝය යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සප, ඒ එසේ මැ යි. පෙර ස්ථවිර භික්ෂූහු ආරණ්‍යක වූවොත්, ආරණ්‍යක බැව්හි ගුණ කියන්නෝත් වූහ. පිණ්ඩපාතික වූවොත්, පිණ්ඩපාතික බැව්හි ගුණ කියන්නෝත් වූහ. පාංශුකූලික වූවොත්, පාංශුකූලික බැව්හි ගුණ කියන්නෝත් වූහ. තෙචීවරික වූවෝත්, තෙචීවරික බැව්හි ගුණ කියන්නෝත් වූහ. අල්පෙච්ඡ වූවොත් අල්පෙච්ඡ බැව්හි ගුණ කියන්නෝත් වූහ. සන්තුෂ්ට වූවොත්, සන්තුෂ්ට බැව්හි ගුණ කියන්නෝත් වූහ. ප්‍රවිවික්ත වූවෝත්, ප්‍රවිවෙකයෙහි ගුණ කියන්නෝත් වූහ. අසංසෘෂ්ටයෝත්, අසංසර්ගයෙහි ගුණ කියන්නෝත් වූහ. අරාබ්ධවීර්ය්‍යයෝත්, වීර්ය්‍යාරම්භයෙයි ගුණ කියන්නෝත් වූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එහි යම් මහණෙක් අරණ්‍යකත් ආරණ්‍යක බැව්හි ගුණ කියන්නේත්, පිණ්ඩපාතිකත් පිණ්ඩපාතික බැව්හි ගුණ කියන්නේත්, පාංශුකූලිකත් පාංශුකූලික බැව්හි ගුණ කියන්නේත්, තෙචීවරිකත් තෙචීවරික බැව්හි ගුණ කියන්නේත්, අල්පෙච්ඡත් අල්පෙච්ඡ බැව්හි ගුණ කියන්නේත්, සන්තුෂ්ටත් සන්තුෂ්ට බැව්හි ගුණ කියන්නේත්, ප්‍රවිවික්තත් ප්‍රවිවෙකයෙහි ගුණ කියන්නේත්, අසංසෘෂ්ටත් අසංසර්ගයෙහි ගුණ කියන්නේත්, අරාබ්ධවීර්ය්‍යත් වීර්ය්‍යාරම්භයෙහි ගුණ කියන්නේත් වේ නම්, ස්ථවිර භික්ෂූහු ඔහුට “මහණ, එව, මේ මහණ තෙමේ කිනම් ද? මේ මහණ තෙමේ ඒකාන්තයෙන් සොඳුරු ය. මේ මහණ තෙමේ ඒකාන්තයෙන් ශික්ෂාකාමී ය. මහණ, එව, මේ අසුන ය. ඉඳගණුව” යි අසුනෙන් පවරත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සප, එහි ලා නවක භික්ෂූන්ට “යම් ඒ මහණෙක් ආරණ්‍යකත් අරණ්‍යක බැව්හි ගුණ කියනුයේත් පිණ්ඩපාතිකත් … පාංශුකූලිකත් … තෙචීවරිකත් ... අල්පෙච්ඡත් ... සන්තුෂ්ටත් ... ප්‍රවිවික්තත් ... අසංසෘෂ්ටත් ... අරාබ්ධවීර්ය්‍යත් ... වීර්ය්‍යාරම්භයෙහි ගුණ කියණුයේත් වේ නම්, ස්ථවිර භික්ෂූහු ඔහුට “මහණ, එව, මේ මහණ තෙමේ කිනම් ද? මේ මහණ තෙමේ ඒකාන්තයෙන් සොඳුරු ය. මේ මහණ තෙමේ ඒකාන්තයෙන් ශික්ෂාකාමී ය. මහණ, එව, මේ අසුන ය, හිඳගණුවයි අසුනෙත් පවරති” යි මෙසේ අදහස් වේ නම් ඔහු ඒ පිණිස පිළිපදිත්. ඔවුන්ට එය දිගුකලක් හිත පිණිස සැප පිණිස වේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "321"
            },
            {
                "format": 13,
                "text": "කස්සපය, දැන් ස්ථවිර භික්ෂූහු ආරණ්‍යක ද අරණ්‍යක බැව්හි ගුණ කියනුවෝ ද නො වෙති. පිණ්ඩපාතික ද පිණ්ඩපාතික බැව්හි ගුණ කියනුවෝ ද නො වෙති. පංසුකූලික ද පංසුකූලික බැව්හි ගුණ කියනුවෝ ද නො වෙති. තෙචීවරිකද තෙචීවරික බැව්හි ගුණ කියනුවෝ ද නො වෙති. අල්පෙච්ඡ ද අල්පෙච්ඡ බැව්හි ගුණ කියනුවෝ ද නො වෙති. සන්තුෂ්ට බැව්හි ගුණ කියනුවෝ ද නො වෙති. ප්‍රවිවික්ත ද ප්‍රවිවෙකයෙහි ගුණ කියනුවෝ ද නො වෙති. අසංසෘෂ්ට ද අසංසර්ගයෙහි ගුණ කියනුවෝ ද නො වෙති. අරාබ්ධවීර්ය්‍ය ද වීර්ය්‍යාරම්හයෙහි ගුණ කියනුවෝ ද නො වෙති. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එහි යම් මහණෙක් ප්‍රසිද්ධ වූයේ යසස් ඇත්තේ සිවුරු පිණ්ඩපාත සෙනසුන් ගිලන්පස බෙහෙසත්පිරිකර ලබන සුලු වේ නම්, ස්ථවිර භික්ෂූහු ඔහුට “මහණ, එව මේ භික්ෂු තෙමේ කිනම් ද? මේ භික්ෂු තෙමේ ඒකාන්තයෙන් සොඳුරු ය. මේ භික්ෂු තෙමේ ඒකාන්තයෙන්ම සබ්‍රම්සරුණට කැමති ය. මහණ, එව, මේ අසුන ය. ඉඳගනුව” යි අසුනෙත් පවරත්. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සපය, එහි දී නවක භික්ෂූන්ට “යම් ඒ මහණෙක් ප්‍රසිද්ධ වූයේ යසස් ඇත්තේ සිවුරු පිණ්ඩපාත සෙනසුන් ගිලන්පස බෙහෙසත්පිරිකර ලබන සුලු වූයේ වේ නම් ස්ථවිර භික්ෂූහු ඔහුට ‘මහණ, එව මේ මහණ තෙමේ කිනම් ද? මේ මහණ තෙමේ ඒකාන්තයෙන් සොඳුරු ය. මේ මහණ තෙමේ ඒකාන්තයෙන් සබ්‍රම්සරුන්ට කැමති ය. මහණ, එව මේ අසුනය හිඳගණුව’ යි අසුනෙත් පවරති” යි මෙසේ අදහස් වේ. ඔහු ඒ පිණිස පිළිපදිත්. ඔවුනට එය දිගුකලක් අහිත පිණිස දුක් පිණිස වෙයි. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සපය, යම් හෙයකින් මැනවින් (සත්‍යය) කියන්නෙක් “බ්‍රහ්මචාරීහු බඹසර උවදුරින් හටගත් උවදුරු ඇත්තෝ ය. බ්‍රහ්මචාරීහු බ්‍රහ්මචාරීන් පිළිබඳ සිවුපසයෙහි වූ අධිකප්‍රාර්ථනා සඞ්ඛ්‍යාත අභිභවනයෙන් යුක්තයෝ ය”යි කියන්නේ නම්, කස්සපය, සත්‍යය කියන්නේ “බ්‍රහ්මචාරීහු බඹසර උවදුරින් හටගත් උවදුරු ඇත්තෝ ය. බ්‍රහ්මචාරීහු බ්‍රහ්මචාරීන් පිළිබඳ සිවුපසයෙහි වූ අධිකප්‍රාර්ථනා සඞ්ඛ්‍යාත අභිභවනයෙන් යුක්තයෝ” යි මෙසේ කියන්නේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "4. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඣානාභිඤ්‌ඤ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "292. **සැවැත්නුවර-**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම යම්තාක් කල් කැමති වන්නෙම් නම් (ඒ තාක්) කාමයන් ගෙන් වෙන් ව ම අකුශලධර්‍මයන් ගෙන් වෙන් ව ම විතර්ක සහිත වූ විචාර සහිත වූ විවේකයෙහි හටගත් ප්‍රීතිය හා සැපය ඇති ප්‍රථමධ්‍යානය උපදවා වෙසෙමි. මහණෙනි, කාශ්‍යප ද යම්තාක් කල් කැමති වන්නේ නම් (ඒ තාක්) කාමයන්ගෙන් වෙන් ව ම අකුශලධර්‍මයන් ගෙන් වෙන්ව ම විතර්ක සහිත වූ විචාර සහිත වූ විවෙකයෙහි හටගත් ප්‍රීතිය හා සැපය ඇති ප්‍රථමධ්‍යානය උපදවා වෙසෙයි. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "323"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම යම් තාක් කල් කැමති වෙම් ද (ඒ තාක්) විතර්ක විචාරයන්ගේ ව්‍යුපශමහේතුවෙන් ස්වසන්තානයෙහි උපන් පැහැදීම ඇති, සිත්හුගේ එකලාව උපදනා උතුම් සමාධිය වඩන, විතර්ක රහිත වූ විචාර රහිත වූ සමාධියෙන් උපන් ප්‍රීතිසුඛ ඇති ද්විතීයධ්‍යානය උපදවා වෙසෙමි. මහණෙනි, කාශ්‍යප ද යම් තාක් කල් කැමති වේ නම් ඒ තාක් විතර්ක විචාරයන්ගේ ව්‍යූපශම හේතුවෙන් … ද්විතියධ්‍යානය උපදවා වෙසෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම යම් තාක් කල් කැමති වෙම් ද (ඒ තාක්) ප්‍රීතියගේ ද විරාගයෙන් උපේක්ෂා ඇත්තෙම් ද සිහි ඇත්තෙම් ද මනා නුවණ ඇත්තෙම් ද වෙසෙමි. සුවද කයින් විඳිමි. යම් ධ්‍යානයක් හේතු කොට ගෙණ තෘතීයධ්‍යාන සමන්විත පුද්ගලයා ‘උපේක්ෂකය, සිහි ඇත්තේ ය, සුඛවිහාර ඇත්තේ’ යයි ආර්ය්‍යයෝ කියත් ද, ඒ තෘතියධ්‍යානය උපදවා වෙසෙමි. මහණෙනි, කසුප් ද යම් තාක් කැමති වේ නම් (ඒ තාක්) … තෘතියධ්‍යානය උපදවා වෙසෙයි. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම යම් තාක් කල් කැමති වෙම් ද (ඒ තාක්) සුඛයාගේ ද ප්‍රහාණයෙන් දුඃඛයාගේ ද ප්‍රහාණයෙන් පූර්වයෙහිම සොම්නස් දොම්නස් අස්තඞ්ගමයෙන් දුක් නැති සුව නැති උපේක්ෂායෙන් හටගත් ස්මෘති පාරිශුද්ධි ඇති චතුර්ථධ්‍යානය උපදවා වෙසෙමි. මහණෙනි, කාශ්‍යප ද යම් තාක් කල් කැමති වේ නම් (ඒ තාක්) සුඛයාගේ ද ප්‍රහාණයෙන් දුඃඛයාගේ ද ප්‍රහාණයෙන් … චතුර්ථධ්‍යානය උපදවා වෙසෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම යම් තාක් කල් කැමති වෙම් නම් (ඒ තාක්) සර්වප්‍රකාරයෙන් රූපසංඥාවනගේ සමතික්‍රමයෙන් ප්‍රතිඝසංඥාවන්ගේ අස්තඞ්ගමයෙන් නානාත්මසංඥාවන් නො මෙනෙහි කිරීමෙන් “ආකාශය අනන්ත ය” යි ආකාසානඤ්චායතනය උපදවා වෙසෙමි. මහණෙනි, කස්සප ද, යම් තාක් කල් කැමති වේ ද (ඒ තාක්) සර්වප්‍රකාරයෙන් රූපසංඥාවන් සමතික්‍රමයෙන් ආකාසානඤ්චායතනය උපදවා වෙසෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම යම් තාක් කල් කැමති වෙම් නම් (ඒ තාක්) සර්වප්‍රකාරයෙන් ආකාසානඤ්චායතනය ඉක්මවා “විඤ්ඤාණය අනන්ත ය” යි විඤ්ඤාණඤ්චායතනය උපදවා වෙසෙමි. මහණෙනි, කශ්‍යප ද, යම් තාක් කැමති වේ ද (ඒ තාක්) සර්වප්‍රකාරයෙන් ආකාසානඤ්චායතනය ඉක්මවා “විඤ්ඤාණය අනන්ත ය” යි විඤ්ඤාණඤ්චායතනය උපදවා වෙසෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම යම් තාක් කල් කැමති වෙම් නම් (ඒ තාක්) සර්වප්‍රකාරයෙන් විඤ්ඤාණඤ්චායතනය ඉක්මවා “කිසිවක් නැතැ” යි ආකිඤ්චඤ්ඤායතනය උපදවා වෙසෙමි. මහණෙනි, කසුප් ද, යම් තාක් කැමති වේ ද (ඒ තාක්) … ආකිඤ්චඤ්ඤායතනය උපදවා වෙසෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම යම් තාක් කල් කැමති වෙම් නම් (ඒ තාක්) සර්වප්‍රකාරයෙන් ආකිඤ්චඤ්ඤායතනය ඉක්මවා නේවසඤ්ඤනාසඤ්ඤායතනය උපදවා වෙසෙමි. මහණෙනි, කස්සප ද යම් තාක් කැමති වේ ද (ඒ තාක්) … නේවසඤ්ඤනාසඤ්ඤායතනය උපදවා වෙසෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම යම් තාක් කල් කැමති වෙම් නම් (ඒ තාක්) සර්වප්‍රකාරයෙන් නේවසඤ්ඤනාසඤ්ඤායතනය ඉක්මවා සඤ්ඤාවෙදයිත නිරොධයට පැමිණ වෙසෙමි. මහණෙනි, කස්සප ද සඤ්ඤාවෙදයිතනිරොධයට පැමිණ වෙසෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "325"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම යම් තාක් කල් කැමති වෙම් නම් (ඒ තාක්) නන්වැදෑරුම් සෘද්ධි කොටස් වළඳමි. එකෙක් ව ද බොහෝ පරිදි වෙමි. බොහෝ පරිදි ව ද එකෙක් වෙමි. ප්‍රකටබව ද සැඟවුනුබව ද (කරමි.) බිතුසරස පවුරුසරස පවුසරස අහසෙහි මෙන් නො ගැටෙමින් යෙමි. පොළොවෙහි ද දියෙහි ද මෙන් මතු වීම කිමිදීම කරමි. පොළොවෙහි මෙන් නො බිඳෙන දියෙහි ද යෙමි. පියාපත් ඇති ලිහිණියකු මෙන් අහසෙයි ද පලඟින් සක්මන් කරමි. මේ සා මහත් සෘද්ධි ඇති මේ සා මහත් ආනුභාව ඇති මේ සඳහිරු දෙදෙන ද අතින් පරාමර්ශනය කරමි. පිරිමදිමි. බඹලොව තෙක් ද කයින් වශයෙහි පවත්වමි. මහණෙනි, කස්සප ද යම් තාක් කැමති වේ ද (ඒ තාක්) නන්වැදෑරුම් සෘද්ධි කොටස් වළඳ යි ... බඹලොව තෙක් ද කයින් වශයෙහි පවත්වයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම යම් තාක් කැමති වෙම් ද, (ඒ තාක්) විසුද්ධ වූ මනුෂ්‍ය විෂය ඉක්ම පැවති දිව කණින් දිව්‍ය වූත් මනුෂ්‍ය වූත්, දුර වූත් ලඟ වූත්, දෙසද අසමි. මහණෙනි, කස්සප ද යම්තාක් කැමති වේ ද … (ඒතාක්) දිවකණින් දිව්‍ය වූත් මනුෂ්‍ය වූත්, දුර වූත් ලඟ වූත්, දෙසද අසයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම යම් තාක් කැමති වෙම් නම් (ඒ තාක්) අන්‍යසත්ත්වයන්ගේ අන්‍යපුද්ගලයන්ගේ සිත (තම) සිතින් පිරිසිඳ දැන ගණිමි: සරාග සිත හෝ සරාග සිතැයි දැන ගණිමි. වීතරාග සිත වීතරාග සිතැයි දැන ගණිමි. සදොස සිත හෝ ... වීතදොස සිත හෝ … සමොහ සිත හෝ ... වීතමොහ සිත හෝ … සඞ්ඛිත්ත සිත හෝ ... වික්ඛිත්ත සිත හෝ … මහග්ගත සිත හෝ … අමහග්ගත සිත හෝ ... සඋත්තර සිත හෝ … අනුත්තර සිත හෝ … සමාහිත සිත හෝ … අසමාහිත සිත හෝ ... විමුත්ත සිත හෝ ... අවිමුත්ත සිත හෝ අවිමුත්ත සිතැ යි දැන ගණිමි. මහණෙනි, කස්සප ද යම් තාක් කැමති වේ නම් (ඒ තාක්) පරසත්ත්වයන්ගේ පරපුද්ගලයන්ගේ සිත (තම සිතින්) පිරිසිඳ දැන ගණියි: සරාග සිත හෝ සරාග සිතැ යි දැන ගණියි ... අවිමුත්ත සිත හෝ අවිමුත්ත සිතැ යි දැන ගණියි. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, “මම යම්තාක් කැමති වෙම් ද (ඒ තාක්) පෙර විසු කඳ පිළිවෙළ සිහි කෙරෙමි. ඒ මෙසේ යි: “එක ජාතියක් ද, දෙජාතියක් ද, තුන් ජාතියක් ද, සිවු ජාතියක් ද, පස් ජාතියක් ද, දස ජාතියක් ද, විසි ජාතියක් ද, තිස් ජාතියක් ද, සාළිස් ජාතියක් ද, පණස් ජාතියක් ද, සිය ජාතියක් ද, දහස් ජාතියක් ද, සියදහස් ජාතියක් ද, නොයෙක් වැනසෙන කප් ද, නොයෙක් වැඩෙන කප් ද, නොයෙක් වැනසෙන වැඩෙන කප් ද” අසුවල් තැන මෙනම් ඇත්තෙම් මෙබඳු ගොත් ඇත්තෙම් මෙබඳු පැහැ ඇත්තෙම් මෙබඳු අහර ඇත්තෙම් මෙසේ සුවදුක් විඳිනෙම් මෙසේ ආයුකෙළවර කොට ඇත්තෙම් වීමි. ඒ මම එයින් චුත වූයෙම් අසුවල් තැන පහළ වීමි. එහි දු මෙ නම් ඇත්තෙම් මෙබඳු ගොත් ඇත්තෙම් මෙබඳු පැහැ ඇත්තෙම් මෙබඳු අහර ඇත්තෙම් මෙසේ සුවදුක් විඳිනෙම් මෙසේ ආයු කෙළවර කොට ඇත්තෙම් වීමි. ඒ මම එයින් ච්‍යුත ව මෙහි උපන්මි” යි. මෙසේ අයුරු සහිත උදෙසුම් සහිත නන්වැදෑරුම් පෙර විසූ කඳපිළිවෙළ සිහි කෙරෙමි. මහණෙනි, කස්සප ද, යම් තාක් කැමති වේ නම් (ඒ තාක්) නන්වැදෑරුම් පෙර විසූ කඳපිළිවෙළ සිහි කෙරෙයි. ඒ මෙසේ යි: “එක් ජාතියක් ද … මෙහි උපන්මියි මෙසේ අයුරු සහිත උදෙසුම් සහිත නන්වැදෑරුම් පෙර විසූ කඳපිළිවෙළ සිහි කෙරෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "327"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම යම් තාක් කැමති වෙම් නම් (ඒ තාක්) විශුද්ධ වූ මිනිසැස ඉක්මවා පැවති දිවැසින් සත්ත්වයන් දකිමි: ච්‍යුත වන, උපදින, හීන ප්‍රණීත, මනා පැහැ ඇති, නපුරු පැහැ ඇති, මනා ගති ඇති, නපුරු ගති ඇති, කර්ම වූ පරිදි පැමිණි සතුන් දැන ගණිමි: ‘මේ භවත් සත්ත්වයෝ කායදුශ්චරිතයෙන් සමන්වාගතහ. වාක්දුශ්චරිතයෙන් සමන්වාගතහ. මනෝදුශ්චරිතයෙන් සමන්වාගතහ. අර්ය්‍යයන්ට උපවාද කරන්නෝ ය. මිථ්‍යාදුෂ්ටිකයෝ ය. මිථ්‍යාදුෂ්ටිකර්ම සමාදන් වූවෝ ය. ඔහු කාබුන් මරණින් මතු සැපයෙන් පහවූ නපුරු ගති ඇති, විවස ව පතිත වන, නිරයට පැමිණියාහු ය. මේ පින්වත් සත්ත්වයෝ කායසුචරිතයෙන් සමන්වාගතහ. වාග්සුචරිතයෙන් සමන්වාගතහ. මනඃසුචරිතයෙන් සමන්වාගතහ. අර්ය්‍යොපවාද නො කරන්නෝ ය. සම්‍යග්දෘෂ්ටි ගත්තෝ ය. සම්‍යග්දෘෂ්ටිකර්ම සමාදන් වූවෝ ය. ඔහු කාබුන් මරණින් මතු මනා ගති ඇති ස්වර්ගලෝකයට පැමිණියහයි, මෙසේ විශුද්ධ වූ මිනිසැස ඉක්ම පැවති දිවැසින් සතුන් දකිමි. ච්‍යුත වන උපදින හීන ප්‍රණීත සුවර්ණ දුර්වර්ණ සුගත දුර්ගත යථාකර්මෝපග සත්ත්වයන් දැන ගණිමි. මහණෙනි, කස්සප ද යම් තාක් කැමති වෙම් නම් (ඒ තාක්) විශුද්ධ වූ මිනිසැස ඉක්ම පැවති දිවැසින් සතුන් දකී. … ච්‍යුත වන උපදින හීනප්‍රණීත සුවර්ණ දුර්වර්ණ සුගත දුර්ගත යථාකර්මෝපග සත්ත්වයන් දැන ගණියි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම ආස්‍රවයන් ක්ෂය වීමෙන් අනාස්‍රව වූ ඵලසමාධිය ද ඵලප්‍රඥාව ද මේ අත්බැව්හි ම තෙමේ ම විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්ෂ කොට පැමිණ වෙසෙමි. මහණෙනි, කස්සප ද ආස්‍රවයන් ක්ෂය වීමෙන් අනාස්‍රව වූ අර්හත් ඵලසමාධිය ද අර්හත් ඵලප්‍රඥාව ද මේ අත්බැව්හි ම තෙමේ ම විශිෂ්ට ඥානයෙන් දැන ප්‍රත්‍යක්ෂ කොට පැමිණ වෙසෙ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "4. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "භික්ඛුනු උපස්‌සය සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "293. එක්කලෙක ආයුෂ්මත් මහසුප් තෙරණුවෝ සැවැත්නුවර සමීපයෙහි ජේතවන නම් වූ අනේපිඬු සිටුහුගේ අරම්හි වැඩ වෙසෙති. එකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිර තෙමේ පෙරවරු හැඳ පොරවා පා සිවුරු ගෙණ ආයුෂ්මත් මහසුප් තෙරණුවන් වෙත එළඹියේ ය- එළඹ ආයුෂ්මත් මහසුප් තෙරණුවන්ට “වහන්ස, කාශ්‍යපයෙනි, යමු, එක්තරා මෙහෙණ අසපුවක් වෙත එළඹෙන්නෙමු” යි මෙය කී ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, ආනන්දයෙනි, තෙපි යවු. තෙපි බොහෝ කිස ඇත්තහු, බොහෝ කටයුතු ඇත්තහු ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "දෙවන වට දු ආයුෂ්මත් ආනන්දස්ථවිර තෙමේ ආයුෂ්මත් මහසුප් තෙරණුවන්ට “වහන්ස, කාශ්‍යපයෙනි, යමු, එක්තරා මෙහෙණ අසපුවක් වෙත එළඹෙන්නෙමු” යි මෙය කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, ආනන්දයෙනි, තෙපි යවු. තෙපි බොහෝ කිස ඇත්තහු, බොහෝ කටයුතු ඇත්තහු ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": " තෙවන වට දු ආයුෂ්මත් ආනන්ද ස්ථවිර තෙමේ ආයුෂ්මත් මහසුප් තෙරණුවන්ට “වහන්ස, කාශ්‍යපයෙනි, යමු, එක්තරා මෙහෙණ අසපුවක් වෙත එළඹෙන්නෙමු” යි මෙය කී ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "329"
            },
            {
                "format": 13,
                "text": "එකල්හි ආයුෂ්මත් මහසුප් තෙරණුවෝ පෙරවරු හැඳ පෙරව පා සිවුරු ගෙන ආයුෂ්මත් අනඳතෙරුන් පසුමහණහු කොට ගෙණ එක්තරා මෙහණ අසපුවක් වෙත එළඹියහ. එළඹ පණවන ලද අසුන්හි වැඩහුන්හ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි බොහෝ මෙහෙණහු ආයුෂ්මත් මහසුප් තෙරණුවන් වෙත එළඹියහ. එළඹ ආයුෂ්මත් මහසුප් තෙරණුවන් වැඳ එකත්පසෙක හුන්හ. එකත්පසෙක හුන් ඒ මෙහෙණන් ආයුෂ්මත් මහසුප් තෙරනණුවෝ දැහැමි කතාවෙන් කරුණු දැක්වූහ. සමාදන් කරවූහ. තෙද ගැන්වූහ. සතුටු කළහ ඉක්බිති ආයුෂ්මත් මහසුප් තෙරණුවෝ ඒ මෙහෙණන් දැහැමි කතායේන් කරුණු දක්වා, සමාදන් කරවා, තෙද ගන්වා, සතුටු කරවා හුනස්නෙන් නැගිට වැඩියහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකලිහි ථූල්ලතිස්සා මෙහෙණ නො සතුටු සිත් ඇත්තී “කිමෙක් ද, ආර්ය්‍ය වු මහා කාශ්‍යප තෙරණුවෝ ආර්ය්‍ය වූ වේදේහ මුනි ආනන්ද තෙරණුවන් හමුයෙහි දහම් බිණිය යුතු යි හගිද්ද? යම් සේ හිදි වෙළෙඳෙක් හිදිකරු ලඟ හිදි විකිණීය යුතු ය යි හඟනේ නම්, එසෙයින් ම ආර්ය්‍ය වූ මහසුප් තෙරණුවෝ ආර්ය්‍ය වූ වෙදේහ මුනි අනඳ තෙරුන් හමුයෙහි දහම් බිණිය යුතු යි හඟිති” යි නො සතුටු වදන් බිණුවා ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ආයුෂ්මත් මහසුප් තෙරණුවෝ ථූල්ලතිස්සා මෙහණ මේ වදන් කියද්දී (අනෙකෙකු විත් සැළකළ පරිදි) ඇසූහ. එකල්හි ආයුෂ්මත් මහසුප් තෙරණුවෝ ආයුෂ්මත් ආනන්ද තෙරුන්ට “ඇවැත්නි, ආනන්දයෙනි, කිමෙක් ද, මම හිඳි වෙළෙඳෙකිම් ද? තෙපි හිඳිකරුද? නොහොත් මම හිඳි කරු වෙම් ද? තෙපි හිඳි වෙළෙඳෙක් දැ” යි? මෙය කීහ “වහන්ස කාශ්‍යපයෙනි, කමා කළ මැනවි. මාගම මෝඩය” යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, ආනන්දයෙනි, තෙපි සිටිවු. බික්සඟ තෙමේ මතු (අතිරෙක කරුණෙක්හි) තොප නොපිරික්සාවා. (තොප කෙරෙහි භික්ඛුනී සත්ථවාදීන් සැක නො කෙරේවා.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, ආනන්දයෙනි, ඒ කිමැයි හඟිවු ද? “ මහණෙනි, මම යම් තාක් කල් කැමති වෙම් ද (ඒ තාක්) කාමයන්ගෙන් වෙන් ව ම අකුශලධර්මයන්ගෙන් වෙන් ව ම විතර්ක සහිත වූ විචාර සහිත වූ විවේකයෙන් උපන් ප්‍රීතිය හා සැපය ඇති ප්‍රථමධ්‍යානය උපදවා වෙසෙමි. මහණෙනි, ආනන්දත් යම් තාක් කල් කැමති වේ නම් (ඒ තාක්) කාමයන්ගෙන් වෙන් ව ම අකුශල ධර්මයන්ගෙන් වෙන් ව ම විතර්ක සහිත වූ විචාර සහිත වූ විවේකයෙන් උපන් ප්‍රීතිය හා සැපය ඇති ප්‍රථමධ්‍යානය උපදවා වෙසෙ”යි තෙපි භාග්‍යවතුන් වහන්සේ හමුයෙහි බික්සඟන කෙරෙහි (බුදුනට ප්‍රතිභාග ශ්‍රාවකයෙකු වශයෙන්) පමුණුවන ලදහු ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘වහන්ස, මෙය නො වේ මය.’",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, මම් වූ කලි “මහණෙනි, මම යම් තාක් කල් කැමති වෙම් ද (ඒ තාක්) කාමයන්ගෙන් වෙන් ව ම අකුසල ධර්මයන්ගෙන් වෙන් ව ම විතර්ක සහිත වූ විචාර සහිත වූ විවේකයෙන් උපන් ප්‍රීතිය හා සැපය ඇති ප්‍රථමධ්‍යානයට පැමිණ වෙසෙමි. මහණෙනි, කාශ්‍යපත් යම් තාක් කල් කැමැති වේ ද (ඒ තාක්) කාමයන්ගෙන් වෙන්වම අකුශල ධර්මයන්ගෙන් වෙන් ව ම ප්‍රථම ධ්‍යානයට පැමිණ වෙසෙ”යි භාග්‍යවතුන් වහන්සේ හමුයෙහි බික්ඟන කෙරෙහි (බුද්ධප්‍රතිභාග ශ්‍රාවක වශයෙන්) පමුණුවන ලද්දෙම් වෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "(ප්‍රථමධ්‍යානාදී නවවිධ අනුපූර්ව විහාරසමාපත්තීන්ගේ ද පඤ්චාභිඥාවන්ගේ ද පෙය්‍යාලය දතයුතු.)",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "331"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, ආනන්දයෙනි, ඒ කුමැයි හඟිවු ද, “මහණෙනි, මම ආස්‍රවයන් ක්ෂය වීමෙන් අනාස්‍රව වූ අර්හත් ඵලසමාධියත් අර්හත් ඵලප්‍රඥාවත් මේ අත්බැව්හි ම තෙමේ ම විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්ෂ කොට පැමිණ වෙසෙමි. මහණෙනි, ආනන්දත් ආස්‍රවයන් ක්ෂය වීමෙන් අනාස්‍රව වූ අර්හත් ඵල සමාධියත්, අර්හත් ඵලප්‍රඥාවත් මේ අත්බැව්හි ම තෙමේ ම විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්ෂ කොට පැමිණ වෙසේ” යි තෙපි භාග්‍යවතුන් වහන්සේ හමුයෙහි බික්සඟන මැද පමුණුවන ලදහු ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘වහන්ස, එය නො වේ ම ය.’",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": " “මහණෙනි, මම ආස්‍රවයන් ක්ෂය වීමෙන් අනාස්‍රව වූ අර්හත් ඵලසමාධියත් අර්හත් ඵලප්‍රඥාවත් මේ අත්බැව්හි ම තෙමේ ම විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්ෂ කොට පැමිණ වෙසෙමි. මහණෙනි, කාශ්‍යපත් ආස්‍රවයන් ක්ෂය වීමෙන් අනාස්‍රව වූ අර්හත් ඵලසමාධියත් අර්හත් ඵලප්‍රඥාවත් මේ අත්බැව්හි ම තෙමේ ම විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්ෂ කොට පැමිණ වෙසේ” යි මම භාග්‍යවතුන් වහන්සේ හමුයෙහි බික්සඟන මැද පමුණුවන ලද්දෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, යමෙක් මාගේ ෂඩභිඥාවන් වැසිය හැකි ය යි හඟනේ නම් හෙතෙමේ සත්රියන් වූ හෝ අඩකින් අඩු අටරියන් (=සත්රියන් හමාරක්) වූ හෝ ඇතකු තල්පතකින් වැසිය හැකි ය යි හඟනේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ථුල්ලතිස්සා මෙහෙණ බඹසරින් චුත වූවා ය.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "4. 1. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "චීවර සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "294. එක් සමයෙක ආයුෂ්මත් මහසුප් තෙරණුවෝ රජගහනුවර සමීපයෙහි කලන්දකනිවාප නම් වූ වේළුවනාරාමයෙහි වැඩ වෙසෙති. එකල්හි ආයුෂ්මත් ආනන්දස්ථවිර තෙමේ මහත් බික්සඟන සමග දක්ඛිණාගිරි දනව්වෙහි චාරිකාවෙහි හැසිරෙයි. එසමයෙහි ආයුෂ්මත් ආනන්ද තෙරුන්ගේ සද්ධිවිහාරික වූ බෙහෙවින් තරුණ වූ තිසක් පමණ භික්ෂූහු සිකපද පිළිකෙව් කොට ගිහි බවට පෙරලුනාහු වෙති. ඉක්බිති ආයුෂ්මත් ආනන්ද ස්ථවිර තෙමේ දකුණුගිරි දනව්වෙහි කැමතිතාක් චාරිකා කොට රජගහනුවර සමීපයෙහි කලන්දකනිවාප නම් වූ වේළුවනාරාමයෙහි ආයුෂ්මත් මහසුප් තෙරණුවන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් මහසුප් තෙරණුවන් වැඳ එකත්පසෙක හිඳ ගත්තේ ය. එකත්පසෙක හුන් ආයුෂ්මත් ආනන්ද තෙරුන්ට ආයුෂ්මත් මහසුප් තෙරණුවෝ මෙය කීහ:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“ඇවැත්නි, ආනන්දයෙනි, කෙතෙක් කරුණු නිසා භාග්‍යවතුන් වහන්සේ විසින් කුලයන්හි තිකභොජනය* පණවන ලද්දේ දැ” යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, කාශ්‍යපයෙනි, කරුණු තුනක් නිසා භාග්‍යවතුන් වහන්සේ විසින් කුලයන්හි තිකභෝජනය පණවන ලදි: දුශ්ශීල පුද්ගලයන්ට නිග්‍රහ කිරීම පිණිස ද, ප්‍රියශීල භික්‍ෂුන්ගේ පහසු විහරණය පිණිස ද, ලාමක අදහස් ඇත්තෝ, (කුලවිනවා බුදිමින්) පක්ෂය (=එවැනි ලාමකයන්ගෙන් ම වඩාගත් සමූහයා) නිසා සඞ්ඝයා නො බිඳිත්වා යි ද, වැලි කුලයන් කෙරෙහි වූ අනුද්දයාව නිසා ද වේ. වහන්ස, කාශ්‍යපයෙනි, මේ කරුණු තුණ නිසා භාග්‍යවතුන් වහන්සේ විසින් කුලයන්හි තිකභොජනය පණවන ලදි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "333"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, ආනන්දයෙනි, ඉදින් එසේ නම් කුමක් හෙයින් තෙපි ඉඳුරන්හි නො රක්නා ලද දොර ඇති බොජුනෙහි පමණ නො දන්නා නිදි වැරීමෙහි නො යෙදුනු මේ නව භික්ෂූන් සමග චාරිකාවෙහි හැසිරෙවු ද? ශස්‍ය නසමින් හැසිරෙණු වැන්න. කුලයන් නසමින් හැසිරෙණු වැන්න. අවැත් ආනන්දයෙනි, තොපගේ පිරිස බිඳේ. ඇවැත්නි, බෙහෙවින් තරුණ වූ ඔහු බිඳෙත්. මේ ලදරු තෙමේ තමන් පමණ නො දනි යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වහන්ස, කාශ්‍යපයෙනි, මගේ හිසෙහි පලිතයෝත් (=පැසුනු කෙසුත්) හට ගත්හ. එහෙත් අද දු ආයුෂ්මත් මහසුප් තෙරණුවන්ගේ කුමරක වාදයෙන් නො මිදෙමු” යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, ආනන්දයෙනි, ඒ එසේ මැයි: (කුමරකයන් වෙනම හැසිරෙණ බැවින් තෙපි දු කුමරක වදයට නිසි ය යි සූ යේ ය:) තෙපි ඉඳුරන්හි නො රක්නා ලද දොර ඇති බොජුනෙහි පමණ නො දන්නා නිදිවැරීමෙහි නො යෙදුණු මේ නවක භික්ෂූන් සමග චාරිකාවෙහි හැසිරෙවු. ශස්‍ය නසමින් හැසිරෙණු වැන්න. කුලයන් නසමින් හැසිරෙණු වැන්න. ඇවැත්නි ආනන්දයෙනි, තොපගේ පිරිස බිඳේ. ඇවැත්නි, බෙහෙවින් නවක වූ ඔහු බිඳෙත්. මේ ලදරු තෙමේ තමන් පමණ නො දනි යි. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ථුල්ලනන්දා මෙහෙණ “ආර්ය්‍ය වූ මහසුප් තෙරුන් විසින් ආර්ය්‍ය වූ වේදේහ මුනි ආනන්ද ස්ථවිර තෙමේ කුමරකවාදයෙන් ගරහන ලදැ” යි ඇසූ. එකල්හි ථුල්ලනන්දා මෙහෙණ නො සතුටු සිත් ඇත්තී “කිමෙක් ද, පෙර අන්තොටු වූ ම ආර්ය්‍ය වූ මහසුප් තෙරණුවෝ ආර්ය්‍ය වූ වෙදෙහමුනි ආනන්ද තෙරුන්ට කුමරක වාදයෙන් ගැරහිය යුතු ය යි සිතද්දැ”යි නො සතුටු වදන් පහළ කළා ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ආයුෂ්මත් මහසුප් තෙරණුවෝ ථුල්ලනන්දා මෙහෙණ මේ වචන කියද්දී අසූහ. ඉක්බිති ආයුෂ්මත් මහසුප් තෙරණුවෝ ආයුෂ්මත් ආනන්ද තෙරුන්ට මෙය කීහ: ඇවැත්නි, ආනන්දයෙනි, ථුල්ලනන්දා මෙහෙණ විසින් ඒකාන්තයෙන් කරුණු නො සලකා ද්වේෂයෙන් වචන කියන ලදි. ඇවැත්නි, මම යම් කලෙක කෙස් රැවුල් බා කාසාවත් හැඳ ගිහිගෙන් නික්ම පැවිද්දට පැමිණියෙම් ද, (එවක් පටන්) ඒ භාග්‍යවත් අර්හත් සම්මාසම්බුදුරජානන් වහන්සේ හැර අන් ශාස්තෘවරයකු (මගේ ශාස්තෘ ය යි) උදෙසන්නට (=උදෙසූ බවක්) නො දනිමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, පෙර ගිහිවූ ම මට “ගෘහවාසය සම්බාධ (=අවකාශ රහිත) ය, කෙලෙස් රජස් රැස්වන මග ය. පැවිද්ද අභ්‍යවකාස ය. ගිහිගෙයි වසන්නහු විසින් එකැතින් පිරිපුන් එකැතින් පිරුසුදු දෙවූ සකක් බඳු කොට (මොහොතකුදු මල නො ගන්වා හැසිරිය යුතු) මේ බඹසර හැසිරෙන්නට සුකර නො වේ. මම කෙස් රැවුල් බා කාසාවත් හැඳ ගිහිගෙන් නික්ම පැවිදි වන්නෙම් නම් මැනවැ”යි මේ සිත විය. ඇවැත්නි, ඒ මම පසුකලෙක මහඟුවත් කඩකපාගත් පිලියෙන් සඟල (සිවුරක්) කොට ගෙණ ලොව යම් රහත්හු වෙත් නම් ඒ රහතුන් උදෙසා කෙස් රැවුල් බා ඒ කාසාවත් හැඳ ගිහිගෙන් නික්ම පැවිද්දට පැමිණියෙමි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "335"
            },
            {
                "format": 13,
                "text": "ඒ මම මෙසේ පැවිදි වූයෙම් ම අදන් මගට පිළිපන්නෙමි. රජගහනුවරට ද නාලන්දාවට ද අතර බහුපුත්ත සෑයෙහි වැඩහුන් භාග්‍යවතුන් වහන්සේ දිටිමි. දැක “මම ශාස්තෘවරයකු දක්නෙම් නම් මේ භාග්‍යවතුන් වහන්සේ ම මාගේ ශාස්තෘවශයෙන් දක්නෙමි. මම සුගත කෙනකුන් දක්නෙම් නම් මේ භාග්‍යවතුන් වහන්සේ ම දක්නෙමි. මම සම්මාසම්බුදුකෙනකුන් දක්නෙම් නම් මේ භාග්‍යවතුන් වහන්සේ ම දක්නෙමි” යි මට මේ සිත විය. ඇවැත්නි, ඒ මම එහි ම භාග්‍යවතුන් වහන්සේගේ පා වෙත හිසින් වැටී භාග්‍යවතුන් වහන්සේට “වහන්ස, භාග්‍යවතුන් වහන්සේ මාගේ ශාස්තෘවරයා ය. මම සවු වෙමි, වහන්ස, භාග්‍යවතුන් වහන්සේ මාගේ ශාස්තෘවරයා ය. මම සවු වෙමි” යි** මෙය සැළකෙළෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, මෙසේ කී කල්හි භාග්‍යවතුන් වහන්සේ මට මෙය වදාළ සේක: “කස්සප, යමෙක් මෙසේ මුළුහිතින් සමන්විත වූ සවුවකු (ගුණවිසින්) නො දන්නේ ම දනිමි යි (ස්වකීය ශාස්තෘභාවය ප්‍රතිඥ කෙරේ ද) නොදක්නේ ම දකිමි යි කියා ද, ඔහුගේ හිසත් ගිලිහෙන්නේ ය. (සත්කඩකට) පැලෙන්නේය. කස්සප, මම වනාහි (මාගේ ශාස්තෘභාවය) දන්නෙම් ම දනිමි යි කියමි. දක්නෙම් ම දකිමියි කියමි.<sup>+</sup>",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සප, එහෙයින් (මා ශාස්තෘ බැවින්) තොප විසින් මෙහි මෙසේ හික්මියයුතු: “ස්ථවිර නව මධ්‍යම භික්ෂූන් කෙරෙහි මාගේ දැඩි හිරි ඔතප් එළඹ සිටියේ වන්නේ” ය යි. කස්සප, තොප විසින් මෙසේ ම හික්මිය යුතු යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සප, එහෙයින් මෙහි තොප විසින් මෙසේ හික්මිය යුතු. “කුසල් ඇසුරු කළ යම්කිසි දහමක් අසන්නෙම් නම් ඒ සියලු දහම (තමහට අර්ථයකැයි) අර්ථවත් කොට මෙනෙහි කරමින් මුළුහිත එක්කොට යොමු කළ කන් ඇති ව අසන්නෙමි” යි. කස්සප, තොප විසින් මෙසේ ම හික්මිය යුතු.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සප, එහෙයින් මෙහි තොප විසින් මෙසේ ම හික්මිය යුතු “සුඛසම්ප්‍රයුක්ත (ප්‍රථමධ්‍යාන සුඛයෙන් යුක්ත) වූ මාගේ කායගතාසතිය, නො මා හරණේ ය” යි. කස්සප, තොප විසින් මෙසේ ම හික්මිය යුතු යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, ඉක්බිති භාග්‍යවතුන් වහන්සේ මේ (ත්‍රිවිධ)අවවාදයෙන්<sup>++</sup> මට අවවාද කොට හුනස්නෙන් නැගී වැඩිසේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, මම සත්දවසක් ම රටවැසියා විසින් දෙන පිණ්ඩාහාරය නය ගැති ව වැළඳුවෙමි ඉක්බිති අටවැනි දිනයෙහි මට රහත් බව පහළ විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, ඉක්බිති භාග්‍යවතුන් වහන්සේ මගින් ඉවත් ව එක්තරා රුක්මුලකට එළඹි සේක. ඇවැත්නි, එකල්හි මම පටපිලොතිකායෙන් කළ සඟල සිවුර සිවුගුණු කොට පණවා භාග්‍යවතුන් වහන්සේට “වහන්ස, භාග්‍යවතුන් වහන්සේ මෙහි වැඩ හිඳින සේක්වා, දිගු කලක් එය මට හිත පිණිස සැප පිණිස වනු ඇතැයි” මෙය සැළකෙළමි. ඇවැත්නි, භාග්‍යවතුන් වහන්සේ පැණවූ අස්නෙහි වැඩහුන් සේක. ඇවැත්නි, භාග්‍යවතුන් වහන්සේ වැඩ හිඳ “කස්සප, මේ පටපිලොතිකා සඞ්ඝාටිය මෘදු ය”යි මෙය මට වදාළ සේක. වහන්ස, භාග්‍යවතුන් වහන්සේ මාගේ පටපිලොතිකා සඞ්ඝාටිය අනුකම්පා කොට පිළිගන්නා සේක්වා යි සැළකෙළෙමි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "337"
            },
            {
                "format": 13,
                "text": "කස්සප, තෙපි පරිභෝගයෙන් දිරාගිය හණවැහැරි (පිළි) යෙන් කළ මාගේ පවුල්සිවුරු දරන්නෙහි ද? වහන්ස, මම පරිභෝගයෙන් දිරාගිය හණවැහැරියෙන් කළ භාග්‍යවතුන් වහන්සේගේ පවුල්සිවුරු දරන්නේමි යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, මම මහඟුවත් කඩ කපා කළ සඟලසිවුර භාග්‍යවතුන් වහන්සේට ප්‍රදානය කෙළෙමි. පරිභෝගයෙන් දිරාගිය හණවැහැරියෙන් කළ භාග්‍යවතුන් වහන්සේගේ පවුල්සිවුර මම පිළිගතිමි. ඇවැත්නි, මැනවින් සත්‍යය කියන්නෙක් “මුවෙන් (බුදුමුවෙන් නිකුත් අවවාදයෙන්) උපන්, ධර්මයෙන් හටගත්, ධර්මයෙන් නිමියා වූ ධර්මය දෑවැද්ද කොට ඇති, පරිභෝගයෙන් දිරාගිය හණවැහැරිමුවා පවුල්සිවුරු පිළිගත්තා වූ, භාග්‍යවතුන් වහන්සේගේ ඖරස පුත්‍ර (ලෙහි උපන් පුතා)ය”යි ඒ යමකු සඳහා කියන්නේ නම්’ මැනවින් කියන්නේ “මුවෙන් උපන්, දහමෙන් හටගත්, දහමෙන් නිමියා වූ, දහම දෑවැද්ද කොට ඇති, පරිභෝගයෙන් දිරාගිය හණවැහැරිමුවා පවුල්සිවුරු පිළිගත්තා වූ, භාග්‍යවතුන් වහන්සේගේ උරදාපුත්ය” යි ඒ මට කියන්නේ ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, මම යම් තාක් කල් කැමති වෙම් නම් (ඒ තාක්) කාමයන් කෙරෙන් වෙන් ව ම, අකුශල ධර්මයන් කෙරෙන් වෙන් ව ම, විතර්ක සහිත වූ විචාර සහිත වූ විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය ඇති ප්‍රථමධ්‍යානය උපදවා වෙසෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, මම යම් තාක් කල් කැමති වෙම් නම් (ඒතාක්) (නවානුපූර්ව විහාර සමාපත්තින්ගේ ද පඤ්චාභිඥාවන්ගේ ද විස්තරය පෙය්‍යාලයෙන් දත යුතු යි)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, මම ආස්‍රවයන් ක්‍ෂය වීමෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලප්‍රඥාවත් මේ අත්බැව්හි ම තෙමේ ම විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්‍ෂ කොට ලබා වෙසෙමි. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, යමෙක් මාගේ ෂඩභිඥාවන් වැසිය හැකි ය යි හඟනේ නම් හෙතෙමේ සත්රියන් වූ හෝ අඩකින් අඩු අටරියන් වූ හෝ ඇතකු තලපතෙකින් වැසිය හැකි ය යි හඟනේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ථුල්ලනන්දා මෙහෙණ බඹසරින් ච්‍යුත වූවා ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "4 .1. 12.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තථාගත පරම්මරණ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "295. එක්කලෙක ආයුෂ්මත් මහසුප් තෙරණුවෝ ද, ආයුෂ්මත් සැරියුත් තෙරණුවෝ ද බරණැස සමීපයෙහි මිගදාය නම් වූ ඉසිපතනාරාමයෙහි වැඩ වෙසෙත්. එකල්හි ආයුෂ්මත් සැරියුත් තෙරණුවෝ සවස්කාලයෙහි පලසමවතින් නැගී සිටියෝ ආයුෂ්මත් කසුප් තෙරුන් වෙත එළඹියහ ... එකත්පසෙක හුන් ආයුෂ්මත් සැරියුත් තෙරණුවෝ ආයුෂ්මත් මහසුප් තෙරුන්ට මෙය කීහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, කාශ්‍යපයෙනි, කිමෙක් ද, තථාගත (සත්ත්ව) තෙමේ මරණින් මතුවේ ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, “සත්ව තෙමේ මරණින් මතු වෙයි” යන මෙය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරණ ලදි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "339"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, කිමෙක් ද, සත්ත්ව තෙමේ මරණින් මතු නො වේ ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි “සත්ත්ව තෙමේ මරණින් මතු නො වෙයි” යන මෙ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරණ ලදී. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, කිමෙක් ද, සත්ත්ව තෙමේ මරණින් මතු වන්නේත් නො වන්නේත් වේ ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, “සත්ත්ව තෙමේ මරණින් මතු වන්නේත් නො වන්නේත් වෙයි” යන මෙද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරණ ලදී. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, කිමෙක් ද, සත්ත්ව තෙමේ මරණින් මතු නො ම වන්නේත් නො ම නො වන්නේත් වේ ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, “සත්ත්ව තෙමේ මරණින් මතු නො ම වන්නේත් නො ම නො වන්නේත් වෙයි” යන මෙ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරණ ලදි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, කුමක් හෙයින් මෙය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරණ ලද්දේ ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, මෙය අර්ථ සහිත වූයේ නො වෙයි. මගබඹසරට මුල් වූයේ නො වෙයි. කළකිරීම පිණිස, නො ඇලීම පිණිස, නිරොධය පිණිස, ව්‍යූපශමය පිණිස, විශිෂ්ටඥානය පිණිස, සම්බොධිය පිණිස, නිවන පිණිස නො පවතී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එහෙයින් එය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරණ ලදි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, වැලි, කිමෙක් භාග්‍යවතුන් වහන්සේ විසින් වදාරණ ලද්දේ ද?\nඇවැත්නි, ‘මේ දුකැ’යි භාග්‍යවතුන් වහන්සේ විසින් වදාරණ ලදි. ‘මේ දුක හටගැණීමේ හේතුව’යි භාග්‍යවතුන් වහන්සේ විසින් වදාරණ ලදී. ‘මේ දුක නැති වීම වූ නිවන’ යි භාග්‍යවතුන් වහන්සේ විසින් වදාරණ ලදි ‘මේ දුක් නැති වීමට පමුණුවන පිළිවෙතැ’ යි භාග්‍යවතුන් වහන්සේ විසින් වදාරණ ලදි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, කුමක් හෙයින් මෙය භාග්‍යවතුන් වහන්සේ විසින් වදාරණ ලද ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇවැත්නි, මෙය අර්ථ සහිත ය. මෙය මගබඹසරට මුල් වූයේ ය. මෙය කළකිරීම පිණිස, නො ඇල්ම පිණිස, නිරොධය පිණිස, ව්‍යූපශමය පිණිස, විශිෂ්ටඥානය පිණිස, සම්බොධිය පිණිස, නිවන පිණිස පවතී. එහෙයින් එය භාග්‍යවතුන් වහන්සේ විසින් වදාරණ ලදී.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "4. 1. 13.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සද්‌ධම්‌මපතිරූපක සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "296. එක් කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයෙහි … වැඩ වසන සේක. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි ආයුෂ්මත් මහකසුප් තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ … එකත්පසෙක හුන් ආයුෂ්මත් මහසුප් තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැළකළහ:",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "341"
            },
            {
                "format": 13,
                "text": "වහන්ස, යම් හෙයකින් පෙර ශික්ෂාපදයොත් ඉතා මඳ වූහු නම් ඉතා බොහෝ භික්ෂූහුත් රහත්බැව්හි පිහිටියාහු නම් ඊට හේතු කවරේ ද? ප්‍රත්‍යය කවරේ ද? වහන්ස, දැන් යම් හෙයකින් ශික්ෂාපදයොත් ඉතා බොහෝ වෙත් නම් ඉතා මඳ වූ භික්ෂූහුත් රහත් බැව්හි පිහිටත් නම් ඊට හේතු කවරේ ද? ප්‍රත්‍යය කවරේ ද? ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සප, මෙය මෙසේ ම වෙයි. සත්ත්වයන් පිරිහෙන කල්හි සදහම් අතුරුදන් වන කල්හි ශික්ෂාපදයෝත් ඉතා බොහෝ වෙති ඉතා මඳ වූ භික්ෂූහුත් රහත්බැව්හි පිහිටත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සප, ලොව යම් තාක් සදහම් පිළිරුවෙක් (=සදහම් වැනි වූවෙක්) නූපදී ද, ඒ තාක් සදහම්හුගේ අතුරුදන් වීමෙක් නො වේ. කස්සප, ලොව යම් කලෙක සදහම් පිළිරුවෙක් උපදී ද, එකල්හි සදහම්හුගේ අතුරුදන් වීම වේ. කස්සප, යම් සේ ලොව යම් තාක් රන්බඳු දෙයක් නො හටගණී නම් ඒ තාක් රන් අතුරුදන් වීමෙක් නො වේ ද, කස්සප, ලොව යම් කලෙක රන්බඳු දෙයක් හටගණි නම් එකල්හි රන් පිළිබඳ අතුරුදන් වීම වේ ද, කස්සප, එසෙයින් ම ලොව යම් තාක් සදහම්පිළිරුවෙක් නූඋපදී ද, ඒ තාක් සදහම්හුගේ අතුරුදන් වීම නො වේ. කස්සප, යම් කලෙක ලොව සදහම්පිළිරුවෙක් උපදී ද, එකල්හි සදහම්හුගේ අතුරුදන් වීම වේ. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සප, පඨවිධාතුව සදහම් අතුරුදන් නො කෙරෙයි. අපෝධාතුව සදහම් අතුරුදන් නො කරයි. තේජෝධාතුව සදහම් අතුරුදන් නො කෙරෙයි. වායෝධාතුව සදහම් අතුරුදන් නො කෙරෙයි. වැලි, යම් කෙනෙක් මේ සදහම් අතුරුදන් කෙරෙද්ද, ඒ හිස් පුරුෂයෝ මේ සසුනෙහි ම උපදිත්. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සප, යම් සේ නැව වඩාලා බඩු ගැණීමෙන් ම ගිලේ ද, කස්සප, එසෙයින් (පරියත්ති ආදින් පිරීමෙන්) සදහම් අතුරුදන් නො වේ. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සප, පිරිහීමට හේතු වන මේ දහම් පසෙක් සදහම්හුගේ නැසීම පිණිස අතුරුදන් වීම පිණිස පවතී. කවර පසෙක් ද යත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කස්සප, මේ සසුන්හි භික්ෂූහු භික්ෂුණීහු උපාසකයෝ උපාසිකාවෝ ශාසතෲන් වහන්සේ කෙරෙහි ගෞරව නැත්තාහු යටත් පැවතුම් නැත්තාහු වෙසෙත්. ධර්මය කෙරෙහි ගෞරව නැත්තාහු යටත් පැවතුම් නැත්තාහු වෙසෙත්. සඞ්ඝයා කෙරෙහි ගෞරව නැත්තාහු යටත් පැවතුම් නැත්තාහු වෙසෙත්. ශික්‍ෂාව කෙරෙහි ගෞරව නැත්තාහු යටත් පැවතුම් නැත්තාහු වෙසෙත්. සමාධිය කෙරෙහි ගෞරව නැත්තාහු යටත් පැවතුම් නැත්තාහු වෙසෙත්. කස්සප, පිරිහීමට හේතු වන මේ දහම් පස සදහම්හුගේ නැසීම පිණිස, අතුරුදන් වීම පිණිස පවතී. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "343"
            },
            {
                "format": 13,
                "text": "කස්සප, මේ දහම් පසෙක් සදහම්හුගේ පැවැත්ම පිණිස නොනැසීම පිණිස අතුරුදන් නො වීම පිණිස පවතී. කවර පසෙක් ද යත්: කස්සප, මෙසස්නෙහි භික්ෂූහු භික්ෂුණීහු උපාසකයෝ උපාසිකාවෝ ශාසතෘන් වහන්සේ කෙරෙහි ගෞරව ඇත්තාහු යටත් පැවතුම් ඇත්තාහු වෙසෙත්. ධර්මය කෙරෙහි ගෞරව ඇත්තාහු යටත් පැවතුම් ඇත්තාහු වෙසෙත්. සඞ්ඝයා කෙරෙහි ගෞරව ඇත්තාහු යටත් පැවතුම් ඇත්තාහු වෙසෙත්. ශික්‍ෂාව කෙරෙහි ගෞරව ඇත්තාහු යටත් පැවතුම් ඇත්තාහු වෙසෙත්, සමාධිය කෙරෙහි ගෞරව ඇත්තාහු යටත් පැවතුම් ඇත්තාහු වෙසෙත්. කස්සප, මේ දහම්පස සදහම්හුගේ පැවැත්ම පිණිස නො නැසීම පිණිස අතුරුදන් නො වීම පිණිස පවතී.",
                "type": "paragraph"
            },
            {
                "format": 11,
                "text": "කස්සපවර්ගය පළමුවැනි යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 20,
                "text": "**එහි උද්දානය :**",
                "type": "unindented"
            },
            {
                "format": 20,
                "text": "සන්තුට්ඨ, අනොත්තාපී, චන්දොපම, ජිණ්ණ යන සූත්‍ර ය, ඔවාද සූත්‍ර තුණ ය, ඣානාභිඤ්ඤා, උපස්සය, චීවර, පරම්මරණ, සද්ධම්මපතිරූපක සූත්‍ර ය යි සූත්‍ර තෙළෙසකි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "කස්සපසංයුත්තය නිමියේ ය.",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ]
    }
]