{
    "filename": "sn-2-3",
    "bookId": 17,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 276,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. අනමතග්ගසංයුත්තං",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. තිණකට්ඨවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තිණකට්ඨසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "264. එවං මෙ සුතං: එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි ‘භික්ඛවො’ති. ‘භදන්තෙ’ති තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනමතග්ගොයං භික්ඛවෙ, සංසාරො, පුබ්බා කොටි න පඤ්ඤායති අවිජ්ජානීවරණානං සත්තානං තණ්හාසංයොජනානං සන්ධාවතං සංසරතං. සෙය්යථාපි භික්ඛවෙ, පුරිසො යං ඉමස්මිං ජම්බුදීපෙ තිණකට්ඨසාඛාපලාසං, තං ඡෙත්වා{1} එකජ්ඣං සංහරෙය්ය, එකජ්ඣං සංහරිත්වා චතුරඞ්ගුලං චතුරඞ්ගුලං ඝටිකං කරිත්වා{2} නික්ඛීපෙය්ය, අයං මෙ මාතා, තස්සා මෙ මාතු අයං මාතාති. අපරියාදින්නාව භික්ඛවෙ, තස්ස පුරිසස්ස මාතු මාතරො අස්සු. අථ ඉමස්මිං ජම්බුදීපෙ තිණකට්ඨසාඛාපලාසං පරික්ඛයං පරියාදානං ගච්ඡෙය්ය. තං කිස්ස හෙතු? අනමතග්ගොයං භික්ඛවෙ සංසාරො. පුබ්බා කොටි න පඤ්ඤායති අවිජ්ජානීවරණානං සත්තානං තණ්හාසංයොජනානං සන්ධාවතං සංසරතං."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං දීඝරත්තං වො{3} භික්ඛවෙ දුක්ඛං පච්චනුභූතං, තිබ්බං පච්චනුභූතං, ව්යසනං පච්චනුභූතං, කටසි{4} වඩ්ඪිතා. යාවඤ්චිදං භික්ඛවෙ, අලමෙව සබ්බසඞ්ඛාරෙසු නිබ්බින්දිතුං, අලං විරජ්ජිතුං, අලං විමුච්චිතුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පඨවීසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "265. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනමතග්ගොයං භික්ඛවෙ, සංසාරො. පුබ්බා කොටි න පඤ්ඤායති අවිජ්ජානීවරණානං සත්තානං තණ්හාසංයොජනානං සන්ධාවතං සංසරතං. සෙය්යථාපි භික්ඛවෙ, පුරිසො ඉමං මහාපඨවිං කොලට්ඨිකමත්තං{5} කොලට්ඨිකමත්තං ගුළිකං{6} කරිත්වා නික්ඛිපෙය්ය, අයං මෙ{7} පිතා, තස්ස මෙ පිතු අයං පිතාති. අපරියාදින්නාව ඛො භික්ඛවෙ{8} තස්ස පුරිසස්ස පිතු පිතරො අස්සු. අථායං මහාපඨවී පරික්ඛයං පරියාදින්නං ගච්ඡෙය්ය. තං කිස්ස හෙතු? අනමතග්ගොයං භික්ඛවෙ, සංසාරො. පුබ්බා කොටි න පඤ්ඤායති අවිජ්ජානීවරණානං සත්තානං තණ්හාසංයොජනානං සන්ධාවතං සංසරතං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. තච්ඡෙත්වා - සීමු. PTS. ගහෙත්වා - සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "2. කත්වා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. දීඝරත්තං ඛො - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. කටසී - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. කොලට්ඨිමත්තං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "6. මත්තිකා ගුටිකං - මඡසං. මත්තිකා ගුළිකං - ස්යා. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "7. අයං ඛො මෙ - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "8. අපරියාදින්නා ච භික්ඛවෙ - මඡසං. අපරියාදින්නා ච භික්ඛවෙ - ස්යා. අපරියාදින්නා භික්ඛවෙ - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 4,
                        "text": "3. අනමතග්ග සංයුක්තය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. තිණකට්ඨ වර්ගය",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තිණකට්‌ඨ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "264. සැවැත්නුවර -\nමා විසින් මෙසේ අසන ලදි: එක් කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයෙහි ජේතවන නම් වූ අනේපිඬු සිටුහුගේ අරම්හි වැඩවසන සේක. එකල්හි භාග්‍යවතුන් වහන්සේ 'මහණෙනි' යි භික්ෂූන් ඇමතු සේක. ඒ භික්ෂූහු 'වහන්සැ' යි භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වූහ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මේ සසර අනුව ගොසිනුදු නොපිරිසුන් අග ඇති. එහෙයින් අවිද්‍යානීවරණයෙන් ඇවුරුණු තෘෂ්ණාසංයෝජනයන් බැඳුනු දිවෙන සැරිසරණ සත්වයන්ගේ පූර්වකෝටිය (පූර්වාන්තය) නො පැණේ. මහණෙනි, යම්සේ පුරුෂයෙක් මේ දඹදිව යම් තාක් තණ දඬු අතු කොළ වේ නම්, එය සිඳ එක් රැස් කරන්නේ ද, එක් රැස් කොට සතරගුල් සතරගුල් කඩ කොට \"මෝ මාගේ මව ය, මෝ මාගේ ඒ මවගේ මව ය\" යි තබන්නේද, මහණෙනි, ඒ පුරුෂයාගේ මවගේ මවුහු නො පිරිසිඳුනාහු ම වන්නාහ. වැලි, මේ දඹදිව තණ දඬු අතු කොළ ක්ෂය වීමට අවසන් වීමට යන්නේය. ඒ කවර හෙයින යත්: මහණෙනි, මේ සසර අනවරාග්‍ර (අපරාන්ත රහිත) ය. එහෙයින් අවිද්‍යාවෙන් වැසුනු තෘෂ්ණාවෙන් බැඳුනු (එහි) දිවෙන සැරිසරණ සත්වයන්ගේ පූර්වාන්තය නො පෙණේ. ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මෙසේ තොප විසින් දිඟුකලක් දුක්විඳින ලදී. තියුණු දුක් විඳින ලදී, (ඥාතිව්‍යසනාදි) ව්‍යසන විඳින ලදී. සොහොන නොහොත් පොළොව වඩන ලදී. මහණෙනි, එහෙයින් සියලු සංස්කාරයන්හි කළකිරෙන්නට නිසි ම ය, නො ඇලන්නට නිසි ම ය, මිදෙන්නට නිසි මැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පඨවී සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "265. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මේ සසර අමතවූ - නොදත් අග් ඇතියේයි. අවිද්‍යා නීවරණයෙන් ඇවුරුණු තෘෂ්ණාසංයෝජනයෙන් බැඳුනු දිවෙන සැරිසරණ සත්වයන්ගේ මුල නො පැණේ. මහණෙනි, යම් සේ පුරුෂයෙක් මේ මහපොළොව ඩෙබර ඇට පමණ ඩෙබර ඇට පමණ ගුළි කොට \"මේ මගේ පියා ය, මේ මගේ ඒ පියාගේ පියා ය\" යි තබන්නේ ද, මහණෙනි, ඒ පුරුෂයාගේ පියාගේ පියහු නො පිරිසිදින ලද්දාහු ම වන්නාහ වැලි, මේ මහපොළොව ගෙවීමට අවසන් විමට යන්නේය. ඒ කුම් හෙයින? යත්: මහණෙනි, මේ සසර අවිදිත වූ අග ඇතියේ යි. අවිද්‍යා නීවරණයෙන් ඇවුරුණු තෘෂ්ණාසංයෝජනයෙන් බැඳුනු දිවෙන සැරිසරණ සත්වයන්ගේ මුල නො පෙණේ. (එහෙයිනි.)",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 278,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එවං දීඝරත්තං වො භික්ඛවෙ, දුක්ඛං පච්චනුභූතං, තිබ්බං පච්චනුභූතං, ව්යසනං පච්චනුභූතං, කටසි වඩ්ඪිතා. යාවඤ්චිදං භික්ඛවෙ, අලමෙව සබ්බසඞ්ඛාරෙසු නිබ්බින්දිතුං, අලං විරජ්ජිතුං, අලං විමුච්චිතුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අස්සුසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "266. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනමතග්ගොයං භික්ඛවෙ, සංසාරො. පුබ්බා කොටි න පඤ්ඤායති අවිජ්ජානීවරණානං සත්තානං තණ්හාසංයොජනානං සන්ධාවතං සංසරතං. “දීඝරත්තං වො භික්ඛවෙ, දුක්ඛං පච්චනුභූතං”.{1} තං කිං මඤ්ඤථ භික්ඛවෙ කතමන්නු ඛො බහුතරං යං වා ඛො ඉමිනා දීඝෙන අද්ධුනා සන්ධාවතං සංසරතං අමනාපසම්පයොගා මනාපවිප්පයොගා කන්දන්තානං රුදන්තානං{2} අස්සු පස්සන්නං{3} පග්ඝරිතං, යං වා චතූසු මහාසමුද්දෙසු උදකන්ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "“යථා ඛො මයං භන්තෙ, භගවතා ධම්මං දෙසිතං ආජානාම, එතදෙව භන්තෙ, බහුතරං යං නො ඉමිනා දීඝෙන අද්ධුනා සන්ධාවතං සංසරතං අමනාපසම්පයොගා මනාපවිප්පයොගා කන්දන්තානං රොදන්තානං අස්සු පස්සන්නං{3} පග්ඝරිතං, යං වා චතූසු මහාසමුද්දෙසු උදකන්ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "සාධු සාධු භික්ඛවෙ, සාධු ඛො මෙ තුම්හෙ භික්ඛවෙ, එවං ධම්මං දෙසිතං ආජානාථ. එතදෙව භික්ඛවෙ, බහුතරං යං වො ඉමිනා දීඝෙන අද්ධුනා සන්ධාවතං සංසරතං අමනාපසම්පයොගා මනාපවිප්පයොගා කන්දන්තානං රුදන්තානං අස්සු පස්සන්නං පග්ඝරිතං, න ත්වෙව චතූසු මහාසමුද්දෙසු උදකං. දීඝරත්තං වො භික්ඛවෙ, මාතුමරණං පච්චනුභූතං. [එතදෙව භික්ඛවෙ බහුතරං යං] තෙසං වො මාතුමරණං පච්චනුභොන්තානං අමනාපසම්පයොගා මනාපවිප්පයොගා කන්දන්තානං රුදන්තානං අස්සු පස්සන්නං, පග්ඝරිතං. න ත්වෙව චතූසු මහාසමුද්දෙසු උදකං. දීඝරත්තං වො භික්ඛවෙ පි පිතුමරණං පච්චනුභූතං -පෙ- භාතුමරණං පච්චනුභූතං -පෙ- භගිනිමරණං පච්චනුභූතං -පෙ- පුත්තමරණං පච්චනුභූතං -පෙ- ධීතුමරණං පච්චනුභූතං -පෙ- ඤාතිව්යසනං පච්චනුභූතං -පෙ- භොගව්යසනං පච්චනුභූතං -පෙ- රොගව්යසනං පච්චනුභූතං -පෙ- තෙසං වො රොගව්යසනං පච්චනුභොන්තානං අමනාපසම්පයොගා මනාපවිප්පයොගා කන්දන්තානං රුදන්තානං අස්සු පස්සන්නං පග්ඝරිතං. න ත්වෙව චතූසු මහාසමුද්දෙසු උදකං. තං කිස්ස හෙතු? අනමතග්ගොයං භික්ඛවෙ, සංසාරො -පෙ- යාවඤ්චිදං භික්ඛවෙ, අලමෙව සබ්බසඞ්ඛාරෙසු නිබ්බින්දිතුං, අලං විරජ්ජිතුං, අලං විමුච්චිතුන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. “න” දිස්සතෙයං අන්තරිත පාඨො - මඡසං. ස්යා. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. රොදන්තානං - මඡසං. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. පස්සන්දං - සීමු. පස්සන්දන්තිං සන්දිතං, අට්ඨකථා - සීමු. පසන්දං - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "මහණෙනි, මෙසේ තොප විසින් දිගුකලක් ම දුක් විඳින ලදී, තියුණු දුක් විඳින ලදි, ව්‍යසන විඳින ලදී, සොහොන හෝ පොළොව වඩන ලදී. මහණෙනි, එහෙයින් සියලු සංස්කාරයන්හි කළකිරෙන්නට නිසි ම ය, නො ඇලෙන්නට නිසි ම ය, මිදෙන්නට නිසි මැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අස්‌සු සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "266. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මේසසර අප්රිවිච්ඡින්නි වූ පශ්චිම සීමා ඇතීයේ යි. එහෙයින් අවිද්‍යාවෙන් වැසුනු තෘෂ්ණාවෙන් බැඳුනු (එහි) ධාවත් සංසරත් සත්වයන්ගේ පූර්වසීමා නො පෙණේ. මහණෙනි, තොප විසින් දිගුකලක් දුක් විඳින ලදී. ඒ කිමැ යි හඟිවු ද, මේ දිගුකල දිවෙන සැරිසරණ, අමනාපයන් හා එක් වීමෙන් මනාපයන්ගෙන් වෙන් වීමෙන් හඬන වැලපෙන තොපගේ වෑහුනු වැගුරුණු යම් කඳුලෙක් වේද, සිවුමහසමුදුරෙහි යම් ජලයෙක් වේ ද, (මෙයින්) කිමෙක් ඉතා වැඩි දැ යි?",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "වහන්ස, අපි භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරණ ලද ධර්මය යම් සේ දනිමු නම්, මේ දිගුකල දිවෙත්. දිවෙන සැරිසරණ, අමනාපයන් හා එක් වීමෙන් මනාපයන්ගෙන් වෙන් වීමෙන් හඬන වැලපෙන අපගේ වෑහුනු  වැගුරුණු යම් කඳුලෙක් වී ද, වහන්ස, මෙය ම ඉතා වැඩි ය. සිවුමහසමුදුරෙහි ජලය නො ම වැඩි ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මැනවි, මැනවි. මහණෙනි, තෙපි මා විසින් දේශනා කරණ ලද ධර්මය මෙසේ දනිවු නම් මැනවි. මහණෙනි, මේ දිගුකල දිවෙන සැරිසරණ අමනාපයන් හා එක් වීමෙන් මනාපයන්ගෙන් වෙන්වීමෙන් හඬන වැලපෙන තොපගේ වෑහුනු වැගුරුණු යම් කඳුලෙක් වී නම් මෙය ම ඉතා වැඩි ය. සිවුමහසමුදුරෙහි ජලය නො ම වැඩි ය. මහණෙනි, තොප විසින් දිගුකලක් මවු මළ දුක විඳිනලදී. මහණෙනි, මවු මළ දුක විඳීන අමනාපයන් හා එක් වීමෙන් මනාපයන්ගෙන් වෙන් වීමෙන් හඬන වැලපෙන ඒ තොපගේ වෑහුණු වැගුරුනු යම් කඳුලෙක් වී නම් එය ඉබොහෝමය. සිවුමහසමුදුරෙහි දිය නොබොහෝමය. මහණෙනි, තොප විසින් දිගුකලක් පියා මළ දුක විඳින ලදි ... බෑයා මළ දුක විඳින ලදි ... බුහුන මළ දුක විඳින ලදි ... පුතු මළ දුක විඳින ලදි ... දූ මළ දුක විඳින ලදි ... ඥාතිව්‍යසන විඳින ලදි ... භෝගව්‍යසන විඳින ලදි ... රෝගව්‍යසන විඳින ලදි … රෝගව්‍යසනය විඳින්නා වූ අමනාපයන් හා එක් වීමෙන් මනාපයන්ගෙන් වෙන් වීමෙන් හඬන වැලපෙන ඒ තොපගේ වෑහුනු වැගුරුණු කඳුලු ඉතා වැඩි ය. සිවුමහසයුරෙහි දිය නො ම වැඩි ය. ඒ කවර හෙයින් යත්: මහණෙනි, මේ සසර නො පිරිසුන් කෙළවර ඇතියේ ය... මහණෙනි, එහෙයින් සියලු සංස්කාරයන්හි කළකිරෙන්නට නිසි ම ය, නො ඇලෙන්නට නිසි ම ය, මිදෙන්නට නිසි මැ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 280,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 1. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මාතුථඤ්ඤසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "267. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනමතග්ගොයං භික්ඛවෙ, සංසාරො. පුබ්බා කොටි න පඤ්ඤායති අවිජ්ජානීවරණානං සත්තානං තණ්හාසංයොජනානං සන්ධාවතං සංසරතං. තං කිං මඤ්ඤථ භික්ඛවෙ, කතමන්නු ඛො බහුතරං යං වා වො{1} ඉමිනා දීඝෙන අද්ධුනා සන්ධාවතං සංසරතං මාතුථඤ්ඤං පීතං, යං වා චතූසු මහාසමුද්දෙසු උදකන්ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "“යථා ඛො මයං භන්තෙ, භගවතා ධම්මං දෙසිතං ආජානාම, එතදෙව භන්තෙ, බහුතරං යං නො{2} ඉමිනා දීඝෙන අද්ධුනා සන්ධාවතං සංසරතං මාතුථඤ්ඤං පීතං, නත්වෙව චතූසු මහාසමුද්දෙසු උදක”න්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සාධු සාධු භික්ඛවෙ, සාධු ඛො මෙ තුම්හෙ භික්ඛවෙ, එවං ධම්මං දෙසිතං ආජානාථ. එතදෙව භික්ඛවෙ, බහුතරං යං වො ඉමිනා දීඝෙන අද්ධුනා සන්ධාවතං සංසරතං මාතුථඤ්ඤං පීතං, නත්වෙව චතූසු මහාසමුද්දෙසු උදකං. තං කිස්ස හෙතු? අනමතග්ගොයං භික්ඛවෙ, සංසාරො -පෙ- අලං විමුච්චිතුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පබ්බතසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "268. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො අඤ්ඤතරො භික්ඛු යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා -පෙ- එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච: “කීවදීඝො{3} නු ඛො භන්තෙ, කප්පො”ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "දීඝො ඛො භික්ඛු, කප්පො. සො න සුකරො සඞ්ඛාතුං එත්තකානි වස්සානි ඉති වා, එත්තකානි වස්සසතානි ඉති වා, එත්තකානි වස්සසහස්සානි ඉති වා, එත්තකානි වස්සසතසහස්සානි ඉති වාති. සක්කා පන භන්තෙ, උපමං කාතුන්ති? සක්කා භික්ඛූති භගවා අවොච. සෙය්යථාපි භික්ඛු, මහාසෙලො පබ්බතො යොජනං ආයාමෙන, යොජනං විත්ථාරෙන, යොජනං උබ්බෙධෙන, අච්ඡිද්දො අසුසිරො එකඝනො. තමෙනං පුරිසො වස්සසතස්ස වස්සසතස්ස අච්චයෙන කාසිකෙන වත්ථෙන සකිං සකිං පරිමජ්ජෙය්ය. ඛිප්පතරං ඛො සො භික්ඛු මහාසෙලො පබ්බතො ඉමිනා උපක්කමෙන පරික්ඛයං පරියාදානං ගච්ඡෙය්ය, න ත්වෙව කප්පො."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං දීඝො ඛො භික්ඛු, කප්පො. එවං දීඝානං ඛො භික්ඛු, කප්පානං නෙකො කප්පො සංසිතො නෙකං කප්පසතං සංසිතං, නෙකං කප්පසහස්සං සංසිතං, නෙකං කප්පසතසහස්සං සංසිතං. තං කිස්ස හෙතු? අනමතග්ගොයං භික්ඛු සංසාරො. -පෙ- අලං විමුච්චිතුන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඛො - සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "2. යං ඛො - සීමු. සී 2."
                    },
                    {
                        "type": "footnote",
                        "text": "3. කීවො දීඝො - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 1. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මාතුථඤ්ඤ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "267. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මෙ සසර නො පිරිසුන් අග ඇතියේ ය, අවිද්‍යාවෙන් ඇවුරුණු තෘෂ්ණාවෙන් බැඳුනු දිවෙන සැරිසරණ සත්වයන්ගේ මුල් කෙළවර නො පෙණේ.  මහණෙනි, ඒ කිමැ යි හඟිවු ද? මේ දිගුකල දිවෙන සැරිසරණ තොප විසින් (එක්නම් ඇති මිනිස්) මවකගේ යම් කිරක් පූ ද, සිවුමහ සමුදුරෙහි යම් ජලයෙක් වේ ද, (මෙයින්) කිමෙක් ඉතා වැඩි ද?",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "__missing trans__"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මැනවි, මැනවි. මහණෙනි, මා විසින් දේශනා කරණ ලද ධර්මය තෙපි මෙසේ දනිවු නම් මැනවි. මහණෙනි, මේ දිගුකල් දිවෙන සැරිසරණ තොප විසින් යම් මවුකිරෙක් පූ නම්, එය ම ඉතා වැඩි ය. සිවුමහසමුදුරෙහි දිය නො වැඩි ය. ඒ කුම් හෙයින යත්: මහණෙනි, මෙසසර නො දන්නා ලද කෙළවර ඇතියේ ය ... මිදෙන්නට සුදුසුමැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පබ්‌බත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "268. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති එක්තරා මහණෙක් භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ ... එකත්පසෙක හුන් ඒ මහණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේය: \"වහන්ස, කල්පය කෙතෙක් දිගු දෝ\" යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණ, කල්පය දිග ය. එය මෙතෙක් වසැයි හෝ මෙතෙක් වස් සියයෙකැ යි හෝ මෙතෙක් වස් දහසෙකැ යි හෝ මෙතෙක් වස් සියදහසෙකැ යි හෝ ගිණිමට සුකර නො වේ. වහන්ස, උපමාවක් කරනට හැකි ද? මහණ, හැකි ය යි භාග්‍යවතුන් වහන්සේ වදාළ සේක. මහණ, යම් සේ අයමින් යොදුනක් වූ, විතරින් යොදුනක් වූ උසින් යොදුනක් වු සිදුරු රහිත විවර රහිත ගතබොල් මහසෙල් මුවා පව්වෙක් වේ ද, එය පුරුෂයෙක් සියවසක් සියවසක් ඇවෑමෙන් කසීසළුවෙකින් වරින්වර පිරිමදනේ ද, මහණ, මේ උපක්‍රමයෙන් ඒ මහසෙල් මුවා පව්ව වහා ගෙවීමට අවසන් වීමට යන්නේ ය. කල්පය (එතෙක්) අවසනට නො යන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණ, මෙසේ කල්පය දීර්ඝ ය. මහණ, මෙසේ දීර්ඝ වූ කල්පයන් අතුරෙන් ස්‍රස්රස්තවූයේ - ගෙවීගියේ එක්කපෙක් නො වෙයි. ගෙවීගියේ කප්සියෙක් නො වෙයි. ගෙවීගියේ කප්දහසෙක් නො වෙයි ගෙවීගියේ කප්සියදහසෙක් නො වෙයි. ඒ කවර හෙයින යත්: මහණ, මෙසසර අනවරාග්‍ර වෙයි ... (එයින්) මිදෙන්නට නිසි මැ යි.   ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 282,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 1. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සාසපසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "269. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො අඤ්ඤතරො භික්ඛු යෙන භගවා තෙනුපසඞ්කමි. -පෙ- එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච: “කීවදීඝො නු ඛො භන්තෙ, කප්පො”ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "දීඝො ඛො භික්ඛු කප්පො. සො න සුකරො සංඛාතුං එත්තකානි වස්සානීති වා -පෙ- එත්තකානි වස්සසතසහස්සානීති වාති. සක්කා පන භන්තෙ, උපමං කාතුන්ති? සක්කා භික්ඛූති භගවා අවොච. සෙය්යථාපි භික්ඛු ආයසං නගරං යොජනං ආයාමෙන යොජනං විත්ථාරෙන යොජනං උබ්බෙධෙන පුණ්ණං සාසපානං චූලිකාබද්ධං, තතො පුරිසො වස්සසතස්ස වස්සසතස්ස අච්චයෙන එකමෙකං සාසපං උද්ධරෙය්ය. ඛිප්පතරං ඛො සො භික්ඛු මහාසාසපරාසි ඉමිනා උපක්කමෙන පරික්ඛයං පරියාදානං ගච්ඡෙය්ය, න ත්වෙව කප්පො."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං දීඝො ඛො භික්ඛු, කප්පො. එවං දීඝානං ඛො භික්ඛු, කප්පානං නෙකො කප්පො සංසිතො. නෙකං කප්පසතං සංසිතං, නෙකං කප්පසහස්සං සංසිතං. නෙකං කප්පසතසහස්සං සංසිතං. තං කිස්ස හෙතු? අනමතග්ගොයං භික්ඛු සංසාරො -පෙ- අලං විමුච්චිතුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සාවකසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "270. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො සම්බහුලා භික්ඛූ යෙන භගවා තෙනුපසඞ්කමිංසු. -පෙ- එකමන්තං නිසින්නා ඛො තෙ භික්ඛූ භගවන්තං එතදවොචුං “කීවබහුකා නු ඛො භන්තෙ, කප්පා අබ්භතීතා අතික්කන්තා”ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "බහුකා ඛො භික්ඛවෙ, කප්පා අබ්භතීතා අතික්කන්තා. තෙ න සුකරා සඞ්ඛාතුං එත්තකා කප්පා ඉති වා, එත්තකානි කප්පසතානි ඉති වා, එත්තකානි කප්පසහස්සානි ඉති වා, එත්තකානි කප්පසතසහස්සානි ඉති වාති. සක්කා පන භන්තෙ, උපමං කාතුන්ති? සක්කා භික්ඛවොති භගවා අවොච. ඉධස්සු භික්ඛවෙ, චත්තාරො සාවකා වස්සසතායුකා වස්සසතජීවිනො. තෙ දිවසෙ දිවසෙ කප්පසතසහස්සං කප්පසතසහස්සං අනුස්සරෙය්යුං{1}. අනනුස්සරිතාව{2} භික්ඛවෙ, තෙහි කප්පා අස්සු. අථ ඛො තෙ චත්තාරො සාවකා වස්සසතායුකා වස්සසතජීවිනො වස්සසතස්ස අච්චයෙන කාලං කරෙය්යුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං බහුකා ඛො භික්ඛවෙ, කප්පා අබ්භතීතා අතික්කන්තා. තෙ න සුකරා සඞ්ඛාතුං එත්තකා කප්පා ඉති වා, එත්තකානි කප්පසතානි ඉති වා, එත්තකානි කප්පසහස්සානි ඉති වා, එත්තකානි කප්පසතසහස්සානි ඉති වා. තං කිස්ස හෙතු? අනමතග්ගොයං භික්ඛවෙ, සංසාරො -පෙ- අලං විමුච්චිතුන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කප්පසතසහස්ස අනුස්සරෙසුං - සී. 1, 2. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අනුස්සරිතාව - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 1. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සාසප සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "269. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති එක්තරා මහණෙක් භාග්‍යවතුන් වහන්සේ වෙත එළබියේය... එකත්පසෙක හුන් ඒ මහණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේය:  වහන්ස, \"කල්පය කෙතෙක් දිග ද?",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණ, කල්පය දිගය. එය මෙතෙක් වසැ යි හෝ … මෙතෙක් වස් සියදහසැයි හෝ ගණනට සූකර නොවේ වහන්ස, උපමාවක් කරනට හැකි ද? මහණ, හැකි ය යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.  මහණ, යම් සේ දිගින් යොදුනක් වූ පුළුලින් යොදුනක් වූ උසින් යොදුනක් වූ අබැටින් සිළු බැද පිරුණු යපවුරෙන් පිරිකෙවු නුව‍රෙක් වේද, පුරුෂයෙක් සියවස් සියවස් ඇවෑමෙන් එයින් එක් එක් අබැටක් උදුරන්නේද, මහණ, ඒ මහත් අබැටරැස මේ උපක්‍රමයෙන් ඉතා වහා ගෙවීමට නිමාවට යන්නේ ය. කල්පය(එසේ ගෙවීමට) නො ම යන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණ, මෙසේ කල්පය දිගය. මහණ, මෙසේ දික් වූ කල්පයන් අතුරෙන් ගෙවුනේ එක් කපෙක් නො වෙයි.  ගෙවුනේ කප්සියෙක් නො වෙයි. ගෙවුනේ කප් දහසෙක් නො වෙයි. ගෙවුනේ කප් සියදහසෙක් නොවේ. ඒ කවර හෙයින යත්: මහණ, මෙසසර අනවරාග්‍රය ... එයින් මිදෙන්නට නිසි මැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සාවක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "270. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ … එකත්පසෙක හුන් ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙය සැළකළහ: \"වහන්ස, කෙතෙක් බොහෝ කල්පයෝ ගත වූවාහු ද, ඉක්මුනා ද\"",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, අතීත වූ කල්පයෝ බොහෝ ය. මෙතෙක් කපැ යි හෝ මෙතෙක් කප් සියෙකැ යි හෝ මෙතෙක් කප්දහසැ යි හෝ මෙතෙක් කප් සියදහසැ යි හෝ එය ගිණුමට සුකර නො වෙයි වහන්ස, උපමාවක් කරනට හැකි දෑයි? මහාණෙනි, හැකි ය යි භාග්‍යවතුන් වහන්සේ වදාළ සේක. මහණෙනි, මෙහි සියවස් ආයු ඇති සියවස් ජීවත් වන සුලු සව්වෝ සිවුදෙනෙක් වෙත් නම්, ඔහුත් දිනපතා කප් සියදහසක්  කප් සියදහසක් සිහි කෙරෙත් නම්, මහණෙනි, ඔවුන් විසින් කල්පයෝ සිහි නො කළහු ම වෙත්. වැලි දු සියවස් ආයු ඇති සියවස් ජීවත්වන සුලු ඒ සිවුසව්වෝ සියවස් සියවස්හුගේ ඇවැමෙන් කලුරිය කරන්නාහු ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මෙසේ ගෙවී ගියා වූ ඉක්ම ගියා වූ කල්පයෝ බොහෝ ය. ඔහු මෙතෙක් කපැ යි හෝ, මෙතෙක් කප් සියෙකැයි හෝ, මෙතෙක් කප් දහසැයි හෝ, මෙතෙක් කප් සියදහසැයි හෝ ගිණීමට සූකර නො වෙත්. ඒ කවර හෙයින යත්: මහණෙනි, මෙසසර අපරිමාණ ය … එයින් මිදෙන්නට නිසි මැ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 284,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 1. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ගඞ්ගාසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "271. එකං සමයං භගවා රාජගහෙ විහරති වෙළුවනෙ කලන්දකනිවාපෙ. අථ ඛො අඤ්ඤතරො බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි -පෙ- එකමන්තං නිසින්නො ඛො සො බ්රාහ්මණො භගවන්තං එතදවොච. කීවබහුකා නු ඛො භො ගොතම, කප්පා අබ්භතීතා අතික්කන්තාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "බහුකා ඛො බ්රාහ්මණ, කප්පා අබ්භතීතා අතික්කන්තා. තෙ න සුකරා සඞ්ඛාතුං එත්තකා කප්පා ඉති වා, එත්තකානි කප්පසතානි ඉති වා, එත්තකානි කප්පසහස්සානි ඉති වා, එත්තකානි කප්පසතසහස්සානි ඉති වාති. සක්කා පන භො ගොතම උපමං කාතුන්ති? සක්කා බ්රාහ්මණාති භගවා අවොච. සෙය්යථාපි බ්රාහ්මණ යතො චායං ගඞ්ගානදී පහොති{1}, යත්ථ ච මහාසමුද්දං අප්පෙති, යා තස්මිං{2} අන්තරෙ වාලිකා, එසා න සුකරා සඞ්ඛාතුං එත්තකා වාලිකා ඉති වා, එත්තකානි වාලිකාසතානි ඉති වා, එත්තකානි වාලිකාසහස්සානි ඉති වා, එත්තකානි වාලිකාසතසහස්සානි ඉති වා."
                    },
                    {
                        "type": "paragraph",
                        "text": "තතො බහුතරං ඛො බ්රාහ්මණ, කප්පා අබ්භතීතා අතික්කන්තා. තෙ න සුකරා සඞ්ඛාතුං එත්තකා කප්පා ඉති වා, එත්තකානි කප්පසතානි ඉති වා, එත්තකානි කප්පසහස්සානි ඉති වා, එත්තකානි කප්පසතසහස්සානි ඉති වා. තං කිස්ස හෙතු? අනමතග්ගොයං බ්රාහ්මණ, සංසාරො -පෙ- අලං විමුච්චිතුන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං වුත්තෙ සො බ්රාහ්මණො භගවන්තං එතදවොච: “අභික්කන්තං භො ගොතම, අභික්කන්තං භො ගොතම -පෙ- උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දණ්ඩසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "272. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනමතග්ගොයං භික්ඛවෙ, සංසාරො. පුබ්බාකොටි න පඤ්ඤායති අවිජ්ජානීවරණානං සත්තානං තණ්හාසංයොජනානං සන්ධාවතං සංසරතං. සෙය්යථාපි භික්ඛවෙ, දණ්ඩො උපරි වෙහාසං ඛිත්තො සකිම්පි මූලෙන නිපතති, සකිම්පි මජ්ඣෙන නිපතති. සකිම්පි අග්ගෙන{3} නිපතති, එවමෙව ඛො භික්ඛවෙ අවිජ්ජානීවරණා සත්තා තණ්හාසංයොජනා සන්ධාවන්තා සංසරන්තා සකිම්පි අස්මා ලොකා පරං ලොකං ගච්ඡන්ති. සකිම්පි පරස්මා ලොකා ඉමං ලොකං ආගච්ඡන්ති. තං කිස්ස හෙතු? අනමතග්ගොයං භික්ඛවෙ, සංසාරො -පෙ- අලං විමුච්චිතුන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පභවති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. යා ච තස්මිං - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අන්තෙන - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 1. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ගඞ්‌ගා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "271. එක් කලෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර සමීපයෙහි කලන්දකනිවාප නම් වූ වේළුවනාරාමයෙහි වැඩ වසන සේක.  එකල්හි එක්තරා බමුණෙක් භාග්‍යවතුන් වහන්සේ වෙත එළබියේ ය ... එකත්පසෙක හුන් ඒ බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළකෙළේය: භවත් ගෞතමයෙනි, කෙතෙක් බොහෝ කල්පයෝ ගත වූවාහු ඉක්මුනාහු දැ? යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, බොහෝ කල්පයෝ ගත වූහ. ඉක්මූනාහු ය. ඔහු මෙතෙක් කපැයි හෝ මෙතෙක් කප් සියකැයි හෝ මෙතෙක් කප් දහසැයි හෝ මෙතෙක් කප් සියදහසැ යි හෝ ගිණීමට සූකර නො වෙති.  භවත් ගෞතමයෙනි, උපමාවක් කරන්නට හැකි දැ යි? බමුණ, හැකි ය යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.  බමුණ, යම් සේ මේ ගඞ්ගා නදිය යම් තැනෙකින් හට ගණී ද, යම් තැනෙක මහසමුදුරට පිවිසේ ද, මේ අතර යම් වැල්ලෙක් වේ ද, එය මෙතෙක් වැලි ය යි හෝ මෙතෙක් වැලි සියකැ යි හෝ මෙතෙක් වැලි දහසැයි හෝ මෙතක් වැලි සියදහසැයි හෝ ගිණීමට සූකර නො වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, එයට වැඩි ඉතා බොහෝ කල්පයෝ ගත වූවාහු ඉක්ම ගියහ. ඔහු මෙතෙක් කපැයි හෝ  මෙතක් කප් සියකැයි හෝ මෙතක් කප් දහසැයි හෝ මෙතෙක් කප් සියදහසැයි හෝ ගිණීමට සුකර නො වෙති. ඒ කවර හෙයින යත්: බමුණ, මෙසසර අනාදිමත්ය ... එයින් මිදෙන්නට නිසි මැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මෙසේ වදාළ කල්හි ඒ බමුණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළකෙළේ ය: \"භවත් ගෞතමයෙනි, ඉතා මැනවි, භවත් ගෞතමයෙනි, ඉතා මැනවි ... භවත් ගෞතමයන් වහන්සේ මා අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයකු කොට දරණ සේක්වා\" යි.   ",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දණ්‌ඩ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "272. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මෙ සසර නො දත් අග ඇතියේ වෙයි. අවිද්‍යාවෙන් ඇවුරුණු තෘෂ්ණාවෙන් බැඳුනු දිවෙන සැරිසරණ සත්වයන්ගේ පූර්ව කෙළවර නො පෙණේ. මහණෙනි, යම් සේ උඩ අහසෙහි දැමූ දඬෙක් වරක් මුලිනුදු වැටෙයි. වරක් මැදිනුදු වැටෙයි. වරක් අගිනුදු වැටෙයි. මහණෙනි, එසෙයින් ම අවිද්‍යාවෙන් වැසුනු තෘෂ්ණාවෙන් බැඳුනු (ඒ මේ අත) දිවෙන සැරිසරණ සත්වයෝ වරක් මෙලොවින් පරලොවට යෙති. වරක් පරලොවින් මෙලොවට එති. ඒ කවර හෙයින යත්: මහණෙනි, මෙසසර නො පිරිසුන් අග්මුල් ඇත්තේ ය ... එයින් මිදෙන්නට නිසි මැ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 286,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 1. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "එකපුග්ගලසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "273. එකං සමයං භගවා රාජගහෙ විහරති ගිජ්ඣකූටෙ පබ්බතෙ. තත්ර ඛො -පෙ- එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනමතග්ගොයං භික්ඛවෙ, සංසාරො -පෙ- එකපුග්ගලස්ස භික්ඛවෙ, කප්පං සන්ධාවතො සංසරතො සියා එවං මහා අට්ඨිකඞ්කලො අට්ඨිපුඤ්ජො අට්ඨිරාසි යථායං වෙපුල්ලො පබ්බතො, සචෙ සංහාරකො අස්ස, සම්භතඤ්ච න විනස්සෙය්ය. තං කිස්ස හෙතු? අනමතග්ගොයං භික්ඛවෙ, සංසාරො. -පෙ- අලං විමුච්චිතුන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදමවොච භගවා. ඉදං වත්වා සුගතො අථාපරං එතදවොච සත්ථා:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකස්සෙකෙන කප්පෙන පුග්ගලස්සට්ඨිසඤ්චයො,සියා පබ්බතසමො රාසි ඉති වුත්තං මහෙසිනා."
                    },
                    {
                        "type": "paragraph",
                        "text": "සො ඛො පනායං අක්ඛාතො වෙපුල්ලො පබ්බතො මහා,උත්තරො ගිජ්ඣකූටස්ස මගධානං ගිරිබ්බජෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "යතො ච{1} අරියසච්චානි සම්මප්පඤ්ඤාය පස්සති:දුක්ඛං දුක්ඛසමුප්පාදං දුක්ඛස්ස ච අතික්කමං,අරියඤ්චට්ඨඞ්ගිකං මග්ගං දුක්ඛූපසමගාමිනං."
                    },
                    {
                        "type": "paragraph",
                        "text": "ස සත්තක්ඛත්තුං පරමං සන්ධාවිත්වාන පුග්ගලො,දුක්ඛස්සන්තකරො හොති සබ්බසඤ්ඤොජනක්ඛයාති."
                    },
                    {
                        "type": "centered",
                        "text": "තිණකට්ඨවග්ගො පඨමො",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තස්සුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "තිණකට්ඨඤ්ච පඨවී අස්සු ඛීරඤ්ච පබ්බතං,\nසාසපා සාවකො ගඞ්ගා දණ්ඩො ච පුග්ගලෙන චාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. යතො - සීමු. PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 1. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "එකපුග්‌ගල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "273. එක්කලෙක භාග්‍යවතුන් වහන්සේ රජගහනුවර සමිපයෙහි ගිජුකුළු පව්වෙහි වැඩවසන සේක. එහි දි … මෙය වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මෙසසර නැවත නැවත බලයි දු නොපිරිසුන් කෙළවර ඇතියේ යි. මහණෙනි, කපක් මුළුල්ලේ දිවෙන සැරිසරණ එක් පුඟුලකුගේ ඇටසැකිල්ල ඇටගොඩ ඇටරැස ඉදින් රැස් කරන්නෙක් වන්නේ නම්, රැස් කරණ ලදුයේත් නො වැනසේ නම්, මේ වෙපුල්ල පර්වතය යම් සේ ද, එසේ මහත් වන්නේ ය. ඒ කවර හෙයින යත්: මහණෙනි, මෙසසර නො දන්නා ලද කෙළවර ඇතියේ ය. … එයින් මිදෙන්නට නිසි මැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක.  මෙය වදාරා සුගත වූ ශාස්තෲන් වහන්සේ යලි මතුදු මෙය වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එක් කපෙකින් එක් පුඟුලකුගේ ඇට රැස (වෙපුල්ල) පර්වතය බඳු රැසෙක් වන්නේ ය යි මහර්ෂි වූ බුදුරජානන් වහන්සේ විසින් වදාරණ ලදි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඒ මේ මහත් වෙපුල්ල පර්වතය මගධජනපදයෙහි ගිරිව්‍රජයෙහි (පර්වථ පරික්ෂෙපයෙහි) ගිජුකුළු පව්වට උතූරුදික්හි (පිහිටියේ) ය යි කියන ලදී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "යම් කලෙක දුක, දුක හට ගැණිම, දුක ඉක්මීම, දුක ඉක්මීමට යන අරිඅටගිමග යන ආර්යය සත්‍යයන් මනා නුවණින් දකී ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඒ (සෝවන්) පුද්ගල තෙමේ සත්වරක් පරම කොට සැරිසරා සියලු සංයෝජනයන් ක්‍ෂය කිරීමෙන් දුක් කෙළවර කරන්නෙක් වේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 11,
                        "text": "තිණකට්ඨවර්ගය පළමුවැ නි යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 20,
                        "text": "**එහි උද්දානය:**",
                        "type": "unindented"
                    },
                    {
                        "format": 20,
                        "text": "තිණකට්ඨ, පඨවි, අස්සු, බීර, පබ්බත, සාසප, සාවක, ගඞ්ගා, දණ්ඩ, පුග්ගල ය යි සූත්‍ර දශයෙකි යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 288,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "2. දුග්ගතවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුග්ගතසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "274. එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තත්ර ඛො -පෙ-එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනමතග්ගොයං භික්ඛවෙ, සංසාරො. පුබ්බා කොටි න පඤ්ඤායති අවිජ්ජානීවරණානං සත්තානං තණ්හාසංයොජනානං සන්ධාවතං සංසරතං. යං භික්ඛවෙ, පස්සෙය්යාථ දුග්ගතං දුරුපෙතං,{1} නිට්ඨමෙත්ථ ගන්තබ්බං: ‘අම්හෙහිපි එවරූපං පච්චනුභූතං ඉමිනා දීඝෙන අද්ධුනාති’. තං කිස්ස හෙතු? අනමතග්ගොයං භික්ඛවෙ, සංසාරො. -පෙ- අලං විමුච්චිතුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සුඛිතසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "275. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනමතග්ගොයං භික්ඛවෙ, සංසාරො -පෙ- යං භික්ඛවෙ, පස්සෙය්යාථ සුඛිතං සජ්ජිතං, නිට්ඨමෙත්ථ ගන්තබ්බං “අම්හෙහිපි එවරූපං පච්චනුභූතං ඉමිනා දීඝෙන අද්ධුනා”ති. තං කිස්ස හෙතු? අනමතග්ගොයං භික්ඛවෙ, සංසාරො. -පෙ- අලං විමුච්චිතුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තිංසමත්තසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "276. **රාජගහෙ-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො තිංසමත්තා පාවෙය්යකා{2} භික්ඛූ, සබ්බෙ ආරඤ්ඤකා සබ්බෙ පිණ්ඩපාතිකා සබ්බෙ පංසුකූලිකා සබ්බෙ තෙචීවරිකා{3} සබ්බෙ සසංයොජනා{4} යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවතො එතදහොසි: “ඉමෙ ඛො තිංසමත්තා පාවෙය්යකා භික්ඛූ සබ්බෙ ආරඤ්ඤකා, සබ්බෙ පිණ්ඩපාතිකා, සබ්බෙ පංසුකූලිකා, සබ්බෙ තෙචීවරිකා, සබ්බෙ සසංයොජනා.{4} යන්නූනාහං ඉමෙසං තථා ධම්මං දෙසෙය්යං යථා නෙසං{6} ඉමස්මිං යෙව ආසනෙ අනුපාදාය ආසවෙහි චිත්තානි විමුච්චෙය්යු”න්ති.{7}"
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා භික්ඛූ ආමන්තෙසි ‘භික්ඛවො’ති. ‘භදන්තෙ’ති තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච: අනමතග්ගොයං භික්ඛවෙ, සංසාරො. පුබ්බා කොටි න පඤ්ඤායති අවිජ්ජානීවරණානං සත්තානං තණ්හාසංයොජනානං සන්ධාවතං සංසරතං. තං කිං මඤ්ඤථ භික්ඛවෙ, කතමන්නු ඛො බහුතරං, යං වා වො ඉමිනා දීඝෙන අද්ධුනා සන්ධාවතං සංසරතං සීසච්ඡින්නානං ලොහිතං පස්සන්නං පග්ඝරිතං, යං වා චතූසු මහාසමුද්දෙසු උදකන්ති?"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. දුරූපෙතං - මඡසං. PTS. සී 1."
                    },
                    {
                        "type": "footnote",
                        "text": "2. පාඨෙය්යකා - සී 2."
                    },
                    {
                        "type": "footnote",
                        "text": "3. තිචීවරිකා - සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "4. සසඤ්ඤොජනා - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "6. ඉමෙසං - සීමු. සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "7. චිත්තං විමුච්චියාති - සී 1, 2. චිත්තානි විමුච්චෙය්යන්ති - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "2. දුග්ගත වර්ගය",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුග්‌ගත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "274. එක්කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයෙහි අනේපිඬු සිටුහුගේ දෙව්රම්හි වැඩවසන සේක. එහි දි … මෙය වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“මහණෙනි, මෙසසර නො පිරිසුන් අග ඇතියේ ය. අවිද්‍යානීවරණයෙන් වැසුනු තෘෂ්ණාසංයොජනයෙන් බැඳුනු දිවෙන සැරිසරණ සත්වයන්ගේ පූකෙළ (පූර්වාන්තය) නො පෙණේ. මහණෙනි, දිළිදු වූ විරූප වූ යමකු දක්නහු නම්, මෙහි දී “අප විසිනු දු මේ දීර්ඝකාලයෙහි මෙබඳුවක් වීඳින ලදැ”යි නිමාවට (නිශ්චයට) යා යුතු යි. එ කවර හෙයින යත්: මහණෙනි, මෙසසර නො පිරිසුන් අග ඇතියේ යි … මෙයිනුදු … මිදෙන්නට නිසි මැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සුඛිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "275. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මෙසසර නො පිරිසුන් අග ඇතියේ ය … මහණෙනි, සුවපත් අලඞ්කාරයෙන් සැදුනු යමකු දක්නහු නම්, මෙහි දී “මේ දිගුකල අප විසිනුදු මෙබඳුවක් විදින ලද” යි නිමාවට යා යුතු යි. ඒ කවර හෙයින යත්: මහණෙනි, මෙසසර නො පිරිසුන් අග ඇතියේ ය ... මෙයිනුදු මිදෙන්නට නිසි මැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තිංසමත්‌ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "276 **රජගහනුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි සියල්ලෝ ම ආරණ්‍යක  වූ පිණ්ඩපාතික වූ පාංශුකූලික වූ තෙචීවරික වූ, සියල්ලෝ ම සංයෝජන සහිත වූ, පාවානුවර වැසි තිස්නමක් පමණ භික්ෂූහු භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හිඳ ගත්හ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි භාග්‍යවතුන් වහන්සේට “පාවානුවර වැසි මේ තිස්නමක් පමණ වූ භික්ෂූහු සියල්ලෝ ම ආරණ්‍යකහ. පිණ්ඩපාතිකහ. පාංශුකූලිකහ. තෙචීවරිකහ. සියල්ලෝ ම සංයෝජන සහිතහ. ඉදින්, මේ අසුන්හි දී ම ඔවුන්ගේ සිත් උපදාන රහිත ව ආස්‍රවයන්ගෙන් යම් සේ මිදේ නම් එසේ මම මොවුනට දහම් දෙසන්නේ නම් මැනැවැ”යි මේ සිත විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ ‘මහණෙනි’ යි බික්ෂූන් ඇමතූසේක. ‘වහන්සැ’යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වූහ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: මහණෙනි, මෙසසර අවිදිතාග්‍ර ඇතියේ ය. අවිද්‍යාවෙන් වැසුනු තෘෂ්ණාවෙන් බැඳුනු දිවෙන සැරිසරණ සත්ත්වයන්ගේ පූර්වකෝටිය නො පෙණේ. මහණෙනි, ඒ කිමැයි හගිවු ද, මේ දිගුකල දිවෙන සැරිසරණ හිස් සුන් තොපගේ වෑහුනු වැගිරුණු යම් පමණ ලෙයෙක් වේ ද, සිවුමහසමුදුරෙහි යම් පමණ ජලයෙක්  වේද, (මෙයින්) කිමෙක් ඉතා වැඩි දැ යි?             ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 290,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“යථා ඛො මයං භන්තෙ භගවතා ධම්මං දෙසිතං ආජානාම: එතදෙව භන්තෙ, බහුතරං යං නො ඉමිනා දීඝෙන අද්ධුනා සන්ධාවතං සංසරතං සීසච්ඡින්නානං ලොහිතං පස්සන්නං පග්ඝරිතං, න ත්වෙව චතූසු මහාසමුද්දෙසු උදක”න්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සාධු සාධු භික්ඛවෙ, සාධු ඛො මෙ තුම්හෙ භික්ඛවෙ, එවං ධම්මං දෙසිතං ආජානාථ: එතදෙව භික්ඛවෙ, බහුතරං යං වො ඉමිනා දීඝෙන අද්ධුනා සන්ධාවතං සංසරතං සීසච්ඡින්නානං ලොහිතං පස්සන්නං පග්ඝරිතං, න ත්වෙව චතූසු මහාසමුද්දෙසු උදකං. දීඝරත්තං වො භික්ඛවෙ, ගුන්නං සතං ගොභූතානං සීසච්ඡින්නානං ලොහිතං පස්සන්නං පග්ඝරිතං, -පෙ- න ත්වෙව චතූසු මහාසමුද්දෙසු උදකං. දීඝරත්තං වො භික්ඛවෙ, මහිසානං{1} සතං මහිසභූතානං සීසච්ඡින්නානං ලොහිතං පස්සන්නං පග්ඝරිතං, -පෙ- න ත්වෙව චතුසු මහාසමුද්දෙසු උදකං. දීඝරත්තං වො භික්ඛවෙ, මහිසානං{1} සතං මහිසභූතානං සීසච්ඡින්නානං -පෙ- අජානං සතං අජභූතානං -පෙ- උරබ්භානං සතං උරබ්භභූතානං -පෙ- මිගානං සතං මිගභූතානං -පෙ- සූකරානං සතං සූකරභූතානං-පෙ- කුක්කුටානං සතං කුක්කුටභූතානං -පෙ- දීඝරත්තං වො භික්ඛවෙ, චොරා ගාමඝාතකාති{3} ගහෙත්වා සීසච්ඡින්නානං ලොහිතං පස්සන්නං පග්ඝරිතං -පෙ- දීඝරත්තං වො භික්ඛවෙ, චොරා පරිපන්ථකාති{4} ගහෙත්වා -පෙ- චොරා පාරදාරිකාති ගහෙත්වා සීසච්ඡින්නානං ලොහිතං පස්සන්නං පග්ඝරිතං -පෙ- න ත්වෙව චතූසු මහාසමුද්දෙසු උදකං. තං කිස්ස හෙතු? අනමතග්ගොයං භික්ඛවෙ, සංසාරො -පෙ- [යාවඤ්චිදං භික්ඛවෙ -පෙ- ] අලං විමුච්චිතුන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදමවොච භගවා. අත්තමනා තෙ භික්ඛූ භගවතො භාසිතං අභිනන්දුන්ති. ඉමස්මිං ච පන වෙය්යාකරණස්මිං භඤ්ඤමානෙ තිංසමත්තානං පාවෙය්යකානං භික්ඛූනං අනුපාදාය ආසවෙහි චිත්තානි විමුච්චිංසූති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මාතුසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "277.** සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනමතග්ගොයං භික්ඛවෙ, සංසාරො -පෙ- න සො භික්ඛවෙ, සත්තො සුලභරූපො යො න මාතාභූතපුබ්බො ඉමිනා දීඝෙන අද්ධුනා. තං කිස්ස හෙතු? අනමතග්ගොයං භික්ඛවෙ, සංසාරො. -පෙ- [එවං දීඝරත්තං වො භික්ඛවෙ, දුක්ඛං පච්චනුභූතං -පෙ- යාවඤ්චිදං භික්ඛවෙ, අලමෙව සබ්බසඞ්ඛාරෙසු නිබ්බන්දිතුං, අලං විරජ්ජතුං.]අලං විමුච්චිතුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පිතුසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "278. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනමතග්ගොයං භික්ඛවෙ, සංසාරො -පෙ- න සො භික්ඛවෙ, සත්තො සුලභරූපො යො න පිතාභූතපුබ්බො [ඉමිනා දීඝෙන අද්ධුනා. තං කිස්ස හෙතු? අනමතග්ගොයං භික්ඛවෙ, සංසාරො -පෙ- යාවඤ්චිදං භික්ඛවෙ ] -පෙ- අලං විමුච්චිතුන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. මහිංසානං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ගාමඝාතාර්ත - මඡසං. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "4. පාරිපත්ථිකාති - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "“වහන්ස, අපි භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරණ ලද ධර්මය යම් සේ දනිවු නම්, මේ දිගුකල දිවෙන සැරිසරණ හිස්සුන් අපගේ වෑහුණු වැගුරුණු යම් ලෙයෙක් වේ ද, ඒ ලෙය ම ඉතා වැඩි ය. සිවුමහ සමුදුරෙහි ජලය නො ම වැඩි ය.”",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මැනවි, මැනවි. මහණෙනි, තෙපි මා විසින් දෙශනා කරණ ලද ධර්මය මෙසේ දනිවු නම් මැනවි: මහණෙනි, මේ දිගුකල දිවෙන සැරිසරණ හිස්සුන් තොපගේ වෑහුනු වැගුරුණු යම් ලෙයක් වේ නම් මෙය ම ඉතා වැඩි ය. සිවුමහසයුරෙහි ජලය නො ම වැඩි ය. මහණෙනි, දිගුකලක් මුළුල්ලෙහි ගොජාතියෙහි ම ගොණුන් ව උපන් හිස්සුන් තොපගේ වෑහුනු වැගුරුණු ලෙය ම (ඉතා වැඩිය.) සිවුමහසයුරෙහි ජලය නො ම වැඩි ය. මහණෙනි, දිගුකලක් මුළුල්ලෙහි මහීෂ ජාතියෙහි ම මිහි ව උපන් හිස්සුන් තොපගේ ... එළු ජාතියෙහි ම එළු ව උපන් ... තිරෙළු ජාතියෙහි ම තිරෙළු ව උපන් ... මුව ජාතියේහි ම මුව ව උපන් ... හුරු ජාතියෙහි ම හුරු ව උපන් ... කුකුළු ජාතියෙහි කුකුළු ව උපන් … මහණෙනි, දිගුකලක් මුළුල්ලෙහි ගම්පහරණ සොරු යි ගෙණ හිස්සුන් තොපගේ වෑහුනු වැගුරුණු ලෙය … මහණෙනි, දිගුකලක් මුළුල්ලෙහි මං පහරණ සොරු යි ගෙණ … පරඹුන් සෙවුනා සොරු යි ගෙණ හිස්සුන් තොපගේ වෑහුණු වැගුරුණු ලෙය ම (ඉතා වැඩි ය.) සිවුමහසමුදුරෙහි ජලය නො ම වැඩි ය. ඒ කවර හෙයින යත්: මහණෙනි , මෙසසර නො පිරිසුන් කෙළවර ඇත්තේ ය ... මෙයිනුදු මහණෙනි ... මිදෙන්නට නිසි මැ යි. ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: සතුටු සිත් ඇති ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ භාෂිතය සතුටින් පිළිගත්හ. මේ ධර්මවිභාගය වදාරණු ලබන කල්හි තිස් නමක් පමණ පාවෙය්‍යක භික්‍ෂූන් ගේ සිත් උපදාන රහිත ව ආස්‍රවයන්ගෙන් මිදුනේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මාතු සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "277. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි , මෙසසර නො දන්නා ලද අවධි ඇතියේය ... මහණෙනි, මේ දිගුකල යම් සතෙක් එක් සතක්හු මවු නො වූ විරූ ද, එබඳු සතෙක් සුලබ නො වේ. ඒ කවර හෙයින යත්: මහණෙනි, මෙ සසර නො දන්නා ලද අවධි අතියේ ය ... මහණෙනි, මෙසේ දීර්ඝකාලයක් තොප විසින් දුක් වීඳින ලදී … මහණෙනි, එහෙයින් සියලු සංසකාරයන් කෙරෙහි කළකිරෙන්නට නිසිය. නො ඇලෙන්නට නිසිය. මිදෙන්නට නිසි ම ය. ",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පිතු සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "278. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මෙසසර අවිදිතාග්‍රය … මහණෙනි, මේ දිගුකල යම් සතෙක් එක්සතක්හු පිය නො වූ විරූ ද, එබඳු සතෙක් සුලබ නො වේ. ඒ කවර හෙයින යත්: මහණෙනි, මෙසසර අවිදිතාග්‍රය ... මහණෙනි, එහෙයින් මිදෙන්නට නිසි ම ය. මිදෙන්නට සුදුසු මැ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 292,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 2. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භාතුසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "279.** සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනමතග්ගොයං භික්ඛවෙ, සංසාරො න සො භික්ඛවෙ, සත්තො සුලභරූපො යො න භාතාභූතපුබ්බො [ඉමිනා දීඝෙන අද්ධුනා.] -පෙ- [යාවඤ්චිදං භික්ඛවෙ -පෙ-] අලං විමුච්චිතුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භගිනිසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "280. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනමතග්ගොයං භික්ඛවෙ, සංසාරො න සො භික්ඛවෙ, සත්තො සුලභරූපො යො න භගිනීභූතපුබ්බො [ඉමිනා දීඝෙන අද්ධුනා.] -පෙ- [යාවඤ්චිදං භික්ඛවෙ -පෙ-] අලං විමුච්චිතුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පුත්තසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "281. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනමතග්ගොයං භික්ඛවෙ, සංසාරො න සො භික්ඛවෙ, සත්තො සුලභරූපො යො න පුත්තභූතපුබ්බො{1} [ඉමිනා දීඝෙන අද්ධුනා.] -පෙ- [යාවඤ්චිදං භික්ඛවෙ -පෙ-] අලං විමුච්චිතුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ධීතුසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "282. **සාවත්ථියං-**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අනමතග්ගොයං භික්ඛවෙ, සංසාරො. පුබ්බාකොටි න පඤ්ඤායති අවිජ්ජානීවරණානං සත්තානං තණ්හාසංයොජනානං සන්ධාවතං සංසරතං. න සො භික්ඛවෙ, සත්තො සුලභරූපො යො න ධීතාභූතපුබ්බො ඉමිනා දීඝෙන අද්ධුනා. තං කිස්ස හෙතු? අනමතග්ගොයං භික්ඛවෙ, සංසාරො. පුබ්බාකොටි න පඤ්ඤායති අවිජ්ජානීවරණානං සත්තානං තණ්හාසංයොජනානං සන්ධාවතං සංසරතං. එවං දීඝරත්තං වො භික්ඛවෙ, දුක්ඛං පච්චනුභූතං, තිබ්බං පච්චනුභූතං, ව්යසනං පච්චනුභූතං, කටසි වඩ්ඪිතා. යාවඤ්චිදං භික්ඛවෙ, අලමෙව සබ්බසඞ්ඛාරෙසු නිබ්බින්දිතුං, අලං විරජ්ජිතුං, අලං විමුච්චිතුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "වෙපුල්ලපබ්බතසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "283. එකං සමයං භගවා රාජගහෙ විහරති ගිජ්ඣකූටෙ පබ්බතෙ. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි -පෙ- භගවා එතදවොච: අනමතග්ගොයං භික්ඛවෙ, සංසාරො. පුබ්බාකොටි න පඤ්ඤායති අවිජ්ජානීවරණානං සත්තානං තණ්හාසංයොජනානං සන්ධාවතං සංසරතං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පුත්තො භූතපුබ්බො - සීමු. ස්යා. සී. 1, 2."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 2. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භාතු සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "279.** සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මේ සසර අවිදිතාග්‍ර ඇතියේ ය. මහණෙනි, මේ දීර්ඝකාලයෙහි යමෙක් බෑයා නො වූ විරූ ද, එබඳු සතෙක් සුලබ නො වේ ... මෙයිනුදු මහණෙනි ... මිදෙන්නට නිසි මැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භගිනි සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "280. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මේ සසර අවිදිතාග්‍ර ඇතියේ ය ... මහණෙනි, මේ දීර්ඝකලයෙහි යමෙක් බුහුන නො වූ විරූ ද, එබඳු සතෙක් සුලබ නො වේ … මෙයිනුදු මහණෙනි ... මිදෙන්නට නිසි මැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පුත්‌ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "281.** සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මේ සසර අවිදිතාග්‍ර අතියේ ය. මහණෙනි, මේ දීර්ඝකාලයෙහි යමෙක් පුතු නො වූ වීරූ ද, එබඳු සතෙක් සුලබ නො වෙයි ... මෙයිනුදු මහණෙනි ... මිදෙන්නට නිසි මැයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ධීතු සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "282. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මෙසසර නො දන්නා ලද අග ඇතියේ ය. අවිද්‍යාවෙන් ඇවුරුණු තෘෂ්ණාවෙන් බැඳුනු දිවෙන සැරිසරණ සත්ත්වයන්ගේ පූකෙළ (පුර්වාන්තය) නො පෙණෙයි. මහණෙනි, මේ දීර්ඝකාලයෙහි දූ නො වූ වීරූ නම් එබඳු සතෙක් සුලබ නො වෙයි. ඒ කවර හෙයින යත්: මහණෙනි, මෙසසර නො දන්නා ලද අග අතියේය අවිද්‍යාවෙන් බැඳුනු තෘෂ්ණාවෙන් ඇවුරුණු දිවෙන සැරිසරණ සත්වයන්ගේ පුර්වාන්තය නො පෙණෙයි. මහණෙනි, මෙසේ තොප විසින් දිගුකලක් දුක් විදින ලදී. තියුණු දුක් විඳින ලදී. ව්‍යසන විඳින ලදී. සොහොන හෝ පොළොව වඩනලදී. මෙයිනුදු මහණෙනි, සියලු සංස්කාරයන්හි කළකිරෙන්නට නිසි ම ය. නො ඇලෙන්නට නිසි ම ය. මිදෙන්නට නිසි මැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "වෙපුල්‌ලපබ්‌බත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "283. එක් කලෙක භාග්‍යවතුන් වහන්සේ රජගහනුවර සමීපයෙහි ගිජුකුළු පව්වෙහි වැඩවසන සේක. එකල්හි භාග්‍යවතුන් වහන්සේ භික්ෂූන් ඇමතු සේක. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මහණෙනි, මෙසසර නො පිරුසුන් අග ඇත්තේ ය අවිද්‍යාවෙන් වැසුනු තෘෂ්ණාවෙන් බැඳුනු දිවෙන සැරිසරණ සත්ත්වයින්ගේ පුර්වකොටිය නො පැණේ. ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 294,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "භූතපුබ්බං භික්ඛවෙ, ඉමස්ස වෙපුල්ලස්ස පබ්බතස්ස පාචීනවංසොත්වෙව සමඤ්ඤා උදපාදි. තෙන ඛො පන භික්ඛවෙ, සමයෙන මනුස්සානං තිවරා ත්වෙව සමඤ්ඤා උදපාදි. තිවරානං භික්ඛවෙ, මනුස්සානං චත්තාළීස වස්සසහස්සානි ආයුප්පමාණං අහොසි. තිවරා භික්ඛවෙ, මනුස්සා පාචීනවංසං පබ්බතං චතුහෙන{1} ආරොහන්ති, චතුහෙන ඔරොහන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන කකුසන්ධො{2} භගවා අරහං සම්මාසම්බුද්ධො ලොකෙ උප්පන්නො හොති. කකුසන්ධස්ස භික්ඛවෙ භගවතො අරහතො සම්මාසම්බුද්ධස්ස විධුර-සඤ්ජීවං නාම සාවකයුගං අහොසි අග්ගං භද්දයුගං. පස්සථ භික්ඛවෙ, සා චෙවිමස්ස පබ්බතස්ස සමඤ්ඤා අන්තරහිතා. තෙ ච මනුස්සා කාලකතා. සො ච භගවා පරිනිබ්බුතො. එවං අනිච්චා භික්ඛවෙ සඞ්ඛාරා. එවං අද්ධුවා භික්ඛවෙ සඞ්ඛාරා. එවං අනස්සාසිකා භික්ඛවෙ සඞ්ඛාරා. යාවඤ්චිදං භික්ඛවෙ, අලමෙව සබ්බසඞ්ඛාරෙසු නිබ්බින්දිතුං, අලං විරජ්ජිතුං, අලං විමුච්චිතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "භූතපුබ්බං භික්ඛවෙ, ඉමස්ස වෙපුල්ලස්ස පබ්බතස්ස වඞ්කකො{3} ත්වෙව සමඤ්ඤා උදපාදි. තෙන ඛො පන භික්ඛවෙ, සමයෙන මනුස්සානං රොහිතස්සා ත්වෙව සමඤ්ඤා උදපාදි. රොහිතස්සානං භික්ඛවෙ, මනුස්සානං තිංසවස්සසහස්සානි ආයුප්පමාණං අහොසි. රොහිතස්සා භික්ඛවෙ, මනුස්සා වඞ්කකං පබ්බතං තීහෙන ආරොහන්ති, තීහෙන ඔරොහන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන භික්ඛවෙ, සමයෙන කොනාගමනො{4} භගවා අරහං සම්මාසම්බුද්ධො ලොකෙ උප්පන්නො හොති. කොනාගමනස්ස භික්ඛවෙ, භගවතො අරහතො සම්මාසම්බුද්ධස්ස භිය්යො සුත්තරං නාම සාවකයුගං අහොසි අග්ගං භද්දයුගං. පස්සථ භික්ඛවෙ, සා චෙවිමස්ස පබ්බතස්ස සමඤ්ඤා අන්තරහිතා. තෙ ච මනුස්සා කාලකත? සො ච භගවා පරිනිබ්බුතො. එවං අනිච්චා භික්ඛවෙ, සඞ්ඛාරා -පෙ- අලං විමුච්චිතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "භූතපුබ්බං භික්ඛවෙ, ඉමස්ස වෙපුල්ලස්ස පබ්බතස්ස සුඵස්සො ත්වෙව{5} සමඤ්ඤා උදපාදි. තෙන ඛො පන භික්ඛවෙ, සමයෙන මනුස්සානං සුප්පිය.{6} ත්වෙව සමඤ්ඤා උදපාදි. සුප්පියානං භික්ඛවෙ, මනුස්සානං වීසතිවස්සසහස්සානි ආයුප්පමාණං අහොසි. සුප්පියා භික්ඛවෙ, මනුස්සා සුඵස්සං පබ්බතං ද්වීහෙන ආරොහන්ති ද්වීහෙන ඔරොහන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන භික්ඛවෙ, සමයෙන කස්සපො භගවා අරහං සම්මාසම්බුද්ධො ලොකෙ උප්පන්නො හොති. කස්සපස්ස භික්ඛවෙ, භගවතො අරහතො සම්මාසම්බුද්ධස්ස තිස්ස-භාරද්වාජං නාම සාවකයුගං අහොසි අග්ගං භද්දයුගං. පස්සථ භික්ඛවෙ, සා චෙවිමස්ස පබ්බතස්ස සමඤ්ඤා අන්තරහිතා තෙ ච මනුස්සා කාලකතා. සො ච භගවා පරිනිබ්බුතො. එවං අනිච්චා භික්ඛවෙ, සඞ්ඛාරා -පෙ- අලං විමුච්චිතුං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. චතූහෙන - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ක්රකුච්ඡන්ද බෞද්ධ සංස්කෘත."
                    },
                    {
                        "type": "footnote",
                        "text": "3. වඞකතො - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. කොණාගමණො - අට්ඨකථා සීමු. කොනාකමුනි - කනකමුනි, බෞද්ධ සංස්කෘත"
                    },
                    {
                        "type": "footnote",
                        "text": "5. සුපස්සො - මඡසං. ස්යා. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "6. අප්පියා - සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "මහණෙනි, පෙර වූවක් කියමි: මේ වෙපුල්ල පර්වතයට පාවීනවංස ම ය යි නම් විය මහණෙනි, එකල්හි මිනිසුන්ට තිවර යන නාමය විය. මහණෙනි, තිවර මිනිසුන්ට දහස්වසෙක් ආයුඃප්‍රමාණය විය. මහණෙනි, තිවර මිනිසුන්ට පාචීනවංස පර්වතයට සිවු දිනකින් නගිත්, සිවු දිනකින් බසිත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි අර්හත් සම්‍යක්සම්බුදධ වූ කකුසඳ භාග්‍යතුන් වහන්සේ ලොව පහළ වූ සේක අර්හත් සම්‍යක්සම්බුදධ වූ කකුසඳ භාග්‍යවතුන් වහන්සේට උතුම් සොඳුරු යුවලක් වූ විධුර, සඤ්ජීව නම් සවු යුවලෙක් විය. මහණෙනි, බලවු: මේ පර්වතයේ ඒ නාමය ද අතුරුදන් විය ඒ මිනිස්සු ද කලුරිය කළහ . ඒ භාග්‍යවතුන් වහන්සේද පිරිණිවුනහ. මහණෙනි, මෙසේ සංස්කාරයෝ අනිත්‍යයහ. මහණෙනි, මෙසේ සංස්කාරයෝ අදධුවයහ. මෙසේ සංස්කාරයෝ අනස්සාසික (=අස්වැසිලි රහිත) ය හ. මහණෙනි, මෙයිනුදු සියලු සංස්කාරයන්හි කළකිරෙන්නට නිසිම ය. නො ඇලෙන්නට නිසි ම ය . මිදෙන්නට නිසි මැ යි . ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, පෙර වූවක් කියමි: මේ වෙපුල්ල පර්වතයට වඞ්කක යන නාමය ම වි ය . මහණෙනි, එකල්හි මිනිසුන්ට රෝහිතස්ස යන නාමය ම විය. මහණෙනි, රෝහිතස්ස මිනිසුන්ගේ ආයුඃප්‍රමාණය තිස්වස්දහසෙක් විය. මහණෙනි, රෝහිතස්ස මිනිස්සු වඞ්කක පර්වතයට තෙදිනකින් නගිත්. තෙදිනකින් බසිත්. ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි , එකල්හි අර්හත් සම්‍යක් සම්බුද්ධ වූ කොනාගමන භාග්‍යවතුන් වහන්සේ ලොව පහළ වූ සේක. මහණෙනි, අර්හත් සම්‍යක්සම්බුද්ධ වූ කෝනාගමන භාග්‍යවතුන් වහන්සේට අග්‍රභද්‍ර යුගයක් වූ හිය්‍යො, සුත්තර නම් සවු යුගයෙක් වීය මහණෙනි, බලවු: මේ පර්වතයාගේ ඒ නාමයන් අතුරුදන් විය ඒ මිනිස්සුත් කලුරිය කළහ ඒ භාග්‍යවතුන් වහන්සේත් පිරිණිවියහ. මහණෙනි, සංස්කාරයෝ මෙසේ අනිසහ … මිදෙන්නට නිසි මැ යි. ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, පෙර වූවක් කියමි: මේ වෙපුල්ල පර්වතයට සුඵස්ස යන නාමය ම විය. මහණෙනි, එකල්හි මිනිසුන්ට සුප්පිය යන නාමය විය. මහණෙනි, සුප්පිය මිනිසුන්ගේ ආයුඃප්‍රමාණය විසිවස්දහසෙක් සේක් විය. මහණෙනි, සුප්පිය මිනිස්සු සුඵස්ස පර්වතයට දෙදිනකින් නගිත්, දෙදිනකින් බසිත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, එසමයෙහි අර්හත් සම්‍යක්සම්බුධ වූ කාශ්‍යප භාග්‍යවතුන්වහන්සේ ලෝකයෙහි පහළ වූ සේක. මහණෙනි, අර්හත් සම්‍යක්සම්බුධ වූ කාශ්‍යප භාග්‍යවතුන් වහන්සේට අග්‍රභද්‍ර යුගයෙක් වූ තිස්ස, භාරද්වාජ නම් ශ්‍රාවක යුගයෙක් විය මහණෙනි, බලවු: මේ පර්වතයාගේ ඒ නමත් අතුරුදන් විය. ඒ මිනිස්සුත් කලුරිය කළහ. ඒ භාග්‍යවතුන් වහන්සේත් පිරිණිවියහ. මහණෙනි, සංස්කාරයෝ මෙසේ අනිසහ … මිදෙන්නට නිසි මැ යි. ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 296,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එතරහි ඛො පන භික්ඛවෙ, ඉමස්ස වෙපුල්ලස්ස පබ්බතස්ස වෙපුල්ලො ත්වෙව සමඤ්ඤා උදපාදි. එතරහි ඛො පන භික්ඛවෙ, ඉමෙසං මනුස්සානං මාගධකා ත්වෙව සමඤ්ඤා උදපාදි. මාගධකානං භික්ඛවෙ, මනුස්සානං අප්පකං ආයුප්පමාණං පරිත්තං ලහුකං.{1} යො චිරං ජීවති, සො වස්සසතං, අප්පං වා භිය්යො මාගධකා භික්ඛවෙ, මනුස්සා වෙපුල්ලං පබ්බතං මුහුත්තෙන ආරොහන්ති, මුහුත්තෙන ඔරොහන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එතරහි ඛො පනාහං භික්ඛවෙ, අරහං සම්මාසම්බුද්ධො ලොකෙ උප්පන්නො. මය්හං ඛො පන භික්ඛවෙ, සාරිපුත්තමොග්ගල්ලානං නාම සාවකයුගං අග්ගං භද්දයුගං. භවිස්සති භික්ඛවෙ, සො සමයො යා අයඤ්චෙවිමස්ස පබ්බතස්ස සමඤ්ඤා අන්තරධායිස්සති. ඉමෙ වෙ මනුස්සා කාලං කරිස්සන්ති. අහඤ්ච පරිනිබ්බායිස්සාමි. එවං අනිච්චා භික්ඛවෙ සඞ්ඛාරා, එවං අද්ධුවා භික්ඛවෙ සඞ්ඛාරා, එවං අනස්සාසිකා භික්ඛවෙ සඞ්ඛාරා. යාවඤ්චිදං භික්ඛවෙ, අලමෙව සබ්බසඞ්ඛාරෙසු නිබ්බින්දිතුං, අලං විරජ්ජිතුං, අලං විමුච්චිතුන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදමවොච භගවා. ඉදං වත්වා සුගතො අථාපරං එතදවොච සත්ථා:"
                    },
                    {
                        "type": "gatha",
                        "text": "පාචීනවංසො තිවරානං රොහිතස්සාන වඞ්කකො,\nසුප්පියානං සුඵස්සොති මාගධානඤ්ච වෙපුල්ලො."
                    },
                    {
                        "type": "gatha",
                        "text": "අනිච්චා වත සඞ්ඛාරා උප්පාදවයධම්මිනො,\nඋප්පජ්ජිත්වා නිරුජ්ඣන්ති තෙසං වූපසමො සුඛොති."
                    },
                    {
                        "type": "centered",
                        "text": "දුග්ගතවග්ගො දුතියො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තස්සුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "දුග්ගතං සුඛිතඤ්චෙව තිංස මාතාපිතෙන ච\nභාතා භගිනි පුත්තො ච ධීතා වෙපුල්ලපබ්බතං.{2}"
                    },
                    {
                        "type": "centered",
                        "text": "අනමතග්ගසංයුත්තං සමත්තං.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ලහුසං - සීමු. සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "2. වෙපුල්ලපබ්බන්ති - සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "මහණෙනි, දැන් මේ වෙපුල්ලපර්වතයට වෙපුල්ල යන නාමය ම විය. මහණෙනි, දැන් මේ මිනිසුන්ට මාගධක යන නාමය ම විය. මහණෙනි, මාගධක මිනිසුන්ගේ අයුඃප්‍රමාණය ඉතා ස්වල්ප ය, මද ය, ඉතා සුලුය යමෙක් බොහෝ කලක් ජීවත් වේ නම් හෙතෙමේ සියවසක් හෝ, ඉන් මදක් (දස - විසිවසක්) වැඩියෙන් හෝ ජීවත් වෙයි. මහණෙනි, මගධරට වැසි මිනිස්සු වෙපුල්ල පර්වතයට මොහොතකින් නගිත්. මොහොතින් බසිත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, දැන් වූ කලි අර්හත් සම්‍යක්සම්බුද්ධ වූ මම ලොකයෙහි උපන්මි. මහණෙනි, මට අගසොඳුරු යුවල වූ සැරියුත්, මුගලන් නම් සවු යුවල වේ. මහණෙනි, මේ පර්වතයාගේ යම් මේ නාමයක් වේ ද, එය අතුරුදන් වන්නේ නම්. ඒ කාලය වන්නේය. මේ මිනිස්සුත් කලුරිය කරන්නාහු ය. මමත් පිරිණිවෙන්නෙමි. මහණෙනි, සංස්කාරයෝ මෙසේ අනිසය. මහණෙනි, සංස්කාරයෝ මෙසේ අස්ථිරයහ. මහණෙනි, සංස්කාරයෝ මෙසේ අනස්සාසිකහ. මහණෙනි, මෙයිනුදු සියලු සංස්කාරයන්හි කළකිරෙන්නට නිසි ම ය. නො ඇලෙන්නට නිසි ම ය. මිදෙන්නට නිසි මැ යි. ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගත වූ ශාස්තෲන් වහන්සේ මෙය වදාරා වැලි අන් අයුරිනුදු මෙය වදාළ සේක: ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තිවරයන්ට පාචිනවංස විය. රොහිතස්සයන්ට වඞ්කක විය. සුප්පියයන්ට සුඵස්ස විය.මගධයන්ට වෙපුල්ල විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "සංස්කාරයෝ ඒකාන්තයෙන් අනිත්‍යහ. ඉපැද නැතිවන ස්වභාව ඇතියහ. ඉපැද නිරුද්ධ වෙති. ඔවුන්ගේ සංහිදීම සුව යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 11,
                        "text": "දුග්ගතවර්ගය දෙවෙනි යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 20,
                        "text": "**එහි උද්දානය:**",
                        "type": "unindented"
                    },
                    {
                        "format": 20,
                        "text": "දුග්ගත, සුඛිත, තිංස (මත්ත), මාතු, පිතු, භාතු, භගිනි, පුත්ත, ධීතු, වෙපුල්ල පබ්බත ය යි සූත්‍ර දශයෙකි යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "අනමතග්ගසංයුත්තය නිමියේ ය.",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ]
}