{
    "filename": "sn-3-10",
    "bookId": 18,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 504,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "10. ගන්ධබ්බකායසංයුත්තං",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. ගන්ධබ්බවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සුද්ධික සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**438.** සාවත්ථියං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ගන්ධබ්බකායිකෙ වො භික්ඛවෙ, දෙවෙ දෙසිස්සාමි. තං සුණාථ."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමා ච භික්ඛවෙ, ගන්ධබ්බකායිකා දෙවා? සන්ති භික්ඛවෙ, මූලගන්ධෙ අධිවත්ථා දෙවා. සන්ති භික්ඛවෙ, සාරගන්ධෙ අධිවත්ථා දෙවා. සන්ති භික්ඛවෙ, ඵෙග්ගුගන්ධෙ අධිවත්ථා දෙවා. සන්ති භික්ඛවෙ, තචගන්ධෙ අධිවත්ථා දෙවා. සන්ති භික්ඛවෙ, පපටිකාගන්ධෙ{1} අධිවත්ථා දෙවා. සන්ති භික්ඛවෙ, පත්තගන්ධෙ අධිවත්ථා දෙවා. සන්ති භික්ඛවෙ, පුප්ඵගන්ධෙ අධිවත්ථා දෙවා. සන්ති භික්ඛවෙ, ඵලගන්ධෙ අධිවත්ථා දෙවා. සන්ති භික්ඛවෙ, රසගන්ධෙ අධිවත්ථා දෙවා. සන්ති භික්ඛවෙ, ගන්ධගන්ධෙ අධිවත්ථා දෙවා. ඉමෙ වුච්චන්ති භික්ඛවෙ, ගන්ධබ්බකායිකා දෙවාති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සුචරිත සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**439. **සාවත්ථියං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච : කො නු ඛො භන්තෙ, හෙතු, කො පච්චයො, යෙනමිධෙකච්චො කායස්ස භෙදා පරම්මරණා ගන්ධබ්බකායිකානං දෙවානං සහබ්යතං උපපජ්ජතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛු, එකච්චො කායෙන සුචරිතං චරති, වාචාය සුචරිතං චරති, මනසා සුචරිතං චරති. තස්ස සුතං හොති : ‘‘ගන්ධබ්බකායිකා දෙවා දීඝායුකා වණ්ණවන්තො සුඛබහුලා’’ති. තස්ස එවං හොති : ‘‘අහො වතාහං කායස්සභෙදා පරම්මරණා ගන්ධබ්බකායිකානං දෙවානං සහබ්යතං උපපජ්ජෙය්ය’’න්ති. සො කායස්ස භෙදා පරම්මරණා ගන්ධබ්බකායිකානං දෙවානං සහබ්යතං උපපජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො භික්ඛු, හෙතු, අයං පච්චයො, යෙන මිධෙකච්චො කායස්සභෙදා පරම්මරණා ගන්ධබ්බකායිකානං දෙවානං සහබ්යතං උපපජ්ජතීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පපටිකගන්ධො - මඡසං, ස්යා, PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "10. ගන්ධබ්බ සංයුක්තය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "text": "1. ගන්‌ධබ්‌බ වර්ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සුද්‌ධික සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "**438.** සැවැත්නුවර:",
                        "type": "unindented"
                    },
                    {
                        "text": "මහණෙනි, තොපට ගන්ධබ්බකායික (ගඳට අරක් ගත්) දෙවියන් දේශනා කරන්නෙමි. එය අසව්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ගන්ධබ්බකායික දෙවියෝ කවරහු ද යත්: මහණෙනි මුල්ගඳෙහි අරක්ගත් දෙවියෝ ඇතියහ, හරගඳෙහි අරක්ගත් දෙවියෝ ඇතියහ, ඵලගඳෙහි අරක්ගත් දෙවියෝ ඇතියහ, සිවිගඳෙහි අරක්ගත් දෙවියෝ ඇතියහ, පොතුගඳෙහි අරක්ගත් දෙවියෝ ඇතියහ, පත්ගඳෙහි අරක්ගත් දෙවියෝ ඇතියහ, මල්ගඳෙහි අරක්ගත් දෙවියෝ ඇතියහ, පලගඳෙහි අරක්ගත් දෙවියෝ ඇතියහ, රසගඳෙහි අරක්ගත් දෙවියෝ ඇතියහ, ගඳ ගඳෙහි අරක්ගත් දෙවියෝ ඇතියහ. මහණෙනි, මොහු ගන්ධබ්බකායික දෙවියෝ ය යි කියනු ලැබෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සුචරිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "**439.** සැවැත්නුවර:",
                        "type": "unindented"
                    },
                    {
                        "text": "එකත්පස් ව හුන් ඒ මහණ භාග්‍යවතුන් වහන්සේට තෙල සැල කෙළේ යැ: වහන්ස, යම් හෙයකින් මෙහි එකෙක් කාබුන් මරණින් මතු ගන්ධබ්බකායික දෙවියන්ගේ සහභාවයට පැමිණේ නම් එයට හේතු ද, කිමෙක් ප්‍රත්‍යය දැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, මෙහි එකෙක් කයින් සුසිරිත් කෙරෙයි, වදනින් සුසිරිත් කෙරෙයි, මනසින් සුසිරිත් කෙරෙයි. ඔහු විසින් “ගන්ධබ්බකායික දෙවියෝ දීර්ඝායුෂ්කයහ, වර්ණවත්හ, සුඛබහුලහ”යි අසන ලද්දේත් වෙයි. (එහෙයින්) ඔහුට මෙ බඳු සිතෙක් වෙයි: “මම කාබුන් මරණින් මතු ගන්ධබ්බකායික දෙවියන්ගේ සහභාවයට පැමිණෙන්නේම් නම් ඉතා මැනැවැ”යි, හේ කාබුන් මරණින් මතු ගන්ධබ්බකායික දෙවියන්ගේ සහභාවයට පැමිණේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, යම් හෙයකින් මෙහි එකෙක් කාබුන් මරණින් මතු ගන්ධබ්බකායික දෙවියන්ගේ සහභාවයට පැමිණේ නම් එයට හේතු යි, මේ ප්‍රත්‍යය යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 506,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 1. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මූලගන්ධ සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**440.** සාවත්ථියං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච : කො නු ඛො භන්තෙ, හෙතු, කො පච්චයො, යෙනමිධෙකච්චො කායස්ස භෙදා පරම්මරණා මූලගන්ධෙ අධිවත්ථානං දෙවානං සහබ්යතං උපපජ්ජතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛු, එකච්චො කායෙන සුචරිතං චරති, වාචාය සුචරිතං චරති, මනසා සුචරිතං චරති. තස්ස සුතං හොති : ‘‘මූලගන්ධෙ අධිවත්ථා දෙවා දීඝායුකා වණ්ණවන්තො සුඛබහුලා’’ති. තස්ස එවං හොති : ‘‘අහො වතාහං කායස්ස භෙදා පරම්මරණා මූලගන්ධෙ අධිවත්ථානං දෙවානං සහබ්යතං උපපජ්ජෙය්ය’’න්ති. සො දාතා හොති මූලගන්ධානං. සො කායස්ස භෙදා පරම්මරණා මූලගන්ධෙ අධිවත්ථානං දෙවානං සහබ්යතං උපපජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො භික්ඛු, හෙතු අයං පච්චයො යෙනමිධෙකච්චො කායස්ස භෙදා පරම්මරණා මූලගන්ධෙ අධිවත්ථානං දෙවානං සහබ්යතං උපපජ්ජතීති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 4 – 12.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සාරගන්ධාදි සුත්තානි",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**441 – 449.** සාවත්ථියං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච : කො නු ඛො භන්තෙ, හෙතු, කො පච්චයො, යෙනමිධෙකච්චො කායස්ස භෙදා පරම්මරණා සාරගන්ධෙ අධිවත්ථානං දෙවානං සහබ්යතං උපපජ්ජතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛු එකච්චො කායෙන සුචරිතං චරති, වාචාය සුචරිතං චරති, මනසා සුචරිතං චරති. තස්ස සුතං හොති : ‘‘සාරගන්ධෙ අධිවත්ථා දෙවා දීඝායුකා වණ්ණවන්තො සුඛබහුලා’’ති. තස්ස එවං හොති : ‘‘අහො වතාහං කායස්ස භෙදා පරම්මරණා සාරගන්ධෙ අධිවත්ථානං දෙවානං සහව්යතං උපපජ්ජෙය්ය’’න්ති. සො දාතා හොති සාරගන්ධානං -පෙ- සො දාතා හොති ඵෙග්ගුගන්ධානං -පෙ- සො දාතා හොති තචගන්ධානං -පෙ- සො දාතා හොති පපටිකගන්ධානං -පෙ- සො දාතා හොති පත්තගන්ධානං -පෙ- සො දාතා හොති පුප්ඵගන්ධානං -පෙ- සො දාතා හොති ඵලගන්ධානං -පෙ- සො දාතා හොති රසගන්ධානං -පෙ- සො දාතා හොති ගන්ධගන්ධානං. සො කායස්ස භෙදා පරම්මරණා ගන්ධගන්ධෙ අධිවත්ථානං දෙවානං සහව්යතං උපපජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො භික්ඛු, හෙතු, අයං පච්චයො, යෙනමිධෙකච්චො, කායස්ස භෙදා පරම්මරණා ගන්ධගන්ධෙ අධිවත්ථානං දෙවානං සහව්යතං උපපජ්ජතීති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 1. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මූලගන්‌ධ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "**440.** සැවැත්නුවර:",
                        "type": "unindented"
                    },
                    {
                        "text": "එකත්පස් ව හුන් ඒ මහණ භාග්‍යවතුන් වහන්සේට තෙල සැල කෙළේ යැ: වහන්ස, යම් හෙයකින් මෙහි එකෙක් කාබුන් මරණින් මතු මුල්ගඳෙහි අරග්ගත් දෙවියන්ගේ සහභාවයට පැමිණේ නම් එයට හේතු ද, කිමෙක් ප්‍රත්‍යය දැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, මෙහි එකෙක් කයින් සුසිරිත් කෙරෙයි, වදනින් සුසිරිත් කෙරෙයි, මනසින් සුසිරිත් කෙරෙයි. “මුල්ගඳෙහි අරග්ගත් දෙවියෝ දීර්ඝායුෂ්කයහ, වර්ණවත්හ, සුඛබහුලහ”යි ඔහු විසින් අසන ලද්දේත් වෙයි. (එහෙයින්) ඔහුට මෙ බඳු සිතෙක් වේ: “මම කාබුන් මරණින් මතු මුල්ගඳෙහි අරග්ගත් දෙවියන්ගේ සහභාවයට පැමිණෙන්නේම් නම් ඉතා මැනැවැ” යි. හෙ මුල්ගඳ (පරිත්‍යාග වශයෙන්) දෙන්නේ වේ. හෙ කාබුන් මරණින් මතු මුල්ගඳෙහි අරග්ගත් දෙවියන්ගේ සහභාවයට පැමිණේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, යම් හෙයකින් මෙහි එකෙක් කාබුන් මරණින් මතු මුල්ගඳෙහි අරග්ගත් දෙවියන්ගේ සහභාවයට පැමිණේ නම් එයට හේතු යි, මේ ප්‍රත්‍යය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 4 - 12",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සාරගන්‌ධාදි සූත්‍ර",
                        "level": 1
                    },
                    {
                        "text": "**441 - 449. **සැවැත්නුවර:",
                        "type": "unindented"
                    },
                    {
                        "text": "එකත්පස් ව හුන් ඒ මහණ භාග්‍යවතුන් වහන්සේට තෙල සැල කෙළේ යැ: වහන්ස, යම් හෙයකින් මෙහි එකෙක් කාබුන් මරණින් මතු හරගඳෙහි අරක්ගත් දෙවියන්ගේ සහභාවයට පැමිණේ නම් එයට හේතු ද, කිමෙක් ප්‍රත්‍යය දැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, මෙහි එකෙක් කයින් සුසිරිත් කෙරෙයි, වදනින් සුසිරිත් කෙරෙයි, සිතින් සුසිරිත් කෙරෙයි. “හරගඳෙහි අරග්ගත් දෙවියෝ දීර්ඝායුෂ්කයහ, වර්ණවත්හ, සුඛබහුලහ”යි ඔහු විසින් අසන ලද්දේත් වෙයි. (එහෙයින්) ඔහුට “මම කාබුන් මරණින් මතු හරගඳෙහි අරග්ගත් දෙවියන්ගේ සහභාවයට පැමිණෙන්නෙම් නම් ඉතා මැනැවැ”යි මෙ බඳු සිතෙක් වෙයි. හෙ හරගඳ දෙන්නේ වේ. ... හෙ ඵලගඳ දෙන්නේ වේ. ... හෙ සිවිගඳ දෙන්නේ වේ. ... හෙ පොතුගඳ දෙන්නේ වේ. ... හෙ පත්ගඳ දෙන්නේ වේ. ... හෙ මල්ගඳ දෙන්නේ වේ. ... හෙ පලගඳ දෙන්නේ වේ. ... හෙ රසගඳ දෙන්නේ වේ. ... හෙ ගඳගඳ දෙන්නේ වේ. හෙ කාබුන් මරණින් මතු ගඳගඳෙහි අරක්ගත් දෙවියන්ගේ සහභාවයට පැමිණේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, යම් හෙයකින් මෙහි එකෙක් කාබුන් මරණින් මතු ගඳගඳෙහි අරග්ගත් දෙවියන්ගේ සහභාවයට පැමිණේ නම් එයට හේතු යි, මේ ප්‍රත්‍යය යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 508,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 1. 13 – 22.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අන්නදානාදි මූලගන්ධ සුත්තානි",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**450 – 459.** සාවත්ථියං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච : කො නු ඛො භන්තෙ, හෙතු, කො පච්චයො, යෙනමිධෙකච්චො කායස්ස භෙදා පරම්මරණා මූලගන්ධෙ අධිවත්ථානං දෙවානං සහව්යතං උපපජ්ජතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛු, එකච්චො කායෙන සුචරිතං චරති. වාචාය සුචරිතං චරති. මනසා සුචරිතං චරති. තස්ස සුතං හොති : ‘‘මූලගන්ධෙ අධිවත්ථා දෙවා දීඝායුකා වණ්ණවන්තො සුඛබහුලාති’."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්ස එවං හොති : ‘‘අහො වතාහං කායස්ස භෙදා පරම්මරණා මූලගන්ධෙ අධිවත්ථානං දෙවානං සහව්යතං උපපජ්ජෙය්ය’’න්ති. සො අන්නං දෙති -පෙ- සො පානං දෙති -පෙ- සො වත්ථං දෙති -පෙ- සො යානං දෙති -පෙ- සො මාලං දෙති -පෙ- සො ගන්ධං දෙති -පෙ- සො විලෙපනං දෙති -පෙ- සො සෙය්යං දෙති -පෙ- සො ආවසථං දෙති -පෙ- සො පදීපෙය්යං දෙති. සො කායස්ස භෙදා පරම්මරණා මූලගන්ධෙ අධිවත්ථානං දෙවානං සහව්යතං උපපජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො භික්ඛු හෙතු, අයං පච්චයො, යෙනමිධෙකච්චො කායස්ස භෙදා පරම්මරණා මූලගන්ධෙ අධිවත්ථානං දෙවානං සහව්යතං උපපජ්ජතීති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 23 – 112",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අනනදානාදි සාරගන්ධාදි සුත්තානි",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**460 - 549.** සාවත්ථියං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච : කො නු ඛො භන්තෙ, හෙතු, කො පච්චයො, යෙනමිධෙකච්චො කායස්ස භෙදා පරම්මරණා සාරගන්ධෙ අධිවත්ථානං දෙවානං සහව්යතං උප්පජ්ජති. -පෙ- ඵෙග්ගුගන්ධෙ අධිවත්ථානං දෙවානං -පෙ- තචගන්ධෙ අධිවත්ථානං දෙවානං -පෙ- පපටිකාගන්ධෙ අධිවත්ථානං දෙවානං -පෙ- පත්තගන්ධෙ අධිවත්ථානං දෙවානං -පෙ- පුප්ඵගන්ධෙ අධිවත්ථානං දෙවානං -පෙ- ඵලගන්ධෙ අධිවත්ථානං දෙවානං -පෙ- රසගන්ධෙ අධිවත්ථානං දෙවානං -පෙ- ගන්ධගන්ධෙ අධිවත්ථානං දෙවානං සහව්යතං උපපජ්ජතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛු, එකච්චො කායෙන සුචරිතං චරති, වාචාය සුචරිතං චරති, මනසා සුචරිතං චරති. තස්ස සුතං හොති : ‘‘ගන්ධගන්ධෙ අධිවත්ථා දෙවා දීඝායුකා වණ්ණවන්තො සුඛබහුලා’’ති. තස්ස එවං හොති. ‘‘අහො වතාහං කායස්ස භෙදා පරම්මරණා ගන්ධගන්ධෙ"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 1. 13 - 22",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අන්නදානාදි මූලගන්‌ධ සූත්‍ර",
                        "level": 1
                    },
                    {
                        "text": "**450-459. **සැවැත්නුවර:",
                        "type": "unindented"
                    },
                    {
                        "text": "එකත්පස් වැ හුන් ඒ මහණ, භාග්‍යවතුන් වහන්සේට තෙල සැල කෙළේ යැ: “වහන්ස, යම් හෙයකින් මෙහි එකෙක් කාබුන් මරණින් මතු මුල්ගඳෙහි අරක්ගත් දෙවියන්ගේ සහභාවයට පැමිණේ නම් එයට හේතු ද, කිමෙක් ප්‍රත්‍යය දැ” යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, මෙහි එකෙක් කයින් සුසිරිත් කෙරෙයි, වදනින් සුසිරිත් කෙරෙයි, මනසින් සුසිරිත් කෙරෙයි. මුල්ගඳෙහි අරක්ගත් දෙවියෝ දීර්ඝායුෂ්කයහ, වර්ණවත්හ, සුඛබහුලහ යි ඔහු විසින් අසන ලද්දේත් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඔහුට “මම කාබුන් මරණින් මතු මුල්ගඳෙහි අරක්ගත් දෙවියන්ගේ සහභාවයට පැමිණෙන්නේම් නම් ඉතා මැනැවැ”යි මෙබඳු සිතෙක් වෙයි. හේ අහර දෙයි. ... හේ බොන දෑ දෙයි. ... හේ වස්ත්‍ර දෙයි. ... හේ වහන් (යාන) දෙයි. ... හේ මල් දෙයි. ... හේ ගඳ දෙයි. ... හේ විලවුන් දෙයි. ... හේ සෙනසුන් දෙයි. ... හේ වෙසෙන තැන් දෙයි. ... හේ පහන් උපකරණ දෙයි. හෙ කාබුන් මරණින් මතු මුල්ගඳෙහි අරක්ගත් දෙවියන්ගේ සහභාවයට පැමිණේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, යම් හෙයකින් මෙහි එකෙක් කාබුන් මරණින් මතු මුල්ගඳෙහි අරක්ගත් දෙවියන්ගේ සහභාවයට පැමිණේ නම් මේ එයට හේතු යි, මේ ප්‍රත්‍යය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 23 - 112",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අන්නදානාදි මූලගන්‌ධ සූත්‍ර",
                        "level": 1
                    },
                    {
                        "text": "**460 - 549. **සැවැත්නුවර:",
                        "type": "unindented"
                    },
                    {
                        "text": "එකත්පස් ව හුන් මහණ, භාග්‍යවතුන් වහන්සේට තෙල සැල කෙළේ යැ: “වහන්ස, යම් හෙයකින් මෙහි එකෙක් කාබුන් මරණින් මතු හරගඳෙහි අරක්ගත් දෙවියන්ගේ සහභාවයට පැමිණේ නම් ... ඵල ගඳෙහි අරක්ගත් දෙවියන්ගේ ... සිවි ගඳෙහි අරක්ගත් දෙවියන්ගේ ... පොතු ගඳෙහි අරක්ගත් දෙවියන්ගේ ... පත් ගඳෙහි අරක්ගත් දෙවියන්ගේ ... මල් ගඳෙහි අරක්ගත් දෙවියන්ගේ ... පල ගඳෙහි අරක්ගත් දෙවියන්ගේ ... රස ගඳෙහි අරක්ගත් දෙවියන්ගේ ... ගඳ ගඳෙහි අරක්ගත් දෙවියන්ගේ සහභාවයට පැමිණේ නම් එයට හේතු ද, කිමෙක් ප්‍රත්‍යය දැ” යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, මෙහි එකෙක් කයින් සුසිරිත් කෙරෙයි, වදනින් සුසිරිත් කෙරෙයි, මනසින් සුසිරිත් කෙරෙයි, ඔහු විසින් “ගඳ අරක්ගත් දෙවියෝ දීර්ඝායුෂ්කයහ, වර්ණවත්හ, සුඛබහුලහ” යි අසන ලද්දේත් වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 510,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අධිවත්ථානං දෙවානං සහව්යතං උපපජ්ජෙය්ය’’න්ති. සො අන්නං දෙති -පෙ- සො පානං දෙති -පෙ- සො වත්ථං දෙති -පෙ- සො යානං දෙති -පෙ- සො මාලං දෙති -පෙ- සො ගන්ධං දෙති -පෙ- සො විලෙපනං දෙති -පෙ- සො සෙය්යං දෙති -පෙ- සො ආවසථං දෙති -පෙ- සො පදීපෙය්යං දෙති. සො කායස්ස භෙදා පරම්මරණා ගන්ධගන්ධෙ අධිවත්ථානං දෙවානං සහව්යතං උපපජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො භික්ඛු, හෙතු, අයං පච්චයො, යෙනමිධෙකච්චො කායස්ස භෙදා පරම්මරණා ගන්ධගන්ධෙ අධිවත්ථානං දෙවානං සහව්යතං උපපජ්ජතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "(එවං පිණ්ඩකෙන එකසතඤ්ච බාරස ච සුත්තන්තා භවන්ති.)"
                    },
                    {
                        "type": "centered",
                        "text": "ගන්ධබ්බවග්ගො පඨමො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රැද්දානං :**"
                    },
                    {
                        "type": "gatha",
                        "text": "සුද්ධිකඤ්ච සුචරිතං දාතා හි අපරෙ දස,\nදානූපකාරා දසධා ගන්ධබ්බෙකසතං ද්වාදසාති.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "ගන්ධබ්බකායසංයුත්තං සමත්තං.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "(එහෙයින්) ඔහුට “මම කාබුන් මරණින් මතු ගඳ ගඳෙහි අරක්ගත් දෙවියන්ගේ සහභාවයට පැමිණෙන්නෙම් නම් ඉතා මැනැවැ”යි මෙබඳු සිතෙක් වෙයි. හේ අහර දෙයි. ... හේ බොන දෑ දෙයි. ... හේ වස්ත්‍ර දෙයි. ... හේ වහන් (වාහන) දෙයි. ... හේ මල් දෙයි. ... හේ ගඳ දෙයි. ... හේ විලවුන් දෙයි. ... හේ සෙනසුන් දෙයි. ... හේ වාසස්ථාන දෙයි. ... හේ පහන් උපකරණ දෙයි. හෙ කාබුන් මරණින් මතු ගඳගඳෙහි අරක්ගත් දෙවියන්ගේ සහභාවයට පැමිණේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, යම් හෙයකින් මෙහි එකෙක් කාබුන් මරණින් මතු ගඳගඳෙහි අරක්ගත් දෙවියන්ගේ සහභාවයට පැමිණේ නම් එයට හේතු යි, මේ ප්‍රත්‍යය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "(මෙසේ පිඬුවශයෙන් එක්සිය දොළසෙක් සූත්‍ර වෙයි.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "පළමුවැනි ගන්ධබ්බ වර්ගයි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි සූත්‍ර නාමාවලිය :**",
                        "type": "unindented"
                    },
                    {
                        "text": "සුද්ධික සූත්‍රය ද, සුචරිත සූත්‍රය ද, අනෙක් අන්නදායකාදි සූත්‍ර දශය ද, දානූපකාර සූත්‍ර දශක දශය දැ යි ගන්ධබ්බ වර්ගයෙහි සූත්‍ර එක්සිය දොළසෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ගන්ධබ්බකාය සංයුත්තය නිමියේ ය.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ]
}