[
    {
        "filename": "sn-kdkv-4",
        "bookId": 18,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "442"
            },
            {
                "type": "heading",
                "text": "4. ඔක්කන්තිසංයුත්තං",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. චක්ඛුවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "4. 1. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "චක්ඛු සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "302. **සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "චක්ඛුං භික්ඛවෙ, අනිච්චං විපරිනාමි{1 විපරිණමිං - සීමු සී 2, විපරිණමී - PTS.} අඤ්ඤථාභාවී, සොතං අනිච්චං විපරිනාමි අඤ්ඤථාභාවි, ඝානං අනිච්චං විපරිනාමි අඤ්ඤථාභාවි, ජිව්හා අනිච්චා විපරිනාමී අඤ්ඤථාභාවී, කායො අනිච්චො විපරිනාමී අඤ්ඤථාභාවී, මනො අනිච්චො විපරිනාමී අඤ්ඤථාභාවී."
            },
            {
                "type": "paragraph",
                "text": "යො භික්ඛවෙ, ඉමෙ ධම්මෙ එවං සද්දහති අධිමුච්චති, අයං වුච්චති සද්ධානුසාරී ඔක්කන්තො සම්මත්තනියාමං සප්පුරිසභූමිං ඔක්කන්තො වීතිවත්තො පුථුජ්ජනභූමිං, අභබ්බො තං කම්මං කාතුං යං කම්මං කත්වා නිරයං වා තිරච්ඡානයොනිං වා පෙත්තිවිසයං වා උපපජ්ජෙය්ය. අභබ්බො ච{2 අභබ්බො ච - මඡසං.} තාව කාලං කාතුං යාව න සොතාපත්තිඵලං සච්ඡිකරොති."
            },
            {
                "type": "paragraph",
                "text": "යස්ස ඛො භික්ඛවෙ, ඉමෙ ධම්මා එවං පඤ්ඤාය මත්තසො නිජ්ඣානං ඛමන්ති, අයං වුච්චති ධම්මානුසාරී ඔක්කන්තො සම්මත්තනියාමං සප්පුරිසභූමිං ඔක්කන්තො වීතිවත්තො පුථුජ්ජනභූමිං. අභබ්බො තං කම්මං කාතුං යං කම්මං කත්වා නිරයං වා තිරච්ඡානයොනිං වා පෙත්තිවිසයං වා උපපජ්ජෙය්ය, අභබ්බො ච තාව කාලං කාතුං යාව න සොතාපත්තිඵලං සච්ඡිකරොති."
            },
            {
                "type": "paragraph",
                "text": "යො භික්ඛවෙ, ඉමෙ ධම්මෙ එවං ජානාති{3 පජානාති - මඡසං.} එවං පස්සති, අයං වුච්චති සොතාපන්නො අවිනිපාතධම්මො නියතො සම්බොධිපරායනොති."
            },
            {
                "type": "centered",
                "text": "4. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "රූප සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "303. **සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "රූපා භික්ඛවෙ, අනිච්චා විපරිනාමිනො අඤ්ඤථාභාවිනො, සද්දා අනිච්චා විපරිනාමිනො අඤ්ඤථාභාවිනො, ගන්ධා අනිච්චා විපරිනාමිනො අඤ්ඤථාභාවිනො, රසා අනිච්චා විපරිනාමිනො අඤ්ඤථාභාවිනො, ඵොට්ඨබ්බා අනිච්චා විපරිනාමිනො අඤ්ඤථාභාවිනො, ධම්මා අනිච්චා විපරිනාමිනො අඤ්ඤථාභාවිනො."
            },
            {
                "type": "page-break",
                "text": "444"
            },
            {
                "type": "paragraph",
                "text": "යො භික්ඛවෙ, ඉමෙ ධම්මෙ එවං සද්දහති අධිමුච්චති, අයං වුච්චති සද්ධානුසාරී -පෙ- අයං වුච්චති ධම්මානුසාරී ඔක්කන්තො සම්මත්තනියාමං, සප්පුරිසභූමිං ඔක්කන්තො, වීතිවත්තො පුථුජ්ජනභූමිං. අභබ්බො තං කම්මං කාතුං යං කම්මං කත්වා නිරයං වා තිරච්ඡානයොනිං වා පෙත්තිවිසයං වා උපපජ්ජෙය්ය, අභබ්බොච තාව කාලං කාතුං යාව න සොතාපත්තිඵලං සච්ඡිකරොති."
            },
            {
                "type": "paragraph",
                "text": "යො භික්ඛවෙ, ඉමෙ ධම්මෙ එවං ජානාති පස්සති, අයං වුච්චති. සොතාපන්නො අවිනිපාතධම්මො නියතො සම්බොධිපරායනොති."
            },
            {
                "type": "centered",
                "text": "4. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "විඤ්ඤාණ සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "304. **සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "චක්ඛුවිඤ්ඤාණං භික්ඛවෙ, අනිච්චං විපරිනාමි අඤ්ඤථාභාවි. සොතවිඤ්ඤාණං අනිච්චං විපරිනාමි අඤ්ඤථාභාවි. ඝානවිඤ්ඤාණං අනිච්චං විපරිනාමි අඤ්ඤථාභාවි. ජිව්හාවිඤ්ඤාණං අනිච්චං විපරිනාමි අඤ්ඤථාභාවි. කායවිඤ්ඤාණං අනිච්චං විපරිනාමි අඤ්ඤථාභාවි. මනොවිඤ්ඤාණං අනිච්චං විපරිනාමි අඤ්ඤථාභාවි."
            },
            {
                "type": "paragraph",
                "text": "යො භික්ඛවෙ, ඉමෙ ධම්මෙ එවං සද්දහති අධිමුච්චති අයං වුච්චති සද්ධානුසාරී -පෙ-සම්බොධිපරායනොති."
            },
            {
                "type": "centered",
                "text": "4. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඵස්ස සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "305. **සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "චක්ඛුසම්ඵස්සො භික්ඛවෙ, අනිච්චො විපරිනාමී අඤ්ඤථාභාවී. සොතසම්ඵස්සො -පෙ- ඝානසම්ඵස්සො -පෙ- ජිව්හාසම්ඵස්සො -පෙ- කායසම්ඵස්සො -පෙ- මනොසම්ඵස්සො අනිච්චො විපරිනාමී අඤ්ඤථාභාවී. යො භික්ඛවෙ, ඉමෙ ධම්මෙ එවං සද්දහති -පෙ- සම්බොධිපරායනොති."
            },
            {
                "type": "centered",
                "text": "4. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "වෙදනා සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "306. **සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "චක්ඛුසම්ඵස්සජා වෙදනා භික්ඛවෙ, අනිච්චා විපරිනාමී අඤ්ඤථාභාවී. සොතසම්ඵස්සජා වෙදනා -පෙ- ඝානසම්ඵස්සජා වෙදනා -පෙ- ජිව්හාසම්ඵස්සජා වෙදනා -පෙ- කායසම්ඵස්සජා වෙදනා -පෙ- මනොසම්ඵස්සජා වෙදනා අනිච්චා විපරිනාමී අඤ්ඤථාභාවී. යො භික්ඛවෙ, ඉමෙ ධම්මෙ -පෙ- සම්බොධිපරායනොති."
            },
            {
                "type": "page-break",
                "text": "446"
            },
            {
                "type": "centered",
                "text": "4. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සඤ්ඤා සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "307. **සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "රූපසඤ්ඤා භික්ඛවෙ, අනිච්චා විපරිනාමී අඤ්ඤථාභාවී. සද්දසඤ්ඤා -පෙ- ගන්ධසඤ්ඤා -පෙ- රසසඤ්ඤා -පෙ- ඵොට්ඨබ්බසඤ්ඤා -පෙ- ධම්මසඤ්ඤා අනිච්චා විපරිනාමී අඤ්ඤථාභාවී. යො භික්ඛවෙ, ඉමෙ ධම්මෙ -පෙ- සම්බොධිපරායනොති."
            },
            {
                "type": "centered",
                "text": "4. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "චෙතනා සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "308. **සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "රූපසඤ්චෙතනා භික්ඛවෙ, අනිච්චා විපරිනාමී අඤ්ඤථාභාවී. සද්දසඤ්චෙතනා -පෙ- ගන්ධසඤ්චෙතනා -පෙ- රසසඤ්චෙතනා -පෙ- ඵොට්ඨබ්බසඤ්චෙතනා -පෙ- ධම්මසඤ්චෙතනා අනිච්චා විපරිනාමී අඤ්ඤථාභාවී. යො භික්ඛවෙ, ඉමෙ ධම්මෙ -පෙ- සම්බොධිපරායනොති."
            },
            {
                "type": "centered",
                "text": "4. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තණ්හා සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "309. **සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "රූපතණ්හා භික්ඛවෙ, අනිච්චා විපරිනාමී අඤ්ඤථාභාවී. සද්දතණ්හා -පෙ- ගන්ධතණ්හා -පෙ- රසතණ්හා -පෙ- ඵොට්ඨබ්බතණ්හා -පෙ- ධම්මතණ්හා අනිච්චා විපරිනාමී අඤ්ඤථාභාවී. යො භික්ඛවෙ, ඉමෙ ධම්මෙ -පෙ- සම්බොධිපරායණොති."
            },
            {
                "type": "centered",
                "text": "4. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ධාතු සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "310.** සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "පඨවීධාතු භික්ඛවෙ, අනිච්චා විපරිනාමී අඤ්ඤථාභාවී. ආපොධාතු -පෙ- තෙජොධාතු -පෙ- වායොධාතු -පෙ- ආකාසධාතු -පෙ- විඤ්ඤාණධාතු අනිච්චා විපරිනාමී අඤ්ඤථාභාවී. යො භික්ඛවෙ, ඉමෙ ධම්මෙ -පෙ- සම්බොධිපරායනොති."
            },
            {
                "type": "page-break",
                "text": "448"
            },
            {
                "type": "centered",
                "text": "4. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඛන්ධ සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "311. **සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "රූපං භික්ඛවෙ, අනිච්චං විපරිනාමී අඤ්ඤථාභාවී."
            },
            {
                "type": "paragraph",
                "text": "වෙදනා අනිච්චා විපරිනාමී අඤ්ඤථාභාවී. සඤ්ඤා අනිච්චා විපරිනාමී අඤ්ඤථාභාවී. සඞ්ඛාරා අනිච්චා විපරිනාමී අඤ්ඤථාභාවී. විඤ්ඤාණං අනිච්චං විපරිණාමි අඤ්ඤථාභාවි."
            },
            {
                "type": "paragraph",
                "text": "යො භික්ඛවෙ, ඉමෙ ධම්මෙ එවං සද්දහති අධිමුච්චති අයං වුච්චති සද්ධානුසාරී ඔක්කන්තො සම්මත්තනියාමං, සප්පුරිසභූමිං ඔක්කන්තො, වීතිවත්තො පුථුජ්ජනභූමිං, අභබ්බො තං කම්මං කාතුං, යං කම්මං කත්වා නිරයං වා තිරච්ඡානයොනිං{1 තිරච්ඡානයොනියං - සී1, 2.} වා පෙත්තිවිසයං වා උපපජ්ජෙය්ය, අභබ්බො ච තාව කාලං කාතුං යාව න සොතාපත්තිඵලං සච්ඡිකරොති."
            },
            {
                "type": "paragraph",
                "text": "යස්ස ඛො භික්ඛවෙ, ඉමෙ ධම්මා එවං පඤ්ඤාය මත්තසො නිජ්ඣානං ඛමන්ති, අයං වුච්චති ධම්මානුසාරී ඔක්කන්තො සම්මත්තනියාමං, සප්පුරිසභූමිං ඔක්කන්තො, වීතිවත්තො පුථුජ්ජනභූමිං, අභබ්බො තං කම්මං කාතුං යං කම්මං කත්වා නිරයං වා තිරච්ඡානයොනිං වා පෙත්තිවිසයං වා උපපජ්ජෙය්ය, අභබ්බොච තාව කාලං කාතුං යාව න සොතාපත්තිඵලං සච්ඡිකරොති."
            },
            {
                "type": "paragraph",
                "text": "යො භික්ඛවෙ, ඉමෙ ධම්මෙ එවං ජානාති, එවං පස්සති, අයං වුච්චති සොතාපන්නො අවිනිපාතධම්මො නියතො සම්බොධිපරායනොති."
            },
            {
                "type": "centered",
                "text": "චක්ඛුවග්ගො පඨමො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "චක්ඛු රූපඤ්ච විඤ්ඤාණං ඵස්සො ච වෙදනාය ච,\nසඤ්ඤා ච චෙතනා තණ්හා ධාතුක්ඛන්ධෙන දසාති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "ඔක්කන්තිකසංයුත්තං නිට්ඨිතං.",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ],
        "pages": {
            "442": {
                "pageNum": 442,
                "footnotesCount": 3
            },
            "444": {
                "pageNum": 444,
                "footnotesCount": 0
            },
            "446": {
                "pageNum": 446,
                "footnotesCount": 0
            },
            "448": {
                "pageNum": 448,
                "footnotesCount": 1
            }
        }
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "443"
            },
            {
                "text": "4. ඔක්කන්ති සංයුක්තය",
                "type": "heading",
                "level": 3
            },
            {
                "text": "1. චක්ඛු වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "4. 1. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "චක්‌ඛු සූත්‍රය",
                "level": "1"
            },
            {
                "text": "302. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "මහණෙනි, ඇස අනිත්‍ය යැ, පෙරැළෙනසුලු යැ, අන්පරිදි වනසුලු යැ. කන අනිත්‍ය යැ, පෙරැළෙනසුලුයැ, අන්පරිදි වනසුලු යැ. නැහැය අනිත්‍ය යැ, පෙරැළෙනසුලු යැ, අන්පරිදි වනසුලු යැ. දිව අනිත්‍ය යැ, පෙරැළෙනසුලු යැ, අන්පරිදි වනසුලු යැ. කය අනිත්‍ය යැ, පෙරැළෙනසුලු යැ, අන්පරිදි වනසුලු යැ. මනස අනිත්‍ය යැ, පෙරැළෙන සුලු යැ, අන්පරිදි වනසුලු යැ. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යමෙක් මේ දහමුන් මෙසෙයින් හදහයි ද, විමොක්ෂය පිළිලබයි ද, මේ පුද්ගල ‘සද්ධානුසාරී’යි කියනු ලැබෙයි. (හෙ) ආර්යමාර්ගයට පිවිසියේ යැ. සත්පුරුෂ භූමියට බැස ගත්තේ යැ, පෘථග්ජන භූමිය ඉක්මැ වූයේ යැ. යම් කර්මයක් කොට නිරයට වේවයි, තිරිසන් යෝනියට වේවයි ප්‍රේත විෂයට වේවයි (උපත් විසින්) එළැඹේ නම් ඒ කර්ම කරන්නට අභව්‍ය (නො නිසි) යැ, යම් තාක් සෝතාපත්තිඵලය සාක්ෂාත් නො කෙරේ ද ඒ තාක් කලුරිය කරන්නට ද අභව්‍ය වේ මැ යි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යමකුට මේ දහම්හු විදසුන් නුවණින් පමණ විසින් ධ්‍යානක්ෂම වෙත් ද, මේ පුද්ගල ‘ධම්මානුසාරී’ යි කියනු ලැබෙයි. (හෙ) සමමත්ත නියාම සඞ්ඛ්‍යාත ආර්ය්‍ය මාර්ගයට පිවිසියේ යැ, සත්පුරුෂ භූමියට බැසගත්තේ යැ, පෘථග්ජන භුමිය ඉක්මැ වූයේ යැ. යම් කර්මයක් කොට නිරයට හෝ තිරිසන් යෝනියට හෝ ප්‍රේතවිෂයට හෝ (උත්පත්ති විසින්) එළැඹේ නම් ඒ කර්ම කරන්නට ද අභව්‍ය යැ. යම්තාක් සොතා පත්තිඵලය සාක්ෂාත් නො කෙරේ ද, ඒතාක් කලුරිය කරන්නට ද අභව්‍ය වේ මැ යි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යමෙක් මේ ධර්ම මෙසේ විදසුන් නුවණින් දනී නම් මෙසේ දකී නම් මේ පුද්ගල සෝතාපන්න යයි කියනු ලැබෙයි, (හෙ) සතර අපායෙහි නොහෙනසුලු යැ, ගතිනියත යැ, සම්බෝධිය පාරායන කොට ඇත්තේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "4. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "රූප සූත්‍රය",
                "level": "1"
            },
            {
                "text": "303. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "මහණෙනි, රූප අනිත්‍ය යැ, පෙරැළෙනසුලු යැ, අන් පරිදි වනසුලු යැ. ශබ්ද අනිත්‍ය යැ, පෙරැළෙනසුලු යැ, අන්පරිදි වනසුලු යැ. ගන්ධ අනිත්‍ය යැ, පෙරැළෙනසුලු යැ, අන්පරිදිවනසුලු යැ. රස අනිත්‍ය යැ, පෙරැළෙනසුලු යැ, අන්පරිදි වනසුලු යැ. ස්ප්‍රෂ්ටව්‍යය අනිත්‍ය යැ, පෙරැළෙනසුලු යැ. අන්පරිදිවනසුලු යැ. ධර්ම අනිත්‍ය යැ, පෙරැළෙනසුලු යැ අන්පරිදි වනසුලු යි. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "445"
            },
            {
                "text": "මහණෙනි, යමෙක් මේ දහමුන් මෙසෙයින් හදහයි ද, (හැදහීමෙන්) විමොක්ෂය පිළිලබයි ද මේ පුද්ගල ‘සද්ධානුසාරී’යි කියනු ලැබෙයි … ආර්ය්‍ය මාර්ගයට බැසගත් සත්පුරුෂ භූමියට පිවිසි පෘථග්ජන භූමිය ඉක්මැ වූ මේ පුද්ගල ‘ධම්මානුසාරී’ යි කියනු ලැබෙයි. යම් කර්මයක් කොට නිරයට හෝ තිරිසන් යෝනියට හෝ ප්‍රේතවිෂයට හෝ (උත්පත්ති විසින්) නො එළැඹේ ද ඒ කර්ම කරන්නට නො නිසි යැ. යම්තාක් සොතාපත්තිඵලය පසක් නො කෙරේ ද, ඒතාක් කලුරිය කරන්නට ද නො නිසි මැ යි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යමෙක් මේ දහම් වෙසෙසින් දනියි ද, දකියි ද, මේ පුඟුල් සෝතාපන්න යැ, අවාහි නොහෙන සුලු යැ, ගතිනියත යැ, සම්බෝධිය පිහිට කොට ඇතැයි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "4. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "විඤ්‌ඤාණ සූත්‍රය",
                "level": 1
            },
            {
                "text": "304. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "මහණෙනි, චක්ඛුවිඤ්ඤාණය අනිසයැ. වෙනස් වනසුලු යැ ‘අන් පරිදි වනසුලු යැ. සෝතවිඤ්ඤාණය අනිස යැ. වෙනස් වනසුලු යැ. අන්පරිදි වනසුලු යැ. ඝාන විඤ්ඤාණය අනිස යැ. වෙනස් වනසුලු යැ, අන්පරිදි වනසුලු යැ. ජිව්හාවිඤ්ඤාණය අනිස යැ, වෙනස් වනසුලු යැ. අන්පරිදි වනසුලු යැ. කායවිඤ්ඤාණය අනිස යැ, වෙනස් වනසුලු යැ. අන්පරිදි වනසුලු යැ. මනෝවිඤ්ඤාණය අනිස යැ. වෙනස් වනසුලු යැ. අන්පරිදි වනසුලු යි. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යමෙක් මේ දහම් මෙසේ අදහා නම් විමොක්ෂය පිළිලබා නම් ‘සද්ධානුසාරී’ මේ පුද්ගල … සම්බෝධිය පිහිට කොට ඇත්තේ ය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "4. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඵස්‌ස සූත්‍රය",
                "level": "1"
            },
            {
                "text": "305. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "මහණෙනි, චක්ඛුසම්ඵස්සය අනිස යැ. වෙනස් වනසුලු යැ. අන්පරිදි වනසුලු යැ සෝතසම්ඵස්සය … ඝානසම්ඵස්සය … ජිව්හාසම්ඵස්සය ... කායසම්ඵස්සය … මනෝසම්ඵස්සය අනිස යැ. වෙනස් වනසුලු යැ. අන්පරිදි වනසුලු යැ. මහණෙනි, යමෙක් මේ දහම් මෙසේ හදහා නම් ... සම්බෝධිය පිහිට කොට ඇත්තේ යයි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "4. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "වෙදනා සූත්‍රය",
                "level": "1"
            },
            {
                "text": "306. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "මහණෙනි, චක්ඛුසම්ඵස්සයෙන් හටගත් වෙදනාව අනිස යැ. වෙනස් වනසුලු යැ. අන්පරිදි වනසුලු යැ. සොතසම්ඵස්සයෙන් හටගත් වේදනාව … ඝානසම්ඵස්සයෙන් හටගත් වේදනාව … ජිව්හාසම්ඵස්සයෙන් හටගත් වේදනාව ... කායසම්ඵස්සයෙන් හටගත් වෙදනාව … මනෝසම්ඵස්සයෙන් හටගත් වේදනාව අනිස යැ, වෙනස් වනසුලු යැ. අන්පරිදි වනසුලු යි. මහණෙනි, යමෙක් මේ දහම් ... සම්බෝධිය පිහිට කොට ඇත්තේ ය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "447"
            },
            {
                "type": "centered",
                "text": "4. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සඤ්‌ඤා සූත්‍රය",
                "level": "1"
            },
            {
                "text": "307. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "මහණෙනි, රූපසඤ්ඤාව අනිස ය. වෙනස් වනසුලු ය. ‘අන්පරිදි වනසුලු ය සද්දසඤ්ඤාව ... ගන්ධසඤ්ඤාව … රසසඤ්ඤාව ... ඵොට්ඨබ්බසඤ්ඤාව ... ධම්මසඤ්ඤාව අනිස යැ. වෙනස් වනසුලුයැ. අන්පරිදි වනසුලු යැ. මහණෙනි යමෙක් මේ දහම් … සම්බෝධිය පිහිට කොට ඇත්තේ ය යි කියනු ලැබේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "4. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "චෙතනා සූත්‍රය",
                "level": "1"
            },
            {
                "text": "308. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "මහණෙනි, රූපසඤ්චෙතනාව අනිස යැ. වෙනස් වනසුලු යැ. අන්පරිදි වනසුලු යැ සද්දසඤ්චෙතනාව ... ගන්ධසඤ්චෙතනාව … රසසඤ්චෙතනාව ... ඵොට්ඨබ්බසඤ්චෙතනාව ... ධම්මසඤ්චෙතනාව අනිස යැ. වෙනස් වනසුලු ය අන්පරිදි වනසුලුයි. මහණෙනි, යමෙක් මේ දහම් … සම්බොධිය පිහිට කොට ඇත්තේ වේ යයි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "4. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තණ්‌හා සූත්‍රය",
                "level": "1"
            },
            {
                "text": "309. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "මහණෙනි, රූපණ්හාව අනිස යැ, වෙනස් වනසුලු යැ, අන්පරිදි වනසුලු යැ, සද්ද තණ්හාව ... ගන්ධතණ්හාව … රසතණ්හාව ... ඵොට්ඨබ්බතණ්හාව ... ධම්මතණ්හාව අනිස යැ, වෙනස් වනසුලු යැ, අන්පරිදි වනසුලු ය. මහණෙනි, යමෙක් මේ දහම් … සම්බොධිය පිහිට කොට ඇත්තේ වේ ය යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "4. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ධාතු සූත්‍රය",
                "level": "1"
            },
            {
                "text": "310. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "මහණෙනි, පඨවිධාතුව අනිස යැ, වෙනස් වනසුලු යැ, අන්පරිදි වනසුලු යැ, ආපෝධාතුව ... තෙජෝ ධාතුව … වායෝධාතුව ... ආකාසධාතුව ... විඤ්ඤාණධාතුව අනිස යැ, වෙනස් වනසුලුයැ. අන්පරිදි වනසුලු යි. මහණෙනි, යමෙක් මේ දහම් … සම්බොධිය පිහිට කොට ඇත්තේ වේ ය යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "449"
            },
            {
                "type": "centered",
                "text": "4. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඛන්‌ධ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "311. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "මහණෙනි, රූපය අනිස යැ, වෙනස් වනසුලු යැ, අන්පරිදි වනසුලු ය. ",
                "type": "paragraph"
            },
            {
                "text": "වෙදනාව අනිස යැ, වෙනස්වන සුලු යැ, අන්පරිදි වනසුලු යැ. සංඥාව අනිස යැ, වෙනස්වන සුලු යැ, අන්පරිදි වනසුලුයැ. සංස්කාර අනිස යැ, වෙනස් වනසුලු යැ. අන්පරිදි වනසුලු යැ, විඥානය අනිස යැ, වෙනස් වනසුලු යැ, අන් පරිදි වනසුලුයි. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යමෙක් මේ දහම් මෙසේ හදහා ද, (හැදැහීමෙන්) විමොක්ෂය පිළිලබා ද, මේ පුද්ගල සද්ධානුසාරී යැ, ආර්ය්‍යමාර්ගයට පිවිසියේ යැ, සත්පුරුෂභූමියට බටුයේ යැ, පෘථග්ජන භූමිය ඉක්මවාලී යැ, යම් කර්මයක් කොට නිරයට වේවයි තිරිසන් යොනියට වේවයි ප්‍රෙතවිෂයට වේවයි (උපත් විසින්) එළැඹේ නම් ඒ කර්ම කරන්නට අභව්‍ය යැ, යම්තාක් සෝතාපත්තිඵලය පසක් නො කෙරේ ද ඒ තාක් කලුරිය කරන්නට ද අභව්‍ය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යමකුහට මේ දහම්හු විවසුන් නුවණින් පමණ විසින් ධ්‍යානක්‍ෂම වෙත් ද, මේ පුඟුල් ධම්මානුසාරී යැ, අරීමඟට පිවිසියේ යැ, සපුරිස් බිමට බටුයේ යැ, පුහුදුන් බිම ඉක්මවාලී යැ, යම් කර්මයක් කොට නිරෑහි වේවයි තිරිසන්යොන්හි වේවයි පේවිසාහි වේවයි (උපත්විසින්) එළැඹෙනුයේ නම්, ඒ කර්ම කරන්නට නො නිසි යැ, සෝතාපත්තිඵලය පසක් කරන තාක් කලුරිය කරන්නට ද නො නිසි මැ යි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යමෙක් මේ දහමුන් මෙසේ දනියි ද, මෙසේ දකියි ද, මේ පුද්ගල සෝතාපන්න යැ, සතර අපායෙහි නො හෙනසුලු යැ, ගතිනියත යැ, සම්බෝධිය පාරායන කොට ඇත්තේ යයි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "පළමුවැනි චක්ඛු වර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි උද්දානය :**",
                "type": "unindented"
            },
            {
                "text": "චක්ඛු, රූප, විඤ්ඤාණ, ඵස්ස, වෙදනා, සඤ්ඤා, චෙතනා, තණ්හා, ධාතු, ඛන්ධ යි සූත්‍ර දශයෙකි.",
                "type": "paragraph"
            },
            {
                "text": "ඔක්කන්ති සංයුත්තය නිමියේ යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    }
]