{
    "filename": "sn-3-11",
    "bookId": 18,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 512,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "11. වලාහකසංයුත්තං",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. වලාහකවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "11. 1. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සුද්ධික සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**550.** සාවත්ථියං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "වලාහකකායිකෙ වො භික්ඛවෙ, දෙවෙ දෙසිස්සාමි. තං සුණාථ."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමෙ ච භික්ඛවෙ, වලාහකකායිකා දෙවා: සන්ති භික්ඛවෙ, සීතවලාහකා දෙවා. සන්ති භික්ඛවෙ, උණ්හවලාහකා දෙවා. සන්ති භිකඛවෙ, අබ්භවලාහකා දෙවා. සන්ති භික්ඛවෙ, වාතවලාහකා දෙවා. සන්ති භික්ඛවෙ, වස්සවලාහකා දෙවා. ඉමෙ වුච්චන්ති භික්ඛවෙ, වලාහකකායිකා දෙවා."
                    },
                    {
                        "type": "centered",
                        "text": "11. 1. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සුචරිත සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**551. **සාවත්ථියං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො අඤ්ඤතරො භික්ඛු යෙන භගවා තෙනුපසඞ්කමි -පෙ- එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච : කො නු ඛො භන්තෙ, හෙතු, කො පච්චයො, යෙනමිධෙකච්චො කායස්ස භෙදා පරම්මරණා වලාහකකායිකානං දෙවානං සහව්යතං උපපජ්ජතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛු, එකච්චො කායෙන සුචරිතං චරති, වාචාය සුචරිතං චරති, මනසා සුචරිතං චරති. තස්ස සුතං හොති : වලාහකකායිකා දෙවා දීඝායුකා වණ්ණවන්තො සුඛබහුලා’’ති. තස්ස එවං හොති : ‘‘අහො වතාහං කායස්ස භෙදා පරම්මරණා වලාහකකායිකානං දෙවානං සහව්යතං උපපජ්ජෙය්ය’’න්ති. සො කායස්ස භෙදා පරම්මරණා වලාහකකායිකානං දෙවානං සහව්යතං උපපජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො භික්ඛු, හෙතු, අයං පච්චයො, යෙනමිධෙකච්චො කායස්ස භෙදා පරම්මරණා වලාහකකායිකානං දෙවානං සහව්යතං උපපජ්ජතීති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "11. වලාහක සංයුක්තය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "text": "1. වලාහක වර්ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "11. 1. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සුද්‌ධික සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "**550**. සැවැත්නුවර: ",
                        "type": "unindented"
                    },
                    {
                        "text": "මහණෙනි, තොපට වලාහක කායික (වලාහක නම් දේවනිකායෙහි උපන්) දෙවියන් දේශනා කරන්නෙමි. එය අසවු.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, වලාහක කායික දෙවියෝ කවරහ යත්: මහණෙනි, ශීතවලාහක දෙවියෝ ඇතියහ, මහණෙනි, උණහවලාහක දෙවියෝ ඇතියහ, මහණෙනි, අබ්භවලාහක දෙවියෝ ඇතියහ, මහණෙනි, වාතවලාහක දෙවියෝ ඇතියහ, මහණෙනි, වස්සවලාහක දෙවියෝ ඇතියහ, මහණෙනි, මොහු වලාහකකායික දෙවියෝ යි කියනු ලැබෙති යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "11. 1. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සුචරිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "**551.** සැවැත්නුවර: ",
                        "type": "unindented"
                    },
                    {
                        "text": "එ කල්හි එක්තරා මහණෙක්, භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. ... එකත් පස් ව හුන් ඒ මහණ , භාග්‍යවතුන් වහන්සේට තෙල සැල කෙළේ යැ: “වහන්ස, යම් හෙයෙකින් මෙලො වැ එකෙක් කාබුන් මරණින් මතු වලාහකකායික දෙවියන්ගේ සහභාවයට පැමිණේ නම් එයට කිමෙක් හේතු ද, කිමෙක් ප්‍රත්‍යය දැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, මෙලොවැ එකෙක් කයින් සුසිරිත් කෙරෙයි, වදනින් සුසිරිත් කෙරෙයි, මනසින් සුසිරිත් කෙරෙයි. වලාහක කායික දෙවියෝ දීර්ඝායුෂ්කයහ, වර්ණවත්හ, සුඛබහුලහ යි ඔහු විසින් අසන ලද්දේත් වෙයි. (එහෙයින්) ඔහුට මම් කාබුන් මරණින් මතු වලාහක කායික දෙවියන්ගේ සහභාවයට පැමිණෙම් නම් යෙහෙකැ” යි මෙ බඳු සිතෙක් වෙයි. හෙ කාබුන් මරණින් මතු වලාහකකායික දෙවියන්ගේ සහභාවයට පැමිණේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, යම් හෙයෙකින් මෙලොවැ එකෙක් කාබුන් මරණින් මතු වලාහකකායික දෙවියන්ගේ සහභාවයට පැමිණේ නම් එයට මේ හේතු යි, මේ ප්‍රත්‍යය යි. ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 514,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "11. 1. 3 – 12.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අන්නදායකාදි සීතවලාහක සුත්තානි",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**552 - 561.** සාවත්ථියං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච : කො නු ඛො භන්තෙ, හෙතු, කො පච්චයො, යෙනමිධෙකච්චො කායස්ස භෙදා පරම්මරණා සීතවලාහකානං{1} දෙවානං සහව්යතං උපපජ්ජතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛු, එකච්චො කායෙන සුචරිතං චරති, වාචාය සුචරිතං චරති, මනසා සුචරිතං චරති. තස්ස සුතං හොති සීතවලාහකා දෙවා දීඝායුකා වණ්ණවන්තො සුඛබහුලා’’ති. තස්ස එවං හොති : ‘‘අහො වතාහං කායස්ස භෙදා පරම්මරණා සීතවලාහකානං දෙවානං සහව්යතං උපපජ්ජෙය්ය’’න්ති. සො අන්නං දෙති -පෙ- සො පානං දෙති -පෙ- සො වත්ථං දෙති -පෙ- සො යානං දෙති -පෙ- සො මාලං දෙති -පෙ- සො ගන්ධං දෙති -පෙ- සො විලෙපනං දෙති -පෙ- සො සෙය්යං දෙති -පෙ- සො ආවසථං දෙති -පෙ- සො පදීපෙය්යං දෙති. සො කායස්ස භෙදා පරම්මරණා සීතවලාහකානං දෙවානං සහව්යතං උපපජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො භික්ඛු, හෙතු, අයං පච්චයො, යෙනමිධෙකච්චො කායස්ස භෙදා පරම්මරණා සීතවලාහකානං දෙවානං සහව්යතං උපපජ්ජතීති."
                    },
                    {
                        "type": "centered",
                        "text": "11. 1. 13 – 52.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අන්නදායකාදි උණ්හවලාහකාදි සුත්තානි",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**562 - 601.** සාවත්ථියං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච : ‘‘කො නු ඛො භන්තෙ, හෙතු, කො පච්චයො, යෙනමිධෙකච්චො කායස්ස භෙදා පරම්මරණා උණ්හවලාහකානං දෙවානං -පෙ- අබ්භවලාහකානං දෙවානං -පෙ- වාතවලාහකානං දෙවානං -පෙ- වස්සවලාහකානං දෙවානං -පෙ- සහව්යතං උපපජ්ජතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භික්ඛු, එකච්චො කායෙන සුචරිතං චරති, වාචාය සුචරිතං චරති, මනසා සුචරිතං චරති. තස්ස සුතං හොති, වස්සවලාහකා දෙවා දීඝායුකා වණ්ණවන්තො සුඛබහුලාති. තස්ස එවං හොති : ‘‘අහො වතාහං කායස්ස භෙදා පරම්මරණා වස්සවලාහකානං දෙවානං සහව්යතං උපපජ්ජෙය්ය’’න්ති. සො අන්නං දෙති -පෙ- සො පානං දෙති -පෙ- සො වත්ථං දෙති -පෙ- සො යානං දෙති -පෙ- සො මාලං දෙති -පෙ- සො ගන්ධං දෙති -පෙ- සො විලෙපනං දෙති -පෙ- සො සෙය්යං දෙති -පෙ- සො ආවසථං දෙති -පෙ- සො පදීපෙය්යං දෙති. සො කායස්ස භෙදා පරම්මරණා සීතවලාහකානං දෙවානං සහව්යතං උපපජ්ජති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සීතවලාහකකායිකානං - සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "11. 1.3 - 12",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අන්නදායකාදි සීතවලාහක සූත්‍ර",
                        "level": 1
                    },
                    {
                        "text": "**552 - 561.** සැවැත්නුවර:",
                        "type": "unindented"
                    },
                    {
                        "text": "එකත්පසෙක හුන් ඒ මහණ, භාග්‍යවතුන් වහන්සේට තෙල සැල කෙළේ යැ: වහන්ස, යම් හෙයෙකින් මෙලොවැ එකෙක් කාබුන් මරණින් මතු ශීතවලාහක දෙවියන්ගේ සහභාවයට පැමිණේ නම් එයට හේතු කිමෙක් ද, ප්‍රත්‍යය කිමෙක් දැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, මෙලොවැ එකෙක් කයින් සුසිරිත් කෙරෙයි, වචසින් සුසිරිත් කෙරෙයි, මනසින් සුසිරිත් කෙරෙයි. “ශීතවලාහක දෙවියෝ දීර්ඝායුෂ්කයහ, වර්ණවත්හ, සුඛබහුලහ යි. ඔහු විසින් අසන ලද්දේත් වෙයි. (එහෙයින්) ඔහුට මම් කාබුන් මරණින් මතු ශීතවලාහක දෙවියන්ගේ සහභාවයට පැමිණෙම් නම් මැනැවැ” යි මෙ බඳු සිතෙක් වෙයි. හේ අහර දෙයි. ... හේ බොන දෑ දෙයි. ... හේ වස්ත්‍ර දෙයි. ... හේ වහන් දෙයි. … හේ මල් දෙයි. ... හේ ගඳ දෙයි. ... හේ විලවුන් දෙයි. ... හේ සෙනසුන් දෙයි. ... හේ වෙසෙනතැන් දෙයි. ... හේ පහන් උපකරණ දෙයි. හේ කාබුන් මරණින් මතු ශීතවලාහක දෙවියන්ගේ සහභාවයට පැමිණේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, යම් හෙයෙකින් මෙලොවැ එකෙක් කාබුන් මරණින් මතු ශීතවලාහක දෙවියන්ගේ සහභාවයට පැමිණේ නම් එයට මේ හේතු යි. මේ ප්‍රත්‍යය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "11. 1.13 - 52",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අන්නදායකාදි උණ්‌හවලාහකාදි සූත්‍ර",
                        "level": 1
                    },
                    {
                        "text": "**562 - 601.** සැවැත්නුවර:",
                        "type": "unindented"
                    },
                    {
                        "text": "එකත්පස් ව හුන් ඒ මහණ, භාග්‍යවතුන් වහන්සේට තෙල සැල කෙළේ යැ: වහන්ස, යම් හෙයෙකින් මෙහි එකෙක් කාබුන් මරණින් මතු උණහවලාහක දෙවියන්ගේ ... අබ්භවලාහක දෙවියන්ගේ ... වාතවලාහක දෙවියන්ගේ ... වස්සවලාහක දෙවියන්ගේ ... සහභාවයට පැමිණේ නම් එයට හේතු කිමෙක් ද, ප්‍රත්‍යය කිමෙක් දැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, මෙලොවැ එකෙක් කයින් සුසිරිත් කෙරෙයි, වචසින් සුසිරිත් කෙරෙයි, මනසින් සුසිරිත් කෙරෙයි. ඔහු විසින් “වස්සවලාහක දෙවියෝ දීර්ඝායුෂ්කයහ, වර්ණවත්හ, සුඛ බහුලහ” යි අසන ලද්දේත් වෙයි. ඔහුට: “මම් කාබුන් මරණින් මතූ වස්සවලාහක දෙවියන්ගේ සහභාවයට පැමිණෙම් නම් යෙහෙකැ” යි මෙ බඳු සිතෙක් වෙයි. හේ අහර දෙයි. ... හේ බොන දෑ දෙයි. ... හේ වස්ත්‍ර දෙයි. ... හේ වහන් දෙයි. ... හේ මල් දෙයි. ... හේ ගඳ දෙයි. ... හේ විලවුන් දෙයි. ... හේ සෙනසුන් දෙයි. ... හේ වෙසෙනතැන් දෙයි. ... හේ පහන් උපකරණ දෙයි. හේ කාබුන් මරණින් මතු වස්සවලාහක දෙවියන්ගේ සහභාවයට පැමිණේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 516,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අයං ඛො භික්ඛු, හෙතු, අයං පච්චයො, යෙනමිධෙකච්චො කායස්ස භෙදා පරම්මරණා වස්සවලාහකානං දෙවානං සහව්යතං උපපජ්ජතීති."
                    },
                    {
                        "type": "centered",
                        "text": "11. 1. 53.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සීතවලාහක සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**602.** සාවත්ථියං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච : කො නු ඛො භන්තෙ, හෙතු, කො පච්චයො, යෙනෙකදා සීතං හොතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සන්ති භික්ඛු, සීතවලාහකා නාම දෙවා. තෙසං යදා එවං හොති : ‘යන්නූන මයං සකාය රතියා රමෙය්යාමාති’. තෙසං තං චෙතොපණිධිමන්වාය සීතං හොති. අයං ඛො, භික්ඛු, හෙතු, අයං පච්චයො, යෙනෙකදා සීතං හොතීති."
                    },
                    {
                        "type": "centered",
                        "text": "11. 1. 54.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උණ්හවලාහක සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "**603. සාවත්ථියං:**"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච : කො නු ඛො භන්තෙ, හෙතු, කො පච්චයො: යෙනෙකදා උණ්හං හොතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සන්ති භික්ඛු, උණ්හවලාහකා නාම දෙවා. තෙසං යදා එවං හොති : ‘‘යන්නූන මයං සකාය රතියා රමෙය්යාමාති’’. තෙසං තං චෙතොපණිධිමන්වාය උණ්හං හොති. අයං ඛො භික්ඛු, හෙතු, අයං පච්චයො, යෙනෙකදා උණ්හං හොතීති."
                    },
                    {
                        "type": "centered",
                        "text": "11. 1. 55.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අබ්භවලාහක සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**604.** සාවත්ථියං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච : කො නු ඛො භන්තෙ, හෙතු, කො පච්චයො, යෙනෙකදා අබ්භං හොතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සන්ති භික්ඛු, අබ්භවලාහකා නාම දෙවා. තෙසං යදා එවං හොති : ‘‘යන්නූන මයං සකාය රතියා රමෙය්යාමාති.’’ තෙසං තං චෙතො පණිධිමන්වාය අබ්භං හොති. අයං ඛො භික්ඛු, හෙතු, අයං පච්චයො, යෙනෙකදා අබ්භං හොතීති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණ, යම් හෙයෙකින් මෙලොවැ එකෙක් කාබුන් මරණින් මතු වස්සවලාහක දෙවියන්ගේ සහභාවයට පැමිණේ නම් එයට මේ හෙතු යි, මේ ප්‍රත්‍යය යි. ",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "11. 1. 53.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සීතවලාහක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "**602. **සැවැත්නුවර:",
                        "type": "unindented"
                    },
                    {
                        "text": "එකත්පස් ව හුන් ඒ මහණ තෙමේ භාග්‍යවතුන් වහන්සේට තෙල සැල කෙළේ යැ: වහන්ස, යම් හෙයෙකින් (සිහිල් කාලයෙහි හෝ ග්‍රීෂ්ම කාලයෙහි වූ) එක් කලෙක සිහිලෙක් වේ නම් එයට කිමෙක් හේතු ද කිමෙක් ප්‍රත්‍යය දැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, ශීතවලාහක නම් දෙවියෝ ඇතියහ. ඔවුන්ට යම් කලෙක “අපි සිහිල් කම්සුවෙන් කෙළනමෝ නම් මැනැව”යි මෙබඳු සිතෙක් වේ ද, ඔවුන්ගේ ඒ සිත පිහිටුවීම අනු ව සිහිල වෙයි. මහණ, යම් හෙයෙකින් එක් කලෙක සිහිලෙක් වේ නම් එයට මේ හේතුයි, මේ ප්‍රත්‍යය යි. ",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "11. 1. 54.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උණ්‌හවලාහක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "**603. **සැවැත්නුවර:",
                        "type": "paragraph"
                    },
                    {
                        "text": "එකත්පස් ව හුන් ඒ මහණ තෙමේ භාග්‍යවතුන් වහන්සේට තෙල සැල කෙළේ යැ: වහන්ස, “යම් හෙයෙකින් එක් කලෙක (නියමකල්හි වන උණුසුමට වෙනස්) උණුසුමෙක් වේ නම් එයට කිමෙක් හේතු ද කිමෙක් ප්‍රත්‍යය දැ”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, උණ්හවලාහක නම් දෙවි කෙනක් අතියහ. ඔවුන්ට යම් කලෙක “අපි සිය කම් සුවෙන් කෙළනමෝ නම් මැනැවැ යි මෙබඳු සිතක් වේ ද, ඔවුන්ගේ ඒ සිත පිහිටුවීම අනුව උණුසුම වේ. මහණ, යම් හෙයෙකින් එක් කලෙක උණුසුම වේ නම් එයට මේ හේතු යි, මේ ප්‍රත්‍යය”යි. ",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "11. 1. 55.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අබ්‌භවලාහක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "**604. **සැවැත්නුවර:",
                        "type": "unindented"
                    },
                    {
                        "text": "එකත්පස් ව හුන් ඒ මහණ භාග්‍යවතුන් වහන්සේට තෙල සැල කෙළේ යැ: වහන්ස, “යම් හෙයෙකින් එක්කලෙක (අනියම් වසයෙන්) වලාකුළු වේ නම් එයට කිමෙක් හේතු ද, කිමෙක් ප්‍රත්‍යය දැ”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, අබ්භවලාහක නම් දෙවි කෙනෙක් ඇතියහ. ඔවුන්ට යම් කලෙක “අපි සිය කම් සුවෙන් කෙළනමෝ නම් මැනවැ”යි මෙබඳු සිතෙක් වේ ද, ඔවුන්ගේ ඒ සිත් පිහිටුවීම අනුව වලාකුළු වෙයි. මහණ, යම් හෙයෙකින් (අනියම් වසයෙන්) වලාකුළු වේ නම් එයට මේ හේතු යි, මේ ප්‍රත්‍යය’යි. ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 518,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "11. 1. 56.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "වාතවලාහක සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**605.** සාවත්ථියං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච : “කො නු ඛො භන්තෙ, හෙතු, කො පච්චයො, යෙනෙකදා වාතො හොතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සන්ති භික්ඛු, වාතවලාහකා නාම දෙවා. තෙසං යදා එවං හොති : ‘‘යන්නූන මයං සකාය රතියා රමෙය්යාමාති’. තෙසං තං චෙතොපණිධිමන්වාය වාතො හොති. අයං ඛො, භික්ඛු, හෙතු, අයං පච්චයො, යෙනෙකදා වාතො හොතීති."
                    },
                    {
                        "type": "centered",
                        "text": "11. 1. 57.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "වස්සවලාහක සුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**606.** සාවත්ථියං:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච : කො නු ඛො භන්තෙ, හෙතු, කො පච්චයො, යෙනෙකදා දෙවො වස්සතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සන්ති භික්ඛු, වස්සවලාහකා නාම දෙවා. තෙසං යදා එවං හොති : ‘යන්නූන මයං සකාය රතියා රමෙය්යාමාති’. තෙසං තං චෙතොපණිධිමන්වාය දෙවො වස්සති. අයං ඛො, භික්ඛු, හෙතු, අයං පච්චයො, යෙනෙකදා දෙවො වස්සතීති."
                    },
                    {
                        "type": "centered",
                        "text": "වලාහකවග්ගො පඨමො.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "(විත්ථාරෙන සත්තපඤ්ඤාය සුත්තන්තා භවන්ති.)",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රැද්දානං :**"
                    },
                    {
                        "type": "gatha",
                        "text": "සුද්ධිකං සුචරිතඤ්ච දානෙහි දස පඤ්චකං,\nසීතං උණ්හඤ්ච අබ්භඤ්ච වාත වස්සවලාහකාති.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "වලාහසසංයුත්තං සමත්තං.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "11. 1. 56.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "වාතවලාහක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "**605.** සැවැත්නුවර:",
                        "type": "unindented"
                    },
                    {
                        "text": "එකත්පස් ව හුන් ඒ මහණ භාග්‍යවතුන් වහන්සේට තෙල සැල කෙළේ යැ: වහන්ස, “යම් හෙයෙකින් එක්කලෙක (විකෘති වශයෙන්) දැඩි සුළඟ වේ නම් එයට කිමෙක් හේතු ද, කිමෙක් ප්‍රත්‍යය දැ”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, වාතවලාහක නම් දෙවි කෙනෙක් ඇතියහ. ඔවුනට යම් කලෙක “අපි සිය කම්සුවයෙන් කෙළනමෝ නම් මැනවැ”යි මෙබඳු සිතෙක් වෙයි, ඔවුන්ගේ ඒ සිත පිහිටුවීම අනුව දැඩි සුළං වේ. මහණ යම් හෙයෙකින් එක්කලෙක දැඩි සුළඟ වේ නම් එයට මේ හේතු යි. මේ ප්‍රත්‍යය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "11. 1. 57.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "වස්‌සවලාහක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "**606.** සැවැත්නුවර:",
                        "type": "unindented"
                    },
                    {
                        "text": "එකත්පස් ව හුන් ඒ මහණ භාග්‍යවතුන් වහන්සේට තෙල සැල කෙළේ යැ: වහන්ස, “යම් හෙයෙකින් එක්කලෙක (නොකල්හි වන) වැසි වසී නම් එයට හේතු කිමෙක් ද, ප්‍රත්‍යය කිමෙක් ”දැයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, වස්සවලාහක නම් දෙවි කෙනෙක් ඇතියහ. ඔවුන්ට යම් කලෙක “අපි සිය කම්සුවෙන් කෙළනමෝ නම් මැනවැ”යි මෙබඳු සිතෙක් වෙයි. ඔවුන්ගේ ඒ සිත පිහිටුවීම අනු ව නොකල් වැසි වසී. මහණ, යම් හෙයෙකින් එක්කලෙක නොකල් වැසි වසී නම් එයට මේ හේතු යි. මේ ප්‍රත්‍යය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පළමුවැනි වලාහක වර්ග යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "(විතර විසින් සුත්‍රාන්තයෝ සත්පනසෙක් වෙති.)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි සූත්‍රනාමාවලිය :**",
                        "type": "unindented"
                    },
                    {
                        "text": "සුද්ධික සූත්‍රය ද, සුචරිත සූත්‍රය ද, අන්නදායකා දි දසක පස ද, සීතවලාහක, උණ්හවලාහක, අබ්භවලාහක, වාතවලාහක, වස්සවලාහක සූත්‍රයෝ දැ යි’ සූත්‍ර සත්පනසෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වලාහක සංයුක්තය නිමියේ යි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ]
}