[
    {
        "filename": "sn-slyv-10",
        "bookId": 19,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "668"
            },
            {
                "type": "heading",
                "text": "10. අබ්යාකතසංයුත්තං",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. අබ්යාකතවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "10. 1. 1",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඛෙමාසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "2276. එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තෙන ඛො පන සමයෙන ඛෙමා භික්ඛුනී කොසලෙසු චාරිකං චරමානා අන්තරා ච සාවත්ථිං{1 සාවත්ථියං - සී 1, 2.} අන්තරා ච සාකෙතං තොරණවත්ථුස්මිං වාසං උපගතා හොති. අථ ඛො රාජා පසෙනදිකොසලො සාකෙතා සාවත්ථිං ගච්ඡන්තො අන්තරා ච සාකෙතං අන්තරා ච සාවත්ථිං තොරණවත්ථුස්මිං එකරත්තිවාසං උපගඤ්ඡි. අථ ඛො රාජා පසෙනදිකොසලො අඤ්ඤතරං පුරිසං ආමන්තෙසි: එහි ත්වං අම්භො පුරිස, තොරණවත්ථුස්මිං තථාරූපං සමණං වා බ්රාහ්මණං වා ජාන, යමහං අජ්ජ පයිරුපාසෙය්යන්ති."
            },
            {
                "type": "paragraph",
                "text": "එවං දෙවාති ඛො සො පුරිසො රඤ්ඤො පසෙනදිස්ස කොසලස්ස පටිස්සුත්වා කෙවලකප්පං තොරණවත්ථුං{2 වත්ථුස්මිං - සී 2, 1.} අන්වාහිණ්ඩන්තො{3 ආහිණ්ඩන්තො - මඡසං, ස්යා.} නාද්දස තථාරූපං සමණං වා බ්රාහ්මණං වා යං රාජා පසෙනදි කොසලො පයිරුපාසෙය්ය. අද්දසා ඛො සො පුරිසො ඛෙමං භික්ඛුනිං තොරණවත්ථුස්මිං වාසං උපගතං. දිස්වාන යෙන පසෙනදිකොසලො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා රාජානං පසෙනදිං කොසලං එතදවොච: නත්ථි ඛො දෙව, තොරණවත්ථුස්මිං තථාරූපො සමණො වා බ්රාහ්මණො වා යං දෙවො පයිරුපාසෙය්ය. අත්ථි ච ඛො දෙව, ඛෙමා නාම භික්ඛුනී තස්ස භගවතො සාවිකා අරහතො සම්මාසම්බුද්ධස්ස. තස්සා ඛො පනය්යාය එවං කල්යාණො කිත්තිසද්දො අබ්භුග්ගතො: “පණ්ඩිතා වියත්තා මෙධාවිනී බහුස්සුතා චිත්තකථා කල්යාණපටිභානා”ති. තං දෙවො පයිරුපාසතූති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො රාජා පසෙනදිකොසලො යෙන ඛෙමා භික්ඛුනී තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ඛෙමං භික්ඛුනිං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො රාජා පසෙනදිකොසලො ඛෙමං භික්ඛුනිං එතදවොච: කින්නු ඛො අය්යෙ හොති තථාගතො පරම්මරණාති. අව්යාකතං එතං මහාරාජ භගවතා: “හොති තථාගතො පරම්මරණා”ති. කිම්පනය්යෙ න හොති තථාගතො පරම්මරණාති. එතම්පි ඛො මහාරාජ, අව්යාකතං භගවතා: “න හොති තථාගතො පරම්මරණා”ති. කින්නු ඛො අය්යෙ, හොති ච න ච හොති තථාගතො පරම්මරණාති. අව්යාකතං ඛො එතං මහාරාජ භගවතා: “හොති ච න ච හොති තථාගතො පරම්මරණා”ති. කිම්පනය්යෙ, නෙව හොති න න හොති තථාගතො පරම්මරණාති. එතම්පි ඛො මහාරාජ, අව්යාකතං භගවතා: “නෙව හොති න න හොති තථාගතො පරම්මරණා”ති."
            },
            {
                "type": "page-break",
                "text": "670"
            },
            {
                "type": "paragraph",
                "text": "කින්නු ඛො අය්යෙ, හොති තථාගතො පරම්මරණාති ඉති පුට්ඨා සමානා අව්යාකතං ඛො එතං මහාරාජ භගවතා: “හොති තථාගතො පරම්මරණා”ති වදෙසි. කිම්පනය්යෙ න හොති තථාගතො පරම්මරණාති ඉති පුට්ඨා සමානා එතම්පි ඛො මහාරාජ අව්යාකතං භගවතා: “න හොති තථාගතො පරම්මරණාති” වදෙසි. කින්නු ඛො අය්යෙ, හොති ච න ච හොති තථාගතො පරම්මරණාති ඉති පුට්ඨා සමානා අව්යාකතං ඛො එතං මහාරාජ භගවතා: “හොති ච න ච හොති තථාගතො පරම්මරණා”ති වදෙසි. කිම්පනය්යෙ නෙව හොති න න හොති තථාගතො පරම්මරණාති ඉති පුට්ඨා සමානා එතම්පි ඛො මහාරාජ අව්යාකතං භගවතා: “නෙව හොති න න හොති තථාගතො පරම්මරණා”ති වදෙසි. කො නු ඛො අය්යෙ, හෙතු කො පච්චයො යෙන තං{1 යෙනෙතං - ස්යා, මඡසං.} අව්යාකතං භගවතාති."
            },
            {
                "type": "paragraph",
                "text": "තෙන හි මහාරාජ තඤ්ඤෙවෙත්ථ පටිපුච්ඡිස්සාමි.{2 පරිපුච්ඡිස්සාමි - සීමු.} යථා තෙ ඛමෙය්ය, තථා නං ව්යාකරෙය්යාසි."
            },
            {
                "type": "paragraph",
                "text": "තං කිම්මඤ්ඤසි මහාරාජ, අත්ථි තෙ කොචි ගණකො වා මුද්දිකො වා සඞ්ඛායකො වා යො පහොති ගඞ්ගාය වාලිකං{3 වාලුකං - මඡසං.} ගණෙතුං: “එත්තකා වාලිකා ඉති වා එත්තකානි{4 එත්තිකානි - සී 1, 2.} වාලිකාසතානි ඉති වා එත්තකානි වාලිකාසහස්සානි ඉති වා එත්තකානි වාලිකාසතසහස්සානි ඉති වා”ති. නො හෙතං අය්යෙ. අත්ථි පන තෙ කොචි ගණකො වා මුද්දිකො වා සඞ්ඛායකො වා යො පහොති මහාසමුද්දෙ උදකං මිණිතුං: “එත්තකානි උදකාළ්හකානීති{5 උදකාළ්හානි වා - සී 1, 2.} වා එත්තකානි උදකාළ්හකසතානීති වා එත්තකානි උදකාළ්හක සහස්සානීති වා එත්තකානි උදකාළ්හක සතසහස්සානීති වා”ති. නොහෙතං අය්යෙ. තං කිස්ස හෙතු? මහාය්යෙ,{6 මහෙය්යා - ස්යා, සී 2.} සමුද්දො ගම්භීරො අප්පමෙය්යො අප්පරියොගාහොති."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො මහාරාජ, යෙන රූපෙන තථාගතං පඤ්ඤාපයමානො පඤ්ඤාපෙය්ය, තං රූපං තථාගතස්ස පහීනං උච්ඡින්නමූලං තාලාවත්ථුකතං අනභාවකතං ආයතිං අනුප්පාදධම්මං. රූපසඞ්ඛය{7 සඞ්ඛයා - ස්යා. සඞ්ඛාය - මඡසං.}විමුත්තො ඛො මහාරාජ තථාගතො ගම්භීරො අප්පමෙය්යො අප්පරියොගාහො, සෙය්යථාපි මහාසමුද්දො. හොති තථාගතො පරම්මරණාතිපි න උපෙති, න හොති තථාගතො පරම්මරණාති පි න උපෙති, හොති ච න ච හොති තථාගතො පරම්මරණාතිපි න උපෙති. නෙව හොති න න හොති තථාගතො පරම්මරණාතිපි න උපෙති."
            },
            {
                "type": "page-break",
                "text": "672"
            },
            {
                "type": "paragraph",
                "text": "යාය වෙදනාය තථාගතං පඤ්ඤාපයමානො පඤ්ඤාපෙය්ය, සා වෙදනා තථාගතස්ස පහීනා උච්ඡින්නමූලා තාලාවත්ථුකතා අනභාවකතා ආයතිං අනුප්පාදධම්මා. වෙදනාසඞ්ඛයවිමුත්තො ඛො මහාරාජා තථාගතො ගම්භීරො අප්පමෙය්යො දුප්පරියොගාහො සෙය්යථාපි මහාසමුද්දො. හොති තථාගතො පරම්මරණාතිපි න උපෙති, න හොති තථාගතො පරම්මරණාතිපි න උපෙති, හොති ච න ච හොති තථාගතො පරම්මරණාතිපි න උපෙති, නෙව හොති න න හොති තථාගතො පරම්මරණාතිපි න උපෙති. යාය සඤ්ඤාය තථාගතං -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "යෙහි සඞ්ඛාරෙහි තථාගතං පඤ්ඤාපයමානො පඤ්ඤාපෙය්ය, තෙ සඞ්ඛාරා තථාගතස්ස පහීනා උච්ඡින්නමූලා තාලාවත්ථුකතා අනභාවකතා ආයතිං අනුප්පාදධම්මා. සඞ්ඛාරසඞ්ඛයවිමුත්තො ඛො මහාරාජ තථාගතො ගම්භීරො අප්පමෙය්යො දුප්පරියොගාහො සෙය්යථාපි මහාසමුද්දො. හොති තථාගතො පරම්මරණාතිපි න උපෙති, න හොති තථාගතො පරම්මරණාතිපි න උපෙති, හොති ච න ච හොති තථාගතො පරම්මරණාතිපි න උපෙති, නෙව හොති න න හොති තථාගතො පරම්මරණාතිපි න උපෙති."
            },
            {
                "type": "paragraph",
                "text": "යෙන විඤ්ඤාණෙන තථාගතං පඤ්ඤාපයමානො පඤ්ඤාපෙය්ය, තං විඤ්ඤාණං තථාගතස්ස පහීනං උච්ඡින්නමූලං තාලාවත්ථුකතං අනභාවකතං ආයතිං අනුප්පාදධම්මං. විඤ්ඤාණසඞ්ඛයවිමුත්තො ඛො මහාරාජ තථාගතො ගම්භීරො අප්පමෙය්යො අප්පරියොගාහො සෙය්යථාපි මහාසමුද්දො. හොති තථාගතො පරම්මරණාතිපි න උපෙති, න හොති තථාගතො පරම්මරණාතිපි න උපෙති, හොති ච න ච හොති තථාගතො පරම්මරණාතිපි න උපෙති, නෙව හොති න න හොති තථාගතො පරම්මරණාතිපි න උපෙතීති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො රාජා පසෙනදිකොසලො ඛෙමාය භික්ඛුනියා භාසිතං අභිනන්දිත්වා අනුමොදිත්වා උට්ඨායාසනා ඛෙමං භික්ඛුනිං අභිවාදෙත්වා පදක්ඛිණං කත්වා පක්කාමි. අථ ඛො රාජා පසෙනදිකොසලො අපරෙන සමයෙන යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො රාජා පසෙනදිකොසලො භගවන්තං එතදවොච: කින්නු ඛො භන්තෙ හොති තථාගතො පරම්මරණාති. අව්යාකතං ඛො එතං මහාරාජ මයා: “හොති තථාගතො පරම්මරණාති.” කිම්පන භන්තෙ න හොති තථාගතො පරම්මරණාති. තම්පි ඛො මහාරාජ අව්යාකතං මයා: “න හොති තථාගතො පරම්මරණා”ති. -පෙ-"
            },
            {
                "type": "page-break",
                "text": "674"
            },
            {
                "type": "paragraph",
                "text": "කින්නු ඛො භන්තෙ හොති තථාගතො පරම්මරණාති ඉති පුට්ඨො සමානො අව්යාකතං ඛො එතං මහාරාජ මයා: “හොති තථාගතො පරම්මරණා”ති වදෙසි -පෙ- කිම්පන භන්තෙ නෙව හොති න න හොති තථාගතො පරම්මරණාති ඉති පුට්ඨො සමානො තම්පි ඛො මහාරාජ අව්යාකතං මයා: “නෙව හොති න න හොති තථාගතො පරම්මරණා”ති වදෙසි. කො නු ඛො භන්තෙ හෙතු කො පච්චයො යෙන තං අව්යාකතං භගවතාති."
            },
            {
                "type": "paragraph",
                "text": "තෙන හි මහාරාජ තඤ්ඤෙවෙත්ථ පටිපුච්ඡිස්සාමි. යථා තෙ ඛමෙය්ය තථා නං ව්යාකරෙය්යාසි. තං කිම්මඤ්ඤසි මහාරාජ අත්ථි තෙ කොචි ගණකො වා මුද්දිකො වා සඞ්ඛායකො වා යො පහොති ගඞ්ගාය වාලිකං ගණෙතුං “එත්තකා වාලිකාති වා -පෙ- එත්තකානි වාලිකා සතසහස්සානීති වා”ති. නො හෙතං භන්තෙ. අත්ථි පන තෙ කොචි ගණකො වා මුද්දිකො වා සඞ්ඛායකො වා යො පහොති මහාසමුද්දෙ උදකං පමෙතුං “එත්තකානි උදකාළ්හකානීති වා -පෙ- එත්තකානි උදකාළ්හකසතසහස්සානිති වා”ති. නො හෙතං භන්තෙ. තං කිස්ස හෙතු: මහා භන්තෙ, සමුද්දො ගම්භීරො අප්පමෙය්යො අප්පරියොගාහොති."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො මහාරාජ, යෙන රූපෙන තථාගතං පඤ්ඤාපයමානො පඤ්ඤාපෙය්ය, තං රූපං තථාගතස්ස පහීනං උච්ඡින්නමූලං තාලාවත්ථුකතං අනභාවකතං ආයතිං අනුප්පාදධම්මං. රූපසඞ්ඛයවිමුත්තො ඛො මහාරාජ තථාගතො ගම්භීරො අප්පමෙය්යො දුප්පරියොගාහො සෙය්යථාපි මහාසමුද්දො. හොති තථාගතො පරම්මරණාතිපි න උපෙති -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපි න උපෙති."
            },
            {
                "type": "paragraph",
                "text": "යාය වෙදනාය -පෙ- යාය සඤ්ඤාය -පෙ- යෙහි සඞ්ඛාරෙහි -පෙ- යෙන විඤ්ඤාණෙන තථාගතං පඤ්ඤාපයමානො පඤ්ඤාපෙය්ය, තං විඤ්ඤාණං තථාගතස්ස පහීනං උච්ඡින්නමූලං තාලාවත්ථුකතං අනභාවකතං ආයතිං අනුප්පාදධම්මං. විඤ්ඤාණසඞ්ඛයවිමුත්තො ඛො මහාරාජ තථාගතො ගම්භීරො අප්පමෙය්යො දුප්පරියොගාහො සෙය්යථාපි සමුද්දො. හොති තථාගතො පරම්මරණාතිපි න උපෙති -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාපි න උපෙතීති."
            },
            {
                "type": "page-break",
                "text": "676"
            },
            {
                "type": "paragraph",
                "text": "අච්ඡරියං භන්තෙ, අබ්භුතං භන්තෙ, යත්ර හි නාම සත්ථු{1 සත්ථුනො - සී 1, සීමු.} චෙව සාවිකාය ච අත්ථෙන අත්ථො ව්යඤ්ජනෙන ව්යඤ්ජනං සංසන්දිස්සති සමෙස්සති න විහායිස්සති{2 විරොධයිස්සති - මඡසං.} යදිදං අග්ගපදස්මිං. එකමිදාහං භන්තෙ සමයං ඛෙමං භික්ඛුනිං උපසඞ්කමිත්වා එතමත්ථං ආපුච්ඡිං. සා පි මෙ අය්යා එතෙහි පදෙහි එතෙහි ව්යඤ්ජනෙහි එතමත්ථං ව්යාකාසි සෙය්යථාපි භගවා. අච්ඡරියං භන්තෙ අබ්භුතං භන්තෙ, යත්ර හි නාම සත්ථු චෙව සාවිකාය ච අත්ථෙන අත්ථො ව්යඤ්ජනෙන ව්යඤ්ජනං සංසන්දිස්සති සමෙස්සති න විහායිස්සති යදිදං අග්ගපදස්මිං. හන්ද ච දානි මයං භන්තෙ ගච්ඡාම. බහුකිච්චා මයං බහුකරණීයාති. යස්සදානි ත්වං මහාරාජ කාලං මඤ්ඤසීති. අථ ඛො රාජා පසෙනදි කොසලො භගවතො භාසිතං අභිනන්දිත්වා අනුමොදිත්වා උට්ඨායාසනා භගවන්තං අභිවාදෙත්වා පදක්ඛිණං කත්වා පක්කාමීති."
            },
            {
                "type": "centered",
                "text": "10. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනුරාධසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "2277. එකං සමයං භගවා වෙසාලියං විහරති මහාවනෙ කූටාගාරසාලායං. තෙන ඛො පන සමයෙන ආයස්මා අනුරාධො භගවතො අවිදූරෙ අරඤ්ඤකුටිකායං විහරති. අථ ඛො සම්බහුලා අඤ්ඤතිත්ථියා පරිබ්බාජකා යෙනායස්මා අනුරාධො තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා ආයස්මතා අනුරාධෙන සද්ධිං සම්මොදිංසු. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නා ඛො තෙ අඤ්ඤතිත්ථියා පරිබ්බාජකා ආයස්මන්තං අනුරාධං එතදවොචුං: යො සො ආවුසො අනුරාධ, තථාගතො උත්තමපුරිසො පරමපුරිසො පරමපත්තිපත්තො, තං තථාගතො ඉමෙසු චතූසු ඨානෙසු පඤ්ඤාපයමානො පඤ්ඤාපෙති: “හොති තථාගතො පරම්මරණාති වා, න හොති තථාගතො පරම්මරණාති වා, හොති ච න ච හොති තථාගතො පරම්මරණාති වා, නෙව හොති න න හොති තථාගතො පරම්මරණාති වා”ති."
            },
            {
                "type": "paragraph",
                "text": "යො සො ආවුසො තථාගතො උත්තමපුරිසො පරමපුරිසො පරමපත්තිපත්තො, තං තථාගතො අඤ්ඤත්ර ඉමෙහි චතූහි ඨානෙහි පඤ්ඤාපයමානො පඤ්ඤාපෙති: “හොති තථාගතො පරම්මරණාති වා න හොති තථාගතො පරම්මරණාති වා හොති ච න ච හොති තථාගතො පරම්මරණාති වා නෙව හොති න න හොති තථාගතො පරම්මරණාති වා”ති. එවං වුත්තෙ අඤ්ඤතිත්ථියා පරිබ්බාජකා ආයස්මන්තං අනුරාධං එතදවොචුං: යො{3 සො - ස්යා.} චායං භික්ඛු නවො භවිස්සති අචිරපබ්බජිතො, ථෙරො වා පන බාලො අව්යත්තොති. අථ තෙ අඤ්ඤතිත්ථියා පරිබ්බාජකා ආයස්මන්තං අනුරාධං නවවාදෙන ච බාලවාදෙන ච අපසාදෙත්වා උට්ඨායාසනා පක්කමිංසු."
            },
            {
                "type": "page-break",
                "text": "678"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මතො අනුරාධස්ස අචිරපක්කන්තෙසු තෙසු අඤ්ඤතිත්ථියෙසු පරිබ්බාජකෙසු එතදහොසි: සචෙ ඛො මං තෙ අඤ්ඤතිත්ථියා පරිබ්බාජකා උත්තරිං පුච්ඡෙය්යුං, කථං ව්යාකරමානො නු ඛ්වාහං තෙසං අඤ්ඤතිත්ථියානං පරිබ්බාජකානං වුත්තවාදී චෙව භගවතො අස්සං, න ච භගවන්තං අභූතෙන අබ්භාචික්ඛෙය්යං, ධම්මස්ස චානුධම්මං ව්යාකරෙය්යං, න ච කොචි සහධම්මිකො වාදානුවාදො ගාරය්හං ඨානං ආගච්ඡෙය්යාති. අථ ඛො ආයස්මා අනුරාධො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා අනුරාධො භගවන්තං එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "ඉධාහං භන්තෙ, භගවතො අවිදූරෙ අරඤ්ඤකුටිකායං විහරාමි. අථ ඛො භන්තෙ සම්බහුලා අඤ්ඤතිත්ථියා පරිබ්බාජකා යෙනාහං තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා මම සද්ධිං සම්මොදිංසු. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නා ඛො භන්තෙ අඤ්ඤතිත්ථියා පරිබ්බාජකා මං එතදවොචුං: යො සො ආවුසො අනුරාධ තථාගතො උත්තමපුරිසො පරමපුරිසො පරමපත්තිප්පත්තො තං තථාගතො ඉමෙසු චතූසු ඨානෙසු පඤ්ඤාපයමානො පඤ්ඤාපෙති: “හොති තථාගතො පරම්මරණාති වා -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාති වා”ති. එවං වුත්තාහං භන්තෙ තෙ අඤ්ඤතිත්ථියෙ පරිබ්බාජකෙ එතදවොචුං: යො සො ආවුසො තථාගතො උත්තමපුරිසො පරමපුරිසො පරමපත්තිප්පත්තො තං තථාගතො අඤ්ඤත්රිමෙහි චතූහි ඨානෙහි පඤ්ඤාපයමානො පඤ්ඤාපෙති: “හොති තථාගතො පරම්මරණාති වා -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාති වා”ති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ භන්තෙ තෙ අඤ්ඤතිත්ථියා පරිබ්බාජකා මං එතදවොචුං: යො චායං භික්ඛු නවො භවිස්සති අචිරපබ්බජිතො, ථෙරො වා පන බාලො අව්යත්තොති. අථ ඛො මං භන්තෙ තෙ අඤ්ඤතිත්ථියා පරිබ්බාජකා නවවාදෙන ච බාලවාදෙන ච අපසාදෙත්වා උට්ඨායාසනා පක්කමිංසු. තස්ස මය්හං භන්තෙ අචිරපක්කන්තෙසු තෙසු අඤ්ඤතිත්ථියෙසු පරිබ්බාජකෙසු එතදහොසි: සචෙ ඛො මං තෙ අඤ්ඤතිත්ථියා පරිබ්බාජකා උත්තරිං පුච්ඡෙය්යුං, කථං ව්යාකරමානො නු ඛ්වාහං තෙසං අඤ්ඤතිත්ථියානං පරිබ්බාජකානං වුත්තවාදී චෙව භගවතො අස්සං, න ච භගවන්තං අභූතෙන අබ්භාචික්ඛෙය්යං, ධම්මස්ස චානුධම්මං ව්යාකරෙය්යං, න ච කොචි සහධම්මිකො වාදානුවාදො ගාරය්හං ඨානං ආගච්ඡෙය්යාති."
            },
            {
                "type": "paragraph",
                "text": "තං කිම්මඤ්ඤසි අනුරාධ, රූපං නිච්චං වා අනිච්චං වාති. අනිච්චං භන්තෙ. යං පනානිච්චං දුක්ඛං වා තං සුඛං වාති. දුක්ඛං භන්තෙ. යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං කල්ලන්නු තං සමනුපස්සිතුං: “එතං මම, එසො’හමස්මි, එසො මෙ අත්තා”ති. නො හෙතං භන්තෙ. වෙදනා නිච්චා වා අනිච්චා වාති -පෙ- සඤ්ඤා -පෙ- සඞ්ඛාරා -පෙ- විඤ්ඤාණං නිච්චං වා අනිච්චං වාති. අනිච්චං භන්තෙ. යං පනානිච්චං දුක්ඛං වා සුඛං වාති. දුක්ඛං භන්තෙ. යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං කල්ලන්නු තං සමනුපස්සිතුං: “එතං මම, එසො’හමස්මි, එසො මෙ අත්තා”ති. නො හෙතං භන්තෙ."
            },
            {
                "type": "page-break",
                "text": "680"
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ අනුරාධ, යං කිඤ්චිරූපං අතීතානාගත පච්චුප්පන්නං අජ්ඣත්තං වා බහිද්ධා වා ඔළාරිකං වා සුඛුමං වා හීනං වා පණීතං වා යං දූරෙ සන්තිකෙ වා, සබ්බං රූපං: “නෙතං මම, නෙසො’හමස්මි, න මෙසො අත්තා”ති. එවමෙතං යථාභූතං සම්මප්පඤ්ඤාය දට්ඨබ්බං. යා කාචි වෙදනා අතීතානාගතපච්චුප්පන්නා -පෙ- යා කාචි සඤ්ඤා -පෙ- යෙ කෙචි සඞ්ඛාරා -පෙ- යං කිඤ්චි විඤ්ඤාණං අතීතානාගතපච්චුප්පන්නං අජ්ඣත්තං වා බහිද්ධා වා ඔළාරිකං වා සුඛුමං වා හීනං වා පණීතං වා, යං දූරෙ සන්තිකෙ වා සබ්බං විඤ්ඤාණං: “නෙතං මම, නෙසො’හමස්මි, නමෙසො අත්තා”ති එවමෙතං යථාභූතං සම්මප්පඤ්ඤාය දට්ඨබ්බං."
            },
            {
                "type": "paragraph",
                "text": "එවං පස්සං අනුරාධ, සුතවා අරියසාවකො රූපස්මිම්පි නිබ්බින්දති. වෙදනායපි නිබ්බින්දති, සඤ්ඤායපි නිබ්බින්දති, සඞ්ඛාරෙසුපි නිබ්බින්දති, විඤ්ඤාණස්මිම්පි නිබ්බින්දති. නිබ්බින්දං විරජ්ජති. විරාගා විමුච්චති. විමුත්තස්මිං විමුත්තමිති ඤාණං හොති. ඛීණා ජාති, වුසිතං බ්රහ්මචරියං, කතං කරණීයං, නාපරං ඉත්ථත්තායාති පජානාති."
            },
            {
                "type": "paragraph",
                "text": "තං කිංමඤ්ඤසි අනුරාධ, රූපං තථාගතොති සමනුපස්සසීති? නො හෙතං භන්තෙ. වෙදනං තථාගතොති සමනුපස්සසීති? නො හෙතං භන්තෙ. සඤ්ඤං තථාගතොති සමනුපස්සසීති? නො හෙතං භන්තෙ. සඞ්ඛාරෙ තථාගතොති සමනුපස්සසීති? නො හෙතං භන්තෙ. විඤ්ඤාණං තථාගතොති සමනුපස්සසීති? නො හෙතං භන්තෙ. තං කිංමඤ්ඤසි අනුරාධ, රූපස්මිං තථාගතොති සමනුපස්සසීති? නො හෙතං භන්තෙ. අඤ්ඤත්ර රූපා තථාගතොති සමනුපස්සසීති? නො හෙතං භන්තෙ. වෙදනාය තථාගතොති සමනුපස්සසීති? නො හෙතං භන්තෙ. අඤ්ඤත්ර වෙදනාය -පෙ- සඤ්ඤාය -පෙ- අඤ්ඤත්ර සඤ්ඤාය -පෙ- සඞ්ඛාරෙසු -පෙ- අඤ්ඤත්ර සඞ්ඛාරෙහි -පෙ- විඤ්ඤාණස්මිං තථාගතොති සමනුපස්සසීති? නො හෙතං භන්තෙ. අඤ්ඤත්ර විඤ්ඤාණා තථාගතොති සමනුපස්සසීති? නො හෙතං භන්තෙ. තං කිංමඤ්ඤසි අනුරාධ, රූපං -පෙ- වෙදනං -පෙ- සඤ්ඤං{1 වෙදනාථ, සඤ්ඤා - සී 1, 2.} -පෙ- සඞ්ඛාරෙ. -පෙ- විඤ්ඤාණං තථාගතොති සමනුපස්සසීති? නො හෙතං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤසි අනුරාධ, අයං සො අරූපී අවෙදනො අසඤ්ඤී අසඞ්ඛාරො අවිඤ්ඤාණො තථාගතොති සමනුපස්සසීති? නො හෙතං භන්තෙ. එත්ථ තෙ අනුරාධ, දිට්ඨෙව ධම්මෙ සච්චතො ථෙතතො{2 සච්චතො වා - ස්යා. තථතො වා - ස්යා.} තථාගතෙ අනුපලබ්භියමානෙ{3 තථාගතො අනුපලබ්භියමානො - මඡසං. අනුපලබ්භනීයසභාවො - ස්යා. ලබ්භනීයසභාවො - ස්යා.} කල්ලන්නු තෙ තං ව්යාකරණාය:{4 වෙය්යාකරණාය - ස්යා, මඡසං.} “යො සො ආවුසො තථාගතො උත්තමපුරිසො පරමපුරිසො පරමපත්තිපත්තො. තං තථාගතො අඤ්ඤත්රිමෙහි චතූහි ඨානෙහි පඤ්ඤාපයමානො පඤ්ඤාපෙති: හොති තථාගතො පරම්මරණාති වා -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාති වා”ති? නො හෙතං භන්තෙ: සාධු සාධු{5 සාධු - සීමු.} අනුරාධ, පුබ්බෙ චාහං අනුරාධ, එතරහි ච දුක්ඛඤ්චෙව පඤ්ඤාපෙමි දුක්ඛස්ස ච නිරොධන්ති."
            },
            {
                "type": "page-break",
                "text": "682"
            },
            {
                "type": "centered",
                "text": "10. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "උපගතසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "2278. එකං සමයං ආයස්මා සාරිපුත්තො ආයස්මා ච මහාකොට්ඨිතො බාරාණසියං විහරන්ති ඉසිපතනෙ මිගදායෙ. අථ ඛො ආයස්මා මහාකොට්ඨිතො සායන්හසමයං පටිසල්ලානා වුට්ඨිතො යෙනායස්මා සාරිපුත්තො තෙනුපසඞ්කමි, උපසඞ්කමිත්වා ආයස්මතා සාරිපුත්තෙන සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා මහාකොට්ඨිතො ආයස්මන්තං සාරිපුත්තං එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "කින්නු ඛො ආවුසො සාරිපුත්ත, හොති තථාගතො පරම්මරණාති? අව්යාකතං ඛො එතං ආවුසො, භගවතා: “හොති තථාගතො පරම්මරණා”ති. කිං පනාවුසො, න හොති තථාගතො පරම්මරණාති? එතම්පි ඛො ආවුසො, අව්යාකතං භගවතා: “න හොති තථාගතො පරම්මරණා”ති. කින්නු ඛො ආවුසො, හොති ච න ච හොති තථාගතො පරම්මරණාති? එතම්පි ඛො ආවුසො, අව්යාකතං භගවතා: “හොති ච න ච හොති තථාගතො පරම්මරණා”ති. කිං පනාවුසො, නෙව හොති න න හොති තථාගතො පරම්මරණාති? එතම්පි ඛො ආවුසො, අව්යාකතං භගවතා: නෙව හොති න න හොති තථාගතො පරම්මරණාති."
            },
            {
                "type": "paragraph",
                "text": "කින්නු ඛො ආවුසො, හොති තථාගතො පරම්මරණාති ඉති පුට්ඨො සමානො අව්යාකතං ඛො ආවුසො, එතං භගවතා: “හොති තථාගතො පරම්මරණා”ති වදෙසි -පෙ- කිං පනාවුසො, නෙව හොති න න හොති තථාගතො පරම්මරණාති ඉති පුට්ඨො සමානො එතම්පි ඛො ආවුසො, අව්යාකතං භගවතා: “නෙව හොති න න හොති තථාගතො පරම්මරණා”ති වදෙසි. කො නු ඛො ආවුසො, හෙතු කො පච්චයො යෙන තං අව්යාකතං භගවතාති."
            },
            {
                "type": "paragraph",
                "text": "හොති තථාගතො පරම්මරණාති ඛො ආවුසො, රූපගතමෙතං. න හොති තථාගතො පරම්මරණාති රූපගතමෙතං. හොති ච න ච හොති තථාගතො පරම්මරණාති රූපගතමෙතං. නෙව හොති න න හොති තථාගතො පරම්මරණාති රූපගතමෙතං. හොති තථාගතො පරම්මරණාති ඛො ආවුසො, වෙදනාගතමෙතං. න හොති තථාගතො පරම්මරණාති වෙදනාගතමෙතං. හොති ච න ච හොති තථාගතො පරම්මරණාති වෙදනාගතමෙතං. නෙව හොති න න හොති තථාගතො පරම්මරණාති වෙදනාගතමෙතං. හොති තථාගතො පරම්මරණාති\nඛො ආවුසො සඤ්ඤාගතමෙතං. න හොති තථාගතො පරම්මරණාති සඤ්ඤාගතමෙතං. හොති ච න ච හොති තථාගතො පරම්මරණාති සඤ්ඤාගතමෙතං. නෙව හොති න න හොති තථාගතො පරම්මරණාති සඤ්ඤාගතමෙතං. හොති තථාගතො පරම්මරණාති ඛො ආවුසො, සඞ්ඛාරගතමෙතං. න හොති තථාගතො පරම්මරණාති සඞ්ඛාරගතමෙතං. හොති ච න ච හොති තථාගතො පරම්මරණාති සඞ්ඛාරගතමෙතං. නෙව හොති න න හොති තථාගතො පරම්මරණාති සඞ්ඛාරගතමෙතං. හොති තථාගතො පරම්මරණාති ඛො ආවුසො, විඤ්ඤාණගතමෙතං. න හොති තථාගතො පරම්මරණාති විඤ්ඤාණගතමෙතං. හොති ච න ච හොති තථාගතො පරම්මරණාති විඤ්ඤාණගතමෙතං. නෙව හොති න න හොති තථාගතො පරම්මරණාති විඤ්ඤාණගතමෙතං."
            },
            {
                "type": "paragraph",
                "text": "අයං ඛො ආවුසො, හෙතු අයං පච්චයො යෙන තං අව්යාකතං භගවතාති."
            },
            {
                "type": "centered",
                "text": "10. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සමුදයසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "2279. එකං සමයං ආයස්මා ච සාරිපුත්තො ආයස්මා ච මහාකොට්ඨිතො බාරාණසියං විහරන්ති ඉසිපතනෙ මිගදායෙ -පෙ- කො නු ඛො ආවුසො, හෙතු කො පච්චයො යෙන තං අව්යාකතං භගවතාති. රූපං ඛො ආවුසො, අජානතො අපස්සතො යථාභූතං, රූපසමුදයං අජානතො අපස්සතො යථාභූතං, රූපනිරොධං අජානතො අපස්සතො යථාභූතං, රූපනිරොධගාමිනිං පටිපදං අජානතො අපස්සතො යථාභූතං: හොති තථාගතො පරම්මරණාතිපිස්ස හොති: න හොති තථාගතො පරම්මරණාතිපිස්ස හොති, හොති ච න ච හොති තථාගතො පරම්මරණාතිපිස්ස හොති, නෙව හොති න න හොති තථාගතො පරම්මරණාතිපිස්ස හොති."
            },
            {
                "type": "paragraph",
                "text": "වෙදනං අජානතො අපස්සතො යථාභූතං, වෙදනා සමුදයං -පෙ- සඤ්ඤං -පෙ- සඞ්ඛාරෙ -පෙ- විඤ්ඤාණං අජානතො අපස්සතො යථාභූතං, විඤ්ඤාණසමුදයං අජානතො අපස්සතො යථාභූතං, විඤ්ඤාණනිරොධං අජානතො අපස්සතො යථාභූතං, විඤ්ඤාණනිරොධගාමිනිං පටිපදං අජානතො අපස්සතො යථාභූතං හොති තථාගතො පරම්මරණාතිපිස්ස හොති, න හොති තථාගතො පරම්මරණාතිපිස්ස හොති, හොති ච න ච හොති තථාගතො පරම්මරණාතිපිස්ස හොති, නෙව හොති න න හොති තථාගතො පරම්මරණාතිපිස්ස හොති."
            },
            {
                "type": "paragraph",
                "text": "රූපඤ්ච ඛො ආවුසො, ජානතො පස්සතො යථාභූතං, රූපසමුදයං ජානතො පස්සතො යථාභූතං, රූපනිරොධං ජානතො පස්සතො යථාභූතං, රූපනිරොධගාමිනිං පටිපදං ජානතො පස්සතො යථාභූතං, හොති තථාගතො පරම්මරණාතිපිස්ස න හොති -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපිස්ස න හොති. වෙදනං ජානතො පස්සතො යථාභූතං, වෙදනා සමුදයං -පෙ- සඤ්ඤං -පෙ- සඞ්ඛාරෙ -පෙ- විඤ්ඤාණං ජානතො පස්සතො යථාභූතං, විඤ්ඤාණසමුදයං ජානතො පස්සතො යථාභූතං, විඤ්ඤාණනිරොධං ජානතො පස්සතො යථාභූතං, විඤ්ඤාණනිරොධගාමිනිං පටිපදං ජානතො පස්සතො යථාභූතං හොති තථාගතො පරම්මරණාතිපිස්ස න හොති, න හොති තථාගතො පරම්මරණාතිපිස්ස න හොති, හොති ච න ච හොති තථාගතො පරම්මරණාතිපිස්ස න හොති, නෙව හොති න න හොති තථාගතො පරම්මරණාතිපිස්ස න හොති. අයං ඛො ආවුසො, හෙතු අයං පච්චයො යෙන තං අව්යාකතං භගවතාති."
            },
            {
                "type": "page-break",
                "text": "686"
            },
            {
                "type": "centered",
                "text": "10. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පෙමසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "2280. එකං සමයං ආයස්මා ච සාරිපුත්තො ආයස්මා ච මහාකොට්ඨිතො බාරාණසියං විහරන්ති ඉසිපතනෙ මිගදායෙ -පෙ- කො නු ඛො ආවුසො, හෙතු කො පච්චයො යෙන තං අව්යාකතං භගවතාති? රූපෙ ඛො ආවුසො අවිගතරාගස්ස අවිගතච්ඡන්දස්ස අවිගතපෙමස්ස අවිගතපිපාසස්ස අවිගතපරිළාහස්ස අවිගතතණ්හස්ස: හොති තථාගතො පරම්මරණාතිපිස්ස හොති -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපිස්ස හොති."
            },
            {
                "type": "paragraph",
                "text": "වෙදනාය අවිගතරාගස්ස අවිගතච්ඡන්දස්ස අවිගතපෙමස්ස අවිගතපිපාසස්ස අවිගතපරිළාහස්ස අවිගතතණ්හස්ස -පෙ- සඤ්ඤාය -පෙ- සඤ්ඛාරෙසු -පෙ- විඤ්ඤාණෙ අවිගතරාගස්ස අවිගතච්ඡන්දස්ස අවිගතපෙමස්ස අවිගතපිපාසස්ස අවිගතපරිළාහස්ස අවිගතතණ්හස්ස හොති තථාගතො පරම්මරණාතිපිස්ස හොති -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපිස්ස හොති."
            },
            {
                "type": "paragraph",
                "text": "රූපෙ ච ඛො ආවුසො විගතරාගස්ස විගතඡන්දස්ස විගතපෙමස්ස විගතපිපාසස්ස විගතපරිළාහස්ස විගතතණ්හස්ස හොති තථාගතො පරම්මරණාතිපිස්ස න හොති -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපිස්ස න හොති. වෙදනාය -පෙ- සඤ්ඤාය -පෙ- සඞ්ඛාරෙසු -පෙ- විඤ්ඤාණෙ විගතරාගස්ස විගතච්ඡන්දස්ස විගතපෙමස්ස විගතපිපාසස්ස විගතපරිළාහස්ස විගතතණ්හස්ස හොති තථාගතො පරම්මරණාතිපිස්ස න හොති -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපිස්ස න හොති. අයං ඛො ආවුසො, හෙතු අයං පච්චයො යෙන තං අව්යාකතං භගවතාති."
            },
            {
                "type": "centered",
                "text": "10. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආරාමසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "2281. එකං සමයං ආයස්මා ච සාරිපුත්තො ආයස්මා ච මහාකොට්ඨිතො බාරාණසියං විහරන්ති ඉසිපතනෙ මිගදායෙ. අථ ඛො ආයස්මා සාරිපුත්තො සායන්හසමයං පටිසල්ලානා වුට්ඨිතො යෙනායස්මා මහාකොට්ඨිතො තෙනුපසඞ්කමි, උපසඞ්කමිත්වා ආයස්මතා මහාකොට්ඨිකෙන සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා සාරිපුත්තො ආයස්මන්තං මහාකොට්ඨිතං එතදවොච: කින්නු ඛො ආවුසො කොට්ඨිත, හොති තථාගතො පරම්මරණාති? -පෙ- කිංපනාවුසො, නෙව හොති න න හොති තථාගතො පරම්මරණාති ඉති පුට්ඨො සමානො එතම්පි ඛො ආවුසො, අව්යාකතං භගවතා: “නෙව හොති න න හොති තථාගතො පරම්මරණා”ති වදෙසි. කො නු ඛො ආවුසො, හෙතු කො පච්චයො යෙන තං අව්යාකතං භගවතාති."
            },
            {
                "type": "page-break",
                "text": "688"
            },
            {
                "type": "paragraph",
                "text": "රූපාරාමස්ස ඛො ආවුසො, රූපරතස්ස රූපසම්මුදිතස්ස රූපනිරොධං අජානතො අපස්සතො යථාභූතං හොති තථාගතො පරම්මරණාතිපිස්ස හොති; න හොති තථාගතො පරම්මරණාතිපිස්ස හොති, හොති ච න ච හොති තථාගතො පරම්මරණාතිපිස්ස හොති, නෙව හොති න නහොති තථාගතො පරම්මරණාතිපිස්ස හොති. වෙදනාරාමස්ස ඛො ආවුසො, වෙදනාරතස්ස වෙදනාසම්මුදිතස්ස වෙදනානිරොධං අජානතො අපස්සතො යථාභූතං හොති තථාගතො පරම්මරණාතිපිස්ස හොති -පෙ- සඤ්ඤාරාමස්ස ඛො ආවුසො -පෙ- සඞ්ඛාරාරාමස්ස ඛො ආවුසො -පෙ- විඤ්ඤාණාරාමස්ස ඛො ආවුසො, විඤ්ඤාණරතස්ස විඤ්ඤාණසම්මුදිතස්ස විඤ්ඤාණනිරොධං අජානතො අපස්සතො යථාභූතං හොති තථාගතො පරම්මරණාතිපිස්ස හොති -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපිස්ස හොති."
            },
            {
                "type": "paragraph",
                "text": "න රූපාරාමස්ස ඛො ආවුසො, න රූපරතස්ස න රූපසම්මුදිතස්ස රූපනිරොධං ජානතො පස්සතො යථාභූතං හොති තථාගතො පරම්මරණාතිපිස්ස න හොති -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපිස්ස න හොති. න වෙදනාරාමස්ස ඛො ආවුසො, න වෙදනාරතස්ස න වෙදනාසම්මුදිතස්ස -පෙ- න සඤ්ඤාරාමස්ස ඛො ආවුසො -පෙ- න සඞ්ඛාරාරාමස්ස ඛො ආවුසො -පෙ- න විඤ්ඤාණාරාමස්ස ඛො ආවුසො, න විඤ්ඤාණරතස්ස න විඤ්ඤාණසම්මුදිතස්ස විඤ්ඤාණනිරොධං ජානතො පස්සතො යථාභූතං හොති තථාගතො පරම්මරණාතිපිස්ස න හොති -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපිස්ස න හොති. අයං ඛො ආවුසො, හෙතු අයං පච්චයො යෙන තං අව්යාකතං භගවතාති."
            },
            {
                "type": "paragraph",
                "text": "සියා පනාවුසො, අඤ්ඤොපි පරියායො යෙන තං අව්යාකතං භගවතාති? සියා ආවුසො. භවාරාමස්ස ඛො ආවුසො, භවරතස්ස භවසම්මුදිතස්ස භවනිරොධං අජානතො අපස්සතො යථාභූතං හොති තථාගතො පරම්මරණාතිපිස්ස හොති -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපිස්ස හොති."
            },
            {
                "type": "paragraph",
                "text": "න භවාරාමස්ස ඛො ආවුසො, න භවරතස්ස න භවසම්මුදිතස්ස භවනිරොධං ජානතො පස්සතො යථාභූතං හොති තථාගතො පරම්මරණාතිපිස්ස න හොති -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපිස්ස න හොති. අයම්පි ඛො ආවුසො, පරියායො යෙන තං අව්යාකතං භගවතාති."
            },
            {
                "type": "paragraph",
                "text": "සියා පනාවුසො අඤ්ඤොපි පරියායො යෙන තං අව්යාකතං භගවතාති? සියා ආවුසො. උපාදානාරාමස්ස ඛො ආවුසො, උපාදානරතස්ස උපාදානසම්මුදිතස්ස උපාදානනිරොධං අජානතො අපස්සතො යථාභූතං හොති තථාගතො පරම්මරණාතිපිස්ස හොති -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපිස්ස හොති."
            },
            {
                "type": "page-break",
                "text": "690"
            },
            {
                "type": "paragraph",
                "text": "න උපාදානාරාමස්ස ඛො ආවුසො, න උපාදානරතස්ස න උපාදානසම්මුදිතස්ස උපාදානනිරොධං ජානතො පස්සතො යථාභූතං හොති තථාගතො පරම්මරණාතිපිස්ස න හොති -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපිස්ස න හොති. අයම්පි ඛො ආවුසො, පරියායො, යෙන තං අව්යාකතං භගවතාති."
            },
            {
                "type": "paragraph",
                "text": "සියා පනාවුසො, අඤ්ඤොපි පරියායො යෙන තං අව්යාකතං භගවතාති? සියා ආවුසො. තණ්හාරාමස්ස ඛො ආවුසො, තණ්හාරතස්ස තණ්හාසම්මුදිතස්ස තණ්හානිරොධං අජානතො අපස්සතො යථාභූතං හොති තථාගතො පරම්මරණාතිපිස්ස හොති -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපිස්ස හොති."
            },
            {
                "type": "paragraph",
                "text": "න තණ්හාරාමස්ස ඛො ආවුසො, න තණ්හාරතස්ස න තණ්හාසම්මුදිතස්ස තණ්හානිරොධං ජානතො පස්සතො යථාභූතං හොති තථාගතො පරම්මරණාතිපිස්ස න හොති -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපිස්ස න හොති. අයං ඛො ආවුසො, පරියායො යෙන තං අව්යාකතං භගවතාති."
            },
            {
                "type": "paragraph",
                "text": "සියා පනාවුසො, අඤ්ඤොපි පරියායො යෙන තං අව්යාකතං භගවතාති. එත්ථදානි ආවුසො සාරිපුත්ත, ඉතො උත්තරිං කිං ඉච්ඡසි? තණ්හාසඞ්ඛයවිමුත්තස්ස ආවුසො, සාරිපුත්ත, භික්ඛුනො වට්ටං{1 වත්තං - ස්යා. වද්ධං - සී 1, 2. PTS.} නත්ථි පඤ්ඤාපනායාති."
            },
            {
                "type": "centered",
                "text": "10. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආයතනසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "2282. අථ ඛො වච්ඡගොත්තො පරිබ්බාජකො යෙනායස්මා මහාමොග්ගල්ලානො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මතා මහාමොග්ගල්ලානෙන සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො වච්ඡගොත්තො පරිබ්බාජකො ආයස්මන්තං මහාමොග්ගල්ලානං එතදවොච: කින්නු ඛො භො මොග්ගල්ලාන, සස්සතො ලොකොති? අව්යාකතං ඛො එතං වච්ඡ{2 වච්ඡගොත්ත - සීමු.} භගවතා: “සස්සතො ලොකො”ති. කිං පන භො මොග්ගල්ලාන, අසස්සතො ලොකොති? එතම්පි ඛො වච්ඡ, අව්යාකතං භගවතා: “අසස්සතො ලොකො”ති. කින්නු ඛො භො මොග්ගල්ලාන, අන්තවා ලොකොති? අව්යාකතං ඛො එතං වච්ඡ, භගවතා: “අන්තවා ලොකො”ති. කිං පන භො මොග්ගල්ලාන, අනන්තවා ලොකොති? එතම්පි ඛො වච්ඡ, අව්යාකතං භගවතා “අනන්තවා ලොකො”ති."
            },
            {
                "type": "page-break",
                "text": "692"
            },
            {
                "type": "paragraph",
                "text": "කින්නු ඛො භො මොග්ගල්ලාන, තං ජීවං තං සරීරන්ති? අව්යාකතං ඛො එතං වච්ඡ, භගවතා: “තං ජීවං තං සරීර”න්ති. කිං පන භො මොග්ගල්ලාන, අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති? එතම්පි ඛො වච්ඡ, අව්යාකතං භගවතා: “අඤ්ඤං ජීවං අඤ්ඤං සරීර”න්ති. කින්නු ඛො භො මොග්ගල්ලාන, හොති තථාගතො පරම්මරණාති? අව්යාකතං ඛො එතං{1 එතම්පි ඛො වච්ඡ අව්යාකතං - සීමු.} වච්ඡ භගවතා: “හොති තථාගතො පරම්මරණා”ති. කිං පන භො මොග්ගල්ලාන, න හොති තථාගතො පරම්මරණාති? එතම්පි ඛො වච්ඡ, අව්යාකතං භගවතා: “න හොති තථාගතො පරම්මරණා”ති. කින්නු ඛො මොග්ගල්ලාන, හොති ච න ච හොති තථාගතො පරම්මරණාති? අව්යාකතං ඛො එතං වච්ඡ, භගවතා: “හොති ච න ච හොති තථාගතො පරම්මරණා”ති. කිං පන භො මොග්ගල්ලාන, නෙව හොති න න හොති තථාගතො පරම්මරණාති? එතම්පි ඛො වච්ඡ, අව්යාකතං භගවතා “නෙව හොති න න හොති තථාගතො පරම්මරණා”ති."
            },
            {
                "type": "paragraph",
                "text": "කො නු ඛො භො මොග්ගල්ලාන, හෙතු කො පච්චයො යෙන අඤ්ඤතිත්ථියානං පරිබ්බාජකානං එවං පුට්ඨානං එවං ව්යාකරණං හොති: “සස්සතො ලොකොති වා, අසස්සතො ලොකොති වා අන්තවා ලොකොති වා, අනන්තවා ලොකොති වා, තං ජීවං තං සරීරන්ති වා අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති වා, හොති තථාගතො පරම්මරණාති වා, න හොති තථාගතො පරම්මරණාති වා, හොති ච න ච හොති තථාගතො පරම්මරණාති වා, නෙව හොති න න හොති තථාගතො පරම්මරණාති”වා?"
            },
            {
                "type": "paragraph",
                "text": "කො පන භො මොග්ගල්ලාන, හෙතු කො පච්චයො යෙන සමණස්ස ගොතමස්ස එවං පුට්ඨස්ස න එවං ව්යාකරණං හොති: “සස්සතො ලොකොතිපි, අසස්සතො ලොකොතිපි, අන්තවා ලොකොතිපි, අනන්තවා ලොකොතිපි, තං ජීවං තං සරීරන්තිපි, අඤ්ඤං ජීවං අඤ්ඤං සරීරන්තිපි, හොති තථාගතො පරම්මරණාතිපි, න හොති තථාගතො පරම්මරණාතිපි, හොති ච න ච හොති තථාගතො පරම්මරණාතිපි, නෙව හොති න න හොති තථාගතො පරම්මරණාතිපී”ති?"
            },
            {
                "type": "paragraph",
                "text": "අඤ්ඤතිත්ථියා ඛො වච්ඡ, පරිබ්බාජකා චක්ඛුං: “එතං මම, එසො’හමස්මි, එසො මෙ අත්තා”ති සමනුපස්සන්ති. සොතං -පෙ- ඝානං -පෙ- ජිව්හං: “එතං මම, එසො’හමස්මි, එසො මෙ අත්තා”ති සමනුපස්සන්ති. කායං -පෙ- මනං: එතං මම, එසො’හමස්මි, එසො මෙ අත්තා”ති සමනුපස්සන්ති. තස්මා අඤ්ඤතිත්ථියානං පරිබ්බාජකානං එවං පුට්ඨානං එවං ව්යාකරණං හොති: “සස්සතො ලොකොති වා -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාති”වා."
            },
            {
                "type": "page-break",
                "text": "694"
            },
            {
                "type": "paragraph",
                "text": "තථාගතො ච ඛො වච්ඡ, අරහං සම්මාසම්බුද්ධො චක්ඛුං: “නෙතං මම, නෙසො’හමස්මි, න මෙසො අත්තා”ති සමනුපස්සති. සොතං -පෙ- ඝානං -පෙ- ජිව්හං: “නෙතං මම, නෙසො’හමස්මි, න මෙසො අත්තා”ති සමනුපස්සති. කායං -පෙ- මනං: “නෙතං මම, නෙසො’හමස්මි, න මෙසො අත්තා”ති සමනුපස්සති. තස්මා තථාගතස්ස එවං පුට්ඨස්ස න එවං ව්යාකරණං හොති: “සස්සතො ලොකොතිපි -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපී”ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො වච්ඡගොත්තො පරිබ්බාජකො උට්ඨායාසනා යෙන භගවා තෙනුපසඞ්කමි, උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො වච්ඡගොත්තො පරිබ්බාජකො භගවන්තං එතදවොච: කින්නු ඛො භො ගොතම, සස්සතො ලොකොති? අව්යාකතං ඛො එතං වච්ඡ, මයා: “සස්සතො ලොකො”ති -පෙ- කිං පන භො ගොතම, නෙව හොති න න හොති තථාගතො පරම්මරණාති? එතම්පි ඛො වච්ඡ, අව්යාකතං මයා: “නෙව හොති න න හොති තථාගතො පරම්මරණා”ති."
            },
            {
                "type": "paragraph",
                "text": "කො නු ඛො භො ගොතම හෙතු කො පච්චයො යෙන අඤ්ඤතිත්ථියානං පරිබ්බාජකානං එවං පුට්ඨානං එවං ව්යාකරණං හොති; “සස්සතො ලොකොති වා -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාති”වා? කො පන භො ගොතම, හෙතු කො පච්චයො යෙන භොතො ගොතමස්ස එවං පුට්ඨස්ස න එවං ව්යාකරණං හොති: “සස්සතො ලොකොතිපි -පෙ- නෙව හොති තථාගතො පරම්මරණාතිපී”ති?"
            },
            {
                "type": "paragraph",
                "text": "අඤ්ඤතිත්ථියා ඛො වච්ඡ, පරිබ්බාජකා චක්ඛුං: “එතං මම, එසො’හමස්මි, එසො මෙ අත්තාති” සමනුපස්සන්ති. සොතං -පෙ- ඝානං -පෙ- ජිව්හං: “එතං මම, එසො’හමස්මි, එසො මෙ අත්තාති” සමනුපස්සන්ති. කායං -පෙ- මනං “එතං මම, එසො’හමස්මි, එසො මෙ අත්තාති” සමනුපස්සන්ති. තස්මා අඤ්ඤතිත්ථියානං පරිබ්බාජකානං එවං පුට්ඨානං එවං ව්යාකරණං හොති: “සස්සතො ලොකොති වා -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාති”වා."
            },
            {
                "type": "paragraph",
                "text": "තථාගතො ච ඛො වච්ඡ, අරහං සම්මාසම්බුද්ධො චක්ඛුං: “නෙතං මම, නෙසො’හමස්මි, න මෙසො අත්තා”ති සමනුපස්සති. සොතං -පෙ- ඝානං -පෙ- ජිව්හං -පෙ- කායං -පෙ- මනං: “නෙතං මම, නෙසො’හමස්මි, න මෙසො අත්තා”ති සමනුපස්සති. තස්මා තථාගතස්ස එවං පුට්ඨස්ස එවං ව්යාකරණං හොති: “සස්සතො ලොකොතිපි, අසස්සතො ලොකොතිපි, අන්තවා ලොකොතිපි, අනන්තවා ලොකොතිපි, තං ජීවං තං සරීරන්තිපි, අඤ්ඤං ජීවං අඤ්ඤං සරීරන්තිපි, හොති තථාගතො පරම්මරණාතිපි, න හොති තථාගතො පරම්මරණාතිපි, හොති ච න ච හොති තථාගතො පරම්මරණාතිපි නෙව හොති න න හොති තථාගතො පරම්මරණාතිපී”ති."
            },
            {
                "type": "page-break",
                "text": "696"
            },
            {
                "type": "paragraph",
                "text": "අච්ඡරියං භො ගොතම, අබ්භුතං භො ගොතම, යත්ර හි නාම සත්ථුස්ස ච අත්ථෙනත්ථො ව්යඤ්ජනෙන ව්යඤ්ජනං සංසන්දිස්සති සමෙස්සති න විහායිස්සති යදිදං අග්ගපදස්මිං. ඉදානාහං භො ගොතම, සමණං මහාමොග්ගල්ලානං උපසඞ්කමිත්වා එතමත්ථං ආපුච්ඡිං. සමණොපි මෙ මොග්ගල්ලානො එතෙහි පදෙහි එතෙහි ව්යඤ්ජනෙහි එතමත්ථං ව්යාකාසි, සෙය්යථාපි භවං ගොතමො. අච්ඡරියං භො ගොතම, අබ්භුතං භො ගොතම, යත්ර හි නාම සත්ථුස්ස ච සාවකස්ස ච අත්ථෙනත්ථො ව්යඤ්ජනෙන ව්යඤ්ජනං සංසන්දිස්සති සමෙස්සති න විහායිස්සති, යදිදං අග්ගපදස්මින්ති."
            },
            {
                "type": "centered",
                "text": "10. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඛන්ධසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "2283. අථ ඛො වච්ඡගොත්තො පරිබ්බාජකො යෙන භගවා තෙනුපසඞ්කමි, උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො වච්ඡගොත්තො පරිබ්බාජකො භගවන්තං එතදවොච: කින්නු ඛො භො ගොතම, සස්සතො ලොකොති? අව්යාකතං ඛො එතං වච්ඡ මයා: “සස්සතො ලොකො”ති -පෙ- කිම්පන භො ගොතම, නෙව හොති න න හොති තථාගතො පරම්මරණාති? එතම්පි ඛො වච්ඡ, අව්යාකතං මයා: “නෙව හොති න න හොති තථාගතො පරම්මරණා”ති."
            },
            {
                "type": "paragraph",
                "text": "කො නු ඛො භො ගොතම, හෙතු කො පච්චයො යෙන අඤ්ඤතිත්ථියානං පරිබ්බාජකානං එවං පුට්ඨානං එවං ව්යාකරණං හොති: “සස්සතො ලොකොති වා -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාති වා?” කො පන භො ගොතම, හෙතු කො පච්චයො යෙන භොතො ගොතමස්ස එවං පුට්ඨස්ස න එවං ව්යාකරණං හොති: “සස්සතො ලොකොතිපි -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපී”ති?"
            },
            {
                "type": "paragraph",
                "text": "අඤ්ඤතිත්ථියා ඛො වච්ඡ, පරිබ්බාජකා රූපං අත්තතො සමනුපස්සන්ති, රූපවන්තං වා අත්තානං, අත්තනි වා රූපං, රූපස්මිං වා අත්තානං; වෙදනං අත්තතො සමනුපස්සන්ති, -පෙ- සඤ්ඤං -පෙ- සඞ්ඛාරෙ -පෙ- විඤ්ඤාණං අත්තතො සමනුපස්සන්ති, විඤ්ඤාණවන්තං වා අත්තානං, අත්තනි වා විඤ්ඤාණං, විඤ්ඤාණස්මිං වා අත්තානං. තස්මා අඤ්ඤතිත්ථියානං පරිබ්බාජකානං එවං පුට්ඨානං එවං ව්යාකරණං හොති: “සස්සතො ලොකොති වා -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාති වා."
            },
            {
                "type": "page-break",
                "text": "698"
            },
            {
                "type": "paragraph",
                "text": "තථාගතො ච ඛො වච්ඡ, අරහං සම්මාසම්බුද්ධො න රූපං අත්තතො සමනුපස්සති, න රූපවන්තං වා අත්තානං, න අත්තනි වා රූපං, න රූපස්මිං වා අත්තානං. න වෙදනං අත්තතො සමනුපස්සති -පෙ- න සඤ්ඤං -පෙ- න සඞ්ඛාරෙ -පෙ- න විඤ්ඤාණං අත්තතො සමනුපස්සති, න විඤ්ඤාණවන්තං වා අත්තානං, න අත්තනි වා විඤ්ඤාණං, න විඤ්ඤාණස්මිං වා අත්තානං. තස්මා තථාගතස්ස එවං පුට්ඨස්ස න එවං ව්යාකරණං හොති: “සස්සතො ලොකොතිපි -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපී”ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො වච්ඡගොත්තො පරිබ්බාජකො උට්ඨායාසනා යෙනායස්මා මහාමොග්ගල්ලානො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මතා මහාමොග්ගල්ලානෙන සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො වච්ඡගොත්තො පරිබ්බාජකො ආයස්මන්තං මහාමොග්ගල්ලානං එතදවොච: කින්නු ඛො භො මොග්ගල්ලාන, සස්සතො ලොකොති? අව්යාකතං ඛො එතං වච්ඡ, භගවතා, “සස්සතො ලොකො”ති -පෙ- කිං පන භො මොග්ගල්ලාන, නෙව හොති න න හොති තථාගතො පරම්මරණාති? එතම්පි ඛො වච්ඡ, අව්යාකතං භගවතා “නෙව හොති න න හොති තථාගතො පරම්මරණා”ති."
            },
            {
                "type": "paragraph",
                "text": "කො නු ඛො භො මොග්ගල්ලාන, හෙතු කො පච්චයො යෙන අඤ්ඤතිත්ථියානං පරිබ්බාජකානං එවං පුට්ඨානං එවං ව්යාකරණං හොති: “සස්සතො ලොකොති වා -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාති”වා? කො පන භො මොග්ගල්ලාන, හෙතු කො පච්චයො යෙන සමණස්ස ගොතමස්ස එවං පුට්ඨස්ස න එවං ව්යාකරණං හොති: “සස්සතො ලොකොතිපි -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාතිපී”ති?"
            },
            {
                "type": "paragraph",
                "text": "අඤ්ඤතිත්ථියා ඛො වච්ඡ, පරිබ්බාජකා රූපං අත්තතො සමනුපස්සන්ති, රූපවන්තං වා අත්තානං, අත්තනි වා රූපං, රූපස්මිං වා අත්තානං. වෙදනං -පෙ- සඤ්ඤං -පෙ- සඞ්ඛාරෙ -පෙ- විඤ්ඤාණං අත්තතො සමනුපස්සන්ති, විඤ්ඤාණවන්තං වා අත්තානං, අත්තනි වා විඤ්ඤාණං, විඤ්ඤාණස්මිං වා අත්තානං. තස්මා අඤ්ඤතිත්ථියානං පරිබ්බාජකානං එවං පුට්ඨානං එවං ව්යාකරණං හොති: “සස්සතො ලොකොති වා -පෙ- නෙව හොති න න හොති තථාගතො පරම්මරණාති වා.”"
            },
            {
                "type": "page-break",
                "text": "700"
            },
            {
                "type": "paragraph",
                "text": "තථාගතො ච ඛො වච්ඡ, අරහං සම්මාසම්බුද්ධො න රූපං අත්තතො සමනුපස්සති, න රූපවන්තං වා අත්තානං, න අත්තනි වා රූපං, න රූපස්මිං වා අත්තානං. න වෙදනං -පෙ- න සඤ්ඤං -පෙ- න සඞ්ඛාරෙ -පෙ- න විඤ්ඤාණං අත්තතො සමනුපස්සති, න විඤ්ඤාණවන්තං වා අත්තානං, න අත්තනි වා විඤ්ඤාණං, න විඤ්ඤාණස්මිං වා අත්තානං. තස්මා තථාගතස්ස එවං ඵුට්ඨස්ස න එවං ව්යාකරණං හොති: “සස්සතො ලොකොතිපි, අසස්සතො ලොකොතිපි, අන්තවා ලොකොතිපි, අනන්තවා ලොකොතිපි, තං ජීවං තං සරීරන්තිපි, අඤ්ඤං ජීවං අඤ්ඤං සරීරන්තිපි, හොති තථාගතො පරම්මරණාතිපි, න හොති තථාගතො පරම්මරණාතිපි, හොති ච න ච හොති තථාගතො පරම්මරණාතිපි, නෙව හොති න න හොති තථාගතො පරම්මරණාතිපී”ති."
            },
            {
                "type": "paragraph",
                "text": "අච්ඡරියං භො මොග්ගල්ලාන, අබ්භුතං භො මොග්ගල්ලාන, යත්ර හි නාම සත්ථු ච සාවකස්ස ච අත්ථෙනත්ථො ව්යඤ්ජනෙන ව්යඤ්ජනං සංසන්දිස්සති සමෙස්සති න විහායිස්සති යදිදං අග්ගපදස්මිං. ඉදානාහං භො මොග්ගල්ලාන, සමණං ගොතමං උපසඞ්කමිත්වා එතමත්ථං ආපුච්ඡිං. සමණොපි මෙ ගොතමො එතෙහි පදෙහි එතෙහි ව්යඤ්ජනෙහි එතමත්ථං ව්යාකාසි, සෙය්යථාපි භවං මොග්ගල්ලානො. අච්ඡරියං භො මොග්ගල්ලාන, අබ්භුතං භො මොග්ගල්ලාන, යත්ර හි නාම සත්ථු ච සාවකස්ස ච අත්ථෙනත්ථො ව්යඤ්ජනෙන ව්යඤ්ජනං සංසන්දිස්සති සමෙස්සති න විහායිස්සති යදිදං අග්ගපදස්මින්ති."
            },
            {
                "type": "centered",
                "text": "10. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කුතූහලසාලාසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "2284. අථ ඛො වච්ඡගොත්තො පරිබ්බාජකො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො වච්ඡගොත්තො පරිබ්බාජකො භගවන්තං එතදවොච: පුරිමානි භො ගොතම දිවසානි පුරිමතරානි සම්බහුලානං නානාතිත්ථිය{1 නානාතිත්ථියානං සමණබ්රාහ්මණානං පරිබ්බාජිකානං - මඡසං. අඤ්ඤතිත්ථියානං සමණබ්රාහ්මණානං පරිබ්බාජකානං - ස්යා.} සමණබ්රාහ්මණානපරිබ්බාජකානං කුතූහලසාලායං සන්නිසින්නානං සන්නිපතිතානං අයමන්තරා කථා උදපාදි."
            },
            {
                "type": "paragraph",
                "text": "අයං ඛො පූරණො{2 පුරාණො - සී 1, 2.} කස්සපො සඞ්ඝී චෙව ගණී ච ගණාචරියො ච ඤාතො යසස්සි තිත්ථකරො සාධුසම්මතො බහුජනස්ස. සොපි සාවකං අබ්භතීතං කාලකතං උප්පත්තීසු{3 උප්පත්තීසු - මඡසං, ස්යා.} ව්යාකරොති: අසු අමුත්ර උප්පන්නො{4 උප්පන්නො - සී 1, 2.} අසු අමුත්ර උප්පන්නොති. යො{5 සො - සී 1, 2.} පිස්ස සාවකො උත්තමපුරිසො පරමපුරිසො පරමපත්තිපත්තො, තම්පි සාවකං අබ්භතීතං කාලකතං උප්පත්තීසු ව්යාකරොති: අසු අමුත්ර උප්පන්නො, අසු අමුත්ර උප්පන්නොති."
            },
            {
                "type": "page-break",
                "text": "702"
            },
            {
                "type": "paragraph",
                "text": "අයම්පි ඛො මක්ඛලි ගොසාලො -පෙ- අයම්පි ඛො නිගණ්ඨො නාතපුත්තො{1 නාටපුත්තො - මඡසං, ස්යා.} -පෙ- අයම්පි ඛො සඤ්ජයො බෙල්ලට්ඨිපුත්තො{2 බෙලට්ඨ - මඡසං, ස්යා.} -පෙ- අයම්පි ඛො පකුධො කච්චායනො{3 පකුධො - PTS.} -පෙ- අයම්පි ඛො අජිතො කෙසකම්බලො සඞ්ඝී චෙව ගණී ච ගණාචරියො ච ඤාතො යසස්සී තිත්ථකරො සාධුසම්මතො බහුජනස්ස. සොපි සාවකං අබ්භතීතං කාලකතං උපපත්තීසු ව්යාකරොති: අසු අමුත්ර උපපන්නො, අසු අමුත්ර උපපන්නොති. යොපිස්ස සාවකො උත්තමපුරිසො පරමපුරිසො පරමපත්තිපත්තො, තම්පි සාවකං අබ්භතීතං කාලකතං උපපත්තීසු ව්යාකරොති: අසු අමුත්ර උපපන්නො අසු අමුත්ර උපපන්නොති."
            },
            {
                "type": "paragraph",
                "text": "අයම්පි ඛො සමණො ගොතමො සඞ්ඝී චෙව ගණී ච ගණාචරියො ච ඤාතො යසස්සී තිත්ථකරො සාධුසම්මතො බහුජනස්ස. සො’පි සාවකං අබ්භතීතං කාලකතං උපපත්තීසු ව්යාකරොති: අසු අමුත්ර උපපන්නො, අසු අමුත්ර උපපන්නොති. යො පිස්ස සාවකො උත්තමපුරිසො පරමපුරිසො පරමපත්තිපත්තො, තම්පී සාවකං අබ්භතීතං කාලකතං උපපත්තීසු න ව්යාකරොති: අසු අමුත්ර උපපන්නො, අසු අමුත්ර උපපන්නොති. අපි ච ඛො නං එවං ව්යාකරොති: “අච්ඡෙච්ඡි තණ්හං, විවත්තයි{4 වාවත්තයි - අඤ්ඤත්ර} සඤ්ඤොජනං, සම්මා මානාභිසමයා අන්තමකාසි දුක්ඛස්සා”ති. තස්ස මය්හං භො ගොතම අහුදෙව කඞ්ඛා අහු විචිකිච්ඡා කථන්නාම{5 කථඤ්හි නාම - ස්යා, PTS.} සමණස්ස ගොතමස්ස ධම්මො අභිඤ්ඤෙය්යො."
            },
            {
                "type": "paragraph",
                "text": "අලං හි තෙ වච්ඡ, කඞ්ඛිතුං අලං විචිකිච්ඡිතුං. කඞ්ඛනීයෙ ච පන තෙ ඨානෙ විචිකිච්ඡා උප්පන්නා. ස උපාදානස්ස ඛො’හං වච්ඡ උපපත්තිං පඤ්ඤාපෙමි නො අනුපාදානස්ස; සෙය්යථාපි වච්ඡ, අග්ගි සඋපාදානො ජලති, නො අනුපාදානො; එවමෙව ඛො’හං වච්ඡ සඋපාදානස්ස උපපත්තිං පඤ්ඤාපෙමි, නො අනුපාදානස්සාති. යස්මිං පන භො ගොතම සමයෙ අච්චි වාතෙන ඛිත්තා දූරම්පි ගච්ඡති, ඉමස්ස{6 ඉමිස්ස - ස්යා.} පන භවං ගොතමො කිං උපාදානස්මිං පඤ්ඤාපෙතීති. යස්මිං වච්ඡ සමයෙ අච්චි වාතෙන ඛිත්තා දූරම්පි ගච්ඡති, තමහං වාතූපාදානං වදාමි.{7 පඤ්ඤාපෙමි - ස්යා, මඡසං.} වාතොහිස්ස වච්ඡ තස්මිං සමයෙ උපාදානං හොතීති."
            },
            {
                "type": "paragraph",
                "text": "යස්මිඤ්ච පන භො ගොතම, සමයෙ ඉමඤ්ච කායං නික්ඛිපති, සත්තො ච අඤ්ඤතරං කායං අනුපපන්නො{8 අනුප්පන්නො - සී 1, 2.} හොති, ඉමස්ස පන භවං ගොතමො කිං උපාදානස්මිං පඤ්ඤාපෙති? යස්මිං ඛො වච්ඡ සමයෙ ඉමඤ්ච කායං නික්ඛිපති, සත්තො ච අඤ්ඤතරං කායං අනුපපන්නො හොති, තමහං තණ්හූපාදානං වදාමි. තණ්හාහිස්ස වච්ඡ, තස්මිං සමයෙ උපාදානං හොතීති."
            },
            {
                "type": "page-break",
                "text": "704"
            },
            {
                "type": "centered",
                "text": "10. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අත්ථත්තසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "2285. අථ ඛො වච්ඡගොත්තො පරිබ්බාජකො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො වච්ඡගොත්තො පරිබ්බාජකො භගවන්තං එතදවොච: කින්නු ඛො භො ගොතම, අත්ථත්තාති. එවං වුත්තෙ භගවා තුණ්හී අහොසි. කිං පන භො ගොතම, නත්ථත්තාති. දුතියම්පි ඛො භගවා තුණ්හී අහොසි. අථ ඛො වච්ඡගොත්තො පරිබ්බාජකො උට්ඨායාසනා පක්කාමි. අථ ඛො ආයස්මා ආනන්දො අචිරපක්කන්තෙ වච්ඡගොත්තෙ පරිබ්බාජකෙ භගවන්තං එතදවොච: කින්නු ඛො භන්තෙ භගවා වච්ඡගොත්තස්ස පරිබ්බාජකස්ස පඤ්හං පුට්ඨො න ව්යාකාසීති."
            },
            {
                "type": "paragraph",
                "text": "අහඤ්ච ආනන්ද, වච්ඡගොත්තස්ස පරිබ්බාජකස්ස අත්ථත්තාති පුට්ඨො සමානො අත්ථත්තාති ව්යාකරෙය්යං, යෙ තෙ ආනන්ද, සමණබ්රාහ්මණා සස්සතවාදා, තෙසමෙතං ලද්ධි අභවිස්ස. අහඤ්ච ආනන්ද, වච්ඡගොත්තස්ස පරිබ්බාජකස්ස නත්ථත්තාති පුට්ඨො සමානො නත්ථත්තාති ව්යාකරෙය්යං, යෙ තෙ ආනන්ද, සමණබ්රාහ්මණා උච්ඡෙදවාදා, තෙසමෙතං ලද්ධි අභවිස්ස. අහඤ්ච ආනන්ද, වච්ඡගොත්තස්ස පරිබ්බාජකස්ස අත්ථත්තාති පුට්ඨො සමානො අත්ථත්තාති ව්යාකරෙය්යං, අපිනු මෙතං ආනන්ද, අනුලොමං අභවිස්ස ඤාණස්ස උප්පාදාය. සබ්බෙ ධම්මා{1 උපාදාය සබ්බො ධම්මො - සී 1, 2.} අනත්තාති. නො හෙතං භන්තෙ. අහඤ්ච ආනන්ද{2 අහඤ්චානන්ද - සීමු, 1, 2.} වච්ඡගොත්තස්ස පරිබ්බාජකස්ස නත්ථත්තාති පුට්ඨො සමානො නත්ථත්තාති ව්යාකරෙය්යං, සම්මූළ්හස්ස ආනන්ද, වච්ඡගොත්තස්ස පරිබ්බාජකස්ස භිය්යො සම්මොහාය අභවිස්ස: අහුවා මෙ නූන පුබ්බෙ අත්තා, සො එතරහි නත්ථීති."
            },
            {
                "type": "centered",
                "text": "10. 1. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සභියසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "2286. එකං සමයං ආයස්මා සභියො කච්චානො ඤාතිකෙ විහරති ගිඤ්ජකාවසථෙ. අථ ඛො වච්ඡගොත්තො පරිබ්බාජකො යෙනායස්මා සභියො කච්චානො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මතා සභියෙන කච්චානෙන සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො වච්ඡගොත්තො පරිබ්බාජකො ආයස්මන්තං සභියං කච්චානං එතදවොච:"
            },
            {
                "type": "page-break",
                "text": "706"
            },
            {
                "type": "paragraph",
                "text": "කින්නු ඛො භො කච්චාන හොති තථාගතො පරම්මරණාති. අව්යාකතං ඛො එතං වච්ඡ, භගවතා “හොති තථාගතො පරම්මරණා”ති. කිං පන භො කච්චාන න හොති තථාගතො පරම්මරණාති. එතම්පි ඛො වච්ඡ අව්යාකතං භගවතා “න හොති තථාගතො පරම්මරණා”ති. කින්නු ඛො භො කච්චාන හොති ච න ච හොති තථාගතො පරම්මරණාති. අව්යාකතං ඛො එතං වච්ඡ භගවතා “හොති ච න ච හොති තථාගතො පරම්මරණා”ති. කිං පන භො කච්චාන නෙව හොති න න හොති තථාගතො පරම්මරණාති එතම්පි ඛො වච්ඡ අව්යාකතං භගවතා “නෙව හොති න න හොති තථාගතො පරම්මරණා”ති."
            },
            {
                "type": "paragraph",
                "text": "කින්නු ඛො භො කච්චාන, හොති තථාගතො පරම්මරණාති ඉති පුට්ඨො සමානො අව්යාකතං ඛො එතං වච්ඡ භගවතා “හොති තථාගතො පරම්මරණා”ති වදෙසි. කිං පන භො කච්චාන, න හොති තථාගතො පරම්මරණාති ඉති පුට්ඨො සමානො එතම්පි ඛො වච්ඡ, අව්යාකතං භගවතා “න හොති තථාගතො පරම්මරණා”ති වදෙසි. කින්නු ඛො භො කච්චාන, හොති ච න ච හොති තථාගතො පරම්මරණාති ඉති පුට්ඨො සමානො අව්යාකතං ඛො එතං වච්ඡ භගවතා “හොති ච න ච හොති තථාගතො පරම්මරණා”ති වදෙසි. කිං පන භො කච්චාන, නෙව හොති න න හොති තථාගතො පරම්මරණාති ඉති පුට්ඨො සමානො එතම්පි ඛො වච්ඡ අව්යාකතං භගවතා: “නෙව හොති න න හොති තථාගතො පරම්මරණා”ති වදෙසි. කො නු ඛො භො කච්චාන හෙතු කො පච්චයො යෙන තං අව්යාකතං සමණෙන ගොතමෙනාති."
            },
            {
                "type": "paragraph",
                "text": "යො ච ආවුසො,{1 වච්ඡ - මඡසං.} හෙතු යො ච පච්චයො පඤ්ඤාපනාය: රූපීති වා අරූපීති වා සඤ්ඤීති වා අසඤ්ඤීති වා නෙවසඤ්ඤීනාසඤ්ඤීති වා, සො ච හෙතු සො ච පච්චයො සබ්බෙන සබ්බං සබ්බථා සබ්බං අපරිසෙසං නිරුජ්ඣෙය්ය. කෙන නං පඤ්ඤාපයමානො පඤ්ඤාපෙය්ය, “රූපීති වා අරූපීති වා සඤ්ඤීති වා අසඤ්ඤීති වා නෙවසඤ්ඤීති නාසඤ්ඤීති වා”ති. [පි.708] "
            },
            {
                "type": "paragraph",
                "text": "කීවචිරං පබ්බජිතො’සි භො කච්චානාති න චිරං ආවුසො, තීණි වස්සානීති. යස්සපස්ස ආවුසො, එතමෙත්තකෙන එත්තකමෙව තම්පස්ස බහු. කො පන වාදො එව{2 එවං - ස්යා, මඡසං.} අභික්කන්තෙති."
            },
            {
                "type": "centered",
                "text": "අව්යාකතවග්ගො පඨමො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "ඛෙමා අනුරාධොපගතං සමුදය පෙම ආරාමං,\nආයතන ඛන්ධං කුතුහලසාලා අත්ථත්තො සහියෙන චාති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "අබ්යාකතසංයුත්තං සමත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**සළායතනවග්ගෙ සංයුත්ත උද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "සළායතන වෙදනා මාතුගාමො ජම්බුඛාදකො\nසාමණ්ඩො මොග්ගල්ලානො චිත්තො ගාමණී සඞ්ඛතං අබ්යාකතන්ති",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "දසබලසෙලප්පභවා නිබ්බානමහාසමුද්දපරියන්තා\nඅට්ඨඞ්ග මග්ගසලිලා ජිනවචනනදී චිරං වහතූති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "සළායතනවග්ගො නිට්ඨිතො.",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ],
        "pages": {
            "668": {
                "pageNum": 668,
                "footnotesCount": 3
            },
            "670": {
                "pageNum": 670,
                "footnotesCount": 7
            },
            "672": {
                "pageNum": 672,
                "footnotesCount": 0
            },
            "674": {
                "pageNum": 674,
                "footnotesCount": 0
            },
            "676": {
                "pageNum": 676,
                "footnotesCount": 3
            },
            "678": {
                "pageNum": 678,
                "footnotesCount": 0
            },
            "680": {
                "pageNum": 680,
                "footnotesCount": 5
            },
            "682": {
                "pageNum": 682,
                "footnotesCount": 0
            },
            "684": {
                "pageNum": 684,
                "footnotesCount": 0
            },
            "686": {
                "pageNum": 686,
                "footnotesCount": 0
            },
            "688": {
                "pageNum": 688,
                "footnotesCount": 0
            },
            "690": {
                "pageNum": 690,
                "footnotesCount": 2
            },
            "692": {
                "pageNum": 692,
                "footnotesCount": 1
            },
            "694": {
                "pageNum": 694,
                "footnotesCount": 0
            },
            "696": {
                "pageNum": 696,
                "footnotesCount": 0
            },
            "698": {
                "pageNum": 698,
                "footnotesCount": 0
            },
            "700": {
                "pageNum": 700,
                "footnotesCount": 5
            },
            "702": {
                "pageNum": 702,
                "footnotesCount": 8
            },
            "704": {
                "pageNum": 704,
                "footnotesCount": 2
            },
            "706": {
                "pageNum": 706,
                "footnotesCount": 2
            }
        }
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "669"
            },
            {
                "text": "10. අඛ්‍යාකත සංයුක්තය",
                "type": "heading",
                "level": 3
            },
            {
                "text": "1. අබ්‍යාකත වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "10. 1. 11.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "ඛෙමා සූත්‍රය",
                "level": 1
            },
            {
                "text": "2276. එක්කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයෙහි ජේතවන නම් අනේපිඬු සිටුහුගේ අරම්හි වැඩ වසන සේක. එසමයෙහි ඛෙමා මෙහෙණ කොසොල් දනව්වෙහි සැරිසරන්නී සැවැත්නුවරටත්, සාකෙතනුවරටත් අතර තොරණවත්ථුගම්හි විසීමට පැමිණියා වෙයි. එකල්හි පසේනදී කොසොල්රජ සාකේතයෙන් සැවැතට යන්නේ සාකේතයටත්, සැවතටත් අතර තොරණවත්ථුගම්හි එක්රැයක් විසීමට පැමිණියේ ය. එකල පසේනදී කොසොල් රජ එක්තරා පුරුෂයකු ඇමතී ය. එම්බල පුරුෂය “එව මම අද යමකු ඇසුරු කරන්නෙම් නම් තෝ එබඳු මහණකු හෝ බමුණකු හෝ තොරණවත්ථුවෙහි දනුව”යි.",
                "type": "paragraph"
            },
            {
                "text": "එසේ ය දේවයන් වහන්සැ යි ඒ පුරිස් තෙමේ පසේනදී කොසොල් රජුට පිළිතුරු දී මුළු තොරණවත්ථුවෙහි ඇවිදින්නේ පසේනදි කොසොල් රජ යමකු ඇසුරු කරන්නේ නම් එබඳු මහණකු හෝ බමුණකු හෝ නො දැක්කේය. ඒ පුරිස් තෙමේ තොරණවත්ථුවෙහි වාසයට එළඹි ඛෙමා මෙහෙණ දිටී. දැක පසේනදි කොසොල් රජු වෙත එළඹියේ ය. එළඹ පසේනදි කොසොල් රජහට මෙය සැලකෙළේ ය: “දේවයන් වහන්ස, දේවයන් වහන්සේ යමකු ඇසුරු කරන සේක් නම් එබඳු මහණෙක් හෝ බමුණෙක් හෝ තොරණවත්ථුවෙහි නැත. දේවයන් වහන්ස, ඒ භාග්‍යවත් අර්හත් සම්මාසම්බුදුරජාණන් වහන්සේගේ ශ්‍රාවිකා වූ ඛෙමා නම් මෙහෙණක් ඇත. ‘පණ්ඩිත ය ව්‍යක්ත ය නුවණැත්තීය බහුශ්‍රැත ය විසිතුරු කතා ඇත්තී ය. මැනවින් වැටහෙන නුවණ ඇත්තී ය’යි ඒ ආර්‍ය්‍යාවගේ මෙබඳු කලණ කිතුගොසෙක් පැන නැංගේ ය. දේවයන් වහන්සේ ඇය ඇසුරු කරන සේක්වා යි.",
                "type": "paragraph"
            },
            {
                "text": "එකල්හි පසේනදී කොසොල් රජ ඛෙමා මෙහෙණ වෙත එළඹියේ ය. එළඹ ඛෙමා මෙහෙණ වැඳ එකත්පස් ව හුන්නේ ය. එකත්පස් ව හුන් පසේනදි කොසොල්රජ ඛේමා මෙහෙණහට මෙය කී ය: ආර්‍ය්‍යාවෙනි, කිමෙක් ද සත්ත්වයා මරණින් මතු වේ දැ යි. මහරජ සත්ත්වයා මරණින් මතු වෙයි යන මෙය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි. ආර්‍ය්‍යාවෙනි කිමෙක් ද, සත්ත්වයා මරණින් මතු නො වේ දැ යි. මහරජ සත්ත්වයා මරණින් මතු නො වෙයි යන මෙ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි. ආර්‍ය්‍යාවෙනි කිමෙක් ද සත්ත්වයා මරණින් මතු වෙයි, නො ද වේ දැ යි.මහරජ සත්ත්වයා මරණින් මතු වෙයි, නො ද වෙයි යන මෙ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි. ආර්‍ය්‍යාවෙනි කිමෙක් ද සත්ත්වයා මරණින් මතු නො ම වෙයි, නො ම නො වේ දැ යි. මහරජ සත්ත්වයා මරණින් මතු නොම වෙයි, නො ම නො වෙයි යන මෙ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "671"
            },
            {
                "text": "ආර්‍ය්‍යාවෙනි, කිමෙක් ද සත්ත්වයා මරණින් මතු වේ දැ යි මෙසේ පුළුවුස්නා ලද්දී සත්ත්වයා මරණින් මතු වෙයි යන මෙය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදැ යි කියහි, ආර්‍ය්‍යාවෙනි කිමෙක් ද සත්ත්වයා මරණින් මතු නො වේ දැ යි මෙසේ පුළුවුස්නා ලද්දී මහරජ සත්ත්වයා මරණින් මතු නො වෙයි යන මෙ ද භාග්‍යවතුන් වහන්සේ විසින් නොවදාරන ලදැයි කියහි, ආර්‍ය්‍යාවෙනි, කිමෙක් ද සත්ත්වයා මරණින් මතු වෙයි නො ද වේ ද යි මෙසේ පුළුවුස්නා ලද්දී මහරජ සත්ත්වයා මරණින් මතු වෙයි නො ද වෙයි යන මෙ ද භාග්‍යවතුන් වහන්සේ විසින් නොවදාරන ලදැ යි කියහි. ආර්‍ය්‍යාවෙනි, කිමෙක් ද? සත්ත්වයා මරණින් මතු නො ම වෙයි නො ම නො වේ දැ යි මෙසේ පුළුවුස්නා ලද්දී මහරජ සත්ත්වයා මරණින් මතු නො ම වෙයි නො ම නො වෙයි යන මෙ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදැ යි කියහි. ආර්‍ය්‍යාවෙනි යම්හෙයකින් එය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලද්දේ නම් එයට හේතු කිම? ප්‍රත්‍යය කිමැ?යි.",
                "type": "paragraph"
            },
            {
                "text": "මහරජ එසේ වී නම් මෙහි ලා තොප ම පුළුවුස්නෙමි. යම් සේ තොපට වැටහෙන්නේ නම් එසේ එය විසඳන්නහු ය.",
                "type": "paragraph"
            },
            {
                "text": "මහරජ ඒ කිමැ යි හඟිවු ද? යමෙක් “වැලි මෙතෙකැ යි හෝ වැලි මෙතෙක් සියයකැ යි හෝ වැලි මෙතෙක් දහසකැ යි හෝ වැලි මෙතෙක් සියදහසකැ” යි හෝ ගංගා නදියෙහි වැලි ගණින්නට පොහොනේ නම් එබඳු කිසි ගණන් කරන්නෙක් හෝ මුද්‍රා තබන්නෙක් හෝ පිඬුගණන් දක්වන්නෙක් හෝ තොපට ඇද්දැ යි. ආර්‍ය්‍යාවෙනි මෙය නො වේ ම ය. යමෙක් “දිය ලාස් මෙතෙකැයි හෝ දිය ලාස් මෙතෙක් සියයකැ යි හෝ දිය ලාස් මෙතෙක් දහසකැ යි හෝ දිය ලාස් මෙතෙක් සියදහසකැ”යි හෝ මහමුහුදෙහි දිය මනින්නට පොහොනේ නම් එබඳු කිසි ගණන් කරන්නෙක් හෝ මුද්‍රා තබන්නෙක් හෝ පිඬුගණන් දක්වන්නෙක් හෝ තොපට ඇද්දැ යි. ආර්‍ය්‍යාවෙනි මෙය නො වේ ම ය. ඒ කවර හෙයින යත්: ආර්‍ය්‍යාවෙනි මුහුද මහත් ය. ගැඹුරු ය. නො පමණ ය. නො බැසගත හැක්කේ යි.",
                "type": "paragraph"
            },
            {
                "text": "මහරජ එසෙයින් ම පනවන්නෙක් යම් රූපයෙකින් සත්ත්වයා පනවන්නේ නම් ඒ රූපය තථාගතයන් වහන්සේට ප්‍රහීණ ය. උසුන් මුල් ඇත්තේ ය. හිස් සුන් තල්රුකක් මෙන් කරන ලද්දේ ය. නැවත නොහටගන්නා බව කරන ලද්දේ ය. මතු නූපදනා ස්වභාව ඇත්තේ ය. මහරජ, තථාගතයන් වහන්සේ රූ පැනවීමෙන් මිදුණහ, ගැඹුරුවහ, නොපමණයහ, නොබැසගත හැකියහ, මහසමුදුර මෙනි, සත්ත්වයා මරණින් මතු වේ යයි පැනවීමට ද නො පැමිණෙති, සත්ත්වයා මරණින් මතු නො වේ යයි පැනවීමට ද නො පැමිණෙති, සත්ත්වයා මරණින් මතු වෙයි නො ද වේ යයි පැනවීමට ද නො පැමිණෙති, සත්ත්වයා මරණින් මතු නො ම වෙයි නො ම නො වේ යයි පැනවීමට ද නො පැමිණෙති.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "673"
            },
            {
                "text": "පනවන්නෙක් යම් වේදනාවකින් සත්ත්වයා පනවන්නේ නම්, ඒ වේදනාව තථාගතයන් වහන්සේට ප්‍රහීණ ය, උසුන් මුල් ඇත්තී ය, හිස්සුන් තල්ගසක් මෙන් කරන ලද්දී ය, නැවත නො හටගන්නා බව කරන ලද්දී ය, මතු නූපදනා ස්වභාව ඇත්තී ය. මහරජ තථාගතයන් වහන්සේ විඳුම් පැනවීමෙන් මිදුණහ, ගැඹුරුවහ, නො පමණයහ, නො බැසගත හැක්කහ, මහසමුදුර මෙනි, සත්ත්වයා මරණින් මතුවේ යයි පැනවීමට ද නො පැමිණෙති, සත්ත්වයා මරණින් මතු නො වේ ය යි පැනවීමට ද නො පැමිණෙති, සත්ත්වයා මරණින් මතු වෙයි නො ද වේ යයි පැනවීමට ද නො පැමිණෙති, සත්ත්වයා මරණින් මතු නො ම වෙයි නො ම නො වේ ය යි පැනවීමට ද නො පැමිණෙති. යම් සංඥාවකින් සත්ත්වයා ....",
                "type": "paragraph"
            },
            {
                "text": "පනවන්නෙක් යම් සංස්කාර කෙනකුන්ගෙන් සත්ත්වයා පනවන්නේ නම් ඒ සංස්කාරයෝ තථාගතයන් වහන්සේට ප්‍රහීණ ය, උසුන් මුල් ඇතියහ, හිස්සුන් තල්ගසක් මෙන් කරන ලදහ, නැවත නොහට ගන්නා බව කරන ලදහ, මතු නූපදනා ස්වභාව ඇතියහ. මහරජ තථාගතයන් වහන්සේ සංස්කාර පැනවීමෙන් මිදුණහ, ගැඹුරුවහ, නොපමණයහ, නොබැස ගත හැක්කහ, මහසමුදුර මෙනි. සත්ත්වයා මරණින් මතු වේ යයි පැනවීමට ද නො පැමිණෙති, සත්ත්වයා මරණින් මතු නො වේ යයි පැනවීමට ද නො පැමිණෙති, සත්ත්වයා මරණින් මතු වෙයි නො ද වේ යි පැනවීමට ද නො පැමිණෙති, සත්ත්වයා මරණින් මතු නො ම වෙයි නො ම නො වේ යි පැනවීමට ද නො පැමිණෙති.",
                "type": "paragraph"
            },
            {
                "text": "පනවන්නෙක් යම් විඥානයෙකින් සත්ත්වයා පනවන්නේ නම් ඒ විඥානය තථාගතයන් වහන්සේට ප්‍රහීණ ය, උසුන් මුල් ඇත්තේ ය, හිස්සුන් තල්ගසක් මෙන් කරන ලද්දේ ය, නැවත නොහටගන්නා බව කරන ලද්දේ ය, මතු නූපදනා ස්වභාව ඇත්තේ ය, මහරජ තථාගතයන් වහන්සේ විඥාන පැනවීමෙන් මිදුණහ, ගැඹුරුවහ, නොපමණයහ, නොබැස ගත හැක්කහ, මහසමුදුර මෙනි. සත්ත්වයා මරණින් මතු වේ යි පැනවීමට ද නො පැමිණෙති, සත්ත්වයා මරණින් මතු නො වේ යි පැනවීමට ද නො පැමිණෙති, සත්ත්වයා මරණින් මතු වේ  නො ද වේ යි පැනවීමට ද නො පැමිණෙති, සත්ත්වයා මරණින් මතු නො ම වේ නො ම නො වේ යි පැනවීමට ද නො පැමිණෙති යි.",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති පසේනදි කොසොල් රජ ඛෙමා මෙහෙණගේ දේශනාව පිළිගෙන අනුමෝදන් ව හුනස්නෙන් නැඟී ඛෙමා මෙහෙණ වැඳ පැදකුණු කොට ගියේ ය. එකල්හි පසේනදි කොසොල් රජ පසු කලෙක භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පස් ව හුන්නේ ය. එකත්පස් ව හුන් පසේනදි කොසොල් රජ භාග්‍යවතුන් වහන්සේට මෙය සැලකළේ ය: “වහන්ස, කිමෙක් ද සත්ත්වයා මරණින් මතු වේ දැ” යි. මහරජ සත්ත්වයා මරණින් මතු වේ” යි මෙය මවිසින් නො පවසන ලදි. වහන්ස කිමෙක් ද, සත්ත්වයා මරණින් මතු නො වේ දැ යි. මහරජ සත්ත්වයා මරණින් මතු නො වේය යි ද මා විසින් නො පවසන ලදි ... ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "675"
            },
            {
                "text": "වහන්ස, කිමෙක් ද සත්ත්වයා මරණින් මතු වේ දැ යි මෙසේ පුළුවුස්නා ලද්දාහු මහරජ සත්ත්වයා මරණින් මතු වේ යයි මෙය මවිසින් නො පවසන ලදැ යි වදාරවු ... වහන්ස කිමෙක් ද සත්ත්වයා මරණින් මතු නො ම වේ නො ම නො වේ දැ යි මෙසේ පුළුවුස්නා ලද්දාහු මහරජ, සත්ත්වයා මරණින් මතු නො ම වේ නො ම නො වේය යි එ ද මවිසින් නොපවසන ලදැ යි වදාරවු. වහන්ස, යම් හෙයෙකින් භාග්‍යවතුන් වහන්සේ විසින් එය නො වදාරන ලද්දේ නම් එයට හේතු කිම ප්‍රත්‍යය කිමැ යි.",
                "type": "paragraph"
            },
            {
                "text": "මහරජ එසේ වී නම් මෙහි ලා තොප ම පුළුවුස්නෙමි. යම් සේ තොපට වැටහෙන්නේ නම් එසේ එය විසඳන්නහු ය. මහරජ ඒ කිමැ යි හඟිහි ද? යමෙක් ගංගානදියෙහි වැලි මෙතෙකැ යි හෝ ... වැලි මෙතෙක් සියදහසෙකැ යි හෝ ගණින්නට පොහොනේ නම් එබඳු කිසි ගණන් කරන්නෙක් හෝ මුද්‍රා ගණනායෙහි කුශලයෙක් හෝ පිඬුගණන් දක්වන්නෙක් හෝ තොපට ඇද්දැ යි. වහන්ස මෙය නො වේ ම ය. යමෙක් මහ මුහුදෙහි දිය ලහසු මෙතකැ යි හෝ … දිය ලහසු මෙතෙක් සියදහසකැ යි හෝ දිය පමණ කරන්නට පොහෝනේ නම් එබඳු කිසි ගණන් කරන්නෙක් හෝ මුද්‍රා ගණකයෙක් හෝ පිඬුගණන් දක්වන්නෙක් හෝ තොපට ඇද්දැ? යි. වහන්ස මෙය නො වේ ම ය. ඒ කවර හෙයින් ද? වහන්ස මුහුද විශාල ය, ගැඹුරු ය, නොපමණ ය. නො බැස ගත හැක්කේ යි.",
                "type": "paragraph"
            },
            {
                "text": "“මහරජ එසෙයින් ම පනවන්නෙක් යම්රුවෙකින් සත්ත්වයා පනවන්නේ නම් ඒ රූව තථාගතයන්ට ප්‍රහීණ ය, උසුන්මුල් ඇත්තේ ය, හිස්සුන් තල් ගසක් මෙන් කරන ලද්දේ ය, නැවත නොහටගන්නා බව කරන ලද්දේ ය, මතු නූපදනා ස්වභාව ඇත්තේ ය. මහරජ තථාගත රූ පැනවීමෙන් මිදුණේ ය, ගැඹුරු ය, නොපමණ ය, නොබැසගත හැක්කේ ය, මහමුහුද මෙනි, සත්ත්වයා මරණින් මතු වේය යි පැනවීමට ද නො පැමිණෙයි ... සත්ත්වයා මරණින් මතු නො ම වේ නො ම නො වේය යි පැනවීමට ද නො පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "text": "යම් වේදනාවකින් ... යම් සංඥාවකින් ... යම් සංස්කාර කෙනකුන්ගෙන් ... පනවන්නෙක් යම් විඥානයෙකින් සත්ත්වයා පනවන්නේ නම් ඒ විඥානය තථාගතයන්ට ප්‍රහීණ ය, උසුන්මුල් ඇත්තේ ය, හිස්සුන් තල්ගසක් මෙන් කරන ලද්දේ ය, නැවත නොහටගන්නා බව කරන ලද්දේ ය, මතු නූපදනා ස්වභාව ඇත්තේ ය. මහරජ, තථාගත තෙමේ විඥාන පැනවීමෙන් මිදුණේ ය, ගැඹුරු ය, නො පමණ ය, නොබැස ගත හැක්කේ ය, මහමුහුද මෙනි, සත්ත්වයා මරණින් මතු වේය යි පැනවීමට ද නො පැමිණෙයි ... සත්ත්වයා මරණින් මතු නො ම වේ නො ම නො වේය යි පැනවීමට ද නො පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "677"
            },
            {
                "text": "වහන්ස අසිරියෙකි, වහන්ස අද්භූත ය. යම්හෙයෙකින් දේශනායෙහි ලා ශාස්තෲන් වහන්සේගේ ද ශ්‍රාවිකාවගේ ද අර්ථයෙන් අර්ථය ව්‍යඤ්ජනයෙන් ව්‍යඤ්ජනය සැසඳේ ද සමවේ ද විරුද්ධ නො වේ ද (එහෙයිනි). වහන්ස, එක්සමයක මම ඛෙමා මෙහෙණ වෙත එළඹ මේ අරුත පිළිවිසීමි. ඒ ආර්‍ය්‍යාව ද භාග්‍යවතුන් වහන්සේ මෙන් මේ පදවලින් මේ ව්‍යඤ්ජනවලින් මේ අර්ථය මට පැවසුවා ය. වහන්ස අසිරියෙකි, වහන්ස අද්භූත ය. යම් හෙයෙකින් දෙශනායෙහි ලා ශාස්තෲන් වහන්සේගේ ද ශ්‍රාවිකාවගේත් අර්ථයෙන් අර්ථය ව්‍යඤ්ජනයෙන් ව්‍යඤ්ජනය සැසඳේ ද සම වේ ද විරුද්ධ නො වේ ද (එහෙයිනි). වහන්ස අපි දැන් යම්හ, අපි බොහෝ කිස ඇත්තමෝ බොහෝ කටයුතු ඇත්තමෝ වම්හ යි. මහරජ තෙපි දැන් ඒ සඳහා කල් දැන යි. එකල්හි පසේනදි කොසොල් රජ භාග්‍යවතුන් වහන්සේගේ දේශනාව පිළිගෙන අනුමොදන් ව හුනස්නෙන් නැගී භාග්‍යවතුන් වහන්සේ වැඳ පැදකුණු කොට ගියේ ය.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "10. 1. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනුරාධ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "2277. එක්කලෙක භාග්‍යවතුන් වහන්සේ විසල්පුර සමීපයෙහි මහවෙනෙහි කූටාගාරශාලායෙහි වැඩවසන සේක. එසමයෙහි ආයුෂ්මත් අනුරාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට නුදුරෙහි වනකිළියෙක වෙසෙති. එකල්හි බොහෝ වූ අන්තොටු පිරිවැජ්ජෝ ආයුෂ්මත් අනුරාධ තෙරුන් වෙත එළඹියහ. එළඹ ආයුෂ්මත් අනුරාධ තෙරුන් සමඟ සතුටු වූහ. සතුටු විය යුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පස්ව හුන්හ. එකත්පස් ව හුන් ඒ අන්තොටු පිරිවැජ්ජෝ ආයුෂ්මත් අනුරාධ තෙරුන්ට මෙය කීහ: ඇවැත්නි, අනුරාධයෙනි, උත්තමපුරුෂ වූ පරමපුරුෂ වූ ශ්‍රේෂ්ඨ ප්‍රාප්තියට පැමිණි යම් ඒ සත්ත්වයෙක් වේ නම් තථාගත තෙමේ ඔහු පනවන්නේ “සත්ත්වයා මරණින් මතු වේ යයි හෝ සත්ත්වයා මරණින් මතු නො වේ යයි හෝ සත්තවයා මරණින් මතු වේ නො ද වේ යි හෝ සත්ත්වයා මරණින් මතු නො ම වේ නො ම නොවේ යයි හෝ යන මේ සිවුකරුණෙහි ලා පනවා දැ” යි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි උත්තම පුරුෂ වූ පරම පුරුෂ වූ ශ්‍රේෂ්ඨප්‍රාප්තියට පැමිණි යම් ඒ සත්ත්වයෙක් වේ නම් ඔහු පනවන තථාගතයන් වහන්සේ සත්ත්වයා මරණින් මතු වේ යයි හෝ සත්ත්වයා මරණින් මතු නො වේ යයි හෝ සත්තවයා මරණින් මතු වේ නො ද වේ යයි හෝ සත්ත්වයා මරණින් මතු නොම වේ නොම නො වේ යයි හෝ” යන මේ සිවු කරුණෙන් වෙන්ව පනවන සේකැයි. මෙසේ කීකල් හි ඒ අන්තොටු පිරිවැජ්ජෝ ආයුෂ්මත් අනුරාධ තෙරණුවන්ට මෙය කීහ: මේ මහණ අලුත පැවිදි වූ නවකයෙක් වන. මහලු වූයේ ද බාලයෙක, අව්‍යත්තයෙකැ යි. ඉක්බිති ඒ අන්තොටු පිරිවැජ්ජෝ නවකවාදයෙනුත් බාලවාදයෙනුත් ආයුෂ්මත් අනුරාධ තෙරුන්ට අවමන් කොට හුනස්නෙන් නැගී ගියහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "679"
            },
            {
                "text": "ඉක්බිති ඒ අන්තොටු පිරිවැජ්ජන් ගිය නොබෝ වේලාවෙකින් ආයුෂ්මත් අනුරාධ තෙරුන්ට මෙබඳු සිතෙක් විය: ඉඳින් ඒ අන්තොටු පිරිවැජ්ජෝ මතු මා පැන පුළුවුස්නාහු නම් මම ඒ අන්තොටු පිරිවැජ්ජන්ට කෙසේ විසඳන්නෙම් භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දක් කියන්නෙකු වන්නෙම් ද, භාග්‍යවතුන් වහන්සේට අභූතයෙන් නො ද ගරහා කියන්නෙම් ද, දහමට ද අනුදහමක් පවසන්නෙම් ද කරුණු සහිත කිසිවාදානුවාදයෙක් ගැරහියයුතු තැනට නො ද පැමිණෙන්නේ දැ යි. ඉක්බිති ආයුෂ්මත් අනුරාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පස්ව හුන්හ: එකත්පස් ව හුන් ආයුෂ්මත් අනුරාධ තෙරණුවෝ භාග්‍යවතුන් වහස්සේට මෙය සැලකළහ.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, මෙහි මම භාග්‍යවතුන් වහන්සේට නුදුරෙහි වනකිළියක වෙසෙමි. වහන්ස, එකල්හි බොහෝ වූ අන්තොටු පිරිවැජ්ජෝ මා වෙත එළඹියහ. එළඹ මා සමඟ සතුටු වූහ. සතුටු වියයුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පස් ව හුන්හ. වහන්ස එකත්පස්ව හුන් අන්තොටු පිරිවැජ්ජෝ මට මෙය කීහ: ඇවැත්නි, අනුරාධයෙනි, උත්තම පුරුෂ වූ පරම පුරුෂ වූ ශ්‍රේෂ්ඨප්‍රාප්තියට පැමිණි යම් මේ සත්ත්වයෙක් වේ නම් ඔහු පනවන තථාගත තෙමේ “සත්ත්වයා මරණින් මතු වේ යයි හෝ ... සත්ත්වයා මරණින් මතු නොම වේ නොම නො වේ යයි” හෝ යන මේ සිවු කරුණෙහි ලා පනවා දැ යි. වහන්ස, එසේ කී කල්හි ඒ අන්තොටු පිරිවැජ්ජන්ට මම මෙය කීයෙමි. ඇවැත්නි උත්තම පුරුෂ වූ පරමපුරුෂ වූ ශ්‍රෙෂ්ඨ ප්‍රාප්තියට පැමිණි යම් මේ සත්ත්වයෙක් වේ නම් ඔහු පනවන තථාගතයන් වහන්සේ “සත්ත්වයා මරණින් මතු වේයයි හෝ සත්ත්වයා මරණින් මතු නො ම වේ යයි ... නො ම නො වේ යයි” හෝ යන මේ සිවු කරුණෙන් වෙන්ව පනවති යි.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස මෙසේ කී කල්හි ඒ අන්තොටු පිරිවැජ්ජෝ මට මෙය කීහ. ‘මේ මහණ අලුත පැවිදි වූ නවකයෙක් වන. මහලු වූයේ නමුත් බාලයෙක, අව්‍යක්තයෙකැ’යි. වහන්ස ඉක්බිති ඒ අන්තොටු පිරිවැජ්ජෝ නවක වාදයෙනුත්, බාල වාදයෙනුත් මට අවමන් කොට හුනස්නෙන් නැඟී ගියහ. වහන්ස, ඒ අන්තොටු පිරිවැජ්ජන් ගිය නොබෝ වේලාවකින් මට මෙබඳු සිතෙක් විය: ඉඳින් ඒ අන්තොටු පිරිවැජ්ජෝ මතු මා පැන පුළුවුස්නාහු නම්, මම ඒ අන්තොටු පිරිවැජ්ජන්ට කෙසේ විසඳන්නෙම් භාග්‍යවතුන් වහන්සේ විසින් වදාරණ ලද්දක් කියන්නෙකුත් වන්නෙම් ද, භාග්‍යවතුන් වහන්සේට අභූතයෙන් නො ද ගරහා කියන්නෙම් ද, දහමට ද අනුදහමක් පවසන්නෙම් ද, කරුණු සහිත කිසි වාදානුවාදයෙක් ගැරහිය යුතු තැනට නො ද පැමිණෙන්නේ දැ? යි.",
                "type": "paragraph"
            },
            {
                "text": "අනුරාධ, ඒ කිමැයි හඟිවු ද? රූප නිත්‍ය වේ ද, නොහොත් අනිත්‍ය වේ දැ යි. වහන්ස අනිත්‍ය ය. යමක් අනිත්‍ය වේ නම්, එය දුක් වේ ද, නොහොත් සුව වේ දැ යි. වහන්ස දුක් වෙයි. යමක් අනිත්‍ය වේ නම්, දුක් නම්, වෙනස් වන සුලු නම් තෙල ‘මෙය මාගේ ය, මේ මම වෙමි, මේ මාගේ ආත්ම’ යයි දක්නට සුදුසු වේ දැ යි. වහන්ස, මෙය නොවේ ම ය. වේදනාව නිත්‍ය වේ ද, නොහොත් අනිත්‍ය වේ ද ... සංඥාව ... සංස්කාර … විඥානය නිත්‍ය වේ ද, නොහොත් අනිත්‍ය වේදැ යි. වහන්ස, අනිත්‍ය ය. යමක් අනිත්‍ය නම්, එය දුක් වේ ද, නොහොත් සුව වේ දැ යි. වහන්ස, දුක් ය. යමක් අනිත්‍ය නම්, දුක් නම්, වෙනස් වන සුලු නම් එය ‘මෙය මාගේ ය, මේ මම වෙමි, මේ මාගේ ආත්මය’ යි දක්නට සුදුසු වේ දැ යි. වහන්ස මෙය නොවේ ම ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "681"
            },
            {
                "text": "අනුරාධ, එහෙයින් මෙහි ලා අතීත වූ හෝ අනාගත වූ හෝ පච්චුප්පන්න වූ හෝ ආධ්‍යාත්මික වූ හෝ බාහිර වූ හෝ ඖදාරික වූ හෝ සූක්ෂම වූ හෝ හීන වූ හෝ ප්‍රණීත වූ හෝ යම් කිසි රූපයක් වේ ද, දුර වූ හෝ ළඟ වූ හෝ යම් රූපයකුත් වේ ද ඒ සියලු රූපය “මෙය මාගේ නො වෙයි, මේ මම නො වෙමි, මේ මාගේ ආත්මය නො වේ” යයි මෙසේ මෙය තතු සේ මනා නුවණින් දැක්ක යුතු. අතීත වූ හෝ අනාගත වූ හෝ පච්චුප්පන්න වූ හෝ යම් කිසි වේදනාවක් වේ ද ... යම් කිසි සංඥාවක් වේ ද … යම් කිසි සංස්කාර කෙනෙක් වෙත් ද … අතීත වූ හෝ අනාගත වූ පච්චුපන්න වූ හෝ අධ්‍යාත්මික වූ හෝ බාහිර වූ හෝ ඖදාරික වූ හෝ සූක්ෂම වූ හෝ හීන වූ හෝ ප්‍රණීත වූ හෝ යම් කිසි විඥානයෙක් වේ ද, දුර වූ හෝ ළඟ වූ හෝ යම් විඥානයෙකුත් වේ ද, ඒ සියලු විඥානය “මෙය මාගේ නො වෙයි, මේ මම නො වෙමි, මේ මාගේ ආත්මය නො වේ” යයි මෙසේ මෙය තතුසේ මනා නුවණින් දැක්ක යුතු.",
                "type": "paragraph"
            },
            {
                "text": "අනුරාධ, මෙසේ දක්නා ශ්‍රැතවත් ආර්‍ය්‍ය ශ්‍රාවක තෙමේ රූපයෙහිත් කලකිරෙයි, වේදනාවෙහිත් කලකිරෙයි, සංඥාවෙහිත් කලකිරෙයි, සංස්කාරයන්හිත් කලකිරෙයි, විඥානයෙහිත් කලකිරෙයි. කලකිරෙන්නේ නො ඇලෙයි. නො ඇල්මෙන් මිදෙයි. මිදුණු කල්හි මිදුණේ යයි දැනීම වෙයි. ඉපැද්ම ගෙවිණ. බඹසර වැස නිමවන ලදි. කටයුතු කරණ ලදි. මේ බැව් පිණිස අනෙකක් නැතැ යි දැන ගනී.",
                "type": "paragraph"
            },
            {
                "text": "අනුරාධ, ඒ කිමැ යි හඟිවු ද? රූපය සත්ත්වයා යයි දකිවු දැ? යි. වහන්ස, මෙය නො වේ ම ය. වේදනාව සත්ත්වයා යයි දකිවු දැ? යි. වහන්ස, මෙය නො වේ ම ය. සංඥාව සත්ත්වයා යයි දකිවු දැ? යි. වහන්ස, මෙය නො වේ ම ය. සංස්කාර සත්ත්වයා යයි දකිවු දැ? යි. වහන්ස, මෙය නො වේ ම ය. විඥානය සත්ත්වයා යයි දකිවු දැ? යි. වහන්ස, මෙය නො වේ ම ය. අනුරාධ ඒ කිමැ යි හඟිවු ද? රූපයෙහි සත්ත්වයා වේ යයි දකිවු දැ? යි. වහන්ස, මෙය නො වේ ම ය. රූපයෙන් වෙන් ව සත්තවයා වේ යයි දකිවු දැ? යි. වහන්ස, මෙය නො වේ ම ය. වේදනාවෙහි සත්ත්වයා වේ යයි දකිවු දැ? යි. වහන්ස, මෙය නො වේ ම ය. වේදනාවෙන් වෙන් ව ... සංඥාවෙහි ... සංඥාවෙන් වෙන් ව ... සංස්කාරයන් හි ... සංස්කාරයන්ගෙන් වෙන් ව ... විඥානයෙහි සත්ත්වයා වේ යයි දකිවු දැ? යි. වහන්ස, මෙය නො වේ ම ය. විඥානයෙන් වෙන් ව සත්තවයා වේ යයි දකිවු දැ? යි. වහන්ස, මෙය නො වේ ම ය. අනුරාධ, ඒ කිමැ යි හඟිවු ද? රූපය ... වේදනාව ... සංඥාව ... සංස්කාර ... විඥානය සත්ත්වයා වේ යයි දකිවු දැ? යි. වහන්ස, මෙය නො වේ ම ය.",
                "type": "paragraph"
            },
            {
                "text": "අනුරාධ, ඒ කිමැ යි හඟිවු ද? මේ ඒ රූපය නැත්තෙක්, වේදනා නැත්තෙක්, සංඥා නැත්තෙක්, සංස්කාර නැත්තෙක්, විඥානය නැත්තෙක් සත්ත්වයා වේ යයි දකිවු දැ? යි. වහන්ස, මෙය නො වේ ම ය. අනුරාධ, මෙහි ලා තොපට දිටුදැමියෙහි ම සත්‍ය වශයෙන් ස්ථිර වශයෙන් සත්ත්වයෙකු නොලැබෙන කල්හි “ඇවැත්නි, උත්තමපුරුෂ වූ, පරමපුරුෂ වූ ශ්‍රේෂ්ඨ ප්‍රාප්තියට පැමිණි යම් ඒ සත්ත්වයෙක් වේ නම් ඔහු පනවන තථාගතයන් වහන්සේ සත්ත්වයා මරණින් මතු වේ යයි හෝ ... සත්ත්වයා මරණින් මතු නො වේ යයි හෝ සත්තවයා මරණින් මතු වේ නො ද වේ යි හෝ සත්ත්වයා මරණින් මතු නො ම වේ නො ම වේ නො ම නො වේ යයි හෝ යන මේ සිවු කරුණෙන් වෙන් ව පනවති” යි එය තොප විසින් පැවසීමට සුදුසු දැ? යි. වහන්ස මෙය නො වේ ම ය. අනුරාධ, මැනවි, මැනවි. අනුරාධ, මම පෙරත්, දැනුත් දුකත්, දුක්ඛනිරොධයත් පනවමි යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "683"
            },
            {
                "type": "centered",
                "text": "10. 1. 13.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "උපගත සූත්‍රය",
                "level": "1"
            },
            {
                "text": "2278. එක්කලෙක ආයුෂ්මත් සාරිපුත්ත තෙරණුවෝත්, ආයුෂ්මත් කොට්ඨිත තෙරණුවෝත් බරණැස් නුවර සමීපයෙහි මිගදාය නම් වූ ඉසිපතනාරාමයෙහි වැඩවෙසෙති. එකල්හි ආයුෂ්මත් මහාකොට්ඨිත තෙරණුවෝ සවස්කල පලසමවතින් නැගීසිටි සේක්, ආයුෂ්මත් සැරියුත් තෙරණුවන් වෙත එළඹියහ. එළඹ සැරියුත් තෙරණුවන් සමඟ සතුටු වූහ. සතුටු වියයුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පසෙක වැඩ හුන්හ. එකත්පසෙක වැඩහුන් ආයුෂ්මත් මහාකොට්ඨිත තෙරණුවෝ ආයුෂ්මත් සැරියුත් තෙරණුවන්ට මෙය වදාළහ:",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි ශාරිපුත්‍රයෙනි, කිම “සත්ත්වයා මරණින් මතු වේ දැ?”යි. ඇවැත්නි, “සත්ත්වයා මරණින් මතු වේ ය”යි මෙය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි. ඇවැත්නි, කිම “සත්ත්වයා මරණින් මතු නො වේ දැ?”යි. ඇවැත්නි, “සත්ත්වයා මරණින් මතු නොවේ” යයි මෙ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි. ඇවැත්නි, කිම “සත්ත්වයා මරණින් මතු වේ, නො ද වේ දැ?”යි. ඇවැත්නි, “සත්ත්වයා මරණින් මතු වේ, නො ද වේ” යයි මෙ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි. ඇවැත්නි, කිම “සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ දැ?”යි. ඇවැත්නි, “සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ” යයි මෙ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි කිම, “සත්ත්වයා මරණින් මතු වේ දැ?”යි මෙසේ පුළුවුස්නා ලද්දාහු ඇවැත්නි, “සත්ත්වයා මරණින් මතු වේ” යයි මෙය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදැ”යි කියවු ... ඇවැත්නි, කිම? “සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ දැ?”යි මෙසේ පුළුවුස්නා ලද්දාහු, ඇවැත්නි “සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ” යයි මේ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදැ යි කියවු. ඇවැත්නි, යම් හෙයෙකින් එය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලද්දේ නම් එයට හේතු කිම? ප්‍රත්‍යය කිමැ?යි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, සත්ත්වයා මරණින් මතු වේ යන මෙය රූපමාත්‍රයෙකි. සත්ත්වයා මරණින් මතු නො වේ යන මෙය රූපමාත්‍රයෙකි. සත්ත්වයා මරණින් මතු වේ, නො ද වේ යන මෙය රූපමාත්‍රයෙකි. සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යන මෙය රූපමාත්‍රයෙකි. ඇවැත්නි, සත්ත්වයා මරණින් මතු වේ යන මෙය වේදනාමාත්‍රයෙකි. සත්ත්වයා මරණින් මතු නො වේ යන මෙය වේදනාමාත්‍රයෙකි. සත්ත්වයා මරණින් මතු වේ, නො ද වේ යන මෙය වේදනාමාත්‍රයෙකි. සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යන මෙය වෙදනාමාත්‍රයෙකි. ඇවැත්නි, සත්ත්වයා මරණින් මතු වේ යන මෙය සංඥාමාත්‍රයෙකි. සත්ත්වයා මරණින් මතු නො වේ යන මෙය සංඥාමාත්‍රයෙකි. සත්ත්වයා මරණින් මතු වේ, නො ද වේ යන මෙය සංඥාමාත්‍රයෙකි. සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යන මෙය සංඥාමාත්‍රයෙකි. ඇවැත්නි, සත්ත්වයා මරණින් මතු වේ යන මෙය සංස්කාරමාත්‍රයෙකි. සත්ත්වයා මරණින් මතු නො වේ යන මෙය සංස්කාරමාත්‍රයෙකි. සත්ත්වයා මරණින් මතු වේ, නො ද වේ යන මෙය සංස්කාරමාත්‍රයෙකි. සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යන මෙය සංස්කාරමාත්‍රයෙකි. ඇවැත්නි, සත්ත්වයා මරණින් මතු වේ යන මෙය විඥානමාත්‍රයෙකි. සත්ත්වයා මරණින් මතු නො වේ යන මෙය විඥානමාත්‍රයෙකි. සත්ත්වයා මරණින් මතු වේ, නො ද වේ යන මෙය විඥානමාත්‍රයෙකි. සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යන මෙය විඥානමාත්‍රයෙකි.",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "ඇවැත්නි, යම් හෙයකින් එය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලද්දේ නම් එයට මේ හේතු යි, මේ ප්‍රත්‍යය යි."
            },
            {
                "type": "centered",
                "text": "10. 1. 14.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සමුදය සූත්‍රය",
                "level": "1"
            },
            {
                "text": "2279. එක් කලෙක ආයුෂ්මත් සාරිපුත්ත තෙරණුවෝත් ආයුත්මත් මහාකොට්ඨිත තෙරණුවෝත් බරණැස සමීපයෙහි මිගදාය නම් වූ ඉසිපතනාරාමයෙහි වැඩවෙසෙති ... ඇවැත්නි, යම් හෙයකින් එය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලද්දේ නම් එයට හේතු කිම? ප්‍රත්‍යය කිමැ?යි. ඇවැත්නි, රූපය තතු සේ නො දන්නා නො දක්නා, රූප සමුදය තතු සේ නො දන්නා නො දක්නා, රූප නිරෝධය තතු සේ නො දන්නා නො දක්නා, රූප නිරෝධගාමිනීපටිපදාව තතු සේ නො දන්නා නො දක්නා ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද ලබ්ධි වෙයි. ඔහුට සත්ත්වයා මරණින් මතු නො වේ යයි ද ලබ්ධි වෙයි. ඔහුට සත්ත්වයා මරණින් මතු වේ, නො ද වේ යයි ද ලබ්ධි වෙයි. ඔහුට සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යයි ද ලබ්ධි වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "වේදනාව තතු සේ නො දන්නා නො දක්නා, වේදනා සමුදය ... සංඥාව ... සංස්කාර ... විඥානය තතු සේ නො දන්නා නො දක්නා, විඥාන සමුදය තතු සේ නො දන්නා නො දක්නා, විඥාන නිරෝධය තතු සේ නො දන්නා නො දක්නා, විඥාන නිරොධගාමිනීපටිපදාව තතු සේ නො දන්නා නො දක්නා ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද ලබ්ධි වෙයි. ඔහුට සත්ත්වයා මරණින් මතු නො වේ යයි ද ලබ්ධි වෙයි. ඔහුට සත්ත්වයා මරණින් මතු වේ, නො ද වේ යයි ද ලබ්ධි වෙයි. ඔහුට සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යයි ද ලබ්ධි වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, රූපය තතු සේ දන්නා දක්නා, රූප සමුදය තතු සේ දන්නා දක්නා, රූප නිරෝධය තතු සේ දන්නා දක්නා, රූප නිරෝධගාමිනීපටිපදාව තතු සේ දන්නා දක්නා ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද ලබ්ධි නො වෙයි ... සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යයි ද ලබ්ධි නො වෙයි. වේදනාව තතු සේ දන්නා දක්නා, වේදනා සමුදය ... සංඥාව ... සංස්කාර ... විඥානය තතු සේ දන්නා දක්නා, විඥාන සමුදය තතු සේ දන්නා දක්නා, විඥාන නිරෝධය තතු සේ දන්නා දක්නා, විඥාන නිරොධගාමිනීපටිපදාව තතු සේ දන්නා දක්නා ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද ලබ්ධි නො වෙයි. සත්ත්වයා මරණින් මතු නො වේ යයි ද ලබ්ධි නො වෙයි. සත්ත්වයා මරණින් මතු වේ, නො ද වේ යයි ද ලබ්ධි නො වෙයි. සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යයි ද ලබ්ධි නො වේ. අවැත්නි යම් හෙයකින් එය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලද්දේ නම් එයට මේ හේතු යැ. මේ ප්‍රත්‍යය යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "687"
            },
            {
                "type": "centered",
                "text": "10. 1. 15.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පෙම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "2280. එක් කලෙක ආයුෂ්මත් සාරිපුත්ත තෙරණුවෝත් ආයුෂ්මත් මහාකොට්ඨිත තෙරණුවෝත් බරණැස සමීපයෙහි මිගදාය නම් වූ ඉසිපතනාරාමයෙහි වැඩවෙසෙති ... ඇවැත්නි, යම් හෙයකින් එය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලද්දේ නම්, එයට හේතු කිම? ප්‍රත්‍යය කිමැ?යි. ඇවැත්නි, රූපයෙහි නො පහ වූ රාග ඇති, නො පහ වූ ඡන්ද ඇති, නො පහ වූ ප්‍රේම ඇති, නො පහ වූ පවස් ඇති, නො පහ වූ පරිදාහ ඇති, නො පහ වූ තෘෂ්ණා ඇති ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද ලබ්ධි වෙයි ... සත්ත්වයා මරණින් මතු නො ම වෙයි, නො ම නො වේ යයි ද ලබ්ධි වේ.",
                "type": "paragraph"
            },
            {
                "text": "වේදනාවෙහි නො පහ වූ රාග ඇති, නො පහ වූ ඡන්ද ඇති, නො පහ වූ ප්‍රේම ඇති, නො පහ වූ පවස් ඇති, නො පහ වූ පරිදාහ ඇති, නො පහ වූ තෘෂ්ණා ඇති ... සංඥාවෙහි ... සංස්කාරයන්හි … විඥානයෙහි නො පහ වූ රාග ඇති, නො පහ වූ ඡන්ද ඇති, නො පහ වූ ප්‍රේම ඇති, නො පහ වූ පවස් ඇති, නො පහ වූ පරිදාහ ඇති, නො පහ වූ තෘෂ්ණා ඇති ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද ලබ්ධි වෙයි ... සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යයි ද ලබ්ධි වේ.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, රූපයෙහි පහ වූ රාග ඇති, පහ වූ ඡන්ද ඇති, පහ වූ ප්‍රේම ඇති, පහ වූ පවස් ඇති, පහ වූ පරිදාහ ඇති, පහ වූ තෘෂ්ණා ඇති ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද ලබ්ධි නො වෙයි ... සත්ත්වයා මරණින් මතු නොම වේ නො ම නො වේ යයි ද ලබ්ධි නො වේ. වේදනාවෙහි ... සංඥාවෙහි ... සංස්කාරයන්හි ... විඥානයෙහි පහ වූ රාග ඇති, පහ වූ ඡන්ද ඇති, පහ වූ ප්‍රේම ඇති, පහ වූ පවස් ඇති, පහ වූ පරිදාහ ඇති, පහ වූ තෘෂ්ණා ඇති ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද ලබ්ධි නො වෙයි ... සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යයි ද ලබ්ධි නො වේ. අවැත්නි, යම් හෙයකින් එය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලද්දේ නම් එයට මේ හේතු ය, මේ ප්‍රත්‍යය යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "10. 1. 16.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආරාම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "2281. එක් කලෙක ආයුෂ්මත් සාරිපුත්ත තෙරණුවෝත් ආයුෂ්මත් මහාකොට්ඨිත තෙරණුවෝත් බරණැස සමීපයෙහි මිගදාය නම් වූ ඉසිපතනාරාමයෙහි වැඩවෙසෙති. එකල්හි ආයුෂ්මත් සැරියුත් තෙරණුවෝ සවස්කල පලසමවතින් නැගීසිටි සේක් ආයුෂ්මත් මහාකොට්ඨිත තෙරණුවන් වෙත එළඹියහ. එළඹ ආයුෂ්මත් මහා කොට්ඨිත තෙරණුවන් සමඟ සතුටු වූහ. සතුටු විය යුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පස් ව වැඩහුන්හ. එකත්පස් ව වැඩහුන් ආයුෂ්මත් සැරියුත් තෙරණුවෝ ආයුෂ්මත් මහාකොට්ඨිත තෙරණුවන්ට මෙය වදාළහ: ඇවැත්නි, කොට්ඨිතයෙනි, කිම සත්ත්වයා මරණින් මතු වේ දැ? යි ... ඇවැත්නි, කිම සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ දැ? යි. මෙසේ පුළුවුස්නා ලද්දාහු ඇවැත්නි, සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යයි මෙය ද භාග්‍යවතුන් වහන්සේ විසින් නොවදාරන ලදැ යි කියවු. ඇවැත්නි යම් හෙයකින් එය භාග්‍යවතුන් වහන්සේ විසින් නොවදාරන ලද නම් එයට හේතු කිම, ප්‍රත්‍ය කිමැ? යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "689"
            },
            {
                "text": "ඇවැත්නි, රූපයෙහි ඇලෙන, රූපයෙහි ඇලුණු, රූපයෙහි සතුටු වූ, රූප නිරෝධය තතු සේ නො දන්නා නො දක්නා ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද සිත් වෙයි. ඔහුට සත්ත්වයා මරණින් මතු නො වේ යයි ද සිත් වෙයි. ඔහුට සත්ත්වයා මරණින් මතු වේ, නො ද වේ යයි ද සිත් වෙයි. ඔහුට සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යයි ද සිත් වේ. ඇවැත්නි, වේදනාවෙහි ඇලෙන, වේදනාවෙහි ඇලුණු, වේදනාවෙහි සතුටු වූ, වේදනා නිරෝධය තතු සේ නො දන්නා නො දක්නා ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද වේ … ඇවැත්නි, සඤ්ඤායෙහි ඇලෙන ... ඇවැත්නි, සඞ්ඛාරයෙහි ඇලෙන ... ඇවැත්නි, විඤ්ඤාණයෙහි ඇලෙන, විඤ්ඤාණයෙහි ඇලුණු, විඤ්ඤාණයෙහි සතුටු වූ, විඤ්ඤාණනිරොධය තතු සේ නො දන්නා නො දක්නා ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද ලබ්ධි වෙයි ... ඔහුට සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යයි ද ලබ්ධි වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, රූපයෙහි නො ඇලෙන, රූපයෙහි නො ඇලුණු, රූපයෙහි සතුටු නො වූ, රූප නිරොධය තතු සේ දන්නා දක්නා ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද ලබ්ධි නො වෙයි ... ඔහුට සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යයි ද ලබ්ධි නො වෙයි. ඇවැත්නි, වේදනාවෙහි නො ඇලෙන, වේදනාවෙහි නො ඇලුණු, වේදනාවෙහි සතුටු නො වූ ... ඇවැත්නි, සඤ්ඤාවෙහි නො ඇලෙන ... ඇවැත්නි, සඞ්ඛාරයෙහි නො ඇලෙන ... ඇවැත්නි, විඤ්ඤාණයෙහි නො ඇලෙන, විඤ්ඤාණයෙහි නො ඇලුණු, විඤ්ඤාණයෙහි සතුටු නො වූ, විඤ්ඤාණ නිරොධය තතු සේ දන්නා දක්නා ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද ලබ්ධි නො වෙයි … ඔහුට සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නොවේ යයි ද ලබ්ධි නො වෙයි. ඇවැත්නි, යම් හෙයකින් භාග්‍යවතුන් වහන්සේ විසින් එය නො වදාරණ ලද නම්, එයට මේ හේතු ය, මේ ප්‍රත්‍යය යි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, යම් හෙයෙකින් එය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරණ ලද නම්, එයට අන් නයෙකුත් වන්නේ දැ? යි. ඇවැත්නි වන්නේ ය. ඇවැත්නි, භවයෙහි ඇලෙන, භවයෙහි ඇලුණු, භවයෙහි සතුටු වූ, භව නිරොධය තතු සේ නො දන්නා නො දක්නා ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද ලබ්ධි වෙයි … ඔහුට සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යයි ද ලබ්ධි වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, භවයෙහි නො ඇලෙන, භවයෙහි නො ඇලුණු, භවයෙහි සතුටු නො වූ, භව නිරෝධය තතු සේ දන්නා දක්නා ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද ලබ්ධි නො වෙයි … ඔහුට සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යයි ද ලබ්ධි නො වෙයි. ඇවැත්නි, යම් හෙයකින් එය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලද නම් එයට මේ ද කරුණෙකි යි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, යම් හෙයෙකින් භාග්‍යවතුන් වහන්සේ විසින් නො වදාරණ ලද නම් එයට අන් කරුණෙකු දු වන්නේ දැ? යි. ඇවැත්නි වන්නේ ය. ඇවැත්නි, උපාදානයෙහි ඇලෙන, උපාදානයෙහි ඇලුණු, උපාදානයෙහි සතුටු වූ, උපාදාන නිරොධය තතු සේ නො දන්නා නො දක්නා ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද ලබ්ධි වෙයි ... ඔහුට සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යයි ද ලබ්ධි වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "691"
            },
            {
                "text": "ඇවැත්නි, උපාදානයෙහි නො ඇලෙන, උපාදානයෙහි නො ඇලුණු, උපාදානයෙහි සතුටු නො වූ, උපාදාන නිරොධය තතු සේ දන්නා දක්නා ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද ලබ්ධි නො වෙයි … ඔහුට සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යයි ද ලබ්ධි නො වෙයි. ඇවැත්නි, යම් හෙයකින් එය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලද නම් එයට මේ ද කරුණෙකි යි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, යම් හෙයකින් එය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරණ ලද නම්, එයට අන් කරුණෙකු දු වන්නේ දැ? යි. ඇවැත්නි වන්නේ ය. ඇවැත්නි, තණ්හාවෙහි ඇලෙන, තණ්හාවෙහි ඇලුණු, තණ්හාවෙහි සතුටු වූ, තණ්හා නිරොධය තතු සේ නො දන්නා නො දක්නා ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද ලබ්ධි වෙයි … ඔහුට සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යයි ද ලබ්ධි වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, තණ්හාවෙහි නො ඇලෙන, තණ්හාවෙහි නො ඇලුණු, තණ්හාවෙහි සතුටු නො වූ, තණ්හා නිරොධය තතු සේ දන්නා දක්නා ඔහුට සත්ත්වයා මරණින් මතු වේ යයි ද ලබ්ධි නො වෙයි … ඔහුට සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ යයි ද ලබ්ධි නො වෙයි. ඇවැත්නි, යම් හෙයෙකින් එය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලද නම් එයට මේ ද කරුණෙකි යි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, යම් හෙයෙකින් එය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරණ ලද නම්, එයට අන් කරුණෙකු දු වන්නේ දැ?යි. ඇවැත්නි ශාරිපුත්‍රයෙනි, මෙහි දැන් මෙයින් මතු කුමක් කැමති වවු ද? ඇවැත්නි ශාරිපුත්‍රයෙනි, තෘෂ්ණා ප්‍රහාණයෙන් මිදුණු මහණහට පැනවීම පිණිස සසරවටෙක් නැතැ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "10. 1. 17.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආයතන සූත්‍රය",
                "level": "1"
            },
            {
                "text": "2282. එකල්හි වච්ඡගොත්ත පිරිවැජි තෙමේ ආයුෂ්මත් මහමුගලන් තෙරණුවන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් මහමුගලන් තෙරණුවන් සමඟ සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පස් ව හුන්නේ ය. එකත්පස් ව හුන් වච්ඡගොත්ත පිරිවැජි ආයුෂ්මත් මහමුගලන් තෙරණුවන්ට මෙය කීය: භවත් මොග්ගල්ලානයෙනි කිම ලෝකය ශාශ්වත දැ?යි. වච්ඡයෙනි ‘ලෝකය ශාශ්වත ය’යි මෙය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි. භවත් මොග්ගල්ලානයෙනි කිම ලෝකය අශාශ්වත දැ?යි. වච්ඡයෙනි, ‘ලෝකය අශාශ්වත ය’යි මෙ ද භාග්‍යවතුන් වහන්සේ නො වදාරන ලදි. භවත් මොග්ගල්ලානයෙනි, කිම ලෝකය අන්තවත් දැ? යි. වච්ඡයෙනි, ‘ලෝකය අන්තවත් ය’යි මෙය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි. භවත් මොග්ගල්ලානයෙනි, කිම ලෝකය අනන්තවත් දැ?යි. වච්ඡයෙනි, ‘ලෝකය අනන්තවත් ය’යි මෙ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "693"
            },
            {
                "text": "භවත් මොග්ගල්ලානයෙනි, කිම ඒ ම ජීවය, ඒ ම ශරීරය දැ?යි. වච්ඡයෙනි, ‘ඒ ම ජීවය, ඒ ම ශරීරය’ යි මෙය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි. භවත් මොග්ගල්ලානයෙනි, කිම ජීවය අනෙකක් ද? ශරීරය අනෙකක් දැ?යි. වච්ඡයෙනි, ‘ජීවය අනෙකෙක, ශරීරය අනෙ‍කෙකැ’ යි මෙ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි. භවත් මොග්ගල්ලානයෙනි, කිම සත්ත්වයා මරණින් මතු වේ දැ?යි. වච්ඡයෙනි, ‘සත්ත්වයා මරණින් මතු වේ’ ය යන මෙය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි. භවත් මොග්ගල්ලානයෙනි, කිම සත්ත්වයා මරණින් මතු නො වේ දැ?යි. වච්ඡයෙනි, ‘සත්ත්වයා මරණින් මතු නො වේ’ ය යන මේ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි. භවත් මොග්ගල්ලානයෙනි, කිම සත්ත්වයා මරණින් මතු වේ, නො ද වේ දැ?යි. වච්ඡයෙනි, ‘සත්ත්වයා මරණින් මතු වේ, නො ද වෙයි’ යන මෙය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි. භවත් මොග්ගල්ලානයෙනි, කිම සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ දැ?යි. වච්ඡයෙනි, ‘සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වෙයි’ යන මේ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි.",
                "type": "paragraph"
            },
            {
                "text": "භවත් මොග්ගල්ලානයෙනි, මෙසේ පුළුවුස්නා ලද අන්තොටු පිරිවැජ්ජන්ගේ “ලෝකය ශාශ්වත යයි හෝ ලෝකය අශාශ්වත යයි හෝ ලෝකය අන්තවත් යයි හෝ ලෝකය අනන්තවත් යයි හෝ ඒ ම ජීවය ය ඒ ම ශරීරය යයි හෝ ජීවය අනෙකක ශරීරය අනෙකකැ යි හෝ සත්ත්වයා මරණින් මතු වේ යයි හෝ සත්ත්වයා මරණින් මතු නො වේ යයි හෝ සත්ත්වයා මරණින් මතු වේ, නො ද වේ යයි හෝ සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නොවේ” යයි හෝ යම් හෙයකින් මෙසේ විසඳීමක් වේ නම් එයට හේතු කිම, ප්‍රත්‍යය කිමැ?යි.",
                "type": "paragraph"
            },
            {
                "text": "භවත් මොග්ගල්ලානයෙනි, මෙසේ පුළුවුස්නා ලද මහණගොයුම්හු “ලෝකය ශාශ්වත යයි දු, ලෝකය අශාශ්වත යයි දු, ලෝකය අන්තවත් යයි දු, ලෝකය අනන්තවත් යයි දු, ඒ ම ජීවය ය ඒ ම ශරීරය යයි දු, ජීවය අනෙකක ශරීරය අනෙකකැ යි දු, සත්ත්වයා මරණින් මතු වේ යයි දු, සත්ත්වයා මරණින් මතු නො වේ යයි දු, සත්ත්වයා මරණින් මතු වේ නො ද වේ යයි දු, සත්ත්වයා මරණින් මතු නො ම වේ නො ම නො වේ” යයි දු යම් හෙයෙකින් මෙසේ විසඳීමෙක් නො වේ නම් එයට හේතු කිම, ප්‍රත්‍යය කිමැ?යි.",
                "type": "paragraph"
            },
            {
                "text": "වච්ඡයෙනි, අන්තොටු පිරිවැජියෝ ඇස ... “මෙය මාගේ ය, මේ මම වෙමි, මේ මාගේ ආත්මය”යි දකිත්. කන ... නැහැය ... දිව “මෙය මාගේ ය, මේ මම වෙමි, මේ මාගේ ආත්මය”යි දකිත්. කය ... සිත “මෙය මාගේ ය, මේ මම වෙමි, මේ මාගේ ආත්මය” යි දකිත්. එහෙයින් මෙසේ පුළුවුස්නා ලද අන්තොටු පිරිවැජ්ජන්ගේ “ලෝකය ශාශ්වත යයි හෝ ... සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ” යයි හෝ මෙසේ විසදීම වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "695"
            },
            {
                "text": "වච්ඡයෙනි, අර්හත් සම්මා සම්බුද්ධ වූ තථාගතයන් වහන්සේ වනාහි ඇස “මෙය මාගේ නො වේ, මේ මම නො වෙමි, මේ මාගේ ආත්මය නො වේ” යයි දකිත්. කන ... නැහැය ... දිව “මෙය මාගේ නො වේ, මේ මම නො වෙමි, මේ මාගේ ආත්මය නො වේ” යයි දකිත්. කය ... සිත “මෙය මාගේ නො වේ, මේ මම නො වෙමි, මේ මාගේ ආත්මය නො වේ” යයි දකිත්. එහෙයින් මෙසේ පුළුවුස්නා ලද තථාගතයන් වහන්සේගේ “ලෝකය ශාශ්වත ය යි දු ... සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ” යයි ද මෙසේ පැවසීම නො වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති වච්ඡගොත්ත පිරිවැජි තෙමේ හුනස්නෙන් නැඟී භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථාව නිමවා එකත්පසෙක හුන්නේය. එකත්පසෙක හුන් වච්ඡගොත්ත පිරිවැජි තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැල කළේ ය: භවත් ගෞතමයෙනි, කිම ලෝකය ශාශ්වත දැ?යි. වච්ඡ, “ලෝකය ශාශ්වත ය” යි මෙය මා විසින් නො පවසන ලදි. භවත් ගෞතමයෙනි, කිම සත්ත්වයා මරණින් මතු නො ම වේ, නොම නො වේ දැ?යි. වච්ඡය, “සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ” යි මේ ද මා විසින් නො පවසන ලදි.",
                "type": "paragraph"
            },
            {
                "text": "භවත් ගෞතමයෙනි, මෙසේ පුළුවුස්නා ලද අන්තොටු පිරිවැජ්ජන්ගේ “ලෝකය ශාශ්වත යයි හෝ ... සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ” යයි හෝ යම් හෙයකින් මෙසේ විසඳීමක් වේ නම් එයට හේතු කිම? ප්‍රත්‍යය කිමැ?යි. භවත් ගෞතමයෙනි, මෙසේ පුළුවුස්නා ලද භවත් ගොයුම්හුගේ “ලෝකය ශාශ්වත යයි දු ... සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ” යයි දු යම් හෙයෙකින් මෙසේ පැවසීමෙක් නො වේ නම් එයට හේතු කිම? ප්‍රත්‍යය කිමැ?යි.",
                "type": "paragraph"
            },
            {
                "text": "වච්ඡ, අන්තොටු පිරිවැජ්ජෝ ඇස … “මෙය මාගේ ය, මේ මම වෙමි, මේ මාගේ ආත්මය”යි දකිත්. කන ... නැහැය ... දිව “මෙය මාගේ ය, මේ මම වෙමි, මේ මාගේ ආත්මය”යි දකිත්. කය ... සිත “මෙය මාගේ ය, මේ මම වෙමි, මේ මාගේ ආත්මය”යි දකිත්. එහෙයින් මෙසේ පුළුවුස්නා ලද අන්තොටු පිරිවැජියන්ගේ “ලෝකය ශාශ්වත යයි හෝ ... සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ” යයි හෝ මෙසේ විසදීම වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "වච්ඡ, අර්හත් සම්මා සම්බුද්ධ වූ තථාගත තෙමේ වනාහි ඇස “මෙය මාගේ නො වේ, මේ මම නො වෙමි, මේ මාගේ ආත්මය නො වේ” යයි දකී. කන ... නැහැය … කය … සිත “මෙය මාගේ නො වේ, මේ මම නො වෙමි, මේ මාගේ ආත්මය නො වේ” යයි දකී. එහෙයින් මෙසේ පුළුවුස්නා ලද තථාගතයන්ගේ “ලෝකය ශාශ්වත යයි දු, ලෝකය අශාශ්වත යයි දු, ලෝකය අන්තවත් යයි දු, ලෝකය අනන්තවත් යයි දු, ඒ ම ජීවය ය ඒ ම ශරීරය යයි දු, ජීවය අනෙකෙක ශරීරය අනෙකෙකැයි දු, සත්ත්වයා මරණින් මතු වේ යයි දු, සත්ත්වයා මරණින් මතු නො වේ යයි දු, සත්ත්වයා මරණින් මතු වේ, නො ද වේ යයි දු, සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නොවේ” යයි දු මෙසේ පැවසීමක් නො වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "697"
            },
            {
                "text": "භවත් ගෞතමයෙනි, අරුමයෙකි. භවත් ගෞතමයෙනි, පුදුමයෙකි. යම් හෙයෙකින් දේශනායෙහි ලා ශාස්තෘහුගේ ද ශ්‍රාවකයාගේ ද අර්ථයෙන් අර්ථය ව්‍යඤ්ජනයෙන් ව්‍යඤ්ජනය සැසඳෙන්නේ ද සම වන්නේ ද විරුද්ධ නො වන්නේ ද (එහෙයිනි). භවත් ගෞතමයෙනි, මම දැන් මුගලන් මහණහු වෙත එළඹ මේ අරුත පිළිවිසීමි. මුගලන් මහණ ද භවත් ගොයුම්හු මෙන් මේ අරුත මේ පද වලින් මේ ව්‍යඤ්ජන වලින් මට පැවසීය. භවත් ගෞතමයෙනි, අරුමයෙකි. භවත් ගෞතමයෙනි, පුදුමයෙකි. යම් හෙයකින් දේශනායෙහි ලා ශාස්තෘහුගේ ද ශ්‍රාවකයාගේ ද අර්ථයෙන් අර්ථය ව්‍යඤ්ජනයෙන් ව්‍යඤ්ජනය සැසඳෙන්නේ ද සම වන්නේ ද විරුද්ධ නො වන්නේ ද (එහෙයිනි) යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "10. 1. 18.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඛන්ධ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "2283. එකල්හි වච්ඡගොත්ත පිරිවැජි තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පස් ව හුන්නේ ය. එකත්පස් ව හුන් වච්ඡගොත්ත පිරිවැජි තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැලකළේ ය: භවත් ගෞතමයෙනි, කිම ලෝකය ශාශ්වත දැ?යි. වච්ඡ, “ලෝකය ශාශ්වත ය” යි මෙය මා විසින් නො පවසන ලදි ... භවත් ගෞතමයෙනි, කිම සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ දැ?යි. වච්ඡ, “සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ” යයි මේ ද මා විසින් නො පවසන ලදි.",
                "type": "paragraph"
            },
            {
                "text": "භවත් ගෞතමයෙනි, මෙසේ පුළුවුස්නා ලද අන්තොටු පිරිවැජ්ජන්ගේ “ලෝකය ශාශ්වත යයි හෝ .... සත්ත්වයා මරණින් මතු නො ම නො වේ, නො ම නො වේ” යයි හෝ යම් හෙයෙකින් මෙසේ විසඳීමක් වේ නම් එයට හේතු කිමැ, ප්‍රත්‍යය කිමැ යි? භවත් ගෞතමයෙනි, මෙසේ පුළුවුස්නා ලද භවත් ගොයුම්හුගේ “ලෝකය ශාශ්වත ය යි දු ... සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ” යයි දු යම් හෙයකින් මෙසේ පැවසීමෙක් නො වේ නම්, එයට හේතු කිම? ප්‍රත්‍යය කිමැ? යි.",
                "type": "paragraph"
            },
            {
                "text": "වච්ඡ, අන්තොටු පිරිවැජ්ජෝ රූපය ආත්ම ය යි හෝ ආත්මය රූප ඇත්තකැ යි හෝ ආත්මයෙහි රූපය පවතී ය යි හෝ රූපයෙහි ආත්මය පවතී යයි හෝ දකිත්. වේදනාව ආත්මය යි හෝ ... දකිත්. සංඥාව ... සංස්කාර ... විඥානය ආත්මය යි හෝ ආත්මය විඥාන ඇත්තෙකැ යි හෝ ආත්මයෙහි විඥානය පවතී යයි හෝ විඥානයෙහි ආත්මය පවතී යයි හෝ දකිත්. එහෙයින් මෙසේ පුළුවුස්නා ලද අන්තොටු පිරිවැජ්ජන්ගේ “ලෝකය ශාශ්වත යයි හෝ ... සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ” යයි හෝ මෙසේ විසඳීම වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "699"
            },
            {
                "text": "වච්ඡ, අර්හත් සම්මාසම්බුද්ධ වූ තථාගත වනාහී රූපය ආත්මය යි නො දකී. ආත්මය රූප ඇත්තකැ යි හෝ නො දකී. ආත්මයෙහි රූපය පවතී ය යි හෝ නො දකී. රූපයෙහි ආත්මය පවතී යයි හෝ නො දකී. වේදනාව ආත්මය යි නො දකී ... සංඥාව … නො දකී ... සංස්කාර … නො දකී. විඥානය ආත්මය යි නො දකී. ආත්මය විඥාන ඇත්තෙකැ යි හෝ නො දකී. ආත්මයෙහි විඥානය පවතී ය යි හෝ නො දකී. විඥානයෙහි ආත්මය පවතී ය යි හෝ නො දකී. එහෙයින් මෙසේ පුළුවුස්නා ලද තථාගතයන්ගේ “ලෝකය ශාශ්වත යයි දු ... සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ” යයි දු මෙසේ පැවසීමක් නො වේ.",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති වච්ඡගොත්ත පිරිවැජි තෙමේ හුනස්නෙන් නැඟිට ආයුෂ්මත් මහමුගලන් තෙරණුවන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් මහමුගලන් තෙරණුවන් සමඟ සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පස් ව හුන්නේ ය. එකත්පස්ව හුන් වච්ඡගොත්ත පිරිවැජි තෙමේ ආයුෂ්මත් මහමුගලන් තෙරණුවන්ට මෙය කී ය: භවත් මොග්ගල්ලානයෙනි, කිම ලෝකය ශාශ්වත දැ? යි. වච්ඡයෙනි, ‘ලෝකය ශාශ්වත ය’ යි මෙය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි ... භවත් මොග්ගල්ලානයෙනි, කිමෙක් ද සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ දැ?යි. වච්ඡයෙනි, ‘සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ’ යයි මේ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි.",
                "type": "paragraph"
            },
            {
                "text": "භවත් මොග්ගල්ලානයෙනි, මෙසේ පුළුවුස්නා ලද අන්තොටු පිරිවැජ්ජන්ගේ “ලෝකය ශාශ්වත ය” යි හෝ ... “සත්ත්වයා මරණින් මතු නො ම නො වේ, නො ම නො වේ” යයි හෝ යම් හෙයෙකින් මෙසේ විසඳීමක් වේ නම් එයට හේතු කිම, ප්‍රත්‍යය කිම? භවත් මොග්ගල්ලානයෙනි, මේසේ පුළුවුස්නා ලද භවත් ගොයුම්හුගේ “ලෝකය ශාශ්වතයයි”  දු ... “සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ” යයි දු යම් හෙයකින් මෙසේ පැවසී‍මෙක් නො වේ නම් එයට හේතු කිම? ප්‍රත්‍යය කිමැ? යි.",
                "type": "paragraph"
            },
            {
                "text": "වච්ඡයෙනි, අන්තොටු පිරිවැජ්ජෝ “රූපය ආත්ම ය යි හෝ ආත්මය රූප ඇත්තකැ යි හෝ ආත්මයෙහි රූපය පවතී ය යි හෝ රූපයෙහි ආත්මය පවතී” යයි හෝ දකිත්. වේදනාව ... සංඥාව ... සංස්කාර ... විඥානය ආත්මය යි හෝ ආත්මය විඥානය ඇත්තෙකැ යි හෝ ආත්මයෙහි විඥානය පවතී යයි හෝ විඥානයෙහි ආත්මය පවතී යයි හෝ දකිත්. එහෙයින් මෙසේ පුළුවුස්නා ලද අන්තොටු පිරිවැජ්ජන්ගේ “ලෝකය ශාශ්වත යයි හෝ ... සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ” යයි හෝ මෙසේ විසඳීම වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "701"
            },
            {
                "text": "වච්ඡයෙනි, අර්හත් සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේ වූ කලී රූපය ආත්මය යි නො දකිත්. ආත්මය රූප ඇත්තකැ යි හෝ නො දකිත්. ආත්මයෙහි රූපය පවතී ය යි හෝ නො දකිත්. රූපයෙහි ආත්මය පවතී ය යි හෝ නො දකිත්. වේදනාව ... නො දකිත්. සංඥාව … නො දකිත්. සංස්කාර....නො දකිත්. විඥානය ආත්මය යි නො දකිත්. ආත්මය විඥාන ඇත්තෙකැ යි හෝ නො දකිත්. ආත්මයෙහි විඥානය පවතී ය යි හෝ නො දකිත්. විඥානයෙහි ආත්මය පවතී ය යි හෝ නො දකිත්. එහෙයින් මෙසේ පුළුවුස්නා ලද තථාගතන් වහන්සේගේ “ලෝකය ශාශ්වත ය යි දු ලෝකය ආශාශ්වත යයි දු ලෝකය අන්තවත් යයි දු ලෝකය අනන්තවත් යයි දු ඒ ම ජීවය යි දු ඒ ම ශරීරය යි දු ජීවය අනෙකක ශරීරය අනෙකකැ යි දු සත්ත්වයා මරණින් මතු වේ යයි දු සත්ත්වයා මරණින් මතු නො වේ යයි දු සත්ත්වයා මරණින් මතු වේ නො ද වේ යයි දු සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ” යි දු මෙසේ වැදෑරීමක් නො වේ.",
                "type": "paragraph"
            },
            {
                "text": "භවත් මොග්ගල්ලානයෙනි, අරුමයෙකි. භවත් මොග්ගල්ලානයෙනි, පුදුමයෙකි, යම් හෙයකින් යම් මේ දේශනායෙහි ලා ශාස්තෘහුගේ ද, ශ්‍රාවකයාගේ ද අර්ථයෙන් අර්ථය ව්‍යඤ්ජනයෙන් ව්‍යඤ්ජනය සැසඳෙන්නේ ද සම වන්නේ ද විරුද්ධ නො වන්නේ ද (එහෙයිනි). භවත් මොග්ගල්ලානයෙනි, මම දැන් මහණගොයුම්හු වෙත එළඹ මේ අරුත පිළිවිසීමි. මහණ ගොයුම්හු ද භවත් මුගලන්හු මෙන් මේ පදවලින් ම, මේ ව්‍යඤ්ජනවලින් ම මේ අරුත මට පැවසූහ. භවත් මොග්ගල්ලානයෙනි, අරුමයෙකි. භවත් මොග්ගල්ලානයෙනි, පුදුමයෙකි, යම් හෙයෙකින් යම් මේ දේශනායෙහි ලා ශාස්තෘහුගේ ද ශ්‍රාවකයාගේ ද අර්ථයෙන් අර්ථය ව්‍යඤ්ජනයෙන් ව්‍යඤ්ජනය සැසඳෙන්නේ ද සම වන්නේ ද විරුද්ධ නො වන්නේ ද (එහෙයිනි) යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "10. 1. 19.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කුතූහලශාලා සූත්‍රය",
                "level": "1"
            },
            {
                "text": "2284. එකල්හි වච්ඡගොත්ත පිරිවැජි තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පස් ව හුන්නේ ය. එකත්පස් ව හුන් වච්ඡගොත්ත පිරිවැජි තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැලකළේය: භවත් ගෞතමයෙනි, පළමු ඉතා පළමු දවස්හි කුතූහල ශාලාවෙහි එක් රැස්ව හුන් බොහෝ වූ නන්තොටු මහණ බමුණු පිරිවැජ්ජයන් අතර මේ අතුරු කථාව පහළ විය.",
                "type": "paragraph"
            },
            {
                "text": "මේ පූරණකස්සප තෙමේ සමූහයා ඇත්තේ ද ගණයා ඇත්තේ ද ගණයාට ඇදුරු වූයේ ද ප්‍රසිද්ධ වූයේ ද යසස් ඇත්තේ ද ලබ්ධි පහළ කරන්නේ ද බොහෝ දෙනා විසින් මැනැවැ යි සම්මත ද වෙයි. හෙතෙමේ ද “අසෝ පුඟුලා අසෝ තැන්හි උපන, අසෝ පුඟුලා අසෝ තැන උපනැ” යි ඉකුත් වූ කලුරිය කළ සව්වා උපත්හි ලා පවසයි. උත්තමපුරිස වූ පරමපුරිස වූ උතුම්පියට පැමිණි ඔහුගේ යම් සව්වෙකුත් වේ ද, ඉකුත් කලුරිය කළ ඒ සව්වා ද “අසෝ පුඟුලා අසෝ තැන උපන, අසෝ පුඟුලා අසෝ තැන උපනැ”යි උපත්හි ලා පවසයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "703"
            },
            {
                "text": "මේ මක්ඛලී ගෝසාල තෙමේත් ... මේ නිගණ්ඨනාතපුත්ත තෙමේත් ... මේ සඤ්ජයබෙල්ලට්ඨිපුත්ත තෙමේත් ... මේ පකුධකච්චායන තෙමේත් ... මේ අජිතකේසකම්බල තෙමේත් සමූහයා ඇත්තේ ද ගණයා ඇත්තේ ද ගණයාට ඇදුරු වූයේ ද ප්‍රසිද්ධ වූයේ ද යසස් ඇත්තේ ද ලබ්ධි පහළ කරන්නේ ද බොහෝ දෙනා විසින් මැනැවැ යි සම්මත ද වෙයි. හේ ද “අසෝ පුඟුලා අසෝ තැන උපන, අසෝ පුඟුලා අසෝ තැන උපනැ” යි ඉකුත් වූ කලුරිය කළ සව්වා උපත්හි ලා පවසයි. උත්තමපුරුෂ වූ පරමපුරුෂ වූ උතුම්පියට පැමිණි ඔහුගේ යම් සව්වෙකුත් වේ නම් ඉකුත් කලුරිය කළ ඒ සව්වා ද “අසෝ පුඟුලා අසෝ තැන උපන, අසෝ පුඟුලා අසෝ තැන උපනැ” යි උපත්හි ලා පවසයි. ",
                "type": "paragraph"
            },
            {
                "text": "මේ මහණ ගොයුම් තෙමේත් සමූහයා ඇත්තේ ද ගණයා ඇත්තේ ද ගණයාට ඇදුරු වූයේ ද ප්‍රසිද්ධ වූයේ ද යසස් ඇත්තේ ද ලබ්ධි පහළ කරන්නේ ද බොහෝ දෙනා විසින් මැනැවැ යි සම්මත ද වෙයි. හේ ද “අසෝ පුඟුලා අසෝ තැන්හි උපන, අසෝ පුඟුලා අසෝ තැන උපනැ” යි ඉකුත් වූ කලුරිය කළ සව්වා උපත්හි ලා පවසයි. උතුම් පුරුෂ වූ පරම පුරුෂ වූ උතුම් පියට පැමිණි ඔහුගේ යම් සව්වෙකුත් වේ නම් ඉකුත් කලුරිය කළ ඒ සව්වා “අසෝ පුඟුලා අසෝ තැන උපන, අසෝ පුඟුලා අසෝ තැන උපනැ” යි උපත්හි ලා නො පවසයි. වැලි දු “තෘෂ්ණාව සිඳලූයේ ය. සංයෝජන මුලුසුන් කෙළේ ය. මැනවින් මානය දුර ලීමෙන් දුක් කෙළෙවර කළේ” ය යි ඔහු ගැන මෙසේ පවසයි. භවත් ගෞතමයෙනි, ඒ මට කෙසේ නම් මහණගොයුම්හුගේ දහම දතයුතු දැ යි, සැකයක් වූයේ ම ය. විමතියෙක් වූයේ ම ය.",
                "type": "paragraph"
            },
            {
                "text": "වච්ඡ, තා විසින් සැක කරන්නට සුදුසු ම ය. විචිකිච්ඡා කරන්නට සුදුසු ම ය. තොපට සැක කටයුතු තන්හි විචිකිච්ඡාව උපන. වච්ඡ, මම උපාදාන ඇත්තහුගේ උපත පනවමි. උපාදාන රහිත වූවහුගේ (උපත) නො පනවමි. වච්ඡ, යම් සේ ගින්න දර සහිත වූයේ දිලේ ද, දර රහිත වූයේ නො දිලේ ද, වච්ඡ, එසෙයින් ම මම උපාදාන සහිත වූවහුගේ උපත පනවමි. උපාදාන රහිතයාගේ (උපත) නො පනවමි යි. භවත් ගෞතමයනි, යම් කලෙක ගිනිසිල සුළඟින් මෙහෙයන ලදු ව දුරටත් යේ ද භවත් ගෞතම තෙමේ මෙයට කිමෙක් උපාදාන ය යි පනවා දැ? යි. වච්ඡ, යම් කලෙක ගිනිසිල සුළඟින් මෙහෙයන ලදු ව දුරටත් යේ ද, එයට මම වාතූපාදාන යයි කියමි. වච්ඡ, එසමයෙහි සුළඟ එයට උපාදාන වේ යි.",
                "type": "paragraph"
            },
            {
                "text": "භවත් ගෞතමයෙනි, යම් කලෙක මේ කයත් බහා තබා ද, සත්ත්වයාත් එක්තරා කයකට නො පැමිණියේ වේ ද, භවත් ගෞතම තෙමේ මොහුට කිමෙක් උපාදාන යයි පනවා දැ? යි. වච්ඡ, යම් කලෙක මේ කයත් බහා තබාද, සත්ත්වයාත් එක්තරා කයකට නො පැමිණියේ වේ ද, එයට මම තණ්හූපාදාන යයි කියමි. වච්ඡ, එසමයෙහි ඔහුට තණ්හාව උපාදාන වේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "705"
            },
            {
                "type": "centered",
                "text": "10. 1. 110.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අත්ථත්ත සූත්‍රය",
                "level": "1"
            },
            {
                "text": "2285. එකල්හි වච්ඡගොත්ත පිරිවැජි තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු වියයුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පස් ව හුන්නේ ය. එකත්පස් ව හුන් වච්ඡගොත්ත පිරිවැජි තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැල කෙළේය: භවත් ‍ගෞතමයෙනි, කිමෙක් ද, ආත්මය ඇද්දැ? යි. මෙසේ කී කල්හි භාග්‍යවතුන් වහන්සේ නිශ්ශබ්ද වූ සේක. භවත් ගෞතමයෙනි, කිමෙක් ද ආත්මය නැද්දැ? යි .දෙවනවට දු භාග්‍යවතුන් වහන්සේ නිශ්ශබ්ද වූ සේක. එකල්හි වච්ඡගොත්ත පිරිවැජි තෙමේ හුනස්නෙන් නැගී ගියේ ය. ඉක්බිති ආයුෂ්මත් ආනන්ද තෙරණුවෝ වච්ඡගොත්ත පිරිවැජ්ජා ගිය නො බෝ වේලාවකින් භාග්‍යවතුන් වහන්සේට මෙය සැලකෙළේ ය: වහන්ස, පූළුවුස්නා ලද්දාහු වච්ඡගොත්ත පිරිවැජ්ජාගේ පැන කුමක් හෙයින් ‍නො විසදූසේක් දැ? යි .",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, මමත් ‘ආත්මය ඇද්දැ?’ යි පුළුවුස්නා ලද්දෙම්, ‘ආත්මය ඇතැ’යි වච්ඡගොත්ත පිරිවැජියාට පැවසූයෙම් නම්, ආනන්ද යම් ඒ මහණ බමුණු කෙනෙක් ශාශ්වත වාද ඇත්තාහු ද මෙය ඔවුන්ගේ ලබ්ධිය වූයේ ය. ආනන්ද, මමත් ‘ආත්මය නැද්දැ?’යි පූළුවුස්නා ලද්දෙම්, ‘ආත්මය නැතැ’යි වච්ඡගොත්ත පිරිවැජ්ජාට පැවසූයෙම් නම්, ආනන්ද, යම් ඒ මහණ බමුණු කෙනෙක් උච්ඡේදවාද ඇත්තාහු ද මෙය ඔවුන්ගේ ලබ්ධිය වූයේ ය. ආනන්ද, මමත් ‘ආත්මය ඇද්දැ?’ යි පුළුවුස්නා ලද්දෙම්, ‘ආත්මය ඇතැ’යි වච්ඡගොත්ත පිරිවැජියාට පැවසූයෙම් නම්, ආනන්ද, සියලු ධම්යෝ අනාත්මයහ යි විවසුන් නැණ ඉපදීම පිණිස මෙය මට සුදුසු වූයේ දැ? යි. වහන්ස, මෙය නොවේ ම ය. ආනන්ද, මමත් ‘ආත්මය නැද්දැ?’යි පුළුවුස්නා ලද්දෙම්, ‘ආත්මය නැතැ’යි වච්ඡගොත්ත පිරිවැජ්ජාට පැවසූයෙම් නම්, මුළා වූ වච්ඡගොත්ත පිරිවැජ්ජාට ‘පෙර මට ඒකාන්තයෙන් ආත්මය වූයේ ය, එය දැන් නැතැ’යි බෙහෙවින් මුළා වීම පිණිස වූයේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "10. 1. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සභිය සූත්‍රය",
                "level": "1"
            },
            {
                "text": "2286. එක් කලෙක ආයුෂ්මත් සභිය කච්චාන තෙරණුවෝ ඤාතිකා ගම්හි ගිඤ්ජකාවස්ථයෙහි වැඩවෙසෙති. එකල්හි වච්ඡගොත්ත පිරිවැජි තෙමේ ආයුෂ්මත් සභිය කච්චාන තෙරණුවන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් සභිය කච්චාන තෙරණුවන් සමඟ සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පස් ව හුන්නේ ය. එකත්පස් ව හුන් ආයුෂ්මත් වච්ඡගොත්ත පිරිවැජි තෙමේ ආයුෂ්මත් සභිය කච්චාන තෙරණුවන්ට මෙය කී ය:",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "707"
            },
            {
                "text": "භවත් කච්චානයෙනි, කිමෙක් ද සත්ත්වයා මරණින් මතු වේ දැ?යි. වච්ඡයෙනි, “සත්ත්වයා මරණින් මතු වේ” යයි මෙය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි. භවත් කච්චානයෙනි, කිමෙක් ද “සත්ත්වයා මරණින් මතු නො වේ දැ?” යි. වච්ඡයෙනි, “සත්වයා මරණින් මතු නො වේ” යයි මේ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි. භවත් කච්චානයෙනි, කිමෙක් ද “සත්ත්වයා මරණින් මතු වේ, නො ද වේ දැ?” යි. වච්ඡයෙනි, “සත්ත්වයා මරණින් මතු වේ, නො ද වේ” යයි මෙය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි. භවත් කච්චානයෙනි, කිමෙක් ද “සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ දැ?”යි. වච්ඡයෙනි, “සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ” යයි මේ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදි.",
                "type": "paragraph"
            },
            {
                "text": "භවත් කච්චානයෙනි, කිමෙක් ද “සත්ත්වයා මරණින් මතු වේ දැ” යි මෙසේ පුළුවුස්නා ලද්දාහු, වච්ඡයෙනි, “සත්ත්වයා මරණින් මතු වේ” යයි භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදැ යි කියවු. භවත් කච්චානයෙනි, කිමෙක් ද “සත්ත්වයා මරණින් මතු නො වේ දැ” යි මෙසේ පුළුවුස්නා ලද්දාහු, වච්ඡයෙනි, “සත්ත්වයා මරණින් මතු නො වේ” යයි මේ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදැ යි කියවු. භවත් කච්චානයෙනි, කිමෙක් ද “සත්ත්වයා මරණින් මතු වේ, නො ද වේ දැ” යි මෙසේ පුළුවුස්නා ලද්දාහු, වච්ඡයෙනි, “සත්ත්වයා මරණින් මතු වේ, නො ද වේ” යයි මෙය භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදැ යි කියවු. භවත් කච්චානයෙනි, කිමෙක් ද “සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ දැ” යි මෙසේ පුළුවුස්නා ලද්දාහු, වච්ඡයෙනි, “සත්ත්වයා මරණින් මතු නො ම වේ, නො ම නො වේ” යයි මෙ ද භාග්‍යවතුන් වහන්සේ විසින් නො වදාරන ලදැ යි කියවු. භවත් කච්චානයෙනි, යම් හෙයකින් එය මහණ ගොයුම්හු විසින් නො වදාරන ලද නම් එයට හේතු කිම, ප්‍රත්‍යය කිමැ? යි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, “රූප ඇත්තේ” යි හෝ “රූප නැත්තේ” යි හෝ “සංඥා ඇත්තේ” යි හෝ “සංඥා නැත්තේ” යි හෝ “නො ම සංඥා ඇත්තේ නො ම සංඥා නැත්තේ” යි හෝ පැනවීමට යමෙකුත් හේතු ද යමෙකුත් ප්‍රත්‍යය ද ඒ හේතුවත් ඒ ප්‍රත්‍යයත් සියල්ලෙන් සියල්ල සියලු අයුරෙන් සියල්ල ඉතිරි නැතිව නිරුද්ධ වන්නේ නම් පනවන්නෙක් “රූප ඇත්තේ” යි හෝ “රූප නැත්තේ” යි හෝ “සංඥා ඇත්තේ” යි හෝ “සංඥා නැත්තේ” යි හෝ “නො ම සංඥා ඇත්තේ නො ම සංඥා නැත්තේ” යි හෝ කවර හේතුවකින් ඔහු පනවන්නේ ද? (නො පනවන්නේ මැයි.)",
                "type": "paragraph"
            },
            {
                "text": "භවත් කච්චානයෙනි, පැවිදි වූ ඔබට කෙතෙක් කල් දැ යි? ඇවැත්නි, වැඩි කලෙක් නැත. තෙවසෙකැ යි. ඇවැත්නි, මෙතෙක් (සුළු) කලෙකින් යමෙකුගේ දේශනාව මෙය වන්නේ නම් මෙපමණක් වූ ම ඒ ද ලොකු දේශනාවක් වන්නේ ය. ඉතා මනාප දේශනායෙහි ලා කතාවෙක් ම නැතැ”යි.",
                "type": "paragraph"
            },
            {
                "text": "පළමු වැනි අබ්‍යාකත වර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍ර නාමාවළිය :**",
                "type": "unindented"
            },
            {
                "text": "ඛේමා, අනුරාධ, උපගත, සමුදය, පේම, ආරාම, ආයතන, ඛන්ධ, කුතූහලසාලා, අත්ථත්ත, සභිය සූත්‍ර යයි එකොළොසෙකි.",
                "type": "paragraph"
            },
            {
                "text": "අබ්‍යාකත සංයුත්තය නිමි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**සළායතන වර්ගයෙහි සංයුත්ත නාමාවළිය :**",
                "type": "unindented"
            },
            {
                "text": "සළායතන, වෙදනා, මාතුගාම, ජම්බුඛාදක, සාමණ්ඩ, මොග්ගල්ලාන, චිත්ත, ගාමණී, අසඞ්ඛත, අබ්‍යාකත සංයුත්ත යයි සංයුත්ත දසයෙකි.",
                "type": "paragraph"
            },
            {
                "text": "දසබල සෙලින් හටගත් නිවන් මහසමුදුර කෙළවර කොට ඇති අටැඟිමඟ සිලිල ඇති බුදුවදන් ගඟ දිගු කලක් මුළුල්ලෙහි ගලා බසීවා යි.",
                "type": "paragraph"
            },
            {
                "text": "සළායතන වර්ගය නිමි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ]
    }
]