{
    "filename": "sn-4-7",
    "bookId": 19,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 520,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "7. චිත්තසංයුත්තං",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. චිත්තවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "7. 1. 1",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සඤ්ඤොජනසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "405. එකං සමයං සම්බහුලා ථෙරා භික්ඛූ මච්ඡිකාසණ්ඩෙ විහරන්ති අම්බාටකවනෙ. තෙන ඛො පන සමයෙන සම්බහුලානං ථෙරානං භික්ඛූනං පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තානං මණ්ඩලමාලෙ සන්නිසින්නානං සන්නිපතිතානං අයමන්තරාකථා උදපාදි: සඤ්ඤොජනන්ති වා ආවුසො සඤ්ඤොජනියා ධම්මාති වා ඉමෙ ධම්මා නානත්ථා නානාව්යඤ්ජනා, උදාහු එකත්ථා ව්යඤ්ජනමෙව නානන්ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්රෙකච්චෙහි ථෙරෙහි භික්ඛූහි එවං ව්යාකතං හොති: “සඤ්ඤොජනන්ති වා ආවුසො{1} සඤ්ඤොජනියා ධම්මාති වා ඉමෙ ධම්මා නානත්ථා චෙව නානාව්යඤ්ජනා චා”ති. එකච්චෙහි ථෙරෙහි භික්ඛූහි එවං ව්යාකතං හොති: සඤ්ඤොජනන්ති වා ආවුසො සඤ්ඤොජනියා ධම්මාති වා ඉමෙ ධම්මා එකත්ථා ව්යඤ්ජනමෙව නාන”න්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන චිත්තො ගහපති මිගපථකං අනුප්පත්තො හොති කෙනචිදෙව කරණීයෙන. අස්සොසි ඛො චිත්තො ගහපති සම්බහුලානං කිර ථෙරානං භික්ඛූනං පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තානං මණ්ඩලමාලෙ සන්නිසින්නානං සන්නිපතිතානං අයමන්තරාකථා උදපාදි: “සඤ්ඤොජනන්ති වා ආවුසො සඤ්ඤොජනියා ධම්මාති වා ඉමෙ ධම්මා නානත්ථා නානාව්යඤ්ජනා, උදාහු එකත්ථා ව්යඤ්ජනමෙව නානන්ති? තත්රෙකච්චෙහි ථෙරෙහි භික්ඛූහි එවං ව්යාකතං: සඤ්ඤොජනන්ති වා ආවුසො සඤ්ඤොජනියා ධම්මාති වා ඉමෙ ධම්මා නානත්ථා චෙව නානාව්යඤ්ජනා චා”ති. එකච්චෙහි ථෙරෙහි භික්ඛූහි එවං ව්යාකතං: සඤ්ඤොජනන්ති වා ආවුසො සඤ්ඤොජනියා ධම්මාති වා ඉමෙ ධම්මා එකත්ථා ව්යඤ්ජනමෙව නානන්ති”. අථ ඛො චිත්තො ගහපති යෙන ථෙරා භික්ඛූ තෙනුපසඞ්කමි, උපසඞ්කමිත්වා ථෙරෙ භික්ඛූ අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො චිත්තො ගහපති ථෙරෙ භික්ඛූ එතදවොච:"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. චාවුසො - සී 1, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "7. චිත්ත සංයුක්තය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "text": "1. චිත්‌ත වර්ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "7. 1. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සංයොජන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "405. එක් කලෙක බොහෝ ස්ථවීර භික්ෂූහු මච්ඡිකාසණ්ඩ වන ලැහැබෙහි අම්බාටක වනයෙහි වැඩ වෙසෙති. එකල්හි පසුබත පිණ්ඩපතයෙන් වෙළකුණු මණ්ඩල මාලයේ (රැස්වීම් හලෙ) හි රැස් ව වැඩහුන් ස්ථවිර භික්ෂූන් අතර මේ අතුරු කථාව පහළ විය: ඇවැත්නි, සංයෝජන ය යි හෝ සංයෝජනිය ධර්මයෝ ය යි හෝ මේ දහම්හු වෙනස් වෙනස් අර්ථ ඇත්තාහු වෙනස් වෙනස් ව්‍යඤ්ජන ඇත්තාහු ද? නැතහොත් එක ම අර්ථ ඇත්තාහු ව්‍යඤ්ජ පමණක් වෙනස් වූවාහු දැ? යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එහි ඇතැම් ස්ථවිර භික්ෂූන් විසින් “ඇවැත්නි, සංයෝජන ය යි හෝ සංයෝජනීය ධර්මයෝ ය යි හෝ මේ දහම්හු වෙනස් වෙනස් අර්ථ ඇත්තාහු ද වෙනස් වෙනස් ව්‍යඤ්ජන ඇත්තාහු ද වෙති” යි මෙසේ විසඳන ලද්දේ වෙයි. ඇතැම් ස්ථවිර භික්ෂූන් විසින් “ඇවැත්නි, සංයෝජන ය යි හෝ සංයෝජනීය ධර්මයෝ ය යි හෝ මේ දහම්හු එකම අර්ථ ඇත්තාහු ව්‍යඤ්ජන වෙනස් වූවාහු වෙති” යි මෙසේ විසඳන ලද්දේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එසම‍යෙහි චිත්ත ගැහැවි කිසියම් කටයුත්තක් නිමිති කොට මිගපථක ගමට පැමිණියේ ‍‍වෙයි. චිත්ත ගැහැවි පසුබත පිණ්ඩපාතයෙන් වැළකුණු මණ්ඩලමාල‍යෙහි රැස් ව වැඩහුන් ස්ථවිර භික්ෂූන් අතර “ඇවැත්නි, සංයෝජන ය යි හෝ සංයෝජනිය ධර්මයෝ ය යි හෝ මේ දහම්හු වෙනස් වෙනස් අර්ථ ඇත්තාහු වෙනස් වෙනස් ව්‍යඤ්ජන ඇත්තාහු ද වෙද්ද, නැතහොත් එක ම අර්ථ ඇත්තාහු ව්‍යඤ්ජ පමණක් වෙනස් වූවාහු වෙත් දැ? යි. මේ අතුරු කථාව පහළ වී ය” යි ද එහි ඇතැම් ස්ථවිර භික්ෂූන් විසින් “ඇවැත්නි, සංයෝජන ය යි හෝ සංයෝජනීය ධර්මයෝ ය යි හෝ මේ දහම්හු වෙනස් වෙනස් අර්ථ ඇත්තාහු ද වෙනස් වෙනස් ව්‍යඤ්ජන ඇත්තාහු ද වෙති” යි මෙසේ විසඳන ලදැ යි ද, ඇතැම් ස්ථවිර භික්ෂූන් විසින් “ඇවැත්නි, සංයෝජන ය යි හෝ සංයෝජනීය ධර්මයෝ ය යි හෝ මේ දහම්හු එකම අර්ථ ඇත්තාහු ව්‍යඤ්ජන පමණක් වෙනස් වූවාහු වෙති” යි මෙසේ විසඳන ලදැ යි ද, ඇසු‍යේ ම ය. එකල්හි චිත්ත ගැහැවි ස්ථවිර භික්ෂූන් වෙ‍ත එළඹියේ ය. එළඹ ස්ථවිර භික්ෂූන් වැඳ එකත්පස් ව හුන්නේ ය. එකත්පස් වහුන් චිත්ත ගැහැවි ස්ථවිර භික්ෂූන්ට ‍මෙය කී ය:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 522,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සුතං මෙතං භන්තෙ සම්බහුලානං කිර ථෙරානං භික්ඛූනං පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තානං මණ්ඩලමාලෙ සන්නිසින්නානං සන්නිපතිතානං අයමන්තරාකථා උදපාදි: “සඤ්ඤොජනන්ති වා ආවුසො සඤ්ඤොජනියා ධම්මාති වා ඉමෙ ධම්මා නානත්ථා නානාව්යඤ්ජනා? උදාහු එකත්ථා ව්යඤ්ජනමෙව නානන්ති? එකච්චෙහි ථෙරෙහි භික්ඛූහි එවං ව්යාකතං: සඤ්ඤොජනන්ති වා ආවුසො සඤ්ඤොජනියා ධම්මාති වා ඉමෙ ධම්මා නානත්ථා චෙව නානාව්යඤ්ජනා චාති. එකච්චෙහි ථෙරෙහි භික්ඛූහි එවං ව්යාකතං: සඤ්ඤොජනන්ති වා ආවුසො සඤ්ඤොජනියා ධම්මාති වා ඉමෙ ධම්මා එකත්ථා ව්යඤ්ජනමෙව නානන්ති”. එවං ගහපතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සඤ්ඤොජනන්ති වා භන්තෙ සඤ්ඤොජනියා ධම්මාති වා ඉමෙ ධම්මා නානත්ථා චෙව නානා ව්යඤ්ජනා ච. තෙන හි භන්තෙ උපමං වො කරිස්සාමි. උපමායපිධෙකච්චෙ විඤ්ඤූ පුරිසා භාසිතස්ස අත්ථං ආජානන්ති. සෙය්යථාපි භන්තෙ කාළො ච බලිවද්දො ඔදාතො ච බලිවද්දො එකෙන දාමෙන වා යොත්තෙන වා සඤ්ඤුත්තා අස්සු. යො නු ඛො එවං වදෙය්ය: කාළො බලිවද්දො ඔදාතස්ස බලීවද්දස්ස සඤ්ඤොජනං, ඔදාතො ච{1} බලිවද්දො කාළස්ස බලිවද්දස්ස සඤ්ඤොජනන්ති සම්මා නු ඛො වදමානො වදෙය්යාති? නො හෙතං ගහපති,"
                    },
                    {
                        "type": "paragraph",
                        "text": "න ඛො ගහපති කාළො බලිවද්දො ඔදාතස්ස බලීවද්දස්ස සඤ්ඤොජනං, නපි ඔදාතො බලිවද්දො කාළස්ස බලාවද්දස්ස සඤ්ඤොජනං, යෙන ච ඛො තෙ එකෙන දාමෙන වා යොත්තෙන වා සඤ්ඤුත්තා තං තත්ථ සඤ්ඤොජනන්ති. එවමෙව ඛො භන්තෙ, න චක්ඛු රූපානං සඤ්ඤොජනං, න රූපා චක්ඛුස්ස සඤ්ඤොජනං, යඤ්ච තත්ථ තදුභයං පටිච්ච උප්පජ්ජති ඡන්දරාගො තං තත්ථ සඤ්ඤොජනං."
                    },
                    {
                        "type": "paragraph",
                        "text": "න සොතං සද්දානං සඤ්ඤොජනං, න සද්දා සොතස්ස සඤ්ඤොජනං, යඤ්ච තත්ථ තදුභයං පටිච්ච උප්පජ්ජති ඡන්දරාගො තං තත්ථ සඤ්ඤොජනං; න ඝානං ගන්ධානං සඤ්ඤොජනං, න ගන්ධා ඝානස්ස සඤ්ඤොජනං, යඤ්ච තත්ථ තදුභයං පටිච්ච උප්පජ්ජති ඡන්දරාගො තං තත්ථ සඤ්ඤොජනං. න ජිව්හා රසානං සඤ්ඤොජනං, න රසා ජිව්හාය සඤ්ඤොජනං, යඤ්ච තත්ථ තදුභයං පටිච්ච උප්පජ්ජති ඡන්දරාගො තං තත්ථ සඤ්ඤොජනං. න කායො ඵොට්ඨබ්බානං සඤ්ඤොජනං, න ඵොට්ඨබ්බා කායස්ස සඤ්ඤොජනං, යඤ්ච තත්ථ තදුභයං පටිච්ච උප්පජ්ජති ඡන්දරාගො තං තත්ථ සඤ්ඤොජනං. න මනො ධම්මානං සඤ්ඤොජනං, න ධම්මා මනස්ස සඤ්ඤොජනං, යඤ්ච තත්ථ තදුභයං පටිච්ච උප්පජ්ජති ඡන්දරාගො තං තත්ථ සඤ්ඤොජනං. ලාභා තෙ ගහපති සුලද්ධං තෙ ගහපති, යස්ස තෙ ගම්භීරෙ බුද්ධවචනෙ පඤ්ඤාචක්ඛු කමතීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඔදාතො - ස්යා, සී, 1, මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "“වහන්ස, පසුබත පිණ්ඩපාත‍යෙන් වැළකුණු මණ්ඩලමාල‍යෙ‍හි රැස් ව වැඩ හුන් ස්ථවිර භික්ෂූන් අතර “ඇවැත්නි, සංයෝජන ය යි හෝ සංයෝජනිය ධර්මයෝ ය යි හෝ මේ දහම්හු වෙනස් වෙනස් අර්ථ ඇත්තාහු වෙනස් වෙනස් ව්‍යඤ්ජන ඇත්තාහු ද? නැතහොත් එක ම අර්ථ ඇත්තාහු ව්‍යඤ්ජ පමණක් වෙනස් වූවාහු වෙත් දැ? යි, මේ අතුරු කථාව පහළ වී ය” යි ද ඇතැම් ස්ථවිර භික්ෂූන් විසින් “ඇවැත්නි, සංයෝජන ය යි හෝ සංයෝජනීය ධර්මයෝ ය යි හෝ මේ දහම්හු වෙනස් වෙනස් අර්ථ ඇත්තාහු ද වෙනස් වෙනස් ව්‍යඤ්ජන ඇත්තාහු ද වෙති” යි මෙසේ විසඳන ලදැ යි ද, ඇතැම් ස්ථවිර භික්ෂූන් විසින් “ඇවැත්නි, සංයෝජන ය යි හෝ සංයෝජනීය ධර්මයෝ ය යි හෝ මේ දහම්හු එකම අර්ථ ඇත්තාහු ව්‍යඤ්ජන වෙනස් වූවාහු වෙති” යි මෙසේ විසඳන ලදැ යි ද මා විසින් මෙය අසන ලද්දේ” යි. ගැහැවිය, එසේ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "“වහන්ස, සං‍යෝජන ය යි හෝ සංයෝජනිය ධර්මයෝ ය” යි හෝ මේ දහම්හු වෙනස් වෙනස් අර්ථ ඇත්තාහු ද වෙනස් වෙනස් ව්‍යඤ්ජන ඇත්තාහු වෙති. වහන්ස, එසේ වී නම් මුඹ වහන්සේට උපමාවක් කරන්නෙමි. මෙහි ඇතැම් නුවණැති මිනිස්සු උපමාවෙන් ද දේශනාවේ අරුත දැන ගනිත්. වහන්ස, යම්සේ කළු ගොනෙකුත් සුදු ගොනෙකුත් එක් දමෙකින් හෝ එක් යොතෙකින් හෝ බඳනා ලද්දාහු වෙද්ද, කළු ගොන් සුදු ගොනුගේ බැඳුම ය. සුදු ගොන් කළු ගොනුගේ බැඳුම ය යි යමෙක් මෙසේ කියන්නේ නම් (ඒ) කියන්නා මැනවින් කියන්නේ දැ යි. ගැහැවි, මෙය නො වේ ම ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ගැහැවි, කළු ගොන් සුදු ගොනුගේ බැඳුම නොවේ. සුදු ගොන් කළුගොනුගේ බැඳුම නො ද වේ. යම් එක් දමෙකින් හෝ යොතෙකින් හෝ ඔහු බඳනා ලද්දාහු වෙත් නම් එය එහි සංයෝජන යි. වහන්ස, එසෙයින් ම ඇස රූපයනට සංයෝජන නො වේ. රූපයෝ ඇසට සංයෝජන නො වෙති. එහි දෙක නිසා යම් ඡන්දරාගයෙක් උපදී නම් එය එහි සංයෝජන යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "කන සදට සංයෝජන නො වේ. සද කනට සංයෝජන නො වේ. එහි එදෙක නිසා යම් ඡන්දරාගයෙක් උපදී නම් එය එහි සංයෝජන යි. නැහැය ගඳට සංයෝජන නො වේ. ගඳ නැහැයට සංයෝජන නො වේ. එහි එදෙක නිසා යම් ඡන්දරාගයෙක් උපදී නම් එය එහි සංයෝජන යි. දිව රසට සංයෝජන නො වේ. රස දිවට සංයෝජන නො වේ. එහි එදෙක නිසා යම් ඡන්දරාගයෙක් උපදී නම් එය එහි සංයෝජන යි. කය පහසට සංයෝජන නො වේ. පහස කයට සංයෝජන නො වේ. එහි එදෙක නිසා යම් ඡන්ද රාගයක් උපදී නම් එහි සංයෝජන යි. සිත දහමට සංයෝජන නො වේ. දහම් සිතට සංයෝජන නො වේ. එහි එදෙක නිසා යම් ඡන්දරාගයක් උපදී නම් එය එහි සංයෝජන යි. ගැහැවි, යම් බඳු තොපගේ පැනැස ගැඹුරු බුදු වදනෙහි පවතී ද ඒ තොපට ලාභයෙකි. ගැහැවි, තොපට මනා ලැබීමෙකි යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 524,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "7. 1. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඉසිදත්තසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "406. එකං සමයං සම්බහුලා ථෙරා භික්ඛූ මච්ඡිකාසණ්ඩෙ විහරන්ති අම්බාටකවනෙ. අථ ඛො චිත්තො ගහපති යෙන ථෙරා භික්ඛූ තෙනුපසඞ්කමි, උපසඞ්කමිත්වා ථෙරෙ භික්ඛූ අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො චිත්තො ගහපති ථෙරෙ භික්ඛූ එතදවොච: “අධිවාසෙන්තු මෙ භන්තෙ ථෙරා ස්වාතනාය භත්තන්ති”. අධිවාසෙසුං ච ඛො ථෙරා භික්ඛූ තුණ්හීභාවෙන. අථ ඛො චිත්තො ගහපති ථෙරානං භික්ඛූනං අධිවාසනං විදිත්වා උට්ඨායාසනා ථෙරෙ භික්ඛූ අභිවාදෙත්වා පදක්ඛිණං කත්වා පක්කාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ථෙරා භික්ඛූ තස්සා රත්තියා අච්චයෙන පුබ්බන්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය යෙන චිත්තස්ස ගහපතිනො නිවෙසනං තෙනුපසඞ්කමිංසු, උපසඞ්කමිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදිංසු. අථ ඛො චිත්තො ගහපති යෙන ථෙරා භික්ඛූ තෙනුපසඞ්කමි, උපසඞ්කමිත්වා ථෙරෙ භික්ඛූ අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො චිත්තො ගහපති ආයස්මන්තං ථෙරං එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ධාතුනානත්තං ධාතුනානත්තන්ති භන්තෙ ථෙර වුච්චති. කිත්තාවතා නු ඛො භන්තෙ ධාතුනානත්තං වුත්තං භගවතාති? එවං වුත්තෙ ආයස්මා ථෙරො තුණ්හී අහොසි. දුතියම්පි ඛො චිත්තො ගහපති ආයස්මන්තං ථෙරං එතදවොච: ධාතුනානත්තං ධාතුනානත්තන්ති භන්තෙ ථෙර වුච්චති. කිත්තාවතා නු ඛො භන්තෙ ධාතුනානත්තං වුත්තං භගවතාති? දුතියම්පි ඛො ආයස්මා ථෙරො තුණ්හී අහොසි. තතියම්පි ඛො චිත්තො ගහපති ආයස්මන්තං ථෙරං එතදවොච: ධාතුනානත්තං ධාතුනානත්තන්ති භන්තෙ ථෙර වුච්චති. කිත්තාවතා නු ඛො භන්තෙ ධාතුනානත්තං වුත්තං භගවතාති? තතියම්පි ඛො ආයස්මා ථෙරො තුණ්හී අහොසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන ආයස්මා ඉසිදත්තො තස්මිං භික්ඛුසඞ්ඝෙ සබ්බනවකො හොති. අථ ඛො ආයස්මා ඉසිදත්තො ආයස්මන්තං ථෙරං එතදවොච: ව්යාකරොමහං භන්තෙ ථෙර චිත්තස්ස ගහපතිනො එතං පඤ්හන්ති? ව්යාකරොහි ත්වං ආවුසො ඉසිදත්ත චිත්තස්ස ගහපතිනො එතං පඤ්හන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං හි ත්වං ගහපති පුච්ඡසි: ධාතුනානත්තං ධාතුනානත්තන්ති භන්තෙ ථෙර වුච්චති. කිත්තාවතා නු ඛො භන්තෙ ධාතුනානත්තං වුත්තං භගවතාති? එවං භන්තෙ. ඉදං ඛො ගහපති ධාතුනානත්තං වුත්තං භගවතා: චක්ඛුධාතු රූපධාතු චක්ඛුවිඤ්ඤාණධාතු, සොතධාතු සද්දධාතු සොතවිඤ්ඤාණධාතු, ඝානධාතු ගන්ධධාතු ඝානවිඤ්ඤාණධාතු, ජිව්හාධාතු රසධාතු ජිව්හාවිඤ්ඤාණධාතු, කායධාතු ඵොට්ඨබ්බධාතු කායවිඤ්ඤාණධාතු, මනොධාතු, ධම්මධාතු, මනොවිඤ්ඤාණධාතු. එත්තාවතා ඛො ගහපති ධාතුනානත්තං වුත්තං භගවතාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "7. 1. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඉසිදත්‌ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "406. එක්කලෙක බොහෝ ස්ථවිර භික්ෂූහු මච්ඡිකාසණ්ඩයෙහි අම්බාටක වනයෙහි වැඩ වෙසෙති. එකල්හි චිත්ත ගැහැවි තෙමේ ස්ථවිර භික්ෂූන් වෙත එළඹියේ ය. එළඹ ස්ථවිර භික්ෂූන් වැඳ එකත් පස් ව හුන්නේ ය. එකත්පස් ව හුන් චිත්ත ගැහැවි ස්ථවිර භික්ෂූන්ට “වහන්ස, ස්ථවිර භික්ෂූහු සෙට පිණිස මාගේ බත ඉවසත්වා” යි මෙය කී ය. ස්ථවිර භික්ෂූහු නිශ්ශබ්ද භාවයෙන් ඉවසූහ. එකල්හි චිත්ත ගැහැවි ස්ථවිර භික්ෂූන්ගේ ඉවසීම දැන හුනස්නෙන් නැගිට ස්ථවිර භික්ෂූන් වැඳ පැදකුණු කොට ගියේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉක්බිති ස්ථවිර භික්ෂූහු ඒ රැය ගෙවීමෙන් පෙරවරු හැඳ පෙරව පා සිවුරු ගෙන චිත්ත ගැහැවිහුගේ නිවස වෙත එළඹියහ. එළඹ පැන වූ අසුන්හි වැඩහුන්හ. එකල්හි චිත්ත ගැහැවි ස්ථවිර භික්ෂූන් වෙත එළඹියේ ය. එළඹ ස්ථවිර භික්ෂූන් වැඳ එකත්පස්ව හුන්නේ ය. එකත්පස් ව හුන් චිත්ත ගැහැවි ආයුෂ්මත් තෙරුන්ට මෙය කීය:",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, තෙරණුවනි, ධාතුනානාත්ව ය ධාතුනානාත්ව ය යි කියනු ලැබේ. වහන්ස, කොපමණකින් ධාතුනානාත්වය භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේ දැ? යි. මෙසේ කී කල්හි ආයුෂ්මත් තෙරණුවෝ නිශ්ශබ්ද වූහ. දෙවනවට දු චිත්ත ගැහැවි ආයුෂ්මත් තෙරුන්ට මෙය කී ය: වහන්ස, තෙරණුවනි, ධාතුනානාත්වය ධාතුනානාත්වය යි කියනු ලැබේ. වහන්ස, කොපමණකින් ධාතුනානාත්වය භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේ දැ? යි. දෙවනවට දු ආයුෂ්මත් තෙරණුවෝ නිශ්ශබ්ද වූහ. තෙවනවට දු චිත්ත ගැහැවි ආයුෂ්මත් තෙරුන්ට මෙය කී ය: වහන්ස, තෙරණුවනි, ධාතුනානාත්වය ධාතුනානාත්වය යි කියනු ලැබේ. වහන්ස, කොපමණකින් ධාතුනානාත්වය භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේ දැ? යි. තෙවනවට දු ආයුෂ්මත් තෙරණුවෝ නිශ්ශබ්ද වූහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එසමයෙහි ආයුෂ්මත් ඉසිදත්ත තෙරණුවෝ ඒ බික්සඟන අතර සියල්ලන්ට නවක වෙති. ඉක්බිති ආයුෂ්මත් ඉසිදත්ත ආයුෂ්මත් තෙරුණට මෙය කී ය: වහන්ස, තෙරණුවනි, චිත්ත ගැහැවිහුගේ මේ පැනය මම විසඳම් දැ? යි. ඇවැත්නි, ඉසිදත්තයෙනි, චිත්ත ගැහැවිහුගේ මේ පැනය තෙපි විසඳව යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ගැහැවි, තෙපි “වහන්ස තෙරණුවනි, ධාතුනානාත්වය ධාතුනානාත්වය යි කියනු ලැබේ. වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් කෙතෙකින් ධාතුනානාත්වය වදාරන ලද්දේ දැ” යි මෙසේ විචාරවු දැ? යි. වහන්ස, එසේ ය. ගැහැවි, භාග්‍යවතුන් වහන්සේ විසින් මේ ධාතුනානාත්වය වදාරන ලදි. චක්ඛුධාතු ය රූපධාතු ය චක්ඛුවිඤ්ඤාණධාතු ය, සොතධාතු ය සද්දධාතු ය සොතවිඤ්ඤාණධාතු ය, ඝානධාතු ය ගන්ධධාතු ය ඝානවිඤ්ඤාණධාතු ය, ජිව්හාධාතු ය රසධාතු ය ජිව්හාවිඤ්ඤාණධාතු ය, කායධාතු ය පොට්ඨබ්බධාතු ය කායවිඤ්ඤාණධාතු ය, මනොධාතු ය ධම්මධාතු ය මනොවිඤ්ඤාණධාතු ය යි. ගැහැවි, භාග්‍යවතුන් වහන්සේ විසින් ධාතුනානාත්වය මෙතෙකින් වදාරන ලද්දේ ය යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 526,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො චිත්තො ගහපති ආයස්මතො ඉසිදත්තස්ස භාසිතං අභිනන්දිත්වා අනුමොදිත්වා ථෙරෙ භික්ඛූ පණීතෙන ඛාදනීයෙන භොජනීයෙන සහත්ථා සන්තප්පෙසි, සම්පවාරෙසි. අථ ඛො ථෙරා භික්ඛූ භුත්තාවිනො ඔනීතපත්තපාණිනො උට්ඨායාසනා පක්කමිංසු. අථ ඛො ආයස්මා ථෙරො ආයස්මන්තං ඉසිදත්තං එතදවොච: සාධු ඛො තං{1} ආවුසො ඉසිදත්ත එසො පඤ්හො පටිභාසි{2}, නෙසො පඤ්හො මං පටිභාසි. තෙනහාවුසො{3} ඉසිදත්ත, යදා අඤ්ඤදාපි{4} එවරූපො පඤ්හො ආගච්ඡෙය්ය, තංයෙවෙත්ථ පටිභාසෙය්යාති.{5}"
                    },
                    {
                        "type": "centered",
                        "text": "7. 1. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතියඉසිදත්තසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "407. එකං සමයං සම්බහුලා ථෙරා භික්ඛූ මච්ඡිකාසණ්ඩෙ විහරන්ති අම්බාටකවනෙ. අථ ඛො චිත්තො ගහපති යෙන ථෙරා භික්ඛූ තෙනුපසඞ්කමි, උපසඞ්කමිත්වා ථෙරෙ භික්ඛූ අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො චිත්තො ගහපති ථෙරෙ භික්ඛූ එතදවොච: අධිවාසෙන්තු මෙ භන්තෙ ථෙරා ස්වාතනාය භත්තන්ති. අධිවාසෙසුං ඛො ථෙරා භික්ඛූ තුණ්හීභාවෙන. අථ ඛො චිත්තො ගහපති ථෙරානං භික්ඛූනං අධිවාසනං විදිත්වා උට්ඨායාසනා ථෙරෙ භික්ඛූ අභිවාදෙත්වා පදක්ඛිණං කත්වා පක්කාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ථෙරා භික්ඛූ තස්සා රත්තියා අච්චයෙන පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය යෙන චිත්තස්ස ගහපතිස්ස නිවෙසනං තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදිංසු. අථ ඛො චිත්තො ගහපති යෙන ථෙරා භික්ඛූ තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ථෙරෙ භික්ඛූ අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො චිත්තො ගහපති ආයස්මන්තං ථෙරං එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "යා ඉමා භන්තෙ ථෙර අනෙකවිහිතා දිට්ඨියො ලොකෙ උප්පජ්ජන්ති: සස්සතො ලොකො’ති වා, අසස්සතො ලොකො’ති වා, අන්තවා ලොකො’ති වා, අනන්තවා ලොකො’ති වා, තං ජීවං තං සරීර’න්ති වා, අඤ්ඤං ජීවං අඤ්ඤං සරීර’න්ති වා, හොති තථාගතො පරම්මරණා’ති වා, න හොති තථාගතො පරම්මරණා’ති වා, හොති ච න ච හොති තථාගතො පරම්මරණාති වා, නෙව හොති න න හොති තථාගතො පරම්මරණා’ති වා. යානිචිමානි ද්වාසට්ඨිදිට්ඨිගතානි බ්රහ්මජාලෙ භණිතානි. ඉමා නු ඛො භන්තෙ දිට්ඨියො කිස්මිං සති හොන්ති කිස්මිං අසති න හොන්තීති?"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ත්වං - සබ්බත්ථ"
                    },
                    {
                        "type": "footnote",
                        "text": "2. අභාසි - සී, 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "3. තෙන ආවුසො - සීමු, සී, 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "4. අඤ්ඤථාපි - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. භාසෙය්යාමාති - සී 1, 2. භාස්යොසීති - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "ඉක්බිති චිත්ත ගැහැවි ආයුෂ්මත් ඉසිදත්ත තෙරුන්ගේ දේශනාව පිළිගෙන අනුමෝදන් ව ස්ථවිර භික්ෂූන් ප්‍රණීත වූ කෑයුතු දැයින් ද සියතින් සැතැප්පී ය, මැනවින් පැවරී ය. ඉක්බිති ස්ථවිර භික්ෂූන් වැළඳුවාහු පාත්‍රයෙන් ඉවත් කළ අත් ඇත්තාහු හුනස්නෙන් නැඟී වැඩියහ. එකල්හි ආයුෂ්මත් තෙරණුවෝ ආයුෂ්මත් ඉසිදත්තහට මෙය කීහ: ඇවැත්නි, ඉසිදත්තයෙනි, මේ ප්‍රශ්නය තොපට මැනවින් වැටහුණේ ය. මේ ප්‍රශ්නය මට නො වැටහුණේ ය. ඇවැත්නි, ඉසිදත්තයෙනි, එසේ වී නම් යම් අන් කලෙක්හි දු මෙබඳු ප්‍රශ්නයක් එන්නේ නම් එහි ලා තොපටම වැටහෙන්නේ ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "7. 1. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතිය ඉසිදත්‌ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "407. ඒක් කලෙක බොහෝ ස්ථවිර භික්ෂූහු මච්ඡිකාසණ්ඩයෙහි අම්බාටක වනයෙහි වැඩවෙසෙති. එකල්හි චිත්ත ගැහැවි තෙමේ ස්ථවිර භික්ෂූන් වෙත එළඹියේ ය. එළඹ ස්ථවිර භික්ෂූන් වැඳ එකත් පසෙක හුන්නේ ය. එකත්පසෙක හුන් චිත්ත ගැහැවි ස්ථවිර භික්ෂූන්ට මෙය කී ය: වහන්ස, තෙරහු හෙට පිණිස වූ මාගේ බත ඉවසත්වා යි. ස්ථවිර භික්ෂූහු නිශ්ශබ්ද භාවයෙන් ඉවසූහ. එකල්හි චිත්ත ගැහැවි ස්ථවිර භික්ෂූන්ගේ ඉවසීම දැන හුනස්නෙන් නැඟී ස්ථවිර භික්ෂූන් වැඳ පැදකුණු කොට ගියේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉක්බිති ස්ථවිර භික්ෂූහු ඒ රැය ඇවෑමෙන් පෙරවරු හැඳ පෙරව පා සිවුරු ගෙන චිත්ත ගැහැවිහුගේ නිවෙස්නට එළඹියහ. එළඹ පැනවූ අසුන්හි හුන්හ. එකල්හි චිත්ත ගැහැවි ස්ථවිර භික්ෂූන් වෙත එළඹියේ ය. එළඹ ස්ථවිර භික්ෂූන් වැඳ එකත්පසෙක හුන්නේය. එකත්පසෙක හුන් චිත්ත ගැහැවි ආයුෂ්මත් තෙරුන්ට මෙය කීය:",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස තෙරනුවනි, “ලෝකය ශාස්වත ය යි හෝ ලෝකය අශාස්වත ය යි හෝ ලොකය අන්තවත් ය යි හෝ ලෝකය අන්ත රහිත ය යි හෝ එ ම ජීව ය එ ය ම ශරීර ය යි හෝ ජීවය අනිකෙක ශරීරය අනිකකැ යි හෝ සත්ත්වයා මරණින් මතු වේ ය යි හෝ සත්ත්වයා මරණින් මතු නො වේ ය යි හෝ සත්ත්වයා මරණින් මතු වෙයි නො ද වේ ය යි හෝ සත්ත්වයා මරණින් මතු නො ම වෙයි නො ම නො වේ” යයි හෝ යම් මේ නන්වැදෑරුම් දිටුහු ලොව උපදිද් ද, යම් මේ දෙසැට මිසදිටු කෙනෙකුත් බ්‍රහ්මජාල සූත්‍රයෙහි වදාරන ලද්දාහු ද, වහන්ස, මේ දිටුහු කුමක් ඇති කල්හි වෙත් ද? කුමක් නැති කල්හි නො වෙද්දැ?යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 528,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එවං වුත්තෙ ආයස්මා ථෙරො තුණ්හී අහොසි. දුතියම්පි ඛො චිත්තො ගහපති -පෙ- තතියම්පි ඛො චිත්තො ගහපති ආයස්මන්තං ථෙරං එතදවො ච: යා ඉමා භන්තෙ ථෙර අනෙකවිහිතා දිට්ඨියො ලොකෙ උප්පජ්ජන්ති. සස්සතො ලොකොති වා, අසස්සතො ලොකොති වා, අන්තවා ලොකොති වා, අනන්තවා ලොකොති වා, තං ජීවං තං සරීරන්ති වා, අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති වා, හොති තථාගතො පරම්මරණාති වා, න හොති තථාගතො පරම්මරණාති වා, හොති ච න ච හොති තථාගතො පරම්මරණාති වා, නෙව හොති න න හොති තථාගතො පරම්මරණාති වා. යානිචිමානි ද්වාසට්ඨිදිට්ඨිගතානි බ්රහ්මජාලෙ භණිතානි. ඉමා නු ඛො භන්තෙ, දිට්ඨියො කිස්මිං සති හොන්ති, කිස්මිං අසති න හොන්තීති? තතියම්පි ඛො ආයස්මා ථෙරො තුණ්හී අහොසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන ආයස්මා ඉසිදත්තො තස්මිං භික්ඛුසඞ්ඝෙ සබ්බනවො හොති. අථ ඛො ආයස්මා ඉසිදත්තො ආයස්මන්තං ථෙරං එතදවොච: ව්යාකරොමහං භන්තෙ ථෙර චිත්තස්ස ගහපතිනො එතං පඤ්හන්ති? ව්යාකරොහි ත්වං ආවුසො ඉසිදත්ත චිත්තස්ස ගහපතිනො එතං පඤ්හන්ති. එවං ත්වං ගහපති පුච්ඡසි: යා ඉමා භන්තෙ ථෙර අනෙකවිහිතා දිට්ඨියො ලොකෙ උප්පජ්ජන්ති: සස්සතො ලොකොති වා -පෙ- ඉමා නු ඛො භන්තෙ දිට්ඨියො කිස්මිං සති හොන්ති කිස්මිං අසති න හොන්තීති? එවං භන්තෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "යා ඉමා ගහපති අනෙකවිහිතා දිට්ඨියො ලොකෙ උප්පජ්ජන්ති: සස්සතො ලොකොති වා, අසස්සතො ලොකොති වා, අන්තවා ලොකොති වා, අනන්තවා ලොකොති වා, තං ජීවං තං සරීරන්ති වා, අඤ්ඤං ජීවං අඤ්ඤං සරීරන්ති වා, හොති තථාගතො පරම්මරණාති වා, න හොති තථාගතො පරම්මරණාති වා, හොති ච න ච හොති තථාගතො පරම්මරණාති වා, නෙව හොති න නහොති තථාගතො පරම්මරණාති වා. යානිචිමානි ද්වාසට්ඨි දිට්ඨිගතානි බ්රහ්මජාලෙ භණිතානි. ඉමා ඛො ගහපති දිට්ඨියො සක්කායදිට්ඨියා සති හොන්ති සක්කායදිට්ඨියා අසති න හොන්තීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථම්පන භන්තෙ සක්කායදිට්ඨි හොතීති? ඉධ ගහපති අස්සුතවා පුථුජ්ජනො අරියානං අදස්සාවී අරියධම්මස්ස අකොවිදො අරියධම්මෙ අවිනීතො, සප්පුරිසානං අදස්සාවී සප්පුරිසධම්මස්ස අකොවිදො සප්පුරිසධම්මෙ අවිනීතො රූපං අත්තතො සමනුපස්සති, රූපවන්තං වා අත්තානං, අත්තනි වා රූපං, රූපස්මිං වා අත්තානං; වෙදනං අත්තතො සමනුපස්සති -පෙ- සඤ්ඤං -පෙ- සඞ්ඛාරෙ -පෙ- විඤ්ඤාණං අත්තතො සමනුපස්සති, විඤ්ඤාණවන්තං වා අත්තානං, අත්තනි වා විඤ්ඤාණං, විඤ්ඤාණස්මිං වා අත්තානං. එවං ඛො ගහපති සක්කායදිට්ඨි හොතීති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මෙසේ කී කල්හි ආයුෂ්මත් තෙරණුවෝ නිශ්ශබ්ද වූහ. දෙවනුවට දු චිත්ත ගැහැවි තෙමේ … තෙවනුවට දු චිත්ත ගැහැවි තෙමේ ආයුෂ්මත් තෙරුන්ට මෙය කී ය: වහන්ස තෙරනුවනි, “ලෝකය ශාස්වත ය යි හෝ ලෝකය අශාස්වත ය යි හෝ ලොකය අන්තවත් ය යි හෝ ලෝකය අන්ත රහිත ය යි හෝ එය ම ජීව ය එය ම ශරීර ය යි හෝ ජීවය අනෙකෙක, ශරීරය අනෙකෙකැ යි හෝ සත්ත්වයා මරණින් මතු වේ ය යි හෝ සත්ත්වයා මරණින් මතු නො වේ යයි හෝ සත්ත්වයා මරණින් මතු වෙයි නො ද වේ යයි හෝ සත්ත්වයා මරණින් මතු නො ම වෙයි නො ම නො වේ” යයි හෝ යම් මේ නන්වැදෑරුම් දිටුහු නූපදිද් ද? යම් මේ දෙසැට මිසදිටු කෙනෙකුත් බ්‍රහ්මජාල සූත්‍රයෙහි වදාරන ලද්දාහු ද, වහන්ස, මේ දිටුහු කුමක් ඇති කල්හි වෙත් ද? කුමක් නැති කල්හි නො වෙද්දැ? යි. තෙවනුවට දු ආයුෂ්මත් තෙරණුවෝ නිශ්ශබ්ද වූහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එසමයෙහි ආයුෂ්මත් ඉසිදත්ත තෙරණුවෝ ඒ බික්සඟන කෙරෙහි සියල්ලන්ට නවක වෙති. එකල්හි ආයුෂ්මත් ඉසිදත්ත තෙරණුවෝ ආයුෂ්මත් තෙරුන්ට මෙය කීහ: වහන්ස තෙරණුවනි, චිත්ත ගැහැවිහුගේ මේ පැනය මම විසඳම් දැ? යි. ඇවැත්නි ඉසිදත්තයෙනි, චිත්ත ගැහැවියුගේ මේ පැනය තෙපි විසඳව යි. ගැහැවි, තෙපි “වහන්ස තෙරණුවනි, ලෝකය ශාස්වත යයි හෝ … යම් මේ නන් වැදෑරුම් දිටුහු ලොව උපදිද් ද? වහන්ස, මේ දිටුහු කුමක් ඇති කල්හි වෙත් ද? කුමක් නැති කල්හි නො වෙත් දැ?යි මෙසේ විචාරවු දැයි. වහන්ස එසේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ගැහැවිය, “ලෝකය ශාස්වත ය යි හෝ ලෝකය අශාස්වත ය යි හෝ ලෝකය අන්තවත් යයි හෝ ලෝකය අන්ත රහිතය යි හෝ එ ම ජීව ය එ ම ශරීර ය යි හෝ ජීවය අනෙකෙක, ශරීරය අනෙකෙකැ යි සත්ත්වයා මරණින් මතු වේ ය යි හෝ සත්ත්වයා මරණින් මතු නො වේ ය යි හෝ සත්ත්වයා මරණින් මතු වෙයි නො ද වේ යයි හෝ සත්ත්වයා මරණින් මතු නො ම වෙයි නො ම නො වේ” යයි හෝ යම් මේ නන්වැදෑරුම් දිටුහු ලොව උපදිද් ද, යම් මේ දෙසැට මිසදිටු කෙනෙකුත් බ්‍රහ්මජාල සූත්‍රයෙහි වදාරන ලද්දාහු ද, ගැහැවිය, මේ දිටුහු සක්කාය දිට්ඨිය ඇති කල්හි වෙත්, සක්කාය දිට්ඨිය නැති කල්හි නො වෙති යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, සක්කාය දිට්ඨිය කෙසේ වේ දැ? යි. ගැහැවිය, මෙහි ආර්‍ය්‍යයන් නො දක්නාසුලු ආර්‍ය්‍යධර්‍මයෙහි අදක්ෂ වූ ආර්‍ය්‍යධර්‍මයෙහි නො හික්මුණු සත්පුරුෂයන් නො දක්නාසුලු සත්පුරුෂ ධර්‍මයෙහි අදක්ෂ වූ සත්පුරුෂ ධර්‍මයෙහි නො හික්මුනු අශ්‍රැතවත් පෘථග්ජන තෙමේ රූපය ආත්මය යි හෝ ආත්මය රූපවත් යයි හෝ ආත්මයෙහි රූපය පවතී යයි හෝ රූපයෙහි ආත්මය පවතී යයි හෝ දකී. වේදනාව ආත්ම යයි හෝ … දකී. සංඥාව … සංස්කාර … විඥානය ආත්ම යයි හෝ ආත්මය විඥානවත් යයි හෝ ආත්මයෙහි විඥානය පවතී යයි හෝ විඥානයෙහි ආත්මය පවතී යයි හෝ දකී. ගැහැවිය, මෙසේ සක්කායදිට්ඨිය වේ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 530,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථම්පන භන්තෙ සක්කායදිට්ඨි න හොතීති? ඉධ ගහපති සුතවා අරියසාවකො අරියානං දස්සාවී අරියධම්මස්ස කොවිදො අරියධම්මෙ සුවිනීතො සප්පුරිසානං දස්සාවී සප්පුරිසධම්මස්ස කොවිදො සප්පුරිසධම්මෙ සුවිනීතො න රූපං අත්තතො සමනුපස්සති, න රූපවන්තං වා අත්තානං, න අත්තනි වා රූපං, න රූපස්මිං වා අත්තානං; න වෙදනං -පෙ- න සඤ්ඤං -පෙ- න සඞ්ඛාරෙ -පෙ- න විඤ්ඤාණං අත්තතො සමනුපස්සති, න විඤ්ඤාණවන්තං වා අත්තානං, න අත්තනි වා විඤ්ඤාණං, න විඤ්ඤාණස්මිං වා අත්තානං. එවං ඛො ගහපති, සක්කායදිට්ඨි න හොතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කුතො භන්තෙ අය්යො ඉසිදත්තො ආගච්ඡතීති? අවන්තියා ඛවාහං ගහපති ආගච්ඡාමීති. අත්ථි භන්තෙ අවන්තියා ඉසිදත්තො නාම කුලපුත්තො අම්හාකං අදිට්ඨසහායො පබ්බජිතො දිට්ඨො සො ආයස්මතාති? එවං ගහපතීති. කහං නු ඛො සො භන්තෙ ආයස්මා එතරහි විහරතීති? එවං වුත්තෙ ආයස්මා ඉසිදත්තො තුණ්හී අහොසි. අය්යො නො භන්තෙ ඉසිදත්තොති? එවං ගහපතීති. අභිරමතු භන්තෙ අය්යො ඉසිදත්තො මච්ඡිකාසණ්ඩෙ. රමණීයං අම්බාටකවනං. අහං අය්යස්ස ඉසිදත්තස්ස උස්සුක්කං කරිස්සාමි චීවර-පිණ්ඩපාත-සෙනාසන-ගිලානප්පච්චය-භෙසජ්ජපරික්ඛාරානන්ති. කල්යාණං වුච්චති ගහපතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො චිත්තො ගහපති ආයස්මතො ඉසිදත්තස්ස භාසිතං අභිනන්දිත්වා අනුමොදිත්වා ථෙරෙ භික්ඛූ පණීතෙන ඛාදනීයෙන භොජනීයෙන සහත්ථා සන්තප්පෙසි සම්පවාරෙසි. අථ ඛො ථෙරා භික්ඛූ භුත්තාවිනො ඔනීතපත්තපාණිනො උට්ඨායාසනා පක්කමිංසු."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා ථෙරො ආයස්මන්තං ඉසිදත්තං එතදවොච: සාධු ඛො තං ආවුසො ඉසිදත්ත එසො පඤ්හො පටිභාසි. නෙසො පඤ්හො මං පටිභාසි. තෙනහාවුසො{1} ඉසිදත්ත යදා අඤ්ඤදාපි එවරූපො පඤ්හො ආගච්ඡෙය්ය, තං යෙවෙත්ථ පටිභාසෙය්යාති. අථ ඛො ආයස්මා ඉසිදත්තො සෙනාසනං සංසාමෙත්වා පත්තචීවරං ආදාය මච්ඡිකාසණ්ඩම්හා පක්කාමි. යං මච්ඡිකාසණ්ඩම්හා පක්කාමි, තථා පක්කන්තොව අහොසි, න පුන පච්චාගඤ්ඡීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. තෙන ආවුසො - සී 1, 2."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "වහන්ස, කෙසේ නම් සක්කායදිට්ඨිය නො වේ දැ? යි. ගැහැවිය, මෙහි ආර්‍ය්‍යයන් දක්නාසුලු ආර්‍ය්‍යධර්‍මයෙහි දක්ෂ වූ ආර්‍ය්‍යධර්‍මයෙහි හික්මුණු සත්පුරුෂයන් දක්නාසුලු සත්පුරුෂ ධර්‍මයෙහි දක්ෂ වූ සත්පුරුෂ ධර්‍මයෙහි හික්මුනු ශ්‍රැතවත් ආර්‍ය්‍යශ්‍රාවක තෙමේ රූපය ආත්මය යි හෝ නො දකී, ආත්මය රූපවත් යයි හෝ නො දකී, ආත්මයෙහි රූපය පවතී යයි හෝ නො දකී. රූපයෙහි ආත්මය පවතී යයි හෝ නො දකී. වේදනාව … නො දකී, සංඥාව … නො දකී, සංස්කාර … නො දකී, විඥානය ආත්මය යි හෝ නො දකී, ආත්මය විඥානවත් යයි හෝ නො දකී, ආත්මයෙහි විඥානය පවතී යයි හෝ නො දකී, විඥානයෙහි ආත්මය පවතී යයි හෝ නො දකී. ගැහැවිය, මෙසේ සක්කායදිට්ඨිය නො වේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, ආර්‍ය්‍ය වූ ඉසිදත්ත ‍තෙරණුවෝ කොහි සිට වඩිද්දැ? යි. ගැහැවිය, මම අවන්ති දනව්වෙන් එමි යි. වහන්ස, අපගේ නුදුටු යහළු වූ ඉසිදත්ත නම් පැවිදි කුලපුතෙක් අවන්ති දනව්වෙහි ඇත. ආයුෂ්මතුන් වහන්සේ විසින් හෙතෙමේ දක්නා ලද්දේ දැ? යි. ගැහැවිය, එසේ යයි. වහන්ස, ඒ ආයුෂ්මතුන් වහන්සේ දැන් කොහි වෙසෙත්දැ යි. මෙසේ කී කල්හි ආයුෂ්මත් ඉසිදත්ත තෙරණුවෝ නිශ්ශබ්ද වූහ. වහන්ස, ආර්‍ය්‍යයෝ අපගේ ඉසිදත්තයෝ දැ? යි. ගැහැවිය, එසේ යයි. වහන්ස, ආර්‍ය්‍ය වූ ඉසිදත්ත තෙරණුවෝ මච්ඡිකාසණ්ඩයෙහි සිත් අලවා වෙසෙන සේක්වා. අම්බාටක වනය සිත්කලු ය. මම ආර්‍ය්‍ය වූ ඉසිදත්ත තෙරණුවන්ට සිවුරු පිඬුවා සෙනසුන් ගිලන්පස බෙහෙත් පිරිකර සැපයීමෙහි උත්සාහ කරන්නෙමි. ගැහැවිය, යහපතක් කියනු ලැබේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉක්බිති චිත්ත ගැහැවි ආයුෂ්මත් ඉසිදත්ත තෙරණුවන්ගේ දේශනාව පිළිගෙන අනුමෝදන් ව ස්ථවිර භික්ෂූන් ප්‍රණීත වූ කෑයුතු බිදිය යුතු දැයින් සියතින් සැතැප්පී ය. මැනවින් පැවරී ය. ඉක්බිති ආයුෂ්මත් ස්ථවිර භික්ෂූහු වැළඳුවාහු පාත්‍රයෙන් ඉවත් කළ අත් ඇත්තාහු හුනස්නෙන් නැඟී වැඩියහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉන්පසු ආයුෂ්මත් තෙරණුවෝ ආයුෂ්මත් ඉසිදත්තයනට මෙය කීහ: ඇවැත්නි ඉසිදත්තයෙනි, මේ පැනය තොපට මැනවින් වැටහුණේ ය. මේ පැනය මට නො වැටහුණේ ය. ඇවැත්නි ඉසිදත්තයෙනි, එහෙයින් යම් අන්කලෙකැදු මෙබඳු පැනයෙක් එන්නේ නම් එහි ලා තොපට ම වැටහේවා යයි. ඉක්බිති ආයුෂ්මත් ඉසිදත්ත තෙරනුවෝ සෙනසුන සකසා තබා පා සිවුරු ගෙන මච්ඡිකාසණ්ඩයෙන් නික්ම ගියාහ. යම් සේ මච්ඡිකාසණ්ඩයෙන් ගියාහු ද එසේ ගියාහු ම වූහ. යළි පෙරළා නො ආහ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 532,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "7. 1. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මහකසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "408. එකං සමයං සම්බහුලා ථෙරා භික්ඛූ මච්ඡිකාසණ්ඩෙ විහරති අම්බාටකවනෙ. අථ ඛො චිත්තො ගහපති යෙන ථෙරා භික්ඛූ තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ථෙරෙ භික්ඛූ අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො චිත්තො ගහපති ථෙරෙ භික්ඛූ එතදවොච: අධිවාසෙන්තු මෙ භන්තෙ ථෙරා ස්වාතනාය ගොකුලෙ භත්තන්ති. අධිවාසෙසුං ඛො ථෙරා භික්ඛූ තුණ්හීභාවෙන. අථ ඛො චිත්තො ගහපති ථෙරානං භික්ඛූනං අධිවාසනං විදිත්වා උට්ඨායාසනා ථෙරෙ භික්ඛූ අභිවාදෙත්වා පදක්ඛිණං කත්වා පක්කාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ථෙරා භික්ඛූ තස්සා රත්තියා අච්චයෙන පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය යෙන චිත්තස්ස ගහපතිනො ගොකුලං තෙනුපසඞ්කමිංසු, උපසඞ්කමිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදිංසු. අථ ඛො චිත්තො ගහපති ථෙරෙ භික්ඛූ පණීතෙන සප්පිපායාසෙන සහත්ථා සන්තප්පෙසි සම්පවාරෙසි. අථ ඛො ථෙරා භික්ඛූ භුත්තාවිනො ඔනීතපත්තපාණිනො උට්ඨායාසනා පක්කමිංසු. චිත්තොපි ඛො ගහපති සෙසකං විස්සජ්ජෙථාති වත්වා ථෙරෙ භික්ඛූ පිට්ඨිතො පිට්ඨිතො අනුබන්ධි."
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන උණ්හං හොති කුඨිතං{1}, තෙ ච ථෙරා භික්ඛූ පවෙලියමානෙන මඤ්ඤෙ කායෙන ගච්ඡන්ති යථා තං සුභොජනං භුත්තාවිනො. තෙන ඛො පන සමයෙන ආයස්මා මහකො තස්මිං භික්ඛුසඞ්ඝෙ සබ්බනවකො හොති. අථ ඛො ආයස්මා මහකො ආයස්මන්තං ථෙරං එතදවොච: සාධු ඛ්වස්ස භන්තෙ ථෙර{2} යං සීතකො වාතො වායෙය්ය, අබ්භසම්පිලාපො{3} ච අස්ස, දෙවො ච එකමෙකං ඵුසායෙය්යාති{4}. සාධු ඛ්වස්ස ආවුසො මහක යං සීතකො ච වාතො වායෙය්ය, අබ්භසම්පිලාපො ච අස්ස, දෙවො ච එකමෙකං ඵුසායෙය්යාති. අථ ඛො ආයස්මා මහකො තථාරූපං ඉද්ධාභිසඞ්ඛාරං අභිසඞ්ඛාසි{5} යථා සීතකො ච වාතො වායිත්ථ{6} අබ්භසම්පිලාපො ච අස්ස, දෙවො ච එකමෙකං ඵුසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො චිත්තස්ස ගහපතිස්ස{7} එතදහොසි: යො ඛො ඉමස්මිං භික්ඛුසඞ්ඝෙ සබ්බනවකො භික්ඛු, තස්ස{8} එවරූපො ඉද්ධානුභාවොති. අථ ඛො ආයස්මා මහකො ආරාමං සම්පාපුණිත්වා ආයස්මන්තං ථෙරං එතදවොච: අලමෙත්තාවතා භන්තෙ ථෙරාති. අලමෙත්තාවතා ආවුසො මහක, කතමෙත්තාවතා ආවුසො මහක, පූජිතමෙත්තාවතා ආවුසො මහකාති. අථ ඛො ථෙරා භික්ඛූ යථාවිහාරං අගමංසු. ආයස්මාපි මහකො සකං විහාරං අගමාසි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කුට්ඨිතං - ස්යා, අට්ඨකථා කිකිටං සී 1, 2. කුථිතං?"
                    },
                    {
                        "type": "footnote",
                        "text": "2. ථෙරස්ස - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අබ්භිසම්භිලාපො - සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "4. ඵුසයෙය්ය - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. අභිසඞ්ඛරි - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "6. වායි - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "7. ගහපතිනො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "8. තස්සායං - මඡසං, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "7. 1. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මහක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "408. එක්කලෙක බොහෝ වූ තෙර මහණහු මච්ඡිකාසණ්ඩයෙහි අම්බාටක වනයෙහි වැඩවෙසෙති. එකල්හි චිත්ත ගැහැවි තෙමේ තෙර මහණුන් වෙත එළඹියේය. එළඹ තෙර මහණුන් වැඳ එකත්පස්ව හුන්නේ ය. එකත්පස් ව හුන් චිත්ත ගැහැවි තෙර මහණුන්ට මෙය කීය: වහන්ස, තෙරහු සෙට දවස පිණිස වූ මාගේ ගෝකුලයෙහි බත ඉවසත්වා යි. තෙර මහණහු නිහඬබැවින් ඉවසූහ. එකල්හි චිත්ත ගැහැවි තෙර මහණුන්ගේ ඉවසීම දැන හුනස්නෙන් නැඟී තෙර මහණහු වැඳ පැදකුණු කොට ගියේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉක්බිති තෙර මහණහු ඒ රැය ඇවෑමෙන් පෙරවරු හැඳ පෙරව පා සිවුරු ගෙන චිත්ත ගැහැවිහුගේ ගෝකුලය වෙත එළඹියහ. එළඹ පැන වූ අසුන්හි හිඳගත්හ. එකල්හි චිත්ත ගැහැවි තෙර මහණුන් ප්‍රණීත වූ ගිතෙල්මුසු කිරිබතින් සියතින් සැතැප්පී ය. මැනවින් පැවරීය. ඉක්බිති තෙර මහණහු වැළඳුවාහු පාත්‍රයෙන් ඉවත් කළ අත් ඇත්තාහු හුනස්නෙන් නැඟී වැඩියහ. චිත්ත ගැහැවි තෙමේ ද සෙස්ස බැහැර කරවයි කියා තෙර මහණුන් පසු පස අනු ගමන් කෙළේය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එසමයෙහි කැකෑරෙන උණුසුම වෙයි. ඒ තෙර මහණහු ද මිහිරි බොජුන් වැළඳූවන් සේ පැසෙන හැකිළෙන කයින් යුතු ව මෙන් යෙති. එකල්හි ආයුෂ්මත් මහක තෙරණුවෝ ඒ බික් සඟන අතර සියල්ලන්ට නවක වෙති. එකල ආයුෂ්මත් මහක තෙරණුවෝ ආයුෂ්මත් තෙරුන්ට මෙය කීහ: වහන්ස, තෙරණුවනි, “යම් හෙයකින් සිහිල් සුළඟ හමන්නේ නම් වලාකුළු පාවීමෙකුත් වන්නේ නම් වැස්සත් එක එක පොද හෙලන්නේ වී නම් යහපත් වන්නේ දැ?” යි. ඇවැත්නි, මහකයෙනි, යම් හෙයකින් සිහිල් සුළඟ හමන්නේ නම් වලාකුළු පාවීමෙකුත් වන්නේ නම් වැස්සත් එක එක පොද හෙලන්නේ වී නම් යහපතැ යි. එකල්හි ආයුෂ්මත් මහක තෙමේ යම් සේ සිහිල් සුළඟත් හැමී ද වලාකුළු පාවීමත් වී ද වැස්සත් එක එක පොද හෙළී ද එබඳු සෘද්ධියක් කෙළේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එකල්හි චිත්ත ගැහැවිහට මෙබඳු සිතෙක් විය: “මේ බික් සඟන අතර සියල්ලන්ට නවක වූ යම් මහක කෙනෙක් වෙත් නම් මෙබඳු සෘද්ධ්‍යානුභාවය උන්වහන්‍සේගේ ය”යි. ඉක්බිති ආයුත්මත් මහක අරමට පැමිණ ආයුෂ්මත් තෙරනුවන්ට “වහන්ස, තෙරණුවනි, මෙතෙකින් පමණ දැ?” යි මෙය කීය. ඇවැත්නි මහකයෙනි, මෙතෙකින් පමණ ය. ඇවැත්නි මහකයෙනි, මෙතෙකින් කරන ලද්දේ ය. ඇවැත්නි මහකයෙනි, මෙතෙකින් පුදන ලද්දේ යයි. ඉන් පසු තෙර මහණහු සිය සිය වෙහෙරට ගියහ. ආයුෂ්මත් මහක ද සිය වෙහෙරට ගියේය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 534,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො චිත්තො ගහපති යෙනායස්මා මහකො තෙනුපසඞ්කමි, උපසඞ්කමිත්වා ආයස්මන්තං මහකං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො චිත්තො ගහපති ආයස්මන්තං මහකං එතදවොච: සාධු මෙ භන්තෙ අය්යො මහකො උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං දස්සෙතූති. තෙන හි ත්වං ගහපති ආලින්දෙ උත්තරාසඞ්ගං පඤ්ඤාපෙත්වා තිණකලාපං ඔකාසෙහීති. එවම්භන්තෙති ඛො චිත්තො ගහපති ආයස්මතො මහකස්ස පටිස්සුත්වා ආලින්දෙ උත්තරාසඞ්ගං පඤ්ඤාපෙත්වා තිණකලාපං ඔකාසෙසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා මහකො විහාරං පවිසිත්වා සූචිඝටිකං දත්වා තථාරූපං ඉද්ධාභිසඞ්ඛාරං අභිසඞ්ඛාසි, යථා තාලච්ඡිග්ගලෙන ච අග්ගලන්තරිකාය ච අච්චි නික්ඛමිත්වා තිණානි ඣාපෙසි, උත්තරාසඞ්ගං න ඣාපෙසි. අථ ඛො චිත්තො ගහපති උත්තරාසඞ්ගං පප්ඵොටෙත්වා සංවිග්ගො ලොමහට්ඨජාතො එකමන්තං අට්ඨාසි. අථ ඛො ආයස්මා මහකො විහාරා නික්ඛමිත්වා චිත්තං ගහපතිං එතදවොච: “අලමෙත්තාවතා, ගහපතී”ති. අලමෙත්තාවතා භන්තෙ මහක, කතමෙත්තාවතා භන්තෙ මහක, පූජිතමෙත්තාවතා භන්තෙ මහක, අභිරමතු භන්තෙ අය්යො මහකො මච්ඡිකාසණ්ඩෙ. රමණීයං අම්බාටකවනං. අහං අය්යස්ස මහකස්ස උස්සුක්කං කරිස්සාමි චීවර-පිණ්ඩපාත-සෙනාසන-ගිලානප්පච්චය-භෙසජ්ජපරික්ඛාරානන්ති. කල්යාණං වුච්චති ගහපතීති. අථ ඛො ආයස්මා මහකො සෙනාසනං සංසාමෙත්වා පත්තචීවරං ආදාය මච්ඡිකාසණ්ඩම්හා පක්කාමි. යං මච්ඡිකාසණ්ඩම්හා පක්කාමි තථා පක්කන්තොව අහොසි. න පුන පච්චාගඤඡීති."
                    },
                    {
                        "type": "centered",
                        "text": "7. 1. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කාමභූසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "409. එකං සමයං ආයස්මා කාමභූ මච්ඡිකාසණ්ඩෙ විහරති අම්බාටකවනෙ. අථ ඛො චිත්තො ගහපති යෙනායස්මා කාමභූ තෙනුපසඞ්කමි, උපසඞ්කමිත්වා ආයස්මන්තං කාමභුං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො චිත්තං ගහපතිං ආයස්මා කාමභූ එතදවොච: වුත්තමිදං ගහපති:"
                    },
                    {
                        "type": "gatha",
                        "text": "නෙලඞ්ගො සෙතපච්ඡාදො එකාරො වත්තතී රථො\nඅනීඝං පස්ස ආයන්තං{1} ඡින්නසොතං අබන්ධනන්ති.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමස්ස නු ඛො ගහපති සංඛිත්තෙන භාසිතස්ස කථං විත්ථාරෙන අත්ථො දට්ඨබ්බොති? කින්නු ඛො එතං භන්තෙ භගවතා භාසිතන්ති? එවං ගහපතීති. තෙන හි භන්තෙ මුහුත්තං ආගමෙහි යාවස්ස අත්ථං පෙක්ඛාමීති. අථ ඛො චිත්තො ගහපති මුහුත්තං තුණ්හී හුත්වා ආයස්මන්තං කාමභුං එතදවොච:"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අප්පත්තං - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "ඉක්බිති චිත්ත ගැහැවි ආයුෂ්මත් මහක වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් මහකයන් වැඳ එකත්පස් ව හුන්නේ ය. එකත්පස් ව හුන් චිත්ත ගැහැවි ආයුෂ්මත් මහකට මෙය කී ය: වහන්ස, “මහක ආර්‍ය්‍යයන් වහන්සේ මට උතුරු මිනිස් දමින් ඉදු පෙළහරක් දක්වන සේක්වා” යි. ගැහැවි, එසේ වී නම් තෙපි පිලෙහි උතුරු සළුව අතුරා තණ මිටියක් විසුරුව යි. වහන්ස, එසේ යයි චිත්ත ගැහැවි ආයුෂ්මත් මහකහට පිළිතුරු දී පිලෙහි උතුරු සළුව අතුරා තණ මිටියක් විසුරු වී ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉක්බිති ආයුෂ්මත් මහක වෙහෙරට පිවිස යතුරු අගුළ දමා යම් සේ කෙසි සිදුරෙන් ද අගුළ අතරින් ද ගිනිදලු නික්ම තණකොළ දැවී ද, උතුරු සළුව නො දැවී ද එබඳු සෘද්ධියක් කෙළේ ය. එකල්හි චිත්ත ගැහැවි උතුරු සළුව පොළා සංවේගයට පැමිණියේ හටගත් ලොමු දහගැනුම් ඇත්තේ එකත්පස්ව සිටසයේ ය. එවිට ආයුෂ්මත් මහක වෙහෙරින් නික්ම චිත්ත ගැහැවි හට ගැහැවි, මෙතෙකින් පමණ දැ?යි මෙය කීය. වහන්ස මහකයෙනි, මෙතෙකින් පමණ ය. වහන්ස මහකයෙනි, මෙතෙකින් කරන ලද්දේ ය. වහන්ස මහකයෙනි, මෙතෙකින් පුදන ලද්දේ ය. වහන්ස මහක ආර්යයන් වහන්සේ මච්ඡිකාසණ්ඩයෙහි සිත් අලවා වෙසෙන සේක්වා, අම්බාටක වනය සිත්කලු ය, මම මහක ආර්යයන් වහන්සේට සිවුරු පිඬුවා සෙනසුන් ගිලන්පස බෙහෙත් පිරිකර පිළිබඳ ව උත්සාහ කරන්නෙමි යි. ගැහැවිය යහපතෙක් කියනු ලැබේ යි. එකල්හි ආයුෂ්මත් මහක සෙනසුන සකසා තබා පා සිවුරු ගෙන මච්ඡිකාසණ්ඩයෙන් නික්ම ගියේය. යම් සේ මච්ඡිකාසණ්ඩයෙන් ගියේ ද එසේ ගියේ ම විය. යළි පෙරළා නො ආයේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "7. 1. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කාමභූ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "409. එක්කලෙක ආයුෂ්මත් කාමභූ තෙරනුවෝ මච්ඡිකාසණ්ඩයෙහි අම්බාටක වනයෙහි වැඩවෙසෙති. එකල්හි චිත්ත ගැහැවි තෙමේ ආයුෂ්මත් කාමභූ තෙරුන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් කාමභූ තෙරණුවන් වැඳ එකත්පසෙක හුන්නේය. එකත්පසෙක හුන් චිත්ත ගැහැවි හට ආයුෂ්මත් කාමභූ තෙරනුවෝ මෙය වදාළහ: ගැහැවිය, මෙය වදාරන ලද්දේය:",
                        "type": "paragraph"
                    },
                    {
                        "text": "“නිදොස් වූ සුදු වැස්මක් ඇති එක් දැවියක් ඇති රියක් තිබේ. දුක් නැති සුන් සැඩ පහර ඇති බැඳුම් රහිත එන්නහු බලව” යි. ",
                        "type": "paragraph"
                    },
                    {
                        "text": "ගැහැවිය, සැකෙවින් වදාළ මේ දේශනාවේ අරුත විතර විසින් කෙසේ දත යුතු දැ?යි. වහන්ස, කිමෙක් ද? මෙය භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේ දැ?යි. ගැහැවිය, එසේ යයි. වහන්ස, එසේ වී නම් යම් තාක් මෙහි අරුත පිරික්ෂා බලම් ද, ඒ තාක් මොහොතක් පොරොත්තු වනු මැනවැ යි. ඉක්බිති චිත්ත ගැහැවි මොහොතක් නිහඬ ව ආයුෂ්මත් කාමභූ තෙරණුවන්ට මෙය කීය:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 536,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "නෙලඞ්ගන්ති ඛො භන්තෙ සීලානමෙතං අධිවචනං. සෙතපච්ඡාදොති ඛො භන්තෙ විමුත්තියා එතං අධිවචනං. එකාරොති ඛො භන්තෙ සතියා එතං අධිවචනං. වත්තතීති ඛො භන්තෙ අභික්කමපටික්කමස්සෙතං අධිවචනං. රථොති ඛො භන්තෙ ඉමස්සෙතං චාතුමහාභූතිකස්ස කායස්ස අධිවචනං මාතාපෙත්තිකසම්භවස්ස ඔදනකුම්මාසූපචයස්ස අනිච්චුච්ඡාදන පරිමද්දන භෙදන විද්ධංසන ධම්මස්ස. රාගො ඛො භන්තෙ නීඝො දොසො නීඝො මොහො නීඝො. තෙ ඛීණාසවස්ස භික්ඛුනො පහීනා උච්ඡින්නමූලා තාලාවත්ථුකතා අනභාවකතා ආයතිං අනුප්පාදධම්මා. තස්මා ඛීණාසවො භික්ඛු අනීඝොති වුච්චති. ආයන්තන්ති{1} ඛො භන්තෙ අරහතො එතං අධිවචනං. සොතොති ඛො භන්තෙ තණ්හාය එතං අධිවචනං. සා ඛීණාසවස්ස භික්ඛුනො පහීනා උච්ඡින්නමූලා තාලාවත්ථුකතා අනභාවකතා ආයතිං අනුප්පාදධම්මා. තස්මා ඛීණාසවො භික්ඛු ඡින්නසොතොති වුච්චති. රාගො ඛො භන්තෙ බන්ධනං, දොසො බන්ධනං, මොහො බන්ධනං. තෙ ඛීණාසවස්ස භික්ඛුනො පහීනා උච්ඡින්නමූලා තාලාවත්ථුකතා අනභාවකතා ආයතිං අනුප්පාදධම්මා. තස්මා ඛීණාසවො භික්ඛු අබන්ධනොති වුච්චති. ඉති ඛො භන්තෙ යන්තං වුත්තං භගවතා:"
                    },
                    {
                        "type": "gatha",
                        "text": "“නෙලඞ්ගො සෙතපච්ඡාදො එකාරො වත්තතී රථො\nඅනීඝං පස්ස ආයන්තං{1} ඡින්නසොතං අබන්ධන”න්ති.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමස්ස ඛවාහං භන්තෙ{3} භගවතා සංඛිත්තෙන භාසිතස්ස එවං විත්ථාරෙන අත්ථං ආජානාමීති. ලාභා තෙ ගහපති, සුලද්ධන්තෙ ගහපති, යස්ස තෙ ගම්භීරෙ බුද්ධවචනෙ පඤ්ඤාචක්ඛු කමතීති."
                    },
                    {
                        "type": "centered",
                        "text": "7. 1. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතියකාමභූසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "410. එකං සමයං ආයස්මා කාමභූ මච්ඡිකාසණ්ඩෙ විහරති අම්බාටක වනෙ. අථ ඛො චිත්තො ගහපති යෙනායස්මා කාමභූ -පෙ- එකමන්තං නිසින්නො ඛො චිත්තො ගහපති ආයස්මන්තං කාමභුං එතදවොච: කති නු ඛො භන්තෙ සඞ්ඛාරාති. තයො ඛො ගහපති සඞ්ඛාරා කායසඞ්ඛාරො වචීසඞ්ඛාරො චිත්තසඞ්ඛාරොති. සාධු භන්තෙති ඛො චිත්තො ගහපති ආයස්මතො කාමභුස්ස භාසිතං අභිනන්දිත්වා අනුමොදිත්වා ආයස්මන්තං කාමභුං උත්තරිං පඤ්හං ආපුච්ඡි. කතමො පන භන්තෙ කායසඞ්ඛාරො? කතමො වචීසඞ්ඛාරො? කතමො චිත්තසඞ්ඛාරොති? අස්සාසපස්සාසා ඛො ගහපති කායසඞ්ඛාරො, විතක්කවිචාරා වචීසඞ්ඛාරො, සඤ්ඤා ච වෙදනා ච චිත්තසඞ්ඛාරොති. සාධු භන්තෙති ඛො චිත්තො ගහපති -පෙ- උත්තරිං පඤ්හං ආපුච්ඡි:"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අප්පත්තං - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ඉමස්ස ඛො භන්තෙ - මඡසං. ඉමස්ස ඛොහං - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "වහන්ස, “නෙලඞ්ග” යනු සීලයට මේ නමකි. වහන්ස, “සේතපච්ඡාද” යනු විමුක්තියට මේ නමෙකි. වහන්ස, “ඒකාර” යනු සිහියට මේ නමෙකි. වහන්ස, “වත්තති” යනු ඉදිරි ගමනට හා පසුගමනට මේ නමෙකි. වහන්ස, “රථ” යනු මව්පියන්ගෙන් උපන් බත් කොමු පිඬු වලින් වැඩුනු නිතර ඉලීම් පිරිමැදීම් කෙරෙතු දු බිදෙන වැනසෙන ස්වභාව ඇති සතර මහා භූතයන්ගෙන් හටගත් මේ කයට මේ නමෙකි. වහන්ස, රාගය නීඝයෙකි, දෝසය නීඝයෙකි, මෝහය නීඝයෙකි. රහත් මහණුන් වහන්සේ විසින් ඔහු ප්‍රහීණයහ. උසුන් මුල් ඇතියහ. හිස් සුන් තල් ගසක් මෙන් කරන ලදහ. නැවත නො හටගන්නා බව කරන ලදහ. මතු නූපදනා ස්වභාව ඇතියහ. එහෙයින් රහත් මහණහු අනීඝ යයි කියනු ලැබෙත්. වහන්ස, “ආයන්ත” යනු රහතුන් වහන්සේට මේ නමෙකි. වහන්ස, “සොත” යනු තෘෂ්ණාවට මේ නමෙකි. රහත් මහණුන් වහන්සේ විසින් එය ප්‍රහීණ ය. උසුන් මුල් ඇතියේ ය. හිස් සුන් තල් ගසක් මෙන් කරන ලද්දේ ය. යළි නොහට ගන්නා බව කරන ලද්දේ ය. මතු නූපදනා ස්වභාව ඇත්තේ ය. එහෙයින් රහත් මහණහු “ඡින්න සොතය” යි කියනු ලැබෙත්. වහන්ස, රාගය බැඳුමෙකි. දෝසය බැඳුමෙකි. මෝහය බැඳුමෙකි. රහත් මහණුන් වහන්සේ විසින් ඔහු ප්‍රහීණයහ. උසුන් මුල් ඇතියහ. හිස් සුන් තල් ගසක් මෙන් කරන ලදහ. යළි නො හට ගන්නා බව කරන ලදහ. මතු නූපදනා ස්වභාව ඇතියහ. එහෙයින් රහත් මහණහු “අබන්ධනය” යි කියනු ලැබෙති යි. වහන්ස මෙසේ භාග්‍යවතුන් වහන්සේ විසින් ඒ යමක් වදාරන ලද්දේ ද:",
                        "type": "paragraph"
                    },
                    {
                        "text": "“නිදොස් වූ සුදු වැස්මක් ඇති එක් දැවියක් ඇති රියක් තිබේ. දුක් නැති සුන් සැඩ පහර ඇති බැඳුම් රහිත එන්නහු බලව” යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, භාග්‍යවතුන් වයන්සේ විසින් සැකෙවින් වදාළ මේ දේශනාවේ අරුත විතර විසින් මම මෙසේ දනිමි යි. ගැහැවිය, යම් බඳු තොපගේ පැනැස ගැඹුරු බුදු වදනෙහි පවතී ද, ගැහැවිය, ඒ තොපට ඒකාන්තයෙන් ලාභයෙකි. තොපට මනා ලැබීමෙකි යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "7. 1. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතිය කාමභූ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "410. එක්කලෙක ආයුෂ්මත් කාමභූ තෙරනුවෝ මච්ඡිකාසණ්ඩයෙහි අම්බාටක වනයෙහි වැඩවෙසෙති. එකල්හි චිත්ත ගැහැවි තෙමේ ආයුෂ්මත් කාමභූ තෙරුන් වෙත … එකත්පස් ව හුන් චිත්ත ගැහැවි ආයුෂ්මත් කාමභූ තෙරුන්ට මෙය කී ය: වහන්ස, “සඞ්ඛාර කෙතෙක් දැ?” යි. ගැහැවිය, සඞ්ඛාර තුනෙකි. කාය සඞ්ඛාර ය, වචී සඞ්ඛාර ය, චිත්ත සඞ්ඛාර යි. මැනව වහන්සැ යි චිත්ත ගැහැවි ආයුෂ්මත් කාමභූ තෙරුණුවන්ගේ වචනය පිළිගෙන අනුමෝදන් ව ආයුෂ්මත් කාමභූ තෙරුන් මතු දැක්වෙන පැනය පුළුවුත. වහන්ස, කාය සඞ්ඛාර කවරේ ද? වචී සඞ්ඛාර කවරේ ද? චිත්ත සඞ්ඛාර කවරේ ද? යි. ගැහැවි, ආස්වාස, ප්‍රස්වාස කාය සඞ්ඛාර ය. විතර්ක, විචාර වචී සඞ්කාර ය. සංඥාත්, වේදනාත් චිත්ත සඞ්ඛාර යි. මැනව වහන්සැ යි චිත්ත ගැහැවි … මතු දැක්වෙන පැනය පුළුවුත.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 538,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කස්මා පන භන්තෙ අස්සාසපස්සාසා කායසඞ්ඛාරො? කස්මා විතක්කවිචාරා වචීසඞ්ඛාරො? කස්මා සඤ්ඤා ච වෙදනා ච චිත්තසඞ්ඛාරොති? අස්සාසපස්සාසා ඛො ගහපති කායිකා. එතෙ ධම්මා කායපටිබද්ධා, තස්මා අස්සාසපස්සාසා කායසඞ්ඛාරො. පුබ්බෙ ඛො ගහපති විතක්කෙත්වා විචාරෙත්වා පච්ඡා වාචං භින්දති, තස්මා විතක්කවිචාරා වචීසඞ්ඛාරො. සඤ්ඤා ච වෙදනා ච චෙතසිකා. එතෙ ධම්මා චිත්තපටිබද්ධා, තස්මා සඤ්ඤා ච වෙදනා ච චිත්තසඞ්ඛාරොති. සාධු භන්තෙති ඛො චිත්තො ගහපති -පෙ- උත්තරිං පඤ්හං ආපුච්ඡි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කථං පන භන්තෙ සඤ්ඤාවෙදයිතනිරොධසමාපත්ති හොතීති? න ඛො ගහපති සඤ්ඤාවෙදයිත නිරොධං සමාපජ්ජන්තස්ස භික්ඛුනො එවං හොති: “අහං සඤ්ඤාවෙදයිතනිරොධං සමාපජ්ජස්සන්ති වා අහං සඤ්ඤාවෙදයිතනිරොධං සමාපජ්ජාමීති වා අහං සඤ්ඤාවෙදයිතනිරොධං සමාපන්නො’ති වා{1} ති, අථ ඛ්වස්ස පුබ්බෙව තථා චිත්තං භාවිතං හොති යංතං තථත්තාය උපනෙතීති. සාධු භන්තෙති ඛො චිත්තො ගහපති -පෙ- උත්තරිං පඤ්හං ආපුච්ඡි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සඤ්ඤාවෙදයිතනිරොධං සමාපජ්ජන්තස්ස පන භන්තෙ භික්ඛුනො කතමෙ ධම්මා පඨමං නිරුජ්ඣන්ති යදි වා කායසඞ්ඛාරො යදි වා වචීසඞ්ඛාරො යදි වා චිත්තසඞ්ඛාරො? ති. සඤ්ඤාවෙදයිතනිරොධං සමාපජ්ජන්තස්ස ඛො ගහපති භික්ඛුනො වචීසඞ්ඛාරො පඨමං නිරුජ්ඣති, තතො කායසඞ්ඛාරො, තතො චිත්තසඞ්ඛාරොති. සාධු භන්තෙති ඛො චිත්තො ගහපති -පෙ- උත්තරිං පඤ්හං ආපුච්ඡි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "යොයං භන්තෙ මතො කාලකතො, යොචායං භික්ඛු සඤ්ඤාවෙදයිතනිරොධං සමාපන්නො, ඉමෙසං කිං නානාකරණන්ති? ය්වායං ගහපති මතො කාලකතො, තස්ස කායසඞ්ඛාරො නිරුද්ධො පටිප්පස්සද්ධො, වචීසඞ්ඛාරො නිරුද්ධො පටිප්පස්සද්ධො චිත්තසඞ්ඛාරො නිරුද්ධො පටිප්පස්සද්ධො, ආයු පරික්ඛීණං උස්මා වූපසන්තා, ඉන්ද්රියානි විපරිභින්නානි{2}. යො ච ඛ්වායං ගහපති භික්ඛු සඤ්ඤාවෙදයිතනිරොධං සමාපන්නො, තස්සපි කායසඞ්ඛාරො නිරුද්ධො පටිප්පස්සද්ධො, වචීසඞ්ඛාරො නිරුද්ධො පටිප්පස්සද්ධො, චිත්තසඞ්ඛාරො නිරුද්ධො පටිප්පස්සද්ධො, ආයු අපරික්ඛීණං, උස්මා අවුපසන්තා, ඉන්ද්රියානි විප්පසන්නානි. ය්වායං ගහපති, මතො කාලකතො, යොචායං භික්ඛු සඤ්ඤාවෙදයිතනිරොධං සමාපන්නො, ඉදං නෙසං නානාකරණන්ති. සාධු භන්තෙති ඛො චිත්තො ගහපති -පෙ- උත්තරිං පඤ්හං ආපුච්ඡි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "කථං පන භන්තෙ සඤ්ඤාවෙදයිතනිරොධසමාපත්තියා වුට්ඨානං හොතීති. න ඛො ගහපති සඤ්ඤාවෙදයිතනිරොධසමාපත්තියා වුට්ඨහන්තස්ස භික්ඛුනො එවං හොති: “අහං සඤ්ඤාවෙදයිතනිරොධසමාපත්තියා වුට්ඨහිස්සන්ති වා අහං සඤ්ඤාවෙදයිතනිරොධසමාපත්තියා වුට්ඨහාමීති වා අහං සඤ්ඤාවෙදයිතනිරොධසමාපත්තියා වුට්ඨිතො වා” ති. අථ ඛ්වස්ස පුබ්බෙව තථා චිත්තං භාවිතං හොති යං තං තථත්තාය උපනෙතීති. සාධු භන්තෙති ඛො චිත්තො ගහපති -පෙ- උත්තරිං පඤ්හං ආපුච්ඡි:"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. වාති - ඉති භවිතබ්බන්ති මඤ්ඤෙ"
                    },
                    {
                        "type": "footnote",
                        "text": "2. පරිභින්නානි - සී 1, 2."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "වහන්ස, කුමක් හෙයින් ආස්වාස ප්‍රස්වාස කාය සඞ්කාර වේ ද? කුමක් හෙයින් විතර්ක විචාර වචී සඞ්ඛාර වේ ද? කුමක් හෙයින් සංඥාත් වේදනාත් චිත්ත සඞ්ඛාර වේ දැ? යි. ගැහැවිය, ආස්වාස ප්‍රස්වාස කායික ය. මේ දහම්හු කය පිළිබඳහ. එහෙයින් ආස්වාස ප්‍රස්වාස කාය සඞ්ඛාර වේ. ගැහැවි, පළමු තර්කණය කොට විචාරණය කොට පසුව වාග් භේදය කරයි. එහෙයින් විතර්ක විචාර වචී සඞ්ඛාර වේ. සංඥාත් වේදනාත් චෛතසිකයහ. මේ දහම්හු සිත පිළිබඳහ. එහෙයින් සංඥාත් වේදනාත් චිත්ත සඞ්ඛාර වේ යි. මැනව වහන්සැ යි චිත්ත ගැහැවි … මත්තෙහි ද පැනයක් පුළුවුත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, කෙසේ නම් සඤ්ඤාවේදයිතනිරෝධසමාපත්තිය වේ දැ?යි. ගැහැවි, සඤ්ඤාවේදයිතනිරෝධසමාපත්තියට සමවදනා මහණහුට මම සඤ්ඤාවේදයිතනිරෝධසමාපත්තියට සමවදින්නෙමි යි හෝ මම සඤ්ඤාවේදයිතනිරෝධයට සමවදිමි යි හෝ මම සඤ්ඤාවේදයිතනිරෝධයට සමවනිමි යි හෝ මෙබඳු සිතෙක් නො වේ. වැලිදු යම් සිතක් ඔහු ඒ බැව් පිණිස පමුණුවා නම් එසේ පළමු ම ඔහුගේ සිත වඩන ලද්දේ වේ යි. මැනව වහන්සැ යි චිත්ත ගැහැවි … මත්තෙහි පැනයක් පුළුවුත. ",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, සඤ්ඤාවේදයිතනිරෝධයට සමවදනා මහණුන් වහන්සේගේ කවර දහම්හු පළමු නිරුද්ධ වෙද්ද? ඉදින් ඉදින් කායසඞ්ඛාර හෝ ඉදින් වචීසඞ්ඛාර හෝ ඉදින් චිත්තසඞ්ඛාර හෝ දැ? යි. ගැහැවි, සඤ්ඤාවේදයිත නිරෝධයට සමවදනා මහණහුගේ වචීසඞ්ඛාර පළමු නිරුද්ධ වේ. ඉන් පසු කායසඞ්ඛාර ද ඉන් පසු චිත්තසඞ්ඛාර ද නිරුද්ධ වේ යි. මැනව වහන්සැ යි චිත්ත ගැහවි … මත්තෙහි පැනයක් පුළුවුත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, මේ යමෙක් මළේ ද කලුරිය කෙළේ ද යම් මේ මහණ කෙනෙකුත් සඤ්ඤාවේදයිතනිරෝධයට සමවන්හු ද මොවුන්ගේ වෙනස කිමෙක් දැ?යි. ගැහැවි, මේ යමෙක් මළේ ද කලුරිය කෙළේ ද ඔහුගේ කායසඞ්ඛාර නිරුද්ධ ය, සන්හිනි. වචීසඞ්ඛාර නිරුද්ධ ය, සන්හිනි. විත්තසඞ්ඛාර නිරුද්ධ ය, සන්හිනි. ආයු පිරිහුණේ උණුසුම සන්හිනි, ඉඳුරෝ නටහ. ගැහැවි, යම් මහණෙකුත් සඤ්ඤාවේදයිතනිරෝධයට සමවනි ද ඔහුගේත් කායසඞ්ඛාර නිරුද්ධ ය, සන්හිනි. වචීසඞ්ඛාර නිරුද්ධ ය, සන්හිනි. විත්තසඞ්ඛාර නිරුද්ධ ය, සන්හිනි. ආයු නො පිරිහින, උණුසුම නො සන්හිනි, ඉඳුරෝ වෙසෙසින් පහන් හ. ගැහැවි, මේ යමෙක් මළේ ද කලුරිය කෙළේ ද යම් මේ මහණෙකුත් සඤ්ඤාවේදයිතනිරෝධයට සමවනි ද මේ ඔවුන්ගේ වෙනස යි. මැනව වහන්සැ යි චිත්ත ගැහැවි තෙමේ … මතු පැන පිළිවිසී ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, කෙසේ නම් සඤ්ඤාවේදයිතනිරෝධසමාපත්තියෙන් නැගී සිටීම වේ දැ? යි. ගැහැවි, සඤ්ඤාවේදයිතනිරෝධසමාපත්තියෙන් නැගී සිටින මහණහුට මම සඤ්ඤාවේදයිතනිරෝධසමාපත්තියෙන් නැගී සිටින්නෙමි යි හෝ මම සඤ්ඤාවේදයිතනිරෝධසමාපත්තියෙන් නැගී සිටිමි යි හෝ මම සඤ්ඤාවේදයිතනිරෝධසමාපත්තියෙන් නැගී සිටියෙමි යි හෝ මෙබඳු සිතෙක් නො වෙයි. වැලිදු යම් සිතක් ඒ බව පිණිස ඔහු පමුණුවා නම් එසේ ඔහුගේ සිත පළමු මැ වඩන ලද්දේ වේ යි. මැනව වහන්සැ යි චිත්ත ගැහැවි … මත්තෙහි ද පැනයක් පුළුවුත.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 540,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සඤ්ඤාවෙදයිතනිරොධසමාපත්තියා වුට්ඨහන්තස්ස පන භන්තෙ භික්ඛුනො කතමෙ ධම්මා පඨමං උප්පජ්ජන්ති, යදි වා කායසඞ්ඛාරො යදි වා වචීසඞ්ඛාරො යදි වා චිත්තසඞ්ඛාරොති? සඤ්ඤාවෙදයිතනිරොධසමාපත්තියා වුට්ඨහන්තස්ස ඛො ගහපති, භික්ඛුනො චිත්තසඞ්ඛාරො පඨමං උප්පජ්ජති, තතො කායසඞ්ඛාරො, තතො වචීසඞ්ඛාරොති. සාධු භන්තෙති ඛො චිත්තො ගහපති -පෙ- උත්තරිං පඤ්හං ආපුච්ඡි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සඤ්ඤාවෙදයිතනිරොධසමාපත්තියා වුට්ඨිතං පන භන්තෙ භික්ඛුං කති ඵස්සා ඵුසන්තීති? සඤ්ඤාවෙදයිතනිරොධසමාපත්තියා වුට්ඨිතං ඛො ගහපති භික්ඛුං තයො ඵස්සා ඵුසන්ති සුඤ්ඤතො ඵස්සො අනිමිත්තො ඵස්සො අප්පණිහිතො ඵස්සොති. සාධු භන්තෙති ඛො චිත්තො ගහපති -පෙ- උත්තරිං පඤ්හං ආපුච්ඡි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සඤ්ඤාවෙදයිතනිරොධසමාපත්තියා වුට්ඨිතස්ස පන භන්තෙ භික්ඛුනො කිං නින්නං චිත්තං හොති කිං පොනං කිං පබ්භාරන්ති? සඤ්ඤාවෙදයිතනිරොධසමාපත්තියා වුට්ඨිතස්ස ඛො ගහපති භික්ඛුනො විවෙකනින්නං චිත්තං හොති විවෙකපොනං විවෙකපබ්භාරන්ති. සාධු භන්තෙති ඛො චිත්තො ගහපති ආයස්මතො කාමභුස්ස භාසිතං අභිනන්දිත්වා අනුමොදිත්වා ආයස්මන්තං කාමභුං උත්තරිං පඤ්හං ආපුච්ඡි:"
                    },
                    {
                        "type": "paragraph",
                        "text": "සඤ්ඤාවෙදයිතනිරොධසමාපත්තියා පන භන්තෙ කති ධම්මා බහූකාරාති. අද්ධා ඛො ත්වං ගහපති යං පඨමං පුච්ඡිතබ්බං තං පච්ඡා පුච්ඡසි. අපි ච ත්යාහං ව්යාකරිස්සාමි. සඤ්ඤාවෙදයිතනිරොධසමාපත්තියා ඛො ගහපති ද්වෙ ධම්මා බහූපකාරා සමථො ච විපස්සනා චාති."
                    },
                    {
                        "type": "centered",
                        "text": "7. 1. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ගොදත්තසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "411. එකං සමයං ආයස්මා ගොදත්තො මච්ඡිකාසණ්ඩෙ විහරති අම්බාටකවනෙ. අථ ඛො චිත්තො ගහපති යෙනායස්මා ගොදත්තො තෙනුපසඞ්කමි, උපසඞ්කමිත්වා ආයස්මන්තං ගොදත්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො චිත්තං ගහපතිං ආයස්මා ගොදත්තො එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "යා චායං ගහපති අප්පමාණා චෙතොවිමුත්ති, යා ච ආකිඤ්චඤ්ඤා චෙතොවිමුත්ති යා ච සුඤ්ඤතා චෙතොවිමුත්ති යා ච අනිමිත්තා චෙතොවිමුත්ති. ඉමෙ ධම්මා නානත්ථා{1} නානා ව්යඤ්ජනා? උදාහු එකත්ථා{2} ව්යඤ්ජනමෙව නානන්ති?"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. නානට්ඨා - සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "2. එකට්ඨා - සී 1, 2."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "වහන්ස, සඤ්ඤාවේදයිතනිරෝධසමාපත්තියෙන් නැගී සිටුනා මහණුන් වහන්සේගේ කවර දහම්හු පළමු උපදිද් ද? ඉදින් කායසඞ්ඛාර හෝ ඉදින් වචීසඞ්ඛාර හෝ ඉදින් චිත්තසඞ්ඛාර හෝ දැ? යි. ගැහැවි, සඤ්ඤාවේදයිතනිරෝධසමාපත්තියෙන් නැගී සිටුනා මහණහුට චිත්තසඞ්ඛාර පළමු උපදී. ඉන්පසු කායසඞ්කාර ද ඉන්පසු වචීසඞ්ළාර ද උපදි යි. මැනව වහන්සැ යි චිත්තගැහැවි … මත්තෙහි පැනයක් පුළුවුත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, සඤ්ඤාවේදයිතනිරෝධසමාපත්තියෙන් නැගී සිටුනා මහණුන් වහන්සේ කෙතෙක් පහස්හු පුසිද්දැ? යි. ගැහැවි, සඤ්ඤාවේදයිතනිරෝධසමාපත්තියෙන් නැගී සිටි මහණහු සුඤ්ඤතඵස්ස ය අනිමිත්තඵස්ස ය අප්පණිහිතඵස්ස ය යන තුන් පහස්හු පුසිති යි. මැනව වහන්සැ යි චිත්තගැහැවි … මත්තෙහි පැනයක් පුළුවුත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, සඤ්ඤාවේදයිතනිරෝධසමාපත්තියෙන් නැගී සිටි මහණුන් වහන්සේගේ සිත කුමකට නැමුණේ කුමකට නැඹුරු වූයේ කුමකට බර වූයේ වේ දැ? යි. ගැහැවි, සඤ්ඤාවේදයිතනිරෝධසමාපත්තියෙන් නැගී සිටි මහණහුගේ සිත විවේකයට (නිවනට) නැමුණේ විවේකයට නැඹුරු වූයේ විවේකයට බර වූයේ වේ යි. මැනව වහන්සැ යි චිත්ත ගැහැවි ආයුෂ්මත් කාමභූ තෙරණුවන්ගේ වදන පිළිගෙන අනුමෝදන් ව ආයුෂ්මත් කාමභූ තෙරණුවන් මත්තෙහි පැනයක් පුළුවුත.",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "වහන්ස, සඤ්ඤාවේදයිතනිරෝධසමාපත්තියට කොතෙක් දහම්හු බොහෝ උපකාර ඇත්තේ දැ? යි. ගැහැවි, තෙපි ඒකාන්තයෙන් යමක් පළමු පිළිවිසිය යුතු නම් එය පසුව පුළුවුත්හු. එහෙත් තොපට මම විසඳන්නෙමි. ගැහැවි, සඤ්ඤාවේදයිතනිරෝධසමාපත්තියට සමථය ද විපස්සනාව ද යන දෙදහම්හු බොහෝ උපකාර ඇත්තේ යි."
                    },
                    {
                        "type": "centered",
                        "text": "7. 1. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ගෝදත්‌ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "411. එක්කලෙක ආයුෂ්මත් ගෝදත්ත තෙරණුවෝ මච්ඡිකාසණ්ඩයෙහි අම්බාටක වනයෙහි වැඩවෙසෙති. එකල්හි චිත්ත ගැහැවි තෙමේ ආයුෂ්මත් ගෝදත්ත තෙරණුවන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් ගෝදත්ත තෙරණුවන් වැඳ එකත්පස්ව හුන්නේය. එකත්පස් ව හුන් චිත්ත ගැහැවිහට ආයුෂ්මත් ගෝදත්ත තෙරණුවෝ මෙය වදාළහ:",
                        "type": "paragraph"
                    },
                    {
                        "text": "ගැහැවි, යම් මේ අප්පමාණ චෙතෝවිමුක්තියෙකුත් යම් ආකිඤ්චඤ්ඤ චෙතෝවිමුක්තියෙකුත් යම් සුඤ්ඤත චේතෝවිමුක්තියෙකුත් වේ නම් මේ දහම්හු නොයෙක් නොයෙක් අර්ථ ඇත්තාහුත් නොයෙක් නොයෙක් ව්‍යඤ්ජන ඇත්තාහුත් වෙත් ද? නැතහොත් එකම අර්ථ ඇත්තාහු ව්‍යඤ්ජන පමණක් වෙනස් වූවාහු වෙත් දැ? යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 542,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අත්ථි භන්තෙ පරියායො යං පරියායං ආගම්ම ඉමෙ ධම්මා නානත්ථා චෙව නානාව්යඤ්ජනා ච. අත්ථි පන භන්තෙ පරියායො යං පරියායං ආගම්ම ඉමෙ ධම්මා එකත්ථා ව්යඤ්ජනමෙව නානන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භන්තෙ පරියායො යං පරියායං ආගම්ම ඉමෙ ධම්මා නානත්ථා චෙව නානාව්යඤ්ජනා ච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භන්තෙ භික්ඛු මෙත්තාසහගතෙන චෙතසා එකං දිසං ඵරිත්වා විහරති, තථා දුතියං, තථා තතියං, තථා චතුත්ථිං,{1} ඉති උද්ධමධො තිරියං සබ්බධි සබ්බත්තතාය සබ්බාවන්තං ලොකං මෙත්තාසහගතෙන චෙතසා විපුලෙන මහග්ගතෙන අප්පමාණෙන අවෙරෙන අබ්යාපජ්ඣෙන{2} ඵරිත්වා විහරති. කරුණාසහගතෙන චෙතසා -පෙ- මුදිතාසහගතෙන චෙතසා -පෙ- උපෙක්ඛාසහගතෙන චෙතසා එකං දිසං ඵරිත්වා විහරති, තථා දුතියං, තථා තතියං, තථා චතුත්ථිං. ඉති උද්ධමධො තිරියං සබ්බධි සබ්බත්තතාය සබ්බාවන්තං ලොකං උපෙක්ඛාසහගතෙන චෙතසා විපුලෙන මහග්ගතෙන අප්පමාණෙන අවෙරෙන අබ්යාපජ්ජෙන ඵරිත්වා විහරති. අයං වුච්චති, භන්තෙ, අප්පමාණා චෙතොවිමුත්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමා ච භන්තෙ, ආකිඤ්චඤ්ඤාචෙතොවිමුත්ති:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භන්තෙ භික්ඛු සබ්බසො විඤ්ඤාණඤ්චායතනං සමතික්කම්ම, නත්ථි කිඤ්චීති ආකිඤ්චඤ්ඤායතනං උපසම්පජ්ජ විහරති. අයං වුච්චති භන්තෙ ආකිඤ්චඤ්ඤාචෙතොවිමුත්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමා ච භන්තෙ සුඤ්ඤතාචෙතොවිමුත්ති:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භන්තෙ භික්ඛු අරඤ්ඤගතො වා රුක්ඛමූලගතො වා සුඤ්ඤාගාරගතො වා ඉති පටිසංචික්ඛති සුඤ්ඤමිදං අත්තෙන වා අත්තනියෙන වා, අයං වුච්චති භන්තෙ සුඤ්ඤතාචෙතොවිමුත්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමා ච භන්තෙ අනිමිත්තා චෙතොවිමුත්ති:"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධ භන්තෙ භික්ඛු සබ්බනිමිත්තානං අමනසිකාරා අනිමිත්තං චෙතො සමාධිං උපසම්පජ්ජ විහරති. අයං වුච්චති භන්තෙ අනිමිත්තාචෙතොවිමුත්ති. අයං ඛො භන්තෙ පරියායො යං පරියායං ආගම්ම ඉමෙ ධම්මා නානත්ථා චෙව නානාව්යඤ්ජනා ච."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භන්තෙ පරියායො යං පරියායං ආගම්ම ඉමෙ ධම්මා එකත්ථා ව්යඤ්ජනමෙව නානං:"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. චතුත්ථං - සී 1, 2. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අව්යාපජ්ජෙන - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "වහන්ස, යම් නයකට පැමිණ මේ දහම්හු නානා අර්ථ ඇත්තාහුත් නානා ව්‍යඤ්ජන ඇත්තාහුත් වෙත නම් එබඳු නයෙක් ඇත. වහන්ස, යම් නයකට පැමිණ මේ දහම්හු එකම අර්ථ ඇත්තාහු ව්‍යඤ්ජන පමණක් වෙනස් වූවාහු වෙත් නම් එබඳු නයකුත් ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, යම් නයකට පැමිණ මේ දහම්හු නානා අර්ථ ඇත්තාහුත් නානා ව්‍යඤ්ජන ඇත්තාහුත් වෙත නම් ඒ නය කවරේ ද යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, මෙහි මහණුන් වහන්සේ මෛත්‍රීසහගත සිතින් එක් දිගක් පැතිර‍ගෙන වෙසෙති. දෙවන දිග ද එසේ ය. තෙවන දිග ද එසේ ය. සිවුවන දිග ද එසේ ය. මෙසේ උඩ යට සරස සියලු තැන්හි සර්වාත්මභාවයෙන් සියල්ලෙන් යුත් ලොව පැතුරුණු මහත් බවට ගිය අපමණ වූ නිදොස් වූ නිදුක් වූ මෙත් සහගිය සිතින් පතුරුවා වෙසෙති. කුළුණු සහගිය සිතින් … මුදිතා සහගත සිතින් …මැදහත් බැවු සහගිය සිතින් එක් දිගක් පැතිර‍ගෙන වෙසෙති. දෙවන දිග ද එසේ ය. තෙවන දිග ද එසේ ය. සිවුවන දිග ද එසේ ය. මෙසේ උඩ යට සරස සියලු තැන්හි සර්වාත්මභාවයෙන් සියල්ලෙන් යුත් ලොව පැතුරුණු මහත් බවට ගිය අපමණ වූ නිදොස් වූ නිදුක් වූ මැදහත් වූ උපේක්ෂා සහගිය සිතින් පතුරුවා වෙසෙති. වහන්ස, මේ අප්පමාණ චේතෝවිමුක්තිය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, ආකිඤ්චඤ්ඤ චේතෝවිමුක්තිය කවර යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, මේ මහණුන් වහන්සේ සර්ව ප්‍රකාරයෙන් විඤ්ඤාණඤ්චායතනය ඉක්ම කිසිවක් නැතැයි ආකිඤ්චඤ්ඤායතනයට පැමිණ වෙසෙති. වහන්ස, මේ ආකිඤ්චඤ්ඤ චේතෝවිමුක්තිය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, සුඤ්ඤත චෙතෝවිමුක්තිය කවර යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, මෙහි මහණන් වහන්සේ අරණකට ගියාහු හෝ රුක් මුලකට ගියාහු හෝ හිස් ගෙයකට ගියාහු හෝ මෙය තමාගෙන් හෝ තමා සතු දැයකින් හිස් යයි මෙසේ නුවණින් සලකා බලති. වහන්ස, මේ සුඤ්ඤත චේතෝවිමුක්තිය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, අනිමිත්ත චේතෝවිමුක්තිය කවර යත්:",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, මෙහි මහණුන් වහන්සේ සියලු නිමිති නොමෙනෙහි කිරීමෙන් නිමිති රහිත චේතෝ සමාධියට පැමිණ වෙසෙති. වහන්ස, මේ අනිමිත්ත චේතෝවිමුක්තිය යි කියනු ලැබේ. වහන්ස, යම් නයකට පැමිණ මේ දහම්හු නානා අර්ථ ඇත්තාහුත් නානා ව්‍යඤ්ජන ඇත්තාහුත් වෙත් නම් මේ ඒ නය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, යම් නයකට පැමිණ මේ දහම්හු එකාර්ථ වූවාහු ව්‍යඤ්ජන පමණක් වෙනස් වූවාහු වෙත් නම් ඒ නය කවරේ ද යත්:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 544,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "රාගො ඛො භන්තෙ පමාණකරණො දොසො පමාණකරණො මොහො පමාණකරණො. තෙ ඛීණාසවස්ස භික්ඛුනො පහීනා උච්ඡින්නමූලා තාලාවත්ථුකතා අනභාවකතා ආයතිං අනුප්පාදධම්මා. යාවතා ඛො භන්තෙ අප්පමාණා චෙතොවිමුත්තියො අකුප්පා තාසං චෙතොවිමුත්ති අග්ගමක්ඛායති. සා ඛො පනාකුප්පා චෙතොවිමුත්ති සුඤ්ඤා රාගෙන සුඤ්ඤා දොසෙන සුඤ්ඤා මොහෙන. රාගො ඛො භන්තෙ කිඤ්චනං දොසො කිඤ්චනං මොහො කිඤ්චනං. තෙ ඛීණාසවස්ස භික්ඛුනො පහීනා උච්ඡින්නමූලා තාලාවත්ථුකතා අනභාවකතා ආයතිං අනුප්පාදධම්මා. යාවතා ඛො භන්තෙ ආකිඤ්චඤ්ඤා චෙතොවිමුත්තියො අකුප්පා තාසං චෙතොවිමුත්ති අග්ගමක්ඛායති; සා ඛො පනාකුප්පා චෙතොවිමුත්ති සුඤ්ඤා රාගෙන සුඤ්ඤා දොසෙන සුඤ්ඤා මොහෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "රාගො ඛො භන්තෙ නිමිත්තකරණො දොසො නිමිත්තකරණො මොහො නිමිත්තකරණො. තෙ ඛීණාසවස්ස භික්ඛුනො පහීනා උච්ඡින්නමූලා තාලාවත්ථුකතා අනභාවකතා ආයතිං අනුප්පාදධම්මා. යාවතා ඛො භන්තෙ අනිමිත්තා චෙතොවිමුත්තියො අකුප්පා තාසං චෙතොවිමුත්ති අග්ගමක්ඛායති; සා ඛො පනාකුප්පා චෙතොවිමුත්ති සුඤ්ඤා රාගෙන සුඤ්ඤා දොසෙන සුඤ්ඤා මොහෙන. අයං ඛො භන්තෙ පරියායො යං පරියායං ආගම්ම ඉමෙ ධම්මා එකත්ථා ව්යඤ්ජනමෙව නානන්ති. ලාභා තෙ ගහපති සුලද්ධන්තෙ ගහපති යස්ස තෙ ගම්භීරෙ බුද්ධවචනෙ පඤ්ඤාචක්ඛු කමතීති."
                    },
                    {
                        "type": "centered",
                        "text": "7. 1. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නිගණ්ඨසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "412. තෙන ඛො පන සමයෙන නිගණ්ඨො නාතපුත්තො{1} මච්ඡිකාසණ්ඩං අනුප්පත්තො හොති මහතියා නිගණ්ඨපරිසාය සද්ධිං. අස්සොසි ඛො චිත්තො ගහපති නිගණ්ඨො කිර නාතපුත්තො මච්ඡිකාසණ්ඩං අනුප්පත්තො මහතියා නිගණ්ඨපරිසාය සද්ධින්ති. අථ ඛො චිත්තො ගහපති සම්බහුලෙහි උපාසකෙහි සද්ධිං යෙන නිගණ්ඨො නාතපුත්තො තෙනුපසඞ්කමි, උපසඞ්කමිත්වා නිගණ්ඨෙන නාතපුත්තෙන සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො චිත්තං ගහපතිං නිගණ්ඨො නාතපුත්තො එතදවොච: සද්දහසි ත්වං ගහපති සමණස්ස ගොතමස්ස අත්ථි අවිතක්කො අවිචාරො සමාධි, අත්ථි විතක්ක විචාරානං නිරොධොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. නාට පුත්තො - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "වහන්ස, රාගය පමණ කරන්නෙකි, ද්වේෂය පමණ කරන්නෙකි, මොහය පමණ කරන්නෙකි. රහත් මහණුන් වහන්සේ විසින් ඔහු ප්‍රහීණයහ, උසුන්මුල්හ, හිස්සුන් තල් ගසක් මෙන් කරන ලදහ, යළි නො හටගන්නා බව කරන ලදහ, මතු නූපදනා ස්වභාව ඇතියහ. වහන්ස, යම්තාක් අප්පමාණ චේතෝවිමුක්තීහු වෙත් නම් (රාගාදීන්) අකෝප්‍ය වූ චේතෝවිමුක්තිය ඔවුන්ට අග්‍ර ය යි කියනු ලැබේ. ඒ අකෝප්‍ය වූ චේතෝවිමුක්තිය රාගයෙන් හිස් ය, ද්වේෂයෙන් හිස් ය, මෝහයෙන් හිස් ය. වහන්ස, රාගය පළිබෝධයකි, ද්වේෂය පළිබෝධයකි, මෝහය පළිබෝධයකි. රහත් මහණුන් වහන්සේ විසින් ඔහු ප්‍රහීණයහ, උසුන්මුල්හ, හිස්සුන් තල්ගසක් මෙන් කරන ලදහ, යලි නො හටගන්නා බව කරන ලදහ, මතු නූපදනා ස්වභාව ඇතියහ. වහන්ස, යම්තාක් ආකිඤ්චඤ්ඤ චේතෝවිමුත්තීහු වෙත් නම් අකෝප්‍ය චේතෝවිමුක්තිය ඔවුන්ට අග්‍ර ය යි කියනු ලැබේ. ඒ අකොප්‍ය චේතෝවිමුක්තිය රාගයෙන් හිස් ය, ද්වේෂයෙන් හිස් ය, මෝහයෙන් හිස් ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, රාගය නිමිති කරන්නෙකි, ද්වේෂය නිමිති කරන්නෙකි, මොහය නිමිති කරන්නෙකි. රහත් මහණුන් වහන්සේ විසින් ඔහු ප්‍රහීණයහ, උසුන්මුල්හ, හිස්සුන් තල්ගසක් මෙන් කරන ලදහ, නැවත නො හටගන්නා බව කරන ලදහ, මතු නූපදනා ස්වභාව ඇතියහ. වහන්ස, යම්තාක් අනිමිත්ත චේතෝවිමුත්තීහු වෙත් නම් අකෝප්‍ය චේතෝවිමුක්තිය ඔවුන්ට අග්‍රය යි කියනු ලැබේ. ඒ අකෝප්‍ය වූ චේතෝවිමුක්තිය රාගයෙන් හිස් ය, ද්වේෂයෙන් හිස් ය, මෝහයෙන් හිස් ය. වහන්ස, යම් නයකට පැමිණ මේ දහම්හු ඒකාර්ථ වූවාහු ව්‍යඤ්ජන පමණක් වෙනස් වූවාහු වෙත් නම් මේ ඒ නය යි. ගැහැවිය, යම්බඳු තොපගේ පැනැස ගැඹුරු බුදු වදනෙහි පවතී නම්, ගැහැවි, ඒ තොපට ලාභයෙකි. තොපට මනා ලැබීමෙකි යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "7. 1. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නිගණ්‌ඨ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "412. එසමයෙහි නිගණ්ඨනාතපුත්ත තෙමේ මහත් නිගණ්ඨ පිරිසක් සමඟ මච්ඡිකාසණ්ඩයට පැමිණියේ වෙයි. නිගණ්ඨනාතපුත්ත තෙමේ මහත් නිගණ්ඨ පිරිසක් සමඟ මච්ඡිකාසණ්ඩයට පැමිණියේ ය යි චිත්ත ගැහැවි ඇසුයේ ය. එකල්හි චිත්ත ගැහැවි බොහෝ උවසුවන් සමඟ නිගණ්ඨනාතපුත්ත වෙත එළඹියේ ය. එළඹ නිගණ්ඨනාතපුත්ත සමඟ සතුටු විය. සතුටුවිය යුතු සිහි කටයුතු කථාව නිමවා එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් චිත්ත ගැහැවිහට නිගණ්ඨනාතපුත්ත මෙය කී ය: ගැහැවි, තෙපි අවිතර්ක අවිචාර සමාධියෙක් ඇත, විතර්ක විචාරයන්ගේ නිරෝධයෙක් ඇතැයි යන මහණ ගොයුම්ගේ වචනය අදහවු දැ? යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 546,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "න ඛ්වාහං එත්ථ භන්තෙ භගවතො සද්ධාය ගච්ඡාමි: අත්ථි අවිතක්කො අවිචාරො සමාධි, අත්ථි විතක්කවිචාරානං නිරොධොති. එවං වුත්තෙ නිගණ්ඨො නාතපුත්තො උල්ලොකෙත්වා{1} එතදවොච: ඉදං භවන්තො පස්සන්තු යාවඋජුකො{2} චායං චිත්තො ගහපති, යාව අසඨො චායං චිත්තො ගහපති, යාව අමායාවී චායං චිත්තො ගහපති, වාතං වා සො ජාලෙන බාධෙතබ්බං මඤ්ඤෙය්ය යො විතක්කවිචාරෙ නිරොධෙතබ්බං මඤ්ඤෙය්ය, සකමුට්ඨිනා වා සො ගඞ්ගාය සොතං ආවාරෙතබ්බං මඤ්ඤෙය්යාති. යො විතක්කවිචාරෙ නිරොධෙතබ්බං මඤ්ඤෙය්යාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තං කිම්මඤ්ඤසි භන්තෙ කතමං නු ඛො පණීතතරං ඤාණං වා සද්ධා වාති. සද්ධාය ඛො ගහපති ඤාණං යෙව පණීතතරං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අහං ඛො භන්තෙ යාවදෙව ආකඞ්ඛාමි විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහරාමි. අහං ඛො භන්තෙ යාවදෙව ආකඞ්ඛාමි විතක්කවිචාරානං වූපසමා -පෙ- දුතියං ඣානං උපසම්පජ්ජ විහරාමි. අහං ඛො භන්තෙ යාවදෙව ආකඞ්ඛාමි පීතියා ච විරාගා -පෙ- තතියං ඣානං උපසම්පජ්ජ විහරාමි. අහං ඛො භන්තෙ යාවදෙව ආකඞ්ඛාමි සුඛස්ස ච පහානා දුක්ඛස්සච පහානා පුබ්බෙව සොමනස්සදොමනස්සානං අත්ථගමා අදුක්ඛං අසුඛං උපෙක්ඛාසතිපාරිසුද්ධිං චතුත්ථං ඣානං උපසම්පජ්ජ විහරාමි. න සො ඛ්වාහං භන්තෙ එවං ජානන්තො එවං පස්සන්තො කස්ස අඤ්ඤස්ස සමණස්ස වා බ්රාහ්මණස්ස වා සද්ධාය ගමිස්සාමි. “අත්ථි අවිතක්කො අවිචාරො සමාධි අත්ථි විතක්කවිචාරානං නිරොධො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං වුත්තෙ නිගණ්ඨො නාතපුත්තො සකං පරිසං උල්ලොකෙත්වා එතදවොච: ඉදං භවන්තො පස්සන්තු: යාව අනුජ්ජුකො{3} චායං චිත්තො ගහපති, යාව සඨො චායං චිත්තො ගහපති, යාව මායාවී චායං චිත්තො ගහපතීති. ඉදානෙව{4} ඛො තෙ මයං භන්තෙ භාසිතං එවං ආජානාම: “ඉදං භවන්තො පස්සන්තු යාව උජුකො චායං චිත්තො ගහපති, යාව අසඨො චායං චිත්තො ගහපති, යාව අමායාවී චායං චිත්තො ගහපති. ඉදානෙව ච පන තෙ මයං භන්තෙ භාසිතං එවං ආජානාම: “ඉදං භවන්තො පස්සන්තු, යාව අනුජ්ජුකො චායං චිත්තො ගහපති, යාව සඨො චායං චිත්තො ගහපති, යාව මායාවී චායං චිත්තො ගහපතී”ති. සචෙ තෙ භන්තෙ පුරිමං සච්චං පච්ඡිමං තෙ මිච්ඡා. සචෙ පන තෙ භන්තෙ පච්ඡිමං සච්චං පුරිමං තෙ මිච්ඡා."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අපලොකෙත්වා - සී.මු. සී 1, 2. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. යාවජ්ජුකො - සී 1."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අනුජුකො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. ඉදනෙව ච පන - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "හිමියනි, අවිතර්ක අවිචාර සමාධියෙක් ඇත, විතර්ක විචාරයන්ගේ නිරෝධයෙක් ඇත යන මෙහිලා මම භාග්‍යවතුන් වහන්සේගේ විශ්වාසයට නො යමි යි. මෙසේ කී කල්හි නිගණ්ඨනාතපුත්ත තෙමේ සිය පිරිස හිස ඔසවා බලා මෙය කී ය: භවත්හු මෙය දකිත්වා මේ චිත්ත ගැහැවි කෙතෙක් සෘජු ද? මේ චිත්ත ගැහැවි කෙතෙක් අසට (නො කපටි) ද? මේ චිත්ත ගැහැවි කෙතෙක් රැවටිලි රහිත ද? යමෙක් විතර්ක විචාර නිරුද්ධ කටයුතු ය යි හඟනේ නම් හේ දැලින් සුළං බැදිය යුතු ය යි හඟනේ ය. යමෙක් විතර්ක විචාර නිරුද්ධ කටයුතු ය යි හඟනේ නම් හේ සිය මිටින් ගඞ්ගානදී සැඩපහර වැළැක්විය යුතු ය යි හඟනේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "හිමියනි, ඒ කිමැ? යි හඟිවු ද? කුමක් වඩා ප්‍රණීත ද? නැණ හෝ සැදැහැ හෝ යි. ගැහැවි, සැදැහැයට වඩා නැණ ම ප්‍රණීත ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "හිමියනි, මම යම්තාක් කැමැත්තෙම් නම් (ඒතාක්) කාමයන්ගෙන් වෙන්ව ම අකුශල ධර්‍මයන්ගෙන් වෙන්ව ම විතර්ක සහිත විචාර සහිත විවේකයෙන් හටගත් ප්‍රීතිය හා සුවය ඇති පළමුවන දැහැනට පැමිණ වෙසෙමි. හිමියනි, මම යම්තාක් කැමැත්තෙම් නම් ඒතාක් විතර්ක විචාර සන්හිඳීමෙන් ... ‍‍දෙවැනි දැහැනට පැමිණ වෙසෙමි. හිමියනි, මම යම්තාක් කැමැත්තෙම් නම් ඒතාක් ප්‍රීතියත් වැළැක්මෙන් ... තෙවන දැහැනට පැමිණ වෙසෙමි. හිමියනි,මම යම්තාක් කැමැත්තෙම් නම් ඒ තාක් සුවත් ප්‍රහීණ කිරීමෙන් දුකත් ප්‍රහීණ කිරීමෙන් කැලැම සොම්නසුත් දුරු කිරීමෙන් නොදුක් වූ නොසුව වූ මැදහත් බැවින් හා සිහියෙන් හටගත් පිරිසිදු බව ඇති සිවුවන දැහැනට පැමිණ වෙසෙමි. හිමියනි, ඒ මම මෙසේ දන්නෙම් මෙසේ දක්නෙම් “අවිතර්ක අවිචාර සමාධියෙක් ඇත. විතර්ක විචාරයන්ගේ නිරෝධයෙක් ඇතැ” යි අන් කවර මහණකුගේ හෝ බමුණකුගේ හෝ ඇදහීමට යන්නෙම් ද?",
                        "type": "paragraph"
                    },
                    {
                        "text": "මෙසේ කී කල්හි නිගණ්ඨනාතපුත්ත සිය පිරිස දෙස බලා මෙය කී ය: භවත්හු මෙය දකිත්වා, මේ චිත්ත ගැහැවි වඞ්කත් වේ ද, චිත්ත ගැහැවි කොතරම් සඨත්(කපටත්) වේ ද, මේ චිත්ත ගැහැවි කොතරම් රැවටිලි ඇත්තේත් වේ දැ යි. හිමියනි, “භවත්හු මෙය දකිත්වා, මේ චිත්ත ගැහැවි කොතෙක් සෘජුත් වේ ද, චිත්ත ගැහැවි කොතෙක් අසඨත් වේ ද, මේ චිත්ත ගැහැවි කොතෙක් රැවටිලි නැත්තේත් වේ දැ” යි. ඔබ විසින් දැන් ම කියන ලද්ද අපි මෙසේ දනිමු. හිමියනි, “භවත්හු මෙය දකිත්වා, මේ චිත්ත ගැහැවි කොතෙක් වඞ්කත් වේ ද, මේ චිත්ත ගැහැවි කොතෙක් සඨත් වේ ද, මේ චිත්ත ගැහැවි කොතෙක් රැවටිලි ඇත්තේත් වේ දැ” යි. ඔබ විසින් දැන්ම කියන ලද්ද අපි මෙසේ දනිමු. හිමියනි, ඉදින් ඔබ විසින් පළමු කියන ලද්ද සැබෑ නම් ඔබ විසින් පසුව කියන ලද්ද මුසාය. හිමියනි, ඉදින් ඔබ විසින් පසුව කියන ලද්ද සැබෑ නම් ඔබ විසින් පළමු කියන ලද්ද මුසා ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 548,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො පන භන්තෙ දස සහධම්මිකා පඤ්හා ආගච්ඡන්ති. යදා නෙසං අත්ථං ආජානෙය්යාසි අථ මං පටිහරෙය්යාසි සද්ධිං නිගණ්ඨ පරිසාය. ‘එකො පඤ්හො එකො උද්දෙසො එකං වෙය්යාකරණං ද්වෙ පඤ්හා ද්වෙ උද්දෙසා ද්වෙ වෙය්යාකරණානි. තයො පඤ්හා තයො උද්දෙසා තීණි වෙය්යාකරණානි. චත්තාරො පඤ්හා චත්තාරො උද්දෙසා චත්තාරි වෙය්යාකරණානි. පඤ්ච පඤ්හා පඤ්ච උද්දෙසා පඤ්ච වෙය්යාකරණානි. ඡ පඤ්හා ඡ උද්දෙසා ඡ වෙය්යාකරණානි. සත්ත පඤ්හා සත්ත උද්දෙසා සත්ත වෙය්යාකරණානි . අට්ඨ පඤ්හා අට්ඨ උද්දෙසා අට්ඨ වෙය්යාකරණානි. නව පඤ්හා නව උද්දෙසා නව වෙය්යාකරණානි. දස පඤ්හා දස උද්දෙසා දස වෙය්යාකරණානී’ති. අථ ඛො චිත්තො ගහපති නිගණ්ඨං නාතපුත්තං ඉමෙ දස සහධම්මිකෙ පඤ්හෙ ආපුච්ඡිත්වා උට්ඨායාසනා පක්කාමීති."
                    },
                    {
                        "type": "centered",
                        "text": "7. 1. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අචෙලසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "413. තෙන ඛො පන සමයෙන අචෙලො කස්සපො මච්ඡිකාසණ්ඩං අනුප්පත්තො හොති, චිත්තස්ස ගහපතිනො පුරාණගිහීසහායකො. අස්සොසි ඛො චිත්තො ගහපති අචෙලො කිර කස්සපො මච්ඡිකාසණ්ඩං අනුප්පත්තො අම්හාකං පුරාණගිහීසහායොති. අථ ඛො චිත්තගහපති යෙන අචෙලො කස්සපො තෙනුපසඞ්කමි, උපසඞ්කමිත්වා අචෙලෙන කස්සපෙන සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො චිත්තො ගහපති අචෙලං කස්සපං එතදවොච: කීව චිරං පබ්බජිතොසි{1} භන්තෙ කස්සපාති? තිංස මත්තානි ඛො මෙ ගහපති වස්සානි පබ්බජිතස්සාති. ඉමෙහි පන තෙ භන්තෙ තිංස මත්තෙහි වස්සෙහි අත්ථි කොචි උත්තරිමනුස්සධම්මා{2} අලමරියඤාණදස්සනවිසෙසො අධිගතො ඵාසුවිහාරොති? ඉමෙහි ඛො මෙ ගහපති තිංස මත්තෙහි වස්සෙහි{3} නත්ථි කොචි උත්තරිමනුස්සධම්මා අලමරියඤාණදස්සනවිසෙසො අධිගතො ඵාසුවිහාරො, අඤ්ඤත්ර නග්ගෙය්යා ච මුණ්ඩෙය්යා ච පාවළනිප්ඵොටනාය{4} චාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං වුත්තෙ චිත්තො ගහපති අචෙලං කස්සපං එතදවොච: අච්ඡරියං වත භො අබ්භුතං වත භො ධම්මස්ස ස්වාක්ඛාතතා යත්ර හි නාම තිංසමත්තෙහි වස්සෙහි න කොචි උත්තරිමනුස්සධම්මා අලමරියඤාණදස්සනවිසෙසො අධිගතො{5} භවිස්සති{6} ඵාසුවිහාරො අඤ්ඤත්ර නග්ගෙය්යා ච මුණ්ඩෙය්යා ච පාවළනිප්ඵොටනාය චාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පබ්බජිතස්ස - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. උත්තරිමනුස්ස ධම්මො - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. වස්සෙහි පබ්බජිතස්ස - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. වාලි නිප්පොථනාය - අට්ඨකථා, පාවාතු සී 1, 2. වාළනිපොත්තනාය - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. අධිගමො - සී, 1, 2, 3."
                    },
                    {
                        "type": "footnote",
                        "text": "6. අභවිස්ස - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "හිමියනි, කරුණු සහිත මේ දශ පැනයක් එයි. යම් කලෙක එහි අරුත් දන්නෙහි නම් එකල්හි නිගණ්ඨ පිරිස සමඟ ම වෙත එන්නෙහි ය: එක් පැනයකි, එක් උදෙසුමෙකි, එක් විසඳුමෙකි. දෙ පැනයෙකි, දෙ උදෙසුමෙකි, දෙ විසඳුමෙකි. තුන් පැනයකි, තුන් උදෙසුමෙකි, තුන් විසඳුමෙකි. සිවු පැනයකි, සිවු උදෙසුමෙකි, සිවු විසඳුමෙකි. පස් පැනයකි, පස් උදෙසුමෙකි, පස් විසඳුමෙකි. ස පැනයකි, ස උදෙසුමෙකි, ස විසඳුමෙකි. සත් පැනයකි, සත් උදෙසුමෙකි, සත් විසඳුමෙකි. අට පැනයකි, අට උදෙසුමෙකි, අට විසඳුමෙකි. නව පැනයකි, නව උදෙසුමෙකි, නව විසඳුමෙකි. දස පැනයකි, දස උදෙසුමෙකි, දස විසඳුමෙකි. ඉක්බිති චිත්ත ගැහැවි නිගණ්ඨනාතපුත්‍රයන්ගෙන් කරුණු සහිත මේ දස පැනය පිළිවිස හුනස්නෙන් නැඟිට ගියේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "7. 1. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අචෙල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "413. එකල්හි චිත්ත ගැහැවිහුගේ පැරණි ගිහි යහළුවකු වූ අචේලකස්සප තෙමේ මච්ඡිකාසණ්ඩයට පැමිණියේ වෙයි. චිත්ත ගැහැවි අපගේ පැරණි ගිහි යහළුවකු වූ අචේලකස්සප මච්ඡිකාසණ්ඩයට පැමිණියේ ලැ යි ඇසී ය. ඉක්බිති චිත්තගැහැවි අචේලකස්සපයන් වෙත එළඹියේ ය. එළඹ අචේලකස්සපයන් සමග සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් චිත්තගැහැවි අචෙලකස්සපයනට “හිමියනි කස්සපයෙනි, පැවිදි ව කොතෙක් කල් ඇත්තහු දැ?” යි මෙය කී ය. “ගැහැවිය, පැවිදි වූ මට වස් තිසෙක් පමණ වේ” යි. “හිමියනි, මේ තිසක් පමණ වසින් ඔබ විසින් ලබන ලද මිනිස් දහමින් වැඩි අරිබව කිරීමෙහි සමත් නැණදසුන් වෙසෙසක් වූ කිසියම් පහසුවිහරණයෙක් ඇද්දැ? ”යි. “ගැහැවි, මේ තිසක් පමණ වසින් මවිසින් මිනිස් දහමින් මතු ලබන ලද සෙලුබවත්, මුඩු බවත්, වැලි පිසීමට ගන්නා මොනරපිල් කලඹත් හැර අරීබව කිරීමෙහි සමත් නැණදසුන් වෙසෙසක් වූ කිසියම් පහසුවිහරණයෙක් නැතැ”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මෙසේ කී කල්හි චිත්තගැහැවි අචේලකස්සපයනට මෙය කී ය: “යම් හෙයකින් තිසක් පමණ වසෙකින් සෙලුබවත්, මුඩුබවත්, වැලි පිසීමට ගන්නා මොනරපිල් කලඹත් හැර මිනිස් දහමින් මත්තෙහි වූ පහසුවිහරණ වූ අරීබව කිරීමෙහි සමත් කිසියම් නැණදසුන් වෙසෙසක් නො ලද්දේ වී නම්, පින්වත, දහම්හි ස්වාඛ්‍යාතබව ඒකාන්තයෙන් ආශ්චර්යයෙකි. පින්වත, ඒකාන්තයෙන් පුදුමයෙකි”යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 550,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තුය්හං පන ගහපති කීව චිරං උපාසකත්තං උපගතස්සාති? මය්හම්පි ඛො භන්තෙ තිංස මත්තානි වස්සානි උපාසකත්තං උපගතස්සාති. ඉමෙහි ඛො පන තෙ ගහපති, තිංසමත්තෙහි වස්සෙහි අත්ථි කොචි උත්තරිමනුස්සධම්මා අලමරියඤාණදස්සනවිසෙසො අධිගතො ඵාසුවිහාරොති? කිං හි නො සියා භන්තෙ. අහං හි භන්තෙ යාවදෙව ආකඞ්ඛාමි විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහරාමි. අහං හි භන්තෙ යාවදෙව ආකඞ්ඛාමි. විතක්කවිචාරානං වූපසමා -පෙ- දුතියං ඣානං උපසම්පජ්ජ විහරාමි. අහං හි භන්තෙ, යාවදෙව ආකඞ්ඛාමි පීතියා ච විරාගා -පෙ- තතියං ඣානං උපසම්පජ්ජ විහරාමි. අහං හි භන්තෙ යාවදෙව ආකඞ්ඛාමි සුඛස්ස ච පහානා -පෙ- චතුත්ථං ඣානං උපසම්පජ්ජ විහරාමි. සචෙ ඛො පනාහං භන්තෙ භගවතො{1} පඨමතරං කාලං කරෙය්යං අනච්ඡරියං ඛො පනෙතං යං මං භගවා එවං ව්යාකරෙය්ය: නත්ථිතං සංයොජනං යෙන සංයොජනෙන සඤ්ඤුත්තො චිත්තො ගහපති පුන ඉමං ලොකං ආගච්ඡෙය්යාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං වුත්තෙ අචෙලො කස්සපො චිත්තං ගහපතිං එතදවොච: අච්ඡරියං වත භො අබ්භුතං වත භො ධම්මස්ස ස්වාක්ඛාතතා, යත්ර හි නාම ගිහී ඔදාතවසනා{2} එවරූපං උත්තරිමනුස්සධම්මා අලමරියඤාණදස්සනවිසෙසං අධිගමිස්සන්ති{3} ඵාසුවිහාරං. ලභෙය්යාහං ගහපති ඉමස්මිං ධම්මවිනයෙ පබ්බජ්ජං, ලභෙය්යං උපසම්පදන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො චිත්තො ගහපති අචෙලං කස්සපං ආදාය යෙන ථෙරා භික්ඛූ තෙනුපසඞ්කමි, උපසඞ්කමිත්වා ථෙරෙ භික්ඛූ එතදවොච: අයං භන්තෙ අචෙලො කස්සපො අම්හාකං පුරාණගිහිසහායො. ඉමං ථෙරා පබ්බාජෙන්තු උපසම්පාදෙන්තු. අහමස්ස උස්සුක්කං කරිස්සාමි චීවරපිණ්ඩපාතසෙනාසනගිලානප්පච්චයභෙසජ්ජපරික්ඛාරානන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අලත්ථ ඛො අචෙලො කස්සපො ඉමස්මිං ධම්මවිනයෙ පබ්බජ්ජං අලත්ථ උපසම්පදං. අචිරූපසම්පන්නො ච පනායස්මා කස්සපො එකො වූපකට්ඨො අප්පමත්තො ආතාපී පහිතත්තො විහරන්තො න චිරස්සෙව යස්සත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජන්ති, තදනුත්තරං බ්රහ්මචරියපරියොසානං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහාසි. ඛීණා ජාති, වුසිතං බ්රහ්මචරියං, කතං කරණීයං, නාපරං ඉත්ථත්තායාති අබ්භඤ්ඤාසි. අඤ්ඤතරො ච පනායස්මා කස්සපො අරහතං අහොසීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. භගවතා - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ඔදාතවසනො - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අධිගමිස්සති - මඡසං, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "“ගැහැවි, උවසු බවට පැමිණි තොපට කෙතෙක් කල් දැ?”යි. හිමියනි, උවසු බවට පැමිණි මට ද තිසෙක් පමණ වසැ යි.” “ගැහැවි, මේ තිසෙක් පමණ වසින් මිනිස්දහමින් වැඩි පහසුවිහරණ වූ අරී බව කිරීමෙහි සමත් කිසියම් නැණදසුන් වෙසෙසක් ලබන ලද දැ? ”යි. “හිමියනි, කිම නො වන්නේ ද? හිමියනි, මම යම්තාක් කැමති වෙම් නම්, ඒ තාක් කාමයන්ගෙන් වෙන් ව ම අකුශල ධර්මයන්ගෙන් වෙන් ව ම විතර්ක සහිත විචාර සහිත විවෙකයෙන් හටගත් ප්‍රීතිය හා සුවය ඇති පළමු වන දැහැනට එළඹ වෙසෙමි. හිමියනි, මම යම්තාක් කැමති වෙම් නම් ඒ තාක් විතර්ක විචාර සන්හිඳීමෙන් .... දෙවන දැහැනට එළඹ වෙසෙමි. හිමියනි, මම යම්තාක් කැමති වෙම් නම් ඒ තාක් ප්‍රීතියත් වැළැක් වීමෙන් .... තෙවන දැහැනට එළඹ වෙසෙමි. හිමියනි, මම යම් තාක් කැමති වෙම් නම් ඒ තාක් සුවත් පැහීමෙන් .... සිවුවන දැහැනට එළඹ වෙසෙමි. හිමියනි, ඉදින් මම භාග්‍යවතුන් වහන්සේට පළමුකොට කලුරිය කරන්නෙම් නම් ‘යම් සංයෝජනයකින් යෙදුනු චිත්ත ගැහැවි තෙමේ යලි මෙලොවට එන්නේ ද එබඳු සංයෝජනයෙක් නැතැ’ යි භාග්‍යවතුන් වහන්සේ මා ගැන යමක් මෙසේ වදාරන්නාහු නම් මේ පුදුමයෙක් නො වේ මැ” යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මෙසේ කී කල්හි අචේලකස්සප තෙමේ චිත්ත ගැහැවිහට මෙය කී ය: “යම් හෙයකින් සුදුවත් හැඳගත් ගිහියෝ මිනිස්දහමින් වැඩි පහසු විහරණ වූ අරීබව කිරීමෙහි සමත් මෙබඳු නැණදසුන් වෙසෙසක් ලැබුවාහු නම් පින්වත, දහම්හි ස්වාඛ්‍යාත බව ඒකාන්තයෙන් ආශ්චර්යයෙකි. පින්වත, ඒකාන්තයෙන් පුදුමයෙකි. ගැහැවි, මම මෙසස්නෙහි පැවිද්ද ලබන්නෙමි. උපසපුව ලබන්නෙමි” යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉක්බිති චිත්ත ගැහැවි තෙමේ අචේලකස්සපන් රැගෙන ස්ථවිර භික්ෂූන් වෙත එළඹියේ ය. එළඹ ස්ථවිර භික්ෂූන්ට මෙය කී ය: වහන්ස, මේ අචේලකස්සප තෙමේ අපගේ පැරණි ගිහි යහළුවෙකි. තෙරහු මොහු පැවිදි කෙරෙත්වා. උපසපන් කෙරෙත්වා. මම මොහුට සිවුරු පිඬු සෙනසුන් ගිලන්පස බෙහෙත් පිරිකර පිළිබඳ ව උත්සාහ කරන්නෙමි යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අචේලකස්සප තෙමේ මෙසසුනෙහි පැවිද්ද ලදි. උපසපුව ලදී. උපසපන් වූ නො බෝකල් ඇති ආයුෂ්මත් කස්සප තෙමේ එකලාව ගණයා කෙරෙන් වෙන් ව නො පමා ව කෙලෙස් තවන වෙර ඇති ව නිවන් පිණිස මෙහෙයූ සිත් ඇති ව වෙසෙන්නේ නො බෝකලකින් ම කුලපුත්තු යමක් පිණිස මැනවින් ම ගිහිගෙන් නික්ම සස්නෙහි පැවිදි වෙත් නම් අනුතුරු වූ බඹසර කෙළවර වූ ඒ රහත් බව දිටුදැමියෙහි ම තෙමේ ම වෙසෙසින් දැන පසක් කොට එයට පැමිණ විසී ය. ඉපැද්ම ගෙවුණි. බඹසර වැස නිමවන ලදී. රහත්බව පිණිස කටයුතු කරන ලදි. මේ රහත්බව පිණිස අනෙකක් නැතැ යි දැනගත්තේ ය. ආයුෂ්මත් කස්සප තෙරණුවෝ රහතුන් අතුරෙන් එක්තරා කෙනෙක් ද වූ හ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 552,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "7. 1. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ගිලානසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "414. තෙන ඛො පන සමයෙන චිත්තො ගහපති ආබාධිකො හොති දුක්ඛිතො බාළ්හගිලානො. අථ ඛො සම්බහුලා ආරාමදෙවතා වනදෙවතා රුක්ඛදෙවතා ඔසධි තිණ වනස්පතීසු{1} අධිවත්ථා දෙවතා සඞ්ගම්ම සමාගම්ම චිත්තං ගහපතිං එතදවොචුං: පණිධෙහි ගහපති අනාගතමද්ධානං රාජා අස්සං චක්කවත්තීති. එවං වුත්තෙ චිත්තො ගහපති තා ආරාමදෙවතා වනදෙවතා රුක්ඛදෙවතා ඔසධී තිණ වනස්පතීසු අධිවත්ථා දෙවතා එතදවොච: ‘තම්පි අනිච්චං, තම්පි අද්ධුවං තම්පි පහාය ගමනීයන්ති’. එවං වුත්තෙ චිත්තස්ස ගහපතිනො මිත්තාමච්චා ඤාතිසාලොහිතා චිත්තං ගහපතිං එතදවොචුං: ‘සතිං අය්යපුත්ත උපට්ඨපෙහි මා විප්පලපී’ති{2}."
                    },
                    {
                        "type": "paragraph",
                        "text": "කින්නාහං{3} වදාමි යං මං තුම්හෙ එවං වදෙථ: ‘සතිං අය්යපුත්ත උපට්ඨපෙහි මා විප්පලපී’ති. එවං ඛො ත්වං අය්යපුත්ත වදෙසි: “තම්පි අනිච්චං තම්පි අද්ධුවං තම්පි පහාය ගමනීය’න්ති. තථා හි පන මං ආරාමදෙවතා වනදෙවතා රුක්ඛදෙවතා ඔසධි තිණ වනස්පතීසු අධිවත්ථා දෙවතා එවමාහංසු: ‘පණිධෙහි ගහපති අනාගතමද්ධානං රාජා අස්සං චක්කවත්තී’ති. තාසාහං එවං වදාමි: තම්පි අනිච්චං තම්පි අද්ධුවං තම්පි පහාය ගමනීයන්ති. කින්තෙ{4} අය්යපුත්ත ආරාමදෙවතා වනදෙවතා රුක්ඛදෙවතා ඔසධී තිණ වනස්පතීසු අධිවත්ථා දෙවතා අත්ථවසං සම්පස්සමානා එවමාහංසු: පණිධෙහි ගහපති අනාගතමද්ධානං රාජා අස්සං චක්කවත්තීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තාසං ඛො ආරාමදෙවතානං වනදෙවතානං රුක්ඛදෙවතානං ඔසධී තිණ වනස්පතීසු අධිවත්ථානං දෙවතානං එවං හොති: අයං ඛො චිත්තො ගහපති සීලවා කල්යාණධම්මො. සචෙ පණිදහිස්සති අනාගතමද්ධානං රාජා අස්සං චක්කවත්තීති,{5} ඉජ්ඣිස්සති සීලවතො චෙතොපණිධි, විසුද්ධත්තා සීලස්ස, ධම්මිකො ධම්මරාජා ධම්මිකං බලිං{6} අනුප්පදස්සතීති{7}. ඉමං{8} ඛො ආරාමදෙවතා වනදෙවතා රුක්ඛදෙවතා ඔසධීතිණවනස්පතීසු අධිවත්ථා දෙවතා අත්ථවසං සම්පස්සමානා එවමාහංසු: ‘පණිධෙහි ගහපති අනාගතමද්ධානං රාජා අස්සං චක්කවත්තී’ති. තාසාහං එවං වදාමි: ‘තම්පි අනිච්චං තම්පි අද්ධුවං තම්පි පහාය ගමනීය’න්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. වනප්පතීසු - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. විප්පලපසි - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. කින්ත්යාහං - සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "4. කිම්පනතා - ස්යා, මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. තස්ස ඛො අයං - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "6. ඵල - මඡසං. බලං - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "7. අනුපස්සතීති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "8. ඉමා ඛො තා - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "7. 1. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ගිලාන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "414. එසමයෙහි චිත්ත ගැහැවි තෙමේ හටගත් ආබාධ ඇත්තේ දුකට පැමිණියේ දැඩි සේ ගිලන් වූයේ වෙයි. එකල්හි බොහෝ වූ අරම්වැසි දෙවියෝ ද වනවැසි දෙවියෝ ද රුක්දෙවියෝ ද ඔසධිතෘණ වනදෙටුරුක්හි අරක්ගත් දෙවියෝ ද එක්ව රැස්ව චිත්ත ගැහැවිහට “ගැහැවි, ‘මතු සක්විතිරජ වෙම් ව’ යි සිත පිහිටුව යි” කීහ. එසේ කී කල්හි චිත්ත ගැහැවි තෙමේ ඒ අරම්වැසි දෙවියන්ට වනවැසි දෙවියන්ට රුක්දෙවියන්ට ඔසධිතෘණවනදෙටුරුක්හි අරක්ගත් දෙවියන්ට “එ ද අනිස ය. එ ද නො තිර ය. එ ද හැර දමා යා යුතු ය”යි මෙය කීය. එසේ කී කල්හි චිත්ත ගැහැවිහුගේ මිතුඇමති නෑ සහලේ නෑයෝ චිත්ත ගැහැවිහට “හිමියනි, සිහි එලවා ගනු මැනවි, නහමක් නන්දොඩනු මැනවැ”යි කීහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මා කුමක් කී හෙයින් තෙපි මට “හිමියනි, සිහි එලවා ගනු මැනවි, නහමක් නන්දොඩනු මැනවැ”යි මෙසේ කියවු ද? “හිමියනි, තෙපි ‘එ ද අනිස ය. එ ද නො තිර ය. එ ද හැර දමා යා යුතු ය’යි මෙසේ කියවු. ඒ එසේ මැ යි. අරම්වැසි දෙවියෝත් වනවැසි දෙවියෝත් රුක්දෙවියෝත් ඔසධිතෘණවනදෙටුරුක්හි අරක්ගත් දෙවියෝත් මට “ගැහැවි, ‘මතු සක්විතිරජ වෙම් ව’ යි සිත පිහිටුව යි” මෙසේ කීහ. ඔවුන්ට මම “එ ද අනිස ය. එ ද නො තිර ය. එ ද හැර දමා යා යුතු ය”යි මෙසේ කියමි යි. හිමියනි, ඒ අරම්වැසි දෙවියෝ වනවැසි දෙවියෝ රුක්දෙවියෝ ඔසධිතෘණ වනදෙටුරුක්හි අරක්ගත් දෙවියෝ කුමන ප්‍රයෝජනයක් දක්නාහු ‘ගැහැවි, මතු සක්විතිරජ වෙම් ව යි සිත පිහිටුව’ යි මෙසේ කීහු දැ? යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඒ අරම්වැසි දෙවියන්ට වනවැසි දෙවියන්ට රුක්දෙවියන්ට ඔසධිතෘණවනදෙටුරුක්හි අරක්ගත් දෙවියන්ට මෙබඳු සිතෙක් වෙයි. මේ චිත්ත ගැහැවි තෙමේ සිල්වත් ය. කලණ දහම් ඇත්තේ ය. ඉඳින් මතු සක්විති රජ වෙම්ව යි පතන්නේ නම් සිල්වත්හු ගේ පැතීම සමෘද්ධ වන්නේ ය. ශීලය පිරිසිදු බැවිනි. දැහැමි දහම්රජ තෙමේ දැහැමි බිලි දෙන්නේ යයි මේ ප්‍රයෝජනය දක්නා අරම්වැසි දෙවියෝ වනවැසි දෙවියෝ රුක්දෙවියෝ ඔසධිතෘණ වනදෙටුරුක්හි අරක්ගත් දෙවියෝ ‘ගැහැවි, මතු සක්විති රජ වෙම් ව යි සිත පිහිටුව යි’ මෙසේ කීහ. ඔවුන්ට මම ‘එ ද අනිස ය. එ ද නො තිර ය. එ ද හැරදමා යා යුතු ය’යි මෙසේ කියමි යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 554,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තෙන හි අය්යපුත්ත අම්හෙපි ඔවදෙහීති.{1} තස්මාතිහ වො එවං සික්ඛිතබ්බං: බුද්ධෙ අවෙච්චප්පසාදෙන සමන්නාගතා භවිස්සාම, ඉතිපි සො භගවා අරහං සම්මා සම්බුද්ධො විජ්ජාචරණසම්පන්නො සුගතො ලොකවිදූ අනුත්තරො පුරිසදම්මසාරථි සත්ථා දෙවමනුස්සානං බුද්ධො භගවාති. ධම්මෙ අවෙච්චප්පසාදෙන සමන්නාගතා භවිස්සාම: ස්වාක්ඛාතො භගවතා ධම්මො සන්දිට්ඨිකො අකාලිකො එහිපස්සිකො ඔපනයිකො පච්චත්තං වෙදිතබ්බො විඤ්ඤූහීති. සඞ්ඝෙ අවෙච්චප්පසාදෙන සමන්නාගතා භවිස්සාම: සුපටිපන්නො භගවතො සාවකසඞ්ඝො, උජුපටිපන්නො භගවතො සාවකසඞ්ඝො, ඤායපටිපන්නො භගවතො සාවකසඞ්ඝො, සාමීචිපටිපන්නො භගවතො සාවකසඞ්ඝො, යදිදං චත්තාරි පුරිසයුගානි අට්ඨපුරිසපුග්ගලා එස භගවතො සාවකසඞ්ඝො ආහුනෙය්යො පාහුනෙය්යො දක්ඛිණෙය්යො අඤ්ජලිකරණීයො අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්සාති. යං ඛො පන කිඤ්චි කුලෙ දෙය්යධම්මං සබ්බන්තං අප්පටිවිභත්තං භවිස්සති සීලවන්තෙහි කල්යාණධම්මෙහීති. එවං හි වො සික්ඛිතබ්බන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො චිත්තො ගහපති මිත්තාමච්චෙ ඤාතිසාලොහිතෙ බුද්ධෙ ච ධම්මෙ ච සඞ්ඝෙ ච පසාදෙ චාගෙ ච{2} සමාදපෙත්වා කාලමකාසීති."
                    },
                    {
                        "type": "centered",
                        "text": "චිත්තවග්ගො පඨමො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රැද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "සංයොජනං ද්වෙ ඉසිදත්තා මහකො කාමභූපි ච\nගොදත්තො ච නිගණ්ඨො ච, අචෙලෙන ගිලානන්ති.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "විත්තසංයුත්තං සමත්තං",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඔවදාහීති - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සඞ්ඝෙ ච චාගෙ ච - මඡසං, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "හිමියනි, එසේ නම් අපටත් ඔවදන් දෙනු මැනවැ යි. එහෙයින් මෙහි ලා තොප විසින් මෙසේ හික්මිය යුතු යි. ඒ භාග්‍යවතුන් වහන්සේ මෙකරුණෙනුදු රහත්හ, සම්මාසම්බුද්ධහ, විජ්ජාචරණ සම්පන්නහ, සුගතහ, ලොකවිදූහ, අනුත්තරපුරිසදම්මසාරථීහ, දෙවිමිනිසුන්ට ශාස්තෘහ, බුද්ධහ, භගවත්හ යි, මෙසේ බුදුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වන්නෙමු. භාග්‍යවතුන් වහන්සේ විසින් ධර්මය ස්වාක්ඛාත ය, සන්දිට්ඨික ය, අකාලික ය, එහිපස්සික ය, ඔපනයික ය, නුවණැත්තවුන් විසින් තමතමා කෙරෙහි ලා දත යුතු යයි මෙසේ දහම්හි ගුණ දැන පැහැදීමෙන් යුතු වන්නෙමු. භගවත්හුගේ ශ්‍රාවක සඞ්ඝ තෙමේ සුපටිපන්න ය, භගවත්හුගේ ශ්‍රාවක සඞ්ඝ තෙමේ උජුපටිපන්න ය, භගවත්හුගේ ශ්‍රාවක සඞ්ඝ තෙමේ ඤායපටිපන්න ය, භගවත්හුගේ ශ්‍රාවක සඞ්ඝ තෙමේ සාමීචිපටිපන්න ය, යම් මේ පුරිසයුග සතරෙක් වේ ද, එහි පුරිස පුග්ගලයෝ අටදෙනෙකි, භගවත්හුගේ මේ ශ්‍රාවක සඞ්ඝ තෙමේ ආහුනෙය්‍ය ය, පාහුනෙය්‍ය ය, දක්ඛිණෙය්‍ය ය, අඤ්ජලිකරණීය ය, ලෝවැස්සාට උතුම් පින්කෙතැ යි, මෙසේ සඟුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වන්නෙමු. ගෙහි යම් කිසි දියයුතු දැයක් වේ නම් ඒ සියල්ල කලණ දහම් ඇති සිල්වතුන් හා නො බෙදන ලද්දේ (සාධාරණ) වන්නේ යයි තොප විසින් මෙසේ හික්මිය යුතු යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉක්බිති චිත්ත ගැහැවි තෙමේ මිතු ඇමැති නෑ සහලේනෑයන් බුදුන් කෙරෙහිත් දහම්හිත් සඞ්ඝයා කෙරෙහිත් පැහැදීමෙහි ද ත්‍යාග ගුණයෙහි ද සමාදන් කරවා කලුරිය කළේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පළමුවැනි චිත්තවර්ග යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි සූත්‍ර නාමාවලිය :**",
                        "type": "unindented"
                    },
                    {
                        "text": "සංයෝජන සූත්‍රය, ඉසිදත්ත සූත්‍ර දෙක ය, මහක සූත්‍රය, කාමභූ සූත්‍ර දෙක ය, ගෝදත්ත, නිගණ්ඨ, අචේල, ගිලාන සූත්‍ර සතර යයි සූත්‍ර දශයෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "චිත්ත සංයුත්තය නිමියේ යි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ]
}