{
    "filename": "sn-4-4",
    "bookId": 19,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 474,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "4. ජම්බුඛාදකසංයුත්තං",
                        "level": 3
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 1",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නිබ්බානසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "316. එකං සමයං ආයස්මා සාරිපුත්තො මගධෙසු විහරති නාලගාමකෙ.{1} අථ ඛො ජම්බුඛාදකො පරිබ්බාජකො යෙනායස්මා සාරිපුත්තො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මතා සාරිපුත්තෙන සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ජම්බුඛාදකො පරිබ්බාජකො ආයස්මන්තං සාරිපුත්තං එතදවොච: නිබ්බානං නිබ්බාණන්ති ආවුසො සාරිපුත්ත වුච්චති. කතමන්නු ඛො ආවුසො නිබ්බානන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යො ඛො ආවුසො රාගක්ඛයො දොසක්ඛයො මොහක්ඛයො ඉදං වුච්චති නිබ්බානන්ති. අත්ථි පනාවුසො මග්ගො අත්ථි පටිපදා එතස්ස නිබ්බානස්ස සච්ඡිකිරියායාති. අත්ථි ඛො ආවුසො මග්ගො අත්ථි පටිපදා එතස්ස නිබ්බානස්ස සච්ඡිකිරියායාති. කතමො පනාවුසො මග්ගො කතමා පටිපදා එතස්ස නිබ්බානස්ස සච්ඡිකිරියායාති. අයමෙව ඛො ආවුසො අරියො අට්ඨඞ්ගිකො මග්ගො එතස්ස නිබ්බානස්ස සච්ඡිකිරියාය, සෙය්යථිදං: සම්මාදිට්ඨි සම්මාසඞ්කප්පො සම්මාවාචා සම්මාකම්මන්තො සම්මාආජීවො සම්මාවායාමො සම්මාසති සම්මාසමාධි. අයං ඛො ආවුසො මග්ගො අයං පටිපදා එතස්ස නිබ්බානස්ස සච්ඡිකිරියායාති. භද්දකො ආවුසො මග්ගො භද්දිකා පටිපදා එතස්ස නිබ්බානස්ස සච්ඡිකිරියාය. අලඤ්ච පනාවුසො සාරිපුත්ත, අප්පමාදායාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අරහත්තසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "317. අරහත්තං අරහත්තන්ති ආවුසො සාරිපුත්ත වුච්චති. කතමන්නු ඛො ආවුසො අරහත්තන්ති. යො ඛො ආවුසො රාගක්ඛයො දොසක්ඛයො මොහක්ඛයො. ඉදං වුච්චති අරහත්තන්ති. අත්ථි පනාවුසො මග්ගො අත්ථි පටිපදා එතස්ස අරහත්තස්ස සච්ඡිකිරියායාති. අත්ථි ඛො ආවුසො මග්ගො අත්ථි පටිපදා එතස්ස අරහත්තස්ස සච්ඡිකිරියායාති. කතමො පනාවුසො මග්ගො කතමා පටිපදා එතස්ස අරහත්තස්ස සච්ඡිකිරියායාති. අයමෙව ඛො ආවුසො අරියො අට්ඨඞ්ගිකො මග්ගො එතස්ස අරහත්තස්ස සච්ඡිකිරියාය. සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. අයං ඛො ආවුසො මග්ගො අයං පටිපදා එතස්ස අරහත්තස්ස සච්ඡිකිරියායාති. භද්දකො ආවුසො මග්ගො භද්දිකා පටිපදා එතස්ස අරහත්තස්ස සච්ඡිකිරියාය. අලඤ්ච පනාවුසො සාරිපුත්ත අප්පමාදායාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. නාලකගාමකෙ - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "4. ජම්බුඛාදක සංයුක්තය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නිබ්‌බාන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "316. එක්කලෙක ආයුෂ්මත් සැරියුත් තෙරණුවෝ මගධ දනව්වෙහි නාලගම් හි වැඩවෙසෙති. එකල්හි ජම්බුඛාදක පිරිවැජි තෙමේ ආයුෂ්මත් සැරියුත් තෙරණුවන් වෙත එළැඹියේ ය. එළඹ ආයුෂ්මත් සැරියුත් තෙරණුවන් සමග සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පස් ව හුන්නේ ය. එකත්පස් ව හුන් ජම්බුඛාදක පිරිවැජි තෙමේ ආයුෂ්මත් සැරියුත් තෙරණුවන්ට මෙය කීය: ඇවැත්නි, ශාරීපුත්‍රයෙනි, නිවන නිවනැ යි කියනු ලැබේ. ඇවැත්නි, නිවන කවරේ දැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත්නි, යම් රාගය දුරලීමෙක් දෝසය දුරලීමෙක්, මෝහය දුරලීමෙක් වේ නම් මේ නිවනැ යි කියනු ලැබේ. ඇවැත්නි, මේ නිවන පසක් කිරීමට මගෙක් ඇද් ද, පිළිවෙතක් ඇද් දැයි. ඇවැත්නි, මේ නිවන පසක් කිරීමට මගෙක් ඇත. පිළිවෙතෙක් ඇත. ඇවැත්නි, මේ නිවන පසක් කිරීමට මග කවරේ ද, පිළිවෙත කවරේ දැ යි. ඇවැත්නි, මේ නිවන පසක් කිරීමට මේ අරිඅටඟිමඟ ම ය. එනම්: සම්මාදිට්ඨිය, සම්මාසඞ්කප්පය, සම්මාවාචාය, සම්මාකම්මන්තය, සම්මාආජීවය, සම්මාවායාමය, සම්මාසතිය, සම්මාසමාධිය යි. ඇවැත්නි, මේ නිවන පසක් කිරීමට මේ මග යි. මේ පිළිවෙත යි. ඇවැත්නි මේ නිවන පසක් කිරිමට සොඳුරු මගෙකි. සොඳුරු පිළිවෙතෙකි. ඇවැත්නි, ශාරීපුත්‍රයෙනි, නො පමා වීමට සුදුසු යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අරහත්‌ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "317. ඇවැත්නි, ශාරිපුත්‍රයෙනි, රහත්බව, රහත්බවැ යි කියනු ලැබේ. ඇවැත්නි, රහත්බව කවරේ දැ යි. ඇවැත්නි, යම් රාගය දුරලිමෙක් දොසය දුරලිමෙක් මෝහය දුරලීමෙක් වේ නම් මේ රහත් බවැ යි කියනු ලැබේ. ඇවැත්නි, මේ රහත්බව පසක්කිරීමට මගෙක් ඇද්ද, පිළිවෙතෙක් ඇද්දැ යි. ඇවැත්නි, මේ රහත්බව පසක්කිරීමට මගෙක් ඇත. පිළිවෙතෙක් ඇතැ යි. ඇවැත්නි, මේ රහත්බව පසක් කිරිමට මග කවරේ ද, පිළිවෙත කවරේදැ යි. ඇවැත්නි, මේ රහත්බව පසක් කිරීමට මේ අරී අටඟි මඟ මැ යි. එනම්: සම්මාදිට්ඨිය ... සම්මාසමාධිය යි. ඇවැත්නි, මේ රහත්බව පසක් කිරීමට මේ ඇති මග යි. මේ පිළිවෙත යි. ඇවැත්නි, මේ රහත්බව පසක් කිරිමට සොඳුරු මගෙකි. සොඳුරු පිළිවෙතෙකි. ඇවැත්නි, ශාරීපුත්‍රයෙනි, නො පමාවිමට සුදුසු යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 476,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 1. 3",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ධම්මවාදීසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "318. කො නු ඛො ආවුසො සාරිපුත්ත ලොකෙ ධම්මවාදිනො, කෙ ලොකෙ සුප්පටිපන්නා, කෙ ලොකෙ සුගතාති. යෙ ඛො ආවුසො රාගස්ස පහානාය{1} ධම්මං දෙසෙන්ති, දොසස්ස පහානාය ධම්මං දෙසෙන්ති, මොහස්ස පහානාය ධම්මං දෙසෙන්ති, තෙ ලොකෙ ධම්මවාදිනො. යෙ ඛො ආවුසො රාගස්ස පහානාය පටිපන්නා, දොසස්ස පහානාය පටිපන්නා, මොහස්ස පහානාය පටිපන්නා, තෙ ලොකෙ සුප්පටිපන්නා. යෙසං ඛො ආවුසො රාගො පහීනො උච්ඡින්නමූලො තාලාවත්ථුකතො අනභාවකතො{2} ආයතිං අනුප්පාදධම්මො, දොසො පහීනො උච්ඡින්නමූලො තාලාවත්ථුකතො අනභාවකතො ආයතිං අනුප්පාදධම්මො, මොහො පහීනො උච්ඡින්නමූලො තාලාවත්ථුකතො අනභාවකතො ආයතිං අනුප්පාදධම්මො තෙ ලොකෙ සුගතාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථි පනාවුසො මග්ගො අත්ථි පටිපදා එතස්ස රාගස්ස දොසස්ස මොහස්ස පහානායාති. අත්ථි ඛො{3} ආවුසො මග්ගො අත්ථි පටිපදා එතස්ස රාගස්ස දොසස්ස මොහස්ස පහානායාති. කතමො පනාවුසො මග්ගො කතමා පටිපදා එතස්ස රාගස්ස දොසස්ස මොහස්ස පහානායාති. අයමෙව ඛො ආවුසො අරියො අට්ඨඞ්ගිකො මග්ගො එතස්ස රාගස්ස දොසස්ස මොහස්ස පහානාය. සෙය්යථිදං: සම්මාදිට්ඨි -පෙ-සම්මාසමාධි. අයං ඛො ආවුසො මග්ගො අයං පටිපදා එතස්ස රාගස්ස දොසස්ස මොහස්ස පහානායාති. භද්දකො ආවුසො මග්ගො භද්දිකා පටිපදා එතස්ස රාගස්ස දොසස්ස මොහස්ස පහානාය. අලඤ්ච පනාවුසො සාරිපුත්ත, අප්පමාදායාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කිමත්ථියසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "319. කිමත්ථියං ආවුසො සාරිපුත්ත, සමණෙ ගොතමෙ බ්රහ්මචරියං වුස්සතීති. දුක්ඛස්ස ඛො ආවුසො, පරිඤ්ඤත්ථං භගවති බ්රහ්මචරියං වුස්සතීති. අත්ථි පනාවුසො මග්ගො අත්ථි පටිපදා එතස්ස දුක්ඛස්ස පරිඤ්ඤායාති. අත්ථි ඛො ආවුසො මග්ගො අත්ථි පටිපදා එතස්ස දුක්ඛස්ස පරිඤ්ඤායාති. කතමො පනාවුසො මග්ගො කතමා පටිපදා එතස්ස දුක්ඛස්ස පරිඤ්ඤායාති. අයමෙව ඛො ආවුසො අරියො අට්ඨඞ්ගිකො මග්ගො එතස්ස දුක්ඛස්ස පරිඤ්ඤාය, සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. අයං ඛො ආවුසො මග්ගො අයං පටිපදා එතස්ස දුක්ඛස්ස පරිඤ්ඤායාති. භද්දකො ආවුසො මග්ගො භද්දිකා පටිපදා එතස්ස දුක්ඛස්ස පරිඤ්ඤාය. අලඤ්ච පනාවුසො සාරිපුත්ත අප්පමාදායාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. රාගප්පහානාය - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අනභාවං කතො - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අත්ථියෙව ඛො - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 1. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ධම්‌මවාදී සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "318. ඇවැත්නි ශාරීපුත්‍රයෙනි, ලොව ධර්මවාදීහු කවරහු ද ලොව සුපටිපන්න කවරහු ද? ලොව සුගත කවරහු දැ යි. ඇවැත්නි, යම් කෙනෙක් රාග ප්‍රහාණය පිණිස දහම් දෙසත් ද, දෝස ප්‍රහාණය පිණිස දහම් දෙසත් ද, මෝහ ප්‍රහාණය පිණිස දහම් දෙසත් ද, ඔහු ලොව ධර්මවාදීහු ය. ඇවැත්නි, යම් කෙනෙක් රාග ප්‍රහාණය පිණිස පිළිපන්නාහු ද, දොස ප්‍රහාණය පිණිස පිළිපන්නාහු ද, මෝහ ප්‍රහාණය පිණිස පිළිපන්නාහු ද, ඔහු ලොව සුපටිපන්නයෝ ය. ඇවැත්නි, යම් කෙනකුන්ගේ රාගය ප්‍රහීණ වී ද, උසුන්මුල් ඇත්තේ ද, මුදුන සුන් තල් රුකක් මෙන් කරන ලද්දේ ද, පුන පුනා නො වීම කරන ලද්දේ ද, මතු නූපදනා ස්වභාව ඇත්තේ ද; දෝසය ප්‍රහීණ වී ද, උසුන්මුල් ඇත්තේ ද, මුදුනසුන් තල් රුකක් මෙන් කරන ලද්දේ ද, පුන පුනා නො වීම කරන ලද්දේ ද, මතු නුපදීනා ස්වභාව ඇත්තේ ද; මෝහය ප්‍රහීණ ද, උසුන් මුල් ඇත්තේ ද, මුදුනසුන් තල්රුකක් මෙන් කරන ලද්දේ ද, පුන පුනා නො වීම කරන ලද්දේ ද, මතු නූපදනා ස්වභාව ඇත්තේ ද ඔහු ලොව සුගතයෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත්නි, මේ රාගය, දෝසය, මෝහය ප්‍රහාණයට මගෙක් ඇත්ද, පිළිවෙතෙක් ඇත්දැ යි. ඇවැත්නි, මේ රාගය, දොසය මොහය ප්‍රහාණයට මගෙක් ඇත. පිළිවෙතෙක් ඇතැ යි. ඇවැත්නි, මේ රාගය දොසය මොහය ප්‍රහාණයට මග කවරේ ද පිළිවෙත කවරේදැ යි. ඇවැත්නි, මේ රාගය, දෝසය, මෝහය ප්‍රහාණයට මේ අරී අටගඟි මග ම ය. එනම්: සම්මාදිට්ඨිය … සම්මාසමාධි ය යි. ඇවැත්නි, මේ රාගය දෝසය මෝහය ප්‍රහාණයට මේ මග යි. මේ පිළිවෙත යි. ඇවැත්නි, මේ රාගය දෝසය මෝහය ප්‍රහාණයට සොඳුරු මගෙකි. සොඳුරු පිළිවෙතෙකි. ඇවැත්නි, ශාරීපුත්‍රයෙනි, නො පමා වීමට සුදුසු යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කිමත්‌ථිය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "319. ඇවැත්නි, ශාරීපුත්‍රයෙනි, කුමක් පිණිස මහණ ගොයම්හු කෙරෙහි බඹසර වෙසේ දැ යි. ඇවැත්නි දුක පිරිසිඳ දැනීම පිණිස භාග්‍යවතුන් වහන්සේ කෙරෙහි බඹසර වෙසේ යි. ඇවැත්නි, මේ දුක පිරිසිඳ දැනීම පිණිස මගෙක් ඇත් ද පිළිවෙතෙක් ඇත් දැයි. ඇවැත්නි, මේ දුක පිරිසිඳ දැනීම පිණිස මගෙක් ඇත, පිළිවෙතෙක් ඇතැ යි. ඇවැත්නි, මේ දුක පිරිසිඳ දැනීම පිණිස මග කවරේ ද පිළිවෙත කවරේ දැ යි. ඇවැත්නි, මේ දුක පිරිසිඳ දැනීම පිණිස මේ අරී අටඟි මග ම ය. එනම්: සම්මාදිට්ඨිය ... සම්මාසමාධිය යි. ඇවැත්නි, මේ දුක පිරිසිඳ දැනීම පිණිස මේ මග යි, මේ පිළිවෙත යි. ඇවැත්නි, මේ දුක පිරිසිඳ දැනීම පිණිස සොඳුරු මගෙකි. සොඳුරු පිළිවෙතෙකි. ඇවැත්නි, ශාරීපුත්‍රයෙනි, නො පමා වීමට සුදුසු යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 478,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 1. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අස්සාසසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "320. අස්සාසප්පත්තො අස්සාසප්පත්තොති ආවුසො සාරිපුත්ත වුච්චති. කිත්තාවතා නු ඛො ආවුසො සාරිපුත්ත අස්සාසප්පත්තො හොතීති. යතො ඛො ආවුසො භික්ඛු ඡන්නං ඵස්සායතනානං සමුදයඤ්ච අත්ථගමඤ්ච අස්සාදඤ්ච ආදීනවඤ්ච නිස්සරණඤ්ච යථාභූතං පජානාති, එත්තාවතා ඛො ආවුසො අස්සාසප්පත්තො හොතීති. අත්ථි පනාවුසො මග්ගො අත්ථි පටිපදා එතස්ස අස්සාසස්ස සච්ඡිකිරියායාති. අත්ථි ඛො ආවුසො මග්ගො අත්ථි පටිපදා එතස්ස අස්සාසස්ස සච්ඡිකිරියායාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො පනාවුසො මග්ගො කතමා පටිපදා එතස්ස අස්සාසස්ස සච්ඡිකිරියායාති. අයමෙව ඛො ආවුසො අරියො අට්ඨඞ්ගිකො මග්ගො එතස්ස අස්සාසස්ස සච්ඡිකිරියාය. සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. අයං ඛො ආවුසො මග්ගො අයං පටිපදා එතස්ස අස්සාසස්ස සච්ඡිකිරියායාති. භද්දකො ආවුසො මග්ගො භද්දිකා පටිපදා එතස්ස අස්සාසස්ස සච්ඡිකිරියාය. අලඤ්ච පනාවුසො සාරිපුත්ත, අප්පමාදායාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරමස්සාසසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "321. පරමස්සාසප්පත්තො පරමස්සාසප්පත්තොති ආවුසො සාරිපුත්ත, වුච්චති. කිත්තාවතා නු ඛො ආවුසො සාරිපුත්ත, පරමස්සාසප්පත්තො හොතීති. යතො ඛො ආවුසො භික්ඛු ඡන්නං ඵස්සායතනානං සමුදයඤ්ච අත්ථගමඤ්ච අස්සාදඤ්ච ආදීනවඤ්ච නිස්සරණඤ්ච යථාභූතං විදිත්වා අනුපාදා විමුත්තො හොති, එත්තාවතා ඛො ආවුසො පරමස්සාසප්පත්තො හොතීති. අත්ථි පනාවුසො මග්ගො අත්ථි පටිපදා එතස්ස පරමස්සාසස්ස සච්ඡිකිරියායාති. අත්ථි ඛො ආවුසො මග්ගො අත්ථි පටිපදා එතස්ස පරමස්සාසස්ස සච්ඡිකිරියායාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො පනාවුසො මග්ගො කතමා පටිපදා එතස්ස පරමස්සාසස්ස සච්ඡිකිරියායාති. අයමෙව ඛො ආවුසො අරියො අට්ඨඞ්ගිකො මග්ගො එතස්ස පරමස්සාසස්ස සච්ඡිකිරියාය. සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. අයං ඛො ආවුසො මග්ගො අයං පටිපදා එතස්ස පරමස්සාසස්ස සච්ඡිකිරියායාති. භද්දකො ආවුසො මග්ගො භද්දිකා පටිපදා එතස්ස පරමස්සාසස්ස සච්ඡිකිරියාය. අලඤ්ච පනාවුසො සාරිපුත්ත අප්පමාදායාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 1. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අස්‌සාස සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "320. ඇවැත්නි ශාරීපුත්‍රයෙනි, අස්වැසුමට පැමිණියේ අස්වැසුමට පැමිණියේ යි කියනු ලැබේ. ඇවැත්නි ශාරීපුත්‍රයෙනි, කෙතෙකින් අස්වැසුමට පැමිණියේ වේ දැ යි. ඇවැත්නි, මහණ තෙමේ යම් කලෙක ස්පර්ශායතන සයෙහි සමුදයත් අස්තඞ්ගමයත් ආස්වාදයත් ආදිනවයත් නිශ්ශරණයත් තතු සේ දකී ද, ඇවැත්නි, මෙතෙකින් අස්වැසුමට පැමිණියේ වේ යි. ඇවැත්නි, මේ අස්වැසුම පසක් කිරීමට මගෙක් ඇත් ද පිළිවෙතෙක් ඇත්ද දැ යි. ඇවැත්නි, මේ අස්වැසුම පසක් කිරීමට මගෙක් ඇත. පිළිවෙතෙක් ඇතැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත්නි මේ අස්වැසුම පසක් කිරීමට මග කවරේ ද පිළිවෙත කවරේ දැ යි. ඇවැත්නි, මේ අස්වැසුම පසක් කිරීමට මේ අරී අටඟි මග ම ය. එනම් සම්මාදිට්ඨිය … සම්මාසමාධිය යි. ඇවැත්නි, මේ අස්වැසුම පසක් කිරීමට මේ මග යි. මේ පිළිවෙත යි. ඇවැත්නි, මේ අස්වැසුම පසක් කිරීමට සොඳුරු මගෙකි, සොඳුරු පිළිවෙතෙකි. ඇවැත්නි ශාරීපුත්‍රයෙනි, නො පමා වීමට සුදුසු යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරමස්‌සාස සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "321. ඇවැත්නි ශාරීපුත්‍රයෙනි, උතුම් අස්වැසුමට පැමිණියේ උතුම් අස්වැසුමට පැමිණියෙ යි කියනු ලැබේ. ඇවැත්නි ශාරීපුත්‍රයෙනි, කෙතෙකින් උතුම් අස්වැසුමට පැමිණියේ වේ දැ යි. ඇවැත්නි, මහණ තෙමේ යම් කලෙක ස්පර්ශායතන සයෙහි සමුදයයත්, අස්තඞ්ගමයත් ආස්වාදයත් ආදීනවයත් නිශ්ශරණයත් තතු සේ දැන උපාදාන රහිත ව මිදුනේ වේ ද, ඇවැත්නි, මෙතෙකින් උතුම් අස්වැසුමට පැමිණියේ වෙයි. ඇවැත්නි, මේ උතුම් අස්වැසුම පසක් කිරීමට මගෙක් ඇත් ද පිළිවෙතෙක් ඇත්දැ යි. ඇවැත්නි, මේ උතුම් අස්වැසුම පසක් කිරීමට මගෙක් ඇත පිළිවෙතෙක් ඇතැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත්නි, මේ උතුම් අස්වැසුම පසක් කිරීමට මග කවරේ ද පිළිවෙත කවරේ දැ යි. ඇවැත්නි, මේ උතුම් අස්වැසුම පසක් කිරීමට මේ අරිඅටඟිමග ම ය. එනම් සම්මාදිට්ඨිය … සම්මාසමාධිය යි. ඇවැත්නි, මේ  උතුම් අස්වැසුම පසක් කිරීමට මේ මග යි. මේ පිළිවෙත යි. ඇවැත්නි, මේ උතුම් අස්වැසුම පසක් කිරීමට සොඳුරු මගෙකි. සොඳුරු පිළිවෙතෙකි. ඇවැත්නි ශාරීපුත්‍රයෙනි, නො පමා වීමට සුදුසු යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 480,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 1. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "වෙදනාසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "322. වෙදනා වෙදනාති ආවුසො ශාරිපුත්ත වුච්චති. කතමා නු ඛො ආවුසො වෙදනාති. තිස්සො ඉමා ආවුසො වෙදනා. සුඛා වෙදනා දුක්ඛා වෙදනා අදුක්ඛමසුඛා වෙදනා. ඉමා ඛො ආවුසො තිස්සො වෙදනාති. අත්ථි පනාවුසො මග්ගො අත්ථි පටිපදා එතාසං{1} වෙදනානං පරිඤ්ඤායාති. අත්ථි ඛො ආවුසො මග්ගො අත්ථි පටිපදා එතාසං වෙදනානං පරිඤ්ඤායාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො පනාවුසො මග්ගො කතමා පටිපදා එතාසං වෙදනානං පරිඤ්ඤායාති. අයමෙව ඛො ආවුසො අරියො අට්ඨඞ්ගිකො මග්ගො එතාසං වෙදනානං පරිඤ්ඤාය. සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. අයං ඛො ආවුසො මග්ගො අයං පටිපදා එතාසං වෙදනානං පරිඤ්ඤායාති. භද්දකො ආවුසො මග්ගො භද්දිකා පටිපදා එතාසං වෙදනානං පරිඤ්ඤාය. අලඤ්ච පනාවුසො සාරිපුත්ත අප්පමාදායාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආසවසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "323. ආසවො ආසවොති ආවුසො සාරිපුත්ත, වුච්චති. කතමො නු ඛො ආවුසො ආසවොති. තයො මෙ ආවුසො ආසවා. කාමාසවො භවාසවො අවිජ්ජාසවො. ඉමෙ ඛො ආවුසො තයො ආසවාති. අත්ථි පනාවුසො මග්ගො අත්ථි පටිපදා එතෙසං ආසවානං පහානායාති. අත්ථි ඛො ආවුසො මග්ගො අත්ථි පටිපදා එතෙසං ආසවානං පහානායාති. කතමො පනාවුසො මග්ගො කතමා පටිපදා එතෙසං ආසවානං පහානායාති. අයමෙව ඛො ආවුසො අරියො අට්ඨඞ්ගිකො මග්ගො එතෙසං ආසවානං පහානාය, සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. අයං ඛො ආවුසො මග්ගො අයං පටිපදා එතෙසං ආසවානං පහානායාති. භද්දකො ආවුසො මග්ගො භද්දිකා පටිපදා එතෙසං ආසවානං පහානාය. අලඤ්ච පනාවුසො සාරිපුත්ත අප්පමාදායාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අවිජ්ජාසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "324. අවිජ්ජා අවිජ්ජාති ආවුසො සාරිපුත්ත වුච්චති. කතමා නු ඛො ආවුසො අවිජ්ජාති. යං ඛො ආවුසො දුක්ඛෙ අඤ්ඤාණං දුක්ඛසමුදයෙ අඤ්ඤාණං, දුක්ඛනිරොධෙ අඤ්ඤාණං දුක්ඛනිරොධගාමිනියා පටිපදාය අඤ්ඤාණං, අයං වුච්චතාවුසො අවිජ්ජාති. අත්ථි පනාවුසො මග්ගො අත්ථි පටිපදා, එතිස්සා අවිජ්ජාය පහානායාති. අත්ථි ඛො ආවුසො මග්ගො අත්ථි පටිපදා එතිස්සා අවිජ්ජාය පහානායාති. කතමො පනාවුසො මග්ගො කතමා පටිපදා එතිස්සා අවිජ්ජාය පහානායාති. අයමෙව ඛො ආවුසො අරියො අට්ඨඞ්ගිකො මග්ගො එතිස්සා අවිජ්ජාය පහානාය. සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. අයං ඛො ආවුසො මග්ගො අයං පටිපදා එතිස්සා අවිජ්ජාය පහානායාති. භද්දකො ආවුසො මග්ගො, භද්දිකා පටිපදා එතිස්සා අවිජ්ජාය පහානාය. අලඤ්ච පනාවුසො සාරිපුත්ත අප්පමාදායාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. තිස්සන්නං - මඡසං, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 1. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "වෙදනා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "322. ඇවැත්නි ශාරීපුත්‍රයෙනි, වෙදනා වෙදනා වෙදනා යි කියනු ලැබේ. ඇවැත්නි, වෙදනා කවරහු දැ යි. ඇවැත්නි, මේ වෙදනා තුනෙකි, සුව වෙදනා ය, දුක වෙදනා ය, මැදහත් වෙදනා ය යි. ඇවැත්නි, මේ වෙදනා තුන යි. ඇවැත්නි, මේ වෙදනා තුන පිරිසිඳ දැනීම පිණිස මගෙක් ඇද් ද පිළිවෙතෙක් ඇද් දැ යි. ඇවැත්නි, මේ වෙදනා පිරිසිඳ දැනීම පිණිස මගෙක් ඇත. පිළිවෙතෙක් ඇතැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත්නි මේ වෙදනා, පිරිසිඳ දැනීම පිණිස මග කවරේ ද, පිළිවෙත කවරේ දැ යි. ඇවැත්නි, මේ වෙදනා පිරිසිඳ දැනීම පිණිස මේ අරිඅටඟිමග ම ය. එනම්: සම්මාදිට්ඨිය … සම්මාසමාධිය යි. ඇවැත්නි, මේ වේදනා පිරිසිඳ දැනීම පිණිස මේ මග යි, මේ පිළිවෙත යි. ඇවැත්නි, වෙදනා පිරිසිඳ දැනීම පිණිස සොඳුරු මගෙකි, සොඳුරු පිළිවෙතෙකි. ඇවැත්නි ශාරීපුත්‍රයෙනි, නො පමා වීමට සුදුසු යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආසව සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "323. ඇවැත්නි ශාරීපුත්‍රයෙනි, ආස්‍රව ආස්‍රවැ යි කියනු ලැබේ. ඇවැත්නි, ආස්‍රව කවරේදැ යි. ඇවැත්නි මේ ආස්‍රව තුනෙකි. කමාස්‍රව ය භවාස්‍රව ය අවිද්‍යාස්‍රව ය යි. ඇවැත්නි මේ ආස්‍රව තුන යි. ඇවැත්නි මේ ආස්‍රවයන් ප්‍රහාණය පිණිස මගෙක් ඇත් ද පිළිවෙතෙක් ඇද්ද යි. ඇවැත්නි, මේ ආස්‍රවයන් ප්‍රහාණය පිණිස මගෙක් ඇත, පිළිවෙතෙක් ඇතැ යි. ඇවැත්නි මේ ආස්‍රවයන් ප්‍රහාණය පිණිස මග කවරේ ද පිළිවෙත කවරේ දැ යි. ඇවැත්නි, මේ ආස්‍රවයන් ප්‍රහාණය පිණිස මේ අරිඅටඟිමග ම ය. එනම්: සම්මාදිට්ඨි ය … සම්මාසමාධිය යි. ඇවැත්නි, මේ ආස්‍රවයන් ප්‍රහාණය පිණිස මේ මග යි. මේ පිළිවෙත යි. ඇවැත්නි ආස්‍රවයන් ප්‍රහාණය පිණිස සොඳුරු මගෙකි. සොඳුරු පිළිවෙතෙකි. ඇවැත්නි ශාරීපුත්‍රයෙනි, නො පමා වීමට සුදුසු යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අවිජ්‌ජා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "324. ඇවැත්නි ශාරීපුත්‍රයෙනි, අවිද්‍යා අවිද්‍යා යි කියනු ලැබේ. ඇවැත්නි අවිද්‍යාව කවර දැයි. ඇවැත්නි, දුක්ඛයෙහි යම් නො දැනීමක්, දුක්ඛසමුදයෙහි නො දැනීමක්, දුක්ඛනිරොධයෙහි නො දැනීමෙක්, දුක්ඛනිරොධගාමිනීපටිපදායෙහි නො දැනීමෙක් වේ නම්, ඇවැත්නි, මේ අවිද්‍යාව යයි කියනු ලැබේ. ඇවැත්නි, මේ අවිද්‍යා ප්‍රහාණය පිණිස මගෙක් ඇත් ද පිළිවෙතෙක් ඇත් දැ යි. ඇවැත්නි, මේ අවිද්‍යාව ප්‍රහාණය පිණිස මගෙක් ඇත. පිළිවෙතෙක් ඇතැ යි. ඇවැත්නි, මේ අවිද්‍යාව ප්‍රහාණය පිණිස මග කවරේද, පිළිවෙත කවරේ දැ යි. ඇවැත්නි, මේ අවිද්‍යාව ප්‍රහාණය පිණිස මේ අරීඅටඟිමග ම ය. එනම් සම්මාදිට්ඨිය … සම්මාසමාධිය යි. ඇවැත්නි, මේ අවිද්‍යාව ප්‍රහාණය පිණිස සොඳුරු මගෙකි. සොඳුරු පිළිවෙතෙකි. ඇවැත්නි ශාරීපුත්‍රයෙනි, නො පමාවීමට සුදුසු යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 482,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 1. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තණ්හාසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "325. තණ්හා තණ්හාති ආවුසො සාරිපුත්ත වුච්චති. කතමා නු ඛො ආවුසො තණ්හාති. තිස්සො ඉමා ආවුසො තණ්හා: කාමතණ්හා භවතණ්හා විභවතණ්හා. ඉමා ඛො ආවුසො තිස්සො තණ්හාති. අත්ථි පනාවුසො මග්ගො අත්ථි පටිපදා එතාසං තණ්හානං පහානායාති. අත්ථි ඛො ආවුසො මග්ගො අත්ථි පටිපදා එතාසං තණ්හානං පහානායාති. කතමො පනාවුසො මග්ගො කතමා පටිපදා එතාසං තණ්හානං පහානායාති. අයමෙව ඛො ආවුසො අරියො අට්ඨඞ්ගිකො මග්ගො එතාසං තණ්හානං පහානාය. සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. අයං ඛො ආවුසො මග්ගො අයං පටිපදා එතාසං තණ්හානං පහානායාති. භද්දකො ආවුසො මග්ගො භද්දිකා පටිපදා එතාසං තණ්හානං පහානාය. අලඤ්ච පනාවුසො සාරිපුත්ත අප්පමාදායාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 11.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඔඝසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "326. ඔඝො ඔඝොති ආවුසො සාරිපුත්ත වුච්චති. කතමො නු ඛො ආවුසො ඔඝොති. චත්තාරොමෙ ආවුසො ඔඝා: කාමොඝො භවොඝො දිට්ඨොඝො අවිජ්ජොඝො. ඉමෙ ඛො ආවුසො චත්තාරො ඔඝාති. අත්ථි පනාවුසො මග්ගො අත්ථි පටිපදා එතෙසං ඔඝානං පහානායාති. අත්ථි ඛො ආවුසො මග්ගො අත්ථි පටිපදා එතෙසං ඔඝානං පහානායාති. කතමො පනාවුසො මග්ගො කතමා පටිපදා එතෙසං ඔඝානං පහානායාති. අයමෙව ඛො ආවුසො අරියො අට්ඨඞ්ගිකො මග්ගො එතෙසං ඔඝානං පහානාය. සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. අයං ඛො ආවුසො මග්ගො අයං පටිපදා එතෙසං ඔඝානං පහානායාති. භද්දකො ආවුසො මග්ගො භද්දිකා පටිපදා එතෙසං ඔඝානං පහානාය. අලඤ්ච පනාවුසො සාරිපුත්ත අප්පමාදායාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 12.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උපාදානසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "327. උපාදානං උපාදානන්ති පනාවුසො සාරිපුත්ත වුච්චති. කතමන්නු ඛො ආවුසො උපාදානන්ති. චත්තාරිමානි ආවුසො උපාදානානි: කාමුපාදානං දිට්ඨුපාදානං සීලබ්බතුපාදානං අත්තවාදුපාදානං. ඉමානි ඛො ආවුසො චත්තාරි උපාදානානීති. අත්ථි පනාවුසො මග්ගො අත්ථි පටිපදා එතෙසං උපාදානානං පහානායාති. අත්ථි ඛො ආවුසො මග්ගො අත්ථි පටිපදා එතෙසං උපාදානානං පහානායාති. කතමො පනාවුසො මග්ගො කතමා පටිපදා එතෙසං උපාදානානං පහානායාති. අයමෙව ඛො අරියො අට්ඨඞ්ගිකො මග්ගො එතෙසං උපාදානානං පහානාය, සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. අයං ඛො ආවුසො මග්ගො අයං පටිපදා එතෙසං උපාදානානං පහානායාති. භද්දකො ආවුසො මග්ගො භද්දිකා පටිපදා එතෙසං උපාදානානං පහානාය. අලඤ්ච පනාවුසො සාරිපුත්ත අප්පමාදායාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 1. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තණ්‌හා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "325. ඇවැත්නි ශාරීපුත්‍රයෙනි, තණ්හා තණ්හා යි කියනු ලැබේ. ඇවැත්නි තණ්හාව කවර යි. ඇවැත්නි මේ තණ්හා තුනෙකි. කාමතණ්හා ය, භවතණ්හා ය, විභව තණ්හා ය යි. ඇවැත්නි, මේ තණ්හා තුන යි. ඇවැත්නි මේ තණ්හා ප්‍රහාණය පිණිස මගෙක් ඇත් ද, පිළිවෙතෙක් ඇත් දැ යි. ඇවැත්නි, මේ තණ්හා ප්‍රහාණය පිණිස මගෙක් ඇත, පිළිවෙතෙක් ඇතැ යි. ඇවැත්නි, මේ තණ්හා ප්‍රහාණය පිණිස මග කවරේ ද පිළිවෙත කවරේ ද යි. ඇවැත්නි, මේ තණ්හා ප්‍රහාණය පිණිස මේ අරීඅටඟිමග ම ය. එනම්: සම්මාදිට්ඨිය … සම්මාසමාධිය යි. ඇවැත්නි, මේ තණ්හා ප්‍රහාණය පිණිස සොඳුරු මගෙකි, සොඳුරු පිළිවෙතෙකි. ඇවැත්නි ශාරීපුත්‍රයෙනි, නො පමා වීමට සුදුසු යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 11.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඔඝ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "326. ඇවැත්නි ශාරීපුත්‍රයෙනි, ඔඝ යැ යි ඔඝ යැ යි කියනු ලැබේ. ඇවැත්නි, ඔඝය කවරේ දැ යි. ඇවැත්නි, ඔඝ සතරෙකි, කාමොඝ ය භවොඝ ය දිට්ඨොඝ ය අවිජ්ජොඝ ය යි. ඇවැත්නි, මේ ඔඝ සතර යි. ඇවැත්නි, මේ ඔඝ ප්‍රහාණය පිණිස මගෙක් ඇද් ද, පිළිවෙතෙක් ඇද් දැ යි. ඇවැත්නි, මේ ඔඝ ප්‍රහාණය පිණිස මගෙක් ඇත. පිළිවෙතෙක් ඇතැ යි. ඇවැත්නි, මේ ඔඝ ප්‍රහාණය පිණිස මග කවරේ ද, පිළිවෙත කවරේ දැ යි. ඇවැත්නි, මේ ඔඝ ප්‍රහාණය පිණිස මේ අරීඅටඟිමඟ ම ය. එනම්: සම්මාදිට්ඨිය … සම්මාසමාධිය යි. ඇවැත්නි, මේ ඔඝ ප්‍රහාණය පිණිස මේ මග යි, මේ පිළිවෙත යි. ඇවැත්නි, මේ ඔඝ ප්‍රහාණය පිණිස සොඳුරු මගෙකි, සොඳුරු පිළිවෙතෙකි. ඇවැත්නි, ශාරීපුත්‍රයෙනි, නො පමා වීමට සුදුසු යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 12.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උපාදාන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "327. ඇවැත්නි ශාරීපුත්‍රයෙනි, උපාදාන උපාදානැ යි කියනු ලැබේ. ඇවැත්නි, උපාදාන කවරේ දැ යි. ඇවැත්නි, මේ උපාදාන සතරෙකි, කාමූපාදන ය, දිට්ඨූපාදන ය, සීලබ්බතූපාදනය, අත්තවාදූපාදාන ය යි. ඇවැත්නි, මේ උපාදාන සතර යි. ඇවැත්නි, මේ උපාදාන ප්‍රහාණය පිණිස මගෙක් ඇත් ද, පිළිවෙතෙක් ඇත් දැ යි. ඇවැත්නි, මේ උපාදාන ප්‍රහාණය පිණිස මගෙක් ඇත, පිළිවෙතෙක් ඇතැ යි. ඇවැත්නි, මේ උපාදාන ප්‍රහාණය පිණිස මග කවරේ ද, පිළිවෙත කවරේ දැ යි. ඇවැත්නි, මේ උපාදාන ප්‍රහාණය පිණිස මේ අරීඅටඟිමඟ ම ය. එනම්: සම්මාදිට්ඨිය … සම්මාසමාධිය යි. ඇවැත්නි, මේ උපාදාන ප්‍රහාණය පිණිස මේ මග යි, මේ පිළිවෙත යි. ඇවැත්නි, මේ උපාදාන ප්‍රහාණය පිණිස සොඳුරු මගෙකි, සොඳුරු පිළිවෙතෙකි. ඇවැත්නි, ශාරීපුත්‍රයෙනි, නො පමාවීමට සුදුසු යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 484,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 1. 13.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භවසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "328. භවො භවොති ආවුසො සාරිපුත්ත වුච්චති. කතමො නු ඛො ආවුසො භවොති, තයොමෙ ආවුසො භවා. කාමභවො රූපභවො අරූපභවො. ඉමෙ ඛො ආවුසො තයො භවාති. අත්ථි පනාවුසො මග්ගො අත්ථි පටිපදා එතෙසං භවානං පරිඤ්ඤායාති. අත්ථි ඛො ආවුසො මග්ගො අත්ථි පටිපදා එතෙසං භවානං පරිඤ්ඤායාති. කතමො පනාවුසො මග්ගො කතමා පටිපදා එතෙසං භවානං පරිඤ්ඤායාති. අයමෙව ඛො ආවුසො අරියො අට්ඨඞ්ගිකො මග්ගො එතෙසං භවානං පරිඤ්ඤාය. සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. අයං ඛො ආවුසො මග්ගො අයං පටිපදා එතෙසං භවානං පරිඤ්ඤායාති. භද්දකො පනාවුසො මග්ගො, භද්දිකා පටිපදා එතෙසං භවානං පරිඤ්ඤාය. අලඤ්ච පනාවුසො සාරිපුත්ත අප්පමාදායාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 14.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුක්ඛසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "329. දුක්ඛං දුක්ඛන්ති ආවුසො සාරිපුත්ත වුච්චති. කතමං නු ඛො ආවුසො දුක්ඛන්ති. තිස්සො ඉමා ආවුසො දුක්ඛතා. දුක්ඛදුක්ඛතා සඞ්ඛාරදුක්ඛතා විපරිණාමදුක්ඛතා. ඉමා ඛො ආවුසො තිස්සො දුක්ඛතාති. අත්ථි පනාවුසො මග්ගො අත්ථි පටිපදා එතාසං දුක්ඛතානං පරිඤ්ඤායාති. අත්ථි ඛො ආවුසො මග්ගො අත්ථි පටිපදා එතාසං දුක්ඛතානං පරිඤ්ඤායාති. කතමො පනාවුසො මග්ගො කතමා පටිපදා එතාසං දුක්ඛතානං පරිඤ්ඤායාති. අයමෙව ඛො ආවුසො අරියො අට්ඨඞ්ගිකො මග්ගො එතාසං දුක්ඛතානං පරිඤ්ඤාය, සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. අයං ඛො ආවුසො මග්ගො අයං පටිපදා එතාසං දුක්ඛතානං පරිඤ්ඤායාති. භද්දකො ආවුසො මග්ගො භද්දිකා පටිපදා එතාසං දුක්ඛතානං පරිඤ්ඤාය. අලඤ්ච පනාවුසො සාරිපුත්ත අප්පමාදායාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 15.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සක්කායසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "330. සක්කායො සක්කායොති ආවුසො සාරිපුත්ත වුච්චති. කතමො නු ඛො ආවුසො සක්කායොති. පඤ්චිමෙ ආවුසො උපාදානක්ඛන්ධා සක්කායො වුත්තො භගවතා. සෙය්යථිදං: රූපුපාදානක්ඛන්ධො වෙදනුපාදානක්ඛන්ධො සඤ්ඤුපාදානක්ඛන්ධො සඞ්ඛාරූපාදානක්ඛන්ධො විඤ්ඤාණුපාදානක්ඛන්ධො. ඉමෙ ඛො ආවුසො පඤ්චුපාදානක්ඛන්ධා සක්කායො වුත්තො භගවතාති. අත්ථි පනාවුසො මග්ගො අත්ථි පටිපදා එතස්ස සක්කායස්ස පරිඤ්ඤායාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "4. 1. 13.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භව සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "328. ඇවැත්නි ශාරීපුත්‍රයෙනි, භව භවැ යි කියනු ලැබේ. ඇවැත්නි, භව කවරේ දැ යි. ඇවැත්නි භව තුනෙකි. කාමභව ය, රූපභව ය, අරූපභව ය යි. ඇවැත්නි, මේ භව තුන යි. ඇවැත්නි, මේ භව පිරිසිඳ දැනීම පිණිස මගෙක් ඇත් ද, පිළිවෙතෙක් ඇත් දැ යි. ඇවැත්නි, මේ භව පිරිසිඳ දැනීම පිණිස මගෙක් ඇත, පිළිවෙතෙක් ඇතැ යි. ඇවැත්නි, මේ භව පිරිසිඳ දැනීම පිණිස මග කවරේ ද, පිළිවෙත කවරේ දැ යි. ඇවැත්නි, මේ භව පිරිසිඳ දැනීම පිණිස මේ අරීඅටඟිමඟ ම ය. එනම්: සම්මාදිට්ඨිය … සම්මාසමාධිය යි. ඇවැත්නි, මේ භව පිරිසිඳ දැනීම පිණිස මේ මගම යි, මේ පිළිවෙත යි. ඇවැත්නි, මේ භව පිරිසිඳ දැනීම පිණිස සොඳුරු මගෙකි, සොඳුරු පිළිවෙතෙකි. ඇවැත්නි, ශාරීපුත්‍රයෙනි, නො පමා වීමට සුදුසු යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 14.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුක්‌ඛ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "329. ඇවැත්නි ශාරීපුත්‍රයෙනි, දුක දුකැ යි කියනු ලැබේ. ඇවැත්නි දුඛ කවරේ දැ යි. ඇවැත්නි, මේ දුක්බැව් තුනෙකි. දුක්ඛදුක්බව ය, සඞ්ඛාරදුක්බව ය, විපරිණාමදුක්බව ය යි. ඇවැත්නි, මේ දුක් බැව් තුන යි. ඇවැත්නි, මේ දුක් බැව් පිරිසිඳ දැනීම පිණිස මගෙක් ඇත් ද, පිළිවෙතෙක් ඇත්දැ යි. ඇවැත්නි, මේ දුක්බැව් පිරිසිඳ දැනීම පිණිස මගෙක් ඇත, පිළිවෙතෙක් ඇතැ යි. ඇවැත්නි, මේ දුක්බැව් පිරිසිඳ දැනීම පිණිස මග කවරේ ද, පිළිවෙත කවරේදැ යි. ඇවැත්නි, මේ දුක්බැව් පිරිසිඳ දැනීම පිණිස මේ අරීඅටඟිමඟ ම ය. එනම්: සම්මාදිට්ඨිය … සම්මාසමාධිය යි. ඇවැත්නි, මේ දුක්බැව් පිරිසිඳ දැනීම පිණිස මේ මඟ යි, මේ පිළිවෙත යි. ඇවැත්නි, මේ දුක්බැව් පිරිසිඳ දැනීම පිණිස සොඳුරු මගෙකි, සොඳුරු පිළිවෙතෙකි. ඇවැත්නි, ශාරීපුත්‍රයෙනි, නො පමා වීමට සුදුසු යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 15.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සක්‌කාය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "330. ඇවැත්නි, ශාරීපුත්‍රයෙනි, සත්කාය සත්කාය යි කියනු ලැබේ. ඇවැත්නි, සත්කාය කවරේ දැ යි. ඇවැත්නි, මේ උපාදානස්කන්ධ පස සත්කාය යි භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදී. එනම්: රූපූපාදානස්කන්ධය, වේදනූපාදානස්කන්ධය, සඤ්ඤූපාදානස්කන්ධය, සඞ්ඛාරූපාදානස්කන්ධය, විඤ්ඤාණූපාදානස්කන්ධය යි. ඇවැත්නි, මේ උපාදානස්කන්ධ පස සත්කාය ය යි භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේ යි. ඇවැත්නි, මේ සත්කාය පිරිසිඳ දැනීම පිණිස මගෙක් ඇද්ද, පිළිවෙතක් ඇද්දැ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 486,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අත්ථි ඛො ආවුසො මග්ගො අත්ථි පටිපදා එතස්ස සක්කායස්ස පරිඤ්ඤායාති. කතමො පනාවුසො මග්ගො කතමා පටිපදා එතස්ස සක්කායස්ස පරිඤ්ඤායාති. අයමෙව ඛො ආවුසො අරියො අට්ඨඞ්ගිකො මග්ගො එතස්ස සක්කායස්ස පරිඤ්ඤාය, සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. අයං ඛො ආවුසො මග්ගො අයං පටිපදා එතස්ස සක්කායස්ස පරිඤ්ඤායාති. භද්දකො ආවුසො මග්ගො භද්දිකා පටිපදා එතස්ස සක්කායස්ස පරිඤ්ඤාය. අලඤ්ච පනාවුසො සාරිපුත්ත අප්පමාදායාති."
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 16.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුක්කරසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "331. කින්නු ඛො ආවුසො සාරිපුත්ත ඉමස්මිං ධම්මවිනයෙ දුක්කරන්ති. පබ්බජ්ජා ඛො ආවුසො ඉමස්මිං ධම්මවිනයෙ දුක්කරාති. පබ්බජිතෙන පනාවුසො කිං දුක්කරන්ති. පබ්බජිතෙන ඛො ආවුසො අභිරති දුක්කරාති. අභිරතෙන පන ආවුසො කිං දුක්කරන්ති. අභිරතෙන ඛො ආවුසො ධම්මානුධම්මපටිපත්ති දුක්කරාති. කීව චිරං පනාවුසො ධම්මානුධම්මපටිපන්නො භික්ඛු අරහං අස්සාති. න චිරං ආවුසොති."
                    },
                    {
                        "type": "centered",
                        "text": "ජම්බුඛාදකසංයුත්තං සමත්තං.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රැද්දානං:–**"
                    },
                    {
                        "type": "gatha",
                        "text": "නිබ්බානං අරහත්තඤ්ච ධම්මවාදී කිමත්ථියං\nඅස්සාසො පරමස්සාසො වෙදනා ආසවො තථා,\nඅවිජ්ජා තණ්හා ඔඝොච උපාදානං භවොපිච\nදුක්ඛඤ්චෙව සක්කායො දුක්කරඤ්චෙති සොළස."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "ඇවැත්නි, මේ සත්කාය පිරිසිඳ දැනීම පිණිස මගෙක් ඇත. පිළිවෙතෙක් ඇතැ යි. ඇවැත්නි, මේ සත්කාය පිරිසිඳ දැනීම පිණිස මග කවරේද, පිළිවෙත කවරේ දැ යි. ඇවැත්නි, මේ සත්කාය පිරිසිඳ දැනීම පිණිස මේ අරීඅටඟි මග ම ය. එනම්: සම්මාදිට්ඨිය … සම්මාසමාධිය යි. ඇවැත්නි, මේ සත්කාය පිරිසිඳ දැනීම පිණිස මේ මඟ යි. මේ පිළිවෙත යි. ඇවැත්නි, මේ සත්කාය පිරිසිඳ දැනීම පිණිස සොඳුරු මගෙකි. සොඳුරු පිළිවෙතෙකි. ඇවැත්නි ශාරීපුත්‍රයෙනි, නො පමා වීමට සුදුසු යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "4. 1. 16.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුක්‌කර සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "331. ඇවැත්නි ශාරීපුත්‍රයෙනි, මෙ සස්නෙහි කුමක් දුෂ්කර දැ යි. ඇවැත්නි, මේ සස්නෙහි පැවිද්ද දුෂ්කර ය. ඇවැත්නි පැවිද්දා විසින් කුමක් දුෂ්කරදැ යි. ඇවැත්නි පැවිද්දා විසින් (පැවිද්දෙහි) ඇල්ම දුෂ්කරය. ඇවැත්නි (පැවිද්දෙහි) ඇලුනහු විසින් කුමක් දුෂ්කර දැ යි. ඇවැත්නි, (පැවිද්දෙහි) ඇලුනහු විසින් ධර්මානුධර්ම ප්‍රතිපත්තිය දුෂ්කර ය. ඇවැත්නි ධර්මානුධර්මප්‍රතිපන්න මහණ කොපමණ කලකින් රහත් වන්නේ දැ යි. ඇවැත්නි නොබෝ කලකිනි යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ජම්බුඛාදක සංයුත්තය නිමියේ යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි සූත්‍රනාමාවලිය:**",
                        "type": "unindented"
                    },
                    {
                        "text": "නිබ්බාන, අරහත්ත, ධම්මවාදි, කිම්ත්ථිය, අස්සාස, පරමස්සාස, වෙදනා, ආසව, එසේම අවිජ්ජා, තණ්හා, ඔඝ, උපාදාන, භව, දුක්ඛ, සක්කාය, දුක්කර යයි සුත්‍ර සොළොසෙකි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        }
    ]
}