[
    {
        "filename": "sn-slyv-6",
        "bookId": 19,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "490"
            },
            {
                "type": "heading",
                "text": "6. මොග්ගල්ලානසංයුත්තං",
                "level": 3
            },
            {
                "type": "centered",
                "text": "6. 1. 1",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සවිතක්කසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "348. එකං සමයං ආයස්මා මහාමොග්ගල්ලානො සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තත්ර ඛො ආයස්මා මහාමොග්ගල්ලානො භික්ඛූ ආමන්තෙසි “ආවුසො භික්ඛවො”ති. “ආවුසොති” ඛො තෙ භික්ඛූ ආයස්මතො මහාමොග්ගල්ලානස්ස පච්චස්සොසුං. ආයස්මා මහාමොග්ගල්ලානො{1 මහාමොග්ගල්ලානො තෙ භික්ඛු - ස්යා.} එතදවොච: ඉධ මය්හං ආවුසො රහොගතස්ස පතිසල්ලීනස්ස එවං චෙතසො පරිවිතක්කො උදපාදි: ‘පඨමං ඣානං පඨමං ඣානන්’ති වුච්චති. කතමන්නු ඛො පඨමං ඣානන්ති. තස්ස මය්හං ආවුසො එතදහොසි: ඉධ භික්ඛු විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහරති. ඉදං වුච්චති පඨමං ඣානන්ති. සො ඛ්වාහං ආවුසො විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහරාමි. තස්ස මය්හං ආවුසො ඉමිනා විහාරෙන විහරතො කාමසහගතා සඤ්ඤාමනසිකාරා සමුදාචරන්ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො මං ආවුසො භගවා ඉද්ධියා උපසඞ්කමිත්වා එතදවොච: මොග්ගල්ලාන, මොග්ගල්ලාන, මා බ්රාහ්මණ, පඨමං ඣානං පමාදො, පඨමෙ ඣානෙ චිත්තං සණ්ඨපෙහි, පඨමෙ ඣානෙ චිත්තං එකොදිං{2 එකොදි - සී 1, 2. PTS.} කරොහි, පඨමෙ ඣානෙ චිත්තං සමාදහාති. සො ඛ්වාහං ආවුසො අපරෙන සමයෙන විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහාසිං. යං හි තං ආවුසො සම්මාවදමානො වදෙය්ය: “සත්ථාරානුග්ගහිතො සාවකො මහාභිඤ්ඤතං පත්තො”ති, මමන්තං සම්මාවදමානො වදෙය්ය, “සත්ථාරානුග්ගහිතො සාවකො මහාභිඤ්ඤතං පත්තො”ති."
            },
            {
                "type": "page-break",
                "text": "492"
            },
            {
                "type": "centered",
                "text": "6. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අවිතක්කසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "349. දුතියං ඣානං දුතියං ඣානන්ති වුච්චති. කතමං නු ඛො දුතියං ඣානන්ති. තස්ස මය්හං ආවුසො එතදහොසි: ඉධ භික්ඛු විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියං ඣානං උපසම්පජ්ජ විහරති. ඉදං වුච්චති දුතියං ඣානන්ති. සො ඛ්වාහං ආවුසො විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියං ඣානං උපසම්පජ්ජ විහරාමි. තස්ස මය්හං ආවුසො ඉමිනා විහාරෙන විහරතො විතක්කසහගතා සඤ්ඤාමනසිකාරා සමුදාචරන්ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො මං ආවුසො භගවා ඉද්ධියා උපසඞ්කමිත්වා එතදවොච: මොග්ගල්ලාන, මොග්ගල්ලාන, මා බ්රාහ්මණ, දුතියං ඣානං පමාදො, දුතියෙ ඣානෙ චිත්තං සණ්ඨපෙහි, දුතියෙ ඣානෙ චිත්තං එකොදිං කරොහි, දුතියෙ ඣානෙ චිත්තං සමාදහාති. සො ඛ්වාහං ආවුසො අපරෙන සමයෙන විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියං ඣානං උපසම්පජ්ජ විහාසිං. යං හි තං ආවුසො සම්මා වදමානො වදෙය්ය: සත්ථාරානුග්ගහිතො සාවකො මහාභිඤ්ඤතං පත්තොති, මමං තං සම්මා වදමානො වදෙය්ය සත්ථාරානුග්ගහිතො සාවකො මහාභිඤ්ඤතං පත්තොති."
            },
            {
                "type": "centered",
                "text": "6. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුඛසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "350. තතියං ඣානං තතියං ඣානන්ති වුච්චති. කතමං නු ඛො තතියං ඣානන්ති. තස්ස මය්හං ආවුසො එතදහොසි: ඉධ භික්ඛු පීතියා ච විරාගා උපෙඛකො විහරති, සතො ච සම්පජානො සුඛඤ්ච කායෙන පටිසංවෙදෙති, යන්තං අරියා ආචික්ඛන්ති උපෙඛකො සතිමා සුඛවිහාරීති. තං තතියං ඣානං උපසම්පජ්ජ විහරති. ඉදං වුච්චති තතියං ඣානන්ති. සො ඛ්වාහං ආවුසො පීතියා ච විරාගා උපෙඛකො ච විහරාමි, සතො ච සම්පජානො සුඛඤ්ච කායෙන පටිසංවෙදෙමි. යන්තං අරියා ආචික්ඛන්ති උපෙඛකො සතිමා සුඛවිහාරීති තං තතියං ඣානං උපසම්පජ්ජ විහරාමි. තස්ස මය්හං ආවුසො ඉමිනා විහාරෙන විහරතො පීතිසහගතා සඤ්ඤාමනසිකාරා සමුදාචරන්ති."
            },
            {
                "type": "page-break",
                "text": "494"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො මං ආවුසො භගවා ඉද්ධියා උපසඞ්කමිත්වා එතදවොච: මොග්ගල්ලාන, මොග්ගල්ලාන, මා බ්රාහ්මණ, තතියං ඣානං පමාදො, තතියෙ ඣානෙ චිත්තං සණ්ඨපෙහි, තතියෙ ඣානෙ චිත්තං එකොදිං කරොහි තතියෙ ඣානෙ චිත්තං සමාදහාති. සො ඛ්වාහං ආවුසො අපරෙන සමයෙන පීතියා ච විරාගා උපෙඛකො ච විහාසිං{1 විහරාමි - ස්යා.} සතො ච සම්පජානො සුඛඤ්ච කායෙන පටිසංවෙදෙසිං{2 වෙදෙමි - ස්යා, මඡසං.}. යන්තං අරියා ආචික්ඛන්ති උපෙඛකො සතිමා සුඛවිහාරීති තං තතියං ඣානං උපසම්පජ්ජ විහාසිං. යං හි තං ආවුසො සම්මාවදමානො වදෙය්ය සත්ථාරානුග්ගහිතො සාවකො මහාභිඤ්ඤතං පත්තොති. මමං තං සම්මා වදමානො වදෙය්ය සත්ථාරානුග්ගහිතො සාවකො මහාභිඤ්ඤතං පත්තොති."
            },
            {
                "type": "centered",
                "text": "6. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "උපෙඛාසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "351. චතුත්ථංඣානං චතුත්ථංඣානන්ති වුච්චති. කතමං නු ඛො චතුත්ථංඣානන්ති. තස්ස මය්හං ආවුසො එතදහොසි: ඉධ භික්ඛු සුඛස්ස ච පහානා දුක්ඛස්ස ච පහානා පුබ්බෙව සොමනස්සදොමනස්සානං අත්ථගමා අදුක්ඛං අසුඛං උපෙක්ඛාසතිපාරිසුද්ධිං චතුත්ථං ඣානං උපසම්පජ්ජ විහරති. ඉදං වුච්චති චතුත්ථංඣානන්ති. සො ඛ්වාහං ආවුසො සුඛස්ස ච පහානා දුක්ඛස්ස ච පහානා පුබ්බෙව සොමනස්සදොමනස්සානං අත්ථගමා අදුක්ඛං අසුඛං උපෙක්ඛාසතිපාරිසුද්ධිං චතුත්ථං ඣානං උපසම්පජ්ජ විහරාමි. තස්ස මය්හං ආවුසො ඉමිනා විහාරෙන විහරතො උපෙක්ඛාසහගතා සඤ්ඤාමනසිකාරා සමුදාචරන්ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො මං ආවුසො භගවා ඉද්ධියා උපසඞ්කමිත්වා එතදවොච: මොග්ගල්ලාන, මොග්ගල්ලාන, මා බ්රාහ්මණ, චතුත්ථං ඣානං පමාදො, චතුත්ථෙ ඣානෙ චිත්තං සණ්ඨපෙහි, චතුත්ථෙ ඣානෙ චිත්තං එකොදිං{3 එකොදි - ලි.} කරොහි, චතුත්ථෙ ඣානෙ චිත්තං සමාදහාති. සො ඛ්වාහං ආවුසො අපරෙන සමයෙන සුඛස්ස ච පහානා දුක්ඛස්ස ච පහානා පුබ්බෙව සොමනස්සදොමනස්සානං අත්ථගමා අදුක්ඛං අසුඛං උපෙක්ඛාසතිපාරිසුද්ධිං චතුත්ථං ඣානං උපසම්පජ්ජ විහාසිං. යං හි තං ආවුසො සම්මාවදමානො වදෙය්ය සත්ථාරානුග්ගහිතො සාවකො මහාභිඤ්ඤතං පත්තොති. මමං තං සම්මා වදමානො වදෙය්ය සත්ථාරානුග්ගහිතො සාවකො මහාභිඤ්ඤතං පත්තොති."
            },
            {
                "type": "page-break",
                "text": "496"
            },
            {
                "type": "centered",
                "text": "6. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආකාසානඤ්චායතනසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "352. ආකාසානඤ්චායතනං ආකාසානඤ්චායතනන්ති වුච්චති. කතමං නු ඛො ආකාසානඤ්චායතනන්ති. තස්ස මය්හං ආවුසො එතදහොසි. ඉධ භික්ඛු සබ්බසො රූපසඤ්ඤානං සමතික්කමා පටිඝසඤ්ඤානං අත්ථගමා නානත්තසඤ්ඤානං අමනසිකාරා අනන්තො ආකාසොති ආකාසානඤ්චායතනං උපසම්පජ්ජ විහරති. ඉදං වුච්චති ආකාසානඤ්චායතනන්ති. සො ඛ්වාහං ආවුසො සබ්බසො රූපසඤ්ඤානං සමතික්කමා පටිඝසඤ්ඤානං අත්ථගමා නානත්තසඤ්ඤානං අමනසිකාරා අනන්තො ආකාසොති ආකාසානඤ්චායතනං උපසම්පජ්ජ විහරාමි. තස්ස මය්හං ආවුසො ඉමිනා විහාරෙන විහරතො රූපසහගතා සඤ්ඤාමනසිකාරා සමුදාචරන්ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො මං ආවුසො භගවා ඉද්ධියා උපසංකමිත්වා එතදවොච: මොග්ගල්ලාන, මොග්ගල්ලාන, මා බ්රාහ්මණ, ආකාසානඤ්චායතනං පමාදො, ආකාසානඤ්චායතනෙ චිත්තං සණ්ඨපෙහි, ආකාසානඤ්චායතනෙ චිත්තං එකොදිං කරොහි, ආකාසානඤ්චායතනෙ චිත්තං සමාදහා ති. සො ඛ්වාහං ආවුසො අපරෙන සමයෙන සබ්බසො රූපසඤ්ඤානං සමතික්කමා පටිඝසඤ්ඤානං අත්ථගමා නානත්තසඤ්ඤානං අමනසිකාරා අනන්තො ආකාසොති ආකාසානඤ්චායතනං උපසම්පජ්ජ විහාසිං. යං හි තං ආවුසො සම්මා වදමානො වදෙය්ය -පෙ- මහාභිඤ්ඤතං පත්තොති."
            },
            {
                "type": "centered",
                "text": "6. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "විඤ්ඤාණඤ්චායතනසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "353. විඤ්ඤාණඤ්චායතනං විඤ්ඤාණඤ්චායතනන්ති වුච්චති. කතමං නු ඛො විඤ්ඤාණඤ්චායතනන්ති. තස්ස මය්හං ආවුසො එතදහොසි: ඉධ භික්ඛු සබ්බසො ආකාසානඤ්චායතනං සමතික්කම්ම අනන්තං විඤ්ඤාණන්ති විඤ්ඤාණඤ්චායතනං උපසම්පජ්ජ විහරති. ඉදං වුච්චති විඤ්ඤාණඤ්චායතනන්ති. සො ඛ්වාහං ආවුසො සබ්බසො ආකාසානඤ්චායතනං සමතික්කම්ම අනන්තං විඤ්ඤාණන්ති විඤ්ඤාණඤ්චායතනං උපසම්පජ්ජ විහරාමි. තස්ස මය්හං ආවුසො ඉමිනා විහාරෙන විහරතො ආකාසානඤ්චායතනසහගතා සඤ්ඤාමනසිකාරා සමුදාචරන්ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො මං ආවුසො භගවා ඉද්ධියා උපසංකමිත්වා එතදවොච: මොග්ගල්ලාන, මොග්ගල්ලාන, මා බ්රාහ්මණ, විඤ්ඤාණඤ්චායතනං පමාදො, විඤ්ඤාණඤ්චායතනෙ චිත්තං සණ්ඨපෙහි, විඤ්ඤාණඤ්චායතනෙ චිත්තං එකොදිං කරොහි, විඤ්ඤාණඤ්චායතනෙ චිත්තං සමාදහාති. සො ඛ්වාහං ආවුසො අපරෙන සමයෙන සබ්බසො ආකාසානඤ්චායතනං සමතික්කම්ම අනන්තං විඤ්ඤාණන්ති විඤ්ඤාණඤ්චායතනං උපසම්පජ්ජ විහාසිං. යං හි තං ආවුසො සම්මාවදමානො වදෙය්ය -පෙ-මහාභිඤ්ඤතං පත්තොති."
            },
            {
                "type": "page-break",
                "text": "498"
            },
            {
                "type": "centered",
                "text": "6. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආකිඤ්චඤ්ඤායතනසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "354. ආකිඤ්චඤ්ඤායතනං ආකිඤ්චඤ්ඤායතනන්ති වුච්චති. කතමං නු ඛො ආකිඤ්චඤ්ඤායතනන්ති. තස්ස මය්හං ආවුසො එතදහොසි: ඉධ භික්ඛු සබ්බසො විඤ්ඤාණඤ්චායතනං සමතික්කම්ම නත්ථි කිඤ්චීති ආකිඤ්චඤ්ඤායතනං උපසම්පජ්ජ විහරති. ඉදං වුච්චති ආකිඤ්චඤ්ඤායතනන්ති. සො ඛ්වාහං ආවුසො සබ්බසො විඤ්ඤාණඤ්චායතනං සමතික්කම්ම නත්ථි කිඤ්චීති ආකිඤ්චඤ්ඤායතනං උපසම්පජ්ජ විහරාමි. තස්ස මය්හං ආවුසො ඉමිනා විහාරෙන විහරතො විඤ්ඤාණඤ්චායතනසහගතා සඤ්ඤාමනසිකාරා සමුදාචරන්ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො මං ආවුසො භගවා ඉද්ධියා උපසඞ්කමිත්වා එතදවොච: මොග්ගල්ලාන, මොග්ගල්ලාන, මා බ්රාහ්මණ, ආකිඤ්චඤ්ඤායතනෙ පමාදො, ආකිඤ්චඤ්ඤායතනෙ චිත්තං සණ්ඨපෙහි, ආකිඤ්චඤ්ඤායතනෙ චිත්තං එකොදිං කරොහි, ආකිඤ්චඤ්ඤායතනෙ චිත්තං සමාදහාති. සො ඛ්වාහං ආවුසො අපරෙන සමයෙන සබ්බසො විඤ්ඤාණඤ්චායතනං සමතික්කම්ම නත්ථි කිඤ්චීති ආකිඤ්චඤ්ඤායතනං උපසම්පජ්ජ විහාසිං. යං හි තං ආවුසො සම්මා වදමානො වදෙය්ය -පෙ- මහාභිඤ්ඤතං පත්තොති."
            },
            {
                "type": "centered",
                "text": "6. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නෙවසඤ්ඤානාසඤ්ඤායතනසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "355. නෙවසඤ්ඤානාසඤ්ඤායතනං නෙවසඤ්ඤානාසඤ්ඤායතනන්ති වුච්චති. කතමං නු ඛො නෙවසඤ්ඤානාසඤ්ඤායතනන්ති. තස්ස මය්හං ආවුසො එතදහොසි: ඉධ භික්ඛු සබ්බසො ආකිඤ්චඤ්ඤායතනං සමතික්කම්ම නෙවසඤ්ඤානාසඤ්ඤායතනං උපසම්පජ්ජ විහරති. ඉදං වුච්චති නෙවසඤ්ඤානාසඤ්ඤායතනන්ති. සො ඛ්වාහං ආවුසො සබ්බසො ආකිඤ්චඤ්ඤායතනං සමතික්කම්ම නෙවසඤ්ඤානාසඤ්ඤායතනං උපසම්පජ්ජ විහරාමි. තස්ස මය්හං ආවුසො ඉමිනා විහාරෙන විහරතො ආකිඤ්චඤ්ඤායතනසහගතා සඤ්ඤාමනසිකාරා සමුදාචරන්ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො මං ආවුසො භගවා ඉද්ධියා උපසඞ්කමිත්වා එතදවොච: මොග්ගල්ලාන, මොග්ගල්ලාන, මා බ්රාහ්මණ, නෙවසඤ්ඤානාසඤ්ඤායතනං පමාදො, නෙවසඤ්ඤානාසඤ්ඤායතනෙ චිත්තං සණ්ඨපෙහි, නෙවසඤ්ඤානාසඤ්ඤායතනෙ චිත්තං එකොදිං කරොහි, නෙවසඤ්ඤානාසඤ්ඤායතනෙ චිත්තං සමාදහාති. සො ඛ්වාහං ආවුසො අපරෙන සමයෙන සබ්බසො ආකිඤ්චඤ්ඤායතනං සමතික්කම්ම නෙවසඤ්ඤානාසඤ්ඤායතනං උපසම්පජ්ජ විහාසිං. යං හි තං ආවුසො සම්මා වදමානො වදෙය්ය -පෙ-මහාභිඤ්ඤතං පත්තොති."
            },
            {
                "type": "page-break",
                "text": "500"
            },
            {
                "type": "centered",
                "text": "6. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනිමිත්තසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "356. අනිමිත්තො චෙතොසමාධි අනිමිත්තො චෙතොසමාධීති වුච්චති. කතමො නු ඛො අනිමිත්තො චෙතොසමාධීති. තස්ස මය්හං ආවුසො එතදහොසි: ‘ඉධ භික්ඛු සබ්බනිමිත්තානං අමනසිකාරා අනිමිත්තං චෙතොසමාධිං උපසම්පජ්ජ විහරති. අයං වුච්චති අනිමිත්තො චෙතොසමාධී’ති. සො ඛ්වාහං ආවුසො සබ්බනිමිත්තානං අමනසිකාරා අනිමිත්තං චෙතොසමාධිං උපසම්පජ්ජ විහරාමි. තස්ස මය්හං ආවුසො ඉමිනා විහාරෙන විහරතො නිමිත්තානුසාරි{1 අනිමිත්තානුසාරී - සීමු, සී, 1. 2, ස්යා.} විඤ්ඤාණං හොති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො මං ආවුසො භගවා ඉද්ධියා උපසඞ්කමිත්වා එතදවොච: මොග්ගල්ලාන මොග්ගල්ලාන, මා බ්රාහ්මණ, අනිමිත්තං චෙතොසමාධිං පමාදො, අනිමිත්තෙ චෙතොසමාධිස්මිං චිත්තං සණ්ඨපෙහි, අනිමිත්තෙ චෙතොසමාධිස්මිං චිත්තං එකොදිං කරොහි, අනිමිත්තෙ චෙතොසමාධිස්මිං චිත්තං සමාදහාති. සො ඛ්වාහං ආවුසො අපරෙන සමයෙන සබ්බනිමිත්තානං අමනසිකාරා අනිමිත්තං චෙතොසමාධිං උපසම්පජ්ජ විහාසිං. යං හි තං ආවුසො, සම්මා වදමානො වදෙය්ය සත්ථාරානුග්ගහිතො සාවකො මහාභිඤ්ඤතං පත්තොති, මමං තං සම්මා වදමානො වදෙය්ය සත්ථාරානුග්ගහිතො සාවකො මහාභිඤ්ඤතං පත්තොති."
            },
            {
                "type": "centered",
                "text": "6. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සක්කසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "357. එකං සමයං ආයස්මා මහාමොග්ගල්ලානො සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. අථ ඛො ආයස්මා මහා මොග්ගල්ලානො සෙය්යථාපි නාම බලවා පුරිසො සමිඤ්ජිතං වා බාහං පසාරෙය්ය පසාරිතං වා බාහං සමිඤ්ජෙය්ය, එවමෙව ජෙතවනෙ අන්තරහිතො දෙවෙසු තාවතිංසෙසු පාතුරහොසි. අථ ඛො සක්කො දෙවානමින්දො පඤ්චහි දෙවතාසතෙහි සද්ධිං යෙනායස්මා මහාමොග්ගල්ලානො තෙනුපසඞ්කමි, උපසඞ්කමිත්වා ආයස්මන්තං මහාමොග්ගල්ලානං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතං ඛො සක්කං දෙවානමින්දං ආයස්මා මහාමොග්ගල්ලානො එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො දෙවානමින්ද බුද්ධං සරණගමනං හොති. බුද්ධං සරණගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. සාධු ඛො දෙවානමින්ද ධම්මං සරණගමනං හොති. ධම්මං සරණගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. සාධු ඛො දෙවානමින්ද සඞ්ඝං සරණගමනං හොති. සඞ්ඝං සරණගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්තීති."
            },
            {
                "type": "page-break",
                "text": "502"
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො මාරිස මොග්ගල්ලාන බුද්ධං සරණගමනං හොති. බුද්ධං සරණගමන හෙතු ඛො මාරිස මොග්ගල්ලාන, එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. සාධු ඛො මාරිස මොග්ගල්ලාන, ධම්මං සරණගමනං හොති. ධම්මං සරණගමනහෙතු ඛො මාරිස මොග්ගල්ලාන, එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. සාධු ඛො මාරිස මොග්ගල්ලාන සඞ්ඝං සරණගමනහෙතු ඛො මොග්ගල්ලාන එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති."
            },
            {
                "type": "centered",
                "text": "6. 1. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතියසක්කසූත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "358. අථ ඛො සක්කො දෙවානමින්දො ඡහි දෙවතාසතෙහි සද්ධිං -පෙ- අථ ඛො සක්කො දෙවානමින්දො සත්තහි දෙවතාසතෙහි සද්ධිං -පෙ- අථ ඛො සක්කො දෙවානමින්දො අට්ඨහි දෙවතාසතෙහි සද්ධිං -පෙ- අථ ඛො සක්කො දෙවානමින්දො අසීතියා දෙවතාසහස්සෙහි සද්ධිං යෙනායස්මා මහාමොග්ගල්ලානො තෙනුපසඞ්කමි, උපසඞ්කමිත්වා ආයස්මන්තං මහාමොග්ගල්ලානං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතං ඛො සක්කං දෙවානමින්දං ආයස්මා මහාමොග්ගල්ලානො එතදවොච: සාධු ඛො දෙවානමින්ද බුද්ධං සරණගමනං හොති. බුද්ධං සරණගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. සාධු ඛො දෙවානමින්ද ධම්මං සරණගමනං හොති -පෙ- සාධු ඛො දෙවානමින්ද සඞ්ඝං සරණගමනං හොති. සඞ්ඝං සරණගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්තීති."
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො මාරිස මොග්ගල්ලාන බුද්ධං සරණගමනං හොති. බුද්ධං සරණගමනහෙතු ඛො මාරිස මොග්ගල්ලාන එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. සාධු ඛො මාරිස මොග්ගල්ලාන ධම්මසරණගමනං හොති -පෙ- සාධු ඛො මාරිස මොග්ගල්ලාන සඞ්ඝං සරණගමනං හොති. සඞ්ඝං සරණගමනහෙතු ඛො මාරිස මොග්ගල්ලාන එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්තීති."
            },
            {
                "type": "centered",
                "text": "6. 1. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තතියසක්කසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "359. අථ ඛො සක්කො දෙවානමින්දො පඤ්චහි දෙවතාසතෙහි සද්ධිං යෙනායස්මා මහාමොග්ගල්ලානො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මන්තං මහාමොග්ගල්ලානං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතං ඛො සක්කං දෙවානමින්දං ආයස්මා මහාමොග්ගල්ලානො එතදවොච: සාධු ඛො දෙවානමින්ද බුද්ධෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති ‘ඉතිපි සො භගවා අරහං සම්මාසම්බුද්ධො විජ්ජාචරණසම්පන්නො සුගතො ලොකවිදූ අනුත්තරො පුරිසදම්මසාරථි සත්ථා දෙවමනුස්සානං බුද්ධො භගවා’ති. බුද්ධෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති."
            },
            {
                "type": "page-break",
                "text": "504"
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො දෙවානමින්ද ධම්මෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති, ‘ස්වාක්ඛාතො භගවතා ධම්මො සන්දිට්ඨිකො අකාලිකො එහිපස්සිකො ඔපනයිකො පච්චත්තං වෙදිතබ්බො විඤ්ඤූහී’ති. ධම්මෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති."
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො දෙවානමින්ද සඞ්ඝෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති. ‘සුපටිපන්නො භගවතො සාවකසඞ්ඝො, උජුපටිපන්නො භගවතො සාවකසඞ්ඝො, ඤායපටිපන්නො භගවතො සාවකසඞ්ඝො සාමීචිපටිපන්නො භගවතො සාවකසඞ්ඝො, යදිදං චත්තාරි පුරිසයුගානි අට්ඨපුරිසපුග්ගලා, එස භගවතො සාවකසඞ්ඝො ආහුනෙය්යො පාහුනෙය්යො දක්ඛිණෙය්යො අඤ්ජලිකරණීයො අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්සා’ති. සඞ්ඝෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති."
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො දෙවානමින්ද අරියකන්තෙහි සීලෙහි සමන්නාගමනං හොති අඛණ්ඩෙහි අච්ඡිද්දෙහි අසබලෙහි අකම්මාසෙහි භුජිස්සෙහි විඤ්ඤුප්පසත්ථෙහි අපරාමට්ඨෙහි සමාධිසංවත්තනිකෙහි. අරියකන්තෙහි සීලෙහි සමන්නාගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්තීති."
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො මාරිස මොග්ගල්ලාන බුද්ධෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති, ‘ඉතිපි සො භගවා -පෙ- සත්ථා දෙවමනුස්සානං බුද්ධො භගවා’ති. බුද්ධෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො මාරිස මොග්ගල්ලාන, එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. සාධු ඛො මාරිස මොග්ගල්ලාන, ධම්මෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති, ‘ස්වාක්ඛාතො භගවතා ධම්මො -පෙ- පච්චත්තං වෙදිතබ්බො විඤ්ඤූහී’ති. ධම්මෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො මාරිස මොග්ගල්ලාන එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. සාධු ඛො මාරිස මොග්ගල්ලාන සඞ්ඝෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති, ‘සුපටිපන්නො භගවතො සාවකසඞ්ඝො -පෙ- අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්සා’ති. සඞ්ඝෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො මාරිස මොග්ගල්ලාන, එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. සාධු ඛො මාරිස මොග්ගල්ලාන, අරියකන්තෙහි සීලෙහි සමන්නාගමනං හොති අඛණ්ඩෙහි -පෙ- සමාධිසංවත්තනිකෙහි. අරියකන්තෙහි සීලෙහි සමන්නාගමනහෙතු ඛො මාරිස මොග්ගල්ලාන, එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්තීති."
            },
            {
                "type": "page-break",
                "text": "506"
            },
            {
                "type": "centered",
                "text": "6. 1. 13.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "චතුත්ථසක්කසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "360. අථ ඛො සක්කො දෙවානමින්දො ඡහි දෙවතාසතෙහි සද්ධිං -පෙ- අථ ඛො සක්කො දෙවානමින්දො සත්තහි දෙවතාසතෙහි සද්ධිං -පෙ- අථ ඛො සක්කො දෙවානමින්දො අට්ඨහි දෙවතාසතෙහි සද්ධිං -පෙ- අථ ඛො සක්කො දෙවානමින්දො අසීතියා දෙවතාසහස්සෙහි සද්ධිං යෙනායස්මා මහාමොග්ගල්ලානො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මන්තං මහාමොග්ගල්ලානං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතං ඛො සක්කං දෙවානමින්දං ආයස්මා මහාමොග්ගල්ලානො එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො දෙවානමින්ද බුද්ධෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති, ‘ඉතිපි සො භගවා -පෙ- සත්ථාදෙවමනුස්සානං බුද්ධො භගවා’ති. බුද්ධෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො දෙවානමින්ද, එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. සාධු ඛො දෙවානමින්ද ධම්මෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති, ‘ස්වාක්ඛාතො -පෙ- පච්චත්තං වෙදිතබ්බො විඤ්ඤූහී’ති. ධම්මෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. සාධු ඛො දෙවානමින්ද සඞ්ඝෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති, ‘සුපටිපන්නො භගවතො සාවකසඞ්ඝො -පෙ- අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්සා’ති. සඞ්ඝෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. සාධු ඛො දෙවානමින්ද අරියකන්තෙහි සීලෙහි සමන්නාගමනං හොති අඛණ්ඩෙහි -පෙ- සමාධිසංවත්තනිකෙහි. අරියකන්තෙහි සීලෙහි සමන්නාගමනහෙතු ඛො මාරිස මොග්ගල්ලාන එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්තීති."
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො මාරිස මොග්ගල්ලාන, බුද්ධෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති “ඉතිපි සො භගවා -පෙ- සත්ථා දෙවමනුස්සානං බුද්ධො භගවා”ති. බුද්ධෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො මාරිස මොග්ගල්ලාන එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. සාධු ඛො මාරිස මොග්ගල්ලාන ධම්මෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති. “ස්වාක්ඛාතො -පෙ- පච්චත්තං වෙදිතබ්බො විඤ්ඤූහී”ති. ධම්මෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො මාරිස මොග්ගල්ලාන එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. සාධු ඛො මාරිස මොග්ගල්ලාන සඞ්ඝෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති, “සුපටිපන්නො භගවතො සාවකසඞ්ඝො -පෙ- අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්සා”ති. සඞ්ඝෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො මාරිස මොග්ගල්ලාන, එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. සාධු ඛො මාරිස මොග්ගල්ලාන අරියකන්තෙහි සීලෙහි සමන්නාගමනං හොති අඛණ්ඩෙහි -පෙ- සමාධිසංවත්තනිකෙහි. අරියකන්තෙහි සීලෙහි සමන්නාගමනහෙතු ඛො මාරිස මොග්ගල්ලාන එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්තීති."
            },
            {
                "type": "page-break",
                "text": "508"
            },
            {
                "type": "centered",
                "text": "6. 1. 14.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පඤ්චමසක්කසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "361. අථ ඛො සක්කො දෙවානමින්දො පඤ්චහි දෙවතාසතෙහි සද්ධිං යෙනායස්මා මහාමොග්ගල්ලානො තෙනුපසඞ්කමි -පෙ- එකමන්තං ඨිතං ඛො සක්කං දෙවානමින්දං ආයස්මා මහාමොග්ගල්ලානො එතදවොච: සාධු ඛො දෙවානමින්ද බුද්ධං සරණගමනං හොති. බුද්ධං සරණගමනහෙතු ඛො දෙවානමින්ද, එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති: දිබ්බෙන ආයුනා, දිබ්බෙන වණ්ණෙන, දිබ්බෙන සුඛෙන, දිබ්බෙන යසෙන, දිබ්බෙන ආධිපතෙය්යෙන, දිබ්බෙහි රූපෙහි, දිබ්බෙහි සද්දෙහි, දිබ්බෙහි ගන්ධෙහි, දිබ්බෙහි රසෙහි, දිබ්බෙහි ඵොට්ඨබ්බෙහි."
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො දෙවානමින්ද ධම්මං සරණගමනං හොති. ධම්මං සරණගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති: දිබ්බෙන ආයුනා, දිබ්බෙන වණ්ණෙන, දිබ්බෙන සුඛෙන, දිබ්බෙන යසෙන, දිබ්බෙන ආධිපතෙය්යෙන, දිබ්බෙහි රූපෙහි, දිබ්බෙහි සද්දෙහි, දිබ්බෙහි ගන්ධෙහි, දිබ්බෙහි රසෙහි, දිබ්බෙහි ඵොට්ඨබ්බෙහි."
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො දෙවානමින්ද සඞ්ඝං සරණගමනං හොති. සඞ්ඝං සරණගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති: දිබ්බෙන ආයුනා, දිබ්බෙන වණ්ණෙන, දිබ්බෙන සුඛෙන, දිබ්බෙන යසෙන, දිබ්බෙන ආධිපතෙය්යෙන, දිබ්බෙහි රූපෙහි, දිබ්බෙහි සද්දෙහි, දිබ්බෙහි ගන්ධෙහි, දිබ්බෙහි රසෙහි, දිබ්බෙහි ඵොට්ඨබ්බෙහි."
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො මාරිස මොග්ගල්ලාන බුද්ධං සරණගමනං හොති. බුද්ධං සරණගමනහෙතු ඛො මාරිස මොග්ගල්ලාන එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති: දිබ්බෙන ආයුනා -පෙ- දිබ්බෙහි ඵොට්ඨබ්බෙහි. සාධු ඛො මාරිස මොග්ගල්ලාන ධම්මං සරණගමනං හොති -පෙ- සාධු ඛො මාරිස සඞ්ඝං සරණගමනං හොති. සඞ්ඝං සරණගමනහෙතු ඛො මාරිස මොග්ගල්ලාන එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති: දිබ්බෙන ආයුනා, දිබ්බෙන වණ්ණෙන, දිබ්බෙන සුඛෙන, දිබ්බෙන යසෙන, දිබ්බෙන ආධිපතෙය්යෙන, දිබ්බෙහි රූපෙහි, දිබ්බෙහි සද්දෙහි, දිබ්බෙහි ගන්ධෙහි, දිබ්බෙහි රසෙහි, දිබ්බෙහි ඵොට්ඨබ්බෙහීති."
            },
            {
                "type": "page-break",
                "text": "510"
            },
            {
                "type": "centered",
                "text": "6. 1. 15.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඡට්ඨසක්කසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "362. අථ ඛො සක්කො දෙවානමින්දො ඡහි දෙවතාසතෙහි සද්ධිං -පෙ- අථ ඛො සක්කො දෙවානමින්දො සත්තහි දෙවතාසතෙහි සද්ධිං -පෙ- අථ ඛො සක්කො දෙවානමින්දො අට්ඨහි දෙවතාසතෙහි සද්ධිං -පෙ- අථ ඛො සක්කො දෙවානමින්දො අසීතියා දෙවතාසහස්සෙහි සද්ධිං යෙනායස්මා මහාමොග්ගල්ලානො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මන්තං මහාමොග්ගල්ලානං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතං ඛො සක්කං දෙවානමින්දං ආයස්මා මහාමොග්ගල්ලානො එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො දෙවානමින්ද බුද්ධං සරණගමනං හොති. බුද්ධං සරණගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති: දිබ්බෙන ආයුනා -පෙ- දිබ්බෙහි ඵොට්ඨබ්බෙහි. සාධු ඛො දෙවානමින්ද ධම්මං සරණගමනං හොති -පෙ- සාධු ඛො දෙවානමින්ද සඞ්ඝං සරණගමනං හොති. සඞ්ඝං සරණගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති දිබ්බෙන ආයුනා, දිබ්බෙන වණ්ණෙන, දිබ්බෙන සුඛෙන, දිබ්බෙන යසෙන, දිබ්බෙන ආධිපතෙය්යෙන, දිබ්බෙහි රූපෙහි, දිබ්බෙහි සද්දෙහි, දිබ්බෙහි ගන්ධෙහි, දිබ්බෙහි රසෙහි, දිබ්බෙහි ඵොට්ඨබ්බෙහි."
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො මාරිස මොග්ගල්ලාන බුද්ධං සරණගමනං හොති -පෙ- සාධු ඛො මාරිස මොග්ගල්ලාන ධම්මං සරණගමනං හොති -පෙ- සාධු ඛො මාරිස මොග්ගල්ලාන සඞ්ඝං සරණගමනං හොති. සඞ්ඝං සරණගමනහෙතු ඛො මාරිස මොග්ගල්ලාන එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති. දිබ්බෙන ආයුනා, දිබ්බෙන වණ්ණෙන, දිබ්බෙන සුඛෙන, දිබ්බෙන යසෙන, දිබ්බෙන ආධිපතෙය්යෙන, දිබ්බෙහි රූපෙහි, දිබ්බෙහි සද්දෙහි, දිබ්බෙහි ගන්ධෙහි, දිබ්බෙහි රසෙහි, දිබ්බෙහි ඵොට්ඨබ්බෙහි."
            },
            {
                "type": "centered",
                "text": "6. 1. 16.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සත්තමසක්කසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "363. අථ ඛො සක්කො දෙවානමින්දො පඤ්චහි දෙවතාසතෙහි සද්ධිං යෙනායස්මා මහාමොග්ගල්ලානො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මන්තං මහාමොග්ගල්ලානං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතං ඛො සක්කං දෙවානමින්දං ආයස්මා මහාමොග්ගල්ලානො එතදවොච:"
            },
            {
                "type": "page-break",
                "text": "512"
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො දෙවානමින්ද බුද්ධෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති “ඉතිපි සො භගවා -පෙ- සත්ථා දෙවමනුස්සානං බුද්ධො භගවා”ති. බුද්ධෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති, දිබ්බෙන ආයුනා -පෙ- දිබ්බෙහි ඵොට්ඨබ්බෙහි. සාධු ඛො දෙවානමින්ද ධම්මෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති -පෙ- සාධු ඛො දෙවානමින්ද සඞ්ඝෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො දෙවානමින්ද අරියකන්තෙහි සීලෙහි සමන්නාගමනං හොති අඛණ්ඩෙහි -පෙ- සමාධිසංවත්තනිකෙහි. අරියකන්තෙහි සීලෙහි සමන්නාගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති. දිබ්බෙන ආයුනා, දිබ්බෙන වණ්ණෙන, දිබ්බෙන සුඛෙන, දිබ්බෙන යසෙන, දිබ්බෙන ආධිපතෙය්යෙන, දිබ්බෙහි රූපෙහි, දිබ්බෙහි සද්දෙහි, දිබ්බෙහි ගන්ධෙහි, දිබ්බෙහි රසෙහි, දිබ්බෙහි ඵොට්ඨබ්බෙහීති."
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො මාරිස මොග්ගල්ලාන බුද්ධෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති, “ඉතිපි සො භගවා -පෙ- සත්ථා දෙවමනුස්සානං බුද්ධො භගවා”ති. බුද්ධෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො මාරිස මොග්ගල්ලාන එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති දිබ්බෙන ආයුනා -පෙ- දිබ්බෙහි ඵොට්ඨබ්බෙහි."
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො මාරිස මොග්ගල්ලාන ධම්මෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති “ස්වාක්ඛාතො භගවතා ධම්මො -පෙ- පච්චත්තං වෙදිතබ්බො විඤ්ඤූහී”ති. ධම්මෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො මාරිස මොග්ගල්ලාන, එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති දිබ්බෙන ආයුනා -පෙ- දිබ්බෙහි ඵොට්ඨබ්බෙහි."
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො මාරිස මොග්ගල්ලාන, සඞ්ඝෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති “සුපටිපන්නො භගවතො සාවකසඞ්ඝො -පෙ- ලොකස්සා”ති. සඞ්ඝෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො මාරිස මොග්ගල්ලාන, එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති දිබ්බෙන ආයුනා -පෙ- දිබ්බෙහි ඵොට්ඨබ්බෙහි."
            },
            {
                "type": "page-break",
                "text": "514"
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො මාරිස මොග්ගල්ලාන අරියකන්තෙහි සීලෙහි සමන්නාගමනං හොති, අඛණ්ඩෙහි -පෙ- සමාධිසංවත්තනිකෙහි. අරියකන්තෙහි සීලෙහි සමන්නාගමනහෙතු ඛො මාරිස මොග්ගල්ලාන එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති දිබ්බෙන ආයුනා, දිබ්බෙන වණ්ණෙන, දිබ්බෙන සුඛෙන, දිබ්බෙන යසෙන, දිබ්බෙන ආධිපතෙය්යෙන, දිබ්බෙහි රූපෙහි, දිබ්බෙහි සද්දෙහි, දිබ්බෙහි ගන්ධෙහි, දිබ්බෙහි රසෙහි, දිබ්බෙහි ඵොට්ඨබ්බෙහීති."
            },
            {
                "type": "centered",
                "text": "6. 1. 17.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අට්ඨම සක්කසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "364. අථ ඛො සක්කො දෙවානමින්දො ඡහි දෙවතාසතෙහි සද්ධිං -පෙ- අථ ඛො සක්කො දෙවානමින්දො සත්තහි දෙවතාසතෙහි සද්ධිං -පෙ- අථ ඛො සක්කො දෙවානමින්දො අට්ඨහි දෙවතාසතෙහි සද්ධිං -පෙ- අථ ඛො සක්කො දෙවානමින්දො අසීතියා දෙවතාසහස්සෙහි සද්ධිං යෙනායස්මා මහාමොග්ගල්ලානො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මන්තං මහාමොග්ගල්ලානං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතං ඛො සක්කං දෙවානමින්දං ආයස්මා මහාමොග්ගල්ලානො එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො දෙවානමින්ද, බුද්ධෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති: “ඉතිපි සො භගවා අරහං සම්මාසම්බුද්ධො විජ්ජාචරණසම්පන්නො සුගතො ලොකවිදූ අනුත්තරො පුරිසදම්මසාරථි සත්ථා දෙවමනුස්සානං බුද්ධො භගවා”ති. බුද්ධෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති: තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති දිබ්බෙන ආයුනා, දිබ්බෙන වණ්ණෙන, දිබ්බෙන සුඛෙන, දිබ්බෙන යසෙන, දිබ්බෙන ආධිපතෙය්යෙන, දිබ්බෙහි රූපෙහි, දිබ්බෙහි සද්දෙහි, දිබ්බෙහි ගන්ධෙහි, දිබ්බෙහි රසෙහි, දිබ්බෙහි ඵොට්ඨබ්බෙහි."
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො දෙවානමින්ද, ධම්මෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති “ස්වාක්ඛාතො භගවතා ධම්මො සන්දිට්ඨිකො අකාලිකො එහිපස්සිකො ඔපනයිකො පච්චත්තං වෙදිතබ්බො විඤ්ඤූහී”ති. ධම්මෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති දිබ්බෙන ආයුනා -පෙ- දිබ්බෙහි ඵොට්ඨබ්බෙහි."
            },
            {
                "type": "page-break",
                "text": "516"
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො දෙවානමින්ද සඞ්ඝෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති: “සුපටිපන්නො භගවතො සාවකසඞ්ඝො, උජුපටිපන්නො භගවතො සාවකසඞ්ඝො, ඤායපටිපන්නො භගවතො සාවකසඞ්ඝො, සාමීචිපටිපන්නො භගවතො සාවකසඞ්ඝො, යදිදං චත්තාරි පුරිසයුගානි අට්ඨපුරිසපුග්ගලා එස භගවතො සාවකසඞ්ඝො ආහුනෙය්යො පාහුනෙය්යො දක්ඛිණෙය්යො අඤ්ජලිකරණීයො අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්සා”ති. සඞ්ඝෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො දෙවානමින්ද එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති දිබ්බෙන ආයුනා -පෙ- දිබ්බෙහි ඵොට්ඨබ්බෙහි. සාධු ඛො දෙවානමින්ද, අරියකන්තෙහි සීලෙහි සමන්නාගමනං හොති අඛණ්ඩෙහි අච්ඡිද්දෙහි අසබලෙහි අකම්මාසෙහි භුජිස්සෙහි විඤ්ඤුප්පසත්ථෙහි අපරාමට්ඨෙහි සමාධිසංවත්තනිකෙහි. අරියකන්තෙහි සීලෙහි සමන්නාගමනහෙතු ඛො, දෙවානමින්ද, එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති: දිබ්බෙන ආයුනා, දිබ්බෙන වණ්ණෙන, දිබ්බෙන සුඛෙන, දිබ්බෙන යසෙන, දිබ්බෙන ආධිපතෙය්යෙන, දිබ්බෙහි රූපෙහි, දිබ්බෙහි සද්දෙහි, දිබ්බෙහි ගන්ධෙහි, දිබ්බෙහි රසෙහි, දිබ්බෙහි ඵොට්ඨබ්බෙහීති."
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො මාරිස මොග්ගල්ලාන, බුද්ධෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති “ඉතිපි සො භගවා -පෙ- සත්ථා දෙවමනුස්සානං බුද්ධො භගවා”ති. බුද්ධෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො මාරිස මොග්ගල්ලාන, එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති දිබ්බෙන ආයුනා -පෙ- දිබ්බෙහි ඵොට්ඨබ්බෙහි."
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො මාරිස මොග්ගල්ලාන ධම්මෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති “ස්වාක්ඛාතො භගවතා ධම්මො -පෙ- පච්චත්තං වෙදිතබ්බො විඤ්ඤූහී”ති. ධම්මෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො මාරිස මොග්ගල්ලාන එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති දිබ්බෙන ආයුනා -පෙ- දිබ්බෙහි ඵොට්ඨබ්බෙහි."
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො මාරිස මොග්ගල්ලාන සඞ්ඝෙ අවෙච්චප්පසාදෙන සමන්නාගමනං හොති “සුපටිපන්නො භගවතො සාවකසඞ්ඝො -පෙ- අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්සා”ති. සඞ්ඝෙ අවෙච්චප්පසාදෙන සමන්නාගමනහෙතු ඛො මාරිස මොග්ගල්ලාන එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති දිබ්බෙන ආයුනා -පෙ- දිබ්බෙහි ඵොට්ඨබ්බෙහි."
            },
            {
                "type": "paragraph",
                "text": "සාධු ඛො මාරිස මොග්ගල්ලාන, අරියකන්තෙහි සීලෙහි සමන්නාගමනං හොති. අඛණ්ඩෙහි -පෙ- සමාධිසංවත්තනිකෙහි. අරියකන්තෙහි සීලෙහි සමන්නාගමනහෙතු ඛො මාරිස මොග්ගල්ලාන එවමිධෙකච්චෙ සත්තා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්ති. තෙ අඤ්ඤෙ දෙවෙ දසහි ඨානෙහි අධිගණ්හන්ති දිබ්බෙන ආයුනා, දිබ්බෙන වණ්ණෙන, දිබ්බෙන සුඛෙන , දිබ්බෙන යසෙන, දිබ්බෙන ආධිපතෙය්යෙන, දිබ්බෙහි රූපෙහි, දිබ්බෙහි සද්දෙහි, දිබ්බෙහි ගන්ධෙහි, දිබ්බෙහි රසෙහි, දිබ්බෙහි ඵොට්ඨබ්බෙහීති."
            },
            {
                "type": "centered",
                "text": "6. 1. 18 - 25",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නන්දන{1 චන්දන - මඡසං, ස්යා.}සුත්තානි",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "365 - 372 අථ ඛො නන්දනො දෙවපුත්තො -පෙ- ඵොට්ඨබ්බෙහීති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "6. 1. 26 - 33",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුයාමසුත්තානි",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "373 - 380 අථ ඛො සුයාමො දෙවපුත්තො -පෙ- ඵොට්ඨබ්බෙහීති."
            },
            {
                "type": "centered",
                "text": "6. 1. 34 - 41",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සන්තුසිතසුත්තානි",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "381 - 388 අථ ඛො සන්තුසිතො දෙවපුත්තො -පෙ- ඵොට්ඨබ්බෙහීති."
            },
            {
                "type": "centered",
                "text": "6. 1. 42 - 49",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුනිම්මිතසුත්තානි",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "389 - 396 අථ ඛො සුනිම්මිතො දෙවපුත්තො -පෙ- ඵොට්ඨබ්බෙහීති."
            },
            {
                "type": "centered",
                "text": "6. 1. 50 - 57",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "වසවත්තිසුත්තානි",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "397 - 404 අථ ඛො වසවත්ති දෙවපුත්තො -පෙ- ඵොට්ඨබ්බෙහීති."
            },
            {
                "type": "paragraph",
                "text": "(යථා සක්කසුත්තානි තථා ඉමෙ සුත්තන්තාපි විත්ථාරෙතබ්බා)."
            },
            {
                "type": "centered",
                "text": "මොග්ගල්ලානවත්තො පඨමො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "සවිතක්කාවිතක්කඤ්ච සුඛෙන ච උපෙඛකො\nආකාසානඤ්ච විඤ්ඤාණං ආකිඤ්චඤ්ඤා නෙවසඤ්ඤා ච\nඅනිමිත්තො චෙති නව සක්කො ච නන්දනෙන ච\nසුයාමො ච සන්තුසිතො සුනිම්මිතො වසවත්ති\nඅට්ඨ අට්ඨ භවන්තීති සත්තපඤ්ඤාය හොන්ති තෙ’ති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "මොග්ගල්ලාන සංයුත්තං නිට්ඨිතං.",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ],
        "pages": {
            "490": {
                "pageNum": 490,
                "footnotesCount": 2
            },
            "492": {
                "pageNum": 492,
                "footnotesCount": 0
            },
            "494": {
                "pageNum": 494,
                "footnotesCount": 3
            },
            "496": {
                "pageNum": 496,
                "footnotesCount": 0
            },
            "498": {
                "pageNum": 498,
                "footnotesCount": 0
            },
            "500": {
                "pageNum": 500,
                "footnotesCount": 1
            },
            "502": {
                "pageNum": 502,
                "footnotesCount": 0
            },
            "504": {
                "pageNum": 504,
                "footnotesCount": 0
            },
            "506": {
                "pageNum": 506,
                "footnotesCount": 0
            },
            "508": {
                "pageNum": 508,
                "footnotesCount": 0
            },
            "510": {
                "pageNum": 510,
                "footnotesCount": 0
            },
            "512": {
                "pageNum": 512,
                "footnotesCount": 0
            },
            "514": {
                "pageNum": 514,
                "footnotesCount": 0
            },
            "516": {
                "pageNum": 516,
                "footnotesCount": 0
            },
            "518": {
                "pageNum": 518,
                "footnotesCount": 1
            }
        }
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "491"
            },
            {
                "text": "6. මොග්ගල්ලාන සංයුක්තය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "centered",
                "text": "6. 1. 1.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "සවිතක්ක සූත්‍රය",
                "level": 1
            },
            {
                "text": "348. එක්කලෙක ආයුෂ්මත් මහමුගලන් තෙරණුවෝ සැවැත්නුවර සමීපයෙහි ජේතවන නම් අනේපිඬු සිටුහුගේ අරම්හි වැඩ වෙසෙති. එහි දී ආයුෂ්මත් මහමුගලන් තෙරණුවෝ “ඇවැත්නි මහණෙනි” යි භික්ෂූන් ඇමතූහ. ‘ඇවැත්නි’ යි ඒ භික්ෂූහු ආයුෂ්මත් මහමුගලන් තෙරණුවන්ට පිළිවදන් ඇස්වූහ. ආයුෂ්මත් මහමුගලන් තෙරණුවෝ මෙය වදාළහ: ඇවැත්නි, මෙහි එකලා වූ විවේකයෙන් යුත් මට මෙබඳු චිත්ත විතර්කයෙක් පහළ විය: “පළමුවන දැහැන පළමුවන දැහැනැ” යි කියනු ලැබේ. පළමුවන දැහැන කවරේ දැ? යි. ඇවැත්නි, ඒ මට මෙබඳු සිතෙක් විය: මෙහි මහණ තෙමේ කාමයන්ගෙන් වෙන්ව ම අකුශල ධර්‍මයන්ගෙන් වෙන්ව ම විතර්ක සහිත විචාර සහිත විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය ඇති පළමුවන දැහැනට එළඹ වෙසේ නම් මේ පළමුවන දැහැනැ යි කියනු ලැබේ යි. ඇවැත්නි, ඒ මම කාමයන්ගෙන් වෙන්ව ම අකුශල ධර්‍මයන්ගෙන් වෙන්ව ම විතර්ක සහිත විචාර සහිත විවේකයෙන් හටගත් ප්‍රීතිය හා සුවය ඇති පළමුවන දැහැනට එළඹ වෙසෙමි. ඇවැත්නි, මේ විහරණයෙන් වෙසෙන ඒ මට කාමය සහගිය හැඟීම් හා මෙනෙහි කිරීම් පහළ වෙත්.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, එකල්හි භාග්‍යවතුන් වහන්සේ ඍද්ධියෙන් මා වෙත එළඹ මෙය වදාළ සේක: මුගලන, මුගලන, බමුණ, පළමුවන දැහැන නහමක් වරදව. පළමුවන දැහැනෙහි සිත තබව. පළමුවන දැහැනෙහි සිත එකඟ කරව. පළමුවන දැහැනෙහි සිත පිහිටුව යි. මහණෙනි, ඒ මම පසුකාලයෙහි කාමයන්ගෙන් වෙන්ව ම අකුශල ධර්‍මයන්ගෙන් වෙන්ව ම විතර්ක සහිත විචාර සහිත විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය ඇති පළමුවන දැහැනට එළඹ පසුවෙමි. ඇවැත්නි, ශාස්තෲන් වහන්සේ විසින් අනුග්‍රහ කරන ලද ශ්‍රාවකයෙක් මහාභිඥ බවට පැමිණියේ යයි මැනවින් කියන්නෙක් ඒ යමෙකු සඳහා කියන්නේ නම්, මැනවින් කියන්නෙක් ශාස්තෲන් වහන්සේ විසින් අනුග්‍රහ කරන ලද ශ්‍රාවකයෙක් මහාභිඥ බවට පැමිණියේ ය යි ඒ මා සඳහා කියන්නේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "493"
            },
            {
                "type": "centered",
                "text": "6. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අවිතක්ක සූත්‍රය",
                "level": "1"
            },
            {
                "text": "349. දෙවන දැහැනය දෙවන දැහැනය යි කියනු ලැබේ. දෙවන දැහැන කවරේ දැ? යි. ඇවැත්නි, ඒ මට මෙබඳු සිතෙක් විය: මෙහි මහණ තෙමේ විතර්කවිචාරයන් සංසිඳීමෙන් ඇතුලත පැහැදීම් ඇති එකඟබැව් ඇති විතර්ක රහිත විචාර රහිත සමාධියෙන් හටගත් ප්‍රීතිය හා සුවය ඇති දෙවන දැහැනට එළඹ වෙසේ නම් මෙය දෙවන දැහැනය් යි කියනු ලැබේ යි. ඇවැත්නි, ඒ මම විතර්ක විචාර සංසිඳීමෙන් ඇතුලත පැහැදීම ඇති සිතේ එකඟ බැව් ඇති විතර්ක රහිත විචාර රහිත සමාධියෙන් හටගත් ප්‍රීතිය හා සුවය ඇති දෙවන දැහැනට එළඹ වෙසෙමි. ඇවැත්නි, මේ විහරණයෙන් වෙසෙන ඒ මට විතර්කය සහගිය හැඟීම් හා මෙනෙහි කිරීම් පහළ වෙත්.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, එකල්හි භාග්‍යවතුන් වහන්සේ ඍද්ධියෙන් මා වෙත එළඹ මෙය වදාළ සේක: මුගලන, මුගලන, බමුණ, දෙවන දැහැන නහමක් වරදව. දෙවන දැහැනෙහි සිත තබව. දෙවන දැහැනෙහි සිත එකඟ කරව. දෙවන දැහැනෙහි සිත පිහිටුව යි. ඇවැත්නි, ඒ මම පසු කාලයෙහි මම විතර්ක විචාර සංසිඳීමෙන් ඇතුලත පැහැදීම ඇති සිතේ එකඟ බැව් ඇති විතර්ක රහිත විචාර රහිත සමාධියෙන් හටගත් ප්‍රීතිය හා සුවය ඇති දෙවන දැහැනට එළඹ විසුවෙමි. ඇවැත්නි, මැනවින් කියන්නෙක් “ශාස්තෲන් වහන්සේ විසින් අනුග්‍රහ කරන ලද ශ්‍රාවකයෙක් මහාභිඥ බවට පැමිණියේ ය”යි ඒ යමෙකු සඳහා කියන්නේ නම්, මැනවින් කියන්නෙක් ශාස්තෲන් වහන්සේ විසින් අනුග්‍රහ කරන ලද ශ්‍රාවකයෙක් මහාභිඥ බවට පැමිණියේ ය යි ඒ මා සඳහා කියන්නේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "6. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුඛ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "350. තෙවන දැහැන තෙවන දැහැනය යි කියනු ලැබේ. තෙවන දැහැන කවරේ දැ? යි. ඇවැත්නි, ඒ මට මෙබඳු සිතෙක් විය: මෙහි මහණ තෙමේ ප්‍රීතියත් දුරු කිරීමෙන් උපේක්ෂා ඇත්තේ වෙසෙයි. සිහි ඇත්තේ මනා දැනුම් ඇත්තේ කයින් සුවත් විඳියි. උපේක්ෂා ඇත්තේ ය, සිහි ඇත්තේ ය, සුඛ විහරණ ඇත්තේ ය යි ඒ යමෙකු සඳහා ආර්‍ය්‍යයෝ කියත් නම්, ඒ තෙවන දැහැනා එළඹ වෙසේ ද, මේ තෙවන දැහැනය යි කියනු ලැබේ යි. ඇවැත්නි, ඒ මම ප්‍රීතියත් දුරු කිරීමෙන් උපේක්ෂා ඇත්තේ වෙසෙමි. සිහි ඇත්තේ මනා දැනුම් ඇත්තේ කයින් සුවත් විඳිමි. උපේක්ෂා ඇත්තේ ය, සිහි ඇත්තේ ය, සුඛ විහරණ ඇත්තේ ය යි ආර්‍ය්‍යයෝ ඒ යමකු සඳහා කියත් නම් ඒ තෙවන දැහැනට එළඹ වෙසෙමි. ඇවැත්නි, මේ විහරණයෙන් වෙසෙන ඒ මට ප්‍රීතිය සහගිය හැඟීම් හා මෙනෙහි කිරීම් පහළ වෙත්.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "495"
            },
            {
                "text": "ඇවැත්නි, එකල්හි භාග්‍යවතුන් වහන්සේ ඍද්ධියෙන් මා වෙත එළඹ මෙය වදාළ සේක: මුගලන, මුගලන, බමුණ, තෙවන දැහැන නහමක් වරදව. තෙවන දැහැනෙහි සිත තබව. තෙවන දැහැනෙහි සිත එකඟ කරව. තෙවන දැහැනෙහි සිත පිහිටුව යි. ඇවැත්නි, ඒ මම පසු කාලයෙහි ප්‍රීතියත් දුරලීමෙන් උපේක්ෂා ඇත්තේත් විසුවෙමි. සිහි ඇත්තේ මනා දැනුම් ඇත්තේ කයින් සුවත් වින්දෙමි. උපේක්ෂා ඇත්තේ ය, සිහි ඇත්තේ ය, සුඛ විහරණ ඇත්තේ ය යි ආර්‍ය්‍යයෝ ඒ යමකු සඳහා කියත් නම්, ඒ තෙවන දැහැනට එළඹ විසුවෙමි. ඇවැත්නි, මැනවින් කියන්නෙක් “ශාස්තෲන් වහන්සේ විසින් අනුග්‍රහ කරන ලද ශ්‍රාවකයෙක් මහාභිඥ බවට පැමිණියේ ය” යි ඒ යමකු සඳහා කියන්නේ නම්, මැනවින් කියන්නෙක් ශාස්තෲන් වහන්සේ විසින් අනුග්‍රහ කරන ලද ශ්‍රාවකයෙක් මහාභිඥ බවට පැමිණියේ ය යි ඒ මා සඳහා කියන්නේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "6. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "උපෙඛා සූත්‍රය",
                "level": "1"
            },
            {
                "text": "351. සිවුවන දැහැනය සිවුවන දැහැනය යි කියනු ලැබේ. සිවුවන දැහැන කවරේ දැ?යි. ඇවැත්නි, ඒ මට මෙබඳු සිතෙක් විය: මෙහි මහණ තෙමේ සුවත් දුරු කිරීමෙන් දුකත් දුරු කිරීමෙන් පළමු මැ සොම්නස් දොම්නසුන්ගේ අභාවයෙන් දුක් නැති සුව නැති උපේක්ෂාවෙන් හා සිහියෙන් හටගත් පිරිසිදු බැව් ඇති සිවුවන දැහැනට එළඹ වෙසේ නම් මෙය සිවුවන දැහැන ය යි කියනු ලැබේ යි. ඇවැත්නි, ඒ මම සුවත් දුරු කිරීමෙන් දුකත් දුරු කිරීමෙන් පළමු ම සොම්නස් දොම්නසුන්ගේ අභාවයෙන් දුක් නැති සුව නැති උපේක්ෂාවෙන් හා සිහියෙන් හටගත් පිරිසිදු බැව් ඇති සිවුවන දැහැනට එළඹ වෙසෙමි. ඇවැත්නි, මේ විහරණයෙන් වෙසෙන ඒ මට උපේක්ෂාව සහගිය හැඟීම් හා මෙනෙහිකිරීම් පහළවෙත්.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, එකල්හි භාග්‍යවතුන් වහන්සේ ඍද්ධියෙන් මා වෙත එළඹ මෙය වදාළ සේක: මුගලන, මුගලන, බමුණ, සිවුවන දැහැන නහමක් වරදව. සිවුවන දැහැනෙහි සිත තබව. සිවුවන දැහැනෙහි සිත එකඟ කරව. සිවුවන දැහැනෙහි සිත පිහිටුව යි. ඇවැත්නි, ඒ මම පසු කාලයෙහි සුවත් දුරුකිරීමෙන් දුකත් දුරුකිරීමෙන් පළමු ම සොම්නස් දොම්නසුන්ගේ අභාවයෙන් දුක් නැති සුව නැති උපේක්ෂාවෙන් හා සිහියෙන් හටගත් පිරිසිදු බැව් ඇති සිවුවන දැහැනට එළඹ විසුවෙමි. ඇවැත්නි, මැනවින් කියන්නෙක් “ශාස්තෲන් වහන්සේ විසින් අනුග්‍රහ කරන ලද ශ්‍රාවකයෙක් මහාභිඥ බවට පැමිණියේ ය”යි ඒ යමෙකු සඳහා කියන්නේ නම්, මැනවින් කියන්නෙක් ශාස්තෲන් වහන්සේ විසින් අනුග්‍රහ කරන ලද ශ්‍රාවකයෙක් මහාභිඥ බවට පැමිණියේ ය යි ඒ මා සඳහා කියන්නේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "497"
            },
            {
                "type": "centered",
                "text": "6. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආකාසානඤ්‌චායතන සූත්‍රය",
                "level": "1"
            },
            {
                "text": "352. ආකාසානඤ්චායතනය ආකාසානඤ්චායතනය යි කියනු ලැබේ. ආකාසානඤ්චායතනය කවරේ දැ?යි. ඇවැත්නි, ඒ මට මෙබඳු සිතෙක් විය: මෙහි මහණ තෙමේ සර්වප්‍රකාරයෙන් රූප සංඥාවන් ඉක්මවීමෙන් ප්‍රතිඝසංඥාවන් දුරු කිරීමෙන් නානාත්ව සංඥාවන් නො මෙනෙහි කිරීමෙන් ආකාශය අනන්ත ය යි ආකාසානඤ්චායතනට එළඹ වෙසේ නම් මෙය ආකාසානඤ්චායතනය යි කියනු ලැබේ. ඇවැත්නි, ඒ මම සර්වප්‍රකාරයෙන් රූප සංඥාවන් ඉක්මවීමෙන් ප්‍රතිඝසංඥාවන් දුරු කිරීමෙන් නානාත්ව සංඥාවන් නො මෙනෙහි කිරීමෙන් ආකාශය අනන්ත ය යි ආකාසානඤ්චායතනට පැමිණ වෙසෙමි. ඇවැත්නි, මේ විහරණයෙන් වෙසෙන ඒ මට රූ සහගිය හැඟීම් හා මෙනෙහි කිරීම් පහළ වෙත්.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, එකල්හි භාග්‍යවතුන් වහන්සේ ඍද්ධියෙන් මා වෙත එළඹ මෙය වදාළ සේක: මුගලන, මුගලන, බමුණ, ආකාසානඤ්චායතනය නො වරදව. ආකාසානඤ්චායතනය දැහැනෙහි සිත මැනවින් තබව. ආකාසානඤ්චායතනය දැහැනෙහි සිත එකඟ කරව. ආකාසානඤ්චායතනය දැහැනෙහි සිත පිහිටුව යි. ඇවැත්නි, ඒ මම පසු කාලයෙහි සර්වප්‍රකාරයෙන් රූප සංඥාවන් ඉක්මවීමෙන් ප්‍රතිඝසංඥාවන් දුරු කිරීමෙන් නානාත්ව සංඥාවන් නො මෙනෙහි කිරීමෙන් ආකාශය අනන්ත ය යි ආකාසානඤ්චායතනට පැමිණ විසුවෙමි. ඇවැත්නි, මැනවින් කියන්නෙක් ඒ යමෙකු සඳහා ... මහාභිඥ බවට පැමිණියේ ය යි කියන්නේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "6. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "විඤ්‌ඤාණඤ්‌චායතන සූත්‍රය",
                "level": "1"
            },
            {
                "text": "353. විඤ්ඤාණඤ්චායතනය විඤ්ඤාණඤ්චායතනය යි කියනු ලැබේ. විඤ්ඤාණඤ්චායතනය කවරේ දැ?යි. ඇවැත්නි, ඒ මට මෙබඳු සිතෙක් විය: මෙහි මහණ් තෙමේ සර්වප්‍රකාරයෙන් ආකාසානඤ්චායතනය ඉක්මවා විඤ්ඤාණය අනන්ත ය යි විඤ්ඤාණ්ඤ්චායතනට පැමිණ වෙසේ නම් මෙය විඤ්ඤාණඤ්චායතනය යි කියනු ලැබේ යි. ඇවැත්නි, ඒ මම සර්වප්‍රකාරයෙන් ආකාසානඤ්චායතනය ඉක්මවා විඤ්ඤාණය අනන්ත ය යි විඤ්ඤාණ්ඤ්චායතනට පැමිණ වෙසෙමි. ඇවැත්නි, මේ විහරණයෙන් වෙසෙන ඒ මට ආකාසානඤ්චායතනය සහගිය හැඟීම් හා මෙනෙහි කිරීම් පහළ වෙත්.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, එකල්හි භාග්‍යවතුන් වහන්සේ ඍද්ධියෙන් මා වෙත එළඹ මෙය වදාළ සේක: මුගලන, මුගලන, බමුණ, විඤ්ඤාණඤ්චායතනය නො වරදව. විඤ්ඤාණඤ්චායතනයෙහි සිත මැනවින් තබව. විඤ්ඤාණඤ්චායතනයෙහි සිත එකඟ කරව. විඤ්ඤාණඤ්චායතනයෙහි සිත පිහිටුව යි. ඇවැත්නි, ඒ මම පසු කාලයෙහි සර්වප්‍රකාරයෙන් ආකාසානඤ්චායතනය ඉක්මවා විඤ්ඤාණය අනන්ත ය යි විඤ්ඤාණ්ඤ්චායතනට පැමිණ විසුවෙමි. ඇවැත්නි, මැනවින් කියන්නෙක් ඒ යමෙකු සඳහා ... මහාභිඥ බවට පැමිණියේ ය යි කියන්නේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "499"
            },
            {
                "type": "centered",
                "text": "6. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආකිඤ්‌චඤ්‌ඤායතන සූත්‍රය",
                "level": "1"
            },
            {
                "text": "354. ආකිඤ්චඤ්ඤායතනය ආකිඤ්චඤ්ඤායතනය යි කියනු ලැබේ. ආකිඤ්චඤ්ඤායතනය කවරේ දැ?යි. ඇවැත්නි, ඒ මට මෙබඳු සිතෙක් විය: මෙහි මහණ තෙමේ සර්වප්‍රකාරයෙන් විඤ්ඤානඤ්චායතනය ඉක්මවා කිසිවක් නැතැ යි ආකිඤ්චඤ්ඤායතනයට පැමිණ වෙසේ නම් මෙය ආකිඤ්චඤ්ඤායතනය යි කියනු ලැබේ යි. ඇවැත්නි, ඒ මම සර්වප්‍රකාරයෙන් විඤ්ඤානඤ්චායතනය ඉක්මවා කිසිවක් නැතැ යි ආකිඤ්චඤ්ඤායතනයට පැමිණ වෙසෙමි. ඇවැත්නි, මේ විහරණයෙන් වෙසෙන ඒ මට විඤ්ඤාණඤ්චායතනය සහගිය හැඟීම් හා මෙනෙහි කිරීම් පහළ වෙත්.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, එකල්හි භාග්‍යවතුන් වහන්සේ ඍද්ධියෙන් මා වෙත එළඹ මෙය වදාළ සේක: මුගලන, මුගලන, බමුණ, ආකිඤ්චඤ්ඤායතනය නහමක් වරදව. ආකිඤ්චඤ්ඤායතනයෙහි සිත මැනවින් තබව. ආකිඤ්චඤ්ඤායතනයෙහි සිත එකඟ කරව. ආකිඤ්චඤ්ඤායතනයෙහි සිත පිහිටුව යි. ඇවැත්නි, ඒ මම සර්වප්‍රකාරයෙන් විඤ්ඤානඤ්චායතනය ඉක්මවා කිසිවක් නැතැ යි ආකිඤ්චඤ්ඤායතනයට පැමිණ විසුවෙමි. ඇවැත්නි, මැනවින් කියන්නෙක් ඒ යමෙකු සඳහා ... මහාභිඥ බවට පැමිණියේ ය යි කියන්නේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "6. 1. 8.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "නෙවසඤ්‌ඤානාසඤ්‌ඤායතන සූත්‍රය",
                "level": "1"
            },
            {
                "text": "355. නේවසඤ්ඤානාසඤ්ඤායතනය නේවසඤ්ඤානාසඤ්ඤායතනය යි කියනු ලැබේ. නේවසඤ්ඤානාසඤ්ඤායතනය කවරේ දැ?යි. ඇවැත්නි, ඒ මට මෙබඳු සිතෙක් විය: මෙහි මහණ තෙමේ සර්වප්‍රකාරයෙන් ආකිඤ්චඤ්ඤායතනය ඉක්මවා නේවසඤ්ඤානාසඤ්ඤායතනයට පැමිණ වෙසේ නම් මෙය නේවසඤ්ඤානාසඤ්ඤායතනය යි කියනු ලැබේ යි. ඇවැත්නි, ඒ මම සර්වප්‍රකාරයෙන් ආකිඤ්චඤ්ඤායතනය ඉක්මවා නේවසඤ්ඤානාසඤ්ඤායතනයට පැමිණ වෙසෙමි. ඇවැත්නි, මේ විහරණයෙන් වෙසෙන ඒ මට ආකිඤ්චඤ්ඤායතනය සහගිය හැඟීම් හා මෙනෙහි කිරීම් පහළ වෙත්.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, එකල්හි භාග්‍යවතුන් වහන්සේ ඍද්ධියෙන් මා වෙත එළඹ මෙය වදාළ සේක: මුගලන, මුගලන, බමුණ, නේවසඤ්ඤානාසඤ්ඤායතනය නහමක් වරදව. නේවසඤ්ඤානාසඤ්ඤායතනයෙහි සිත මැනවින් තබව. නේවසඤ්ඤානාසඤ්ඤායතනයෙහි සිත එකඟ කරව. නේවසඤ්ඤානාසඤ්ඤායතනය සිත පිහිටුව යි. ඇවැත්නි, ඒ මම සර්වප්‍රකාරයෙන් ආකිඤ්චඤ්ඤායතනය ඉක්මවා කිසිවක් නැතැ යි නේවසඤ්ඤානාසඤ්ඤායතනයට පැමිණ විසුවෙමි. ඇවැත්නි, මැනවින් කියන්නෙක් ඒ යමෙකු සඳහා ... මහාභිඥ බවට පැමිණියේ ය යි කියන්නේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "501"
            },
            {
                "type": "centered",
                "text": "6. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනිමිත්‌ත සූත්‍රය",
                "level": "1"
            },
            {
                "text": "356. අනිමිත්ත චේතෝ සමාධිය අනිමිත්ත චේතෝ සමාධිය යි කියනු ලැබේ. අනිමිත්ත චේතෝ සමාධිය කවරේ දැ?යි. ඇවැත්නි, ඒ මට මෙබඳු සිතෙක් විය. මෙහි මහණ තෙමේ සියලු නිමිති නො මෙනෙහි කිරීමෙන් අනිමිත්ත චේතෝ සමාධියට එළඹ වෙසේ නම් මෙය අනිමිත්ත චේතෝ සමාධිය යි කියනු ලැබේ යි. ඇවැත්නි, ඒ මම සියලු නිමිති නො මෙනෙහි කිරීමෙන් අනිමිත්ත චේතෝ සමාධියට එළඹ වෙසෙමි. ඇවැත්නි, මේ විහරණයෙන් වෙසෙන ඒ මාගේ විඤ්ඤාණය නිමිති අනුව හැසිරෙනසුලු වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, එකල්හි භාග්‍යවතුන් වහන්සේ ඍද්ධියෙන් මා වෙත එළඹ මෙය වදාළ සේක: මුගලන, මුගලන, බමුණ, අනිමිත්ත චේතෝ සමාධිය නහමක් වරදව. අනිමිත්ත චේතෝ සමාධියෙහි සිත මැනවින් තබව. අනිමිත්ත චේතෝ සමාධියෙහි සිත එකඟ කරව. අනිමිත්ත චේතෝ සමාධියෙහි සිත පිහිටුව යි. ඇවැත්නි, ඒ මම පසු කාලයෙහි සියලු නිමිති නො මෙනෙහි කිරීමෙන් අනිමිත්ත චේතෝ සමාධියට එළඹ විසුවෙමි. ඇවැත්නි, මැනවින් කියන්නෙක් “ශාස්තෲන් වහන්සේ විසින් අනුග්‍රහ කරන ලද ශ්‍රාවකයෙක් මහාභිඥ බවට පැමිණියේ ය” යි ඒ යමෙකු සඳහා කියන්නේ නම් මැනවින් කියන්නෙක් ශාස්තෲන් වහන්සේ විසින් අනුග්‍රහ කරන ලද ශ්‍රාවකයෙක් මහාභිඥ බවට පැමිණියේ ය යි ඒ මා සඳහා කියන්නේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "6. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සක්‌ක සූත්‍රය",
                "level": "1"
            },
            {
                "text": "357. එක්කලෙක ආයුෂ්මත් මහ මුගලන් තෙරණුවෝ සැවත සමීපයෙහි ජේතවන නම් අනේපිඬු සිටුහුගේ අරම්හි වැඩ වෙසෙති. එකල්හි ආයුෂ්මත් මහ මුගලන් තෙරණුවෝ යම්සේ බලවත් පුරුෂයෙක් හැකුළු අත දිගු කරන්නේ හෝ දිගු කළ අත හකුළුවන්නේ හෝ වේ ද එසෙයින් ම දෙව්රම්හි අතුරුදන් වූවාහු තව්තිසා දෙවියන් අතර පහළ වූහ. එක්ලහි සක් දෙව් රජ පන්සියයක් දෙවියන් සමග ආයුෂ්මත් මහ මුගලන් තෙරණුවන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් මහ මුගලන් තෙරණුවන් වැඳ එකත්පස් ව සිටියේ ය. එකත්පස්ව සිටි සක් දෙව් රජුට ආයුෂ්මත් මහ මුගලන් තෙරණුවෝ මෙය වදාළහ.",
                "type": "paragraph"
            },
            {
                "text": "දේවානමින්ද, බුදුන් සරණ යෑම මැනවි. දේවානමින්ද, මෙසේ බුදුන් සරණ යෑම හේතු කොට මෙහි ඇතැම් සත්තව කෙනෙක් කාබුන් මරණින් මතු සෝභන ගති ඇති සුගති සගලොවට පැමිණෙත්. දේවානමින්ද, දහම් සරණ යෑම මැනවි. දේවානමින්ද, මෙසේ දහම් සරණ යෑම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. දේවානමින්ද, සඟුන් සරණ යෑම මැනවි. දේවානමින්ද, මෙසේ සඟුන් සරණ යෑම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "503"
            },
            {
                "text": "නිදුකාණෙනි මොග්ගල්ලානයෙනි, බුදුන් සරණ යෑම මැනවි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ බුදුන් සරණ යෑම හේතු කොට මෙහි ඇතැම් සත්තව කෙනෙක් කාබුන් මරණින් මතු සෝභන ගති ඇති සුගති සගලොවට පැමිණෙත්. නිදුකාණෙනි මොග්ගල්ලානයෙනි, දහම් සරණ යෑම මැනවි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ දහම් සරණ යෑම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. නිදුකාණෙනි මොග්ගල්ලානයෙනි, සඟුන් සරණ යෑම මැනවි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ සඟුන් සරණ යෑම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "6. 1. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය සක්‌ක සූත්‍රය",
                "level": "1"
            },
            {
                "text": "358. ඉක්බිති සක් දෙව් රජ සසියයක් දෙවියන් සමග ... සක් දෙව් රජ සත්සියයක් දෙවියන් සමග  ... සක් දෙව් රජ අටසියයක් දෙවියන් සමග ... ඉක්බිති සක් දෙව් රජ අසූදහසක් දෙවියන් සමග ආයුෂ්මත් මහ මුගලන් තෙරණුවන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් මහ මුගලන් තෙරණුවන් වැඳ එකත්පස් ව සිටියේ ය. එකත්පස්ව සිටි සක් දෙව් රජුට ආයුෂ්මත් මහ මුගලන් තෙරණුවෝ මෙය වදාළහ: දේවානමින්ද, බුදුන් සරණ යෑම මැනවි. දේවානමින්ද, මෙසේ බුදුන් සරණ යෑම හේතු කොට මෙහි ඇතැම් සත්තව කෙනෙක් කාබුන් මරණින් මතු සෝභන ගති ඇති සුගති සගලොවට පැමිණෙත්. දේවානමින්ද, දහම් සරණ යෑම මැනවි ... දේවානමින්ද, සඟුන් සරණ යෑම මැනවි. දේවානමින්ද, මෙසේ සඟුන් සරණ යෑම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙති යි.",
                "type": "paragraph"
            },
            {
                "text": "නිදුකාණෙනි මොග්ගල්ලානයෙනි, බුදුන් සරණ යෑම මැනවි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ බුදුන් සරණ යෑම හේතු කොට මෙහි ඇතැම් සත්තව කෙනෙක් කාබුන් මරණින් මතු සෝභන ගති ඇති සුගති සගලොවට පැමිණෙත්. නිදුකාණෙනි මොග්ගල්ලානයෙනි, දහම් සරණ යෑම මැනවි ... නිදුකාණෙනි මොග්ගල්ලානයෙනි, සඟුන් සරණ යෑම මැනවි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ සඟුන් සරණ යෑම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "6. 1. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තතිය සක්‌ක සූත්‍රය",
                "level": "1"
            },
            {
                "text": "359. ඉක්බිති සක්දෙව් රජ පන්සියයක් දෙවියන් සමග ආයුෂ්මත් මහමුගලන් තෙරණුවන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් මහමුගලන් තෙරණුවන් වැඳ එකත්පස් ව සිටියේ ය. එකත්පස් ව සිටි සක්දෙව් රජුට ආයුෂ්මත් මහමුගලන් තෙරණුවෝ මෙය වදාළහ: දේවානමින්ද, බුදුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වීම මැනවි. ඒ භගවත්හු මෙකරුණෙනුදු අර්හත්හ, සම්මා සම්බුද්ධයහ, විජ්ජාචරණ සම්පන්නයහ, සුගතයහ, ලෝක විදූහ, අනුත්තර පුරිසදම්මසාරථීහ, දෙවිමිනිසුන්ට ශාස්තෲහ, බුද්ධයහ, භගවත්හ යි. දේවානමින්ද, මෙසේ බුදුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "505"
            },
            {
                "text": "දේවානමින්ද, දහම්හි ගුණ දැන පැහැදීමෙන් යුතු වීම මැනවි. භාග්‍යවතුන් වහන්සේ විසින් ධර්‍මය ස්වාඛාත ය, සාංදෘෂ්ටික ය, අකාලික ය, ඒහිපස්සික ය, ඕපනයික ය, නුවණැත්තන් විසින් තමතමා කෙරෙහි ලා දත යුත්තේ ය යි. දේවානමින්ද, මෙසේ දහම්හි ගුණ දැන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්.",
                "type": "paragraph"
            },
            {
                "text": "දේවානමින්ද, සඟුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වීම මැනවි. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සඞ්ඝ තෙමේ සුප්‍රතිපන්න ය, භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සඞ්ඝ තෙමේ සෘජුප්‍රතිපන්න ය, භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සඞ්ඝ තෙමේ ඤායප්‍රතිපන්න ය, භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සඞ්ඝ තෙමේ සාමීචිප්‍රතිපන්න ය, යම් මේ පුරුෂ යුගල සතරෙක් වේ නම් (එහි) පුරුෂ පුද්ගලයෝ අට දෙනෙකි, භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සඞ්ඝ තෙමේ ආහුනෙය්‍යහ ය, පාහුනෙය්‍යහ ය, දක්ෂිණාර්හ ය, අඤ්ජලිකරණීයහ ය, ලෝකයාට අනුත්තර පුණ්‍යක්ෂේත්‍ර ය යි. දේවානමින්ද, මෙසේ සඟුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්.",
                "type": "paragraph"
            },
            {
                "text": "දේවානමින්ද, නො කඩ වූ නො සිදුරු වූ නො කැලැල් වූ නො කබර වූ නිදහස් වූ නුවණැත්තන් විසින් පසස්නා ලද, තෘෂ්ණා දෘෂ්ටීන් නො පහස්නා ලද සමාධිය පිණිස පවත්නා ආර්‍ය්‍යකාන්ත (ආර්‍ය්‍යයන් විසින් කැමති වන ලද) ශීලයෙන් යුතු වීම මැනවි. දේවානමින්ද, මෙසේ ආර්‍ය්‍යකාන්ත ශීලයෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙති යි.",
                "type": "paragraph"
            },
            {
                "text": "නිදුකාණෙනි මොග්ගල්ලානයෙනි, බුදුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වීම මැනවි. ඒ භාග්‍යවතුන් වහන්සේ මෙකරුණෙනුදු ... දෙවිමිනිසුන්ට ශාස්තෲහ, බුද්ධයහ, භගවත්හ යි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ බුදුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. නිදුකාණෙනි මොග්ගල්ලානයෙනි, දහම්හි ගුණ දැන පැහැදීමෙන් යුතු වීම මැනවි. භාග්‍යවතුන් වහන්සේ විසින් ධර්‍මය ස්වාඛාත ය ... නුවණැත්තන් විසින් තමතමා කෙරෙහි ලා දත යුත්තේ ය යි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ දහම්හි ගුණ දැන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. නිදුකාණෙනි මොග්ගල්ලානයෙනි, සඟුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වීම මැනවි. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සඞ්ඝ තෙමේ සුප්‍රතිපන්න ය ... ලෝකයාට අනුත්තර පුණ්‍යක්ෂේත්‍රය යි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ සඟුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්.\nනිදුකාණෙනි මොග්ගල්ලානයෙනි, නො කඩ වූ ... සමාධිය පිණිස පවත්නා ආර්‍ය්‍යයන් විසින් කැමති වන ලද ශීලයෙන් යුතු වීම මැනවි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ ආර්‍ය්‍යකාන්ත ශීලයෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "507"
            },
            {
                "type": "centered",
                "text": "6. 1. 13.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "චතුත්ථ සක්‌ක සූත්‍රය",
                "level": "1"
            },
            {
                "text": "360. ඉක්බිති සක් දෙව් රජ සසියයක් දෙවියන් සමග ... ඉක්බිති සක් දෙව් රජ සත්සියයක් දෙවියන් සමග ... ඉක්බිති සක් දෙව් රජ අටසියයක් දෙවියන් සමග ... ඉක්බිති සක් දෙව් රජ අසූදහසක් දෙවියන් සමග ආයුෂ්මත් මහමුගලන් තෙරණුවන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් මහමුගලන් තෙරණුවන් වැඳ එකත්පස් ව සිටියේ ය. එකත්පස් ව සිටි සක්දෙව් රජුට ආයුෂ්මත් මහමුගලන් තෙරණුවෝ මෙය වදාළහ:",
                "type": "paragraph"
            },
            {
                "text": "දේවානමින්ද, බුදුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වීම මැනවි. ඒ භගවත්හු මෙකරුණෙනුදු ... දෙවිමිනිසුන්ට ශාස්තෲහ, බුද්ධයහ, භගවත්හ යි. දේවානමින්ද, මෙසේ බුදුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්.දේවානමින්ද, දහම්හි ගුණ දැන පැහැදීමෙන් යුතු වීම මැනවි. භාග්‍යවතුන් වහන්සේ විසින් ධර්‍මය ස්වාඛාත ය ... නුවණැත්තන් විසින් තමතමා කෙරෙහි ලා දත යුත්තේ ය යි. දේවානමින්ද, මෙසේ දහම්හි ගුණ දැන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්.දේවානමින්ද, සඟුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වීම මැනවි. භගවත්හුගේ ශ්‍රාවක සඞ්ඝ තෙමේ සුප්‍රතිපන්න ය ... ලෝකයාට අනුත්තර පුණ්‍යක්ෂේත්‍රය යි. දේවානමින්ද, මෙසේ සඟුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. දේවානමින්ද, නො කඩ වූ ... සමාධිය පිණිස පවත්නා වූ ආර්‍ය්‍යකාන්ත ශීලයෙන් යුතු වීම මැනවි. දේවානමින්ද, මෙසේ ආර්‍ය්‍යකාන්ත ශීලයෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙති යි.",
                "type": "paragraph"
            },
            {
                "text": "නිදුකාණෙනි මොග්ගල්ලානයෙනි, බුදුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වීම මැනවි. ඒ භගවත්හු මෙකරුණෙනුදු ... දෙවිමිනිසුන්ට ශාස්තෲහ, බුද්ධයහ, භගවත්හ යි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ බුදුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. නිදුකාණෙනි මොග්ගල්ලානයෙනි, දහම්හි ගුණ දැන පැහැදීමෙන් යුතු වීම මැනවි. භාග්‍යවතුන් වහන්සේ විසින් ධර්‍මය ස්වාඛාත ය ... නුවණැත්තන් විසින් තමතමා කෙරෙහි ලා දත යුත්තේ ය යි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ දහම්හි ගුණ දැන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. නිදුකාණෙනි මොග්ගල්ලානයෙනි, සඟුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වීම මැනවි. භගවත්හුගේ ශ්‍රාවක සඞ්ඝ තෙමේ සුප්‍රතිපන්න ය ... ලෝකයාට අනුත්තර පුණ්‍යක්ෂේත්‍රය යි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, සඟුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. නිදුකාණෙනි මොග්ගල්ලානයෙනි, නො කඩ වූ ... සමාධිය පිණිස පවත්නා ආර්‍ය්‍යකාන්ත ශීලයෙන් යුතු වීම මැනවි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ ආර්‍ය්‍යකාන්ත ශීලයෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "509"
            },
            {
                "type": "centered",
                "text": "6. 1. 14.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පංචම සක්ක සූත්‍රය",
                "level": "1"
            },
            {
                "text": "361. ඉක්බිති සක් දෙව් රජ පන්සියයක් දෙවියන් සමග ආයුෂ්මත් මහමුගලන් තෙරණුවන් වෙත එළඹියේ ය. ... එකත්පස් ව සිටි සක්දෙව් රජුට ආයුෂ්මත් මහමුගලන් තෙරණුවෝ මෙය වදාළහ: දේවානමින්ද, බුදුන් සරණ යෑම මැනවි. දේවානමින්ද, මෙසේ බුදුන් සරණ යෑම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ද දිව්‍යමය වර්ණයෙන් ද දිව්‍යමය සුවයෙන් ද දිව්‍යමය යසසින් ද දිව්‍යමය අධිපති භාවයෙන් ද දිව්‍යමය රූපයෙන් ද දිව්‍යමය ශබ්දයෙන් ද දිව්‍යමය ගන්ධයෙන් ද දිව්‍යමය රසයෙන් ද දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් අන් දෙවියන් යටපත් කෙරෙත්. ",
                "type": "paragraph"
            },
            {
                "text": "දේවානමින්ද, දහම් සරණ යෑම මැනවි. දේවානමින්ද, මෙසේ දහම් සරණ යෑම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සග ලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ද දිව්‍යමය වර්ණයෙන් ද දිව්‍යමය සුවයෙන් ද දිව්‍යමය යසසින් ද දිව්‍යමය අධිපති භාවයෙන් ද දිව්‍යමය රූපයෙන් ද දිව්‍යමය ශබ්දයෙන් ද දිව්‍යමය ගන්ධයෙන් ද දිව්‍යමය රසයෙන් ද දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් අන් දෙවියන් යටපත් කෙරෙත්. ",
                "type": "paragraph"
            },
            {
                "text": "දේවානමින්ද, සඟුන් සරණ යෑම මැනවි. දේවානමින්ද, මෙසේ සඟුන් සරණ යෑම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ද දිව්‍යමය වර්ණයෙන් ද දිව්‍යමය සුවයෙන් ද දිව්‍යමය යසසින් ද දිව්‍යමය අධිපති භාවයෙන් ද දිව්‍යමය රූපයෙන් ද දිව්‍යමය ශබ්දයෙන් ද දිව්‍යමය ගන්ධයෙන් ද දිව්‍යමය රසයෙන් ද දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් අන් දෙවියන් යටපත් කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "text": "නිදුකාණෙනි මොග්ගල්ලානයෙනි, බුදුන් සරණ යෑම මැනවි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ බුදුන් සරණ යෑම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ... දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් සෙසු දෙවියන් යටපත් කෙරෙත්. නිදුකාණෙනි මොග්ගල්ලානයෙනි, දහම් සරණ යෑම මැනවි. ... නිදුකාණෙනි මොග්ගල්ලානයෙනි, සඟුන් සරණ යෑම මැනවි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ සඟුන් සරණ යෑම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ද දිව්‍යමය වර්ණයෙන් ද දිව්‍යමය සුවයෙන් ද දිව්‍යමය යසසින් ද දිව්‍යමය අධිපති භාවයෙන් ද දිව්‍යමය රූපයෙන් ද දිව්‍යමය ශබ්දයෙන් ද දිව්‍යමය ගන්ධයෙන් ද දිව්‍යමය රසයෙන් ද දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් අන් දෙවියන් යටපත් කෙරෙතියි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "511"
            },
            {
                "type": "centered",
                "text": "6. 1. 15.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඡට්ඨ සක්ක සූත්‍රය",
                "level": "1"
            },
            {
                "text": "362. ඉක්බිති සක් දෙව් රජ සසියයක් දෙවියන් සමග … ඉක්බිති සක් දෙව් රජ සත්සියයක් දෙවියන් සමග ... ඉක්බිති සක් දෙව් රජ අටසියයක් දෙවියන් සමග … ඉක්බිති සක් දෙව් රජ අසූදහසක් දෙවියන් සමග ආයුෂ්මත් මහමුගලන් තෙරණුවන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් මහමුගලන් තෙරණුවන් වැඳ එකත්පස් ව සිටියේ ය. එකත්පස් ව සිටි සක්දෙව් රජුට ආයුෂ්මත් මහමුගලන් තෙරණුවෝ මෙය වදාළහ: ",
                "type": "paragraph"
            },
            {
                "text": "දේවානමින්ද, බුදුන් සරණ යෑම මැනවි. දේවානමින්ද, මෙසේ බුදුන් සරණ යෑම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ... දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් සෙසු දෙවියන් යටපත් කෙරෙත්. දේවානමින්ද, දහම් සරණ යෑම මැනවි ... දේවානමින්ද, සඟ සරණ යෑම මැනවි. දේවානමින්ද, මෙසේ සඟ සරණ යෑම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සග ලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ද දිව්‍යමය වර්ණයෙන් ද දිව්‍යමය සුවයෙන් ද දිව්‍යමය යසසින් ද දිව්‍යමය අධිපති භාවයෙන් ද දිව්‍යමය රූපයෙන් ද දිව්‍යමය ශබ්දයෙන් ද දිව්‍යමය ගන්ධයෙන් ද දිව්‍යමය රසයෙන් ද දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් අන් දෙවියන් යටපත් කෙරෙති යි.",
                "type": "paragraph"
            },
            {
                "text": "නිදුකාණෙනි මොග්ගල්ලානයෙනි, බුදුන් සරණ යෑම මැනවි. ... නිදුකාණෙනි මොග්ගල්ලානයෙනි, දහම් සරණ යෑම මැනවි. ... නිදුකාණෙනි මොග්ගල්ලානයෙනි, සඟ සරණ යෑම මැනවි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ සඟ සරණ යෑම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ද දිව්‍යමය වර්ණයෙන් ද දිව්‍යමය සුවයෙන් ද දිව්‍යමය යසසින් ද දිව්‍යමය ආධිපත්‍යයෙන්  ද දිව්‍යමය රූපයෙන් ද දිව්‍යමය ශබ්දයෙන් ද දිව්‍යමය ගන්ධයෙන් ද දිව්‍යමය රසයෙන් ද දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් සෙසු දෙවියන් යටපත් කෙරෙතියි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "6. 1. 16.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සත්තම සක්ක සූත්‍රය",
                "level": "1"
            },
            {
                "text": "363. ඉක්බිති සක්දෙව් රජ පන්සියයක් දෙවියන් සමග ආයුෂ්මත් මහමුගලන් තෙරණුවන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් මහමුගලන් තෙරණුවන් වැඳ එකත්පස් ව සිටියේ ය. එකත්පස් ව සිටි සක්දෙව් රජුට ආයුෂ්මත් මහමුගලන් තෙරණුවෝ මෙය වදාළහ: ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "513"
            },
            {
                "text": "දේවානමින්ද, බුදුන් කෙරෙහි නො සැලෙන පැහැදීමෙන් යුතු වීම මැනවි. ඒ භගවත්හු මෙකරුණෙනුදු ... දෙවිමිනිසුන්ට ශාස්තෲහ, බුද්ධයහ, භගවත්හ යි. දේවානමින්ද, මෙසේ බුදුන් කෙරෙහි නො සැලෙන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ... දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් සෙසු දෙවියන් යටපත් කෙරෙත්. දේවානමින්ද, දහම්හි නො සැලෙන පැහැදීමෙන් යුතු වීම මැනවි. … දේවානමින්ද, සඟුන් කෙරෙහි නො සැලෙන පැහැදීමෙන් යුතු වීම මැනවි.",
                "type": "paragraph"
            },
            {
                "text": "දේවානමින්ද, නො කඩ වූ ... සමාධිය පිණිස පවත්නා ආර්‍ය්‍යකාන්ත ශීලයෙන් යුතු වීම මැනවි. දේවානමින්ද, මෙසේ ආර්‍ය්‍යකාන්ත ශීලයෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙති යි. ඔහු දිව්‍යමය ආයුෂයෙන් ද දිව්‍යමය වර්ණයෙන් ද දිව්‍යමය සුවයෙන් ද දිව්‍යමය යසසින් ද දිව්‍යමය ආධිපත්‍යයෙන් ද දිව්‍යමය රූපයෙන් ද දිව්‍යමය ශබ්දයෙන් ද දිව්‍යමය ගන්ධයෙන් ද දිව්‍යමය රසයෙන් ද දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් සෙසු දෙවියන් යටපත් කෙරෙති යි.",
                "type": "paragraph"
            },
            {
                "text": "නිදුකාණෙනි මොග්ගල්ලානයෙනි, බුදුන් කෙරෙහි නො සැලෙන පැහැදීමෙන් යුතු වීම මැනවි. ඒ භගවත්හු මෙකරුණෙනුදු ... දෙවිමිනිසුන්ට ශාස්තෲහ, බුද්ධයහ, භගවත්හ යි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ බුදුන් කෙරෙහි නො සැලෙන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ... දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණෙන් සෙසු දෙවියන් යටපත් කෙරෙති.",
                "type": "paragraph"
            },
            {
                "text": "නිදුකාණෙනි මොග්ගල්ලානයෙනි, දහම්හි නො සැලෙන පැහැදීමෙන් යුතු වීම මැනවි. භාග්‍යවතුන් වහන්සේ විසින් ධර්‍මය ස්වාඛාත ය ... නුවණැත්තන් විසින් තමතමා කෙරෙහි ලා දත යුත්තේ ය යි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ දහම්හි නො සැලෙන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ... දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් සෙසු දෙවියන් යටපත් කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "text": "නිදුකාණෙනි මොග්ගල්ලානයෙනි, සඟුන් කෙරෙහි නො සැලෙන පැහැදීමෙන් යුතු වීම මැනවි. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සඞ්ඝ තෙමේ සුප්‍රතිපන්න ය ... ලෝකයාට අනුත්තර පුණ්‍යක්ෂේත්‍රය යි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ සඟුන් කෙරෙහි නො සැලෙන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ද ... දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණෙන් සෙසු දෙවියන් යටපත් කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "515"
            },
            {
                "text": "නිදුකාණෙනි මොග්ගල්ලානයෙනි, නො කඩ වූ ... සමාධිය පිණිස පවත්නා වූ ආර්‍ය්‍යකාන්ත ශීලයෙන් යුතු වීම මැනවි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ ආර්‍ය්‍යකාන්ත ශීලයෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සග ලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ද දිව්‍යමය වර්ණයෙන් ද දිව්‍යමය සුවයෙන් ද දිව්‍යමය යසසින් ද දිව්‍යමය ආධිපත්‍යයෙන් ද දිව්‍යමය රූපයෙන් ද දිව්‍යමය ශබ්දයෙන් ද දිව්‍යමය ගන්ධයෙන් ද දිව්‍යමය රසයෙන් ද දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් සෙසු දෙවියන් යටපත් කෙරෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "6. 1. 17.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "අට්ඨම සක්‌ක සූත්‍රය",
                "level": "1"
            },
            {
                "text": "364. ඉක්බිති සක් දෙව් රජ සසියයක් දෙවියන් සමග ... ඉක්බිති සක් දෙව් රජ සත්සියයක් දෙවියන් සමග ... ඉක්බිති සක් දෙව් රජ අටසියයක් දෙවියන් සමග ... ඉක්බිති සක් දෙව් රජ අසූදහසක් දෙවියන් සමග ආයුෂ්මත් මහමුගලන් තෙරණුවන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් මහමුගලන් තෙරණුවන් වැඳ එකත්පස් ව සිටියේ ය. එකත්පස් ව සිටි සක්දෙව් රජුට ආයුෂ්මත් මහමුගලන් තෙරණුවෝ මෙය වදාළහ:",
                "type": "paragraph"
            },
            {
                "text": "දේවානමින්ද, බුදුන් කෙරෙහි නො සැලෙන පැහැදීමෙන් යුතු වීම මැනවි. ඒ භගවත්හු මෙකරුණෙනුදු අර්හත්හ, සම්මා සම්බුද්ධයහ, විජ්ජාචරණ සම්පන්නයහ, සුගතයහ, ලෝක විදූහ, අනුත්තර පුරිසදම්මසාරථීහ, දෙවිමිනිසුන්ට ශාස්තෲහ, බුද්ධයහ, භගවත්හ යි. දේවානමින්ද, මෙසේ බුදුන් කෙරෙහි නො සැලෙන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ද දිව්‍යමය වර්ණයෙන් ද දිව්‍යමය සුවයෙන් ද දිව්‍යමය යසසින් ද දිව්‍යමය ආධිපත්‍යයෙන් ද දිව්‍යමය රූපයෙන් ද දිව්‍යමය ශබ්දයෙන් ද දිව්‍යමය ගන්ධයෙන් ද දිව්‍යමය රසයෙන් ද දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් සෙසු දෙවියන් යටපත් කෙරෙති.",
                "type": "paragraph"
            },
            {
                "text": "දේවානමින්ද, දහම්හි නො සැලෙන පැහැදීමෙන් යුතු වීම මැනවි. භාග්‍යවතුන් වහන්සේ විසින් ධර්‍මය ස්වාඛාත ය, සාන්දෘෂ්ටික ය, අකාලික ය, ඒහිපස්සික ය, ඕපනයික ය, නුවණැත්තන් විසින් තමතමා කෙරෙහි ලා දත යුත්තේ ය යි. දේවානමින්ද, මෙසේ දහම්හි නො සැලෙන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සග ලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ද ... දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් සෙසු දෙවියන් යටපත් කෙරෙති.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "517"
            },
            {
                "text": "දේවානමින්ද, සඟුන් කෙරෙහි නො සැලෙන පැහැදීමෙන් යුතු වීම මැනවි. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සඞ්ඝ තෙමේ සුප්‍රතිපන්න ය, භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සඞ්ඝ තෙමේ සෘජුප්‍රතිපන්න ය, භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සඞ්ඝ තෙමේ ඤායප්‍රතිපන්න ය, භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සඞ්ඝ තෙමේ සාමීචිප්‍රතිපන්න ය, යම් මේ පුරුෂ යුග සතරෙක් වේ නම් (එහි) පුරුෂ පුද්ගලයෝ අට දෙනෙකි, භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සඞ්ඝ තෙමේ ආහුනෙය්‍යහ ය, පාහුනෙය්‍යහ ය, දක්ෂිණාර්හ ය, අඤ්ජලිකරණීයහ ය, ලෝකයාට අනුත්තර පුණ්‍යක්ෂේත්‍රය යි. දේවානමින්ද, මෙසේ සඟුන් කෙරෙහි නො සැලෙන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ද ... දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් සෙසු දෙවියන් යටපත් කෙරෙත්.දේවානමින්ද, නො කඩ වූ නො සිදුරු වූ නො කැලැල් වූ නො කබර වූ නිදහස් වූ නුවණැත්තන් විසින් පසස්නා ලද, තෘෂ්ණා දෘෂ්ටීන් නො පහස්නා ලද සමාධිය පිණිස පවත්නා ආර්‍ය්‍යකාන්ත ශීලයෙන් යුතු වීම මැනවි. දේවානමින්ද, මෙසේ ආර්‍ය්‍යකාන්ත ශීලයෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ද දිව්‍යමය වර්ණයෙන් ද දිව්‍යමය සුවයෙන් ද දිව්‍යමය යසසින් ද දිව්‍යමය ආධිපත්‍යයෙන් ද දිව්‍යමය රූපයෙන් ද දිව්‍යමය ශබ්දයෙන් ද දිව්‍යමය ගන්ධයෙන් ද දිව්‍යමය රසයෙන් ද දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් සෙසු දෙවියන් යටපත් කෙරෙති යි.",
                "type": "paragraph"
            },
            {
                "text": "නිදුකාණෙනි මොග්ගල්ලානයෙනි, බුදුන් කෙරෙහි නො සැලෙන පැහැදීමෙන් යුතු වීම මැනවි. ඒ භගවත්හු මෙකරුණෙනුදු ... දෙවිමිනිසුන්ට ශාස්තෲහ, බුද්ධයහ, භගවත්හ යි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ බුදුන් කෙරෙහි ගුණ දැන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ද ... ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් සෙසු දෙවියන් යටපත් කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "text": "නිදුකාණෙනි මොග්ගල්ලානයෙනි, දහම්හි නො සැලෙන පැහැදීමෙන් යුතු වීම මැනවි. භගවත්හු විසින් ධර්‍මය ස්වාඛාත ය ... විඥයන් විසින් තමතමා කෙරෙහි ලා දත යුත්තේ ය යි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ දහම්හි නො සැලෙන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ද ... දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් සෙසු දෙවියන් යටපත් කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "නිදුකාණෙනි මොග්ගල්ලානයෙනි, සඟුන් කෙරෙහි නො සැලෙන පැහැදීමෙන් යුතු වීම මැනවි. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සඞ්ඝ තෙමේ සුප්‍රතිපන්න ය, ... ලෝකයාට අනුත්තර පුණ්‍යක්ෂේත්‍රය යි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ සඟුන් කෙරෙහි නො සැලෙන පැහැදීමෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ද ... දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් සෙසු දෙවියන් යටපත් කෙරෙත්."
            },
            {
                "text": "නිදුකාණෙනි මොග්ගල්ලානයෙනි, නො කඩ වූ ... සමාධිය පිණිස පවත්නා ආර්‍ය්‍යකාන්ත ශීලයෙන් යුතු වීම මැනවි. නිදුකාණෙනි මොග්ගල්ලානයෙනි, මෙසේ ආර්‍ය්‍යකාන්ත ශීලයෙන් යුතු වීම හේතු කොට මෙහි ඇතැම් සත්ත්ව කෙනෙක් කාබුන් මරණින් මතු සුගති සගලොවට පැමිණෙත්. ඔහු දිව්‍යමය ආයුෂයෙන් ද දිව්‍යමය වර්ණයෙන් ද දිව්‍යමය සුවයෙන් ද දිව්‍යමය යසසින් ද දිව්‍යමය ආධිපත්‍යයෙන් ද දිව්‍යමය රූපයෙන් ද දිව්‍යමය ශබ්දයෙන් ද දිව්‍යමය ගන්ධයෙන් ද දිව්‍යමය රසයෙන් ද දිව්‍යමය ස්ප්‍රෂ්ටව්‍යයෙන් ද යන දශ කරුණින් සෙසු දෙවියන් යටපත් කෙරෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "6. 1. 18 - 25",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නන්දන සූත්‍ර",
                "level": "1"
            },
            {
                "text": "365-372 එකල්හි නන්දන දෙව්පුත් තෙමේ ... ස්ප්‍රෂ්ටව්‍යයෙන් ද (යටපත් කෙරෙති යි)",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "6. 1. 26 - 33",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුයාම සූත්‍ර",
                "level": "1"
            },
            {
                "text": "373-380 එකල්හි සුයාම දෙව්පුත් තෙමේ ... ස්ප්‍රෂ්ටව්‍යයෙන් ද (යටපත් කෙරෙති යි)",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "6.1. 34 - 41",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සන්තුසිත සූත්‍ර",
                "level": "1"
            },
            {
                "text": "381-388 එකල්හි සන්තුසිත දෙව්පුත් තෙමේ ... ස්ප්‍රෂ්ටව්‍යයෙන් ද (යටපත් කෙරෙති යි)",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "6. 1. 42 - 49",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුනිම්මිත සූත්‍ර",
                "level": "1"
            },
            {
                "text": "389-396 එකල්හි සුනිම්මිත දෙව්පුත් තෙමේ ... ස්ප්‍රෂ්ටව්‍යයෙන් ද (යටපත් කෙරෙති යි)",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "6. 1. 50 - 57",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "වසවත්ති සූත්‍ර",
                "level": "1"
            },
            {
                "text": "397-404 එකල්හි වසවත්ති දෙව්පුත් තෙමේ ... ස්ප්‍රෂ්ටව්‍යයෙන් ද (යටපත් කෙරෙති යි)",
                "type": "paragraph"
            },
            {
                "text": "(සක්ක සූත්‍ර යම්සේ නම් මේ සූත්‍රාන්ත ද එසේ විස්තර කට යුතුයි.)",
                "type": "paragraph"
            },
            {
                "text": "පළමු මොග්ගල්ලාන වර්ගය යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍ර නාමාවලිය:**",
                "type": "unindented"
            },
            {
                "text": "සවිතක්ක, අවිතක්ක, සුඛ, උපෙක්ඛා, ආකාසානඤ්චායතන, විඤ්ඤාණ්චායතන, ආකිඤ්චඤ්ඤායතන, නේවසඤ්ඤානාසඤ්ඤායතන, අනිමිත්ත ය යි සූත්‍ර නවයෙක් ද සක්ක, නන්දන, සුයාම, සන්තුසිත, සුනිම්මිත, වසවත්ති යන සයෙහි සූත්‍ර අට අට බැගින් ද වෙති යි වර්ගයෙහි ඒ සූත්‍ර මුළුල්ල සත් පනසෙක් වේ යි.",
                "type": "paragraph"
            },
            {
                "text": "මොග්ගල්ලාන සංයුත්තය නිමි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ]
    }
]