{
    "filename": "sn-5-3",
    "bookId": 20,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 260,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. සතිපට්ඨානසංයුත්තං",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. අම්බපාලිවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 1",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අම්බපාලිසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1179. එවං මෙ සුතං, එකං සමයං භගවා වෙසාලියං විහරති අම්බපාලිවනෙ. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි: ‘භික්ඛවො’ති. ‘භදන්තෙ’ති තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකායනො අයං{1} භික්ඛවෙ, මග්ගො සත්තානං විසුද්ධියා සොකපරිද්දවානං{2} සමතික්කමාය දුක්ඛදොමනස්සානං අත්ථඞ්ගමාය ඤායස්ස අධිගමාය නිබ්බානස්ස සච්ඡිකිරියාය. යදිදං චත්තාරො සතිපට්ඨානා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු වෙදනානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. චිත්තෙ චිත්තානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. එකායනො අයං භික්ඛවෙ, මග්ගො සත්තානං විසුද්ධියා සොකපරිද්දවානං සමතික්කමාය දුක්ඛදොමනස්සානං අත්ථඞ්ගමාය ඤායස්ස අධිගමාය, නිබ්බානස්ස සච්ඡිකිරියාය. යදිදං චත්තාරො සතිපට්ඨානාති. ඉදමවොච භගවා. අත්තමනා තෙ භික්ඛූ භගවතො භාසිතං අභිනන්දුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සතොසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1180. එකං සමයං භගවා වෙසාලියං විහරති අම්බපාලිවනෙ. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි -පෙ- සතො භික්ඛවෙ, භික්ඛු විහරෙය්ය සම්පජානො. අයං වො අම්හාකං අනුසාසනී. කථඤ්ච භික්ඛවෙ, භික්ඛු සතො හොති: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. එවං ඛො භික්ඛවෙ, භික්ඛු සතො හොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. එකායනවායං - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සොකපරිදෙවානං - මඡසං, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "3. සතිපට්ඨාන සංයුක්තය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "text": "1. අම්බපාලි වර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අම්බපාලි සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1179. මා විසින් මෙසේ අසන ලදී. එක්සමයෙක භාග්‍යවතුන් වහන්සේ විසල්පුර අම්බපාලි වෙනෙහි වැඩ වසන සේක. එහි දී භාග්‍යවතුන් වහන්සේ “මහණෙනි” යි භික්‍ෂූන් ඇමතූ සේක. ඒ භික්‍ෂූහු “පින්වතුන් වහන්සැ” යි භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වූහ. භාග්‍යවතුන් වහන්සේ මෙය වදාළසේක:",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "මහණෙනි, යම් මේ සතර සතිපට්ඨාන කෙනෙක් වෙත් ද, සත්ත්‍වයන්ගේ විසුද්ධිය පිණිස ශෝකපරිදේවයන් ඉක්මවීම පිණිස දුක්දොම්නස් දුරු කිරීම පිණිස න්‍යාය සංඛ්‍යාත ආර්‍ය්‍යඅෂ්ටාඞ්ගිකමාර්‍ගය අවබෝධ කිරීම පිණිස නිවන පසක් කිරීම පිණිස මේ එකම මාර්‍ගය වේ. කවර සතරෙක් ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනුව බලනසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇතිව කාලෙව්හි දැඩි ලොබ හා දොම්නස් දුරු කොට වෙසේ. විඳුම්හි විඳුම් අනුව බලනසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව විඳුම්ලෙව්හි දැඩි ලොබ හා දොම්නස දුරුකොට වෙසෙයි. සිත්හි සිත් අනු ව බලනසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව සිත් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙ යි. දහම්හි දහම් අනුව බලන සුලු ව කෙලෙස් තවන වැර ඇතිව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙයි. මහණෙනි, යම් මේ සතර සතිපට්ඨාන කෙනෙක් වෙත් නම් සත්ත්‍වයන්ගේ විසුද්ධිය පිණිස ශෝකපරිදේවයන් ඉක්මවනු පිණිස දුක්දොම්නස් දුරු කරනු පිණිස න්‍යාය අවබෝධ කරනු පිණිස නිවන පසක් කරනු පිණිස මේ එකම මාර්‍ගය”යී මෙය භාග්‍යවතුන් වහන්සේ වදාළ සේක. සතුටු සිත් ඇති ඒ භික්‍ෂූහු භාග්‍යවතුන් වහන්සේගේ දේශනාව පිළිගත්හ යි."
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සතෝ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1180. එක්කලෙක භාග්‍යවතුන් වහන්සේ විසල්පුර අම්බපාලි වෙනෙහි වැඩ වසන සේක. එහි දී භාග්‍යවතුන් වහන්සේ භික්‍ෂූන් ඇමතූ සේක ... මහණෙනි, මහණ සිහි ඇති ව මනා දැනුම් ඇති ව වෙසෙන්නේය. මේ තොපට අපගේ අනුශාසනා යි. මහණෙනි, කෙසේ නම් මහණ සිහි ඇත්තේ වේ ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනු ව බලන සුලු ව කෙලෙස් තවන වැර ඇති වැ මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙයි. … වේදනාවන්හි ... සිත්හි ... දහම්හි දහම් අනු ව බලන සුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙයි. මහණෙනි, මෙසේ මහණ සිහි ඇත්තේ වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 262,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“කථඤ්ච භික්ඛවෙ, භික්ඛු සම්පජානො හොති: ඉධ භික්ඛවෙ, භික්ඛු අභික්කන්තෙ පටික්කන්තෙ සම්පජානකාරී හොති. ආලොකිතෙ විලොකිතෙ සම්පජානකාරී හොති. සමිඤ්ජිතෙ පසාරිතෙ සම්පජානකාරී හොති. සඞ්ඝාටිපත්තචීවරධාරණෙ සම්පජානකාරී හොති. අසිතෙ පීතෙ ඛායිතෙ සායිතෙ සම්පජානකාරී හොති. උච්චාරපස්සාවකම්මෙ සම්පජානකාරී හොති. ගතෙ ඨිතෙ නිසින්නෙ සුත්තෙ ජාගරිතෙ භාසිතෙ තුණ්හීභාවෙ සම්පජානකාරී හොති. එවං ඛො භික්ඛවෙ, භික්ඛු සම්පජානකාරී හොති. සතො භික්ඛවෙ, භික්ඛු විහරෙය්ය සම්පජානො. අයං වො අම්හාකං අනුසාසනීති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භික්ඛුසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1181. අථ ඛො අඤ්ඤතරො භික්ඛු යෙන භගවා තෙනුපසඞ්කමි. -පෙ- එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච: “සාධු මෙ භන්තෙ, භගවා සඞ්ඛිත්තෙන ධම්මං දෙසෙතු, යමහං භගවතො ධම්මං සුත්වා එකො වූපකට්ඨො අප්පමත්තො ආතාපී පහිතත්තො විහරෙය්යන්ති”. එවමෙව පනිධෙකච්චෙ මොඝපුරිසා මමෙව{1} අජ්ඣෙසන්ති ධම්මෙ ච භාසිතෙ මමෙව අනුබන්ධිතබ්බං මඤ්ඤන්තීති: “දෙසෙතු මෙ භන්තෙ, භගවා සඞ්ඛිත්තෙන ධම්මං, දෙසෙතු සුගතො සඞ්ඛිත්තෙන ධම්මං, අප්පෙවනාමාහං භගවතො භාසිතස්ස අත්ථං ආජානෙය්යං, අප්පෙවනාමාහං භගවතො භාසිතස්ස දායාදො අස්සන්ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්මාතිහ ත්වං භික්ඛු, ආදිමෙව විසොධෙහි කුසලෙසු ධම්මෙසු. කො ච ආදි කුසලානං ධම්මානං: සීලඤ්ච සුවිසුද්ධං, දිට්ඨි ච උජුකා. යතො ඛො තෙ භික්ඛු, සීලං සුවිසුද්ධං භවිස්සති, දිට්ඨි ච උජුකා, තතො ත්වං භික්ඛු, සීලං නිස්සාය සීලෙ පතිට්ඨාය චත්තාරො සතිපට්ඨානෙ තිවිධෙන භාවෙය්යාසි. කතමෙ චත්තාරො: ඉධ ත්වං භික්ඛු, අජ්ඣත්තං{2} කායෙ කායානුපස්සී විහරාහි ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. බහිද්ධා{3} කායෙ කායානුපස්සී විහරාහි ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. අජ්ඣත්තබහිද්ධා{4} කායෙ කායානුපස්සී විහරාහි ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣා දොමනස්සං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. මඤ්චෙව - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අජ්ඣත්තං වා - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. බහිද්ධා වා - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. අජ්ඣත්තං බහිද්ධා - සී. මු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මහණ කෙසේ නම් මනා දැනුම් ඇත්තේ වේද යත්: මහණෙනි, මෙහි මහණ ඉදිරිගමන්හි ද පෙරළා ගමන්හි ද මනා දැනුම් ඇති ව කරනසුලු වෙයි. ඉදිරිබැලුම්හි ද අවට බැලුම්හි ද මනා දැනුම් ඇතිව කරන සුලු වෙයි. (අත්පා) හැකිළීමෙහි දිග හැරීමෙහි මනා දැනුම් ඇති ව කරන සුලු වෙයි. සඟළ පාසිවුරු දැරීමෙහි මනා දැනීම් ඇති ව කරනසුලු වෙයි. බිදීමෙහි පීමෙහි කෑමෙහි රස විඳුමෙහි මනා දැනුම් ඇති ව කරන සුලු වෙයි. මලමූ කම්හි මනා දැනුම් ඇති ව කරන සුලු වෙයි. ගමන්හි සිටුම්හි හිඳුම්හි නිඳුම්හි නිදි වැරුම්හි බිණුම්හි නිසදබැව්හි මනා දැනුම් ඇති ව කරනසුලු වෙයි. මහණෙනි, මෙසේ මහණ මනා දැනුම් ඇත්තේ වෙයි. මහණෙනි, මහණ සිහි ඇති ව මනා දැනුම ඇති ව වෙසෙන්නේය. මේ තොපට අපගේ අනුශාසනයයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භික්ඛු සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1181. එකල්හි එක්තරා මහණෙක් භාග්‍යවතුන් වහන්සේ කරා එළඹියේ ය ... එකත්පසෙක හුන් ඒ මහණ භාග්‍යවතුන් වහන්සේට මෙය සැලකෙළේය: වහන්ස, මම භාග්‍යවතුන් වහන්සේගේ යම් දහමක් අසා එකලා වූයෙම් ගණයා කෙරෙන් වෙන් වූයෙම් නොපමා වූයෙම් කෙලෙස් තවන වැර ඇතියෙම් නිවන් පිණිස මෙහෙයූ සිත් ඇතියෙම් වෙසෙන්නෙම් නම් එබඳු දහමක් මට සැකෙවින් දෙසන සේක්වා යි. මෙහි ඇතැම් හිස් පුරුෂයෝ මෙසේ ම මට ආරාධනා කෙරෙත්. දහම් දෙසූ කල්හි මා ම ලුහුබැඳිය යුතු කොට හඟිති යි. වහන්ස, භාග්‍යවතුන් වහන්සේ සැකෙවින් මට දහම් දෙසන සේක්වා. සුගතයන් වහන්සේ සැකෙවින් මට දහම් දෙසන සේක්වා. මම භාග්‍යවතුන් වහන්සේගේ දහම් අරුත දැනගන්නෙම් නම් ඉතා යෙහෙකැ. මම භාග්‍යවතුන් වහන්සේගේ ශාසනය පිළිබඳ දායාදයෙක් වන්නෙම් නම් ඉතා යෙහෙකැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, එසේ නම් තෙපි කුසල්දහම්හි මුල ම පිරිසිදු කරවු. කුසල් දහමුන්ගේ මුල කවරේද යත්: ඉතා පිරිසිදු ශීලයත් ඍජු වූ දෘෂ්ටියත්ය. මහණ, යම් කලෙක තොපගේ ශීලය ඉතා පිරිසිදු වන්නේ ද, දෘෂ්ටියත් ඍජු වන්නී ද එකල්හි මහණ තෙපි ශීලය ඇසුරු කොට ශීලයෙහි පිහිටා සතර සීවටන් තුන් අයුරෙකින් වඩන්නහු ය. කවර සිවුදෙනෙක් ද යත්: මහණ මෙහි තෙපි සිය කයෙහි කය අනු ව බලනසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙ වු. මෙරමා කයෙහි කය අනුව බලනසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇතිව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරුකොට වෙසෙවු. සිය මෙරමාකයෙහි කය අනුව බලමින් කෙලෙස් තවන වැර ඇතිව මනා දැනු ම් ඇතිව සිහි ඇති ව කය ලෝකයෙහි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙවු.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 264,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අජ්ඣත්තං වෙදනාසු -පෙ- බහිද්ධා වෙදනාසු -පෙ- අජ්ඣත්තබහිද්ධා වෙදනාසු වෙදනානුපස්සී විහරාහි -පෙ- අජ්ඣත්තං චිත්තෙ -පෙ- බහිද්ධා චිත්තෙ -පෙ- අජ්ඣත්තබහිද්ධා චිත්තෙ චිත්තානුපස්සී විහරාහි -පෙ- අජ්ඣත්තං ධම්මෙසු -පෙ- බහිද්ධා ධම්මෙසු -පෙ- අජ්ඣත්තබහිද්ධා ධම්මෙසු ධම්මානුපස්සී විහරාහි ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. යතො ඛො ත්වං භික්ඛු, සීලං නිස්සාය සීලෙ පතිට්ඨාය ඉමෙ චත්තාරො සතිපට්ඨානෙ එවං තිවිධෙන භාවෙස්සසි, තතො තුය්හං භික්ඛු, යා රත්ති වා දිවසො වා ආගමිස්සති වුද්ධියෙව පාටිකඞ්ඛා කුසලෙසු ධම්මෙසු නො පරිහානීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො සො භික්ඛු භගවතො භාසිතං අභිනන්දිත්වා අනුමොදිත්වා උට්ඨායාසනා භගවන්තං අභිවාදෙත්වා පදක්ඛිණං කත්වා පක්කාමි. අථ ඛො සො භික්ඛු එකො වූපකට්ඨො අප්පමත්තො ආතාපී පහිතත්තො විහරන්තො න චිරස්සෙව යස්සත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජන්ති, තදනුත්තරං බ්රහ්මචරියපරියොසානං සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහාසි. ඛීණා ජාති, වුසිතං බ්රහ්මචරියං, කතං කරණීයං, නාපරං ඉත්ථත්තායාති අබ්භඤ්ඤාසි. අඤ්ඤතරො ච පන සො භික්ඛු අරහතං අහොසීති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සාලාසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1182. එවං මෙ සුතං. එකං සමයං භගවා කොසලෙසු විහරති සාලායං{1} බ්රාහ්මණගාමෙ. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි{2}. යෙ තෙ භික්ඛවෙ, භික්ඛූ නවා අචිරපබ්බජිතා අධුනාගතා ඉමං ධම්මවිනයං, තෙ වො{3} භික්ඛවෙ, භික්ඛූ චතුන්නං සතිපට්ඨානානං භාවනාය සමාදපෙතබ්බා, නිවෙසෙතබ්බා පතිට්ඨාපෙතබ්බා. කතමෙසං චතුන්නං: එථ තුම්හෙ ආවුසො, කායෙ කායානුපස්සිනො විහරථ, ආතාපිනො සම්පජානා එකොදිභූතා විප්පසන්නචිත්තා සමාහිතා එකග්ගචිත්තා කායස්ස යථාභූතං ඤාණාය. වෙදනාසු වෙදනානුපස්සිනො විහරථ, ආතාපිනො සම්පජානා එකොදිභූතා විප්පසන්නචිත්තා සමාහිතා එකග්ගචිත්තා, වෙදනානං යථාභූතං ඤාණාය. චිත්තෙ චිත්තානුපස්සිනො විහරථ ආතාපිනො සම්පජානා එකොදිභූතා විප්පසන්නචිත්තා සමාහිතා එකග්ගචිත්තා චිත්තස්ස යථාභූතං ඤාණාය. ධම්මෙසු ධම්මානුපස්සිනො විහරථ, ආතාපිනො සම්පජානා එකොදිභූතා විප්පසන්නචිත්තා සමාහිතා එකග්ගචිත්තා ධම්මානං යථාභූතං ඤාණාය."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සාලාය - මඡසං, කොසලායං - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ආමන්තෙසි -පෙ- - එතදවොච - මඡසං., ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. තෙ වෙ - සී 1, 2."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "සිය වේදනාවන්හි … මෙරමා වේදනාවන්හි … සිය මෙරමා වේදනාවන්හි වේදනා අනුව බලනසුලු ව වෙසෙ වු ... සිය සිත්හි … මෙරමා සිත්හි … සිය මෙරමා සිත්හි සිත් අනුව බලනසුලු ව වෙසෙවු ... සිය දහම්හි ... මෙරමා දහම්හි … සිය මෙරමා දහම්හි දහම් අනු ව බලන සුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙවු. මහණ, යම් කලෙක තෙපි සීලය ඇසුරු කොට සීලයෙහි පිහිටා මේ සිවු සීවටන් මෙසේ තුන් අයුරෙන් වඩන්නහු නම් මහණ එකල්හි තොපට යම් රැයෙක් හෝ දවාලෙක් හෝ පැමිණෙන්නේ නම් කුසල්දහම්හි වැඩීමෙක් ම කැමති වියයුතු. පිරිහීමෙක් නොකැමැති වියයුතු.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉක්බිති ඒ මහණ භාග්‍යවතුන් වහන්සේගේ දේශනාව පිළිගෙන අනුමෝදන් ව හුනස්නෙන් නැගී භාග්‍යවතුන් වහන්සේ වැඳ පැදකුණු කොට ගියේ ය. එකල්හි ඒ මහණ එකලා ව ගණයා කෙරෙන් වෙන් වූයේ නොපමා ව කෙලෙස් තවන වැර ඇත්තේ නිවන් පිණිස මෙහෙයූ සිත් ඇති ව වෙසෙන්නේ නොබෝ කලකින් ම කුලපුත්තු යමක් පිණිස මැනවින් ම ගිහිගෙන් නික්ම සස්නෙහි පැවිදි වෙද්ද, මඟබඹසර කෙළවර වූ ඒ අනුත්තර අර්‍හත්ත්‍වය තෙමේ ම වෙසෙස්නුවණින් පසක් කොට ඊට පැමිණ විසී ය. ඉපැද්ම ගෙවිණ. බඹසර වැස නිමවන ලදී. කටයුතු කරන ලදී, මේ බැව් පිණිස අනෙකක් නැතැ යි දැනගත්තේ ය. ඒ මහණ රහතුන් අතුරෙන් එක්තරා කෙනෙක් ද වී යයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සාලා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1182. මා විසින් මෙසේ අසන ලදී. එක්කලෙක භාග්‍යවතුන් වහන්සේ කොසොල් දනව්වෙහි සාලා නම් බමුණුගම්හි වැඩවසන සේක. එහි දී භාග්‍යවතුන් වහන්සේ භික්‍ෂූන් ඇමතූ සේක: මහණෙනි, අලුත පැවිදි වූ ළඟ දී මෙසස්නට පැමිණි යම් ඒ නවක භික්‍ෂූහු වෙත් නම් මහණෙනි, ඒ භික්‍ෂූහු තොප විසින් සිවුසීවටන් වඩනු පිණිස සමාදන් කරවිය යුතුවහ. වැස්වියයුතුවහ. පිහිටුවියයුතුවහ. කවර සතරක් ද යත්: ඇවැත්නි, එව තෙපි කයෙහි කය අනු ව බලනසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව එකඟ සිත් ඇති ව වෙසෙසින් පහන් සිත් ඇති ව කය තතුසේ දැනුම පිණිස සමාහිත ව ඒකාග්‍රචිත්ත ව වෙසෙවු. විඳුම්හි විඳුම් අනුව බලනසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව එකඟසිත් ඇති ව වෙසෙසින් පහන් සිත් ඇති ව වේදනාවන් තතුසේ දැනුම පිණිස සමාහිත ව ඒකාග්‍රචිත්ත ව වෙසෙවු. සිත්හි සිත් අනුව බලනසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව එකඟසිත් ඇති ව වෙසෙසින් පහන් සිත් ඇති ව සිත තතුසේ දැනුම පිණිස සමාහිත ව ඒකාග්‍රචිත්ත ව වෙසෙ වු. දහම්හි දහම් අනුව බලනසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව එකඟ සිත් ඇති ව වෙසෙසින් පහන් සිත් ඇති ව දහම් තතුසේ දැනුම පිණිස සමාහිත ව ඒකාග්‍රචිත්ත ව වෙසෙවු.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 266,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යෙ’පි තෙ භික්ඛවෙ, භික්ඛූ සෙඛා අප්පත්තමානසා අනුත්තරං යොගක්ඛෙමං පත්ථයමානා විහරන්ති. තෙ’පි කායෙ කායානුපස්සිනො විහරන්ති, ආතාපිනො සම්පජානා එකොදිභූතා විප්පසන්නචිත්තා සමාහිතා එකග්ගචිත්තා කායස්ස පරිඤ්ඤාය. වෙදනාසු වෙදනානුපස්සිනො විහරන්ති -පෙ- වෙදනානං{1} පරිඤ්ඤාය. චිත්තෙ චිත්තානුපස්සිනො විහරන්ති -පෙ- චිත්තස්ස පරිඤ්ඤාය; ධම්මෙසු ධම්මානුපස්සිනො විහරන්ති ආතාපිනො සම්පජානා එකොදිභූතා විප්පසන්නචිත්තා සමාහිතා එකග්ගචිත්තා ධම්මානං පරිඤ්ඤාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "යෙ’පි තෙ භික්ඛවෙ, භික්ඛූ අරහන්තො ඛීණාසවා වුසිතවන්තො කතකරණීයා ඔහිතභාරා අනුප්පත්තසදත්ථා පරික්ඛීණභවසංයොජනා සම්මදඤ්ඤාවිමුත්තා. තෙ’පි කායෙ කායානුපස්සිනො විහරන්ති, ආතාපිනො සම්පජානා එකොදිභූතා විප්පසන්නචිත්තා සමාහිතා එකග්ගචිත්තා කායෙන විසංයුත්තා. වෙදනාසු වෙදනානුපස්සිනො විහරන්ති -පෙ- වෙදනාහි විසංයුත්තා. චිත්තෙ චිත්තානුපස්සිනො විහරන්ති -පෙ- චිත්තෙන විසංයුත්තා. ධම්මෙසු ධම්මානුපස්සිනො විහරන්ති ආතාපිනො සම්පජානා එකොදිභූතා විප්පසන්නචිත්තා සමාහිතා එකග්ගචිත්තා ධම්මෙහි විසංයුත්තා. යෙ’පි තෙ භික්ඛවෙ, භික්ඛූ නවා අචිරපබ්බජිතා අධුනාගතා ඉමං ධම්මවිනයං, තෙ වො භික්ඛවෙ, භික්ඛූ ඉමෙසං චතුන්නං සතිපට්ඨානානං භාවනාය සමාදපෙතබ්බා නිවෙසෙතබ්බා පතිට්ඨාපෙතබ්බාති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කුසලරාසිසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1183. අකුසලරාසීති භික්ඛවෙ, වදමානො{1} පඤ්චනීවරණෙ සම්මා වදමානො වදෙය්ය. කෙවලොහ’යං භික්ඛවෙ, අකුසලරාසි යදිදං පඤ්ච නීවරණා. කතමෙ පඤ්ච: කාමච්ඡන්දනීවරණං බ්යාපාදනීවරණං ථීනමිද්ධනීවරණං උද්ධච්චකුක්කුච්චනීවරණං විචිකිච්ඡානීවරණං. අකුසලරාසීති භික්ඛවෙ, වදමානො ඉමෙ පඤ්චනීවරණෙ සම්මා වදමානො වදෙය්ය. කෙවලොහ’යං භික්ඛවෙ, අකුසලරාසි, යදිදං පඤ්ච නීවරණා."
                    },
                    {
                        "type": "paragraph",
                        "text": "කුසලරාසීති භික්ඛවෙ, වදමානො චත්තාරො සතිපට්ඨානෙ සම්මා වදමානො වදෙය්ය. කෙවලොහ’යං භික්ඛවෙ, කුසලරාසි. යදිදං චත්තාරො සතිපට්ඨානා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති, ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. කුසලරාසීති භික්ඛවෙ, වදමානො ඉමෙ චත්තාරො සතිපට්ඨානෙ සම්මා වදමානො වදෙය්ය. කෙවලොහ’යං භික්ඛවෙ, කුසලරාසි යදිදං චත්තාරො සතිපට්ඨානාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. වෙදනා - සී 1, 2."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, යම් ඒ භික්‍ෂු කෙනෙක් ශෛක්‍ෂ වූවාහු නොපැමිණි රහත්බව ඇත්තාහු අනුත්තරයෝගක්‍ෂේමය (නිවන) පතමින් වෙසෙත් ද, ඔහුත් කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව එකඟසිත් ඇතිව වෙසෙසින් පහන්සිත් ඇති ව කය පිරිසිඳ දැනීම පිණිස සමාහිත ව ඒකාග්‍රචිත්ත ව වෙසෙත්. විඳුම්හි විඳුම් අනුව බලනසුලු ව … විඳුම් පිරිසිඳ දැනීම පිණිස වෙසෙත්. සිත්හි සිත් අනුව බලනසුලු ව … සිත් පිරිසිඳ දැනුම පිණිස වෙසෙත්. දහම්හි දහම් අනු ව බලනසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇතිව එකඟසිත් ඇති ව වෙසෙසින් පහන්සිත් ඇති ව දහම් පිරිසිඳ දැනීම පිණිස සමාහිත ව ඒකාග්‍රචිත්ත ව වෙසෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, රහත් වූ ක්‍ෂීණ වූ ආශ්‍රව ඇති වැස නිමවූ බඹසර ඇති කළ කටයුතු ඇති බහා තැබූ බර ඇති පිළිවෙළින් පැමිණිස්වාත්‍ථි සඞ්ඛ්‍යාත අර්‍හත්ත්‍වය ඇති ක්‍ෂය කළ භවසංයෝජන ඇති මැනවින් දැන මිදුණු යම් ඒ මහණ කෙනෙකුත් වෙත් නම් ඔහුත් කයෙහි කය අනු ව දක්නා සුලු ව වැර ඇති ව මනා දැනුම් ඇති ව එකඟ වූ සිත් ඇති ව වෙසෙසින් පහන් සිත් ඇති ව සමාහිත ව ඒකාග්‍රචිත්ත ව කයින් වෙන් ව වෙසෙත්. විඳුම්හි විඳුම් අනුව බලනසුලු ව … විඳුමින් වෙන් ව වෙසෙත්. සිත්හි සිත් අනුව බලනසුලු ව … සිතින් වෙන් ව වෙසෙත්. දහම්හි දහම් අනු ව බලනසුලු ව වැර ඇති ව මනා දැනුම් ඇති ව එකඟසිත් ඇති ව වෙසෙසින් පහන්සිත් ඇති ව සමාහිත ව ඒකාග්‍රචිත්ත ව දහමින් වෙන් ව වෙසෙත්. මහණෙනි, යම් ඒ මහණ කෙනෙක් නවක ද, අලුත පැවිදි වූවාහු ද, මෙසස්නට ළඟ දී පැමිණියාහු ද මහණෙනි, ඔහු තොප විසින් සිවුසීවටන් වඩනු පිණිස සමාදන් කරවියයුතුවහ. වැස්වියයුතුවහ. පිහිටුවියයුතුවහ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කුසලරාසි සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1183. මහණෙනි, අකුසලරැසැ යි කියන්නෙක් මැනවින් කියන්නේ පඤ්චනීවරණ කියන්නේ ය. මහණෙනි, යම් මේ පඤ්ච නීවරණයෝ වෙත් නම් මහණෙනි, මේ හුදු අකුසල්රැසෙකි. කවර පසෙක්ද යත්: කාමච්ඡන්‍දනීවරණ යැ ව්‍යාපාදනීවරණ යැ ථීනමිද්ධනීවරණ යැ උද්ධච්චකුක්කුච්චනීවරණ යැ විචිකිච්ඡානීවරණ යි. මහණෙනි, අකුසල්රැසැ යි කියන්නෙක් මැනවින් කියන්නේ මේ පඤ්චනීවරණකියන්නේ ය. මහණෙනි, යම් මේ පඤ්ච නීවරණයෝ වෙත් නම් මේ හුදු අකුසල්රැස යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කුසල්රැසැ යි කියන්නෙක් මැනවින් කියන්නේ සිවුසීවටන් කියන්නේ ය. මහණෙනි, යම් මේ සිවුසීවටන් වේ නම් මේ හුදු කුසල් රැසෙකි. කවර සතරෙක්ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇතිව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. විඳුම්හි … සිත්හි… දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරුකොට වෙසේ. මහණෙනි, කුසල්රැසැ යි කියන්නෙක් මැනවින් කියන්නේ මේ සිවුසීවටන් කියන්නේ ය. මහණෙනි, යම් මේ සිවුසීවටන් වේ නම් මේ හුදු කුසල්රැස යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 268,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 1. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සකුණග්ඝිසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1184. භූතපුබ්බං භික්ඛවෙ, සකුණග්ඝි ලාපං සකුණං සහසා අජ්ඣප්පත්තා අග්ගහෙසි. අථ ඛො භික්ඛවෙ, ලාපො සකුණො සකුණග්ඝියා හරියමානො එවං හි පරිදෙවෙසි: “මයමෙවම්හා{1} අලක්ඛිකා. මයං අප්පපුඤ්ඤා, යෙ මයං අගොචරෙ චරිම්හා{2} පරවිසයෙ. සචජ්ජ මයං ගොචරෙ චරෙය්යාම සකෙ පෙත්තිකෙ විසයෙ, නචායං{3} සකුණග්ඝි අලං අභවිස්ස යදිදං යුද්ධායා”ති. කො පන තෙ ලාප ගොචරො සකො පෙත්තිකො විසයොති. යදිදං නඞ්ගලකට්ඨකරණං ලෙඩ්ඩුට්ඨානන්ති. අථ ඛො භික්ඛවෙ, සකුණග්ඝි සකෙ බලෙ අපත්ථද්ධා සකෙ බලෙ අවචමානා{4} අමුඤ්චි, ගච්ඡ ඛො ත්වං ලාප, තත්ථාපි මෙ ගන්ත්වා න මොක්ඛසීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භික්ඛවෙ, ලාපො සකුණො නඞ්ගලකට්ඨකරණං ලෙඩ්ඩුට්ඨානං ගන්ත්වා මහන්තං ලෙඩ්ඩුං අභිරූහිත්වා සකුණග්ඝිං අවචමානො{5} අට්ඨාසි, එහි ඛොදානි{6} සකුණග්ඝි, එහි ඛො{6}දානි සකුණග්ඝීති. අථ ඛො සා භික්ඛවෙ, සකුණග්ඝි සකෙ බලෙ අපත්ථද්ධා සකෙ බලෙ අවචමානා උභො පක්ඛෙ සන්ධාය{8} ලාපං සකුණං සහසා අජ්ඣප්පත්තා. යදා ඛො භික්ඛවෙ, අඤ්ඤාසි ලාපො සකුණො බහුආගතා{9} ඛො ම්යා’යං සකුණග්ඝීති, අථ තස්සෙව ලෙඩ්ඩුස්ස අන්තරං පච්චුපාදි. අථ ඛො භික්ඛවෙ, සකුණග්ඝි තත්ථෙව උරං පච්චතාළෙසි. එවං හෙ’තං{10} භික්ඛවෙ, හොති යො අගොචරෙ චරති පරවිසයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්මාතිහ භික්ඛවෙ, මා අගොචරෙ චරිත්ථ පරවිසයෙ. අගොචරෙ භික්ඛවෙ, චරතං පරවිසයෙ ලච්ඡති මාරො ඔතාරං, ලච්ඡති මාරො ආරම්මණං. කො ච භික්ඛවෙ, භික්ඛුනො අගොචරො පරවිසයො: යදිදං පඤ්ච කාමගුණා. කතමෙ පඤ්ච: චක්ඛුවිඤ්ඤෙය්යා රූපා ඉට්ඨා කන්තා මනාපා පියරූපා කාමූපසංහිතා රජනීයා. සොතවිඤ්ඤෙය්යා සද්දා -පෙ- ඝානවිඤ්ඤෙය්යා ගන්ධා -පෙ- ජිව්හාවිඤ්ඤෙය්යා රසා -පෙ- කායවිඤ්ඤෙය්යා ඵොට්ඨබ්බා ඉට්ඨා කන්තා මනාපා පියරූපා කාමූපසංහිතා රජනීයා. අයං භික්ඛවෙ, භික්ඛුනො අගොචරො පරවිසයො."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. මයමෙවම්හ - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. චරිම්හ - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. නම්යායං - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. අසංවදමානා - මඡසං, අවාදමානා - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. වදමානො - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "6. දනිමෙ - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "8. සන්නය්හ - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "9. බහුං ආගතා - සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "10. හිතං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 1. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සකුණග්ඝි සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1184. මහණෙනි, පෙර ගිජුලිහිණියක් සැහැසිකමින් පැමිණ කැට කුරුල්ලකු අල්ලා ගත්තා ය. මහණෙනි, එකල්හි කැට කුරුලු තෙමේ ගිජුලිහිණිය විසින් හැර ගෙන යනු ලබන්නේ මෙසේ හැඬී ය: යම්බඳු අපි අගෝචර වූ අනුන් අයත් විෂයෙහි හැසුරුණමෝ නම් (ඒ) අපි ම කාලකන්නි වම්හ. අපි ම පින් නැත්තම්හ. ඉදින් අපි ගොදුරු වූ සිය පියසතු විෂයෙහි හැසුරුණමෝ නම් මේ ගිජුලිහිණි මේ යුද්ධයට නො ද සමත් වන්නී ය යි. එම්බල කැටකුරුල්ල තාගේ ගොදුරු වූ සියපියසතු විෂය කිමෙක් දැ”යි. නඟුලෙන් සාන ලද කෙතෙහි කැට නැඟි තැනයි. මහණෙනි, එකල්හි ගිජුලිහිණි සිය බලයෙහි තද ව සිට සියබලය වනමින් එම්බල කැටකුරුල්ල, තෝ යා, එහි ද ගොස් මාගෙන් නො මිදෙන්නේ යැ යි මිදුවා ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ඉක්බිති කැටකුරුලු තෙමේ නඟුලෙන් සාන ලද කැට නැඟි තැනකට ගොස් මහත් කැටකට නැඟ “ගිජුලිහිණිය, දැන් එව, ගිජුලිහිණිය, දැන් එව” යි ගිජුලිහිණියට කියමින් සිටියේ ය. මහණෙනි, එකල්හි ඒ ගිජුලිහිණි සියබලයෙහි තද කොට සිටගෙන සියබලය වනමින් දෙපියාපත් නඟා කැටකුරුල්ලා වෙත සැහැසි කමින් පැමිණියා ය. මහණෙනි, යම් කලෙක කැටකුරුලු තෙමේ ගිජුලිහිණි මා පිණිස බොහෝ දුර ආවා යි දැන ගත්තේ නම් එකල්හි ඒ කැටෙහි ම ඇතුළට පිවිසියේ ය. මහණෙනි, එකල ගිජුලිහිණිය එහි ම ළය තළාගත්තා ය. මහණෙනි, යමෙක් අගෝචර වූ මෙරමා අයත් විෂයෙහි හැසිරේ නම් එය මෙසේ ම වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එහෙයින් මෙහි ලා අගෝචර වූ මෙරමා අයත් විෂයයෙහි නහමක් හැසිරෙවු. මහණෙනි, අගෝචර වූ මෙරමා අයත් විෂයෙහි හැසිරෙන්නවුන් පිළිබඳව මරු අවකාශ ලබන්නේ ය. මරු අරමුණක් ලබන්නේ ය. මහණෙනි, මහණහට අගෝචර වූ මෙරමා අයත් විෂය කිමෙක්ද යත්: මේ පඤ්චකාමගුණයෝ යි. කවර පසෙක් ද යත්: ඉටුකැමති මනවඩන පියදෑ වූ කාමයෙන් යුත් ඇලුම් කටයුතු ඇසින් දතයුතු රූපයෝ යැ… කනින් දතයුතු ශබ්දයෝ යැ … නැහැයෙන් දතයුතු ගන්‍ධයෝ යැ … දිවෙන් දත යුතු රසයෝ යැ. ඉටු කැමති මන වඩන පියදෑ වූ කාමයෙන් යුත් ඇලුම් කටයුතු කයින් දතයුතු ස්පර්‍ශයෝ යි. මහණෙනි, මේ මහණහට අගෝචර වූ මෙරමා අයත් විෂය යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 270,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ගොචරෙ භික්ඛවෙ, චරථ සකෙ පෙත්තිකෙ විසයෙ. ගොචරෙ භික්ඛවෙ, චරතං සකෙ පෙත්තිකෙ විසයෙ න ලච්ඡති මාරො ඔතාරං, න ලච්ඡති මාරො ආරම්මණං. කො ච භික්ඛවෙ, භික්ඛුනො ගොචරො සකො පෙත්තිකො විසයො, යදිදං චත්තාරො සතිපට්ඨානා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං අයං භික්ඛවෙ, භික්ඛුනො ගොචරො සකො පෙත්තිකො විසයොති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මක්කටසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1185. අත්ථි භික්ඛවෙ, හිමවතො පබ්බතරාජස්ස දුග්ගා විසමා දෙසා, යත්ථ නෙව මක්කටානං චාරී න මනුස්සානං. අත්ථි භික්ඛවෙ, හිමවතො පබ්බතරාජස්ස දුග්ගා විසමා දෙසා යත්ථ මක්කටානඤ්හි ඛො චාරී න මනුස්සානං. අත්ථි භික්ඛවෙ, හිමවතො පබ්බතරාජස්ස සම භූමිභාගා රමණීයා, යත්ථ මක්කටානං චෙව චාරී මනුස්සානඤ්ච. තත්ර භික්ඛවෙ, ලුද්දා මක්කටවීථීසු ලෙපං ඔඩ්ඩෙන්ති මක්කටානං බාධනාය. තත්ර භික්ඛවෙ, යෙ තෙ මක්කටා අබාලජාතිකා{1} අලොලජාතිකා{1} තෙ තං ලෙපං දිස්වා ආරකා පරිවජ්ජෙන්ති{3}. යො පන සො හොති මක්කටො බාලජාතිකො ලොලජාතිකො සො තං ලෙපං උපසඞ්කමිත්වා හත්ථෙන ගණ්හාති. සො තත්ථ බජ්ඣති. හත්ථං මොචෙස්සාමීති දුතියෙන හත්ථෙන ගණ්හාති, සො තත්ථ බජ්ඣති. උභො හත්ථෙ මොචෙස්සාමීති පාදෙන ගණ්හාති, සො තත්ථ බජ්ඣති. උභො හත්ථෙ මොචෙස්සාමි පාදං චාති{4} දුතියෙන පාදෙන ගණ්හාති, සො තත්ථ බජ්ඣති. උභො හත්ථෙ මොචෙස්සාමි පාදෙ චාති තුණ්ඩෙන ගණ්හාති, සො තත්ථ බජ්ඣති. එවං හි සො භික්ඛවෙ, මක්කටො පඤ්චඩ්ඩිතො ථනං{5} සෙති අනයං ආපන්නො ව්යසනං ආපන්නො යථාකාමකරණීයො ලුද්දස්ස. තමෙනං භික්ඛවෙ, ලුද්දො විජ්ඣිත්වා{6} තස්මිං යෙව මක්කටං උද්ධරිත්වා අවිස්සජ්ජෙත්වා{7} යෙන කාමං පක්කමති. එවං හි{8} තං භික්ඛවෙ, හොති යො අගොචරෙ චරති පරවිසයෙ."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ජාතියං - සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "3. පරිවජ්ජන්ති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. පාදං වාති - සීමූ, සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "5. පඤ්චොඩ්ඩිතො ථුනං - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "6. ඣුත්වා - සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "7. තස්මිං යෙව කට්ඨකතඞ්ගාරෙ අවස්සජ්ජෙත්වා - මඡසං. තස්මිං යෙව මක්කටං උද්ධරිතතා ආවජ්ජෙත්වා - සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "8. එවං හෙතං - මඡසං, එවං හෙතං - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, ගෝචර වූ සිය පියසතු විෂයෙහි හැසිරෙවු. මහණෙනි, ගෝචර වූ සිය පියසතු විෂයෙහි හැසිරෙන්නවුන් පිළිබඳව මරු අවකාශයක් නො ලබන්නේ ය. මරු අරමුණක් නොලබන්නේ ය. මහණෙනි, මහණහට ගෝචර වූ සිය පියසතු විෂය කිමෙක්ද යත්: මේ සිවු සීවටන්හු යි. කවර සතරෙක් ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනු ව බලනසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙයි. විඳුම්හි … සිත්හි ... දහම්හි දහම් අනුව දක්නා සුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙයි. මහණෙනි, මේ මහණහට ගෝචර වූ සිය පියසතු විෂය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මක්කට සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1185. මහණෙනි, යම් තැනෙක වඳුරන්ගේත් හැසිරීමෙක් නො වේ ද, මිනිසුන්ගේත් හැසිරීමෙක් නොවේ ද, හිමවත් පවුරදුගේ (එබඳු) යා නොහැකි විසම පෙදෙස් ඇත. මහණෙනි, යම්තැනෙක වඳුරන්ගේ හැසිරීමෙක් වේ ද, මිනිසුන්ගේ හැසිරීමෙක් නො වේ ද, හිමවත් පවුරදුගේ එබඳු යා නොහැකි විසම පෙදෙස් ද ඇත. මහණෙනි, යම් පෙදෙසක වඳුරන්ගේ හැසිරීමත් වේ ද, මිනිසුන්ගේ හැසිරීමත් වේ ද, හිමවත් පවුරදුගේ එබඳු සිත්කලු සමබිම් පෙදෙස් ද ඇත. මහණෙනි, එහි වැද්දෝ වඳුරුමංහි වඳුරන් නසන පිණිස වඳුරුලහටු ගල්වා තබත්. මහණෙනි, එහි යම් ඒ වඳුරුකෙනෙක් බාලගති නැත්තාහු ද ලොල්ගති නැත්තාහු ද ඔහු ඒ ලහටු දැක දුරින් දුරු කෙරෙත්. යම් ඒ වඳුරෙක් බාලගති ඇත්තේ ලොල්ගති ඇත්තේ වේ නම් හේ ඒ ලහටු කරා එළඹ අතින් ගනී. හේ එහි බැඳේ. අත මුදන්නෙමි යි දෙවැනි අතින් ගනී. හේ එහි බැඳේ. දෑත මුදන්නෙමි යි පයින් ගනී. හේ එහි බැඳේ. දෑතත් පයත් මුදන්නෙමි යි දෙවැනි පයින් ගනී. හේ එහි බැඳේ. දෑතත් දෙපයත් මුදන්නෙමි යි තුඩින් ගනී. හේ එහි බැඳේ. මහණෙනි, මෙසේ ඒ වඳුරා පස්තැනෙකින් එල්ලන ලද්දේ අනයට පැමිණියේ ව්‍යසනයට පැමිණියේ වැද්දා විසින් යම් කැමති පරිද්දක් කළ හැකි වූයේ තතනමින් හොවී. මහණෙනි, වැද්දා ඒ වඳුරා එහි දීම විද උදුරා අත් නොහැර යම් කැමති දිගකට යේ. මහණෙනි, යමෙක් අගෝචර වූ මෙරමා සතු විෂයෙහි හැසිරේ නම් ඒ මෙසේ ම වෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 272,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තස්මාතිහ භික්ඛවෙ, මා අගොචරෙ චරිත්ථ පරවිසයෙ. අගොචරෙ භික්ඛවෙ, චරතං පරවිසයෙ ලච්ඡති මාරො ඔතාරං, ලච්ඡති මාරො ආරම්මණං. කො ච භික්ඛවෙ, භික්ඛුනො අගොචරො පරවිසයො: යදිදං පඤ්චකාමගුණා. කතමෙ පඤ්ච: චක්ඛුවිඤ්ඤෙය්යා රූපා ඉට්ඨා කන්තා මනාපා පියරූපා කාමූපසංහිතා රජනීයා -පෙ- කායවිඤ්ඤෙය්යා ඵොට්ඨබ්බා ඉට්ඨා කන්තා මනාපා පියරූපා කාමූපසංහිතා රජනීයා. අයං භික්ඛවෙ, භික්ඛුනො අගොචරො පරවිසයො."
                    },
                    {
                        "type": "paragraph",
                        "text": "ගොචරෙ භික්ඛවෙ, චරථ සකෙ පෙත්තිකෙ විසයෙ. ගොචරෙ භික්ඛවෙ, චරතං සකෙ පෙත්තිකෙ විසයෙ න ලච්ඡති මාරො ඔතාරං, න ලච්ඡති මාරො ආරම්මණං. කො ච භික්ඛවෙ, භික්ඛුනො ගොචරො සකො පෙත්තිකො විසයො: යදිදං චත්තාරො සතිපට්ඨානා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. අයං භික්ඛවෙ, භික්ඛුනො ගොචරො සකො පෙත්තිකො විසයොති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සූදසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1186. සෙය්යථාපි භික්ඛවෙ, බාලො අව්යත්තො අකුසලො සූදො රාජානං වා රාජමහාමත්තං{1} වා නානච්චයෙහි සූපෙහි පච්චුපට්ඨිතො අස්ස: අම්බිලග්ගෙහිපි තිත්තකග්ගෙහිපි කටුකග්ගෙහිපි මධුරග්ගෙහිපි ඛාරිකෙහිපි අඛාරිකෙහිපි ලොණිකෙහිපි අලොණිකෙහිපි. සඛො සො භික්ඛවෙ, බාලො අව්යත්තො අකුසලො සූදො සකස්ස භත්තු{2} නිමිත්තං න උග්ගණ්හාති: ඉදං වා මෙ අජ්ජ භත්තු{2} සූපෙය්යං රුච්චති, ඉමස්ස වා අභිහරති, ඉමස්ස වා බහුං ගණ්හාති, ඉමස්ස වා වණ්ණං භාසති. අම්බිලග්ගං වා මෙ අජ්ජ භත්තු සූපෙය්යං රුච්චති, අම්බිලග්ගස්ස වා අභිහරති, අම්බිලග්ගස්ස වා බහුං ගණ්හාති, අම්බිලග්ගස්ස වා වණ්ණං භාසති, තිත්තකග්ගං වා මෙ අජ්ජ භත්තු -පෙ- කටුකග්ගං වා මෙ අජ්ජ භත්තු -පෙ- මධුරග්ගං වා මෙ අජ්ජ භත්තු -පෙ- ඛාරිකං වා මෙ අජ්ජ භත්තු -පෙ- අඛාරිකං වා මෙ අජ්ජ භත්තු -පෙ- ලොණිකං වා මෙ අජ්ජ භත්තු -පෙ- අලොණිකං වා මෙ අජ්ජ භත්තු සූපෙය්යං රුච්චති, අලොණිකස්ස වා අභිහරති, අලොණිකස්ස වා බහුං ගණ්හාති, අලොණිකස්ස වා වණ්ණං භාසතීති. සඛො සො භික්ඛවෙ, බාලො අව්යත්තො අකුසලො සූදො නචෙව ලාභී හොති: අච්ඡාදනස්ස, න ලාභී වෙතනස්ස, න ලාභී අභිහාරානං. තං කිස්ස හෙතු: තථා හි සො භික්ඛවෙ, බාලො අව්යත්තො අකුසලො සූදො සකස්ස භත්තු නිමිත්තං න උග්ගණ්හාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. රාජමහාමත්තානං - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "2. හතත - මඡසං, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, එහෙයින් මෙහි ලා අගෝචර වූ මෙරමා සතු විෂයෙහි නහමක් හැසිරෙවු. මහණෙනි, අගෝචර වූ මෙරමා සතු විෂයෙහි හැසිරෙන්නවුන්ගේ බැසගැනීම මරු ලබන්නේ ය. මරු අරමුණක් ලබන්නේ ය. මහණෙනි, මහණහට අගෝචර වූ මෙරමා සතු විෂය කිමෙක් ද යත්: මේ පස්කම්ගුණ යි. කවර පසෙක් ද යත්; ඉටු කැමති මන වඩන පිය දෑ වූ කාමයෙන් යුත් ඇලුම් කටයුතු ඇසින් දතයුතු රූ යැ ... ඉටු කැමති මන වඩන පිය දෑ වූ කාමයෙන් යුත් ඇලුම් කටයුතු කයින් දතයුතු පහස් යැ. මහණෙනි, මේ මහණහට අගෝචර වූ මෙරමා සතු විෂය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ගොදුරු වූ සිය පියසතු විෂයෙහි හැසිරෙවු. මහණෙනි, ගොදුරු වූ සිය පියසතු විෂයෙහි හැසිරෙන්නවුන්ගේ බැසගැනීම මරු නො ලබන්නේ ය. මරු අරමුණක් නො ලබන්නේ ය. මහණෙනි, මහණහට ගොදුරු වූ සිය පියසතු විෂය කිමෙක් ද යත්: මේ සිවු සීවටනි. කවර සතරෙක් ද යත්: මහණෙනි, මෙසස්නෙහි මහණ කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කායලොකයෙහි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. වෙදනාහි … සිත්හි … දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. මහණෙනි, මේ මහණහට ගොදුරු වූ සිය පියසතු විෂය යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සූද සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1186. මහණෙනි, යම්සේ බාල වූ අව්‍යක්ත වූ අදක්‍ෂ වූ අරක්කැමියෙක් ඇඹුල් කොටස් ඇත්තා වූත් තිත්ත කොටස් ඇත්තා වූත් කුළු කොටස් ඇත්තා වූත් මිහිරි කොටස් ඇත්තා වූත් කරරස ඇත්තා වූත් කරරස නැත්තා වූත් ලුණුරස ඇත්තා වූත් ලුණුරස නැත්තා වූත් නන් වැදෑරුම් සූපයෙන් යුතු ව රජු වෙත හෝ රජමහඇමතියකු වෙත හෝ එළඹ සිටියේ වන්නේ ද, මහණෙනි, බාල වූ අව්‍යක්ත වූ අදක්‍ෂ වූ ඒ මේ අරක්කැමි තම ස්වාමියාගේ (භෝජන) නිමිත්ත නො උගනියි. “අද මාගේ ස්වාමිහට මේ සූපරසය රුචි වේ ය හෝ, මෙය ගැනීමට අත දිගුකරයි හෝ, මෙය බොහෝ කොට ගනියි හෝ, මෙහි ගුණ කියා යි හෝ අද මාගේ ස්වාමිහට ඇඹුල් කොටස් ඇති සූපරසය රුචි වේ යි හෝ, ඇඹුල් කොටස් ඇති සූපයට අත දිගුකරයි හෝ ඇඹුල් කොටස් ඇති සූපයෙන් බොහෝ ගනියි හෝ ඇඹුල් කොටස් ඇති සූපයෙහි ගුණ කියා යි හෝ, අද මාගේ ස්වාමිහට කුළු කොටස් ඇති ... හෝ … අද මාගේ සැමියාට මිහිරි කොටස් ඇති හෝ, … අද මාගේ සැමියාට කරරස ඇති හෝ, ... අද මාගේ ස්වාමිහට කරරස නැති හෝ ... අද මාගේ ස්වාමිහට ලුණුරස ඇති හෝ ... අද මාගේ ස්වාමිහට ලුණුරස නැති සූපරසය රුචි වේ ය හෝ ලුණුරස නැති සූපයට අත දිගුකරයි හෝ ලුණු රස නැති සූපයෙන් බොහෝ ගනි යි හෝ ලුණු රස නැති සූපයේ ගුණ කියා යි හෝ” යි. මහණෙනි, බාල වූ අව්‍යක්ත වූ අදක්‍ෂ වූ මේ අරක්කැමි වස්ත්‍ර නො ද ලබනසුලු වෙයි. වැටුප් නො ද ලබනසුලු වෙයි. පඬුරු නො ද ලබනසුලු වෙයි. ඒ කවර හෙයින් යත්: මහණෙනි, බාල වූ අව්‍යක්ත වූ අදක්‍ෂ වූ ඒ අරක්කැමි සිය ස්වාමිහුගේ භෝජන නිමිත්ත නො උගනියි ද එහෙයිනි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 274,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ, ඉධෙකච්චො බාලො අව්යත්තො අකුසලො භික්ඛු කායෙ න කායානුපස්සී{1} විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තස්ස කායෙ න කායානුපස්සිනො{2} විහරතො චිත්තං න සමාධියති, උපක්කිලෙසා න පහීයන්ති. සො තං නිමිත්තං න උග්ගණ්හාති. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු න ධම්මානුපස්සී{3} විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තස්ස ධම්මෙසු න ධම්මානුපස්සිනො{4} විහරතො චිත්තං න සමාධියති, උපක්කිලෙසා න පහීයන්ති. සො තං නිමිත්තං න උග්ගණ්හාති. සඛො සො භික්ඛවෙ, බාලො අව්යත්තො අකුසලො භික්ඛු නචෙව ලාභී හොති දිට්ඨධම්මසුඛවිහාරානං,{5} න ලාභී සතිසම්පජඤ්ඤස්ස. තංකිස්ස හෙතු? තථා හි සො භික්ඛවෙ, බාලො අව්යත්තො අකුසලො භික්ඛු සකස්ස චිත්තස්ස නිමිත්තං න උග්ගණ්හාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි භික්ඛවෙ, පණ්ඩිතො වියත්තො කුසලො සූදො රාජානං වා රාජමහාමත්තං වා නානච්චයෙහි සූපෙහි පච්චුපට්ඨිතො අස්ස: අම්බිලග්ගෙහිපි තිත්තකග්ගෙහිපි කටුකග්ගෙහිපි මධුරග්ගෙහිපි ඛාරිකෙහිපි අඛාරිකෙහිපි ලොණිකෙහිපි අලොණිකෙහිපි. සඛො සො භික්ඛවෙ, පණ්ඩිතො වියත්තො කුසලො සූදො සකස්ස භත්තු නිමිත්තං උග්ගණ්හාති: “ඉදං වා මෙ අජ්ජ භත්තු සූපෙය්යං රුච්චති, ඉමස්ස වා අභිහරති, ඉමස්ස වා බහුං ගණ්හාති, ඉමස්ස වා වණ්ණං භාසති. අම්බිලග්ගං වා මෙ අජ්ජ භත්තු සූපෙය්යං රුච්චති, අම්බිලග්ගස්ස වා අභිහරති, අම්බිලග්ගස්ස වා බහුං ගණ්හාති, අම්බිලග්ගස්ස වා වණ්ණං භාසති. තිත්තකග්ගං වා මෙ අජ්ජ භත්තු -පෙ- කටුකග්ගං වා මෙ අජ්ජ භත්තු -පෙ- මධුරග්ගං වා මෙ අජ්ජ භත්තු -පෙ- ඛාරිකං වා මෙ අජ්ජ භත්තු -පෙ- අඛාරිකං වා මෙ අජ්ජ භත්තු -පෙ- ලොණිකං වා මෙ අජ්ජ භත්තු -පෙ- අලොණිකං වා මෙ අජ්ජ භත්තු සූපෙය්යං රුච්චති, අලොණිකස්ස වා අභිහරති, අලොණිකස්ස වා බහුං ගණ්හාති, අලොණිකස්ස වා වණ්ණං භාසතීති. සඛො සො භික්ඛවෙ, පණ්ඩිතො වියත්තො කුසලො සූදො ලාභී චෙව හොති අච්ඡාදනස්ස, ලාභී වෙතනස්ස, ලාභී අභිහාරානං. තං කිස්ස හෙතු: තථා හි සො භික්ඛවෙ, පණ්ඩිතො ව්යත්තො කුසලො සූදො සකස්ස භත්තු නිමිත්තං උග්ගණ්හාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කායෙ කායානුපස්සී - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. කායෙ කායානුපස්සිනො - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ධම්මෙසු ධම්මානුපස්සී - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. ධම්මෙසු ධම්මානුපස්සිනො - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. දිට්ඨෙව ධම්මෙ සුඛවිහාරානං - මඡසං, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, එසෙයින් ම මෙහි බාල වූ අව්‍යක්ත වූ අදක්‍ෂ වූ ඇතැම් මහණෙක් කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට නො වෙසෙයි. කයෙහි කය අනුව දක්නාසුලු ව නො වෙසෙන ඔහුගේ සිත එකඟ නො වේ. කෙලෙස් ප්‍රහීණ නො වේ. හේ ඒ නිමිත්ත නො උගනියි. වෙදනාහි … සිත්හි … දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇතිව මනා දැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට නො වෙසේ. දහම්හි දහම් අනුව දක්නාසුලු ව නො වෙසෙන ඔහුගේ සිත එකඟ නො වෙයි. කෙලෙස් ප්‍රහීණ නො වේ. හේ ඒ නිමිත්ත නො උගනියි. මහණෙනි, බාල වූ අව්‍යක්ත වූ අදක්‍ෂ වූ ඒ මහණ දිටුදැමියෙහි සුව විහරණ නො ද ලබනසුලු වෙයි. සිහි නුවණ නො ද ලබනසුලු වෙයි. ඒ කවර හෙයින් යත්: මහණෙනි, බාල වූ අව්‍යක්ත වූ අදක්‍ෂ වූ ඒ මහණ සිය සිතෙහි නිමිත්ත නො උගනී ද එහෙයිනි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම්සේ පණ්ඩිත වූ ව්‍යක්ත වූ දක්‍ෂ වූ අරක්කැමියෙක් ඇඹුල් කොටස් ඇත්තා වූත් තිත්ත කොටස් ඇත්තා වූත් කුළු කොටස් ඇත්තා වූත් මිහිරි කොටස් ඇත්තා වූත් කරරස ඇත්තා වූත් කරරස නැත්තා වූත් ලුණුරස ඇත්තා වූත් ලුණුරස නැත්තා වූත් නන් වැදෑරුම් සූපයෙන් යුතු ව රජු වෙත හෝ රජමහඇමතියකු වෙත හෝ එළඹ සිටියේ වන්නේ ද, මහණෙනි, පණ්ඩිත වූ ව්‍යක්ත වූ දක්‍ෂ වූ ඒ අරක්කැමි සිය සැමියාගේ භෝජන නිමිත්ත උගනියි. “අද මාගේ සැමියාට මේ සූපරසය රුචි වේ යි හෝ මෙයට අත දිගුකරයි හෝ මෙයින් බොහෝ ගනියි හෝ මෙහි ගුණ කියායි හෝ අද මාගේ ස්වාමිහට ඇඹුල් කොටස් ඇති සූපරසය රුචි වෙ යි හෝ ඇඹුල් කොටස් ඇති සූපයට අත දිගුකරයි හෝ ඇඹුල් කොටස් ඇති සූපයෙන් බොහෝ ගනි යි හෝ ඇඹුල් කොටස් ඇති සූපයේ ගුණ කියා යි හෝ අද මාගේ ස්වාමිහට තිත්ත කොටස් ඇති … හෝ, අද මාගේ ස්වාමිහට කුළු කොටස් ඇති හෝ … අද මාගේ ස්වාමිහට මිහිරි කොටස් ඇති හෝ … අද මාගේ ස්වාමිහට කරරස ඇති හෝ ... අද මාගේ ස්වාමිහට කරරස නැති හෝ ... අද මාගේ ස්වාමිහට ලුණුරස ඇති හෝ ... අද මාගේ ස්වාමිහට ලුණුරස නැති සූපරසය රුචි වේ යි හෝ ලුණුරස නැති සූපයට අත දිගුකරයි හෝ ලුණුරස නැති සූපයෙන් බොහෝ ගනි යි හෝ ලුණුරස නැති සූපයෙහි ගුණ කියා යි හෝ” යි. මහණෙනි, පණ්ඩිත වූ ව්‍යක්ත වූ දක්‍ෂ වූ ඒ මේ අරක්කැමි වස්ත්‍ර ලබනසුලු වෙයි. වැටුප් ලබනසුලු වෙයි. පඬුරු ලබනසුලු වෙයි. ඒ කවර හෙයින යත්: මහණෙනි, පණ්ඩිත වූ ව්‍යක්ත වූ දක්‍ෂ වූ ඒ අරක්කැමි සිය ස්වාමිහුගේ භෝජන නිමිත්ත උගනී එහෙයිනි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 276,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො භික්ඛවෙ, ඉධෙකච්චො පණ්ඩිතො වියත්තො කුසලො භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තස්ස කායෙ කායානුපස්සිනො විහරතො චිත්තං සමාධියති, උපක්කිලෙසා පහීයන්ති. සො තං නිමිත්තං උග්ගණ්හාති. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තස්ස ධම්මෙසු ධම්මානුපස්සිනො විහරතො චිත්තං සමාධියති, උපක්කිලෙසා පහීයන්ති. සො තං නිමිත්තං උග්ගණ්හාති. සඛො සො භික්ඛවෙ, පණ්ඩිතො වියත්තො කුසලො භික්ඛු ලාභී චෙව හොති දිට්ඨධම්මසුඛවිහාරානං, ලාභී හොති සතිසම්පජඤ්ඤස්ස. තං කිස්ස හෙතු: තථා හි සො භික්ඛවෙ, පණ්ඩිතො ව්යත්තො කුසලො භික්ඛු සකස්ස චිත්තස්ස නිමිත්තං උග්ගණ්හාතීති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ගිලානසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1187. එකං සමයං භගවා වෙසාලියං විහරති බෙලුවගාමකෙ{1}. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි: “එථ තුම්හෙ භික්ඛවෙ, සාමන්තා{2} වෙසාලියා යථාමිත්තං යථාසන්දිට්ඨං යථාසම්භත්තං වස්සං උපෙථ. ඉධෙවාහං බෙලුවගාමකෙ වස්සං උපගච්ඡාමී”ති. “එවං භන්තෙ”ති ඛො තෙ භික්ඛූ භගවතො පටිස්සුත්වා සාමන්තා වෙසාලියා යථාමිත්තං යථාසන්දිට්ඨං යථාසම්භත්තං වස්සං උපගඤ්ඡුං. භගවා පන තත්ථෙව බෙලුවගාමකෙ{3} වස්සං උපගඤ්ඡි. අථ ඛො භගවතො වස්සූපගතස්ස ඛරො ආබාධො උප්පජ්ජි. බාළ්හා වෙදනා වත්තන්ති මාරණන්තිකා. තා{4} සුදං භගවා සතො සම්පජානො අධිවාසෙසි අවිහඤ්ඤමානො. අථ ඛො භගවතො එතදහොසි: න ඛො පන මෙතං පතිරූපං යො’හං අනාමන්තෙත්වා උපට්ඨාකෙ, අනපලොකෙත්වා භික්ඛුසඞ්ඝං පරිනිබ්බායෙය්යං{5}. යන්නූනාහං ඉමං ආබාධං විරියෙන පටිප්පණාමෙත්වා{6} ජීවිතසඞ්ඛාරං අධිට්ඨාය විහරෙය්යන්ති. අථ ඛො භගවා තං ආබාධං විරියෙන පටිප්පණාමෙත්වා ජීවිතසඞ්ඛාරං අධිට්ඨාය විහාසි. අථ ඛො භගවා ගිලානා වුට්ඨිතො{7} අචිරවුට්ඨිතො ගෙලඤ්ඤා විහාරපච්ඡායායං{8} පඤ්ඤත්තෙ ආසනෙ නිසීදි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. වෙළුවගාමකෙ - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සමන්තා - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. භගවා පන බෙලුවගාමකෙ - සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "4. තත්ර සුදං - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. පරිනිබ්බාපෙය්යං - සී 1."
                    },
                    {
                        "type": "footnote",
                        "text": "6. පටිපණාමෙත්වා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "7. ගිලානවුට්ඨිතො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "8. විහාරපච්ඡාඡායායං - සී 1, 2, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, එසෙයින් ම මෙහි පණ්ඩිත වූ ව්‍යක්ත වූ දක්‍ෂ වූ ඇතැම් මහණෙක් කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කායලෝකයෙහි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. කයෙහි කය අනුව දක්නාසුලු ව වෙසෙන ඔහුගේ සිත එකඟ වේ. කෙලෙස් ප්‍රහීණ වේ. හේ ඒ නිමිත්ත උගනී. වෙදනාහි … සිත්හි … දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. දහම්හි දහම් අනු ව දක්නාසුලු ව වෙසෙන ඔහුගේ සිත එකඟ වෙයි. කෙලෙස් ප්‍රහීණ වේ. හේ ඒ නිමිත්ත උගනී. මහණෙනි, පණ්ඩිත වූ ව්‍යක්ත වූ දක්‍ෂ වූ ඒ මේ මහණ දිටුදැමියෙහි සුඛවිහරණ ලබනසුලු ද වෙයි. සිහිනුවණ ලබනසුලු ද වෙයි. ඒ කවර හෙයින යත්: මහණෙනි, පණ්ඩිත වූ ව්‍යක්ත වූ දක්‍ෂ වූ ඒ මහණ සිය සිතෙහි නිමිත්ත උගනී එහෙයිනි යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 1. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ගිලාන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1187. එක්කලෙක භාග්‍යවතුන් වහන්සේ විසල්පුර සමීපයෙහි බේළුවගම්හි වැඩවසන සේක. එහි දී භාග්‍යවතුන් වහන්සේ භික්‍ෂූන් ඇමතූ සේක: “මහණෙනි එවු. තෙපි මිතුරුකම් ඇති සේ දුටුපමණින් වූ මිතුරුකම් ඇති සේ දැඩිලෙස වූ මිතුරුකම් ඇති සේ විසල්පුර අවට වස් එළඹෙවු. මම මෙහි බේලුවගම්හි ම වස් එළඹෙමී” යි. වහන්ස, එසේ යයි ඒ භික්‍ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දී මිතුරුකම් ඇති සේ දුටුපමණින් වූ මිතුරුකම් ඇති සේ දැඩිලෙස වූ මිතුරුකම් ඇති සේ විසල්පුර අවට වස් එළඹුණාහ. භාග්‍යවතුන් වහන්සේ වනාහි එහි ම බේලුවගම්හි වස් එළඹුණු සේක. එකල්හි වස් එළඹුණු භාග්‍යවතුන් වහන්සේට ක්‍රෑර ආබාධයක් උපන. මරණය කරා පමුණුවන දැඩි වේදනාවෝ පවතිත්. භාග්‍යවතුන් වහන්සේ සිහි ඇති ව මනා දැනුම් ඇති ව නොපෙළෙමින් ඒ වේදනා ඉවසූ සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේට මෙබඳු සිතෙක් විය: “යම්බඳු මම උවැටන් කරන්නවුන් නො අමතා බික්සඟන නො දන්වා පිරිනිවෙම් නම් මට එය සුදුසු නො වෙයි. මම මේ රෝගය වීර්‍ය්‍යයෙන් යටපත් කොට ජීවිතසංස්කාර (ජීවිතය පවතින සේ) අධිෂ්ඨාන කොට වෙසෙන්නෙම් නම් මැනැවැ”යි . එකල්හි භාග්‍යවතුන් වහන්සේ ඒ ආබාධය වීර්‍ය්‍යයෙන් යටපත් කොට ජීවිතසංස්කාර අධිෂ්ඨාන කොට වැඩවූසූ සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ ගිලන්බවෙන් නැඟීසිටි සේක්. ගිලන්බවෙන් නැගී සිටි නොබෝකල් ඇති සේක් වෙහෙර පසුපස සෙවණැල්ලෙහි පැනැ වූ අසුන්හි වැඩහුන් සේක.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 278,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා ආනන්දො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා ආනන්දො භගවන්තං එතදවොච:{1} “දිට්ඨං භන්තෙ, භගවතො ඛමනීයං, දිට්ඨං භන්තෙ, භගවතො යාපනීයං. අපි මෙ භන්තෙ, මධුරකජාතො විය කායො, දිසාපි මෙ න පක්ඛායන්ති, ධම්මාපි මං නප්පටිභන්ති, භගවතො ගෙලඤ්ඤෙන. අපි ච මෙ භන්තෙ, අහොසි: කාචිදෙව අස්සාසමත්තා{2} න තාව භගවා පරිනිබ්බායිස්සති. න තාව භගවා භික්ඛුසඞ්ඝං ආරබ්භ කිඤ්චිදෙව උදාහරතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කිම්පනදානි ආනන්ද, භික්ඛුසඞ්ඝො මයි පච්චාසිංසති: දෙසිතො ආනන්ද, මයා ධම්මො අනන්තරං අබාහිරං කත්වා. නත්ථානන්ද, තථාගතස්ස ධම්මෙසු ආචරියමුට්ඨි. යස්ස{3} නූන ආනන්ද, එවමස්ස අහං භික්ඛුසඞ්ඝං පරිහරිස්සාමීති වා. මමුද්දෙසිකො භික්ඛුසඞ්ඝොති වා සො නූන ආනන්ද, භික්ඛුසඞ්ඝං ආරබ්භ කිඤ්චිදෙව උදාහරෙය්ය. තථාගතස්ස ඛො ආනන්ද, න එවං හොති අහං භික්ඛුසඞ්ඝං පරිහරිස්සාමීති වා මමුද්දෙසිකො භික්ඛුසඞ්ඝොති වා. සකිං ආනන්ද, තථාගතො භික්ඛුසඞ්ඝං ආරබ්භ කිඤ්චිදෙව උදාහරිස්සති: එතරහි ඛො පනානන්ද, ජිණ්ණො වුද්ධො මහල්ලකො අද්ධගතො වයො අනුප්පත්තො. ආසීතියො මෙ වයො වත්තති. සෙය්යථාපි ආනන්ද, ජජ්ජරසකටං{4} වෙළුමිස්සකෙන{5} යාපෙති; එවමෙව ඛො ආනන්ද, වෙළුමිස්සකෙන මඤ්ඤෙ තථාගතස්ස කායො යාපෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං ආනන්ද, සමයෙ තථාගතො සබ්බනිමිත්තානං අමනසිකාරා එකච්චානං වෙදනානං නිරොධා අනිමිත්තං චෙතොසමාධිං උපසම්පජ්ජ විහරති. ඵාසුතරං ආනන්ද, තස්මිං සමයෙ තථාගතස්ස හොති. තස්මාතිහානන්ද, අත්තදීපා විහරථ අත්තසරණා අනඤ්ඤසරණා, ධම්මදීපා ධම්මසරණා අනඤ්ඤසරණා. කථඤ්චානන්ද, භික්ඛු අත්තදීපො විහරති අත්තසරණො අනඤ්ඤසරණො, ධම්මදීපො ධම්මසරණො අනඤ්ඤසරණො: ඉධානන්ද, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. එවං ඛො ආනන්ද, භික්ඛු අත්තදීපො විහරති අත්තසරණො අනඤ්ඤසරණො, ධම්මදීපො ධම්මසරණො අනඤ්ඤසරණො. යෙ හි කෙචි ආනන්ද, එතරහි වා මමච්චයෙ වා අත්තදීපා විහරිස්සන්ති අත්තසරණා අනඤ්ඤසරණා, ධම්මදීපා ධම්මසරණා අනඤ්ඤසරණා තමතග්ගෙ මෙ තෙ ආනන්ද, භික්ඛූ භවිස්සන්ති යෙ කෙචි සික්ඛාකාමාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. “දිට්ඨො මෙ භන්තෙ භගවතො ඵාසු” ඉති පාඨො මඡසං පොත්ථකෙ එත්ථ දිස්තෙ."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අස්සාදමත්තා - සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "3. යන්නූන - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. ජරසකටං - ,"
                    },
                    {
                        "type": "footnote",
                        "text": "5. වෙඝමිස්සකෙන - සී 1, 2. වෙඛමිස්සකෙන - මඡසං, වෙධමිස්සකෙන - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "එකල්හි ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ වැඳැ එකත්පස් ව හුන්හ. එකත්පස් ව හුන් ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැලකළහ: “වහන්ස, භාග්‍යවතුන් වහන්සේට ඉවසිය හැකි ය යි දක්නා ලදී. වහන්ස, භාග්‍යවතුන් වහන්සේට යැපිය හැකි ය යි දක්නා ලදී. වහන්ස, එතෙකුදු වුවත් භාග්‍යවතුන් වහන්සේගේ ගිලන්බව හේතු කොට ගෙන මාගේ සිරුර ද තද වූවාක් මෙනි. දිශාවෝ ද මට පැහැදිලි නො වෙත්. දහම් ද මට නො වැටහේ. වහන්ස, තව ද භාග්‍යවතුන් වහන්සේ දැන් ම නො පිරිනිවෙන සේක. භාග්‍යවි ය යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්‍ද, බික්සඟන මා කෙරෙහි කුමක් අපේක්‍ෂා කෙරේ ද? ආනන්‍ද, මා විසින් ආනන්තර-අබාහිර (-නො සඟවා) නො කොට දහම් දෙසන ලදී. ආනන්‍ද, තථාගත දහම්හි ආචාර්‍ය්‍ය මුෂ්ටි නැත. ආනන්‍ද, “මම බික්සඟන පරිහරණය කරන්නෙමි යි හෝ බික්සඟන මා උදෙසියයුතු කොට ඇත්තේ (වේ ව)” යි හෝ යමකුට ඒකාන්තයෙන් මෙබඳු අදහසක් වන්නේ ද ආනන්‍ද, හේ ඒකාන්තයෙන් බික්සඟන ඇරබ කිසිවක් ගෙන හැර පානේ (කිසියම් අවවාදයක් දෙන්නේ) නම් ආනන්‍ද, “මම බික්සඟන පරිහරණය කරන්නෙමි යි හෝ බික්සඟන මා උදෙසියයුතු කොට ඇත්තේ (වේව)” යි හෝ තථාගතයන් හට වූකලී මෙබඳු සිතෙක් නො වේ. ආනන්‍ද, ඒ තථාගත බික්සඟන ඇරබ කිසිවක් ගෙනහැර පානේ ද ආනන්‍ද, දැන් වූකලී දිරූයෙම් වෘද්ධයෙම් මහලු වූයෙම් කල්ගත වූයෙම් පිළිවෙළින් මහලුවියට පැමිණියෙම් මාගේ අසූවැනි විය පවතී. ආනන්‍ද, දිරූ ගැලක් යම්සේ හුණු මුසු පිළිසකරින් යැපේ ද ආනන්‍ද, එපරිද්දෙන් තථාගතයන්ගේ කය හුණු මුසු පිළිසකරින් මෙන් යැපේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්‍ද, යම්කලෙක තථාගත තෙමේ සියලු නිමිති මෙනෙහි නො කිරීමෙන් ඇතැම් වේදනාවන්ගේ නිරෝධයෙන් නිමිති රහිත වූ චිත්තසමාධියට පැමිණ වෙසේ ද, ආනන්‍ද, එසමයෙහි තථාගතයන්ට ඉතා පහසු වෙයි. ආනන්‍ද, එහෙයින් මෙහි ලා තමා පිහිට කොට තමා සරණ කොට අනුන් පිහිට නො කොට දහම් පිහිට කොට දහම් සරණ කොට අනෙකක් පිහිට නො කොට වෙසෙවු. ආනන්‍ද, කෙසේ නම් මහණ තමා පිහිට කොට තමා සරණ කොට අනුන් පිහිට නො කොට දහම් පිහිට කොට දහම් සරණ කොට අනෙකක් පිහිට නො කොට වෙසේ ද යත්: ආනන්‍ද, මෙහි මහණ කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වෙර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙයි. වේදනාව … සිත්හි … දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. ආනන්‍ද, මෙසේ මහණ තමා පිහිට කොට තමා සරණ කොට අනුන් පිහිට නො කොට දහම් පිහිට කොට දහම් සරණ කොට අනෙකක් පිහිට නො කොට වෙසේ. ආනන්‍ද, යම්කිසි භික්‍ෂු කෙනෙක් දැන් හෝ මාගේ ඇවෑමෙහි හෝ තමා පිහිට කොට තමා සරණ කොට අනුන් පිහිට නො කොට දහම් පිහිට කොට දහම් සරණ කොට අනෙකක් පිහිට නො කොට වෙසෙන්නාහු ද, යම්කිසි කෙනෙක් ශික්‍ෂාකාමී වන්නාහු ද, ආනන්‍ද, ඒ මේ භික්‍ෂූහු අග්‍රතම වෙති යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 280,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 1. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භික්ඛුනුපස්සයසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1188. අථ ඛො ආයස්මා ආනන්දො පුබ්බන්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය යෙනඤ්ඤතරො භික්ඛුනුපස්සයො{1} තෙනුපසඞ්කමි. උපසඞ්කමිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදි. අථ ඛො සම්බහුලා භික්ඛුනියො යෙනායස්මා ආනන්දො තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා ආයස්මන්තං ආනන්දං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නා ඛො තා භික්ඛුනියො ආයස්මන්තං ආනන්දං එතදවොචුං: “ඉධ භන්තෙ, ආනන්ද, සම්බහුලා භික්ඛුනියො චතූසු සතිපට්ඨානෙසු සුපතිට්ඨිතචිත්තා{2} විහරන්තියො උළාරං පුබ්බෙනාපරං විසෙසං සඤ්ජානන්තී”ති. “එවමෙතං භගිනියො, එවමෙතං භගිනියො, යො හි කො චි භගිනියො, භික්ඛු වා භික්ඛුනී වා චතූසු සතිපට්ඨානෙසු සුපතිට්ඨිතචිත්තො{3} විහරති, තස්සෙතං පාටිකඞ්ඛං” “උළාරං පුබ්බෙනාපරං විසෙසං සඤ්ජානිස්සතී”ති. අථ ඛො ආයස්මා ආනන්දො තා භික්ඛුනියො ධම්මියා කථාය සන්දස්සෙත්වා සමාදපෙත්වා සමුත්තෙජෙත්වා සම්පහංසෙත්වා උට්ඨායාසනා පක්කාමි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා ආනන්දො සාවත්ථියං පිණ්ඩාය චරිත්වා පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා ආනන්දො භගවන්තං එතදවොච: ඉධාහං භන්තෙ, පුබ්බන්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය යෙනඤ්ඤතරො භික්ඛුනුපස්සයො තෙනුපසඞ්කමිං. උපසඞ්කමිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදිං. අථ ඛො භන්තෙ, සම්බහුලා භික්ඛුනියො යෙනාහං තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා මං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නා ඛො භන්තෙ, තා භික්ඛුනියො මං එතදවොචුං: “ඉධ භන්තෙ ආනන්ද, සම්බහුලා භික්ඛුනියො චතූසු සතිපට්ඨානෙසු සුපතිට්ඨිතචිත්තා විහරන්තියො උළාරං පුබ්බෙනාපරං විසෙසං සඤ්ජානන්තී”ති. එවං වුත්තාහං භන්තෙ, තා භික්ඛුනියො එතදවොචං: “එවමෙතං භගිනියො, එවමෙතං භගිනියො, යො හි කොචි භගිනියො, භික්ඛු වා භික්ඛුනී වා චතූසු සතිපට්ඨානෙසු සුපතිට්ඨිතචිත්තො විහරති, තස්සෙතං පාටිකඞ්ඛං: “උළාරං පුබ්බෙනාපරං විසෙසං සඤ්ජානිස්සතී”ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. භික්ඛුනීපස්සය - සී 1."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සුප්පතිට්ඨිතචිත්තා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. සුපට්ඨිතචිත්තා - සී 1."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 1. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භික්ඛුනුපස්සය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1188. එකල්හි ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ පෙරවරු හැඳ පෙර ව පාසිවුරු ගෙන එක්තරා මෙහෙණ අසපුවක් වෙත එළඹියහ. එළඹ පැනවූ අසුන්හි වැඩ හුන්හ. එකල්හි බොහෝ මෙහෙණහු ආයුෂ්මත් ආනන්‍ද තෙරණුවන් වෙත එළඹියහ. එළඹ ආයුෂ්මත් ආනන්‍ද තෙරණුවන් වැඳ එකත්පස් ව හුන්හ. එකත්පස් ව හුන් ඒ මෙහෙණහු ආයුෂ්මත් ආනන්‍ද තෙරණුවන්ට මෙය කීහ: “වහන්ස, ආනන්‍දයෙනි, මෙහි බොහෝ මෙහෙණහු සිවුසීවටන්හි මැනවින් එළඹ සිටි සිත් ඇති ව වෙසෙන්නාහු පෙරට වඩා උදාර විශේෂයක් පසු ව හඳුනති” යි. නැගණියනි, එය එසේ ය. නැගණියනි, එය එසේ ය. නැගණියනි, යම්කිසි මහණෙක් හෝ මෙහෙණක් හෝ සිවුසීවටන්හි මැනවින් එලඹ සිටි සිත් ඇති ව වෙසේ නම් ඔහු විසින් පෙරට වඩා උදාර විශේෂයක් පසු ව හඳුනන්නේ ය යන මෙය කැමති වියයුතු යි, ඉක්බිති ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ දැහැමි කථාවෙන් ඒ මෙහෙණුන් කරුණු දක්වා සමාදන් කරවා තෙද ගන්වා සතුටු කරවා හුනස්නෙන් නැඟී ගියහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉක්බිති ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ සැවැත් නුවර පිඬු පිණිස හැසිර පසුබත පිණ්ඩපාතයෙන් වැළකුණාහු භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්හ. එකත්පසෙක හුන් ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැලකළහ: වහන්ස, මෙහි මම පෙරවරු හැඳ පෙරව පාසිවුරු ගෙන එක්තරා මෙහෙණ අසපුවක් කරා එළඹියෙමි. එළඹ පැනවූ අස්නෙහි හුන්නෙමි. වහන්ස, එකල්හි බොහෝ මෙහෙණහු මා වෙත එළඹියහ. එළඹ මා වැඳ එකත්පස්ව හුන්හ. වහන්ස, එකත්පස් ව හුන් ඒ මෙහෙණහු මට මෙය කීහ: “වහන්ස, ආනන්‍දයෙනි, මෙහි බොහෝ මෙහෙණහු සිවුසීවටන්හි මැනවින් එළඹ සිටි සිත් ඇති ව වෙසෙන්නාහු පෙරට වඩා උදාර විශේෂයක් පසු ව හඳුනති” යි. වහන්ස, එසේ කියන ලද මම ඒ මෙහෙණට මෙය කීමි. “නැගණියනි, එය එසේය. නැගණියනි, එය එසේය. නැගණියනි, යම්කිසි මහණෙක් හෝ මෙහෙණක් හෝ සිවුසීවටන්හි මැනවින් එළඹ සිටි සිත් ඇති ව වෙසේ නම් ඔහු විසින් පෙරට වඩා උදාර වූ විශේෂයක් පසු ව හඳුනන්නේ ය යන මෙය කැමති විය යුතු” යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 282,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එවමෙතං ආනන්ද, එවමෙතං ආනන්ද, යො හි කොචි ආනන්ද, භික්ඛු වා භික්ඛුනී වා චතූසු සතිපට්ඨානෙසු සුපතිට්ඨිතචිත්තො විහරති, තස්සෙතං පාටිකඞ්ඛං: “උළාරං පුබ්බෙනාපරං විසෙසං සඤ්ජානිස්සතී”ති. කතමෙසු චතූසු: ඉධානන්ද භික්ඛු කායෙ කායානුපස්සී විහරති, ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තස්ස කායෙ කායානුපස්සිනො විහරතො කායාරම්මණො වා උප්පජ්ජති කායස්මිං පරිළාහො, චෙතසො වා ලීනත්තං, බහිද්ධා වා චිත්තං වික්ඛිපති. තෙන හානන්ද, භික්ඛුනා කිස්මිචිදෙව පසාදනීයෙ නිමිත්තෙ චිත්තං පණිදහිතබ්බං. තස්ස කිස්මිඤ්චිදෙව පසාදනීයෙ නිමිත්තෙ චිත්තං පණිදහතො පාමුජ්ජං ජායති. පමුදිතස්ස පීති ජායති. පීතිමනස්ස කායො පස්සම්භති. පස්සද්ධකායො සුඛං වෙදියති. සුඛිනො චිත්තං සමාධියති. සො ඉති පටිසඤ්චික්ඛති: යස්ස ඛො’හං අත්ථාය චිත්තං පණිදහිං සො මෙ අත්ථො අභිනිප්ඵන්නො. හන්දදානි පටිසංහරාමීති. සො පටිසංහරති චෙව න ච විතක්කෙති. න ච විචාරෙති. “අවිතක්කොම්හි අවිචාරො අජ්ඣත්තං සතිමා සුඛමස්මී”ති පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං ආනන්ද, භික්ඛු වෙදනාසු වෙදනානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තස්ස වෙදනාසු වෙදනානුපස්සිනො විහරතො වෙදනාරම්මණො වා උප්පජ්ජති කායස්මිං පරිළාහො -පෙ- පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං ආනන්ද, භික්ඛු චිත්තෙ චිත්තානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තස්ස චිත්තෙ චිත්තානුපස්සිනො විහරතො චිත්තාරම්මණො වා උප්පජ්ජති කායස්මිං පරිළාහො -පෙ- පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පුන චපරං ආනන්ද, භික්ඛු ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තස්ස ධම්මෙසු ධම්මානුපස්සිනො විහරතො ධම්මාරම්මණො වා උප්පජ්ජති කායස්මිං පරිළාහො, චෙතසො වා ලීනත්තං, බහිද්ධා වා චිත්තං වික්ඛිපති. තෙනහානන්ද, භික්ඛුනා කිස්මිචිදෙව පසාදනීයෙ නිමිත්තෙ චිත්තං පණිදහිතබ්බං. තස්ස කිස්මිචිදෙව පසාදනීයෙ නිමිත්තෙ චිත්තං පණිදහතො පාමුජ්ජං ජායති, පමුදිතස්ස පීති ජායති, පීතිමනස්ස කායො පස්සම්භති, පස්සද්ධකායො සුඛං වෙදෙති, සුඛිනො චිත්තං සමාධියති. සො ඉති පටිසඤ්චික්ඛති: “යස්ස ඛො’හං අත්ථාය චිත්තං පණිදහිං, සො මෙ අත්ථො අභිනිප්ඵන්නො. “හන්දදානි පටිසංහරාමී”ති. සො පටිසංහරති චෙව න ච විතක්කෙති, න ච විචාරෙති, අවිතක්කොම්හි අවිචාරො, අජ්ඣත්තං සතිමා සුඛිතස්මී”ති පජානාති. එවං ඛො ආනන්ද, පණිධාය භාවනා හොති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "ආනන්‍ද, එය එසේ ය. ආනන්‍ද , එය එසේ ය. ආනන්‍ද, යම්කිසි මහණෙක් හෝ මෙහෙණක් හෝ සිවුසීවටන්හි මැනවින් එළඹ සිටි සිත් ඇති ව වෙසේ නම් ඔහු විසින් පෙරට වඩා උදාර වූ විශේෂයක් පසු ව හඳුනන්නේ ය යන මෙය කැමති වියයුතු. කවර සතරෙක ද යත්: ආනන්‍ද, මෙහි මහණ කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව ද කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙයි. කයෙහි කය අනුව දක්නාසුලු ව වෙසෙන ඔහුට කය අරමුණු කොට ඇති කයෙහි දැවිල්ලෙක් හෝ උපදී. සිතේ සැඟවුණු බවෙක් හෝ වේ. පිටත හෝ සිත විසිරෙයි. ආනන්‍ද, ඒ මහණහු විසින් කිසියම් පැහැදියයුතු නිමිත්තෙක සිත පිහිටුවියයුතු යි. කිසියම් පැහැදියයුතු නිමිත්තෙක සිත පිහිටුවන ඔහුට ප්‍රමුදිතභාවය උපදී. හටගත් ප්‍රමෝද ඇත්තහුට ප්‍රීතිය උපදී. ප්‍රීතිසිත් ඇත්තහුගේ කය සැහැල්ලු වේ. සැහැල්ලු කය ඇත්තේ සුව විඳි යි. සුව ඇත්තහුගේ සිත එකඟ වේ. හේ මෙසේ නුවණින් සලකා බලයි: “මම යමක් පිණිස සිත පිහිටුවෙම් නම් ඒ අරුත මට නිපනි. ඒකාන්තයෙන් දැන් (පැහැදියයුතු නිමිත්තෙන් සිත) ආපසු හැර ගනිමි” යි. හෙතෙමේ ආපසු හැර ගැනීමත් කෙරෙයි. නො ද විතර්‍ක කෙරෙයි. නො ද විචාර කෙරෙයි. විතර්‍ක නැත්තෙම් විචාර නැත්තෙම් ඇතුළත සිහි ඇත්තෙම් හටගත් සුව ඇත්තෙම් වෙමි යි දැනගනී.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්‍ද, නැවත අනෙකක් ද කියමි: මහණ වේදනාවන් හි වේදනා අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව වේදනාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. වේදනාවන් හි වේදනා අනු ව දක්නාසුලු ව වෙසෙන ඔහුට වේදනා අරමුණු කොට ඇති කයෙහි දැවිල්ලෙක් හෝ උපදී … දැනගනී.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්‍ද, නැවත අනෙකක් ද කියමි: මහණ සිත්හි සිත් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව සිත්ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙයි. සිත්හි සිත් අනුව දක්නාසුලු ව වෙසෙන ඔහුට සිත් අරමුණු කොට ඇති කයෙහි දැවිල්ලෙක් හෝ උපදී … දැනගනී.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්‍ද, නැවත අනෙකක් ද කියමි: මහණ දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. දහම්හි දහම් අනු ව දක්නාසුලු ව වෙසෙන ඔහුට දහම් අරමුණු කොට ඇති කයෙහි දැවිල්ලෙක් හෝ උපදී. සිතේ සැඟවුණු බවෙක් හෝ වේ. පිටත හෝ සිත විසිරේ. ආනන්‍ද, ඒ මහණහු විසින් පැහැදිය යුතු කිසියම් නිමිත්තෙක සිත පිහිටුවියයුතු. පැහැදියයුතු කිසියම් නිමිත්තෙක සිත පිහිටුවන ඔහුට ප්‍රමුදිත භාවය උපදී. හටගත් ප්‍රමෝද ඇත්තහුට ප්‍රීතිය උපදී. ප්‍රීතිසිත් ඇත්තහුගේ කය සැහැල්ලු වේ. සැහැල්ලු කය ඇත්තේ සුව විඳී. සුව ඇත්තහුගේ සිත එකඟ වේ. හේ මම යමක් පිණිස සිත පිහිටුවෙම් නම් ඒ අරුත මට නිපන. ඒකාන්තයෙන් දැන් ආපසු හැර ගනිමි”යි මෙසේ නුවණින් සලකා බලයි. හේ ආපසු හැර ගැනීමත් කෙරෙයි. විතර්‍ක නො ද කෙරෙයි. විචාර නො ද කෙරෙයි. විතර්‍ක නැත්තෙම් විචාර නැත්තෙම් ඇතුළත සිහි ඇත්තෙම් හටගත් සුව ඇත්තෙම් වෙමි යි දැනගනී. ආනන්‍ද, මෙසේ (සිත) පිහිටුවා වැඩීම වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 284,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කථඤ්චානන්ද , අප්පණිධාය භාවනා හොති: බහිද්ධා ආනන්ද, භික්ඛු චිත්තං අප්පණිධාය “අප්පණිහිතං මෙ බහිද්ධා චිත්තන්ති” පජානාති. අථ පච්ඡා පුරෙ අසඞ්ඛිත්තං විමුත්තං අප්පණිහිතන්ති පජානාති. අථ ච පන කායෙ කායානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා සුඛිතස්මී{1}ති පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "බහිද්ධානන්ද, භික්ඛු චිත්තං අප්පණිධාය “අප්පණිහිතං මෙ බහිද්ධා චිත්තන්ති” පජානාති. අථ පච්ඡා පුරෙ අසඞ්ඛිත්තං විමුත්තං අප්පණිහිතන්ති පජානාති. අථ ච පන වෙදනාසු වෙදනානුපස්සී විහරාමි, ආතාපී සම්පජානො සතිමා සුඛිතස්මීති පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "බහිද්ධානන්ද, භික්ඛු චිත්තං අප්පණිධාය “අප්පණිහිතං මෙ බහිද්ධා චිත්තන්ති” පජානා’ති. අථ පච්ඡා පුරෙ අසඞ්ඛිත්තං විමුත්තං අප්පණිහිතන්ති පජානාති. අථ ච පන චිත්තෙ චිත්තානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා සුඛිතස්මීති{1} පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "බහිද්ධානන්ද, භික්ඛු චිත්තං අප්පණිධාය “අප්පණිහිතං මෙ බහිද්ධා චිත්ත”න්ති පජානාති. අථ පච්ඡා පුරෙ අසඞ්ඛිත්තං විමුත්තං අප්පණිහිතන්ති පජානාති. අථ ච පන ධම්මෙසු ධම්මානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා සුඛිතස්මීති පජානාති. එවං ඛො ආනන්ද, අප්පණිධාය භාවනා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉති ඛො ආනන්ද, දෙසිතා මයා පණිධාය භාවනා, දෙසිතා අප්පණිධාය භාවනා. යං ආනන්ද, සත්ථාරා කරණීයං සාවකානං හිතෙසිනා අනුකම්පකෙන අනුකම්පං උපාදාය, කතං වො තං මයා: එතානි ආනන්ද, රුක්ඛමූලානි, එතානි සුඤ්ඤාගාරානි, ඣායථානන්ද, මා පමාදත්ථ, මා පච්ඡා විප්පටිසාරිනො අහුවත්ථ, අයං වො අම්හාකං අනුසාසනීති."
                    },
                    {
                        "type": "centered",
                        "text": "අම්බපාලිවග්ගො පඨමො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රුද්දානං:**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අම්බපාලි සතො භික්ඛු සාලා කුසලරාසි ච\nසකුණග්ඝි මක්කටො සූදො ගිලානො භික්ඛුනුපස්සයොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සුඛමස්මීති - මඡසං, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "ආනන්‍ද, (සිත) නොපිහිටුවා වැඩීම කෙසේ වේ ද යත්: ආනන්‍ද, මහණ පිටත සිත නොපිහිටුවා මාගේ සිත පිටත නො පිහිටුවන ලදැ යි දැනගනී. නැවත පසුව පෙර නො හැකුළුනේ මිදුණේ නො පිහිටුවන ලද්දේ ය යි දැනගනී. එසේ වතුදු කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව වෙසෙමි. හටගත් සුව ඇත්තෙම් වෙමි යි දැනගනී.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්‍ද, මහණ පිටත සිත නො පිහිටුවා මාගේ සිත පිටත නො පිහිටුවන ලදැ යි දැනගනී. නැවත පසුව පෙර නො හැකුළුනේ මිදුණේ නො පිහිටුවන ලද්දේ ය යි දැනගනී. එසේ වතු දු වේදනාවන්හි වේදනා අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව වෙසෙමි, හටගත් සුව ඇත්තෙම් වෙමි යි දැනගනී.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්‍ද, මහණ පිටත සිත නො පිහිටුවා මාගේ සිත පිටත නො පිහිටුවන ලදැ යි දැනගනී. යළි පසු ව පෙර නො හැකුළුනේ මිදුණේ නො පිහිටුවන ලද්දේ ය යි දැනගනී. එසේ වතුදු සිත්හි සිත් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව වෙසෙමි, හටගත් සුව ඇත්තෙම් වෙමි යි දැනගනී.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්‍ද, මහණ පිටත සිත නො පිහිටුවා මාගේ සිත පිටත නො පිහිටුවන ලදැයි දැනගනී. යළි පසු ව පෙර නො හැකුළුනේ මිදුණේ නො පිහිටුවන ලද්දේ ය යි දැනගනී. එසේ වතුදු දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇතියෙම් මනාදැනුම් ඇතියෙම් සිහි ඇතියෙම් වෙසෙමි, හටගත් සුව ඇත්තෙම් වෙමි යි දැනගනී. ආනන්‍ද, මෙසේ (සිත) නො පිහිටුවා වැඩීම වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්‍ද, මෙසේ මා විසින් සිත පිහිටුවා වැඩීම දේශනා කරන ලදී. සිත නො පිහිටුවා වැඩීම දේශනා කරන ලදී. ආනන්‍ද, සව්වන්ට වැඩ කැමති අනුකම්පා කරන ශාස්තෘවරයකු විසින් අනුකම්පාව නිසා යමක් කටයුතු නම් මා විසින් එය තොපට කරන ලදී. ආනන්‍ද, තෙල රුක්මුල් ඇත. තෙල ශුන්‍යාගාර ඇත. ආනන්‍ද, ධ්‍යාන කරවු. නහමක් පමාවවු. පසුව නහමක් විපිළිසර ඇත්තෝ වවු. මේ තොපට අපගේ අනුශාසනා යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පළමුවැනි අම්බපාලිවර්‍ග යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි සූත්‍ර නාමාවලිය:**",
                        "type": "unindented"
                    },
                    {
                        "text": "අම්බපාලි, සතෝ, භික්ඛු, සාලා, කුසලරාසි, සකුණග්ඝි, මක්කට, සූද, ගිලාන, බික්ඛුනූපස්සය යී දශසූත්‍රාන්තකෙනෙකි යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 286,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "2. නාලන්දාවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මහාපුරිසසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "1189. **සාවත්ථියං -**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා සාරිපුත්තො යෙන භගවා තෙනුපසඞ්කමි. -පෙ- එකමන්තං නිසින්නො ඛො ආයස්මා සාරිපුත්තො භගවන්තං එතදවොච: “මහාපුරිසො මහාපුරිසොති භන්තෙ, වුච්චති. කිත්තාවතා නු ඛො: භන්තෙ, මහාපුරිසො හොතී”ති: විමුත්තචිත්තත්තා ඛො’හං සාරිපුත්ත, මහාපුරිසොති වදාමි. අවිමුත්තචිත්තත්තා නො මහාපුරිසොති වදාමි. කථඤ්ච සාරිපුත්ත, විමුත්තචිත්තො හොති: ඉධ සාරිපුත්ත, භික්ඛු කායෙ කායානුපස්සී විහරති. ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තස්ස කායෙ කායානුපස්සිනො විහරතො චිත්තං විරජ්ජති, විමුච්චති අනුපාදාය ආසවෙහි. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති, ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තස්ස ධම්මෙසු ධම්මානුපස්සිනො විහරතො චිත්තං විරජ්ජති, විමුච්චති, අනුපාදාය ආසවෙහි. එවං ඛො සාරිපුත්ත, විමුත්තචිත්තො හොති. විමුත්තචිත්තත්තා ඛො’හං සාරිපුත්ත, මහාපුරිසොති වදාමි. අවිමුත්තචිත්තත්තා නො මහාපුරිසොති වදාමීති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නාලන්දාසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1190. එකං සමයං භගවා නාලන්දායං විහරති පාවාරිකම්බවනෙ. අථ ඛො ආයස්මා සාරිපුත්තො යෙන භගවා තෙනුපසඞ්කමි. -පෙ- එකමන්තං නිසින්නො ඛො ආයස්මා සාරිපුත්තො භගවන්තං එතදවොච: “එවංපසන්නො’හං භන්තෙ, භගවති ‘න චාහු න ච භවිස්සති, න චෙතරහි විජ්ජති, අඤ්ඤො සමණො වා බ්රාහ්මණො වා භගවතා භිය්යො’භිඤ්ඤතරො යදිදං සම්බොධිය”න්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "2. නාලන්‍ද වර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මහාපුරිස සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1189. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "text": "එකල්හි ආයුෂ්මත් සැරියුත් තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ ... එකත් පසෙක හුන් ආයුෂ්මත් සැරියුත් තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැලකළහ: “වහන්ස, මහාපුරිස මහාපුරිස” යි කියනු ලැබේ. වහන්ස, කෙතෙකින් මහාපුරිස වේ දැ?” යි. සාරිපුත්ත, මිදුණු සිත් ඇති බැවින් මහාපුරිස ය යි මම කියමි. නො මිදුණු සිත් ඇති බැවින් මහාපුරිස නො වේ ය යි කියමි. සාරිපුත්ත කෙසේ නම් මිදුණු සිත් ඇත්තේ වේ ද යත්: සාරිපුත්ත, මෙසස්නෙහි මහණ කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙයි. කයෙහි කය අනු ව දක්නාසුලු ව වෙසෙන ඔහුගේ සිත නො ඇලේ. උපාදාන රහිත ව කෙලෙසුන්ගෙන් මිදේ. විඳුම්හි ... සිත්හි ... දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. දහම්හි දහම් අනු ව දක්නාසුලු ව වෙසෙන ඔහුගේ සිත නො ඇලේ. උපාදාන රහිත ව කෙලෙසුන්ගෙන් මිදේ. සාරිපුත්ත, මෙසේ මිදුණු සිත් ඇත්තේ වෙයි. සාරිපුත්ත, මිදුණුසිත් ඇති බැවින් මහාපුරිස ය යි මම කියමි. නොමිදුණු සිත් ඇති බැවින් මහාපුරිස නො වේ ය යි කියමි යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "නාලන්‍දා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1190. එක්කලෙක භාග්‍යවතුන් වහන්සේ නාලන්‍දානුවර සමීපයෙහි පාවාරික අඹවෙනෙහි වැඩවසන සේක. එකල්හි ආයුෂ්මත් සැරියුත් තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ ... එකත්පස් ව හුන් සැරියුත් තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැලකළහ: “වහන්ස, යම් මේ සව්නේ නුවණෙහි හෝ රහත්මඟ නුවණෙහි ලා භාග්‍යවතුන් වහන්සේට වඩා උත්තරීතර නුවණ ඇනි අන් මහණෙක් හෝ බමුණෙක් හෝ නො ද වී ය. නො ද වන්නේ ය. දැනුදු නැත්තේ ය” යි මෙසේ මම භාග්‍යවතුන් වහන්සේ කෙරෙහි පැහැදිණිමි” යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 288,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "උළාරාත්යත්රායං{1} සාරිපුත්ත, ආසභී වාචා භාසිතා, එකංසො ගහිතො, සීහනාදො නදිතො, එවංපසන්නො’හං භන්තෙ, භගවති: “න චාහු න ච භවිස්සති න චෙතරහි විජ්ජති අඤ්ඤො සමණො වා බ්රාහ්මණො වා භගවතා භිය්යොභිඤ්ඤතරො යදිදං සම්බොධිය”න්ති. කින්නු තෙ සාරිපුත්ත, යෙ තෙ අහෙසුං අතීතමද්ධානං අරහන්තො සම්මාසම්බුද්ධා සබ්බෙ තෙ භගවන්තො චෙතසා චෙතො පරිච්ච විදිතා. එවංසීලා තෙ භගවන්තො අහෙසුං ඉති වා, එවංධම්මා තෙ භගවන්තො අහෙසුං ඉති වා, එවංපඤ්ඤා තෙ භගවන්තො අහෙසුං ඉති වා, එවංවිහාරිනො තෙ භගවන්තො අහෙසුං ඉති වා එවංවිමුත්තා තෙ භගවන්තො අහෙසුං ඉති වාති? නොහෙතං භන්තෙ,"
                    },
                    {
                        "type": "paragraph",
                        "text": "කිම්පන තෙ සාරිපුත්ත, යෙ තෙ භවිස්සන්ති අනාගතමද්ධානං අරහන්තො සම්මාසම්බුද්ධා, සබ්බෙ තෙ භගවන්තො චෙතසා චෙතො පරිච්ච විදිතා: “එවංසීලා තෙ භගවන්තො භවිස්සන්ති ඉති වා, එවංධම්මා තෙ භගවන්තො භවිස්සන්ති ඉති වා, එවංපඤ්ඤා තෙ භගවන්තො භවිස්සන්ති ඉති වා, එවංවිහාරිනො තෙ භගවන්තො, භවිස්සන්ති ඉති වා, එවංවිමුත්තා තෙ භගවන්තො භවිස්සන්ති ඉති වාති? නො හෙතං භන්තෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "කිං පන තෙ{2} සාරිපුත්ත, එතරහි අරහං සම්මාසම්බුද්ධො චෙතසා චෙතො පරිච්ච විදිතො: “එවංසීලො භගවා ඉති වා, එවංධම්මො භගවා ඉති වා, එවංපඤ්ඤො භගවා ඉති වා, එවංවිහාරී භගවා ඉති වා, එවංවිමුත්තො භගවා ඉතිප්පවා”ති? නො හෙතං භන්තෙ. එත්ථ ච තෙ සාරිපුත්ත, අතීතානාගතපච්චුපන්නෙසු අරහන්තෙසු සම්මාසම්බුද්ධෙසු චෙතොපරියඤාණං{3} නත්ථි. අථ කිඤ්චරහි තයා{4} සාරිපුත්ත, උළාරා ආසභී වාචා භාසිතා, එකංසො ගහිතො, සීහනාදො නදිතො: “එවං පසන්නොහං භන්තෙ, භගවති නචාහු නච භවිස්සති න චෙතරහි විජ්ජති අඤ්ඤො සමණො වා බ්රාහ්මණො වා භගවතා භිය්යොභිඤ්ඤතරො යදිදං සම්බොධිය”න්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උළාරා ඛො ත්යායං - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ත්යාහං - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. චෙතොපරියායඤාණං - සී 1, 2. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. ත්යායං - මඡසං, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "සාරිපුත්ත, සව්නේ නුවණෙහි හෝ රහත්මඟ නුවණෙහි ලා භාග්‍යවතුන් වහන්සේට වඩා උත්තරීතර ඤාන ඇති අන් මහණෙක් හෝ බමුණෙක් හෝ නො ද වී ය, නො ද වන්නේ ය, දැනුදු නැත්තේ ය යි මෙසේ මම භාග්‍යවතුන් වහන්සේ කෙරෙහි පැහැදිණිමි” යි යන මේ ශ්‍රේෂ්ඨය අකම්ප්‍ය වචනයෙක් මෙහි ලා කියන ලදී. ඒකාන්තයෙන් ගන්නා ලද සිංහනාදයෙක් පවත්වන ලදී. සාරිපුත්ත, කිම? ඉකුත්කල යම් ඒ අර්‍හත් සම්මාසම්බුදුවරයෝ පහළ වූ සේක් නම් ඒ සියලු සම්බුදුවරයෝ “තොප විසින් ඒ භාග්‍යවතුන් වහන්සේලා මෙබඳු සිල් ඇත්තෝ වූ සේකැයි හෝ ඒ භාග්‍යවතුන් වහන්සේලා මෙබඳු දහම් ඇත්තෝ වූ සේකැ යි හෝ ඒ භාග්‍යවතුන් වහන්සේලා මෙබඳු නුවණ ඇත්තෝ වූ සේකැ යි හෝ ඒ භාග්‍යවතුන් වහන්සේලා මෙබඳු විහරණ ඇත්තෝ වූ සේකැ යි හෝ ඒ භාග්‍යවතුන් වහන්සේලා මෙබඳු විමුක්ති ඇත්තෝ වූ සේකැ” යි හෝ සිතින් සිත පිරිසිඳ දන්නා ලද්දෝ දැ? යි වහන්ස මෙය නැත් ම ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සාරිපුත්ත, කිමෙක් ද? මතුකල යම් ඒ අර්‍හත් සම්මාසම්බුදුවරයෝ පහළ වන සේක් නම් ඒ සියලු සම්බුදුවරයෝ තොප විසින් “ඒ සියලු භාග්‍යවතුන් වහන්සේ ලා මෙබඳු සිල් ඇත්තෝ වන්නාහ යි හෝ ඒ සියලු භාග්‍යවතුන් වහන්සේ ලා මෙබඳු දහම් ඇත්තෝ වන්නාහ යි හෝ ඒ සියලු භාග්‍යවතුන් වහන්සේලා මෙබඳු නුවණ ඇත්තෝ වන්නාහ යි හෝ ඒ සියලු භාග්‍යවතුන් වහන්සේ ලා මෙබඳු විහරණ ඇත්තෝ වන්නාහ යි හෝ ඒ සියලු භාග්‍යවතුන් වහන්සේලා මෙබඳු විමුක්ති ඇත්තෝ වන්නාහ” යි හෝ සිතින් සිත පිරිසිඳ දන්නා ලද්දාහු දැ? යි වහන්ස, මෙය නැත් ම ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සාරිපුත්ත, කිමෙක් ද? තොප විසින් දැන් අර්‍හත් සම්මාසම්බුදුරජ “භාග්‍යවතුන් වහන්සේ මෙබඳු සිල් ඇති සේකැ යි හෝ භාග්‍යවතුන් වහන්සේ මෙබඳු දහම් ඇති සේකැ යි හෝ භාග්‍යවතුන් වහන්සේ මෙබඳු ප්‍රඥා ඇති සේකැ යි හෝ භාග්‍යවතුන් වහන්සේ මෙබඳු විහරණ ඇති සේකැ යි හෝ භාග්‍යවතුන් වහන්සේ මෙබඳු විමුක්ති ඇති සේකැ යි හෝ සිතින් සිත පිරිසිඳ දන්නා ලද්දාහු දැ? යි. වහන්ස, මෙය නැත් ම ය. සාරිපුත්ත, මෙහි ලා තොපට අතීතානාගතපච්චුප්පන්න අර්‍හත් සම්මාසම්බුදුවරයන් කෙරෙහි චේතෝපරියඤාණයෙක් (=සිතින් සිත පිරිසිඳ දැනීමේ නුවණෙක්) නැත. එකල්හි කුමක් හෙයින් තොප විසින් “වහන්ස, යම් මේ සව්නේ නුවණෙහි හෝ රහත්මගනුවණෙහි ලා භාග්‍යවතුන් වහන්සේට වඩා උත්තරීතර නුවණ ඇති අන් මහණෙක් හෝ බමුණෙක් නො ද වීය. නොද වන්නේ ය. දැනුදු නැතැ යි මෙසේ මම භාග්‍යවතුන් වහන්සේ කෙරෙහි පැහැදිණිමි” යි ශ්‍රේෂ්ඨ අකම්ප්‍ය වචනයෙක් කියන ලද ද: ඒකාන්තයෙන් ගන්නා ලද සිංහනාදයෙක් පවත්වන ලද දැ? යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 290,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "න ඛො මෙ{1} භන්තෙ, අතීතානාගතපච්චුප්පන්නෙසු අරහන්තෙසු සම්මාසම්බුද්ධෙසු චෙතොපරියඤාණං අත්ථි. අපි ච ධම්මන්වයො විදිතො. සෙය්යථාපි භන්තෙ, රඤ්ඤො පච්චන්තිමං නගරං දළ්හුද්දාපං{2} දළ්හපාකාරතොරණං එකද්වාරං. තත්රස්ස දොවාරිකො පණ්ඩිතො ව්යත්තො මෙධාවී අඤ්ඤාතානං නිවාරෙතා ඤාතානං පවෙසෙතා. සො තස්ස නගරස්ස සමන්තා අනුපරියායපථං අනුක්කමමානො න පස්සෙය්ය පාකාරසන්ධිං වා පාකාරවිවරං වා, අන්තමසො බිළාලනික්ඛමනමත්තම්පි. තස්ස එවමස්ස, යෙ කෙචි ඔලාරිකා පාණා ඉමං නගරං පවිසන්ති වා නික්ඛමන්ති වා සබ්බෙ තෙ ඉමිනාව ද්වාරෙන පවිසන්ති වා නික්ඛමන්ති වාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙව ඛො මෙ{3} භන්තෙ, ධම්මන්වයො විදිතො: “යෙපි තෙ භන්තෙ, අහෙසුං අතීතමද්ධානං අරහන්තො සම්මාසම්බුද්ධා. සබ්බෙ තෙ භගවන්තො පඤ්චනීවරණෙ පහාය චෙතසො උපක්කිලෙසෙ පඤ්ඤාය දුබ්බලීකරණෙ චතූසු සතිපට්ඨානෙසු සුපට්ඨිතචිත්තා{4} සත්තබොජ්ඣඞ්ගෙ යථාභූතං භාවෙත්වා අනුත්තරං සම්මාසම්බොධිං අභිසම්බුජ්ඣිංසු. යෙපි තෙ භන්තෙ, භවිස්සන්ති අනාගතමද්ධානං අරහන්තො සම්මාසම්බුද්ධා සබ්බෙ තෙ භගවන්තො පඤ්චනීවරණෙ පහාය චෙතසො උපක්කිලෙසෙ පඤ්ඤාය දුබ්බලීකරණෙ චතූසු සතිපට්ඨානෙසු සුපට්ඨිතචිත්තා{4} සත්තබොජ්ඣඞ්ගෙ යථාභූතං භාවෙත්වා අනුත්තරං සම්මාසම්බොධිං අභිසම්බුජ්ඣිස්සන්ති. භගවාපි භන්තෙ, එතරහි අරහං සම්මා සම්බුද්ධො පඤ්චනීවරණෙ පහාය, චෙතසො උපක්කිලෙසෙ පඤ්ඤාය දුබ්බලීකරණෙ, චතූසු සතිපට්ඨානෙසු සූපට්ඨිතචිත්තො, සත්තබොජ්ඣඞ්ගෙ යථාභූතං භාවෙත්වා, අනුත්තරං සම්මාසම්බොධිං අභිසම්බුද්ධො”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සාධු සාධු සාරිපුත්ත, තස්මාතිහ ත්වං සාරිපුත්ත, ඉමං ධම්මපරියායං අභික්ඛණං භාසෙය්යාසි{6}, භික්ඛූනං භික්ඛුනීනං උපාසකානං උපාසිකානං. යෙසම්පි හි සාරිපුත්ත, මොඝපුරිසානං භවිස්සති තථාගතෙ කඞ්ඛා වා විමති වා තෙසම්පිමං ධම්මපරියායං සුත්වා යා තථාගතෙ{7} කඞ්ඛා වා විමති වා සා පහීයිස්සතී ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. න ඛො මෙ තං - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. දළහුද්ධාපං - මඡසං, දළහද්ධාලං - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ඛො භන්තෙ - සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "4. සුප්පතිට්ඨිතචිත්තා - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "6. භාවෙය්යාසි - සී 1."
                    },
                    {
                        "type": "footnote",
                        "text": "7. සුත්වා තථාගතෙ - සී 1, 2."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "වහන්ස, අතීනානාගතපච්චුප්පන්න වූ අර්‍හත් සම්මාසම්බුදුරජාණන් වහන්සේ කෙරෙහි චේතෝපරිය ඤාණයෙක් මට නැත. එසේ වුව ද, දහම් අනුව දන්නා ලදී. වහන්ස, යම්සේ රජකුට දැඩිපවුරු ඇති දැඩිපවුරු තොරන් ඇති එක් දොරක් ඇති පසල්නුවරෙක් වේ ද: එහි පණ්ඩිත වූ ව්‍යක්ත වූ නුවණ ඇති නො අඳුනන්නවුන් වළක්වන අඳුනන්නවුන් ඇතුළු කරන දොරටුපල්ලෙක් වන්නේ ය. හේ ඒ නුවර හාත්පස පවුර අවට මඟ අනුව යන්නේ යටත් පිරිසෙයින් බළලුන් නික්මෙන පමණ වූත් පවුරුසන්‍ධියක් (=ගඩොළු දෙකක් ඉවත් වූ තැනක්) හෝ පවුරු සිදුරක් (=සුන්තැනක්) හෝ නොදක්නේ ය. ඔහුට මෙසේ සිත් වන්නේ ය. යම්කිසි ඖදාරික ප්‍රාණීහු මේ නුවරට පිවිසෙත් නම් හෝ නික්මෙත් නම් හෝ ඒ සියල්ලෝ මේ දොරින් ම පිවිසෙත් හෝ නික්මෙත් හෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, එසෙයින් ම මා විසින් දහම් අනු ව දන්නා ලද්දේ ය. වහන්ස, ඉකුත්කල යම් ඒ අර්‍හත් සම්මාසම්බුදුවරයෝ පභළ වූ සේක් ද; ඒ සියලු භාග්‍යවතුන් වහන්සේලා සිත කෙලෙසන නුවණ දුබල කරන පස්නීවරණ පහ කොට සිවුසීවටන්හි මැනවින් එළඹ සිටි සිත් ඇති සේක් සත්බොජඟ තතු සේ වඩා අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කළ සේක. වහන්ස, මතුකලදු යම් ඒ අර්‍හත් සම්මාසම්බුදුවරයෝ පහළවන සේක් නම් ඒ සියලු භාග්‍යවතුන් වහන්සේලා සිත කෙලෙසන නුවණ දුබල කරන පස්නීවරණ පහ කොට සිවුසීවටන්හි මැනවින් එළඹ සිටි සිත් ඇති සේක් සත්බොජඟ තතුසේ වඩා අනුත්තර සම්මාසම්බෝධිය අවබෝධ කරන සේක. වහන්ස, මෙකල අර්‍හත් සම්මා සම්බුද්ධ වූ භාග්‍යවතුන් වහන්සේ ද සිත කෙලෙසන නුවණ දුබල කරණ පස්නීවරණ පහ කොට සිවුසීවටන්හි මැනවින් එළඹ සිටි සිත් ඇතිසේක් සත්බොජඟ තතුසේ වඩා අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කළ සේකැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සාරිපුත්ත, මැනවි, මැනවි, සාරිපුත්ත, එහෙයින් මෙහි ලා තෙපි මේ දහම්නය මහණුනට මෙහෙණනට උවසුනට උවැසියනට එක්වන් කියන්නහු. සාරිපුත්ත, යම් හිස්පුරුෂයනට දු තථාගතයන් කෙරෙහි යම් සැකයෙක් හෝ විමතියෙක් හෝ වන්නේ නම් මේ දහම්නය අසා ඔවුන්ගේත් තථාගතයන් කෙරෙහි වූ යම් සැකයෙක් හෝ විමතියෙක් හෝ වේ ද; එය ප්‍රහීණ වන්නේ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 292,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 2. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "චුන්දසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1191. එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තෙන ඛො පන සමයෙන ආයස්මා සාරිපුත්තො මගධෙසු විහරති නාළකගාමකෙ{1}, ආබාධිකො දුක්ඛිතො බාළ්හගිලානො. චුන්දො ච සමණුද්දෙසො ආයස්මතො සාරිපුත්තස්ස උපට්ඨාකො හොති. අථ ඛො ආයස්මා සාරිපුත්තො තෙනෙව ආබාධෙන පරිනිබ්බායි. අථ ඛො චුන්දො සමණුද්දෙසො ආයස්මතො සාරිපුත්තස්ස පත්තචීවරං ආදාය යෙන සාවත්ථි ජෙතවනං අනාථපිණ්ඩිකස්ස ආරාමො, යෙනායස්මා ආනන්දො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මන්තං ආනන්දං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො චුන්දො සමණුද්දෙසො ආයස්මන්තං ආනන්දං එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "“ආයස්මා භන්තෙ, සාරිපුත්තො පරිනිබ්බුතො. ඉදමස්ස පත්තචීවර”න්ති. අත්ථි ඛො ඉදං ආවුසො කථාපාභතං භගවන්තං දස්සනාය. ආයාමාවුසො චුන්ද, යෙන භගවා තෙනුපසඞ්කමිස්සාම. උපසඞ්කමිත්වා භගවතො එතමත්ථං ආරොචෙස්සාමාති. එවං භන්තෙ’ති ඛො චුන්දො සමණුද්දෙසො ආයස්මතො ආනන්දස්ස පච්චස්සොසි. අථ ඛො ආයස්මා ච ආනන්දො චුන්දො ච සමණුද්දෙසො යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නො ඛො ආයස්මා ආනන්දො භගවන්තං එතදවොච: “අයං භන්තෙ, චුන්දො සමණුද්දෙසො එවමාහ. ආයස්මා භන්තෙ, සාරිපුත්තො පරිනිබ්බුතො, ඉදමස්ස පත්තචීවර”න්ති. අපි ච මෙ භන්තෙ, මධුරකජාතො විය කායො, දිසාපි මෙ න පක්ඛායන්ති. ධම්මාපි මං නප්පටිභන්ති. ආයස්මා සාරිපුත්තො පරිනිබ්බුතො’ති සුත්වාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කින්නු ඛො තෙ ආනන්ද, සාරිපුත්තො සීලක්ඛන්ධං වා ආදාය පරිනිබ්බුතො, සමාධික්ඛන්ධං වා ආදාය පරිනිබ්බුතො, පඤ්ඤාක්ඛන්ධං වා ආදාය පරිනිබ්බුතො, විමුත්තික්ඛන්ධං වා ආදාය පරිනිබ්බුතො, විමුත්තිඤාණදස්සනක්ඛන්ධං වා ආදාය පරිනිබ්බුතොති? න ච ඛො මෙ භන්තෙ.{2} ආයස්මා සාරිපුත්තො සීලක්ඛන්ධං වා ආදාය පරිනිබ්බුතො -පෙ- විමුත්තිඤාණදස්සනක්ඛන්ධං වා ආදාය පරිනිබ්බුතො. අපි ච භන්තෙ, ආයස්මා සාරිපුත්තො ඔවාදකො අහොසි, විඤ්ඤාපකො සන්දස්සකො සමාදපකො සමුත්තෙජකො සම්පහංසකො අකිලාසු ධම්මදෙසනාය, අනුග්ගාහකො සබ්රහ්මචාරීනං. තං මයං ආයස්මතො සාරිපුත්තස්ස ධම්මොජං ධම්මභොගං ධම්මානුග්ගහං අනුස්සරාමාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. නාලකගාමකෙ - සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "2. න ඛො මෙ තං භන්තෙ - සී 1, 2. න ච ඛො මෙ භන්තෙ - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 2. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "චුන්‍ද සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1191. එක්සමයෙක භාග්‍යවතුන් වහන්සේ සැවත සමීපයෙහි අනේපිඬු සිටුහුගේ දෙව්රම්හි වැඩවසන සේක. එසමයෙහි ආයුෂ්මත් සැරියුත් තෙරණුවෝ මගදදනව්වෙහි නාළකගම්හි හටගත් ආබාධ ඇත්තාහු දුකට පැමිණියාහු දැඩිසේ ගිලන් වූවාහු වැඩවෙසෙති. චුන්‍දහෙරණ තෙමේත් ආයුෂ්මත් සැරියුත් තෙරණුවන්ට උවටැන් කරන්නේ වේ. එකල්හි ආයුෂ්මත් සැරියුත් තෙරණුවෝ ඒ ආබාධයෙන් ම පිරිනිවියහ. ඉක්බිති චුන්‍ද හෙරණ ආයුෂ්මත් සැරියුත් තෙරණුවන්ගේ පාසිවුරු ගෙන සැවැත්නුවර අනේපිඬුසිටුහුගේ දෙව්රම්හි ආයුෂ්මත් ආනන්‍ද තෙරණුවන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් ආනන්‍ද තෙරණුවන් වැඳ එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් චුන්‍ද හෙරණ ආයුෂ්මත් ආනන්‍ද තෙරණුවන්ට මෙය කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, ආයුෂ්මත් සැරියුත් තෙරණුවෝ පිරිනිවියහ. මේ උන්වහන්සේගේ පාසිවුරු යි ඇවැත්නි, භාග්‍යවතුන් වහන්සේ දකිනු වස් මේකතාපඬුරෙක් ඇත. ඇවත චුන්‍ද, යමු. භාග්‍යවතුන් වහන්සේ වෙත එළඹෙන්නෙමු. එළඹ භාග්‍යවතුන් වහන්සේට මෙ අරුත සැලකරන්නෙමු යි. වහන්ස, එසේ ය යි චුන්‍දහෙරණ ආයුෂ්මත් ආනන්‍ද තෙරණුවන්ට පිළිතුරු දිනි. එකල්හි ආයුෂ්මත් ආනන්‍ද තෙරණුවෝත් චුන්‍දහෙරණුවෝත් භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්හ. එකත්පසෙක හුන් ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැලකළහ: වහන්ස, මේ චුන්‍ද හෙරණ මෙසේ කියයි: “වහන්ස, ආයුෂ්මත් සැරියුත් තෙරණුවෝ පිරිනිවියහ. මේ උන්වහන්සේගේ පාසිවුරු” යි. වහන්ස, තව ද ආයුෂ්මත් සැරියුත් තෙරණුවෝ පිරිනිවියහ යි අසා මාගේ සිරුර තද වූවාක් මෙනි. දිශාවෝ ද මට පැහැදිලි නො වෙත්. දහම් ද මට නොවැටහේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්‍ද, කිමෙක් ද? සැරියුත් තොපගේ ශීලස්කන්‍ධය හෝ රැගෙන පිරිනිවියේ ද? සමාධිස්කන්‍ධය හෝ රැගෙන පිරිනිවියේ ද? ප්‍රඥාස්කන්‍ධය හෝ රැගෙන පිරිනිවියේ ද? විමුක්තිස්කන්‍ධය හෝ රැගෙන පිරිනිවියේ ද? විමුක්තිඥානදර්‍ශනස්කන්‍ධය හෝ රැගෙන පිරිනිවියේ දැ?යි. වහන්ස, ආයුෂ්මත් සැරියුත් තෙරණුවෝ මාගේ ශීලස්කන්‍ධය හෝ රැගෙන නො පිරිනිවියහ ... මාගේ විමුක්තිඥානදර්‍ශනස්කන්‍ධය හෝ රැගෙන නො ම පිරිනිවියහ. වහන්ස, එතෙකුදු වුවත් ආයුෂ්මත් සැරියුත් තෙරණුවෝ අවවාද කරන්නෙක් කරුණු අඟවන්නෙක් කරුණු දක්වන්නෙක් සමාදන් කරවන්නෙක් තෙද ගන්වන්නෙක් සතුටු කරවන්නෙක් දම්දෙසුම්හි නො පසුබස්නෙක් සබ්‍රම්සරුන්ට අනුග්‍රහ කරන්නෙක් වූහ. අපි ආයුෂ්මත් සැරියුත් තෙරණුවන්ගේ ඒ ධර්මොජස ධර්‍මහොගය ධර්‍මානුග්‍රහ සිහි කරමු යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 294,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "නනු තං ආනන්ද, මයා පටිගච්චෙව අක්ඛාතං: “සබ්බෙහි පියෙහි මනාපෙහි නානාභාවො විනාභාවො අඤ්ඤථාභාවො, තං කුතෙත්ථ ආනන්ද, ලබ්භා යං තං ජාතං භූතං සඞ්ඛතං පලොකධම්මං තං වත මා පලුජ්ජීති, නෙතං ඨානං විජ්ජති, සෙය්යථාපි ආනන්ද, මහතො රුක්ඛස්ස තිට්ඨතො සාරවතො සො මහන්තතරො ඛන්ධො සො පලුජ්ජෙය්ය, එවමෙව ඛො ආනන්ද, මහතො භික්ඛුසඞ්ඝස්ස තිට්ඨතො සාරවතො සාරිපුත්තො පරිනිබ්බුතො. තං කුතෙත්ථ ආනන්ද, ලබ්භා, යං තං ජාතං භූතං සඞ්ඛතං පලොකධම්මං තං වත මා පලුජ්ජීති, නෙතං ඨානං විජ්ජති. තස්මාතිහානන්ද, අත්තදීපා විහරථ, අත්තසරණා අනඤ්ඤසරණා, ධම්මදීපා ධම්මසරණා අනඤ්ඤසරණා."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්චානන්ද, භික්ඛු අත්තදීපො විහරති අත්තසරණො අනඤ්ඤසරණො. ධම්මදීපො ධම්මසරණො අනඤ්ඤසරණා: ඉධානන්ද, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. එවං ඛො ආනන්ද, භික්ඛු අත්තදීපො විහරති අත්තසරණො අනඤ්ඤසරණො, ධම්මදීපො ධම්මසරණො අනඤ්ඤසරණො. යෙහි කෙචි ආනන්ද, එතරහි වා මමච්චයෙ වා අත්තදීපා විහරිස්සන්ති අත්තසරණා අනඤ්ඤසරණා ධම්මදීපා ධම්මසරණා අනඤ්ඤසරණා. තමතග්ගෙ මෙ තෙ ආනන්ද, භික්ඛූ භවිස්සන්ති යෙ කෙචි සික්ඛාකාමා”ති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උක්කචෙලසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1192. එකං සමයං භගවා වජ්ජීසු විහරති උක්කචෙලායං නදියා තීරෙ මහතා භික්ඛුසඞ්ඝෙන සද්ධිං අචිරපරිනිබ්බුතෙසු සාරිපුත්තමොග්ගල්ලානෙසු. තෙන ඛො පන සමයෙන භගවා භික්ඛුසඞ්ඝපරිවුතො අබ්භොකාසෙ නිසින්නො හොති. අථ ඛො භගවා තුණ්හීභූතං භික්ඛුසඞ්ඝං අනුවිලොකෙත්වා භික්ඛූ ආමන්තෙසි:"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "ආනන්‍ද, සියලු ප්‍රියමනාප වස්තුවලින් වෙනස්වනබව වෙන්වන බව අන්අයුරකට පැමිණෙනබව මා විසින් පළමු කොට ම කියන ලද්දේ නො වේ ද? ආනන්‍ද, ඒ යමක් උපන්නේ ද වූයේ ද හේතු ප්‍රත්‍යයෙන් හටගත්තේ ද වැනසෙන සැහැවි ඇත්තේ ද; එය ඒකාන්තයෙන් විනාශ නො වේවා යන ඒ කරුණ මෙහි ලා කොයින් ලැබිය හැකි ද මේ කරුණ නැත්තේ ය. ආනන්‍ද, යම්සේ පවත්නා හර ඇති මහත්රුකෙක යම් ඉතාමහත් කඳෙක් වේ ද; එය නැසෙන්නේ ය. ආනන්‍ද, එසෙයින් ම පවත්නා හර ඇති මහත් බික්සඟන පිළිබඳ සැරියුත් පිරිනිවියේ ය. ආනන්‍ද, යමක් උපන්නේ ද වූයේ ද හේතුප්‍රත්‍යයෙන් හටගත්තේ ද වැනසෙන ස්වභාව ඇත්තේ ද; එය ඒකාන්තයෙන් නො නැසේ වා යන ඒ කාරණය මෙහි ලා කොයින් ලැබිය හැකි ද මේ කාරණය නැත්තේ ය. ආනන්‍ද, එහෙයින් මෙහි ලා තමා පිහිට කොට තමා සරණ කොට මෙරමා පිහිට නො කොට දහම් පිහිට කොට දහම් සරණ කොට අනෙකක් පිහිට නො කොට වෙසෙවු.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්‍ද, කෙසේ නම් මහණ තමා පිහිට කොට තමා සරණ කොට මෙරමා පිහිට නො කොට දහම් පිහිට කොට දහම් සරණ කොට අනෙකක් පිහිට නො කොට වෙසේ ද යත්; ආනන්‍ද, මෙහි මහණ කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. වෙදනාහි ... සිත්හි ... දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. ආනන්‍ද, මෙසේ මහණ තමා පිහිට කොට තමා සරණ කොට මෙරමා පිහිට නො කොට දහම් පිහිට කොට දහම් සරණ කොට අනෙකක් පිහිට නො කොට වෙසේ. ආනන්‍ද, යම්කිසි භික්‍ෂු කෙනෙක් දැන් හෝ මාගේ ඇවෑමෙහි හෝ තමා පිහිට කොට තමා සරණ කොට මෙරමා පිහිට නො කොට දහම් පිහිට කොට දහම් සරණ කොට අනෙකක් පිහිට නො කොට වෙසෙන්නාහු නම් ආනන්‍ද, යම්කිසි භික්‍ෂු කෙනෙක් ශික්‍ෂාකාමී වන්නාහු නම් ඒ මේ භික්‍ෂූහු අග්‍රතම වෙති යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උක්කචෙල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1192. එක්කලෙක භාග්‍යවතුන් වහන්සේ සැරියුත්මුගලන් දෙනම පිරිනිවී නො බෝකල් ඇති සමයෙහි වැදෑදනව්වෙහි උක්කචෙලා නුවර සමීපයෙහි ගඞ්ගා ගංඉවුරෙහි මහත් බික්සඟන සමග වැඩවසන සේක. එසමයෙහි භාග්‍යවතුන් වහන්සේ බික්සඟන විසින් පිරිවරන ලද සේක් එලිමහන්හි වැඩහුන් සේක් වෙති. එකල්හි භාග්‍යවතුන් වහන්සේ නිහඬ බික්සඟන දෙස බලා භික්‍ෂූන් ඇමතූ සේක:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 296,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“අපි ච ඛ්වායං{1} භික්ඛවෙ, පරිසා සුඤ්ඤා විය ඛායති පරිනිබ්බුතෙසු සාරිපුත්තමොග්ගල්ලානෙසු අසුඤ්ඤා මෙ{2} සා භික්ඛවෙ, පරිසා{3} හොති අනපෙඛා තස්සං දිසායං හොති, යස්සා දිසායං සාරිපුත්තමොග්ගල්ලානා විහරන්ති. යෙ’පි තෙ භික්ඛවෙ, අහෙසුං අතීතමද්ධානං අරහන්තො සම්මාසම්බුද්ධා, තෙසම්පි භගවන්තානං එතපරමං යෙව සාවකයුගං අහොසි, සෙය්යථාපි මය්හං සාරිපුත්තමොග්ගල්ලානා. යෙ’පි තෙ භික්ඛවෙ, භවිස්සන්ති අනාගතමද්ධානං අරහන්තො සම්මාසම්බුද්ධා, තෙසම්පි භගවන්තානං එතපරමං යෙව සාවකයුගං භවිස්සති, සෙය්යථාපි මය්හං සාරිපුත්තමොග්ගල්ලානා. අච්ඡරියං භික්ඛවෙ, සාවකානං අබ්භුතං භික්ඛවෙ, සාවකානං සත්ථුසමානා ච{4} සාසනකරා භවිස්සන්ති ඔවාදපතිකරා චතුන්නඤ්ච පරිසානං පියා භවිස්සන්ති මනාපා ගරුභාවනීයා ච. අච්ඡරියං භික්ඛවෙ, තථාගතස්ස, අබ්භුතං භික්ඛවෙ, තථාගතස්ස එවරූපෙපි නාම සාවකයුගෙ{5} පරිනිබ්බුතෙ නත්ථි තථාගතස්ස සොකො වා පරිදෙවො වා. තං කුතෙත්ථ භික්ඛවෙ, යං තං ජාතං භූතං සඞ්ඛතං පලොකධම්මං, තං වත මා පලුජ්ජීති නෙතං ඨානං විජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි භික්ඛවෙ, මහතො රුක්ඛස්ස තිට්ඨතො සාරවතො යෙ මහන්තතරා ඛන්ධා තෙ පලුජ්ජෙය්යුං, එවමෙව ඛො භික්ඛවෙ, මහතො භික්ඛුසඞ්ඝස්ස තිට්ඨතො සාරවතො සාරිපුත්තමොග්ගල්ලානා පරිනිබ්බුතා. තං කුතෙත්ථ භික්ඛවෙ, ලබ්භා, යං තං ජාතං භූතං සඞ්ඛතං පලොකධම්මං, තං වත මා පලුජ්ජීති නෙතං ඨානං විජ්ජති. තස්මාතිහ භික්ඛවෙ, අත්තදීපා විහරථ අත්තසරණා අනඤ්ඤසරණා, ධම්මදීපා ධම්මසරණා අනඤ්ඤසරණා."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථඤ්ච භික්ඛවෙ, භික්ඛු අත්තදීපො විහරති අත්තසරණො අනඤ්ඤසරණො, ධම්මදීපො ධම්මසරණො අනඤ්ඤසරණො ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. එවං ඛො භික්ඛවෙ, භික්ඛු අත්තදීපො විහරති අත්තසරණො අනඤ්ඤසරණො, ධම්මදීපො ධම්මසරණො අනඤ්ඤසරණො. යෙ හි කෙචි භික්ඛවෙ, එතරහි වා මමච්චයෙ වා අත්තදීපා විහරිස්සන්ති අත්තසරණා අනඤ්ඤසරණා, ධම්මදීපා ධම්මසරණා අනඤ්ඤසරණා. තමතග්ගො මෙ තෙ භික්ඛවෙ, භික්ඛූ භවිස්සන්ති යෙ කෙචි සික්ඛාකාමාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අපි ම්යායං - මඡසං, අපි ඛො ම්යායං - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අසුඤ්ඤා සා - සී 1, 2, අසුඤ්ඤා මෙ භික්ඛවෙ - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. දිසා - සී 1, 2, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. සත්ථු ච නාම - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. සාවකයුගෙපි - සී 1, 2."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, සැරියුත්මුගලන් දෙනම පිරිනිවී කල්හි මේ මුළු පිරිස ම හිස් වූවාසේ වැටහේ. මහණෙනි, යම් දිගෙක සැරියුත් මුගලන් දෙනම වෙසෙත් නම් මාගේ ඒ පිරිස නො සිස් වේ. ඒ දික්හි පුනපුනා අපේක්‍ෂාව වේ. මහණෙනි, අතීතකාලයෙහි යම් ඒ අර්‍හත් සම්මාසම්බුදුවරයෝ වූ නම් ඒ භාග්‍යවතුන්ට ද දැන් මට සැරියුත්මුගලන් දෙනම යම්සේ නම් එබඳු වූ ම සවුයුවලෙක් වී ය. මහණෙනි, අනාගතකාලයෙහි යම් ඒ අර්‍හත්සම්මාසම්බුදුවරයෝ වන්නාහු නම් ඒ භාග්‍යවතුන්ට ද දැන් මට සැරියුත්මුගලන් දෙනම යම්සේ නම් එබඳු වූ ම සවුයුවලෙක් වන්නේ ය. මහණෙනි, සව්වන්ගේ අසිරියෙකි. මහණෙනි, සව්වන්ගේ පුදුමයෙකි. ශාස්තෘසම වූවෝ ම සස්න කරන්නෝ අවවාදය අනු ව ක්‍රියා කරන්නෝ වන්නාහ. සිවුපිරිසට ප්‍රිය වූවෝ ද මන වඩන්නෝ ද ගරු කටයුත්තෝ ද වන්නාහ. මහණෙනි, තථාගතයන්ගේ අසිරියෙකි. මහණෙනි, තථාගතයන්ගේ පුදුමයෙකි. මෙබඳු වූ ම ශ්‍රාවකයුග්මයක් පිරිනිවිකල්හි දු තථාගතයන්ට ශෝකයෙක් හෝ වැලපීමෙක් හෝ නැති මහණෙනි, ඒ යමක් උපන්නේ ද පහළ වූයේ ද හේතුයෙන් හටගත්තේ ද වැනසීම ස්වභාව කොට ඇත්තේ ද; එය ඒකාන්තයෙන් නො වැනසේවා යන මේ කාරණය මෙහි ලා කොයින් ලැබිය හැකි ද, මේ කාරණය නැත්තේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම්සේ හර ඇති සිටුනා මහත්රුකෙක යම් ඉතා මහත් කඳහු වෙත් නම් ඔහු වැනසෙන්නාහ. මහණෙනි, එසෙයින් ම හර ඇති සිටුනා මහත්බික්සඟනගේ සැරියුත්මුගලන්හු පිරිනිවියහ. මහණෙනි, ඒ යමක් උපන්නේ ද පහළ වූයේ ද හේතුයෙන් හටගත්තේ ද වැනසීම ස්වභාව කොට ඇත්තේ ද; එය ඒකාන්තයෙන් නො වැනසේවා යන මේ කාරණය මෙහි ලා කොයින් ලැබිය හැකි ද, මේ කාරණය නැත්තේ ය. මහණෙනි, එහෙයින් මෙහි ලා තමා පිහිට කොට තමා සරණ කොට මෙරමා පිහිට නො කොට දහම පිහිට කොට දහම සරණ කොට අනිකක් පිහිට නො කොට වෙසෙවු.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ නම් මහණ තමා පිහිට කොට තමා සරණ කොට මෙරමා පිහිට නො කොට දහම පිහිට කොට දහම සරණ කොට අනිකක් පිහිට නො කොට වෙසේ ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනු ව බලනසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. වේදනාහි ... සිත්හි ... දහම්හි දහම් අනුව බලනසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. මහණෙනි, මහණ මෙසේ තමා පිහිට කොට තමා සරණ කොට මෙරමා පිහිට නො කොට දහම පිහිට කොට දහම සරණ කොට අනිකක් පිහිට නො කොට වෙසේ. මහණෙනි, යම්කිසි භික්‍ෂු කෙනෙක් දැන් හෝ මාගේ ඇවෑමෙහි හෝ තමා පිහිට කොට තමා සරණ කොට මෙරමා පිහිව නො කොට දහම පිහිට කොට දහම සරණ කොට අනිකක් පිහිට නො කොට වසන්නාහු ද, මහණෙනි, යම්කිසි කෙනෙක් ශික්‍ෂාකාමී වන්නාහු ද, මහණෙනි, ඒ මේ භික්‍ෂූහු අග්‍රතම වෙති යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 298,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 2. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බාහියසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1193. අථ ඛො ආයස්මා බාහියො{1} යෙන භගවා තෙනුපසඞ්කමි. -පෙ- එකමන්තං නිසින්නො ඛො ආයස්මා බාහියො භගවන්තං එතදවොච: “සාධු මෙ භන්තෙ භගවා සඞ්ඛිත්තෙන ධම්මං දෙසෙතු, යමහං භගවතො ධම්මං සුත්වා එකො වූපකට්ඨො අප්පමත්තො ආතාපී පහිතත්තො විහරෙය්යන්ති”."
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්මාතිහ ත්වං බාහිය, ආදිමෙව විසොධෙහි කුසලෙසු ධම්මෙසු. කොචාදි කුසලානං ධම්මානං: සීලඤ්ච සුවිසුද්ධං, දිට්ඨි ච උජුකා. යතො ඛො තෙ බාහිය, සීලඤ්ච සුවිසුද්ධං භවිස්සති, දිට්ඨි ච උජුකා. තතො ත්වං බාහිය, සීලං නිස්සාය සීලෙ පතිට්ඨාය චත්තාරො සතිපට්ඨානෙ භාවෙය්යාසි. කතමෙ චත්තාරො: ඉධ ත්වං බාහිය, කායෙ කායානුපස්සී විහරාහි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරසි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. යතො ඛො ත්වං බාහිය, සීලං නිස්සාය සීලෙ පතිට්ඨාය ඉමෙ චත්තාරො සතිපට්ඨානෙ එවං භාවෙස්සසි, තතො තුය්හං බාහිය, යා රත්ති වා දිවසො වා ආගමිස්සති, වුද්ධියෙව පාටිකඞ්ඛා කුසලෙසු ධම්මෙසු, නො පරිහානී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා බාහියො භගවතො භාසිතං අභිනන්දිත්වා අනුමොදිත්වා උට්ඨායාසනා භගවන්තං අභිවාදෙත්වා පදක්ඛිණං කත්වා පක්කාමි. අථ ඛො ආයස්මා බාහියො එකො වූපකට්ඨො අප්පමත්තො ආතාපී පහිතත්තො විහරන්තො න චිරස්සෙව යස්සත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජන්ති, තදනුත්තරං බ්රහ්මචරියපරියොසානං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහාසි. ඛීණා ජාති, වුසිතං බ්රහ්මචරියං, කතං කරණීයං, නාපරං ඉත්ථත්තායාති අබ්භඤ්ඤාසි. අඤ්ඤතරො ච පනායස්මා බාහියො අරහතං අහොසීති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උත්තියසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1194. අථ ඛො ආයස්මා උත්තියො{2} යෙන භගවා තෙනුපසඞ්කමි -පෙ- තතො ත්වං උත්තිය, ගමිස්සසි මච්චුධෙය්යස්ස පාරන්ති. -පෙ- අඤ්ඤතරො ච පනායස්මා උත්තියො අරහතං අහොසීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. බාහිකො - සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "2. උත්තිකො - සී 1, 2."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 2. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බාහිය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1193. ඉක්බිති ආයුෂ්මත් බාහිය භාග්‍යවතුන් වහන්සේ කරා එළඹියේ ය ... එකත්පසෙක හුන් ආයුෂ්මත් බාහිය භාග්‍යවතුන් වහන්සේට මෙය සැලකෙළේය: “වහන්ස, මම භාග්‍යවතුන් වහන්සේගේ යම් දහමක් අසා එකලා වූයෙම් ගණයා කෙරෙන් වෙන් වූයෙම් නොපමා වූයෙම් කෙලෙස් තවන වැර ඇතියෙම් කායචිත්තදෙක්හි අපේක්‍ෂා රහිතයෙම් වසන්නෙම් නම් එබඳු දහමක් මට සැකෙවින් දෙසන සේක්වා” යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බාහිය එහෙයින් මෙහි ලා තෙපි කුසල්දහම්හි මුල ම පිරිසිදු කරවු. කුසල්දහමුන්ගේ මුල කවරේ ද යත්: ඉතා පිරිසිදු වූ සීලයත් ඉතා ඍජු වූ දෘෂ්ටියත් ය. බාහිය, යම් කලෙක තොපගේ ශීලය ඉතා පිරිසිදුත් දෘෂ්ටිය ඉතා ඍජුත් වන්නේ නම් බාහිය, එකල්හි තෙපි සීලය ඇසුරු කොට සීලයෙහි පිහිටා සිවුසීවටන් වඩන්නහු ය. කවර සිවු දෙනෙක් ද යත්: බාහිය, මෙහි තෙපි කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙවු. වෙදනාහි ... සිත්හි ... දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙවු. බාහිය, යම් කලෙක තෙපි සීලය ඇසුරු කොට සීලයෙහි පිහිටා මේ සිවුසීවටන් මෙසේ වඩන්නහු ද, බාහිය, එකල්හි තොපට යම් රැයෙක් හෝ දවාලෙක් හෝ පැමිණෙන්නේ නම්, කුසල්දහම්හි වැඩීමෙක් ම කැමැති වියයුතු, පිරිහීමෙක් නො කැමැති වියයුතු යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉක්බිති ආයුෂ්මත් බාහිය භාග්‍යවතුන් වහන්සේගේ දේශනාව පිළිගෙන අනුමෝදන් ව හුනස්නෙන් නැඟී භාග්‍යවතුන් වහන්සේ වැඳ පැදකුණු කොට පිටත් ව ගියේ ය. ඉක්බිති ආයුෂ්මත් බාහිය තෙරණුවෝ එකලා ව ගණයා කෙරෙන් වෙන් ව නො පමා ව කෙලෙස් තවන වැර ඇති ව නිවන් පිණිස මෙහෙයූ සිත් ඇති ව වෙසෙන්නාහු නො බෝකලකින් ම යමක් පිණිස කුලපුත්තු මැනවින් ම ගිහිගෙන් නික් ම සස්නෙහි පැවිදි වෙත් නම් අනුත්තර වූ මඟබඹසර කෙළවර වූ ඒ අර්‍හත්‍වය දිටුදැමියෙහි ම තෙමේ වෙසෙසින් දැන පසක් කොට එයට පැමිණ විසූහ. ඉපැද් ම ගෙවිණ. බඹසර වැස නිමවන ලදී කටයුතු කරන ලදී. මේබැව් පිණිස අනෙකක් නැතැ යි දැනගත්හ. ආයුෂ්මත් බාහිය තෙරණුවෝ රහතුන් අතුරෙන් එක්තරා කෙනෙක් ද වූහ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උත්තිය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1194. එකල්හි ආයුෂ්මත් උත්තිය තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ ... උත්තිය, එකල්හි තෙපි සසර පරතෙරට යන්නහු යි ... ආයුෂ්මත් උත්තිය තෙරණුවෝ රහතුන් අතුරෙන් එක්තරා කෙනෙක් ද වූහ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 300,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 2. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අරියසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1195. චත්තාරො මෙ භික්ඛවෙ, සතිපට්ඨානා භාවිතා බහුලීකතා අරියා නිය්යානිකා නිය්යන්ති තක්කරස්ස සම්මා දුක්ඛක්ඛයාය. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙ ඛො භික්ඛවෙ, චත්තාරො සතිපට්ඨානා භාවිතා බහුලීකතා අරියා නිය්යානිකා නිය්යන්ති තක්කරස්ස සම්මා දුක්ඛක්ඛයායාති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බ්රහ්මසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1196. එකං සමයං භගවා උරුවෙලායං විහරති නජ්ජා නෙරඤ්ජරාය තීරෙ අජපාලනිග්රොධෙ පඨමාභිසම්බුද්ධො. අථ ඛො භගවතො රහොගතස්ස පතිසල්ලීනස්ස එවං චෙතසො පරිවිතක්කො උදපාදි: “එකායනො’යං මග්ගො සත්තානං විසුද්ධියා සොකපරිද්දවානං සමතික්කමාය දුක්ඛදොමනස්සානං අත්ථගමාය ඤායස්ස අධිගමාය නිබ්බානස්ස සච්ඡිකිරියාය, යදිදං චත්තාරො සතිපට්ඨානා. කතමෙ චත්තාරො: කායෙ වා භික්ඛු කායානුපස්සී විහරෙය්ය, ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු වා භික්ඛු -පෙ- චිත්තෙ වා භික්ඛු -පෙ- ධම්මෙසු වා භික්ඛු ධම්මානුපස්සී විහරෙය්ය ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. එකායනො’යං මග්ගො සත්තානං විසුද්ධියා සොකපරිද්දවානං සමතික්කමාය දුක්ඛදොමනස්සානං අත්ථගමාය ඤායස්ස අධිගමාය නිබ්බානස්ස සච්ඡිකිරියාය, යදිදං චත්තාරො සතිපට්ඨානා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො බ්රහ්මා සහම්පති භගවතො චෙතසා චෙතො පරිවිතක්කමඤ්ඤාය. සෙය්යථාපි නාම බලවා පුරිසො සම්මිඤ්ජිතං වා බාහං පසාරෙය්ය, පසාරිතං වා බාහං සම්මිඤ්ජෙය්ය, එවමෙවං බ්රහ්මලොකෙ අන්තරහිතො භගවතො පුරතො පාතුරහොසි. අථ ඛො බ්රහ්මා සහම්පති එකංසං උත්තරාසඞ්ගං කරිත්වා යෙන භගවා තෙනඤ්ජලිං පණාමෙත්වා භගවන්තං එතදවොච:"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 2. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අරිය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1195. මහණෙනි, වඩන ලද බහුල කරන ලද ආර්‍ය වූ නෛර්‍ය්‍යාණික වූ මේ සිවුසීවටන්හු ඒ අනු ව පිළිපන්නහු මැනවින් දුක් ගෙවීම පිණිස පමුණුවත්. කවර සතරෙක් ද යත්: මහණෙනි, මෙ සස්නෙහි මහණ කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. වෙදනාහි ... සිත්හි ... දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇතිව දහම් ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙයි. මහණෙනි, ආර්‍ය වූ නෛර්‍ය්‍යාණික වූ මේ සිවුසීවටන්හු වඩන ලදහු බහුල කරන ලදහු ඒ අනු ව පිළිපන්නහු මැනවින් දුක් ගෙවීම පිණිස පමුණුවති යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බ්‍රහ්ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1196. එක්සමයෙක භාග්‍යවතුන් වහන්සේ බුදු ව පළමු කොට උරුවෙල් දනව්වෙහි නේරඤ්ජරා ගංඉවුරෙහි අජපල් නුගරුකමුල වැඩවසන සේක. එකල්හි රහසිගත ව විවේකයෙන් යුතුව වැඩවෙසෙන භාග්‍යවතුන් වහන්සේට මෙබඳු චිත්තවිතර්‍කයෙක් පහළ විය: යම් මේ සිවුසීවටන්හු වෙද් ද; සත්ත්‍වයන්ගේ විශුද්ධිය පිණිස ශෝකපරිදේවයන් ඉක්මවීම පිණිස දුක්දොම්නස් දුරු කිරීම පිණිස අරිඅටඟිමඟ අවබෝධ කිරීම පිණිස නිවන පසක් කිරීම පිණිස මේ එක ම මඟ ය. කවර සතරෙක් ද යත්: මහණ කයෙහි හෝ කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙන්නේ ය. මහණ ව් වෙදනාහි හෝ ... මහණ සිත්හි හෝ ... මහණ දහම්හි හෝ දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙන්නේ ය. යම් මේ සිවුසීවටන්හු වෙත් නම් සත්ත්‍වයන්ගේ විශුද්ධිය පිණිස ශෝකපරිදේවයන් ඉක්ම වීම පිණිස දුක්දොම්නස් දුරු කිරීම පිණිස අරිඅටඟිමඟ අවබෝධ කිරීම පිණිස නිවන පසක් කිරීම පිණිස මේ එක ම මඟ වේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එකල්හි සහම්පතී බ්‍රහ්ම සියසිතින් භාග්‍යවතුන් වහන්සේගේ චිත්තපරිවිතර්‍කය දැන යම් සේ බලවත් පුරුෂයෙක් හැකුළු අතක් හෝ දිගු කරන්නේ ද; දිගුකළ අතක් හෝ හකුළුවන්නේ ද එසෙයින් ම බඹලොව අතුරුදන් ව භාග්‍යවතුන් වහන්සේ ඉදිරියෙහි පහළ විය. ඉක්බිති සහම්පති බ්‍රහ්ම උතුරුසඟ එකස් කොට ඇඳිලිබැඳ භාග්‍යවතුන් වහන්සේට මෙය සැල කෙළේ” ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 302,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“එවමෙතං භගවා, එවමෙතං සුගත, එකායනො’යං භන්තෙ, මග්ගො සත්තානං විසුද්ධියා සොකපරිද්දවානං සමතික්කමාය දුක්ඛදොමනස්සානං අත්ථගමාය ඤායස්ස අධිගමාය නිබ්බානස්ස සච්ඡිකිරියාය යදිදං චත්තාරො සතිපට්ඨානා. කතමෙ චත්තාරො: කායෙ වා භන්තෙ, භික්ඛු කායානුපස්සී විහරෙය්ය, ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු වා භන්තෙ, භික්ඛු -පෙ- චිත්තෙ වා භන්තෙ, භික්ඛු -පෙ- ධම්මෙසු වා භන්තෙ, භික්ඛු ධම්මානුපස්සී විහරෙය්ය, ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. එකායනො’යං භන්තෙ, මග්ගො සත්තානං විසුද්ධියා සොකපරිද්දවානං සමතික්කමාය දුක්ඛදොමනස්සානං අත්ථගමාය ඤායස්ස අධිගමාය නිබ්බානස්ස සච්ඡිකිරියාය යදිදං{1} චත්තාරො සතිපට්ඨානා”ති. ඉදමවොච බ්රහ්මා සහම්පති. ඉදං වත්වා අථාපරං එතදවොච:"
                    },
                    {
                        "type": "gatha",
                        "text": "එකායනං ජාතිඛයන්තදස්සී මග්ගං පජානාති හිතානුකම්පී\nඑතෙන මග්ගෙන අතරිංසු පුබ්බෙ තරිස්සන්ති යෙ ච තරන්ති ඔඝන්ති.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සෙදකසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1197. එකං සමයං භගවා සුම්භෙසු{2} විහරති සෙදකං නාම සුම්භානං නිගමො. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි: භූතපුබ්බං භික්ඛවෙ, චණ්ඩාලවංසිකො චණ්ඩාලවංසං උස්සාපෙත්වා මෙදකථාලිකං අන්තෙවාසිං ආමන්තෙසි: “එහි ත්වං සම්ම මෙදකථාලිකෙ, චණ්ඩාලවංසං අභිරූහිත්වා මම උපරික්ඛන්ධෙ තිට්ඨාහීති. එවං ආචරියාති ඛො භික්ඛවෙ, මෙදකථාලිකා අන්තෙවාසී චණ්ඩාලවංසිකස්ස පටිස්සුත්වා චණ්ඩාලවංසං අභිරූහිත්වා ආචරියස්ස උපරික්ඛන්ධෙ අට්ඨාසි. අථ ඛො භික්ඛවෙ, චණ්ඩාලවංසිකො මෙදකථාලිකං අන්තෙවාසිං එතදවොච: “ත්වං සම්ම මෙදකථාලිකෙ, මමං රක්ඛ. අහං තවං රක්ඛිස්සාමි. එවං මයං අඤ්ඤමඤ්ඤගුත්තා අඤ්ඤමඤ්ඤරක්ඛිතා සිප්පානි චෙව දස්සෙස්සාම, ලාභෙ ච ලච්ඡාම, සොත්ථිනා ච චණ්ඩාලවංසා ඔරොහිස්සාමාති. එවං වුත්තෙ භික්ඛවෙ, මෙදකථාලිකා අන්තෙවාසී චණ්ඩාලවංසිකං එතදවොච: “න ඛො නාමෙනං ආචරිය, එවං භවිස්සති. ත්වං ආචරිය, අත්තානං රක්ඛ, අහං අත්තානං රක්ඛිස්සාමි. එවං මයං අත්තගුත්තා අත්තරක්ඛිතා සිප්පානි චෙව දස්සෙස්සාම, ලාභඤ්ච ලච්ඡාම, සොත්ථිනා ච චණ්ඩාලවංසා ඔරොහෙස්සාමා”ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. යදිමෙ - සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සුබ්ගෙසු - සී 1, 2. සුම්භෙසු - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "“භාග්‍යවතුන් වහන්ස, මෙය එසේ ය. සුගතයන් වහන්ස, මෙය එසේ ය. වහන්ස, යම් මේ සිවු සීවටන්හු වෙත් නම් සත්ත්‍වයන්ගේ විසුද්ධියට සෝකපරිදේවයන් ඉක්මවීමට දුක්දොම්නස් දුරු කිරීමට අරිඅටඟිමඟ අවබෝධ කිරීමට නිවන පසක් කිරීමට මේ එක ම මඟ ය. කවර සතරෙක්ද යත්: වහන්ස, මහණ කයෙහි හෝ කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙන්නේ ය. වහන්ස, මහණ වෙදනාහි හෝ ... වහන්ස, මහණ සිත්හි හෝ ... වහන්ස, මහණ තෙමේ දහම්හි හෝ දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙන්නේ ය. වහන්ස, යම් මේ සිවුසීවටන්හු වෙත් නම් සත්ත්‍වයන්ගේ විසුද්ධියට සෝකපරිදේවයන් ඉක්මවීමට දුක්දොම්නස් දුරු කිරීමට ඤායය අවබෝධ කිරීමට නිවන පසක් කිරීමට මේ එක ම මඟ වේ යි. සහම්පතී බ්‍රහ්ම මෙය කිය: මෙය කියා යළි මතු ද මෙය කී ය:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නිවන දක්නා වූ හිතානුකම්පා ඇති (භාග්‍යවතුන් වහන්සේ) එක ම මඟ දන්නාසේක. යම් කෙනෙක් චතුරෝඝය පෙර තරණය කළාහු ද, මතු තරණය කරන්නාහු ද, දැන් තරණය කෙරෙද්ද (ඔහු) මේ මගින් තරණය කළහ. කරන්නාහ. කෙරෙති යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සේදක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1197. එක් කලෙක භාග්‍යවතුන් වහන්සේ සුහ්ම දනව්වෙහි සුහ්මයන්ගේ, සේදක නම් නියම්ගම්හි වැඩවසන සේක. එහි දී භාග්‍යවතුන් වහන්සේ භික්‍ෂූන් ඇමතූසේක. මහණෙනි, පෙර චණ්ඩාලවංශිකයෙක් සැඩොල්හුණගස ඔසොවා “යහළු මේදකථාලිකාවනි, එවු තෙපි සැඩොල්හුණගසට නැඟී මාගේ කඳ මතුයෙහි සිටිවු” යි. මේදකථාලිකා නම් අතැවැස්සා ඇමතී ය.\nමහණෙනි, ඇදුර, එසේ ය යි මේදකථාලිකා අතැවැසි චණ්ඩාලවංශිකයාට පිළිතුරු දී චණ්ඩාලවංසයට නැඟී ඇදුරාගේ කඳමතුයෙහි සිටියේ ය. මහණෙනි, එකල්හි චණ්ඩාලවංසික මේදකථාලිකා අතවැස්සාට මෙය කී ය: යහළු මේදකථාලිකාවනි, තෙපි මා රකිවු. මම තෙපි රකින්නෙමි. මෙසේ අපි ඔවුනොවුන් විසින් ගෝපනය කරන ලද්දමෝ ඔවුනොවුන් විසින් රක්නා ලද්දමෝ ශිල්ප ද දක්වන්නෙමු ලාභ ද ලබන්නෙමු. සුවසේ සැඩොල්හුණගසින් ද බසින්නෙමු” යි. මහණෙනි, එසේ කී කල්හි මේදකථාලිකා අතැවැසි චණ්ඩාලවංසිකයාට මෙය කී ය: ඇදුර, මෙය එසේ නො ම වන්නේ ය. ඇදුර, තෙපි තමා රකිවු. මම ද තමා රක්නෙමි. මෙසේ අපි තමා විසින් ගෝපනය කරන ලද්දමෝ තමා විසින් රක්නා ලද්දමෝ ශිල්ප ද දක්වන්නෙමු ලාභ ද ලබන්නෙමු, චණ්ඩාලවංසයෙන් ද සුවසේ බසින්නෙමු” යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 304,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“සො තත්ථ ඤායොති භගවා අවොච: යථා මෙදකථාලිකා අන්තෙවාසී ආචරියං අවොච. අත්තානං භික්ඛවෙ, රක්ඛිස්සාමීති සතිපට්ඨානං සෙවිතබ්බං. පරං රක්ඛිස්සාමීති සතිපට්ඨානං සෙවිතබ්බං. අත්තානං භික්ඛවෙ, රක්ඛන්තො පරං රක්ඛති. පරං රක්ඛන්තො අත්තානං රක්ඛති. කථඤ්ච භික්ඛවෙ, අත්තානං රක්ඛන්තො පරං රක්ඛති, ආසෙවනාය භාවනාය බහුලීකම්මෙන. එවං ඛො භික්ඛවෙ, අත්තානං රක්ඛන්තො පරං රක්ඛති. කථඤ්ච භික්ඛවෙ, පරං රක්ඛන්තො අත්තානං රක්ඛති. ඛන්තියා අවිහිංසාය මෙත්තචිත්තතාය අනුද්දයතාය. එවං ඛො භික්ඛවෙ, පරං රක්ඛන්තො අත්තානං රක්ඛති. “අත්තානං භික්ඛවෙ, රක්ඛිස්සාමී”ති සතිපට්ඨානං සෙවිතබ්බං, පරං රක්ඛිස්සාමීති සතිපට්ඨානං සෙවිතබ්බං. අත්තානං භික්ඛවෙ, රක්ඛන්තො පරං රක්ඛති, පරං රක්ඛන්තො අත්තානං රක්ඛතීති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ජනපදකල්යාණීසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1198. එකං සමයං භගවා සුම්භෙසු විහරති සෙදකං නාම සුම්භානං නිගමො. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි: “සෙය්යථාපි භික්ඛවෙ, ජනපදකල්යාණී, “ජනපදකල්යාණී”ති ඛො භික්ඛවෙ, මහාජනකායො සන්නිපතෙය්ය. සා ඛො පනස්ස ජනපදකල්යාණී පරමපාසාවිනී{1} නච්චෙ, පරමපාසාවිනී ගීතෙ. ජනපදකල්යාණී නච්චති ගායතීති ඛො භික්ඛවෙ, භිය්යොසොමත්තාය මහාජනකායො සන්නිපතෙය්ය. අථ පුරිසො ආගච්ඡෙය්ය ජීවිතුකාමො අමරිතුකාමො සුඛකාමො දුක්ඛපටික්කූලො. තමෙනෙවං{2} වදෙය්යුං: අයං තෙ අම්භොපුරිස, සමතිත්තිකො තෙලපත්තො අන්තරෙන{3} මහාසමයං{4} අන්තරෙන ජනපදකල්යාණියා පරිහාරෙතබ්බො{5}. පුරිසො චෙකො{6} තෙ උක්ඛිත්තාසිකො පිට්ඨිතො පිට්ඨිතො අනුබන්ධිස්සති. යත්ථෙව නං ථොකම්පි ඡඩ්ඩෙස්සති තත්ථෙව තෙ සිරො පාතෙස්සතීති. තං කිං මඤ්ඤථ භික්ඛවෙ, අපි නු සො පුරිසො අමුං තෙලපත්තං අමනසිකරිත්වා බහිද්ධා පමාදං ආහරෙය්යාති?{7} නො හෙතං, භන්තෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "උපමා ඛො ම්යායං භික්ඛවෙ, කතා අත්ථස්ස විඤ්ඤාපනාය. අයං චෙත්ථ අත්ථො: “සමතිත්තිකො තෙලපත්තොති ඛො භික්ඛවෙ, කායගතාය එතං සතියා අධිවචනං. තස්මාතිහ භික්ඛවෙ, එවං සික්ඛිතබ්බං කායගතා නො සති භාවිතා භවිස්සති බහුලීකතා යානීකතා වත්ථුකතා අනුට්ඨිතා පරිචිතා සුසමාරද්ධාති.” එවං හි වො භික්ඛවෙ, සික්ඛිතබ්බන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "නාලන්දවග්ගො දුතියො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "මහාපුරිසො ච නාලන්දං චුන්දො චෙලො ච බාහියො\nඋත්තියො අරියො බ්රහ්මා සෙදකං ජනපදෙන චාති.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පරම්පාසාවිනී - සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "2. තමෙනං එවං - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අන්තරෙන ච - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. මහාසමජ්ජං - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. පරිහරිතබ්බො - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "6. ච තෙ - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "7. ආහරෙය්යාසි - සී 1, 2."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "“මේදකථාලිකා අතැවැසි තෙමේ ඇදුරාට යම්සේ කීයේ නම් එය එහි න්‍යායය”, යී භාග්‍යවතුන් වහන්සේ වදාළ සේක. “මහණෙනි, තමා රක්නෙමි” යි සීවටන් සෙවියයුතු යි. මෙරමා රක්නෙමි යි සීවටන් සෙවියයුතු යි. මහණෙනි, තමා රක්නේ මෙරමා රකියි. මහණෙනි, කෙසේ නම් තමා රක්නේ මෙරමා රකී ද යත්: කමටහන් සෙවුමෙනි, වැඩීමෙනි, බහුල කිරීමෙනි, මෙසේ තමා රක්නේ මෙරමා රකී. මහණෙනි, කෙසේ නම් මෙරමා රක්නේ තමා රකී ද යත්: ඉවසීමෙනි, කරුණායෙනි, මෙත්සිත් ඇති බැවිනි, මුදු බැවිනි. මහණෙනි, මෙසේ මෙරමා රක්නේ තමා රකියි. මහණෙනි, තමා රක්නෙමී යි සීවටන් සෙවියයුතු යි. මෙරමා රක්නෙමි යි සීවටන් සෙවියයුතු යි. මහණෙනි, තමා රක්නේ මෙරමා රකියි. මෙරමා රක්නේ තමා රකී යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 2. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ජනපදකල්‍යාණී සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1198. එක්කලෙක භාග්‍යවතුන් වහන්සේ සුහ්මදනව්වෙහි සුහ්මයන්ගේ සේදක නම් නියම්ගම්හි වැඩවසන සේක. එහි දී භාග්‍යවතුන් වහන්සේ භික්‍ෂූන් ඇමතූ සේක: මහණෙනි, ජනපදකල්‍යාණිය යම්සේ ද: මහණෙනි, ජනපදකල්‍යාණි යයි (ඇසූකෙණෙහි) මහජන සමූහයා රැස්වන්නේ ය. ඒ ජනපදකල්‍යාණි තොමෝ නැටුමෙහි ඉතා උතුම් පැවතුම් ඇත්තී ගැයුමෙහි ඉතා උතුම් පැවතුම් ඇත්තී වන්නී ය. මහණෙනි, දනවුකලණ නටයි, ගයයි ඇසූ කෙණෙහි බෙහෙවින් ම මහජනසමූහයා රැස්වන්නේ ය. එකල්හි ජීවත්වනු කැමති නො මැරෙනු කැමති සුව කැමති දුක පිළිකුල් කරන පුරුෂයෙක් එන්නේ ය. ඒ මොහුට මෙසේ කියන්නාහු ය: “එම්බල පුරුෂය, මුවටිට සම කොට පිරුණු මේ තෙල් බඳුන මහාසමූහයා අතරෙන් දනවුකලණ අතරෙන් ගෙන යායුතු. ඔසවා ගත් කඩු ඇති පුරුෂයෙක් පසුපස ලුහුබඳනේ ය. යම් මැ තැනෙක එයින් ස්වල්පයකුදු ඉවතලන්නේ නම් එහි ම තාගේ හිස කපා හෙළන්නේ” යි. මහණෙනි, ඒ කිමැ යි හඟිවු ද? ඒ පුරුෂ තෙමේ ඒ තෙල් බඳුන නො මෙනෙහි කොට බැහැර පමාවට එළඹෙන්නේ ද? වහන්ස, එය නො වේ ම ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, අරුත් දන්වනු පිණිස මා විසින් මේ උපමාවක් කරන ලද. මේ එහි අර්‍ත්‍ථ යි: මහණෙනි, “මුවවිට සම කොට පිරුණු තෙල්බඳුනැ” යි කාගියසිහියට මේ නමෙකි. මහණෙනි, එහෙයින් මෙහි ලා මෙසේ හික්මියයුතු යි: අප විසින් කායගතාසතිය වඩන ලද්දී බහුල කරන ලද්දී යානයක් මෙන් කරන ලද්දී වස්තුවක් මෙන් කරන ලද්දී දැඩිසේ පිහිටුවන ලද්දී පුරුදු කරන ලද්දී මැනවින් අරඹන ලද්දී වන්නී ය” යි. මහණෙනි, තොප විසින් මෙසේ ම හික්මිය යුතු යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "දෙවැනිනාලන්‍ද වර්‍ගය යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි සූත්‍රනාමාවලිය:**",
                        "type": "unindented"
                    },
                    {
                        "text": "මහාපුරිස, නාලන්‍ද, චුන්‍ද, උක්කචෙල, බාහිය, උත්තිය, අරිය, බ්‍රහ්ම යන සූත්‍ර අට ය. සේදක ජනපදකල්‍යාණි ය යි සූත්‍ර දශයෙකි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 306,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "3. සීලට්ඨිතිවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 3. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සීලසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1199. එකං සමයං ආයස්මා ච ආනන්දො ආයස්මා ච භද්දො පාටලිපුත්තෙ විහරන්ති කුක්කුටාරාමෙ. අථ ඛො ආයස්මා භද්දො සායන්හසමයං පටිසල්ලානා වුට්ඨිතො යෙනායස්මා ආනන්දො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මතා ආනන්දෙන සද්ධිං සම්මොදි. -පෙ- ආයස්මන්තං ආනන්දං එතදවොච: “යානිමානි ආවුසො ආනන්ද, කුසලානි සීලානි වුත්තානි භගවතා, ඉමානි කුසලානි සීලානි කිමත්ථියානි වුත්තානි භගවතා”ති. සාධු සාධු ආවුසො භද්ද, භද්දකො ඛො තෙ ආවුසො භද්ද, උම්මග්ගො,{1} භද්දකං පටිභානං, කල්යාණී පරිපුච්ඡා. “එවං හි ත්වං ආවුසො භද්ද, පුච්ඡසි: යානිමානි ආවුසො ආනන්ද, කුසලානි සීලානි වුත්තානි භගවතා, ඉමානි කුසලානි සීලානි කිමත්ථියානි වුත්තානි භගවතා”ති. එවමාවුසොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යානිමානි, ආවුසො භද්ද, කුසලානි සීලානි වුත්තානි භගවතා, ඉමානි කුසලානි සීලානි යාවදෙව චතුන්නං සතිපට්ඨානානං භාවනාය වුත්තානි භගවතා. කතමෙසං චතුන්නං: ඉධාවුසො භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. යානිමානි ආවුසො භද්ද, කුසලානි සීලානි වුත්තානි භගවතා, ඉමානි කුසලානි සීලානි යාවදෙව ඉමෙසං චතුන්නං සතිපට්ඨානානං භාවනාය වුත්තානි භගවතාති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 3. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඨිතිසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "1200. **කුක්කුටාරාමෙ:**"
                    },
                    {
                        "type": "paragraph",
                        "text": "කො නු ඛො ආවුසො ආනන්ද, හෙතු කො පච්චයො යෙන තථාගතෙ පරිනිබ්බුතෙ සද්ධම්මො න චිරට්ඨිතිකො හොති. කොපනාවුසො ආනන්ද, හෙතු කො පච්චයො යෙන තථාගතෙ පරිනිබ්බුතෙ සද්ධම්මො චිරට්ඨිතිකො හොතීති? සාධු සාධු ආවුසො භද්ද, භද්දකො"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උම්මඞ්ගො - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "3. සීලට්ඨිති වර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 3. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සීල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1199. එක්කලෙක ආයුෂ්මත් ආනන්‍දතෙරණුවෝ ද ආයුෂ්මත් භද්දතෙරණුවෝ ද පැළලුප්නුවර කුක්කුටාරාමයෙහි වැඩවෙසෙති, එකල්හි ආයුෂ්මත් භද්දතෙරණුවෝ සවස්කල විවේකයෙන් නැඟි සිටියෝ ආයුෂ්මත් ආනන්‍දතෙරණුවන් වෙත එළඹියහ. එළඹ ආයුෂ්මත් ආනන්‍දතෙරණුවන් සමග සතුටුවූහ ... ආයුෂ්මත් අනඳ තෙරණුවන්ට මෙය කීහ: ඇවැත්නි, ආනන්‍දයෙනි, යම් මේ කුසල්සිල් කෙනෙක් භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද ද, මේ කුසල්සිල් කුමක් පිණිස භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද දැ යි. ඇවැත්නි, භද්දයෙනි, මැනවි මැනවි: ඇවැත්නි භද්දයෙනි, තොපගේ ප්‍රශ්න විමර්‍ශනය යහපති. ප්‍රතිභානය යහපති. පරිපුච්ඡාව මැනවි. ඇවැත්නි, භද්දයෙනි, මෙසේ තෙපි පුළුවුසුහු ද? ඇවැත්නි, ආනන්‍දයෙනි, යම් මේ කුසල්සිල් භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද නම් මේ කුසල්සිල් කුමක් පිණිස භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද දැ යි. ඇවැත්නි, එසේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත්නි, භද්දයෙනි, යම් මේ කුසල්සිල් භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද නම් මේ කුසල්සිල් සිවුසීවටන් වැඩීම පිණිස භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදී. කවර සතරෙක් ද යත්: ඇවැත්නි, මෙසස්නෙහි මහණතෙමේ කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. විඳුම්හි ... සිත්හි ... දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. ඇවැත්නි භද්දයෙනි, යම් මේ කුසල්සිල් භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද නම් මේ කුසල්සිල් මේ සිවුසීවටන් වැඩීම පිණිස ම භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 3. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඨිති සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1200. **කුක්කුටාරාමයෙහි:**",
                        "type": "unindented"
                    },
                    {
                        "text": "ඇවැත්නි ආනන්‍දයෙනි, යම් හෙයෙකින් තථාගතයන් වහන්සේ පිරිනිවිකල්හි සද්ධර්‍මය චිරස්ථිතික නො වේ නම් ඊට කිමෙක් හේතු ද? කිමෙක් ප්‍රත්‍යය ද? ඇවැත්නි ආනන්‍දයෙනි, යම් හෙයෙකින් තථාගතයන් වහන්සේ පිරිනිවි කල්හි සද්ධර්‍මය චිරස්ථිතික වේ නම් ඊට කිමෙක් හේතු ද? කිමෙක් ප්‍රත්‍යය දැ යි? ඇවැත්නි,",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 308,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "ඛො තෙ ආවුසො භද්ද, උම්මග්ගො, භද්දකං පටිභානං, කල්යාණීපරිපුච්ඡා. එවං හි ත්වං ආවුසො භද්ද, පුච්ඡසි: “කො නු ඛො ආවුසො ආනන්ද හෙතු, කො පච්චයො යෙන තථාගතෙ පරිනිබ්බුතෙ සද්ධම්මො න චිරට්ඨිතිකො හොති. කො පනාවුසො ආනන්ද, හෙතු කො පච්චයො යෙන තථාගතෙ පරිනිබ්බුතෙ සද්ධම්මො චිරට්ඨිතිකො හොතී”ති. එවමාවුසොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුන්නං ඛො ආවුසො, සතිපට්ඨානානං අභාවිතත්තා අබහුලීකතත්තා තථාගතෙ පරිනිබ්බුතෙ සද්ධම්මො න චිරට්ඨිතිකො හොති. චතුන්නඤ්ච ආවුසො, සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා තථාගතෙ පරිනිබ්බුතෙ සද්ධම්මො චිරට්ඨිතිකො හොති. කතමෙසං චතුන්නං: ඉධාවුසො භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙසං ඛො ආවුසො චතුන්නං සතිපට්ඨානානං අභාවිතත්තා අබහුලීකතත්තා තථාගතෙ පරිනිබ්බුතෙ සද්ධම්මො න චිරට්ඨිතිකො හොති. ඉමෙසඤ්ච ඛො ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා තථාගතෙ පරිනිබ්බුතෙ සද්ධම්මො චිරට්ඨිතිකො හොතීති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 3. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරිහානසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "1201. **කුක්කුටාරාමෙ:**"
                    },
                    {
                        "type": "paragraph",
                        "text": "කො නු ඛො ආවුසො ආනන්ද, හෙතු කො පච්චයො යෙන සද්ධම්මපරිහානං හොති, කො පනාවුසො{1} ආනන්ද, හෙතු කො පච්චයො යෙන සද්ධම්මඅපරිහානං හොතීති? සාධු සාධු ආවුසො භද්ද, භද්දකො ඛො තෙ ආවුසො භද්ද, උම්මග්ගො, භද්දකං පටිභානං, කල්යාණී පරිපුච්ඡා එවං හි ත්වං ආවුසො භද්ද, පුච්ඡසි: “කො නු ඛො ආවුසො ආනන්ද, හෙතු කො පච්චයො යෙන සද්ධම්මපරිහානං හොති, කො පනාවුසො ආනන්ද, හෙතු කො පච්චයො යෙන සද්ධම්මඅපරිහානං හොතීති. එවමාවුසොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුන්නං ඛො ආවුසො, සතිපට්ඨානානං අභාවිතත්තා අබහුලීකතත්තා සද්ධම්මපරිහානං හොති. චතුන්නඤ්ච ඛො ආවුසො සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා සද්ධම්මඅපරිහානං හොති. කතමෙසං චතුන්නං: ඉධාවුසො භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙසං ඛො ආවුසො, චතුන්නං සතිපට්ඨානානං අභාවිතත්තා අබහුලීකතත්තා සද්ධම්මපරිහානං හොති. ඉමෙසඤ්ච ඛො ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා සද්ධම්මඅපරිහානං හොතීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කො නු ඛො ආවුසො - මඡසං, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "භද්දයෙනි, මැනවි, මැනවි. ඇවැත්නි භද්දයෙනි, තොපගේ ප්‍රශ්න විමර්‍ශනය යහපති. ප්‍රතිභානය යහපති. පරිපුච්ඡාව මැනවි. ඇවැත්නි, භද්දයෙනි, මෙසේ තෙපි පුළුවුසුහු ද? “ඇවැත්නි ආනන්‍දයෙනි, යම් හෙයකින් තථාගතයන් වහන්සේ පිරිනිවි කල්හි සද්ධර්‍මය චිරස්ථිතික නො වේ නම් එයට කිමෙක් හේතු ද? කිමෙක් ප්‍රත්‍යය ද? ඇවැත්නි, ආනන්‍දයෙනි, යම් හෙයකින් තථාගතයන් වහන්සේ පිරිනිවි කල්හි සද්ධර්‍මය චිරස්ථිතික වේ නම් ඊට කිමෙක් හේතු ද? කිමෙක් ප්‍රත්‍ය දැ”යි. ඇවැත්නි, එසේ යි."
                    },
                    {
                        "text": "ඇවැත්නි, සිවුසීවටන් නො වැඩූ බැවින් නො බහුල කළ බැවින් තථාගතයන් වහන්සේ පිරිනිවී කල්හි සද්ධර්‍මය චිරස්ථිතික නො වෙයි. ඇවැත්නි, සිවුසීවටන් වැඩූ බැවින් බහුල කළ බැවින් තථාගතයන් වහන්සේ පිරිනිවී කල්හි සද්ධර්‍මය චිරස්ථිතික වේ. කවර සතරෙක් ද යත්: ඇවැත්නි, මෙහි මහණ කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙයි. වෙදනාහි ... සිත්හි ... දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙයි. ඇවැත්නි, මේ සිවුසීවටන් නො වැඩූ බැවින් නො බහුල කළ බැවින් තථාගතයන් වහන්සේ පිරිනිවි කල්හි සද්ධර්‍මය චිරස්ථිතික නො වෙයි. ඇවැත්නි, මේ සිවුසීවටන් වැඩූ බැවින් බහුල කළ බැවින් තථාගතයන් වහන්සේ පිරිනිවි කල්හි සද්ධර්‍මය චිරස්ථිතික වේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 3. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරිහාන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1201. **කුක්කුටාරාමයෙහි:**",
                        "type": "unindented"
                    },
                    {
                        "text": "ඇවැත්නි, ආනන්‍දයෙනි, යම් හෙයකින් සදහම් පිරිහීම වේ නම් එයට කිමෙක් හේතු ද? කිමෙක් ප්‍රත්‍යය ද? ඇවැත්නි, ආනන්‍දයෙනි, යම් හෙයකින් සදහම් නො පිරිහීම වේ නම් එයට කිමෙක් හේතු ද? කිමෙක් ප්‍රත්‍යය දැ? යි. ඇවැත්නි භද්දයෙනි, මැනවි මැනවි. ඇවැත්නි භද්දයෙනි, තොපගේ නුවණ සෙවීම යහපති. වැටහීම යහපති. පිළිවිසුම මැනවි. ඇවැත්නි භද්දයෙනි, තෙපි මෙසේ පුළුවුසුහු ද? “ඇවැත්නි ආනන්‍දයෙනි, යම් හෙයකින් සදහම් පිරිහීම වේ නම් එයට කිමෙක් හේතු ද, කිමෙක් ප්‍රත්‍යය ද, ඇවැත්නි, ආනන්‍දයෙනි, යම් හෙයකින් සදහම් නො පිරිහීම වේ නම් එයට කිමෙක් හේතු ද, කිමෙක් ප්‍රත්‍යය දැ” යි. ඇවැත්නි, එසේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත්නි, සිවුසීවටන් නො වැඩූ බැවින් නො බහුල කළ බැවින් සදහම් පිරිහීම වෙයි. ඇවැත්නි, සිවුසීවටන් වැඩූ බැවින් බහුල කළ බැවින් සදහම් නො පිරිහීම වේ. කවර සතරෙක් ද යත්: ඇවැත්නි, මෙහි මහණ කයෙහි කය අනු ව දක්නා සුලු ව කෙලෙස් තවන වෙර ඇතිව මනාදැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙයි. වෙදනාහි ... සිත්හි ... දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. ඇවැත්නි, මේ සිවු සීවටන් නො වැඩූ බැවින් නො බහුල කළ බැවින් සදහම් පිරිහීම වේ. ඇවැත්නි, මේ සිවුසීවටන් වැඩූ බැවින් බහුල කළ බැවින් සදහම් නො පිරිහීම වේ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 310,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 3. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සුද්ධකසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "1202. **සාවත්ථියං:**"
                    },
                    {
                        "type": "paragraph",
                        "text": "චත්තාරො මෙ භික්ඛවෙ, සතිපට්ඨානා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙ ඛො භික්ඛවෙ, චත්තාරො සතිපට්ඨානාති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 3. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බ්රාහ්මණසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "1203. **සාවත්ථියං:**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො අඤ්ඤතරො බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො සො බ්රාහ්මණො භගවන්තං එතදවොච: “කො නු ඛො භො ගොතම, හෙතු කො පච්චයො යෙන තථාගතෙ පරිනිබ්බුතෙ සද්ධම්මො න චිරට්ඨිතිකො හොති, කො පන භො ගොතම, හෙතු කො පච්චයො යෙන තථාගතෙ පරිනිබ්බුතෙ සද්ධම්මො චිරට්ඨිතිකො හොතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුන්නං ඛො බ්රාහ්මණ, සතිපට්ඨානානං අභාවිතත්තා අබහුලීකතත්තා තථාගතෙ පරිනිබ්බුතෙ සද්ධම්මො න චිරට්ඨිතිකො හොති. චතුන්නඤ්ච ඛො බ්රාහ්මණ, සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා තථාගතෙ පරිනිබ්බුතෙ සද්ධම්මො චිරට්ඨිතිකො හොති. කතමෙසං චතුන්නං: “ඉධ බ්රාහ්මණ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙසං ඛො බ්රාහ්මණ, චතුන්නං සතිපට්ඨානානං අභාවිතත්තා අබහුලීකතත්තා තථාගතෙ පරිනිබ්බුතෙ සද්ධම්මො න චිරට්ඨිතිකො හොති. ඉමෙසඤ්ච ඛො බ්රාහ්මණ චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා තථාගතෙ පරිනිබ්බුතෙ සද්ධම්මො චිරට්ඨිතිකො හොතී”ති. එවං වුත්තෙ සො බ්රාහ්මණො භගවන්තං එතදවොච: “අභික්කන්තං භො ගොතම -පෙ- අජ්ජතග්ගෙ පාණුපෙතං සරණං ගත”න්ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 3. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සුද්ධක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1202.** සැවැත්නුවර:**",
                        "type": "unindented"
                    },
                    {
                        "text": "මහණෙනි, මේ සතිපට්ඨාන සතරෙකි. කවර සතරෙක් ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනු ව දක්නා සුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙයි. වෙදනාහි ... සිත්හි ... දහම්හි දහම් අනු ව දක්නා සුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. මහණෙනි, මොහු සතර සතිපට්ඨානයෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 3. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බ්‍රාහ්මණ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1203. **සැවැත්නුවර:**",
                        "type": "unindented"
                    },
                    {
                        "text": "එකල්හි එක්තරා බමුණෙක් භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කතා කොට නිමවා එකත්පස් ව හුන්නේ ය. එකත්පස් ව හුන් ඒ බමුණු භාග්‍යවතුන් වහන්සේට මෙය සැල කෙළේ ය: “භවත් ගෞතමයෙනි, යම් හෙයෙකින් තථාගතයන් පිරිනිවි කල්හි සද්ධර්‍මය චිරස්ථිතික නො වේ නම් එයට කිමෙක් හේතු ද? කිමෙක් ප්‍රත්‍යය ද? භවත් ගෞතමයෙනි, යම් හෙයකින් තථාගතයන් පිරිනිවි කල්හි සද්ධර්‍මය චිරස්ථිතික වේ නම් එයට කිමෙක් හේතු ද? කිමෙක් ප්‍රත්‍යය දැ? යි.”",
                        "type": "paragraph"
                    },
                    {
                        "text": "බමුණ, සිවු සීවටන් නො වැඩූ බැවින් නො බහුල කළ බැවින් තථාගතයන් පිරිනිවි කල්හි සද්ධර්‍මය චිරස්ථිතික නො වෙයි. බමුණ සිවු සීවටන් වැඩූ බැවින් බහුල කළ බැවින් තථාගතයන් පිරිනිවි කල්හි සද්ධර්‍මය චිරස්ථිතික වේ. කවර සතරෙක් ද යත්: බමුණ, මෙහි මහණ කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. වෙදනාහි ... සිත්හි ... දහම්හි දහම් අනු ව දක්නා සුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. බමුණ, මේ සිවුසීවටන් නො වැඩූ බැවින් නො බහුල කළ බැවින් තථාගතයන් පිරිනිවි කල්හි සද්ධර්‍මය චිරස්ථිතික නො වෙයි. බමුණ, සිවු සීවටන් වැඩූ බැවින් බහුල කළ බැවින් තථාගතයන් පිරිනිවි කල්හි සද්ධර්‍මය චිරස්ථිතික වේ යි. මෙසේ වදාළ කල්හි ඒ බමුණු භාග්‍යවතුන් වහන්සේ ට මෙය සැලකළේ ය; “භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි, භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි, ... අද පටන් දිවිහිම් කොට සරණ ගිය (මා උවසුවකු කොට දරන සේක්වා)” යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 312,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 3. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පදෙසසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1204. එකං සමයං ආයස්මා ච සාරිපුත්තො ආයස්මා ච මහාමොග්ගල්ලානො ආයස්මා ච අනුරුද්ධො සාකෙතෙ විහරන්ති, කණ්ටකීවනෙ{1}. අථ ඛො ආයස්මා ච සාරිපුත්තො ආයස්මා ච මහාමොග්ගල්ලානො සායන්හසමයං පටිසල්ලානා වුට්ඨිතා යෙනායස්මා අනුරුද්ධො තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා ආයස්මතා අනුරුද්ධෙන සද්ධිං සම්මොදිංසු. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නො ඛො ආයස්මා සාරිපුත්තො ආයස්මන්තං අනුරුද්ධං එතදවොච: “සෙඛො සෙඛොති{2} ආවුසො අනුරුද්ධ, වුච්චති. කිත්තාවතා නු ඛො ආවුසො, සෙඛො හොතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුන්නං ඛො ආවුසො, සතිපට්ඨානානං පදෙසං භාවිතත්තා සෙඛො හොති. කතමෙසං චතුන්නං: ඉධාවුසො භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං, වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙසං ඛො ආවුසො චතුන්නං සතිපට්ඨානානං පදෙසං භාවිතත්තා සෙඛො හොතීති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 3. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සමත්තසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "1205. **කණ්ටකීවනෙ:**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අසෙඛො අසෙඛොති ආවුසො අනුරුද්ධ, වුච්චති. කිත්තාවතා නු ඛො ආවුසො, අසෙඛො හොතීති: චතුන්නං ඛො ආවුසො, සතිපට්ඨානානං සමත්තං භාවිතත්තා අසෙඛො හොති. කතමෙසං චතුන්නං: ඉධාවුසො, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙසං ඛො ආවුසො, චතුන්නං සතිපට්ඨානානං සමත්තං භාවිතත්තා අසෙඛො හොතීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කණ්ඩකීවනෙ - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සෙක්ඛො සෙක්ඛොති - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 3. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පදෙස සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1204. එක්කලෙක ආයුෂ්මත් සැරියුත් තෙරණුවෝත් ආයුෂ්මත් මහමුගලන් තෙරණුවෝත් ආයුෂ්මත් අනුරුද්ධ තෙරණුවෝත් සාකේතනුවර සමීපයෙහි කණ්ටකී වනයෙහි වැඩ වෙසෙති. එකල්හි ආයුෂ්මත් සැරියුත් තෙරණුවෝත් ආයුෂ්මත් මහමුගලන් තෙරණුවෝත් සවස්කල විවේකයෙන් නැගී සිටියාහු ආයුෂ්මත් අනුරුද්ධ තෙරණුවන් වෙත එළඹියහ. එළඹ ආයුෂ්මත් අනුරුද්ධ තෙරණුවන් සමග සතුටු වූහ. සතුටු විය යුතු සිහි කට යුතු කතා කොට නිමවා එකත්පසෙක හුන්හ. එකත්පසෙක හුන් ආයුෂ්මත් සැරියුත් තෙරණුවෝ ආයුෂ්මත් අනුරුද්ධ තෙරණුවන්ට මෙය වදාළහ: “ඇවැත්නි, අනුරුද්ධයෙනි, සේඛ ය සේඛ ය යි කියනු ලැබේ. ඇවැත්නි, කෙතෙකින් සේඛ වේ දැ?” යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත්නි, සිවු සීවටන් පිළිබඳ කොටසක් වැඩූ බැවින් සේඛ වෙයි. කවර සතරක ද? යත්: ඇවැත්නි, මෙහි මහණ කයෙහි කය අනු ව දක්නා සුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙයි. වේදනා ... සිත්හි ... දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙයි. ඇවැත්නි, මේ සිවු සීවටන් පිළිබඳ කොටසක් වැඩූ බැවින් සේඛ වේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 3. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සමත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1205. **කණ්ටකීවනයෙහි:**",
                        "type": "unindented"
                    },
                    {
                        "text": "ඇවැත්නි අනුරුද්ධයෙනි, අසේඛ ය අසේඛ යයි කියනු ලැබේ. ඇවැත්නි, කෙතෙකින් අසේඛ වේ දැ යි. ඇවැත්නි, සිවුසීවටන් මුළුමනින් වැඩූ බැවින් අසේඛ වේ. කවර සතරෙක් ද? යත්: ඇවැත්නි, මෙහි මහණතෙමේ කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙයි. වේදනා ... සිත්හි ... දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. ඇවැත්නි, මේ සිවු සීවටන් මුළුමනින් වැඩූ බැවින් අසේඛ වේ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 314,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 3. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ලොකසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "1206. **කණ්ටකීවනෙ:**"
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමෙසං ආයස්මා අනුරුද්ධො{1} ධම්මානං භාවිතත්තා බහුලීකතත්තා මහාභිඤ්ඤතං පත්තොති? “චතුන්නං ඛො ආවුසො, සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා මහාභිඤ්ඤතං පත්තො. කතමෙසං චතුන්නං: ඉධාහං ආවුසො, කායෙ කායානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙසං ඛො ආවුසො චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා මහාභිඤ්ඤතං පත්තො. ඉමෙසඤ්ච ඛො පනාහං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා සහස්සං ලොකං අභිජානාමී”ති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 3. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සිරිවඩ්ඪසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1207. එකං සමයං ආයස්මා ආනන්දො රාජගහෙ විහරති වෙළුවනෙ කලන්දකනිවාපෙ. තෙන ඛො පන සමයෙන සිරිවඩ්ඪො ගහපති ආබාධිකො හොති දුක්ඛිතො බාළ්හගිලානො. අථ ඛො සිරිවඩ්ඪො ගහපති අඤ්ඤතරං පුරිසං ආමන්තෙසි: “එහි ත්වං අම්භො පුරිස, යෙනායස්මා ආනන්දො තෙනුපසඞ්කම, උපසඞ්කමිත්වා මම වචනෙන ආයස්මතො ආනන්දස්ස පාදෙ සිරසා වන්ද, සිරිවඩ්ඪො භන්තෙ, ගහපති ආබාධිකො හොති දුක්ඛිතො බාළ්හගිලානො. සො ආයස්මතො ආනන්දස්ස පාදෙ සිරසා වන්දතී”ති. එවඤ්ච වදෙහි:{2} සාධු කිර භන්තෙ, ආයස්මා ආනන්දො යෙන ච සිරිවඩ්ඪස්ස ගහපතිනො නිවෙසනං තෙනුපසඞ්කමතු අනුකම්පං උපාදායා”ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ආවුසො අනුරුද්ධ - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. වදෙසි - සීමු. සී 2. වදෙහි - සී 1."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 3. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ලෝක සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1206.** කණ්ටකීවනයෙහි:**",
                        "type": "unindented"
                    },
                    {
                        "text": "ආයුෂ්මත් අනුරුද්ධයෝ කවර දහම් වැඩූ බැවින් බහුල කළ බැවින් මහාභිඥ (මහනුවණැති) බවට පැමිණියෝ දැ යි. ඇවැත්නි, සිවුසීවටන් වැඩූ බැවින් බහුල කළ බැවින් මහනුවණැති බවට පැමිණියෙමි යි. කවර සතරෙක් ද යත්: ඇවැත්නි, මෙහි මම කයෙහි කය අනු ව දක්නාසුලුව කෙලෙස් තවන වැර ඇතියෙම් මනාදැනුම් ඇතියෙම් සිහි ඇතියෙම් කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙමි. වෙදනාහි ... සිත්හි ... දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇතිව මනා දැනුම් ඇතිව සිහි ඇතිව දහම්ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙමි. ඇවැත්නි, මේ සිවුසීවටන් වැඩූ බැවින් බහුල කළ බැවින් මහනුවණැති බවට පැමිණියෙමි. ඇවැත්නි, මේ සිවුසීවටන් වැඩූ බැවින් බහුල කළ බැවින් මම දහසක් ලොව වෙසෙසින් දනිමි යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 3. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සිරිවඩ්ඪ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1207. එක්සමයෙක ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ රජගහනුවර සමීපයෙහි කලන්‍දකනිවාප නම් වේළුවනාරාමයෙහි වැඩවෙසෙති. එසමයෙහි සිරිවඩ්ඨ ගැහැවි හටගත් ආබාධ ඇත්තේ දුකට පැමිණියේ දැඩි සේ ගිලන් වූයේ වෙයි. එකල්හි සිරිවඩ්ඨ ගැහැවි එක්තරා පුරුෂයකු ඇමතී ය. එම්බල පුරුෂය, එව. තෝ ආයුෂ්මත් ආනන්‍ද තෙරණුවන් වෙත එළඹෙව. එළඹ “වහන්ස, සිරිවඩ්ඨ ගැහැවි හටගත් ආබාධ ඇත්තේ දුකට පැමිණියේ දැඩි සේ ගිලන් වූයේ වෙයි. හෙතෙමේ ආනන්‍ද ආයුෂ්මතුන් වහන්සේගේ පා හිසින් වඳී” යි මා වදනින් ආයුෂ්මත් ආනන්‍ද තෙරණුවන්ගේ පා හිසින් වඳුව, මෙසේත් කියව: වහන්ස, ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ අනුකම්පා පිණිස සිරිවඩ්ඨ ගැහැවිහුගේ නිවෙස වෙත එළඹෙන සේක් නම් මැනවැ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 316,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "“එවං භන්තෙ”ති ඛො සො පුරිසො සිරිවඩ්ඪස්ස ගහපතිස්ස පටිස්සුත්වා යෙනායස්මා ආනන්දො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මන්තං ආනන්දං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො සො පුරිසො ආයස්මන්තං ආනන්දං එතදවොච: “සිරිවඩ්ඪො භන්තෙ, ගහපති ආබාධිකො දුක්ඛිතො බාළ්හගිලානො, සො ආයස්මතො ආනන්දස්ස පාදෙ සිරසා වන්දති. එවඤ්ච වදෙති: “සාධු කිර භන්තෙ, ආයස්මා ආනන්දො යෙන සිරිවඩ්ඪස්ස ගහපතිස්ස නිවෙසනං, තෙනුපසඞ්කමතු, අනුකම්පං උපාදායා”ති. අධිවාසෙසි ඛො ආයස්මා ආනන්දො තුණ්හීභාවෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා ආනන්දො පුබ්බන්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය යෙන සිරිවඩ්ඪස්ස ගහපතිස්ස නිවෙසනං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදි. නිසජ්ජ ඛො ආයස්මා ආනන්දො සිරිවඩ්ඪං ගහපතිං එතදවොච: කච්චි තෙ ගහපති ඛමනීයං, කච්චි යාපනීයං, කච්චි දුක්ඛා වෙදනා පටික්කමන්ති නො අභික්කමන්ති, පටික්කමොසානං පඤ්ඤායති නො අභික්කමොති? න මෙ භන්තෙ, ඛමනීයං න යාපනීයං බාළ්හා මෙ දුක්ඛා වෙදනා අභික්කමන්ති නො පටික්කමන්ති, අභික්කමොසානං පඤ්ඤායති නො පටික්කමොති. තස්මාතිහ තෙ ගහපති, එවං සික්ඛිතබ්බං: “කායෙ කායානුපස්සී විහරිස්සාමි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරිස්සාමි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සන්ති”. එවං හි තෙ ගහපති, සික්ඛිතබ්බන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යෙ’මෙ භන්තෙ, භගවතා චත්තාරො සතිපට්ඨානා දෙසිතා, සංවිජ්ජන්ති තෙ ධම්මා{1} මයි. අහඤ්ච තෙසු ධම්මෙසු සන්දිස්සාමි. අහං භන්තෙ, කායෙ කායානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. යානි චිමානි භන්තෙ, භගවතා පඤ්චොරම්භාගියානි සංයොජනානි දෙසිතානි, නාහං තෙසං කිඤ්චි අත්තනි අප්පහීනං සමනුපස්සාමීති. ලාභා තෙ ගහපති, සුලද්ධං තෙ ගහපති, අනාගාමිඵලං තයා ගහපති, බ්යාකතන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සංවිජ්ජන්තෙ රතනධම්මො මයි - සීමු. සී 1, 2."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "“එසේ ය හිමියනි” යි ඒ පුරිස් සිරිවඩු ගැහැවිහට පිළිතුරු දී ආයුෂ්මත් ආනන්‍ද තෙරණුවන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් ආනන්‍ද තෙරණුවන් වැඳ එකත්පස් ව හුන්නේ ය. එකත්පස් ව හුන් ඒ පුරිස් ආයුෂ්මත් ආනන්‍දතෙරණුවන්ට මෙය සැලකෙළේ ය: වහන්ස, සිරිවඩු ගැහැවි තෙමේ හටගත් ආබාධ ඇත්තේ ය. දුකට පැමිණියේ ය. දැඩි සේ ගිලන් වූයේ ය. හෙතෙමේ ආනන්‍ද ආයුෂ්මතුන් වහන්සේගේ පා හිසින් වඳියි. මෙසේත් කියයි: “වහන්ස, ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ අනුකම්පා පිණිස සිරිවඩු ගැහැවිහුගේ නිවෙස වෙත එළඹෙන සේක්නම් මැනවැ” යි. ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ නිහඬබැවින් ඉවසූහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉක්බිති ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ පෙරවරු හැඳ පෙර ව පාසිවුරු ගෙන සිරිවඩු ගැහැවිහුගේ නිවෙස වෙත එළඹියහ. එළඹ පැන වූ අස්නෙහි වැඩහුන්හ. වැඩහිඳ ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ සිරිවඩු ගැහැවිහට මෙය වදාළහ: ගැහැවි, කිම තොපට ඉවසිය හැකි ද? කිම යැපිය හැකි ද? කිම දුක් වේදනාවෝ අඩු වෙද්ද? වැඩි නො වෙද් ද? ඔවුන්ගේ අඩු වීම පැනේ ද? වැඩි වීමෙක් නො පැනේ දැ? යි. වහන්ස, මට ඉවසිය නො හැක්ක. යැපිය නො හැකි. මාගේ දැඩි දුක් වේදනාවෝ වැඩි වෙති. අඩු නො වෙත්. ඔවුන්ගේ වැඩි වීම පැනෙයි, අඩු වීමෙක් නො පැනේ යි. ගැහැවි, එහෙයින් මෙහි ලා තොප විසින් මෙසේ හික්මිය යුතු: “කයෙහි කය අනු ව දක්නාසුලුව කෙලෙස් තවන වැර ඇතිව මනා දැනුම් ඇතිව සිහි ඇතිව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙන්නෙමි. වේදනා ... සිත්හි ... දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇතිව මනාදැනුම් ඇතිව සිහි ඇතිව දහම්ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙන්නෙමි” යි. ගැහැවි, මෙසේ ම තොප විසින් හික්මිය යුතු යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වහන්ස, යම් මේ සිවුසීවටන්හු භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද්දාහු ද, ඒ දහම්හු මා කෙරෙහි ඇතියහ. මම ද ඒ දහම්හි මැනවින් දිස්වෙමි. වහන්ස, මම කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇත්තෙම් මනාදැනුම් ඇත්තෙම් සිහි ඇත්තෙම් කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙමි. වෙදනාහි ... සිත්හි ... දහම්හි දහම් අනු ව දක්නාසුලුව කෙලෙස් තවන වැර ඇත්තෙම් මනාදැනුම් ඇත්තෙම් සිහි ඇත්තෙම් දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙමි. වහන්ස, යම් මේ පඤ්ච ඕරම්භාගියසංයෝජන කෙනෙක් භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද්දාහු නම් ඔවුනතුරෙන් ප්‍රහීණ නො වූ කිසිවක් තමා කෙරෙහි මම නො ම දකිමි යි. ගැහැවි, තොපට ලාභයෙකි. ගැහැවි, තොපට මනා ලැබීමෙකි. ගැහැවි, අනාගාමි ඵලය තොප විසින් පවසන ලදැ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 318,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 3. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මානදින්නසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1208. එකං සමයං ආයස්මා ආනන්දො රාජගහෙ විහරති වෙළුවනෙ කලන්දකනිවාපෙ. තෙන ඛො පන සමයෙන මානදින්නො ගහපති ආබාධිකො හොති, දුක්ඛිතො බාළ්හගිලානො. අථ ඛො මානදින්නො ගහපති අඤ්ඤතරං පුරිසං ආමන්තෙසි: -පෙ- එවරූපාය චාහං භන්තෙ, දුක්ඛාය වෙදනාය ඵුට්ඨො සමානො කායෙ කායානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. යානි චි’මානි භන්තෙ භගවතා පඤ්චොරම්භාගියානි සංයොජනානි දෙසිතානි, නාහං භන්තෙ, තෙසං කිඤ්චි අත්තනි අප්පහීනං සමනුපස්සාමී”ති. ලාභා තෙ ගහපති, සුලද්ධං තෙ ගහපති, “අනාගාමිඵලං තයා ගහපති, බ්යාකතන්ති.”"
                    },
                    {
                        "type": "centered",
                        "text": "සීලට්ඨිතිවග්ගො තතියො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "සීලං ඨිති පරිහානං සුද්ධකං බ්රාහ්මණෙන ච\nපදෙසං සමත්තං ලොකො සිරිවඩ්ඪො මානදින්නොති.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 3. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මානදින්න සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1208. එක්කලෙක ආයුෂ්මත් ආනන්‍ද තෙරණුවෝ රජගහනුවර සමීපයෙහි කලන්‍දකනිවාස නම් වේළුවනාරාමයෙහි වැඩ වෙසෙති. එසමයෙහි මානදින්න ගැහැවි ගටගත් ආබාධ ඇත්තේ දුකට පැමිණියේ දැඩි යේ ගිලන් වූයේ වෙයි. එකල්හි මානදින්න ගැහැවි එක්තරා පුරුෂයකු ඇමතී ය ... වහන්ස, මම මෙබඳු දුක්වේදනාවකිනුදු පහස්නා ලද්දෙම් කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇත්තෙම් මනා දැනුම් ඇත්තෙම් සිහි ඇත්තෙම් කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙමි. වෙදනාහි ... සිත්හි ... දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇත්තෙම් මනාදැනුම් ඇත්තෙම් සිහි ඇත්තෙම් දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙමි. වහන්ස, යම් මේ පඤ්ච ඕරම්භාගිය සංයෝජන කෙනෙක් භාග්‍යවතුන් වහන්සේ විසින් දෙසන ලදහු නම් වහන්ස, ඔවුනතර අප්‍රහීණ කිසිවක් තමා කෙරෙහි මම නො ම දක්මි යි. ගැහැවි, තොපට ලාභයෙකි. ගැහැවි, තොපට මනා ලැබීමෙකි. ගැහැවි, තොප විසින් අනගැමිඵලය පවසන ලදැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "තෙවැනි සීලට්ඨිතිවර්‍ගය යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි සූත්‍ර නාමාවලිය:**",
                        "type": "unindented"
                    },
                    {
                        "text": "සීල, ඨිති, පරිහාණ, සුද්ධක, බ්‍රාහ්මණ, පදෙස, සමත්ත, ලෝක, සිරිවඩ්ඪ, මානදින්නයි සූත්‍රාන්ත දශයෙකි යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 320,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "4. අනනුස්සුතවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 4. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අනනුස්සුතසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "1209. **සාවත්ථියං:**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අයං කායෙ කායානුපස්සනාති මෙ භික්ඛවෙ, පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු චක්ඛුං උදපාදි, ඤාණං උදපාදි, පඤ්ඤා උදපාදි, විජ්ජා උදපාදි, ආලොකො උදපාදි. සා ඛො පනායං කායෙ කායානුපස්සනා භාවෙතබ්බා’ති මෙ භික්ඛවෙ -පෙ- භාවිතාති මෙ භික්ඛවෙ, පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු චක්ඛුං උදපාදි, ඤාණං උදපාදි, පඤ්ඤා උදපාදි, විජ්ජා උදපාදි, ආලොකො උදපාදි. අයං වෙදනාසු වෙදනානුපස්සනා’ති -පෙ- අයං චිත්තෙ චිත්තානුපස්සනා’ති -පෙ- අයං ධම්මෙසු ධම්මානුපස්සනා’ති මෙ භික්ඛවෙ, පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු චක්ඛුං උදපාදි, ඤාණං උදපාදි, පඤ්ඤා උදපාදි, විජ්ජා උදපාදි, ආලොකො උදපාදි. සා ඛො පනායං ධම්මෙසු ධම්මානුපස්සනා භාවෙතබ්බා’ති මෙ භික්ඛවෙ -පෙ- භාවිතාති මෙ භික්ඛවෙ, පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු චක්ඛුං උදපාදි, ඤාණං උදපාදි, පඤ්ඤා උදපාදි, විජ්ජා උදපාදි, ආලොකො උදපාදී’ති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 4. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "විරාගසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1210. චත්තාරො මෙ භික්ඛවෙ, සතිපට්ඨානා භාවිතා බහුලීකතා එකන්තනිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තන්ති. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙ ඛො භික්ඛවෙ, චත්තාරො සතිපට්ඨානා භාවිතා බහුලීකතා එකන්තනිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තන්තීති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "4. අනනුස්සුත වර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 4. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අනනුස්සුත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1209. **සැවැත්නුවර:**",
                        "type": "unindented"
                    },
                    {
                        "text": "මහණෙනි, මේ කයෙහි කය අනුව දැක්ම ය යි මා විසින් පෙර නො ඇසූවිරූ දහම්හි ඇස පහළ විය, නැණ පහළ විය. පැන පහළ විය. විදු පහළ විය. එලිය පහළ විය. මහණෙනි, ඒ මේ කයෙහි කය අනුව දැක්ම වැඩිය යුතු ය යි මා විසින් ... මහණෙනි, වඩන ලදැ යි මා විසින් පෙර නො ඇසූවිරූ දහම්හි ඇස පහළ විය, නැන පහළ විය. පැන පහළ විය. විදු පහළ විය. එලිය පහළ විය. මේ වේදනාවන්හි වේදනා අනු ව දැක්ම යයි ... මේ සිත්හි සිත් අනුව දැක්ම යයි ... මහණෙනි, මේ දහම්හි දහම් අනුව දැක්ම යයි මා විසින් පෙර නො ඇසූ විරූ දහම්හි ඇස පහළ විය. නැන පහළ විය. පැන පහළ විය. විදු පහළ විය. එලිය පහළ විය. මහණෙනි, ඒ මේ දහම්හි දහම් අනුව දැක්ම වැඩිය යුතු යයි මා විසින් … මහණෙනි, වඩන ලදැ යි මා විසින් පෙර නො ඇසූවිරූ දහම්හි ඇස පහළ විය. නැන පහළ විය. පැන පහළ විය. විදු පහළ විය. එලිය පහළ වී යයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 4. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "විරාග සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1210. මහණෙනි, මේ සිවුසීවටන්හු වඩන ලද්දාහු බහුල කරන ලද්දාහු ඒකාන්ත නිර්වේදය විරාගය නිරෝධය ක්ලේශව්‍යපශමය විශිෂ්ටඥානය චතුස්සත්‍යාවබෝධය නිර්‍වාණය පිණිස පවතිත්. කවර සිවුසීවටන්හු ද යත්: මහණෙනි, මෙසස්නෙහි මහණ කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙයි. වෙදනාහි ... සිත්හි ... දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. මහණෙනි, මේ සිවුසීවටන්හු වඩන ලදහු බහුල කරන ලදහු ඒකාන්ත නිර්වේදය විරාගය නිරෝධය ක්ලේශව්‍යපශමය විශිෂ්ටඥානය චතුස්සත්‍යාවබෝධය නිර්‍වාණය පිණිස පවතිත් යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 322,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 4. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "විරද්ධසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1211. යෙසං කෙසඤ්චි භික්ඛවෙ, චත්තාරො සතිපට්ඨානා විරද්ධා විරද්ධො තෙසං අරියො{1} මග්ගො සම්මා දුක්ඛක්ඛයගාමී. යෙසං කෙසඤ්චි භික්ඛවෙ, චත්තාරො සතිපට්ඨානා ආරද්ධා, ආරද්ධො තෙසං අරියො මග්ගො සම්මා දුක්ඛක්ඛයගාමී. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. යෙසං කෙසඤ්චි භික්ඛවෙ, ඉමෙ චත්තාරො සතිපට්ඨානා විරද්ධා, විරද්ධො තෙසං අරියො මග්ගො සම්මා දුක්ඛක්ඛයගාමී. යෙසං කෙසඤ්චි භික්ඛවෙ, ඉමෙ චත්තාරො සතිපට්ඨානා ආරද්ධා, ආරද්ධො තෙසං අරියො මග්ගො සම්මා දුක්ඛක්ඛයගාමීති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 4. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භාවිතසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1212. චත්තාරො මෙ භික්ඛවෙ, සතිපට්ඨානා භාවිතා බහුලීකතා අපාරා පාරං ගමනාය සංවත්තන්ති. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී -පෙ- වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙ ඛො භික්ඛවෙ, චත්තාරො සතිපට්ඨානා භාවිතා බහුලීකතා අපාරා පාරං ගමනාය සංවත්තන්තීති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 4. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සතොසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1213. සතො භික්ඛවෙ, භික්ඛු විහරෙය්ය සම්පජානො. අයං වො අම්හාකං අනුසාසනී. කථඤ්ච භික්ඛවෙ, භික්ඛු සතො හොති: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී -පෙ- වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. එවං ඛො භික්ඛවෙ, භික්ඛු සතො හොති. කථඤ්ච භික්ඛවෙ, භික්ඛු සම්පජානො හොති: ඉධ භික්ඛවෙ, භික්ඛුනො විදිතා වෙදනා උප්පජ්ජන්ති, විදිතා උපට්ඨහන්ති, විදිතා අබ්භත්ථං ගච්ඡන්ති. විදිතා විතක්කා උප්පජ්ජන්ති, විදිතා උපට්ඨහන්ති, විදිතා අබ්භත්ථං ගච්ඡන්ති. විදිතා සඤ්ඤා උප්පජ්ජන්ති, විදිතා උපට්ඨහන්ති, විදිතා අබ්භත්ථං ගච්ඡන්ති. එවං ඛො භික්ඛවෙ, භික්ඛු සම්පජානො හොති. සතො භික්ඛවෙ, භික්ඛු විහරෙය්ය සම්පජානො. අයං වො අම්හාකං අනුසාසනීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අරියො අට්ඨඞ්ගිකො මග්ගො - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 4. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "විරජ්ජ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1211. මහණෙනි, යම් කිසි කෙනකුන් විසින් සිවුසීවටන්හු වරද්දන ලද්දාහු නම් ඔවුන් විසින් මැනවින් දුක් ගෙවීමට යන අරීමග වරද්දන ලද්දේ ය. මහණෙනි, යම් කිසි කෙනකුන් විසින් සිවුසීවටන්හු අරඹන ලද්දාහු නම් ඔවුන් විසින් මැනවින් දුක් ගෙවීමට යන අරීමග අරඹන ලද්දේ ය. කවර සිවුසීවටන්හු ද යත්: මහණෙනි, මෙසස්නෙහි මහණ කයෙහි කය අනුව දක්නා සුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙයි. වෙදනාහි ... සිත්හි ... දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙයි. මහණෙනි, යම් කිසි කෙනකුන් විසින් මේ සිවුසීවටන්හු වරද්දන ලද්දාහු නම් ඔවුන් විසින් මැනවින් දුක් ගෙවීමට යන අරීමග වරද්දන ලද්දේ ය. මහණෙනි, යම් කිසි කෙනකුන් විසින් සිවුසීවටන්හු අරඹන ලද්දාහු නම් ඔවුන් විසින් මැනවින් දුක් ගෙවීමට යන අරීමග අරඹන ලද්දේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 4. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භාවිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1212. මහණෙනි, මේ සතරසතිපට්ඨානයෝ වඩන ලද්දාහු බහුල කරන ලද්දාහු මෙතෙරින් එතෙරට යාම පිණිස පවතිත්, කවර සතරෙක් ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනුව දක්නාසුලු ව ... වෙදනාහි ... සිත්හි ... දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙයි. මහණෙනි, මේ සතරසතිපට්ඨානයෝ වඩන ලද්දාහු බහුල කරන ලද්දාහු මෙතෙරින් එතෙරට යෑම පිණිස පවතිත් යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 4. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සතෝ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1213. මහණෙනි, මහණ සිහි ඇති ව මනා දැනුම් ඇති ව වෙසෙන්නේය. මෙය තොපට අපගේ අනුසාසනා යි. මහණෙනි, කෙසේ නම් මහණ සිහි ඇත්තේ වේ ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනුව දක්නාසුලු ව … විඳුම්හි ... සිත්හි ... දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙයි. මහණෙනි, මෙසේ මහණ සිහි ඇත්තේ වෙයි. මහණෙනි, කෙසේ නම් මහණ මනා දැනුම් ඇත්තේ වේ ද යත්: මහණෙනි, මෙහි මහණහට වේදනාවෝ දන්නා ලද්දාහු උපදිත්. දන්නා ලද්දාහු එළඔ සිටිත්. දන්නා ලද්දාහු වැනසීමට යෙත්. විතර්‍කයෝ දන්නා ලද්දාහු උපදිත්. දන්නා ලද්දාහු එළඔ සිටිත්. දන්නා ලද්දාහු වැනසීමට යෙත්. සංඥාවෝ දන්නා ලද්දාහු උපදිත්. දන්නා ලද්දාහු එළඔ සිටිත්. දන්නා ලද්දාහු වැනසීමට යෙත්. මහණෙනි, මෙසේ මහණ මනා දැනුම් ඇත්තේ වෙයි. මහණෙනි, මහණ සිහි ඇති ව මනා දැනුම් ඇති ව වෙසෙන්නේ ය. මේ තොපට අපගේ අනුශාසනා යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 324,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 4. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අඤ්ඤාසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1214. චත්තාරො මෙ භික්ඛවෙ, සතිපට්ඨානා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී -පෙ- වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙසං ඛො භික්ඛවෙ, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා ද්වින්නං ඵලානං අඤ්ඤතරං ඵලං පාටිකඞ්ඛං: “දිට්ඨෙව ධම්මෙ අඤ්ඤා, සති වා උපාදිසෙසෙ අනාගාමිතා”ති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 4. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඡන්දසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1215. චත්තාරො මෙ භික්ඛවෙ, සතිපට්ඨානා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තස්ස කායෙ කායානුපස්සිනො විහරතො යො කායස්මිං ඡන්දො සො පහීයති. ඡන්දස්ස පහානා අමතං සච්ඡිකතං හොති. වෙදනාසු -පෙ- යො වෙදනාසු{1} ඡන්දො සො පහීයති. ඡන්දස්ස පහානා අමතං සච්ඡිකතං හොති. චිත්තෙ -පෙ- යො චිත්තම්හි ඡන්දො සො පහීයති. ඡන්දස්ස පහානා අමතං සච්ඡිකතං හොති. ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තස්ස ධම්මෙසු ධම්මානුපස්සිනො විහරතො යො ධම්මෙසු ඡන්දො සො පහීයති. ඡන්දස්ස පහානා අමතං සච්ඡිකතං හොතීති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 4. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරිඤ්ඤාතසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1216. චත්තාරොමෙ භික්ඛවෙ, සතිපට්ඨානා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තස්ස කායෙ කායානුපස්සිනො විහරතො කායො පරිඤ්ඤාතො හොති. කායස්ස පරිඤ්ඤාතත්තා අමතං සච්ඡිකතං හොති. වෙදනාසු -පෙ- වෙදනා පරිඤ්ඤාතා හොන්ති. වෙදනානං{1} පරිඤ්ඤාතත්තා අමතං සච්ඡිකතං හොති. චිත්තෙ -පෙ- චිත්තං පරිඤ්ඤාතං හොති. චිත්තස්ස පරිඤ්ඤාතත්තා අමතං සච්ඡිකතං හොති. ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තස්ස ධම්මෙසු ධම්මානුපස්සිනො විහරතො ධම්මා පරිඤ්ඤාතා හොන්ති. ධම්මානං පරිඤ්ඤාතත්තා අමතං සච්ඡිකතං හොතීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. වෙදනාය - සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 4. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අඤ්ඤා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1214. මහණෙනි, මේ සතිපට්ඨාන සතරෙකි. කවර සතරෙක් ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනුව දක්නාසුලු ව ... විඳුම්හි ... සිත්හි ... දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. මහණෙනි, මේ සතර සතිපට්ඨාන වැඩූ බැවින් බහුල කළ බැවින් උභය ඵලයන් ගෙන් එක්තරා ඵලයක් කැමති විය යුතු යි. දිටුදැමියෙහි රහත්බව හෝ උපාදානශේෂ ව ඇති කල්හි අනගැමි බව හෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 4. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඡන්‍ද සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1215. මහණෙනි, මේ සතිපට්ඨාන සතරකි. කවර සතරෙක් ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. කයෙහි කය අනුව දක්නාසුලු ව වෙසෙන ඔහුට කයෙහි යම් තෘෂ්ණාඡන්‍දයෙක් වේ නම් එය ප්‍රහීණ වේ. ඡන්‍දය ප්‍රහීණ වීමෙන් නිවන පසක් කරන ලද්දේ වේ. වෙදනාහි ... වේදනායෙහි යම් තෘෂ්ණාඡන්‍දයෙක් වේ නම් එය ප්‍රහීණ වේ. ඡන්‍දය ප්‍රහීණ වීමෙන් නිවන පසක් කරන ලද්දේ වේ. සිත්හි ... සිත්හි යම් තෘෂ්ණාඡන්‍දයෙක් වේ නම් එය ප්‍රහීණ වේ. ඡන්‍දය ප්‍රහීණ වීමෙන් නිවන පසක්කරන ලද්දේ වේ. දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. දහම්හි දහම් අනුව දක්නාසුලු ව වෙසෙන ඔහුට දහම්හි යම් තෘෂ්ණාඡන්‍දයෙක් වේ නම් එය ප්‍රහීණ වේ. ඡන්‍දය ප්‍රහීණ වීමෙන් නිවන පසක්කරන ලද්දේ වේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 4. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරිඤ්ඤාත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1216. මහණෙනි, මේ සතිපට්ඨාන සතරෙකි. කවර සතරෙක් ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. කයෙහි කය අනුව දක්නාසුලු ව වෙසෙන ඔහු විසින් කය පිරිසිඳ දන්නා ලද්දේ වෙයි. කය පිරිසිඳ දත් බැවින් නිවන පසක් කරන ලද්දේ වේ. වේදනාහි ... වේදනාව පිරිසිඳ දන්නා ලද්දී වේ. වේදනාව පිරිසිඳ දත් බැවින් නිවන පසක් කරන ලද්දේ වේ. සිත්හි ... සිත පිරිසිඳ දන්නා ලද්දේ වේ. සිත පිරිසිඳ දත් බැවින් නිවන පසක්කරන ලද්දේ වේ. දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. දහම්හි දහම් අනුව දක්නාසුලු ව වෙසෙන ඔහු විසින් දහම්හු පිරිසිඳ දන්නා ලද්දාහු වෙති. දහම් පිරිසිඳ දත් බැවින් නිවන පසක්කරන ලද්දේ වේ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 326,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 4. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භාවනාසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1217. චතුන්නං භික්ඛවෙ, සතිපට්ඨානානං භාවනං දෙසිස්සාමි. තං සුණාථ. කතමා ච භික්ඛවෙ, චතුන්නං සතිපට්ඨානානං භාවනා: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. අයං ඛො භික්ඛවෙ{1}, චතුන්නං සතිපට්ඨානානං භාවනාති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 4. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "විභඞ්ගසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1218. සතිපට්ඨානඤ්ච වො භික්ඛවෙ, දෙසිස්සාමි සතිපට්ඨානභාවනඤ්ච සතිපට්ඨානභාවනාගාමිනිඤ්ච පටිපදං. තං සුණාථ. කතමඤ්ච භික්ඛවෙ, සතිපට්ඨානං: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉදං වුච්චති භික්ඛවෙ, සතිපට්ඨානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමා ච භික්ඛවෙ, සතිපට්ඨානභාවනා: ඉධ භික්ඛවෙ, භික්ඛු සමුදයධම්මානුපස්සී කායස්මිං විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වයධම්මානුපස්සී කායස්මිං විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. සමුදයවයධම්මානුපස්සී කායස්මිං විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. සමුදයධම්මානුපස්සී වෙදනාසු විහරති -පෙ- සමුදයවයධම්මානුපස්සී වෙදනාසු විහරති -පෙ- සමුදයධම්මානුපස්සී චිත්තස්මිං"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අයං භික්ඛවෙ - සී 1, 2."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 4. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භාවනා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1217. මහණෙනි, සිවු සීවටන් වැඩීම දේශනා කරන්නෙමි. එය අසවු. මහණෙනි, සිවු සීවටන් වැඩීම කවරේ ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. විඳුම්හි ... සිත්හි ... දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. මහණෙනි, මේ සිවුසීවටන් වැඩීම යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 4. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "විභඞ්ග සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1218. මහණෙනි, සතිපට්ඨානයත් සතිපට්ඨාන වැඩීමත් සතිපට්ඨාන වැඩීමට යන පිළිවෙතත් තොපට දේශනා කරන්නෙමි. එය අසවු. මහණෙනි, සතිපට්ඨාන කවරේ ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. විඳුම්හි ... සිත්හි ... දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. මහණෙනි, මේ සතිපට්ඨාන යයි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, සතිපට්ඨාන වැඩීම කවරේ ද යත්: මහණෙනි, මෙහි මහණ කයෙහි හටගැනුම් ස්වභාවය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. කයෙහි වැනසුම් සැහැවි පුනපුනා දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. කයෙහි හටගැනුම් ස්වභාවය හා වැනසුම් ස්වභාවය පුනපුනා දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. වේදනාවන්හි හටගැනුම් ස්වභාවය අනුව දක්නාසුලු ව ... වෙසේ. වේදනාවන්හි වැනසුම් ස්වභාවය අනු ව දක්නාසුලු ව ... වෙසේ. වේදනාවන්හි හටගැනුම් ස්වභාවය හා වැනසුම් ස්වභාවය අනුව දක්නාසුලු ව ... වෙසේ ... සිත්හි හටගැනුම් ස්වභාවය පුනපුනා දක්නාසුලු ව ...",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 328,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "විහරති -පෙ- වයධම්මානුපස්සී චිත්තස්මිං විහරති -පෙ- සමුදයවයධම්මානුපස්සී චිත්තස්මිං විහරති -පෙ- සමුදයධම්මානුපස්සී ධම්මෙසු විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වයධම්මානුපස්සී ධම්මෙසු විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. සමුදයවයධම්මානුපස්සී ධම්මෙසු විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. අයං වුච්චති භික්ඛවෙ, සතිපට්ඨානභාවනා."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමා ච භික්ඛවෙ, සතිපට්ඨානභාවනාගාමිනී පටිපදා: අයමෙව අරියො අට්ඨඞ්ගිකො මග්ගො. සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. අයං වුච්චති භික්ඛවෙ, සතිපට්ඨානභාවනාගාමිනී පටිපදාති."
                    },
                    {
                        "type": "centered",
                        "text": "අනනුස්සුතවග්ගො චතුත්ථො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "අනනුස්සුතං විරාගො ච විරද්ධං භාවිතො සතො\nඅඤ්ඤා ච ඡන්දො පරිඤ්ඤාතො භාවනා විභඞ්ගෙන චාති.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "වෙසේ. සිත්හි වැනසුම් ස්වභාවය පුනපුනා දක්නාසුලු ව ... වෙසේ. සිත්හි හටගැනුම් ස්වභාවය හා වැනසුම් ස්වභාවය පුනපුනා දක්නාසුලු ව වෙසේ. දහම්හි හටගැනුම් ස්වභාවය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. දහම්හි වැනසුම් ස්වභාවය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. දහම්හි හටගැනුම් ස්වභාවය හා වැනසුම් ස්වභාවය පුනපුනා දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. මහණෙනි, මේ සතිපට්ඨාන වැඩීමය යි කියනු ලැබේ."
                    },
                    {
                        "text": "මහණෙනි, සතිපට්ඨාන වැඩීමට යන පිළිවෙත කවරේද යත්: මේ අරිඅටඟිමඟ මැ යි. එනම්: සම්මාදිට්ඨි ... සම්මාසමාධි යි. මහණෙනි, මේ සතිපට්ඨාන වැඩීමට යන පිළිවෙතැ යි කියනු ලැබේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සිවුවැනි අනනුස්සුතවර්‍ගය යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි සූත්‍රනාමාවලිය:**",
                        "type": "unindented"
                    },
                    {
                        "text": "අනනුස්සුත, විරාග, විරද්ධ, භාවිත, සතෝ, අඤ්ඤා, ඡන්‍ද, පරිඤ්ඤාත, භාවනා යන සූත්‍ර නවය විභඞ්ග සූත්‍රයෙන් දසයෙක් වේ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 330,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "5. අමතවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 5. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අමතසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1219. චතූසු භික්ඛවෙ, සතිපට්ඨානෙසු සුපට්ඨිතචිත්තා විහරථ. මා වො අමතං පනස්ස. කතමෙසු චතූසු: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙසු භික්ඛවෙ, චතූසු සතිපට්ඨානෙසු සුපට්ඨිතචිත්තා විහරථ. මා වො අමතං පනස්සාති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 5. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සමුදයසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "1220.** සාවත්ථියං:**"
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුන්නං භික්ඛවෙ, සතිපට්ඨානානං සමුදයඤ්ච අත්ථගමඤ්ච දෙසිස්සාමි. තං සුණාථ. කො ච භික්ඛවෙ, කායස්ස සමුදයො. ආහාරසමුදයා කායස්ස සමුදයො{1}, ආහාරනිරොධා කායස්ස අත්ථගමො. ඵස්සසමුදයා වෙදනානං සමුදයො.{2} ඵස්සනිරොධා වෙදනානං අත්ථගමො. නාමරූපසමුදයා චිත්තස්ස සමුදයො. නාමරූපනිරොධා චිත්තස්ස අත්ථගමො. මනසිකාරසමුදයා ධම්මානං සමුදයො. මනසිකාරනිරොධා ධම්මානං අත්ථගමොති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 5. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මග්ගසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1221. එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි. එකමිදාහං භික්ඛවෙ, සමයං උරුවෙලායං විහරාමි, නජ්ජා නෙරඤ්ජරාය තීරෙ අජපාලනිග්රොධෙ පඨමාභිසම්බුද්ධො. තස්ස මය්හං භික්ඛවෙ, රහොගතස්ස පතිසල්ලීනස්ස එවං චෙතසො පරිවිතක්කො උදපාදි:"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කායසමුදයො - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "2. වෙදනාසමුදයො - සීමු, සී 1."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "5. අමත වර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 5. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අමත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1219. මහණෙනි, සිවු සීවටන්හි එළඹ සිටි සිත් ඇති ව වෙසෙවු. තොපට නිවන නො නැසේවා. කවර සිවු සීවටන්හි ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇතිව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙයි. විඳුම්හි ... සිත්හි ... දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙයි. මහණෙනි, මේ සිවු සීවටන්හි එළඹ සිටි සිත් ඇති ව වෙසෙවු. තොපට නිවන නො නැසේවා යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 5. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සමුදය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1220.** සැවැත්නුවර:**",
                        "type": "unindented"
                    },
                    {
                        "text": "මහණෙනි, සිවුසීවටන් හි සමුදයත් අත්‍ථගමයත් දේශනා කරන්නෙමි. එය අසවු. මහණෙනි, කයෙහි සමුදය කිමෙක් ද යත්: ආහාරසමුදයයෙන් කයෙහි හට ගැනීම වේ, ආහාරනිරෝධයෙන් කයෙහි අස්තඞ්ගමය වේ. ඵස්ස සමුදයයෙන් වේදනාවන්ගේ හට ගැනීම වේ. ඵස්ස නිරෝධයෙන් වේදනාවන්ගේ අස්තඞ්ගමය වේ. නාමරූපසමුදයයෙන් සිතේහටගැනීම වේ. නාමරූපනිරෝධයෙන් සිතේ අස්තඞ්ගමය වේ. මනසිකාරසමුදයයෙන් ධර්‍මයන්ගේ හටගැනීම වේ. මනසිකාරනිරෝධයෙන් ධර්‍මයන්ගේ අස්තඞ්ගමය වේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 5. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මග්ග සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1221. එක්සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයෙහි අනේපිඬු සිටුහුගේ දෙව්රම්හි වැඩවසන සේක. එහි දී භාග්‍යවතුන් වහන්සේ භික්‍ෂූන් ඇමතූ සේක: මහණෙනි, මම බුදු ව පළමු කොට එක්සමයෙක උරුවෙල්දනවුහි නේරඤ්ජා ගංඉවුරෙහි අජපල්නුගරුක මුල්හි වෙසෙමි. මහණෙනි, එකලා වූ විවේකයෙන් යුත් ඒ මට මෙබඳු චිත්තවිතර්‍කයෙක් පහළ විය:",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 332,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එකායනොයං{1} මග්ගො සත්තානං විසුද්ධියා සොකපරිද්දවානං{2} සමතික්කමාය දුක්ඛදොමනස්සානං අත්ථගමාය ඤායස්ස අධිගමාය නිබ්බානස්ස සච්ඡිකිරියාය, යදිදං චත්තාරො සතිපට්ඨානා. කතමෙ චත්තාරො: කායෙ වා භික්ඛු කායානුපස්සී විහරෙය්ය, ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු වා භික්ඛු වෙදනානුපස්සී විහරෙය්ය -පෙ- චිත්තෙ වා භික්ඛු චිත්තානුපස්සී විහරෙය්ය -පෙ- ධම්මෙසු වා භික්ඛු ධම්මානුපස්සී විහරෙය්ය ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. එකායනො’යං මග්ගො සත්තානං විසුද්ධියා සොකපරිද්දවානං සමතික්කමාය දුක්ඛදොමනස්සානං අත්ථගමාය ඤායස්ස අධිගමාය නිබ්බානස්ස සච්ඡිකිරියාය යදිදං චත්තාරො සතිපට්ඨානා”ති.{3}"
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භික්ඛවෙ, බ්රහ්මා සහම්පති මම චෙතසා චෙතොපරිවිතක්කමඤ්ඤාය සෙය්යථාපි නාම බලවා පුරිසො සම්මිඤ්ජිතං වා බාහං පසාරෙය්ය, පසාරිතං වා බාහං සම්මිඤ්ජෙය්ය, එවමෙවං බ්රහ්මලොකෙ අන්තරහිතො මම පුරතො පාතුරහොසි. අථ ඛො භික්ඛවෙ, බ්රහ්මා සහම්පති එකංසං උත්තරාසඞ්ගං කරිත්වා යෙනාහං තෙනඤ්ජලිං පණාමෙත්වා මං එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "එවමෙතං භගවා, එවමෙතං සුගත, එකායනො’යං භන්තෙ, මග්ගො සත්තානං විසුද්ධියා සොකපරිද්දවානං සමතික්කමාය දුක්ඛදොමනස්සානං අත්ථගමාය ඤායස්ස අධිගමාය නිබ්බානස්ස සච්ඡිකිරියාය යදිදං චත්තාරො සතිපට්ඨානා. කතමෙ චත්තාරො: කායෙ වා භන්තෙ, භික්ඛු කායානුපස්සී විහරෙය්ය ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං, වෙදනාසු වා භන්තෙ භික්ඛු වෙදනානුපස්සී විහරෙය්ය -පෙ- චිත්තෙ වා භන්තෙ භික්ඛු චිත්තානුපස්සී විහරෙය්ය -පෙ- ධම්මෙසු වා භන්තෙ, භික්ඛු ධම්මානුපස්සී විහරෙය්ය ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. එකායනො’යං භන්තෙ, මග්ගො සත්තානං විසුද්ධියා සොකපරිද්දවානං සමතික්කමාය දුක්ඛදොමනස්සානං අත්ථගමාය ඤායස්ස අධිගමාය නිබ්බානස්ස සච්ඡිකිරියාය යදිදං චත්තාරො සතිපට්ඨානාති. ඉදමවොච භික්ඛවෙ, බ්රහ්මා සහම්පති. ඉදං වත්වා අථාපරං එතදවොච:"
                    },
                    {
                        "type": "gatha",
                        "text": "එකායනං ජාතිඛයන්තදස්සී{4}\nමග්ගං පජානාති හිතානුකම්පී\nඑතෙන මග්ගෙන අතංසු{5} පුබ්බෙ\nතරිස්සන්ති යෙ ච තරන්ති ඔඝන්ති.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. එකායන්වායං - ස්යා, මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සොකපරිදෙවානං - ස්යා, මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. සතිපට්ඨානා - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. ඛයඤ්ච දස්සී - සී 2."
                    },
                    {
                        "type": "footnote",
                        "text": "5. අතරිංසු - ස්යා. තරිංසු - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "“යම් මේ සතරසතිපට්ඨාන කෙනෙක් වෙත් නම් සත්ත්‍වයන්ගේ විශුද්ධිය පිණිස ශෝකපරිදේවයන් ඉක්මවීම පිණිස දුක් දොම්නස් දුරු කිරීම පිණිස අරිඅටඟිමඟ අවබෝධ කරනු පිණිස නිවන පසක්කිරීම පිණිස මේ එක ම මඟය. කවර සතරෙක් ද යත්: මහණ කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇතිව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙන්නේ ය. මහණ විඳුම්හි හෝ විඳුම් අනුව දක්නාසුලු ව ... වෙසෙන්නේ ය. මහණ සිත්හි හෝ සිත් අනුව දක්නාසුලු ව වෙසෙන්නේ ය. මහණ දහම්හි හෝ දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙන්නේ ය. යම් මේ සතරසතිපට්ඨාන කෙනෙක් වෙත් නම් සත්‍වයන්ගේ විශුද්ධිය පිණිස ශෝකපරිදේවයන් ඉක්මවනු පිණිස දුක් දොම්නස් දුරු කරනු පිණිස අරිඅටඟිමඟ අවබෝධ කරනු පිණිස නිවන පසක්කරනු පිණිස මේ එක ම මඟ වේ” යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, එකල්හි සහම්පති බ්‍රහ්මතෙමේ මාගේ චිත්තවිතර්‍කය සියසිතින් දැන යම්සේ බලවත් පුරුෂයෙක් හැකුලූ අතක් හෝ දිගු කරන්නේද; දිගු කළ අතක් හෝ හකුලුවන්නේද: එසෙයින් ම බඹලොව අතුරුදන් ව මා ඉදිරියෙහි පහළ විය. මහණෙනි, ඉක්බිති සහම්පති බ්‍රහ්ම උතුරුසඟ එකස් කොට මා වෙත එළඹැ ඇඳිලි බැඳ මට මෙසේ සැලකෙළේ ය:",
                        "type": "paragraph"
                    },
                    {
                        "text": "භාග්‍යවතුන් වහන්ස, මෙය එසේ ය. සුගතයන් වහන්ස, මෙය එසේය. වහන්ස, යම් මේ සතරසතිපට්ඨාන කෙනෙක් වෙත් නම් සත්ත්‍වයන්ගේ විශුද්ධියට ශෝකපරිදේවයන් ඉක්මවීමට දුක් දොම්නස් දුරු කිරීමට ඤායය අවබෝධ කිරීමට නිවන පසක්කිරීමට මේ එක ම මඟ ය. කවර සතරෙක් ද යත්: වහන්ස, මහණ කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙන්නේ ය. වහන්ස, මහණ විඳුම්හි හෝ විඳුම් අනුව දක්නාසුලු ව ... වෙසෙන්නේ ය. වහන්ස, මහණ සිත්හි හෝ සිත් අනුව දක්නාසුලු ව ... වෙසෙන්නේ ය. වහන්ස, මහණ දහම්හි හෝ දහම් අනුව දක්නාසුලුව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙන්නේය. වහන්ස, යම් මේ සතර සතිපට්ඨානකෙනෙක් වෙත් නම් සත්ත්‍වයන්ගේ විශුද්ධියට ශෝකපරිදේවයන් ඉක්මවීමට දුක් දොම්නස් දුරු කිරීමට ඤායය අවබෝධ කිරීමට නිවන පසක් කිරීමට මේ එක ම මඟ වේ යි. මහණෙනි, සහම්පති බ්‍රහ්ම තෙමේ මෙය කී ය. මෙය කියා යළි මේ ගය ද කී:",
                        "type": "paragraph"
                    },
                    {
                        "text": "නිවන දක්නාසුලු වූ හිතානුකම්පා ඇති භාග්‍යවතුන් වහන්සේ ඒකායනමාර්‍ගය (-සිවුසීවටන්) දන්නා සේක. යම් කෙනෙක් (දැන් යම් මඟකින්) චතුරෝඝ තරණය කෙරෙත් නම් පෙරත් මේ මඟින් තරණය කළහ. (මතුත්) තරණය කරන්නාහ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 334,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 5. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සතොසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1222. සතො භික්ඛවෙ, භික්ඛු විහරෙය්ය. අයං වො අම්හාකං අනුසාසනී. කථඤ්ච භික්ඛවෙ, භික්ඛු සතො හොති: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. එවං ඛො භික්ඛවෙ, භික්ඛු සතො හොති. සතො භික්ඛවෙ, භික්ඛු විහරෙය්ය. අයං වො අම්හාකං අනුසාසනීති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 5. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කුසලරාසිසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1223. කුසලරාසීති භික්ඛවෙ, වදමානො චත්තාරො සතිපට්ඨානෙ සම්මාවදමානො වදෙය්ය. කෙවලො චායං{1} භික්ඛවෙ, කුසලරාසි යදිදං චත්තාරො සතිපට්ඨානා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී -පෙ- වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. කුසලරාසීති භික්ඛවෙ, වදමානො ඉමෙ චත්තාරො සතිපට්ඨානෙ සම්මා වදමානො වදෙය්ය. කෙවලො හයං භික්ඛවෙ, කුසලරාසි. යදිදං චත්තාරො සතිපට්ඨානාති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 5. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පාතිමොක්ඛසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1224. අථ ඛො අඤ්ඤතරො භික්ඛු යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච: “සාධු මෙ භන්තෙ, භගවා සඞ්ඛිත්තෙන ධම්මං දෙසෙතු, යමහං භගවතො ධම්මං සුත්වා එකො වූපකට්ඨො අප්පමත්තො ආතාපී පහිතත්තො විහරෙය්යන්ති.”"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කෙවලොහායං - මඡසං, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 5. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සතෝ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1222. මහණෙනි. මහණ සිහි ඇති ව වෙසෙන්නේ ය. මේ තොපට අපගේ අනුශාසනා යි. මහණෙනි, කෙසේ නම් මහණ සිහි ඇත්තේ වේ ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. විඳුම්හි ... සිත්හි … දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇතිව දහම්ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. මහණෙනි, මෙසේ මහණ සිහි ඇත්තේ වේ. මහණෙනි, මහණ සිහි ඇතිව වෙසෙන්නේ ය. මේ තොපට අපගේ අනුශාසනා යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 5. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කුසලරාසි සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1223. මහණෙනි, කුසල්රැසැ යි කියන්නෙක් මැනවින් කියන්නේ සතිපට්ඨානසතර කියන්නේ ය. මහණෙනි, යම් මේ සතිපට්ඨාන සතරෙක් වේ නම් මෙය හුදු කුසල් රැසෙකි. කවර සතරෙක් ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනුව දක්නාසුලු ව ... විඳුම්හි ... සිත්හි … දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙ යි. මහණෙනි, කුසල්රැසැ යි කියන්නෙක් මැනවින් කියන්නේ මේ සතරසතිපට්ඨාන කියන්නේය. මහණෙනි, යම් මේ සතිපට්ඨාන සතරෙක් වේ නම් මෙය හුදු කුසල් රැසෙකි යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 5. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පාතිමොක්ඛ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1224. එකල්හි එක්තරා මහණෙක් භාග්‍යවතුන් වහන්සේ වෙත එළඹියේය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත් පස් ව හුන්නේය. එකත්පස් ව හුන් ඒ මහණ භාග්‍යවතුන් වහන්සේ ට මෙය සැලකළේය: “වහන්ස, මම භාග්‍යවතුන් වහන්සේගෙන් යම් දහමක් අසා එකලා ව ගණයා කෙරෙන් වෙන් වූයෙම් නො පමා ව කෙලෙස් තවන වැර ඇතියෙම් නිවන පිණිස මෙහෙයූ සිත් ඇතියෙම් වෙසෙන්නෙම් නම් භාග්‍යවතුන් වහන්සේ (එබඳු) දහමක් සැකෙවින් මට දේශනා කරනු මැනවි”’ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 336,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තස්මාතිහ ත්වං භික්ඛු, ආදිමෙව විසොධෙහි කුසලෙසු ධම්මෙසු. කො ච ආදි කුසලානං ධම්මානං: ඉධ ත්වං භික්ඛු, පාතිමොක්ඛසංවරසංවුතො විහරාහි ආචාරගොචරසම්පන්නො අණුමත්තෙසු වජ්ජෙසු භයදස්සාවී සමාදාය සික්ඛසි{1} සික්ඛාපදෙසු. යතො ඛො ත්වං භික්ඛු, පාතිමොක්ඛසංවරසංවුතො විහරිස්සසි ආචාරගොචරසම්පන්නො අණුමත්තෙසු වජ්ජෙසු භයදස්සාවී සමාදාය සික්ඛිසි සික්ඛාපදෙසු, තතො ත්වං භික්ඛු සීලං නිස්සාය සීලෙ පතිට්ඨාය චත්තාරො සතිපට්ඨානෙ භාවෙය්යාසි. කතමෙ චත්තාරො: ඉධ ත්වං භික්ඛු, කායෙ කායානුපස්සී විහරාහි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරාහි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. යතො ඛො ත්වං භික්ඛු, සීලං නිස්සාය සීලෙ පතිට්ඨාය ඉමෙ චත්තාරො සතිපට්ඨානෙ එවං භාවෙස්සසි, තතො තුය්හං භික්ඛු, යා රත්ති වා දිවසො වා ආගමිස්සති වුද්ධියෙව පාටිකඞ්ඛා කුසලෙසු ධම්මෙසු. නො පරිහානීති. අථ ඛො සො භික්ඛු භගවතො භාසිතං -පෙ- අඤ්ඤතරො ච පන සො භික්ඛු අරහතං අහොසීති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 5. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුච්චරිතසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1225. අථ ඛො අඤ්ඤතරො භික්ඛු යෙන භගවා තෙනුපසඞ්කමි -පෙ- එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච: “සාධු මෙ භන්තෙ, භගවා සඞ්ඛිත්තෙන ධම්මං දෙසෙතු, යමහං භගවතො ධම්මං සුත්වා එකො වූපකට්ඨො අප්පමත්තො ආතාපී පහිතත්තො විහරෙය්යන්ති.”"
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්මාතිහ ත්වං භික්ඛු, ආදිමෙව විසොධෙහි කුසලෙසු ධම්මෙසු: කො ච ආදි කුසලානං ධම්මානං. ඉධ ත්වං භික්ඛු, කායදුච්චරිතං පහාය කායසුචරිතං භාවෙස්සසි. වචීදුච්චරිතං පහාය වචීසුචරිතං භාවෙස්සසි. මනොදුච්චරිතං පහාය මනොසුචරිතං භාවෙස්සසි. යතො ඛො ත්වං භික්ඛු, කායදුච්චරිතං පහාය කායසුචරිතං භාවෙස්සසි, වචීදුච්චරිතං පහාය වචීසුචරිතං භාවෙස්සසි, මනොදුච්චරිතං පහාය මනොසුචරිතං භාවෙස්සසි, තතො ත්වං භික්ඛු, සීලං නිස්සාය සීලෙ පතිට්ඨාය චත්තාරො සතිපට්ඨානෙ භාවෙය්යාසි. කතමෙ චත්තාරො: ඉධ ත්වං භික්ඛු, කායෙ කායානුපස්සී විහරාහි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරාහි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. යතො ඛො ත්වං භික්ඛු, සීලං නිස්සාය සීලෙ පතිට්ඨාය ඉමෙ චත්තාරො සතිපට්ඨානෙ එවං භාවෙස්සසි, තතො තුය්හං භික්ඛු, යා රත්ති වා දිවසො වා ආගමිස්සති වුද්ධි යෙව පාටිකඞ්ඛා කුසලෙසු ධම්මෙසු නො පරිහානීති. -පෙ- අඤ්ඤතරො ච පන සො භික්ඛු අරහතං අහොසීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සික්ඛස්සු - මඡසං, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණ, එහෙයින් මෙහි ලා තෙපි කුසල්දහම්හි මුල ම පිරිසිදු කරවු. කුසල්දහමුන්ගේ මුල කිමෙක් ද යත්: මහණ තෙපි මෙහි ප්‍රාතිමෝක්‍ෂසංවරයෙන් සංවෘත ව ආචාරගෝචරසම්පන්න ව අණුමාත්‍ර වූ ද වරදෙහි බිය දක්නාසුලු ව වෙසෙවු. සිඛපදෙහි සමාදන් ව හික්මෙවු. මහණ, යම්කලෙක තෙපි ප්‍රාතිමෝක්‍ෂසංවරයෙන් සංවෘත ව ආචාරගෝචරසම්පන්න ව අණුමාත්‍ර වූ ද වරදෙහි බිය දක්නාසුලු ව වෙසෙන්නහු නම් සිඛපදෙහි සමාදන් ව හික්මෙවු නම් මහණ, එකල තෙපි සීලය නිසා සීලයෙහි පිහිටා සිවුසීවටන් වඩාන්නහු. කවර සිවුසීවටන් හු ද යත්: මහණ, මෙහි තෙපි කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙවු. විඳුම්හි ... සිත්හි … දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇතිව දහම් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙවු. මහණ, යම් කලෙක තෙපි සීලය නිසා සීලයෙහි පිහිටා මේ සිවුසීවටන් මෙසේ වඩන්නහු නම් මහණ, එකල තොපට යම් රැයෙක් හෝ දවාලෙක් හෝ පැමිණේ ද, කුසල්දහම්හි වැඩීම ම කැමති විය යුතු. පිරිහීම නොකැමති විය යුතු. එකල්හි ඒ මහණ භාග්‍යවතුන් වහන්සේ ගේ දේශනාව ... ඒ මහණ රහතුන් අතුරෙන් එක්තරා කෙනෙක්ද වූහ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 5. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුච්චරිත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1225. එකල්හි එක්තරා මහණෙක් භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය ... එකත්පසෙක හුන් ඒ මහණ භාග්‍යවතුන් වහන්සේට මෙය සැලකළේය: “වහන්ස, මම භාග්‍යවතුන් වහන්සේගේ යම් දහමක් අසා එකලා ව ගණයා කෙරෙන් වෙන් වූයෙම් නො පමා ව කෙලෙස් තවන වැර ඇතියෙම් කාදිවිදෙක්හි නිරපේක්‍ෂකයෙම් වෙසෙන්නෙම් නම් භාග්‍යවතුන් වහන්සේ (එබඳු) දහමක් සැකෙවින් මට දේශනා කරන සේක් නම් මැනැවි” යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණ, එසේ නම් තෙපි මෙහිලා කුසල්දම්හි මුල ම පිරිසිදු කරවු. කුසල්දහමුන්ගේ මුල කිමෙක් ද යත්: මහණ මෙහි තෙපි කාය දුශ්චරිතය හැර කායසුචරිතය වඩන්නහු වාග්දුශ්චරිතය හැර වාක්සුචරිතය වඩන්නහු. මනෝ දුශ්චරිතය හැර මනඃසුචරිතය වඩාන්නහු. මහණ, තෙපි යම් කලෙක කායදුශ්චරිතය හැර කායසුචරිතය වඩන්නහු නම් වාග්දුශ්චරිතය හැර වාක්සුචරිතය වඩන්නහු නම් මනෝදුශ්චරිතය හැර මනඃසුචරිතය වඩාන්නහු නම් මහණ, එකල්හි තෙපි සීලය නිසා සීලයෙහි පිහිටා සිවුසීවටන් වඩන්නහු. කවර සිවුසීවටන්හු ද යත්: මහණ, මෙහි තෙපි කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇතිව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙවු. විඳුම්හි ... සිත්හි … දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙවු. මහණ, තෙපි යම් කලෙක සීලය නිසා සීලයෙහි පිහිටා මේ සිවුසීවටන් මෙසේ වඩන්නහු ද; මහණ, එකල්හි තොපට යම් රැයෙක් හෝ දවාලෙක් හෝ පැමිණෙන්නේ නම් කුසල්දහම්හි පිරිහීමෙක් නොව වැඩීමෙක්ම කැමති විය යුතුයි ... ඒ මහණ ද රහතුන් අතුරෙන් එක්තරා කෙනෙක් වූහ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 338,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 5. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මිත්තසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1226. යෙ භික්ඛවෙ, අනුකම්පෙය්යාථ, යෙ ච සොතබ්බං මඤ්ඤෙය්යුං, මිත්තා වා අමච්චා වා ඤාතී වා සාලොහිතා වා, තෙ වො භික්ඛවෙ, චතුන්නං සතිපට්ඨානානං භාවනාය සමාදපෙතබ්බා, නිවෙසෙතබ්බා, පතිට්ඨාපෙතබ්බා. කතමෙසං චතුන්නං: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. යෙ භික්ඛවෙ, අනුකම්පෙය්යාථ, යෙ ච සොතබ්බං මඤ්ඤෙය්යුං, මිත්තා වා අමච්චා වා ඤාතී වා සාලොහිතා වා තෙ වො භික්ඛවෙ, ඉමෙසං චතුන්නං සතිපට්ඨානානං භාවනාය සමාදපෙතබ්බා, නිවෙසෙතබ්බා, පතිට්ඨාපෙතබ්බාති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 5. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "වෙදනාසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1227. තිස්සො ඉමා භික්ඛවෙ, වෙදනා. කතමා තිස්සො: සුඛා වෙදනා, දුක්ඛා වෙදනා, අදුක්ඛමසුඛා වෙදනා. ඉමා ඛො භික්ඛවෙ, තිස්සො වෙදනා. ඉමාසං ඛො භික්ඛවෙ, තිස්සන්නං වෙදනානං පරිඤ්ඤාය චත්තාරො සතිපට්ඨානා භාවෙතබ්බා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී -පෙ- වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමාසං ඛො භික්ඛවෙ, තිස්සන්නං වෙදනානං පරිඤ්ඤාය ඉමෙ චත්තාරො සතිපට්ඨානා භාවෙතබ්බාති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 5. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආසවසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1228. තයො’මෙ භික්ඛවෙ ආසවා. කතමෙ තයො: කාමාසවො, භවාසවො, අවිජ්ජාසවො. ඉමෙ ඛො භික්ඛවෙ, තයො ආසවා. ඉමෙසං ඛො භික්ඛවෙ, තිණ්ණන්නං ආසවානං පහානාය චත්තාරො සතිපට්ඨානා භාවෙතබ්බා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙසං ඛො භික්ඛවෙ, තිණ්ණන්නං ආසවානං පහානාය ඉමෙ චත්තාරො සතිපට්ඨානා භාවෙතබ්බාති."
                    },
                    {
                        "type": "centered",
                        "text": "අමතවග්ගො පඤ්චමො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "අමතං සමුදයො මග්ගො සතො කුසලරාසි ච,\nපාතිමොක්ඛං දුච්චරිතං මිත්තො වෙදනා’සවෙනාති.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 5. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "මිත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1226. මහණෙනි, මිතුරු වූ හෝ ඇමති (යහළු) වූ හෝ නෑ වූ හෝ සහලේ නෑ වූ හෝ යම් කෙනෙකුන්ට අනුකම්පා කරන්නහු නම් යම් කෙනෙක් ඇහුම්කන් දිය යුතු කොට හඟනාහු නම් මහණෙනි, තොප විසින් ඔහු සිවුසීවටන් වැඩීමෙහි සමාදන් කරවිය යුතු හ. වැස් විය යුතු හ. පිහිටු විය යුතු හ. කවර සිවුසීවටන් ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනු ව දක්නාසුලුව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. විඳුම්හි ... සිත්හි … දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. මහණෙනි, මිතුරු වූ හෝ ඇමති වූ හෝ සහලේ නෑ වූ හෝ යම් කෙනකුන්ට අනුකම්පා කරන්නහු නම් යම් කෙනකුත් ඇහුම්කන් දිය යුතු කොට හඟනාහු නම් මහණෙනි, තොප විසින් ඔහු සිවුසීවටන් වැඩීමෙහි සමාදන් කරවිය යුතුහ. වැස්විය යුතුහ. පිහිටු විය යුතුහ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 5. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "වේදනා සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1227. මහණෙනි, මේ වේදනා තුනෙකි. කවර තුනෙක් ද යත්: සුවවේදනා ය, දුක්වේදනා ය, නොදුක්නොසුවවේදනා යි. මහණෙනි, මොහු තුන්වේදනාවෝයි. මහණෙනි, මේ තුන්වේදනාවන් පිරිසිඳ දැනීම පිණිස සිවුසීවටන් වැඩිය යුතු. කවර සිවුසීවටන්හුද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනු ව දක්නාසුලු ව ... විඳුම්හි ... සිත්හි ... දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. මහණෙනි, මෙ තුන්වේදනාවන් පිරිසිඳ දැනීම පිණිස සිවුසීවටන්හු වැඩිය යුතුහ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 5. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආසව සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1228. මහණෙනි, මේ ආස්‍රව තුනෙකි. කවර තුනෙක් ද යත්: කාමාස්‍රවය, භවාස්‍රවය, අවිද්‍යාස්‍රවය යි. මහණෙනි, මේ ආස්‍රව තුන යි. මහණෙනි, මේ ආස්‍රව තුන පැහීම පිණිස සතිපට්ඨාන සතර වැඩිය යුතු. කවර සතරෙක් ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. විඳුම්හි ... සිත්හි … දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. මහණෙනි, මෙ ආස්‍රව තුන පැහීම පිණිස මේ සතිපට්ඨාන සතර වැඩිය යුතු යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පස්වැනි අමත වර්‍ග යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි සූත්‍රනාමාවලිය:**",
                        "type": "unindented"
                    },
                    {
                        "text": "අමත, සමුදය, මග්ග, සතෝ, කුසලරාසි, පාතිමොක්ඛ, දුච්චරිත, මිත්ත, වේදනා, ආසව යී දශසූත්‍රාන්තකෙනෙකි යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 340,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "6. ගඞ්ගාපෙය්යාලවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 6. 1-48",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ගඞ්ගාදිසුත්තානි",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1229-1276. සෙය්යථාපි භික්ඛවෙ, ගඞ්ගා නදී පාචීනනින්නා පාචීනපොණා පාචීනපබ්භාරා -පෙ- නිබ්බානපබ්භාරොති. (ගඞ්ගාපෙය්යාලං සතිපට්ඨානවසෙන විත්ථාරෙතබ්බං)"
                    },
                    {
                        "type": "centered",
                        "text": "ගඞ්ගාපෙය්යාලවග්ගො ඡට්ඨො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රුද්දානං:**"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඡ පාචීනතො නින්නා ඡ ච නින්නා සමුද්දතො,"
                    },
                    {
                        "type": "paragraph",
                        "text": "එතෙ ද්වෙ ද්වාදස හොන්ති වග්ගො තෙන පවුච්චතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "(විවෙකනිස්සිතාදිවසෙන රාගවිනයපරියොසානාදිවසෙන අමතොගධාදිවසෙන නිබ්බානනින්නාදිවසෙන ච එකෙකස්මිං චත්තාරො චත්තාරො කත්වා අට්ඨචත්තාලීසසුත්තන්තා විත්ථාරෙතබ්බා.)"
                    },
                    {
                        "type": "heading",
                        "text": "7. අප්පමාදවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 7. 1-40",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තථාගතාදි සුත්තානි",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1277-1316. යාවතා භික්ඛවෙ, සත්තා අපදා වා ද්විපදා වා චතුප්පදා වා බහුප්පදා වා -පෙ- බහුලීකරොතීති. (අප්පමාදවග්ගො සතිපට්ඨානවසෙන විත්ථාරෙතබ්බො.)"
                    },
                    {
                        "type": "centered",
                        "text": "අප්පමාදවග්ගො සත්තමො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "තථාගතං පදං කූටං මූලං සාරෙන වස්සිකං,\nරාජා චන්දිමසූරියා ච වත්ථෙන දසමං පදන්ති.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "(අත්රාපි එකෙකස්මිං චත්තාරො චත්තාරො කත්වා චත්තාලීසසුත්තන්තා විත්ථාරෙතබ්බා.)"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "6. ගඞ්ගාපෙය්‍යාල වර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 6. 1-48",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ගඞ්ගාදි සූත්‍ර",
                        "level": 1
                    },
                    {
                        "text": "1229-1276. මහණෙනි, යම්සේ ගඞ්ගානදිය පෙරදිගට නැමුනී පෙරදිගට නැඹුරු වූවා පෙරදිගට බර වූවා වේ ද ... නිවනට බර වූයේ වේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "(ගඞ්ගාපෙය්‍යාලවර්‍ගය සතිපට්ඨාන වශයෙන් විස්තර කට යුතු)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**සවැනි ගඞ්ගාපෙය්‍යාලවර්‍ගය යි.**",
                        "type": "unindented"
                    },
                    {
                        "text": "එහි සූත්‍රනාමාවලිය:",
                        "type": "paragraph"
                    },
                    {
                        "text": "පාචීනනින්නසූත්‍ර චතුෂ්ක සයෙකි. සමුද්දනින්නසූත්‍ර චතුෂ්ක සයෙකි. මේ දෙකොටස දොළොස් චතුෂ්කයෙක් වේ. එයින් වර්‍ගය යි කියනු ලැබේ. (සූත්‍ර මුළුල්ල අටසාලිසෙකි).",
                        "type": "paragraph"
                    },
                    {
                        "text": "(විවෙක නිස්සිතාදි වශයෙන් ද රාගවිනයපරියොසානාදි වශයෙන් ද අමතෝගධාදිවශයෙන් ද නිබ්බානනින්නාදි වශයෙන් ද එකෙක සතරක් සතරක් කොට අටසාලිස් සුත්‍රාන්තයෝ විතර කට යුතු වෙත්.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "7. අප්පමාද වර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 7. 1-40",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තථාගතාදි සූත්‍ර",
                        "level": 1
                    },
                    {
                        "text": "1277-1316. මහණෙනි, අපා වූ ද දෙපා වූ ද සිවුපා වූ ද බහුපා වූ ද යම්තාක් සත්ත්‍වයෝ වෙද්ද ... බහුල කෙරේ යි. (අප්පමාදවර්‍ගය සීවටන් විසින් විතර කට යුතු)",
                        "type": "paragraph"
                    },
                    {
                        "text": "**සත්වැනි අප්පමාදවර්‍ගය යි.**",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි සූත්‍රනාමාවලිය:**",
                        "type": "unindented"
                    },
                    {
                        "text": "තථාගත, පද, කූට, මූල, සාර, වස්සික, රාජ, චන්‍දිම, සුරිය, වත්‍ථ යී චතුෂ්ක දශයෙ කි. මුළුල්ල සාලිසෙකි යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "(මෙහි ද එකෙක සතරක් සතරක් කොට සමසාලිස්සූත්‍රාන්තයෝ විතර කට යුතුහ).",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 342,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "8. බලකරණීයවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 8. 1-48",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බලාදිසුත්තානි",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1317-1364. සෙය්යථාපි භික්ඛවෙ, යෙ කෙචි බලකරණීයා කම්මන්තා කයිරන්ති -පෙ- බහුලීකරොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "(බලකරණීයවග්ගො සතිපට්ඨානවසෙන විත්ථාරෙතබ්බො.)"
                    },
                    {
                        "type": "centered",
                        "text": "බලකරණීයවග්ගො අට්ඨමො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "බලං බීජඤ්ච නාගො ච රුක්ඛං කුම්භෙන සූකිනං,\nආකාසෙන ද්වෙ මෙඝා නාවා ආගන්තුකා නදීති.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "(අත්ර ච එකස්මිං චත්තාරො චත්තාරො කත්වා අට්ඨචත්තාලීසසුත්තන්තා විත්ථාරෙතබ්බා.)"
                    },
                    {
                        "type": "heading",
                        "text": "9. එසනාවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 9. 1-160",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "එසනාදිසුත්තානි",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1365-1524. තිස්සො ඉමා භික්ඛවෙ, එසනා. කතමා තිස්සො: කාමෙසනා, භවෙසනා, බ්රහ්මචරියෙසනා. -පෙ- භාවෙතබ්බොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "(එසනාවග්ගො සතිපට්ඨානවසෙන විත්ථාරෙතබ්බො.)"
                    },
                    {
                        "type": "centered",
                        "text": "එසනාවග්ගො නවමො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "එසනා විධා ආසවො භවො දුක්ඛතා ච තිස්සො,\nඛිලං මලඤ්ච නීඝො ච වෙදනාතණ්හාහි චාති.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "(වුත්තනයෙන ච තානි අභිඤ්ඤාය පරිඤ්ඤාය පරික්ඛයාය පහානායාති චතුධා විභජන්තෙන ච එකෙකස්මිං සොළස සොළස කත්වා එකසතසට්ඨි සුත්තන්තා විත්ථාරෙතබ්බා.)"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "8. බලකරණීය වර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3.8.1-48",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බලාදි සූත්‍ර",
                        "level": 1
                    },
                    {
                        "text": "1317-1364. මහණෙනි, යම්සේ යම්කිසි බලකරණියකර්‍මාන්තයෝ කරනු ලැබෙද්ද ... බහුල කෙරේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "(බලකරණියවර්‍ගය ද සීවටන් විසින් විතර කට යුතු)",
                        "type": "paragraph"
                    },
                    {
                        "text": "අටවැනි බලකරණියවර්‍ගය යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි සූත්‍රනාමාවලිය:**",
                        "type": "unindented"
                    },
                    {
                        "text": "බල, බීජ, නාග, රුක්ඛ, කුම්භ, සූක, ආකාස, යන චතුෂ්ක සත ද මේඝචතුෂ්ක දෙක ද නාවා, ආගන්තුක, නදී, චතුෂ්ක තුන දැ යි මුළුල්ල දොළොසෙකි. සූත්‍ර අටසාලිසෙකි යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "(මෙහි දු එකෙක සතරක් සතරක් කොට අටසාලිස් සූත්‍රාන්තයෝ විතර කට යුතුහ.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "9. ඒසනා වර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 9. 1-160",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඒසනාදි සූත්‍ර",
                        "level": 1
                    },
                    {
                        "text": "1365-1524. මහණෙනි, මේ ඒසනා තුනෙ කි. කවර තුනෙක් ද යත්: කාමේසනා, භවේසනා, බ්‍රහ්මචරියේසනා යි ... වැඩිය යුත්තේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "(ඒසනාවර්‍ගය ද, සීවටන් විසින් විතර කට යුතු)",
                        "type": "paragraph"
                    },
                    {
                        "text": "නවවැනි ඒසනාවර්‍ගය යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි සූත්‍රනාමාවලිය:**",
                        "type": "unindented"
                    },
                    {
                        "text": "ඒසනා විධා ආසව භව දුක්ඛතා ඛීල මල නීඝ වේදනා තණ්හා යි ෂෝඩශක දශයෙ කි. සූත්‍ර මුළුල්ල එක්සිය සැටෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "(කියන ලද සිවුනයින් ද, නැවත ඔවුන් අභිඤ්ඤා ය පරිඤ්ඤා ය පරික්ඛයාය පහානාය යි සිවුනයින් ද බෙදන්නහු විසින් එකෙක සෝළස සෝළස කොට එක්සියසැට සූත්‍රාන්තයෝ විතර කට යුතු හ.)",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 344,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "10. ඔඝවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 10. 1-159",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඔඝාදිසුත්තානි",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1525-1683. චත්තාරො මෙ භික්ඛවෙ ඔඝා. කතමෙ චත්තාරො: කාමොඝො, භවොඝො, දිට්ඨොඝො, අවිජ්ජොඝො. ඉමෙ ඛො භික්ඛවෙ, චත්තාරො ඔඝා. ඉමෙසං ඛො භික්ඛවෙ, චතුන්නං ඔඝානං අභිඤ්ඤාය චත්තාරො සතිපට්ඨානා භාවෙතබ්බා. කතමෙ චත්තාරො: -පෙ- භාවෙතබ්බොති."
                    },
                    {
                        "type": "centered",
                        "text": "3. 10. 160",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උද්ධම්භාගියසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1684. පඤ්චිමානි භික්ඛවෙ, උද්ධම්භාගියානි සංයොජනානි. කතමානි පඤ්ච: රූපරාගො, අරූපරාගො, මානො, උද්ධච්චං, අවිජ්ජා. ඉමානි ඛො භික්ඛවෙ, පඤ්චුද්ධම්භාගියානි සංයොජනානි. ඉමෙසං ඛො භික්ඛවෙ, පඤ්චන්නං උද්ධම්භාගියානං සංයොජනානං පහානාය චත්තාරො සතිපට්ඨානා භාවෙතබ්බා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙසං ඛො භික්ඛවෙ, පඤ්චන්නං උද්ධම්භාගියානං සංයොජනානං පහානාය ඉමෙ චත්තාරො සතිපට්ඨානා භාවෙතබ්බාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "(ඔඝවග්ගො සතිපට්ඨානවසෙන විත්ථාරෙතබ්බො)"
                    },
                    {
                        "type": "centered",
                        "text": "ඔඝවග්ගො දසමො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "ඔඝො යොගො උපාදානං ගන්ථං අනුසයෙන ච,\nකාමගුණා නීවරණා ඛන්ධා ඔරුද්ධම්භාගියාති.\n(අත්රා’පි යථා එසනාවග්ගො එකසතසට්ඨි සුත්තන්තා විත්ථාරෙතබ්බා.)",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "සතිපට්ඨානසංයුත්තං සමත්තං.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්ර වග්ගුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "අම්බපාලි ච නාලන්දො සීලට්ඨිත්යානනුස්සුතා\nඅමතො ගඞ්ගාප්පමාදා බලකරණීයෙසනොඝාති.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "10. ඕඝ වර්‍ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "3. 10. 1-159",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඕඝාදි සූත්‍ර",
                        "level": 1
                    },
                    {
                        "text": "1525-1683. මහණෙනි, මේ ඕඝ සතරෙකි. කවර සතරෙක් ද යත්: කාමෝඝ භවොඝ දිට්ඨොඝ අවිජ්ජොඝ යි. මහණෙනි, මේ ඕඝසතර යි. මහණෙනි, මේ චතුරෝඝයන් වෙසෙසින් දැනීම පිණිස සිවුසීවටන් වැඩිය යුතු. කවර සතරෙක් ද යත්: ... වැඩිය යුත්තේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "3. 10. 160",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "උද්ධම්භාගිය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "1684. මහණෙනි, මේ උද්ධම්භාගියසංයෝජන පසෙකි. කවර පසෙක් ද යත්: රූපරාග අරූපරාග මාන උද්ධච්ච අවිජ්ජා යි. මහණෙනි, මේ උද්ධම්භාගිය සංයෝජන පස යි. මහණෙනි, මේ උද්ධම්භාගිය සංයෝජන පස පැහීම පිණිස සිවුසීවටන් වැඩිය යුතු. කවර සිවුසීවටන්හු ද යත්: මහණෙනි, මෙහි මහණ කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. විඳුම්හි ... සිත්හි ... දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. මහණෙනි, මේ උද්ධම්භාගියසංයෝජන පස පැහීම පිණිස මේ සිවුසීවටන්හු වැඩිය යුතුහ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "(ඕඝ වර්‍ගය ද, සීවටන් විසින් විතර කට යුතු)",
                        "type": "paragraph"
                    },
                    {
                        "text": "දශවැනි ඕඝවර්‍ග යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි සූත්‍රනාමාවලිය:**",
                        "type": "unindented"
                    },
                    {
                        "text": "ඕඝ, යෝග, උපාදාන, ගන්‍ථ, අනුසය, කාමගුණ, නීවරණ, ඛන්‍ධ, ඕරම්භාගිය, උද්ධම්භාගිය යී ෂෝඩශක දශයෙකි. (සූත්‍ර එක්සියසැටෙකි) යි.\n(මෙහි දු එසනාවර්‍ගයෙහි මෙන් එක්සියසැටසූත්‍රාන්තයෝ විතර කට යුතුහ.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "සතිපට්ඨානසංයුත්තය නිමියේ යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි වර්‍ගනාමාවලිය:**",
                        "type": "unindented"
                    },
                    {
                        "text": "අම්බපාලි, නාලන්‍ද, සීලට්ඨිති, අනනුස්සුත, අමත, ගඞ්ගාපෙය්‍යාල, අප්පමාද, බලකරණිය, ඒසනා, ඕඝ යි (සතිපට්ඨානසංයුත්තයෙහි වර්‍ග දශයෙකි යි.)",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        }
    ]
}