[
    {
        "filename": "sn-mhv-8",
        "bookId": 21,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "62"
            },
            {
                "type": "heading",
                "text": "8. අනුරුද්ධසංයුත්තං",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. රහොගතවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "8. 1. 1",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "රහොගතසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3611. එකං සමයං ආයස්මා අනුරුද්ධො සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. අථ ඛො ආයස්මතො අනුරුද්ධස්ස රහොගතස්ස පතිසල්ලීනස්ස එවං චෙතසො පරිවිතක්කො උදපාදි: “යෙසං කෙසඤ්චි චත්තාරො සතිපට්ඨානා විරද්ධා, විරද්ධො තෙසං අරියො මග්ගො සම්මා දුක්ඛක්ඛයගාමී. යෙසං කෙසඤ්චි චත්තාරො සතිපට්ඨානා ආරද්ධා, ආරද්ධො තෙසං අරියො මග්ගො සම්මාදුක්ඛක්ඛයගාමී”ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා මහාමොග්ගල්ලානො ආයස්මතො අනුරුද්ධස්ස චෙතසා චෙතොපරිවිතක්කමඤ්ඤාය, සෙය්යථාපි නාම බලවා පුරිසො සමිඤ්ජිතං වා බාහං පසාරෙය්ය, පසාරිතං වා බාහං සම්මිඤ්ජෙය්ය, එවමෙවං ආයස්මතො අනුරුද්ධස්ස පමුඛෙ පාතුරහොසි. අථ ඛො ආයස්මා මහාමොග්ගල්ලානො ආයස්මන්තං අනුරුද්ධං එතදවොච: “කිත්තාවතා නුඛො, ආවුසො අනුරුද්ධ, භික්ඛුනො චත්තාරො සතිපට්ඨානා ආරද්ධා හොන්තී”ති? ඉධාවුසො භික්ඛු අජ්ඣත්තං කායෙ සමුදයධම්මානුපස්සී විහරති, ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. අජ්ඣත්තං කායෙ වයධම්මානුපස්සී විහරති, -පෙ- අජ්ඣත්තං කායෙ සමුදයවයධම්මානුපස්සී විහරති, ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. බහිද්ධා කායෙ සමුදයධම්මානුපස්සී විහරති -පෙ- බහිද්ධා කායෙ වයධම්මානුපස්සී විහරති -පෙ- බහිද්ධා කායෙ සමුදයවයධම්මානුපස්සී විහරති, ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. අජ්ඣත්තබහිද්ධා කායෙ සමුදයධම්මානුපස්සී විහරති -පෙ- අජ්ඣත්තබහිද්ධා කායෙ වයධම්මානුපස්සී විහරති -පෙ- අජ්ඣත්තබහිද්ධා කායෙ සමුදයවයධම්මානුපස්සී විහරති, ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං."
            },
            {
                "type": "page-break",
                "text": "64"
            },
            {
                "type": "paragraph",
                "text": "සො සචෙ ආකඞ්ඛති අප්පටික්කූලෙ පටික්කූල{1 අප්පටිකූලෙ පටිකූල - මඡසං, ස්යා.}සඤ්ඤී විහරෙය්යන්ති, පටික්කූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති පටික්කූලෙ අප්පටික්කූලසඤ්ඤී විහරෙය්යන්ති, අප්පටික්කූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති අප්පටික්කූලෙ ච පටික්කූලෙ ච පටික්කූලසඤ්ඤී විහරෙය්යන්ති, පටික්කූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති පටික්කූලෙ ච අප්පටික්කූලෙ ච අප්පටික්කූලසඤ්ඤී විහරෙය්යන්ති, අප්පටික්කූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති අප්පටික්කූලඤ්ච පටික්කූලඤ්ච තදුභයං අභිනිවජ්ජෙත්වා උපෙඛකො විහරෙය්යං සතො සම්පජානොති, උපෙඛකො තත්ථ විහරති සතො සම්පජානො."
            },
            {
                "type": "paragraph",
                "text": "අජ්ඣත්තං වෙදනාසු සමුදයධම්මානුපස්සී විහරති. -පෙ- අජ්ඣත්තං වෙදනාසු වයධම්මානුපස්සී විහරති. -පෙ- අජ්ඣත්තං වෙදනාසු සමුදයවයධම්මානුපස්සී විහරති -පෙ- බහිද්ධා වෙදනාසු සමුදයධම්මානුපස්සී විහරති -පෙ- බහිද්ධා වෙදනාසු වයධම්මානුපස්සී විහරති -පෙ- බහිද්ධා වෙදනාසු සමුදයවයධම්මානුපස්සී විහරති. -පෙ- අජ්ඣත්තබහිද්ධා වෙදනාසු සමුදයධම්මානුපස්සී විහරති -පෙ- අජ්ඣත්තබහිද්ධා වෙදනාසු වයධම්මානුපස්සී විහරති -පෙ-අජ්ඣත්තබහිද්ධා වෙදනාසු සමුදයවයධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. සො සචෙ ආකඞ්ඛති -පෙ- උපෙඛකො තත්ථ විහරති සතො සම්පජානො."
            },
            {
                "type": "paragraph",
                "text": "අජ්ඣත්තං චිත්තෙ සමුදයධම්මානුපස්සී විහරති -පෙ- අජ්ඣත්තං චිත්තෙ වයධම්මානුපස්සී විහරති -පෙ- අජ්ඣත්තං චිත්තෙ සමුදයවයධම්මානුපස්සී විහරති -පෙ- බහිද්ධා චිත්තෙ සමුදයධම්මානුපස්සී විහරති -පෙ- බහිද්ධා චිත්තෙ වයධම්මානුපස්සී විහරති -පෙ- බහිද්ධා චිත්තෙ සමුදයවයධම්මානුපස්සී විහරති -පෙ- අජ්ඣත්තබහිද්ධා චිත්තෙ සමුදයධම්මානුපස්සී විහරති -පෙ- අජ්ඣත්තබහිද්ධා චිත්තෙ සමුදයධම්මානුපස්සී විහරති -පෙ- අජ්ඣත්තබහිද්ධා චිත්තෙ වයධම්මානුපස්සී විහරති -පෙ- අජ්ඣත්තබහිද්ධා චිත්තෙ සමුදයවයධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. සො සචෙ ආකඞ්ඛති -පෙ- උපෙක්ඛකො තත්ථ විහරති සතො සම්පජානො."
            },
            {
                "type": "page-break",
                "text": "66"
            },
            {
                "type": "paragraph",
                "text": "අජ්ඣත්තං ධම්මෙසු සමුදයධම්මානුපස්සී විහරති -පෙ- අජ්ඣත්තං ධම්මෙසු වයධම්මානුපස්සී විහරති -පෙ- අජ්ඣත්තං ධම්මෙසු සමුදයවයධම්මානුපස්සී විහරති -පෙ- බහිද්ධා ධම්මෙසු සමුදයධම්මානුපස්සී විහරති -පෙ- බහිද්ධා ධම්මෙසු වයධම්මානුපස්සී විහරති -පෙ- බහිද්ධා ධම්මෙසු සමුදයවයධම්මානුපස්සී විහරති -පෙ- අජ්ඣත්තබහිද්ධා ධම්මෙසු සමුදයධම්මානුපස්සී විහරති -පෙ- අජ්ඣත්තබහිද්ධා ධම්මෙසු සමුදයධම්මානුපස්සී විහරති -පෙ- අජ්ඣත්තබහිද්ධා ධම්මෙසු වයධම්මානුපස්සී විහරති -පෙ- අජ්ඣත්තබහිද්ධා ධම්මෙසු සමුදයවයධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං."
            },
            {
                "type": "paragraph",
                "text": "සො සචෙ ආකඞ්ඛති අප්පටික්කූලෙ පටික්කූලසඤ්ඤී විහරෙය්යන්ති පටික්කූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති පටික්කූලෙ අප්පටික්කූලසඤ්ඤී විහරෙය්යන්ති අප්පටික්කූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති අප්පටික්කූලෙ ච පටික්කූලෙ ච පටික්කූලසඤ්ඤී විහරෙය්යන්ති පටික්කූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති පටික්කූලෙ ච අප්පටික්කූලෙ ච අප්පටික්කූලසඤ්ඤී විහරෙය්යන්ති අප්පටික්කූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති අප්පටික්කූලඤ්ච පටික්කූලඤ්ච තදුභයං අභිනිවජ්ජෙත්වා උපෙඛකො විහරෙය්යං සතො සම්පජානොති, උපෙඛකො තත්ථ විහරති සතො සම්පජානො. එත්තාවතා ඛො ආවුසො භික්ඛුනො චත්තාරො සතිපට්ඨානා ආරද්ධා හොන්තීති."
            },
            {
                "type": "centered",
                "text": "8. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය රහොගතසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3612. එකං සමයං ආයස්මා අනුරුද්ධො සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. අථ ඛො ආයස්මතො අනුරුද්ධස්ස රහොගතස්ස පටිසල්ලීනස්ස එවං චෙතසො පරිවිතක්කො උදපාදි: “යෙසං කෙසඤ්චි චත්තාරො සතිපට්ඨානා විරද්ධා, විරද්ධො තෙසං අරියො මග්ගො සම්මාදුක්ඛක්ඛයගාමී. යෙසං කෙසඤ්චි චත්තාරො සතිපට්ඨානා ආරද්ධා, ආරද්ධො තෙසං අරියො මග්ගො සම්මා දුක්ඛක්ඛයගාමී”ති. අථ ඛො ආයස්මා මහාමොග්ගල්ලානො ආයස්මතො අනුරුද්ධස්ස චෙතසා චෙතො පරිවිතක්කමඤ්ඤාය සෙය්යථාපි නාම බලවා පුරිසො -පෙ- එවමෙවං ආයස්මතො අනුරුද්ධස්ස සම්මුඛෙ පාතුරහොසි. අථ ඛො ආයස්මා මහාමොග්ගල්ලානො ආයස්මන්තං අනුරුද්ධං එතදවොච: “කිත්තාවතා නුඛො ආවුසො අනුරුද්ධ, භික්ඛුනො චත්තාරො සතිපට්ඨානා ආරද්ධා හොන්තී”ති."
            },
            {
                "type": "page-break",
                "text": "68"
            },
            {
                "type": "paragraph",
                "text": "ඉධාවුසො භික්ඛු අජ්ඣත්තං කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. බහිද්ධා කායෙ කායානුපස්සී විහරති ආතාපී -පෙ-අජ්ඣත්තබහිද්ධා කායෙ කායානුපස්සී විහරති ආතාපී -පෙ- අජ්ඣත්තං වෙදනාසු -පෙ- බහිද්ධා වෙදනාසු -පෙ- අජ්ඣත්තබහිද්ධා වෙදනාසු -පෙ- අජ්ඣත්තං චිත්තෙ -පෙ- බහිද්ධා චිත්තෙ -පෙ-අජ්ඣත්තබහිද්ධා චිත්තෙ -පෙ- අජ්ඣත්තං ධම්මෙසු -පෙ- බහිද්ධා ධම්මෙසු -පෙ-අජ්ඣත්තබහිද්ධා ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. එත්තාවතා ඛො ආවුසො, භික්ඛුනො චත්තාරො සතිපට්ඨානා ආරද්ධා හොන්තීති."
            },
            {
                "type": "centered",
                "text": "8. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුතනුසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3613. එකං සමයං ආයස්මා අනුරුද්ධො සාවත්ථියං විහරති සුතනුතීරෙ. අථ ඛො සම්බහුලා භික්ඛූ යෙනායස්මා අනුරුද්ධො තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා ආයස්මතා අනුරුද්ධෙන සද්ධිං සම්මොදිංසු. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නා ඛො තෙ භික්ඛූ ආයස්මන්තං අනුරුද්ධං එතදවොචුං: ‘කතමෙසං ආයස්මා අනුරුද්ධො ධම්මානං භාවිතත්තා බහුලීකතත්තා මහාභිඤ්ඤතං{1 මහාභිඤ්ඤත්තං - ස්යා, අට්ඨකථා.} පත්තො’ති."
            },
            {
                "type": "paragraph",
                "text": "චතුන්නං ඛො අහං ආවුසො, සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා මහාභිඤ්ඤතං පත්තො. කතමෙසං චතුන්නං: ඉධාහං ආවුසො, කායෙ කායානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙසං ඛො අහං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා මහාභිඤ්ඤතං පත්තො. ඉමෙසඤ්ච පනාහං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා හීනං ධම්මං හීනතො අබ්භඤ්ඤාසිං, මජ්ඣිමං ධම්මං මජ්ඣිමතො අබ්භඤ්ඤාසිං, පණීතං ධම්මං පණීතතො අබ්භඤ්ඤාසින්ති."
            },
            {
                "type": "page-break",
                "text": "70"
            },
            {
                "type": "centered",
                "text": "8. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කණ්ටකීසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3614. එකං සමයං ආයස්මා ච අනුරුද්ධො ආයස්මා ච සාරිපුත්තො ආයස්මා ච මහාමොග්ගල්ලානො සාකෙතෙ විහරන්ති කණ්ටකීවනෙ.{1 තිකණ්ටකීවනො- සීමු, සී 1, 2.} අථ ඛො ආයස්මා ච සාරිපුත්තො ආයස්මා ච මහාමොග්ගල්ලානො සායන්හසමයං පටිසල්ලානා වුට්ඨිතා යෙනායස්මා අනුරුද්ධො තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා ආයස්මතා අනුරුද්ධෙන සද්ධිං සම්මොදිංසු. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නො ඛො ආයස්මා සාරිපුත්තො ආයස්මන්තං අනුරුද්ධං එතදවොච: “සෙඛෙන{2 සෙක්ඛෙන - ස්යා.} ආවුසො, අනුරුද්ධ, භික්ඛුනා කතමෙ ධම්මා උපසම්පජ්ජ විහාතබ්බා”ති."
            },
            {
                "type": "paragraph",
                "text": "සෙඛෙන ආවුසො සාරිපුත්ත, භික්ඛුනා චත්තාරො සතිපට්ඨානා උපසම්පජ්ජ විහාතබ්බා. කතමෙ චත්තාරො: ඉධාවුසො භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. සෙඛෙන ආවුසො සාරිපුත්ත, භික්ඛුනා ඉමෙ චත්තාරො සතිපට්ඨානා උපසම්පජ්ජ විහාතබ්බාති."
            },
            {
                "type": "centered",
                "text": "8. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය කණ්ටකීසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3615. අසෙඛෙන ආවුසො අනුරුද්ධ, භික්ඛුනා කතමෙ ධම්මා උපසම්පජ්ජ විහාතබ්බාති. අසෙඛෙන ආවුසො සාරිපුත්ත, භික්ඛුනා චත්තාරො සතිපට්ඨානා උපසම්පජ්ජ විහාතබ්බා. කතමෙ චත්තාරො: ඉධාවුසො භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. අසෙඛෙන ආවුසො සාරිපුත්ත, භික්ඛුනා ඉමෙ චත්තාරො සතිපට්ඨානා උපසම්පජ්ජ විහාතබ්බාති."
            },
            {
                "type": "page-break",
                "text": "72"
            },
            {
                "type": "centered",
                "text": "8. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තතිය කණ්ටකීසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3616. කතමෙසං ආයස්මා අනුරුද්ධො ධම්මානං භාවිතත්තා බහුලීකතත්තා මහාභිඤ්ඤතං පත්තොති? චතුන්නං ඛ්වාහං ආවුසො, සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා මහාභිඤ්ඤතං පත්තො. කතමෙසං චතුන්නං: ඉධාහං ආවුසො, කායෙ කායානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙසං ඛ්වාහං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා මහාභිඤ්ඤතං පත්තො. ඉමෙසඤ්ච පනාහං ආවුසො චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා සහස්සං ලොකං අභිජානාමීති."
            },
            {
                "type": "centered",
                "text": "8. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තණ්හක්ඛයසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3617. එකං සමයං ආයස්මා අනුරුද්ධො සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තත්ර ඛො ආයස්මා අනුරුද්ධො භික්ඛු ආමන්තෙසි -පෙ- චත්තාරොමෙ ආවුසො, සතිපට්ඨානා භාවිතා බහුලීකතා තණ්හක්ඛයාය සංවත්තන්ති. කතමෙ චත්තාරො: ඉධාවුසො, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙ ඛො ආවුසො, චත්තාරො සතිපට්ඨානා භාවිතා බහුලීකතා තණ්හක්ඛයාය සංවත්තන්තීති."
            },
            {
                "type": "centered",
                "text": "8. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සලලාගාරසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3618. එකං සමයං ආයස්මා අනුරුද්ධො සාවත්ථියං විහරති සලලාගාරෙ. තත්ර ඛො ආයස්මා අනුරුද්ධො -පෙ- එතදවොච: සෙය්යථාපි ආවුසො, ගඞ්ගානදී පාචීනනින්නා පාචීනපොණා පාචීනපබ්භාරා. අථ මහාජනකායො ආගච්ඡෙය්ය කුද්දාලපිටකං ආදාය “මයං ඉමං ගඞ්ගානදිං පච්ඡානින්නං කරිස්සාම පච්ඡාපොණං පච්ඡාපබ්භාරන්ති. තං කිං මඤ්ඤථාවුසො, අපි නු සො මහාජනකායො ගඞ්ගානදිං පච්ඡානින්නං කරෙය්ය පච්ඡාපොණං පච්ඡාපබ්භාරන්ති. නො හෙතං ආවුසො. තං කිස්ස හෙතු: ගඞ්ගාවුසො නදී පාචීනනින්නා පාචීනපොණා පාචීනපබ්භාරා. සා න සුකරා පච්ඡානින්නං කාතුං පච්ඡාපොණං පච්ඡාපබ්භාරං. යාවදෙව ච පන සො මහාජනකායො කිලමථස්ස විඝාතස්ස භාගී අස්සාති."
            },
            {
                "type": "page-break",
                "text": "74"
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො ආවුසො, භික්ඛුං චත්තාරො සතිපට්ඨානෙ භාවෙන්තං චත්තාරො සතිපට්ඨානෙ බහුලීකරොන්තං රාජා{1 රාජානො - මඡසං.} වා රාජමහාමත්තො{2 මහාමත්තා - මඡසං.} වා මිත්තා වා අමච්චා වා ඤාතිසාලොහිතා වා භොගෙහි අභිහට්ඨුං පවාරෙය්යුං: “හම්භො පුරිස, කිං තෙ ඉමෙ කාසාවා අනුදහන්ති. කිං මුණ්ඩො කපාලමනුසඤ්චරසි. එහි හීනායාවත්තිත්වා භොගෙ භුඤ්ජස්සු පුඤ්ඤානි ච කරොහී”ති. සො වතාවුසො භික්ඛු චත්තාරො සතිපට්ඨානෙ භාවෙන්තො චත්තාරො සතිපට්ඨානෙ බහුලීකරොන්තො සික්ඛං පච්චක්ඛායහීනායාවත්තිස්සතීති{3 හීනාය සංවත්තිස්සන්ති - සීමු, සී 2.}, නෙතං ඨානං විජ්ජති. තං කිස්ස හෙතු: “යං හි{4 යං හි තං - මඡසං.} ආවුසො චිත්තං දීඝරත්තං විවෙකනින්නං විවෙකපොණං විවෙකපබ්භාරං. තං තථා{5 තං වත - මඡසං.} හීනායාවත්තිස්සතී”ති නෙතං ඨානං විජ්ජති."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්චාවුසො, භික්ඛු චත්තාරො සතිපට්ඨානෙ භාවෙති, චත්තාරො සතිපට්ඨානෙ බහුලීකරොති: ඉධාවුසො, භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. එවං ඛො ආවුසො, භික්ඛු චත්තාරො සතිපට්ඨානෙ භාවෙති, චත්තාරො සතිපට්ඨානෙ බහුලීකරොතීති."
            },
            {
                "type": "centered",
                "text": "8. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අම්බපාලිසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3619. එකං සමයං ආයස්මා ච අනුරුද්ධො ආයස්මා ච සාරිපුත්තො වෙසාලියං විහරන්ති අම්බපාලිවනෙ. අථ ඛො ආයස්මා සාරිපුත්තො සායණ්හසමයං පටිසල්ලානා වුට්ඨිතො යෙනායස්මා අනුරුද්ධො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මතා අනුරුද්ධෙන සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා සාරිපුත්තො ආයස්මන්තං අනුරුද්ධං එතදවොච: “විප්පසන්නානි ඛො තෙ ආවුසො අනුරුද්ධ ඉන්ද්රියානි, පරිසුද්ධො මුඛවණ්ණො පරියොදාතො. කතමෙනායස්මා අනුරුද්ධො විහාරෙන එතරහි බහුලං විහරතී”ති."
            },
            {
                "type": "page-break",
                "text": "76"
            },
            {
                "type": "paragraph",
                "text": "චතූසු ඛ්වාහං ආවුසො සතිපට්ඨානෙසු සුපතිට්ඨිතචිත්තො{1 සුප්පතිට්ඨිතචිත්තො - මඡසං.} එතරහි බහුලං විහරාමි. කතමෙසු චතූසු: ඉධාහං ආවුසො, කායෙ කායානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙසු ඛ්වාහං ආවුසො චතූසු සතිපට්ඨානෙසු සුපතිට්ඨිතචිත්තො එතරහි බහුලං විහරාමි. යො සො ආවුසො භික්ඛු අරහං ඛීණාසවො වුසිතවා කතකරණීයො ඔහිතභාරො අනුප්පත්තසදත්ථො පරික්ඛීණභවසංයොජනො සම්මදඤ්ඤාවිමුත්තො, සො ඉමෙසු චතූසු සතිපට්ඨානෙසු සුපතිට්ඨිතචිත්තො බහුලං විහරතීති. ලාභා වත නො ආවුසො, සුලද්ධං වත නො ආවුසො, යෙ මයං ආයස්මතො අනුරුද්ධස්ස සම්මුඛාව අස්සුම්හ ආසභිං වාචං භාසමානස්සාති."
            },
            {
                "type": "centered",
                "text": "8. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ගිලානසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3620. එකං සමයං ආයස්මා අනුරුද්ධො සාවත්ථියං විහරති අන්ධවනස්මිං ආබාධිකො දුක්ඛිතො බාළ්හගිලානො. අථ ඛො සම්බහුලා භික්ඛූ යෙනායස්මා අනුරුද්ධො තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා ආයස්මන්තං අනුරුද්ධං එතදවොචුං: “කතමෙනායස්මතො අනුරුද්ධස්ස විහාරෙන විහරතො උප්පන්නා සාරීරිකා දුක්ඛා වෙදනා චිත්තං න පරියාදාය තිට්ඨන්තී”ති."
            },
            {
                "type": "paragraph",
                "text": "චතූසු ඛො මෙ ආවුසො, සතිපට්ඨානෙසු සුපතිට්ඨිතචිත්තස්ස විහරතො උප්පන්නා සාරීරිකා දුක්ඛා වෙදනා චිත්තං න පරියාදාය තිට්ඨන්ති. කතමෙසු චතූසු: ඉධාහං ආවුසො, කායෙ කායානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙසු ඛො මෙ ආවුසො, චතූසු සතිපට්ඨානෙසු සුපතිට්ඨිතචිත්තස්ස විහරතො උප්පන්නා සාරීරිකා දුක්ඛා වෙදනා චිත්තං න පරියාදාය තිට්ඨන්තීති."
            },
            {
                "type": "centered",
                "text": "රහොගතවග්ගො පඨමො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "රහොගතෙනෙව දුවෙ සුතනුකණ්ටකී තයො,\nතණ්හක්ඛයසලලාගාරෙ අම්බපාලිගිලානෙහීති."
            },
            {
                "type": "page-break",
                "text": "78"
            },
            {
                "type": "heading",
                "text": "2. සහස්සවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "8. 2. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සහස්සසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3621. එකං සමයං ආයස්මා අනුරුද්ධො සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. අථ ඛො සම්බහුලා භික්ඛූ යෙනායස්මා අනුරුද්ධො තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා ආයස්මතා අනුරුද්ධෙන සද්ධිං සම්මොදිංසු -පෙ- ආයස්මන්තං අනුරුද්ධං එතදවොචුං: “කතමෙසං ආයස්මා අනුරුද්ධො ධම්මානං භාවිතත්තා බහුලීකතත්තා මහාභිඤ්ඤතං පත්තො”ති. චතුන්නං ඛ්වාහං ආවුසො, සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා මහාභිඤ්ඤතං පත්තො. කතමෙසං චතුන්නං: ඉධා‘හං ආවුසො කායෙ කායානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරාමි ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. ඉමෙසං ඛ්වාහං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා මහාභිඤ්ඤතං පත්තො. ඉමෙසඤ්ච පනාහං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා කප්පසහස්සං අනුස්සරාමීති."
            },
            {
                "type": "centered",
                "text": "8. 2. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඉද්ධිවිධසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3622. ඉමෙසඤ්ච පනා‘හං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොමි: “එකොපි හුත්වා බහුධා හොමි, බහුධා‘පි හුත්වා එකො හොමි, ආවිභාවං තිරොභාවං තිරොකුඩ්ඩං තිරොපාකාරං තිරොපබ්බතං අසජ්ජමානො ගච්ඡාමි සෙය්යථාපි ආකාසෙ. පඨවියාපි උම්මුජ්ජනිමුජ්ජං කරොමි සෙය්යථාපි උදකෙ. උදකෙ‘පි අභෙජ්ජමානෙ ගච්ඡාමි සෙය්යථාපි පඨවියං. ආකාසෙ‘පි පල්ලඞ්කෙන කමාමි සෙය්යථාපි පක්ඛී සකුණො. ඉමෙ‘පි චන්දිමසුරියෙ එවම්මහිද්ධිකෙ එවම්මහානුභාවෙ පාණිනා පරාමසාමි පරිමජ්ජාමි. යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙමී”ති."
            },
            {
                "type": "centered",
                "text": "8. 2. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දිබ්බසොතසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3623. ඉමෙසඤ්ච පනා‘හං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා දිබ්බාය සොතධාතුයා විසුද්ධාය අතික්කන්තමානුසිකාය උභො සද්දෙ සුණාමි දිබ්බෙ ච මානුසෙ ච යෙ දූරෙ සන්තිකෙ චාති."
            },
            {
                "type": "page-break",
                "text": "80"
            },
            {
                "type": "centered",
                "text": "8. 2. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "චෙතොපරියසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3624. ඉමෙසඤ්ච පනා‘හං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා පරසත්තානං පරපුග්ගලානං චෙතසා චෙතො පරිච්ච පජානාමි: “සරාගං වා චිත්තං සරාගං චිත්තන්ති පජානාමි. වීතරාගං වා චිත්තං වීතරාගං චිත්තන්ති පජානාමි. -පෙ- අවිමුත්තං වා චිත්තං අවිමුත්තං චිත්තන්ති පජානාමි. විමුත්තං වා චිත්තං විමුත්තං චිත්තන්ති පජානාමි”ති."
            },
            {
                "type": "centered",
                "text": "8. 2. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඨානසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3625. ඉමෙසඤ්ච පනා‘හං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා ඨානඤ්ච ඨානතො අට්ඨානඤ්ච අට්ඨානතො යථාභූතං පජානාමීති."
            },
            {
                "type": "centered",
                "text": "8. 2. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කම්මසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3626. ඉමෙසඤ්ච පනා‘හං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා අතීතානාගතපච්චුප්පන්නානං කම්මසමාදානානං ඨානසො හෙතුසො විපාකං යථාභූතං පජානාමීති."
            },
            {
                "type": "centered",
                "text": "8. 2. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සබ්බත්ථගාමිනිසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3627. ඉමෙසඤ්ච පනා‘හං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා සබ්බත්ථගාමිනිං පටිපදං යථාභූතං පජානාමීති."
            },
            {
                "type": "centered",
                "text": "8. 2. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනෙකධාතුසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3628. ඉමෙසඤ්ච පනා‘හං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා අනෙකධාතුනානාධාතුලොකං යථාභූතං පජානාමීති."
            },
            {
                "type": "centered",
                "text": "8. 2. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නානාධිමුත්තිකසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3629. ඉමෙසඤ්ච පනා‘හං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා සත්තානං නානාධිමුත්තිකතං යථාභූතං පජානාමීති."
            },
            {
                "type": "page-break",
                "text": "82"
            },
            {
                "type": "centered",
                "text": "8. 2. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඉන්ද්රියසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3630. ඉමෙසඤ්ච පනා‘හං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා පරසත්තානං පරපුග්ගලානං ඉන්ද්රියපරොපරියත්තං යථාභූතං පජානාමීති."
            },
            {
                "type": "centered",
                "text": "8. 2. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඣානසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3631. ඉමෙසඤ්ච පනා‘හං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා ඣානවිමොක්ඛසමාධිසමාපත්තීනං සඞ්කිලෙසං වොදානං{1 ඔදානං - සීමු, ස්යා.} වුට්ඨානං යථාභූතං පජානාමීති."
            },
            {
                "type": "centered",
                "text": "8. 2. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පුබ්බෙනිවාසසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3632. ඉමෙසඤ්ච පනා‘හං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරාමි. සෙය්යථිදං: “එකම්පි ජාතිං -පෙ- ඉති සාකාරං සඋද්දෙසං අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරාමීති."
            },
            {
                "type": "centered",
                "text": "8. 2. 13.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දිබ්බචක්ඛුසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3633. ඉමෙසඤ්ච පනා‘හං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන -පෙ- යථාකම්මූපගෙ සත්තෙ පජානාමීති."
            },
            {
                "type": "centered",
                "text": "8. 2. 14.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආසවක්ඛයසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3634. ඉමෙසඤ්ච පනා‘හං ආවුසො, චතුන්නං සතිපට්ඨානානං භාවිතත්තා බහුලීකතත්තා ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤාසච්ඡිකත්වා උපසම්පජ්ජ විහරාමීති."
            },
            {
                "type": "centered",
                "text": "සහස්සවග්ගො දුතියො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "සහස්සං ඉද්ධිවිධං දිබ්බං චෙතාපරිය ඨානකම්මා,\nසබ්බත්ථ නානාධධත්ථ මුත්තින්ද්රියං ඣානං තිස්සො විජ්ජාති."
            },
            {
                "type": "centered",
                "text": "අනුරුද්ධසංයුත්තං සමත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැ වග්ගුද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "රහොගතො සහස්සොති ද්වෙව වග්ගා භවන්තිහි\nඅනුරුද්ධස්ස සංයුත්තෙ දෙසිතාදිච්චබන්ධුනාති."
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ],
        "pages": {
            "62": {
                "pageNum": 62,
                "footnotesCount": 0
            },
            "64": {
                "pageNum": 64,
                "footnotesCount": 1
            },
            "66": {
                "pageNum": 66,
                "footnotesCount": 0
            },
            "68": {
                "pageNum": 68,
                "footnotesCount": 1
            },
            "70": {
                "pageNum": 70,
                "footnotesCount": 2
            },
            "72": {
                "pageNum": 72,
                "footnotesCount": 0
            },
            "74": {
                "pageNum": 74,
                "footnotesCount": 5
            },
            "76": {
                "pageNum": 76,
                "footnotesCount": 1
            },
            "78": {
                "pageNum": 78,
                "footnotesCount": 0
            },
            "80": {
                "pageNum": 80,
                "footnotesCount": 0
            },
            "82": {
                "pageNum": 82,
                "footnotesCount": 1
            }
        }
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "63"
            },
            {
                "text": "8. අනුරුද්ධ සංයුක්තය",
                "type": "heading",
                "level": 3
            },
            {
                "text": "1. රහොගත වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "8. 1. 1.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "රහොගත සූත්‍රය",
                "level": 1
            },
            {
                "text": "3611. එක්කලෙක ආයුෂ්මත් අනුරුද්ධ තෙරණුවෝ සැවත සමීපයෙහි අනේපිඬුසිටුහුගේ දෙව්රම්හි වැඩවෙසෙති. එකල්හි රහොගතව එකලාව සිටි ආයුෂ්මත් අනුරුද්ධ තෙරණුවන්ට මෙබඳු චිත්තවිතර්කයෙක් පහළ විය: “යම් කෙනකුන් විසින්, සිවු සීවටන් වරදවන ලද ද, මැනවින් දුක් ගෙවීමට පමුණුවන අරිමග ඔවුන් විසින් වරදවන ලදී. යම් කෙනකුන් විසින්, සිවු සීවටන් අරඹන ලද ද මැනවින් දුක් ගෙවීමට පමුණුවන අරිමග ඔවුන් විසින් අරඹන ලදී”යි.",
                "type": "paragraph"
            },
            {
                "text": "එකල්හි ආයුෂ්මත් මහමුගලන් තෙරණුවෝ ආයුෂ්මත් අනුරුද්ධ තෙරණුවන්ගේ චිත්තවිතර්කයෙක් සිය සිතින් දැන යම්සේ බලවත් පුරුෂයෙක් හැකුළු අතක් දිගු කරන්නේ හෝ දිගු කළ අතක් හකුළුවන්නේ හෝ වේ ද, එසෙයින් ම ආයුෂ්මත් අනුරුද්ධ තෙරණුවන් ඉදිරියෙහි පහළවූහ. එකල්හි ආයුෂ්මත් මහමුගලන් තෙරණුවෝ ආයුෂ්මත් අනුරුද්ධ තෙරණුවන්ට මෙය වදාළහ: “ඇවැත්නි අනුරුද්ධයෙනි, කෙතෙකින් මහණහුගේ සිවු සීවටන් පිරිපුන් වේ දැ”යි. ඇවැත්නි, මෙසසුන්හි මහණ සිය කයෙහිත් හටගැනුම් ස්වභාව අනුව දක්නාසුලුව කෙලෙස් තවන වැර ඇතිව මනාදැනුම් ඇතිව සිහි ඇති ව කායලොකයෙහි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. සිය කයෙහි වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. සිය කයෙහි හටගැනුම් වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇතිව මනා දැනුම් ඇති ව සිහි ඇති ව කායලොකයෙහි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. මෙරමා කයෙහි හටගැනුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. මෙරමා කයෙහි වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. මෙරමා කයෙහි හටගැනුම් වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව කායලොකයෙහි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. තමාගේ හා මෙරමාගේ කයෙහි හටගැනුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. තමාගේ හා මෙරමාගේ කයෙහි වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. තමාගේ හා මෙරමාගේ කයෙහි හටගැනුම් වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව කායලොකයෙහි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "65"
            },
            {
                "text": "ඉදින් හේ නොපිළිකුල් අරමුණෙහි පිළිකුල් හැඟීම් ඇති ව වසන්නෙමි යි කැමති වේ නම් එහි පිළිකුල් හැඟීම් ඇති ව වෙසේ. ඉදින් පිළිකුල් අරමුණෙහි නොපිළිකුල් හැඟීම් ඇති ව වසන්නෙමි යි කැමති වේ නම් එහි නොපිළිකුල් හැඟීම් ඇති ව වෙසේ. ඉදින් නොපිළිකුලෙහි ද පිළිකුලෙහි ද පිළිකුල් හැඟීම් ඇති ව වසන්නෙමි යි කැමති වේ නම් එහි පිළිකුල් හැඟීම් ඇති ව වෙසේ. ඉදින් පිළිකුලෙහි ද නොපිළිකුලෙහි ද නොපිළිකුල් හැඟීම් ඇති ව වසන්නෙමි යි කැමති වේ නම් එහි නොපිළිකුල් හැඟීම් ඇති ව වෙසේ. ඉදින් පිළිකුලත් නොපිළිකුලත් යන දෙක දුරු කොට මැදහත් ව සිහි ඇතිව මනාදැනුම් ඇති ව වසන්නෙමි යි කැමති වේ නම් එහි මැදහත් ව සිහි ඇති ව මනාදැනුම් ඇති ව වෙසේ.",
                "type": "paragraph"
            },
            {
                "text": "සිය විඳුම්හි හටගැනුම් ස්වභාව අනු ව දක්නාසුලුව … වෙසේ. සිය විඳුම්හි වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. සිය විඳුම්හි හටගැනුම් වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. මෙරමා විඳුම්හි හටගැනුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. මෙරමා විඳුම්හි වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. මෙරමා විඳුම්හි හටගැනුම් වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. සියමෙරමා විඳුම්හි හටගැනුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. සියමෙරමා විඳුම්හි වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව... වෙසේ. සිය මෙරමා විඳුම්හි හටගැනුම් වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව කෙලෙස් තවන වෙර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව විඳුම්ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. ඉදින් හෙතෙමේ ... කැමති වේ නම් එහි මැදහත් ව සිහි ඇති ව මනාදැනුම් ඇති ව වෙසේ.",
                "type": "paragraph"
            },
            {
                "text": "සියසිත්හි හටගැනුම් ස්වභාව අනු ව දක්නාසුලුව … වෙසේ. සිය සිත්හි වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. සියසිත්හි හටගැනුම් වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. මෙරමා සිත්හි හටගැනුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. මෙරමා සිත්හි වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. මෙරමා සිත්හි හටගැනුම් වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. සියමෙරමා සිත්හි හටගැනුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. සියමෙරමා සිත්හි වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. සිය මෙරමා සිත්හි හටගැනුම් වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව සිත් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. හේ ඉදින් ... කැමති වේ නම් එහි මැදහත් ව සිහි ඇති ව මනාදැනුම් ඇති ව වෙසේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "67"
            },
            {
                "text": "සිය නීවරණාදි දහම්හි හටගැනුම් ස්වභාව අනුව දක්නාසුලු ව … වෙසේ. සියදහම්හි වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. සිය දහම්හි හටගැනුම් වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. මෙරමා ගේ (නීවරණාදි) දහම්හි හටගැනුම් ස්වභාව අනු ව දක්නාසුලු ව … වෙසේ. මෙරමාදහම්හි වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. මෙරමා දහම්හි හටගැනුම් වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. සියමෙරමා දහම්හි හටගැනුම් ස්වභාව අනු ව දක්නාසුලුව … වෙසේ. සිය මෙරමා දහම්හි වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව ... වෙසේ. සියමෙරමා දහම්හි හටගැනුම් වැනසුම් ස්වභාව අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ.",
                "type": "paragraph"
            },
            {
                "text": "හෙතෙමේ ඉදින් නොපිළිකුලෙහි පිළිකුල් හැඟීම ඇති ව වෙසෙන්නෙමි යි කැමති වේ නම් එහි පිළිකුල් හැඟීම් ඇති ව වෙසේ. ඉදින් පිළිකුලෙහි නොපිළිකුල් හැඟීම් ඇති ව වෙසෙන්නෙමියි කැමති වේ නම් එහි නොපිළිකුල් හැඟීම් ඇති ව වෙසේ. ඉදින් නොපිළිකුලෙහිත් පිළිකුලෙහිත් පිළිකුල් හැඟීම් ඇති ව වෙසෙන්නෙමියි කැමති වේ නම් ඵහි පිළිකුල් හැඟීම් ඇති ව වෙසේ. ඉදින් පිළිකුලෙහිත් නොපිළිකුලෙහිත් නොපිළිකුල් හැඟීම් ඇති ව වෙසෙන්නෙමියි කැමති වේ නම් එහි නොපිළිකුල් හැඟීම් ඇති ව වෙසේ. ඉදින් නොපිළිකුලත් පිළිකුලත් යන එදෙක දුරු කොට මැදහත් ව සිහි ඇති ව මනා දැනුම් ඇති ව වෙසෙන්නෙමියි කැමති වේ නම් එහි මැදහත් ව සිහි ඇතිව වෙසේ. ඇවැත්නි, මහණහුගේ සිවු සීවටන්හු මෙතෙකින් පිරිපුන් වෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය රහොගත සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3612. එක්කලෙක ආයුෂ්මත් අනුරුද්ධතෙරණුවෝ සැවත සමීපයෙහි අනේපිඬුසිටුහුගේ දෙව්රම්හි වැඩවෙසෙත්. එකල්හි එකලා වූ විවෙකයෙන් යුත් ආයුෂ්මත් අනුරුද්ධතෙරණුවන්ට මෙබඳු චිත්තවිතර්කයෙක් පහළ විය: “යම් කෙනකුන්ට සිවු සීවටන්හු වැරදුණාහු ද, මැනවින් දුක් ගෙවීමට පමුණුවන අරිමඟ ඔවුනට වැරදුණේ ය. යම් කිසි කෙනකුන්ට සිවු සීවටන්හු පිරිපුන් වෙද්ද, මැනවින් දුක් ගෙවීමට පමුණුවන අරිමඟ ඔවුනට පිරිපුන් වේ යි”. එකල ආයුෂ්මත් මහමුගලන්තෙරණුවෝ ආයුෂ්මත් අනුරුද්ධතෙරණුවන්ගේ චිත්තවිතර්කය සියසිතින් දැන යම්සේ බලවත් පුරුෂයෙක් ... එසෙයින් ම ආයුෂ්මත් අනුරුද්ධතෙරණුවන් ඉදිරියෙහි පහළ වූහ. ඉක්බිති ආයුෂ්මත් මහමුගලන්තෙරණුවෝ ආයුෂ්මත් අනුරුද්ධතෙරණුවන්ට මෙය වදාළහ: “ඇවැත්නි, අනුරුද්ධයෙනි, මහණහුගේ සිවු සීවටන්හු කෙතෙකින් පිරිපුන් වෙද්දැ”යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "69"
            },
            {
                "text": "ඇවැත්නි, මෙසස්නෙහි මහණ සියකයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව කාය සඞ්ඛ්‍යාත ලොකයෙහි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. මෙරමාකයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව ... වෙසේ. සියමෙරමාකයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව ... වෙසේ. සියවිඳුම්හි ... මෙරමාවිඳුම්හි ... සිය මෙරමාවිඳුම්හි ... සියසිත්හි ... මෙරමාසිත්හි ... සියමෙරමාසිත්හි ... සියදහම්හි ... මෙරමාදහම්හි ... සියමෙරමාදහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. ඇවැත්නි, මහණහුගේ සිවුසීවටන්හු මෙතෙකින් පිරිපුන් වෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුතනු සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3613. එක්සමයෙක ආයුෂ්මත් අනුරුද්ධතෙරණුවෝ සැවත සමීපයෙහි සුතනු ඉවුරෙහි වැඩවෙසෙති. එකල බොහෝ භික්ෂූහු ආයුෂ්මත් අනුරුද්ධතෙරණුවන් වෙත එළඹියහ. එළඹ ආයුෂ්මත් අනුරුද්ධතෙරණුවන් සමග සතුටු වූහ. සතුටු විය යුතු සිහි කට යුතු කතාව කොට නිමවා එකත්පස් ව හුන් ඒ භික්ෂූහු ආයුෂ්මත් අනුරුද්ධතෙරණුවන් ට මෙය කීහ: “කවර දහම් වැඩූ බැවින් බහුල කළ බැවින් ආයුෂ්මත් අනුරුද්ධතෙරණුවෝ මහාභිඥ බවට පැමිණියාහු දැ”යි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, මම සිටුසීවටන් වැඩූ බැවින් බහුල කළ බැවින් මහාභිඥ බවට පැමිණියෙමි. කවර සිවු සීවටන් ද යත්: ඇවැත්නි, මෙහි මම කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇතිව සිහි ඇති ව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙමි. වෙදනාවන්හි ... සිත්හි ... දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව් හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙමි. ඇවැත්නි, මේ සිවුසීවටන් වැඩූ බැවින් බහුල කළ බැවින් මම මහාභිඥ බවට පැමිණියෙමි. ඇවැත්නි, මම සිවු සීවටන් වැඩූ බැවින් ම බහුල කළ බැවින් ම හීනදහම් හීන විසින් දතිමි, මැදුම්දහම් මැදුම් විසින් දතිමි, ප්‍රණීතදහම් ප්‍රණීත විසින් දතිමි යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "71"
            },
            {
                "type": "centered",
                "text": "8. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කණ්‌ටකී සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3614. එක්කලෙක ආයුෂ්මත් අනුරුද්ධතෙරණුවෝත් ආයුෂ්මත් සැරියුත්තෙරණුවෝත් ආයුෂ්මත් මහමුගලන්තෙරණුවෝත් සාකෙතනුවර සමීපයෙහි කණ්ටකීවෙනෙහි වැඩවෙසෙති. එකල්හි ආයුෂ්මත් සැරියුත්තෙරණුවෝත් ආයුෂ්මත් මහමුගලන් තෙරණුවෝත් සවස්කල විවේකයෙන් නැගී සිටියාහු ආයුෂ්මත් අනුරුද්ධතෙරණුවන් වෙත එළඹියහ. එළඹ ආයුෂ්මත් අනුරුද්ධතෙරණුවන් සමග සතුටු වූහ. සතුටු විය යුතු සිහි කට යුතු කතාව කොට නිමවා එකත්පස් ව වැඩහුන්හ. එකත්පස් ව වැඩහුන් ආයුෂ්මත් සැරියුත්තෙරණුවෝ ආයුෂ්මත් අනුරුද්ධතෙරණුවන්ට මෙය වදාළහ: “ඇවැත්නි අනුරුද්ධයෙනි, සෙඛමහණ විසින් කවර දහම් උපයා ගෙන විසිය යුතුදැ”යි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි ශාරිපුත්‍රයෙනි, සෙඛමහණ විසින් සිවු සීවටන් උපයා ගෙන විසිය යුතුය. කවර සිවුසීවටන්හු ද යත්: ඇවැත්නි, මෙසස්නෙහි මහණ කයෙහි කය අනු ව දක්නා සුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. විඳුම්හි ... සිත්හි ... දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. ඇවැත්නි ශාරිපුත්‍රයෙනි, සෙඛමහණ විසින් මේ සිවුසීවටන් උපයා ගෙන විසිය යුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය කණ්‌ටකී සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3615. ඇවැත්නි අනුරුද්ධයෙනි, අසෙඛ (රහත්) මහණ විසින් කවර දහම් උපයා ගෙන විසිය යුතු දැයි? ඇවැත්නි සාරිපුත්තයෙනි, අසෙඛමහණ විසින් සිවු සීවටන් උපයා ගෙන විසිය යුතුය. කවර සිවු සීවටන්හුද යත්: ඇවැත්නි, මෙහි මහණ කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. විඳුම්හි ... සිත්හි ... දහම්හි දහම් අනු ව දක්නාසුලුව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම් ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. ඇවැත්නි සාරිපුත්තයෙනි, අසෙඛමහණ විසින් සිවු සීවටන් උපයා ගෙන විසිය යුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "73"
            },
            {
                "type": "centered",
                "text": "8. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තතිය කණ්‌ටකී සූත්‍රය",
                "level": 1
            },
            {
                "text": "3616. ආයුෂ්මත් අනුරුද්ධයෝ කවර දහම් වැඩූ බැවින් බහුල කළ බැවින් මහාභිඥ බවට පැමිණියෝ දැ යි. ඇවැත්නි, මම සිවු සීවටන් වැඩූ බැවින් බහුල කළ බැවින් මහාභිඥ බවට පැමිණියෙමි. කවර සිවු සීවටන් ද යත්: ඇවැත්නි, මෙහි මම කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙමි. විඳුම්හි ... සිත්හි ... දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙමි. ඇවැත්නි, මම මේ සිවු සීවටන් වැඩූ බැවින් බහුල කළ බැවින් මහාභිඥ බවට පැමිණියෙමි. ඇවැත්නි, මම මේ සිවුසීවටන් වැඩූ බැවින් බහුල කළ බැවින් දහසක් ලොව වෙසෙසින් දනිමි යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තණ්‌හක්‌ඛය සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3617. එක්කලෙක ආයුෂ්මත් අනුරුද්ධතෙරණුවෝ සැවත සමීපයෙහි අනේපිඬුසිටුහුගේ දෙව්රම්හි වැඩවෙසෙති. එහිදී ආයුෂ්මත් අනුරුද්ධතෙරණුවෝ භික්ෂූන් ඇමතූහ ... ඇවැත්නි, මේ සිවු සීවටන් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු තෘෂ්ණාක්‍ෂය පිණිස පවතිත්. කවර සිවු සීවටන් කෙනෙක් ද යත්: ඇවැත්නි, මෙහි මහණ කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. විඳුම්හි ... සිත්හි ... දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. ඇවැත්නි, මේ සිවු සීවටන්හු වඩන ලදහු බහුල කරන ලදහු තෘෂ්ණාක්‍ෂය පිණිස පවතිත් යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සලලාගාර සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3618. එක්කලෙක ආයුෂ්මත් අනුරුද්ධතෙරණුවෝ සැවත සමීපයෙහි සලලාගාරයෙහි වැඩවෙසෙති. එහි දී ආයුෂ්මත් අනුරුද්ධතෙරණුවෝ … මෙය වදාළහ: “ඇවැත්නි, යම් සේ ගඞ්ගානදී තොමෝ පෙරදිගට නැමුණි පෙරදිගට නැඹුරු වූවා පෙරදිගට බර වූවා වේ ද, එකල්හි ‘අපි මේ ගඞ්ගානදිය පැළදිගට නැමුණක් පැළදිගට නැඹුරු වූවක් පැළදිගට බර වූවක් කරන්නෙමු’යි උදලු පැසි ගෙන මහජනයසමූහයා එන්නේ ය. ඇවැත්නි, ඒ කිමැයි හඟිවු ද? ඒ මහජනසමූහයා ගඞ්ගානදිය පැළදිගට නැමුණක් පැළදිගට නැඹුරු වූවක් පැළදිගට බර වූවක් කරන්නේ දැයි. ඇවැත්නි, මෙය නො වේ ම ය. ඒ කවර හෙයින යත්: ඇවැත්නි, ගඞ්ගානදිය පෙරදිගට නැමුණි පෙරදිගට නැඹුරු වූවා පෙරදිගට බර වූවා වෙයි. එය පැළදිගට නැමුණක් පැළදිගට නැඹුරු වූවක් පැළදිගට බර වූවක් කරන්නට සුකර නො වෙයි. හුදෙක් ඒ මහාජනසමූහයා වෙහෙසට විඩාවට බඳුන් වන්නේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "75"
            },
            {
                "text": "ඇවැත්නි, එසෙයින් ම සිවු සීවටන් වඩන සිවු සීවටන් බහුල කරන මහණහු රජෙක් හෝ රජු සම වූවෙක් හෝ මිතුරු කෙනෙක් හෝ ඇමති කෙනෙක් හෝ නෑ සහලේනෑ නෙනෙක් හෝ “එම්බා පුරුෂය, කුමක් හෙයින් මේ කසාවත්හු තොපගේ (සිරුර) දවද්ද? කුමක් හෙයින් මුඩු ව කබලක් ගෙන හැසිරෙවු ද? එව ගිහි බවට පෙරළී භොගත් වළඳ ව පිනුත් කරව”යි භොගයන් එළවා පවරන්නාහු නම් ඇවැත්නි, සිවු සීවටන් වඩන සිවු සීවටන් බහුල කරන ඒ මහණ සික පිළිකෙවු කොට ගිහි බවට පෙරළෙන්නේය යන මෙකරුණ නැත. ඒ කවර හෙයින යත්: “ඇවැත්නි, යම් සිතක් දිගුකලක් මුළුල්ලෙහි නිවනට නැමුණේ නිවනට නැඹුරු වූයේ නිවනට බර වූයේ වේ නම් එය එසේ ලාමක බවට පෙරළෙන්නේ ය” යන මෙකරුණ නැත.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, කෙසේ නම් මහණ සිවු සීවටන් වඩා ද, සිවු සීවටන් බහුල කෙරේ ද යත්: ඇවැත්නි, මෙහි මහණ කයෙකි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. විඳුම්හි ... සිත්හි ... දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. ඇවැත්නි, මෙසේ මහණ සිවු සීවටන් වඩයි. සිවු සීවටන් බහුල කෙරේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අම්‌බපාලි සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3619. එක් සමයෙක ආයුෂ්මත් අනුරුද්ධතෙරණුවෝත් ආයුෂ්මත් සැරියුත්තෙරණුවෝත් විසල්පුර සමීපයෙහි වූ අම්බපාලිවෙනෙහි වැඩවෙසෙති. එසමයෙහි ආයුෂ්මත් සැරියුත් තෙරණුවෝ සවස් කල විවෙකයෙන් නැගී සිටියාහු ආයුෂ්මත් අනුරුදුතෙරණුවන් වෙත එළඹියහ. එළඹ ආයුෂ්මත් අනුරුදුතෙරණුවන් සමග සතුටු වූහ. සතුටු විය යුතු සිහි කට යුතු කතාව කොට නිමවා එකත්පසෙක වැඩහුන්හ. එකත්පසෙක වැඩහුන් ආයුෂ්මත් සැරියුත්තෙරණුවෝ ආයුෂ්මත් අනුරුදුතෙරණුවන්ට මෙය වදාළහ: “ඇවැත්නි, අනුරුද්ධයෙනි, ඔබගේ ඉඳුරෝ වෙසෙසින් පහන්හ. මුවපැහැය පිරිසුදුය. හාත්පසින් බබළන්නේ ය. ආයුෂ්මත් අනුරුද්ධයෝ දැන් කවර විහරණයකින් යුතුව බහුල කොට වෙසෙද්දැ”යි?",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "77"
            },
            {
                "text": "ඇවැත්නි, මම දැන් සිවු සීවටන්හි මැනවින් එළඹ සිටි සිත් ඇතියෙම් බහුල කොට වෙසෙමි. කවර සිවු සීවටන්හි ද යත්: ඇවැත්නි, මෙහි මම කයෙහි කය අනු ව දක්නාසුල්ලෙම් කෙලෙස් තවන වැර ඇතියෙම් මනා දැනුම් ඇතියෙම් සිහි ඇතියෙම් කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙමි. විඳුම්හි ... සිත්හි ... දහම්හි දහම් අනු ව දක්නාසුල්ලෙම් කෙලෙස් තවන වැර ඇතියෙම් මනාදැනුම් ඇතියෙම් සිහි ඇතියෙම් දහම්ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙමි. ඇවැත්නි, මම දැන් මේ සිවු සීවටන්හි මැනවින් එළඹ සිටි සිත් ඇතියෙම් බහුල කොට වෙසෙමි. ඇවැත්නි, ක්‍ෂය කළ ආස්‍රව ඇති වැස නිම වූ බඹසර ඇති කළ කටයුතු ඇති බහා තැබූ බර ඇති පිළිවෙළින් පැමිණි ස්වාත්ථි ඇති මුළුමනින් ගෙවූ භවසංයොජන ඇති මැනවින් දැන මිදුණු යම් ඒ රහත්මහණෙක් වේ නම් හෙතෙමේ මේ සිවු සීවටන්හි මැනවින් එළඹ සිටි සිත් ඇති ව බහුල කොට වෙසේ යි. ඇවැත්නි, යම්බඳු අපි ආයුෂ්මත් අනුරුද්ධයන් සෙට වදන් බෙණෙද්දී ඉදිරියෙහි ම ඇසුමෝ ද ඇවැත්නි, ඒ අපට ලාභයෙකි. ඒ අපට මනා ලැබීමෙකි යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ගිලාන සූත්‍රය",
                "level": 1
            },
            {
                "text": "3620. එක්කලෙක ආයුෂ්මත් අනුරුද්ධතෙරණුවෝ හටගත් ආබාධ ඇතියෝ දුකට පැමිණියෝ දැඩිසේ ගිලන් වූවෝ සැවත සමීපයෙහි අඳවෙනෙහි වැඩවෙසෙති. එකල්හි බොහෝ භික්ෂූහු ආයුෂ්මත් අනුරුද්ධතෙරණුවන් වෙත එළඹියහ. එළඹ ආයුෂ්මත් අනුරුද්ධ තෙරණුවන්ට මෙය කිහ: “කවර විහරණයකින් වෙසෙන ආයුෂ්මත් අනුරුදුතෙරණුවන්ගේ හටගත් ශාරීරික දුක්වෙදනාවෝ සිත හාත්පසින් අල්ලා ගෙන නො සිටිද්දැ”යි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, සිවු සීවටන්හි මැනවින් එළඹ සිටි සිත් ඇති ව වෙසෙන මාගේ උපන් ශාරීරික දුක්වෙදනාවෝ සිත හාත්පසින් අල්ලා ගෙන නො සිටිත්. කවර සිවු සීවටන්හි ද යත්: ඇවැත්නි, මෙහි මම කයෙහි කය අනු ව දක්නාසුල්ලෙම් කෙලෙස් තවන වැර ඇතියෙම් මනාදැනුම් ඇතියෙම් සිහි ඇතියෙම් කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙමි. විඳුම්හි ... සිත්හි ... දහම්හි දහම් අනු ව දක්නාසුල්ලෙම් කෙලෙස් තවන වැර ඇතියෙම් මනාදැනුම් ඇතියෙම් සිහි ඇතියෙම් දහම්ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙමි. ඇවැත්නි, මේ සිවු සීවටන්හි මැනවින් එළඹ සිටි සිත් ඇති ව වෙසෙන මාගේ හටගත් ශාරීරික දුක් වේදනාවෝ සිත හාත්පසින් අල්ලා ගෙන නො සිටිති යි.",
                "type": "paragraph"
            },
            {
                "text": "පළමුවැනි රහොගතවර්ගය යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රනාමාවලිය:**",
                "type": "unindented"
            },
            {
                "text": "රහොගත නමින් ම දෙකෙකි. සුතනු නමින් එකෙකි. කණ්ටකී නමින් තුනෙකි. තණ්හාක්ඛය, සලලාගාර, අම්බපාලි ගිලාන යි සතරෙකි යි. මුළුල්ල දශයෙකි යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "79"
            },
            {
                "text": "2. සහස්ස වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "8. 2. 1.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "සහස්‌ස සූත්‍රය",
                "level": 1
            },
            {
                "text": "3621. එක්කලෙක ආයුෂ්මත් අනුරුද්ධතෙරණුවෝ සැවත සමීපයෙහි අනේපිඬුසිටුහුගේ දෙව්රම්හි වැඩවෙසෙති. එකල්හි බොහෝ භික්ෂූහු ආයුෂ්මත් අනුරුද්ධතෙරණුවන් වෙත එළඹියහ. එළඹ ආයුෂ්මත් අනුරුද්ධතෙරණුවන් සමග සතුටු වූහ. ... ආයුෂ්මත් අනුරුද්ධතෙරණුවන්ට මෙය කිහ: “ආයුෂ්මත් අනුරුද්ධතෙරණුවෝ කවර දහම් වැඩූ බැවින් බහුල කල බැවින් මහාභිඥ බවට පැමිණියෝ දැ”යි. ඇවැත්නි, සිවු සීවටන් වැඩූ බැවින් බහුල කල බැවින් මහාභිඥ බවට පැමිණියෙමි. කවර සිවු සීවටන් ද යත්: ඇවැත්නි, මෙහි මම කයෙහි කය අනු ව දක්නාසුල්ලෙම් කෙලෙස් තවන වැර ඇතියෙම් මනාදැනුම් ඇතියෙම් සිහි ඇතියෙම් කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙමි. විඳුම්හි ... සිත්හි ... දහම්හි  දහම් අනු ව දක්නාසුල්ලෙම් කෙලෙස් තවන වැර ඇතියෙම් මනාදැනුම් ඇතියෙම් සිහි ඇතියෙම් දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙමි. ඇවැත්නි, මම මේ සිවු සීවටන් වැඩූ බැවින් බහුල කළ බැවින් මහාභිඥ බවට පැමිණියෙමි. තව ද ඇවැත්නි, මේ සිවු සීවටන් වැඩූ බැවින් බහුල කළ බැවින් මම කප් දහසක් සිහි කෙරෙමි යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 2. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඉද්‌ධිවිධ සූත්‍රය",
                "level": 1
            },
            {
                "text": "3622. තව ද ඇවැත්නි, මේ සිවු සීවටන් වැඩූ බැවින් බහුල කළ බැවින් මම නන් වැදෑරුම් ඉදු කොටස් විඳිමි. “එකෙක් ව ද බොහෝ අයුරු වෙමි. බොහෝ අයුරු ව ද එකෙක් වෙමි. පළට බව මුවහ බව විඳිමි. බිතෙන් පිටට පව්රෙන් පිටට පව්වෙන් පිටට අහසෙහි මෙන් නොගැටෙමින් යෙමි. දියෙහි මෙන් පොළොවෙහිත් මතුවීම කිමිදීම කෙරෙමි. පොළොවෙහි මෙන් නොබිඳෙන දියෙහිත් යෙමි. පියාපත් ඇති ලිහිණියකු මෙන් අහසෙහිත් පළඟින් යුතු ව ගමන් කෙරෙමි. මෙබඳු මහත් සෘද්ධි ඇති මෙබඳු මහත් අනුභාව ඇති මේ සඳහිරු දෙදන ද අතින් පහසමි. පිරිමදිමි. බඹලොව තෙක්දු කයින් වෙසෙහි පවත්වමි” යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 2. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දිබ්‌බසොත සූත්‍රය",
                "level": 1
            },
            {
                "text": "3623. ඇවැත්නි, මේ සිවු සීවටන් වැඩූ බැවින් බහුල කළ බැවින් මම මිනිස්බැව් ඉක්මවා පැවති විශුද්ධ වූ දිව්‍යමය ශ්‍රොත්‍රධාතුවෙන් දුර වූ ද ලඟ වූ ද දෙව් මිනිස් දෙ සද අසමි යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "81"
            },
            {
                "type": "centered",
                "text": "8. 2. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "චෙතොපරිය සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3624. ඇවැත්නි, මේ සිවු සීවටන් ම වැඩූ බැවින් බහුල කළ බැවින් මම පරසතුන්ගේ පරපුඟුලන්ගේ සිත තමසිතින් පිරිසිඳ දනිමි. සරාග සිත හෝ සරාග සිතැයි දනිමි. වීතරාග සිත හෝ වීතරාග සිතැයි දනිමි. ... අවිමුත්ත සිත හෝ අවිමුත්ත සිතැ යි දනිමි. විමුක්ත සිත හෝ විමුක්ත සිතැ යි දනිමි යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 2. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඨාන සූත්‍රය",
                "level": 1
            },
            {
                "text": "3625. ඇවැත්නි, මේ සිවු සීවටන් වැඩූ බැවින් බහුල කල බැවින් මම කරුණ කරුණුවිසිනුත් නොකරුණ නොකරුණුවිසිනුත් තතු සේ දනිමි යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 2. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කම්‌ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3626. ඇවැත්නි, මේ සිවු සීවටන් ම වැඩූ බැවින් බහුල කළ බැවින් මම අතීතානාගතවර්තමානකර්මසමාදානයන්ගේ විපාකය කරුණු විසින් හෙතු විසින් තතු සේ දනිමි යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 2. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සබ්‌බත්‌ථ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3627. ඇවැත්නි, මේ සිවු සීවටන් ම වැඩූ බැවින් බහුල කළ බැවින් මම සියලුගතිවලට පමුණුවන මඟ තතු සේ දනිමි යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 2. 8.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "අනෙකධාතු සූත්‍රය",
                "level": 1
            },
            {
                "text": "3628. ඇවැත්නි, මේ සිවු සීවටන් ම වැඩූ බැවින් බහුල කළ බැවින් මේ නොයෙක් ධාතු නන් වැදෑරුම් ධාතුලොකය තතු සේ දනිමි යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 2. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නානාධිමුත්‌තික සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3629. ඇවැත්නි, මේ සිවු සීවටන් ම වැඩූ බැවින් බහුල කළ බැවින් මම සත්ත්වයන්ගේ හීනාදි නානාධිමුත්ති ඇති බව තතු සේ දනිමි යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "83"
            },
            {
                "type": "centered",
                "text": "8. 2. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඉන්‌ද්‍රිය සූත්‍රය",
                "level": 1
            },
            {
                "text": "3630. ඇවැත්නි, මේ සිවු සීවටන් වැඩූ බැවින් බහුල කළ බැවින් අන් සතුන්ගේ හා අන් පුඟුලන්ගේ ඉඳුරන් පිළිබඳ වැඩීමත් පිරිහීමත් මම තතු සේ දනිමි යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 2. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඣාන සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3631. ඇවැත්නි, මේ සිවු සීවටන් වැඩූ බැවින් බහුල කළ බැවින් ධ්‍යානවිමොක්‍ෂසමාධිසමාපත්තීන්ගේ කෙලෙසීමත් පිරිසිදුවීමත් නැගීසිටීමත් මම තතු සේ දනිමි යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 2. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පුබ්‌බෙනිවාස සූත්‍රය",
                "level": 1
            },
            {
                "text": "3632. ඇවැත්නි, මේ සිවු සීවටන් වැඩූ බැවින් බහුල කළ බැවින් මම නන් වැදෑරුම් පෙරවිසූ කඳපිළිවෙළ සිහි කෙරෙමි. එනම්: “ජාති එකක් ද ... මෙසේ අයුරු සහිත උදෙසුම් සහිත නන් වැදෑරුම් පෙර විසූ කඳපිළිවෙළ සිහි කෙරෙමි” යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 2. 13.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දිබ්‌බචක්‌ඛු සූත්‍රය",
                "level": 1
            },
            {
                "text": "3633. ඇවැත්නි, මේ සිවු සීවටන් වැඩූ බැවින් බහුල කළ බැවින් මම මිනිසැස ඉක්ම පැවති වෙසෙසින් පිරිසිදු වූ දිවැසින් ... කම් වූ පරිදි පැමිණි සතුන් දනිමි යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 2. 14.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආසවක්‌ඛය සූත්‍රය",
                "level": 1
            },
            {
                "text": "3634. ඇවැත්නි, මේ සිවු සීවටන් වැඩූ බැවින් බහුල කළ බැවින් මම ආස්‍රව ක්‍ෂය කිරීමෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලප්‍රඥාවත් දිටුදැමියෙහි ම තෙමේ වෙසෙසින් දැන පසක් කොට එයට පැමිණ වෙසෙමි යි.",
                "type": "paragraph"
            },
            {
                "text": "දෙවැනි සහස්සවර්ගය යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රනාමාවලිය:**",
                "type": "unindented"
            },
            {
                "text": "සහස්ස, ඉද්ධිවිධ, දිබ්බසොත, චෙතොපරිය, ඨාන, කම්ම, සබ්බත්ථ, නානාධාතු, නානාධිමුත්තික, ඉන්ද්‍රිය, ක්ධාන, පුබ්බෙනිවාස, දිබ්බචක්ඛු, ආසවක්ඛය යි තුදුස් සුතුරෙකි යි.",
                "type": "paragraph"
            },
            {
                "text": "අනුරුද්ධසංයුත්තය නිමියේ ය.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි වර්ගනාමාවලිය:**",
                "type": "unindented"
            },
            {
                "text": "රහොගත සහස්ස යි අනුරුද්ධ සංයුත්තයෙහි බුදුරජාණන් වහන්සේ විසින් දෙශනා කරනා ලද වර්ග දෙකෙක් ම වේ යි.",
                "type": "paragraph"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ]
    }
]