{
    "filename": "sn-5-10",
    "bookId": 21,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 90,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "10. ආනාපානසංයුත්තං",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. එකධම්මවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 1",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "එකධම්මසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "3749.** සාවත්ථිනිදානං.**"
                    },
                    {
                        "type": "paragraph",
                        "text": "එකධම්මො භික්ඛවෙ, භාවිතො බහුලීකතො මහප්ඵලො හොති මහානිසංසො. කතමො එකධම්මො: ආනාපානසති.{1} කථං භාවිතා ච භික්ඛවෙ, ආනාපානසති කථං බහුලීකතා මහප්ඵලා හොති, මහානිසංසා: ඉධ භික්ඛවෙ, භික්ඛු අරඤ්ඤගතො වා රුක්ඛමූලගතො වා සුඤ්ඤාගාරගතො වා නිසීදති පල්ලඞ්කං ආභුජිත්වා උජුං කායං පණිධාය පරිමුඛං සතිං උපට්ඨපෙත්වා. සො සතො‘ව අස්සසති. සතො පස්සසති. දීඝං වා අස්සසන්තො දීඝං අස්සසාමීති පජානාති. දීඝං වා පස්සසන්තො දීඝං පස්සසාමීති පජානාති. රස්සං වා අස්සසන්තො රස්සං අස්සසාමීති පජානාති. රස්සං වා පස්සසන්තො රස්සං පස්සසාමීති පජානාති. සබ්බකායපටිසංවෙදී අස්සසිස්සාමීති සික්ඛති. සබ්බකායපටිසංවෙදී පස්සසිස්සාමීති සික්ඛති. පස්සම්භයං කායසඞ්ඛාරං අස්සසිස්සාමීති සික්ඛති. පස්සම්භයං කායසඞ්ඛාරං පස්සසිස්සාමීති සික්ඛති. පීතිපටිසංවෙදී අස්සසිස්සාමීති සික්ඛති. පීතිපටිසංවෙදී පස්සසිස්සාමීති සික්ඛති. සුඛපටිසංවෙදී අස්සසිස්සාමීති සික්ඛති. සුඛපටිසංවෙදී පස්සසිස්සාමීති සික්ඛති. චිත්තසඞ්ඛාරපටිසංවෙදී අස්සසිස්සාමීති සික්ඛති. චිත්තසඞ්ඛාරපටිසංවෙදී පස්සසිස්සාමීති සික්ඛති. පස්සම්භයං චිත්තසඞ්ඛාරං අස්සසිස්සාමීති සික්ඛති. පස්සම්භයං චිත්තසඞ්ඛාරං පස්සසිස්සාමීති සික්ඛති. චිත්තපටිසංවෙදී අස්සසිස්සාමීති සික්ඛති. චිත්තපටිසංවෙදී පස්සසිස්සාමීති සික්ඛති. අභිප්පමොදයං චිත්තං අස්සසිස්සාමීති සික්ඛති. අභිප්පමොදයං චිත්තං පස්සසිස්සාමීති සික්ඛති. සමාදහං චිත්තං අස්සසිස්සාමීති සික්ඛති. සමාදහං චිත්තං පස්සසිස්සාමීති සික්ඛති. විමොචයං චිත්තං අස්සසිස්සාමීති සික්ඛති. විමොචයං චිත්තං පස්සසිස්සාමීති සික්ඛති. අනිච්චානුපස්සී අස්සසිස්සාමීති සික්ඛති. අනිච්චානුපස්සී පස්සසිස්සාමීති සික්ඛති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ආනපානස්සති - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "10. ආනාපාන සංයුක්තය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "text": "1. එකධම්‌ම වර්ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "එකධම්‌ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3749. **සැවැත්නුවර:**",
                        "type": "unindented"
                    },
                    {
                        "text": "මහණෙනි, එක් දහමෙක් වඩන ලද්දේ බහුල කරන ලද්දේ මහත් ඵල මහානිසංස වේ. කවර එක් දහමෙක් ද යත්: ආනාපානසතිය යි. මහණෙනි, කෙසේ වඩන ලද කෙසේ බහුල කරන ලද ආනාපානසතිය මහත් ඵල මහානිසංස වේ ද යත්: මහණෙනි, මෙසස්නෙහි මහණ අරණකට ගියේ හෝ රුක්මුලකට ගියේ හෝ හිස්ගෙයකට ගියේ හෝ පලක් බැඳ උඩුකය ඉදි කොට පිහිටුවා සිහිය අභිමුඛ කොට එළවා හිඳියි. හේ සිහි ඇතියේ ම ආශ්වාස කෙරෙයි. සිහි ඇතියේ ම ප්‍රශ්වාස කෙරෙයි. දිගු කොට හෝ ආශ්වාස කරනුයේ දිගු කොට ආශ්වාස කෙරෙමි යි දැනගනී. දිගු කොට හෝ ප්‍රශ්වාස කරනුයේ දිගු කොට ප්‍රශ්වාස කෙරෙමි යි දැනගනී. කෙටි කොට හෝ ආශ්වාස කරනුයේ කෙටි කොට ආශ්වාස කෙරෙමි යි දැනගනී. කෙටි කොට හෝ ප්‍රශ්වාස කරනුයේ කෙටි කොට ප්‍රශ්වාස කෙරෙමි යි දැනගනී. සියලු ආශ්වාසප්‍රශ්වාස කය මැනවින් දන්නාසුලු ව ආශ්වාස කරන්නෙමි යි හික්මේ. සියලු ආශ්වාසප්‍රශ්වාස කය මැනවින් දන්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි යි හික්මේ. කායසංස්කාර (ආශ්වාසප්‍රශ්වාස) සංසිඳුවමින් ආශ්වාස කරන්නෙමි යි හික්මේ. කායසංස්කාර සංසිඳුවමින් ප්‍රශ්වාස කරන්නෙමි යි හික්මේ. ප්‍රීතිය මැනවින් දන්නාසුලු ව ආශ්වාස කරන්නෙමියි හික්මේ. ප්‍රීතිය මැනවින් දන්නාසුලු ව ප්‍රශ්වාස කරන්නෙමියි හික්මේ. සුවය මැනවින් දන්නාසුලු ව ආශ්වාස කරන්නෙමියි හික්මේ. සුවය මැනවින් දන්නාසුලු ව ප්‍රශ්වාස කරන්නෙමියි හික්මේ. චිත්තසංස්කාර (ප්‍රීතිසුඛ) මැනවින් දන්නාසුලු ව ආශ්වාස කරන්නෙමියි හික්මේ. චිත්තසංස්කාර මැනවින් දන්නාසුලු ව ප්‍රශ්වාස කරන්නෙමියි හික්මේ. චිත්තසංස්කාර සංසිඳුවමින් ආශ්වාස කරන්නෙමියි හික්මේ. චිත්තසංස්කාර සංසිඳුවමින් ප්‍රශ්වාස කරන්නෙමියි හික්මේ. සිත මැනවින් දන්නාසුලු ව ආශ්වාස කරන්නෙමියි හික්මේ. සිත මැනවින් දන්නාසුලු ව ප්‍රශ්වාස කරන්නෙමියි හික්මේ. සිත වෙසෙසින් සතුටු කරවමින් ආශ්වාස කරන්නෙමියි හික්මේ. සිත වෙසෙසින් සතුටු කරවමින් ප්‍රශ්වාස කරන්නෙමියි හික්මේ. සිත අරමුණෙහි පිහිටුවමින් ආශ්වාස කරන්නෙමියි හික්මේ. සිත අරමුණෙහි පිහිටුවමින් ප්‍රශ්වාස කරන්නෙමියි හික්මේ. සිත මුදවමින් ආශ්වාස කරන්නෙමියි හික්මේ. සිත මුදවමින් ප්‍රශ්වාස කරන්නෙමියි හික්මේ. අනිස අනු ව දක්නාසුලු ව ආශ්වාස කරන්නෙමියි හික්මේ. අනිස අනු ව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමියි හික්මේ. ",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 92,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "විරාගානුපස්සී අස්සසිස්සාමීති සික්ඛති. විරාගානුපස්සී පස්සසිස්සාමීති සික්ඛති. නිරොධානුපස්සී අස්සසිස්සාමීති සික්ඛති. නිරොධානුපස්සී පස්සසිස්සාමීති සික්ඛති. පටිනිස්සග්ගානුපස්සී අස්සසිස්සාමීති සික්ඛති. පටිනිස්සග්ගානුපස්සී පස්සසිස්සාමීති සික්ඛති. එවං භාවිතා ඛො භික්ඛවෙ, ආනාපානසති එවං බහුලීකතා මහප්ඵලා හොති මහානිසංසාති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 2",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බොජ්ඣඞ්ගසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "3750.** සාවත්ථියං:**"
                    },
                    {
                        "type": "paragraph",
                        "text": "ආනාපානසති භික්ඛවෙ, භාවිතා බහුලීකතා මහප්ඵලා හොති මහානිසංසා. කථං භාවිතා ච භික්ඛවෙ, ආනාපානසති කථං බහුලීකතා මහප්ඵලා හොති මහානිසංසා. ඉධ භික්ඛවෙ, භික්ඛු ආනාපානසතිසහගතං සතිසම්බොජ්ඣඞ්ගං භාවෙති විවෙකනිස්සිතං විරාගනිස්සිතං නිරොධනිස්සිතං වොස්සග්ගපරිණාමිං -පෙ- ආනාපානසතිසහගතං උපෙඛා සම්බොජ්ඣඞ්ගං භාවෙති විවෙකනිස්සිතං විරාගනිස්සිතං නිරොධනිස්සිතං වොස්සග්ගපරිණාමිං. එවං භාවිතා ඛො භික්ඛවෙ, ආනාපානසති එවං බහුලීකතා මහප්ඵලා හොති මහානිසංසාති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 3",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සුද්ධකසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "3751. **සාවත්ථියං:**"
                    },
                    {
                        "type": "paragraph",
                        "text": "ආනාපානසති භික්ඛවෙ, භාවිතා බහුලීකතා මහප්ඵලා හොති මහානිසංසා. කථං භාවිතා ච භික්ඛවෙ, ආනාපානසති කථං බහුලීකතා මහප්ඵලා හොති මහානිසංසා: ඉධ භික්ඛවෙ, භික්ඛු අරඤ්ඤගතො වා රුක්ඛමූලගතො වා -පෙ- පටිනිස්සග්ගානුපස්සී අස්සසිස්සාමීති සික්ඛති, පටිනිස්සග්ගානුපස්සී පස්සසිස්සාමීති සික්ඛති. එවං භාවිතා ඛො භික්ඛවෙ, ආනාපානසති එවං බහුලීකතා මහප්ඵලා හොති මහානිසංසාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "විරාගය අනු ව දක්නාසුලු ව ආශ්වාස කරන්නෙමියි හික්මේ. විරාගය අනු ව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි හික්මේ. නිරොධය අනුව දක්නාසුලු ව ආශ්වාස කරන්නෙමියි හික්මේ. නිරොධය අනුව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමියි හික්මේ. නිවන අනුව දක්නාසුලු ව ආශ්වාස කරන්නෙමියි හික්මේ. නිවන අනුව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමියි හික්මේ. මහණෙනි, මෙසේ වඩන ලද මෙසේ බහුල කරන ලද ආනාපානසතිය මහත් ඵල මහානිසංස වේ යි."
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බොජ්‌ඣඞ්‌ග සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3750.** සැවැත්නුවර:**",
                        "type": "unindented"
                    },
                    {
                        "text": "මහණෙනි, වඩන ලද බහුල කරන ලද ආනාපානසතිය මහත් ඵල මහානිසංස වේ. මහණෙනි, කෙසේ වඩන ලද කෙසේ බහුල කරන ලද ආනාපානසතිය මහත් ඵල මහානිසංස වේ ද යත්: මහණෙනි, මෙහි මහණ ආනාපානසිහිය සහගිය සතිසම්බොජ්ඣඞ්ගය විවෙකය ඇසුරු වූවක් විරාගය ඇසුරු වූවක් නිරොධය ඇසුරු වූවක් නිවනට නැමෙනසුල්ලක් කොට වඩයි ... ආනාපානසිහිය සහගිය උපේක්ඛාසම්බොජ්ඣඞ්ගය විවෙකය ඇසුරු වූවක් විරාගය ඇසුරු වූවක් නිරොධය ඇසුරු වූවක් නිවනට නැමෙනසුල්ලක් කොට වඩයි. මහණෙනි, මෙසේ වඩන ලද මෙසේ බහුල කරන ලද ආනාපානසතිය මහත් ඵල මහානිසංස වේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සුද්‌ධික සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3751. **සැවැත්නුවර:**",
                        "type": "unindented"
                    },
                    {
                        "text": "මහණෙනි, වඩන ලද බහුල කරන ලද ආනාපානසතිය මහත් ඵල මහානිසංස වේ. මහණෙනි, කෙසේ වඩන ලද කෙසේ බහුල කරන ලද ආනාපානසතිය මහත් ඵල මහානිසංස වේ ද යත්: මහණෙනි, මෙහි මහණ අරණකට ගියේ හෝ රුක්මුලකට ගියේ හෝ ... නිවන අනුව දක්නාසුලු ව ආශ්වාස කරන්නෙමියි හික්මේ. නිවන අනුව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමියි හික්මේ. මහණෙනි, මෙසේ වඩන ලද මෙසේ බහුල කරන ලද ආනාපානසතිය මහත් ඵල මහානිසංස වේ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 94,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 1. 4",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඵලසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3752. ආනාපානසති භික්ඛවෙ, භාවිතා බහුලීකතා මහප්ඵලා හොති මහානිසංසා. කථං භාවිතා ච භික්ඛවෙ, ආනාපානසති කථං බහුලීකතා මහප්ඵලා හොති මහානිසංසා: ඉධ භික්ඛවෙ, භික්ඛු අරඤ්ඤගතො වා රුක්ඛමූලගතො වා සුඤ්ඤාගාරගතො වා -පෙ- පටිනිස්සග්ගානුපස්සී පස්සසිස්සාමීති සික්ඛති. එවං භාවිතා ඛො භික්ඛවෙ, ආනාපානසති එවං බහුලීකතා මහප්ඵලා හොති මහානිසංසා. එවං භාවිතාය ඛො භික්ඛවෙ, ආනාපානසතියා එවං බහුලීකතාය ද්වින්නං ඵලානං අඤ්ඤතර ඵලං පාටිකඞ්ඛං, දිට්ඨෙව ධම්මෙ අඤ්ඤා, සති වා උපාදිසෙසෙ අනාගාමිතාති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 5",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතිය ඵලසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3753. ආනාපානසති භික්ඛවෙ, භාවිතා බහුලීකතා මහප්ඵලා හොති මහානිසංසා. කථං භාවිතා ච භික්ඛවෙ, ආනාපානසති කථං බහුලීකතා මහප්ඵලා හොති මහානිසංසා: ඉධ භික්ඛවෙ, භික්ඛු අරඤ්ඤගතො වා රුක්ඛමූලගතො වා -පෙ- පටිනිස්සග්ගානුපස්සී පස්සසිස්සාමීති සික්ඛති. එවං භාවිතා ඛො භික්ඛවෙ, ආනාපානසති එවං බහුලීකතා මහප්ඵලා හොති මහානිසංසා. එවං භාවිතාය ඛො භික්ඛවෙ, ආනාපානසතියා එවං බහුලීකතාය සත්තඵලා සත්තානිසංසා පාටිකඞ්ඛා."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමෙ සත්ත ඵලා සත්තානිසංසා: දිට්ඨෙවධම්මෙ පටිගච්ච අඤ්ඤං ආරාධෙති. නො චෙ දිට්ඨෙවධම්මෙ පටිගච්ච අඤ්ඤං ආරාධෙති. අථ මරණකාලෙ අඤ්ඤං ආරාධෙති. නො චෙ දිට්ඨෙවධම්මෙ පටිගච්ච අඤ්ඤං ආරාධෙති. නො චෙ මරණකාලෙ අඤ්ඤං ආරාධෙති. අථ පඤ්චන්නං ඔරම්භාගියානං සංයොජනානං පරික්ඛයා අන්තරා පරිනිබ්බායී හොති. උපහච්ච පරිනිබ්බායී හොති. අසඞ්ඛාරපරිනිබ්බායී හොති. සසඞ්ඛාරපරිනිබ්බායී හොති. උද්ධංසොතො හොති අකනිට්ඨගාමී. එවං භාවිතාය ඛො භික්ඛවෙ, ආනාපානසතියා එවං බහුලීකතාය ඉමෙ සත්තඵලා සත්තානිසංසා පාටිකඞ්ඛාති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 1. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඵල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3752. මහණෙනි, ආනාපානසතිය වඩන ලද්දී බහුල කරන ලද්දී මහත් ඵල මහානිසංස වේ ද යත්: මහණෙනි, මෙහි මහණ අරණකට ගියේ හෝ රුක්මුලකට ගියේ හෝ හිස්ගෙයකට ගියේ හෝ ... නිවන අනුව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමියී හික්මේ. මහණෙනි, ආනාපානසතිය මෙසේ වඩන ලද්දී මෙසේ බහුල කරන ලද්දී මහත් ඵල මහානිසංස වේ. මහණෙනි, ආනාපානසතිය මෙසේ වැඩූ කල්හි මෙසේ බහුල කළ කල්හි ඵල දෙකින් එක්තරා ඵලයන් කැමති විය යුතු. දිටුදැමියෙහි ම රහත් බව හෝ උපාදාන ශෙෂ ව ඇති කල්හි අනගැමි බව හෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතිය ඵල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3753. මහණෙනි, ආනාපානසතිය වඩන ලද්දී බහුල කරන ලද්දී මහත් ඵල මහානිසංස වේ. මහණෙනි, ආනාපානසතිය කෙසේ වඩන ලද්දී කෙසේ බහුල කරන ලද්දී මහත් ඵල මහානිසංස වේ ද යත්: මහණෙනි, මෙසස්නෙහි මහණ අරණකට ගියේ හෝ රුක්මුලකට ගියේ හෝ ... නිවන අනු ව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමියි හික්මේ. මහණෙනි, ආනාපානසතිය මෙසේ වඩන ලද්දී මෙසේ බහුල කරන ලද්දී මහත් ඵල මහානිසංස වේ. මහණෙනි, ආනාපාතසතිය මෙසේ වැඩූ කල්හි මෙසේ බහුල කළ කල්හි සත් පල කෙනෙක් සත් අනුසස් කෙනෙක් කැමති විය යුතුහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "කවර සත්පල කෙනෙක් සත් අනුසස් කෙනෙක් ද යත්: දිටුදැමියෙහි ම පෙරාතුව රහත් බව ලබයි. ඉදින් දිටුදැමියෙහි ම පෙරාතුව රහත් බව නොලබා නම් එකල්හි මරණසමයෙහි රහත් බව ලබයි. ඉදින් දිටුදැමියෙහි ම පෙරාතුව රහත් බව නො ලබා නම් ඉදින් මරණසමයෙහි රහත් බව නො ලබා නම් එකල්හි පස් ඔරම්භාගිය සංයොජනයන් ක්‍ෂය කිරීමෙන් අන්තරාපරිනිබ්බායී වේ. උපහච්චපරිනිබ්බායී වේ. අසඞ්ඛාරපරිනිබ්බායී වේ. සසඞ්ඛාරපරිනිබ්බායී වේ. අකනිට්ඨගාමී උද්ධංසොත වේ. මහණෙනි, ආනාපානසතිය මෙසේ වැඩූ කල්හි මෙසේ බහුල කළ කල්හි මේ සත්පලයෝ මේ සත් අනුසස්හු කැමති විය යුතුහ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 96,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 1. 6",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අරිට්ඨසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "3754. **සාවත්ථියං:**"
                    },
                    {
                        "type": "paragraph",
                        "text": "භාවෙථ නො තුම්හෙ භික්ඛවෙ, ආනාපානසතින්ති. එවං වුත්තෙ ආයස්මා අරිට්ඨො භගවන්තං එතදවොච: “අහං ඛො භන්තෙ, භාවෙමි ආනාපානසතින්ති”. යථා කථං පන ත්වං අරිට්ඨ, භාවෙසි ආනාපානසතින්ති. අතීතෙසු මෙ භන්තෙ, කාමෙසු කාමච්ඡන්දො පහීනො. අනාගතෙසු මෙ කාමෙසු කාමච්ඡන්දො විගතො. අජ්ඣත්තබහිද්ධා{1} ච මෙ ධම්මෙසු පටිඝසඤ්ඤා සුප්පටිවිනීතා. සො සතොව අස්සසාමි{2} සතො පස්සසාමි{3}. එවං ඛො‘හං භන්තෙ, භාවෙමි ආනාපානසතින්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අත්ථෙසා අරිට්ඨ, ආනාපානසති, නෙසා නත්ථීති වදාමි. අපි ච අරිට්ඨ, යථා ආනාපානසති විත්ථාරෙන පරිපුණ්ණා හොති තං සුණාහි -පෙ- කථඤ්ච අරිට්ඨ, ආනාපානසති විත්ථාරතො පරිපුණ්ණා හොති: ඉධ අරිට්ඨ, භික්ඛු අරඤ්ඤගතො වා රුක්ඛමූලගතො වා සුඤ්ඤාගාරගතො වා -පෙ- පටිනිස්සග්ගානුපස්සී පස්සසිස්සාමීති සික්ඛති. එවං ඛො අරිට්ඨ, ආනාපානසති විත්ථාරෙන පරිපුණ්ණා හොතීති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 7",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කප්පිනසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "3755. **සාවත්ථියං:**"
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන ආයස්මා මහාකප්පිනො භගවතො අවිදූරෙ නිසින්නො හොති පල්ලඞ්කං ආභුජිත්වා උජුං කායං පණිධාය පරිමුඛං සතිං උපට්ඨපෙත්වා. අද්දසා ඛො භගවා ආයස්මා මහාකප්පිනං අවිදූරෙ නිසින්නං පල්ලඞ්කං ආභුජිත්වා උජුං කායං පණිධාය පරිමුඛං සතිං උපට්ඨපෙත්වා. දිස්වාන භික්ඛූ ආමන්තෙසි: “පස්සථ නො තුම්හෙ භික්ඛවෙ, එතස්ස භික්ඛුනො කායස්ස ඉඤ්ජිතත්තං වා ඵන්දිතත්තං වා”ති යදා‘පි මයං භන්තෙ, තං ආයස්මන්තං පස්සාම සඞ්ඝමජ්ඣෙ වා නිසින්නං එකං වා රහො නිසින්නං තදා‘පි මයං තස්ස ආයස්මතො න පස්සාම කායස්ස ඉඤ්ජිතත්තං වා ඵන්දිතත්තං වාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අජ්ඣත්තං බහිද්ධා - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අස්සසිස්සාමි - මඡසං, ස්යා, සීමු, අට්ඨකථා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. පස්සිස්සාමි - මඡසං, ස්යා, සීමු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 1. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අරිට්‌ඨ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3754. **සැවැත්නුවර:**",
                        "type": "unindented"
                    },
                    {
                        "text": "මහණෙනි, තෙපි ආනාපානසතිය වඩවු දැයි මෙසේ වදාළ කල්හි ආයුෂ්මත් අරිට්ඨ තෙරණුවෝ භාග්‍යවතුන් වගන්සේට “වහන්ස, මම ආනාපානසතිය වඩමි”යි මෙය සැලකළහ. අරිට්ඨ, තෙපි කෙසේ නම් ආනාපානසතිය වඩවු දැයි. වහන්ස, ඉකුත් කාමයන්හි මාගේ කාමච්ඡන්දය ප්‍රහීණ වූයේ ය. මතු කාමයන්හි මාගේ කාමච්ඡන්දය පහ ව ගියේ ය. ආධ්‍යාත්මිකබාහිර ද්වාදශායතනයන්හි මාගේ ප්‍රතිඝසංඥාව ද සහමුලින් සිඳින ලද්දී ය. ඒ මම සිහි ඇති ව ම ආශ්වාස කරමි. සිහි ඇති ව ම ප්‍රශ්වාස කරමි. වහන්ස, මෙසේ මම ආනාපානසතිය වඩමි යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අරිට්ඨ, මෙබඳු ආනාපානසතියක් ඇත. මෙය නැතැයි නො කියමි. අරිට්ඨ, යම්සේ ආනාපානසතිය විතරවිසින් පිරිපුන් වේ නම් එය අසවු ... අරිට්ඨ, ආනාපානසතිය කෙසේ නම් විතර විසින් පිරිපුන් වේ ද යත්: අරිට්ඨ, මෙහි මහණ අරණකට ගියේ හෝ රුක්මුලකට ගියේ හෝ හිස්ගෙයකට ගියේ හෝ ... නිවන අනුව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමියි හික්මේ. අරිට්ඨ, මෙසේ ආනාපානසතිය විතර විසින් පිරිපුන් වේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කප්‌පින සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3755. **සැවැත්නුවර:**",
                        "type": "unindented"
                    },
                    {
                        "text": "එසමයෙහි ආයුෂ්මත් මහාකප්පින තෙරණුවෝ පලක් බැඳ උඩුකය සෘජු කොට තබා සිහිය අභිමුඛ කොට එළවා ගෙන භාග්‍යවතුන් වගන්සේ නුදුරෙහි වැඩහුන්නාහු වෙති. භාග්‍යවතුන් වහන්සේ පලක් බැඳ උඩුකය සෘජු කොට තබා සිහිය අභිමුඛ කොට එළවා ගෙන නුදුරෙහි වැඩ හුන් ආයුෂ්මත් මහාකප්පින තෙරුන් දුටුසේකි. දැක භික්ෂූන් ඇමතූ සේක: “මහණෙනි, තෙපි මේ මහණහුගේ කයෙහි කම්පනයක් හෝ සැලීමක් හෝ දකිවු දැ”යි. වහන්ස, අපි යම් කලෙක සඟමැද හුන්නාවූ හෝ එකලා ව විවෙකී ව හුන්නා වූ හෝ ඒ ආයුෂ්මතුන් දක්නමෝ නම් එකලදු අපි ඒ ආයුෂ්මතුන්ගේ කයෙහි කම්පනයක් හෝ සැලීමක් හෝ නො දක්නමෝ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 98,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යස්ස භික්ඛවෙ, සමාධිස්ස භාවිතත්තා බහුලීකතත්තා නෙව කායස්ස ඉඤ්ජිතත්තං වා හොති ඵන්දිතත්තං වා. න චිත්තස්ස ඉඤ්ජිතත්තං වා හොති ඵන්දිතත්තං වා, තස්ස සො භික්ඛවෙ, භික්ඛු සමාධිස්ස නිකාමලාභී අකිච්ඡලාභී අකසිරලාභී. කතමස්ස ච භික්ඛවෙ, සමාධිස්ස භාවිතත්තා බහුලීකතත්තා නෙව කායස්ස ඉඤ්ජිතත්තං වා හොති ඵන්දිතත්තං වා, න චිත්තස්ස ඉඤ්ජිතත්තං වා හොති ඵන්දිතත්තං වා: ආනාපානසතිසමාධිස්ස භික්ඛවෙ, භාවිතත්තා බහුලීකතත්තා නෙව කායස්ස ඉඤ්ජිතත්තං වා හොති ඵන්දිතත්තං වා. න චිත්තස්ස ඉඤ්ජිතත්තං වා හොති ඵන්දිතත්තං වා."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථං භාවිතෙ ච භික්ඛවෙ, ආනාපානසතිසමාධිම්හි කථං බහුලීකතෙ නෙව කායස්ස ඉඤ්ජිතත්තං වා හොති ඵන්දිතත්තං වා, න චිත්තස්ස ඉඤ්ජිතත්තං වා හොති ඵන්දිතත්තං වා: ඉධ භික්ඛවෙ, භික්ඛු අරඤ්ඤගතො වා රුක්ඛමූලගතො වා සුඤ්ඤාගාරගතො වා -පෙ- පටිනිස්සග්ගානුපස්සී පස්සසිස්සාමීති සික්ඛති. එවං භාවිතෙ ඛො භික්ඛවෙ, ආනාපානසතිසමාධිම්හි එවං බහුලීකතෙ නෙව කායස්ස ඉඤ්ජිතත්තං වා හොති ඵන්දිතත්තං වා, න චිත්තස්ස ඉඤ්ජිතත්තං වා හොති ඵන්දිතත්තං වාති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 8",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දීපසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "3756. **සාවත්ථියං:**"
                    },
                    {
                        "type": "paragraph",
                        "text": "ආනාපානසතිසමාධි භික්ඛවෙ, භාවිතො බහුලීකතො මහප්ඵලො හොති මහානිසංසො. කථං භාවිතො ච භික්ඛවෙ, ආනාපානසතිසමාධි කථං බහුලීකතො මහප්ඵලො හොති මහානිසංසො: ඉධ භික්ඛවෙ, භික්ඛු අරඤ්ඤගතො වා රුක්ඛමූලගතො වා සුඤ්ඤාගාරගතො වා -පෙ- පටිනිස්සග්ගානුපස්සී පස්සසිස්සාමීති සික්ඛති. එවං භාවිතො ඛො භික්ඛවෙ, ආනාපානසතිසමාධි එවං බහුලීකතො මහප්ඵලො හොති මහානිසංසො. අහම්පි සුදං භික්ඛවෙ, පුබ්බෙව සම්බොධා අනභිසම්බුද්ධො බොධිසත්තොව සමානො ඉමිනා විහාරෙන බහුලං{1} විහරාමි. තස්ස මය්හං භික්ඛවෙ, ඉමිනා විහාරෙන බහුලං විහරතො නෙව කායො කිලමි. න චක්ඛූනි, අනුපාදාය ච මෙ ආසවෙහි චිත්තං විමුච්චි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. බහුං - සී2."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, යම් සමාධියක් වැඩූ බැවින් බහුල කළ බැවින් කයෙහි කම්පනයෙක් හෝ සැලීමෙක් හෝ නො වේ ද, සිතෙහි කම්පනයෙක් හෝ සැලීමෙක් හෝ නො වේ ද, මහණෙනි, ඒ මහණ ඒ සමාධිය කැමැති සේ ලබනසුල්ලෙක් නිදුකින් ලබනසුල්ලෙක් මහත් සේ ලබනසුල්ලෙක් වෙයි. මහණෙනි, කවර සමාධියක් වැඩූ බැවින් බහුල කළ බැවින් කයෙහි කම්පනයෙක් හෝ සැලීමෙක් හෝ නො ම වේ ද යත්: සිතෙහි කම්පනයෙක් හෝ සැලීමක් හෝ නො ම වේ ද යත්: මහණෙනි, ආනාපානසතිසමාධිය වැඩූ බැවින් බහුල කළ බැවින් කයෙහි කම්පනයක් හෝ සැලීමක් හෝ නො ම වෙයි. සිතෙහි කම්පනයක් හෝ සැලීමක් හෝ නො ම වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ආනාපානසතිසමාධිය කෙසේ වැඩූ කල්හි කෙසේ බහුල කළ කල්හි කයෙහි කම්පනයෙක් හෝ සැලීමෙක් හෝ නො ම වේ ද යත්: සිතේ කම්පනයෙක් හෝ සැලීමෙක් හෝ නො ම වේ ද යත්: මහණෙනි, මෙහි මහණ අරනකට ගියේ හෝ රුක්මුලකට ගියේ හෝ හිස්ගෙයකට ගියේ හෝ ... නිවන අනු ව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි යි හික්මෙයි. මහණෙනි, ආනාපානසතිසමාධිය මෙසේ වැඩූ කල්හි මෙසේ බහුල කළ කල්හි කයේ කම්පනයෙක් හෝ සැලීමෙක් හෝ නො ම වේ. සිතේ කම්පනයෙක් හෝ සැලීමෙක් හෝ නො ම වේ යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දීප සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3756. **සැවැත්නුවර:**",
                        "type": "unindented"
                    },
                    {
                        "text": "මහණෙනි, ආනාපානසතිසමාධිය වඩන ලද්දේ බහුල කරන ලද්දේ මහත්ඵල මහානිසංස වේ. මහණෙනි, ආනාපානසති සමාධිය කෙසේ වඩන ලද්දේ කෙසේ බහුල කරන ලද්දේ මහත්ඵල මහානිසංස වේ ද යත්: මහණෙනි, මෙහි මහණ අරනකට ගියේ හෝ රුක්මුලකට ගියේ හෝ හිස්ගෙයකට හියේ හෝ ... නිවන අනු ව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි යි හික්මේ. මහණෙනි, ආනාපානසති සමාධිය මෙසේ වඩන ලද්දේ මෙසේ බහුල කරන ලද්දේ මහත්ඵල මහානිසංස වේ. මහණෙනි, මම් ද සම්බොධියෙන් පෙර බුදුබවට නොපැමිණියෙම් බෝසත් වූයෙම් ම මේ විහරණයෙන් යුතු ව බහුලකොට විසුයෙමි. මහණෙනි, මේ විහරණයෙන් යුතු ව බහුල කොට වෙසෙන ඒ මාගේ කය නො ම ක්ලාන්ත විය. ඇස් නො ම ක්ලාන්ත විය. මාගේ සිත ද උපාදාන රහිත ව ආස්‍රවයන්ගෙන් මිදුණේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 100,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තස්මාතිහ භික්ඛවෙ, භික්ඛුපි{1} ආකඞ්ඛෙය්ය: “නෙව මෙ කායො{2} කිලමෙය්ය න චක්ඛූනි, අනුපාදාය ච මෙ ආසවෙහි චිත්තං විමුච්චෙය්යා”ති, අයමෙව ආනාපානසතිසමාධි සාධුකං මනසිකාතබ්බො. තස්මාතිහ භික්ඛවෙ, භික්ඛුපි ආකඞ්ඛෙය්ය: “යෙ මෙ ගෙහසිතා සරසඞ්කප්පා තෙ පහීයෙය්යුන්ති”. අයමෙව ආනාපානසතිසමාධි සාධුකං මනසිකාතබ්බො. තස්මාතිහ භික්ඛවෙ, භික්ඛුපි ආකඞ්ඛෙය්ය: “අප්පටික්කූලෙ පටික්කූලසඤ්ඤී විහරෙය්යන්ති” අයමෙව ආනාපානසතිසමාධි සාධුකං මනසිකාතබ්බො. තස්මාතිහ භික්ඛවෙ, භික්ඛුපි ආකඞ්ඛෙය්ය: “පටික්කූලෙ අප්පටික්කූලසඤ්ඤී විහරෙය්යන්ති” අයමෙව ආනාපානසතිසමාධි සාධුකං මනසිකාතබ්බො. තස්මාතිහ භික්ඛවෙ, භික්ඛුපි ආකඞ්ඛෙය්ය: “අප්පටික්කූලෙ ච පටික්කූලෙ ච පටික්කූලසඤ්ඤී විහරෙය්යන්ති” අයමෙව -පෙ- තස්මාතිහ භික්ඛවෙ, භික්ඛුපි ආකඞ්ඛෙය්ය: “පටික්කූලෙ ච අප්පටික්කූලෙ ච අප්පටික්කූලසඤ්ඤී විහරෙය්යන්ති” අයමෙව -පෙ- තස්මාතිහ භික්ඛවෙ, භික්ඛුපි ආකඞ්ඛෙය්ය: “අප්පටික්කූලඤ්ච පටික්කූලඤ්ච තදුභයං අභිනිවජ්ජෙත්වා උපෙඛකො විහරෙය්යං සතො සම්පජානොති” අයමෙව -පෙ- "
                    },
                    {
                        "type": "paragraph",
                        "text": "තස්මාතිහ භික්ඛවෙ, භික්ඛුපි ආකඞ්ඛෙය්ය, “විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමජ්ඣානං උපසම්පජ්ජ විහරෙය්යන්ති” අයමෙව -පෙ- තස්මාතිහ භික්ඛවෙ, භික්ඛුපි ආකඞ්ඛෙය්ය: “විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියජ්ඣානං උපසම්පජ්ජ විහරෙය්යන්ති” අයමෙව -පෙ- තස්මාතිහ භික්ඛවෙ, භික්ඛුපි ආකඞ්ඛෙය්ය, “පීතියා ච විරාගා උපෙඛකො ච විහරෙය්යං සතො ච සම්පජානො, සුඛඤ්ච කායෙන පටිසංවෙදෙය්යං යං තං අරියා ආචික්ඛන්ති උපෙඛකො සතිමා සුඛවිහාරීති තතියජ්ඣානං උපසම්පජ්ජ විහරෙය්යන්ති” අයමෙව -පෙ- තස්මාතිහ භික්ඛවෙ, භික්ඛුපි ආකඞ්ඛෙය්ය, “සුඛස්ස ච පහානා දුක්ඛස්ස ච පහානා පුබ්බෙව සොමනස්සදොමනස්සානං අත්ථගමා අදුක්ඛං අසුඛං උපෙඛාසතිපාරිසුද්ධිං චතුත්ථජ්ඣානං උපසම්පජ්ජ විහරෙය්යන්ති” අයමෙව -පෙ-"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. භික්ඛු චෙපි - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. කායොපි - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, එහෙයින් මෙහි ලා මහණ “මාගේ කය නො ම ක්ලාන්ත වන්නේ නම් ඇස් නො ම ක්ලාන්ත වන්නේ නම් මාගේ සිත ද උපාදාන රහිතව ආස්‍රවයන්ගෙන් මිදෙන්නේ නම් මැනවැ”යි කැමති වන්නේ නම් මේ ආනාපානසති සමාධියම මැනවින් මෙනෙහි කළයුතු. මහණෙනි, එහෙයින් මෙහි ලා මහණ, “මාගේ යම් පඤ්චකාමනිශ්‍රිත විතර්කයෝ වෙද්ද ඔහු ප්‍රහීණ වන්නාහු නම් මැනවැ”යි කැමති වන්නේ නම් මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කළයුතු. මහණෙනි, එහෙයින් මෙහි ලා මහණ තෙමේත් “නොපිළිකුලෙහි පිළිකුල් හැඟීම් ඇති ව වෙසෙන්නෙම් නම් මැනවැ”යි කැමති වන්නේ නම් මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කටයුතු. මහණෙනි, එහෙයින් මෙහි ලා මහණ තෙමේත් “පිළිකුලෙහි නො පිළිකුල් හැඟීම් ඇතිව වෙසෙන්නෙම් නම් මැනවැ”යි කැමති වන්නේ නම් මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කටයුතු. මහණෙනි, එහෙයින් මෙහි ලා මහණ තෙමේත් “නොපිළිකුලෙහි ද පිළිකුලෙහි ද පිළිකුල් හැඟීම් ඇති ව වෙසෙන්නෙම් නම් මැනවැ”යි කැමති වන්නේ නම් මේ ... මහණෙනි, එහෙයින් මෙහි ලා මහණ තෙමේත් “පිළිකුලෙහි ද නොපිළිකුලෙහි ද නොපිළිකුල් හැඟීම් ඇති ව වෙසෙන්නෙම් නම් මැනවැ”යි කැමති වන්නේ නම් මේ ... මහණෙනි, එහෙයින් මෙහි ලා මහණ තෙමේත් “නොපිළිකුල ද පිළිකුල ද යන එදෙක දුරු කොට මැදහත් ව සිහි ඇති ව මනාදැනුම් ඇති ව වෙසෙන්නෙම් නම් මැනවැ”යි කැමති වන්නේ නම් මේ ... ",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "මහණෙනි, එහෙයින් මෙහි ලා මහණ “කාමයෙන් වෙන් ව ම අකුසල්දහමින් වෙන් ව විතර්ත සහිත විචාර සහිත විවෙකයෙන් හටගත් ප්‍රීතිය හා සුවය ඇති පළමුවන දැහැනට පැමිණ වෙසෙන්නෙම් නම් මැනවැ”යි කැමති වන්නේ නම් මේ ... මහණෙනි, එහෙයින් මෙහි ලා මහණ තෙමේත් “විතර්ක විචාරයන්ගේ සන්හිඳීමෙන් ඇතුළත පැහැදීම ඇති සිතේ එකඟ බැව් ඇති විතර්ක රහිත විචාර රහිත සමාධියෙන් හටගත් ප්‍රීතිය හා සුවය ඇති දෙවන දැහැනට පැමිණ වෙසෙන්නෙම් නම් මැනවැ”යි කැමති වන්නේ නම් මේ ... මහණෙනි, එහෙයින් මෙහි ලා මහණ තෙමේත් “ප්‍රීතියෙහිද නොඇල්මෙන් මැදහත්ව සිහි ඇති ව මනාදැනුම් ඇති ව කයින් සුවත් විඳින්නෙම් නම් ආර්ය්‍යයෝ යමක් ගැන උපෙක්‍ෂා ඇත්තේ ය, සිහි ඇත්තේ ය. සුවවිහරණ ඇත්තේ ය යි කියද්ද ඒ තෙවන දැහැනට පැමිණ වෙසෙන්නෙම් නම් මැනවැ”යි කැමති වන්නේ නම් මේ ... මහණෙනි, එහෙයින් මෙහි ලා මහණ තෙමේත් “සුවත් දුරු කිරීමෙන් දුකත් දුරුකිරීමෙන් පළමු ම සොම්නස්දොම්නසුන්ගේ අස්තඞ්ගමයෙන් නොදුක් වූ නොසුව වූ මැදහත් බැවින් හා සිහියෙන් හටගත් පිරිසුදු බැව් ඇති සිවුවන දැහැනට පැමිණ වෙසෙන්නෙම් නම් මැනවැ”යි කැමති වන්නේ නම් මේ ..."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 102,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තස්මාතිහ භික්ඛවෙ, භික්ඛුපි ආකඞ්ඛෙය්ය සබ්බසො රූප සඤ්ඤානං සමතික්කමා පටිඝසඤ්ඤානං අත්ථගමා නානත්තසඤ්ඤානංඅමනසිකාරා අනන්තො ආකාසොති ආකාසානඤ්චායතනං උපසම්පජ්ජ විහරෙය්යන්ති, අයමෙව -පෙ- තස්මාතිහ භික්ඛවෙ, භික්ඛුපි ආකඞ්ඛෙය්ය සබ්බසො ආකාසානඤ්චායතනං සමතික්කම්ම අනන්තං විඤ්ඤාණන්ති විඤ්ඤාණඤ්චායතනං උපසම්පජ්ජ විහරෙය්යන්ති අයමෙව -පෙ- තස්මාතිහ භික්ඛවෙ, භික්ඛුපි ආකඞ්ඛෙය්ය සබ්බසො විඤ්ඤාණඤ්චායතනං සමතික්කම්ම නත්ථි කිඤ්චීති ආකිඤ්චඤ්ඤායතනං උපසම්පජ්ජ විහරෙය්යන්ති අයමෙව -පෙ- තස්මාතිහ භික්ඛවෙ, භික්ඛුපි ආකඞ්ඛෙය්ය සබ්බසො ආකිඤ්චඤ්ඤායතනං සමතික්කම්ම නෙවසඤ්ඤානාසඤ්ඤායතනං උපසම්පජ්ජ විහරෙය්යන්ති අයමෙව ආනාපානසතිසමාධි සාධුකං මනසිකාතබ්බො. තස්මාතිහ භික්ඛවෙ, භික්ඛුපි ආකඞ්ඛෙය්ය: “සබ්බසො නෙවසඤ්ඤානාසඤ්ඤායතනං සමතික්කම්ම සඤ්ඤාවෙදයිතනිරොධං උපසම්පජ්ජ විහරෙය්යන්ති, අයමෙව ආනාපානසතිසමාධි සාධුකං මනසි කාතබ්බො."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං භාවිතෙ ඛො භික්ඛවෙ, ආනාපානසතිසමාධිම්හි එවං බහුලීකතෙ සුඛඤ්චෙ වෙදනං වෙදෙති සා අනිච්චාති පජානාති, අනජ්ඣොසිතාති පජානාති, අනභිනන්දිතාති පජානාති. දුක්ඛං චෙ වෙදනං වෙදෙති සා අනිච්චාති පජානාති, අනජ්ඣොසිතාති පජානාති, අනභිනන්දිතාති පජානාති. අදුක්ඛමසුඛඤ්චෙ වෙදනං වෙදෙති, සා අනිච්චාති පජානාති, අනජ්ඣොසිතාති පජානාති, අනභිනන්දිතාති පජානාති. සො සුඛඤ්චෙ වෙදනං වෙදිති, විසංයුත්තො නං වෙදියති. දුක්ඛඤ්චෙ වෙදනං වෙදියති, විසංයුත්තො නං වෙදියති. අදුක්ඛමසුඛඤ්චෙ වෙදනං වෙදියති, විසංයුත්තො නං වෙදියති. සො කායපරියන්තිකං වෙදනං වෙදියමානො කායපරියන්තිකං වෙදනං වෙදියාමීති පජානාති, ජීවිතපරියන්තිකං වෙදනං වෙදියමානො ජීවිතපරියන්තිකං වෙදනං වෙදියාමීති පජානාති. කායස්ස භෙදා උද්ධං ජීවිතපරියාදානා ඉධෙව සබ්බවෙදයිතානි අනභිනන්දිතානි සීතීභවිස්සන්තීති පජානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි භික්ඛවෙ, තෙලඤ්ච පටිච්ච වට්ටිඤ්ච පටිච්ච තෙලප්පදීපො ඣායෙය්ය, තස්සෙව තෙලස්ස ච වට්ටියා ච පරියාදානා අනාහාරො නිබ්බායෙය්ය, එවමෙව ඛො භික්ඛවෙ, භික්ඛු කායපරියන්තිකං වෙදනං වෙදියමානො කායපරියන්තිකං වෙදනං වෙදියාමීති පජානාති. ජීවිතපරියන්තිකං වෙදනං වෙදියමානො ජීවිතපරියන්තිකං වෙදනං වෙදියාමීති පජානාති. කායස්ස භෙදා උද්ධං ජීවිතපරියාදානා ඉධෙව සබ්බවෙදයිතානි අනභිනන්දිතානි සීතීභවිස්සන්තීති පජානාතීති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, එහෙයින් මෙහි ලා මහණ තෙමේත් “රූපසංඥාවන් සර්වප්‍රකාරයෙන් ඉක්මවීමෙන් ප්‍රතිඝසංඥාවන්ගේ අස්තඞ්ගමයෙන් නානාත්වසංඥාවන් නොමෙනෙහි කිරීමෙන් ආකාශය අනන්ත ය යි ආකාසානඤ්චායතනයට පැමිණ වෙසෙන්නෙම් නම් මැනවැ යි කැමති වන්නේ නම් මේ ... මහණෙනි, එහෙයින් මෙහි ලා මහණ තෙමේත් ආකාසානඤ්චායතනය සර්වප්‍රකාරයෙන් ඉක්මවා විඤ්ඤාණය අනන්තය යි විඤ්ඤාණඤ්චායතනයට පැමිණ වෙසෙන්නෙම් නම් මැනවැ යි කැමති වන්නේ නම් මේ ... මහණෙනි, එහෙයින් මෙහි ලා මහණතෙමේත් විඤ්ඤාණඤ්චායතනය සර්වප්‍රකාරයෙන් ඉක්මවා කිසිවක් නැතැ යි ආකිඤ්චඤ්ඤායතනයට පැමිණ වෙසෙන්නෙම් නම් මැනවැ යි කැමති වන්නේ නම් මේ ... මහණෙනි, එහෙයින් මෙහි ලා මහණ තෙමේත් ආකිඤ්චඤ්ඤායතනය සර්වප්‍රකාරයෙන් ඉක්මවා නෙවසඤ්ඤානාසඤ්ඤායතනයට පැමිණ වෙසෙන්නෙම් නම් මැනවැ යි කැමති වන්නේ නම් මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කටයුතු. මහණෙනි, එහෙයින් මෙහි ලා මහණ තෙමේත් නෙවසඤ්ඤානාසඤ්ඤායතනය සර්වප්‍රකාරයෙන් ඉක්මවා සඤ්ඤාවෙදයිතනිරොධයට පැමිණ වෙසෙන්නෙම් නම් මැනවැ යි කැමතිවන්නේ නම් මේ ආනාපානසතිසමාධිය ම මැනවින් මෙනෙහි කටයුතු.",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "මහණෙනි, ආනාපානසතිසමාධිය මෙසේ වැඩූ කල්හි මෙසේ බහුල කළ කල්හි ඉදින් සුවවෙදනාවක් විඳී නම් එය අනිසැ යි දනී. නො බැස ගැන්නා ලදැ යි දනී. තෘෂ්ණා දෘෂ්ටි වශයෙන් පිළිගන්නට නොයුතු ය යි දනී. ඉදින් දුක්වෙදනාවක් විඳී නම් එය අනිසැ යි දනී. නො බැස ගැන්නා තෘෂ්ණා දෘෂ්ටි වශයෙන් පිළිගන්නට නොයුතු ය යි දනී. ඉදින් නොදුක්නොසුව වෙදනාවක් විඳී නම් එය අනිසැ යි දනී. නො බැස ගැන්නා ලදැ යි දනී. පිළිගන්නට නොයුතු යයි දනී. ඉදින් හෙතෙමේ සුවවෙදනාවක් විඳී නම් (රාගානුසයාදියෙන්) වෙන් ව එය විඳී. ඉදින් දුක්වෙදනාවක් විඳී නම් වෙන් ව එය විඳී. ඉදින් නොදුක්නොසුවවෙදනාවක් විඳී නම් වෙන් ව එය විඳී. හෙතෙමේ කය කෙළවර කොට ඇති වෙදනාවක් විඳින්නේ කය කෙළවර කොට ඇති වෙදනාවක් විඳිමි යි දනී. දිවි කෙළවර කොට ඇති වෙදනාවක් විඳින්නේ දිවි කෙළවර කොට ඇති වෙදනාවක් විඳිමි යි දනී. කය බිඳීමෙන් දිවි ගෙවීමෙන් මතු සියලු වෙදනාවෝ නොපිළිගන්නා ලද්දාහු මෙහි ම ලිහිල් වූවෝ වන්නාහ යි දනී. "
                    },
                    {
                        "type": "paragraph",
                        "text": "මහණෙනි, යම්සේ තෙලත් නිසා වැටියත් නිසා තෙල්පහන දැල්වෙන්නේ ද, එ ම තෙලත් වැටියත් ගෙවීමෙන් ප්‍රත්‍යය රහිත ව නිවෙන්නේ ද මහණෙනි, එසෙයින් ම මහණ තෙමේ කය කෙළවර කොට ඇති වෙදනාවක් විඳින්නේ කය කෙළවර කොට ඇති වෙදනාවක් විඳිමියි දනී. දිවි කෙළවර කොට ඇති වෙදනාවක් විඳින්නේ දිවි කෙළවර කොට ඇති වෙදනාවක් විඳිමි යි දනී. කය බිඳීමෙන් දිවි ගෙවීමෙන් මතු සියලු වෙදනාවෝ නො පිළිගන්නා ලද්දාහු මෙහි ම ලිහිල් වූවෝ වන්නාහ යි දනී යි."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 104,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 1. 9",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අසුභසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3757. එකං සමයං භගවා වෙසාලියං විහරති මහාවනෙ කූටාගාරසාලායං. තෙන ඛො පන සමයෙන භගවා භික්ඛූනං අනෙකපරියායෙන අසුභකථං කථෙති, අසුභාය වණ්ණං භාසති, අසුභභාවනාය වණ්ණං භාසති. අථ ඛො භගවා භික්ඛූ ආමන්තෙසි: “ඉච්ඡාමහං භික්ඛවෙ, අද්ධමාසං පතිසල්ලීයිතුං. නම්හි කෙනචි උපසඞ්කමිතබ්බො, අඤ්ඤත්ර එකෙන පිණ්ඩපාතනීහාරකෙනා”ති. එවං භන්තෙති ඛො තෙ භික්ඛූ භගවතො පටිස්සුත්වා නාස්සුධ කොචි භගවන්තං උපසඞ්කමති, අඤ්ඤත්ර එකෙන පිණ්ඩපාතනීහාරකෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො තෙ භික්ඛූ, භගවා අනෙකපරියායෙන අසුභකථං කථෙති, අසුභාය වණ්ණං භාසති, අසුභභාවනාය වණ්ණං භාසතීති අනෙකාකාරවොකාරං අසුභභාවනානුයොගමනුයුත්තා විහරන්ති. තෙ ඉමිනා කායෙන අට්ටීයමානා{1} හරායමානා ජිගුච්ඡමානා සත්ථහාරකං පරියෙසන්ති. දස‘පි භික්ඛූ එකාහෙන සත්ථං ආහරන්ති, වීසතිම්පි භික්ඛූ එකාහෙන සත්ථං ආහරන්ති. තිංසම්පි භික්ඛූ එකාහෙන සත්ථං ආහරන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා තස්ස අද්ධමාසස්ස අච්චයෙන පටිසල්ලානා වුට්ඨිතො ආයස්මන්තං ආනන්දං ආමන්තෙසි: “කින්නු ඛො ආනන්ද, තනුභූතො විය භික්ඛුසඞ්ඝො”ති. තථාහි පන භන්තෙ, භගවා භික්ඛූනං අනෙකපරියායෙන අසුභකථං කථෙති, අසුභාය වණ්ණං භාසති, අසුභභාවනාය වණ්ණං භාසති. තෙච භන්තෙ, භික්ඛු: “භගවා ඛො අනෙකපරියායෙන අසුභකථං කථෙති, අසුභාය වණ්ණං භාසති, අසුභභාවනාය වණ්ණං භාසතී‘ති අනෙකාකාරවොකාරං අසුභභාවනානුයොගමනුයුත්තා විහරන්ති. තෙ ඉමිනා කායෙන අට්ටීයමානා හරායමානා ජිගුච්ඡමානා සත්ථහාරකං පරියෙසන්ති. දස‘පි භික්ඛූ එකාහෙන සත්ථං ආහරන්ති, වීසතිම්පි භික්ඛූ එකාහෙන සත්ථං ආහරන්ති. තිංසම්පි භික්ඛූ එකාහෙන සත්ථං ආහරන්ති. සාධු භන්තෙ, භගවා පරියායං{2} ආචික්ඛතු යථා‘යං භික්ඛුසඞ්ඝො අඤ්ඤාය සණ්ඨහෙය්යා”ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අට්ටියමානා - සීමු, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අඤ්ඤං පරියායං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 1. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අසුභ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3757. එක් කලෙක භාග්‍යවතුන් වහන්සේ විසල්පුර සමීපයෙහි මහවෙනෙහි කුළුගේහල්හි වැඩවසන සේක. එකල්හි භාග්‍යවතුන් වහන්සේ නන් අයුරෙන් භික්ෂූන්ට අසුභකථා වදාරන සේක. අසුභයෙහි ගුණ කියන සේක, අසුභභාවනාවෙහි ගුණ කියන සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ භික්ෂූන් ඇමතූ සේක. “මහණෙනි, මම අඩමසක් එකලා ව වෙසෙන්නට කැමති වෙමි. පිණ්ඩාපාතය රැගෙන එන එකකු හැර අන් කිසිවකු විසින් නො එළඹිය යුත්තෙම් වෙමි”යි. එසේ ය වහන්සැ’යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දී පිණ්ඩපාතය රැගෙන එන එක් මහණකු හැර අන් කිසිවෙක් භාග්‍යවතුන් වහන්සේ වෙත නො එළඹිණ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එකල්හි ඒ භික්ෂූහු, භාග්‍යවතුන් වහන්සේ නන් අයුරෙන් අසුභකථා වදාරන සේක, අසුභයෙහි ගුණ කියන සේක, අසුභ භාවනාවෙහි ගුණ කියන සේකැ යි නොයෙක් කරුණෙන් ගැවසී ගත් අසුභභාවනාවෙහි යෙදුණාහු වෙසෙත්. ඔහු මේකයින් පීඩිතවන්නාහු ලජ්ජිත වන්නාහු පිළිකුල් උපදවන්නාහු දිවි ගැලවීමෙහි සමත් අවි සොයත්. දස මහණ කෙනෙක් ද එක්දවසින් දිවි ගලවත්. විසි මහණ කෙනෙක් ද එක්දවසින් දිවි ගලවත්. තිස් මහණ කෙනෙක් ද එක්දවසින් අවි ගනිත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ ඒ අඩමස ඇවෑමෙන් විවෙකයෙන් නැඟීසිටි සේක් ආයුෂ්මත් අනඳ තෙරුන් ඇමතූසේක: “ආනන්ද, කුමක් හෙයින් බික්සඟන තුනී වූවාක් මෙන් වේ දැ”යි. වහන්ස, ඒ එසේම ය. භාග්‍යවතුන් වහන්සේ භික්ෂූන්ට නන් අයුරෙන් අශුභකථා වදාරන සේක, අශුභයෙහි ගුණ වණන සේක, අශුභභාවනාවෙහි ගුණ වණන සේක. වහන්ස, ඒ භික්ෂූහු ද ‘භාග්‍යවතුන් වහන්සේ නන් අයුරින් අශුභකථා වදාරන සේක, අශුභයෙහි ගුණ වණන සේක, අශුභභාවනාවෙහි ගුණ වණන සේකැ’යි නොයෙක් කරුණෙන් ගැවසුණු අශුභභාවනාවෙහි යෙදුණාහු වෙසෙත්. ඔහු මෙකයින් පීඩිත වන්නාහු ලජ්ජිත වන්නාහු පිළිකුල උපදවන්නාහු දිවි ගැලවීමෙහි සමත් අවි සොයත්. දස මහණ කෙනෙක් දු එක්දවසින් අවි ගනිත්. විසි මහණ කෙනෙක් දු එක් දවසින් අවි ගනිත්. තිස් මහණ කෙනෙක් දු එක් දවසින් දිවි ගලවත්. වහන්ස, යමසේ මේ භික්‍ෂු සඞ්ඝයා රහත් බැව්හි පිහිටන්නේ නම් භාග්‍යවතුන් වහන්සේ එබඳු නයක් වදාරන සේක් නම් මැනවි”යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 106,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තෙනහානන්ද, යාවතිකා භික්ඛූ වෙසාලිං උපනිස්සාය විහරන්ති, තෙ සබ්බෙ උපට්ඨානසාලායං සන්නිපාතෙහීති. එවං භන්තෙති ඛො ආයස්මා ආනන්දො භගවතො පටිස්සුත්වා යාවතිකා භික්ඛූ වෙසාලිං උපනිස්සාය විහරන්ති, තෙ සබ්බෙ උපට්ඨානසාලායං සන්නිපාතෙත්වා යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං එතදවොච: “සන්නිපතිතො{1} භන්තෙ, භික්ඛුසඞ්ඝො යස්සදානි භන්තෙ, භගවා කාලං මඤ්ඤතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා යෙන උපට්ඨානසාලා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදි. නිසජ්ජ ඛො භගවා භික්ඛූ ආමන්තෙසි: “අයම්පි ඛො භික්ඛවෙ, ආනාපානසතිසමාධි භාවිතො බහුලීකතො සන්තො චෙව පණීතො ච අසෙචනකො ච සුඛො ච විහාරො උප්පන්නුප්පන්නෙ ච පාපකෙ අකුසලෙ ධම්මෙ ඨානසො අන්තරධාපෙති වූපසමෙති. සෙය්යථාපි භික්ඛවෙ, ගිම්හානං පච්ඡිමෙ මාසෙ ඌහතං රජොජල්ලං, තමෙනං මහාඅකාලමෙඝො ඨානසො අන්තරධාපෙති, වූපසමෙති, එවමෙව ඛො භික්ඛවෙ, ආනාපානසතිසමාධි භාවිතො බහුලීකතො සන්තො චෙව පණීතො ච අසෙචනකො ච සුඛො ච විහාරො උප්පන්නුප්පන්නො ච පාපකෙ අකුසලෙ ධම්මෙ ඨානසො අන්තරධාපෙති වූපසමෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථං භාවිතො භික්ඛවෙ, ආනාපානසතිසමාධි කථං බහුලීකතො, සන්තො චෙව පණීතො ච අසෙචනකො ච සුඛො ච විහාරො, උප්පන්නුප්පන්නෙ ච පාපකෙ අකුසලෙ ධම්මෙ ඨානසො අන්තරධාපෙති වූපසමෙති: ඉධ භික්ඛවෙ, භික්ඛු අරඤ්ඤගතො වා රුක්ඛමූලගතො වා සුඤ්ඤාගාරගතො වා -පෙ- පටිනිස්සග්ගානුපස්සී පස්සසිස්සාමීති සික්ඛති. එවං භාවිතො ඛො භික්ඛවෙ, ආනාපානසතිසමාධි එවං බහුලීකතො සන්තො චෙව පණීතො ච අසෙචනකො ච සුඛො ච විහාරො උප්පන්නුප්පන්නෙ ච පාපකෙ අකුසලෙ ධම්මෙ ඨානසො අන්තරධාපෙති, වූපසමෙතීති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කිම්බිලසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3758. එකං සමයං භගවා කිම්බිලායං{2} විහරති වෙළුවනෙ. තත්ර ඛො භගවා ආයස්මන්තං කිම්බිලං ආමන්තෙසි: “කථං භාවිතො ඛො කිම්බිල, ආනාපානසතිසමාධි කථං බහුලීකතො මහප්ඵලො හොති මහානිසංසොති. එවං වුත්තෙ ආයස්මා කිම්බිලො තුණ්හී අහොසි. දුතියම්පි ඛො භගවා ආයස්මන්තං කිම්බිලං ආමන්තෙසි -පෙ- තතිය තා ඛො භගවා ආයස්මන්තං කිම්බිලං ආමන්තෙසි: “කථං භාවිමෙපි ඛො, කිම්බිල, ආනාපානසතිසමාධි කථං බහුලීකතො මහප්ඵලො හොති මහානිසංසො”ති. තතියම්පි ඛො ආයස්මා කිම්බිලො තුණ්හී අහොසි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සන්නිපාතිතො - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "2. කිමිලායං - මඡසං, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "ආනන්ද, එසේ වී නම් යම් තාක් භික්ෂූහු විසල්පුර ඇසුරු කොට වෙසෙත් ද ඒ සියල්ලන් උවටැන්හලෙහි රැස්කරව යි. එසේ ය වහන්සැ යි ආයුෂ්මත් අනඳ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට පිළිතුරුදී යම් තාක් භික්ෂූහු විසල්පුර ඇසුරු කොට වෙසෙත් නම් ඒ සියල්ලන් උවටැන්හලෙහි රැස් කරවා භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඔ භාග්‍යවතුන් වහන්සේට මෙය සැල කළහ; “වහන්ස, බික් සඟන තෙමේ රැස් වූයේ ය. වහන්ස, භාග්‍යවතුන් වහන්සේ දැන් යමකට කල් දන්නා සේක් නම් මැනවැ”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එකල්හි භාග්‍යවතුන් වහන්සේ උවටැන් හල වෙත එළඹි සේක. එළඹ පැන වූ අස්නෙහි වැඩහුන් සේක. වැඩහිඳ භාග්‍යවතුන් වහන්සේ භික්ෂූන් ඇමතූ සේක: “මහණෙනි, මේ ආනාපානසති සමාධිය ද වඩන ලද්දේ ශාන්ත ද ප්‍රණීත ද පියවින් මිහිරි ද සුවවිහරණයෙක් ද වේ. උපනුපන් ලාමක අකුසල්දහම් ද සැණෙකින් අතුරුදන් කෙරෙයි, සන්හිඳුවයි. මහණෙනි, යම්සේ ගිමන් සෙමෙහි පැසුළු (=ඇසළ) මස උඩ නැඟි රජස්දැලි වේ ද එය මහා අකල් වැස්ස සැණෙකින් අතුරුදන් කෙරෙයි, සන්හිඳුවයි. මහණෙනි, එසෙයින් ම ආනාපානසති සමාධිය වඩන ලද්දේ බහුල කරන ලද්දේ ශාන්ත ද ප්‍රණීත ද පියවින් මිහිරි ද සුව විහරණයෙක් ද වේ. උපනුපන් ලාමක අකුසල් දහමුදු සැණෙකින් අතුරුදන් කෙරෙයි සන්හිඳුවයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, ආනාපානසති සමාධිය කෙසේ වඩන ලද්දේ කෙසේ බහුල කරන ලද්දේ ශාන්ත ද ප්‍රණීත ද පියවින් මිහිරි ද සුවවිහරණයෙක් ද වී උපනුපන් ලාමක අකුසල්දහමුදු සැණෙකින් අතුරුදන් කෙරේ ද, සන්හිඳුවා ද යත්: “මහණෙනි, මෙසස්නෙහි මහණ අරනකට ගියේ හෝ රුක්මුලකට ගියේ හෝ හිස්ගෙයකට ගියේ හෝ ... නිවන අනු ව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙ”මි යි හික්මෙයි. මහණෙනි, ආනාපානසති සමාධිය මෙසේ වඩන ලද්දේ මෙසේ පුනපුනා කරන ලද්දේ ශාන්තත් ප්‍රණීතත් පියවින් මිහිරිත් සුවවිහරණත් වෙයි. උපනුපන් ලාමක අකුසල්දහමුදු සැණෙකින් අතුරුදන් කෙරෙයි, සන්හිඳුවා යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 1. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කිම්බිල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3758. එක්සමයෙක භාග්‍යවතුන් වහන්සේ කිම්බිලානුවර සමීපයෙහි වේළුවනයෙහි වැඩවසන සේක. එහිදී භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් කිම්බිල තෙරුන් ඇමතූ සේක: “කිම්බිල, කෙසේ වඩන ලද කෙසේ පුනපුනා කරන ලද ආනාපානසතිසමාධිය මහත්ඵල මහානිසංස වේ දැ”යි, මෙසේ වදාළ කල්හි ආයුෂ්මත් කිම්බිල තෙරණුවෝ නිහඬ වූහ. දෙවන වට දු භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් කිම්බිල තෙරුන් ඇමතූ සේක ... දෙවන වට දු ආයුෂ්මත් කිම්බිල තෙරණුවෝ නිහඬ වූහ. තෙවන වට දු භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් කිම්බිල තෙරුන් ඇමතූ සේක: “කිම්බිල, කෙසේ වඩන ලද කෙසේ බහුල කරන ලද ආනාපානසති සමාධිය මහත්ඵල මහානිසංස වේ දැ”යි. තෙවන වට දු ආයුෂ්මත් කිම්බිල තෙරණුවෝ නිහඬ වූහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 108,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එවං වුත්තෙ ආයස්මා ආනන්දො භගවන්තං එතදවොච: “එතස්ස භගවා කාලො, එතස්ස සුගත, කාලො, යං භගවා ආනාපානසතිසමාධිං භාසෙය්ය. භගවතො සුත්වා භික්ඛූ ධාරෙස්සන්තී”ති. තෙනහානන්ද, සුණාහි, සාධුකං මනසිකරොහි, භාසිස්සාමීති. එවං භන්තෙති ඛො ආයස්මා ආනන්දො භගවතො පච්චස්සොසි. භගවා එතදවොච: “කථං භාවිතො ච ආනන්ද, ආනාපානසතිසමාධි කථං බහුලීකතො මහප්ඵලො හොති මහානිසංසො: ඉධානන්ද, භික්ඛු අරඤ්ඤගතො වා රුක්ඛමූලගතො වා සුඤ්ඤාගාරගතො වා -පෙ- පටිනිස්සග්ගානුපස්සී පස්සසිස්සාමීති සික්ඛති. එවං භාවිතො ඛො ආනන්ද, ආනාපානසතිසමාධි එවං බහුලීකතො මහප්ඵලො හොති මහානිසංසො."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ ආනන්ද, භික්ඛු දීඝං වා අස්සසන්තො දීඝං අස්සසාමීති පජානාති, දීඝං වා පස්සසන්තො දීඝං පස්සසාමීති පජානාති, රස්සං වා අස්සසන්තො රස්සං අස්සසාමීති පජානාති, රස්සං වා පස්සසන්තො රස්සං පස්සසාමීති පජානාති, සබ්බකායපටිසංවෙදී අස්සසිස්සාමීති සික්ඛති, සබ්බකායපටිසංවෙදී පස්සසිස්සාමීති සික්ඛති, පස්සම්භයං කායසඞ්ඛාරං අස්සසිස්සාමීති සික්ඛති, පස්සම්භයං කායසඞ්ඛාරං පස්සසිස්සාමීති සික්ඛති, කායෙ කායානුපස්සී ආනන්ද, භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තං කිස්ස හෙතු: කායඤ්ඤතරාහං ආනන්ද, එතං වදාමි යදිදං අස්සාසපස්සාසං. තස්මාතිහානන්ද, කායෙ කායානුපස්සී භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ ආනන්ද, භික්ඛු පීතිපටිසංවෙදී අස්සසිස්සාමීති සික්ඛති, පීතිපටිසංවෙදී පස්සසිස්සාමීති සික්ඛති. සුඛපටිසංවෙදී අස්සසිස්සාමීති සික්ඛති, සුඛපටිසංවෙදී පස්සසිස්සාමීති සික්ඛති, චිත්තසඞ්ඛාරපටිසංවෙදී අස්සසිස්සාමීති සික්ඛති, චිත්තසඞ්ඛාරපටිසංවෙදී පස්සසිස්සාමීති සික්ඛති, පස්සම්භයං චිත්තසඞ්ඛාරං අස්සසිස්සාමීති සික්ඛති, පස්සම්භයං චිත්තසඞ්ඛාරං පස්සසිස්සාමීති සික්ඛති, වෙදනාසු වෙදනානුපස්සී ආනන්ද, භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තං කිස්ස හෙතු: වෙදනඤ්ඤතරාහං ආනන්ද, එතං වදාමි යදිදං අස්සාසපස්සාසානං සාධුකං මනසිකාරං. තස්මාතිහානන්ද, වෙදනාසු වෙදනානුපස්සී භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මෙසේ වදාළ කල්හි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැල කළහ: “යම් හෙයකින් භාග්‍යවතුන් වහන්සේ ආනාපානසතිසමාධිය වදාරන සේක් නම් භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු දරන්නාහු නම් භාග්‍යවතුන් වහන්ස, එයට කාලය යි, සුගතයන් වහන්ස, එයට කාලය”යි. ආනන්ද, එසේ නම් අසව, මැනවින් මෙනෙහි කරව, කියන්නෙමි යි. වහන්ස, එසේ ය යි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වූහ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “ආනන්ද, කෙසේ වඩන ලද කෙසේ පුනපුනා කරන ලද ආනාපානසතිසමාධිය මහත්ඵල මහානිසංස වේ ද යත්: ආනන්ද මෙසස්නෙහි මහණ අරනකට ගියේ හෝ රුක්මුලකට ගියේ හෝ හිස් ගෙයකට ගියේ හෝ ... නිවන අනු ව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි යි හික්මෙයි. ආනන්ද, මෙසේ වඩන ලද මෙසේ පුනපුනා කරන ලද ආනාපානසතිසමාධිය මහත්ඵල මහානිසංස වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්ද, යම් කලෙක මහණ දිගු කොට ආශ්වාස කරනුයේ දිගු කොට ආශ්වාස කෙරෙමි යි දනී ද, දිගු කොට ප්‍රශ්වාස කරනුයේ දිගු කොට ප්‍රශ්වාස කෙරෙමි යි දනී ද, ලුහුඬු කොට ආශ්වාස කරනුයේ ලුහුඬු කොට ආශ්වාස කෙරෙමි යි දනී ද, ලුහුඬු කොට ප්‍රශ්වාස කරනුයේ ලුහුඬු කොට ප්‍රශ්වාස කෙරෙමි යි දනී ද, සියලු ආශ්වාසප්‍රශ්වාස කය දන්නාසුලු ව ආශ්වාස කරන්නෙමි යි හික්මේ ද, සියලු ආශ්වාසප්‍රශ්වාස කය දන්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, කායසංස්කාර සන්හිඳුවමින් ආශ්වාස කරන්නෙමි යි හික්මේ ද, කායසංස්කාර සන්හිඳුවමින් ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, ආනන්ද, මහණ තෙමේ එසමයෙහි කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇතිව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. ඒ කවර හෙයින යත්: ආනන්ද, යම් ඒ අස්සාස පස්සාස වේ නම් මෙය (වායොකාය නම් වූ) එක්තරා කයෙකැ යි මම කියමි. ආනන්ද, එහෙයින් මෙහි ලා එසමයෙහි මහණ කයෙහි කය අනු ව, දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්ද, යම් සමයෙක මහණ ප්‍රීතිය දන්නාසුලු ව ආශ්වාස කරන්නෙමි යි හික්මේ ද, ප්‍රීතිය දන්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, සුවය දන්නාසුලු ව ආශ්වාස කරන්නෙමි යි හික්මේ ද, සුවය දන්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, චිත්තසංස්කාර දන්නාසුලු ව ආශ්වාස කරන්නෙමි යි හික්මේ ද, චිත්තසංස්කාර දන්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, චිත්තසංස්කාර සන්හිඳුවමින් ආශ්වාස කරන්නෙමි යි හික්මේ ද, චිත්තසංස්කාර සන්හිඳුවමින් ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද ආනන්ද, එසමයෙහි මහණ වෙදනාවන්හි වෙදනා අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව විඳුම් ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. ඒ කවර හෙයින යත්: ආනන්ද, ආශ්වාසප්‍රශ්වාසයන්ගේ යම් ඒ මැනවින් මෙනෙහි කිරීමෙක් වේ ද, මෙය සුව වෙදනා නම් වූ එක්තරා වෙදනාවකැ යි මම කියමි. ආනන්ද, එහෙයින් මෙහි ලා මහණ එසමයෙහි වෙදනාවන්හි වෙදනා අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව විඳුම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 110,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ ආනන්ද, භික්ඛු චිත්තපටිසංවෙදී අස්සසිස්සාමීති සික්ඛති, චිත්තපටිසංවෙදී පස්සසිස්සාමීති සික්ඛති, අභිප්පමොදයං චිත්තං අස්සසිස්සාමීති සික්ඛති, අභිප්පමොදයං චිත්තං පස්සසිස්සාමීති සික්ඛති, සමාදහං චිත්තං අස්සසිස්සාමීති සික්ඛති, සමාදහං චිත්තං පස්සසිස්සාමීති සික්ඛති, විමොචයං චිත්තං අස්සසිස්සාමීති සික්ඛති, විමොචයං චිත්තං පස්සසිස්සාමීති සික්ඛති, චිත්තෙ චිත්තානුපස්සී ආනන්ද, භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තං කිස්ස හෙතු: නාහං ආනන්ද, මුට්ඨස්සතිස්ස අසම්පජානස්ස ආනාපානසතිසමාධිභාවනං වදාමි. තස්මාතිහානන්ද, චිත්තෙ චිත්තානුපස්සී භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ ආනන්ද, භික්ඛු අනිච්චානුපස්සී අස්සසිස්සාමීති සික්ඛති, අනිච්චානුපස්සී පස්සසිස්සාමීති සික්ඛති, විරාගානුපස්සී අස්සසිස්සාමීති සික්ඛති, විරාගානුපස්සී පස්සසිස්සාමීති සික්ඛති, නිරොධානුපස්සී අස්සසිස්සාමීති සික්ඛති, නිරොධානුපස්සී පස්සසිස්සාමීති සික්ඛති, පටිනිස්සග්ගානුපස්සී අස්සසිස්සාමීති සික්ඛති, පටිනිස්සග්ගානුපස්සී පස්සසිස්සාමීති සික්ඛති, ධම්මෙසු ධම්මානුපස්සී ආනන්ද, භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. සො යං තං හොති අභිජ්ඣාදොමනස්සානං පහානං තං පඤ්ඤාය දිස්වා දිස්සා සාධුකං අජ්ඣුපෙක්ඛිතා හොති. තස්මාතිහානන්ද, ධම්මෙසු ධම්මානුපස්සී භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි ආනන්ද, චාතුම්මහාපථෙ{1} මහාපංසුපුඤ්ජො. පුරත්ථිමාය චෙපි දිසාය ආගච්ඡෙය්ය සකටං වා රථො වා, උපහනතෙව තං පංසුපුඤ්ජං. පච්ඡිමාය චෙ‘පි දිසාය -පෙ- උත්තරාය චෙ‘පි දිසාය -පෙ- දක්ඛිණාය චෙ‘පි දිසාය ආගච්ඡෙය්ය සකටං වා රථො වා උපහනතෙව තං පංසුපුඤ්ජං. එවමෙව ඛො ආනන්ද, භික්ඛු කායෙ කායානුපස්සී විහරන්තො‘පි උපහනතෙව පාපකෙ අකුසලෙ ධම්මෙ, වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරන්තො‘පි උපහනතෙව පාපකෙ අකුසලෙ ධම්මෙති."
                    },
                    {
                        "type": "centered",
                        "text": "එකධම්මවග්ගො පඨමො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රැද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "එකධම්මො ච බොජ්ඣඞ්ගො සුද්ධකඤ්ච දුවෙ ඵලා,\nඅරිට්ඨො කප්පිනො දීපො, අසුභං කිම්බිලෙන චාති.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. චාතුමහාපථෙ - මඡසං, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "ආනන්ද, යම් සමයෙක මහණ සිත දන්නාසුලු ව ආශ්වාස කරන්නෙමි යි හික්මේ ද, සිත දන්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, සිත සතුටු කරවමින් ආශ්වාස කරන්නෙමි යි හික්මේ ද, සිත සතුටු කරවමින් ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, සිත එකඟ කරමින් ආශ්වාස කරන්නෙමි යි හික්මේ ද, සිත එකඟ කරමින් ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, සිත මුදවමින් ආශ්වාස කරන්නෙමි යි හික්මේ ද, සිත මුදවමින් ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, ආනන්ද, එසමයෙහි මහණ සිත්හි සිත අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව සිත්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. ඒ කවර හෙයින යත්: ආනන්ද, මුළා සිහි ඇති මනාදැනුම් නැත්තහුට ආනාපානසතිසමාධිහාවනාවක් මම නො කියමි. ආනන්ද, එහෙයින් මෙහි ලා මහණ එසමයෙහි සිත්හි සිත අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව සිත්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්ද, යම් සමයෙක මහණ අනිස අනු ව දක්නාසුලු ව ආශ්වාස කරන්නෙමි යි හික්මේ ද, අනිස අනු ව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, විරාගය අනු ව දක්නාසුලු ව ආශ්වාස කරන්නෙමි යි හික්මේ ද, විරාගය අනු ව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, නිරොධය අනුව දක්නාසුලු ව ආශ්වාස කරන්නෙමි යි හික්මේ ද, නිරොධය අනු ව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, නිවන අනු ව දක්නාසුලු ව ආශ්වාස කරන්නෙමියි හික්මේ ද නිවන අනු ව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, ආනන්ද, එසමයෙහි මහණ දහම්හි දහම් අනු ව දක්නාසුලුව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. දැඩිලොබ හා දොම්නස පිළිබඳ යම් ඒ ප්‍රහාණයෙක් වේ නම් හෙතෙමේ එය නුවණින් දැක දැක මැනවින් මැදහත්ව දක්නාසුලු වෙයි. ආනන්ද, එහෙයින් මෙහි ලා මහණ එසමයෙහි දහම්හි දහම් අනු ව දක්නාසුලුව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්ද, යම්සේ සිවුමංසලක මහපස්පිඬෙක් වේ ද, ඉදින් පෙරදිගිනුදු ගැලෙක් හෝ රියෙක් හෝ එන්නේ නම් ඒ පස්පිඬ නසා ම ය. ඉදින් පැළදිගිනුදු ... ඉදින් උතුරුදිගිනුදු ... ඉදින් දකුණුදිගිනුදු ගැලෙක් හෝ රියෙක් හෝ එන්නේ නම් ඒ පස්පිඬ නසා ම ය. ආනන්ද, එසෙයින් ම මහණ කයෙහි කය අනු ව දක්නාසුලු ව වෙසෙන්නේ ද ලාමක අකුසල් දහම් නසා ම ය. විඳුම්හි ... සිත්හි ... දහම්හි දහම් අනු ව දක්නාසුලු ව වෙසෙන්නේ ද, ලාමක අකුසල් දහම් නසා මැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පළමුවැනි එකධම්මවර්ග යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි සූත්‍රනාමාවලිය:**",
                        "type": "unindented"
                    },
                    {
                        "text": "එකධම්ම, බොජ්ඣඞ්ග, සුද්ධක යී සූත්‍ර තුනෙක් ද ඵලසූත්‍ර දෙකෙක් ද අරිට්ඨ, කප්පින, දීප, අසුභ, කිම්බිල යී පසෙක් දැ යි මුළුල්ල දශයෙකි යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 112,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "2. ආනන්ද වග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10. 2. 1ใ",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඉච්ඡානඞ්ගලසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3759. එකං සමයං භගවා ඉච්ඡානඞ්ගලෙ{1} විහරති ඉච්ඡානඞ්ගල වනසණ්ඩෙ. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි: “ඉච්ඡාමහං භික්ඛවෙ, තෙමාසං පතිසල්ලීයිතුං. නම්හි කෙනචි උපසඞ්කමිතබ්බො අඤ්ඤත්ර එකෙන පිණ්ඩපාතනීහාරකෙනා”ති. ‘එවම්භන්තෙ’ති ඛො තෙ භික්ඛූ භගවතො පටිස්සුත්වා නාස්සු කොචි භගවන්තං උපසඞ්කමති, අඤ්ඤත්ර එකෙන පිණ්ඩපාතනීහාරකෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා තස්ස තෙමාසස්ස අච්චයෙන පටිසල්ලානා වුට්ඨිතො භික්ඛූ ආමන්තෙසි: “සචෙ වො{2} භික්ඛවෙ, අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං පුච්ඡෙය්යුං ‘කතමෙන ආවුසො විහාරෙන සමණො ගොතමො වස්සාවාසං බහුලං විහාසී’ති, එවං පුට්ඨා තුම්හෙ භික්ඛවෙ, තෙසං අඤ්ඤතිත්ථියානං පරිබ්බාජකානං එවං බ්යාකරෙය්යාථ: ‘ආනාපානසතිසමාධිනා ඛො ආවුසො, භගවා වස්සාවාසං බහුලං විහාසී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉධාහං භික්ඛවෙ, සතො අස්සසාමි, සතො පස්සසාමි. දීඝං වා අස්සසන්තො දීඝං අස්සසාමීති පජානාමි, දීඝං වා පස්සසන්තො දීඝං පස්සසාමීති පජානාමි -පෙ- පටිනිස්සග්ගානුපස්සී අස්සසිස්සාමීති පජානාමි, පටිනිස්සග්ගානුපස්සී පස්සසිස්සාමීති පජානාමි. යං හි තං භික්ඛවෙ, සම්මා වදමානො වදෙය්ය අරියවිහාරො ඉතිපි බ්රහ්මවිහාරො ඉතිපි තථාගතවිහාරො ඉතිපි ආනාපානසතිසමාධිං සම්මාවදමානො වදෙය්ය, අරියවිහාරො ඉතිපි බ්රහ්මවිහාරො ඉතිපි තථාගතවිහාරො ඉතිපි."
                    },
                    {
                        "type": "paragraph",
                        "text": "යෙ තෙ භික්ඛවෙ, භික්ඛූ සෙඛා අප්පත්තමානසා අනුත්තරං යොගක්ඛෙමං පත්ථයමානා විහරන්ති, තෙසං ආනාපානසතිසමාධි භාවිතො බහුලීකතො ආසවානං ඛයාය සංවත්තති. යෙ ච ඛො තෙ භික්ඛවෙ, භික්ඛූ අරහන්තො ඛීණාසවා වුසිතවන්තො කතකරණීයා ඔහිතභාරා අනුප්පත්තසදත්ථා පරික්ඛීණභවසංයොජනා සම්මදඤ්ඤාවිමුත්තා, තෙසං ආනාපානසතිසමාධි භාවිතො බහුලීකතො දිට්ඨධම්මසුඛවිහාරාය{3} චෙව සංවත්තති සතිසම්පජඤ්ඤාය ච. යං හි තං භික්ඛවෙ, සම්මාවදමානො වදෙය්ය අරියවිහාරො ඉතිපි බ්රහ්මවිහාරො ඉතිපි තථාගතවිහාරො ඉතිපි ආනාපානසතිසමාධිං සම්මාවදමානො වදෙය්ය අරියවිහාරො ඉතිපි බ්රහ්මවිහාරො ඉතිපි තථාගතවිහාරො ඉතිපීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඉච්ඡානඞ්කලෙ - සී 2."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ඛො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. දිට්ඨෙව ධම්මෙ සුඛ විහාරාය - සීමු, සී 2."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "2. ආනන්ද වර්ගය",
                        "type": "heading",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "10. 2. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ඉච්‌ඡානඞ්‌ගල සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3759. එක්කලෙක භාග්‍යවතුන් වහන්සේ ඉච්ඡානඞ්ගලනුවර සමීපයෙහි ඉච්ඡානඞ්ගලවනලැහැබෙහි වැඩවසන සේක. එහි දී භාග්‍යවතුන් වහන්සේ භික්ෂූන් ඇමතූ සේක: “මහණෙනි, මම තෙමසක් එකලා ව වෙසෙන්නට කැමැත්තෙමි. පිණ්ඩපාතය රැගෙන එන එකකු හැර අන් කිසිවකු විසින් නො එළඹිය යුත්තෙම් වෙමි”යි. එසේ ය වහන්සැ යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දී පිණ්ඩපාතය රැගෙන එන එක් මහණකු හැර අන් කිසිවෙක් භාග්‍යවතුන් වහන්සේ වෙත නො එළඹිණ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ ඒ තෙමස අයාමෙන් විවෙකයෙන් නැඟීසිටි සේක් භික්ෂූන් ඇමතූ සේක: “මහණෙනි, ඉදින් අන්තොටු පිරිවැජ්ජෝ: “ඇවැත්නි, මහණ ගොයුම්හු ඇතුළුවස කවර විහරණයෙකින් යුතු ව බහුල කොට වුසූ දැ”යි මෙසේ තොප පුළුවුස්නාහු නම් මහණෙනි, එසේ පුළුවුස්නා ලද තෙපි ඒ අන්තොටු පිරිවැජ්ජන්ට “ඇවැත්නි, භාග්‍යවතුන් වහන්සේ ආනාපානසතිසමාධියෙන් යුතු ව ඇතුළුවස බහුල කොට වුසූ සේකැ”යි මෙසේ පවසන්නහු ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, මෙහි මම සිහි ඇතියෙම් ආශ්වාස කරමි. සිහි ඇතියෙම් ප්‍රශ්වාස කරමි. දිගු කොට හෝ ආශ්වාස කරන්නෙම් දිගු කොට ආශ්වාස කරමි යි දනිමි දිගු කොට හෝ ප්‍රශ්වාස කරන්නෙම් දිගු කොට ප්‍රශ්වාස කරමි යි දනිමි ... නිවන අනු ව දක්නාසුලු ව ආශ්වාස කරන්නෙමි යි දනිමි. නිවන අනු ව දක්නාසුලුව ප්‍රශ්වාස කරන්නෙමි යි දනිමි. මහණෙනි, මැනවින් කියන්නෙක් අරියවිහාර ය යි දු බ්‍රහ්මවිහාර ය යි දු තථාගතවිහාර ය යි දු ඒ යමකට කියන්නේ නම් මැනවින් කියන්නා ආනාපානසතිසමාධියට අරියවිහාර ය යි දු බ්‍රහ්මවිහාර ය යි දු තථාගතවිහාර ය යි දු කියන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් ඒ මහණ කෙනෙක් ශෛක්ෂ්‍ය වූවාහු නො පැමිණි රහත් බැව් ඇත්තාහු අනුත්තර රහත් බව පතන්නාහු වෙසෙද් ද, ආනාපානසතිසමාධිය වඩන ලද්දේ පුනපුනා කරන ලද්දේ ඔවුන්ගේ ආස්‍රවක්‍ෂය පිණිස පවතී. මහණෙනි, ක්‍ෂය කළ ආස්‍රව ඇති වැස නිම වූ බඹසර ඇති කළ සිවුමග කටයුතු ඇති බහා තැබූ බර ඇති පිළිවෙළින් පැමිණි රහත් බැව් ඇති ගෙවූ භවසංයොජන ඇති මැනවින් දැන මිදුණු යම් ඒ රහත් මහණහු වෙද්ද, ආනාපානසතිසමාධිය වඩන ලද්දේ පුනපුනා කරන ලද්දේ ඔවුන්ට දිටුදැමියෙහි සුවවිහරණ පිණිසත් සිහිනුවණ පිණිසත් පවතී. මහණෙනි, මැනවින් කියන්නෙක් අරියවිහාර ය යි දු බ්‍රහ්මවිහාර ය යි දු තථාගත විහාරය යි දු ඒ යමකට කියන්නේ නම් මැනවින් කියන්නා ආනාපානසතිසමාධියට අරියවිහාර ය යි දු බ්‍රහ්මවිහාර ය යි දු තථාගතවිහාර ය යි දු කියන්නේ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 114,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 2. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කඞ්ඛෙය්යසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3760. එකං සමයං ආයස්මා ලොමසවඞ්ගීසො{1} සක්කෙසු විහරති කපිලවත්ථුස්මිං නිග්රොධාරාමෙ. අථ ඛො මහානාමො සක්කො යෙනායස්මා ලොමසවඞ්ගීසො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මන්තං ලොමසවඞ්ගීසං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො මහානාමො සක්කො ආයස්මන්තං ලොමසවඞ්ගීසං එතදවොච. සො එව නු ඛො භන්තෙ, සෙඛො විහාරො සො තථාගතවිහාරො, උදාහු අඤ්ඤොව{2} සෙඛො විහාරො, අඤ්ඤො තථාගතවිහාරොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "න ඛො ආවුසො මහානාම, ස්වෙව සෙඛො විහාරො, සො තථාගතවිහාරො. අඤ්ඤො ඛො ආවුසො මහානාම, සෙඛො විහාරො අඤ්ඤො තථාගතවිහාරො. යෙ තෙ ආවුසො මහානාම භික්ඛූ සෙඛා අප්පත්තමානසා අනුත්තරං යොගක්ඛෙමං පත්ථයමානා විහරන්ති, තෙ පඤ්ච නීවරණෙ පහාය විහරන්ති. කතමෙ පඤ්ච: කාමච්ඡන්දනීවරණං පහාය විහරන්ති. ව්යාපාදනීවරණං -පෙ- ථිනමිද්ධනීවරණං -පෙ- උද්ධච්චකුක්කුච්චනීවරණං -පෙ- විචිකිච්ඡානීවරණං පහාය විහරන්ති. යෙ තෙ ආවුසො මහානාම, භික්ඛූ සෙඛා අප්පත්තමානසා අනුත්තරං යොගක්ඛෙමං පත්ථයමානා විහරන්ති. තෙ ඉමෙ පඤ්ච නීවරණෙ පහාය විහරන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යෙ ච ඛො තෙ ආවුසො මහානාම, භික්ඛූ අරහන්තො ඛීණාසවා වුසිතවන්තො කතකරණීයා ඔහිතභාරා අනුප්පත්තසදත්ථා පරික්ඛීණභවසංයොජනා සම්මදඤ්ඤාවිමුත්තා, තෙසං පඤ්ච නීවරණා පහීනා උච්ඡින්නමූලා තාලාවත්ථුකතා අනභාවකතා ආයතිං අනුප්පාදධම්මා. කතමෙ පඤ්ච: කාමච්ඡන්දනීවරණං පහීනං උච්ඡින්නමූලං තාලාවත්ථුකතං අනභාවංකතං ආයතිං අනුප්පාදධම්මං, ව්යාපාදනීවරණං -පෙ- ථිනමිද්ධනීවරණං -පෙ- උද්ධච්චකුක්කුච්චනීවරණං -පෙ- විචිකිච්ඡානීවරණං පහීනං උච්ඡින්නමූලං තාලාවත්ථුකතං අනභාවකතං ආයතිං අනුප්පාදධම්මං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ලොමසකම්භියො - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අඤ්ඤො - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 2. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කඞ්‌ඛෙය්‍ය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3760. එක් සමයෙක ආයුෂ්මත් ලොමසවඞ්ගීස තෙරණුවෝ ශාක්‍ය දනව්වෙහි කපිලවාස්තුපුර සමීපයෙහි නිග්‍රොධාරාමයෙහි වැඩවෙසෙති. එකල මහානාමශාක්‍ය තෙමේ ආයුෂ්මත් ලොමසවඞ්ගීස තෙරණුවන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් ලොමසවඞ්ගීස තෙරණුවන් වැඳ එකත්පස් ව හුන්නේ ය. එකත්පස් ව හුන් මහානාම ශාක්‍ය තෙමේ ආයුෂ්මත් ලොමසවඞ්ගීස තෙරණුවන්ට මෙය කීය: “වහන්ස, සෙඛ විහාරයත් එය ම ද? තථාගතවිහාරයත් එය ම ද? නොහොත් සෙඛවිහාරය අනෙකෙක් ද? තථාගත විහාරය අනෙකෙක් දැ”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත්නි, මහානාම, එය ම සෙඛවිහාරයත් එය ම තථාගතවිහාරයත් නො ම වේ. ඇවැත්නි මහානාම, සෙඛවිහාරය අනෙකෙකි. තථාගතවිහාරය අනෙකෙකි. ඇවැත්නි, මහානාම, යම් ඒ ශෛක්ෂ්‍ය භික්ෂූහු නො පැමිණි රහත්බැව් ඇත්තාහු අනුත්තර රහත්බව පතමින් වෙසෙද්ද, ඔහු පස් නීවරණ දුරු කොට වෙසෙත්. කවර පසක් ද යත්: කාමච්ඡන්ද නීවරණය දුරු කොට වෙසෙත්. ව්‍යාපාද නීවරණය ... ථිනමිද්ධ නීවරණය ... උද්ධච්චකුක්කුච්ච නීවරණය ... විචිකිච්ඡා නීවරණය දුරු කොට වෙසෙත්. ඇවැත්නි මහානාම, යම් ඒ ශෛක්ෂ්‍යභික්ෂූහු නො පැමිණි රහත්බැව් ඇත්තාහු අනුත්තර වූ අර්හත්වය පතමින් වෙසෙද්ද, ඔහු මේ පස් නීවරණ දුරු කොට වෙසෙති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත්නි මහානාම, ක්‍ෂය කළ ආස්‍රව ඇති වැස නිම වූ බඹසර ඇති කළ කටයුතු ඇති බහා තැබූ බර ඇති පිළිවෙළින් පැමිණි රහත් බැව් ඇති ගෙවූ භවසංයොජන ඇති මැනවින් දැන මිදුණු යම් ඒ රහත් භික්ෂූහු වෙද්ද, ඔවුන් විසින් පස් නීවරණයෝ ප්‍රහීණයහ. උසුන්මුල්හ. හිස්සුන් තල්ගසක් මෙන් කරනලදහ. නැවත නොහටගන්නා බවට පමුණුවනලදහ. මතු නූපදනා ස්වභාව ඇතියහ. කවර පසෙක් ද යත්: කාමච්ඡන්දනීවරණය ප්‍රහීණ ය. උසුන්මුල් ය. හිස්සුන් තල්ගසක් මෙන් කරන ලද්දේ ය. නැවත නොහටගන්නා බවට පමුණුවන ලද්දේ ය. මතු නූපදනා ස්වභාව ඇත්තේ ය. ව්‍යාපාදනීවරණය ... ථිනමිද්ධනීවරණය ... උද්ධච්චකුක්කුච්චනීවරණය ... විචිකිච්ඡානීවරණය ප්‍රහීණ ය. උසුන්මුල් ය. හිස්සුන් තල්ගසක් මෙන් කරන ලද්දේ ය. නැවත නොහටගන්නා බවට පමුණුවන ලද්දේ ය. මතු නූපදනා ස්වභාව ඇත්තේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 116,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යෙ තෙ ආවුසො මහානාම, භික්ඛූ අරහන්තො ඛීණාසවා වුසිතවන්තො කතකරණීයා ඔහිතභාරා අනුප්පත්තසදත්ථා පරික්ඛීණභවසංයොජනා සම්මදඤ්ඤාවිමුත්තා. තෙසං ඉමෙ පඤ්ච නීවරණා පහීනා. උච්ඡින්නමූලා තාලාවත්ථුකතා අනභාවකතා ආයතිං අනුප්පාදධම්මා. තදමිනාපෙතං ආවුසො මහානාම, පරියායෙන වෙදිතබ්බං යථා අඤ්ඤොව සෙඛො විහාරො, අඤ්ඤො තථාගතවිහාරො."
                    },
                    {
                        "type": "paragraph",
                        "text": "එකමිදං{1} ආවුසො මහානාම, සමයං භගවා ඉච්ඡානඞ්ගලෙ විහරති ඉච්ඡානඞ්ගලවනසණ්ඩෙ. තත්ර ඛො ආවුසො, භගවා{2} භික්ඛූ ආමන්තෙසි: “ඉච්ඡාමහං භික්ඛවෙ, තෙමාසං පතිසල්ලීයිතුං. නම්හි කෙනචි උපසඞ්කමිතබ්බො අඤ්ඤත්ර එකෙන පිණ්ඩපාතනීහාරකෙනා”ති. “එවං භන්තෙ”ති ඛො ආවුසො, තෙ භික්ඛූ භගවතො පටිස්සුත්වා නාස්සු කොචි භගවන්තං උපසඞ්කමති අඤ්ඤත්ර එකෙන පිණ්ඩපාතනීහාරකෙන."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආවුසො, භගවා තස්ස තෙමාසස්ස අච්චයෙන පටිසල්ලානා වුට්ඨිතො භික්ඛූ ආමන්තෙසි: “සචෙ වො භික්ඛවෙ, අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං පුච්ඡෙය්යුං: “කතමෙනාවුසො, විහාරෙන සමණො ගොතමො වස්සාවාසං බහුලං විහාසී”ති, එවං පුට්ඨා තුම්හෙ භික්ඛවෙ, තෙසං අඤ්ඤතිත්ථියානං පරිබ්බාජකානං එවං බ්යාකරෙය්යාථ, “ආනාපානසතිසමාධිනා ඛො ආවුසො, භගවා වස්සාවාසං බහුලං විහාසී”ති. ඉධාහං භික්ඛවෙ, සතො අස්සසාමි, සතො පස්සසාමි. දීඝං වා අස්සසන්තො දීඝං අස්සසාමීති පජානාමි, දීඝං වා පස්සසන්තො දීඝං පස්සසාමීති පජානාමි. -පෙ- පටිනිස්සග්ගානුපස්සී අස්සසිස්සාමීති පජානාමි, පටිනිස්සග්ගානුපස්සී පස්සසිස්සාමීති පජානාමි. යං හි තං භික්ඛවෙ, සම්මා වදමානො වදෙය්ය අරියවිහාරො ඉතිපි, බ්රහ්මවිහාරො ඉතිපි, තථාගතවිහාරො ඉතිපි. ආනාපානසතිසමාධිං සම්මා වදමානො වදෙය්ය, අරියවිහාරො ඉතිපි, බ්රහ්මවිහාරො ඉතිපි, තථාගතවිහාරො ඉතිපි."
                    },
                    {
                        "type": "paragraph",
                        "text": "යෙ තෙ භික්ඛවෙ, භික්ඛූ සෙඛා අප්පත්තමානසා අනුත්තරං යොගක්ඛෙමං පත්ථයමානා විහරන්ති. තෙසං ආනාපානසතිසමාධි භාවිතො බහුලීකතො ආසවානං ඛයාය සංවත්තති. යෙ ච ඛො තෙ භික්ඛවෙ, භික්ඛූ අරහන්තො ඛීණාසවා වුසිතවන්තො කතකරණීයා ඔහිතභාරා අනුප්පත්තසදත්ථා පරික්ඛීණභවසංයොජනා සම්මදඤ්ඤා විමුත්තා, තෙසං ආනාපානසතිසමාධි භාවිතො බහුලීකතො දිට්ඨධම්මසුඛවිහාරාය චෙව සංවත්තති සතිසම්පජඤ්ඤාය ච."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. එකමිදාහං - සී 2."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ආවුසො මහානාම භගවා - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "ඇවැත්නි මහානාම, ක්‍ෂය කළ ආස්‍රව ඇති, වැස නිම වූ බඹසර ඇති, කළ කටයුතු ඇති බහා තැබූ බර ඇති, පිළිවෙළින් පැමිණි රහත් බැව් ඇති, ක්ෂය වූ භවසංයොජන ඇති, මැනවින් දැන මිදුණු යම් ඒ රහත් භික්ෂූහු වෙද්ද, ඔවුන් විසින් මේ පස් නීවරණයෝ ප්‍රහීණයහ. උසුන්මුල්හ. හිස්සුන් තල්ගසක් මෙන් කරනලදහ. නැවත නො හටගන්නා බවට පමුණුවන ලදහ. මතු නූපදනා ස්වභාව ඇතියහ. ඇවැත්නි මහානාම, යම්සේ සෙඛවිහාරය අනෙකෙක් ම වේ ද, තථාගතවිහාරය අනෙකෙක් ම වේ ද, ඒ මෙය මේ නයෙනුදු දතයුතු.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත්නි මහානාම, එක්සමයෙක භාග්‍යවතුන් වහන්සේ ඉච්ඡානඞ්ගලනුවර ඉච්ඡානඞ්ගලවනලැහැබෙහි වැඩවසන සේක. ඇවැත්නි, එහි දී භාග්‍යවතුන් වහන්සේ භික්ෂූන් ඇමතූ සේක: “මහණෙනි, මම තෙමසක් එකලා ව වෙසෙන්නට කැමැත්තෙමි. පිණ්ඩපාතය රැගෙන එන එකකු හැර අන් කිසිවකු විසින් නො එළඹිය යුත්තෙම් වෙමි”යි. ඇවැත්නි, “එසේ ය වහන්සැ” යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දී පිණ්ඩපාතය රැගෙන එන එකකු හැර අන් කිසිවෙක් භාග්‍යවතුන් වහන්සේ වෙත නො එළඹිණි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඇවැත්නි, ඉක්බිති භාග්‍යවතුන් වහන්සේ ඒ තෙමස ඇවෑමෙන් විවෙකයෙන් නැඟීසිටි සේක් භික්ෂූන් ඇමතූ සේක: මහණෙනි, ඉදින් අන්තොටු පිරිවැජ්ජෝ “ඇවැත්නි, මහණ ගොයුම්හු ඇතුළුවස කවර විහරණයෙකින් යුතු ව බහුල කොට දැ”යි මෙසේ තොප පුළුවුස්නාහු නම් මහණෙනි, එසේ පුළුවුස්නා ලද තෙපි ඒ අන්තොටු පිරිවැජ්ජන්ට “ඇවැත්නි, භාග්‍යවතුන් වහන්සේ ඇතුළුවස ආනාපානසතිසමාධියෙන් යුතු ව බහුල කොට විසූ සේකැ” යි මෙසේ පවසන්නහු ය. මහණෙනි, මෙහි මම සිහි ඇතියෙම් ආශ්වාස කෙරෙමි, සිහි ඇතියෙම් ප්‍රශ්වාස කෙරෙමි, දිගු කොට හෝ ආශ්වාස කරන්නෙම් දිගු කොට ආශ්වාස කෙරෙමි යි දනිමි. දිගු කොට හෝ ප්‍රශ්වාස කරන්නෙම් දිගු කොට ප්‍රශ්වාස කෙරෙමි යි දනිමි ... නිවන අනුව දක්නාසුලු ව ආශ්වාස කරන්නෙමි යි දනිමි. නිවන අනුව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමියි දනිමි. මහණෙනි, මැනවින් කියන්නෙක් ඒ යමකට අරියවිහාරය යි දු බ්‍රහ්මවිහාරය යි දු තථාගතවිහාරය යි දු කියන්නේ නම් මැනවින් කියන්නා ආනාපානසතිසමාධියට අරියවිහාරය යි දු බ්‍රිහ්මවිහාරය යි දු තථාගතවිහාරය යි දු කියන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් ඒ ශෛක්ෂ්‍ය භික්ෂූහු නොපැමිණි රහත් බැව් ඇත්තාහු අනුත්තර නිවන පතමින් වෙසෙද්ද, ඔවුන් විසින් ආනාපානසතිසමාධිය වඩන ලද්දේ බහුල කරන ලද්දේ ආස්‍රව ක්‍ෂය පිණිස පවතී. මහණෙනි, ක්‍ෂය කළ ආස්‍රව ඇති, වැස නිම වූ බඹසර ඇති, කළ කටයුතු ඇති, බහා තැබූ බර ඇති, පිළිවෙළින් පැමිණි රහත් බැව් ඇති, ක්‍ෂය වූ භවසංයොජන ඇති මැනවින් දැන මිදුණු යම් ඒ රහත් මහණහු වෙද්ද, ඔවුන් විසින් ආනාපානසතිසමාධිය වඩන ලද්දේ බහුල කරන ලද්දේ දිටුදැමියෙහි සුවවිහරණය පිණිසත් සිහිනුවණ පිණිසත් පවතී.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 118,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යං හි තං භික්ඛවෙ, සම්මා වදමානො වදෙය්ය අරියවිහාරො ඉතිපි, බ්රහ්මවිහාරො ඉතිපි, තථාගතවිහාරො ඉතිපි. ආනාපානසතිසමාධිං සම්මා වදමානො වදෙය්ය අරියවිහාරො ඉතිපි, බ්රහ්මවිහාරො ඉතිපි, තථාගතවිහාරො ඉතිපීති. ඉමිනා ඛො එතං ආවුසො මහානාම, පරියායෙන වෙදිතබ්බං යථා අඤ්ඤොව සෙඛො විහාරො, අඤ්ඤො තථාගතවිහාරොති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 2. 3",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආනන්දසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3761. අථ ඛො ආයස්මා ආනන්දො යෙන භගවා තෙනුපසඞ්කමි -පෙ- එකමන්තං නිසින්නො ඛො ආයස්මා ආනන්දො භගවන්තං එතදවොච: “අත්ථි නු ඛො භන්තෙ, එකො ධම්මො{1} භාවිතො බහුලීකතො චත්තාරො ධම්මෙ පරිපූරෙති, චත්තාරො ධම්මා භාවිතා බහුලීකතා සත්ත ධම්මෙ පරිපූරෙන්ති, සත්ත ධම්මා භාවිතා බහුලීකතා ද්වෙ ධම්මෙ පරිපූරෙන්තී”ති. “අත්ථි ඛො ආනන්ද, එකො ධම්මො භාවිතො බහුලීකතො චත්තාරො ධම්මෙ පරිපූරෙති, චත්තාරො ධම්මා භාවිතා බහුලීකතා සත්ත ධම්මෙ පරිපූරෙන්ති, සත්ත ධම්මා භාවිතා බහුලීකතා ද්වෙ ධම්මෙ පරිපූරෙන්තී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො පන භන්තෙ, එකො ධම්මො භාවිතො බහුලීකතො චත්තාරො ධම්මෙ පරිපූරෙති, චත්තාරො ධම්මා භාවිතා බහුලීකතා සත්ත ධම්මෙ පරිපූරෙන්ති, සත්ත ධම්මා භාවිතා බහුලීකතා ද්වෙ ධම්මෙ පරිපූරෙන්තී”ති. ආනාපානසතිසමාධි ඛො ආනන්ද, එකො ධම්මො භාවිතො බහුලීකතො චත්තාරො සතිපට්ඨානෙ පරිපූරෙති, චත්තාරො සතිපට්ඨානා භාවිතා බහුලීකතා සත්ත බොජ්ඣඞ්ගෙ පරිපූරෙන්ති, සත්ත බොජ්ඣඞ්ගා භාවිතා බහුලීකතා විජ්ජාවිමුත්තිං පරිපූරෙන්ති. කථං භාවිතො ආනන්ද, ආනාපානසතිසමාධි කථං බහුලීකතො චත්තාරො සතිපට්ඨානෙ පරිපූරෙති: ඉධානන්ද, භික්ඛු අරඤ්ඤගතො වා රුක්ඛමූලගතො වා සුඤ්ඤාගාරගතො වා -පෙ- පටිනිස්සග්ගානුපස්සී පස්සසිස්සාමී’ති සික්ඛති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. එකධම්මො - මඡසං, ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, මැනවින් කියන්නෙක් ඒ යමකට අරියවිහාරය යි දු බ්‍රහ්මවිහාරය යි දු තථාගතවිහාරය යි දු කියන්නේ නම් මැනවින් කියන්නා අනාපානසතිසමාධියට අරියවිහාරය යි දු බ්‍රහ්මවිහාරය යි දු තථාගතවිහාරය යි දු කියන්නේ යි. ඇවැත්නි මහානාම, යම්සේ සෙඛවිහාරය අනෙකෙක් ම වේ ද තථාගතවිහාර අනෙකෙක් ම වේ ද මෙය මේ නයින් දතයුතු යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 2. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආනන්‌ද සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3761. එකල්හි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ ... එකත්පස් ව හුන් ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැලකළහ: “වහන්ස, එක් දහමක් වඩන ලද්දේ බහුල කරන ලද්දේ සිවු දහම් කෙනකුන් පුරවා ද, සිවු දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු සත් දහම් කෙනෙකුන් පුරවද්ද, සත් දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු දෙ දහම් කෙනකුන් පුරවද්ද, එබඳු දහමෙක් ඇද්දැ”යි. ආනන්ද, එක් දහමෙක් වඩන ලද්දේ බහුල කරන ලද්දේ සිවු දහම් කෙනකුන් පුරවා ද, සිවු දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු සත් දහම් කෙනකුන් පුරවද්ද, සත් දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු දෙ දහම් කෙනකුන් පුරවද්ද, එබඳු දහමෙක් ඇතැ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "“වහන්ස, කවර එක් දහමෙක් වඩන ලද්දේ බහුල කරන ලද්දේ (කවර) සිවු දහම් කෙනකුන් පුරවා ද, සිවු දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු (කවර) සත් දහම් කෙනකුන් පුරවත් ද, සත් දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු කවර දෙ දහම් කෙනකුන් පුරවද්දැ”යි. ආනන්ද, ආනාපානසතිසමාධි නම් එක් දහම වඩන ලදුයේ බහුල කරන ලදුයේ සිවු සීවටන් පුරවයි. සිවු සීවටන්හු වඩන ලදහු බහුල කරන ලදහු සත් බොජඟ පුරවත්. සත් බොජඟහු වඩන ලදහු බහුල කරන ලදහු විජ්ජාවිමුත්ති පුරවත්. ආනන්ද, කෙසේ වඩන ලද කෙසේ බහුල කරන ලද ආනාපානසතිසමාධිය සිවු සීවටන් පුරවා ද යත්: ආනන්ද, මෙසස්නෙහි මහණ අරනකට ගියේ හෝ රුක්මුලකට ගියේ හෝ හිස්ගෙයකට ගියේ හෝ ... නිවන අනුව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි යි හික්මේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 120,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ ආනන්ද, භික්ඛු දීඝං වා අස්සසන්තො දීඝං අස්සසාමීති පජානාති, දීඝං වා පස්සසන්තො දීඝං පස්සසාමීති පජානාති -පෙ- සබ්බකායපටිසංවෙදී -පෙ- පස්සම්භයං කායසඞ්ඛාරං අස්සසිස්සාමීති සික්ඛති. පස්සම්භයං කායසඞ්ඛාරං පස්සසිස්සාමීති සික්ඛති. කායෙ කායානුපස්සී ආනන්ද, භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තං කිස්ස හෙතු: කායඤ්ඤතරාහං ආනන්ද, එතං වදාමි, යදිදං අස්සාසපස්සාසං. තස්මාතිහානන්ද, කායෙ කායානුපස්සී භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ ආනන්ද, භික්ඛු පීතිපටිසංවෙදී අස්සසිස්සාමීති සික්ඛති -පෙ- සුඛපටිසංවෙදී -පෙ- චිත්තසඞ්ඛාරපටිසංවෙදී -පෙ- පස්සම්භයං චිත්තසඞ්ඛාරං අස්සසිස්සාමීති සික්ඛති, පස්සම්භයං චිත්තසඞ්ඛාරං පස්සසිස්සාමීති සික්ඛති. වෙදනාසු වෙදනානුපස්සී ආනන්ද, භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තං කිස්ස හෙතු: වෙදනඤ්ඤතරාහං ආනන්ද, එතං වදාමි, යදිදං අස්සාසපස්සාසානං සාධුකං මනසිකාරං. තස්මාතිහානන්ද, වෙදනාසු වෙදනානුපස්සී භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ ආනන්ද, භික්ඛු චිත්තපටිසංවෙදී අස්සසිස්සාමීති සික්ඛති -පෙ- අභිප්පමොදයං චිත්තං -පෙ- සමාදහං චිත්තං -පෙ- විමොචයං චිත්තං අස්සසිස්සාමීති සික්ඛති, විමොචයං චිත්තං පස්සසිස්සාමීති සික්ඛති. චිත්තෙ චිත්තානුපස්සී ආනන්ද, භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තං කිස්ස හෙතු: නාහං ආනන්ද, මුට්ඨස්සතිස්ස අසම්පජානස්ස ආනාපානසතිසමාධිභාවනං වදාමි. තස්මාතිහානන්ද, චිත්තෙ චිත්තානුපස්සී භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "ආනන්ද, යම් සමයෙක මහණ දිගු කොට හෝ ආශ්වාස කරනුයේ දිගු කොට ආශ්වාස කෙරෙමි යි දනී ද, දිගු කොට හෝ ප්‍රශ්වාස කරනුයේ දිගු කොට ප්‍රශ්වාස කෙරෙමියි දනී ද ... සියලු ආශ්වාසප්‍රශ්වාසකය දන්නාසුලු ව ... කායසංස්කාර සන්හිඳුවමින් ආශ්වාස කරන්නෙමි යි හික්මේ ද, කායසංස්කාර සන්හිඳුවමින් ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, ආනන්ද එසමයෙහි මහණ කයෙහි කය අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. ඒ කවර හෙයින යත්: ආනන්ද, යම් මේ ආශ්වාසප්‍රශ්වාස වේ ද, මෙය එක්තරා කයෙකැ යි මම කියමි. ආනන්ද එහෙයින් මෙහි ලා මහණ එසමයෙහි කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්ද, යම් සමයෙක මහණ ප්‍රීතිය දන්නාසුලු ව ආශ්වාස කරන්නෙමි යි හික්මේ ද ... සුවය දන්නාසුලු ව ... චිත්තසංස්කාර දන්නාසුලු ව ... චිත්තසංස්කාර සන්හිඳුවමින් ආශ්වාස කරන්නෙමි යි හික්මේ ද, චිත්තසංස්කාර සන්හිඳුවමින් ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, ආනන්ද එසමයෙහි මහණ වෙදනාවන්හි වෙදනා අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව වෙදනාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. ඒ කවර හෙයින යත්: ආනන්ද, යම් මේ ආශ්වාසප්‍රශ්වාසයන්ගේ මැනවින් මෙනෙහි කිරීමෙක් වේ ද මෙය එක්තරා වෙදනාවෙකැ යි මම කියමි. ආනන්ද, එහෙයින් මෙසස්නෙහි මහණ එසමයෙහි වෙදනාවන්හි වෙදනා අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව වෙදනාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්ද, යම් සමයෙක මහණ සිත දන්නාසුලු ව ආශ්වාස කරන්නෙමි යි හික්මේ ද ... සිත සතුටු කරවමින් ... සිත එකඟ කරමින් ... සිත මුදවමින් ආශ්වාස කරන්නෙමි යි හික්මේ ද, සිත මුදවමින් ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, ආනන්ද, එසමයෙහි මහණ සිතෙහි සිත අනු ව දක්නා සුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව සිත්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. ඒ කවර හෙයින යත්: ආනන්ද, මුළා සිහි ඇති මනාදැනුම් නැත්තහුට ආනාපානසතිසමාධිභාවනාවක් මම නො කියමි. ආනන්ද, එහෙයින් මෙහි ලා මහණ එසමයෙහි සිත්හි සිත අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව සිත්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 122,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ ආනන්ද, භික්ඛු අනිච්චානුපස්සී අස්සසිස්සාමීති සික්ඛති -පෙ-විරාගානුපස්සී -පෙ- නිරොධානුපස්සී -පෙ- පටිනිස්සග්ගානුපස්සී අස්සසිස්සාමීති සික්ඛති. පටිනිස්සග්ගානුපස්සී පස්සසිස්සාමීති සික්ඛති. ධම්මෙසු ධම්මානුපස්සී ආනන්ද, භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. සො යං තං හොති අභිජ්ඣාදොමනස්සානං පහානං තං පඤ්ඤාය දිස්වා සාධුකං අජ්ඣුපෙක්ඛිතා හොති. තස්මාතිහානන්ද, ධම්මෙසු ධම්මානුපස්සී භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. එවං භාවිතො ඛො ආනන්ද, ආනාපානසතිසමාධි එවං බහුලීකතො චත්තාරො සතිපට්ඨානෙ පරිපූරෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථං භාවිතා ච ආනන්ද, චත්තාරො සතිපට්ඨානා කථං බහුලීකතා සත්තබොජ්ඣඞ්ගෙ පරිපූරෙන්ති: යස්මිං සමයෙ ආනන්ද, භික්ඛු කායෙ කායානුපස්සී විහරති උපට්ඨිතා තස්ස{1} තස්මිං සමයෙ සති{2} හොති අසම්මුට්ඨා. යස්මිං සමයෙ ආනන්ද, භික්ඛුනො උපට්ඨිතා සති හොති අසම්මුට්ඨා, සතිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො ආරද්ධො හොති. සතිසම්බොජ්ඣඞ්ගං තස්මිං සමයෙ භික්ඛු භාවෙති. සතිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො භාවනාපාරිපූරිං ගච්ඡති. සො තථා සතො විහරන්තො තං ධම්මං පඤ්ඤාය පවිචිනති පවිචරති පරිවීමංසමාපජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ ආනන්ද, භික්ඛු තථා සතො විහරන්තො තං ධම්මං පඤ්ඤාය පවිචිනාති පවිචරති පරිවීමංසමාපජ්ජති. ධම්මවිචයසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො ආරද්ධො හොති. ධම්මවිචයසම්බොජ්ඣඞ්ගං තස්මිං සමයෙ භික්ඛු භාවෙති. ධම්මවිචයසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො භාවනාපාරිපූරිං ගච්ඡති. තස්ස තං ධම්මං පඤ්ඤාය පවිචිනතො පවිචරතො පරිවීමංසමාපජ්ජතො ආරද්ධං හොති විරියං අසල්ලීනං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ ආනන්ද, භික්ඛුනො තං ධම්මං පඤ්ඤාය පවිචිනතො පවිචරතො පරිවීමංසමාපජ්ජතො ආරද්ධං හොති විරියං අසල්ලීනං, විරියසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො ආරද්ධො හොති, විරියසම්බොජ්ඣඞ්ගං තස්මිං සමයෙ භික්ඛු භාවෙති. විරියසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො භාවනාපාරිපූරිං ගච්ඡති. ආරද්ධවිරියස්ස උප්පජ්ජති පීති නිරාමිසා."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උපට්ඨිතාස්ස - මඡසං, ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සමයෙ භික්ඛුනො සති - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "ආනන්ද, යම් සමයෙක මහණ අනිස අනු ව දක්නාසුලු ව ආශ්වාස කරන්නෙමි යි හික්මේ ද ... විරාගය අනුව දක්නාසුලු ව ... නිරොධය අනු ව දක්නාසුලු ව ... නිවන අනුව දක්නාසුලු ව ආශ්වාස කරන්නෙමි යි හික්මේ ද, නිවන අනුව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, ආනන්ද, එසමයෙහි මහණ දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. දැඩිලොබ හා දොම්නස පිළිබඳ යම් ඒ ප්‍රහාණයෙක් වේ නම් හේ එය නුවණින් දැක දැක මැනවින් මැදහත් ව දක්නාසුලු වෙයි. ආනන්ද, එසෙයින් මෙහි ලා මහණ එසමයෙහි දහම්හි දහම් අනුව දක්නාසුලු ව කෙලෙස් තවන වැර ඇතිව මනාදැනුම් ඇති ව සිහි ඇති ව දගම් ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. ආනන්ද, මෙසේ වඩන ලද මෙසේ බහුල කරන ලද ආනාපානසතිසමාධිය සිවු සීවටන් පුරවයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්ද, කෙසේ වඩන ලද කෙසේ බහුල කරන ලද සිවු සීවටන්හු සත් බොජඟ පුරවද්ද යත්: ආනන්ද, යම් සමයෙක මහණ කයෙහි කය අනුව දක්නාසුලු ව වෙසේ ද එසමයෙහි ඔහුගේ සිහිය නුමුළා වූවා එළඹසිටියා වේ. ආනන්ද, යම් සමයෙක මහණහුගේ සිහිය නුමුළා වූවා එළඹ සිටියා වේ ද, එසමයෙහි මහණහු විසින් සතිසම්බොජ්ඣඞ්ගය අරඹන ලද්දේ වෙයි. එසමයෙහි මහණ සතිසම්බොජ්ඣඞ්ගය වඩයි. එසමයෙහි මහණහුගේ සතිසම්බොජ්ඣඞ්ගය වැඩීමෙන් පිරීමට යේ. හේ එසේ සිහි ඇති ව වෙසෙනුයේ ඒ දහම නුවණින් සොයයි පිරික්සයි විමසුමට පැමිණෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්ද, යම් සමයෙක මහණ එසේ සිහි ඇති ව වෙසෙනුයේ ඒ දහම නුවණින් සොයා ද පිරික්සා ද විමසුමට පැමිණේ ද, එසමයෙහි මහණහු විසින් ධම්මවිචයසම්බොජ්ඣඞ්ගය අරඹන ලද්දේ වෙයි. එසමයෙහි මහණ ධම්මවිචයසම්බොජ්ඣඞ්ගය වඩයි. එසමයෙහි මහණහුගේ ධම්මවිචයසම්බොජ්ඣඞ්ගය වැඩීමෙන් පිරීමට යේ. ඒ දහම නුවණින් සොයන පිරික්සන විමසුමට පැමිණෙන ඔහු විසින් ලීන නොවූ වැර අරඹන ලද්දේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්ද, යම් සමයෙක ඒ දහම නුවණින් සොයන පිරික්සන විමසුමට පැමිණෙන මහණහු විසින් වැර අරඹන ලද්දේ ලීන නොවූයේ වේ ද, එසමයෙහි මහණහු විසින් විරියසම්බොජ්ඣඞ්ගය අරඹන ලද්දේ වේ. එසමයෙහි මහණ විරියසම්බොජ්ඣඞ්ගය වඩයි. එසමයෙහි මහණහුගේ විරියසම්බොජ්ඣඞ්ගය වැඩීමෙන් පිරිමට යේ. පිරිපුන් වැර ඇත්තහුට නිරාමිස (පස්කම්සුවයෙන් තොර) ප්‍රීතිය උපදී.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 124,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ ආනන්ද, භික්ඛුනො ආරද්ධවිරියස්ස උප්පජ්ජති පීති නිරාමිසා, පීතිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො ආරද්ධො හොති, පීතිසම්බොජ්ඣඞ්ගං තස්මිං සමයෙ භික්ඛු භාවෙති, පීතිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො භාවනාපාරිපූරිං ගච්ඡති. පීතිමනස්ස කායොපි පස්සම්භති, චිත්තම්පි පස්සම්භති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ ආනන්ද, භික්ඛුනො පීතිමනස්ස කායොපි පස්සම්භති, චිත්තම්පි පස්සම්භති, පස්සද්ධිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො ආරද්ධො හොති. පස්සද්ධිසම්බොජ්ඣඞ්ගං තස්මිං සමයෙ භික්ඛු භාවෙති, පස්සද්ධිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො භාවනාපාරිපූරිං ගච්ඡති. පස්සද්ධකායස්ස සුඛිනො චිත්තං සමාධියති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ ආනන්ද, භික්ඛුනො පස්සද්ධකායස්ස සුඛිනො චිත්තං සමාධියති, සමාධිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො ආරද්ධො හොති, සමාධිසම්බොජ්ඣඞ්ගං තස්මිං සමයෙ භික්ඛු භාවෙති. සමාධිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො භාවනාපාරිපූරිං ගච්ඡති. සො තථා සමාහිතං චිත්තං සාධුකං අජ්ඣුපෙක්ඛිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ ආනන්ද, භික්ඛු තථා සමාහිතං චිත්තං සාධුකං අජ්ඣුපෙක්ඛිතා හොති, උපෙඛාසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො ආරද්ධො හොති, උපෙඛාසම්බොජ්ඣඞ්ගං තස්මිං සමයෙ භික්ඛු භාවෙති. උපෙඛාසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො භාවනාපාරිපූරිං ගච්ඡති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ ආනන්ද, භික්ඛු වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති උපට්ඨිතා තස්ස තස්මිං සමයෙ සති හොති අසම්මුට්ඨා. යස්මිං සමයෙ ආනන්ද, භික්ඛුනො උපට්ඨිතා සති හොති අසම්මුට්ඨා, සතිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො ආරද්ධො හොති. සතිසම්බොජ්ඣඞ්ගං තස්මිං සමයෙ භික්ඛු භාවෙති. සතිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො භාවනාපාරිපූරිං ගච්ඡති -පෙ- සො තථා සමාහිතං චිත්තං සාධුකං අජ්ඣුපෙක්ඛිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ ආනන්ද, භික්ඛු තථා සමාහිතං චිත්තං සාධුකං අජ්ඣුපෙක්ඛිතා හොති, උපෙඛාසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො ආරද්ධො හොති. උපෙඛාසම්බොජ්ඣඞ්ගං තස්මිං සමයෙ භික්ඛු භාවෙති. උපෙඛාසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො භාවනාපාරිපූරිං ගච්ඡති. එවං භාවිතා ඛො ආනන්ද, චත්තාරො සතිපට්ඨානා එවං බහුලීකතා සත්ත බොජ්ඣඞ්ගෙ පරිපූරෙන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථං භාවිතා ච ආනන්ද, සත්ත බොජ්ඣඞ්ගා කථං බහුලීකතා විජ්ජාවිමුත්තිං පරිපූරෙන්ති: ඉධානන්ද, භික්ඛු සතිසම්බොජ්ඣඞ්ගං භාවෙති විවෙකනිස්සිතං විරාගනිස්සිතං නිරොධනිස්සිතං වොස්සග්ගපරිණාමිං -පෙ- උපෙඛාසම්බොජ්ඣඞ්ගං භාවෙති, විවෙකනිස්සිතං විරාගනිස්සිතං නිරොධනිස්සිතං වොස්සග්ගපරිණාමිං. එවං භාවිතා ඛො ආනන්ද, සත්තබොජ්ඣඞ්ගා එවං බහුලීකතා විජ්ජාවිමුත්තිං පරිපූරෙන්තීති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "ආනන්ද, යම් කලෙක පිරිපුන් වැර ඇති මහණහට නිරාමිස ප්‍රීතිය උපදී ද, එකල්හි මහණහු විසින් ප්‍රීතිසම්බොජ්ඣඞ්ගය අරඹන ලද්දේ වෙයි. එකල්හි මහණ පීතිසම්බොජ්ඣඞ්ගය වඩයි. එකල්හි මහණහුගේ පීතිසම්බොජ්ඣඞ්ගය වැඩීමෙන් පිරීමට යේ. ප්‍රීතසිත් ඇත්තහුගේ කයත් සන්හිඳේ. සිතත් සන්හිඳේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්ද, යම් සමයෙක ප්‍රීතසිත් ඇති මහණහුගේ කයත් සන්හිඳේ ද සිතත් සන්හිඳේ ද එසමයෙහි මහණහු විසින් පස්සද්ධිසම්බොජ්ඣඞ්ගය අරඹන ලද්දේ වෙයි. එසමයෙහි මහණ පස්සද්ධිසම්බොජ්ඣඞ්ගය වඩයි. එසමයෙහි මහණහුගේ පස්සද්ධිසම්බොජ්ඣඞ්ගය වැඩීමෙන් පිරීමට යේ. සන්හුන් කය ඇති සුව ඇත්තහුගේ සිත එකඟ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්ද, යම් සමයෙක සන්හුන් කය ඇති සුව ඇති මහණහුගේ සිත එකඟ වේ ද, එසමයෙහි මහණහු විසින් සමාධිසම්බොජ්ඣඞ්ගය අරඹන ලද්දේ වෙයි. එසමයෙහි මහණ සමාධිසම්බොජ්ඣඞ්ගය වඩයි. එසමයෙහි මහණහුගේ සමාධිසම්බොජ්ඣඞ්ගය වැඩීමෙන් පිරීමට යේ. හේ එසේ එකඟ වූ සිත මැනවින් මැදහත් ව බලනසුලු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්ද, යම් සමයෙක මහණ එසේ එකඟ වූ සිත මැනවින් මැදහත් ව බලනසුලු වේ ද, එසමයෙහි මහණහු විසින් උපෙඛාසම්බොජ්ඣඞ්ගය අරඹන ලද්දේ වෙයි. එසමයෙහි මහණ උපෙඛාසම්බොජ්ඣඞ්ගය වඩයි. එසමයෙහි මහණහුගේ උපෙඛාසම්බොජ්ඣඞ්ගය වැඩීමෙන් පිරීමට යේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්ද, යම් සමයෙක මහණ වෙදනායෙහි ... සිත්හි ... දහම්හි දහම් අනුව දක්නාසුලු ව වෙසේ ද, එසමයෙහි ඔහුගේ සිහිය එළඹ සිටියා නුමුළා වූවා වේ. ආනන්ද යම් සමයෙක මහණහුගේ සිහිය එළඹ සිටියා නුමුළා වූවා වේ ද, එසමයෙහි මහණහු විසින් සතිසම්බොජ්ඣඞ්ගය අරඹන ලද්දේ වෙයි. එසමයෙහි මහණ සතිසම්බොජ්ඣඞ්ගය වඩයි. එසමයෙහි මහණහුගේ සතිසම්බොජ්ඣඞ්ගය වැඩීමෙන් පිරීමට යේ ... හෙතෙමේ එසේ එකඟ වූ සිත මැනවින් මැදහත් ව බලනසුලු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්ද, යම් සමයෙක මහණ එසේ එකඟ වූ සිත මැනවින් මැදහත් ව බලනසුලු වේ ද, එසමයෙහි මහණහු විසින් උපෙඛාසම්බොජ්ඣඞ්ගය අරඹන ලද්දේ වෙයි. එසමයෙහි මහණ උපෙඛාසම්බොජ්ඣඞ්ගය වඩයි. එසමයෙහි මහණහුගේ උපෙඛාසම්බොජ්ඣඞ්ගය වැඩීමෙන් පිරීමට යේ. ආනන්ද, මෙසේ වඩන ලද මෙසේ පුනපුනා කරන ලද සිවු සීවටන්හු සත් බොජඟ පුරවත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්ද, කෙසේ වඩන ලද කෙසේ පුනපුනා කරන ලද සත් බොජඟහු විජ්ජාවිමුත්ති පුරවද්ද යත්: ආනන්ද, මෙසස්නෙහි මහණ විවෙකය ඇසුරු වූවක් විරාගය ඇසුරු වූවක් නිරොධය ඇසුරු වූවක් නිවනට නැමෙනසුල්ලක් කොට සතිසම්බොජ්ඣඞ්ගය වඩයි ... විවෙකය ඇසුරු වූවක් විරාගය ඇසුරු වූවක් නිරොධය ඇසුරු වූවක් නිවනට නැමෙන සුල්ලක් කොට උපෙඛාසම්බොජ්ඣඞ්ගය වඩයි. ආනන්ද, මෙසේ වඩන ලද මෙසේ පුනපුනා කරන ලද සත් බොජඟහු විජ්ජාවිමුත්ති පුරවත් යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 126,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 2. 4",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතිය ආනන්දසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3762. අථ ඛො ආයස්මා ආනන්දො යෙන භගවා තෙනුපසඞ්කමි -පෙ- එකමන්තං නිසින්නං ඛො ආයස්මන්තං ආනන්දං භගවා එතදවොච: අත්ථි නුඛො ආනන්ද, එකො ධම්මො භාවිතො බහුලීකතො චත්තාරො ධම්මෙ පරිපූරෙති, චත්තාරො ධම්මා භාවිතා බහුලීකතා, සත්ත ධම්මෙ පරිපූරෙන්ති, සත්ත ධම්මා භාවිතා බහුලීකතා ද්වෙ ධම්මෙ පරිපූරෙන්තීති? භගවම්මූලකා නො භන්තෙ, ධම්මා -පෙ- අත්ථානන්ද, එක ධම්මො භාවිතො බහුලීකතො චත්තාරො ධම්මෙ පරිපූරෙති. චත්තාරො ධම්මා භාවිතා බහුලීකතා සත්ත ධම්මෙ පරිපූරෙන්ති, සත්ත ධම්මා භාවිතා බහුලීකතා ද්වෙ ධම්මෙ පරිපූරෙන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච ආනන්ද, එකො ධම්මො භාවිතො බහුලීකතො චත්තාරො ධම්මෙ පරිපූරෙති, චත්තාරො ධම්මා භාවිතා බහුලීකතා සත්ත ධම්මෙ පරිපූරෙන්ති. සත්ත ධම්මා භාවිතා බහුලීකතා. ද්වෙ ධම්මෙ පරිපූරෙන්ති: ආනාපානසතිසමාධි ආනන්ද, එකො ධම්මො භාවිතො බහුලීකතො චත්තාරො සතිපට්ඨානෙ පරිපූරෙති, චත්තාරො සතිපට්ඨානා භාවිතා බහුලීකතා සත්ත බොජ්ඣඞ්ගෙ පරිපූරෙන්ති, සත්ත බොජ්ඣඞ්ගා භාවිතා බහුලීකතා විජ්ජාවිමුත්තිං පරිපූරෙන්ති. කථං භාවිතො චානන්ද, ආනාපානසතිසමාධි, කථං බහුලීකතො චත්තාරො සතිපට්ඨානෙ පරිපූරෙති: ඉධානන්ද, භික්ඛු අරඤ්ඤගතො වා -පෙ- එවං භාවිතා ඛො ආනන්ද, සත්ත බොජ්ඣඞ්ගා එවං බහුලීකතා විජ්ජාවිමුත්තිං පරිපූරෙන්තීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "(යථා පුරිමසුත්තන්තො එවං විත්ථාරෙතබ්බො.)"
                    },
                    {
                        "type": "centered",
                        "text": "10. 2. 5",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භික්ඛුසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3763. අථ ඛො සම්බහුලා භික්ඛූ යෙන භගවා තෙනුපසඞ්කමිංසු -පෙ- එකමන්තං නිසින්නා ඛො තෙ භික්ඛූ භගවන්තං එතදවොචුං: “අත්ථි නු ඛො භන්තෙ, එකො ධම්මො භාවිතො බහුලීකතො චත්තාරො ධම්මෙ පරිපූරෙති, චත්තාරො ධම්මා භාවිතා බහුලීකතා සත්ත ධම්මෙ පරිපූරෙන්ති, සත්ත ධම්මා භාවිතා බහුලීකතා ද්වෙ ධම්මෙ පරිපූරෙන්තී”ති. “අත්ථි භික්ඛවෙ, එකො ධම්මො භාවිතො බහුලීකතො චත්තාරො ධම්මෙ පරිපූරෙති, චත්තාරො ධම්මා භාවිතා බහුලීකතා සත්ත ධම්මෙ පරිපූරෙන්ති, සත්ත ධම්මා භාවිතා බහුලීකතා ද්වෙ ධම්මෙ පරිපූරෙන්තී”ති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 2. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතිය ආනන්‌ද සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3762. එකල්හි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ ... එකත්පසෙක හුන් ආයුෂ්මත් ආනන්ද තෙරණුවන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: ආනන්ද, එක්දහමෙක් වඩන ලද්දේ බහුල කරන ලද්දේ සිවු දහම් කෙනකුන් පුරවා ද, සිවු දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු සත් දහම් කෙනකුන් පුරවද්ද, සත් දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු දෙ දහම් කෙනකුන් පුරවද්ද, එබඳු දහමෙක් ඇද්දැ යි. වහන්ස, අපගේ දහම්හු භගවත්හු මුල් කොට ඇතියහ ... ආනන්ද එක්දහමෙක් වඩන ලද්දේ බහුල කරන ලද්දේ සිවු දහම් කෙනකුන් පුරවා නම් සිවු දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු සත් දහම් කෙනකුන් පුරවත් නම් සත් දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු දෙ දහම් කෙනකුන් පුරවත් නම් එබඳු දහමෙක් ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආනන්ද, කවර එක් දහමෙක් වඩන ලද්දේ බහුල කරන ලද්දේ සිවු දහම් කෙනකුන් පුරවා ද, (කවර) සිවු දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු සත් දහම් කෙනකුන් පුරවද් ද, (කවර) සත් දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු දෙ දහම් කෙනකුන් පුරවද් ද යත්: ආනන්ද, ආනාපාතසතිසමාධි වූ එක්දහම වඩන ලද්දේ බහුල කරන ලද්දේ සිවු සීවටන් පුරවයි. සිවු සීවටන්හු වඩන ලදහු බහුල කරන ලදහු සත් බොජඟ පුරවත්. සත් බොජඟහු වඩන ලදහු බහුල කරන ලදහු විජ්ජාවිමුත්ති පුරවත්. ආනන්ද, කෙසේ වඩන ලද කෙසේ බහුල කරන ලද ආනාපානසතිසමාධිය සිවු සීවටන් පුරවද්ද යත්: ආනන්ද, මෙහි මහණ අරනකට ගියේ හෝ ... ආනන්ද, මෙසේ වඩන ලද මෙසේ බහුල කරන ලද සත් බොජඟහු විජ්ජාවිමුත්ති පුරවත් යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "(පළමු සුතුර මෙන් විතර කටයුතු.)",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 2. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "භික්‌ඛු සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3763. එකල්හි බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ ... එකත්පස් ව හුන් ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙය සැලකළහ. “වහන්ස, එක් දහමෙක් වඩන ලදුයේ බහුල කරන ලදුයේ සිවු දහමක් පුරවා නම් සිවු දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු සත් දහමක් පුරවත් නම් සත් දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු දෙ දහමක් පුරවත් නම් එබඳු දහමෙක් ඇද්දැ”යි. “මහණෙනි, එක් දහමෙක් වඩන ලදුයේ බහුල කරන ලදුයේ සිවු දහමක් පුරවා නම් සිවු දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු සත් දහමක් පුරවත් නම් සත් දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු දෙ දහමක් පුරවත් නම් එබඳු දහමෙක් ඇතැ” යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 128,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "කතමො භන්තෙ, එකො ධම්මො භාවිතො බහුලීකතො චත්තාරො ධම්මෙ පරිපූරෙති, චත්තාරො ධම්මා භාවිතා බහුලීකතා සත්ත ධම්මෙ පරිපූරෙන්ති, සත්ත ධම්මා භාවිතා බහුලීකතා ද්වෙ ධම්මෙ පරිපූරෙන්තීති: ආනාපානසතිසමාධි ඛො භික්ඛවෙ, එකො ධම්මො භාවිතො බහුලීකතො චත්තාරො සතිපට්ඨානෙ පරිපූරෙති, චත්තාරො සතිපට්ඨානා භාවිතා බහුලීකතා සත්ත බොජ්ඣඞ්ගෙ පරිපූරෙන්ති, සත්ත බොජ්ඣඞ්ගා භාවිතා බහුලීකතා විජ්ජාවිමුත්තිං පරිපූරෙන්ති. කථං භාවිතො ච භික්ඛවෙ, ආනාපානසතිසමාධි කථං බහුලීකතො චත්තාරො සතිපට්ඨානෙ පරිපූරෙති: ඉධ භික්ඛවෙ, භික්ඛු අරඤ්ඤගතො වා -පෙ- එවං භාවිතා ඛො භික්ඛවෙ, සත්ත බොජ්ඣඞ්ගා එවං බහුලීකතා විජ්ජාවිමුත්තිං පරිපූරෙන්තීති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 2. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතියභික්ඛුසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3764. අථ ඛො සම්බහුලා භික්ඛූ යෙන භගවා තෙනුපසඞ්කමිංසු -පෙ- එකමන්තං නිසින්නෙ ඛො තෙ භික්ඛූ භගවා එතදවොච: අත්ථි නු ඛො භික්ඛවෙ, එකො ධම්මො භාවිතො බහුලීකතො චත්තාරො ධම්මෙ පරිපූරෙති, චත්තාරො ධම්මා භාවිතා බහුලීකතා සත්ත ධම්මෙ පරිපූරෙන්ති, සත්ත ධම්මා භාවිතා බහුලීකතා ද්වෙ ධම්මෙ පරිපූරෙන්තීති. භගවම්මූලකා නො භන්තෙ ධම්මා -පෙ- අත්ථි ඛො භික්ඛවෙ, එකො ධම්මො භාවිතො බහුලීකතො චත්තාරො ධම්මෙ පරිපූරෙති, චත්තාරො ධම්මා භාවිතා බහුලීකතා සත්ත ධම්මෙ පරිපූරෙන්ති, සත්ත ධම්මා භාවිතා බහුලීකතා ද්වෙ ධම්මෙ පරිපූරෙන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කතමො ච භික්ඛවෙ, එකො ධම්මො භාවිතො බහුලීකතො චත්තාරො ධම්මෙ පරිපූරෙති, චත්තාරො ධම්මා භාවිතා බහුලීකතා සත්ත ධම්මෙ පරිපූරෙන්ති, සත්ත ධම්මා භාවිතා බහුලීකතා ද්වෙ ධම්මෙ පරිපූරෙන්ති: ආනාපානසතිසමාධි ඛො භික්ඛවෙ, එකො ධම්මො භාවිතො බහුලීකතො චත්තාරො සතිපට්ඨානෙ පරිපූරෙති, චත්තාරො සතිපට්ඨානා භාවිතා බහුලීකතා සත්ත බොජ්ඣඞ්ගෙ පරිපූරෙන්ති, සත්ත බොජ්ඣඞ්ගා භාවිතා බහුලීකතා විජ්ජාවිමුත්තිං පරිපූරෙන්ති. කථං භාවිතො ච භික්ඛවෙ, ආනාපානසතිසමාධි කථං බහුලීකතො චත්තාරො සතිපට්ඨානෙ පරිපූරෙති: ඉධ භික්ඛවෙ, භික්ඛු අරඤ්ඤගතො වා රුක්ඛමූලගතො වා සුඤ්ඤාගාරගතො වා නිසීදති පල්ලඞ්කං ආභුජිත්වා උජුං කායං පණිධාය පරිමුඛං සතිං උපට්ඨපෙත්වා. සො සතොව අස්සසති, සතොව පස්සසති -පෙ- පටිනිස්සග්ගානුපස්සී අස්සසිස්සාමීති සික්ඛති, පටිනිස්සග්ගානුපස්සී පස්සසිස්සාමීති සික්ඛති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "වහන්ස, කවර එක් දහමෙක් වඩන ලදුයේ බහුල කරන ලදුයේ සිවු දහමක් පුරවා ද? (කවර) සිවු දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු සත් දහමක් පුරවත් ද? (කවර) සත් දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු දෙ දහමක් පුරවද්දැ යි. මහණෙනි, ආනාපානසතිසමාධි වූ එක්දහම වඩන ලදුයේ බහුල කරන ලදුයේ සිවු සීවටන් පුරවයි. සිවු සීවටන්හු වඩන ලදහු බහුල කරන ලදහු සත් බොජඟහු පුරවත්. සත් බොජඟහු වඩන ලදහු බහුල කරන ලදහු විජ්ජාවිමුත්ති පුරවත්. මහණෙනි, කෙසේ වඩන ලද කෙසේ බහුල කරන ලද ආනාපානසතිසමාධි සිවු සීවටන් පුරවා ද යත්: මහණෙනි, මෙහි මහණ අරනකට ගියේ හෝ ... මහණෙනි, මෙසේ වඩන ලද මෙසේ බහුල කරන ලද සත් බොජඟහු විජ්ජාවිමුත්ති පුරවත් යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 2. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතිය භික්‌ඛු සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3764. එකල්හි බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ ... එකත්පස් ව හුන් ඒ භික්ෂූන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: මහණෙනි, එක් දහමෙක් වඩන ලදුයේ බහුල කරන ලදුයේ සිවු දහමක් පුරවා නම් සිවු දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු සත් දහමක් පුරවත් නම් සත් දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු දෙදහමක් පුරවත් නම් එබඳු දහමෙක් ඇද්දැ යි. වහන්ස, අපගේ දහම්හු භගවත්හු මුල් කොට ඇතියහ ... මහණෙනි, එක් දහමෙක් වඩන ලදුයේ බහුල කරන ලදුයේ සිවු දහමක් පුරවා නම් සිවු දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු සත් දහමක් පුරවත් නම් සත් දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු දෙ දහමක් පුරවත් නම් එබඳු දහමෙක් ඇත.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කවර එක් දහමෙක් වඩන ලද්දේ බහුල කරන ලද්දේ සිවු දහමක් පුරවා ද, (කවර) සිවු දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු සත් දහමක් පුරවත් ද, (කවර) සත් දහම් කෙනෙක් වඩන ලදහු බහුල කරන ලදහු දෙ දහමක් පුරවද්දැ යි. මහණෙනි, ආනාපානසතිසමාධි වූ එක් දහම වඩන ලද්දේ බහුල කරන ලද්දේ සිවු සීවටන් පුරවයි. සිවු සීවටන්හු වඩන ලදහු බහුල කරන ලදහු සත් බොජඟ පුරවති. සත් බොජඟ වඩන ලද්දේ බහුල කරන ලද්දේ විජ්ජාවිමුත්ති පුරවයි. “මහණෙනි, ආනාපානසතිසමාධි කෙසේ වඩන ලදුයේ කෙසේ බහුල කරන ලදුයේ සිවු සීවටන් පුරවා ද යත්: මහණෙනි, මෙහි මහණ අරනකට ගියේ හෝ රුක්මුලකට ගියේ හෝ හිස්ගෙයකට ගියේ හෝ පලක් බැඳ උඩුකය කෙළින් තබා සිහිය අභිමුඛ කොට එළවාගෙන හිඳගනී. හේ සිහි ඇතියේ ම ආශ්වාස කෙරෙයි. සිහි ඇතියේ ම ප්‍රශ්වාස කෙරෙයි ... නිවන අනුව දක්නාසුලු ව ආශ්වාස කරන්නෙමි යි හික්මෙයි. නිවන අනුව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි යි හික්මෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 130,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ භික්ඛවෙ, භික්ඛු දීඝං වා අස්සසන්තො දීඝං අස්සසාමීති පජානාති, දීඝං වා පස්සසන්තො දීඝං පස්සසාමීති පජානාති, රස්සං වා -පෙ- සබ්බකායපටිසංවෙදී -පෙ- පස්සම්භයං කායසඞ්ඛාරං අස්සසිස්සාමීති සික්ඛති. පස්සම්භයං කායසඞ්ඛාරං පස්සසිස්සාමීති සික්ඛති. කායෙ කායානුපස්සී භික්ඛවෙ, භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තං කිස්ස හෙතු: කායඤ්ඤතරාහං භික්ඛවෙ, එතං වදාමි යදිදං අස්සාසපස්සාසං. තස්මාතිහ භික්ඛවෙ, කායෙ කායානුපස්සී භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ භික්ඛවෙ, භික්ඛු පීතිපටිසංවෙදී අස්සසිස්සාමීති සික්ඛති -පෙ-සුඛපටිසංවෙදී -පෙ- චිත්තසඞ්ඛාරපටිසංවෙදී -පෙ- පස්සම්භයං චිත්තසඞ්ඛාරං අස්සසිස්සාමීති සික්ඛති, පස්සම්භයං චිත්තසඞ්ඛාරං පස්සසිස්සාමීති සික්ඛති. වෙදනාසු වෙදනානුපස්සී භික්ඛවෙ, භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තං කිස්ස හෙතු: වෙදනාඤ්ඤතරාහං භික්ඛවෙ, එතං වදාමි. යදිදං අස්සාසපස්සාසානං සාධුකං මනසිකාරං. තස්මා තිහ භික්ඛවෙ, වෙදනාසු වෙදනානුපස්සී භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ භික්ඛවෙ, භික්ඛු චිත්තපටිසංවෙදී අස්සසිස්සාමීති සික්ඛති -පෙ-අභිප්පමොදයං චිත්තං -පෙ- සමාදහං චිත්තං -පෙ- විමොචයං චිත්තං අස්සසිස්සාමීති සික්ඛති. විමොචයං චිත්තං පස්සසිස්සාමීති සික්ඛති. චිත්තෙ චිත්තානුපස්සී භික්ඛවෙ, භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. තං කිස්ස හෙතු: නාහං භික්ඛවෙ, මුට්ඨස්සතිස්ස අසම්පජානස්ස ආනාපානසතිසමාධිභාවනං වදාමි. තස්මාතිහ භික්ඛවෙ, චිත්තෙ චිත්තානුපස්සී භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, යම් සමයෙක මහණ දිගු කොට හෝ ආශ්වාස කරනුයේ දිගු කොට ආශ්වාස කෙරෙමියි දනී ද, දිගු කොට හෝ ප්‍රශ්වාස කරනුයේ දිගු කොට ප්‍රශ්වාස කෙරෙමියි දනී ද, ලුහුඬු කොට හෝ ... සියලු ආශ්වාසප්‍රශ්වාස කය දන්නා සුලු ව ... කායසංස්කාර සංසිඳුවමින් ආශ්වාස කරන්නෙමියි හික්මේ ද, කායසංස්කාර සංසිඳුවමින් ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, මහණෙනි, එසමයෙහි මහණ කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇතිව මනාදැනුම් ඇතිව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. ඒ කවර හෙයින යත්: මහණෙනි, යම් මේ ආශ්වාසප්‍රශ්වාස වේ ද, මෙය එක්තරා කයෙකැයි මම කියමි. මහණෙනි, එහෙයින් මෙහි ලා මහණ එසමයෙහි කයෙහි කය අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව කාලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් කලෙක මහණ ප්‍රීතිය දන්නාසුලු ව ආශ්වාස කරන්නෙමි යි හික්මේ ද ... සුවය දන්නාසුලු ව ... චිත්තසංස්කාර දන්නාසුලු ව ... චිත්තසංස්කාර සංසිඳුවමින් ආශ්වාස කරන්නෙමි යි හික්මේ ද, චිත්තසංස්කාර සංසිඳුවමින් ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, මහණෙනි, එසමයෙහි මහණ වෙදනාවන්හි වෙදනා අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව විඳුම්ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙයි. ඒ කවර හෙයින යත්: මහණෙනි, ආශ්වාස ප්‍රශ්වාසයන් පිළිබඳ යම් මේ මැනවින් මෙනෙහි කිරීමෙක් වේ ද, මෙය එක්තරා වෙදනාවකැ යි මම කියමි. මහණෙනි, එහෙයින් මෙහි ලා මහණ එසමයෙහි වෙදනාවන්හි වෙදනා අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව විඳුම්ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් සමයෙක මහණ සිත දන්නාසුලු ව ආශ්වාස කරන්නෙමි යි හික්මේ ද ... සිත සතුටු කරවමින් ... සිත එකඟ කරමින් ... සිත මුදමින් ... ආශ්වාස කරන්නෙමි යි හික්මේ ද, සිත මුදමින් ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, මහණෙනි, එසමයෙහි මහණ සිත්හි සිත් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව සිත්ලෙව්හි දැඩි ලොබ හා දොම්නස දුරු කොට වෙසේ. ඒ කවර හෙයින යත්: මහණෙනි, මුළා සිහි ඇති මනා දැනුම් නැන්තහුට ආනාපානසතිසමාධිභාවනාවක් මම නො කියමි. මහණෙනි, එහෙයින් මෙහි ලා මහණ එසමයෙහි සිත්හි සිත් අනු ව දක්නා සුලු ව කෙලෙස් තවන වැර ඇති ව මනා දැනුම් ඇති ව සිහි ඇති ව සිත්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 132,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ භික්ඛවෙ, භික්ඛු අනිච්චානුපස්සී අස්සසිස්සාමීති සික්ඛති -පෙ-විරාගානුපස්සී -පෙ- නිරොධානුපස්සී -පෙ- පටිනිස්සග්ගානුපස්සී අස්සසිස්සාමීති සික්ඛති. පටිනිස්සග්ගානුපස්සී පස්සසිස්සාමීති සික්ඛති. ධම්මෙසු ධම්මානුපස්සී භික්ඛවෙ, භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. සො යං තං හොති අභිජ්ඣාදොමනස්සානං පහාණං, තං පඤ්ඤාය දිස්වා සාධුකං අජ්ඣුපෙක්ඛිතා හොති. තස්මාතිහ භික්ඛවෙ, ධම්මෙසු ධම්මානුපස්සී භික්ඛු තස්මිං සමයෙ විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. එවං භාවිතො ඛො භික්ඛවෙ, ආනාපානසතිසමාධි එවං බහුලීකතො චත්තාරො සතිපට්ඨානෙ පරිපූරෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථං භාවිතා ච භික්ඛවෙ චත්තාරො සතිපට්ඨානා කථං බහුලීකතා සත්ත බොජ්ඣඞ්ගෙ පරිපූරෙන්ති: යස්මිං සමයෙ භික්ඛවෙ, භික්ඛු කායෙ කායානුපස්සී විහරති, උපට්ඨිතා තස්ස තස්මිං සමයෙ සති හොති අසම්මුට්ඨා. යස්මිං සමයෙ භික්ඛවෙ, භික්ඛුනො උපට්ඨිතා සති හොති අසම්මුට්ඨා, සතිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො ආරද්ධො හොති. සතිසම්බොජ්ඣඞ්ගං තස්මිං සමයෙ භික්ඛු භාවෙති. සතිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො භාවනාපාරිපූරිං ගච්ඡති. සො තථා සතො විහරන්තො තං ධම්මං පඤ්ඤාය පවිචිනති පවිචරති පරිවීමංසමාපජ්ජති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ, භික්ඛවෙ, භික්ඛු තථා සතො විහරන්තො තං ධම්මං පඤ්ඤාය පවිචිනති පවිචරති පරිවීමංසමාපජ්ජති. ධම්මවිචයසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො ආරද්ධො. ධම්මවිචයසම්බොජ්ඣඞ්ගං තස්මිං සමයෙ භික්ඛු භාවෙති. ධම්මවිචයසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො භාවනාපාරිපූරිං ගච්ඡති. තස්ස තං ධම්මං පඤ්ඤාය පවිචිනතො පවිචරතො පරිවීමංසමාපජ්ජතො ආරද්ධං හොති වීරියං අසල්ලීනං."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ භික්ඛවෙ, භික්ඛුනො තං ධම්මං පඤ්ඤාය පවිචිනතො පවිචරතො පරිවීමංසමාපජ්ජතො ආරද්ධං හොති වීරියං අසල්ලීනං, විරියසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො ආරද්ධො හොති, විරියසම්බොජ්ඣඞ්ගං තස්මිං සමයෙ භික්ඛු භාවෙති. විරියසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො භාවනාපාරිපූරිං ගච්ඡති. ආරද්ධවිරියස්ස උප්පජ්ජති පීති නිරාමිසා."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ භික්ඛවෙ, භික්ඛුනො ආරද්ධවිරියස්ස උප්පජ්ජති පීති නිරාමිසා. පීතිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො ආරද්ධො හොති. පීතිසම්බොජ්ඣඞ්ගං තස්මිං සමයෙ භික්ඛු භාවෙති, පීතිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො භාවනාපාරිපූරිං ගච්ඡති. පීතිමනස්ස කායො‘පි පස්සම්භති, චිත්තම්පි පස්සම්භති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, යම් සමයෙක මහණ අනිත්‍යය අනු ව දක්නාසුලු ව ආශ්වාස කරන්නෙමි යි හික්මේ ද ... විරාගය අනු ව දක්නාසුලු ව නිරොධය අනුව දක්නාසුලු ව ... නිවන අනු ව දක්නාසුලු ව ආශ්වාස කරන්නෙමි යි හික්මේ ද, නිවන අනු ව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි යි හික්මේ ද, මහණෙනි, එසමයෙහි මහණ දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. හේ අභිජ්ඣාදොමනස්සයන්ගේ යම් ඒ ප්‍රහාණයෙක් වේ නම් එය නුවණින් දැක මැනවින් මැදහත් ව බලනසුලු වෙයි, මහණෙනි, එහෙයින් මෙහි ලා මහණ එසමයෙහි දහම්හි දහම් අනු ව දක්නාසුලු ව කෙලෙස් තවන වැර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව දහම්ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ. මහණෙනි, ආනාපානසතිසමාධිය මෙසේ වඩන ලදුයේ මෙසේ පුනපුනා කරන ලදුයේ සිවු සීවටන් පුරවයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ වඩන ලද කෙසේ බහුල කරන ලද සිවු සීවටන්හු සත් බොජඟ පුරවත් ද යත්: මහණෙනි, යම් කලෙක මහණ කයෙහි කය අනුව දක්නාසුලු ව වෙසේ ද, එකල්හි මහණහුගේ සිහිය නුමුළා ව එළඹ සිටියා වෙයි. මහණෙනි, යම් කලෙක මහණහුගේ සිහිය නුමුළා ව එළඹ සිටියා වේ ද, එකල්හි මහණහු විසින් සතිසම්බොජ්ඣඞ්ගය අරඹන ලද්දේ වෙයි. එකල්හි මහණ සතිසම්බොජ්ඣඞ්ගය වඩයි, එකල්හි මහණහුගේ සතිසම්බොජ්ඣඞ්ගය වැඩීමෙන් පිරීමට යේ. හෙතෙමේ එසේ සිහි ඇති ව වෙසෙනුයේ ඒ දහම නුවණින් සොයයි, පිරික්සයි, විමසුමට පැමිණෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් සමයෙක මහණ එසේ සිහි ඇතිව වෙසෙනුයේ ඒ දහම නුවණින් සොයා ද, පිරික්සා ද, විමසුමට පැමිණේ ද, එසමයෙහි මහණහු විසින් ධම්මවිචයසම්බොජ්ඣඞ්ගය අරඹන ලද්දේ වෙයි. එසමයෙහි මහණ ධම්මවිචයසම්බොජ්ඣඞ්ගය වඩයි. එසමයෙහි මහණහුගේ ධම්මවිචයසම්බොජ්ඣඞ්ගය වැඩීමෙන් පිරීමට යේ. ඒ දහම නුවණින් සොයන පිරික්සන විමසුමට පැමිණෙන ඔහු විසින් වැර අරඹන ලද්දේ නො සැඟවුනේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් සමයෙක ඒ දහම නුවණින් සොයන පිරික්සන විමසුමට පැමිණෙන මහණහු විසින් වෙර අරඹන ලද්දේ නොසැඟවුනේ වේ ද, එසමයෙහි මහණහු විසින් විරියසම්බොජ්ඣඞ්ගය අරඹන ලද්දේ වේ. එසමයෙහි මහණ විරියසම්බොජ්ඣඞ්ගය වඩයි. එසමයෙහි මහණහුගේ විරියසම්බොජ්ඣඞ්ගය වැඩීමෙන් පිරීමට යේ. පිරිපුන් වැර ඇත්තහුට නිරාමිස ප්‍රීතිය උපදී.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් සමයෙක පිරිපුන් වැර ඇති මහණහට නිරාමිස ප්‍රීතිය උපදී ද, එසමයෙහි මහණහු විසින් පීතිසම්බොජ්ඣඞ්ගය අරඹන ලද්දේ වෙයි. එසමයෙහි මහණ පීතිසම්බොජ්ඣඞ්ගය වඩයි. එසමයෙහි මහණහුගේ පීතිසම්බොජ්ඣඞ්ගය වැඩීමෙන් පිරීමට යේ. ප්‍රීතිසිත් ඇත්තහුගේ කයත් සංසිඳෙයි. සිතත් සංසිඳෙයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 134,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ භික්ඛවෙ, භික්ඛුනො පීතිමනස්ස කායො පි පස්සම්භති, චිත්තම්පි පස්සම්භති. පස්සද්ධිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො ආරද්ධො හොති. පස්සද්ධිසම්බොජ්ඣඞ්ගං තස්මිං සමයෙ භික්ඛු භාවෙති. පස්සද්ධිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො භාවනාපාරිපූරිං ගච්ඡති. පස්සද්ධකායස්ස සුඛිනො චිත්තං සමාධියති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ භික්ඛවෙ, භික්ඛුනො පස්සද්ධකායස්ස සුඛිනො චිත්තං සමාධියති. සමාධිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො ආරද්ධො හොති, සමාධිසම්බොජ්ඣඞ්ගං තස්මිං සමයෙ භික්ඛු භාවෙති, සමාධිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො භාවනාපාරිපූරිං ගච්ඡති. සො තථා සමාහිතං චිත්තං සාධුකං අජ්ඣුපෙක්ඛිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ භික්ඛවෙ, භික්ඛු තථාසමාහිතං චිත්තං සාධුකං අජ්ඣුපෙක්ඛිතා හොති. උපෙඛාසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො ආරද්ධො හොති. උපෙඛාසම්බොජ්ඣඞ්ගං තස්මිං සමයෙ භික්ඛු භාවෙති. උපෙඛාසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො භාවනාපාරිපූරිං ගච්ඡති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ භික්ඛවෙ, භික්ඛු වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති. උපට්ඨිතා තස්ස තස්මිං සමයෙ සති හොති අසම්මුට්ඨා. යස්මිං සමයෙ භික්ඛවෙ, භික්ඛුනො උපට්ඨිතා සති හොති අසම්මුට්ඨා, සතිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො ආරද්ධො හොති. සතිසම්බොජ්ඣඞ්ගං තස්මිං සමයෙ භික්ඛු භාවෙති. සතිසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො භාවනාපාරිපූරිං ගච්ඡති -පෙ- සො තථා සමාහිතං චිත්තං සාධුකං අජ්ඣුපෙක්ඛිතා හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "යස්මිං සමයෙ භික්ඛවෙ, භික්ඛු තථා සමාහිතං චිත්තං සාධුකං අජ්ඣුපෙක්ඛිතා හොති, උපෙඛාසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො ආරද්ධො හොති. උපෙඛාසම්බොජ්ඣඞ්ගං තස්මිං සමයෙ භික්ඛු භාවෙති. උපෙඛාසම්බොජ්ඣඞ්ගො තස්මිං සමයෙ භික්ඛුනො භාවනාපාරිපූරිං ගච්ඡති. එවං භාවිතා ඛො භික්ඛවෙ, චත්තාරො සතිපට්ඨානා එවං බහුලීකතා සත්ත බොජ්ඣඞ්ගෙ පරිපූරෙන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කථං භාවිතා ච භික්ඛවෙ, සත්ත බොජ්ඣඞ්ගා කථං බහුලීකතා විජ්ජාවිමුත්තිං පරිපූරෙන්ති: ඉධ භික්ඛවෙ, භික්ඛු සතිසම්බොජ්ඣඞ්ගං භාවෙති, විවෙකනිස්සිතං විරාගනිස්සිතං නිරොධනිස්සිතං වොස්සග්ගපරිණාමිං -පෙ- උපෙඛාසම්බොජ්ඣඞ්ගං භාවෙති, විවෙකනිස්සිතං විරාගනිස්සිතං නිරොධනිස්සිතං වොස්සග්ගපරිණාමිං. එවං භාවිතා ඛො භික්ඛවෙ, සත්ත බොජ්ඣඞ්ගා එවං බහුලීකතා විජ්ජාවිමුත්තිං පරිපූරෙන්තීති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මහණෙනි, යම් කලෙක ප්‍රීති සිත් ඇති මහණහුගේ කයත් සංසිඳේ ද සිතත් සංසිඳේ ද එසමයෙහි මහණහු විසින් පස්සද්ධිසම්බොජ්ඣඞ්ගය අරඹන ලද්දේ වෙයි. එසමයෙහි මහණ පස්සද්ධිසම්බොජ්ඣඞ්ගය වඩයි. එසමයෙහි මහණහුගේ පස්සද්ධිසම්බොජ්ඣඞ්ගය වැඩීමෙන් පිරීමට යේ. සන්සුන් කය ඇති සුව ඇත්තහුගේ සිත එකඟ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් කලෙක සන්හුන් කය ඇති සුව ඇති මහණහුගේ සිත එකඟ වේ ද, එසමයෙහි මහණහු විසින් සමාධිසම්බොජ්ඣඞ්ගය අරඹන ලද්දේ වෙයි. එසමයෙහි මහණතෙමේ සමාධිසම්බොජ්ඣඞ්ගය වඩයි. එසමයෙහි මහණහුගේ සමාධිසම්බොජ්ඣඞ්ගය වැඩීමෙන් පිරීමට යේ. හෙතෙමේ එසේ එකඟ වූ සිත මැනවින් මැදහත් ව බලනසුලු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් සමයෙක මහණ තෙමේ එසේ එකඟ වූ සිත මැනවින් මැදහත් ව බලනසුලු වේ ද, එසමයෙහි මහණහු විසින් උපෙඛාසම්බොජ්ඣඞ්ගය අරඹන ලද්දේ වෙයි. එසමයෙහි මහණ තෙමේ උපෙඛාසම්බොජ්ඣඞ්ගය වඩයි. එසමයෙහි මහණහුගේ උපෙඛාසම්බොජ්ඣඞ්ගය වැඩීමෙන් පිරීමට යේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් කලෙක මහණ තෙමේ වෙදනාවන්හි ... සිත්හි ... දහම්හි දහම් අනුව දක්නාසුලු ව වෙසේ ද, එසමයෙහි ඔහුගේ සිහිය නුමුළා ව එළඹ සිටියා වෙයි. මහණෙනි, යම් කලෙක මහණහුගේ සිහිය නුමුළා ව එළඹ සිටියා වේ ද, එසමයෙහි මහණහු විසින් සතිසම්බොජ්ඣඞ්ගය අරඹන ලද්දේ වෙයි. එසමයෙහි මහණ තෙමේ සතිසම්බොජ්ඣඞ්ගය වඩයි. එසමයෙහි මහණහුගේ සතිසම්බොජ්ඣඞ්ගය වැඩීමෙන් පිරීමට යේ ... හෙතෙමේ එසේ එකඟවූ සිත මැනවින් මැදගත් ව දක්නාසුලු වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, යම් සමයෙක මහණ තෙමේ එසේ එකඟ වූ සිත මැනවින් මැදහත් ව බලනසුලු වේ ද, එසමයෙහි මහණහු විසින් උපෙඛාසම්බොජ්ඣඞ්ගය අරඹන ලද්දේ වෙයි. එසමයෙහි මහණ උපෙඛාසම්බොජ්ඣඞ්ගය වඩයි. එසමයෙහි මහණහුගේ උපෙඛාසම්බොජ්ඣඞ්ගය වැඩීමෙන් පිරීමට යේ. මහණෙනි, මෙසේ වඩන ලද මෙසේ බහුල කරන ලද සිවු සීවටන්හු සත් බොජඟ පුරවත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මහණෙනි, කෙසේ වඩන ලද කෙසේ බහුල කරන ලද සත් බොජඟහු විජ්ජාවිමුත්ති පුරවත් ද යත්: මහණෙනි, මෙහි මහණ විවෙකනිස්සිත විරාගනිස්සිත නිරොධනිස්සිත වොස්සග්ගපරිණාමි කොට සතිසම්බොජ්ඣඞ්ගය වඩයි ... විවෙකනිස්සිත විරාගනිස්සිත නිරොධනිස්සිත වොස්සග්ගපරිණාමි කොට උපෙඛාසම්බොජ්ඣඞ්ගය වඩයි. මහණෙනි, මෙසේ වඩන ලද බහුල කරන ලද සත් බොජඟහු විජ්ජාවිමුත්ති පුරවති යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 136,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 2. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සංයොජනසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3765. ආනාපානසතිසමාධි භික්ඛවෙ, භාවිතො බහුලීකතො සංයොජනප්පහානාය{1} සංවත්තති. කථං භාවිතො ච භික්ඛවෙ, ආනාපානසතිසමාධි කථං බහුලීකතො සංයොජනප්පහානාය සංවත්තති? ඉධ භික්ඛවෙ, භික්ඛු අරඤ්ඤගතො වා රුක්ඛමූලගතො වා සුඤ්ඤාගාරගතො වා - පෙ- පටිනිස්සග්ගානුපස්සී පස්සසිස්සාමීති සික්ඛති. එවං භාවිතො ඛො භික්ඛවෙ, ආනාපානසතිසමාධි එවං බහුලීකතො සංයොජනප්පහානාය සංවත්තතීති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 2. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අනුසයසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3766. ආනාපානසතිසමාධි භික්ඛවෙ -පෙ- අනුසයසමුග්ඝාතාය සංවත්තතීති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 2. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අද්ධානසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3767. ආනාපානසතිසමාධි භික්ඛවෙ -පෙ- අද්ධානපරිඤ්ඤාය සංවත්තතීති."
                    },
                    {
                        "type": "centered",
                        "text": "10. 2. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආසවක්ඛයසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3768. ආනාපානසතිසමාධි භික්ඛවෙ -පෙ- ආසවානං ඛයාය සංවත්තතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "(ඉමානි තිණි සුත්තානිපි යථා සංයොජනසුත්තං විත්ථාරෙතබ්බානි.)"
                    },
                    {
                        "type": "centered",
                        "text": "ආනන්දවග්ගො දුතියො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රැද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "ඉච්ඡානඞ්ගලං කඞ්ඛෙය්යං ආනන්දෙන පරෙ දුවෙ\nද්වෙ භික්ඛූ සංයොජනානුසයා අද්ධානමාසවක්ඛයොති."
                    },
                    {
                        "type": "centered",
                        "text": "ආනාපානසංයුත්තං සමත්තං.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රවග්ගුද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "එකධම්මො ආනන්දොති ද්වෙච වග්ගා සුදෙසිතා\nආපානස්ස සංයුත්තෙ මුනිනා ධම්මසාමිනාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සංයොජනානං පහාණාය - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "10. 2. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සංයොජන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3765. මහණෙනි, ආනාපානසතිසමාධිය වඩන ලද්දේ පුනපුනා කරන ලද්දේ සංයොජන ප්‍රහාණය පිණිස පවතී. මහණෙනි, ආනාපානසතිසමාධිය කෙසේ වඩන ලද්දේ කෙසේ බහුල කරන ලද්දේ සංයොජන ප්‍රහාණය පිණිස පවතීද යත්: මහණෙනි, මෙහි මහණ අරණකට ගියේ හෝ රුක්මුලකට ගියේ හෝ හිස්ගෙයකට ගියේ හෝ ... නිවන අනු ව දක්නාසුලු ව ප්‍රශ්වාස කරන්නෙමි යි හික්මේ. මහණෙනි, ආනාපානසතිසමාධිය මෙසේ වඩන ලද්දේ මෙසේ බහුල කරන ලද්දේ සංයොජන ප්‍රහාණය පිණිස පවතී යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 2. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අනුසය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3766. මහණෙනි, ආනාපානසතිසමාධිය ... අනුසය නැසීම පිණිස පවතී යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 2. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අද්‌ධාන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3767. මහණෙනි, ආනාපානසතිසමාධිය ... අදන් පිරිසිඳ දැනීම පිණිස පවතී යි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "10. 2. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආසවක්‌ඛය සූත්‍රය",
                        "level": 1
                    },
                    {
                        "text": "3768. මහණෙනි, ආනාපානසතිසමාධිය ... ආස්‍රවක්‍ෂය පිණිස පවතී යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "(මේ තුන් සුතුර ද සංයොජන සුතුර මෙන් විතර කටයුතු.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "දෙවැනි ආනන්ද වර්ග යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි සූත්‍රනාමමාලාව:**",
                        "type": "unindented"
                    },
                    {
                        "text": "ඉච්ඡාඞ්ගල සඞ්ඛෙය්‍ය යී දෙසුතුරෙකි. ආනන්ද නමින් අනෙක් සුතුරු දෙකකි. භික්ඛු නමිනුදු සුතුරු දෙකෙකි. සංයොජන අනුසය අද්ධාන අසවක්ඛය යී සිවු සුතුරෙකි යි මුළුල්ල දශයෙකි යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අනාපානසංයුත්තය නිමියේ ය.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "**එහි වර්ග නාමාවලිය:**",
                        "type": "unindented"
                    },
                    {
                        "text": "ධර්මස්වාමි මුනීන්ද්‍රයන් වහන්සේ විසින් අනාපානසංයුත්තයෙහි එකධම්ම, ආනන්ද යි වර්ග දෙකෙක් ම මැනවින් දෙශනා කරණ ලද යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        }
    ]
}