{
    "filename": "vp-pct-2-5",
    "pages": [
        {
            "pageNum": 372,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "5. පාටිදෙසනීයා",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "පඨමපාටිදෙසනීයසික්ඛාපදං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො පනාය්යායො අට්ඨ පාටිදෙසනීයා ධම්මා උද්දෙසං ආගච්ඡන්ති:"
                    },
                    {
                        "type": "paragraph",
                        "text": "1. තෙන සමයෙන බුද්ධො භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තෙන ඛො පන සමයෙන ඡබ්බග්ගියා භික්ඛුනියො සප්පිං විඤ්ඤාපෙත්වා භුඤ්ජන්ති. මනුස්සා උජ්ඣායන්ති ඛීයන්ති විපාචෙන්ති: “කථං හි නාම භික්ඛුනියො සප්පිං විඤ්ඤාපෙත්වා භුඤ්ජිස්සන්ති. කස්ස සම්පන්නං න මනාපං, කස්ස සාදුං න රුච්චතී”ති. අස්සොසුං ඛො භික්ඛුනියො තෙසං මනුස්සානං උජ්ඣායන්තානං ඛිය්යන්තානං විපාචෙන්තානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. යා තා භික්ඛුනියො අප්පිච්ඡා -පෙ- තා උජ්ඣායන්ති ඛීයන්ති විපාචෙන්ති: – “කථං හි නාම ඡබ්බග්ගියා භික්ඛුනියො සප්පිං විඤ්ඤාපෙත්වා භුඤ්ජිස්සන්තී”ති -පෙ- සච්චං කිර, භික්ඛවෙ, ඡබ්බග්ගියා, භික්ඛුනියො සප්පිං විඤ්ඤාපෙත්වා භුඤ්ජන්තීති. සච්චං භගවා. විගරහි බුද්ධො භගවා -පෙ- කථං හි නාම භික්ඛවෙ ඡබ්බග්ගියා භික්ඛුනියො සප්පිං විඤ්ඤාපෙත්වා භුඤ්ජිස්සන්ති. නෙතං භික්ඛවෙ අප්පසන්නානං වා පසාදාය -පෙ- එවඤ්ච පන භික්ඛවෙ භික්ඛුනියො ඉමං සික්ඛාපදං උද්දිසන්තු."
                    },
                    {
                        "type": "paragraph",
                        "text": "**“යා පන භික්ඛුනී සප්පිං විඤ්ඤාපෙත්වා භුඤ්ජෙය්ය, පටිදෙසෙතබ්බං තාය භික්ඛුනියා – ගාරය්හං අය්යෙ ධම්මං ආපජ්ජිං අසප්පායං පාටිදෙසනීයං තං පටිදෙසෙමී**ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවඤ්චිදං භගවතා භික්ඛුනීනං සික්ඛාපදං පඤ්ඤත්තං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. තෙන ඛො පන සමයෙන භික්ඛුනියො ගිලානා හොන්ති. ගිලානපුච්ඡිකා භික්ඛුනියො ගිලානා භික්ඛුනියො එතදවොචුං: “කච්චි අය්යෙ ඛමනීයං කච්චි යාපනීය”න්ති. “පුබ්බෙ මයං, අය්යෙ සප්පිං විඤ්ඤාපෙත්වා භුඤ්ජාම. තෙන නො ඵාසු හොති. ඉදානි පන භගවතා පටික්ඛිත්තන්ති කුක්කුච්චායන්තා න විඤ්ඤාපෙම. තෙන නො න ඵාසු හොතී”ති. -පෙ- භගවතො එතමත්ථං ආරොචෙසුං -පෙ- “අනුජානාමි භික්ඛවෙ ගිලානාය භික්ඛුනියා සප්පිං විඤ්ඤාපෙත්වා භුඤ්ජිතුං”. එවඤ්ච පන භික්ඛවෙ භික්ඛුනියො ඉමං සික්ඛාපදං උද්දිසන්තු."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යා පන භික්ඛුනී අගිලානා සප්පිං විඤ්ඤාපෙත්වා භුඤ්ජෙය්ය පටිදෙසෙතබ්බං තාය භික්ඛුනියා ගාරය්හං අය්යෙ ධම්මං ආපජ්ජිං අසප්පායං පාටිදෙසනීයං තං පටිදෙසෙමී**ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "4. **යා පනා**ති: යා යාදිසා -පෙ- **භික්ඛුනීති** -පෙ- අයං ඉමස්මිං අත්ථෙ අධිප්පෙතා භික්ඛුනීති."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "5. පාටිදේසනීය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "පළමු පිළිදෙස්නී සිකපදය",
                        "level": 1
                    },
                    {
                        "text": "ආර්‍ය්‍යාවෙනි, මේ අෂ්ටපාටිදේසනීය ධර්‍මයෝ උදෙසීමට පැමිණෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "1. එසමයෙහි භාග්‍යවත් බුදුහු සැවැතැ ජේතවන නම් අනේපිඬු සිටුහුගේ අරම්හි වැඩැ වෙසෙති. එසමයෙහි සවග මෙහෙණෝ ගිතෙල් විනවා වළඳත්. මිනිස්සු ලමුකොට සිතති. නුගුණ පවසති. දොස් පතුරුවත්. “කෙසේ නම් මෙහෙණෝ ගිතෙල් විනවා වැළඳූහු දැ”යි. කවරකුහට මිහිරිදැය නො මැනැවි ද, කවරකුහට රසවත්දැය නො රුස්නේ දැ යි. භික්‍ෂුණීහු ලමුකොට සිතන නුගුණ පවසන දොස් පතුරුවන ඒ මිනිසුන්ගේ (අකීර්‍තති ශබ්දය) ඇසූහු.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. යම් ඒ මෙහෙණ කෙනෙක් අපිස්වූවෝ ... ඔහු ලමුකොට සිතති. නුගුණ පවසති. දොස් පතුරුවත්. “කෙසේ නම් සවග මෙහෙණෝ ගිතෙල් විනවා වැළඳූහුදැ” යි ... සැබෑද මහණෙනි සවග මෙහෙණෝ ගිතෙල් විනවා වළඳත්දැයි. සැබැවැ භාග්‍යවතුන් වහන්ස. භාග්‍යවත් බුදුහු ගැරහූ ... කෙසේ නම් මහණෙනි සවග මෙහෙණෝ ගිතෙල් විනවා වැළඳූහුද. මහණෙනි මෙය අප්‍රසන්නයන්ගේ ප්‍රසාදය පිණිස හෝ නොවෙයි ... මෙසේ ද මහණෙනි මෙහෙණෝ මේ සිකපදය උදෙසත්වා.",
                        "type": "paragraph"
                    },
                    {
                        "text": "**යම් මෙහෙණක් ගිතෙල් විනවා වළඳා නම් ඒ මෙහෙණ විසින් ආර්‍ය්‍යාවෙනි ගැරහිය යුතුවූ නුසුදුසුවූ පිළිදෙස්නට නිසි ඇවතකට පැමිණියෙමි. එය පිළිදෙසමි යි පටිදේසනා කළයුතුයි.**",
                        "type": "paragraph"
                    },
                    {
                        "text": "මෙසේත් භාග්‍යවතුන් විසින් මෙහෙණන්හට මේ සිකපදය පනවන ලද්දේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. එසමයෙහි මෙහෙණෝ ගිලන්වූවාහු වෙති. ගිලනුන් පුළුවුස්නා මෙහෙණෝ ගිලන් මෙහෙණන්හට තෙල කරුණ කීහු. “කිමෙක්ද ආර්‍ය්‍යාවෙනි ඉවසියහැකිද යැපිය හැකිදැ” යි. “ආර්‍ය්‍යාවෙනි ඇපි පෙරැ ගිතෙල් විනවා වළඳමු. එයින් අපට පහසු වෙයි. දැන් වනාහි භාග්‍යවතුන් විසින් පිළිකෙව් කරන ලදැයි කුකුස්කරන්නමෝ නො විනවමු. එයින් අපට පහසු නො වේයැ” යි. තෙල කරුණ භාග්‍යවතුන්හට ඇරොජූහ ... මහණෙනි ගිලන් මෙහෙණහට ගිතෙල් විනවා බුදින්නට අනුදනිමි. මෙසේ ද මහණෙනි මෙහෙණෝ මේ සිකපදය උදෙසත්වා.",
                        "type": "paragraph"
                    },
                    {
                        "text": "**යම් මෙහෙණක් නොගිලන්වූවා ගිතෙල් විනවා වළඳා නම් ඒ මෙහෙණ විසින් ආර්‍ය්‍යාවෙනි ගැරහියයුතු වූ නුසුදුසු වූ පිළිදෙස්නට නිසි ඇවැතකට පැමිණියෙමි, එය පිළිදෙසමියි.**",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. යා පන යනු: යම් යම්බඳු ... භික්ඛුනී යනු ... මෝ තොමෝ මේ අර්‍ත්‍ථයෙහි ලා අදහස් කරන ලද මෙහෙණ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 374,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**අගිලානා** නාම: යස්සා විනා සප්පිනා ඵාසු හොති. **ගිලානා** නාම: යස්සා විනා සප්පිනා න ඵාසු හොති. **සප්පි** නාම: ගොසප්පි වා අජිකා සප්පි වා මාහිසං වා සප්පි{1}. යෙසං මංසං කප්පති තෙසං සප්පි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අගිලානා අත්තනො අත්ථාය විඤ්ඤාපෙති පයොගෙ දුක්කටං. පටිලාභෙන භුඤ්ජිස්සාමීති පටිගණ්හාති ආපත්ති දුක්කටස්ස. අජ්ඣොහාරෙ අජ්ඣොහාරෙ ආපත්ති පාටිදෙසනීයස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "අගිලානා අගිලානසඤ්ඤා සප්පිං විඤ්ඤාපෙත්වා භුඤ්ජති ආපත්ති පාටිදෙසනීයස්ස. අගිලානා වෙමතිකා සප්පිං විඤ්ඤාපෙත්වා භුඤ්ජති ආපත්ති පාටිදෙසනීයස්ස. අගිලානා ගිලානසඤ්ඤා සප්පිං විඤ්ඤාපෙත්වා භුඤ්ජති ආපත්ති පාටිදෙසනීයස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "ගිලානා අගිලානසඤ්ඤා ආපත්ති දුක්කටස්ස. ගිලානා වෙමතිකා ආපත්ති දුක්කටස්ස. ගිලානා ගිලානසඤ්ඤා අනාපත්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අනාපත්ති:** ගිලානාය ගිලානා හුත්වා විඤ්ඤාපෙත්වා අගිලානා භුඤ්ජති, ගිලානාය සෙසකං භුඤ්ජති, ඤාතකානං පවාරිතානං, අඤ්ඤස්සත්ථාය, අත්තනො ධනෙන, උම්මත්තිකාය, ආදිකම්මිකායාති."
                    },
                    {
                        "type": "centered",
                        "text": "පඨමපාටිදෙසනීයසික්ඛාපදං.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතියා-අට්ඨම පාටිදෙසනීයසික්ඛාපදං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1. තෙන සමයෙන බුද්ධො භගවා **සාවත්ථියං** විහරති **ජෙතවනෙ අනාථපිණ්ඩිකස්ස** ආරාමෙ. තෙන ඛො පන සමයෙන ඡබ්බග්ගියා භික්ඛුනියො තෙලං විඤ්ඤාපෙත්වා භුඤ්ජන්ති. -පෙ- මධුං විඤ්ඤාපෙත්වා භුඤ්ජන්ති -පෙ- ඵාණිතං විඤ්ඤාපෙත්වා භුඤ්ජන්ති -පෙ- මච්ඡං විඤ්ඤාපෙත්වා භුඤ්ජන්ති -පෙ- මංසං විඤ්ඤාපෙත්වා භුඤ්ජන්ති -පෙ- ඛීරං විඤ්ඤාපෙත්වා භුඤ්ජන්ති -පෙ- දධිං විඤ්ඤාපෙත්වා භුඤ්ජන්ති. මනුස්සා උජ්ඣායන්ති ඛීයන්ති විපාචෙන්ති. “කථං හි නාම භික්ඛුනියො දධිං විඤ්ඤාපෙත්වා භුඤ්ජිස්සන්ති. කස්ස සම්පන්නං න මනාපං, කස්ස සාදුං න රුච්චතීති. අස්සොසුං ඛො භික්ඛුනියො තෙසං මනුස්සානං උජ්ඣායන්තානං ඛිය්යන්තානං විපාචෙන්තානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. යා තා භික්ඛුනියො අප්පිච්ඡා -පෙ- තා උජ්ඣායන්ති ඛීයන්ති විපාචෙන්ති,– “කථං හි නාම ඡබ්බග්ගියා භික්ඛුනියො දධිං විඤ්ඤාපෙත්වා භුඤ්ජිස්සන්තී”ති -පෙ- සච්චං කිර භික්ඛවෙ ඡබ්බග්ගියා භික්ඛුනියො දධිං විඤ්ඤාපෙත්වා භුඤ්ජන්තීති. සච්චං භගවා. විගරහි බුද්ධො භගවා -පෙ- කථං හි නාම භික්ඛවෙ ඡබ්බග්ගියා භික්ඛුනියො දධිං විඤ්ඤාපෙත්වා භුඤ්ජිස්සන්ති. නෙතං භික්ඛවෙ, අප්පසන්නානං වා පසාදාය -පෙ- එවඤ්ච පන භික්ඛවෙ භික්ඛුනියො ඉමං සික්ඛාපදං උද්දිසන්තු."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. මහිසසපපීවා, මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "අගිලානා නම්: යමකට ගිතෙලින් වෙන්වැ පහසු වේ නම් හෝ යැ. ගිලානා නම්: යමකට ගිතෙලින් වෙන්වැ පහසු නො වේ නම් හෝ යැ. සප්පි නම්: ගව ගිතෙල් හෝ එළු ගිතෙල් හෝ මිහි ගිතෙල් හෝ යි. යම් කෙනෙකුන්ගේ මස් කැප නම් ඔවුන්ගේ ගිතෙල් යැ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "නොගිලන්වූවා තමා උදෙසා විනවා නම් පියෝහි දුකුළා යැ. පිළිලැබීමෙන් වළඳන්නෙමියි පිළිගනී නම් දුකුළා ඇවැත් වෙයි. පරඟලායෙහි පරඟලායෙහි පිළිදෙස්නී ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "නොගිලන්වූවා නොගිලන්සන් ඇතිවැ ගිතෙල් විනවා වළඳා නම් පිළිදෙස්නී ඇවැත් වෙයි. නොගිලන්වූවා විමති ඇතිවැ ගිතෙල් විනවා වළඳා නම් පිළිදෙස්නී ඇවැත් වෙයි. නොගිලන්වූවා ගිලන්සන් ඇතිවැ ගිතෙල් විනවා නම් පිළිදෙස්නී ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ගිලන්වූවා නොගිලන්සන් ඇතියා නම් දුකුළා ඇවැත් වෙයි. ගිලන්වූවා විමතිඇතියා නම් දුකුළා ඇවැත් වෙයි. ගිලන්වූවා ගිලන්සන් ඇතියා නම් ඇවැත් නැති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අනාපත්ති: ගිලනහට ගිලනක්වැ විනවා නොගිලනක්වැ වළඳා නම්, ගිලනගේ ශේෂය වළඳා නම්, නෑයන්ගේ, පෑවරියන්ගේ, අනෙකක්හු උදෙසා නම්, තමාගේ ධනයෙන්, උන්මත්තිකාවට, ආදිකම්මිකාවට ඇවැත් නැති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පළමු පිළිදෙස්නී සිකපදය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දෙවන – අටවන පිළිදෙස්නී සිකපදය",
                        "level": 1
                    },
                    {
                        "text": "1. එසමයෙහි භාග්‍යවත් බුදුහු සැවැතැ ජේතවන නම් අනේපිඬු සිටුහුගේ අරම්හි වැඩැ වෙසෙති. එසමයෙහි වනාහි සවග මෙහෙණෝ තලතෙල් විනවා වළඳත්. ... මී විනවා වළඳත්. ... උක්පැණි විනවා වළඳත්. ... දියමස් විනවා වළඳත්. ... ගොඩමස් විනවා වළඳත්. ... කිරි විනවා වළඳත්. ... දිහි විනවා වළඳත්. මිනිස්සු ලමුකොට සිතති. නුගුණ පවසති. දොස්පතුරුවත්. “කෙසේ නම් මෙහෙණෝ දිහි විනවා ගෙන වැළඳූහුදැ” යි. කවරකුහට මිහිරිදැය නොමැනැවිද, කවරකුහට රසවත්දැය නොරුස්නේ දැ යි. භික්‍ෂුණීහු ලමුකොට සිතන නුගුණ පවසන දොස් පතුරුවන ඒ මිනිසුන්ගේ (අකීර්ති ශබ්දය) ඇසූහු.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. යම් ඒ මෙහෙණ කෙනෙක් අපිස්වූවෝ ... ඔහු ලමුකොට සිතති, නුගුණ පවසති, දොස් පතුරුවත්. කෙසේ නම් සවග මෙහෙණෝ දිහි විනවා වැළඳූහුදැ යි ... සැබෑද මහණෙනි සවග මෙහෙණෝ දිහි විනවා වළඳත්දැයි. සැබැවැ භාග්‍යවතුන් වහන්ස. භාග්‍යවත් බුදුහු විගැරහූ ... කෙසේ නම් මහණෙනි සවග මෙහෙණෝ දිහි විනවා වැළඳූහුද. මහණෙනි මෙය අප්‍රසන්නයන්ගේ ප්‍රසාදය පිණිස හෝ නො වෙයි. ... මෙසේද මහණෙනි මෙහෙණෝ මේ සිකපදය උදෙසත්වා.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 376,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**යා පන භික්ඛුනී දධිං විඤ්ඤාපෙත්වා භුඤ්ජෙය්ය පටිදෙසෙතබ්බං තාය භික්ඛුනියා – ‘ගාරය්හං අය්යෙ ධම්මං ආපජ්ජිං අසප්පායං පාටිදෙසනීයං තං පටිදෙසෙමී**ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවඤ්චිදං භගවතා භික්ඛුනීනං සික්ඛාපදං පඤ්ඤත්තං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. තෙන ඛො පන සමයෙන භික්ඛුනියො ගිලානා හොන්ති. ගිලානපුච්ඡිකා භික්ඛුනියො ගිලානා භික්ඛුනියො එතදවොචුං: “කච්චි අය්යෙ ඛමනීයං කච්චි යාපනීය”න්ති. “පුබ්බෙ මයං, අය්යෙ දධිං විඤ්ඤාපෙත්වා භුඤ්ජාම{1}. තෙන නො ඵාසු හොති. ඉදානි පන භගවතා පටික්ඛිත්තන්ති කුක්කුච්චායන්තා න විඤ්ඤාපෙම. තෙන නො න ඵාසු හොතී”ති -පෙ- භගවතො එතමත්ථං ආරොචෙසුං -පෙ- “අනුජානාමි භික්ඛවෙ ගිලානාය භික්ඛුනියා දධිං විඤ්ඤාපෙත්වා භුඤ්ජිතුං”. එවඤ්ච පන භික්ඛවෙ භික්ඛුනියො ඉමං සික්ඛාපදං උද්දිසන්තු."
                    },
                    {
                        "type": "paragraph",
                        "text": "**“යා පන භික්ඛුනී අගිලානා දධිං විඤ්ඤාපෙත්වා භුඤ්ජෙය්ය පටිදෙසෙතබ්බං තාය භික්ඛුනියා ගාරය්හං අය්යෙ ධම්මං ආපජ්ජිං අසප්පායං පාටිදෙසනීයං තං පටිදෙසෙමී**ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "4. **යා පනාති**: යා යාදිසා -පෙ- **භික්ඛුනීති**: -පෙ- අයං ඉමස්මිං අත්ථෙ අධිප්පෙතා භික්ඛුනීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අගිලානා** නාම: යස්සා විනා දධිනා ඵාසු හොති. **ගිලානා** නාම: යස්සා විනා දධිනා න ඵාසු හොති. **තෙලං** නාම: තිලතෙලං සාසපතෙලං මධුකතෙලං එරණ්ඩතෙලං වසාතෙලං. **මධු** නාම: මක්ඛිකාමධු. **ඵාණිතං** නාම: උච්ඡුම්හා නිබ්බත්තං. **මච්ඡො** නාම: ඔදකො වුච්චති. **මංසං** නාම: යෙසං මංසං කප්පති තෙසං මංසං. **ඛීරං** නාම: ගොඛීරං වා අජිකාඛීරං වා මහිංසඛීරං වා යෙසං මංසං කප්පති තෙසං ඛීරං. **දධි** නාම: තෙසඤ්ඤෙව දධිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අගිලානා අත්තනො අත්ථාය විඤ්ඤාපෙති පයොගෙ දුක්කටං. පටිලාභෙන භුඤ්ජිස්සාමීති පටිගණ්හාති ආපත්ති දුක්කටස්ස. අජ්ඣොහාරෙ අජ්ඣොහාරෙ ආපත්ති පාටිදෙසනීයස්ස. අගිලානා අගිලානසඤ්ඤා දධිං විඤ්ඤාපෙත්වා භුඤ්ජති ආපත්ති පාටිදෙසනීයස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "අගිලානා අගිලානසඤ්ඤා දධිං විඤ්ඤාපෙත්වා භුඤ්ජති ආපත්ති පාටිදෙසනීයස්ස. අගිලානා වෙමතිකා දධිං විඤ්ඤාපෙත්වා භුඤ්ජති ආපත්ති පාටිදෙසනීයස්ස. අගිලානා ගිලානසඤ්ඤා දධිං විඤ්ඤාපෙත්වා භුඤ්ජති ආපත්ති පාටිදෙසනීයස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "ගිලානා අගිලානසඤ්ඤා ආපත්ති දුක්කටස්ස. ගිලානා වෙමතිකා ආපත්ති දුක්කටස්ස. ගිලානා ගිලානසඤ්ඤා අනාපත්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. භුඤ්ජිම්හා - මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "**යම් මෙහෙණක් දිහි විනවා වළඳා නම් ඒ මෙහෙණ විසින් ආර්‍ය්‍යාවෙනි ගැරහියයුතු වූ නුසුදුසු වූ පිළිදෙස්නට නිසි ඇවැතකට පැමිණියෙමි. එය පිළිදෙසමියි.**",
                        "type": "paragraph"
                    },
                    {
                        "text": "මෙසේත් භාග්‍යවතුන් විසින් මෙහෙණන්හට මේ සිකපදය පනවන ලද්දේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. එසමයෙහි මෙහෙණෝ ගිලන්වූවාහු වෙති. ගිලනුන් පුළුවුස්නා මෙහෙණෝ ගිලන් මෙහෙණන්හට තෙල කරුණ කීහු. “කිමෙක්ද ආර්‍ය්‍යාවෙනි ඉවසිය හැකිද කිම යැපියහැකිදැ”යි. “ආර්‍ය්‍යාවෙනි, ඇපි පෙරැ දිහි විනවා වළඳමු. එයින් අපට පහසුවෙයි. දැන් වනාහි භාග්‍යවතුන් විසින් පිළිකෙව් කරනලදැයි කුකුස්කරන්නමෝ නො විනවමු. එයින් අපට පහසු නො වේයැ” යි. තෙල කරුණ භාග්‍යවතුන් හට ඇරොජූහු. ... මහණෙනි, ගිලන් මෙහෙණහට දිහි විනවා බුදින්නට අනුදනිමි. මෙසේද මහණෙනි, මෙහෙණෝ මේ සිකපදය උදෙසත්වා.",
                        "type": "paragraph"
                    },
                    {
                        "text": "**යම් මෙහෙණක් නොගිලන්වූවා දිහි විනවා වළඳා නම් ඒ මෙහෙණ විසින් ‘ආර්‍ය්‍යාවෙනි ගැරහියයුතු වූ නුසුදුසු වූ පිළිදෙස්නට නිසි ඇවැතකට පැමිණියෙමි, එය පිළිදෙසමියි පටිදේසනා කළයුතු යි.**",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. යා පන යනු: යම් යම්බඳු ... භික්ඛුනී යනු ... මෝතොමෝ මේ අර්‍ත්‍ථයෙහිලා අදහස් කරන ලද මෙහෙණයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අගිලානා නම්: යමකට දිහියෙන් වෙන්වැ පහසු වේ නම් හෝ යැ. ගිලානා නම් යමකට දිහියෙන් වෙන්වැ පහසු නො වේ නම් හෝ යැ. තෙල නම් තලතෙල්, අබතෙල්, මීතෙල්, එරඬුතෙල්, වුරුණුතෙල් යැ. මධු නම් මැසිමීයැ, ඵාණිත නම් උක්පැණි යැ. මච්ඡ නම් දියමසයැයි කියනු ලැබේ. මංස නම් යම්කෙනකුන්ගේ මස් කැප නම් ඔවුන්ගේ මස්යැ. ඛීර නම් ගවකිරි හෝ එළුකිරි හෝ මිහිකිරි හෝ යම්කෙනකුන්ගේ මස් කැපනම් ඔවුන්ගේ කිරි යැ. දධි නම් ඔවුන්ගේමැ දිහියැ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "නොගිලන්වූවා තමා උදෙසා විනවා නම් පියෝහි දුකුළා යැ. පිළිලැබීමෙන් වළඳන්නෙමි යි පිළිගනී නම් දුකුළා ඇවැත් වේ. පරඟලායෙහි පරඟලායෙහි පිළිදෙස්නී ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "නොගිලන්වූවා නොගිලන්සන් ඇතිවැ දිහි විනවා වළඳා නම් පිළිදෙස්නී ඇවැත් වෙයි. නොගිලන්වූවා විමති ඇතිවැ දිහි විනවා වළඳා නම් පිළිදෙස්නී ඇවැත් වෙයි. නොගිලන්වූවා ගිලන්සන් ඇතිවැ දිහි විනවා වළඳා නම් පිළිදෙස්නී ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ගිලන්වූවා නොගිලන්සන් ඇතියා නම් දුකුළා ඇවැත් වෙයි. ගිලන්වූවා විමති ඇතියා නම් දුකුළා ඇවැත් වෙයි. ගිලන්වූවා ගිලන්සන් ඇතියා නම් ඇවැත් නැති.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 378,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**අනාපත්ති**: ගිලානාය ගිලානා හුත්වා විඤ්ඤාපෙත්වා අගිලානා භුඤ්ජති, ගිලානාය සෙසකං භුඤ්ජති, ඤාතකානං පවාරිතානං, අඤ්ඤස්සත්ථාය අත්තනො ධනෙන උම්මත්තිකාය ආදිකම්මිකායාති."
                    },
                    {
                        "type": "centered",
                        "text": "අට්ඨමපාටිදෙසනීයසික්ඛාපදං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "7. උද්දිට්ඨා ඛො අය්යායො අට්ඨපාටිදෙසනීයා ධම්මා. තත්ථාය්යායො පුච්ඡාමි කච්චිත්ථ පරිසුද්ධා. දුතියම්පි පුච්ඡාමි කච්චිත්ථ පරිසුද්ධා. තතියම්පි පුච්ඡාමි කච්චිත්ථ පරිසුද්ධා. පරිසුද්ධෙත්ථය්යායො, තස්මා තුණ්හී. එවමෙතං ධාරයාමීති."
                    },
                    {
                        "type": "centered",
                        "text": "පාටිදෙසනීයානිට්ඨිතා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "6. සෙඛියා",
                        "level": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො පනාය්යායො සෙඛියාධම්මා උද්දෙසං ආගච්ඡන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "1. තෙන සමයෙන බුද්ධො භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තෙන ඛො පන සමයෙන ඡබ්බග්ගියා භික්ඛුනියො පුරතොපි පච්ඡතොපි ඔලම්බෙන්ති{1} නිවාසෙන්ති. මනුස්සා උජ්ඣායන්ති ඛීයන්ති විපාචෙන්ති: – “කථං හි නාම භික්ඛුනියො පුරතොපි පච්ඡතොපි ඔලම්බෙන්තී නිවාසෙස්සන්ති, සෙය්යථාපි ගිහිනියො කාමභොගිනියො”ති. අස්සොසුං ඛො භික්ඛුනියො තෙසං මනුස්සානං උජ්ඣායන්තානං ඛිය්යන්තානං විපාචෙන්තානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. යා තා භික්ඛුනියො අප්පිච්ඡා -පෙ- තා උජ්ඣායන්ති ඛීයන්ති විපාචෙන්ති: “කථං හි නාම ඡබ්බග්ගියා භික්ඛුනියො පුරතොපි පච්ඡතොපි ඔලම්බෙන්ති නිවාසෙස්සන්තීති -පෙ- සච්චං කිර භික්ඛවෙ ඡබ්බග්ගියා භික්ඛුනියො පුරතොපි පච්ඡතොපි ඔලම්බෙන්තී නිවාසෙන්තීති. සච්චං භගවා. විගරහි බුද්ධො භගවා -පෙ- කථං හි නාම භික්ඛවෙ ඡබ්බග්ගියා භික්ඛුනියො පුරතොපි පච්ඡතොපි ඔලම්බෙන්ති නිවාසෙස්සන්ති. නෙතං භික්ඛවෙ අප්පසන්නානං වා පසාදාය -පෙ- එවඤ්ච පන භික්ඛවෙ භික්ඛුනියො ඉමං සික්ඛාපදං උද්දිසන්තු."
                    },
                    {
                        "type": "centered",
                        "text": "පරිමණ්ඩලං නිවාසෙස්සාමීති සික්ඛා කරණීයාති.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3. පරිමණ්ඩලං නිවාසෙතබ්බං නාභිමණ්ඩලං ජාණුමණ්ඩලං පටිච්ඡාදෙන්තියා. යා අනාදරියං පටිච්ච පුරතො වා පච්ඡතො වා ඔලම්බෙන්තී නිවාසෙති ආපත්ති දුක්කටස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අනාපත්ති**: අසඤ්චිච්ච, අසතියා, අජානන්තියා, ගිලානාය ආපදාසු -පෙ- උම්මත්තිකාය ආදිකම්මිකායාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඔලම්බෙන්තා, සිමු i සිමු ii"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "අනාපත්ති ගිලනහට, ගිලනක් වැ විනවා නොගිලනක් වැ වළඳා නම්, ගිලනකගේ ශේෂය වළඳා නම්, නෑයන්ගේ නම්, පැවරියන්ගේ නම්, අනෙකක්හු උදෙසා නම්, තමාගේ ධනයෙන් නම්, උමතුවූවකට, ආදිකම්මිකාවට ඇවැත් නැති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අටවැනි පිළිදෙස්නී සිකපදයි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "7. ආර්‍ය්‍යාවෙනි අෂ්ට පාටිදේසනීය ධර්‍මයෝ උදෙසන ලදහ. එහිලා ආර්‍ය්‍යාවන් පුළුවුස්මි, කිම පිරිසුදු වවුද? දෙවනවට ද පුළුවුස්මි, කිම පිරිසුදු වවුද? තෙවනවට ද පුළුවුස්මි, කිම පිරිසුදුවවු ද? මෙහිලා ආර්‍ය්‍යාවෝ පරිශුද්ධයහ. එහෙයින් තූෂ්ණීම්භූතයහ. තෙල කරුණ මෙසේ දරමියි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පාටිදේසනීය ශික්‍ෂා නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "6. සේඛියකාණ්ඩය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "text": "ආර්‍ය්‍යාවෙනි මේ සේඛියධර්‍මයෝ උදෙසීමට පැමිණෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "1. එසමයෙහි භාග්‍යවත් බුදුහු සැවැතැ ජේතවන නම් අනේපිඬු සිටුහුගේ අරම්හි වැඩැ වෙසෙති. එසමයෙහි සවග මෙහෙණෝ ඉදිරිපසිනුදු පසුපසිනුදු එල්වමින් හඳිත්. මිනිස්සු ලමුකොට සිතති නුගුණ පවසති දොස් පතුරුවත්. කෙසේ නම් මෙහෙණෝ කාමභෝගී ගිහියන් මෙන් ඉදිරිපසිනුදු පසුපසිනුදු එල්වමින් හැන්දාහුදැයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. භික්‍ෂුණීහු ලමුකොට සිතන නුගුණපවසන දොස්පතුරුවන ඒ මිනිසුන්ගේ (අකීර්ති ශබ්දය) ඇසූහු. යම් ඒ මෙහෙණ කෙනෙක් අපිස්වූවෝ ... ඔහු ලමුකොට සිතති, නුගුණ පවසති, දොස් පතුරුවත්: “කෙසේ නම් සවග මෙහෙණෝ ඉදිරිපසිනුදු පසුපසිනුදු එල්වමින් හැන්දාහුදැයි ... සැබෑද මහණෙනි, සවග මෙහෙණෝ ඉදිරිපසුනුදු පසුපසිනුදු එල්වමින් හඳිත්දැයි. සැබැවැ භාග්‍යවතුන් වහන්ස. භාග්‍යවත් බුදුහු ගැරහූ ... කෙසේ නම් මහණෙනි සවග මෙහෙණෝ ඉදිරිපසිනුදු පසුපසිනුදු එල්වමින් හැන්දාහුද? මහණෙනි මෙය අප්‍රසන්නයන්ගේ ප්‍රසාදය පිණිස හෝ නොවෙයි ... මහණෙනි මෙසේ මේ සිකපදය ද මෙහෙණෝ උදෙසත්වා.",
                        "type": "paragraph"
                    },
                    {
                        "text": "**පිරිමඬුලු කොට හඳින්නෙමියි හික්මිය යුතු යි.**",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "3. නැබමඬල දණමඬල වසන්නිය විසින් පිරිමඬුලු කොට හැන්ද යුතුයි. යම් මෙහෙණක් අනාදරිය පිණිස ඉදිරිපසින් හෝ පසුපසින් හෝ එල්වමින් හඳී නම් දුකුළා ඇවැත් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අනාපත්ති : නො සිතා කරන්නියට, නො සිහියෙන් කරන්නියට, නො දන්නියට, ගිලනහට, ආපදායෙහි ... උමතුඇතියාහට, ආදිකම්මිකාවට ඇවැත් නැති.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 380,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "1. තෙන සමයෙන බුද්ධො භගවා **සාවත්ථියං** විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තෙන ඛො පන සමයෙන ඡබ්බග්ගියා භික්ඛුනියො උදකෙ උච්චාරම්පි පස්සාවම්පි ඛෙළම්පි කරොන්ති. මනුස්සා උජ්ඣායන්ති ඛීයන්ති විපාචෙන්ති, “කථං හි නාම භික්ඛුනියො උදකෙ උච්චාරම්පි පස්සාවම්පි ඛෙළම්පි කරිස්සන්ති සෙය්යථාපි ගිහීකාමභොගිනියො”ති.{1}"
                    },
                    {
                        "type": "paragraph",
                        "text": "අස්සොසුං ඛො භික්ඛුනියො තෙසං මනුස්සානං උජ්ඣායන්තානං ඛීයන්තානං විපාචෙන්තානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. යා තා භික්ඛුනියො අප්පිච්ඡා -පෙ- තා උජ්ඣායන්ති ඛීයන්ති විපාචෙන්ති, “කථං හි නාම ඡබ්බග්ගියා භික්ඛුනියො උදකෙ උච්චාරම්පි පස්සාවම්පි ඛෙළම්පි කරිස්සන්තී”ති. අථ ඛො භික්ඛුනියො භික්ඛූනං එතමත්ථං ආරොචෙසුං. භික්්ඛු භගවතො එතමත්ථං ආරොචෙසුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. අථ ඛො භගවා එතස්මිං නිදානෙ එතස්මිං පකරණෙ ධම්මිං කථං කත්වා භික්ඛුසංඝං සන්නිපාතාපෙත්වා භික්ඛු පටිපුච්ඡි, සච්චං කිර භික්ඛවෙ ඡබ්බග්ගියා භික්ඛුනියො උදකෙ උච්චාරම්පි පස්සාවම්පි ඛෙළම්පි කරොන්තීති. සච්චං භගවා. විගරහි බුද්ධො භගවා -පෙ- කථං හි නාම භික්ඛවෙ ඡබ්බග්ගියා භික්ඛුනියො උදකෙ උච්චාරම්පි පස්සාවම්පි ඛෙළම්පි කරිස්සන්ති. නෙතං භික්ඛවෙ අප්පසන්නානං වා පසාදාය -පෙ- එවඤ්ච පන භික්ඛවෙ භික්ඛුනියො ඉමං සික්ඛාපදං උද්දිසන්තු."
                    },
                    {
                        "type": "paragraph",
                        "text": "**න උදකෙ උච්චාරං වා පස්සාවං වා ඛෙළං වා කරිස්සාමීති සික්ඛා කරණීයාති**."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවඤ්චිදං භගවතා භික්ඛුනීනං සික්ඛාපදං පඤ්ඤත්තං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "4. තෙන ඛො පන සමයෙන ගිලානා භික්ඛුනියො උදකෙ උච්චාරම්පි පස්සාවම්පි ඛෙළම්පි කාතුං කුක්කුච්චායන්ති. භගවතො එතමත්ථං ආරොචෙසුං -පෙ- “අනුජානාමි භික්ඛවෙ ගිලානාය භික්ඛුනියා උදකෙ උච්චාරම්පි පස්සාවම්පි ඛෙළම්පි කාතුං”. එවඤ්ච පන භික්ඛවෙ භික්ඛුනියො ඉමං සික්ඛාපදං උද්දිසන්තු."
                    },
                    {
                        "type": "paragraph",
                        "text": "**න උදකෙ අගිලානා උච්චාරං වා පස්සාවං වා ඛෙළං වා කරිස්සාමීති සික්ඛා කරණීයාති.**"
                    },
                    {
                        "type": "paragraph",
                        "text": "5. න උදකෙ අගිලානාය උච්චාරො වා පස්සාවො වා ඛෙළො වා කාතබ්බො. යා අනාදරියං පටිච්ච උදකෙ අගිලානා උච්චාරං වා පස්සාවං වා ඛෙළං වා කරොති ආපත්ති දුක්කටස්ස."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ගිහීනියො කාමභොගිනියො-මඡසංගිහීකාමභොගිනියො-සිමු"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "1. එසමයෙහි භාග්‍යවත් බුදුහු සැවැතැ ජේතවන නම් අනේපිඬු සිටුහුගේ අරම්හි වැඩැ වෙසෙති. එසමයෙහි සවග මෙහෙණෝ කාමභෝගී ගිහියන් මෙන් දියෙහි මහදියටනු ද සුළුදියටනු ද කෙළගැසීම ද කෙරෙත්. මිනිස්සු ලමුකොට සිතති, නුගුණ පවසති, දොස් පතුරුවත්: “කෙසේ නම් මෙහෙණෝ දියෙහි මහදියටනු ද සුළුදියටනු ද කෙළගැසීම ද කොළෝදැ”යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "භික්‍ෂුණීහු ලමු කොට සිතන නුගුණ පවසන දොස් පතුරුවන ඒ මිනිසුන්ගේ (අකීර්ති ශබ්දය) ඇසූහු.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. යම් ඒ මෙහෙණ කෙනෙක් අපිස්වූවෝ ... ඔහු ලමුකොට සිතති, නුගුණ පවසති, දොස් පතුරුවත්: “කෙසේ නම් සවග මෙහෙණෝ දියෙහි මහදියටනු ද සුළුදියටනු ද කෙළගැසීම ද කොළෝ දැයි. එකල්හි මෙහෙණෝ මහණුන්හට තෙල කරුණ ඇරොජූහු. මහණහු තෙල කරුණ භාග්‍යවතුන්හට සැලකළහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. එකල්හි භාග්‍යවතුන් වහන්සේ මේ කරුණෙහිලා මේ අවසරයෙහිලා බික්සඟන රැස්කරවා දැහැමි කථා කොට මහණුන් පුළුවුත් සේක. සැබෑද මහණෙනි, සවග මෙහෙණෝ දියෙහි මහදියටනු ද සුළුදියටනු ද කෙළගැසීම ද කෙරෙත්දැ යි. සැබැවැ භාග්‍යවතුන් වහන්ස. භාග්‍යවත් බුදුහු ගැරහූ ... “කෙසේ නම් මහණෙනි සවග මෙහෙණෝ දියෙහි මහදියටනු ද සුළුදියටනු ද කෙළගැසීම ද කොළෝ දැයි. මහණෙනි මෙය අප්‍රසන්නයන්ගේ ප්‍රසාදය පිණිස හෝ නොවෙයි. … මෙසේ ද මහණෙනි මෙහෙණෝ මේ සිකපදය උදෙසත්වා.",
                        "type": "paragraph"
                    },
                    {
                        "text": "**දියෙහි මහදියටනු හෝ සුළුදියටනු හෝ කෙළගැසීම හෝ නොකරන්නෙමි යි හික්මිය යුතු යි.**",
                        "type": "paragraph"
                    },
                    {
                        "text": "මෙසේත් වනාහි භාග්‍යවතුන් විසින් මේ සිකපදය මෙහෙණන්හට පනවන ලද්දේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. එසමයෙහි ගිලන් වූ මෙහෙණෝ දියෙහි මහදියටනුද සුළුදියටනුද කෙළගැසීම ද කරන්නට කුකුසත්. තෙල කරුණ භාග්‍යවතුන්හට සැලකළහ ... මහණෙනි ගිලන් මෙහෙණහට දියෙහි මහදියටනු ද සුළුදියටනු ද කෙළගැසීම ද කරන්නට අනුදනිමි. මෙසේද මහණෙනි මෙහෙණෝ මේ සිකපදය උදෙසත්වා.",
                        "type": "paragraph"
                    },
                    {
                        "text": "**නො ගිලන්වැ දියෙහි මහදියටනු හෝ සුළුදියටනු හෝ කෙළගැසීම හෝ නොකරන්නෙමි යි හික්මිය යුතු යි.**",
                        "type": "paragraph"
                    },
                    {
                        "text": "5. නො ගිලන විසින් දියෙහි මහදියටනු හෝ සුළුදියටනු හෝ කෙළගැසීම හෝ නොකළ යුතු යි. යම් මෙහෙණක් අනාදරිය පිණිස නොගිලන්වැ දියෙහි මහදියටනු හෝ සුළුදියටනු හෝ කෙළගැසීම හෝ කරා නම් දුකුළා ඇවැත් වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 382,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**අනාපත්ති**: අසඤ්චිච්ච අසතියා අජානන්තියා ගිලානාය ථලෙකතො උදකං ඔත්ථරති, ආපදාසු උම්මත්තිකාය ඛිත්තචිත්තාය වෙදනට්ටාය ආදිකම්මිකායාති."
                    },
                    {
                        "type": "centered",
                        "text": "පණ්ණරසමසික්ඛාපදං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "උද්දිට්ඨා ඛො අය්යායො සෙඛියා ධම්මා. තත්ථාය්යායො පුච්ඡාමි කච්චිත්ථ පරිසුද්ධා. දුතියම්පි පුච්ඡාමි කච්චිත්ථ පරිසුද්ධා. තතියම්පි පුච්ඡාමි කච්චිත්ථ පරිසුද්ධා. පරිසුද්ධෙත්ථය්යායො තස්මාතුණ්හී. එවමෙතං ධාරයාමීති."
                    },
                    {
                        "type": "centered",
                        "text": "සෙඛියා නිට්ඨිතා.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "7. අධිකරණසමථා",
                        "level": 3
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉමෙ ඛො පනය්යායො සත්ත අධිකරණසමථා ධම්මා උද්දෙසං ආගච්ඡන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "1. උප්පන්නුප්පන්නානං අධිකරණානං සමථාය වූපසමාය සම්මුඛාවිනයො දාතබ්බො, සතිවිනයො දාතබ්බො, අමූළ්හවිනයො දාතබ්බො, පටිඤ්ඤාය කාරෙතබ්බං, යෙභුය්යසිකා, තස්සපාපිය්යසිකා, තිණවත්ථාරකොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. උද්දිට්ඨා ඛො අය්යායො සත්ත අධිකරණසමථා ධම්මා. තත්ථ අය්යායො පුච්ඡාමි කච්චිත්ථ පරිසුද්ධා. දුතියම්පි පුච්ඡාමි කච්චිත්ථ පරිසුද්ධා. තතියම්පි පුච්ඡාමි කච්චිත්ථ පරිසුද්ධා. පරිසුද්ධෙත්ථය්යායො තස්මා තුණ්හී. එවමෙතං ධාරයාමීති."
                    },
                    {
                        "type": "centered",
                        "text": "අධිකරණසමථා නිට්ඨිතා.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "3. උද්දිට්ඨං ඛො අය්යායො නිදානං. උද්දිට්ඨා අට්ඨපාරාජිකා ධම්මා, උද්දිට්ඨා සත්තරස සඞ්ඝාදිසෙසා ධම්මා, උද්දිට්ඨා තිංසනිස්සග්ගියා පාචිත්තියා ධම්මා, උද්දිට්ඨා ඡසට්ඨිසතා පාචිත්තියා ධම්මා, උද්දිට්ඨා අට්ඨපාටිදෙසනීයා ධම්මා, උද්දිට්ඨා සෙඛියා ධම්මා, උද්දිට්ඨා සත්ත අධිකරණසමථා ධම්මා, එත්තකං තස්ස භගවතො සුත්තාගතං සුත්තපරියාපන්නං අන්වද්ධමාසං උද්දෙසං ආගච්ඡති. තත්ථ සබ්බාහෙව සමග්ගාහි සම්මොදමානාහි අවිවදමානාහි සික්ඛිතබ්බන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "භික්ඛුනීවිභඞ්ගො නිට්ඨිතො.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "පාචිත්තියපාළි නිට්ඨිතා.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "අනාපත්ති: නොසිතා කරන්නියට, නො සිහියෙන් කරන්නියට, නො දන්නියට, ගිලනහට, ගොඩබිම කරන ලද්ද දියටබැසයේ නම්, ආපදායෙහි, උමතුඇතියාට, විසුරුණු සිත් ඇතියාට, වේදනායෙන් පෙළුණියට, ආදිකම්මිකාවට ඇවැත් නැති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පසළොස්වනු සිකපද යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "ආර්‍ය්‍යාවෙනි සේඛියධර්‍මයෝ උදෙසන ලදහ. එහිලා ආර්‍ය්‍යාවන් පුළුවුස්මි. කිම පිරිසුදු වවුද? දෙවනවට ද පුළුවුස්මි, කිම පිරිසුදු වවුද? තෙවනවට ද පුළුවුස්මි, කිම පිරිසුදුවවු ද? මෙහිලා ආර්‍ය්‍යාවෝ පරිශුද්ධයහ. එහෙයින් තූෂ්ණීම්භූතයහ. තෙල කරුණ මෙසේ දරමි යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සේඛිය ශික්‍ෂා නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "7. අධිකරණසමථ",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "text": "ආර්‍ය්‍යාවෙනි මේ සප්ත අධිකරණසමථධර්‍මයෝ උදෙසීමට පැමිණෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "1. උපනුපන් (විවාදාදී) අධිකරණයන්ගේ ශමනය පිණිස ව්‍යුපශමය පිණිස සම්මුඛාවිනය දියයුත්තේ යැ. සතිවිනය දියයුත්තේ යැ, අමූළ්හවිනය දියයුත්තේ යැ. ප්‍රතිඥායෙන් කරවිය යුතුයැ, යෙභුය්‍යසිකායැ, තස්සපාපිය්‍යසිකා යැ, තිණවත්‍ථාරක යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. ආර්‍ය්‍යාවරුනි සප්ත අධිකරණසමථ ධර්‍මයෝ උදෙසන ලදහ. එහිලා ආර්‍ය්‍යාවන් පුළුවුස්මි. කිම පිරිසුදු වවුද? දෙවනවට ද පුළුවුස්මි, කිම පිරිසුදු වවුද? තෙවනවට ද පුළුවුස්මි, කිම පිරිසුදුවවු ද? මෙහිලා ආර්‍ය්‍යාවෝ පරිශුද්ධයහ. එහෙයින් තූෂ්ණීම්භූතයහ. තෙල කරුණ මෙසේ දරමි යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අධිකරණසමථයෝ නිමියාහුයි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "3. ආර්‍ය්‍යාවෙනි නිදානය උදෙසන ලදී. අෂ්ට පාරාජික ධර්‍මයෝ උදෙසන ලදහ, සතළොස් සඟවෙසෙස් දහම්හු උදෙසන ලදහ. තිස් නිසැඟි පචිති දහම්හු උදෙසන ලදහ. එකසියසසැටක් පචිති දහම්හු උදෙසන ලදහ. අට පිළිදෙස්නී දහම්හු උදෙසන ලදහ. සේඛිය දහම්හු උදෙසන ලදහ. සත් අධිකරණ සමථ දහම්හු උදෙසන ලදහ. ඒ භාග්‍යවතුන් වහන්සේගේ සූත්‍ර සංඛ්‍යාත භික්‍ෂුණී විභඞ්ගයෙහි ආවාවූ භික්‍ෂුණීවිභඞ්ගට ඇතුළත් වූ මෙතෙක් ශික්‍ෂාවෝ අඩමසක් පාසා උදෙසීමට පැමිණෙත්. සමඟ වූ සතුටුවන විවාද නො කරන හැමදෙනා විසින් මැ මෙහිලා හික්මිය යුතු යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "භික්‍ෂුණී විභඞ්ගය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "පාචිත්තියපාළි නිමියා යැ.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ],
    "bookId": 3,
    "pageOffset": 0
}