{
    "filename": "vp-prj-3",
    "pages": [
        {
            "pageNum": 256,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "සඞ්ඝාදිසෙසකණ්ඩො",
                        "level": 3
                    },
                    {
                        "type": "centered",
                        "text": "3.",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "තෙරසකං.",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "ඉමෙ ඛො පනායස්මන්තො තෙරස සඞ්ඝාදිසෙසා ධම්මා උද්දෙසං ආගච්ඡන්ති.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "3. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පඨමසඞ්ඝාදිසෙසො",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "1. තෙන සමයෙන බුද්ධො භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තෙන ඛො පන සමයෙන ආයස්මා **සෙය්යසකො** අනභිරතො බ්රහ්මචරියං චරති. සො තෙන කිසො හොති ලූඛො දුබ්බණ්ණො උප්පණ්ඩුප්පණ්ඩුකජාතො ධමනිසන්ථතගත්තො."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. අද්දසා ඛො ආයස්මා **උදායී** ආයස්මන්තං සෙය්යසකං කිසං ලූඛං දුබ්බණ්ණං උප්පණ්ඩුප්පණ්ඩුකජාතං ධමනිසන්ථතගත්තං. දිස්වාන ආයස්මන්තං සෙය්යසකං එතදවොච: “කිස්ස ත්වං ආවුසො සෙය්යසක, කිසො ලූඛො දුබ්බණ්ණො උප්පණ්ඩුප්පණ්ඩුකජාතො ධමනිසන්ථතගත්තො. කච්චි නො ත්වං ආවුසො සෙය්යසක, අනභිරතො බ්රහ්මචරියං චරසී”ති. ‘එවමාවුසො’ති. ‘තෙන හි ත්වං ආවුසො සෙය්යසක, යාවදත්ථං භුඤ්ජ, යාවදත්ථං සුප, යාවදත්ථං නහාය{1}. යාවදත්ථං භුඤ්ජිත්වා යාවදත්ථං සුපිත්වා යාවදත්ථං නහායිත්වා{1} යදා තෙ අනභිරති උප්පජ්ජති, රාගො චිත්තං අනුද්ධංසෙති, තදා හත්ථෙන උපක්කමිත්වා අසුචිං මොචෙහී’ති. “කින්නු ඛො ආවුසො කප්පති එවරූපං කාතු”න්ති. ‘ආම ආවුසො. අහම්පි එවං කරොමී’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. අථ ඛො ආයස්මා සෙය්යසකො යාවදත්ථං භුඤ්ජි, යාවදත්ථං සුපි, යාවදත්ථං නහායි{1}. යාවදත්ථං භුඤ්ජිත්වා යාවදත්ථං සුපිත්වා යාවදත්ථං නහායිත්වා{1}, යදා අනභිරති උප්පජ්ජති, රාගො චිත්තං අනුද්ධංසෙති, තදා හත්ථෙන උපක්කමිත්වා අසුචිං මොචෙති{2} . අථ ඛො ආයස්මා සෙය්යසකො අපරෙන සමයෙන වණ්ණවා අහොසි පීණින්ද්රියො පසන්නමුඛවණ්ණො විප්පසන්නඡවිවණ්ණො."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. න්හාය, න්හායිත්වා, මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "2. මොචෙසි, මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "සඞ්ඝාදිසේසකාණ්ඩය",
                        "type": "heading",
                        "level": 3
                    },
                    {
                        "text": "3.",
                        "type": "centered",
                        "level": 2
                    },
                    {
                        "text": "තෙරසකය",
                        "type": "centered",
                        "level": 2
                    },
                    {
                        "text": "ආයුෂ්මත්නි, මේ තෙළෙස් සඟවෙසෙස්ඇවැත්හු උදෙසීමට පැමිණෙත්.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "3. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සුක්කවිසට්ඨිශික්‍ෂාපදය",
                        "level": 2
                    },
                    {
                        "text": "1. එසමයෙහි භාග්‍යවත් බුදුරජානන් වහන්සේ සැවැත් නුවර ජේතවනයෙහි අනේපිඬුසිටුහුගේ අරම්හි වැඩ වෙසෙති. එසමයෙහි ආයුෂ්මත් සෙය්‍යසක තෙමේ කළකිරුනේ බඹසර හැසිරෙයි. හෙතෙමේ එයින් කෘශ වූයේ රූක්ෂ වූයේ දුර්වර්ණ වූයේ අතිශයින් පඬුවන් වුයේ ඉල්පුනු නහරින් යුත් සිරුරු ඇත්තේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. ආයුෂ්මත් වූ උදායි තෙමේ කෘශ වූ රූක්ෂ වූ දුර්වර්ණ වූ ඉතා පඬුවන් වූ ඉල්පී ගිය නහරින් යුත් සිරුරු ඇති ආයුෂ්මත් සෙය්‍යසක මහණහට මෙය කීය: “ඇවැත් සෙය්‍යසකයිනි, තෙපි කුමක් හෙයින් කෘශ වූ රූක්ෂ වූ දුර්වර්ණ වූ ඉතා පඬුවන් වූ නහර ඉල්පී ගිය සිරුරු ඇති වූවහු ද? ඇවැත් සෙය්‍යසකයිනි, කිම තෙපි කළකිරුනහු බඹසර හැසිරෙවු ද යනුයි. “ඇවැත්නි එසේ” යයි ඒ මහණ කීය. ඇවැත් සෙය්‍යසකයිනි, එසේ වී නම් තෙපි කැමැති තාක් අනුභව කරවු. කැමති තාක් සැතපෙවු. කැමැති තාක් ස්නානය කරවු. කැමැති තාක් අනුභව කොට කැමති තාක් සැතපී කැමති තාක් නා යම් කලෙක තොපට අනභිරතියක් උපදී නම් රාගය සිත මැඩ ගණී නම් එකල්හි අතින් ගටා සුකුරු මුදවු යයි උදායි තෙර කීය. ඇවැත්නි, එබන්දක් කරන්නට කැපදැ?යි ඒ මහණ ඇසී ය. ඇවැත්නි, එසේ ය. මම ද එසේ කරමි යි උදායි තෙර කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. ඉක්බිති ආයුෂ්මත් සෙය්‍යසක තෙමේ කැමැති තාක් වැළැඳී ය. කැමැති තාක් සැතපුනේ ය. කැමැති තාක් නෑවේ ය. කැමති තාක් වළඳා කැමැති තාක් සැතපී කැමැති තාක් නා යම් කලෙක අනභිරතිය උපදී ද, රාගය සිත මැඩ ගණී ද, එකල්හි අතින් ගටා සුකුරු මුදයි. ඉක්බිති ආයුෂ්මත් සෙය්‍යසක තෙමේ පසු කාලයෙහි පැහැය ඇත්තෙක් ද පිණා ගිය ඉඳුරන් ඇත්තෙක් ද පහන් මුව පැහැය ඇත්තෙක් ද අතිශයින් සිවිපැහැ ඇත්තෙක් ද විය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 258,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "4. අථ ඛො ආයස්මතො සෙය්යසකස්ස සහායකා භික්ඛූ ආයස්මන්තං සෙය්යසකං එතදවොචුං: “පුබ්බෙ ඛො ත්වං ආවුසො සෙය්යසක කිසො අහොසි ලූඛො දුබ්බණ්ණො උප්පණ්ඩුප්පණ්ඩුකජාතො ධමනිසන්ථතගත්තො. සො දානි ත්වං එතරහි වණ්ණවා පීණින්ද්රියො පසන්නමුඛවණ්ණො විප්පසන්නඡවිවණ්ණො. කින්නු ඛො ත්වං ආවුසො සෙය්යසක භෙසජ්ජං කරොසී”ති. ‘න ඛො අහං ආවුසො භෙසජ්ජං කරොමි. අපිචාහං යාවදත්ථං භුඤ්ජාමි, යාවදත්ථං සුපාමි, යාවදත්ථං නහායාමි, යාවදත්ථං භුඤ්ජිත්වා යාවදත්ථං සුපිත්වා යාවදත්ථං නහායිත්වා යදා මෙ අනභිරති උප්පජ්ජති, රාගො චිත්තං අනුද්ධංසෙති, තදා හත්ථෙන උපක්කමිත්වා{1} අසුචිං මොචෙමී”ති. ‘කිං පන ත්වං ආවුසො සෙය්යසක යෙනෙ’ව හත්ථෙන සද්ධාදෙය්යං භුඤ්ජසි, තෙනෙ’ව හත්ථෙන උපක්කමිත්වා අසුචිං මොචෙසීති. ‘එවමාවුසො’ති. යෙ තෙ භික්ඛූ අප්පිච්ඡා තෙ උජ්ඣායන්ති ඛීයන්ති විපාචෙන්ති: ‘කථං හි නාම ආයස්මා සෙය්යසකො හත්ථෙන උපක්කමිත්වා අසුචිං මොචෙස්සතී’ති. අථ ඛො තෙ භික්ඛූ ආයස්මන්තං සෙය්යසකං අනෙකපරියායෙන විගරහිත්වා භගවතො එතමත්ථං ආරොචෙසුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "5. අථ ඛො භගවා එතස්මිං නිදානෙ එතස්මිං පකරණෙ භික්ඛුසඞ්ඝං සන්නිපාතාපෙත්වා ආයස්මන්තං සෙය්යසකං පටිපුච්ඡි: “සච්චං කිර ත්වං සෙය්යසක හත්ථෙන උපක්කමිත්වා අසුචිං මොචෙසී”ති? ‘සච්චං භගවා’{2}. විගරහි බුද්ධො භගවා “අනනුච්ඡවියං{3} මොඝපුරිස අනනුලොමිකං අප්පතිරූපං අස්සාමණකං අකප්පියං අකරණීයං, කථං හි{4} නාම ත්වං මොඝපුරිස හත්ථෙන උපක්කමිත්වා අසුචිං මොචෙස්සසි. නනු මයා මොඝපුරිස අනෙකපරියායෙන විරාගාය ධම්මො දෙසිතො නො සරාගාය, විසඤ්ඤොගාය ධම්මො දෙසිතො නො සඤ්ඤොගාය, අනුපාදානාය ධම්මො දෙසිතො නො සඋපාදානාය. තත්ථ නාම ත්වං මොඝපුරිස මයා විරාගාය ධම්මෙ දෙසිතෙ සරාගාය චෙතෙස්සසි. විසඤ්ඤොගාය ධම්මෙ දෙසිතෙ සඤ්ඤොගාය චෙතෙස්සසි. අනුපාදානාය ධම්මෙ දෙසිතෙ සඋපාදානාය චෙතෙස්සසි. නනු මයා මොඝපුරිස අනෙකපරියායෙන රාගවිරාගාය ධම්මො දෙසිතො, මදනිම්මදනාය, පිපාසවිනයාය, ආලයසමුග්ඝාතාය, වට්ටුපච්ඡෙදාය, තණ්හක්ඛයාය, විරාගාය, නිරොධාය, නිබ්බාණාය ධම්මො දෙසිතො. නනු මයා මොඝපුරිස අනෙකපරියායෙන කාමානං පහානං අක්ඛාතං කාමසඤ්ඤානං පරිඤ්ඤා අක්ඛාතා, කාමපිපාසානං පටිවිනයො අක්ඛාතො, කාමවිතක්කානං සමුග්ඝාතො අක්ඛාතො, කාමපරිලාහානං වූපසමො අක්ඛාතො. නෙතං මොඝපුරිස අප්පසන්නානං වා පසාදාය පසන්නානං වා භිය්යොභාවාය. අථ ඛ්වෙතං මොඝපුරිස අප්පසන්නානඤ්චෙව අප්පසාදාය පසන්නානඤ්ච එකච්චානං අඤ්ඤථත්තායා”ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උප්පක්කමිත්වා, බුජමු"
                    },
                    {
                        "type": "footnote",
                        "text": "2. භගවාති, මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "3. අනනුච්ඡවිකං, මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "4. කථඤ්හි, මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "4. ඉක්බිති ආයුෂ්මත් සෙය්‍යසක මහණහුගේ යහළු භික්ෂුහු ආයුෂ්මත් සෙය්‍යසකහට මෙය කීවාහුය: “ඇවැත් සෙය්‍යසකයෙනි, තෙපි පෙර කෘශ වූවහු රූක්ෂ වූවහු දුර්‍වර්‍ණ වූවහු ඉතා පඬුවන් වූවහු ඉල්පී ගිය නහරින් යුත් සිරුරු ඇත්තහු වූවහු ය. ඒ තෙපි දැන් වර්‍ණවත් ය. පිණා ගිය ඉඳුරන් ඇත්තහු ය. පහන් මුව පැහැය ඇත්තහු ය. වෙසෙසින් පහන් සිවි පැහැ ඇත්තහු ය, ඇවැත් සෙය්‍යසකයෙනි, කිම තෙපි බෙහෙතක් කරවුද”යි ඇසූහ. “ඇවැත්නි, මම බෙහෙතක් නො කෙරෙමි. එහෙත් මම කැමති තාක් වළඳමි, කැමැති තාක් සැතපෙමි, කැමැති තාක් නාමි, කැමැති තාක් වළඳා කැමති තාක් සැතපී කැමැති තාක් නහා යම් කලෙක මට අනභිරතියෙක් ඇති වේ නම්, රාගය සිත මැඩ ගණී නම්, එකල්හි අතින් ගටා සුකුරු මුදමි”යි සෙය්‍යසක මහණ කීය. “කිම? ඇවැත් සෙය්‍යසකයිනි, තෙපි යම් අතෙකින් ම සැදැහැයෙන් දෙන දෑ වළඳවු නම් ඒ අතින් ම ගටා සුකුරු මුදවු දැ,” යි ඒ භික්ෂුහු කීහ. “ඇවැත්නි, එසේ ය”යි සෙය්‍යසක මහණ කී ය. යම් ඒ භික්ෂූහු අල්පෙච්ඡයෝ ද ඔහු “කෙසේ නම්, ආයුෂ්මත් සෙය්‍යසකයෝ අතින් ගටා සුකුරු මුදන්නෝ දැ”යි අවමන් කෙරෙත්. අයුණු කියත්. නුගුණ පතුරවත්. ඉක්බිති ඒ භික්ෂූහු ආයුෂ්මත් සෙය්‍යසකහට නන් අයුරින් ගරහා භාග්‍යවතුන් වහන්සේට මෙය සැළ කළහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "5. ඉක්බිති භාග්‍යවතුන් වහන්සේ මේ නිදානයෙහි මේ කාරණයෙහි භික්ෂු සඞ්ඝයා රැස් කරවා ආයුෂ්මත් සෙය්‍යසක මහණහු ගෙන් විචාළ සේක: “සැබෑ ද සෙය්‍යසකය, තෝ අතින් ගටා සුකුරු මුදයිදැ”යි අසා වදාළ සේක. “භාග්‍යවතුන් වහන්ස, සැබෑව”යි ඒ මහණ කී ය. භාග්‍යවත් බුදුරජානන් වහන්සේ ගැරහු සේක. “හිස් පුරුෂය, නුසුදුසු වූ අනුලොම් නුවූ අප්‍රතිරූප වූ ශ්‍රමණසාරුප්‍ය නුවූ නොකැප වූ නොකටයුත්තෙක. හිස් පුරුෂය තෝ කවර කරුණකින් අතින් ගටා සුකුරු මුදනෙහි ද?” “හිස් පුරුෂය මා විසින් නන් අයුරෙන් සරාගය පිණිස නො ව විරාගය පිණිස ධර්‍මය දෙසන ලද්දේ නො වේ ද? සංයෝගය පිණිස නො ව විසංයෝගය පිණිස ධර්‍මය දෙසන ලද්දේ නො වේ ද? උපාදානය පිණිස නොව අනුපාදානය පිණිස ධර්‍මය දේශනා කරණ ලද්දේ නො වේ ද? එහිලා හිස් පුරුෂය, තෝ මා විසින් විරාගය පිණිස ධර්‍මය දේශනා කළ කල්හි සරාගය පිණිස ප්‍රයෝග කෙළෙහි ය. විසංයෝගය පිණිස දහම් දෙසූ කල්හි සංයෝගය පිණිස ප්‍රයෝග කෙළෙහි ය. කෙලෙසුන් නොගැණීම පිණිස දහම් දෙසූ කල්හි කෙලෙසුන් ගැණීම පිණිස ප්‍රයෝග කෙළෙහි ය. “හිස් පුරුෂය මා විසින් නන් අයුරින් රාගවිරාගය පිණිස දහම් දෙසන ලද්දේ නොවේ ද? මදනිම්මදනය පිණිස පිපාසවිනය පිණිස ආලයසමුග්ඝාතය පිණිස වට්ටුපච්ඡේදය පිණිස තණ්හාක්ඛය පිණිස විරාගය පිණිස නිරෝධය පිණිස නිබ්බාණය පිණිස දහම් දෙසන ලද්දේ නො වේ ද? හිස් පුරුෂය මා විසින් නන් අයුරින් කාමයන්ගේ ප්‍රහාණය කියන ලද්දේ නොවේ ද? කාමසංඥාවන්ගේ ත්‍රිවිධ පරිඥාවෝ කියන ලද්දාහු නො වෙද්ද? කාමපිපාසයන්ගේ ප්‍රතිවිනය කියන ලද්දේ නො වේ ද? කාමවිතර්‍කයන්ගේ නැසීම කියන ලද්දේ නො වේ ද? කාමගුණිකරාගපරිදාහයන්ගේ සංහිඳීම කියන ලද්දේ නො වේ ද? හිස් පුරුෂය මෙය වනාහි නොපහන් වූවන්ගේ පැහැදීම පිණිස හෝ පහන් වූවන්ගේ බොහෝබව පිණිස හෝ නො වෙයි. වැලිදු හිස් පුරුෂය මෙය නො පහන් වූවන්ගේ පැහැදීම පිණිස පහන් වූ ඇතැමුන්ගේ අන්‍යථාත්වය පිණිස ම වෙයි.” යනුයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 260,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "6. අථ ඛො භගවා ආයස්මන්තං සෙය්යසකං අනෙකපරියායෙන විගරහිත්වා දුභරතාය{1} -පෙ- එවඤ්ච පන භික්ඛවෙ ඉමං සික්ඛාපදං උද්දිසෙය්යාථ:"
                    },
                    {
                        "type": "paragraph",
                        "text": "**“සඤ්චෙතනිකා සුක්කවිස්සට්ඨි{2} සඞ්ඝාදිසෙසො”ති.**"
                    },
                    {
                        "type": "paragraph",
                        "text": "එවඤ්චිදං භගවතා භික්ඛූනං සික්ඛාපදං පඤ්ඤත්තං හොති."
                    },
                    {
                        "type": "centered",
                        "text": "[**පඨමපඤ්ඤත්ති**.]",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "7. තෙන ඛො පන සමයෙන භික්ඛූ පණීතානි භොජනානි භුඤ්ජිත්වා මුට්ඨස්සතී අසම්පජානා නිද්දං ඔක්කමන්ති. තෙසං මුට්ඨස්සතීනං අසම්පජානානං නිද්දං ඔක්කමන්තානං සුපිනන්තෙන අසුචි මුච්චති. තෙසං කුක්කුච්චං අහොසි: “භගවතා සික්ඛාපදං පඤ්ඤත්තං සඤ්චෙතනිකා සුක්කවිසට්ඨි{3} සඞ්ඝාදිසෙසො”ති. “අම්හාකඤ්ච සුපිනන්තෙන අසුචි මුච්චති. අත්ථි චෙත්ථ චෙතනා ලබ්භ”ති{4}. “කච්චි නු ඛො මයං සඞ්ඝාදිසෙසං ආපත්තිං ආපන්නා”ති. භගවතො එතමත්ථං ආරොචෙසුං. “අත්ථෙසා භික්ඛවෙ චෙතනා සා ච ඛො අබ්බොහාරිකා”ති. එවඤ්ච පන භික්ඛවෙ ඉමං සික්ඛාපදං උද්දිසෙය්යාථ: –"
                    },
                    {
                        "type": "paragraph",
                        "text": "**“සඤ්චෙතනිකා සුක්කවිසට්ඨි1 අඤ්ඤත්ර සුපිනන්තා සඞ්ඝාදිසෙසො”ති.**"
                    },
                    {
                        "type": "centered",
                        "text": "[දුතියපඤ්ඤත්ති.]",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "**8. සඤ්චෙතනිකා’**ති ජානන්තො සඤ්ජානන්තො චෙච්ච අභිවිතරිත්වා වීතික්කමො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සුක්ක**න්ති දස සුක්කානි: නීලං පීතං{5} ලොහිතකං ඔදාතං තක්කවණ්ණං දකවණ්ණං තෙලවණ්ණං ඛීරවණ්ණං දධිවණ්ණං සප්පිවණ්ණං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**විසට්ඨී**ති{6} ඨානතො චාවනං{7} වුච්චති විසට්ඨීති{6}."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අඤ්ඤත්ර සුපිනන්තා’**ති ඨපෙත්වා සුපිනන්තං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සඞ්ඝාදිසෙසො’**ති සඞ්ඝො’ව තස්සා ආපත්තියා පරිවාසං දෙති, මූලාය පටිකස්සති, මානත්තං දෙති, අබ්භෙති. න සම්බහුලා, න එකපුග්ගලො. තෙන වුච්චති සඞ්ඝාදිසෙසො’ති. තස්සෙ’ව ආපත්තිනිකායස්ස නාමකම්මං අධිවචනං. තෙන’පි වුච්චති සඞ්ඝාදිසෙසො’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "9. අජ්ඣත්තරූපෙ මොචෙති, බහිද්ධාරූපෙ මොචෙති, අජ්ඣත්තබහිද්ධාරූපෙ මොචෙති, ආකාසෙ කටිං කම්පෙන්තො මොචෙති, රාගූපත්ථම්භෙ මොචෙති, වච්චූපත්ථම්භෙ මොචෙති, පස්සාවූපත්ථම්භෙ මොචෙති, වාතූපත්ථම්භෙ මොචෙති, උච්චාලිඞ්ගපාණකදට්ඨූපත්ථම්භෙ මොචෙති, ආරොග්යත්ථාය මොචෙති, සුඛත්ථාය මොචෙති, භෙසජ්ජත්ථාය මොචෙති, දානත්ථාය මොචෙති, පුඤ්ඤත්ථාය මොචෙති, යඤ්ඤත්ථාය මොචෙති, සග්ගත්ථාය මොචෙති, බීජත්ථාය මොචෙති, වීමංසත්ථාය මොචෙති, දවත්ථාය මොචෙති, නීලං මොචෙති, පීතකං මොචෙති, ලොහිතකං මොචෙති, ඔදාතං මොචෙති, තක්කවණ්ණං මොචෙති, දකවණ්ණං මොචෙති, තෙලවණ්ණං මොචෙති, ඛීරවණ්ණං මොචෙති, දධිවණ්ණං මොචෙති, සප්පිවණ්ණං මොචෙති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. දුබ්භරතාය, මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "2. සුක්කවිස්සට්ඨි, මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. සුක්කවිස්සට්ඨි, මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "4. ලබ්භති, මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "5. පීතකං, මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "6. විස්සට්ඨි, මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "7. චාවනා, මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "6. ඉක්බිති භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් සෙය්‍යසක මහණහට නන් අයුරින් ගරහා දුබරබව්හි ... වදාරා මහණෙනි මේ සිකපදය මෙසේ ද උදෙසවු:",
                        "type": "paragraph"
                    },
                    {
                        "text": "**“ව්‍යතික්‍රම චේතනා ඇති සුකුරු මිදුම සඟවෙසෙස් වේ.”**",
                        "type": "paragraph"
                    },
                    {
                        "text": "මෙසේ භාග්‍යවතුන් වහන්සේ විසින් භික්ෂූන්ට මේ සිකපදය පණවන ලදී.",
                        "type": "paragraph"
                    },
                    {
                        "text": "(පළමුපැණවීමයි.)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "7. එසමයෙහි භික්ෂූහු ප්‍රණීත බොජුන් වළඳා මුළා සිහි ඇත්තාහු සම්ප්‍රජන්‍යයෙන් තොර වූවාහු නින්දට බසිත්. මුළා සිහි ඇත්තාවු සති සම්ප්‍රජන්‍යයෙන් තොර වූවාවූ නින්දට බැස ගත් ඔවුන්ට සිහිනෙන් සුකුරු මිදෙයි. “භාග්‍යවතුන් වහන්සේ විසින් මිදියැටි සිතින් සුකුරු මිදුව සඟවෙසෙස් වේ ය”යි සිකපදයක් පණවන ලදී. අපට ද සිහිනෙන් සුකුරු මිදෙයි. මෙහිදී ආස්වාදචේතනාව ලැබේ ද? කිම? අපි සඟවෙසෙස් ඇවතට පැමිණියමෝ ද?”යි කුකුස් විය. භාග්‍යවතුන් වහන්සේට මේ කාරණය සැළකළාහු ය. මහණෙනි, මෙහි චේතනාවක් ඇත. එය ඇවතට අංග නො වෙයි. මහණෙනි, මේ සිකපදය මෙසේ උදෙසවු:",
                        "type": "paragraph"
                    },
                    {
                        "text": "**“සිහින විනා ව්‍යතික්‍රම චේතනා ඇති සුකුරු මිදුම සඟවෙසෙස් වේ.”**",
                        "type": "paragraph"
                    },
                    {
                        "text": "(දෙවනපැණවීමයි.)",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "8. සඤේචතනිකා යනු උපක්‍රම කරමි යි දන්නේ, සුකුරු මුදමි යි මැනැවින් දන්නේ, සිතා, නිසැක සිත මෙහෙයා ව්‍යතික්‍රමය කිරීම ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සුක්කං යනු නිල්වන් ය, කසාවන් ය, ලෙහෙවන් ය, සුදුවන් ය, මෝරුවන් ය, දියවන් ය, තෙල්වන් ය, කිරිවන් ය, දිහිවන් ය, ගිතෙල් වන් ය, යන දස සුකුරු ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "විසට්ඨි යනු පිහිටි තැනින් මිදීම විසට්ඨි ය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අඤ්ඤත්‍ර සුපීනන්තා යනු සිහින හැර යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සංඝාදිසෙසො යනු සඞ්ඝයා ම ඒ ඇවතට පිරිවෙස් දෙයි. මුලට අදියි. මානත දෙයි. අබ්භානය කෙරෙයි. සම්බහුලයෝ ද නො වෙත්. එක් පුද්ගලයෙක් ද නො වෙයි. එහෙයින් සඞ්ඝාදිසෙස ය යි කියනු ලැබේ. ඒ ඇවැත්සමූහයට නම් කිරීමකි. එයිනුදු සංඝාදිසෙස ය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "9. ආධ්‍යාත්මිකරූපයෙහි මුදයි. බාහිර රූපයෙහි මුදයි. ආධ්‍යාත්මික බාහිර රූපයෙහි මුදයි, අහසෙහි කටිය සොලවමින් මුදයි. රාගයෙන් තද වූ කල්හි මුදයි. වසුරුයෙන් තදවූ කල්හි මුදයි. මූයෙන් තද වූ කල්හි මුදයි. වායෙන් තද වූ කල්හි මුදයි. බූපණූදළපහසින් තද වූ කල්හි මුදයි. නීරෝග බව පිණිස මුදයි. සුවය පිණිස බෙහෙත් පිණිස මුදයි. දානය පිණිස මුදයි. පින් පිණිස මුදයි. යැදීම පිණිස මුදයි. දෙව්ලෝ සැප ලැබීම පිණිස මුදයි. බීජ පිණිස මුදයි, විමසීම පිණිස මුදයි. කෙළි පිණිස මුදයි. නිල් පැහැය ඇත්තක් මුදයි. කහ පැහැය ඇත්තක් මුදයි. ලේ පැහැය ඇත්තක් මුදයි. සුදු පැහැය ඇත්තක් මුදයි. මොහොරු පැහැය ඇත්තක් මුදයි. දිය පැහැය ඇත්තක් මුදයි. තෙල් පැහැය ඇත්තක් මුදයි. කිරි පැහැය ඇත්තක් මුදයි. දී පැහැය ඇත්තක් මුදයි. ගිතෙල් පැහැය ඇත්තක් මුදයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 262,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "10. **අජ්ඣත්තරූපෙ’ති** අජ්ඣත්තං උපාදින්නෙ රූපෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "**බහිද්ධාරූපෙ’ති** බහිද්ධා උපාදින්නෙ වා අනුපාදින්නෙ වා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අජ්ඣත්තබහිද්ධාරූපෙ’ති** තදුභයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ආකාසෙ කටිං කම්පෙන්තො’ති** ආකාසෙ වායමන්තස්ස අඞ්ගජාතං කම්මනියං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**රාගූපත්ථම්භෙ’ති** රාගෙන පීළිතස්ස අඞ්ගජාතං කම්මනියං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**වච්චූපත්ථම්භෙ’ති** වච්චෙන පීළිතස්ස අඞ්ගජාතං කම්මනියං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පස්සාවූපත්ථම්භෙ’ති** පස්සාවෙන පීළිතස්ස අඞ්ගජාතං කම්මනියං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**වාතූපත්ථම්භෙ’ති** වාතෙන පීළිතස්ස අඞ්ගජාතං කම්මනියං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**උච්චාලිඞ්ගපාණකදට්ඨූපත්ථම්භෙ’ති** උච්චාලිඞ්ගපාණකදට්ඨෙන අඞ්ගජාතං කම්මනියං හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ආරොග්යත්ථායා’ති** අරොගො භවිස්සාමි;"
                    },
                    {
                        "type": "paragraph",
                        "text": "**සුඛත්ථායා’ති** සුඛං වෙදනං උප්පාදෙස්සාමි;"
                    },
                    {
                        "type": "paragraph",
                        "text": "**භෙසජ්ජත්ථායා’ති** භෙසජ්ජං භවිස්සති;"
                    },
                    {
                        "type": "paragraph",
                        "text": "**දානත්ථායා’ති** දානං දස්සාමි;"
                    },
                    {
                        "type": "paragraph",
                        "text": "**පුඤ්ඤත්ථායා’**ති පුඤ්ඤං භවිස්සති;"
                    },
                    {
                        "type": "paragraph",
                        "text": "**යඤ්ඤත්ථායා’**ති යඤ්ඤං යජිස්සාමි;"
                    },
                    {
                        "type": "paragraph",
                        "text": "**සග්ගත්ථායා’**ති සග්ගං ගමිස්සාමි;"
                    },
                    {
                        "type": "paragraph",
                        "text": "**බීජත්ථායා’**ති බීජං භවිස්සති;"
                    },
                    {
                        "type": "paragraph",
                        "text": "**වීමංසත්ථායා’**ති නීලං භවිස්සති -පෙ- සප්පිවණ්ණං භවිස්සති;"
                    },
                    {
                        "type": "paragraph",
                        "text": "**දවත්ථායා’ති** ඛිඩ්ඩාධිප්පායො."
                    },
                    {
                        "type": "paragraph",
                        "text": "11. අජ්ඣත්තරූපෙ චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "බහිද්ධාරූපෙ චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "අජ්ඣත්තබහිද්ධාරූපෙ චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "ආකාසෙ කටිං කම්පෙන්තො චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "රාගූපත්ථම්භෙ චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "10. **අජ්ඣත්තරූපෙ** යනු ආධ්‍යාත්මික සවිඥාන රූපයෙහි ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බහිද්ධාරූපෙ යනු බාහිර වූ සවිඥාන වූ හෝ අවිඥාන රූපයෙහි ය.",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "අජ්ඣත්තබහිද්ධාරූපෙ යි ඒ දෙපරිදි රූපයෙහි ය."
                    },
                    {
                        "text": "ආකාසෙ කටිං කම්පෙන්තො යනු අහසෙහි වෑයම් කරන්නහුගේ හදන් කර්‍මන්‍ය වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "රාගුපත්ථම්හෙ යනු රාගයෙන් පෙළුනහුගේ හදන් කර්‍මන්‍ය වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වචවූපත්ථම්හෙ යනු වර්චසින් පෙළුනහුගේ හදන් කර්‍මන්‍ය වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පස්සාවූපත්ථම්හෙ යනු මූයෙන් පෙළුනහුගේ හදන් කර්‍මන්‍ය වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වාතූපත්ථම්හෙ යනු වායෙන් පෙළුනහුගේ හදන් කර්‍මන්‍ය වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "උච්චාලිඞ්ගපාණකදට්ඨුපත්ථම්හෙ යනු බූපණුලොම් ගැටීමෙන් හදන් කර්‍මන්‍ය වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආරෝග්‍යත්ථාය යනු නීරෝගයෙක් වන්නෙමි යි (අදහසින්).",
                        "type": "paragraph"
                    },
                    {
                        "text": "සුඛත්ථාය යනු සුවවේදනා උපදවන්නෙමි යි (අදහසින්).",
                        "type": "paragraph"
                    },
                    {
                        "text": "භෙසජ්ජත්ථාය යනු බෙහෙතක් වන්නේයැ යි (සිතා).",
                        "type": "paragraph"
                    },
                    {
                        "text": "දානත්ථාය යනු දන් දෙන්නෙමි යි (සිතා).",
                        "type": "paragraph"
                    },
                    {
                        "text": "පුඤ්ඤත්ථාය යනු පිණක් වන්නේය යි (සිතා).",
                        "type": "paragraph"
                    },
                    {
                        "text": "යඤ්ඤත්ථාය යනු යාගයක් කරන්නෙමි යි (සිතා).",
                        "type": "paragraph"
                    },
                    {
                        "text": "සග්ගත්ථාය යනු දෙව්ලොවට යන්නෙමි යි (සිතා).",
                        "type": "paragraph"
                    },
                    {
                        "text": "බීජත්ථාය යි දාරකබීජයක් වන්නේ යැ යි (සිතා).",
                        "type": "paragraph"
                    },
                    {
                        "text": "වීමංසත්ථාය යනු නිල්වන්නේ දැ යි ... ගිතෙල් පැහැය වන්නේ දැ යි විමසීම පිණිස.",
                        "type": "paragraph"
                    },
                    {
                        "text": "දවත්ථාය යනු කෙළි අදහස් ඇත්තේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "11. ආධ්‍යාත්ම රූපයෙහි මිදේවා යි සිතා ද, එයට වෑයම් කෙරේ ද, මිදේ ද, සඟ වෙසස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බාහිර රූපයෙහි මිදේවා යි සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟ වෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආධ්‍යාත්ම බාහිර රූපයෙහි සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟ වෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අහසෙහි කටිය සොලොවමින් සිතා ද වෑයම් කෙරේ ද, මිදේ ද, සඟ වෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "රාගයෙහි තද වූ කල්හි සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 264,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "වච්චූපත්ථම්භෙ චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "පස්සාවූපත්ථම්භෙ චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "වාතූපත්ථම්භෙ චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "උච්චාලිඞ්ගපාණකදට්ඨූපත්ථම්භෙ චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "gatha",
                        "text": "12. ආරොග්යත්ථාය චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස.\nසුඛත්ථාය චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස.\nභෙසජ්ජත්ථාය චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස.\nදානත්ථාය චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස.\nපුඤ්ඤත්ථාය චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස.\nයඤ්ඤත්ථාය චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස.\nසග්ගත්ථාය චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස.\nබීජත්ථාය චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස.\nවීමංසත්ථාය චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස.\nදවත්ථාය චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "13. නීලං චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. පීතකං -පෙ- ලොහිතකං -පෙ- ඔදාතං -පෙ- තක්කවණ්ණං -පෙ- දකවණ්ණං -පෙ- තෙලවණ්ණං -පෙ- ඛීරවණ්ණං -පෙ- දධිවණ්ණං -පෙ- සප්පිවණ්ණං චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "සුද්ධිකං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "14. ආරොග්යත්ථඤ්ච සුඛත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. ආරොග්යත්ථඤ්ච භෙසජ්ජත්ථඤ්ච -පෙ- ආරොග්යත්ථඤ්ච දානත්ථඤ්ච -පෙ- ආරොග්යත්ථඤ්ච පුඤ්ඤත්ථඤ්ච -පෙ- ආරොග්යත්ථඤ්ච යඤ්ඤත්ථඤ්ච -පෙ- ආරොග්යත්ථඤ්ච සග්ගත්ථඤ්ච -පෙ- ආරොග්යත්ථඤ්ච බීජත්ථඤ්ච -පෙ- ආරොග්යත්ථඤ්ච වීමංසත්ථඤ්ච -පෙ- ආරොග්යත්ථඤ්ච දවත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "එකමූලකස්ස ඛණ්ඩචක්කං නිට්ඨිතං.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "වර්‍චසින් තද වූ කල්හි සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මූයෙන් තද වූ කල්හි සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟවෙසස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වායෙන් තද වූ කල්හි සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟවෙසස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බූපණු දළ ගැටීමෙන් තද වූ කල්හි සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟවෙසස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "12. නීරෝග බව පිණිස සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟවෙසෙස් ඇවැත් වේ. සුව පිණිස සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟවෙසෙස් ඇවැත් වේ. බෙහෙත් පිණිස සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟවෙසෙස් ඇවැත් වේ. දන් පිණිස සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟවෙසෙස් ඇවැත් වේ. පින් පිණිස සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟවෙසෙස් ඇවැත් වේ. යාග පිණිස සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟවෙසෙස් ඇවැත් වේ. සග පිණිස සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟවෙසෙස් ඇවැත් වේ. දාරකබීජය පිණිස සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟවෙසෙස් ඇවැත් වේ. කෙළි පිණිස සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟවෙසෙස් ඇවැත් වේ. විමසීම පිණිස සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "13. නිල්වන් සුකුරු මිදීමට සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟවෙසස් ඇවැත් වේ. කසාවන් ... ලෙහෙවන් ... සුදුවන් ... මොහොරුවන් ... දියවන් ... තෙල්වන් ... කිරිවන් ... දීවන් ... ගිතෙල්වන් සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සුද්ධිකය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "14. ආරෝග්‍යය පිණිසත් සුවය පිණිසත්, සිතා ද, වෑයම් කෙරේ ද, මිදේ ද සඟවෙසෙස් ඇවැත් වේ. ආරෝග්‍යය පිණිසත් බෙහෙත් පිණිසත් ... ආරෝග්‍ය පිණිසත් දන් පිණිසත් ... ආරෝග්‍යය පිණිසත් පින් පිණිසත් ... ආරෝග්‍යය පිණිසත් යාග පිණිසත් ... ආරෝග්‍යය පිණිසත් ස්වර්‍ගය පිණිසත් ... ආරෝග්‍යය පිණිසත් දාරකබීජය පිණිසත් ... ආරෝග්‍යය පිණිසත් විමසීම පිණිසත් ... ආරෝග්‍යය පිණිසත් කෙළි පිණිසත් සිතා ද, වෑයම් කෙරේ ද, මිදේ ද, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එකමූලක ඛණ්ඩචක්‍රය නිමි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 266,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "15. සුඛත්ථඤ්ච භෙසජ්ජත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. සුඛත්ථඤ්ච දානත්ථඤ්ච -පෙ- සුඛත්ථඤ්ච පුඤ්ඤත්ථඤ්ච -පෙ- සුඛත්ථඤ්ච යඤ්ඤත්ථඤ්ච -පෙ- සුඛත්ථඤ්ච සග්ගත්ථඤ්ච -පෙ- සුඛත්ථඤ්ච බීජත්ථඤ්ච -පෙ- සුඛත්ථඤ්ච වීමංසත්ථඤ්ච -පෙ- සුඛත්ථඤ්ච දවත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. සුඛත්ථඤ්ච ආරොග්යත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "16. භෙසජ්ජත්ථඤ්ච දානත්ථඤ්ච -පෙ- භෙසජ්ජත්ථඤ්ච පුඤ්ඤත්ථඤ්ච -පෙ- භෙසජ්ජත්ථඤ්ච යඤ්ඤත්ථඤ්ච -පෙ- භෙසජ්ජත්ථඤ්ච සග්ගත්ථඤ්ච -පෙ- භෙසජ්ජත්ථඤ්ච බීජත්ථඤ්ච -පෙ- භෙසජ්ජත්ථඤ්ච වීමංසත්ථඤ්ච -පෙ- භෙසජ්ජත්ථඤ්ච දවත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. භෙසජ්ජත්ථඤ්ච ආරොග්යත්ථඤ්ච -පෙ- භෙසජ්ජත්ථඤ්ච සුඛත්ථඤ්ච චෙතෙති, උපක්කමති, මුච්චති ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "17. දානත්ථඤ්ච පුඤ්ඤත්ථඤ්ච -පෙ- දානත්ථඤ්ච යඤ්ඤත්ථඤ්ච -පෙ- දානත්ථඤ්ච සග්ගත්ථඤ්ච -පෙ- දානත්ථඤ්ච බීජත්ථඤ්ච -පෙ- දානත්ථඤ්ච වීමංසත්ථඤ්ච -පෙ- දානත්ථඤ්ච දවත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. දානත්ථඤ්ච ආරොග්යත්ථඤ්ච -පෙ- දානත්ථඤ්ච සුඛත්ථඤ්ච -පෙ- දානත්ථඤ්ච භෙසජ්ජත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "18. පුඤ්ඤත්ථඤ්ච යඤ්ඤත්ථඤ්ච -පෙ- පුඤ්ඤත්ථඤ්ච සග්ගත්ථඤ්ච -පෙ- පුඤ්ඤත්ථඤ්ච බීජත්ථඤ්ච -පෙ- පුඤ්ඤත්ථඤ්ච වීමංසත්ථඤ්ච -පෙ- පුඤ්ඤත්ථඤ්ච දවත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. පුඤ්ඤත්ථඤ්ච ආරොග්යත්ථඤ්ච -පෙ- පුඤ්ඤත්ථඤ්ච සුඛත්ථඤ්ච -පෙ- පුඤ්ඤත්ථඤ්ච භෙසජ්ජත්ථඤ්ච -පෙ- පුඤ්ඤත්ථඤ්ච දානත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "19. යඤ්ඤත්ථඤ්ච සග්ගත්ථඤ්ච -පෙ- යඤ්ඤත්ථඤ්ච බීජත්ථඤ්ච -පෙ- යඤ්ඤත්ථඤ්ච වීමංසත්ථඤ්ච -පෙ- යඤ්ඤත්ථඤ්ච දවත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. යඤ්ඤත්ථඤ්ච ආරොග්යත්ථඤ්ච -පෙ- යඤ්ඤත්ථඤ්ච සුඛත්ථඤ්ච -පෙ- යඤ්ඤත්ථඤ්ච භෙසජ්ජත්ථඤ්ච -පෙ- යඤ්ඤත්ථඤ්ච දානත්ථඤ්ච -පෙ- යඤ්ඤත්ථඤ්ච පුඤ්ඤත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "20. සග්ගත්ථඤ්ච බීජත්ථඤ්ච -පෙ- සග්ගත්ථඤ්ච වීමංසත්ථඤ්ච -පෙ- සග්ගත්ථඤ්ච දවත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. සග්ගත්ථඤ්ච ආරොග්යත්ථඤ්ච -පෙ- සග්ගත්ථඤ්ච සුඛත්ථඤ්ච -පෙ- සග්ගත්ථඤ්ච භෙසජ්ජත්ථඤ්ච -පෙ- සග්ගත්ථඤ්ච දානත්ථඤ්ච -පෙ- සග්ගත්ථඤ්ච පුඤ්ඤත්ථඤ්ච -පෙ- සග්ගත්ථඤ්ච යඤ්ඤත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "15. සුව පිණිස ද, බෙහෙත් පිණිස ද, සිතයි නම් වෑයම් කෙරෙයි නම් මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. සුව පිණිස ද දන් පිණිස ද ... සුව පිණිස ද පින් පිණිස ද ... සුව පිණිස ද යාග පිණිස ද ... සුව පිණිස ද සග පිණිස ද ... සුව පිණිස ද බීජ පිණිස ද ... සුව පිණිස ද විමසුම පිණිස ද ... සුව පිණිස ද කෙළි පිණිස ද සිතයි නම් වෑයම් කෙරෙයි නම් මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. සුව පිණිස ද ආරෝග්‍යය පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "16. බෙහෙත් පිණිස ද දානය පිණිස ද ... බෙහෙත් පිණිස ද පින් පිණිස ද ... බෙහෙත් පිණිස ද යාග පිණිස ද ... බෙහෙත් පිණිස ද සග පිණිස ද ... බෙහෙත් පිණිස ද බීජ පිණිස ද ... බෙහෙත් පිණිස ද විමසුම පිණිස ද ... බෙහෙත් පිණිස ද කෙළි පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. බෙහෙත් පිණිස ද ආරෝග්‍යය පිණිස ද ... බෙහෙත් පිණිස ද සුව පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "17. දන් පිණිස ද පින් පිණිස ද ... දන් පිණිස ද යාග පිණිස ද ... දන් පිණිස ද සග පිණිස ද ... දන් පිණිස ද බීජ පිණිස ද ... දන් පිණිස ද විමසුම පිණිස ද ... දන් පිණිස ද කෙළි පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. දන් පිණිස ද ආරෝග්‍යය පිණිස ද ... දන් පිණිස ද සුව පිණිස ද ... දන් පිණිස ද බෙහෙත් පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "18. පින් පිණිස ද යාග පිණිස ද ... පින් පිණිස ද සග පිණිස ද ... පින් පිණිස ද බීජ පිණිස ද ... පින් පිණිස ද විමසුම පිණිස ද ... පින් පිණිස ද කෙළි පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. පින් පිණිස ද ආරෝග්‍යය පිණිස ද ... පින් පිණිස ද සුව පිණිස ද ... පින් පිණිස ද බෙහෙත් පිණිස ද ... පින් පිණිස ද දන් පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "19. යාග පිණිස ද සග පිණිස ද ... යාග පිණිස ද බීජ පිණිස ද ... යාග පිණිස ද විමසුම පිණිස ද ... යාග පිණිස ද කෙළි පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. යාග පිණිස ද ආරෝග්‍යය පිණිස ද ... යාග පිණිස ද සුව පිණිස ද ... යාග පිණිස ද බෙහෙත් පිණිස ද ... යාග පිණිස ද දානය පිණිස ද ... යාග පිණිස ද පින් පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "20. සග පිණිස ද ගැබ් පිණිස ද ... සග පිණිස ද විමසුම පිණිස ද ... සග පිණිස ද කෙළි පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. සග පිණිස ද ආරෝග්‍යය පිණිස ද ... සග පිණිස ද සුව පිණිස ද ... සග පිණිස ද බෙහෙත් පිණිස ද ... සග පිණිස ද කෙළි පිණිස ද ... සග පිණිස ද පින් පිණිස ද ... සග පිණිස ද යාග පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 268,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "21. බීජත්ථඤ්ච වීමංසත්ථඤ්ච -පෙ- බීජත්ථඤ්ච දවත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. බීජත්ථඤ්ච ආරොග්යත්ථඤ්ච -පෙ- බීජත්ථඤ්ච සුඛත්ථඤ්ච -පෙ- බීජත්ථඤ්ච භෙසජ්ජත්ථඤ්ච -පෙ- බීජත්ථඤ්ච දානත්ථඤ්ච -පෙ- බීජත්ථඤ්ච පුඤ්ඤත්ථඤ්ච -පෙ- බීජත්ථඤ්ච යඤ්ඤත්ථඤ්ච -පෙ- බීජත්ථඤ්ච සග්ගත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "22. වීමංසත්ථඤ්ච දවත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. වීමංසත්ථඤ්ච ආරොග්යත්ථඤ්ච -පෙ- වීමංසත්ථඤ්ච සුඛත්ථඤ්ච -පෙ- වීමංසත්ථඤ්ච භෙසජ්ජත්ථඤ්ච -පෙ- වීමංසත්ථඤ්ච දානත්ථඤ්ච -පෙ- වීමංසත්ථඤ්ච පුඤ්ඤත්ථඤ්ච -පෙ- වීමංසත්ථඤ්ච යඤ්ඤත්ථඤ්ච -පෙ- වීමංසත්ථඤ්ච සග්ගත්ථඤ්ච -පෙ- වීමංසත්ථඤ්ච බීජත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "23. දවත්ථඤ්ච ආරොග්යත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. දවත්ථඤ්ච සුඛත්ථඤ්ච -පෙ- දවත්ථඤ්ච භෙසජ්ජත්ථඤ්ච -පෙ- දවත්ථඤ්ච දානත්ථඤ්ච -පෙ- දවත්ථඤ්ච පුඤ්ඤත්ථඤ්ච -පෙ- දවත්ථඤ්ච යඤ්ඤත්ථඤ්ච -පෙ- දවත්ථඤ්ච සග්ගත්ථඤ්ච -පෙ- දවත්ථඤ්ච බීජත්ථඤ්ච -පෙ- දවත්ථඤ්ච වීමංසත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "එකමූලකස්ස බද්ධචක්කං සඞ්ඛිත්තං.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "එකමූලකස්ස චක්කපෙය්යාලං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "24. ආරොග්යත්ථඤ්ච සුඛත්ථඤ්ච භෙසජ්ජත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. -පෙ- ආරොග්යත්ථඤ්ච සුඛත්ථඤ්ච දවත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "දුමූලකස්ස ඛණ්ඩචක්කං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "25. සුඛත්ථඤ්ච භෙසජ්ජත්ථඤ්ච දානත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. -පෙ- සුඛත්ථඤ්ච භෙසජ්ජත්ථඤ්ච දවත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. සුඛත්ථඤ්ච භෙසජ්ජත්ථඤ්ච ආරොග්යත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "දුමූලකස්ස බද්ධචක්කං සඞ්ඛිත්තං.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "21. ගැබ් පිණිස ද විමසුම් පිණිස ද ... ගැබ් පිණිස ද කෙළි පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. ගැබ් පිණිස ද ආරෝග්‍යය පිණිස ද ... ගැබ් පිණිස ද සුව පිණිස ද ... ගැබ් පිණිස ද බෙහෙත් පිණිස ද ... ගැබ් පිණිස ද දන් පිණිස ද ... ගැබ් පිණිස ද පින් පිණිස ද ... ගැබ් පිණිස ද යාග පිණිස ද ... ගැබ් පිණිස ද සග පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "22. විමසුම් පිණිස ද කෙළි පිණිස ද සිතයි නම් වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. විමසුම් පිණිස ද ආරෝග්‍යය පිණිස ද ... විමසුම් පිණිස ද සුව පිණිස ද ... විමසුම් පිණිස ද බෙහෙත් පිණිස ද ... විමසුම් පිණිස ද දන් පිණිස ද ... විමසුම් පිණිස ද පින් පිණිස ද ... විමසුම් පිණිස ද යාග පිණිස ද ... විමසුම් පිණිස ද සග පිණිස ද ... විමසුම් පිණිස ද ගැබ් පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "23. කෙළි පිණිස ද ආරෝග්‍යය පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. කෙළි පිණිස ද සුව පිණිස ද ... කෙළි පිණිස ද බෙහෙත් පිණිස ද ... කෙළි පිණිස ද දන් පිණිස ද ... කෙළි පිණිස ද පින් පිණිස ද ... කෙළි පිණිස ද යාග පිණිස ද ... කෙළි පිණිස ද සග පිණිස ද ... කෙළි පිණිස ද ගැබ් පිණිස ද ... කෙළි පිණිස ද විමසුම් පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එකමූලකබද්ධචක්‍රය සංක්ෂේප කරණ ලදී.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "එකමූලක චක්‍රපෙය්‍යාලය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "24. ආරෝග්‍යය පිණිස ද සුව පිණිස ද බෙහෙත් පිණිස සිතයි නම්, වෑයම් කෙරෙයි නම් මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. ... ආරෝග්‍යය පිණිස ද සුව පිණිස ද කෙළි පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ද්විමූලක ඛණ්ඩචක්‍රය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "25. සුව පිණිස ද බෙහෙත් පිණිස ද දන් පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟ වෙසෙස් ඇවැත් වේ. ... සුව පිණිස ද බෙහෙත් පිණිස ද කෙළි පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම්, සඟ වෙසෙස් ඇවැත් වේ. සුව පිණිස ද බෙහෙත් පිණිස ද ආරෝග්‍යය පිණිස ද සිතයි නම් වෑයම් කෙරෙයි නම් මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ද්විමූලක බද්ධචක්‍රය සංක්ෂිප්තයි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 270,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "26. වීමංසත්ථඤ්ච දවත්ථඤ්ච ආරොග්යත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස.{1} වීමංසත්ථඤ්ච දවත්ථඤ්ච සුඛත්ථඤ්ච -පෙ- වීමංසත්ථඤ්ච දවත්ථඤ්ච බීජත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "දුමූලකං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "27. තිමූලකම්පි චතුමූලකම්පි පඤ්චමූලකම්පි ඡමූලකම්පි සත්තමූලකම්පි අට්ඨමූලකම්පි නවමූලකම්පි එවමෙව විත්ථාරෙතබ්බං."
                    },
                    {
                        "type": "centered",
                        "text": "ඉදං සබ්බමූලකං:",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "28. ආරොග්යත්ථඤ්ච සුඛත්ථඤ්ච භෙසජ්ජත්ථඤ්ච දානත්ථඤ්ච පුඤ්ඤත්ථඤ්ච යඤ්ඤත්ථඤ්ච සග්ගත්ථඤ්ච බීජත්ථඤ්ච වීමංසත්ථඤ්ච දවත්ථඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "සබ්බමූලකං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "චක්කපෙය්යාලං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "29. නීලඤ්ච පීතකඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. නීලඤ්ච ලොහිතකඤ්ච -පෙ- නීලඤ්ච ඔදාතඤ්ච. -පෙ- නීලඤ්ච තක්කවණ්ණඤ්ච, -පෙ- නීලඤ්ච දකවණ්ණඤ්ච, -පෙ- නීලඤ්ච තෙලවණ්ණඤ්ච, -පෙ- නීලඤ්ච ඛීරවණ්ණඤ්ච, -පෙ- නීලඤ්ච දධිවණ්ණඤ්ච, -පෙ- නීලඤ්ච සප්පිවණ්ණඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "එකමූලකස්ස ඛණ්ඩචක්කං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "30. පීතකඤ්ච ලොහිතකඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. පීතකඤ්ච ඔදාතඤ්ච -පෙ- පීතකඤ්ච තක්කවණ්ණඤ්ච -පෙ- පීතකඤ්ච දකවණ්ණඤ්ච -පෙ- පීතකඤ්ච තෙලවණ්ණඤ්ච -පෙ- පීතකඤ්ච ඛීරවණ්ණඤ්ච -පෙ- පීතකඤ්ච දධිවණ්ණඤ්ච, -පෙ- පීතකඤ්ච සප්පිවණ්ණඤ්ච -පෙ- පීතකඤ්ච නීලඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "එකමූලකස්ස බද්ධචක්කං.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. බුජමු පොත්ථකෙ ‘...සඞ්ඝාදිසෙසස්ස -පෙ- වීමංසත්ථඤ්ච ...’ඉති අධිකපාඨො දිස්සති. තං නයුත්තං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "26. විමසීම පිණිස ද කෙළි පිණිස ද ආරෝග්‍යය පිණිස ද සිතයි, වෑයම් කෙරෙයි, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. ... විමසීම පිණිස ද කෙළි පිණිස ද සුව පිණිස ද ... විමසීම පිණිස ද කෙළි පිණිස ද ගැබ් පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම්, සඟ වෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ද්විමූලකය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "27. තිමූලකය ද, චතුමූලකය ද, පඤ්චමූලකය ද, ඡමූලකය ද, සත්තමූලකය ද, අට්ඨමූලකය ද, නවමූලකය ද මෙසේ ම විස්තර කටයුතු ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මේ සබ්බමූලකයයි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "28. ආරෝග්‍යය පිණිස ද සුවය පිණිස ද බෙහෙත් පිණිස ද දන් පිණිස ද පින් පිණිස ද යාගය පිණිස ද සග පිණිස ද ගැබ් පිණිස ද විමංසනය පිණිස ද කෙළි පිණිස ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟ වෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සබ්බමූලකය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "චක්කපෙය්‍යාලය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "29. නිල්වන් ද කහවන් ද සිතයි, වෑයම් කෙරෙයි, මිදෙයි, සඟවෙසෙස් ඇවැත් වේ. නිල්වන් ද ලේ වන් ද ... නිල්වන් ද සුදු වන් ද ... නිල්වන් ද මොහොරු වන් ද ... නිල්වන් ද දියවන් ද ... නිල්වන් ද තෙල්වන් ද ... නිල්වන් ද කිරිවන් ද ... නිල්වන් ද දිහිවන් ද ... නිල්වන් ද ගිතෙල්වන් ද සිතයි නම්, වෑයම් කරයි නම්, මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එකමූලක ඛණ්ඩචක්‍රය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "30. කහවන් ද ලේවන් ද සිතයි නම්, වෑයම් කරයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. කහවන් ද සුදුවන් ද ... කහවන් ද මෝරුවන් ද ... කහවන් ද දියවන් ද ... කහවන් ද තෙල්වන් ද ... කහවන් ද කිරිවන් ද ... කහවන් ද දිහිවන් ද ... කහවන් ද ගිතෙල්වන් ද ... කහවන් ද නිල්වන් ද සිතයි නම්, වෑයම් කරයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එකමූලක බද්ධචක්‍රය",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 272,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "31. ලොහිතකඤ්ච ඔදාතඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. ලොහිතකඤ්ච තක්කවණ්ණඤ්ච -පෙ- ලොහිතකඤ්ච දකවණ්ණඤ්ච -පෙ- ලොහිතකඤ්ච තෙලවණ්ණඤ්ච -පෙ- ලොහිතකඤ්ච ඛීරවණ්ණඤ්ච -පෙ- ලොහිතකඤ්ච දධිවණ්ණඤ්ච -පෙ- ලොහිතකඤ්ච සප්පිවණ්ණඤ්ච චෙතෙති උපක්කමති මුච්චති ආපත්ති සඞ්ඝාදිසෙසස්ස. ලොහිතකඤ්ච නීලඤ්ච -පෙ- ලොහිතකඤ්ච පීතකඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "32. ඔදාතඤ්ච තක්කවණ්ණඤ්ච -පෙ- ඔදාතඤ්ච දකවණ්ණඤ්ච -පෙ- ඔදාතඤ්ච තෙලවණ්ණඤ්ච -පෙ- ඔදාතඤ්ච ඛීරවණ්ණඤ්ච -පෙ- ඔදාතඤ්ච දධිවණ්ණඤ්ච -පෙ- ඔදාතඤ්ච සප්පිවණ්ණඤ්ච චෙතෙති උපක්කමති මුච්චති ආපත්ති සඞ්ඝාදිසෙසස්ස. ඔදාතඤ්ච නීලඤ්ච -පෙ- ඔදාතඤ්ච පීතකඤ්ච -පෙ- ඔදාතඤ්ච ලොහිතකඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "33. තක්කවණ්ණඤ්ච දකවණ්ණඤ්ච -පෙ- තක්කවණ්ණඤ්ච තෙලවණ්ණඤ්ච -පෙ- තක්කවණ්ණඤ්ච ඛීරවණ්ණඤ්ච -පෙ- තක්කවණ්ණඤ්ච දධිවණ්ණඤ්ච -පෙ- තක්කවණ්ණඤ්ච සප්පිවණ්ණඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. තක්කවණ්ණඤ්ච නීලඤ්ච -පෙ- තක්කවණ්ණඤ්ච පීතකඤ්ච -පෙ- තක්කවණ්ණඤ්ච ලොහිතකඤ්ච -පෙ- තක්කවණ්ණඤ්ච ඔදාතඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "34. දකවණ්ණඤ්ච තෙලවණ්ණඤ්ච -පෙ- දකවණ්ණඤ්ච ඛීරවණ්ණඤ්ච -පෙ- දකවණ්ණඤ්ච දධිවණ්ණඤ්ච -පෙ- දකවණ්ණඤ්ච සප්පිවණ්ණඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. දකවණ්ණඤ්ච නීලඤ්ච -පෙ- දකවණ්ණඤ්ච පීතකඤ්ච -පෙ- දකවණ්ණඤ්ච ලොහිතකඤ්ච -පෙ- දකවණ්ණඤ්ච ඔදාතඤ්ච -පෙ- දකවණ්ණඤ්ච තක්කවණ්ණඤ්ච චෙතෙති උපක්කමති මුච්චති ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "35. තෙලවණ්ණඤ්ච ඛීරවණ්ණඤ්ච -පෙ- තෙලවණ්ණඤ්ච දධිවණ්ණඤ්ච -පෙ- තෙලවණ්ණඤ්ච සප්පිවණ්ණඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. තෙලවණ්ණඤ්ච නීලඤ්ච -පෙ- තෙලවණ්ණඤ්ච පීතකඤ්ච -පෙ- තෙලවණ්ණඤ්ච ලොහිතකඤ්ච -පෙ- තෙලවණ්ණඤ්ච ඔදාතඤ්ච -පෙ- තෙලවණ්ණඤ්ච තක්කවණ්ණඤ්ච -පෙ- තෙලවණ්ණඤ්ච දකවණ්ණඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "36. ඛීරවණ්ණඤ්ච දධිවණ්ණඤ්ච -පෙ- ඛීරවණ්ණඤ්ච සප්පිවණ්ණඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. ඛීරවණ්ණඤ්ච නීලඤ්ච{1} -පෙ- ඛීරවණ්ණඤ්ච පීතකඤ්ච -පෙ- ඛීරවණ්ණඤ්ච ලොහිතකඤ්ච -පෙ- ඛීරවණ්ණඤ්ච ඔදාතඤ්ච -පෙ- ඛීරවණ්ණඤ්ච තක්කවණ්ණඤ්ච -පෙ- ඛීරවණ්ණඤ්ච දකවණ්ණඤ්ච -පෙ- ඛීරවණ්ණඤ්ච තෙලවණ්ණඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. නීලකඤ්ච, බුජමු"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "31. ලේවන් ද සුදුවන් ද සිතයි නම්, වෑයම් කරයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. ලෙහෙවන් ද මෝරුවන් ද ... ලෙහෙවන් ද දියවන් ද ... ලෙහෙවන් ද තෙල්වන් ද ... ලෙහෙවන් ද කිරිවන් ද ... ලෙහෙවන් ද දිහිවන් ද ... ලෙහෙවන් ද ගිතෙල්වන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "32. ලෙහෙවන් ද නිල්වන් ද ... ලෙහෙවන් ද කහවන් ද සිතයි නම්, වෑයම් කරයි නම්, මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. සුදුවන් ද මෝරුවන් ද ... සුදුවන් ද දියවන් ද ... සුදුවන් ද තෙල්වන් ද ... සුදුවන් ද කිරිවන් ද ... සුදුවන් ද දීවන් ද ... සුදුවන් ද ගිතෙල්වන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. සුදුවන් ද නිල්වන් ද ... සුදුවන් ද කහවන් ද ... සුදුවන් ද ලෙහෙවන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "33. මෝරුවන් ද දියවන් ද ... මෝරුවන් ද තෙල්වන් ද ... මෝරුවන් ද කිරිවන් ද ... මෝරුවන් ද දීවන් ද ... මෝරුවන් ද ගිතෙල්වන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. මෝරුවන් ද නිල්වන් ද ... මෝරුවන් ද කහවන් ද ... මෝරුවන් ද ලෙහෙවන් ද ... මෝරුවන් ද සුදුවන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "34. දියවන් ද තෙල්වන් ද ... දියවන් ද කිරිවන් ද ... දියවන් ද දීවන් ද ... දියවන් ද ගිතෙල්වන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. දියවන් ද නිල්වන් ද ... දියවන් ද කහවන් ද ... දියවන් ද ලෙහෙවන් ද ... දියවන් ද සුදුවන් ද ... දියවන් ද මෝරුවන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "35. තෙල්වන් ද කිරිවන් ද ... තෙල්වන් ද දීවන් ද ... තෙල්වන් ද ගිතෙල්වන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. තෙල්වන් ද නිල්වන් ද ... තෙල්වන් ද කහවන් ද ... තෙල්වන් ද ලෙහෙවන් ද ... තෙල්වන් ද සුදුවන් ද ... තෙල්වන් ද මෝරුවන් ද ... තෙල්වන් ද දියවන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "36. කිරිවන් ද දීවන් ද ... කිරිවන් ද ගිතෙල්වන් ද ... සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. කිරිවන් ද නිල්වන් ද ... කිරිවන් ද කහවන් ද ... කිරිවන් ද ලෙහෙවන් ද ... කිරිවන් ද සුදුවන් ද ... කිරිවන් ද මෝරුවන් ද ... කිරිවන් ද දියවන් ද ... කිරිවන් ද තෙල්වන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 274,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "37. දධිවණ්ණඤ්ච සප්පිවණ්ණඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. දධිවණ්ණඤ්ච නීලඤ්ච -පෙ- දධිවණ්ණඤ්ච පීතකඤ්ච -පෙ- දධිවණ්ණඤ්ච ලොහිතකඤ්ච -පෙ- දධිවණ්ණඤ්ච ඔදාතඤ්ච -පෙ- දධිවණ්ණඤ්ච තක්කවණ්ණඤ්ච -පෙ- දධිවණ්ණඤ්ච දකවණ්ණඤ්ච -පෙ- දධිවණ්ණඤ්ච තෙලවණ්ණඤ්ච -පෙ- දධිවණ්ණඤ්ච ඛීරවණ්ණඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "38. සප්පිවණ්ණං ච නීලං ච{1} චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. සප්පිවණ්ණඤ්ච පීතකඤ්ච -පෙ- සප්පිවණ්ණඤ්ච ලොහිතකඤ්ච -පෙ- සප්පිවණ්ණඤ්ච ඔදාතඤ්ච -පෙ- සප්පිවණ්ණඤ්ච තක්කවණ්ණඤ්ච -පෙ- සප්පිවණ්ණඤ්ච දකවණ්ණඤ්ච -පෙ- සප්පිවණ්ණඤ්ච තෙලවණ්ණඤ්ච -පෙ- සප්පිවණ්ණඤ්ච ඛීරවණ්ණඤ්ච -පෙ- සප්පිවණ්ණඤ්ච දධිවණ්ණඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "එකමූලකස්ස බද්ධචක්කං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "39. නීලඤ්ච පීතකඤ්ච ලොහිතකඤ්ච{2} චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. නීලඤ්ච පීතකඤ්ච ඔදාතඤ්ච{3} -පෙ- නීලඤ්ච පීතකඤ්ච සප්පිවණ්ණඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "දුමූලකස්ස ඛණ්ඩචක්කං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "40. පීතකඤ්ච ලොහිතකඤ්ච ඔදාතඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. -පෙ- පීතකඤ්ච ලොහිතකඤ්ච සප්පිවණ්ණඤ්ච -පෙ- පීතකඤ්ච ලොහිතකඤ්ච නීලඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "දුමූලකස්ස බද්ධචක්කං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "41. දධිවණ්ණඤ්ච සප්පිවණ්ණඤ්ච නීලඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. -පෙ- දධිවණ්ණඤ්ච සප්පිවණ්ණඤ්ච ඛීරවණ්ණඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "දුමූලකං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "42. තිමූලකම්පි චතුමූලකම්පි පඤ්චමූලකම්පි ඡමූලකම්පි සත්තමූලකම්පි අට්ඨමූලකම්පි නවමූලකම්පි එවමෙව විත්ථාරෙතබ්බං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සප්පිවණ්ණඤ්ච නීකඤ්ච, මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "2. ලොහිතඤ්ච, බුජමු"
                    },
                    {
                        "type": "footnote",
                        "text": "3. ඔදාතකඤ්ච, බුජමු"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "37. දිහිවන් ද ගිතෙල්වන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. දීවන් ද නිල්වන් ද ... දීවන් ද කහවන් ද ... දීවන් ද ලෙ‍හෙවන් ද ... දීවන් ද සුදුවන් ද ... දීවන් ද මෝරුවන් ද ... දීවන් ද දියවන් ද ... දීවන් ද තෙල්වන් ද ... දීවන් ද කිරිවන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "38. ගිතෙල්වන් ද නිල්වන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. ගිතෙල්වන් ද කහවන් ද ... ගිතෙල්වන් ද ලේවන් ද ... ගිතෙල්වන් ද සුදුවන් ද ... ගිතෙල්වන් ද මෝරුවන් ද ... ගිතෙල්වන් ද දියවන් ද ... ගිතෙල්වන් ද තෙල්වන් ද ... ගිතෙල්වන් ද කිරිවන් ද ... ගිතෙල්වන් ද දීවන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එකමූලක බද්ධචක්‍රය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "39. නිල්වන් ද කහවන් ද ලේවන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. නිල්වන් ද කහවන් ද සුදුවන් ද ... නිල්වන් ද ගිතෙල්වන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ද්විමූලක ඛණ්ඩචක්‍රය.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "40. කහවන් ද ලේවන් ද සුදුවන් ද සිතයි නම්, වෑයමක් කරයි නම්, මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. ... කහවන් ද ලේවන් ද ගිතෙල්වන් ද ... කහවන් ද ලේවන් ද නිල්වන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ද්විමූලක බද්ධචක්‍රය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "41. දිහිවන් ද ගිතෙල්වන් ද නිල්වන් ද සිතයි නම්, වෑයම් කරයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. දිහිවන් ද ගිතෙල්වන් ද කිරිවන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ද්විමූලකය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "42. තිමූලකය ද චතුමූලකය ද පඤ්චමූලකය ද ඡමූලකය ද සත්තමූලකය ද අට්ඨමූලකය ද නවමූලකය ද මෙසේ ම විස්තර කටයුතුයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 276,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "ඉදං සබ්බමූලකං:",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "43. නීලඤ්ච පීතකඤ්ච ලොහිතකඤ්ච ඔදාතඤ්ච තක්කවණ්ණඤ්ච දකවණ්ණඤ්ච තෙලවණ්ණඤ්ච ඛීරවණ්ණඤ්ච දධිවණ්ණඤ්ච සප්පිවණ්ණඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "සබ්බමූලකං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "44. ආරොග්යත්ථඤ්ච නීලඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. ආරොග්යත්ථඤ්ච සුඛත්ථඤ්ච නීලඤ්ච පීතකඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. ආරොග්යත්ථඤ්ච සුඛත්ථඤ්ච භෙසජ්ජත්ථඤ්ච නීලඤ්ච පීතකඤ්ච ලොහිතකඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. -පෙ- සප්පිවණ්ණං චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "උභතො වඩ්ඪකං එවමෙව වඩ්ඪෙතබ්බං.{1}",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "45. ආරොග්යත්ථඤ්ච සුඛත්ථඤ්ච භෙසජ්ජත්ථඤ්ච දානත්ථඤ්ච පුඤ්ඤත්ථඤ්ච යඤ්ඤත්ථඤ්ච සග්ගත්ථඤ්ච බීජත්ථඤ්ච වීමංසත්ථඤ්ච දවත්ථඤ්ච නීලඤ්ච පීතකඤ්ච ලොහිතකඤ්ච ඔදාතඤ්ච තක්කවණ්ණඤ්ච දකවණ්ණඤ්ච තෙලවණ්ණඤ්ච ඛීරවණ්ණඤ්ච දධිවණ්ණඤ්ච සප්පිවණ්ණඤ්ච චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "මිස්සකචක්කං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "46. නීලං මොචෙස්සාමීති චෙතෙති උපක්කමති, පීතකං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. නීලං මොචෙස්සාමීති චෙතෙති උපක්කමති ලොහිතකං -පෙ- ඔදාතං -පෙ- තක්කවණ්ණං -පෙ- දකවණ්ණං -පෙ- තෙලවණ්ණං -පෙ- ඛීරවණ්ණං -පෙ- දධිවණ්ණං -පෙ- සප්පිවණ්ණං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "ඛණ්ඩචක්කං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "47. පීතකං මොචෙස්සාමීති චෙතෙති උපක්කමති, ලොහිතකං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. පීතකං මොචෙස්සාමීති චෙතෙති උපක්කමති ඔදාතං -පෙ- තක්කවණ්ණං -පෙ- දකවණ්ණං -පෙ- තෙලවණ්ණං -පෙ- ඛීරවණ්ණං -පෙ- දධිවණ්ණං -පෙ- සප්පිවණ්ණං -පෙ- නීලං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "බද්ධචක්කං",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "මූලං සංඛිත්තං.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. වඩ්ඪෙතබ්බං. මජසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "මේ සබ්බමූලකය යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "43. නිල්වන් ද කහවන් ද ලේවන් ද සුදුවන් ද මෝරුවන් ද දියවන් ද තෙල්වන් ද කිරිවන් ද දීවන් ද ගිතෙල්වන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සබ්බමූලකය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "44. ආරෝග්‍යය පිණිස ද නිල්වන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. ආරෝග්‍යය පිණිස ද සුව පිණිස ද නිල්වන් ද කහවන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම් සඟවෙසෙස් ඇවැත් වේ. ආරෝග්‍යය පිණිස ද සුව පිණිස ද බෙහෙත් පිණිස ද නිල්වන් ද කහවන් ද ලේවන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. ... ගිතෙල්වන් සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "දෙපසින් වැඩෙන සේ මෙ පරිද්දෙන් පැමිණවිය යුතුයි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "45. ආරෝග්‍යය පිණිස ද සුව පිණිස ද බෙහෙත් පිණිස ද දන් පිණිස ද පින් පිණිස ද යාගය පිණිස ද සග පිණිස ද ගබ් පිණිස ද විමසුම් පිණිස ද කෙළි පිණිස ද නිල්වන් ද කහවන් ද ලේවන් ද සුදුවන් ද මෝරුවන් ද දියවන් ද තෙල්වන් ද කිරිවන් ද දිහිවන් ද ගිතෙල්වන් ද සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මිශ්‍රකචක්‍රය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "46. නිල්වන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, කහවන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. නිල්වන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, ලෙහෙවන් ... සුදුවන් ... මෝරුවන් ... දියවන් ... තෙල්වන් ... කිරිවන් ... දිහිවන් ... ගිතෙල්වන් මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඛණ්ඩචක්‍රය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "47. කහවන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, ලේවන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. කහවන් ... මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, සුදුවන් ... මෝරුවන් ... දියවන් ... තෙල්වන් ... කිරිවන් ... දිහිවන් ... ගිතෙල්වන් ... නිල්වන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "බද්ධචක්‍රයයි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "මූලය සංක්ෂිප්තයි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 278,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "48. සප්පිවණ්ණං මොචෙස්සාමීති චෙතෙති උපක්කමති, නීලං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. සප්පිවණ්ණං මොචෙස්සාමීති චෙතෙති උපක්කමති පීතකං -පෙ- ලොහිතකං -පෙ- ඔදාතං -පෙ- තක්කවණ්ණං -පෙ- දකවණ්ණං -පෙ- තෙලවණ්ණං -පෙ- ඛීරවණ්ණං -පෙ- දධිවණ්ණං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "කුච්ඡිචක්කං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "49. පීතකං මොචෙස්සාමීති චෙතෙති උපක්කමති, නීලං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. ලොහිතකං -පෙ- ඔදාතං -පෙ- තක්කවණ්ණං -පෙ- දකවණ්ණං -පෙ- තෙලවණ්ණං -පෙ- ඛීරවණ්ණං -පෙ- දධිවණ්ණං -පෙ- සප්පිවණ්ණං මොචෙස්සාමීති චෙතෙති උපක්කමති නීලං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "පිට්ඨිචක්කස්ස පඨමං ගමනං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "50. ලොහිතකං මොචෙස්සාමීති චෙතෙති උපක්කමති, පීතකං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. ඔදාතං -පෙ- තක්කවණ්ණං -පෙ- දකවණ්ණං -පෙ- තෙලවණ්ණං -පෙ- ඛීරවණ්ණං -පෙ- දධිවණ්ණං -පෙ- සප්පිවණ්ණං -පෙ- නීලං මොචෙස්සාමීති චෙතෙති උපක්කමති පීතකං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "පිට්ඨිචක්කස්ස දුතියං ගමනං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "51. ඔදාතං මොචෙස්සාමීති චෙතෙති උපක්කමති ලොහිතකං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. තක්කවණ්ණං -පෙ- දකවණ්ණං -පෙ- තෙලවණ්ණං -පෙ- ඛීරවණ්ණං -පෙ- දධිවණ්ණං -පෙ- සප්පිවණ්ණං -පෙ- නීලං -පෙ- පීතකං මොචෙස්සාමීති චෙතෙති උපක්කමති. ලොහිතකං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "පිට්ඨිචක්කස්ස තතියං ගමනං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "52. තක්කවණ්ණං මොචෙස්සාමීති චෙතෙති උපක්කමති ඔදාතං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. දකවණ්ණං -පෙ- තෙලවණ්ණං -පෙ- ඛීරවණ්ණං -පෙ- දධිවණ්ණං -පෙ- සප්පිවණ්ණං -පෙ- නීලං -පෙ- පීතකං -පෙ- ලොහිතකං මොචෙස්සාමීති චෙතෙති උපක්කමති, ඔදාතං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "පිට්ඨිචක්කස්ස චතුත්ථං ගමනං නිට්ඨිතං.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "48. ගිතෙල්වන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, නිල්වන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. ගිතෙල්වන් මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, කහවන් ... ලේවන් ... සුදුවන් ... මෝරුවන් ... දියවන් ... තෙල්වන් ... කිරිවන් ... දිහිවන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "කුච්ඡිචක්‍රය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "49. කහවන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, නිල්වන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. ලේවන් ... සුදුවන් ... මෝරුවන් ... දියවන් ... තෙල්වන් ... කිරිවන් ... දිහිවන් ... ගිතෙල්වන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, නිල්වන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පිට්ඨිචක්‍රය පිළිබඳ පළමුවන ගමන නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "50. ලේවන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, කහවන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. සුදුවන් ... මෝරුවන් ... දියවන් ... තෙල්වන් ... කිරිවන් ... දිහිවන් ... ගිතෙල්වන් ... නිල්වන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, කහවන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පිට්ඨිචක්‍රය පිළිබඳ දෙවන ගමන නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "51. සුදුවන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, ලේවන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. මෝරුවන් සුකුරු ... දියවන් ... තෙල්වන් ... කිරිවන් ... දිහිවන් ... ගිතෙල්වන් ... නිල්වන් ... කහවන් සුකුරු මුදන්නෙමි සිතයි නම්, වෑයම් කෙරෙයි නම්, ලේවන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පිට්ඨිචක්‍රය පිළිබඳ තෙවෙනි ගමන නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "52. මෝරුවන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, සුදුවන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. දියවන් ... තෙල්වන් ... කිරිවන් ... දිහිවන් ... ගිතෙල්වන් ... නිල්වන් ... කහවන් ... ලේවන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, සුදුවන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පිට්ඨිචක්‍රය පිළිබඳ සිවුවන ගමන නිමි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 280,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "53. දකවණ්ණං මොචෙස්සාමීති චෙතෙති උපක්කමති, තක්කවණ්ණං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. තෙලවණ්ණං -පෙ- ඛීරවණ්ණං -පෙ- දධිවණ්ණං -පෙ- සප්පිවණ්ණං -පෙ- නීලං -පෙ- පීතකං -පෙ- ලොහිතකං -පෙ- ඔදාතං මොචෙස්සාමීති චෙතෙති උපක්කමති තක්කවණ්ණං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "පිට්ඨිචක්කස්ස පඤ්චමං ගමනං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "54. තෙලවණ්ණං මොචෙස්සාමීති චෙතෙති උපක්කමති, දකවණ්ණං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. ඛීරවණ්ණං -පෙ- දධිවණ්ණං -පෙ- සප්පිවණ්ණං -පෙ- නීලං -පෙ- පීතකං -පෙ- ලොහිතකං -පෙ- ඔදාතං -පෙ- තක්කවණ්ණං මොචෙස්සාමීති චෙතෙති උපක්කමති දකවණ්ණං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "පිට්ඨිචක්කස්ස ඡට්ඨං ගමනං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "55. ඛීරවණ්ණං මොචෙස්සාමීති චෙතෙති උපක්කමති තෙලවණ්ණං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. දධිවණ්ණං -පෙ- සප්පිවණ්ණං -පෙ- නීලං -පෙ- පීතකං -පෙ- ලොහිතකං -පෙ- ඔදාතං -පෙ- තක්කවණ්ණං -පෙ- දකවණ්ණං මොචෙස්සාමීති චෙතෙති උපක්කමති තෙලවණ්ණං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "පිට්ඨිචක්කස්ස සත්තමං ගමනං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "56. දධිවණ්ණං මොචෙස්සාමීති චෙතෙති උපක්කමති ඛීරවණ්ණං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. සප්පිවණ්ණං -පෙ- නීලං -පෙ- පීතකං -පෙ- ලොහිතකං -පෙ- ඔදාතං -පෙ- තක්කවණ්ණං -පෙ- දකවණ්ණං -පෙ- තෙලවණ්ණං මොචෙස්සාමීති චෙතෙති උපක්කමති, ඛීරවණ්ණං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "පිට්ඨිචක්කස්ස අට්ඨමං ගමනං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "57. සප්පිවණ්ණං මොචෙස්සාමීති චෙතෙති උපක්කමති දධිවණ්ණං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. නීලං -පෙ- පීතකං -පෙ- ලොහිතකං -පෙ- ඔදාතං -පෙ- තක්කවණ්ණං -පෙ- දකවණ්ණං -පෙ- තෙලවණ්ණං -පෙ- ඛීරවණ්ණං මොචෙස්සාමීති චෙතෙති උපක්කමති දධිවණ්ණං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "පිට්ඨිචක්කස්ස නවමං ගමනං නිට්ඨිතං.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "53. දියවන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, මෝරුවන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. තෙල්වන් ... කිරිවන් ... දිහිවන් ... ගිතෙල්වන් ... නිල්වන් ... කහවන් ... ලේවන් ... සුදුවන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, මෝරුවන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පිට්ඨිචක්‍රය පිළිබඳ පස්වන ගමන නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "54. තෙල්වන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, දියවන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. කිරිවන් ... දිහිවන් ... ගිතෙල්වන් ... නිල්වන් ... කහවන් ... ලේවන් ... සුදුවන් ... මෝරුවන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, දියවන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පිට්ඨිචක්‍රය පිළිබඳ සවන ගමන නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "55. කිරිවන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, තෙල්වන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. දිහිවන් ... ගිතෙල්වන් ... නිල්වන් ... කහවන් ... ලේවන් ... සුදුවන් ...මොහොරුවන් ... දියවන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, තෙල්වන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පිට්ඨිචක්‍රය පිළිබඳ සත්වන ගමන නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "56. දිහිවන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, කිරිවන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. ගිතෙල්වන් ... නිල්වන් ... කහවන් ... ලේවන් ... සුදුවන් ... මෝරුවන් ... දියවන් ... තෙල්වන් ... සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, කිරිවන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පිට්ඨිචක්‍රය පිළිබඳ අටවන ගමන නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "57. ගිතෙල්වන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, දිහිවන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. නිල්වන් ... කහවන් ... ලේවන් ... සුදුවන් ... මෝරුවන් ... දියවන් ... තෙල්වන් ... කිරිවන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, දිහිවන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පිට්ඨිචක්‍රය පිළිබඳ නවවන ගමන නිමි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 282,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "58. නීලං මොචෙස්සාමීති චෙතෙති උපක්කමති, සප්පිවණ්ණං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස. පීතකං -පෙ- ලොහිතකං -පෙ- ඔදාතං -පෙ- තක්කවණ්ණං -පෙ- දකවණ්ණං -පෙ- තෙලවණ්ණං -පෙ- ඛීරවණ්ණං -පෙ- දධිවණ්ණං මොචෙස්සාමීති චෙතෙති උපක්කමති, සප්පිවණ්ණං මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "පිට්ඨිචක්කස්ස දසමං ගමනං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "පිට්ඨිචක්කං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "59.චෙතෙති උපක්කමති මුච්චති, ආපත්ති සඞ්ඝාදිසෙසස්ස;"
                    },
                    {
                        "type": "paragraph",
                        "text": "චෙතෙති උපක්කමති න මුච්චති, ආපත්ති ථුල්ලච්චයස්ස;"
                    },
                    {
                        "type": "paragraph",
                        "text": "චෙතෙති න උපක්කමති මුච්චති, අනාපත්ති;"
                    },
                    {
                        "type": "paragraph",
                        "text": "චෙතෙති න උපක්කමති න මුච්චති, අනාපත්ති;"
                    },
                    {
                        "type": "paragraph",
                        "text": "න චෙතෙති උපක්කමති මුච්චති, අනාපත්ති;"
                    },
                    {
                        "type": "paragraph",
                        "text": "න චෙතෙති උපක්කමති න මුච්චති, අනාපත්ති;"
                    },
                    {
                        "type": "paragraph",
                        "text": "න චෙතෙති න උපක්කමති මුච්චති, අනාපත්ති;"
                    },
                    {
                        "type": "paragraph",
                        "text": "න චෙතෙති න උපක්කමති න මුච්චති, අනාපත්ති;"
                    },
                    {
                        "type": "paragraph",
                        "text": "60. අනාපත්ති සුපිනන්තෙන, න මොචනාධිප්පායස්ස, උම්මත්තකස්ස, ඛිත්තචිත්තස්ස, වෙදනාට්ටස්ස, ආදිකම්මිකස්සාති."
                    },
                    {
                        "type": "heading",
                        "text": "විනීතවත්ථු.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**උද්දානගාථා.**"
                    },
                    {
                        "type": "gatha",
                        "text": "සුපිනො උච්චාරපස්සාවො , විතක්කුණ්හොදකෙන ච\nභෙසජ්ජං කණ්ඩුවං මග්ගො වත්ථිජන්තාඝරං ඌරු{1}.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "සාමණෙරො ච සුත්තො ච ඌරු මුට්ඨිනා පීළයි\nආකාසෙ ථම්භං නිජ්ඣායි ඡිද්දං කට්ඨෙන ඝට්ටයී.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "සොතෙ{2} උදඤ්ජලං ධාවං පුප්ඵාවලියපොක්ඛරං{3}\nවාලිකා කද්දමුස්සෙකො සයනඞ්ගුට්ඨකෙන චාති.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො සුපිනන්තෙන අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි.{4} කච්චි නු ඛො අහං සඞ්ඝාදිසෙසං ආපත්තිං ආපන්නො’ති? අථ ඛො සො භික්ඛු{5} භගවතො එතමත්ථං ආරොචෙසි -පෙ- “අනාපත්ති භික්ඛු සුපිනන්තෙනා”ති. (1)"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ජනතාඝරූපක්කමො මජසං, වත්ථිජන්තග්ගුපක්කමො හෙමු"
                    },
                    {
                        "type": "footnote",
                        "text": "2. සොතො මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "3. පුප්ඵාවලියං පොක්ඛරං මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "4. භගවතා සික්ඛාපදං පඤ්ඤත්තං. හෙමු"
                    },
                    {
                        "type": "footnote",
                        "text": "5. අථ ඛො සො භික්ඛු ඉති මඡසං නත්ථි"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "58. නිල්වන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, ගිතෙල්වන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ. කහවන් ... ලේවන් ... සුදුවන් ... මෝරුවන් ... දියවන් ... තෙල්වන් ... කිරිවන් ... දිහිවන් සුකුරු මුදන්නෙමි යි සිතයි නම්, වෑයම් කෙරෙයි නම්, ගිතෙල්වන් සුකුරු මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පිට්ඨිචක්‍රය පිළිබඳ දසවැනි ගමන නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "පිට්ඨිචක්‍රය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "59. සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදෙයි නම්, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සිතයි නම්, වෑයම් කෙරෙයි නම්, නො මිදේ නම්, ථුලැසිඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සිතයි නම්, වෑයම් නො කෙරෙයි නම්, මිදෙයි නම්, ඇවැත් නො වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සිතයි නම්, වෑයම් නො කෙරෙයි නම්, නො මිදේ නම්, ඇවැත් නො වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "නො සිතයි නම්, වෑයම් කෙරෙයි නම්, මිදේ නම්, ඇවැත් නො වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "නො සිතයි නම්, වෑයම් කෙරෙයි නම්, නො මිදේ නම්, ඇවැත් නො වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "නො සිතයි නම්, වෑයම් නො කෙරෙයි නම්, මිදෙයි නම්, ඇවැත් නො වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "නො සිතයි නම්, වෑයම් නො කෙරෙයි නම්, නො මිදේ නම්, ඇවැත් නො වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "60. සිහිනෙන් ද, නො මුදන අදහස් ඇත්තහුට ද, උමතුවූවහුට ද, වික්ෂිප්ත සිත් ඇත්තහුට ද, වේදනාවෙන් පෙළෙන්නහුට ද, ආදි කර්‍මමිකයාට ද ඇවැත් නො වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "විනිශ්චිත වස්තු",
                        "type": "heading",
                        "level": 1
                    },
                    {
                        "text": "උද්දානගාථා",
                        "type": "unindented"
                    },
                    {
                        "text": "සුපින, උච්චාර, පස්සාව, කාමවිතක්ක, උණ්හොදක, භෙසජ්ජ, කණ්ඩුව, මග්ග, වත්ථි, ජන්තාඝර, ඌරු යන වස්තුහු ද.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සාමණෙර, සුත්තසාමණෙර, ඌරු, මුට්ඨිපීළන, ආකාසකටිකම්පන,කායත්ථම්භ, උපනිජ්ඣාන, තාලච්ඡිද්ද, කට්ඨඝට්ටන, වස්තූහු ද.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පටිසොතනහායන, උදඤ්ජල, උදකධාවන, පුප්ඵාවලි, පොක්ඛරවන, වාලිකා, කද්දම, උස්සෙක, සයන, අඞ්ගුට්ඨික යන වස්තූහු දැ යි විනීත වස්තු සම සැත්තෑවකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "1. එසමයෙහි එක්තරා මහණකුට සිහිනෙන් සුකරු මිදිනි. කිම? මම සඟවෙසෙස් ඇවැතට අවන්නෙම් දෝයි ඒ මහණහට කුකුස් උපනි. ඉක්බිති ඒ මහණ භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේ ය. “මහණ, සිහිනෙන් ඇවැත් නො වේ” යි භාග්‍යවතුන් වහන්සේ වදාළසේක. (1)",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 284,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "2. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො උච්චාරං කරොන්තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- භගවතො එතමත්ථං ආරොචෙසි. “කිඤ්චිත්තො ත්වං භික්ඛූ”ති. “නාහං භගවා මොචනාධිප්පායො”ති. “අනාපත්ති භික්ඛු න මොචනාධිප්පායස්සා”ති. (2)"
                    },
                    {
                        "type": "paragraph",
                        "text": "3. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො පස්සාවං කරොන්තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු න මොචනාධිප්පායස්සා”ති. (3)"
                    },
                    {
                        "type": "paragraph",
                        "text": "4. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො කාමවිතක්කං විතක්කෙන්තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු විතක්කෙන්තස්සා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "5. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො උණ්හොදකෙන නහායන්තස්ස{1} අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “කිඤ්චිත්තො{2} ත්වං භික්ඛූ”ති. “නාහං භගවා මොචනාධිප්පායො”ති. “අනාපත්ති භික්ඛු න මොචනාධිප්පායස්සා”ති. (5)"
                    },
                    {
                        "type": "paragraph",
                        "text": "6. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස උණ්හොදකෙන නහායන්තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “ආපත්තිං ත්වං භික්ඛු ආපන්නො සඞ්ඝාදිසෙස”න්ති. (6)"
                    },
                    {
                        "type": "paragraph",
                        "text": "7. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස උණ්හොදකෙන නහායන්තස්ස අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස. ආපත්ති ථුල්ලච්චයස්සා”ති. (7)"
                    },
                    {
                        "type": "paragraph",
                        "text": "8. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො අඞ්ගජාතෙ වණො හොති, භෙසජ්ජෙන ආලිම්පෙන්තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු න මොචනාධිප්පායස්සා”ති. (8)"
                    },
                    {
                        "type": "paragraph",
                        "text": "9. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො අඞ්ගජාතෙ වණො හොති, {3}මොචනාධිප්පායස්ස භෙසජ්ජෙන ආලිම්පෙන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (9-10)"
                    },
                    {
                        "type": "paragraph",
                        "text": "10. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො අණ්ඩං කණ්ඩුවන්තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු න මොචනාධිප්පායස්සා”ති. (11)"
                    },
                    {
                        "type": "paragraph",
                        "text": "11. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස අණ්ඩං කණ්ඩුවන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (12-13)"
                    },
                    {
                        "type": "paragraph",
                        "text": "12. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මග්ගං ගච්ඡන්තස්ස අසුචි මුච්චි . තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු න මොචනාධිප්පායස්සා”ති. (14)"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. න්හායන්තස්ස මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "2. කිං චිත්තො මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "3. තස්ස මොචනාධිප්පායස්ස ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "2. එසමයෙහි එක්තරා මල පහ කරණ මහණකුට සුකුරු මිදිනි. ඒ මහණහට කුකුස් උපනි. ... භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේ ය. “මහණ, තෝ කෙබඳු සිතැති වූයෙහිදැ”යි භාග්‍යවතුන් වහන්සේ අසා වදාළසේක. “භාග්‍යවතුන් වහන්ස, මම නො මුදන රිසිවීමි”යි හේ කීය. “මහණ, නො මුදන රිසියහුට ඇවැත් නො වේ”ය යි භාග්‍යවතුන් වහන්සේ වදාළ සේක. (2)",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. එසමයෙහි සුළුවටන් කරණ, එක්තරා මහණකුට සුකුරු මිදිනි. ඔහුට කුකුස් උපනි ... “මහණ, නො මුදන රිසියහුට ඇවැත් නො වේ”ය යි වදාළ සේක. (3)",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. එසමයෙහි කාමවතර්‍ක උපදවන එක්තරා මහණකුට සුකුරු මිදිනි. ඔහුට කුකුස් උපනි ... “මහණ, විතර්‍කණය කරන්නහුට ඇවැත් නො වේ”ය යි වදාළ සේක. (4)",
                        "type": "paragraph"
                    },
                    {
                        "text": "5. එසමයෙහි උණුදිය නාන එක්තරා මහණකුට සුකුරු මිදිනි. ඔහුට කුකුස් උපනි ... “මහණ, තෝ කුමන සිතැති වූයෙහි දැ”යි අසා වදාළසේක. “භාග්‍යවතුන් වහන්ස, මම් මුදන රිසියෙම් නො වීමි” යි හේ කීය. “මහණ, මුදනු නො රිසියහුට ඇවැත් නො වේ”. (5)",
                        "type": "paragraph"
                    },
                    {
                        "text": "6. එසමයෙහි මුදන රිසියැති උණුදිය නාන එක්තරා මහණකුට සුකුරු මිදිනි. ඔහුට කුකුස් උපනි ... “මහණ, තෝ සඟවෙසෙස් ඇවැත් අවන්නෙහි ය යි” වදාළසේක. (6)",
                        "type": "paragraph"
                    },
                    {
                        "text": "7. එසමයෙහි මුදන රිසියැති උණුදිය නාන එක්තරා මහණකුට සුකුරු නො මිදිනි. ඔහුට කුකුස් උපනි. ... “මහණ, සඟවෙසෙස් ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”ය යි වදාළසේක. (7)",
                        "type": "paragraph"
                    },
                    {
                        "text": "8. එසමයෙහි එක්තරා මහණකුගේ රහසඟෙහි වණයෙක් වෙයි. බෙහෙත් ආලේප කරණ ඒ මහණහට සුකුරු මිදිනි. ඔහුට කුකුස් උපනි. ... “මහණ, නො මුදන රිසියහුට ඇවැත් නො වේ”යි වදාළසේක. (8)",
                        "type": "paragraph"
                    },
                    {
                        "text": "9. එසමයෙහි එක්තරා මහණකුගේ රහසඟ වණයක් වෙයි. මුදන රිසි ඇති බෙහෙදින් අලෙවු දෙන්නහුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කුකුස් උපනි ... “මහණ, සඟවෙසෙස් ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”ය යි වදාළසේක. (9-10)",
                        "type": "paragraph"
                    },
                    {
                        "text": "10. එසමයෙහි අණ්ඩය කසන්නා වූ එක්තරා මහණකුට සුකුරු මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, නුමුදන රිසියහුට ඇවැත් නො වේ”යි වදාළසේක. (11)",
                        "type": "paragraph"
                    },
                    {
                        "text": "11. එසමයෙහි මුදන අදහස ඇති අණ්ඩය කසන එක්තරා මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කුකුසෙක් විය. ... “මහණ, සඟවෙසෙස් ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළසේක. (12-13)",
                        "type": "paragraph"
                    },
                    {
                        "text": "12. එසමයෙහි මග යන එක්තරා මහණකුට සුකුරු මිදිනි. ඔහුට කුකුස් උපනි. “මහණ, මුදන නො රිසියහුට ඇවැත් නො වේ”යි වදාළසේක. (14)",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 286,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "13. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස මග්ගං ගච්ඡන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති, භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (15-16)"
                    },
                    {
                        "type": "paragraph",
                        "text": "14. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො වත්ථිං ගහෙත්වා පස්සාවං කරොන්තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු න මොචනාධිප්පායස්සා”ති. (17)"
                    },
                    {
                        "type": "paragraph",
                        "text": "15. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස වත්ථිං ගහෙත්වා පස්සාවං කරොන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (18-19)"
                    },
                    {
                        "type": "paragraph",
                        "text": "16. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො ජන්තාඝරෙ උදරවට්ටිං තාපෙන්තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු න මොචනාධිප්පායස්සා”ති. (20)"
                    },
                    {
                        "type": "paragraph",
                        "text": "17. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස ජන්තාඝරෙ උදරවට්ටිං තාපෙන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (21-22)"
                    },
                    {
                        "type": "paragraph",
                        "text": "18. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො ජන්තාඝරෙ උපජ්ඣායස්ස පිට්ඨිපරිකම්මං කරොන්තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු න මොචනාධිප්පායස්සා”ති. (23)"
                    },
                    {
                        "type": "paragraph",
                        "text": "19. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස ජන්තාඝරෙ උපජ්ඣායස්ස පිට්ඨිපරිකම්මං කරොන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (24-25)"
                    },
                    {
                        "type": "paragraph",
                        "text": "20. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො ඌරුං ඝට්ටාපෙන්තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු න මොචනාධිප්පායස්සා”ති. (26)"
                    },
                    {
                        "type": "paragraph",
                        "text": "21. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස ඌරුං ඝට්ටාපෙන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (27-28)"
                    },
                    {
                        "type": "paragraph",
                        "text": "22. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු මොචනාධිප්පායො අඤ්ඤතරං සාමණෙරං එතදවොච: “එහි මෙ ත්වං ආවුසො සාමණෙර අඞ්ගජාතං ගණ්හාහී”ති. සො තස්ස අඞ්ගජාතං අග්ගහෙසි, තස්සෙව{1} අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “ආපත්තිං ත්වං භික්ඛු ආපන්නො සඞ්ඝාදිසෙස”න්ති. (29)"
                    },
                    {
                        "type": "paragraph",
                        "text": "23. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු සුත්තස්ස සාමණෙරස්ස අඞ්ගජාතං අග්ගහෙසි, තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති දුක්කටස්සා”ති. (30)"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. තස්සෙව මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "13. එසමයෙහි මුදන රිසි ඇති මග යන එක්තරා මහණකුට සුකුරු මිදිනි ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළසේක. (15-16)",
                        "type": "paragraph"
                    },
                    {
                        "text": "14. එසමයෙහි රහසඟ ගෙණ සුළුවටන් කරණ එක්තරා මහණකුට සුකුරු මිදිනි. ඔහුට කුකුස් විය. ...“මහණ, නො මුදන රිසියහුට ඇවැත්නොවේ”යි වදාළ සේක. (17)",
                        "type": "paragraph"
                    },
                    {
                        "text": "15. එසමයෙහි මුදන රිසි ඇතිවැ රහසඟ ගෙන සුළුවටන් කරණ එක්තරා මහණකුට සුකුරු මිදින. ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස් ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළ සේක. (18-19)",
                        "type": "paragraph"
                    },
                    {
                        "text": "16. එසමයෙහි ගිනිහල්ගෙහි උදරය තවන එක්තරා මහණකුට සුකුරු මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, නො මුදන රිසියහුට ඇවැත් නො වේ”යි වදාළසේක. (20)",
                        "type": "paragraph"
                    },
                    {
                        "text": "17. එසමයෙහි ගිනිහල්ගෙහි උදරය තවන මුදින රිසි එක්තරා මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස් ඇවැත් නො වේ. ථුලැසි ඇවැත් වේ”යි වදාළ සේක. (21-22)",
                        "type": "paragraph"
                    },
                    {
                        "text": "18. එසමයෙහි ගිනිහල්ගෙහි උවදෑ තෙරුන්ගේ පිට පිරිමදින එක්තරා මහණකුට සුකුරු මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, නො මුදන රිසියහුට ඇවැත් නො වේ”. (23)",
                        "type": "paragraph"
                    },
                    {
                        "text": "19. එසමයෙහි මුදන රිසි ඇති ගිනිහල්ගෙහි උවදෑ තෙරුන්ගේ පිට පිරිමදින එක්තරා මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. “මහණ, සඟවෙසෙස් ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළ සේක. (24-25)",
                        "type": "paragraph"
                    },
                    {
                        "text": "20. එසමයෙහි එක්තරා මහණකු දෙවටොර ගටද්දී සුකුරු මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, මුදන රිසි නැත්තහුට ඇවැත් නො වේ”යි වදාළ සේක. (26)",
                        "type": "paragraph"
                    },
                    {
                        "text": "21. එසමයෙහි මිදියැටි ව වටොර ගටන මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස් ඇවැත් නො වේ. ථුලැසිඇවැත් වේ.” (27-28)",
                        "type": "paragraph"
                    },
                    {
                        "text": "22. එසමයෙහි එක්තරා මහණෙක් සුකුරු මිදියැටි ව එක්තරා හෙරණකුට “ඇවැත් හෙරණ, එව තෝ මගේ රහසඟ ගණුව”යි කී ය. හේ ඔහුගේ රහසඟ ගති. ඔහුට සුකුරු මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, තෝ සඟවෙසෙස් ඇවැත් අවන්නෙහි”ය යි බුදුහු වදාළහ. (29)",
                        "type": "paragraph"
                    },
                    {
                        "text": "23. එසමයෙහි එක්තරා මහණෙක් නිදි ගත් හෙරණකුගේ රහසඟ ගත. ඔහුට සුකුරු මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස් ඇවැත් නො වේ. දුකුළාඇවැත් වේ”යි බුදුහු වදාළහ. (30)",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 288,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "24. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස ඌරූහි අඞ්ගජාතං පීළෙන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ-“අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (31-32)"
                    },
                    {
                        "type": "paragraph",
                        "text": "25. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස මුට්ඨිනා අඞ්ගජාතං පීළෙන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (33-34)"
                    },
                    {
                        "type": "paragraph",
                        "text": "26. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස ආකාසෙ කටිං කම්පෙන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (35-36)"
                    },
                    {
                        "type": "paragraph",
                        "text": "27. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො කායං ථම්භෙන්තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු න මොචනාධිප්පායස්සා”ති. (37)"
                    },
                    {
                        "type": "paragraph",
                        "text": "28. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස කායං ථම්භෙන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (38-39)"
                    },
                    {
                        "type": "paragraph",
                        "text": "29. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු සාරත්තො මාතුගාමස්ස අඞ්ගජාතං උපනිජ්ඣායි. තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස. න ච භික්ඛවෙ සාරත්තෙන මාතුගාමස්ස අඞ්ගජාතං උපනිජ්ඣායිතබ්බං, යො උපනිජ්ඣායෙය්ය, ආපත්ති දුක්කටස්සා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "30. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස තාලච්ඡිද්දං{1} අඞ්ගජාතං පවෙසෙන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (41-42)"
                    },
                    {
                        "type": "paragraph",
                        "text": "31. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස කට්ඨෙන අඞ්ගජාතං ඝට්ටෙන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (43-44)"
                    },
                    {
                        "type": "paragraph",
                        "text": "32. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො පටිසොතෙ නහායන්තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- අනාපත්ති භික්ඛු න මොචනාධිප්පායස්සා”ති. (45)"
                    },
                    {
                        "type": "paragraph",
                        "text": "33. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස පටිසොතෙ නහායන්තස්ස{2} අසුචි මුච්චි…පෙ.… අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (46-47)"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. තාළච්ඡිද්දං මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "2. න්හායන්තස්ස. සී.මු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "24. එසමයෙහි මිදියැටි ව රහසඟ වටොරින් පෙළන එක්තරා මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි බුදුහු වදාළහ. (31-32)",
                        "type": "paragraph"
                    },
                    {
                        "text": "25. එසමයෙහි රහසඟ මිටින් පෙළන එක්තරා මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළහ. (33-34)",
                        "type": "paragraph"
                    },
                    {
                        "text": "26. එසමයෙහි අහසෙහි කටිකම්පනය කරණ මිදියැටි වූ එක්තරා මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළහ. (36-36)",
                        "type": "paragraph"
                    },
                    {
                        "text": "27. එසමයෙහි කය වජඹන එක්තරා මහණකුට සුකුරු මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, නොමුදන රිසි ඇතියහුට ඇවැත් නො වේ”යි වදාළහ. (37)",
                        "type": "paragraph"
                    },
                    {
                        "text": "28. එසමයෙහි කය තද කරණ මිදියැටි වූ එක්තරා මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළහ. (38-39)",
                        "type": "paragraph"
                    },
                    {
                        "text": "29. එසමයෙහි එක්තරා මහණෙක් සංරක්ත වූයේ මාගමකගේ අඞ්ගජාතය සිත එළවා බැලී ය. ඔහුට සුකුරු මිදිනි. ඔහුට කුකුස් විය. “මහණ, සඟවෙසෙස් ඇවැත් නො වේ. මහණහු විසින් සංරක්ත ව මාගමකගේ අඞ්ගජාතය නො බැලිය යුතු යි. යමෙක් බලන්නේ නම් දුකුළාඇවැත් වේ”යි වදාළහ. (40)",
                        "type": "paragraph"
                    },
                    {
                        "text": "30. එසමයෙහි මිදියැටි ව කෙසිසිදුරක අඞ්ගජාතය මෙහෙයන මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළහ. (41-42)",
                        "type": "paragraph"
                    },
                    {
                        "text": "31. එසමයෙහි මිදියැටි ව දඬුයෙකින් රහසඟ ගටන මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළහ. (43-44)",
                        "type": "paragraph"
                    },
                    {
                        "text": "32. එසමයෙහි උඩුහොය බලා නාන මහණකුට සුකුරු මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, මුදන රිසි නැත්තහුට ඇවැත් නො වේ”යි වදාළහ. (45)",
                        "type": "paragraph"
                    },
                    {
                        "text": "33. එසමයෙහි උඩුහොය බලා නාන මිදියැටි වූ මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස් ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළහ. (46-47)",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 290,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "34. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො උදඤ්ජලං කීළන්තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු න මොචනාධිප්පායස්සා”ති. (48)"
                    },
                    {
                        "type": "paragraph",
                        "text": "35. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස උදඤ්ජලං කීළන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (49-50)"
                    },
                    {
                        "type": "paragraph",
                        "text": "36. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො උදකෙ ධාවන්තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු න මොචනාධිප්පායස්සා”ති. (51)"
                    },
                    {
                        "type": "paragraph",
                        "text": "37. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස උදකෙ ධාවන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (52-53)"
                    },
                    {
                        "type": "paragraph",
                        "text": "38. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො පුප්ඵාවලියං කීළන්තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු න මොචනාධිප්පායස්සා”ති. (54)"
                    },
                    {
                        "type": "paragraph",
                        "text": "39. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස පුප්ඵාවලියං කීළන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (55-56)"
                    },
                    {
                        "type": "paragraph",
                        "text": "40. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො පොක්ඛරවනෙ ධාවන්තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු න මොචනාධිප්පායස්සා”ති. (57)"
                    },
                    {
                        "type": "paragraph",
                        "text": "41. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස පොක්ඛරවනෙ ධාවන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (58-59)"
                    },
                    {
                        "type": "paragraph",
                        "text": "42. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස වාලිකං අඞ්ගජාතං පවෙසෙන්තස්ස{1} අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (60-61)"
                    },
                    {
                        "type": "paragraph",
                        "text": "43. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස කද්දමං අඞ්ගජාතං පවෙසෙන්තස්ස{2} අසුචි මුච්චි -පෙ- අසුචි න මුච්චි . තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (62-63)"
                    },
                    {
                        "type": "paragraph",
                        "text": "44. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො න මොචනාධිප්පායස්ස උදකෙන අඞ්ගජාතං ඔසිඤ්චන්තස්ස අසුචි මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු න මොචනාධිප්පායස්සා”ති. (64)"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පවෙසන්තස්ස - සී.මු."
                    },
                    {
                        "type": "footnote",
                        "text": "2. පවෙසන්තස්ස - සී.මු."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "34. එසමයෙහි මඩදියෙහි ක්‍රීඩා කරණ මහණකුට සුකුරු මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, මුදන රිසි නැතියහුට ඇවැත් නො වේ”යි වදාළහ. (48)",
                        "type": "paragraph"
                    },
                    {
                        "text": "35. එසමයෙහි මඩදියෙහි ක්‍රීඩා කරණ මිදියැටි මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළහ. (49-50)",
                        "type": "paragraph"
                    },
                    {
                        "text": "36. එසමයෙහි දියෙහි දුවන මහණකුට සුකුරු මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, මුදන රිසි නැත්තහුට ඇවැත් නො වේ”යි වදාළහ. (51)",
                        "type": "paragraph"
                    },
                    {
                        "text": "37. එසමයෙහි දියෙහි දුවන මිදියැටි මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළහ. (52-53)",
                        "type": "paragraph"
                    },
                    {
                        "text": "38. එසමයෙහි පුෂ්පාවලී ක්‍රීඩාව{1} කරණ මහණකුට සුකුරු මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, නොමුදන රිසි ඇතියහුට ඇවැත් නො වේ” වදාළහ. (54)",
                        "type": "paragraph"
                    },
                    {
                        "text": "39. එසමයෙහි පුෂ්පාවලී* ක්‍රීඩාව කරණ මිදියැටි එක්තරා මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළහ. (55-56)",
                        "type": "paragraph"
                    },
                    {
                        "text": "40. එසමයෙහි පියුමිළුයෙහි දුවන මහණකුට සුකුරු මිදිනි. ... ඔහුට කුකුස් විය. ... “මහණ, මුදන රිසි නැත්තහුට ඇවැත් නො වේ”යි වදාළහ. (57)",
                        "type": "paragraph"
                    },
                    {
                        "text": "41. එසමයෙහි පියුමිළුයෙහි දුවන මිදියැටි මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කකුස් විය. ... “මහණ, සඟවෙසෙස් ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළහ. (58-59)",
                        "type": "paragraph"
                    },
                    {
                        "text": "42. එසමයෙහි වැල්ලෙහි රහසඟ මෙහෙයන මිදියැටි එක්තරා මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළහ. (60-61)",
                        "type": "paragraph"
                    },
                    {
                        "text": "43. එසමයෙහි කලලෙහි සිය හදන් මෙහෙයන මිදියැටි එක්තරා මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළහ. (62-63)",
                        "type": "paragraph"
                    },
                    {
                        "text": "44. එසමයෙහි දියෙන් හදන් තෙමන නොමිදියැටි මහණකුට සුකුරු මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, නොමුදන රිසි ඇතියහුට ඇවැත් නො වේ”යි වදාළහ. (64)",
                        "type": "paragraph"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1 ගංහෝවල ඉවුරු බිඳි තැන් දිය දැමීමෙන් දැඩි සේ මඩ කොට එහි මුණින් හිඳ පා දිකු කොට ලිස්සලිස්සා දියට බැසීම."
                    }
                ]
            }
        },
        {
            "pageNum": 292,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "45. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස උදකෙන අඞ්ගජාතං ඔසිඤ්චන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (65-66)"
                    },
                    {
                        "type": "paragraph",
                        "text": "46. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස සයනෙ අඞ්ගජාතං ඝට්ටෙන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (67-68)"
                    },
                    {
                        "type": "paragraph",
                        "text": "47. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භික්ඛුනො මොචනාධිප්පායස්ස අඞ්ගුට්ඨෙන අඞ්ගජාතං ඝට්ටෙන්තස්ස අසුචි මුච්චි -පෙ- අසුචි න මුච්චි. තස්ස කුක්කුච්චං අහොසි: ‘කච්චි නු ඛො අහං සඞ්ඝාදිසෙසං ආපත්තිං ආපන්නො”ති? භගවතො එතමත්ථං ආරොචෙසි. -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති."
                    },
                    {
                        "type": "centered",
                        "text": "සුක්කවිස්සට්ඨිසික්ඛාපදං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "3. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කායසංසග්ගසික්ඛාපදං",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "1. තෙන සමයෙන බුද්ධො භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තෙන ඛො පන සමයෙන ආයස්මා **උදායී** අරඤ්ඤෙ විහරති. තස්සායස්මතො විහාරො අභිරූපො හොති දස්සනීයො පාසාදිකො, මජ්ඣෙ ගබ්භො සමන්තා පරියාගාරො, සුපඤ්ඤත්තං මඤ්චපීඨං භිසිබිම්බොහනං, පානීයං පරිභොජනීයං සූපට්ඨිතං, පරිවෙණං සුසම්මට්ඨං. බහූ මනුස්සා ආයස්මතො උදායිස්ස විහාරපෙක්ඛකා ආගච්ඡන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. අඤ්ඤතරො’පි බ්රාහ්මණො සපජාපතිකො යෙනායස්මා **උදායී** තෙනුපසඞ්කමි; උපසඞ්කමිත්වා ආයස්මන්තං උදායිං එතදවොච: “ඉච්ඡාම මයං භොතො උදායිස්ස විහාරං පෙක්ඛිතු”න්ති. “තෙන හි බ්රාහ්මණ පෙක්ඛස්සූ”ති අවාපුරණං ආදාය ඝටිකං උග්ඝාටෙත්වා කවාටං පණාමෙත්වා විහාරං පාවිසි. සො’පි ඛො බ්රාහ්මණො ආයස්මතො උදායිස්ස පිට්ඨිතො පාවිසි. සාපි ඛො බ්රාහ්මණී තස්ස බ්රාහ්මණස්ස පිට්ඨිතො පාවිසි. අථ ඛො ආයස්මා උදායී එකච්චෙ වාතපානෙ විවරන්තො එකච්චෙ වාතපානෙ ථකෙන්තො ගබ්භං අනුපරිගන්ත්වා පිට්ඨිතො ආගන්ත්වා තස්සා බ්රාහ්මණියා අඞ්ගමඞ්ගානි පරාමසි. අථ ඛො සො බ්රාහ්මණො ආයස්මතා උදායිනා සද්ධිං පටිසම්මොදිත්වා අගමාසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. අථ ඛො සො බ්රාහ්මණො අත්තමනො අත්තමනවාචං නිච්ඡාරෙසි: “උළාරා ඉමෙ සමණා සක්යපුත්තියා යෙ ඉමෙ එවරූපෙ අරඤ්ඤෙ විහරන්ති. භවම්පි උදායී උළාරො යො එවරූපෙ අරඤ්ඤෙ විහරතී”ති. එවං වුත්තෙ සා බ්රාහ්මණී තං බ්රාහ්මණං එතදවොච: “කුතො තස්ස උළාරතා{1}? යථෙව මෙ ත්වං අඞ්ගමඞ්ගානි පරාමසි. එවමෙව මෙ සමණො උදායී අඞ්ගමඞ්ගානි පරාමසී”ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උළාරත්තතා. මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "45. එසමයෙහි දියෙන් හදන් තෙමන මිදියැටි මහණකුට සුකුරු මිදිනි ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළහ. (65-66)",
                        "type": "paragraph"
                    },
                    {
                        "text": "46. එසමයෙහි මිදියැටි ව යහන්හි හදන් ගටන එක්තරා මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට කුකුස් විය. “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළහ. (67-68)",
                        "type": "paragraph"
                    },
                    {
                        "text": "47. එසමයෙහි මාපටැඟිල්ලෙන් රහසඟ ගටන මිදියැටි එක්තරා මහණකුට සුකුරු මිදිනි. ... සුකුරු නො මිදිනි. ඔහුට “කිම, මම සඟවෙසෙස්ඇවැත් අවන්නෙම්දෝ?”යි කුකුස් විය. භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේ ය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි බුදුහු වදාළහ. (69-70)",
                        "type": "paragraph"
                    },
                    {
                        "text": "සුක්කවිසට්ඨි ශික්ෂාපදය.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "type": "centered",
                        "text": "3. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කායසංසර්ගශික්‍ෂාපදය",
                        "level": 2
                    },
                    {
                        "text": "1. එසමයෙහි භාග්‍යවත් බුදුරජානන් වහන්සේ සැවැත්නුවර ජේතවනයෙහි අනේපිඬු සිටුහුගේ අරම්හි වැඩ වෙසෙති. එකල්හි ආයුෂ්මත් උදායි තෙමේ අරණෙහි වෙසෙයි. ඒ ආයුෂ්මත්හුගේ අරම මනහර දැකුම් ඇත්තෙකි. ප්‍රසාද එළවන්නෙකි. මැද ගබ හාත් පස මණ්ඩලමාලයෙන් පිරිකෙවු කරණ ලද්දේ ය. එහි ඇඳ පුටු බිසි බ්ම්බොහොන මනා කොට පණවන ලද්දේ ය. පියයුතු පිරිබෝ කටයුතු ජලය එළවන ලද්දේ ය. මිදුල මනා කොට හමදින ලද්දේ ය. බොහෝ මිනිස්සු උදායිහුගේ විහාරය බලනු කැමැත්තෝ එහි පැමිණෙති.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. බිරිඳ සහිත වූ එක්තරා බමුණෙක් ආයුෂ්මත් උදායි වෙත පැමිණියේය. පැමිණ ආයුෂ්මත් උදායීහට, “අපි වනාහි භවත් උදායිහුගේ විහාරය දක්නට කැමැත්තෙමු”යි කී ය. ආයුෂ්මත් උදායි තෙමේ “එසේ නම් බමුණ බලව”යි යතුර ගෙණ අගුල හැර, කවුළු හැර, විහාරයට පැමිණියේ ය. ඒ බමුණු තෙමේ ද ආයුෂ්මත් උදායිහුගේ පිටු පසින් පැමිණියේ ය. බැමිණිය ද බමුණා ගේ පිටු පසින් ගියා ය. ඉක්බිති ආයුෂ්මත් උදායි තෙමේ ඇතැම් වාකවුළු හරිනුයේ, ඇතැම් වාකවුළු වසනුයේ, ගැබ හාත්පසින් ගමන් කොට පිටුපසින් අවුත් ඒ බැමිණියගේ සිරුරෙහි අවයවයන් පරාමර්‍ශනය කෙළේ ය. ඉක්බිති ඒ බමුණු තෙමේ ආයුෂ්මත් උදායි හා බෙහෙවින් සතුටු වී ගියේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. වැලිදු ඒ බමුණු තෙමේ සතුටු වූයේ, “යම් මේ මහණ කෙනෙක් මෙබඳු අරම්හි වෙසෙද්ද, ඒ මේ ශ්‍රමණ වූ ශාක්‍යපුත්‍රීයයෝ උදාරයහ. යමෙක් මෙබඳු අරණෙක වෙසේ ද, ඒ භවත් උදායි තෙමේ ද උදාර යැ”යි සතුට හඟවන වචන ද පැවැසී ය. මෙසේ කී කල්හි ඒ බැමිණි තොමෝ, “ඔහුගේ උදාර බවෙක් කොයින් ද? යම් සේ තෙපි මගේ අඟපසඟ පරාමර්‍ශනය කළහු නම් එ මෙන් ම ඒ උදායී මහණ තෙමේ ද මගේ ශරීරාවයව පරාමර්‍ශනය කෙළේ” යයි බමුණුට කීවා ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 294,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "4. අථ ඛො සො බ්රාහ්මණො උජ්ඣායති ඛීයති විපාචෙති: “අලජ්ජිනො ඉමෙ සමණා සක්යපුත්තියා දුස්සීලා මුසාවාදිනො. ඉමෙහි නාම ධම්මචාරිනො සමචාරිනො බ්රහ්මචාරිනො සච්චවාදිනො සීලවන්තො කල්යාණධම්මා පටිජානිස්සන්ති. නත්ථි ඉමෙසං සාමඤ්ඤං, නත්ථි ඉමෙසං බ්රහ්මඤ්ඤං, නට්ඨං ඉමෙසං සාමඤ්ඤං, නට්ඨං ඉමෙසං බ්රහ්මඤ්ඤං, කුතො ඉමෙසං සාමඤ්ඤං කුතො ඉමෙසං බ්රහ්මඤ්ඤං, අපගතා ඉමෙ සාමඤ්ඤා, අපගතා ඉමෙ බ්රහ්මඤ්ඤා. කථං හි නාම සමණො උදායී මම භරියාය අඞ්ගමඞ්ගානි පරාමසිස්සති. නහි සක්කා කුලිත්ථීහි කුලධීතාහි කුලකුමාරීහි කුලසුණ්හාහි කුලදාසීහි ආරාමං වා විහාරං වා ගන්තුං. සචෙ{1} කුලිත්ථියො කුලධීතයො{2} කුලකුමාරියො කුලසුණ්හායො කුලදාසියො ආරාමං වා විහාරං වා ගච්ඡෙය්යුං, තාපි සමණා සක්යපුත්තියා දූසෙය්යු”න්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "5. අස්සොසුං ඛො භික්ඛූ තස්ස බ්රාහ්මණස්ස උජ්ඣායන්තස්ස ඛීයන්තස්ස විපාචෙන්තස්ස යෙ තෙ භික්ඛූ අප්පිච්ඡා -පෙ- තෙ උජ්ඣායන්ති ඛීයන්ති විපාචෙන්ති: “කථං හි නාම ආයස්මා උදායී මාතුගාමෙන සද්ධිං කායසංසග්ගං සමාපජ්ජිස්සතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "6. අථ ඛො තෙ භික්ඛූ{3} භගවතො එතමත්ථං ආරොචෙසුං. අථ ඛො භගවා එතස්මිං නිදානෙ එතස්මිං පකරණෙ භික්ඛුසඞ්ඝං සන්නිපාතාපෙත්වා ආයස්මන්තං උදායිං පටිපුච්ඡි: “සච්චං කිර ත්වං උදායි මාතුගාමෙන සද්ධිං කායසංසග්ගං සමාපජ්ජි”ති{4}. “සච්චං භගවා”ති. විගරහි බුද්ධො භගවා: “අනනුච්ඡවියං{5}, මොඝපුරිස අනනුලොමිකං අප්පතිරූපං අස්සාමණකං අකප්පියං අකරණීයං. කථං හි නාම ත්වං මොඝපුරිස මාතුගාමෙන සද්ධිං කායසංසග්ගං සමාපජ්ජිස්සසි. නනු මයා මොඝපුරිස අනෙකපරියායෙන විරාගාය ධම්මො දෙසිතො නො සරාගාය -පෙ- කාමපරිළාහානං වූපසමො අක්ඛාතො. නෙතං මොඝපුරිස අප්පසන්නානං වා පසාදාය -පෙ- එවඤ්ච පන භික්ඛවෙ ඉමං සික්ඛාපදං උද්දිසෙය්යාථ:"
                    },
                    {
                        "type": "paragraph",
                        "text": "**“යො පන භික්ඛු ඔතිණ්ණො විපරිණතෙන චිත්තෙන මාතුගාමෙන සද්ධිං කායසංසග්ගං සමාපජ්ජෙය්ය: හත්ථගාහං වා වෙණිගාහං{6} වා අඤ්ඤතරස්ස වා අඤ්ඤතරස්ස වා අඞ්ගස්ස පරාමසනං, සඞ්ඝාදිසෙසො”ති**."
                    },
                    {
                        "type": "paragraph",
                        "text": "**7. යො පනා**ති යො යාදිසො -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "**භික්ඛූ**ති -පෙ- අයං ඉමස්මිං අත්ථෙ අධිප්පෙතො භික්ඛූති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ඔතිණ්ණො** නාම: සාරත්තො අපෙක්ඛවා පටිබද්ධචිත්තො."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සචෙහි. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. කුලධීතරො. මඡසං, කුලධීතායො. සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අථ ඛො තෙ භික්ඛූ ආයස්මන්තං උදායිං අනෙකපරියායෙන විගරහිත්වා. මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "4. සමාපජ්ජසී’ති. මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "5. අනනුච්ඡවිකං. මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "6. හත්ථග්ගාහං වා වෙණිග්ගාහං. මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "4. ඉක්බිති ඒ බමුණු තෙමේ මෙසේ අවමන් කරයි, අයුණු කියයි, නුගුණ පතුරවයි: “මේ ශ්‍රමණ ශාක්‍යපුත්‍රීයයෝ අලජ්ජිහු ය, දුශ්ශීලයෝ ය, මුසාවාදීහු ය. මොහු නම් තුමූ ධම්මචාරීහු ය යි සමචාරීහු ය යි බ්‍රහ්මචාරීහු ය යි සත්‍යවාදීහුය යි සීලවන්තයෝය යි කල්‍යාණධර්‍ම ඇත්තෝය”යි පිළින කෙරෙත්. “මොවුන්ට මහණ කමෙක් නැත. මොවුන්ට බමුණු කමෙක් නැත. මොවුන්ගේ මහණකම නටුයේ ය. මොවුන්ගේ බමුණුකම නටුයේ ය. මොවුන්ට මහණකමෙක් කොයින් ද? මොවුන්ට බමුණු කමෙක් කොයින් ද? මොහු මහණකමින් පහ වූවෝ ය. මොහු බමුණුකමින් පහ වූවෝ ය. කෙසේ නම් උදායී මහණ තෙමේ මගේ බිරින්දගේ අඟපසඟ පිරිමැද්දේ ද? කුලඟනන් සමග කුලදූන් සමග කුලකුමරියන් සමග කුලලේළියන් සමග කුලදැසියන් සමග අරමකට හෝ වෙහෙරකට යෑමට නො හැකිය. ඉදින් කුලස්ත්‍රීහු කුලදුහිතෘහු කුලකුමාරීහු කුලලෙහෙළිහු කුලදාසීහු අරමකට හෝ වෙහෙරකට යන්නාහු නම් ශ්‍රමණ ශාක්‍යපුත්‍රීයයෝ ඔවුන් දූෂණය කරන්නාහු” යනුයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "5. අවමන් කරණ අයුණු කියන දොස් පතුරවන ඒ බමුණාගේ තෙපුල් භික්ෂූහු ඇසූහ. යම් ඒ අල්පේච්ඡ භික්ෂූහු වෙද්ද ඔහු “කෙසේ නම් ආයුෂ්මත් උදායී තෙමේ මාගමක හා කාසසඟට පැමිණියේදැ?”යි අවමන් කරත්. අයුණු කියත්. නුගුණ පතුරවත්.",
                        "type": "paragraph"
                    },
                    {
                        "text": "6. ඉක්බිති ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙපවත් සැළ කළහ. එවිට භාග්‍යවතුන් වහන්සේ මේ නිදානයෙහි මේ කාරණයෙහි භික්ෂුසඞ්ඝයා රැස් කරවා ආයුෂ්මත් උදායිගෙන් විචාළහ. “උදායී, තෝ මාගමක හා කාසසඟට පැමිණියෙහි ය යනු සැබෑ දැ”යි අසා වදාළ සේක. “සැබෑව, භාග්‍යවතුන් වහන්ස”යි ආයුෂ්මත් උදායී කීය. “හිස් පුරුෂය, නුසුදුසු ය. අනුලොම් නො වේ. යොග්‍ය නො වේ. මහණුන්ට නො සරුප් ය. නො කැප ය. මහණකු විසින් නොකට යුතු ය. “හිස් පුරුෂය, තෝ කෙසේ නම් මාගමක හා කාසසඟට සමවන්නෙහි ද? හිස් පුරුෂය, ඇලීම පිණිස නො ව නො ඇලීම පිණිස මා විසින් නන් අයුරින් දහම් දෙසන ලද්දේ නො වේ ද? ... කාමපරිදාහයන් සංසිඳවීම මා විසින් නොයෙක් අයුරින් කියන ලද්දේ නො වේ ද? “හිස් පුරුෂය, මෙය නො පහන්වූවන්ගේ පහන් බව පිණිස නො වන්නේ ය. ... මහණෙනි, මේ සිකපදය මෙසේ උදෙසවු:”",
                        "type": "paragraph"
                    },
                    {
                        "text": "**“යම් මහණෙක් රාගයට බටුයේ පෙරළී ගිය සිතින් මාගමක හා කාසසඟට පැමිණියේ නම්, අත ගැණීම හෝ කෙහෙ ගැණීම හෝ යම්ම අඟපසඟක් පිරිමැදීම හෝ කෙරේ නම් සඟවෙසෙස් වේ”** යනුයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "7. යො පන යනු යමෙක්, යම්බඳු වූයෙක් ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "භික්ඛු යනු ... මේ තෙමේ මේ අර්‍ත්‍ථයෙහි භික්ෂු ය යි අදහස් කරණ ලදී.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඔතිණ්ණ නම්: අතිශයින් ඇලුනේ, බලාපොරොත්තු ඇත්තේ, පිළිබඳ සිත් ඇත්තේ ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 296,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**විපරිණත**න්ති රත්තම්පි චිත්තං විපරිණතං. දුට්ඨම්පි චිත්තං විපරිණතං. මූළ්හම්පි චිත්තං විපරිණතං. අපි ච, රත්තං චිත්තං ඉමස්මිං අත්ථෙ අධිප්පෙතං විපරිණතන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**මාතුගාමො** නාම මනුස්සිත්ථි, න යක්ඛී, න පෙතී, න තිරච්ඡානගතා. අන්තමසො තදහුජාතාපි දාරිකා, පගෙව මහත්තරී."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සද්ධි**න්ති එකතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "**කායසංසග්ගං සමාපජ්ජෙය්යා**ති අජ්ඣාචාරො වුච්චති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**හත්ථො** නාම කප්පරං උපාදායං යාව අග්ගනඛා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**වෙණී** නාම සුද්ධකෙසා වා, සුත්තමිස්සා වා, මාලාමිස්සා වා, හිරඤ්ඤමිස්සා වා, සුවණ්ණමිස්සා වා, මුත්තාමිස්සා වා, මණිමිස්සා වා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අඞ්ගං** නාම හත්ථඤ්ච වෙණිඤ්ච ඨපෙත්වා අවසෙසං අඞ්ගං නාම."
                    },
                    {
                        "type": "paragraph",
                        "text": "8. ආමසනා පරාමසනා ඔමසනා උම්මසනා ඔලඞ්ඝනා උල්ලඞ්ඝනා ආකඩ්ඪනා පතිකඩ්ඪනා අභිනිග්ගණ්හනා අභිනිප්පීළනා ගහණං ඡුපනං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ආමසනා** නාම ආමට්ඨමත්තා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පරාමසනා** නාම ඉතොචිතො ච සඤ්චොපනා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ඔමසනා** නාම හෙට්ඨා ඔරොපනා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**උම්මසනා** නාම උද්ධං උච්චාරණා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ඔලඞ්ඝනා** නාම හෙට්ඨා ඔනමනා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**උල්ලඞ්ඝනා** නාම උද්ධං උච්චාරණා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ආකඩ්ඪනා** නාම ආවිඤ්ජනා.{1}"
                    },
                    {
                        "type": "paragraph",
                        "text": "**පතිකඩ්ඪනා** නාම පතිපනාමනා{2}."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අභිනිග්ගණ්හනා** නාම අඞ්ගං ගහෙත්වා නිප්පීළනා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අභිනිප්පීළනා** නාම කෙනචි සහ නිප්පීළනා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ගහණං** නාම ගහිතමත්තං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ඡුපනං** නාම ඵුට්ඨමත්තං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සඞ්ඝාදිසෙසො**ති -පෙ- තෙනපි වුච්චති සඞ්ඝාදිසෙසො’ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ආවිඤ්ඡනා. මඡසං, ආවිඤ්ජනා. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. පතිප්පනාමනා. මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "විපරිණතං යනු රාගයෙන් රත් වූ සිත ද, විපරිණත ය. ද්වෙෂයෙන් ද්විෂ්ට වූ සිත ද විපරිණත ය. මෝහයෙන් මුළා වූ සිත ද විපරිණත ය. එහෙත් මේ අර්‍ත්‍ථයෙහි රාගයෙන් රත් වූ සිත විපරිණත ය යි අදහස් කරණ ලදී.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මාතුගාම නම් මිනිස් මාගම ය. යකින්නක් නො වෙයි. ප්‍රේතියක් නො වෙයි. තිරිසන්ගිය මාගමක් නො වෙයි. යටත් පිරිසෙයින් එදින උපන් දැරි ය. ඇයට වඩා මහත් වූවා කැලැමය. (මුලදීම මාගම් වෙයි.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "සද්ධිං යනු එක්ව ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "කායසංසග්ගං සමාපජ්ජෙය්‍ය යනුයෙන් අධ්‍යාචාරය (ආචාරය ඉක්මවීම) කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "හත්ථ නම් වැළමිට පටන් නිය අගතෙක් ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "වෙණි නම් හුදු කෙහෙ හෝ, හුයින් මුසු හෝ, මලින් මුසු හෝ, කහවනුයෙන් මුසු හෝ, රන්කූරුයෙන් මුසු හෝ, මුතුවැළින් මුසු හෝ, මණිමාලායෙන් මුසු හෝ යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අඞ්ග නම් අත ද කෙස්වැටිය ද හැර සෙස්ස අඞ්ග නමි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "8. ආමසනා, පරාමසනා, ඔමසනා, උම්මසනා, ඔලඞ්ඝනා, උල්ලඞ්ඝනා, ආකඩ්ඪනා, පතිකඩ්ඪනා, අභිනිග්ගණ්හනා, අභිනීප්පිළනා, ගහණ, ජුපන යන මේ දත යුතු ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආමසනා නම් ආමර්‍ශන මාත්‍ර ය (අත ගෑම ය.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "පරාමසනා නම් ඔබ මොබ පිරිමැදීම ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඔමසනා නම් යටට පිරිමැදීම ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "උම්මසනා නම් උඩට පිරිමැදීම ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඔලඞ්ඝනා නම් යටට නැමීම ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "උල්ලඞ්ඝනා නම් උඩට නැමීම ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආකඩ්ඪනා නම් ලංකර ගැණීම (ඇද ගැණීම) ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පතිකඞ්ඪනා නම් තමන් කරා හරවා ගැණීම ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අභිනිග්ගණ්හනා නම් අවයවයක් ගෙණ මැඩීම ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අභිනිප්පිළනා නම් කිසිවක් හා මැඩීම ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ගහණ නම් ගැණීම් මාත්‍ර ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ජුපන නම් ස්පර්‍ශ කිරීම් මාත්‍ර ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සඞ්ඝාදිසෙසො යනු ... ඒ කරණ කොට ගෙණ ද සඟවෙසෙස් ය යි කියනු ලැබේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 298,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "1. ඉත්ථි ච හොති, ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ඉත්ථියා කායෙන කායං ආමසති පරාමසති ඔමසති උම්මසති ඔලඞ්ඝෙති උල්ලඞ්ඝෙති ආකඩ්ඪති පතිකඩ්ඪති අභිනිග්ගණ්හාති අභිනිප්පීළෙති ගණ්හාති ඡුපති, ආපත්ති සඞ්ඝාදිසෙසස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. ඉත්ථී ච හොති වෙමතිකො සාරත්තො ච, භික්ඛු ච නං ඉත්ථියා කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ථුල්ලච්චයස්ස. ඉත්ථි ච හොති, පණ්ඩකසඤ්ඤී සාරත්තො ච. භික්ඛු ච නං ඉත්ථියා කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ථුල්ලච්චයස්ස. ඉත්ථි ච හොති, පුරිසසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ඉත්ථියා කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ථුල්ලච්චයස්ස. ඉත්ථි ච හොති, තිරච්ඡානගතසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ඉත්ථියා කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ථුල්ලච්චයස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. පණ්ඩකො ච හොති, පණ්ඩකසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං පණ්ඩකස්ස කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ථුල්ලච්චයස්ස. පණ්ඩකො ච හොති, වෙමතිකො සාරත්තො ච, භික්ඛු ච නං පණ්ඩකස්ස කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති දුක්කටස්ස. පණ්ඩකො ච හොති පුරිසසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං පණ්ඩකස්ස කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති දුක්කටස්ස. පණ්ඩකො ච හොති තිරච්ඡානගතසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං පණ්ඩකස්ස කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති දුක්කටස්ස. පණ්ඩකො ච හොති ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං පණ්ඩකස්ස කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති දුක්කටස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "4. පුරිසො ච හොති, පුරිසසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං පුරිසස්ස කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති දුක්කටස්ස; පුරිසො ච හොති වෙමතිකො -පෙ- පුරිසො ච හොති තිරච්ඡානගතසඤ්ඤී -පෙ- පුරිසො ච හොති, ඉත්ථිසඤ්ඤී -පෙ- පුරිසො ච හොති, පණ්ඩකසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං පුරිසස්ස කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති දුක්කටස්ස."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "1. ස්ත්‍රියකුදු වෙයි, ස්ත්‍රියක යන හැඟීම් ඇති සංරක්තයෙකුදු වෙයි, මහණ තෙමේ තමාගේ කයින් ස්ත්‍රියගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, අවමර්‍ශනය කෙරෙයි ද, උනමර්‍ශනය කෙරෙයි ද, අවලඞ්ඝනය කෙරෙයි ද, උල්ලඞ්ඝනය කෙරෙයි ද, ආකර්‍ෂණය කෙරෙයි ද, ප්‍රතිකර්‍මණය කෙරෙයි ද, අභිනිග්‍රහණය කෙරෙයි ද, අභිනිෂ්පීඩනය කෙරෙයි ද, ග්‍රහණය කෙරෙයි ද, ස්පර්‍ශ කෙරෙයි ද, සඟවෙසෙස් ඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. ස්ත්‍රියකුදු වෙයි, සංරක්ත වෙමතියෙකුත් වෙයි, මහණ තෙමේ තමාගේ කයින් ස්ත්‍රියගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසිඇවැත් වේ. ස්ත්‍රියකුදු වෙයි, පණ්ඩකය යන හැඟීම් ඇති සංරක්තයෙකුදු වෙයි, මහණ තෙමේත් තමාගේ කයින් ස්ත්‍රියගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසිඇවැත් වේ. ස්ත්‍රියකුදු වෙයි, පුරුෂයෙක යන හැඟීම් ඇති සංරක්තයෙකුදු වෙයි, මහණ තෙමේත් තමාගේ කයින් ස්ත්‍රියගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසිඇවැත් වේ. ස්ත්‍රියකුදු වෙයි, තිරිසන්ගිය යි හැඟීම් ඇති සංරක්තයෙකුදු වෙයි, මහණ තෙමේත් තමාගේ කයින් ස්ත්‍රියගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද ථුලැසිඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. පණ්ඩකයෙකුදු වෙයි, පණ්ඩක යන හැඟීම් ඇති සංරක්තයෙකුදු වෙයි, මහණ තෙමේත් තමාගේ කයින් පණ්ඩකයාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසිඇවැත් වේ. පණ්ඩකයෙකුදු වෙයි, වීමති ඇති සංරක්තයෙකුත් වෙයි, මහණ තෙමේත් කයින් පණ්ඩකයාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, දුකුළාඇවැත් වේ. පණ්ඩකයෙකුදු වෙයි, පුරුෂයෙක යන හැඟීම් ඇති සංරක්තයෙකුදු වෙයි, මහණ තෙමේ තමාගේ කයින් පණ්ඩකයාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, දුකුළාඇවැත් වේ. පණ්ඩකයෙකුදු වෙයි, තිරිසන්ගතයෙකැ යි හැඟීම් ඇති සංරක්තයෙකුදු වෙයි, මහණ තෙමේත් තමාගේ කයින් පණ්ඩකයාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, දුකුළාඇවැත් වේ. පණ්ඩකයෙකුදු වෙයි, ස්ත්‍රියක යන හැඟීම් ඇති සංරක්තයෙකුදු වෙයි, මහණ තෙමේත් තමාගේ කයින් ස්ත්‍රියගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, දුකුළාඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. පුරුෂයෙකුදු වෙයි, පුරුෂයෙක යන හැඟීම් ඇති සංරක්තයෙකුදු වෙයි, මහණ තෙමේත් තමාගේ කයින් පුරුෂයාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, දුකුළාඇවැත් වේ. පුරුෂයෙකුදු වෙයි, වීමති ඇති ... පුරුෂයෙකුදු වෙයි, තිරිසන් ගතයෙක යන හැඟීම් ඇත්තේත් ... පුරුෂයෙකුදු වෙයි, ස්ත්‍රියක යන හැඟීම් ඇත්තේත් ... පුරුෂයෙකුදු වෙයි, පණ්ඩකයෙක යන හැඟීම් ඇති සංරක්තයෙකුදු වෙයි, මහණ තෙමේත් තමාගේ කයින් පුරුෂයාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද ... ගණියි ද, ස්පර්‍ශ කෙරේ ද දුකුළාඇවැත් වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 300,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "5. තිරච්ඡානගතො ච හොති තිරච්ඡානගතසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං තිරච්ඡානගතස්ස කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති දුක්කටස්ස. තිරච්ඡානගතො ච හොති වෙමතිකො -පෙ- තිරච්ඡානගතො ච හොති, ඉත්ථිසඤ්ඤී -පෙ- තිරච්ඡානගතො ච හොති පණ්ඩකසඤ්ඤී -පෙ- තිරච්ඡානගතො ච හොති, පුරිසසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං තිරච්ඡානගතස්ස කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති දුක්කටස්ස."
                    },
                    {
                        "type": "centered",
                        "text": "එකමූලකං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1. ද්වෙ ඉත්ථියො ද්වින්නං ඉත්ථීනං ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ද්වින්නං ඉත්ථීනං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති ආපත්ති ද්වින්නං සඞ්ඝාදිසෙසානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. ද්වෙ ඉත්ථියො ද්වින්නං ඉත්ථීනං වෙමතිකො සාරත්තො ච, භික්ඛු ච නං ද්වින්නං ඉත්ථීනං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ද්වින්නං ථුල්ලච්චයානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. ද්වෙ ඉත්ථියො, ද්වින්නං ඉත්ථීනං පණ්ඩකසඤ්ඤී -පෙ- පුරිසසඤ්ඤී -පෙ- තිරච්ඡානගතසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ද්වින්නං ඉත්ථීනං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ද්වින්නං ථුල්ලච්චයානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "4. ද්වෙ පණ්ඩකා, ද්වින්නං පණ්ඩකානං පණ්ඩකසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ද්වින්නං පණ්ඩකානං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ද්වින්නං ථුල්ලච්චයානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "5. ද්වෙ පණ්ඩකා ද්වින්නං පණ්ඩකානං වෙමතිකො -පෙ- පුරිසසඤ්ඤී -පෙ- තිරච්ඡානගතසඤ්ඤී -පෙ- ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ද්වින්නං පණ්ඩකානං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ද්වින්නං දුක්කටානං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "5. තිරිසන් ගතයෙකුදු වෙයි, තිරිසන් ගතයෙක යන හැඟීම් ඇති සංරක්තයෙකුදු වෙයි, මහණ තෙමේත් තමාගේ කයින් තිරිසන්ගතයාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද දුකුළාඇවැත් වේ. තිරිසන්ගතයෙකුදු වෙයි, වීමති ඇති ... තිරිසන්ගතයෙකුදු වෙයි, ස්ත්‍රියක යන හැඟීම් ඇත්තේත් ... තිරිසන්ගතයකුදු වෙයි, පණ්ඩකයෙක යන හැඟීම් ඇත්තේද වේ, ... තිරිසන්ගතයෙකුදු වෙයි, පුරුෂයෙක යන හැඟීම් ඇති සංරක්තයෙකුදු වෙයි, මහණ තෙමේත් තමාගේ කයින් තිරිසන්ගතයාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, දුකුළාඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "එකමුලකනය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "1. ස්ත්‍රිහු දෙදෙනෙක් වෙති, ස්ත්‍රීන් දෙදෙනා පිළිබඳ ව ස්ත්‍රීහුය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් ස්ත්‍රීන් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, සඟවෙසෙස්ඇවැත් දෙකෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. ස්ත්‍රීහු දෙදෙනෙක් වෙත්, ස්ත්‍රීන් දෙදෙනා පිළිබඳ විමති ඇත්තේ සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් ස්ත්‍රීන් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසිඇවැත් දෙකෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. ස්ත්‍රීහු දෙදෙනෙක් වෙත්, ස්ත්‍රීන් දෙදෙනා පිළිබඳ පණ්ඩකය යන හැඟීම් ඇත්තේ ... පුරුෂයෙක යන හැඟීම් ඇත්තේ ... තිරිසනෙක යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් ස්ත්‍රීන් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසිඇවැත් දෙකෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. පණ්ඩකයෝ දෙදෙනෙක් වෙත්, පණ්ඩකයන් දෙදෙනා පිළිබඳ ව පණ්ඩක ය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් පණ්ඩකයන් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසිඇවැත් දෙකෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "5. පණ්ඩකයෝ දෙදෙනෙක් වෙත්, පණ්ඩකයන් දෙදෙනා පිළිබඳ ව විමති ඇත්තේ ... පුරුෂය යන හැඟීම් ඇත්තේ ... තිරිසන්ගතය යන හැඟීම් ඇත්තේ ... ස්ත්‍රිය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් පණ්ඩකයන් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, දුකුළාඇවැත් දෙකෙකි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 302,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "6. ද්වෙ පුරිසා, ද්වින්නං පුරිසානං පුරිසසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ද්වින්නං පුරිසානං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ද්වින්නං දුක්කටානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "7. ද්වෙ පුරිසා, ද්වින්නං පුරිසානං වෙමතිකො -පෙ- තිරච්ඡානගතසඤ්ඤී -පෙ- ඉත්ථිසඤ්ඤී -පෙ- පණ්ඩකසඤ්ඤී සාරත්තො ච භික්ඛු ච, නං ද්වින්නං පුරිසානං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ද්වින්නං දුක්කටානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "8. ද්වෙ තිරච්ඡානගතා ද්වින්නං තිරච්ඡානගතානං තිරච්ඡානගතසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ද්වින්නං තිරච්ඡානගතානං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ද්වින්නං දුක්කටානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "9. ද්වෙ තිරච්ඡානගතා ද්වින්නං තිරච්ඡානගතානං වෙමතිකො -පෙ- ඉත්ථිසඤ්ඤී -පෙ- පණ්ඩකසඤ්ඤී -පෙ- පුරිසසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ද්වින්නං තිරච්ඡානගතානං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ද්වින්නං දුක්කටානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "10. ඉත්ථී ච පණ්ඩකො ච, උභින්නං ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති සඞ්ඝාදිසෙසෙන දුක්කටස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "11. ඉත්ථී ච පණ්ඩකො ච, උභින්නං වෙමතිකො සාරත්තො ච, භික්ඛු ච නං උභින්නං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ථුල්ලච්චයෙන දුක්කටස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "12. ඉත්ථී ච පණ්ඩකො ච, උභින්නං පණ්ඩකසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ද්වින්නං ථුල්ලච්චයානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "13. ඉත්ථී ච පණ්ඩකො ච, උභින්නං පුරිසසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ථුල්ලච්චයෙන දුක්කටස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "14. ඉත්ථී ච පණ්ඩකො ච, උභින්නං තිරච්ඡානගතසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ථුල්ලච්චයෙන දුක්කටස්ස."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "6. පුරුෂයෝ දෙදෙනෙක් වෙත්, පුරුෂයන් දෙදෙනා පිළිබඳ ව පුරුෂය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් පුරුෂයන් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, දුකුළාඇවැත් දෙකෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "7. පුරුෂයෝ දෙදෙනෙක් වෙත්, පුරුෂයන් දෙදෙනා පිළිබඳව විමති ඇත්තේ ... ස්ත්‍රියක යන හැඟීම් ඇත්තේ ... පණ්ඩකයෙක යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් පුරුෂයන් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, දුකුළාඇවැත් දෙකෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "8. තිරිසන්නු දෙදෙනෙක් වෙත්, තිරිසනුන් දෙදෙනා පිළිබඳ ව තිරි–සන්නුය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, ඒ මහණ තෙමේත් තමාගේ කයින් තිරිසනුන් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, දුකුළාඇවැත් දෙකෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "9. තිරිසන්නු දෙදෙනෙක් වෙත්, තිරිසනුන් දෙදෙනා පිළිබඳ ව විමති ඇත්තේ ... ස්ත්‍රියක යන හැඟීම් ඇත්තේ ... පණ්ඩකයෙක යන හැඟීම් ඇත්තේ ... පුරුෂයෙක යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් තිරිසනුන් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, දුකුළාඇවැත් දෙකෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "10. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, දෙදෙනා පිළිබඳ ස්ත්‍රියක යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, සඟවෙසෙස් හා දුකුළාඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "11. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, දෙදෙනා පිළිබඳව විමති ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසියක් හා දුකුළාඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "12. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, දෙදෙනා පිළිබඳ ව පණ්ඩක ය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, ඒ මහණ තෙමේත් තමාගේ කයින් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසිඇවැත් දෙකෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "13. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, දෙදෙනා පිළිබඳව පුරුෂ ය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, ඒ මහණ තෙමේත් තමාගේ කයින් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද ථුලැසි හා දුකුළාඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "14. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, දෙදෙනා පිළිබඳ තිරිසන්ය යන හැඟීම් ඇත්තේ, සංරක්තත් වේ, ඒ මහණ තෙමේත් තමාගේ කයින් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසි හා දුකුළාඇවැත් වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 304,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "15. ඉත්ථී ච පුරිසො ච, උභින්නං ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති සඞ්ඝාදිසෙසෙන දුක්කටස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "16. ඉත්ථී ච පුරිසො ච, උභින්නං වෙමතිකො -පෙ- පණ්ඩකසඤ්ඤී -පෙ- පුරිසසඤ්ඤී -පෙ- තිරච්ඡානගතසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ථුල්ලච්චයෙන දුක්කටස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "17. ඉත්ථී ච තිරච්ඡානගතො ච, උභින්නං ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති සඞ්ඝාදිසෙසෙන දුක්කටස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "18. ඉත්ථී ච තිරච්ඡානගතො ච, උභින්නං වෙමතිකො -පෙ- පණ්ඩකසඤ්ඤී -පෙ- පුරිසසඤ්ඤී -පෙ- තිරච්ඡානගතසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ථුල්ලච්චයෙන දුක්කටස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "19. පණ්ඩකො ච පුරිසො ච, උභින්නං පණ්ඩකසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ථුල්ලච්චයෙන දුක්කටස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "20. පණ්ඩකො ච පුරිසො ච, උභින්නං වෙමතිකො -පෙ- පුරිසසඤ්ඤී -පෙ- තිරච්ඡානගතසඤ්ඤී -පෙ- ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ද්වින්නං දුක්කටානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "21. පණ්ඩකො ච තිරච්ඡානගතො ච, උභින්නං පණ්ඩකසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ථුල්ලච්චයෙන දුක්කටස්ස."
                    },
                    {
                        "type": "paragraph",
                        "text": "22. පණ්ඩකො ච තිරච්ඡානගතො ච, උභින්නං වෙමතිකො -පෙ- පුරිසසඤ්ඤී -පෙ- තිරච්ඡානගතසඤ්ඤී -පෙ- ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ද්වින්නං දුක්කටානං."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "15. ස්ත්‍රියකුදු පුරුෂයෙකුදු වෙත්, දෙදෙනා පිළිබඳ ව ස්ත්‍රිය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, ඒ මහණ තෙමේත් තමාගේ කයින් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, සඟවෙසෙස් හා දුකුළාඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "16. ස්ත්‍රියකුදු පුරුෂයෙකුදු වෙත්, දෙදෙනා පිළිබඳ ව විමති ඇත්තේ ... පණ්ඩකය යන හැඟීම් ඇත්තේ, ... පුරුෂය යන හැඟීම් ඇත්තේ ... තිරිසන් ය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසි හා දුකුළාඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "17. ස්ත්‍රියකුදු තිරිසනෙකුදු වෙත්, දෙදෙනා පිළිබඳ ස්ත්‍රීහු ය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ස්පර්‍ශ කෙරෙයි ද, සඟවෙසෙස් හා දුකුළාඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "18. ස්ත්‍රියකුදු තිරිසනෙකුදු වෙත්, දෙදෙනා පිළිබඳව විමති ඇත්තේ, ... පණ්ඩක ය යන හැඟීම් ඇත්තේ, ... පුරුෂය යන හැඟීම් ඇත්තේ, ... තිරිසන් ය යන හැඟීම් ඇත්තේ, ... සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසි හා දුකුළාඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "19. පණ්ඩකයෙකුදු පුරුෂයෙකුදු වෙත්, දෙදෙනා පිළිබඳ ව පණ්ඩක ය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසි හා දුකුළාඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "20. පණ්ඩකයෙකුදු පුරුෂයෙකුදු වෙත්, දෙදෙනා පිළිබඳව විමති ඇත්තේ ... පුරුෂ ය යන හැඟීම් ඇත්තේ, ... තිරිසන්ගතය යන හැඟීම් ඇත්තේ, ... ස්ත්‍රි ය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, දුකුළාඇවැත් දෙකෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "21. පණ්ඩකයෙකුදු තිරිසනෙකුදු වෙත්, මහණ තෙමේ දෙදෙනා පිළිබඳ ව පණ්ඩක ය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසි හා දුකුළාඇවැත් වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "22. පණ්ඩකයෙකුදු තිරිසනෙකුදු වෙත්, මහණ තෙමේ දෙදෙනා පිළිබඳ ව විමති ඇත්තේ, ... පුරුෂ ය යන හැඟීම් ඇත්තේ ... තිරිසන් ය යන හැඟීම් ඇත්තේ ... ස්ත්‍රී ය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, දුකුළාඇවැත් දෙකෙකි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 306,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "23. පුරිසො ච තිරච්ඡානගතො ච, උභින්නං පුරිසසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ද්වින්නං දුක්කටානං."
                    },
                    {
                        "type": "paragraph",
                        "text": "24. පුරිසො ච තිරච්ඡානගතො ච, උභින්නං වෙමතිකො -පෙ- තිරච්ඡානගතසඤ්ඤී -පෙ- ඉත්ථිසඤ්ඤී -පෙ- පණ්ඩකසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං කායෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ද්වින්නං දුක්කටානං."
                    },
                    {
                        "type": "centered",
                        "text": "දුමූලකං නිට්ඨිතං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1. ඉත්ථී ච හොති, ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ඉත්ථියා කායෙන කායපටිබද්ධං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ථුල්ලච්චයස්ස -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "2. ද්වෙ ඉත්ථියො, ද්වින්නං ඉත්ථිනං ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ද්වින්නං ඉත්ථීනං කායෙන කායපටිබද්ධං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ද්වින්නං ථුල්ලච්චයානං -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "3. ඉත්ථී ච පණ්ඩකො ච, උභින්නං ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං කායෙන කායපටිබද්ධං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ථුල්ලච්චයෙන දුක්කටස්ස -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "4. ඉත්ථී ච හොති, ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ඉත්ථියා කායපටිබද්ධෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ථුල්ලච්චයස්ස -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "5. ද්වෙ ඉත්ථියො ද්වින්නං ඉත්ථීනං ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ද්වින්නං ඉත්ථීනං කායපටිබද්ධෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ද්වින්නං ථුල්ලච්චයානං -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "6. ඉත්ථී ච පණ්ඩකො ච, උභින්නං ඉත්ථිසඤ්ඤී සාරත්තො ච. භික්ඛු ච නං උභින්නං කායපටිබද්ධෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ථුල්ලච්චයෙන දුක්කටස්ස -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "7. ඉත්ථී ච හොති, ඉත්ථිසඤ්ඤී සාරත්තො ච. භික්ඛු ච නං ඉත්ථියා කායපටිබද්ධෙන කායපටිබද්ධං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති දුක්කටස්ස -පෙ-"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "23. පුරුෂයෙකුදු තිරිසනෙකුදු වෙත්, දෙදෙනා පිළිබඳ ව පුරුෂ ය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද ස්පර්‍ශ කෙරෙයි ද, දුකුළාඇවැත් දෙකෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "24. පුරුෂයෙකුදු තිරිසන්ගතයෙකුදු වෙත්, දෙදෙනා පිළිබඳ ව විමති ඇත්තේ, ... තිරිසන්ගත ය යන හැඟීම් ඇත්තේ ... ස්ත්‍රී ය යන හැඟීම් ඇත්තේ, ... පණ්ඩක ය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, දුකුළාඇවැත් දෙකෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ද්විමූලකය නිමි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "text": "1. ස්ත්‍රියකුදු වෙයි, ස්ත්‍රියක යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් ස්ත්‍රීයගේ කය පිළිබඳ වූවක් ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසිඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. ස්ත්‍රීහු දෙදෙනෙක් වෙත්, ස්ත්‍රීන් දෙදෙනා පිළිබඳ ව ස්ත්‍රි ය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් ස්ත්‍රීන් දෙදෙනාගේ කය පිළිබඳ වූවක් ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසිඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, දෙදෙනා පිළිබඳ ව ස්ත්‍රී යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කයින් ස්ත්‍රීන් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසි හා දුකුළාඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. ස්ත්‍රියකුදු වෙයි, ස්ත්‍රියක යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි ද, මහණ තෙමේත් තමාගේ කයින් ස්ත්‍රියගේ කය පිළිබඳ වූවක් ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසිඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "5. ස්ත්‍රීහු දෙදෙනෙක් වෙත්, ස්ත්‍රීන් දෙදෙනා පිළිබඳ ව ස්ත්‍රිය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කය පිළිබඳ වූවකින් ස්ත්‍රීන් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසිඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "6. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, දෙදෙනා පිළිබඳ ව ස්ත්‍රීය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කය පිළිබඳ වූවකින් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ථුලැසි හා දුකුළාඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "7. ස්ත්‍රියකුදු වෙයි, ස්ත්‍රී යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කය පිළිබඳ වූවකින් ස්ත්‍රියගේ කය පිළිබඳ වූවක් ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, දුකුළාඇවැත් වේ. ...",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 308,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "8. ද්වෙ ඉත්ථියො, ද්වින්නං ඉත්ථීනං ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ද්වින්නං ඉත්ථීනං කායපටිබද්ධෙන කායපටිබද්ධං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ද්වින්නං දුක්කටානං -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "9. ඉත්ථී ච පණ්ඩකො ච, උභින්නං ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං කායපටිබද්ධෙන කායපටිබද්ධං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, ආපත්ති ද්වින්නං දුක්කටානං. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "10. ඉත්ථී ච හොති ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ඉත්ථියා නිස්සග්ගියෙන කායං ආමසති ආපත්ති දුක්කටස්ස. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "11. ද්වෙ ඉත්ථියො, ද්වින්නං ඉත්ථීනං ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ද්වින්නං ඉත්ථීනං නිස්සග්ගියෙන කායං ආමසති, ආපත්ති ද්වින්නං දුක්කටානං. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "12. ඉත්ථී ච පණ්ඩකො ච, උභින්නං ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං නිස්සග්ගියෙන කායං ආමසති, ආපත්ති ද්වින්නං දුක්කටානං. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "13. ඉත්ථී ච හොති, ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ඉත්ථියා නිස්සග්ගියෙන කායපටිබද්ධං ආමසති, ආපත්ති දුක්කටස්ස. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "14. ද්වෙ ඉත්ථියො ද්වින්නං ඉත්ථීනං ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ද්වින්නං ඉත්ථීනං නිස්සග්ගියෙන කායපටිබද්ධං ආමසති, ආපත්ති ද්වින්නං දුක්කටානං. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "15. ඉත්ථී ච පණ්ඩකො ච, උභින්නං ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං නිස්සග්ගියෙන කායපටිබද්ධං ආමසති, ආපත්ති ද්වින්නං දුක්කටානං. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "16. ඉත්ථී ච හොති, ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං ඉත්ථියා නිස්සග්ගියෙන නිස්සග්ගියං ආමසති, ආපත්ති දුක්කටස්ස. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "17. ද්වෙ ඉත්ථියො ද්වින්නං ඉත්ථීනං ඉත්ථිසඤ්ඤී සාරත්තො ච. භික්ඛු ච නං ද්වින්නං ඉත්ථීනං නිස්සග්ගියෙන නිස්සග්ගියං ආමසති, ආපත්ති ද්වින්නං දුක්කටානං. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "18. ඉත්ථී ච පණ්ඩකො ච, උභින්නං ඉත්ථිසඤ්ඤී සාරත්තො ච, භික්ඛු ච නං උභින්නං නිස්සග්ගියෙන නිස්සග්ගියං ආමසති, ආපත්ති ද්වින්නං දුක්කටානං. -පෙ-"
                    },
                    {
                        "type": "centered",
                        "text": "භික්ඛුපෙය්යාලං නිට්ඨිතං.",
                        "level": 1
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "8. ස්ත්‍රීහු දෙදෙනෙක් වෙත්, ස්ත්‍රීන් දෙදෙනා පිළිබඳ ව ස්ත්‍රිය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් තමාගේ කය පිළිබඳ වූවකින් ස්ත්‍රීන් දෙදෙනාගේ කය පිළිබඳ වූවක් ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, දුකුළාඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "9. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, දෙදෙනා පිළිබඳ ස්ත්‍රීය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි ද, මහණ තෙමේත් තමාගේ කය පිළිබඳ වුවකින් දෙදෙනාගේ කය පිළිබඳ වුවක් ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, දුකුළාඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "10. ස්ත්‍රියකුදු වෙයි, ස්ත්‍රිය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, මහණ තෙමේත් තමා විසින් මුදාලූවකින් ස්ත්‍රියගේ කය ආමර්‍ශනය කෙරේ ද දුකුළැඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "11. ස්ත්‍රීහු දෙදෙනෙකුත් වෙත්, ස්ත්‍රින් දෙදෙනා පිළිබඳ ස්ත්‍රීය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් මුදාලූවකින් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, දුකුළැඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "12. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, දෙදෙනා පිළිබඳව ස්ත්‍රිය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, මහණ තෙමේත් මුදාලූවකින් දෙදෙනාගේ කය ආමර්‍ශනය කෙරෙයි ද, දුකුළාඇවැත් දෙකෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "13. ස්ත්‍රියකුදු වෙයි, ස්ත්‍රිය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් මුදාලූවකින් ස්ත්‍රියගේ කය පිළිබඳ වූවක් ආමර්‍ශනය කෙරෙයි ද, දුකුළාඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "14. ස්ත්‍රීහු දෙදෙනෙක් වෙත්, ස්ත්‍රීන් දෙදෙනා පිළිබඳව ස්ත්‍රිය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි ද, මහණ තෙමේත් මුදාලූවකින් ස්ත්‍රීන් දෙදෙනාගේ කය පිළිබඳවූවක් ආමර්‍ශනය කෙරෙයි ද, දුකුළාඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "15. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, දෙදෙනා පිළිබඳ ස්ත්‍රිය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් මුදාලූවකින් දෙදෙනාගේ කය පිළිබඳ වූවක් ආමර්‍ශනය කෙරෙයි ද, දුකුළාඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "16. ස්ත්‍රියකුදු වෙයි, ස්ත්‍රිය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් ස්ත්‍රිය පිළිබඳ මුදාලූවකින් මුදාලූවක් ආමර්‍ශනය කෙරෙයි ද, දුකුළාඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "17. ස්ත්‍රීහු දෙදෙනෙක් වෙත්, දෙදෙනා පිළිබඳ ව ස්ත්‍රීය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් ස්ත්‍රීන් දෙදෙනා පිළිබඳ මුදාලූවකින් මුදාලූවක් ආමර්‍ශනය කෙරෙයි ද, දුකුළාඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "18. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, දෙදෙනා පිළිබඳ ව ස්ත්‍රීය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, මහණ තෙමේත් දෙදෙනා පිළිබඳ මුදාලූවකින් මුදාලූවක් ආමර්‍ශනය කෙරෙයි ද, දුකුළාඇවැත් දෙකෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "භික්ඛුපෙය්‍යාලය නිමි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 310,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "1. ඉත්ථී ච හොති ඉත්ථිසඤ්ඤී සාරත්තො ච, ඉත්ථී ච නං භික්ඛුස්ස කායෙන කායං ආමසති පරාමසති ඔමසති උම්මසති ඔලඞ්ඝෙති උල්ලඞ්ඝෙති ආකඩ්ඪති පතිකඩ්ඪති අභිනිග්ගණ්හාති අභිනිප්පීළෙති ගණ්හාති ඡුපති, සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති සඞ්ඝාදිසෙසස්ස. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "2. ද්වෙ ඉත්ථියො ද්වින්නං ඉත්ථීනං ඉත්ථිසඤ්ඤී සාරත්තො ච, ඉත්ථියො ච නං භික්ඛුස්ස කායෙන කායං ආමසන්ති පරාමසන්ති ඔමසන්ති උම්මසන්ති ඔලඞ්ඝෙන්ති උල්ලඞ්ඝෙන්ති ආකඩ්ඪන්ති පතිකඩ්ඪන්ති අභිනිග්ගණ්හන්ති අභිනිප්පීළෙන්ති ගණ්හන්ති ඡුපන්ති, සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති ද්වින්නං සඞ්ඝාදිසෙසානං. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "3. ඉත්ථී ච පණ්ඩකො ච, උභින්නං ඉත්ථිසඤ්ඤි සාරත්තො ච, උභො ච නං භික්ඛුස්ස කායෙන කායං ආමසන්ති පරාමසන්ති -පෙ- ගණ්හන්ති ඡුපන්ති, සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති සඞ්ඝාදිසෙසෙන දුක්කටස්ස. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "4. ඉත්ථී ච හොති ඉත්ථිසඤ්ඤී සාරත්තො ච, ඉත්ථී ච නං භික්ඛුස්ස කායෙන කායපටිබද්ධං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති ථුල්ලච්චයස්ස. -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "5. ද්වෙ ඉත්ථියො ද්වින්නං ඉත්ථීනං ඉත්ථිසඤ්ඤී සාරත්තො ච, ඉත්ථියො ච නං භික්ඛුස්ස කායෙන කායපටිබද්ධං ආමසන්ති පරාමසන්ති -පෙ- ගණ්හන්ති ඡුපන්ති, සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති ද්වින්නං ථුල්ලච්චයානං -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "6. ඉත්ථී ච පණ්ඩකො ච, උභින්නං ඉත්ථිසඤ්ඤී සාරත්තො ච, උභො ච නං භික්ඛුස්ස කායෙන කායපටිබද්ධං ආමසන්ති පරාමසන්ති -පෙ- ගණ්හන්ති ඡුපන්ති, සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති ථුල්ලච්චයෙන දුක්කටස්ස -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "7. ඉත්ථී ච හොති ඉත්ථිසඤ්ඤී සාරත්තො ච, ඉත්ථී ච නං භික්ඛුස්ස කායපටිබද්ධෙන කායං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති ථුල්ලච්චයස්ස -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "8. ද්වෙ ඉත්ථියො ද්වින්නං ඉත්ථීනං ඉත්ථිසඤ්ඤී සාරත්තො ච, ඉත්ථියො ච නං භික්ඛුස්ස කායපටිබද්ධෙන කායං ආමසන්ති පරාමසන්ති -පෙ- ගණ්හන්ති ඡුපන්ති, සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති ද්වින්නං ථුල්ලච්චයානං -පෙ-"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "1. ස්ත්‍රියකුදු වෙයි, ස්ත්‍රියක යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, ස්ත්‍රියත් තමාගේ කයින් මහණහුගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, අවමර්‍ශනය කෙරෙයි ද, උන්මර්‍ශනය කෙරෙයි ද, අවලඞ්ඝනය කෙරෙයි ද, උල්ලඞ්ඝනය කෙරෙයි ද, ආකර්‍ෂණය කෙරෙයි ද, ප්‍රතිකර්‍ෂණය කෙරෙයි ද, අභිනිග්‍රහණය කෙරෙයි ද, නිෂ්පීඩනය කෙරෙයි ද, ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, ස්පර්‍ශ කෙරෙයි ද, සෙවුනා අදහස් ඇත්තේ වෑයම් කෙරෙයි ද, ස්පර්‍ශය දැන ගණියි ද, සඟවෙසෙස් ඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. ස්ත්‍රීහු දෙදෙනෙක් වෙත්, ස්ත්‍රීන් දෙදෙනා පිළිබඳ ව ස්ත්‍රීය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, ස්ත්‍රීහු ද තමාගේ කයින් මහණහුගේ කය ආමර්‍ශනය කෙරෙත් ද, පරාමර්‍ශනය කෙරෙත් ද, අවමර්‍ශනය කෙරෙත් ද, උන්මර්‍ශනය කෙරෙත් ද, අවලඞ්ඝනය කෙරෙත් ද, උල්ලඞ්ඝනය කෙරෙත් ද, ආකර්‍ෂණය කෙරෙත් ද, ප්‍රතිකර්‍ෂණය කෙරෙත් ද, අභිනිග්‍රහණය කෙරෙත් ද, අභිනිෂ්පීඩනය කෙරෙත් ද, ග්‍රහණය කෙරෙත් ද, ස්පර්‍ශ කෙරෙත් ද, මහණ තෙම සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් කරයි ද, ස්පර්‍ශය දැන ගණියි ද, සඟවෙසෙස් ඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. ස්ත්‍රියකුදු පණ්ඩකයකුදු වෙත්, දෙදෙනා පිළිබඳව ස්ත්‍රීය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, දෙදෙනා තමන්ගේ කයින් මහණහුගේ කය ආමර්‍ශනය කෙරෙත් ද පරාමර්‍ශනය කෙරෙත් ද, ... ගණිත් ද, ස්පර්‍ශ කෙරෙත් ද, සෙවුනා අදහස් ඇත්තේ, කයින් වෑයම් කෙරෙයි ද, ස්පර්‍ශය විඳියි ද, සඟවෙසෙස් හා දුකුළාඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. ස්ත්‍රියකුදු වෙයි, ස්ත්‍රිය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, ස්ත්‍රිය තමාගේ කයින් මහණහුගේ කය පිළිබඳවූවක් ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, සෙවුනා අදහස් ඇත්තේ තමාගේ කයින් වෑයම් කෙරෙයි ද, ස්පර්‍ශය දැන ගණියි ද, ථුලැසිඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "5. ස්ත්‍රීහු දෙදෙනෙක් වෙත්, ස්ත්‍රීන් දෙදෙනා පිළිබඳ ව ස්ත්‍රීහුය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, ස්ත්‍රිහුත් තමාගේ කයින් මහණහුගේ කය පිළිබඳ වූවක් ආමර්‍ශනය කරත් ද, පරාමර්‍ශනය කරත් ද, ... ගණිත් ද, ස්පර්‍ශ කෙරෙයි ද, සෙවුනා අදහස් ඇත්තේ, කයින් වෑයම් කෙරෙයි ද, ස්පර්‍ශය දැන ගණියි ද, ථුලැසිඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "6. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, දෙදෙනා පිළිබඳව ස්ත්‍රිය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, දෙදෙනා තමන්ගේ කයින් මහණහුගේ කය පිළිබඳ වූවක් ආමර්‍ශනය කෙරෙත් ද පරාමර්‍ශනය කෙරෙත් ද, ... ගණිත් ද, ස්පර්‍ශ කෙරෙත් ද, සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් කෙරෙයි ද, ස්පර්‍ශය දැන ගණියි ද, ථුලැසි හා දුකුළාඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "7. ස්ත්‍රියකුදු වෙයි, ස්ත්‍රිය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, ස්ත්‍රියත් තමාගේ කය පිළිබඳ වූවකින් මහණහුගේ කය ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් කෙරයි ද, ස්පර්‍ශය දැන ගණියි ද, ථුලැසිඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "8. ස්ත්‍රීහු දෙදෙනෙක් වෙත්, ඒ ස්ත්‍රීන් දෙදෙනා පිළිබඳ ව ස්ත්‍රීහුය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, ස්ත්‍රීහුත් තමන්ගේ කය පිළිබඳ වූවකින් මහණහුගේ කය ආමර්‍ශනය කෙරෙත් ද, පරාමර්‍ශනය කෙරෙත් ද, ... ගණිත් ද, ස්පර්‍ශ කෙරෙත් ද, මහණ තෙම සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් කෙරෙයි ද, ස්පර්‍ශය දැන ගණියි ද, ථුලැසිඇවැත් දෙකෙක් වේ. ...",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 312,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "9. ඉත්ථී ච පණ්ඩකො ච, උභින්නං ඉත්ථිසඤ්ඤී සාරත්තො ච, උභො ච නං භික්ඛුස්ස කායපටිබද්ධෙන කායං ආමසන්ති පරාමසන්ති -පෙ- ගණ්හන්ති ඡුපන්ති, සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති ථුල්ලච්චයෙන දුක්කටස්ස -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "**10**. ඉත්ථී ච හොති ඉත්ථිසඤ්ඤී සාරත්තො ච, ඉත්ථී ච නං භික්ඛුස්ස කායපටිබද්ධෙන කායපටිබද්ධං ආමසති පරාමසති -පෙ- ගණ්හාති ඡුපති, සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති දුක්කටස්ස -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "11. ද්වෙ ඉත්ථියො ද්වින්නං ඉත්ථීනං ඉත්ථිසඤ්ඤී සාරත්තො ච, ඉත්ථියො ච නං භික්ඛුස්ස කායපටිබද්ධෙන කායපටිබද්ධං ආමසන්ති පරාමසන්ති -පෙ- ගණ්හන්ති ඡුපන්ති, සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති ද්වින්නං දුක්කටානං -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "12. ඉත්ථී ච පණ්ඩකො ච උභින්නං ඉත්ථිසඤ්ඤී සාරත්තො ච, උභො ච නං භික්ඛුස්ස කායපටිබද්ධෙන කායපටිබද්ධං ආමසන්ති පරාමසන්ති -පෙ- ගණ්හන්ති ඡුපන්ති, සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති ද්වින්නං දුක්කටානං -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "13. ඉත්ථී ච හොති ඉත්ථිසඤ්ඤී සාරත්තො ච, ඉත්ථී ච නං භික්ඛුස්ස නිස්සග්ගියෙන කායං ආමසති. සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති දුක්කටස්ස -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "14. ද්වෙ ඉත්ථියො ද්වින්නං ඉත්ථීනං ඉත්ථිසඤ්ඤී සාරත්තො ච, ඉත්ථියො ච නං භික්ඛුස්ස නිස්සග්ගියෙන කායං ආමසන්ති. සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති ද්වින්නං දුක්කටානං -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "15. ඉත්ථී ච පණ්ඩකො ච උභින්නං ඉත්ථිසඤ්ඤී සාරත්තො ච, උභො ච නං භික්ඛුස්ස නිස්සග්ගියෙන කායං ආමසන්ති. සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති ද්වින්නං දුක්කටානං -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "16. ඉත්ථී ච හොති ඉත්ථිසඤ්ඤී සාරත්තො ච, ඉත්ථී ච නං භික්ඛුස්ස නිස්සග්ගියෙන කායපටිබද්ධං ආමසති. සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති දුක්කටස්ස -පෙ-"
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "text": "9. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, මහණ තෙම ඒ දෙදෙනා පිළිබඳව ස්ත්‍රීහුය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, දෙදෙනා තමන්ගේ කය පිළිබඳ වූවකින් මහණහුගේ කය ආමර්‍ශනය කෙරෙත් ද, පරාමර්‍ශනය කෙරෙත් ද, ... ගණිත් ද, ස්පර්‍ශ කෙරෙත් ද, මහණ සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් කෙරෙයි ද, ස්පර්‍ශය දැන ගණියි ද, ථුලැසි හා දුකුළාඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "10. ස්ත්‍රියකුදු වෙයි, ස්ත්‍රිය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, තමාගේ කය පිළිබඳ වූවකින් මහණහුගේ කය පිළිබඳ වූවක් ආමර්‍ශනය කෙරෙයි ද, පරාමර්‍ශනය කෙරෙයි ද, ... ගණියි ද, ස්පර්‍ශ කෙරෙයි ද, සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් කෙරෙයි ද, ස්පර්‍ශය දැන ගණියි ද, දුකුළාඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "11. ස්ත්‍රීහු දෙදෙනෙක් වෙත්, ඒ ස්ත්‍රීන් දෙදෙනා පිළිබඳ ව ස්ත්‍රීහු ය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, ස්ත්‍රීහු තමන්ගේ කය පිළිබඳ වූවකින් මහණහුගේ කය පිළිබඳ වූවක් ආමර්‍ශනය කෙරෙත් ද, පරාමර්‍ශනය කෙරෙත් ද, ... ගණිත් ද, ස්පර්‍ශ කෙරෙත් ද, මහණ තෙම සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් කෙරෙයි ද, ස්පර්‍ශය දැන ගණියි ද, දුකුළාඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "12. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, ඒ දෙදෙනා පිළිබඳ ව ස්ත්‍රීහුය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, දෙදෙනා තමන්ගේ කය පිළිබඳ වූවකින් මහණහුගේ කය පිළිබඳ වූවක් ආමර්‍ශනය කෙරෙත් ද, පරාමර්‍ශනය කෙරෙත් ද, ... ගණිත් ද, ස්පර්‍ශ කෙරෙත් ද, මහණ තෙම සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් කෙරෙයි ද, ස්පර්‍ශය දැන ගණියි ද, දුකුළාඇවැත් දෙකෙකි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "13. ස්ත්‍රියකුදු වෙයි, ස්ත්‍රියක යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, ස්ත්‍රිය දමාලූ දෙයින් මහණහුගේ කය ආමර්‍ශනය කෙරෙයි ද, සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් කෙරෙයි ද, ස්පර්‍ශය දැන ගණියි ද, දුකුළාඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "14. ස්ත්‍රීහු දෙදෙනෙක් වෙත්, ඒ ස්ත්‍රීන් දෙදෙනා පිළිබඳ ව ස්ත්‍රීහු ය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, ස්ත්‍රීහු ද මුදාලූවකින් මහණහුගේ කය ආමර්‍ශනය කෙරෙත් ද, මහණ සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් කෙරෙයි ද, ස්පර්‍ශය දැන ගණියි ද, දුකුළාඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "15. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, ඒ දෙදෙනා පිළිබඳව ස්ත්‍රීහුය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, දෙදෙනා මුදාලූවකින් මහණහුගේ කය ආමර්‍ශනය කෙරෙත් ද, සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් කෙරෙයි ද, ස්පර්‍ශය දැන ගණියි ද, දුකුළාඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "16. ස්ත්‍රියකුදු වෙයි, ස්ත්‍රිය යන හැඟීම් ඇත්තේ, සංරක්තත් වෙයි, ස්ත්‍රීත් මුදාලූවකින් මහණහුගේ කය පිළිබඳ වූවක් ආමර්‍ශනය කෙරෙයි ද, සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් කෙරෙයි ද, ස්පර්‍ශය දැන ගණියි ද, දුකුළාඇවැත් වේ. ...",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 314,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "17. ද්වෙ ඉත්ථියො ද්වින්නං ඉත්ථීනං ඉත්ථිසඤ්ඤී සාරත්තො ච, ඉත්ථියො ච නං භික්ඛුස්ස නිස්සග්ගියෙන කායපටිබද්ධං ආමසන්ති. සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති ද්වින්නං දුක්කටානං -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "18. ඉත්ථී ච පණ්ඩකො ච, උභින්නං ඉත්ථිසඤ්ඤී සාරත්තො ච, උභො ච නං භික්ඛුස්ස නිස්සග්ගියෙන කායපටිබද්ධං ආමසන්ති, සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති ද්වින්නං දුක්කටානං -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "19. ඉත්ථී ච හොති ඉත්ථිසඤ්ඤී සාරත්තො ච, ඉත්ථී ච නං භික්ඛුස්ස නිස්සග්ගියෙන නිස්සග්ගියං ආමසති. සෙවනාධිප්පායො කායෙන වායමති, න ච ඵස්සං පටිවිජානාති, ආපත්ති දුක්කටස්ස -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "20. ද්වෙ ඉත්ථියො ද්වින්නං ඉත්ථීනං ඉත්ථිසඤ්ඤී සාරත්තො ච, ඉත්ථියො ච නං භික්ඛුස්ස නිස්සග්ගියෙන නිස්සග්ගියං ආමසන්ති. සෙවනාධිප්පායො කායෙන වායමති, න ච ඵස්සං පටිවිජානාති, ආපත්ති ද්වින්නං දුක්කටානං -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "21. ඉත්ථී ච පණ්ඩකො ච උභින්නං ඉත්ථිසඤ්ඤී සාරත්තො ච, උභො ච නං භික්ඛුස්ස නිස්සග්ගියෙන නිස්සග්ගියං ආමසන්ති, සෙවනාධිප්පායො කායෙන වායමති න ච ඵස්සං පටිවිජානාති, ආපත්ති ද්වින්නං දුක්කටානං -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "22. සෙවනාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, ආපත්ති සඞ්ඝාදිසෙසස්ස. සෙවනාධිප්පායො කායෙන වායමති න ච ඵස්සං පටිවිජානාති, ආපත්ති දුක්කටස්ස. සෙවනාධිප්පායො න ච කායෙන වායමති, ඵස්සං පටිවිජානාති, අනාපත්ති. සෙවනාධිප්පායො න ච කායෙන වායමති න ච ඵස්සං පටිවිජානාති, අනාපත්ති. මොක්ඛාධිප්පායො කායෙන වායමති ඵස්සං පටිවිජානාති, අනාපත්ති. මොක්ඛාධිප්පායො කායෙන වායමති න ච ඵස්සං පටිවිජානාති, අනාපත්ති.{1} මොක්ඛාධිප්පායො න ච කායෙන වායමති ඵස්සං පටිවිජානාති, අනාපත්ති. මොක්ඛාධිප්පායො න ච කායෙන වායමති න ච ඵස්සං පටිවිජානාති, අනාපත්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "23. අනාපත්ති අසඤ්චිච්ච, අසතියා, අජානන්තස්ස; අසාදියන්තස්ස, උම්මත්තකස්ස, ඛිත්තචිත්තස්ස, වෙදනට්ටස්ස{2}, ආදිකම්මිකස්සාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඉමස්මිං ඨානෙ බුද්ධජයන්ති තිපිටකමුද්දණෙ පමාදපාඨො විය දිස්සති."
                    },
                    {
                        "type": "footnote",
                        "text": "2. වෙදනාට්ටස්ස. මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "17. ස්ත්‍රීහු දෙදෙනෙක් වෙත්, ස්ත්‍රීන් දෙදෙනා පිළිබඳ ස්ත්‍රීහුය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, ස්ත්‍රීහුත් මුදාලූවකින් මහණහුගේ කය පිළිබඳ වූවක් ආමර්‍ශනය කෙරෙත් ද, මහණ තෙමේත් සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් කෙරෙයි ද, ස්පර්‍ශය දැන ගණියි ද, දුකුළාඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "18. ස්ත්‍රියකුදු පණ්ඩකයකුදු වෙත්, දෙදෙනා පිළිබඳව ස්ත්‍රීහු ය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, දෙදෙන මුදාලූවකින් මහණහුගේ කය පිළිබඳ වූවක් ආමර්‍ශනය කෙරෙත් ද, සෙවුනා අදහස් ඇත්තේ, එ මහණත් කයින් වෑයම් කෙරෙයි ද, ස්පර්‍ශය දැන ගණියි ද, දුකුළාඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "19. ස්ත්‍රියක් වෙයි, ස්ත්‍රිය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, ස්ත්‍රීය ද මහණහු පිළිබඳ මුදාලූවකින් මුදාලූවක් ආමර්‍ශනය කෙරෙයි ද, සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් කෙරෙයි ද, පහස නොදනියි ද, දුකුළාඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "20. ස්ත්‍රීහු දෙදෙනෙක් වෙත්, ස්ත්‍රීන් දෙදෙනා පිළිබඳ ව ස්ත්‍රීහුය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි, ස්ත්‍රීහුත් මුදාලූවකින් මහණහු පිළිබඳ මුදාලූවක් ආමර්‍ශනය කෙරෙත් ද, ඒ මහණ තෙමේ සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් කෙරෙයි ද, ස්පර්‍ශය නො ම දනියි ද, දුකුළැඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "21. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, දෙදෙනා පිළිබඳ ව ස්ත්‍රීහු ය යන හැඟීම් ඇත්තේ සංරක්තත් වෙයි ද, දෙදෙනා ම මුදාලූවකින් මහණහු පිළිබඳ මුදාලූවක් ආමර්‍ශනය කෙරෙත් ද, සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් කෙරෙයි ද, ස්පර්‍ශය නො ම දනියි ද, දුකුළාඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "22. සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් කෙරෙයි ද, ස්පර්‍ශය දනියි ද, සඟවෙසෙස් ඇවැත් වේ. සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් කෙරෙයි ද, පහස නොම දනියි ද, දුකුළාඇවැත් වේ. සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් නො කෙරෙයි ද, පහස දනියි ද, ඇවැත් නො වේ. සෙවුනා අදහස් ඇත්තේ කයින් වෑයම් නො කෙරෙයි ද, පහස නො ම දනියි ද, ඇවැත් නො වේ. මිදෙන අදහස් ඇත්තේ කයින් වෑයම් කෙරෙයි ද, පහස දනියි ද, ඇවැත් නො වේ. මිදෙන අදහස් ඇත්තේ කයින් වෑයම් කෙරෙයි ද, පහස නො ම දනියි ද, ඇවැත් නො වේ. මිදෙන අදහස් ඇත්තේ කයින් වෑයම් නො කෙරෙයි ද, පහස දනියි ද, ඇවැත් නොවේ. මිදෙන අදහස් ඇත්තේ කයින් වෑයම් නො කෙරෙයි ද, පහස නො ම දනියි ද, ඇවැත් නොවේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "23. නො දැන සිටියහුට ද, නො සිහියෙන් සිටියහුට ද නො දන්නහුට ද නොඉවසන්නහුට ද, උමතු වූවහුට ද, ඛෙදයට පැමිණි සිත් ඇත්තහුට ද, වේදනාවෙන් පෙළුනහුට ද, ආදිකම්මිකයාට ද, ඇවැත් නො වේ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 316,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "විනීතවත්ථු",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**උද්දානගාථා:**"
                    },
                    {
                        "type": "gatha",
                        "text": "මාතා ධීතා ච භගිනී ච ජායා යක්ඛී ච පණ්ඩකො,\nසුත්තා මතා තිරච්ඡානා දාරුධීතලිකාය ච.",
                        "level": 1
                    },
                    {
                        "type": "gatha",
                        "text": "සම්පීළෙ සඞ්කමො මග්ගො රුක්ඛො නාවා ච රජ්ජු ච,\nදණ්ඩො පත්තං පණාමෙසි වන්දෙ වායාමි නච්ඡුපෙති.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු මාතුයා මාතුපෙමෙන ආමසි. තස්ස කුක්කුච්චං අහොසි -පෙ- කච්චි නු ඛො අහං සඞ්ඝාදිසෙසං ආපත්තිං ආපන්නො’ති. භගවතො එතමත්ථං ආරොචෙසි. -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස. ආපත්ති දුක්කටස්සා”ති. (1)"
                    },
                    {
                        "type": "paragraph",
                        "text": "2. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු ධීතුයා ධීතුපෙමෙන ආමසි -පෙ- භගිනියා භගිනිපෙමෙන ආමසි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස. ආපත්ති දුක්කටස්සා”ති. (2-3)"
                    },
                    {
                        "type": "paragraph",
                        "text": "3. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු පුරාණදුතියිකාය කායසංසග්ගං සමාපජ්ජි. තස්ස කුක්කුච්චං අහොසි -පෙ- “ආපත්තිං ත්වං භික්ඛු ආපන්නො සඞ්ඝාදිසෙස”න්ති. (4)"
                    },
                    {
                        "type": "paragraph",
                        "text": "4. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු යක්ඛියා{1} කායසංසග්ගං සමාපජ්ජි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස. ආපත්ති ථුල්ලච්චයස්සා”ති. (5)"
                    },
                    {
                        "type": "paragraph",
                        "text": "5. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු පණ්ඩකස්ස කායසංසග්ගං සමාපජ්ජි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස. ආපත්ති ථුල්ලච්චයස්සා”ති. (6)"
                    },
                    {
                        "type": "paragraph",
                        "text": "6. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු සුත්තිත්ථියා කායසංසග්ගං සමාපජ්ජි. තස්ස කුක්කුච්චං අහොසි -පෙ- “ආපත්තිං ත්වං භික්ඛු ආපන්නො සඞ්ඝාදිසෙස”න්ති. (7)"
                    },
                    {
                        "type": "paragraph",
                        "text": "7. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු මතිත්ථියා කායසංසග්ගං සමාපජ්ජි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති ථුල්ලච්චයස්සා”ති. (8)"
                    },
                    {
                        "type": "paragraph",
                        "text": "8. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු තිරච්ඡානගතිත්ථියා කායසංසග්ගං සමාපජ්ජි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස. ආපත්ති දුක්කටස්සා”ති. (9)"
                    },
                    {
                        "type": "paragraph",
                        "text": "9. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු දාරුධීතලිකාය කායසංසග්ගං සමාපජ්ජි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති දුක්කටස්සා”ති. (10)"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. යක්ඛිනියා. මඡසං"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "විනිශ්චිතවස්තු",
                        "type": "heading",
                        "level": 1
                    },
                    {
                        "text": "උද්දානගාථා:",
                        "type": "unindented"
                    },
                    {
                        "text": "මාතු ධීතු භගිනි වත්‍ථුය, ජායා යක්ඛී පණ්ඩක වත්‍ථුය, සුත්ත මත තිරච්ඡානගත වත්‍ථුය, දාරුධීතලික වත්‍ථුය,",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "සමපීළන සංකම මග්ග වත්‍ථුය, රුක්ඛ නාවා රජ්ජු වත්‍ථුය, දණ්ඩ පත්ත පනාමන වන්දන නඡුපන වත්ථු ය යි විනීතවත්ථු විස්සකි."
                    },
                    {
                        "text": "1. එසමයෙහි එක්තරා මහණෙක් මාතෘප්‍රෙමයෙන් මවගේ සිරුර අත ගෑ ය. ඔහුට කුකුස් විය. ... කිම? මම සඟවෙසෙස්ඇවැත් අවන්නෙම් දැ?”යි භාග්‍යවතුන් වහන්සේට මෙ කරුණ සැළ කෙළේ ය. ... “මහණ සඟවෙසෙස් ඇවැත් නො වේ. දුකුළාඇවැත් වේ”ය යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. එසමයෙහි එක්තරා මහණෙක් දුහිතෘප්‍රෙමයෙන් දුවගේ සිරුර අත ගෑ ය. ... භගිනි ප්‍රෙමයෙන් බුහුනනියන්ගේ සිරුර අත ගෑය. ඒ මහණහට කුකුස් විය. ... “මහණ සඟවෙසෙස්ඇවැත් නො වේ. දුකුළාඇවැත් වේ”ය යි භාග්‍යවතුන් වහන්සේ වදාළ සේක. (2.3)",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. එසමයෙහි එක්තරා මහණෙක් ගිහිකල අඹුව හා කායසංසර්‍ගයට සමවනි. ඒ මහණහට කුකුස් විය. ... “මහණ, තෝ සඟවෙසෙස්ඇවැත් අවන්නෙහි ය”යි වදාළ සේක. (4)",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. එසමයෙහි එක්තරා මහණෙක් යකින්නක හා කාසසඟයට සමවනි. ඒ මහණහට කුකුස් විය. ... “මහණ, සඟවෙසෙස් ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළ සේක. (5.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "5. එසමයෙහි එක්තරා මහණෙක් පණ්ඩකයකු හා කාසසඟයට සමවනි. ඒ මහණට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”ය යි වදාළ සේක. (6.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "6. එසමයෙහි එක්තරා මහණෙක් නිදන ස්ත්‍රියක හා කාසසඟයට සමවනි. ඔහුට කුකුස් විය. ... “මහණ, තෝ සඟවෙසෙස්ඇවැත් අවන්නෙහි”ය යි වදාළ සේක. (7.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "7. එසමයෙහි එක්තරා මහණෙක් මළ ස්ත්‍රියක හා කාසසඟයට සමවනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”ය යි වදාළ සේක. (8.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "8. එසමයෙහි එක්තරා මහණෙක් තිරිසන්ගිය මාගමක හා කාසසඟයට සමවනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. දුකුළාඇවැත් වේ”යි වදාළ සේක. (9.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "9. එසමයෙහි එක්තරා මහණෙක් දඬුමුවා පෙතැලිරුවක් හා කාසසඟයට සමවනි. ඔහුට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. දුකුළාඇවැත් වේ”යි වදාළ සේක. (10.)",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 318,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "10. තෙන ඛො පන සමයෙන සම්බහුලා ඉත්ථියො අඤ්ඤතරං භික්ඛුං සම්පීළෙත්වා බාහාපරම්පරාය නෙසුං{1}. තස්ස කුක්කුච්චං අහොසි -පෙ- “සාදියි ත්වං භික්ඛු”ති. “නාහං භගවා සාදියි”න්ති. “අනාපත්ති භික්ඛූ අසාදියන්තස්සා”ති. (11)"
                    },
                    {
                        "type": "paragraph",
                        "text": "11. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු ඉත්ථියා අභිරූළ්හං සඞ්කමං සාරත්තො සඤ්චාලෙසි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති දුක්කටස්සා”ති. (12)"
                    },
                    {
                        "type": "paragraph",
                        "text": "12. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු ඉත්ථිං පටිපථෙ පස්සිත්වා සාරත්තො අංසකූටෙන පහාරං අදාසි. තස්ස කුක්කුච්චං අහොසි -පෙ- ආපත්තිං ත්වං භික්ඛු ආපන්නො සඞ්ඝාදිසෙස”න්ති. (13)"
                    },
                    {
                        "type": "paragraph",
                        "text": "13. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු ඉත්ථියා අභිරූළ්හං රුක්ඛං සාරත්තො සඤ්චාලෙසි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස. ආපත්ති දුක්කටස්සා”ති. (14)"
                    },
                    {
                        "type": "paragraph",
                        "text": "14. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු ඉත්ථියා අභිරූළ්හං නාවං සාරත්තො සඤ්චාලෙසි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස. ආපත්ති දුක්කටස්සා”ති. (15)"
                    },
                    {
                        "type": "paragraph",
                        "text": "15. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු ඉත්ථියා ගහිතං රජ්ජුං සාරත්තො ආවිඤ්ජි{2} තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස. ආපත්ති ථුල්ලච්චයස්සා”ති. (16)"
                    },
                    {
                        "type": "paragraph",
                        "text": "16. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු ඉත්ථියා ගහිතං දණ්ඩං සාරත්තො ආවිඤ්ජි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස. ආපත්ති ථුල්ලච්චයස්සා”ති. (17)"
                    },
                    {
                        "type": "paragraph",
                        "text": "17. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු සාරත්තො ඉත්ථිං පත්තෙන පණාමෙසි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස. ආපත්ති ථුල්ලච්චයස්සා”ති. (18)"
                    },
                    {
                        "type": "paragraph",
                        "text": "18. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු ඉත්ථියා වන්දන්තියා සාරත්තො පාදං උච්චාරෙසි. තස්ස කුක්කුච්චං අහොසි -පෙ- “ආපත්තිං ත්වං භික්ඛු ආපන්නො සඞ්ඝාදිසෙස”න්ති. (19)"
                    },
                    {
                        "type": "paragraph",
                        "text": "19. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු ඉත්ථිං ගහෙස්සාමීති වායමිත්වා න ඡුපි. තස්ස කුක්කුච්චං අහොසි -පෙ- අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස; ආපත්ති දුක්කටස්සා”ති. (20)"
                    },
                    {
                        "type": "centered",
                        "text": "කාය සංසග්ගසික්ඛාපදං නිට්ඨිතං{3}",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ආනෙසුං. මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ආවිඤ්ඡි. මඡසං"
                    },
                    {
                        "type": "footnote",
                        "text": "3. කායසංසග්ගසික්ඛාපදං නිට්ඨිතං දුතියං. මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "10. එසමයෙහි බොහෝ ස්ත්‍රිහු එක්තරා මහණකු පෙළා අතිනතින් පැමිණවූහ. ඒ මහණහට කුකුස් වීය. ... “මහණ, තෝ ඉවසුයෙහි දැ?”යි අසා වදාළ සේක. “භාග්‍යවතුන් වහන්ස, මම නො ඉවසීම්”යී හේ කීය. “මහණ, නො ඉවසන්නහුට ඇවැත් නො වේ”යී වදාළ සේක. (11.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "11. එසමයෙහි එක්තරා මහණෙක් සංරක්ත වූයේ ස්ත්‍රියක නැගුනු ඒදණ්ඩක් සෙලවී ය. ඒ මහණහට කුකුස් විය. ... “මහණ, සඟවෙසෙස් ඇවැත් නො වේ. දුකුළා ඇවැත් වේ”යි වදාළ සේක. (12.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "12. එසමයෙහි එක්තරා මහණෙක් පෙරමග ස්ත්‍රියක දැක සංරක්ත වූයේ උරහිසින් පහර දිනි. ඒ මහණහට කුකුස් වීය. ... “මහණ, තෝ සඟවෙසෙස් ඇවැත් අවන්නෙහි”ය යි වදාළ සේක. (13.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "13. එසමයෙහි එක්තරා මහණෙක් සංරක්ත වූයේ ස්ත්‍රියක නැගුනු ගසක් සෙලවී ය. ඒ මහණහට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. දුකුළාඇවැත්වේ”යි වදාළ සේක. (14.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "14. එසමයෙහි එක්තරා මහණෙක් සංරක්ත වූයේ ස්ත්‍රියක නැගුනු ඔරුවක් සෙලවී ය. ඒ මහණහට කුකුස් විය. “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. දුකුළාඇවැත් වේ”යි වදාළ සේක. (15.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "15. එසමයෙහි එක්තරා මහණෙක් සංරක්ත වූයේ ස්ත්‍රියක ගත් රැහනක්ඇද්දේ ය. ඒ මහණහට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලසිඇවැත් වේ”යි වදාළ සේක. (16.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "16. එසමයෙහි එක්තරා මහණෙක් සංරක්තවූයේ ස්ත්‍රියක ගත් දඬුකඩක් ඇද්දේ ය. ඒ මහණහට කුකුස් වීය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළ සේක. (17.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "17. එසමයෙහි එක්තරා මහණෙක් සංරක්ත වූයේ ස්ත්‍රියක පාත්‍රයෙන් දුරු කෙළේ ය. ඒ මහණහට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළ සේක. (18.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "18. එසමයෙහි එක්තරා මහණෙක් සංරක්ත වූයේ ස්ත්‍රියක වඳින කල්හි පය එසවී ය. ඒ මහණහට කුකුස් විය. ... “මහණ, තෝ සඟවෙසෙස්ඇවැත් අවන්නෙහි ය”යි වදාළ සේක. (19.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "19. එසමයෙහි එක්තරා මහණෙක් ස්ත්‍රියක අල්ලා ගණිමි යි වෑයම් කොට ස්පර්‍ශ නො කෙළේ ය. ඒ මහණහට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. දුකුළාඇවැත් වේ”යි වදාළ සේක. (20.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "කායසංසර්‍ග ශික්ෂාපදය නිමි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 320,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුට්ඨුල්ලවාචාසික්ඛාපදං",
                        "level": 2
                    },
                    {
                        "type": "paragraph",
                        "text": "1. තෙන සමයෙන බුද්ධො භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තෙන ඛො පන සමයෙන ආයස්මා **උදායී** අරඤ්ඤෙ විහරති. තස්සායස්මතො විහාරො අභිරූපො හොති දස්සනීයො පාසාදිකො. තෙන ඛො පන සමයෙන සම්බහුලා ඉත්ථියො ආරාමං ආගමංසු විහාරපෙක්ඛිකායො. අථ ඛො තා ඉත්ථියො යෙනා යස්මා උදායී, තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා ආයස්මන්තං උදායිං එතදවොචුං: “ඉච්ඡාම මයං භන්තෙ අය්යස්ස විහාරං පෙක්ඛිතු”න්ති. අථ ඛො ආයස්මා උදායී තා ඉත්ථියො විහාරං පෙක්ඛාපෙත්වා තාසං ඉත්ථිනං වච්චමග්ගං පස්සාවමග්ගං ආදිස්ස වණ්ණම්පි භණති අවණ්ණම්පි භණති. යාචති’පි ආයාචති’පි පුච්ඡති’පි පටිපුච්ඡති’පි, ආචික්ඛති’පි අනුසාසති’පි, අක්කොසති’පි. යා තා ඉත්ථියො ඡින්නිකා ධුත්තිකා අහිරිකායො තා ආයස්මතා උදායිනා සද්ධිං ඌහසන්ති’පි උල්ලපන්ති’පි උජ්ඣග්ඝන්ති’පි උප්පණ්ඩෙන්ති’පි. යා පන තා ඉත්ථියො හිරිමනා තා නික්ඛමිත්වා භික්ඛූ උජ්ඣාපෙන්ති: “ඉදං භන්තෙ නච්ඡන්නං නප්පතිරූපං, සාමිකෙනපි මයං එවං වුත්තා න ඉච්ඡෙය්යාම, කිමිපනාය්යෙන උදායිනා”ති. යෙ තෙ භික්ඛූ අප්පිච්ඡා තෙ උජ්ඣායන්ති ඛීයන්ති විපාචෙන්ති: “කථං හි නාම ආයස්මා උදායී මාතුගාමං දුට්ඨුල්ලාහි වාචාහි ඔභාසිස්සතී”ති. අථ ඛො තෙ භික්ඛූ භගවතො එතමත්ථං ආරොචෙසුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "2. අථ ඛො භගවා එතස්මිං නිදානෙ එතස්මිං පකරණෙ භික්ඛුසඞ්ඝං සන්නිපාතාපෙත්වා ආයස්මන්තං උදායිං පටිපුච්ඡි: “සච්චං කිර ත්වං උදායී මාතුගාමං දුට්ඨුල්ලාහි වාචාහි ඔභාසී”ති. “සච්චං, භගවා. විගරහි බුද්ධො භගවා: “අනනුච්ඡවියං මොඝපුරිස අනනුලොමිකං අප්පතිරූපං අස්සාමණකං අකප්පියං අකරණීයං. කථං හි නාම ත්වං මොඝපුරිස මාතුගාමං දුට්ඨුල්ලාහි වාචාහි ඔභාසිස්සසි. නනු මයා මොඝපුරිස අනෙකපරියායෙන විරාගාය ධම්මො දෙසිතො, නො සරාගාය -පෙ- කාමපරිළාහානං වූපසමො අක්ඛාතො. නෙතං මොඝපුරිෙ අප්පසන්නානං වා පසාදාය -පෙ- එවං ච පන භික්ඛවෙ ඉමං සික්ඛාපදං උද්දිසෙය්යාථ:"
                    },
                    {
                        "type": "paragraph",
                        "text": "**“යො පන භික්ඛු ඔතිණ්ණො විපරිණතෙන චිත්තෙන මාතුගාමං දුට්ඨුල්ලාහි වාචාහි ඔභාසෙය්ය යථා තං යුවා යුවතිං මෙථුනූපසංහිතාහි, සඞ්ඝාදිසෙසො”**ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "3. **යො පනා’**ති යො යාදිසො -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "**භික්ඛූ**ති -පෙ- අයං ඉමස්මිං අත්ථෙ අධිප්පෙතො භික්ඛූති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ඔතිණ්ණො** නාම සාරත්තො අපෙක්ඛවා පටිබද්ධචිත්තො."
                    }
                ],
                "footnotes": []
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "3. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුට්ඨුල්ලවාචාශික්‍ෂාපදය",
                        "level": 2
                    },
                    {
                        "text": "1. එසමයෙහි භාග්‍යවත් බුදුරජානන් වහන්සේ සැවැත්නුවර ජේතවන නම් අනේපිඬුසිටුහුගේ අරම්හි වාසය කරණ සේක. එසමයෙහි ආයුෂ්මත් උදායී තෙමේ අරණෙහි වෙසෙයි. ඒ ආයුෂ්මත් උදායී තෙරුන්ගේ විහාරය මනරම් ය. දැකුම්කලු ය. ප්‍රසාද එළවන්නේ ය. එසමයෙහි බොහෝ ස්ත්‍රීහු සෙනස්න බැලියැටි වූවාහු ඒ අරමට පැමිණියාහු ය. ඉක්බිති ඒ ස්ත්‍රීහු ආයුෂ්මත් උදායී තෙරුන් කරා එළඹියාහු ය. එළඹ ආයුෂ්මත් උදායී හට “ස්වාමීනි, ආර්‍ය්‍යයන් වහන්සේගේ විහාරය බලන්නට අපි කැමැත්තෙමු”යි කීහ. ඉක්බිති ආයුෂ්මත් උදායී තෙමේ ඒ ස්ත්‍රීන්ට විහාරය පෙන්වා ඒ ස්ත්‍රීන්ගේ වසමග පසමග ලක් කොට ගුණ ද කියයි. අගුණ ද කියයි. යදනේත් වෙයි. අයදනේත් වෙයි. විචාරණුයේත් වෙයි. පුළුවුස්නේත් වෙයි. අනුසස්නේත් වෙයි. හවන්නේත් වෙයි. යම් ඒ ස්ත්‍රී කෙනෙක් සුන් ඔතප් ඇත්තෝ සඨ වූවෝ ලජ්ජා නැත්තෝ වෙත් ද, ඔහු ආයුෂ්මත් උදායී තෙරුන් සමග මඳ සිනා පහළ කරන්නෝත් වෙත්. පොළඹවන බස් දොඩන්නෝත් වෙත්. මහ හඬින් සිනා සෙන්නෝ ද වෙත්. පරිහාස ද කෙරෙත්. යම් ඒ ස්ත්‍රී කෙනෙක් ලජ්ජා ඇත්තාහු ද ඔහු නික්ම ‘වහන්ස, මෙය නුසුදුසු ය. යෝග්‍ය නො වෙයි. හිමියා විසිනුදු මෙසේ කියන ලද්දා වූ අපි නො රුස්නෙමු. උදායී ආර්‍ය්‍යයන් වහන්සේ විසින් කියන ලදුමෝ කිම රුස්නමෝ ද?”යි භික්‍ෂූන්ට අවඥා කරත්. යම් ඒ අපිස් මහණහු වෙත් ද ඔහු “කෙසේ නම් ආයුෂ්මත් උදායී තෙමේ මාගමුන්ට වසමග පසමග ඇරැබ තුළුල් තෙපුලින් ඔවස් බෙණේ ද?”යි අවඥා කෙරෙත්. අයුණු කියත්. දොස් පතුරුවත්. ඉක්බිති ඒ භික්‍ෂූහු භාග්‍යවතුන් වහන්සේට මෙ පවත් සැළ කළහ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. ඉක්බිති භාග්‍යවතුන් වහන්සේ මේ නිදානයෙහි මේ කාරණයෙහි භික්‍ෂුසඞ්ඝයා රැස්කරවා “උදායී, තෝ මාගමට තුළුල් තෙප්ලෙන් ඔවස් බිණූයෙහි සැබෑ ද?”යි ආයුෂ්මත් උදායී තෙරුන් පුළුවුත් සේක. “සැබව, භාග්‍යවතුන් වහන්සැ”යි හේ කීය. භාග්‍යවත් බුදුරජානන් වහන්සේ වදාරණ සේක්, “හිස් පුරුෂය, නුසුදුසු ය. අනුලොම් නො වෙයි. යෝග්‍ය නො වෙයි. මහණුන්ට නො ගැළපෙන්නෙක. නො කැප ය. නොකටයුත්තක. හිස් පුරුෂය, කවර කරුණකින් තෝ මාගමට තුළුල් තෙප්ලෙන් පහත් ලෙස බිණූයෙහි ද? හිස් පුරුෂය, මා විසින් සරාගය පිණිස නො ව විරාගය පිණිස නන් අයුරින් දහම් දෙසන ලද්දේ නො වේ ද? කාමපරිදාහයන්ගේ සංසිඳීම කියන ලද්දේ නො වේ ද? හිස් පුරුෂය, මෙය නොපහන් වූවන්ගේ පහන් බව පිණිස නො වේ”යි ... ගැරහූ සේක. ඉක්බිති මෙය වදාළ සේක: මහණෙනි, මෙසේ මේ සිකපදය උදෙසවු:",
                        "type": "paragraph"
                    },
                    {
                        "text": "**“යම් මහණෙක් තුළුල් තෙපුල් කියැටි රායෙන් මඩනා ලද්දේ පෙරළි සිතින් මිනිස් මාගමකට වසමග පසමග ඇරැබ මෙවුන්දම් පිළිබඳ තුළුල් තෙප්ලෙන් තරුණයකු තරුණියකට මෙන් ඔවස් බෙණේ නම් ඒ මහණහට සඟවෙසෙස් ඇවැත් වේ.”**",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. යොපන යනු යමෙක්, යම්බඳු වූයෙක් ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "භික්ඛු යනු ... මේ අරුත්හි මේ තෙමේ භික්‍ෂු ය යි අභිමත යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඔතිණ්ණ නම්: ඇලුම් ඇත්තේ, අපේක්‍ෂා ඇත්තේ, පිළිබඳ සිතැත්තේ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 322,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "**විපරිණත**න්ති රත්තම්පි චිත්තං විපරිණතං, දුට්ඨම්පි චිත්තං විපරිණතං, මූළ්හම්පි චිත්තං විපරිණතං. අපිච රත්තං චිත්තං ඉමස්මිං අත්ථෙ අධිප්පෙතං විපරිණතන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**මාතුගාමො** නාම: මනුස්සිත්ථි, න යක්ඛී න පෙතී න තිරච්ඡානගතා, විඤ්ඤූ පටිබලා සුභාසිතදුබ්භාසිතං දුට්ඨුල්ලාදුට්ඨුල්ලං ආජානිතුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**දුට්ඨුල්ලා වාචා** නාම:වච්චමග්ගපස්සාවමග්ගමෙථුනධම්මප්පටිසංයුත්තා වාචා."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ඔභාසෙය්යා**ති අජ්ඣාචාරො වුච්චති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යථා තං යුවා යුවති**න්ති දහරො දහරිං තරුණො තරුණිං කාමභොගී කාමභොගිනිං."
                    },
                    {
                        "type": "paragraph",
                        "text": "**මෙථුනූපසංහිතාහී**ති මෙථුනධම්මප්පටිසංයුත්තාහි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**සඞ්ඝාදිසෙසො’**ති -පෙ- තෙනපි වුච්චති සඞ්ඝාදිසෙසො’ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "4. ද්වෙ මග්ගෙ ආදිස්ස වණ්ණම්පි භණති, අවණ්ණම්පි භණති, යාචති’පි, ආයාචති’පි, පුච්ඡති’පි, පටිපුච්ඡති’පි, ආචික්ඛති’පි, අනුසාසති’පි, අක්කොසති’පි."
                    },
                    {
                        "type": "paragraph",
                        "text": "**වණ්ණං භණති** නාම: ද්වෙ මග්ගෙ ථොමෙති වණ්ණෙති පසංසති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අවණ්ණං භණති** නාම: ද්වෙ මග්ගෙ ඛුංසෙති වම්භෙති ගරහති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**යාචති** නාම: දෙහි මෙ අරහසි මෙ දාතුන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ආයාචති** නාම: කදා තෙ මාතා පසීදිස්සති, කදා තෙ පිතා පසීදිස්සති, කදා තෙ දෙවතායො පසීදිස්සන්ති, කදා{1} සුඛණො සුලයො සුමුහුත්තො භවිස්සති, කදා තෙ මෙථුනං ධම්මං ලභිස්සාමී{2}ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**පුච්ඡති** නාම: කථං ත්වං සාමිකස්ස දෙසි{3} කථං ජාරස්ස දෙසී3ති?"
                    },
                    {
                        "type": "paragraph",
                        "text": "**පටිපුච්ඡති** නාම: එවං කිර ත්වං සාමිකස්ස දෙසි{3} එවං ජාරස්ස දෙසී3ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**ආචික්ඛති** නාම: පුට්ඨො භණති “එවං දෙහි, එවං දෙන්තී{4} සාමිකස්ස පියා භවිස්සසි මනාපා චා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අනුසාසති** නාම: අපුට්ඨො භණති, “එවං දෙන්තී{1} සාමිකස්ස පියා භවිස්සති මනාපා චා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "**අක්කොසති** නාම: අනිමිත්තා’සි නිමිත්තමත්තා’සි අලොහිතා’සි ධුවලොහිතා’සි ධුවචොලා’සි පග්ඝරන්තී’සි සිඛරිණී’සි ඉත්ථිපණ්ඩකා’සි වෙපුරිසිකා’සි සම්භින්නා’සි උභතොබ්යඤ්ජනාසීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. කදා තෙ. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ලභිස්සසීති. සී. මු."
                    },
                    {
                        "type": "footnote",
                        "text": "3. දෙහි, දෙහීති. සී. මු."
                    },
                    {
                        "type": "footnote",
                        "text": "4. දෙන්තා, මජසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "විපරිණතං යනු: රාගයෙන් රත් වූ සිත ද විපරිණත ය, ද්වේෂයෙන් ද්විෂ්ට වූ සිත ද විපරිණත ය, මෝහයෙන් මූඪ වූ සිත ද විපරිණත ය. වැලිත් මේ අර්ථයෙහි රාගයෙන් රත් වූ සිත විපරිණතය යි අභිමත යි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මාතුගාම නම්: මිනිස් මාගමකි. යකින්නක් නො වෙයි. ප්‍රේතියක් නො වෙයි. තිරිසන් ගිය මාගමක් ද නො වෙයි. සුබැසි දුබැසි තුළුල් නොතුළුල් තෙපුල් දැන ගැණීමට සමත් නුවණැති මාගම කි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "දුට්ඨුල්ලවාචා නම්: වසමග පසමග මෙවුන්දම් පිළිබඳ තෙපුල් ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ඔහාසෙය්‍ය යනුයෙන් ආචාරව්‍යතික්‍රමය කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "යථා තං යුවා යුවතිං යනු ගම්දරුවකු ගම්දැරියකට තරුණයකු තරුණියකට කම්සැප විඳින්නකු කම්සැප විඳින්නියකට කථා කරන්නාක් මෙනි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "මෙථුනූපසංහිතා යනු: මෙවුන්දම් පිළිබඳ තෙපුලින් ය.",
                        "type": "paragraph"
                    },
                    {
                        "text": "සඞ්ඝාදිසෙසො යනු ... එයිනුදු සඟවෙසෙස යි කියනු ලැබේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. දෙමග ඇරැබ ගුණත් කියයි. අගුණත් කියයි. යදින්නේත් වෙයි. අයදින්නේත් වෙයි. විචාරන්නේත් වෙයි. පුළුවුස්නේත් වෙයි. කියන්නේත් වෙයි. අනුශාසනා කරන්නේත් වෙයි. ආක්‍රොශ කරන්නේත් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ගුණ කියයි යනු: දෙමග ගුණ කියයි. වණයි. පසසයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අගුණ කියයි යනු: ගරහයි, අවමන් කෙරෙයි, නින්‍දා කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "යදියි යනු: ‘මට දෙව, මට දීමට සුදුස්සෙහි ය’යි කියයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අයදියි යනු: කවරදා තීගේ මවු තුටු වන්නී ද? කවරදා තීගේ පියා තුටු වන්නේ ද? කවරදා තීගේ (ඉටු) දෙවියෝ පහදින්නාහු ද? කවරදා සුබ ක්‍ෂණය, සුබ ලය, සුබ මොහොත වන්නේ ද? කවරදා තිගේ මෙවුන්දම් ලබන්නෙම් ද? යී කියයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "විචාරයි යනු: ‘කෙසේ නම් තෝ සැමියාට දෙයි ද? කෙසේ නම් තෝ සොර සැමියාට දෙයි ද? යි ප්‍රශ්න කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "පිළිවිසියි යනු: ‘මෙසේ තෝ සැමියාට දෙයිල මෙසේ තෝ සොරසැමියාට දෙයිල’යි පිළිවිසියි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "කියයි යනු: විචාරන ලද්දේ “මෙසේ දෙව. මෙසේ දෙන්නිය හිමියාට ප්‍රිය ද මන වඩන්නී ද වන්නීය”යි කියයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "අනුශාසන කෙරෙයි යනු: නො විචාරණ ලද්දේ “මෙසේ දෙන්නිය සැමියාට ප්‍රිය වන්නී ය, මන වඩන්නීය”යි කියයි.",
                        "type": "paragraph"
                    },
                    {
                        "text": "ආක්‍රොශ කෙරෙයි යනු: ‘නිමිත්ත නැත්තී වෙහි, නොපිරිපුන් නිමිත්ත ඇත්තී වෙහි, ඔසප් නැත්තී වෙහි, නිති ඔසප් ඇත්තී වෙහි, නිති දරණ පිළි කඩ ඇත්තී වෙහි, මූ වගුරුවන්නී වෙහි, හිවී ගිය මස් ඇත්තී වෙහි, ස්ත්‍රීපණ්ඩක වෙහි, පිරිමි අයුරු ඇත්තී වෙහි, මුසු වූ හදන් ඇත්තී වෙහි, දෙහදන් ඇත්තී වෙහි’යි කියයි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 324,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "1. ඉත්ථි ච හොති, ඉත්ථිසඤ්ඤී, සාරත්තො ච. භික්ඛු ච නං ඉත්ථියා වච්චමග්ගං පස්සාවමග්ගං ආදිස්ස වණ්ණම්පි භණති අවණ්ණම්පි භණති යාචති’පි ආයාචති’පි පුච්ඡති’පි පටිපුච්ඡති’පි, ආචික්ඛති’පි, අනුසාසති’පි, අක්කොසති’පි, ආපත්ති සඞ්ඝාදිසෙසස්ස -පෙ-{1}"
                    },
                    {
                        "type": "paragraph",
                        "text": "2. ද්වෙ ඉත්ථියො, ද්වින්නං ඉත්ථිනං ඉත්ථිසඤ්ඤී, සාරත්තො ච. භික්ඛු ච නං ද්වින්නං ඉත්ථිනං වච්චමග්ගං පස්සාවමග්ගං ආදිස්ස වණ්ණම්පි භණති අවණ්ණංපි භණති -පෙ- අක්කොසති’පි, ආපත්ති ද්වින්නං සඞ්ඝාදිසෙසානං -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "3. ඉත්ථි ච පණ්ඩකො ච, උභින්නං ඉත්ථිසඤ්ඤී, සාරත්තො ච. භික්ඛු ච නං උභින්නං වච්චමග්ගං පස්සාවමග්ගං ආදිස්ස වණ්ණම්පි භණති අවණ්ණම්පි භණති -පෙ- අක්කොසති’පි, ආපත්ති සඞ්ඝාදිසෙසෙන දුක්කටස්ස -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "4. ඉත්ථි ච හොති, ඉත්ථිසඤ්ඤී, සාරත්තො ච. භික්ඛු ච නං ඉත්ථියා වච්චමග්ගං පස්සාවමග්ගං ඨපෙත්වා අධක්ඛකං උබ්භජාණුමණ්ඩලං ආදිස්ස වණ්ණම්පි භණති අවණ්ණම්පි භණති -පෙ- අක්කොසති’පි, ආපත්ති ථුල්ලච්චයස්ස -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "5. ද්වෙ ඉත්ථියො, ද්වින්නං ඉත්ථිනං ඉත්ථිසඤ්ඤී, සාරත්තො ච. භික්ඛු ච නං ද්වින්නං ඉත්ථිනං වච්චමග්ගං පස්සාවමග්ගං ඨපෙත්වා අධක්ඛකං උබ්භජාණුමණ්ඩලං ආදිස්ස වණ්ණම්පි භණති අවණ්ණම්පි භණති -පෙ- අක්කොසති’පි, ආපත්ති ද්වින්නං ථුල්ලච්චයානං -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "6. ඉත්ථි ච පණ්ඩකො ච, උභින්නං ඉත්ථිසඤ්ඤී, සාරත්තො ච. භික්ඛු ච නං උභින්නං වච්චමග්ගං පස්සාවමග්ගං ඨපෙත්වා අධක්ඛකං උබ්භජාණුමණ්ඩලං ආදිස්ස වණ්ණම්පි භණති අවණ්ණම්පි භණති -පෙ- අක්කොසතිපි, ආපත්ති ථුල්ලච්චයෙන දුක්කටස්ස -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "7. ඉත්ථි ච හොති, ඉත්ථිසඤ්ඤී, සාරත්තො ච. භික්ඛු ච නං ඉත්ථියා උබ්භක්ඛකං අධොජාණුමණ්ඩලං ආදිස්ස වණ්ණම්පි භණති අවණ්ණම්පි භණති -පෙ- අක්කොසති’පි, ආපත්ති දුක්කටස්ස -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "8. ද්වෙ ඉත්ථියො, ද්වින්නං ඉත්ථිනං ඉත්ථිසඤ්ඤී, සාරත්තො ච. භික්ඛු ච නං ද්වින්නං ඉත්ථිනං උබ්භක්ඛකං අධොජාණුමණ්ඩලං ආදිස්ස වණ්ණම්පි භණති අවණ්ණම්පි භණති -පෙ- අක්කොසති’පි, ආපත්ති ද්වින්නං දුක්කටානං -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "9. ඉත්ථි ච පණ්ඩකො ච, උභින්නං ඉත්ථිසඤ්ඤී, සාරත්තො ච. භික්ඛු ච නං උභින්නං උබ්භක්ඛකං අධොජාණුමණ්ඩලං ආදිස්ස වණ්ණම්පි භණති අවණ්ණම්පි භණති -පෙ- අක්කොසති’පි, ආපත්ති ද්වින්නං දුක්කටානං -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "10. ඉත්ථි ච හොති, ඉත්ථිසඤ්ඤී, සාරත්තො ච. භික්ඛු ච නං ඉත්ථියා කායපටිබද්ධං ආදිස්ස වණ්ණම්පි භණති අවණ්ණම්පි භණති -පෙ- අක්කොසති’පි, ආපත්ති දුක්කටස්ස -පෙ-"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පෙය්යාලමුඛෙන කායසංසග්ගෙ චුත්තනයොව වෙදිතබ්බො."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "1. ස්ත්‍රියකුදු වෙයි, ‘ස්ත්‍රිය’ යන හැඟීම් ඇති ඇලුනු මහණෙකුදු වෙයි, ස්ත්‍රියගේ වසමග පසමග ඇරැබ ගුණ කියයි ද, අගුණ කියයි ද, යදියි ද, අයදියි ද, විචාරයි ද, පිළිවිසියි ද, බෙණෙයි ද, අනුශාසනා කෙරෙයි ද, ආක්‍රොශ කෙරෙයි ද, සඟවෙසෙස් ඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. ස්ත්‍රීහු දෙදෙනෙක් වෙත්, මහණ තෙම ස්ත්‍රීන් දෙදෙනා පිළිබඳ ව ‘ස්ත්‍රිය’ යන හැඟීම් ඇත්තේ, ඇලුනේ ද, වෙයි, ස්ත්‍රීන් දෙදෙනාගේ වසමග පසමග ඇරැබ ගුණ කියයි ද, අගුණ කියයි ද ... ආක්‍රොශ කෙරෙයි ද සඟවෙසෙස්ඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, මහණ තෙම දෙදෙනා පිළිබඳ ව ‘ස්ත්‍රිය’ යන හැඟීම් ඇත්තේ, ඇලුනේ ද, වෙයි, ස්ත්‍රීන් දෙදෙනාගේ වසමග පසමග ඇරැබ ගුණ කියයි ද, අගුණ කියයි ද ... ආක්‍රොශ කෙරෙයි ද, සඟවෙසෙස් හා දුකුළාඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. ස්ත්‍රියකුදු වෙයි, මහණතෙම ‘ස්ත්‍රිය’ යන හැඟීම් ඇත්තේ, ඇලුනේ ද, වෙයි. ස්ත්‍රියගේ වසමග පසමග හැර අකුඇටින් යට දෙදණ මඩලින් මතු ගුණ කියයි ද, අගුණ කියයි ද, ආක්‍රොශ කෙරෙයි ද ථුලැසි වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "5. ස්ත්‍රීහු දෙදෙනෙක් වෙත්, මහණ තෙම ස්ත්‍රීන් දෙදෙනා පිළිබඳව ‘ස්ත්‍රිය’ යන හැඟීම් ඇත්තේ, ඇලුනේ ද වෙයි. ස්ත්‍රීන් දෙදෙනා පිළිබඳ වසමග පසමග හැර අකුඇටින් යට දෙදණ මඩලින් උඩ ගුණ කියයි ද, අගුණ කියයි ද ... ආක්‍රොශ කෙරෙයි ද, ථුලැසිඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "6. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, මහණ තෙමේ දෙදෙනා පිළිබඳව ‘ස්ත්‍රිය’ යන හැඟීම් ඇත්තේ, ඇලුනේ ද වෙයි. දෙදෙනාගේ වසමග පසමග හැර අකුඇටින් යට දෙදණ මඩලින් මතු ගුණ කියයි ද, අගුණ කියයි ද ... ආක්‍රොශ කෙරෙයි ද ථුලැසි හා දුකුළාඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "7. ස්ත්‍රියක් ද වෙයි, මහණ තෙමේ ‘ස්ත්‍රියක’ යන හැඟීම් ඇත්තේ, ඇලුම් ඇත්තේ ද වෙයි. ස්ත්‍රියගේ අකුඇටින් මතු දෙදෙණ මඩලින් යට ගුණ කියයි ද, අගුණ කියයි ද, ... ආක්‍රොශ කෙරෙයි ද, දුකුළාඇවැත් වේ. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "8. ස්ත්‍රීහු දෙදෙනක් වෙත්, මහණ තෙමේ ස්ත්‍රීන් දෙදෙනා පිළිබඳව ‘ස්ත්‍රිය’ යන හැඟීම් ඇත්තේ, ඇලුනේ ද වෙයි. ස්ත්‍රීන් දෙදෙනාගේ අකුඇටින් මතු දෙදණ මඩලින් යට ගුණ කියයි ද, අගුණ කියයි ද ... ආක්‍රොශ කෙරෙයි ද දුකුළාඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "9. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්, මහණ තෙමේ දෙදෙනා පිළිබඳ ‘ස්ත්‍රිය’ යන හැඟීම් ඇත්තේ, ඇලුනේ ද වෙයි. දෙදෙනාගේ අකුඇටින් මතු දෙදණ මඩලින් යට ගුණ කියයි ද, අගුණ කියයි ද ... ආක්‍රොශ කෙරෙයි ද දුකුළාඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "10. ස්ත්‍රියක් ද වෙයි, මහණ තෙමේ ‘ස්ත්‍රිය’ යන හැඟීම් ඇත්තේ, ඇලුනේ ද වෙයි. ස්ත්‍රියගේ කය පිළිබඳ වූ වස්ත්‍රාදිය ඇරැබ ගුණ කියයි ද, අගුණ කියයි ද, ... ආක්‍රොශ කෙරෙයි ද, දුකුළාඇවැත් වේ. ...",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 326,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "11. ද්වෙ ඉත්ථියො, ද්වින්නං ඉත්ථිනං ඉත්ථිසඤ්ඤී, සාරත්තො ච. භික්ඛු ච නං ද්වින්නං ඉත්ථිනං කායපටිබද්ධං ආදිස්ස වණ්ණම්පි භණති අවණ්ණම්පි භණති -පෙ- අක්කොසති’පි, ආපත්ති ද්වින්නං දුක්කටානං -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "12. ඉත්ථි ච පණ්ඩකො ච, උභින්නං ඉත්ථිසඤ්ඤී, සාරත්තො ච. භික්ඛු ච නං උභින්නං කායපටිබද්ධං ආදිස්ස වණ්ණම්පි භණති අවණ්ණම්පි භණති -පෙ- අක්කොසති’පි, ආපත්ති ද්වින්නං දුක්කටානං -පෙ-"
                    },
                    {
                        "type": "paragraph",
                        "text": "13. අනාපත්ති අත්ථපුරෙක්ඛාරස්ස, ධම්මපුරෙක්ඛාරස්ස, අනුසාසනීපුරෙක්ඛාරස්ස, උම්මත්තකස්ස, ආදිකම්මිකස්සාති."
                    },
                    {
                        "type": "heading",
                        "text": "විනීතවත්ථු",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**උද්දානගාථා:**"
                    },
                    {
                        "type": "gatha",
                        "text": "ලොහිතං කක්කසාකිණ්ණං ඛරං දීඝඤ්ච වාපිතං\nකච්චි සංසීදති{1} මග්ගො සද්ධා දානෙන කම්මුනා’ති.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "1. තෙන ඛො පන සමයෙන අඤ්ඤතරා ඉත්ථි නවරත්තං කම්බලං පාරුතා හොති. අඤ්ඤතරො භික්ඛු සාරත්තො තං ඉත්ථිං එතදවොච: “ලොහිතං ඛො තෙ භගිනී”ති. සා න පටිවිජානි. “ආමය්ය, නවරත්තො කම්බලො”ති. තස්ස කුක්කුච්චං අහොසි. “කච්චි නු ඛො අහං සඞ්ඝාදිසෙසං ආපත්තිං ආපන්නො”ති. භගවතො එතමත්ථං ආරොචෙසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස. ආපත්ති දුක්කටස්සා”ති. (1)"
                    },
                    {
                        "type": "paragraph",
                        "text": "2. තෙන ඛො පන සමයෙන අඤ්ඤතරා ඉත්ථි ඛරකම්බලං පාරුතා හොති. අඤ්ඤතරො භික්ඛු සාරත්තො තං ඉත්ථිං එතදවොච: “කක්කසලොමං ඛො තෙ භගිනී”ති. සා න පටිවිජානි. “ආමය්ය, ඛරකම්බලකො”ති. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස. ආපත්ති දුක්කටස්සා”ති. (2)"
                    },
                    {
                        "type": "paragraph",
                        "text": "3. තෙන ඛො පන සමයෙන අඤ්ඤතරා ඉත්ථි නවාවුතං කම්බලං පාරුතා හොති. අඤ්ඤතරො භික්ඛු සාරත්තො තං ඉත්ථිං එතදවොච: “ආකිණ්ණලොමං ඛො තෙ භගිනී”ති. සා න පටිවිජානි. “ආමය්ය නවාවුතො කම්බලො”ති. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස. ආපත්ති දුක්කටස්සා”ති. (3)"
                    },
                    {
                        "type": "paragraph",
                        "text": "4. තෙන ඛො පන සමයෙන අඤ්ඤතරා ඉත්ථි ඛරකම්බලං පාරුතා හොති. අඤ්ඤතරො භික්ඛු සාරත්තො තං ඉත්ථිං එතදවොච: “ඛරලොමං ඛො තෙ භගිනී”ති. සා න පටිවිජානි. “ආමය්ය, ඛරකම්බලකො”ති. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස. ආපත්ති දුක්කටස්සා”ති. (4)"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සංසීරති. සි. මු. ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "11. ස්ත්‍රීහු දෙදෙනක් වෙත්. මහණ තෙමේ ස්ත්‍රීන් දෙදෙනා පිළිබඳව ‘ස්ත්‍රිය’ යන හැඟීම් ඇත්තේ ද වෙයි. ඇලුනේ ස්ත්‍රීන් දෙදෙනාගේ කය පිළිබඳ වූ වස්ත්‍රාදිය ඇරැබ ගුණ කියයි ද, අගුණ කියයි ද ... ආක්‍රොශ කෙරෙයි ද, දුකුළාඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "12. ස්ත්‍රියකුදු පණ්ඩකයෙකුදු වෙත්. මහණ තෙමේ දෙදෙනා පිළිබඳව ‘ස්ත්‍රිය’ යන හැඟීම් ඇත්තේ, ඇලුනේ ද වෙයි. දෙදෙනාගේ කය පිළිබඳ වූවක් ඇරැබ ගුණ කියයි ද, අගුණ කියයි ද ... ආක්‍රොශ කෙරෙයි ද දුකුළාඇවැත් දෙකෙකි. ...",
                        "type": "paragraph"
                    },
                    {
                        "text": "13. ඔවා පෙරටුකොට, දහම් පෙරටු කොට අනුශාසන පෙරටු කොට කියන්නහුටත්, උමතුවූවහුටත් ආදිකර්‍මමිකයාටත් ඇවැත් නො වේ.",
                        "type": "paragraph"
                    },
                    {
                        "text": "විනිශ්චිතවස්තු",
                        "type": "heading",
                        "level": 1
                    },
                    {
                        "text": "උද්දානගාථා:",
                        "type": "unindented"
                    },
                    {
                        "text": "ලොහිත වත්‍ථු, කක්කස ලොම වත්‍ථු, ආකිණ්ණ ලොම වත්‍ථු, ඛර ලොම වත්‍ථු, දීඝ ලොම වත්‍ථු, වාපිත වත්‍ථු, කච්චීසංසීදනමග්ග වත්‍ථු, සද්ධා වත්‍ථු, දාන වත්‍ථු, කම්ම වත්‍ථු, (තුනෙකැ) යි වස්තු දොළසෙකි:",
                        "type": "paragraph"
                    },
                    {
                        "text": "1. එසමයෙහි එක්තරා ස්ත්‍රියක් අලුත රැඳූ කම්බලයක් පෙරෙවියා වෙයි. එක්තරා මහණෙක් සංරක්තවූයේ ඒ ස්ත්‍රියට “බුහුනනියනි, තිගේ ලෙය”යි කී ය. ඕ එබස නො දත්තී ‘එසේය, ආර්‍ය්‍යයන් වහන්ස, අලුත රැඳූ කම්බලයකි’යි කිවු ය. මහණහට “කිම, මම් සඟවෙසෙස්ඇවැත් අවන්නෙම් දැ?”යි කුකුස් විය. භාග්‍යවතුන් වහන්සේට මෙ පවත් සැළ කෙළේ ය. ... “මහණ, සඟවෙසෙස් ඇවැත් නො වේ. දුකුළාඇවැත් වේ”යි වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "text": "2. එසමයෙහි එක්තරා ස්ත්‍රියක් ගනලොම් කම්බලයක් පෙරෙවියා වෙයි. සංරක්තවූ එක්තරා මහණෙක් ඒ ස්ත්‍රියට “බුහුනනියනි, තිගේ කැකුළු ලොමැ”යි කී ය. ඕ තොමෝ එ බස නො දත්තී “ආර්‍ය්‍යයන් වහන්ස, රළු ලොම් කම්බලයෙකි” යි ඕ කිවු ය. ඒ මහණහට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. දුකුළාඇවැත් වේ”යි වදාළ සේක. (2)",
                        "type": "paragraph"
                    },
                    {
                        "text": "3. එසමයෙහි එක්තරා ස්ත්‍රියක් අලුත වියූ කම්බලයක් පෙරෙවියා වෙයි. සංරක්ත වූ එක්තරා මහණෙක් ඒ ස්ත්‍රියට “බුහුනනියනි, තිගේ ගැවසුනු ලොම් වේ”යි කී ය. ඕ දැන නො ගත්තී ය. “එසේ ය ආර්‍ය්‍යයන් වහන්ස, අලුත වියූ කම්බලයකි” යි කිවු ය. ඒ මහණහට කුකුස් විය. ... “මහණ, සඟවෙසෙස් ඇවැත් නො වේ. දුකුළාඇවැත් වේ”යි වදාළ සේක. (3)",
                        "type": "paragraph"
                    },
                    {
                        "text": "4. එසමයෙහි එක්තරා ස්ත්‍රියක් අළුලොම් කම්බලයක් පෙරෙවියා වෙයි. සංරක්ත වූ එක්තරා මහණෙක් ඒ ස්ත්‍රියට “බුහුනනියනි, තිගේ රළු ලොමැ”යි කී ය. ඕ දැන නො ගත්තී ය. “එසේ ය ආර්‍ය්‍යයන් වහන්ස, කම්බලය රළුලොම් ඇත්තෙකැ”යි කිවු ය. ඒ මහණහට කුකුස් විය. ... “මහණ, සඟවෙසෙස් ඇවැත් නො වේ. දුකුළාඇවැත් වේ”යි වදාළ සේක. (4)",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 328,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "5. තෙන ඛො පන සමයෙන අඤ්ඤතරා ඉත්ථි පාවාරං{1} පාරුතා හොති. අඤ්ඤතරො භික්ඛු සාරත්තො තං ඉත්ථිං එතදවොච: “දීඝලොමං ඛො තෙ භගිනී”ති. සා න පටිවිජානි, “ආමය්ය, පාවාරො”{2} ති. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස, ආපත්ති දුක්කටස්සා”ති. (5)"
                    },
                    {
                        "type": "paragraph",
                        "text": "6. තෙන ඛො පන සමයෙන අඤ්ඤතරා ඉත්ථි ඛෙත්තං වපාපෙත්වා ආගච්ඡති. අඤ්ඤතරො භික්ඛු සාරත්තො තං ඉත්ථිං එතදවොච: “වාපිතං ඛො තෙ භගිනී”ති. සා න පටිවිජානි “ආමය්ය, නො ච ඛො පටිවුත්ත”න්ති. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස, ආපත්ති දුක්කටස්සා”ති. (6)"
                    },
                    {
                        "type": "paragraph",
                        "text": "7. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු පරිබ්බාජිකං පටිපථෙ පස්සිත්වා සාරත්තො තං පරිබ්බාජිකං එතදවොච: “කච්චි තෙ භගිනි මග්ගො සංසීදතී”ති{3}. සා න පටිවිජානි. “ආම භික්ඛු පටිපජ්ජිස්සසී”ති . තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස. ආපත්ති ථුල්ලච්චයස්සා”ති. (7)"
                    },
                    {
                        "type": "paragraph",
                        "text": "8. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු සාරත්තො අඤ්ඤතරං ඉත්ථිං එතදවොච: “සද්ධා’සි ත්වං භගිනි අපි ච යං ත්වං සාමිකස්ස දෙසි තං නාම්හාකං දෙසී”ති . “කිං භන්තෙ”ති. “මෙථුනං ධම්ම”න්ති. තස්ස කුක්කුච්චං අහොසි -පෙ- “ආපත්තිං ත්වං භික්ඛු ආපන්නො සඞ්ඝාදිසෙස”න්ති. (8)"
                    },
                    {
                        "type": "paragraph",
                        "text": "9. තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු සාරත්තො අඤ්ඤතරං ඉත්ථිං එතදවොච: “සද්ධා’සි ත්වං භගිනි. අපි ච යං අග්ගදානං තං නාම්හාකං දෙසී”ති. “කිං භන්තෙ අග්ගදාන”න්ති. “මෙථුන ධම්ම”න්ති. තස්ස කුක්කුච්චං අහොසි -පෙ- “ආපත්තිං ත්වං භික්ඛු ආපන්නො සඞ්ඝාදිසෙස”න්ති. (9)"
                    },
                    {
                        "type": "paragraph",
                        "text": "10. තෙන ඛො පන සමයෙන අඤ්ඤතරා ඉත්ථි කම්මං කරොති. අඤ්ඤතරො භික්ඛු සාරත්තො තං ඉත්ථිං එතදවොච: “තිට්ඨ භගිනි අහං කරිස්සාමී”ති -පෙ- “නිසීද භගිනි අහං කරිස්සාමී”ති. -පෙ- “නිපජ්ජ භගිනි අහං කරිස්සාමී”ති. සා න පටිවිජානි. තස්ස කුක්කුච්චං අහොසි -පෙ- “අනාපත්ති භික්ඛු සඞ්ඝාදිසෙසස්ස. ආපත්ති දුක්කටස්සා”ති. (10-11-12)"
                    },
                    {
                        "type": "centered",
                        "text": "දුට්ඨුල්ලවාචාසික්ඛාපදං නිට්ඨිතං.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. දීඝපාචාරං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. දීඝපාවාරො. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. සංසීරතීති. සී.මු"
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "text": "5. එසමයෙහි එක්තරා ස්ත්‍රියක් උතුරු සළුවක් පෙරෙවියා වෙයි. සංරක්ත වූ එක්තරා මහණෙක් ඒ ස්ත්‍රියට “නඟ, තිගේ දිග ලොම්ය”යි කී ය. ඕ දැන නොගත්තී ය. “එසේ ය, ආර්‍ය්‍යයන් වහන්ස, උතුරුසළුවකි”යි කිවු ය. ඒ මහණහට කුකුස් විය. ... “මහණ, සඟවෙසෙස් ඇවැත් නො වේ. දුකුළාඇවැත් වේ”යි වදාළ සේක. (5)",
                        "type": "paragraph"
                    },
                    {
                        "text": "6. එසමයෙහි එක්තරා ස්ත්‍රියක් කෙතක් වපුරවා එයි. එක්තරා මහණෙක් සංරක්ත වූයේ “නඟ, තිගේ කෙත වපුළේ ද?”යි කී ය. ඕ දැන නො ගත්තී ය. “එසේ ය, ආර්‍ය්‍යයන් වහන්ස, වැලිත් නැවත වපුළේ නො වේ ය”යි කිවු ය. ඒ මහණහට කුකුස් විය. ... “මහණ, සඟවෙසෙස් ඇවැත් නො වේ. දුකුළාඇවැත් වේ”යි වදාළ සේක. (6)",
                        "type": "paragraph"
                    },
                    {
                        "text": "7. එසමයෙහි එක්තරා මහණෙක් පෙරමග පිරිවැජියක දැක සංරක්ත වූයේ, ඒ පිරිවැජියට “කිම නඟ, තිගේ මග මැනැවින් පවත්නේ ද?”යි ඇසී ය. ඕ නො දත්තී ය. “එසේ ය මහණ, මග බැස යන්නැ”යි කිවු ය. ඒ මහණහට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. ථුලැසිඇවැත් වේ”යි වදාළ සේක. (7)",
                        "type": "paragraph"
                    },
                    {
                        "text": "8. එසමයෙහි එක්තරා මහණෙක් සංරක්ත වූයේ එක්තරා ස්ත්‍රියකට “නඟ, ශ්‍රද්ධා ඇති වෙහි ය. එහෙත් තෝ යමක් හිමියාට දෙයි නම් එය අපට නො දෙහිය”යි කී ය. “වහන්ස, කිමෙක් දැ?”යි ඕ කිවු ය. “මෙවුන්දමය”යි හේ කී ය. ඒ මහණහට කුකුස් විය. ... “මහණ, තෝ සඟවෙසෙස්ඇවැත් අවන්නෙහිය”යි භාග්‍යවතුන් වහන්සේ වදාළ සේක. (8)",
                        "type": "paragraph"
                    },
                    {
                        "text": "9. එසමයෙහි එක්තරා මහණෙක් සංරක්ත වූයේ ස්ත්‍රියකට “නඟ, තෝ සැදැහැවත් ය. වැලිත් යම් අග්‍රදානයෙක් වේ නම් එය අපට නො දෙහිය”යි කී ය. “වහන්ස, අග්‍රදානය යනු කිමැ?”යි කිවු ය. “මෙවුන්දමය”යි කී ය. ඒ මහණහට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් අවන්නෙහිය”යි වදාළ සේක. (9)",
                        "type": "paragraph"
                    },
                    {
                        "text": "10. එසමයෙහි එක්තරා ස්ත්‍රියක් කිසි කටයුත්තක් කෙරෙයි. සංරක්ත වූ එක්තරා මහණෙක් ඒ ස්ත්‍රියට “නඟ, සිටුව මම් කරන්නෙමි” ... “නඟ, හිඳුව. මම් කරන්නෙමි” ... “නඟ, වැදහෙව. මම් කරන්නෙමි” යි කී ය. ඕ දැන නො ගත්තී ය. ඒ මහණහට කුකුස් විය. ... “මහණ, සඟවෙසෙස්ඇවැත් නො වේ. දුකුළා ඇවැත්වේ”යි වදාළ සේක. (10. 11. 12.)",
                        "type": "paragraph"
                    },
                    {
                        "text": "දුට්ඨුල්ලාවාචාශික්‍ෂාපදය නිමි.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ],
    "bookId": 1,
    "pageOffset": 0
}