[
    {
        "filename": "dn-slkv-11",
        "bookId": 10,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "484"
            },
            {
                "type": "centered",
                "text": "11",
                "level": 3
            },
            {
                "type": "heading",
                "text": "කෙවඩ්ඪසුත්තං",
                "level": 3
            },
            {
                "type": "paragraph",
                "text": "1. එවං මෙ සුතං: එකං සමයං භගවා නාළන්දායං විහරති පාවාරිකම්බවනෙ. අථ ඛො කෙවඩ්ඪො{1 කෙවට්ටො - සීමු.} ගහපතිපුත්තො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො කෙවඩ්ඪො ගහපතිපුත්තො භගවන්තං එතදවොච: ‘අයං භන්තෙ නාළන්දා ඉද්ධා චෙව ඵීතා ච, බහුජාන ආකිණ්ණමනුස්සා, භගවති අභිප්පසන්නා. සාධු භන්තෙ භගවා එකං භික්ඛුං සමාදිසතු යො උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරිස්සති. එවායං නාළන්දා භිෙය්යාසොමතතාය භගවති අභිප්පසීදිස්සතී’ති."
            },
            {
                "type": "paragraph",
                "text": "2. එවං වුත්තෙ භගවා කෙවඩ්ඪං ගහපතිපුත්තං එතදවොච: න ඛො අහං කෙවඩ්ඪ භික්ඛූනං එවං ධම්මං දෙසෙමි ‘එථ තුම්හෙ භික්ඛවෙ ගිහීනං ඔදාතවසනානං උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරොථා’ති."
            },
            {
                "type": "paragraph",
                "text": "3. දුතියම්පි ඛො කෙවඩ්ඪො ගහපතිපුත්තො භගවන්තං එතදවොච: නාහං භන්තෙ භගවන්තං ධංසෙමි. අපි ච එවං වදාමි: ‘අයං භන්තෙ නාළන්දා ඉද්ධා චෙව ඵීතා ච, බහුජනා ආකිණ්ණමනුස්සා භගවති අභිප්පසන්නා. සාධු භන්තෙ භගවා එකං භික්ඛුං සමාදිසතු යො උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරිස්සති. එවායං නාළන්දා භිෙය්යාසොමත්තාය භගවති අභිප්පසීදිස්සතී’ති. දුතියම්පි ඛො භගවා කෙවඩ්ඪං ගහපතිපුත්තං එතදවොච: න ඛො අහං කෙවඩ්ඪ භික්ඛූනං එවං ධම්මං දෙසෙමි ‘එථ තුම්හෙ භික්ඛවෙ ගිහීනං ඔදාතවසනානං උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරොථා’ති."
            },
            {
                "type": "paragraph",
                "text": "4. තතියම්පි ඛො කෙවඩ්ඪො ගහපතිපුත්තො භගවන්තං එතදවොච: නාහං භන්තෙ භගවන්තං ධංසෙමි. අපි ච එවං වදාමි: ‘අයං භන්තෙ නාළන්දා ඉද්ධා චෙව ඵීතා ච, බහුජනා ආකිණ්ණමනුස්සා, භගවති අභිප්පසන්නා. සාධු භන්තෙ භගවා එකං භික්ඛුං සමාදිසතු යො උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරිස්සති. එවායං නාළන්දා භිෙය්යාසොමත්තාය භගවති අභිප්පසීදිස්සතී’ති."
            },
            {
                "type": "page-break",
                "text": "486"
            },
            {
                "type": "paragraph",
                "text": "5. තීණි ඛො ඉමානි කෙවඩ්ඪ පාටිහාරියානි මයා සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදිතානි. කතමානි තීණි? ඉද්ධිපාටිහාරියං, ආදෙසනාපාටිහාරියං, අනුසාසනීපාටිහාරියන්ති. කතමඤ්ච කෙවඩ්ඪ ඉද්ධිපාටිහාරියං? ඉධ කෙවඩ්ඪ භික්ඛු අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති: එකො’පි හුත්වා බහුධා හොති. බහුධා’පි හුත්වා එකො හොති. ආවීභාවං තිරොභාවං, තිරොකුඩ්ඩං තිරොපාකාරං තිරොපබ්බතං අසජ්ජමානො ගච්ඡති සෙය්යථාපි ආකාසෙ. පඨවියාපි උම්මුජ්ජනිමුජ්ජං කරොති සෙය්යථාපි උදකෙ. උදකෙ’පි අභිජ්ජමානෙ ගච්ඡති සෙය්යථාපි පඨවියං. ආකාසෙ’පි පල්ලඞ්කෙන කමති සෙය්යථාපි පක්ඛී සකුණො. ඉමෙ’පි චන්දිමසූරියෙ එවංමහිද්ධිකෙ එවංමහානුභාවෙ පාණිනා පරිමසති පරිමජ්ජති. යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙති."
            },
            {
                "type": "paragraph",
                "text": "6. තමෙනං අඤ්ඤතරො සද්ධො පසන්නො පස්සති තං භික්ඛුං අනෙකවිහිතං ඉද්ධිවිධං පච්චනසුභොන්තං: එකම්පි හුත්වා බහුධා හොන්තං, බහුධාපි හුත්වා එකො හොන්තං, ආවීභාවං තිරොභාවං තිරොකුඩ්ඩං තිරොපාකාරං තිරොපබ්බතං අසජ්ජමාන ගච්ඡන්තං සෙය්යථාපි ආකාසෙ, පඨවියාපි උම්මුජ්ජනිමුජ්ජං කරොන්තං සෙය්යථාපි උදකෙ, උදකෙ’පි අභිජ්ජමානෙ ගච්ඡන්තං සෙය්යථාපි පඨවියං, ආකාසෙ’පි පල්ලඞ්කෙන කමන්තං සෙය්යථාපි පක්ඛීසකුණො, ඉමෙ’පි චන්දිමසූරියෙ එවංමහිද්ධිකෙ එවංමහානුභාවෙ පාණිනා පරිමසන්තං පරිමජ්ජන්තං, යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙනතං."
            },
            {
                "type": "paragraph",
                "text": "7. තමෙනං සො සද්ධො පසන්නො අඤ්ඤතරස්ස අස්සද්ධස්ස අප්පසන්නස්ස ආරොචෙති: අච්ඡරියං වත භො අබ්භුතං වත භො සමණස්ස මහිද්ධිකතා මහානුභාවතා. අමාහං භික්ඛුං අද්දසං අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොන්තං: එකොපි හුත්වා බහුධා හොන්තං, බහුධාපි හුත්වා එකම්පි හොන්තං -පෙ- යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙන්තන්ති. තමෙනං සො අස්සද්ධො අප්පසන්නො තං සද්ධං පසන්නං එවං වදෙය්ය: අත්ථි ඛො භො ගන්ධාරී නාම විජ්ජා. තාය සො භික්ඛු අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති: එකො’පි හුත්වා බහුධා හොති -පෙ- යාව බ්රහ්මලොකා’පි කායෙන වසං වත්තෙතීති. තං කිංමඤ්ඤසි කෙවඩ්ඪ? අපි නු සො අස්සද්ධො අප්පසන්නො තං සද්ධං පසන්නං එවං වදෙය්යා?”ති. “වදෙය්ය භන්තෙ”ති. “ඉමං ඛො අහං කෙවඩ්ඪ ඉද්ධිපාටිහාරියෙ ආදීනවං සම්පස්සමානො ඉද්ධිපාටිහාරියෙන අට්ටීයාමි හරායාමි ජිගුච්ඡාමි."
            },
            {
                "type": "page-break",
                "text": "488"
            },
            {
                "type": "paragraph",
                "text": "8. කතමඤ්ච කෙවඩ්ඪ ආදෙසනාපාටිහාරියං? ඉධ කෙවඩ්ඪ භික්ඛු පරසත්තානං පරපුග්ගලානං චිත්තම්පි ආදිසති චෙතසිකම්පි ආදිසති විතක්කිතම්පි ආදිසති විචාරිතම්පි ආදිසති: එවම්පි තෙ මනො, ඉත්ථම්පි තෙ මනො, ඉතිපි තෙ චිත්තන්ති. තමෙනං අඤ්ඤතරො සද්ධො පසන්නො පස්සති තං භික්ඛුං පරසත්තානං පරපුග්ගලානං චිත්තම්පි ආදිසන්තං චෙතසිකම්පි ආදිසන්තං විතක්කිතම්පි ආදිසන්තං විචාරිතම්පි ආදිසන්තං: එවම්පි තෙ මනො, ඉත්ථම්පි තෙ මනො, ඉති’පි තෙ චිත්තන්ති. තමෙනං සො සද්ධො පසන්නො අඤ්ඤතරස්ස අස්සද්ධස්ස අප්පසන්නස්ස ආරොචෙති: අච්ඡරියං වත භො අබ්භුතං වත භො සමණස්ස මහිද්ධිකතා මහානුභාවතා. අමාහං භික්ඛුං අද්දසං පරසත්තානං පරපුග්ගලානං චිත්තම්පි ආදිසන්තං චෙතසිකම්පි ආදිසන්තං විතක්කිතම්පි ආදිසන්තං විචාරිතම්පි ආදිසන්තං: එවම්පි තෙ මනො, ඉත්ථම්පි තෙ මනො, ඉති’පි තෙ චිත්තන්ති. තමෙනං සො අස්සද්ධො අප්පසන්නො තං සද්ධං පසන්නං එවං වදෙය්ය: අත්ථි ඛො භො මණිකා නාම විජ්ජා. තාය සො භික්ඛු පරසත්තානං පරපුග්ගලානං චිත්තම්පි ආදිසති, චෙතසිකම්පි ආදිසති, විතක්කිතම්පි ආදිසති, විචාරිතම්පි ආදිසති: එවම්පි තෙ මනො, ඉත්ථම්පි තෙ මනො, ඉතිපි තෙ චිත්තන්ති. තං කිං මඤ්ඤසි කෙවඩ්ඪ? අපි නු සො අස්සද්ධො අප්පසන්නො තං සද්ධං පසන්නං එවං වදෙය්යා?”ති. “වදෙය්ය භන්තෙ”ති. ඉමං ඛො අහං කෙවඩ්ඪ ආදෙසනා පාටිහාරියෙ ආදීනවං සම්පස්සමානො ආදෙසනාපාටිහාරියෙන අට්ටීයාමි හරායාමි ජිගුච්ඡාමි."
            },
            {
                "type": "paragraph",
                "text": "9. කතමඤ්ච කෙවඩ්ඪ අනුසාසනීපාටිහාරියං? ඉධ කෙවඩ්ඪ භික්ඛු එවමනුසාසති: එවං විතක්කෙථ, මා එවං විතක්කයිත්ථ, එවං මනසිකරොථ, මා එවං මනසාකත්ථ, ඉදං පජහථ, ඉදං උපසම්පජ්ජ විහරථාති. ඉදම්පි වුච්චති කෙවඩ්ඪ අනුසාසනීපාටිහාරියං."
            },
            {
                "type": "paragraph",
                "text": "10. පුන ච පරං කෙවඩ්ඪ ඉධ තථාගතො ලොකෙ උප්පජ්ජති අරහං සම්මාසම්බුද්ධො විජ්ජාචරණසම්පන්නො සුගතො ලොකවිදූ අනුත්තරො පුරිසදම්මසාරථි සත්ථා දෙවමනුස්සානං බුද්ධො භගවා. සො ඉමං ලොකං සදෙවකං සමාරකං සබ්රහ්මකං සස්සමණබ්රාහ්මණිං පජං සදෙවමනුස්සං සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදෙති. සො ධම්මං දෙසෙති ආදිකල්යාණං මජ්ඣෙකල්යාණං පරියොසානකල්යාණං සාත්ථං සබ්යඤ්ජනං කෙවලපරිපුණ්ණං පරිසුද්ධං බ්රහ්මචරියං පකාසෙති."
            },
            {
                "type": "page-break",
                "text": "490"
            },
            {
                "type": "paragraph",
                "text": "11. තං ධම්මං සුණාති ගහපති වා ගහපතිපුත්තො වා අඤ්ඤතරස්මිං වා කුලෙ පච්චාජාතො. සො තං ධම්මං සුත්වා තථාගතෙ සද්ධං පටිලභති. සො තෙන සද්ධාපටිලාභෙන සමන්නාගතො ඉති පටිසඤ්චික්ඛති: ‘සම්බාධො ඝරාවාසො රජාපථො{1 }. අබ්භොකාසො පබ්බජ්ජා. නයිදං සුකරං අගාරං අජ්ඣාවසතා එකන්තපරිපුණ්ණං එකන්තපරිසුද්ධං සඞ්ඛලිඛිතං බ්රහ්මචරියං චරිතුං. යන්නූනාහං කෙසමස්සුං ඔහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජෙය්ය’න්ති. සො අපරෙන සමයෙන අප්පං වා භොගක්ඛන්ධං පහාය මහන්තං වා භොගක්ඛන්ධං පහාය අප්පං වා ඤාතිපරිවට්ටං පහාය මහන්තං වා ඤාතිපරිවට්ටං පහාය කෙසමස්සුං ඔහාරෙත්වා කාසායානි වත්ථානි අච්ඡාදෙත්වා අගාරස්මා අනගාරියං පබ්බජති. සො එවං පබ්බජිතො සමානො පාතිමොක්ඛසංවරසංවුතො විහරති ආචාරගොචරසම්පන්නො අණුමත්තෙසු වජ්ජෙසු භයදස්සාවී. සමාදාය සික්ඛති සික්ඛාපදෙසු කායකම්මෙන සමන්නාගතො කුසලෙන. පරිසුද්ධාජීවො සීලසම්පන්නො ඉන්ද්රියෙසු ගුත්තද්වාරො භොජනෙ මත්තඤ්ඤූ සතිසම්පජඤ්ඤෙන සමන්නාගතො සන්තුට්ඨො."
            },
            {
                "type": "paragraph",
                "text": "12. කථඤ්ච කෙවඩ්ඪ භික්ඛු සීලසම්පන්නො හොති? ඉධ මහාරාජ භික්ඛු පාණාතිපාතං පහාය පාණාතිපාතා පටිවිරතො හොති නිහිතදණ්ඩො නිහිතසත්ථො ලජ්ජී දයාපන්නො. සබ්බපාණභූතහිතානුකම්පී විහරති. ඉදම්පි’ස්ස හොති සීලස්මිං. අදින්නාදානං පහාය අදින්නාදාන පටිවිරතො හොති දින්නාදායී දින්නපාටිකඞ්ඛී. අථෙනෙන සුචිභූතෙන අත්තනා විහරති. ඉදම්පි’ස්ස හොති සීලස්මිං. අබ්රහ්මචරියං පහාය බ්රහ්මචාරී හොති ආරාචාරී{2 අනාචාරී - මඡසං.} විරතො මෙථුනා ගාමධම්මා. ඉදම්පි’ස්ස හොති සීලස්මිං. මුසාවාදං පහාය මුසාවාදා පටිවිරතො හොති සච්චවාදී සච්චසන්ධො ථෙතො{3 ඨෙතො - ස්යා.} පච්චයිකො අවිසංවාදකො ලොකස්ස. ඉදම්පි’ස්ස හොති සීලස්මිං. පිසුණං වාචං{4 පිසුණාවාචං - PTS.} පහාය පිසුණාය වාචාය පටිවිරතො හොති. ඉතො සුත්වා න අමුත්ර අක්ඛාතා ඉමෙසං භෙදාය. අමුත්ර වා සුත්වා න ඉමෙසං අක්ඛාතා අමූසං භෙදාය. ඉති භින්නානං වා සන්ධාතා, සංහිතානං වා අනුප්පදාතා{5 අනුප්පාදාතා - PTS.} සමග්ගාරාමො{6 සමග්ගරාමො - මඡසං.} සමග්ගරතො සමග්ගනන්දී සමග්ගකරණිං වාචං භාසිතා හොති. ඉදම්පි’ස්ස හොති සීලස්මිං. ඵරුසං වාචං{7 ඵරුසාවාචං - PTS. සිත්රි.} පහාය ඵරුසාය වාචාය පටිවිරතො හොති."
            },
            {
                "type": "page-break",
                "text": "492"
            },
            {
                "type": "paragraph",
                "text": "යා සා වාචා නෙළා කණ්ණසුඛා පෙමනීයා{1 පෙමනියා - මඡසං.} හදයඞ්ගමා පොරී බහුජනකන්තා බහුජනමනාපා, තථාරූපිං{2 එවරූපිං - PTS. සිත්රි.} වාචං භාසිතා හොති. ඉදම්පි’ස්ස හොති සීලස්මිං. සම්ඵප්පලාපං පහාය සම්ඵප්පලාපා පටිවිරතො හොති කාලවාදී භූතවාදී අත්ථවාදී ධම්මවාදී විනයවාදී. නිධානවතිං වාචං භාසිතා හොති කාලෙන සාපදෙසං පරියන්තවතිං අත්ථසඤ්හිතං. ඉදම්පි’ස්ස හොති සීලස්මිං."
            },
            {
                "type": "paragraph",
                "text": "13. බීජගාමභූතගාමසමාරම්භා පටිවිරතො හොති. එකභත්තිකො හොති රත්තූපරතො පටිවිරතො විකාලභොජනා. නච්චගීතවාදිතවිසූකදස්සනා පටිවිරතො හොති. මාලාගන්ධවිලෙපනධාරණමණ්ඩනවිභූසනට්ඨානා පටිවිරතො හොති. උච්චාසයනමහාසයනා පටිවිරතො හොති. ජාතරූපරජතපටිග්ගහණා පටිවිරතො හොති. ආමකධඤ්ඤපටිග්ගහණා පටිවිරතො හොති. ආමකමංසපටිග්ගහණා පටිවිරතො හොති. ඉත්ථිකුමාරිකපටිග්ගහණා පටිවිරතො හොති. දාසිදාසපටිග්ගහණා පටිවිරතො හොති. අජෙළකපටිග්ගහණා පටිවිරතො හොති. කුක්කුටසූකරපටිග්ගහණා පටිවිරතො හොති. හත්ථිගවස්සවළවාපටිග්ගහණා පටිවිරතො හොති. ඛෙත්තවත්ථුපටිග්ගහණා පටිවිරතො හොති. දූතෙය්යපහිණගමනානුයොගා පටිවිරතො හොති. කයවික්කයා පටිවිරතො හොති. තුලාකූටකංසකූටමානකූටා පටිවිරතො හොති. උක්කොටනවඤ්චනනිකතිසාචියොගා පටිවිරතො හොති. ඡෙදනවධබන්ධනවිපරාමොසආලොපසහසාකාර පටිවිරතො හොති. ඉදම්පිස්ස හොති සීලස්මිං."
            },
            {
                "type": "paragraph",
                "text": "14. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං බීජගාමභූතගාමසමාරම්භං අනුයුත්තා විහරන්ති, සෙය්යථිදං: මූලබීජං ඛන්ධබීජං ඵලුබීජං අග්ගබීජං බිජබීජමෙව පඤ්චමං. ඉති වා ඉති එවරූපා බීජගාමභූතගාමසමාරම්භා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
            },
            {
                "type": "page-break",
                "text": "494"
            },
            {
                "type": "paragraph",
                "text": "15. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං සන්නිධිකාරපරිභොගං අනුයුත්තා විහරන්ති, සෙය්යථිදං: අන්නසන්නිධිං පානසන්නිධිං වත්ථසන්නිධිං යානසන්නිධිං සයනසන්නිධිං ගන්ධසන්නිධිං ආමිසසන්නිධිං. ඉති වා ඉති එවරූපා සන්නිධිකාරපරිභොගා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
            },
            {
                "type": "paragraph",
                "text": "16. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං විසූකදස්සනං අනුයුත්තා විහරන්ති, සෙය්යථිදං: නච්චං ගීතං වාදිතං පෙක්ඛං අක්ඛානං පාණිස්සරං වෙතාලං කුම්භථූනං සොභනකං චණ්ඩාලං වංසං ධොපනකං හත්ථියුද්ධං අස්සයුද්ධං මහිසයුද්ධං උසභයුද්ධං අජයුද්ධං මෙණ්ඩයුද්ධං කුක්කුටයුද්ධං වට්ටකයුද්ධං දණ්ඩයුද්ධං මුට්ඨියුද්ධං නිබ්බුද්ධං උෙය්යාධිකං බලග්ගං සෙනාබ්යූහං අණීකදස්සනං. ඉති වා ඉති එවරූපා විසූකදස්සනා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
            },
            {
                "type": "paragraph",
                "text": "17. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං ජූතප්පමාදට්ඨානානුයොගං අනුයුත්තා විහරන්ති, සෙය්යථිදං: අට්ඨපදං දසපදං ආකාසං පරිහාරපථං සන්තිකං ඛලිකං ඝටිකං සලාකාහත්ථං අක්ඛං පඞ්ගචීරං වඞ්කකං මොක්ඛචිකං චිඞ්ගුලකං පත්තාළහකං රථකං ධනුකං අක්ඛරිකං මනෙසිකං යථාවජ්ජං. ඉති වා ඉති එවරූපා ජූතප්පමාදට්ඨානානුයොගා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
            },
            {
                "type": "paragraph",
                "text": "18. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං උච්චාසයනමහාසයනං අනුයුත්තා විහරන්ති, සෙය්යථිදං: ආසන්දිං පල්ලඞ්කං ගොනකං චිත්තකං පටිකං පටලිකං තූලිකං විකතිකං උද්දලොමිං එකන්තලොමිං කට්ඨිස්සං කොසෙය්යං කුත්තකං හත්ථත්ථරං අස්සත්ථරං රථත්ථරං අජිනප්පවෙණිං කාදලිමිගපවරපච්චත්ථරණං සඋත්තරච්ඡදං උභතොලොහිතකූපධානං ඉති වා ඉති එවරූපා උච්චාසයනමහාසයනා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
            },
            {
                "type": "page-break",
                "text": "496"
            },
            {
                "type": "paragraph",
                "text": "19. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං මණ්ඩනවිභූසනට්ඨානානුයොගං අනුයුත්තා විහරන්ති, සෙය්යථීදං: උච්ඡාදනං පරිමද්දනං නහාපනං සම්බාහනං ආදාසං අඤ්ජනං මාලාවිලෙපනං මුඛචුණ්ණකං මුඛලෙපනං හත්ථබන්ධං සිඛාබන්ධං දණ්ඩකං නාළිකං ඛග්ගං ඡත්තං චිත්රෑපාහනං උණ්හීසං මණිං වාලවීජනිං ඔදාතානි වත්ථානි දීඝදසානි. ඉති වා ඉති එවරූපා මණ්ඩනවිභූසනට්ඨානානුයොගා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
            },
            {
                "type": "paragraph",
                "text": "20. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං තිරච්ඡානකථං අනුයුත්තා විහරන්ති, සෙය්යථිදං: රාජකථං චොරකථං මහාමත්තකථං සෙනාකථං භයකථං යුද්ධකථං අන්නකථං පානකථං වත්ථකථං සයනකථං මාලාකථං ගන්ධකථං ඤාතිකථං යානකථං ගාමකථං නිගමකථං නගරකථං ජනපදකථං ඉත්ථිකථං පුරිසකථං [කුමාරකථං කුමාරිකථං] සූරකථං විසිඛාකථං කුම්භට්ඨනකථං පුබ්බපෙතකථං නානත්තකථං ලොකක්ඛායිකං සමුද්දක්ඛායිකං ඉතිභවාභවකථං. ඉති වා ඉති එවරූපාය තිරච්ඡානකථාය පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
            },
            {
                "type": "paragraph",
                "text": "21. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං විග්ගාහිකකථං අනුයුත්තා විහරන්ති, සෙය්යථීදං: න ත්වං ඉමං ධම්මවිනයං ආජානාසි. අහං ඉමං ධම්මවිනයං ආජානාමි. කිං ත්වං ඉමං ධම්මවිනයං ආජානිස්සසි? මිච්ඡාපටිපන්නො ත්වමසි. අහමස්මි සම්මාපටිපන්නො. සංහිතං මෙ, අසංහිතං තෙ. පුරෙ වචනීයං පච්ඡා අවච. පච්ඡා වචනීයං පුරෙ අවච. ආචිණ්ණං තෙ විපරාවත්තං. ආරොපිතො තෙ වාදො. නිග්ගහීතො ත්වමසි. චර වාදප්පමොක්ඛාය. නිබ්බෙඨෙහි වා සචෙ පහොසීති. ඉති වා ඉතිඑවරූපාය විග්ගාහිකකථාය පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
            },
            {
                "type": "paragraph",
                "text": "22. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපං දූතෙය්යපහිණගමනානුයොගමනුයුත්තා විහරන්ති, සෙය්යථිදං: රඤ්ඤං රාජමහාමත්තානං ඛත්තියානං බ්රාහ්මණානං ගහපතිකානං කුමාරානං “ඉධ ගච්ඡ අමුත්රාගච්ඡ. ඉදං හර. අමුත්ර ඉදං ආහරා”ති. ඉති වා ඉති එවරූපා දූතෙය්යපහිණගමනානුයොගා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
            },
            {
                "type": "page-break",
                "text": "498"
            },
            {
                "type": "paragraph",
                "text": "23. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ කුහකා ච හොන්ති ලපකා ච නෙමිත්තිකා ච නිප්පෙසිකා ච ලාභෙන ච ලාභං නිජිගිංසිතාරො. ඉති වා ඉති එවරූපා කුහනලපනා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
            },
            {
                "type": "paragraph",
                "text": "24. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති, සෙය්යථිදං: අඞ්ගං නිමිත්තං උප්පාතං සුපිණං ලක්ඛණං මූසිකච්ඡින්නං අග්ගිහොමං දබ්බිහොමං ථුසහොමං කණහොමං තණ්ඩුලහොමං සප්පිහොමං තෙලහොමං මුඛහොමං ලොහිතහොමං අඞ්ගවිජ්ජා වත්ථුවිජ්ජා ඛත්තවිජ්ජා සිවවිජ්ජා භූතවිජ්ජා භූරිවිජ්ජා අහිවිජ්ජා විසවිජ්ජා විච්ඡිකවිජ්ජා මූසිකවිජ්ජා සකුණවිජ්ජා වායසවිජ්ජා පක්කජ්ඣානං සරපරිත්තානං මිගපක්ඛං. ඉති වා ඉතිඑවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
            },
            {
                "type": "paragraph",
                "text": "25. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති, සෙය්යථිදං: මණිලක්ඛණං වත්ථලක්ඛණං දණ්ඩලක්ඛණං අසිලක්ඛණං උසුලක්ඛණං ධනුලක්ඛණං ආවුධලක්ඛණං ඉත්ථිලක්ඛණං පුරිසලක්ඛණං කුමාරලක්ඛණං කුමාරිලක්ඛණං දාසලක්ඛණං දාසිලක්ඛණං හත්ථිලක්ඛණං අස්සලක්ඛණං මහිසලක්ඛණං උසභලක්ඛණං ගොලක්ඛණං අජලක්ඛණං මෙණ්ඩලක්ඛණං කුක්කුටලක්ඛණං වට්ටකලක්ඛණං ගොධාලක්ඛණං කණ්ණිකාලක්ඛණං කච්ඡපලක්ඛණං මිගලක්ඛණං. ඉති වා ඉතිඑවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
            },
            {
                "type": "paragraph",
                "text": "26. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති සෙය්යථිදං: “රඤ්ඤං නිය්යානං භවිස්සති, රඤ්ඤං අනිය්යානං භවිස්සති, අබ්භන්තරානං රඤ්ඤං උපයානං භවිස්සති, බාහිරානං රඤ්ඤං අපයානං භවිස්සති, බාහිරානං රඤ්ඤං උපයානං භවිස්සති, අබ්භන්තරානං රඤ්ඤං අපයානං භවිස්සති, අබ්භන්තරානං රඤ්ඤං ජයො භවිස්සති, බාහිරානං රඤ්ඤං පරාජයො භවිස්සති, බාහිරානං රඤ්ඤං ජයො භවිස්සති, අබ්භන්තරානං රඤ්ඤං පරාජයො භවිස්සති. ඉති ඉමස්ස ජයො භවිස්සති. ඉමස්ස පරාජයො භවිස්සති.” ඉති වා ඉති එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
            },
            {
                "type": "page-break",
                "text": "500"
            },
            {
                "type": "paragraph",
                "text": "27. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති. සෙය්යථීදං: “චන්දග්ගාහො භවිස්සති. සූරියග්ගාහො භවිස්සති. නක්ඛත්තග්ගාහො භවිස්සති. චන්දිමසූරියානං පථගමනං භවිස්සති. චන්දිමසූරියානං උප්පථගමනං භවිස්සති. නක්ඛත්තානං පථගමනං භවිස්සති. නක්ඛත්තානං උප්පථගමනං භවිස්සති. උක්කාපාතො භවිස්සති. දිසාඩාහො භවිස්සති. භූමිචාලො භවිස්සති. දෙවදුන්දුභි භවිස්සති. චන්දිමසූරියනක්ඛත්තානං උග්ගමනං ඔගමනං සංකිලෙසං වොදානං භවිස්සති. එවංවිපාකො චන්දග්ගාහො භවිස්සති. එවංවිපාකො සූරියග්ගාහො භවිස්සති. එවංවිපාකො නක්ඛත්තග්ගාහො භවිස්සති. එවංවිපාකං චන්දිමසූරියානං පථගමනං භවිස්සති. එවංවිපාකං චන්දිමසූරියානං උප්පථගමනං භවිස්සති. එවංවිපාකං නක්ඛත්තානං පථගමනං භවිස්සති. එවංවිපාකං නක්ඛත්තානං උප්පථගමනං භවිස්සති. එවංවිපාකො උක්කාපාතො භවිස්සති. එවංවිපාකො දිසාඩාහො භවිස්සති. එවංවිපාකො භූමිචාලො භවිස්සති. එවංවිපාකො දෙවදුන්දුභි භවිස්සති. එවංවිපාකං චන්දිමසූරියනක්ඛත්තානං උග්ගමනං ඔගමනං සඞ්කිලෙසං වොදානං භවිස්සති.” ඉති වා ඉති එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පිස්ස හොති සීලස්මිං."
            },
            {
                "type": "paragraph",
                "text": "28. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති. සෙය්යථිදං: “සුබ්බුට්ඨිකා භවිස්සති. දුබ්බුට්ඨිකා භවිස්සති. සුභික්ඛං භවිස්සති. දුබ්භික්ඛං භවිස්සති. ඛෙමං භවිස්සති. භයං භවිස්සති. රොගො භවිස්සති. ආරොග්යං භවිස්සති. මුද්දා ගණනා සංඛානං කාවෙය්යං ලොකායතං.” ඉති වා ඉතිඑවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
            },
            {
                "type": "paragraph",
                "text": "29. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති. සෙය්යථිදං: ආවාහනං විවාහනං සංවදනං විවදණං සංකිරණං විකිරණං සුභගකරණං දුබ්භගකරණං විරුද්ධගබ්භකරණං ජිව්හානිත්ථම්භනං හනුසංහනනං හත්ථාභිජප්පනං හනුජප්පනං කණ්ණජප්පනං ආදාසපඤ්හං කුමාරිපඤ්හං දෙවපඤ්හං ආදිච්චුපට්ඨානං මහතුපට්ඨානං අබ්භුජ්ජලනං සිරිව්හානං. ඉති වා ඉතිඑවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පි’ස්ස හොති සීලස්මිං."
            },
            {
                "type": "page-break",
                "text": "502"
            },
            {
                "type": "paragraph",
                "text": "30. යථා වා පනෙකෙ භොන්තො සමණබ්රාහ්මණා සද්ධාදෙය්යානි භොජනානි භුඤ්ජිත්වා තෙ එවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවෙන ජීවිකං කප්පෙන්ති. සෙය්යථිදං: සන්තිකම්මං පණිධිකම්මං භූතකම්මං භූරිකම්මං වස්සකම්මං වොස්සකම්මං වත්ථුකම්මං වත්ථුපරිකිරණං ආචමනං නහාපනං ජුහනං වමනං විරෙචනං උද්ධවිරෙචනං අධොවිරෙචනං සීසවිරෙචනං කණ්ණතෙලං නෙත්තතප්පනං නත්ථුකම්මං අඤ්ජනං පච්චඤ්ජනං සාලාකියං සල්ලකත්තියං දාරකතිකිච්ඡා මූලභෙසජ්ජානං අනුප්පදානං ඔසධීනං පටිමොක්ඛො. ඉති වා ඉතිඑවරූපාය තිරච්ඡානවිජ්ජාය මිච්ඡාජීවා පටිවිරතො හොති. ඉදම්පිස්ස හොති සීලස්මිං."
            },
            {
                "type": "paragraph",
                "text": "31. ස ඛො සො මහාරාජ භික්ඛු එවං සීලසම්පන්නො න කුතොචි භයං සමනුපස්සති යදිදං සීලසංවරතො. සෙය්යථාපි මාණව ඛත්තියො මුද්ධාවසිත්තො නිහතපච්චාමිත්තො න කුතොචි භයං සමනුපස්සති යදිදං පච්චත්ථිකතො. එවමෙව ඛො මහාරාජ භික්ඛු එවං සීලසම්පන්නො න කුතොචි භයං සමනුපස්සති යදිදං සීලසංවරතො. සො ඉමිනා අරියෙන සීලක්ඛන්ධෙන සමන්නාගතො අජ්ඣත්තං අනවජ්ජසුඛං පටිසංවෙදෙති. එවං ඛො කෙවඩ්ඪ භික්ඛු සීලසම්පන්නො හොති."
            },
            {
                "type": "paragraph",
                "text": "32. කථඤ්ච කෙවඩ්ඪ භික්ඛු ඉන්ද්රියෙසු ගුත්තද්වාරො හොති? ඉධ කෙවඩ්ඪ භික්ඛු චක්ඛුනා රූපං දිස්වා න නිමිත්තග්ගාහී හොති නානුබ්යඤ්ජනග්ගාහී. යත්වාධිකරණමෙනං චක්ඛුන්ද්රියං අසංවුතං විහරන්තං අභිජ්ඣා දොමනස්සා පාපකා අකුසලා ධම්මා අන්වාස්සවෙය්යුං, තස්ස සංවරාය පටිපජ්ජති. රක්ඛති චක්ඛුන්ද්රියං. චක්ඛුන්ද්රියෙ සංවරං ආපජ්ජති. සොතෙන සද්දං සුත්වා -පෙ- ඝානෙන ගන්ධං ඝායිත්වා -පෙ- ජිව්හාය රසං සායිත්වා -පෙ- කායෙන ඵොට්ඨබ්බං ඵුසිත්වා -පෙ- මනසා ධම්මං විඤ්ඤාය න නිමිත්තග්ගාහී හොති නානුබ්යඤ්ජනග්ගාහී. යත්වාධිකරණමෙනං මනින්ද්රියං අසංවුතං විහරන්තං අභිජ්ඣාදොමනස්සා පාපකා අකුසලා ධම්මා අන්වාස්සවෙය්යුං, තස්ස සංවරාය පටිපජ්ජති, රක්ඛති මනින්ද්රියං. මනින්ද්රියෙ සංවරං ආපජ්ජති. සො ඉමිනා අරියෙන ඉන්ද්රියසංවරෙන සමන්නාගතො අජ්ඣත්තං අබ්යාසෙකසුඛං පටිසංවෙදෙති. එවං ඛො මහාරාජ භික්ඛු ඉන්ද්රියෙසු ගුත්තද්වාරො හොති."
            },
            {
                "type": "page-break",
                "text": "504"
            },
            {
                "type": "paragraph",
                "text": "33. කථඤ්ච කෙවඩ්ඪ භික්ඛු සතිසම්පජඤ්ඤෙන සමන්නාගතො හොති? ඉධ කෙවඩ්ඪ භික්ඛු අභික්කන්තෙ පටික්කන්තෙ සම්පජානකාරී හොති. ආලොකිතෙ විලොකිතෙ සම්පජානකාරී හොති. සමිඤ්ජිතෙ පසාරිතෙ සම්පජානකාරී හොති. සඞ්ඝාටිපත්තචීවරධාරණෙ සම්පජානකාරී හොති. අසිතෙ පීතෙ ඛායිතෙ සායිතෙ සම්පජානකාරී හොති. උච්චාරපස්සාවකම්මෙ සම්පජානකාරී හොති. ගතෙ ඨිතෙ නිසින්නෙ සුත්තෙ ජාගරිතෙ භාසිතෙ තුණ්හීභාවෙ සම්පජානකාරී හොති. එවං ඛො කෙවඩ්ඪ භික්ඛු සතිසම්පජඤ්ඤෙන සමන්නාගතො හොති."
            },
            {
                "type": "paragraph",
                "text": "34. කථඤ්ච කෙවඩ්ඪ භික්ඛු සන්තුට්ඨො හොති? ඉධ මහාරාජ භික්ඛු සන්තුට්ඨො හොති කායපරිහාරියෙන චීවරෙන කුච්ඡිපරිහාරියෙන පිණ්ඩපාතෙන. සො යෙන යෙනෙව පක්කමති සමාදායෙව පක්කමති. සෙය්යථාපි කෙවඩ්ඪ පක්ඛී සකුණො යෙන යෙනෙව ඩෙති සපත්තභාරො’ව ඩෙති, එවමෙව ඛො කෙවඩ්ඪ භික්ඛු සන්තුට්ඨො හොති කායපරිහාරියෙන චීවරෙන කුච්ඡිපරිහාරියෙන පිණ්ඩපාතෙන. සො යෙන යෙනෙව පක්කමති සමාදායෙව පක්කමති. එවං ඛො කෙවඩ්ඪ භික්ඛු සන්තුට්ඨො හොති."
            },
            {
                "type": "paragraph",
                "text": "35. සො ඉමිනා ච අරියෙන සීලක්ඛන්ධෙන සමන්නාගතො ඉමිනා ච අරියෙන ඉන්ද්රියසංවරෙන සමන්නාගතො ඉමිනා ච අරියෙන සතිසම්පජඤ්ඤෙන සමන්නාගතො ඉමාය ච අරියාය සන්තුට්ඨියා සමන්නාගතො විවිත්තං සෙනාසනං භජති අරඤ්ඤං රුක්ඛමූලං පබ්බතං කන්දරං ගිරිගුහං සුසානං වනපත්ථං අබ්භොකාසං පලාලපුඤ්ජං. සො පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො නිසීදති පල්ලඞ්කං ආභුජිත්වා උජුං කායං පණිධාය පරිමුඛං සතිං උපට්ඨපෙත්වා."
            },
            {
                "type": "paragraph",
                "text": "36. සො අභිජ්ඣං ලොකෙ පහාය විගතාභිජ්ඣෙන චෙතසා විහරති. අභිජ්ඣාය චිත්තං පරිසොධෙති. බ්යාපාදපදොසං පහාය අබ්යාපන්නචිත්තො විහරති සබ්බපාණභූතහිතානුකම්පී. බ්යාපාදපදොසා චිත්තං පරිසොධෙති. ථිනමිද්ධං පහාය විගතථිනමිද්ධො විහරති ආලොකසඤ්ඤී සතො සම්පජානො. ථිනමිද්ධා චිත්තං පරිසොධෙති. උද්ධච්චකුක්කුච්චං පහාය අනුද්ධතො විහරති අජ්ඣත්තං වූපසන්තචිත්තො. උද්ධච්චකුක්කුච්චා චිත්තං පරිසොධෙති. විචිකිච්ඡං පහාය තිණ්ණවිචිකිච්ඡො විහරති අකථංකථී කුසලෙසු ධම්මෙසු. විචිකිච්ඡාය චිත්තං පරිසොධෙති."
            },
            {
                "type": "page-break",
                "text": "506"
            },
            {
                "type": "paragraph",
                "text": "37. සෙය්යථාපි කෙවඩ්ඪ පුරිසො ඉණං ආදාය කම්මන්තෙ පයොජෙය්ය, තස්ස තෙ කම්මන්තා සමිජ්ඣෙය්යුං, සො යානි ච පොරාණානි ඉණමූලානි තානි ච බ්යන්තීකරෙය්ය, සියා චස්ස උත්තරිං අවසිට්ඨං දාරභරණාය, තස්ස එවමස්ස: “අහං ඛො පුබ්බෙ ඉණං ආදාය කම්මන්තෙ පයොජෙසිං. තස්ස මෙ තෙ කම්මන්තා සමිජ්ඣිංසු. සො’හං යානි ච පොරාණානි ඉණමූලානි තානි ච බ්යන්තී අකාසිං. අත්ථි ච මෙ උත්තරිං අවසිට්ඨං දාරභරණායා”ති. සො තතො නිදානං ලභෙථ පාමොජ්ජං, අධිගච්ඡෙය්ය සොමනස්සං-"
            },
            {
                "type": "paragraph",
                "text": "38. සෙය්යථාපි කෙවඩ්ඪ පුරිසො ආබාධිකො අස්ස දුක්ඛිතො බාළ්හගිලානො, භත්තං චස්ස නච්ඡාදෙය්ය, න චස්ස කායෙ බලමත්තා, සො අපරෙන සමයෙන තම්හා ආබාධා මුච්චෙය්ය, භත්තඤ්චස්ස ඡාදෙය්ය, සියා චස්ස කායෙ බලමත්තා, තස්ස එවමස්ස: “අහං ඛො පුබ්බෙ ආබාධිකො අහොසිං දුක්ඛිතො බාළ්හගිලානො. භත්තං ච මෙ නච්ඡාදෙසි. න චස්ස මෙ ආසි කායෙ බලමත්තා. සො’ම්හි එතරහි තම්හා ආබාධා මුත්තො භත්තඤ්ච මෙ ඡාදෙති. අත්ථි ච මෙ කායෙ බලමත්තා”ති. සො තතොනිදානං ලභෙථ පාමොජ්ජං, අධිගච්ඡෙය්ය සොමනස්සං-"
            },
            {
                "type": "paragraph",
                "text": "39. සෙය්යථාපි කෙවඩ්ඪ පුරිසො බන්ධනාගාරෙ බද්ධො අස්ස, සො අපරෙන සමයෙන තම්හා බන්ධනාගාරා මුච්චෙය්ය සොත්ථිනා අබ්බයෙන, න චස්ස කිඤ්චි භොගානං වයො, තස්ස එවමස්ස: “අහං ඛො පුබ්බෙ බන්ධනාගාරෙ බද්ධො අහොසිං. සො’ම්හි එතරහි තම්හා බන්ධනාගාරා මුත්තො සොත්ථිනා අබ්භයෙන. නත්ථි ච මෙ කිඤ්චි භොගානං වයො”ති. සො තතොනිදානං ලභෙථ පාමොජ්ජං, අධිගච්ඡෙය්ය සොමනස්සං-"
            },
            {
                "type": "paragraph",
                "text": "40. සෙය්යථාපි කෙවඩ්ඪ පුරිසො දාසො අස්ස අනත්තාධීනො පරාධීනො න යෙනකාමඞ්ගමො, සො අපරෙන සමයෙන තම්හා දාසබ්යා මුච්චෙය්ය අත්තාධීනො අපරාධීනො භුජිස්සො යෙනකාමඞ්ගමො, තස්ස එවමස්ස: “අහං ඛො පුබ්බෙ දාසො අහොසිං අනත්තාධීනො පරාධීනො න යෙනකාමඞ්ගමො, සො’ම්හි එතරහි තම්හා දාසබ්යා මුත්තො අත්තාධීනො අපරාධීනො භුජිස්සො යෙනකාමඞ්ගමො’ති. සො තතොනිදානං ලභෙථ පාමොජ්ජං, අධිගච්ඡෙය්ය සොමනස්සං-"
            },
            {
                "type": "page-break",
                "text": "508"
            },
            {
                "type": "paragraph",
                "text": "41. සෙය්යථාපි කෙවඩ්ඪ පුරිසො සධනො සභොගො කන්තාරද්ධානමග්ගං පටිපජ්ජෙය්ය දුබ්භික්ඛං සප්පටිභයං. සො අපරෙන සමයෙන තං කන්තාරං නිත්ථරෙය්ය, සොත්ථිනා ගාමන්තං අනුපාපුණෙය්ය ඛෙමං අප්පටිභයං, තස්ස එවමස්ස: “අහං ඛො පුබ්බෙ සධනො සභොගො කන්තාරද්ධානමග්ගං පටිපජ්ජිං දුබ්භික්ඛං සප්පටිභයං. සො’ම්හි එතරහි තං කන්තාරං තිණ්ණො සොත්ථිනා ගාමන්තං අනුප්පත්තො ඛෙමං අප්පටිභය”න්ති. සො තතො නිදානං ලභෙථ පාමොජ්ජං, අධිගච්ඡෙය්ය සොමනස්සං-"
            },
            {
                "type": "paragraph",
                "text": "42. එවමෙව ඛො කෙවඩ්ඪ භික්ඛු යථා ඉණං යථා රොගං යථා බන්ධනාගාරං යථා දාසබ්යං යථා කන්තාරද්ධානමග්ගං එවං ඉමෙ පඤ්ච නීවරණෙ අප්පහීනෙ අත්තනි සමනුපස්සති. සෙය්යථාපි කෙවඩ්ඪ ආනණ්යං යථා ආරොග්යං යථා බන්ධනා මොක්ඛං, යථා භුජිස්සං, යථා ඛෙමන්තභූමිං, එවමෙව ඛො මාණව භික්ඛු ඉමෙ පඤ්ච නීවරණෙ පහීනෙ අත්තනි සමනුපස්සති."
            },
            {
                "type": "paragraph",
                "text": "43. තස්සිමෙ පඤ්ච නීවරණෙ පහීනෙ අත්තනි සමනුපස්සතො පාමොජ්ජං ජායති. පමුදිතස්ස පීති ජායති. පීතිමනස්ස කායො පස්සම්භති. පස්සද්ධකායො සුඛං වෙදෙති. සුඛිනො චිත්තං සමාධියති."
            },
            {
                "type": "paragraph",
                "text": "44. සො විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහරති. සො ඉමමෙව කායං විවෙකජෙන පීතිසුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස විවෙකජෙන පීතිසුඛෙන අප්ඵුටං හොති."
            },
            {
                "type": "paragraph",
                "text": "45. සෙය්යථාපි කෙවඩ්ඪ දක්ඛො න්හාපකො වා න්හාපකන්තෙවාසී වා කංසථාලෙ න්හානීයචුණ්ණානි ආකිරිත්වා උදකෙන පරිප්ඵොසකං පරිප්ඵොසකං සන්නෙය්ය සායං න්හානීයපිණ්ඩි ස්නෙහානුගතා ස්නෙහපරෙතා සන්තරබාහිරා ඵුටා ස්නෙහෙන න ච පග්ඝරණී, එවමෙව ඛො කෙවඩ්ඪ භික්ඛු ඉමමෙව කායං විවෙකජෙන පීතිසුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස විවෙකජෙන පීතිසුඛෙන අප්ඵුටං හොති."
            },
            {
                "type": "page-break",
                "text": "510"
            },
            {
                "type": "paragraph",
                "text": "යම්පි කෙවඩ්ඪ භික්ඛු විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහරති. සො ඉමමෙව කායං විවෙකජෙන පීතිසුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස විවෙකජෙන පීතිසුඛෙන අප්ඵුටං හොති. ඉදම්පි’ස්ස හොති සමාධිස්මිං."
            },
            {
                "type": "paragraph",
                "text": "46. පුන ච පරං කෙවඩ්ඪ භික්ඛු විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියං ඣානං උපසම්පජ්ජ විහරති. සො ඉමමෙව කායං සමාධිජෙන පීතිසුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස සමාධිජෙන පීතිසුඛෙන අප්ඵුටං හොති."
            },
            {
                "type": "paragraph",
                "text": "47. සෙය්යථාපි මහාරාජ උදකරහදො ගම්භීරො උබ්භිදොදකො, තස්ස නෙවස්ස පුරත්ථිමාය දිසාය උදකස්ස ආයමුඛං, න දක්ඛිණාය දිසාය උදකස්ස ආයමුඛං, න පච්ඡිමාය දිසාය උදකස්ස ආයමුඛං, න උත්තරාය දිසාය උදකස්ස ආයමුඛං, දෙවො ච න කාලෙන කාලං සම්මා ධාරං අනුප්පවෙච්ඡෙය්ය. අථ ඛො තම්හාව උදකරහදා සීතා වාරිධාරා උබ්භිජ්ජිත්වා තමෙව උදකරහදං සීතෙන වාරිනා අභිසන්දෙය්ය පරිසන්දෙය්ය පරිපූරෙය්ය පරිප්ඵරෙය්ය, නාස්ස කිඤ්චි සබ්බාවතො උදකරහදස්ස වාරිනා සීතෙන අප්ඵුටං අස්ස, එවමෙව ඛො කෙවඩ්ඪ භික්ඛු ඉමමෙව කායං සමාධිජෙන පීතිසුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස සමාධිජෙන පීතිසුඛෙන අප්ඵුටං හොති. යම්පි කෙවඩ්ඪ භික්ඛු විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියං ඣානං උපසම්පජ්ජ විහරති. සො ඉමමෙව කායං සමාධිජෙන පීතිසුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස සමාධිජෙන පීතිසුඛෙන අප්ඵුටං හොති. ඉදම්පි’ස්ස හොති සමාධිස්මිං."
            },
            {
                "type": "paragraph",
                "text": "48. පුන ච පරං කෙවඩ්ඪ භික්ඛු පීතියා ච විරාගා උපෙක්ඛකො ච විහරති සතො සම්පජානො සුඛඤ්ච කායෙන පටිසංවෙදෙති. යන්තං අරියා ආචික්ඛන්ති: ‘උපෙක්ඛකො සතිමා සුඛවිහාරී’ති, තං තතියං ඣානං උපසම්පජ්ජ විහරති."
            },
            {
                "type": "page-break",
                "text": "512"
            },
            {
                "type": "paragraph",
                "text": "සො ඉමමෙව කායං නිප්පීතිකෙන සුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස නිප්පීතිකෙන සුඛෙන අප්ඵුටං හොති."
            },
            {
                "type": "paragraph",
                "text": "49. සෙය්යථාපි කෙවඩ්ඪ උප්පලිනියං වා පදුමිනියං වා පුණ්ඩරීකිනියං වා අප්පෙකච්චානි උප්පලානි වා පදුමානි වා පුණ්ඩරීකානි වා උදකෙ ජාතානි උදකෙ සංවද්ධානි උදකානුග්ගතානි අන්තොනිමුග්ගපොසීනි, තානි යාව චග්ගා යාව ච මූලා සීතෙන වාරිනා අභිසන්නානි පරිසන්නානි පරිපූරානි පරිප්ඵුටානි, නාස්සා කිඤ්චි සබ්බාවතං උප්පලානං වා පදුමානං වා පුණ්ඩරීකානං වා සීතෙන වාරිනා අප්ඵුටං අස්ස, එවමෙව ඛො කෙවඩ්ඪ භික්ඛු ඉමමෙව කායං නිප්පීතිකෙන සුඛෙන අභිසන්දෙති පරිසන්දෙති පරිපූරෙති පරිප්ඵරති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස නිප්පීතිකෙන සුඛෙන අප්ඵුටං හොති."
            },
            {
                "type": "paragraph",
                "text": "50. පුන ච පරං කෙවඩ්ඪ භික්ඛු සුඛස්ස ච පහානා දුක්ඛස්ස ච පහානා පුබ්බෙව සොමනස්සදොමනස්සානං අත්ථඞ්ගමා අදුක්ඛමසුඛං උපෙක්ඛාසතිපාරිසුද්ධිං චතුත්ථං ඣානං උපසම්පජ්ජ විහරති. සො ඉමමෙව කායං පරිසුද්ධෙන චෙතසා පරියොදාතෙන ඵරිත්වා නිසින්නො හොති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස පරිසුද්ධෙන චෙතසා පරියොදාතෙන අප්ඵුටං හොති. සෙය්යථාපි කෙවඩ්ඪ පුරිසො ඔදාතෙන වත්ථෙන සසීසං පාරුපිත්වා නිසින්නො අස්ස, නාස්ස කිඤ්චි සබ්බාවතො කායස්ස ඔදාතෙන වත්ථෙන අප්ඵුටං අස්ස, එවමෙව ඛො කෙවඩ්ඪ භික්ඛු ඉමමෙව කායං පරිසුද්ධෙන චෙතසා පරියොදාතෙන ඵරිත්වා නිසින්නො හොති. නාස්ස කිඤ්චි සබ්බාවතො කායස්ස පරිසුද්ධෙන චෙතසා පරියොදාතෙන අප්ඵුටං හොති. යම්පි කෙවඩ්ඪ භික්ඛු සුඛස්සච පහානා දුක්ඛස්සච පහානා පුබ්බෙව සොමනස්සදොමනස්සානං අත්ථඞ්ගමා අදුක්ඛමසුඛං උපෙක්ඛාසතිපාරිසුද්ධිං චතුත්ථං ඣානං උපසම්පජ්ජ විහරති, සො ඉමමෙව කායං පරිසුද්ධෙන චෙතසා පරියොදාතෙන ඵරිත්වා නිසින්නො හොති, නාස්ස කිඤ්චි සබ්බාවතො කායස්ස පරිසුද්ධෙන චෙතසා පරියොදාතෙන අප්ඵුටං හොති. ඉදම්පි’ස්ස හොති සමාධිස්මිං."
            },
            {
                "type": "page-break",
                "text": "514"
            },
            {
                "type": "paragraph",
                "text": "51. පුන ච පරං කෙවඩ්ඪ සො භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ ඤාණදස්සනාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො එවං පජානාති: අයං ඛො මෙ කායො රූපී චාතුම්මහාභූතිකො මාතාපෙත්තිකසම්භවො ඔදනකුම්මාසූපචයො අනිච්චුච්ඡාදනපරිමද්දනභෙදනවිද්ධංසනධම්මො. ඉදං ච පන මෙ විඤ්ඤාණං එත්ථ සිතං එත්ථ පටිබද්ධන්ති."
            },
            {
                "type": "paragraph",
                "text": "52. සෙය්යථාපි කෙවඩ්ඪ මණි වෙළුරියො සුභො ජාතිමා අට්ඨංසො සුපරිකම්මකතො අච්ඡො විප්පසන්නො අනාවිලො සබ්බාකාරසම්පන්නො, තත්රස්ස සුත්තං ආවුතං නීලං වා පීතං වා ලොහිතං වා ඔදාතං වා පණ්ඩුසුත්තං වා. තමෙනං චක්ඛුමා පුරිසො හත්ථෙ කරිත්වා පච්චවෙක්ඛෙය්ය: අයං ඛො මණි වෙළුරියො සුභො ජාතිමා අට්ඨංසො සුපරිකම්මකතො, අච්ඡො විප්පසන්නො අනාවිලො සබ්බාකාරසම්පන්නො. තත්රිදං සුත්තං ආවුතං නීලං වා පීතං වා ලොහිතං වා ඔදාතං වා පණ්ඩුසුත්තං වා’ති. එවමෙව ඛො කෙවඩ්ඪ භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ ඤාණදස්සනාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො එවං පජානාති: අයං ඛො මෙ කායො රූපී චාතුම්මහාභූතිකො මාතාපෙත්තිකසම්භවො ඔදනකුම්මාසූපචයො අනිච්චුච්ඡාදනපරිමද්දනභෙදනවිද්ධංසනධම්මො. ඉදං ච පන මෙ විඤ්ඤාණං එත්ථ සිතං එත්ථ පටිබද්ධන්ති."
            },
            {
                "type": "paragraph",
                "text": "53. යම්පි කෙවඩ්ඪ භික්ඛු එවං සමාහිතෙ චිත්තෙ -පෙ- එවං පජානාති -පෙ- ඉදං ච පන මෙ විඤ්ඤාණං එත්ථ සිතං එත්ථ පටිබද්ධන්ති, ඉදම්පි’ස්ස හොති පඤ්ඤාය."
            },
            {
                "type": "page-break",
                "text": "516"
            },
            {
                "type": "paragraph",
                "text": "54. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ මනොමයං කායං අභිනිම්මිනනාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො ඉමම්හා කායා අඤ්ඤං කායං අභිනිම්මිනාති රූපිං මනොමයං සබ්බඞ්ගපච්චඞ්ගිං අහීනින්ද්රියං. සෙය්යථාපි කෙවඩ්ඪ පුරිසො මුඤ්ජම්හා ඉසිකං පවාහෙය්ය. තස්ස එවමස්ස: අයං මුඤ්ජො අයං ඉසිකා. අඤ්ඤො මුඤ්ජො අඤ්ඤා ඉසිකා. මුඤ්ජම්හා ත්වෙව ඉසිකා පබාළ්හා’ති. සෙය්යථාපි වා පන කෙවඩ්ඪ පුරිසො අසිං කොසියා පවාහෙය්ය. තස්ස එවමස්ස: අයං අසි අයං කොසි, අඤ්ඤො අසි අඤ්ඤා කොසි, කොසියා ත්වෙව අසි පබාළ්හො’ති. සෙය්යථාපි වා පන කෙවඩ්ඪ පුරිසො අහිං කරණ්ඩා උද්ධරෙය්ය. තස්ස එවමස්ස: අයං අහි අයං කරණ්ඩො. අඤ්ඤො අහි අඤ්ඤො කරණ්ඩො. කරණ්ඩා ත්වෙව අහි උබ්භතො’ති. එවමෙව ඛො කෙවඩ්ඪ භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ මනොමයං කායං අභිනිම්මිනනාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො ඉමම්හා කායා අඤ්ඤං කායං අභිනිම්මිනාති රූපිං මනොමයං සබ්බඞ්ගපච්චඞ්ගිං අහීනින්ද්රියං. යම්පි කෙවඩ්ඪ භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ -පෙ- අඤ්ඤං කායං අභිනිම්මිනාති රූපිං මනොමයං සබ්බඞ්ගපච්චඞ්ගිං අභීනින්ද්රියං, ඉදම්පි’ස්ස හොති පඤ්ඤාය."
            },
            {
                "type": "paragraph",
                "text": "55. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ ඉද්ධිවිධාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති: එකොපි හුත්වා බහුධා හොති. බහුධාපි හුත්වා එකො හොති. ආවීභාවං තිරොභාවං තිරොකුඩ්ඩං තිරොපාකාරං තිරොපබ්බතං අසජ්ජමානො ගච්ඡති සෙය්යථාපි ආකාසෙ, පඨවියා’පි උම්මුජ්ජනිමුජ්ජං කරොති සෙය්යථාපි උදකෙ. උදකෙ’පි අභිජ්ජමානෙ ගච්ඡති සෙය්යථාපි පඨවියං. ආකාසෙ’පි පල්ලඞ්කෙන කමති සෙය්යථාපි පක්ඛී සකුණො. ඉමෙ’පි චන්දිමසූරියෙ එවංමහිද්ධිකෙ එවංමහානුභාවෙ පාණිනා පරාමසති පරිමජ්ජති. යාව බ්රහ්මලොකාපි කායෙන වසං වත්ථෙති."
            },
            {
                "type": "paragraph",
                "text": "56. සෙය්යථාපි කෙවඩ්ඪ දක්ඛො කුම්භකාරො වා කුම්භකාරන්තෙවාසී වා සුපරිකම්මකතාය මත්තිකාය යං යදෙව භාජනවිකතිං ආකඞ්ඛෙය්ය තං තදෙව කරෙය්ය අභිනිප්ඵාදෙය්ය-"
            },
            {
                "type": "page-break",
                "text": "518"
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථා වා පන කෙවඩ්ඪ දක්ඛො දන්තකාරො වා දන්තකාරන්තෙවාසී වා සුපරිකම්මකතස්මිං දන්තස්මිං යං යදෙව දන්තවිකතිං ආකඞ්ඛෙය්ය තං තදෙව කරෙය්ය අභිනිප්ඵාදෙය්ය, සෙය්යථා වා පන කෙවඩ්ඪ දක්ඛො සුවණ්ණකාරො වා සුවණ්ණකාරන්තෙවාසී වා සුපරිකම්මකතස්මිං සුවණ්ණස්මිං යං යදෙව සුවණ්ණවිකතිං ආකඞ්ඛෙය්ය තං තදෙව කරෙය්ය අභිනිප්ඵාදෙය්ය, එවමෙව ඛො කෙවඩ්ඪ භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ ඉද්ධිවිධාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති: එකො’පි හුත්වා බහුධා හොති. -පෙ- යාව බ්රහ්මලොකා’පි කායෙන වසං වත්ථෙති. යම්පි කෙවඩ්ඪ භික්ඛු එවං සමාහිතෙ චිත්තෙ -පෙ- යාව බ්රහ්මලොකා’පි කායෙන වසං වත්ථෙති. ඉදම්පිස්ස හොති පඤ්ඤාය."
            },
            {
                "type": "paragraph",
                "text": "57. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ දිබ්බාය සොතධාතුයා චිත්තං අභිනීහරති අභිනින්නාමෙති. සො දිබ්බාය සොතධාතුයා විසුද්ධාය අතික්කන්තමානුසිකාය උභො සද්දෙ සුණාති දිබ්බෙ ච මානුසෙ ච යෙ දූරෙ සන්තිකෙ ච. සෙය්යථාපි කෙවඩ්ඪ පුරිසො අද්ධානමග්ගපටිපන්නො, සො සුණෙය්ය භෙරිසද්දම්පි මුදිඞ්ගසද්දම්පි සඞ්ඛපණවදෙණ්ඩිමසද්දම්පි, තස්ස එවමස්ස: භෙරිසද්දො ඉති’පි මුදිඞ්ගසද්දො ඉති’පි සඞ්ඛපණවදෙණ්ඩිමසද්දො ඉති’පි. එවමෙව ඛො කෙවඩ්ඪ භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ දිබ්බාය සොතධාතුයා චිත්තං අභිනීහරති අභිනින්නාමෙති. සො දිබ්බාය සොතධාතුයා විසුද්ධාය අතික්කන්තමානුසිකාය උභො සද්දෙ සුණාති දිබ්බෙ ච මානුසෙ ච යෙ දූරෙ සන්තිකෙ ච."
            },
            {
                "type": "paragraph",
                "text": "58. යම්පි කෙවඩ්ඪ භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ -පෙ- උභො සද්දෙ සුණාති දිබ්බෙ ච මානුසෙ ච යෙ දූරෙ සන්තිකෙ ච, ඉදම්පිස්ස හොති පඤ්ඤාය."
            },
            {
                "type": "page-break",
                "text": "520"
            },
            {
                "type": "paragraph",
                "text": "59. සො එවං සමාහිතෙ චිත්තෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ චෙතොපරියඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො පරසත්තානං පරපුග්ගලානං චෙතසා චෙතො පරිච්ච පජානාති: සරාගං වා චිත්තං සරාගං චිත්තන්ති පජානාති. වීතරාගං වා චිත්තං වීතරාගං චිත්තන්ති පජානාති. සදොසං වා චිත්තං සදොසං චිත්තන්ති පජානාති. වීතදොසං වා චිත්තං වීතදොසං චිත්තන්ති පජානාති. සමොහං වා චිත්තං සමොහං චිත්තන්ති පජානාති. වීතමොහං වා චිත්තං වීතමොහං චිත්තන්ති පජානාති. සඞ්ඛිත්තං වා චිත්තං සඞ්ඛිත්තං චිත්තන්ති පජානාති. වික්ඛිත්තං වා චිත්තං වික්ඛිත්තං චිත්තන්ති පජානාති. මහග්ගතං වා චිත්තං මහග්ගතං චිත්තන්ති පජානාති. අමහග්ගතං වා චිත්තං අමහග්ගතං චිත්තන්ති පජානාති. සඋත්තරං වා චිත්තං සඋත්තරං චිත්තන්ති පජානාති. අනුත්තරං වා චිත්තං අනුත්තරං චිත්තන්ති පජානාති. සමාහිතං වා චිත්තං සමාහිතං චිත්තන්ති පජානාති. අසමාහිතං වා චිත්තං අසමාහිතං චිත්තන්ති පජානාති. විමුත්තං වා චිත්තං විමුත්තං චිත්තන්ති පජානාති. අවිමුත්තං වා චිත්තං අවිමුත්තං චිත්තන්ති පජානාති."
            },
            {
                "type": "paragraph",
                "text": "60. සෙය්යථාපි කෙවඩ්ඪ ඉත්ථි වා පුරිසො වා දහරො වා යුවා මණ්ඩණජාතිකො ආදාසෙ වා පරිසුද්ධෙ පරියොදාතෙ අච්ඡෙ වා උදකපත්තෙ සකං මුඛනිමිත්තං පච්චවෙක්ඛමානො සකණිකං වා සකණිකන්ති ජානෙය්ය, අකණිකං වා අකණිකන්ති ජානෙය්ය, එවමෙව ඛො කෙවඩ්ඪ භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ චෙතොපරියඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො පරසත්තානං පරපුග්ගලානං චෙතසා චෙතො පරිච්ච පජානාති: සරාගං වා චිත්තං සරාගං චිත්තන්ති පජානාති. වීතරාගං වා චිත්තං වීතරාගං චිත්තන්ති පජානාති. සදොසං වා චිත්තං සදොසං චිත්තන්ති පජානාති. වීතදොසං වා චිත්තං වීතදොසං චිත්තන්ති පජානාති. සමොහං වා චිත්තං සමොහං චිත්තන්ති පජානාති. වීතමොහං වා චිත්තං වීතමොහං චිත්තන්ති පජානාති. සඞ්ඛිත්තං වා චිත්තං -පෙ- වික්ඛිත්තං වා චිත්තං -පෙ- මහග්ගතං වා චිත්තං -පෙ- අමහග්ගතං වා චිත්තං -පෙ- සඋත්තරං වා චිත්තං -පෙ- අනුත්තරං වා චිත්තං -පෙ- සමාහිතං වා චිත්තං -පෙ- අසමාහිතං වා චිත්තං -පෙ- විමුත්තං වා චිත්තං විමුත්තං චිත්තති පජානාති. අවිමුත්තං වා චිත්තං අවිමුත්තං චිත්තන්ති පජානාති."
            },
            {
                "type": "paragraph",
                "text": "61. යම්පි කෙවඩ්ඪ භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ -පෙ- අවිමුත්තං වා චිත්තං අවිමුත්තං චිත්තන්ති පජානාති, ඉදම්පිස්ස හොති පඤ්ඤාය."
            },
            {
                "type": "page-break",
                "text": "522"
            },
            {
                "type": "paragraph",
                "text": "62. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ පුබ්බෙනිවාසානුස්සතිඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති සෙය්යථිදං: එකම්පි ජාතිං ද්වෙ’පි ජාතියො තිස්සො’පි ජාතියො චතස්සො’පි ජාතියො පඤ්ච’පි ජාතියො දස’පි ජාතියො වීසම්පි ජාතියො තිංසම්පි ජාතියො චත්තාරීසම්පි ජාතියො පඤ්ඤාසම්පි ජාතියො ජාතිසතම්පි ජාතිසහස්සම්පි ජාතිසතසහස්සම්පි අනෙකෙ’පි සංවට්ටකප්පෙ අනෙකෙ’පි විවට්ටකප්පෙ අනෙකෙ’පි සංවට්ටවිවට්ටකප්පෙ ‘අමුත්රාසිං එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො අමුත්ර උපපාදිං. තත්රාපාසිං එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො ඉධූපපන්නො’ති. ඉති සාකාරං සඋද්දෙසං අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති."
            },
            {
                "type": "paragraph",
                "text": "63. සෙය්යථාපි කෙවඩ්ඪ පුරිසො සකම්හා ගාමා අඤ්ඤං ගාමං ගච්ඡෙය්ය, තම්හා’පි ගාමා අඤ්ඤං ගාමං ගච්ඡෙය්ය. සො තම්හා ගාමා සකඤ්ඤෙව ගාමං පච්චාගච්ඡෙය්ය, තස්ස එවමස්ස: ‘අහං ඛො සකම්හා ගාමා අමුං ගාමං අගච්ඡිං. තත්ර එවං අට්ඨාසිං එවං නිසීදිං එවං අභාසිං එවං තුණ්හී අහොසිං. තම්හාපි ගාමා අමුං ගාමං අගච්ඡිං. තත්රාපි එවං අට්ඨාසිං එවං නිසීදිං එවං අභාසිං එවං තුණ්හී අහොසිං. සො’ම්හි තම්හා ගාමා සකඤ්ඤෙව ගාමං පච්චාගතො’ති. එවමෙව ඛො කෙවඩ්ඪ භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ පුබ්බෙනිවාසානුස්සතිඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති සෙය්යථිදං: එකම්පි ජාතිං ද්වෙ’පි ජාතියො තිස්සො’පි ජාතියො චතස්සො’පි ජාතියො පඤ්ච’පි ජාතියො දස’පි ජාතියො වීසම්පි ජාතියො තිංසම්පි ජාතියො චත්තාරීසම්පි ජාතියො පඤ්ඤාසම්පි ජාතියො ජාතිසතම්පි ජාතිසහස්සම්පි ජාතිසතසහස්සම්පි අනෙකෙ’පි සංවට්ටකප්පෙ අනෙකෙපි විවට්ටකප්පෙ අනෙකෙ’පි සංවට්ටවිවට්ටකප්පෙ ‘අමුත්රාසිං එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො අමුත්ර උපපාදිං. තත්රාපාසිං එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො ඉධූපපන්නො’ති ඉති සාකාරං සඋද්දෙසං අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති. යම්පි කෙවඩ්ඪ භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ -පෙ- අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති. ඉදම්පිස්ස හොති පඤ්ඤාය."
            },
            {
                "type": "page-break",
                "text": "524"
            },
            {
                "type": "paragraph",
                "text": "64. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ සත්තානං චුතූපපාතඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සති චවමානෙ උපපජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති: ‘ඉමෙ වත භොන්තො සත්තා කායදුච්චරිතෙන සමන්නාගතා වචීදුච්චරිතෙන සමන්නාගතා මනොදුච්චරිතෙන සමන්නාගතා අරියානං උපවාදකා මිච්ඡාදිට්ඨිකා මිච්ඡාදිට්ඨිකම්මසමාදානා. තෙ කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපන්නා. ඉමෙ වා පන භොන්තො සත්තා කායසුචරිතෙන සමන්නාගතා වචීසුචරිතෙන සමන්නාගතා මනොසුචරිතෙන සමන්නාගතා අරියානං අනුපවාදකා සම්මාදිට්ඨිකා සම්මාදිට්ඨිකම්මසමාදානා. තෙ කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නා’ති. ඉති දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සති චවමානෙ උපපජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති."
            },
            {
                "type": "paragraph",
                "text": "65. සෙය්යථාපි කෙවඩ්ඪ මජ්ඣෙ සිංඝාටකෙ පාසාදො. තත්ථ චක්ඛුමා පුරිසො ඨිතො පස්සෙය්ය මනුස්සෙ ගෙහං පවිසන්තෙ’පි නික්ඛමන්තෙපි රථියා වීථිසඤ්චරන්තෙ’පි මජ්ඣෙ සිංඝාටකෙ නිසින්නෙ’පි. තස්ස එවමස්ස: එතෙ මනුස්සා ගෙහං පවිසන්ති. එතෙ නික්ඛමන්ති. එතෙ රථියා වීථිසඤ්චරන්ති. එතෙ මජ්ඣෙ සිඞ්ඝාටකෙ නිසින්නා’ති. එවමෙව ඛො කෙවඩ්ඪ භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ සත්තානං චුතූපපාතඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සති චවමානෙ උපපජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති: ඉමෙ වත භොන්තො සත්තා කායදුච්චරිතෙන සමන්නාගතා වචීදුච්චරිතෙන සමන්නාගතා මනොදුච්චරිතෙන සමන්නාගතා අරියානං උපවාදකා මිච්ඡාදිට්ඨිකා මිච්ඡාදිට්ඨිකම්මසමාදානා. තෙ කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපන්නා. ඉමෙ වා පන භොන්තො සත්තා කායසුචරිතෙන සමන්නාගතා වචීසුචරිතෙන සමන්නාගතා මනොසුචරිතෙන සමන්නාගතා අරියානං අනුපවාදකා සම්මාදිට්ඨිකා සම්මාදිට්ඨිකම්මසමාදානා. තෙ කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නා’ති. ඉති දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සති චවමානෙ උපපජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති."
            },
            {
                "type": "page-break",
                "text": "526"
            },
            {
                "type": "paragraph",
                "text": "66. යම්පි කෙවඩ්ඪ භික්ඛු එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ -පෙ- සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති. ඉදම්පි’ස්ස හොති පඤ්ඤාය."
            },
            {
                "type": "paragraph",
                "text": "67. සො එවං සමාහිතෙ චිත්තෙ පරිසුද්ධෙ පරියොදාතෙ අනඞ්ගණෙ විගතූපක්කිලෙසෙ මුදුභූතෙ කම්මනියෙ ඨිතෙ ආනෙඤ්ජප්පත්තෙ ආසවානං ඛයඤාණාය චිත්තං අභිනීහරති අභිනින්නාමෙති. සො ඉදං දුක්ඛන්ති යථාභූතං පජානාති. අයං දුක්ඛසමුදයො’ති යථාභූතං පජානාති. අයං දුක්ඛනිරොධො’ති යථාභූතං පජානාති. අයං දුක්ඛනිරොධගාමිනී පටිපදා’ති යථාභූතං පජානාති. ඉමෙ ආසවා’ති යථාභූතං පජානාති. අයං ආසවසමුදයො’ති යථාභූතං පජානාති. අයං ආසවනිරොධො’ති යථාභූතං පජානාති. අයං ආසවනිරොධගාමිනීපටිපදා’ති යථාභූතං පජානාති. තස්ස එවං ජානතො එවං පස්සතො කාමාසවාපි චිත්තං විමුච්චති භවාසවාපි චිත්තං විමුච්චති අවිජ්ජාසවාපි චිත්තං විමුච්චති. විමුත්තස්මිං විමුත්තමිති ඤාණං හොති. ඛීණා ජාති, වුසිතං බ්රහ්මචරියං, කතං කරණීයං, නාපරං ඉත්ථත්තායා’ති පජානාති."
            },
            {
                "type": "paragraph",
                "text": "68. ඉදං වුච්චති කෙවඩ්ඪ අනුසාසනීපාටිහාරියං. ඉමානි ඛො කෙවඩ්ඪ තීණි පාටිහාරියානි මයා සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදිතානි."
            },
            {
                "type": "paragraph",
                "text": "69. භූතපුබ්බං කෙවඩ්ඪ ඉමස්මිඤ්ඤෙව භික්ඛුසඞ්ඝෙ අඤ්ඤතරස්ස භික්ඛුනො එවං චෙතසො පරිවිතක්කො උදපාදි: කත්ථ නු ඛො ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති. අථ ඛො සො කෙවඩ්ඪ භික්ඛු තථාරූපං සමාධිං සමාපජ්ජි, යථාසමාහිතෙ චිත්තෙ දෙවයානියො මග්ගො පාතුරහොසි. අථ ඛො සො කෙවඩ්ඪ, භික්ඛු යෙන චාතුම්මහාරාජිකා දෙවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා චාතුම්මහාරාජිකෙ දෙවෙ එතදවොච: කත්ථ නු ඛො ආවුසො ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ? ති. එවං වුත්තෙ කෙවඩ්ඪ, චාතුම්මහාරාජිකා දෙවා තං භික්ඛුං එතදවොචුං: මයම්පි ඛො භික්ඛු න ජානාම යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති. අත්ථි ඛො භික්ඛු, චත්තාරො මහාරාජානො අම්හෙහි අභික්කන්තතරා ච පණීතතරා ච. තෙ ඛො එතං ජානෙය්යුං, යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති."
            },
            {
                "type": "page-break",
                "text": "528"
            },
            {
                "type": "paragraph",
                "text": "70. අථ ඛො සො කෙවඩ්ඪ, භික්ඛු යෙන චත්තාරො මහාරාජානො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා චත්තාරො මහාරාජෙ එතදවොච: කත්ථ නු ඛො ආවුසො ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූති?"
            },
            {
                "type": "paragraph",
                "text": "71. එවං වුත්තෙ කෙවඩ්ඪ චත්තාරො මහාරාජානො තං භික්ඛුං එතදවොචුං: මයම්පි ඛො භික්ඛු න ජානාම යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං? පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූති. අත්ථි ඛො භික්ඛු තාවතිංසා නාම දෙවා අම්හෙහි අභික්කන්තතරා ච පණීතතරා ච. තෙ ඛො එතං ජානෙය්යුං යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති."
            },
            {
                "type": "paragraph",
                "text": "72. අථ ඛො සො කෙවඩ්ඪ භික්ඛු යෙන තාවතිංසා දෙවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා තාවතිංසෙ දෙවෙ එතදවොච: කත්ථ නු ඛො ආවුසො ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති? එවං වුත්තෙ කෙවඩ්ඪ තාවතිංසා දෙවා තං භික්ඛුං එතදවොචුං: මයම්පි ඛො භික්ඛු න ජානාම යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති. අත්ථි ඛො භික්ඛු සක්කො නාම දෙවානමින්දො අම්හෙහි අභික්කන්තතරො ච පණීතතරො ච. සො ඛො එතං ජානෙය්ය, යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති."
            },
            {
                "type": "paragraph",
                "text": "73. අථ ඛො සො කෙවඩ්ඪ, භික්ඛු යෙන සක්කො දෙවානමින්දො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා සක්කං දෙවානමින්දං එතදවොච: කත්ථ නු ඛො ආවුසො ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති; එවං වුත්තෙ කෙවඩ්ඪ සක්කො දෙවානමින්දො තං භික්ඛුං එතදවොච: අහම්පි ඛො භික්ඛු න ජානාමි යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති. අත්ථි ඛො භික්ඛු යාමා නාම දෙවා අම්හෙහි අභික්කන්තතරා ච පණීතතරා ච. තෙ ඛො එතං ජානෙය්යුං යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති. සෙය්යථිදං පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති."
            },
            {
                "type": "paragraph",
                "text": "74. අථ ඛො සො කෙවඩ්ඪ, භික්ඛු යෙන යාමා දෙවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා යාමෙ දෙවෙ එතදවොච: කත්ථ නු ඛො ආවුසො ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති? එවං වුත්තෙ කෙවඩ්ඪ යාමා දෙවා තං භික්ඛුං එතදවොචුං: මයම්පි ඛො භික්ඛු න ජානාමි යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති. අත්ථි ඛො භික්ඛු සුයාමො නාම දෙවපුත්තො අම්හෙහි අභික්කන්තතෙරා ච පණීතතෙරා ච. සො ඛො එතං ජානෙය්ය යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති."
            },
            {
                "type": "page-break",
                "text": "530"
            },
            {
                "type": "paragraph",
                "text": "75. අථ ඛො සො කෙවඩ්ඪ, භික්ඛු යෙන සුයාමො දෙවපුත්තො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා සුයාමං දෙවපුත්තං එතදවොච: කත්ථ නු ඛො ආවුසො ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති? එවං වුත්තෙ කෙවඩ්ඪ සුයාමො දෙවපුත්තො තං භික්ඛුං එතදවොචුං: අහම්පි ඛො භික්ඛු න ජානාමි යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති. අත්ථි ඛො භික්ඛු තුසිතා නාම දෙවා අම්හෙහි අභික්කන්තතරා ච පණීතතරා ච. තෙ ඛො එතං ජානෙය්යුං යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති."
            },
            {
                "type": "paragraph",
                "text": "76. අථ ඛො සො කෙවඩ්ඪ, භික්ඛු යෙන තුසිතා දෙවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා තුසිතෙ දෙවෙ එතදවොච: කත්ථ නු ඛො ආවුසො ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති? එවං වුත්තෙ කෙවඩ්ඪ තුසිතා දෙවා තං භික්ඛුං එතදවොචුං: මයම්පි ඛො භික්ඛු න ජානාමි යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති. අත්ථි ඛො භික්ඛු සන්තුසිතො නාම දෙවපුත්තො අම්හෙහි අභික්කන්තතෙරා ච පණීතතෙරා ච. සො ඛො එතං ජානෙය්ය යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති."
            },
            {
                "type": "paragraph",
                "text": "77. අථ ඛො සො කෙවඩ්ඪ, භික්ඛු යෙන සන්තුසිතො නාම දෙවපුත්තො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා සන්තුසිතං දෙවපුත්තං එතදවොච: කත්ථ නු ඛො ආවුසො ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති? එවං වුත්තෙ කෙවඩ්ඪ සන්තුසිතො දෙවපුත්තො තං භික්ඛුං එතදවොචුං: අහම්පි ඛො භික්ඛු න ජානාමි යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති. අත්ථි ඛො භික්ඛු නිම්මානරතී නාම දෙවා අම්හෙහි අභික්කන්තතරා ච පණීතතරා ච. තෙ ඛො එතං ජානෙය්යුං යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති."
            },
            {
                "type": "paragraph",
                "text": "78. අථ ඛො සො කෙවඩ්ඪ, භික්ඛු යෙන නිම්මානරතී දෙවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා නිම්මානරතී දෙවෙ එතදවොච: කත්ථ නු ඛො ආවුසො ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති? එවං වුත්තෙ කෙවඩ්ඪ නිම්මානරතී දෙවා තං භික්ඛුං එතදවොචුං: මයම්පි ඛො භික්ඛු න ජානාමි යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති. අත්ථි ඛො භික්ඛු සුනිම්මිතො නාම දෙවපුත්තො අම්හෙහි අභික්කන්තතෙරා ච පණීතතෙරා ච. සො ඛො එතං ජානෙය්ය යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති."
            },
            {
                "type": "page-break",
                "text": "532"
            },
            {
                "type": "paragraph",
                "text": "79. අථ ඛො සො කෙවඩ්ඪ, භික්ඛු යෙන සුනිම්මිතො දෙවපුත්තො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා සුනිම්මිතං දෙවපුත්තං එතදවොච: කත්ථ නු ඛො ආවුසො ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති? එවං වුත්තෙ කෙවඩ්ඪ සුනිම්මිතො දෙවපුත්තො තං භික්ඛුං එතදවොචුං: අහම්පි ඛො භික්ඛු න ජානාමි යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති. අත්ථි ඛො භික්ඛු පරනිම්මිතවසවත්තී නාම දෙවා අම්හෙහි අභික්කන්තතෙරා ච පණීතතෙරා ච. සො ඛො එතං ජානෙය්යුං යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති."
            },
            {
                "type": "paragraph",
                "text": "80. අථ ඛො සො කෙවඩ්ඪ, භික්ඛු යෙන පරනිම්මිතවසවත්තී දෙවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා පරනිම්මිතවසවත්තී දෙවෙ එතදවොච: කත්ථ නු ඛො ආවුසො ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති? එවං වුත්තෙ කෙවඩ්ඪ පරනිම්මිතවසවත්තී දෙවා තං භික්ඛුං එතදවොචුං: මයම්පි ඛො භික්ඛු න ජානාමි යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති. අත්ථි ඛො භික්ඛු වසවත්තී නාම දෙවපුත්තො අම්හෙහි අභික්කන්තතෙරා ච පණීතතෙරා ච. සො ඛො එතං ජානෙය්ය යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති."
            },
            {
                "type": "paragraph",
                "text": "81. අථ ඛො සො කෙවඩ්ඪ, භික්ඛු යෙන වසවත්තී දෙවපුත්තො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා වසවත්තිං දෙවපුත්තං එතදවොච: කත්ථ නු ඛො ආවුසො ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති? එවං වුත්තෙ කෙවඩ්ඪ වසවත්තී දෙවපුත්තො තං භික්ඛුං එතදවොච: අහම්පි ඛො භික්ඛු න ජානාමි යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති. අත්ථි ඛො භික්ඛු බ්රහ්මකායිකා නාම දෙවා අම්හෙහි අභික්කන්තතරා ච පණීතතරා ච. සො ඛො එතං ජානෙය්යුං යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති."
            },
            {
                "type": "paragraph",
                "text": "82. අථ ඛො සො කෙවඩ්ඪ, භික්ඛු තථාරූපං සමාධිං සමාපජ්ජි යථාසමාහිතෙ චිත්තෙ බ්රහ්මයානියො මග්ගො පාතුරහොසි. අථ ඛො සො කෙවඩ්ඪ භික්ඛු යෙන බ්රහ්මකායිකා දෙවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා බ්රහ්මකායිකෙ දෙවෙ එතදවොච: කත්ථ නු ඛො ආවුසො ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති? එවං වුත්තෙ කෙවඩ්ඪ බ්රහ්මකායිකා දෙවා තං භික්ඛුං එතදවොචුං: මයම්පි ඛො භික්ඛු න ජානාමි යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති. අත්ථි ඛො භික්ඛු බ්රහ්මා මහාබ්රහ්මා අභිභු අනභිභූතො අඤ්ඤදත්ථුදසො වසවත්තී ඉස්සරො කත්තා නිම්මාතා සෙට්ඨො සජිතා{1 සඤ්ජිතා : කත්ථචි.} වසී පිතා භූතභව්යානං අම්හෙහි අභික්කන්තතෙරා ච පණීතතෙරා ච. සො ඛො එතං ජානෙය්ය යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති."
            },
            {
                "type": "page-break",
                "text": "534"
            },
            {
                "type": "paragraph",
                "text": "83. “කහං පනාවුසො එතරහි සො මහාබ්රහ්මා?”ති “මයම්පි ඛො භික්ඛු න ජානාම යත්ථ වා බ්රහ්මා යෙන වා බ්රහ්මා යහිං වා බ්රහ්මා’ති. අපි ච භික්ඛු යථා නිමිත්තා දිස්සන්ති ආලොකො සඤ්ජායති ඔභාසො පාතුභවති, බ්රහ්මා පාතුභවිස්සති. බ්රහ්මුනො හෙතං පුබ්බනිමිත්තං පාතුභාවාය යදිදං ආලොකො සඤ්ජායති ඔභාසො පාතුභවතීති. අථ ඛො සො කෙවඩ්ඪ මහාබ්රහ්මා න චිරස්සෙව පාතුරහොසි. අථ ඛො සො කෙවඩ්ඪ භික්ඛු යෙන මහාබ්රහ්මා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා තං මහාබ්රහ්මානං එතදවොච: කත්ථ නු ඛො ආවුසො ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති? එවං වුත්තෙ, කෙවඩ්ඪ, සො මහාබ්රහ්මා තං භික්ඛුං එතදවොච: අහමස්මි භික්ඛු බ්රහ්මා මහාබ්රහ්මා අභිභූ අනභිභූතො අඤ්ඤදත්ථුදසො වසවත්තී ඉස්සරො කත්තා නිම්මාතා සෙට්ඨො සජිතා වසී පිතා භූතභව්යානන්ති."
            },
            {
                "type": "paragraph",
                "text": "84. දුතියම්පි ඛො සො කෙවඩ්ඪ, භික්ඛු තං මහාබ්රහ්මානං එතදවොච: න ඛො’හං තං ආවුසො එවං පුච්ඡාමි: ත්වමසි බ්රහ්මා මහාබ්රහ්මා අභිභූ අනභිභූතො අඤ්ඤදත්ථුදසො වසවත්තී ඉස්සරො කත්තා නිම්මාතා සෙට්ඨො සජිතා වසී පිතා භූතභව්යානන්ති? එවඤ්ච ඛො අහං තං ආවුසො පුච්ඡාමි: කත්ථ නු ඛො ආවුසො ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති? දුතියම්පි ඛො කෙවඩ්ඪ, සො මහාබ්රහ්මා තං භික්ඛුං එතදවොච: අහමස්මි භික්ඛු, බ්රහ්මා මහාබ්රහ්මා අභිභූ අනභිභූතො අඤ්ඤදත්ථුදසො වසවත්තී ඉස්සරො කත්තා නිම්මාතා සෙට්ඨො සජිතා වසී පිතා භූතභව්යානන්ති."
            },
            {
                "type": "paragraph",
                "text": "85. තතියම්පි ඛො සො කෙවඩ්ඪ, භික්ඛු තං මහාබ්රහ්මානං එතදවොච: න ඛො’හං තං ආවුසො එවං පුච්ඡාමි: ත්වමසි බ්රහ්මා මහාබ්රහ්මා අභිභූ අනභිභූතො අඤ්ඤදත්ථුදසො වසවත්තී ඉස්සරො කත්තා නිම්මාතා සෙට්ඨො සජිතා වසී පිතා භූතභව්යානන්ති? එවඤ්ච ඛො අහං තං ආවුසො පුච්ඡාමි: කත්ථ නු ඛො ආවුසො ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති?"
            },
            {
                "type": "page-break",
                "text": "536"
            },
            {
                "type": "paragraph",
                "text": "86. අථ ඛො සො කෙවඩ්ඪ මහාබ්රහ්මා තං භික්ඛුං බාහායං ගහෙත්වා එකමන්තං අපනෙත්වා තං භික්ඛුං එතදවොච: ඉමෙ ඛො මං භික්ඛු බ්රහ්මකායිකා දෙවා එවං ජානන්ති: නත්ථි කිඤ්චි බ්රහ්මුනො අඤ්ඤාතං, නත්ථි කිඤ්චි බ්රහ්මුනො අදිට්ඨං, නත්ථි කිඤ්චි බ්රහ්මුනො අවිදිතං, නත්ථි කිඤ්චි බ්රහ්මුනො අසච්ඡිකතන්ති. තස්මාහං තෙසං සම්මුඛා න බ්යාකාසිං. අහම්පි ඛො භික්ඛු න ජානාමි යත්ථිමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති. තස්මාතිහ භික්ඛු තුය්හෙවෙතං දුක්කටං, තුය්හවෙතං අපරද්ධං, යං ත්වං තං භගවන්තං අතිසිත්වා බහිද්ධා පරියෙට්ඨිං ආපජ්ජසි ඉමස්ස පඤ්හස්ස වෙය්යාකරණාය. ගච්ඡ ත්වං භික්ඛු තමෙව භගවන්තං උපසඞ්කමිත්වා ඉමං පඤ්හං පුච්ඡ. යථා ච තෙ භගවා බ්යාකරොති තථා නං ධාරෙය්යාසීති."
            },
            {
                "type": "paragraph",
                "text": "87. අථ ඛො සො කෙවඩ්ඪ, භික්ඛු සෙය්යථාපි නාම බලවා පුරිසො සමිඤ්ජිතං වා බාහං පසාරෙය්ය පසාරිතං වා බාහං සමිඤ්ජෙය්ය එවමෙව ඛො බ්රහ්මලොකෙ අන්තරහිතො මම පුරතො පාතුරහොසි. අථ ඛො සො කෙවඩ්ඪ, භික්ඛු මං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො කෙවඩ්ඪ, සො භික්ඛු මං එතදවොච: කත්ථ නු ඛො භන්තෙ ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති?"
            },
            {
                "type": "paragraph",
                "text": "88. එවං වුත්තෙ අහං කෙවඩ්ඪ තං භික්ඛුං එතදවොචං: භූතපුබ්බං භික්ඛු සාමුද්දිකා වාණිජා තීරදස්සිං සකුණං ගහෙත්වා නාවාය සමුද්දං අජ්ඣොගාහන්ති. තෙ අතීරදස්සිනියා නාවාය තීරදස්සිං සකුණං මුඤ්චන්ති. සො ගච්ඡතෙව පුරත්ථිමං දිසං, ගච්ඡති දක්ඛිණං දිසං, ගච්ඡති පච්ඡිමං දිසං, ගච්ඡති උත්තරං දිසං, ගච්ඡති උද්ධං, ගච්ඡති අනුදිසං. සචෙ සො සමන්තා තීරං පස්සති, තථාගතකො ව{1 තථාපක්කන්තො ව : ස්යා.} හොති. සචෙ පන සො සමන්තා තීරං න පස්සති, තමෙව නාවං පච්චාගච්ඡති. එවමෙව ඛො ත්වං භික්ඛු යතො යාව බ්රහ්මලොකා පරියෙසමානො ඉමස්ස පඤ්හස්ස වෙය්යාකරණං නාජ්ඣගා, අථ මමඤ්ඤෙව සන්තිකෙ පච්චාගතො. න ඛො එසො භික්ඛු පඤ්හො එවං පුච්ඡිතබ්බො: “කත්ථ නු ඛො භන්තෙ ඉමෙ චත්තාරො මහාභූතා අපරිසෙසා නිරුජ්ඣන්ති, සෙය්යථිදං: පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතූ’ති? එවඤ්ච ඛො එසො භික්ඛු පඤ්හො පුච්ඡිතබ්බො:"
            },
            {
                "type": "page-break",
                "text": "538"
            },
            {
                "type": "paragraph",
                "text": "කත්ථ ආපො ච පඨවී තෙජො වායො න ගාධති.කත්ථ දීඝඤ්ච රස්සඤ්ච අණුං ථූලං සුභාසුභං,කත්ථ නාමඤ්ච රූපඤ්ච අසෙසං උපරුජ්ඣතීති."
            },
            {
                "type": "paragraph",
                "text": "තත්ර වෙය්යාකරණං භවති:"
            },
            {
                "type": "paragraph",
                "text": "විඤ්ඤාණං අනිදස්සනං අනන්තං සබ්බතොපභංඑත්ථ ආපො ච පඨවී තෙජො වායො න ගාධති.එත්ථ දීඝඤ්ච රස්සඤ්ච අණුං ථූලං සුභාසුභංඑත්ථ නාමඤ්ච රූපඤ්ච අසෙසං උපරුජ්ඣති.විඤ්ඤාණස්ස නිරොධෙන එත්ථෙතං උපරුජ්ඣතීති."
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච භගවා. අත්තමනො කෙවඩ්ඪො ගහපතිපුත්තො භගවතො භාසිතං අභිනන්දීති."
            },
            {
                "type": "centered",
                "text": "කෙවඩ්ඪසුත්තං නිට්ඨිතං එකාදසමං.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "pages": {
            "484": {
                "pageNum": 484,
                "footnotesCount": 1
            },
            "486": {
                "pageNum": 486,
                "footnotesCount": 0
            },
            "488": {
                "pageNum": 488,
                "footnotesCount": 0
            },
            "490": {
                "pageNum": 490,
                "footnotesCount": 7
            },
            "492": {
                "pageNum": 492,
                "footnotesCount": 2
            },
            "494": {
                "pageNum": 494,
                "footnotesCount": 0
            },
            "496": {
                "pageNum": 496,
                "footnotesCount": 0
            },
            "498": {
                "pageNum": 498,
                "footnotesCount": 0
            },
            "500": {
                "pageNum": 500,
                "footnotesCount": 0
            },
            "502": {
                "pageNum": 502,
                "footnotesCount": 0
            },
            "504": {
                "pageNum": 504,
                "footnotesCount": 0
            },
            "506": {
                "pageNum": 506,
                "footnotesCount": 0
            },
            "508": {
                "pageNum": 508,
                "footnotesCount": 0
            },
            "510": {
                "pageNum": 510,
                "footnotesCount": 0
            },
            "512": {
                "pageNum": 512,
                "footnotesCount": 0
            },
            "514": {
                "pageNum": 514,
                "footnotesCount": 0
            },
            "516": {
                "pageNum": 516,
                "footnotesCount": 0
            },
            "518": {
                "pageNum": 518,
                "footnotesCount": 0
            },
            "520": {
                "pageNum": 520,
                "footnotesCount": 0
            },
            "522": {
                "pageNum": 522,
                "footnotesCount": 0
            },
            "524": {
                "pageNum": 524,
                "footnotesCount": 0
            },
            "526": {
                "pageNum": 526,
                "footnotesCount": 0
            },
            "528": {
                "pageNum": 528,
                "footnotesCount": 0
            },
            "530": {
                "pageNum": 530,
                "footnotesCount": 0
            },
            "532": {
                "pageNum": 532,
                "footnotesCount": 1
            },
            "534": {
                "pageNum": 534,
                "footnotesCount": 0
            },
            "536": {
                "pageNum": 536,
                "footnotesCount": 1
            },
            "538": {
                "pageNum": 538,
                "footnotesCount": 0
            }
        }
    },
    {
        "filename": "1-9-10-42-55",
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "485"
            },
            {
                "type": "centered",
                "text": "11",
                "level": 3
            },
            {
                "type": "heading",
                "text": "කෙවට්‌ට සූත්‍රය",
                "level": 3
            },
            {
                "format": 13,
                "text": "1. මා විසින් මෙසේ අසන ලදි. එක් සමයෙක භාග්‍යවතුන් වහන්සේ නාලන්දා නුවරට නොදුරු නොළං තන්හි වූ පාවාරික අඹවෙනෙහි වැඩ වසන සේක. එ කල්හි කේවඩ්ඪ නම් ගැහැවිපුත් භාග්‍යවතුන් වහන්සේ කරා එළැඹියේ ය. එළැඹ භාග්‍යවතුන් වහන්සේ සාදර ව වැඳ පසෙක හුන්නේ ය. පසෙක හුන්නා වූ ම කේවඩ්ඪ ගැහැවිපුත් තෙම “වහන්ස, මේ නාලන්දා නගරිය සමෘද්ධ ය, ස්ථිත ය (නන් වැදෑරුම් භාණ්ඩයෙන් පිරුණේ ය), බොහෝ ජනයා ඇත්තේ ය, ගැවැසුණු මිනිසුන් ඇත්තේ ය, භාග්‍යවතුන් වහන්සේ කෙරෙහි වෙසෙසින් පැහැදුණේ ය. වහන්ස, යාච්ඤා කරම්, යමෙක් උතුරුමිනිස්දහමින් ඉදුපෙළහර කරන්නේ නම්, එසේ වූ එක් මහණකුට භාග්‍යවතුන් වහන්සේ අණ කරන සේක් වා. මෙසේ මේ නාලන්දාව වඩාලාත් භාග්‍යවතුන් වහන්සේ කෙරෙහි පහදින්නේ යැ”යි භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "2. මෙසේ කී කල්හි භාග්‍යවතුන් වහන්සේ කේවඩ්ඪ ගැහැවිපුතු බණවා, “කේවඩ්ඪය, ‘මහණෙනි, තෙපි (මෙසේ) එවූ. සුදුවත් හඳින ගිහිනට උතුරුමිනිස්දහමින් පෙළහර කරවු’ යැ යි මහණුනට මෙසේ දහම් නො දෙසමි’යි වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "3. දෙවෙනි වර ද කේවඩ්ඪ ගැහැවිපුත් තෙම “වහන්ස, මේ නාලන්දා නගරිය සමෘද්ධ ය, ස්ථිත ය. බොහෝ ජනයා ඇත්තේ ය. මිනිසුන්ගේ ගැවැසුණේ ය. භාග්‍යවතුන් වහන්සේ කෙරෙහි වෙසෙසින් පැහැදුණේ ය. වහන්ස, යාච්ඤා කරම්, යමෙක් උතුරු මිනිස් දහමින් ඉදුපෙළහර කරන්නේ නම්, එසේ වූ එක් මහණකුට භාග්‍යවතුන් වහන්සේ කෙරෙහි පහදින්නේ යැ යි භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේ ය. දෙවෙනි වර ද භාග්‍යවතුන් වහන්සේ කේවඩ්ඪ ගැහැවිපුතුට, “කේවඩ්ඪය, ‘මහණෙනි, තෙපි (මෙසේ) එවු. සුදුවත් හඳනා ගිහිනට උතුරුමිනිස් දහමින් පෙළහර කරවු’යි මහණුනට මෙසේ දහම් නො දෙසමි”යි වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "4. තෙවෙනි වර ද කේවඩ්ඪ ගැහැවිපුත්, වහන්ස, මම් භාග්‍යවතුන් වහන්සේ (ගුණ නසා) පහත හෙළනුයෙම් නො වෙමි. වැලි දූ මේ නාලන්දා නුවර සමෘද්ධ ය. ස්ථිත ය. බොහෝ ජනයා ඇත්තේ ය. මිනිසුන්ගේ ගැවැසුණේ ය. භාග්‍යවතුන් වහන්සේ කෙරෙහි වෙසෙසින් පැහැදුණේ ය. වහන්ස, යාච්ඤා කරම්, යමෙක් උතුරුමිනිස්දහමින් ඉදුපෙළහර කරන්නේ නම්, එසේ වූ එක් මහණකුට භාග්‍යවතුන් වහන්සේ අණ කරන සේක් වා. මෙසේ මේ නාලන්දාව වඩාලාත් භාග්‍යවතුන් වහන්සේ කෙරෙහි පහදින්නේ යැ යි සිතා ම මෙසේ කියමි”යි මෙ වචන කී ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "487"
            },
            {
                "format": 13,
                "text": "5. (එවිට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක.) “කේවඩ්ඪය, මා විසින් ම වෙසෙසින් දැන පසක් කොට දෙසන ලද මේ පාතිහාර්‍ය තුනෙකි. කවර තුනෙක් ද? යත්, සෘද්ධිප්‍රාතිහාර්‍යය, ආදේශනාප්‍රාතිහාර්‍යය, අනුශාසනප්‍රතිහාර්‍යය යන තුන ය. කේවඩ්ඪය, සෘදධිප්‍රාතිහාර්‍යය කවර යැ? කේවඩ්ඪය, මෙහි මහණ පියෙවියෙන් එකෙක් වැ ම සිටැ බොහෝ පරිදි වෙයි. එසේ බොහෝ වැ සිටැ යලි දු එකෙක් වෙයි. පැනෙන බවට යෙයි. නොපැනෙන බවට ද යෙයි. බිත්තියෙන් පිටතට ද පවුරෙන් පිටතට ද පව්වෙන් පිටතට ද අහසෙහි මෙන් නොගැටෙනුයේ විනිවිද යෙයි. පොළොවෙහි ද දියෙහි මෙන් ගිලීම මතු වීම කෙරෙයි. පොළොවෙහි සේ නොබිඳෙන දියෙහි (දිය නොබිඳැ) යෙයි. අහසෙහි ද පියාපත් ඇති ලිහිණියකු මෙන් පලඟින් යෙයි. මේසා මහ ඉදුමත් මේසා මහ තෙදවත් සඳ හිරු දෙදෙනාපවා අත්ලෙන් ස්පර්‍ශ කෙරෙයි, පිරිමදයි. බඹලොව දක්වා ද කයින් වශය පවත්වයි. නොයෙක් වැදෑරුම් සෘද්ධිවිධ පසක් කෙරෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "6. සැදැහැති පැහැදුණු එක්තරා පුරුෂයෙක්, පියෙවියෙන් එකකු ව සිට බොහෝ පරිදි වන, බොහෝ පරිදි වැ යලි දූ එකකු වන, පැනෙන බවට නොපැනෙන බවට යන, අහසෙහි මෙන් බිත්තියෙන් පිටතට ද පවුරෙන් පිටතට ද නොගැටෙමින් විනිවිද යන, පොළොවෙහි ද දියෙහි මෙන් ගිලීම මතු වීම කරන, පොළොවෙහි සේ නොබිඳෙන දියෙහි යන, අහසෙහි ද පියාපත් ඇති ලිහිණියකු මෙන් පලඟින් යන, මේසා මහ ඉදුමත් මේසා මහතෙදැති සඳහිරු දෙදෙනා අත ගාන, පිරිමදින, බඹලොව දක්වා ද කයින් වශය පවත්වන, මෙසේ නොයෙක් වැදෑරුම් ඉදුකොටස් පසක් කරන එ මහණහු දකී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "7. ඒ සැදැහැති පහන් පුරුෂයා සැදැහැ නැති නොපහන් පුරුෂයකුට ‘භවත, මේ මහණහුගේ මහඉදුමත්බව මහතෙදවත්බව අසිරිමත් ය, පුදුම ය. පියෙවියෙන් එකකු වැ සිට බොහෝ පරිදි වැ යලි එකකු වන ... බඹලොව දක්වාත් කයින් වශය පවත්වන, මෙසේ නොයෙක් වැදෑරුම් සෘද්ධිවිධ පසක් කරන අසෝ මහණහු මම දිටිමි’යි කියයි. එ විට ඒ සැදැහැ ඇති පහන් පුඟුලාට ඒ සැදහැ නැති නොපහන් පුඟුල් තෙම “භවත, ගාන්ධාරි නම් විද්‍යාවෙක් ඇත. ඒ මහණ ඒ විදුයෙන් එකෙක් වැ සිට බොහෝ පරිදි වෙයි ... බඹලොව තෙක් ද කයින් වශය පවත්වයි යන මෙසේ වූ නොයෙක් වැදෑරුම් ඍද්ධිවිධය පසක් කෙරේ යැ”යි කියන්නේ ය. කේවඩ්ඪය, ඒ කිමැ යි සිතහි ද? ඒ සැදැහැ නැති නොපහන් තැනැත්තේ ඒ සැදැහැ ඇති පහත් තැනැත්තහුට මෙසේ කියන්නේ ද?” “එසේ කියන්නේ ය වහන්සැ” කේවඩ්ඪ කී ය. “කේවඩ්ඪය, මම ඉදුපෙළහරෙහි මේ දොස දක්නෙම් ඉදුපෙළහරින් පෙළුණකු බඳු වෙමි, ලජ්ජිත වෙමි, එයට පිළිකුල් කෙරෙමි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "489"
            },
            {
                "format": 13,
                "text": "8. කේවඩ්ඪය, ආදේශනාප්‍රාතිහාර්‍යය කවර යැ? කේවඩ්ඪය, මෙහි මහණ තෙම ‘තා මනස මෙසේත් වෙයි. මෙබඳුත් වෙයි. තාගේ සිතීමත් මෙ බඳු වේ’යැ යි අන් සතුන්ගේ අන් පුඟුලන්ගේ සිත ද හෙලි කොට කියයි. චෛතසික (සිතැ සොම්නස හෝ දොම්නස) ද හෙළි කොට කියයි. (නෙක්බම්ම විතක්කාදි) කල්පනා කළ දෑ ද, (සිත මෙ නම් අරමුණෙහි හැසිරේ යැ යි) සිත හැසිරෙන අරමුණ ද හෙළි කොට කියයි. ‘තා මනස මෙසේත් වෙයි. තා මනස මෙබඳුත් වෙයි. තගේ සිතත් මෙබඳු වේ’යැ යි මෙසේ අන් සතුන්ගේ අන් පුගුලන්ගේ සිත ද හෙළි කොට කියන, චෛතසිකය ද හෙළි කොට කියන, සිත හැසිරීම ද හෙලි කොට කියන, ඒ මහණහු සැදැහැති පැහැදුණු එක්තරා පුඟුලෙක් දකී. ඒ සැදහැති පැහැදුණු පුඟුල් තෙම එක්තරා සැදහැ නැති නොපහන් පුඟුලකුට ‘පින්වත, මහණ වහන්දෑගේ මහඉදුමත්බව මහතෙදැතිබව ඒකාන්තයෙන් අසිරිමත් ය. ඒකාන්තයෙන් පුදුම ය. ‘තා මනස මෙසේත් වෙයි, තා මනස මෙබඳුත් වෙයි. තා සිත මෙබඳුත් වේ යැ’යි මෙසේ අසෝ මහණහු අන් සතුන් අන් පුඟුලන් සිත ද හෙළි කොට කියන්නහු, චෛතසිකය ද හෙළි කොට කියන්නහු, කල්පනාව ද හෙළි කොට කියන්නහු, සිතැ හැසිරීම ද හෙළි කොට කියන්නහු දිටිමි’ යි සැළ කෙරෙයි. ඒ සැදැහැති පැහැදුණු පුඟුලාට ඒ සැදහැ නැති නො පැහැදුණු පුඟුල් තෙම ‘භවත, මණිකා (චින්තාමණි) නම් විද්‍යාවෙක් ඇත් ම ය. ඒ මහණ ‘තා මනස මෙසේත් වෙයි, තා මනස මෙබඳුත් වෙයි, තා සිත මෙබඳුත් වේ’ යැ යි මෙසේ ඒ විද්‍යායෙන් අන් සතුන්ගේ අන් පුඟුලන්ගේ සිත කියයි, චෛතසිකය ද කියයි, විතර්‍කය ද කියයි, චිත්තවිචාරිතය ද කියා යැ යි මෙසේ කියන්නේ ය. ඒ කිමැ යි සිතහි ද? ඒ සැදැහැ නැති නොපැහැදුණු තැනැත්තේ ඒ සැදැහැති පහන් තැනැත්තහුට මෙසේ කියන්නේ ද?” “කියන්නේ ය, වහන්සැ”යි (කේවඩ්ඪ කී ය.) ‘කේවඩ්ඪය, මම් ආදේශනාප්‍රාතිහාර්‍යයාගේ මේ දොස දක්නෙම්, ආදේශනාප්‍රාතිහාර්‍යයෙන් පෙළුණකු බඳු වෙමි, ලජ්ජිත වෙමි, එයට පිළිකුල් කරමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "9. කේවඩ්ඪය, අනුශාසනප්‍රාතිහාර්‍යය කවර යැ? කේවඩ්ඪය, මෙ සස්නැ මහණ තෙම ‘මෙසේ කල්පනා කරවු, මෙසේ මෙනෙහි කරවු, මෙසේ නො මෙනෙහි කරවු, මෙය පහ කරවු, මෙය ලැබ වසවු’යි මෙසේ අනුශාසන කරයි. කේවඩ්ඪය, මේ අනුශාසනප්‍රතිහාර්‍යය යැ යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "10. කේවඩ්ඪය, තව ද අනෙකක් කියමි. මෙහි අර්හත් වූ සම්‍යක් සම්බුද්ධ වූ විද්‍යාචරණසම්පන්න වූ සුගත වූ ලෝකවිත් වූ නිරුත්තර පුරුෂදම්‍යසාරථි වූ දෙව්මිනිස්නට ශාස්තෘ වූ බුද්ධ වූ භගවත් වූ තථාගත තෙමේ ලොවැ පහළ වෙයි. හේ දෙවියන් සහිත වූ මරුන් සහිත වූ මේ ලෝකය ද, මහණබමුණන් සහිත, සම්මත දෙවියන් (රජුන්) හා සෙසු මිනිසුන් හා සහිත සත්ත්‍වප්‍රජාව ද තෙමේ විශිෂ්ට නුවණින් දැන, ප්‍රත්‍යක්‍ෂ කොට, ඔවුනට අවබෝධ කරවයි. හේ දහම් දෙසනුයේ ආදියෙහි භද්‍රක (නිවරද) කොට, මධ්‍යයෙහි භද්‍රක කොට, අර්ථ සහිත කොට, ව්‍යංජන සහිත කොට, සර්‍වප්‍රකාරයෙන් පරිපූර්‍ණ කොට, දහම් දෙසයි. (එසේ දෙසනුයේ ශික්‍ෂාත්‍රයයෙන් සංගෘහිත වූ) ශාසනබ්‍රහමචර්‍යය ප්‍රකාශ කෙරෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "491"
            },
            {
                "format": 13,
                "text": "11. ගැහැවියෙක් හෝ ගැහැවිපුතෙක් හෝ අන් එක්තරා කුලයෙක උපන්නෙක් හෝ ඒ ධර්‍මය අසයි. හේ ඒ දහම් අසා තථාගත බුදුරජුහු කෙරෙහි සැදැහැ ඇති කෙරෙයි. හේ ඒ ශ්‍රද්ධාලාභයෙන් සමන්විත වූයේ, ‘ගිහිගෙයි විසීම සම්බාධයෙකි, රජස්පථයෙකි. පැවිද්ද (සම්බාධ නැති) අභ්‍යවකාශය (එළි මහන) වැන්න. ගිහිගෙයි වසන්නහු විසින් ඒකාන්තයෙන් පිරිසිදු කොට, ශඞ්බලිඛිතයක් සේ කොට මේ බඹසර සරන්නට පහසු නොවේ. (එබැවින්) මම කෙහෙරවුලු බහවා, කසාවත් හැඳ පෙරෙවැ, ගිහිගෙන් පැවිදිබිමට වදනෙම් නම් යෙහෙකැ’යි මෙසේ නුවණින් සලකයි. හේ පසු කලෙක අල්ප වූ හෝ සම්පත් රැස හැරැ, මහත් වූ හෝ සම්පත් රැස හැරැ, මඳ වූ හෝ නෑපිරිස හැරැ, මහත් වූ හෝ නැපිරිස හැර, කෙහෙරවුලු බහවා, කසාවත් හැඳ පෙරෙවැ, ගිහිගෙන් පැවිදිබිමට වදී. හේ මෙසේ පැවිදි වූයේ ම පාතිමොක්බසංවරයෙන් සමන්විත වූයේ, ආචාරයෙන් හා ගෝචරයෙන් හා යුක්ත වූයේ. ස්වල්පමාත්‍ර වූ ද වරදෙහි බිය දක්නේ, නිවරද වූ කායවාක්කර්‍මයේ සමන්විත වූයේ, එහෙයින් ම පිරිසිදු ආජීව ඇතියේ, සිල්වත් වූයේ, ඉන්‍දියයන්හි වැසූ දොර ඇතියේ, බොජුන් හි පමණ දන්නේ, (සත් තන්හි) සිහියෙන් හා නුවණින් හා යුක්ත වූයේ, සිවුපසයෙහි තුන්වැදෑරුම් සතුටින් සතුටු වූයේ, ශික්‍ෂාපදයන්හි සමාදන් වැ ගෙන හික්මෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "12. මහණ තෙමේ කෙසේ නම් සිල්වත් වේ ද? යත්: කේවඩ්ඪය, මෙහි මහණ තෙමේ ප්‍රාණඝාතය හැරැ දමා, ප්‍රාණඝාතයෙන් වෙසෙසින් වැළැක්කේ වෙයි. බහා තැබූ දඬුමුගුරු ඇත්තේ (දඬුමුගුරු නො දරන්නේ), බහා තැබූ ආයුධ ඇත්තේ (ආයුධ නො දරන්නේ), පවට පිළිකුල් කරන්නේ, මෛත්‍රියට පැමිණියේ (මෛත්‍රියෙන් යුක්ත වූයේ), සියලු සතුන් කෙරෙහි හිතානුකම්පා ඇති වැ වෙසේ. මේ ද ඔහුගේ එක් ශීලයෙක් වේ. හේ අදත්තාදානය හැරැ ලා, නොදුන් දෑ ගැන්මෙන් වැළැක්කේ වෙයි. දුන් දැය ම පිළිගන්නාසුලු වූයේ, දුන් දැය ම කැමැති වැ ඉවසනසුලු වූයේ, නොසොර වූ පිරිසිදු සිතින් යුතු වැ වෙසේ. මේ ද ඔහුගේ ශීලයෙක් වේ. හේ අබිරම්සර දුරැ ලා බඹසර සරන්නේ වෙයි. ගැමිදහමක් වූ මෙවුන්දමින් දුරු වැ හැසිරෙන්නේ, එයින් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ. හේ බොරු කීම දුරැ ලා, බොරු කීමෙන් වැළැක්කේ වෙයි. ඇත්ත කියනසුලු වූයේ, ඇත්තෙන් ඇත්ත කළපා කියන්නේ, තහවුරු වැ පිහිටි කථා ඇත්තේ, ඇදහිය යුතු කථා ඇත්තේ, ලොව නො රවටන්නේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ. හේ කේලාම් කීම දුරැ ලා, කේලාම් කීමෙන් වැළැක්කේ වේ. මෙ තැනින් අසා මොවුන් (ඔවුන්ගෙන්) බිඳවනු පිණිස එතන්හි නොකියන සුලු වූයේ, එ තැනින් අසා ඔවුන් (මොවුන්ගෙන්) බිඳවනු පිණිස මෙ තන්හි නො කියනසුලු වූයේ, මෙසේ බිඳුණවුන් ගළපන්නේ (සමග කරන්නේ) ද, එකට ගැළැපුණවුන් (සමගියට පැමිණියවුන්) හට රුකුල් දෙන්නේ ද වෙයි. සමගියෙන් සිටින්නවුන් හා වාසය කැමැත්තේ, සමගියෙන් වසන්නවුනට කැමැත්තේ, සමග වැ සිටින්නවුනට සතුටු වනුයේ, සමගිය ඇති කරන බස් කියන්නේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ. හේ රළු බිණුම් දුරැ ලා, රළු බස් දෙඩුමෙන් වැළැක්කේ වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "493"
            },
            {
                "format": 13,
                "text": "නිදොස්, කන්කලු, පෙම් උපදවන, පහසුවෙන් සිතැ වැදගන්නා, නොගැමි, බොහෝ දෙනාට ප්‍රිය, බොහෝ දෙනාගේ මන වඩන යම් බසෙක් වේ ද, එබඳු වූ බස් කියන්නේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ. හේ බොල් හිස් දෙඩැවිලි හැරැලා, බොල් දෙඩැවිල්ලෙන් වැළැක්කේ වෙයි. සුදුසු කාලවේලායෙහි කථා කරන සුලු වූයේ, ඇත්ත ම කියනසුලු වූයේ, වැඩ සලසන බසක් ම කියනසුලු වූයේ, නව ලොවුතුරුදහම් ඇසුරු කොට ම කියනසුලු වූයේ, හික්මීම ඇති කරන බසක් ම කියනසුලු වූයේ, සිතැ තබා ගන්නට සුදුසු වූ, කරුණු සහිත වූ, ඉමක් කොනක් ඇති (ප්‍රමාණවත් වූ), දෙලෝ වැඩ හා සම්බද්ධ වූ ම බසක් සුදුසු කාලයෙහි කියන්නේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "13. හේ බීජසමූහ (පැළ වන දෑ) ද, භූත සමූහ (පැළ වුණු දෑ) ද සිඳීමෙන් බිඳීමෙන් වැළැක්කේ වෙයි. රෑ බොජුනෙන් වැළැක්කේ, එක් වේලේ වළඳන බත් ඇත්තේ, නොකල්බොජුනෙන් වැළැක්කේ වෙයි. නටනු ගනු වයනු විසුළුදසුන් යන මෙයින් වැළැක්කේ වෙයි. ඇඟැ අඩු තැන් පිරැවීමට, ඇඟ සැරැසීමට කරුණු වන මල්ගඳවිලෙවුන් දැරීමෙන් වැළැක්කේ වෙයි. පමණ ඉක්මි උසසුන් ද, නොකැප වූ මහඅසුන් ද යන දෙකින් ම වැළැක්කේ වෙයි. රන් රදී මසු කහවණු පිළිගැන්මෙන් වැළැක්කේ වෙයි. අමු ධාන්‍ය පිළිගැන්මෙන් වැළැක්කේ වෙයි. අමු මස් පිළිගැන්මෙන් වැළැක්කේ වෙයි. ස්ත්‍රීන් කුමාරිකාවන් පිළිගැන්මෙන් වැළැක්කේ වෙයි. දසිදසුන් පිළිගැන්මෙන් වැළැක්කේ වෙයි. එළුවන් බැටෙළුවන් පිළිගැන්මෙන් වැළැක්කේ වෙයි. කුකුළන් හූරන් පිළිගැන්මෙන් වැළැක්කේ වෙයි. ඇතුන් අසුන් වෙළෙඹුන් ගෙරින් පිළිගැන්මෙන් වැළැක්කේ වෙයි. කෙත්වතු පිළිගැන්මෙන් වැළැක්කේ වෙයි. ගිහියනට දූත මෙහෙවර කිරීමෙහි ද ගෙන් ගෙට පණිවුඩ පණත් ගෙන යෑමෙහි ද යෙදීමෙන් වැළැක්කේ වෙයි. වෙළෙඳ ගනුදෙනුයෙන් වැළැක්කේ වෙයි. හොරතරාදියෙන් කිරුමෙන්, බොරු රන් පෑමෙන්, හොර මිනුම්වලින් මිනුමෙන් වැළැක්කේ වෙයි. අල්ලස් ගෙන හිමියන් නොහිමි කිරීමෙන්, නානා උපායයෙන් අනුන් රැවැටීමෙන්, අගනා දැයට හුරු නො අගනා දැයක් පෙන්නා කරන මායායෙන්, මෙ කී නොකී හැම කෛරාටික කම්වලින් ම වැළැක්කේ වෙයි. අත් පා ආදිය සිඳීමෙන් ද, මැරීමෙන් ද, රැහැන් ආදියෙන් බැඳීමෙන් ද, සැහැසිකම් කිරිමෙන් ද වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "14. යම්සේ සමහර භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, මූලවීජ ද (හිඟුරු ආදි පැළ වන මුල් ද), ස්කන්‍ධ වීජ ද (නුග ආදි පැළවන කඳ ද), පරුවීජ ද (උක් උණ බට ආදි පැළ වන පුරුක් ද). අග්‍රවීජ ද (ඉරිවේරිය ආදි පැළ වන දලු ද ), පස් වනු වීජවීජ ද (වී ආදී පැළ වන ඇට ද) යන මෙ කී වීජසමූහ ද (පැළ වන දෑ ද) භූතසමූහ ද (පැළ වුණු දෑ ද) පෙළීමෙහි (සිඳුම් බිඳුම් තැළුම් යැ යි) කියන ලද සමාරම්භයෙහි යෙදුණෝ වෙසෙත් ද, හෙ තෙමේ මේ හෝ මෙ බඳු වූ වීජග්‍රාමභූතග්‍රාම සමාරම්භයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "495"
            },
            {
                "format": 13,
                "text": "15. යම්සේ ඇතැම් භවත් මහණ බමුණු කෙනෙක් සැදැයෙන් දුන් බොජුන් වළඳා, කන දෑ රැස් කොට තබා ගැන්ම, බොන දෑ රැස් කොට තබා ගැන්ම, වස්ත්‍ර රැස් කොට තබා ගැන්ම, (රිය ගැල් ආදිය ද පාවහන් ආදිය ද යන) යාන රැස් කොට තබා ගැන්ම, ඉහතැ කී දෑ හැර (තවත් තල සහල් ඈ වුව මනා) පසය රැස් කොට තබා ගැන්ම යන මෙසේ වූ සන්නිධිකාරපරිභෝගයෙහි (පසය රැස් කොට තබා ගෙන වැළැඳීමෙහි) යෙදී වෙසෙත් ද, හෙ තෙමේ මේ හෝ මෙබඳු වූ හෝ සන්නිධිකාර පරිභෝගයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "16. යම්සේ සමහර භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා. නැටුම් ගැයුම් වැයුම්, නටසමජ්ජා (නළුවන් සමූහයක් එක් වැ ජනසමූහයා ඉදිරියේ දක්වන නැටුම්), ආඛ්‍යාන (මහාභාරතාදිය කීම හෝ ඇසීම), පාණිස්වර (අතින් ලොහොබර ගැසුම හෝ අත්තල ගැසුම), වේතාල (දඬුමුවා තාළම්පට ගැසීම හෝ මතුරු දපා මළසිරුරු නැගිටුවීම), කුම්භථූන (සිවුරස් බෙර වැයුම), ශෝභනක (රංගබලිකරණය හෙවත් රඟමඩුල්ලෙහි දී දේවතාවනට ස්ත්‍රෝත්‍ර වශයෙන් නාන්දිගීත ගායනය හෝ ප්‍රතිභානචිත්‍ර කිරීම), සණ දොවුන් කෙළිය (හෝ ආයොගුඩක්‍රීඩාව), උණගස් ඔසොවා ගෙන කරන ක්‍රීඩාව, අස්ථිධාවනය (මළවුන්ගේ ඇට සෝදා සුවඳ කවා තබා නකත්සෙමහි ඊ වටා සිට උත්සව කිරීම), ඇත්පොර, අස්පොර, මියුපොර, ගොන්පොර, එළුපොර, බැටෙළුපොර, කුකුළුපොර, වටුපොර, පොලුහරඹ, මිටුයුද, මල්ලපොර, යුද පවත්නා තැන් දක්නට යෑම, බළසෙන් ගණිනා තැන් දක්නට යෑම යන මෙබඳු විසුළු දස්නෙහි යෙදී වෙසෙත් ද, හෙ තෙමේ මේ හෝ මෙ බඳු වූ විසුළු දස්නෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "17. යම්සේ සමහර භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, අටපාකෙළිය, දසපාකෙළිය, අහස්දූකෙළිය, මඬුලු පැනුම, සන්තිකා ක්‍රීඩාව, දාදුකෙළිය, කල්ලි ගැසුම, සලාඅත්කෙළිය, ගූළකෙළිය, කොළනලා පිඹුම, කෙළිනඟුලින් හෑම, කරණම් ගැසුම, කන්නංගුරුවා කෙළිය, කොළනැළියේනවැලි ඈ මැනුම, ක්‍රීඩාරථ පැදවීම, කුඩා දුන්නෙන් විදීම, ඇකිරිකෙළිය (පිටේ හෝ අහසේ අකුරු ඇඳ ඒ කියැවීම), සිතු දැය කීමේ ක්‍රීඩාව, විකෘතංගානුකරණය (කනුත් කොරුන් යන ආදීන් සේ ඉරියවු පැවැත්වීම) යන මෙබඳු වූ පමාවට කරුණු වූ දූකෙළියෙහි යෙදී වෙසෙත් ද, හෙ තෙමේ මෙ හෝ මෙ බඳු වූ පමාවට කරුණු වූ දූකෙළියෙහි යෙදීමෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "18. යම්සේ ඇතැම් භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, දික්සඟළා පුටු ය, පළඟය, මහකොඳුපලසය, වියමනෙන් විසිතුරු කළ එළුලොම්මුවා ඇතිරිය, එළුලොම්මුවා සුදු ඇතිරිය, ගනමල් යෙදූ එළුලොම් ඇතිරිය, තිලිය (පුලුන් මෙත්තය) සිංහරූපාදී රූපවලින් විසිතුරු කළ එළුලොම් ඇතිරිය, දෙපැත්තේ ම ලොම් ඇති එළුලොම්මුවා ඇතිරිය, එක් පැත්තේ පමණක් ලොම් ඇති එළුලොම්මුවා ඇතිරිය, රන්කසුකම් කළ පසතුරුණ, කොසෙය්‍ය හූයින් වියූ ඇතිරිය, ඇතු පිට එළන ඇතිරිය, අසු පිටැ එළන ඇතිරිය, රියැ එළන ඇතිරිය, ඇඳට සරිලන සේ අඳුන් දිවිසමින් මසා කළ ඇතිරිය, කෙහෙල්මුවසමින් කළ මහඟු පසතුරුණ, ඉස්දොර පාමුල රත්කන්වයින් තබා ඇති රතු උඩුවියන් සහිත මහඟු යහන යන මෙබඳු වූ උස්යහන් මහයහන් පරිහරණය කිරීමෙන් යෙදී වෙසෙද්ද, හෙ තෙමේ මේ හෝ මෙ බඳු වූ උස්යහන් මහයහන් පරිභෝගයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "497"
            },
            {
                "format": 13,
                "text": "19. යම්සේ වනාහි ඇතැම් භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, සුවඳසුණුයෙන් ඇඟ ඉලීම, අත්පාඈහි මනා සටහන් ගන්වනුවට තෙල් ගා මැඩීම, සුවඳ දියෙන් නෑවීම, උරහිස්ඈහි මස් වැඩෙනුවට මුගුරින් තැළීම, කැඩපතින් මුහුණ බැලීම, අලංකාර වශයෙන් අඳුන් ගෑම, මල් පැලැඳීම හා විලෙවුන් දැරීම, මුවසුණු මුවවිලෙවුන් දැරීම, හස්තාභරණ දැරීම, හිසැ කුඩුම්බිය බැඳීම, විසිතුරු සැරයටි දැරීම, විසිතුරු බෙහෙත්නළ දැරීම, කඩු දැරීම, විසිතුරු කුඩ දැරීම්, විසිතුරු පාවහන් දෑරීම, නලල්පට බැඳීම, සිළුමිණ පැලැඳීම, විසිතුරු සෙමෙර වල්විදුනා දැරීම, දික් දාවලු ඇති සුදු රෙදි හැඳීම යන ආදි ඇඟ අඩු තැත් පිරැවීමටත් ඇඟ සැරැසීමටත් කරුණු වන දැ පරිභෝග කිරීමෙහි යෙදී වෙසෙත් ද, ඒ මහණ තෙමේ මේ හෝ මෙ බඳු දැ පරිභෝග කිරීමෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "20. යම්සේ වනාහි ඇතැම් භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා රාජකථා චෝරකථා මහාමාත්‍යකථා සේනාකථා භයකථා යුද්ධකථා අහාරකථා පානකථා වස්ත්‍රකථා ශයනකථා මාලාකථා ගන්ධකථා ඥාතිකථා යානකථා ග්‍රාමකථා නිගමකථා නගරකථා ජනපදකථා ස්ත්‍රීකථා පුරුෂකථා කුමාරකථා කුමාරිකථා ශූරකථා වීථිකථා කුම්හස්ථානකථා නානාත්වකථා ලෝකාඛ්‍යායිකාකථා සමුද්‍රාඛ්‍යායිකාකථා ඉතිභවාභවකථා යන මේ බඳු වූ තිරශ්චින කථාවන්හි යෙදී වෙසෙත් ද, ඒ මහණ තෙමේ මෙ කී හෝ මෙයින් අන්‍ය වූ හෝ මෙ බඳු කථාවලින් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "21. යම්සේ වනාහි ඇතැම් භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා “තෝ මේ දහම් විනය නොදනිහි. මම් ම මේ දහම් විනය දනිමි. මේ දහම් විනය කිමැ යි තෝ දනිහි ද? තෝ වරදවා පිළිපන්නෙහි. මම මැනැවින් පිළිපන්නෙම් වෙමි. මා බස කරුණු සහිත ය. තා බස කරුණු රහිත ය. තෝ පළමුයෙත් කියැ යුත්ත පසු වැ කීයෙහි ය. පසු වැ කියැ යුත්ත පළමුයෙන් කීයෙහි ය. තා කලක් ම පුහුණු කළ දැය මගේ එක් වචනයෙන් ම පෙරැළී ගියේ ය. මා විසින් තට දොස් නැඟිණ. මා විසින් නිගන්නා ලද්දෙකි. මා නැඟූ දොසින් මිදෙන්නට හැසිරෙව (ඒ ඒ තැන ගොස් උගනුව). හැකි නම් එය විසඳව” යන ආදීන් මෙ බඳු වූ උනුන් බැණ දොඩා ගැනුම්හි යෙදෙත් ද, ඒ මහණ තෙමේ මේ කී හෝ අන් මෙබඳු වූ හෝ බැණදොඩාගැන්මෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "22. යම්සේ සමහර භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා “මෙහි යන්නැ, අසෝ තැනට එන්නැ, මෙය ගෙනැ යන්නැ, අසෝ තැනට මෙය ගෙනෙන්නැ”යි කළ නියෝග පිළිගෙන, රජුන්ගේ රජමහැමැතියන්ගේ ක්‍ෂත්‍රියයන්ගේ බමුණන්ගේ ගැහැවියන්ගේ රජකුමරුවන්ගේ මේ බඳු දූත මෙහෙවරෙහි පණිවුඩ ගෙන යෑමෙහි යෙදී වෙසෙත් ද, ඒ මහණ තෙමේ මෙ කී හෝ අන් මේ වැනි වූ හෝ දූත මෙහෙවරින් පණිවුඩ ගෙන යෑමෙන් වැළැක්කේ වෙයි. මෙ ද ඔහුගේ ශීලයෙක් වේ,",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "499"
            },
            {
                "format": 13,
                "text": "23. යම්සේ සමහර භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, කුහකකම් කරන්නෝ වෙත් ද, ලාභසත්කාර පතා අනුත් සිත් ඇදෙන සේ වූ වාටු බස් දොඩන්නෝ වෙත් ද, සිවු පසය ලබනු සඳහා කයින් හෝ බසින් ඇඟවීම් කරන්නෝ වෙත් ද, ලාභාපෙක්‍ෂායෙන් අනුනට ගරහන්නෝ වෙත් ද, ලාභයෙන් ලාභය සොයන්නෝ වෙත් ද, ඒ මහණ තෙමේ මේ කී ද මේ බඳු වූ ද කුහනලපනවලින් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශිලයෙක් වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "24. යම්සේ ඇතැම් භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, අංගශාස්ත්‍රය, නිමිත්තශාස්ත්‍රය, උත්පාතලක්‍ෂණය, ස්වප්නශාස්ත්‍රය, ලක්‍ෂණශාස්ත්‍රය, මූෂකච්ඡින්නවිද්‍යාව, අග්නිහෝමය, දර්වීහෝමය, තුෂහෝමය, කණහෝමය, තණ්ඩුලහෝමය, සර්පිෂ්හෝමය, තෛලහෝමය, මුඛහෝමය, ලෝහිතහෝමය, අංගවිද්‍යාව, වාස්තුවිද්‍යාව, ක්‍ෂාත්‍රවිද්‍යාව, ශිවවිද්‍යාව, භූතවිද්‍යාව, භූරිවිද්‍යාව, අහිවිද්‍යාව, විෂවිද්‍යාව, වෘශ්විකවිද්‍යාව, මූෂකවිද්‍යාව, ශාකුනවිද්‍යාව, වායසවිද්‍යාව, පක්වධ්‍යානය, ශරපරිත්‍රාණය, මෘගපක්‍ෂය යන මෙ කී හෝ මෙබඳු වූ හෝ තිරශ්වීනවිද්‍යායෙන්, මිථ්‍යාජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ මේ කී ද මේ බඳු වූ ද තිරශ්චීනවිද්‍යායෙන් මිථ්‍යාජීවයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "25. යම්සේ ඇතැම් භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, මිණිලකුණු, වත්ලකුණු, දඬුලකුණු, කඩුලකුණු, ඊලකුණ, දුනුලකුණු, අවිලකුණු, ඉතිරිලකුණු, පුරිස්ලකුණු, කුමරලකුණු, කුමරිලකුණු, දස්ලකුණු, දැසිලකුණු, ඇත්ලකුණු, අස්ලකුණු, මියුලකුණු, වහප්ලකුණු, ගොන්ලකුණු, එළුලකුණු, බැටෙළුලකුණු, කුකුළුලකුණු, වටුලකුණු, ගොය්ලකුණු, කැණිලකුණු, කසුබුලකුණු, මුවලකුණු යන ආදි මෙ බඳු තිරශ්චීන විද්‍යායෙන්, මෙ බඳු මිථ්‍යාජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ මෙ කී ද මෙබඳු වූ ද තිරශ්චින විද්‍යායෙන් මිථ්‍යාජීවයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශිලයෙක් වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "26. යම්සේ වනාහි ඇතැම් පින්වත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, “අසෝ දිනැ අසෝ නැකැතිත් (යුද සඳහා) සිය නුවරින් අසෝ රජුන්ගේ නික්මීම වන්නේ ය. අසෝ නැකැතිත් පෙරළා සිය නුවරට ඊම වන්නේ ය. අසෝ නැකැතිත් පිටතැ සිටින සතුරු රජුන් හමු වන්නට රට තුළ හුන් රජුන්ගේ යෑම වන්නේ ය. අසෝ නැකැතින් පිටතැ සිටින සතුරු රජුන්ගේ ඉවත් වැ යෑම වන්නේ ය. අසෝ නැකැතින් රට තුළැ සිටින රජුන් කරා පිටතැ සිටින සතුරු රජුන්ගේ පැමිණීම වන්නේ ය. අසෝ නැකැතින් ඇතුළතැ සිටින රජුන්ගේ ඉවත් වැ යෑම වන්නේ ය. රට ඇතුළතැ සිටින රජුනට ජය වන්නේ ය. පිටත සිටින සතුරු රජුනට පරාජය වන්නේ ය. පිටතැ සිටින සතුරු රජුනට ජය වන්නේ ය. රට තුළැ සිටින රජුනට පරාජය වන්නේ යැ” යි මෙසේ ‘මොහුට ජය වන්නේ ය. මොහුට පරාජය වන්නේ යැ’ යි කියමින් මෙ බඳු වූ තිරශ්චීනවිද්‍යායෙන්, මෙ බඳු වූ මිථ්‍යාජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ මේ හෝ මේ බඳු වූ තිරශ්චීනවිද්‍යායෙන්, මිථ්‍යාජීවයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "501"
            },
            {
                "format": 13,
                "text": "27. යම්සේ වනාහි ඇතැම් භවත් මහණබමුණෝ සැදැහැයෙන් දුන් බෝජුන් වළදා, “අසෝ දිනැ චන්ද්‍රග්‍රහණය වන්නේ ය. අසෝ දිනැ සූර්‍යග්‍ර‍හණය වන්නේ ය. අසෝ දිනැ සඳහිරු දෙදෙනා නිසි මඟින් යෑම වන්නේ ය. අසෝ දිනැ ඔවුන් නොමඟින් යෑම වන්නේ ය. අසෝ දිනැ නකත්තරුන් නිසි මගින් යෑම වන්නේ ය. අසෝ දිනැ ඔවුන් නො මඟින් යෑම වන්නේ ය. අසෝ දිනැ උල්කාපතනය වන්නේ ය. දිග්දාහය වන්නේ ය. භුමිකම්පනය වන්නේ ය. වැසි නැති වැ අහස් ගෙරැවුම් වන්නේ ය. සඳහිරුන්ගේ ද නකත් තරුන්ගේ ද උදාව බැසීම් කෙලෙසීම් පිරිසිදුබව වන්නේ ය. චන්‍ද්‍රග්‍රහණය ලොවට මෙබඳු පල ගෙනැ දෙන්නේ ය. සුර්‍ය්‍යග්‍රහණය මෙබඳු පල ගෙනැ දෙන්නේ ය. නක්‍ෂත්‍රග්‍රහණය මෙබඳු පල ගෙනැ දෙන්නේ ය. සඳ හිරුන් නිසි මගින් යැම් මෙබඳු පල ගෙනැ දෙන්නේ ය. සඳ හිරුන් දෙදෙනාගේ නොමඟින් යෑම මෙබඳු පල ගෙනැ දෙන්නේ ය. නකත්තරුවල පථගමනය මෙබඳු පල ගෙනැ දෙන්නේ ය. ඔවුන්ගේ උත්පථගමනය මෙබඳු පල ගෙනැ දෙන්නේ ය. උල්කාපතනය මෙබඳු පල ගෙනැ දෙන්නේ ය. දිග්දාහය මෙබඳු පල ගෙනැ දෙන්නේ ය. භුමිකම්පනය මෙබඳු පල ගෙනැ දෙන්නේ ය. වැසි නැති වැ අහස් ගෙරැවුම් මෙබඳු පල ගෙන දෙන්නේ ය. සඳහිරුන්ගේ ද නකත්තරුවල ද උදාවත් බැසීමත් කෙලෙසීමත් පිරිසිදු වීමත් මෙබඳු පල ගෙන දෙන්නේ යැ” යි කියනුවෝ, මෙ බඳු තිරශ්චීන විද්‍යායෙන්, මෙ බඳු මිථ්‍යාජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ මේ හෝ මෙබඳු වූ තිරශ්චීන විද්‍යායෙන්, මිථ්‍යථ්‍යාජීවිකායෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "28. යම්සේ වනාහි ඇතැම් පිත්වත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, “මෙ සමයෙහි වැසි වස්නේ ය. මේ සමයෙඟි නියං වන්නේ ය. මෙ සමයෙහි රට සුභික්‍ෂ වන්නේ ය. මේ සමයෙහි රට දුර්භික්‍ෂ වන්නේ ය. මේ සමයෙහි රටට උවදුරු වන්නේ ය. මේ සමයෙහි රටට බිය වන්නේ ය. මේ කලැ රෝග වන්නේ ය. මෙ කලැ රෝග නැති බව වන්නේ යැ”යි පලාපල කීම ද, මුද්‍රාව (ඇඟිලි පුරුක්හි සංඥාතබා ගිණීම) ද, ගණනාව (එක දෙක යන ආදීන් ගිණීම) ද, කාව්‍යශාස්ත්‍ර‍ ය, ලෝකායතශාස්ත්‍ර‍ යන මේ හෝ මෙ බඳු තිරශ්චින විද්‍යායෙන්, මිථ්‍යා ආජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ මේ හෝ මෙ බඳු වූ තිරශ්චිනවිද්‍යායෙන්, මිථ්‍යාආජීවයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "29. යම්සේ වනාහි ඇතැම් පින්වත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, ආවාහ සඳහා නකත් කීම, විවාහ සඳහා නකත් කීම, වෙන් වූ අඹුසැමියන් එක් වන්නට නකත් කීම, අඹුසැමියන් වෙන් වන්නට නකත් කීම, දුන් ණය රැස් කිරීමට නකත් කීම්, මුදල් ණයට පොලියට දීමට නකත් කීම්, සෞභාග්‍යය ඇති වනුවට යන්ත්‍ර මන්ත්‍රාදිය කැරැ දීම, බිම් පාලු වන්නට හදි හූනියම් කිරීම්, නැසෙන්නට යන දරු ගබ් රැකෙන්නට පිළියම් කිරීම, දිවගුලු බැඳීම, මන්ත්‍රාදියේ බලයෙන් හනු තද කිරීම්, අත් පෙරැලෙන්නට මතුරු දැපීම, හනු පෙරැලෙන්නට මතුරු දැපීම, කන් අගුලු වැටෙන්නට මතුරු දැපීම, කැඩපතෙහි දේවතාවේශය කොට ප්‍රශ්න ඇසීම, කුමරියක ලවා පේන කියැවීම, දෙව්දැස්සක ලවා පේන කියැවීම, ජීවිකා පිණිස හිරු පිදීම, මහබඹු පිදීම, මතුරු දපා මුවින් ගිනිජල් විහිදුවීම, මතුරු දපා සිරිකත කැඳවීම යන මේ හෝ අන් මෙ බඳු වූ තීරශ්චින විද්‍යායෙන්, මිථ්‍යාජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ මේ හෝ මෙ බඳු වූ තිරශ්චීනවිද්‍යායෙන්, මිථ්‍යාජීවයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "503"
            },
            {
                "format": 13,
                "text": "30. යම්සේ ඇතැම් පින්වත් මහණබමුණෝ සැදැහැයෙන් දුන් බොජුන් වළඳා, ශාන්තිකර්‍ම, ප්‍රණිධිකර්‍ම, භුරිකර්‍ම, පණ්ඩකයා පිරිමියකු කිරීම, පිරිමියා පණ්ඩකයකු කිරීම, වාස්තුකර්‍ම, වාස්තු පරිකිරණ, මතුරු දපා මුව දෙවුම, මතුරු දපා අනුන් නෑවීම, සෙත් පතා ගිනි පිදීම, ගිහියනට වමන කරවීම, බඩ විරේක කරවීම, ළය විරේකයට බේත් දීම, වස්ති කිරීම, ශීර්‍ෂවිරේචන බෙත් දීම්, කන් ලෙඩට තෙල් පිසැ දීම, ගිහියන් සඳහා ඇස පටලයට සිසිල ගන්වන නෙත්තෙල් පිසීම, ගිහියනට නස්‍ය දීම, කාරම් අඳුන් සාදා දීම, ඇස සිසිල ගන්වන අඳුන් සාදා දීම, ගිහියන්ගේ ඇසැ උල්ඇන ලෙඩට බේත් කිරීම, ගිහියනට ශල්‍ය කර්‍ම කිරීම, ළදරුවන්ගේ ලෙඩට පිළියම් කිරීම, මුල් බෙහෙත් දීම (කායචිකිත්සාව) කාරම් බේත් බැඳ වණ සුව වූ පසු ඒවා ගළවා දැමීම යැ” යි මෙ ආදි හෝ මෙබඳු වූ තිරශ්චීනවිද්‍යායෙන්, මිථ්‍යාආජීවයෙන් දිවි පවත්වත් ද, ඒ මහණ තෙමේ මේ හෝ මෙ බඳු වූ තිරශ්චිනවිද්‍යායෙන්, මිථ්‍යාජීවයෙන් වැළැක්කේ වෙයි. මේ ද ඔහුගේ ශීලයෙක් වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "31. කේවඩ්ඪය, ඒ මහණ තෙමේ මෙසේ ශීලසම්පන්න වූයේ, ශීලසංවරහේතුයෙන් කිසි ම එක ද අසංවරතායෙකින් පහළ වියැ හැකි බියක් නො දකී. කේවඩ්ඪය, ක්‍ෂත්‍රියාභිෂේකයෙන් අභිෂේක ලත්, වැනැසූ සතුරන් ඇති ක්‍ෂත්‍රියයෙක් කිසි ම එක ද සතුරකුගෙන් වියැ හැකි බියක් යම්සේ නො දක්නේ ද, එසේ ම මහණ තෙමේ මෙ පරිද්දෙන් ශීලසම්පන්න වූයේ, ශීලසංවරහේතුයෙන් කිසි ම එක ද අසංවරයෙකින් වියැ හැකි බියක් නො දකී. හේ මේ ආර්‍ය්‍යය ශීලසකන්‍ධයෙන් සමන්විත වූයේ සිය සතන්හි නිදොස් වූ කායික චෛතසික සුඛය විඳී. කේවඩ්ඪය, මෙසේ මහණ තෙමේ ශීලසම්පන්න වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "32. “කේවඩ්ඪය, මහණ තෙමේ කෙසේ නම් ඉඳුරන්ගි වැසූ දොර ඇත්තේ වේ ද යත්: කේවඩ්ඪය, මේ සස්නෙහි මහණ තෙමේ ඇසින් රූපයක් දැක ශුභාදිවශයෙන් එහි ලකුණු නො ගන්නේ වේ. ගුභාදිවශයෙන් අත්පා ආදි අවයවයන්ගේ ආකාර සිතට නො ගන්නේ වේ. යම් කරුණෙකින් චක්‍ෂුරින්‍ද්‍රිය වසා නොගෙන වසන්නහුගේ චිත්තසන්තානය විෂමලෝභ දොම්නස් ආදි ලාමක අකුශල ස්වභාවයෝ ලුහුබඳනාහු ද ඒ වක්‍ෂුරින්‍ද්‍රියයාගේ සංවරය පිණිස හේ පිළිපදී. චක්‍ෂුරින්‍ද්‍රියය රකී. චක්‍ෂුරින්ද්‍රියයෙහි සංවරයට පැමිණේ. කනින් හඬ අසා ... නාසයෙන් ගඳ ආඝ්‍රණය කොට ... දිවෙන් රස ආස්වාදය කොට... කයින් ස්ප්‍රෂ්ටව්‍යය (ඇඟට හැපෙන දෑ) ස්පර්‍ශ කොට ... සිතින් ධර්‍මාලම්බන දැන, ශුභාදිවශයෙන් එහි ලකුණ ගන්නේ නො වේ. ශුභාදිවශයෙන් අත් පා ආදි අවයවයන්ගේ ආකාර සිතට ගන්නේ නො වේ. යම් කරුණෙකින් ශ්‍රොතෙන්‍ද්‍රියය ... ඝ්‍රාණේන්ද්‍රියය .... ජීව්හෙන්ද්‍රියය ... කායෙන්‍ද්‍රියය ... මනඉන්‍ද්‍රියය සංවර කොට නොගෙන වසන්නහුගේ චිත්තසන්තානය විෂමලෝභ දොම්නස් ආදි ලාමක අකුශල ස්වභාවයෝ ලුහුබඳනාහු ද, ඒ ශ්‍රොත්‍රෙන්ද්‍රියයාගේ ... ඝ්‍රාණෙන්‍ද්‍රියයාගේ... ජීව්හෙන්‍ද්‍රියයාගේ ... කායෙන්ද්‍රියයාගේ ... මනඉන්‍ද්‍රියයාගේ සංවරය පිණිස පිළිපදී. ශ්‍රොත්‍ර ... ඝ්‍රාණ ... ජිහ්වා ... කාය ... මනඉන්‍ද්‍රියය රකී. එහි සංවරයට පැමිණේ. හේ මේ ආර්‍ය්‍ය වූ ඉන්‍ද්‍රියසංවරයෙන් සමන්විත වූයේ සිය සතත්හි අව්‍යාසෙකසුඛය (කෙලෙසුන්ගෙන් මිශ්‍ර නොවීමෙන් වූ පිරිසිදු අධිචිත්තසුඛය) විඳී. කේවඩ්ඪය, මෙසේ වනාහි මහණ තෙමේ ඉන්ද්‍රියයන්හි වැසූ දොර ඇත්තේ වේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "505"
            },
            {
                "format": 13,
                "text": "33. කේවඩ්ඪය, මහණ තෙමේ කෙසේ නම් ස්මෘතීසම්ප්‍රජානනයෙන් (සිහි නුවණින්) සමන්විත වේ ද යත්: කේවඩ්ඪය, මේ සස්නෙහි මහණ තෙමේ ඉදිරියට යෑමෙහි පෙරළා ඊමෙහි මනා නුවණින් දැන ම (එය) කරනුයේ වෙයි. ඉදිරි බැලීමෙහි, අනුදික් බැලීමෙහි (වට පිට බැලීමෙහි) මනා නුවණින් දැන ම (එය) කරනුයේ වෙයි. අත් පා ආදිය හැකිළීමේහි, දිගු කිරීමෙහි නුවණින් දැන ම (එය) කරනුයේ වෙයි. සඟළසිවුර ද පාත්‍රය ද සෙසු සිවුරු ද දැරීමෙහි නුවණින් දැන ම කරන්නේ වෙයි. ආහාර ගැන්මෙහි, පැන් පීමෙහි, පිටිකැවිලි ආදිය කෑමෙහි, මී ආදිය රස විඳීමෙහි නුවණින් දැන ම කරනුයේ වෙයි. මල මූ පහ කිරීමෙහි නුවණින් දැන ම කරනුයේ වෙයි. ගමනෙහි සිටීමෙහි හිඳීමෙහි නිදීමෙහි කථා කිරීමෙහි නොබිණීමෙහි නුවණින් දැන ම කරනුයේ වෙයි. කේවඩ්ඪය, මෙසේ වනාහි මහණ තෙමේ සිහි නුවණින් සමන්විත වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "34. කේවඩ්ඪය, කෙසේ නම් මහණ තෙමේ ලද පමණෙහි සතුටු වේ ද යත්: කේවඩ්ඪය, මෙ සස්නෙහි මහණ තෙමේ කායපරිහරණයට ප්‍රමාණ වූ සිවුරින් ද කුක්‍ෂිපරිහරණයට ප්‍රමාණ වු ආහාරයෙන් ද සතුටු වෙයි. හේ යම් යම් තැනකට නික්මැ යේ ද, අට පිරිකර පමණක් ගෙන ම නික්මෙයි. කේවඩ්ඪය, (පියා හඹනුවට තරම්) අත්තටු ඇති කුරුලු තෙමේ යම් යම් තැනක පියා හඹා යේ නම්, පියාපත් බර සහිත ව ම යම් සේ පියා හඹා ද, එසේ ම ඒ මහණ තෙමේ කායපරිහරණයට ප්‍රමාණ වූ සිවුරින් ද කුක්‍ෂිපරිහරණයට ප්‍රමාණ වූ ආහාරයෙන් ද සතුටු වෙයි. හේ යම් යම් තැතකට යේ ද, පා සිවුරු (ආදි අට පිරිකර පමණක්) රැගෙන ම යෙයි. කේවඩ්ඪය, මෙසේ වනාහි මහණ තෙමේ ලද පසයෙහි සතුටු වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "35. කේවඩ්ඪය, ඒ මහණ තෙමේ මෙ ආර්‍ය්‍ය ශීලසකන්‍ධයෙන් ද සමන්විත වූයේ, මෙ ආර්‍ය්‍ය ඉන්‍ද්‍රියසංවරයෙන් ද සමන්විත වූයේ, මෙ ආර්‍ය්‍ය ස්මෘතිසම්ප්‍රජානයෙන් ද සමන්විත වූයේ, මේ ආර්‍ය්‍ය සන්තුෂ්ටියෙන් ද සමන්විත වූයේ, අරණ්‍ය වෘක්‍ෂමූල පර්‍වත කඳුරැලි ගිරිගුහා සොහොන් වනපෙත් (වනප්‍රස්ථ) අභ්‍යවකාශ (එළිමහන්) පිදුරුලෙන් යන මේ කී ජනශුන්‍ය කිසි සෙනස්නක් භජනය කෙරෙයි. හේ පිඬු සෙවීමෙන් පෙරළා ආයේ, පසුබත් සෙමෙහි පලක් බැඳ උඩු කය කෙළින් පිහිටුවා කමටහනට යොමු කොට සිහි එළවා හිඳී. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "36. හේ ලොවැ (පඤ්ච උපාදානස්කන්‍ධය කෙරෙහි) ඇල්ම හැර විෂ්කම්භණප්‍රහාණයෙන් (යට පත් කිරීමෙන්) පහ වූ අභිජ්ඣායෙන් යුත් සිතින් වෙසෙයි. අභිජ්ඣාව කෙරෙන් සිත පිරිසිදු කෙරෙයි. ව්‍යාපාද ප්‍රද්වේෂය (ක්‍රොධය) හැර, ව්‍යාපාද රහිත සිතැත්තේ, සියලු පණ ඇති සතුන් කෙරේ හිතානුකම්පා ඇති වැ වෙසෙයි. ක්‍රෝධය කෙරෙන් සිත පිරිසිදු කෙරෙයි. ස්ත්‍යානමිද්ධය හැර, පහ වූ ස්ත්‍යානමිද්ධය ඇත්තේ, දව රෑ දෙක්හි ම දුටු එළිය හඳුනනු හැකි පිරිසිදු සංඥා ඇත්තේ, සිහියෙනුත් නුවණිනුත් යුක්ත වූයේ වෙසෙසි. ස්ත්‍යානමිද්ධය කෙරෙන් සිත පිරිසිදු කෙරෙයි. උදහසත් (සිතැ නොසංහුන්බවත්) කුකුසත් (කළ නො කළ දැයෙහි පසුතැවිල්ලත්) සිතින් දුරැ ලා, අනුද්ධත වැ (නොසංහුන් බැවින් තොර වැ), සංහිඳුණු ස්වකීය චිත්තසන්තාතය ඇත්තේ, උදහස් කුකුස් දෙක කෙරෙන් සිත පිරිසිදු කෙරෙයි. සැකය දුරැ ලා, පහ වූ සැක ඇත්තේ, කුසල් දහම්හි සැක නො කරනුයේ, සැකය කෙරෙන් සිත පිරිසුදු කෙරෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "507"
            },
            {
                "format": 13,
                "text": "37. කේවඩ්ඪය, යම්සේ පුරුෂයෙක් ණය මුදලක් ගෙන කර්‍මාන්ත කරන්නේ ද, ඔහුගේ ඒ කර්‍මාන්ත සමෘද්ධ වන්නේ නම්, හේ යම් පරණ ණය මුදල් වී නම්, ඒ සියල්ල ගෙවා අවසන් කරන්නේ ද, මත්තෙහි ඉතිරි වූ යමක් ඇත් තම්, එය අඹුදරුවන් රක්නා පිණිස වන්නේ ද, එසේ වූ ඔහුට “මම් පළමුයෙන් ණයට මුදල් ගෙන කර්‍මාන්ත කෙළෙමි. ඒ මාගේ කර්‍මාන්ත සමෘද්ධ විය. ඒ මම, යම් පරණ ණය මුදල් වී නම්, එය ගෙවා අවසන් කෙළෙමි. අඹුදරුවන් රක්නට වැඩිපුර ඉතිරි වූ මුදලෙක් ද මට ඇතැ” යි මෙසේ සිතෙක් වන්නේ ද, හේ ඒ ණය නැතිබව කරණ කොට ගෙන සතුට ලබන්නේ ද, සොම්නසට පැමිණෙන්නේ ද -",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "38. කේවඩ්ඪය, යම් සේ පුරුෂයෙක් රෝගී වූයේ, දුකට පැමිණියේ, දැඩි ලෙස ගිලන් වන්නේ ද, ඔහුට බතුත් නො රිසියෙන්නේ ද, ඔහුගේ ඇඟපත ශක්ති පමණකුත් නො වන්නේ ද, හේ මෑත කාලයෙහි ඒ ආබාධයෙන් මිදෙන්නේ නම්, ඔහුට බතුත් රිසියෙන්නේ නම්, ඔහු ඇඟපත ශක්තිය ද වන්නේ නම්, “මේ වූ කලි පෙරැ දුකට පත්, දැඩි ගිලන්බව් ඇති ලෙඩෙක් වීමි. මට අහර ද රිසි නො වී ය. මා ඇඟපත ශක්තිය ද නො වී ය. ඒ මම් දැන් ඒ ලෙඩින් මිදුණෙම් වෙමි. ඒ මට අහර ද රිසියෙයි. මා ඇඟපත ශක්තිය ද ඇතැ” යි ඔහුට මෙසේ සිතෙක් වන්නේ නම්, හේ ඒ කරුණින් සතුට ලබන්නේ ද, සොම්නසට පමිණෙන්නේ ද –",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "39. කේවඩ්ඪය, යම් සේ පුරුෂයෙක් හිරගෙහි බැඳුණේ වන්නේ ද, හේ පසු කලෙක ධනය වියදම් නො කොට පහසුවෙන් ඒ හිර ගෙන් මිදෙන්නේ ද, (ඒ හේතුයෙන්) ඔහුගේ කිසි භෝගවිනාශයෙක් නො වන්නේ ද, “මම් වූ කලි පෙරැ හිර ගෙහි බැඳුණෙම් වීමි. ඒ මම් දැන් ධන වියදම් නො කොට පහසුවෙන් ඒ හිර ගෙන් මිදුණෙම් වෙමි. මා‍ගේ භෝගයනට කිසි විනාශයෙක් ද නැතැ” යි ඔහුට මෙසේ සිතෙක් වන්නේ ද,හේ ඒ කරුණින් සතුට ලබන්නේ ද, සොම්නසට පැමිණෙන්නේ ද -",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "40. කේවඩ්ඪය, යම්සේ තමා අයත් පැවැතුම් නැති, අනුත් අයත් පැවැතුම ඇති, කැමැති අතෙක යන්නට අවසර නැති දාස පුරුෂයෙක් වන්නේ ද, හේ මෑත භාගයෙහි තමා අයත් පැවැතුම් ඇතියේ, පරා අයත් පැවැතුම නැතියේ, නිදහස් වූයේ, කැමැති අතෙක යෑ හැකි වූයේ, ඒ දාසභාවයෙන් මිදෙන්නේ ද, එසේ වූ ඔහුට “මම් වූ කලි පෙරැ තමා අයත් පැවැතුම් නැති, පරා අයත් පැවැතුම් ඇති, කැමැති අතෙක යෑ නො හැකි දාසයෙක් වීමි. ඒ මම් දැන් ඒ දාසභාවයෙන් මිදුණෙම්, තමා අයත් පැවැතුම ඇතියෙම්, පරා අයත් පැවැතුම් නැතියෙම්, නිදහස් වූයෙම් කැමැති අතෙක යෑ හැකියෙම් වෙමි” යි මෙසේ සිතෙක් වන්නේ ද, හේ ඒ කරුණින් සතුට ලබන්නේ ද, සොම්නසට පැමිණෙන්නේ ද -",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "509"
            },
            {
                "format": 13,
                "text": "41 කේවඩ්ඪය, යම්සේ ධනවත් වූ භෝගසම්පත් ඇති පුරුෂයෙක් දුර්ලභ ආහාර ඇති, උවදුරු ඇති, දිය නැති දික් මඟකට බස්නේ ද, හේ පසු කලෙක සුවසේ ඒ නිරුදක පෙදෙස ඉක්මැ යන්නේ ද, උවදුරු නැති විපත් නැති ගම්මානයකට බස්නේ ද, එසේ වූ ඔහුට “මම් වූ කලි පෙර ධන ඇතියෙම්, භෝගසම්පත් ඇතියෙම්, දිය නැති, ආහාරදුර්ලභ, ප්‍රතිභය සහිත දික් මඟකට බටුයෙමි. ඒ මම් දැන් සුවසේ ඒ කාන්තාරය තරණය කෙළෙමි. නිරුපද්‍රැත භයරහිත ගමකට පැමිණියෙම් වෙමි”සි සිතෙක් වන්නේ ද, හෝ ඒ කරුණින් සතුට ලබන්නේ ද, සොම්නසට පැමිණෙන්නේ ද –",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "42. කේවඩ්ඪය, එසේ ම මහණ තෙමේ ණයක් මෙන් ලෙඩක් මෙන් හිරගෙයක් මෙන් වහල්බවක් මෙන් දිය නැති දික්මඟක් මෙන් (පිළිවෙළින්) මේ පහ නොවූ නීවරණ පස තමා කෙරෙහි දකී. මාණවය, ණය නැති බව යම්සේ ද, ලෙඩ නැති බව යම්සේ ද, හිරගෙන් මිදුණුබව යම්සේ ද, නිවහල්බව යම්සේ ද, උවදුරු නැති බිම යම්සේ ද, එසේ ම (පිළිවෙළින්) මෙ පහ වූ නීවරණ පස (හෙවත් නීවරණ පසේ දුරු වීම) තමා කෙරෙහි දකී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "43. තමා කෙරෙහි පහ වූ මේ නීවරණ පස දක්නා ඔහුට සතුව උපදී. සතුටු වූවහුට ප්‍රීතීය උපදී. සිතැ ප්‍රීතිය ඇත්තහුගේ නාමකය සංහිඳේ. සංහුන් නාමකය ඇත්තේ සුව විඳී. සුවැතියහු සිත සමාධිගත වේ (එකඟ වේ).",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "44. හේ කාමන්ගෙන් වෙන් ව ම, සෙසු අකුසල් දහමුන්ගෙන් ද වෙන් ව ම, විතර්‍කසහිත, විචාරසහිත, විවේකයෙන් (නීවරණ පහ විමෙන්) උපත් ප්‍රීතියත් සුවයත් ඇති පළමු ධ්‍යානය ලැබ වෙසේ. හේ මේ කරජකය ම විවේකයෙන් උපන් ප්‍රීතිසුඛයෙන් තෙමයි, මුළුල්ල ම තෙමයි, පුරා ලයි, මුළුල්ල ම ස්පර්‍ශ කෙරෙයි. සියලු අඟ පසඟ ඇති ඔහු මුළු කයෙහි ඒ විවේකයෙන් උපන් ප්‍රීතිසුඛයෙන් පැතිරැ වැද නොගත් (නොපහස්නා ලද) කිසි ද තැනෙක් නො වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "45. කේවඩ්ඪය, යම්සේ කපුවෙක් (කිලිඟෙක්) හෝ කපුවකුගේ (කිලිඟකුගේ) අතැවැස්සෙක් හෝ ලොහොතලියෙක නාන සුණු බහා දිය ඉස ඉස පිඬු කරන්නේ ද, ඒ නාන සුණුපිඬ කාවැදුණු දිය ඇත්තේ, හැම තැන ම දියෙන් යුක්ත වූයේ, ඇතුළත පිටත මුළුල්ල ම දියෙන් පැතිරැ ගියේ, දිය නො වගුරුවන්නේත් වේ ද, කේවඩ්ඪය, එසේ ම මහණ තෙමේ මේ කරජකය ම විවේකයෙන් උපන් ප්‍රීතිසුඛයෙන් තෙමයි, මුළුල්ල ම තෙමයි, පුරා ලයි, මුළුල්ල ම ස්පර්‍ශ කෙරෙයි. ඔහුගේ සියලු අඟ පසඟ ඇති මුළු කයෙහි විවෙකජ ප්‍රීතිසුඛයෙන් පැතිර වැද නොගත් කිසි ද තැනෙක් නො වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "511"
            },
            {
                "format": 13,
                "text": "කේවඩ්ඪය, මහණ තෙම කාමයන්ගෙන් වෙන් ව ම, සෙසු අකුසල් දහමුන්ගෙන් ද වෙන් ව ම, විතර්‍කසහිත, විචාරසහිත, විවේකයෙන් උපත් ප්‍රීතියත් සුවයත් ඇති යම් පළමු දහනක් ලැබ වෙසේ ද, හේ ඒ විවේකජ ප්‍රීතිසුඛයෙන් මේ කය ම තෙමයි, මුළුල්ල ම තෙත් කෙරෙයි, පුරා ලයි, හාත්පස පැතිරැ ගනී. ඔහුගේ සියලු කයැ විවේකජ ප්‍රීතිසුඛයෙන් නො පැතිරැ ගත් කිසිදු තැනෙක් නො වෙයි. මේ ද ඔහුගේ සමාධියෙක් වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "46. කේවඩ්ඪය, නැවැත ද (අනෙකක් කියමි:) මහණ තෙමේ විතර්‍ක විචාරයන්ගේ සංහිඳීමෙන්, සිය සතන්හි උපන්, සිස සතන් පහදවන (ශ්‍රද්ධාව හා එක් වැ යෙදුණු), සිතැ එකඟ බව ඇති, විතර්‍කය නැති, විචාරය නැති, සමාධියෙන් උපන්, ප්‍රීතියත් සුවයත් ඇති, දෙවෙනි ධාන්‍යායට පැමිණ වෙහෙසයි. හේ මේ කරජ කය ම සමාධියෙන් උපන් ප්‍රීතිසුඛයෙන් තෙමයි, මුළුල්ල ම තෙත් කෙරෙයි, පුරා ලයි, හැම තැන ම ස්පර්‍ශ කෙරෙයි. ඔහුගේ කයේ විවේකයෙන් උපත් ප්‍රීතිසුඛයෙන් පැතිරැ නොගත් කිසි ද තැ‍නෙක් නො වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "47. කේවඩ්ඪය, යම්සේ යටැ උල්පතින් මතු වන දිය ඇති ගැඹුරු විලෙක් වේ ද, එයට පෙරදිගින් දිය ඇතුළු වන මගෙක් නො වන්නේ ද, දකුණු දෙසින් ද දිය ඇතුළු වන මගෙක් නොවන්නේ ද, පැසිම් දිගින් ද දිය ඇතුළු වන මගෙක් නොවන්නේ ද, උතුරු දෙසින් ද දිය වැද ගන්නා මගෙක් නො වන්නේ ද, වැස්ස ද කලින් කලැ සුදුසු පරිදි නො වසින්නේ ද, එතෙකුදු වුවත් ඒ විලෙන් සිහිල් දියදහර මතු වී ඒ විල ම සිහිල් දියෙන් තෙමන්නේ ද, හැම පරිදි තෙමන්නේ ද, පුරා ලන්නේ ද, හැම තැන ම වැද ගෙන පැතිරැ සිටින්නේ ද, ඒ මුළු විලෙහි සිසිල් දිය පැතිරැ වැද නොගත් කිසි ද තැනෙක් නො මැත් ද, කේවඩ්ඪය, එසේ ම මහණ තෙමේ මෙ කරජ කය ම සමාධියෙන් උපන් ප්‍රීතිසුඛයෙන් තෙමයි, හැම තැන ම තෙත් කෙරෙයි, පුරා ලයි, හැම තැන ම පැතිරැ වැද ගනී. ඔහුගේ ඒ සියලු කයේ සමාධියෙන් උපන් ප්‍රීතිසුඛය පැතිර වැද නොගත් කිසි ද තැනෙක් නො වෙයි. කේවඩ්ඪය, මහණ තෙමේ විතර්‍කවිචාරයන් සංහිඳීමෙන් තමා කෙරෙහි පැහැදීම් ඇති කරන, සිතැ එකඟ බව ඇති, චිතර්‍කරහිත, විචාරරහිත, සමාධියෙන් පහළ වූ, ප්‍රීතිය හා සුඛවෙදනාව හා ඇති යම් දෙවෙනි ධ්‍යානයට පැමිණැ වෙසේ ද, හේ මේ කය ම සමාධියෙන් උපන් ප්‍රීතිසුඛයෙන් තෙමයි. හැම තැන ම තෙත් කෙරෙයි, පුරා ලයි. හැම තැන ම පැතිරැ වැද ගනී. ඔහුගේ ඒ සියලු කයැ සමාධියෙන් උපන් ප්‍රීතිසුඛය පැතිරැ වැද නොගත් කිසි ද තැනෙක් නො වෙයි. මේ ද ඔහුගේ සමාධියෙක් වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "48. නැවැත ද (අනෙකක් කියම්:) කේවඩ්ඪය, මහණ තෙමේ ප්‍රීතිය ගේ ද විරාගයෙන් (පහ වීමෙන්, සංහිඳීමෙන්), උපේක්‍ෂක වැ, සිහියෙන් හා නුවණින් හා යුක්ත වැ වෙසෙයි. (දහන්) සුවය ද කයින් විඳී. ආර්‍ය්‍යයෝ යම් ධ්‍යානයක් හේතු කොට ගෙන ධ්‍යානලාභියා ඇරැබැ ‘උපෙක්‍ෂාව ඇත්තේ, සිහි ඇත්තේ, සුඛවිහරණ ඇත්තේ යැ’ යි කියත් ද, හේ (එසේ වූ) ඒ තෙවෙනි ධ්‍යානයට පැමිණ වෙසේ. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "513"
            },
            {
                "type": "paragraph",
                "text": "හේ මෙ කය ම නිෂ්ප්‍රීතීක සුඛයෙන් තෙමයි. හැම පරිදි තෙත් කෙරෙයි. පුරා ලයි. හැම තැන ම පැතිර වැදැ ගනී. ඔහුගේ කයෙහි ඒ නිෂ්ප්‍රිතීක සුඛයෙන් පැතිර නොගත් කිසි ද තැනෙක් නො වෙයි."
            },
            {
                "format": 13,
                "text": "49. කේවඩ්ඪය, යම්සේ උපුල් විලෙක හෝ පියුම් විලෙක හෝ පඬෙර විලෙක හෝ ඇතැම් උපුල් හෝ පියුම් හෝ පඬෙර හෝ දියෙහි උපන්නේ, දියෙහි වැඩුණේ, දියෙන් නොනැඟුණේ, දිය තුළැ ම ගිලී වැඩෙනුයේ ද, ඒ හැම අක් දක්වාත් මුල් දක්වාත් සිසිල් දියෙන් තෙමුණේ, හැම පරිදි තෙත් වූයේ, පිරී ගියේ, හැම තැන් ම පැතිරැ වැද ගත්තේ වේ ද, ඒ විලෙහි සියලු උපුල්වලැ හෝ පියුම්වලැ හෝ පඬෙරවලැ හෝ සිසිල් දිය පැතිරැ නොගත් තැ‍නෙක් නො වන්නේ ද, කේවඩ්ඪය, එසේ ම මහණ තෙමේ මේ කය ම නිෂ්ප්‍රිතික සුඛයෙන් තෙමයි. හාත්පසින් තෙමයි. පුරා ලයි. හැම පරිදි පැතිරැ වැද ගනී. ඔහුගේ සියලු කයෙහි නිෂ්ප්‍රිතික සුඛයෙන් පැතිරැ වැද නොගත් කිසි ද තැනෙක් නො වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "50. නැවැත ද (අනෙකක් කියම්.) කේවඩ්ඪය, මහණ තෙමේ සුඛ වේදනාව ද දුරැ ලීමෙන්, දුඃඛ වේදනාව ද දුරැ ලීමෙන්, පළමු කොට ම සොම්නස් දොම්නස් දෙදෙනාගේ පහ වීමෙන්, දුක් ද නොවූ, සුව ද නොවූ, උපේක්‍ෂා ස්මෘති යන මොවුන්ගේ පිරිසිදු බව ඇති සතර වන ධ්‍යානය ලැබ වෙසෙයි. හේ මේ කය ම පිරිසිදු ප්‍රභාස්වර සිතින් පැතිරැ වැද ගෙන හුන්නේ වෙයි. ඔහුගේ සියලු කයෙහි පිරිසිදු ප්‍රභාස්වර සිතින් පැතිරැ වැද නො ගෙන සිටි කිසි ද තැනෙක් නො වෙයි. කේවඩ්ඪය, යම්සේ පුරුෂයෙක් සුදු වතින් හිසින් වටා පෙරෙවැ හුන්නේ වේ නම්, ඔහුගේ කයෙහි සුදු වතින් වැද නොගත් (නො වැසුණ) කිසි ද තැනෙක් නො වන්නේ ද, කේවඩ්ඪය, එසේ ම මහණ තෙමේ මේ කය ම පිරිසිදු ප්‍රභාස්වර සිතින් පැතිරැ වැද ගෙන හුන්නේ වෙයි. ඔහු කයැ පිරිසිදු පබසර සිතින් වැද ගෙන නොසිටි කිසි ද තැනෙක් නො වෙයි. කේවඩ්ඪය, මහණ තෙම සුඛ වෙදනාව ද දුක් වේදනාව ද පහ කිරීමෙන්, පළමුවෙන් ම සොම්නස් දොම්නසුන් පහ වැ යෑමේත්, දුක් ද නොවූ සුව ද නො වූ, උපේක්ෂාවත් ස්මෘතියත් යන මොවුන්ගේ පිරිසිදු බව ඇති සිවුවන දහන් ලැබැ වෙසෙයි. එයින් හෙ තෙම මෙ කය ම පිරිසිදු පබසර සිතිත් පැතිරැ ගෙත හුන්නේ වෙයි. ඔහුගේ සියලු කයෙහි පිරිසිදු පබසර සිතින් පැතිරැ නොගත් කිසි ද තැනෙක් නො වෙයි යන යමක් ඇද්ද, මෙ ද ඔහුගේ සමාධියෙක් වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "515"
            },
            {
                "format": 13,
                "text": "51. තව ද (අනෙකක් කියම්) කේවඩ්ඪය, ඒ මහණ තෙමේ මෙසේ එකඟ වූ සිත පිරිසිදු වූ කල්හි, දීප්තිමත් වූ කල්හි, කිලිටි නැති වූ කල්හි, පහ වූ විත්තොපක්ලේශ ඇති කල්හි, මෘදු වූ කල්හි, විදර්‍ශනාභාවනාවට යෝග්‍ය කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පැමිණි කල්හි, විදර්‍ශනාඥානය පිණිස, (පරිකර්ම) සිත එයට අභිමුඛ කෙරෙයි. ඒ අතට නමා හරියි. හේ “මාගේ මේ කය වූ කලි රූපවත් ය, සතර මහාභූතයත්ගෙන් හැදුණේ ය, මාපියන්ගේ ශුක්‍රශොණිතයෙන් උපන්නේ ය, බත් කොමු ආදි අහරින් වැඩුණේ ය, අනිස බව ද දුගඳ හරනුවට සුවඳ විලෙවුන් ඉළියැ යුතු බව ද, ලෙඩ දුරැලනුවට පිරිමැදුම් ඈ කළ යුතු බව ද, එසේ කළ ද බිඳෙන බව ද, විසිරෙන බව ද යන මේ දෑ ස්වභාව කොටැත්තේ ය. මගේ මේ සිත ද මෙහි ලැග්ගේ ය, මෙඟි බැඳුණේ යැ” යි මෙසේ දැන ගනී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "52. කේවඩ්ඪය, යම්සේ සොඳුරු වූ, පිරිසිදු ආකරයෙක පහළ වූ, අටැස් වූ මොනොවට පිරියම් කළ, සියුම් වූ වෙසෙසින් පහන් වූ, පිවිතුරු වූ, ධොවනාදි සියලු ආකාරයෙන් යුත් වෙරළුමිණෙක් වන්නේ ද, එහි නිල්වන් වූ හෝ රන්වන් වූ හෝ රත්වන් වූ හෝ සුදුවන් වූ හෝ පඬුවන් වූ හෝ හුයෙක් අවුනන ලද්දේ වන්නේ ද, එය ඇස් ඇති පුරුෂයෙක් අතෙහි කොට, “මේ වූ කලි සොඳුරු වූ, පිරිසිදු ආකරයෙහි උපන්, අටැස් වූ, මොනොවට පිරියම් කළ, සියුම් වූ, වෙසෙසින් පහන් වූ, පිවිතුරු වූ, සියලු ධොවනාදි ආකාරයෙන් සම්පුර්‍ණ වූ වෙරළුමිණෙක. මෙහි නිල්වන් වූ හෝ රන්වන් වූ හෝ රත්වන් වූ හෝ සුදුවන් වූ හෝ මේ හුයෙක් අවුනන ලදුයේ වේ යැ”යි සලකා බලන්නේ ද, කේවඩ්ඪය, එපරිද්දෙන් ම මහණ තෙමේ මෙසේ සමාධිගත සිත පිරිසිදු කල්හි, දීප්තිමත් වූ කල්හි, කෙලෙස් යටපත් වූ කල්හි, උපක්ලේශයන් පහ වූ කල්හි, මෘදු වූ කල්හි, කර්‍මණ්‍ය වූ කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පැමිණි කල්හි, විදර්‍ශනාඥානය පිණිස සිත අභිමුඛ කෙරෙයි. ඒ අතට නමා හරියි. හෙ තෙම “මාගේ මේ කය වූ කලි රූපී ය, සතර මහාභූතයන්ගෙන් හැදුණේ ය, මාපියන්ගේ ශුක්‍රශොණිතයෙන් නිපන්නේ ය. බත් කොමු ආදි අහරින් වැඩුණේ ය. අනිස බව ද, දුගඳ හරනට සුවඳ විලෙවුන් ඉලියැ යුතු බව ද, ලෙඩ දුරැ ලනුවට පිරිමැදුම් ඈ කළ යුතු බව ද, ඒ කළත් බිඳෙන බව ද, විසිරෙන බව ද යන මේ දෑ ස්වභාව කොටඇත්තේ ය. මාගේ මේ සිත ද මෙහි ලැග ගන්නේ ය, මෙහි බැඳුණේ යැ”යි මෙසේ දැන ගනී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "53, කේවඩ්ඪය, මහණ මෙසේ සමාධිගත සිත ... මාගේ මේ සිත ද මෙහි ලැග ගත්තේ ය. මෙහි බැඳුණේ යැ’ යි මෙසේ දනී යන යමක් ඇද්ද, මේ ද ඔහුගේ ප්‍රඥාවෙක් වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "517"
            },
            {
                "format": 13,
                "text": "54. හේ මෙසේ සමාහිත සිත පිරිසිදු වූ කල්හි, දීප්තිමත් වූ කල්හි, කෙලෙස් නොමැති වූ කල්හි, උපක්ලේශ පහ වූ කල්හි, මෘදු වූ කල්හි, කර්‍මණ්‍ය වූ (ඍද්ධි ඉපැදැවීමට යෝග්‍ය වු) කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පැමිණි කල්හි, මනෝමය ශරීරයක් මවා පානු පිණිස සිත යොමු කෙරෙයි, නැඹුරු කෙරෙයි. හේ මේ සිරුරෙන් රූපී වූ, සියලු අඟපසකින් යුත්, විකල නො වූ ඉඳුරන් ඇති මනෝමය ශරීරයක් මවා පායි. කේවඩ්ඪය, යම්සේ පුරුෂයෙක් මුදුතණගසෙකින් තණකූර (=තණ බඩය) ඇද මෑත් කරන්නේ ද, ඔහුට ‘මේ මුදුතණගස ය, මේ එහි තණබඩය, තණ ගස එකෙකි, එහි බඩය අනෙකෙකි, මුදුතණ ගසකෙරෙන් ම එහි කූර (බඩය) මෑත් කරන ලද්දේ යැ’ යි මෙසේ සිතෙක් වන්නේ ද, කේවඩ්ඪය, යම්සේ පුරුෂයෙක් කඩුවක් කොපුවෙන් ඇද මෑත් කරන්නේ ද, ඔහුට ‘මේ කඩුව ය, මේ කොපුව ය, කඩුව එකෙක, කොපුව අනෙකෙක, කොපුයෙන් ම කඩුව ඇද මෑත් කරන ලද්දේ යැ’යි මෙසේ සිතෙක් වන්නේ ද, කේවඩ්ඪය, යම්සේ වනාහි පුරුෂයෙක් නයකු සැවයෙන් ඇද වෙන් කරන්නේ ද, ඔහුට ‘මේ නයා ය, මේ සැව ය, නයා එකෙක, සැවය අනෙකක, සැවය කෙරෙන්ම නයා ඇද වෙන් කරන ලද්දේයැ’යි මෙසේ සිතෙක් වන්නේ ද, කේවඩ්ඪය, එපරිද්දෙන් ම මහණ තෙමේ මෙසේ සිත සමාධිගත වැ පිරිසිදු වූ කල්හි, දීප්තිමත් වූ කල්හි, කෙලෙස් රහිත වූ කල්හි, උපක්ලේශයන් පහ වැ ගිය කල්හි, මෘදු වූ කල්හි, කර්‍මණ්‍ය වූ කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පත් කල්හි, මනෝමය ශරීරයක් මවා පානු පිණිස සිත යොමු කෙරෙයි, නැඹුරු කෙරෙයි. හේ මේ ශරීරයෙන් රූපී වූ මනෝමය වූ සියලු අඟපසඟින් යුත් අවිකල ඉඳුරන් ඇති අන් සිරුරක් මවා පායි. කේවඩ්ඪය, මහණ තෙමේ මෙසේ සමාධිගත සිත පිරිසිදු වූ කල්හි ... රූපී වූ මනෝමය වූ සියලු අඟපසඟින් යුත් අවිකල ඉඳුරන් ඇති අන් සිරුරක් මවා පායි යන යමක් ඇද්ද, මේ ද ඔහුගේ ප්‍රඥාවෙක් වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "55. හේ‍ මෙසේ සමාහිත සිත පිරිසිදු වූ කල්හි, දීප්තිමත් වූ කල්හි, කෙලෙස් රහිත වූ කල්හි, උපක්ලේශයන් පහ වැ ගිය කල්හි, මෘදු වූ කල්හි, කර්‍මණ්‍ය (=සෘද්ධියට යෝග්‍ය) කල්හි, ස්ථිත කල්හි, නිශ්චලත්‍වයට පැමිණි කල්හි, ඍද්ධිවිධඥානය පිණිස (අභිඥාපාදක) පරිකර්‍ම සිත මෙහෙයයි, නැඹුරු කෙරෙයි. හේ අනේකවිධ වූ ඍද්ධිවිධය (ඍද්ධි කොට්ඨාසය) නැවත නැවත අනුභව කෙරෙයි (හෙවත් නාම කයින් ස්පර්‍ශ කෙරෙයි, ප්‍රත්‍යක්‍ෂ කෙරෙයි, ලබයි): පියෙවියෙන් එකෙක් වැ සිටැ ද (සෘද්ධි බලයෙන්) බහු ප්‍රකාර ද වී යලි දු එකෙක් වෙයි. තමාගේ ප්‍රකට බව කෙරෙයි (පෙනී සිටී). අප්‍රකට බව කෙරෙයි (නො පෙනී සිටියි). බිත්තියෙන් පිටතට, පවුරෙන් පිටතට, පර්‍වතයෙන් පිටතට, අහසෙහි මෙන් කිසිවෙක නො ගැටෙනුයේ මැදින් විනිවිද යෙයි. දියෙහි මෙන් පොළොවෙහි ද යටට බැසීම (ගිලීම), උඩට නැගීම (මතු වීම) කෙරෙයි. නො බිඳෙන (යට නො බස්නා) දියෙහි පොළොවෙහි සේ යෙයි. පක්‍ෂ ඇති සකුණයකු මෙන් අහසෙහි ද පලඟින් (=ඌරුබද්ධාසනායෙන්) යෙයි. මේසා මහර්ද්ධි ඇති මහත් අනුභාව ඇති මේ සඳ හිරු දෙදෙනා ද අතින් පරාමර්‍ශන කෙරෙයි (අල්ලයි), (ඔබමොබ අත යවා) පිරිමදියි. බඹලොව තෙක් ද (සියල්ල) කයින් වශයෙහි පවත්වයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "56. කේවඩ්ඪය, යම්සේ දක්‍ෂ කුඹලෙක් හෝ කුඹලක්හුගේ අතැවැස්සෙක් හෝ මොනොවට පිරියම් කළ (=සකස් කළ) මැට්ටෙන් යම් යම් භාජන විශේෂයක් කැමැත්තේ නම්, ඒ ඒ දැය ම කරන්නේ ද, මොනොවට නිපදවන්නේ ද -",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "519"
            },
            {
                "type": "paragraph",
                "text": "කේවඩ්ඪය, යම්සේ දක්‍ෂ දන්තකාරයෙක් (ඇත්දතින් විසිතුරු රූ ඈ කරන්නෙක්) හෝ දන්තකාරයක්හු අතැවැස්සෙක් හෝ මෙනොවට පිරියම් කළ දතෙහි යම් යම් දන්තවිකෘතියක් තමා කැමැති නම්, ඒ ඒ දැය ම කරන්නේ ද නිපදවන්නේ ද, කේවඩ්ඪය, යම්සේ දක්‍ෂ රන්කරුවෙක් හෝ රන්කරුවක්හු අතැවැස්සෙක් හෝ මොනොවට පිරියම් කළ රනෙහි යම් යම් ස්වර්‍ණවිකෘතියක් තමා කැමැත්තේ නම්, එය එය ම කරන්නේ ද, නිපදවන්නේ ද, එසේ ම කේව්ඪය, මහණ මෙසේ සමාහිත සිත පිරිසිදු කල්හි, පර්‍ය්‍යවදාත කල්හි, අංගණ රහිත කල්හි, උපක්ලේශ පහ වූ කල්හි, මෘදු වූ කල්හි, කර්‍මණ්‍ය කල්හි, ස්ථිත කල්හි, අචල බවට පැමිණැ සිටි කල්හි ඍද්ධිවිධය පිණිස සිත යොමු කෙරෙයි, නමා ලයි. හේ එකෙක් වැ බොහෝ පරිදි වේ ... බඹලොව තෙක් ද කයින් වශය පවත්වයි යන අනෙකවිධ ඍද්ධිවිධ අනුභව කෙරෙයි. කේවඩ්ඪය, මහණ මෙසේ සමාහිත සිත පිරිසිදු වූ කල්හි … බඹලොව දක්වා ද කයින් වශය පවත්වයි, අනේකවිධ ඍද්ධිවිධ අනුභව කෙරේ යන යමක් ඇද්ද, මේ ද ඔහුගේ ප්‍රඥාවෙක් වේ."
            },
            {
                "format": 13,
                "text": "57. හේ මෙසේ සමාහිත සිත පිරිසිදු වූ කල්හි, දීප්තිමත් වූ කල්හි, කෙලෙස් රහිතවූ කල්හි, උපක්ලේශ පහ වැ ගිය කල්හි, මෘදු වූ කල්හි, කර්‍මණ්‍ය වූ කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පැමිණි කල්හි, දිව්‍යශ්‍රෝත්‍රධාතුව පිණිස (=දිවකන් නුවණ පිණිස) සිත යොමු ‍කෙරෙයි, නැඹුරු කෙරෙයි. හේ පිරිසිදු වූ, මිනිසුන්ගේ ශ්‍රවණෝපචාරය ඉක්ම සිටි දිව කනින් දිව්‍ය වූ ද මානුෂක වූ ද, දුරැ වූ ද, ළං වූ ද යන ද්විවිධ ශබ්ද ම අසයි. කේවඩ්ඪය, යම්සේ මිනිසෙක් දික් මඟකව පිළිපන්නේ ද, හේ බෙර හඬත් මිහිඟුබෙර හඬත් පණාබෙර හඬත් ගැටබෙර හඬත් යම් සේ අසන්නේ ද, ඒ අසන ඔහුට මේ බෙර හඬැයි කියාත් මේ මිහිඟුබෙර හඬැ යි කියාත් මේ සක් හඬ යැ, මේ පණාබෙර හඬ යැ, මේ ගැටබෙර හඬ යැ යි කියාත් මෙසේ සිතෙක් වන්නේ ද, කේවඩ්ඪය, එපරිද්දෙන් ම මහණ තෙමේ මෙසේ සමාහිත සිත පිරිසිදු වූ කල්හි, දීප්තිමත් වූ කල්හි, කෙලෙස් රහිත වූ කල්හි, උපක්ලේශ පහ වැ ගිය කල්හි, මෘදු වූ කල්හි, කර්‍මණ්‍ය (කර්‍මක්‍ෂම) වූ කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පැමිණි කල්හි, දිව්‍යශ්‍රෝත්‍රධාතුව පිණිස සිත යොමු කෙරෙයි, නැඹුරු කෙරෙයි. හේ පිරිසිදු වූ, මිනිසුන්ගේ ශ්‍රවණෝපචාරය ඉක්ම දිවකන්නුවණින් දිව්‍ය වූත් මානුෂක වූත් දුරැ වූත් ළඟැ වූත් ද්විවිධ ශබ්ද අසයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "58. කේවඩ්ඪය, ඒ මහණ මෙසේ සමාධිගත වූ සිත පිරිසිදු වූ කල්හි ... දිව්‍ය වූ ද මානුෂක වූ ද, දුරැ වූ ද ළඟැ වූ ද ද්විවිධ ශබ්ද අසයි යන යමෙක් ඇද්ද, මේ ද ඔහුගේ ප්‍රඥාවෙක් වේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "521"
            },
            {
                "format": 13,
                "text": "59. හේ මෙසේ එකඟ වූ සිත පිරිසිදු වූ කල්හි, දිප්තිමත් වූ කල්හි, කෙලෙස් රහිත වූ කල්හි, උපක්ලේශ පහ වැ ගිය කල්හි, මෘදු වූ කල්හි, කර්‍මක්‍ෂම වූ කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පැමිණි කල්හි, චෙතස්පර්‍ය්‍යායඥානය පිණිස (=අනුන්ගේ සිත පිරිසිඳ දන්නා නුවණ පිණිස) සිත යොමු කෙරෙයි, නැඹුරු කෙරෙයි. හේ අන් සත්ත්‍වයන්ගේ අන් පුද්ගලයන්ගේ සිත සියසිතින් පිරිසිඳ දනියි. රාග සහිත සිත රාග සහිත සිතැ යි දනියි. රාග රහිත සිත රාග රහිත සිතැ යි දනියි. ද්වේෂ සහිත සිත ද්වේෂ සහිත සිතැයි දනී. ද්වේෂ රහිත සිත ද්වේෂ රහිත සිතැ යි දනී. මෝහ සහිත සිත මෝහ සහිත සිතැ යි දනී. මෝහ රහිත සිත මෝහ රහිත සිතැ යි දනී. සංක්‍ෂිප්ත (=හැකුළුණු) සිත හැකුළුණු සිතැ යි දනී. වික්‍ෂිප්ත (=විසුරුණු) සිත විසුරුණු සිතැ යි දනී. මහද්ගත සිත මහද්ගත සිතැ යි දනී. අමහද්ගත සිත අමහද්ගත සිතැ යි දනී. සොත්තර සිත සොත්තර සිතැ යි දනී. අනුත්තර සිත අනුත්තර සිතැ යි දනී. සමාහිත සිත සමාහිත සිතැ යි දනී. අසමාහිත සිත අසමාහිත සිතැ යි දනී. විමුක්ත (=මිදුණු) සිත විමුක්ත සිතැ යි දනී. අවිමුක්ත (=නොමිදුණු) සිත අවිමුක්ත සිතැ යි දනී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "60. කේවඩ්ඪය, යම්සේ සැරැසෙනසුලු ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ ළදරුවෙක් හෝ තරුණයෙක් හෝ පිරිසිදු දීප්තිමත් කැඩපතෙක හෝ පහන් දියබඳුනෙක හෝ සිය මුවසටහන පිරික්සා බලන්නේ තලකැලැල් ආදි දොස් ඇති තැන් සදොස් තැනැ යි දන්නේ ද, එ කී දොස් නැති තැත දොස් නැතැ යි දන්නේ ද, කේවඩ්ඪය, එ පරිද්දෙන් ම මහණ තෙමේ මෙසේ සමාහිත වූ සිත පිරිසිදු වූ කල්හි, දීප්ත වූ කල්හි, කෙලෙස් නැති කල්හි, උපක්ලේශ පහ වැ ගිය කල්හි, මෘදු වූ කල්හි, කර්‍මක්‍ෂම වූ කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පැමිණි කල්හි, පරසිත් දන්නා නුවණ පිණිස සිත යොමු කෙරෙයි, නැඹුරැ කෙරෙයි. හේ අන් සතුන්ගේ, අන් පුඟුලන්ගේ සිත සියසිතින් පිරිසිඳැ දනී. සරාග සිත සරාග සිතැ යි දනී. වීතරාග සිත වීතරාග සිතැ යි දනී. සද්වේෂ සිත සද්වේෂ සිතැ යි දනී. වීතද්වේෂ සිත වීතද්වේෂ සිතැ යි දනී. සමෝහ සිත සමෝහ සිතැ යි දනී, වීතමෝහ සිත වීතමෝහ සිතැ යි දනී. සංක්‍ෂිප්ත සිත සංක්‍ෂිප්ත සිතැ යි දනී. වික්ෂිප්ත සිත වික්‍ෂිප්ත සිතැ යි දනී. මහද්ගත සිත මහද්ගත සිතැ යි ... අමහද්ගත සිත අමහද්ගත සිතැ යි ... සොත්තර සිත සොත්තර සිතැ යි ... අනුත්තර සිත අනුත්තර සිතැ යි ... සමාහිත සිත සමාහිත සිතැ යි ... අසමාහිත සිත අසමාහිත සිතැ යි ... විමුක්ත සිත විමුක්ත සිතැ යි ... අවිමුක්ත සිත අවිමුක්ත සිතැ යි දනී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "61. කේවඩ්ඪය, මහණ තෙම මෙසේ සමාධිගත සිත පිරිසිදු වූ කල්හි ... අවිමුක්ත සිත අවිමුක්ත සිතැ යි දනී යන යමක් ඇද්ද, මේත් ඔහුගේ ප්‍රඥාවෙක් වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "523"
            },
            {
                "format": 13,
                "text": "62. හෙ තෙමේ මෙසේ සමාහිත සිත පිරිසිදු වූ කල්හි, දීප්ත වූ කල්හි, කෙලෙස් නැති වූ කල්හි, උපක්ලේශය පහ වැ ගිය කල්හි, මෘදු වූ කල්හි, කර්‍මක්‍ෂම වූ කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පත් කල්හි, පූර්‍වෙනිවාසානුස්මෘති ඥානය (=පෙර වුසූ කඳ පිළිවෙළ දක්නා නුවණ) ලබනු පිණිස සිත යොමු කෙරෙයි. හේ එක් ජාතියක් ද ජාති දෙකක් ද ජාති තුනක් ද ජාති සතරක් ද ජාති පසක් ද ජාති දසයක් ද ජාති විස්සක් ජාති තිසක් ද ජාති සතළිසක් ද ජාති පනසක් ද ජාති සියක් ද ජාති දහසක් ද ජාති සුවහසක් ද, බොහෝ සංවර්‍ත කල්ප ද, බොහෝ විවර්‍ත කල්ප ද, බොහෝ සංවර්‍ත විවර්‍තකල්ප ද, “අසෝ තන්හි මේ නම් ඇතියෙම් වීම්. මේ ගොත් ඇතියෙම් වීම්. මෙ බඳු පැහැ ඇතියෙම් වීමි. මෙ බඳු ආහාර ඇතියෙම් වීමි. මෙ බඳු සුව දුක් විඳින්නෙම් විම්. මෙ බඳු (මෙතෙක්) ආයු කෙළවර කොටැතියෙම් වීම්. ඒ මම් එයින් සැවැ අසෝ තැන උපනිමි. එහි ද මේ නම් ඇතියෙම් වීම්. මේ ගොත් ඇතියෙම් වීමි. මෙ බඳු පැහැ සටහන් ඇතියෙම් වීම්. මේ බඳු ආහාර ඇතියෙම් වීම්. මෙ බඳු සුවදුක් විඳින්නෙම් වීමි. මෙතෙක් ආයුසීමාවක් ඇතියෙම් වීම. ඒ මම් එයින් සැව මෙහි උපනිමි”යි, මෙසේ අනෙකවිධ වූ පෙරැ වුසූ කඳපිළිවෙළ සිහි කෙරෙයි. මෙසේ වර්‍ණාදි වශයෙන් ආකාර සහිත වූ නම්ගොත් විසින් උද්දේශ සහිත වූ බහුවිධ වූ පූර්‍වෙනිවාසය සිහි කෙරෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "63. කේවඩ්ඪය, යම්සේ පුරුෂයෙක් සිය ගමින් අන් ගමකට යන්නේ ද, ඒ ගමිනුත් අන් ගමකට යන්නේ ද, (නැවත) හේ එ ගමින් සිය ගමට ම වටාලා එන්නේ ද, එසේ වූ ඔහුට “මම් වූ කලි සිය ගමින් අසෝ ගමට ගියෙමි. එහි මෙසේ සිටියෙම්, මෙසේ උන්නෙමි, මෙසේ කීමි, මෙසේ නිහඬ වීමි. ඒ ගමිනුත් අසෝ ගමට ගියෙමි. එහි ද මෙසේ සිටියෙමි, මෙසේ උන්නෙමි, මෙසේ කීමි, මෙසේ නිහඬ වීමි. ඒ මම් ඒ ගමන් සිය ගමට ම පෙරළා ආයෙම් වෙමි”යි ඔහුට මෙ බඳු සිතෙක් වන්නේ ද, කේවඩ්ඪය, එ පරිද්දෙන් ම මහණ තෙමේ මෙසේ සමාහිත සිත පිරිසිදු වූ කල්හි, දීප්ත කල්හි, කෙලෙස් රහිත කල්හි, උපක්ලේශ පහ වැ ගිය කල්හි, මෘදු වු කල්හි, කර්‍මක්‍ෂය වූ කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පැමිණි කල්හි, පෙරැ වුසූ කඳ පිළිවෙළ සිහි කරන නුවණ පිණිස සිත මොනොවට යොමු කෙරෙයි, මොනොවට නැඹුරු කෙරෙයි. හේ ‘අසෝ තන්හි මේ නම් ඇතියෙම් වීමි, මේ බඳු ගොත් ඇතියෙම් වීමි, මේ බඳු පැහැ සටහන් ඇතියෙම් වීමි, මේ බඳු ආහාර ඇතියෙම් වීමි, මෙ බඳු සුවදුක් විඳුනෙම් වීමි, මේ බඳු ආයුසීමා ඇතියෙම් වීමි, ඒ මම එයින් සැව අසෝ තැන උපනිමි. එහි ද මේ නම් ඇතියෙම්, මේ ගොත් ඇතියෙම්, මෙ බඳු පැහැසටහන් ඇතියෙම්, මේ බඳු ආහාර ඇතියෙම්, මේ බඳු සුවදුක් විදින්නෙම් වීමි, මෙතෙක් ආයු සීමා ඇතියෙම් වීමි. ඒ මම එයින් සැවැ මෙහි උපනිමි’යි මෙසේ එක් ජාතියක් ද, ජාති දෙකක් ද, ජාති තුනක් ද, ජාති සතරක් ද, ජාති පසක් ද, ජාති දසයක් ද, ජාති විස්සක්ද, ජාති තිහක් ද, ජාති සතළිසක් ද, ජාති පනසක් ද, ජාති සියයක් ද, ජාති දහසක් ද, ජාති සුවහසක් ද, බොහෝ සංවර්‍ත කල්ප ද, බොහෝ විවර්‍ත කල්ප ද, බොහෝ සංවර්‍ත විවර්‍ත කල්ප දැ යි මෙසේ අනේකවිධ වූ පෙරැ වුසූ කඳ පිළිවෙළ සිහි කෙරෙයි. මේ පරිද්දෙන් ආකාර සහිත වූ උද්දේශ සහිත වූ පෙරැ වුසු නොයෙක් වැදෑරුම් කඳපිළිවෙළ සිහි කෙරෙයි. කේවඩ්ඪය, මහණ තෙම මෙසේ සමාහිත සිත පිරිසුදු වූ කල්හි ... අනේකවිධ වූ පෙරැ වුසූ කඳපිළිවෙළ සිහි කෙරෙයි යන යමෙක් ඇද්ද, මෙ ද ඔහුගේ ප්‍රඥාවෙක් වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "525"
            },
            {
                "format": 13,
                "text": "64. හේ මෙසේ සමාහිත වූ සිත පිරිසිදු කල්හි, දීප්ත කල්හි, කෙලෙස් නැති කල්හි, උපක්ලේශ පහ වූ කල්හි, මෘදු වූ කල්හි, කර්‍මක්‍ෂම වූ කල්හි, ස්ථිත කල්හි, නිශ්චල බවට පැමිණ කල්හි, සත්ත්‍වයන්ගේ ච්‍යුති උප්පත්ති දක්නා නුවණ පිණිස සිත යොමු කෙරෙයි, නැඹුරු කෙරෙයි. හේ පිරිසිදු වූ මිනිසුන්ගේ දර්‍ශනෝපචාරය ඉක්මැ දැක්කැ හැකි දිවැසින්, ‘අහෝ! මේ භවත් සත්ත්‍වයෝ කායදුශ්චරිතයෙන් සමන්විතයහ, වාග්දුශ්චරිතයෙත් සමන්විතයහ, මනෝදුශ්චරිතයෙන් සමන්විතයහ, ආර්‍යොපවාද කළහ, මිසදිටු වශයෙන් ගත් මිථ්‍යාව්‍රත ඇතියහ. ඒ මොහු කරජකය බිඳීමෙන් මරණින් මතු සැපයෙත් පහ වූ, දුෂ්ටකර්‍ම හේතුයෙන් හටගත් ගතිය වූ, (කර්‍මයට තමන් පරවශ බැවින්) තමනට අවශ වැ වැටෙන තැන වූ නිරයට වන්නාහ. මේ භවත් සත්ත්‍වයෝ වූ කලි කායසුචරිතයෙන් සමන්විතයහ, වාක්සුචරිතයෙන් සමන්විතයහ, මනඃසුචරිතයෙන් සමන්විතයහ, ආර්‍යයනට උපවාද නො කළහ, සම්දිටු ගත්තාහ, සම්දිටු වශයෙන් ගත් ශීලාදිය ඇත්තාහ. ඒ මොහු කාබුන් මරණින් මතු ශෝභන වූ ගති ඇති සඟලොවට වන්නාහ’ යි මරණාසන්න වූ ද, එකෙණෙහි පිළිසිඳ ගත්තා වූ ද, හීන වූ ද, උසස් වූ ද, මනා පැහැ සටහන් ඇති වූ ද, නොමනා පැහැ සටහන් ඇති වූ ද, සුගතියට පැමිණියා වූ ද, දුගතියට පැමිණයා වූ ද, කර්‍මය වූ පරිදි ඒ ඒ භවයට ගියා වූ ද සත්ත්‍වයන් දකී. මෙසේ හේ පිරිසිදු වූ, මානුෂක විෂය ඉක්මැ පැවැති දිවැසින් හීන ප්‍රණීත, සුවර්‍ණ දුවර්‍ණ, සුගත දුර්ගත සත්ත්‍වයන් දකී. කර්‍මය වූ පරිදි ඒ ඒ භවය කරා එළැඹ සිටී සත්ත්‍වයන් දකී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "65. කේවඩ්ඪය, යම්සේ සතර මං හන්දියෙක මහල් සහිත ගෙයෙක් වන්නේ ද, එහි උඩු මහලෙහි ඇස් ඇති පුරුෂයෙක් සිටියේ ගෙට පිවිසෙනවුනුත් ගෙන් නික්මෙනවුනුත් වීථියෙහි ඈත මෑත යන එනවුනුත් සිවුමංහන්දිය මැද හුන්නවුනුත් දක්නේ ද, ඒ දක්නා ඔහුට “මෙ මිනිස්සු ගෙට පිවිසෙත්, මේ මිනිස්සු ගෙන් නික්මෙති, මේ මිනිස්සු වීදියෙහි ඈත මෑත යෙත්, මොහු සිවුමංහන්දිය මැද උන්නෝ වෙත් යැ” යි මෙසේ සිතෙක් වන්නේ ද, කේවඩ්ඪය, එ පරිදි ම එ මහණ තෙමේ මෙසේ සමාහිත වූ සිත පිරිසිදු කල්හි දීප්තිමත් කල්හි කෙලෙස් නැති කල්හි උපක්ලේශ පහ වූ කල්හි මෘදු කල්හි කර්‍මක්‍ෂම කල්හි ස්ථිත කල්හි නිශ්වල බවට පැමිණි කල්හි, සත්ත්‍වයන්ගේ ච්‍යුති උප්පත්ති දක්නා නුවණ ලබනු පිණිස සිත යොමු කෙරෙයි, නැඹුරු කෙරෙයි. හේ මානුෂක විෂයය ඉක්ම පිරිසිදු වූ දිවැසින් ‘අහෝ! මේ භවත් සත්හු කායදුශ්චරිතයෙන් සමන්විතයහ, වාග්දුශ්චරිතයෙන් සමන්විතයහ, මනෝදුශ්චරිතයෙන් සමන්විතයහ, ආර්‍යයනට උපවාද කළහ, මිසදිටුවහ, මිසදිටු වශයෙන් ගත් ව්‍රත ඇතියහ. ඒ මොහු කා බුන් මරණින් මතු, සැපයෙන් පහ වූ, දුෂ්ට කර්‍මයෙන් උපන් ගතිය වූ, තමනට තමත් අවශග වැ වැටෙන තැන වූ නිරයට වන්හ. එහෙත් මෙ භවත් සත්ත්‍වයෝ වූ කලි කායසුවරිතයෙන් සමන්විතයහ, වාක්සුවරිතයෙත් සමන්විතයහ, මනඃසුචරිතයෙන් සමන්විතයහ, ආර්‍යයනට උපවාද නො කළහ, සම්දිටු ගත්හ, සම්දිටු විසින් ගත් ශීලාදිය ඇත්තාහ. මොහු කා බුන් මරණින් මතු ශෝභන ගති ඇති සගලොවට වන්නාහ”යි ‍මෙසේ මරණාසන්න වූ ද, එකෙණෙහි පිළිසඳ ගත්තාවූ ද, පහත් වූ ද, උසස් වූ ද, මනා පැහැ සටහත් ඇති වූ ද, නො මනා පැහැ සටහන් ඇති වූ ද, සුගතියට පැමිණියා වූ ද, දුගතියට පැමිණියා වූ ද කර්‍මය වූ පරිදි ඒ ඒ භවයට ගිය සත්ත්‍වයන් දකී. මෙසේ පිරිසිදු වූ, මානුෂක විෂයය ඉක්මැ පැවැති දිවැසින් හීන ප්‍රණීත සුවර්‍ණ දුවර්‍ණ සුගත දුර්‍ගත සත්ත්‍වයන් දකී. කම් වූ පරිදි ඒ ඒ භවය කරා එළැඹැ සිටි සත්ත්‍වයන් දකී.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "527"
            },
            {
                "format": 13,
                "text": "66 කේවඩ්ඪය, මහණ තෙම මෙසේ සමාහිත සිත පිරිසිදු කල්හි ... සුගත දුර්ගත වූ කම් වූ පරිදි ඒ ඒ භවය කරා එළැඹැ සිටි සතුන් දකී යන යමෙක් ඇද්ද, මෙ ද ඔහුගේ ප්‍රඥාවෙක් වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "67. හේ මෙසේ සමාහිත සිත පිරිසිදු වැ දීප්ත වැ නිකෙලෙස් වැ උපක්ලේශ පහ වැ මෘදු වැ කර්‍මක්‍ෂම වැ ස්ථිත වැ නිශ්චල බවට පැමිණැ සිටි කල්හි, ආස්‍රවයන්ගේ ක්‍ෂයය (විනාශය) පිණිස සිත මොනොවට යොමු කෙරෙයි, මොනොවට නැඹුරැ කෙරෙයි. හෙ තෙමේ ‘මේ දුකැ’ යි ඇති සැටියෙන් දනී. ‘මේ දුක් ඉපැද්මට කාරණය’ යි ඇති සැටියෙන් දනී. ‘මේ දුක් වැනැස්මැ’ යි (නිවනැ’ යි) ඇති සැටියෙත් දනී. ‘මේ දුක් වැනැස්මට යන පිළිවෙතැ’යි ඇති සැටියෙන් දනී. ‘මොහු ආස්‍රවයෝ යැ’යි ඇති සැටියෙන් දනී. ‘මේ ආස්‍රවයන් ඉපැද්මට කරුණැ’යි ඇති සැටියෙත් දනී. ‘මේ ආස්‍රවනිරෝධයැ’ යි ඇති සැටියෙන් දනී. ‘මේ ආස්‍රවනිරෝධගාමිනී ප්‍රතිපත්ති යැ’යි ඇති සැටියෙන් දනී. මෙසේ දන්නා මෙසේ දක්නා ඔහුගේ සිත කාමාස්‍රවය කෙරෙන් ද මිදේ. ඔහු සිත භවාස්‍රවය කෙරෙන් ද මිදේ, ඔහු සිත අවිද්‍යාස්‍රවය කෙරෙන් ද මිදේ. (එසේ සිත) මිදුණු කල්හි ‘මා සිත ආස්‍රව කෙරෙන් මිදුණේ යැ’ යි (ප්‍රත්‍යවෙක්‍ෂණ) ඥානය වේ. ‘භවොත්පත්තිය ක්‍ෂීණ විය (හෙවත් නැවැත භවයෙහි නොඋපදනා ස්වභාවයට පැමිණියෙමි). ‘මඟබඹසර වැස නිමැවිණි. (සිවු සස්හි සතර මඟින් කළ යුතු සොළොස් වැදෑරුම්) කිස කොටැ නිමැවිණි. මේ බව පිණිස (= මේ ක්ලේශක්‍ෂයය පිණිස) යලි දු කටයුතු දැයක් නැතැ’යි හේ දනී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "68. කේවඩ්ඪය, මෙය අනුශාසනීප්‍රාතිහාර්‍ය්‍යයැ යි කියනු ලැබේ. කේවඩ්ඪය, මොහු මා විසින් ම වෙසෙසින් දැන පසක් කොට පවසන ලද තුන් පෙළහරහු ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "69. පෙරැ වූවක් කියමි. කේවඩ්ඪය, මේ බික්සඟන අතුරෙහි ම වූ මහණක්හට “පඨවිධාතු ආපෝධාතු තේජොධාතු වායොධාතු යන මේ සතර මහාභූතයෝ කොතන්හි දී නිරුද්ධ වෙත් දැ” යි මෙසේ සිතැ විතර්‍කයෙක් උපන. කේවඩ්ඪය, ඉක්බිති ඒ මහණ යම්සේ සිත සමාධිගත කල්හි දේවයානික මාර්‍ගය (දෙව්බඹලෝ යත හැකි සෘද්ධිවිධඥානය) පහළ වී ද එසේ වූ සමාධියකට සමවන. කේවඩ්ඪය, ඉක්බිති ඒ මහණ සිවු මහරජයේ දෙවියන් කරා එළැඹියේ ය. එළැඹ ‘ඇවැත්නි, පඨවිධාතු ආපෝධාතු තෙජොධාතු වායෝධාතු යන මේ සතර මහාභූතයෝ කොතන්හි නො ඉතිරි වැ නිරුද්ධ වෙත් දැ?”යි සිවුමහරජයේ දෙවියන් විචාළේ ය. කේවඩ්ඪය, ඔහු මෙසේ විචාළ කල්හි සිවුමහරජයේ දෙවියෝ “මහණ, අපි දු පඨවිධාතු ආපෝධාතු තෙජොධාතු වායෝධාතු යන මේ සතර මහාභූතයන් නො ඉතිරි ව නිරුද්ධ වන තැන නො දනුම්හ. මහණ, අපට වඩා පැහැසපුව ඇති, යස ඉසුරු ආදියෙන් අපට වඩා උසස් වූ සිවු වරම රජුහු නම් කෙනෙක් ඇත. පඨවිධාතු ආදි සතර මහාභූතයන් නො ඉතිරි වැ නිරුද්ධ වන තැන ඔහු දන්නාහ යි සිතමු’ යි ඔහු ඒ මහණහට කීහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "529"
            },
            {
                "format": 13,
                "text": "70. කේවඩ්ඪය, ඉක්බිති ඒ මහණ සිවුවරම් රජුන් කරා එළැඹියේ ය. එළැඹ “ඇවැත්නි, පඨවි අපෝ තෙජෝ වායෝ යන මේ සතර මහාභූතයෝ කොතන්හි දී නො ඉතිරි ව නිරුද්ධ වෙත් දැ?” යි විචාළේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "71. කේවඩ්ඪය, ඔහු මෙසේ විචාළ කල්හි සිවුවරම් රජදරුවෝ ඒ මහණහු බණවා, “මහණ, පඨවි ආපෝ තෙජො වායෝ යන මේ සතර මහාභූතයා කොතන්හි දී නො ඉතිරි ව නිරුද්ධ වෙද්දැ’යි මේ කාරණය අපි දු නො දනුම්හ. මහණ, අපට වඩා පැහැසපුව ඇති, අපට වඩා උසස් වූ තෙතිස් නම් දෙවි කෙනෙක් ඇත. ‘පඨවි ආදි මේ සතර මහභූතයෝ කොහි නිරුද්ධ වෙත් ද යන මෙය ඔහු නම් දන්නාහ යි සිතමු’ යි කීහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "72. කේවඩ්ඪය, ඉක්බිති ඒ මහණ තෙතිස් දෙවියන් කරා ගියේ ය. ගොස් ‘ඇවැත්නි, පඨවී ආපෝ තෙජෝ වායෝ යන මේ මහාභූත සතර කොහි දි නොඉතිරි ව නිරුද්ධ වෙත් දැ?’ යි විචාළේ ය. කේවඩ්ඪය, ඔහු මෙසේ විචාළ කල්හි තෙතිස් දෙවියෝ එ මහණ බණවා, “මහණ, පඨවි ආපෝ තෙජෝ වායෝ යන සතර මහාභූතයෝ කොහි දී නො ඉතිරි වැ නිරුද්ධ වෙද්ද යන මෙය අපි දු නො දනුම්හ. මහණ, අපට වඩා පැහැසපුව ඇති, අපට වඩා උතුම් වූ සක්දෙවිඳු නම් කෙනෙක් ඇත. ඔහු පඨවී ආදි මේ සතර මහාභූතයත් නො ඉතිරි ව නිරුද්ධ වන තැන දනිති යි සිතම්හ’ යි කිවු ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "73. කේවඩ්ඪය, ඉක්බිති ඒ මහණ සක්දෙවිඳු කරා එළැඹියේ ය. එළැඹ ‘ඇවැත්නි, පඨවි ආපෝ තෙජෝ වායෝ යන මෙ සතර මහාභූතයෝ කොහි දී නො ඉතිරි වැ නිරුද්ධ වෙත් දැ?”යි විචාළේ ය. කේවඩ්ඪය, ඔහු මෙසේ විචාළ කල්හි සක්දෙවිඳු ඒ මහණ බණවා, ‘මහණ, පඨවි ආපෝ තෙජෝ වායෝ යන සතර මහාභූතයෝ නො ඉතිරි වැ කොහි නිරුද්ධ වෙද්දැ’ යි මම් ද නො දනිමි. මහණ, අපට වඩා පැහැසපුව ද ඇති, අපට වඩා උතුම් ද වූ යාම නම් දෙව් කෙනෙක් ඇත. පඨවි ආපෝ තෙජෝ වායෝ යන මෙ සතර මහා භූතයන් නො ඉතිරි ව නිරුද්ධ වන තැන ඔවුන් දනිතැ යි සිතමි” යි කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "74. කේවඩ්ඪය, ඉක්බිති ඒ මහණ යාම දෙවියන් වෙත ගියේ ය. ගොස් ‘ඇවැත්නි, පඨවි ආපෝ තෙජෝ වායෝ යන මේ සතර මහාභූතයෝ නො ඉතිරි වැ කොහි නිරුද්ධ වෙත් දැ?”යි මෙය විචාළේ ය. කේවඩ්ඪය, ඔහු මෙසේ විවාළ කල්හි යාම දෙවියෝ එ මහණ බණවා, “මහණ, පඨවි ආපෝ තෙජෝ වායෝ යන මේ සතර මහාභූතයෝ නොඉතිරි ව කොහි නිරුද්ධ වෙත් දැ”යි මෙය අපි ද නො දනුම්හ. මහණ, අපට වඩා පැහැසපුව ඇති, අපට වඩා උතුම වූ සුයාම නම් දෙව්පුතෙක් ඇත. ඔහු පඨවි ආදි මේ සතර මහභූතයන් නො ඉතිරි වැ නිරුද්ධ වන තැන දනිතැ’යි අපි සිතම්හ’යි කිවු ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "531"
            },
            {
                "format": 13,
                "text": "75. කේවඩ්ඪය, ඉක්බිති ඒ මහණ සුයාම දෙව්පුත් කරා ගියේ ය. ගොස් “ඇවැත්නි, පෘථිවි අප් තෙජස් වායු යන මේ සතර මහාභුතයෝ කොතන්හි නම් නො ඉතිරි වැ නිරුද්ධ වෙත් දැ?” යි මෙය විචාළේ ය. මෙසේ විචාළ කල්හි සුයාම දෙව්පුත් තෙම ‘මහණ, පෘථිවි අප් තෙජස් වායු යන සතර මහාභූතයෝ කොහි නිරුද්ධ වෙද්දැ යි මම ද නොදනිමි. මහණ, අපට වඩා පැහැසපුව ඇති, අපට වඩා උතුම් වූ තුෂිත නම් දෙව් කෙනෙක් ඇත. ඔවුන් පෘථිවි අප් තේජස් වායු යන මේ සතර මහාභූතයන් නො ඉතිරි වැ නිරුද්ධ වත තැන දනිති යි සිතම්හ” යි කිවු ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "76. කේවඩ්ඪය, ඉක්බිති ඒ මහණ තුෂිත දෙවියන් වෙත එළැඹියේ ය. එළැඹ “ඇවැත්නි, පෘථිවි අප් තෙජස් වායු යන සතර මහාභූතයෝ නො ඉතිරි වැ කොහි නිරුද්ධ වෙද් දැ?”යි විචාළේ ය. මෙසේ කී කල්හි තුෂිත දෙවියෝ ඒ මහණ බණවා, “මහණ, පෘථිවි අප් තේජස් වායු යන සතර මහාභූතයත් නො ඉතිරි වැ නිරුද්ධ වන තැන අපි දු නො ද නුම්හ. මහණ, අපට වැඩි තරම් පැහැසපුව ඇති, අපට වඩා උතුම් වූ සන්තුෂිත නම් දෙව්පුතෙක් ඇත. ඔහු පෘථිවි ආදී මේ සතර මහාභූතයන් නො ඉතිරි වැ නිරුද්ධ වන තැන දනිති’යි සිතම්හ” යි කිවු ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "77. කේවඩ්ඪය, එ කල්හි ඒ මහණ සන්තුෂිත දෙව්පුතු කරා එළැඹියේ ය. එළැඹ, ‘ඇවැත්නි, පෘථිවි අප් තේජස් වායු යන මේ සතර මහාභූතයෝ කොහි දී නො ඉතිරි වැ නිරුද්ධ වෙත් දැ?”යි විචාලේ ය. කේවඩ්ඪය, ඔහු මෙසේ විචාළ කල්හි සන්තුෂිත දෙව්පුත් “මහණ, පෘථිවි අප් තේජස් වායු යන සතර මහාභූතයෝ නො ඉතිරි වැ කොහි දී නිරුද්ධ වෙද්දැ”යි මම් නො දනිමි. මහණ, මව වඩා පැහැසපුව ඇති, මව වඩා උතුම වූ නිර්‍මාණරති නම් දෙව් කෙනෙක් ඇත. ඔවුන් මේ පෘථිවි ආදි සතර මහා භූතයන් නො ඉතිරි ව නිරුද්ධ වන තැන දනිති’යි සිතමි”යි කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "78. කේවඩ්ඪය, එ කල්හි ඒ මහණ නිර්‍මාණරති දෙවියන් කරා එළඹියේ ය. එළැඹ, ‘ඇවැත්නි, පෘථිවි අප් තේජස් වායු යන මේ සතර මහා භූතයෝ නො ඉතිරි වැ කොහි දී නිරුද්ධ වෙත් දැ?”යි විචාළේ ය කේවඩ්ඪය, ඔහු මෙසේ විචාළ කල්හි නිර්‍මාණරති දෙවියෝ ඒ මහණ බණවා, ‘මහණ, පෘථිවි අප් තේජස් වායු යන මේ සතර මහා භූතයන් නො ඉතිරි ව නිරුද්ධ වන තැත අපි දු නො දනුම්හ. අපට වඩා පැහැසපුව ඇති, අපට වඩා උතුම් වූ සුනිර්මිත නම් දෙව්පුතෙක් ඇත. ඔහු පඨවි ආදි මේ සතර මහාභූතයන් නො ඉතිරි ව නිරුද්ධ වන තැන දනිති’යි සිතම්හ”යි කිවු ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "533"
            },
            {
                "format": 13,
                "text": "79. කේවඩ්ඪය, එ කල්හි එ මහණ සුනිර්මිත දෙව්පුත් කරා එළැඹියේ ය. එළැඹ, සුනිර්මිත දෙව්පුතුට ‘ඇවැත්නි, පෘථිවි අප් තේජස් වායු යන මේ සතර මහාභූතයෝ කොහි දී නොඉතිරි වැ නිරුද්ධ වෙද්දැ?’ යි විචාළේ ය. කේවඩ්ඪය, මෙසේ විචාළ කල්හි සුනිර්මිත දෙව්පුත් තෙම ඒ මහණහට ‘මහණ, පෘථිවි අප් තේජස් වායු යන මේ සතර මහා භූතයත් නො ඉතිරි වැ නිරුද්ධ වන තැන මමත් නො දනිමි. මහණ, අපට වඩා පැහැසපුව ඇති, අපට වඩා උතුම් වූ පරනිර්මිතවශවර්තී නම් දෙව් කෙනෙක් ඇත. ඔවුන් මේ පෘථිවි ආදි සතර මහාභූතයන් නො ඉතිරි වැ නිරුද්ධ වන තැන දනිති’ යි සිතමි”යි කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "80. කේවඩ්ඪය, එ කල්හි ඒ මහණ පරනිර්මිතමශවර්ති දෙවියන් කරා එළැඹියේ ය. එළැඹ, ඇවැත්නි, පෘථිවි අප් තේජස් වායු යන සතර මහාභූතයෝ කොතන්හි නො ඉතිරි වැ නිරුද්ධ වෙත් දැ?” යි විචාළේ ය. එසේ විචාළ කල්හි පරනිර්මිතවශවර්ති දෙවියෝ ඒ මහණහු බණවා, ‘මහණ, අපි දු පෘථිවි ආදි මේ සතර මහාභූතයන් නො ඉතිරි වැ නිරුද්ධ වන තැත නො දනිමු. මහණ, අපට වඩා පැහැසපුව ඇති, අපට වඩා උතුම් වූ වශවර්තී නම් දෙව්පුතෙක් ඇත. පෘථිවිආදි සතර මහාභූතයෝ නො ඉතිරි ව, කොහි නිරුද්ධ වෙත් දැයි ඔහු දනිති’ යි සිතමි”යි ඔහු කිවු ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "81. කේවඩ්ඪය, එ කල්හි ඒ මහණ වසවත් දෙව්පුතු කරා එළැඹියේ ය. එළැඹ, ‘ඇවැත්නි, පෘථිවි අප් තේජස් වායු යන සතර මහාභූතයෝ නො ඉතිරි වැ කොතන්හි නිරුද්ධ වෙත් දැ?’යි ඔහු විචාළේ ය. කේවඩ්ඪය, මෙසේ විචාළ කල්හි, වසවත් දෙව්පුත් ඒ මහණහට ‘මහණ, පෘථිවි අප් තේජස් වායු යන මේ සතර මහාභූතයෝ නො ඉතිරි වැ කොතන්හි නිරුද්ධ වෙත් දැ’යි මම ද නොදනිමි. මහණ, අපට වඩා පැහැසපුව ඇති, අපට වඩා උතුම් බ්‍රහ්මකායික නම් දෙව් කෙනෙක් ඇත. ඔවුන් මේ පෘථිවි ආදි සතර මහාභූතයන් නො ඉතිරි ව නිරුද්ධ වන තැන දනිති’ යි සිතමි”යි කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "82. කේවඩ්ඪය, එ කල්හි එ මහණ යම්සේ සිත සමාහිත කල්හි බ්‍රහ්මයානික මාර්‍ගය (බඹලොව යන මග) පහළ වී ද, එසේ වූ සමාධියකට සමවැදිණ. කේවඩ්ඪය, ඉක්බිති ඒ මහණ බ්‍රහ්මකායික දෙවියන් කරා එළැඹියේ ය. එළැඹ බ්‍රහ්මකායික දෙවියන් බණවා, ‘ඇවැත්නි, යම් තැනෙක දී පෘථිවිධාතු අප්ධාතු තේජස්ධාතු වායුධාතු යන සතර මහාභූතයෝ නො ඉතිරි වැ නිරැද්ධ වෙත් නම්, ඒ කොහි දැ? යි විචාළේ ය. කේවඩ්ඪය, එකල්හි බ්‍රහ්මකායික දෙවියෝ එ මහණහට, ‘මහණ, පෘථිවි අප් තේජස් වායු යන සතර මහාභූතයෝ නො ඉතිරි වැ කොහි නිරුද්ධ වෙද්දැ’යි අපි දු නො දනුම්හ. මහණ, අපට වඩා පැහැසපුව ඇති, අපට වඩා උතුම් වූ, මහාබ්‍රහ්ම වූ, සියල්ල මැඩ පවත්නා, කිසිවකු විසින් නො මඩනා ලද, ඒකාන්තයෙන් සියල්ල දන්නා, සියල්ල තමා වශයෙහි පවත්වන, සියල්ලට ඊශ්වර වූ, සියල්ලෙහි කතෘ වූ, සියල්ලෙහි මැවුම්කරු වූ, සියල්ලනට ශ්‍රේෂ්ඨ වූ, සියල්ල සකස් කරන, පුරුදු කළ වශීතා ඇති, උපන් ද උපදනා ද සත්නට පිය වූ, බ්‍රහ්මයෙක් ඇත. ‘මේ පෘථිවි අප් තෙජස් වායු යන සතර මහා භූතයත් ඉතිරි නොවැ වැ නිරුද්ධ වන තැන ඔහු දනිති යි සිතම්හ’ යි කී ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "535"
            },
            {
                "format": 13,
                "text": "83. “ඇවැත්නි, ඒ මහාබ්‍රහ්මයා දැන් කොහි වෙසේ දැ?”යි. “මහණ, බ්‍රහ්මයා යම් පෙදෙසෙක හෝ යම් දෙසෙක හෝ යම් තැනෙක හෝ ඇතැ යි අපිදු නො දනුම්හ. මහණ, එහෙත් යම් හෙයෙකින් පෙරනිමිති දක්නා ලැබේ ද: (ලොවැ) එළියෙක් හට ගනී ද, ආලෝකයෙක් පහළ වේ ද, එයින් බ්‍රහ්මයා පහළ වන්නේ ය. එළියෙක් හටගනී, අලෝකයෙක් පහළ වෙයි යන යමක් වේ නම්, මෙය බඹහුගේ පහළ වීමට පෙර නිමිත්ත යැ” යි බ්‍රහ්මකායික දෙවියෝ කිවු යැ. කේවඩ්ඪය, එ කල්හි නොබෝ වේලාවෙකින් ම ඒ මහාබ්‍රහ්ම තෙමේ පහළ විය. කේවඩ්ඪය, එ කල්හි ඒ මහණ මහබඹුහු කරන එළැඹියේ ය. එළැඹැ, “ඇවැත්නි, පඨවිධාතු ආපෝධාතු තෙජෝධාතු වායෝධාතු යන සතර මහාභූතයෝ නො ඉතිරි වැ කොහි දි නිරුද්ධ වෙත් දැ?”යි මේ කාරණය ඒ මහබඹුහු විචාළේ ය. කේවඩ්ඪය, මෙසේ විචාළ කල, ඒ මහබඹ තෙමේ, ‘මහණ, මම බඹා වෙමි. මහබඹා වෙමි. සියල්ල මැඩ පවත්වන්නෙම් වෙමි. කිසිවකු විසිනුදු නො මඩනා ලදුයෙම් වෙමි. ඒකාන්තයෙන් සියල්ල දක්නෙම් වෙමි. සියල්ල සිය වශයෙහි පවත්වන්නෙම් වෙමි. හැමට ඊශ්වර වෙමි. සියල්ලෙහි කතෘ වෙමි. සියල්ල මවන්නා වෙමි. හැමට ශ්‍රේෂ්ඨ වෙමි. ලොව සතුන් බෙදන්නා වෙමි. පුරුදු කළ වශීතා ඇතියෙම් වෙමි. උපන්නන්ගේ ද උපදින්නවුන්ගේ ද පියා වෙමි”යි ඒ මහණහට කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "84. කේවඩ්ඪය, දෙවෙනි වර ද ඒ මහණ ඒ මහබඹහට, “ඇවැත්නි, තෙපි බඹ වහු ද? මහබඹ වහු ද? ලොව මැඩැ පවත්වන්නෝ වහූ ද? කිසිවකු විසින් නො මැඩ ලන ලදුවෝ වහු ද? ඒකාන්තයෙන් සියල්ල දක්නෝ වහු ද? ලොව තමන් වශයෙහි පවත්වන්නෝ වහු ද? ඊශ්වර වහු ද? කතෘ වහු ද? නිර්‍මාතෘ වහු ද? ලොවට ශ්‍රේෂ්ඨ වහු ද? ලොව බෙදන්නෝ වහු ද? පුරුදු වශිතා ඇතියෝ වහු ද? උපන්නවුන්ගේත් උපදනාවුන්ගේත් පියා වහු දැ?’යි මෙසේ තොප නො විචාරමි. වැලි, ඇවැත්නි, පඨවිධාතු ආපෝධාතු තෙජෝධාතු වායෝධාතු යන සතර මහාභූතයෝ නො ඉතිරි වැ කොතන්හි නිරුද්ධ වෙද්ද? යි මෙ සෙයින් ම තොප විචාරමි”යි කී ය. කේවඩ්ඪය, දෙවෙනි වර ද ඒ මහබඹ තෙම එ මහණහට “මහණ, මම් බඹා වෙමි. මහබඹා වෙමි. ලොව මැඩැ පවත්වනුයෙම් වෙමි. කිසිවකු විසිනුත් නො මඩිනා ලදුයෙම වෙමි. ඒකාන්තයෙන් සියල්ල දක්නෙම් වෙමි. ලොව සිය වශයෙහි පවත්වනුයෙම් වෙමි. ඊශ්වර වෙමි. කතෘ වෙමි. නිර්‍මාතෘ වෙමි. ලොවට ශ්‍රේෂඨ වෙමි. ලොව බෙදන්නෙම් වෙමි. පුරුදු වශිතා ඇතියෙම් වෙමි. උපන් උපදනා හැම ගේ පියා වෙමි” යි මේ බස් කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "85. කේවඩ්ඪය, තෙවෙනි වර ද ඒ මහණ ඒ මහබඹහට “ඇවැත්නි, තෙපි බ්‍රහ්ම වනු ද? මහාබ්‍රහ්ම වහු ද? අභිභූ වහු ද ? අනභිභූත වහු ද? සර්‍වදර්‍ශ වහු ද? වශවර්ති වහුද? ඊශ්වර වහු ද? කර්‍තෘ වහු ද? ශ්‍රේෂ්ඨ වහු ද? ලොව බෙදන්නහු වහු ද? වශී වහු ද? භූතභව්‍යයන්ගේ පීතෘ වහු දැ’යි නො විචාරමි. වැලි, පෘථිවි අප් තේජස් වායු යන මේ සතර මහා භුතයන් නො ඉතිරි ව නිරුද්ධ වන තැන විචාරමි”යි කී ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "537"
            },
            {
                "format": 13,
                "text": "86. කේවඩ්ඪය, එ කලැ ඒ මහබඹා ඒ මහණහු අතින් ගෙන එක් පසකට ඉවත් කොට, ‘මහණ, බඹහු නොදත් කිසිත් නැතැ යි, බඹහු නොදුටු කිසිත් නැතැ යි, බඹහු පසක් නොකළ කිසිත් නැතැ’ යි මෙ බ්‍රහ්මකායික දෙවියෝ මෙසේ මා දනිත්. මහණ, එභෙයින් ඔවුන් හමුයෙහි මම් හෙළි නො කෙළෙමි. මහණ, ‘පඨවිධාතු ආපෝධාතු තේජෝධාතු වායෝධාතු යන මේ සතර මහාභූතයෝ නොඉතිරි වැ කොහි දී නිරුද්ධ වෙත් දැ’යි මෙය මමත් නො දනිමි. එහෙයින් මහණ, යම්බඳු යුෂ්මත් ඒ භාග්‍යවතුන් වහන්සේ ම ඉක්මැ ගොස් මේ පැණය විසඳා ගැන්ම පිණිස පිටත්හි සෙවීමට පැමිණෙහි ද, ඒ යුෂ්මත්හු විසින් ම කළ නොමනා දැයෙකි. යුෂ්මත්හු විසින් ම කළ වරදෙකි. මහණ, යුෂ්මත් යන්නැ. ඒ භාග්‍යචතුන් වහන්සේ ම වෙත එළැඹ මේ පෑණය විවාරන්නැ. යම්සේ භාග්‍යවතුන් වහන්සේ යුෂ්මත්හට එය විසඳන සේක් ද, එසේ ම එය පිළිගන්නැ”යි කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "87. කේවඩ්ඪය, එ කල්හි එ මහණ යම්සේ ශක්තිමත් මිනිසෙක් වක් කළ අත හෝ දික් කරන්නේ ද, දික් කළ අත හෝ වක් කරන්නේ ද, එසේ ම යුහු ව බඹලොවැ අතුරුදහන් වූයේ මා ඉදිරියේ පෙනී සිටියේ ය. කේවඩ්ඪය, ඉක්බිති ඒ මහණ මා වැඳ පසෙක හිඳ ගත්තේ ය. කේවඩ්ඪය, එ මහණ පසෙක හුන්නේ ම “වහන්ස, පඨවිධාතු ආපෝධාතු තෝජෝධාතු වායොධාතු යන මේ සතර මහාභූතයෝ කොතැන්හි නොඉතිරි වැ නිරුද්ධ වෙත් දැ?”යි මෙය විචාළේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "88. කේවඩ්ඪය, එ මහණ මෙසේ විචාළ කලැ මැ මම් එ මහණහට මෙය කීමි: “මහණ, පෙර වූවක් කියමි. මුහුදුවෙළෙන්දෝ තෙර දක්නා ලිහිණියකු ගෙන නැවෙකින් මුහුදු වදිත්. නැව තෙරක් නො දක්නා කලැ තෙර දක්නා ලිහිණියා මුදත්. හේ ද පෙර දිගට යේ ම ය. දකුණු දිගට ද යේ ම ය. පැළදිගට ද යේ ම ය. උතුරු දිගට ද යේ ම ය. උඩට ද යේ ම ය. අනුදිගට ද යේ ම ය. ඉදින් හේ හාත්පසැ තෙරක් දක්නේ නම්, එසේ ගියේ ම වෙයි (යලි නො ම එයි). ඉදින් හේ හාත්පස තෙරක් නො දක්නේ ද, ඒ නැවට ම පෙරළා එයි. මහණ, එ පරිද්දෙන් ම තෝ බඹලොව දක්වාත් සොයනුයෙහි මේ පැණයේ විසැඳීමක් නො ලදුයෙහි ද, එහෙයින් යලි මා වෙත ම පෙරළා ආයෙහි. මහණ, පඨවිධාතු ආපෝධාතු තොජෝධාතු වායෝධාතු යන මේ සතර මහාභූතයෝ කොතන්හි නො ඉතිරි වැ නිරුද්ධ වෙත් දැ?’යි මෙසේ මේ පැණය නො විචාළ යුතු. මහණ, මේ පැණය මෙසේ (මේ මතු දැක්වෙන පරිදි) ම විචාළ යුතු:",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "539"
            },
            {
                "format": 13,
                "text": "පඨවි ධාතු, ආපෝධාතු, තෙජෝධාතු, වායෝධාතු සඞ්ඛ්‍යාත උපාදින්න වූ හෙවත් කර්‍මාදීන් හටගත් මෙ ධර්‍ම සමූහය කොතන්හි නො පිහිටා ද? දික් ලුහුඬු කුදුමහත් ඉටුඅනිටු (උපාදින්න) රූප කොතන්හි (කුමකට පැමිණ) නො පිහිටා ද? නම්රූ දෙක කොතන්හි නො ඉතිරි ව නිරුද්ධ වේ ද?” (මහණ, මෙසේ මෙ පැණය විචාළ යුතු.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එහි විසැඳීම මෙසේ වෙයි:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "දතයුතු බැවිත් විඤ්ඤාණ නම් වූ නිවන අනිදර්‍ශන ය. (ඇසින් නො දැක්ක හැකි බැවින් නිදර්‍ශන රහිත ය). උප්පාදවය යන අන්ත නැති බැවින් අන්ත රහිත ය. හැම අතින් (බැස්ස හැකි කමටහන්) තොට ඇත්තේ ය. මෙහි (මේ නිවනට පැමිණ) පෘථිවිධාතුව ද ආපෝධාතුව ද තෙජෝධාතුව ද වායුධාතුව ද නො පිහිටයි. මෙහි දික්ලුහුඬු කුදුමහත් ඉටුඅනිටු නාම රූප නො ඉතිරි වැ නිරුද්ධ වෙයි. චරිම (අන්තිම) විඥානයේ නිරෝධයෙන් මේ නිවනෙහි (මෙ නිවනට පැමිණ) මේ ධර්‍ම සමුහය නිරුද්ධ වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. කේවඩ්ඪ ගැහැවිපුත් තෙම සතුටු සිතැතියේ භාග්‍යවතුන් වහන්සේගේ වචනය පිළිගත්තේ ය.",
                "type": "paragraph"
            },
            {
                "format": 16,
                "text": "එකොළොස් වන කේවඩ්ඪ සූත්‍රය නිමියේ ය.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ]
    }
]