[
    {
        "filename": "sn-sgv-3",
        "bookId": 16,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "130"
            },
            {
                "type": "heading",
                "text": "3. කොසලසංයුත්තං",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. බන්ධනවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "3. 1. 1.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "දහරසුත්තං.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "112. එවං මෙ සුතං එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. අථ ඛො රාජා පසෙනදි කොසලො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං{1 සාරණීයං - මඡසං.} වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො රාජා පසෙනදි කොසලො භගවන්තං එතදවොච: භවම්පි නො ගොතමො අනුත්තරං සම්මාසම්බොධිං අභිසම්බුද්ධොති පටිජානාතී?ති."
            },
            {
                "type": "paragraph",
                "text": "යං හි තං මහාරාජ සම්මා වදමානො වදෙය්ය, අනුත්තරං සම්මාසම්බොධිං අභිසම්බුද්ධොති, මමං{2 මමෙව - මඡසං.} තං සම්මා වදමානො වදෙය්ය. අහං හි මහාරාජ අනුත්තරං සම්මාසම්බොධිං අභිසම්බුද්ධොති."
            },
            {
                "type": "paragraph",
                "text": "යෙ’පි තෙ භො ගොතම සමණබ්රාහ්මණා සඞ්ඝිනො ගණිනො ගණාචරියා ඤාතා යසස්සිනො තිත්ථකරා සාධුසම්මතා බහුජනස්ස. සෙය්යථීදං:{3 සෙය්යථිදං - මඡසං.} පූරණො කස්සපො, මක්ඛලි ගොසාලො, නිගණ්ඨො නාතපුත්තො, සඤ්චයො බෙලට්ඨපුත්තො,{4 බෙලට්ඨි පුත්තො - සීමු. 1.} පකුධො{5 කකුධො - PTS.} කච්චායනො, අජිතො කෙසකම්බලො. තෙ’පි “මයා අනුත්තරං සම්මාසම්බොධිං අභිසම්බුද්ධාති{6 අභිසම්බුද්ධොති - සබ්බත්ථ.} පටිජානාථා”ති පුට්ඨා සමානා අනුත්තරං සම්මාසම්බොධිං අභිසම්බුද්ධාති{7 අභිසම්බුද්ධොති - සබ්බත්ථ.} න පටිජානන්ති. කිං පන භවං ගොතමො දහරො චෙව ජාතියා නවො ච පබ්බජ්ජායාති."
            },
            {
                "type": "paragraph",
                "text": "චත්තාරො ඛො, මෙ මහාරාජ දහරාති න උඤ්ඤාතබ්බා, දහරාති න පරිභොතබ්බා. කතමෙ චත්තාරො? ඛත්තියො ඛො මහාරාජ දහරොති න උඤ්ඤාතබ්බො, දහරොති න පරිභොතබ්බො. උරගො ඛො මහාරාජ දහරොති න උඤ්ඤාතබ්බො, දහරොති න පරිභොතබ්බො. අග්ගි ඛො මහාරාජ දහරොති න උඤ්ඤාතබ්බො, දහරොති න පරිභොතබ්බො. භික්ඛු ඛො මහාරාජ දහරොති න උඤ්ඤාතබ්බො, දහරොති න පරිභොතබ්බො. ඉමෙ ඛො මහාරාජ චත්තාරො දහරාති න උඤ්ඤාතබ්බා, දහරාති න පරිභොතබ්බාති."
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච භගවා. ඉදං වත්වා{8 වත්වාන - මඡසං. PTS.} සුගතො අථාපරං එතදවොච සත්ථා:"
            },
            {
                "type": "gatha",
                "text": "ඛත්තියං ජාතිසම්පන්නං අභිජාතං යසස්සිනං,\nදහරොති නාවජානෙය්ය න නං පරිභවෙ නරො."
            },
            {
                "type": "page-break",
                "text": "132"
            },
            {
                "type": "gatha",
                "text": "ඨානං හි සො මනුස්සින්දො{1 මනුජින්දො - මඡසං.} රජ්ජං ලද්ධාන ඛත්තියො\nසො කුද්ධො රාජදණ්ඩෙන තස්මිං පක්කමතෙ භුසං,\nතස්මා තං පරිවජ්ජෙය්ය රක්ඛං ජීවිතමත්තනො."
            },
            {
                "type": "gatha",
                "text": "ගාමෙ වා යදි වා, රඤ්ඤෙ යත්ථ පස්සෙ භුජඞ්ගමං,\nදහරොති නාවජානෙය්ය න නං පරිභවෙ නරො."
            },
            {
                "type": "gatha",
                "text": "උච්චාවචෙහි වණ්ණෙහි උරගො චරති තෙජසී{2 තෙජසා - සීමු.},\nසො ආසජ්ජ ඩසෙ{3 ඩංසෙ - මඡසං.} බාලං නරං නාරිඤ්ච එකදා,\nතස්මා තං පරිවජ්ජෙය්ය රක්ඛං ජීවිතමත්තනො."
            },
            {
                "type": "gatha",
                "text": "පහූතභක්ඛං ජාලිනං{4 ජලිතං - සී. 1, 2.} පාවකං කණ්හවත්තනිං,\nදහරොති නාවමඤ්ඤෙය්ය න නං පරිභවෙ නරො."
            },
            {
                "type": "gatha",
                "text": "ලද්ධා හි සො උපාදානං මහා හුත්වාන පාවකො,\nසො ආසජ්ජ ඩසෙ බාලං නරං නාරිඤ්ච එකදා,\nතස්මා තං පරිවජ්ජෙය්ය රක්ඛං ජීවිතමත්තනො."
            },
            {
                "type": "gatha",
                "text": "වනං යදග්ගි ඩහති පාවකො කණ්හවත්තනී,\nජායන්ති තත්ථ පාරොහා අහොරත්තානමච්චයෙ.\n"
            },
            {
                "type": "gatha",
                "text": "යං ච ඛො සීලසම්පන්නො භික්ඛු ඩහති තෙජසා,\nන තස්ස පුත්තා පසවො දායාදා වින්දරෙ ධනං,\nඅනපච්චා අදායාදා තාලාවත්ථු{5 තාලවත්ථු - ස්යා. PTS.} භවන්ති තෙ.\n\nතස්මා හි පණ්ඩිතො පොසො සම්පස්සං අත්ථමත්තනො\nභුජඞ්ගමං පාවකඤ්ච ඛත්තියඤ්ච යසස්සිනං,\nභික්ඛුං ච සීලසම්පන්නං සම්මදෙව සමාචරෙති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ රාජා පසෙනදි කොසලො භගවන්තං එතදවොච: අභික්කන්තං භන්තෙ, අභික්කන්තං භන්තෙ, සෙය්යථාපි භන්තෙ නික්කුජ්ජිතං වා උක්කුජ්ජෙය්ය , පටිච්ඡන්නං වා විවරෙය්ය, මූළ්හස්ස වා මග්ගං ආචික්ඛෙය්ය, අන්ධකාරෙ වා තෙලපජ්ජොතං ධාරෙය්ය, චක්ඛුමන්තො රූපානි දක්ඛින්තීති.{6 දක්ඛන්තීති - මඡසං. ස්යා.} එවමෙවං{7 එවමෙව - ස්යා.} භගවතා අනෙකපරියායෙන ධම්මො පකාසිතො. එසාහං භන්තෙ භගවන්තං සරණං ගච්ඡාමි ධම්මඤ්ච භික්ඛුසඞ්ඝඤ්ච. උපාසකං මං භන්තෙ භගවා ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
            },
            {
                "type": "centered",
                "text": "3. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පුරිසසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "113. **සාවත්ථියං ---**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො රාජා පසෙනදි කොසලො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො රාජා පසෙනදි කොසලො භගවන්තං එතදවොච: කති නු ඛො භන්තෙ පුරිසස්ස ධම්මා අජ්ඣත්තං උප්පජ්ජමානා උප්පජ්ජන්ති අහිතාය දුක්ඛාය අඵාසුවිහාරායාති?"
            },
            {
                "type": "page-break",
                "text": "134"
            },
            {
                "type": "paragraph",
                "text": "තයො ඛො මහාරාජ පුරිසස්ස ධම්මා අජ්ඣත්තං උප්පජ්ජමානා උප්පජ්ජන්ති අහිතාය දුක්ඛාය අඵාසුවිහාරාය. කතමෙ තයො? ලොභො ඛො මහාරාජ පුරිසස්ස ධම්මො අජ්ඣත්තං උප්පජ්ජමානො උප්පජ්ජති අහිතාය දුක්ඛාය අඵාසුවිහාරාය. දොසො ඛො මහාරාජ පුරිසස්ස ධම්මො අජ්ඣත්තං උප්පජ්ජමානො උප්පජ්ජති අහිතාය දුක්ඛාය අඵාසුවිහාරාය. මොහො ඛො මහාරාජ පුරිසස්ස ධම්මො අජ්ඣත්තං උප්පජ්ජමානො උප්පජ්ජති අහිතාය දුක්ඛාය අඵාසුවිහාරාය. ඉමෙ ඛො මහාරාජ තයො පුරිසස්ස ධම්මා අජ්ඣත්තං උප්පජ්ජමානා උප්පජ්ජන්ති අහිතාය දුක්ඛාය අඵාසුවිහාරායාති."
            },
            {
                "type": "gatha",
                "text": "ලොභො දොසො ච මොහො ච පුරිසං පාපචෙතසං,\nහිංසන්ති අත්තසම්භූතා තචසාරංව සම්ඵල{1 සප්ඵලන්ති - ස්යා.}න්ති"
            },
            {
                "type": "centered",
                "text": "3. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "රාජසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "114.** සාවත්ථියං ---**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො රාජා පසෙනදි කොසලො භගවන්තං එතදවොච: අත්ථි නු ඛො භන්තෙ ජාතස්ස අඤ්ඤත්ර ජරාමරණා{2 ජරාමරණං - මඡසං.}ති?"
            },
            {
                "type": "paragraph",
                "text": "නත්ථි ඛො මහාරාජ ජාතස්ස අඤ්ඤත්ර ජරාමරණා. යෙපි තෙ මහාරාජ ඛත්තියමහාසාලා අඩ්ඪා{3 අද්ධා - මඡසං.} මහද්ධනා මහාභොගා පහූතජාතරූපරජතා පහූතවිත්තූපකරණා පහූතධනධඤ්ඤා. තෙසම්පි ජාතානං නත්ථි අඤ්ඤත්ර ජරාමරණා. යෙපි තෙ මහාරාජ බ්රාහ්මණමහාසාලා -පෙ-යෙපි තෙ මහාරාජ ගහපතිමහාසාලා අඩ්ඪා මහද්ධනා මහාභොගා පහූතජාතරූපරජතා පහූතවිත්තූපකරණා පහූතධනධඤ්ඤා. තෙසම්පි ජාතානං නත්ථි අඤ්ඤත්ර ජරාමරණා. යෙපි තෙ මහාරාජ භික්ඛූ අරහන්තො ඛීණාසවා වුසිතවන්තො කතකරණීයා ඔහිතභාරා අනුප්පත්තසදත්ථා පරික්ඛීණභවසඤ්ඤොජනා සම්මදඤ්ඤාවිමුත්තා. තෙසම්පායං කායො භෙදනධම්මො නික්ඛෙපනධම්මොති."
            },
            {
                "type": "gatha",
                "text": "ජීරන්ති වෙ රාජරථා සුචිත්තා අථො සරීරම්පි ජරං උපෙති,\nසතඤ්ච ධම්මො න ජරං උපෙති සන්තො හවෙ සබ්භි පවෙදයන්ති."
            },
            {
                "type": "centered",
                "text": "3. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පියසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "115. **සාවත්ථියං ---**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො රාජා පසෙනදි කොසලො භගවන්තං එතදවොච: ඉධ මය්හං භන්තෙ, රහොගතස්ස පටිසල්ලීනස්ස{4 පතිසල්ලීනස්ස - සීමු. 1.} එවං චෙතසො පරිවිතක්කො උදපාදි: කෙසං නු ඛො පියො අත්තා, කෙසං අප්පියො අත්තාති."
            },
            {
                "type": "page-break",
                "text": "136"
            },
            {
                "type": "paragraph",
                "text": "තස්ස මය්හං භන්තෙ, එතදහොසි: යෙ ච ඛො කෙචි කායෙන දුච්චරිතං චරන්ති, වාචාය දුච්චරිතං චරන්ති, මනසා දුච්චරිතං චරන්ති, තෙසං අප්පියො අත්තා, කිඤ්චාපි තෙ එවං වදෙය්යුං “පියො නො අත්තා”ති, අථ ඛො තෙසං අප්පියො අත්තා. තං කිස්ස හෙතු: යං හි අප්පියො අප්පියස්ස කරෙය්ය, තං තෙ අත්තනාව අත්තනො කරොන්ති. තස්මා තෙසං අප්පියො අත්තා."
            },
            {
                "type": "paragraph",
                "text": "යෙ ච ඛො කෙචි කායෙන සුචරිතං චරන්ති, වාචාය සුචරිතං චරන්ති, මනසා සුචරිතං චරන්ති, තෙසං පියො අත්තා, කිඤ්චාපි තෙ එවං වදෙය්යුං “අප්පියො නො අත්තාති” අථ ඛො තෙසං පියො අත්තා. තං කිස්ස හෙතු: යං හි පියො පියස්ස කරෙය්ය, තං තෙ අත්තනාව අත්තනො කරොන්ති. තස්මා තෙසං පියො අත්තා."
            },
            {
                "type": "paragraph",
                "text": "එවමෙතං මහාරාජ, එවමෙතං මහාරාජ, යෙ හි කෙචි මහාරාජ, කායෙන දුච්චරිතං චරන්ති, වාචාය දුච්චරිතං චරන්ති, මනසා දුච්චරිතං චරන්ති, තෙසං අප්පියො අත්තා. කිඤ්චාපි තෙ එවං වදෙය්යුං, “පියො නො අත්තා”ති. අථ ඛො තෙසං අප්පියො අත්තා. තං කිස්ස හෙතු: යං හි මහාරාජ, අප්පියො අප්පියස්ස කරෙය්ය, තං තෙ අත්තනාව අත්තනො කරොන්ති. තස්මා තෙසං අප්පියො අත්තා."
            },
            {
                "type": "paragraph",
                "text": "යෙ ච ඛො කෙචි මහාරාජ, කායෙන සුචරිතං චරන්ති, වාචාය සුචරිතං චරන්ති, මනසා සුචරිතං චරන්ති, තෙසං පියො අත්තා. කිඤ්චාපි තෙ එවං වදෙය්යුං “අප්පියො නො අත්තාති”, අථ ඛො තෙසං පියො අත්තා. තං කිස්ස හෙතු: යං හි මහාරාජ, පියො පියස්ස කරෙය්ය, තං තෙ අත්තනාව අත්තනො කරොන්ති. තස්මා තෙසං පියො අත්තාති."
            },
            {
                "type": "gatha",
                "text": "අත්තානං චෙ පියං ජඤ්ඤා න නං පාපෙන සංයුජෙ,\nන හි තං සුලභං හොති සුඛං දුක්කත{1 දුක්කට - මඡසං.}කාරිනා."
            },
            {
                "type": "gatha",
                "text": "අන්තකෙනාධිපන්නස්ස ජහතො මානුසං භවං,\nකිං හි තස්ස සකං හොති කිඤ්ච ආදාය ගච්ඡති,\nකිඤ්චස්ස අනුගං හොති ඡායාව අනපායිනී?{2 අනුපායිනී - ස්යා.}."
            },
            {
                "type": "gatha",
                "text": "උභො පුඤ්ඤඤ්ච පාපඤ්ච යං මච්චො කුරුතෙ ඉධ,\nතං හි තස්ස සකං හොති තඤ්ච{3 තංච - මඡසං.} ආදාය ගච්ඡති,\nතං චස්ස{4 වස්ස - මඡසං.} අනුගං හොති ඡායාව අනපායිනී.තස්මා කරෙය්ය කල්යාණං නිචයං සම්පරායිකං,\nපුඤ්ඤානි පරලොකස්මිං පතිට්ඨා හොන්ති පාණිනන්ති."
            },
            {
                "type": "centered",
                "text": "3. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අත්තරක්ඛිතසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "116. **සාවත්ථියං ---**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො රාජා පසෙනදි කොසලො භගවන්තං එතදවොච: “ඉධ මය්හං භන්තෙ, රහොගතස්ස පටිසල්ලීනස්ස එවං චෙතසො පරිවිතක්කො උදපාදි: “කෙසං නු ඛො රක්ඛිතො අත්තා, කෙසං අරක්ඛිතො අත්තා”ති."
            },
            {
                "type": "page-break",
                "text": "138"
            },
            {
                "type": "paragraph",
                "text": "තස්ස මය්හං භන්තෙ, එතදහොසි: යෙ ඛො{1 යෙච ඛො - ස්යා.} කෙචි කායෙන දුච්චරිතං චරන්ති, වාචාය දුච්චරිතං චරන්ති, මනසා දුච්චරිතං චරන්ති, තෙසං අරක්ඛිතො අත්තා. කිඤ්චාපි තෙ හත්ථිකායො වා රක්ඛෙය්ය, අස්සකායො වා රක්ඛෙය්ය, රථකායො වා රක්ඛෙය්ය, පත්තිකායො වා රක්ඛෙය්ය, අථ ඛො තෙසං අරක්ඛිතො අත්තා. තං කිස්ස හෙතු: බාහිරා හෙසා රක්ඛා, නෙසා රක්ඛා අජ්ඣත්තිකා. තස්මා තෙසං අරක්ඛිතො අත්තා. යෙ ච ඛො කෙචි කායෙන සුචරිතං චරන්ති, වාචාය සුචරිතං චරන්ති, මනසා සුචරිතං චරන්ති, තෙසං රක්ඛිතො අත්තා. කිඤ්චාපි තෙ නෙව හත්ථිකායො රක්ඛෙය්ය, න අස්සකායො රක්ඛෙය්ය, න රථකායො රක්ඛෙය්ය, න පත්තිකායො රක්ඛෙය්ය, අථ ඛො තෙසං රක්ඛිතො අත්තා. තං කිස්ස හෙතු: අජ්ඣත්තිකා හෙසා රක්ඛා, නෙසා රක්ඛා බාහිරා. තස්මා තෙසං රක්ඛිතො අත්තාති."
            },
            {
                "type": "paragraph",
                "text": "එවමෙතං මහාරාජ, එවමෙතං මහාරාජ, යෙ හි කෙචි මහාරාජ, කායෙන දුච්චරිතං චරන්ති -පෙ- තෙසං අරක්ඛිතො අත්තා. කිඤ්චාපි තෙ හත්ථිකායො වා රක්ඛෙය්ය, -පෙ- පත්තිකායො වා රක්ඛෙය්ය, අථ ඛො තෙසං අරක්ඛිතො අත්තා. තං කිස්ස හෙතු: බාහිරා හෙසා මහාරාජ රක්ඛා, නෙසා රක්ඛා අජ්ඣත්තිකා. තස්මා තෙසං අරක්ඛිතො අත්තා. යෙ ච ඛො කෙචි මහාරාජ, කායෙන සුචරිතං චරන්ති, -පෙ- මනසා සුචරිතං චරන්ති, තෙසං රක්ඛිතො අත්තා. කිඤ්චාපි තෙ නෙව හත්ථිකායො රක්ඛෙය්ය, -පෙ- න පත්තිකායො රක්ඛෙය්ය, අථ ඛො තෙසං රක්ඛිතො අත්තා. තං කිස්ස හෙතු: අජ්ඣත්තිකා හෙසා මහාරාජ, රක්ඛා, නෙසා රක්ඛා බාහිරා. තස්මා තෙසං රක්ඛිතො අත්තාති."
            },
            {
                "type": "gatha",
                "text": "කායෙන සංවරො සාධු සාධු වාචාය සංවරො,\nමනසා සංවරො සාධු සාධු සබ්බත්ථ සංවරො,\nසබ්බත්ථ සංවුතො ලජ්ජී රක්ඛිතොති පවුච්චතීති."
            },
            {
                "type": "centered",
                "text": "3. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අප්පකාසුත්තං.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "117. **සාවත්ථියං ---**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො රාජා පසෙනදි කොසලො භගවන්තං එතදවොච: ඉධ මය්හං භන්තෙ රහොගතස්ස පටිසල්ලීනස්ස එවං චෙතසො පරිවිතක්කො උදපාදි: “අප්පකා තෙ සත්තා ලොකස්මිං යෙ උළාරෙ උළාරෙ භොගෙ ලභිත්වා න චෙව මජ්ජන්ති, න ච පමජ්ජන්ති, න ච කාමෙසු ගෙධං ආපජ්ජන්ති, න ච සත්තෙසු විප්පටිපජ්ජන්ති. අථ ඛො එතෙව බහුතරා සත්තා ලොකස්මිං යෙ උළාරෙ උළාරෙ භොගෙ ලභිත්වා මජ්ජන්ති චෙව පමජ්ජන්ති ච, කාමෙසු ච ගෙධං ආපජ්ජන්ති, සත්තෙසු ච විප්පටිපජ්ජන්තී”ති."
            },
            {
                "type": "page-break",
                "text": "140"
            },
            {
                "type": "paragraph",
                "text": "එවමෙතං මහාරාජ, එවමෙතං මහාරාජ, අප්පකා තෙ මහාරාජ, සත්තා ලොකස්මිං යෙ උළාරෙ උළාරෙ භොගෙ ලභිත්වා න චෙව මජ්ජන්ති, න ච පමජ්ජන්ති, න ච කාමෙසු ගෙධං ආපජ්ජන්ති, න ච සත්තෙසු විප්පටිපජ්ජන්ති. අථ ඛො එතෙව බහුතරා සත්තා ලොකස්මිං යෙ උළාරෙ උළාරෙ භොගෙ ලභිත්වා මජ්ජන්ති චෙව පමජ්ජන්ති ච, කාමෙසු ච ගෙධං ආපජ්ජන්ති, සත්තෙසු ච විප්පටිපජ්ජන්තීති."
            },
            {
                "type": "gatha",
                "text": "සාරත්තා කාමභොගෙසු ගිද්ධා කාමෙසු මුච්ඡිතා,\nඅතිසාරං න බුජ්ඣන්ති මිගා කූටංව ඔඩ්ඩිතං,\nපච්ඡාසං කටුකං හොති විපාකො හිස්ස පාපකොති."
            },
            {
                "type": "centered",
                "text": "3. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අත්ථකරණසුත්තං.{1 අට්ටකරණ සුත්තං - මඡසං.}",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "**118. සාවත්ථියං ---**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො රාජා පසෙනදි කොසලො භගවන්තං එතදවොච: ඉධාහං භන්තෙ අත්ථකරණෙ නිසින්නො පස්සාමි ඛත්තියමහාසාලෙපි බ්රාහ්මණමහාසාලෙපි ගහපතිමහාසාලෙපි අඩ්ඪෙ මහද්ධනෙ මහාභොගෙ පහූතජාතරූපරජතෙ පහූතවිත්තූපකරණෙ පහූතධනධඤ්ඤෙ කාමහෙතු කාමනිදානං කාමාධිකරණං සම්පජානමුසා භාසන්තෙ. තස්ස මය්හං භන්තෙ එතදහොසි: අලන්දානි මෙ අත්ථකරණෙන, භද්රමුඛොදානි අත්ථකරණෙ න පඤ්ඤායිස්සතීති."
            },
            {
                "type": "paragraph",
                "text": "{2 ඉධ “එවමෙතං මහාරාජ, එවමෙතං මහාරාජ” ඉතිපාඨො මරම්මස්යාම පොත්ථකෙසු දිස්සතෙ.}යෙ පි තෙ මහාරාජ ඛත්තියමහාසාලා බ්රාහ්මණමහාසාලා ගහපති මහාසාලා අඩ්ඪා මහද්ධනා මහාභොගා පහූතජාතරූපරජතා පහූතවිත්තූපකරණා පහූතධනධඤ්ඤා කාමහෙතු කාමනිදානං කාමාධිකරණං සම්පජානමුසා භාසන්ති, තෙසං තං භවිස්සති දීඝරත්තං අහිතාය දුක්ඛායාති."
            },
            {
                "type": "gatha",
                "text": "සාරත්තා කාමභොගෙසු ගිද්ධා කාමෙසු මුච්ඡිතා,\nඅතිසාරං න බුජ්ඣන්ති මච්ඡා ඛිපං{3 ඛිප්පං - මඡසං. ස්යා. PTS. සී. 1, 2.}ව ඔඩ්ඩිතං,\nපච්ඡාසං කටුකං හොති විපාකො හිස්ස පාපකොති."
            },
            {
                "type": "centered",
                "text": "3. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මල්ලිකාසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "119. **සාවත්ථියං ---**"
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන රාජා පසෙනදි කොසලො මල්ලිකාය දෙවියා සද්ධිං උපරිපාසාදවරගතො හොති. අථ ඛො රාජා පසෙනදි කොසලො මල්ලිකං දෙවිං එතදවොච: අත්ථි නු ඛො තෙ මල්ලිකෙ කො චඤ්ඤො අත්තනා පියතරොති?"
            },
            {
                "type": "page-break",
                "text": "142"
            },
            {
                "type": "paragraph",
                "text": "නත්ථි ඛො මෙ මහාරාජ කො චඤ්ඤො අත්තනා පියතරො. තුය්හං පන මහාරාජ අත්ථඤ්ඤො කොචි අත්තනා පියතරොති? මය්හම්පි ඛො මල්ලිකෙ නත්ථඤ්ඤො කොචි අත්තනා පියතරොති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො රාජා පසෙනදි කොසලො පාසාදා ඔරොහිත්වා{1 ඔතරිත්වා - සීමු.} යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො රාජා පසෙනදි කොසලො භගවන්තං එතදවොච: ඉධාහං භන්තෙ මල්ලිකාය දෙවියා සද්ධිං උපරිපාසාදවරගතො මල්ලිකං දෙවිං එතදවොචං: “අත්ථි නු ඛො තෙ මල්ලිකෙ කො චඤ්ඤො අත්තනා පියතරො”ති. එවං වුත්තෙ භන්තෙ මල්ලිකාදෙවී මං එතදවොච: “නත්ථි ඛො මෙ මහාරාජ කො චඤ්ඤො අත්තනා පියතරො. තුය්හං පන මහාරාජ අත්ථඤ්ඤො කොචි අත්තනා පියතරො”ති. එවං වුත්තාහං භන්තෙ මල්ලිකං දෙවිං එතදවොචං. “මය්හම්පි ඛො මල්ලිකෙ නත්ථඤ්ඤො කොචි අත්තනා පියතරොති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා එතමත්ථං විදිත්වා තායං වෙලායං ඉමං ගාථං අභාසි:"
            },
            {
                "type": "gatha",
                "text": "සබ්බා දිසා අනුපරිගම්ම චෙතසා\nනෙවජ්ඣගා පියතරමත්තනා ක්වචි,\nඑවං පියො පුථු අත්තා පරෙසං\nතස්මා න හිංසෙ පරං අත්තකාමොති.{2 පරමත්තකාමො - මඡසං.}"
            },
            {
                "type": "centered",
                "text": "3. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "යඤ්ඤසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "120.** සාවත්ථියං ---**"
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන රඤ්ඤො පසෙනදිස්ස{3 පසෙනදි කොසලස්ස - සීමු. 2. ස්යා. PTS.} කොසලස්ස මහායඤ්ඤො පච්චුපට්ඨිතො හොති. පඤ්ච ච උසභසතානි පඤ්ච ච වච්ඡතරසතානි පඤ්ච ච වච්ඡතරීසතානි පඤ්ච ච අජසතානි පඤ්ච ච උරබ්භසතානි ථූණූපනීතානි හොන්ති යඤ්ඤත්ථාය. යෙ පිස්ස තෙ හොන්ති දාසාති වා පෙස්සාති වා කම්මකරාති වා තෙපි දණ්ඩතජ්ජිතා භයතජ්ජිතා අස්සුමුඛා රුදමානා පරිකම්මානි කරොන්ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො සම්බහුලා භික්ඛූ පුබ්බන්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය සාවත්ථිං පිණ්ඩාය පවිසිංසු.{4 පාවිසිංසු - PTS.} සාවත්ථියං පිණ්ඩාය චරිත්වා පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තා යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නො ඛො තෙ භික්ඛූ භගවන්තං එතදවොචුං: ඉධ භන්තෙ, රඤ්ඤො පසෙනදිස්ස කොසලස්ස මහායඤ්ඤො පච්චුපට්ඨිතො හොති, පඤ්ච ච උසභසතානි පඤ්ච ච වච්ඡතරසතානි පඤ්ච ච වච්ඡතරීසතානි{5 වච්ඡතරි - මඡසං. ස්යා.} පඤ්ච ච අජසතානි පඤ්ච ච උරබ්භසතානි ථූණූපනීතානි හොන්ති යඤ්ඤත්ථාය. යෙපිස්ස භන්තෙ{6 යෙපිස්ස තෙ - මඡසං. ස්යා.} තෙ හොන්ති දාසාති වා පෙස්සාති වා කම්මකරාති වා තෙපි දණ්ඩතජ්ජිතා භයතජ්ජිතා අස්සුමුඛා රුදමානා පරිකම්මානි කරොන්තීති."
            },
            {
                "type": "page-break",
                "text": "144"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා එතමත්ථං විදිත්වා තායං වෙලායං ඉමා ගාථායො අභාසි:"
            },
            {
                "type": "gatha",
                "text": "අස්සමෙධං පුරිසමෙධං සම්මාපාසං වාජපෙය්යං නිරග්ගලං,\nමහායඤ්ඤා මහාරම්භා{1 නිරග්ගලා මහාරම්භා - මඡසං.} න තෙ හොන්ති මහප්ඵලා."
            },
            {
                "type": "gatha",
                "text": "අජෙළකා ච ගාවො ච විවිධා යත්ථ හඤ්ඤරෙ,\nන තං සම්මග්ගතා යඤ්ඤං උපයන්ති මහෙසිනො."
            },
            {
                "type": "gatha",
                "text": "යෙ ච යඤ්ඤා නිරාරම්භා යජන්ති අනුකුලං{2 අනුකූලං - PTS. යජන්තානුකූලං - ස්යා.} සදා,\nඅජෙළකා ච ගාවො ච විවිධා නෙත්ථ හඤ්ඤරෙ"
            },
            {
                "type": "gatha",
                "text": "එතං සම්මග්ගතා යඤ්ඤං උපයන්ති මහෙසිනො,\nඑතං යජෙථ මෙධාවී එසො යඤ්ඤො මහප්ඵලො."
            },
            {
                "type": "gatha",
                "text": "එතං හි යජමානස්ස සෙය්යො හොති න පාපියො,\nයඤ්ඤො ච විපුලො හොති පසීදන්ති ච දෙවතාති."
            },
            {
                "type": "centered",
                "text": "3. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "බන්ධනසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "121. **සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන රඤ්ඤා පසෙනදි{3 පසෙනදිනා - මඡසං. PTS.}කොසලෙන මහාජනකායො බන්ධාපිතො හොති, අප්පෙකච්චෙ රජ්ජූහි අප්පෙකච්චෙ අන්දූහි අප්පෙකච්චෙ සඞ්ඛලිකාහි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො සම්බහුලා භික්ඛූ පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය සාවත්ථිං පිණ්ඩාය පවිසිංසු. සාවත්ථියං පිණ්ඩාය චරිත්වා පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තා යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නා ඛො තෙ භික්ඛූ භගවන්තං එතදවොචුං: ඉධ භන්තෙ රඤ්ඤා පසෙනදිකොසලෙන මහාජනකායො බන්ධාපිතො අප්පෙකච්චෙ රජ්ජූහි අප්පෙකච්චෙ අන්දූහි අප්පෙකච්චෙ සඞ්ඛලිකාහීති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා එතමත්ථං විදිත්වා තායං වෙලායං ඉමා ගාථායො අභාසි:"
            },
            {
                "type": "gatha",
                "text": "න තං දළ්හං බන්ධනමාහු ධීරා\nයදායසං දාරුජං බබ්බජඤ්ච,{4 පබ්බජඤ්ච - මඡසං. ස්යා. PTS.}\nසාරත්තරත්තා මණිකුණ්ඩලෙසු\nපුත්තෙසු දාරෙසු ච යා අපෙක්ඛා."
            },
            {
                "type": "gatha",
                "text": "එතං දළ්හං බන්ධනමාහු ධීරා\nඔහාරිනං සිථිලං දුප්පමුඤ්චං,\nඑතම්පි ඡෙත්වාන පරිබ්බජන්ති\nඅනපෙක්ඛිනො කාම සුඛං පහායාති."
            },
            {
                "type": "centered",
                "text": "බන්ධනවග්ගො පඨමො.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "146"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "දහරො පුරිසො රාජාපියං අත්තානරක්ඛිතො,\nඅප්පකා අත්ථකරණා මල්ලිකා යඤ්ඤබන්ධනන්ති."
            },
            {
                "type": "heading",
                "text": "2. අපුත්තකවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "3. 2. 1.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "සත්තජටිලසුත්තං.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "122. එකං සමයං භගවා සාවත්ථියං විහරති පුබ්බාරාමෙ මිගාරමාතුපාසාදෙ. තෙන ඛො පන සමයෙන භගවා සායන්හසමයං පටිසල්ලානා වුට්ඨිතො බහිද්වාරකොට්ඨකෙ නිසින්නො හොති. අථ ඛො රාජා පසෙනදි කොසලො යෙන භගවා තෙනුපසඞ්කමි; උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි."
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන සත්ත ච ජටිලා සත්ත ච නිගණ්ඨා සත්ත ච අචෙලකා{1 අචෙලා - ස්යා. PTS. සී. 1, 2.} සත්ත ච එකසාටකා සත්ත ච පරිබ්බාජකා පරූළ්හකච්ඡනඛලොමා ඛාරිවිවිධමාදාය{2 ඛාරිවිධං ආදාය - PTS.} භගවතො අවිදූරෙ අතික්කමන්ති. අථ ඛො රාජා පසෙනදි කොසලො උට්ඨායාසනා එකංසං උත්තරාසඞ්ගං කරිත්වා දක්ඛිණජාණුමණ්ඩලං පඨවියං නිහන්ත්වා යෙන තෙ සත්ත ච ජටිලා සත්ත ච නිගණ්ඨා සත්ත ච අචෙලකා සත්ත ච එකසාටකා සත්ත ච පරිබ්බාජකා තෙනඤ්ජලිං පණාමෙත්වා තික්ඛත්තුං නාමං සාවෙසි: රාජාහං භන්තෙ පසෙනදි කොසලො, -පෙ- රාජාහං භන්තෙ පසෙනදි කොසලොති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො රාජා පසෙනදි කොසලො අචිරපක්කන්තෙසු තෙසු සත්තසු ච ජටිලෙසු සත්තසු ච නිගණ්ඨෙසු සත්තසු ච අචෙලකෙසු සත්තසු ච එකසාටකෙසු සත්තසු ච පරිබ්බාජකෙසු යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො රාජා පසෙනදි කොසලො භගවන්තං එතදවොච: යෙ තෙ භන්තෙ ලොකෙ අරහන්තො වා අරහත්තමග්ගං වා සමාපන්නා එතෙ තෙසං අඤ්ඤතරාති."
            },
            {
                "type": "paragraph",
                "text": "දුජ්ජානං ඛො එතං මහාරාජ තයා ගිහිනා කාමභොගිනා පුත්තසම්බාධසයනං අජ්ඣාවසන්තෙන කාසිකචන්දනං පච්චනුභොන්තෙන මාලාගන්ධවිලෙපනං ධාරයන්තෙන ජාතරූපරජතං සාදියන්තෙන ‘ඉමෙ වා අරහන්තො, ඉමෙ වා අරහත්තමග්ගං සමාපන්නා’ති."
            },
            {
                "type": "page-break",
                "text": "148"
            },
            {
                "type": "paragraph",
                "text": "සංවාසෙන ඛො මහාරාජ සීලං වෙදිතබ්බං. තඤ්ච ඛො දීඝෙන අද්ධුනා න ඉත්තරං.{1 ඉතරං - PTS. ස්යා.} මනසිකරොතා නො අමනසිකරොතා. පඤ්ඤවතා{2 පඤ්ඤාවතා - PTS.} නො දුප්පඤ්ඤෙන. සංවොහාරෙන ඛො මහාරාජ සොචෙය්යං වෙදිතබ්බං. තඤ්ච ඛො දීඝෙන අද්ධුනා න ඉත්තරං{3 ඉතරං - PTS. ස්යා.}. මනසිකරොතා නො අමනසිකරොතා. පඤ්ඤවතා{4 පඤ්ඤාවතා - PTS.} නො දුප්පඤ්ඤෙන. ආපදාසු ඛො මහාරාජ ථාමො වෙදිතබ්බො. සො ච ඛො දීඝෙන අද්ධුනා න ඉත්තරං{5 ඉතරං - PTS. ස්යා.}. මනසිකරොතා නො අමනසිකරොතා. පඤ්ඤවතා{6 පඤ්ඤාවතා - PTS.} නො දුප්පඤ්ඤෙන. සාකච්ඡාය ඛො මහාරාජ පඤ්ඤා වෙදිතබ්බා. සා ච ඛො දීඝෙන අද්ධුනා න ඉත්තරං{7 ඉතරං - PTS. ස්යා.}. මනසිකරොතා නො අමනසිකරොතා. පඤ්ඤවතා{8 පඤ්ඤාවතා - PTS} නො දුප්පඤ්ඤෙනාති."
            },
            {
                "type": "paragraph",
                "text": "අච්ඡරියං භන්තෙ අබ්භුතං භන්තෙ, යාව සුභාසිතමිදං භන්තෙ භගවතා: ‘දුජ්ජානං ඛො එතං මහාරාජ තයා ගිහිනා කාමභොගිනා -පෙ- පඤ්ඤවතා නො දුප්පඤ්ඤෙනා’ති."
            },
            {
                "type": "paragraph",
                "text": "එතෙ භන්තෙ මම පුරිසා චාරා{9 චොරා - සීමු. 2. චරා - මඡසං. PTS.} ඔචරකා ජනපදං ඔචරිත්වා ආගච්ඡන්ති. තෙහි පඨමං ඔචිණ්ණං{10 ඔතිණ්ණං - සී.මු. 2.} අහං පච්ඡා ඔයායිස්සාමි{11 ඔසාපයිස්සාමි - මඡසං. PTS. ඔහයිස්සාමි - ස්යා.}. ඉදානි තෙ භන්තෙ රජොජල්ලං පවාහෙත්වා සුන්හාතා සුවිලිත්තා කප්පිතකෙසමස්සූ ඔදාතවත්ථවසනා{12 ඔදාත වත්ථා - මඡසං. PTS.} පඤ්චහි කාමගුණෙහි සමප්පිතා සමඞ්ගීභූතා පරිචාරයිස්සන්තීති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා එතමත්ථං විදිත්වා තායං වෙලායං ඉමා ගාථායො අභාසි:"
            },
            {
                "type": "gatha",
                "text": "න වණ්ණරූපෙන නරො සුජානො\nන විස්සසෙ ඉත්තරදස්සනෙන,\nසුසඤ්ඤතානං හි වියඤ්ජනෙන\nඅසඤ්ඤතා ලොකමිමං චරන්ති."
            },
            {
                "type": "gatha",
                "text": "පතිරූපකො මත්තිකා{13 මත්තික - ස්යා. PTS.} කුණ්ඩලොව\nලොහඩ්ඪමාසොව සුවණ්ණඡන්නො,\nචරන්ති එකෙ{14 ලොකෙ - මඡසං. ස්යා.} පරිවාරඡන්නා\nඅන්තො අසුද්ධා බහි සොභමානාති."
            },
            {
                "type": "centered",
                "text": "3. 2. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පඤ්චරාජසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "123.** සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන පඤ්චන්නං රාජූනං පසෙනදිපමුඛානං පඤ්චහි කාමගුණෙහි සමප්පිතානං සමඞ්ගීභූතානං පරිචාරයමානානං අයමන්තරා කථා උපදපාදි: කින්නු ඛො කාමානං අග්ගන්ති?"
            },
            {
                "type": "page-break",
                "text": "150"
            },
            {
                "type": "paragraph",
                "text": "තත්රෙකච්චෙ එවමාහංසු: රූපා කාමානං අග්ගන්ති. එකච්චෙ එවමාහංසු: සද්දා කාමානං අග්ගන්ති. එකච්චෙ එවමාහංසු: ගන්ධා කාමානං අග්ගන්ති. එකච්චෙ එවමාහංසු: රසා කාමානං අග්ගන්ති. එකච්චෙ එවමාහංසු: ඵොට්ඨබ්බා කාමානං අග්ගන්ති. යතො ඛො තෙ රාජානො{1 මහාරාජානො - සීමු 1.} නාසක්ඛිංසු අඤ්ඤමඤ්ඤං සඤ්ඤාපෙතුං. අථ ඛො රාජා පසෙනදි කොසලො තෙ රාජානො එතදවොච: ආයාම මාරිසා යෙන භගවා තෙනුපසඞ්කමිස්සාම. උපසඞ්කමිත්වා භගවන්තං එතමත්ථං පටිපුච්ඡිස්සාම. යථා නො භගවා ව්යාකරිස්සති තථා නං ධාරෙස්සාමාති{2 ධාරෙය්යාමාති - සීමු 2. ස්යා. PTS.}"
            },
            {
                "type": "paragraph",
                "text": "එවං මාරිසාති ඛො තෙ රාජානො රඤ්ඤො පසෙනදිස්ස කොසලස්ස පච්චස්සොසුං. අථ ඛො තෙ පඤ්ච රාජානො පසෙනදිප්පමුඛා යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නො ඛො රාජා පසෙනදි කොසලො භගවන්තං එතදවොච: “ඉධ භන්තෙ අම්හාකං පඤ්චන්නං රාජූනං පඤ්චහි කාමගුණෙහි සමප්පිතානං සමඞ්ගීභූතානං පරිචාරයමානානං අයමන්තරා කථා උදපාදි: කින්නු ඛො කාමානං අග්ගන්ති? එකච්චෙ එවමාහංසු: රූපා කාමානං අග්ගන්ති. එකච්චෙ එවමාහංසු: සද්දා -පෙ- ඵොට්ඨබ්බා කාමානං අග්ගන්ති. කින්නු ඛො භන්තෙ කාමානං අග්ග”න්ති?"
            },
            {
                "type": "paragraph",
                "text": "මනාපපරියන්තං ඛ්වාහං මහාරාජ පඤ්චසු කාමගුණෙසු අග්ගන්ති වදාමි. තෙ’ව{3 තෙ ච - සීමු. 2. PTS. යෙ ච - ස්යා.} මහාරාජ රූපා එකච්චස්ස මනාපා හොන්ති. තෙ’ව{4 තෙ ච - සීමු. 2. PTS. යෙ ච - ස්යා.} රූපා එකච්චස්ස අමනාපා හොන්ති. යෙහි ච යො රූපෙහි අත්තමනො හොති. පරිපුණ්ණසඞ්කප්පො, සො තෙහි රූපෙහි අඤ්ඤං රූපං උත්තරිතරං වා පණීතතරං වා න පත්ථෙති. තෙ තස්ස රූපා පරමා හොන්ති. තෙ තස්ස රූපා අනුත්තරා හොන්ති."
            },
            {
                "type": "paragraph",
                "text": "තෙ’ව{5 තෙ ච - සීමු. 2.} මහාරාජ සද්දා -පෙ- තෙ’ව මහාරාජ ගන්ධා -පෙ- තෙ’ව මහාරාජ රසා -පෙ- තෙ’ව මහාරාජ ඵොට්ඨබ්බා එකච්චස්ස මනාපා හොන්ති. තෙ’ව{6 තෙ ච - සීමු. 2.} ඵොට්ඨබ්බා එකච්චස්ස අමනාපා හොන්ති. යෙහි ච යො ඵොට්ඨබ්බෙහි අත්තමනො හොති පරිපුණ්ණසඞ්කප්පො, සො තෙහි ඵොට්ඨබ්බෙහි අඤ්ඤං ඵොට්ඨබ්බං උත්තරිතරං වා පණීතතරං වා න පත්ථෙති. තෙ තස්ස ඵොට්ඨබ්බා පරමා හොන්ති. තෙ තස්ස ඵොට්ඨබ්බා අනුත්තරා හොන්තීති."
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන චන්දනඞ්ගලිකො උපාසකො තස්සං පරිසායං නිසින්නො හොති. අථ ඛො චන්දනඞ්ගලිකො උපාසකො උට්ඨායාසනා එකංසං උත්තරාසඞ්ගං කරිත්වා යෙන භගවා තෙනඤ්ජලිං පණාමෙත්වා භගවන්තං එතදවොච: පටිභාති මං භගවා, පටිභාති මං සුගතාති."
            },
            {
                "type": "paragraph",
                "text": "“පටිභාතු තං චන්දනඞ්ගලිකා”ති භගවා අවොච."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො චන්දනඞ්ගලිකො උපාසකො භගවතො සම්මුඛා තදනුරූපාය ගාථාය අභිත්ථවි:"
            },
            {
                "type": "page-break",
                "text": "152"
            },
            {
                "type": "gatha",
                "text": "පදුමං යථා කොකනදං සුගන්ධං\nපාතො සියා ඵුල්ලමවීතගන්ධං,\nඅඞ්ගීරසං පස්ස විරොචමානං\nතපන්තමාදිච්චමිවන්තලික්ඛෙති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො තෙ පඤ්ච රාජානො චන්දනඞ්ගලිකං උපාසකං පඤ්චහි උත්තරාසඞ්ගෙහි අච්ඡාදෙසුං. අථ ඛො චන්දනඞ්ගලිකො උපාසකො තෙහි පඤ්චහි උත්තරාසඞ්ගෙහි භගවන්තං අච්ඡාදෙසීති."
            },
            {
                "type": "centered",
                "text": "3. 2. 3",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දොණපාකසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "124. **සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන රාජා පසෙනදි කොසලො දොණපාකං සුදං{1 දොණපාකකුරං - මඡසං. දොණපාකසුදං - සීමු.} පරිභුඤ්ජති. අථ ඛො රාජා පසෙනදි කොසලො භුත්තාවී මහස්සාසී යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා තං රාජානං පසෙනදිං කොසලං භුත්තාවිං මහස්සාසිං විදිත්වා තායං වෙලායං ඉමං ගාථං අභාසි:"
            },
            {
                "type": "gatha",
                "text": "මනුජස්ස සදා සතීමතො මත්තං ජානතො ලද්ධභොජනෙ,\nතනු තස්ස{2 තනූකස්ස - මඡසං. ස්යා.} භවන්ති වෙදනා සනිකං ජීරති ආයුපාලයන්ති."
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන සුදස්සනො මාණවො රඤ්ඤො පසෙනදිස්ස කොසලස්ස පිට්ඨිතො ඨිතො හොති. අථ ඛො රාජා පසෙනදි කොසලො සුදස්සනං මාණවං ආමන්තෙසි: “එහි ත්වං, තාත සුදස්සන, භගවතො සන්තිකෙ ඉමං ගාථං පරියාපුණිත්වා මම භත්තාභිහාරෙ භාස. අහඤ්ච තෙ දෙවසිකං කහාපණසතං නිච්චභික්ඛං{3 නිච්චං භික්ඛං - මඡසං. නිච්චභත්තං - ස්යා.} පවත්තයිස්සාමීති.” එවං දෙවාති ඛො සුදස්සනො මාණවො රඤ්ඤො පසෙනදිස්ස කොසලස්ස පටිස්සුත්වා{4 පටිස්සුණිත්වා - ස්යා. PTS.} භගවතො සන්තිකෙ ඉමං ගාථං පරියාපුණිත්වා පසෙනදිස්ස කොසලස්ස භත්තාභිහාරෙ සුදං භාසති:"
            },
            {
                "type": "gatha",
                "text": "“මනුජස්ස සදා සතීමතො මත්තං ජානතො ලද්ධභොජනෙ,\nතනු තස්ස{5 තනුකස්ස - මඡසං. ස්යා.} භවන්ති වෙදනා සනිකං ජීරති ආයුපාලයන්ති.”"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො රාජා පසෙනදි කොසලො අනුපුබ්බෙන නාළිකොදනපරමතාය සණ්ඨාසි. අථ ඛො රාජා පසෙනදි කොසලො අපරෙන සමයෙන සල්ලිඛිතගත්තො{6 සුසල්ලිඛිතගත්තො - මඡසං. ස්යා.} පාණිනා ගත්තානි අනුමජ්ජන්තො තායං වෙලායං ඉමං උදානං උදානෙසි: “උභයෙන වත මං සො භගවා අත්ථෙන අනුකම්පි, දිට්ඨධම්මිකෙන චෙව අත්ථෙන සම්පරායිකෙන චා”ති."
            },
            {
                "type": "page-break",
                "text": "154"
            },
            {
                "type": "centered",
                "text": "3. 2. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පඨමසඞ්ගාමසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "125.** සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො රාජා මාගධො අජාතසත්තු වෙදෙහිපුත්තො චතුරඞ්ගිනිං සෙනං සන්නය්හිත්වා රාජානං පසෙනදිං කොසලං අබ්භුය්යාසි යෙන කාසි."
            },
            {
                "type": "paragraph",
                "text": "අස්සොසි ඛො රාජා පසෙනදි කොසලො “රාජා කිර මාගධො අජාතසත්තු වෙදෙහිපුත්තො චතුරඞ්ගිනිං සෙනං සන්නය්හිත්වා මමං අබ්භුය්යාතො යෙන කාසී”ති. අථ ඛො රාජා පසෙනදි කොසලො චතුරඞ්ගිනිං සෙනං සන්නය්හිත්වා රාජානං මාගධං අජාතසත්තුං වෙදෙහිපුත්තං පච්චුය්යාසි යෙන කාසි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො රාජා ච මාගධො අජාතසත්තු වෙදෙහිපුත්තො රාජා ච පසෙනදි කොසලො සඞ්ගාමෙසුං. තස්මිං ඛො පන සඞ්ගාමෙ රාජා මාගධො අජාතසත්තු වෙදෙහිපුත්තො රාජානං පසෙනදිං කොසලං පරාජෙසි. පරාජිතො ච රාජා පසෙනදි කොසලො සකමෙව රාජධානිං සාවත්ථිං පායාසි{1 පච්චුය්යාසි - මඡසං. ස්යා. සීමු 1.}."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො සම්බහුලා භික්ඛූ පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය සාවත්ථිං පිණ්ඩාය පවිසිංසු. සාවත්ථියං පිණ්ඩාය චරිත්වා පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තා යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නා ඛො තෙ භික්ඛූ භගවන්තං එතදවොචුං:"
            },
            {
                "type": "paragraph",
                "text": "ඉධ භන්තෙ රාජා මාගධො අජාතසත්තු වෙදෙහිපුත්තො චතුරඞ්ගිනිං සෙනං සන්නය්හිත්වා රාජානං පසෙනදිං කොසලං අබ්භුය්යාසි යෙන කාසි. අස්සොසි ඛො භන්තෙ රාජා පසෙනදි කොසලො “රාජා කිර මාගධො අජාතසත්තු වෙදෙහිපුත්තො චතුරඞ්ගිනිං සෙනං සන්නය්හිත්වා මමං අබ්භුය්යාතො යෙන කාසී”ති. අථ ඛො භන්තෙ රාජා පසෙනදි කොසලො චතුරඞ්ගිනිං සෙනං සන්නය්හිත්වා රාජානං මාගධං අජාතසත්තුං වෙදෙහිපුත්තං පච්චුය්යාසි යෙන කාසි. අථ ඛො භන්තෙ රාජා ච මාගධො අජාතසත්තු වෙදෙහිපුත්තො රාජා ච පසෙනදි කොසලො සඞ්ගාමෙසුං."
            },
            {
                "type": "paragraph",
                "text": "තස්මිං ඛො පන භන්තෙ, සඞ්ගාමෙ රාජා මාගධො අජාතසත්තු වෙදෙහිපුත්තො රාජානං පසෙනදිං කොසලං පරාජෙසි. පරාජිතො ච භන්තෙ, රාජා පසෙනදි කොසලො සකමෙව රාජධානිං සාවත්ථිං පායාසීති."
            },
            {
                "type": "paragraph",
                "text": "රාජා භික්ඛවෙ, මාගධො අජාතසත්තු වෙදෙහිපුත්තො පාපමිත්තො පාපසහායො පාපසම්පවඞ්කො. රාජා ච ඛො භික්ඛවෙ, පසෙනදි කොසලො කල්යාණමිත්තො කල්යාණසහායො කල්යාණසම්පවඞ්කො. අජ්ජතඤ්ච{2 අජ්ජෙව - මඡසං. සී 1. ස්යා.} භික්ඛවෙ රාජා පසෙනදි කොසලො ඉමං රත්තිං දුක්ඛං සෙස්සති{3 සෙති - මඡසං. සී 1.} පරාජිතොති."
            },
            {
                "type": "gatha",
                "text": "ජයං වෙරං පසවති දුක්ඛං සෙති පරාජිතො,\nඋපසන්තො සුඛං සෙති හිත්වා ජයපරාජයන්ති."
            },
            {
                "type": "page-break",
                "text": "156"
            },
            {
                "type": "centered",
                "text": "3. 2. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතියසඞ්ගාමසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "126.** සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො රාජා මාගධො අජාතසත්තු වෙදෙහිපුත්තො චතුරඞ්ගිනිං සෙනං සන්නය්හිත්වා රාජානං පසෙනදිං කොසලං අබ්භුය්යාසි යෙන කාසි.{1 යෙන කාසි - PTS.} අස්සොසි ඛො රාජා පසෙනදි කොසලො රාජා කිර මාගධො අජාතසත්තු වෙදෙහිපුත්තො චතුරඞ්ගිනිං සෙනං සන්නය්හිත්වා මමං අබ්භුය්යාතො යෙන කාසීති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො රාජා පසෙනදි කොසලො චතුරඞ්ගිනිං සෙනං සන්නය්හිත්වා රාජානං මාගධං අජාතසත්තුං වෙදෙහිපුත්තං පච්චුය්යාසි යෙන කාසි.{2 යෙන කාසි - PTS.} අථ ඛො රාජා ච මාගධො අජාතසත්තු වෙදෙහිපුත්තො රාජා ච පසෙනදි කොසලො සඞ්ගාමෙසුං. තස්මිං ඛො පන සඞ්ගාමෙ රාජා පසෙනදි කොසලො රාජානං මාගධං අජාතසත්තුං වෙදෙහිපුත්තං පරාජෙසි, ජීවග්ගාහඤ්ච{3 ජීවග්ගාහං - මඡසං. PTS.} නං අග්ගහෙසි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො රඤ්ඤො පසෙනදිස්ස කොසලස්ස එතදහොසි: කිඤ්චාපි ඛො ම්යායං රාජා මාගධො අජාතසත්තු වෙදෙහිපුත්තො අදුබ්භන්තස්ස දුබ්භති. අථ ච පන මෙ භාගිනෙය්යො හොති. යන්නූනාහං රඤ්ඤො මාගධස්ස අජාතසත්තුනො{4 අජාතසත්තුස්ස - සීමු. 1. 2.} වෙදෙහිපුත්තස්ස සබ්බං හත්ථිකායං පරියාදියිත්වා සබ්බං අස්සකායං පරියාදියිත්වා සබ්බං රථකායං පරියාදියිත්වා සබ්බං පත්තිකායං පරියාදියිත්වා ජීවන්තමෙව නං ඔස්සජ්ජෙය්යන්ති{5 ඔසජ්ජෙය්යං - මඡසං.}."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො රාජා පසෙනදි කොසලො රඤ්ඤො මාගධස්ස අජාතසත්තුනො වෙදෙහිපුත්තස්ස සබ්බං හත්ථිකායං පරියාදියිත්වා -පෙ- ජීවන්තමෙව නං ඔස්සජ්ජි{6 ඔස්සජි - මඡසං.}."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො සම්බහුලා භික්ඛූ පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය සාවත්ථිං පිණ්ඩාය පවිසිංසු. සාවත්ථියං පිණ්ඩාය චරිත්වා පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තා යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නා ඛො තෙ භික්ඛූ භගවන්තං එතදවොචුං:"
            },
            {
                "type": "paragraph",
                "text": "ඉධ භන්තෙ, රාජා මාගධො අජාතසත්තු වෙදෙහිපුත්තො චතුරඞ්ගිනිං සෙනං සන්නය්හිත්වා රාජානං පසෙනදිං කොසලං අබ්භුය්යාසි යෙන කාසි. අස්සොසි ඛො භන්තෙ, රාජා පසෙනදි කොසලො -පෙ- කාසීති. අථ ඛො භන්තෙ, රාජා පසෙනදි කොසලො චතුරඞ්ගිනිං සෙනං සන්නය්හිත්වා රාජානං මාගධං අජාතසත්තුං වෙදෙහිපුත්තං පච්චුය්යාසි යෙන කාසි. අථ ඛො භන්තෙ, රාජා ච මාගධො අජාතසත්තු වෙදෙහිපුත්තො රාජා ච පසෙනදි කොසලො සඞ්ගාමෙසුං. තස්මිං ඛො පන භන්තෙ, සඞ්ගාමෙ රාජා පසෙනදි කොසලො රාජානං මාගධං අජාතසත්තුං වෙදෙහිපුත්තං පරාජෙසි, ජීවග්ගාහඤ්ච නං අග්ගහෙසි."
            },
            {
                "type": "page-break",
                "text": "158"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භන්තෙ, රඤ්ඤො පසෙනදිස්ස කොසලස්ස එතදහොසි: කිඤ්චාපි ඛො ම්යායං රාජා මාගධො අජාතසත්තු වෙදෙහිපුත්තො අදුබ්භන්තස්ස දුබ්භති, අථ ච පන මෙ භාගිනෙය්යො හොති. යන්නූනාහං රඤ්ඤො මාගධස්ස අජාතසත්තුනො වෙදෙහිපුත්තස්ස සබ්බං හත්ථිකායං පරියාදියිත්වා සබ්බං අස්සකායං සබ්බං රථකායං පරියාදියිත්වා සබ්බං පත්තිකායං පරියාදියිත්වා ජීවන්තමෙව නං ඔස්සජ්ජෙය්යන්ති. අථ ඛො භන්තෙ, රාජා පසෙනදි කොසලො රඤ්ඤො මාගධස්ස අසතජාතසත්තුනො වෙදෙහිපුත්තස්ස සබ්බං හත්ථිකායං පරියාදියිත්වා සබ්බං අස්සකායං පරියාදියිත්වා සබ්බං රථකායං පරියාදියිත්වා සබ්බං පත්තිකායං පරියාදියිත්වා ජීවන්තමෙව නං ඔස්සජ්ජි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා එතමත්ථං විදිත්වා තායං වෙලායං ඉමා ගාථායො අභාසි:"
            },
            {
                "type": "gatha",
                "text": "විලුම්පතෙව පුරිසො යාවස්ස උපකප්පති,\nයදා චඤ්ඤෙ විලුම්පන්ති සො විලුත්තො විලුප්පති{1 විලුම්පති - ස්යා. සීමු. 1. 2. සී 2. PTS.}."
            },
            {
                "type": "gatha",
                "text": "ඨානං හි මඤ්ඤති බාලො යාව පාපං න පච්චති,\nයදා ච පච්චති පාපං අථ{2 අථ දුක්ඛං - මඡසං.} බාලො දුක්ඛං නිගච්ඡති."
            },
            {
                "type": "gatha",
                "text": "හන්තා ලභති හන්තාරං ජෙතාරං ලභතෙ ජයං,\nඅක්කොසකො ච අක්කොසං රොසෙතාරඤ්ච රොසකො,\nඅථ කම්මවිවට්ටෙන සො විලුත්තො විලුප්පතීති{3 විලුම්පති - ස්යා. සීමු. 1. 2. සී 2. PTS.}."
            },
            {
                "type": "centered",
                "text": "3. 2. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ධීතුසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "127. **සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො රාජා පසෙනදි කොසලො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො අඤ්ඤතරො පුරිසො යෙන රාජා පසෙනදි කොසලො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා රඤ්ඤො පසෙනදිස්ස කොසලස්ස උපකණ්ණකෙ ආරොචෙසි: මල්ලිකා දෙව, දෙවී ධීතරං විජාතාති. එවං වුත්තෙ රාජා පසෙනදි කොසලො අනත්තමනො අහොසි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා රාජානං පසෙනදිං කොසලං අනත්තමනං{4 අනත්තමනතං - මඡසං. සීමු 1. PTS.} විදිත්වා තායං වෙලායං ඉමා ගාථායො අභාසි:"
            },
            {
                "type": "gatha",
                "text": "ඉත්ථි පි හි එකච්චියා සෙය්යා පොස ජනාධිප,\nමෙධාවිනී සීලවතී සස්සුදෙවා පතිබ්බතා."
            },
            {
                "type": "gatha",
                "text": "තස්සා යො ජායති පොසො සූරො හොති දිසම්පති,\nතාදිසා සුභගියා{5 සුභරියා - PTS.} පුත්තො රජ්ජම්පි අනුසාසතීති."
            },
            {
                "type": "page-break",
                "text": "160"
            },
            {
                "type": "centered",
                "text": "3. 2. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අප්පමාදසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "128. **සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසීදි, එකමන්තං නිසින්නො ඛො රාජා පසෙනදි කොසලො භගවන්තං එතදවොච: අත්ථි නු ඛො භන්තෙ එකො ධම්මො යො උභො අත්ථෙ සමධිගය්හ{1 සමධිග්ගය්හ - මඡසං. ස්යා. PTS.} තිට්ඨති, දිට්ඨධම්මිකඤ්චෙව අත්ථං සම්පරායිකඤ්චාති."
            },
            {
                "type": "paragraph",
                "text": "අත්ථි ඛො මහාරාජ එකො ධම්මො යො උභො අත්ථෙ සමධිගය්හ{2 සමධිග්ගය්හ - මඡසං. ස්යා. PTS.} තිට්ඨති, දිට්ඨධම්මිකඤ්චෙව අත්ථං සම්පරායිකඤ්චාති."
            },
            {
                "type": "paragraph",
                "text": "කතමො පන භන්තෙ එකො ධම්මො යො උභො අත්ථෙ සමධිගය්හ{3 සමධිග්ගය්හ - මඡසං. ස්යා. PTS.} තිට්ඨති, දිට්ඨධම්මිකඤ්චෙව අත්ථං සම්පරායිකඤ්චාති?"
            },
            {
                "type": "paragraph",
                "text": "අප්පමාදො ඛො මහාරාජ එකො ධම්මො යො උභො අත්ථෙ සමධිගය්හ{4 සමධිග්ගය්හ - මඡසං. ස්යා. PTS.} තිට්ඨති දිට්ඨධම්මිකඤ්චෙව අත්ථං සම්පරායිකඤ්චාති. සෙය්යථාපි මහාරාජ යානි කානිචි ජඞ්ගමානං{5 ජඞ්ගලානං - මඡසං. ස්යා.} පාණානං පදජාතානි සබ්බානි තානි හත්ථිපදෙ සමොධානං ගච්ඡන්ති, හත්ථිපදං තෙසං අග්ගමක්ඛායති යදිදං මහන්තත්තෙන. එවමෙව ඛො මහාරාජ අප්පමාදො එකො ධම්මො යො උභො අත්ථෙ සමධිගය්හ{6 සමධිග්ගය්හ - මඡසං. ස්යා. PTS.} තිට්ඨති දිට්ඨධම්මිකඤ්චෙව අත්ථං සම්පරායිකඤ්චාති."
            },
            {
                "type": "gatha",
                "text": "ආයුං අරොගියං වණ්ණං සග්ගං උච්චාකුලීනතං,\nරතියො පත්ථයන්තෙන උළාරා අපරාපරා,\nඅප්පමාදං පසංසන්ති පුඤ්ඤකිරියාසු පණ්ඩිතා"
            },
            {
                "type": "gatha",
                "text": "අප්පමත්තො උභො අත්ථෙ අධිගණ්හාති{7 අධිග්ගණ්හාති - මඡසං. ස්යා.} පණ්ඩිතො,\nදිට්ඨෙ ධම්මෙ ච යො අත්ථො යො චත්ථො සම්පරායිකො,\nඅත්ථාභිසමයා ධීරො පණ්ඩිතොති පවුච්චතීති."
            },
            {
                "type": "centered",
                "text": "3. 2. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කල්යාණමිත්තසුත්තං.{8 දුතියප්පමාදසුත්තං - ස්යා. PTS.}",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "129. **සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො රාජා පසෙනදි කොසලො භගවන්තං එතදවොච: ඉධ මය්හං භන්තෙ රහොගතස්ස පටිසල්ලීනස්ස එවං චෙතසො පරිවිතක්කො උදපාදි: ස්වාක්ඛාතො භගවතා ධම්මො. සො ච ඛො කල්යාණමිත්තස්ස කල්යාණසහායස්ස කල්යාණසම්පවඞ්කස්ස නො පාපමිත්තස්ස නො පාපසහායස්ස නො පාපසම්පවඞ්කස්සාති."
            },
            {
                "type": "page-break",
                "text": "162"
            },
            {
                "type": "paragraph",
                "text": "එවමෙතං මහාරාජ, එවමෙතං මහාරාජ, ස්වාක්ඛාතො මහාරාජ මයා ධම්මො. සො ච ඛො කල්යාණමිත්තස්ස කල්යාණසහායස්ස කල්යාණසම්පවඞ්කස්ස. නො පාපමිත්තස්ස නො පාපසහායස්ස නො පාපසම්පවඞ්කස්සාති."
            },
            {
                "type": "paragraph",
                "text": "එකමිදාහං මහාරාජ, සමයං සක්කෙසු විහරාමි නාගරකං{1 නගරකං - මඡසං. ස්යා.} නාම සක්යානං නිගමො. අථ ඛො මහාරාජ ආනන්දො භික්ඛු යෙනාහං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා මං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො මහාරාජ ආනන්දො භික්ඛු මං එතදවොච: උපඩ්ඪමිදං භන්තෙ බ්රහ්මචරියස්ස යදිදං කල්යාණමිත්තතා කල්යාණසහායතා කල්යාණසම්පවඞ්කතාති. එවං වුත්තාහං මහාරාජ ආනන්දං භික්ඛුං එතදවොචං: මා හෙවං ආනන්ද, මා හෙවං ආනන්ද, සකලමෙව හිදං ආනන්ද බ්රහ්මචරියං යදිදං කල්යාණමිත්තතා කල්යාණසහායතා කල්යාණසම්පවඞ්කතා. කල්යාණමිත්තස්සෙතං ආනන්ද භික්ඛුනො පාටිකඞ්ඛං කල්යාණසහායස්ස කල්යාණසම්පවඞ්කස්ස අරියං අට්ඨඞ්ගිකං මග්ගං භාවෙස්සති{2 භාවෙය්ය - සීමු. 3.} අරියං අට්ඨඞ්ගිකං මග්ගං බහුලීකරිස්සතීති."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච ආනන්ද භික්ඛු කල්යාණමිත්තො කල්යාණසහායො කල්යාණසම්පවඞ්කො “අරියං අට්ඨඞ්ගිකං මග්ගං භාවෙති”{3 අන්තරිතපාඨො න දිස්සතෙ. PTS. පොත්ථකෙ.} අරියං අට්ඨඞ්ගිකං මග්ගං බහුලීකරොති? ඉධානන්ද භික්ඛු සම්මාදිට්ඨිං භාවෙති විවෙකනිස්සිතං විරාගනිස්සිතං නිරොධනිස්සිතං වොස්සග්ගපරිණාමිං. සම්මාසඞ්කප්පං භාවෙති - සම්මාවාචං භාවෙති - සම්මාකම්මන්තං භාවෙති - සම්මාආජීවං භාවෙති - සම්මාවායාමං භාවෙති - සම්මාසතිං භාවෙති - සම්මාසමාධිං භාවෙති විවෙකනිස්සිතං විරාගනිස්සිතං නිරොධනිස්සිතං වොස්සග්ගපරිණාමිං. එවං ඛො ආනන්ද භික්ඛු කල්යාණමිත්තො කල්යාණසහායො කල්යාණසම්පවඞ්කො අරියං අට්ඨඞ්ගිකං මග්ගං භාවෙති, අරියං අට්ඨඞ්ගිකං මග්ගං බහුලීකරොති."
            },
            {
                "type": "paragraph",
                "text": "තදමිනාපෙතං ආනන්ද පරියායෙන වෙදිතබ්බං: යථා සකලමෙවිදං බ්රහ්මචරියං යදිදං කල්යාණමිත්තතා කල්යාණසහායතා කල්යාණසම්පවඞ්කතාති."
            },
            {
                "type": "paragraph",
                "text": "මමං හි ආනන්ද කල්යාණමිත්තං ආගම්ම ජාතිධම්මා සත්තා ජාතියා පරිමුච්චන්ති. ජරාධම්මා සත්තා ජරාය පරිමුච්චන්ති. ව්යාධිධම්මා සත්තා ව්යාධිනා{4 ව්යාධිතො - මඡසං. ස්යා. ව්යාධියා - PTS.} පරිමුච්චන්ති. මරණධම්මා සත්තා මරණෙන පරිමුච්චන්ති. සොකපරිදෙවදුක්ඛදොමනස්සුපායාසධම්මා සත්තා සොකපරිදෙවදුක්ඛදොමනස්සුපායාසෙහි පරිමුච්චන්ති. ඉමිනා ඛො එතං ආනන්ද පරියායෙන වෙදිතබ්බං: යථා සකලමෙවහිදං බ්රහ්මචරියං යදිදං කල්යාණමිත්තතා කල්යාණසහායතා කල්යාණසම්පවඞ්කතාති."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ තෙ මහාරාජ එවං සික්ඛිතබ්බං: කල්යාණමිත්තො භවිස්සාමි කල්යාණසහායො කල්යාණසම්පවඞ්කොති. එවං හි තෙ මහාරාජ සික්ඛිතබ්බං. කල්යාණමිත්තස්ස තෙ මහාරාජ කල්යාණසහායස්ස කල්යාණසම්පවඞ්කස්ස අයං එකො ධම්මො උපනිස්සාය විහාතබ්බො අප්පමාදො කුසලෙසු ධම්මෙසු."
            },
            {
                "type": "page-break",
                "text": "164"
            },
            {
                "type": "paragraph",
                "text": "අප්පමත්තස්ස තෙ මහාරාජ, විහරතො අප්පමාදං උපනිස්සාය ඉත්ථාගාරස්ස{1 ඉත්ථාගාරස්ස අනුයන්තස්ස - මඡසං. අනුයායන්තස්ස - ස්යා.} එවං භවිස්සති: රාජා ඛො අප්පමත්තො විහරති අප්පමාදං උපනිස්සාය. හන්ද මයම්පි අප්පමත්තා විහරාම අප්පමාදං උපනිස්සායාති."
            },
            {
                "type": "paragraph",
                "text": "අප්පමත්තස්ස තෙ මහාරාජ විහරතො අප්පමාදං උපනිස්සාය ඛත්තියානම්පි අනුයුත්තානං{2 අනුයුත්තානං - ස්යා. මඡසං.} එවං භවිස්සති: රාජා ඛො අප්පමත්තො විහරති අප්පමාදං උපනිස්සාය. හන්ද මයම්පි අප්පමත්තා විහරාම අප්පමාදං උපනිස්සායාති."
            },
            {
                "type": "paragraph",
                "text": "අප්පමත්තස්ස තෙ මහාරාජ විහරතො අප්පමාදං උපනිස්සාය බලකායස්සපි එවං භවිස්සති: රාජා ඛො අප්පමත්තො විහරති අප්පමාදං උපනිස්සාය. හන්ද මයම්පි අප්පමත්තා විහරාම අප්පමාදං උපනිස්සායාති."
            },
            {
                "type": "paragraph",
                "text": "අප්පමත්තස්ස තෙ මහාරාජ විහරතො අප්පමාදං උපනිස්සාය නෙගමජානපදස්සාපි{3 ජානපදස්සපි - මඡසං. PTS.} එවං භවිස්සති: රාජා ඛො අප්පමත්තො විහරති, අප්පමාදං උපනිස්සාය. හන්ද මයම්පි අප්පමත්තා විහරාම අප්පමාදං උපනිස්සායාති."
            },
            {
                "type": "paragraph",
                "text": "අප්පමත්තස්ස තෙ මහාරාජ විහරතො අප්පමාදං උපනිස්සාය අත්තාපි ගුත්තො රක්ඛිතො භවිස්සති, ඉත්ථාගාරම්පි ගුත්තං රක්ඛිතං භවිස්සති, කොසකොට්ඨාගාරම්පි ගුත්තං රක්ඛිතං භවිස්සතීති."
            },
            {
                "type": "gatha",
                "text": "භොගෙ පත්ථයමානෙන උළාරෙ අපරාපරෙ,\nඅප්පමාදං පසංසන්ති පුඤ්ඤකිරියාසු පණ්ඩිතා."
            },
            {
                "type": "gatha",
                "text": "අප්පමත්තො උභො අත්ථෙ අධිගණ්හාති පණ්ඩිතො,\nදිට්ඨෙ{4 දිට්ඨෙව ධම්මෙ - සීමු.} ධම්මෙ ච යො අත්ථො යො චත්ථො සම්පරායිකො,\nඅත්ථාභිසමයා ධීරො පණ්ඩිතොති පවුච්චතීති."
            },
            {
                "type": "centered",
                "text": "3. 2. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පඨමං අපුත්තකසුත්තං.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "130. **සාවත්ථියං ---**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො රාජා පසෙනදි කොසලො දිවාදිවස්ස යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො රාජානං පසෙනදිං{5 පසෙනදි - කත්ථචි.} කොසලං භගවා එතදවොච: හන්ද කුතො නු ත්වං මහාරාජ ආගච්ඡසි දිවාදිවස්සාති?"
            },
            {
                "type": "page-break",
                "text": "166"
            },
            {
                "type": "paragraph",
                "text": "ඉධ භන්තෙ සාවත්ථියං සෙට්ඨි ගහපති කාලකතො.{1 නාලකතො - මඡසං.} තමහං අපුත්තකං සාපතෙය්යං රාජන්තෙපුරං අතිහරිත්වා ආගච්ඡාමි. අසීති භන්තෙ සතසහස්සානි හිරඤ්ඤස්සෙව, කො පන වාදො රූපියස්ස. තස්ස ඛො පන භන්තෙ සෙට්ඨිස්ස ගහපතිස්ස එවරූපො භත්තභොගො අහොසි: කණාජකං භුඤ්ජති බිලඞ්ගදුතියං. එවරූපො වත්ථභොගො අහොසි: සාණං ධාරෙති තිපක්ඛවසනං. එවරූපො යානභොගො අහොසි: ජජ්ජරරථකෙන යාති පණ්ණච්ඡත්තකෙන ධාරියමානෙනාති."
            },
            {
                "type": "paragraph",
                "text": "එවමෙතං මහාරාජ, එවමෙතං මහාරාජ, අසප්පුරිසො ඛො මහාරාජ උළාරෙ භොගෙ ලභිත්වා නෙව අත්තානං සුඛෙති පීණෙති. න මාතාපිතරො සුඛෙති පීණෙති. න පුත්තදාරං සුඛෙති පීණෙති. න දාසකම්මකරපොරිසෙ සුඛෙති පීණෙති. න මිත්තාමච්චෙ සුඛෙති පීණෙති. න සමණබ්රාහ්මණෙසු උද්ධග්ගිකං දක්ඛිණං පතිට්ඨාපෙති සොවග්ගිකං සුඛවිපාකං සග්ගසංවත්තනිකං. තස්ස තෙ භොගෙ එවං සම්මා අපරිභුඤ්ජියමානෙ{2 අපරිභුඤ්ජමානො - සීමු. PTS. සී 2.} රාජානො වා හරන්ති. චොරා වා හරන්ති. අග්ගි වා ඩහති. උදකං වා වහති. අප්පියා වා දායාදා හරන්ති. එවං ස තෙ{3 එවංසන්තෙ සීමු. PTS. සී2.} මහාරාජ භොගා සම්මා අපරිභුඤ්ජියමානා{4 අපරිභුඤජමානා - සීමු. ස්යා. PTS. සී2.} පරික්ඛයං ගච්ඡන්ති නො පරිභොගං."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි මහාරාජ, අමනුස්සට්ඨානෙ පොක්ඛරණී අච්ඡොදකා සීතොදකා සාතොදකා සෙතකා{5 සෙතොදකා - මඡසං.} සුපතිත්ථා රමණීයා. තං ජනො නෙව හරෙය්ය, න පිවෙය්ය, න නහායෙය්ය, න යථාප්පච්චයං වා කරෙය්ය. එවං හි තං මහාරාජ උදකං සම්මා අපරිභුඤ්ජියමානං පරික්ඛයං ගච්ඡෙය්ය නො පරිභොගං."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො මහාරාජ, අසප්පුරිසො උළාරෙ භොගෙ ලභිත්වා නෙවත්තානං සුඛෙති පීණෙති -පෙ- අප්පියා වා දායාදා හරන්ති. එවං ස තෙ භොගා සම්මා අපරිභුඤ්ජියමානා පරික්ඛයං ගච්ඡන්ති නො පරිභොගං."
            },
            {
                "type": "paragraph",
                "text": "සප්පුරිසො ච ඛො මහාරාජ උළාරෙ භොගෙ ලභිත්වා අත්තානං සුඛෙති පීණෙති. මාතාපිතරො සුඛෙති පීණෙති. පුත්තදාරං සුඛෙති පීණෙති. දාසකම්මකරපොරිසෙ සුඛෙති පීණෙති. මිත්තාමච්චෙ සුඛෙති පීණෙති. සමණබ්රාහ්මණෙසු උද්ධග්ගිකං දක්ඛිණං පතිට්ඨාපෙති සොවග්ගිකං සුඛවිපාකං සග්ගසංවත්තනිකං. තස්ස තෙ භොගෙ එවං සම්මා පරිභුඤ්ජියමානෙ නෙව රාජානො හරන්ති. න චොරා හරන්ති. න අග්ගි ඩහති. න උදකං වහති. න අප්පියා දායාදා හරන්ති. එවං ස තෙ මහාරාජ භොගා සම්මා පරිභුඤ්ජියමානා පරිභොගං ගච්ඡන්ති නො පරික්ඛයං."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි මහාරාජ ගාමස්ස වා නිගමස්ස වා අවිදූරෙ පොක්ඛරණී අච්ඡොදකා සීතොදකා සාතොදකා සෙතකා සුපතිත්ථා රමණීයා. තං ජනො හරෙය්යපි පිවෙය්යපි නහායෙය්යපි යථාප්පච්චයම්පි කරෙය්ය. එවං හි තං මහාරාජ උදකං සම්මා පරිභුඤ්ජියමානං පරිභොගං ගච්ඡෙය්ය නො පරික්ඛයං. එවමෙව ඛො මහාරාජ සප්පුරිසො උළාරෙ භොගෙ ලභිත්වා අත්තානං සුඛෙති පීණෙති -පෙ- එවං ස තෙ භොගා සම්මා පරිභුඤ්ජියමානා පරිභොගං ගච්ඡන්ති නො පරික්ඛයන්ති."
            },
            {
                "type": "page-break",
                "text": "168"
            },
            {
                "type": "gatha",
                "text": "අමනුස්සට්ඨානෙ උදකංව සීතං තදපෙය්යමානං පරිසොසමෙති,\nඑවං ධනං කාපුරිසො ලභිත්වා නෙවත්තනා භුඤ්ජති නො දදාති.\nධීරො ච විඤ්ඤූ අධිගම්ම භොගෙ යො භුඤ්ජති කිච්චකරො ච හොති,\nසො ඤාතිසඞ්ඝං නිසභො භරිත්වා අනින්දිතො සග්ගමුපෙති ඨානන්ති."
            },
            {
                "type": "centered",
                "text": " 3. 2. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතියං අපුත්තකසුත්තං.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "131.** සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො රාජා පසෙනදි කොසලො දිවාදිවස්ස යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො රාජානං පසෙනදිං කොසලං භගවා එතදවොච: හන්ද කුතො නු ත්වං මහාරාජ ආගච්ඡසි දිවාදිවස්සාති?"
            },
            {
                "type": "paragraph",
                "text": "ඉධ භන්තෙ සාවත්ථියං සෙට්ඨි ගහපති කාලකතො. තමහං අපුත්තකං සාපතෙය්යං රාජන්තෙපුරං අතිහරිත්වා ආගච්ඡාමි. සතං භන්තෙ සතසහස්සානං{1 සතසහස්සානි - කත්ථචි.} හිරඤ්ඤස්සෙව, කො පන වාදො රූපියස්ස. තස්ස ඛො පන භන්තෙ සෙට්ඨිස්ස ගහපතිස්ස එවරූපො භත්තභොගො අහොසි: කණාජකං භුඤ්ජති බිලඞ්ගදුතියං. එවරූපො වත්ථභොගො අහොසි: සාණං ධාරෙති තිපක්ඛවසනං. එවරූපො යානභොගො අහොසි: ජජ්ජරරථකෙන යාති පණ්ණඡත්තකෙන ධාරියමානෙනාති."
            },
            {
                "type": "paragraph",
                "text": "එවමෙතං මහාරාජ, එවමෙතං මහාරාජ, භූතපුබ්බං සො මහාරාජ සෙට්ඨි ගහපති තගරසිඛිං{2 තග්ගරසිඛිං පච්චෙකසම්බුද්ධං - මඡසං.} පච්චෙකසම්බුද්ධං{3 පච්චෙක බුද්ධං - සී. PTS.} පිණ්ඩපාතෙන පටිපාදෙසි, “දෙථ සමණස්ස පිණ්ඩන්ති” වත්වා උට්ඨායාසනා පක්කාමි. දත්වා ච පන පච්ඡා විප්පටිසාරී අහොසි: “වරමෙතං පිණ්ඩපාතං දාසා වා කම්මකරා වා භුඤ්ජෙය්යුන්ති.” භාතුච්ච පන එකපුත්තකං සාපතෙය්යස්ස කාරණා ජීවිතා වොරොපෙසි."
            },
            {
                "type": "paragraph",
                "text": "යං ඛො සො මහාරාජ සෙට්ඨි ගහපති තගරසිඛිං{4 තග්ගරසිඛිං පච්චෙකසම්බුද්ධං - මඡසං.} පච්චෙකසම්බුද්ධං{5 පච්චෙක බුද්ධං - සී. PTS.} පිණ්ඩපාතෙන පටිපාදෙසි, තස්ස කම්මස්ස විපාකෙන සත්තක්ඛත්තුං සුගතිං සග්ගං ලොකං උපපජ්ජි, තස්සෙව කම්මස්ස විපාකාවසෙසෙන ඉමිස්සායෙව සාවත්ථියා සත්තක්ඛත්තුං සෙට්ඨිත්තං කාරෙසි."
            },
            {
                "type": "paragraph",
                "text": "යං ඛො සො මහාරාජ සෙට්ඨි ගහපති දත්වා පච්ඡා විප්පටිසාරී අහොසි: “වරමෙතං පිණ්ඩපාතං දාසා වා කම්මකරා වා භුඤ්ජෙය්යුන්ති,” තස්ස කම්මස්ස විපාකෙන නාස්සුළාරාය භත්තභොගාය චිත්තං නමති. නාස්සුළාරාය වත්ථභොගාය චිත්තං නමති. නාස්සුළාරාය යානභොගාය චිත්තං නමති. නාස්සුළාරානං පඤ්චන්නං කාමගුණානං භොගාය චිත්තං නමති."
            },
            {
                "type": "page-break",
                "text": "170"
            },
            {
                "type": "paragraph",
                "text": "යං ඛො සො මහාරාජ සෙට්ඨි ගහපති භාතුච්ච පන එකපුත්තකං සාපතෙය්යස්ස කාරණා ජීවිතා වොරොපෙසි. තස්ස කම්මස්ස විපාකෙන බහූනි වස්සානි බහූනි වස්සසතානි බහූනි වස්සසහස්සානි බහූනි වස්සසතසහස්සානි නිරයෙ පච්චිත්ථ. තස්සෙව කම්මස්ස විපාකාවසෙසෙන ඉදං සත්තමං අපුත්තකං සාපතෙය්යං රාජකොසං පවෙසෙති. තස්ස ඛො පන මහාරාජ සෙට්ඨිස්ස ගහපතිස්ස පුරාණඤ්ච පුඤ්ඤං පරික්ඛීණං, නවඤ්ච පුඤ්ඤං අනුපචිතං. අජ්ජ පන මහාරාජ සෙට්ඨි ගහපති මහාරොරුවනිරයෙ{1 මහාරොරුවෙ - මඡසං.} පච්චතීති. එවං භන්තෙ සෙට්ඨි ගහපති මහාරොරුවං නිරයං උපපන්නොති? එවං මහාරාජ සෙට්ඨි ගහපති මහාරොරුවං නිරයං උපපන්නොති."
            },
            {
                "type": "gatha",
                "text": "ධඤ්ඤං ධනං රජතං ජාතරූපං පරිග්ගහං වාපි{2 චාපි - සීමු.} යදත්ථි කිඤ්චි,\nදාසා කම්මකරා පෙස්සා යෙ චස්ස අනුජීවිනො,\nසබ්බං නාදාය ගන්තබ්බං සබ්බං නික්ඛිප්පගාමිනං{3 නික්ඛීපගාමිනං - ස්යා.}"
            },
            {
                "type": "gatha",
                "text": "යඤ්ච කරොති කායෙන වාචාය උද චෙතසා,\nතං හි තස්ස සකං හොති තඤ්ච ආදාය ගච්ඡති,\nතඤ්චස්ස අනුගං හොති ඡායාව අනපායිනී."
            },
            {
                "type": "gatha",
                "text": "තස්මා කරෙය්ය කල්යාණං නිචයං සම්පරායිකං,\nපුඤ්ඤානි පරලොකස්මිං පතිට්ඨා හොන්ති පාණිනන්ති."
            },
            {
                "type": "centered",
                "text": "අපුත්තකවග්ගො දුතියො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:-**"
            },
            {
                "type": "gatha",
                "text": "ජටිලා පඤ්ච රාජානො දොණපාකසඞ්ගාමා ද්වෙ ති ච,\nධීතරා ද්වෙ අප්පමාදා ද්වෙ අපුත්තකෙන චාති{4 ජටිලා පඤ්ච රාජානො දොණපාකකුරෙන ච සඞ්ගාමෙන ද්වෙ වුත්තානි මල්ලිකා ද්වෙ අප්පමාදෙන ච අපුත්තකෙන ද්වෙ වුත්තා වග්ගො තෙන පවුච්චති. - මඡසං.}."
            },
            {
                "type": "heading",
                "text": "3. කොසලවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "3. 3. 1.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "පුග්ගලසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "132. **සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො රාජා පසෙනදි කොසලො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො රාජානං පසෙනදිකොසලං භගවා එතදවොච: චත්තාරො මෙ මහාරාජ පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං. කතමෙ චත්තාරො? තමොතමපරායණො{5 පරායනො - සබ්බත්ථ.} තමොජොතිපරායණො ජොතිතමපරායණො ජොතිජොතිපරායණොති."
            },
            {
                "type": "page-break",
                "text": "172"
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච මහාරාජ, පුග්ගලො තමොතමපරායණො හොති? ඉධ මහාරාජ එකච්චො පුග්ගලො නීචෙ කුලෙ පච්චාජාතො හොති චණ්ඩාලකුලෙ වා වෙණකුලෙ වා නෙසාදකුලෙ වා රථකාරකුලෙ වා පුක්කුසකුලෙ වා දළිද්දෙ අප්පන්නපානභොජනෙ කසිරවුත්තිකෙ යත්ථ කසිරෙන ඝාසච්ඡාදො ලබ්භති. සො ච හොති දුබ්බණ්ණො දුද්දසිකො ඔකොටිමකො බව්හාබාධො, කාණො වා හොති කුණී වා ඛඤ්ජො වා පක්ඛහතො වා න ලාභී අන්නස්ස පානස්ස වත්ථස්ස යානස්ස මාලාගන්ධවිලෙපනස්ස සෙය්යාවසථපදීපෙය්යස්ස. සො කායෙන දුච්චරිතං චරති. වාචාය දුච්චරිතං චරති. මනසා දුච්චරිතං චරති. සො කායෙන දුච්චරිතං චරිත්වා වාචාය දුච්චරිතං චරිත්වා මනසා දුච්චරිතං චරිත්වා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජති."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි මහාරාජ පුරිසො අන්ධකාරා වා අන්ධකාරං ගච්ඡෙය්ය, තමා වා තමං ගච්ඡෙය්ය, ලොහිතමලා වා ලොහිතමලං ගච්ඡෙය්ය. තථූපමාහං මහාරාජ ඉමං පුග්ගලං වදාමි. එවං ඛො මහාරාජ පුග්ගලො තමොතමපරායණො හොති."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච මහාරාජ, පුග්ගලො තමොජොතිපරායණො හොති? ඉධ මහාරාජ එකච්චො පුග්ගලො නීචෙ කුලෙ පච්චාජාතො හොති, චණ්ඩාලකුලෙ වා වෙණකුලෙ{1 වෙනකුලෙ - මඡසං. PTS.} වා නෙසාදකුලෙ වා රථකාරකුලෙ වා පුක්කුසකුලෙ වා දළිද්දෙ අප්පන්නපානභොජනෙ කසිරවුත්තිකෙ යත්ථ කසිරෙන ඝාසච්ඡාදො ලබ්භති. සො ච හොති දුබ්බණ්ණො දුද්දසිකො ඔකොටිමකො බව්හාබාධො{2 බහ්වාබාධො - මඡසං.} කාණො වා කුණී වා ඛඤ්ජො වා පක්ඛහතො වා න ලාභී අන්නස්ස පානස්ස වත්ථස්ස යානස්ස මාලාගන්ධවිලෙපනස්ස සෙය්යාවසථපදීපෙය්යස්ස. සො කායෙන සුචරිතං චරති. වාචාය සුචරිතං චරති. මනසා සුචරිතං චරති. සො කායෙන සුචරිතං චරිත්වා වාචාය සුචරිතං චරිත්වා මනසා සුචරිතං චරිත්වා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි මහාරාජ පුරිසො පඨවියා වා පල්ලඞ්කං ආරොහෙය්ය පල්ලඞ්කා වා අස්සපිට්ඨිං ආරොහෙය්ය අස්සපිට්ඨියා වා හත්ථික්ඛන්ධං ආරොහෙය්ය හත්ථික්ඛන්ධා වා පාසාදං ආරොහෙය්ය. තථූපමාහං මහාරාජ ඉමං පුග්ගලං වදාමි. එවං ඛො මහාරාජ පුග්ගලො තමොජොතිපරායණො හොති."
            },
            {
                "type": "page-break",
                "text": "174"
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච මහාරාජ, පුග්ගලො ජොතිතමපරායණො හොති? ඉධ මහාරාජ එකච්චො පුග්ගලො උච්චෙ කුලෙ පච්චාජාතො හොති ඛත්තියමහාසාලකුලෙ වා බ්රාහ්මණමහාසාලකුලෙ වා ගහපතිමහාසාලකුලෙ වා අඩ්ඪෙ මහද්ධනෙ මහාභොගෙ පහූතජාතරූපරජතෙ පහූතවිත්තූපකරණෙ පහූතධනධඤ්ඤෙ. සො ච හොති අභිරූපො දස්සනීයො පාසාදිකො පරමාය වණ්ණපොක්ඛරතාය සමන්නාගතො ලාභී අන්නස්ස පානස්ස වත්ථස්ස යානස්ස මාලාගන්ධවිලෙපනස්ස සෙය්යාවසථපදීපෙය්යස්ස. සො කායෙන දුච්චරිතං චරති. වාචාය දුච්චරිතං චරති. මනසා දුච්චරිතං චරති. කායෙන දුච්චරිතං චරිත්වා වාචාය දුච්චරිතං චරිත්වා මනසා දුච්චරිතං චරිත්වා කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජති. සෙය්යථාපි මහාරාජ පුරිසො පාසාදා වා හත්ථික්ඛන්ධං ඔරොහෙය්ය, හත්ථික්ඛන්ධා වා අස්සපිට්ඨිං ඔරොහෙය්ය, අස්සපිට්ඨියා වා පල්ලඞ්කං ඔරොහෙය්ය, පල්ලඞ්කා වා පඨවිං ඔරොහෙය්ය, පඨවියා වා අන්ධකාරං පවිසෙය්ය{1 ඔරොහෙය්ය - සීමු. PTS.}, තථූපමාහං මහාරාජ, ඉමං පුග්ගලං වදාමි. එවං ඛො මහාරාජ පුග්ගලො ජොතිතමපරායණො හොති."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච මහාරාජ, පුග්ගලො ජොතිජොතිපරායණො හොති? ඉධ මහාරාජ එකච්චො පුග්ගලො උච්චෙ කුලෙ පච්චාජාතො හොති ඛත්තියමහාසාලකුලෙ වා බ්රාහ්මණමහාසාලකුලෙ වා ගහපතිමහාසාලකුලෙ වා අඩ්ඪෙ මහද්ධනෙ මහාභොගෙ පහූතජාතරූපරජතෙ පහූතවිත්තූපකරණෙ පහූතධනධඤ්ඤෙ. සො ච හොති අභිරූපො දස්සනීයො පාසාදිකො පරමාය වණ්ණපොක්ඛරතාය සමන්නාගතො ලාභී අන්නස්ස පානස්ස වත්ථස්ස යානස්ස මාලාගන්ධවිලෙපනස්ස සෙය්යාවසථපදීපෙය්යස්ස. සො කායෙන සුචරිතං චරති. වාචාය සුචරිතං චරති. මනසා සුචරිතං චරති. සො කායෙන සුචරිතං චරිත්වා වාචාය සුචරිතං චරිත්වා මනසා සුචරිතං චරිත්වා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති. සෙය්යථාපි මහාරාජ පුරිසො පල්ලඞ්කා වා පල්ලඞ්කං සඞ්කමෙය්ය, අස්සපිට්ඨියා වා අස්සපිට්ඨිං සඞ්කමෙය්ය, හත්ථික්ඛන්ධා වා හත්ථික්ඛන්ධං සඞ්කමෙය්ය පාසාදා වා පාසාදං සඞ්කමෙය්ය. තථූපමාහං මහාරාජ ඉමං පුග්ගලං වදාමි. එවං ඛො මහාරාජ පුග්ගලො ජොතිජොතිපරායණො හොති."
            },
            {
                "type": "paragraph",
                "text": "ඉමෙ ඛො මහාරාජ චත්තාරො පුග්ගලා සන්තො සංවිජ්ජමානා ලොකස්මිං."
            },
            {
                "type": "gatha",
                "text": "දළිද්දො{2 දලිද්දො - මඡසං. PTS.} පුරිසො රාජ අස්සද්ධො හොති මච්ඡරී,\nකදරියො පාපසඞ්කප්පො මිච්ඡාදිට්ඨි අනාදරො."
            },
            {
                "type": "gatha",
                "text": "සමණෙ බ්රාහ්මණෙ වාපි අඤ්ඤෙ වාපි වණිබ්බකෙ{3 වනිබ්බකෙ - මඡසං.},\nඅක්කොසති පරිභාසති නත්ථිකො හොති රොසකො,\nදදමානං නිවාරෙති යාචමානාන භොජනං."
            },
            {
                "type": "gatha",
                "text": "තාදිසො පුරිසො රාජ මීයමානො ජනාධිප,\nඋපෙති නිරයං ඝොරං තමොතමපරායණො."
            },
            {
                "type": "gatha",
                "text": "දළිද්දො පුරිසො රාජ සද්ධො හොති අමච්ඡරී,\nදදාති සෙට්ඨසඞ්කප්පො අබ්යග්ගමනසො{4 අව්යග්ගමනසො - සී 2. ආ.} නරො."
            },
            {
                "type": "page-break",
                "text": "176"
            },
            {
                "type": "gatha",
                "text": "සමණෙ බ්රාහ්මණෙ වාපි අඤ්ඤෙ වාපි වණිබ්බකෙ,\nඋට්ඨාය අභිවාදෙති සමචරියාය සික්ඛති,\nදදමානං න වාරෙති{1 නිවාරෙති - සීමු 1.} යාචමානාන භොජනං."
            },
            {
                "type": "gatha",
                "text": "තාදිසො පුරිසො රාජ මීයමානො{2 මිය්යමාන - ස්යා. සීමු1. PTS.} ජනාධිප,\nඋපෙති තිදිවං ඨානං තමොජොතිපරායණො."
            },
            {
                "type": "gatha",
                "text": "අඩ්ඪො චෙ පුරිසො රාජ අස්සද්ධො හොති මච්ඡරී,\nකදරියො පාපසඞ්කප්පො මිච්ඡාදිට්ඨි අනාදරො."
            },
            {
                "type": "gatha",
                "text": "සමණෙ බ්රාහ්මණෙ වාපි අඤ්ඤෙ වාපි වණිබ්බකෙ,\nඅක්කොසති පරිභාසති නත්ථිකො හොති රොසකො,\nදදමානං නිවාරෙති යාචමානාන භොජනං."
            },
            {
                "type": "gatha",
                "text": "තාදිසො පුරිසො රාජ මීයමානො ජනාධිප,\nඋපෙති නිරයං ඝොරං ජොතිතමපරායණො."
            },
            {
                "type": "gatha",
                "text": "අඩ්ඪො චෙ පුරිසො රාජ සද්ධො හොති අමච්ඡරී,\nදදාති සෙට්ඨසඞ්කප්පො අබ්යග්ගමනසො නරො."
            },
            {
                "type": "gatha",
                "text": "සමණෙ බ්රාහ්මණෙ වාපි අඤ්ඤෙ වාපි වණිබ්බකෙ,\nඋට්ඨාය අභිවාදෙති සමචරියාය සික්ඛති,\nදදමානං න වාරෙති යාචමානාන භොජනං."
            },
            {
                "type": "gatha",
                "text": "තාදිසො පුරිසො රාජ මීයමානො ජනාධිප,\nඋපෙති තිදිවං ඨානං ජොතිජොතිපරායණොති."
            },
            {
                "type": "centered",
                "text": "3. 3. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අය්යකාසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "133. **සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො රාජා පසෙනදි කොසලො දිවාදිවස්ස යෙන භගවා තෙනුපසඞ්කමි, උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො රාජානං පසෙනදිං කොසලං භගවා එතදවොච: හන්ද කුතො නු ත්වං මහාරාජ, ආගච්ඡසි දිවාදිවස්සාති?"
            },
            {
                "type": "page-break",
                "text": "178"
            },
            {
                "type": "paragraph",
                "text": "අය්යකා මෙ භන්තෙ, කාලකතා{1 කාලඞ්කතා - මඡසං. ස්යා. PTS.} ජිණ්ණා වුද්ධා{2 වුඩ්ඪා - මඡසං. ස්යා.} මහල්ලිකා අද්ධගතා වයොඅනුප්පත්තා වීසංවස්සසතිකා ජාතියා. අය්යකා ඛො පන මෙ භන්තෙ, පියා අහොසි{3 පියා හොති - මඡසං.} මනාපා. හත්ථිරතනෙන චෙපහං{4 වෙපාහං - සී2. මඡසං. PTS.} භන්තෙ, ලභෙය්යං මා මෙ අය්යකා කාලමකාසීති, හත්ථිරතනම්ප{5 හත්ථිරතනං පහං - මඡසං. PTS.}හං දදෙය්යං මා මෙ අය්යකා කාලමකාසීති. අස්සරතනෙන චෙපහං භන්තෙ, ලභෙය්යං, මා මෙ අය්යකා කාලමකාසීති, අස්සරතනම්පහං දදෙය්යං මා මෙ අය්යකා කාලමකාසීති. ගාමවරෙන චෙපහං භන්තෙ, ලභෙය්යං, මා මෙ අය්යකා කාලමකාසීති, ගාමවරම්පහං දදෙය්යං මා මෙ අය්යකා කාලමකාසීති. ජනපදෙන{6 ජනපදපදෙසෙන - මඡසං.} චෙපහං භන්තෙ, ලභෙය්යං මා මෙ අය්යකා කාලමකාසීති, ජනපදම්පහං දදෙය්යං මා මෙ අය්යකා කාලමකාසීති."
            },
            {
                "type": "paragraph",
                "text": "සබ්බෙ සත්තා මහාරාජ, මරණධම්මා මරණපරියොසානා මරණං අනතීතාති."
            },
            {
                "type": "paragraph",
                "text": "අච්ඡරියං භන්තෙ අබ්භුතං භන්තෙ, යාව සුභාසිතමිදං භන්තෙ, භගවතා සබ්බෙ සත්තා මරණධම්මා මරණපරියොසානා මරණං අනතීතාති."
            },
            {
                "type": "paragraph",
                "text": "එවමෙතං මහාරාජ, එවමෙතං මහාරාජ, සබ්බෙ සත්තා මරණධම්මා මරණපරියොසානා මරණං අනතීතාති. සෙය්යථාපි මහාරාජ, යානි කානි චි කුම්භකාරභාජනානි{7 කුම්භකාරකභාජනානි - සීමු. 2. PTS.} ආමකානි චෙව පක්කානි ච සබ්බානි තානි භෙදනධම්මානි භෙදනපරියොසානානි භෙදනං අනතීතානි. එවමෙව ඛො මහාරාජ, සබ්බෙ සත්තා මරණධම්මා මරණපරියොසානා මරණං අනතීතාති."
            },
            {
                "type": "gatha",
                "text": "සබ්බෙ සත්තා මරිස්සන්ති මරණන්තං හි ජීවිතං,\nයථාකම්මං ගමිස්සන්ති පුඤ්ඤපාපඵලූපගා,\nනිරයං පාපකම්මන්තා පුඤ්ඤකම්මා ච සුග්ගතිං.{8 සුගතිං - ස්යා.}"
            },
            {
                "type": "gatha",
                "text": "තස්මා කරෙය්ය කල්යාණං නිචයං සම්පරායිකං,\nපුඤ්ඤානි පරලොකස්මිං පතිට්ඨා හොන්ති පාණිනන්ති."
            },
            {
                "type": "centered",
                "text": "3. 3. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ලොකසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "134. **සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො රාජා පසෙනදි කොසලො භගවන්තං එතදවොච: කති නු ඛො භන්තෙ ලොකස්ස ධම්මා උප්පජ්ජමානා උප්පජ්ජන්ති අහිතාය දුක්ඛාය අඵාසුවිහාරායාති?"
            },
            {
                "type": "page-break",
                "text": "180"
            },
            {
                "type": "paragraph",
                "text": "තයො ඛො මහාරාජ ලොකස්ස ධම්මා උප්පජ්ජමානා උප්පජ්ජන්ති අහිතාය දුක්ඛාය අඵාසුවිහාරාය. කතමෙ තයො? ලොභො ඛො මහාරාජ ලොකස්ස ධම්මො උප්පජ්ජමානො උප්පජ්ජති අහිතාය දුක්ඛාය අඵාසුවිහාරාය. දොසො ඛො මහාරාජ ලොකස්ස ධම්මො උප්පජ්ජමානො උප්පජ්ජති අහිතාය දුක්ඛාය අඵාසුවිහාරාය. මොහො ඛො මහාරාජ ලොකස්ස ධම්මො උප්පජ්ජමානො උප්පජ්ජති අහිතාය දුක්ඛාය අඵාසුවිහාරාය. ඉමෙ ඛො මහාරාජ තයො ලොකස්ස ධම්මා උප්පජ්ජමානා උප්පජ්ජන්ති අහිතාය දුක්ඛාය අඵාසුවිහාරායාති."
            },
            {
                "type": "gatha",
                "text": "ලොභො දොසො ච මොහො ච පුරිසං පාපචෙතසා\nහිංසන්ති අත්තසම්භූතා තචසාරං ව සම්ඵලන්ති{1 සප්ඵලං - ස්යා.}."
            },
            {
                "type": "centered",
                "text": "3. 3. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඉස්සත්ථසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "135.** සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො රාජා පසෙනදි කොසලො භගවන්තං එතදවොච: කත්ථ නු ඛො භන්තෙ දානං දාතබ්බන්ති? යත්ථ ඛො මහාරාජ, චිත්තං පසීදතීති. කත්ථ පන භන්තෙ දින්නං මහප්ඵලන්ති. අඤ්ඤං ඛො එතං මහාරාජ කත්ථ දානං දාතබ්බං. අඤ්ඤං පනෙතං කත්ථ දින්නං මහප්ඵලන්ති. සීලවතො ඛො මහාරාජ දින්නං මහප්ඵලං නො තථා දුස්සීලෙ. තෙන හි මහාරාජ තඤ්ඤෙවෙත්ථ පටිපුච්ඡිස්සාමි. යථා තෙ ඛමෙය්ය තථා නං බ්යාකරෙය්යාසි."
            },
            {
                "type": "paragraph",
                "text": "තං කිම්මඤ්ඤසි මහාරාජ, ඉධ ත්යාස්ස යුද්ධං පච්චුපට්ඨිතං සඞ්ගාමො සමුපබ්බුළ්හො{2 සමුපවෙපූළ්හො - ස්යා.}, අථ ආගච්ඡෙය්ය ඛත්තියකුමාරො අසික්ඛිතො අකතහත්ථො අකතයොග්ගො අකතූපාසනො{3 අකතුපාසනො - සීමු 2. ස්යා. PTS.} භීරුඡම්භී උත්රාසී පලායී. භරෙය්යාසි තං පුරිසං? අත්ථො ච තෙ තාදිසෙන පුරිසෙනාති. නාහං භන්තෙ භරෙය්යං තං පුරිසං. න ච මෙ අත්ථො තාදිසෙන පුරිසෙනාති."
            },
            {
                "type": "paragraph",
                "text": "අථ ආගච්ඡෙය්ය බ්රාහ්මණකුමාරො අසික්ඛිතො -පෙ- අථ ආගච්ඡෙය්ය වෙස්සකුමාරො අසික්ඛිතො -පෙ- අථ ආගච්ඡෙය්ය සුද්දකුමාරො අසික්ඛිතො -පෙ- භරෙය්යාසි තං පුරිසං? අත්ථො ච ඛො තෙ තාදිසෙන පුරිසෙනාති? නාහං භන්තෙ භරෙය්යං තං පුරිසං. න ච මෙ අත්ථො තාදිසෙන පුරිසෙනාති."
            },
            {
                "type": "page-break",
                "text": "182"
            },
            {
                "type": "paragraph",
                "text": "තං කිම්මඤ්ඤසි මහාරාජ, ඉධ ත්යාස්ස යුද්ධං පච්චුපට්ඨිතං සඞ්ගාමො සමුපබ්බූළ්හො{1 සමුප්යබ්යුළ්හො - ස්යා.}. අථ ආගච්ඡෙය්ය ඛත්තියකුමාරො සුසික්ඛිතො{2 සික්ඛිතො - සීමු2.}. කතහත්ථො කතයොග්ගො කතූපාසනො අභීරු අච්ඡම්භී අනුත්රාසී අපලායී. භරෙය්යාසි තං පුරිසං? අත්ථො ච තෙ තාදිසෙන පුරිසෙනාති? භරෙය්යාහං භන්තෙ තං පුරිසං අත්ථො ච මෙ තාදිසෙන පුරිසෙනාති."
            },
            {
                "type": "paragraph",
                "text": "අථ ආගච්ඡෙය්ය බ්රාහ්මණකුමාරො සුසික්ඛිතො{3 සික්ඛිතො - සීමු2.} -පෙ- වෙස්සකුමාරො සුසික්ඛිතො{4 සික්ඛිතො - සීමු2.} -පෙ- සුද්දකුමාරො සුසික්ඛිතො කතහත්ථො කතයොග්ගො කතූපාසනො අභීරු අච්ඡම්භී අනුත්රාසී අපලායී. භරෙය්යාසි තං පුරිසං? අත්ථො ච තෙ තාදිසෙන පුරිසෙනාති? භරෙය්යාහං භන්තෙ තං පුරිසං, අත්ථො ච මෙ තාදිසෙන පුරිසෙනාති."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො මහාරාජ, යස්මා කස්මා{5 යස්මා චෙ පි - සීමු. ස්යා.} චෙපි කුලා අගාරස්මා අනගාරියං පබ්බජිතො හොති: සො ච හොති පඤ්චඞ්ගවිප්පහීනො පඤ්චඞ්ගසමන්නාගතො, තස්මිං දින්නෙ මහප්ඵලං හොති{6 මහප්ඵලං - සීමු.}."
            },
            {
                "type": "paragraph",
                "text": "කතමානි පඤ්ච අඞ්ගානි පහීනානි{7 විප්පහීනාති - සීමු.} හොන්ති? කාමච්ඡන්දො පහීනො හොති, බ්යාපාදො පහීනො හොති, ථිනමිද්ධං පහීනං හොති, උද්ධච්චකුක්කුච්චං පහීනං හොති, විචිකිච්ඡා පහීනා හොති. ඉමානි පඤ්ච අඞ්ගානි පහීනානි හොන්ති."
            },
            {
                "type": "paragraph",
                "text": "කතමෙහි පඤ්චහඞ්ගෙහි සමන්නාගතො හොති? අසෙඛෙන{8 අසෙක්ඛෙන - මඡසං. ස්යා. PTS.} සීලක්ඛන්ධෙන සමන්නාගතො හොති, අසෙඛෙන{9 අසෙක්ඛෙන - මඡසං. ස්යා. PTS.} සමාධික්ඛන්ධෙන සමන්නාගතො හොති, අසෙඛෙන{10 අසෙක්ඛෙන - මඡසං. ස්යා. PTS.} පඤ්ඤාක්ඛන්ධෙන සමන්නාගතො හොති, අසෙඛෙන{11 අසෙක්ඛෙන - මඡසං. ස්යා. PTS.} විමුත්තික්ඛන්ධෙන සමන්නාගතො හොති, අසෙඛෙන{12 අසෙක්ඛෙන - මඡසං. ස්යා. PTS.} විමුත්තිඤාණදස්සනක්ඛන්ධෙන සමන්නාගතො හොති. ඉමෙහි පඤ්චහඞ්ගෙහි සමන්නාගතො හොති."
            },
            {
                "type": "paragraph",
                "text": "ඉති පඤ්චඞ්ගවිප්පහීනෙ පඤ්චඞ්ගසමන්නාගතෙ දින්නං මහප්ඵලන්ති."
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච භගවා ඉදං වත්වා සුගතො අථාපරං එතදවොච සත්ථා:"
            },
            {
                "type": "gatha",
                "text": "ඉස්සත්ථං{13 ඉස්සත්තං - මඡසං. PTS.} බලවිරියඤ්ච යස්මිං විජ්ජෙථ මාණවෙ,\nතං යුද්ධත්ථො භරෙ රාජා නාසූරං ජාතිපච්චයා."
            },
            {
                "type": "gatha",
                "text": "තථෙව ඛන්ති සොරච්චං ධම්මා යස්මිං පතිට්ඨිතා,\nතමරියවුත්තිං{14 අරියවුන්තිං - මඡසං.} මෙධාවිං හීනජච්චම්පි පූජයෙ."
            },
            {
                "type": "gatha",
                "text": "කාරයෙ අස්සමෙ රම්මෙ වාසයෙත්ථ බහුස්සුතෙ,\nපපඤ්ච විවනෙ කයිරා දුග්ගෙ සඞ්කමනානි ච."
            },
            {
                "type": "gatha",
                "text": "අන්නං පානං ඛාදනීයං වත්ථසෙනාසනානි ච,\nදදෙය්ය උජුභූතෙසු විප්පසන්නෙන චෙතසා."
            },
            {
                "type": "page-break",
                "text": "184"
            },
            {
                "type": "gatha",
                "text": "යථා හි මෙඝො ථනයං විජ්ජුමාලී සතක්කකු{1 සතක්කතු - PTS.},\nථලං නින්නඤ්ච පූරෙති අභිවස්සං වසුන්ධරං."
            },
            {
                "type": "gatha",
                "text": "තථෙව සද්ධො සුතවා{2 සුත්වා - ස්යා.} අභිසඞ්ඛච්ච භොජනං,\nවණිබ්බකෙ තප්පයති අන්නපානෙන පණ්ඩිතො.\nආමොදමානො{3 අනුමොදමානො - ස්යා.} පකිරෙති දෙථ දෙථාති භාසති."
            },
            {
                "type": "gatha",
                "text": "තං හිස්ස ගජ්ජිතං හොති දෙවස්සෙව පවස්සතො,\nසා පුඤ්ඤධාරා විපුලා දාතාරං අභිවස්සතීති."
            },
            {
                "type": "centered",
                "text": "3. 3. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පබ්බතූපමසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "136. **සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නං ඛො රාජානං පසෙනදිං කොසලං භගවා එතදවොච: හන්ද කුතො නු ත්වං මහාරාජ ආගච්ඡසි දිවා දිවස්සාති?"
            },
            {
                "type": "paragraph",
                "text": "යානි තානි භන්තෙ රඤ්ඤං ඛත්තියානං මුද්ධාවසිත්තානං ඉස්සරියමදමත්තානං කාමගෙධපරියුට්ඨිතානං ජනපදත්ථාවරියප්පත්තානං මහන්තං පඨවිමණ්ඩලං අභිවිජිය අජ්ඣාවසන්තානං රාජකරණීයානි සන්ති{4 භවන්ති - ස්යා. මඡසං.}, තෙස්වාහං{5 තෙසුබ්බාහං - මඡසං.} එතරහි උස්සුක්කං ආපන්නොති."
            },
            {
                "type": "paragraph",
                "text": "තං කිම්මඤ්ඤසි මහාරාජ, ඉධ තෙ පුරිසො ආගච්ඡෙය්ය පුරත්ථිමාය දිසාය සද්ධායිකො පච්චයිකො. සො තං උපසඞ්කමිත්වා එවං වදෙය්ය: යග්ඝෙ මහාරාජ ජානෙය්යාසි: අහං ආගච්ඡාමි පුරත්ථිමාය දිසාය. තත්ථද්දසං මහන්තං පබ්බතං අබ්භසමං. සබ්බෙ පාණෙ නිප්පොඨෙන්තො{6 නිප්පොඨෙන්තො - මඡසං. ස්යා.} ආගච්ඡති. යං තෙ මහාරාජ කරණීයං තං කරොහීති. අථ දුතියො පුරිසො ආගච්ඡෙය්ය දක්ඛිණාය දිසාය -පෙ- අථ තතියො පුරිසො ආගච්ඡෙය්ය පච්ඡිමාය දිසාය -පෙ- අථ චතුත්ථො පුරිසො ආගච්ඡෙය්ය උත්තරාය දිසාය සද්ධායිකො පච්චයිකො. සො තං උපසඞ්කමිත්වා එවං වදෙය්ය: යග්ඝෙ මහාරාජ ජානෙය්යාසි: අහං ආගච්ඡාමි උත්තරාය දිසාය. තත්ථද්දසං මහන්තං පබ්බතං අබ්භසමං. සබ්බෙ පාණෙ නිප්පොඨෙන්තො{7 නිප්පොඨෙන්තො - මඡසං. ස්යා.} ආගච්ඡති. යං තෙ මහාරාජ කරණීයං තං කරොහීති. එවරූපෙ තෙ මහාරාජ මහති මහබ්භයෙ සමුප්පන්නෙ දාරුණෙ මනුස්සක්ඛයෙ දුල්ලභෙ මනුස්සත්තෙ කිමස්ස කරණීයන්ති?"
            },
            {
                "type": "paragraph",
                "text": "එවරූපෙ මෙ භන්තෙ මහති මහබ්භයෙ සමුප්පන්නෙ දාරුණෙ මනුස්සක්ඛයෙ දුල්ලභෙ මනුස්සත්තෙ කිමස්ස කරණීයං අඤ්ඤත්ර ධම්මචරියාය සමචරියාය කුසලකිරියාය පුඤ්ඤකිරියායාති{8 අඤ්ඤත්ර සමචරියාය අඤ්ඤත්ර කුසලකිරියාය අඤ්ඤත්ර පුඤ්ඤකිරියායාති - මඡසං. ස්යා.}."
            },
            {
                "type": "paragraph",
                "text": "ආරොචෙමි ඛො තෙ මහාරාජ, පතිවෙදයාමි{9 පටිවෙදෙමි - මඡසං. ස්යා. PTS. සී 1. 2.} ඛො තෙ මහාරාජ, අධිවත්තති ඛො තං මහාරාජ ජරාමරණං. අධිවත්තමානෙ ච තෙ මහාරාජ, ජරාමරණෙ කිමස්ස කරණීයන්ති?"
            },
            {
                "type": "page-break",
                "text": "186"
            },
            {
                "type": "paragraph",
                "text": "අධිවත්තමානෙ ච මෙ භන්තෙ ජරාමරණෙ කිමස්ස කරණීයං අඤ්ඤත්ර ධම්මචරියාය සමචරියාය කුසලකිරියාය පුඤ්ඤකිරියාය."
            },
            {
                "type": "paragraph",
                "text": "යානි තානි භන්තෙ රඤ්ඤං ඛත්තියානං මුද්ධාවසිත්තානං ඉස්සරියමදමත්තානං කාමගෙධපරියුට්ඨිතානං ජනපදත්ථාවරියප්පත්තානං මහන්තං පඨවිමණ්ඩලං අභිවිජිය අජ්ඣාවසන්තානං හත්ථියුද්ධානි භවන්ති. තෙසම්පි භන්තෙ හත්ථියුද්ධානං නත්ථි ගති නත්ථි විසයො අධිවත්තමානෙ ජරාමරණෙ."
            },
            {
                "type": "paragraph",
                "text": "යානිපි තානි භන්තෙ රඤ්ඤං ඛත්තියානං මුද්ධාවසිත්තානං -පෙ- අස්සයුද්ධානි භවන්ති -පෙ- රථයුද්ධානි භවන්ති -පෙ- පත්තියුද්ධානි භවන්ති. තෙසම්පි භන්තෙ පත්තියුද්ධානං නත්ථි ගති නත්ථි විසයො අධිවත්තමානෙ ජරාමරණෙ."
            },
            {
                "type": "paragraph",
                "text": "සංවිජ්ජති ඛො පන භන්තෙ ඉමස්මිං රාජකුලෙ මන්තිනො මහාමත්තා යෙ පහොන්ති ආගතෙ පච්චත්ථිකෙ මන්තෙහි භෙදයිතුං. තෙසම්පි භන්තෙ මන්තයුද්ධානං නත්ථි ගති නත්ථි විසයො අධිවත්තමානෙ ජරාමරණෙ."
            },
            {
                "type": "paragraph",
                "text": "සංවිජ්ජති ඛො පන භන්තෙ ඉමස්මිං රාජකුලෙ පහූතං හිරඤ්ඤසුවණ්ණං භූමිගතඤ්චෙව වෙහාසට්ඨඤ්ච. යෙන මයං පහොම ආගතෙ පච්චත්ථිකෙ ධනෙන උපලාපෙතුං. තෙසම්පි භන්තෙ ධනයුද්ධානං නත්ථි ගති නත්ථි විසයො අධිවත්තමානෙ ජරාමරණෙ."
            },
            {
                "type": "paragraph",
                "text": "අධිවත්තමානෙ ච මෙ භන්තෙ ජරාමරණෙ කිමස්ස කරණීයං අඤ්ඤත්ර ධම්මචරියාය සමචරියාය කුසලකිරියාය පුඤ්ඤකිරියායාති."
            },
            {
                "type": "paragraph",
                "text": "එවමෙතං මහාරාජ, එවමෙතං මහාරාජ, අධිවත්තමානෙ ච තෙ ජරාමරණෙ කිමස්ස කරණීයං අඤ්ඤත්ර ධම්මචරියාය සමචරියාය කුසලකිරියාය පුඤ්ඤකිරියායාති."
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච භගවා. ඉදං වත්වා සුගතො අථාපරං එතදවොච සත්ථා:"
            },
            {
                "type": "gatha",
                "text": "යථාපි සෙලා විපුලා නභං ආහච්ච පබ්බතා,\nසමන්තා අනුපරියෙය්යුං{1 සමන්තානුපරියාපෙය්යුං - මඡසං.} නිප්පොඨෙන්තො{2 නිප්පොථෙන්තො - මඡසං.} චතුද්දිසා."
            },
            {
                "type": "gatha",
                "text": "එවං ජරා ච මච්චු{3 මරණං - සී 1.} ච අධිවත්තන්ති පාණිනො{4 පාණිනෙ - මඡසං.},\nඛත්තියෙ බ්රාහ්මණෙ වෙස්සෙ සුද්දෙ චණ්ඩාලපුක්කුසෙ,\nන කිඤ්චි පරිවජ්ජෙති සබ්බමෙවාභිමද්දති."
            },
            {
                "type": "gatha",
                "text": "න තත්ථ හත්ථීනං{5 හත්ථීනං - මඡසං. ස්යා. PTS.} භූමි න රථානං න පත්තියා,\nන චාපි මන්තයුද්ධෙන සක්කා ජෙතුං ධනෙන වා."
            },
            {
                "type": "gatha",
                "text": "තස්මා හි පණ්ඩිතො පොසො සම්පස්සං අත්ථමත්තනො,\nබුද්ධෙ ධම්මෙ ච සඞ්ඝෙ ච ධීරො සද්ධං නිවෙසයෙ."
            },
            {
                "type": "page-break",
                "text": "188"
            },
            {
                "type": "gatha",
                "text": "යො ධම්මචාරී{1 ධම්මං චරි - මඡසං.} කායෙන වාචාය උද චෙතසා,\nඉධෙව නං පසංසන්ති පෙච්ච සග්ගෙ පමොදතීති."
            },
            {
                "type": "centered",
                "text": "**කොසලවග්ගො තතියො.**",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "පුග්ගලො අය්යකා ලොකො ඉස්සත්ථං පබ්බතූපමං,\nදෙසිතං බුද්ධසෙට්ඨෙන ඉමං කොසලපඤ්චකන්ති."
            },
            {
                "type": "centered",
                "text": "**කොසලසංයුත්තං සමත්තං.**",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "pages": {
            "130": {
                "pageNum": 130,
                "footnotesCount": 8
            },
            "132": {
                "pageNum": 132,
                "footnotesCount": 7
            },
            "134": {
                "pageNum": 134,
                "footnotesCount": 4
            },
            "136": {
                "pageNum": 136,
                "footnotesCount": 4
            },
            "138": {
                "pageNum": 138,
                "footnotesCount": 1
            },
            "140": {
                "pageNum": 140,
                "footnotesCount": 3
            },
            "142": {
                "pageNum": 142,
                "footnotesCount": 6
            },
            "144": {
                "pageNum": 144,
                "footnotesCount": 4
            },
            "146": {
                "pageNum": 146,
                "footnotesCount": 2
            },
            "148": {
                "pageNum": 148,
                "footnotesCount": 14
            },
            "150": {
                "pageNum": 150,
                "footnotesCount": 6
            },
            "152": {
                "pageNum": 152,
                "footnotesCount": 6
            },
            "154": {
                "pageNum": 154,
                "footnotesCount": 3
            },
            "156": {
                "pageNum": 156,
                "footnotesCount": 6
            },
            "158": {
                "pageNum": 158,
                "footnotesCount": 5
            },
            "160": {
                "pageNum": 160,
                "footnotesCount": 8
            },
            "162": {
                "pageNum": 162,
                "footnotesCount": 4
            },
            "164": {
                "pageNum": 164,
                "footnotesCount": 5
            },
            "166": {
                "pageNum": 166,
                "footnotesCount": 5
            },
            "168": {
                "pageNum": 168,
                "footnotesCount": 5
            },
            "170": {
                "pageNum": 170,
                "footnotesCount": 5
            },
            "172": {
                "pageNum": 172,
                "footnotesCount": 2
            },
            "174": {
                "pageNum": 174,
                "footnotesCount": 4
            },
            "176": {
                "pageNum": 176,
                "footnotesCount": 2
            },
            "178": {
                "pageNum": 178,
                "footnotesCount": 8
            },
            "180": {
                "pageNum": 180,
                "footnotesCount": 3
            },
            "182": {
                "pageNum": 182,
                "footnotesCount": 14
            },
            "184": {
                "pageNum": 184,
                "footnotesCount": 9
            },
            "186": {
                "pageNum": 186,
                "footnotesCount": 5
            },
            "188": {
                "pageNum": 188,
                "footnotesCount": 1
            }
        }
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "131"
            },
            {
                "type": "heading",
                "text": "3. කොසල සංයුත්‌තය\n",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. බන්ධන වර්ගය\n",
                "level": 2
            },
            {
                "type": "centered",
                "text": "3. 1. 1.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "දහර සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "112. මා විසින් මෙසේ අසන ලදී. එක්කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයෙහි ජේතවන නම් වූ අනේපිඬු සිටටුහුගේ අරම්හි වැඩ වසන සේක. එකල පසේනදි කොසොල් රජ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතු වහන්සේ සමග සතුටු වී ය. සතුටු විය යුතු සිහි කරන්නට නිසි කථාව කොට නිමවා එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් පසේනදි කොසොල් රජ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“භවත් ගෞතමයන් වහන්සේත් නිරුත්තර වූ සම්‍යක් සම්බෝධිය අවබෝධ කළෙම් ය” යි ප්‍රතිඥා කරණ සේක් ද? “මහරජ, මැනවින් කියන්නෙක් නිරුත්තර සම්‍යක් සම්බෝධිය අවබොධ කළේ ය” යි යමකු සඳහා කියන්නේ නම් මැනවින් කියන්නේ ඒ මා සඳහා කියන්නේ ය. මහරජ, මම වනාහි නිරුත්තර සම්‍යක් සම්බෝධිය අවබෝධ කළෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භවත් ගෞතමයන් වහන්ස, පැවිදි සමූහයා ඇති පැවිදි ගණයා ඇති ගණාචාර්ය වූ ප්‍රසිද්ධ වූ යසගී ඇති ලබ්ධිකර වූ (අඳබල්) බොහෝදෙනා විසින් සාධු සම්මත වූ යම් ඒ මහණබමුණෝ ඇද්ද ඔහු කවරහ: පූර්ණකස්සප ය, මක්ඛලිගොසාල ය, නිගණ්ඨනාතපුත්ත ය, සඤ්ජය බෙලට්ඨපුත්ත ය, පකුධකච්චායාන ය, අජිතකෙසකම්බල ය යන මොහු යි. ඔහුත් “නිරුත්තර සම්‍යක් සම්බෝධිය අවබෝධ කළම්හ යි ප්‍රතිඥා කරහු දැයි මා විසින් විචාරණ ලද්දාහු “නිරුත්තර සම්මාසම්බෝධිය අවබොධ කළම්හ” යි ප්‍රතිඥා නො කෙරෙත්. කීම? භවත් ගෞතමයන් වහන්සේ උපතිනුදු ලදරු වන සේක. පැවිදෙනුත් නවක වන සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, මේ සිවු දෙනෙක් ලදරු හ යි අවමන් නො කට යුත්තාහ, ලදරු හ යි පරිභව නො කට යුත්තාහ. කවර සිවු දෙනෙක යත්: මහරජ, ක්ෂත්‍රිය තෙමේ ලදරු ය යි අවමන් නො කට යුත්තේ ය, ලදරු ය යි පරිභව නො කට යුත්තේ ය. මහරජ, සර්පයා ලදරු ය යි අවමන් නො කට යුත්තේ ය, ලදරු ය යි පරිභව නො කට යුත්තේ ය. මහරජ, ගිනි ලදරු ය යි අවමන් නො කට යුත්තේ ය, ලදරු ය යි පරිභව නො කට යුත්තේ ය. මහරජ, මහණ ලදරු ය යි අවමන් නො කට යුත්තේ ය, ලදරු ය යි පරිභව නො කට යුත්තේ ය. මහරජ, මේ සිවු දෙන ලදරු හ යි අවමන් නො කට යුත්තාහ, ලදරුහ යි පරිභව නො කට යුත්තාහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. තවද සුගත වූ ශාස්තෘන් වහන්සේ මෙය වදාරා ඉක්බිති අන්‍ය තෙල ගය ද වදාළ සේක. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මිනිස් තෙමේ ජාතිසම්පන්න වූ විශිෂ්ට කුලයෙහි උපන් සශසර්ව වු කැත් කුමරා ලදරු ය යි අවමන් නො කරන්නේ ය. ඔහුට පරිභව ද නො කරනෙනේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "133"
            },
            {
                "format": 13,
                "text": "තව කරුණෙක් ඇත. මිනිසුන්ට ශ්‍රේෂ්ඨ වූ ඒ ක්ෂත්‍රිය තෙමේ රජය ලැබ කිපියේ (තමහට අවමන් කළ) ඔහු කෙරෙහි රාජදණ්ඩයෙන් අත්‍යර්ථයෙන් උපක්‍රම කෙරේ. එහෙයින් තමදිවි රක්නේ ඔහු නො ගටන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉදින් මිනිස් තෙමේ ගම්හි හෝ අරණෙහි හෝ යම් තැනක සර්පයෙකු දක්නේ ද? ඔහු ලදරු ය යි අවමන් නො කරන්නේය. ඔහුට පරිභව ද නො කරනෙනේ ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "තේජසර්ව වූ සර්ප තෙමේ නන් වැදෑරුම් වෙසින් හැසිරෙයි. හෙ කිසි විටෙක (තමන්ට අවමන්) අඥ පුරුෂයා හා ස්ත්‍රිය කරා පැමිණ දෂ්ට කරන්නේ ය. එහෙයින් තමදිවි රක්නේ ඔහු නො ගටන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ප්‍රභුතභක්ෂා ඇති (බොහෝ දේ දවන) ගිනිදැල් ඇති කළුමග ඇති ගින්න ලදරු ය යි අවමන් නො කරන්නේය. මිනිස් තෙමේ ඊට පරිභව ද නො කරනෙනේ ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඒ ගින්න පසයන් ලැබ විශාල ව ඇතැම් විටෙක (තමන්ට අවමන් කළ) අඥ පුරුෂයා හා ස්ත්‍රිය කරා පැමිණ ඩැහැ ගන්නේ ය. එහෙයින් තම දිවි රක්නේ එය නො ගටන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කළුමග ඇති පාවක නම් වූ ගින්න යම් වනයක් ඩැහැගන්නේ ද, දවරැය ඉක්ම ගිය කල්හි එහි ප්‍රරෝහයෝ (මුලින් නගින අකුරු) හට ගණිත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සිල්වත් මහණෙක් තෙදින් යමකු දවා ද? ඔහුට පුත්‍රයෝ ද සිවුපාවෝ ද නො වෙත්. දායාදයෝ ධනය නො ලබත්. (මෙසේ) ඔහු දරුවන් නැත්තාහු දායාදයන් නැත්තාහු මුදුන සුන් තල්රුක්බඳු වෙත්. එහෙයින් නුවණැති පුරුෂ තෙමේ තමාගේ අභිවෘද්ධිය දක්නේ සර්පයා ද, ගිනි ද, කීර්තිමත් ක්ෂත්‍රියයා ද, සිල්වත් මහණහු ද මැනවින් ම ඇසුරු කරන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි පසේනදි කොසොල් රජ භාග්‍යවතුන් වහන්සේට තෙල සැළ කළේ ය: වහන්ස ඉතා මැනවි. වහන්ස ඉතා මැනවි. වහන්ස, යම්සේ යටිකුරු වූවක් උඩුකුරු කරන්නේ හෝ වේ ද, වැසුනු දෙයක් විවර කරන්නේ හෝ වේ ද, මං මුළා වූවකුට මග කියන්නේ හෝ වේ ද, ඇස් ඇත්තෝ රූප දක්නාහු ය යි අඳුරෙහි තෙල්පහනක් දරන්නේ හෝ වේ ද, එසෙයින් ම භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් අයුරෙන් දහම් පවසන ලදී, වහන්ස, මේ මම භාග්‍යවතුන් වහන්සේත් දහමත් බික්සඟනත් සරණ කොට යෙමි. වහන්ස, භාග්‍යවතුන් වහන්සේ අද පටන් දිවිහිම් කොට තෙරුවන් සරණ ගිය මා උපාසකයෙකු කොට දරණ සේක්වා යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3.1.2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පුරිස සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "113. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකල්හි පසේනදී කොසොල් රජ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් පසේනදි කොසොල් රජ භාග්‍යවතුන් වහන්සේට “වහන්ස, කෙතෙක් ධර්මයෝ පුරුෂයාගේ සිය සතන්හි රසදනාහු අභිත පිණිස දුක් පිණිස නොපහසු විහරණය පිණිස උපදිත් දැ” යි තෙල සැළ කළේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "135"
            },
            {
                "format": 13,
                "text": "මහරජ, දහම්හු තිදෙනෙක් පුරුෂයාගේ සිය සතන්හි උපදනාහු අහිත පිණිස දුක් පිණිස නොපහසු විහරණය පිණිස උපදිත්. කවර තිදෙනෙක යත්: මහරජ, ලෝභය පුරුෂයාගේ සිය සතන්හි උපදනේ අහිත පිණිස දුක් පිණිස නොපහසු විහරණය පිණිස උපදී. මහරජ, ද්වේෂය පුරුෂයාගේ සිය සතන්හි උපදනේ අහිත පිණිස දුක් පිණිස නොපහසු විහරණය පිණිස උපදී. මහරජ, මෝහය පුරුෂයාගේ සිය සතන්හි උපදනේ අහිත පිණිස දුක් පිණිස නොපහසු විහරණය පිණිස උපදී. මහරජ, මේ දහම්හු තුන්දෙන පුරුෂයාගේ සිය සතන්හි උපදනාහු අහිත පිණිස දුක් පිණිස නොපහසු විහරණය පිණිස උපදිත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ලෝභය ද ද්වේෂය ද මෝහය ද සිය සතන්හි හටගත්තාහු ළමු අදහස් ඇති පුරුෂයා සිය ඵලය (හුණ බට ආදී) පොතුහර ගසක් පෙළෙන්නාක් මෙන් පෙළත්.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3.1.3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "රාජ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "114. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකත්පසෙක සිටි පසේනදි කොසොල් රජ භාග්‍යවතුන් වහන්සේට “වහන්ස, උපන්නහුට ජරාමරණ හැර අනෙකෙක් ඇද්දැ” යි තෙල සැළ කළේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, උපන්නහුට ජරාමරණ හැර අනෙකෙක් නැත. මහරජ, ආඪ්‍ය වූ මහද්ධන ඇති මහත් භෝග ඇති බොහෝ රන්රිදී ඇති බොහෝ විතී හා උවරණ (චස්තුපකරණ) බොහෝ ධනධාන්‍ය ඇති කැත්මහසල් කෙනෙකුත් වෙද්ද: උපන් ඔවුන ට ද ජරාමරණ හැර අනෙකෙක් නැත. මහරජ, යම් ඒ බමුණුමහසල් කෙනෙකුත් වෙද්ද? … මහරජ, ආඪ්‍ය වු මහද්ධන ඇති මහත් භෝග ඇති බොහෝ රන් රිදී ඇති බොහෝ චස්තුපකරණ ඇති බොහෝ ධනධාන්‍ය ඇති ගැහැවිමහසල් කෙනෙකුත් වෙද්ද? උපන් ඔවුන්ට ද ජරාමරණ හැර අනෙකෙක් නැත. මහරජ, රහත් වූ ක්ෂය කළ ආස්‍රවයන් ඇති මගබඹසර වැස නිම වූ කළ සිවුමග කිස ඇති බහා තැබූ කෙලෙස් බර ඇති පිළිවෙළින් පැමිණි රහත් බැව් ඇති ක්ෂය කළ භවසංයෝජන ඇති මැනවින් දැන මිදුනු යම් රහත් මහණ කෙනෙකුත් වෙද්ද? ඔවුන්ගේ ද මේ කය බිඳෙන ස්වභාව ඇත්තේ ය. බැහැර ලිය යුතු ස්වභාව ඇත්තේ ය යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "විසිතුරු වූ රාජ රථයෝ ඒකාන්තයෙන් දිරත්. තවද සිරුර ද දිරීමට පැමිණේ. සත්පුරුෂයන්ගේ ධර්මය දිරීමට නො පැමිණේ. සත්පුරුෂයෝ ඒකාන්තයෙන් සත්පුරුෂයන් සමග මෙසේ ප්‍රකාශ කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3.1.4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පිය සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "115. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකත්පසෙක හුන් පසේනදි කොසොල්රජ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. වහන්ස: මෙහි රහසිගත වූ එකලාව හුන් මාගේ සිත්හි “කිනම් කෙනකුන්ට තෙමේ ප්‍රිය” වේ ද? කිනම් කෙනකුන්ට තෙමේ අප්‍රිය වේ දැ? යි මෙබඳු විතර්කයෙක් පහළ විය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "137"
            },
            {
                "format": 13,
                "text": "වහන්ස, ඒ මට තෙල අදහස විය: යම් කිසි කෙනෙක් කයින් දුසිරිත් කෙරෙත් ද, වචනයෙන් දුසිරිත් කෙරෙත් ද, සිතින් දුසිරිත් කෙරෙත් ද, ඔවුන්ට තෙමේ අප්‍රිය ය. ඔවුන් “අපට තෙමේ ප්‍රිය ය”යි මෙසේ කියතුදු වැලිත් ඔවුන්ට තෙමේ අප්‍රිය ය. ඒ කවර හෙයින් යත්: අප්‍රිය නැතැත්තේ අප්‍රිරියයාට යමක් කරන්නේ ඔහු එය තුමූ ම තමන්ට කෙරෙති. එහෙයින් ඔවුන්ට තෙමේ අප්‍රිය ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යම් කෙනෙක් කයින් සුසිරිත් කෙරෙත් ද, වචනයෙන් සුසිරිත් කෙරෙත් ද, සිතින් සුසිරිත් කෙරෙත් ද, ඔවුන්ට තෙමේ ප්‍රිය ය. ඔහු “අපට තෙමේ අප්‍රිය ය”යි මෙසේ කියන්නාහු නමුදු, වැලිත් ඔවුන්ට තෙමේ ප්‍රිය ය. ඒ කවර හෙයින් යත්: ප්‍රිය නැතැත්තේ ප්‍රියයාට යමක් කරන්නේ නම් ඔහු එය තුමූ ම තමන්ට කෙරෙති. එහෙයින් ඔවුන්ට තෙමේ ප්‍රිය ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, තෙල එසේ ය. මහරජ, තෙල එසේ ය. මහරජ, යම් කිසි කෙනෙක් කයින් දුසිරිත් කෙරෙත් ද, වචනයෙන් දුසිරිත් කෙරෙත් ද, සිතින් දුසිරිත් කෙරෙත් ද, ඔවුන්ට තෙමේ අප්‍රිය ය. කිසිසෙයෙකින් ඔහු “අපට තෙමේ ප්‍රිය ය”යි මෙසේ කියන්නාහු නමුදු, ඔවුන්ට තෙමේ අප්‍රිය ය. ඒ කවර හෙයින යත්: මහරජ, අප්‍රිය නැතැත්තේ අප්‍රිරියයාට යමක් කරන්නේ නම් ඔහු එය තුමූ ම තමන්ට කෙරෙති. එහෙයින් ඔවුන්ට තෙමේ අප්‍රිය ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, යම් කිසි කෙනෙක් කයින් සුසිරිත් කෙරෙද්ද, වචනයෙන් සුසිරිත් කෙරෙද්ද, සිතින් සුසිරිත් කෙරෙද්ද, ඔවුන්ට තෙමේ ප්‍රිය ය. කිසිසේ ඔහු “අපට තෙමේ අප්‍රිය ය”යි මෙසේ කියන්නාහු නමුදු, වැලිත් ඔවුන්ට තෙමේ ප්‍රිය ය. ඒ කවර හෙයින යත්: මහරජ, ප්‍රිය නැතැත්තේ ප්‍රියයාට යමක් කෙරේ නම් ඔහු එය තුමූ ම තමන්ට කෙරෙත්. එහෙයින් තෙමේ තමන්ට ප්‍රිය ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉදින් ‘ආත්මය ප්‍රිය ය' යි දන්නේ නම් ඒ ආත්මය පව හා නො යොදන්නේ ය. පව් කරන්නහු විසින් ඒ සුවය සුව සේ නො ලද හැකි ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මරුවා විසින් වැතිරෙන ලද, මිනිස්භවය හැර දමන ඔහුට කිමෙක් තමන්ගේ වේ ද? කිමෙක් රැගෙණ යේ ද? වෙන් නො වන සෙවනැල්ල මෙන් කිමෙක් ඔහු අනු ව යන්නේ වේ ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මිනිස් තෙමේ මෙලෙව්හි යම් පින්පව් දෙකක් කෙරේ ද, එය ඔහුට සිය දෑ වෙයි. එය ම රැගෙණ යෙයි. වෙන් නො වන සෙවනැල්ල මෙන් එය ම ඔහු අනු ව යන්නේ වෙයි. එහෙයින් පරලොවට හිත දෑ රැස් කරන්නේ පින් කරන්නේ ය. පින් පරලෙව්හි දී සත්වයන්ට පිහිට වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3.1.5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අත්තරක්ඛිත සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "116. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකත්පසෙක හුන් පසේනදි කොසොල් රජ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. වහන්ස: මෙහි රහසිගත වූ එකලාව හුන් මගේ සිත්හි “කවුරුන් විසින් ආත්මය රක්නා ලද්දේ ද, කවුරුන් විසින් ආත්මය නො රක්නා ලද්දේ දැ?” යි මෙබඳු විතර්කයෙක් පහළ විය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "139"
            },
            {
                "format": 13,
                "text": "වහන්ස, ඒ මට මේ අදහස් විය: යම් කිසි කෙනෙක් කයින් දුසිරිත් කෙරෙද් ද, වචනයෙන් දුසිරිත් කෙරෙද් ද, සිතින් දුසිරිත් කෙරෙද්ද, ඔවුන් විසින් තෙමේ නොරක්නා ලද්දේ ය. කිසිසේ ඔවුන් ඇත්මුළු හෝ රක්නේ නම්, අස්කැල හෝ රක්නේ නම්, රියපෙල හෝ රක්නේ නම්, පාබල සෙනඟ හෝ රක්නේ නම්, වැලිත් ඔවුන් විසින් තෙමේ නො රක්නා ලද්දේ ය. ඒ කවරහෙයින: මේ රැක්ම බැහැර ය. මේ රැක්ම ඇතුළත නො වේ. එහෙයින් ඔවුන් විසින් තෙමේ නො රක්නා ලද්දේ ය. යම් කිසි කෙනෙක් කයින් සුසිරිත් කෙරෙද් ද, වචනයෙන් සුසිරිත් කෙරෙද්ද, සිතින් සුසිරිත් කෙරෙද්ද, ඔවුන් විසින් තෙමේ රක්නා ලද්දේ ය. කිසිසේසෙයකින් ඔවුන් ඇත් මුළ නො ම රක්නේ නම්, අස්කැල නො ම රක්නේ නම්, රියපෙල නො ම රක්නේ නම්, පාබලසෙනඟ නො ම රක්නේ නම්’ වැලිත් ඔවුන් විසින් තෙමේ රක්නා ලද්දේ ය. ඒ කවරහෙයින: මේ රැක්ම ඇතුළත ය, මේ රැක්ම බැහැර නො වේ. එහෙයින් ඔවුන් විසින් තෙමේ රක්නා ලද්දේ ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, තෙල එසේ ය. මහරජ, තෙල එසේ ය. මහරජ, යම් කිසි කෙනෙක් කයින් දුසිරිත් කෙරෙද් ද,... ඔවුන් විසින් තෙමේ නො රක්නා ලද්දේ ය.  කිසිසේත් ඔවුන් ඇත්මුළ හෝ රක්නේ ද, ... පාබලසෙනඟ හෝ රක්නේ නම් වැලිත් ඔවුන් විසින් තෙමේ නො රක්නා ලද්දේ ය. ඒ කවර හෙයින: මහරජ, මේ රැක්ම බැහැර ය. මේ රැක්ම ඇතුළත නො වේ. එහෙයින් ඔවුන් විසින් තෙමේ නො රක්නා ලද්දේ ය. මහරජ, යම් කිසි කෙනෙක් කයින් සුසිරිත් කෙරෙත් ද, ... සිතින් සුසිරිත් කෙරෙද් ද, ඔවුන් විසින් තෙමේ රක්නා ලද්දේ ය. කිසි සේත් ඔවුන් ඇත් සෙනඟ නො ම රක්නේ නම්, … පාබලසෙනඟ නො ම රක්නේ නම් එහෙත් ඔවුන් විසින් තෙමේ රක්නා ලද්දේ ය. ඒ කවරහෙයින: මහරජ, මේ රැක්ම ඇතුළත ය, මේ රැක්ම බැහැර නො වේ. එහෙයින් ඔවුන් විසින් තෙමේ රක්නා ලද්දේ ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කයින් සංවරය මැනවි. වචනයෙන් සංවරය මැනවි. සිතින් සංවරය මැනවි. හැම තන්හි සංවරය මැනවි. හැම තන්හි සංවෘත වූ ලජ්ජා ඇත්තේ රැකුනේ ය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3.1.6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අප්පකා සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "117. **සැවැත්නුවර -**",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකත්පසෙක හුන් පසේනදි කොසොල් රජ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. වහන්ස: මෙහි රහසිගත ව එකලා ව හුන් මගේ සිත්හි මෙබඳු විතර්කයෙක් පහළ විය. යම් කෙනෙක් ප්‍රණීත වූත් බොහෝ වූත් මහත් මහත් භෝගයන් ලැබ නො ම මත් වෙත් ද, නො ම පමා වෙත් ද, කාමයන්හි ගිජුබවටත් නො ද පැමිණෙද්ද, සතුන් කෙරෙහිත් වරදවා නො පිළිපදිද්ද, ඒ සත්වයෝ ලොව ස්වල්පයහ. වැලිදු යම් කෙනෙක් ප්‍රණීත වූත් බොහෝ වූත් මහත් මහත් භෝගයන් ලැබ මත් වෙත් ද, පමාත් වෙද්ද, කාමයන්හි ගිජුබවටත්  පැමිණෙද්ද, සතුන් කෙරෙහිත් වරදවා පිළිපදිද්ද, මේ සත්වයෝ ම ලොව ඉතා බොහෝහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "141"
            },
            {
                "format": 13,
                "text": "මහරජ, එසේ ය. මහරජ, එසේ ය. මහරජ, යම් කෙනෙක් ප්‍රණීතවූත් බොහෝ වූත් තෙල මහත් මහත් භෝගයන් ලැබ නො ම මත් වෙද්ද, නො ම පමාත් වෙද්ද, කාමයන්හි ගිජුබවට නො ද මහත් මහත් පැමිණෙද්ද, සතුන් කෙරෙහිත් නො ද වරදවා පිළිපදිද් ද, ඒ සත්වයෝ ලොව ඉතා ස්වල්පයහ. වැලිදු යම් කෙනෙක් ප්‍රණීත වූත් බොහෝ වූත් භොගයන් ලැබ මත් වෙද්ද, පමාත් වෙද්ද, කාමයන්හි ගිජුබවටත් පැමිණෙත් ද, සතුන් කෙරෙහිත් වරදවා පිළිපදිද්ද, ඒ සත්වයෝ ම ලොව ඉතා බොහෝහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කාමවස්තූන්හි ඇලුනු කාමයන්හි ගිජු වූ මුසපත් වූ සත්වයෝ කුසල් සීමාව ඉක්ම යෑම නො දනිත්. දමන ලද පාසය නො දන්නා මුවන් මෙනි. පසු ව ඔවුන්ට දුක වෙයි. එහි විපාකය ඒකාන්තයෙන් ලාමක ය යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3.1.7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අත්ථකරණ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "__tester__",
                "type": "unindented"
            },
            {
                "type": "paragraph",
                "text": "එකත්පසෙක හුන් පසේනදි කොසොල් රජ භාග්‍යවතුන් වහන්සේට තෙල සැළ කළේ ය. වහන්ස: මෙහි මම විනිශ්චයාසනයෙහි හුන්නෙම් අඪ්‍ය වූ මහද්ධන ඇති මහත් භෝග ඇති බොහෝ රන්රිදී ඇති  බොහෝ වූ මනවඩන දෑ ඇති බොහෝ ධනධ්‍යාන ඇති කැත් මහසලුන් ද, බමුණු මහසලුන් ද, ගැහැවි මහසලුන් ද කාමයන් හෙතු කොට ගෙණ කාමයන් නිදාන කොට ගෙණ කාමයන් කරුණු කොට ගෙණ දැන දැන මුසා බණන්නවුන් දකිමි. වහන්ස, ඒ මට “දන් මා විසින් නඩු විසඳීමෙන් කම් නැත. දැන් නඩුහලෙහි සොඳුරුමුව ඇත්තෙක් නො පෙණේ ය\" යි මේ අදහස විය. "
            },
            {
                "format": 13,
                "text": "මහරජ අඪ්‍යවූ මහද්ධන ඇති මහත් භෝග ඇති බොහෝ වූ රන්රිදී ඇති  බොහෝ වූ මනවඩන වස්තූපකරණ ඇති බොහෝ වූ ධනධ්‍යාන ඇති යම් ඒ කැත්මහසල්ලුත්, බමුණු මහසල්ලුත්, ගැහැවි මහසල්ලුත් කාමයන් හේතු කොට ගෙණ කාමයන් නිදාන කොට ගෙණ කාමයන් කරුණු කොට ගෙණ දැන දැන මුසා බෙණෙද්ද, ඔවුන්ට එය බොහෝ කලක් මුළුල්ලෙහි අහිත පිණිස දුක් පිණිස වන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කාමවස්තූන්හි ඇලුනු කාමයන්හි ගිජු වූ මුසපත් වූ සත්වයෝ කුසල් ඉම ඉක්ම යෑම නො දනිත්. අටවන ලද කෙමිනට තමන් වදනා බව නො දන්නා මසුන් මෙනි. පසු ව ඔවුන්ට දුක වේ. එහි විපාකය ඒකාන්තයෙන් ලාමක ය.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3.1.8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මල්ලිකා සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "119. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකල්හි පසේනදි කොසොල්රජ මල්ලිකාදේවිය සමග උතුම් පහයෙහි මතුමහලට ගියේ වෙයි. ඉක්බිති පසේනදි කොසොල්රජ මල්ලිකා දේවියට “මල්ලිකාවෙනි, තමහට වඩා ඉතා ප්‍රිය වූ අන් කිසිවෙක් තොපට ඇද්දැ” යි තෙල කී ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "143"
            },
            {
                "format": 13,
                "text": "මහරජ, තමහට වඩා ඉතා ප්‍රිය වූ අන් කිසිවෙක් මට නැත. මහරජ, තමහට වඩා ඉතා ප්‍රිය වූ අන් කිසිවෙක් තොපට ඇද්ද? මල්ලිකාවෙනි, තමහට වඩා ඉතා ප්‍රිය වූ අන් කිසිවෙක් මට ද නැත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති පසේනදි කොසොල්රජ පහයෙන් බැස භාග්‍යවතුන් වහන්සේ කරා එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් පසේනදි කොසොල්රජ භාග්‍යවතුන් වහන්සේට තෙල සැළ කළේ ය. වහන්ස, මෙහි මම මල්ලිකාදේවිය සමග උතුම් පහාතලමත අරා සිටියෙම් මල්ලිකාදෙවියට “මල්ලිකාවෙනි, තමහට වඩා ඉතා ප්‍රිය වූ අන් කිසිවෙක් තොපට ඇද්දැ”යි තෙල කීමි. වහන්ස, මෙසේ කී කල්හි මල්ලිකා දෙවිය මට “මහරජ, තමහට වඩා ඉතා ප්‍රිය වූ අන් කිසිවෙක් මට නැත. මහරජ, තමහට වඩා ඉතා ප්‍රිය වූ අන් කිසිවෙක් තොපට ඇද්දැ” යි තෙල බස් කිවු ය. වහන්ස, මෙසේ කියන ලද මම මල්ලිකාදෙවියට “මල්ලිකාවෙනි, තමහට වඩා ඉතා ප්‍රිය වූ අන් කිසිවෙක් මටත් නැතැ”යි තෙල කීයෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි භාග්‍යවතුන් වහන්සේ මේ කරුණ දැන ඒ වේලයෙහි මේ ගාථාව වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සියලු දිගුන් සිතින් අනුගමනය කොට තමහට වඩා ඉතා ප්‍රිය වූවකු කිසි තැනෙක නො ම ලදිමි. මෙසේ අන් බොහෝ දෙනාට ද තෙමේ ප්‍රිය ය. එහෙයින් තමහට වැඩ කැමැත්තේ මෙරමා නො පෙළන්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3.1.9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "යඤ්ඤ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "120. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකල්හි පසේනදි කොසොල් රජහට මහායාගයක් එළඹ සිටියේ වෙයි. පන්සියක් ගොන්නු ද, පන්සියක් නහඹුහු ද, පන්සියක් නැහැඹියෝද, පන්සියක් එළුවෝ ද, පන්සියක් තිරෙළුවෝ ද යාගය පිණිස ටැඹ ඇරැ බඳනා ලද්දාහු වෙත්. ඔහුගේ දාසයෝ ය කියා හෝ දූතයෝ ය කියා හෝ කම්කරුවෝය කියා හෝ යම් ඒ කෙනෙක් වෙත්නම් ඔහුත් දඬුවමින් තැති ගත්තාහු බියෙන් තැති ගත්තාහු කඳුළු වැකුනු මුහුණු ඇත්තාහු අඬමින් පිරියම් කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති බොහෝ භික්ෂූහු පෙරවරු හැඳ පෙරෙව පාසිවුරු ගෙණ සැවැත්නුවර පිඬු පිණිස පිවිසියහ. සැවැත්නුවර පිඬු පිණිස හැසිර පසුබත පිණ්ඩපාතයෙන් වැළකුනාහු භාග්‍යවතුන් වහන්සේ කරා එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්හ. එකත්පසෙක හුන් ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට තෙල සැළ කළහ. වහන්ස, මෙහි පසේනදි කොසොල් රජහට මහායාගයක් එළඹ සිටියේ වෙයි. පන්සියක් ගොන්නු ද, පන්සියක් නහඹු වස්සෝ ද, පන්සියක් නහඹු වැස්සෝ ද, පන්සියක් එළුවෝ ද, පන්සියක් ලදරු මැඬහු ද යාගය පිණිස ටැඹ ඇරැ බඳන ලදුවෝ වෙත්. ඔහුගේ දාසයෝ ය කියා හෝ දූතයෝ ය කියා හෝ කම්කරුවෝය කියා හෝ යම් ඒ කෙනෙක් වෙත් නම් ඔහුත් දඬුවමින් තැති ගත්තාහු බියෙන් තැති ගත්තාහු කඳුලු වැකුනු මුහුණු ඇත්තාහු හඬමින් පිරියම් කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "145"
            },
            {
                "format": 13,
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ මේ කරුණ දැන ඒ වේලායෙහි මේ ගාථාවන් වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අස්සමෙධ ය, පුරිසමෙධ ය, සම්මාපාස ය, වාජපෙය්‍ය ය, නිරග්ගල ය යන (කෘත්‍ය වශයෙන්) මහත් ආරම්හ ඇති ඒ මහායාගයෝ මහත්ඵල නො වෙත්. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යම් යාගයක් නන්වැදෑරුම් වූ එළුතිරෙළුවෝ ද, ගෙරිහු ද නසන ලැබෙත් නම් ඒ යාගයට සම්‍යක්ප්‍රතිපන්න වූ බුද්ධාදි මහර්ෂීහු නො පැමිණෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යම් යාග කෙනෙක් අල්පාරම්හ ඇත්තාහු ද, (එබඳු යාගයන්) කුලයක් පාසා හැම කල්හි කෙරෙත්. මෙහි නන්වැදෑරුම් වූ එළුතිරෙළුවෝ ද, ගෙරිහු ද නො නසනු ලැබෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සම්‍යක්ප්‍රතිපන්න වූ බුද්ධාදි මහර්ෂීහු මේ යාගයට පැමිණෙත්. නුවණැත්තේ තෙල යාගය කරන්නේ ය. තෙල යාගය මහත්ඵල ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "තෙල යාගය කරන්නහුට වැඩීමෙක් වේ. පිරිහීමෙක් නො වේ. යාගය ද විපුල වේ, දෙවියෝත් පහදිති.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "බන්ධන සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "121. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකල්හි පසේනදි කොසොල් රජු විසින් ඇතම්හු රැහැණින් ද, ඇතම්හු යදමින් ද, ඇතම්හු හැකිල්ලෙන් දැ යි මෙසේ මහාජන පිරිස් බඳවන ලද්දාහු වෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි බොහෝ භික්ෂූහු පෙරවරු හැඳ පොරොවා පාසිවුරු ගෙණ සැවැත්නුවරට පිඬු පිණිස පිවිසියහ. සැවැත්නුවර පිඬු පිණිස හැසිර පසුබත පිණ්ඩපාතයෙන් වැළකුනාහු භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්හ. එකත්පසෙක හුන් ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට “වහන්ස, මෙහි පසේනදි කොසොල්රජු විසින් ඇතම්හු රැහැණින් ද, ඇතම්හු යදමින් ද, ඇතම්හු හැකිල්ලෙන් දැ යි මෙසේ මහාජන පිරිස් බඳවන ලද්දාහු ය” යි තෙල සැළ කළහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි භාග්‍යවතුන් වහන්සේ මේ කරුණ දැන ඒ වේලායෙහි මේ ගාථාවන් වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යමුවා වූ ද දැවමුවා වූ ද බබුස්තණමුවා වූ ද යම් බන්ධනයෙක් වේ ද, ඒ බන්ධනය දැඩි ය යි ප්‍රාඥයෝ නො කියත්. මිණිකොඬොල්හි ද දරුවන් කෙරෙහි ද අඹුවන් කෙරෙහි ද දැඩිඇලුමින් ඇලුන යම් අපේක්ෂායෙක් වේ ද,",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යට (=සිවු අපායට) ඇද ලන ලිහිල් වූ මිදීමට දුෂ්කර වූ මේ බන්ධනය දැඩි ය යි නුවණැත්තෝ කියත්. කාමයන්හි අපේක්ෂා නැත්තාහු මේ බන්ධනය ද සිඳ කම්සුව හැර දමා ගිහිගෙය හැර යෙත්.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "147"
            },
            {
                "type": "paragraph",
                "text": "__**tester**__\n"
            },
            {
                "type": "unindented",
                "text": "**__tester__**\n"
            },
            {
                "type": "heading",
                "text": "2. අපුත්තක වර්ගය",
                "level": 2
            },
            {
                "type": "centered",
                "text": "3. 2. 1.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "සත්තජටිල සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "122. එක් කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයෙහි වූ පුවරම් නම් මුවරමා පහයෙහි වැඩ වසන සේක. එකල්හි භාග්‍යවතුන් වහන්සේ සවස් වේලෙහි පලසමවතින් නැගී සිටිසේක් බිහිදොරකොටුවෙහි වැඩහුන් සේක. ඉක්බිති පසේනදි කොසොල් රජ තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි වැඩුනු කැසනියලොම් ඇති ජටිලයෝ සත් දෙනෙක් ද, නිගණ්ඨයෝ සත් දෙනෙක් ද, අචේලකයෝ සත් දෙනෙක් ද, ඒකසාටකයෝ සත් දෙනෙක් ද, පරිව්‍රාජකයෝ සත් දෙනෙක් ද නන් තවුස්පිරිකර ගෙණ භාග්‍යවතුන් වහන්සේ නුදුරෙහි (එ පෙදෙස) ගෙවා යෙති. ඉක්බිති පසේනදි කොසොල්රජ හුනස්නෙන් නැගිට උතුරුසළුව එකස් කොට දකුණු දණමඬල පොළොවෙහි හැන ජටිලයන් සත්දෙන ද නිගණ්ඨයන් සත්දෙන ද, අවේලකයන් සත්දෙන ද, ඒකසාටකයන් සත්දෙන ද පරිව්‍රාජකයන් සත්දෙන ද වෙත ඇඳිලි බැඳ “වහන්ස, මම පසේනදි කොසොල් රජ වෙමි. … වහන්ස, මම පසේනදි කොසොල් රජ වෙමි”යි තෙවරක් නම ඇස්වී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති ඒ ජටිලයන් සත්දෙන ද නිගණ්ඨයන් සත්දෙන ද අවෙලකයන් සත්දෙන ද එකසාටකයන් සත්දෙන ද පරිව්‍රාජකයන් සත්දෙන ද ගිය නොබෝ වෙලෙහි පසේනදි කොසොල්රජ තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත් පසෙක හුන්නේ ය. එකත්පසෙක හුන් පසේනදි කොසොල් රජ භාග්‍යවතුන් වහන්සේට “වහන්ස, ලොව යම් ඒ කෙනෙක් රහත්හු හෝ රහත්මගට පිළිපන්නාහු හෝ වෙත් ද, තුලුහු ඔවුනතරැ එක්තරා කෙනෙකැ”යි තෙල සැළ කෙළේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, ගිහි වූ කම්සැප විඳින දරුවන්ගෙන් පළිබොධ ඇති යහන්හි වෙසෙන සිනිඳු සඳුන් ගල්වන මල්ගඳවිලෙවුන් දරණ රන්රිදී ඉවසන තොප විසින් ‘මොහු රහත්හු ය කියා හෝ මොහු රහත්මගට පිළිපන්නෝ ය යි’ කියා හෝ තෙල නොදත හැකි ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "149"
            },
            {
                "format": 13,
                "text": "මහරජ, එක් ව විසීමෙන් ශීලය දත යුතු ය. එ ද දිගුකලෙකිනි. මඳ කලෙකින් නො වේ. මෙනෙහි කරන්නහු විසිනි. නොමෙනෙහි කරන්නහු විසින් නො වේ. පැණැත්තහු විසිනි. පැණනැතියහු විසින් නො වේ. මහරජ, කථාව්‍යවහාරයෙන් පවිත්‍රබව දත යුතු ය. එ ද දිගුකලෙකිනි. මඳ කලෙකින් නො වේ. මෙනෙහි කරන්නහු විසිනි. නො මෙනෙහි කරන්නහු විසින් නො වේ. නුවණැත්තහු විසිනි. නුවණ නැතියහු විසින් නො වේ. මහරජ, විපතෙහි දී ඥානශක්තිය දත යුතු ය. එ ද දිගුකලෙකිනි. මඳ කලෙකින් නො වේ. මෙනෙහි කරන්නහු විසිනි. නො මෙනෙහි කරන්නහු විසින් නොවේ. නුවණැත්තහු විසිනි. මුඪයා විසින් නො වේ. මහරජ, සාකච්ඡා යෙන් නුවණ දත යුතු ය. එ ද දිගුකලෙකිනි. මඳ කලෙකින් නො වේ. මෙනෙහි කරන්නහු විසිනි. නො මෙනෙහි කරන්නහු විසින් නො වේ. නුවණැත්තහු විසිනි. ඥානහීනයා විසින් නො වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, ආශ්චර්යයෙකි. වහන්ස, අද්භූතයෙකි. වහනස, “,මහරජ ගිහි වූ කම්සැප විඳින තොප විසින් මෙය දුකසේ දතයුතුය … නුවණැත්තහු විසිනි. නුනුවණහු විසින් නො වේ ය” යන මෙය භාග්‍යවතුන් වහන්සේ විසින් ඉතා මැනවින් දේශනා කරණ ලදි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, මොහු මාගේ පවත් විමසන චරපුරුෂයෝ ය. ජනපදය විමසා එති. ඔවුන් පළමු කොට විමසන ලද පෙදෙසට මම පසු ව බැස ගන්නෙමි. වහන්ස, දැන් ඔහු රජස්දැලි සෝදා හැර මොනවට නෑවාහු මොනවට සුවඳවිලෙවුන් ගැල්වූවාහු අන්දම් තබා සැරසූ කෙස්රවුළු ඇත්තාහු සුදුවත් හැඳ ගැත්තාහු පස්කම්ගුණයෙන් පිණා ගියාහු යුක්ත වූවාහු ඉඳුරන් හසුරු වන්නාහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ මේ කරුණ දැන ඒ වේලාවෙහි මේ ගාථාවන් වදාළ සේක: ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මිනිස් තෙමේ රූපසටහන් මැනවින් නො දත හැකි ය. ස්වල්පමාත්‍ර දර්ශනයෙන් නො අදහන්නේ ය. ඒ එසේ මැයි. සංයම නැත්තෝ මනාසංයම ඇත්තන්ගේ පරිෂ්කාරභාණ්ඩලක්ෂණයෙන් යුක්ත ව මෙලොව හැසිරෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇතුළත අපිරිසිදු වූ පිටත හොබනා වූ ඇතැම් කෙනෙක් ස්වර්ණප්‍රතිරූපක වූ මැටිමුවා කොඬොලක් මෙන් ද, රණින් වැසුන ලොහොමුවා අඩමස්සක් මෙන් ද පිරිවරින් වැසුනාහු හැසිරෙත්.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3.2.2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පඤ්චරාජ  සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "123. **සැවැත්නුවර - **",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකල්හි පස්කම්ගුණයෙන් පිණා ගියා වූ එයින් යුක්ත වූ ඉඳුරන් පිණවන්නා වූ පසේනදි කොසොල් රජුන් ප්‍රමුඛ කොට ඇති පස් රජුන් අතර “කාමවස්තු අතුරෙන් කුමක් අග්‍ර ද?” යන මේ අතුරු කතාව පහළ විය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "151"
            },
            {
                "format": 13,
                "text": "එහි ඇතැම් කෙනෙක් කාමවස්තූන් අතුරෙන් රූපයෝ අග්‍රහ යි මෙසේ කී හ. ඇතැම් කෙනෙක් කාමවස්තූන් අතුරෙන් ශබ්දයෝ අග්‍රහ යි මෙසේ කී හ. ඇතැම් කෙනෙක් කාමවස්තූන් අතුරෙන් ගන්ධයෝ අග්‍රහ යි මෙසේ කී හ. ඇතැම් කෙනෙක් කාමවස්තූන් අතුරෙන් රසයෝ අග්‍රහ යි මෙසේ කී හ. ඇතැම් කෙනෙක් කාමවස්තූන් අතුරෙන් ස්ප්‍රෂ්ටව්‍යයෝ අග්‍රහ යි මෙසේ කී හ. යම් හෙයකින් ඒ රජවරු ඔවුනොවුන් හඟවන්නට නො හැකි වුහු ද? එකල පසේනදි කොසොල් රජ තෙමේ ඒ රජවරුන්ට “නිදුකානෙනි, යම්හ, භාග්‍යවතුන් වහන්සේ වෙත එළඹෙම්හ. එළඹ භාග්‍යවතුන් වහන්සේගෙන් මේ කරුණ විචාරන්නමෝ යම් පරිද්දෙකින් භාග්‍යවතුන් වහන්සේ අපට විසඳන සේක් ද, එපරිද්දෙන් එය දරන්නෙමු”යි තෙල කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "නිදුකානෙනි, එසේ ය යි ඒ රජවරු පසේනදි කොසොල්රජහට පිළිතුරු දුන්හ. ඉක්බිති පසේනදි කොසොල්රජ ප්‍රමුඛ කොට ඇති ඒ පස් රජහු භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්හ. එකත්පසෙක හුන් පසේනදි කොසොල් රජ තෙමේ භාග්‍යවතුන් වහන්සේට තෙල සැළ කළේ ය. වහන්ස, මෙහි පස්කම්ගුණෙන් පිණාගියා වූ එයින් යුක්ත වූ ඉඳුරන් හසුරුවන්නා වූ අප පස් රජුන් අතර කාමවතූන් අතුරෙන් කිමෙක අග්‍ර ද\" යන මේ අතුරු කතාව පහළ විය. ඇතැම් කෙනෙක් කාමවස්තූන් අතුරෙන් රූපයෝ අග්‍රහ යි මෙසේ කීහ. ඇතැම් කෙනෙක් ශබ්දයෝ … කාමවස්තූන් අතුරෙන් ස්ප්‍රෂ්ටව්‍යයෝ අග්‍රහ යි මෙසේ කී හ. වහන්ස, කාමවස්තූන් අතුරෙන් කිමෙක් අග්‍ර ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, මම වනාහි පඤ්චකාමගුණයන් අතුරෙන් මනාපය කෙළවර කොට ඇත්තේ අග්‍රය යි කියමි. මහරජ, ඒ රූපයෝ ම ඇතැමකුට මනාප වෙත්. ඒ රූපයෝ ම ඇතැමකුට අමනාප වෙත්. යමෙක් යම් රූපවලින් සතුටු සිත් ඇත්තේ පිරිපුන් සඞ්කල්ප ඇත්තේ වේ ද, හෙ තෙමේ ඒ රූපයන්ට වඩා ඉතා උසස් වූ හෝ ඉතා ප්‍රණීත වූ හෝ අන් රූපයක් නො පතයි. ඔහුට ඒ රූපයෝ උතුම් වෙත්. ඔහුට ඒ රූපයෝ අනුත්තර වෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, ඒ ශබ්දයෝ ම … මහරජ, ඒ ගන්ධයෝ ම … මහරජ, ඒ රසයෝ ම … මහරජ, ඒ ස්ප්‍රෂ්ටව්‍යයෝ ම ඇතමකුට මනාප වෙත්. ඒ ස්ප්‍රෂ්ටව්‍යයෝ ම ඇතැමකුට අමනාප වෙත්. යමෙක් යම් ස්ප්‍රෂ්ටව්‍යයන්ගෙන් සතුටු සිත් ඇත්තේ පිරිපුන් සඞ්කල්ප ඇත්තේ වේ ද, හෙ තෙමේ ඒ ස්ප්‍රෂ්ටව්‍යයන්ට වඩා ඉතා උසස් වූ හෝ ඉතා ප්‍රණීත වූ හෝ අන් ස්ප්‍රෂ්ටව්‍යයක් නො පතයි. ඔහුට ඒ ස්ප්‍රෂ්ටව්‍යයෝ උතුම් වෙත්. ඔහුට ඒ ස්ප්‍රෂ්ටව්‍යයෝ අනුත්තර වෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි චන්දනඬ්ගලික උපාසක තෙමේ ඒ පිරිස්හි හුන්නේ වේ. ඉක්බිති චන්දනඬ්ගලික  උපාසක තෙමේ හුනස්නෙන් නැගිට උතුරුසළුව එකස් කොට භාග්‍යවතුන් වහන්සේ වෙත ඇඳිලි බැඳ භාග්‍යවතුන් වහන්සේට “භාග්‍යවතුන් වහන්ස, මට වැටහෙයි, සුගතයන් වහන්ස, මට වැටහේ ය” යි තෙල සැළ කෙළේ ය:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“චන්දනඬ්ගලික , තොපට වැටහේවා” යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති චන්දනඬ්ගලික උපාසක තෙමේ භාග්‍යවතුන් වහන්සේ ඉදිරියෙහි ඊට සුදුසු ගාථායෙන් ස්තුති කළේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "153"
            },
            {
                "format": 13,
                "text": "සුවඳ ඇති රත් පියුම අලුයම පිපුනේ යම්සේ පහ නො වූ සුවඳ ඇත්තේ වන්නේ ද, එසෙයින් අහසෙහි බබලන හිරු මෙන් විරාජමාන වූ බුදුරජානන් වහන්සේ බලව.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති ඒ පස් රජහු උතුරුසළු පසෙකින් චන්දනඬ්ගලික උපාසකයා හැඳවූහ. ඉක්බිති චන්දනඬ්ගලික උපාසක තෙමේ ඒ උතුරුසළු පසින් භාග්‍යවතුන් වහන්සේ පිදී ය.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 2. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දෝණපාක සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "124.** සැවැත්නුවර - **",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකල්හි පසේනදි කොසොල් රජ තෙමේ තිඹක්සාලෙහි බත අනුභව කෙරෙයි. ඉක්බිති පසේනදි කොසොල් රජ තෙමේ අනුභව කළේ මහත් කොට සුසුම් හෙළන සුලු වූයේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්නේ ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ ඒ පසේනදි කොසොල් රජු, අනුභව කළහු, මහත් කොට සුසුම් හෙළන්නහු දැන ඒ වේලාවෙහි මේ ගාථාව වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "හැම කල්හි සිහි ඇති, ලද බොජුන්හි පමණ දන්නා ඒ මිනිසාගේ (දුඃඛ) වේදනාවෝ තුනී වෙත්. (වැළඳු අහර) සෙමෙන් දිරයි. ආයුෂ රක්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි සුදස්සන මාණවක තෙමේ කොසොල් රජු පිටිපස සිටියේ වෙයි. ඉක්බිති පසේනදි කොසොල් රජ තෙමේ සුදස්සන මාණවකයා ඇමතී ය. දරුව, සුදස්සන, එව තෝ භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ ගය පිරිවහා මා බත් වළඳන කල්හි කියව. මම ද තට දවස් පතා කහවණු සියයක් නිත්‍ය භික්ෂාවක් (=වැටුපක්) පවත්වන්නෙමි යි. එසේ ය, දේවයන් වහන්සැ යි සුදස්සන මාණවක තෙමේ පසේනදී කොසොල් රජහට පිළිවදන් දී භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ ගාථාව පිරිවහා පසේනදි කොසොල් රජ බත් වළඳන කල්හි කියයි:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“හැම කල්හි සිහි ඇති, ලද බොජුන්හි පමණ දන්නා ඒ මිනිසාගේ (දුඃඛ) වේදනාවෝ තුනී වෙත්. (වැළඳු අහර) සෙමෙන් දිරයි. ආයුෂ රක්නේයි.”",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති පසේනදි කොසොල් රජ තෙමේ පිළිවෙළින් සහල් නැළියක බත වැඩි ම ආහාරය කොට ඇති බැව්හි සිටියේ ය. ඉක්බිති පසේනදි කොසොල් රජ තෙමේ පසු කලෙක සැහැල්ලු සිරුරු ඇත්තේ අතින් ශරීරාවයවයන් පිරිමදනේ ඒ වේලාවෙහි “ඒ භාග්‍යවතුන් වහන්සේ මෙලොව අභිවෘද්ධියෙන් ද, පරලොව අභිවෘද්ධියෙන් ද යන උභයාර්ථයෙන් ම මට අනුකම්පා කළ සේකැ” යි මේ ප්‍රීති වාක්‍යය පහළ කළේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "155"
            },
            {
                "type": "centered",
                "text": "3. 2. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පඨමසඞ්ගාම සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "125. **සැවැත්නුවර -** ",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකල්හි මගධේශ්වර වූ වේදේහිපුත්‍ර අජාසත්තු රජ තෙමේ සිවුරඟ සෙනග (සන්නාහ) සන්නද්ධ කොට ගෙණ පසේනදි කොසොල් රජුට විරුද්ධ ව යුධ පිණිස කසී ගම කරා ඉදිරියට ගියේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "පසේනදි කොසොල් රජ තෙමේ “මගධෙශ්වර වූ වෙදෙහිපුත්‍ර අජාතසත්තු රජ සිවුරඟ සෙනඟ සරසා ගෙන මට විරුද්ධ ව යුධ පිණිස කසී ගම කරා පැමිණියේ ය”යි ඇසී ය. ඉක්බිති පසේනදි කොසොල් රජ තෙමේ සිවුරඟ සෙනඟ සරසවා ගෙණ මගධේශ්වර වූ වේදේහිපුත්‍ර අජාතසත්තුරජුට විරුද්ධ ව කසී ගම කරා යුධ පිණිස ඉදිරියට ගියේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මගධේශ්වර වූ වේදේහිපුත්‍ර අජාතසත්තුරජ තෙමේ ද, පසේනදි කොසොල්රජ තෙමේ ද යුධ කළ හ. ඒ යුදෙහි දී මගධේශ්වර වූ වේදේහිපුත්‍ර අජාතසත්තුරජ තෙමේ පසේනදි කොසොල්රජු පැරදවී ය. පැරදුනු පසේනදි කොසොල්රජ තෙමේ ස්වකීය රාජධානිය වූ සැවැත්නුවර ම පෙරළා ගියේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති බොහෝ භික්ෂූහු පෙරවරු හැඳ පොරොව පා සිවුරු ගෙණ සැවැත්නුවරට පිඬු පිණිස පිවිසියහ.  සැවැත්නුවර පිඬු පිණිස හැසිර පසුබත් පිණ්ඩපාතයෙන් වැළකුනාහු  භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ  භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්හ. එකත්පසෙක හුන් ඒ භික්ෂූහු  භාග්‍යවතුන් වහන්සේට මෙය සැළ කළහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, මෙහි මගධේශ්වර වූ වේදේහිපුත්‍ර අජාතසත්තු රජ තෙමේ සිවුරඟ සෙනඟ සරසා ගෙණ පසේනදි කොසොල් රජුට විරුද්ධව යුධ පිණිස කසීගම කරා ඉදිරියට ගියේ ය. වහන්ස, පසේනදි කොසොල් රජ තෙමේ “මගධේශ්වර වූ වේදේහිතපුත්‍ර අජාතසත්තු තෙමේ මට විරුද්ධව යුධ පිණිස සිවුරඟ සෙනඟ සරසා ගෙණ කසීගම කරා ඉදිරියට ගියේ ය”යි ඇසී ය. වහන්ස, ඉක්බිති පසේනදි කොසොල් රජ තෙමේ සිවුරඟ සෙනඟ සරසා ගෙණ මගධේශ්වර වූ වේදේහිපුත්‍ර අජාතසත්තු රජුට විරුද්ධ ව යුධ පිණිස කසීගම කරා ඉදිරියට ගියේ ය. වහන්ස, එකල්හි මගධේශ්වර වූ වේදේහිපුත්‍ර අජාතසත්තුරජ තෙමේ ද, පසේනදි කොසොල් රජ තෙමේ ද යුද කළ හ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, ඒ යුදෙහි දී මගධේශ්වර වූ වේදේහිපුත්‍ර අජාතසත්තුරජ තෙමේ පසේනදි කොසොල් රජ පැරද වීය. වහන්ස, පැරදුන පසේනදි කොසොල් රජ තෙමේ සිය රාජධානිය වූ සැවැත්නුවරට ම පෙරළා ගියේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මගධේශ්වර වූ වේදේහිපුත්‍ර අජාතසත්තුරජ තෙමේ පවිටු මිතුරන් ඇත්තේ ය. පවිටු යහළුවන් ඇත්තේ ය. පවිටන් කෙරෙහි නැමුනේ ය. මහණෙනි, පසේනදි කොසොල් රජ තෙමේ කලණ මිතුරන් ඇත්තේ ය. කලණ යහළුවන් ඇත්තේ ය. කලණයන් කෙරෙහි නැමුනේ ය. මහණෙනි, පසේනදි කොසොල්රජ තෙමේ පැරදුනේ අද මේ රැයත් දුක සේ හොවින්නේ ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "දිනන්නේ වෛරී ජනයා ලබයි. පැරදුනේ දුක සේ වෙසෙයි. දිනුම් පැරදුම් දෙක හැර සන්සිදුනේ සුව සේ වෙසෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "157"
            },
            {
                "type": "centered",
                "text": "3.2.5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතීයා සඞ්ගාම සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "126. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකල්හි මගධේශ්වර වූ වේදේහිපුත්‍ර අජාතසත්තු රජ තෙමේ සිවුරඟ සෙනඟ සරසා ගෙණ පසේනදි කොසොල් රජුහට විරුද්ධ ව කසීගම කරා ඉදිරියට ගියේ ය. පසේනදි කොසොල් තෙමේ “මගධේශ්වර වූ වේදේහිපුත්‍ර අජාතසත්තු රජ තෙමේ සිවුරඟ සෙනඟ සරසා ගෙණ මට විරුද්ධ ව කසීගම කරා ඉදිරියට පැමිණියේ යැ යි” ඇසීය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති පසේනදි කොසොල්රජ තෙමේ සිවුරඟ සෙනඟ සරසා ගෙණ මගධේශ්වර වූ වේදේහිපුත්‍ර අජාසත්තු රජුහට විරුද්ධ ව කසීගම කරා ඉදිරියට ගියේ ය. එකල්හි මගධාධිපති වූ වේදේහිපුත්‍ර අජාතසත්තු රජ තෙමේ ද පසේනදි කොසොල්රජ තෙමේ ද යුද කළහ. ඒ යුදෙහි දී පසේනදි කොසොල්රජ තෙමේ මගධාධිපති වූ වේදේහිපුත්‍ර අජාතසත්තු රජු පැරද විය. ජීවග්‍රාහයෙන් ද ඔහු අල්ලා ගත්තේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි පසේනදි කොසොල් රජහට මේ අදහස විය: මගධේශ්වර වූ වේදේහිපුත්‍ර අජාතසත්තු රජ තෙමේ කිසිසේත් ද්‍රෝහ නො කරණ මට ද්‍රෝහ කෙරෙයි. එතකුදු වුවත් මාගේ බෑනනුවෝ වෙති. මම මගධේශ්වර වූ වේදේහිපුත්‍ර අජාතසත්තු රජහුගේ සියලු ඇත්සෙනඟ පැහැර ගෙණ , සියලු අස්සෙනඟ පැහැර ගෙණ, සියලු රිය සෙනඟ පැහැර ගෙණ, සියලුපාබල සෙනඟ පැහැර ගෙණ ඔහු ජීවත් වන්නහු ම මුදා හරණෙම් නම් මැනව යි කියා යී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති පසේනදි කොසොල්රජ තෙමේ මගධේශ්වර වූ වේදේහිපුත්‍ර අජාතසත්තු රජුගේ සියලු ඇත් සෙනඟ පැහැර ගෙණ  … ඔහු ජීවත්වන්නහු ම මුදා හළේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති බොහෝ භික්ෂූහු පෙරවරු හැඳ පොරොවා පාසිවුරු ගෙණ සැවැත්නුවරට පිඬු පිණිස පිවිසියහ.  සැවැත්නුවර පිඬු පිණිස හැසිර පසුබත පිණ්ඩපාතයෙන් වැළකුනාහු  භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ  භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්හ. එකත්පසෙක හුන් ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙය සැළ කළහ:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, මෙහි මගධේශ්වර වූ වේදේහිපුත්‍ර අජාතසත්තු රජ තෙමේ සිවුරඟ සෙනඟ සරසා ගෙණ පසේනදි කොසොල්රජුට විරුද්ධව යුධ පිණිස කසීගම කරා ඉදිරියට ගියේ ය. වහන්ස, පසේනදි කොසොල් රජ තෙමේ …  කසීගම කරා ඉදිරියට පැමිණියේ ය යි ඇසී ය. වහන්ස, ඉක්බිති පසේනදි කොසොල්රජ තෙමේ සිවුරඟ සෙනඟ සරසා ගෙණ මගධාධිපති වේදේහිපුත්‍ර අජාතසත්තු රජුට විරුධ ව යුධ පිණිස කසීගම කරා ඉදිරියට ගියේ ය. වහන්ස, ඉක්බිති මගධේශ්වර වූ වේදේහිපුත්‍ර අජාතසත්තු රජ තෙමේ ද, පසේනදි කොසොල් රජ තෙමේ ද යුධ කළ හ. වහන්ස, ඒ යුදෙහි දි පසේනදි කොසොල් රජ තෙමේ මගධේශ්වර වූ වේදේහිපුත්‍ර අජාතසත්තු රජු පැරද විය. ඔහු ජීවග්‍රාහයෙන් ද අල්ලා ගත්තේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "159"
            },
            {
                "format": 13,
                "text": "වහන්ස, ඉක්බිති පසේනදි කොසොල් රජහට මේ අදහස විය: “මගධාධිපති වේදේහිපුත්‍ර මේ අජාතසත්තුරජ තෙමේ කිසිසේත් ද්‍රෝහ නො කරන්නා වූ මට ද්‍රෝහ කෙරෙයි. එතෙකුදු වුවත් මාගේ බෑනනුවෝ වෙති. මම මගධේශ්වර වූ වේදේහිපුත්‍ර අජාතසත්තු රජහුගේ සියලු ඇත්සෙනඟ පැහැර ගෙණ , සියලු අස්සෙනඟ පැහැර ගෙණ, සියලු රියසෙනඟ පැහැර ගෙණ, සියලු පාබල සෙනඟ පැහැර ගෙණ ඔහු ජීවත්වන්නහු ම මුදා හරණෙම් නම් මැනවැ” යි කියා යි. වහන්ස, ඉක්බිති පසේනදි කොසොල් රජ තෙමේ මගධේශ්වර වූ වේදේහිපුත්‍ර අජාතසත්තුරජුගේ සියලු ඇත්සෙනඟ පැහැර අල්ලා ගෙණ, සියලු අස්සෙනඟ පැහැර අල්ලා ගෙණ, සියලු රිය සෙනඟ පැහැර අල්ලා ගෙණ, සියලු පාබලසෙනඟ පැහැර අල්ලා ගෙණ ඔහු ජීවත් වන්නහු ම මුදා හළේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ මේ කරුණ දැන ඒ වේලාවෙහි දී මේ ගාථා වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යම් තාක් ඔහුට හැකි වේ ද, (ඒ තාක්) පුරුෂ තෙමේ වනසා ම ය. යම් කලෙක අන්‍යයෝ (තමා) නසද්ද, එකල්හි ඒ (මෙරමා) නැසූ පුද්ගල තෙමේ (මෙරමා විසින්) නසනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යම් තාක් පාපය විපාක නො දේ ද, (ඒ තාක්) අඥාන තෙමේ (සතුටට) කරුණකැ යි හැඟී. යම් කලෙකත් පාපය විපාක දේ ද, එකල්හි අඥාන තෙමේ දුකට පැමිණේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "(මෙරමා) නසන්නා (තමා) නසන්නකු ලබයි, (මෙරමා) දිනන්නා (තමා) දිනන්නකු ලබයි. ආක්‍රෝශ කරන්නා ආක්‍රෝශ කරන්නකු ලබයි. කිපෙන්නා කිපෙන්නකු ලබයි. තව ද කර්මය මිහි කිරීමෙන් ඒ (මෙරමා) නැසූ පුද්ගල තෙමේ (මෙරමා විසින්) නසනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 2. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ධීතු සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "127.  **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "ඉක්බිති පසේනදි කොසොල් රජ තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ  වැඳ එකත්පසෙක හුන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි එක්තරා පුරුෂයෙක් පසේනදි කොසොල් රජු වෙත එළඹියේ ය. එළඹ පසේනදි රජහට “දේවයන් වහන්ස, මල්ලිකාදේවී තොමෝ දුවක වැදුවා ය”යි කණ ලඟ සැළ කළේ ය. එසේ කී කල්හි පසේනදි කොසොල් රජ නො සතුටු සිත් ඇත්තේ විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි භාග්‍යවතුන් වහන්සේ පසේනදි කොසොල් රජු නොසතුටු සිත් ඇත්තහු දැන ඒ වේලාවෙහි මේ ගාථා වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "රජතුමනි, ඇතැම් ස්ත්‍රිය ද ශ්‍රේෂ්ඨ ය. (එහෙයින්) පොෂණය කරුණු මැන. නුවණැති සිල්වත් නැදිමයිලන් දෙවි කොට වෙසෙන පතිවත රක්නා (යම් ස්ත්‍රියක් වේ ද,)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "දිශාවන්ට අධිපති රජතුමනි, ඇයට යම් පුතෙක් උපදී ද, (හෙ තෙමේ) දක්ෂයෙක් වෙයි. එබඳු යහපත් තැනැත්තියගේ පුත්‍ර තෙමේ රාජ්‍යානුශාසනා ද කෙරෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "161"
            },
            {
                "type": "centered",
                "text": "3. 2. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අප්පමාද සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "128. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් පසේනදි කොසොල් රජ තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. වහන්ස, යම් දහමෙක් මෙලොව අභිවෘද්ධියත් පරලොව අභිවෘද්ධියත් යන දෙවැදෑරුම් අභිවෘද්ධිය ම අත්පත් කොට ගෙණ සිටී නම් එබඳු එක් දහමෙක් ඇද්ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, යම් දහමෙක් මෙලොව අභිවෘද්ධියත් පරලොව අභිවෘද්ධියත් යන දෙවැදෑරුම් අභිවෘද්ධිය ම අත්පත් කොට ගෙණ සිටී නම් එබඳු එක් දහමෙක් ඇත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, යම් දහමෙක් මෙලොව අභිවෘද්ධියත් පරලොව අභිවෘද්ධියත් යන දෙවැදෑරුම් අභිවෘද්ධිය ම අත්පත් කොට ගෙණ සිටී නම් එබඳු එක් දහම කිමෙක් ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, යම් දහමෙක් මෙලොව අභිවෘද්ධියත් පරලොව අභිවෘද්ධියත් යන දෙවැදෑරුම් අභිවෘද්ධිය ම අත්පත් කොට ගෙණ සිටී නම් එබඳු එක් දහම අප්‍රමාදය යි. මහරජ, ඇවිදින ප්‍රාණින්ගේ යම් කිසි පා සටහන්හු වෙත් නම් ඒ සියල්ලෝ යම්සේ ඇත්පියෙහි ඇතුළත වීමට යෙද්ද, යම් ඒ මහත්වයෙන් ඇත්පිය ඔවුන්ට අග්‍ර ය යි කියනු ලැබේද, මහරජ, එසෙයින් ම යම් දහමෙක් මෙලොව අභිවෘද්ධියත් පරලොව අභිවෘද්ධියත් යන දෙවැදෑරුම් අභිවෘද්ධිය ම අත්පත් කොට ගෙණ සිටී නම් අප්‍රමාදය ඒ එක් දහම යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ආයුෂ, නීරොගබව ද, ශරීර වර්ණය ද, ස්වර්ගය ද, උසස්කුල ඇති බව ද, උදාර වූ අන්‍යොන්‍ය වූ සිත් අලවන දෑ ද පතන්නහු විසින් පුණ්‍ය ක්‍රියාවන්හි නොපමාවීම නුවණැත්තෝ පසසත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙලොව යම් අභිවෘද්ධියෙකුත් වේ ද, පරලොව යම් අභිවෘද්ධියෙකුත් වේ ද, පණ්ඩිත තෙමේ නො පමා වූයේ ඒ දෙවැදෑරුම් අභිවෘද්ධිය ම ලබයි. ධෘතිසම්පන්න පුද්ගල තෙමේ අර්ථප්‍රතිලාභය හේතු කොට ගෙණ පණ්ඩිත ය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 2. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කල්‍යාණමිත්ත සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "129. **සැවැත්නුවර - **",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකත්පසෙක හුන් පසේනදි කොසොල්රජ තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැල කළේ ය. වහන්ස,මෙහි රහසිගත ව එකලාව හුන් මා සිත්හි “භාග්‍යවතුන් වහන්සේ විසින් ධර්මය මැනවින් වදාරණ ලදී. හෙ ද කලණ මිතුරන් ඇත්තහුට ය. කලණ යහළුවන් ඇත්තහුට ය. කලණයන් කෙරෙහි නැමුනහුට ය. පවිටු මිතුරන් ඇත්තහුට නො වේ. පවිටු යහළුවන් ඇත්තහුට නො වේ. පවිටන් කෙරෙහි නැමුනහුට නො වේ” යන මෙබඳු චිත්ත විතර්කයෙක් පහළ විය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "163"
            },
            {
                "format": 13,
                "text": "මහරජ, තෙල එසේ ය. මහරජ, තෙල එසේ ය. මහරජ, මා විසින් ධර්මය ස්වාක්ඛාත ය. එ ද කලණ මිතුරන් ඇත්තහුට ය. කලණ යහළුවන් ඇත්තහුට ය. කලණයන් කෙරෙහි නැමුනහුට ය. පවිටු මිතුරන් ඇත්තහුට නො වේ. පවිටු යහළුවන් ඇත්තහුට නො වේ. පවිටන් කෙරෙහි නැමුනහුට නො වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, එක් කලෙක මම ශාක්‍ය දනව්වෙහි ශාක්‍යයන්ගේ නාගරක නම් නියම්ගම්හි වෙසෙමි. මහරජ, එකල අනඳ මහණ තෙමේ මා වෙත එළඹියේ ය. එළඹ මා වැඳ එකත්පසෙක හුන්නේ ය. මහරජ, එකත්පසෙක හුන් අනඳ මහණ තෙමේ මට “වහන්ස, යම් මේ කල්‍යාණමිත්‍රත්වයෙක් කල්‍යාණසහායත්වයෙක් කල්‍යාණසම්ප්‍රවඬ්කත්වයෙක් වේ ද, මෙය මගබඹසර පිලිබඳ හරි අඩෙකැ”යි මෙය සැළ කෙළේ ය. මහරජ, එසේ කියන ලද මම අනඳ මහණට මෙය කියමි. ආනන්ද, එසේ නො කිය, ආනන්ද, එසේ නො කිය, ආනන්ද, යම් මේ කලණ මිතුරන් ඇතිබවෙක් කලණ යහළුවන් ඇතිබවෙක් කලණයන් කෙරෙහි නැමුනුබවෙක් වේ ද, මෙය මුළු මගබඹසර ම ය. ආනන්ද, “අරිඅටගිමග වඩන්නේ ය. අරිඅටගිමග බහුල කරන්නේ\" ය යන මෙය කලණ මිතුරන් ඇති කලණ යහළුවන් ඇති කලණයන් කෙරෙහි නැමෙන මහණහු විසින් කැමති විය යුතු යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ආනන්ද, කලණ මිතුරන් ඇති කලණ යහළුවන් ඇති කලණයන් කෙරෙහි නැමෙන මහණ තෙමේ කෙසේ නම් අරිඅටගිමග වඩා ද? අරිඅටගිමග බහුල කෙරේ ද? යත්: ආනන්ද, මෙහි මහණ තෙමේ විවේකය ඇසුරු කළ විරාගය ඇසුරු කළ නිරෝධය ඇසුරු කළ නිවණට නමන සුලු සම්‍යක් දෘෂ්ටිය වඩයි … සම්‍යක්සඞ්කල්පය වඩයි … සම්‍යක්වචනය වඩයි … සම්‍යක්කර්මාන්තය වඩයි …  සම්‍යක් ආජීවය වඩයි … සම්‍යක් ස්මෘතිය වඩයි. විවේකය ඇසුරු කළ විරාගය ඇසුරු කළ නිරෝධය ඇසුරු කළ නිවණට නමන සුලු සම්‍යක්සමාධිය වඩයි. ආනන්ද, කලණ මිතුරන් ඇති කලණ යහළුවන් ඇති කලණයන් කෙරෙහි නැමෙන මහණ තෙමේ මෙසේ අරිඅටගිමග වඩයි, අරිඅටගිමග බහුල කෙරෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ආනන්ද, යම් මේ කල්‍යාණමිත්‍රත්වයෙක් කල්‍යාණසහායත්වයෙක් කල්‍යාණසම්ප්‍රවඬ්කත්වයෙක් වේ නම් මෙය යම්සේ මුළු බඹසර වේ ද, එය මේ ක්‍රමයෙන් ද දත යුතු යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ආනන්ද, කල්‍යාණමිත්‍ර වූ මා නිසා ම ඉපදීම ස්වභාව කොට ඇති සත්වයෝ ඉපදීමෙන් මිදෙත්. දිරීම ස්වභාව කොට ඇති සත්වයෝ දිරීමෙන් මිදෙත්. මරණය ස්වභාව කොට ඇති සත්වයෝ මරණයෙන් මිදෙත්. ශෝකය වැලපීම දුක් දොම්නස් දැඩිආයාස ස්වභාව කොට ඇති සත්වයෝ ශෝකපරිදෙව දුක්දොම්නස් උපායාසයන්ගෙන් මිදෙත්. ආනන්ද, යම් මේ කල්‍යාණමිත්‍රත්වයෙක් කල්‍යාණසහායත්වයෙක් කල්‍යාණසම්ප්‍රවඬ්කත්වයෙක් වේ නම් මෙය යම්සේ මුළු බඹසර වේ ද, එය මේ ක්‍රමයෙනුදු දත යුතු යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, එහෙයින් මෙහි ලා තොප විසින් මෙසේ හික්මිය යුතු යි. “කලණමිතුරන් ඇත්තෙක් කලණයහළුවන් ඇත්තෙක් කලණයන් කෙරෙහි නැමෙන්නෙක් වන්නෙමි”යි. මහරජ, මෙසේ ම තොප විසින් හික්මිය යුතු යි. මහරජ, කලණමිතුරන් ඇති කලණයහළුවන් ඇති කලණයන් කෙරෙහි නැමුන තොප විසින් කුශලධර්මයන්හි අප්‍රමාදය වූ මේ එක ම ධර්මය ඇසුරු කොට විසිය යුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "165"
            },
            {
                "format": 13,
                "text": "මහරජ, අප්‍රමත්ත ව අප්‍රමාදය ඇසුරු කොට වසන්නා වූ තොපගේ ඇතොවුරට (අන්තඃපුරස්ත්‍රීන්ට) ද “රජ තෙමේ අප්‍රමාදය ඇසුරු කොට අප්‍රමත්ත ව වාසය කෙරෙයි. එබැවින් අපි දූ අප්‍රමාදය ඇසුරු කොට අප්‍රමත්ත ව වෙසෙමු”යි මෙසේ අදහස් වන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, අප්‍රමාදය ඇසුරු අප්‍රමත්ත ව වාසය කරන්න වූ තොපගේ අනුයුක්ත (සහකාර) ක්ෂත්‍රියයන්ට ද “අපගේ රජ තෙමේ අප්‍රමාදය ඇසුරු කොට අප්‍රමත්ත ව වාසය කෙරෙයි. එබැවින් අපි දූ අප්‍රමාදය ඇසුරු කොට අප්‍රමත්ත ව වෙසෙමු”යි මෙසේ අදහස් වන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, අප්‍රමාදය ඇසුරු අප්‍රමත්ත ව වාසය කරන්නා වූ තොපගේ බලසෙනගට ද “රජ තෙමේ අප්‍රමාදය ඇසුරු කොට අප්‍රමත්ත වෙසෙයි. එබැවින් අපි දූ අප්‍රමාදය ඇසුරු කොට අප්‍රමත්ත ව වෙසෙමු”යි මෙසේ අදහස් වන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, අප්‍රමාදය ඇසුරු අප්‍රමත්ත ව වාසය කරන්න වූ තොපගේ නියම්ගම්දනව්වැස්සන්ට ද “රජ තෙමේ අප්‍රමාදය ඇසුරු කොට අප්‍රමත්ත වෙසෙයි. එබැවින් අපි දු අප්‍රමාදය ඇසුරු කොට අප්‍රමත්ත ව වෙසෙමු”යි මෙසේ අදහස් වන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, අප්‍රමාදය ඇසුරු අප්‍රමත්ත ව වෙසෙන තොප විසින් තෙමේත් ගෝපනය කරණ ලද්දේ වන්නේ ය. අතොවුර ද ගෝපනය කරණ ලද්දේ රක්නා ලද්දේ වන්නේ ය. ධනගබඩා හා කොටුගුල් ද ගෝපනය කරණ ලද්දේ රක්නා ලද්දේ වන්නේ ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහත් වූ නන්වැදෑරුම් සැපත් පතන්නහු විසින් නොපමා වියයුතු යි. පණ්ඩිතයෝ කුශලක්‍රියාවන්හි අප්‍රමාදය පසසත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අප්‍රමත්ත වූ පණ්ඩිත තෙමේ දිටුදැමියෙහි යම් අර්ථයෙක් වේ ද, පරලෙව්හි යම් අර්ථයෙක් වේ ද මේ උභයාර්ථය ලබයි. මේ උභයාර්ථලාභයෙන් නුවණැත්තේ පණ්ඩිත යයි කියනු ලැබේ. ",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 2. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පඨම අපුත්තක  සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "130. **සැවැත්නුවර - **",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි පසේනදි කොසොල්රජ තෙමේ දෙවෙන් දවහල්හි (මධ්‍යාහ්නයෙහි) භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් පසේනදි කොසොල්රජ හට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “මහරජ, දැන් තෙපි දෙවන් දවහල කොට සිට එවූ දැ”යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "167"
            },
            {
                "format": 13,
                "text": "වහන්ස, මෙහි සැවැත්නුවර සිටුගැහැවි තෙමේ කලුරිය කළේ ය. මම අපුත්‍රක වූ ඒ ධනය ඇතුළු රජගෙට ගෙන්වා තබා එමි. වහන්ස, (එහි) රන්මිල ම අසූලක්ෂයෙකි. රිදී ගැණ කියනු කිම? (එහෙත්) වහන්ස, ඒ සිටුගැහැවිහුගේ බත් වැළඳීම මෙබඳු විය: කාඩි දෙවැනි කොට ඇති නිවුඩුහාලේ බත් බුදියි. වස්ත්‍රපරිභෝගය මෙබඳු විය: කැබැලි තුනක් සැමැන්හු හණවැහැරියක් දරයි. යානපරිභෝගය මෙබඳු වි ය: දරණ ලබන පත්කුඩයෙකින් යුත් දැදුරු වූ කුඩාරියෙකින් යයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, තෙල එසේ ය. මහරජ, තෙල එසේ ය. මහරජ, අසත් (ලාමක) පුරුෂ තෙමේ මහත් භෝග ලැබ (ද) තමා නො ම සුඛිත කෙරෙයි. නො ම පිණවයි. මවුපියන් සුඛිත නො කෙරෙයි නො පිණවයි. අඹුදරුවන් සුඛිත නො කෙරෙයි නො පිණවයි. දස්කම්කරු පුරුෂයන් සුඛිත නො කෙරෙයි. නො පිණවයි. මිත්‍රයන් හා සහකාරයන් සුඛිත නො කෙරෙයි. නො පිණවයි. මහණබමුණන් කෙරෙහි මතුමත්තෙහි සුව දෙන ස්වර්ගයට හිත සුඛවිපාක ඇති ස්වර්ගය පිණිස පවත්නා දක්ෂිණාව නො පිහිටුවයි. (නොදෙයි). මෙසේ මැනවින් පරිභෝග නොකරණ ඔහුගේ ඒ ධනය රජහු හෝ හැර ගණිත්. සොරු හෝ පැහැර ගණිත්. ගින්න හෝ දවයි. ජලය හෝ නඟයි. අප්‍රිය වූ දායාදයෝ (දූදරු පරපුර) හෝ හැර ගණිත්. මහරජ, මෙසේ ඔහු විසින් මැනවින් පරිභෝග නොකරණු ලබන එ භෝගයෝ විනාශයට පැමිණෙත්. පරිභෝගයට නො පැමිණෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, යම්සේ අමනුෂ්‍යයන් විසින් අධිගෘහිත වූ තැනෙක පහන් දිය ඇති සිහිල්දිය ඇති මිහිරිදිය ඇති හෙළ රළරැලි ඇති මනා තොට ඇති සිත්කලු පොකුණෙක් වේ නම් ජන තෙමේ ඒ දිය නො ම හරණේ ය. නො බොන්නේ ය. නො නහන්නේ ය. පසවැටෙන සෙයින් හෝ නො කරන්නේ ය. මහරජ, එසේ ඒ දිය මැනවින් පරිභෝග නොlකරණු ලබන්නේ සිඳ යන්නේ ය. පරිභෝගයට නො පැමිණෙන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, එමෙන් ම ලාමක පුරුෂ තෙමේ මහත්භෝග ලැබ තමා නොම සුඛිත කෙරෙයි නො පිණවයි. … අප්‍රිය වූ  දායාදයෝ හෝ හැර ගණිත්. මෙසේ ඔහු විසින් මැනවින් පරිභෝග නොකරණු ලබන්නා වූ ඒ භෝගයෝ විනාශයට පැමිණෙත්. පරිභෝගයට නො පැමිණෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, සත්පුරුෂ තෙමේ මහත් භෝග ලැබ තමා සුඛිත කෙරෙයි, පිණවයි. මවුපියන් සුඛිත කෙරෙයි, පිණවයි. අඹුදරුවන් සුඛිත කෙරෙයි, පිණවයි. දස්කම්කරු පුරුෂයන් සුඛිත කෙරෙයි, පිණවයි. මිත්‍රයන් හා සහකාරයන් සුඛිත කෙරෙයි, පිණවයි. මහණබමුණන් කෙරෙහි මතු මත්තෙහි සුව ගෙණ දෙන ස්වර්ගයට හිත සුඛවිපාක ඇති ස්වර්ගය පිණිස පවත්නා දක්ෂිණාව පිහිටුවයි. මෙසේ මැනවින් පරිභෝග කරණු ලබන ඔහුගේ ඒ භෝගයන් රජහු නොම හැර ගණිත්. සොරු නො පැහැර ගණිත්. ගින්න නො දවයි. ජලය නො නඟයි. අප්‍රිය වූ දායාදයෝ නො හැර ගණිත්. මහරජ, මෙසේ මැනවින් පරිභෝග කරණු ලබන ඒ භෝගයෝ පරිභෝගයට යෙති. සිඳීමට නො යෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, යම්සේ ගමක් හෝ නියම්ගමක් අසල පහන්දිය ඇති සිහිල් දිය ඇති මිහිරිදිය ඇති සුදු රළරැලි ඇති මනා තොට ඇති සිත්කලු පොකුණෙක් වේ නම් ජන තෙමේ ඒ දිය ගෙණ යන්නේත්, බොන්නේත්, නහන්නේත් පසවැටෙනසෙයින් හෝ කරන්නේත් වේ. මහරජ, මෙසේ පරිභෝග කරණු ලබන ඒ ජලය පරිභෝගයට යන්නේ ය. නොසිඳී යන්නේ ය. මහරජ, එපරිද්දෙන් ම නුවණැති සත්පුරුෂ තෙමේ මහත් භෝගයන් ලැබ තමා සුඛිත කෙරෙයි. පිණවයි. … මෙසේ ඒ භෝගයෝ මැනවින් පරිභෝග කරණු ලබන්නාහු පරිභෝගයට යෙති. විනාශයට නො පැමිණෙති.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "169"
            },
            {
                "format": 13,
                "text": "අමනුෂ්‍යයන් විසින් අධිගෘහිත වූ තැනෙක සිහිල් ජලයෙක් වේ ද, එය පානය නොකරණු ලබන්නේ වියලීමට යේ ද, එසේ ලාමක පුරුෂ තෙමේ ධනය ලැබ තෙමේත් නොම පරිභෝග කෙරෙයි. අනුන්ට ද නොදෙයි. ධෘතිසම්පන්න නුවණැති යම් පුරුෂයෙක් වේ ද, හෙ තෙමේ භොගයන් ලැබ අනුභව කෙරෙයි. කටයුතු කරන්නේ ද වෙයි. ඒ ශ්‍රේෂ්ඨ පුරුෂ තෙමේ නෑ සමූහයා පෝෂණය කොට (ලොකයා විසින්) පසස්නා ලද්දේ දෙව්ලොවට පැමිණෙයි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 2. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය අපුත්තක  සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "131. **සැවැත්නුවර - **",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි පසේනදි කොසොල් රජ තෙමේ දෙවෙන් දවහල භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් පසේනදි කොසොල්රජහට භාග්‍යවතුන් වහන්සේ මහරජ, “දැන් තෙපි මධ්‍යාහනයෙහි කොහි සිට එවු දැ”යි මෙය වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, මේ සැවැත්නුවර සිටු ගැහැවි තෙමේ කාලගත විය. මම ඒ දරුවන් නැති සැපත ඇතුළුරජගෙට නඟා  යවා එමි. වහන්ස, රන්මිල ම සියක්ලක්ෂයෙකි. රිදී ගැණ කියනු කිම? වහන්ස,ඒ සිටුගැහැවිහුගේ බත් වැළඳීම මෙබඳු විය: කාඩි දෙවෙනි කොට ඇති නිවුඩු සහලේ බත බුදියි. වස්ත්‍රපරිභෝගය මෙබඳු විය: සැමැන්නු තුන්කඩක් ඇති හණ වැහැරිවතක් දරයි. රථපරිභෝගය මෙබඳු විය: දරණ ලබන පත්කුඩයක් ඇති දැදුරු වූ කුඩා රියෙකින් ගමන් කරයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, තෙල එසේ ය. මහරජ, තෙල එසේ ය. පෙර වූවක් (කියමි): මහරජ, ඒ සිටු ගැහැවි තෙමේ තගරසිඛී නම් පසේබුදු රජුහු පිණ්ඩපාතයෙන් පැවරී ය. “මහණහුට පිඬු දෙව”යි කියා හුනස්නෙන් නැගිට ගියේ ය. දී පසුව “මේ පිණ්ඩාහාරය දාසයෝ හෝ කම්කරුවෝ හෝ අනුභව කළාහු නම් යහපතැ”යි විපිළිසර ඇත්තේ විය. ධනහේතුවෙන් බෑයාගේ එක ම කුඩාපුතු ද දිවියෙන් තොර කළේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, ඒ සිටු ගැහැවි තෙමේ තගරසිඛී නම් පසේබුදුරජුන් පිණ්ඩපාතයෙන් පැවරී යන යමක් ඇද්ද ඒ කර්මවිපාකයෙන් සත්වරක් සුගති සඞ්ඛ්‍යාත ස්වර්ගලෝකයට (උත්පත්තිවශයෙන්) පැමිණේ ය. ඒ කර්මයාගේ ම විපාකාවශේෂයෙන් මේ සැවැත්නුවර ම සත්වරක් සිටුකම් කරවී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, ඒ සිටු ගැහැවි තෙමේ දී (පසුව): “මේ පිණ්ඩාහාරය දාසයෝ හෝ කම්කරුවෝ හෝ අනුභව කළාහු නම් යහපතැයි” විපිළිසර ඇති වී යන යමක් ඇද්ද, ඒ කර්මයාගේ විපාකය හේතු කොට ගෙණ උදාර වූ බත් වැළදීම පිණිස සිත නො නැමෙයි. උදාර වූ වස්ත්‍රපරිභෝගය පිණිස සිත නො නැමෙයි. උදාර වූ රථපරිභෝගය පිණිස සිත නො නැමෙයි. උදාර වූ පස්කම් සැප අනුභවය පිණිස සිත නො නැමෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "171"
            },
            {
                "format": 13,
                "text": "මහරජ, ඒ සිටු ගැහැවි තෙමේ ධනහේතුවෙන් සොහොයුරාගේ එක ම කුඩාපුතු ද දිවියෙන් තොර කළේ යන යමක් ඇද්ද, ඒ කර්මවිපාකයෙන් බොහෝ ගණන් හවුරුදු බොහෝ සිය ගණන් හවුරුදු බොහෝ දහස් ගණන් හවුරුදු බොහෝ සියදහස් ගණන් හවුරුදු නරකයෙහි පැසුනේ ය. ඒ කර්මයාගේ ම ඉතිරිවිපාකය වශයෙන් මේ සත්වැනි දරුවන් නැති වස්තුසමූහය රාජකොෂ්ටාගාරයට ඇතුළු කෙරෙයි. මහරජ, ඒ සිටු ගැහැවිහුගේ පැරණි පිණ ගෙවී ගියේ ය. අලුත් පිණෙක් ද රැස් නො කරණ ලද්දේය. මහරජ, අද සිටුගැහැවි තෙමේ මහාරෞරව නරකයෙහි පැසේ යයි. වහන්ස, එසේ ද? සිටුගැහැවි තෙමේ මහාරෞරව නරකයට (උත්පත්තිවශයෙන්) පැමිණියේ ද? මහරජ, එසේ ය, සිටු ගැහැවි තෙමේ මහාරෞරව නරකයට පැමිණියේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ධාන්‍ය ද ධන ද රිදී ද රන් ද තමා සතු යම් කිසි අනෙකෙක් ඇත් නම් එ ද දාසයෝ ද කම්කරුවෝ ද මෙහෙකරුවෝද යන ඔහු අනුව ජීවත්වන යම් කෙනෙක් ඇත් නම් ඔහු ද යන සියල්ල නො ගෙණ යායුතුයි. සියල්ල (මෙහි ම) හැර දමා යන සැහැවි ඇත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කයින ද වචනයෙන් ද වැලි සිතින් ද යම් කර්මයකුත් කෙරේ ද එය ම ඔහුට තමා සතු වස්තුව වේ. එය ම රැගෙණ පරලොව යෙයි එය ම අත් නො හැර යන සෙවනැල්ල මෙන් ඔහු අනු ව යන්නේ වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එහෙයින් පරලොවට හිතවූ දෑ රැස් කරන්නේ පින් කරන්නේ ය. පින් පරලෙව්හි දී සත්වයන්ට පිහිට වේ.",
                "type": "paragraph"
            },
            {
                "format": 11,
                "text": "අපුත්තක වර්ගය දෙවෙනි යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 20,
                "text": "**එහි උද්දානය:**",
                "type": "unindented"
            },
            {
                "format": 20,
                "text": "ජටිල, පඤ්චරාජ, දෝණපාක, යන සූත්‍ර ද සඞ්ගාම සූත්‍ර දෙක ද ධීතු සූත්‍රය ද අප්පමාද සූත්‍ර දෙක ද අපුත්තක සූත්‍ර දෙකදැයි සූත්‍ර දශයෙකි.\n",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "3. කෝශල වර්ගය",
                "level": 2
            },
            {
                "type": "centered",
                "text": "3. 3. 1.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "පුග්ගල සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "132. **සැවැත්නුවර - **",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි පසේනදි කොසොල් රජ තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් පසේනදි කොසොල් රජහට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මහරජ, ලෝකයෙහි මේ පුද්ගලයෝ සිවු දෙනෙක් ඇත. කවර සිවු දෙනෙක? යත්: “අඳුරෙන් අඳුරට යන්නේ ය. අඳුරෙන් එළියට යන්නේ ය. එළියෙන් අඳුරට යන්නේ ය. එළියෙන් එළියට යන්නේ ය”යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "173"
            },
            {
                "format": 13,
                "text": "මහරජ, කෙසේ නම් පුද්ගල තෙමේ අඳුරෙන් අඳුරට යන්නේ වේ ද? මහරජ, මේ ලෝකයෙහි ඇතැම් පුද්ගලයෙක් යම් කුලයෙක්හි දුකසේ කෑම් හැඳීම් ලැබේ ද, එබඳු ස්වල්පාහාරපානභොජන ඇති දුකසේ දිවි පවත්වන දිළිඳු සැඬොල් කුලයෙහි හෝ කුලුපොතු කුලයෙහි හෝ වැදි කුලයෙහි හෝ සොම්මර කුලයෙහි හෝ පුප්සඩු කුලයෙහි හෝ හීන කුලයෙක උපන්නේ වෙයි. හෙ තෙමේ නොමනා පැහැ ඇතියෙක් කුරුසැහැවි ඇතියෙක් නපුරු දැකුම් ඇතියෙක් බොහෝ අබාධ ඇතියෙක් කණෙක් හෝ වකත්ඇතියෙක් පාකොරෙක් අඬක්නටුයෙක් හෝ වේ ද, අහාරපාන වස්ත්‍ර යාන මල්ගඳ විලෙවුන් යහන් ලැඟුම් පහන් උපකරණ නො ලබන්නෙක් වෙ යි. හෙ තෙමේ කයින් දුසිරිත් කෙරෙයි. වචනයෙන් දුසිරිත් කෙරෙයි. සිතින් දුසිරිත් කෙරෙයි. හෙ තෙමේ කයින් දුසිරිත් කොට වචනයෙන් දුසිරිත් කොට සිතින් දුසිරිත් කොට කාබුන් මරණින් මතු පහ වූ සුව ඇති නපුරුගති ඇති විවස ව පතිත වන නිරයට උත්පත්ති වශයෙන් පැමිණෙන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, පුරුෂයෙක් අඳුරෙකින් අඳුරකට යන්නේ හෝ වේ නම් කළුවරින් කළුවරට යන්නේ හෝ වේ නම් ලෙහෙමලට යන්නේ හෝ වේ නම් මහරජ, මම මේ පුඟුලා එබඳු උපමා ඇත්තකු කොට කියමි. මහරජ, මෙසේ පුඟුල් තෙමේ අඳුරෙන් අඳුරට යන්නේ වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, කෙසේ නම් පුද්ගල තෙමේ අඳුරෙන් එළියට යන්නේ වේ ද? මහරජ, මේ ලෝකයෙහි ඇතැම් පුද්ගලයෙක් යම් කුලයකේහි දුකසේ කෑම් හැඳීම් ලැබේ ද, එබඳු ස්වල්පාහාරපානභොජන ඇති දුකසේ දිවි පවත්වන දිළිඳු වූ සැඬොල් කුලයෙහි හෝ කුලුපොතු කුලයෙහි හෝ වැදිකුලයෙහි හෝ සොම්මර කුලයෙහි හෝ පුප්සඬු කුලයෙහි හෝ හීන කුලයෙක උපන්නේ වෙයි. හෙ තෙමේත් නො මනා පැහැඇතියෙක් නපුරු දැකුම් ඇතියෙක් කුරුසැහැවි ඇතියෙක් බොහෝ ආබාධ ඇතියෙක් කණෙක් හෝ වකත්ඇතියෙක් පාකොරෙක් පක්ෂඝාතයෙක් හෝ වෙයි. අහාරපාන වස්ත්‍රයාන මල් ගඳ විලෙවුන් යහන් ලැඟුම් ප්‍රදීපෝපකරණ නො ලබන්නෙක් වේ. හෙ තෙමේ කයින් සුසිරිත් කෙරෙයි. වචනයෙන් සුසිරිත් කෙරෙයි. සිතින් සුසිරිත් කෙරෙයි. හෙ තෙමේ කයින් සුසිරිත් කොට වචනයෙන් සුසිරිත් කොට සිතින් සුසිරිත් කොට කාබුන් මරණින් මතු මනාගති ඇති ස්වර්ගලෝකයට පැමිණෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, යම්සේ පුරුෂයෙක් තෙමේ බිමින් පලඟකට නගින්නේ හෝ වේ නම් පලඟින් අසුපිටට නගින්නේ හෝ වේ නම් අසුපිටින් ඇත්කඳකට නගින්නේ හෝ වේ නම් ඇත්කඳින් පහයකට නගින්නේ හෝ වේ නම් මහරජ, මම මේ පුද්ගලයා එබඳු උපමා ඇත්තකු කොට කියමි. මහරජ, මෙසේ පුද්ගල තෙමේ අඳුරෙන් එළියට යන්නේ වේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "175"
            },
            {
                "format": 13,
                "text": "මහරජ, කෙසේ නම් පුද්ගල තෙමේ එළියෙන් අඳුරට යන්නේ වේ ද? මහරජ, මේ ලෝකයෙහි ඇතැම් පුද්ගලයෙක් අඪ්‍ය වූ මහත් ධන ඇති මහත් භෝග ඇති බොහෝ රන් රිදී ඇති බොහෝ මනවඩන දෑ ඇති බොහෝ ධනධාන්‍ය ඇති කැත්මහසල් කුලයෙහි හෝ බමුණුමහසල් කුලයෙහි හෝ ගැහැවිමහසල් කුලයෙහි හෝ උසස් කුලයෙක උපන්නේ වේ. හෙ තෙමේ මනා රූ ඇත්තේත් දැකුම්කලු වූයේත් ප්‍රසාද එළවන්තේත් උතුම් පැහැසටහනින් යුක්තවූයේත් ආහාර පාන වස්ත්‍ර යානවාහන මල්ගඳවිලෙවුන් යහන් ලැගුම් ප්‍රදීපොපකරණ ලබන්නේත් වෙයි. හෙ තෙමේ කයින් දුසිරිත් කෙරෙයි. වචනයෙන් දුසිරිත් කෙරෙයි. සිතින් දුසිරිත් කෙරෙයි.  කයින් දුසිරිත් කොට වචනයෙන් දුසිරිත් කොට සිතින් දුසිරිත් කොට කාබුන් මරණින් මතු පහ වූ සුව ඇති නපුරුගති ඇති විවස ව පතිත වන නිරයට පැමිණෙයි. මහරජ, යම්සේ පුරුෂයෙක් පහයෙන් ඇත්කඳකට බස්නේ හෝ නම් ඇත්කත්කඳෙකින් අසුපිටකට බස්නේ හෝ වේ නම් අසුපිටෙකින් පලඟකට බස්නේ හෝ වේ නම් පලඟෙකින් පොළොවට බස්නේ හෝ වේ නම් පොළොවින් අඳුරකට පිවිසෙන්නේ හෝ වේ නම් මහරජ, මේ පුද්ගලයා එබඳු උපමා ඇත්තකු කොට මම කියමි. මහරජ, මෙසේ පුද්ගල තෙමේ එළියෙන් අඳුරට යන්නේ වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, කෙසේ නම් පුද්ගල තෙමේ එළියෙන් එළියට යන්නේ වේ ද? මහරජ, මෙහි ඇතැම් පුද්ගලයෙක් අඪ්‍ය වූ මහද්ධන ඇති, මහාභෝග ඇති බොහෝ රන්රිදී ඇති, බොහෝ සිත් පිනවන දෑ ඇති, බොහෝ ධනධාන්‍ය ඇති කැත්මහසල් කුලයෙහි හෝ බමුණු මහසල් කුලයෙහි හෝ ගැහැවි මහසල් කුලයෙහි හෝ උසස්කුලයෙක උපන්නේ වෙයි. හෙ තෙමේ මනා රූ ඇත්තේත් දැකුම්කලු වූයේත් ප්‍රසාද එළවන්නේත් උතුම් පැහැසටහනින් යුක්තවූයේත් ආහාර පාන වස්ත්‍ර යාන වාහන මල් ගඳවිලෙවුන් යහන් ලැගුම් ප්‍රදීපොකරණ ලබන්නේත් වෙයි. හෙ තෙමේ කයින් සුසිරිත් කෙරෙයි. වචනයෙන් සුසිරිත් කෙරෙයි. සිතින් සුසිරිත් කෙරෙයි.  කයින් සුසිරිත් කොට වචනයෙන් සුසිරිත් කොට සිතින් සුසිරිත් කොට කාබුන් මරණින් මතු මනා ගති ඇති ස්වර්ගලෝකයට පැමිණෙයි. මහරජ, යම්සේ පුරුෂයෙක් පලඟෙකින් පලඟකට යන්නේ හෝ වේ නම් අසුපිටෙකින් අසුපිටකට යන්නේ හෝ වේ නම් පහයෙකින් පහයකට යන්නේ හෝ වේ නම් මහරජ, මේ පුද්ගලයා එබඳු උපමා ඇත්තකු කොට මම කියමි. මහරජ, පුද්ගල තෙමේ එළියෙන් එළියට යන්නේ වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, මේ පුද්ගලයෝ සිවුදෙන ලොව ඇත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, දිළිඳු පුද්ගල තෙමේ සැදැහැ නැත්තේ වේ ද, මසුරු වේ ද, තදමසුරු වේ ද, පවිටු අදහස් ඇත්තේ මිසදිටු වූයේ බුද්ධාදීන් කෙරෙහි ආදර නැත්තේ වේ ද,",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහනුන්ටත් බමුණන්ටත් (මෙයින්) අන්‍ය වූ වණිබ්බකයන්ටත් අක්‍රෝශ කෙරේ ද, පරිභව කෙරේ ද, නැතැයි කියන්නේ වේ ද, මෙරමා ගටන්නේ වේ ද, ඉල්ලන්නවුන්ට බොජුන් දෙන්නහු වළකා ද,",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ජනාධිපති මහරජ, අඳුරෙන් අඳුරට යන එබඳු පුද්ගල තෙමේ මැරෙන්නේ දරුණු නිරයට පැමිණේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "රජතුමනි, දිළිඳු පුරිස් තෙමේ සැදැහැත්තේ නොමසුරු වූයේ වේ ද, ශ්‍රේෂ්ඨ අදහස් ඇති ඒ මිනිස් තෙමේ එකඟ සිත් ඇත්තේ දන් දේ ද, ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "177"
            },
            {
                "format": 13,
                "text": "මහණුන් ද, බමුණන් ද, මෙයින් අන්‍ය වූ වණිබ්බකයන් ද හුනස්නෙන් නැගිට වදී ද, සමචරියයෙහි හික්මේ ද, යාචකයන්ට බොජුන් දෙන්නහු නොවළහා ද,",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ජනශ්‍රේෂ්ඨ වූ මහරජ, අඳුරෙන් එළියට යන එබඳු පුරිස් තෙමේ මැරෙණුයේ දෙව්ලොවට පැමිණේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, අඪ්‍ය වූ පුරිස් තෙමේ ඉදින් සැදැහැ නැත්තේ මසුරු වූයේ තද මසුරු වූයේ පවිටු අදහස් ඇත්තේ මිසදිටු වූයේ (බුද්ධාදීන් කෙරෙහි) ආදර රහිත වූයේ වේ ද, ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණුන්ටත් බමුණන්ටත් මෙයින් අන්‍ය වූ වණිබ්බකයන්ටත් ආක්‍රෝශ කෙරේ ද, පරිභව කෙරේ ද, නැතැ’යි කියන්නේ වේ ද, මෙරමා ගටන්නේ වේ ද, ඉල්ලන්නවුන්ට බොජුන් දෙන්නහු වළහා ද,",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ජනශ්‍රේෂ්ඨ වූ මහරජ, එළියෙන් අඳුරට යන එබඳු පුරිස් තෙමේ මැරෙණුයේ දරුණු නිරයට පැමිණෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, අඪ්‍ය වූ පුද්ගල තෙමේ ඉදින් සැදැහැත්තේ නොමසුරු වූයේ වේ ද, උසස් අදහස් ඇති ඒ මිනිස් තෙමේ එකඟසිත් ඇත්තේ දන් දේ ද,",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණුන් ද බමුණන් ද, මෙයින් අන්‍ය වූ වණිබ්බකයන් ද, හුනස්නෙන් නැගිට වඳී ද, සමචරියයෙහි හික්මේ ද, ඉල්ලන්නවුන්ට බොජුන් දෙන්නහු නො වළාහා ද,",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ජනාධිපති වූ මහරජ, එළියෙන් එළියට යන එබඳු පුරිස් තෙමේ මැරෙණුයේ දෙව්ලොවට පැමිණේ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 3. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අය්‍යකා සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "133. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකල්හි පසේනදි කොසොල් රජ තෙමේ දෙවෙන් දාවල භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් පසේනදි කොසොල් රජහට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: මහරජ, දැන් දෙවෙන් දාවල තෙපි කොහි සිට එවූ ද?",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "179"
            },
            {
                "format": 13,
                "text": "වහන්ස, ජරාජීර්ණ වූ වයෝවෘද්ධ වූ මහලු වූ දිගුකලක් ගෙවූ පිළිවෙළින් පැසුලුවයසට පැමිණි උපතින් එක්සියවිසිවයස් වූ මාගේ මිත්ත්නියෝ කාලගත වූහ. වහන්ස, මිත්තනියෝ මට ප්‍රිය ද මනාප ද වූහ. වහන්ස, මාගේ මිත්තනියෝ කලුරිය නො කෙරෙත්වා යි ඇත්රුවනිනුදු ඉදින් මම ලබන්නෙම් නම් මාගේ මිත්තනියෝ කලුරිය නො කෙරෙත්වා! යි ඇත්රුවන ද මම දෙන්නෙමි. වහන්ස, මාගේ මිත්තනියෝ කලුරිය නො කෙරෙත්වා යි අස්රුවනිනුදු ඉදින් මම ලබන්නෙම් නම් මාගේ මිත්තනියෝ කලුරිය නො කෙරෙත්වා යි අස්රුවන ද මම දෙන්නෙමි. වහන්ස, මාගේ මිත්තනියෝ කලුරිය නො කෙරෙත්වා! යි ගම්වරෙකිනුදු ඉදින් මම ලබන්නෙම් නම් මාගේ මිත්තනියෝ කලුරිය නො කෙරෙත්වා යි ගම්වරකුදු මම දෙන්නෙමි. වහන්ස, මාගේ මිත්තනියෝ කලුරිය නො කෙරෙත්වා යි දනව්වෙකිනුදු ඉදින් මම ලබන්නෙම් නම් මාගේ මිත්තනියෝ කලුරිය නො කෙරෙත්වා යි දනව්වකුදු මම දෙන්නෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, සියලු සත්වයෝ මරණය ස්වභාවය කොට ඇත්තාහ.  මරණය කෙළවර කොට ඇත්තාහ. මරණය නො ඉක්මවූවෝ ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, ආශ්චර්ය්‍යයෙකි. වහන්ස, අද්භූතයෙකි. වහන්ස, “සියලු සත්වයෝ මරණය ස්වභාව කොට ඇත්තාහ.  මරණය කෙළවර කොට ඇත්තාහ. මරණය නො ඉක්ම වූවෝ ය” යන මෙය භාග්‍යවතුන් වහන්සේ විසින් අත්‍යර්ථයෙන් මැ මැනවින් දේශනා කරණ ලද්දේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, තෙල එසේ ය. මහරජ, තෙල එසේ ය. සියලු සත්වයෝ මරණය ස්වභාව කොට ඇත්තෝ ය. මරණය කෙළවර කොට ඇත්තෝ ය. මරණය නො ඉක්මවූවෝ ය. මහරජ, අමු වූත් පැලහූත් යම්කිසි කුඹල්බඳුන් වේ නම්, ඒ සියල්ල යම්සේ බිඳීම ස්වභාව කොට ඇත්තේ බිඳීම කෙළවර කොට ඇත්තේ බිඳීම නො ඉක්ම වූයේ වේ ද, මහරජ, එසෙයින්ම සියලු සත්වයෝ මරණය ස්වභාව කොට ඇත්තාහ. මරණය කෙළවර කොට ඇත්තාහ. මරණය නො ඉක්ම වූවෝ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සියලු සත්වයෝ මැරෙන්නාහ. ජීවිතය මරණය කෙළවර කොට ඇත්තේ ය එහෙයිනි. පින්පව්පල අනුව ගියාහු පව්කම් ඇත්තෝ නිරයට ද පින්කම් ඇත්තෝ සුගතියට දැයි මෙසේ කම් වූ පරිද්දෙන් (පරලොව) යන්නාහු ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එහෙයින් පරලොවට හිත දෑ රැස් කරන්නේ පින් කරන්නේ ය. පින් සත්වයන්ට පරලොව පිහිට වේ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 3. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ලෝක සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "134. **සැවැත්නුවර - **",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකත්පසෙක හුන් පසේනදි කොසොල් රජ තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. වහන්ස, කෙතෙක් ලෝකධර්මයෝ උපදනාහු අහිත පිණිස දුක් පිණිස අපහසු විහරණය පිණිස උපදිද් ද?",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "181"
            },
            {
                "format": 13,
                "text": "මහරජ, ලෝදහම් තුනෙක් උපදනේ අහිත පිණිස දුක් පිණිස නො පහසු විහරණය පිණිස උපදී. කවර තුනෙක් ද? යත්: මහරජ, ලෝභ සඞ්ඛයාත ලෝකධර්මය උපදනේ අහිත පිණිස දුක් පිණිස නොපහසු විහරණය පිණිස උපදී. මහරජ, ද්වේෂසඞ්ඛයාත ලෝකධර්මය උපදනේ අහිත පිණිස දුක් පිණිස නොපහසු විහරණය පිණිස උපදී. මෝහ සඞ්ඛයාත ලෝකධර්මය උපදනේ අහිත පිණිස දුක් පිණිස නොපහසු විහරණය පිණිස උපදී. මහරජ, මේ ලෝකධර්ම තුන උපදනේ අහිත පිණිස දුක් පිණිස නො පහසු විහරණය පිණිස උපදී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ලෝභය ද ද්වේෂය ද මෝහය ද තමා තුළ හටගත්තාහු පවිටු සිත් ඇති මිනිසා පෙළත්. සිය පලය පොතුහර රුකක් (නසන්නාක්) මෙනි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 3. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඉස්සත්ථ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "135. **සැවැත්නුවර - **",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකත්පසෙක හුන් පසේනදි කොසොල් රජ තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. වහන්ස, කවුරුන් විෂයෙහි දන් දියයුතු ද?\n\nමහරජ, යමකු කෙරෙහි සිත පහ දී ද (ඔහුට දියයුතුයි) වහන්ස, කවුරුන් කෙරෙහි දෙන ලද්දේ මහත්ඵල වේ ද?\n\nමහරජ, කවුරුන් කෙරෙහි දන් දියයුතු ද? යන මෙය අනෙකෙකි. කවුරුන් කෙරෙහි දෙන ලද්ද මහත්ඵල වේ ද? යන මෙය අනෙකෙකි. මහරජ, සිත්වතාට දෙන ලද්ද මහත්ඵල වේ. දුශ්ශීලයා කෙරෙහි එසේ නො වේ. මහරජ, එසේ නම් මෙහි ලා තොප ම පුළුවුස්නෙමි. යම්සේ තොපට වැටහේ නම් එසේ එය පවසව.",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "මහරජ, ඒ කුමැයි හඟිහු ද? මෙහි තොපට යුද්ධයෙක් එළඹ සිටියේ වන්නේ ය. යුදසෙනඟ රැස්වූයේ වන්නේ ය. එකල්හි දුනුසිප්හි නුපුහුණු කෘතහස්ත නො වූ විදීමෙහි නුපුරුදු සිප් දැක්වුම් නො කළ බියගුලු වෙවුළන තැතිගන්නා සුලු පලා යන කැත් කුමරෙක් එන්නේ නම් ඒ පුරුෂයා පෝෂණය කරවූ ද, එබඳු පුරුෂයෙකුගෙන් තොපට වැඩ ඇත් ද? වහන්ස, මම එබඳු පුරුෂයා පෝෂණය නොකරන්නෙමි. එබඳු පුරුෂයකුගෙන් මට වැඩෙක් ද නැත."
            },
            {
                "format": 13,
                "text": "එකල්හි නුපුහුණු බමුණු කුමරෙක් එන්නේ නම් … එකල්හි නුපුහුණු වෙස්කුමරෙක් එන්නේ නම් … එකල්හි නුපුහුණු ශුද්‍ර කුමරෙක් එන්නේ නම් … ඒ පුරුෂයා පෝෂණය කරන්නහු ද? එබඳු පුරුෂයෙකුගෙන් තොපට වැඩෙක් ඇද් ද? වහන්ස, මම ඒ පුරුෂයා පෝෂණය නො කරන්නෙමි. එබඳු පුරුෂයකුගෙන් මට වැඩෙක් ද නැත.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "183"
            },
            {
                "format": 13,
                "text": "මහරජ, ඒ කුමකැයි හඟිහු ද? මෙහිතොපට යුද්ධයෙක් එළඹසිටියේ වන්නේ ය. යුදසෙනඟ රැස් වූයේ වන්නේ ය. එකල්හි දුනුසිප්හි මැනවින් පුහුණු වූ කෘතහස්ත වූ කළපුරුදු ඇති සිප් දැක්වුම් කළ බියගුලු නො වූ නොවෙවුළන නො තැතිගන්නා පලා නො යනසුලු කැත්කුමරෙක් එන්නේ නම් ඒ පුරුෂයා පෝෂණය කරන්නහු ද? එබඳු පුරුෂයෙකු ගෙන් තොපට වැඩෙක් ඇද්ද? වහන්ස, මම එබඳු පුරුෂයා පෝෂණය කරන්නෙමි. එබඳු පුරුෂයකුගෙන් මට වැඩෙක් ඇත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි මැනැවින් පුහුණු වූ බමුණු කුමරෙක් එන්නේ නම් .. මැනවින් පුහුණු වූ වෙස් කුමරෙක් … මැනවින් පුහුණු වූ කෘතහස්ත වූ කළපුරුදු ඇති කළ සිප් දැක්වුම් ඇති බියගුලු නො වූ නො වෙවුළන නොතැති ගන්නා පලා නො යන සුලු කුමරෙක් … ඒ පුරුෂයා පෝෂණය කරන්නහු ද? එබඳු පුරුෂයෙකු ගෙන් තොපට වැඩෙක් ඇද් ද? වහන්ස, මම ඒ පුරුෂයා පෝෂණය කරන්නෙමි. එබඳු පුරුෂයකුගෙන් මට වැඩෙක් ඇත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, එසෙයින් ම යම් කවර කුලයෙකින් හෝ ගිහිගෙන් නික්ම සස්නෙහි පැවිද වූයේ වේ ද? හෙ තෙමේත් ප්‍රහීණ වූ පසඟක් ඇත්තේ පසඟෙකින් සමන්විත වූයේ නම් ඔහු කෙරෙහි දෙන ලද්දේ මහත්ඵල වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කවර පසක් ප්‍රහීණ වූයේ වේ ද? යත්: කාමච්ඡන්දය ප්‍රහීණ වූයේ වෙයි. ව්‍යාපාදය ප්‍රහීණ වූයේ වෙයි. ථීනමිද්ධය ප්‍රහීණ වූයේ වෙයි. උද්ධච්චකුක්කුච්චය ප්‍රහීණ වූයේ වෙයි. විචිකිච්ඡාව ප්‍රහීණ වූයේ වෙයි. මේ පසඟ ප්‍රහීණ වූයේ වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කවර පසඟෙකින් සමන්විත වූයේ ද? යත්: අශෛක්ෂ වූ ශීලස්කන්ධයෙන් සමන්විත වූයේ වෙයි. අශෛක්ෂ වූ සමාධිස්කන්ධයෙන් සමන්විත වූයේ වෙයි. අශෛක්ෂ වූ ප්‍රඥාස්කන්ධයෙන් සමන්විත වූයේ වෙයි. අශෛක්ෂ වූ විමුක්තිස්කන්ධයෙන් සමන්විත වූයේ වෙයි. අශෛක්ෂ වූ විමුක්තිඥානදර්ශනස්කන්ධයෙන් සමන්විත වූයේ වෙයි. මේ පසඟින් සමන්විත වූයේ වෙයි. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "මෙසේ ප්‍රහීණ වූ පසඟක් ඇති පසඟෙකින් සමන්විත වූවාහු කෙරෙහි දෙන ලද්ද මහත් ඵල වෙයි."
            },
            {
                "format": 13,
                "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගත වූ ශාස්තෘන් වහන්සේ මෙය වදාරා නැවත පසු ව මෙය ද වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යම් තරුණයෙක් කෙරෙහි ධනුශිල්පයත් කායික චෛතසික වීර්ය්‍යයත් විද්‍යාමාන වේ නම් රජ තෙමේ ඔහු යුද පිණිස පෝෂණය කරන්නේ ය. අදක්ෂයා ජාතිය හේතු කොට ගෙණ පෝෂණය නොකරන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එපරිද්දෙන් ම යමකු කෙරෙහි ඉවසීම ද රහත්බව ද යන ධර්මයෝ පිහිටියාහු ද ආර්ය්‍ය පැවතුම් ඇති නුවණැති ඔහු හීනජාතිකයකු වු ව ද පුදන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සිත්කලු අසපු කරවන්නේ ය. එහි බහුශ්‍රැතයන් වස්වන්නේ ය. නිරුදක අරණ්‍යයෙහි පැන්පොකුණු ද නොසමබිම්හි සක්මන්මලු ද කරවන්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "අහර ද පැන් ද කැවිලි ද වත්සෙනසුන් ද රහතුන් කෙරෙහි පහන්සිතින් දෙන්නේ ය. "
            },
            {
                "type": "page-break",
                "text": "185"
            },
            {
                "format": 13,
                "text": "යම්සේ විදුලි පෙල ඇති සියගණන් (වලා) කුළු ඇති මේඝය ගුගුරමින් පොළොව තෙමන්නේ වළ ද ගොඩ ද පුරවා ද,",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එසේ ම සැදැහැති අසූ පිරු තැන් ඇති නුවණැත්තේ බොජුන් පිළියෙළ කොට ආහාරපානයෙන් වර්ණබබ්කයන් සතප්වයි. සතුටු වන්නේ සර්වප්‍රකාරයෙන් විසුරුවන්නාක් මෙන් දන් දෙයි. නොහොත් දන්හලෙහි හැසිරෙයි. දෙව දෙව යි කියයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වසනා වැස්සෙක (ගර්ජනය) මෙන් එය ඔහුගේ ගර්ජනය වෙයි. මහත් වූ ඒ පින් දහර දෙන්නහු මැනවින් තෙමයි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3.3.5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පබ්බතූපම සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "136. **සැවැත්නුවර - **",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකත්පසෙක හුන් පසේනදි කොසොල්රජහට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මහරජ තෙපි දැන් මේ දෙවෙන් දවාලෙහි කොහි සිට එවුද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, ඉසුරුමෙදෙන් මත් වූ කාමයෙහි ගිජු බැවින් මැඩුනු දනව්හි තිරබවට පත් මුදුන්හි අභිෂේක කරණ ලද මහත් පොළෝමඬල දිනා අධිපතිව වෙසෙන කැත් රජුන්ට යම් ඒ රජකටයුතු ඇද්ද, මම දැන් එහි උත්සුකබවට පැමිණියෙම් වෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, ඒ කුමකැයි හගිහු ද? මෙහි තොප විසින් ඇදහියයුතු පිළිගත හැකි වචන ඇති පුරුෂයෙක් පෙර දිගින් එන්නේ ය. හෙ තෙමේ තොප වෙත එළඹ “දේවයන් වහන්ස, දැන වදාළ මැනවි. මම පෙරදිග සිට එමි. එහි අහස හා සම වූ මහපව්වක් දිටිමි. සියලු සතුන් සුණු කෙරෙමින් එයි. දේවයන් වහන්ස, නුඹවහන්සේ විසින් යමක් කටයුතු නම් එය කරණු මැනවැ”යි මෙසේ සැළ කරන්නේ ය. ඉක්බිති දෙවෙනි පුරුෂයෙක් දකුණු දිග සිට එයි….. ඉක්බිති තෙවෙනි පුරුෂයෙක් පැසුළු දිග සිට එයි …. ඉක්බිති ඇදහිය යුතු පිළිගත හැකි වචන ඇති සිව්වැනි පුරුෂයෙක් උතුරු දිග සිට එයි. හෙ තෙමේ තොප වෙත එළඹ “දේවයන් වහන්ස, දැන වදාළ මැනවි. මම උතුරුදිග සිට එමි. එහි අහස හා සම වූ මහපව්වක් දිටිමි. සියලු සතුන් සුණු කෙරෙමින් එයි. දේවයන් වහන්ස, නුඹවහන්සේ විසින් යමක් කටයුතු නම් එය කරණු මැනවැ”යි මෙසේ සැළ කරන්නේ ය. මහරජ, දරුණු වූ මිනිසුන් නසන මහත් වූ මෙබඳු නපුරු බියක් හටගත් කල්හි දුබල මිනිසත් බැව්හි වූ තොප විසින් කිමෙක් කටයුතු වන්නේ ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, දරුණු වූ මිනිසුන් නසන මහත් වූ මෙබඳු නපුරු බියක් හටගත් කල්හි දුබල මිනිසත් බැව්හි ධර්මචර්යාව සමචර්යාව කුශලක්‍රියාව පුණ්‍යක්‍රියාව හැර අන් කිමෙක් කටයුතු වන්නේ ද.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, තොපට කියමි. මහරජ, තොපට දන්වමි. මහරජ, ජරාමරණ දෙක තොප මැඩ ගෙණ සිටී. මහරජ, ජරාමරණ දෙක තොප මැඩ ගෙණ සිටි කල්හි තොප විසින් කිමෙක් කටයුතු වන්නේ ද?",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "187"
            },
            {
                "format": 13,
                "text": "වහන්ස, ජරාමරණ දෙක (අප) මැඩ ගෙණ සිටි කල්හි ධර්මචර්යාව සමචර්යාව කුසලක්‍රියාව පුණ්‍යක්‍රියාව හැර මාවිසින් අන් කිමෙක් කටයුතු වන්නේ ද.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, ඉසුරුමෙදෙන් මත් වූ කාමයෙහි ගිජුබැවින් මඩනාලද දනව්හි තිරබවට පත් මහත් පොළෝමඬල දිනා අධිපති ව වෙසෙන මුදුන අභිෂේක කළ කැත් රජුන්ගේ යම් ඒ ඇත්යුධ වේ නම් වහන්ස, ජරාමරණදෙක අප (මැඩ) ගෙණ සිටි කල්හි ඒ ඇත් යුදවලට ද වැඩෙක් නැත. සමත්බවෙක් නැත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, මුදුන අභිෂේක කළ … කැත් රජුන්ගේ යම් ඒ අස්යුද වේ නම් … රථයුද වේ නම් … පාබලයුද වේ නම් වහන්ස, ජරා මරණ දෙක අප මැඩ ගෙණ සිටි කල්හි ඒ පාබල යුධවලට ද වැඩෙක් නැත. සමත් බවෙක්ද නැත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, යම් කෙනෙක් ආවා වූ සතුරන් මන්ත්‍රණයෙන් බිඳුවා ලන්නට සමත් වෙත් නම් එබඳු මැති ඇමතිකෙනෙක් මේ රජකුලයෙහි ඇත. වහන්ස, ජරාමරණ දෙක අප මැඩ ගෙණ සිටි කල්හි ඒ මන්ත්‍රයුද්ධයන්ට ද වැඩෙක් නැත. සමත් බවෙක් නැත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, ආවා වූ සතුරන් ධනයෙන් පොලඹවා ගන්නට යම් ධනයෙකින් අපි සමර්ථ වමෝ නම් පිහිටියා වූත් අහස සිටියා වූත් එබඳු බොහෝ රන් අමුරන් මේ රදකුලයෙහි ඇත. වහන්ස, ජරාමරණදෙක අප මැඩ ගෙණ සිටි කල්හි ඒ ධනයුද්ධයන්ට ද වැඩෙක් නැත. සමත් බවෙක් නැත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, ජරාමරණ දෙක මා මැඩ ගෙණ සිටි කල්හි ධර්මචර්යාව, සමචර්යාව, කුශලක්‍රියාව, පුණ්‍යක්‍රියාව හැර මා විසින් අන් කිමෙක් කටයුතු වන්නේ ද.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහරජ, තෙල එසේය. මහරජ. තෙල එසේ ය. ජරාමරණදෙක (තොප) මැඩගෙණ සිටි කල්හි ධර්මචර්යාව, සමචර්යාව, කුශලක්‍රියාව, පුණ්‍යක්‍රියාව හැර තොප විසින් අන් කිමෙක් කටයුතු වන්නේ ද.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගත වූ ශාස්තෘන් වහන්සේ මෙය වදාරා වැලි අන්‍ය වූ තෙල ගාපෙල ද වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යම්සේ මහත් වූ ශෛලමය වූ අහස හැපී (සිටි) පර්වතයෝ හාත්පස සිවු දිගුන් සුණු කෙරෙමින් පෙරළී එන්නාහු ද,",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එසේ ජරාවත් මරණයත් ක්ෂත්‍රියයන් ද බ්‍රාහ්මණයන් ද වෛශ්‍යයන් ද ශුද්‍රයන් ද සැඬොල් පුස්සඬු කුලයෙහි වුවන්ද යන සියලු සතුන් යට කෙරෙත්. කිසිවක් අත් නො හරී. සියල්ල ම මඩී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එහි ඇතුන්ට ද රථයන්ට ද පාබලසෙනඟ ට ද විෂයස්ථාන නො වේ. මන්ත්‍රයුද්ධයෙන් හෝ ධනයෙන් හෝ දනන්නට නො ම හැක්කේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එහෙයින් ධෛර්යවත් වූ නුවණැති පුරුෂ තෙමේ තමහට වැඩ දක්නේ බුදුන් කෙරෙහි ද ධර්මය කෙරෙහි ද සඬ්ඝයා කෙරෙහි ද ශ්‍රද්ධාව පිහිටුවන්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "189"
            },
            {
                "format": 13,
                "text": "යමෙක් කයින් ද වචනයෙන් ද යලි සිතින් ද ධර්මයෙහි හැසිරෙණ සුලු ද (නුවණැත්තෝ) මෙලොව ම ඔහු පස්සත්. පරලොව ස්වර්ගයෙහි සතුටු වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 11,
                "text": "කෝසල වර්ගය තුන් වැනියි.",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 20,
                "text": "**එහි උද්දානය: **",
                "type": "unindented"
            },
            {
                "format": 20,
                "text": "පුග්ගල, අය්‍යකා, ලොක, ඉස්සත්ථ, පබ්බතූපම සූත්‍රය යන මේ කෝසලපඤ්චකය ශ්‍රේෂ්ඨ වූ බුදුරජානන් වහන්සේ විසින් දේශනා කරණ ලදී.",
                "type": "paragraph"
            },
            {
                "format": 9,
                "text": "කෝසලසංයුක්තය නිමියේ ය.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ]
    }
]