[
    {
        "filename": "sn-slyv-2",
        "bookId": 19,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "390"
            },
            {
                "type": "heading",
                "text": "2. වෙදනාසංයුත්තං",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. සගාථාවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "1. 20. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සමාධිසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "249. තිස්සො ඉමා භික්ඛවෙ වෙදනා. කතමා තිස්සො: සුඛා වෙදනා දුක්ඛා වෙදනා අදුක්ඛමසුඛා වෙදනා. ඉමා ඛො භික්ඛවෙ තිස්සො වෙදනාති."
            },
            {
                "type": "gatha",
                "text": "සමාහිතො සම්පජානො සතො බුද්ධස්ස සාවකො\nවෙදනා ච පජානාති වෙදනානඤ්ච සම්භවං.\nයත්ථ චෙතා නිරුජ්ඣන්ති මග්ගඤ්ච ඛයගාමිනං\nවෙදනානං ඛයා භික්ඛු නිච්ඡාතො පරිනිබ්බුතොති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "1. 20. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුඛසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "250. තිස්සො ඉමා භික්ඛවෙ වෙදනා. කතමා තිස්සො: සුඛා වෙදනා, දුක්ඛා වෙදනා, අදුක්ඛමසුඛා වෙදනා. ඉමා ඛො භික්ඛවෙ, තිස්සො වෙදනාති."
            },
            {
                "type": "gatha",
                "text": "සුඛං වා යදි වා දුක්ඛං අදුක්ඛමසුඛං සහ\nඅජ්ඣත්තඤ්ච බහිද්ධා ච යං කිඤ්චි අත්ථි වෙදිතං\nඑතං දුක්ඛන්ති ඤත්වාන, මොසධම්මං පලොකිතං{1 පලොකින - මඡසං, අට්ඨකථා.}\nඵුස්ස ඵුස්ස වයම්පස්සං{2 වයං ඵුස්සං - ස්යා, අට්ඨකථා. ඵස්සං - සී 1, 2.} එවං තත්ථ විරජ්ජතීති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "1. 20. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පහානසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "250. තිස්සො ඉමා භික්ඛවෙ වෙදනා. කතමා තිස්සො: සුඛා වෙදනා දුක්ඛා වෙදනා අදුක්ඛමසුඛාවෙදනා. සුඛාය භික්ඛවෙ වෙදනාය රාගානුසයො පහාතබ්බො, දුක්ඛාය වෙදනාය පටිඝානුසයො පහාතබ්බො, අදුක්ඛමසුඛාය වෙදනාය අවිජ්ජානුසයො පහාතබ්බො. යතො ඛො භික්ඛවෙ, භික්ඛුනො සුඛාය වෙදනාය රාගානුසයො පහීනො හොති, දුක්ඛාය වෙදනාය පටිඝානුසයො පහීනො හොති, අදුක්ඛමසුඛාය වෙදනාය අවිජ්ජානුසයො පහීනො හොති, අයං වුච්චති භික්ඛවෙ භික්ඛු{3 භික්ඛුනො - සී 1, 2.} පහීනරාගානුසයො{4 නිරනුසයො සම්මද්දසො - මඡසං. නිරාගානුසයො - ස්යා.} අච්ඡෙච්ඡි තණ්හං, වාවත්තයී{5 වීවත්තයී - ස්යා.} සඤ්ඤොජනං සම්මාමානාභිසමයා අන්තමකාසි දුක්ඛස්සාති."
            },
            {
                "type": "page-break",
                "text": "392"
            },
            {
                "type": "gatha",
                "text": "සුඛං වෙදියමානස්ස වෙදනං අප්පජානතො\nසො රාගානුසයො හොති අනිස්සරණදස්සිනො.",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "දුක්ඛං වෙදියමානස්ස වෙදනං අප්පජානතො\nපටිඝානුසයො හොති අනිස්සරණදස්සිනො.",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "අදුක්ඛමසුඛං සන්තං භූරිපඤ්ඤෙන දෙසිතං\nතං චාපි අභිනන්දන්තො{1 අභිනන්දන්ති - සීමු ii} නෙව දුක්ඛා පමුච්චති.",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "යතො වා{2 යතො වා ඛො - සී 1, 2.} භික්ඛු ආතාපී සම්පජඤ්ඤං න රිඤ්චති\nතතො සො වෙදනා සබ්බා පරිජානාති පණ්ඩිතො.",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "සො වෙදනා පරිඤ්ඤාය දිට්ඨෙ ධම්මෙ අනාසවො\nකායස්ස භෙදා ධම්මට්ඨො සඞ්ඛං නොපෙති{3 සංඛසං නොපෙති - මඡසං. නූපෙති - ස්යා. න උපෙති - සී.මු.} වෙදගූති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "1. 20. 4. ",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පාතාලසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "252. අස්සුතවා භික්ඛවෙ පුථුජ්ජනො එවං වාචං භාසති: ‘අත්ථි මහාසමුද්දෙ පාතාලො’ති. තං ඛො පනෙතං භික්ඛවෙ අස්සුතවා පුථුජ්ජනො අසන්තං අවිජ්ජමානං එවං වාචං භාසති: ‘අත්ථි මහාසමුද්දෙ පාතාලො’ති. සාරීරිකානං ඛො එතං භික්ඛවෙ දුක්ඛානං වෙදනානං අධිවචනං යදිදං පාතාලොති. අස්සුතවා භික්ඛවෙ පුථුජ්ජනො සාරීරිකාය දුක්ඛාය වෙදනාය ඵුට්ඨො සමානො සොචති කිලමති පරිදෙවති උරත්තාළිං{4 උරත්තාලිං - සී 1, 2.} කන්දති. සම්මොහං ආපජ්ජති. අයං වුච්චති භික්ඛවෙ අස්සුතවා පුථුජ්ජනො පාතාලෙ න පච්චුට්ඨාසි, ගාධඤ්ච නාජ්ඣගා. සුතවා භික්ඛවෙ අරියසාවකො සාරීරිකාය දුක්ඛාය වෙදනාය ඵුට්ඨො සමානො න සොචති, න කිලමති, න පරිදෙවති, න උරත්තාළිං{5 උරත්තාලිං - සී 1, 2.} කන්දති, න සම්මොහං ආපජ්ජති. අයං වුච්චති භික්ඛවෙ, සුතවා අරියසාවකො පාතාලෙ පච්චුට්ඨාසි, ගාධඤ්ච අජ්ඣගාති."
            },
            {
                "type": "gatha",
                "text": "යො එතා නාධිවාසෙති උප්පන්නා වෙදනා දුඛා{6 දුක්ඛා - සී.මු.}\nසාරීරිකා පාණහරා යාහි ඵුට්ඨො පවෙධති.",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "අක්කන්දති පරොදති දුබ්බලො අප්පථාමකො\nන සො පාතාලෙ පච්චුට්ඨාසි අථො ගාධම්පි නාජ්ඣගා.",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "යො චෙතා අධිවාසෙති උප්පන්නා වෙදනා දුඛා{7 දුක්ඛා - සී.මු.}\nසාරීරිකා පාණහරා යාහි ඵුට්ඨො න වෙධති\nස වෙ පාතාලෙ පච්චුට්ඨාසි අථො ගාධම්පි අජ්ඣගාති.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "394"
            },
            {
                "type": "centered",
                "text": "1. 20. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දට්ඨබ්බසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "253. තිස්සො ඉමා භික්ඛවෙ වෙදනා. කතමා තිස්සො: සුඛා වෙදනා, දුක්ඛා වෙදනා, අදුක්ඛමසුඛා වෙදනා. සුඛා භික්ඛවෙ වෙදනා දුක්ඛතො දට්ඨබ්බා, දුක්ඛා වෙදනා සල්ලතො දට්ඨබ්බා, අදුක්ඛමසුඛා වෙදනා අනිච්චතො දට්ඨබ්බා."
            },
            {
                "type": "paragraph",
                "text": "යතො ඛො භික්ඛවෙ භික්ඛුනො සුඛා වෙදනා දුක්ඛතො දිට්ඨා හොති, දුක්ඛා වෙදනා සල්ලතො දිට්ඨා හොති, අදුක්ඛමසුඛා වෙදනා අනිච්චතො දිට්ඨා හොති, අයං වුච්චති භික්ඛවෙ භික්ඛු සම්මද්දසො අච්ඡෙච්ඡි තණ්හං, වාවත්තයි සඤ්ඤොජනං, සම්මාමානාභිසමයා අන්තමකාසි දුක්ඛස්සාති."
            },
            {
                "type": "gatha",
                "text": "යො සුඛං දුක්ඛතො අද්ද දුක්ඛමද්දක්ඛි සල්ලතො\nඅදුක්ඛමසුඛං සන්තං අද්දක්ඛි නං අනිච්චතො.",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "ස වෙ සම්මද්දසො භික්ඛු පරිජානාති වෙදනා\nසො වෙදනා පරිඤ්ඤාය දිට්ඨධම්මෙ අනාසවො\nකායස්ස භෙදා ධම්මට්ඨො සඞ්ඛං නොපෙති වෙදගූති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "1. 20. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සල්ලසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "254. අස්සුතවා භික්ඛවෙ පුථුජ්ජනො සුඛම්පි වෙදනං වෙදියති, දුක්ඛම්පි වෙදනං වෙදියති, අදුක්ඛමසුඛම්පි වෙදනං වෙදියති. සුතවා භික්ඛවෙ, අරියසාවකො සුඛම්පි වෙදනං වෙදියති, දුක්ඛම්පි වෙදනං වෙදියති, අදුක්ඛමසුඛම්පි වෙදනං වෙදියති. තත්ර භික්ඛවෙ කො විසෙසො, කො අධිප්පායො කිං නානාකරණං සුතවතො අරියසාවකස්ස අස්සුතවතා පුථුජ්ජනෙනාති?"
            },
            {
                "type": "paragraph",
                "text": "භගවම්මූලකා නො භන්තෙ ධම්මා භගවන්නෙත්තිකා භගවම්පටිසරණා, සාධු වත භන්තෙ භගවන්තං යෙව පටිභාතු එතස්ස භාසිතස්ස අත්ථො භගවතො සුත්වා භික්ඛු ධාරෙස්සන්තීති. තෙන හි භික්ඛවෙ සුණාථ, සාධුක් මනසිකරොථ, භාසිස්සාමීති. එවං භන්තෙති ඛො තෙ භික්ඛු භගවතො පච්චස්සොසුං, භගවා එතදවොච:"
            },
            {
                "type": "page-break",
                "text": "396"
            },
            {
                "type": "paragraph",
                "text": "අස්සුතවා භික්ඛවෙ පුථුජ්ජනො දුක්ඛාය වෙදනාය ඵුට්ඨො සමානො සොචති කිලමති පරිදෙවති උරත්තාළිං කන්දති සම්මොහං ආපජ්ජති. සො ද්වෙ වෙදනා වෙදියති කායිකඤ්ච චෙතසිකඤ්ච. සෙය්යථාපි භික්ඛවෙ, පුරිසං සල්ලෙන විජ්ඣෙය්යුං තමෙනං දුතියෙන සල්ලෙන අනුවෙධං විජ්ඣෙය්යුං එවං හි සො භික්ඛවෙ, පුරිසො ද්වෙ සල්ලෙන වෙදනා වෙදියෙථ."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො භික්ඛවෙ අස්සුතවා පුථුජ්ජනො දුක්ඛාය වෙදනාය ඵුට්ඨො සමානො සොචති. කිලමති. පරිදෙවති. උරත්තාළිං කන්දති. සම්මොහං ආපජ්ජති. සො ද්වෙ වෙදනා වෙදියති කායිකඤ්ච චෙතසිකඤ්ච. තස්සායෙව ඛො පන දුක්ඛාය වෙදනාය ඵුට්ඨො සමානො පටිඝවා හොති. තමෙනං දුක්ඛාය වෙදනාය පටිඝවන්තං යො දුක්ඛාය වෙදනාය පටිඝානුසයො සො අනුසෙති. සො දුක්ඛාය වෙදනාය ඵුට්ඨො සමානො කාමසුඛං අභිනන්දති. තං කිස්ස හෙතු, න භික්ඛවෙ පජානාති අස්සුතවා පුථුජ්ජනො අඤ්ඤත්ර කාමසුඛා දුක්ඛාය වෙදනාය නිස්සරණං, තස්ස කාමසුඛං අභිනන්දතො යො සුඛාය වෙදනාය රාගානුසයො සො අනුසෙති. සො තාසං වෙදනානං සමුදයඤ්ච අත්ථගමඤ්ච අස්සාදඤ්ච ආදීනවඤ්ච නිස්සරණඤ්ච යථාභූතං නප්පජානාති."
            },
            {
                "type": "paragraph",
                "text": "තස්ස තාසං වෙදනානං සමුදයඤ්ච අත්ථගමඤ්ච අස්සාදඤ්ච ආදීනවඤ්ච නිස්සරණඤ්ච යථාභූතං අප්පජානතො යො අදුක්ඛමසුඛාය වෙදනාය අවිජ්ජානුසයො සො අනුසෙති. සො සුඛඤ්චෙ{1 සුඛං - සී 2.} වෙදනං වෙදියති, සඤ්ඤුත්තො නං වෙදයති. දුක්ඛඤ්චෙ වෙදනං වෙදියති, සඤ්ඤුත්තො නං වෙදියති. අදුක්ඛමසුඛඤ්චෙ වෙදනං වෙදියති, සඤ්ඤුත්තො නං වෙදියති. අයං වුච්චති භික්ඛවෙ අස්සුතවා පුථුජ්ජනො සඤ්ඤුත්තො ජාතියා ජරාමරණෙන සොකෙහි පරිදෙවෙහි දුක්ඛෙහි දොමනස්සෙහි උපායාසෙහි සඤ්ඤුත්තො දුක්ඛස්මාති වදාමි."
            },
            {
                "type": "paragraph",
                "text": "සුතවා ච ඛො භික්ඛවෙ අරියසාවකො දුක්ඛාය වෙදනාය ඵුට්ඨො සමානො න සොචති න කිලමති න පරිදෙවති න උරත්තාළිං කන්දති න සම්මොහං ආපජ්ජති: සො එකං වෙදනං වෙදියති කායිකං, න චෙතසිකං. සෙය්යථාපි භික්ඛවෙ පුරිසං සල්ලෙන විජ්ඣෙය්යුං, තමෙනං දුතියෙන සල්ලෙන අනුවෙධං න විජ්ඣෙය්යුං;{2 න අනුවිජ්ඣෙය්යුං - සී 1, 2. අනුරොධං න විජ්ඣෙය්යුං - ස්යා.} එවං හි සො භික්ඛවෙ පුරිසො එකං{3 එකසල්ලෙන - මඡසං.} සල්ලෙන{4 එකසල්ලෙන - මඡසං.} වෙදනං වෙදියෙථ{5 වෙදයති - මඡසං.} එවමෙව ඛො භික්ඛවෙ සුතවා අරියසාවකො දුක්ඛාය වෙදනාය ඵුට්ඨො සමානො න සොචති, න කිලමති, න පරිදෙවති, න උරත්තාළිං කන්දති, න සම්මොහං ආපජ්ජති; සො එකං වෙදනං වෙදියති කායිකං, න චෙතසිකං. තස්සායෙව ඛො පන දුක්ඛාය වෙදනාය පටිඝවා න හොති. තමෙනං දුක්ඛාය වෙදනාය අපටිඝවන්තං යො දුක්ඛාය වෙදනාය පටිඝානුසයො සො නානුසෙති; සො දුක්ඛාය වෙදනාය ඵුට්ඨො සමානො කාමසුඛං නාභිනන්දති. තං කිස්ස හෙතු, පජානාති හි භික්ඛවෙ සුතවා අරියසාවකො අඤ්ඤත්ර කාමසුඛා දුක්ඛාය වෙදනාය නිස්සරණං."
            },
            {
                "type": "page-break",
                "text": "398"
            },
            {
                "type": "paragraph",
                "text": "තස්ස කාමසුඛං අනභිනන්දතො යො සුඛාය වෙදනාය රාගානුසයො සො නානුසෙති. සො තාසං වෙදනානං සමුදයඤ්ච අත්ථගමඤ්ච අස්සාදඤ්ච ආදීනවඤ්ච නිස්සරණඤ්ච යථාභූතං පජානාති. තස්ස තාසං වෙදනානං සමුදයඤ්ච අත්ථගමඤ්ච අස්සාදඤ්ච ආදීනවඤ්ච නිස්සරණඤ්ච යථාභූතං පජානතො, යො අදුක්ඛමසුඛාය වෙදනාය අවිජ්ජානුසයො සො නානුසෙති. සො සුඛඤ්චෙ වෙදනං වෙදයති විසඤ්ඤුත්තො නං වෙදියති. දුක්ඛඤ්චෙ වෙදනං වෙදියති විසඤ්ඤුත්තො නං වෙදියති. අදුක්ඛමසුඛඤ්චෙ වෙදනං වෙදියති, විසඤ්ඤුත්තො නං වෙදියති. අයං වුච්චති භික්ඛවෙ, සුතවා අරියසාවකො විසඤ්ඤුත්තො ජාතියා ජරාමරණෙන සොකෙහි පරිදෙවෙහි දුක්ඛෙහි දොමනස්සෙහි උපායාසෙහි, විසඤ්ඤුත්තො දුක්ඛස්මාති වදාමි. අයං ඛො භික්ඛවෙ විසෙසො, අයං අධිප්පායො, ඉදං නානාකරණං සුතවතො අරියසාවකස්ස අස්සුතවතා පුථුජ්ජනෙනාති."
            },
            {
                "type": "gatha",
                "text": "න{1 න සො - ස්යා.} වෙදනං වෙදියති සපඤ්ඤො{2 සපපඤ්ඤො - සී 1, 2.}\nසුඛම්පි දුක්ඛම්පි බහුස්සුතොපි\nඅයඤ්ච ධීරස්ස පුථුජ්ජනෙන\nමහා{3 අයං - ස්යා.}විසෙසො කුසලස්ස හොති.",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "සඞ්ඛාතධම්මස්ස බහුස්සුතස්ස\nසම්පස්සතො ලොකමිමං පරඤ්ච\nඉට්ඨස්ස ධම්මා න මථෙන්ති චිත්තං\nඅනිට්ඨතො නො පටිඝාතමෙති.",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "තස්සානුරොධා අථවා විරොධා\nවිධූපිතා{4 විධමිකා - ස්යා.} අත්ථගතා න සන්ති\nපදඤ්ච ඤත්වා විරජං අසොකං,\nසම්මා පජානාති භවස්ස පාරගූති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "1. 20. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ගෙලඤ්ඤසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "255. එකං සමයං භගවා වෙසාලියං විහරති මහාවනෙ කූටාගාරසාලායං. අථ ඛො භගවා සායන්හසමයං පටිසල්ලානා වුට්ඨිතො යෙන ගිලානසාලා තෙනුපසඞ්කමි, උපසඞ්කමිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදි. නිසජ්ජ ඛො භගවා භික්ඛූ ආමන්තෙසි: සතො භික්ඛවෙ භික්ඛු සම්පජානො කාලං ආගමෙය්ය. අයං වො අම්හාකං අනුසාසනී."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ භික්ඛු සතො හොති: ඉධ භික්ඛවෙ භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣා දොමනස්සං; වෙදනාසු වෙදනානුපස්සී -පෙ- චිත්තෙ චිත්තානුපස්සී -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා, විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං; එවං ඛො භික්ඛවෙ භික්ඛු සතො හොති."
            },
            {
                "type": "page-break",
                "text": "400"
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ භික්ඛු සම්පජානො හොති: ඉධ භික්ඛවෙ භික්ඛු අභික්කන්තෙ පටික්කන්තෙ සම්පජානකාරී හොති, ආලොකිතෙ විලොකිතෙ සම්පජානකාරී හොති, සමිඤ්ජිතෙ පසාරිතෙ සම්පජානකාරී හොති, සඞ්ඝාටිපත්තචීවරධාරණෙ සම්පජානකාරී හොති, අසිතෙ පීතෙ ඛායිතෙ සායිතෙ සම්පජානකාරී හොති, උච්චාරපස්සාවකම්මෙ සම්පජානකාරී හොති, ගතෙ ඨිතෙ නිසින්නෙ සුත්තෙ ජාගරිතෙ භාසිතෙ තුණ්හීභාවෙ සම්පජානකාරී හොති. එවං ඛො භික්ඛවෙ භික්ඛු සම්පජානො{1 සම්පජානකාරී - මඡසං. ස්යා.} හොති. සතො භික්ඛවෙ භික්ඛු සම්පජානො කාලං ආගමෙය්ය. අයං වො අම්හාකං අනුසාසනී."
            },
            {
                "type": "paragraph",
                "text": "තස්ස චෙ භික්ඛවෙ භික්ඛුනො එවං සතස්ස සම්පජානස්ස අප්පමත්තස්ස ආතාපිනො පහිතත්තස්ස විහරතො උප්පජ්ජති සුඛා වෙදනා; සො එවං පජානාති; උප්පන්නා ඛො ම්යායං{2 මෙ අයං - සී 2, ස්යා.} සුඛා වෙදනා. සා ච ඛො පටිච්ච නො අපටිච්ච. කිං පටිච්ච: ඉමමෙව කායං පටිච්ච. අයං ඛො පන කායො අනිච්චො සඞ්ඛතො පටිච්චසමුප්පන්නො. අනිච්චං ඛො පන සඞ්ඛතං පටිච්චසමුප්පන්නං කායං පටිච්ච උප්පන්නා සුඛා වෙදනා කුතො නිච්චා භවිස්සතී ති."
            },
            {
                "type": "paragraph",
                "text": "සො කායෙ ච සුඛාය ච වෙදනාය අනිච්චානුපස්සී විහරති වයානුපස්සී විහරති විරාගානුපස්සී විහරති, නිරොධානුපස්සී විහරති, පටිනිස්සග්ගානුපස්සී විහරති. තස්ස කායෙ ච සුඛාය ච වෙදනාය අනිච්චානුපස්සිනො විහරතො වයානුපස්සිනො විහරතො පටිනිස්සග්ගානුපස්සිනො විහරතො, යො කායෙ ච සුඛාය ච වෙදනාය රාගානුසයො, සො පහීයති."
            },
            {
                "type": "paragraph",
                "text": "තස්ස චෙ භික්ඛවෙ භික්ඛුනො එවං සතස්ස සම්පජානස්ස අප්පමත්තස්ස ආතාපිනො පහිතත්තස්ස විහරතො උප්පජ්ජති දුක්ඛා වෙදනා. සො එවං පජානාති: උප්පන්නා ඛො ම්යායං{3 මෙ අයං - සී 2, ස්යා.} දුක්ඛා වෙදනා. සා ච ඛො පටිච්ච, නො අපටිච්ච. කිං පටිච්ච, ඉමමෙව කායං පටිච්ච. අයං ඛො පන කායො අනිච්චො සඞ්ඛතො පටිච්චසමුප්පන්නො. අනිච්චං ඛො පන සඞ්ඛතං පටිච්චසමුප්පන්නං කායං පටිච්ච උප්පන්නා දුක්ඛා වෙදනා කුතො නිච්චා භවිස්සතීති."
            },
            {
                "type": "page-break",
                "text": "402"
            },
            {
                "type": "paragraph",
                "text": "සො කායෙ ච දුක්ඛාය ච වෙදනාය අනිච්චානුපස්සී විහරති, වයානුපස්සී විහරති, විරාගානුපස්සී විහරති, නිරොධානුපස්සී විහරති, පටිනිස්සග්ගානුපස්සී විහරති. තස්ස කායෙ ච දුක්ඛාය ච වෙදනාය අනිච්චානුපස්සිනො විහරතො වයානුපස්සිනො විහරෙතො විරාගානුපස්සිනො විහරතො නිරොධානුපස්සිනො විහරතො පටිනිස්සග්ගානුපස්සිනො විහරතො, යො කායෙ ච දුක්ඛාය ච වෙදනාය පටිඝානුසයො, සො පහීයති."
            },
            {
                "type": "paragraph",
                "text": "තස්ස චෙ භික්ඛවෙ භික්ඛුනො එවං සතස්ස සම්පජානස්ස අප්පමත්තස්ස ආතාපිනො පහිතත්තස්ස විහරතො උප්පජ්ජති අදුක්ඛමසුඛා වෙදනා, සො එවං පජානාති: උප්පන්නා ඛො ම්යායං අදුක්ඛමසුඛා වෙදනා. සා ච ඛො පටිච්ච, නො අප්පටිච්ච. කිං පටිච්ච, ඉමමෙව කායං පටිච්ච. අයං ඛො පන කායො අනිච්චො සඞ්ඛතො පටිච්චසමුප්පන්නො. අනිච්චං ඛො පන සඞ්ඛතං පටිච්චසමුප්පන්නං කායං පටිච්ච උප්පන්නා අදුක්ඛමසුඛා වෙදනා කුතො නිච්චා භවිස්සතී. සො කායෙ ච අදුක්ඛමසුඛාය ච වෙදනාය අනිච්චානුපස්සී විහරති, වයානුපස්සී විහරති, විරාගානුපස්සී විහරති, නිරොධානුපස්සී විහරති, පටිනිස්සග්ගානුපස්සී විහරති. තස්ස කායෙ ච අදුක්ඛමසුඛාය ච වෙදනාය අනිච්චානුපස්සිනො විහරතො වයානුපස්සිනො විහරතො විරාගානුපස්සිනො විහරතො නිරොධානුපස්සිනො විහරතො පටිනිස්සග්ගානු පස්සිනො විහරතො යො කායෙ ච අදුක්ඛමසුඛාය ච වෙදනාය අවිජ්ජානුසයො සො පහීයති."
            },
            {
                "type": "paragraph",
                "text": "සො සුඛඤ්චෙ වෙදනං වෙදියති, සා අනිච්චාති පජානාති, අනජ්ඣොසිතාති පජානාති, අනභිනන්දිතාති පජානාති; දුක්ඛඤ්චෙ වෙදනං වෙදියති, සා අනිච්චාති පජානාති, අනජ්ඣොසිතාති පජානාති, අනභිනන්දිතාති පජානාති; අදුක්ඛමසුඛඤ්චෙ වෙදනං වෙදියති, සා අනිච්චාති පජානාති, අනජ්ඣොසිතාති පජානාති, අනභිනන්දිතාති පජානාති; සො සුඛඤ්චෙ වෙදනං වෙදියති, විසඤ්ඤුත්තො නං වෙදියති; දුක්ඛඤ්චෙ වෙදනං වෙදියති, විසඤ්ඤුත්තො නං වෙදියති; අදුක්ඛමසුඛඤ්චෙ වෙදනං වෙදියති, විසඤ්ඤුත්තො නං වෙදියති; සො කායපරියන්තිකං වෙදනං වෙදියමානො කායපරියන්තිකං වෙදනං වෙදියාමීති පජානාති, ජීවිතපරියන්තිකං වෙදනං වෙදියමානො ජීවිතපරියන්තිකං වෙදනං වෙදියාමීති පජානාති; කායස්ස භෙදා උද්ධං ජීවිතපරියාදානා ඉධෙව සබ්බවෙදයිතානි අනභිනන්දිතානි සීතීභවිස්සන්තීති පජානාති."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ තෙලඤ්ච පටිච්ච වට්ටිඤ්ච පටිච්ච තෙලප්පදීපො ඣායෙය්ය,{1 ඣාපෙය්ය - සී 1, 2.} තස්සෙව තෙලස්ස ච වට්ටියා ච පරියාදානා අනාහාරො නිබ්බායෙය්ය; එවමෙව ඛො භික්ඛවෙ භික්ඛු කායපරියන්තිකං වෙදනං වෙදියමානො කායපරියන්තිකං වෙදනං වෙදියාමීති පජානාති. ජීවිතපරියන්තිකං{2 ජීවිතස්ස පරියන්තිකං - සී 1.} වෙදනං වෙදියමානො ජීවිතපරියන්තිකං වෙදනං වෙදියාමීති පජානාති. කායස්ස භෙදා උද්ධං ජීවිතපරියාදානා ඉධෙව සබ්බවෙදයිතානි අනභිනන්දිතානි සීතීභවිස්සන්තීති පජානාතී’ති."
            },
            {
                "type": "page-break",
                "text": "404"
            },
            {
                "type": "centered",
                "text": "1. 20. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය ගෙලඤ්ඤසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "256. එකං සමයං භගවා වෙසාලියං විහරති මහාවනෙ කූටාගාරසාලායං. අථ ඛො භගවා සායන්හසමයං පටිසල්ලාණා{1 පටිසල්ලානා - සී 2.} වුට්ඨිතො යෙන ගිලානසාලා තෙනුපසඞ්කමි, උපසඞ්කමිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදි. නිසජ්ජ ඛො භගවා භික්ඛූ ආමන්තෙසි: සතො භික්ඛවෙ භික්ඛු සම්පජානො කාලං ආගමෙය්ය. අයං වො අම්හාකං අනුසාසනී."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ භික්ඛු සතො හොති; ඉධ භික්ඛවෙ භික්ඛු කායෙ කායානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං; වෙදනාසු -පෙ- චිත්තෙ -පෙ- ධම්මෙසු ධම්මානුපස්සී විහරති ආතාපී සම්පජානො සතිමා විනෙය්ය ලොකෙ අභිජ්ඣාදොමනස්සං. එවං ඛො භික්ඛවෙ භික්ඛු සතො හොති."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ භික්ඛු සම්පජානො හොති: ඉධ භික්ඛවෙ භික්ඛු අභික්කන්තෙ පටික්කන්තෙ සම්පජානකාරී හොති, ආලොකිතෙ විලොකිතෙ සම්පජානකාරී හොති, සම්මිඤ්ජිතෙ පසාරිතෙ සම්පජානකාරී හොති, සඞ්ඝාටිපත්තචීවරධාරණෙ සම්පජානකාරී හොති, අසිතෙ පීතෙ ඛායිතෙ සායිතෙ සම්පජානකාරී හොති, උච්චාරපස්සාවකම්මෙ සම්පජානකාරී හොති, ගතෙ ඨිතෙ නිසින්නෙ සුත්තෙ ජාගරිතෙ භාසිතෙ තුණ්හීභාවෙ සම්පජානකාරී හොති: එවං ඛො භික්ඛවෙ භික්ඛු සම්පජානො හොති. සතො භික්ඛවෙ භික්ඛු සම්පජානො කාලං ආගමෙය්ය. අයං වො අම්හාකං අනුසාසනී."
            },
            {
                "type": "paragraph",
                "text": "තස්ස චෙ භික්ඛවෙ භික්ඛුනො එවං සතස්ස සම්පජානස්ස අප්පමත්තස්ස ආතාපිනො පහිතත්තස්ස විහරතො උප්පජ්ජති සුඛා වෙදනා. සො එවං පජානාති. උප්පන්නා ඛො ම්යායං සුඛා වෙදනා සා ච ඛො පටිච්ච, නො අප්පටිච්ච. කිං පටිච්ච, ඉමමෙව ඵස්සං පටිච්ච. අයං ඛො පන ඵස්සො අනිච්චො සඞ්ඛතො පටිච්චසමුප්පන්නො. අනිච්චං ඛො පන සඞ්ඛතං පටිච්චසමුප්පන්නං ඵස්සං පටිච්ච උප්පන්නා සුඛා වෙදනා කුතො නිච්චා භවිස්සතීති."
            },
            {
                "type": "page-break",
                "text": "406"
            },
            {
                "type": "paragraph",
                "text": "සො ඵස්සෙ ච සුඛාය ච වෙදනාය අනිච්චානුපස්සී විහරති, වයානුපස්සී විහරති, විරාගානුපස්සී විහරති, නිරොධානුපස්සී විහරති, පටිනිස්සග්ගානුපස්සී විහරති; තස්ස ඵස්සෙ ච සුඛාය ච වෙදනාය අනිච්චානුපස්සිනො විහරතො, වයානුපස්සිනො විහරතො, විරාගානුපස්සිනො විහරතො, නිරොධානුපස්සිනො විහරතො, පටිනිස්සග්ගානුපස්සිනො විහරතො යො ඵස්සෙ ච සුඛාය ච වෙදනාය රාගානුසයො, සො පහීයති."
            },
            {
                "type": "paragraph",
                "text": "තස්ස චෙ භික්ඛවෙ භික්ඛුනො එවං සතස්ස සම්පජානස්ස අප්පමත්තස්ස ආතාපිනො පහිතත්තස්ස විහරතො උප්පජ්ජති දුක්ඛා වෙදනා, සො එවං පජානාති: උප්පන්නා ඛො ම්යායං දුක්ඛා වෙදනා, සා ච ඛො පටිච්ච, නො අපටිච්ච. කිං පටිච්ච, ඉමමෙව ඵස්සං පටිච්ච, අයං ඛො පන ඵස්සො අනිච්චො සඞ්ඛතො පටිච්චසමුප්පන්නො, අනිච්චං ඛො පන සඞ්ඛතං පටිච්චසමුප්පන්නං ඵස්සං පටිච්ච උප්පන්නා දුක්ඛා වෙදනා කුතො නිච්චා භවිස්සතීති."
            },
            {
                "type": "paragraph",
                "text": "සො ඵස්සෙ ච දුක්ඛාය ච වෙදනාය අනිච්චානුපස්සී විහරති, වයානුපස්සී විහරති, විරාගානුපස්සී විහරති, නිරොධානුපස්සී විහරති, පටිනිස්සග්ගානුපස්සී විහරති: තස්ස ඵස්සෙ ච දුක්ඛාය ච වෙදනාය අනිච්චානුපස්සිනො විහරතො වයානුපස්සිනො විහරතො විරාගානුපස්සිනො විහරතො නිරොධානුපස්සිනො විහරතො පටිනිස්සග්ගයානුපස්සිනො විහරතො යො ඵස්සෙ ච දුක්ඛාය ච වෙදනාය පටිඝානුසයො සො පහීයති."
            },
            {
                "type": "paragraph",
                "text": "තස්ස චෙ භික්ඛවෙ භික්ඛුනො එවං සතස්ස සම්පජානස්ස අප්පමත්තස්ස ආතාපිනො පහිතත්තස්ස විහරතො උප්පජ්ජති අදුක්ඛමසුඛා වෙදනා, සො එවං පජානාති: උප්පන්නා ඛො ම්යායං අදුක්ඛමසුඛා වෙදනා: සා ච ඛො පටිච්ච, නො අපටිච්ච. කිඤ්ච පටිච්ච, ඉමමෙව ඵස්සං පටිච්ච අයං ඛො පන ඵස්සො අනිච්චො සඞ්ඛතො පටිච්චසමුප්පන්නො, අනිච්චං ඛො පන සඞ්ඛතං පටිච්චසමුප්පන්නං ඵස්සං පටිච්ච උප්පන්නා අදුක්ඛමසුඛා වෙදනා කුතො නිච්චා භවිස්සතීති."
            },
            {
                "type": "page-break",
                "text": "408"
            },
            {
                "type": "paragraph",
                "text": "සො ඵස්සෙ ච අදුක්ඛමසුඛාය ච වෙදනාය අනිච්චානුපස්සී විහරති, වයානුපස්සී විහරති, විරාගානුපස්සී විහරති, නිරොධානුපස්සී විහරති, පටිනිස්සග්ගානුපස්සී විහරති: තස්ස ඵස්සෙ ච අදුක්ඛමසුඛාය ච වෙදනාය අනිච්චානුපස්සිනො විහරතො වයානුපස්සිනො විහරතො විරාගානුපස්සිනො විහරතො නිරොධානුපස්සිනො විහරතො පටිනිස්සග්ගානුපස්සිනො විහරතො යො ඵස්සෙ ච අදුක්ඛමසුඛාය ච වෙදනාය අවිජ්ජානුසයො සො පහීයති."
            },
            {
                "type": "paragraph",
                "text": "සො සුඛඤ්චෙ වෙදනං වෙදියති: සා අනිච්චාති පජානාති, අනජ්ඣොසිතාති පජානාති, අනභිනන්දිතාති පජානාති, දුක්ඛඤ්චෙ වෙදනං වෙදියති -පෙ- අදුක්ඛමසුඛඤ්චෙ වෙදනං වෙදියති; සා අනිච්චාති පජානාති අනජ්ඣොසිතාති පජානාති, අනභිනන්දිතාති පජානාති, සො සුඛඤ්චෙ වෙදනං වෙදියති විසඤ්ඤුත්තො නං වෙදියති දුක්ඛඤ්චෙ වෙදනං වෙදියති -පෙ- අදුක්ඛමසුඛඤ්චෙ වෙදනං වෙදියති විසඤ්ඤුත්තො නං වෙදියති. සො කායපරියන්තිකං වෙදනං වෙදියමානො කායපරියන්තිකං වෙදනං වෙදියාමීති පජානාති. ජීවිතපරියන්තිකං වෙදනං වෙදනං වෙදියමානො ජීවිතපරියන්තිකං වෙදනං වෙදියාමීති පජානාති. කායස්ස භෙදා උද්ධං ජීවිතපරියාදානා ඉධෙව සබ්බවෙදයිතානි අනභිනන්දිතානි සීතීභවිස්සන්තීති පජානාති."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ තෙලඤ්ච පටිච්ච වට්ටිඤ්ච පටිච්ච තෙලප්පදීපො ඣායෙය්ය තස්සෙව තෙලස්ස ච වට්ටියා ච පරියාදානා අනාහාරො නිබ්බායෙය්ය, එවමෙව ඛො භික්ඛවෙ භික්ඛු කායපරියන්තිකං වෙදනං වෙදියමානො කායපරියන්තිකං වෙදනං වෙදියාමීති පජානාති. ජීවිතපරියන්තිකං වෙදනං වෙදියමානො ජීවිතපරියන්තිකං වෙදනං වෙදියාමීති පජානාති. කායස්ස භෙදා උද්ධං ජීවිතපරියාදානා ඉධෙව සබ්බවෙදයිතානි අනභිනන්දිතානි සීතීභවිස්සන්තීති පජානාතීති."
            },
            {
                "type": "centered",
                "text": "1. 20. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනිච්චසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "257. තිස්සො ඉමා භික්ඛවෙ වෙදනා අනිච්චා සඞ්ඛතා පටිච්ච සමුප්පන්නා ඛයධම්මා වයධම්මා විරාගධම්මා නිරොධධම්මා. කතමා තිස්සො: සුඛා වෙදනා දුක්ඛා වෙදනා අදුක්ඛමසුඛා වෙදනා ඉමා ඛො භික්ඛවෙ තිස්සො වෙදනා අනිච්චා සඞ්ඛතා පටිච්චසමුප්පන්නා ඛයධම්මා වයධම්මා විරාගධම්මා නිරොධධම්මා."
            },
            {
                "type": "page-break",
                "text": "410"
            },
            {
                "type": "centered",
                "text": "1. 20. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඵස්සමූලකසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "258. තිස්සො ඉමා භික්ඛවෙ වෙදනා ඵස්සජා ඵස්සමූලකා ඵස්සනිදානා ඵස්සපච්චයා. කතමා තිස්සො: සුඛා වෙදනා දුක්ඛා වෙදනා අදුක්ඛමසුඛා වෙදනා. සුඛවෙදනියං භික්ඛවෙ ඵස්සං පටිච්ච උප්පජ්ජති සුඛා වෙදනා. තස්සෙව සුඛවෙදනියස්ස ඵස්සස්ස නිරොධා යං තජ්ජං වෙදයිතං, සුඛවෙදනියං ඵස්සං පටිච්ච උප්පන්නා සුඛා වෙදනා සා නිරුජ්ඣති, සා වූපසම්මති;"
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛවෙදනියං භික්ඛවෙ ඵස්සං පටිච්ච උප්පජ්ජති දුක්ඛා වෙදනා. තස්සෙව දුක්ඛවෙදනියස්ස ඵස්සස්ස නිරොධා යං තජ්ජං වෙදයිතං දුක්ඛවෙදනියං ඵස්සං පටිච්ච උප්පන්නා දුක්ඛා වෙදනා සා නිරුජ්ඣති, සා වූපසම්මති. අදුක්ඛමසුඛවෙදනියං භික්ඛවෙ ඵස්සං පටිච්ච උප්පජ්ජති අදුක්ඛමසුඛා වෙදනා. තස්සෙව අදුක්ඛමසුඛවෙදනියස්ස ඵස්සස්ස නිරොධා යං තජ්ජං වෙදයිතං අදුක්ඛමසුඛවෙදනියං ඵස්සං පටිච්ච උප්පන්නා අදුක්ඛමසුඛා වෙදනා සා නිරුජ්ඣති, සා වූපසම්මති."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ, ද්වින්නං කට්ඨානං සඞ්ඝට්ටනසමොධානා උස්මා ජායති තෙජො අභිනිබ්බත්තති. තෙසං යෙව කට්ඨානං නානාභාවා විනික්ඛෙපා යා තජ්ජා උස්මා සා නිරුජ්ඣති, සා වූපසම්මති.{1 වූපසමති - ස්යා.} එවමෙව ඛො භික්ඛවෙ ඉමා තිස්සො වෙදනා ඵස්සජා ඵස්සමූලකා ඵස්සනිදානා ඵස්සපච්චයා තජ්ජං තජ්ජං ඵස්සං පටිච්ච තජ්ජා තජ්ජා වෙදනා උප්පජ්ජන්ති. තජ්ජස්ස තජ්ජස්ස ඵස්සස්ස නිරොධා තජ්ජා තජ්ජා වෙදනා නිරුජ්ඣන්තීති.{2 තජ්ජං ඵස්සං පටිච්ච තජ්ජා වෙදනා උපපජ්ජති තජ්ජස්ස ඵස්සස්ස නිරොධා තජ්ජා වෙදනා නිරුජ්ඣති - මඡසං, ස්යා.}"
            },
            {
                "type": "centered",
                "text": "සගාථාවග්ගො පඨමො .",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "සමාධි සුඛ පහානෙන පාතාලං දට්ඨබ්බෙන ච\nසල්ලෙන ව ගෙලඤ්ඤෙහි අනිච්ච ඵස්සමූලකාති.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "412"
            },
            {
                "type": "heading",
                "text": "2. රහොගතවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "2. 2. 1",
                "level": "1"
            },
            {
                "type": "heading",
                "text": " රහොගතසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "259. අථ ඛො අඤ්ඤතරො භික්ඛු යෙන භගවා තෙනුපසඞ්කමි. -පෙ- එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච: ඉධ මය්හං භන්තෙ රහොගතස්ස පටිසල්ලීනස්ස එවං චෙතසො පරිවිතක්කො උදපාදි: තිස්සො වෙදනා වුත්තා භගවතා. සුඛා වෙදනා, දුක්ඛා වෙදනා, අදුක්ඛමසුඛා වෙදනා. ඉමා තිස්සො වෙදනා වුත්තා භගවතා. වුත්තං ඛො පනෙතං භගවතා: යං කිඤ්චි වෙදයිතං තං දුක්ඛස්මින්ති. කින්නු ඛො එතං භගවතා සන්ධාය භාසිතං; යං කිඤ්චි වෙදයිතං තං දුක්ඛස්මින්ති."
            },
            {
                "type": "paragraph",
                "text": "සාධු සාධු භික්ඛු, තිස්සො ඉමා භික්ඛු වෙදනා වුත්තා මයා. සුඛා වෙදනා, දුක්ඛා වෙදනා, අදුක්ඛමසුඛා වෙදනා, ඉමා තිස්සො වෙදනා වුත්තා මයා. වුත්තං ඛො පනෙතං භික්ඛු මයා යං කිඤ්චි වෙදයිතං තං{1 සබ්බන්තං - සී 1.} දුක්ඛස්මින්ති. තං ඛො පනෙතං භික්ඛු මයා සඞ්ඛාරානඤ්ඤෙව අනිච්චතං සන්ධාය භාසිතං: යං කිඤ්චි වෙදයිතං තං දුක්ඛස්මින්ති. තං ඛො පනෙතං භික්ඛු මයා සඞ්ඛාරානඤ්ඤෙව{2 සඞ්ඛාරානං - යෙව - සී 1, 2.} ඛයධම්මතං සන්ධාය භාසිතං: යං කිඤ්චි වෙදයිතං තං දුක්ඛස්මින්ති. තං ඛො පනෙතං භික්ඛු මයා සඞ්ඛාරානඤ්ඤෙව{3 සඞ්ඛාරානං - යෙව - සී 1, 2.} වයධම්මතං සන්ධාය භාසිතං: යං කිඤ්චි වෙදයිතං තං දුක්ඛස්මින්ති. තං ඛො පනෙතං භික්ඛු මයා සඞ්ඛාරානඤ්ඤෙව විරාගධම්මතං සන්ධාය භාසිතං: යං කිඤ්චි වෙදයිතං තං දුක්ඛස්මින්ති. තං ඛො පනෙතං භික්ඛු මයා සඞ්ඛාරානඤ්ඤෙව නිරොධධම්මතං සන්ධාය භාසිතං: යං කිඤ්චි වෙදයිතං තං දුක්ඛස්මින්ති. තං ඛො පනෙතං භික්ඛු මයා සඞ්ඛාරානඤ්ඤෙව විපරිනාමධම්මතං සන්ධාය භාසිතං: යං කිඤ්චි වෙදයිතං තං දුක්ඛස්මින්ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො පන භික්ඛු මයා අනුපුබ්බ{4 අනුපුබ්බං - සී 1, 2.}සඞ්ඛාරානං නිරොධො අක්ඛාතො. පඨමං ඣානං සමාපන්නස්ස වාචා නිරුද්ධා හොති. දුතියං ඣානං සමාපන්නස්ස විතක්කවිචාරා නිරුද්ධා හොන්ති. තතියං ඣානං සමාපන්නස්ස පීති නිරුද්ධා හොති. චතුත්ථං ඣානං සමාපන්නස්ස අස්සාසපස්සාසා නිරුද්ධා හොන්ති. ආකාසානඤ්චායතනං සමාපන්නස්ස රූපසඤ්ඤා නිරුද්ධා හොති. විඤ්ඤාණඤ්චායතනං සමාපන්නස්ස ආකාසානඤ්චායතනසඤ්ඤා නිරුද්ධා හොති. ආකිඤ්චඤ්ඤායතනං සමාපන්නස්ස විඤ්ඤාණඤ්චායතනසඤ්ඤා නිරුද්ධා හොති. නෙවසඤ්ඤානාසඤ්ඤායතනං සමාපන්නස්ස ආකිඤ්චඤ්ඤායතනසඤ්ඤා නිරුද්ධා හොති. සඤ්ඤාවෙදයිතනිරොධං සමාපන්නස්ස සඤ්ඤා ච වෙදනා ච නිරුද්ධා හොන්ති. ඛීණාසවස්ස භික්ඛුනො රාගො නිරුද්ධො හොති, දොසො නිරුද්ධො හොති, මොහො නිරුද්ධො හොති."
            },
            {
                "type": "page-break",
                "text": "414"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො පන භික්ඛු මයා අනුපුබ්බසඞ්ඛාරානං වූපසමො අක්ඛාතො. පඨමං ඣානං සමාපන්නස්ස වාචා වූපසන්තා හොති. දුතියං ඣානං සමාපන්නස්ස විතක්කවිචාරා වූපසන්තා හොන්ති, තතියං ඣානං සමාපන්නස්ස පීති වූපසන්තා හොති, චතුත්ථං ඣානං සමාපන්නස්ස අස්සාසපස්සාසා වූපසන්තා හොන්ති, ආකාසානඤ්චායතනං සමාපන්නස්ස රූපසඤ්ඤා වූපසන්තා හොති, විඤ්ඤාණඤ්චායතනං සමාපන්නස්ස ආකාසානඤ්චායතනසඤ්ඤා වූපසන්තා හොති, ආකිඤ්චඤ්ඤායතනං සමාපන්නස්ස විඤ්ඤාණඤ්චායතනසඤ්ඤා වූපසන්තා හොති, නෙවසඤ්ඤානාසඤ්ඤායතනං සමාපන්නස්ස ආකිඤ්චඤ්ඤායතනසඤ්ඤා වූපසන්තා හොති, සඤ්ඤාවෙදයිතනිරොධං සමාපන්නස්ස සඤ්ඤා ච වෙදනා ච වූපසන්තා හොන්ති. ඛීණාසවස්ස භික්ඛුනො රාගො වූපසන්තො හොති, දොසො වූපසන්තො හොති, මොහො වූපසන්තො හොති."
            },
            {
                "type": "paragraph",
                "text": "ඡයිමා භික්ඛු පස්සද්ධියො: පඨමං ඣානං සමාපන්නස්ස වාචා පටිප්පස්සද්ධා හොති. දුතියං ඣානං සමාපන්නස්ස විතක්කවිචාරා පටිප්පස්සද්ධා හොන්ති. තතියං ඣානං සමාපන්නස්ස පීති පටිප්පස්සද්ධා හොති. චතුත්ථං ඣානං සමාපන්නස්ස අස්සාසපස්සාසා පටිප්පස්සද්ධා හොන්ති. සඤ්ඤාවෙදයිතනිරොධං සමාපන්නස්ස සඤ්ඤා ච වෙදනා ච පටිප්පස්සද්ධා හොන්ති. ඛීණාසවස්ස භික්ඛුනො රාගො පටිප්පස්සද්ධො හොති, දොසො පටිප්පස්සද්ධො හොති, මොහො පටිප්පස්සද්ධො හොතීති."
            },
            {
                "type": "centered",
                "text": "2. 2. 2",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආකාසසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "260. සෙය්යථාපි භික්ඛවෙ, ආකාසෙ විවිධා වාතා වායන්ති: පුරත්ථිමාපි වාතා වායන්ති, පච්ඡිමාපි වාතා වායන්ති, උත්තරාපි වාතා වායන්ති, දක්ඛිණාපි වාතා වායන්ති, සරජාපි වාතා වායන්ති, අරජාපි වාතා වායන්ති, සීතාපි වාතා වායන්ති, උණ්හාපි වාතා වායන්ති, පරිත්තාපි වාතා වායන්ති, අධිමත්තාපි වාතා වායන්ති. එවමෙව ඛො භික්ඛවෙ, ඉමස්මිං කායස්මිං විවිධා වෙදනා උප්පජ්ජන්ති: සුඛාපි වෙදනා උප්පජ්ජති, දුක්ඛාපි වෙදනා උප්පජ්ජති, අදුක්ඛමසුඛාපි වෙදනා උප්පජ්ජතී”ති."
            },
            {
                "type": "gatha",
                "text": "යථාපි වාතා ආකාසෙ වායන්ති විවිධා පුථු\nපුරත්ථිමා පච්ඡිමා චාපි උත්තරා අථ දක්ඛිණා.\n",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "සරජා අරජා වාපි සීතා උණ්හා ච එකදා\nඅධිමත්තා පරිත්තා ච පුථූ වායන්ති මාලුතා",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "තථෙවිමස්මිං කායස්මිං සමුප්පජ්ජන්ති{1 සමුප්පජ්ජති - සී 1, 2.} වෙදනා\nසුඛදුක්ඛසමුප්පත්ති අදුක්ඛමසුඛා ච යා.",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "යතො ච භික්ඛු ආතාපී සම්පජඤ්ඤං න රිඤ්චති{2 සම්පජානො නිරුජ්ඣති - ස්යා.}\nතතො සො{3 තතො ච - සීමු.} වෙදනා සබ්බා පරිජානාති පණ්ඩිතො.",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "සො වෙදනා පරිඤ්ඤාය දිට්ඨෙධම්මෙ අනාසවො\nකායස්ස භෙදා ධම්මට්ඨො සඞ්ඛ්යංනොපෙති{4 නූපෙති - ස්යා.} වෙදගූති.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "416"
            },
            {
                "type": "centered",
                "text": "2. 2. 3",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය ආකාසසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "261. සෙය්යථාපි භික්ඛවෙ ආකාසෙ විවිධා වාතා වායන්ති: පුරත්ථිමාපි වාතා වායන්ති -පෙ- අධිමත්තාපි වාතා වායන්ති. එවමෙව ඛො භික්ඛවෙ, ඉමස්මිං කායස්මිං විවිධා වෙදනා උප්පජ්ජන්ති, සුඛාපි වෙදනා උප්පජ්ජන්ති,{1 උප්පජ්ජති - ස්යා.} දුක්ඛාපි වෙදනා උප්පජ්ජන්ති,{2 උප්පජ්ජති - ස්යා.} අදුක්ඛමසුඛාපි වෙදනා උප්පජ්ජන්තී”ති."
            },
            {
                "type": "centered",
                "text": " 2. 2. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අගාරසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "262. සෙය්යථාපි භික්ඛවෙ ආගන්තුකාගාරං. තත්ථ පුරත්ථිමායපි දිසාය ආගන්ත්වා වාසං කප්පෙන්ති, පච්ඡිමාය පි දිසාය ආගන්ත්වා වාසං කප්පෙන්ති, උත්තරායපි දිසාය ආගන්ත්වා වාසං කප්පෙන්ති, දක්ඛිණායපි දිසාය ආගන්ත්වා වාසං කප්පෙන්ති. ඛත්තියාපි ආගන්ත්වා වාසං කප්පෙන්ති, බ්රාහ්මණාපි ආගන්ත්වා වාසං කප්පෙන්ති, වෙස්සාපි ආගන්ත්වා වාසං කප්පෙන්ති, සුද්දාපි ආගන්ත්වා වාසං කප්පෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො භික්ඛවෙ, ඉමස්මිං කායස්මිං විවිධා වෙදනා උප්පජ්ජන්ති: සුඛාපි වෙදනා උප්පජ්ජන්ති, දුක්ඛාපි වෙදනා උප්පජ්ජන්ති, අදුක්ඛමසුඛාපි වෙදනා උප්පජ්ජන්ති. සාමිසාපි සුඛා වෙදනා උප්පජ්ජන්ති, නිරාමිසාපි සුඛා වෙදනා උප්පජ්ජන්ති, සාමිසාපි දුක්ඛා වෙදනා උප්පජ්ජන්ති, නිරාමිසාපි දුක්ඛා වෙදනා උප්පජ්ජන්ති, සාමිසාපි අදුක්ඛමසුඛා වෙදනා උප්පජ්ජන්ති. නිරාමිසාපි අදුක්ඛමසුඛා වෙදනා උප්පජ්ජතීති."
            },
            {
                "type": "centered",
                "text": "2. 2. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සන්තකසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "263. අථ ඛො ආයස්මා ආනන්දො යෙන භගවා තෙනුපසඞ්කමි -පෙ- එකමන්තං නිසින්නො ඛො ආයස්මා ආනන්දො භගවන්තං එතදවොච: කතමා නු ඛො භන්තෙ වෙදනා? කතමො වෙදනා{3 වෙදනාය - සී 1, 2.}සමුදයො? කතමො වෙදනානිරොධො? කතමා වෙදනානිරොධගාමිනී පටිපදා? කො වෙදනාය අස්සාදො? කො{4 කො වෙදනාය - ස්යා.} ආදීනවො? කිං{5 කිං වෙදනාය - ස්යා.} නිස්සරණන්ති?"
            },
            {
                "type": "paragraph",
                "text": "තිස්සො ඉමා ආනන්ද, වෙදනා: සුඛා වෙදනා, දුක්ඛා වෙදනා, අදුක්ඛමසුඛා වෙදනා. ඉමා වුච්චන්ති ආනන්ද, වෙදනා. ඵස්සසමුදයා වෙදනාසමුදයො ඵස්සනිරොධා වෙදනානිරොධො. අයමෙව අරියො අට්ඨඞ්ගිකො මග්ගො වෙදනානිරොධගාමිනී පටිපදා. සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. යං වෙදනං පටිච්ච උප්පජ්ජති සුඛං සොමනස්සං, අයං වෙදනාය අස්සාදො. යා වෙදනා අනිච්චා දුක්ඛා විපරිණාමධම්මා, අයං වෙදනාය ආදීනවො. යො වෙදනාය ඡන්දරාගවිනයො ඡන්දරාගප්පහානං, ඉදං වෙදනාය නිස්සරණං."
            },
            {
                "type": "page-break",
                "text": "418"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො පනානන්ද, මයා අනුපුබ්බසඞ්ඛාරානං නිරොධො අක්ඛාතො. පඨමං ඣානං සමාපන්නස්ස වාචා නිරුද්ධා හොති -පෙ- සඤ්ඤාවෙදයිතනිරොධං සමාපන්නස්ස සඤ්ඤා ච වෙදනා ච නිරුද්ධා හොන්ති. ඛීණාසවස්ස භික්ඛුනො රාගො නිරුද්ධො හොති, දොසො නිරුද්ධො හොති, මොහො නිරුද්ධො හොති. අථ ඛො පනානන්ද, මයා අනුපුබ්බසඞ්ඛාරානං වූපසමො අක්ඛාතො. පඨමං ඣානං සමාපන්න්යස වාචා වූපසන්තා හොති -පෙ- සඤ්ඤා වෙදයිතනිරොධං සමාපන්න්යස සඤ්ඤා ච වෙදනා ච වූපසන්තා හොන්ති. ඛීණාසවස්ස භික්ඛුනො රාගො වූපසන්තො හොති, දොසො වූපසන්තො හොති, මොහො වූපසන්තො හොති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො පනානන්ද, මයා අනුපුබ්බසඞ්ඛාරානං පස්සද්ධි{1 පටිප්පස්සද්ධි - මඡසං, ස්යා.} අක්ඛාතා. පඨමං ඣානං සමාපන්නස්ස වාචා පටිප්පස්සද්ධා හොති, දුතියං ඣානං සමාපන්නස්ස විතක්කවිචාරා පටිප්පස්සද්ධා හොන්ති, තතියං ඣානං සමාපන්නස්ස පීති පටිප්පස්සද්ධා හොති, චතුත්ථං ඣානං සමාපන්නස්ස අස්සාසපස්සාසා පටිප්පස්සද්ධා හොන්ති, ආකාසානඤ්චායතනං සමාපන්නස්ස රූපසඤ්ඤා පටිප්පස්සද්ධා හොති, විඤ්ඤාණඤ්චායතනං සමාපන්නස්ස ආකාසානඤ්චායතනසඤ්ඤා පටිප්පස්සද්ධා හොති. ආකිඤ්චඤ්ඤායතනං සමාපන්නස්ස විඤ්ඤාණඤ්චායතනසඤ්ඤා පටිප්පස්සද්ධා හොති. නෙවසඤ්ඤානාසඤ්ඤායතනං සමාපන්නස්ස ආකිඤ්චඤ්ඤායතනසඤ්ඤා පටිප්පස්සද්ධා හොති. සඤ්ඤාවෙදයිතනිරොධං සමාපන්නස්ස සඤ්ඤා ච වෙදනා ච පටිප්පස්සද්ධා හොන්ති. ඛීණාසවස්ස භික්ඛුනො රාගො පටිප්පස්සද්ධො හොති, දොසො පටිප්පස්සද්ධො හොති, මොහො පටිප්පස්සද්ධො හොතීති."
            },
            {
                "type": "centered",
                "text": "2. 2. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතියසන්තකසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "264. අථ ඛො ආයස්මා ආනන්දො යෙන භගවා තෙනුපසඞ්කමි -පෙ- එකමන්තං නිසින්නං ඛො ආයස්මන්තං ආනන්දං භගවා එතදවොච: කතමා නු ඛො ආනන්ද වෙදනා? කතමො වෙදනා සමුදයො? කතමො වෙදනානිරොධො? කතමා වෙදනානිරොධගාමිනී පටිපදා? කො වෙදනාය අස්සාදො? කො ආදීනවො? කිං නිස්සරණන්ති?"
            },
            {
                "type": "paragraph",
                "text": "භගවම්මූලකා නො භන්තෙ ධම්මා භගවන්නෙත්තිකා භගවම්පටිසරණා. සාධු වත භන්තෙ භගවන්තං යෙව පටිභාතු එතස්ස භාසිතස්ස අත්ථො. භගවතො සුත්වා භික්ඛූ ධාරෙස්සන්තීති. තෙනහානන්ද සුණොහි සාධුකං මනසිකරොහි භාසිස්සාමීති. එවං භන්තෙති ඛො ආයස්මා ආනන්දො භගවතො පච්චස්සොසි. භගවා එතදවොච:"
            },
            {
                "type": "page-break",
                "text": "420"
            },
            {
                "type": "paragraph",
                "text": "තිස්සො ඉමා ආනන්ද වෙදනා: සුඛා වෙදනා, දුක්ඛා වෙදනා, අදුක්ඛමසුඛා වෙදනා. ඉමා වුච්චන්ති ආනන්ද වෙදනා. ඵස්සසමුදයා වෙදනාසමුදයො ඵස්සනිරොධා වෙදනානිරොධො. අයමෙව අරියො අට්ඨඞ්ගිකො මග්ගො වෙදනානිරොධගාමිනී පටිපදා සෙය්යථිදං: සම්මා දිට්ඨි -පෙ- සම්මාසමාධි. යං වෙදනං පටිච්ච උප්පජ්ජති සුඛං සොමනස්සං, අයං වෙදනාය අස්සාදො, යා වෙදනා අනිච්චා දුක්ඛා විපරිණාමධම්මා, අයං වෙදනාය ආදීනවො, යො වෙදනාය ඡන්දරාගවිනයො ඡන්දරාගප්පහානං ඉදං වෙදනාය නිස්සරණං."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො පනානන්ද මයා අනුපුබ්බසඞ්ඛාරානං නිරොධො අක්ඛාතො, පඨමං ඣානං සමාපන්නස්ස වාචා නිරුද්ධා හොති -පෙ- සඤ්ඤාවෙදයිතනිරොධං සමාපන්නස්ස සඤ්ඤා ච වෙදනා ච නිරුද්ධා හොන්ති: ඛීණාසවස්ස භික්ඛුනො රාගො නිරුද්ධො හොති, දොසො නිරුද්ධො හොති, මොහො නිරුද්ධො හොති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො පනානන්ද මයා අනුපුබ්බසඞ්ඛාරානං වූපසමො අක්ඛාතො, පඨමං ඣානං සමාපන්නස්ස වාචා වූපසන්තා හොති -පෙ- සඤ්ඤාවෙදයිතනිරොධං සමාපන්නස්ස සඤ්ඤා ච වෙදනා ච වූපසන්තා හොන්ති: ඛීණාසවස්ස භික්ඛුනො රාගො වූපසන්තො හොති, දොසො වූපසන්තො හොති, මොහො වූපසන්තො හොති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො පනානන්ද, මයා අනුපුබ්බසඞ්ඛාරානං පස්සද්ධි අක්ඛාතා, පඨමං ඣානං සමාපන්නස්ස වාචා පටිප්පස්සද්ධා හොති -පෙ- සඤ්ඤාවෙදයිතනිරොධං සමාපන්නස්ස සඤ්ඤා ච වෙදනා ච පටිප්පස්සද්ධා හොන්ති: ඛීණාසවස්ස භික්ඛුනො රාගො පටිප්පස්සද්ධො හොති, දොසො පටිප්පස්සද්ධො හොති, මොහො පටිප්පස්සද්ධො හොතීති."
            },
            {
                "type": "centered",
                "text": "2. 2. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අට්ඨකසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "265. අථ ඛො සම්බහුලා භික්ඛූ යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නා ඛො තෙ භික්ඛූ භගවන්තං එතදවොචුං: කතමා නු ඛො භන්තෙ වෙදනා? කතමො වෙදනා සමුදයො? කතමො වෙදනා නිරොධො? කතමා වෙදනානිරොධගාමිනී පටිපදා? කො වෙදනාය අස්සාදො? කො ආදීනවො? කිං නිස්සරණන්ති?"
            },
            {
                "type": "page-break",
                "text": "422"
            },
            {
                "type": "paragraph",
                "text": "තිස්සො ඉමා භික්ඛවෙ වෙදනා: සුඛා වෙදනා දුක්ඛා වෙදනා අදුක්ඛමසුඛා වෙදනා. ඉමා වුච්චන්ති භික්ඛවෙ වෙදනා. ඵස්සසමුදයා වෙදනා සමුදයො ඵස්සනිරොධා වෙදනා නිරොධො. අයමෙව අරියො අට්ඨඞ්ගිකො මග්ගො වෙදනානිරොධගාමිනී පටිපදා. සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. යං වෙදනං පටිච්ච උප්පජ්ජති සුඛං සොමනස්සං, අයං වෙදනාය අස්සාදො. යා වෙදනා අනිච්චා දුක්ඛා විපරිණාමධම්මා, අයං වෙදනාය ආදීනවො. යො වෙදනාය ඡන්දරාගවිනයො ඡන්දරාගප්පහානං, ඉදං වෙදනාය නිස්සරණං."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො පන භික්ඛවෙ මයා අනුපුබ්බසඞ්ඛාරානං නිරොධො අක්ඛාතො: පඨමං ඣානං සමාපන්නස්ස වාචා නිරුද්ධා හොති -පෙ- සඤ්ඤාවෙදයිතනිරොධං සමාපන්නස්ස සඤ්ඤා ච වෙදනා ච නිරුද්ධා හොන්ති. ඛීණාසවස්ස භික්ඛුනො රාගො නිරුද්ධො හොති, දොසො නිරුද්ධො හොති, මොහො නිරුද්ධො හොති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො පන භික්ඛවෙ මයා අනුපුබ්බසඞ්ඛාරානං වූපසමො අක්ඛාතො. පඨමං ඣානං සමාපන්නස්ස වාචා වූපසන්තා හොති, -පෙ- සඤ්ඤාවෙදයිතනිරොධං සමාපන්නස්ස සඤ්ඤා ච වෙදනා ච වූපසන්තා හොන්ති. ඛීණාසවස්ස භික්ඛුනො රාගො වූපසන්තො හොති, දොසො වූපසන්තො හොති, මොහො වූපසන්තො හොති."
            },
            {
                "type": "paragraph",
                "text": "ඡයිමා භික්ඛවෙ පස්සද්ධියො. පඨමං ඣානං සමාපන්නස්ස වාචා පටිප්පස්සද්ධා හොති. දුතියං ඣානං සමාපන්නස්ස විතක්කවිචාරා පටිප්පස්සද්ධා හොන්ති. තතියං ඣානං සමාපන්නස්ස පීති පටිප්පස්සද්ධා හොති. චතුත්ථං ඣානං සමාපන්නස්ස අස්සාසපස්සාසා පටිප්පස්සද්ධා හොන්ති. සඤ්ඤාවෙදයිතනිරොධං සමාපන්නස්ස සඤ්ඤා ච වෙදනා ච පටිප්පස්සද්ධා හොන්ති. ඛීණාසවස්ස භික්ඛුනො රාගො පටිප්පස්සද්ධො හොති, දොසො පටිප්පස්සද්ධො හොති, මොහො පටිප්පස්සද්ධො හොතීති."
            },
            {
                "type": "centered",
                "text": "2. 2. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතියඅට්ඨකසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "266. අථ ඛො සම්බහුලා භික්ඛූ යෙන භගවා තෙනුපසඞ්කමිංසු -පෙ- එකමන්තං නිසින්නො ඛො තෙ භික්ඛූ භගවා එතදවොච: කතමා නු ඛො භික්ඛවෙ වෙදනා? කතමො වෙදනාසමුදයො? කතමො වෙදනානිරොධො? කතමා වෙදනානිරොධගාමිනී පටිපදා? කො වෙදනාය අස්සාදො? කො ආදීනවො? කිං නිස්සරණන්ති?"
            },
            {
                "type": "paragraph",
                "text": "භගවම්මූලකා නො භන්තෙ ධම්මා -පෙ- තිස්සො ඉමා භික්ඛවෙ වෙදනා: සුඛා වෙදනා, දුක්ඛා වෙදනා, අදුක්ඛමසුඛා වෙදනා. ඉමා වුච්චන්ති භික්ඛවෙ වෙදනා. ඵස්සසමුදයා වෙදනා සමුදයො -පෙ- (යථා පුරිමසුත්තන්තං එවං විත්ථාරෙතබ්බං.)"
            },
            {
                "type": "page-break",
                "text": "424"
            },
            {
                "type": "centered",
                "text": "2. 2. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පඤ්චකඞ්ගසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "267. අථ ඛො පඤ්චකඞ්ගො{1 පඤ්චඞ්ගො b අට්ඨකථා.} ථපති යෙනායස්මා උදායී තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මන්තං උදායිං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො පඤ්චකඞ්ගො ථපති ආයස්මන්තං උදායිං එතදවොච: කති නු ඛො භන්තෙ උදායි වෙදනා වුත්තා භගවතාති?"
            },
            {
                "type": "paragraph",
                "text": "තිස්සො ඛො ගහපති වෙදනා වුත්තා භගවතා: සුඛා වෙදනා, දුක්ඛා වෙදනා, අදුක්ඛමසුඛා වෙදනා. ඉමා ඛො ගහපති තිස්සො වෙදනා වුත්තා භගවතාති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ පඤ්චකඞ්ගො ථපති ආයස්මන්තං උදායිං එතදවොච: න ඛො භන්තෙ උදායි තිස්සො වෙදනා වුත්තා භගවතා. ද්වෙ භන්තෙවෙදනා වුත්තා භගවතා සුඛා වෙදනා, දුක්ඛා වෙදනා. යායං භන්තෙ අදුක්ඛමසුඛා වෙදනා, සන්තස්මිං එසා පණීතෙ සුඛෙ වුත්තා භගවතාති."
            },
            {
                "type": "paragraph",
                "text": "දුතියම්පි ඛො ආයස්මා උදායී පඤ්චකඞ්ගං ථපතිං එතදවොච: න ඛො ගහපති ද්වෙ වෙදනා වුත්තා භගවතා. තිස්සො වෙදනා වුත්තා භගවතා: සුඛා වෙදනා, දුක්ඛා වෙදනා, අදුක්ඛමසුඛා වෙදනා. ඉමා තිස්සො වෙදනා වුත්තා භගවතාති."
            },
            {
                "type": "paragraph",
                "text": "දුතියම්පි ඛො පඤ්චකඞ්ගො ථපති ආයස්මන්තං උදායිං එතදවොච: න ඛො භන්තෙ උදායි තිස්සො වෙදනා වුත්තා භගවතා. ද්වෙ වෙදනා වුත්තා භගවතා: සුඛා වෙදනා, දුක්ඛා වෙදනා. යායං භන්තෙ අදුක්ඛමසුඛා වෙදනා සන්තස්මිං එසා පණීතෙ සුඛෙ වුත්තා භගවතාති."
            },
            {
                "type": "paragraph",
                "text": "තතියම්පි ඛො ආයස්මා උදායී පඤ්චකඞ්ගං ථපති එතදවොච: න ඛො ගහපති ද්වෙ වෙදනා වුත්තා භගවතා. තිස්සො වෙදනා වුත්තා භගවතා: සුඛා වෙදනා, දුක්ඛා වෙදනා, අදුක්ඛමසුඛා වෙදනා. ඉමා තිස්සො වෙදනා වුත්තා භගවතාති."
            },
            {
                "type": "paragraph",
                "text": "තතියම්පි ඛො පඤ්චකඞ්ගො ථපති ආයස්මන්තං උදායිං එතදවොච: න ඛො භන්තෙ උදායි තිස්සො වෙදනා වුත්තා භගවතා. ද්වෙ වෙදනා වුත්තා භගවතා: සුඛා වෙදනා, දුක්ඛා වෙදනා. යායං භන්තෙ අදුක්ඛමසුඛා වෙදනා, සන්තස්මිං එසා පණීතෙ සුඛෙ වුත්තා භගවතාති. නෙව ඛො අසක්ඛි ආයස්මා උදායී පඤ්චකඞ්ගං ථපතිං සඤ්ඤාපෙතුං, න පන අසක්ඛි පඤ්චකඞ්ගො ථපති ආයස්මන්තං උදායිං සඤ්ඤාපෙතුං."
            },
            {
                "type": "page-break",
                "text": "426"
            },
            {
                "type": "paragraph",
                "text": "අස්සොසි ඛො ආයස්මා ආනන්දො ආයස්මතො උදායිස්ස පඤ්චකඞ්ගෙන ථපතිනා සද්ධිං ඉමං කථාසල්ලාපං. අථ ඛො ආයස්මා ආනන්දො යෙන භගවා තෙනුපසඞ්කමි -පෙ- එකමන්තං නිසින්නො ඛො ආයස්මා ආනන්දො යාවතකො ආයස්මතො උදායිස්ස පඤ්චකඞ්ගෙන ථපතිනා සද්ධිං අහොසි කථාසල්ලාපො තං සබ්බං භගවතො ආරොචෙසි."
            },
            {
                "type": "paragraph",
                "text": "සන්තං යෙව ඛො ආනන්ද පරියායං පඤ්චකඞ්ගො ථපති උදායිස්ස භික්ඛුනො නාබ්භනුමොදි, සන්තඤ්ච පනානන්ද, පරියායං උදායී භික්ඛු පඤ්චකඞ්ගස්ස ථපතිනො නාබ්භනුමොදි. ද්වෙපි මයා ආනන්ද, වෙදනා වුත්තා පරියායෙන. තිස්සොපි මයා වෙදනා වුත්තා පරියායෙන. පඤ්චපි මයා වෙදනා වුත්තා පරියායෙන. ඡපි මයා වෙදනා වුත්තා පරියායෙන. අට්ඨාරසාපි මයා වෙදනා වුත්තා පරියායෙන. ඡත්තිංසාපි මයා වෙදනා වුත්තා පරියායෙන. අට්ඨසතම්පි මයා වෙදනා වුත්තා පරියායෙන."
            },
            {
                "type": "paragraph",
                "text": "එවං පරියායදෙසිතො{1 පරියායෙන - සී 1, 2.} ඛො ආනන්ද මයා ධම්මො. එවං පරියාය දෙසිතෙ ඛො ආනන්ද මයා ධම්මෙ යෙ අඤ්ඤමඤ්ඤස්ස සුභාසිතං සුලපිතං, න සමනුමඤ්ඤිස්සන්ති, න සමනුජානිස්සන්ති, න සමනුමොදිස්සන්ති; නෙසං{2 තෙසං - සී 1, 2.} එතං පාටිකඞ්ඛං භණ්ඩනජාතා කලහජාතා විවාදාපන්නා අඤ්ඤමඤ්ඤං මුඛසත්තීහි විතුදන්තා විහරිස්සන්තීති."
            },
            {
                "type": "paragraph",
                "text": "එවං පරියායදෙසිතො ඛො ආනන්ද, මයා ධම්මො. එවං පරියාය දෙසිතෙ ඛො ආනන්ද, මයා ධම්මෙ යෙ අඤ්ඤමඤ්ඤස්ස සුභාසිතං සුලපිතං සමනුමඤ්ඤිස්සන්ති සමනුජානිස්සන්ති, සමනුමොදිස්සන්ති, නෙසං එතං පාටිකඞ්ඛං, සමග්ගා සම්මොදමානා අවිවදමානා ඛීරොදකී භූතා අඤ්ඤමඤ්ඤං පියචක්ඛූහි සම්පස්සන්තා විහරිස්සන්තීති."
            },
            {
                "type": "paragraph",
                "text": "පඤ්චිමෙ ආනන්ද කාමගුණා. කතමෙ පඤ්ච: චක්ඛුවිඤ්ඤෙය්යා රූපා ඉට්ඨා කන්තා මනාපා පියරූපා කාමූපසංහිතා රජනීයා, සොතවිඤ්ඤෙය්යා සද්දා -පෙ- ඝානවිඤ්ඤෙය්යා ඝන්ධා -පෙ- ජිව්හාවිඤ්ඤෙය්යා රසා -පෙ- කායවිඤ්ඤෙය්යා ඵොට්ඨබ්බා ඉට්ඨා කන්තා මනාපා පියරූපා කාමූපසංහිතා රජනීයා. ඉමෙ ඛො ආනන්ද පඤ්ච කාමගුණා. යං ඛො ආනන්ද ඉමෙ පඤ්ච කාමගුණෙ පටිච්ච උප්පජ්ජති සුඛං සොමනස්සං, ඉදං වුච්චති කාමසුඛං. යෙ ඛො ආනන්ද එවං වදෙය්යුං: එතං පරමං සන්තං සුඛං සොමනස්සං පටිසංවෙදෙන්තීති, ඉදං නෙසාහං නානුජානාමි. තං කිස්ස හෙතු: අත්ථානන්ද එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරං චෙව පණීතතරඤ්ච."
            },
            {
                "type": "page-break",
                "text": "428"
            },
            {
                "type": "paragraph",
                "text": "කතමඤ්චානන්ද එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච: ඉධානන්ද භික්ඛු විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහරති. ඉදං ඛො ආනන්ද, එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච."
            },
            {
                "type": "paragraph",
                "text": "යෙ ඛො ආනන්ද, එවං වදෙය්යුං: “එතං පරමං සන්තං සුඛංසොමනස්සං පටිසංවෙදෙන්තී”ති, ඉදං නෙසාහං නානුජානාමි. තං කිස්ස හෙතු: අත්ථානන්ද, එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච. කතමඤ්චානන්ද එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච: ඉධානන්ද භික්ඛු විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියං ඣානං උපසම්පජ්ජ විහරති. ඉදං ඛො ආනන්ද එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච."
            },
            {
                "type": "paragraph",
                "text": "යෙ ඛො ආනන්ද එවං වදෙය්යුං: එතං පරමං සන්තං සුඛං සොමනස්සං පටිසංවෙදෙන්තීති, ඉදං නෙසාහං නානුජානාමි. තං කිස්ස හෙතු: අත්ථානන්ද, එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච. කතමඤ්චානන්ද එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච: ඉධානන්ද, භික්ඛු පීතියා ච විරාගා උපෙක්ඛකො ච විහරති සතො ච සම්පජානො සුඛඤ්ච කායෙන පටිසංවෙදෙති, යන්තං අරියා ආචික්ඛන්ති, උපෙක්ඛකො සතිමා සුඛවිහාරීති, තං තතියං ඣානං උපසම්පජ්ජ විහරති. ඉදං ඛො ආනන්ද එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච."
            },
            {
                "type": "paragraph",
                "text": "යෙ ඛො ආනන්ද එවං වදෙය්යුං: එතං පරමං සන්තං සුඛං සොමනස්සං පටිසංවෙදෙන්තීති, ඉදං නෙසාහං නානුජානාමි. තං කිස්ස හෙතු: අත්ථානන්ද එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච. කතමඤ්චානන්ද, එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච: ඉධානන්ද භික්ඛු සුඛස්ස ච පහානා දුක්ඛස්ස ච පහානා පුබ්බෙව සොමනස්සදොමනස්සානං අත්ථගමා අදුක්ඛමසුඛං උපෙක්ඛාසති පාරිසුද්ධිං චතුත්ථං ඣානං උපසම්පජ්ජ විහරති. ඉදං ඛො ආනන්ද එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච."
            },
            {
                "type": "paragraph",
                "text": "යෙ ඛො ආනන්ද එවං වදෙය්යුං: එතං පරමං සන්තං සුඛං සොමනස්සං පටිසංවෙදෙන්තීති, ඉදං නෙසාහං නානුජානාමි. තං කිස්ස හෙතු: අත්ථානන්ද එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච. කතමඤ්චානන්ද එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච: ඉධානන්ද භික්ඛු සබ්බසො රූප සඤ්ඤානං සමතික්කමා, පටිඝසඤ්ඤානං අත්ථගමා නානත්තසඤ්ඤානං අමනසිකාරා අනන්තො ආකාසොති ආකාසානඤ්චායතනං උපසම්පජ්ජ විහරති. ඉදං ඛො ආනන්ද එතම්හා සුඛා -පෙ-"
            },
            {
                "type": "page-break",
                "text": "430"
            },
            {
                "type": "paragraph",
                "text": "යෙ ඛො ආනන්ද එවං වදෙය්යුං: ‘එතං පරමං සන්තං සුඛං සොමනස්සං පටිසංවෙදෙන්තී’ති, ඉදං නෙසාහං නානුජානාමි. තං කිස්ස හෙතු: අත්ථානන්ද එතම්හා සුඛා -පෙ- කතමඤ්චානන්ද, එතම්හා සුඛා අඤ්ඤං සුඛං -පෙ- ඉධානන්ද භික්ඛු සබ්බසො ආකාසානඤ්චායතනං සමතික්කම්ම අනන්තං විඤ්ඤාණන්ති විඤ්ඤාණඤ්චායතනං උපසම්පජ්ජ විහරති. ඉදං ඛො ආනන්ද එතම්හා සුඛා -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "යෙ ඛො ආනන්ද එවං වදෙය්යුං: එතං පරමං සන්තං සුඛං සොමනස්සං පටිසංවෙදෙන්තීති, ඉදං නෙසාහං නානුජානාමි. තං කිස්ස හෙතු: අත්ථානන්ද එතම්හා සුඛා -පෙ- කතමඤ්චානන්ද එතම්හා සුඛා අඤ්ඤං සුඛං -පෙ- ඉධානන්ද භික්ඛු සබ්බසො විඤ්ඤාණඤ්චායතනං සමතික්කම්ම නත්ථි කිඤ්චීති ආකිඤ්චඤ්ඤායතනං උපසම්පජ්ජ විහරති. ඉදං ඛො ආනන්ද එතම්හා සුඛා -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "යෙ ඛො ආනන්ද එවං වදෙය්යුං: ‘එතං පරමං සන්තං සුඛං සොමනස්සං පටිසංවෙදෙන්තී’ති, ඉදං නෙසාහං නානුජානාමි. තං කිස්ස හෙතු: අත්ථානන්ද එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච. කතමඤ්චානන්ද එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච: ඉධානන්ද භික්ඛු සබ්බසො ආකිඤ්චඤ්ඤායතනං සමතික්කම්ම නෙවසඤ්ඤානාසඤ්ඤායතනං උපසම්පජ්ජ විහරති. ඉදං ඛො ආනන්ද එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච."
            },
            {
                "type": "paragraph",
                "text": "යෙ ච ඛො ආනන්ද එවං වදෙය්යුං: ‘එතං පරමං සන්තං සුඛං සොමනස්සං පටිසංවෙදෙන්තී’ති ඉදං නෙසාහං නානුජානාමි. තං කිස්ස හෙතු: අත්ථානන්ද එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච: කතමඤ්චානන්ද එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච: ඉධානන්ද භික්ඛු සබ්බසො නෙවසඤ්ඤානාසඤ්ඤායතනං සමතික්කම්ම සඤ්ඤාවෙදයිතනිරොධං උපසම්පජ්ජ විහරති. ඉදං ඛො ආනන්ද එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච."
            },
            {
                "type": "paragraph",
                "text": "ඨානං ඛො පනෙතං ආනන්ද, විජ්ජති යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං: “සඤ්ඤාවෙදයිතනිරොධං සමණො ගොතමො ආහ, තඤ්ච සුඛස්මිං පඤ්ඤාපෙති. තයිදං කිංසු තයිදං කථංසූ”ති? එවංවාදිනො ආනන්ද අඤ්ඤතිත්ථියා පරිබ්බාජකා එවමස්සු වචනීයා: න ඛො ආවුසො භගවා සුඛං යෙව වෙදනං සන්ධාය සුඛස්මිං පඤ්ඤාපෙති. යත්ථ යත්ථාවුසො සුඛං උපලබ්භති, යං හි යං හි සුඛං තං තං තථාගතො සුඛස්මිං පඤ්ඤාපෙතී”ති."
            },
            {
                "type": "page-break",
                "text": "432"
            },
            {
                "type": "centered",
                "text": "2. 2. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "භික්ඛුසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "268. ද්වෙපි මයා{1 ද්වෙ මයා - සී 1, 2.} භික්ඛවෙ වෙදනා වුත්තා පරියායෙන, තිස්සොපි මයා වෙදනා වුත්තා පරියායෙන, පඤ්චපි මයා වෙදනා වුත්තා පරියායෙන, ඡපි{2 ඡාපි - සී 1, ස්යා.} මයා වෙදනා වුත්තා පරියායෙන, අට්ඨාරසපි{3 අට්ඨාරසාපි - සී 1, ස්යා.} මයා වෙදනා වුත්තා පරියායෙන, ඡත්තිංසාපි මයා වෙදනා වුත්තා පරියායෙන, අට්ඨසතම්පි මයා වෙදනා වුත්තා පරියායෙන."
            },
            {
                "type": "paragraph",
                "text": "එවං පරියායදෙසිතො භික්ඛවෙ මයා ධම්මො. එවං පරියාය දෙසිතෙ ඛො පන භික්ඛවෙ මයා ධම්මෙ යෙ අඤ්ඤමඤ්ඤස්ස සුභාසිතං සුලපිතං න සමනුමඤ්ඤිස්සන්ති, න සමනුජානිස්සන්ති, න සමනුමොදිස්සන්ති, නෙසං එතං පාටිකඞ්ඛං: ‘භණ්ඩනජාතා කලහජාතා විවාදාපන්නා අඤ්ඤමඤ්ඤං{4 අඤ්ඤඤෙඤස්ස - සී 1, ස්යා.} මුඛසත්තීහි විතුදන්තා විහරිස්සන්තී’ති."
            },
            {
                "type": "paragraph",
                "text": "එවං පරියායදෙසිතො භික්ඛවෙ මයා ධම්මො. එවං පරියායදෙසිතෙ ඛො පන භික්ඛවෙ මයා ධම්මෙ යෙ අඤ්ඤමඤ්ඤස්ස සුභාසිතං සුලපිතං සමනුමඤ්ඤිස්සන්ති, සමනුජාතිස්සන්ති, සමනුමොදිස්සන්ති: නෙසං එතං පටිකඞ්ඛං: සමග්ගා සම්මොදමානා ඛීරොදකීභූතා අඤ්ඤමඤ්ඤං පියචක්ඛූහි සම්පස්සන්තා විහරිස්සන්තී’ති."
            },
            {
                "type": "paragraph",
                "text": "පඤ්චිමෙ භික්ඛවෙ කාමගුණා. කතමෙ පඤ්ච: චක්ඛුවිඤ්ඤෙය්යා රූපා ඉට්ඨා කන්තා මනාපා පියරූපා කාමූපසංහිතා රජනීයා -පෙ- කායවිඤ්ඤෙය්යා ඵොට්ඨබ්බා ඉට්ඨා කන්තා මනාපා පියරූපා කාමූපසංහිතා රජනීයා, ඉමෙ ඛො භික්ඛවෙ පඤ්ච කාමගුණා."
            },
            {
                "type": "paragraph",
                "text": "යං ඛො භික්ඛවෙ ඉමෙ පඤ්චකාමගුණෙ පටිච්ච උප්ජ්ජති සුඛං සොමනස්සං, ඉදං වුච්චති කාමසුඛං. යෙ ඛො භික්ඛවෙ එවං වදෙය්යුං: එතං පරමං සන්තං සුඛං සොමනස්සං පටිසංවෙදෙන්තීති, ඉදං නෙසාහං නානුජානාමි. තං කිස්ස හෙතු: අත්ථි භික්ඛවෙ එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච: කතමඤ්ච භික්ඛවෙ එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච: ඉධ භික්ඛවෙ භික්ඛු විවච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමං ඣානං උපසම්පජ්ජ විහරති. ඉදං ඛො භික්ඛවෙ එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච."
            },
            {
                "type": "page-break",
                "text": "434"
            },
            {
                "type": "paragraph",
                "text": "යො ඛො භික්ඛවෙ එවං වදෙය්යුං: ‘එතං පරමං සන්තං සුඛං සොමනස්සං පටිසංවෙදෙන්තී’ති. ඉදං නෙසාහං නානුජානාමි. තං කිස්ස හෙතු: අත්ථි භික්ඛවෙ එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච: කතමඤ්ච භික්ඛවෙ එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච: ඉධ භික්ඛවෙ භික්ඛු -පෙ- සබ්බසො නෙවසඤ්ඤානාසඤ්ඤායතනං සමතික්කම්ම සඤ්ඤාවෙදයිතනිරොධං උපසම්පජ්ජ විහරති, ඉදං ඛො භික්ඛවෙ එතම්හා සුඛා අඤ්ඤං සුඛං අභික්කන්තතරඤ්ච පණීතතරඤ්ච."
            },
            {
                "type": "paragraph",
                "text": "ඨානං ඛො පනෙතං භික්ඛවෙ විජ්ජති යං අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං වදෙය්යුං: “සඤ්ඤාවෙදයිතනිරොධං සමණො ගොතමො ආහ, තඤ්ච සුඛස්මිං පඤ්ඤාපෙති. තයිදං කිංසු, තයිදං කථංසූ”ති? එවං වාදිනො භික්ඛවෙ අඤ්ඤතිත්ථියා පරිබ්බාජකා එවමස්සු වචනීයා: “න ඛො ආවුසො භගවා සුඛං යෙව වෙදනං සන්ධාය සුඛස්මිං පඤ්ඤාපෙති. යත්ථ යත්ථාවුසො සුඛං උපලබ්භති, යං හි යං හි සුඛං තං තං තථාගතො සුඛස්මිං පඤ්ඤාපෙතී”ති."
            },
            {
                "type": "centered",
                "text": "රහොගතවග්ගො දුතියො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "රහොගතං ද්වෙ ච ආකාසා අගාරං ද්වෙ ච සන්තකා\nඅට්ඨකෙන ච ද්වෙ වුත්තා පඤ්චකඞ්ගොථ භික්ඛුනා.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "436"
            },
            {
                "type": "heading",
                "text": "3. අට්ඨසතපරියායවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "2. 3. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මොළියසීවකසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "269. එකං සමයං භගවා රාජගහෙ විහරති වෙළුවනෙ කලන්දකනිවාපෙ. අථ ඛො මොළියසීවකො{1 මොලිය සීවකො - ස්යා.} පරිබ්බාජකො යෙන භගවා තෙනුපසඞ්කමි, උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො මොළියසීවකො පරිබ්බාජකො භගවන්තං එතදවොච: සන්ති හි භො ගොතම, එකෙ සමණබ්රාහ්මණා එවංවාදිනො එවංදිට්ඨිනො: “යං කිඤ්චායං පුරිසපුග්ගලො පටිසංවෙදියති සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා සබ්බන්තං පුබ්බෙකතහෙතූ”ති. ඉධ භවං ගොතමො කිමාහාති?"
            },
            {
                "type": "paragraph",
                "text": "පිත්තසමුට්ඨානානිපි ඛො සීවක ඉධෙකච්චානි වෙදයිතානි උප්පජ්ජන්ති. සාමම්පි ඛො එතං සීවක වෙදිතබ්බං, යථා පිත්තසමුට්ඨානානිපි ඉධෙකච්චානි වෙදයිතානි උප්පජ්ජන්තීති, ලොකස්සපි ඛො එතං{2 එවං - ස්යා.} සීවක සච්චසම්මතං. යථා පිත්තසමුට්ඨානානිපි ඉධෙකච්චානි වෙදයිතානි උප්පජ්ජන්ති. තත්ර සීවක යෙ තෙ සමණබ්රාහ්මණා එවං වාදිනො එවංදිට්ඨිනො: “යං කිඤ්චායං පුරිසපුග්ගලො පටිසංවෙදියති සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා සබ්බන්තං පුබ්බෙකතහෙතූ”ති. යඤ්ච සාමං ඤාතං තඤ්ච අතිධාවන්ති, යඤ්ච ලොකෙ සච්චසම්මතං තඤ්ච අතිධාවන්ති. තස්මා නෙසං සමණබ්රාහ්මණානං මිච්ඡාති වදාමි."
            },
            {
                "type": "paragraph",
                "text": "සෙම්හසමුට්ඨානානිපි ඛො සීවක -පෙ- වාතසමුට්ඨානානිපි ඛො සීවක -පෙ- සන්නිපාතිකානිපි{3 සන්නිපාතසමුට්ඨානානිපි - ස්යා.} ඛො සීවක -පෙ- උතුපරිණාමජානිපි ඛො සීවක -පෙ- විසමපරිහාරජානිපි ඛො සීවක -පෙ- ඔපක්කමිකානිපි ඛො සීවක -පෙ- කම්මවිපාකජානිපි ඛො සීවක ඉධෙකච්චානි වෙදයිතානි උප්පජ්ජන්ති. සාමම්පි ඛො එතං සීවක වෙදිතබ්බං. යථා කම්මවිපාකජානිපි ඛො සීවක ඉධෙකච්චානි වෙදයිතානි උප්පජ්ජන්ති, ලොකස්සපි ඛො එතං සීවක සච්චසම්මතං යථා කම්මවිපාකජානිපි ඉධෙකච්චානි වෙදයිතානි උප්පජ්ජන්ති, තනු සීවක යෙ තෙ සමණබ්රාහ්මණා එවංවාදිනො එවංදිට්ඨිනො: “යං කිඤ්චායං පුරිසපුග්ගලො පටිසංවෙදියති සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා, සබ්බං තං පුබ්බෙකතහෙතූ”ති. යඤ්ච සාමං ඤාතං තඤ්ච අතිධාවන්ති, යඤ්ච ලොකෙ සච්චසම්මතං තඤ්ච අතිධාවන්ති. තස්මා නෙසං සමණබ්රාහ්මණානං මිච්ඡාති වදාමීති."
            },
            {
                "type": "page-break",
                "text": "438"
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ මොළියසීවකො පරිබ්බාජකො භගවන්තං එතදවොච: “අභික්කන්තං භො ගොතම -පෙ- උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගත”න්ති."
            },
            {
                "type": "gatha",
                "text": "පිත්තං සෙම්හඤ්ච වාතො ච සන්නිපාතා උතූනි ච\nවිසමං ඔපක්කමිකො ච කම්මවිපාකෙන අට්ඨමීති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "2. 3. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අට්ඨසතපරියායසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "270. අට්ඨසතපරියායං වො භික්ඛවෙ ධම්මපරියායං දෙසිස්සාමි. තං සුණාථ. කතමො ච භික්ඛවෙ අට්ඨසතපරියායො ධම්මපරියායො: ද්වෙපි{1 ද්වෙ - සීමු.} මයා භික්ඛවෙ වෙදනා වුත්තා පරියායෙන, තිස්සොපි මයා වෙදනා වුත්තා පරියායෙන, පඤ්චපි මයා වෙදනා වුත්තා පරියායෙන, ඡපි මයා වෙදනා වුත්තා පරියායෙන, අට්ඨාරසාපි මයා වෙදනා වුත්තා පරියායෙන, ඡත්තිංසාපි මයා වෙදනා වුත්තා පරියායෙන, අට්ඨසතම්පි මයා වෙදනා වුත්තා පරියායෙන."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ ද්වෙ වෙදනා: කායිකා ච චෙතසිකා ච, ඉමා වුච්චන්ති භික්ඛවෙ ද්වෙ වෙදනා. කතමා ච භික්ඛවෙ තිස්සො වෙදනා: සුඛා වෙදනා දුක්ඛා වෙදනා අදුක්ඛමසුඛා වෙදනා, ඉමා වුච්චන්ති භික්ඛවෙ තිස්සො වෙදනා. කතමා ච භික්ඛවෙ පඤ්ච වෙදනා: සුඛින්ද්රියං දුක්ඛින්ද්රියං සොමනස්සින්ද්රියං දොමනස්සින්ද්රියං උපෙක්ඛින්ද්රියං, ඉමා වුච්චන්ති භික්ඛවෙ පඤ්ච වෙදනා. කතමා ච භික්ඛවෙ ඡ වෙදනා: චක්ඛුසම්ඵස්සජා වෙදනා සොත -පෙ- ඝාන -පෙ- ජිව්හා -පෙ- කාය -පෙ- මනොසම්ඵස්සජා වෙදනා, ඉමා වුච්චන්ති භික්ඛවෙ ඡ වෙදනා."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ අට්ඨාරස වෙදනා: ඡ සොමනස්සූපවිචාරා ඡ දොමනස්සූපවිචාරා ඡ උපෙක්ඛූපවිචාරා, ඉමා වුච්චන්ති භික්ඛවෙ අට්ඨාරස වෙදනා. කතමා ච භික්ඛවෙ ඡත්තිංස{2 ඡත්තිංසා - සී 1.} වෙදනා: ඡ ගෙහසිතානි සොමනස්සානි ඡ නෙක්ඛම්මසිතානි සොමනස්සානි ඡ ගෙහසිතානි දොමනස්සානි ඡ නෙක්ඛම්මසිතානි දොමනස්සානි ඡ ගෙහසිතා උපෙක්ඛා ඡ නෙක්ඛම්මසිතා උපෙක්ඛා, ඉමා වුච්චන්ති භික්ඛවෙ ඡත්තිංස වෙදනා. කතමා ච භික්ඛවෙ අට්ඨසත{3 අට්ඨසතං - සී 1, 2.} වෙදනා: අතීතා ඡත්තිංස වෙදනා, අනාගතා ඡත්තිංස වෙදනා, පච්චුප්පන්නා ඡත්තිංස වෙදනා, ඉමා වුච්චන්ති භික්ඛවෙ අට්ඨසතවෙදනා. අයං භික්ඛවෙ අට්ඨසතපරියායො ධම්මපරියායොති."
            },
            {
                "type": "page-break",
                "text": "440"
            },
            {
                "type": "centered",
                "text": "2. 3. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "භික්ඛුසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "271. අථ ඛො අඤ්ඤතරො භික්ඛු යෙන භගවා තෙනුපසඞ්කමි -පෙ- එකමන්තං නිසින්නො ඛො සො භික්ඛු භගවන්තං එතදවොච: කතමා නු ඛො භන්තෙ වෙදනා? කතමො වෙදනාසමුදයො? කතමා වෙදනාසමුදයගාමිනී පටිපදා? කතමො වෙදනානිරොධො? කතමා වෙදනානිරොධගාමිනී පටිපදා? කො වෙදනාය අස්සාදො? කො ආදීනවො? කිං නිස්සරණන්ති?"
            },
            {
                "type": "paragraph",
                "text": "තිස්සො ඉමා භික්ඛු වෙදනා. සුඛා වෙදනා දුක්ඛා වෙදනා අදුක්ඛමසුඛා වෙදනා. ඉමා වුච්චන්ති භික්ඛු වෙදනා. ඵස්සසමුදයා වෙදනාසමුදයො. තණ්හා වෙදනාසමුදයගාමිනී පටිපදා. ඵස්සනිරොධා වෙදනානිරොධො. අයමෙව අරියො අට්ඨඞ්ගිකො මග්ගො වෙදනානිරොධගාමිනී පටිපදා. සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. යං වෙදනං පටිච්ච උප්පජ්ජති සුඛං සොමනස්සං අයං වෙදනාය අස්සාදො. යා වෙදනා අනිච්චා දුක්ඛා විපරිණාමධම්මා අයං වෙදනාය ආදීනවො. යො වෙදනාය ඡන්දරාගවිනයො ඡන්දරාගප්පහානං, ඉදං වෙදනාය නිස්සරණන්ති."
            },
            {
                "type": "centered",
                "text": "2. 3. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පුබ්බෙසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "272. පුබ්බෙව මෙ භික්ඛවෙ සම්බොධා අනභිසම්බුද්ධස්ස බොධිසත්තස්සෙව සතො එතදහොසි: කතමා නු ඛො වෙදනා, කතමො වෙදනාසමුදයො, කතමා වෙදනාසමුදයගාමිනී පටිපදා, කතමො වෙදනානිරොධො, කතමා වෙදනානිරොධගාමිනී පටිපදා, කො වෙදනාය අස්සාදො, කො ආදීනවො, කිං නිස්සරණන්ති."
            },
            {
                "type": "paragraph",
                "text": "තස්ස මය්හං භික්ඛවෙ එතදහොසි: තිස්සො ඉමා වෙදනා, සුඛා වෙදනා, දුක්ඛා වෙදනා, අදුක්ඛමසුඛා වෙදනා. ඉමා වුච්චන්ති වෙදනා. ඵස්සසමුදයා වෙදනාසමුදයො. තණ්හා වෙදනාසමුදයගාමිනී පටිපදා -පෙ- යො වෙදනාය ඡන්දරාගවිනයො ඡන්දරාගප්පහානං. ඉදං වෙදනාය නිස්සරණන්ති."
            },
            {
                "type": "page-break",
                "text": "442"
            },
            {
                "type": "centered",
                "text": "2. 3. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඤාණසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "273. ඉමා වෙදනාති මෙ භික්ඛවෙ පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු චක්ඛුං උදපාදි, ඤාණං උදපාදි, පඤ්ඤා උදපාදි, විජ්ජා උදපාදි, ආලොකො උදපාදි. අයං වෙදනාසමුදයොති මෙ භික්ඛවෙ පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු චක්ඛුං උදපාදි -පෙ- ආලොකො උදපාදි. අයං වෙදනා{1 වෙදනාය - සී 1, 2.}සමුදයගාමිනී පටිපදාති මෙ භික්ඛවෙ පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු චක්ඛුං උදපාදි -පෙ- ආලොකො උදපාදි, අයං වෙදනා නිරොධොති මෙ භික්ඛවෙ පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු චක්ඛුං උදපාදි -පෙ- ආලොකො උදපාදි, අයං වෙදනානිරොධගාමිනී පටිපදාති මෙ භික්ඛවෙ පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු -පෙ- අයං වෙදනාය අස්සාදොති මෙ භික්ඛවෙ පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු -පෙ- අයං වෙදනාය ආදීනවොති මෙ භික්ඛවෙ පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු -පෙ- ඉදං වෙදනාය නිස්සරණන්ති මෙ භික්ඛවෙ පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු චක්ඛුං උදපාදි ඤාණං උදපාදි පඤ්ඤා උදපාදි විජ්ජා උදපාදි ආලොකො උදපාදීති."
            },
            {
                "type": "centered",
                "text": "2. 3. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සම්බහුලභික්ඛුසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "274. අථ ඛො සම්බහුලා භික්ඛූ යෙන භගවා තෙනුපසඞ්කමිංසු -පෙ- එකමන්තං නිසින්නා ඛො තෙ භික්ඛූ භගවන්තං එතදවොචුං: කතමා නු ඛො භන්තෙ වෙදනා? කතමො වෙදනාසමුදයො? කතමා වෙදනාසමුදයගාමිනීපටිපදා? කතමො වෙදනානිරොධො? කතමා වෙදනානිරොධගාමිනී පටිපදා? කො වෙදනාය අස්සාදො? කො ආදීනවො? කිං නිස්සරණන්ති?"
            },
            {
                "type": "paragraph",
                "text": "තිස්සො ඉමා භික්ඛවෙ වෙදනා: සුඛා වෙදනා, දුක්ඛා වෙදනා, අදුක්ඛමසුඛා වෙදනා. ඉමා වුච්චන්ති භික්ඛවෙ වෙදනා. ඵස්සසමුදයා වෙදනාසමුදයො. තණ්හා වෙදනාසමුදයගාමිනී පටිපදා. ඵස්සනිරොධා වෙදනානිරොධො. -පෙ- යො වෙදනාය ඡන්දරාගවිනයො ඡන්දරාගප්පහානං. ඉදං වෙදනාය නිස්සරණන්ති."
            },
            {
                "type": "centered",
                "text": "2. 3. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සමණබ්රාහ්මණසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "275. තිස්සො ඉමා භික්ඛවෙ වෙදනා. කතමා තිස්සො: සුඛා වෙදනා දුක්ඛා වෙදනා අදුක්ඛමසුඛා වෙදනා. යෙ හි කෙචි භික්ඛවෙ සමණා වා බ්රාහ්මණා වා ඉමාසං තිස්සන්නං වෙදනානං සමුදයඤ්ච අත්ථගමඤ්ච අස්සාදඤ්ච ආදීනවඤ්ච නිස්සරණඤ්ච යථාභූතං නප්පජානන්ති -පෙ- පජානන්ති -පෙ- සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරන්තීති."
            },
            {
                "type": "page-break",
                "text": "444"
            },
            {
                "type": "centered",
                "text": "2. 3. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය සමණබ්රාහ්මණසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "276. තිස්සො ඉමා භික්ඛවෙ වෙදනා. කතමා තිස්සො: සුඛා වෙදනා දුක්ඛා වෙදනා අදුක්ඛමසුඛා වෙදනා. යෙ හි කෙචි භික්ඛවෙ සමණා වා බ්රාහ්මණා වා ඉමාසං තිස්සන්නං වෙදනානං සමුදයඤ්ච අත්ථගමඤ්ච අස්සාදඤ්ච ආදීනවඤ්ච නිස්සරණඤ්ච යථාභූතං නප්පජානන්ති -පෙ- පජානන්ති -පෙ- සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරන්තීති."
            },
            {
                "type": "centered",
                "text": "2. 3. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තතිය සමණබ්රාහ්මණසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "277. යෙ හි කොචි භික්ඛවෙ සමණා වා බ්රාහ්මණා වා වෙදනං නප්පජානන්ති, වෙදනාසමුදයං නප්පජානන්ති, වෙදනානිරොධං නප්පජානන්ති, වෙදනානිරොධගාමිනිං පටිපදං නප්පජානන්ති, -පෙ- පජානන්ති, -පෙ- සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරන්තීති."
            },
            {
                "type": "centered",
                "text": "2. 3. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුද්ධිකවෙදනාසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "278. තිස්සො ඉමා භික්ඛවෙ වෙදනා. කතමා තිස්සො: සුඛා වෙදනා දුක්ඛා වෙදනා අදුක්ඛමසුඛා වෙදනා. ඉමා ඛො භික්ඛවෙ තිස්සො වෙදනාති."
            },
            {
                "type": "centered",
                "text": "2. 3. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නිරාමිසසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "279. අත්ථි භික්ඛවෙ සාමිසා පීති, අත්ථි නිරාමිසා පීති, අත්ථි නිරාමිසා නිරාමිසතරා පීති. අත්ථි සාමිසං සුඛං, අත්ථි නිරාමිසං සුඛං, අත්ථි නිරාමිසා නිරාමිසතරං සුඛං. අත්ථි සාමිසා උපෙඛා, අත්ථි නිරාමිසා උපෙඛා, අත්ථි නිරාමිසා නිරාමිසතරා උපෙඛා. අත්ථි සාමිසො විමොක්ඛො, අත්ථි නිරාමිසො විමොක්ඛො, අත්ථි නිරාමිසා නිරාමිසතරො විමොක්ඛො."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ{1 කතමා ච සා භික්ඛවෙ - සී 1.} සාමිසා පීති: පඤ්චිමෙ භික්ඛවෙ කාමගුණා. කතමෙ පඤ්ච: චක්ඛුවිඤ්ඤෙය්යා රූපා ඉට්ඨා කන්තා මනාපා පියරූපා කාමූපසංහිතා රජනීයා -පෙ- කායවිඤ්ඤෙය්යා ඵොට්ඨබ්බා ඉට්ඨා කන්තා මනාපා පියරූපා කාමූපසංහිතා රජනීයා. ඉමෙ ඛො භික්ඛවෙ පඤ්චකාමගුණා. යා ඛො භික්ඛවෙ ඉමෙ පඤ්ච කාමගුණෙ පටිච්ච උප්පජ්ජති පීති, අයං වුච්චති භික්ඛවෙ සාමිසා පීති."
            },
            {
                "type": "page-break",
                "text": "446"
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ නිරාමිසා පීති: ඉධ භික්ඛවෙ භික්ඛු විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමජ්ඣානං උපසම්පජ්ජ විහරති. විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියජ්ඣානං උපසම්පජ්ජ විහරති. අයං වුච්චති භික්ඛවෙ නිරාමිසා පීති."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ නිරාමිසා නිරාමිසතරා පීති: යා ඛො භික්ඛවෙ ඛීණාසවස්ස භික්ඛුනො රාගා චිත්තං විමුත්තං පච්චවෙක්ඛතො දොසා චිත්තං විමුත්තං පච්චවෙක්ඛතො මොහා චිත්තං විමුත්තං පච්චවෙක්ඛතො උප්පජ්ජති පීති. අයං වුච්චති භික්ඛවෙ නිරාමිසා නිරාමිසතරා පීති."
            },
            {
                "type": "paragraph",
                "text": "කතමඤ්ච භික්ඛවෙ සාමිසං සුඛං: පඤ්චිමෙ භික්ඛවෙ කාමගුණා. කතමෙ පඤ්ච: චක්ඛුවිඤ්ඤෙය්යා රූපා ඉට්ඨා කන්තා මනාපා පියරූපා කාමූපසංහිතා රජනීයා -පෙ- කායවිඤ්ඤෙය්යා ඵොට්ඨබ්බා ඉට්ඨා කන්තා මනාපා පියරූපා කාමූපසංහිතා රජනීයා. ඉමෙ ඛො භික්ඛවෙ පඤ්චකාමගුණා. යං ඛො භික්ඛවෙ ඉමෙ පඤ්චකාමගුණෙ පටිච්ච උප්පජ්ජති සුඛං සොමනස්සං, ඉදං වුච්චති භික්ඛවෙ සාමිසං සුඛං."
            },
            {
                "type": "paragraph",
                "text": "කතමඤ්ච භික්ඛවෙ නිරාමිසං සුඛං: ඉධ භික්ඛවෙ භික්ඛු විවිච්චෙව කාමෙහි විවිච්ච අකුසලෙහි ධම්මෙහි සවිතක්කං සවිචාරං විවෙකජං පීතිසුඛං පඨමජ්ඣානං උපසම්පජ්ජ විහරති. විතක්කවිචාරානං වූපසමා අජ්ඣත්තං සම්පසාදනං චෙතසො එකොදිභාවං අවිතක්කං අවිචාරං සමාධිජං පීතිසුඛං දුතියජ්ඣානං උපසම්පජ්ජ විහරති. පීතියා ච විරාගා උපෙඛකො ච විහරති සතො සම්පජානො සුඛඤ්ච කායෙන පටිසංවෙදෙති, යං තං අරියා ආචික්ඛන්ති උපෙඛකො සතිමා සුඛවිහාරීති තං තතියජ්ඣානං උපසම්පජ්ජ විහරති. ඉදං වුච්චති භික්ඛවෙ නිරාමිසං සුඛං."
            },
            {
                "type": "paragraph",
                "text": "කතමඤ්ච භික්ඛවෙ නිරාමිසා නිරාමිසතරං සුඛං: යං ඛො භික්ඛවෙ ඛීණාසවස්ස භික්ඛුනො රාගා චිත්තං විමුත්තං පච්චවෙක්ඛතො දොසා චිත්තං විමුත්තං පච්චවෙක්ඛතො මොහා චිත්තං විමුත්තං පච්චවෙක්ඛතො උප්පජ්ජති සුඛං සොමනස්සං, ඉදං වුච්චති භික්ඛවෙ නිරාමිසානිරාමිසතරං සුඛං."
            },
            {
                "type": "page-break",
                "text": "448"
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ සාමිසා උපෙඛා: පඤ්චිමෙ භික්ඛවෙ කාමගුණා. කතමෙ පඤ්ච: චක්ඛුවිඤ්ඤෙය්යා රූපා ඉට්ඨා කන්තා මනාපා පියරූපා කාමූපසංහිතා රජනීයා -පෙ- කායවිඤ්ඤෙය්යා ඵොට්ඨබ්බා ඉට්ඨා කන්තා මනාපා පියරූපා කාමූපසංහිතා රජනීයා. ඉමෙ ඛො භික්ඛවෙ පඤ්චකාමගුණා. යා ඛො භික්ඛවෙ ඉමෙ පඤ්ච කාමගුණෙ පටිච්ච උප්පජ්ජති උපෙඛා, අයං වුච්චති භික්ඛවෙ සාමිසා උපෙඛා."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ නිරාමිසා උපෙඛා: ඉධ භික්ඛවෙ භික්ඛු සුඛස්ස ච පහානා දුක්ඛස්ස ච පහානා පුබ්බෙව සොමනස්සදොමනස්සානං අත්ථඞ්ගමා අදුක්ඛමසුඛං උපෙඛාසතිපාරිසුද්ධිං චතුත්ථජ්ඣානං උපසම්පජ්ජ විහරති. අයං වුච්චති භික්ඛවෙ නිරාමිසා උපෙඛා."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ නිරාමිසා නිරාමිසතරා උපෙඛා: යා ඛො භික්ඛවෙ ඛීණාසවස්ස භික්ඛුනො රාගා චිත්තං විමුත්තං පච්චවෙක්ඛතො දොසා චිත්තං විමුත්තං පච්චවෙක්ඛතො මොහා චිත්තං විමුත්තං පච්චවෙක්ඛතො උප්පජ්ජති උපෙඛා, අයං වුච්චති භික්ඛවෙ නිරාමිසා නිරාමිසතරා උපෙඛා."
            },
            {
                "type": "paragraph",
                "text": "කතමො ච භික්ඛවෙ සාමිසො විමොක්ඛො: රූපපටිසඤඤුත්තො විමොක්ඛො සාමිසො විමොක්ඛො. කතමො ච භික්ඛවෙ නිරාමිසො විමොක්ඛො: අරූපපටිසඤ්ඤුත්තො විමොක්ඛො නිරාමිසො විමොක්ඛො. කතමො ච භික්ඛවෙ නිරාමිසා නිරාමිසතරො විමොක්ඛො{1 විමොඛො - සී 1.}: යො ඛො භික්ඛවෙ ඛීණාසවස්ස භික්ඛුනො රාගා චිත්තං විමුත්තං පච්චවෙක්ඛතො දොසා චිත්තං විමුත්තං පච්චවෙක්ඛතො මොහා චිත්තං විමුත්තං පච්චවෙක්ඛතො උප්පජ්ජති විමොක්ඛො, අයං වුච්චති භික්ඛවෙ නිරාමිසා නිරාමිසතරො විමොක්ඛොති."
            },
            {
                "type": "centered",
                "text": "අට්ඨසතපරියායවග්ගොතතියො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "සීවකට්ඨසතං භික්ඛු පුබ්බෙඤාණඤ්ච භික්ඛුනා\nසමණබ්රාහ්මණා තීණි සුද්ධිකඤ්ච නිරාමිසන්ති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "වෙදනාසංයුත්තං නිට්ඨිතං.",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ],
        "pages": {
            "390": {
                "pageNum": 390,
                "footnotesCount": 5
            },
            "392": {
                "pageNum": 392,
                "footnotesCount": 7
            },
            "394": {
                "pageNum": 394,
                "footnotesCount": 0
            },
            "396": {
                "pageNum": 396,
                "footnotesCount": 5
            },
            "398": {
                "pageNum": 398,
                "footnotesCount": 4
            },
            "400": {
                "pageNum": 400,
                "footnotesCount": 3
            },
            "402": {
                "pageNum": 402,
                "footnotesCount": 2
            },
            "404": {
                "pageNum": 404,
                "footnotesCount": 1
            },
            "406": {
                "pageNum": 406,
                "footnotesCount": 0
            },
            "408": {
                "pageNum": 408,
                "footnotesCount": 0
            },
            "410": {
                "pageNum": 410,
                "footnotesCount": 2
            },
            "412": {
                "pageNum": 412,
                "footnotesCount": 4
            },
            "414": {
                "pageNum": 414,
                "footnotesCount": 4
            },
            "416": {
                "pageNum": 416,
                "footnotesCount": 5
            },
            "418": {
                "pageNum": 418,
                "footnotesCount": 1
            },
            "420": {
                "pageNum": 420,
                "footnotesCount": 0
            },
            "422": {
                "pageNum": 422,
                "footnotesCount": 0
            },
            "424": {
                "pageNum": 424,
                "footnotesCount": 1
            },
            "426": {
                "pageNum": 426,
                "footnotesCount": 2
            },
            "428": {
                "pageNum": 428,
                "footnotesCount": 0
            },
            "430": {
                "pageNum": 430,
                "footnotesCount": 0
            },
            "432": {
                "pageNum": 432,
                "footnotesCount": 4
            },
            "434": {
                "pageNum": 434,
                "footnotesCount": 0
            },
            "436": {
                "pageNum": 436,
                "footnotesCount": 3
            },
            "438": {
                "pageNum": 438,
                "footnotesCount": 3
            },
            "440": {
                "pageNum": 440,
                "footnotesCount": 0
            },
            "442": {
                "pageNum": 442,
                "footnotesCount": 1
            },
            "444": {
                "pageNum": 444,
                "footnotesCount": 1
            },
            "446": {
                "pageNum": 446,
                "footnotesCount": 0
            },
            "448": {
                "pageNum": 448,
                "footnotesCount": 1
            }
        }
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "391"
            },
            {
                "text": "2. වෙදනා සංයුක්තය",
                "type": "heading",
                "level": 3
            },
            {
                "text": "1. සගාථා වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "1. 20. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සමාධි සූත්‍රය",
                "level": 1
            },
            {
                "text": "249. මහණෙනි, මේ වේදනා තුනෙකි. කවර තුනෙක් ද යත්: සුව වේදනා ය, දුක් වේදනා ය, නොදුක්නොසුව වේදනා යි. මහණෙනි, මේ වේදනා තුන යි.",
                "type": "paragraph"
            },
            {
                "text": "සමාධිගත වූ මනා නුවණැති බුද්ධශ්‍රාවක තෙමේ වේදනාවත් දනී. වේදනාවන්ගේ සමුදයයත් දනී. මේ වේදනාවෝ යම් තැනෙක නිරුද්ධ වෙත් ද ඒ නිවනත් ඒ වේදනා නැසීමට යන මගත් (දනී) මහණ තෙමේ වේදනාවන් ක්ෂය වීමෙන් තුෂ්ණා නැත්තේ පිරිනිවියේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "1. 20. 2.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "සුඛ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "250. මහණෙනි, මේ වේදනා තුනෙකි. කවර තුනෙක් ද යත්: සුව වෙදනා ය, දුක් වෙදනා ය, නොදුක්නොසුව වේදනා යි. මහණෙනි, වේදනා තුන යි.",
                "type": "paragraph"
            },
            {
                "text": "සුව වූ ද ඉදින් දුක් වූ ද නොදුක්නොසුව වූ ද තමා කෙරෙහි වූ ද පිටත්හි වූ ද, යම්කිසි වේදනාවක් වේ නම්නැ සෙන සුලු බිදෙන සුලු මෙය දුක යයි දැන නුවණින් පැහැස පැහැස වැය දක්නේ මෙසේ එහි නො ඇලේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "1. 20. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පහාන සූත්‍රය",
                "level": "1"
            },
            {
                "text": "250. මහණෙනි, මේ වේදනා තුනෙකි. කවර තුනෙක් ද යත්: සුව වේදනා ය, දුක් වේදනා ය, නොදුක්නොසුව වේදනා යි. මහණෙනි, සුවවේදනාවෙන් රගානුසයය පහකටයුතු ය. දුක්වේදනාවෙන් පටිඝානුසයය පහකටයුතු ය. නොදුක් නොසුව වේදනාවෙන් අවිජ්ජානුසයය පහකටයුතු යි. මහණෙනි, යම් කලෙක මහණහට සුවවේදනාවෙන් රාගනුසයය ප්‍රහීණ වූයේ වේ ද දුක්වේදනාවෙන් පටිඝානුසයය ප්‍රහීණ වුයේ වේ ද නොදුක් නොසුව වේදනාවෙන් අවිජ්ජානුසයය ප්‍රහීණ වූයේ වේ ද මහණෙනි, පහ වූ රාගානුසයය ඇති මේ මහණ තෘෂ්ණාව සිඳදැම්මේ ය. සංයොජන මුලිනුපුටා හළේ ය. මැනවින් මනාවබොධයෙන් දුක් කෙළවර කෙළේ යයි කියනු ලැබේ. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "393"
            },
            {
                "text": "වේදනාව නොදන්නා (වෙදනා) නිස්සරණය නොදක්නා සුව වේදනාව විඳින්නහුට රාගානුසය වේ. ",
                "type": "paragraph"
            },
            {
                "text": "වේදනාව නොදන්නා (වෙදනා) නිස්සරණය නොදක්නා දුක් වේදනාව විඳින්නහුට පටිඝානුසය වේ.",
                "type": "paragraph"
            },
            {
                "text": "මහප්‍රාඥතථාගතයන් වහන්සේ විසින් ශාන්තය යි වදාළ නොදුක් නොසුව වේදනාව ද පතන්නේ දුකෙන් නොමැ මිදෙයි.",
                "type": "paragraph"
            },
            {
                "text": "යම් හෙයකින් කෙලෙස් තවන වෙර ඇති මහණ මනා නුවණ නො හරී ද එහෙයින් ඒ පණඩිත තෙමේ සියලු වේදනා පිරිසිඳ දනී.",
                "type": "paragraph"
            },
            {
                "text": "හෙතෙමේ වේදනා පිරිසිඳ දැන දිටුදැමියෙහි කෙලෙස් රහිත වූයේ නිවනට පැමිණියේ දහම්හි පිහිටියේ කාබුන් (මරණින් මතු) පැනවීමකට නො පැමිණේ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "1. 20. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පාතාල සූත්‍රය",
                "level": "1"
            },
            {
                "text": "252. මහණෙනි, ඇසු පිරූ තැන් නැති පුහුදුන් තෙමේ මහමුහුදෙහි පාතාලයෙක් ඇති යි මෙබඳු වචනයක් කියයි. මහණෙනි, අසු පිරූ තැන් නැති පුහුදුන් තෙමේ නැති නො පෙනෙන (තැනක් ගැන) මහමුහුදෙහි පාතාලයෙක් ඇතැ යි මෙසේ මේ වචනය කියයි. මහණෙනි, පාතාල යන මෙය ශරීරයෙහි හටගන්නා දුක්වේදනාවන්ට නමෙකි. මහණෙනි, නූගත් පුහුදුන් තෙමේ ශරීරයෙහි හටගත් දුක් වේදනාවෙන් පහස්නා ලද්දේ ම ශෝක කෙරෙහි. ක්ලාන්ත වෙයි. හඬයි ලෙහි පහරමින් හඬයි. මුළාවට පැමිණෙයි. මහණෙනි, මේ නූගත් පුහුදුන් තෙමේ පාතාලයෙහි නො පිහිටියේ ය. පිහිට ද නො ලැබුවේ යයි කියනු ලැබේ. මහණෙනි, උගත් අරීසවු තෙමේ ශරීරයෙහි හටගත් දුක්වේදනාවෙන් පහස්නා ලද්දේ ම ශෝක නොකෙරෙයි. ක්ලාන්ත නො වෙයි. නො හඬයි. ලෙහි පහරමින් නො හඬයි. මුළාවට නො පැමිණෙයි. මහණෙනි, මේ ශ්‍රැතවත් ආර්‍ය්‍යශ්‍රාවක පාතාලයෙහි පිහිටියේ ය. පිහිටි ද ලැබුයේ යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් යමකින් පහස්නා ලද්දේ සැලේ ද ශරීරයෙහි වූ දිවි තොර කරන ඒ උපන් දුක් වේදනා නො ඉවසා ද.",
                "type": "paragraph"
            },
            {
                "text": "දුබල වූ නුවණ ඇති මඳ වූ ඥානශක්ති ඇති හෙතෙමේ හඬයි වැලපෙයි. පාතාලයෙහි නො පිහිටයි යළි පිහිටකුදු නො ලැබුයේ ය.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් යමකින් පහස්න ලද්දේ නො සැලේ ද, ශරීරයෙහි වූ දිවි තොර කරන ඒ උපන් දුක් වේදනා ඉවසා ද, හෙතෙමේ පාතාලයෙහි පිහිටයි. යළි පිහිට ද ලැබුයේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "395"
            },
            {
                "type": "centered",
                "text": "1. 20. 5.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "දට්‌ඨබ්‌බ සූත්‍රය",
                "level": 1
            },
            {
                "text": "253. මහණෙනි, මේ වේදනා තුනෙකි. කවර තුනෙක් ද යත්: සුවවේදනා ය, දුක්වේදනා ය, නොදුක්නොසුව වේදනා යි. මහණෙනි, සුවවේදනාව දුක් විසින් දැක්ක යුතු ය. දුක්වේදනාව හුල් විසින් දැක්ක යුතු ය. නොදුක්නොසුව වේදනාව අනිස විසින් දැක්ක යුතු ය.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් කලෙක මහණහු විසින් සුවවේදනාව දුක් විසින් දක්නාලද වේ ද, දුක්වෙදනවා හුල් විසින් දක්නා ලද වේ ද, නොදුක්නොසුව වේදනාව අනිස විසින් දක්නා ලද වේ ද, මහණෙනි, මැනවින් දක්නා මේ මහණ තෘෂ්ණාව සිඳලූයේ ය. සංයෝජන මුලිනුපුටා හළේ ය. මනා කොට මනාවබෝධය කිරීමෙන් දුක කෙළවර කෙළේ යයි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් සුවවේදනාව දුක් විසින් දිටි ද, දුක්වේදනවා හුල් විසින් දිටි ද, ශාන්ත වූ ඒ නොදුක්නොසුව වේදනාව අනිස විසින් දිටි ද.",
                "type": "paragraph"
            },
            {
                "text": "මැනවින් දක්නා ඒ මහණ වේදනා පිරිසිඳ දනී. වේදනා පිරිසිඳ දැන දිටුදැමියෙහි කෙලෙස් රහිත වූයේ නිවනට පැමිණියේ දහම්හි පිහිටියේ කාබුන් මරණින් මතු පැනවීමට නො පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "1. 20. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සල්‌ල සූත්‍රය",
                "level": "1"
            },
            {
                "text": "254. මහණෙනි, අසු පිරූ තැන් නැති පුහුදුන් තෙමේ සුවවේදනාවත් විඳියි. දුක්වේදනාවත් විඳියි. නොදුක්නොසුව වේදනාවත් විඳියි. මහණෙනි, ඇසු පිරූ තැන් ඇති අරීසවු ද සුවවේදනාවත් විඳියි. දුක්වේදනාවත් විඳියි. නොදුක්නොසුව වේදනාවත් විඳියි. මහණෙනි, එහි ලා ඇසූ පිරූ තැන් නැති පුහුදුන්හු හා ඇසු පිරූ තැන් ඇති අරිසවුගේ වෙසෙස කිමෙක් ද? අදහස කවරේ ද? වෙනස කිමෙක්දැ? යි.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අපගේ දහම්හු භාග්‍යවතුන් වහන්සේ, මුල් කොට ඇතියහ. භාග්‍යවතුන් වහන්සේ නේතෘ කොට ඇතියහ. භාග්‍යවතුන් වහන්සේ පිළිසරණ කොට ඇතියහ. වහන්ස, මේ දේශනාවේ අරුත භාග්‍යවතුන් වහන්සේට ම වැටහේවා. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂුහු දරන්නාහ යි. මහණෙනි, එසේ නම් අසවු. මැනවින් මෙනෙහි කරවු. කියන්නෙමි යි. ‘එසේ ය වහන්සැ’යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වූහ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "397"
            },
            {
                "text": "මහණෙනි, අසු පිරූ තැන් නැති පුහුදුන් තෙමේ දුක් වේදනාවෙන් පහස්නා ලද්දේ ම ශෝක කෙරෙයි. ක්ලාන්ත වෙයි. වැලපෙයි. ළෙහි පැහැර හඬයි. මුළාවට පැමිණෙයි. හෙතෙමේ කායික වේදනාව ද චෙතසික වේදනාව ද යන වේදනා දෙකක් විඳී. මහණෙනි, යම්සේ පුරුෂයකු හුලකින් විදිනාහු ද ඒ මොහු දෙවෙනි හුලකිනුදු සමීපයෙහි විදුනාහු ද, මහණෙනි, මෙසේ වනාහි ඒ පුරුෂ තෙමේ හුල කරණකොටගෙන වේදනා දෙකක් විඳී.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, එසෙයින් ම අසු පිරූ තැන් නැති පුහුදුන් තෙමේ දුක්වෙදනාවෙන් පහස්නා ලද්දේ ම ශෝක කෙරෙයි. ක්ලාන්ත වෙයි. වැලපෙයි. ළෙහි පැහැර හඬයි. මුළාවට පැමිණෙයි. හෙතෙමේ කායික වේදනාව ද චෙතසික වේදනාව ද යන වේදනා දෙකක් විඳියි. ඒ දුක් වේදනාවෙන් ම පහස්නා ලද්දේ ක්‍රෝධ ඇත්තේ වෙයි. දුක් වේදනාවෙන් වූ ක්‍රෝධ ඇති ඒ මොහුට දුක්වේදනා වෙන් යම් පටිඝානුසයයෙක් වේ නම් එය උපදී. හෙතෙමේ දුක්වේදනාවෙන් පහස්නා ලද්දේ කම්සුව පිළිගනී. ඒ කවර හෙයින යත්: මහණෙනි, ඇසු පිරූ තැන් නැති පුහුදුන් තෙමේ කම්සුවය හැර දුක්වේදනාවේ දුරුකිරීමක් නො දනී. කම්සුව පිළිගන්නා ඔහුට සුවවේදනාවෙන් වූ යම් රාගානුසයයෙක් වේ නම් එය උපදී. හෙතෙමේ ඒ වේදනාවන්ගේ සමුදයයත් අත්ථඞ්ගමයත් අස්සාදයත් ආදීනවයත් නිස්සරණයත් තතුසේ නො දනී.",
                "type": "paragraph"
            },
            {
                "text": "ඒ වේදනාවන්ගේ සමුදයයත් අත්ථඞ්ගමයත් අස්සාදයත් ආදීනවයත් නිස්සරණයත් තතුසේ නො දන්නා ඔහුට නොදුක්නොසුව වේදනාවෙන් වූ යම් අවිජ්ජානුසයයෙක් වේ නම් එය උපදී. හෙතෙමේ ඉදින් සුව වේදනාවක් විඳී නම් (කෙලෙසුන්ගෙන්) යුතුව එය විඳී. ඉදින් දුක් වේදනාවක් විඳී නම් යුතු ව එය විඳී. ඉදින් නොදුක් නොසුව වේදනාවක් විඳී නම් සංයුක්ත ව එය විඳී. මහණෙනි, මේ නූගත් පුහුදුන් තෙමේ ජාතියෙන් ජරාමරණයෙන් ශෝකයෙන් පරිදේවයෙන් දුක්ඛයෙන් දොමනස්සයෙන් උපායාසයෙන් යුතු වූයේ යයි කියනු ලැබේ සියලු දුකින් යුතු වුයේ යයි කියමි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, ශ්‍රැතවත් අරීසවු තෙමේ දුක්වේදනාවෙන් පහස්නා ලද්දේ ම ශෝක නො කරයි. ක්ලාන්ත නො වෙයි. නො වැල පෙයි. ළෙහි පැහැර නො හඬයි. මුළාවට නො පැමිණෙයි. හේ කායික වූ එක් වේදනාවක් විඳියි. චෙතසික වේදනාව නො විඳියි. මහණෙනි, යම්සේ පුරුෂයකු හුලකින් විදිනාහු ද ඒ මොහු දෙවෙනි හුලකින් පළමු විදුම සමීපයෙහි නො විදුනාහු ද මහණෙනි, මෙසේ ඒ පුරුෂ තෙමේ එක් හුලකින් වූ වේදනාව විඳින්නේ ය. මහණෙනි, එසෙයින් ම උගත් අරීසවු දුක් වේදනාවෙන් පහස්නා ලද්දේ ම ශෝක නො කෙරෙයි. ක්ලාන්ත නො වෙයි. නො වැලපෙයි. ළෙහි පැහැර නො හඬයි මුළාවට නො පැමිණෙයි. හෙතෙමේ කායික වූ එක් වේදනාවක් විඳියි. චෙතසික වේදනාව නො විඳියි. ඒ දුක් වේදනාවේ ම ක්‍රෝධ ඇත්තේ නො වෙයි. දුක්වේදනාවෙන් වූ ක්‍රෝධ නැති ඒ මොහුට දුක්වේදනාවෙහි වූ යම් පටිඝානුසයයෙක් වේ නම් එය නූපදී. හෙතෙමේ දුක්වේදනාවෙන් පහස්නා ලද්දේ ම කම්සුව නො පිළිගනි. ඒ කවර හෙයින යත්: මහණෙනි, උගත් අරීසවු තෙමේ කම්සුවෙන් වෙන් ව දුක්වේදනාවේ නිසසරණය දනී මැ යි, එහෙයිනි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "399"
            },
            {
                "text": "කම්සුව නො පිළිගන්නා ඔහුට සුවවේදනාවෙන් වූ යම් රාගානුසයයෙක් වේ නම් එය නුපදී. හෙ ඒ වේදනාවන්ගේ සමුදයයත් අත්ථගමයත් අස්සාදයත් අදීනවයත් නිස්සරණයත් තතුසේ දනී. ඒ වේදනාවන්ගේ සමුදයයත් අත්ථගමයත් අස්සාදයත් ආදීනවයත් නිස්සරණයත් තතුසේ දන්නා ඔහුට නොදුක්නොසුව වේදනාවෙන් වූ යම් අවිජ්ජානුසයෙක් වේ නම් එය නුපදී. හේ ඉදින් සුවවේදනාවක් විඳී නම් (කෙලෙසුන්ගෙන්) වෙන් ව එය විඳී. ඉදින් දුක් වේදනාවක් විඳී නම් වෙන් ව විඳී. ඉදින් නොදුක්නොසුව වේදනාවක් විඳී නම් වෙන් ව එය විඳී. මහණෙනි, මේ උගත් අරීසවු ජාතියෙන් ජරාමරණයෙන් සෝකයෙන් පරිදේවයෙන් දුක්ඛයෙන් දෝමනස්සයෙන් උපායාසයෙන් වෙන් වූයේ යයි කියනු ලැබේ. සියලු දුකින් වෙන් වූයේ යයි කියනු ලැබේ. මහණෙනි, ඇසු පිරූ තැන් නැති පුහුදුන්හු හා ඇසූ පිරූ තැන් ඇති අරීසවුහුගේ මේ වෙසෙසයි. මේ අදහස යි. මේ වෙනස යි.",
                "type": "paragraph"
            },
            {
                "text": "බොහෝ ඇසු පිරූ තැන් ඇත්තා වූ ද නුවණැත්තේ සුව වුත් දුක් වූත් වේදනාව (කෙලෙසුන්ගෙන්) යුතුව නො විඳියි. දක්ෂ වූ නුවණැත්තාගේ පුහුදුන්හු හා මහත් වෙසෙස මෙය වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "දන්නා ලද දහම් ඇති බොහෝ අසු පිරූ තැන් ඇති මේ ලොවත් පරලොවත් මැනවින් දක්නා මොහුගේ සිත ඉටුදහම්හු නො මඩිත්. අනිටු දහමින් කිපීමට නො පැමිණෙයි.",
                "type": "paragraph"
            },
            {
                "text": "රාගයෝ ද යළිත් ද්වෙෂයෝ ද ඔහු එහින් නසන ලදහ. අස්තයට ගියහ. එහෙයින් ම නැතියහ. ඇලුම් රහිත සෝක රහිත නිවන් පදය දැන භවයේ කෙළවරට පැමිණියේ මැනවින් දනී යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "1. 20. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ගෙලඤ්‌ඤ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "255. එක්කලෙක භාග්‍යවතුන් වහන්සේ විසල්පුරසමීපයෙහි මහවෙනෙහි කුළුගේහල්හි වැඩවසන සේක. එකල්හි භාග්‍යවතුන් වහන්සේ සවස්කල පලසමවතින් නැගී සිටි සේක් ගිලන්හල වෙත එලඹිසේක. එළඹ පැන වූ අස්නෙහි වැඩහුන් සේක. වැඩ හිඳ භාග්‍යවතුන් වහන්සේ භික්ෂූන් ඇමතූ සේක: මහණෙනි, මහණ තෙමේ සිහි ඇත්තේ මනා දැනුම් ඇත්තේ (ස්කන්ධපරිනිර්වාණ) කාලය අපේක්ෂා කරන්නේ ය. මේ තොපට අපගේ අනුශාසනා යි. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මහණ කෙසේ නම් සිහි ඇත්තේ වේ ද යත්: මහණෙනි, මෙහි මහණ රූ කයෙහි කය අනුව බලමින් කෙලෙස් තවන වෙර ඇති ව මනා නුවණ ඇති ව සිහි ඇති ව (කා) ලෙව්හි දැඩි ලෝබ හා දොම්නස් දුරු කොට වෙසේ ද, වේදනාවන්හි වේදනා අනුව බලමින් ... සිතෙහි සිත අනුව බලමින් ... දහම්හි දහම් අනු ව බලමින් කෙලෙස් තවන වෙර ඇති ව මනා නුවණ ඇති ව සිහි ඇති ව (දහම්) ලෙව්හි දැඩිලොබ හා දොම්නස දුරු කොට වෙසේ ද මහණෙනි, මහණ මෙසේ සිහි ඇත්තේ වේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "401"
            },
            {
                "text": "මහණෙනි, මහණ කෙසේ නම් දැනුම් ඇත්තේ වේ ද යත්: මහණෙනි, මෙහි මහණ ඉදිරිගමන්හි හා ආපසු ගමන්හි මනා නුවණින් දැන කරනසුලු වේ ද ඉදිරිබැලීමෙහි අවට බැලීමෙහි මනානුවණින් කරනසුලු වේ ද (අත්පා) හැකිළීමෙහි හා දිගහැරීමෙහි මනානුවණින් දැන කරනසුලු වේ ද, සඟළ හා පාසිවුරු දැරීමෙහි මනානුවණින් දැන කරනසුලු වේ ද, බිදීමෙහි පීමෙහි කෑමෙහි හා රසවිඳිමෙහි මනානුවණින් දැන කරනසුලු වේ ද, මලමූ කිසෙහි මනානුවණින් දැන කරනසුලු වේ ද, යෑමෙහි සිටීමෙහි හිඳීමෙහි නිදීමෙහි නිදිවැරීමෙහි බිණීමෙහි හා නො බිණීමෙහි මනානුවණින් දැන කරනසුලු වේ ද, මහණෙනි, මහණ මෙසේ මනානුවණ ඇත්තේ වේ. මහණෙනි, මහණ සිහි ඇත්තේ මනාදැනුම් ඇත්තේ කාලය අපේක්ෂා කරන්නේ ය. මේ තොපට අපගේ අනුශාසනා යි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, ඉදින් මෙසේ සිහි ඇති ව මනාදැනුම් ඇති ව නො පමාව කෙලෙස් තවන වෙර ඇති ව කා දිවි දෙක්හි ආශා රහිත ව වෙසෙන මහණහට සුවවේදනාවක් උපදී ද හෙතෙමේ “මට මේ සුවවේදනාවක් උපන. එ ද නිසා ය, නොනිසා නො වේ. කුමක් නිසා ද යත්: මේ කය ම නිසා ය. මේ කය වනාහි අනිස ය. හේතූන් විසින් කරන ලද්දේ ය. ප්‍රත්‍යය නිසා උපන්නේ ය. අනිස වූ සඞ්ඛත වූ පටිච්චසමුප්පන්න වූ කය නිසා උපන් සුව වේදනාව කොයින් නිත්‍ය වන්නේ දැ”යි මෙසේ දනියි. ",
                "type": "paragraph"
            },
            {
                "text": "හෙතෙමේ කයෙහිත් සුවවේදනාවෙහිත් අනිස අනු ව බලන සුලු ව වෙසේ. වැය අනු ව බලනසුලු ව වෙසේ. විරාගය අනු ව බලනසුලු ව වෙසේ. නිරොධය අනු ව බලනසුලු ව වෙසේ පටිනිස්සග්ගය අනුව බලනසුලු ව වෙසේ. කයෙහිත් සුවවේදනාවෙහිත් අනිස අනු ව බලන සුලු ව වෙසෙන වැය අනු ව බලනසුලු ව වෙසෙන විරාගය අනු ව බලනසුලු ව වෙසෙන නිරෝධය අනු ව බලනසුලු ව වෙසෙන පටිනිස්සග්ගය අනු ව බලනසුලු ව වෙසෙන ඔහුගේ කයෙහිත් සුවවේදනාවෙහිත් යම් රාගානුසයයෙක් වේ නම් එය ප්‍රහීණ වේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මෙසේ සිහි ඇති ව මනා දැනුම් ඇති ව නො පමා ව කෙලෙස් තවන වෙර ඇති ව නිවන් පිණිස මෙහෙයූ සිත් ඇති ව වෙසෙන ඒ මහණහට ඉදින් දුක්වෙදනාවක් උපදී නම් හෙතෙමේ මෙසේ දනී: “මට මේ දුක්වෙදනාවක් උපන. හෙ ද නිසා ය. නොනිසා නො වේ. කුමක් නිසා ද යත්: මේ කය ම නිසා ය. මේ කය වනාහි අනිත්‍ය ය. සඞ්ඛත ය. පටිච්චසමුප්පන්න ය. අනිත්‍ය වූ සඞ්ඛත වූ පටිච්චසමුප්පන්න වූ කය නිසා උපන් දුක්වේදනාව කොයින් නිත්‍ය වන්නී දැ”යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "403"
            },
            {
                "text": "හෙතෙමේ කයෙහිත් දුක්වේදනාවෙහිත් අනිස අනුව බලන සුලු ව වෙසේ. වැය අනු ව බලනසුලු ව වෙසේ. විරාගය අනු ව බලනසුලු ව වෙසේ. නිරෝධය අනුව බලනසුලු ව වෙසේ. පටිනිස්සග්ගය අනුව බලනසුලු ව වෙසේ. කයෙහිත් දුක්වේදනා වෙහිත් අනිස අනුව බලනසුලු ව වෙසෙන වැය අනුව බලනසුලු ව වෙසෙන විරාගය අනු ව බලනසුලු ව වෙසෙන නිරෝධය අනුව බලනසුලු ව වෙසෙන පටිනිස්සග්ගය අනුව බලනසුලු ව වෙසෙන ඔහුගේ කයෙහිත් දුක්වේදනාවෙහිත් යම් පටිඝානුසයයෙක් වේ නම් එය ප්‍රහීණ වේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මෙසේ සිහි ඇති ව මනානුවණ ඇති ව නො පමා වූ කෙලෙස් තවන වෙර ඇති ව නිවන් පිණිස මෙහෙයූ සිත් ඇති ව වෙසෙන ඒ මහණහට ඉදින් නොදුක්නොසුව වේදනාවක් උපදී නම් හේ මෙසේ දැනගනී: “මට මේ නොදුක්නොසුව වේදනාවක් උපන. හෙ ද නිසා ය. නොනිසා නො වේ. කුමක් නිසා ද, මේ කය ම නිසා ය. මේ කය අනිත්‍ය ය. සඞ්ඛත ය. පටිච්චසමුප්පන්න ය. අනිත්‍ය වූ සඞ්ඛත වූ පටිච්චසමුප්පන්න වූ කය නිසා උපන් නොදුක්නොසුව වේදනාව කොයින් නිත්‍ය වන්නේ දැ, යි. හේ කයෙහිත් නොදුක්නොසුව වේදනාවෙහිත් අනිස අනුව බලනසුලු ව වෙසෙයි. වැය අනුව බලනසුලු ව වෙසෙයි. විරාගය අනුව බලනසුලු ව වෙසෙයි. නිරෝධය අනුව බලනසුලු ව වෙසෙයි. පටිනිස්සග්ගය අනුව බලනසුලු ව වෙසෙයි. කයෙහිත් නොදුක්නොසුව වේදනාවෙහිත් අනිස අනුව බලනසුලු ව වෙසෙන වැය අනුව බලනසුලු ව වෙසෙන විරාගය අනුව බලනසුලු ව වෙසෙන නිරෝධය අනුව බලනසුලු ව වෙසෙන පටිනිස්සග්ගය අනුව බලනසුලු ව වෙසෙන ඔහුට කයෙහිත් නොදුක්නොසුව වේදනාවෙහිත් යම් අවිද්‍යානුස්යයෙක් වේ නම් එය ප්‍රහීණ වේ. ",
                "type": "paragraph"
            },
            {
                "text": "හෙ ඉදින් සුවවේදනාවක් විඳී නම් එය අනිස යයි දැනගනී. නො බැසගන්නා ලදැ යි දැනගනී. නො පිළිගන්නා ලදැ යි දැනගනී. ඉදින් දුක් වේදනාවක් විඳී නම් එය අනිසැ යි දැනගනී. නොබැසගන්නා ලදැ යි දැනගනි. නො පිළිගන්නා ලදැ යි දැනගනී. ඉදින් නොදුක්නොසුව වේදනාවක් විඳී නම් එය අනිසැ යි දැනගනී. නො බැසගන්නා ලදැ යි දැනගනී. නො පිළිගන්නා ලදැ යි දැනගනී. හෙතෙමේ ඉදින් සුව වේදනාවක් විඳී නම් කෙලෙසුන්ගෙන් වෙන් ව එය විඳී. ඉදින් දුක් වේදනාවක් විඳී නම් වෙන් ව එය විඳී. ඉදින් නොදුක්නොසුව වේදනාවක් විඳී නම් වෙන් ව එය විඳී. හේ කය කෙළවර කොට ඇති වේදනාවක් විඳුනේ කය කෙළවර කොට ඇති වේදනාවක් විඳිමි යි දැනගනී. දිවි කෙළවර කොට ඇති වේදනාවක් විඳුනේ දිවි කෙළවර කොට ඇති වේදනාවක් විඳිමි යි දැනගනී. කය බිඳීමෙන් දිවි කෙළවර වීමෙන් මතු මෙහි ම සියලු වේදනාවෝ නො පිළිගන්නා ලද්දාහු සිහිල් වන්නාහ යි දැනගනී.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම්සේ තෙලත් වැටියත් නිසා තෙල්පහනක් දැල් වෙන්නේ ද, ඒ තෙලත් වැටියත් කෙළවර වීමෙන් ම ප්‍රත්‍යය නැති ව නිවෙන්නේ ද, මහණෙනි, එසෙයින් ම මහණ කය කෙළවර කොට ඇති වේදනාවක් විඳුනේ කය කෙළවර කොට ඇති වේදනාවක් විඳිමි යි දැනගනී. දිවි කෙළවර කොට ඇති වේදනාවක් විඳුනේ දිවි කෙළවර කොට ඇති වේදනාවක් විඳිමි යි දැනගනී. කය බිඳීමෙන් දිවි කෙළවර වීමෙන් මතු මෙහි ම සියලු වේදනාවෝ නො පිළිගන්නා ලද්දහු සිහිල් වන්නාහ යි දැනගනී යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "405"
            },
            {
                "type": "centered",
                "text": "1. 20. 8.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "දුතිය ගෙලඤ්‌ඤ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "256. එක්සමයෙක්හි භාග්‍යවතුන් වහන්සේ විසල්පුර සමීපයෙහි මහවෙනෙහි කුළුගේහල්හි වැඩවසන සේක. එකල්හි භාග්‍යවතුන් වහන්සේ සවස්කල පලසමවතින් නැගී සිටි සේක් ගිලන්හල වෙත එලඹි සේක. එළඹ පැන වූ අස්නෙහි වැඩහුන් සේක. වැඩහිඳ භාග්‍යවතුන් වහන්සේ භික්ෂූන් ඇමතූ සේක: මහණෙනි, මහණ සිහි ඇත්තේ මනා දැනුම් ඇත්තේ (පරිනිර්වාණ) කාලය අපේක්ෂා කරන්නේ ය. මහණෙනි, මේ තොපට අපගේ අනුශාසනා යි. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මහණ කෙසේ නම් සිහි ඇත්තේ වේ ද යත්: මහණෙනි, මෙසස්නෙහි මහණ කයෙහි කය අනු ව බලනසුලු ව කෙලෙස් තවන වෙර ඇති ව මනාදැනුම් ඇති ව සිහි ඇති ව කායලෙව්හි අභිජ්ඣාව හා දොමනස්සය දුරු කොට වෙසෙයි. වේදනාවන්හි ... සිතෙහි … දහම්හි දහම් අනු ව බලනසුලු ව කෙලෙස් තවන වෙර ඇති ව මනාදැනුම ඇති ව සිහි ඇති ව දහම් ලෙව්හි අභිජ්ඣාව හා දෝමනස්සය දුරු කොට වෙසේ. මහණෙනි, මෙසේ මහණ සිහි ඇත්තේ වේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මහණ කෙසේ නම් මනාදැනුම් ඇත්තේ වේ ද යත්: මහණෙනි, මෙසස්නෙහි මහණ ඉදිරි ගමන්හි පෙරළා ගමන්හි මනාදැනුම ඇති ව කරනසුලු වෙයි. ඉදිරි බැලුම්හි අවට බැලුම්හි මානාදැනුම් ඇති ව කරනසුලු වෙයි. අත් පා හැකිළුම්හි දිගහැරීම්හි මනාදැනුම් ඇති ව කරනසුලු වෙයි. සඟළ පාසිවුරු දැරුම්හි මනාදැනුම් ඇති ව කරනසුලු වෙයි. කෑමෙහි පීමෙහි කඩා කෑමෙහි රස විඳීමෙහි මනාදැනුම් ඇති ව කරනසුලු වෙයි. මලමූ කිසෙහි මනාදැනුම් ඇති ව කරනසුලු වෙයි. ගමන්හි සිටුම්හි හිඳුම්හි නිදීම්හි නිදිවැරුම්හි කියුම්හි නිහඬබැව්හි මනාදැනුම් ඇති ව කරනසුලු වෙයි. මහණෙනි, මෙසේ මහණ මනාදැනුම් ඇත්තේ වෙයි. මහණෙනි, මහණ සිහි ඇත්තේ මනාදැනුම් ඇත්තේ කාලය අපේක්ෂා කරන්නේ ය. මේ අපගේ අනුශාසනා යි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මෙසේ සිහි ඇති ව මනාදැනුම් ඇති ව නො පමා ව කෙලෙස් තවන වෙර ඇති ව නිවන් පිණිස මෙහෙයූ සිත් ඇති ව වෙසෙන ඒ මහණහුට ඉදින් සුවවේදනාවක් උපදී නම් හේ මෙසේ දැනගනී. මට මේ සුවවෙදනාවක් උපන. එ ද නිසා ය. නො නිසා නො වේ. කුමක් නිසා ද, මේ ස්පර්ශය ම නිසා ය. මේ ස්පර්ශය අනිස ය, සඞ්ඛත ය, පටිච්චසමුප්පන්න ය. අනිස වූ සඞ්ඛත වූ පටිච්චසමුප්පන්න වූ ස්පර්ශය නිසා උපන් සුවවේදනාව කොයින් නිත්‍ය වන්නේ දැ?යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "407"
            },
            {
                "text": "හේ ස්පර්ශයෙහිත් සුවවේදනාවෙහිත් අනිස අනුව බලනසුලු ව වෙසෙයි. වැය අනුව බලනසුලු ව වෙසෙයි. විරාගය අනුව බලන සුලු ව වෙසෙයි. නිරෝධය අනුව බලන සුලු ව වෙසෙයි. පටිනිස්සග්ගය අනුව බලනසුලු ව වෙසෙයි. ස්පර්ශයෙහිත් සුවවේදනාවෙහිත් අනිස අනුව බලනසුලු ව වෙසෙන වැය අනුව බලනසුලු ව වෙසෙන විරාගය අනුව බලනසුලු ව වෙසෙන නිරෝධය අනුව බලනසුලු ව වෙසෙන පටිනිස්සග්ගය අනුව බලනසුලු ව වෙසෙන ඔහුට ස්පර්ශ යෙහිත් සුවවේදනාවෙහිත් යම් රගානුසයයෙක් වේ නම් එය ප්‍රහීණ වෙයි. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මෙසේ සිහි ඇති ව මනාදැනුම් ඇති ව නොපමා ව කෙලෙස් තවන වෙර ඇති ව නිවන් පිණිස මෙහෙයූ සිත් ඇති ව වෙසෙන ඒ මහණහුට ඉදින් දුක්වෙදනාවක් උපදී නම් හේ මෙසේ දැනගනී. මට මේ දුක්වේදනාවක් උපන. එ ද නිසා ය, නොනිසා නො වෙයි. කුමක් නිසා ද, මේ ස්පර්ශයම නිසා ය. මේ ස්පර්ශය අනිස ය. සඞ්ඛත ය, පටිච්චසමුප්පන්න ය අනිස වූ සඞ්ඛත වූ පටිච්චසමුප්පන්න වූ ස්පර්ශය නිසා උපන් දුක්වේදනාව කොයින් නිත්‍ය වන්නේ දැ’ යි.",
                "type": "paragraph"
            },
            {
                "text": "හෙතෙමේ ස්පර්ශයෙහිත් දුක්වේදනාවෙහිත් අනිස අනුව බලන සුලු ව වෙසෙයි. වැය අනු ව බලනසුලු ව වෙසයි. විරාගය අනු ව බලනසුලු ව වෙසෙයි. නිරෝධය අනුව බලනසුලු ව වෙසෙයි. පටිනිස්සග්ගය අනුව බලනසුලු ව වෙසෙයි. ස්පර්ශයෙහිත් දුක් වේදනාවෙහිත් අනිස අනුව බලනසුලු ව වෙසෙන වැය අනුව බලනසුලු ව වෙසෙන විරාගය අනු ව බලනසුලු ව වෙසෙන නිරෝධය අනුව බලනසුලු ව වෙසෙන පටිනිස්සග්ගය අනුව බලනසුලු ව වෙසෙන ඒ මහණහුට ස්පර්ශයෙහිත් දුක්වේදනාවෙහිත් යම් පටිඝානුසයයෙක් වේ නම් එය ප්‍රහීණ වේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මෙසේ සිහි ඇති ව මනානුවණ ඇති ව නො පමා ව කෙලෙස් තවන වෙර ඇති ව නිවන් පිණිස මෙහෙයූ සිත් ඇති ව වෙසෙන ඒ මහණහට ඉදින් නොදුක්නොසුව වේදනාවක් උපදී නම් හේ මෙසේ දැනගනී: මට මේ නොදුක්නොසුව වේදනාවක් උපන. එ ද නිසා ය. නොනිසා නො වෙයි. කුමක් නිසා ද, මේ ස්පර්ශය ම නිසා ය. මේ ස්පර්ශය අනිස ය, සඞ්ඛත ය, පටිච්චසමුප්පන්න ය. අනිස වූ සඞ්ඛත වූ පටිච්චසමුප්පන්න වූ ස්පර්ශය නිසා උපන් මැදහත් වේදනාව කොයින් නිත්‍ය වන්නේ දැ’ යි. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "409"
            },
            {
                "text": "හෙතෙමේ ස්පර්ශයෙහිත් මැදහත් වේදනාවෙහිත් අනිස අනුව බලනසුලු ව වෙසෙයි. වැය අනුව බලනසුලු ව වෙසෙයි. විරාගය අනුව බලනසුලු ව වෙසෙයි. නිරෝධය අනුව බලනසුලු ව වෙසෙයි. පටිනිස්සග්ගය අනුව බලනසුලු ව වෙසෙයි. ස්පර්ශයෙහිත් මැදහත් වේදනාවෙහිත් අනිස අනුව බලනසුලු ව වෙසෙන වැය අනුව බලනසුලු ව වෙසෙන විරාගය අනුව බලනසුලු ව වෙසෙන නිරොධය අනුව බලනසුලු ව වෙසෙන පටිනිස්සග්ගය අනුව බලනසුලු ව වෙසෙන ඔහුට ස්පර්ශයෙහිත් මැදහත් වේදනාවෙහිත් යම් අවිජ්ජානුසයයෙක් වේ නම් එය ප්‍රහීණ වේ. ",
                "type": "paragraph"
            },
            {
                "text": "ඉදින් හේ සුවවේදනාවක් විඳී නම් එය අනිසැ යි දැනගනී. නො බැසගන්නා ලදැ යි දැනගනී. නො පිළිගන්නා ලදැ යි දැනගනී. ඉදින් දුක්වේදනාවක් විඳී නම් ... ඉදින් මැදහත් වේදනාවක් විඳී නම් එය අනිසැ යි දැනගනී. නො බැසගන්නා ලදැ යි දැනගනී. නො පිළිගන්නා ලදැ යි දැනගනී. ඉදින් හෙ සුවවේදනාවක් විඳී නම් (කෙලෙසුන්ගෙන්) වෙන් ව එය විඳී. ඉදින් දුක් වේදනාවක් විඳී නම් ... ඉදින් මැදහත් වේදනාවක් විඳී නම් වෙන් ව එය විඳී. හෙතෙමේ කය කෙළවර කොට ඇති වේදනාවක් විඳුනේ කය කෙළවර කොට ඇති වේදනාවක් විඳිමි යි දැනගනී. දිවි කෙළවර කොට ඇති වේදනාවක් විඳුනේ දිවි කෙළවර කොට ඇති වේදනාවක් විඳිමි යි දැනගනී. කය බිඳීමෙන් දිවි කෙළවර වීමෙන් මතු මෙහි ම සියලු වේදනාවෝ නො පිළිගන්නා ලද්දාහු සිහිල් වන්නාහ යි දැනගනී.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම්සේ තෙලත් වැටියත් නිසා තෙල්පහනක් දැල්වෙන්නේ ද, ඒ තෙලත් වැටියත් කෙළවර වීමෙන් ම ප්‍රත්‍යය රහිත ව නිවෙන්නේ ද, මහණෙනි, එසෙහින්ම කය කෙළවර කොට ඇති වේදනාවක් විඳුනේ කය කෙළවර කොට ඇති වේදනාවක් විඳිමි යි දැනගනී. දිවි කෙළවර කොට ඇති වේදනාවක් විඳුනේ දිවි කෙළවර කොට ඇති වේදනාවක් විඳිමි යි දැනගනී. කය බිඳීමෙන් දිවි කෙළවර වීමෙන් මතු මෙහි ම සියලු වේදනාවෝ නො පිළිගන්නා ලද්දහු සිහිල් වන්නාහ යි දැනගනී යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "1. 20. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනිච්‌ච සූත්‍රය",
                "level": 1
            },
            {
                "text": "257. මහණෙනි, අනිච්ච වූ සඞ්ඛත වූ පටිච්චසමුප්පන්න වූ ඛයධම්ම වූ වයධම්ම වූ විරාගධම්ම වූ නිරොධධම්ම වූ මේ වේදනා තුනෙකි. කවර තුනෙක් ද යත්: සුවවේදනාව ය දුක් වෙදනාව ය නොදුක්නොසුව වෙදනාව යයි. මහණෙනි, මේ වෙදනා තුන අනිච්ච ය. සඞ්ඛත ය. පටිච්චසමුප්පන්න ය. ඛයධම්ම ය. වයධම්ම ය. විරාගධම්ම ය. නිරොධධම්ම යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "411"
            },
            {
                "type": "centered",
                "text": "1. 20. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඵස්‌සමූලක සූත්‍රය",
                "level": "1"
            },
            {
                "text": "258. මහණෙනි, ස්පර්ශයෙන් හටගත් ස්පර්ශය මුල් කොට ඇති ස්පර්ශය නිදාන කොට ඇති ස්පර්ශය ප්‍රත්‍යය කොට ඇති මේ වේදනා තුනකි. කවර තුනෙක් ද යත්: සුවවේදනාව ය දුක්වේදනාව ය නොදුක්නොසුව වේදනාව යි. මහණෙනි, සුවවේදනාවට කරුණු වූ ස්පර්ශය නිසා සුවවේදනාව උපදී. සුව වේදනාවට කරුණු වූ ඒ ස්පර්ශයේ ම නිරෝධයෙන් එයින් හටගත් යම් වේදනාවක් වේ ද සුවවේදනාවට කරුණු වූ පහස නිසා උපන් ඒ සුව වේදනාව නිරුද්ධ වේ. එය සන්හිඳේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, දුක්වේදනාවට කරුණු වූ පහස නිසා දුක්වේදනාව උපදී. දුක්වේදනාවට කරුණු වූ ඒ පහස්හි ම නිරෝධයෙන් එයින් හටගත් යම් වේදනාවක් වේ ද, දුක්වේදනාවට කරුණු වූ පහස නිසා උපන් ඒ දුක්වේදනාව නිරුද්ධ වේ. එය සන්හිඳේ. මහණෙනි, මැදහත් වේදනාවට කරුණු වූ පහස නිසා මැදහත් වේදනාව උපදී. මැදහත් වේදනාවට කරුණු වූ ඒ පහස්හි ම නිරෝධයෙන් එයින් හටගත් යම් වේදනාවක් වේ ද මැදහත් වේදනාවට කරුණු වූ පහස නිසා උපන් ඒ මැදහත් වේදනාව නිරුද්ධ වේ. එය සන්හිඳේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම්සේ දඬු දෙකක ගැටීමෙන් එකතුවීමෙන් උණුසුම උපදී ද, ගින්න හටගනී ද. ඒ දඬු දෙකෙහි ම වෙන් වීමෙන් ඈත් වීමෙන් එයින් හටගත් යම් උණුසුමක් වේ නම් එය නිරුද්ධ වේ ද, එය සන්හිඳේ ද, මහණෙනි, එසෙයින් ම මේ වේදනා තුන ඵස්සයෙන් හටගත්තේ ය. ඵස්සය මුල් කොට ඇත්තේ ය. ඵස්සය නිදාන කොට ඇත්තේ ය. ඵස්සය ප්‍රත්‍යය කොට ඇත්තේ ය. එයින් එයින් හටගත් ඵස්සය එයින් එයින් හටගත් වෙදනාව උපදී. එයින් එයින් හටගත් ඵස්සය නිරොධයෙන් එයින් එයින් හටගත් වෙදනා නිරුද්ධ වේ යි.",
                "type": "paragraph"
            },
            {
                "text": "පළමුවැනි සගාථවර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රනාමාවලිය:**",
                "type": "unindented"
            },
            {
                "text": "සමාධි, සුඛ, පහාන, පාතාල, දට්ඨබ්බ, සල්ල යන සූත්‍ර සයය. ගෙලඤ්ඤසූත්‍ර දෙකය අනිච්චපස්සමූලක සූත්‍ර දෙක යයි සූත්‍ර දශයෙකි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "413"
            },
            {
                "text": "2. රහොගත වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "2. 2. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "රහෝගත සූත්‍රය",
                "level": 1
            },
            {
                "text": "259. එකල්හි එක්තරා මහණෙක් භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. ... එකත්පස් ව හුන් ඒ මහණ භාග්‍යවතුන් වහන්සේට මෙය සැලකෙළේය: වහන්ස, “මෙහි එකලා වූ විවේකයෙන් යුත් මට මෙබඳු චිත්තවිතර්කයෙක් පහළ විය. වේදනා තුනක් භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද, සුවවේදනාවය, දුක්වේදනාවය, මැදහත්වේදනාවය” යි. මේ වේදනා තුන භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදී. “යම්කිසි වේදනාවක් වේ නම් එය දුකැ”යි මෙ ද භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදී. යම් කිසි වේදනාවක් වේ නම් එය දුකැ’යි යන මෙය කුමක් සඳහා භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද දැ යි.",
                "type": "paragraph"
            },
            {
                "text": "මහණ, මැනව, මැනව මහණ, මේ වේදනා තුනක් මවිසින් දෙසන ලදි. සුවවේදනාය, දුක්වේදනාය, මැදහත්වේදනාය යි. මේ වේදනා තුන මා විසින් දෙසන ලදී. මහණ, යම් කිසි වේදනාවක් වේ නම් එය දුකැ යි මෙ ද මා විසින් දෙසන ලදි. මහණ, යම්කිසි වේදනාවක් වේ නම් එය දුකැ යි ඒ මෙය මා විසින් සංස්කාරයන්ගේ ම අනිස බව සඳහා දෙසන ලදි. මහණ, යම් කිසි වේදනාවක් වේ නම් ඒ මෙය මා විසින් සංස්කාරයන්ගේ ම ක්‍ෂය ස්වභාවය සඳහා දෙසන ලදි. මහණ, යම් කිසි වේදනාවක් වේ නම් එය දුකැ යි ඒ මෙය මා විසින් සංස්කාරයන්ගේ ම ව්‍යය ස්වභාවය සඳහා දෙසන ලදි. මහණ, යම්කිසි වේදනාවක් වේ නම් එය දුකැ යි ඒ මෙය මා විසින් සංස්කාරයන්ගේ ම විරාගස්වභාවය සඳහා දෙසන ලදි. මහණ, යම්කිසි වේදනාවක් වේ නම් එය දුකැ යි ඒ මෙය මා විසින් සංස්කාරයන්ගේ ම නිරෝධස්වභාවය සඳහා දෙසන ලදි. මහණ, යම්කිසි වේදනාවක් වේ නම් එය දුකැ යි ඒ මෙය මා විසින් සංස්කාරයන්ගේ ම විපරිණාමස්වභාවය සඳහා දෙසන ලදි.",
                "type": "paragraph"
            },
            {
                "text": "එතෙකුදුවත් මහණ, මා විසින් සංස්කාරයන්ගේ අනුපූර්ව නිරෝධය පවසන ලද්දේ ය. පළමු දැහැනට සමවන්නහුට වචනය නිරුද්ධ වූයේ වේ. දෙවන දැහැනට සමවන්නහුට විතර්ක විචාරයෝ නිරුද්ධ වෙති. තුන් වන දැහැනට සමවන්නහුට ප්‍රීතිය නිරුද්ධ වූවා වෙයි. සිවුවන දැහැනට සමවන්නහුටආශ්වාසප්‍රශ්වාසයෝ නිරුද්ධ වූවාහු වෙති. ආකාසානඤ්චායතනයට සමවන්නහුට රූපසංඥා නිරුද්ධ වූවා වෙයි. විඤ්ඤාණඤ්චායතනයට සමවන්නහුට ආකාසානඤ්චායතන සංඥා නිරුද්ධ වූවා වෙයි. ආකිඤ්චඤ්ඤායතනයට සමවන්නහුට විඤ්ඤාණඤ්චායතන සංඥා නිරුද්ධ වූවා වෙයි. නේවසඤ්ඤානාසඤ්ඤායතනයට සමවන්නහුට ආකිඤ්චඤ්ඤායතන සංඥා නිරුද්ධ වූවා වෙයි. සඤ්ඤාවෙදයිත නිරෝධයට සමවන්නහුට සංඥාත් වේදනාත් නිරුද්ධ වූවා වෙත්. රහත් මහණහුට රාගය නිරුද්ධ වූයේ වෙයි. දොසය නිරුද්ධ වූයේ වෙයි. මෝහය නිරුද්ධ වූයේ වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "415"
            },
            {
                "text": "වැලිදු මහණ, මා විසින් අනුපිළිවෙළින් සංස්කාරයන්ගේ සංහිඳීම පවසන ලද්දේ වේ. පළමුවන දැහැනට සමවන්නහුට වචනය සන්හිඳුනේ වේ. දෙවන දැහැනට සමවන්නහුට විතර්කවිචාර සන්සිඳුනේ වේ. තෙවන දැහැනට සමවන්නහුට ප්‍රීතිය සන්සිඳුනේ වේ. සිවුවන දැහැනට සමවන්නහුට ආශ්වාසප්‍රශ්වාස සන්සිඳුනේ වේ. ආකාසානඤ්චායතනයට සමවන්නහුට රූපසංඥා සන්සිඳුනේ වේ. විඤ්ඤාණඤ්චායතනයට සමවන්නහුට ආකාසානඤ්චායතනසංඥා සන්හිඳුනේ වේ. ආකිඤ්චඤ්ඤායතනයට සමවන්නහුට විඤ්ඤාණඤ්චායතනසංඥා සන්සිඳුනේ වේ. නේවසඤ්ඤානාසඤ්ඤායතනයට සමවන්නහුට ආකිඤ්චඤ්ඤායතනසංඥා සන්සිඳුනේ වේ. සඤ්ඤාවෙදයිත නිරොධයට සමවන්නහුට සංඥාත් වෙදනාත් සන්සිඳුනාහු වෙත්. රහත් මහණහුට රාගය සන්සිඳුනේ වේ. දොසය සන්හිඳුනේ වේ. මොහය සන්හිඳුනේ වේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණ, මේ සන්හිඳුම් සයෙකි. පළමුදැහැනට සමවන්නහුට වචනය සන්සිඳුනේ වේ. දෙවනදැහැනට සමවන්නහුට විතර්කවිචාර සන්සිඳුනේ වේ. තෙවන දැහැනට සමවන්නහුට ප්‍රීතිය සන්සිඳුනේ වෙයි. සිවුවන දැහැනට සමවන්නහුට ආශ්වාසප්‍රශ්වාස සන්සිඳුනේ වේ. සඤ්ඤා වේදයිත නිරෝධයට සමවන්නහුට සංඥාත් වේදනාත් සන්හුන්නාහු වෙත්. රහත් මහණහුට රාගය සන්හුන්නේ වේ. දොසය සන්හුන්නේ වේ. මෝහය සන්හුන්නේ වේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආකාස සූත්‍රය",
                "level": "1"
            },
            {
                "text": "260. මහණෙනි, යම්සේ අහසෙහි නන්වැදෑරුම් සුළං හමා ද, පෙරදිග සුළං ද හමයි. පෑළදිග සුළං ද හමයි. උතුරුදිග සුළං ද හමයි. දකුණුදිග සුළං ද හමයි. දූලි සහිත සුළං ද හමයි. දූලි රහිත සුළං ද හමයි. සිහිල් සුළං ද හමයි. උණුසුම් සුළං ද හමයි. මඳ සුළං ද හමයි. අධික සුළං ද හමයි. මහණෙනි, එසෙයින් ම මේ සිරුරෙහි නන්වැදෑරුම් වේදනා උපදිත්. සුව වේදනාත් උපදිත්. දුක්වේදනා උපදිත්. මැදහත් වේදනා උපදිත්.",
                "type": "paragraph"
            },
            {
                "text": "යම්සේ අහසෙහි නන්වැදෑරුම් වූ බොහෝ සුළං හමා ද පෙරදිගින් හමන්නා වූ ද පැළදිගින් හමන්නා වූ ද උතුරුදිගින් හමන්නා වූ ද යළි දකුණු දිගින් හමන්නා වූ ද, ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "\nදූලි සහිත වූ ද දූලි රහිත වූ ද සිසිල් වූ ද උණුසුම් වූ ද ඇතැම් දිනෙක අධික වූ ද මද වූ ද බොහෝ සුළං හමයි. "
            },
            {
                "text": "එසෙයින් ම කයෙහි සුවදුක් උපදවන්නා වූ ද මැදහත් වූ ද යම් වේදනාවක් වේ නම් ඒ වේදනාවෝ උපදිත්.",
                "type": "paragraph"
            },
            {
                "text": "මහණ, යම් කලෙක කෙලෙස් තවන වෙර ඇත්තේ මනා දැනීම නො හරි ද, එකල්හි පණ්ඩිත වූ හෙතෙමේ සියලු වේදනා පිරිසිඳ දනී. ",
                "type": "paragraph"
            },
            {
                "text": "හේ වේදනා පිරිසිඳ දැන දිටුදැමියෙහි කෙලෙස් රහිත වූයේ දහම්හි පිහිටියේ නිවනට පැමිණියේ කාබුන් මරණින් මතු (සත්ත්ව) සඞ්ඛ්‍යාවට නො පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "417"
            },
            {
                "type": "centered",
                "text": "2. 2. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය ආකාස සූත්‍රය",
                "level": "1"
            },
            {
                "text": "261. මහණෙනි, යම්සේ අහසෙහි නන්වැදෑරුම් හුළං හමා ද, පෙරදිග හුළං ද හමයි. ... අධික හුළං ද හමයි. මහණෙනි, එසෙයින් ම මේ සිරුරෙහි නන්වැදෑරුම් වේදනා උපදිත්. සුවවේදනාත් උපදිත්. දුක්වේදනාත් උපදිත්. මැදහත්වේදනාත් උපදිත් යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අගාර සූත්‍රය",
                "level": "1"
            },
            {
                "text": "262. මහණෙනි, යම්සේ ආගන්තුක ගෙයක් වේ ද, එහි පෙරදිගින් ද අවුත් වාසය කෙරෙති. පැළදිගින් ද අවුත් වාසය කෙරෙති. උතුරුදිගින් ද අවුත් වාසය කෙරෙති. දකුණුදිගින් ද අවුත් වාසය කෙරෙති. ක්‍ෂත්‍රියයෝත් අවුත් වාසය කෙරෙති. බ්‍රාහ්මණයෝත් අවුත් වාසය කෙරෙති. වෛශ්‍යයෝත් අවුත් වාසය කෙරෙති. ශුද්‍රයෝත් අවුත් වාසය කෙරෙති.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, එසෙයින් ම මේ කයෙහි විවිධ වේදනාවෝ උපදිති: සුවවේදනාත් උපදිති. දුක්වේදනාත් උපදිති. මැදහත් වෙදනාත් උපදිති. සාමිස සැපවේදනාත් උපදිති. නිරාමිස සුවවෙදනාත් උපදිති. සාමිස දුක්වේදනාත් උපදිති. නිරාමිස දුක්වේදනාත් උපදිති. සාමිස මැදහත්වේදනාත් උපදිති. නිරාමිස මැදහත්වේදනාත් උපදිති යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සන්තක සූත්‍රය",
                "level": "1"
            },
            {
                "text": "263. එකල්හි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ ... එකත්පසෙක හුන් ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැලකළහ: වහන්ස, වේදනාව කවරක් ද? වේදනාසමුදය කවරේ ද? වේදනානිරොධය කවරේ ද? වේදනානිරොධගාමිනී පටිපදාව කවරේ ද? වේදනාවෙහි ආස්වාදය කවරේ ද? ආදීනවය කවරේ ද? නිස්සරණය කවරේ දැ? යි.",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, මේ වේදනා තුනෙකි: සුවවේදනා ය, දුක්වේදනා ය, මැදහත්වේදනා යි. ආනන්ද, මොහු වේදනා යයි කියනු ලැබෙත්. ඵස්සසමුදයෙන් වේදනාසමුදයය වේ. ඵස්සනිරොධයෙන් වේදනානිරොධය වේ. මේ අරිඅටඟිමඟ ම වේදනානිරොදගාමිනී පටිපදාව යි. එනම් - සම්මාදිට්ඨි ය ... සම්මාසමාධි යි. වේදනාව නිසා යම් සුවයෙක් සොම්නසෙක් උපදී නම් මේ වේදනාවේ ආස්වාද යි. යම් වේදනාවක් අනිත්‍ය නම් දුක් නම් වෙනස් වනසුලු නම් මේ වේදනාවේ ආදීනව යි. වෙදනාවෙහි යම් ඡන්දරාගය දුරුකිරීමෙක් ඡන්දරාගය පැහීමෙක් වේ නම් මේ වේදනාවේ නිස්සරණ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "419"
            },
            {
                "text": "ආනන්ද, වැලිදු මා විසින් අනුපිළිවෙළින් සංස්කාරයන්ගේ නිරෝධය පවසන ලද්දේ ය. පළමු දැහැනට සමවන්නහුට වචනය නිරුද්ධ වූයේ වේ. ... සඤ්ඤාවෙදයිතනිරෝධයට සමවන්නහුට සංඥාත් වේදනාත් නිරුද්ධ වූවාහු වෙත්. රහත් මහණහුට රාගය නිරුද්ධ වූයේ වෙයි. දොසය නිරුද්ධ වූයේ වෙයි. මෝහය නිරුද්ධ වූයේ වෙයි. ආනන්ද, යලිදු මා විසින් අනුපිළිවෙළින් සංස්කාරයන්ගේ සන්හිඳීම පවසන ලද්දේ ය. පළමු දැහැනට සමවන්නහුට වචනය සන්හුන්නේ වෙයි. ... සඤ්ඤාවේදයිතනිරොධයට සමවන්නහුට සංඥාත් වේදනාත් සන්හුන්නාහු වෙති. රහත් මහණහුට රාගය සන්හුන්නේ වෙයි. දොසය සන්හුන්නේ වෙයි. මෝහය සන්හුන්නේ වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, වැලිදු මා විසින් අනුපිළිවෙළින් සංස්කාරයන්ගේ පස්සද්ධිය පවසන ලද්දේ ය. පළමු දැහැනට සමවන්නහුට වචනය සන්හුන්නේ වෙයි. දෙවන දැහැනට සමවන්නහුට විතර්කවිචාර සන්හුන්නේ වෙයි. තෙවන දැහැනට සමවන්නහුට ප්‍රීතිය සන්හුන්නේ වෙයි. සිවුවන දැහැනට සමවන්නහුට ආශ්වාසප්‍රශ්වාස සන්හුන්නේ වෙයි. ආකාසානඤ්චායතනයට සමවන්නහුට රූපසංඥා සන්හුන්නී වෙයි. විඤ්ඤාණඤ්චායතනයට සමවන්නහුට ආකාසානඤ්චායතනසංඥා සන්හුන්නී වේ. ආකිඤ්චඤ්ඤායතනයට සමවන්නහුට විඤ්ඤාණඤ්චායතනසංඥා සන්හුන්නී වෙයි. නේවසඤ්ඤානාසඤ්ඤායතනයට සමවන්නහුට ආකිඤ්චඤ්ඤායතනසංඥා සන්හුන්නී වේ. සඤ්ඤාවෙදයිතනිරොධයට සමවන්නහුට සංඥාත් වෙදනාත් සන්හුන්නාහු වෙත්. රහත් මහණහුට රාගය සන්හුන්නේ වේ. දොසය සන්හුන්නේ වේ. මෝහය සන්හුන්නේ වේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය සන්තක සූත්‍රය",
                "level": "1"
            },
            {
                "text": "264. එකල්හි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. ... එකත්පසෙක හුන් ආයුෂ්මත් ආනන්ද තෙරුන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: ආනන්ද, වේදනාව කවරී ද? වේදනා සමුදය කවරේ ද? වේදනානිරොධය කවරේ ද? වේදනානිරෝධගාමිනී පටිපදාව කවරී ද? වේදනාවේ ආස්වාදය කවරේ ද? ආදීනවය කවරේ ද? නිස්සරණය කවරේ දැ? යි.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අපගේ දහම්හු භගවත්හු මුල් කොට ඇතියහ. භගවත්හු නේතෘ කොට ඇතියහ. භගවත්හු පිළිසරණ කොට ඇතියහ. වහන්ස, මැනවි. මේ දේශනාවේ අරුත භාග්‍යවතුන් වහන්සේට ම වැටහේවා. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්‍ෂූහු දරන්නාහ යි. ආනන්ද, එසේ වී නම් අසව. මැනවින් මෙනෙහි කරව. කියන්නෙමි යි. ‘එසේය වහන්සැ’යි. ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වූහ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "421"
            },
            {
                "text": "ආනන්ද, මේ වේදනා තුනෙකි: සුවවේදනා ය, දුක්වේදනා ය, නොදුක්නොසුවවේදනා යි. ආනන්ද, මොහු වේදනා යයි කියනු ලැබෙත්. ඵස්සසමුදයයෙන් වෙදනාසමුදය වේ. ඵස්සනිරොධයෙන් වෙදනානිරොධය වේ. මේ අරීඅටඟිමඟ ම වෙදනානිරොදගාමිනී පටිපදාව යි. එනම්: සම්මාදිට්ඨි ය ... සම්මාසමාධි යි. වේදනාව නිසා යම් සුවයෙක් සොම්නසෙක් උපදී නම් මේ වේදනාවේ ආස්වාදය යි. යම් වේදනාවක් අනිස නම් දුක් නම් වෙනස් වනසුලු නම් මේ වේදනාවේ ආදීනව යි. වේදනාවෙහි යම් ඡන්දරාගය දුරුකිරීමෙක් ඡන්දරාගය පැහීමෙක් වේ නම් මේ වේදනාවේ නිස්සරණ යි.",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, වැලි දු මා විසින් අනුපිළිවෙළින් සංස්කාරයන්ගේ නිරොධය පවසන ලද්දේ ය. පළමු දැහැනට සමවන්නහුට වචනය නිරුද්ධ වූයේ වේ. ... සඤ්ඤාවේදයිතනිරොධයට සමවන්නහුට සංඥාත් වෙදනාත් නිරුද්ධ වූවාහු වෙති. රහත් මහණහුගේ රාගය නිරුද්ධ වූයේ වෙයි. දොසය නිරුද්ධ වූයේ වෙයි. මෝහය නිරුද්ධ වූයේ වෙයි. ",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, යලිදු මා විසින් අනුපිළිවෙළින් වූ සංස්කාරයන්ගේ සන්හිඳීම පවසන ලද්දේ ය. පළමු දැහැනට සමවන්නහුට වචනය සන්හිඳුනේ වෙයි. ... සඤ්ඤාවේදයිතනිරොධයට සමවන්නහුට සංඥාත් වේදනාත් සන්හුන්නාහු වෙති. රහත් මහණහුට රාගය සන්හුන්නේ වෙයි. දොසය සන්හුන්නේ වෙයි. මෝහය සන්හුන්නේ වේ.",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, යළිදු මා විසින් අනුපිළිවෙළින් වූ සංස්කාරයන්ගේ පස්සද්ධිය පවසන ලදි. පළමු දැහැනට සමවන්නහුට වචනය සන්හිඳුනේ වෙයි. ... සඤ්ඤාවේදයිතනිරොධයට සමවන්නහුට සංඥාත් වේදනාත් සන්හුන්නාහු වෙති. රහත් මහණහුට රාගය සන්හුන්නේ වෙයි. දොසය සන්හුන්නේ වෙයි. මෝහය සන්හුන්නේ වේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අට්ඨක සූත්‍රය",
                "level": "1"
            },
            {
                "text": "265. එකල්හි බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පස් ව හුන්හ. එකත්පස් ව හුන් ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙය සැලකළහ: වහන්ස, ‘වේදනාව කවරී ද? වේදනාසමුදය කවරේ ද? වේදනානිරෝධය කවරේ ද? වෙදනනිරොධගාමිනී පටිපදාව කවරී ද? වේදනාවෙහි ආස්වාද කිමෙක් ද? ආදීනව කිමෙක් ද? නිස්සරණය කිමෙක් දැ? යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "423"
            },
            {
                "text": "මහණෙනි, මේ වේදනා තුනකි: සුවවේදනා ය, දුක්වේදනා ය, මැදහත්වේදනා යි. මහණෙනි, මොහු වෙදනා යයි කියනු ලැබෙත්. ඵස්සසමුදයයෙන් වෙදනාසමුදයය වේ. ඵස්සනිරොධයෙන් වෙදනානිරොධය වේ. මේ අරිඅටඟිමඟ ම වේදනානිරොධගාමිනීපටිපදාව යි. එනම්: සම්මාදිට්ඨි ය ... සම්මාසමාධි යි. වේදනාව නිසා යම් සුවයෙක් සොම්නසෙක් උපදී නම් මේ වෙදනාවේ ආස්වාද යි. යම් වෙදනාවක් අනිස නම් දුක් නම් වෙනස් වනසුලු නම් මේ වෙදනාවේ ආදීනව යි. වෙදනාවෙහි යම් ඡන්දරාගය දුරුලීමෙක් ඡන්දරාගය පැහීමෙක් වේ නම් මේ වෙදනාවේ නිස්සරණ යි.",
                "type": "paragraph"
            },
            {
                "text": "වැලිදු මහණෙනි, මා විසින් අනුපිළිවෙළින් සංස්කාරයන්ගේ නිරොධය පවසන ලද්දේ ය. පළමු දැහැනට සමවන්නහුට වචනය නිරුද්ධ වූයේ වෙයි ... සඤ්ඤාවෙදයිතනිරොධයට සමවන්නහුට සංඥාත් වෙදනාත් නිරුද්ධ වූවා වෙත්. රහත් මහණහුට රාගය නිරුද්ධ වූයේ වෙයි. දොසය නිරුද්ධ වූයේ වෙයි. මොහය නිරුද්ධ වූයේ වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "වැලිදු මහණෙනි, මා විසින් අනුපිළිවෙළින් සංස්කාරයන්ගේ සන්හිඳීම පවසන ලද්දේ ය, පළමු දැහැනට සමවන්නහුට වචනය සන්හුන්නේ වෙයි. ... සඤ්ඤාවෙදයිතනිරොධයට සමවන්නහුට සංඥාත් වෙදනාත් සන්හුන්නාහු වෙති. රහත් මහණහුට රාගය සන්හුන්නේ වෙයි. දොසය සන්හුන්නේ වෙයි. මොහය සන්හුන්නේ වේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මේ සන්හිඳුම් සයෙකි. ‘පළමු දැහැනට සමවන්නහුට වචනය සන්හුන්නේ වෙයි. දෙවන දැහැනට සමවන්නහුට විතක්කවිචාර සන්හුන්නේ වෙයි. තෙවන දැහැනට සමවන්නහුට ප්‍රීතිය සන්හුන්නී වෙයි, සිවුවන දැහැනට සමවන්නහුට ආශ්වාසප්‍රශ්වාස සන්හුන්නේ වේ. සඤ්ඤාවෙදයිතනිරොධයට සමවන්නහුට සංඥාත් වෙදනාත් සන්හුන්නාහු වෙත්. රහත් මහණහුට රාගය සන්හුන්නේ වෙයි. දොසය සන්හුන්නේ වෙයි. මොහය සන්හුන්නේ වේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය අට්ඨක සූත්‍රය",
                "level": "1"
            },
            {
                "text": "266. එකල්හි බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. ... එකත්පස් ව හුන් ඒ භික්ෂූන්ට භාග්‍යවතුන් වහන්සේ ‍මෙය වදාළසේක: මහණෙනි, වෙදනාව කවරී ද? වෙදනා සමුදය කවරේ ද? වෙදනා නිරොධය කවරේ ද? වෙදනා නිරොධගාමිනීපටිපදාව කවරී ද? වෙදනාවෙහි ආස්වාදය කිමෙක් ද? ආදීනවය කිමෙක් ද? නිස්සරණය කිමෙක් දැ? යි.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අපගේ දහම්හු භගවත්හු මුල් කොට ඇතියහ. ... මහණෙනි, මේ වෙදනා තුනෙකි: සුවවෙදනා ය, දුක්වෙදනා ය, මැදහත්වෙදනා යි. මහණෙනි, මොහු වෙදනා යි කියනු ලැබෙත්. ඵස්සසමුදයෙන් වෙදනාසමුදය වේ, ... (පළමු සුතුර යම් සේ නම් එසේ විස්තර කටයුතු යි.)",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "425"
            },
            {
                "type": "centered",
                "text": "2. 2. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පඤ්‌චකඞ්‌ග සූත්‍රය",
                "level": "1"
            },
            {
                "text": "267. එකල්හි පඤ්චකඞ්ගවඩුවා ආයුෂ්මත් උදායී තෙරුන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් උදායි තෙරුන් වැඳ එකත්පස්ව හුන්නේ ය. එකත්පස්ව හුන් පඤ්චකඞ්ගවඩුවා ආයුෂ්මත් උදායී තෙරුන්ට මෙය කී ය: “වහන්ස, උදායි තෙරණුවනි, කෙතෙක් වේදනාවෝ භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දාහු දැ?” යි.",
                "type": "paragraph"
            },
            {
                "text": "ගැහැවිය, භාග්‍යවතුන් වහන්සේ විසින් වේදනා තුනක් වදාරන ලදි. සුවවේදනා ය දුක්වේදනා ය, මැදහත්වේදනා යි. ගැහැවිය, මේ වේදනා තුන භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදැ යි.",
                "type": "paragraph"
            },
            {
                "text": "මෙසේ කී කල්හි පඤ්චකඞ්ගවඩුවා ආයුෂ්මත් උදායි තෙරුන්ට මෙය කීය: “වහන්ස, උදායි තෙරණුවනි, භාග්‍යවතුන් වහන්සේ විසින් වේදනා තුනක් නො වදාරන ලද, සුව වේදනා ය දුක්වේදනා යි වේදනා දෙකක් භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදී. වහන්ස, යම් මේ නොදුක් නොසුව වේදනාවෙක් වේ නම් මෙය ශාන්ත වූ ප්‍රණීත වූ සුවයෙහි ලා භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදැ යි.",
                "type": "paragraph"
            },
            {
                "text": "දෙවනවට දු ආයුෂ්මත් උදායී තෙරණුවෝ පඤ්චකඞ්ගවඩුවාට මෙය කීහ: ‘ගැහැවිය භාග්‍යවතුන් වහන්සේ විසින් වේදනා දෙකක් නො වදාරන ලදි. වේදනා තුනක් භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදි. සුව වේදනා ය දුක් වේදනා ය නොදුක් නො සුව වේදනා’යි. මේ වේදනා තුන භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදැයි.",
                "type": "paragraph"
            },
            {
                "text": "දෙවන්වට දු පඤ්චකඞ්ගවඩුවා ආයුෂ්මත් උදායී තෙරනට මෙය කීය: “වහනස, උදායී තෙරණුවනි, භාග්‍යවතුන් වහන්සේ විසින් වේදනා තුනක් නොම වදාරන් ලදි, සුවවේදනා ය දුක්වේදනා යි වේදනා දෙකක් භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදී. වහන්ස, යම් මේ නොදුක් නොසුව වේදනාවක් වේ නම් මෙය ශාන්ත වූ ප්‍රණීත වූ සුවයෙහි ලා භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදැ”යි.",
                "type": "paragraph"
            },
            {
                "text": "තෙවනවට දු ආයුෂ්මත් උදායී තෙරණුවෝ පඤ්චකඞ්ගවඩුවාට මෙය කීහ: ගැහැවිය භාග්‍යවතුන් වහන්සේ විසින් වෙදනා දෙකක් නොම වදාරන ලදි. භාග්‍යවතුන් වහන්සේ විසින් වෙදනා තුනක් වදාරන ලදි. සුවවෙදනා ය දුක්වෙදනා ය මැදහත්වෙදනා යි. මේ වෙදනා තුන භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදැ යි.",
                "type": "paragraph"
            },
            {
                "text": "තෙවන වට දු පඤ්චකඞ්ගවඩුවා ආයුෂ්මත් උදායී තෙරුන්ට මෙය කීය: වහනස, උදායී තෙරණුවනි, භාග්‍යවතුන් වහන්සේ විසින් වෙදනා තුනක් නොම වදාරන ලදි. සුවවෙදනා ය දුක්වෙදනා යි වෙදනා දෙකක් භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදී. වහන්ස, යම් මේ නො දුක් මැදහත් වෙදනාවක් වේ නම් මෙය ශාන්ත වූ ප්‍රණීත වූ සුවයෙහි ලා භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදැ යි. ආයුෂ්මත් උදායී තෙරණුවෝ පඤ්චකඞ්ගවඩුවනට හඟවන්නට නොම හැකි වූහ. පඤ්චකඞ්ගවඩුවා ද ආයුෂ්මත් උදායී තෙරුන්ට හඟවන්නට නො ද හැකි විය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "427"
            },
            {
                "text": "ආයුෂ්මත් ආනන්ද තෙරණුවෝ පඤ්චකඞ්ගවඩුවා සමඟ වූ ආයුෂ්මත් උදායි තෙරන්ගේ මේ කථාසල්ලාපය ඇසූහ. එකල්හි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹීයහ ... එකත්පස්ව හුන් ආයුෂ්මත් ආනන්ද තෙරණුවෝ පඤ්චකඞ්ගවඩුවා සමඟ ආයුෂ්මත් උදායි තෙරුන්ගේ කථාසල්ලාපය යම්තාක් වී ද, ඒ සියල්ල භාග්‍යවතුන් වහන්සේට සැලකළහ.",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, පඤ්චකඞ්ගවඩුවා උදායි මහණහුගේ ඇත්තා වූ ම දහම්නය නො පිළිගත්තේ ය. ආනන්ද, උදායි මහණ ද පඤ්චකඞ්ගවඩුවාගේ ඇත්තා වූ ම දහම්නය නො පිළිගත්තේ ය. ආනන්ද, මා විසින් නය වශයෙන් වෙදනා දෙකකුදු කියන ලදී. මා විසින් නය වශයෙන් වෙදනා තුනකුදු කියන ලදී. මා විසින් නය වශයෙන් වෙදනා පසකුදු කියන ලදී. මා විසින් නය වශයෙන් වෙදනා සයකුදු කියන ලදී. මා විසින් නය වශයෙන් වෙදනා අටළොසකුදු කියන ලදී. මා විසින් නය වශයෙන් වෙදනා සතිසකුදු කියන ලදී. මා විසින් නයවශයෙන් වෙදනා අටෝරාසියකුදු කියන ලදී.",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, මෙසේ මා විසින් දහම් නය වශයෙන් දේශනා කරන ලදී. ආනන්ද, මෙසේ මා විසින් නය වශයෙන් දෙසන ලද දහම් ඇති කල්හි යම් කෙනෙක් ඔවුනොවුන්ගේ සුභාසිතය සුලපිතය එක්ව නො හඟනාහු නම් නො අනුදන්නාහු නම් නො පිළිගන්නාහු නම් ඔවුන් විසින් “හටගත් ඩබර ඇත්තාහු හටගත් කලහ ඇත්තාහු විවාදයට පැමිණියාහු ඔවුනොවුන් මුවසැත්වලින් විදගනිමින් වෙසෙන්නාහ”යි මෙය කැමති විය යුතුයි.",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, මෙසේ මා විසින් ධර්මය නය වශයෙන් දේශනා කරන ලදී. ආනන්ද, මෙසේ මා විසින් නය වශයෙන් දේශනා ලද දහම ඇති කල්හි යම් කෙනෙක් ඔවුනොවුන්ගේ සුභාෂිතය සුලපිතය හඟනාහු නම් අනුදන්නාහු නම් පිළිගන්නාහු නම් ඔවුන් විසින් “සමග වූවාහු සතුටු වන්නාහු විවාද නො කරන්නාහු කිරි හා දිය මෙන් එක් වූවාහු ඔවුනොවුන් ප්‍රියඇසින් බලමින් වෙසෙන්නාහ”යි මෙය කැමති විය යුතු ය.",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, මේ කාමගුණ පසෙකි. කවර පසෙක් ද යත්: ඉටු කැමති මන වඩන ප්‍රියස්වරූප වූ කාමයෙන් යුත් ඇලුම් කටයුතු ඇසින් දතයුතු රූපයෝ ය ... කනින් දතයුතු සදහු ය ... නැහැයෙන් දත යුතු ගඳහු ය ... දිවෙන් දතයුතු රස ය. ඉටු කැමති මන වඩන ප්‍රියස්වරූප වූ කාමයෙන් යුත් ඇලුම් කටයුතු කයින් දතයුතු පහස් ය යි. ආනන්ද, මොහු පස්කම් ගුණයෝ ය. ආනන්ද, මේ පස්කම්ගුණ නිසා යම් සුවයෙක් සොම්නසෙක් උපදී නම් මේ කම්සුවය යි කියනු ලැබේ. ආනන්ද, යම් කෙනෙක් “පරමශාන්ත සුවය වූ මේ සොම්නස විඳිති”යි මෙසේ කියන්නාහු නම් ඔවුන්ගේ මේ වචනය මම නො අනුදනිමි. ඒ කවර හෙයින යත්: ආනන්ද, මේ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන් සුවයෙක් ඇත.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "429"
            },
            {
                "text": "ආනන්ද, මේ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් ඒ සුවය කවරේ ද: ආනන්ද, මෙසස්නෙහි මහණ කාමයෙන් වෙන් ව ම අකුසල් දහමින් වෙන් ව විතර්ක සහිත විචාර සහිත විවේකයෙන් හටගත් ප්‍රීතිය හා සුවය ඇති පළමුවන දැහැනට එළඹ වෙසේ. ආනන්ද, මේ වනාහි ඒ සුවයට වඩා ඉතා කැමති වූත් ඉතා ඉතා පිණී වූත් අනෙක් සුවය යි.",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, යම් කෙනෙක් පරමශාන්ත සුවය වූ මේ සොම්නස විඳිති යි මෙසේ කියන්නාහු නම් ඔවුන්ගේ මේ වචනය මම නො අනුදනිමි. ඒ කවර හෙයිනයත්; ආනන්ද, මේ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන් සුවයෙක් ඇත. ආනන්ද, මේ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන් සුවය කවරේ ද: ආනන්ද, මෙ සස්නෙහි මහණ විතර්කවිචාරයන්ගේ සන්හිඳීමෙන් ඇතුළත පැහැදීම ඇති සිතේ එකඟකම ඇති විතර්ක රහිත විචාර රහිත සමාධියෙන් හටගත් ප්‍රීතිය හා සුවය ඇති දෙවන දැහැනට එළඹ වෙසේ. ආනන්ද, මේ වනාහි ඒ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අනෙක් සුවය යි. ",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, ‘යම් කෙනෙක් පරමශාන්ත සුවය වූ මේ සොම්නස විඳිති’යි මෙසේ කියන්නාහු නම් ඔවුන්ගේ මේ කියමන මම නො අනුදනිමි. ඒ කවර හෙයින යත්; ආනන්ද, මේ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන් සුවයෙක් ඇත. ආනන්ද, මේ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් ඒ අන් සුවය කවරේ ද: ආනන්ද, මෙ සස්නෙහි මහණ ප්‍රීතියත් දුරු කිරීමෙන් උපෙක්ෂා ඇත්තේත් වෙසෙයි. සිහි ඇත්තේත් මනාදැනුම් ඇත්තේත් කයින් සුවත් විඳියි. උපේක්ෂා ඇත්තේ ය. සිහි ඇත්තේ ය, සුවවිහරණ ඇත්තේ ය යි ආර්ය්‍යයෝ ඒ යමක් සඳහා කියත් නම් ඒ තුන්වන දැහැනට එළඹ වෙසේ. ආනන්ද, මේ වනාහි ඒ සුවයට වඩා ඉතා කැමති වූත් ඉතා ප්‍රණීත වූත් අන් සුවය යි. ",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, යම් කෙනෙක් පරමශාන්තසුවය වූ මේ සොම්නස විඳිතියි මෙසේ කියන්නාහු නම් ඔවුන්ගේ මේ වචනය මම නො අනුදනිමි. ඒ කවර හෙයින යත්: ආනන්ද, මේ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන් සුවයෙක් ඇත. ආනන්ද, මේ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන් සුවය කවරේ ද: ආනන්ද, මෙ සස්නෙහි මහණ සුවයත් දුරු කිරීමෙන් දුකත් දුරු කිරීමෙන් පළමු ම සොම්නස්දොම්නසුන් දුරු කිරීමෙන් නොදුක් වූ නොසුව වූ උපේක්ෂාවෙන් හා සිහියෙන් හටගත් පිරිසිදුබැව් ඇති සිවුවන දැහැනට එළඹ වෙසේ. ආනන්ද, මේ වනාහි ඒ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන් සුවය යි.",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, යම් කෙනෙක් පරමශාන්ත සුවය වූ මේ සොම්නස විඳිතියි මෙසේ කියන්නාහු නම් ඔවුන්ගේ මේ කියමන මම නො අනුදනිමි. ඒ කවර හෙයින යත්: ආනන්ද, මේ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන් සුවයෙක් ඇත. ආනන්ද, මේ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන් සුවය කවරේ ද: ආනන්ද, මෙසස්නෙහි මහණ සර්වප්‍රකාරයෙන් රූපසංඥාවන් ඉක්ම වීමෙන් පටිඝසංඥාවන්ගේ අභාවයෙන් නානාත්ව සංඥාවන් නො මෙනෙහි කිරීමෙන් ආකාශය අනන්ත ය යි ආකාසානඤ්චායතනයට එළඹ වෙසෙයි. ආනන්ද, මේ වනාහි ඒ සුවයට වඩා ... ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "431"
            },
            {
                "text": "ආනන්ද, යම් කෙනෙක් පරමශාන්ත සුවය වූ මේ සොම්නස විඳිතියි මෙසේ කියන්නාහු නම් ඔවුන්ගේ මේ වචනය මම නො අනුදනිමි. ඒ කවර හෙයින යත්: ආනන්ද, මේ සුවයට වඩා … ඇත. ආනන්ද, මේ සුවයට වඩා … අන්සුවය කවරේ ද?: ආනන්ද, මෙ සස්නෙහි මහණ සර්වප්‍රකාරයෙන් ආකාසානඤ්චායතනය ඉක්මවා විඤ්ඤාණය අනන්තය යි විඤ්ඤාණඤ්චායතනයට එළඹ වෙසෙයි. ආනන්ද, මෙය වනාහි මේ සුවයට වඩා …",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, ‘යම් කෙනෙක් පරමශාන්ත සුවය වූ මේ සොම්නස විඳිති’යි මෙසේ කියන්නාහු නම් ඔවුන්ගේ මේ කියමන මම නො අනුදනිමි. ඒ කවර හෙයින යත්: ආනන්ද, මේ සුවයට වඩා … ඇත. ආනන්ද, මේ සුවයට වඩා … අන් සුවය කවරේ ද: ආනන්ද, මෙසස්නෙහි මහණ සර්වප්‍රකාරයෙන් විඤ්ඤාණඤ්චායතනය ඉක්මවා කිසිවක් නැතැ යි ආකිඤ්චඤ්ඤායතනයට එළඹ වෙසෙයි. ආනන්ද, මේ වනාහි ඒ සුවයට වඩා ... ",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, යම් කෙනෙක් පරමශාන්ත සුවය වූ මේ සොම්නස විඳිති යි මෙසේ කියන්නාහු නම් ඔවුන්ගේ මේ වචනය මම නො අනුදනිමි. ඒ කවර හෙයින යත්; ආනන්ද, මේ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන් සුවයෙක් ඇත. ආනන්ද, මේ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් ඒ සුවය කවරේ ද: ආනන්ද, මේ මහණ සර්වප්‍රකාරයෙන් ආකිඤ්චඤ්ඤායතනය ඉක්මවා නේවසඤ්ඤානාසඤ්ඤායතනයට එළඹ වෙසෙයි. ආනන්ද, මේ වනාහි ඒ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන්සුවය යි.",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, යම් කෙනෙක් පරම ශාන්ත සුවය වූ මේ සොම්නස විඳිති යි මෙසේ කියන්නාහු නම් ඔවුන්ගේ මේ වචනය මම නො අනුදනිමි. ඒ කවර හෙයින යත්: ආනන්ද, මේ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන් සුවයෙක් ඇත. ආනන්ද, මේ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන් සුවය කවරේ ද: ආනන්ද, මේ මහණ සර්වප්‍රකාරයෙන් නේවසඤ්ඤානාසඤ්ඤායතනය ඉක්මවා සඤ්ඤාවෙදයිතනිරොධයට එළඹ වෙසේ. ආනන්ද, මේ වනාහි ඒ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන් සුවය යි.",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, යම් හෙයකින් අන්තොටු පිරිවැජියෝ ‘මහණ ගොයුම් තෙමේ සඤ්ඤාවේදයිතනිරෝධයක් කියයි එ ද සුවය යි පනවයි. ඒ මෙය කිමෙක් ද? ඒ මෙය කෙසේ දැ’යි. මෙසේ කියන්නාහු නම් මේ කරුණ ඇත. ආනන්ද, මෙසේ කියන අන්තොටු පිරිවැජියෝ මෙසේ කියයුතු වන්නාහ. ඇවැත්නි, භාග්‍යවතුන් වහන්සේ සුවවෙදනාව ම සඳහා සුව යයි නො පනවති, ඇවැත්නි, යම් තැනක සුවය ලැබේ ද, යමක් යමක් සුව ද, එය එය තථාගතයන් වහන්සේ සුව ය යි පනවන සේකැ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "433"
            },
            {
                "type": "centered",
                "text": "2. 2. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "භික්‌ඛු සූත්‍රය",
                "level": "1"
            },
            {
                "text": "268. මහණෙනි, මවිසින් නය වශයෙන් වෙදනා දෙකකුදු කියන ලදි. මා විසින් නය වශයෙන් වෙදනා තුනකුදු කියන ලදි. මා විසින් නය වශයෙන් වෙදනා පසකුදු කියන ලදි. මා විසින් නය වශයෙන් වෙදනා සයකුදු කියන ලදි. මා විසින් නය වශයෙන් වෙදනා අටළොසකුදු කියන ලදි. මා විසින් නය වශයෙන් වෙදනා සතිසකුදු කියන ලදි. මා විසින් නය වශයෙන් වෙදනා අටෝරාසියකුදු කියන ලදි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මෙසේ මා විසින් නය වශයෙන් දහම දේශනා කරන ලදි. මහණෙනි, මෙසේ මා විසින් නය වශයෙන් දේශනා කරන ලද දහම ඇති කල්හි යම් කෙනෙක් ඔවුනොවුන්ගේ සුභාෂිතය සුලපිතය මැනවින් නො හඟනාහු නම් නො අනුදන්නාහු නම් නො පිළිගන්නාහු නම් ඔවුන් විසින් ‘හටගත් ඩබර ඇත්තාහු හටගත් කලහ ඇත්තාහු විවාදයට පැමිණියාහු ඔවුනොවුන් මුව සැත්වලින් පෙළමින් වෙසෙන්නාහු ය යි මෙය කැමති වියයුතු යි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මෙසේ මා විසින් නය වශයෙන් දහම් දෙසන ලදි. මහණෙනි, මෙසේ මා විසින් නය වශයෙන් දෙසන ලද දහම ඇති කල්හි යම් කෙනෙක් ඔවුනොවුන්ගේ සුභාෂිතය සුලපිතය මැනවින් හඟනාහු නම් අනුදන්නාහු නම් පිළිගන්නාහු නම් ඔවුන් විසින් ‘සමඟ වූවාහු සතුටු වන්නාහු විවාද නො කරන්නාහු කිරි හා දිය මෙන් එක් වූවාහු ඔවුනොවුන් ප්‍රිය ඇසින් බලමින් වෙසෙන්නාහ’යි මෙය කැමති වියයුතු යි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මේ කාමගුණ පසෙකි. කවර පසෙක් ද යත්: ඉටු කැමති මනවඩන පියදෑ වූ කාමයෙන් යුත් ඇලුම් කටයුතු ඇසින් දතයුතු රූ ය ... ඉටු කැමති මනවඩන පියදෑ වූ කාමයෙන් යුත් ඇලුම් කටයුතු කයින් දතයුතු පහස් යයි. මහණෙනි, මොහු පස්කම් ගුණයෝ ය.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මේ පස්කම්ගුණ නිසා යම් සුවයෙක් සොම්නසෙක් උපදී නම්, මේ කම්සුවය යි කියනු ලැබේ. මහණෙනි, ‘යම් කෙනෙක් පරමශාන්ත සුවය වූ මේ සොම්නස විඳිති’ යි මෙසේ කියන්නාහු නම්, ඔවුන්ගේ මේ වචනය මම නො අනුදනිමි. ඒ කවර හෙයින යත්: මහණෙනි, මේ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන් සුවයෙක් ඇත. මහණෙනි, මේ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන් සුවය කවරේ ද: මහණෙනි, මෙසස්නෙහි මහණ කාමයන්ගෙන් වෙන් ව ම අකුසල් දහමින් වෙන් ව ම විතර්ක සහිත විචාර සහිත විවේකයෙන් හටගත් ප්‍රීතිය හා සුවය ඇති පළමුවන දැහැනට එළඹ වෙසෙයි. මහණෙනි, මෙය වනාහි ඒ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණි වූත් අන් සුවය යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "435"
            },
            {
                "text": "මහණෙනි, යම් කෙනෙක් පරම ශාන්ත සුවය වූ මේ සොම්නස විඳිති යි මෙසේ කියන්නාහු නම් ඔවුන්ගේ මේ වචනය මම නො අනුදනිමි. ඒ කවර හෙයින යත්: මහණෙනි, මේ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන් සුවයෙක් ඇත. මහණෙනි, මේ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන් සුවය කවරේ ද: මහණෙනි, මෙසස්නෙහි මහණ සර්වප්‍රකාරයෙන් නේවසඤ්ඤානාසඤ්ඤායතනය ඉක්මවා සඤ්ඤාවේදයිතනිරොධයට එළඹ වෙසෙයි. මහණෙනි, මෙය වනාහී ඒ සුවයට වඩා ඉතා කැමති වූත් ඉතා පිණී වූත් අන් සුවය යි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් අන්තොටු පිරිවැජියෝ “මහණ ගොයුම්හු සඤ්ඤාවේදයිතනිරොධයක් කියති, එය සුව ය යි ද පනවයි. ඒ කිමෙක් ද? ඒ කෙසේ දැ?” යි. මෙසේ කියන්නාහු නම්, මේ කරුණ ඇත. මහණෙනි, මෙසේ කියන අන්තොටු පිරිවැජියෝ මෙසේ කියයුතු වන්නාහ. ඇවැත්නි, භාග්‍යවතුන් වහන්සේ සුවවෙදනාව සඳහා සුවය යි නො පනවන සේක. ඇවැත්නි, යම් යම් තැනෙක සුවය ලැබේ ද, යමක් යමක් සුව ද, එය එය තථාගතයන් වහන්සේ සුවය යි පනවන සේකැ යි.",
                "type": "paragraph"
            },
            {
                "text": "දෙවැනි රහොගතවර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රනාමාවලිය:**",
                "type": "unindented"
            },
            {
                "text": "රහොගත සූත්‍ර ය, ආකාශසූත්‍ර දෙක ය, අගාරසූත්‍ර ය, සන්තකසූත්‍ර දෙක ය, අට්ඨක සූත්‍ර දෙක ය, පඤ්චකඞ්ගසූත්‍ර ය, භික්ඛුසූත්‍ර ය යි සූත්‍ර දශයෙකි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "437"
            },
            {
                "text": "3.අට්‌ඨසතපරියාය වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "2. 3. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මොළියසීවක සූත්‍රය",
                "level": "1"
            },
            {
                "text": "269. එක් කලෙක භාග්‍යවතුන් වහන්සේ රජගහනුවර සමීපයෙහි කලන්දකනිවාප නම් වූ වේළුවනාරාමයෙහි වැඩවසන සේක. එකල්හි මොළියසීවක පිරිවැජි තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹීයේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සටුතු විය යුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පස් ව හුන්නේ ය. එකත්පස් ව හුන් මොළියසීවක පිරිවැජි තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැලකෙළේ ය. භවත් ගෞතමයෙනි, “මේ පුරිස් පුඟුල් තෙමේ සුව වූ හෝ දුක් වූ හෝ නොදුක් නොසුව වූ හෝ යම් කිසි වේදනාවක් විඳි නම් ඒ සියල්ල පෙර කළ කම් හේතු කොටගෙන ය” යි මෙබඳු වාද ඇති මෙබඳු දුටු ඇති ඇතැම් මහණ බමුණෝ ඇත් ම ය. මෙහි ලා භවත් ගෞතමයන් වහන්සේ කුමක් කියන සේක් දැ? යි.",
                "type": "paragraph"
            },
            {
                "text": "සීවක, මෙහි පිතින් හටගන්නා වූ ද ඇතැම් වේදනාවෝ උපදිත්, සීවක, පිතින් හටගන්නා වූ ද ඇතැම් වේදනාවෝ යම්සේ මෙහි උපදිත් නම් මෙය තමා විසිනුදු දතයුතු ය. සීවක, පිතින් හටගන්නා වූ ද ඇතැම් වේදනාවෝ යම්සේ මෙහි උපදිත් නම් මෙය ලෝවැසියන් විසිනුදු සැබෑ ය යි සම්මත ය. සීවක, එහි ලා යම් ඒ මහණ බමුණු කෙනෙක් “මේ පුරිස්පුඟුල් තෙමේ සුව වූ හෝ දුක් වූ මැදහත් වූ හෝ යම් කිසි වේදනාවක් විදී නම් ඒ සියල්ල පෙර කළ කම් හේතු කොටගෙන ය”යි මෙබඳු වාද ඇත්තාහු නම් මෙබඳු දිටු ඇත්තාහු නම් (ඔහු) යමකුන් තමා විසින් දන්නා ලද්දේ නම් එයත් ඉක්ම යෙති. යමකුන් ලොව සැබෑ ය යි සම්මත නම් එයත් ඉක්ම යෙති. එහෙයින් ඒ මහණ බමුණන්ගේ (බස) මුසා ය යි කියමි.",
                "type": "paragraph"
            },
            {
                "text": "සීවක, සෙමින් හටගන්නා වූ ද … සීවක, වාතයෙන් හටගන්නා වූ ද … සීවක, සන්නිපාතයෙන් හටගන්නා වූ ද ... සීවක, ඍතුවිපර්යාසයෙන් හටගන්නා වූ ද … සීවක, විෂමපරිහරණයෙන් හටගන්නා වූ … සීවක, උපක්‍රමයෙන් හටගන්නා වූ ද … සීවක, කර්මවිපාකයෙන් හටගන්නා වූ ද, ඇතැම් වේදනාවෝ මෙහි උපදිත්. සීවක, කර්මවිපාකයෙන් හටගන්නා වූ ඇතැම් වේදනාවෝ යම් සේ මෙහි උපදිත් නම් මෙය තමා විසිනුදු දතයුතු යි. සීවක, කර්මවිපාකයෙන් හටගන්නා වූ ඇතැම් වේදනාවෝ යම් සේ මෙහි උපදිත්නම් එය ලෝවැසියන් විසිනුදු සැබෑ ය යි සම්මත ය. සීවක, එහි ලා යම් ඒ මහණ බමුණු කෙනෙක් “මේ පුරිස් පුඟුල් තෙමේ සුව වූ හෝ දුක් වූ හෝ නොදුක්නොසුව වූ හෝ යම් කිසි වේදනාවක් විදී නම් ඒ සියල්ල පෙර කළ කම් හේතු කොට ගෙන ය”යි මෙබඳු වාද ඇත්තාහු නම් මෙබඳු දිටු ඇත්තාහු නම් (ඔහු) යමකුත් තමා විසින් දන්නා ලද්දේ නම් එයත් ඉක්ම යෙති. යමකුත් ලොව සැබෑ යයි සම්මත නම් එයත් ඉක්ම යෙති, එහෙයින් ඒ මහණ බමුණන්ගේ මුසා ය යි කියමි යි. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "439"
            },
            {
                "text": "මෙසේ වදාළ කල්හි මොළිය සීවක පිරිවැජි භාග්‍යවතුන් වහන්සේට මෙය සැලකෙළේ ය. “භවත් ගෞතමයෙනි, ඉතා මැනවි … භවත් ගෞතමයන් වහන්සේ මා අද පටන් දිවිහිමියෙන් සරණ ගිය උපාසකයකු කොට දරන සේක්වා”යි.",
                "type": "paragraph"
            },
            {
                "text": "පිත ද සෙම ද වාතය ද සන්නිපාතය ද ඍතු ද විෂම පරිහරණය ද උපක්‍රමය ද කර්මවිපාකයෙන් අටවැන්න ද වේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 2.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "අට්‌ඨසතපරියාය සූත්‍රය",
                "level": "1"
            },
            {
                "text": "270. මහණෙනි, අට්ඨසතපරියාය නම් වූ දහම්නය තොපට දේශනා කරන්නෙමි. එය අසවූ, මහණෙනි, අට්ඨසතපරියාය නම් වූ දහම්නය කවරේ ද යත්: මහණෙනි, මා විසින් නය වශයෙන් වේදනා දෙකෙකුදු කියන ලදී, මා විසින් නය වශයෙන් වේදනා තුනෙකුදු කියන ලදී, මා විසින් නය වශයෙන් වේදනා පසෙකුදු කියන ලදී, මා විසින් නය වශයෙන් වේදනා සයෙකුදු කියන ලදී, මා විසින් නය වශයෙන් වේදනා අටළොසෙකුදු කියන ලදී, මා විසින් නය වශයෙන් වේදනා සතිසෙකුදු කියන ලදී, මා විසින් නය වශයෙන් වේදනා අටෝරාසියෙකුදු කියන ලදී. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, වේදනා දෙක කවරේ ද යත්: කායික වේදනාව ද චේතසික වේදනාව දැ යි. මහණෙනි, මොහු වේදනා දෙක යයි කියනු ලැබෙත්. මහණෙනි, වේදනා තුන කවරේ ද යත්: සුව වේදනා ය, දුක් වේදනා ය, මැදහත් වේදනා ය යි. මහණෙනි, මොහු වේදනා තුන යයි කියනු ලැබෙත්. මහණෙනි, වේදනා පස කවරේද යත්: සුඛින්ද්‍රිය ය, දුක්ඛින්ද්‍රිය ය, සොමනස්සින්ද්‍රිය ය, දොමනස්සින්ද්‍රිය ය, උපෙක්ඛින්ද්‍රිය යි, මහණෙනි, මොහු වේදනා පස යයි කියනු කියනු ලැබෙත්. මහණෙනි, වේදනා සය කවරේ ද යත්: චක්ඛුසම්පස්සයෙන් හටගත් හටගත් වේදනා ය, සොත … ඝාන … ජිව්හා … කාය … මනෝසම්ඵස්සයෙන් හටගත් වේදනා යි. මහණෙනි, මොහු වේදනා සය යයි කියනු ලැබෙත්. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, වේදනා අටළොස කවරේ ද යත්: සොම්නස සමග හැසිරෙන සයය, දොම්නස සමග හැසිරෙන සයය, මැදහත් බව සමග හැසිරෙන සය යි. මහණෙනි, මොහු වේදනා අටළොස යි කියනු ලැබෙත්. මහණෙනි, වේදනා සතිස කවරේ ද යත්: පස්කම් ගුණ ඇසුරු කළසොම්නස් සය ය, නෙක්ඛම්මය ඇසුරු කළ සොම්නස් සය ය, පස්කම් ගුණ අසුරුකළ දොම්නස් සය ය. නෙක්ඛම්මය ඇසුරුකළ දොම්නස් සය ය. පස්කම්ගුණ ඇසුරුකළ උපෙක්ෂා සය යි. නෙක්ඛම්මය ඇසුරුකළ උපෙක්ෂා සය යි. මහණෙනි, මොහු වේදනා සතිසැ යි කියනු ලැබෙත්. මහණෙනි වේදනා එක්සියඅට කවරේ ද යත්: අතීත සතිස් වේදනා ය, අනාගත සතිස් වේදනා ය, පච්චුප්පන්න සතිස් වේදනා යි. මහණෙනි, මොහු වේදනා එක්සිය අට යයි කියනු ලැබෙත්. මහණෙනි, මේ අට්ඨසතපරියාය නම් වූ දහම් නය යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "441"
            },
            {
                "type": "centered",
                "text": "2. 3. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "භික්‌ඛු සූත්‍රය",
                "level": "1"
            },
            {
                "text": "271. එකල්හි එක්තරා මහණෙක් භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය … එකත්පස්ව හුන් ඒ මහණ භාග්‍යවතුන් වහන්සේට මෙය සැළකළේ ය: වහන්ස, වේදනාවෝ කවරහු ද? වේදනා සමුදය කවරේ ද? වේදනා සමුදයගාමිනිපටිපදාව කවර ද? වේදනා නිරෝධය කවරේ ද? වේදනානිරෝධගමිනි පටිපදාවකවර ද? වේදනාවේ අස්සාදය කවරේ ද? ආදීනවය කවරේද? නිස්සරණය කුමක් දැ? යි.",
                "type": "paragraph"
            },
            {
                "text": "මහණ, මේ වේදනා තුනෙකි. සුව වේදනා ය, දුක්වේදනා ය, මැදහත් වේදනා යි. මහණ, මොහු වේදනා යි කියනු ලැබෙත්. ඵස්සසමුදයෙන් වේදනා සමුදය වේ. තණ්හාව වේදනාසමුදයගාමිනිපටිපදාව යි. ඵස්සනිරෝධයෙන් වේදනානිරෝධය වේ. මේ අරිඅටඟිමග ම වේදනානිරෝධගාමිනීපටිපදාව යි. එනම් සම්මාදිට්ටිය … සම්මාසමධි යි. වේදනාව නිසා යම් සුවයෙක් සොම්නසෙක් උපදී නම් මේ වේදනාවේ ආස්වාද යි. යම් වේදනාවක් අනිස නම් දුක් නම් වෙනස්වනසුලු නම් මේ වේදනාවේ ආදීනව යි. වේදනායෙහි යම් ඡන්දරාගය දුරැ කිරීමෙක් ඡන්දරාගය ප්‍රහාණයෙක් වේ නම් මේ වේදනාවේ නිස්සරණ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පුබ්‌බෙ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "272. මහණෙනි, සම්බෝධියෙන් පෙර ම චතුස්සත්‍යාවබෝධය නො කළ බෝසත් වූ මැ මට මේ සිත විය. වේදනා කවරහු ද, වේදනා සමුදය කවරේ ද, වේදනාසමුදයගමිනී පටිපදව කවර ද? වේදනානිරෝධය කවරේද, වේදනානිරෝධගමිනී පටිපදාව කවර ද, වේදනාවේ ආස්වාදය කිමෙක් ද, ආදීනවය කිමෙක් ද, නිස්සරණය කිමෙක් දැ යි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, ඒ මට මේ සිත විය: මේ වේදනා තුනෙකි: සුවවේදනා ය, දුක් වේදනා ය, මැදහත් වේදනා යි. මොහු වේදනා යි කියනු ලැබෙත්. ඵස්සසමුදයෙන් වේදනාසමුදය වේ. තණ්හාව වේදනාසමුදයගමිනී පටිපදාව යි … වේදනායෙහි යම් ඡන්දරාගය දුරුකිරීමේක් ඡන්දරාගය පැහීමෙක් වේ නම් මේ වේදනායෙහි නිස්සරණ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "443"
            },
            {
                "type": "centered",
                "text": "2. 3. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඤාණ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "273. මහණෙනි, මොහු වේදනාවෝ ය යි පෙර නො ඇසූ විරූ දහම්හි මට ඇස පහළ විය. විදු පහල විය. පැන පහළ විය. නැණ පහළ විය. එලිය පහළ විය. මහණෙනි, මේ වේදනා සමුදය ය යි පෙර නො ඇසූ විරූ දහම්හි මට ඇස පහළ විය … එලිය පහළ විය. මහණෙනි, මේ වේදනාසමුදයගමිනී පටිපදව ය යි පෙර නො ඇසූ විරූ දහම්හි මට ඇස පහළ විය. ... එලිය පහළ විය. මහණෙනි, මේ වේදනානිරෝධ ය යි පෙර නො ඇසූ වීරූ දහම්හි මට ඇස පහළ විය. ... එලිය පහළ විය. මහණෙනි, මේ වේදනානිරෝධගමිනී පටිපදව ය යි පෙර නො ඇසූ විරූ දහම්හි මට ... මහණෙනි, මේ වේදනාවේ ආස්වාදය යි පෙර නො ඇසූ විරූ දහම්හි මට … මහණෙනි, මේ වේදනාවේ ආදීනවය යි පෙර නො ඇසූ විරූ දහම්හි මට ... මහණෙනි, මේ වේදනාවේ නිස්සරණ ය යි පෙර නො ඇසූ වීරූ දහම්හි ඇස පහළ විය. නැණ පහළ විය. පැන පහළ විය. විදු පහළ විය. එලිය පහළ වී ය යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සම්‌බහුලභික්‌ඛු සූත්‍රය",
                "level": "1"
            },
            {
                "text": "274. එකල්හි බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ ... එකත්පසෙක හුන් ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙය සැලකළහ: වහන්ස, වේදනාවෝ කවරහු ද? වේදනාසමුදය කවරේ ද? වේදනාසමුදයගාමිනී පටිපදාව කවර ද? වේදනානිරෝධය කවරේ ද? වේදනානිරෝධගාමිනී පටිපදාව කවර ද? වේදනාවේ අස්වාදය කිමෙක් ද? ආදිනාවය කිමෙක් ද? නිස්සරණය කිමෙක් දැ? යි. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මේ වේදනා තුනෙකි: සුවවේදනා ය, දුක්වේදනා ය, මැදහත් වේදනා යි. මහණෙනි, මොහු වේදනා යි කියනු ලැබෙත්, ඵස්සසමුදයයෙන් වේදනා සමුදය ය වේ. තණ්හාව වේදනාසමුදයගාමිනී පටිපදාව යි. ඵස්සනිරෝධයෙන් වේදනානිරෝධය වේ ... වේදනාවෙහි යම් ඡන්දරාගය දුරලීමෙක් යම් ඡන්දරාගය ප්‍රහාණයෙක් වේ නම් මෙය වේදනාවේ නිස්සරණ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සමණබ්‍රාහ්‌මණ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "275. මහණෙනි, මේ වේදනා තුනෙකි. කවර තුනෙක් ද යත්: සුවවේදනා ය, දුක් වේදනා ය, මැදහත් වේදනා යි. මහණෙනි, යම් කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් මේ තුන් වේදනාවන්ගේ සමුදයත් අස්තඞ්ගමයත් ආස්වාදයත් ආදීනවයත් නිස්සරණයත් තතුසේ නො දනිත් ද ... දනිත් ද, ... තෙමේ ම වෙසෙසින් දැන පසක් කොට එයට එළඹ වෙසෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "445"
            },
            {
                "type": "centered",
                "text": "2. 3. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය සමණබ්‍රාහ්‌මණ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "276. මහණෙනි, මේ වේදනා තුනෙකි. කවර තුනෙක් ද යත්: සුව වේදනා ය, දුක්වේදනා ය, මැදහත්වේදනා යි. මහණෙනි, යම්කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ මේ තුන් වේදනාවන්ගේ සමුදයයත් අස්තඞ්ගමයත් ආස්වාදයත් ආදීනවයත් නිස්සරණයත් තතුසේ නොදනිත් ද ... දනිත් ද ... තුමූ වෙසෙසින් දැන පසක් කොට එයට පැමිණ වෙසෙත් යයි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තතිය සමණබ්‍රාහ්‌මණ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "277. මහණෙනි, යම් කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ වේදනාව නො දනිත් ද, වේදනා සමුදය නො දනිත් ද, වේදනා නිරෝධය නො දනිත් ද, වේදනා නිරෝධගාමිනී පටිපදාව නො දනිත් ද, ... දනිත් ද ... තුමූ වෙසෙසින් දැන පසක් කොට එයට පැමිණ වෙසෙත් යයි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුද්‌ධිකවෙදනා සූත්‍රය",
                "level": "1"
            },
            {
                "text": "278. මහණෙනි, මේ වේදනා තුනෙකි. කවර තුනෙක් ද යත්: සුවවේදනා ය, දුක්වේදනා ය, නොදුක් නොසුව වේදනා යි. මහණෙනි, මොහු තුන් වේදනාවෝ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නිරාමිස සූත්‍රය",
                "level": "1"
            },
            {
                "text": "279. මහණෙනි, සාමිස ප්‍රීතියක් ඇත, නිරාමිස ප්‍රීතියක් ඇත, නිරාමිස ප්‍රීතියට වඩා වැඩි වූ නිරාමිසතර ප්‍රීතියක් ඇත. සාමිස සුවයෙක් ඇත, නිරාමිස සුවයෙක් ඇත, නිරාමිස සුවයට වඩා වැඩි වූ නිරාමිසතර සුවයෙක් ඇත. සාමිස උපේක්ෂාවක් ඇත, නිරාමිස උපේක්ෂාවක් ඇත, නිරාමිස උපේක්ෂාවට වඩා වැඩි වූ නිරාමිසතර උපේක්ෂාවක් ඇත. සාමිස ව්මොක්ෂයෙක් ඇත, නිරාමිස විමෝක්ෂයෙක් ඇත, නිරාමිස විමෝක්ෂයට වඩා වැඩි වූ නිරාමිසතර විමෝක්ෂයෙක් ඇත. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, සාමිසප්‍රීතිය කවර යත්: මහණෙනි, මේ කාමගුණ පසෙකි. කවර පසෙක් ද යත්: ඉටු කැමැති මනවඩන ප්‍රියස්වරූප වූ කාමයෙන් යුත් ඇලුම් කටයුතු ඇසින් දතුයුතු රූපය ... ඉටු කැමති මනවඩන ප්‍රිය ස්වරූප වූ කාමයෙන් යුත් ඇලුම් කටයුතු කයින් දතයුතු පහස් ය. මහණෙනි, මොහු පස්කම්ගුණයෝ ය. මහණෙනි, මේ පස්කම්ගුණ නිසා යම් ප්‍රීතියක් උපදී නම්, මහණෙනි, මේ සාමිස ප්‍රීතිය යි කියනු ලැබේ. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "447"
            },
            {
                "text": "මහණෙනි, නිරාමිස ප්‍රීතිය කවර යත්: මහණෙනි, මෙසස්නෙහි මහණ කාමයන්ගෙන් වෙන්ව ම අකුශලධර්මයන්ගෙන් වෙන්ව ම විතර්ක සහිත විචාර සහිත විවේකයෙන් උපන් ප්‍රීතිය හා සැපය ඇති ප්‍රතමධ්‍යානයට එළඹ වෙසෙයි. විතර්කවිචාරයන්ගේ සන්හිඳිමෙන් ඇතුළත පැහැදීම ඇති සිතේ එකඟබැව් ඇති විතර්ක රහිත විචාර රහිත සමාධියෙන් උපන් ප්‍රීතිය හා සැපය ඇති ද්විතීයධ්‍යානයට එළඹ වෙසෙයි. මහණෙනි, මේ නිරාමිස ප්‍රීතිය යි කියනු ලැබේ. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, නිරාමිස ප්‍රීතියට වඩා වැඩි වූ නිරාමිසතර ප්‍රීතිය කවර යත්: මහණෙනි, රාගයෙන් මිදුණු සිත පස්විකන දොසයෙන් මිදුණු සිත පස්විකන මෝහයෙන් මිදුණු සිත පස්විකන රහත් මහණහට යම් ප්‍රීතියක් උපදී ද, මහණෙනි, මේ නිරාමිස ප්‍රීතියට වඩා වැඩි වූ නිරාමිසතර ප්‍රීතිය යි කියනු ලැබේ. ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, සාමිස සුවය කවරේ ද යත්: මහණෙනි, මේ කම්ගුණ පසෙකි. කවර පසෙක් ද යත්: ඉටු කැමති මනවඩන ප්‍රියස්වරූප වූ කාමයෙන් යුත් ඇලුම් කටයුතු ඇසින් දතයුතු රූපය. ... ඉටු කැමති මනවඩන ප්‍රියස්වරූප වූ කාමයෙන් යුත් ඇලුම් කටයුතු කයින් දතයුතු පහස් ය. මහණෙනි, මොහු පස්කම් ගුණයෝ ය. මහණෙනි, මේ පස්කම්ගුණ නිසා යම් සුවයෙක් සොම්නසෙක් උපදී නම් මහණෙනි, මේ සාමිස සුවය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, නිරාමිස සුවය කවරේ ද යත්: මහණෙනි, මෙ සස්නෙහි මහණ කාමයන්ගෙන් වෙන්ව මැ අකුසල්දහමින් වෙන් ව මැ විතර්ක සහිත විචාර සහිත විවේකයෙන් හටගත් ප්‍රීතිය හා සුවය ඇති පළමුවන දැහැනට එළඹ වෙසෙයි. විතර්ක විචාරයන්ගේ සන්හිඳීමෙන් ඇතුළත පැහැදීම ඇති සිතේ එකඟබැව් ඇති විතර්ක රහිත විචාර රහිත සමාධියෙන් හටගත් ප්‍රීතිය හා සුවය ඇති දෙවන දැහැනට එළඹ වෙසෙයි. ප්‍රීතියත් දුරුකිරීමෙන් උපේක්ෂා ඇත්තෙත් වෙසෙයි. සිහි ඇත්තේ මනා දැනුම් ඇත්තේ කයින් සුවත් විඳියි. උපේක්ෂා ඇත්තේ ය. සිහි ඇත්තේ ය. සුවවිහරණ ඇත්තේ ය යි. ආර්‍ය්‍යයෝ ඒ යමකට කියත් නම් ඒ තෙවන දැහැනට එළඹ වෙසෙයි. මහණෙනි, මේ නිරාමිස සුවය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, නිරාමිස සුවයට වඩා වැඩි වූ නිරාමිසතර සුවය කවරේ ද යත්: මහණෙනි, රාගෙන් මිඳුණු සිත පස්විකන දෝසයෙන් මිඳුණ සිත පස්විකන මෝහයෙන් මිඳුණ සිත පස්විකන රහත් මහණහුට යම් සුවයෙක් සොම්නසෙක් උපදී නම්, මහණෙනි, මෙය නිරාමිස සුවයට වඩා වැඩි වූ නිරාමිසතර සුවය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "449"
            },
            {
                "text": "මහණෙනි, සාමිස උපේක්ෂාව කවර ද යත්: මහණෙනි, මේ කම්ගුණ පසෙකි. කවර පසෙක් ද යත්: ඉටු කැමති මනවඩන ප්‍රියස්වරූප වු කාමයෙන් යුත් ඇලුම් කටයුතු කයින් දතයුතු රූපය … ඉටු කැමති මනවඩන ප්‍රියස්වරූප වු කාමයෙන් යුත් ඇලුම් කටයුතු කයින් දතයුතු පහස් ය. මහණෙනි, මොහු පස්කම්ගුණයෝ ය. මහණෙනි, මේ පස්කම්ගුණ නිසා යම් උපේක්ෂාවක් උපදී නම්, මහණෙනි, මෙය සාමිස උපේක්ෂා ය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, නිරාමිස උපේක්ෂාව කවර යත්: මහණෙනි, මෙසස්නෙහි මහණ සුවයත් පැහීමෙන් දුකත් පැහීමෙන් පළමු මැ සොම්නස් දොම්නසුන්ගේ අභාවයෙන් නොදුක් වූ නොසුව වූ උපේක්ෂාවෙන් හා සිහියෙන් හටගත් පිරිසිදු බැව් ඇති සිවුවන දැහැනට එළඹ වෙසෙයි. මහණෙනි, මේ නිරාමිස උපේක්ෂාව ය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, නිරාසාමිස උපේක්ෂාවට වඩා වැඩි වූ නිරාමිසතර උපේක්ෂාව කවර යත්: මහණෙනි, රාගයෙන් මිදුණු සිත පස්විකන දොසයෙන් මිදුණු සිත පස්විකන මෝහයෙන් මිදුණු සිත පස්විකන රහත් මහණහට යම් උපේක්ෂාවක් උපදී ද, මහණෙනි, මේ නිරාමිස උපේක්ෂාවට වැඩි වූ නිරාමිසතර උපේක්ෂාව ය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, සාමිස විමෝක්ෂය කවරේ ද යත්: රුපයෙන් යුත් විමෝක්ෂය සාමිස විමොක්ෂ යි. මහණෙනි, නිරාමිස විමෝක්ෂය කවරේ ද යත්: අරූපයෙන් යුත් විමෝක්ෂය නිරාමිස විමොක්ෂ යි. මහණෙනි, නිරාමිස විමෝක්ෂයට වඩා වැඩි වූ නිරාමිසතර විමෝක්ෂය කවරේ ද යත්: මහණෙනි, රාගයෙන් මිදුණ සිත පස්කවින දොසයෙන් මිදුණු සිත පස්කවින මෝහයෙන් මිදුණු සිත පස්කවින රහත් මහණ හට යම් විමෝක්ෂයෙක් උපදී ද, මහණෙනි, මේ නිරාමිස විමෝක්ෂයට වඩා වැඩි වූ නිරාමිසතර විමොක්ෂ යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "තෙවැනි වූ අට්ඨසතපරියායවර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රනාමාවලිය:**",
                "type": "unindented"
            },
            {
                "text": "සීවක අට්ඨසත භික්ඛු පුබ්බෙඤාණ සම්බහුලභික්ඛු යන සුත්‍ර සය ද සමණබ්‍රාහ්මණ සුත්‍ර තුන ද ශුද්ධික නිරාමිස සූත්‍ර දෙක දැ යි එකොළොසෙකි.",
                "type": "paragraph"
            },
            {
                "text": "වේදනා සංයුක්තය නිමි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    }
]