[
    {
        "filename": "sn-mhv-7",
        "bookId": 21,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "2"
            },
            {
                "type": "centered",
                "text": "සුත්තන්තපිටකෙ",
                "level": 2
            },
            {
                "type": "centered",
                "text": "සංයුත්තනිකායො",
                "level": 5
            },
            {
                "type": "centered",
                "text": "පඤ්චමභාගෙ - දුතියො කණ්ඩො",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "මහාවග්ගො",
                "level": 3
            },
            {
                "type": "heading",
                "text": "7. ඉද්ධිපාදසංයුත්තං",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. චාපාලවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "නමො තස්ස භගවතො අරහතො සම්මා සම්බුද්ධස්ස",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "7. 1. 1",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අපාරසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "3123.** සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "චත්තාරොමෙ භික්ඛවෙ, ඉද්ධිපාදා භාවිතා බහුලීකතා අපාරා පාරං{1 අපරාපරං - සී 1, 2.} ගමනාය සංවත්තන්ති. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, විරියසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, චිත්තසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉමෙ ඛො භික්ඛවෙ, චත්තාරො ඉද්ධිපාදා. භාවිතා බහුලීකතා අපාරා පාරං ගමනාය සංවත්තන්තීති."
            },
            {
                "type": "centered",
                "text": "7. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "විරද්ධසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3124. යෙසං කෙසඤ්චි භික්ඛවෙ, චත්තාරො ඉද්ධිපාදා විරද්ධා, විරද්ධො තෙසං අරියො මග්ගො සම්මාදුක්ඛක්ඛයගාමී. යෙසං කෙසඤ්චි භික්ඛවෙ, චත්තාරො ඉද්ධිපාදා ආරද්ධා, ආරද්ධො තෙසං අරියො මග්ගො සම්මාදුක්ඛක්ඛයගාමී. කතමෙ චත්තාරො:"
            },
            {
                "type": "page-break",
                "text": "4"
            },
            {
                "type": "paragraph",
                "text": "ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. යෙසං කෙසඤ්චි භික්ඛවෙ, ඉමෙ චත්තාරො ඉද්ධිපාදා විරද්ධා, විරද්ධො තෙසං අරියො මග්ගො සම්මාදුක්ඛක්ඛයගාමී. යෙසං කෙසඤ්චි භික්ඛවෙ, ඉමෙ චත්තාරො ඉද්ධිපාදා ආරද්ධා, ආරද්ධො තෙසං අරියො මග්ගො සම්මාදුක්ඛක්ඛයගාමීති."
            },
            {
                "type": "centered",
                "text": "7. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අරිය සුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3125. චත්තාරො‘මෙ භික්ඛවෙ, ඉද්ධිපාදා භාවිතා බහුලීකතා අරියා නිය්යානිකා නිය්යන්ති තක්කරස්ස සම්මාදුක්ඛක්ඛයාය. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉමෙ ඛො භික්ඛවෙ, චත්තාරො ඉද්ධිපාදා භාවිතා බහුලීකතා අරියා නිය්යානිකා නිය්යන්ති තක්කරස්ස සම්මා දුක්ඛක්ඛයායාති."
            },
            {
                "type": "centered",
                "text": "7. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නිබ්බිදාසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3126. චත්තාරො‘මෙ, භික්ඛවෙ, ඉද්ධිපාදා භාවිතා බහුලීකතා එකන්තනිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තන්ති. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති -පෙ- විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉමෙ ඛො භික්ඛවෙ, චත්තාරො ඉද්ධිපාදා භාවිතා බහුලීකතා එකන්තනිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තන්තීති."
            },
            {
                "type": "page-break",
                "text": "6"
            },
            {
                "type": "centered",
                "text": "7. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පදෙසසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3127. යෙ හි කෙචි භික්ඛවෙ, අතීතමද්ධානං සමණා වා බ්රාහ්මණා වා ඉද්ධිප්පදෙසං අභිනිප්ඵාදෙසුං, සබ්බෙ තෙ චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා. යෙ හි කෙචි භික්ඛවෙ, අනාගතමද්ධානං සමණා වා බ්රාහ්මණා වා ඉද්ධිප්පදෙසං අභිනිප්ඵාදෙස්සන්ති, සබ්බෙ තෙ චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා. යෙ හි කෙචි භික්ඛවෙ, එතරහි සමණා වා බ්රාහ්මණා වා ඉද්ධිප්පදෙසං අභිනිප්ඵාදෙන්ති සබ්බෙ තෙ චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා. කතමෙසං චතුන්නං: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. යෙ හි කෙචි භික්ඛවෙ, අතීතමද්ධානං සමණා වා බ්රාහ්මණා වා ඉද්ධිප්පදෙසං අභිනිප්ඵාදෙසුං -පෙ- අභිනිප්ඵාදෙසුං -පෙ- අභිනිප්ඵාදෙස්සන්ති -පෙ- අභිනිප්ඵාදෙන්ති සබ්බෙ තෙ ඉමෙසං යෙව චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තාති."
            },
            {
                "type": "centered",
                "text": "7. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සමත්තසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3128. යෙ හි කෙචි භික්ඛවෙ, අතීතමද්ධානං සමණා වා බ්රාහ්මණා වා සමත්තං ඉද්ධිං අභිනිප්ඵාදෙසුං, සබ්බෙ තෙ චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා. යෙ හි කෙචි භික්ඛවෙ, අනාගතමද්ධානං සමණා වා බ්රාහ්මණා වා සමත්තං ඉද්ධිං අභිනිප්ඵාදෙස්සන්ති, සබ්බෙ තෙ චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා. යෙ හි කෙචි භික්ඛවෙ, එතරහි සමණා වා බ්රාහ්මණා වා සමත්තං ඉද්ධිං අභිනිප්ඵාදෙන්ති, සබ්බෙ තෙ චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා. කතමෙසං චතුන්නං: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. යෙ හි කෙචි භික්ඛවෙ, අතීතමද්ධානං සමණා වා බ්රාහ්මණා වා සමත්තං ඉද්ධිං අභිනිප්ඵාදෙසුං -පෙ- අභිනිප්ඵාදෙස්සන්ති -පෙ- අභිනිප්ඵාදෙන්ති, සබ්බෙ තෙ ඉමෙසං යෙව චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තාති."
            },
            {
                "type": "page-break",
                "text": "8"
            },
            {
                "type": "centered",
                "text": "7. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "භික්ඛු සුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3129. යෙ හි කෙචි භික්ඛවෙ, අතීතමද්ධානං භික්ඛූ ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරිංසු. සබ්බෙ තෙ චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා. යෙ හි කෙචි භික්ඛවෙ, අනාගතමද්ධානං භික්ඛූ ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරිස්සන්ති, සබ්බෙ තෙ චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා. යෙ හි කෙචි භික්ඛවෙ, එතරහි භික්ඛූ ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරන්ති, සබ්බෙ තෙ චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා. කතමෙසං චතුන්නං: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. යෙ හි කෙචි භික්ඛවෙ, අතීතමද්ධානං භික්ඛූ ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරිංසු -පෙ- විහරිස්සන්ති -පෙ- විහරන්ති, සබ්බෙ තෙ ඉමෙසං යෙව චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තාති."
            },
            {
                "type": "centered",
                "text": "7. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අරහන්ත සුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3130. චත්තාරො මෙ භික්ඛවෙ, ඉද්ධිපාදා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉමෙ ඛො භික්ඛවෙ, චත්තාරො ඉද්ධිපාදා. ඉමෙසං ඛො භික්ඛවෙ, චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා තථාගතො අරහං සම්මාසම්බුද්ධොති වුච්චතීති."
            },
            {
                "type": "page-break",
                "text": "10"
            },
            {
                "type": "centered",
                "text": "7. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඤාණ සුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3131. අයං ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතො ඉද්ධිපාදොති මෙ භික්ඛවෙ, පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු චක්ඛුං උදපාදි, ඤාණං උදපාදි, පඤ්ඤා උදපාදි, විජ්ජා උදපාදි, ආලොකො උදපාදි. සො ඛො පනායං ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතො ඉද්ධිපාදො භාවෙතබ්බොති මෙ භික්ඛවෙ -පෙ- භාවිතොති මෙ භික්ඛවෙ, පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු චක්ඛුං උදපාදි -පෙ- ආලොකො උදපාදි."
            },
            {
                "type": "paragraph",
                "text": "අයං විරියසමාධිපධානසඞ්ඛාරසමන්නාගතො ඉද්ධිපාදොති මෙ භික්ඛවෙ, පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු චක්ඛුං උදපාදි -පෙ- ආලොකො උදපාදි. සො ඛො පනායං විරියසමාධිපධානසඞ්ඛාරසමන්නාගතො ඉද්ධිපාදො භාවෙතබ්බොති මෙ භික්ඛවෙ -පෙ- භාවිතොති මෙ භික්ඛවෙ, පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු චක්ඛුං උදපාදි -පෙ- ආලොකො උදපාදි."
            },
            {
                "type": "paragraph",
                "text": "අයං චිත්තසමාධිපධානසඞ්ඛාරසමන්නාගතො ඉද්ධිපාදොති මෙ භික්ඛවෙ, පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු චක්ඛුං උදපාදි -පෙ- ආලොකො උදපාදි. සො ඛො පනායං චිත්තසමාධිපධානසඞ්ඛාරසමන්නාගතො ඉද්ධිපාදො භාවෙතබ්බොති මෙ භික්ඛවෙ -පෙ- භාවිතොති මෙ භික්ඛවෙ, පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු චක්ඛුං උදපාදි -පෙ- ආලොකො උදපාදි."
            },
            {
                "type": "paragraph",
                "text": "අයං වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතො ඉද්ධිපාදොති මෙ භික්ඛවෙ, පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු චක්ඛුං උදපාදි -පෙ- ආලොකො උදපාදි. සො ඛො පනායං වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතො ඉද්ධිපාදො භාවෙතබ්බොති මෙ භික්ඛවෙ -පෙ- භාවිතො’ති මෙ භික්ඛවෙ, පුබ්බෙ අනනුස්සුතෙසු ධම්මෙසු චක්ඛුං උදපාදි, ඤාණං උදපාදි, පඤ්ඤා උදපාදි, විජ්ජා උදපාදි, ආලොකො උදපාදීති."
            },
            {
                "type": "centered",
                "text": "7. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "චෙතිය සුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3132. එකං සමයං භගවා වෙසාලියං විහරති මහාවනෙ කූටාගාරසාලායං. අථ ඛො භගවා පුබ්බන්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය වෙසාලිං පිණ්ඩාය පාවිසි. වෙසාලියං පිණ්ඩාය චරිත්වා පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො ආයස්මන්තං ආනන්දං ආමන්තෙසි: “ගණ්හාහි ආනන්ද, නිසීදනං. යෙන චාපාලං චෙතියං{1 චාපාලචෙතියං - ස්යා.} තෙනුපසඞ්කමිස්සාම{2 තෙනුපසංකමික්කාමි - සීමු.} දිවාවිහාරායා”ති. “එවං භන්තෙ”ති ඛො ආයස්මා ආනන්දො භගවතො පටිස්සුත්වා නිසීදනං ආදාය භගවන්තං පිට්ඨිතො පිට්ඨිතො අනුබන්ධි. අථ ඛො භගවා යෙන චාපාලං චෙතියං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදි. ආයස්මාපි ඛො ආනන්දො භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො ආයස්මන්තං ආනන්දං භගවා එතදවොච:"
            },
            {
                "type": "page-break",
                "text": "12"
            },
            {
                "type": "paragraph",
                "text": "රමණීයා ආනන්ද, වෙසාලී, රමණීයං උදෙනං චෙතියං, රමණීයං ගොතමකං චෙතියං, රමණීයං සත්තම්බං චෙතියං, රමණීයං බහුපුත්තං චෙතියං, රමණීයං සාරන්දදං චෙතියං, රමණීයං චාපාලං චෙතියං. යස්ස කස්සචි ආනන්ද, ඉමෙ චත්තාරො ඉද්ධිපාදා භාවිතා බහුලීකතා යානීකතා වත්ථුකතා අනුට්ඨිතා පරිචිතා සුසමාරද්ධා, සො ආකඞ්ඛමානො කප්පං වා තිට්ඨෙය්ය කප්පාවසෙසං වා. තථාගතස්ස ඛො ආනන්ද, චත්තාරො ඉද්ධිපාදා භාවිතා බහුලීකතා යානීකතා වත්ථුකතා අනුට්ඨිතා පරිචිතා සුසමාරද්ධා. ආකඞ්ඛමානො ආනන්ද, තථාගතො කප්පං වා තිට්ඨෙය්ය කප්පාවසෙසං වාති. එවම්පි ඛො ආයස්මා ආනන්දො භගවතා ඔළාරිකෙ නිමිත්තෙ කයිරමානෙ ඔළාරිකෙ ඔභාසෙ කයිරමානෙ නාසක්ඛි පටිවිජ්ඣිතුං. න භගවන්තං යාචි “තිට්ඨතු භන්තෙ, භගවා කප්පං, තිට්ඨතු සුගතො කප්පං, බහුජනහිතාය බහුජනසුඛාය ලොකානුකම්පාය අත්ථාය හිතාය සුඛාය දෙවමනුස්සාන”න්ති. යථා තං මාරෙන පරියුට්ඨිතචිත්තො."
            },
            {
                "type": "paragraph",
                "text": "[දුතියම්පි ඛො භගවා ආයස්මන්තං ආනන්දං භගවා එතදවොච: “රමණීයා ආනන්ද, වෙසාලී -පෙ- තතියම්පි ඛො භගවා ආයස්මන්තං ආනන්දං එතදවොච: “රමණීයා ආනන්ද, වෙසාලී, රමණීයං උදෙනං චෙතියං, රමණීයං ගොතමකං චෙතියං, රමණීයං සත්තම්බං චෙතියං, රමණීයං බහුපුත්තං චෙතියං, රමණීයං සාරන්දදං චෙතියං, රමණීයං චාපාලං චෙතියං. යස්ස කස්සචි, ආනන්ද, චත්තාරො ඉද්ධිපාදා භාවිතා බහුලීකතා යානීකතා වත්ථුකතා අනුට්ඨිතා පරිචිතා සුසමාරද්ධා. සො ආකඞ්ඛමානො ආනන්ද, කප්පං වා තිට්ඨෙය්ය, කප්පාවසෙසං වා. තථාගතස්ස ඛො ආනන්ද, චත්තාරො ඉද්ධිපාදා භාවිතා බහුලීකතා යානීකතා වත්ථුකතා අනුට්ඨිතා පරිචිතා සුසමාරද්ධා. ආකඞ්ඛමානො ආනන්ද, තථාගතො කප්පං වා තිට්ඨෙය්ය කප්පාවසෙසං වාති."
            },
            {
                "type": "paragraph",
                "text": "එවම්පි ඛො ආයස්මා ආනන්දො භගවතා ඔළාරිකෙ නිමිත්තෙ කයිරමානෙ ඔළාරිකෙ ඔභාසෙ කයිරමානෙ නාසක්ඛි පටිවිජ්ඣිතුං. න භගවන්තං යාචි: “තිට්ඨතු භන්තෙ, භගවා කප්පං, තිට්ඨතු සුගතො කප්පං, බහුජනහිතාය බහුජනසුඛාය ලොකානුකම්පාය අත්ථාය හිතාය සුඛාය දෙවමනුස්සාන”න්ති. යථා තං මාරෙන පරියුට්ඨිතචිත්තො.{1 න දිස්සතෙ‘යං පාඨො සී 1, 2 පොත්ථෙකසු}]"
            },
            {
                "type": "page-break",
                "text": "14"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා ආයස්මන්තං ආනන්දං ආමන්තෙසි. ගච්ඡ ඛො ත්වං ආනන්ද, යස්සදානි කාලං මඤ්ඤසීති. එවං භන්තෙති ඛො ආයස්මා ආනන්දො භගවතො පටිස්සුත්වා උට්ඨායාසනා භගවන්තං අභිවාදෙත්වා පදක්ඛිණං කත්වා අවිදූරෙ අඤ්ඤතරස්මිං රුක්ඛමූලෙ නිසීදි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො මාරො පාපිමා{1 අචිරපක්කන්තෙ ආයස්මන්තෙ ආනන්දෙ ඉති අධිකපාඨො මඡසං පොත්ථකෙ දිස්සති.} යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං එතදවොච: “පරිනිබ්බාතු‘දානි භන්තෙ, භගවා, පරිනිබ්බාතු සුගතො{2 පරිණිබ්බාතු‘දානි සුගතො - මඡසං.}, පරිනිබ්බානකාලො‘දානි භන්තෙ, භගවතො. භාසිතා ඛො පනෙසා භන්තෙ භගවතා වාචා: න තාවාහං පාපිම, පරිනිබ්බායිස්සාමි යාව මෙ භික්ඛූ න සාවකා භවිස්සන්ති වියත්තා විනීතා විසාරදා පත්තයොගක්ඛෙමා බහුස්සුතා{3 විසාරදා බහුස්සුතා - මඡසං, ස්යා.} ධම්මධරා ධම්මානුධම්මපටිපන්නා සාමීචිපටිපන්නා අනුධම්මචාරිනො, සකං ආචරියකං උග්ගහෙත්වා ආචික්ඛිස්සන්ති දෙසිස්සන්ති පඤ්ඤාපෙස්සන්ති පට්ඨපෙස්සන්ති විවරිස්සන්ති විභජිස්සන්ති උත්තානීකරිස්සන්ති උප්පන්නං පරප්පවාදං සහධම්මෙන සුනිග්ගහීතං නිග්ගහෙත්වා සප්පාටිහාරියං ධම්මං දෙසෙස්සන්තී”ති."
            },
            {
                "type": "paragraph",
                "text": "සන්ති ඛො පන භන්තෙ, එතරහි භික්ඛූ භගවතො සාවකා වියත්තා විනීතා විසාරදා පත්තයොගක්ඛෙමා බහුස්සුතා ධම්මධරා ධම්මානුධම්මපටිපන්නා සාමීචිපටිපන්නා අනුධම්මචාරිනො, සකං ආචරියකං උග්ගහෙත්වා ආචික්ඛන්ති දෙසෙන්ති පඤ්ඤාපෙන්ති පට්ඨපෙන්ති විවරන්ති විභජන්ති උත්තානීකරොන්ති, උප්පන්නං පරප්පවාදං සහධම්මෙන සුනිග්ගහිතං නිග්ගහෙත්වා සප්පාටිහාරියං ධම්මං දෙසෙන්ති. පරිනිබ්බාතු‘දානි භන්තෙ, භගවා, පරිනිබ්බාතු සුගතො, පරිනිබ්බානකාලො‘දානි භන්තෙ, භගවතො. භාසිතා ඛො පනෙසා භන්තෙ, භගවතා වාචා: “න තාවාහං පාපිම, පරිනිබ්බායිස්සාමි යාව මෙ භික්ඛුනියො න සාවිකා භවිස්සන්ති -පෙ- යාව මෙ උපාසකා න සාවකා භවිස්සන්ති -පෙ- යාව මෙ උපාසිකා න සාවිකා භවිස්සන්ති වියත්තා විනීතා විසාරදා, පත්තයොගක්ඛෙමා බහුස්සුතා ධම්මධරා ධම්මානුධම්මපටිපන්නා සාමීචිපටිපන්නා අනුධම්මචාරිනියො, සකං ආචරියකං උග්ගහෙත්වා ආචික්ඛිස්සන්ති දෙසිස්සන්ති පඤ්ඤාපෙස්සන්ති පට්ඨපෙස්සන්ති විවරිස්සන්ති විභජිස්සන්ති උත්තානීකරිස්සන්ති, උප්පන්නං පරප්පවාදං සහධම්මෙන සුනිග්ගහිතං නිග්ගහෙත්වා සප්පාටිහාරියං ධම්මං දෙසිස්සන්තී”ති."
            },
            {
                "type": "page-break",
                "text": "16"
            },
            {
                "type": "paragraph",
                "text": "සන්ති ඛො පන භන්තෙ, එතරහි උපාසිකා භගවතො සාවිකා වියත්තා විනීතා විසාරදා පත්තයොගක්ඛෙමා බහුස්සුතා ධම්මධරා ධම්මානුධම්මපටිපන්නා සාමීචිපටිපන්නා අනුධම්මචාරිනියො, සකං ආචරියකං උග්ගහෙත්වා ආචික්ඛන්ති දෙසෙන්ති පඤ්ඤාපෙන්ති පට්ඨපෙන්ති විවරන්ති විභජන්ති උත්තානීකරොන්ති, උප්පන්නං පරප්පවාදං සහධම්මෙන සුනිග්ගහිතං නිග්ගහෙත්වා සප්පාටිහාරියං ධම්මං දෙසෙන්ති. පරිනිබ්බාතු‘දානි භන්තෙ, භගවා, පරිනිබ්බාතු සුගතො, පරිනිබ්බානකාලො‘දානි, භන්තෙ, භගවතො. භාසිතා ඛො පනෙසා භන්තෙ, භගවතා වාචා න තාවාහං පාපිම, පරිනිබ්බායිස්සාමි: යාව මෙ ඉදං බ්රහ්මචරියං න ඉද්ධඤ්චෙව භවිස්සති ඵිතඤ්ච විත්ථාරිකං බාහුජඤ්ඤං පුථුභූතං යාව දෙවමනුස්සෙහි සුප්පකාසිතන්ති”. නන්විදං{1 තයිදං - මඡසං, ස්යා.} භන්තෙ භගවතො බ්රහ්මචරියං ඉද්ධඤ්චෙව ඵීතඤ්ච විත්ථාරිකං බාහුජඤ්ඤං පුථුභූතං යාව දෙවමනුස්සෙහි සුප්පකාසිතං. පරිනිබ්බාතු‘දානි භන්තෙ, භගවා, පරිනිබ්බාතු සුගතො. පරිනිබ්බානකාලො‘දානි භන්තෙ, භගවතොති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ භගවා මාරං පාපිමන්තං එතදවොච: “අප්පොස්සුක්කො ත්වං පාපිම හොහි. න චිරං තථාගතස්ස පරිනිබ්බානං භවිස්සති. ඉතො තිණ්ණං මාසානං අච්චයෙන තථාගතො පරිනිබ්බායිස්සතී”ති. අථ ඛො භගවා චාපාලෙ චෙතියෙ සතො සම්පජානො ආයුසඞ්ඛාරං ඔස්සජි.{2 ඔස්සජ්ජි - ස්යා.} ඔස්සට්ඨෙ ච භගවතා ආයුසඞ්ඛාරෙ මහාභූමිචාලො අහොසි භිංසනකො ලොමහංසො, දෙවදුන්දුභියො ච ඵලිංසු{3 වලිංසු - සීමු.} අථ ඛො භගවා එතමත්ථං විදිත්වා තායං වෙලායං ඉමං උදානං උදානෙසි:"
            },
            {
                "type": "gatha",
                "text": "“තුලමතුලඤ්ච සම්භවං භවසඞ්ඛාරමවස්සජි මුනි\nඅජ්ඣත්තරතො සමාහිතො අභිදා{4 අභින්දි - මඡසං, ස්යා.} කවචමිවත්තසම්භවන්ති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "චාපාලවග්ගො පඨමො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "අපාරො ච විරද්ධො චාරියො නිබ්බිදා පදෙසං,\nසමත්තො ච භික්ඛු ච අරහං ඤාණචෙතියාති.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "18"
            },
            {
                "type": "heading",
                "text": "2. පාසාදකම්පනවග්ගො",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "7. 2. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "හෙතුසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "3133. **සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "පුබ්බෙව මෙ භික්ඛවෙ, සම්බොධා අනභිසම්බුද්ධස්ස බොධිසත්තස්සෙව සතො එතදහොසි: “කො නු ඛො හෙතු කො පච්චයො ඉද්ධිපාදභාවනායා”ති? තස්ස මය්හං භික්ඛවෙ, එතදහොසි: “ඉධ භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, ඉති මෙ ඡන්දො න ච අතිලීනො භවිස්සති, න ච අතිපග්ගහිතො භවිස්සති, න ච අජ්ඣත්තං සඞ්ඛිත්තො භවිස්සති, න ච බහිද්ධා වික්ඛිත්තො භවිස්සති. පච්ඡා පුරෙ සඤ්ඤී ච විහරති,"
            },
            {
                "type": "gatha",
                "text": "යථා පුරෙ තථා පච්ඡා, යථා පච්ඡා තථා පුරෙ,\nයථා අධො තථා උද්ධං, යථා උද්ධං තථා අධො,\nයථා දිවා තථා රත්තිං, යථා රත්තිං තථා දිවා.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "ඉති විවටෙන චෙතසා අපරියොනද්ධෙන සප්පභාසං චිත්තං භාවෙති."
            },
            {
                "type": "paragraph",
                "text": "විරියසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉති මෙ විරියං න ච අතිලීනං භවිස්සති, න ච අතිපග්ගහිතං භවිස්සති, න ච අජ්ඣත්තං සංඛිත්තං භවිස්සති, න ච බහිද්ධා වික්ඛිත්තං භවිස්සති. පච්ඡා පුරෙ සඤ්ඤී ච විහරති."
            },
            {
                "type": "gatha",
                "text": "යථා පුරෙ තථා පච්ඡා, යථා පච්ඡා තථා පුරෙ,\nයථා අධො තථා උද්ධං, යථා උද්ධං තථා අධො,\nයථා දිවා තථා රත්තිං, යථා රත්තිං තථා දිවා.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "ඉති විවටෙන චෙතසා අපරියොනද්ධෙන සප්පභාසං චිත්තං භාවෙති."
            },
            {
                "type": "paragraph",
                "text": "චිත්තසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉති මෙ චිත්තං න ච අතිලීනං භවිස්සති. න ච අතිප්පග්ගහිතං භවිස්සති. න ච අජ්ඣත්තං සංඛිත්තං භවිස්සති. න ච බහිද්ධා වික්ඛිත්තං භවිස්සති. පච්ඡා පුරෙ සඤ්ඤී ච විහරති."
            },
            {
                "type": "gatha",
                "text": "යථා පුරෙ තථා පච්ඡා, යථා පච්ඡා තථා පුරෙ,\nයථා අධො තථා උද්ධං, යථා උද්ධං තථා අධො,\nයථා දිවා තථා රත්තිං, යථා රත්තිං තථා දිවා.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "ඉති විවටෙන චෙතසා අපරියොනද්ධෙන සප්පභාසං චිත්තං භාවෙති."
            },
            {
                "type": "paragraph",
                "text": "වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉති මෙ වීමංසා න ච අතිලීනා භවිස්සති. න ච අතිප්පග්ගහිතා භවිස්සති. න ච අජ්ඣත්තං සංඛිත්තා භවිස්සති. න ච බහිද්ධා වික්ඛිත්තා භවිස්සති. පච්ඡා පුරෙ සඤ්ඤී ච විහරති."
            },
            {
                "type": "gatha",
                "text": "යථා පුරෙ තථා පච්ඡා, යථා පච්ඡා තථා පුරෙ,\nයථා අධො තථා උද්ධං, යථා උද්ධං තථා අධො,\nයථා දිවා තථා රත්තිං, යථා රත්තිං තථා දිවා.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "ඉති විවටෙන චෙතසා අපරියොනද්ධෙන සප්පභාසං චිත්තං භාවෙති."
            },
            {
                "type": "page-break",
                "text": "20"
            },
            {
                "type": "paragraph",
                "text": "එවං භාවිතෙසු ඛො භික්ඛවෙ, භික්ඛු චතූසු ඉද්ධිපාදෙසු එවං බහුලීකතෙසු, අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති. එකොපි හුත්වා බහුධා හොති, බහුධාපි හුත්වා එකො හොති. ආවිභාවං තිරොභාවං තිරොකුඩ්ඩං තිරොපාකාරං තිරොපබ්බතං අසජ්ජමානො ගච්ඡති, සෙය්යථාපි ආකාසෙ. පඨවියාපි උම්මුජ්ජ නිම්මුජ්ජං කරොති සෙය්යථාපි උදකෙ. උදකෙපි අභිජ්ජමානෙ ගච්ඡති සෙය්යථාපි පඨවියං. ආකාසෙ‘පි පල්ලඞ්කෙන කමති සෙය්යථාපි පක්ඛිසකුණො. ඉමෙපි චන්දිමසුරියෙ එවං මහිද්ධිකෙ එවං මහානුභාවෙ පාණිනා පරාමසති පරිමජ්ජති යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙති. එවං භාවිතෙසු ඛො භික්ඛවෙ, භික්ඛු චතූසු ඉද්ධිපාදෙසු එවං බහුලීකතෙසු දිබ්බාය සොතධාතුයා විසුද්ධාය අතික්කන්තමානුසිකාය. උභො සද්දෙ සුණාති දිබ්බෙ ච මානුසෙ ච දූරෙ සන්තිකෙ චාති."
            },
            {
                "type": "paragraph",
                "text": "එවං භාවිතෙසු ඛො භික්ඛවෙ, භික්ඛු චතූසු ඉද්ධිපාදෙසු එවං බහුලීකතෙසු, පරසත්තානං පරපුග්ගලානං චෙතසා චෙතොපරිච්ච පජානාති. සරාගං වා චිත්තං සරාගං චිත්තන්ති පජානාති. වීතරාගං වා චිත්තං වීතරාගං චිත්තන්ති පජානාති. සදොසං වා චිත්තං සදොසං චිත්තන්ති පජානාති. වීතදොසං වා චිත්තං වීතදොසං චිත්තන්ති පජානාති. සමොහං වා චිත්තං සමොහං චිත්තන්ති පජානාති. වීතමොහං වා චිත්තං වීතමොහං චිත්තන්ති පජානාති. සඞ්ඛිත්තං වා චිත්තං සඞ්ඛිත්තං චිත්තන්ති පජානාති. වික්ඛිත්තං වා චිත්තං වික්ඛිත්තං චිත්තන්ති පජානාති. අමහග්ගතං වා චිත්තං අමහග්ගතං චිත්තන්ති පජානාති. මහග්ගතං වා චිත්තං මහග්ගතං චිත්තන්ති පජානාති. සඋත්තරං වා චිත්තං සඋත්තරං චිත්තන්ති පජානාති. අනුත්තරං වා චිත්තං අනුත්තරං චිත්තන්ති පජානාති. අසමාහිතං වා චිත්තං අසමාහිතං චිත්තන්ති පජානාති. සමාහිතං වා චිත්තං සමාහිතං චිත්තන්ති පජානාති. අවිමුත්තං වා චිත්තං අවිමුත්තං චිත්තන්ති පජානාති විමුත්තං වා චිත්තං විමුත්තං චිත්තන්ති පජානාති."
            },
            {
                "type": "paragraph",
                "text": "එවං භාවිතෙසු ඛො භික්ඛවෙ, භික්ඛු චතූසු ඉද්ධිපාදෙසු එවං බහුලීකතෙසු අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති. සෙය්යථිදං: “එකම්පි ජාතිං ද්වෙපි ජාතියො තිස්සොපි ජාතියො චතස්සොපි ජාතියො පඤ්චපි ජාතියො දසපි ජාතියො වීසම්පි{1 වීසතිම්පි - සීමු, සී 1, 2.} ජාතියො තිංසම්පි ජාතියො චත්තාරීසම්පි ජාතියො පඤ්ඤාසම්පි ජාතියො ජාතිසතම්පි ජාතිසහස්සම්පි ජාතිසතසහස්සම්පි අනෙකෙපි සංවට්ටකප්පෙ අනෙකෙපි විවට්ටකප්පෙ අනෙකෙපි සංවට්ටවිවට්ටකප්පෙ. අමුත්රාසිං: එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො, සො තතො චුතො අමුත්ර උදපාදිං. තත්රාපාසිං: එවංනාමො එවංගොත්තො එවංවණ්ණො එවමාහාරො එවංසුඛදුක්ඛපටිසංවෙදී එවමායුපරියන්තො. සො තතො චුතො ඉධූපපන්නො”ති. ඉති සාකාරං සඋද්දෙසං අනෙකවිහිතං පුබ්බෙනිවාසං අනුස්සරති."
            },
            {
                "type": "page-break",
                "text": "22"
            },
            {
                "type": "paragraph",
                "text": "එවං භාවිතෙසු ඛො භික්ඛවෙ, භික්ඛු චතූසු ඉද්ධිපාදෙසු එවං බහුලීකතෙසු, දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සති: “චවමානෙ උප්පජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ, සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාති: ඉමෙ වත භොන්තො සත්තා කායදුච්චරිතෙන සමන්නාගතා වචීදුච්චරිතෙන සමන්නාගතා මනොදුච්චරිතෙන සමන්නාගතා අරියානං උපවාදකා මිච්ඡාදිට්ඨිකා මිච්ඡාදිට්ඨිකම්මසමාදානා. තෙ කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපන්නා. ඉමෙ වා පන භොන්තො සත්තා කායසුචරිතෙන සමන්නාගතා වචීසුචරිතෙන සමන්නාගතා මනොසුචරිතෙන සමන්නාගතා අරියානං අනුපවාදකා සම්මාදිට්ඨිකා සම්මාදිට්ඨිකම්මසමාදානා. තෙ කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නා”ති. ඉති දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන සත්තෙ පස්සති: “චවමානෙ උප්පජ්ජමානෙ හීනෙ පණීතෙ සුවණ්ණෙ දුබ්බණ්ණෙ, සුගතෙ දුග්ගතෙ යථාකම්මූපගෙ සත්තෙ පජානාතී”ති."
            },
            {
                "type": "paragraph",
                "text": "එවං භාවිතෙසු ඛො භික්ඛවෙ, භික්ඛු චතූසු ඉද්ධිපාදෙසු එවං බහුලීකතෙසු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතීති."
            },
            {
                "type": "centered",
                "text": "7. 2. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මහප්ඵලසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3134. චත්තාරො‘මෙ භික්ඛවෙ, ඉද්ධිපාදා භාවිතා බහුලීකතා මහප්ඵලා හොන්ති මහානිසංසා. කථං භාවිතා ච ඛො භික්ඛවෙ, චත්තාරො ඉද්ධිපාදා කථං බහුලීකතා මහප්ඵලා හොන්ති මහානිසංසා: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති: “ඉති ඛො මෙ ඡන්දො න ච අතිලීනො භවිස්සති, න ච අතිප්පග්ගහිතො භවිස්සති, න ච අජ්ඣත්තං සඞ්ඛිත්තො භවිස්සති, න ච බහිද්ධා වික්ඛිත්තො භවිස්සති, පච්ඡා පුරෙ සඤ්ඤී ච විහරති:"
            },
            {
                "type": "gatha",
                "text": "යථා පුරෙ තථා පච්ඡා, යථා පච්ඡා තථා පුරෙ,\nයථා අධො තථා උද්ධං, යථා උද්ධං තථා අධො,\nයථා දිවා තථා රත්තිං, යථා රත්තිං තථා දිවා”.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "ඉති විවටෙන චෙතසා අපරියොනද්ධෙන සප්පභාසං චිත්තං භාවෙති."
            },
            {
                "type": "page-break",
                "text": "24"
            },
            {
                "type": "paragraph",
                "text": "විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉති ඛො මෙ වීමංසා න‘ච අතිලීනා භවිස්සති. න ච අතිප්පග්ගහිතා භවිස්සති, න ච අජ්ඣත්තං සංඞ්ඛිත්තා භවිස්සති, න ච බහිද්ධා වික්ඛිත්තා භවිස්සති, පච්ඡා පුරෙ සඤ්ඤී ච විහරති:"
            },
            {
                "type": "gatha",
                "text": "“යථා පුරෙ තථා පච්ඡා, යථා පච්ඡා තථා පුරෙ,\nයථා අධො තථා උද්ධං, යථා උද්ධං තථා අධො,\nයථා දිවා තථා රත්තිං, යථා රත්තිං තථා දිවා. ”",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "ඉති විවටෙන චෙතසා අපරියොනද්ධෙන සප්පභාසං චිත්තං භාවෙති. එවං භාවිතා ඛො භික්ඛවෙ, චත්තාරො ඉද්ධිපාදා එවං බහුලීකතා මහප්ඵලා හොන්ති මහානිසංසා."
            },
            {
                "type": "paragraph",
                "text": "එවං භාවිතෙසු ඛො භික්ඛවෙ, භික්ඛු චතූසු ඉද්ධිපාදෙසු එවං බහුලීකතෙසු අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති: “එකොපි හුත්වා බහුධා හොති -පෙ- යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙති” -පෙ- එවං භාවිතෙසු ඛො භික්ඛවෙ, භික්ඛු චතූසු ඉද්ධිපාදෙසු එවං බහුලීකතෙසු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතීති."
            },
            {
                "type": "centered",
                "text": "7. 2. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඡන්දසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3135. ඡන්දං චෙ භික්ඛවෙ, භික්ඛු නිස්සාය ලභති සමාධිං, ලභති චිත්තස්සෙකග්ගතං. අයං වුච්චති ඡන්දසමාධි. සො අනුප්පන්නානං පාපකානං අකුසලානං ධම්මානං අනුප්පාදාය ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. උප්පන්නානං පාපකානං අකුසලානං ධම්මානං පහානාය ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. අනුප්පන්නානං කුසලානං ධම්මානං උප්පාදාය ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. උප්පන්නානං කුසලානං ධම්මානං ඨිතියා අසම්මොසාය භිය්යොභාවාය වෙපුල්ලාය භාවනාය පාරිපූරියා ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. ඉමෙ වුච්චන්ති පධානසඞ්ඛාරා. ඉති අයඤ්ච ඡන්දො, අයඤ්ච ඡන්දසමාධි, ඉමෙ ච පධානසඞ්ඛාරා. අයං වුච්චති භික්ඛවෙ, ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතො ඉද්ධිපාදො."
            },
            {
                "type": "paragraph",
                "text": "විරියඤ්චෙ භික්ඛවෙ, භික්ඛු නිස්සාය ලභති සමාධිං, ලභති චිත්තස්සෙකග්ගතං. අයං වුච්චති විරියසමාධි. සො අනුප්පන්නානං පාපකානං අකුසලානං ධම්මානං අනුප්පාදාය -පෙ- උප්පන්නානං කුසලානං ධම්මානං ඨිතියා අසම්මොසාය භිය්යොභාවාය වෙපුල්ලාය භාවනාය පාරිපූරියා ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. ඉමෙ වුච්චන්ති පධානසඞ්ඛාරා. ඉති ඉදඤ්ච විරියං, අයඤ්ච විරියසමාධි, ඉමෙ ච පධානසඞ්ඛාරා. අයං වුච්චති භික්ඛවෙ, විරියසමාධිපධානසඞ්ඛාරසමන්නාගතො ඉද්ධිපාදො."
            },
            {
                "type": "page-break",
                "text": "26"
            },
            {
                "type": "paragraph",
                "text": "චිත්තඤ්චෙ භික්ඛවෙ, භික්ඛු නිස්සාය ලභති සමාධිං. ලභති චිත්තස්ස එකග්ගතං, අයං වුච්චති චිත්තසමාධි. සො අනුප්පන්නානං පාපකානං අකුසලානං ධම්මානං අනුප්පාදාය -පෙ-උප්පන්නානං කුසලානං ධම්මානං ඨිතියා අසම්මොසාය භිය්යොභාවාය වෙපුල්ලාය භාවනාය පාරිපූරියා ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. ඉමෙ වුච්චන්ති පධානසඞ්ඛාරා. ඉති ඉදඤ්ච චිත්තං, අයඤ්ච චිත්තසමාධි, ඉමෙ ච පධානසඞ්ඛාරා. අයං වුච්චති භික්ඛවෙ, චිත්තසමාධිපධානසඞ්ඛාරසමන්නාගතො ඉද්ධිපාදො."
            },
            {
                "type": "paragraph",
                "text": "වීමංසඤ්චෙ භික්ඛවෙ, භික්ඛු නිස්සාය ලභති සමාධිං, ලභති චිත්තස්ස එකග්ගතං, අයං වුච්චති වීමංසාසමාධි. සො අනුප්පන්නානං පාපකානං අකුසලානං ධම්මානං අනුප්පාදාය -පෙ-උප්පන්නානං කුසලානං ධම්මානං ඨිතියා අසම්මොසාය භිය්යොභාවාය වෙපුල්ලාය භාවනාය පාරිපූරියා ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. ඉමෙ වුච්චන්ති පධානසඞ්ඛාරා. ඉති අයඤ්ච වීමංසා අයඤ්ච වීමංසාසමාධි, ඉමෙ ච පධානසඞ්ඛාරා. අයං වුච්චති භික්ඛවෙ, වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතො ඉද්ධිපාදොති."
            },
            {
                "type": "centered",
                "text": "7. 2. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මොග්ගල්ලානසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3136. එකං සමයං භගවා සාවත්ථියං විහරති පුබ්බාරාමෙ මිගාරමාතුපාසාදෙ. තෙන ඛො පන සමයෙන සම්බහුලා භික්ඛූ හෙට්ඨාමිගාරමාතුපාසාදෙ විහරන්ති, උද්ධතා උන්නළා චපලා මුඛරා විකිණ්ණවාචා මුට්ඨස්සතිනො අසම්පජානා අසමාහිතා විබ්භන්තචිත්තා පාකතින්ද්රියා."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා ආයස්මන්තං මහාමොග්ගල්ලානං ආමන්තෙසි: “එතෙ තෙ{1 එතෙ ඛො - මඡසං, ස්යා.} මොග්ගල්ලාන, සබ්රහ්මචාරයො{2 සබ්රහ්මචාරිනො - මඡසං, ස්යා.} හෙට්ඨාමිගාරමාතුපාසාදෙ විහරන්ති උද්ධතා උන්නළා චපලා මුඛරා විකිණ්ණවාචා මුට්ඨස්සතිනො අසම්පජානා අසමාහිතා භන්තචිත්තා පාකතින්ද්රියා. ගච්ඡ මොග්ගල්ලාන, තෙ භික්ඛූ සංවෙජෙහීති{3 සංවදෙහීති - සී 1, 2.}. එවං භන්තෙති ඛො ආයස්මා මහාමොග්ගල්ලානො භගවතො පටිස්සුත්වා තථාරූපං ඉද්ධාභිසඞ්ඛාරං අභිසඞ්ඛාසි.{4 අභිසඞ්ඛාරෙසි - ස්යා.} යථා පාදඞ්ගුට්ඨකෙන මිගාරමාතුපාසාදං සඞ්කම්පෙසි සම්පකම්පෙසි. සම්පචාලෙසි. අථ ඛො තෙ භික්ඛූ සංවිග්ගා ලොමහට්ඨජාතා එකමන්තං අට්ඨංසු. අච්ඡරියං වත භො අබ්භුතං වත භො නිවාතඤ්ච වත අයඤ්ච මිගාරමාතුපාසාදො ගම්භීරනෙමො සුනිඛාතො අචලො අසම්පකම්පී, අථ ච පන සඞ්කම්පිතො සම්පකම්පිතො සම්පචාලිතොති."
            },
            {
                "type": "page-break",
                "text": "28"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා යෙන තෙ භික්ඛූ තෙනුපසඞ්කමි. උපසඞ්කමිත්වා තෙ භික්ඛූ එතදවොච: “කින්නු තුම්හෙ භික්ඛවෙ, සංවිග්ගා ලොමහට්ඨජාතා එකමන්තං ඨිතාති? අච්ඡරියං භන්තෙ, අබ්භුතං භන්තෙ, නිවාතඤ්ච වත, අයඤ්ච මිගාරමාතුපාසාදො ගම්භීරනෙමො සුනිඛාතො අචලො අසම්පකම්පි. අථ ච පන සඞ්කම්පිතො සම්පකම්පිතො සම්පචාලිතොති. තුම්හෙව ඛො භික්ඛවෙ, සංවෙජෙතුකාමෙන මොග්ගල්ලානෙන{1 මහාමොග්ගල්ලානෙන - සී 1, 2.} භික්ඛුනා පාදඞ්ගුට්ඨෙන{2 පාදඞ්ගුට්ඨකෙන - මඡසං, ස්යා.} මිගාරමාතුපාසාදො සඞ්කම්පිතො සම්පකම්පිතො සම්පචාලිතො. තං කිං මඤ්ඤථ භික්ඛවෙ, කතමෙසං ධම්මානං භාවිතත්තා බහුලීකතත්තා මොග්ගල්ලානො භික්ඛු එවං මහිද්ධිකො එවං මහානුභාවොති."
            },
            {
                "type": "paragraph",
                "text": "භගවම්මූලකා නො භන්තෙ, ධම්මා -පෙ- චතුන්නං ඛො භික්ඛවෙ, ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා මොග්ගල්ලානො භික්ඛු එවං මහිද්ධිකො එවං මහානුභාවො. කතමෙසං චතුන්නං: ඉධ භික්ඛවෙ, මොග්ගල්ලානො භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉති මෙ ඡන්දො න ච අතිලීනො භවිස්සති -පෙ- ඉති විවටෙන චෙතසා පරියොනද්ධෙන සප්පහාසං චිත්තං භාවෙති. විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉති මෙ වීමංසා න ච අතිලීනා භවිස්සති. න ච අතිප්පග්ගහිතා භවිස්සති. න ච අජ්ඣත්තං සංඛිත්තා භවිස්සති. න ච බහිද්ධා වික්ඛිත්තා භවිස්සති. පච්ඡා පුරෙ සඤ්ඤී ච විහරති:"
            },
            {
                "type": "gatha",
                "text": "යථා පුරෙ තථා පච්ඡා, යථාපච්ඡා තථා පුරෙ,\nයථා අධො තථා උද්ධං, යථාඋද්ධං තථා අධො,\nයථා දිවා තථා රත්තිං, යථා රත්තිං තථා දිවා.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "ඉති විවටෙන චෙතසා අපරියොනද්ධෙන සප්පභාසං චිත්තං භාවෙති."
            },
            {
                "type": "paragraph",
                "text": "ඉමෙසං ඛො භික්ඛවෙ, චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා මොග්ගල්ලානො භික්ඛු එවං මහිද්ධිකො එවං මහානුභාවො. ඉමෙසං ච පන භික්ඛවෙ, චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා මොග්ගල්ලානො භික්ඛු අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති -පෙ- කායෙන වසං වත්තෙති. ඉමෙසං ච පන භික්ඛවෙ, චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා මොග්ගල්ලානො භික්ඛු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතීති."
            },
            {
                "type": "page-break",
                "text": "30"
            },
            {
                "type": "centered",
                "text": "7. 2. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "බ්රාහ්මණසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3137. එකං සමයං ආයස්මා ආනන්දො කොසම්බියං විහරති ඝොසිතාරාමෙ. අථ ඛො උන්නාභො බ්රාහ්මණො යෙනායස්මා ආනන්දො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මතා ආනන්දෙන සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො උන්නාභො බ්රාහ්මණො ආයස්මන්තං ආනන්දං එතදවොච: කිමත්ථියං නු ඛො භො ආනන්ද, සමණෙ ගොතමෙ බ්රහ්මචරියං වුස්සතීති. ඡන්දප්පහානත්ථං ඛො බ්රාහ්මණ, භගවති බ්රහ්මචරියං වුස්සතීති. අත්ථි පන භො ආනන්ද, මග්ගො අත්ථි පටිපදා එතස්ස ඡන්දස්ස පහානායාති? අත්ථි ඛො බ්රාහ්මණ, මග්ගො අත්ථි පටිපදා එතස්ස ඡන්දස්ස පහානායාති. කතමො පන භො ආනන්ද, මග්ගො කතමා පටිපදා එතස්ස ඡන්දස්ස පහානායති? ඉධ බ්රාහ්මණ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානං සඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. අයං ඛො බ්රාහ්මණ, මග්ගො අයං පටිපදා එතස්ස ඡන්දස්ස පහානායාති."
            },
            {
                "type": "paragraph",
                "text": "එවං සන්තෙ භො ආනන්ද, සන්තකං හොති නො අසන්තකං. ඡන්දෙනෙව ඡන්දං පජහිස්සතීති නෙතං ඨානං විජ්ජතීති. තෙනහි බ්රාහ්මණ, තඤ්ඤෙවෙත්ථ පටිපුච්ඡිස්සාමි. යථා තෙ ඛමෙය්ය තථා තං ව්යාකරෙය්යාසි. තං කිං මඤ්ඤසි බ්රාහ්මණ, අහොසි තෙ පුබ්බෙ ඡන්දො ආරාමං ගමිස්සාමිති. තස්ස තෙ ආරාමගතස්ස යො තජ්ජො ඡන්දො සො පටිප්පස්සද්ධොති. එවං භො. අහොසි තෙ පුබ්බෙ විරියං ආරාමං ගමිස්සාමීති. තස්ස තෙ ආරාමගතස්ස යං තජ්ජං විරියං තං පටිප්පස්සද්ධන්ති. එවං භො. අහොසි තෙ පුබ්බෙ චිත්තං ආරාමං ගමිස්සාමීති. තස්ස තෙ ආරාමගතස්ස යං තජ්ජං චිත්තං තං පටිප්පස්සද්ධන්ති. එවං භො. අහොසි තෙ පුබ්බෙ වීමංසා ආරාමං ගමිස්සාමීති. තස්ස තෙ ආරාමගතස්ස යා තජ්ජා වීමංසා සා පටිප්පස්සද්ධාති. එවං භො."
            },
            {
                "type": "page-break",
                "text": "32"
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො බ්රාහ්මණ, යො සො භික්ඛු අරහං ඛීණාසවො වුසිතවා කතකරණීයො ඔහිතභාරො අනුප්පත්තසදත්ථො පරික්ඛීණ භවසංයොජනො සම්මදඤ්ඤාවිමුත්තො. තස්ස යො පුබ්බෙ ඡන්දො අහොසි අරහත්තප්පත්තියා අරහත්තෙ පත්තෙ{1 අරහත්තප්පත්තෙ - මඡසං.} යො තජ්ජො ඡන්දො සො පටිප්පස්සද්ධො. යං පුබ්බෙ විරියං අහොසි අරහත්තප්පත්තියා අරහත්තෙ පත්තෙ යං තජ්ජං විරියං තං පටිප්පස්සද්ධං. යං පුබ්බෙ චිත්තං අහොසි අරහත්තප්පත්තියා, අරහත්තෙ පත්තෙ යං තජ්ජං චිත්තං තං පටිප්පස්සද්ධං. යා පුබ්බෙ වීමංසා අහොසි අරහත්තප්පත්තියා, අරහත්තෙ පත්තෙ යා තජ්ජා වීමංසා සා පටිප්පස්සද්ධා. තං කිං මඤ්ඤසි බ්රාහ්මණ, ඉති එවං සන්තෙ සන්තකං වා හොති නො අසන්තකං වාති? අද්ධා භො ආනන්ද, එවං සන්තෙ සන්තකං හොති නො අසන්තකං. අභික්කන්තං භො ආනන්ද, -පෙ- අජ්ජතග්ගෙ පාණු පෙතං සරණං ගතන්ති."
            },
            {
                "type": "centered",
                "text": "7. 2. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මහිද්ධිකසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3138. යෙ හි කෙචි භික්ඛවෙ, අතීතමද්ධානං සමණා වා බ්රාහ්මණා වා මහිද්ධිකා අහෙසුං මහානුභාවා, සබ්බෙ තෙ චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා. යෙ හිපි කෙචි භික්ඛවෙ, අනාගතමද්ධානං සමණා වා බ්රාහ්මණා වා මහිද්ධිකා භවිස්සන්ති මහානුභාවා. සබ්බෙ තෙ චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා. යෙ හි කෙචි භික්ඛවෙ, එතරහි සමණා වා බ්රාහ්මණා වා මහිද්ධිකා මහානුභාවා. සබ්බෙ තෙ චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා. කතමෙසං චතුන්නං: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධි පධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. යෙ හි කෙචි භික්ඛවෙ, අතීතමද්ධානං සමණා වා බ්රාහ්මණා වා මහිද්ධිකා අහෙසුං මහානුභාවා -පෙ- මහිද්ධිකා භවිස්සන්ති මහානුභාවා -පෙ- එතරහි මහිද්ධිකා මහානුභාවා සබ්බෙ තෙ ඉමෙසං යෙව චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තාති."
            },
            {
                "type": "page-break",
                "text": "34"
            },
            {
                "type": "centered",
                "text": "7. 2. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඉද්ධිවිධසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3139. යෙ හි කෙචි භික්ඛවෙ, අතීතමද්ධානං සමණා වා බ්රාහ්මණා වා අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොසුං. එකොපි හුත්වා බහුධා අහෙසුං, බහුධාපි හුත්වා එකො අහෙසුං, ආවීභාවං තිරොභාවං තිරොකුඩ්ඩං තිරොපාකාරං තිරොපබ්බතං අසජ්ජමානා අගමංසු සෙය්යථාපි ආකාසෙ. පඨවියාපි උම්මුජ්ජනිමුජ්ජං අකංසු සෙය්යථාපි උදකෙ, උදකෙපි අභිජ්ජමානෙ අගමංසු සෙය්යථාපි පඨවියං, ආකාසෙපි පල්ලඞ්කෙන කමිංසු සෙය්යථාපි පක්ඛී සකුණො, ඉමෙපි චන්දිමසූරියෙ එවංමහිද්ධිකෙ එවංමහානුභාවෙ පාණිනා පරාමසිංසු{1 පරිමසිංසු - සී 1, 2, මඡසං.} පරිමජ්ජිංසු, යාව බ්රහ්මලොකාපි කායෙන වසෙ වත්තෙසුං, සබ්බෙ තෙ චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා."
            },
            {
                "type": "paragraph",
                "text": "යෙ හිපි කෙචි භික්ඛවෙ, අනාගතමද්ධානං සමණා වා බ්රාහ්මණා වා අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොස්සන්ති: “එකොපි හුත්වා බහුධා භවිස්සන්ති, බහුධාපි හුත්වා එකො භවිස්සන්ති, ආවිභාවං තිරොභාවං තිරොකුඩ්ඩං තිරොපාකාරං තිරොපබ්බතං අසජ්ජමානා ගමිස්සන්ති සෙය්යථාපි ආකාසෙ, පඨවියාපි උම්මුජ්ජනිමුජ්ජං කරිස්සන්ති සෙය්යථාපි උදකෙ, උදකෙපි අභිජ්ජමානෙ ගමිස්සන්ති සෙය්යථාපි පඨවියං, ආකාසෙපි පල්ලඞ්කෙන කමිස්සන්ති සෙය්යථාපි පක්ඛී සකුණො, ඉමෙපි චන්දිමසුරියෙ එවංමහිද්ධිකෙ එවංමහානුභාවෙ පාණිනා පරාමසිස්සන්ති පරිමජ්ජිස්සන්ති, යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙස්සන්ති{2 වත්තිස්සන්ති - මඡසං.} සබ්බෙ තෙ චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා."
            },
            {
                "type": "paragraph",
                "text": "යෙ හි කෙචි භික්ඛවෙ, එතරහි සමණා වා බ්රාහ්මණා වා අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොන්ති: එකොපි හුත්වා බහුධා හොන්ති, බහුධාපි හුත්වා එකො හොන්ති, ආවීභාවං තිරොභාවං තිරොකුඩ්ඩං තිරොපාකාරං තිරොපබ්බතං අසජ්ජමානා ගච්ඡන්ති සෙය්යථාපි ආකාසෙ, පඨවියාපි උම්මුජ්ජනිමුජ්ජං කරොන්ති සෙය්යථාපි උදකෙ, උදකෙපි අභිජ්ජමානෙ ගච්ඡන්ති සෙය්යථාපි පඨවියං, ආකාසෙපි පල්ලඞ්කෙන කමන්ති සෙය්යථාපි පක්ඛී සකුණො, ඉමෙපි චන්දිමසූරියෙ එවංමහිද්ධිකෙ එවංමහානුභාවෙ පාණිනා පරාමසන්ති පරිමජ්ජන්ති, යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙන්ති, සබ්බෙ තෙ චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා."
            },
            {
                "type": "paragraph",
                "text": "කතමෙසං චතුන්නං: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. යෙ හි කෙචි භික්ඛවෙ, අතීතමද්ධානං සමණා වා බ්රාහ්මණා වා අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොසුං -පෙ- පච්චනුහොස්සන්ති -පෙ- පච්චනුහොන්ති -පෙ- සබ්බෙ තෙ ඉමෙසඤ්ඤෙව චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තාති."
            },
            {
                "type": "page-break",
                "text": "36"
            },
            {
                "type": "centered",
                "text": "7. 2. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "භික්ඛුසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3140. චතුන්නං භික්ඛවෙ, ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා භික්ඛු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති. කතමෙසං චතුන්නං: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, විරියසමාධි -පෙ- චිත්තසමාධි -පෙ-වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉමෙසං ඛො භික්ඛවෙ, චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා භික්ඛු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතීති."
            },
            {
                "type": "centered",
                "text": "7. 2. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "භාවනාසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3141. ඉද්ධිඤ්ච{1 ඉද්ධිං - මඡසං.} වො භික්ඛවෙ, දෙසෙස්සාමි ඉද්ධිපාදඤ්ච ඉද්ධිපාදභාවනඤ්ච ඉද්ධිපාදභාවනාගාමිනිඤ්ච පටිපදං. තං සුණාථ. කතමා ච භික්ඛවෙ, ඉද්ධි: ඉධ භික්ඛවෙ, භික්ඛු අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති: එකොපි හුත්වා බහුධා හොති -පෙ- යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙති. අයං වුච්චති භික්ඛවෙ, ඉද්ධි. කතමො ච භික්ඛවෙ, ඉද්ධිපාදො: යො භික්ඛවෙ, මග්ගො යා පටිපදා ඉද්ධිපටිලාභාය{2 ඉද්ධිලාභාය ඉද්ධිපටිලාභාභාය - මඡසං, ස්යා.} සංවත්තති. අයං වුච්චති භික්ඛවෙ, ඉද්ධිපාදො. කතමා ච භික්ඛවෙ, ඉද්ධිපාදභාවනා: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති අයං වුච්චති භික්ඛවෙ, ඉද්ධිපාදභාවනා. කතමා ච භික්ඛවෙ, ඉද්ධිපාදභාවනාගාමිනී පටිපදා: අයමෙව අරියො අට්ඨඞ්ගිකො මග්ගො. සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. අයං වුච්චති භික්ඛවෙ, ඉද්ධිපාදභාවනාගාමිනී පටිපදාති."
            },
            {
                "type": "page-break",
                "text": "38"
            },
            {
                "type": "centered",
                "text": "7. 2. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "විභඞ්ගසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3142. චත්තාරො මෙ භික්ඛවෙ, ඉද්ධිපාදා භාවිතා බහුලීකතා මහප්ඵලා හොන්ති මහානිසංසා. කථං භාවිතා ච භික්ඛවෙ, චත්තාරො ඉද්ධිපාදා කථං බහුලීකතා මහප්ඵලා හොන්ති මහානිසංසා: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති; ඉති මෙ ඡන්දො න ච අතිලීනො භවිස්සති, න ච අතිපග්ගහිතො භවිස්සති, න ච අජ්ඣත්තං සංඛිත්තො භවිස්සති, න ච බහිද්ධා වික්ඛිත්තො භවිස්සති පච්ඡා පුරෙ සඤ්ඤී ච විහරති -පෙ- ඉති විවටෙන චෙතසා අපරියොනද්ධෙන සප්පභාසං චිත්තං භාවෙති. විරියසමාධි -පෙ- චිත්තසමාධි -පෙ-වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති: “ඉති මෙ වීමංසා න ච අතිලීනා භවිස්සති, න ච අතිපග්ගහිතා භවිස්සති, න ච අජ්ඣත්තං සංඛිත්තා භවිස්සති, න ච බහිද්ධා වික්ඛිත්තා භවිස්සති. පච්ඡා පුරෙ සඤ්ඤී ච විහරති:"
            },
            {
                "type": "gatha",
                "text": "“යථා පුරෙ තථා පච්ඡා යථා පච්ඡා තථා පුරෙ,\nයථා අධො තථා උද්ධං යථා උද්ධං තථා අධො,\nයථා දිවා තථා රත්තිං යථා රත්තිං තථා දිවා.”",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "ඉති විවටෙන චෙතසා අපරියොනද්ධෙන සප්පභාසං චිත්තං භාවෙති."
            },
            {
                "type": "paragraph",
                "text": "කතමො ච භික්ඛවෙ, අතිලීනො ඡන්දො: යො භික්ඛවෙ, ඡන්දො කොසජ්ජසහගතො කොසජ්ජසම්පයුත්තො, අයං වුච්චති භික්ඛවෙ, අතිලීනො ඡන්දො. කතමො ච භික්ඛවෙ, අතිපග්ගහිතො ඡන්දො: යො හි භික්ඛවෙ, ඡන්දො උද්ධච්චසහගතො උද්ධච්චසම්පයුත්තො, අයං වුච්චති භික්ඛවෙ, අතිපග්ගහිතො ඡන්දො. කතමො ච භික්ඛවෙ, අජ්ඣත්තං සඞ්ඛිත්තො ඡන්දො: යො හි භික්ඛවෙ, ඡන්දො ථිනමිද්ධසහගතො ථිනමිද්ධසම්පයුත්තො. අයං වුච්චති භික්ඛවෙ, අජ්ඣත්තං සඞ්ඛිත්තො ඡන්දො. කතමො ච භික්ඛවෙ, බහිද්ධා වික්ඛිත්තො ඡන්දො: යො හි භික්ඛවෙ, ඡන්දො බහිද්ධා පඤ්ච කාමගුණෙ ආරබ්භ අනුවික්ඛිත්තො අනුවිසටො. අයං වුච්චති භික්ඛවෙ, බහිද්ධා වික්ඛිත්තො ඡන්දො."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ, භික්ඛු පච්ඡාපුරෙ සඤ්ඤී ච විහරති: “යථා පුරෙ තථා පච්ඡා යථා පච්ඡා තථා පුරෙ: ඉධ භික්ඛවෙ, භික්ඛුනො පච්ඡා පුරෙ සඤ්ඤා සුග්ගහිතා හොති සුමනසිකතා සූපධාරිතා සුප්පටිවිද්ධා පඤ්ඤාය. එවං ඛො භික්ඛවෙ, භික්ඛු පච්ඡා පුරෙ සඤ්ඤී විහරති: “යථා පුරෙ තථා පච්ඡා යථා පච්ඡා තථා පුරෙ. ”"
            },
            {
                "type": "page-break",
                "text": "40"
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ, භික්ඛු යථා අධො තථා උද්ධං, යථා උද්ධං තථා අධො විහරති: ඉධ භික්ඛවෙ, භික්ඛු ඉමමෙව කායං උද්ධං පාදතලා අධො කෙසමත්ථකා තචපරියන්තං පූරං නානප්පකාරස්ස අසුචිනො පච්චවෙක්ඛති: “අත්ථි ඉමස්මිං කායෙ කෙසා ලොමා නඛා දන්තා තචො මංසං නහාරු අට්ඨි අට්ඨිමිඤ්ඣා{1 අට්ඨිමිඤ්ජං - මඡසං, ස්යා.} වක්කං හදයං යකනං කිලොමකං පිහකං පප්ඵාසං අන්තං අන්තගුණං උදරියං කරීසං පිත්තං සෙම්හං පුබ්බො ලොහිතං සෙදො මෙදො අස්සු වසා ඛෙළො සිඞ්ඝාණිකා ලසිකා මුත්තන්ති. එවං ඛො භික්ඛවෙ, භික්ඛු යථා අධො තථා උද්ධං, යථා උද්ධං තථා අධො විහරති."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ, භික්ඛු “යථා දිවා තථා රත්තිං, යථා රත්තිං තථා දිවා විහරති: ඉධ භික්ඛවෙ, භික්ඛු යෙහි ආකාරෙහි යෙහි ලිඞ්ගෙහි යෙහි නිමිත්තෙහි දිවා ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. සො තෙහි ආකාරෙහි තෙහි ලිඞ්ගෙහි තෙහි නිමිත්තෙහි රත්තිං ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. යෙහි වා පන ආකාරෙහි යෙහි ලිඞ්ගෙහි යෙහි නිමිත්තෙහි රත්තිං ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. සො තෙහි ආකාරෙහි තෙහි ලිඞ්ගෙහි තෙහි නිමිත්තෙහි දිවා ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. එවං ඛො භික්ඛවෙ, භික්ඛු යථා දිවා තථා රත්තිං, යථා රත්තිං තථා දිවා විහරති."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ, භික්ඛු විවටෙන චෙතසා අපරියොනද්ධෙන සප්පභාසං චිත්තං භාවෙති: ඉධ භික්ඛවෙ, භික්ඛුනො ආලොකසඤ්ඤා සුග්ගහිතා හොති දිවාසඤ්ඤා ස්වාධිට්ඨිතා. එවං ඛො භික්ඛවෙ, භික්ඛු විවටෙන චෙතසා අපරියොනද්ධෙන සප්පභාසං චිත්තං භාවෙති."
            },
            {
                "type": "paragraph",
                "text": "කතමඤ්ච භික්ඛවෙ, අතිලීනං විරියං: යං භික්ඛවෙ, විරියං කොසජ්ජසහගතං කොසජ්ජසම්පයුත්තං, ඉදං වුච්චති භික්ඛවෙ, අතිලීනං විරියං. කතමඤ්ච භික්ඛවෙ, අතිපග්ගහිතං විරියං: යං භික්ඛවෙ, විරියං උද්ධච්චසහගතං උද්ධච්චසම්පයුත්තං, ඉදං වුච්චති භික්ඛවෙ, අතිපග්ගහිතං විරියං. කතමඤ්ච භික්ඛවෙ, අජ්ඣත්තං සඞ්ඛිත්තං විරියං: යං භික්ඛවෙ, විරියං ථිනමිද්ධසහගතං ථිනමිද්ධසම්පයුත්තං. ඉදං වුච්චති භික්ඛවෙ, අජ්ඣත්තං සඞ්ඛිත්තං විරියං. කතමඤ්ච භික්ඛවෙ, බහිද්ධා වික්ඛිත්තං විරියං: යං භික්ඛවෙ, විරියං බහිද්ධා පඤ්චකාමගුණෙ ආරබ්භ අනුවික්ඛිත්තං අනුවිසටං. ඉදං වුච්චති භික්ඛවෙ, බහිද්ධා වික්ඛිත්තං විරියං -පෙ- සප්පහාසං චිත්තං භාවෙති."
            },
            {
                "type": "page-break",
                "text": "42"
            },
            {
                "type": "paragraph",
                "text": "කතමඤ්ච භික්ඛවෙ, අතිලීනං චිත්තං: යං භික්ඛවෙ, චිත්තං කොසජ්ජසහගතං කොසජ්ජසම්පයුත්තං, ඉදං වුච්චති භික්ඛවෙ, අතිලීනං චිත්තං. කතමඤ්ච භික්ඛවෙ, අතිපග්ගහිතං චිත්තං: යං භික්ඛවෙ, චිත්තං උද්ධච්චසහගතං උද්ධච්චසම්පයුත්තං. ඉදං වුච්චති භික්ඛවෙ, අතිපග්ගහිතං චිත්තං. කතමඤ්ච භික්ඛවෙ, අජ්ඣත්තං සඞ්ඛිත්තං චිත්තං: යං භික්ඛවෙ, චිත්තං ථීනමිද්ධසහගතං ථීනමිද්ධසම්පයුත්තං, ඉදං වුච්චති භික්ඛවෙ, අජ්ඣත්තං සඞ්ඛිත්තං චිත්තං. කතමඤ්ච භික්ඛවෙ, බහිද්ධා වික්ඛිත්තං චිත්තං: යං භික්ඛවෙ, චිත්තං බහිද්ධා පඤ්චකාමගුණෙ ආරබ්භ අනුවික්ඛිත්තං අනුවිසටං. ඉදං වුච්චති භික්ඛවෙ, බහිද්ධා වික්ඛිත්තං චිත්තං -පෙ- සප්පභාසං චිත්තං භාවෙති."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ, අතිලීනා වීමංසා: යා භික්ඛවෙ, වීමංසා කොසජ්ජසහගතා කොසජ්ජසම්පයුත්තා. අයං වුච්චති භික්ඛවෙ, අතිලීනා වීමංසා. කතමා ච භික්ඛවෙ, අතිපග්ගහිතා වීමංසා: යා භික්ඛවෙ, වීමංසා උද්ධච්චසහගතා උද්ධච්චසම්පයුත්තා. අයං වුච්චති භික්ඛවෙ, අතිපග්ගහිතා වීමංසා. කතමා ච භික්ඛවෙ, අජ්ඣත්තං සඞ්ඛිත්තා වීමංසා: යා භික්ඛවෙ, වීමංසා ථීනමිද්ධසහගතා ථීනමිද්ධසම්පයුත්තා, අයං වුච්චති භික්ඛවෙ, අජ්ඣත්තං සඞ්ඛිත්තා වීමංසා. කතමා ච භික්ඛවෙ, බහිද්ධා වික්ඛිත්තා වීමංසා: යා භික්ඛවෙ, වීමංසා බහිද්ධා පඤ්චකාමගුණෙ ආරබ්භ අනුවික්ඛිත්තා අනුවිසටා. අයං වුච්චති භික්ඛවෙ, බහිද්ධා වික්ඛිත්තා වීමංසා."
            },
            {
                "type": "paragraph",
                "text": "කතඤ්ච භික්ඛවෙ, භික්ඛු පච්ඡාපුරෙසඤ්ඤී විහරති “යථා පුරෙ තථා පච්ඡා යථා පච්ඡා තථා පුරෙ:” ඉධ භික්ඛවෙ, භික්ඛුනො පච්ඡාපුරෙ සඤ්ඤා සුග්ගහිතා හොති සුමනසිකතා සූපධාරිතා සුප්පටිවිද්ධා පඤ්ඤාය. එවං ඛො භික්ඛවෙ, භික්ඛු පච්ඡාපුරෙසඤ්ඤී විහරති. “යථා පුරෙ තථා පච්ඡා යථා පච්ඡා තථා පුරෙ.”"
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ, භික්ඛු යථා අධො තථා උද්ධං යථා උද්ධං තථා අධො විහරති: ඉධ භික්ඛවෙ, භික්ඛු ඉමමෙව කායං උද්ධං පාදතලා අධො කෙසමත්ථකා තචපරියන්තං පූරං නානප්පකාරස්ස අසුචිනො පච්චවෙක්ඛති: “අත්ථි ඉමස්මිං කායෙ කෙසා ලොමා -පෙ- ලසිකා මුත්තන්ති.” එවං ඛො භික්ඛවෙ, භික්ඛු යථා අධො තථා අද්ධං යථා අද්ධං තථා අධො විහරතීති."
            },
            {
                "type": "page-break",
                "text": "44"
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ, භික්ඛු යථා දිවා තථා රත්තිං යථා රත්තිං තථා දිවා විහරති: ඉධ භික්ඛවෙ, භික්ඛු යෙහි ආකාරෙහි යෙහි ලිඞ්ගෙහි යෙහි නිමිත්තෙහි දිවා වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. සො තෙහි ආකාරෙහි තෙහි ලිඞ්ගෙහි තෙහි නිමිත්තෙහි රත්තිං වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. යෙහි වා පන ආකාරෙහි යෙහි ලිඞ්ගෙහි යෙහි නිමිත්තෙහි රත්තිං වීමංසා සමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. සො තෙහි ආකාරෙහි තෙහි ලිඞ්ගෙහි තෙහි නිමිත්තෙහි වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. එවං ඛො භික්ඛවෙ, භික්ඛු යථා දිවා තථා රත්තිං තථා දිවා විහරති."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ, භික්ඛු විවටෙන චෙතසා අපරියොනද්ධෙන සප්පභාසං චිත්තං භාවෙති: ඉධ භික්ඛවෙ, භික්ඛුනො ආලොකසඤ්ඤා සුග්ගහිතා හොති දිවාසඤ්ඤා ස්වාධිට්ඨිතා. එවං ඛො භික්ඛවෙ, භික්ඛු විවටෙන චෙතසා අපරියොනද්ධෙන සප්පභාසං චිත්තං භාවෙති."
            },
            {
                "type": "paragraph",
                "text": "එවං භාවිතා ඛො භික්ඛවෙ, චත්තාරො ඉද්ධිපාදා එවං බහුලීකතා මහප්ඵලා හොන්ති මහානිසංසා. එවං භාවිතෙසු ඛො භික්ඛවෙ, භික්ඛු චතූසු ඉද්ධිපාදෙසු එවං බහුලීකතෙසු අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති. “එකොපි හුත්වා බහුධා හොති -පෙ- යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙති.” එවං භාවිතෙසු ඛො භික්ඛවෙ, භික්ඛු චතූසු ඉද්ධිපාදෙසු එවං බහුලීකතෙසු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතීති."
            },
            {
                "type": "centered",
                "text": "පාසාදකම්පනවග්ගො දුතියො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං**:"
            },
            {
                "type": "gatha",
                "text": "හෙතුමහප්ඵලො ඡන්දො මොග්ගල්ලානො ච බ්රාහ්මණො,\nමහිද්ධිවිධා භික්ඛු භාවනා විභඞ්ගෙහි චාති.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "46"
            },
            {
                "type": "heading",
                "text": "3. අයොගුළවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "7. 3. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මග්ගසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "3143. **සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "පුබ්බෙව මෙ භික්ඛවෙ, සම්බොධා අනභිසම්බුද්ධස්ස බොධිසත්තස්සෙව සතො එතදහොසි. “කො නු ඛො මග්ගො කා පටිපදා ඉද්ධිපාදභාවනායාති: තස්ස මය්හං භික්ඛවෙ, එතදහොසි: “ඉධ භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉති මෙ ඡන්දො න ච අතිලීනො භවිස්සති -පෙ- සප්පභාසං චිත්තං භාවෙති. විරියසමාධි -පෙ-චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉති මෙ වීමංසා න ච අතිලීනා භවිස්සති. න ච අතිප්පග්ගහිතා භවිස්සති. න ච අජ්ඣත්තං සඞ්ඛිත්තා භවිස්සති. න ච බහිද්ධා වික්ඛිත්තා භවිස්සති. පච්ඡාපුරෙසඤ්ඤී ච විහරති:"
            },
            {
                "type": "gatha",
                "text": "“යථා පුරෙ තථා පච්ඡා යථා පච්ඡා තථා පුරෙ,\nයථා අධො තථා උද්ධං යථා උද්ධං තථා අධො,\nයථා දිවා තථා රත්තිං යථා රත්තිං තථා දිවා.”",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "ඉති විවටෙන චෙතසා අපරියොනද්ධෙන සප්පභාසං චිත්තං භාවෙති."
            },
            {
                "type": "paragraph",
                "text": "එවං භාවිතෙසු ඛො භික්ඛවෙ, භික්ඛු චතූසු ඉද්ධිපාදෙසු එවං බහුලීකතෙසු අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති: එකොපි හුත්වා බහුධා හොති -පෙ- යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙති. එවං භාවිතෙසු ඛො භික්ඛවෙ, භික්ඛු චතූසු ඉද්ධිපාදෙසු එවං බහුලීකතෙසු, ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතීති."
            },
            {
                "type": "paragraph",
                "text": "(ජළභිඤ්ඤා විත්ථාරෙතබ්බා.)"
            },
            {
                "type": "centered",
                "text": "7. 3. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අයොගුළසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3144. අථ ඛො ආයස්මා ආනන්දො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා ආනන්දො භගවන්තං එතදවොච: “අභිජානාති නු ඛො භන්තෙ, භගවා ඉද්ධියා මනොමයෙන කායෙන බ්රහ්මලොකං උපසඞ්කමිතා”ති. අභිජානාමි ඛ්වාහං ආනන්ද ඉද්ධියා මනොමයෙන කායෙන බ්රහ්මලොකං උපසඞ්කමිතාති. අභිජානාති ඛො පන භන්තෙ, භගවා ඉමිනා චාතුම්මහාභූතිකෙන කායෙන ඉද්ධියා බ්රහ්මලොකං උපසඞ්කමිතාති. අභිජානාමි ඛ්වාහං ආනන්ද, ඉමිනා චාතුම්මහාභූතිකෙන{1 චාතුම්හාභූතිකෙන - මඡසං.} කායෙන ඉද්ධියා බ්රහ්මලොකං උපසඞ්කමිතාති.{2 උපසඞ්කමිතන්ති - සී 1, 2.} ඔපාතිහ{3 යඤ්ච ඛො ඔමාති - මඡසං, ස්යා. ඔපපාති - සී 2.} භන්තෙ, භගවා ඉද්ධියා මනොමයෙන කායෙන බ්රහ්මලොකං උපසඞ්කමිතුං. සමඤ්ඤො{4 අභිජානාති - මඡසං, ස්යා.} ඛො භන්තෙ, භගවා ඉමිනා චාතුම්මහාභූතිකෙන කායෙන ඉද්ධියා බ්රහ්මලොකං උපසඞ්කමිති.{5 උපසඞ්කමිතා - මඡසං, ස්යා.} තයිදං භන්තෙ, භගවතො අච්ඡරියං චෙව අබ්භුතං චාති."
            },
            {
                "type": "page-break",
                "text": "48"
            },
            {
                "type": "paragraph",
                "text": "අච්ඡරියා චෙව ආනන්ද, තථාගතා, අච්ඡරියධම්මසමන්නාගතා ච, අබ්භුතා චෙව ආනන්ද, තථාගතා, අබ්භුතධම්මසමන්නාගතා ච. යස්මිං ආනන්ද, සමයෙ තථාගතො කායම්පි චිත්තෙ සමාදහති{1 සමොදහති - මඡසං.} චිත්තම්පි ච කායෙ සමාදහති{2 සමොදහති - මඡසං.} සුඛසඤ්ඤඤ්ච ලහුසඤ්ඤඤ්ච කායෙ{3 කායෙන - සී 1, 2.} ඔක්කමිත්වා විහරති. තස්මිං ආනන්ද, සමයෙ තථාගතස්ස කායො ලහුතරො චෙව හොති මුදුතරො ච කම්මනියතරො ච පභස්සරතරො ච. සෙය්යථාපි ආනන්ද, අයොගුළො දිවසසන්තත්තො{4 දිවසං සන්නත්තො - මඡසං, ස්යා.} ලහුතරො චෙව හොති මුදුතරො ච කම්මනියතරො ච පභස්සරතරො ච. එවමෙව ඛො ආනන්ද, යස්මිං සමයෙ තථාගතො කායම්පි චිත්තෙ සමාදහති, චිත්තම්පි කායෙ සමාදහති. සුඛසඤ්ඤඤ්ච ලහුසඤ්ඤඤ්ච කායෙ{5 කායෙන - සී 1, 2.} ඔක්කමිත්වා විහරති, තස්මිං සමයෙ ආනන්ද, තථාගතස්ස කායො ලහුතරො චෙව හොති මුදුතරො ච කම්මනියතරො ච පභස්සරතරො ච."
            },
            {
                "type": "paragraph",
                "text": "යස්මිං ආනන්ද, සමයෙ තථාගතො කායම්පි චිත්තෙ සමාදහති, චිත්තම්පි කායෙ සමාදහති, සුඛසඤ්ඤඤ්ච ලහුසඤ්ඤඤ්ච කායෙ ඔක්කමිත්වා විහරති. තස්මිං ආනන්ද, සමයෙ තථාගතස්ස කායො අප්පකසිරෙනෙව පුථුවියා වෙහාසං අබ්භුග්ගච්ඡති. සො අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති: “එකොපි හුත්වා බහුධා හොති -පෙ- යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙති. සෙය්යථාපි ආනන්ද, තූලපිචු වා කප්පාසපිචු වා ලහුකො වාතූපාදානො අප්පකසිරෙනෙව පුථුවියා වෙහාසං අබ්භුග්ගච්ඡති. එවමෙව ඛො ආනන්ද, යස්මිං සමයෙ තථාගතො කායම්පි චිත්තෙ සමාදහති, චිත්තම්පි කායෙ සමාදහති, සුඛසඤ්ඤඤ්ච ලහුසඤ්ඤඤ්ච කායෙ ඔක්කමිත්වා විහරති. තස්මිං ආනන්ද, සමයෙ තථාගතස්ස කායො අප්පකසිරෙනෙව පුථුවියා වෙහාසං අබ්භුග්ගච්ඡති. සො අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති: එකොපි හුත්වා බහුධා හොති -පෙ- යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙතීති."
            },
            {
                "type": "centered",
                "text": "7. 3. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "භික්ඛුසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3145. චත්තාරො මෙ භික්ඛවෙ, ඉද්ධිපාදා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, ඉමෙ ඛො භික්ඛවෙ, චත්තාරො ඉද්ධිපාදා. ඉමෙසං ඛො භික්ඛවෙ, චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා භික්ඛු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතීති."
            },
            {
                "type": "page-break",
                "text": "50"
            },
            {
                "type": "centered",
                "text": "7. 3. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුද්ධකසුත්තං{1 න දිස්සතෙදං සුත්තං ස්යාමපොත්ථෙක.}",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3146. චත්තාරො‘මෙ භික්ඛවෙ, ඉද්ධිපාදා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, විරියසමාධි -පෙ- චිත්තසමාධි -පෙ-වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉමෙ ඛො භික්ඛවෙ, චත්තාරො ඉද්ධිපාදාති."
            },
            {
                "type": "centered",
                "text": "7. 3. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඵලසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3147. චත්තාරො‘මෙ භික්ඛවෙ, ඉද්ධිපාදා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, විරියසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, චිත්තසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, ඉමෙ ඛො භික්ඛවෙ, චත්තාරො ඉද්ධිපාදා. ඉමෙසං ඛො භික්ඛවෙ, චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා ද්වින්නං ඵලානං අඤ්ඤතරං ඵලං පාටිකඞ්ඛං: “දිට්ඨෙව ධම්මෙ අඤ්ඤා, සති වා උපාදිසෙසෙ අනාගාමිතා”ති."
            },
            {
                "type": "centered",
                "text": "7. 3. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතියඵලසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3148. චත්තාරො‘මෙ භික්ඛවෙ, ඉද්ධිපාදා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, විරියසමාධි -පෙ- චිත්තසමාධි -පෙ-වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉමෙ ඛො භික්ඛවෙ, චත්තාරො ඉද්ධිපාදා."
            },
            {
                "type": "paragraph",
                "text": "ඉමෙසං ඛො භික්ඛවෙ, චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා සත්තඵලා සත්තානිසංසා පාටිකඞ්ඛා. කතමෙ සත්තඵලා සත්තානිසංසා: දිට්ඨෙව ධම්මෙ පටිගච්ච අඤ්ඤං ආරාධෙති. නො චෙ දිට්ඨෙව ධම්මෙ පටිගච්ච අඤ්ඤං ආරාධෙති, අථ මරණකාලෙ අඤ්ඤං ආරාධෙති, නො චෙ දිට්ඨෙව ධම්මෙ පටිගච්ච අඤ්ඤං ආරාධෙති, නො චෙ මරණකාලෙ අඤ්ඤං ආරාධෙති, අථ පඤ්චන්නං ඔරම්භාගියානං සංයොජනානං පරික්ඛයා අන්තරාපරිනිබ්බායී හොති, උපහච්ච පරිනිබ්බායී හොති, අසඞ්ඛාරපරිනිබ්බායී හොති, සසඞ්ඛාරපරිනිබ්බායී හොති, උද්ධංසොතො හොති අකනිට්ඨගාමී. ඉමෙසං ඛො භික්ඛවෙ, චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා ඉමෙසත්ත ඵලා සත්තානිසංසා පාටිකඞ්ඛාති."
            },
            {
                "type": "page-break",
                "text": "52"
            },
            {
                "type": "centered",
                "text": "7. 3. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආනන්දසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3149. අථ ඛො ආයස්මා ආනන්දො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා -පෙ- එකමන්තං නිසින්නො ඛො ආයස්මා ආනන්දො භගවන්තං එතදවොච: “කතමා නු ඛො භන්තෙ, ඉද්ධි, කතමො ඉද්ධිපාදො, කතමා ඉද්ධිපාදභාවනා, කතමා ඉද්ධිපාදභාවනාගාමිනී පටිපදා”ති."
            },
            {
                "type": "paragraph",
                "text": "ඉධානන්ද, භික්ඛු අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති: එකොපි හුත්වා බහුධා හොති -පෙ- යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙති”. අයං වුච්චතානන්ද, ඉද්ධි. කතමො චානන්ද, ඉද්ධිපාදො: යො ආනන්ද, මග්ගො යා පටිපදා ඉද්ධිලාභාය ඉද්ධිපටිලාභාය සංවත්තති. අයං වුච්චතානන්ද, ඉද්ධිපාදො. කතමාචානන්ද, ඉද්ධිපාදභාවනා: ඉධානන්ද, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. අයං වුච්චතානන්ද, ඉද්ධිපාදභාවනා. කතමාචානන්ද, ඉද්ධිපාදභාවනාගාමිනී පටිපදා: අයමෙව අරියො අට්ඨඞ්ගිකො මග්ගො, සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. අයං වුච්චතානන්ද, ඉද්ධිපාදභාවනාගාමිනී පටිපදාති."
            },
            {
                "type": "centered",
                "text": "7. 3. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතියආනන්දසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3150. එකමන්තං නිසින්නං ඛො ආයස්මන්තං ආනන්දං භගවා එතදවොච: “කතමා නු ඛො ආනන්ද, ඉද්ධි, කතමො ඉද්ධිපාදො, කතමා ඉද්ධිපාදභාවනා, කතමා ඉද්ධිපාදභාවනාගාමිනී පටිපදා”ති. භගවම්මූලකා නො භන්තෙ ධම්මා -පෙ- ඉධානන්ද, භික්ඛු අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති -පෙ- අයං වුච්චතානන්ද, ඉද්ධිපාදභාවනාගාමිනී පටිපදාති."
            },
            {
                "type": "centered",
                "text": "7. 3. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සම්බහුලභික්ඛුසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3151. අථ ඛො සම්බහුලා භික්ඛූ යෙන භගවා තෙනුපසඞ්කමිංසු. -පෙ- එකමන්තං නිසින්නා ඛො තෙ භික්ඛූ භගවන්තං එතදවොචුං: “කතමා නු ඛො භන්තෙ ඉද්ධි, කතමො ඉද්ධිපාදො, කතමා ඉද්ධිපාදභාවනා, කතමා ඉද්ධිපාදභාවනාගාමිනී පටිපදා”ති. ඉධ භික්ඛවෙ, භික්ඛු අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති: “එකොපි හුත්වා බහුධා හොති -පෙ- අයං වුච්චති භික්ඛවෙ, ඉද්ධිපාදභාවනාගාමිනී පටපදාති."
            },
            {
                "type": "page-break",
                "text": "54"
            },
            {
                "type": "centered",
                "text": "7. 3. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතියසම්බහුලභික්ඛුසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3152. අථ ඛො සම්බහුලා භික්ඛූ යෙන භගවා තෙනුපසඞ්කමිංසු: -පෙ- එකමන්තං නිසින්නෙ ඛො තෙ භික්ඛූ භගවා එතදවොච: කතමා නු ඛො භික්ඛවෙ, ඉද්ධි, කතමො ඉද්ධිපාදො, කතමා ඉද්ධිපාදභාවනා, කතමා ඉද්ධිපාදභාවනාගාමිනී පටිපදාති. භගවම්මූලකා නො භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "කතමා ච භික්ඛවෙ, ඉද්ධි: ඉධ භික්ඛවෙ, භික්ඛු අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති: එකොපි හුත්වා බහුධා හොති -පෙ- යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙති. අයං වුච්චති භික්ඛවෙ, ඉද්ධි. කතමො ච භික්ඛවෙ, ඉද්ධිපාදො: යො භික්ඛවෙ, මග්ගො යා පටිපදා ඉද්ධිලාභාය ඉද්ධිපටිලාභාය සංවත්තති. අයං වුච්චති භික්ඛවෙ, ඉද්ධිපාදො. කතමා ච භික්ඛවෙ, ඉද්ධිපාදභාවනා: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති, විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. අයං වුච්චති භික්ඛවෙ, ඉද්ධිපාදභාවනා. කතමා ච භික්ඛවෙ, ඉද්ධිපාදභාවනාගාමිනී පටිපදා: අයමෙව අරියො අට්ඨඞ්ගිකො මග්ගො, සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. අයං වුච්චති භික්ඛවෙ, ඉද්ධිපාදභාවනාගාමිනී පටිපදාති."
            },
            {
                "type": "centered",
                "text": "7. 3. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මොග්ගල්ලානසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3153. තං කිං මඤ්ඤථ භික්ඛවෙ, කතමෙසං ධම්මානං භාවිතත්තා බහුලීකතත්තා මොග්ගල්ලානො භික්ඛු එවං මහිද්ධිකො එවං මහානුභාවොති. භගවම්මූලකා නො භන්තෙ, ධම්මා -පෙ- චතුන්නං ඛො භික්ඛවෙ, ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා මොග්ගල්ලානො භික්ඛු එවංමහිද්ධිකො එවං මහානුභාවො. කතමෙසං චතුන්නං: ඉධ භික්ඛවෙ, මොග්ගල්ලානො භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉති මෙ ඡන්දො න ච අතිලීනො භවිස්සති -පෙ- සප්පභාසං චිත්තං භාවෙති. විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉති මෙ වීමංසා න ච අතිලීනා භවිස්සති, න ච අතිප්පග්ගහිතා භවිස්සති -පෙ- ඉති විවටෙන චෙතසා අපරියොනද්ධෙන සප්පභාසං චිත්තං භාවෙති. ඉමෙසං ඛො භික්ඛවෙ, චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා මොග්ගල්ලානො භික්ඛු එවං මහිද්ධිකො එවං මහානුභාවො."
            },
            {
                "type": "page-break",
                "text": "56"
            },
            {
                "type": "paragraph",
                "text": "ඉමෙසං ච පන භික්ඛවෙ, චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා මොග්ගලානො භික්ඛු එවං අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති: “එකොපි හුත්වා බහුධා හොති. -පෙ- යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙති”. ඉමෙසං ච පන භික්ඛවෙ, චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා මොග්ගල්ලානො භික්ඛු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතී”ති."
            },
            {
                "type": "centered",
                "text": "7. 3. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තථාගතසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3154. තං කිං මඤ්ඤථ භික්ඛවෙ, කතමෙසං ධම්මානං භාවිතත්තා බහුලීකතත්තා තථාගතො එවංමහිද්ධිකො එවංමහානුභාවොති. භගවංමූලකා නො භන්තෙ, ධම්මා -පෙ- චතුන්නං ඛො භික්ඛවෙ, ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා තථාගතො එවංමහිද්ධිකො එවංමහානුභාවො. කතමෙසං චතුන්නං: ඉධ භික්ඛවෙ, තථාගතො ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉති මෙ ඡන්දො න ච අතිලීනො භවිස්සති. න ච අතිප්පග්ගහිතො භවිස්සති. -පෙ- ඉති විවටෙන චෙතසා අපරියොනද්ධෙන සප්පභාසං චිත්තං භාවෙති. විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉති මෙ වීමංසා න ච අතිලීනා භවිස්සති, න ච අතිපග්ගහිතා භවිස්සති. න ච අජ්ඣත්තං සංඛිත්තා භවිස්සති, න ච බහිද්ධා වික්ඛිත්තා භවිස්සති. පච්ඡාපුරෙ සඤ්ඤී ච විහරති."
            },
            {
                "type": "gatha",
                "text": "‘යථා පුරෙ තථා පච්ඡා, යථා පච්ඡා තථා පුරෙ,\nයථා අධො තථා උද්ධං යථා උද්ධං තථා අධො,\nයථා දිවා තථා රත්තිං යථා රත්තිං තථා දිවා.’\n",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "ඉති විවටෙන චෙතසා අපරියොනද්ධෙන සප්පභාසං චිත්තං භාවෙති."
            },
            {
                "type": "paragraph",
                "text": "ඉමෙසං ච ඛො පන භික්ඛවෙ, චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා තථාගතො එවංමහිද්ධිකො එවංමහානුභාවො. ඉමෙසඤ්ච පන භික්ඛවෙ, චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා තථාගතො අනෙකවිහිතං ඉද්ධිවිධං පච්චනුභොති: එකොපි හුත්වා බහුධා හොති -පෙ- යාව බ්රහ්මලොකාපි කායෙන වසං වත්තෙති. ඉමෙසඤ්ච පන භික්ඛවෙ, චතුන්නං ඉද්ධිපාදානං භාවිතත්තා බහුලීකතත්තා තථාගතො ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතීති."
            },
            {
                "type": "paragraph",
                "text": "(ඡළභිඤ්ඤා විත්ථාරෙතබ්බා)."
            },
            {
                "type": "centered",
                "text": "අයොගුළවග්ගො තතියො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "මග්ගො අයොගුළො භික්ඛු සුද්ධිකඤ්ච දුවෙ ඵලා\nආනන්දෙන දුවෙ වුත්තා භික්ඛූසම්බහුලෙ දුවෙ,\nඑකාදසො මොග්ගල්ලානො ද්වාදසමො තථාගතොති.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "58"
            },
            {
                "type": "heading",
                "text": "4. ගඞ්ගාපෙය්යාලවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "7. 4. 1 - 48",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පාචීනනින්නාදිසුත්තානි",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3155 - 3202. සෙය්යථාපි භික්ඛවෙ, ගඞ්ගා නදී පාචීනනින්නා පාචීනපොණා පාචීනපබ්භාරා. -පෙ- නිබ්බානපබ්භාරොති."
            },
            {
                "type": "paragraph",
                "text": "(ඉද්ධිපාදවසෙන විත්ථාරෙතබ්බානි)"
            },
            {
                "type": "centered",
                "text": "ගඞ්ගාපෙය්යාලවග්ගො චතුත්ථො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "ඡ පාචීනතො නින්නා ඡ ච නින්නා සමුද්දතො,\nඑතෙ ද්වෙ ද්වාදස හොන්ති වග්ගො තෙන පවුච්චතීති.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "5. අප්පමාදවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "7. 5. 1 - 40",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තථාගතාදිසුත්තානි",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3203 – 3242. යාවතා භික්ඛවෙ සත්තා අපදා වා, දිපදා වා චතුප්පදා වා බහුප්පදා වා -පෙ- බහුලීකරොතීති."
            },
            {
                "type": "centered",
                "text": "අප්පමාදවග්ගො පඤ්චමො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "තථාගතං පදං කූටං මූලං සාරෙන වස්සිකං,\nරාජා චන්දිමසූරියා ච වත්ථෙන දසමං පදන්ති.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "6. බලකරණීයවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "7. 6. 1 - 48",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "බලාදි සුත්තානි",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3243 – 3290. සෙය්යථාපි භික්ඛවෙ, යෙ කෙචි බලකරණීයා කම්මන්තා කයිරන්ති -පෙ- බහුලීකරොතීති:"
            },
            {
                "type": "centered",
                "text": "බලකරණීයවග්ගො ඡට්ඨො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "බලං බීජං ච නාගො ච රුක්ඛං කුම්භෙන සූකිනා\nආකාසෙන ද්වෙ මෙඝා නාවා ආගන්තුකා නදී ති.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "60"
            },
            {
                "type": "heading",
                "text": "7. එසනාවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "7. 7. 1 – 160",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "එසනාදි සුත්තානි",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3291 – 3450. තිස්සො ඉමා භික්ඛවෙ එසනා. කතමා තිස්සො: -පෙ- භාවෙතබ්බාති."
            },
            {
                "type": "paragraph",
                "text": "(විවෙකනිස්සිතාදි වසෙන අභිඤ්ඤා පරිඤ්ඤා පරික්ඛය පහාන වසෙන ච එකෙකස්මිං සොළස සොළස කත්වා එකසතසට්ඨිසුත්තන්තා විත්ථාරෙතබ්බා)"
            },
            {
                "type": "centered",
                "text": "එසනාවග්ගො සත්තමො",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "එසනා විධා ආසවො භවො දුක්ඛතා ච තිස්සො,\nඛිලං මලඤ්ච නීඝො ච වෙදනා තණ්හාහි චාති.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "8. ඔඝවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "7. 8. 1 - 159",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඔඝාදි සුත්තානි",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3451 - 3609. චත්තාරො‘මෙ භික්ඛවෙ ඔඝා. කතමෙ චත්තාරො: කාමොඝො භවොඝො දිට්ඨොඝො අවිජ්ජජොඝො -පෙ- භාවෙතබ්බාති."
            },
            {
                "type": "paragraph",
                "text": "(වුත්තනයෙනෙව විත්ථාරෙතබ්බානි.)"
            },
            {
                "type": "centered",
                "text": "7. 8. 160",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "උද්ධම්භාගියසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "3610. පඤ්චිමානි භික්ඛවෙ, උද්ධම්භාගියානි සංයොජනානි. කතමානි පඤ්ච: රූපරාගො අරූපරාගො මානො උද්ධච්චං අවිජ්ජා. ඉමානි ඛො භික්ඛවෙ, පඤ්චුද්ධම්භාගියානි සංයොජනානි. ඉමෙසං ඛො භික්ඛවෙ, පඤ්චන්නං උද්ධම්භාගියානං සංයොජනානං පහානාය චත්තාරො ඉද්ධිපාදා භාවෙතබ්බා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති විරියසමාධි -පෙ- චිත්තසමාධි -පෙ- වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගතං ඉද්ධිපාදං භාවෙති. ඉමෙසං ඛො භික්ඛවෙ, පඤ්චන්නං උද්ධම්භාගියානං සංයොජනානං පහානාය ඉමෙ චත්තාරො ඉද්ධිපාදා භාවෙතබ්බාති."
            },
            {
                "type": "centered",
                "text": "ඔඝවග්ගො අට්ඨමො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "ඔඝො යොගො උපාදානං ගන්ථො අනුසයෙන ච,\nකාමගුණා නීවරණා, ඛන්ධා ඔරුද්ධම්භාගියාති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "ඉද්ධිපාදසංයුත්තං සමත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්ර වග්ගුද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "ඉද්ධිපාදෙ චාපාල පාසාදකම්පනයොගුළා\nගඞ්ගාපෙය්යාල ආදීහි පඤ්චහි වග්ගො හොන්තට්ඨාති.",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ],
        "pages": {
            "2": {
                "pageNum": 2,
                "footnotesCount": 1
            },
            "4": {
                "pageNum": 4,
                "footnotesCount": 0
            },
            "6": {
                "pageNum": 6,
                "footnotesCount": 0
            },
            "8": {
                "pageNum": 8,
                "footnotesCount": 0
            },
            "10": {
                "pageNum": 10,
                "footnotesCount": 2
            },
            "12": {
                "pageNum": 12,
                "footnotesCount": 1
            },
            "14": {
                "pageNum": 14,
                "footnotesCount": 3
            },
            "16": {
                "pageNum": 16,
                "footnotesCount": 4
            },
            "18": {
                "pageNum": 18,
                "footnotesCount": 0
            },
            "20": {
                "pageNum": 20,
                "footnotesCount": 1
            },
            "22": {
                "pageNum": 22,
                "footnotesCount": 0
            },
            "24": {
                "pageNum": 24,
                "footnotesCount": 0
            },
            "26": {
                "pageNum": 26,
                "footnotesCount": 4
            },
            "28": {
                "pageNum": 28,
                "footnotesCount": 2
            },
            "30": {
                "pageNum": 30,
                "footnotesCount": 0
            },
            "32": {
                "pageNum": 32,
                "footnotesCount": 1
            },
            "34": {
                "pageNum": 34,
                "footnotesCount": 2
            },
            "36": {
                "pageNum": 36,
                "footnotesCount": 2
            },
            "38": {
                "pageNum": 38,
                "footnotesCount": 0
            },
            "40": {
                "pageNum": 40,
                "footnotesCount": 1
            },
            "42": {
                "pageNum": 42,
                "footnotesCount": 0
            },
            "44": {
                "pageNum": 44,
                "footnotesCount": 0
            },
            "46": {
                "pageNum": 46,
                "footnotesCount": 5
            },
            "48": {
                "pageNum": 48,
                "footnotesCount": 5
            },
            "50": {
                "pageNum": 50,
                "footnotesCount": 1
            },
            "52": {
                "pageNum": 52,
                "footnotesCount": 0
            },
            "54": {
                "pageNum": 54,
                "footnotesCount": 0
            },
            "56": {
                "pageNum": 56,
                "footnotesCount": 0
            },
            "58": {
                "pageNum": 58,
                "footnotesCount": 0
            },
            "60": {
                "pageNum": 60,
                "footnotesCount": 0
            }
        }
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "3"
            },
            {
                "text": "සූත්‍රාන්තපිටකයෙහි",
                "type": "centered",
                "level": 2
            },
            {
                "text": "සංයුත්තනිකාය",
                "type": "centered",
                "level": 5
            },
            {
                "text": "පඤ්චමභාගයෙහි - දෙවන කාණ්ඩය",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "මහා වර්ගය",
                "type": "centered",
                "level": 3
            },
            {
                "text": "7. ඉද්ධිපාද සංයුක්තය",
                "type": "heading",
                "level": 3
            },
            {
                "text": "1.චාපාල වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "ඒ භාග්‍යවත් අර්හත් සම්මා සම්බුදුරජාණන් වහන්සේට නමස්කාර වේවා.",
                "level": "1"
            },
            {
                "text": "7. 1. 1.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අපාර සූත්‍රය",
                "level": 1
            },
            {
                "text": "3123. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "මහණෙනි, මේ සතර ඉද්ධිපාද කෙනෙක් වඩන ලද්දාහු බහුල කරන ලද්දාහු මෙතෙරින් එතෙරට යනු පිණිස පවත්නාහ. කවර සතරදෙනෙක යත්: මහණෙනි, මෙසස්නෙහි මහණ ඡන්දය නිසා පැවැති සමාධියෙන් හා ප්‍රධන් සංස්කාරයෙන් යුත් ඉද්ධිපාදය වඩයි. වීර්ය්‍ය නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉද්ධිපාදය වඩයි. චිත්තය නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉද්ධිපාදය වඩයි. විමංසාව නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉද්ධිපාදය වඩයි. මහණෙනි, මේ ඉද්ධිපාද සතර වඩනා ලද්දාහු බහුල කරන ලද්දාහු මෙතෙරින් එතෙර යනු පිණිස පවත්නාහ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "විරද්‌ධ සූත්‍රය",
                "level": 1
            },
            {
                "text": "3124. මහණෙනි, යම් කෙනකුන් විසින් සිවු ඉදුපා වරදවන ලදහු නම් ඔවුන් විසින් මැනැවින් දුක් ගෙවීමට යන අරීමඟ වරදවන ලද්දේ ය. මහණෙනි, යම්කිසි කෙනකුන් විසින් සිවු ඉදුපා අරඹන ලදහු නම් ඔවුන් විසින් මැනැවින් දුක් ගෙවීමට යන අරීමඟ අරඹන ලද්දේ ය. කවර සතරෙක් ද යත්: ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "5"
            },
            {
                "type": "paragraph",
                "text": "මහණෙනි, මෙසස්නෙහි මහණ ඡන්දය නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉද්ධිපාදය වඩයි. වීර්ය්‍ය නිසා පැවැති සමාධියෙන් හා ... චිත්තය නිසා පැවැති සමාධියෙන් හා ... වීමංසාව නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉද්ධිපාදය වඩයි. මහණෙනි, යම් කෙනකුන් විසින් මේ සතර සෘද්ධිපාදයෝ වරදවන ලදහු නම් ඔවුන් විසින් මැනැවින් දුක් ගෙවීමට යන අරීමඟ වරදවන ලද්දේ ය. මහණෙනි, යම් කෙනකුන් විසින් මේ සතර සෘද්ධිපාදයෝ අරඹන ලදහු නම් ඔවුන් විසින් මැනැවින් දුක් ගෙවීමට යන අරීමඟ අරඹන ලද්දේ යි."
            },
            {
                "type": "centered",
                "text": "7. 1. 3.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "අරිය සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3125. මහණෙනි, ආර්ය්‍ය වූ නෛර්ය්‍යාණික වූ මේ සෘද්ධිපාදයෝ සතරදෙන වඩන ලද්දාහු බහුල කරන ලද්දාහු ඒ අනුව පිළිපන්නාහු මැනැවින් දුක් ගෙවීමට පමුණුවත්. කවර සතරදෙනෙක යත්: මහණෙනි, මෙහි මහණ ඡන්දය නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉද්ධිපාදය වඩයි. විර්ය්‍ය නිසා පැවැති සමාධියෙන් හා ... චිත්තය නිසා පැවැති සමාධියෙන් හා ... විමංසාව නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉද්ධිපාදය වඩයි. මහණෙනි, ආර්ය්‍ය වූ නෛර්ය්‍යාණික වූ මේ සිවු ඉදුපා වඩන ලද්දේ බහුල කරන ලද්දේ ඒ අනුව පිළිපන්නහු මැනැවින් දුක් ගෙවීමට පමුණුවා යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නිබ්‌බිදා සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3126. මහණෙනි, මේ චතුරිද්ධිපාද වඩන ලද්දේ බහුල කරන ලද්දේ ඒකාන්ත නිර්වේදය විරාගය නිරොධය ව්‍යුපශමය අභිඥානය සම්බොධිය නිර්වාණය පිණිස පවතී. කවර සතරෙක් ද යත්: මහණෙනි, මෙහි මහණ ඡන්දය නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉද්ධිපාදය වඩයි. වීර්ය්‍ය නිසා පැවැති සමාධියෙන් හා ... චිත්තය නිසා පැවැති සමාධියෙන් හා ... විමංසාව නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉද්ධිපාදය වඩයි. මහණෙනි, මේ සිවු ඉදුපා වඩන ලද්දේ බහුල කරන ලද්දේ ඒකාන්තනිර්වේදය විරාගය නිරොධය ව්‍යුපශමය අභිඥානය සම්බොධිය නිර්වාණය පිණිස පවතී යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "7"
            },
            {
                "type": "centered",
                "text": "7. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පදෙස සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3127. මහණෙනි, අතීතයෙහි යම්කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ ඉදු පෙදෙසක් නිපදවූහු නම් ඒ සියල්ලෝ සිවු ඉදුපා වැඩූ බැවින් එසේ වූහ. බහුල කළ බැවින් එසේ වූහ. මහණෙනි, මතු කල යම්කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ ඉදු පෙදෙසක් නිපදවන්නාහු නම් ඒ සියල්ලෝ සිවු ඉදුපා වැඩූ බැවිනි, බහුල කළ බැවිනි. මහණෙනි, දැන් යම්කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ ඉදු පෙදෙසක් නිපදවත් නම් ඒ සියල්ලෝ සිවු ඉදුපා වැඩූ බැවිනි, බහුල කළ බැවිනි. කවර සිවු ඉදුපා ද යත්: මහණෙනි, මෙසස්නෙහි මහණ ඡන්දය නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉද්ධිපාදය වඩයි. වීර්ය්‍ය නිසා පැවැති සමාධියෙන් හා ... චිත්තය නිසා පැවැති සමාධියෙන් හා ... විමංසාව නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉද්ධිපාදය වඩයි. මහණෙනි, ඉකුත් කල යම්කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ ඉදුපෙදෙසක් නිපදවූහු නම් ... නිපදවන්නාහු නම් ... නිපදවත් නම් ඒ සියල්ලෝ මේ සිවු ඉදුපා ම වැඩූ බැවින් බහුල කළ බැවින් එසේ වෙත් යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සමත්‌ත සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3128. මහණෙනි, ඉකුත් කල යම්කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ ඉදුමුළුල්ල නිපදවූහු නම් ඒ සියල්ලෝ සිවු ඉදුපා වැඩූ බැවිනි, බහුල කළ බැවිනි. මහණෙනි, මතු කල යම් කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ ඉදුමුළුල්ල නිපදවන්නාහු නම් ඒ සියල්ලෝ සිවු ඉදුපා වැඩූ බැවිනි, බහුල කළ බැවිනි. මහණෙනි, දැන් යම් කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ ඉදු මුළුල්ල නිපදවත් නම් ඒ සියල්ලෝ සිවු ඉදුපා වැඩූ බැවිනි, බහුල කළ බැවිනි. කවර සිවු ඉදුපා ද යත්: මහණෙනි, මෙසස්නෙහි මහණ ඡන්දය නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉර්ධිපාදය වඩයි. වීර්ය්‍ය නිසා පැවැති සමාධියෙන් හා ... චිත්තය නිසා පැවැති සමාධියෙන් හා ... විමංසාව නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉද්ධිපාදය වඩයි. මහණෙනි, ඉකුත් කල යම් කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ ඉදුමුළුල්ල නිපදවූහු නම් ... නිපදවන්නාහු නම් ... නිපදවත් නම් ඒ සියල්ලෝ මේ සිවු ඉදුපා ම වැඩූ බැවිනි, බහුල කළ බැවිනි යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "9"
            },
            {
                "type": "centered",
                "text": "7. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "භික්‌ඛු සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3129. මහණෙනි, ඉකුත් කල යම්කිසි මහණ කෙනෙක් ආස්‍රවක්‍ෂය කිරීමෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලප්‍රඥාවත් දිටුදැමියෙහි ම තමන් විසින් වෙසෙසින් දැන පසක් කොට එයට පැමිණ වුසූහු නම් ඒ සියල්ලෝ සිවු ඉදුපා වැඩූ බැවිනි, බහුල කළ බැවිනි. මහණෙනි, මතු කල යම් කිසි මහණ කෙනෙක් ආස්‍රවක්‍ෂය කිරීමෙන් අනාස්‍රව වූ ඵල සමාධියත් ඵලප්‍රඥාවත් දිටුදැමියෙහි ම තමන් විසින් වෙසෙසින් දැන පසක් කොට එයට පැමිණ වෙසෙන්නාහු නම් ඒ සියල්ලෝ සිවු ඉදුපා වැඩූ බැවිනි, බහුල කළ බැවිනි. මහණෙනි, දැන් යම් කිසි මහණ කෙනෙක් ආස්‍රවක්‍ෂය කිරීමෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලප්‍රඥාවත් දිටුදැමියෙහි ම තමන් විසින් වෙසෙසින් දැන පසක් කොට එයට පැමිණ වෙසෙත් නම් ඒ සියල්ලෝ සිවු ඉදුපා වැඩූ බැවිනි, බහුල කළ බැවිනි. කවර සිවු ඉදුපා ද යත්: මහණෙනි, මෙහි මහණ ඡන්දය නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉර්ධිපාදය වඩයි. වීර්ය්‍ය නිසා පැවැති සමාධියෙන් හා ... චිත්තය නිසා පැවැති සමාධියෙන් හා ... විමංසාව නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉද්ධිපාදය වඩයි. මහණෙනි, ඉකුත් කල යම් කිසි මහණ කෙනෙක් ආස්‍රවක්‍ෂය කිරීමෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලප්‍රඥාවත් දිටුදැමියෙහි ම තමන් විසින් වෙසෙසින් දැන පසක් කොට එයට පැමිණ වුසූහු නම් ... වෙසෙන්නාහු නම් ... වෙසෙත් නම් ඒ සියල්ලෝ මේ සිවු ඉදුපා වැඩූ බැවිනි, බහුල කළ බැවිනි යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අරහන්ත සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3130. මහණෙනි, මේ ඉදුපා සතරෙකි. කවර සතරෙක් ද යත්: මහණෙනි, මෙහි මහණ ඡන්දය නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉර්ධිපාදය වඩයි. වීර්ය්‍ය නිසා පැවැති සමාධියෙන් හා ... චිත්තය නිසා පැවැති සමාධියෙන් හා ... විමංසාව නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉද්ධිපාදය වඩයි. මහණෙනි, මොහු සිවු ඉදුපා යි. මහණෙනි, මේ සිවු ඉදුපා වැඩූ බැවින් බහුල කළ බැවින් තථාගත තෙමේ අර්හත් සම්‍යක් සම්බුද්ධ ය යි කියනු ලැබේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "11"
            },
            {
                "type": "centered",
                "text": "7. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඤාණ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3131. මහණෙනි, මේ ඡන්දය නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉර්ධිපාද ය යි පෙර නොඇසූවිරූ දහම්හි මට ඇස පහළ විය. නැණ පහළ විය. පැන පහළ විය. විදු පහළ විය. එලිය පහළ විය. මහණෙනි, ඒ මේ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වැඩියයුතු යි මට ... මහණෙනි ... වඩන ලදැ යි පෙර නොඇසූවිරූ දහම්හි මට ඇස පහළ විය ... එලිය පහළ විය.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මේ විරියසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය යි පෙර නො ඇසූ විරූ දහම්හි මට ඇස පහළ විය ... එලිය පහළ විය. මහණෙනි, ඒ මේ විරියසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වැඩියයුතු යි මට ... මහණෙනි ... වඩන ලදැයි පෙර නොඇසූවිරූ දහම්හි මට ඇස පහළ විය  ... එලිය පහළ විය.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මේ චිත්තසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය යි පෙර නො ඇසූ විරූ දහම්හි මට ඇස පහළ විය ... එලිය පහළ විය. මහණෙනි, ඒ මේ චිත්තසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වැඩියයුතු යි මට ... මහණෙනි ... වඩන ලදැයි පෙර නො ඇසූ විරූ දහම්හි මට ඇස පහළ විය ... එලිය පහළ විය.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මේ විමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය යි පෙර නො ඇසූ විරූ දහම්හි මට ඇස පහළ විය ... එලිය පහළ විය. මහණෙනි, ඒ මේ විමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වැඩියයුතු යි මට ... මහණෙනි, වඩන ලදැයි පෙර නො ඇසූ විරූ දහම්හි ඇස පහළ විය. නැණ පහළ විය. මට පැන පහළ විය. විදු පහළ විය. එලිය පහළ වී ය යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "චෙතිය සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3132. එක්කලෙක භාග්‍යවතුන් වහන්සේ විසල්නුවර සමිපයෙහි මහවෙනෙහි කුටාගාරශාලායෙහි වැඩ වසන සේක. එකල්හි භාග්‍යවතුන් වහන්සේ පෙරවරු හැඳ පෙරව පාසිවුරු ගෙන පිඬු පිණිස විසල්පුර පිවිසි සේක. විසල්පුර පිඬු පිණිස හැසිර පසුබත පිණ්ඩපාතයෙන් වැළකි සේක්: “ආනන්දය, නිසීදනය ගනු. චාපාල සෑය කරා දිවාවිහරණය පිණිස යම්හ”යි ආයුෂ්මත් අනඳ තෙරුන් ඇමතූ සේක. “වහන්ස එසේ ය”යි ආයුෂ්මත් අනඳ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට පිළිවදන් අස්වා නිසීදනය රැගෙන පසුපස භාග්‍යවතුන් වහන්සේට අනුගමන් කළහ. ඉක්බිති භාග්‍යවතුන් වහන්සේ චාපාල සෑය වෙත එළඹි සේක. එළඹ පනවන ලද අස්නෙහි වැඩහුන් සේක. ආයුෂ්මත් අනඳ තෙරණුවෝ ද භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්හ. එකත්පසෙක හුන් අනඳ තෙරණුවන්ට භාග්‍යවතුන් වහන්සේ තෙල වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "13"
            },
            {
                "text": "ආනන්දය, විසල්පුර සිත්කලු ය. උදෙන සෑය සිත්කලු ය. ගොතමක සෑය සිත්කලු ය. සත්තම්බ සෑය සිත්කලු ය. බහුපුත්ත සෑය සිත්කලු ය. සාරන්දද සෑය සිත්කලු ය. චාපාල සෑය සිත්කලු ය. ආනන්දය, යම් කිසිවකු විසින් මේ සිවු සෘද්ධිපාදයෝ වඩන ලද්දාහු පුනපුනා කරන ලද්දාහු යානයක් මෙන් කරන ලද්දාහු වාස්තුවක් මෙන් කරන ලද්දාහු අනුෂ්ඨිත වූවාහු පුරුදු කරන ලද්දාහු මැනැවින් අරඹන ලද්දාහු වෙද්ද, හෙතෙමේ කැමති වන්නේ නම් ආයුෂ්කල්පයක් (සියවසක්) හෝ එයට මදක් වැඩි කලක් හෝ සිටුනේ ය. ආනන්දය, තථාගතයන් විසින් සිවු සෘද්ධිපාදයෝ වඩන ලදහ, බහුල කරන ලදහ, යානයක් මෙන් කරන ලදහ, වාස්තුවක් මෙන් කරන ලදහ, අනුෂ්ඨිතයහ, පරිවිතයහ, සුසමාරබ්ධයහ. ආනන්දය, කැමති වන්නේ නම් තථාගත තෙමේ කපක් හෝ එයට මඳක් වැඩි කලක් හෝ සිටුනේ යි. මෙසේත් භාග්‍යවතුන් වහන්සේ විසින් ඖදාරික නිමිති කරන කල්හි පැහැදිලි හෙලිකිරීම් කරන කල්හි ආයුෂ්මත් ආනන්ද තෙරණුවෝ මරු විසින් මැඩ ගන්නා ලද අන් පුහුදුන් කෙනකු මෙන් තුමූත් පිළිවිදිනට නො හැකි වූහ. “වහන්ස, බොහෝ දෙනාට හිත පිණිස බොහෝ දෙනාට සුව පිණිස ලොවට අනුකම්පා පිණිස දෙවිමිනිසුන්ට වැඩ පිණිස හිතසුව පිණිස භාග්‍යවතුන් වහන්සේ කපක් වැඩ සිටුනා සේක්වා, සුගතයන් වහන්සේ කපක් වැඩ සිටුනා සේක්වා”යි භාග්‍යවතුන් වහන්සේ නො යැද්දහ.",
                "type": "paragraph"
            },
            {
                "text": "දෙවන වට දු භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් අනඳ තෙරුන්ට මෙය වදාළ සේක: “ආනන්දය, විසල්පුර සිත්කලු ය ... “තෙවන වට දු භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ආනන්ද තෙරුන්ට මෙය වදාළ සේක: “ආනන්දය, විසල්පුර සිත්කලු ය. උදෙන සෑය සිත්කලු ය. ගොතමක සෑය සිත්කලු ය. සත්තම්බ සෑය සිත්කලු ය. බහුපුත්ත සෑය සිත්කලු ය. සාරන්දද සෑය සිත්කලු ය. චාපාල සෑය සිත්කලු ය. ආනන්දය, යම් කිසිවකු විසින් සිවු ඉදුපා භාවිත බහුලීකෘත යානීකෘත වාස්තුකෘත අනුෂ්ඨිත පරිවිත සුසමාරබ්ධ වේ ද, ආනන්ද හෙතෙමේ කැමති වන්නේ නම් කපක් හෝ කපට මඳක් වැඩි කලක් සිටුනේ ය. ආනන්දය, තථාගතයන් විසින් සිවු ඉදුපා භාවිත ය, බහුලීකෘත ය, යානීකෘත ය, වාස්තුකෘත ය, අනුෂ්ඨිත ය, පරිචිත ය, සුසමාරබ්ධ ය. ආනන්ද, තථාගත තෙමේ කැමති වන්නේ නම් කපක් හෝ මඳකින් වැඩි කපක් හෝ සිටුනේ යි.",
                "type": "paragraph"
            },
            {
                "text": "මෙසේත් භාග්‍යවතුන් වහන්සේ විසින් ඖදාරික නිමිති කරන කල්හි පැහැදිලි හෙලි කිරීම් කරන කල්හි ආයුෂ්මත් අනඳ තෙරණුවෝ මරු විසින් මැඩ ගන්නා ලද සිත් ඇති අන් පුහුදුන් කෙනකු මෙන් තුමූත් පිළිවිදිනට නො හැකි වූහ. “වහන්ස, බොහෝ දෙනාට හිත පිණිස බොහෝ දෙනාට සුව පිණිස ලොවට අනුකම්පා පිණිස වැඩ පිණිස දෙව්මිනිසුන්ට හිතසුව පිණිස භාග්‍යවතුන් වහන්සේ කපක් වැඩ සිටිනා සේක්වා, සුගතයන් වහන්සේ කපක් වැඩ සිටිනා සේක්වා”යි භාග්‍යවතුන් වහන්සේ නො යැද්දහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "15"
            },
            {
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ආනඳ තෙරුන් ඇමතූ සේක: ආනන්ද, යමකට කල් දනිවු නම් තෙපි දැන් යවු යි. වහන්ස, එසේ ය යි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට පිළිතුරු දී හුනස්නෙන් නැඟී භාග්‍යවතුන් වහන්සේ වැඳ පැදකුණු කොට නුදුරෙහි එක්තරා රුක්මුලෙක වැඩහුන්හ.",
                "type": "paragraph"
            },
            {
                "text": "එකල්හි පවිටු මරු භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේට මෙය කීය: වහන්ස, භාග්‍යවතුන් වහන්සේ දැන් පිරිනිවෙන සේක්වා, සුගතයන් වහන්සේ පිරිනිවෙන සේක්වා. වහන්ස, දැන් භාග්‍යවතුන් වහන්සේට පිරිනිවෙන කාලය යි. වහන්ස, “පවිට යම් තාක් මාගේ සවුමහණහු ව්‍යක්තයෝ විනීතයෝ විශාරදයෝ පැමිණි රහත් බැව් ඇත්තෝ බහුශ්‍රැතයෝ ධර්මධරයෝ ධර්මානුධර්මප්‍රතිපන්නයෝ සාමීචිප්‍රතිපන්නයෝ අනුධර්මචාරීහු නො වන්නාහු ද, සිය ඇදුරුදහම ඉගෙන නො කියන්නාහු ද, නො දෙසන්නාහු ද, නො පනවන්නාහු ද, නො පිහිටුවන්නාහු ද, විවරණය නො කරන්නාහු ද, නො බෙදන්නාහු ද, උඩුහුරු නො කරන්නාහු ද, උපන් පරවාද කරුණු සහිතව මැනවින් නිග්‍රහ කොට මැඬ නෛයර්යාණික කොට දහම් නො දෙසන්නාහු ද ඒ තාක් මම නො පිරිනිවෙන්නෙමි” යි තෙල වදන භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේ ම ය.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දැන් භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක භික්ෂූහු ව්‍යක්ත විනීත විශාරද ප්‍රාප්තයොගක්‍ෂේම බහුශ්‍රැත ධර්මධර ධර්මානුධර්මප්‍රතිපන්න සාමීචිප්‍රතිපන්න අනුධර්මචාරී වෙත් ම ය. (ඔහු) සිය ඇදුරුවාදය ඉගෙන කියත් දේශනා කෙරෙත්, පනවත්, පිහිටුවත්, විවරණය කෙරෙත්, බෙදෙත්, උඩුහුරු කෙරෙත්, උපන් පරවාද කරුණු සහිත ව මැනැවින් නිගහන ලද්දක් කොට නිගහා නෛර්ය්‍යාණික කොට දහම් දෙසත්. වහන්ස, දැන් භාග්‍යවතුන් වහන්සේ පිරිනිවෙන සේක්වා, සුගතයන් වහන්සේ පිරිනිවෙන සේක්වා. වහන්ස, දැන් භාග්‍යවතුන් වහන්සේට පිරිනිවෙන කාලය යි. වහන්ස, “පවිට, යම් තාක් මාගේ සවුමෙහෙණහු ... නො වන්නාහු ද, යම් තාක් මාගේ සවු උවසුවෝ ... නො වන්නාහු ද, යම් තාක් මාගේ සවු උවැසියෝ ව්‍යක්ත විනීත විශාරද ප්‍රාප්තයොගක්‍ෂේම බහුශ්‍රැත ධර්මධර ධර්මානුධර්මප්‍රතිපන්න සාමීචිප්‍රතිපන්න අනුධර්මචාරී නො වන්නාහු ද, සිය අදුරුවාදය ඉගෙන නො කියන්නාහු ද, නො දෙසන්නාහු ද, නො පනවන්නාහු ද, නො පිහිටුවන්නාහු ද, විවරණය නො කරන්නාහු ද, නො බෙදන්නාහු ද නො උඩුහුරු කරන්නාහු ද උපන් පරවාද සකාරණ කොට මැනැවින් නිගහන ලද්දක් කොට නිගහා නෛර්ය්‍යාණික කොට දහම් නො දෙසන්නාහු ද, ඒතාක් මම නො පිරිනිවෙන්නෙමි” යි තෙල වදන භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේ ම ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "17"
            },
            {
                "text": "වහන්ස, දැන් භාග්‍යවතුන් වහන්සේගේ සවු උවැසියෝ ව්‍යක්ත විනීත විශාරද ප්‍රාප්තයොගක්‍ෂේම බහුශ්‍රැත ධර්මධර ධර්මානුධර්මප්‍රතිපන්න සාමීචිප්‍රතිපන්න අනුධර්මචාරී වෙත් ම ය. (ඔහු) සිය ඇදුරු වාදය ඉගෙන කියත්, දෙසත්, පනවත්, පිහිටුවත්, විවරණය කෙරෙත්, බෙදත්, උඩුහුරු කෙරෙත්, උපන් පරවාද සකාරණ කොට මැනැවින් නිගහන ලද්දක් කොට නිගහා නෛර්ය්‍යාණික කොට දහම් දෙසත්. වහන්ස, දැන් භාග්‍යවතුන් වහන්සේ පිරිනිවෙන සේක්වා සුගතයන් වහන්සේ පිරිනිවෙන සේක්වා. වහන්ස, දැන් භාග්‍යවතුන් වහන්සේට පිරිනිවෙන කාලය යි. වහන්ස, “පවිට, යම් තාක් මේ සසුන් බඹසර සමෘද්ධ නො වන්නේ ද, සමෘද්ධ වූයේ වැඩීමට පැමිණියේ පතළේ බොහෝ දෙනා විසින් දන්නා ලද්දේ පුළුල් බවට පැමිණියේ නො වන්නේ ද, ඇති තාක් දෙවිමිනිසුන් විසින් නො පවසන ලද්දේ ද, ඒ තාක් මම නො පිරිනිවෙන්නෙමි” යි මෙවදන භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේ ම ය. වහන්ස, භාග්‍යවතුන් වහන්සේගේ මේ සසුන් බඹසර සමෘද්ධ වූයේත් වැඩීමට පැමිණියේත් පතළේත් බොහෝ දෙනා විසින් දන්නා ලද්දේත් පුළුල් බවට පැමිණියේත් ඇති තාක් දෙවිමිනිසුන් විසින් පවසන ලද්දේත් නො වේ ද, වහන්ස, දැන් භාග්‍යවතුන් වහන්සේ පිරිනිවෙන සේක්වා සුගතයන් වහන්සේ පිරිනිවෙන සේක්වා වහන්ස, දැන් භාග්‍යවතුන් වහන්සේට පිරිනිවෙන කාලය යි.",
                "type": "paragraph"
            },
            {
                "text": "මෙසේ කී කල්හි භාග්‍යවතුන් වහන්සේ පවිටු මරුහට මෙය වදාළ සේක: “පවිට, තෝ හළ වෑයම් ඇත්තෙක් වෙව. නොබෝ කලෙකින් තථාගතයන් වගන්සේගේ පිරිනිවීම වන්නේ ය. මෙයින් තෙමසක් අවෑමෙන් තථාගතයෝ පිරිනිවෙන්නාහ” යි. ඉක්බිති භාග්‍යවතුන් වහන්සේ චාපාල සෑයෙහි දී සිහි ඇති ව මනා දැනුම් ඇති ව ආයුසංස්කාර හළ සේක. භාග්‍යවතුන් වහන්සේ විසින් ආයුසංස්කාර හළ කල්හි බිහිසුනු ලොමුදහගන්වන මහාභූමිකම්පාවක් විය. දෙව්බෙර ද පැලුණහ. එකල්හි භාග්‍යවතුන් වහන්සේ මෙකරුණ දැන එවේලායෙහි මේ උදානය පහළකළ සේක:",
                "type": "paragraph"
            },
            {
                "text": "පුනර්භවය සකස් කරන උප්පත්ති ජනක කාමාවචර රූපාවචර අරූපාවචර නොහොත් අල්පවිපාක බහුවිපාක කර්ම බුද්ධමුනි තෙමේ හළේ ය. නිජඅද්ධ්‍යාත්මයෙහි ඇලුණේ උපාචාර අර්පණා වශයෙන් සමාහිත වූයේ තමා කෙරෙහි හටගත් කෙලෙස් ද භවගාමී කර්ම ද (යුදබිමෙභි සෙබළෙක්) කවචයක් මෙන් බිඳ දැම්මේ ය. නොහොත් නිවනත් භවයත් භවගාමී කර්මත් තීරණය කරමින් බුද්ධමුනි තෙමේ ආර්ය්‍යමාර්ගයෙන් හළේ ය. විදර්ශනා වශයෙන් අද්ධ්‍යාත්මයෙහි ඇලුණේ සමථ වශයෙන් සමාහිත වූයේ කවචයක් මෙන් සිය අත්බැව වැළඳගෙන සිටි කෙලෙස් දැල සිඳ දැම්මේ ය.",
                "type": "paragraph"
            },
            {
                "text": "පළමුවැනි චාපාලවර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍ර නාමමාලාව:**",
                "type": "unindented"
            },
            {
                "text": "අපාර, විරද්ධ, අරිය, නිබ්බිදා, පදෙස, සමත්ත, භික්ඛු, අරහන්ත, ඤාණ, චෙතිය යි සූත්‍ර දශයෙකි යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "19"
            },
            {
                "text": "2. පාසාදකම්‌පන වර්ගය",
                "type": "heading",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "7. 2. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "හෙතු සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3133. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "මහණෙනි, සම්බොධියෙන් පෙර බුදුබවට නො පැමිණි බෝසත් වූ ම මට මේ සිත විය: “ඉදුපා වැඩුම පිණිස කිමෙක් හේතු ද? කිමෙක් ප්‍රත්‍යය දැ” යි. මහණෙනි, ඒ මට මෙබඳු සිතෙක් විය: “මෙහි මහණ තෙමේ ඡන්දය නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් සෘද්ධිපාදය වඩයි. මෙසේ මාගේ ඡන්දය ඉතා සැඟවුණේ නො ද වන්නේ ය. ඉතා දැඩි කොට ගන්නා ලද්දේ නො ද වන්නේ ය. ඇතුළත හැකුළුණේ නො ද වන්නේ ය. පිටත විසුරුණේ නො ද වන්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "පෙර යම්සේ නම් පසුත් එසේ ය, පසු යම්සේ නම් පෙරත් එසේ ය. යට යම්සේ නම් උඩත් එසේ ය. උඩ යම්සේ නම් යටත් එසේ ය. දහවල යම්සේ නම් රෑත් එසේ ය. රෑ යම්සේ නම් දහවලුත් එසේ ය යි. "
            },
            {
                "type": "paragraph",
                "text": "පසුපෙර හැඟීම් ඇත්තේ ද වෙසෙයි. මෙසේ විවෘත වූ හාත්පසින් නො බැඳුණු සිතින් බැබළුම් සහිත සිත වඩයි."
            },
            {
                "text": "වීර්ය්‍යය නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉද්ධිපාදය වඩයි. මෙසේ මාගේ වීර්ය්‍යය ඉතා සැඟවුණේ නො ද වන්නේ ය. ඉතා දැඩි කොට ගන්නා ලද්දේ නො ද වන්නේ ය. ඇතුළත හැකුළුණේ නො ද වන්නේ ය. පිටත විසුරුණේ නො ද වන්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "පෙර යම් බඳු නම් පසුත් එබඳු ය. පසු යම් බඳු නම් පෙරත් එබඳු ය. යට යම් බඳු නම් උඩත් එබඳු ය. උඩ යම් බඳු නම් යටත් එබඳු ය. දහවල් යම් බඳු නම් රෑත් එබඳු ය. රෑ යම් බඳු නම් දහවලුත් එබඳු ය යි පසුපෙර හැඟීම් ඇත්තේ ද වෙසේ. "
            },
            {
                "type": "paragraph",
                "text": "මෙසේ විවෘත වූ හාත්පසින් නො බැඳුණු සිතින් බැබළුම් සහිත සිත වඩ යි."
            },
            {
                "text": "චිත්තය නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉද්ධිපාදය වඩ යි. මෙසේ මාගේ සිත ඉතා සැඟවුණේ නො ද වන්නේ ය. ඉතා දැඩි කොට ගන්නා ලද්දේ නො ද වන්නේ ය. ඇතුළත හැකුළුණේ නො ද වන්නේ ය. පිටත විසුරුණේ නො ද වන්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "පෙර යම්සේ නම් පසුත් එබඳු ය. පසු යම්සේ නම් පෙරත් එබඳු ය. යට යම්සේ නම් උඩත් එබඳු ය. උඩ යම්සේ නම් යටත් එබඳු ය. දහවල් යම්සේ නම් රෑත් එබඳු ය. රෑ යම්සේ නම් දහවලුත් එබඳු ය යි පසුපෙර හැඟීම් ඇත්තේ ද වෙසේ. "
            },
            {
                "type": "paragraph",
                "text": "මෙසේ විවෘත වූ හාත්පසින් නො බැඳුණු සිතින් බැබළුම් සහිත සිත වඩයි."
            },
            {
                "text": "වීමංසාව නිසා පැවැති සමාධියෙන් හා ප්‍රධන්සංස්කාරයෙන් යුත් ඉද්ධිපාදය වඩයි. මෙසේ මාගේ වීමංසාව ඉතා සැඟවුණේ නො ද වන්නේ ය. ඉතා දැඩිකොට ගන්නා ලද්දේ නො ද වන්නේ ය. පිටත විසුරුණේ නො ද වන්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "පෙර යම් බඳු නම් පසුත් එසේ ය. පසු යම් බඳු නම් පෙරත් එසේ ය. යට යම් බඳු නම් උඩත් එසේ ය. උඩ යම් බඳු නම් යටත් එසේ ය. දහවල් යම් බඳු නම් රෑත් එසේ ය. රෑ යම් බඳු නම් දහවලුත් එසේ ය යි පසු පෙර හැඟීම් ඇත්තේ ද වෙසේ. "
            },
            {
                "type": "paragraph",
                "text": "මෙසේ විවෘත වූ හාත්පසින් නො බැඳුණු සිතින් බැබළුම් සහිත සිත වඩයි."
            },
            {
                "type": "page-break",
                "text": "21"
            },
            {
                "text": "මහණෙනි, මහණ මෙසේ සතර සෘද්ධිපාද වැඩූ කල්හි මෙසේ බහුල කළ කල්හි නන් වැදෑරුම් සෘද්ධිවිධ අනුභව කරයි. එකෙක් ව ද බොහෝ අයුරු වේ. බොහෝ අයුරු ව ද එකෙක් වේ. පළට බව සැඟවුණු බව (විඳියි.) බිතෙන් පිටට පවුරෙන් පිටට පව්වෙන් පිටට අහසෙහි මෙන් නො ගැටෙමින් යේ. පොළොවෙහි ද දියෙහි මෙන් මතුවීම කිමිදීම කෙරේ. පොළොවෙහි මෙන් නොබිඳෙන දියෙහි ද යේ. පියාපත් ඇති ලිහිණියකු මෙන් අහසෙහි ද පලඟින් යුතු ව ගමන් කෙරේ, මෙසේ මහත් සෘද්ධි ඇති මෙසේ මහත් අනුභාව ඇති මේ සඳහිරු දෙදෙන ද අතින් පහස්සි. පිරිමදියි. බඹලොව තෙක් ද කයින් වසයෙහි පවත්වයි.\n__check translation here__",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මහණ මෙසේ සතර සෘද්ධිපාද වැඩූ කල්හි මෙසේ බහුල කළ කල්හි ශුද්ධ වූ මිනිස්බැව් ඉක්ම පැවැති දිව්‍යමය ශ්‍රොත්‍රධාතුවෙන් දුරවූ ද ළඟ වූ ද මානුෂික දෙසද අසයි. මහණෙනි, මහණ සතර සෘද්ධිපාද මෙසේ වැඩූ කල්හි අන්සතුන්ගේ අන්පුඟුලන්ගේ සිත තමසිතින් පිරිසිඳ දනී. සරාග සිතත් සරාග සිතැ යි දනී. වීතරාග සිතත් වීතරාග සිතැ යි දනී. සදොස සිතත් සදොස සිතැ යි දනී. වීතදොස සිතත් වීතදොස සිතැ යි දනී. සමොහ සිතත් සමොහ සිතැ යි දනී. වීතමොහ සිතත් වීතමොහ සිතැ යි දනී. සඞ්ඛිත්ත සිතත් සඞ්ඛිත්ත සිතැ යි දනී. වික්ඛිත්ත සිතත් වික්ඛිත්ත සිතැ යි දනී. අමහග්ගත සිතත් අමහග්ගත සිතැ යි දනී. මහග්ගත සිතත් මහග්ගත සිතැ යි දනී. සඋත්තර සිතත් සඋත්තර සිතැ යි දනී. අනුත්තර සිතත් අනුත්තර සිතැ යි දනී. අසමාහිත සිතත් අසමාහිත සිතැ යි දනී. සමාහිත සිතන් සමාහිත සිතැ යි දනී. අවිමුත්ත සිතත් අවිමුත්ත සිතැ යි දනී. විමුත්ත සිතත් විමුත්ත සිතැ යි දනී.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මහණ සතර සෘද්ධිපාද මෙසේ වැඩූ කල්හි මෙසේ බහුල කළ කල්හි නන් වැදෑරුම් පෙර විසූ කඳපිළිවෙළ සිහි කෙරෙයි. ඒ මෙසේ යි: එක් ජාතියක් ද ජාති දෙකක් ද ජාති තුනක් ද ජාති සතරක් ද ජාති පහක් ද ජාති දශයක් ද ජාති විස්සක් ද ජාති තිසක් ද ජාති සතලිසක් ද ජාති පනසක් ද ජාති සියයක් ද ජාති දහසක් ද ජාති සියදහසක් ද නොයෙක් නැසෙන කල්ප ද නොයෙක් වැඩෙන කල්ප ද නොයෙක් නැසෙන වැඩෙන කල්ප ද (සිහි කෙරේ.) අසුවල් තැන මෙබඳු නම් ඇත්තෙම් මෙබඳු ගොත් ඇත්තෙම් මෙබඳු වර්ණ ඇත්තෙම් මෙබඳු අහර ඇත්තෙම් මෙසේ සුවදුක් විඳින සුල්ලෙම් මෙබඳු ආයු කෙළවර ඇත්තෙම් වීමි. ඒ මම එයින් ච්‍යුත ව අසවල්තැන උපන්මි. එහි දු මෙබඳු නම් ඇත්තෙම් මෙබඳු ගොත් ඇත්තෙම් මෙබඳු වර්ණ ඇත්තෙම් මෙබඳු අහර ඇත්තෙම් මෙසේ සුවදුක් විඳින සුල්ලෙම් මෙබඳු ආයු කෙළවර ඇත්තෙම් වීමි. ඒ මම එයින් ච්‍යුත ව පැමිණියෙමි යි මෙසේ අයුරු සහිත උදෙසුම් සහිත නන්වැදෑරුම් පෙර විසූ කඳපිළිවෙළ සිහි කෙරේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "23"
            },
            {
                "text": "මහණෙනි, මහණ සිවු ඉදුපා මෙසේ වැඩූ කල්හි මෙසේ බහුල කළ කල්හි විසුද්ධ වූ මිනිස් ඇස ඉක්ම පැවැති දිවැසින් සතුන් දකී. ච්‍යුත වන උපදින හීන ප්‍රණීත මනාවර්ණ ඇති නපුරුවර්ණ ඇති මනාගති ඇති නපුරුගති ඇති කම් වූ පරිදි පැමිණි සතුන් දැනගනී. මේ භවත් සත්ත්වයෝ කායදුශ්චරිතයෙන් යුක්ත වූවාහු වාග්දුශ්චරිතයෙන් යුක්ත වූවාහු මානොදුශ්චරිතයෙන් යුක්ත වූවාහු ආර්ය්‍යයන්ට උපවාද කරන්නාහු මිථ්‍යාදෘෂ්ටි ඇත්තාහු මිථ්‍යාදෘෂ්ටිකර්ම සමාදන් වූවාහු වෙති. ඔහු කාබුන් මරණින් මතු සැපයෙන් පහවූ නපුරු ගති ඇති විවස ව පතිත වන නිරයට පැමිණියහ. මේ භවත් සත්ත්වයෝ වනාහි කායසුචරිතයෙන් යුතුවහ, වාක්සුචරිතයෙන් යුතුවහ. මනඃසුචරිතයෙන් යුතුවහ. ආර්ය්‍යොපවාද නො කරන්නාහ. සම්‍යග්දෘෂ්ටි ඇතියහ, සම්‍යග්දෘෂ්ටි කර්ම සමාදන් වූවහ. ඔහු කාබුන් මරණින් මතු සෝභනගති ඇති සගලොවට පැමිණියහ” යි, මෙසේ විශුද්ධ මිනිසැස ඉක්ම පැවති දිවැසින් සතුන් දකී. ච්‍යුත වන උපදින හීන ප්‍රණීත සුවර්ණ දුර්වර්ණ සුගත දුර්ගත යථාකර්මොපග සතුන් දැනගනී.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මහණ සිවු ඉදුපා මෙසේ වැඩූ කල්හි මෙසේ බහුල කළ කල්හි ආස්‍රවයන් ක්‍ෂය කිරීමෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලප්‍රඥාවත් දිටුදැමියෙහි ම තමා විසින් වෙසෙසින් දැන පසක් කොට එයට පැමිණ වෙසේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 2. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මහප්‌ඵල සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3134. මහණෙනි, මේ සිවු ඉදුපා වඩන ලදුයේ බහුල කරන ලදුයේ මහත්ඵල මහානිසංස වේ. මහණෙනි, කෙසේ වඩන ලද කෙසේ බහුල කරන ලද සිවු ඉදුපා මහත්ඵල මහානිසංස වේ ද යත්: මහණෙනි, මෙසස්නෙහි මහණ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මෙසේ මාගේ ඡන්දය සැඟවුණේ නො ද වන්නේ ය, ඉතා දැඩි කොට ගන්නා ලද්දේ නො ද වන්නේ ය. ඇතුළත හැකුළුණේ නො ද වන්නේ ය. පිටත විසුරුණේ නො ද වන්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "පෙර යම්සේ නම් පසුත් එසේ ය, පසු යම්සේ නම් පෙරත් එසේ ය. යට යම්සේ නම් උඩත් එසේ ය. උඩ යම්සේ නම් යටත් එසේ ය, දහවල් යම්සේ නම් රැයත් එසේ ය. රෑ යම්සේ නම් දහවලුත් එසේ” ය යි පසු පෙර හැඟීම් ඇත්තේද වෙසේ. "
            },
            {
                "type": "paragraph",
                "text": "මෙසේ විවෘත වූ හාත්පසින් නො බැඳුණු සිතින් බැබළුම් සහිත සිත වඩයි."
            },
            {
                "type": "page-break",
                "text": "25"
            },
            {
                "text": "විරියසමාධි ... චිත්තසමාධි ... වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මෙසේ මාගේ වීමංසාව ඉතා සැඟවුණේ නො ද වන්නේ ය. ඉතා දැඩි කොට ගන්නා ලද්දේ නො ද වන්නේ ය. ඇතුළත හැකුළුණේ නො ද වන්නේ ය. පිටත විසුරුණේ නො ද වන්නේ ය,",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": " පෙර යම්බඳු නම් පසුත් එබඳු ය. පසු යම් බඳු නම් පෙරත් එබඳු ය. යට යම්බඳු නම් උඩත් එබඳු ය. උඩ යම්බඳු නම් යටත් එබඳු ය. දහවල් යම්බඳු නම් රෑත් එබඳු ය. රෑ යම්බඳු නම් දහවලුත් එබඳු ය”යි පසුපෙර හැඟීම් ඇත්තේ ද වෙසෙ යි. "
            },
            {
                "type": "paragraph",
                "text": "මෙසේ විවෘත වූ හාත්පසින් නො බැඳුණු සිතින් බැබළුම් සහිත සිත වඩ යි. මහණෙනි, මෙසේ වඩන ලද මෙසේ බහුල කරනලද සිවු ඉදුපා මහත්ඵල මහානිසංස වේ."
            },
            {
                "text": "මහණෙනි, මහණ සිවු ඉදුපා මෙසේ වැඩූ කල්හි මෙසේ බහුල කළ කල්හි නන්වැදෑරුම් ඉදු කොටස් විඳි යි. එකක් ව ද බොහෝ අයුරු වේ ... බඹලොව තෙක් ද කයින් වසයෙහි පවත්ව යි ... මහණෙනි, මහණ සිවු ඉදුපා මෙසේ වැඩූ කල්හි මෙසේ බහුල කළ කල්හි සිවු ආස්‍රවයන් ක්‍ෂය කිරීමෙන් අනාස්‍රව වූ ඵලසමාධියත් එලප්‍රඥාවත් දිටුදැමියෙහි ම තෙමේ වෙසෙසින් දැන පසක් කොට එයට පැමිණ වෙසේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 2. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඡන්‌ද සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3135. මහණෙනි, ඉදින් මහණ ඡන්දය නිසා සමාධියක් ලබා නම් සිතේ එකඟ බවක් ලබා නම් මේ ඡන්දසමාධිය යි කියනු ලැබේ. හෙතෙමේ නූපන් ලාමක අකුසල් දහම් නොඉපදවීම පිණිස සඳ දනවයි. වෑයම් කෙරෙයි. වැර අරඹයි. සිත දැඩි කොට ගනියි. ප්‍රධන්වීර්ය්‍ය කෙරෙයි. උපන් ලාමක අකුසල් දහම් ප්‍රහාණ කරනු පිණිස ඡන්දය උපදවයි. වෑයම් කෙරෙයි. වැර අරඹයි. සිත දැඩි කොට ගනී. ප්‍රධන්වීර්ය්‍ය කෙරෙයි. නූපන් කුසල් දහම් ඉපදවීම පිණිස ඡන්දය දනවයි, වෑයම් කෙරෙයි. වැර අරඹයි. සිත දැඩිකොට ගනී. ප්‍රධන්වීර්ය්‍ය කෙරෙයි. උපන්කුසල් දහම් පැවැත්ම පිණිස අවිනාසය පිණිස බොහෝ බැව් පිණිස විපුල බැව් පිණිස වැඩීම පිණිස පිරීම පිණිස සඳ දනවයි. වෑයම් කෙරෙයි. වැර අරඹයි. සිත දැඩි කොට ගනියි. ප්‍රධන්වීර්ය්‍ය කෙරෙයි. මොහු පදහන්සංස්කාරයෝය කියනු ලැබෙත්. මෙසේ මේ ඡන්දයත් මේ ඡන්දසමාධියත් මේ ප්‍රධන්සංස්කාරයොත් වෙද් ද, මහණෙනි, මේ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, ඉදින් මහණ වීර්ය්‍යය නිසා සමාධියක් ලබා ද සිතේ එකඟකමක් ලබා ද, මේ වීර්ය්‍යසමාධිය යි කියනු ලැබේ. හෙතෙමේ නූපන් ලාමක අකුසල් දහම් නොඉපදවීම පිණිස ... උපන් කුසල් දහමුන්ගේ පැවැත්ම අවිනාශය බොහෝ බව විපුල බව වැඩීම පිරීම පිණිස ඡන්දය දනවයි, වෑයම් කෙරෙයි. වැර අරඹයි. සිත දැඩි කොට ගනියි. ප්‍රධන්වීර්ය්‍ය කෙරෙයි. මොහු ප්‍රධන්සංස්කාරයෝ ය යි කියනු ලැබෙත්. මෙසේ මේ වීර්ය්‍යයත් මේ විරියසමාධියත් මේ ප්‍රධන්සංස්කාරයෝත් වෙද්ද, මහණෙනි, මේ විරියසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "27"
            },
            {
                "text": "මහණෙනි, ඉදින් මහණ සිත නිසා සමධියක් ලබා ද සිතේ එකඟකමක් ලබා ද, මේ චිත්තසමාධිය යි කියනු ලැබේ. හෙතෙමේ නූපන් ලාමක අකුසල් දහම් නොඉපදවීම පිණිස ... උපන් කුසල් දහමුන්ගේ පැවැත්ම අවිනාශය බොහෝ බව විපුල බව වැඩීම පිරීම පිණිස ඡන්දය දනවයි. වෑයම් කෙරෙයි. වැර අරඹයි. සිත දැඩි කොට ගනියි. ප්‍රධන් වීර්ය්‍යය කෙරෙයි. මොහු ප්‍රධන්සංස්කාරයෝ යයි කියනු ලැබෙත්. මෙසේ මේ සිතත් මේ චිත්තසමාධියත් මේ ප්‍රධන්සංස්කාරයෝත් වෙද්ද, මහණෙනි, මේ චිත්තසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, ඉදින් මහණ වීමංසාව නිසා සමාධියක් ලබා ද, සිතේ එකඟ බවක් ලබා ද, මේ වීමංසා සමාධිය යි කියනු ලැබේ. හෙතෙමේ නූපන් ලාමක අකුසල් දහම් නොඉපදවීම පිණිස ... උපන් කුසල් දහමුන්ගේ පැවැත්ම අවිනාශය බොහෝ බව විපුල බව වැඩීම පිරීම පිණිස ඡන්දය දනවයි. වෑයම් කෙරෙයි. වැර අරඹයි. සිත දැඩි කොට ගනියි. ප්‍රධන් වීර්ය්‍යය කෙරෙයි. මොහු ප්‍රධන්සංස්කාරයෝ යයි කියනු ලැබෙත්. මෙසේ මේ වීමංසාවත් මේ වීමංසා සමාධියත් මේ ප්‍රධන්සංස්කාරයෝත් වෙද්ද, මහණෙනි, මේ වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 2. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මොග්‌ගල්‌ලාන සූත්‍රය",
                "level": 1
            },
            {
                "text": "3136. එක්සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවත සමීපයෙහි මිගාරමාතුපාසාද නම් පූර්වාරාමයෙහි වැඩවසන සේක. එසමයෙහි උඩඟු වූ නගාගත් මානනළ ඇති පාසිවුරු සැරසීම් ආදි චපල බැවින් යුත් රළුවදන් ඇති දොඩමලු වූ මුළා සිහි ඇති මනා නුවණ නැති නො එකඟ සිත් ඇති වෙසෙසින් තැතිගත් සිත් ඇති පියවි (-අසංචෘත) ඉඳුරන් ඇති බොහෝ භික්ෂූහු මුවරමාපා යටමහලෙහි වෙසෙත්.",
                "type": "paragraph"
            },
            {
                "text": "එකල්හි භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් මහමුගලන් තෙරුන් ඇමතූ සේක: මුගලන, උඩඟු වූ නගාගත් මානනළ ඇති චපල වූ රළුවදන් ඇති දොඩමලු වූ මුළාසිහි ඇති මනානුවණ නැති නොඑකඟ සිත් ඇති වෙසෙසින් තැතිගත් සිත් ඇති පියවි ඉඳුරන් ඇති තොපගේ මේ සබ්‍රම්සරහු මුවරමාපා යටමහලෙහි වෙසෙති. “මුගලන, යවු ඒ මහණුන් සංවෙගයට පමුණුවාලව” යි. එසේ ය වහන්සැයි ආයුෂ්මත් මහමුගලන් තෙරණුවෝ භාග්‍යවතුන් වහන්සේට පිළිවදන් අස්වා යම්සේ පයමහපටැඟිල්ලෙන් මුවරමාපාය කම්පිත කළෝ ද වැඩියක් කම්පිත කළෝ ද, වෙසෙසින් සැලූහු ද, එබඳු සෘද්ධිවිධියක් කළහ. එකල්හි ඒ භික්ෂූහු සංවෙගයට පැමිණියාහු හටගත් ලොමුදහගැනුම් ඇත්තාහු භවත්නි, අසිරියි, භවත්නි, පුදුමයි. මේ මුවරමාපාය ඒකාන්තයෙන් වාතාවරණසම්පන්න ය. ගැඹුරට ගිය පදනම් ඇත්තේ ය. මැනැවින් පිහිටුවන ලද්දේ ය. නිසල ය. නො සැලෙනසුලු ය. එතෙකුදු වුව කම්පිත වූයේ ය. බෙහෙවින් කම්පිත වූයේ ය. වෙසෙසින් සැලුණේ ය යි පසෙකට වී සිටියහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "29"
            },
            {
                "text": "එකල්හි භාග්‍යවතුන් වහන්සේ ඒ මහණුන් වෙත එළඹි සේක. එළඹ ඒ මහණුන්ට මේ වදාළ සේක. මහණෙනි, කුමක් හෙයින් තෙපි සංවේගයට පැමිණියාහු හටගත් ලොමුදහගැනුම් ඇත්තාහු පසෙකට වී සිටීහු දැ යි. වහන්ස, අසිරි යි. වහන්ස, පුදුම යි. මේ මුවරමාපායත් ඒකාන්තයෙන් වාතාවරණ සම්පන්න ය. ගැඹුරට ගිය පදනම් ඇත්තේ ය. මැනවින් පිහිටුවන ලද්දේ ය. නිසල ය. නොසැලෙනසුලු ය. එතෙකුදු වූවා කම්පිත වූයේ ය. බෙහෙවින් කම්පිත වූයේ ය. වෙසෙසින් සැලුණේ ය යි. මහණෙනි, තොප ම සංවෙගයට පමුණුවන කැමැති මුගලන් මහණහු විසින් පයැ මාපටැඟිල්ලෙන් මුවරමාපාය කම්පිත කරන ලද්දේ ය. බෙහෙවින් කම්පිත කරන ලද්දේ ය. වෙසෙසින් සලන ලද්දේ ය. මහණෙනි, ඒ කිමැ යි හඟිවු ද? කවර දහම් කෙනෙකුන් වැඩූ බැවින් බහුල කළ බැවින් මුගලන් මහණ මෙසේ මහත් සෘද්ධි ඇත්තේ මෙසේ මහත් අනුභාව ඇත්තේ වේ දැ යි.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අපගේ දහම්හු භගවත්හු මුල් කොට ඇතියහ ... මහණෙනි, සිවු ඉදුපා වැඩූ බැවින් බහුල කළ බැවින් මුගලන් මහණ මෙසේ මහත් සෘද්ධි ඇත්තේ මෙසේ මහත් අනුභාව ඇත්තේ වේ. කවර සිවු ඉදුපා ද යත්: මහණෙනි, මෙහි මුගලන් මහණ ඡන්දසමාධිපධානසංඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මෙසේ මාගේ ඡන්දය ඉතා සැඟවුණේ නො ද වන්නේ ය ... මෙසේ විවෘත වූ හාත්පසින් නො බැඳුණු සිතින් බැබළුම් සහිත සිත වඩයි. විරිය සමාධි ... චිත්ත සමාධි ... වීමංසාසමාධිපධානසංඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මෙසේ මාගේ වීමංසාව ඉතා සැඟවුණේ නො ද වන්නේ ය. ඉතා දැඩි කොට ගන්නා ලද්දේ නො ද වන්නේ ය. අතුළත හැකුළුණේ නො ද වන්නේ ය. පිටත විසුරුණේ නො ද වන්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "පෙර යම් බඳු නම් පසුත් එසේ ය. පසු යම් බඳු නම් පෙරත් එසේ ය. යට යම් බඳු නම් උඩත් එසේ ය. උඩ යම් බඳු නම් යටත් එසේ ය. දහවල් යම් බඳු නම් රෑත් එසේ ය. රෑ යම් බඳු නම් දහවලුත් එසේ ය” යි පසු පෙර හැඟීම් ඇත්තේ ද වෙසේ. "
            },
            {
                "type": "paragraph",
                "text": "මෙසේ විචෘත වූ හාත්පසින් නොබැඳුණු සිතින් බැබළුම් සහිත සිත වඩයි."
            },
            {
                "text": "මහණෙනි, මේ සිවු ඉදුපා වැඩූ බැවින් බහුල කළ බැවින් මුගලන් මහණ මෙසේ මහත් සෘද්ධි ඇත්තේ මෙසේ මහත් අනුභාව ඇත්තේ වේ. මගණෙනි, මේ සිවු ඉදුපා වැඩූ බැවින් ම බහුල කළ බැවින් ම මුගලන් මහණ නන්වැදෑරුම් ඉදුකොටස් විඳී ... කයින් වසයෙහි පවත්වයි. මහණෙනි, මේ සිවු ඉදුපා වැඩූ බැවින් ම බහුල කළ බැවින් ම මුගලන් මහණ ආස්‍රවක්‍ෂය කිරීමෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලප්‍රඥාවත් දිටුදැමියෙහි ම තෙමේ වෙසෙසින් දැන පසක් කොට එයට පැමිණ වෙසේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "31"
            },
            {
                "type": "centered",
                "text": "7. 2. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "බ්‍රාහ්‌මණ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3137. එක්කලෙක ආයුෂ්මත් ආනන්ද තෙරණුවෝ කොසඹෑනුවර සමීපයෙහි ඝෝසිතාරාමයෙහි වැඩවෙසෙති. එකල්හි උන්නාභ බමුණු තෙමේ ආයුෂ්මත් ආනන්ද තෙරණුවන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් ආනන්ද තෙරණුවන් සමග සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පස් ව හුන්නේ ය. එකත්පස් ව හුන් උන්නාභ බමුණු තෙමේ ආයුෂ්මත් ආනන්ද තෙරණුවන්ට මෙය කීය: “භවත් ආනන්දයෙනි, කුමක් පිණිස මහණගොයුම්හු කෙරෙහි බඹසර වෙසේ දැ”යි. බමුණ, තෘෂ්ණාඡන්දය පහනු පිණිස භාග්‍යවතුන් වහන්සේ කෙරෙහි බඹසර වෙසේ යි. භවත් ආනන්දයෙනි, තෙල ඡන්දය ප්‍රහාණය පිණිස මඟෙක් ඇද්ද? පිළිවෙතෙක් ඇද්දැයි? බමුණ, තෙල ඡන්දය පහනු පිණිස මඟෙක් ඇත පිළිවෙතෙක් ඇතැ යි. භවත් ආනන්දයෙනි, තෙල ඡන්දය පහනු පිණිස මඟ කවරේ ද? පිළිවෙත කවරේ දැ යි? බමුණ, මෙසස්නෙහි මහණ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. විරියසමාධි ... චිත්තසමාධි ... වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. බමුණ, තෙල ඡන්දය පහනු පිණිස මේ මඟ ය, මේ පිළිවෙත යි.",
                "type": "paragraph"
            },
            {
                "text": "භවත් ආනන්දයෙනි, එසේ ඇති කල්හි ශාන්ත වූවෙක් ම වෙයි. ශාන්ත නො වූවෙක් නො වෙයි. ඡන්දයෙන් ම ඡන්දය දුරලන්නේ ය යන මෙකරුණ නැතැ යි. බමුණ, එසේ වී නම් මෙහි ලා තොප ම පිළිවිසින්නෙමි. යම්සේ තොපට රුස්නේ නම් එසේ එය විසඳන්නහු. බමුණ, ඒ කිමැ යි හඟිවු ද? පෙර තොපට අරමට යන්නෙමි යි ඡන්දයෙක් වී ය. අරමට ගිය ඒ තොපගේ ඒ පිණිස වූ ඡන්දයෙක් වී නම් එය සන්හුන්නේ දැ යි? භවත්නි, එසේ ය. පෙර තොපට අරමට යන්නෙමි යි විර්ය්‍යයෙක් වී ය. අරමට ගිය ඒ තොපට ඒ පිණිස වූ යම් වීර්ය්‍යයෙක් වී නම් එය සන්හුන්නේ දැ යි? භවත්නි, එසේ ය. පෙර තොපට අරමට යන්නෙමි යි සිතෙක් වී ය. අරමට ගිය ඒ තොපට ඒ පිණිස වූ යම් සිතෙක් වී නම් එය සන්හුන්නේ දැ යි? භවත්නි, එසේ ය. පෙර තොපට අරමට යන්නෙමි යි වීමංසාවක් වූ ය. අරමට ගිය ඒ තොපට ඒ පිණිස වූ යම් වීමංසාවක් වූ නම් එය සන්හුන්නේ දැ යි? භවත්නි, එසේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "33"
            },
            {
                "text": "බමුණ, එසෙයින් ම රහත් වූ ක්‍ෂය කළ ආස්‍රව ඇති වැස නිම වූ බඹසර ඇති කළ සිවුමඟ කටයුතු ඇති බහා තැබූ බර ඇති පිළිවෙළින් පැමිණි රහත් බැව් ඇති සහමුලින් ගෙවූ භවසංයොජන ඇති යම් ඒ මහණෙක් වේ ද, ඔහුට පෙර රහත් බවට පැමිණෙනු පිණිස යම් ඡන්දයෙක් වී ද, රහත් බවට පැමිණි කල්හි ඒ පිණිස වූ යම් ඡන්දයෙක් වී නම් එය සන්හුන්නේ ය. පෙර රහත් බවට පැමිණෙනු පිණිස යම් විර්ය්‍යයෙක් වී ද, රහත් බවට පැමිණි කල්හි ඒ පිණිස වූ යම් වීර්ය්‍යයෙක් වී නම් එය සන්හුන්නේ ය. පෙර රහත් බවට පැමිණෙනු පිණිස යම් සිතෙක් වී ද රහත් බවට පැමිණි කල්හි ඒ පිණිස වූ යම් සිතෙක් වී නම් එය සන්හුන්නේ ය. පෙර රහත් බවට පැමිණෙනු පිණිස යම් වීමංසාවක් වූ ද, රහත් බවට පැමිණි කල්හි ඒ පිණිස වූ යම් වීමංසාවක් වී නම් එය සන්හුන්නේ ය. මෙසේ ඇති කල්හි ශාන්ත වූවෙක් හෝ ශාන්ත නො වූවෙක් හෝ වේ දැ යි? භවත් ආනන්දයෙනි, එසේ ඇති කල්හි ඒකාන්තයෙන් ශාන්ත වූවෙක් වේ. ශාන්ත නො වූවෙක් නො වේ. භවත් ආනන්දයෙනි, ඉතා මැනවි ... අද පටන් දිවිහිම් කොට සරණ ගිය (මා උවසු කොට දරන සේක්වා) යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 2. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මහිද්ධික සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3138. මහණෙනි, ඉකුත්කල යම්කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ මහත් සෘද්ධි ඇත්තෝ මහත් අනුභාව ඇත්තෝ වූහු නම් ඒ සියල්ලෝ සිවු ඉදුපා වැඩූ බැවින්, බහුල කළ බැවින් (එසේ වූහ.) මහණෙනි, මතුත් යම්කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ මහත් සෘද්ධි ඇත්තෝ මහත් අනුභාව ඇත්තෝ වන්නාහු නම් ඒ සියල්ලෝ සිවු ඉදුපා වැඩූ බැවිනි, බහුල කළ බැවිනි. මහණෙනි, දැන් යම් කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ මහත් සෘද්ධි ඇත්තෝ මහත් අනුභාව ඇත්තෝ නම් ඒ සියල්ලෝ සිවු ඉදුපා වැඩූ බැවිනි, බහුල කළ බැවිනි. කවර සිවු ඉදුපා ද යත්: මහණෙනි, මෙසස්නෙහි මහණ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. විරියසමාධි ... චිත්තසමාධි ... වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මහණෙනි, ඉකුත් කල යම්කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ මහත් සෘද්ධි ඇත්තෝ මහත් අනුභාව ඇත්තෝ වූහු නම් ... මහත් සෘද්ධි ඇත්තෝ මහත් අනුභාව ඇත්තෝ වන්නාහු නම් ... දැන් මහත් සෘද්ධි ඇත්තෝ මහත් අනුභාව ඇත්තෝ නම් ඒ සියල්ලෝ මේ ඉදුපා වැඩූ බැවිනි, බහුල කළ බැවිනි යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "35"
            },
            {
                "type": "centered",
                "text": "7. 2. 7.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "ඉද්ධිවිධ සූත්‍රය",
                "level": 1
            },
            {
                "text": "3139. මහණෙනි, ඉකුත්කල යම් කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ නන් වැදෑරුම් ඉදුකොටස් වින්දාහු ද, එකෙක් ව ද බොහෝ අයුරු වූහු ද, බොහෝ අයුරු ව ද එකෙක් වූහූ ද, පළට බව මුවහ බව (වින්දාහු ද,) බිතෙන් පිටට පවුරෙන් පිටට පව්වෙන් පිටට අහස්හි මෙන් නො ගැටෙමින් ගියාහු ද, පොළොවෙහිත් දියෙහි මෙන් මතුවීම කිමිදීම කළාහු ද, පොළොවෙහි මෙන් නො බිඳෙන දියෙහිත් ගියාහු ද, පියාපත් ඇති ලිහිණියකු මෙන් අහස්හිත් පළඟින් යුතු ව ගමන් කළාහු ද, මෙබඳු මහත් සෘද්ධි ඇති මෙබඳු මහත් අනුභාව ඇති මේ සඳහිරු දෙදෙනත් ස්පර්ශකලාහු ද, පිරිමැද්දාහු ද, බඹලොව තෙක් දු කයින් වසයෙහි පැවැත් වූහු ද, ඒ සියල්ලෝ සිවු ඉදුපා වැඩූ බැවිනි, බහුල කළ බැවිනි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මතුත් යම් කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ නන්වැදෑරුම් ඉදු කොටස් විඳින්නාහු ද, එකෙක් ව ද බොහෝ අයුරු වන්නාහු ද, බොහෝ අයුරු ව ද එකෙක් වන්නාහු ද, පළට බව මුවහ බව (විඳින්නාහු ද,) බිතෙන් පිටට පවුරෙන් පිටට පව්වෙන් පිටට අහස්හි මෙන් නො ගැටෙමින් යන්නාහු ද, පොළොවෙහිත් දියෙහි මෙන් මතු වීම කිමිදීම කරන්නාහු ද, පොළොවෙහි මෙන් නො බිඳෙන දියෙහිත් යන්නාහු ද, පියාපත් ඇති ලිහිණියකු මෙන් අහස්හිත් පළඟින් යුතු ව ගමන් කරන්නාහු ද, මෙබඳු මහත් සෘද්ධි ඇති මෙබඳු මහත් අනුභාව ඇති මේ සඳහිරු දෙදෙනත් අතින් පහස්නාහු ද පිරිමදනාහු ද, බඹලොව තෙක් කයින් වසයෙහි පවත්වන්නා හු ද, ඒ සියල්ලෝ සිවු ඉදුපා වැඩූ බැවිනි, බහුල කළ බැවිනි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, දැන් යම් කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ නන් වැදෑරුම් ඉදු කොටස් විඳිද්ද, එකෙක් ව ද බොහෝ අයුරු වෙද්ද, බොහෝ අයුරු ව ද එකෙක් වෙද්ද, පළට බව මුවහ බව (විඳිද්ද,) බිතෙන් පිටට පවුරෙන් පිටට පව්වෙන් පිටට අහස්හි මෙන් නො ගැටෙමින් යෙද්ද, පොළොවෙහිත් දියෙහි මෙන් මතුවීම කිමිදීම කෙරෙද්ද, නො බිඳෙන දියෙහිත් පොළොවෙහි මෙන් යෙද්ද. පියාපත් ඇති ලිහිණියකු මෙන් අහස්හිත් පළඟින් යුතු ව ගමන් කෙරෙද්ද, මෙබඳු මහත් සෘද්ධි ඇති මෙබඳු මහත් අනුභාව ඇති මේ සඳහිරු දෙදෙනත් අතින් පහසිද්ද පිරිමදිද්ද, බඹලොව තෙක් දු කයින් වෙසෙහි පවත්වද්ද, ඒ සියල්ලෝ සිවු ඉදුපා වැඩූ බැවිනි, බහුල කළ බැවිනි.",
                "type": "paragraph"
            },
            {
                "text": "කවර සිවු ඉදුපා ද යත්: මහණෙනි, මෙසස්නෙහි මහණ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. විරියසමාධි ...  චිත්තසමාධි ... වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මහණෙනි, ඉකුත්කල යම් කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ නන් වැදෑරුම් ඉදු කොටස් වින්දාහු ද ... විඳින්නාහු ද ... විඳිද්ද ... ඒ සියල්ලෝ මේ සිවු ඉදුපා වැඩූ බැවිනි, බහුල කළ බැවිනි යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "37"
            },
            {
                "type": "centered",
                "text": "7. 2. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "භික්‌ඛු සූත්‍රය",
                "level": 1
            },
            {
                "text": "3140. මහණෙනි, ඉදුපා සතරක් වැඩූ බැවින් බහුල කළ බැවින් මහණතෙමේ ආස්‍රව ක්‍ෂය කිරීමෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලප්‍රඥාවත් දිටුදැමියෙහි ම තෙමේ වෙසෙසින් දැන පසක් කොට එයට පැමිණ වෙසේ. කවර සතරක් ද යත්: මහණෙනි, මෙහි මහණතෙමේ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. විරියසමාධි ... චිත්තසමාධි ... වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මහණෙනි, මේ සිවු ඉදුපා වැඩූ බැවින් බහුල කළ බැවින් මහණ ආස්‍රව ක්‍ෂය කිරීමෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලප්‍රඥාවත් දිටු දැමියෙහි ම තෙමේ වෙසෙසින් දැන පසක් කොට එයට පැමිණ වෙසේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 2. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "භාවනා සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3141. මහණෙනි, සෘද්ධිය හා සෘද්ධිපාද හා සෘද්ධිපාදභාවනා හා සෘද්ධිපාදභාවනාගාමිනීප්‍රතිපදා හා තොපට දෙසන්නෙමි. එය අසවු. මහණෙනි, සෘද්ධි කවර යත්: මහණෙනි, මෙසස්නෙහි මහණ නන් වැදෑරුම් සෘද්ධිවිධ අනුභව කෙරෙයි. එකෙක් ව ද බහු ප්‍රකාර වේ ... බඹලොව හිම් කොට දු කයින් වශයෙහි පවත්වයි. මහණෙනි, මේ සෘද්ධි යයි කියනු ලැබේ. මහණෙනි, සෘද්ධිපාද කවරෙ යත්: මහණෙනි, යම් මඟෙක් යම් පිළිවෙතෙක් සෘද්ධි ප්‍රතිලාභ පිණිස පවතී ද, මහණෙනි, මේ සෘද්ධිපාද යයි කියනු ලැබේ. මහණෙනි, සෘද්ධිපාදභාවනා කවර යත්: මහණෙනි, මෙසස්නෙහි මහණ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. විරියසමාධි ... චිත්තසමාධි ... වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මහණෙනි, මේ සෘද්ධිපාදභාවනා යයි කියනු ලැබේ. මහණෙනි, සෘද්ධිපාදභාවනාගාමිනීප්‍රතිපත් කවර යත්: මේ අරිඅටඟිමඟ මැ යි. එනම්: සම්මාදිට්ඨි ... සම්මාසමාධි යි. මහණෙනි, මේ සෘද්ධිපාදභාවනාගාමිනීප්‍රතිපදා යයි කියනු ලැබේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "39"
            },
            {
                "type": "centered",
                "text": "7. 2. 10.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "විභඞ්‌ග සූත්‍රය",
                "level": 1
            },
            {
                "text": "3142. මහණෙනි, මේ සතර සෘද්ධිපාද වඩන ලද්දේ බහුල කරන ලද්දේ මහත්ඵල මහානිසංස වේ. මහණෙනි, කෙසේ වඩන ලද කෙසේ බහුල කරන ලද සතර සෘද්ධිපාද මහත්ඵල මහානිසංස වේ ද යත්: මහණෙනි, මෙසස්නෙහි මහණ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මෙසේ මාගේ ඡන්දය ඉතා සැඟවුණේ නො ද වන්නේ ය. ඉතා දැඩි කොට ගන්නා ලද්දේ නො ද වන්නේ ය. ඇතුළත හැකුළුණේ නො ද වන්නේ ය. පිටත විසුරුණේ නො ද වන්නේ ය ... පච්ඡාපුරෙ සඤ්ඤා ඇත්තේ ද වෙසේ. මෙසේ විවෘත වූ හාත්පසින් නො බැඳුණු සිතින් බැබළුම් සහිත සිත වඩයි. විරියසමාධි ... චිත්තසමාධි ... වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මෙසේ මාගේ වීමංසාව ඉතා සැඟවුණේ නො ද වන්නේ ය. ඉතා දැඩි කොට ගන්නා ලද්දේ නො ද වන්නේ ය. ඇතුළත හැකුළුණේ නො ද වන්නේ ය. පිටත විසුරුණේ නො ද වන්නේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "“පෙර යම්සේ නම් පසුත් එසේ ය. පසු යම්සේ නම් පෙරත් එසේ ය. යට යම් සේ නම් උඩත් එසේ ය. උඩ යම්සේ නම් යටත් එසේ ය. දහවල යම් සේ නම් රෑත් එසේ ය. රෑ යම්සේ නම් දහවලුත් එසේ ය”යි පච්ඡා පුරෙසඤ්ඤා ඇත්තේ ද වෙසේ. "
            },
            {
                "type": "paragraph",
                "text": "මෙසේ විවෘත වූ හාත්පසින් නො බැඳුණු සිතින් බැබළුම් සහිත සිත වඩයි."
            },
            {
                "text": "මහණෙනි, ඉතා සැඟවුණු ඡන්දය කවරේ ද යත්: මහණෙනි, යම් ඡන්දයෙක් කුසීතබව සහගියේ කුසීතබව සමග යෙදුණේ වේ ද, මහණෙනි, මේ ඉතා සැඟවුණු ඡන්දය යි කියනු ලැබේ. මහණෙනි, ඉතා දැඩි කොට ගන්නා ලද ඡන්දය කවරේ ද යත්: මහණෙනි, යම් ඡන්දයෙක් උද්ධච්චය සහගියේ උද්ධච්චය සමග යෙදුණේ වේ ද, මහණෙනි, මේ ඉතා දැඩි කොට ගන්නා ලද ඡන්ද යයි කියනු ලැබේ. මහණෙනි, ඇතුළත හැකුළුණු ඡන්දය කවරේ ද යත්: මහණෙනි, යම් ඡන්දයෙක් ථීනමිද්ධය සහගියේ ථීනමිද්ධය සමග යෙදුණේ වේ ද, මහණෙනි, මේ ඇතුළත හැකුළුණු ඡන්ද යයි කියනු ලැබේ. මහණෙනි, පිටත විසුරුණු ඡන්දය කවරේ ද යත්: මහණෙනි, යම් ඡන්දයෙක් පිටත පස්කම්ගුණ ඇරබ අනු ව විසුරුණේ අනු ව විසළේ වේ ද, මහාණනි, මේ පිටත විසුරුණු ඡන්ද යයි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මහණ කෙසේ නම් “පෙර යම්සේ නම් පසුත් එසේ ය. පසු යම්සේ නම් පෙරත් එසේ යයි පච්ඡාපුරෙසඤ්ඤා ඇති ව වෙසේ ද යත්: මහණෙනි, මෙහි මහණහු විසින් පච්ඡාපුරෙසඤ්ඤාව මැනවින් ගන්නා ලද්දී මොනවට මෙනෙහි කරන ලද්දී මැනවින් දරන ලද්දී නුවණින් මොනවට පිළිවිදුනා ලද්දී වේ ද, මහණෙනි, මෙසේ මහණ තෙමේ “පෙර යම්සේ නම් පසුත් එසේ ය. පසු යම්සේ නම් පෙරත් එසේ ය”යි පච්ඡාපුරෙසඤ්ඤා ඇති ව වෙසේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "41"
            },
            {
                "text": "මහණෙනි, කෙසේ නම් මහණ යට යම්සේ නම් උඩත් එසේ ව උඩ යම් සේ නම් යටත් එසේ ව වෙසේ ද යත්: මහණෙනි, මෙහි මහණ පාදතලයෙන් උඩ කෙස්මතුයෙන් යට සිවිය කෙළවර කොට ඇති නන් වැදෑරුම් අසුචියෙන් පිරුණු මේ කය ම ප්‍රත්‍යවෙක්ෂා කෙරෙයි. මේ කයෙහි කෙස් ලොම් නිය දත් සිවි මස් නහර ඇට ඇටමිදුලු වකුගඩු හදමස අක්මා දලබුව බඩදිව පපුමස අතුනු අතුනුබහන් නොපැසුණු අහර පැසුණු අහර පිත් සෙම් පූයා ලේ ඩහ මේදතෙල කඳුළු වුරුණු තෙල කෙල මුකුනු සඳමිදුලු මූ ඇතැ”යි. මහණෙනි, මෙසේ මහණ තෙමේ යට යම් බඳු නම් උඩත් එසේ ව උඩ යම් බඳු නම් යටත් එසේ ව වෙසේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, කෙසේ නම් මහණ දහවල් යම් බඳු නම් රෑත් එසේ ව රෑ යම් බඳු නම් දහවලුත් එසේ ව වෙසේ ද යත්: මහණෙනි, මෙහි මහණ යම් කොටස්වලින් යම් සටහන්වලින් යම් වැටහීම්වලින් දහවල් ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩා ද, හෙතෙමේ ඒ කොටස්වලින් ඒ සටහන්වලින් ඒ වැටහීම් වලින් රෑත් ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. යම් කොටස්වලින් හෝ යම් සටහන්වලින් හෝ යම් වැටහීම්වලින් හෝ රෑ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩා ද, හෙතෙමේ ඒ කොටස්වලින් ඒ සටහන්වලින් ඒ වැටහීම්වලින් දහවලුත් ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මහණෙනි, මෙසේ මහණතෙමේ දහවල් යම් බඳු නම් රෑත් එසේ ව රෑ යම් බඳු නම් දහවලුත් එසේ ව වෙසේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, කෙසේ නම් මහණ විවෘත වූ හාත්පසින් නො බැඳුණු සිතින් බැබළුම් සහිත සිත වඩා ද යත්: මහණෙනි, මෙහි මහණහු විසින් ආලොකසඤ්ඤාව මැනවින් ගන්නා ලද්දී දිවාසඤ්ඤාව මැනවින් තබන ලද්දී වේ ද, මහණෙනි, මෙසේ මහණ විවෘත වූ හාත්පසින් නො බැඳුණු සිතින් බැබළුම් සහිත සිත වඩයි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, ඉතා සැඟවුණු වීර්ය්‍යය කවරේ ද යත්: මහණෙනි, යම් වීර්ය්‍යයෙක් කෝසජ්ජය සහගියේ කෝසජ්ජය සමග යෙදුණේ වේ ද, මහණෙනි, මේ ඉතා සැඟවුණු වීර්ය්‍යය යි කියනු ලැබේ. මහණෙනි, ඉතා දැඩි කොට ගන්නා ලද වීර්ය්‍යය කවරේ ද යත්: මහණෙනි, යම් වීර්ය්‍යයෙක් උද්ධච්චය සහගියේ උද්ධච්චය සමග යෙදුණේ වේ ද, මහණෙනි, යම් ඉතා දැඩි කොට ගන්නා ලද වීර්ය්‍යය යි කියනු ලැබේ. මහණෙනි, ඇතුළත හැකුළුණු වීර්ය්‍යය කවරේ ද යත්: මහණෙනි, යම් වීර්ය්‍යයෙක් ථීනමිද්ධය සහගියේ ථීනමිද්ධය සමග යෙදුණේ වේ ද, මහණෙනි, මේ ඇතුළත හැකුළුණු වීර්ය්‍යය යි කියනු ලැබේ. මහණෙනි, පිටත විසුරුණු වීර්ය්‍යය කවරේ ද යත්: මහණෙනි, යම් වීර්ය්‍යයෙක් පිටත පස්කම් ගුණ ඇරබ අනු ව විසුරුණේ අනු ව විසළේ වේ ද, මහණෙනි, මේ පිටත විසුරුණු වීර්ය්‍යය යි කියනු ලැබේ ... බැබළුම් සහිත සිත වඩයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "43"
            },
            {
                "text": "මහණෙනි, ඉතා සැඟවුණු සිත කවරේ ද යත්: මහණෙනි, යම් සිතෙක් කොසජ්ජය සහගියේ කොසජ්ජය සමග යෙදුණේ වේ ද, මහණෙනි, මේ ඉතා සැඟවුණු සිතැයි කියනු ලැබේ. මහණෙනි, ඉතා දැඩි කොට ගන්නා ලද සිත කවරේ ද යත්: මහණෙනි, යම් සිතෙක් උද්ධච්චය සහගියේ උද්ධච්චය සමග යෙදුණේ වේ ද, මහණෙනි, මේ ඉතා දැඩි කොට ගන්නා ලද සිතැයි කියනු ලැබේ. මහණෙනි, ඇතුළත හැකුළුණු සිත කවරේ ද යත්: මහණෙනි, යම් සිතෙක් ථීනමිද්ධය සහගියේ ථීනමිද්ධය සමග යෙදුණේ වේ ද, මහණෙනි, මේ ඇතුළත හැකුළුණු සිතැයි කියනු ලැබේ. මහණෙනි, පිටත විසුරුණු සිත කවරේ ද යත්: මහණෙනි, යම් සිතෙක් පිටත පස්කම්ගුණ ඇරබ අනු ව විසුරුණේ අනු ව විසළේ වේ ද, මහණෙනි, මේ පිටත විසුරුණු සිතැ යි කියනු ලැබේ ... බැබළුම් සහිත සිත වඩයි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, ඉතා සැඟවුණු වීමංසාව කවරේ ද යත්: මහණෙනි, යම් වීමංසාවක් කොසජ්ජය සහගියේ කොසජ්ජය සමග යෙදුණේ වේ ද, මහණෙනි, මේ ඉතා සැඟවුණු වීමංසා යි කියනු ලැබේ. මහණෙනි, ඉතා දැඩි කොට ගන්නා ලද වීමංසාව කවරේ ද යත්: මහණෙනි, යම් වීමංසාවෙක් උද්ධච්චය සහගියේ උද්ධච්චය සමග යෙදුණේ වේ ද, මහණෙනි, යම් ඉතා දැඩි කොට ගන්නා ලද වීමංසා යි කියනු ලැබේ. මහණෙනි, ඇතුළත හැකුළුණු වීමංසාව කවරේ ද යත්: මහණෙනි, යම් වීමංසාවෙක් ථීනමිද්ධය සහගියේ ථීනමිද්ධය සමග යෙදුණේ වේ ද මහණෙනි, මේ ඇතුළත හැකුළුණු වීමංසා යි කියනු ලැබේ. මහණෙනි, පිටත විසුරුණු වීමංසාව කවරේ ද යත්: මහණෙනි, යම් වීමංසාවෙක් පිටත පස්කම්ගුණ ඇරබ අනු ව විසුරුණේ අනු ව විසළේ වේ ද, මහණෙනි, මේ පිටත විසුරුණු වීමංසා යි කියනු ලැබේ",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, කෙසේ නම් මහණ “පෙර යම්සේ නම් පසුත් එසේ ය. පසු යම්සේ නම් පෙරත් එසේ ය” යි පච්ඡාපුරෙසසඤ්ඤා ඇති ව වෙසේ ද යත්: මහණෙනි, මෙහි මහණහු විසින් පච්ඡාපුරෙසසඤ්ඤාව මැනවින් ගන්නා ලද්දී මැනවින් මෙනෙහි කරන ලද්දී මැනවින් දරන ලද්දී නුවණින් මොනවට පිළිවිදිනා ලද්දී වේ ද මහණෙනි, මෙසේ මහණ “පෙර යමසේ නම් පසුත් එසේ ය. පසු යම්සේ නම් පෙරත් එසේ ය” යි පච්ඡාපුරෙසඤ්ඤා ඇති ව වෙසේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, කෙසේ නම් මහණ යට යමසේ නම් උඩත් එසේ ව උඩ යමසේ නම් යටත් එසේ ව වෙසේ ද යත්: මහණෙනි, මෙහි මහණතෙමේ පාදතලයෙන් උඩ කෙස්මතුවෙන් යට සිවිය කෙළවර කොට ඇති නන් වැදෑරුම් අසුචියෙන් පිරුණු මේ කය ම පස්විකයි. “මේ කයෙහි කෙස් ලොම් ... සඳමිදුලු මූ ඇතැ”යි. මහණෙනි, මෙසේ මහණ යට යම්සේ නම් උඩත් එබඳු ව උඩ යම්සේ නම් යටත් එබඳු ව වෙසේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "45"
            },
            {
                "text": "මහණෙනි, කෙසේ නම් මහණ දහවල් යම්සේ නම් රෑත් එබඳු ව රෑ යම්සේ නම් දහවලුත් එබඳු ව වෙසේ ද යත්: මහණෙනි, මෙහි මහණ යම් කොටස්වලින් යම් සටහන්වලින් යම් වැටහීම්වලින් දහවල් වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩා ද, හෙතෙමේ ඒ කොටස්වලින් ඒ සටහන්වලින් ඒ වැටහීම්වලින් රෑත් වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. යම් කොටස්වලින් හෝ යම් සටහන්වලින් හෝ යම් වැටහීම්වලින් හෝ රැයෙහි වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩා ද, හෙතෙමේ ඒ කොටස්වලින් ඒ සටහන්වලින් ඒ වැටහීම්වලින් දහවලුත් වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මහණෙනි, මෙසේ මහණ දහවල් යම්බඳු නම් රෑත් එසේ ව රෑ යම්බඳු නම් දහවලුත් එසේ ව වෙසේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, කෙසේ නම් මහණ විවෘත වූ හාත්පසින් නොබැඳුණු සිතින් බැබළුම් සහිත සිත වඩා ද යත්; මහණෙනි, මෙහි මහණහු විසින් ආලොකසඤ්ඤාව මැනවින් ගන්නා ලද්දී දිවා සඤ්ඤාව මැනවින් පිහිටුවන ලද්දී වේ ද, මහණෙනි, මෙසේ මහණ විවෘත වූ හාත්පසින් බැබළුණු සිතින් බැබළුම් සහිත සිත වඩයි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මෙසේ වඩන ලද මෙසේ බහුල කරන ලද සිවු ඉදුපා මහත්ඵල මහානිසංස වේ. මහණෙනි, මහණ සිවු ඉදුපා මෙසේ වැඩූ කල්හි මෙසේ බහුල කළ කල්හි නන් වැදෑරුම් ඉදුකොටස් විඳී: එකෙක් ව ද බොහෝ අයුරු වේ ... බඹලොව තෙක් දු කයින් වසයෙහි පවත්වයි. මහණෙනි, මහණ සිවු ඉදුපා මෙසේ වැඩූ කල්හි මෙසේ බහුල කළ කල්හි ආස්‍රව ක්‍ෂය කිරීමෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලප්‍රඥාවත් දිටුදැමියෙහි ම තෙමේ වෙසෙසින් දැන පසක් කොට එයට පැමිණ වෙසේ යි.",
                "type": "paragraph"
            },
            {
                "text": "දෙවැනි පාසාදකම්පනවර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රනාමාවලිය:**",
                "type": "unindented"
            },
            {
                "text": "හෙතු, මහප්ඵල, ඡන්ද, මොග්ගල්ලාන, බ්‍රාහ්මණ, මහිද්ධික, ඉද්ධිවිධ, භික්ඛු, භාවනා, විභඞ්ග යී දශසූත්‍රාන්ත කෙනෙකි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "47"
            },
            {
                "text": "3. අයොගුළ වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "7. 3. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මග්‌ග සූත්‍රය",
                "level": 1
            },
            {
                "text": "3143. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "මහණෙනි, සම්බොධියෙන් පළමු ම බුදුබවට නො පැමිණි බෝසත් වූ ම මට මේ සිත විය: “ඉදුපා වැඩුමට මඟ කවරේ ද, පිළිවෙත කවරේ දැ”යි. මහණෙනි, ඒ මට මෙබඳු සිතෙක් විය: මෙහි මහණ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මෙසේ මාගේ ඡන්දය ඉතා සැඟවුණේ නො ද වන්නේ ය ... බැබළුම් සහිත සිත වඩයි. විරියසමාධි ... චිත්තසමාධි... විමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මෙසේ මාගේ වීමංසාව ඉතා සැඟවුණේ නො ද වන්නේ ය. ඉතා දැඩි කොට ගන්නා ලද්දේ නො ද වන්නේ ය. ඇතුළත හැකුළුණේ නො ද වන්නේ ය. පිටත විසුරුණේ නොද වන්නේ ය.",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "“පෙර යම්සේ නම් පසුත් එසේ ය. පසු යම්සේ නම් පෙරත් එසේ ය. යට යම්සේ නම් උඩත් එසේ ය. උඩ යම්සේ නම් යටත් එසේ ය. දහවල් යම්සේ නම් රෑත් එසේ ය. රෑ යම්සේ නම් දහවලුත් එසේ ය”යි. පච්ඡාපුරෙසඤ්ඤා ඇත්තේ ද වෙසෙයි."
            },
            {
                "type": "paragraph",
                "text": "මෙසේ විවෘත වූ හාත්පසින් නො බැඳුණු සිතින් බැබළුම් සහිත සිත වඩයි."
            },
            {
                "text": "මහණෙනි, මහණ සිවු ඉදුපා මෙසේ වැඩූ කල්හි මෙසේ බහුල කළ කල්හි නන් වැදෑරුම් ඉදුකොටස් විඳී: එකෙක් ව ද බොහෝ අයුරු වේ. ... බඹලොව තෙක් දු කයින් වසයෙහි පවත්වයි. මහණෙනි, මහණ සිවු ඉදුපා මෙසේ වැඩූ කල්හි මෙසේ බහුල කළ කල්හි ආස්‍රවයන් ක්‍ෂය කිරීමෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලප්‍රඥාවත් දිටුදැමියෙහි ම තෙමේ වෙසෙසින් දැන පසක් කොට එයට පැමිණ වෙසේ යි.",
                "type": "paragraph"
            },
            {
                "text": "(ෂඩභිඥා විතර කටයුතු.)",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 3. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අයොගුළ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3144. එකල්හි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පස් ව හුන්හ. එකත්පස් ව හුන් ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැලකළහ: “වහන්ස, භාග්‍යවතුන් වහන්සේ සෘද්ධියෙන් මනොමයකයින් බඹලොවට එළඹිසේක් දැන වදාරන සේක් දැ”යි. ආනන්ද, මම සෘද්ධියෙන් මනොමයකයින් බඹලොවට එළඹියෙම් දනිමි යි. “වහන්ස, භාග්‍යවතුන් වහන්සේ මේ චාතුම්මහාභූතික කයින් සෘද්ධියෙන් බඹලොවට එළඹෙන්නට හැකිසේක් දැ”යි. ආනන්ද, මම මේ චාතුම්මහාභූතික කයින් සෘද්ධියෙන් බඹලොවට එළඹෙන්නට හැකි වෙමි යි. වහන්ස, භාග්‍යවතුන් වහන්සේ සෘද්ධියෙන් මනොමයකයින් බඹලොවට එළඹෙන්නට හැකි සේක: වහන්ස, භාග්‍යවතුන් වහන්සේ මේ චාතුම්මහාභූතික කයින් සෘද්ධියෙන් බඹලොවට එළඹියේක් දතිමි යි. වහන්ස, ඒ මෙය භාග්‍යවතුන් වහන්සේගේ ඇසිරියෙක්ද පුදුමයෙක්ද වේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "49"
            },
            {
                "text": "ආනන්ද තථාගතයෝ අසිරි වූවාහුත් අසිරි දහමින් යුතු වූවාහුත් වෙති. ආනන්ද, තථාගතයෝ පුදුම වූවාහුත් පුදුම දහමින් යුතු වූවාහුත් වෙති. ආනන්ද, යම් සමයක තථාගත තෙමේ කයත් සිතෙහි නඟා ද, සිතත් කයෙහි නඟා ද, සුඛසංඥාවත් ලඝුසංඥාවත් කයෙහි බහා වෙසේ ද, ආනන්ද, එසමයෙහි තථාගතයන්ගේ කය ඉතා සැහැල්ලුත් ඉතා මෘදුත් ඉතා කර්මණ්‍යත් ඉතා බබළනසුලුත් වෙයි. ආනන්ද, දවසක් මුළුල්ලෙහි තැවුණු යවටෙක් යම්සේ ඉතා සැහැල්ලුත් ඉතා මෘදුත් ඉතා කර්මණ්‍යත් ඉතා ප්‍රභාස්වරත් වේ ද, ආනන්ද, එසෙයින් ම තථාගතතෙමේ යම් සමයක කයත් සිතෙහි නඟා ද, සිතත් කයෙහි නඟා ද, සුඛසංඥාවත් ලඝුසංඥාවත් කයෙහි බහා වෙසේ ද, ආනන්ද, එසමයෙහි තථාගතයන්ගේ කය ඉතා ලඝුත් ඉතා මෘදුත් ඉතා කර්මණ්‍යත් ඉතා ප්‍රභාස්වරත් වේ.",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, යම් කලෙක තථාගත තෙමේ කයත් සිතෙහි නඟා ද, සිතත් කයෙහි නඟා ද, සුඛසංඥාවත් ලඝුසංඥාවත් කයෙහි බහා වෙසේ ද, ආනන්ද, එකල්හි තථාගතයන්ගේ කය නිතැතින් ම පොළොවෙන් අහසට නඟී. හේ නන් වැදෑරුම් ඉදු කොටස් විඳී. එකෙක් ව ද බොහෝ අයුරු වේ. ... බඹලොව තෙක් දු කයෙන් වසයෙහි පවත්වයි. ආනන්ද, යම්සේ හිඹුල්පුලුන් හෝ කපුපුලුන් හෝ සැහැල්ලු වූයේ වාතය විසින් ගන්නා ලද්දේ නිතැතින් ම පොළොවෙන් අහසට නඟි යි. ආනන්ද, එසෙයින් ම යම් සමයෙක තථාගත තෙමේ කයත් සිතෙහි නඟා ද, සිතත් කයෙහි නඟා ද, සුඛසංඥාවත් ලඝුසංඥාවත් කයෙහි බහා වෙසේ ද, ආනන්ද, එසමයෙහි තථාගතයන්ගේ කය නිතැතින් ම පොළොවෙන් අහසට නඟී. හේ නන්වැදෑරුම් ඉදුකොටස් විඳී. එකෙක් ව ද බොහෝ අයුරු වේ ... බඹලොව තෙක්දු කයෙන් වසයෙහි පවත්වා යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 3. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "භික්‌ඛු සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3145. මහණෙනි, මේ ඉද්ධිපාද සතරෙකි. කවර සතරෙක්ද යත්: මහණෙනි, මෙසස්නෙහි මහණ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. විරියසමාධි ... චිත්තසමාධි ... වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මහණෙනි, මේ ඉද්ධිපාද සතර යි. මහණෙනි, මේ සිවු ඉදුපා වැඩූ බැවින් බහුල කළ බැවින් මහණ ආස්‍රවයන් ක්‍ෂය කිරීමෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලප්‍රඥාවත් දිටුදැමියෙහි ම තෙමේ වෙසෙසින් දැන පසක් කොට එයට පැමිණ වෙසේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "51"
            },
            {
                "type": "centered",
                "text": "7. 3. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුද්‌ධක සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3146. මහණෙනි, මේ ඉද්ධිපාද සතරෙකි. කවර සතරෙක් ද යත්: මහණෙනි, මෙසස්නෙහි මහණ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. විරියසමාධි ... චිත්තසමාධි ... විමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මහණෙනි, මේ සිවු ඉදුපා යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 3. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඵල සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3147. මහණෙනි, මේ ඉදුපා සතරෙකි. කවර සතරෙක් ද යත්: මහණෙනි, මෙසස්නෙහි මහණ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. විරියසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. චිත්තසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මහණෙනි, මේ සිවු ඉදුපා යි. මහණෙනි, මේ සතර ඉද්ධිපාද වැඩූ බැවින් බහුල කළ බැවින් ඵලදමය අතුරෙන් එක්තරා ඵලයක් කැමති විය යුතු. දිටුදැමියෙහි ම රහත් බව හෝ උපාදානසෙස ව ඇති කල්හි අනගැමි බව හෝ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 3. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතියඵල සූත්‍රය",
                "level": 1
            },
            {
                "text": "3148. මහණෙනි, මේ ඉදුපා සතරෙකි. කවර සතරෙක් ද යත්: මහණෙනි, මෙහි මහණ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. විරියසමාධි ... චිත්තසමාධි ... වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මහණෙනි, මේ සතර ඉද්ධිපාද යි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මේ සතර ඉද්ධිපාද වැඩූ බැවින් බහුල කළ බැවින් සත් ඵල කෙනෙක් සත් අනුසස් කෙනෙක් කැමති විය යුතු. කවර සත් ඵල කෙනෙක් සත් අනුසස් කෙනෙක් ද යත්: දිටුදැමියෙහි ම පෙරාතු ව රහත් බව ලබයි. ඉදින් දිටුදැමියෙහි ම පෙරාතු ව රහත් බව නො ලබා නම් එකල්හි මරණසමයෙහි රහත් බව ලබයි. ඉදින් දිටුදැමියෙහි ම පෙරාතු ව රහත් බව නො ලබා නම් ඉදින් මැරෙන කල්හි රහත් බව නො ලබා නම් එකල්හි පස් ඔරම්භාගිය සංයොජනයන් ක්‍ෂය කිරීමෙන් අතර කෙලෙස් පිරිනිවෙනින් පිරිනිවෙනසුලු වේ. (ආයුමැද ඉක්මවා) ආයුකෙළවරට ළං ව කෙලෙස්පිරිනිවෙනින් පිරිනිවෙනසුලු වෙයි. පියෝ නැති ව කෙලෙස්පිරිනිවෙනින් පිරිනිවෙනසුලු වෙයි. පියෝ ඇති ව කෙලෙස් පිරිනිවෙනින් පිරිනිවෙනසුලු වෙයි. අකනිට්ඨගාමී උද්ධංසොත වෙයි. මහණෙනි, මේ සිවු ඉදුපා වැඩූ බැවින් බහුල කළ බැවින් මේ සත්පල සත් අනුසස් කැමති විය යුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "53"
            },
            {
                "type": "centered",
                "text": "7. 3. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආනන්‌ද සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3149. එකල්හි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ ... එකත්පස් ව හුන් ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැලකළහ: “වහන්ස, ඉද්ධි කවරේ ද ඉදධිපාද කවරේ ද ඉද්ධිපාදභාවනා කවරේ ද ඉද්ධිපාදභාවනාගාමිනීපටිපදා කවරේ දැ”යි.",
                "type": "paragraph"
            },
            {
                "text": "ආනන්ද, මෙහි මහණ නන් වැදෑරුම් ඉදුකොටස් විඳියි: “එකෙක් ව ද බොහෝ අයුරු වේ ... බඹලොව තෙක් දු කයින් වසයෙහි පවත්වයි”. ආනන්ද, මේ ඉදු යි කියනු ලැබේ. ආනන්ද, ඉදුපා කවරේ ද යත්: ආනන්ද, යම් මඟෙක් යම් පිළිවෙතෙක් ඉදු ලැබුම ඉදු පිළිලැබුම පිණිස පවතී නම් ආනන්ද, මේ ඉදුපා යි කියනු ලැබේ. ආනන්ද, ඉදුපා වැඩුම කවරේද යත්: ආනන්ද, මෙහි මහණ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. විරියසමාධි ... චිත්තසමාධි ... වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. ආනන්ද, මේ ඉදුපා වැඩුමැ යි කියනු ලැබේ. ආනන්ද, ඉදුපා වැඩුමට පමුණුවන පිළිවෙත කවරේ ද යත්: මේ අරිඅටඟි මඟ මැ යි. එනම්: සම්මාදිට්ඨි ... සම්මාසමාධි යි. ආනන්ද, මේ ඉදුපා වැඩුමට පමුණුවන පිළිවෙතැයි කියනු ලැබේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 3. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය ආනන්‌ද සූත්‍රය",
                "level": 1
            },
            {
                "text": "3150. එකත්පස් ව හුන් ආයුෂ්මත් ආනන්ද තෙරණුවන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “ආනන්ද, ඉදු කවරේ ද, ඉදුපා කවරේ ද, ඉදුපා වැඩුම කවරේ ද, ඉදුපා වැඩුමට පමුණුවන පිළිවෙත කවරේ ද”යි. වහන්ස, අපගේ දහම්හු භගවත්හු මුල් කොට ඇතියහ ... ආනන්ද, මෙහි මහණ නන් වැදෑරුම් ඉදුකොටස් විඳියි ... ආනන්ද, මේ ඉදුපා වැඩුමට පමුණුවන පිළිවෙතැ යි කියනු ලැබේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 3. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සම්බහුලභික්‌ඛු සූත්‍රය",
                "level": 1
            },
            {
                "text": "3151. එකල්හි බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ ... එකත් පස් ව හුන් ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙය සැලකළහ: “වහන්ස, ඉදු කවරේ ද, ඉදුපා කවරේ ද, ඉදුපා වැඩුම කවරේ ද, ඉදුපා වැඩුමට පමුණුවන පිළිවෙත කවරේ දැ”යි. මහණෙනි, මෙහි මහණ නන් වැදෑරුම් ඉදුකොටස් විඳී: එකෙක් ව ද බොහෝ අයුරු වේ ... මහණෙනි, මේ ඉදුපා වැඩුමට පමුණුවන පිළිවෙතැ යි කියනු ලැබේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "55"
            },
            {
                "type": "centered",
                "text": "7. 3. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතියසම්බහුලභික්‌ඛු සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3152. එකල්හි බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ ... එකත්පසෙක හුන් ඒ භික්ෂූන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “මහණෙනි, ඉදු කවරේ ද, ඉදුපා කවරේ ද, ඉදුපා වැඩුම කවරේ ද, ඉදුපා වැඩුමට පමුණුවන පිළිවෙත කවරේ දැ”යි. වහන්ස, අපගේ දහම්හු භගවත්හු මුල් කොට ඇතියහ ...",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, ඉදු කවරේ ද යත්: මහණෙනි, මෙහි මහණ නන්වැදෑරුම් ඉදු කොටස් විඳී. එකෙක් ව ද බොහෝ අයුරු වේ ... බඹලොව තෙක් දු කයෙන් වසයෙහි පවත්වයි. මහණෙනි, මේ ඉදු යි කියනු ලැබේ. මහණෙනි, ඉදුපා කවරේ ද යත්: මහණෙනි, යම් මඟෙක් යම් පිළිවෙතෙක් ඉදු ලැබුම ඉදු පිළිලැබුම පිණිස පවතී ද, මහණෙනි, මේ ඉදුපා යි කියනු ලැබේ. මහණෙනි, ඉදුපා වැඩුම කවරේ ද යත්: මහණෙනි, මෙහි මහණ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. විරියසමාධි … චිත්තසමාධි … වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මහණෙනි, මේ ඉදුපා වැඩුමැ යි කියනු ලැබේ. මහණෙනි, ඉදුපා වැඩුමට පමුණුවන පිළිවෙත කවරේ ද යත්: මේ අරීඅටඟිමගමැ යි. එනම්: සම්මාදිට්ඨි … සම්මාසමාධි යි. මහණෙනි, මේ ඉදුපා වැඩුමට පමුණුවන පිළිවෙතැ යි කියනු ලැබේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 3. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මොග්‌ගල්‌ලාන සූත්‍රය",
                "level": 1
            },
            {
                "text": "3153. මහණෙනි, ඒ කිමැයි හඟිවු ද? කවර දහම් වැඩූ බැවින් බහුල කළ බැවින් මුගලන් මහණ මෙබඳු මහත් සෘද්ධි ඇත්තේ මෙබඳු අනුභාව ඇත්තේ දැ යි. වහන්ස, අපගේ දහම්හු භගවත්හු මුල් කොට ඇතියහ. ... මහණෙනි, සිවු ඉදුපා වැඩූ බැවින් බහුල කළ බැවින් මුගලන් මහණ මෙබඳු මහත් සෘද්ධි ඇත්තේ මෙබඳු මහත් අනුභාව ඇත්තේ ය. කවර සිවු ඉදුපා ද යත්: මහණෙනි, මෙහි මුගලන් මහණ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මෙසේ මාගේ ඡන්දය ඉතා සැඟවුණේ නො ද වන්නේය ... බැබළුම් සහිත සිත වඩයි. විරියසමාධි ... චිත්තසමාධි ... වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මෙසේ මාගේ වීමංසාව ඉතා සැඟවුණේ නො ද වන්නේය. ඉතා දැඩි කොට ගන්නා ලද්දේ නො ද වන්නේ ය ... මෙසේ විවෘත වූ හාත්පසින් නො බැඳුණු සිතින් බැබළුම් සහිත සිත වඩයි. මහණෙනි, මේ සිවු ඉදුපා වැඩූ බැවින් බහුල කළ බැවින් මුගලන් මහණ මෙබඳු මහත් සෘද්ධි ඇත්තේ ය. මෙබඳු මහත් අනුභාව ඇත්තේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "57"
            },
            {
                "text": "මහණෙනි, මේ සිවු ඉදුපා ම වැඩූ බැවින් බහුල කළ බැවින් මුගලන් මහණ මෙසේ නන් වැදෑරුම් ඉදු කොටස් විඳී: “එකෙක් ව ද බොහෝ අයුරු වේ ... බඹලොව තෙක් දු කයින් වයයෙහි පවත්ව”යි. මහණෙනි, මේ සිවු ඉදුපා ම වැඩූ බැවින් බහුල කළ බැවින් මුගලන් මහණ ආස්‍රව ක්‍ෂය කිරීමෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලප්‍රඥාවත් දිටුදැමියෙහි ම තෙමේ වෙසෙසින් දැන පසක් කොට එයට පැමිණ වෙසේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 3. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තථාගත සූත්‍රය",
                "level": 1
            },
            {
                "text": "3154. මහණෙනි, ඒ කිමැ යි හඟිවු ද? කවර දහම් වැඩූ බැවින් බහුල කළ බැවින් තථාගත තෙමේ මෙබඳු මහත් සෘද්ධි ඇත්තේ මෙබඳු අනුභාව ඇත්තේ දැ යි. වහන්ස, අපගේ දහම් භගවත්හු මුල් කොට ඇතියහ ... මහණෙනි, සිවු ඉදුපා වැඩූ බැවින් බහුල කළ බැවින් තථාගත තෙමේ මෙබඳු මහත් සෘද්ධි ඇත්තේ මෙබඳු අනුභාව ඇත්තේ ය. කවර සිවු ඉදුපා ද යත්: මහණෙනි, මෙහි තථාගත තෙමේ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මෙසේ මාගේ ඡන්දය ඉතා හැකුළුණේ නො ද වන්නේ ය. ඉතා දැඩි කොට ගන්නා ලද්දේ නො ද වන්නේ ය ... මෙසේ විවෘත වූ හාත්පසින් තොබැඳුණු සිතින් බැබළුම් සහිත සිත වඩයි. විරියසමාධි ... චිත්තසමාධි ... වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මෙසේ මාගේ වීමංසාව ඉතා සැඟවුණේ නො ද වන්නේය. ඉතා දැඩි කොට ගන්නා ලද්දේ නො ද වන්නේ ය. ඇතුළත හැකුළුණේ නො ද වන්නේ ය. පිටත විසුරුණේ නො ද වන්නේ ය ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "“පෙර යම්සේ නම් පසුත් එබඳු ය. පසු යම්සේ නම් පෙරත් එබඳු ය. යට යම්සේ නම් උඩත් ඵබඳු ය. උඩ යම්සේ නම් යටත් එබඳු ය. දහවල් යම්සේ නම් රෑත් එබඳු ය. රෑ යම්සේ නම් දහවලුත් එබඳු ය”යි පසු පෙර හැඟීම් ඇත්තේ ද වෙසේ. "
            },
            {
                "type": "paragraph",
                "text": "මෙසේ විවෘත වූ හාත්පසින් __තො__බැඳුණු සිතින් බැබළුම් සහිත සිත වඩයි."
            },
            {
                "type": "paragraph",
                "text": "මහණෙනි, මේ සිවු ඉදුපා වැඩූ බැවින් බහුල කළ බැවින් තථාගත තෙමේ මෙබඳු මහත් සෘද්ධි ඇත්තේ මෙබඳු අනුභාව ඇත්තේ ය. මහණෙනි, මේ සිවු ඉදුපා ම වැඩූ බැවින් බහුල කළ බැවින් තථාගත තෙමේ නන් වැදෑරුම් ඉදු කොටස් විඳී: එකෙක් ව ද බොහෝ අයුරු වේ ... බඹලොව තෙක් දු කයින් වසයෙහි පවත්වයි. මහණෙනි, මේ සිවු ඉදුපා ම වැඩූ බැවින් බහුල කළ බැවින් තථාගත තෙමේ ආස්‍රවයන් ක්‍ෂය කිරීමෙන් අනාස්‍රව වූ ඵලසමාධියත් ඵලප්‍රඥාවත් ඉහාත්මයෙහි ම තෙමේ වෙසෙසින් දැන පසක් කොට එයට පැමිණ වෙසේ යි. "
            },
            {
                "text": "(ෂඩභිඥා විතර කටයුතු.)",
                "type": "paragraph"
            },
            {
                "text": "තෙවැනි අයොගුළවර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රනාමාවලිය:**",
                "type": "unindented"
            },
            {
                "text": "මග්ග, අයොගුළ, භික්ඛු, සුද්ධක යි සූත්‍ර සතරෙකි. ඵලසූත්‍ර දෙකෙකි. ආනන්ද නමින් ද දෙකෙක් කියන ලදී, සම්බහුලභික්ඛු සූත්‍ර ද දෙකෙකි. එකොළොස්වැන්න මොග්ගල්ලාන ය, දොළොස් වන්න තථාගත ය යි සූත්‍ර මුළුල්ල දොළොසෙකි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "59"
            },
            {
                "text": "4. ගඞ්‌ගාපෙය්‍යාල වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "7. 4. 1 - 48",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පාචීනනින්නාදි සූත්‍ර",
                "level": "1"
            },
            {
                "text": "3155 - 3202. මහණෙනි, යම්සේ ගඞ්ගා නදී තොමෝ පැදුන්දිගට නැමුණි පැදුන්දිගට නැඹුරු වූවා පැදුන්දිගට බර වූවා වේ ද ... නිවනට බර වුයේ වේ යි.",
                "type": "paragraph"
            },
            {
                "text": "(ඉද්ධිපාද විසින් විතර කටයුතු)",
                "type": "paragraph"
            },
            {
                "text": "සිවුවැනි ගඞ්ගාපෙය්‍යාලවර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රනාමමාලාව:**",
                "type": "unindented"
            },
            {
                "text": "පාචීනනින්නචතුෂ්ක සයෙකි. සමුද්දනින්න චතුෂ්ක ද සයෙකි. මේ ෂට්කදෙක දොළසෙක් වේ. එයින් වර්ග යි කියනු ලැබේ. සූත්‍ර මුළුල්ල අටසාළිසෙකි.",
                "type": "paragraph"
            },
            {
                "text": "5. අප්‌පමාද වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "7. 5. 1 - 40",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තථාගතාදි සූත්‍ර",
                "level": "1"
            },
            {
                "text": "3203 - 3242. මහණෙනි, අපා වූ ද දෙපා වූ ද සිවුපා වූ ද බහුපා වූ ද යම් තාක් සත්වයෝ වෙත් ද ... බහුල කෙරේ යි.",
                "type": "paragraph"
            },
            {
                "text": "පස්වැනි අප්පමාදවර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍ර නාමාවලිය:**",
                "type": "unindented"
            },
            {
                "text": "තථාගත, පද, කූට, මූල, සාර, වස්සික, රාජ, චන්දිම, සුරිය, වත්ථ යි චතුෂ්කදශයෙකි, සාලිස්සුතුරෙකි.",
                "type": "paragraph"
            },
            {
                "text": "6. බලකරණීය වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "7. 6. 1 - 48",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "බලාදි සූත්‍ර",
                "level": 1
            },
            {
                "text": "3243 - 3290. මහණෙනි, යම්සේ යම් කිසි බලකරණිය කර්මාන්තයෝ කරනු ලැබෙත් ද ... බහුල කෙරෙයි.",
                "type": "paragraph"
            },
            {
                "text": "**සවැනි බලකරණීය වර්ග යි.**",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍ර නාමාවලිය:**",
                "type": "unindented"
            },
            {
                "text": "බල, බීජ, නාග, රුක්ඛ, කුම්භ, සූක, ආකාස යි චතුෂ්ක සතෙකි. මෙඝචතුෂ්ක දෙකෙකි. නාවා, ආගන්තුක, නදී යි චතුෂ්ක තුනෙකි. මුළුල්ල දොළොසකි. සුතුරු අටසාලිසෙකි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "61"
            },
            {
                "text": "7. එසනා වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "7. 7. 1 - 160",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "එසනාදි සූත්‍ර",
                "level": "1"
            },
            {
                "text": "3291 - 3450. මහණෙනි, මේ එසනා තුනෙකි, කවර තුනෙක් ද යත්: ... වැඩිය යුතුයි.",
                "type": "paragraph"
            },
            {
                "text": "(විවෙක නිස්සිතාදි විසිනුදු පරිඤ්ඤා අභිඤ්ඤා පරික්ඛය පහාන විසිනුදු එකෙක සොළොස සොළොස කොට එක්සිය සැට සුත්‍රාන්ත කෙනෙක් විතර කටයුතු.)",
                "type": "paragraph"
            },
            {
                "text": "සත්වැනි එසනාවර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රනාමාවලිය:**",
                "type": "unindented"
            },
            {
                "text": "එසනා, විධා, ආසව, භව, දුක්ඛතා, ඛීල, මල, නීඝ, වෙදනා, තණ්හා යි ෂොඩශක දශයෙකි. එක්සිය සැටසුතුරෙකි.",
                "type": "paragraph"
            },
            {
                "text": "8. ඔඝ වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "7. 8. 1 - 159",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඔඝාදි සූත්‍ර",
                "level": "1"
            },
            {
                "text": "3451 - 3609. මහණෙනි, මේ ඔඝ සතරෙකි. කවර සතරෙක් ද යත්: කාමොඝ භවොඝ දිට්ඨොග අවිජ්ජොඝ යි ... වැඩිය යුතු යි ...",
                "type": "paragraph"
            },
            {
                "text": "(කී නයින් ම විතර කටයුතු.)",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 8. 160",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "උද්ධම්භාගිය සූත්‍රය",
                "level": "1"
            },
            {
                "text": "3610. මහණෙනි, මේ උද්ධම්භාගිය සංයොජන පසෙකි, කවර පසෙක්ද යත්: රූපරාග අරූපරාග මාන උද්ධච්ච අවිජ්ජා යි. මහණෙනි, මොහු පස් උද්ධම්භාගිය සංයොජනයෝ යි. මහණෙනි, මේ පස් උද්ධම්භාගිය සංයොජනයන් ප්‍රහාණය පිණිස සිවු ඉදුපා වැඩියයුතු. කවර සිවු ඉදුපාද යත්: මහණෙනි, මෙහි මහණ ඡන්දසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. විරියසමාධි ... චිත්තසමාධි ... වීමංසාසමාධිපධානසඞ්ඛාරසමන්නාගත ඉද්ධිපාදය වඩයි. මහණෙනි, මේ පස් උද්ධම්භාගිය සංයොජනයන් පහනු පිණිස මේ සිවු ඉදුපා වැඩියයුතු යි.",
                "type": "paragraph"
            },
            {
                "text": "අටවැනි ඔඝවර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රනාමාවලිය:**",
                "type": "unindented"
            },
            {
                "text": "ඔඝ, යොග, උපාදාන, ගන්ථ, අනුසය, කාමගුණ, නීවරණ, බන්ධ, ඔරම්භාගිය, උද්ධම්භාගිය යි ෂොඩෂක දශයෙකි. සුතුරු එක්සියසැටෙකි.",
                "type": "paragraph"
            },
            {
                "text": "ඉද්ධිපාදසංයුත්තය නිමියේය.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි වර්ගනාමාවලිය:**",
                "type": "unindented"
            },
            {
                "text": "චාපාල, පාසාදකම්පන, අයොගුළ යන මොහු ගඞ්ගාපෙය්‍යාල ආදි පස සමග ඉද්ධිපාද සංයුත්තයෙහි වර්ග අටෙක් වේ.",
                "type": "paragraph"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ]
    }
]