[
    {
        "filename": "dn-mhv-8",
        "bookId": 11,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "396"
            },
            {
                "type": "centered",
                "text": "8.",
                "level": 3
            },
            {
                "type": "heading",
                "text": "සක්කපඤ්හසුත්තං",
                "level": 3
            },
            {
                "type": "paragraph",
                "text": "එවං මෙ සුතං එකං සමයං භගවා මගධෙසු විහරති, පාචීනතො රාජගහස්ස අම්බසණ්ඩා නාම බ්රාහ්මණගාමො, තස්සුත්තරතො වෙදියකෙ පබ්බතෙ ඉන්දසාලගුහායං. තෙන ඛො පන සමයෙන සක්කස්ස දෙවානමින්දස්ස උස්සුක්කං උදපාදි භගවන්තං දස්සනාය. අථ ඛො සක්කස්ස දෙවානමින්දස්ස එතදහොසි: කහං නු ඛො භගවා එතරහි විහරති අරහං සම්මාසම්බුද්ධොති. අද්දසා ඛො සක්කො දෙවානමින්දො භගවන්තං මගධෙසු විහරන්තං, පාචීනතො රාජගහස්ස අම්බසණ්ඩා නාම බ්රාහ්මණගාමො, තස්සුත්තරතො වෙදියකෙ පබ්බතෙ ඉන්දසාලගුහායං. දිස්වාන දෙවෙ තාවතිංසෙ ආමන්තෙසි: අයං මාරිසා භගවා මගධෙසු විහරති පාචීනතො රාජගහස්ස අම්බසණ්ඩා නාම බ්රාහ්මණගාමො තස්සුත්තරතො වෙදියකෙ පබ්බතෙ ඉන්දසාලගුහායං. යදි පන මාරිසා මයං තං භගවන්තං දස්සනාය උපසඞ්කමෙය්යාම අරහන්තං සම්මාසම්බුද්ධන්ති. එවං භද්දන්තවාති ඛො දෙවා තාවතිංසා සක්කස්ස දෙවානමින්දස්ස පච්චස්සොසුං."
            },
            {
                "type": "paragraph",
                "text": "2. අථ ඛො සක්කො දෙවානමින්දො පඤ්චසිඛං ගන්ධබ්බදෙවපුත්තං{1 ගන්ධබ්බපුත්තං - ස්යා.} ආමන්තෙසි: අයංතාත පඤ්චසිඛ භගවා මගධෙසු විහරති, පාචීනතො රාජගහස්ස අම්බසණ්ඩා නාම බ්රාහ්මණගාමො, තස්සුත්තරතො වෙදියකෙ පබ්බතෙ ඉන්දසාලගුහායං. යදි පන තාත පඤ්චසිඛ මයං තං භගවන්තං දස්සනාය උපසඞ්කමෙය්යාම අරහන්තං සම්මාසම්බුද්ධන්ති”. “එවං භද්දන්තවා’ති ඛො පඤ්චසිඛො ගන්ධබ්බදෙවපුත්තො සක්කස්ස දෙවානමින්දස්ස පටිස්සුත්වා බෙලුවපණ්ඩුං වීණං ආදාය සක්කස්ස දෙවානමින්දස්ස දනුචරියං උපාගමි. අථ ඛො සක්කො දෙවානමින්දො දෙවෙහි තාවතිංසෙහි පරිවුතො පඤ්චසිඛෙන ගන්ධබ්බදෙවපුත්තෙන පුරක්ඛතො. සෙය්යථාපි නාම බලවා පුරිසො සමිඤ්ජිතං වා බාහං පසාරෙය්ය පසාරිතං වා බාහං සමිඤ්ජෙය්ය, එවමෙව දෙවෙසු තාවතිංසෙසු අන්තරහිතො මගධෙසු පාචීනතො රාජගහස්ස අම්බසණ්ඩා නාම බ්රාහ්මණගාමො, තස්සුත්තරතො වෙදියකෙ පබ්බතෙ පච්චුට්ඨාසි."
            },
            {
                "type": "page-break",
                "text": "398"
            },
            {
                "type": "paragraph",
                "text": "3. තෙන ඛො පන සමයෙන වෙදියකො පබ්බතො අතිරිව ඔභාසජාතො හොති අම්බසණ්ඩා ච බ්රාහ්මණගාමො, යථා තං දෙවානං දෙවානුභාවෙන. අපිස්සුදං පරිතො ගාමෙසු මනුස්සා එවමාහංසු: ආදිත්තස්සු නාමජ්ජ වෙදියකො පබ්බතො ඣායතිස්සු{1 ඣායතිසු - මඡසං. ඣායතස්සු - ස්යා.} නාමජ්ජ වෙදියකො පබ්බතො, ජලතිස්සු{2 ජලතිසු - මඡසං. ජලතස්සු - ස්යා. ජලිතස්සු - PTS.} නාමජ්ජ වෙදියකො පබ්බතො, කිංසු නාමජ්ජ වෙදියකො පබ්බතො අතිරිව ඔභාසජාතො අම්බසණ්ඩා ච බ්රාහ්මණගාමො”ති සංවිග්ගා ලොමහට්ඨජාතා අහෙසුං. "
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො සක්කො දෙවානමින්දො පඤ්චසිඛං ගන්ධබ්බදෙවපුත්තං ආමන්තෙසි: දුරුපසඞ්කමා ඛො තාත පඤ්චසිඛ තථාගතා මාදිසෙන, ඣායී ඣානරතා, තදන්තරපටිසල්ලීනා{3 තදන්තරා පටිසල්ලීනා - මඡසං., තදනන්තරං - ස්යා, කා, PTS.}. යදි පන ත්වං, තාත පඤ්චසිඛ භගවන්තං පඨමං පසාදෙය්යාසි, තයා තාත පඨමං පසාදිතං පච්ඡා මයං තං භගවන්තං දස්සනාය උපසඞ්කමෙය්යාම අරහන්තං සම්මාසම්බුද්ධන්ති.” “එවං භද්දන්තවා”ති ඛො පඤ්චසිඛො ගන්ධබ්බදෙවපුත්තො සක්කස්ස දෙවානමින්දස්ස පටිස්සුත්වා බෙලුවපණ්ඩුවීණං{4 වෙළුවපණ්ඩුවීනා - ස්යා.} ආදාය යෙන ඉන්දසාලගුහා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා එත්තාවතා මෙ භගවා නෙව අතිදූරෙ භවිස්සති න අච්චාසනෙන සද්දඤ්ච මෙ සොස්සතී’ති එකමන්තං අට්ඨාසි. එකමන්තං ඨිතො ඛො පඤ්චසිඛො ගන්ධබ්බදෙව පුත්තො බෙලුවපණ්ඩුවීණං අස්සාවෙසි. ඉමා ච ගාථා අභාසි බුද්ධූපසංහිතා ධම්මූපසංහිතා සඞ්ඝූපසංහිතා අරහන්තූපසංහිතා කාමූපසංහිතා:"
            },
            {
                "type": "gatha",
                "text": "4. වන්දෙ තෙ පිතරං භද්දෙ තිම්බරුං සූරියවච්චසෙ,\nයෙන ජාතා’සි කල්යාණී ආනන්දජනනී මම."
            },
            {
                "type": "gatha",
                "text": "වාතො’ව සෙදතං{5 සෙදනං - PTS.} කන්තො පානීයං’ව පිපාසතො, \nඅඞ්ගීරසි පියාමෙ’සි ධම්මො අරහතාමිව."
            },
            {
                "type": "gatha",
                "text": "ආතුරස්සෙව භෙසජ්ජං, භොජනං’ව ජිඝච්ඡතො, \nපරිනිබ්බාපය මං භද්දෙ ජලන්තමිව වාරිනා."
            },
            {
                "type": "page-break",
                "text": "400"
            },
            {
                "type": "gatha",
                "text": "සීතොදකං{1 සීතොදකිං - සීමු, PTS.} පොක්ඛරණිං යුත්ත{2 යුතං - සීමු, PTS.} කිඤ්ජක්ඛරෙණුනා, \nනාගො ඝම්මාභිතත්තොව ඔගාහෙ තෙ ථනූදරං."
            },
            {
                "type": "gatha",
                "text": "අච්චඞ්කුසොව නාගො’ව ජිතං මෙ තුත්තතොමරං, \nකාරණං නප්පජානාමි සම්මත්තො ලක්ඛණූරුයා."
            },
            {
                "type": "gatha",
                "text": "තයි ගෙධිතචිත්තො’ස්මි චිත්තං විපරිණාමිතං, \nපටිගන්තුං න සක්කොමි වඞ්කඝස්තො’ව අම්බුජො."
            },
            {
                "type": "gatha",
                "text": "වාමූරු සජ මං භද්දෙ සජ මං මන්දලොචනෙ, \nපලිස්සජ මං කල්යාණි එතම්මෙ අභිපත්ථිතං."
            },
            {
                "type": "gatha",
                "text": "අප්පකො වත මෙ සන්තො කාමො වෙල්ලිතකෙසියා, \nඅනෙකභාවො{3 අනෙකභාගො - PTS.} සමපාදි{4 සමපාද - PTS.} අරහන්තෙ’ව දක්ඛිණා."
            },
            {
                "type": "gatha",
                "text": "යම්මෙ අත්ථි කතං පුඤ්ඤං අරහන්තෙසු තාදිසු, \nතම්මෙ සබ්බඞ්ගකල්යාණි තයා සද්ධිං විපච්චතං."
            },
            {
                "type": "gatha",
                "text": "යම්මෙ අත්ථි කතං පුඤ්ඤං අස්මිං පඨවිමණ්ඩලෙ; \nතම්මෙ සබ්බඞ්ගකල්යාණි තයා සද්ධිං විපච්චතං."
            },
            {
                "type": "gatha",
                "text": "සක්යපුත්තො’ව ඣානෙන එකොදි නිපකො සතො, \nඅමතං මුනි ජිගිංසානො තමහං සූරියවච්චසෙ."
            },
            {
                "type": "gatha",
                "text": "යථාපි මුනි නන්දෙය්ය පත්වා සම්බොධිමුත්තමං\nඑවං නන්දෙය්යං කල්යාණි මිස්සීභාවඞ්ගතො තයා."
            },
            {
                "type": "gatha",
                "text": "සක්කො චෙ මෙ වරං දජ්ජා තාවතිංසානමිස්සරො,{5 ශත්රශ්ව මෙ වරං දද්යාත් ත්රයස්ත්රිංශානමිශ්වරඃ - මහාවස්තු.} \nතාහං භද්දෙ වරෙය්යාහෙ එවං කාමො දළ්හො මම."
            },
            {
                "type": "gatha",
                "text": "සාලං’ව න චිරං ඵුල්ලං පිතරං තෙ සුමෙධසෙ, \nවන්දමානො නමස්සා’මි, යස්සාසෙතාදිසී පජා”ති."
            },
            {
                "type": "page-break",
                "text": "402"
            },
            {
                "type": "paragraph",
                "text": "5. එවං වුත්තෙ භගවා පඤ්චසිඛං ගන්ධබ්බදෙවපුත්තං එතදවොච: ‘සංසන්දති ඛො තෙ පඤ්චසිඛ තන්තිස්සරො ගීතස්සරෙන, ගීතස්සරො ච තන්තිස්සරෙන. න ච පන තෙ පඤ්චසිඛ, තන්තිස්සරො ගීතස්සරං අතිවත්තති. ගීතස්සරො ච තන්තිස්සරං. කදා සංයූළ්හා පන තෙ පඤ්චසිඛ, ඉමා ගාථා බුද්ධූපසංහීතා ධම්මූපසංහිතා, සඞ්ඝූපසංහිතා අර්හන්තූපසංහිතා කාමූපසංහිතා’ති."
            },
            {
                "type": "paragraph",
                "text": "එකමිදාහං භන්තෙ සමයං භගවා උරුවෙලායං විහරති නජ්ජා නෙරඤ්ජරාය තීරෙ අජපාලනිග්රොධමූලෙ පඨමාභිසම්බුද්ධො. තෙන ඛො පනාහං භන්තෙ, සමයෙන භද්දානාම සූරියවච්චසා තිම්බරුනො ගන්ධබ්බරඤ්ඤො ධීතා තමභිකඞ්ඛාමි, සා ඛො පන භන්තෙ, භගිනී පරකාමිනී හොති. සිඛණ්ඩී නාම මාතලිස්ස සඞ්ගාහකස්ස පුත්තො තමභිකඞ්ඛති. යතො ඛො අහං භන්තෙ, තං භගිනිං නාලත්ථං කෙනචි පරියායෙන. අථාහං බෙලුවපණ්ඩුවීණං ආදාය යෙන තිම්බරුනො ගන්ධබ්බරඤ්ඤො නිවෙසනං තෙනුපසඞ්කමිං. උපසඞ්කමිත්වා බෙලුවපණ්ඩුවීණං අස්සාවෙසිං, ඉමා ච ගාථායො අභාසිං බුද්ධූපසංහිතා ධම්මූපසංහිතා සඞ්ඝූපසංහිතා අරහන්තූපසංහිතා කාමූපසංහිතා."
            },
            {
                "type": "gatha",
                "text": "වන්දෙ තෙ පිතරං භද්දෙ තිම්බරුං සූරියවට්ටසෙ,\nයෙන ජාතාසි කල්යාණී ආනන්දජනනී මම. -පෙ-"
            },
            {
                "type": "gatha",
                "text": "සාලංව න චිරං ඵුල්ලං පිතරං තෙ සුමෙධසෙ,\nවන්දමානො නමස්සාමි යස්සා සෙතාදිසී පජාති."
            },
            {
                "type": "paragraph",
                "text": "6. එවං වුත්තෙ භන්තෙ භද්දා සූරියවච්චසා මං එතදවොච: න ඛො මෙ මාරිස සො භගවා සම්මුඛා දිට්ඨො. අපි ච සුතො යෙව මෙ සො භගවා දෙවානං තාවතිංසානං සුධම්මායං සභායං උපනච්චන්තියා. යතො ඛො ත්වං මාරිස තං භගවන්තං කිත්තෙසි හොතු නො අජ්ජ සමාගමොති. ‘සො යෙව නො භන්තෙ තස්සා භගිනියා සද්ධිං සමාගමො අහොසි. න ච දානි තතො පච්ඡා”ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො සක්කස්ස දෙවානමින්දස්ස එතදහොසි: පටිසම්මොදති ඛො පඤ්චසිඛො ගන්ධබ්බදෙවපුත්තො භගවතා, භගවා ච පඤ්චසිඛෙනා”ති."
            },
            {
                "type": "page-break",
                "text": "404"
            },
            {
                "type": "paragraph",
                "text": "7. අථ ඛො සක්කො දෙවානමින්දො පඤ්චසිඛං ගන්ධබ්බදෙවපුත්තං ආමන්තෙසි: අභිවාදෙහි මෙත්ථං තාත පඤ්චසිඛ භගවන්තං: සක්කො භන්තෙ දෙවානමින්දො සාමච්චො සපරිජනො භගවතො පාදෙ සිරසා වන්දතී’ති:"
            },
            {
                "type": "paragraph",
                "text": "‘එවං භද්දන්තවා’ති ඛො පඤ්චසිඛො ගන්ධබ්බදෙවපුත්තො සක්කස්ස දෙවානමින්දස්ස පටිස්සුත්වා භගවන්තං අභිවාදෙසි: ‘සක්කො භන්තෙ දෙවානමින්දො සාමච්චො සපරිජනො භගවතො පාදෙ සිරසා වන්දතී’ති."
            },
            {
                "type": "paragraph",
                "text": "‘එවං සුඛී හොතු පඤ්චසිඛ සක්කො දෙවානමින්දො සාමච්චො සපරිජනො, සුඛකාමා හි දෙවා මනුස්සා අසුරා නාගා ගන්ධබ්බා, යෙ චඤ්ඤෙ සන්ති පුථුකායා’ති."
            },
            {
                "type": "paragraph",
                "text": "එවඤ්ච පන තථාගතා එවරූපෙ මහෙසක්ඛෙ යක්ඛෙ අභිවදන්ති."
            },
            {
                "type": "paragraph",
                "text": "8. අභිවදිතො සක්කො දෙවානමින්දො භගවතො ඉන්දසාලගුහං පවිසිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. දෙවා පි තාවතිංසා ඉන්දසාලගුහං පවිසිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං අට්ඨංසු. පඤ්චසිඛොපි ගන්ධබ්බදෙවපුත්තො ඉන්දසාලගුහං පවිසිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං අට්ඨාසි."
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන ඉන්දසාලගුහා විසමා සන්තී සමා සමපාදි, සම්බාධා සන්තී උරුන්දාසමපාදි. අන්ධකාරො ගුහායං අන්තරධායි, ආලොකො උදපාදි යථා තං දෙවානං දෙවානුභාවෙන."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා සක්කං දෙවානමින්දං එතදවොච: ‘අච්ඡරියමිදං ආයස්මතො කොසියස්ස අබ්භුතමිදආයස්මතො කොසියස්ස තාව බහුකිච්චස්ස බහුකරණීයස්ස යදිදං ඉධාං ගමනන්ති.’"
            },
            {
                "type": "paragraph",
                "text": "චිරප්පතිකාහං භන්තෙ භගවන්තං දස්සනාය උපසඞ්කමිතුකාමො. අපි ච දෙවානං තාවතිංසානං කෙහිචි කෙහිචි කිච්චකරණීයෙහි බ්යාවටො එවාහං නාසක්ඛිං භගවන්තං දස්සනාය උපසඞ්කමිතුං. එකමිදං භන්තෙ සමයං භගවා සාවත්ථියං විහරති සළලාගාරකෙ. අථඛ්වාහං භන්තෙ සාවත්ථිං අගමාසිං භගවන්තං දස්සනාය. තෙන ඛො පන භන්තෙ සමයෙන භගවා අඤ්ඤතරෙන සමාධිනා නිසින්නො හොති."
            },
            {
                "type": "page-break",
                "text": "406"
            },
            {
                "type": "paragraph",
                "text": "භුඤ්ජතී නාම වෙස්සවණස්ස මහාරාජස්ස පරිචාරිකා භගවන්තං පච්චුපට්ඨිතා හොති පඤ්ජලිකා නමස්සමානා අථඛ්වාහං භන්තෙ භූඤ්ජතිං එතදවොචං: “අභිවාදෙහි මෙ ත්වං භගිනි භගවන්තං, සක්කො භන්තෙ දෙවානමින්දො සාමච්චො සපරිජනො භගවතො පාදෙ සිරසා වන්දතී”ති. එවං වුත්තෙ භන්තෙ සා භූඤ්ජති මං එතදවොච: ‘අකාලො ඛො මාරිස භගවන්තං දස්සනාය, පටිසල්ලීනො භගවා’ති. “තෙන හි භගිනි යදා භගවා තම්හා සමාධිම්හා වුට්ඨිතො හොති අථ මම වචනෙන භගවන්තං අභිවාදෙහි. සක්කො භන්තෙ දෙවානමින්දො සාමච්චො සපරිජනො භගවතො පාදෙ සිරසා වන්දතී”ති."
            },
            {
                "type": "paragraph",
                "text": "“කච්චි මෙ සා භන්තෙ භගිනී භගවන්තං අභිවාදෙසි, සරති භගවා තස්සා භගිනියා වචනන්ති?” “අභිවාදෙසි මං සා දෙවානමින්ද භගිනී, සරාමහං තස්සා භගිනියා වචනං. අපි චාහං ආයස්මතො ච නෙමිසද්දෙන තම්හා සමාධිම්හා වුට්ඨිතො”ති."
            },
            {
                "type": "paragraph",
                "text": "“යෙ තෙ භන්තෙ දෙවා අම්හෙහි පඨමතරං තාවතිංසකායං උපපන්නා, තෙසං මෙ සම්මුඛා සුතං සම්මුඛා පටිග්ගහිතං: “යදා තථාගතා ලොකෙ උප්පජ්ජන්ති අරහන්තො සම්මාසම්බුද්ධා, දිබ්බා කායා පරිපූරන්ති හායන්ති අසුරකායා’ති, තං මෙ ඉදං භන්තෙ සක්ඛිදිට්ඨං යතො තථාගතො ලොකෙ උප්පන්නො අරහං සම්මාසම්බුද්ධො, දිබ්බා කායා පරිපූරන්ති, හායන්ති අසුරකායා ති. ඉධෙව භන්තෙ කපිලවත්ථුස්මිං ගොපිකා නාම සක්යධීතා අහොසි බුද්ධෙ පසන්නා ධම්මෙ පසන්නා සඞ්ඝෙ පසන්නා සීලෙසු පරිපූරකාරිනී. සා ඉත්ථිත්තං විරාජෙත්වා පුරිසත්තං භාවෙත්වා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නා දෙවානං තාවතිංසානං සහබ්යතං අම්හාකං පුත්තත්තං අජ්ඣුපගතා. තත්රපි නං එවං ජානන්ති ‘ගොපකො දෙවපුත්තො ගොපකො දෙවපුත්තො’ති."
            },
            {
                "type": "paragraph",
                "text": "9. අඤ්ඤෙ පි භන්තෙ තයො භික්ඛූ භගවති බ්රහ්මචරියං චරිත්වා හීනං ගන්ධබ්බකායං උපපන්නා. තෙ පඤ්චහි කාමගුණෙහි සමප්පිතා සමඞ්ගීභූතා පරිචාරයමානා අම්හාකං උපට්ඨානමාගච්ඡන්ති අම්හාකං පාරිචරියං. තෙ අම්හාකං උපට්ඨානමාගතෙ අම්හාකං පාරිචරියං ගොපකො නාම දෙවපුත්තො පටිචොදෙසි: “කුතොමුඛා නාම තුම්හෙ මාරිසා තස්ස භගවතො ධම්මං අස්සුත්ථා අහං හි නාම ඉත්ථිකා සමාන බුද්ධෙ පසන්නා ධම්මෙ පසන්නා සඞ්ඝෙ පසන්නා සීලෙසු පරිපූරකාරිනී ඉත්ථිත්තං විරාජෙත්වා පුරිසත්තං භාවෙත්වා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපන්නා දෙවානං තාවතිංසානං සහබ්යතං සක්කස්ස දෙවානමින්දස්ස පුත්තත්තං අජ්ඣුපගතා."
            },
            {
                "type": "page-break",
                "text": "408"
            },
            {
                "type": "paragraph",
                "text": "ඉධාපි මං එවං ජානන්ති ගොපකො දෙවපුත්තො ගොපකො දෙවපුත්තොති. තුම්හෙ පන මාරිසා භගවති බ්රහ්මචරියං චරිත්වා හීනං ගන්ධබ්බකායං උපපන්නා. දුද්දිට්ඨරූපං වත භො අද්දසාම යෙ මයං අද්දසාම සහධම්මිකෙ හීනං ගන්ධබ්බකායං උපපන්නෙ’ති”. තෙසං භන්තෙ ගොපකෙන දෙවපුත්තෙන පටිචොදිතානං ද්වෙ දෙවා දිට්ඨෙව ධම්මෙ සතිං පටිලභිංසු කායං බ්රහ්මපුරොහිතං, එකො පන දෙවො කාමෙ අජ්ඣාවසි."
            },
            {
                "type": "gatha",
                "text": "10. “උපාසිකා චක්ඛුමතො අහොසිං නාමම්පි මය්හං අහු ගොපිකා’ති,\nබුද්ධෙ ච ධම්මෙ ච අභිප්පසන්නා සඞ්ඝඤ්චුපට්ඨාසිං පසන්නචිත්තා."
            },
            {
                "type": "gatha",
                "text": "තස්සෙව බුද්ධස්ස සුධම්මතාය සක්කස්ස පුත්තොම්හි මහානුභාවො, \nමහාජුතීකො තිදිවූපපන්නො ජානන්ති මං ඉධාපි ගොපකො’ති."
            },
            {
                "type": "gatha",
                "text": "අථද්දසං භික්ඛවො දිට්ඨපුබ්බෙ ගන්ධබ්බකායූපගතෙ’වහීනෙ. \nඉමෙහි තෙ ගොතමසාවකා සෙ යෙ ච මයං පුබ්බෙ මනුස්සභූතා."
            },
            {
                "type": "gatha",
                "text": "අන්නෙන පානෙන උපට්ඨහිම්හා පාදූපසංගය්හ සකෙ නිවෙසනෙ, \nකුතොමුඛා නාම ඉමෙ භවන්තො බුද්ධස්ස ධම්මානි පටිග්ගහෙසුං."
            },
            {
                "type": "gatha",
                "text": "පච්චත්තං වෙදිතබ්බො හි ධම්මො සුදෙසිතො චක්ඛුමතානුබුද්ධො, \nඅහං හි තුම්හෙව උපාසමානො සුත්වා අරියානං සුභාසිතානි."
            },
            {
                "type": "gatha",
                "text": "සක්කස්ස පුත්තො’ම්හි මහානුභාවො මහාජුතීකො තිදිවූපපන්නො, \nතුම්හෙ පන සෙට්ඨමුපාසමානා අනුත්තරං බ්රහ්මචරියං චරිත්වා."
            },
            {
                "type": "gatha",
                "text": "හීනං කායං උපපන්නා භවන්තො අනානුලොමා භවතූපපත්ති, \nදුද්දිට්ඨරූපං වත අද්දසාම සහධම්මිකෙ හීනකායූපපන්නෙ."
            },
            {
                "type": "gatha",
                "text": "ගන්ධබ්බකායූපගතා භවන්තො දෙවානමාගච්ඡථ පාරිචරියං, \nඅගාරෙ වසතො මය්හං ඉමං පස්ස විසෙසතං."
            },
            {
                "type": "page-break",
                "text": "410"
            },
            {
                "type": "paragraph",
                "text": "ඉත්ථි හුත්වා ස්වජ්ජ පුමොම්හි දෙවො දිබ්බෙහි කාමෙහි සමඞ්ගිභූතො, තෙ චොදිතා ගොතමසාවකෙන සංවෙගමාපාදුං සමෙච්ච ගොපකං."
            },
            {
                "type": "gatha",
                "text": "“හන්ද බ්යායමාම වියායමාම මා නො මයං පරපෙස්සා අහුම්හ,” \nතෙසං දුවෙ වීරියං ආරභිංසු අනුස්සරං ගොතමසාසනානි."
            },
            {
                "type": "gatha",
                "text": "ඉධෙව චිත්තානි විරාජයිත්වා කාමෙසු ආදීනවමද්දසංසු, \nතෙ කාමසංයොජනබන්ධනානි පාපිමයොගානි දුරච්චයානි."
            },
            {
                "type": "gatha",
                "text": "නාගොව සන්දානගුණානි ඡෙත්වා දෙවෙ තාවතිංසෙ අතික්කමිංසු, \nසඉන්දා දෙවා සපජාපතිකා සබ්බෙ සුධම්මාය සභායුපවිට්ඨා."
            },
            {
                "type": "gatha",
                "text": "තෙ සංනිසින්නානං අතික්කමිංසු වීරා විරාගා විරජං කරොන්තා, \nතෙ දිස්වා සංවෙගමකාසි වාසවො දෙවාභිභූ දෙවගණස්ස මජ්ඣෙ."
            },
            {
                "type": "gatha",
                "text": "ඉමෙ හි තෙ හීනකායූපපන්නා දෙවෙතාවතිංසෙ අතික්කමන්ති, \nසංවෙගජාතස්ස වචො නිසම්ම සො ගොපකො වාසවමජ්ඣභාසි."
            },
            {
                "type": "gatha",
                "text": "“බුද්ධො ජනින්දත්ථි මනුස්සලොකෙ කාමාභිභූ සක්යමුනීති ඤායති, \nතස්සෙතෙ පුත්තා සතියා විහීනා චොදිතා මයා තෙ සතිමජ්ඣලත්ථුං."
            },
            {
                "type": "gatha",
                "text": "තිණ්ණං තෙසං වසීනෙත්ථ එකො ගන්ධබ්බකායූපගතො ‘වහීනො\nද්වෙ චෙච සම්බොධිපථානුසාරිනො දෙවෙපි හීළෙන්ති සමාහිතත්තා."
            },
            {
                "type": "gatha",
                "text": "එතාදිසී ධම්මප්පකාසනෙත්ථ න තත්ථ කිං කඞ්ඛති කොචි සාවකො, \nනිත්ථිණ්ණඔඝං විචිකිච්ඡඡාජින්නං බුද්ධං නමස්සාම ජිනං ජනින්දං."
            },
            {
                "type": "gatha",
                "text": "යන්තෙ ධම්මං ඉධඤ්ඤාය විසෙසං අජ්ඣගංසු තෙ, \nකායං බ්රහ්මපුරොහිත දුවෙ තෙසං විසෙසගූ."
            },
            {
                "type": "gatha",
                "text": "තස්ස ධම්මස්ස පත්තියා ආගතම්හාසි මාරිස, \nකතාවකාසා භගවතා පඤ්හං පුච්ඡෙමු මාරිසාති."
            },
            {
                "type": "page-break",
                "text": "412"
            },
            {
                "type": "paragraph",
                "text": "11. අථ ඛො භගවතො එතදහොසි: දීඝරත්තං විසුද්ධො ඛො අයංසක්කො යං කිඤ්චි මං පඤ්හං පුච්ඡිස්සති, සබ්බං තං අත්ථසංහිතං යෙව පුච්ඡිස්සති, නො අනත්ථසංහිතං. යං චස්සාහං පුට්ඨො බ්යාකරිස්සාමි. තං ඛිප්පමෙව ආජානිස්සතී”ති. අථ ඛො භගවා සක්කං දෙවානමින්දං ගාථාය අජ්ඣභාසි:"
            },
            {
                "type": "gatha",
                "text": "“පුච්ඡ වාසව මං පඤ්හං යං කිඤ්චි මනසිච්ඡසි, \nතස්ස තස්සෙව පඤ්හස්ස අහං අන්තං කරොමි තෙ”ති."
            },
            {
                "type": "centered",
                "text": "පඨමභාණවාරං නිට්ඨිතං.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "414"
            },
            {
                "type": "paragraph",
                "text": "12. කතාවකාසො සක්කො දෙවානමින්දො භගවතා ඉමං භගවන්තං පඨමං පඤ්හං අපුච්ඡිද: කිංසඤ්ඤොජනා නු ඛො මාරිස දෙවා මනුස්සා අසුරා නාගා ගන්ධබ්බා යෙ චඤ්ඤෙ සන්ති පුථුකායා තෙ ‘අවෙරා අදණ්ඩා අසපත්තා අබ්යාපජ්ජා{1 අව්යාපජ්ඣු - PTS.} විහරෙමු අවෙරිනො’ති ඉති ෙච නෙසං හොති. අථ ච පන සවෙරා සදණ්ඩා සසපත්තා සබ්යාපජ්ජා විහරන්ති සවෙරිනො”ති. ඉත්ථං සක්කො දෙවානමින්දො භගවන්තං පඤ්හං අපුච්ඡි."
            },
            {
                "type": "paragraph",
                "text": "තස්ස භගවා පඤ්හං පුට්ඨො බ්යාකාසි:"
            },
            {
                "type": "paragraph",
                "text": "“ඉස්සාමච්ඡරියසඤ්ඤොයොජනා ඛො දෙවානමින්ද දෙවා මනුස්සා අසුරා නාගා ගන්ධබ්බා, යෙ චඤ්ඤෙ සන්ති පුථුකායා, තෙ ‘අවෙරා අදණ්ඩා අසපත්තා අබ්යාපජ්ජා විහරෙමු අවෙරිනො’ති ඉති ෙච නෙසං හොති. අථ ච පන සවෙරා සදණ්ඩා සසපත්තා සබ්යපජ්ජා විහරන්ති සවෙරිනො”ති. ඉත්ථං භගවා සක්කස්ස දෙවානමින්දස්ස පඤ්හං පුට්ඨො බ්යාකාසි. අත්තමනො සක්කො දෙවානමින්දො භගවතො භාසිතං අභිනන්දි අනුමොදි: එවමෙතං භගවා, එවමෙතං සුගත, තිණ්ණා මෙ’ත්ථ කඞ්ඛා විගතා කථංකථා භගවතො පඤ්හසස වෙය්යාකරණං සුත්වා”ති."
            },
            {
                "type": "paragraph",
                "text": "13. ඉතිහ සක්කො දෙවානමින්දො භගවතො භාසිතං අභිනන්දිත්වා අනුමොදිත්වා භගවන්තං උත්තරිං පඤ්හමපුච්ඡි:"
            },
            {
                "type": "paragraph",
                "text": "“ඉස්සාමච්ඡරියං පන මාරිස කිංනිදානං කිංසමුදයං කිංජාතිකං කිංපභවං, කිස්මිං සති ඉස්සාමච්ඡරියං හොති, කිස්මිං අසති ඉස්සාමච්ඡරියං න හොතී?”ති."
            },
            {
                "type": "page-break",
                "text": "416"
            },
            {
                "type": "paragraph",
                "text": "ඉස්සාමච්ඡරියං ඛො දෙවානමින්ද පියාප්පියනිදානං පියාප්පියසමුදයං පියාප්පියජාතිකං පියාප්පියපභවං, පියාප්පියෙ සති ඉස්සාමච්ඡරියං හොති, පියාප්පියෙ අසති ඉස්සාමච්ඡරියං න හොතී”ති."
            },
            {
                "type": "paragraph",
                "text": "14. “පියාප්පියං ඛො පන මාරිස කිංනිදානං කිංසමුදයං කිංජාතිකං කිංපභවං. කිස්මිං සති පියාප්පියං හොති, කිස්මී අසති පියාප්පියං න හොතී”ති."
            },
            {
                "type": "paragraph",
                "text": "“පියාප්පියං ඛො දෙවානමින්ද, ඡන්දනිදානං ඡන්දසමුදයං ඡන්දජාතිකං ඡන්දප්පභවං ඡන්දෙ සති පියාප්පියං හොති, ඡන්දෙ’ අසති පියාප්පියං න හොතී”ති."
            },
            {
                "type": "paragraph",
                "text": "15. “ඡන්දො ඛො පන මාරිස කිංනිදානො කිංසමුදයො කිංජාතිකො කිංපභවො, කිස්මිං සති ඡන්දො හොති, කිස්මිං අසති ඡන්දො න හොතී’ති."
            },
            {
                "type": "paragraph",
                "text": "ඡන්දො ඛො දෙවානමින්ද විතක්කනිදානො විතක්කසමුදයො විතක්කජාතිකො විතක්කපභවො. විතක්කෙ සති ඡන්දො හොති, විතක්කෙ අසති ඡන්දො න හොතී”ති."
            },
            {
                "type": "paragraph",
                "text": "16. විතක්කො ඛො පන මාරිස කිංනිදානො කිංසමුදයො කිංජාතිකො කිංපභවො, කිස්මිං සති විතක්කො හොති, කිස්මිං අසති විතක්කො න හොතී’ති."
            },
            {
                "type": "paragraph",
                "text": "විතක්කො ඛො දෙවානමින්ද පපඤ්චසඤ්ඤාසඞ්ඛානිදානො පපඤ්චසඤ්ඤාසඞ්ඛාසමුදයො පපඤ්චසඤ්ඤාසඞ්ඛාජාතිකො පපඤ්චසඤ්ඤාසඞ්ඛාපභවො, පපඤ්චසඤ්ඤාසඞ්ඛාය සති විතක්කො හොති, පපඤ්චසඤ්ඤාසඞ්ඛාය අසති විතක්කො න හොතී”ති."
            },
            {
                "type": "page-break",
                "text": "418"
            },
            {
                "type": "paragraph",
                "text": "17. කථං පටිපන්නො පන මාරිස භික්ඛු පපඤ්චසඤ්ඤාසඞ්ඛානිරොධසාරුප්පගාමිනීපටිපදං පටිපන්නො හොතී’ති."
            },
            {
                "type": "paragraph",
                "text": "සොමනසසම්පාහං දෙවානමින්ද දුවිධෙන වදාමි සෙවිතබ්බම්පි අසෙවිතබ්බම්පි. දොමනස්සම්පාහං දෙවානමින්ද දුවිධෙන වදාමි. සෙවිතබ්බම්පි අසෙවිතබ්බම්පි. උපෙක්ඛම්පාහං දෙවානමින්ද දුවිධෙන වදාමි සෙවිතබ්බම්පි අසෙවිතබ්බම්පි."
            },
            {
                "type": "paragraph",
                "text": "සොමනස්සම්පාහං දෙවානමින්ද දුවිධෙන වදාමි. සෙවිතබ්බම්පි අසෙවිතබ්බම්පී ති ඉති ඛො පනෙතං වුත්තං කිඤ්චෙතං පටිච්ච වුත්තං. තත්ථ යං ජඤ්ඤා සොමනස්සං ‘ඉමං ඛො මෙ සොමනස්සං සෙවතො අකුසලා ධම්මා අභිවඩ්ඪන්ති කුසලා ධම්මා පරිහායන්තී’ති. එවරූපං සොමනස්සං න සෙවිතබ්බං. තත්ථ යං ජඤ්ඤා සොමනස්සං ‘ඉමං ඛො මෙ සොමනස්සං සෙවතො අකුසලා ධම්මා පරිහායන්ති කුසලා ධම්මා අභිවඩ්ඪන්තී’ති. එවරූපං සොමනස්සං සෙවිතබ්බං. තත්ථ යඤ්චෙ සවිතක්කං සවිචාරං යඤ්චෙ අවිතක්කං අවිචාරං යෙ අවිතක්කඅවිචාරෙ තෙ පණීතතරෙ. සොමනස්සම්පාහං දෙවානමින්ද දුවිධෙන වදාමි සෙවිතබ්බම්පි අසෙවිතබ්බම්පීති. ඉති යන්තං වුත්තං ඉදමෙතං පටිච්ච වුත්තං. දොමනස්සම්පාහං දෙවානමින්ද දුවිධෙන වදාමි සෙවිතබ්බම්පි අසෙවිතබ්බම්පී ති. ඉති ඛො පනෙතං වුත්තං කිඤ්චෙතං පටිච්ච වුත්තං. තත්ථ යං ජඤ්ඤා දොමනස්සං ‘ඉමං ඛො මෙ දොමනස්සං සෙවතො අකුසලා ධම්මා අභිවඩ්ඪන්ති කුසලා ධම්මා පරිහායන්තී’ති, එවරූපං දොමනස්සං න සෙවිතබ්බං. තත්ථ යං ජඤ්ඤා දොමනස්සං ‘ඉමං ඛො මෙ දොමනස්සං සෙවතො අකුසලා ධම්මා පරිහායන්ති කුසලා ධම්මා අභිවඩ්ඪන්තී’ති, එවරූපං දොමනස්සං සෙවිතබ්බං. තත්ථ යඤ්චෙ සවිතක්කං සවිචාරං යඤ්චෙ අවිතක්කං අවිචාරං, යෙ අවිතක්කඅවිචාරෙ තෙ පණීතතරෙ. දොමනස්සම්පාහං දෙවානමින්ද දුවිධෙන වදාමි සෙවිතබ්බම්පි අසෙවිතබ්බම්පී’ති. ඉති යන්තං වුත්තං ඉදමෙතං පටිච්චවුත්තං."
            },
            {
                "type": "page-break",
                "text": "420"
            },
            {
                "type": "paragraph",
                "text": "උපෙක්ම්පාහං දෙවානමින්ද දුවිධෙන වදාමි සෙවිතබ්බම්පි, අසෙවිතබ්බම්පී ති ඉති ඛො පනෙතං වුත්තං. කිඤ්චෙතං පටිච්ච වුත්තං තත්ථ යං ජඤ්ඤාඋපෙක්ඛං ඉමං ඛො මෙ උපෙක්ඛං සෙවතො අකුසලා ධම්මා අභිවඩ්ඪන්ති, කුසලා ධම්මා පරිහායන්තී’ති, එවරූපා උපෙක්ඛා න සෙවිතබ්බා. තත්ථ යං ජඤ්ඤා උපෙක්ඛා ඉමං ඛො මෙ උපෙක්ඛං සෙවතො අකුසලා ධම්මා පරිහායන්ති, කුසලා ධම්මා අභිවඩ්ඪන්තී’ති, එවරූපා උපෙක්ඛා සෙවිතබ්බා. තත්ථ යඤ්චෙ සවිතක්කං සවිචාරං, යඤ්චෙ අවිතක්කං අවිචාරං යෙ අවිතක්කඅවිචාරෙ තෙ පණීතතරෙ. උපෙක්ඛම්පාහං දෙවානමින්ද දුවිධෙන වදාමි. සෙවිතබ්බම්පි අසෙවිතබ්බම්පී ති ඉති යන්තං වුත්තං ඉදමෙතං පටිච්ච වුත්තං."
            },
            {
                "type": "paragraph",
                "text": "එවං පටිපන්නො ඛො දෙවානමින්ද භික්ඛු පපඤ්චසඤ්ඤාසඞ්ඛානිරොධසාරුප්පගාමිනීපටිපදං පටිපන්නො හොතීති. ඉත්ථං භගවා සක්කස්ස දෙවානමින්දස්ස පඤ්හං පුට්ඨො බ්යාකාසි. අත්තමනො සක්කො දෙවානමින්දො භගවතො භාසිතං අභිනන්දි අනුමොදි. “එවමෙතං භගවා, එවමෙතං සුගත, තිණ්ණා මෙත්ථ කඞ්ඛා විගතා කථංකථා භගවතො පඤ්හවෙය්යාකරණං සුත්වා”ති."
            },
            {
                "type": "paragraph",
                "text": "18. ඉතිහ සක්කො දෙවානමින්දො භගවතො භාසිතං අභිනන්දිත්වා අනුමොදිත්වා භගවන්තං උත්තරිං පඤ්හං අපුච්ඡි: “කථං පටිපන්නො පන මාරිස භික්ඛු පාතිමොක්ඛසංවරාය පටිපන්නො හොතී?ති”."
            },
            {
                "type": "paragraph",
                "text": "කායසමාචාරම්පාහං දෙවානමින්ද දුවිධෙන වදාමි සෙවිතබ්බම්පි අසෙවිතබ්බම්පී ති. වචීසමාචාරම්පාහං දෙවානමින්ද දුවිධෙන වදාමි සෙවිතබ්බම්පි අසෙවිතබ්බම්පී ති. පරියෙසනම්පාහං දෙවානමින්ද දුවිධෙන වදාමි සෙවිතබ්බම්පි අසෙවිතබ්බම්පී ති. කායසමාචාරම්පාහං දෙවානමින්ද දුවිධෙන වදාමි. සෙවිතබ්බම්පි අසෙවිතබ්බම්පී ති. ඉති ඛො පනෙතං වුත්තං කිඤ්චෙතං පටිච්ච වුත්තං. තත්ථ යං ජඤ්ඤා කායසමාචාරං ඉමං ඛො මෙ කායසමාචාරං සෙවතො අකුසලා ධම්මා අභිවඩ්ඪන්ති කුසලා ධම්මා පරිහායන්තී ති, එවරූපො කායසමාචාරො න සෙවිතබ්බො. තත්ථ යං ජඤ්ඤා කායසමාචාරං ඉමං ඛො මෙ කායසමාචාරං සෙවතො අකුසලා ධම්මා පරිහායන්ති කුසලා ධම්මා අභිවඩ්ඪන්තී ති, එවරූපො කායසමාචාරො සෙවිතබ්බො. කායසමාචාරම්පාහං දෙවානමින්ද දුවිධෙන වදාමි. සෙවිතබ්බම්පි අසෙවිතබ්බම්පී ති. ඉති යන්තං වුත්තං, ඉදමෙතං පටිච්ච වුත්තං,"
            },
            {
                "type": "page-break",
                "text": "422"
            },
            {
                "type": "paragraph",
                "text": "වචීසමාචාරම්පාහං දෙවානමින්ද දුවිධෙන වදාමි සෙවිතබ්බම්පි අසෙවිතබ්බම්පීති. ඉති ඛො පනෙතං වුත්තං. කිඤ්චෙතං පටිච්ච වුත්තං. තත්ථ යං ජඤ්ඤා වචීසමාචාරං ඉමං ඛො මෙ වචීසමාචාරං සෙවතො අකුසලා ධම්මා අභිවඩ්ඪන්ති, කුසලා ධම්මා පරිහායන්තී’ති, එවරූපො වචීසමාචාරො න සෙවිතබ්බො. තත්ථ යං ජඤ්ඤා වචීසමාචාරං ඉමං ඛො මෙ වචීසමාචාරං සෙවතො අකුසලා ධම්මා පරිහායන්ති කුසලා ධම්මා අභිවඩ්ඪන්තී’ති, එවරූපො වචීසමාචාරො සෙවිතබ්බො. වචීසමාචාරම්පාහං දෙවානමින්ද දුවිධෙන වදාමි. සෙවිතබ්බම්පි අසෙවිතබ්බම්පීති ඉති යන්තං වුත්තං, ඉදමෙතං පටිච්ච වුත්තං."
            },
            {
                "type": "paragraph",
                "text": "පරියෙසනම්පාහං දෙවානමින්ද දුවිධෙන වදාමි සෙවිතබ්බම්පි අසෙවිතබ්බම්පී’ති. ඉති ඛො පනෙතං වුත්තං. කිඤ්චෙතං පටිච්ච වුත්තං. තත්ථ යං ජඤ්ඤා පරියෙසනං ඉමං ඛො මෙ පරියෙසනං සෙවතො අකුසලා ධම්මා අභිවඩ්ඪන්ති කුසලා ධම්මා පරිහායන්තී’ති, එවරූපා පරියෙසනා න සෙවිතබ්බා. තත්ථ යං ජඤ්ඤා පරියෙසනං ඉමං ඛො මෙ පරියෙසනං සෙවතො අකුසලා ධම්මා පරිහායන්ති කුසලා ධම්මා අභිවඩ්ඪන්තී’ති. එවරූපා පරියෙසනා සෙවිතබ්බා. පරියෙසනම්පාහං දෙවානමින්ද දුවිධෙන වදාමි සෙවිතබ්බම්පි අසෙවිතබ්බම්පී ති ඉති යන්තං වුත්තං ඉදමෙතං පටිච්ච වුත්තං. එවං පටිපන්නො ඛො දෙවානමින්ද භික්ඛු පාතිමොක්ඛසංවරාය පටිපන්නො හොතී’ති."
            },
            {
                "type": "paragraph",
                "text": "ඉත්ථං භගවා සක්කස්ස දෙවානමින්දස්ස පඤ්හං පුට්ඨො බ්යාකාසි. අත්තමනො සක්කො දෙවානමින්දො භගවතො භාසිතං අභිනන්දි අනුමොදි: “එවමෙතං භගවා එවමෙතං සුගත. තිණ්ණා මෙ’ත්ථ කඞ්ඛා විගතා කථංකථා භගවතො පඤ්හවෙය්යාකරණං සුත්වා”ති."
            },
            {
                "type": "paragraph",
                "text": "19. ඉතිහ සක්කො දෙවානමින්දො භගවතො භාසිතං අභිනන්දිත්වා අනුමොදිත්වා භගවන්තං උත්තරිං පඤ්හං අපුච්ඡි: “කථං පටිපන්නො පන මාරිස භික්ඛු ඉන්ද්රියසංවරාය පටිපන්නො හොතී?”"
            },
            {
                "type": "paragraph",
                "text": "“චක්ඛුවිඤ්ඤෙය්යං රූපම්පාහං දෙවානමින්ද දුවිධෙන වදාමි සෙවිතබ්බම්පි අසෙවිතබ්බම්පීති. සොතවිඤ්ඤෙය්යං සද්දම්පාහං දෙවානමින්ද දුවිධෙන වදාමි සෙවිතබ්බම්පි අසෙවිතබ්බම්පීති. ඝානවිඤ්ඤෙය්යං ගන්ධම්පාහං දෙවානමින්ද දුවිධෙන වදාමි සෙවිතබ්බම්පි අසෙවිතබ්බම්පී ති. ජිව්හාවිඤ්ඤෙය්යං රසම්පාහං දෙවානමින්ද දුවිධෙන වදාමි සෙවිතබ්බම්පි අසෙවිතබ්බම්පී ති. කායවිඤ්ඤෙය්යං ඵොට්ඨබ්බම්පාහං දෙවානමින්ද දුවිධෙන වදාමි සෙවිතබ්බම්පි අසෙවිතබ්බම්පීති. මනොවිඤ්ඤෙය්යං ධම්මම්පාහං දෙවානමින්ද දුවිධෙන වදාමි සෙවිතබ්බම්පි අසෙවිතබ්බම්පී’ති."
            },
            {
                "type": "page-break",
                "text": "424"
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ සක්කො දෙවානමින්දො භගවන්තං එතදවොච: ඉමස්ස ඛො අහං භන්තෙ භගවතා සඞ්ඛිත්තෙන භාසිතස්ස එවං විත්ථාරෙන අත්ථං ආජානාමි. යථාරූපං භන්තෙ චක්ඛුවිඤ්ඤෙය්යං රූපං සෙවතො අකුසලා ධම්මා අභිවඩ්ඪන්ති, කුසලා ධම්මා පරිහායන්තී ති, එවරූපං චක්ඛුවිඤ්ඤෙය්යං රූපං න සෙවිතබ්බං. යථාරූපඤ්ච ඛො භන්තෙ චක්ඛුවිඤ්ඤෙය්යං රූපං සෙවතො අකුසලා ධම්මා පරිහායන්ති කුසලා ධම්මා අභිවඩ්ඪන්ති ති එවරූපං චක්ඛුවිඤ්ඤෙය්යං රූපං සෙවිතබ්බං. යථාරූපඤ්ච ඛො භන්තෙ සොතවිඤ්ඤෙය්යං සද්දං සෙවතො -පෙ- ඝානවිඤ්ඤෙය්යං ගන්ධං සෙවතො -පෙ- ජිව්හාවිඤ්ඤෙය්යං රසං සෙවතො -පෙ- කායවිඤ්ඤෙය්යං ඵොට්ඨබ්බං සෙවතො -පෙ- මනොවිඤ්ඤෙය්යං ධම්මං සෙවතො අකුසලා ධම්මා අභිවඩ්ඪන්ති කුසලා ධම්මා පරිහායන්ති ති එවරූපො මනොවිඤ්ඤෙෙය්යා ධම්මො න සෙවිතබ්බො. යථාරූපඤ්ච ඛො භන්තෙ මනොවිඤ්ඤෙය්යං ධම්මං සෙවතො අකුසලා ධම්මා පරිහායන්ති කුසලා ධම්මා අභිවඩ්ඪන්ති ති, එවරූපො මනොවිඤ්ඤෙෙය්යා ධම්මො සෙවිතබ්බො. ඉමස්ස ඛො මෙ භන්තෙ භගවතා සඞ්ඛිත්තෙන භාසිතස්ස එවං විත්ථාරෙන අත්ථං ආජානතො තිණ්ණා මෙ’ත්ථ කඞ්ඛා විගතා කථංකථා භගවතො පඤ්හවෙය්යාකරණං සුත්වා”ති."
            },
            {
                "type": "paragraph",
                "text": "20. ඉතිහ සක්කා දෙවානමින්දො භගවතො භාසිතං අභිනන්දිත්වා අනුමොදිත්වා භගවන්තං උත්තරිං පඤ්හං අපුච්ඡි: “සබ්බෙව නු ඛො මාරිස සමණබ්රාහ්මණා එකන්තවාදා එකන්තසීලා එකන්තඡන්දා එකන්තඅජ්ඣොසානා”ති."
            },
            {
                "type": "paragraph",
                "text": "“න ඛො දෙවානමින්ද සබ්බෙ සමණබ්රාහ්මණා එකන්තවාදා එකන්තසීලා එකන්තඡන්දා එකන්තඅජ්ඣොසානා”ති."
            },
            {
                "type": "paragraph",
                "text": "“කස්මා පන මාරිස න සබ්බෙ සමණබ්රාහ්මණා එකන්තවාදා එකන්තසීලා එකන්තඡන්දා එකන්තඅජ්ඣොසානා?”ති."
            },
            {
                "type": "page-break",
                "text": "426"
            },
            {
                "type": "paragraph",
                "text": "“අනෙකධාතුනානාධාතු ඛො දෙවානමින්ද ලොකො. තස්මිං අනෙකධාතුනානාධාතුස්මිං ලොකෙ යං යදෙව සත්තා ධාතුං අභිනිවිසන්ති, තං තදෙව ථාමසා පරාමස්ස අභිනිවිස්ස වොහරන්ති ‘ඉදමෙව සච්චං මොඝමඤ්ඤන්ති.’ තස්මා න සබ්බෙ සමණබ්රාහ්මණා එකන්තවාදා එකන්තසීලා එකන්තඡන්දා එකන්තඅජ්ඣොසානා”ති."
            },
            {
                "type": "paragraph",
                "text": "“සබ්බෙව නු ඛො මාරිස සමණබ්රාහ්මණා අච්චන්තනිට්ඨා අච්චන්තයොගක්ඛෙමී අච්චන්තබ්රහ්මචාරී අච්චන්තපරියොසානා?”ති."
            },
            {
                "type": "paragraph",
                "text": "“න ඛො දෙවානමින්ද සබ්බෙ සමණබ්රාහ්මණා අච්චන්තනිට්ඨා අච්චන්තයොගක්ඛෙමී අච්චන්තබ්රහ්මචාරී අච්චන්තපරියොසානා”ති."
            },
            {
                "type": "paragraph",
                "text": "“කස්මා පන මාරිස න සබ්බෙ සමණබ්රාහ්මණා අච්චන්තනිට්ඨා අච්චන්තයොගක්ඛෙමී අච්චන්තබ්රහ්මචාරී අච්චන්තපරියොසානා”ති."
            },
            {
                "type": "paragraph",
                "text": "“යෙ ඛො දෙවානමින්ද භික්ඛූ තණ්හාසඞ්ඛයවිමුත්තා තෙ අච්චන්තනිට්ඨා අච්චන්තයොගක්ඛෙමී අච්චන්තබ්රහ්මචාරී අච්චන්තපරියොසානා. තස්මා න සබ්බෙ සමණබ්රාහ්මණා අච්චන්තනිට්ඨා අච්චන්තයොගක්ඛෙමී අච්චන්තබ්රහ්මචාරී අච්චන්තපරියොසානා”ති."
            },
            {
                "type": "paragraph",
                "text": "ඉත්ථං භගවා සක්කස්ස දෙවානමින්දස්ස පඤ්හං පුට්ඨො බ්යාකාසි. අත්තමනො සක්කො දෙවානමින්දො භගවතො භාසිතං අභිනන්දි අනුමොදි. එව මෙතං භගවා එවමෙතං සුගත තිණ්ණා මෙ’ත්ථ කඞ්ඛා විගතා කථංකථා භගවතො පඤ්හවෙය්යාකරණං සුත්වා”ති."
            },
            {
                "type": "page-break",
                "text": "428"
            },
            {
                "type": "paragraph",
                "text": "21. ඉතිහ සක්කො දෙවානමින්දො භගවතො භාසිතං අභිනන්දිත්වා අනුමොදිත්වා භගවන්තං එතදවොච: එජා භන්තෙ රොගො එජා ගණ්ඩො එජා සල්ලං එජා ඉමං පුරිසං පරිකඩ්ඪති තස්ස තස්සෙව භවස්ස අභිනිබ්බත්තියා. තස්මා අයං පුරිසො උච්චාවචමාපජ්ජති. යෙස්වාහං භන්තෙ පඤ්හානං ඉතො බහිද්ධා අඤ්ඤෙසු සමණබ්රාහ්මණෙසු ඔකාසකම්මම්පි නාලත්ථං, තෙ මෙ භගවතා බ්යාකතා. දීඝරත්තානුසයිතඤ්ච පන මෙ විචිකිච්ඡා-කථංකථාසල්ලං, තඤ්ච භගවතා අබ්බුළ්හන්ති."
            },
            {
                "type": "paragraph",
                "text": "22. අභිජානාසි. නො ත්වං දෙවානමින්ද ඉමෙ පඤ්හෙ අඤ්ඤෙ සමණබ්රාහ්මණෙ පුච්ඡිතා”ති."
            },
            {
                "type": "paragraph",
                "text": "“අභිජානාමහං භන්තෙ ඉමෙ පඤ්හෙ අඤ්ඤෙ සමණබ්රාහ්මණෙ පුච්ඡිතා”ති."
            },
            {
                "type": "paragraph",
                "text": "“යථා කථං පන තෙ දෙවානමින්ද බ්යාකංසු, සචෙ තෙ අගරු භාසස්සූ”ති."
            },
            {
                "type": "paragraph",
                "text": "“න ඛො මෙ භන්තෙ ගරු යත්ථස්ස භගවා නිසින්නො භගවන්තරූපො වා”ති."
            },
            {
                "type": "paragraph",
                "text": "“තෙන හි දෙවානමින්ද භාසස්සූ”ති."
            },
            {
                "type": "paragraph",
                "text": "“යෙස්වාහං භන්තෙ මඤ්ඤාමි සමණබ්රාහ්මණා ආරඤ්ඤකා පන්තසෙනාසනා’ති, ත්යාහං උපසඞ්කමිත්වා ඉමෙ පඤ්හෙ පුච්ඡාමි. තෙ මයා පුට්ඨා න සම්පායන්ති, අසම්පායන්තා මමං යෙව පටිපුච්ඡන්ති’ කො නාමො ආයස්මා?’ති. තෙසාහං පුට්ඨො බ්යාකරොමි: “අහං ඛො මාරිස, සක්කො දෙවානමින්දො’ති. තෙ මමං යෙව උත්තරිං පටිපුච්ඡන්ති ‘කිං පනායස්මා දෙවානමින්ද කම්මං කත්වා ඉමං ඨානං පත්තො’ති. තෙසාහං යථාසුතං යථාපරියත්තං ධම්මං දෙසෙමි. තෙ තාවතකෙනෙව අත්තමනා හොන්ති ‘සක්කො ච නො දෙවානමින්දො දිට්ඨො යඤ්ච නො අපුච්ඡිම්හ තඤ්ච නො බ්යාකාසී’ති. තෙ අඤ්ඤදත්ථු මමං යෙව සාවකා සම්පජ්ජන්ති, න චාහං තෙසං. අහං ඛො පන භන්තෙ භගවතො සාවකො සොතාපන්නො අවිනිපාතධම්මො නියතො සම්බොධිපරායණො”ති."
            },
            {
                "type": "page-break",
                "text": "430"
            },
            {
                "type": "paragraph",
                "text": "23. “අභිජානාසි නො ත්වං දෙවානමින්ද ඉතො පුබ්බෙ එවරූපං වෙද පටිලාභං සොමනස්සපටිලාභන්ති?”"
            },
            {
                "type": "paragraph",
                "text": "“අභිජානාමහං භන්තෙ ඉතො පුබ්බෙ එවරූපං වෙදපටිලාභං සොමනස්සපටිලාභන්ති.”"
            },
            {
                "type": "paragraph",
                "text": "“යථාකථං පන ත්වං දෙවානමින්ද අභිජානාසි ඉතො පුබ්බෙ එවරූපං වෙදපටිලාභං සොමනස්සපටිලාභන්ති?”"
            },
            {
                "type": "paragraph",
                "text": "“භූතපුබ්බං භන්තෙ දෙවාසුරසඞ්ගාමො සමුපබ්යූළ්හො අහොසි. තස්මිං ඛො පන භන්තෙ සඞ්ගාමෙ දෙවා ජිනිංසු, අසුරා පරාජයිංසු. තස්ස මය්හං භන්තෙ තං සඞ්ගාමං අභිවිජිනිත්වා විජිතසඞ්ගාමස්ස එතදහොසි: ‘යා චෙව දානි දිබ්බා ඔජා යා ච අසුරා ඔජා උභයමෙත්ථ දෙවා පරිභුඤ්ජිස්සන්තතී’ති. සො ඛො පන මෙ භන්තෙ වෙදපටිලාභො සොමනස්සපටිලාභො සදණ්ඩාවචරො සසත්ථාවචරො න නිබ්බිදාය න විරාගාය න නිරොධාය න උපසමාය න අභිඤ්ඤාය න සම්බොධාය න නිබ්බානාය සංවත්තති. යො ඛො පන මෙ අයං භන්තෙ භගවතො ධම්මං සුත්වා වෙදපටිලාභො සොමනස්සපටිලාභො, සො අදණ්ඩාවචරො අසත්ථාවචරො එකන්තනිබ්බිදාය විරාගාය නිරොධාය උපසමාය අභිඤ්ඤාය සම්බොධාය නිබ්බානාය සංවත්තතී”ති."
            },
            {
                "type": "paragraph",
                "text": "24. “කිං පන ත්වං දෙවානමින්ද අත්ථවසං සම්පස්සමානො එවරූපං වෙදපටිලාභං සොමනස්ස පටිලාභං පවෙදෙසී?”ති."
            },
            {
                "type": "paragraph",
                "text": "“ඡ ඛො අහං භන්තෙ අත්ථවසෙ සම්පස්සමානො එවරූපං වෙදපටිලාභං සොමනස්සපටිලාභං පවෙදෙමී”ති."
            },
            {
                "type": "gatha",
                "text": "“ඉධෙව තිට්ඨමානස්ස දෙවභූතස්ස මෙ සතො,\nපුනරායු ච මෙ ලද්ධො එවං ජානාහි මාරිසා”ති."
            },
            {
                "type": "paragraph",
                "text": "ඉමං ඛො අහං භන්තෙ පඨමං අත්ථවසං සම්පස්සමානො එවරූපං වෙදපටිලාභං සොමනස්සපටිලාභං පවෙදෙමි."
            },
            {
                "type": "gatha",
                "text": "චුතා’හං දිවියා කායා ආයුං හිත්වා අමානුසං, \nඅමූළ්හො ගබ්භමෙස්සාමි යත්ථ මෙ රමතී මනො."
            },
            {
                "type": "page-break",
                "text": "432"
            },
            {
                "type": "paragraph",
                "text": "ඉමං ඛො අහං භන්තෙ දුතියං අත්ථවසං සම්පස්සමානො එවරූපං වෙදපටිලාභං සොමනස්සපටිලාභං පවෙදෙමි."
            },
            {
                "type": "gatha",
                "text": "ස්වාහං අමූළ්හපඤ්ඤස්ස විහරං සාසනෙ රතො, \nඤායෙන විහරිස්සාමි සම්පජානො පටිස්සතො."
            },
            {
                "type": "paragraph",
                "text": "ඉමං ඛො අහං භන්තෙ තතියං අත්ථවසං සම්පස්සමානො එවරූපං වෙදපටිලාභං සොමනස්සපටිලාභං පවෙදෙමි."
            },
            {
                "type": "gatha",
                "text": "ඤායෙන මෙ චරතො ච සම්බොධි චෙ භවිස්සති, \nඅඤ්ඤාතා විහරිස්සාමි ස්වෙව මන්තො භවිස්සති."
            },
            {
                "type": "paragraph",
                "text": "ඉමං ඛො අහං භන්තෙ චතුත්ථං අත්ථවසං සම්පස්සමානො එවරූපං වෙදපටිලාභං සොමනස්සපටිලාභං පවෙදෙමි."
            },
            {
                "type": "gatha",
                "text": "__චුෙතා’හං__ මානුසා කායා ආයුං හිත්වාන මානුසං, \nපුන දෙව භවිස්සාමි දෙවලොකම්හි උත්තමො."
            },
            {
                "type": "paragraph",
                "text": "ඉමං ඛො අහං භන්තෙ පඤ්චමං අත්ථවසං සම්පස්සමානො එවරූපං වෙදපටිලාභං සොමනස්සපටිලාභං පවෙදෙමි."
            },
            {
                "type": "gatha",
                "text": "තෙ පණීතතරා දෙවා අකනිට්ඨා යසස්සිනො, \nඅන්තිමෙ වත්තමානම්හි සො නිවාසො භවිස්සති."
            },
            {
                "type": "paragraph",
                "text": "ඉමං ඛො අහං භන්තෙ ඡට්ඨං අත්ථවසං සම්පස්සමානො එවරූපං වෙදපටිලාභං සොමනස්සපටිලාභං පවෙදෙමි."
            },
            {
                "type": "paragraph",
                "text": "ඉමෙ ඛො අහං භන්තෙ ඡ අත්ථවසෙ සම්පස්සමානො එවරූපං වෙදපටිලාභං සොමනස්සපටිලාභං පවෙදෙමි."
            },
            {
                "type": "gatha",
                "text": "25. අපරියොසිතසඞ්කප්පො විචිකිච්ඡී කථංකථී,\nවිචරිං{1 විචරි - PTS.} දීඝමද්ධානං අන්වෙසන්තො තථාගතං."
            },
            {
                "type": "gatha",
                "text": "ය්යාස්සු මඤ්ඤාමි සමණෙ පවිවිත්තවිහාරිනො, \nසම්බුද්ධා{2 සම්බුද්ධො - PTS.} ඉති මඤ්ඤානො ගච්ඡාමි තෙ උපාසිතුං."
            },
            {
                "type": "gatha",
                "text": "කථං ආරාධනා හොති කථං හොති විරාධනා, \nඉති පුට්ඨා න සම්භොන්ති{3 සම්පායන්ති - සීමු.} මග්ගෙ පටිපදාසු ච."
            },
            {
                "type": "page-break",
                "text": "434"
            },
            {
                "type": "paragraph",
                "text": "ත්යාස්සු යදා මං ජානන්ති සක්කො දෙවානමාගතො. \nත්යාස්සු මමෙව පුච්ඡන්ති කිං කත්වා පාපුණී ඉදං."
            },
            {
                "type": "gatha",
                "text": "තෙසං යථාසුතං ධම්මං දෙසයාමි ජනෙසුත, \nතෙන අත්තමනා හොන්ති{1 තෙ නස්සතතමනා - PTS.} දිට්ඨො නො වාසවො’ති ච."
            },
            {
                "type": "gatha",
                "text": "යදා ච බුද්ධමද්දක්ඛිං විචිකිච්ඡාවිතාරණං, \nසො’ම්හි වීතභයො අජ්ජ සම්බුද්ධං පයිරුපාසිය{2 පයිරු පාසයිං - මඡසං.}"
            },
            {
                "type": "gatha",
                "text": "තණ්හාසල්ලස්ස හන්තාරං බුද්ධමප්පටිපුග්ගලං\nඅහං වන්දෙ මහාවීරං බුද්ධමාදිච්චබන්ධුනං{3 චන්දමාදිච්චබන්ධුනං - PTS.}"
            },
            {
                "type": "gatha",
                "text": "යං කරොමසි{4 යං කරොමසො - PTS.} බ්රහ්මුනො සමං දෙවෙහි මාරිස, \nතදජ්ජ තුය්හං කස්සාම හන්ද සාමං කරොම තෙ."
            },
            {
                "type": "gatha",
                "text": "ත්වමෙව අසි සම්බුද්ධො තුවං සත්ථා අනුත්තරො, \nසදෙවකස්මිං ලොකස්මිං නත්ථි තෙ පටිපුග්ගලො”ති."
            },
            {
                "type": "paragraph",
                "text": "26. අථ ඛො සක්කො දෙවානමින්දො පඤ්චසිඛං ගන්ධබ්බපුත්තං ආමන්තෙසි. බහූපකාරො ඛො මෙ’සි ත්වං තාත පඤ්චසිඛං යං ත්වං භගවන්තං පඨමං පසාදෙසි. තයා තාත පඨමං පසාදිතං පච්ඡා මයං තං භගවන්තං දස්සනාය උපසඞ්කමිම්හ අරහන්තං සම්මාසම්බුද්ධං. පෙත්තිකෙ ච ඨානෙ ඨපයිස්සාමි, ගන්ධබ්බරාජා භවිස්සසි, භද්දඤ්ච තෙ සූරියවච්ඡසං දම්මි, සා හි තෙ අභිපත්ථිතා”ති. "
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො සක්කො දෙවානමින්දො පාණිනා පඨවිං පරාමසිත්වා තික්ඛත්තුං උදානං උදානෙසි: “නමො තස්ස භගවතො අරහතො සම්මාසම්බුද්ධස්ස, නමො තස්ස භගවතො අරහතො සම්මාසම්බුද්ධස්ස, නමො තස්ස භගවතො අරහතො සම්මාසම්බුද්ධස්සා”ති."
            },
            {
                "type": "paragraph",
                "text": "ඉමස්මිඤ්ච පන වෙය්යාකරණස්මිං භඤ්ඤමානෙ සක්කස්ස දෙවානමින්දස්ස විරජං වීතමලං ධම්මචක්ඛුං උදපාදි “යං කිඤ්චි සමුදයධම්මං සබ්බං තං නිරොධධම්මන්ති.” අඤ්ඤෙසඤ්ච අසීතියා දෙවතාසහස්සානං. "
            },
            {
                "type": "paragraph",
                "text": "ඉති යෙ සක්කෙන දෙවානමින්දෙන අජ්ඣිට්ඨපඤ්හා පුට්ඨා, තෙ, භගවතා බ්යාකතා. තස්මා ඉමස්ස වෙය්යාකරණස්ස සක්කපඤ්හා’ත්වෙව අධිවචනන්ති."
            },
            {
                "type": "centered",
                "text": "සක්කපඤ්හසුත්තං නිට්ඨිතං අට්ඨමං.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "pages": {
            "396": {
                "pageNum": 396,
                "footnotesCount": 1
            },
            "398": {
                "pageNum": 398,
                "footnotesCount": 5
            },
            "400": {
                "pageNum": 400,
                "footnotesCount": 5
            },
            "402": {
                "pageNum": 402,
                "footnotesCount": 0
            },
            "404": {
                "pageNum": 404,
                "footnotesCount": 0
            },
            "406": {
                "pageNum": 406,
                "footnotesCount": 0
            },
            "408": {
                "pageNum": 408,
                "footnotesCount": 0
            },
            "410": {
                "pageNum": 410,
                "footnotesCount": 0
            },
            "412": {
                "pageNum": 412,
                "footnotesCount": 0
            },
            "414": {
                "pageNum": 414,
                "footnotesCount": 1
            },
            "416": {
                "pageNum": 416,
                "footnotesCount": 0
            },
            "418": {
                "pageNum": 418,
                "footnotesCount": 0
            },
            "420": {
                "pageNum": 420,
                "footnotesCount": 0
            },
            "422": {
                "pageNum": 422,
                "footnotesCount": 0
            },
            "424": {
                "pageNum": 424,
                "footnotesCount": 0
            },
            "426": {
                "pageNum": 426,
                "footnotesCount": 0
            },
            "428": {
                "pageNum": 428,
                "footnotesCount": 0
            },
            "430": {
                "pageNum": 430,
                "footnotesCount": 0
            },
            "432": {
                "pageNum": 432,
                "footnotesCount": 3
            },
            "434": {
                "pageNum": 434,
                "footnotesCount": 4
            }
        }
    },
    {
        "filename": "1-9-10-43-70",
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "397"
            },
            {
                "type": "centered",
                "text": "8.",
                "level": 3
            },
            {
                "type": "heading",
                "text": "සක්කපඤ්හ සූත්‍රය",
                "level": 3
            },
            {
                "format": 13,
                "text": "මා විසින් මෙසේ අසන ලදි:\nඑක් කලෙක භාග්‍යවතුන් වහන්සේ මගද රටෙහි, රජගහ පුරයට පෙර දිගැ අඹ සඬ නම් යම් බමුණු ගමෙක් වී ද, එයට උතුරු දිගැ වේදියත නම් පව්වෙහි ඉඳුසලු ලෙනැ වැඩ වෙසෙති. එ සමයෙහි සක් දෙවිඳුට භගවත් බුදුරජු දක්නට උත්සුක බවෙක් උපන. එ කල්හි ඔහුට ‘අර්හත් සම්‍යක්සම්බුද්ධ වූ භාග්‍යවතුන් වහන්සේ දන් කොහි වැඩ වසන ‍සේක් දෝ?’ යි මේ සිත විය. සක් දෙවිඳු මගද රටැ රජගහ නුවරට පෙර දිගැ අඹසඬ නම් යම් බමුණුගමෙක් වී ද, එයට උතුරු දිගැ වේදියක පව්වෙහි ඉඳුසල් ලෙනැ භගවත් බුදුරජුන් වැඩ වසන්නවුන් දුටුයේ ම ය. දැක, තවුතිසා වැසි දෙවියන් බණවා, “නිදුකාණනි, මේ භාග්‍යවතුන් වහන්සේ මගද රටැ රජගහ නුවරට පෙර දිගින් අඹසඬ නම් යම් බමුණුගමෙක් ඇද්ද, එයට උතුරු දිගැ වේදියක නම් පව්වෙහි ඉඳුසල් ලෙනෙහි වැඩ වසන සේක. නිදුකාණනි, ඉදින් අපි ඒ අර්හත් සම්‍යක්සම්බුද්ධ භාග්‍යවතුන් වහන්සේ දක්නට එළඹෙන්න‍මෝ නම් ඒ ඉතා යෙහෙකැ” යි මෙ බස් පැවැසී ය. ‘එසේ ය පින්වතුන් වහන්සැ’ යි ම තව්තිසා වැසි දෙවියෝ සක් දෙවිඳුට පිළිවදන් දුන්හ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "2. ඉක්බිති සක් දෙවිඳු පන්සිළු ගඳැවු පුතු බණවා, ‘දරුව පන්සිළු, මේ භාග්‍යවතුන් වහන්සේ මගද රටැ රජගහ නුවරට පෙර දිගැ අඹසඬ නම් යම් බමුණු ගමෙක් ඇද්ද, එයට උතුරු දිගැ වේදියක පව්වෙහි ඉඳුසල් ලෙනැ වැඩ වසන සේක. දරුව පන්සිළුව, අපි ඒ අර්හත් සම්‍යක්සම්බුද්ධ භාග්‍යවතුන් වහන්සේ දක්නා පිණිස ඔබ වෙත එළඹෙන්නමෝ නම් ඉතා යෙහෙකැ’ යි කී ය. ‘එසේ ය, ඔබට වැඩෙක් වේවා’ යි පන්සිළු ගඳෙවු දෙව්පුත් තෙම සක් දෙවිඳුට පිළිවදන් දී බේළුවපාණ්ඩු වීණාව ගෙන සක් දෙවිඳු අනුව යන බවට වන (අනුව යන්නට නික්මිණ.) ඉක්බිති සක් දෙවිඳු තව්තිසා වැසි දෙවියන් විසින් පිරිවැරුණේ පන්සිළු ගඳෙවු දෙව්පුතු විසින් පෙරටු කරන ලදුයේ බල ඇති මිනිසක්හු වක් කළ අතක් දික් කරන සේ ම දික් කළ අතක් හෝ වක් කරන සේ ම (කෙණෙන්) තව්තිසා දෙව් ලොවින් අතුරු දන් වැ මගද රටැ රජගහ නුවරට පෙර දිගැ පිහිටි අඹ සඬ බමුණු ගමට උතුරු දිගැ වේදියක පව්වෙහි පහළ විය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "399"
            },
            {
                "format": 13,
                "text": "3. එ සමයෙහි වනාහි දෙවියන්ගේ දෙව් තෙදින් සෙයින් වේදියක පව්ව ද අඹසඬු බමුණුගම ද ඉතා ම බැබැලුණේ විය. ඒ කොතරම් මහත් වැ බැබැලුණේ ද යත හොත්: අවට ගම්හි මිනිස්සු “අද වේදියක පව්ව ගිනි ඇවිලගත්තේ වන, අද වේදියක පව්ව දැවෙන්නේ වන. අද වේදියක පව්ව දල්වෙනුයේ වන, අඹසඬු නියම්ගම ද ඉතා ම එකලු වැ ඇතැ’ යි සතුටු සොම්නස් වැ පිපී ගිය ලොම් ඇත්තෝ වූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එක ලැ සක්දෙවිඳු ගඳෙවු දෙව්පුත් පන්සිළුහු බණවා, “දරුව පන්සිළු, දහන් කරන, දහන්හි ඇලුණු, මේ දැන් චිත්තවිවේකයෙහි යෙදුණු තථාගතයන් කරා මා වැන්නක්හු විසින් දුක සේ එළැඹිය යුතු ද! දරුව පන්සිළු, ඉදින් තෝ පළමු කොට භාග්‍යවතුන් වහන්සේගේ සිත් ගත්තෙහි වී නම්, දරුව, පළමු කොට තා විසින් පහදවා ගන්නා ලද සිතැති ඒ භගවත් අර්හත් සම්‍යක්සම්බුද්ධයන් වහන්සේ දක්නට පසු වැ අපි එළඹෙන්නම් හ’ යි කී ය. පන්සිළු ගඳෙවු දෙව්පුත් ‘එසේ යැ, ඔබට වැඩෙක් වේව’ යි සක් දෙවිඳු කී බස පිළිගෙන, බේළුවපාණ්ඩු වීණාව ගෙනැ, ඉඳු සලු ලෙන කරා එළඹියේ ය, එළැඹ, ‘මෙතෙකින් භාග්‍යවතුන් වහන්සේ මට ඉතා දුර ද නො වන්නේ ය, ඉතා ළං ද නො වන්නේ ය, මගේ කටහඬ ද ඔබ අසන්නාහ’ යි සිතා, එක් පසෙක සිටියේ ය. එක් පසෙක සිටියේ ම බේළුව පාණ්ඩු වීණාව හැඬැවී ය. බුදුරජුන් පිළිබඳ වූ ද දහම පිළිබඳ වූ ද රහතුන් පිළිබඳ වූ ද කාමගුණ හා පිළිබඳ වූ ද මේ ගාථා ගැයි ය:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "4. ගාථාවල අදහස :\n“ළහිරුරස් බඳු සිරුර කැලුම් ඇති, හැම සිරුරඟින් හොබනා, මට සතුට දනවන සොඳුරිය, තෝ යමක්හු කරණ කොට ගෙන උපන් නෙහි ද, තීගේ පිය වූ ඒ තිම්බරු නම් ගඳැවු රජුහු වඳිමි.\n‘ළහිරු රස් සෙයින් නැඟෙන සිරුරු කැලුම් ඇත්තිය, හොබනා අඟපසඟ ඇත්තිය, මට සතුට දෙනුවිය, සොඳුර, යමක්හු කරණ කොට ගෙන තෝ උපන්නෙහි ද, තීගේ පිය වූ තිම්බරු නම් ගඳෙවු රජුහු වඳිමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සොසුලුවනට සුළඟ සේද, පැවැසියනට පැන් සේද, රහත්නට දහම් සේ ද තෝ මට ප්‍රියයෙහි ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ගිලන්හට බෙහෙද සේ ද, සා ඇතියනට බොජුන් සේ ද තෝ මට ප්‍රියයෙහි ය. සොඳුර, ඇවිලෙන ගින්න දියෙන් සේ (තී නිසා උපන් කාමරාග දවිල්ලෙන් තැවුණු) මා නිවව.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "401"
            },
            {
                "format": 13,
                "text": "ගිම් තැවුලෙන් බෙහෙවින් තැවුණු ඇතක්හු පියුම් කෙසුරුයෙන් යුත් සිහිල් දිය ඇති පොකුණකට බස්නහු සෙයින් (කවර දා) මම් ති ගේ තනබඩ තුරට බස්නෙම් දෝ!",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අකුස ඉක්මි (අකුසින් මැඩැලිය නො හෙන) ඇතක්හු ‘කම්මුල විදුනා කටුවත් පා විදුනා කටුවත් මා විසින් දිනන ලදැ’ යි මදයෙන් මත් බැවින් කරුණු නො දන්නා සේ, තී ගේ ලක්ෂණ සම්පන්න ඌරු යුගලයෙන් මත් වූ මම් රාගය දුරැ ලන්නට කිසි දු කරුණක් නො දනිමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "තී කෙරෙහි ගිජු වූ සිතැත්තෙමි. ම සිත පෙරැළී ගියේ ය. බිලිය ගිල ගත් මසක්හු සෙයින් තී කෙරෙහි බැඳුණු සිත මුදා ගන්නට නො හැක්කෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මනා ඌරු යුගලයක් ඇති සොඳුර, මා වැලැඳැ ගන්න. මඳ බැල් මෙන් බලන ඇසැත්තිය මා වැලැඳැ ගන්න, කල්‍යණිය, මා හාත්පසින් වැලැඳ ගන්න. මෙය මා වෙසෙසින් පැතූ දෑ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "රහතක්හට දුන් මඳ වූ ද දක්ෂිණාව මහත් පල දෙන්නා සේ, අක් බඹුරු කෙහෙ ඇති තී කෙරෙහි මට ඇති වූ ස්වල්ප (එක්) කාමුක සිත දන් නොයෙක් බව් ඇත්තේ (මහත් බවට පැමිණියේ) වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සියලු අවයවයන්හි සොඳුරු බව ඇත්තිය, අට ලෝ දහමින් නො සැලෙන රහතුන් විෂයයෙහි මා කළ යම් පිනෙක් ඇද්ද, එය තී සහිතවූ මට පල දේවා.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "හැම අවයවයන්හි සොඳුරුබව ඇත්තිය, මේ පොළෝ මඬලැ මා කළ යම් පිනෙක් ඇද්ද, ඒ සියල්ල තී සහිත වූ මට පල දේ වා.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සූය්‍යර්‍ වර්චසාව, සැහැපුත් මුනිහු දහන් වැඩීමෙන් එකඟ සිතැති වැ, ප්‍රඥායෙන් යුක්ත වැ, සිහි ඇති වැ නිවන් සොයා ගියා සේ, මම් තී සොයා යෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කල්‍යණ අඟ පසඟ ඇත්තිය, සැහැමුනිහු උතුම් සම්බෝධිය ලැබ යම් සේ සතුටු වූහු ද, එසේ ම මම තී හා එක්වීම ලැබුයෙම් සතුටු වන්නෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "තවතිසා වැස්සනට අධිපති සක් දෙවිඳු මට වරයක් දෙන්නේ වී නම්, සොඳුර, දෙ දෙව් ලොව රජයද හැරපියා තී ම පතන්නෙමි. තී.කෙරෙහි මා ඇල්ම මේ සා දැඩි ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සොඳුරු නුවණැත්තිය, යමකුහට තී සේ වූ දූවක් ඇද්ද, බොහෝ කලකට පසු අළුතැ පිපුණු සල් රුකක් බඳු (තී නිසා සිරිමත් වූ) ති ගේ ඒ පියා වඳිමින් නමදිමි.”",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "403"
            },
            {
                "format": 13,
                "text": "5. පන්සිළුහු මෙසේ කී කල්හි භාග්‍යවතුන්වහන්සේ ඔහු අමතා, “පන්සිළුව, තගේ වෙණෙහි තත් හඬ තගේ ගී හඬ හා ද, තගේ ගී හඬත් තත් හඬ හා ද සැසැඳේ. පන්සිළුව, තගේ තත් හඬ ගී හඬ නො ඉක්මෙයි. තගේ ගී හඬත් තත්හඬ ඉක්මැ නො යෙයි. පන්සිළුව, බුදුගුණ අසළ, දහම් ගුණ අසළ, සඟ ගුණ අසළ, රහත් ගුණ අසළ, කම් ගුණ අසළ, මේ ගාථා තා විසින් කවර දාක රැසැයිණි දැ?” යි අසා වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වහන්ස, භාග්‍යවතුන් වහන්සේ බුදු වූ අළුත එක් සමයෙක උරුවෙල් දනවුයෙහි නිල්දලා ගං තෙරැ අජපල් නුග මුලැ වැඩ වෙසෙති. වහන්ස, එ සමයෙහි මම් තිම්බරු නම් ගඳැවු රජුහු දූ වූ භිරුරස් බඳු ශෝභා ඇති භද්‍රා නම් යම් දෙවඟනක් වේ ද, ඇය පතන්නෙම් වීමි. වහන්ස, ඒ ගඳැවු දූ අනෙකක්හු පතන්නී ය. මාතලි නම් රියැදුරා පුත් සිඛණ්ඩී නම් ගඳැවු පුතෙක් ඇත. ඕ ඔහු පතන්නී ය, වහන්ස, යම් විටෙක කිසිදු කරුණෙකින් ඒ ගඳෙවු දුව නො ලදුයෙම් ද, එ විට මම් බේළුව පණ්ඩු වීණාව ගෙන, තිම්බරු ගඳැවු රජුහු නිවෙස කරා එළැඹියෙමි, එළැඹ ඒ වෙණ හැඬැවීමි. බුදුගුණ අසළ, දහම් ගුණ අසළ, සඟ ගුණ අසළ, රහත් ගුණ අසළ, කාමගුණ අසළ, මේ ගාථා ද ගැයිමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“ළහිරු රස්බඳු සිරුරු කැලුමැති හැම සිරුරඟින් හොබනා, මට සතුට දනවන සොඳුරිය, තෝ යමක්හු කරණකොටගෙන උපන්නෙහි ද, තිගේ පිය වූ ඒ තිම්බරු නම් ගඳැවු රජුහු වඳිමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සොඳුරු නුවණැත්තිය, යමකු හට තී සේ වූ දූවක් ඇද්ද, බොහෝ කලකට පසු අළුතැ පිපුණු සල් රුකක් බඳු (තී නිසා සිරිමත් වූ) තිගේ ඒ පියා වඳිමින් නමදිමි” යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "6. වහන්ස, මෙසේ මා ගැයූ කල්හි සූර්‍ය්‍යවර්චසීනම් වූ ඒ භද්‍රා තොමෝ “නිදුකාණනි, ඒ භාග්‍යවතුන් වහන්සේ මා විසින් හමුයෙහි නො දක්නා ලද සේක. එතෙකුදු වුවත් තව්තිසා වැසි දෙවියන්ගේ සුදම් සෙබෙහි නටන මා විසින් ඒ භාග්‍යවතුන් වහන්සේ අසන ලදහ. (ඒ භාග්‍යවතුන්ගේ තතු අසන ලදුයේ ය). නිදුකාණනි, යම් හෙයෙකින් ඔබ ඒ භගවත් බුදුරජුන්ගේ ගුණ කියත් ද, එ හෙයින් අද අපගේ සමාගමය වේ වා’ යි කිවූ ය. වහන්ස, එ දා ඒ දෙව් දූ හා සමාගමය විය. එයින් පසු දැන් (මේ දවස දක්වා) එසේ වූ සමාගමයෙක් නො වී යැ” යි පන්සිළු කීය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එවිට සක්ඳෙවිඳුට “පන්සිළු ගඳැවු දෙව්පුත් භගවත් බුදුරජුන් හා කතා බස් කෙරෙයි. භගවත්හු ද පන්සිළු හා කතා කෙරෙති” යි මේ සිත විය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "405"
            },
            {
                "format": 13,
                "text": "7. ඉක්බිති සක් දෙවිඳු පන්සිළු ගඳැවු දෙව්පුතු ඇමතී ය. “දරුව පන්සිළුව, ‘වහන්ස, ඇමැත්තන් සහිත පිරිවර ජනයා සහිත සක්දෙවිඳු භාග්‍යවතුන් වහන්සේගේ සිරිපතුල් හිස නමා වඳී” යැ යි කියා මගේ වැඳුමෙන් භාග්‍යවතුන් වහන්සේ වඳුව” යි කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘එසේ ය, ඔබට වැඩෙක් වේව’ යි ම පන්සිළු ගඳැවු දෙව් පුත් සක්දෙව් බස පිළිගෙන, ‘වහන්ස, ඇමැත්තන් සහිත පිරිවර ජනයා සහිත සක්දෙවිඳු භාග්‍යවතුන් වහන්සේගේ සිරිපතුල් හිස නමා වඳී” යැ යි කියා භගවත් බුදුරජුන් සාදර වැ වැන්දේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“පන්සිළුව, මෙසේ ඇමැතියන් සහිත, පිරිවර ජනයා සහිත සක් දෙවිඳු සුව පත් වේ වා. දෙවියෝත් මිනිස්සුත් අසුරයෝත් නාගයෝත් ගන්ධර්වයෝත් මෙයින් අන්‍ය යම් බොහෝ සත්ව කෙනෙක් වෙත් නම් ඔහු හැම ද යන මේ සියල්ලෝ සුව කැමැත්තාහු ම ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "තථාගතවරු වනාහි මහත් යශස් ඇති මෙ බඳු යක්ෂයනට ඔවුන්ගේ වැඳීම පිළිගැනුම් විසින් මෙසේ වදාරත්” යැ යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "8. මෙසේ භගවත් බුදුරජුන් විසින් ආසිරි බසින් සෙත් පතනු ලැබූ සක් දෙවිඳු ඉඳුසලු ලෙන් වැද, භාග්‍යවත් බුදුරජුන් වැඳ, එක් පසෙක සිටියේ ය. තව්තිසා වැසි දෙවියෝ ද, ඉඳුසල් ලෙන් වැද, භගවත් බුදුරජුන් වැඳ, එක් පසෙක සිටියා හ. පන්සිළු ගඳැවු දෙව් පුත් ද ඉඳුසල් ලෙන් වැද භගවත් බුදුරජුන් වැඳ එක් පසෙක සිටියේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එ සමයෙහි වනාහි පියෙවියෙන් විසම වූ ඉඳුසල් ලෙන දෙවියන්ගේ දේවානුභාවයෙන් සෙයින් සම විය, එය පියෙවියෙන් ඉඩ මඳ වූ නමුදු එ සමයෙහි මහත් ඉඩ ඇතියේ විය. ලෙනෙහි අඳුර පහ විය. එළිය පහළ විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති භගවත්හු සක්දෙවිඳුහු අමතා, “එසා බොහෝ කිස් ඇති, එසා බොහෝ කටයුතු ඇති, ආයුෂ්මත් කෞෂිකයන්ගේ මෙහි මේ යම් පැමිණිමෙක් වේ ද, එය ආශ්චර්‍ය්‍ය ය, ආයුෂ්මත් කෞෂිකයන්ගේ මේ ඊම අද්භූත යැ” යි වදාළාහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වහන්ස, බොහෝ දවසෙක සිට මැ භාග්‍යවතුන් වහන්සේ දක්නට එනු කැමැති වීමි. එහෙත් තව්තිසා වැසි දෙවියන්ගේ වැඩ කටයුතු වල ව්‍යාපෘත වූයෙම් ම භාග්‍යවතුන් වහන්සේ දක්නට එනු නො හැකි විමි. වහන්ස, එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අසල (දෙව් රම්හි) සළලාගාර ගඳකිළියෙහි වසන සේක. වහන්ස, එ කල, මම් භාග්‍යවතුන් වහන්සේ දක්නට සැවැත් නුවරට ගියෙමි. එ සමයෙහි වනාහී භාග්‍යවතුන් වහන්සේ එක්තරා සමාධියෙකින් හුන් සේක් වෙති.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "407"
            },
            {
                "format": 13,
                "text": "වෙසවුණු රජුගේ භුංජතී නම් පාදපරිචාරිකාවක් දොහොත් මුදුන් තබා වැඳ ගෙන භාග්‍යවතුන් වහන්සේ ඉදිරියෙහි සිටියා ය. වහන්ස, එ කල මම් භුංජතිය බණවා, ‘බිහිනිය, තෝ ඇමැතියන් සහිත පිරිවර ජනයා සහිත සක් දෙවිඳු භාග්‍යවතුන් වහන්සේගේ සිරිපා වඳී යැ යි කියා මගේ වවනයෙන් භාග්‍යවතුන් වහන්සේ වඳුව’ යි කීමි, වහන්ස, මා එසේ කී කලැ ඒ භුංජතී තොමෝ ‘නිදුකාණනි, දැන් භාග්‍යවතුන් වහන්සේ දක්නට නො කල් ය. භාග්‍යවතුන් වහන්සේ සමවත් සම වැද වැඩ ඉන්නා සේකැ’ යි කිවු ය. ‘බිහිනිය, එසේ වී නම්, යම් විටෙක භාග්‍යවතුන් වහන්සේ ඒ සමාධියෙන් නැඟී සිටින සේක් ද, එ විටැ ‘වහන්ස, ඇමැත්තන් සහිත පිරිවර ජනයා සහිත සක් දෙවිඳු භාග්‍යවතුන් වහන්සේගේ සිරිපා වඳී’ යැයි මගේ වචනයෙන් භාග්‍යවතුන් වහන්සේ වඳුව’ යි කීමි. වහන්ස, කිමෙක් ද? මා බසින් ඒ බිහිනී භාග්‍යවතුන් වහන්සේ වැන්දා ද? භාග්‍යවතුන් වහන්සේ ඇගේ වචනය සිහි කරන සේක් දැ?” යි සක්දෙවිඳු කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“දෙවිඳ, ඒ බිහිනී මා වැන්දා ය. මම් ඇගේ වචනය සිහි කරමි. තව ද ආයුෂ්මත්හුගේ රියෙහි නිම්වලල්ල හඬ නඟන්නා හා ම මම් සමවතින් නැඟී සිටියෙමි” යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වහන්ස, යම් කලෙක අර්හත් සම්‍යක්සම්බුද්ධ තථාගත කෙනෙක් ලොවැ උපදනාහු ද, ඒ කලැ දෙව් මුළුහු පිරෙත්, අසුර මුළුහු පිරිහෙත්’ යන මෙ කරුණ අපට පෙරටු වැ තව්තිසා දෙව්ලොවැ ඉපිදැ සිටි දෙවියන් හමුයහි දී මා විසින් අසන ලද්දේ ය, ඔවුන් හමුයහි දී පිළිගන්නා ලද්දේ ය. වහන්ස, ‘යම් කලෙක තථාගත අර්හත් සම්‍යක්සම්බුද්ධ කෙනෙක් ලොවැ පහළ වන්නෝ ද, එ කලැ දෙව්මුළුහු පිරෙත්, අසුර මුළුහු පිරිහෙත්’ යන මෙ කරුණ මා විසින් සියැසින් ම දක්නා ලද්දේ ය. වහන්ස, මෙ කිඹුල්වත් පුරෙහි ම බුදුරුවන්හි පහන්, දමුරුවන්හි පහන්, සඟුරුවන්හි පහන්, සිල් සපුරා රක්නා සුලු ගෝපිකා නම් සැහැ දූවක් වූ ය. ඕ ගැහැනු බවට ඇලුම් හැරැ පියා පිරිමි බව පතා, කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට, තව්තිසා වැසි දෙවියන්ගේ සහභාවයට පැමිණියා, අපගේ පුත් බව ලැබූහ. එහි දූ ඔහු ‘ගෝපක දෙව් පුතැ’ යි ‘ගෝපක දෙව් පුතැ’ යි දනිත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "9. වහන්ස, අන් මහණහු ති දෙනෙක් භාග්‍යවතුන් වහන්සේ කෙරෙහි බඹසර කොට හීන වූ ගඳැවු මුළුවෙක උපන්නාහුය. ඔහු පස් කම් ගුණයන්ගෙන් සමර්පිත වැ සමන්විත වැ පසිඳුරන් හසුරුවන්නාහු, ගැයුම් වැයුම් ආදියෙන් අපට වත් කරනුවට අප උවටන් හලට එත්. අපට වත් කරනුවට අප උවටන් හලට ආ ඔවුනට ගෝපක දෙව්පුත් තෙම ‘නිදුකාණනි, තෙපි කොහි යොමු කළ මුහුණු ඇති වැ ඒ භාග්‍යවතුන් වහන්සේගේ දහම් ඇසූහු ද? මම් වනාහි ස්ත්‍රියක් ව සිට ද බුදුරුවන් දමරුවන් සඟුරුවන් කෙරෙහි පහන් වැ, සිල් පුරන්නීම් ඉතිරිබව්හි ඇල්ම හැරැ පියා, පිරිමිබව් පතා කාබුන් මරණින් මතු මනා ගති ඇති සග ලොවට, තව්තිසා වැසි දෙවියන් හා එක් වීමට පැමිණියෙම්, සක් දෙවිඳුගේ පුත් බව ලදිමි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "409"
            },
            {
                "format": 13,
                "text": "මෙහිදු මා ‘ගොපක දෙව් පුතැ’ යි දනිත්. නිදුකාණනි, තෙපි වූ කලි භාග්‍යවතුන් වහන්සේ කෙරෙහි බඹසර කොට, හීන වූ ගඳැවු රැහැට වන්නහු ය. භවත්නි, යම්බඳු වූ ඇපි හීන වූ ගඳැවු රුහැකැ උපන් සහදැමියන් දකුමෝ ද, ඒ අපි නො දැක්ක යුතු දැයක් දුටුම්හ’ යි ඔවුනට චෝදනා කළේ ය. වහන්ස, ගොපක දෙව්පුතු විසින් චෝදිත (සිහි කරවන ලද) ඒ තිදෙනා අතුරෙන් දෙදෙනෙක් දෙව්හු මෙ අත් බව්හි ම පළමු දහන් සිහිය පිළිලැබ (ධ්‍යානය පාදක කොට විවසුන් වඩා ඇනැගැමි පෙලෙහි පිහිටා) එ කෙණෙහි ම සැවැ බඹ ලොවැ, බඹපෙරෙවි (බ්‍රහ්මපුරෝහිත) අත් බව ලදුහ. එක් දෙවියෙක් වනාහි කාමයන්හි ඇලුණේ එහි මැ රැඳුණේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "(එයින් කීහු සංගීතිකාරයෝ:)\n10. “පසැස් ඇතියාණන්ගේ උවැසියක් වීමි. මගේ නම ‘ගොපිකා’ යි විය. බුදුරුවන්හි ද දමුරුවන්හි ද වෙසෙසින් පැහැදුණු මම් පහන් සිතැති ව සඟුරුවනට උවටන් කෙළෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එ බුදුරජුගේ ම දහමැ සොඳුරු බව් හෙයින් සක්දෙවිඳුගේ මහ තෙදැතිපුතෙක් වැ තිදසපුරැ උපනිමි. මෙහි ද මා ගෝපක යැ’ යි දනිත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති පෙරැ දුටුවිරූ, (පෙරැ) දහන් ලැබ සිට, ගඳෙවු දෙව් රැහේ උපන් මහණුන් දිටිමි. යම් බඳු අපි පෙරැ මිනිස් වූමෝ, සිය නිවෙස්හි දී පා දෙවීම් ආදි විසින් සංග්‍රහ කොට, ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "අහරින් පැනින් යම් කෙනකුන්හට උවටන් කළමෝ ද, මේ ඒ ගොයුම්සව්වෝ යැ. මේ භවත්හු කවර අතක් බලා ගත්තාහු, බුදු රජුන්ගේ දහම් පිළිගත්තෝ ද?"
            },
            {
                "format": 13,
                "text": "පසැසියාණන් දැන දෙසූ දහම තමා විසින් ම දත යුතු ය. මම් ද තොප සෙයින් - තොප ම ඇසුරු කෙරෙමින් - ආර්‍ය්‍ය වූ බුදුරජුන්ගේ සුභාෂිතයන් තොප ගෙන් අසා පිළිපැද, ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "තිදස් ලොවැ උපන්නෙම්, සක්දෙවිඳුට මහානුභාව ඇති මහ තෙදැති පුතෙක් වීමි. තෙපි වනාහි උතුම් බුදුරජුන් ඇසුරු කරමින් ලොවුතුරු සසුන් බඹසර සරා, "
            },
            {
                "type": "paragraph",
                "text": "පහත් දෙව්මුළුවෙක උපන්හු ය. භවතුන්ගේ මේ ඉපැත්ම (ඔබ කළ මහණදමට) නො සරි ලන සේ ය. හීන වූ දෙව් මුළුවෙක උපන් සහදැමි වූ තොප දක්නා ඇපි නො දැක්ක යුතු දැක්මක් දුටුම්හ."
            },
            {
                "format": 13,
                "text": "භවත්හු ගඳැවු දෙව් රැහෙහි උපන්නාහු, සක් දෙවිඳුට වත් සපයනුවට එන්නාහ. ගිහි ගෙහි වුසූ මගේත් මහණ කම් කළ තොපගේත් මේ වෙසෙස දකිවු.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "411"
            },
            {
                "format": 13,
                "text": "පෙරැ ස්ත්‍රී වූ ඒ මම් අද දෙව් කම්සුවෙන් යුත් පිරිමියෙකිමි” ගෝපක දෙව්පුතු කරා පැමිණ, ගොයුම් සවු වූ ඔහු විසින් චෝදිත වූ ඒ ගඳැවු දෙව් පුත්තු සංවේගයට පැමිණියාහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඔවුන්ගෙන් දෙදෙනෙක් ‘දැන් ඇපි වැර වඩමු, වෑයම් කරමු, ඇපි මෙරමාහට මෙහෙ කරුවෝ නො වමෝ ව’ යි කියා, ගොයුම් බුදුරජුන්ගේ අනුශාසනා සිහි කොට කමටහන්හි වැර වැඩූහ. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඔහු මෙහි දී ම පස්කම්හි ඇලුණු සිත් පහ කොට, කාමයන්හි දොස් දුටුහ. ඔහු ඉක්මෙනුවට දුෂ්කර වූ මරහුගේ බැඳුම් වූ කාම සංයෝජන ද කාම බන්ධන ද, ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "ඇතක් හු යදම්සෙයින් සිඳැ පියා, තව්තිසා වැසි දෙවියන් ඉක්මැ (බඹලෝ) ගියහ. ඉන්ද්‍රයා සහිත වූ ද, ප්‍රජාපතිහු සහිත වූ ද දෙව් සෙබෙහි යම් දෙවි කෙනෙක් හුන්නාහු ද, "
            },
            {
                "type": "paragraph",
                "text": "එසේ හුන් ඒ දෙවියන් අතුරෙන් ශූර වූ ඔහු රාග රජස් දුරැ ලන්නාහු (අනැගැමි මඟ වඩන්නාහු), පහවූ රාග ඇත්තාහු, සෙසු දෙවියන් ඉක්මැ ගියාහ. දෙවියන් මැදැ සෙසු දෙවියන් අබිබවා සිටි සක් දෙවිඳු, "
            },
            {
                "type": "paragraph",
                "text": "‘හීන දෙව් මුළුවෙක උපන් මොහු වනාහි (දහන් වඩා) තව්තිසා වැසි දෙවියන් ඉක්මැ යෙත් යැ’ යි සංවේගය පහළ කෙළේ ය. හටගත් සංවේග ඇති සක් දෙවිඳුගේ වචනය නුවණින් සලකා, ඒ ගෝපක දෙව් පුත් තෙමේ සක් දෙවිඳුට මෙසේ කී ය."
            },
            {
                "format": 13,
                "text": "“ජනෙන්ද්‍රයෙනි, මිනිස් ලොවැ බුද්ධ නම් කෙනෙක් ඇත. කාමයන් මැඩැලූ ඔබ ශාක්‍යමුනි නම් වෙති. ඔබගේ පුත්‍ර වූ මොහු සිහියෙන් තොර වූවාහු, මා විසින් චෝදනා කරන ලදුවෝ සිහිය ලදූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඒ තුන් මහණුන් ගෙන් ගඳැවූ රැහැට පැමිණැ සිටි එකෙක් මෙහි මැ රැඳුණේ ය. සම්බෝධිමාර්ගය (අනගැමි මඟ) ඔස්සේ යන දෙදෙනෙක් ම සමාධිගත සිතැත්තාහු දෙවියන් යට පත් කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙ සස්නෙහි මෙ බඳු දහම් පවසනු ඇත. එහි ලා කිසිදු සව්වෙක් ‘මේ කෙසේ වන්නෙක් දැ’ යි සැක නො කරයි. තිණූ සතර මහවතුරු ඇති, සුන් සැක ඇති, ජනයනට ඉන්ද්‍ර වූ සියලු කෙලෙස් දිනූ බැවින් එක ම ජිනයාණන් වූ ඒ බුදුරජුන් නමදිමු.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“ඔවුන් තිදෙනා අතුරෙන් විශේෂගාමී වූ දෙදෙනෙක් මෙහි දී ම ඔබේ දහම දැන ගෙන බ්‍රහ්මපුරෝහිත කය (ප්‍රථමධ්‍යනය) ලැබ එය පාදක කොට විවසුන් වඩා අනඟැමි මඟ ලැබුවාහු ද, ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "නිදුකාණනි, ඒ දහම ලබනු පිණිස අපි මෙහි ආම්හ. නිදුකාණනි, භාග්‍යවතුන් වහන්සේ විසින් කරන ලද අවකාශ ඇත්තමෝ ප්‍රශ්න විචාරමෝ වා.”"
            },
            {
                "type": "page-break",
                "text": "413"
            },
            {
                "format": 13,
                "text": "11. “එකල්හි මේ සක් දෙව් වනාහි බොහෝ කලක් ම පිරිසිදු වැ ආයෙක. හේ යම් පැනයක් මා විචාරන්නේ ද, අර්ථනිඃශ්‍රීත වූ ම (කරුණු සහිත වූ ම) ඒ සියල්ල විචාරන්නේ ය, අර්ථනිඃශ්‍රීත නො වූවක් නො ම විචාරන්නේ ය. මොහු විසින් යමක් විචාරන ලදුයෙම්, මම් විසඳන්නෙම් නම්, හේ වහා ම එය දැනගන්නේ යැ” යි භගවත් බුදුරජුනට මේ සිත විය, ඉක්බිති භාග්‍යවතුන් වහන්සේ සක් දෙවිඳු බණවා (ගාථායෙන්) ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වාසවයෙනි, සිතින් යමක් කැමැත්තහු ද, ඒ පැනය මා විචාරවු. ඔබගේ ඒ ඒ හැම පැනයක් ම (විසඳා) කෙළවර කරන්නෙමි” යි වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 22,
                "text": "පළමු බණ වර නිමියේ ය.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "415"
            },
            {
                "format": 13,
                "text": "12. සක් දෙවිඳු පැන පුළුවුස්නා පිණිස ලත් අවකාශ ඇත්තේ,{1 කතාවකාසො - කරන ලද අවකාශ ඇත්තේ යනු පදගතාර්ථ යැ.} භගවත් බුදුරජුන්ගෙන් මේ පළමු පැනය විචාළේ ය: “නිදුකාණන් වහන්ස, දෙවියෝ ද මිනිස්සු ද අසුරයෝ ද නාගයෝ ද ගන්ධර්වයෝ ද මෙයින් අන්‍ය යම් බොහෝ දෙනෙක් ඇත් නම් ඔහු ද යන මේ හැම දෙනාට ‘වෙර බැඳුම් නැත්තෝ වැ ආයුධ දණ්ඩ මනෝදණ්ඩ නැත්තෝ වැ පසමිතුරන් නැත්තෝ වැ දොම්නස් නැත්තෝ වැ අවෛරී (කෝප මාත්‍ර දු නො උපදවන්නෝ) වැ වසන්නමු’ යි ප්‍රාර්ථනාවෙක් වෙයි. එතෙකුදු වුවත් ඔහු වෛර ඇත්තාහු, දණ්ඩ ඇත්තාහු, පසමිතුරන් ඇත්තාහු, දොම්නස් ඇත්තාහු, වෛරී වූවාහු වෙසෙත්. කවර සංයෝජනයක් ඇත්තාහු (කවර බැම්මෙකින් බැඳුණාහු) ඔහු එසේ වෙසෙත් ද? යනු යි. මෙසේ සක් දෙවිඳු භගවත් බුදුරජුන්ගෙන් මේ පළමු පැනය විචාළේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඔහු විසින් පැන විචාරන ලද භගවත්හු එය මෙසේ විසඳා වදාළා හ:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“දෙවිඳ, දෙවියෝ ද මිනිස්සු ද අසුරයෝ ද නාගයෝ ද ගන්ධර්වයෝ ද අන් යම් බොහෝ දෙනෙක් ඇත් නම් ඔහු ද යන මේ හැම දෙනාට වෙර බැඳුම් නැත්තෝ වැ ආයුධ දණ්ඩ මනෝ දණ්ඩ නැත්තෝ වැ පසමිතුරන් නැත්තෝ වැ දොම්නස් නැත්තෝ වැ අවෛරී වැ වසන්නමු’ යි ප්‍රාර්ථනාවෙක් වෙයි. එතෙකුදු වුවත් ඔහු වෙර බැඳුම් ඇත්තෝ වැ දණ්ඩ ඇත්තෝ වැ පසමිතුරන් ඇත්තෝ වැ දොම්නස් ඇත්තෝ වැ වෛරී වැ වෙසෙත්. ඔහු ඊර්‍ෂ්‍යාවත් මාත්සර්‍ය්‍යයත් සංයෝජන කොටඇත්තාහු (ඊර්‍ෂ්‍යාමාත්සර්‍ය්‍ය දෙකින් බැඳුණාහු), එසේ වෙසෙත්.” ප්‍රශ්න විචාරනු ලැබූ භාග්‍යවතුන් වහන්සේ සක්දෙවිඳුගේ පැනය මෙ පරිද්දෙන් විසැඳූහ. (එයින්) සතුටු වූ සක් දෙවිඳු “භාග්‍යවතුන් වහන්ස, මෙය එසේ යැ, සුගතයන් වහන්ස, මෙය එසේ යැ. භාග්‍යවතුන් වහන්සේගේ විසැඳුම ඇසීමෙන් මෙහි මගේ සැකය ඉක්මිණි{2 තිණ්ණා කංඛා - සැකය තරණය කරන ලදී යනු පදගතාර්ථ යැ.} විමතිය පහ විණැ” යි සක් දෙවිඳු භගවත් බුදුරජුන්ගේ වචනය පිළිගත්තේ ය, අනුමොවන් විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "13. සක් දෙවිඳු මෙසේ භගවත් බුදුරජුන්ගේ වචනය පිළිගෙන අනුමෙවැ,",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“නිදුකාණන් වහන්ස, ඊර්‍ෂ්‍යා මාත්සර්‍ය්‍ය දෙක කුමක් නිදන් කොටැත්තේ ද, කුමක් සමුදය (කාරණ) කොටැත්තේ ද, කුමක් උත්පත්ති ස්ථාන කොටැත්තේ ද, කුමක් ප්‍රභව (උපදනා තැන) කොටැත්තේ ද, කුමක් ඇති කල්හි ඊර්‍ෂ්‍යා මාත්සර්‍ය්‍ය දෙක වෙයි ද, කුමක් නැති කල්හි ඊර්‍ෂ්‍යා මාත්සර්‍ය්‍ය දෙක නො වෙයි ද?” යි මත්තෙහි ද පැනයක් පුළුවුත.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "417"
            },
            {
                "format": 13,
                "text": "“දෙවිඳ, ඊර්‍ෂ්‍යා මාත්සර්‍ය්‍ය දෙක ප්‍රිය අප්‍රිය සත්ත්වයන් නිදාන කොටැත්තේ ය, ප්‍රියාප්‍රිය සත්වයන් සමුදය (කාරණ) කොට ඇත්තේ ය, ප්‍රියාප්‍රිය සත්වයන් ජාති (උත්පත්තිස්ථාන) කොටඇත්තේ ය, ප්‍රියාප්‍රිය සත්වයන් ප්‍රභව (උපදනා තැන්) කොට ඇත්තේ ය. ප්‍රියාප්‍රිය සත්වයන් ඇති කල්හි ඊර්‍ෂ්‍යා මාත්සර්‍ය්‍ය දෙක වෙයි. ප්‍රියයක්හු හෝ අප්‍රියයක්හු නැති කල්හි ඊර්‍ෂ්‍යා මාත්සර්‍ය්‍ය දෙක නො වේ” යැයි භාග්‍යවතුන් වහන්සේ විසැඳූ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "14. නිදුකාණන් වහන්ස, ප්‍රියාප්‍රිය සත්ව සංස්කාරය කුමක් නිදාන කොටැත්තේ ද, කුමක් සමුදය කොට ඇත්තේ ද, කුමක් උත්පත්ති ස්ථාන කොට ඇත්තේ ද, කුමක් ප්‍රභව කොටැත්තේ ද, කුමක් ඇති කල්හි ප්‍රියාප්‍රිය සත්ව සංස්කාරය වේ ද, කුමක් නැති කල්හි ප්‍රියාප්‍රිය සත්ව සංස්කාරය නො වේ දැ?” යි සක් දෙවිඳු පුළුවුත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "දෙවිඳ, ප්‍රියාප්‍රිය සත්වසංස්කාරය වනාහි ඡන්දය නිදාන කොටැත්තේ ය, ඡන්දය සමුදය කොටැත්තේ ය, ඡන්දය උත්පත්තිස්ථාන කොටැත්තේ ය, ඡන්දය ප්‍රභව කොටැත්තේ ය, ඡන්දය ඇති කල්හි ප්‍රියාප්‍රිය සත්ව සංස්කාරය වේ, ඡන්දය නැති කල්හි ප්‍රියාප්‍රිය සත්වසංස්කාරය නො වේ” යැ යි භාග්‍යවතුන් වහන්සේ විසැඳූ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "15. “නිදුකාණන් වහන්ස, ඡන්දය වනාහි කුමක් නිදාන කොට ඇත්තේ ද, කුමක් සමුදය කොට ඇත්තේ ද, කුමක් උත්පත්ති ස්ථාන කොට ඇත්තේ ද, කුමක් ප්‍රභව කොට ඇත්තේ ද, කුමක් ඇති කල්හි ඡන්දය වේ ද, කුමක් නැති කල්හි ඡන්දය නො වේ ද?” යි සක් දෙවිඳු පුළුවුත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“දෙවිඳ, ඡන්දය වනාහි විනිශ්චය විතර්කය නිදාන කොට ඇත්තේ ය, විනිශ්චය විතර්කය සමුදය කොට ඇත්තේ ය, විනිශ්චය විතර්කය උත්පත්තිස්ථාන කොට ඇත්තේ ය, විනිග්වය විතර්කය ප්‍රභව කොට ඇත්තේ ය, විනිශ්චය විතර්කය ඇති කල්හි ඡන්දය වේ, විනිශ්චය විතර්කය නැති කල්හි ඡන්දය නො වේ” යැ යි භාග්‍යවතුන් වහන්සේ විසැඳූ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "16. “නිදුකාණන් වහන්ස, විනිශ්චය විතර්කය කුමක් නිදන් කොට ඇත්තේ ද, කුමක් සමුදය කොට ඇත්තේ ද, කුමක් උත්පත්තිස්ථාන කොට ඇත්තේ ද, කුමක් ප්‍රභව කොට ඇත්තේ ද, කුමක් ඇති කල්හි විනිශ්චය විතර්කය වේ ද, කුමක් නැති කල්හි විනිශ්චය විතර්කය නො වේ දැ?” යි සක් දෙවිඳු පුළුවුත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“දෙවිඳ, විනිශ්චය විතර්කය වූ කලි තෘෂ්ණා ප්‍රපඤ්ච සම්ප්‍රයුක්ත සංඥාකොටස් නිදන් කොටැත්තේ ය, එය ම සමුදය කොට ඇත්තේ ය. එය ම උත්පත්තිස්ථාන කොට ඇත්තේ ය, එය ප්‍රභව කොට ඇත්තේ ය, එය ඇති කල්හි විනිශ්චය විතර්කය වේ, එය නැති කල්හි විනිශ්චය විතර්කය නො වේ” යැ යි භාග්‍යවතුන් වහන්සේ විසැඳූ සේක.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "419"
            },
            {
                "format": 13,
                "text": "17. “නිදුකාණන් වහන්ස, මහණ තෙම කෙසේ පිළිපන්නේ ප්‍රපංචසංඥා කොටසුන්ගේ සංසිඳීමට උපාය බැවින් නිසි වූ ද එය අරමුණු කිරීම් වශයෙන් එයට පැමිණෙන්නා වූ ද විවසුන් මඟ පිළිපන්නේ වේදැ?” යි සක් දෙවිඳු පුළුවුත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“දෙවිඳ, මම් සෙවියැ යුතු නො සෙවියැ යුතු විසින් සොම්නස් වේදනාව ද දෙ පරිදි කොට කියමි. දෙවිඳ, සෙවියැ යුතු සොම්නස ද නො සෙවියැ යුතු සොම්නස දැ යි මම් සොම්නස ද දෙ පරිද්දෙකින් කියමි, දොම්නස ද සෙවියැ යුතු දොම්නස ද නො සෙවියැ යුතු දොම්නස දැ යි දෙ පරිදිකොට කියමි. උපේක්ෂාව ද සෙවියැ යුතු උපේක්ෂාව ද නො සෙවියැ යුතු උපේක්ෂාව දැයි දෙ පරිදි කොට කියමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සෙවියැ යුතු සොම්නස ද නොසෙවියැ යුතු සොම්නස දැ යි මම් සොම්නස දෙ පරිද්දෙකින් කියමි යි මෙසේ මෙය කියන ලදි. මෙය කුමක් සඳහා කියන ලද ද යත්: එහි මේ සොම්නස සෙවුනා මගේ සතන්හි අකුසල් දහම්හු වැඩෙත්, කුසල් දහම්හු පිරිහෙත් යැ යි යම් සොම්නසක් දැන ගන්නේ ද, මෙ බඳු වූ සොම්නස නො සෙවියැ යුතු. මේ සොම්නස සෙවුනා මගේ සතන් හි අකුසල් දහම්හු පිරිහෙත් කුසල් දහම්හු වැඩෙති’ යි යම් සොම්නසක් දැන ගන්නේ ද, මෙ බඳු සොම්නස සෙවියැ යුතු. එහි ද යම් සොම්නසෙක් ඉදින් විතර්ක සහිත විචාරසහිත ද (නෛෂ්කාම්‍ය වශයෙන් විදර්ශනා වශයෙන් අනුස්මෘතිභාවනා වශයෙන් ප්‍රථම ධ්‍යාන වශයෙන් විතර්ක විචාර සහිත ද), යම් සොම්නසෙක් විතර්ක (රහිත ද විචාර රහිත ද ද්විතීය ධ්‍යාන වශයෙන් අවිතර්ක වැ අවිචාර වැ උපන්නේ ද) ඔවුන් අතුරෙන් යමක් විතර්ක රහිත ද විචාර රහිත ද, එය වඩා උතුම් ය. ‘දෙවිඳ, සොම්නස ද සෙවියැ යුතු එක දැ, නො සෙවියැ යුතු එක දැ යි දෙ පරිද්දෙකින් කියමි’ යි යමක් කියන ලද ද, මෙය ඒ ද්විවිධ සොම්නස සඳහා කියන ලදි. දෙවිඳ, දොම්නස ද සෙවියැ යුතු එක දැ නො සෙවියැ යුතු එක දැ යි දෙ පරිද්දෙකින් මම් කියමි. මෙසේ වනාහි මෙය කියන ලදි. මෙය කුමක් සඳහා කියන ලද ද යත්: එහි ‘මේ දොම්නස සෙවුනා මගේ සතන්හි අකුසල් දහම්හු වැඩෙත්, කුසල් දහම්හු පිරිහෙත් යැ’ යි යමක් දන්නේ ද, මෙ බඳු දොම්නස නො සෙවියැ යුතු යැ. එහි ‘මේ දොම්නස සෙවුනා මගේ සතන්හි අකුසල් දහම්හු පිරිහෙත්, කුසල් දහම් හු වැඩෙත් යැ’ යි දන්නේ ද, මෙ බඳු දොම්නස සෙවියැ යුතු. එහි විතර්ක සහිත විචාර සහිත යම් දොම්නසෙක් වේ ද, විතර්ක රහිත විචාර රහිත යම් දොම්නසෙක් වේ ද, ඔවුන් අතුරෙන් යමක් විතර්ක රහිත විචාර රහිත දැ (නෛෂ්කාම්‍ය වශයෙන් විදර්ශනා වශයෙන් අනුස්මෘති වයෙන් ප්‍රථමධ්‍යානාදි වශයෙන් උපදනා) මේ දොම්නස වඩා උතුම් යැ. දෙවිඳ, දොම්නස ද සෙවියැ යුතු එක ද නොසෙවියැ යුතු එක දැ යි දොම්නස ද මම් දෙවැදැරුම් කොට කියමි යි මෙසේ යමක් කියන ලද ද, මෙය එකී දොම්නස සඳහා කියන ලදි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "421"
            },
            {
                "format": 13,
                "text": "දෙවිඳ, සෙවියැ යුතු එක ද නොසෙවියැ යුතු එක දැ යි මම් උපේක්ෂාව ද දෙ වැදෑරුම් කොට කියමි. මෙසේ ම මෙය කියන ලදි. මෙය කුමක් සඳහා කියන ලද ද යත්: එහි මේ උපේක්ෂාව වනාහි සෙවුනා මගේ සතන්හි අකුසල් දහම්හු වැඩෙත්, කුසල් දහම්හු පිරිහෙත් යැ යි යම් උපේක්ෂාවක් දන්නේ ද, මෙ බඳු වූ උපේක්ෂාව නොසෙවියැ යුතු ය. එහි මෙ උපේක්ෂාව සෙවුනා මගේ සතන්හි අකුසල් දහම්හු පිරිහෙත් කුසල් දහම්හු වැඩෙත් යැ යි යම් උපේක්ෂාවක් දන්නේ ද මෙ බඳු වූ උපේක්ෂාව සෙවියැ යුතු ය. එහි යමක් සවිතර්ක සවිචාර ද, යමක් අවිතර්ක අවිචාර ද, මොවුන් අතුරෙන් යමක් අවිතර්ක අවිචාර ද එය වඩා උතුමි. දෙවිඳ, ‘සෙවියැ යුතු එක ද නො සෙවියැ යුතු එක දැ යි උපේක්ෂාව දෙ වැදෑරුම් කොට කියමි’ යි මෙසේ යමෙක් මා විසින් කියන ලද ද, මෙය ඒ (අවිතර්ක අවිචාර) උපේක්ෂාව සඳහා කියන ලදි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "දෙවිඳ, මෙසේ පිළිපන් මහණ තෙම ප්‍රපංච සම්ප්‍රයුක්ත සංඥා කොටසුන්ගේ සංසිඳීමට උපාය බැවින් එයට නිසි වූ ද එය අරමුණු කිරීම් වශයෙන් එයට පැමිණෙන්නා වූ ද විවසුන් මඟට පිළිපන්නේ වේ යැ යි මෙසේ සක් දෙවිඳු විසින් විචාරන ලද පැනය විසඳා වදාළ සේක. සතුටු වූ සක් දෙවිඳු ‘භාග්‍යවතුන් වහන්ස, එය එසේ යැ, සුගතයන් වහන්ස, එය එසේ යැ. භාග්‍යවතුන් වහන්සේගේ පැන විසඳීම ඇසීමෙන් මෙහි මා තුළැ වූ සැකය ඉක්මිණ, විමතිය පහ වියැ’ යි කියා භගවත් බුදුරජුන්ගේ වචනය පිළිගත්තේ ය, අනුමෙවී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "18. මෙසේ සක් දෙවිඳු භගවත් බුදුරජුන්ගේ වචනය පිළිගෙන, “නිදුකාණන් වහන්ස, කෙසේ පිළිපන් මහණ තෙම පාතිමොක්ඛ සීල සංවරය පිණිස පිළිපන්නෙක් වේ දැ” යි මත්තෙහි දු පැනයක් පුළුවුත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“දෙවිඳ, සෙවියැ යුත්ත ද නො සෙවියැ යුත්ත දැ යි කායසමාචාරය ද මම් දෙවැදෑරුම් කොට කියමි. සෙවියැ යුත්ත ද නොසෙවියැ යුත්ත දැ යි වාක්සමාචාරය ද මම් දෙවැදෑරුම් කොට කියමි. දෙවිඳ, සෙවියැ යුත්ත ද නොසෙවියැ යුත්ත දැ යි පය්‍යෙර්‍ෂණය ද මම් දෙවැදෑරුම් කොට කියමි. දෙවිඳ, සෙවියැ යුත්ත ද නො සෙවියැ යුත්ත දැ යි කායසමාචාරය ද මම් දෙවැදෑරුම් කොට කියමි යි මෙසේ ම මෙය කියන ලදි. කුමක් සඳහා මෙය කියන ලද ද යත්: එහි මේ කායසමාචාරය සෙවුනා මා සතන්හි අකුසල් දහම්හු වැඩෙත්, කුසල් දහම්හු පිරිහෙත් යැ’ යි යම් කාය සමාචාරයක් දන්නේ ද, මෙ බඳු වූ කායසමාචාරය සෙවිය යුතු යැ. එහි මේ කාය සමාචාරය සෙවුනා මා සතනෙහි අකුසල් දහම්හු පිරිහෙත්, කුසල් දහම්හු වැඩෙත් යැයි යම් කාය සමාචාරයක් දන්නේ ද මෙබඳු වූ කායසමාචාරය සෙවිය යුතු ය. ‘දෙවිඳ, සෙවියැ යුත්ත ද නොසෙවියැ යුත්ත දැ යි කායසමාචාරය ද දෙවැදෑරුම් කොට මම් කියමි යි මෙසේ යමක් කියන ලද ද මෙය එකී කාය සමාචාරය සඳහා කියන ලදි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "423"
            },
            {
                "format": 13,
                "text": "දෙවිඳ, සෙවියැ යුත්ත ද නොසෙවීයැ යුත්ත දැ යි වාක්සමාචාරය ද දෙ වැදෑරුම් කොට මම් කියමි. මෙසේ ම මෙය කියන ලදි. මෙය කුමක් සඳහා කියන ලද ද? යත්: එහි, ‘මේ වාක්සමාචාරය සෙවුනා මගේ (සතන්හි) අකුසල් දහම්හු වැඩෙත්, කුසල් දහම්හු පිරිහෙත් යැ’ යි යම් වාක්සමාචාර යක් දන්නේ ද, එ බඳු වූ වාක්සමාචාරය නො සෙවියැ යුතු. එහි ‘මේ වාක්සමාචාරය සෙවුනා මගේ (සතන්හි) අකුසල් දහම්හු පිරිහෙත්, කුසල් දහම්හු වැඩෙත් යැ’ යි යම් වාක්සමාචාරයක් දන්නේ ද, මෙබඳු වූ වාක් සමාචාරය සෙවියැ යුතු. ‘දෙවිඳ, සෙවියැ යුත්ත ද නොසෙවියැ යුත්ත දැ යි වාක්සමාචාරයද මම් දෙවැදෑරුම් කොට කියමි’ යි මෙසේ යමක් කියන ලද ද, මෙය එකී වාක්සමාචාරය සඳහා කියන ලදි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "දෙවිඳ, සෙවියැ යුත්ත ද නොසෙවියැ යුත්ත දැ යි පය්‍යෙර්‍ෂණය ද දෙවැදෑරුම් කොට මම් කියමි. මෙසේ ම මෙය කියන ලදි. මෙය කුමක් සඳහා කියන ලද ද? යත්: එහි ‘මේ පය්‍යෙර්‍ෂණය සෙවුනා මගේ සන්තානයෙහි අකුසල් දහම්හු වැඩෙත්, කුසල් දහම්හු පිරිහෙති’ යි යම් පය්‍යෙර්‍ෂණයක් දැන ගන්නේ ද, මෙබඳු වූ පයෙර්‍යෂණය නො සෙවියැ යුතු. එහි ‘මේ පය්‍යෙර්‍ෂණය සෙවුනා මගේ සන්තානයෙහි අකුසල් දහම්හු පිරිහෙත්, කුසල් දහම්හු වැඩෙති’ යි යම් පය්‍යෙර්‍ෂණයක් දැන ගන්නේ ද, ඒ පය්‍යෙර්‍ෂණය ද සෙවියැ යුතු. දෙවිඳ, පයෙර්‍යෂණයත් සෙවියැ යුත්ත ද නො සෙවියැ යුත්ත දැ යි දෙවැදෑරුම් කොට මම් කියමි යි මෙසේ යමක් කියන ලද ද, මෙය එකී පය්‍යෙර්‍ෂණය ද සඳහා කියන ලදි. දෙවිඳ, මෙසේ පිළිපන් මහණ වනාහි පාතිමොක්ඛ සංවරය පිණිස පිළිපන්නේ වේ යැ යි. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ භාග්‍යවතුන් වහන්සේ සක්දෙවිඳු විසින් පැන පුළුවුස්නා ලද්දාහු එය විසැඳූ සේක. සතුටට පත් සක් දෙවිඳු ‘භාග්‍යවතුන් වහන්සැ, එය එසේ යැ, සුගතයන් වහන්ස, එය එසේ යැ. භාග්‍යවතුන් වහන්සේගේ පැන විසැඳුම ඇසීමෙන් මෙහි මගේ සැකය ඉක්මිණ, විමතිය පහ වීයැ’ යි භගවත් බුදුරජුන්ගේ වචනය පිළිගත්තේ ය, අනුමෙවී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "19. මෙසේ සක් දෙවිඳු භගවත් බුදුරජුන්ගේ වචනය පිළිගෙන අනුමෙවැ ඔබගෙන් “නිදුකාණන් වහන්ස, කෙසේ පිළිපන් මහණ තෙම ඉන්ද්‍රිය සංවරය පිණිස පිළිපන්නේ වේ දැ?” යි මත්තෙහි පැනයක් පුළුවුත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“දෙවිඳ, ඇසින් දැක දත යුතු රූපය ද සෙවියැ යුත්ත ද නො සෙවියැ යුත්ත දැ යි දෙවැදෑරුම් කොට මම් කියමි ... දෙවිඳ, කනින් අසා දත යුතු ශබ්දය ද ... දෙවිඳ, නැහැයෙන් අසා දත යුතු ගඳ ද ... දිවෙන් ආස්වාද කොට දත යුතු රසය ද ... කයින් පැහැසැ දත යුතු හැපෙන දෑ ද … මනසින් දත යුතු දහම් අරමුණු ද සෙවියැ යුත්ත ද නොසෙවියැ යුත්ත දැ යි දෙවැදෑරුම් කොට මම් කියමි” යි භාග්‍යවතුන් වහන්සේ විසඳා වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "425"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි “වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් සැකෙවින් වදාරන ලද මේ වචනයේ අරුත් මෙසේ විස්තර වශයෙන් මම් දැනගනිමි. වහන්ස, ඇසින් දැක දත යුතු යම් බඳු රූපයක් සෙවුනහුගේ සන්තානයෙහි අකුසල් දහම්හු වැඩෙත් ද කුසල් දහම්හු පිරිහෙත් ද, මෙබඳු වූ චක්ෂුර් විඥෙය රූපය නො සෙවියැ යුතු. වහන්ස, ඇසින් දැක දත යුතු යම් බඳු රූපයක් සෙවුනහුගේ සන්තානයෙහි අකුසල් දහම්හු පිරිහෙත් ද කුසල් දහම්හු වැඩෙත් ද, එබඳු වූ චක්ෂුර් වි‍ඥෙය රූපය සෙවියැ යුතු. වහන්ස, යම් බඳු ශ්‍රොත්‍ර විඥෙය ශබ්දයක් සෙවුනහුගේ ... ඝ්‍රාණ වි‍ඥෙය ගන්ධයක් සෙවුනහුගේ ... ජිහ්වා වි‍ඥෙය රසයක් සෙවුනහුගේ ... කාය වි‍ඥෙය ස්ප්‍රෂ්ටව්‍යයක් සෙවුනහුගේ ... මනෝ වි‍ඥෙය ධර්මයක් සෙවුනහුගේ සන්තානයෙහි අකුසල් දහම්හු වැඩෙත් ද කුසල් දහම්හු පිරිහෙත් ද, මෙ බඳු මනෝ වි‍ඥෙය ධර්මය නො සෙවියැ යුතු. වැලිදු යම් බඳු මනෝ වි‍ඥෙය ධර්මයක් සෙවුනහුගේ සන්තානයෙහි අකුසල් දහම්හු පිරිහෙත් ද කුසල් දහම්හු වැඩෙත් ද එබඳු වූ මනෝ වි‍ඥෙය ධර්මය සෙවියැ යුතු. වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද මේ වචනයේ අර්ථය මෙසේ විස්තරයෙන් දැන ගන්නා මට භාග්‍යවතුන් වහන්සේගේ පැන විසඳුම ඇසීමෙන් මෙහි සැකය ඉක්මියේ ය, විමතිය පහ වී යැ” යි සක්දෙවිඳු කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "20. මෙසේ සක් දෙවිඳු භගවත් බුදුරජුන්ගේ වචනය පිළිගෙන අනුමෙවැ, මත්තෙහි දු පැනයක් පුළුවුස්නේ, “නිදුකාණන් වහන්ස, සියලු ම මහණබමුණෝ එක් (සමාන) අන්තයක් ඇති (අභින්න) වාද ඇත්තෝ ද? එක් ම (සමාන) ආචාර ඇත්තෝ ද? එක් (සමාන) ලබ්ධි ඇත්තෝ ද? එක් (සමාන) නිෂ්ඨානයක් ඇත්තෝ දැ?” යි පුළුවුත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“දෙවිඳ, සියලු මහණ බමුණෝ සමාන වාද ඇත්තෝ නො වෙත්, සමාන ආචාර ඇත්තෝ නො වෙත්, සමාන ලබ්ධි ඇත්තෝ නො වෙත්, සමාන නිෂ්ඨානයක් ඇත්තෝ නො වෙත්” යැ යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“නිදුකාණන් වහන්ස, කවර හෙයින් සියලු මහණ බමුණෝ සමාන වාද ඇත්තෝ සමානාචාර ඇත්තෝ සමාන ලබ්ධි ඇත්තෝ සමාන නිෂ්ඨානයක් ඇත්තෝ නො වෙත් දැ?” යි සක්දෙවිඳු පුළුවුත.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "427"
            },
            {
                "format": 13,
                "text": "“දෙවිඳ, ලෝවැස්සෝ නොයෙක් අදහස් ඇත්තෝ, නානා අදහස් ඇත්තෝ වෙත්. ඒ නොයෙක් අදහස් ඇති, නානා අදහස් ඇති ලෝවැස්සන් අතුරෙහි සත්වයෝ යම් යම් ම අදහසකට වැද ගනිත් ද (අදහසක් ගනිත් ද), ඒ ඒ අදහස ම දැඩි කොට ගෙන මුළු ශක්තියෙන් ම පරාමර්ශනය කොට ‘මෙය ම සත්‍ය යැ සෙස්ස හිස් යැ’ යි කියත්. එහෙයින් සියලු මහණබමුණෝ එක් ම වාදයක් ඇත්තෝ නො වෙත්, එක් ම ‘ආචාරයක්’ ඇත්තෝ නො වෙත්, එක් ම ලබ්ධියක් ඇත්තෝ නො වෙත්, එක් ම නිෂ්ඨාවක් ඇත්තෝ නො වෙත්” යැ යි විසඳා වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“නිදුකාණන් වහන්ස, සියලු ම මහණබමුණෝ අත්‍යන්ත නිෂ්ඨාව ඇත්තෝ ද? අත්‍යන්ත යෝගක්ෂේමය (නිර්වාණය) ඇත්තෝ ද? අත්‍යන්තය පිණිස (නිවන සඳහා) බඹසර සරන්නෝ ද (ආර්‍ය්‍යමාර්ගාධිගමය කරන්නෝ ද)? අත්‍යන්ත පර්‍ය්‍යවසානය ඇත්තෝ ද (නිර්වාණගාමීහු ද)?” යි සක් දෙවිඳු පුළුවුත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“දෙවිඳ, සියලු මහණබමුණෝ අත්‍යන්තනිෂ්ඨාව ඇත්තෝ නො ම වෙත්, අත්යන්ත යෝගක්ෂේමය ඇත්තෝ, අත්‍යන්ත බ්‍රහ්මචාරීහු, අත්‍යන්ත පර්‍ය්‍යවසානය ඇත්තෝ නො ම වෙති” යි විසඳූ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“නිදුකාණන් වහන්ස, කවර හෙයින් සියලු මහණ බමුණෝ අත්‍යන්ත නිෂ්ඨාව ඇත්තෝ නො ම වෙත් ද? අත්‍යන්ත යෝගක්ෂෙමය ඇත්තෝ, අත්‍යන්ත බ්‍රහමචාරීහු, අත්‍යන්ත පර්‍ය්‍යවසානය ඇත්තෝ නො ම වෙත් දැ?”යි සක් දෙවිඳු පුළුවුත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“දෙවිඳ, යම් මහණ බමුණු කෙනෙක් තෘෂ්ණා සංක්ෂයයෙන් (මාර්ගයෙන් හෝ නිවන අරමුණු කොට) කෙලෙසුන් කෙරෙන් මිදුණාහු ද, ඔහු අත්‍යන්ත නිෂ්ඨාව ඇත්තාහු, අත්‍යන්ත යෝගක්ෂේමය ඇත්තාහු, අත්‍යන්ත බ්‍රහමචාරීහු, අත්‍යන්ත පර්‍ය්‍යවසානය ඇත්තාහු වෙත්. එහෙයින් සියලු මහණ බමුණෝ අත්‍යන්ත නිෂ්ඨාව ඇත්තෝ නො වෙත්, අත්‍යන්ත යෝගක්ෂේමය ඇත්තෝ, අත්‍යන්ත බ්‍රහ්මචාරීහු, අත්‍යන්ත පර්‍ය්‍යවසානය ඇත්තෝ නො වෙත්” යි භාග්‍යවතුන් වහන්සේ විසැඳූ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ භාග්‍යවතුන් වහන්සේ සක් දෙවිඳු විසින් පැන පුළුවුස්නා ලද සේක් ඒ විසැඳූ සේක. සතුටු වූ සක් දෙවිඳු “භාග්‍යවතුන් වහන්ස, එය එසේ යැ, සුගතයන් වහන්ස, එය එසේ ය, භාග්‍යවතුන් වහන්සේගේ ප්‍රශ්නව්‍යාකරණය (පැන විසඳීම) ඇසීමෙන් මෙහි මගේ සැකය ඉක්මිණ, විමතිය පහ වී යැ” යි භගවත් බුදුරජුන්ගේ භාෂිතය පිළිගත්තේ ය, අනුමෙවී ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "429"
            },
            {
                "format": 13,
                "text": "21. මෙසේ සක් දෙවිඳු භගවත් බුදුරජුන්ගේ වචනය පිළිගෙන, අනුමෙවැ “වහන්ස, තෘෂ්ණාව රෝගයෙක, තෘෂ්ණාව ගඩක, තෘෂ්ණාව හුලෙක, තෘෂ්ණාව මේ පුරුෂයා (කර්මානුරූප ව) ඒ ඒ භවයෙක ම ඉපැද්ම පිණිස හාත්පසින් අදී. එ හෙයින් මේ පුරුෂ තෙම උස් බවට පහත් බවට පැමිණේ. වහන්ස, යම් ප්‍රශ්නයනට මෙයින් බැහැර අන් මහණ බමුණන් කෙරෙහි අවකාශ කිරීම් පමණ දු නො ලදුයෙම් ද, දිර්ඝ කාලයක් මා සිත් සතන්හි ලැග හොත් ඒ ප්‍රශ්නයෝ මට භාග්‍යවතුන් වහන්සේ විසින් විසඳා වදාරන ලදහ. මා තුළ යම් සැක විමති නැමැති හුලෙක් වී ද, එය ද භාග්‍යවතුන් වහන්සේ විසින් උදුරා දමන ලදුයේ යැ” යි මෙ බස් පැවැසී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "22. “දෙවිඳ, මේ ප්‍රශ්න අන් මහණ බමුණන් වෙතින් විවාළා දන්නෙහි දැ?” යි භගවත්හු වදාළාහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වහන්ස, අන් මහණ බමුණන් වෙතින් මේ ප්‍රශ්න විචාළා දනිමි”යි සක් දෙවිඳු කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“දෙවිඳ, කෙසේ නම් ඔහු මේ ප්‍රශ්න විසැඳූහු ද, ඉදින් ඔබට බරෙක් නො වේ නම්, කිව මැනැවැ” යි භගවත්හු වදාළාහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වහන්ස, යම් තැනෙක භාග්‍යවතුන් වහන්සේ හෝ භාග්‍යවතුන් වහන්සේ වැන්නෙක් වැඩහුන් සේක් වී නම්, එය කියනු මට බරෙක් නො වේ” යැ යි සක් දෙවිඳු කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“එසේ වී නම්, දෙවිඳ, කියන්නැ” යි භගවත්හු වදාළාහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වහන්ස, වනවාසීහු යැ යි, ගම්කොළවරැ සෙනසුන්හි වසනනෝ යැ යි, යම් මහණ බමුණු කෙනකු මම් සිතීම් ද, මම් ඔවුන් කරා ගොස් මේ ප්‍රශ්න විචාළෙමි. ඔහු මා විසින් විචාරන ලද්දාහු, “ආයුෂ්මත් තෙමේ කිනම් වේ දැ?” යි මා ම පුළුවුසිත්. මම් ඔවුන් විසින් පුළුවුස්නා ලදිම් ‘නිදුකාණනි, මම් සක් දෙවිඳුමි’ යි කියමි. ඔහු “ආයුෂ්මත් දේවේන්ද්‍ර තෙමේ කවර නම් කර්මයක් කොට මේ තැනට පත් වී දැ?” යි මත්තෙහි මා ම පුළුවුසිත්. මම් ඔවුනට මා අසා ඇති පරිදි මා ඉගෙන ඇති පරිදි (සප්ත ව්‍රත පද) ධර්මය දෙසමි. ඔහු එ පමණින් ම, ‘අප විසින් සක් දෙවිඳු දක්නා ලද්දේ ද වේ, අපි යමක් විචාළමෝ ද එය ද අපට විසඳා කීයේ යැ’ යි එ පමණින් ම සතුටු වෙත්, ඔහු ඒකාන්තයෙන් මගේ ම ශ්‍රාවකයෝ වෙත්, මම ඔවුන්ගේ ශ්‍රාවක නො වෙමි. වහන්ස, මම් වූ කලී සිවු අවාහි නොවැටෙන සැහැවි ඇති, මාර්ග ධර්ම නියාමයෙන් නියත වූ (අවශ්‍යයෙන් ම උපරිමාර්ගාධිමය කරන සුලු) භාග්‍යවතුන් වහන්සේගේ සෝවාන් සව්වෙක් වෙමි” යි සක් දෙවිඳු පැවැසීය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "431"
            },
            {
                "format": 13,
                "text": "23. “දෙවිඳ, මෙයින් පෙරැ තොප මෙ බඳු සතුටක් ලැබීම, සොම්නසක් ලැබීම දනිවු දැ” යි භාග්‍යවතුන් වහන්සේ අසා වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වහන්ස, මම් මෙයින් පෙරැ මෙබඳු සතුටක් ලැබීම සොම්නසක් ලැබීම දනිමි” යි සක් දෙවිඳු කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“දෙවිඳ, මෙයින් පෙර තොප කෙසේ වූ මෙබඳු සතුටක් ලැබීම සොම්නසක් ලැබිම දනිවු දැ?” යි භාග්‍යවතුන් වහන්සේ අසා වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වහන්ස, පෙරැ වූවක් කියමි. පෙරැ දෙවියන්ගේ ද අසුරයන්ගේ ද, යුද්ධයෙක් එළැඹැ සිටියේ විය. වහන්ස, ඒ යුද්ධයෙහි දෙවියෝ ජය ගත්හ. අසුරයෝ පැරැදුණාහ. වහන්ස, ඒ යුද්ධය දිනා, දිනූ යුද්ධය ඇති ඒ මට “දැන් යම් දිව්‍ය ඕජසෙක් වේ ද යම් අසුර ඕජසෙකුත් වේ ද, මේ දෙකොටස ම දැන් දෙවියෝ පරිභෝග කරන්නාහ” යි මට මේ සිත විය. වහන්ස, මගේ ඒ යම් සතුට ලැබීමෙක් සොම්නස ලැබීමෙක් වී ද දඬුගෙන හැසිරීම සහිත වූ අවි ගෙන හැසිරීම සහිත වූ ඒ සතුට ලැබීම, ඒ සොම්නස ලැබීම සසරැ කලකිරීම පිණිස නො පවතී, විරාගය පිණිස නො පවතී, නිරෝධය පිණිස නො පවතී, කෙලෙස් සන්සිඳීම පිණිස නො පවතී, විශිෂ්ට ඥානය පිණිස නො පවතී, සත්‍යාවබෝධය පිණිස නො පවතී, නිවන පිණිස නො පවතී. වහන්ස, භාග්‍යවතුන් වහන්සේගේ ධර්මය ඇසීමෙන් මට යම් සතුට ලැබීමෙක්, සොම්නස ලැබීමෙක් වී ද, එය දඬුගෙන හැසිරීම් නැති එකෙක, අවි ‍ගෙන හැසිරීම් නැති එකෙක, ඒකාන්තයෙන් සසර කලකිරෙනු පිණිස, විරාගය පිණිස, නිරෝධය පිණිස, ක්ලේශ ව්‍යුපශමය පිණිස, විශිෂ්ටඥානය පිණිස සත්‍යාවබෝධය පිණිස, නිර්වාණය පිණිස පවතී” යැ යි සක් දෙවිඳු කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "24. “දෙවිඳ, තෝ කවර නම් කරුණක් දක්නෙහි මෙබඳු සතුට ලැබිමක්, සොම්නස ලැබීමක් දන්වහි දැ?” යි භාග්‍යවතුන් වහන්සේ අසා වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වහන්ස, මම් කරුණු සයක් දක්නෙම්, මෙ බඳු වූ සතුට ලැබීමක් සොම්නස ලැබීමක් දන්වමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘නිදුකාණන් වහන්ස, මෙහි ම සිටුනා දෙවි වූ ම මා විසින් (ආයු ගෙවී) මෙහි දී ම සැව අනතුරු වැ මෙහි ම ඉපැදීමෙන් පුනරායුෂය ද ලද්දේ ය. මෙ කරුණ මෙසේ දැන වදාළ මැනැවි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, මේ පළමු වන කරුණ දක්නෙම්, මෙබඳු වූ සතුට ලැබීම, සොම්නස ලැබීම දන්වමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘මම් දිව්‍ය ආයුෂ හැර දමා දෙව් අත් බැවින් සැව, යම් තැනෙක මා සිත ඇලෙයි ද, එහි සිහි නොමුළා වැ (කැත් කුල ආදියෙක) මවු කුසකට එළැඹෙන්නෙමි.”",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "433"
            },
            {
                "format": 13,
                "text": "වහන්ස, මම් මේ දෙවෙනි කරුණ දක්නෙම්, මෙබඳු වූ සතුටක් ලැබීම, සොම්නසක් ලැබීම දන්වමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘ඒ මම් සස්නෙහි ඇලුණෙම්, නොමුළා වූ ප්‍රඥා ඇති වැ වසන්නෙම්, ප්‍රඥා ඇත්තෙම්, එළැඹැ සිටි සිහි ඇත්තෙම්, න්‍යායයෙන් (අරීසවු බවට නිසි වූ කරුණින්) යුතු වැ වසන්නෙමි.’",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, මේ තුන් වැනි කරුණ දක්නෙම්, මෙබඳු වූ සතුට ලැබිම සොම්නස ලැබිම දන්වමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“න්‍යායයෙන් (අරී සවු බවට ගැළපෙන කරුණින්) හැසිරෙන මට ඉදින් සම්බෝධිය වන්නේ නම් (සෙදැගැමිවන්නෙම් නම්) නොලත් විශේෂාධිගමය ලබනු කැමැත්තෙම් වසන්නෙමි. එය ම මිනිස් ලොවැ මගේ කෙළවර අත්බව වන්නේ ය.”",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, මේ සතර වන කරුණ දක්නෙම්, මෙ බඳු වූ සතුට ලැබීම සොම්නස ලැබිම දන්වමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘මනුෂ්‍යයායුෂය හැරැ මිනිසත් බැවින් සැවැ දෙව් ලොවැ යලිදු උතුම් දෙවියෙක් වන්නෙමි.’",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, මේ පස් වන කරුණ දක්නෙම්, මෙ බඳු වූ සතුට ලැබිම මෙබඳු වූ සොම්නස ලැබීම දන්වමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘යශස් ඇති, සියලු දෙවියනට වඩා උතුම් වූ, අකනිටා බඹලොව් වැසි ඒ යම් දෙවි කෙනෙක් ඇද්ද, මගේ අන්තිම අත්බව පවත්නා කල්හි ඔවුන් අතුරෙහි මගේ නිවාසය වන්නේ ය.’",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, මේ සවැනි කරුණ දක්නෙම්, මෙබඳු වූ සතුට ලැබීම සොම්නස ලැබීම දන්වමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, මම් මේ කරුණු සය දක්නෙම්, මෙ බඳු වූ සතුට ලැබිම, සොම්නස ලැබීම දන්වමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "25. නො නිමි මනෝරථය ඇති වැ, සැක කරන සුලු වැ, විමති ඇති වැ, තථාගත කෙනකු සොයනුයෙම් දික් කලක් සසරැ හැවිද්දෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යම් මහණුන් ත්‍රිවිධ විවේකයෙන් විවික්ත වැ වසන්නන් කොට හඟිම් ද, මේ බුදුවරු යි හඟින්නෙම් ඔවුන් ඇසුරු කරන්නට යෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘ආර්‍ය්‍ය මාර්ගයට බස්නා පිළිවෙත කෙසේ වේ ද? ආර්‍ය්‍යමාර්ගයට බාධක පිළිවෙත (අනුපාය ප්‍රතිපත්තිය) කෙසේ වේ දැ?’ යි මා විසින් විචාරන ලද්දා වූ ආර්‍ය්‍ය මාර්ගයෙහි ද ප්‍රතිපත්තීන්හි ද විචාළ කරුණු මොනොවට විසඳා කියන්නට ඔහු නො හැකි වෙත්.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "435"
            },
            {
                "format": 13,
                "text": "ඔහු යම් කලෙක ‘දෙවියන් අතුරෙන් සක් දෙව් තෙමේ ආයේ යැ’ යි මා දැනැ හැඳිනැ ගනිත් ද, එ කල, ‘කුමක් කොට මේ සක් දෙව් පදයට පැමිණියෙහි දැ?’ යි මා ම පිළිවිසිත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඔවුනට මම් අසා ඇති පරිදි ජනයා අතර ප්‍රකට වූ සප්ත ව්‍රත පද ධර්මය දෙසමි. එයින් ඔහු ‘අප විසින් වාසව (ශක්‍ර) තෙම දක්නා ලදැ’ යි කියාත් සතුටු වෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වැලි යම් කලෙක සැක දුරු කරන බුදුරජුන් දුටුයෙම් ද, ඒ අද ඒ සම්බුදු රජුන් ඇසුරු කොට ඒ මම් පහ වූ බිය ඇත්තෙකිම් වෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "තෘෂ්ණා නැමැතිහුල නසාලූ, සම පුඟුලක්හු නැති, බුදුරජුන් මම් වඳිමි. මහාවීර වූ සූර්‍ය්‍යබන්ධූන් වහන්සේ වඳිමි. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "පෙරැ දෙවියන් සමඟ බඹහට යම් නමස්කාරයක් කළමෝ ද, නිදුකාණන් වහන්ස, අද ඔබට ඒ නමස්කාරය කරන්නමු. දැන් ඔබට පිණිපා කරම්හ."
            },
            {
                "format": 13,
                "text": "‘ඔබ ම සම්බුදුහු වෙති, ඔබ ම නිරුත්තර ශාස්තෘහු වෙති. දෙවියන් සහිත ලොවැ ඔබට සම පුඟුලෙක් නැත.”",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "26. ඉක්බිති සක් දෙවිඳු පන්සිළු ගඳෙවු පුතු බණවා ‘දරුව පන්සිළු, පළමු කොට තෝ භාග්‍යවතුන් වහන්සේ පැහැදැවූයෙහි (සිත් ගත්තෙහි) ය. ඒ තෝ මට බොහෝ උපකාරී වූයෙහි ය. දරුව, පළමු කොට තා විසින් පහදවන ලද අර්හත් සම්‍යක් සම්බුද්ධ භාග්‍යවතුන් වහන්සේ දක්නට පසු වැ අපි එළඹුණම්හ. තා (අද සිට) පිය තනතුරෙහි තබන්නෙමි. තෝ අද සිට ගන්ධර්වයනට රජ වන්නෙහි ය. හිරුහු සේ බබලන භද්‍රා දෙවඟන තට දෙමි. තා විසින් ඕ වෙසෙසින් පතන ලද්දී යැ” යි කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති සක් දෙවිඳු අත්ලෙන් පොළොව ස්පර්ශ කොට “ඒ භගවත් අර්හත් සම්‍යක් සම්බුද්ධයන් වහන්සේට නමස්කාර වේ වා, ඒ භගවත් අර්හත් සම්බුද්ධයන් වහන්සේට නමස්කාර වේ වා, ඒ භගවත් අර්හත් සම්‍යක් සම්බුද්ධයන් වහන්සේට නමස්කාර වේවා” යි තුන් වරක් උදන් ඇනී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මේ නිර්ගාථක සූත්‍රය වදාරනුලබන කල්හි සක් දෙවිඳු ට ද අන් අසූ දහසක් දෙවියනට ද ‘යමක් උපදනා සුලු ද ඒ සියල්ල නැසෙන සුලු යැ යි කෙලෙස් රජස් රහිත, කෙලෙස් මල රහිත දහම් ඇස (සෝවාන් මඟ නුවණ) පහළ විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ සක් දෙවිඳු විසින් පතන ලද විචාරන ලද යම් ප්‍රශ්න කෙනෙක් වූහු ද, ඔහු භගවත් බුදුරජුන් විසින් විසඳන ලදුහ. එහෙයින් මේ නිර්ගාථක සූත්‍රයට සක්කපඤ්හ (ශක්‍රප්‍රශ්න) යැ යි ම නමෙක් වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අටවන සක්කපඤ්හ සූත්‍රය නිමියේ ය.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ]
    }
]