[
    {
        "filename": "dn-ptkv-1",
        "bookId": 12,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "2"
            },
            {
                "type": "centered",
                "text": "සුත්තන්තපිටකෙ",
                "level": 2
            },
            {
                "type": "centered",
                "text": "දීඝනිකායො",
                "level": 5
            },
            {
                "type": "centered",
                "text": "තතියො භාගො",
                "level": 3
            },
            {
                "type": "centered",
                "text": "පාථිකවග්ගො",
                "level": 4
            },
            {
                "type": "centered",
                "text": "නමො තස්ස භගවතො අරහතො සම්මා සම්බුද්ධස්ස"
            },
            {
                "type": "centered",
                "text": "1",
                "level": 3
            },
            {
                "type": "heading",
                "text": "පාථිකසුත්තං",
                "level": 3
            },
            {
                "type": "paragraph",
                "text": "1. එවං මෙ සුතං එකං සමයං භගවා මල්ලෙසු විහරති අනුපියා නාම මල්ලානං නිගමො."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා පුබ්බණ්හසමයං{1 පාථෙය්ය වග්ගො (සීමු)} නිවාසෙත්වා පත්තචීවරමාදාය අනුපියං{2 අනුපපියම් (ස්යා). අනුපියං (කාම)} පිණ්ඩාය පාවිසි. අථ ඛො භගවතො එතදහොසි: “අතිප්පගො ඛො තාව අනුපියායං{3 අනුපියං (කාම)} පිණ්ඩාය චරිතුං. යන්නූනාහං යෙන භග්ගවගොත්තස්ස පරිබ්බාජකස්ස ආරාමො, යෙන භග්ගවගොත්තො පරිබ්බාජකො තෙනුපසඞ්කමෙය්යන්ති.”"
            },
            {
                "type": "paragraph",
                "text": "2. අථ ඛො භගවා යෙන භග්ගවගොත්තස්ස පරිබ්බාජකස්ස ආරාමො, යෙන භග්ගවගොත්තො පරිබ්බාජකො තෙනුපසඞ්කමි. අථ ඛො භග්ගවගොත්තො පරිබ්බාජකො භගවන්තං එතදවොච: “එතු ඛො භන්තෙ භගවා. ස්වාගතං භන්තෙ භගවතො. චිරස්සං ඛො භන්තෙ භගවා ඉමං පරියායමකාසි යදිදං ඉධාගමනාය. නිසීදතු භන්තෙ භගවා, ඉදමාසනං පඤ්ඤත්තන්ති.” නිසීදි භගවා පඤ්ඤත්තෙ ආසනෙ. භග්ගවගොත්තො’පි ඛො පරිබ්බාජකො අඤ්ඤතරං නීචං ආසනං ගහෙත්වා එකමන්තං නිසීදි."
            },
            {
                "type": "page-break",
                "text": "4"
            },
            {
                "type": "paragraph",
                "text": "3. එකමන්තං නිසින්නො ඛො භග්ගවගොත්තො පරිබ්බාජකො භගවන්තං එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "“පුරිමානි භන්තෙ දිවසානි පුරිමතරානි සුනක්ඛත්තො ලිච්ඡවිපුත්තො යෙනාහං තෙනුපසඞ්කමි, උපසඞ්කමිත්වා මං එතදවොච: ‘පච්චක්ඛාතො’දානි මයා භග්ගව භගවා, නදානාහං භග්ගව භගවන්තං උද්දිස්ස විහරාමී’ති. කච්චෙතං භන්තෙ තථෙව, යථා සුනක්ඛත්තො ලිච්ඡවිපුත්තො අවචා?”ති."
            },
            {
                "type": "paragraph",
                "text": "4. “තථෙව ඛො එතං භග්ගව යථා සුනක්ඛත්තො ලිච්ඡවිපුත්තො අවච. පුරිමානි භග්ගව දිවසානි පුරිමතරානි සුනක්ඛත්තො ලිච්ඡවිපුත්තො යෙනාහං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා මං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො මං එතදවොච: ‘පච්චක්ඛාමි’දානාහං භන්තෙ භගවන්තං. නාහං භන්තෙ භගවන්තං උද්දිස්ස විහරිස්සාමී’ති. එවං වුත්තෙ අහං භග්ගව සුනක්ඛත්තං ලිච්ඡවිපුත්තං එතදවොචං:"
            },
            {
                "type": "paragraph",
                "text": "“අපි නු ත්යාහං{1 තාහං - සීමු, PTS.} සුනක්ඛත්ත එවං අවචං: එහි ත්වං සුනක්ඛත්ත, මමං උද්දිස්ස විහරාහී ති?”"
            },
            {
                "type": "paragraph",
                "text": "“නො හෙතං භන්තෙ.”"
            },
            {
                "type": "paragraph",
                "text": "‘ත්වං වා පන මං එවං අවච: අහං භන්තෙ භගවන්තං උද්දිස්ස විහරිස්සාමී ති?”"
            },
            {
                "type": "paragraph",
                "text": "“නො හෙතං භන්තෙ.”"
            },
            {
                "type": "paragraph",
                "text": "“ඉති කිර සුනක්ඛත්ත නෙවාහන්තං වදාමි: එහි ත්වං සුනක්ඛත්ත මමං උද්දිස්ස විහරාහීති. නපි කිර මං ත්වං වදෙසි: අහං භන්තෙ භගවන්තං උද්දිස්ස විහරිස්සාමී ති. එවං සන්තෙ මොඝපුරිස කො සන්තො කං පච්චාචික්ඛසි? පස්ස මොඝපුරිස යාවඤ්ච{2 යාව ච - මඡසං.} තෙ ඉදං අපරද්ධන්ති.”"
            },
            {
                "type": "paragraph",
                "text": "5. “න හි පන මෙ භන්තෙ භගවා උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරොතී”ති."
            },
            {
                "type": "paragraph",
                "text": "“අපි නු ත්යාහං සුනක්ඛත්ත එවං අවචං: එහි ත්වං සුනක්ඛත්ත, මමං උද්දිස්ස විහරාහි, අහන්තෙ උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරිස්සාමී ති?”"
            },
            {
                "type": "page-break",
                "text": "6"
            },
            {
                "type": "paragraph",
                "text": "“නො හෙතං භන්තෙ”."
            },
            {
                "type": "paragraph",
                "text": "“ත්වං ච පන මං එවං අවච:"
            },
            {
                "type": "paragraph",
                "text": "අහං භන්තෙ භගවන්තං උද්දිස්ස විහරිස්සාමි, භගවා මෙ උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරිස්සතී ති?”"
            },
            {
                "type": "paragraph",
                "text": "“නො හෙතං භන්තෙ.”"
            },
            {
                "type": "paragraph",
                "text": "“ඉති කිර සුනක්ඛත්ත නෙවාහන්තං වදාමි: එහි ත්වං සුනක්ඛත්ත, මමං උද්දිස්ස විහරාහි, අහන්තෙ උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරිස්සාමී ති. න පි කිර මං ත්වං වදෙසි: අහං භන්තෙ භගවන්තං උද්දිස්ස විහරිස්සාමි, භගවා මෙ උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරිස්සතී ති. එවං සන්තෙ මොඝපුරිස කො සන්තො කං පච්චාචික්ඛසි? තං කිම්මඤ්ඤසි සුනක්ඛත්ත? කතෙ වා උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියෙ අකතෙ වා උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියෙ, යස්සත්ථාය මයා ධම්මො දෙසිතො සො නිය්යාති තක්කරස්ස සම්මාදුක්ඛක්ඛයායා?”ති."
            },
            {
                "type": "paragraph",
                "text": "“කතෙ වා භන්තෙ උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියෙ අකතෙ වා උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියෙ, යස්සත්ථාය භගවතා ධම්මො දෙසිතො සො නිය්යාති තක්කරස්ස සම්මාදුක්ඛක්ඛයායා”ති. "
            },
            {
                "type": "paragraph",
                "text": "“ඉති කිර සුනක්ඛත්ත කතෙ වා උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියෙ අකතෙ වා උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියෙ, යස්සත්ථාය මයා ධම්මො දෙසිතො සො නිය්යාති තක්කරස්ස සම්මා දුක්ඛක්ඛයායා ති, තත්ර සුනක්ඛත්ත කිං උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කතං කරිස්සති? පස්ස මොඝපුරිස යාවඤ්ච තෙ ඉදං අපරද්ධන්ති.”"
            },
            {
                "type": "paragraph",
                "text": "6. “න හි පන මෙ භන්තෙ භගවා අග්ගඤ්ඤං පඤ්ඤපෙතී”ති."
            },
            {
                "type": "paragraph",
                "text": "“අපි නු ත්යාහං සුනක්ඛත්ත එවං අවචං. එහි ත්වං සුනක්ඛත්ත මමං උද්දිස්ස විහරාහි, අහන්තෙ අග්ගඤ්ඤං පඤ්ඤපෙස්සාමී ති?”"
            },
            {
                "type": "paragraph",
                "text": "“නො හෙතං භන්තෙ.”"
            },
            {
                "type": "paragraph",
                "text": "“ත්වං වා පන මං එවං අවච: අහං භන්තෙ භගවන්තං උද්දිස්ස විහරිස්සාමි, භගවා මෙ අග්ගඤ්ඤං පඤ්ඤපෙස්සතී ති?”"
            },
            {
                "type": "paragraph",
                "text": "“නො හෙතං භන්තෙ.”"
            },
            {
                "type": "page-break",
                "text": "8"
            },
            {
                "type": "paragraph",
                "text": "“ඉති කිර සුනක්ඛත්ත නෙවාහන්තං වදාමි: “එහි ත්වං සුනක්ඛත්ත මමං උද්දිස්ස විහරාහි, අහන්තෙ අග්ගඤ්ඤං පඤ්ඤපෙස්සාමීති. න පි කිර මං ත්වං වදෙසි: අහං භන්තෙ භගවන්තං උද්දිස්ස විහරිස්සාමි, භගවා මෙ අග්ගඤ්ඤං පඤ්ඤපෙස්සතී ති. එවං සන්තෙ මොඝපුරිස කො සන්තො කං පච්චාචික්ඛසි? තං කිම්මඤ්ඤසි සුනක්ඛත්ත? පඤ්ඤත්තෙ වා අග්ගඤ්ඤෙ අපඤ්ඤත්තෙ වා අග්ගඤ්ඤෙ යස්සත්ථාය මයා ධම්මො දෙසිතො, සො නිය්යාති තක්කරස්ස සම්මා දුක්ඛක්ඛයායා’ති?"
            },
            {
                "type": "paragraph",
                "text": "‘පඤ්ඤත්තෙ වා භන්තෙ අග්ගඤ්ඤෙ අපඤ්ඤත්තෙ වා අග්ගඤ්ඤෙ, යස්සත්ථාය භගවතො ධම්මො දෙසිතො සො නිය්යාති තක්කරස්ස සම්මා දුක්ඛක්ඛයායා’ති."
            },
            {
                "type": "paragraph",
                "text": "‘ඉති කිර සුනක්ඛත්ත පඤ්ඤත්තෙ වා අග්ගඤ්ඤෙ අපඤ්ඤත්තෙ වා අග්ගඤ්ඤෙ, යස්සත්ථාය මයා ධම්මො දෙසිතො, සො නිය්යාති තක්කරස්ස සම්මා දුක්ඛක්ඛයාය. තත්ර සුනක්ඛත්ත කිං අග්ගඤ්ඤං පඤ්ඤත්තං කරිස්සති? පස්ස මොඝපුරිස යාවඤ්ච තෙ ඉදං අපරද්ධං. අනෙකපරියායෙන ඛො තෙ සුනක්ඛත්ත මම වණ්ණො භාසිතො වජ්ජිගාමෙ: ඉතිපි සො භගවා අරහං සම්මාසම්බුද්ධො විජ්ජාචරණසම්පන්නො සුගතො ලොකවිදූ අනුත්තරො පුරිසදම්මසාරථි සත්ථා දෙවමනුස්සානං බුද්ධො භගවා ති. ඉති ඛො තෙ සුනක්ඛත්ත අනෙකපරියායෙන මම වණ්ණො භාසිතො වජ්ජිගාමෙ."
            },
            {
                "type": "paragraph",
                "text": "අනෙකපරියායෙන ඛො තෙ සුනක්ඛත්ත ධම්මස්ස වණ්ණො භාසිතො වජ්ජිගාමෙ; ස්වාක්ඛාතො භගවතා ධම්මො සන්දිට්ඨිකො අකාලිකො එහිපස්සිකො ඔපනයිකො{1 ඔපනෙය්යකො (මඡසං.)} පච්චත්තං වෙදිතබ්බො විඤ්ඤූහී”ති. ඉති ඛො තෙ සුනක්ඛත්ත අනෙකපරියායෙන ධම්මස්ස වණ්ණො භාසිතො වජ්ජිගාමෙ. අනෙකපරියායෙන ඛො තෙ සුනක්ඛත්ත සඞ්ඝස්ස වණ්ණො භාසිතො වජ්ජිගාමෙ: සුපටිපන්නො{2 සුප්පටිපන්නො. (මඡසං.)} භගවතො සාවකසඞ්ඝො, උජුපටිපන්නො භගවතො{3 උජුප්පටිපන්නො, (මඡසං.)} සාවකසඞ්ඝො, ඤායපටිපන්නො{4 ඤායප්පටිපන්නො. (මඡසං.)} භගවතො සාවකසඞ්ඝො, සාමීචිපටිපන්නො භගවතො සාවකසඞ්ඝො, යදිදං චත්තාරි පුරිසයුගානි අට්ඨ පුරිසපුග්ගලා, එස භගවතො සාවකසඞ්ඝො, ආහුණෙෙය්යා පාහුණෙෙය්යා දක්ඛිණෙෙය්යා අඤ්ජලිකරණීයො අනුත්තරං පුඤ්ඤක්ඛෙත්තං ලොකස්සා ති. ඉති ඛො තෙ සුනක්ඛත්ත අනෙකපරියායෙන සඞ්ඝස්ස වණ්ණො භාසිතො වජ්ජිගාමෙ. ආරොචයාමි ඛො තෙ සුනක්ඛත්ත පටිවෙදයාමි ඛො තෙ සුනක්ඛත්ත, භවිස්සන්ති ඛො තෙ සුනක්ඛත්ත වත්තාරො: නො විසහි සුනක්ඛත්තො ලිච්ඡවිපුත්තො සමණෙ ගොතමෙ බ්රහ්මචරියං චරිතුං. සො අවිසහන්තො සික්ඛං පච්චක්ඛාය හීනායාවත්තො ති. ඉති ඛො තෙ සුනක්ඛත්ත භවිස්සන්ති වත්තාරො’ති. එවං ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො මයා වුච්චමානො අපක්කමෙව ඉමස්මා ධම්මවිනයා යථා තං ආපායිකො නෙරයිකො."
            },
            {
                "type": "page-break",
                "text": "10"
            },
            {
                "type": "centered",
                "text": "කොරක්ඛත්තියවත්ථු",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "7. එකමිදාහං භග්ගව සමයං ඛුලූසු විහරාමි, උත්තරකා නාම ඛුලූනං නිගමො. අථ ඛ්වාහං භග්ගව පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය සුනක්ඛත්තෙන ලිච්ඡවිපුත්තෙන පච්ඡාසමණෙන උත්තරකං පිණ්ඩාය පාවිසිං. තෙන ඛො පන සමයෙන අචෙලො කොරක්ඛත්තියො කුක්කුරවතිකො චාතුකුණ්ඩිකො ඡමා නිකිණ්ණං භක්ඛසං මුඛෙනෙව ඛාදති මුඛෙනෙව භුඤ්ජති අද්දසා ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො අචෙලං කොරක්ඛත්තියං කුක්කුරවතිකං චාතුකුණ්ඩිකං ඡමා නිකිණ්ණං භක්ඛසං මුඛෙනෙව ඛාදන්තං මුඛෙනෙව භුඤ්ජන්තං. දිස්වානස්ස එතදහොසි: සාධුරූපො වත භො අරහං සමණො චාතුකුණ්ඩිකො{1 චතුකුණ්ඩිකො (සී), චතුකොණ්ඩිකො (සීමු.)} ඡමා නිකිණ්ණං භක්ඛසං මුඛෙනෙව ඛාදති මුඛෙනෙව භුඤ්ජතී ති."
            },
            {
                "type": "paragraph",
                "text": "8. අථ ඛ්වාහං භග්ගව සුනක්ඛත්තස්ස ලිච්ඡවිපුත්තස්ස චෙතසා චෙතො පරිවිතක්කමඤ්ඤාය සුනක්ඛත්තං ලිච්ඡවිපුත්තං එතදවොචං: ‘ත්වම්පි නාම මොඝපුරිස සමණො සක්යපුත්තියො පටිජානිස්සසී?’ති."
            },
            {
                "type": "paragraph",
                "text": "‘කිං පන මං භන්තෙ භගවා එවමාහ: ත්වම්පි නාම මොඝපුරිස සමණො සක්යපුත්තියො පටිජානිස්සසී ති?’"
            },
            {
                "type": "paragraph",
                "text": "“නනු තෙ සුනක්ඛත්ත ඉමං අචෙලං කොරක්ඛත්තියං කුක්කුරවතිකං චාතුකුණ්ඩිකං ඡමා නිකිණ්ණං භක්ඛසං මුඛෙනෙව ඛාදන්තං මුඛෙනෙව භුඤ්ජන්තං. දිස්වාන එතදහොසි: සාධුරූපො වත භො අරහා{2 අරහං - සීමු.} සමණො චාතුකුණ්ඩිකො ඡමා නිකිණ්ණං භක්ඛසං මුඛෙනෙව ඛාදති මුඛෙනෙව භුඤ්ජතී ති?”"
            },
            {
                "type": "paragraph",
                "text": "“එවං භන්තෙ. කිං පන භන්තෙ භගවා අරහත්තස්ස මච්ඡරායතී?”ති."
            },
            {
                "type": "page-break",
                "text": "12"
            },
            {
                "type": "paragraph",
                "text": "“න ඛො’හං මොඝපුරිස අරහත්තස්ස මච්ඡරායාමි. අපි ච තුය්හෙවෙතං පාපකං දිට්ඨිගතං උප්පන්නං, තං පජහ. මා තෙ අහොසි දීඝරත්තං අහිතාය දුක්ඛාය. යං ඛො පනෙතං සුනක්ඛත්ත මඤ්ඤසි අචෙලං කොරක්ඛත්තියං: සාධුරූපො අරහං සමණො ති, සො සත්තමං දිවසං අලසකෙන කාලං කරිස්සති. කාලකතො ච - කාලකඤ්ජකා නාම අසුරා, සබ්බනිහීනො අසුරකායො - තත්ර උපපජ්ජිස්සති. කාලකතඤ්ච නං බීරණත්ථම්භකෙ සුසානෙ ඡඩ්ඩෙස්සන්ති. ආකඞ්ඛමානො ච ත්වං සුනක්ඛත්ත අචෙලං කොරක්ඛත්තියං උපසඞ්කමිත්වා පුච්ඡෙය්යාසි: ජානාසි ආවුසො අචෙල කොරක්ඛත්තිය අත්තනො ගතින්ති? ඨානං ඛො පනෙතං සුනක්ඛත්ත විජ්ජති, යන්තෙ අචෙලො කොරක්ඛත්තියො බ්යාකරිස්සති: ජානාමි ආවුසො සුනක්ඛත්ත අත්තනො ගතිං - කාලකඤ්ජිකා නාම අසුරා, සබ්බනිහීනො අසුරකායො - තත්රම්හි උපපන්නො”ති."
            },
            {
                "type": "paragraph",
                "text": "9. අථ ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො යෙන අචෙලො කොරක්ඛත්තියො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා අචෙලං කොරක්ඛත්තියං එතදවොච: බ්යාකතො ඛො’සි ආවුසො කොරක්ඛත්තිය සමණෙන ගොතමෙන; අචෙලො කොරක්ඛත්තියො සත්තමං දිවසං අලසකෙන කාලං කරිස්සති. කාලකතො ච - කාලකඤ්ජිකා නාම අසුරා, සබ්බනිහීනො අසුරකායො - තත්ර උපපජ්ජිස්සති. කාලකතඤ්ච නං බීරණත්ථම්බකෙ සුසානෙ ඡඩ්ඩෙස්සන්තී”ති. යෙන ත්වං ආවුසො කොරක්ඛත්තිය මත්තමත්තඤ්ච භත්තං{1 මත්තමත්තංච - සීමු.} භුඤ්ජෙය්යාසි, මත්තමත්තඤ්ච පානීයං පිවෙය්යාසි. යථා සමණස්ස ගොතමස්ස මිච්ඡා අස්ස වචනන්ති”. අථ ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො එකද්වීහිකාය සත්තරත්තින්දිවානි ගණෙසි යථා තං තථාගතස්ස අසද්දහමානො."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භග්ගව අචෙලො කොරක්ඛත්තියො සත්තමං දිවසං අලසකෙන කාලමකාසි. කාලකතො ච - කාලකඤ්ජිකා නාම අසුරා, සබ්බනිහීනො අසුරකායො - තත්ර උපපජ්ජි. කාලකතඤ්ච නං බීරණත්ථම්බකෙ සුසානෙ ඡඩ්ඩෙසුං. අස්සොසි ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො අචෙලො කිර කොරක්ඛත්තියො අලසකෙන කාලකතො බීරණත්ථම්බකෙ සුසානෙ ඡඩ්ඩිතො’ති."
            },
            {
                "type": "page-break",
                "text": "14"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො යෙන බීරණත්ථම්බකං සුසානං යෙන අචෙලො කොරක්ඛත්තියො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා අචෙලං කොරක්ඛත්තියං තික්ඛත්තුං පාණිනා ආකොටෙසි: “ජානාසි ආවුසො කොරක්ඛත්තිය අත්තනො ගතින්ති?”. අථ ඛො භග්ගව අචෙලො කොරක්ඛත්තියො පාණිනා පිට්ඨිං පරිපුඤ්ජන්තො වුට්ඨාසි ‘ජානාමි ආවුසො සුනක්ඛත්ත අත්තනො ගතිං - කාලකඤ්ජිකා නාම අසුරා - සබ්බනිහීනො අසුරකායො, තත්රම්හි උපපන්නො ති වත්වා තත්ථෙව උත්තානො පරිපති."
            },
            {
                "type": "paragraph",
                "text": "10. අථ ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො යෙනාහං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා මං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො අහං භග්ගව සුනක්ඛත්තං ලිච්ඡවිපුත්තං එතදවොචං: තං කිම්මඤ්ඤසි සුනක්ඛත්ත? යථෙව තෙ අහං අචෙලං කොරක්ඛත්තියං ආරබ්භ බ්යාකාසිං, තථෙව තං විපක්කං{1 විපාකං (සීමු.)} අඤ්ඤථා වා?ති."
            },
            {
                "type": "paragraph",
                "text": "“යථෙව මෙ භන්තෙ භගවා අචෙලං කොරක්ඛත්තියං ආරබ්භ බ්යාකාසි, තථෙව තං විපක්කං නො අඤ්ඤථා”ති."
            },
            {
                "type": "paragraph",
                "text": "“තං කිම්මඤ්ඤසි සුනක්ඛත්ත යදි එවං සන්තෙ කතං වා හොති උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං අකතං වා?”ති. “අද්ධා ඛො භන්තෙ එවං සන්තෙ කතං හොති උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං නො අකතන්ති.” එවම්පි ඛො මං ත්වං මොඝපුරිස උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරොන්තං එවං වදෙසි: න හි පන මෙ භන්තෙ භගවා උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරොතී’ති. පස්ස මොඝපුරිස යාවඤ්ච තෙ ඉදං අපරද්ධන්ති. එවම්පි ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො මයා වුච්චමානො අපක්කමෙව ඉමස්මා ධම්මවිනයා, යථා තං ආපායිකො නෙරයිකො."
            },
            {
                "type": "centered",
                "text": "කළාරමට්ඨුකවත්ථු",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "11. එකමිදාහං භග්ගව සමයං වෙසාලියං විහරාමි මහාවනෙ කූටාගාරසාලායං. තෙන ඛො පන සමයෙන අචෙලො කළාරමට්ඨුකො{2 කොරමට්ඨකො - සීමු. කණ්ඩරමසුකො - PTS. කලාරමට්ඨකො - මඡසං.} වෙසාලියං පටිවසති ලාභග්ගප්පත්තො චෙව යසග්ගප්පත්තො ච වජ්ජිගාමෙ. තස්ස සත්ත වතපදානි සමත්තානි සමාදින්නානි හොන්ති:"
            },
            {
                "type": "paragraph",
                "text": "යාවජීවං අචෙලකො අස්සං න වත්ථං පරිදහෙය්යං."
            },
            {
                "type": "paragraph",
                "text": "යාවජීවං බ්රහ්මචාරී අස්සං න මෙථුනං ධම්මං පටිසෙවෙය්යං."
            },
            {
                "type": "paragraph",
                "text": "යාවජීවං සුරාමංසෙනෙව යාපෙය්යං න ඔදනකුම්මාසං භුඤ්ජෙය්යං."
            },
            {
                "type": "page-break",
                "text": "16"
            },
            {
                "type": "paragraph",
                "text": "පුරත්ථිමෙන වෙසාලිං උදෙනං නාම චෙතියං තං නාතික්කමෙය්යං,"
            },
            {
                "type": "paragraph",
                "text": "දක්ඛිණෙන වෙසාලිං ගොතමකං නාම චෙතියං තං නාතික්කමෙය්යං,"
            },
            {
                "type": "paragraph",
                "text": "පච්ඡිමෙන වෙසාලිං සත්තම්බං නාම චෙතියං තං නාතික්කමෙය්යං,"
            },
            {
                "type": "paragraph",
                "text": "උත්තරෙන වෙසාලිං බහුපුත්තං නාම චෙතියං, තං නාතික්කමෙය්ය’න්ති.”"
            },
            {
                "type": "paragraph",
                "text": "සො ඉමෙසං සත්තන්නං වතපදානං{1 වත්තපදානි - PTS.} සමාදානහෙතු ලාභග්ගප්පත්තො චෙව යසග්ගප්පත්තො ච වජ්ජිගාමෙ. අථ ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො යෙන අචෙලො කළාරමට්ඨුකො තෙනුපසඞ්කමි, උපසඞ්කමිත්වා අචෙලං කළාරමට්ඨුකං පඤ්හං පුච්ඡි. තස්ස අචෙලො කළාරමට්ඨුකො පඤ්හං පුට්ඨො න සම්පායාසි. අසම්පායන්තො කොපඤ්ච දොසඤ්ච අප්පච්චයඤ්ච පාත්වාකාසි. අථ ඛො භග්ගව සුනක්ඛත්තස්ස ලිච්ඡවිපුත්තස්ස එතදහොසි “සාධුරූපං වත භො අරහන්තං සමණං ආසාදිම්හසෙ, මා වත නො අහොසි දීඝරත්තං අහිතාය දුක්ඛායා”ති."
            },
            {
                "type": "paragraph",
                "text": "12. අථ ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො යෙනාහං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා මං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො අහං භග්ගව සුනක්ඛත්තං ලිච්ඡවිපුත්තං එතදවොචං: ත්වම්පි නාම මොඝපුරිස සමණො සක්යපුත්තියො පටිජානිස්සසී?ති."
            },
            {
                "type": "paragraph",
                "text": "“කිං පන මං භන්තෙ භගවා එවමාහ: ත්වම්පි නාම මොඝපුරිස සමණො සක්යපුත්තියො පටිජානිස්සසී?”ති."
            },
            {
                "type": "paragraph",
                "text": "“නනු ත්වං සුනක්ඛත්ත අචෙලං කළාරමට්ඨුකං උපසඞ්කමිත්වා පඤ්හං පුච්ඡි? තස්ස තෙ අචෙලො කළාරමට්ඨුකො පඤ්හං පුට්ඨො න සම්පායාසි. අසම්පායන්තො කොපඤ්ච දොසඤ්ච අප්පච්චයඤ්ච පාත්වාකාසි. තස්ස තෙ එතදහොසි: සාධුරූපං වත භො අරහන්තං සමණං ආසාදිම්හසෙ. මා වත නො අහොසි දීඝරත්තං අහිතාය දුක්ඛායා”ති."
            },
            {
                "type": "paragraph",
                "text": "“එවං භන්තෙ. කිං පන භන්තෙ භගවා අරහත්තස්ස මච්ඡරායතී?”ති."
            },
            {
                "type": "page-break",
                "text": "18"
            },
            {
                "type": "paragraph",
                "text": "“න ඛො අහං මොඝපුරිස අරහත්තස්ස මච්ඡරායාමි. අපි ච තුය්හෙවෙතං පාපකං දිට්ඨිගතං උප්පන්නං, තං පජහ. මා තෙ අහොසි දීඝරත්තඅහිතාය දුක්ඛාය. යං ඛො පනෙතං සුනක්ඛත්ත මඤ්ඤසි අචෙලං කළාරමට්ඨුකං ‘සාධුරූපො අරහං සමණො”ති, සො න චිරස්සෙව පරිහිතො{1 පරිදහිතො - සීමු.} සානුචරියො{2 සානුචරිකො - මඡසං.} විචරන්තො ඔදනකුම්මාසං භුඤ්ජිමානො සබ්බානෙව වෙසාලියානි චෙතියානි සමතික්කමිත්වා යසා නික්කිණ්ණො{3 නිකිණ්ණෙ - (සීමු. කම)} කාලං කරිස්සතී”ති."
            },
            {
                "type": "paragraph",
                "text": "13. අථ ඛො භග්ගව අචෙලො කළාරමට්ඨුකො න චිරස්සෙව පරිහිතො සානුචරියො විචරන්තො ඔදනකුම්මාසං භුඤ්ජිමානො සබ්බානෙව වෙසාලියානි චෙතියානි සමතික්කමිත්වා යසා නික්කිණ්ණො කාලමකාසි. අස්සොසි ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො: අචෙලො කිර කළාරමට්ඨුකො පරිහිතො සානුචරියො විචරන්තො ඔදනකුම්මාසං භුඤ්ජමානො සබ්බානෙව වෙසාලියානි චෙතියානි සමතික්කමිත්වා යසා නික්කිණ්ණො කාලං කතො’ති. අථ ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො යෙනාහං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා මං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො අහං භග්ගව සුනක්ඛත්තං ලිච්ඡවිපුත්තං එතදවොචං:"
            },
            {
                "type": "paragraph",
                "text": "තං කිම්මඤ්ඤසි සුනක්ඛත්ත යථෙව තෙ අහං අචෙලං කළාරමට්ඨුකං ආරබ්භ බ්යාකාසිං, තථෙව තං විපක්කං අඤ්ඤථා වා?ති."
            },
            {
                "type": "paragraph",
                "text": "“යථෙව මෙ භන්තෙ භගවා අචෙලං කළාරමට්ඨුකං ආරබ්භ බ්යාකාසි, තථෙව තං විපක්කං නො අඤ්ඤථා”ති."
            },
            {
                "type": "paragraph",
                "text": "“තං කිම්මඤ්ඤසි සුනක්ඛත්ත යදි එවං සන්තෙ කතං වා හොති උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං, අකතං වා?”ති,"
            },
            {
                "type": "paragraph",
                "text": "“අද්ධා ඛො භන්තෙ එවං සන්තෙ කතං හොති උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං, නො අකතන්ති.”"
            },
            {
                "type": "paragraph",
                "text": "“එවම්පි ඛො මං ත්වං මොඝපුරිස උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරොන්තං එවං වදෙසි න හි පන මෙ භන්තෙ භගවා උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරොතී’ති. පස්ස මොඝපුරිස යාවඤ්ච තෙ ඉදං අපරද්ධන්ති.”"
            },
            {
                "type": "paragraph",
                "text": "එවම්පි ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො මයා වුච්චමානො අපක්කමෙව ඉමස්මා ධම්මවිනයා, යථා තං ආපායිකො නෙරයිකො."
            },
            {
                "type": "page-break",
                "text": "20"
            },
            {
                "type": "centered",
                "text": "පාථිකපුත්තවත්ථු",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "14. එකමිදාහං භග්ගව සමයං තත්ථෙව වෙසාලියං විහරාමි මහාවනෙ කූටාගාරසාලායං. තෙන ඛො පන සමයෙන අචෙලො පාථිකපුත්තො{1 පාථික - සීමු. පාටික - (ස්යා. PTS.)} වෙසාලියං පටිවසති ලාභග්ගප්පත්තො චෙව යසග්ගප්පත්තො ච වජ්ජිගාමෙ. සො ච වෙසාලියං පරිසතිං එවං වාචං භාසති: සමණො ගොතමො ඤාණවාදො අහම්පි ඤාණවාදො. ඤාණවාදො ඛො පන ඤාණවාදෙන අරහති උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං දස්සෙතුං. සමණො චෙ ගොතමො උපඩ්ඪපථං ආගච්ඡෙය්ය, අහම්පි උපඩ්ඪපථං ගච්ඡෙය්යං. තෙ තත්ථ උභොපි උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරෙය්යාම. එකං චෙ සමණො ගොතමො උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරිස්සති, ද්වාහං කරිස්සාමි. ද්වෙ චෙ සමණො ගොතමො උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියානි කරිස්සති, චත්තාරාහං කරිස්සාමි. චත්තාරි චෙ සමණො ගොතමො උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියානි කරිස්සති, අට්ඨාහං කරිස්සාමි. ඉති යාවතකං සමණො ගොතමො උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරිස්සති, තන්දිගුණං තන්දිගුණාහං{2 තද්දිගුණං - PTS.} කරිස්සාමී”ති."
            },
            {
                "type": "paragraph",
                "text": "15. “අථ ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො යෙනාහං තෙනුපසඞ්කමි, උපසඞ්කමිත්වා මං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො මං එතදවොච: අචෙලො භන්තෙ පාථිකපුත්තො වෙසාලියං පටිවසති ලාභග්ගප්පත්තො චෙව යසග්ගප්පත්තො ච වජ්ජිගාමෙ. සො වෙසාලියං පරිසතිං එවං වාචං භාසති: ‘සමණො ගොතමො ඤාණවාදො, අහම්පි ඤාණවාදො. ඤාණවාදො ඛො පන ඤාණවාදෙන අරහති උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං දස්සෙතුං. සමණො ගොතමො චෙ උපඩ්ඪපථං ආගච්ඡෙය්ය, අහම්පි උපඩ්ඪපථං ගච්ඡෙය්යං. තෙ තත්ථ උභොපි උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරෙය්යාම. එකං චෙ සමණො ගොතමො උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරිස්සති, ද්වාහං කරිස්සාමි -පෙ- තන්දිගුණං තන්දිගුණාහං කරිස්සාමී’ති."
            },
            {
                "type": "page-break",
                "text": "22"
            },
            {
                "type": "paragraph",
                "text": "16. එවං වුත්තො අහං භග්ගව සුනක්ඛත්තං ලිච්ඡවිපුත්තං එතදවොචං: අභබ්බො ඛො සුනක්ඛත්ත අචෙලො පාථිකපුත්තො තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා මම සම්මුඛීභාවං ආගන්තුං. සචෙපි’ස්ස එවමස්ස ‘අහං තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා සමණස්ස ගොතමස්ස සම්මුඛීභාවං ගච්ඡෙය්යන්ති, මුද්ධා පි තස්ස විපතෙය්යා’ති."
            },
            {
                "type": "paragraph",
                "text": "“රක්ඛතෙතං භන්තෙ භගවා වාචං, රක්ඛතෙතං සුගතො වාචන්ති.”"
            },
            {
                "type": "paragraph",
                "text": "“කිම්පන මං ත්වං සුනක්ඛත්ත එවං වදෙසි: රක්ඛතෙතං භන්තෙ භගවා වාචං, රක්ඛතෙතං සුගතො වාචන්ති?”."
            },
            {
                "type": "paragraph",
                "text": "“භගවතා චස්ස භන්තෙ එසා වාචා එකංසෙන ඔධාරිතා{1 ඔවාදිතා - සීමු.} ‘අභබ්බො අචෙලො පාථිකපුත්තො තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා මම සම්මුඛීභාවං ආගන්තුං. සචෙ පි’ස්ස එවමස්ස ‘අහං තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා සමණස්ස ගොතමස්ස සම්මුඛීභාවං ගච්ඡෙය්යන්ති, මුද්ධා පි තස්ස විපතෙය්යා’ති. අචෙලො ච භන්තෙ පාථිකපුත්තො විරූපරූපෙන භගවතො සම්මුඛීභාවං ආගච්ඡෙය්ය, තදස්ස භගවතො මුසා”ති."
            },
            {
                "type": "paragraph",
                "text": "“අපි නු සුනක්ඛත්ත තථාගතො තං වාචං භාසෙය්ය යා සා වාචා ද්වයගාමිනී?”ති."
            },
            {
                "type": "paragraph",
                "text": "“කිං පන භන්තෙ භගවතා අචෙලො පාථිකපුත්තො චෙතසා චෙතො පරිච්ච විදිතො අභබ්බො අචෙලො පාථිකපුත්තො තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා මම සම්මුඛීභාවං ආගන්තුං, සචෙ පි’ස්ස එවමස්ස තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා සමණස්ස ගොතමස්ස සම්මුඛීභාවං ගච්ඡෙය්යන්ති, මුද්ධාපි තස්ස විපතෙය්යා’ති. උදාහු දෙවතා භගවතො එතමත්ථං ආරොචෙසුං අභබ්බො භන්තෙ ච අචෙලො පාථිකපුත්තො තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා භගවතො සම්මුඛීභාවං ආගන්තුං. සචෙ පි’ස්ස එවමස්ස; අහං තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා සමණස්ස ගොතමස්ස සම්මුඛීභාවං ගච්ඡෙය්යන්ති මුද්ධා පි තස්ස විපතෙය්යා ති?”"
            },
            {
                "type": "page-break",
                "text": "24"
            },
            {
                "type": "paragraph",
                "text": "17. “චෙතසා චෙතො පරිච්ච විදිතො චෙව මෙ සුනක්ඛත්ත අචෙලො පාථිකපුත්තො අභබ්බො අචෙලො පාථිකපුත්තො තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා මම සම්මුඛීභාවං ආගන්තුං. සචෙ පි’ස්ස එවමස්ස: අහං තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා සමණස්ස ගොතමස්ස සම්මුඛීභාවං ගච්ඡෙය්යන්ති, මුද්ධා පි තස්ස විපතෙය්යා’ති. දෙවතා පි මෙ එතමත්ථං ආරොචෙසුං: අභබ්බො භන්තෙ අචෙලො පාථිකපුත්තො තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා භගවතො සම්මුඛීභාවං ආගන්තුං. සචෙ පි’ස්ස එවමස්ස: අහං තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා සමණස්ස ගොතමස්ස සම්මුඛීභාවං ගච්ඡෙය්යන්ති, මුද්ධා පි තස්ස විපතෙය්යා’ති."
            },
            {
                "type": "paragraph",
                "text": "අජිතො පි නාම ලිච්ඡවීනං සෙනාපති අධුනා කාලකතො තාවතිංසකායං උපපන්නො. සො පි මං උපසඞ්කමිත්වා එවමාරොචෙසි: ‘අලජ්ජී භන්තෙ අචෙලො පාථිකපුත්තො මුසාවාදී භන්තෙ අචෙලො පාථිකපුත්තො මම්පි භන්තෙ අචෙලො පාථිකපුත්තො බ්යාකාසි වජ්ජිගාමෙ ‘අජිතො ලිච්ඡවී සෙනාපති මහානිරයං උපපන්නො ති. න ඛො පනාහං භන්තෙ මහානිරයං උපපන්නො තාවතිංසකායම්හි උපපන්නො. අලජ්ජී භන්තෙ අචෙලො පාථිකපුත්තො, මුසාවාදී භන්තෙ අචෙලො පාථිකපුත්තො, අභබ්බො ච භන්තෙ අචෙලො පාථිකපුත්තො තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා භගවතො සම්මුඛීභාවං ආගන්තුං. සචෙ පි’ස්ස එවමස්ස: අහං තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා සමණස්ස ගොතමස්ස සම්මුඛීභාවං ගච්ඡෙය්යන්ති, මුද්ධා පි තස්ස විපතෙය්යා”ති."
            },
            {
                "type": "paragraph",
                "text": "ඉති ඛො සුනක්ඛත්ත චෙතසා චෙතො පරිච්ච විදිතො චෙව මෙ අචෙලො පාථිකපුත්තො අභබ්බො අචෙලො පාථිකපුත්තො තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා මම සම්මුඛීභාවං ආගන්තුං. සචෙ පි’ස්ස එවමස්ස ‘අහං තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා සමණස්ස ගොතමස්ස සම්මුඛීභාවං ගච්ඡෙය්යන්ති’ මුද්ධාපි තස්ස විපතෙය්යාති. දෙවතා’පි මෙ එතමත්ථං ආරොචෙසුං අභබ්බො භන්තෙ අචෙලො පාථිකපුත්තෙ තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා භගවතො සම්මුඛීභාවං ආගන්තුං. සචෙ පි’ස්ස එවමස්ස අහං තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා සමණස්ස ගොතමස්ස සම්මුඛීභාවං ගච්ඡෙය්යන්ති, මුද්ධා පි තස්ස විපතෙය්යා’ති. සො ඛො පනාහං සුනක්ඛත්ත වෙසාලියං පිණ්ඩාය චරිත්වා පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො යෙන අචෙලස්ස පාථිකපුත්තස්ස ආරාමො තෙනුපසඞ්කමිස්සාමි දිවාවිහාරාය. යස්ස දානි ත්වං සුනක්ඛත්ත ඉච්ඡසි, තස්ස ආරොචෙහී”ති."
            },
            {
                "type": "page-break",
                "text": "26"
            },
            {
                "type": "centered",
                "text": "ඉද්ධිපාටිහාරියකථා",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "18. අථ ඛ්වාහං{1 අථ ඛො ස්වාහං - ස්යා.} භග්ගව පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය වෙසාලිං පිණ්ඩාය පාවිසිං. වෙසාලියං පිණ්ඩාය චරිත්වා පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො යෙන අචෙලස්ස පාථිකපුත්තස්ස ආරාමො තෙනුපසඞ්කමිං දිවාවිහාරාය. අථ ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො තරමානරූපො වෙසාලිං පවිසිත්වා යෙන අභිඤ්ඤාතා අභිඤ්ඤාතා ලිච්ඡවී තෙනුපසඞ්කමි. උපසඞ්කමිත්වා අභිඤ්ඤාතෙ අභිඤ්ඤාතෙ ලිච්ඡවී එතදවොච: එසාවුසො භගවා වෙසාලියං පිණ්ඩාය චරිත්වා පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො යෙන අචෙලස්ස පාථිකපුත්තස්ස ආරාමො තෙනුපසඞ්කමි දිවාවිහාරාය. අභික්කමථායස්මන්තො අභික්කමථායස්මන්තො. සාධුරූපානං සමණානං උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං භවිස්සතී ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භග්ගව අභිඤ්ඤාතානං අභිඤ්ඤාතානං ලිච්ඡවීනං එතදහොසි: සාධුරූපානං කිර භො සමණානං උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං භවිස්සති. හන්ද වත භො ගච්ඡාමා ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො යෙන අභිඤ්ඤාතා අභිඤ්ඤාතා බ්රාහ්මණමහාසාලා ගහපතිනෙචයිකා නානාතිත්ථියා සමණබ්රාහ්මණා{2 නානාතිත්ථිය සමණබ්රාහ්මණා - ස්යා.} තෙනුපසඞ්කමි. උපසඞ්කමිත්වා අභිඤ්ඤාතෙ අභිඤ්ඤාතෙ නානාතිත්ථියෙ සමණබ්රාහ්මණෙ එතදවොච: එසාවුසො භගවා වෙසාලියං පිණ්ඩාය චරිත්වා පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො යෙන අචෙලස්ස පාථිකපුත්තස්ස ආරාමො තෙනුපසඞ්කමි දිවාවිහාරාය. අභික්කමථායස්මන්තො අභික්කමථායස්මන්තො. සාධුරූපානං සමණානං උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං භවිස්සතී ති. අථ ඛො භග්ගව අභිඤ්ඤාතානං අභිඤ්ඤාතානං නානාතිත්ථියානං සමණබ්රාහ්මණානං එතදහොසි: සාධුරූපානං කිර භො සමණානං උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං භවිස්සති. හන්ද වත භො ගච්ඡාමා”ති."
            },
            {
                "type": "paragraph",
                "text": "19. අථ ඛො භග්ගව අභිඤ්ඤාතා අභිඤ්ඤාතා ලිච්ඡවී අභිඤ්ඤාතා අභිඤ්ඤාතා ච බ්රාහ්මණමහාසාලා ගහපතිනෙචයිකා නානාතිත්ථියා සමණබ්රාහ්මණා යෙන අචෙලස්ස පාථිකපුත්තස්ස ආරාමො තෙනුපසඞ්කමිංසු. සා එසා භග්ගව පරිසා හොති{3 මහා හොති - මඡසං.} අනෙකසතා අනෙකසහස්සා. අස්සොසි ඛො භග්ගව අචෙලො පාථිකපුත්තො ‘අභික්කන්තා කිර අභිඤ්ඤාතා අභිඤ්ඤාතා ලිච්ඡවී, අභික්කන්තා අභිඤ්ඤාතා අභිඤ්ඤාතා ච බ්රාහ්මණමහාසාලා අභිඤ්ඤාතා අභිඤ්ඤාතා ච බ්රාහ්මණමහාසාලා ගහපතිනෙචයිකා නානාතිත්ථියා සමණබ්රාහ්මණා. සමණො පි ගොතමො මය්හං ආරාමෙ දිවාවිහාරං නිසින්නො’ති. සුත්වානස්ස භයං ඡම්භිතත්තං ලොමහංසො උදපාදි."
            },
            {
                "type": "page-break",
                "text": "28"
            },
            {
                "type": "paragraph",
                "text": "20. අථ ඛො භග්ගව අචෙලො පාථිකපුත්තො භීතො සංවිග්ගො ලොමහට්ඨජාතො යෙන තින්දුකඛාණුපරිබ්බාජකාරාමො{1 තිණ්ඩුකඛාණු - මඡසං.} තෙනුපසඞ්කමි. අස්සොසි ඛො භග්ගව සා පරිසා ‘අචෙලො කිර පාථිකපුත්තො භීතො සංවිග්ගො ලොමහට්ඨජාතො යෙන තින්දුකඛාණුපරිබ්බාජකාරාමො තෙනුපසඞ්කන්තො’ති. අථ ඛො භග්ගව සා පරිසා අඤ්ඤතරං පුරිසං ආමන්තෙසි: එහි ත්වං භො පුරිස, යෙන තින්දුකඛාණුපරිබ්බාජකාරාමො යෙන අචෙලො පාථිකපුත්තො තෙනුපසඞ්කමි, උපසඞ්කමිත්වා අචෙලං පාථිකපුත්තං එවං වදෙහි: අභික්කමාවුසො පාථිකපුත්ත. අභික්කන්තා අභිඤ්ඤාතා අභිඤ්ඤාතා ලිච්ඡවී, අභික්කන්තා අභිඤ්ඤාතා අභිඤ්ඤාතා ච බ්රාහ්මණමහාසාලා ගහපතිනෙචයිකා නානාතිත්ථියා සමණබ්රාහ්මණා, සමණො පි ගොතමො ආයස්මතො ආරාමෙ දිවාවිහාරං නිසින්නො. භාසිතා ඛො පන තෙ එසා ආවුසො පාථිකපුත්ත වෙසාලියං පරිසතිං වාචා: සමණො පි ගොතමො ඤාණවාදො අහම්පි ඤාණවාදො. ඤාණවාදො ඛො පන ඤාණවාදෙන අරහති උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං දස්සෙතුං. සමණො චෙ ගොතමො උපඩ්ඪපථං ආගච්ඡෙය්ය, අහම්පි උපඩ්ඪපථං ගච්ඡෙය්යං. තෙ තත්ථ උභො පි උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරෙය්යාම. එකං චෙ සමණො ගොතමො උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරිස්සති, ද්වාහං කරිස්සාමි. ද්වෙ චෙ සමණො ගොතමො උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියානි කරිස්සති, චත්තාරාහං කරිස්සාමි. චත්තාරි චෙ සමණො ගොතමො උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියානි කරිස්සති, අට්ඨාහං කරිස්සාමි. ඉති යාවතකං සමණො ගොතමො උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරිස්සති, තන්දිගුණං තන්දිගුණාහං කරිස්සාමී”ති. අභික්කමස්සෙව{2 අභික්කමයෙව - PTS.} ඛො ආවුසො පාථිකපුත්ත උපඩ්ඪපථං. සබ්බපඨමං යෙව ආගන්ත්වා සමණො ගොතමො ආයස්මතො ආරාමෙ දිවාවිහාරං නිසින්නො’ති."
            },
            {
                "type": "page-break",
                "text": "30"
            },
            {
                "type": "paragraph",
                "text": "“එවං භො”ති ඛො භග්ගව සො පුරිසො තස්සා පරිසාය පටිස්සුත්වා යෙන තින්දුකඛාණුපරිබ්බාජකාරාමො යෙන අචෙලො පාථිකපුත්තො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා අචෙලං පාථිකපුත්තං එතදවොච: අභික්කමාවුසො පාථිකපුත්ත, අභික්කන්තා අභිඤ්ඤාතා අභිඤ්ඤාතා ලිච්ඡවී අභික්කන්තා අභිඤ්ඤාතා අභිඤ්ඤාතා ච බ්රාහ්මණමහාසාලා ගහපතිනෙචයිකා නානාතිත්ථියා සමණබ්රාහ්මණා. සමණොපි ගොතමො ආයස්මතො ආරාමෙ දිවාවිහාරං නිසින්නො. භාසිතා ඛො පන තෙ එසා ආවුසො පාථිකපුත්ත වෙසාලියං පරිසතිං වාචා: සමණො පි ගොතමො ඤාණවාදො අහම්පි ඤාණවාදො. ඤාණවාදො ඛො පන ඤාණවාදෙන අරහති උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං දස්සෙතුං -පෙ- ඉති යාවතකං සමණො ගොතමො උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරිස්සති තන්දිගුණං තන්දිගුණාහං කරිස්සාමී”ති. අභික්කමස්සෙව ඛො ආවුසො පාථිකපුත්ත උපඩ්ඪපථං. සබ්බපඨමං යෙව ආගන්ත්වා සමණො ගොතමො ආයස්මතො ආරාමෙ දිවාවිහාරං නිසින්නො”ති."
            },
            {
                "type": "paragraph",
                "text": "21. එවං වුත්තෙ භග්ගව අචෙලො පාථිකපුත්තො ‘ආයාමි ආවුසො, ආයාමි ආවුසො’ති වත්වා තත්ථෙව සංසප්පති. න සක්කොති ආසනාපි වුට්ඨාතුං. අථ ඛො භග්ගව සො පුරිසො අචෙලං පාථිකපුත්තං එතදවොච: කිංසු නාම තෙ ආවුසො පාථිකපුත්ත පාවළා{1 පාවුළා - සීමු.} සු නාම තෙ පීඨකස්මිං අල්ලීනා පීඨකං සු නාම තෙ පාවළාසු අල්ලීනං? ‘ආයාමි ආවුසො, ආයාමි ආවුසො’ති වත්වා තත්ථෙව සංසප්පති, න සක්කොසි ආසනා පි වුට්ඨාතුන්ති. එවම්පි ඛො භග්ගව වුච්චමානො අචෙලො පාථිකපුත්තො ‘ආයාමි ආවුසො, ආයාමි ආවුසො’ති වත්වා තත්ථෙව සංසප්පති, න සක්කොති ආසනා පි වුට්ඨාතුං. යදා ඛො සො භග්ගව පුරිසො අඤ්ඤාසි ‘පරාභූතරූපො අයං අචෙලො පාථිකපුත්තො, ‘ආයාමි ආවුසො ආයාමි ආවුසො’ති වත්වා තත්ථෙව සංසප්පති. න සක්කොති ආසනාපි වුට්ඨාතුන්ති. අථ තං පරිසං ආගන්ත්වා එවමාරොචෙසි: පරාභූතරූපො භො අයං අචෙලො පාථිකපුත්තො. ‘ආයාමි ආවුසො, ආයාමි ආවුසො’ති වත්වා තත්ථෙව සංසප්පති, න සක්කොති ආසනාපි වුට්ඨාතුන්ති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ අහං භග්ගව තං පරිසං එතදවොචං: අභබ්බො ඛො ආවුසො අචෙලො පාථිකපුත්තො තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා මම සම්මුඛීභාවං ආගන්තුං. සචෙ පි’ස්ස එවමස්ස ‘අහං තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා සමණස්ස ගොතමස්ස සම්මුඛීභාවං ගච්ඡෙය්යන්ති, මුද්ධා පි තස්ස විපතෙය්යා”ති."
            },
            {
                "type": "centered",
                "text": "පඨමභාණවාරො නිට්ඨිතො.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "32"
            },
            {
                "type": "paragraph",
                "text": "22. අථ ඛො භග්ගව අඤ්ඤතරො ලිච්ඡවි මහාමත්තො උට්ඨායාසනා තං පරිසං එතදවොච: තෙන හි භො මුහුත්තං තාව ආගමෙථ යාවාහං ගච්ඡාමි. අප්පෙවනාම අහම්පි සක්කුණෙය්යං අචෙලං පාථිකපුත්තං ඉමං පරිසං ආනෙතුන්ති. අථ ඛො සො භග්ගව ලිච්ඡවි මහාමත්තො යෙන තින්දුකඛාණුපරිබ්බාජකාරාමො යෙන අචෙලො පාථිකපුත්තො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා අචෙලං පාථිකපුත්තං එතදවොච. අභික්කමාවුසො පාථිකපුත්ත, අභික්කන්තං තෙ සෙෙය්යා, අභික්කන්තා අභිඤ්ඤාතා අභිඤ්ඤාතා ලිච්ඡවී -පෙ- සමණො පි ගොතමො ආයස්මතො ආරාමෙ දිවාවිහාරං නිසින්නො. භාසිතා ඛො පන තෙ එසා ආවුසො පාථිකපුත්ත වෙසාලියං පරිසතිං වාචා ‘සමණො පි ගොතමො ඤාණපාදො -පෙ- තංදිගුණං තංදිගුණාහං කරිස්සාමීති. අභික්කමස්සෙව ඛො ආවුසො පාථිකපුත්ත උපඩ්ඪපථං. සබ්බපඨමඤ්ඤෙව ආගන්ත්වා සමණො ගොතමො ආයස්මතො ආරාමෙ දිවාවිහාරං නිසින්නො. භාසිතා ඛො පනෙසා ආවුසො පාථිකපුත්ත, සමණෙන ගොතමෙන පරිසතිං වාචා: ‘අභබ්බො ඛො අචෙලො පාථිකපුත්තො තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා මම සම්මුඛීභාවං ආගන්තුං. සචෙ පි’ස්ස එවමස්ස අහං තං වාචං අප්පහාය -පෙ- සමණස්ස ගොතමස්ස සම්මුඛීභාවං ගච්ඡෙය්යන්ති, මුද්ධං පි තස්ස විපතෙය්යා’ති. අභික්කමාවුසො පාථිකපුත්ත, අභික්කමනෙනෙව තෙ ජයං කරිස්සාම, සමණස්ස ගොතමස්ස පරාජයන්ති.”"
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ භග්ගව අචෙලො පාථිකපුත්තො ‘ආයාමි ආවුසො ආයාමි ආවුසො’ති වත්වා තත්ථෙව සංසප්පති, න සක්කොති ආසනා පි වුට්ඨාතුං. අථ ඛො භග්ගව ලිච්ඡවී මහාමත්තො අචෙලං පාථිකපුත්තං එතදවොච: කිං සු නාම තෙ ආවුසො පාථිකපුත්ත, පාවළා සු නාම තෙ පීඨකස්මිං අල්ලීනා, පීඨකං සු නාම තෙ පාවළාසු අල්ලීනං? ‘ආයාමි ආවුසො, ආයාමි ආවුසො’ති වත්වා තත්ථෙව සංසප්පසි, න සක්කොසි ආසනා පි වුට්ඨාතුන්ති."
            },
            {
                "type": "paragraph",
                "text": "එවම්පි ඛො භග්ගව වුච්චමානො අචෙලො පාථිකපුත්තො ‘ආයාමි ආවුසො, ආයාමි ආවුසො’ති වත්වා තත්ථෙව සංසප්පති, න සක්කොති ආසනාපි වුට්ඨාතුං. යදා ඛො සො භග්ගව ලිච්ඡවි මහාමත්තො අඤ්ඤාසි පරාභූතරූපො අයං අචෙලො පාථිකපුත්තො, ආයාමි ආවුසො, ආයාමි ආවුසො’ති වත්වා තත්ථෙව සංසප්පති, න සක්කොති ආසනාපි වුට්ඨාතුන්ති. අථ තං පරිසං ආගන්ත්වා එවමාරොචෙසි: පරාභූතරූපො භො අචෙලො පාථිකපුත්තො, ‘ආයාමි ආවුසො ආයාමි ආවුසො’ති වත්වා තත්ථෙව සංසප්පති, න සක්කොති ආසනා පි වුට්ඨාතුන්ති."
            },
            {
                "type": "page-break",
                "text": "34"
            },
            {
                "type": "paragraph",
                "text": "23. එවං වුත්තෙ අහං භග්ගව තං පරිසං එතදවොචං: අභබ්බො ඛො ආවුසො අචෙලො පාථිකපුත්තො තං වාචං අප්පහාය -පෙ- මම සම්මුඛීභාවං ආගන්තුං. සචෙ පි’ස්ස එවමස්ස: අහං තං වාචං අප්පහාය -පෙ- සමණස්ස ගොතමස්ස සම්මුඛීභාවං ගච්ඡෙය්යන්ති මුද්ධා පි තස්ස විපතෙය්ය. සචෙ පායස්මන්තානං ලිච්ඡවීනං එවමස්ස: ‘මයං අචෙලං පාථිකපුත්තං වරත්තාහි බන්ධිත්වා ගොයුගෙහි ආවිඤ්ජෙය්යාමා,ති{1 ආවිඤ්ඤෙය්යාමාති - සීමු.}, තා වරත්තා ඡිජ්ජෙරං පාථිකපුත්තො වා. අභබ්බො අචෙලො පාථිකපුත්තො තං වාචං අප්පහාය -පෙ- සචෙ පි’ස්ස එවමස්ස ‘අහං තං වාචං අප්පහාය -පෙ- සමණස්ස ගොතමස්ස සම්මුඛීභාවං ගච්ඡෙය්යන්ති මුද්ධා පි තස්ස විපතෙය්යා”ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භග්ගව ජාලියො දාරුපත්තිකන්තෙවාසී උට්ඨායාසනා තං පරිසං එතදවොච: තෙන හි භො මුහුත්තං තාව ආගමෙථ යාවාහං ගච්ඡාමි, අප්පෙව නාම අහම්පි සක්කුණෙය්යං අචෙලං පාථිකපුත්තං ඉමං පරිසං ආනෙතුන්ති. අථ ඛො භග්ගව ජාලියො දාරුපත්තිකන්තෙවාසී යෙන තින්දුකඛාණුපරිබ්බාජකාරාමො යෙන අචෙලො පාථිකපුත්තො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා අචෙලං පාථිකපුත්තං එතදවොච: අභික්කමාවුසො පාථිකපුත්ත, අභික්කන්තං තෙ සෙෙය්යා. අභික්කන්තා අභිඤ්ඤාතා අභිඤ්ඤාතා ලිච්ඡවී -පෙ- සමණොපි ගොතමො ආයස්මතො ආරාමෙ දිවාවිහාරං නිසින්නො. භාසිතා ඛො පන තෙ ආවුසො පාථිකපුත්ත වෙසාලියං පරිසතිං වාචා: “සමණො පි ගොතමො ඤාණවාදො -ෙප- තංදිගුණං තංදිගුණාහං කරිස්සාමී”ති. අභික්කමස්සෙව ආවුසො පාථිකපුත්ත උපඩ්ඪපථං. සබ්බපඨමඤ්ඤෙව ආගන්ත්වා සමණො ගොතමො ආයස්මතො ආරාමෙ දිවාවිහාරං නිසින්නො. භාසිතා ඛො පනෙ තෙ එසාවුසො පාථිකපුත්ත සමණෙන ගොතමෙන පරිසතිං වාචා: “අභබ්බො අචෙලො පාථිකපුත්තො තං වාචං අප්පහාය -පෙ- සචෙ පි’ස්ස එවමස්ස “අහං තං වාචං අප්පහාය -පෙ- සමණස්ස ගොතමස්ස සම්මුඛීභාවං ගච්ඡෙය්ය”න්ති, මුද්ධාපි තස්ස විපතෙය්ය. සචෙ’පායස්මන්තානං ලිච්ඡවීනං එවමස්ස: මයං අචෙලං පාථිකපුත්තං වරත්තාහි බන්ධිත්වා ගොයුගෙහි ආවිඤ්ජෙය්යාමාති. තා වරත්තා ඡිජ්ජෙරං පාථිකපුත්තො වා. අභබ්බො පන අචෙලො පාථික පුත්තො තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා මම සම්මුඛීභාවං ආගන්තුං. සචෙ පි’ස්ස එවමස්ස “අහං තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා සමණස්ස ගොතමස්ස සම්මුඛීභාවං ආගච්ඡෙය්යන්ති මුද්ධා පි තස්ස විපතෙය්යා”ති. අභික්කමාවුසො පාථිකපුත්ත, අභික්කමනෙනෙව තෙ ජයං කරිස්සාම, සමණස්ස ගොතමස්ස පරාජයන්ති."
            },
            {
                "type": "page-break",
                "text": "36"
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ භග්ගව අචෙලො පාථිකපුත්තො ‘ආයාමි ආවුසො ආයාමි ආවුසො’ති වත්වා තත්ථෙව සංසප්පති, න සක්කොති ආසනා’පි වුට්ඨාතුං, අථ ඛො භග්ගව ජාලියො දාරුපත්තිකන්තෙවාසී අචෙලං පාථිකපුත්තං එතදවොච: “කිං සු නාම තෙ ආවුසො පාථිකපුත්ත පාවළා සු නාම තෙ පීඨකස්මිං අල්ලීනා, පීඨකං සු නාම තෙ පාවළාසු අල්ලීනං ආයාමි ආවුසො, ආයාමි ආවුසො’ති වත්වා තත්ථෙව සංසප්පසි, න සක්කොසි ආසනා පි වුට්ඨාතුන්ති?”"
            },
            {
                "type": "paragraph",
                "text": "එවම්පි ඛො භග්ගව වුච්චමානො අචෙලො පාථිකපුත්තො ‘ආයාමි ආවුසො, ආයාමි ආවුසො’ති වත්වා තත්ථෙව සංසප්පති, න සක්කොති ආසනාපි වුට්ඨාතුන්ති. යදා ඛො භග්ගව ජාලියො දාරුපත්තිකන්තෙවාසී අඤ්ඤාසි පරාභූතරූපො අයං අචෙලො පාථිකපුත්තො, ‘ආයාමි ආවුසො, ආයාමි ආවුසො’ති වත්වා තත්ථෙව සංසප්පති, න සක්කොති ආසනා පි වුට්ඨාතුන්ති, අථ නං එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "24. “භූතපුබ්බං ආවුසො පාථිකපුත්ත සීහස්ස මිගරඤ්ඤො එතදහොසි: යන්නූනාහං අඤ්ඤතරං වනසණ්ඩං නිස්සාය ආසයං කප්පෙය්යං, තත්රාසයං කප්පෙත්වා සායණ්හසමයං ආසයා නික්ඛමෙය්යං, ආසයා නික්ඛමිත්වා විජම්භෙය්යං, විජම්භිත්වා සමන්තා චතුද්දිසා අනුවිලොකෙය්යං, සමන්තා චතුද්දිසා අනුවිලොකෙත්වා තික්ඛත්තුං සීහනාදං නදෙය්යං, තික්ඛත්තුං සීහනාදං නදිත්වා ගොචරාය පක්කමෙය්යං, සො වරං වරං විගසඞ්ඝෙ{1 මිගසඞ්ගා - සීමු. ස්යා. කම්.} වධිත්වා මුදුමංසානි මුදුමංසානි භක්ඛයිත්වා තමෙව ආසයං අජ්ඣුපෙය්යන්ති. අථ ඛො සො සීහො මිගරාජා අඤ්ඤතරං වනසණ්ඩං නිස්සාය ආසයං කප්පෙසි. තත්රාසයං කප්පෙත්වා සායණ්හසමයං ආසයා නික්ඛමි. ආසයා නික්ඛමිත්වා විජම්භි. විජම්භිත්වා සමන්තා චතුද්දිසා අනුවිලොකෙසි. සමන්තා චතුද්දිසා අනුවිලොකෙත්වා තික්ඛත්තුං සීහනාදං නදි. තික්ඛත්තුං සීහනාදං නදිත්වා ගොචරාය පක්කමි. සො වරං වරං මිගසඞ්ඝෙ වධිත්වා මුදුමංසානි මුදුමංසානි භක්ඛයිත්වා තමෙව ආසයං අජ්ඣුපෙසි."
            },
            {
                "type": "page-break",
                "text": "38"
            },
            {
                "type": "paragraph",
                "text": "තස්සෙව ඛො ආවුසො පාථිකපුත්ත සීහස්ස මිගරඤ්ඤො විඝාෙසසංවද්ධො ජරසිඟාලො{1 ජරසිඞ්ගාලො - මඡසං.} දිත්තො චෙව බලවා ච. අථ ඛො ආවුසො තස්ස ජරසිඟාලස්ස එතදහොසි “කො චාහං කො සීහො මිගරාජා? යන්නූනාහම්පි අඤ්ඤතරං වනසණ්ඩං නිස්සාය ආසයං කප්පෙය්යං, තත්රාසයං කප්පෙත්වා සායණ්හසමයං ආසයා නික්ඛමෙය්යං, ආසයා නික්ඛමිත්වා විජම්භෙය්යං, විජම්භිත්වා සමන්තා චතුද්දිසා අනුවිලොකෙය්යං, සමන්තා චතුද්දිසා අනුවිලොකෙත්වා තික්ඛත්තුං සීහනාදං නදෙය්යං, තික්ඛත්තුං සීහනාදං නදිත්වා ගොචරාස පක්කමෙය්යං. සො වරං වරං මිගසංඝෙ වධිත්වා මුදුමංසානි මුදුමංසානි භක්ඛයිත්වා තමෙව ආසයං අජ්ඣුපෙය්යන්ති.” අථ ඛො සො ආවුසො ජරසිඟාලො අඤ්ඤතරං වනසණ්ඩං නිස්සාය ආසයං කප්පෙසි. තත්රාසයං කප්පෙත්වා සායණ්හසමයං ආසයා නික්ඛමි."
            },
            {
                "type": "paragraph",
                "text": "ආසයා නික්ඛමිත්වා විජම්භි. විජම්භිත්වා සමන්තා චතුද්දිසා අනුවිලොකෙසි. සමන්තා චතුද්දිසා අනුවිලොකෙත්වා තික්ඛත්තුං සීහනාදං නදිස්සාමී ති සෙඟාලකං යෙව අනදි, භෙරණ්ඩකං{2 භෙදණ්ඩකං යෙව - (කම්)} යෙව අනදි. කො ච ඡචො සෙඟාලකො කො පන සීහනාදො!{3 කෙ ච ජචෙ සිංගාලෙ කෙ පන සීහනාදෙහි - මඡසං.}"
            },
            {
                "type": "paragraph",
                "text": "“එවමෙව ඛො ත්වං ආවුසො පාථිකපුත්ත සුගතාපදානෙසු ජීවමානො සුගතාතිරිත්තානි භුඤ්ජමානො තථාගතෙ අරහන්තෙ සම්මාසම්බුද්ධෙ ආසාදෙතබ්බං මඤ්ඤසි. කො ච ඡචො පාථිකපුත්තො{4 කෙ ච ඡචෙ පාථිකපුත්තෙ - මඡසං.} කා ච තථාගතානං අරහන්තානං සම්මාසම්බුද්ධානං ආසාදනා!”ති."
            },
            {
                "type": "paragraph",
                "text": "25. යතො ඛො භග්ගව ජාලියො දාරුපත්තිකන්තෙවාසී ඉමිනා ඔපම්මෙන නෙව අසක්ඛි අචෙලං පාථිකපුත්තං තම්හා ආසනා චාවෙතුං, අථ නං එතදවොච."
            },
            {
                "type": "page-break",
                "text": "40"
            },
            {
                "type": "gatha",
                "text": "සීහො’ති අත්තානං සමෙක්ඛියාන\nඅමඤ්ඤි කොත්ථු මිගරාජා, හමස්මි,\nතථෙව සො සෙගාලකං{1 සිගාලකං - මඡසං.} අනදි\nකො ච ඡචො සෙගාලො{2 සෙගාලො - මඡසං. සීමු.} කො පන සීහනාදො!ති."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො ත්වං ආවුසො පාථිකපුත්ත සුගතාපදානෙසු ජීවමානො සුගතාතිරිත්තානි භුඤ්ජමානො තථාගතෙ අරහන්තෙ සම්මාසම්බුද්ධෙ ආසාදෙතබ්බං මඤ්ඤසි. කො ච ඡවො පාටිකපුත්තො කා ච තථාගතානං අරහන්තානං සම්මාසම්බුද්ධානං ආසාදනා!ති."
            },
            {
                "type": "paragraph",
                "text": "26. යතො ඛො භග්ගව ජාලියො දාරුපත්තිකන්තෙවාසී ඉමිනාපි ඔපම්මෙන නෙව අසක්ඛි අචෙලං පාථිකපුත්තං තම්හා ආසනා චාවෙතුං. අථ නං එතදවොච:"
            },
            {
                "type": "gatha",
                "text": "අමඤ්ඤී අනුචඞ්කමනං\nඅත්තානං විඝාසෙ සමෙක්ඛිය\nයාවත්තානං න පස්සති\nකොත්ථු තාව බ්යග්ඝො ති මඤ්ඤති\nතථෙව සො සෙගාලකං{3 සිගාලකං - මඡසං.} අනදි\nකො ච ඡවො සෙගාලො{4 සෙගාලො - මඡසං. සීමු.} කො පන සීහනාදො!ති."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො ත්වං ආවුසො පාථිකපුත්ත සුගතාපදානෙසු ජීවමානො සුගතාතිරිත්තානි භුඤ්ජමානො තථාගතෙ අරහන්තෙ සම්මාසම්බුද්ධෙ ආසාදෙතබ්බං මඤ්ඤසි. කො ච ඡවො පාථිකපුත්තො කා ච තථාගතානං අරහන්තානං සම්මාසම්බුද්ධානං ආසාදනා!ති."
            },
            {
                "type": "paragraph",
                "text": "27. යතො ඛො භග්ගව ජාලීයො දාරුපත්තිකන්තෙවාසී ඉමිනාපි ඔපම්මෙන නෙව අසක්ඛි අචෙලං පාථිකපුත්තං තම්හා ආසනා චාවෙතුං, අථ නං එතදවොච:"
            },
            {
                "type": "gatha",
                "text": "භුත්වාන භෙකෙ{5 භිඞ්ගෙ - (කම්.)} ඛලමූසිකායො\nකටසීසු ඛිත්තානි ච කොණපානි,{6 කුණපානි - ස්යා.} \nමහාවනෙ සුඤ්ඤවනෙ විවඩ්ඪො\nඅමඤ්ඤි කොත්ථු මිගරාජාහමස්මි.\nතථෙව සො සෙගාලකං අනදි\nකො ච ඡවො සෙගාලො කො පන සීහනාදො!ති."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො ත්වං ආවුසො පාථිකපුත්ත සුගතාපදානෙසු ජීවමානො සුගතාතිරිත්තානි භුඤ්ජමානො තථාගතෙ අරහන්තෙ සම්මාසම්බුද්ධෙ ආසාදෙතබ්බං මඤ්ඤසි. කො ච ඡවො පාථිකපුත්තො, කා ච තථාගතානං අරහන්තානං සම්මාසම්බුද්ධානං ආසාදනා!ති."
            },
            {
                "type": "page-break",
                "text": "42"
            },
            {
                "type": "paragraph",
                "text": "යතො ඛො භග්ගව ජාලියො දාරුපත්තිකන්තෙවාසී ඉමිනා පි ඔපම්මෙන නෙව අසක්ඛි අචෙලං පාථිකපුත්තං තම්හා ආසනා චාවෙතුං. අථ තං පරිසං ආගන්ත්වා එවමාරොචෙසි: “පරාභූතරූපො භො අචෙලො පාථිකපුත්තො, ‘ආයාමි ආවුසො, ආයාමි ආවුසො’ති වත්වා තත්ථෙව සංසප්පති, න සක්කොති ආසනාපි වුට්ඨාතුන්ති. එවං වුත්තෙ අහං භග්ගව තං පරිසං එතදවොචං:"
            },
            {
                "type": "paragraph",
                "text": "“අභබ්බො ඛො ආවුසො අචෙලො පාථිකපුත්තො තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා මම සම්මුඛීභාවං ආගන්තුං. සචෙ පි’ස්ස එවමස්ස: අහං තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා සමණස්ස ගොතමස්ස සම්මුඛීභාවං ගච්ඡෙය්යන්ති, මුද්ධා පි තස්ස විපතෙය්ය. සචෙ’ පායස්මන්තානං ලිච්ඡවීනං එවමස්ස “මයං අචෙලං පාථිකපුත්තං වරත්තාහි බන්ධිත්වා ගොයුගෙහි ආවිඤ්ඡෙය්යාමාති, තා වරත්තා ඡිජ්ජෙරං පාථිකපුත්තො වා. අභබ්බො පන අචෙලො පාථිකපුත්තො තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා මම සම්මුඛීභාවං ආගන්තුං. සචෙ’පි’ස්ස එවමස්ස ‘අහං තං වාචං අප්පහාය තං චිත්තං අප්පහාය තං දිට්ඨිං අප්පටිනිස්සජ්ජිත්වා සමණස්ස ගොතමස්ස සම්මුඛීභාවං ගච්ඡෙය්යන්ති මුද්ධා පි තස්ස විපතෙය්යා”ති."
            },
            {
                "type": "paragraph",
                "text": "28. අථ ඛ්වාහං භග්ගව තං පරිසං ධම්මියා කථාය සන්දස්සෙසිං සමාදපෙසිං සමුත්තෙජෙසිං සම්පහංසෙසිං. තං පරිසං ධම්මියා කථාය සන්දස්සෙත්වා සමාදපෙත්වා සමුත්තෙජෙත්වා සම්පහංසෙත්වා මහාබන්ධනා මොක්ඛං කරිත්වා, චතුරාසීතිපාණසහස්සානි මහාවිදුග්ගා උද්ධරිත්වා, තෙජොධාතුං සමාපජ්ජිත්වා සත්තතාලං වෙහාසං අබ්භුග්ගන්ත්වා අඤ්ඤං සත්තතාලම්පි අච්චිං{1 අග්ගී - (ස්යා.)} අභිනිම්මිනිත්වා පජ්ජලිත්වා ධූමායිත්වා{2 ධුමායිත්වා - (මඡසං.)} මහාවනෙ කූටාගාරසාලායං පච්චුට්ඨාසිං. අථ ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො යෙනාහං තෙනුපසඞ්කමි, උපසඞ්කමිත්වා මං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො අහං භග්ගව සුනක්ඛත්තං ලිච්ඡවිපුත්තං එතදවොචං: තං කිම්මඤ්ඤසි සුනක්ඛත්ත, යථෙව තෙ අහං අචෙලං පාථිකපුත්තං ආරබ්භ බ්යාකාසිං, තථෙව තං විපක්කං අඤ්ඤථා වා?ති. “යථෙව මෙ භන්තෙ භගවා අචෙලං පාථිකපුත්තං ආරබ්භ බ්යාකාසි, තථෙව තං විපක්කං නො අඤ්ඤථා”ති."
            },
            {
                "type": "page-break",
                "text": "44"
            },
            {
                "type": "paragraph",
                "text": "“තං කිම්මඤ්ඤසි සුනක්ඛත්ත, යදි එවං සන්තෙ කතං වා හොති උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං අකතං වා?”ති."
            },
            {
                "type": "paragraph",
                "text": "“අද්ධා ඛො පන භන්තෙ එවං සන්තෙ කතං හොති උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං නො අකතන්ති.”"
            },
            {
                "type": "paragraph",
                "text": "“එවම්පි ඛො මං ත්වං මොඝපුරිස උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරොන්තං එවං වදෙසි: න හි පන මෙ භන්තෙ භගවා උත්තරිමනුස්සධම්මා ඉද්ධිපාටිහාරියං කරොතී ති. පස්ස මොඝපුරිස තඤ්ච තෙ ඉදං අපරද්ධන්ති.”"
            },
            {
                "type": "paragraph",
                "text": "එවම්පි ඛො භග්ගව සුනක්ඛත්තො ලිච්ඡවිපුත්තො මයා වුච්චමානො අපක්කමෙව ඉමස්මා ධම්මවිනයා යථා තං ආපාධිකො නෙරයිකො."
            },
            {
                "type": "centered",
                "text": "අග්ගඤ්ඤපඤ්ඤත්තිකථා",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "29. අග්ගඤ්ඤඤ්චාහං භග්ගව පජානාමි, තඤ්ච පජානාමි තතෙං ච උත්තරිතරං පජානාමි, තඤ්ච පජානනංන පරාමසාමි, අපරාමසතො ච මෙ පච්චත්තඤ්ඤෙව නිබ්බුති විදිතා, යදභිජානං තථාගතො නො අනයං ආපජ්ජති."
            },
            {
                "type": "paragraph",
                "text": "සන්ති භග්ගව එකෙ සමණබ්රාහ්මණා ඉස්සරකුත්තං බ්රහ්මකුත්තං ආචරියකං අග්ගඤ්ඤං පඤ්ඤාපෙන්ති. ත්යාහං උපසඞ්කමිත්වා එවං වදාමි: සච්චං කිර තුම්හෙ ආයස්මන්තො ඉස්සරකුත්තං බ්රහ්මකුත්තං ආචරියකං අග්ගඤ්ඤං පඤ්ඤපෙථා?”ති. තෙ ච මෙ එවං පුට්ඨා ‘ආමො’ති{1 ආමාති - ස්යා.} පටිජානන්ති. ත්යාහං එවං වදාමි: කථංවිහිතකං පන{2 කථං විහිකතං නො පන - (කම්.)} තුම්හෙ ආයස්මන්තො ඉස්සරකුත්තං බ්රහ්මකුත්තං ආචරියකං අග්ගඤ්ඤං පඤ්ඤපෙථා”ති. තෙ මයා පුට්ඨා න සම්පායන්ති. අසම්පායන්තා මමඤ්ඤෙව පටිපුච්ඡන්ති. තෙසාහං පුට්ඨො බ්යාකරොමි:"
            },
            {
                "type": "page-break",
                "text": "46"
            },
            {
                "type": "paragraph",
                "text": "30. හොති ඛො සො ආවුසො සමයො යං කදාචි කරහචි දීඝස්ස අද්ධුනො අච්චයෙන අයං ලොකො සංවට්ටති. සංවට්ටමානෙ ලොකෙ යෙභුෙය්යන සත්තා ආභස්සරසංවත්තනිකා හොන්ති. තෙ තත්ථ හොන්ති මනොමයා පීතිභක්ඛා සයම්පභා අන්තලික්ඛචරා සුභට්ඨායිනො, චිරං දීඝමද්ධානං තිට්ඨන්ති. හොති ඛො සො ආවුසො සමයො යං කදාචි කරහචි දීඝස්ස අද්ධුනො අච්චයෙන අයං ලොකො විවට්ටති. විවට්ටමානෙ ලොකෙ සුඤ්ඤං බ්රහ්මවිමානං පාතුභවති. අථ ඛො අඤ්ඤතරො{1 අථ අඤ්ඤතරො - ස්යා. PTS.} සත්තො ආයුක්ඛයා වා පුඤ්ඤක්ඛයා වා ආභස්සරකායා චවිත්වා සුඤ්ඤං බ්රහ්මවිමානං උපපජ්ජති. සො තත්ථ හොති මනොමයො පීතිභක්ඛො සයම්පභො අන්තලික්ඛචරො සුභට්ඨායී, චිරං දීඝමද්ධානං තිට්ඨති. තස්ස තත්ථ එකකස්ස දීඝරත්තං නිවුසිතත්තා අනභිරති පරිතස්සනා උප්පජ්ජති: “අහො වත අඤ්ඤෙ පි සත්තා ඉත්ථත්තං ආගච්ඡෙය්යුන්ති”. අථ අඤ්ඤතරෙ පි සත්තා ආයුක්ඛයා වා පුඤ්ඤක්ඛයා වා ආභස්සරකායා චවිත්වා සුඤ්ඤං බ්රහ්මවිමානං උපපජ්ජන්ති තස්ස සත්තස්ස සහබ්යතං. තෙ පි තත්ථ හොන්ති මනොමයා පීතිභක්ඛා සයම්පභා අන්තලික්ඛචරා සුභට්ඨායිනො චිරං දීඝමද්ධානං තිට්ඨන්ති. තත්රාවුසො යො සො සත්තො පඨමං උපපන්නො, තස්ස එවං හොති: අහමස්මි බ්රහ්මා මහාබ්රහ්මා අභිභූ අනභිභූතො අඤ්ඤදත්ථුදසො වසවත්තී ඉස්සරො කත්තා නිම්මාතා සට්ඨා{2 සෙට්ඨො - (සබ්බත්ව.)} සජිතා{3 සඤ්ජිතා - PTS. සජ්ජිතා - (ස්යා. කම්.)} වසී පිතා භූතභව්යානං. මයා ඉමෙ සත්තා නිම්මිතා. තං කිස්ස හෙතු? මමඤ්හි පුබ්බෙ එතදහොසි: “අහො වත අඤ්ඤෙපි සත්තා ඉත්ථත්තං ආගච්ඡෙය්යුන්ති. ඉති මමඤ්ච මනොපණිධි. ඉමෙ ච සත්තා ඉත්ථත්තං ආගතා”ති."
            },
            {
                "type": "page-break",
                "text": "48"
            },
            {
                "type": "paragraph",
                "text": "යෙ පි තෙ සත්තා පච්ඡා උපපන්නා, තෙසම්පි එවං හොති; අයං ඛො භවං බ්රහ්මා මහාබ්රහ්මා අභිභූ අනභිභූතො අඤ්ඤදත්ථුදසො වසවත්තී ඉස්සරො කත්තා නිම්මාතා සට්ඨා සජිතා වසී පිතා භූතභව්යානං. ඉමිනා මයං භොතා බ්රහ්මුනා නිම්මිතා. තං කිස්ස හෙතු? ඉමඤ්හි මයං අද්දසාම ඉධ පඨමං උපපන්නං, මයං පනම්හා පච්ඡා උපපන්නා’ති. තත්රාවුසො යො සො සත්තො පඨමං උපපන්නො, සො දීඝායුකතරො ච හොති වණ්ණවන්තතරො ච මහෙසක්ඛතරො ච. යෙ පන තෙ සත්තා පච්ඡා උපපන්නා, තෙ අප්පායුකතරා ච හොන්ති දුබ්බණ්ණතරා ච අප්පෙසක්ඛතරා ච. ඨානං ඛො පනෙතං ආවුසො විජ්ජති යං අඤ්ඤතරො සත්තො තම්හා කායා චවිත්වා ඉත්ථත්තං ආගච්ඡති. ඉත්ථත්තං ආගතො සමානො අගාරස්මා අනගාරියං පබ්බජති. අගාරස්මා අනගාරියං පබ්බජිතො සමානො ආතප්පමන්වාය පධානමන්වාය අනුයොගමන්වාය අප්පමාදමන්වාය සම්මාමනසිකාරමන්වාය තථාරූපං චෙතොසමාධිං ඵුසති, යථා සමාහිතෙ චිත්තෙ තං පුබ්බෙනිවාසං අනුස්සරති, තතො පරං නානුස්සරතී ති. සො එවමාහ: යො ඛො සො භවං බ්රහ්මා මහාබ්රහ්මා අභිභූ අනභිභූතො අඤ්ඤදත්ථුදසො වසවත්තී ඉස්සරො කත්තා නිම්මාතා සට්ඨා සජිතා වසී පිතා භූතභව්යානං, යෙන මයං භොතා බ්රහ්මුනා නිම්මිතා. සො නිච්චො ධුවො සස්සතො{1 සස්සතො දීඝායුකො - (ස්යා. කම්.)} අවිපරිණාමධම්මො සස්සතිසමං තථෙව ඨස්සති. යෙ පන මයං අහුම්හා තෙන භොතා බ්රහ්මුනා නිම්මිතා, තෙ මයං අනිච්චා අද්ධුවා{2 අද්ධුවා අසස්සතා - (ස්යා. කම්.)} අප්පායුකා චවනධම්මා ඉත්ථත්තං ආගතා ති. එවංවිහිතකං නො තුම්හෙ ආයස්මන්තො ඉස්සරකුත්තං බ්රහ්මකුත්තං ආචරියකං අග්ගඤ්ඤං පඤ්ඤාපෙථා”ති. තෙ එවමාහංසු: “එවං ඛො නො ආවුසො ගොතම සුතං යථෙවායස්මා ගොතමො ආහා”ති. අග්ගඤ්ඤඤ්චාහං භග්ගව පජානාමි -පෙ- යදභිජානං තථාගතො නො අනයං ආපජ්ජති."
            },
            {
                "type": "page-break",
                "text": "50"
            },
            {
                "type": "paragraph",
                "text": "31. සන්ති භග්ගව එකෙ සමණබ්රාහ්මණා ඛිඩ්ඩාපදොසිකං ආචරියකං අග්ගඤ්ඤං පඤ්ඤාපෙන්ති. ත්යාහං උපසඞ්කමිත්වා එවං වදාමි: සච්චං කිර තුම්හෙ ආයස්මන්තො ඛිඩ්ඩාපදොසිකං ආචරියකං අග්ගඤ්ඤං පඤ්ඤාපෙථා?ති”. තෙ ච මෙ එවං පුට්ඨා ‘ආමො’ති පටිජානන්ති. ත්යාහං එවං වදාමි: කථංවිහිතකං පන තුම්හෙ ආයස්මන්තො ඛිඩ්ඩාපදොසිකං ආචරියකං අග්ගඤ්ඤං පඤ්ඤාපෙථා?ති. තෙ මයා පුට්ඨා න සම්පායන්ති. අසම්පායන්තා මමඤ්ඤෙව පටිපුච්ඡන්ති. තෙසාහං පුට්ඨො බ්යාකරොමි: සන්තාවුසො ඛිඩ්ඩාපදොසිකා නාම දෙ වා. තෙ අතිවෙලං හස්සඛිඩ්ඩාරතිධම්මසමාපන්නා විහරන්ති තෙසං අතිවෙලං හස්සඛිඩ්ඩාරතිධම්මසමාපන්නානං{1 හාසඛිඩ්ඩාරති ධම්මසමාපන්නා -(කම්.)} විහරතං සති සම්මුස්සති. සතියා සම්මොසා{2 සතියා සම්මොසාය - (ස්යා.)} තෙ දෙවා තම්හා කායා චවන්ති. ඨානං ඛො පනෙතං ආවුසො විජ්ජති, යං අඤ්ඤතරො සත්තො තම්හා කායා චවිත්වා ඉත්ථත්තං ආගච්ඡති. ඉත්ථත්තං ආගතො සමානො අගාරස්මා අනගාරියං පබ්බජති. අගාරස්මා අනගාරියං පබ්බජිතො සමානො ආතප්පමන්වාය පධානමන්වාය අනුයොගමන්වාය අප්පමාදමන්වාය සම්මාමනසිකාරමන්වාය තථාරූපං චෙතොසමාධිං ඵුසති යථා සමාහිතෙ චිත්තෙ තං පුබ්බෙනිවාසං අනුස්සරති තතොපරං නානුස්සරතී ති. සො එවමාහ: යෙ ඛො තෙ භොන්තො දෙවා න, ඛිඩ්ඩාපදොසිකා තෙ න අතිවෙලං හස්සඛිඩ්ඩාරතිධම්මසමාපන්නා විහරන්ති. තෙසං න අතිවෙලං හස්සඛිඩ්ඩාරතිධම්මසමාපන්නානං විහරතං සති න සම්මුස්සති. සතියා අසම්මොසා තෙ දෙ වා තම්හා කායා න චවන්ති, නිච්චා ධුවා සස්සතා අවිපරිණාමධම්මා සස්සතිසමං තථෙව ඨස්සන්ති. යෙ පන මයං අහුම්හා ඛිඩ්ඩාපදොසිකා තෙ මයං අතිවෙලං හස්සඛිඩ්ඩාරතිධම්මසමාපන්නා විහරිම්හා. තෙසං නො අතිවෙලං හස්සඛිඩ්ඩාරතිධම්මසමාපන්නානං විහරතං සති සම්මුස්සි. සතියා සම්මොසා එවං{3 හාසබිඩ්ඩාරති ධම්මසමාපන්නා - (කම්.)} මයං තම්හා කායා චුතා අනිච්චා අද්ධුවා අප්පායුකා චවනධම්ම ඉත්ථත්තං ආගතා”ති."
            },
            {
                "type": "page-break",
                "text": "52"
            },
            {
                "type": "paragraph",
                "text": "එවංවිහිතකං නො තුම්හෙ ආයස්මන්තො ඛිඩ්ඩාපදොසිකං ආචරියකං අග්ගඤ්ඤං පඤ්ඤපෙථා?ති. තෙ එවමාහංසු: එවං ඛො නො ආවුසො ගොතම සුතං යථෙවායස්මා ගොතමො ආහා ති. අග්ගඤ්ඤඤ්චාහං භග්ගව පජානාමි -පෙ- යදභිජානං තථාගතො නො අනයං ආපජ්ජති."
            },
            {
                "type": "paragraph",
                "text": "32. සන්ති භග්ගව එකෙ සමණබ්රාහ්මණා මනොපදොසිකං ආචරියකං අග්ගඤ්ඤං පඤ්ඤපෙන්ති. ත්යාහං උපසඞ්කමිත්වා එවං වදාමි: සච්චං කිර තුම්හෙ ආයස්මන්තො මනොපදොසිකං ආචරියකං අග්ගඤ්ඤං පඤ්ඤපෙථා?ති. තෙ ච මෙ එවං පුට්ඨා ‘ආමො’ති පටිජානන්ති. ත්යාහං එවං වදාමි: කථංවිහිතකං නො පන තුම්හෙ ආයස්මන්තො මනොපදොසිකං ආචරියකං අග්ගඤ්ඤංපඤ්ඤපෙථා?ති. තෙ මයා පුට්ඨා න සම්පායන්ති. අසම්පායන්තා මමඤ්ඤෙව පටිපුච්ඡන්ති. තෙසාහං පුට්ඨො බ්යාකරොමි: සන්තාවුසො මනොපදොසිකා නාම දෙවා. තෙ අතිවෙලං අඤ්ඤමඤ්ඤං උපනිජ්ඣායන්ති. තෙ අතිවෙලං අඤ්ඤමඤ්ඤං උපනිජ්ඣායන්තා අඤ්ඤමඤ්ඤම්හි චිත්තානි පදූසෙන්ති. අඤ්ඤමඤ්ඤං පදුට්ඨචිත්තා කිලන්තකායා කිලන්තචිත්තා තෙ දෙවා තම්හා කායා චවන්ති. ඨානං ඛො පනෙතං ආවුසො විජ්ජති යං අඤ්ඤතරො සත්තො තම්හා කායා චවිත්වා ඉත්ථත්තං ආගච්ඡති. ඉත්ථත්තං ආගතො සමානො අගාරස්මා අනගාරියං පබ්බජති. අගාරස්මා අනගාරියං පබ්බජිතො සමානො ආතප්පමන්වාය -පෙ- තථාරූපං චෙතොසමාධිං ඵුසති, යථා සමාහිතෙ චිත්තෙ තං පුබ්බෙනිවාසං අනුස්සරති, තතො පරං නානුස්සරතීති. සො එවමාහ: “යෙ ඛො තෙ භොන්තො දෙවා න මනොපදොසිකා තෙ නාතිවෙලං අඤ්ඤමඤ්ඤං උපනිජ්ඣායන්ති. තෙ නාතිවෙලං අඤ්ඤමඤ්ඤං උපනිජ්ඣායන්තා අඤ්ඤමඤ්ඤම්හි චිත්තානි නප්පදූසෙන්ති. අඤ්ඤමඤ්ඤම්හි{1 අඤ්ඤමඤ්ඤං - සීමු.} අප්පදුට්ඨචිත්තා අකිලන්තකායා අකිලන්තචිත්තා{2 අකිලන්තචිත්තා තම්හා - මඡසං.} තෙ දෙවා තම්හා කායා න චවන්ති නිච්චා ධුවා සස්සතා අවිපරිණාමධම්මා සස්සතිසමං තථෙව ඨස්සන්ති. යෙ පන මයං අහුම්හා මනොපදොසිකා තෙ මයං අතිවෙලං අඤ්ඤමඤ්ඤං උපනිජ්ඣායිම්හා."
            },
            {
                "type": "page-break",
                "text": "54"
            },
            {
                "type": "paragraph",
                "text": "තෙ මයං අතිවෙලං අඤ්ඤමඤ්ඤං උපනිජ්ඣායන්තා අඤ්ඤමඤ්ඤම්හි චිත්තානි පදූසයිම්හා, තෙ මයං අඤ්ඤමඤ්ඤම්හි පදුට්ඨචිත්තා කිලන්තකායා කිලන්තචිත්තා. එවං මයං{1 පදොසියිම්හා : ස්යා.} තම්හා කායා චුතා අනිච්චා අද්ධුවා අසස්සතා අප්පායුකා චවනධම්මා ඉත්ථත්තං ආගතා”ති. එවංවිහිතකං නො තුම්හෙ ආයස්මන්තො මනොපදොසිකං ආචරියකං අග්ගඤ්ඤං පඤ්ඤපෙථා?”ති. තෙ එවමාහංසු: “එවං ඛො නො ආවුසො ගොතම සුතං යථෙවායස්මා ගොතමො ආහා”ති."
            },
            {
                "type": "paragraph",
                "text": "අග්ගඤ්ඤඤ්චාහං භග්ගව පජානාමි තඤ්ච පජානාමි -පෙ- යදභිජානං තථාගතො නො අනයං ආපජ්ජති."
            },
            {
                "type": "paragraph",
                "text": "33. සන්ති භග්ගව එකෙ සමණබ්රාහ්මණා අධිච්චසමුප්පන්නං ආචරියකං අග්ගඤ්ඤං පඤ්ඤපෙන්ති. ත්යාහං උපසඞ්කමිත්වා එවං වදාමි: සච්චං කිර තුම්හෙ ආයස්මන්තො අධිච්චසමුප්පන්නං ආචරියකං අග්ගඤ්ඤං පඤ්ඤපෙථා?ති. තෙ ච මෙ එවං පුට්ඨා ‘ආමො’ති පටිජානන්ති. ත්යාහං එවං වදාමි: කථංවිහිතකං නො පන තුම්හෙ ආයස්මන්තො අධිච්චසමුප්පන්නං ආචරියකං අග්ගඤ්ඤං පඤ්ඤපෙථා?ති. තෙ ච මයා පුට්ඨා න සම්පායන්ති. අසම්පායන්තා මමඤ්ඤෙව පටිපුච්ඡන්ති. තෙසාහං පුට්ඨො බ්යාකරොමි: “සන්තාවුසො සඤ්ඤසත්තා නාම දෙවා. සඤ්ඤුප්පාදා ච පන තෙ දෙවා තම්හා කාය චවන්ති. ඨානං ඛො පනෙතං ආවුසො විජ්ජති, යං අඤ්ඤතරො සත්තො තම්හා කායා චවිත්වා ඉත්ථත්තං ආගච්ඡති. ඉත්ථත්තං ආගතො සමානො අගාරස්මා අනගාරියං පබ්බජති. අගාරස්මා අනගාරියං පබ්බජිතො සමානො ආතප්පමන්වාය පධානමන්වාය -පෙ- තථාරූපං චෙතොසමාධිං ඵුසති යථා සමාහිතෙ චිත්තෙ තං සඤ්ඤුප්පාදං අනුස්සරති, තතො පරං නානුස්සරතී ති. සො එවමාහ: අධිච්චසමුප්පන්නො අත්තා ච ලොකො ච. තං කිස්ස හෙතු? අහං පුබ්බෙ නාහොසිං, සො’ම්හි එතරහි අහුත්වා සන්තතාය{2 සත්තතාය - PTS.} පරිණතො”ති. එවංවිහිතකං නො පන තුම්හෙ ආයස්මන්තො අධිච්චසමුප්පන්නං ආචරියකං අග්ගඤ්ඤං පඤ්ඤපෙථා”ති. තෙ එවමාහංසු: “එවං ඛො නො ආවුසො ගොතම සුතං යථෙවායස්මා ගොතමො ආහා”ති. අග්ගඤ්ඤඤ්චාහං භග්ගව පජානාමි, තඤ්ච පජානාමි, තතො ච උත්තරිතරං පජානාමි, තඤ්ච පජානනං න පරාමසාමි, අපරාමසතො ච මෙ පච්චත්තඤ්ඤෙව නිබ්බුති විදිතා. යදභිජානං තථාගතො නො අනයං ආපජ්ජති."
            },
            {
                "type": "page-break",
                "text": "56"
            },
            {
                "type": "paragraph",
                "text": "34. එවංවාදිං ඛො මං භග්ගව එවමක්ඛායිං එකෙ සමණබ්රාහ්මණා අසතා තුච්ඡා මුසා අභූතෙන අබ්භාචික්ඛන්ති: “විපරීතො සමණො ගොතමො භික්ඛවො ච. සමණො ගොතමො එවමාහ: යස්මිං සමයෙ සුභං විමොක්ඛං උපසම්පජ්ජ විහරති සබ්බං තස්මිං සමයෙ අසුභන්ත්වෙව{1 අසුභන්තෙව - ස්යා. PTS.} පජානාතී ති. න ඛො පනාහං භග්ගව එවං වදාමි: යස්මිං සමයෙ සුභං විමොක්ඛං උපසම්පජ්ජ විහරති. සබ්බං තස්මිං සමයෙ අසුභන්තෙව පජානාතීති.{2 සඤ්ජානාතීති - PTS.} එවං ච ඛ්වාහං භග්ගව වදාමි: යස්මිං සමයෙ සුභං විමොක්ඛං උපසම්පජ්ජ විහරති, සුභන්ත්වෙව තස්මිං සමයෙ පජානාතී’ති."
            },
            {
                "type": "paragraph",
                "text": "“තෙ’ච භන්තෙ, විපරීතා යෙ භගවන්තං විපරීතතො දහන්ති භික්ඛවො ච. එවං පසන්නො අහං භන්තෙ භගවති, පහොති ච මෙ භගවා තථා ධම්මං දෙසෙතුං යථා අහං සුභං විමොක්ඛං උපසම්පජ්ජ විහරෙය්යන්ති.”"
            },
            {
                "type": "paragraph",
                "text": "“දුක්කරං ඛො එවං භග්ගව තයා අඤ්ඤදිට්ඨිකෙන අඤ්ඤඛන්තිකෙන අඤ්ඤරුචිකෙන අඤ්ඤත්රායොගෙන අඤ්ඤත්රාචරියකෙන සුභං විමොක්ඛං උපසම්පජ්ජ විහරිතුං. ඉඞ්ඝ ත්වං භග්ගව, යො ච තෙ අයං මයි පසාදො, තමෙව ත්වං සාධුකමනුරක්ඛා”ති."
            },
            {
                "type": "paragraph",
                "text": "“සචෙ තං භන්තෙ මයා දුක්කරං අඤ්ඤදිට්ඨිකෙන අඤ්ඤඛන්තිකෙන අඤ්ඤරුචිකෙන අඤ්ඤත්රායොගෙන අඤ්ඤත්ර ආචරියකෙන සුභං විමොක්ඛං උපසම්පජ්ජ විහරිතුං. යො ච මෙ අයං භන්තෙ භගවති පසාදො, තමෙවාහං සාධුකමනුරක්ඛිස්සාමී”ති."
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච භගවා. අත්තමනො භග්ගවගොත්තො පරිබ්බාජකො භගවතො භාසිතං අභිනන්දී ති."
            },
            {
                "type": "centered",
                "text": "පාථිකසුත්තං නිට්ඨිතං පඨමං.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "pages": {
            "2": {
                "pageNum": 2,
                "footnotesCount": 3
            },
            "4": {
                "pageNum": 4,
                "footnotesCount": 2
            },
            "6": {
                "pageNum": 6,
                "footnotesCount": 0
            },
            "8": {
                "pageNum": 8,
                "footnotesCount": 4
            },
            "10": {
                "pageNum": 10,
                "footnotesCount": 2
            },
            "12": {
                "pageNum": 12,
                "footnotesCount": 1
            },
            "14": {
                "pageNum": 14,
                "footnotesCount": 2
            },
            "16": {
                "pageNum": 16,
                "footnotesCount": 1
            },
            "18": {
                "pageNum": 18,
                "footnotesCount": 3
            },
            "20": {
                "pageNum": 20,
                "footnotesCount": 2
            },
            "22": {
                "pageNum": 22,
                "footnotesCount": 1
            },
            "24": {
                "pageNum": 24,
                "footnotesCount": 0
            },
            "26": {
                "pageNum": 26,
                "footnotesCount": 3
            },
            "28": {
                "pageNum": 28,
                "footnotesCount": 2
            },
            "30": {
                "pageNum": 30,
                "footnotesCount": 1
            },
            "32": {
                "pageNum": 32,
                "footnotesCount": 0
            },
            "34": {
                "pageNum": 34,
                "footnotesCount": 1
            },
            "36": {
                "pageNum": 36,
                "footnotesCount": 1
            },
            "38": {
                "pageNum": 38,
                "footnotesCount": 4
            },
            "40": {
                "pageNum": 40,
                "footnotesCount": 6
            },
            "42": {
                "pageNum": 42,
                "footnotesCount": 2
            },
            "44": {
                "pageNum": 44,
                "footnotesCount": 2
            },
            "46": {
                "pageNum": 46,
                "footnotesCount": 3
            },
            "48": {
                "pageNum": 48,
                "footnotesCount": 2
            },
            "50": {
                "pageNum": 50,
                "footnotesCount": 3
            },
            "52": {
                "pageNum": 52,
                "footnotesCount": 2
            },
            "54": {
                "pageNum": 54,
                "footnotesCount": 2
            },
            "56": {
                "pageNum": 56,
                "footnotesCount": 2
            }
        }
    },
    {
        "filename": "1-9-10-44-73",
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "3"
            },
            {
                "format": 5,
                "text": "සූත්‍රාන්තපිටකයෙහි",
                "type": "centered",
                "level": 2
            },
            {
                "format": 4,
                "text": "දික් සඟිය",
                "type": "centered",
                "level": 5
            },
            {
                "format": 6,
                "text": "තෘතිය භාගය",
                "type": "centered",
                "level": 3
            },
            {
                "type": "centered",
                "text": "පාථික වර්‍ගය",
                "level": 4
            },
            {
                "format": 12,
                "text": "ඒ භාග්‍යවත් අර්හත් සම්‍යක්සම්බුද්ධයන් වහන්සේට නමස්කාර වේවා.",
                "type": "centered"
            },
            {
                "type": "centered",
                "text": "1",
                "level": 3
            },
            {
                "type": "heading",
                "text": "පාථික සූත්‍රය",
                "level": 3
            },
            {
                "format": 13,
                "text": "1. මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ, මල්ල රටැ - මල්ලයන්ගේ අනුපියා නම් යම් නියම්ගමෙක් වී ද - එහි වැඩ වසන සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එ කලැ භාග්‍යවතුන් වහන්සේ පෙර වරුයෙහි හැඳ පෙරෙවැ පාසිවුරු ගෙන, අනුපියා නිගමයට පිඬු පිණිස වන් සේක. එ කල්හි (එසේ වඩනා) භාග්‍යවතුන් වහන්සේට ‘අනුපියා නිගමයෙහි පිඬු පිණිස හැසිරෙන්නට තව ම ඉතා උදාසන ය. මේ භාර්‍ගවගෝත්‍ර පිරිවැජ්ජාගේ අරමට, භාර්‍ගවගෝත්‍ර පිරිවැජ්ජා කරා, ගියෙම් වීම් නම් යෙහෙකැ’ යි මෙ සිත විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "2. ඉක්බිත්තෙන් භාග්‍යවතුන් වහන්සේ භාර්‍ගවගෝත්‍ර පිරිවැජ්ජාගේ ආරාමය යම් තැනෙක ද, භාර්‍ගවගෝත්‍ර පිරිවැජ්ජා යම් තැනෙක ද, එ තැනට වැඩි සේක. එකල්හි භාර්‍ගවගෝත්‍ර පිරිවැජි තෙම භාග්‍යවතුන් වහන්සේට ‘වහන්ස, භාග්‍යවතුන් වහන්සේ මෙහි වඩිනා සේක් වා, වහන්ස, භාග්‍යවතුන් වහන්සේ මෙහි වැඩි සේ මැනව, වහන්ස, භාග්‍යවතුන් වහන්සේ අද මෙහි වැඩියේ බොහෝ කලකට පසු යැ{1 මෙහි වඩින්නට අද යම් වාරයක් (අවස්ථාවක්) යොදා ගත් සේක් ද ඒ බොහෝ කලෙකිනි යනු පදගත අර්ථයි.}, වහන්ස, භාග්‍යවතුන් වහන්සේ වැඩහිඳිනා සේක් වා, මේ අස්නෙක් පනවන ලද්දේ වේ’ යැ යි මේ වචන කී ය. පනවන ලද අස්නෙහි භාග්‍යවතුන් වහන්සේ වැඩ හුන් සේක. භාර්‍ගවගෝත්‍ර පිරිවැජි ද එක්තරා මිටි අස්නෙක් ගෙන පසෙක ඉඳ ගත.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "5"
            },
            {
                "format": 13,
                "text": "3. එකත් පස් වැ හුන්නා වූ ම භාර්‍ගවගෝත්‍ර පිරිවැජි තෙමෙ භාග්‍යවතුන් වහන්සේට මෙ බස් පැවැසී ය:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වහන්ස, පෙර දවසැ, බොහෝ පෙර දවසැ, ලිච්ඡවීරාජපුත්‍ර සුනක්ඛත්ත තෙමේ මා වෙත ආයේ ය. අවුත්, ‘භාර්‍ගවය, දැන් මා විසින් භාග්‍යවතුන් වහන්සේ පරිත්‍යක්ත සේක. මම් භාග්‍යවතුන් වහන්සේගෙන් වෙන් වීමි. භාග්‍යවතුන් වහන්සේ උදෙසා නො වෙසෙමි’ යි මට සැළ කෙළේය. වහන්ස, කිමෙක් ද? මෙය ලිච්ඡවීපුත්‍ර සුනක්ඛත්තයා කී සේ ම වී ද?” (යනු යැ).",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "4. “භාර්‍ගවය, මෙය ලිච්ඡවීපුත්‍ර සුනක්ඛත්තයා කී සේ ම විය. භාර්‍ගවය, පෙර දවසැ බොහෝ පෙර දවසැ, ලිච්ඡවීපුත්‍ර සුනක්ඛත්තයා මා වෙත ආයේ ය, අවුත් මා වැඳ, පසෙක ඉඳ ගත්තේ ය, එසේ හුන්නේ ම “වහන්ස, මම් දැන් භාග්‍යවතුන් වහන්සේ හැරපියා යෙමි, වහන්ස, මම් භාග්‍යවතුන් වහන්සේ උදෙසා නො වසන්නෙමි” යි කී ය. භාර්‍ගවය, ඔහු මෙසේ කී කලැ, මම් ඔහු අමතා, ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘සුනක්ඛත්තය, තෝ මෙහි එව, මා උදෙසා වසව’ යි මම් තට කිම් දැ?’ යි ඔහු පුළුවත්මි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘වහන්ස, එසේ වූ කථාවෙක් නො වී යැ’ යි හේ කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“තෝ හෝ මට ‘මම් භාග්‍යවතුන් වහන්සේ උදෙසා වසන්නෙමි’ යි කීහි දැ?” යි පුළුවත්මි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘වහන්ස, මෙසේ වූ කථාවෙක් ද නො වී’ යැ යි හේ කිව.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“සුනක්ඛත්තය, මෙසේ ‘මෙහි එව මා උදෙසා වසවැ’ යි මම් තට නො ම කීමි. ‘මම් භාග්‍යවතුන් වහන්සේ උදෙසා වසන්නෙමි’ යි තෝ ද මට නො කී ය. හිස් මිනිස, මෙසේ ඇති කලැ, තෝ කවරෙක් වනුයෙහි, කවරක්හු හැරපියා යෙහි ද? හිස් මිනිස, මෙහි ලා තා කෙළේ කොතරම් මහත් වරදෙක් දැ? යි සලකා බලව” යි මම් ඔහුට කීමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "5. එවිටැ, ‘වහන්ස, භාග්‍යවතුන් වහන්සේ මට උතුරුමිනිස් දහමින් පෙළහර නො කරන සේකැ’ යි සුනක්ඛත්තයා කී ය. එවිටැ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘සුනක්ඛත්තය, තෝ එව, මා උදෙසා වසව, මම් තට උතුරුමිනිස් දහමින් පෙළහර කරන්නෙමි’ යි තා අමතා මම් කීයෙම් දැ?’ යි ඔහු පුළුවත්මි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "7"
            },
            {
                "format": 13,
                "text": "",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": ""
            },
            {
                "type": "paragraph",
                "text": ""
            },
            {
                "type": "paragraph",
                "text": "‘වහන්ස, මෙය එසේ නො ම වී’ යැ යි සුනක්ඛත්තයා කී ය."
            },
            {
                "format": 13,
                "text": "‘භාග්‍යවතුන් වහන්සේ මට උතුරුමිනිස් දහමින් පෙළහර කරති’ යි සිතා මම් භාග්‍යවතුන් වහන්සේ උදෙසා වසන්නෙමි’ යි ද තෝ මට නො කීහි. මෙසේ ඇති කලැ, හිස් මිනිස, තෝ කවරෙක් වනුයෙහි කවරක්හු හැරපියා යෙහි ද? සුනක්ඛත්තය, ඒ කිමැ යි සිතහි ද? උතුරුමිනිස්දහමින් ඉදු පෙළහර කළ ද නො කළ ද, යම් දුක්වැනැස්මක් පිණිස මා විසින් දහම් දෙසන ලද නම්, එය ඒ දහම පරිදි පිළිපදනහුට මොනොවට දුක් නසනු පිණිස පවත්නේ දැ?’ යි මම් පුළුවත්මි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘වහන්ස, උතුරුමිනිස් දහමින් පෙළහර කළත් නොකළත් යම් දුක්වැනැස්මක් පිණිස භාග්‍යවතුන් වහන්සේ විසින් දහම් දෙසන ලද නම්, ඒ දහම එය වූ පරිදි පිළිපදනහුට මොනොවට දුක් නසනු පිණිස පවතී’ යැ යි සුනක්ඛත්තයා කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘සුනක්ඛත්තය, මෙසේ කලැ උතුරුමිනිස් දහමින් පෙළහර කළ ද නො කළ ද, යම් දුක්වැනැස්මක් පිණිස මා විසින් දහම් දෙසන ලද නම්, එහි කී පරිදි පිළිපදනහුට එය මොනොවට දුක් නසනු පිණිස පවත්නේ නම්, උතුරුමිනිස් දහමින් ඉදුපෙළහර කරන ලදුයේ කවර නම් වැඩක් සිදු කරන්නේ ද? හිස් මිනිස, මෙහි තා කෙළේ කොතරම් මහ වරදෙක් දැ? යි බලව’ යි මම් කීමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "6. ‘වහන්ස, භාග්‍යවතුන් වහන්සේ මට ලෝකෝත්පත්ති වංශකථාව නො ම වදාරන සේකැ’ යි සුනක්ඛත්තයා කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘සුනක්ඛත්තය, තෝ මෙහි එව, මා උදෙසා වස, මම් තට ලෝකෝත්පත්ති වංශකථාව කියන්නෙමි’ යි මම් තට කීම් දැ?’ යි මම ඔහු පුළුවත්මි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘වහන්ස, එ වැනි බසක් නො වදාළ සේකැ’ යි හේ කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘භාග්‍යවතුන් වහන්සේ මට ලෝකෝත්පත්ති වංශකථාව වදාරති’ යි භාග්‍යවතුන් වහන්සේ නිසා වසන්නෙමි’ යි හෝ තෝ මට කීහි දැ?’ යි මම ඔහු පුළුවත්මි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘වහන්ස, එ වැනි බසක් නොකීමි’ යි හේ කිව.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "9"
            },
            {
                "format": 13,
                "text": "‘සුනක්ඛත්තය, මම් ද ‘මෙහි එව, මා උදෙසා වසව, මම් තට ලෝකෝත්පත්ති වංශකථාව කියන්නෙමි’ යි මෙසේ නො කීමි. තෝ හෝ ‘භාග්‍යවතුන් වහන්සේ මට ලෝකෝත්තිපත්ති වංශකථාව වදාරති. මම් ඔබ උදෙසා වසන්නෙමි’ යි නො කීයෙහි. හිස් මිනිස, මෙසේ ඇති කලැ තෝ කවරෙක් වනුයෙහි කවරක්හු පියා යෙහි ද? සුනක්ඛත්තය, ඒ කිමැ යි සිතයි ද? ලෝකෝත්පත්ති වංශකථාව කිවත් නොකිවත්, යම් දුක්වැනැස්මක් පිණිස මා විසින් දහම් දෙසණි නම්, ඒ දහම එය අනුව පිළිපදනහුට මොනොවට දුක් නැසීම පිණිස නො පවත්නේ දැ?’ යි මම පුළුවුත්මි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘වහන්ස, ලෝකෝත්පත්ති වංශකථාව වදාළ ද නො වදාළ ද, යමක් පිණිස භාග්‍යවතුන් වහන්සේ විසින් දහම් දෙසිණි නම්, ඒ දහම එය අනුව පිළිපදනහුට දුක්වැනැස්ම පිණිස පවත්නේ යැ’ යි සුනක්ඛත්තයා කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එවිට, ‘සුනක්ඛත්තය, මෙසේ ලෝකෝත්පත්ති වංශකථාව කිව ද නො කිව ද, යමක් පිණිස මා විසින් දහම් දෙසන ලද නම්, එය පිළිපදනහුට ඒ දහම මොනොවට දුක් වැනැස්ම පිණිස පවත්නේ නම්, එහි ලා ලෝකෝත්පත්ති වංශකථාව කියන ලදුයේ කවර අර්‍ථයක් සිදු කරන්නේ ද? හිස් මිනිස, මෙහි තා විසින් කොතරම් මහ වරදෙක් කරන ලද දැ යි සිතා බලව. සුනක්ඛත්තය, පෙරැ තා විසින් වැදෑගම (විසල් මහ පුර) වැද නොයෙකේ කරුණින් මා ගුණ කියන ලද්දේ ය. ‘ඒ භගවත්හු මේ මේ කරුණින් අර්හත් හ, සම්‍යක්සම්බුද්ධ හ, විද්‍යාචරණසම්පන්න හ, සුගත හ, ලෝකවිත් හ, නිරුත්තර පුරුෂදම්‍යසාරථි හ. දෙව්මිනිස්නට ශාස්තෘ හ, බුද්ධ හ, භගවත්හ’ යි මෙසේ නොයෙක් කරුණින් මා ගුණ වණන ලද්දේ ය. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "වැදෑගමෙහි දී නොයෙක් කරුණින් දහම්හි ගුණ කියන ලද්දේ යැ. ‘භගවත් බුදුන් විසින් ධර්‍මය මොනොවට වදාරන ලද්දේ යැ, එය සාන්දෘෂ්ටික යැ, අකාලිකා යැ, ඒහිපස්සික යැ, උපනෙයක යැ, නුවණැත්තන් විසින් තමන් සිත්හි ලා දතයුතු යැ’ යි මෙසේ තා විසින් නොයෙක් කරුණින් දහමැ ගුණ කියන ලද්දේ ය. සුනක්ඛත්තය, තා විසින් ‘යම් පුරුෂ යුග සතරක් වූ, පුරුෂපුද්ගල අට දෙනෙක් වූ ශ්‍රාවක කෙනෙක් වෙත් ද, භාග්‍යවතුන් වහන්සේගේ මේ ශ්‍රාවක සඞ්ඝ තෙම් සුප්‍රතිපන්න යැ, භාග්‍යවතුන් වහන්සේගේ මේ ශ්‍රාවක සඞ්ඝ තෙමේ ඍජු ප්‍රතිපන්න යැ, භාග්‍යවතුන් වහන්සේගේ මේ ශ්‍රාවක සඞ්ඝ තෙමේ න්‍යායප්‍රතිපන්න යැ, භාග්‍යවතුන් වහන්සේගේ මේ ශ්‍රාවක සඞ්ඝ තෙමේ සාමීචිප්‍රතිපන්න යැ, භාග්‍යවතුන් වහන්සේගේ මේ ශ්‍රාවක සඞ්ඝ තෙමේ ආහුනෙය යැ, ප්‍රාහුණේය යැ, දක්ෂිණේය යැ, අඤ්ජලිකරණීය යැ, ලොවට නිරුත්තර පුණ්‍යක්ෂේත්‍රය යැ’ යි මෙසේ වැදෑ ගමැදී සඞ්ඝයාගේ ගුණ නොයෙක් කරුණින් කියන ලද්දේ ය. සුනක්ඛත්තය, මම් තට කියමි. මම් තට දන්වමි, තට දොස් කියන්නන් වෙති: ‘ලිච්ඡවීපුත්‍ර සුනක්ඛත්තයා මහණ ගොයුමන් වෙත බඹසර පුරන්නට නො හැකි විය. නො හැකි වූයේ ශික්ෂාව හැර පියා ගිහි බවට පෙරැළී ආයේ වනැ’ යි මෙසේ තට දොස් කියන්නන් වෙති’ යි මම් කීමි. භාර්‍ගවය, මෙසේ මා විසින් කියනු ලබනුයේ ම ලිච්ඡවීපුත්‍ර සුනක්ඛත්ත තෙම, අපායෙහි උපදනට සුදුස වූවක්හු සේ, නිරයෙහි උපදනට සුදුසු වූවක්හු සේ, මෙ සස්නෙන් බැහැරැ වැ ගියේ ම ය."
            },
            {
                "type": "page-break",
                "text": "11"
            },
            {
                "format": 21,
                "text": "කෝරක්ඛත්තිය වස්තුව",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "7. භාර්‍ගවය, එක් සමයෙක්හි මම් බුලු ජනපදයෙහි, බුලු රටට අයත් උත්තරකා නම් යම් නිගමයෙක් වේ ද, එහි වෙසෙමි. භාර්‍ගවය, එ කලැ මම් (එක් දවසෙක) පෙර වරුයෙහි හැඳ පෙරෙවැ, පා සිවුරු ගෙන, පසුමහණහු වූ ලිච්ඡවීපුත්‍ර සුනක්ඛත්තයා හා උත්තරකා නිගමයට පිඬු පිණිස වනිමි. එ සමයෙහි කෝරක්ඛත්තිය නම් නිරුවත් තවුසෙක් බලුතපස් රක්නේ, දෙ දණ හා දෙ වැලමිටු හා යන සිවු අවයව බිමැ ඔබා හැවිදුනේ, බිමැ ලූ අහර (අතින් නො ගෙන) මුවින් ම ගෙන කයි, මුවින් ම ගෙන බුදියි. භාර්‍ගවය, ලිච්ඡවීපුත්‍ර සුනක්ඛත්තයා බලුතපස් කරන, දෙ දණත් දෙ වැලමිටුත් බිම ඔබා හැවිදින, බිමැ ලූ අහර මුවින් ම ගෙන කන, මුවින් ම ගෙන බුදින, කෝරක්ඛත්තිය නම් නිරුවත් තවුසා දුටුයේ ය. දැකම, ‘ආශ්චර්යයෙක, භවත්නි, මේ සොඳුරු සැහැවි ඇති රහත් මහණ කෙනෙක! මොහු දෙ දණ හා දෙ වැලමිටු හා බිමැ ඔබා ඇවිදුනා කෙනෙක. බිමැ ලූ අහර මුවින් ම ගෙන කයි, මුවින් ම ගෙන බුදී’ යැ යි ඔහුට මේ සිත විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "8. භාර්‍ගවය, එ කලැ මම් ලිච්ඡවීපුත්‍ර සුනක්ඛත්තයාගේ චිත්තසංකල්පනාව මා සිතින් දැක, “හිස් මිනිස, තෝත් ‘ශාක්‍යපුත්‍රීය මහණෙකිමි’ යි පිළින කෙරෙයි දැ?” යි ඔහුට කීමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වහන්ස, භාග්‍යවතුන් වහන්සේ මට ‘හිස් මිනිස තෝත් ශාක්‍යපුත්‍රීය මහණෙකිමි’ යි පිළින කෙරෙයි දැ?’ යි කවර හෙයින් මෙසේ වදාරන සේක් දැ?” යි හේ මා පුළුවුත.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“සුනක්ඛත්තය, බලුතපස් කරන දෙ දණ හා දෙ වැලමිටු හා බිමැ ඔබා හැවිදුනා, බිමැ ලූ අහර මුවින් ම ගෙන කන, මුවින් ම ගෙන බුදින මේ නිරුවත් කෝරක්ඛත්තිය තවුසා දැක, ‘ආශ්චර්යයෙක, භවත්නි, දෙ දණ හා දෙ වැලමිටු හා බිමැ ඔබා හැවිදුනා, බිමැ ලූ අහර මුවින් ම ගෙන කන, මුවින් ම ගෙන බුදින මොහු සොඳුරු සැහැවි ඇති රහත් මහණ කෙනෙකැ!’ යි මේ සිත තට පහළ වූයේ නො වේ දැ?” යි මම් කීමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“එසේ යැ වහන්ස. කිමෙක් ද? වහන්ස, භාග්‍යවතුන් වහන්සේ (මෙය අනෙකකුට නො වේ වා යි) රහත්බවට මසුරුකම් කරන සේක් දැ?” යි සුනක්ඛත්තයා කී ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "13"
            },
            {
                "format": 13,
                "text": "“හිස් මිනිස, මම් රහත්බවට නො ම මසුරුකම් කරමි. වැලි තට ම මේ ලාමක මිථ්‍යාදෘෂ්ටිය උපන. එය බැහැර කරව. එය තට බොහෝ කල් අවැඩ පිණිස, දුක් පිණිස නොවේ වා. සුනක්ඛත්තය, තෝ ‘සොඳුරු සැහැවි ඇති රහත් මහණෙකැ’ යි මේ කෝරක්ඛත්තිය නම් යම් නිරුවත් තවුසකු හඟනෙහි ද, හේ මෙයින් සත්වන දා අලසක රෝගයෙන් මියෙන්නේ ය. මිය ගියේ, සැමට නිහීන වූ කාලකඤ්ජ නම් යම් අසුර නිකායයෙක් ඇත් ද, එහි උපදනේ ය. (මිනිස්සු) මළා වූ ඔහු බීරණත්ථම්භක නම් සොහොනට ඇද දමන්නාහ. සුනක්ඛත්තය, ඉදින් තෝ කැමැත්තෙහි නම්, අචේලක කෝරක්ඛත්තියයා කරා ගොස් ‘ඇවැත් කෝරක්ඛත්තියයෙනි, තොප ගතිය දනිවු දැ?’ යි විචාරව. ‘ඇවැත් සුනක්ඛත්තය, මම් තමාගේ ගතිය දනිමි. හැමට නිහීන වූ කාලකඤ්ජ නම් යම් අසුර නිකායෙක් ඇද්ද, මම් එහි උපන්නෙම් වෙමි’ යි අචේලක කෝරක්ඛත්තියයා තට හෙළි කරන්නේ ය යන යමෙක් ඇද්ද, මේ කාරණය විද්‍යමාන යැ” යි මම් ඔහුට කීමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "9. භාර්‍ගවය, ඉක්බිති ලිච්ඡවීපුත්‍ර සුනක්ඛත්ත තෙමෙ අචේලක කෝරක්ඛත්තියයා කරා ගියේ ය. ගොස්, කෝරක්ඛත්තියයා බණවා, ‘ඇවැත් කෝරක්ඛත්තියය, ‘අචේලක කෝරක්ඛත්තියයා මෙයින් සත්වන දවසැ අලසක රෝගයෙන් මියෙති’ යි, ‘මිය ගියාහු ම කාලකඤ්ජ නම් හැමට නිහීන අසුර නිකායෙහි උපදිති’ යි, ‘මිය ගිය ඔහු බීරණත්ථම්භක නම් සොහොනට ඇද දමතැ’ යි ශ්‍රමණ ගෞතමයන් විසින් ඔබ ව්‍යාකෘතහ (ඔබේ අනාගත ගතිය හෙළි කොට කියන ලදී). ඇවැත් කෝරක්ඛත්තියයෙනි, එබැවින් ශ්‍රමණ ගෞතමයන්ගේ බස යම් සේ බොරු වන්නේ ද, එසේ වනු පිණිස තෙපි මඳ මඳ කොට බොජුන් වළඳවු, මඳ මඳ කොට පැන් බොවු’ යැ යි කී ය. භාර්‍ගවය, එ කලැ ලිච්ඡවීපුත්‍ර සුනක්ඛත්ත තෙමේ තථාගතයන් කී බස යම් සේ නො අදහන්නේ ද, එසේ එක් දවසෙක් ගෙවිණ, දෙ දෙවසෙක් ගෙවිණැ යි යන ආදි වශයෙන් සත් රෑ දාවලක් ගිණුයේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භාර්‍ගවය, එ කලැ සත් වන දවසැ අචේලක කෝරක්ඛත්තිය තෙමේ අලසක රෝගයෙන් මිය ගියේ ය. මියැ කාලකංජ නම් සර්‍වනිහීන අසුර නිකායයෙහි උපන්නේ ය. (මිනිස්සු) මිය ගියා වූ ද ඔහු බීරණත්ථම්භක නම් සොහොනට ඇද දැමූහ. භාර්‍ගවය, ලිච්ඡවීපුත්‍ර සුනක්ඛත්ත තෙම ‘අචේලක කෝරක්ඛත්තියයා අලසක රෝගයෙන් මිය ගියේ, බීරණත්ථම්භක නම් සොහොනට ඇද දමන ලදැ’ යි යන්න ඇසීය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "15"
            },
            {
                "format": 13,
                "text": "ඉක්බිති හේ බීරණත්ථම්භක සොහොන කරා, අචේලක කෝරක්ඛත්තියාගේ මළසිරුර වෙතට ගියේ ය. ගොස්, ‘ඇවැත්නි, කෝරක්ඛත්තියයෙනි, ඔබ තමන් ඉපැද ඉන්නා ගතිය දනිත් දැ?’ යි ඔහු මළ සිරුර තෙවිටක් අත්ලෙන් පහළේ ය. භාර්‍ගවය, එ විටැ අචේලක කෝරක්ඛත්තියයා අත්ලෙන් පිට පිස දමනුයේ නැඟී සිටියේ ය. නැඟී සිට, ‘ඇවැත් සුනක්ඛත්තය, මම් සිය ගතිය දනිමි. කාලකංජක නම් සර්‍වනිහීන අසුර නිකායයෙහි උපනිමි’ යි කියා එ තැන්හි ම උඩුකුරු වැ ඇද වැටුණේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "10. භාර්‍ගවය, එවිටැ ලිච්ඡවීපුත්‍ර සුනක්ඛත්තයා මා වෙත එළැඹියේ ය. එළැඹැ මා වැඳ පසෙක ඉඳගත්තේ ය. එසේ පසෙක හුන් ලිච්ඡවීපුත්‍ර සුනක්ඛත්තයා අමතා, ‘සුනක්ඛත්තය, එය කිමැ යි සිතයි ද? මම් අචේලක කෝරක්ඛත්තියයා ඇරැබැ යම්සේ තට කීයෙම් ද, එසේ ම ඒ වචනයේ නිෂ්පත්තිය වී ද? නැත හොත් අන් සැටියකින් වී දැ?’ යි පුළුවුත්මි. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "‘වහන්ස, භාග්‍යවතුන් වහන්සේ අචේලක කෝරක්ඛත්තියයා ඇරැබ මට යම් සේ වදාළ සේක් ද, එසේ ම ඒ විපාකය විය, අන් ලෙසෙකින් නො වී යැ’ යි ලිච්ඡවීපුත්‍ර සුනක්ඛත්ත කී ය. "
            },
            {
                "type": "paragraph",
                "text": "’සුනක්ඛත්තය, ඉදින් මෙසේ ඇති කලැ, උතුරුමිනිස් දහමින් ඉදුපෙළහර කරන ලද ද? නොකරන ලද දැ?’ යි ඇසීමි. ‘වහන්ස, මෙසේ ඇති කලැ ඒකාන්තයෙන් උතුරු මිනිස් දහමින් ඉදිපෙළහර කරන ලද්දේ ය, නො කරන ලද්දේ නො වෙයි’ හේ කී ය. හිස් මිනිස, මෙසේ උතුරු මිනිස් දහමින් ඉදුපෙළහර කරන මට ‘භාග්‍යවතුන් වහන්සේ මට උතුරු මිනිස්දහමින් ඉදුපෙළහර නොකරන සේකැ’ යි තෝ කීයෙහි, හිස් මිනිස, බලව, තා කළ මේ වරදෙහි මහත!’ යැ යි මම් කීමි: භාර්‍ගවය, ලිච්ඡවීපුත්‍ර සුනක්ඛත්තයා මා විසින් මෙසේ කියනු ලබනු යේ ද, අපායට සුදුසු වූවකු, නිරයට සුදුසු වූවකු සේ මෙ සස්නෙන් බැහැර වැ ගියේ ම ය."
            },
            {
                "format": 21,
                "text": "කළාරමට්ඨුක වස්තුව",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "11. භාර්‍ගවය, මම් එක් සමයෙක විසල්පුරැ මහ වෙනෙහි කුළාර හල් වෙහෙරැ වෙසෙමි. එ සමයෙහි වූ කලී කළාරමට්ඨුක නම් අචේලකයෙක් ලාභයෙන් අක් පත් වූයේ, යසසින් අක් පත් වූයේ වැදෑගමැ වූ විසල්පුරැ වෙසෙයි. ඔහු විසින්,",
                "type": "paragraph"
            },
            {
                "format": 14,
                "text": "“දිවි ඇති තාක් නිරුවත් වන්නෙමි, පිළි නො හඳින්නෙමි යි,",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "දිවි ඇති තාක් බඹසැරි වන්නෙමි, මෙවුන්දම් නො සෙවින්නෙමි යි,"
            },
            {
                "type": "paragraph",
                "text": "දිවි ඇති තාක් රා මස් දෙකින් යැපෙන්නෙමි, බත් කොමුපිඬු ඈ අහර නො වළඳන්නෙමි යි,"
            },
            {
                "type": "page-break",
                "text": "17"
            },
            {
                "type": "paragraph",
                "text": "විසල්පුරට පැදුම් දෙසින් උදේන නම් දෙවොල ඇත, එය ඉක්මැ නොයන්නෙමි යි,"
            },
            {
                "type": "paragraph",
                "text": "විසල්පුරට දකුණු දෙසින් ගෞතමක නම් දෙවොල ඇත, එය ඉක්මැ නොයන්නෙමි යි,"
            },
            {
                "type": "paragraph",
                "text": "විසල්පුරට පෑළ දිගින් සත්තම්බ නම් දෙවොල ඇත, එය ඉක්මැ නො යන්නෙමි යි,"
            },
            {
                "type": "paragraph",
                "text": "විසල්පුරට උතුරු දිගින් බහුපුත්තක නම් දෙවොල ඇත, එය ඉක්මැ නො යන්නෙමි යි”"
            },
            {
                "format": 13,
                "text": "මෙසේ වූ සප්ත ව්‍රතපද කෙනෙක් සමාදන් කොට ගන්නා ලද්දාහු වෙත්. මේ ව්‍රතපද සත සමාදන් කොට ගෙන වසන හෙයින් හෙ තෙමෙ වැදෑගමැ ලාභයෙන් අග පත් වූයේ ද යසසින් අග පත් වූයේ ද වෙයි. භාර්‍ගවය, එ කල්හි ලිච්ඡවීපුත්‍ර සුනක්ඛත්ත තෙමේ නිරුවත් කළාරමට්ඨුකයා කරා එළැඹියේ ය, එළැඹැ ඔහුගෙන් ප්‍රශ්න විචාළේය. ඔහු විසින් පැණ පුළුවුස්නා ලද කළාරමට්ඨුක තෙමෙ ඒ පැණ විසඳන්නට (සපයා කියන්නට) නොහැකි විය, එසේ නො හැකි වූයේ, කෝපය ද ද්වේෂය ද නොසතුට ද පහළ කෙළේ ය. භාර්‍ගවය, එ විටැ ලිච්ඡවීපුත්‍ර සුනක්ඛත්තයාට ‘අහෝ! සාධු ගුණ ඇති රහත් මහණක්හු කෙරේ ගැහැටුණම්හ. එය අපට බොහෝ කල් අවැඩ පිණිස, දුක් පිණිස නො වේ ව’ යි මේ සිත විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "12. භාර්‍ගවය, ඉක්බිත්තෙන් ලිච්ඡවීපුත්‍ර සුනක්ඛත්ත තෙමෙ මා කරා එළැඹියේ ය. එළැඹැ, මා වැඳ පසෙක හිඳගත්තේ ය. භාර්‍ගවය, එසේ පසෙක හුන් ලිච්ඡවීපුත්‍ර සුනක්ඛත්තයා අමතා, ‘හිස් මිනිස, තෝත් ශාක්‍යපුත්‍රීය මහණෙකිමි’ යි පිළින කෙරෙයි දැ?’ යි කීමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘වහන්ස, කවර හෙයින් මට එසේ වදාරන සෙයෙක් දැ?’ යි හේ කීය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘සුනක්ඛත්තය, තෝ නිරුවත් කළාරමට්‍ඨුකයා කරා එළැඹැ පැණ පුළුවුසූයෙහි නො වෙහි ද? නිරුවත් කළාරමට්ඨුක තෙමෙ ඒ තා විසින් පැණ පුළුවුස්නා ලදුයේ, එය විසඳන්නට නොහැකි වූයේ නො වේ ද? නො හැකි වනුයේ කෝපයත් ද්වේෂයත් නොසතුටත් පහළ කෙළේ නොවේ ද? ඒ තට ‘සාධු ගුණ ඇති රහත් මහණක්හු කෙරේ ගැහැටුණම්හ, එය අපට බොහෝ කලක් අවැඩ පිණිස, දුක් පිණිස නොවේ ව’ යි මේ සිත වූයේ නො වේ දැ?’ යි මම් කීමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘වහන්ස, එසේ ය, කිමෙක් ද? භාග්‍යවතුන් වහන්සේ රහත් බවට මසුරු වන සේක් දැ?’ යි හේ කී ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "19"
            },
            {
                "format": 13,
                "text": "‘හිස් මිනිස, මම් රහත්බවට මසුරු නොවෙමි. වැලි, තා හට මේ ලාමක මිසදිටෙක් උපන. එය බැහැරැ ලව. එය තට බොහෝ කල් අවැඩ පිණිස දුක පිණිස නො වේ වා. සුනක්ඛත්තය, නිරුවත් කළාරමට්ඨුක නම් යම් එකකු ‘සාධු ගුණ ඇති රහත් මහණෙකැ’ යි තෝ සිතයි ද, හේ නො බෝ දිනෙකින් ම පිළී හැන්දේ බිරියක ඇති වැ හැවිදුනේ, බත් කොමු ඈ අහර වළඳනුයේ විසල්පුරැ හැම දෙවොල් ම ඉක්මැ ගොස් යසසින් පිරිහුණේ කලුරිය කරන්නේ යැ’ යි කීමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "13. භාර්‍ගවය, එ කලැ නිරුවත් කළාරමට්ඨුක තෙමෙ නොබෝ දිනෙකින් පිළී හැන්දේ, බිරියක් ඇති වැ හැවිදිනුයේ, බත් කොමු ඈ අහර වළඳනුයේ, විසල්පුරැ සියලු දෙවොල් ම ඉක්මැ ගොස්, යසසින් පිරිහී කළුරිය කෙළේ ලැ’ යි සුනක්ඛත්තයා ඇසී ය. එ කලැ හේ මා කරා එළැඹියේ ය. එළැඹැ මා වැඳ පසෙකැ හුන්නේ ය. පසෙකැ හුන් සුනක්ඛත්තයා අමතා, ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "‘සුනක්ඛත්තය, එය කිමැ යි සිතයි ද? නිරුවත් කළාරමට්ඨුකයා ඇරැබැ තට යම් සේ මම් කීම් ද, එසේ ම එය නිපන්නේ ද? නැත හොත් අන් සැටියෙකින් වී දැ?’ යි කීමි."
            },
            {
                "format": 13,
                "text": "‘වහන්ස, භාග්‍යවතුන් වහන්සේ නිරුවත් කළාරමට්ඨුක තවුසා ඇරැබැ යම් සේ මට වදාළ සේක් ද, එසේ ම එය නිපන, අන් සැටියෙකින් නො වී යැ’ යි හේ කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘සුනක්ඛත්තය, තෝ එය කෙසේ සිතහි ද? ඉදින් මෙ ලෙස ඇති කලැ මා විසින් උතුරු මිනිස් දහමින් ඉදුපෙළහර කරන ලද ද?, නො කරන ලද දැ?’ යි ඇසීමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘වහන්ස, මෙසේ ඇති කලැ, උතුරු මිනිස් දහමින් ඉදු පෙළහර කරන ලදුයේ වෙයි, නො කරන ලදුයේ නොවේ’ යැ යි හේ කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘හිස් මිනිස, මෙසේත් උතුරු මිනිස් දහමින් ඉදු පෙළහර කරන මට; ‘භාග්‍යවතුන් වහන්සේ මට උතුරු මිනිස් දහමින් ඉදු පෙළහර නො කරන සේකැ’ යි තෝ කියෙහි. හිස් මිනිස, බලව, තා විසින් කොතරම් මහ වරදෙක් කරන ලද දැ?’ යි මම් කීමි. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "භාර්‍ගවය, ලිච්ඡවීපුත්‍ර සුනක්ඛත්තයා මා විසින් මෙසේ කියනු ලබනුයේ ම, අපායට සුදුසු වූවක්හු, නිරයට සුදුසු වූවක්හු සේ ම හේ මේ ධර්‍මවිනය කෙරෙන් (මෙ සසනෙන් බැහැර වැ) ගියේ ම ය."
            },
            {
                "type": "page-break",
                "text": "21"
            },
            {
                "format": 21,
                "text": "පාථික පුත්‍ර වස්තුව",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "14. භාර්‍ගවය, මම් එක් කලෙක විසල්පුර අසලැ මහ වෙනෙහි කුළාරහල් වෙහෙරැ වෙසෙමි. එ සමයෙහි පාථිකපුත්‍ර නම් නිරුවත් තවුසෙක් ලාභයෙන් ද යසසින් ද අගපත් වූයේ, වැදෑරජුන්ගේ වාසභූමි වූ විසල්පුරැ වෙසෙයි. හේ ‘මහණ ගොයුම් ඥානවාද ඇත්තෙක මම් ද ඥානවාද ඇතියෙමි. ඥානවාද ඇත්තේ වූ කලි ඥානවාද ඇත්තක්හු හා උතුරු මිනිස් දහමින් ඉදු පෙළහර දක්වන්නට සුදුස්සේ ය. ඉදින් මහණ ගොයුම් (වාද පිණිස) අඩ මඟක් එන්නේ වී නම්, මම් ද අඩ මඟක් (ඔහු දෙසට) ඉදිරි වැ යන්නෙමි. එහි දී ඒ අපි දෙ දෙනා ම උතුරු මිනිස් දහමින් ඉදු පෙළහර කරන්නමු. මහණ ගොයුම් උතුරු මිනිස් දහමින් එක් ඉදු පෙළහරක් කරන්නේ නම්, මම් ඉදු පෙළහර දෙකක් කරන්නෙමි. මහණ ගොයුම් උතුරු මිනිස් දහමින් ඉදු පෙළහර දෙකක් කරන්නේ නම්, මම් සතරක් කරන්නෙමි. ඉදින් මහණ ගොයුම් උතුරු මිනිස් දහමින් ඉදු පෙළහර සතරක් කරන්නේ නම්, මම් අටක් කරන්නෙමි. මෙසේ මහණගොයුම් උතුරු මිනිස් දහමින් යම් පමණ පෙළහර කරන්නේ ද, මම් එ මෙන් දෙගුණයක් දෙගුණයක් ඉදු පෙළහර කරන්නෙමි’ යි පිරිස් මැද මෙසේ වූ බසක් කියයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "15. භාර්‍ගවය, එ කලැ ලිච්ඡවීපුත්‍ර සුනක්ඛත්තයා මා වෙත එළැඹියේ ය. එළැඹ මා වැඳ පසෙක උන්නේ ය. පසෙක හුන්නේ ම, “වහන්ස, වැදෑගම වූ විසල්පුරැ පාථිකපුත්‍ර නම් නිරුවත් තවුසෙක් ලාභයෙන් ද යසසින් ද අගපත් වැ වෙසෙයි. ඔහු විසල්පුරැ පිරිස් මැදැ දී “මහණගොයුම් (මම් සියල්ල දනිමි යි) ඥානවාද ඇත්තෙක. මම් ද ඥානවාද ඇත්තෙකිමි. ඥානවාද ඇත්තේ වූ කලි ඥානවාද ඇත්තෙකු හා උතුරු මිනිස් දහමින් ඉදු පෙළහර දක්වන්නට සුදුස්සේ ය. ඉදින් මහණ ගොයුම් (වාද පිණිස) අඩ මඟක් එන්නේ වි නම්, මම් ද අඩ මඟක් ඉදිරියට යන්නෙමි. එහි දී ඒ අපි දෙ දෙනා ම උතුරු මිනිස් දහමින් ඉදු පෙළහර කරන්නමු. මහණ ගොයුම් උතුරු දහම් මිනිස් දහමින් එක් ඉදු පෙළහරක් කරන්නේ නම්, මම් ඉදු පෙළහර දෙකක් කරන්නෙමි. මහණ ගොයුම් උතුරු මිනිස් දහමින් ඉදු පෙළහර දෙකක් කරන්නේ නම්, මම් සතරක් කරන්නෙමි. ඉදින් මහණ ගොයුම් උතුරු මිනිස් දහමින් ඉදු පෙළහර සතරක් කරන්නේ නම්, මම් අටක් කරන්නෙමි. මෙසේ මහණ ගොයුම් උතුරු මිනිස් දහමින් යම් පමණ ඉදු පෙළහර කරන්නේ ද, මම් එ මෙන් දෙගුණ දෙගුණ ඉදු පෙළහර කරන්නෙමි’ යි මෙසේ කියතැ” යි මට සැළ කෙළේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "23"
            },
            {
                "format": 13,
                "text": "16. භාර්‍ගවය, මෙසේ කී කලැ මම් ලිච්ඡවීපුත්‍ර සුනක්ඛත්තයාට, “සුනක්ඛත්තය, නිරුවත් පාථිකපුත්‍රයා ඒ තෙපුල් නො හැරපියා ඒ සිත නො හැරපියා ඒ දෘෂ්ටිය නොදුරැලා මා හමුවට එන්නට නො හැක්ක. ඉදින් ඒ වචන නො හැරපියා, ඒ සිත නො හැරපියා, ඒ දිට් නො දුරැ ලා, ‘මහණ ගොයුම් හමුවට යන්නෙමි’ යි මෙසේ ඔහුට සිතෙක් වී නම් ඔහුගේ හිස ද ගිලි හෙතැ” යි මම් කීමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වහන්ස භාග්‍යවතුන් වහන්සේ මේ වචනය රක්නා සේක් වා, සුගතයන් වහන්සේ මේ වචනය රක්නා සේකේ වා” යි සුනක්ඛත්ත කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“සුනක්ඛත්තය, කිමෙක් ද? ‘භාග්‍යවතුන් වහන්සේ මේ වචනය රක්නා සේක් වා, සුගතයන් වහන්සේ මේ වචනය රක්නා සේක් වා’ යි මෙසේ මට කවර හෙයින් කියහි දැ?” යි මම් පුළුවුතිමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වහන්ස, නිරුවත් පාථිකපුත්‍ර තවුසා ඒ තෙපුල් නො හැරපියා, ඒ සිත නො හැරපියා, ඒ දෘෂ්ටිය නො දුරැ ලා, මා හමුවට එන්නට නො හැක්ක. ඉදින් ‘මම් ඒ තෙපුල් නො හැරපියා, ඒ සිත නො හැරපියා, ඒ දිට් නො දුරැ ලා, මහණ ගොයුම් හමුවට යන්නෙමි’ යි ඔහුට මෙබඳු සිතෙක් වී නම්, ඔහුගේ හිස ද ගිලිහෙතැ’ යි භාග්‍යවතුන් වහන්සේ විසින් මේ වචනය ඒකාන්තයෙන් අවධාරණය කොට (නියත කොට) ම වදාරන ලද සේ යැ. වහන්ස, අචේලක පාථිකපුත්‍ර තෙමෙ ඍද්ධියෙන් වෙස්වළා (සිංහ ව්‍යාඝ්‍රාදීන් බඳු අන් වෙසෙකින්) භාග්‍යවතුන් වහන්සේ වෙතට ආයේ වී නම්, භාග්‍යවතුන් වහන්සේගේ ඒ තෙප්ල බොරු වන්නේ යැ” යි හේ කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "‘සුනක්ඛත්තය, තථාගත තෙමේ සැටියෙන් එකක් වූ, අරුතෙන් වෙනෙකක් වූ, දෑතකට යන බසක් කියන්නේ දැ?’ යි මම් ඇසීමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“කිමෙක් ද වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් ‘අචේලක පාථිකපුත්‍ර තෙම ඒ තෙපුල් නො හැරැපියා, ඒ සිත නොහැරපියා, ඒ දිට් නො දුරැ ලා මා හමුවට එන්නට නො හැක්කැ’ යි ද, එසේ ඒ තෙපුල් නො හැරපියා, ඒ සිත නොහැරපියා, ඒ දිට් නො දුරැ ලා මහාණ ගොයුම් වෙත යන්නෙමි’ යි ඔහුට මෙසේ සිතෙක් වී නම්, ඔහු හිස ද ගිලිහෙතැ’ යි භාග්‍යවතුන් වහන්සේ විසින් සිය සිතින් ඔහු සිත පිරිසිඳැ අචේලක පාථිකපුත්‍රයා දන්නා ලද්දේ ද? නැත හොත්, ‘අචේලක පාථිකපුත්‍ර ඒ තෙපුල් නො හැරපියා … භාග්‍යවතුන් වහන්සේ හමුවට එනු නො හැක්කැ’ යි, … ඉදින් ඒ තෙප්ල නො හැරපියා ... මහණ ගොයුම් හමුවට යන්නෙමි’ යි සිතා යන්නේ නම්, ඔහු හිස ගිලි හෙතැ’ යි දේවතා කෙනෙක් භාග්‍යවතුන් වහන්සේට මෙ පවත් සැළ කළෝ දැ?” යි හේ පුළුවුත.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "25"
            },
            {
                "format": 13,
                "text": "17. “සුනක්ඛත්තය, අචේලක පාථිකපුත්‍රයා ඒ තෙප්ල නො හැරැපියා, ඒ සිත නො හැරැපියා, ඒ දිට් නො දුරැ ලා මා හමුවට එන්නට නො සුදුස්සේ ය. ඉදින් ඔහුට ‘මම් ඒ තෙප්ල නො හැරපියා, ඒ සිත නො හැරපියා, ඒ දිට් නො දුරැ ලා, මහණ ගොයුම් හමුවට යන්නෙමි’ යි මෙසේ සිතක් වතොත්, ඔහුගේ හිස ද ගිලිහෙතැ යි මා සිතින් ඔහු සිත පිරිසිඳැ අචේලක පාථිකපුත්‍රයා මා විසින් දන්නා ලද්දේ ය. දේවතා කෙනෙක් ද ‘වහන්ස, අචේලක පාථිකපුත්‍ර තෙමේ ඒ තෙප්ල නො හැරැපියා, ඒ සිත නො හැරැපියා, ඒ දිට් නො දුරැලා, භාග්‍යවතුන් වහන්සේ හමුවට එන්නට නො සුදුස්සේ ය. ඉදින් ඔහුට ‘මම් ඒ තෙප්ල නො හැරැපියා, ඒ සිත නො හැරැපියා, ඒ දිට් නො දුරැ ලා, ‘මහණ ගොයුම් හමුවට යන්නෙමි’ යි මෙසේ සිතක් වතොත් ඔහු හිස ද ගිලි හෙතැ’යි මෙ පවත මට සැළ කළහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ලිච්ඡවීන්ගේ අජිත නම් සෙනෙවි ද නොබෝ දවස්හි කළුරිය කෙළේ, තවුදිසා දෙව් ලොවැ උපන්නේ ය. හේ ද මා කරා එළැඹ, “වහන්ස, පාථිකපුත්‍ර අචේලක තෙමෙ මුසාබස් දොඩන්නෙක. වහන්ස, ‘ලිච්ඡවීන්ගේ අජිත නම් සෙනෙවි මහ නිරයට වන්හ’ යි පාථිකපුත්‍ර අචේලක තෙමෙ වැදෑගම්හි මා ඇරැබැ ද දෙඩී ය. වහන්ස, මම් මහ නිරයට නො වනිමි. මම් තවුදිසා දෙව්ලොවැ උපනිමි. වහන්ස, පාථිකපුත්‍ර අචේලක අලජ්ජී යැ, පාථිකපුත්‍ර අචේලක මුසාවාදී යැ, වහන්ස, පාථිකපුත්‍ර අචේලක ඒ තෙප්ල නො හැරැපියා, ඒ සිත නො හැරපියා, ඒ දිට් නො දුරැලා, භාග්‍යවතුන් වහන්සේ හමුවට එන්නට නො සුදුස්සේ ය. ඉදින්, ‘මම් ඒ තෙප්ල නො හැරපියා, ඒ සිත නො හැරපියා, ඒ දිට් නො දුරැලා, මහණ ගොයුම් හමුවට යන්නෙමි’ යි ඔහුට මෙසේ සිතක් වතොත් (එසේ යතොත්), ඔහු හිස ද ගිලිහෙතැ“ යි මට සැළ කෙළේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සුනක්ඛත්තය, මෙසේ මා විසින් අචේලක පාථිකපුත්‍ර තෙමෙ ‘ඒ තෙප්ල නො හැරැපියා, ඒ සිත නො හැරැපියා, ඒ දිට් නො දුරැලා මහණ ගොයුම් හමුවට යන්නෙමි’ යි ඔහුට මෙසේ සිතක් වතොත් (එසේ එතොත්), ඔහු හිස ද ගිලිහෙතැ’ යි පාථිකපුත්‍ර තෙමේ ඔහු සිත් මා සිතින් පිරිසිඳ මා විසින් ද දන්නා ලද්දේ වෙයි. දේවතා කෙනෙක් ද ‘වහන්ස, අචේලක පාථිකපුත්‍ර තෙමෙ ඒ තෙප්ල නො හැරපියා, ඒ සිත නො හැරපියා, ඒ දිට් නො දුරැලා, භාග්‍යවතුන් වහන්සේ හමුවට එන්නට නො සුදුස්සේ ය. ඉදින් ඔහුට ‘මම් ඒ තෙප්ල නො හැරැපියා, ඒ සිත නො හැරැපියා, ඒ දිට් නො දුරැලා, මහණ ගොයුම් හමුවට යන්නෙමි’ යි මෙසේ සිතක් වතොත්, (එසේ ම යතොත්) ඔහු හිස ගිලිහෙතැ’ යි ද මට මෙ පවත් සැළ කළහ. සුනක්ඛත්තය, ඒ මම් විසල්පුරැ පිඬු පිණිස හැසිරැ, පසුබත්හි පිඬුපයෙන් පෙරළා ඇක්මුණෙම්, දිවා විහාරය පිණිස, අචේලක පාථිකපුත්‍රයාගේ ආරාමය කරා යන්නෙමි. සුනක්ඛත්තය, දැන තෝ මෙ පවත් යමකුට සළ කරනු රිස්සෙහි නම් ඔහුට සැළ කරව’ යි කීමි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "27"
            },
            {
                "format": 13,
                "text": "",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "18. භාර්‍ගවය, එ කල්හි මම් පෙර වරුයෙහි හැඳ පෙරෙවැ පා සිවුරු ගෙන පිඬු පිණිස විසල්පුරට පිවිසියෙමි. විසල්පුරැ පඬු පිණිස හැසිරැ පිණ්ඩපාතයෙන් පෙරළා ඇක්මුණෙම්, පසුබත්හි දිවාවිහරණය පිණිස අචේලක පාථිකපුත්‍රයාගේ ආරාමය කරා ගියෙමි. භාර්‍ගවය, එ කල්හි ලිච්ඡවීපුත්‍ර සුනක්ඛත්ත තෙම වෙළෙවි වෙළෙවි වැ විසල්පුර වැද, ප්‍රකට ප්‍රකට ලිච්ඡවීන් කරා එළැඹියේය. එළැඹ, ‘ඇවැත්නි, තෙල භාග්‍යවතුන් වහන්සේ විසල්පුරැ පිඬු පිණිස හැසිරැ, පිණ්ඩපාතයෙන් පෙරළා ඇක්මුණාහු පසුබත්හි දිවාවිහරණ පිණිස අචේලක පාථිකපුත්‍රයාගේ ආරාමය කරා වැඩි සේක. ආයුෂ්මත්නි, එහි යවු. සාධු ස්වභාවය ඇති මහණුන්ගේ උතුරු මිනිස් දහමින් ඉදු පෙළහරෙක් වන්නේ යැ’ යි කී ය."
            },
            {
                "format": 13,
                "text": "භාර්‍ගවය, එ විටැ ඒ ප්‍රකට ප්‍රකට ලිච්ඡවීනට, ‘සාධුරූප වූ මහණුන්ගේ උතුරු මිනිස් දහමින් ඉදු පෙළහරක් වන්නේ ල. භවත්නි, දැන් එහි යම්හ’ යි මේ සිත විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති ලිච්ඡවීපුත්‍ර සුනක්ඛත්ත තෙමෙ ප්‍රකට ප්‍රකට නන් තොටු මහණ බමුණන් ද කරා එළැඹැ, ‘ඇවැත්නි, තෙල භාග්‍යවතුන් වහන්සේ විසල් පුරැ පිඬු පිණිස හැසිරැ, පිණ්ඩපාතයෙන් පෙරළා ඇක්මුණාහු, පසුබත්හි දිවාවිහරණය පිණිස අචේලක පාථිකපුත්‍රයාගේ ආරාමයට වැඩි සේක. ආයුෂ්මත්නි, එහි යවු, ආයුෂ්මත්නි, එහි යවු, සාධු ස්වභාවය ඇති මහණුන්ගේ උතුරු මිනිස් දහමින් ඉදු පෙළහරෙක් වන්නේ යැ’ යි සැළ කෙළේ ය. භාර්‍ගවය, එ කලැ ඒ ප්‍රකට ප්‍රකට නන්තොටුවනට, මහණබමුණනට ‘භවත්නි, සාධුරූප වූ මහණුන්ගේ උතුරු මිනිස් දහමින් ඉදු පෙළහරෙක් වන්නේ ල. භවත්නි, දැන් එහි යම්හ’ යි මේ සිත විය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "19. භාර්‍ගවය, එ කලැ ප්‍රකට ප්‍රකට ලිච්ඡවීහු ද, ප්‍රකට ප්‍රකට බමුණු මහසල්හු ද, ගැහැවි මහසල්හු ද, නන් තොටුවෝ ද, මහණබමුණෝ ද පථිකපුත්‍ර අචේලකයාගේ ආරාමය කරා එළැඹියහ. භාර්‍ගවය, ඒ නොයෙක් සිය ගණන් නොයෙක් දහස ගණන් ජනයා ඇති පිරිසෙක් විය. භාර්‍ගවය, පාථිකපුත්‍ර අචේලක තෙමෙ ‘ප්‍රකට ප්‍රකට ලිච්ඡවීන් ආහ යි, ප්‍රකට ප්‍රකට බමුණු මහසලුන් ද ගැහැවි මහසලුන් ද නන් තොටු මහණබමුණන් ද ආහ’ යි, මහණ ගොයුම්හු ද මා අරමෙහි දිවාවිහාර පිණිස හුන්හ යි ද ඇසී ය. ඇසීමෙන් ඔහුට බිය ද තැති ගැන්ම ද ලොමුදහ ගැන්ම ද උපන.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "29"
            },
            {
                "format": 13,
                "text": "20. ‘භාර්‍ගවය, එ කලැ වනාහි අචේලක පාථිකපුත්‍ර තෙමේ බිය පත් වූයේ, බියෙන් කලකිරුණේ, උපන් ලොමුදහ ගැනුම් ඇත්තේ, තින්දුඛාකණු පරිව්‍රාජකයාගේ (තිඹිරිකණු පිරිවැජ්ජාගේ) ආරාමය කරා ගියේ ය. භාර්‍ගවය, අචේලක පාථිකපුත්‍ර තෙමේ බිය පත්තේ, බියෙන් කලකිරුණේ, හටගත් ලොමුදහ ගැනුම් ඇත්තේ, තිඹිරිකණු පිරිවැජ්ජාගේ ආරාමය කරා ගියේ ලැ’ යි ඒ පිරිස ඇසූහු ම ය. භාර්‍ගවය, ඉක්බිති එ පිරිස එක් පුරුෂයකු බණවා, ‘භවත් පුරුෂය, මෙහි එව, තිඹිරිකණු පිරිවැජ්ජාගේ අරමට, අචේලක පාථිකපුත්‍රයා වෙතට යා. ගොස්, අචේලක පාථිකපුත්‍රයාට, ‘ඇවැත් පාථිකපුත්‍රයෙනි, නැඟී එවු. ප්‍රකට ප්‍රකට ලිච්ඡවීහු ඔබ අරමැ රැස් වූහ. ප්‍රකට ප්‍රකට බමුණු මහසල්හු ද ගැහැවි මහසල්හු ද නන්තොටුවෝ ද මහණබමුණෝ ද (ඔබ අරමැ) රැස් වූහ. මහණ ගොයුම්හු ද ආයුෂ්මතුන්ගේ ආරාමයෙහි දිවාවිහරණය පිණිස අවුත් උන්හ. ඇවැත් පාථිකපුත්‍රයෙනි, විසල්පුරැ පිරිස් මැදැ දී ඔබ විසින් “මහණ ගොයුම් ඥානවාද ඇත්තේ ය, මම් ද ඥානවාද ඇතියෙමි. ඥානවාද ඇත්තේ ඥානවාද ඇත්තකු හා උතුරු මිනිස් දහමින් ඉදු පෙළහර දක්වන්නට සුදුස්සේ ය. මහණ ගොයුම් වාද පිණිස අඩ මඟක් එන්නේ නම්, මමත් අඩ මඟක් ඉදිරියට යන්නෙමි. එහිදී ඒ අපි දෙ දෙනා ම උතුරු මිනිස් දහමින් ඉදු පෙළහර කරන්නමු. මහණ ගොයුම් උතුරු මිනිස් දහමින් එක් ඉදු පෙළහරක් කරන්නේ නම්, මම් ඉදු පෙළහර දෙකක් කරන්නෙමි. මහණ ගොයුම් උතුරු මිනිස් දහමින් ඉදු පෙළහර දෙකක් කරන්නේ නම්. මම් සතරක් කරන්නෙමි, මහණ ගොයුම් උතුරු මිනිස් දහමින් ඉදු පෙළහර සතරක් කරන්නේ නම්, මම් අටක් කරන්නෙමි. මෙසේ මහණ ගොයුම් උතුරු මිනිස් දහමින් යම් පමණ පෙළහර කරන්නේ ද, මම් එමෙන් දෙගුණ දෙගුණ ඉදු පෙළහර කරන්නෙමි” යි මෙ තෙපුල් කියන ලද්දේ ය. “ඇවැත් පාථිකපුත්‍රයිනි, අඩ මඟක් නැඟී එවු. හැමට පළමු ම මහණ ගොයුම්හු අවුත්, ආයුෂ්මතුන්ගේ ආරාමයෙහි දිවාවිහරණය පිණිස ඉන්නාහ’ යි මෙසේ කියව” යි කියා යැවූහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "31"
            },
            {
                "format": 13,
                "text": "භාර්‍ගවය, ‘එසේ යැ භවත්නි’ යි කියා ම ඒ පුරුෂ තෙම එ පිරිසට පිළිවදන් දී, තිඹිරිකණු පිරිවැජ්ජාගේ අරම කරා, අචේලක පාථිකපුත්‍රයා වෙතට ගියේ ය. ගොස් ඔහු බණවා, ‘ඇවැත් පාථිකපුත්‍රයිනි, නැඟී එවු. ප්‍රකට ප්‍රකට ලිච්ඡවීහු ද අවුත් රැස් වූවාහු වෙත්, ප්‍රකට ප්‍රකට බමුණු මහසල්හු ද ගැහැවි මහසල්හු ද නන් තොටුවෝ ද මහණබමුණෝ ද අවුත් රැස් වූවාහු වෙත්. මහණ ගොයුම්හු ද ආයුෂ්මතුන්ගේ ආරාමයෙහි දිවාවිහරණය පිණිස අවුත් උන්නාහු වෙත්. ඇවැත්නි, ඔබ විසින් විසල්පුරැ පිරිස් මැදැ දී ‘මහණ ගොයුම් ද ඥානවාද ඇත්තේ ය, මම් ද ඥානවාද ඇත්තෙමි. ඥානවාද ඇත්තේ වූ කලි ඥානවාද ඇත්තක්හු හා උතුරු මිනිස් දහමින් ඉදු පෙළහර දක්වන්නට සුදුස්සේ ය, මෙසේ යම් පමණ මහණ ගොයුම් උතුරු මිනිස් දහමින් ඉදු පෙළහර කරන්නේ ද, එමෙන් දෙගුණ දෙගුණ මම් ඉදු පෙළහර කරන්නෙමි යි මේ තෙප්ල කියන ලද්දේ ය. ඇවැත්නි, පාථිකපුත්‍රයෙනි, අඩ මඟක් නැඟී එවු. හැමට පෙරාතු ව ම මහණ ගොයුම්හු අවුත් ආයුෂ්මතුන්ගේ ආරාමයෙහි දිවාවිහරණ පිණිස ඉන්නාහු වෙති” යි කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "21. භාර්‍ගවය, ඔහු මෙසේ කී කලැ පාථිකපුත්‍ර අචේලක තෙමේ ‘ඇවැත්නි එමි, ඇවැත්නි, එමි’ යි කියා එතැන ම ගැලී, ඒ මේ අතට සැලෙයි. හුන තැනින් නැඟෙන්නට ද නො හැකි වෙයි. භාර්‍ගවය, ඉක්බිති ඒ පුරුෂ තෙමේ අචේලක පාථිකපුත්‍රයාට, “ඇවැත් පාථික පුත්‍රයෙනි, කිමෙක් ද? ඔබේ හිද්මඇට හුන් තැනැ ඇලුණේ ද? ඔබ හුන් තැන හෝ ඔබේ හිද්මඇටෙහි ඇලුණේ ද? ‘ඇවැත්නි එමි, ඇවැත්නි එමි’ යි කියා ඔහි ම ගැලී ඒ මේ අතට සැලෙති. හුනසනෙන් නැඟෙන්නට දු නොහැකි වෙති” යි කීය.\nභාර්‍ගවය, අචේලක පාථිකපුත්‍ර තෙමේ මෙසේ කියනු ලබන්නේ ද, ‘ඇවැත්නි එමි, ඇවැත්නි එමි’ යි කියා එහි ම ගැලී ඒ මේ අතට සැලෙයි, හුනස්නෙනුදු නැංග නො හෙයි. ඒ පුරුෂ තෙම “මේ අචේලක පාථිකපුත්‍රයා පැරැදුණු සැහැවි (හෝ නටුවාවු සැහැවි) ඇත්තේ ය: ‘ඇවැත්නි එමි, ඇවැත්නි එමි’ කියා එහි ම ගැලී ඒ මේ අත සැලෙයි. හුනස්නෙනුදු නො නැංග හේ’ යැ යි යම් විටෙක දැනගත්තේ ද, එ විට ඒ පිරිස කරා අවුත්, ‘භවත්නි, මේ අචේලක පාථිකපුත්‍ර පැරැදුණු සැහැවි ඇත්තේ ය, ‘ඇවැත්නි එමි, ඇවැත්නි එමි’ යි එතැනැ මැ ගැලී ඒ මේ අත සැලෙයි. හුනස්නෙනුදු නො නැංග හේ’ යැ යි මෙසේ සැළ කෙළේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භාර්‍ගවය, ඔහු මෙසේ කී කල්හි, මම් ඒ පිරිස බණවා, ‘ඇවැත්නි, අචේලක පාථිකපුත්‍ර තෙමෙ ඒ තෙප්ල නො හැරපියා, ඒ සිත නො හැරපියා, ඒ දිට් බැහැරැ නො කොට, මා හමුවට එන්නට නො සුදුසු ය. ඉදින් ඔහුට, ‘මම් ඒ තෙප්ල නො පියා, ඒ සිත නො පියා, ඒ දිට් බැහැර නො කොට, මහණ ගොයුම්හු හමුවට යන්නෙමි’ යි මෙසේ සිතෙක් වන්නේ නම, ඔහුගේ හිස ද ගිලිහෙන්නේ යැ’ යි මෙ පවත් කීමි.",
                "type": "paragraph"
            },
            {
                "format": 22,
                "text": "පළමු බණවර නිමියේ ය.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "33"
            },
            {
                "format": 13,
                "text": "22. භාර්‍ගවය, එ කලැ එක්තරා ලිච්ඡවී මහ ඇමැත්තෙක් හුනස්නෙන් නැඟ, ඒ පිරිස අමතා, “භවත්නි, එසේ වී නම්, මා ගොස් එන තාක් තව මොහොතක් බලවු. මමත් ගොස් අචේලක පාථිකපුත්‍රයා මෙ පිරිස කරා ගෙන එන්නට හැකි වීම් නම්, ඒ ඉතා යෙහෙකැ” යි කීය. භාර්‍ගවය, ඉක්බිති ඒ ලිච්ඡවී මහ ඇමැත්තා තිඹිරිකණු පිරිවැජියා අරමට, අචේලක පාථිකපුත්‍රයා වෙතට ගියේ ය. ගොස් ඔහු අමතා, ‘ඇවැත් පාථිකපුත්‍රයෙනි, නැඟී එන්න. ඔබ නැඟී ආවොත් ඒ මැනැව. ප්‍රකට ප්‍රකට ලිච්ඡවීහු අවුත් රැස් වැ උන්නාහ ... මහණ ගොයුම්හු ද ආයුෂ්මතතුන්ගේ ආරාමයෙහි දිවාවිහරණ පිණිස හුන්හ. ඇවැත්නි, පාථිකපුත්‍රයෙනි, ‘මහණ ගොයුම් ද ඥානවාද ඇත්තේ ය, මම් ද ඥානවාද ඇත්තෙමි ... මම් එ මෙන් දෙගුණයක් දෙගුණයක් ඉදු පෙළහර කරන්නෙමි’ යි විසල් පුරැ පිරිසෙහි මේ තෙප්ල ඔබ විසින් කියන ලද ය. ඇවැත්නි, පාථිකපුත්‍රයෙනි, අඩමඟක් නැඟී එන්න. මහණ ගොයුම්හු හැමට පළමු ම අවුත් ආයුෂ්මතුන්ගේ ආරාමයෙහි දිවාවිහරණ පිණිස හුන්හ. ඇවැත්නි, පාථිකපුත්‍රයෙනි, ‘අචේලක පාථිකපුත්‍රයා ඒ වචනය නො හැරපියා, ඒ සිත නො හැරපියා, ඒ දිට් බැහැර නො කොට මා හමුවට එන්නට නො නිස්ස. ඉදින් ඔහුට, ‘එ වචන නො හැරපියා, ඒ සිත නො හැරපියා, ඒ දිට් බැහැර නො කොට මහණ ගොයුම් හමුවට යන්නෙමි’ යි මෙසේ සිතක් වුවොත් ඔහු හිස ද ගිලිහෙතැ’ යි මහණ ගොයුමන් විසින් පිරිස මැදැ මේ චචනය කියන ලද ම ය. ඇවැත්නි, පාථිකපුත්‍රයෙනි, නැඟී එන්න. නැඟී ඊම් පමණින් ඔබට ජය ලබවන්නමු, මහණ ගොයුමනට පරාජය කරන්නමු” යි මෙ තෙපුල් කීය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භාර්‍ගවය, ඔහු එසේ කී කල්හි අචේලක පාථිකපුත්‍ර ‘ඇවැත්නි එමි, ඇවැත්නි එමි’ යි කියා එහි ම ගැලී සැලෙයි. හුනස්නෙනුදු නො නැංග හෙයි. භාර්‍ගවය, එ කල්හි ලිච්ඡවී මහ ඇමැති අචේලක පාථිකපුත්‍රයා බණවා “කිමෙක් ද ඇවැත්නි පාථිකපුත්‍රයෙනි, ඔබ හිද්මඇට හුන්තැන්හි ඇලී ගත්තේ ද? නැත හොත් හුන් තැන ඔබ හිද්මෙහි ඇලීගත්තේ ද? ‘එමි ඇවැත්නි, එමි ඇවැත්නි’ යි කියා එහි ම ගැලී සැලෙති, හුන් තැනිනුදු නො නැංග හෙති” කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භාර්‍ගවය, මෙසේ කියනු ලබනුයේ ද අචේලක පාථිකපුත්‍ර ‘ඇවැත්නි එමි, ඇවැත්නි එමි’ යි එහිම ගැලී සැලෙයි. හුනස්නෙනුදු නො නැංගැ හෙයි. භාර්‍ගවය, ඒ ලිච්ඡවී මහමැති තෙමෙ ‘මේ අචේලක පාථිකපුත්‍ර පැරැදුණු සැහැවි ඇතියේ ය. ‘එමි ඇවැත්නි, එමි ඇවැත්නි’ යි එහි ම ගැලී සැලෙයි, හුනස්නෙනුදු නො නැංගැ හේ’ යැ යි දත් කෙණෙහි ම ඒ පිරිස කරා අවුත් භවත්නි, අචේලක පාථික පුත්‍ර පැරැදුණු සැහැවි ඇත්තේ, ‘ඇවැත්නි එමි, ඇවැත්නි එමි’ යි එහි ම ගැලී සැලෙයි, හුනස්නෙන් නො නැංග හේ’ යැ යි සැළ කෙළේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "35"
            },
            {
                "format": 13,
                "text": "23. භාර්‍ගවය, ඔහු එසේ කී කලැ මම් ඒ පිරිස අමතා, “ඇවැත්නි, අචේලක පාථිකපුත්‍ර ඒ තෙප්ල නො හැරපියා ... මා හමුවට එන්නට නො නිස්ස. ඉදින් ඔහුට ‘මම් ඒ තෙප්ල නො හැරපියා ... මහණ ගොයුම් හමුවට යන්නෙමි’ යි මෙසේ සිතක් වතොත්, ඔහු හිස ද ගිලිහෙන්නේ ය. ඉදින් ආයුෂ්මත් ලිච්ඡවීනට ‘අපි අචේලක පාථිකපුත්‍රයා වර පටින් බැඳ ගොනුන් යෙදූ වියෙන් ඇද ගෙන එන්නමු’ යි මෙසේ සිතක් වතොත්, ඒ වරපට සිඳෙන්නේ ය. බන් තැනින් පාථිකපුත්‍ර හෝ බිඳී වෙන් වන්නේ ය. හේ තෙප්ල හො හැරපියා … මා හමුවට එන්නට නො නිස්ස. ඉදින් ‘මම් ඒ තෙප්ල නො හැරපියා … මහණ ගොයුම් හමුවට යන්නෙමි’ යි ඔහුට මෙසේ සිතක් වතොත් ඔහුගේ හිස ද ගිලිහේනේ යැ’ යි කීමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භාර්‍ගවය, එ කල්හි දාරුපාත්‍රික පිරිවැජියක්හු අතැවැසි ජාලිය නමැත්තෙක් හුනස්නෙන් නැඟී, “භවත්නි, එසේ වී නම් මා එන තුරු මොහොත්තමක් බලවු. අචේලක පාථිකපුත්‍රයා මෙ පිරිස කරා ගෙන එන්නට මම් වත් හැකි වීම් නම් යෙහෙකැ’ යි කී ය. භාර්‍ගවය, ඉක්බිති දාරුපාත්‍රික පිරිවැජ්ජහු අතැවැසි ජාලිය තෙමේ තිඹිරිකණු පිරිවැජ්ජා අරම යම් තැනෙක ද, (එහි) අචේලක පාථිකපුත්‍රයා යම් තැනෙක ද එ තැනට ගියේ ය. ගොස් ඔහු බණවා, ‘ඇවත් පාථිකපුත්‍රයෙනි, නැඟී එවු. ඔබ නැඟී අව උතුම. ප්‍රකට ප්‍රකට ලිච්ඡවීහු … අවුත් රැස් වැ ඉඳිති. මහණ ගොයුම්හු ද දිවාවිහරණ පිණිස අවුත් ආයුෂ්මතුන්ගේ ආරාමයෙහි උන්නාහු වෙත්. ඇවැත්නි, ඔබ විසින් විසල්පුරැ මහ පිරිස් මැදැ දී ‘මහණ ගොයුම් ද ඥානවාද ඇත්තේ ය, මම් දු ඥානවාද ඇත්තෙමි … ඔහු එක් ඉදු පෙළහරක් කළ විට මම් එ මෙන් දෙ ගුණයක් දෙ ගුණයක් ඉදු පෙළහර කරන්නෙමි’ යි මේ වචන කියන ලදුයේ ම ය. ඇවැත්නි, පාථිකපුත්‍රයෙනි, අඩ මඟක් නැඟී එවු. මහණ ගොයුම්හු හැමට පෙරාතු වැ මැ අවුත් ආයුෂ්මතුන්ගේ ආරාමයෙහි දිවාවිහරණ පිණිස උන්නාහු වෙත්. ඇවැත් පාථිකපුත්‍රයෙනි, මහණ ගොයුමන් විසින් ‘අචේලක පාථිකපුත්‍ර ඒ තෙප්ල නො හැරපියා, ඒ සිත නො හැරපියා … මා හමුවට එන්නට නො නිස්ස. ඉදින් ‘මම් ඒ තෙප්ල නො හැරපියා … මහණ ගොයුම් හමුවට යන්නෙමි’ යි ඔහුට සිතක් වතොත්, ඔහු හිස ද ගිලිහෙන්නේ ය. ඉදින් ආයුෂ්මත් ලිච්ඡවීනටත් ‘අපි අචේලක පාථිකපුත්‍රයා වර පටින් බැඳ ගවයන් යෙදූ වියෙන් ඇදැ ගෙන එන්නමු’ යි මෙසේ සිතෙක් වී නම් (එසේ කරන්නට තැත් කරන්නාහු නම්), ඒ වරපට සිඳී යන්නේ ය, පාථිකපුත්‍රයා හෝ බන් තැනින් බිඳී වෙන් වන්නේ ය. අචේලක පාථිකපුත්‍රයාට ‘ඒ තෙප්ල නො පියා, ඒ සිත නො පියා, ඒ දිට් බැහැරැ නො කොට මහණගොයුම් හමුවට යන්නෙමි’ යි මේ සිත වතොත් ඔහු හිස ගිලිහෙන්නේ යැ’ යි මහපිරිස මැද මෙ බස් තෙපලන ලද්දේ ය. ඇවැත්නි, පාථිකපුත්‍රයෙනි, නැඟී එවු, නැඟී ඊමෙන් ම ඔබට ජය ද මහණ ගොයුම්හට පරාජය ද ලබවන්නමු’ යි කී ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "37"
            },
            {
                "format": 13,
                "text": "භාර්‍ගවය, එසේ කී කල්හි අචේලක පාථිකපුත්‍ර තෙමේ ‘එමි ඇවැත්නි, එමි ඇවැත්නි’ යි එහි ම ගැලී සැලෙයි. හුනස්නෙන් නැඟෙනු ද නො හැකි වෙයි. භාර්‍ගවය, එ කල්හි දාරුපාත්‍රිකාන්තේවාසී ජාලිය තෙමේ අචේලක පාථිකපුත්‍රයා අමතා, ‘ඇවැත්නි, පාථිකපුත්‍රයෙනි, කිමෙක් ද? ඔබේ හිද්මඇට හුනස්නැ ඇලීගත්තේ ද? හුනස්න හෝ ඔබ හිද්ම ඇටෙහි ඇලීගත්තේ ද? ‘ඇවැත්නි එමි, ඇවැත්නි එමි’ යි උන් තැන්හිම ගැලී සැලෙහු. හුනස්නෙන් නැඟෙන්නට දු නො හැක්කහු’ යැ යි කී ය. භාර්‍ගවය, එසේ කියනු ලබනුයේ ද, අචේලක පාථිකපුත්‍ර තෙමේ ‘එමි ඇවැත්නි, එමි ඇවැත්නි’ යි උන් තන්හි ම ගැලී සැලෙයි, හුනස්නෙන් නැඟෙනුවටදු නො හැකි වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භාර්‍ගවය, දාරුපාත්‍රකාන්තේවාසී ජාලිය තෙම ‘මේ අචේලක පාථිකපුත්‍ර පැරැදුණු සැහැවි ඇත්තේ ය. ‘ඇවැත්නි එමි, ඇවැත්නි එමි’ යි කියා එහි ම ගැලී සැලෙයි, හුනස්නෙන් නැඟෙනුවටදු නො හැකි වේ’ යැ යි දැනගත් කෙණෙහි, ඔහුට මෙ තෙපුල් කී ය:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "24. “ඇවත් පාථිකපුත්‍රයෙනි පෙරැ වූවක් කියම්. මෘගරාජ වූ එක්තරා සිංහයකුට කිසි වන ලැහැබක් නිසා ලැග්මක් කැරැගන්නෙම් වීම් නම් යෙහෙක, එහි ලැග සවස් වේලේ ඒ ලැග්මෙන් නික්මෙන්නෙම් නම්, එසේ නික්මැ වැජඹෙන්නෙම් නම්, වැජැඹැ හාත්පස සිවු දිසා බලන්නෙම් නම්, හාත්පසැ සිවු දිසා බලා, තෙවරක් සිංහනාද කරන්නෙම් නම්, තෙවරක් සිංහනාද කොට ගොදුරු පිණිස බැහැරැ යන්නෙම් නම්, මුව මුළුව අතුරෙන් හොඳ හොඳ මුවකු මරා මොළොක් මොළොක් මස් කා, ඒ ලැග්මට පෙරළා යන්නෙම් නම් යෙහෙකැ’ යි මේ සිත විය. එයින් පසු මෘගරාජ වූ ඒ සිංහ තෙමෙ එක්තරා වන ලැහැබක් නිසා ලැගුම් ගත. එහි සවස් වේලෙහි ඒ ලැග්මෙන් නික්මිණ. ලැග්මෙන් නික්මැ වැජැඹිණ. වැජැඹැ හාත්පස සිවු දිසා බැලී ය. හාත්පස සිවු දිසා බලා, තුන් වරක් සිංහනාද කෙළේ ය. තුන් වරක් සිංහනාද කොට, ගොදුරු සඳහා බැහැර ගියේ ය. හේ මුවමුළුව අතුරෙන් උතුම් උතුම් මුවකු මරා, මොළොක් මොළොක් මස් කා, ඒ ලැග්මට ම පෙරළා ආයේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "39"
            },
            {
                "format": 13,
                "text": "ඇවැත් පාථිකපුත්‍රයෙනි, මෘගරාජ වූ ඒ සිංහයාගේ විඝාසයෙහි (කා ඉතිරිකළ දැයින්) වැඩුණු මහළු කැණහිලෙක් දෘප්ත (දැපුණේ) ද ශක්තිමත් ද විය. එ කල්හි ඒ මහළු කැණහිලුට ‘මම් කවරෙම් ද! මෘගරාජ වූ සිංහ කවරේ ද? මමත් එක්තරා වනලැහැබක් නිසා තිත්පලක් කැරැ ගන්නෙම් නම්, එහි ලැග සවස් වේලේ තිත්පොලෙන් නික්මෙන්නෙම් නම්, එසේ නික්මැ වැජඹෙන්නෙම් නම්, වැජැඹැ හාත්පසැ සිවු දිග බලන්නෙම් නම්, හාත්පසැ සිවු දිග බලා තුන් යලක් සිංහනාද කරන්නෙම් නම්, තුන් යලක් සිංහනාද කොට ගොදුරු සඳහා පිටත් වැ යන්නෙම් නම්, ඒ මම් මුවමුළුයෙන් සොඳුරු සොඳුරු මුවකු මරා මොළොක් මොළොක් මස් කා තිත්පොලට ම එළැඹෙන්නෙම් නම් යෙහෙකැ’ යි මේ සිත විය. ඇවැත්නි, ඉක්බිති ඒ මහළු කැණහිල් එක්තරා වනලැහැබක් නිසා ලැගුම් ගත්තේ ය. ලැගුම් ගෙන සවස් වේලෙහි ඒ තිත්පොලෙන් නික්මියේ ය. තිත්පොලෙන් නික්මැ වැජැඹුණේ ය. වැජැඹැ හාත්පස සිවු දිග බැලී ය. හාත්පසැ සිවු දිග බලා ‘සිංහනාද කරන්නෙමි’ යි තුන් යලක් කැණහිල් හඬ ම හැඬී ය. නොමනා හඬක් ම හැඬී ය. ලාමක සිවලා කවරේ ද! සිංහනාදය කවරේ ද!! (මොවුන් දෙදනාගේ කවර සමතාවෙක් ද!) ඇවැත් පාථිකපුත්‍රයෙනි, ඒ කැණහිලු සේ ම තෙපි සුගතයන් වහන්සේට නියමිත වූ පසය නිසා ජීවත් වන්නහු, සුගතයන් වහන්සේ වළඳා ඉතිර වූ දෑ වළඳන්නහු, ‘ඒ තථාගත අර්හත් සම්‍යක්සම්බුද්ධයන් හා ගැටියැ යුතු යැ’ යි සිතවු ද? ලාමක වූ පාථිකපුත්‍රයා කවර යැ! තථාගත අර්හත් සම්‍යක්සම්බුද්ධයන් හා (ඉදුපෙළහර කරමි යි) ගැටෙනු කවර යැ!” (යනු යි)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භාර්‍ගවය, යම් හෙයකින් දාරුපාත්‍රිකාන්තේවාසී ජාලිය තෙමෙ මේ උපමායෙන් අචේලක පාථිකපුත්‍රයා ඒ අස්නෙනුදු ඉවත් කරන්නට නො හැකි වී ද, එ හෙයින් හේ ඔහුට මෙය (මතු දැක්වෙන පරිදි) කී ය: “සිවලෙක් තමා දෙස බලා ‘මම් මෘගරාජ වූ සිංහයෙමි’ යි සිතී ය. එසේ ම හේ සිවල් හඬම හැඬීය, සිවල් හඬම හැඬීය. ලාමක සිවල් හඬ කවර යැ! සිංහනාදය කවර යැ!",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "පාථිකපුත්‍රයෙනි, එසේ ම තෙපි සුගතයනට නිසි පසයෙන් දිවි පවත්වනුවෝ, සුගතයන් ඉතිරි කළ දෑ වළඳනුවෝ, ඒ තථාගත අර්හත් සම්‍යක්සම්බුද්ධයන් හා ගැටියැ යුතු කොට සිතවු ද? නීච පාථිකපුත්‍රයෝ කවුරු යැ! තථාගත අර්හත් සම්‍යක්සමබුද්ධයන් හා ඔවුන් ගැටෙනු කවර යැ!”",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "25. භාර්‍ගවය, දාරුපාත්‍රිකාන්තේවාසී ජාලිය තෙම මේ උපමායෙනුත් අච්ලක පාථිකපුත්‍රයා එ අස්නෙන් සොලොවන්නට යම් හෙයකින් නො හැකි වී ද, එ හයින් ඔහුට මෙ බස් ද තෙප්ලී ය:",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "41"
            },
            {
                "format": 13,
                "text": "‘කැණහිල් තෙමෙ වෙනෙහි හැවිදුනේ, තර වූ තම සිරුරැ පළිබිඹුව ඉඳුල්දිය පිරි දිය වළෙකැ දැක, යම් තාක් ‘තමා සිංහයාගේ ඉඳුල් කා වැඩුණෙකැ’ යි නො දක්නේ ද, ඒ තාක් ම තමා සිංහයකුට බඳු බල ඇත්තෙකැ යි (ව්‍යාඝ්‍ර සමාන බල ඇත්තෙකැ යි) සිතී. එසේ ම හේ කැණැහිල් හඬ ම හැඬී ය. ලාමක සිවල් හඬ කවර යැ! සිංහනාදය කවර යැ!’",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“ඇවැත් පාථිකපුත්‍රයෙනි, තෙපි එසේ ම සුගතයනට නියමිත පසයෙන් දිවි පවත්වනුවෝ, සුගතයන් ඉතිරි කළ දෑ වළඳනුවෝ ඒ තථාගත අර්හත් සම්‍යක්සමබුද්ධයන් හා ගැටියැ යුතු කොට සිතවු ද? ලාමක පාථිකපුත්‍ර කවර යැ! තථාගත අර්හත් සම්‍යක්සම්බුද්ධයන් හා ගැටෙනු කවර යැ!”",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "26. භාර්‍ගවය, දාරු පාත්‍රිකාන්තේවාසී ජාලිය තෙමේ මේ උපමායෙනුත් අචේලක පාථික පුත්‍රයා ඒ අස්නෙන් ඉවත් කරන්නට යම් හෙයෙකින් නො හැකි වී ද, එ හෙයින් ඔහුට මෙ තෙපුල් තෙප්ලී ය:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“මහ වෙනෙහි, සිංහව්‍යාඝ්‍රාදීන්ගෙන් හිස් වූ වෙනෙහි මැඩියන් ද කලවිටි බිල්හි වූ මීයන්ද සොහොන්හි ලූ මළ කුණු ද කා මහත් වැ වඩුණු කැණැහිල් තෙමේ ‘මම් මෘගරාජයයමි’ යි සිතී. එසේ ම (සිංහ නාද යැ යි සිතා) කැණැහිල් හඬ ම හැඬී. නීච කැණහිල්හඬ කවරයැ! සිංහනාදය කවර යැ!”",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "පාථිකපුත්‍රයෙනි, මෙසේ ම තෙපි සුගතයනට නියමිත පසය නිසා දිවි රක්නහු, සුගතයන් ඉතිරි කළ දෑ වළඳන්නහු, තථාගත අර්හත් සම්‍යක්සම්බුද්ධයන් හා ගැටිය යුතු සේ සිතහු. ලාමක පාථිකපුත්‍ර කවර යැ! තථාගත අර්හත් සම්‍යක්සම්බුද්ධයන් හා ගැටෙනු කවර යැ!”",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": ""
            },
            {
                "type": "paragraph",
                "text": ""
            },
            {
                "type": "page-break",
                "text": "43"
            },
            {
                "type": "paragraph",
                "text": "27. භාර්‍ගවය, දාරුපාත්‍රිකාන්තේවාසී ජාලිය තෙම මේ උපමායෙනුත් අචේලක පාථිකපුත්‍රයා ඒ හුන් තැනින් ඉවත් කරන්නට යම් විටෙක නොහැකි වී ද, එ විට ඒ පිරිස් වෙත අවුත්, ‘භවත්නි, අචේලක පාථිකපුත්‍රයා පැරැදුණු සැහැවී ඇත්තේ ය. ‘ඇවැත්නි එමි, ඇවැත්නි එමි’ යි එතන්හි ම ගැලී ඒ මේ අතැ සැලෙයි. හුනස්නෙන් නැඟෙන්නට ද නොහැකි වේ යැ’ යි සැළ කෙළේ ය. භාර්‍ගවය, ඔහු මෙසේ කී කලැ මම් ඒ පිරිසට මේ වචන කීමි:"
            },
            {
                "format": 13,
                "text": "“ඇවැත්නි, අචේලක පාථිකපුත්‍ර ඒ තෙප්ල නො හැරපියා, ඒ සිත නො හැරපියා, ඒ දිට් බැහැර නො කොට, මා හමුවට එන්නට නො නිසි ය. ඉදින් ‘මම් ඒ තෙපුල් නො පියා, ඒ සිත නො පියා, ඒ දිට් බැහැර නො කොට, මහණ ගොයුම් හමුවට යන්නෙමි’ යි ඔහුට මෙසේ සිතක් වතොත් (එසේ එන්නට තැත් කළ හොත්), ඔහු හිස ද ගිලිහෙන්නේ ය. ඉදින් ආයුෂ්මත් ලිච්ඡවීනට, ‘අපි අචේලක පාථිකපුත්‍රයා වර පටින් බැඳ ගොනුන් බැඳි වියෙන් ඇද ගෙන එම්හ’ යි මෙසේ සිතක් වුවොත් (එයට තැත් කළ හොත්), ඒ වරපට හෝ සිඳෙන්නේ ය, පාථිකපුත්‍රයා හෝ ඒ වර පට කෙරෙන් කැඩී වෙන් වන්නේ ය. අචේලක පාථිකපුත්‍ර ඒ තෙප්ල නො පියා, ඒ සිත නො පියා, ඒ දිට් බැහැර නො කොට මා හමුවට එන්නට නො නිසි ය. ඉදින් ඔහුට ‘මම් ඒ තෙප්ල නො පියා, ඒ සිත නො පියා, ඒ දිට් බැහැර නො කොට මහණ ගොයුම් හමුවට යන්නෙමි’ යි මේ සිත වී නම්, (එයට තැත් කෙළේ නම්), ඔහු හිස ද ගිලිහෙන්නේ ය” (යනුයි).",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "28. භාර්‍ගවය, ඉක්බිති මම් ඒ පිරිසට දැහැමි කතායෙන් කරුණු දක්වා කීම්, කී දෑ සමාදන් කැරැවීමි (ගැන්වීමි), එහි ඔවුන් සිත් තියුණු කෙළෙමි, එහි ඔවුන් තුටු පහටු කෙළෙමි. ඒ පිරිසට දැහැමි කතායෙන් කරුණු දක්වා, දැක්වූ කරුණු ගන්වා, එහි ඔවුන් සිත් තියුණු කොට, එහි ඔවුන් තුටු පහටු කොට, මහ කෙලෙස් බැම්මෙන් ඔවුන්ගේ මිදීම සිදු කොට, සුවාසූ දහසක් ප්‍රාණීන් මහා විදුර්‍ගයෙන් (කාමාදි සතර ඔඝයෙන්) ගොඩ ලා, තේජෝධාතු සමාපත්තියට සමවැද, සත් තලක් අහස් නැඟ, අන් සත් තලක් ද උසට ගිනි දැල් මවා, දිලිහී දුමා, මහ වෙනෙහි කුළාර හලැ පිහිටියෙමි. භාර්‍ගවය, එ කලැ ලිච්ඡවීපුත්‍ර සුනක්ඛත්ත තෙමෙ මා කරා එළැඹියේ ය. එළැඹ මා වැඳ පසෙක හුන්නේ ය. පසෙක හුන් ලිච්ඡවීපුත්‍ර සුනක්ඛත්තයා, බණවා ‘සුනක්ඛත්තය, එය කිමැයි සිතයි ද? මම් තට අචේලක පාථිකපුත්‍රයා ඇරැබැ කී නියායෙන් ම එය නිපන්නේ ද? නැත හොත් අන් නියායෙකින් වී දැ?’ යි පුළුවතිමි. ‘වහන්ස, භාග්‍යවතුන් වහන්සේ අචේලක පාථිකපුත්‍රයා ඇරැබැ මට වදාළ නියායෙන් ම එය නිපන. අන් සැටියෙකින් එය නො වී යැ’ යි හේ කීය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "45"
            },
            {
                "type": "paragraph",
                "text": "‘සුනක්ඛත්තය, එය කිමැ යි සිතයි ද? මෙසේ වන කලැ උතුරු මිනිස් දහමින් ඉඳු පෙළහර කරන ලද ද? නො කරන ලද දැ?’ යි පුළුවතිමි."
            },
            {
                "format": 13,
                "text": "“වහන්ස, මෙසේ වන කලැ ඒකාන්තයෙන් උතුරු මිනිස් දහමින් ඉදු පෙළහර කරන ලදු යේ ය. නො කරන ලදු යේ නොවේ” යි හේ කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“හිස් පුරුෂය, මෙසේත් උතුරු මිනිස් දහමින් පෙළහර කරන මට, ‘වහන්ස, භාග්‍යවතුන් වහන්සේ මට උතුරු මිනිස් දහමින් ඉදු පෙළහර නො කරන සේකැ’ යි කීයෙහි, හිස් පුරුෂය, බලව, තා විසින් මේ කොතරම් මහ වරදෙක් කරන ලද දැ?” යි ඔහුට කීමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භාර්‍ගවය, මෙසේත් මා විසින් කියනු ලබනුයේ ද ලිච්ඡවීපුත්‍ර සුනක්ඛත්ත තෙමේ අපායට නිස්සක්හු, නිරයට සුදුස්සක්හු සෙයින් මෙ දහම්විනයෙන් (මෙ සස්නෙන්) බැහැරැ වැ ගියේ මැ ය.",
                "type": "paragraph"
            },
            {
                "format": 21,
                "text": "අග්ගඤ්ඤ ප්‍රඥප්ති කථාව",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 13,
                "text": "29. භාර්‍ගවය, මම් අග්ගඤ්ඤය ද (ලෝකෝත්පත්ති වංශ කථාව ද) දනිමි. එය ද දනිමි. එ මතු නොව එයින් මත්තෙහි දෑත් දනිමි. එය දන්නෙම් ද (ඒ දැන්ම තෘෂ්ණා දෘෂ්ටි මාන වශයෙන්) පරාමර්ශනය නො කරමි. එසේ එය පරාමර්ශනය නොකරන්නාවූ ද මා විසින් තමා කෙරෙහි ම කෙලෙස් නිවීම දන්නා ලද්දේ ය. යම් නිවීමක් දන්නා තථාගත තෙමේ අනයව්‍යසනයකට නො පැමිණෙන්නේ ද, ඒ එබඳු වූ නිවීමෙක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භාර්‍ගවය, “ලොව ඉසුරකු විසින් මැවිණැ යි, බඹකු විසින් මැවිණැයි යන ආචාර්‍ය්‍යවාද වූ ලෝකෝත්පත්තිවංශකථාව පණවන ඇතැම් මහණ කෙනෙක් බමුණු කෙනෙක් ඇත. මම් ඔවුන් කරා එළැඹ, ‘ආයුෂ්මත්නි, ලොව ඉසුරක්හු විසින් මැවිණ බඹහු විසින් මැවිණ යන ආචාර්‍ය්‍යවාද වූ ලෝකෝත්පත්ති වංශකථාව (අග්ගඤ්ඤය) තෙපි පණවවු දැ? යි ඔවුන් විචාරමි. මා විසින් විචාරන ලද ඔහු, ‘එසේ යැ’ යි පිළිණ කෙරෙත්. මම් ඔවුනට ‘ආයුෂ්මත්නි, ලොව කවර සැටියෙන් මවන ලද්දේ දැ යි යන ඊශ්වරනිර්මාණයක්, බ්‍රහ්මනිර්මාණයක්, ආචාර්‍ය්‍යවාදයක්, ලෝකෝත්පත්තිවංශ කථාවක් පණවවු දැ?’ යි ඔවුන් පිළිවිසිමි. ඔහු මා විසින් (මෙසේ) විචාරන ලද්දාහු, (පිළිතුරු දීම් විසින්) ඥානගතියෙන් ඉදිරියට නො යත්. එසේ නො යන්නාහු, ඔහු මා ම පිළිවිසිත්. ඔවුන් විසින් විචාරන ලද මම් මෙසේ (එය) හෙළි කෙරෙමි:",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "47"
            },
            {
                "format": 13,
                "text": "30. “ඇවැත්නි, දික් කලක් ඇවෑමෙන් කිසි සමයෙක මෙ ලොව නැසෙයි ද, එ බඳු කාලපරිච්ඡේදයෙක් වෙයි. ලොව නැසෙන සමයෙහි සත්වයෝ බෙහෙවින් ආභස්සර බඹ ලොව උපදනාහු වෙත්. ඔහු එහි ධ්‍යාන චිත්ත බලයෙන් උපන්නාහු, ප්‍රීතිය ම ආහාර කොටැත්තාහු, සිය සිරුරු එළියෙන් බබළන්නාහු, අහසැ හැසිරෙන්නාහු, සිත්කලු උයන් විමන් ඈහි සිටුනාහු (නොහොත් සිත්කලු වස්ත්‍රාභරණ හැඳ පැලැඳ සිටුනාහු) වෙත්. ඔහු එහි ඉතා බොහෝ කල් සිටුනාහ. ඇවැත්නි, දික්කලක් ඇවෑමෙන් කිසි සමයෙක මෙ ලොව හැදෙන්නේ ද, එසේ වූ කාලපරිච්ඡේදයෙක් වෙයි. ලොව හැදෙන කලැ හිස් බඹ විමනෙක් පහළ වෙයි. එ කලැ එක්තරා සත්වයෙක් ආයු ගෙවීමෙන් හෝ පින් ගෙවීමෙන් ආභස්සර බඹලොවින් සැව එකී හිස් බඹ විමනට පැමිණෙයි (හිස බඹ විමනැ උපදී). හෙ තෙමේ එහි ධ්‍යාන සිතින් උපන්නේ, ප්‍රීතිය ගොදුරු කොටැත්තේ, සිය සිරුරෙන් විහිදෙන එළියෙන් බබළනුයේ, අහසැ හැසිරෙනුයේ, ශෝභන උද්‍යාන විමාන ආදියෙහි සිටුනේ (නොහොත් ශෝභන වස්ත්‍රාභරණ හැඳ පැලැඳ සිටුනේ) වෙයි. හේ එසේ බොහෝ කලක් සිටියි. එහි එකලා වැ දිගු කලක් වුසූ බැවින් ‘අන් සත් කෙනෙකුත් මෙ අත්බවට එන්නාහු නම් යෙහෙකැ’ යි එ කලා විසීමෙහි නො ඇල්මෙක්, අමුතු කෙනකු හා සහභාවයෙහි ආශාවෙක් උපදී. එයින් පසු අන් සත් කෙනෙක් ද ආයු ගෙවීමෙන් හෝ පින ගෙවීමෙන් හෝ ආභස්සර බඹලොවින් සැව, එ හිස් බඹ විමනට, ඒ පළමු ඉපැදැ සිටියහුගේ සහභාවයට පැමිණෙයි. ඔහු ද එහි ධ්‍යාන සිතින් උපන්නාහු, ප්‍රීතිය ගොදුරු කොටැත්තාහු, ස්වයම්ප්‍රභ වූවාහු, අහසැ හැසිරෙන්නාහු, සිත්කලු උයන් ඈහි සිටිනාහු වෙත්. එසේ දිගු කලක් ඔහු එහි සිටිත්. ඇවැත්නි, එහි යම් සතෙක් පළමුව උපන්නේ ද, ඔහුට, “මම් බ්‍රහ්ම වෙමි, මහා බ්‍රහ්ම වෙමි, මෙරමා මැඩ අධිපති වැ සිටුනෙම් වෙමි, අනුන් විසින් නො මඩනා ලදුයෙම් වෙමි, ඒකාන්තයෙන් සියල්ල දක්නෙම් වෙමි, සියල්ලන් සිය වශයෙහි පවත්වනු යෙම් වෙමි, ලොවැ ඊශ්වර වෙමි, ලොවැ කාරකවෙමි, ලොවැ නිර්මාතෘ වෙමි, ලොවැ ස්‍රෂ්ටෘ වෙමි, ලොවැ සකසන්නා වෙමි. මෙරමා තමා වශයෙන් පවත්වන්නෙම් වෙමි, උපන් උපදනා හැමගේ පියා වෙමි. මේ සත්හු මා විසින් මවන ලදහ. ඒ (කියනුයේ) කවර හෙයින? පෙරැ මට ‘අන් සත් කෙනෙකුත් මෙ අත්බවට එන්නාහු නම් ඒ ඉතා යෙහෙකැ’ යි මෙ සිත විය. මෙසේ මගේ ප්‍රාර්ථනාව ද වීය. ‘මේ සත්හු ද මෙහි ආහ’ යි මට මේ සිත වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "49"
            },
            {
                "format": 13,
                "text": "යම් සත්ව කෙනෙක් පසු වැ උපන්නාහු ද, ඔවුනටත් ‘මේ භවත් තෙමෙ බ්‍රහ්මයා ය, මහා බ්‍රහ්මයා ය, අනුන් මැඩ අධිපති වැ සිටුනේ ය. මෙරමා විසින් නො මැඩුණේ ය, ඒකාන්තයෙන් සියල්ල දක්නේ ය, මෙරමා සිය වශයෙහි පවත්වන්නේ ය, ඊශ්වර ය, කර්තෘ ය, නිර්මාතෘ ය, ස්‍රෂ්ටෘ ය, ලොව සදන්නා ය, මෙරමා තමන් වශයෙහි පවත්වන්නේ ය, උපන් උපදනා හැම දෙනාගේ පියා ය, මේ භවත් බ්‍රහ්මයා විසින් අපි මවන ලදුම්හ, එසේ කියනුයේ කවර හෙයින? යත්: අපි අපට පෙරැ මොහු ඉපිදැ සිටියහු අපි දුටුමු. අපි වූ කලි පසු ව උපන්නමෝ යැ” යි මෙසේ සිතෙක් වෙයි. ඇවැත්නි, එහි යම් සතෙක් පළමු ව උපන්නේ ද, හේ වඩා දීර්ඝායුෂ්ක ද වඩා පැහැපත් ද වඩා මහත් යසස් ඇත්තේ ද විය. යම් සත් කෙනෙක් පසුවැ උපන්නාහු ද, ඔහු පළ මු උපන්නාහට වඩා අල්පායුෂ්ක ද වඩා අල්ප වර්ණ සම්පත් ඇත්තාහු ද වඩා අල්ප යශස්ක ද වූහ. එක් සත්වයෙක් එ බඹමුළුයෙන් සැව, මෙ මිනිසත් බවට එන්නේ ය. හේ මේ මිනිසත්බවට පැමිණියේ ම ගිහි ගෙන් නික්මැ පැවිදි වෙයි. ගිහි ගෙන් නික්මැ පැවිදි වූයේ ම, උත්සාහ වඩා, වැර වඩා පුන පුනා වෑයම් කොට, නොපමා බව නිසා, නුවණ නිසා, යම් සමාධියෙකින් සිත මනාව පිහිටි කලැ මෙයින් පළමු වූ අත්බව සිහි කළ හැකි වෙයි. එයින් ඔබ්බෙහි සිහි කළ නොහැකි වෙයි ද, එබඳු චිත්ත සමාධියක් ලබයි යන මෙ කරුණ ඇත. (එසේ චිත්ත සමාධියක් ලත්) හෙ තෙම “යම් ඒ භවත් බ්‍රහ්මයෙක් මහා බ්‍රහ්ම ද, අනුන් මැඩ අධිපති වේ ද, ඊශ්වර ද, කාරක ද, නිර්මාපක ද, ස්‍රෂ්ටෘ ද, ලොව සකසන්නේ ද, මෙරමා සිය වශයෙහි පවත්වන්නේ ද, උපන් උපදනා හැමගේ පිතෘ ද, යම් ඒ භවත් මහ බඹක්හු විසින් අපි මවන ලදුමෝ ද, හෙ තෙමේ නිත්‍ය ය, ඕරුව ය (නො මැරෙන්නේ ය), සදාභාවී ය, වෙනස් නොවන සුලු ය, මහ පොළෝ ඈ ශාශ්වත වස්තූන් හා සම වැ එ සැටියෙන් ම නො වෙනස් වැ සිටුනේ ය. යම්බඳු වූ අපි ඒ භවත් බඹුහු විසින් මවන ලදුමෝ ද, ඒ අපි අනිත්‍යයම් හ, අධ්රුවයම්හ, අල්පායුෂ්කයම්හ, සැවෙන සුල්ලම්හ, එහෙයින් එයින් සැව මේ මිනිස් බවට ආම්හ” යි කියයි. ආයුෂ්මත්නි, තෙපි මෙසේ සකස් කැරැගන්නා ලද ඊශ්වර නිර්මිතයක්, බ්‍රහ්මනිර්මිතයක්, ආචාර්‍ය්‍යවාදයක් ලෝකෝත්පත්ති වංශකථාවක් පණවවු ද? (යනුයි). “ඇවැත්නි, ගෞතමයිනි, යම් සේ ම ආයුෂ්මත් ගෞතමයෝ කීහු ද, එ සේ ම අප විසින් අසන ලදි” යි මෙසේ ඔහු කිවු ය. භාර්ගවය මම අග්ගඤ්ඤය ද (ලෝකෝත්පත්ති කථාව ද) දනිමි … තථාගත තෙමේ යමක් දන්නේ අන්‍ය ව්‍යසනයකට නො පැමිණේ ද, එසේ වූ කෙලෙස් නිවීම මා විසින් දන්නා ලද්දේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "51"
            },
            {
                "format": 13,
                "text": "31. භාර්ගවය, ක්‍රීඩාප්‍රදූෂක දෙවියන් මුල් කොටැති ආචාර්‍ය්‍යවාද වූ ලෝකෝත්පත්ති වංශකථාවක් (අග්ගඤ්ඤයක්) යම් කෙනෙක් පණවත් ද, එසේ වූ ඇතැම් මහණ කෙනෙක් බමුණු කෙනෙක් ඇත. මම් ඔවුන් කරා එළැඹ “ආයුෂ්මත්නි, තෙපි ක්‍රීඩාප්‍රදූෂක මූලක ආචාර්‍ය්‍යවාදයක් වූ ලෝකෝත්පත්ති වංශ කථාවක් පණවවු ද? ඒ සැබෑ දැ?” යි කියමි. ඔහු මා විසින් මෙසේ විචාරන ලද්දාහු, ‘එසේ’ යි පිළින කෙරෙත්. “ආයුෂ්මත්නි, තෙපි කෙසේ පිළියෙල කැරැගන්නා ලද ආචාර්‍ය්‍යවාදයක් වූ ක්‍රීඩාප්‍රදූෂක මූලක ලෝකෝත්පත්ති වංශ කථාවක් පණවවු දැ?” යි මෙසේ මම් ඔවුන් විචාරමි. ඔහු මා විසින් විචාරන ලද්දාහු, පිළිතුරු දිය නො හැකි වෙත්. නො හැකි වන්නාහු, මා ම පුළුවුසිත්. එසේ විචාරන ලද මම් ඔවුනට මෙසේ හෙළි කොට කියමි: “ඇවැත්නි, ක්‍රීඩාප්‍රදූෂක නම් දෙවි කෙනෙක් ඇත. ඔහු ඉතා අධික වේලාවක් (අහර වළඳනා කාලය ද ඉක්මැ) මෙවුන්දම්හි ද කායික වාචසික ක්‍රීඩාහි ද ඇලෙන සැහැවියට වැටුණාහු වෙසෙත්. ඉතා අධික වේලාවක් මෙවුන්දම්හි ද කායික වාචසික ක්‍රීඩාහි ද ඇලෙන සැහැවියට වැටී වසන ඔවුනට බොජුන් ගනුවට සිහි නැති වේ. එසේ සිහි නැති වීමෙන් (බොජුන් නොගැනුම් හේතුයෙන්) ඒ දෙවියෝ දිව්‍ය නිකායයෙන් ච්‍යුත වෙත්. මෙසේ ච්‍යුත වූ එක්තරා සත්වයෙක් ඒ දේව නිකායෙන් ච්‍යුත ව මේ මිනිස් බවට පැමිණේ. එසේ මිනිසත් බවට පැමිණියා වූ ම හෙ තෙම ගිහි ගෙන් නික්ම පැවිදි වේ. පැවිදි වූයේ ම උත්සාහ වඩා, වැර වඩා, පුන පුනා වැර වඩා, සිහිය වඩා, නුවණ වඩා, යම් සමාධියෙකින් සිත මොනොවට පිහිටි කලැ ඒ පෙරැ අත් බව සිහි කළ හැකි වේ ද, එයින් යට සිහි කළ හැකි නො වේ ද, එසේ වූ චිත්තසමාධියක් ලබයි’ යන මෙය විද්‍යමාන එකෙකි. හේ මෙසේ කියයි: ‘යම් භවත් දෙවි කෙනෙක් ක්‍රීඩාප්‍රදූෂක නො වෙත් ද, ඔහු බොජුන් වේලාව ඉක්මැ මෙවුන්දම්හිත් කායික වාචසික ක්‍රීඩාහිත් ඇලෙන සැහැවියට පත්තෝ වැ නො වෙසෙත් ද, එසේ වේලාව ඉක්මැ මෙවුන්දම්හිත් සෙසු කායික වාචසික ක්‍රීඩාහිත් ඇලෙන සැහැවියට පැමිණ නො වසන ඔවුනට බොජුන් ගනුයෙහි සිහි නැති නො වේ. එසේ සිහි නැති නොවනුයෙන් ඒ දෙවියෝ ඒ දේවනිකායයෙන් නො සැවෙත්. ඔහු නිත්‍ය හ, ධ්රුව හ, සදාහාවී හ. නො පෙරැළෙන සුල්ලහ. හැම කල් පවත්නා පොළෝ ආදි වස්තූනට සම වැ එසේ ම (නො වෙනස් ව) සිටුනාහ. යම් බඳු අපි වනාහි ක්‍රීඩාප්‍රදූෂක වූමෝ ද, වේලාව ඉක්මැ හර්‍ෂ ක්‍රීඩාරති ස්වභාවයට පැමිණියෝ වැ වුසූමෝ ද, එසේ වසන අපට බොජුන් ගැන්මෙහි සිහි නැති විය. එයින් අපි ඒ දෙව්නිකායෙන් ච්‍යුත වූ මෝ එහෙයින් ම අනිත්‍ය වූමෝ අධ්‍රැව වූ මෝ අල්පායුෂ්ක වූමෝ මැරෙන සුලු වූමෝ මෙ මිනිස් බවට පැමිණියම්හ.” (යනු යි.)",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "53"
            },
            {
                "format": 13,
                "text": "ආයුෂ්මත්නි, මෙසේ සකස් කැරැගන්නා ලද ක්‍රීඩාප්‍රදූෂක මූලක ආචාර්‍ය්‍ය වාදයක් වූ ලෝකෝත්පත්ති වංශකථාවක් තෙපි පණවවු දැ” යි මම් අසමි. ’ඇවැත්නි ගෞතමයිනි, එසේ ආයුෂ්මත් ගෞතමයන් පැවැසූ පරිදි ම අප විසින් අසන ලදි’ යි ඔහු කීහ. භාර්‍ගවය, මේ ලෝකෝත්පත්ති වංශකථාව ද මම් දනිමි … යමක් තථාගත තෙමේ වෙසෙසි නුවණින් දන්නේ අනය ව්‍යසනයට නො පැමිණේ ද, එසේ වූ කෙලෙසේ නිවීම මා විසින් තමා කෙරෙහි ම දන්නා ලද්දේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "32. භාර්‍ගවය, මනඃප්‍රදූෂක මූලක ආචාර්‍ය්‍යවාදයක් වූ ලෝකෝත්පත්ති වංශකථාවක් යම් කෙනෙක් පණවත් ද, එසේ වූ සමහර මහණ කෙනෙක් බමුණු කෙනෙක් ඇත. මම් ඔවුන් කරා ගොස් මෙසේ කියමි. “ආයුෂ්මත්නි, තෙපි මනඃප්‍රදූෂකමූලක වූ ආචාර්‍ය්‍යවාද වූ සත්වොත්පත්ති වංශකථාවක් පණවවු ද? ඒ සැබෑ දෑ?’ යි ප්‍රශ්න කරමි. මා විසින් මෙසේ විචාරනු ලැබූ ඔහු ‘එසේ යැ’ යි පිළින කෙරෙත්. මම් ඔවුන් බණවා, “ආයුෂ්මත්නි, කෙසේ සැදුණු මනඃප්‍රදූෂකමූලක ආචාර්‍ය්‍යවාද වූ ලෝකෝත්පත්ති වංශකථාවක් තෙපි පණවවු දැ?’ යි මෙසේ කියමි. මා විසින් ප්‍රශ්න කරන ලද ඔහු එයට පිළිතුරු දෙනු නො හැකි වෙත්. නො හැකිවන්නාහු පෙරළා මා ම විචාරත්. ඔවුන් විසින් විචාරන ලද මම් ඔවුනට මෙසේ හෙළි කරමි: “ඇවැත්නි, මනඃප්‍රදූෂක නම් දෙවි කෙනෙක් ඇත. ඔහු ඉතා බොහෝ වෙලාවක් උනුන් දෙස බලා හිඳිත්. ඉතා බොහෝ වේලා උනුන් දෙස බලා ඉන්නා ඔහු උනුන් කෙරෙහි සිත් දූෂිත කැරැ ගනිත්. උනුන් කෙරෙහි ප්‍රදූෂිත වූ සිතැත්තාහු ක්ලාන්ත වූ කයැත්තාහු ක්ලාන්ත සිතැත්තාහු ඒ දෙවියෝ ඒ දෙව්ලොවින් ච්‍යුත වෙත්, ඔවුන් අතුරෙන් එක්තරා සත්ත්වයකු ඒ දෙව්ලොවින් සැව, මේ මිනිසත්බවට එතැ යි ද මෙ මිනිසත් බවට ආවහු ගිහි ගෙන් නික්ම පැවිදි බවට පැමිණෙතැ යි ද, පැවිදි බිමට පැමිණියහු ම උත්සාහ වඩා … යම්සේ සිත සමාධිගත කල්හි ඒ පෙරැ වුසූ අත්බව සිහි කරතැ යි ද, එයින් ඔබ්බෙහි සිහි නො කරතැ යි ද යන මේ කාරණය විද්‍යමාන ය. හේ මෙසේ කියයි: “යම් භවත් දෙවි කෙනෙක් මනඃප්‍රදූෂක නො වූහු ද, ඔහු අධික වෙලාවක් උනුන් නොබලන්නාහු උනුන් කෙරෙහි සිත් දූෂිත කැරැ නො ගනිත්. උනුන් කෙරෙහි ප්‍රදුෂ්ට නොවූ සිතැත්තාහු, ක්ලාන්ත නොවූ කයැත්තාහු, ක්ලාන්ත නොවූ සිතැත්තාහු, ඒ දෙවියෝ ඒ දෙව්ලොවින් නො සැවෙත් නිත්‍ය වැ ධ්‍රැව වැ ශාශ්වත වැ නො පෙරැළෙන සැහැවි ඇති වැ (මහාපෘථිවි ආදි) ශාශ්වත වස්තූන් සෙයින් ම නො වෙනස් ව සිටුනාහ. යම් බඳු වූ අපි මනඃප්‍රදූෂක වූමු ද, ඒ අපි අධික වේලාවක් උනුන් දෙස බලා උන්නම්හ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "55"
            },
            {
                "format": 13,
                "text": "ඒ අපි උනුන් දෙස බලා ඉන්නමෝ උනුන් කෙරෙහි සිත් දූෂිත කැරැ ගතුම්හ. ඒ අපි උනුනට ප්‍රදුෂ්ට වූ සිතැත්තමෝ එයින් ක්ලාන්ත කයැති වැ ක්ලාන්ත සිතැති වැ මෙසේ ඒ දෙව්ලොවින් චුත වූමෝ, අනිත්‍ය වූමෝ, අධ්‍රැව වූමෝ, ආශාශ්වත වූමෝ, අල්පායුෂ්ක වූමෝ, සැවෙන සුල්ලමෝ මෙ මිනිස්බවට ආම්හ’ යි මෙසේ කියයි. ආයුෂ්මත්නි, තෙපි මෙසේ සැකැසුණු මනඃප්‍රදූෂක මූලක ආචාර්‍ය්‍යවාද වූ ලෝකෝත්පත්ති වංශකතාවක් පනවවු දැ?’ යි මම් ඇසීමි. ‘ඇවැත්නි. ගෞතමයිනි, යම්සේ ආයුෂමත් ගෞතමයෝ කීහු ද, එසේ ම අප විසින් අසන ලදැ’ යි ඔහු කීහ. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "භාර්‍ගවය, මම් ලෝකෝත්පත්ති වංශකථාව ද දනිමි. එය ද දනිමි … තථාගත තෙමේ යමක වෙසෙසි නුවණින් දන්නෝ අනයව්‍යසනයට නො පැමිණේ ද එසේ වූ කෙලෙස් නිවීම තමා කෙරෙහි ම දන්නා ලද්දේ ය."
            },
            {
                "format": 13,
                "text": "33. භාර්‍ගවය, යම් කෙනෙක් යදෘච්ඡාසමුත්පන්න වූ, ආචාර්‍ය්‍යවාද වූ, ලෝකෝත්පත්ති වංශ කථාවක් පනවත් ද, එසේ වූ සමහර මහණ කෙනෙක් බමුණු කෙනෙක් ඇත. මම් ඔවුන් කරා එළැඹ ‘ආයුෂ්මත්නි, තෙපි යදෘච්ඡාසමුත්පන්න ලෝකෝත්පත්ති වංශකථා සංඛ්‍යාත ආචාර්‍ය්‍යවාදයක් පණවන්නහු ලු. ඒ සැබෑ දැ?’ යි මෙසේ ප්‍රශ්න කරමි. මා විසින් පුළුවුත් ඔහු ‘එසේ යැ’ යි පිළින කෙරෙත්. “ආයුෂ්මත්නි, කෙසේ සැදුණු, යදෘච්ඡාසමුත්පන්න වූ, ආචාර්‍ය්‍යවාද වූ ලෝකෝත්පත්ති වංශකථාවක් තෙප පණවවු දැ?’ යි මම් ඔවුන් පිළිවිසිමි. මා විසින් පුළුවුස්නා ලද ඔහු එයට උත්තර දෙනු නො හැකි වෙත්. උත්තර දිය නො හැකි වන්නාහු, මා ම පුළුවුසිත්. එසේ පුළුවුස්නා ලදුයෙම් මම ඔවුනට මෙසේ හෙළි කොට කියමි, “ඇවැත්නි, අසංඥසත්ව නමේ දෙව් කෙනෙක් ඇත. සංඥාව ඉපැත්මෙන් ම ඒ දෙවියෝ ඒ දෙව්ලොවින් ච්‍යුත වෙත්. ඇවැත්නි, එක්තරා සත්වයකු ඒ දෙව්ලොවින් සැවැ මෙ මිනිස් බවට පැමිණෙතැයි ද, එසේ මෙ මිනිසත් බවට පැමිණියාහු ගිහි ගෙන් පැවිදි බිමට යෙතැ යි ද, ගිහි ගෙන් නික්ම පැවිදි බිමට පැමිණ ම උත්සාහ වඩා … යම් සේ ම සිත සමාහිත කල්හි ඒ සංඥාවගේ ඉපැත්ම සිහි කෙරේ නම් එයින් ඔබ්බෙහි සිහි නො කෙරේ නම් එසේ වූ චිත්තසමාධියක් ඔහු ස්පර්ශ කරතැයි ද යන මේ කාරණය විද්‍යමාන එකෙක. හෙ තෙමේ ආත්මයත් ලෝකයත් යදෘච්ඡා සමුත්පන්නාහ (ඉබේ පහළ වූහ)’ යි පණවයි. එසේ කියනු යේ කවර හෙයින? යත්: ‘මම් පෙරැ නොවීමි, ඒ මම් පෙරැ නො වී දැන් සත්ව භාවයට පෙරැළිණිමි’ යි හේ කියයි. ‘ආයුෂ්මත්නි, තෙපි මෙසේ සැකැසුණු ආචාර්‍ය්‍යවාද වූ යදෘච්ඡාසමුත්පන්න ලෝකෝත්පත්ති වංශකථාවක් පණවවු දැ?’ යි මම් ඔවුන් පිළිවිසිමි: ‘ඇවැත්නි, ගෞතමයිනි, යම්සේ ආයුෂ්මත් ගෞතමයෝ කීහු ද, එසේ ම අප විසින් අසන ලද්දේ යැ යි ඔහු කියත්. භර්‍ගවය, අග්ගඤ්ඤය ද (ලෝකෝත්පත්ති වංශකථාව ද) මම් දනිමි. එය ද දනිමි, එයින් වඩා උසස් වූ දැය ද දනිමි, ඒ දැනීම ද තෘෂ්ණා දෘෂ්ටි මාන වශයෙන් පරාමර්ශනය නො කරමි. එය පරාමර්ශ නොකරන්නා වූ ද මා විසින් යමක් වෙසෙසි නුවණින් දන්නා තථාගත තෙම අනයව්‍යසනයකට නො පැමිණෙයි ද, එසේ වූ කෙලෙස් නිවීම තමා කෙරෙහි ම දන්නා ලද්දේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "57"
            },
            {
                "format": 13,
                "text": "34. භාර්‍ගවය, මෙසේ කියන, මෙසේ කරුණු පවසන මට, ඇතැම් මහණ කෙනෙකේ බමුණු කෙනෙක් ‘මහණ ගොයුම් පෙරැළුණු සංඥා ඇත්තේ ය, ඔහු සවු මහණහු ද පෙරැළුණු සංඥා ඇත්තෝ යැ’ යි ද, ‘යම් විටෙක ශුභ විමෝක්ෂය ලැබ වෙසේ නම් එ කලැ සියල්ල අශුභ යැ යි ම හඳුනා යැ යි දැ’ යි නැති දැයින්, හිස් මුසායෙන්, අභූතයෙන් දොස් නඟත්. භාර්‍ගවය, ශුභවිමෝක්ෂය ලැබ වසන කලැ ‘සියල්ල අශුභ යැ යි හඳුනා යැ’ යි මෙසේ මම් නො කියමි. වැලි ‘යම් සමයෙක ශුභවිමෝක්ෂය ලැබ වෙසේ නම්, එ කලැ ශුභ යැ යි ම හඳුනා යැ’ යි මෙසේ නම් මම් කියමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වහන්ස යම් කෙනෙක් වූකලී භාග්‍යවතුන් වහන්සේ ද භික්ෂූන් ද, විපරීත වශයෙන් පිහිටුවත් නම් (ඇති තතු වෙනස් කොටැ දක්වා දොස් නගත් නම්), ඔහු ම විපරීතයෝ ය (පෙරැළුණු සංඥා ඇත්තෝ ය). වහන්ස, මම් භාග්‍යවතුන් වහන්සේ කෙරෙහි මෙසේ පැහැදුණෙම් වෙමි. යම් සේ මම් ශුභ විමෝක්ෂය ලැබ විසිය හැකි වන්නෙම් ද, භාග්‍යවතුන් වහන්සේ මට එසේ දහම් දෙසන්නට පොහොසත් සේකැ’ යි මෙසේ මම් භාග්‍යවතුන් වහන්සේ කෙරෙහි පැහැදුණෙම් වෙමි” යි භාර්‍ගව කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“භාර්‍ගවය, අන්‍ය දෘෂ්ටික වූ අන්‍යලබ්ධික වූ අන්‍යරුචික වූ අන්‍ය ප්‍රතිපත්තියෙක යෙදුණු, අන්‍යතීර්ථායතනයෙක ඇදුරු වූ තා විසින් මෙසේ ශුභ විමෝක්ෂය ලැබ වසන්නට දුෂ්කර ය. එබැවින් භාර්‍ගවය, මා කෙරෙහි තාගේ මේ යම් පැහැදීමෙක් ඇද්ද, එය ම තෝ මොනොවට රකුව” යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "“වහන්ස, ඉදින් අන්‍යදෘෂ්ටික අන්‍යලබ්ධික අන්‍යරුචික අන්‍යප්‍රතිපත්තියෙක යෙදුණු අන් තීර්ථායතනයෙක ඇදුරු වූ මා විසින් ඒ ශුභ විමෝක්ෂය ලැබ වසන්නට දුෂ්කර වේ නම්, භාග්‍යවතුන් වහන්සේ කෙරෙහි මගේ මේ යම් පැහැදීමෙක් ඇද්ද, එය ම මම් මොනොවට රකින්නෙම්” යි භාර්‍ගව තෙම පැවසී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භාග්‍යවතුන් වහන්සේ මේ දහම දෙසූ සේක. භාර්‍ගවගෝත්‍ර පරිව්‍රාජක තෙම ආරාධිත සිතැත්තේ භාග්‍යවතුන් වහන්සේගේ වචනය පිළිගත්තේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "පළමු වන පාථික සූත්‍රය නිමියේ යැ.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ]
    }
]