[
    {
        "filename": "mn-upp-5",
        "bookId": 15,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "528"
            },
            {
                "type": "heading",
                "text": "5. සළායතනවග්ගො",
                "level": 3
            },
            {
                "type": "centered",
                "text": "3.5.1",
                "level": "1"
            },
            {
                "type": "heading",
                "text": " අනාථපිණ්ඩිකොවාදසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එවං මෙ සුතං: එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තෙන ඛො පන සමයෙන අනාථපිණ්ඩිකො ගහපති ආබාධිකො හොති දුක්ඛිතො බාළ්හගිලානො. අථ ඛො අනාථපිණ්ඩිකො ගහපති අඤ්ඤතරං පුරිසං ආමන්තෙසි: ‘එහි ත්වං අම්භො පුරිස, යෙන භගවා තෙනුපසඞ්කම, උපසඞ්කමිත්වා මම වචනෙන භගවතො පාදෙ සිරසා වන්දාහි. ‘අනාථපිණ්ඩිකො භන්තෙ, ගහපති ආබාධිකො දුක්ඛිතො බාළ්හගිලානො. ‘සො භගවතො පාදෙ සිරසා වන්දතී’ති. යෙන චායස්මා සාරිපුත්තො තෙනුපසඞ්කම, උපසඞ්කමිත්වා මම වචනෙන ආයස්මතො සාරිපුත්තස්ස පාදෙ සිරසා වන්දාහි ‘අනාථපිණ්ඩිකො භන්තෙ, ගහපති ආබාධිකො දුක්ඛිතො බාළ්හගිලානො. සො ආයස්මතො සාරිපුත්තස්ස පාදෙ සිරසා වන්දතී’ති. එවඤ්ච වදෙහි: ‘සාධු කිර භන්තෙ, ආයස්මා සාරිපුත්තො යෙන අනාථපිණ්ඩිකස්ස ගහපතිස්ස නිවෙසනං තෙනුපසඞ්කමතු අනුකම්පං උපාදායා’ති."
            },
            {
                "type": "paragraph",
                "text": "‘එවං භන්තෙ’ති ඛො සො පුරිසො අනාථපිණ්ඩිකස්ස ගහපතිස්ස පටිස්සුත්වා යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො සො පුරිසො භගවන්තං එතදවොච: ‘අනාථපිණ්ඩිකො භන්තෙ, ගහපති ආබාධිකො දුක්ඛිතො බාළ්හගිලානො, සො භගවතො පාදෙ සිරසා වන්දතී’ති. යෙන චායස්මා සාරිපුත්තො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මන්තං සාරිපුත්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො සො පුරිසො ආයස්මන්තං සාරිපුත්තං එතදවොච: ‘අනාථපිණ්ඩිකො භන්තෙ, ගහපති ආබාධිකො දුක්ඛිතො බාළ්හගිලානො, සො ආයස්මතො සාරිපුත්තස්ස පාදෙ සිරසා වන්දති. එවඤ්ච වදෙති: ‘සාධු කිර භන්තෙ, ආයස්මා සාරිපුත්තො යෙන අනාථපිණ්ඩිකස්ස ගහපතිස්ස නිවෙසනං තෙනුපසඞ්කමතු අනුකම්පං උපාදායා’ති."
            },
            {
                "type": "paragraph",
                "text": "අධිවාසෙසි ඛො ආයස්මා සාරීපුත්තො තුණ්හීභාවෙන. අථ ඛො ආයස්මා සාරිපුත්තො නිවාසෙත්වා පත්තචීවරමාදාය ආයස්මතා ආනන්දෙන පච්ඡාසමණෙන යෙන අනාථපිණ්ඩිකස්ස ගහපතිස්ස නිවෙසනං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදි. නිසජ්ජ ඛො ආයස්මා සාරිපුත්තො අනාථපිණ්ඩිකං ගහපතිං එතදවොච: ‘කච්චි තෙ ගහපති, ඛමනීයං කච්චි යාපනීයං, කච්චි තෙ දුක්ඛා වෙදනා පටික්කමන්ති, නො අභික්කමන්ති, පටික්කමොසානං පඤ්ඤායති නො අභික්කමො’’ති."
            },
            {
                "type": "page-break",
                "text": "530"
            },
            {
                "type": "paragraph",
                "text": "න මෙ භන්තෙ සාරිපුත්ත ඛමනීයං, න යාපනීයං, බාළ්හා මෙ දුක්ඛා වෙදනා. අභික්කමන්ති නො පටික්කමන්ති. අභික්කමොසානං පඤ්ඤායති, නො පටික්කමො’ති."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භන්තෙ සාරිපුත්ත, බලවා පුරිසො තිණ්හෙන සිඛරෙන මුද්ධනි අභිමන්ථෙය්ය, එවමෙව ඛො භන්තෙ සාරිපුත්ත, අධිමත්තා වාතා මුද්ධනි ඌහනන්ති. න මෙ භන්තෙ සාරිපුත්ත, ඛමනීයං, න යාපනීයං, බාළ්හා මෙ දුක්ඛා වෙදනා අභික්කමන්ති නො පටික්කමන්ති. අභික්කමොසානං පඤ්ඤායති නො පටික්කමොති."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භන්තෙ සාරිපුත්ත, බලවා පුරිසො දළ්හෙන වරත්තබණ්ඩෙන{1 වරත්තඛණ්ඩෙන - සීමු, මඡසං.} සීසෙ සීසවෙඨනං{2 සීසවෙඨං _ මඡසං.} දදෙය්ය, එවමෙව ඛො මෙ භන්තෙ සාරිපුත්ත, අධිමත්තා වාතා සීසං පරිකන්තන්ති{3 අධිමත්තා සීසෙ සීසවෙදනා - මඡසං.}. න මෙ භන්තෙ සාරිපුත්ත, ඛමනීයං න යාපනීයං, බාළ්හා මෙ දුක්ඛා වෙදනා අභික්කමන්ති නො පටික්කමන්ති. අභික්කමොසානං පඤ්ඤායති, නො පටික්කමොති."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භන්තෙ සාරිපුත්ත, දක්ඛො ගොඝාතකො වා ගොඝාතකන්තෙවාසී වා තිණ්හෙන ගොවිකන්තනෙන කුච්ඡිං පරිකන්තෙය්ය, එවමෙව ඛො මෙ භන්තෙ සාරිපුත්ත, අධිමත්තා වාතා කුච්ඡිං පරිකන්තන්ති. න මෙ භන්තෙ සාරිපුත්ත, ඛමනීයං න යාපනීයං, බාළ්හා මෙ දුක්ඛා වෙදනා අභික්කමන්ති නො පටික්කමන්ති. අභික්කමොසානං පඤ්ඤායති නො පටික්කමොති."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භන්තෙ සාරිපුත්ත, ද්වෙ බලවන්තො පුරිසා දුබ්බලතරං පුරිසං නානාබාහාසු ගහෙත්වා අඞ්ගාරකාසුයා සන්තාපෙය්යුං සම්පරිතාපෙය්යුං, එවමෙව ඛො මෙ භන්තෙ සාරිපුත්ත, අධිමත්තො කායස්මිං ඩාහො. න මෙ භන්තෙ සාරිපුත්ත, ඛමනීයං න යාපනීයං, බාළ්හා මෙ දුක්ඛා වෙදනා අභික්කමන්ති, නො පටික්කමන්ති, අභික්කමොසානං පඤ්ඤායති, නො පටික්කමොති."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ තෙ ගහපති, එවං සික්ඛිතබ්බං: ‘න චක්ඛුං උපාදියිස්සාමි. න ච මෙ චක්ඛුනිස්සිතං විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති, සික්ඛීතබ්බං. තස්මාතිහ තෙ ගහපති, එවං සික්ඛිතබ්බං: ‘න සොතං උපාදියිස්සාමි. න ච මෙ සොතනිස්සිතං විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති, සික්ඛිතබ්බං. තස්මාතිහ තෙ ගහපති, එවං සික්ඛිතබ්බං: ‘න ඝානං උපාදියිස්සාමි. න ච මෙ ඝානනිස්සිතං විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති, සික්ඛිතබ්බං. තස්මාතිහ .....පෙ..... න ජිව්හං -ප- සික්ඛිතබ්බං. තස්මාතිහ -ප- න කායං -ප- සික්ඛිතබ්බං. තස්මාතිහ -ප- න මනං -ප- සික්ඛිතබ්බං."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ -ප- න රූපං -ප- සික්ඛිතබ්බං: තස්මාතිහ -ප- න සද්දං උපාදියිස්සාමි -ප- න ගන්ධං උපාදියිස්සාමි. -ප- න රසං උපාදියිස්සාමි. -ප- න ඵොට්ඨබ්බං උපාදියිස්සාමි. -ප- න ධම්මං උපාදියිස්සාමි. න ච මෙ ධම්මනිස්සිතං විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති, සික්ඛිතබ්බං."
            },
            {
                "type": "page-break",
                "text": "532"
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ තෙ ගහපති, එවං සික්ඛිතබ්බං: ‘න චක්ඛුවිඤ්ඤාණං උපාදියිස්සාමි. න ච මෙ චක්ඛුවිඤ්ඤාණනිස්සිතං විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති, සික්ඛිතබ්බං. තස්මාතිහ තෙ ගහපති, එවං සික්ඛිතබ්බං: ‘න සොතවිඤ්ඤාණං උපාදියිස්සාමි. -ප- න ඝානවිඤ්ඤාණං උපාදියිස්සාමි. -ප- න ජිව්හාවිඤ්ඤාණං උපාදියිස්සාමි. -ප- න කායවිඤ්ඤාණං උපාදියිස්සාමි -ප- න මනොවිඤ්ඤාණං උපාදියිස්සාමි. න ච මෙ මනොවිඤ්ඤාණනිස්සිතං විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති, සික්ඛිතබ්බං."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ තෙ ගහපති, එවං සික්ඛිතබ්බං: ‘න චක්ඛුසම්ඵස්සං උපාදියිස්සාමි. න ච මෙ චක්ඛුසම්ඵස්සනිස්සිතං විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති සික්ඛිතබ්බං. තස්මාතිහ තෙ ගහපති, එවං සික්ඛිතබ්බං: ‘න සොතසම්ඵස්සං උපාදියිස්සාමි. -ප- න ඝානසම්ඵස්සං උපාදියිස්සාමි. -ප- න ජිව්හාසම්ඵස්සං උපාදියිස්සාමි. -ප- න කායසම්ඵස්සං උපාදියිස්සාමි. -ප- න මනොසම්ඵස්සං උපාදියිස්සාමි. න ච මෙ මනොසම්ඵස්සනිස්සිතං විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති, සික්ඛිතබ්බං."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ තෙ ගහපති, එවං සික්ඛිතබ්බං: ‘න චක්ඛුසම්ඵස්සජං වෙදනං උපාදියිස්සාමි. න ච මෙ චක්ඛුසම්ඵස්සජවෙදනානිස්සිතං{1 චක්ඛුසම්ඵස්සජාවෙදනානිස්සිතං - මඡසං, සීමු.} විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති, සික්ඛිතබ්බං. තස්මාතිහ තෙ ගහපති, එවං සික්ඛිතබ්බං: ‘න සොතසම්ඵස්සජං වෙදනං උපාදියිස්සාමි. -ප- න ඝානසම්ඵස්සජං වෙදනං උපාදියිස්සාමි. -ප- න ජිව්හාසම්ඵස්සජං වෙදනං උපාදියිස්සාමි. -ප- න කායසම්ඵස්සජං වෙදනං උපාදියිස්සාමි. -ප- න මනොසම්ඵස්සජං වෙදනං උපාදියිස්සාමි. න ච මෙ මනොසම්ඵස්සජවෙදනානිස්සිතං විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති, සික්ඛිතබ්බං."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ තෙ ගහපති, එවං සික්ඛිතබ්බං: ‘න පථවීධාතුං උපාදියිස්සාමි, න ච මෙ පථවීධාතුනිස්සිතං විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති, සික්ඛිතබ්බං. තස්මාතිහ -ප- සික්ඛිතබ්බං: න ආපොධාතුං උපාදියිස්සාමි. -ප- න තෙජොධාතුං උපාදියිස්සාමි. -ප- න වායොධාතුං උපාදියිස්සාමි. -ප- න ආකාසධාතුං උපාදියිස්සාමි. -ප- න විඤ්ඤාණධාතුං උපාදියිස්සාමි. න ච මෙ විඤ්ඤාණධාතුනිස්සිතං විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති, සික්ඛිතබ්බං."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ තෙ ගහපති, එවං සික්ඛිතබ්බං: ‘න රූපං උපාදියිස්සාමි. න ච මෙ රූපනිස්සිතං විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති, සික්ඛිතබ්බං. තස්මාතිහ තෙ ගහපති, එවං සික්ඛිතබ්බං: ‘න වෙදනං උපාදියිස්සාමි. -ප- න සඤ්ඤං උපාදියිස්සාමි. -ප- න සඞ්ඛාරෙ උපාදියිස්සාමි. -ප- න විඤ්ඤාණං උපාදියිස්සාමි. න ච මෙ විඤ්ඤාණනිස්සිතං විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති, සික්ඛිතබ්බං."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ තෙ ගහපති, එවං සික්ඛිතබ්බං: ‘න ආකාසානඤ්චායතනං උපාදියිස්සාමි. න ච මෙ ආකාසානඤ්චායතනනිස්සිතං විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති, සික්ඛිතබ්බං. තස්මාතිහ තෙ ගහපති, එවං සික්ඛිතබ්බං: ‘න විඤ්ඤාණඤ්චායතනං උපාදියිස්සාමි. -ප- න ආකිඤ්චඤ්ඤායතනං උපාදියිස්සාමි. -ප- න නෙවසඤ්ඤානාසඤ්ඤායතනං උපාදියිස්සාමි. න ච මෙ නෙවසඤ්ඤානාසඤ්ඤායතනනිස්සිතං විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති, සික්ඛිතබ්බං."
            },
            {
                "type": "page-break",
                "text": "534"
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ තෙ ගහපති, එවං සික්ඛිතබ්බං: ‘න ඉධලොකං උපාදියිස්සාමි, න ච මෙ ඉධලොකනිස්සිතං විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති, සික්ඛිතබ්බං. තස්මාතිහ තෙ, ගහපති, එවං සික්ඛිතබ්බං: ‘න පරලොකං උපාදියිස්සාමි, න ච මෙ පරලොකනිස්සිතං විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති, සික්ඛිතබ්බං."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ තෙ ගහපති, එවං සික්ඛිතබ්බං: ‘යම්පිදං{1 යම්පි මෙ - මඡසං.} දිට්ඨං සුතං මුතං විඤ්ඤාතං පත්තං පරියෙසිතං{2 විඤ්ඤාතං පරියෙසිතං - PTS.} අනුවිචරිතං{3 අනුපරියෙසිතං අනුවිචරිතං - මඡසං, සීමු.} මනසා. තම්පි න උපාදියිස්සාමි. න ච මෙ තන්නිස්සිතං විඤ්ඤාණං භවිස්සතී’ති. එවං හි තෙ ගහපති, සික්ඛිතබ්බන්ති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ අනාථපිණ්ඩිකො ගහපති පරොදි, අස්සූනි පවත්තෙසි. අථ ඛො ආයස්මා ආනන්දො, අනාථපිණ්ඩිකං ගහපතිං එතදවොච: ඔලීයසි ඛො ත්වං ගහපති, සංසීදසි{4 සංසීදති - සීම.} ඛො ත්වං ගහපතී’ති."
            },
            {
                "type": "paragraph",
                "text": "නාහං භන්තෙ ආනන්ද, ඔලිය්යාමි, නපි සංසීදාමි. අපි ච මෙ දීඝරත්තං සත්ථා පයිරුපාසිතො, මනොභාවනීයා ච භික්ඛූ. න ච මෙ එවරූපී ධම්මී කථා සුතපුබ්බා’ති."
            },
            {
                "type": "paragraph",
                "text": "න ඛො ගහපති, ගිහීනං ඔදාතවසනානං එවරූපී ධම්මී කථා පටිභාති. පබ්බජිතානං ඛො, ගහපති, එවරූපී ධම්මී කථා පටිභාතී’ති."
            },
            {
                "type": "paragraph",
                "text": "තෙන හි භන්තෙ සාරිපුත්ත, ගිහීනං ඔදාතවසනානං එවරූපී ධම්මී කථා පටිභාතු. සන්ති හි භන්තෙ සාරිපුත්ත, කුලපුත්තා අප්පරජක්ඛජාතිකා, අස්සවනතා ධම්මස්ස පරිහායන්ති. භවිස්සන්ති ධම්මස්ස අඤ්ඤාතාරො’ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා ච සාරිපුත්තො ආයස්මා ච ආනන්දො, අනාථපිණ්ඩිකං ගහපතිං ඉමිනා ඔවාදෙන ඔවදිත්වා උට්ඨායාසනා පක්කමිංසු."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො අනාථපිණ්ඩිකො ගහපති, අචිරපක්කන්තෙ ආයස්මන්තෙ ච සාරිපුත්තෙ ආයස්මන්තෙ ච ආනන්දෙ කායස්ස භෙදා පරම්මරණා{5 කාලමකාසි - මඡසං, සීමු.} තුසිතං කායං උපපජ්ජි{6 උප්පජ්ජි - සීමු.}."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො අනාථපිණ්ඩිකො දෙවපුත්තො අභික්කන්තාය රත්තියා අභික්කන්තවණ්ණො කෙවලකප්පං ජෙතවනං ඔභාසෙත්වා යෙන භගවා තෙනුපසඞ්කමි, උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතො ඛො අනාථපිණ්ඩිකො දෙවපුත්තො භගවන්තං ගාථාහි අජ්ඣභාසි:"
            },
            {
                "type": "gatha",
                "text": "ඉදං හි තං ජෙතවනං ඉසිසඞ්ඝනිසෙවිතං,\nආවුත්ථං ධම්මරාජෙන පීතිසඤ්ජනනං මම.",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "කම්මං විජ්ජා ච ධම්මො ච සීලං ජීවිතමුත්තමං,\nඑතෙන මච්චා සුජ්ඣන්ති න ගොත්තෙන ධනෙන වා.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "536"
            },
            {
                "type": "gatha",
                "text": "තස්මා හි පණ්ඩිතො පොසො සම්පස්සං අත්ථමත්තනො,\nයොනිසො විචිනෙ ධම්මං එවං තත්ථ විසුජ්ඣති.",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "සාරිපුත්තොව පඤ්ඤාය සීලෙන උපසමෙන ච,\nයො හි{1 යො පි - මඡසං.} පාරගතො භික්ඛු, එතාව පරමො සියා’ති.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච අනාථපිණ්ඩිකො දෙවපුත්තො, සමනුඤ්ඤො සත්ථා අහොසි. අථ ඛො අනාථපිණ්ඩිකො දෙවපුත්තො සමනුඤ්ඤො මෙ සත්ථාති භගවන්තං අභිවාදෙත්වා පදක්ඛිණං කත්වා තත්ථෙවන්තරධායි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා තස්සා රත්තියා අච්චයෙන භික්ඛූ ආමන්තෙසි: ඉමං භික්ඛවෙ රත්තිං අඤ්ඤතරො දෙවපුත්තො අභික්කන්තාය රත්තියා අභික්කන්තවණ්ණො කෙවලකප්පං ජෙතවනං ඔභාසෙත්වා යෙනාහං තෙනුපසඞ්කමි, උපසඞ්කමිත්වා මං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතො ඛො භික්ඛවෙ, සො දෙවපුත්තො මං ගාථාහි අජ්ඣභාසි:"
            },
            {
                "type": "paragraph",
                "text": "ඉදං හි තං ජෙතවනං -ප- එතාව පරමො සියාති."
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච භික්ඛවෙ, සො දෙවපුත්තො. සමනුඤ්ඤො මෙ සත්ථාති මං අභිවාදෙත්වා පදක්ඛිණං කත්වා තත්ථෙවන්තරධායී’ති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ ආයස්මා ආනන්දො භගවන්තං එතදවොච: ‘සො හි නූන සො භන්තෙ, අනාථපිණ්ඩිකො දෙවපුත්තො භවිස්සති. අනාථපිණ්ඩිකො භන්තෙ, ගහපති ආයස්මන්තෙ සාරිපුත්තෙ අභිප්පසන්නො{2 අවෙච්චප්පසන්නො - මඡසං, සීමු, PTS.} අහොසීති."
            },
            {
                "type": "paragraph",
                "text": "සාධු සාධු, ආනන්ද, යාවතකං ඛො ආනන්ද, තක්කාය පත්තබ්බං, අනුප්පත්තං තයා. අනාථපිණ්ඩිකො සො ආනන්ද, දෙවපුත්තො නාඤ්ඤොති."
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච භගවා. අත්තමනො ආයස්මා ආනන්දො භගවතො භාසිතං අභිනන්දීති."
            },
            {
                "type": "centered",
                "text": "අනාථපිණ්ඩිකොවාද සුත්තං පඨමං.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "538"
            },
            {
                "type": "centered",
                "text": "3. 5. 2",
                "level": "1"
            },
            {
                "type": "heading",
                "text": " ඡන්නොවාද සුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එවං මෙ සුතං: එකං සමයං භගවා රාජගහෙ විහරති වෙළුවනෙ කලන්දකනිවාපෙ. තෙන ඛො පන සමයෙන ආයස්මා ච සාරිපුත්තො ආයස්මා ච මහාචුන්දො ආයස්මා ච ඡන්නො ගිජ්ඣකූටෙ පබ්බතෙ විහරන්ති. තෙන ඛො පන සමයෙන ආයස්මා ඡන්නො ආබාධිකො හොති දුක්ඛිතො බාළ්හගිලානො. අථ ඛො ආයස්මා සාරිපුත්තො සායන්හසමයං පතිසල්ලානා වුට්ඨිතො යෙනායස්මා මහාචුන්දො, තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මන්තං මහාචුන්දං එතදවොච: ‘ආයාම ආවුසො චුන්ද, යෙනායස්මා ඡන්නො, තෙනුපසඞ්කමෙය්යාම ගිලානපුච්ඡකා’ති. එවමාවුසොති ඛො ආයස්මා මහාචුන්දො ආයස්මතො සාරිපුත්තස්ස පච්චස්සොසි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා ච සාරිපුත්තො ආයස්මා ච මහාචුන්දො යෙනායස්මා ඡන්නො, තෙනුපසඞ්කමිංසු, උපසඞ්කමිත්වා ආයස්මතා ඡන්නෙන සද්ධිං සම්මොදිංසු. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නො ඛො ආයස්මා සාරිපුත්තො ආයස්මන්තං ඡන්නං එතදවොච: ‘කච්චි තෙ ආවුසො ඡන්න, ඛමනීයං කච්චි යාපනීයං, කච්චි තෙ දුක්ඛා වෙදනා, පටික්කමන්ති නො අභික්කමන්ති. පටික්කමොසානං පඤ්ඤායති, නො අභික්කමො’ති."
            },
            {
                "type": "paragraph",
                "text": "න මෙ ආවුසො සාරිපුත්ත, ඛමනීයං න යාපනීයං. බාළ්හා මෙ දුක්ඛා වෙදනා. අභික්කමන්ති, නො පටික්කමන්ති. අභික්කමොසානං පඤ්ඤායති, නො පටික්කමො’ති. සෙය්යථාපි ආවුසො සාරිපුත්ත, බලවා පුරිසො තිණ්හෙන සිඛරෙන මුද්ධනි අභිමන්ථෙය්ය, එවමෙව ඛො මෙ ආවුසො සාරිපුත්ත අධිමත්තා වාතා මුද්ධනි ඌහනන්ති. න මෙ ආවුසො සාරිපුත්ත, ඛමනීයං, න යාපනීයං. බාළ්හා මෙ දුක්ඛා වෙදනා, අභික්කමන්ති නො පටික්කමන්ති, අභික්කමොසානං පඤ්ඤායති නො පටික්කමොති."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි ආවුසො සාරිපුත්ත, බලවා පුරිසො දළ්හෙන වරත්ත බන්ධෙන සීසෙ සීසවෙඨනං දදෙය්ය. එවමෙව ඛො මෙ ආවුසො සාරිපුත්ත, අධිමත්තා වාතා සීසං පරිකන්තන්ති{1 සීසෙ සීසවෙදනා - මඡසං.} න මෙ ආවුසො සාරිපුත්ත, ඛමනීයං න යාපනීයං, බාළ්හා මෙ දුක්ඛා වෙදනා, අභික්කමන්ති නො පටික්කමන්ති, අභික්කමොසානං පඤ්ඤායති නො පටික්කමොති."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි ආවුසො සාරිපුත්ත, දක්ඛො ගොඝාතකො වා ගොඝාතකන්තෙවාසී වා තිණ්හෙන ගොවිකන්තනෙන කුච්ඡිං පරිකන්තෙය්ය. එවමෙව ඛො මෙ ආවුසො සාරිපුත්ත, අධිමත්තා වාතා කුච්ඡිං පරිකන්තන්ති. න මෙ ආවුසො සාරිපුත්ත, ඛමනීයං, න යාපනීයං. බාළ්හා මෙ දුක්ඛා වෙදනා අභික්කමන්ති නො පටික්කමන්ති, අභික්කමොසානං පඤ්ඤායති, නො පටික්කමොති."
            },
            {
                "type": "page-break",
                "text": "540"
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි ආවුසො සාරිපුත්ත, ද්වෙ බලවන්තො පුරිසා දුබ්බලතරං පුරිසං නානාබාහාසු ගහෙත්වා අඞ්ගාරකාසුයා සන්තාපෙය්යුං, සම්පරිතාපෙය්යුං. එවමෙව ඛො මෙ, ආවුසො සාරිපුත්ත, අධිමත්තො කායස්මිං ඩාහො. න මෙ ආවුසො සාරිපුත්ත, ඛමනීයං, න යාපනීයං. බාළ්හා මෙ දුක්ඛා වෙදනා අභික්කමන්ති, නො පටික්කමන්ති. අභික්කමොසානං පඤ්ඤායති, නො පටික්කමො’ති. සත්ථං ආවුසො සාරිපුත්ත, ආහරිස්සාමි, නාවකඞ්ඛාමි ජීවිතන්ති."
            },
            {
                "type": "paragraph",
                "text": "‘මායස්මා ඡන්නො සත්ථං ආහරෙසි. යාපෙතායස්මා ඡන්නො, යාපෙන්තං මයං ආයස්මන්තං ඡන්නං ඉච්ඡාම. සචෙ ආයස්මතො ඡන්නස්ස නත්ථි සප්පායානි භොජනානි, අහං ආයස්මතො ඡන්නස්ස සප්පායානි භොජනානි පරියෙසිස්සාමි. සචෙ ආයස්මතො ඡන්නස්ස නත්ථි සප්පායානි භෙසජ්ජානි, අහං ආයස්මතො ඡන්නස්ස සප්පායානි භෙසජ්ජානි පරියෙසිස්සාමි. සචෙ ආයස්මතො ඡන්නස්ස නත්ථි පතිරූෙපා උපට්ඨාෙකා, අහං ආයස්මන්තං ඡන්නං උපට්ඨහිස්සාමි. මායස්මා ඡන්නො සත්ථං ආහරෙසි. යාපෙතායස්මා ඡන්නො, යාපෙන්තං මයං ආයස්මන්තං ඡන්නං ඉච්ඡාමා’ති."
            },
            {
                "type": "paragraph",
                "text": "නපි මෙ ආවුසො සාරිපුත්ත, නත්ථි සප්පායානි භොජනානි. නපි මෙ නත්ථි සප්පායානි භෙසජ්ජානි. නපි මෙ නත්ථි පතිරූපා උපට්ඨාකා. අපි චාවුසො සාරිපුත්ත, පරිචිණ්ණො මෙ සත්ථා දීඝරත්තං මනාපෙනෙව නො අමනාපෙන. එතං හි ආවුසො සාරිපුත්ත, සාවකස්ස පතිරූපං: යං සත්ථාරං පරිචරෙය්ය මනාපෙනෙව නො අමනාපෙන, අනුපවජ්ජං ඡන්නො භික්ඛු සත්ථං ආහරිස්සතී’ති. එවමෙතං ආවුසො සාරිපුත්ත, ධාරෙහීති."
            },
            {
                "type": "paragraph",
                "text": "පුච්ඡෙය්යාම මයං ආයස්මන්තං ඡන්නං කඤ්චීදෙව දෙසං, සචෙ ආයස්මා ඡන්නො ඔකාසං කරොති පඤ්හස්ස වෙය්යාකරණායා’ති. පුච්ඡාවුසො සාරිපුත්ත, සුත්වා වෙදිස්සාමාති."
            },
            {
                "type": "paragraph",
                "text": "චක්ඛුං ආවුසො ඡන්න, චක්ඛුවිඤ්ඤාණං චක්ඛුවිඤ්ඤාණවිඤ්ඤාතබ්බෙ ධම්මෙ එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති සමනුපස්සසි. සොතං ආවුසො ඡන්න, සොතවිඤ්ඤාණං -පෙ- ඝානං, ආවුසො ඡන්න, ඝානවිඤ්ඤාණං -පෙ- ජිව්හං, ආවුසො ඡන්න, ජිව්හාවිඤ්ඤාණං -පෙ- කායං, ආවුසො ඡන්න, කායවිඤ්ඤාණං -පෙ- මනං, ආවුසො ඡන්න, මනොවිඤ්ඤාණං. මනොවිඤ්ඤාණවිඤ්ඤාතබ්බෙ ධම්මෙ එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති සමනුපස්සසීති."
            },
            {
                "type": "paragraph",
                "text": "චක්ඛුං ආවුසො සාරිපුත්ත, චක්ඛුවිඤ්ඤාණං චක්ඛුවිඤ්ඤාණවිඤ්ඤාතබ්බෙ ධම්මෙ නෙතං මම, නෙසොහමස්මි, න මෙසො අත්තා’ති සමනුපස්සාමි. සොතං ආවුසො සාරිපුත්ත, සොතවිඤ්ඤාණං -පෙ- ඝානං, ආවුසො සාරිපුත්ත, ඝාණවිඤ්ඤාණං -පෙ- ජිව්හං, ආවුසො සාරිපුත්ත, ජිව්හාවිඤ්ඤාණං -පෙ- කායං, ආවුසො සාරිපුත්ත, කායවිඤ්ඤාණං -පෙ- මනං, ආවුසො සාරිපුත්ත, මනොවිඤ්ඤාණං මනොවිඤ්ඤාණවිඤ්ඤාතබ්බෙ ධම්මෙ නෙතං මම, නෙසොහමස්මි, න මෙසො අත්තා’ති සමනුපස්සාමීති."
            },
            {
                "type": "page-break",
                "text": "542"
            },
            {
                "type": "paragraph",
                "text": "චක්ඛුස්මිං ආවුසො ඡන්න, චක්ඛුවිඤ්ඤාණෙ චක්ඛුවිඤ්ඤාණවිඤ්ඤාතබ්බෙසු ධම්මෙසු කිං දිස්වා කිං අභිඤ්ඤාය චක්ඛුං චක්ඛුවිඤ්ඤාණං චක්ඛුවිඤ්ඤාණවිඤ්ඤාතබ්බෙ ධම්මෙ නෙතං මම, නෙසොහමස්මි, න මෙසො අත්තා’ති සමනුපස්සසි. සොතස්මිං ආවුසො ඡන්න, සොතවිඤ්ඤාණෙ -පෙ- ඝානස්මිං ආවුසො ඡන්න, ඝානවිඤ්ඤාණෙ -පෙ- ජිව්හාය ආවුසො ඡන්න, ජිව්හාවිඤ්ඤාණෙ -පෙ- කායස්මිං ආවුසො ඡන්න, කායවිඤ්ඤාණෙ -පෙ- මනස්මිං ආවුසො ඡන්න, මනොවිඤ්ඤාණෙ මනොවිඤ්ඤාණවිඤ්ඤාතබ්බෙසු ධම්මෙසු කිං දිස්වා කිං අභිඤ්ඤාය මනං මනොවිඤ්ඤාණං මනොවිඤ්ඤාණවිඤ්ඤාතබ්බෙ ධම්මෙ නෙතං මම, නෙසොහමස්මි, න මෙසො අත්තා’ති සමනුපස්සසීති."
            },
            {
                "type": "paragraph",
                "text": "චක්ඛුස්මිං ආවුසො සාරිපුත්ත, චක්ඛුවිඤ්ඤාණෙ චක්ඛුවිඤ්ඤාණවිඤ්ඤාතබ්බෙසු ධම්මෙසු නිරොධං දිස්වා නිරොධං අභිඤ්ඤාය චක්ඛුං චක්ඛුවිඤ්ඤාණං චක්ඛුවිඤ්ඤාණවිඤ්ඤාතබ්බෙ ධම්මෙ නෙතං මම, නෙසොහමස්මි, න මෙසො අත්තා’ති සමනුපස්සාමි. සොතස්මිං ආවුසො සාරිපුත්ත, සොතවිඤ්ඤාණෙ -පෙ- ඝානස්මිං ආවුසො සාරිපුත්ත, ඝානවිඤ්ඤාණෙ -පෙ- ජිව්හාය ආවුසො සාරිපුත්ත, ජිව්හාවිඤ්ඤාණෙ -පෙ- කායස්මිං ආවුසො සාරිපුත්ත, කායවිඤ්ඤාණෙ -පෙ- මනස්මිං ආවුසො සාරිපුත්ත, මනොවිඤ්ඤාණෙ, මනොවිඤ්ඤාණවිඤ්ඤාතබ්බෙසු ධම්මෙසු නිරොධං දිස්වා නිරොධං අභිඤ්ඤාය මනං මනොවිඤ්ඤාණං මනොවිඤ්ඤාණවිඤ්ඤාතබ්බෙ ධම්මෙ නෙතං මම, නෙසොහමස්මි, න මෙසො අත්තා’ති සමනුපස්සාමීති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ ආයස්මා මහාචුන්දො, ආයස්මන්තං ඡන්නං එතදවොච: තස්මාතිහ ආවුසො ඡන්න, ඉදම්පි තස්ස භගවතො සාසනං නිච්චකප්පං මනසි කාතබ්බං: නිස්සිතස්ස චලිතං. අනිස්සිතස්ස චලිතං නත්ථි. චලිතෙ අසති පස්සද්ධි. පස්සද්ධියා සති නති න හොති. නතියා අසති ආගතිගති න හොති. ආගතිගතියා අසති චුතූපපාතො න හොති. චුතූපපාතෙ අසති නෙව ඉධ න හුරං න උභයමන්තරෙන. එසෙවන්තො දුක්ඛස්සා’ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා සාරිපුත්තො ආයස්මා ච මහාචුන්දො ආයස්මන්තං ඡන්නං ඉමිනා ඔවාදෙන ඔවදිත්වා උට්ඨායාසනා පක්කමිංසු. අථ ඛො ආයස්මා ඡන්නො, අචිරපක්කන්තෙ ආයස්මන්තෙ ච සාරිපුත්තෙ ආයස්මන්තෙ ච මහාචුන්දෙ සත්ථං ආහරෙසි. අථ ඛො ආයස්මා සාරිපුත්තො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා සාරිපුත්තො භගවන්තං එතදවොච: ආයස්මතා භන්තෙ, ඡන්නෙන සත්ථං ආහරිතං, තස්ස කා ගති කො අභිසම්පරායොති:"
            },
            {
                "type": "page-break",
                "text": "544"
            },
            {
                "type": "paragraph",
                "text": "නනු තෙ සාරිපුත්ත, ඡන්නෙන භික්ඛුනා සම්මුඛායෙව අනුපවජ්ජතා බ්යාකතාති:"
            },
            {
                "type": "paragraph",
                "text": "අත්ථි භන්තෙ, පුබ්බජිරං නාම වජ්ජිගාමො. තත්රායස්මතො{1 තත්ථායස්මතො - මඡසං.} ඡන්නස්ස මිත්තකුලානි සුහජ්ජකුලානි උපවජ්ජකුලානී’ති. හොන්ති හෙතෙ සාරිපුත්ත, ඡන්නස්ස භික්ඛුනො මිත්තකුලානි සුහජ්ජකුලානි උපවජ්ජකුලානි. නාහං සාරිපුත්ත, එත්තාවතා සඋපවජ්ජොති වදාමි. යො ඛො සාරිපුත්ත, ඉමඤ්ච කායං නික්ඛිපති. අඤ්ඤඤ්ච කායං උපාදියති, තමහං සඋපවජ්ජො’ති වදාමි. තං ඡන්නස්ස භික්ඛුනො නත්ථි. අනුපවජ්ජො, ඡන්නො භික්ඛු සත්ථං ආහරෙසීති{2 එවමෙතං සාරිපුත්ත ධාරෙහීති - මඡසං, අධිකං.}."
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච භගවා. අත්තමනො ආයස්මා සාරිපුත්තො භගවතො භාසිතං අභිනන්දීති."
            },
            {
                "type": "centered",
                "text": "ඡන්නොවාද සුත්තං දුතියං.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "546"
            },
            {
                "type": "centered",
                "text": "3.5.3",
                "level": "1"
            },
            {
                "type": "heading",
                "text": " පුණ්ණොවාද සුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එවං මෙ සුතං: එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. අථ ඛො ආයස්මා පුණ්ණො සායන්හසමයං පතිසල්ලානා වුට්ඨිතො යෙන භගවා, තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා පුණ්ණො භගවන්තං එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "සාධු මං භන්තෙ, භගවා සඞ්ඛිත්තෙන ඔවාදෙන ඔවදතු, ‘යමහං භගවතො ධම්මං සුත්වා එකො වූපකට්ඨො අප්පමත්තො ආතාපී පහිතත්තො විහරෙය්ය’න්ති."
            },
            {
                "type": "paragraph",
                "text": "තෙන හි පුණ්ණ, සුෙණාහි, සාධුකං මනසි කරොහි, භාසිස්සාමීති."
            },
            {
                "type": "paragraph",
                "text": "එවං භන්තෙති ඛො ආයස්මා පුණ්ණො භගවතො පච්චස්සොසි. භගවා එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "සන්ති ඛො පුණ්ණ, චක්ඛුවිඤ්ඤෙය්යා රූපා ඉට්ඨා කන්තා මනාපා පියරූපා කාමූපසංහිතා රජනීයා. තඤ්චෙ භික්ඛු අභිනන්දති, අභිවදති, අජ්ඣොසාය තිට්ඨති. තස්ස තං අභිනන්දතො අභිවදතො අජ්ඣොසාය තිට්ඨතො උප්පජ්ජති නන්දි, නන්දි සමුදයා දුක්ඛසමුදයො පුණ්ණාති වදාමි."
            },
            {
                "type": "paragraph",
                "text": "සන්ති ඛො පුණ්ණ, සොතවිඤ්ඤෙය්යා සද්දා -පෙ- ඝානවිඤ්ඤෙය්යා ගන්ධා -පෙ- ජිව්හාවිඤ්ඤෙය්යා රසා -පෙ- කායවිඤ්ඤෙය්යා ඵොට්ඨබ්බා -පෙ- මනොවිඤ්ඤෙය්යා ධම්මා ඉට්ඨා කන්තා මනාපා පියරූපා කාමූපසංහිතා රජනීයා. තං චෙ භික්ඛු අභිනන්දති අභිවදති අජ්ඣොසාය තිට්ඨති. තස්ස තං අභිනන්දතො අභිවදතො අජ්ඣොසාය තිට්ඨතො උප්පජ්ජති නන්දි. නන්දිසමුදයා දුක්ඛසමුදයො පුණ්ණාති වදාමි."
            },
            {
                "type": "paragraph",
                "text": "සන්ති ඛො පුණ්ණ, චක්ඛුවිඤ්ඤෙය්යා රූපා ඉට්ඨා කන්තා මනාපා පියරූපා කාමූපසංහිතා රජනීයා, තඤ්චෙ භික්ඛු නාභිනන්දති. නාභිවදති. නාජ්ඣොසාය තිට්ඨති. තස්ස තං අනභිනන්දතො අනභිවදතො අනජ්ඣොසාය තිට්ඨතො නන්දි නිරුජ්ඣති. ‘නන්දි නිරොධා දුක්ඛනිරොධො පුණ්ණාති වදාමි."
            },
            {
                "type": "paragraph",
                "text": "සන්ති ඛො පුණ්ණ, සොතවිඤ්ඤෙය්යා සද්දා -පෙ- ඝානවිඤ්ඤෙය්යා ගන්ධා -පෙ- ජිව්හාවිඤ්ඤෙය්යා රසා -පෙ- කායවිඤ්ඤෙය්යා ඵොට්ඨබ්බා -පෙ- මනොවිඤ්ඤෙය්යා ධම්මා ඉට්ඨා කන්තා මනාපා පියරූපා කාමූපසංහිතා රජනීයා. තඤ්චෙ භික්ඛු නාභිනන්දති, නාභිවදති, නාජ්ඣොසාය තිට්ඨති. තස්ස තං අනභිනන්දතො අනභිවදතො අනජ්ඣොසාය තිට්ඨතො නන්දී නිරුජ්ඣති. නන්දීනිරොධා දුක්ඛනිරොධො පුණ්ණාති වදාමි."
            },
            {
                "type": "page-break",
                "text": "548"
            },
            {
                "type": "paragraph",
                "text": "ඉමිනා ච ත්වං පුණ්ණ, මයා සඞ්ඛිත්තෙන ඔවාදෙන ඔවදිතො කතරස්මිං ජනපදෙ විහරිස්සසීති. ඉමිනාහං භන්තෙ, භගවතා සඞ්ඛිත්තෙන ඔවාදෙන ඔවදිතො අත්ථි සුණාපරන්තො නාම ජනපදො තත්ථාහං විහරිස්සාමි."
            },
            {
                "type": "paragraph",
                "text": "චණ්ඩා ඛො පුණ්ණ, සුණාපරන්තකා මනුස්සා, ඵරුසා ඛො පුණ්ණ, සුණාපරන්තකා මනුස්සා. සචෙ තං පුණ්ණ, සුණාපරන්තකා මනුස්සා අක්කොසිස්සන්ති පරිභාසිස්සන්ති, තත්ථ තෙ පුණ්ණ කින්ති භවිස්සතී’ති."
            },
            {
                "type": "paragraph",
                "text": "සචෙ මං භන්තෙ, සුණාපරන්තකා මනුස්සා අක්කොසිස්සන්ති. පරිභාසිස්සන්ති, තත්ථ මෙ එවං භවිස්සති: ‘භද්දකා වතිමෙ සුණාපරන්තකා මනුස්සා, සුභද්දකා වතිමෙ සුණාපරන්තකා මනුස්සා. යං මෙ නයිමෙ පාණිනා පහාරං දෙන්තී’ති. එවමෙත්ථ භගවා, භවිස්සති. එවමෙත්ථ සුගත, භවිස්සතී’ති."
            },
            {
                "type": "paragraph",
                "text": "සචෙ පන තෙ පුණ්ණ, සුණාපරන්තකා මනුස්සා පාණිනා පහාරං දස්සන්ති, තත්ථ පන තෙ පුණ්ණ, කින්ති භවිස්සතී’ති."
            },
            {
                "type": "paragraph",
                "text": "සචෙ මෙ{1 සචෙ මං - සීමු.} භන්තෙ, සුණාපරන්තකා මනුස්සා පාණිනා පහාරං දස්සන්ති. තත්ථ මෙ එවං භවිස්සති: ‘භද්දකා වතිමෙ සුණාපරන්තකා මනුස්සා, සුභද්දකා වතිමෙ සුණාපරන්තකා මනුස්සා, යං මෙ නයිමෙ ලෙඩ්ඩුනා පහාරං දෙන්තී’ති. එවමෙත්ථ භගවා, භවිස්සති. එවමෙත්ථ සුගත, භවිස්සතී’ති."
            },
            {
                "type": "paragraph",
                "text": "සචෙ පන තෙ පුණ්ණ, සුණාපරන්තකා මනුස්සා ලෙඩ්ඩුනා පහාරං දස්සන්ති. තත්ථ පන තෙ පුණ්ණ, කින්ති භවිස්සතී’ති. සචෙ මෙ භන්තෙ, සුණාපරන්තකා මනුස්සා ලෙඩ්ඩුනා පහාරං දස්සන්ති, තත්ථ මෙ එවං භවිස්සති: ‘භද්දකා වතිමෙ සුණාපරන්තකා මනුස්සා, සුභද්දකා වතිමෙ සුණාපරන්තකා මනුස්සා, යං මෙ නයිමෙ දණ්ඩෙන පහාරං දෙන්තී’ති. එවමෙත්ථ භගවා, භවිස්සති. එවමෙත්ථ සුගත, භවිස්සතී’ති."
            },
            {
                "type": "paragraph",
                "text": "සචෙ පන තෙ පුණ්ණ, සුණාපරන්තකා මනුස්සා දණ්ඩෙන පහාරං දස්සන්ති. තත්ථ පන තෙ පුණ්ණ, කින්ති භවිස්සතී’ති. ‘සචෙ පන මෙ භන්තෙ, සුණාපරන්තකා මනුස්සා දණ්ඩෙන පහාරං දස්සන්ති. තත්ථ මෙ එවං භවිස්සති: භද්දකා වතිමෙ සුණාපරන්තකා මනුස්සා, සුභද්දකා වතිමෙ සුණාපරන්තකා මනුස්සා, යං මෙ නයිමෙ සත්ථෙන පහාරං දෙන්තී’ති. එවමෙත්ථ භගවා, භවිස්සති එවමෙත්ථ සුගත, භවිස්සතී’ති."
            },
            {
                "type": "paragraph",
                "text": "සචෙ පන තෙ පුණ්ණ, සුණාපරන්තකා මනුස්සා සත්ථෙන පහාරං දස්සන්ති. තත්ථ පන තෙ පුණ්ණ, කින්ති භවිස්සතී’ති. ‘සචෙ මෙ භන්තෙ සුණාපරන්තකා මනුස්සා සත්ථෙන පහාරං දස්සන්ති. තත්ථ මෙ එවං භවිස්සති: ‘භද්දකා වතිමෙ සුණාපරන්තකා මනුස්සා, සුභද්දකා වතිමෙ සුණාපරන්තකා මනුස්සා, යං මං{2 යං මෙ - සීමු.} නයිමෙ තිණ්හෙන සත්ථෙන ජීවිතා වොරොපෙන්ති. එවමෙත්ථ භගවා, භවිස්සති. එවමෙත්ථ සුගත, භවිස්සතී’ති."
            },
            {
                "type": "page-break",
                "text": "550"
            },
            {
                "type": "paragraph",
                "text": "සචෙ පන තං පුණ්ණ{1 සචෙ පන තෙ පුණ්ණ - මඡසං.}, සුණාපරන්තකා මනුස්සා තිණ්හෙන සත්ථෙන ජීවිතා වොරොපෙස්සන්ති. තත්ථ පන තෙ පුණ්ණ, කින්ති භවිස්සතී’ති. සචෙ මං භන්තෙ, සුණාපරන්තකා මනුස්සා තිණ්හෙන සත්ථෙන ජීවිතා වොරොපෙන්ති. තත්ථ පන මෙ එවං භවිස්සති: සන්ති ඛො භගවතො සාවකා කායෙන ච ජීවිතෙන ච අට්ටියමානා හරායමානා ජිගුච්ඡමානා සත්ථහාරකං පරියෙසන්ති. තං මෙ ඉදං අපරියිට්ඨංයෙව සත්ථහාරකං ලද්ධන්ති. එවමෙත්ථ භගවා, භවිස්සති. එවමෙත්ථ සුගත, භවිස්සතී’ති."
            },
            {
                "type": "paragraph",
                "text": "සාධු සාධු පුණ්ණ, සක්ඛිස්සසි ඛො ත්වං පුණ්ණ, ඉමිනා දමූපසමෙන සමන්නාගතො සුණාපරන්තස්මිං ජනපදෙ විහරිතුං. යස්සදානි ත්වං පුණ්ණ, කාලං මඤ්ඤසීති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා පුණ්ණො භගවතො භාසිතං අභිනන්දිත්වා අනුමොදිත්වා උට්ඨායාසනා භගවන්තං අභිවාදෙත්වා පදක්ඛිණං කත්වා සෙනාසනං සංසාමෙත්වා පත්තචීවරං ආදාය යෙන සුණාපරන්තො ජනපදො, තෙන චාරිකං පක්කාමි. අනුපුබ්බෙන චාරිකං චරමානො යෙන සුණාපරන්තො ජනපදො, තදවසරි. තත්ර සුදං ආයස්මා පුණ්ණො සුණාපරන්තස්මිං ජනපදෙ විහරති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා පුණ්ණො තෙනෙවන්තරවස්සෙන පඤ්චමත්තානි උපාසකසතානි පටිපාදෙසි.{2 උපාසකසතානි පටිවෙදෙසි - මඡසං.} තෙනෙවන්තර වස්සෙන පඤ්චමත්තානි උපාසිකාසතානි පටිපාදෙසි. තෙනෙවන්තරවස්සෙන තිස්සො විජ්ජා සච්ඡාකාසි. අථ ඛො ආයස්මා පුණ්ණො අපරෙන සමයෙන පරිනිබ්බායි. අථ ඛො සම්බහුලා භික්ඛූ යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නා ඛො තෙ භික්ඛූ භගවන්තං එතදවොචුං: යො සො භන්තෙ, පුණ්ණො නාම කුලපුත්තො භගවතා සඞ්ඛිත්තෙන ඔවාදෙන ඔවදිතො, සො කාලඞ්කතො. තස්ස කා ගති, කො අභිසම්පරායො’ති."
            },
            {
                "type": "paragraph",
                "text": "පණ්ඩිතො භික්ඛවෙ, පුණ්ණො කුලපුත්තො, පච්චපාදී ධම්මස්සානුධම්මං, න ච මං ධම්මාධිකරණං විහෙඨෙසි. පරිනිබ්බුතො භික්ඛවෙ, පුණ්ණො කුලපුත්තොති."
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච භගවා. අත්තමනා තෙ භික්ඛූ භගවතො භාසිතං අභිනන්දුන්ති."
            },
            {
                "type": "centered",
                "text": "පුණ්ණොවාද සුත්තං තතියං.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "552"
            },
            {
                "type": "centered",
                "text": "3.5.4",
                "level": "1"
            },
            {
                "type": "heading",
                "text": " නන්දකොවාද සුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එවං මෙ සුතං: එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. අථ ඛො මහාපජාපතී ගොතමී පඤ්චමත්තෙහි භික්ඛුනීසතෙහි සද්ධිං යෙන භගවා තෙනුපසඞ්කමි, උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතා ඛො මහාපජාපතී ගොතමී භගවන්තං එතදවොච: ‘ඔවදතු භන්තෙ, භගවා භික්ඛුනියො, අනුසාසතු භන්තෙ, භගවා භික්ඛුනියො, කරොතු භන්තෙ, භගවා භික්ඛුනීනං ධම්මිං කථ’න්ති."
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන ථෙරා භික්ඛූ භික්ඛුනියො ඔවදන්ති පරියායෙන. ආයස්මා පන නන්දකො න ඉච්ඡති භික්ඛුනියො ඔවදිතුං පරියායෙන. අථ ඛො භගවා ආයස්මන්තං ආනන්දං ආමන්තෙසි: ‘කස්ස නු ඛො ආනන්ද, අජ්ජ පරියායො භික්ඛුනියො ඔවදිතුං පරියායෙනා’ති."
            },
            {
                "type": "paragraph",
                "text": "නන්දකස්ස භන්තෙ, පරියායො භික්ඛුනියො ඔවදිතුං පරියායෙන{1 සබ්බෙහෙව භන්තෙ, කතො පරියායො භික්ඛුනියො ඔවදිතුං - මඡසං, සීමු.}, අයං භන්තෙ, ආයස්මා නන්දකො න ඉච්ඡති භික්ඛුනියො ඔවදිතුං පරියායෙනා’ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා ආයස්මන්තං නන්දකං ආමන්තෙසි: ‘ඔවද නන්දක, භික්ඛුනියො. අනුසාස නන්දක, භික්ඛුනියො, කරොහි ත්වං බ්රාහ්මණ. භික්ඛුනීනං ධම්මිං කථ’න්ති."
            },
            {
                "type": "paragraph",
                "text": "එවං භන්තෙති ඛො ආයස්මා නන්දකො භගවතො පටිස්සුත්වා පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරං ආදාය සාවත්ථිං පිණ්ඩාය පාවිසි. සාවත්ථියං පිණ්ඩාය චරිත්වා පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො අත්තදුතියො යෙන රාජකාරාමො තෙනුපසඞ්කමි. අද්දසංසු{2 අද්දසාසුං - PTS.} ඛො තා භික්ඛුනියො ආයස්මන්තං නන්දකං දූරතොව ආගච්ඡන්තං දිස්වාන ආසනං පඤ්ඤාපෙසුං, උදකඤ්ච පාදානං උපට්ඨපෙසුං. නිසීදි ඛො ආයස්මා නන්දකො පඤ්ඤත්තෙ ආසනෙ, නිසජ්ජ පාදෙ පක්ඛාලෙසි. තාපි ඛො භික්ඛුනියො ආයස්මන්තං නන්දකං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නා ඛො තා භික්ඛුනියො ආයස්මා නන්දකො එතදවොච: පටිපුච්ඡකථා ඛො භගිනියො, භවිස්සති. තත්ථ ආජානන්තීහි ආජානාමාතිස්ස වචනීයං, න ආජානන්තීහි න ආජානාමාතිස්ස වචනීයං. යස්සා වා පනස්ස කඞ්ඛා වා විමති වා, අහමෙව තත්ථ පටිපුච්ඡිතබ්බො: ‘ඉදං භන්තෙ, කථං ඉමස්ස ක්වත්ථො’ති."
            },
            {
                "type": "paragraph",
                "text": "එත්තකෙනපි මයං භන්තෙ, අය්යස්ස නන්දකස්ස අත්තමනා අභිරද්ධා. යං නො අෙය්යා නන්දකො පවාරෙතී’ති."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤථ භගිනියො, චක්ඛුං{3 චක්ඛු - මඡසං, සීමු.} නිච්චං වා අනිච්චං වාති?"
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ."
            },
            {
                "type": "page-break",
                "text": "554"
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං වා තං සුඛං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිනාමධම්මං, කල්ලං නු තං සමනුපස්සිතුං. එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤථ භගිනියො, සොතං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "ඝානං නිච්චං වා අනිච්චං වා’ති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ. -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "ජිව්හා නිච්චා වා අනිච්චා වා’ති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චා, භන්තෙ. -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "කායො නිච්චො වා අනිච්චො වා’ති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චො භන්තෙ. -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "මනො නිච්චො වා අනිච්චො වා’ති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චො භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං වා තං සුඛං වා’ති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං කල්ලං නු තං සමනුපස්සිතුං එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ. තං කිස්ස හෙතු: පුබ්බෙව නො හෙතං භන්තෙ, යථාභූතං සම්මප්පඤ්ඤාය සුදිට්ඨං: ‘ඉතිපිමෙ ඡ අජ්ඣත්තිකා ආයතනා අනිච්චා’ති."
            },
            {
                "type": "paragraph",
                "text": "සාධු සාධු භගිනියො, එවං හෙතං භගිනියො, හොති අරියසාවකස්ස යථාභූතං සම්මප්පඤ්ඤාය පස්සතො. තං කිං මඤ්ඤථ භගිනියො, රූපා නිච්චා වා අනිච්චා වා’ති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චා භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං වා තං සුඛං වා’ති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං කල්ලං නු තං සමනුපස්සිතුං. එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤථ භගිනියො, සද්දා නිච්චා වා අනිච්චා වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චා භන්තෙ -පෙ-"
            },
            {
                "type": "page-break",
                "text": "556"
            },
            {
                "type": "paragraph",
                "text": "ගන්ධා නිච්චා වා අනිච්චා වා’ති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චා භන්තෙ. -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "රසා නිච්චා වා අනිච්චා වා’ති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චා භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "ඵොට්ඨබ්බා නිච්චා වා අනිච්චා වා’ති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චා භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "ධම්මා නිච්චා වා අනිච්චා වා’ති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චා භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං වා තං සුඛං වා’ති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං, කල්ලං නු තං සමනුපස්සිතුං එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ. තං කිස්ස හෙතු: පුබ්බෙව නො හෙතං භන්තෙ, යථාභූතං සම්මප්පඤ්ඤාය සුදිට්ඨං: ඉතිපි මෙ ඡ බාහිරා ආයතනා අනිච්චා’ති."
            },
            {
                "type": "paragraph",
                "text": "සාධු සාධු භගිනියො, එවං හෙතං භගිනියො, හොති අරියසාවකස්ස යථාභූතං සම්මප්පඤ්ඤාය පස්සතො. තං කිං මඤ්ඤථ භගිනියො, චක්ඛුවිඤ්ඤාණං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං වා තං සුඛං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං, කල්ලං නු තං සමනුපස්සිතුං. එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤථ භගිනියො, සොතවිඤ්ඤාණං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "ඝානවිඤ්ඤාණං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "ජිව්හාවිඤ්ඤාණං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "කායවිඤ්ඤාණං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "මනොවිඤ්ඤාණං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං, දුක්ඛං වා තං සුඛං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "page-break",
                "text": "558"
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං, කල්ලං නු තං සමනුපස්සිතුං එතං මම එසොහමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ. තං කිස්ස හෙතු: පුබ්බෙව නො හෙතං භන්තෙ, යථාභූතං සම්මප්පඤ්ඤාය සුදිට්ඨං: ඉතිපි මෙ ඡ විඤ්ඤාණකායා අනිච්චා’ති."
            },
            {
                "type": "paragraph",
                "text": "සාධු සාධු භගිනියො, එවං හෙතං භගිනියො, හොති අරියසාවකස්ස යථාභූතං සම්මප්පඤ්ඤාය පස්සතො."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භගිනියො, තෙලප්පදීපස්ස ඣායතො තෙලම්පි අනිච්චං විපරිණාමධම්මං, වට්ටිපි අනිච්චා විපරිණාමධම්මා, අච්චිපි අනිච්චා විපරිණාමධම්මා, ආභාපි අනිච්චා විපරිණාමධම්මා. යො නු ඛො භගිනියො එවං වදෙය්ය, ‘අමුස්ස තෙලප්පදීපස්ස ඣායතො තෙලම්පි අනිච්චං විපරිණාමධම්මං, වට්ටිපි අනිච්චා විපරිණාමධම්මා, අච්චිපි අනිච්චා විපරිණාමධම්මා, යා ඛ්වාස්ස ආභා, සා නිච්චා ධුවා සස්සතා අවිපරිණාමධම්මා’ති. සම්මා නු ඛො සො භගිනියො, වදමානො වදෙය්යාති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ. තං කිස්ස හෙතු: අමුස්ස හි භන්තෙ, තෙලප්පදීපස්ස ඣායතො තෙලම්පි අනිච්චං විපරිණාමධම්මං, වට්ටිපි අනිච්චා විපරිණාමධම්මා, අච්චිපි අනිච්චා විපරිණාමධම්මා, පගෙවස්ස ආභා අනිච්චා විපරිණාමධම්මා’ති."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො භගිනියො, යො නු ඛො එවං වදෙය්ය, ඡ හි ඛො ඉමා අජ්ඣත්තිකා ආයතනා අනිච්චා, යඤ්ච ඛො ඡ අජ්ඣත්තිකෙ ආයතනෙ පටිච්ච පටිසංවෙදෙති සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා, තං නිච්චං ධුවං සස්සතං අවිපරිණාමධම්මන්ති. සම්මා{1 යං සම්මා - සීමු.} නු ඛො සො භගිනියො, වදමානො වදෙය්යා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ. තං කිස්ස හෙතු, ‘තජ්ජං තජ්ජං භන්තෙ. පච්චයං පටිච්ච තජ්ජා තජ්ජා වෙදනා උප්පජ්ජන්ති. තජ්ජස්ස තජ්ජස්ස පච්චයස්ස නිරොධා තජ්ජා තජ්ජා වෙදනා නිරුජ්ඣන්තී’ති."
            },
            {
                "type": "paragraph",
                "text": "සාධු සාධු භගිනියො, එවං හෙතං භගිනියො, හොති අරියසාවකස්ස යථාභූතං සම්මප්පඤ්ඤාය පස්සතො."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භගිනියො, මහතො රුක්ඛස්ස තිට්ඨතො සාරවතො මූලම්පි අනිච්චං විපරිණාමධම්මං, ඛන්ධොපි අනිච්චො විපරිණාමධම්මො, සාඛාපලාසම්පි අනිච්චං විපරිණාමධම්මං, ඡායාපි අනිච්චා විපරිණාමධම්මා. යො නු ඛො භගිනියො, එවං වදෙය්ය: ‘අමුස්ස මහතො රුක්ඛස්ස තිට්ඨතො සාරවතො මූලම්පි අනිච්චං විපරිණාමධම්මං, ඛන්ධොපි අනිච්චො විපරිණාමධම්මො, සාඛාපලාසම්පි අනිච්චං විපරිණාමධම්මං, යා ච ඛ්වාස්ස ඡායා සා නිච්චා ධුවා සස්සතා අවිපරිණාමධම්මා’ති. සම්මා නු ඛො සො භගිනියො, වදමානො වදෙය්යා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ. තං කිස්ස හෙතු: ‘අමුස්ස හි භන්තෙ, මහතො රුක්ඛස්ස තිට්ඨතො සාරවතො මූලම්පි අනිච්චං විපරිණාමධම්මං, ඛන්ධොපි අනිච්චො විපරිණාමධම්මො, සාඛාපලාසම්පි අනිච්චං විපරිණාමධම්මං, පගෙවස්ස ඡායා අනිච්චා විපරිණාමධම්මා’ති."
            },
            {
                "type": "page-break",
                "text": "560"
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො භගිනියො, යො නු ඛො එවං වදෙය්ය: ඡ ඛො මෙ බාහිරා ආයතනා අනිච්චා විපරිණාමධම්මා. යඤ්ච ඛො ඡ බාහිරෙ ආයතනෙ පටිච්ච පටිසංවෙදෙමි සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා, තං නිච්චං ධුවං සස්සතං අවිපරිණාමධම්මන්ති, සම්මා නු ඛො සො භගිනියො, වදමානො වදෙය්යා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ. තං කිස්ස හෙතු: තජ්ජං තජ්ජං භන්තෙ, පච්චයං පටිච්ච තජ්ජා තජ්ජා වෙදනා උප්පජ්ජන්ති. තජ්ජස්ස තජ්ජස්ස පච්චයස්ස නිරොධා තජ්ජා තජ්ජා වෙදනා නිරුජ්ඣන්තී’ති."
            },
            {
                "type": "paragraph",
                "text": "සාධු සාධු භගිනියො, එවං හෙතං භගිනියො, හොති අරියසාවකස්ස යථාභූතං සම්මප්පඤ්ඤාය පස්සතො."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භගිනියො, දක්ඛො ගොඝාතකො වා ගොඝාතකන්තෙවාසී වා ගාවිං වධිත්වා තිණ්හෙන. ගොවිකන්තනෙන ගාවිං විකන්තෙය්ය,{1 සඞ්කන්තෙය්ය - මඡසං, සීමු.} අනුපහච්ච අන්තරං මංසකායං, අනුපහච්ච බාහිරං චම්මකායං, යං යදෙව තත්ථ අන්තරා විලීමංසං, අන්තරා නහාරූ, අන්තරා බන්ධනං, තං තදෙව තිණ්හෙන ගොවිකන්තනෙන සඤ්ඡින්දෙය්ය සඞ්කන්තෙය්ය සම්පකන්තෙය්ය සම්පරිකන්තෙය්ය. සඤ්ඡින්දිත්වා සඞ්කන්තිත්වා සම්පකන්තිත්වා සම්පරිකන්තිත්වා විධුනිත්වා බාහිරං චම්මකායං තෙනෙව චම්මෙන තං ගාවිං පටිච්ඡාදෙත්වා එවං වදෙය්ය: ‘තථෙවායං ගාවී සංයුත්තා ඉමිනාව චම්මෙනා’ති. සම්මා නු ඛො සො භගිනියො, වදමානො වදෙය්යා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ. තං කිස්ස හෙතු: අමු හි භන්තෙ, දක්ඛො ගොඝාතකො වා ගොඝාතකන්තෙවාසී වා ගාවිං වධිත්වා තිණ්හෙන ගොවිකන්තනෙන ගාවිං සඞ්කන්තෙය්ය අනුපහච්ච අන්තරං මංසකායං. අනුපහච්ච බාහිරං චම්මකායං. යං යදෙව තත්ථ අන්තරා විලීමංසං, අන්තරා නහාරූ, අන්තරා බන්ධනං, තං තදෙව තිණ්හෙන ගොවිකන්තනෙන සඤ්ඡින්දෙය්ය, සඞ්කන්තෙය්ය, සම්පකන්තෙය්ය, සම්පරිකන්තෙය්ය. සඤ්ඡින්දිත්වා සඞ්කන්තිත්වා සම්පකන්තිත්වා සම්පරිකන්තිත්වා විධුනිත්වා බාහිරං චම්මකායං තෙනෙව චම්මෙන තං ගාවිං පටිච්ඡාදෙත්වා කිඤ්චාපි සො එවං වදෙය්ය: ‘තථෙවායං ගාවී සංයුත්තා ඉමිනාව චම්මෙනා’ති. අථ ඛො සා ගාවී විසංයුත්තා තෙනෙව චම්මෙනා’ති."
            },
            {
                "type": "paragraph",
                "text": "උපමා ඛො මෙ අයං භගිනියො, කතා අත්ථස්ස විඤ්ඤාපනාය. අයමෙවෙත්ථ අත්ථො: ‘අන්තරා මංසකායොති ඛො භගිනියො ඡන්නෙතං අජ්ඣත්තිකානං ආයතනානං අධිවචනං. බාහිරො චම්මකායොති ඛො භගිනියො, ඡන්නෙතං බාහිරානං ආයතනානං අධිවචනං. අන්තරා විලීමංසං අන්තරා නහාරූ අන්තරා බන්ධනන්ති ඛො භගිනියො, නන්දීරාගස්සෙතං අධිවචනං. තිණ්හං ගොවිකන්තනන්ති ඛො භගිනියො, අරියායෙතං පඤ්ඤාය අධිවචනං. යා’යං අරියා පඤ්ඤා අන්තරා කිලෙසං අන්තරා සඤ්ඤොජනං අන්තරා බන්ධනං සඤ්ඡින්දති සඞ්කන්තති සම්පකන්තති සම්පරිකන්තති."
            },
            {
                "type": "page-break",
                "text": "562"
            },
            {
                "type": "paragraph",
                "text": "සත්ත ඛො ඉමෙ භගිනියො, බොජ්ඣඞ්ගා යෙසං භාවිතත්තා බහුලීකතත්තා භික්ඛු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙවධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති. කතමෙ සත්ත: ඉධ භගිනියො, භික්ඛු සතිසම්බොජ්ඣඞ්ගං භාවෙති විවෙකනිස්සිතං විරාගනිස්සිතං නිරොධනිස්සිතං වොස්සග්ගපරිණාමිං, ධම්මවිචයසම්බොජ්ඣඞ්ගං භාවෙති -පෙ- විරියසම්බොජ්ඣඞ්ගං භාවෙති -පෙ- භාවෙති -පෙ- පස්සද්ධිසම්බොජ්ඣඞ්ගං භාවෙති -පෙ- සමාධිසම්බොජ්ඣඞ්ගං භාවෙති -පෙ- උපෙක්ඛාසම්බොජ්ඣඞ්ගං භාවෙති විවෙකනිස්සිතං විරාගනිස්සිතං නිරොධනිස්සිතං වොස්සග්ගපරිණාමිං. ඉමෙ ඛො භගිනියො, සත්ත බොජ්ඣඞ්ගා: යෙසං භාවිතත්තා බහුලීකතත්තා භික්ඛු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතී’ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා නන්දකො තා භික්ඛුනියො ඉමිනා ඔවාදෙන ඔවදිත්වා උෙය්යාජෙසි: ‘ගච්ඡථ භගිනියො, කාලො’ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො තා භික්ඛුනියො ආයස්මතො නන්දකස්ස භාසිතං අභිනන්දිත්වා අනුමොදිත්වා උට්ඨායාසනා ආයස්මන්තං නන්දකං අභිවාදෙත්වා පදක්ඛිණං කත්වා යෙන භගවා, තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං අට්ඨංසු. එකමන්තං ඨිතා ඛො තා භික්ඛුනියො භගවා එතදවොච: ‘ගච්ඡථ, භික්ඛුනියො කාලො’ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො තා භික්ඛුනියො භගවන්තං අභිවාදෙත්වා පදක්ඛිණං කත්වා පක්කමිංසු."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා අචිරපක්කන්තීසු තාසු භික්ඛුනීසු භික්ඛූ ආමන්තෙසි: ‘සෙය්යථාපි භික්ඛවෙ, තදහුපොසථෙ චාතුද්දසෙ න හොති බහුනොජනස්ස කඞ්ඛා වා විමති වා: ‘ඌනො නු ඛො චන්දො, පුණ්ණො නු ඛො චන්දො’ති. අථ ඛො ඌනො චන්දො ත්වෙව හොති. එවමෙව ඛො භික්ඛවෙ, තා භික්ඛුනියො නන්දකස්ස ධම්මදෙසනාය අත්තමනා චෙව හොන්ති, නො ච ඛො පරිපුණ්ණ සඞ්කප්පා’ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා ආයස්මන්තං නන්දකං ආමන්තෙසි: ‘තෙන හි ත්වං නන්දක, ස්වෙපි තා භික්ඛුනියො තෙනෙවොවාදෙන ඔවදෙය්යාසීති. එවං භන්තෙති ඛො ආයස්මා නන්දකො භගවතො පච්චස්සොසි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා නන්දකො තස්සා රත්තියා අච්චයෙන පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරං ආදාය සාවත්ථිං පිණ්ඩාය පාවිසි. සාවත්ථියං පිණ්ඩාය චරිත්වා පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො අත්තදුතියො යෙන රාජකාරාමො තෙනුපසඞ්කමි. අද්දසංසු ඛො තා භික්ඛුනියො ආයස්මන්තං නන්දකං දූරතොව ආගච්ඡන්තං දිස්වාන ආසනං පඤ්ඤාපෙසුං. උදකඤ්ච පාදානං උපට්ඨපෙසුං. නිසීදි ඛො ආයස්මා නන්දකො පඤ්ඤත්තෙ ආසනෙ. නිසජ්ජ පාදෙ පක්ඛාලෙසි. තාපි ඛො භික්ඛුනියො ආයස්මන්තං නන්දකං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නා ඛො තා භික්ඛුනියො ආයස්මා නන්දකො එතදවොච: ‘පටිපුච්ඡකථා ඛො, භගිනියො, භවිස්සති. තත්ථ ආජානන්තීහි ආජානාමාතිස්ස වචනීයං. න ආජානන්තීහි න ආජානාමාතිස්ස වචනීයං. යස්සා වා පනස්ස කඞ්ඛා වා විමති වා, අහමෙව තත්ථ පටිපුච්ඡිතබ්බො: ‘ඉදං භන්තෙ කථං ඉමස්ස ක්වත්ථො’ති."
            },
            {
                "type": "page-break",
                "text": "564"
            },
            {
                "type": "paragraph",
                "text": "එත්තකෙනපි මයං භන්තෙ, අය්යස්ස නන්දකස්ස අත්තමනා අභිරද්ධා, යං නො අෙය්යා නන්දකො පවාරෙතී’ති."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤථ භගිනියො, චක්ඛුං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං, දුක්ඛං වා තං සුඛං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං, කල්ලං නු තං සමනුපස්සිතුං: ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤථ භගිනියො, සොතං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "ඝානං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "ජිව්හා නිච්චා වා අනිච්චා වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චා භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "කායො නිච්චොවා අනිච්චො වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චො භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "මනො නිච්චො වා අනිච්චො වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චො භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං වා තං සුඛං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං, කල්ලං නු තං සමනුපස්සිතුං: ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ. තං කිස්ස හෙතු: පුබ්බෙව නො හෙතං භන්තෙ, යථාභූතං සම්මප්පඤ්ඤාය සුදිට්ඨං: ‘ඉතිපි මෙ ඡ අජ්ඣත්තිකා ආයතනා අනිච්චා’ති."
            },
            {
                "type": "paragraph",
                "text": "සාධු සාධු භගිනියො, එවං හෙතං භගිනියො, හොති අරියසාවකස්ස යථාභූතං සම්මප්පඤ්ඤාය පස්සතො. තං කිං මඤ්ඤථ භගිනියො, රූපා නිච්චා වා අනිච්චා වාති:"
            },
            {
                "type": "paragraph",
                "text": "අනිච්චා භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං වා තං සුඛං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං, කල්ලං නු තං සමනුපස්සිතුං: ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තාති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ."
            },
            {
                "type": "page-break",
                "text": "566"
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤථ, භගිනියො, සද්දා නිච්චා වා අනිච්චා වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චා භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "ගන්ධා නිච්චා වා අනිච්චා වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චා භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "රසා නිච්චා වා අනිච්චා වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චා භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "ඵොට්ඨබ්බා නිච්චා වා අනිච්චා වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චා භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "ධම්මා නිච්චා වා අනිච්චා වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චා භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං වා තං සුඛං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං, කල්ලං නු තං සමනුපස්සිතුං: ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ. තං කිස්ස හෙතු: පුබ්බෙව නො හෙතං භන්තෙ, යථාභූතං සම්මප්පඤ්ඤාය සුදිට්ඨං: ‘ඉතිපි මෙ ඡ බාහිරා ආයතනා අනිච්චා’ති."
            },
            {
                "type": "paragraph",
                "text": "සාධු සාධු භගිනියො, එවං හෙතං භගිනියො, හොති අරියසාවකස්ස යථාභූතං සම්මප්පඤ්ඤාය පස්සතො. තං කිං මඤ්ඤථ භගිනියො, චක්ඛුවිඤ්ඤාණං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං වා තං සුඛං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං, කල්ලං නු තං සමනුපස්සිතුං: ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තාති?"
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤථ භගිනියො, සොතවිඤ්ඤාණං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ. -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "ඝානවිඤ්ඤාණං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "ජිව්හාවිඤ්ඤාණං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "කායවිඤ්ඤාණං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "මනොවිඤ්ඤාණං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ."
            },
            {
                "type": "page-break",
                "text": "568"
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං වා තං සුඛං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං කල්ලං නු තං සමනුපස්සිතුං: ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ. "
            },
            {
                "type": "paragraph",
                "text": "තං කිස්ස හෙතු: පුබ්බෙව නො හෙතං භන්තෙ, යථාභූතං සම්මප්පඤ්ඤාය සුදිට්ඨං: ‘ඉතිපි මෙ ඡ විඤ්ඤාණකායා අනිච්චා’ති."
            },
            {
                "type": "paragraph",
                "text": "සාධු සාධු භගිනියො, එවං හෙතං භගිනියො හොති අරියසාවකස්ස යථාභූතං සම්මප්පඤ්ඤාය පස්සතො."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භගිනියො, තෙලප්පදීපස්ස ඣායතො තෙලම්පි අනිච්චං විපරිණාමධම්මං, වට්ටිපි අනිච්චා විපරිණාමධම්මා, අච්චිපි අනිච්චා විපරිණාමධම්මා, ආභාපි අනිච්චා විපරිණාමධම්මා. යො නු ඛො, භගිනියො, එවං වදෙය්ය: ‘අමුස්ස තෙලප්පදීපස්ස ඣායතො තෙලම්පි අනිච්චං විපරිණාමධම්මං, වට්ටිපි අනිච්චා විපරිණාමධම්මා, අච්චිපි අනිච්චා විපරිණාමධම්මා, යා ච ඛ්වාස්ස ආභා සා නිච්චා ධුවා සස්සතා අවිපරිණාමධම්මා’ති. සම්මා නු ඛො සො භගිනියො, වදමානො වදෙය්යාති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ. තං කිස්ස හෙතු: ‘අමුස්ස හි භන්තෙ, තෙලප්පදීපස්ස ඣායතො තෙලම්පි අනිච්චං විපරිණාමධම්මං, වට්ටිපි අනිච්චා විපරිණාමධම්මා, අච්චිපි අනිච්චා විපරිණාමධම්මා, පගෙවස්ස ආභා අනිච්චා විපරිණාමධම්මා’ති."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො භගිනියො, යො නු ඛො එවං වදෙය්ය: ‘ඡ ඛොමෙ අජ්ඣත්තිකා ආයතනා අනිච්චා. යඤ්ච ඛො ඡ අජ්ඣත්තිකෙ ආයතනෙ පටිච්ච පටිසංවෙදෙමි සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා. තං නිච්චං ධුවං සස්සතං අවිපරිණාමධම්ම’න්ති. සම්මා නු ඛො සො, භගිනියො, වදමානො වදෙය්යා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ. තං කිස්ස හෙතු: ‘තජ්ජං තජ්ජං භන්තෙ, පච්චයං පටිච්ච තජ්ජා තජ්ජා වෙදනා උප්පජ්ජන්ති. තජ්ජස්ස තජ්ජස්ස පච්චයස්ස නිරොධා තජ්ජා තජ්ජා වෙදනා නිරුජ්ඣන්තී’ති."
            },
            {
                "type": "paragraph",
                "text": "සාධු සාධු භගිනියො, එවං හෙතං භගිනියො, හොති අරියසාවකස්ස යථාභූතං සම්මප්පඤ්ඤාය පස්සතො."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භගිනියො, මහතො රුක්ඛස්ස තිට්ඨතො සාරවතො මූලම්පි අනිච්චං විපරිණාමධම්මං, ඛන්ධොපි අනිච්චො විපරිණාමධම්මො, සාඛාපලාසම්පි අනිච්චං විපරිණාමධම්මං, ඡායාපි අනිච්චා විපරිණාමධම්මා. යො නු ඛො භගිනියො, එවං වදෙය්ය: ‘අමුස්ස මහතො රුක්ඛස්ස තිට්ඨතො සාරවතො මූලම්පි අනිච්චං විපරිණාමධම්මං, ඛන්ධොපි අනිච්චො විපරිණාමධම්මො, සාඛාපලාසම්පි අනිච්චං විපරිණාමධම්මං, යා ච ඛ්වාස්ස ඡායා සා නිච්චා ධුවා සස්සතා අවිපරිණාමධම්ෙමා’ති. ‘සම්මා නු ඛො සො භගිනියො, වදමානො වදෙය්යා’ති."
            },
            {
                "type": "page-break",
                "text": "570"
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ. තං කිස්ස හෙතු: ‘අමුස්ස හි භන්තෙ මහතො රුක්ඛස්ස තිට්ඨතො සාරවතො මූලම්පි අනිච්චං විපරිණාමධම්මං, ඛන්ධොපි අනිච්චො විපරිණාමධම්මො, සාඛාපලාසම්පි අනිච්චං විපරිණාමධම්මං, පගෙවස්ස ඡායා අනිච්චා විපරිණාමධම්මාති."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො භගිනියො, යො නු ඛො එවං වදෙය්ය: ‘ඡ ඛො මෙ බාහිරා ආයතනා අනිච්චා විපරිණාමධම්මා. යඤ්ච ඛො ඡ බාහිරෙ ආයතනෙ පටිච්ච පටිසංවෙදෙති සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා, තං නිච්චං ධුවං සස්සතං අවිපරිණාමධම්ම’න්ති. සම්මා නු ඛො සො භගිනියො, වදමානො වදෙය්යා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ. තං කිස්ස හෙතු: ‘තජ්ජං තජ්ජං භන්තෙ, පච්චයං පටිච්ච තජ්ජා තජ්ජා වෙදනා උප්පජ්ජන්ති. තජ්ජස්ස තජ්ජස්ස පච්චයස්ස නිරොධා තජ්ජා තජ්ජා වෙදනා නිරුජ්ඣන්තී’ති."
            },
            {
                "type": "paragraph",
                "text": "සාධු සාධු භගිනියො, එවං හෙතං භගිනියො, හොති අරියසාවකස්ස යථාභූතං සම්මප්පඤ්ඤාය පස්සතො."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භගිනියො, දක්ඛො ගොඝාතකො වා ගොඝාතකන්තෙවාසී වා ගාවිං වධිත්වා තිණ්හෙන ගොවිකන්තනෙන ගාවිං චිකන්තෙය්ය, අනුපහච්ච අන්තරං මංසකායං, අනුපහච්ච බාහිරං චම්මකායං. යං යදෙව තත්ථ අන්තරා විලීමංසං අන්තරා නහාරූ, අන්තරා බන්ධනං, තං තදෙව තිණ්හෙන ගොවිකන්තනෙන සඤ්ඡින්දෙය්ය සඞ්කන්තෙය්ය සම්පකන්තෙය්ය සම්පරිකන්තෙය්ය. සඤ්ඡින්දිත්වා සඞ්කන්තිත්වා සම්පකන්තිත්වා සම්පරිකන්තිත්වා විධුනිත්වා බාහිරං චම්මකායං, තෙනෙව චම්මෙන තං ගාවිං පටිච්ඡාදෙත්වා එවං වදෙය්ය: ‘තථෙවායං ගාවී සංයුත්තා ඉමිනා චම්මෙනා’ති. ‘සම්මා නු ඛො සො භගිනියො, වදමානො වදෙය්යා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ. තං කිස්ස හෙතු: ‘අසු හි භන්තෙ, දක්ඛො ගොඝාතකො වා ගොඝාතකන්තෙවාසී වා ගාවිං වධිත්වා තිණ්හෙන ගොවිකන්තනෙන ගාවිං විකන්තෙය්ය, අනුපහච්ච අන්තරං මංසකායං, අනුපහච්ච බාහිරං චම්මකායං, යං යදෙව තත්ථ අන්තරා විලීමංසං, අන්තරා නහාරූ, අන්තරා බන්ධනං, තං තදෙව තිණ්හෙන ගොවිකන්තනෙන සඤ්ඡින්දෙය්ය සඞ්කන්තෙය්ය සම්පකන්තෙය්ය සම්පරිකන්තෙය්ය. සඤ්ඡින්දිත්වා සඞ්කන්තිත්වා සම්පකන්තිත්වා සම්පරිකන්තිත්වා විධුනිත්වා බාහිරං චම්මකායං තෙනෙව චම්මෙන තං ගාවිං පටිච්ඡාදෙත්වා කිඤ්චාපි සො එවං වදෙය්ය: ‘තථෙවායං ගාවී සංයුත්තා ඉමිනා චම්මෙනා’ති. අථ ඛො සා ගාවී විසංයුත්තා තෙනෙව චම්මෙනා’ති."
            },
            {
                "type": "paragraph",
                "text": "උපමා ඛො මෙ අයං භගිනියො, කතා අත්ථස්ස විඤ්ඤාපනාය. අයමෙවෙත්ථ අත්ථො: ‘අන්තරා මංසකායොති ඛො භගිනියො, ඡන්නෙතං අජ්ඣත්තිකානං ආයතනානං අධිවචනං. බාහිරො චම්මකායොති ඛො භගිනියො, ඡන්නෙතං බාහිරානං ආයතනානං අධිවචනං. අන්තරා විලීමංසං අන්තරා නහාරූ අන්තරා බන්ධනන්ති ඛො භගිනියො, නන්දීරාගස්සෙතං අධිවචනං. තිණ්හං ගොවිකන්තනන්ති ඛො භගිනියො, අරියායෙතං පඤ්ඤාය අධිවචනං, යායං අරියා පඤ්ඤා අන්තරා කිලෙසං අන්තරා සඤ්ඤොජනං අන්තරා බන්ධනං සඤ්ඡින්දති සඞ්කන්තති සම්පකන්තති සම්පරිකන්තති."
            },
            {
                "type": "page-break",
                "text": "572"
            },
            {
                "type": "paragraph",
                "text": "සත්ත ඛො පනිමෙ භගිනියො, බොජ්ඣඞ්ගා යෙසං භාවිතත්තා බහුලීකතත්තා භික්ඛු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙවධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරති. කතමෙ සත්ත: ඉධ භගිනියො, භික්ඛු සතිසම්බොජ්ඣඞ්ගං භාවෙති විවෙකනිස්සිතං විරාගනිස්සිතං නිරොධනිස්සිතං වොස්සග්ගපරිණාමිං. ධම්මවිචයසම්බොජ්ඣඞ්ගං භාවෙති -පෙ- විරියසම්බොජ්ඣඞ්ගං භාවෙති. -පෙ- පීතිසම්බොජ්ඣඞ්ගං භාවෙති -පෙ- පස්සද්ධිසම්බොජ්ඣඞ්ගං භාවෙති -පෙ- සමාධිසම්බොජ්ඣඞ්ගං භාවෙති -පෙ- උපෙක්ඛාසම්බොජ්ඣඞ්ගං භාවෙති විවෙකනිස්සිතං විරාගනිස්සිතං නිරොධනිස්සිතං වොස්සග්ගපරිණාමිං. ඉමෙ ඛො භගිනියො සත්ත බොජ්ඣඞ්ගා යෙසං භාවිතත්තා බහුලීකතත්තා භික්ඛු ආසවානං ඛයා අනාසවං චෙතොවිමුත්තිං පඤ්ඤාවිමුත්තිං දිට්ඨෙවධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරතී’ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා නන්දකො තා භික්ඛුනියො ඉමිනා ඔවාදෙන ඔවදිත්වා උෙය්යාජෙසි: ‘ගච්ඡථ භගිනියො, කාලො’ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො තා භික්ඛුනියො ආයස්මතො නන්දකස්ස භාසිතං අභිනන්දිත්වා අනුමොදිත්වා උට්ඨායාසනා ආයස්මන්තං නන්දකං අභිවාදෙත්වා පදක්ඛිණං කත්වා යෙන භගවා, තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං අට්ඨංසු. එකමන්තං ඨිතා ඛො තා භික්ඛුනියො භගවා එතදවොච: ‘ගච්ඡථ භික්ඛුනියො, කාලො’ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො තා භික්ඛුනියො භගවන්තං අභිවාදෙත්වා පදක්ඛිණං කත්වා පක්කමිංසු. අථ ඛො භගවා අචිරපක්කන්තීසු තාසු භික්ඛුනීසු භික්ඛූ ආමන්තෙසි: ‘සෙය්යථාපි භික්ඛවෙ, තදහුපොසථෙ පණ්ණරසෙ න හොති බහුනො ජනස්ස කඞ්ඛා වා විමති වා: ‘ඌනො නු ඛො චන්දො පුණ්ණො නු ඛො චන්දො’ති, අථ ඛො පුණ්ණො චන්දොත්වෙව හොති. එවමෙව ඛො භික්ඛවෙ, තා භික්ඛුනියො නන්දකස්ස ධම්මදෙසනාය අත්තමනා චෙව පරිපුණ්ණසඞ්කප්පා ච. තාසං භික්ඛවෙ, පඤ්චන්නං භික්ඛුනීසතානං යා පච්ඡිමා{1 පච්ඡිමිකා - මඡසං.} භික්ඛුනී, සා සොතාපන්නා{2 තා භික්ඛුනියො සොතාපන්නා - මඡසං.} අවිනිපාතධම්මා නියතා සම්බොධිපරායණාති."
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච භගවා. අත්තමනා තෙ භික්ඛූ භගවතො භාසිතං අභිනන්දුන්ති."
            },
            {
                "type": "centered",
                "text": "නන්දකොවාද සුත්තං චතුත්ථං.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "574"
            },
            {
                "type": "centered",
                "text": "3. 5. 5",
                "level": "1"
            },
            {
                "type": "heading",
                "text": " චූළරාහුලොවාද සුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එවං මෙ සුතං: එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. අථ ඛො භගවතො රහොගතස්ස පතිසල්ලීනස්ස එවං චෙතසො පරිවිතක්කො උදපාදි. පරිපක්කා ඛො රාහුලස්ස විමුත්තිපරිපාචනීයා ධම්මා. යන්නූනාහං රාහුලං උත්තරිං ආසවානං ඛයෙ විනෙය්යන්ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා පුබ්බන්හසමයං නිවාසෙත්වා පත්තචීවරං ආදාය සාවත්ථිං පිණ්ඩාය පාවිසි. සාවත්ථියං පිණ්ඩාය චරිත්වා පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො ආයස්මන්තං රාහුලං ආමන්තෙසි: ‘ගණ්හාහි රාහුල නිසීදනං, යෙන අන්ධවනං තෙනුපසඞ්කමිස්සාම දිවාවිහාරායා’ති."
            },
            {
                "type": "paragraph",
                "text": "එවං භන්තෙති ඛො ආයස්මා රාහුලො භගවතො පටිස්සුත්වා නිසීදනං ආදාය භගවන්තං{1 භගවතො - සීචු.} පිට්ඨිතො පිට්ඨිතො අනුබන්ධි."
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන අනෙකානි දෙවතාසහස්සානි භගවන්තං අනුබන්ධානි හොන්ති. ‘අජ්ජ භගවා ආයස්මන්තං රාහුලං උත්තරිං ආසවානං ඛයෙ විනෙස්සතී’ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා අන්ධවනං අජ්ඣොගහෙත්වා අඤ්ඤතරස්මිං රුක්ඛමූලෙ පඤ්ඤත්තෙ ආසනෙ නිසීදි. ආයස්මාපි ඛො රාහුලො භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො ආයස්මන්තං රාහුලං භගවා එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "‘තං කිං මඤ්ඤසි රාහුල, චක්ඛු නිච්චං{2 චක්ඛු නිච්චං - මඡසං, සීමු.} වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං, දුක්ඛං වා තං සුඛං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං, කල්ලං නු තං සමනුපස්සිතුං: ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤසි රාහුල, රූපා නිච්චා වා අනිච්චා වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චා භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං, දුක්ඛං වා තං සුඛං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං, කල්ලං නු තං සමනුපස්සිතුං: ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ."
            },
            {
                "type": "page-break",
                "text": "576"
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤසි රාහුල, චක්ඛුවිඤ්ඤාණං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං, දුක්ඛං වා තං සුඛං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං, කල්ලං නු තං සමනුපස්සිතුං: ‘එතං මම, එසො හමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤසි රාහුල, චක්ඛුසම්ඵස්සො නිච්චො වා අනිච්චො වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චො භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "‘යං පනානිච්චං, දුක්ඛං වා තං සුඛං වා’ති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං, විපරිණාමධම්මං, කල්ලං නු තං සමනුපස්සිතුං: ‘එතං මම, එසො හමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤසි රාහුල, යම්පිදං චක්ඛුසම්ඵස්සපච්චයා උප්පජ්ජති වෙදනාගතං සඤ්ඤාගතං සඞ්ඛාරගතං විඤ්ඤාණගතං, තම්පි නිච්චං වා අනිච්චං වා’ති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං, දුක්ඛං වා තං සුඛං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං, කල්ලං නු තං සමනුපස්සිතුං: ‘එතං මම, එසො හමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤසි රාහුල, සොතං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "ඝානං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "ජිව්හා නිච්චා වා අනිච්චා වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චා භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "කායො නිච්චො වා අනිච්චො වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චො භන්තෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "මනො නිච්චො වා අනිච්චො වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චො භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං, දුක්ඛං වා තං සුඛං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "page-break",
                "text": "578"
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං, කල්ලං නු තං සමනුපස්සිතුං:‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤසි රාහුල, ධම්මා නිච්චා වා අනිච්චා වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චා භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං වා තං සුඛං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං, කල්ලං නු තං සමනුපස්සිතුං: ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤසි රාහුල, මනොවිඤ්ඤාණං නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං, දුක්ඛං වා තං සුඛං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං, කල්ලං නු තං සමනුපස්සිතුං: ‘එතං මම, එසො හමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤසි රාහුල, මනොසම්ඵස්සො නිච්චො වා අනිච්චො වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චො භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං, දුක්ඛං වා තං සුඛං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං දුක්ඛං විපරිණාමධම්මං, කල්ලං නු තං සමනුපස්සිතුං: ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤසි රාහුල, යම්පිදං මනොසම්ඵස්සපච්චයා උප්පජ්ජති වෙදනාගතං සඤ්ඤාගතං සඞ්ඛාරගතං විඤ්ඤාණගතං, තම්පි නිච්චං වා අනිච්චං වාති."
            },
            {
                "type": "paragraph",
                "text": "අනිච්චං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යං පනානිච්චං, දුක්ඛං වා තං සුඛං වාති."
            },
            {
                "type": "paragraph",
                "text": "දුක්ඛං භන්තෙ."
            },
            {
                "type": "paragraph",
                "text": "යම්පනානිච්චං දුක්ඛං විපරිණාමධම්මං කල්ලං නු තං සමනුපස්සිතුං: ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති."
            },
            {
                "type": "paragraph",
                "text": "නො හෙතං භන්තෙ."
            },
            {
                "type": "page-break",
                "text": "580"
            },
            {
                "type": "paragraph",
                "text": "එවං පස්සං රාහුල, සුතවා අරියසාවකො චක්ඛුස්මිං නිබ්බින්දති, රූපෙසු නිබ්බින්දති, චක්ඛුවිඤ්ඤාණෙ නිබ්බින්දති, චක්ඛුසම්ඵස්සෙ නිබ්බින්දති, යම්පිදං{1 යමිදං - සීමු, මඡසං.} චක්ඛුසම්ඵස්සපච්චයා උප්පජ්ජති වෙදනාගතං සඤ්ඤාගතං සඞ්ඛාරගතං විඤ්ඤාණගතං තස්මිම්පි නිබ්බින්දති. සොතස්මිං නිබ්බින්දති, සද්දෙසු නිබ්බින්දති -පෙ- ඝානස්මිං නිබ්බින්දති, ගන්ධෙසු නිබ්බින්දති -පෙ-ජිව්හාය නිබ්බින්දති, රසෙසු නිබ්බින්දති -පෙ- කායස්මිං නිබ්බින්දති, ඵොට්ඨබ්බෙසු නිබ්බින්දති -පෙ-මනස්මිං නිබ්බින්දති, ධම්මෙසු නිබ්බින්දති, මනොවිඤ්ඤාණෙ නිබ්බින්දති, මනොසම්ඵස්සෙ නිබ්බින්දති, යම්පිදං{2 යමිදං - සීමු, මඡසං.} මනොසම්ඵස්සපච්චයා උප්පජ්ජති වෙදනාගතං සඤ්ඤාගතං සඞ්ඛාරගතං විඤ්ඤාණගතං තස්මිම්පි නිබ්බින්දති. නිබ්බින්දං විරජ්ජති, විරාගා විමුච්චති. විමුත්තස්මිං විමුත්තමිති ඤාණං හොති: ඛීණා ජාති, වුසිතං බ්රහ්මචරියං, කතං කරණීයං, නාපරං ඉත්ථත්තායාති පජානාතීති."
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච භගවා. අත්තමනො ආයස්මා රාහුලො භගවතො භාසිතං අභිනන්දීති."
            },
            {
                "type": "paragraph",
                "text": "ඉමස්මිඤ්ච පන වෙය්යාකරණස්මිං භඤ්ඤමානෙ ආයස්මතො රාහුලස්ස අනුපාදාය ආසවෙහි චිත්තං විමුච්චි. තාසඤ්ච අනෙකානං දෙවතාසහස්සානං විරජං වීතමලං ධම්මචක්ඛුං උදපාදි: ‘යං කිඤ්චි සමුදයධම්මං සබ්බං තං නිරොධධම්ම’න්ති."
            },
            {
                "type": "centered",
                "text": "චූළරාහුලොවාද සුත්තං පඤ්චමං.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "582"
            },
            {
                "type": "centered",
                "text": "3. 5. 6",
                "level": "1"
            },
            {
                "type": "heading",
                "text": " ඡ ඡක්ක සුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එවං මෙ සුතං: එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි: ‘භික්ඛවො’ති. භදන්තෙති තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "ධම්මං වො භික්ඛවෙ, දෙසිස්සාමි ආදිකල්යාණං මජ්ඣෙකල්යාණං පරියොසානකල්යාණං සාත්ථං සව්යඤ්ජනං කෙවලපරිපුණ්ණං පරිසුද්ධං බ්රහ්මචරියං පකාසිස්සාමි. යදිදං ඡ ඡක්කානි. තං සුණාථ, සාධුකං මනසිකරොථ. භාසිස්සාමී’ති."
            },
            {
                "type": "paragraph",
                "text": "එවං භන්තෙති ඛො තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "ඡ අජ්ඣත්තිකානි ආයතනානි වෙදිතබ්බානි, ඡ බාහිරානි ආයතනානි වෙදිතබ්බානි, ඡ විඤ්ඤාණකායා වෙදිතබ්බා, ඡ ඵස්සකායා වෙදිතබ්බා, ඡ වෙදනාකායා වෙදිතබ්බා, ඡ තණ්හාකායා වෙදිතබ්බා."
            },
            {
                "type": "paragraph",
                "text": "ඡ අජ්ඣත්තිකානි ආයතනානි වෙදිතබ්බානී’ති ඉති ඛො පනෙතං වුත්තං. කිඤ්චෙතං පටිච්ච වුත්තං. චක්ඛායතනං, සොතායතනං, ඝානායතනං, ජිව්හායතනං , කායායතනං, මනායතනං. ‘ඡ අජ්ඣත්තිකානි ආයතනානි වෙදිතබ්බානී’ති ඉති යං තං වුත්තං, ඉදමෙතං පටිච්ච වුත්තං. ඉදං පඨමං ඡක්කං."
            },
            {
                "type": "paragraph",
                "text": "‘ඡ බාහිරානි ආයතනානි වෙදිතබ්බානී’ති ඉති ඛො පනෙතං වුත්තං. කිඤ්චෙතං පටිච්ච වුත්තං. රූපායතනං, සද්දායතනං, ගන්ධායතනං, රසායතනං, ඵොට්ඨබ්බායතනං, ධම්මායතනං. ඡ බාහිරානි ආයතනානි වෙදිතබ්බානී’ති. ඉති යං තං වුත්තං, ඉදමෙතං පටිච්ච වුත්තං. ඉදං දුතියං ඡක්කං."
            },
            {
                "type": "paragraph",
                "text": "‘ඡ විඤ්ඤාණකායා වෙදිතබ්බා’ති ඉති ඛො පනෙතං වුත්තං. කිඤ්චෙතං පටිච්ච වුත්තං. චක්ඛුඤ්ච පටිච්ච රූපෙ ච උප්පජ්ජති චක්ඛුවිඤ්ඤාණං, සොතඤ්ච පටිච්ච සද්දෙ ච උප්පජ්ජති සොතවිඤ්ඤාණං, ඝානඤ්ච පටිච්ච ගන්ධෙ ච උප්පජ්ජති ඝානවිඤ්ඤාණං, ජිව්හඤ්ච පටිච්ච රසෙ ච උප්පජ්ජති ජිව්හාවිඤ්ඤාණං, කායඤ්ච පටිච්ච ඵොට්ඨබ්බෙ ච උප්පජ්ජති කායවිඤ්ඤාණං, මනඤ්ච පටිච්ච ධම්මෙ ච උප්පජ්ජති මනොවිඤ්ඤාණං. ‘ඡ විඤ්ඤාණකායා වෙදිතබ්බා’ති ඉති යං තං වුත්තං, ඉදමෙතං පටිච්ච වුත්තං. ඉදං තතියං ඡක්කං."
            },
            {
                "type": "page-break",
                "text": "584"
            },
            {
                "type": "paragraph",
                "text": "‘ඡ ඵස්සකායා වෙදිතබ්බා’ති ඉති ඛො පනෙතං වුත්තං. කිඤ්චෙතං පටිච්ච වුත්තං. චක්ඛුඤ්ච පටිච්ච රූපෙ ච උප්පජ්ජති චක්ඛුවිඤ්ඤාණං, තිණ්ණං සඞ්ගති ඵස්සො. සොතඤ්ච පටිච්ච සද්දෙ ච උප්පජ්ජති සොතවිඤ්ඤාණං, තිණ්ණං සඞ්ගති ඵස්සො. ඝානඤ්ච පටිච්ච ගන්ධෙ ච උප්පජ්ජති ඝානවිඤ්ඤාණං, තිණ්ණං සඞ්ගති ඵස්සො. ජිව්හඤ්ච පටිච්ච රසෙ ච උප්පජ්ජති ජිව්හාවිඤ්ඤාණං, තිණ්ණං සඞ්ගති ඵස්සො. කායඤ්ච පටිච්ච ඵොට්ඨබ්බෙ ච උප්පජ්ජති කායවිඤ්ඤාණං, තිණ්ණං සඞ්ගති ඵස්සො. මනඤ්ච පටිච්ච ධම්මෙ ච උප්පජ්ජති මනොවිඤ්ඤාණං, තිණ්ණං සඞ්ගති ඵස්සො. ‘ඡ ඵස්සකායා වෙදිතබ්බා’ති ඉති යං තං වුත්තං, ඉදමෙතං පටිච්ච වුත්තං. ඉදං චතුත්ථං ඡක්කං."
            },
            {
                "type": "paragraph",
                "text": "‘ඡ වෙදනාකායා වෙදිතබ්බා’ති ඉති ඛො පනෙතං වුත්තං. කිඤ්චෙතං පටිච්ච වුත්තං. චක්ඛුඤ්ච පටිච්ච රූපෙ ච උප්පජ්ජති චක්ඛුවිඤ්ඤාණං, තිණ්ණං සඞ්ගති ඵස්සො, ඵස්සපච්චයා වෙදනා. සොතඤ්ච පටිච්ච සද්දෙ ච උප්පජ්ජති සොතවිඤ්ඤාණං, -පෙ- ඝානඤ්ච පටිච්ච ගන්ධෙ ච උප්පජ්ජති ඝානවිඤ්ඤාණං, -පෙ- ජිව්හඤ්ච පටිච්ච රසෙ ච උප්පජ්ජති ජිව්හාවිඤ්ඤාණං, -පෙ- කායඤ්ච පටිච්ච ඵොට්ඨබ්බෙ ච උප්පජ්ජති කායවිඤ්ඤාණං, -පෙ- මනඤ්ච පටිච්ච ධම්මෙ ච උප්පජ්ජති මනොවිඤ්ඤාණං, තිණ්ණං සඞ්ගති ඵස්සො, ඵස්සපච්චයා වෙදනා. ‘ඡ වෙදනාකායා වෙදිතබ්බා’ති ඉති යං තං වුත්තං, ඉදමෙතං පටිච්ච වුත්තං. ඉදං පඤ්චමං ඡක්කං."
            },
            {
                "type": "paragraph",
                "text": "‘ඡ තණ්හාකායා වෙදිතබ්බා’ති ඉති ඛො පනෙතං වුත්තං. කිඤ්චෙතං පටිච්ච වුත්තං. චක්ඛුඤ්ච පටිච්ච රූපෙ ච උප්පජ්ජති චක්ඛුවිඤ්ඤාණං, තිණ්ණං සඞ්ගති ඵස්සො, ඵස්සපච්චයා වෙදනා, වෙදනාපච්චයා තණ්හා. සොතඤ්ච පටිච්ච සද්දෙ ච උප්පජ්ජති සොතවිඤ්ඤාණං -පෙ- ඝානඤ්ච පටිච්ච ගන්ධෙ ච උප්පජ්ජති ඝානවිඤ්ඤාණං -පෙ- ජිව්හඤ්ච පටිච්ච රසෙ ච උප්පජ්ජති ජිව්හාවිඤ්ඤාණං -පෙ- කායඤ්ච පටිච්ච ඵොට්ඨබ්බෙ ච උප්පජ්ජති කායවිඤ්ඤාණං -පෙ- මනඤ්ච පටිච්ච ධම්මෙ ච උප්පජ්ජති මනොවිඤ්ඤාණං, තිණ්ණං සඞ්ගති ඵස්සො, ඵස්සපච්චයා වෙදනා, වෙදනාපච්චයා තණ්හා. ‘ඡ තණ්හාකායා වෙදිතබ්බා’ති ඉති යං තං වුත්තං, ඉදමෙතං පටිච්ච වුත්තං. ඉදං ඡට්ඨං ඡක්කං."
            },
            {
                "type": "paragraph",
                "text": "‘චක්ඛුං{1 චක්ඛු - මඡසං, සීමු.} අත්තා’ති යො වදෙය්ය, තං න උපපජ්ජති.{2 උප්පජ්ජති - PTS.} චක්ඛුස්ස උප්පාදොපි වයොපි පඤ්ඤායති. යස්ස ඛො පන උප්පාදොපි වයොපි පඤ්ඤායති, ‘අත්තා මෙ උප්පජ්ජති ච වෙති චා’ති ඉච්චස්ස එවමාගතං හොති. තස්මා තං න උපපජ්ජති, ‘චක්ඛුං අත්තා’ති යො වදෙය්ය. ඉති චක්ඛුං අනත්තා."
            },
            {
                "type": "paragraph",
                "text": "‘රූපා අත්තා’ති යො වදෙය්ය, තං න උපපජ්ජති. රූපානං උප්පාදොපි වයොපි පඤ්ඤායති. යස්ස ඛො පන උප්පාදොපි වයොපි පඤ්ඤායති. ‘අත්තා මෙ උප්පජ්ජති ච වෙති චා’ති ඉච්චස්ස එවමාගතං හොති. තස්මා තං න උපපජ්ජති, ‘රූපා අත්තා’ති යො වදෙය්ය. ඉති චක්ඛුං අනත්තා, රූපා අනත්තා."
            },
            {
                "type": "page-break",
                "text": "586"
            },
            {
                "type": "paragraph",
                "text": "‘චක්ඛුවිඤ්ඤාණං අත්තා’ති යො වදෙය්ය, තං න උපපජ්ජති. චක්ඛුවිඤ්ඤාණස්ස උප්පාදොපි වයොපි පඤ්ඤායති. යස්ස ඛො පන උප්පාදොපි වයොපි පඤ්ඤායති, ‘අත්තා මෙ උප්පජ්ජති ච වෙති චා’ති ඉච්චස්ස එවමාගතං හොති. තස්මා තං න උපපජ්ජති, ‘චක්ඛුවිඤ්ඤාණං අත්තා’ති යො වදෙය්ය. ඉති චක්ඛුං අනත්තා, රූපා අනත්තා, චක්ඛුවිඤ්ඤාණං අනත්තා."
            },
            {
                "type": "paragraph",
                "text": "‘චක්ඛුසම්ඵස්සො අත්තා’ති යො වදෙය්ය, තං න උපපජ්ජති. චක්ඛුසම්ඵස්සස්ස උප්පාදොපි වයොපි පඤ්ඤායති. යස්ස ඛො පන උප්පාදොපි වයොපි පඤ්ඤායති, ‘අත්තා මෙ උප්පජ්ජති ච වෙති චා’ති ඉච්චස්ස එවමාගතං හොති. තස්මා තං න උපපජ්ජති ‘චක්ඛුසම්ඵස්සො අත්තා’ති යො වදෙය්ය. ඉති චක්ඛුං අනත්තා, රූපා අනත්තා, චක්ඛුවිඤ්ඤාණං අනත්තා, චක්ඛුසම්ඵස්සො අනත්තා."
            },
            {
                "type": "paragraph",
                "text": "‘වෙදනා අත්තා’ති යො වදෙය්ය, තං න උපපජ්ජති. වෙදනාය උප්පාදොපි වයොපි පඤ්ඤායති. යස්ස ඛො පන උප්පාදොපි වයොපි පඤ්ඤායති, ‘අත්තා මෙ උප්පජ්ජති ච වෙති චා’ති ඉච්චස්ස එවමාගතං හොති. තස්මා තං න උපපජ්ජති ‘වෙදනා අත්තා’ති යො වදෙය්ය. ඉති චක්ඛුං අනත්තා, රූපා අනත්තා, චක්ඛුවිඤ්ඤාණං අනත්තා, චක්ඛුසම්ඵස්සො අනත්තා, වෙදනා අනත්තා."
            },
            {
                "type": "paragraph",
                "text": "‘තණ්හා අත්තා’ති යො වදෙය්ය, තං න උපපජ්ජති. තණ්හාය උප්පාදොපි වයොපි පඤ්ඤායති. යස්ස ඛො පන උප්පාදොපි වයොපි පඤ්ඤායති, ‘අත්තා මෙ උප්පජ්ජති ච වෙති චා’ති ඉච්චස්ස එවමාගතං හොති. තස්මා තං න උපපජ්ජති ‘තණ්හා අත්තා’ති යො වදෙය්ය. ඉති චක්ඛුං අනත්තා, රූපා අනත්තා, චක්ඛුවිඤ්ඤාණං අනත්තා, චක්ඛුසම්ඵස්සො අනත්තා, වෙදනා අනත්තා, තණ්හා අනත්තා."
            },
            {
                "type": "paragraph",
                "text": "‘සොතං අත්තා’ති යො වදෙය්ය -පෙ- ‘ඝානං අත්තා’ති යො වදෙය්ය -පෙ- ‘ජිව්හා අත්තා’ති යො වදෙය්ය -පෙ- ‘කායො අත්තා’ති යො වදෙය්ය -පෙ- ‘මනො අත්තා’ති යො වදෙය්ය, තං න උපපජ්ජති. මනස්ස උප්පාදොපි වයොපි පඤ්ඤායති. යස්ස ඛො පන උප්පාදොපි වයොපි පඤ්ඤායති, ‘අත්තා මෙ උප්පජ්ජති ච වෙති චා’ති ඉච්චස්ස එවමාගතං හොති. තස්මා තං න උපපජ්ජති ‘මනො අත්තා’ති යො වදෙය්ය. ඉති මනො අනත්තා."
            },
            {
                "type": "paragraph",
                "text": "‘ධම්මා අත්තා’ති යො වදෙය්ය තං න උපපජ්ජති. ධම්මානං උප්පාදොපි වයොපි පඤ්ඤායති. යස්ස ඛො පන උප්පාදොපි වයොපි පඤ්ඤායති, ‘අත්තා මෙ උප්පජ්ජති ච වෙති චා’ති ඉච්චස්ස එවමාගතං හොති. තස්මා තං න උපපජ්ජති. ‘ධම්මා අත්තා’ති යො වදෙය්ය. ඉති මනො අනත්තා, ධම්මා අනත්තා."
            },
            {
                "type": "paragraph",
                "text": "‘මනොවිඤ්ඤාණං අත්තා’ති යො වදෙය්ය තං න උපපජ්ජති. මනොවිඤ්ඤාණස්ස උප්පාදොපි වයොපි පඤ්ඤායති. යස්ස ඛො පන උප්පාදොපි වයොපි පඤ්ඤායති, ‘අත්තා මෙ උප්පජ්ජති ච වෙති චා’ති ඉච්චස්ස එවමාගතං හොති. තස්මා තං න උපපජ්ජති ‘මනොවිඤ්ඤාණං අත්තා’ති යො වදෙය්ය. ඉති මනො අනත්තා, ධම්මා අනත්තා, මනොවිඤ්ඤාණං අනත්තා."
            },
            {
                "type": "page-break",
                "text": "588"
            },
            {
                "type": "paragraph",
                "text": "‘මනොසම්ඵස්සො අත්තා’ති යො වදෙය්ය. තං න උපපජ්ජති. මනොසම්ඵස්සස්ස උප්පාදොපි වයොපි පඤ්ඤායති. යස්ස ඛො පන උප්පාදොපි වයොපි පඤ්ඤායති, ‘අත්තා මෙ උප්පජ්ජති ච වෙති චා’ති ඉච්චස්ස එවමාගතං හොති. තස්මා තං න උපපජ්ජති ‘මනොසම්ඵස්සො අත්තා’ති යො වදෙය්ය. ඉති මනො අනත්තා, ධම්මා අනත්තා, මනොවිඤ්ඤාණං අනත්තා, මනොසම්ඵස්සො අනත්තා."
            },
            {
                "type": "paragraph",
                "text": "‘වෙදනා අත්තා’ති යො වදෙය්ය. තං න උපපජ්ජති. වෙදනාය උප්පාදොපි වයොපි පඤ්ඤායති. යස්ස ඛො පන උප්පාදොපි වයොපි පඤ්ඤායති, ‘අත්තා මෙ උප්පජ්ජති ච වෙති චා’ති ඉච්චස්ස එවමාගතං හොති. තස්මා තං න උපපජ්ජති. ‘වෙදනා අත්තා’ති යො වදෙය්ය. ඉති මනො අනත්තා, ධම්මා අනත්තා, මනොවිඤ්ඤාණං අනත්තා, මනොසම්ඵස්සො අනත්තා, වෙදනා අනත්තා."
            },
            {
                "type": "paragraph",
                "text": "‘තණ්හා අත්තා’ති යො වදෙය්ය. තං න උපපජ්ජති. තණ්හාය උප්පාදොපි වයොපි පඤ්ඤායති. යස්ස ඛො පන උප්පාදොපි වයොපි පඤ්ඤායති, ‘අත්තා මෙ උප්පජ්ජති ච වෙති චා’ති ඉච්චස්ස එවමාගතං හොති. තස්මා තං න උපපජ්ජති ‘තණ්හා අත්තා’ති යො වදෙය්ය. ඉති මනො අනත්තා, ධම්මා අනත්තා, මනොවිඤ්ඤාණං අනත්තා, මනොසම්ඵස්සො අනත්තා, වෙදනා අනත්තා, තණ්හා අනත්තා."
            },
            {
                "type": "paragraph",
                "text": "අයං ඛො පන, භික්ඛවෙ, සක්කාය සමුදයගාමිනී පටිපදා: චක්ඛුං ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති සමනුපස්සති. රූපෙ ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති සමනුපස්සති. චක්ඛුවිඤ්ඤාණං ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති සමනුපස්සති. චක්ඛුසම්ඵස්සං ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති සමනුපස්සති. වෙදනං ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති සමනුපස්සති. තණ්හං ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති සමනුපස්සති. සොතං ‘එතං මම -පෙ- ඝානං ‘එතං මම -පෙ- ජිව්හං ‘එතං මම -පෙ- කායං ‘එතං මම -පෙ- මනං ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති සමනුපස්සති, ධම්මෙ ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති සමනුපස්සති, මනොවිඤ්ඤාණං ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති සමනුපස්සති, මනොසම්ඵස්සං ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති සමනුපස්සති, වෙදනං ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති සමනුපස්සති, තණ්හං ‘එතං මම, එසොහමස්මි, එසො මෙ අත්තා’ති සමනුපස්සති."
            },
            {
                "type": "paragraph",
                "text": "අයං ඛො පන භික්ඛවෙ, සක්කාය නිරොධගාමිනී පටිපදා: චක්ඛුං ‘නෙතං මම, නෙසොහමස්මි, න මෙසො අත්තා’ති සමනුපස්සති. රූපෙ ‘නෙතං මම, නෙසොහමස්මි, න මෙසො අත්තා’ති සමනුපස්සති. චක්ඛුවිඤ්ඤාණං ‘නෙතං මම, නෙසොහමස්මි, න මෙසො අත්තා’ති සමනුපස්සති. චක්ඛුසම්ඵස්සං ‘නෙතං මම, නෙසොහමස්මි, න මෙසො අත්තා’ති සමනුපස්සති. වෙදනං ‘නෙතං මම, නෙසොහමස්මි, න මෙසො අත්තා’ති සමනුපස්සති. තණ්හං ‘නෙතං මම, නෙසොහමස්මි, න මෙසො අත්තා’ති සමනුපස්සති. සොතං ‘නෙතං මම -පෙ- ඝානං ‘නෙතං මම -පෙ- ජිව්හං ‘නෙතං මම -පෙ- කායං ‘නෙතං මම -පෙ- මනං ‘නෙතං මම, නෙසොහමස්මි, න මෙසො අත්තා’ති සමනුපස්සති. "
            },
            {
                "type": "page-break",
                "text": "590"
            },
            {
                "type": "paragraph",
                "text": "ධම්මෙ ‘නෙතං මම, නෙසොහමස්මි, න මෙසො අත්තා’ති සමනුපස්සති. මනොවිඤ්ඤාණං ‘නෙතං මම, නෙසොහමස්මි, න මෙසො අත්තා’ති සමනුපස්සති. මනොසම්ඵස්සං ‘නෙතං මම, නෙසොහමස්මි, න මෙසො අත්තා’ති සමනුපස්සති. වෙදනං ‘නෙතං මම, නෙසොහමස්මි, න මෙසො අත්තා’ති සමනුපස්සති. තණ්හං ‘නෙතං මම, නෙසොහමස්මි, න මෙසො අත්තා’ති සමනුපස්සති."
            },
            {
                "type": "paragraph",
                "text": "චක්ඛුඤ්ච භික්ඛවෙ, පටිච්ච රූපෙ ච උප්පජ්ජති චක්ඛුවිඤ්ඤාණං. තිණ්ණං සඞ්ගති ඵස්සො. ඵස්සපච්චයා උප්පජ්ජති වෙදයිතං සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා. සො සුඛාය වෙදනාය ඵුට්ඨො සමානො අභිනන්දති අභිවදති අජ්ඣොසාය තිට්ඨති. තස්ස රාගානුසයො අනුසෙති. දුක්ඛාය වෙදනාය ඵුට්ඨො සමානො සොචති කිලමති පරිදෙවති උරත්තාළිංකන්දති සම්මොහං ආපජ්ජති. තස්ස පටිඝානුසයො අනුසෙති. අදුක්ඛමසුඛාය වෙදනාය ඵුට්ඨො සමානො තස්සා වෙදනාය සමුදයඤ්ච අත්ථඞ්ගමඤ්ච අස්සාදඤ්ච ආදීනවඤ්ච නිස්සරණඤ්ච යථාභූතං නප්පජානාති. තස්ස අවිජ්ජානුසයො අනුසෙති. සො වත භික්ඛවෙ, සුඛාය වෙදනාය රාගානුසයං අප්පහාය දුක්ඛාය වෙදනාය පටිඝානුසයං අප්පටිවිනොදෙත්වා අදුක්ඛමසුඛාය වෙදනාය අවිජ්ජානුසයං අසමූහනිත්වා අවිජ්ජං අප්පහාය විජ්ජං අනුප්පාදෙත්වා දිට්ඨෙව ධම්මෙ දුක්ඛස්සන්තකරො භවිස්සතීති නෙතං ඨානං විජ්ජති."
            },
            {
                "type": "paragraph",
                "text": "සොතඤ්ච භික්ඛවෙ, පටිච්ච සද්දෙ ච උප්පජ්ජති සොතවිඤ්ඤාණං. -පෙ- ඝානඤ්ච භික්ඛවෙ, පටිච්ච ගන්ධෙ ච උප්පජ්ජති ඝානවිඤ්ඤාණං. -පෙ- ජිව්හඤ්ච භික්ඛවෙ, පටිච්ච රසෙ ච උප්පජ්ජති ජිව්හාවිඤ්ඤාණං. -පෙ- කායඤ්ච භික්ඛවෙ, පටිච්ච ඵොට්ඨබ්බෙ ච උප්පජ්ජති කායවිඤ්ඤාණං. -පෙ- මනඤ්ච භික්ඛවෙ, පටිච්ච ධම්මෙ ච උප්පජ්ජති මනොවිඤ්ඤාණං, තිණ්ණං සඞ්ගති ඵස්සො, ඵස්සපච්චයා උප්පජ්ජති වෙදයිතං සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා. සො සුඛාය වෙදනාය ඵුට්ඨො සමානො අභිනන්දති අභිවදති අජ්ඣොසාය තිට්ඨති. තස්ස රාගානුසයො අනුසෙති. දුක්ඛාය වෙදනාය ඵුට්ඨො සමානො සොචති කිලමති පරිදෙවති උරත්තාළිංකන්දති සම්මොහං ආපජ්ජති. තස්ස පටිඝානුසයො අනුසෙති. අදුක්ඛමසුඛාය වෙදනාය ඵුට්ඨො සමානො තස්සා වෙදනාය සමුදයඤ්ච අත්ථඞ්ගමඤ්ච අස්සාදඤ්ච ආදීනවඤ්ච නිස්සරණඤ්ච යථාභූතං නප්පජානාති. තස්ස අවිජ්ජානුසයො අනුසෙති. සො වත භික්ඛවෙ, සුඛාය වෙදනාය රාගානුසයං අප්පහාය දුක්ඛාය වෙදනාය පටිඝානුසයං අප්පටිවිනොදෙත්වා අදුක්ඛමසුඛාය වෙදනාය අවිජ්ජානුසයං අසමූහනිත්වා අවිජ්ජං අප්පහාය විජ්ජං අනුප්පාදෙත්වා දිට්ඨෙව ධම්මෙ දුක්ඛස්සන්තකරො භවිස්සතීති නෙතං ඨානං විජ්ජති."
            },
            {
                "type": "paragraph",
                "text": "චක්ඛුඤ්ච ඛො භික්ඛවෙ, පටිච්ච රූපෙ ච උප්පජ්ජති චක්ඛුවිඤ්ඤාණං, තිණ්ණං සඞ්ගති ඵස්සො, ඵස්සපච්චයා උප්පජ්ජති වෙදයිතං සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා. සො සුඛාය වෙදනාය ඵුට්ඨො සමානො නාභිනන්දති නාභිවදති නාජ්ඣොසාය තිට්ඨති. තස්ස රාගානුසයො නානුසෙති. දුක්ඛාය වෙදනාය ඵුට්ඨො සමානො න සොචති, න කිලමති, න පරිදෙවති, න උරත්තාළිංකන්දති, න සම්මොහං ආපජ්ජති. තස්ස පටිඝානුසයො නානුසෙති. අදුක්ඛමසුඛාය වෙදනාය ඵුට්ඨො සමානො තස්සා වෙදනාය සමුදයඤ්ච අත්ථඞ්ගමඤ්ච අස්සාදඤ්ච ආදීනවඤ්ච නිස්සරණඤ්ච යථාභූතං පජානාති. තස්ස අවිජ්ජානුසයො නානුසෙති. සො වත භික්ඛවෙ, සුඛාය වෙදනාය රාගානුසයං පහාය දුක්ඛාය වෙදනාය පටිඝානුසයං පටිවිනොදෙත්වා අදුක්ඛමසුඛාය වෙදනාය අවිජ්ජානුසයං සමූහනිත්වා අවිජ්ජං පහාය විජ්ජං උප්පාදෙත්වා දිට්ඨෙව ධම්මෙ දුක්ඛස්සන්තකරො භවිස්සතීති ඨානමෙතං විජ්ජති."
            },
            {
                "type": "page-break",
                "text": "592"
            },
            {
                "type": "paragraph",
                "text": "සොතඤ්ච භික්ඛවෙ, පටිච්ච සද්දෙ ච උප්පජ්ජති සොතවිඤ්ඤාණං -පෙ- ඝානඤ්ච භික්ඛවෙ, පටිච්ච ගන්ධෙ ච උප්පජ්ජති ඝානවිඤ්ඤාණං -පෙ- ජිව්හඤ්ච භික්ඛවෙ, පටිච්ච රසෙ ච උප්පජ්ජති ජිව්හාවිඤ්ඤාණං-පෙ- කායඤ්ච භික්ඛවෙ, පටිච්ච ඵොට්ඨබ්බෙ ච උප්පජ්ජති කායවිඤ්ඤාණං -පෙ- මනඤ්ච භික්ඛවෙ, පටිච්ච ධම්මෙ ච උප්පජ්ජති මනොවිඤ්ඤාණං. තිණ්ණං සඞ්ගති ඵස්සො, ඵස්සපච්චයා උප්පජ්ජති වෙදයිතං සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා. සො සුඛාය වෙදනාය ඵුට්ඨො සමානො නාභිනන්දති, නාභිවදති, නාජ්ඣොසාය තිට්ඨති. තස්ස රාගානුසයො නානුසෙති. සො දුක්ඛාය වෙදනාය ඵුට්ඨො සමානො -පෙ- සො අදුක්ඛමසුඛාය වෙදනාය ඵුට්ඨො සමානො තස්සා වෙදනාය සමුදයඤ්ච අත්ථඞ්ගමඤ්ච අස්සාදඤ්ච ආදීනවඤ්ච නිස්සරණඤ්ච යථාභූතං පජානාති. තස්ස අවිජ්ජානුසයො නානුසෙති. සො වත භික්ඛවෙ, සුඛාය වෙදනාය රාගානුසයං පහාය දුක්ඛාය වෙදනාය පටිඝානුසයං පටිවිනොදෙත්වා අදුක්ඛමසුඛාය වෙදනාය අවිජ්ජානුසයං සමූහනිත්වා අවිජ්ජං පහාය විජ්ජං උප්පාදෙත්වා දිට්ඨෙව ධම්මෙ දුක්ඛස්සන්තකරො භවිස්සතීති ඨානමෙතං විජ්ජති."
            },
            {
                "type": "paragraph",
                "text": "එවං පස්සං භික්ඛවෙ, සුතවා අරියසාවකො චක්ඛුස්මිං නිබ්බින්දති, රූපෙසු නිබ්බින්දති, චක්ඛුවිඤ්ඤාණෙ නිබ්බින්දති, චක්ඛුසම්ඵස්සෙ නිබ්බින්දති, වෙදනාය නිබ්බින්දති, තණ්හාය නිබ්බින්දති. සොතස්මිං නිබ්බින්දති, සද්දෙසු නිබ්බින්දති -පෙ- ඝානස්මිං නිබ්බින්දති, ගන්ධෙසු නිබ්බින්දති. -පෙ- ජිව්හාය නිබ්බින්දති, රසෙසු නිබ්බින්දති -පෙ- කායස්මිං නිබ්බින්දති, ඵොට්ඨබ්බෙසු නිබ්බින්දති -පෙ- මනස්මිං නිබ්බින්දති, ධම්මෙසු නිබ්බින්දති, මනොවිඤ්ඤාණෙ නිබ්බින්දති, මනොසම්ඵස්සෙ නිබ්බින්දති, වෙදනාය නිබ්බින්දති, තණ්හාය නිබ්බින්දති. නිබ්බින්දං විරජ්ජති, විරාගා විමුච්චති. විමුත්තස්මිං විමුත්තමිති ඤාණං හොති. ‘ඛීණා ජාති, වුසිතං බ්රහ්මචරියං, කතං කරණීයං, නාපරං ඉත්ථත්තායා’ති පජානාතීති."
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච භගවා. අත්තමනා තෙ භික්ඛූ භගවතො භාසිතං අභිනන්දුන්ති. ඉමස්මිං ඛො පන වෙය්යාකරණස්මිං භඤ්ඤමානෙ සට්ඨිමත්තානං භික්ඛූනං අනුපාදාය ආසවෙහි චිත්තානි විමුච්චිංසූති."
            },
            {
                "type": "centered",
                "text": "ඡ ඡක්ක සුත්තං ඡට්ඨං.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "594"
            },
            {
                "type": "centered",
                "text": "3. 5. 7",
                "level": "1"
            },
            {
                "type": "heading",
                "text": " මහාසළායතනික සුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එවං මෙ සුතං: එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි භික්ඛවො’ති. ‘භදන්තෙ’ති තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "මහාසළායතනිකං වො භික්ඛවෙ, දෙසිස්සාමි. තං සුණාථ, සාධුකං මනසි කරොථ භාසිස්සාමීති."
            },
            {
                "type": "paragraph",
                "text": "එවං භන්තෙති ඛො තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "චක්ඛුං භික්ඛවෙ, අජානං අපස්සං යථාභූතං, රූපෙ අජානං අපස්සං යථාභූතං, චක්ඛුවිඤ්ඤාණං අජානං අපස්සං යථාභූතං, චක්ඛුසම්ඵස්සං අජානං අපස්සං යථාභූතං, යම්පිදං චක්ඛුසම්ඵස්සපච්චයා උප්පජ්ජති වෙදයිතං සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා, තම්පි අජානං අපස්සං යථාභූතං, චක්ඛුස්මිං සාරජ්ජති, රූපෙසු සාරජ්ජති, චක්ඛුවිඤ්ඤාණෙ සාරජ්ජති, චක්ඛුසම්ඵස්සෙ සාරජ්ජති, යම්පිදං{1 යමිදං - මඡසං, සීමු.} චක්ඛුසම්ඵස්සපච්චයා උප්පජ්ජති වෙදයිතං සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා, තස්මිම්පි සාරජ්ජති."
            },
            {
                "type": "paragraph",
                "text": "තස්ස සාරත්තස්ස සංයුත්තස්ස සම්මූළ්හස්ස අස්සාදානුපස්සිනො විහරතො ආයතිං පඤ්චුපාදානක්ඛන්ධා උපචයං ගච්ඡන්ති. තණ්හා චස්ස පොනොභවිකා නන්දිරාගසහගතා තත්ර තත්රාභිනන්දිනී, සා චස්ස පවඩ්ඪති. තස්ස කායිකාපි දරථා පවඩ්ඪන්ති, චෙතසිකාපි දරථා පවඩ්ඪන්ති, කායිකාපි සන්තාපා පවඩ්ඪන්ති, චෙතසිකාපි සන්තාපා පවඩ්ඪන්ති, කායිකාපි පරිළාහා පවඩ්ඪන්ති, චෙතසිකාපි පරිළාහා පවඩ්ඪන්ති. සො කායදුක්ඛම්පි චෙතොදුක්ඛම්පි පටිසංවෙදෙති."
            },
            {
                "type": "paragraph",
                "text": "සොතං භික්ඛවෙ, අජානං අපස්සං යථාභූතං -පෙ- ඝානං භික්ඛවෙ, අජානං අපස්සං යථාභූතං -පෙ- ජිව්හං භික්ඛවෙ, අජානං අපස්සං යථාභූතං -පෙ- කායං භික්ඛවෙ, අජානං අපස්සං යථාභූතං -පෙ- මනං භික්ඛවෙ, අජානං අපස්සං යථාභූතං, ධම්මෙ අජානං අපස්සං යථාභූතං, මනොවිඤ්ඤාණං අජානං අපස්සං යථාභූතං, මනොසම්ඵස්සං අජානං අපස්සං යථාභූතං, යම්පිදං මනොසම්ඵස්සපච්චයා උප්පජ්ජති වෙදයිතං සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා, තම්පි අජානං අපස්සං යථාභූතං, මනස්මිං සාරජ්ජති, ධම්මෙසු සාරජ්ජති, මනොවිඤ්ඤාණෙ සාරජ්ජති, මනොසම්ඵස්සෙ සාරජ්ජති, යම්පිදං මනොසම්ඵස්සපච්චයා උප්පජ්ජති වෙදයිතං සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා තස්මිම්පි සාරජ්ජති."
            },
            {
                "type": "page-break",
                "text": "596"
            },
            {
                "type": "paragraph",
                "text": "තස්ස සාරත්තස්ස සංයුත්තස්ස සම්මූළ්හස්ස අස්සාදානුපස්සිනො විහරතො ආයතිං පඤ්චුපාදානක්ඛන්ධා උපචයං ගච්ඡන්ති. තණ්හා චස්ස පොනොභවිකා නන්දිරාගසහගතා තත්රතත්රාභිනන්දිනී, සා චස්ස පවඩ්ඪති. තස්ස කායිකාපි දරථා පවඩ්ඪන්ති, චෙතසිකාපි දරථා පවඩ්ඪන්ති, කායිකාපි සන්තාපා පවඩ්ඪන්ති, චෙතසිකාපි සන්තාපා පවඩ්ඪන්ති, කායිකාපි පරිළාහා පවඩ්ඪන්ති, චෙතසිකාපි පරිළාහා පවඩ්ඪන්ති. සො කායදුක්ඛම්පි චෙතොදුක්ඛම්පි පටිසංවෙදෙති."
            },
            {
                "type": "paragraph",
                "text": "චක්ඛුඤ්ච ඛො භික්ඛවෙ, ජානං පස්සං යථාභූතං, රූපෙ ජානං පස්සං යථාභූතං, චක්ඛුවිඤ්ඤාණං ජානං පස්සං යථාභූතං, චක්ඛුසම්ඵස්සං ජානං පස්සං යථාභූතං, යම්පිදං චක්ඛුසම්ඵස්සපච්චයා උප්පජ්ජති වෙදයිතං සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා, තම්පි ජානං පස්සං යථාභූතං, චක්ඛුස්මිං න සාරජ්ජති, රූපෙසු න සාරජ්ජති, චක්ඛුවිඤ්ඤාණෙ න සාරජ්ජති, චක්ඛුසම්ඵස්සෙ න සාරජ්ජති, යම්පිදං චක්ඛුසම්ඵස්සපච්චයා උප්පජ්ජති වෙදයිතං සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා, තස්මිම්පි න සාරජ්ජති."
            },
            {
                "type": "paragraph",
                "text": "තස්ස අසාරත්තස්ස අසංයුත්තස්ස අසම්මූළ්හස්ස ආදීනවානුපස්සිනො විහරතො ආයතිං පඤ්චුපාදානක්ඛන්ධා අපචයං ගච්ඡන්ති. තණ්හා චස්ස පොනොභවිකා නන්දිරාගසහගතා තත්ර තත්රාභිනන්දිනී, සා චස්ස පහීයති. තස්ස කායිකාපි දරථා පහීයන්ති, චෙතසිකාපි දරථා පහීයන්ති. කායිකාපි සන්තාපා පහීයන්ති. චෙතසිකාපි සන්තාපා පහීයන්ති. කායිකාපි පරිළාහා පහීයන්ති, චෙතසිකාපි පරිළාහා පහීයන්ති. සො කායසුඛම්පි චෙතොසුඛම්පි පටිසංවෙදෙති."
            },
            {
                "type": "paragraph",
                "text": "යා තථාභූතස්ස දිට්ඨි, සාස්ස හොති සම්මාදිට්ඨි. යො තථාභූතස්ස සඞ්කප්පො, ස්වාස්ස හොති සම්මාසඞ්කප්පො. යො තථාභූතස්ස වායාමො, ස්වාස්ස හොති සම්මාවායාමො. යා තථාභූතස්ස සති, සාස්ස හොති සම්මාසති. යො තථාභූතස්ස සමාධි, ස්වාස්ස හොති සම්මාසමාධි. පුබ්බෙව ඛො පනස්ස කායකම්මං වචීකම්මං ආජීවො සුපරිසුද්ධො හොති. එවමස්සායං අරියො අට්ඨඞ්ගිකො මග්ගො භාවනාපාරිපූරිං ගච්ඡති."
            },
            {
                "type": "paragraph",
                "text": "තස්ස එවං ඉමං අරියං අට්ඨඞ්ගිකං මග්ගං භාවයතො චත්තාරොපි සතිපට්ඨානා භාවනාපාරිපූරිං ගච්ඡන්ති. චත්තාරොපි සම්මප්පධානා භාවනාපාරිපූරිං ගච්ඡන්ති. චත්තාරොපි ඉද්ධිපාදා භාවනා පාරිපූරිං ගච්ඡන්ති. පඤ්චපි ඉන්ද්රියානි භාවනාපාරිපූරිං ගච්ඡන්ති. පඤ්චපි බලානි භාවනාපාරිපූරිං ගච්ඡන්ති. සත්තපි බොජ්ඣඞ්ගා භාවනාපාරිපූරිං ගච්ඡන්ති."
            },
            {
                "type": "paragraph",
                "text": "තස්සිමෙ ද්වෙ ධම්මා යුගනද්ධා{1 යුගනන්ධා - මඡසං.} වත්තන්ති සමථො ච විපස්සනා ච. සො යෙ ධම්මා අභිඤ්ඤා පරිඤ්ඤෙය්යා, ධම්මෙ අභිඤ්ඤා පරිජානාති. යෙ ධම්මා අභිඤ්ඤා පහාතබ්බා,තෙ ධම්මෙ අභිඤ්ඤා පජහති. යෙ ධම්මා අභිඤ්ඤා භාවෙතබ්බා, තෙ ධම්මෙ අභිඤ්ඤා භාවෙති. යෙ ධම්මා අභිඤ්ඤා සච්ඡිකාතබ්බා, තෙ ධම්මෙ අභිඤ්ඤා සච්ඡිකරොති."
            },
            {
                "type": "paragraph",
                "text": "කතමෙ ච භික්ඛවෙ, ධම්මා අභිඤ්ඤා පරිඤ්ඤෙය්යා: පඤ්චුපාදානක්ඛන්ධාතිස්ස වචනීයං. සෙය්යථීදං: රූපූපාදානක්ඛන්ධො, වෙදනූපාදානක්ඛන්ධො, සඤ්ඤූපාදානක්ඛන්ධො, සඞ්ඛාරූපාදානක්ඛන්ධො, විඤ්ඤාණූපාදානක්ඛන්ධො. ඉමෙ ධම්මා අභිඤ්ඤා පරිඤ්ඤෙය්යා."
            },
            {
                "type": "page-break",
                "text": "598"
            },
            {
                "type": "paragraph",
                "text": "කතමෙ ච භික්ඛවෙ, ධම්මා අභිඤ්ඤා පහාතබ්බා: අවිජ්ජා ච භවතණ්හා ච. ඉමෙ ධම්මා අභිඤ්ඤා පහාතබ්බා."
            },
            {
                "type": "paragraph",
                "text": "කතමෙ ච භික්ඛවෙ, ධම්මා අභිඤ්ඤා භාවෙතබ්බා: සමථො ච විපස්සනා ච. ඉමෙ ධම්මා අභිඤ්ඤා භාවෙතබ්බා."
            },
            {
                "type": "paragraph",
                "text": "කතමෙ ච භික්ඛවෙ, ධම්මා අභිඤ්ඤා සච්ඡිකාතබ්බා: විජ්ජා ච විමුත්ති ච. ඉමෙ ධම්මා අභිඤ්ඤා සච්ඡිකාතබ්බා."
            },
            {
                "type": "paragraph",
                "text": "සොතං භික්ඛවෙ, ජානං පස්සං යථාභූතං -පෙ- ඝානං භික්ඛවෙ, ජානං පස්සං යථාභූතං -පෙ- ජිව්හං භික්ඛවෙ, ජානං පස්සං යථාභූතං -පෙ- කායං භික්ඛවෙ, ජානං පස්සං යථාභූතං -පෙ- මනං භික්ඛවෙ, ජානං පස්සං යථාභූතං, ධම්මෙ ජානං පස්සං යථාභූතං, මනොවිඤ්ඤාණං ජානං පස්සං යථාභූතං, මනොසම්ඵස්සං ජානං පස්සං යථාභූතං, යම්පිදං මනොසම්ඵස්සපච්චයා උප්පජ්ජති වෙදයිතං සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා තම්පි ජානං පස්සං යථාභූතං, මනස්මිං න සාරජ්ජති, ධම්මෙසු න සාරජ්ජති, මනොවිඤ්ඤාණෙ න සාරජ්ජති, මනොසම්ඵස්සෙ න සාරජ්ජති. යම්පිදං මනොසම්ඵස්සපච්චයා උප්පජ්ජති වෙදයිතං සුඛං වා දුක්ඛං වා අදුක්ඛමසුඛං වා. තස්මිම්පි න සාරජ්ජති."
            },
            {
                "type": "paragraph",
                "text": "තස්ස අසාරත්තස්ස අසංයුත්තස්ස අසම්මූළ්හස්ස ආදීනවානුපස්සිනො විහරතො ආයතිං පඤ්චුපාදානක්ඛන්ධා අපචයං ගච්ඡන්ති. තණ්හා චස්ස පොනොභවිකා නන්දිරාගසහගතා තත්ර තත්රාභිනන්දිනී, සා චස්ස පහීයති. තස්ස කායිකාපි දරථා පහීයන්ති. චෙතසිකාපි දරථා පහීයන්ති. කායිකාපි සන්තාපා පහීයන්ති. චෙතසිකාපි සන්තාපා පහීයන්ති. කායිකාපි පරිළාහා පහීයන්ති. චෙතසිකාපි පරිළාහා පහීයන්ති. සො කායසුඛම්පි චෙතොසුඛම්පි පටිසංවෙදෙති."
            },
            {
                "type": "paragraph",
                "text": "යා තථාභූතස්ස දිට්ඨි, සාස්ස හොති සම්මාදිට්ඨි. යො තථාභූතස්ස සඞ්කප්පො, ස්වාස්ස හොති සම්මාසඞ්කප්පො. යො තථාභූතස්ස වායාමො, ස්වාස්ස හොති සම්මාවායාමො. යා තථාභූතස්ස සති, සාස්ස හොති සම්මාසති. යො තථාභූතස්ස සමාධි, ස්වාස්ස හොති සම්මාසමාධි. පුබ්බෙව ඛො පනස්ස කායකම්මං වචීකම්මං ආජීවො සුපරිසුද්ධො හොති. එවමස්සායං අරියො අට්ඨඞ්ගිකො මග්ගො භාවනාපාරිපූරිං ගච්ඡති."
            },
            {
                "type": "paragraph",
                "text": "තස්ස එවං ඉමං අරියං අට්ඨඞ්ගිකං මග්ගං භාවයතො චත්තාරොපි සතිපට්ඨානා භාවනාපාරිපූරිං ගච්ඡන්ති. චත්තාරොපි සම්මප්පධානා භාවනාපාරිපූරිං ගච්ඡන්ති. චත්තාරොපි ඉද්ධිපාදා භාවනාපාරිපූරිං ගච්ඡන්ති. පඤ්චපි ඉන්ද්රියානි භාවනාපාරිපූරිං ගච්ඡන්ති. පඤ්චපි බලානි භාවනාපාරිපූරිං ගච්ඡන්ති. සත්තපි බොජ්ඣඞ්ගා භාවනාපාරිපූරිං ගච්ඡන්ති."
            },
            {
                "type": "paragraph",
                "text": "තස්සිමෙ ද්වෙ ධම්මා යුගනද්ධා වත්තන්ති සමථො ච විපස්සනා ච. සො යෙ ධම්මා අභිඤ්ඤා පරිඤ්ඤෙය්යා, තෙ ධම්මෙ අභිඤ්ඤා පරිජානාති. යෙ ධම්මා අභිඤ්ඤා පහාතබ්බා, තෙ ධම්මෙ අභිඤ්ඤා පජහති. යෙ ධම්මා අභිඤ්ඤා භාවෙතබ්බා, තෙ ධම්මෙ අභිඤ්ඤා භාවෙති. යෙ ධම්මා අභිඤ්ඤා සච්ඡිකාතබ්බා, තෙ ධම්මෙ අභිඤ්ඤා සච්ඡිකරොති."
            },
            {
                "type": "page-break",
                "text": "600"
            },
            {
                "type": "paragraph",
                "text": "කතමෙ ච භික්ඛවෙ, ධම්මා අභිඤ්ඤා පරිඤ්ඤෙය්යා: පඤ්චුපාදානක්ඛන්ධා’ තිස්ස වචනීයං සෙය්යථිදං: රූපුපාදානක්ඛන්ධො, වෙදනුපාදානක්ඛන්ධො, සඤ්ඤුපාදානක්ඛන්ධො, සඞ්ඛාරුපාදානක්ඛන්ධො, විඤ්ඤාණුපාදානක්ඛන්ධො. ඉමෙ ධම්මා අභිඤ්ඤා පරිඤ්ඤෙය්යා."
            },
            {
                "type": "paragraph",
                "text": "කතමෙ ච භික්ඛවෙ, ධම්මා අභිඤ්ඤා පහාතබ්බා: අවිජ්ජා ච භවතණ්හා ච. ඉමෙ ධම්මා අභිඤ්ඤා පහාතබ්බා."
            },
            {
                "type": "paragraph",
                "text": "කතමෙ ච භික්ඛවෙ, ධම්මා අභිඤ්ඤා භාවෙතබ්බා: සමථො ච විපස්සනා ච. ඉමෙ ධම්මා අභිඤ්ඤා භාවෙතබ්බා."
            },
            {
                "type": "paragraph",
                "text": "කතමෙ ච භික්ඛවෙ, ධම්මා අභිඤ්ඤා සච්ඡිකාතබ්බා: විජ්ජා ච විමුත්ති ච. ඉමෙ ධම්මා අභිඤ්ඤා සච්ඡිකාතබ්බාති."
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච භගවා. අත්තමනා තෙ භික්ඛූ භගවතො භාසිතං අභිනන්දුන්ති."
            },
            {
                "type": "centered",
                "text": "මහාසළායතනික සුත්තං සත්තමං.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "602"
            },
            {
                "type": "centered",
                "text": "3. 5. 8",
                "level": "1"
            },
            {
                "type": "heading",
                "text": " නගරවින්දෙය්ය සුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එවං මෙ සුතං: එකං සමයං භගවා කොසලෙසු චාරිකං චරමානො මහතා භික්ඛුසඞ්ඝෙන සද්ධිං යෙන නගරවින්දං නාම කොසලානං බ්රාහ්මණගාමො, තදවසරි. අස්සොසුං ඛො නගරවින්දෙය්යකා බ්රාහ්මණගහපතිකා: ‘සමණො ඛලු භො ගොතමො සක්යපුත්තො සක්යකුලා පබ්බජිතො කොසලෙසු චාරිකං චරමානො මහතා භික්ඛුසඞ්ඝෙන සද්ධිං නගරවින්දං අනුප්පත්තො. තං ඛො පන භවන්තං ගොතමං එවං කල්යාණො කිත්තිසද්දො අබ්භුග්ගතො: ‘ඉතිපි සො භගවා අරහං සම්මාසම්බුද්ධො විජ්ජාචරණසම්පන්නො සුගතො ලොකවිදූ අනුත්තරො පුරිසදම්මසාරථි සත්ථා දෙවමනුස්සානං බුද්ධො භගවා’ති. සො ඉමං ලොකං සදෙවකං සමාරකං සබ්රහ්මකං සස්සමණබ්රාහ්මණිං පජං සදෙවමනුස්සං සයං අභිඤ්ඤා සච්ඡිකත්වා පවෙදෙති. සො ධම්මං දෙසෙති ආදිකල්යාණං මජ්ඣෙකල්යාණං පරියොසානකල්යාණං සාත්ථං සබ්යඤ්ජනං කෙවලපරිපුණ්ණං පරිසුද්ධං බ්රහ්මචරියං පකාසෙති. සාධු ඛො පන තථාරූපානං අරහතං දස්සනං හොතී’ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො නගරවින්දෙය්යකා බ්රාහ්මණගහපතිකා යෙන භගවා, තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා අප්පෙකච්චෙ භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. අප්පෙකච්චෙ භගවතා සද්ධිං සම්මොදිංසු. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදිංසු. අප්පෙකච්චෙ යෙන භගවා, තෙනඤ්ජලිං පණාමෙත්වා එකමන්තං නිසීදිංසු. අප්පෙකච්චෙ භගවතො සන්තිකෙ නාමගොත්තං සාවෙත්වා එකමන්තං නිසීදිංසු. අප්පෙකච්චෙ තුණ්හීභූතා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නෙ ඛො නගරවින්දෙය්යකෙ බ්රාහ්මණගහපතිකෙ භගවා එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "සචෙ වො ගහපතයො, අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං පුච්ඡෙය්යුං: කථංරූපා ගහපතයො, සමණබ්රාහ්මණා න සක්කාතබ්බා න ගරුකාතබ්බා න මානෙතබ්බා න පූජෙතබ්බාති. එවං පුට්ඨා තුම්හෙ ගහපතයො, තෙසං අඤ්ඤතිත්ථියානං පරිබ්බාජකානං එවං ව්යාකරෙය්යාථ: යෙ තෙ සමණබ්රාහ්මණා චක්ඛුවිඤ්ඤෙෙය්යසු රූපෙසු අවීතරාගා අවීතදොසා අවීතමොහා අජ්ඣත්තං අවූපසන්තචිත්තා සමවිසමං චරන්ති කායෙන වාචාය මනසා, එවරූපා සමණබ්රාහ්මණා න සක්කාතබ්බා, න ගරුකාතබ්බා, න මානෙතබ්බා, න පූජෙතබ්බා. තං කිස්ස හෙතු: මයම්පිහි චක්ඛුවිඤ්ඤෙෙය්යසු රූපෙසු අවීතරාගා අවීතදොසා අවීතමොහා අජ්ඣත්තං අවූපසන්තචිත්තා සමවිසමං චරාම කායෙන වාචාය මනසා. තෙසං නො සමචරියම්පි හෙතං උත්තරිං අපස්සතං. තස්මා තෙ භොන්තො සමණබ්රාහ්මණා න සක්කාතබ්බා න ගරුකාතබ්බා න මානෙතබ්බා න පූජෙතබ්බා. "
            },
            {
                "type": "page-break",
                "text": "604"
            },
            {
                "type": "paragraph",
                "text": "යෙ තෙ සමණබ්රාහ්මණා සොතවිඤ්ඤෙෙය්යසු සද්දෙසු, -පෙ-ඝානවිඤ්ඤෙෙය්යසු ගන්ධෙසු, -පෙ- ජිව්හාවිඤ්ඤෙෙය්යසු රසෙසු, -පෙ- කායවිඤ්ඤෙෙය්යසු ඵොට්ඨබ්බෙසු, -පෙ- මනොවිඤ්ඤෙෙය්යසු ධම්මෙසු අවීතරාගා අවීතදොසා අවීතමොහා අජ්ඣත්තං අවූපසන්තචිත්තා සමවිසමං චරන්ති කායෙන වාචාය මනසා. එවරූපා සමණබ්රාහ්මණා න සක්කාතබ්බා න ගරුකාතබ්බා න මානෙතබ්බා න පූජෙතබ්බා. තං කිස්ස හෙතු: මයම්පි හි මනොවිඤ්ඤෙෙය්යසු ධම්මෙසු අවීතරාගා අවීතදොසා අවීතමොහා අජ්ඣත්තං අවූපසන්තචිත්තා සමවිසමං චරාම කායෙන වාචාය මනසා. තෙසං නො සමචරියම්පි හෙතං උත්තරිං අපස්සතං. තස්මා තෙ භොන්තො සමණබ්රාහ්මණා න සක්කාතබ්බා න ගරුකාතබ්බා න මානෙතබ්බා න පූජෙතබ්බාති. එවං පුට්ඨා තුම්හෙ ගහපතයො, තෙසං අඤ්ඤතිත්ථියානං පරිබ්බාජකානං එවං ව්යාකරෙය්යාථ."
            },
            {
                "type": "paragraph",
                "text": "සචෙ පන වො ගහපතයො අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං පුච්ඡෙය්යුං: කථංරූපා{1 කථංභූතා - මඡසං.} ගහපතයො සමණබ්රාහ්මණා සක්කාතබ්බා, ගරුකාතබ්බා, මානෙතබ්බා, පූජෙතබ්බා’ති: එවං පුට්ඨා තුම්හෙ ගහපතයො, තෙසං අඤ්ඤතිත්ථියානං පරිබ්බාජකානං එවං ව්යාකරෙය්යාථ: යෙ තෙ සමණබ්රාහ්මණා චක්ඛුවිඤ්ඤෙෙය්යසු රූපෙසු වීතරාගා වීතදොසා වීතමොහා අජ්ඣත්තං වූපසන්තචිත්තා සමචරියං චරන්ති කායෙන වාචාය මනසා. එවරූපා සමණබ්රාහ්මණා සක්කාතබ්බා ගරුකාතබ්බා මානෙතබ්බා පූජෙතබ්බා. තං කිස්ස හෙතු: මයම්පි හි චක්ඛුවිඤ්ඤෙෙය්යසු රූපෙසු අවීතරාගා අවීතදොසා අවීතමොහා අජ්ඣත්තං අවූපසන්තචිත්තා සමවිසමං චරාම කායෙන වාචාය මනසා. තෙසං නො සමචරියම්පි හෙතං උත්තරිං පස්සතං. තස්මා තෙ භොන්තො සමණබ්රාහ්මණා සක්කාතබ්බා ගරුකාතබ්බා මානෙතබ්බා පූජෙතබ්බා. යෙ තෙ සමණබ්රාහ්මණා සොතවිඤ්ඤෙෙය්යසු සද්දෙසු -පෙ- ඝානවිඤ්ඤෙෙය්යසු ගන්ධෙසු -පෙ- ජිව්හාවිඤ්ඤෙෙය්යසු රසෙසු -පෙ- කායවිඤ්ඤෙෙය්යසු ඵොට්ඨබ්බෙසු -පෙ- මනොවිඤ්ඤෙෙය්යසු ධම්මෙසු වීතරාගා වීතදොසා වීතමොහා, අජ්ඣත්තං වූපසන්තචිත්තා සමචරියං චරන්ති කායෙන වාචාය මනසා. එවරූපා සමණබ්රාහ්මණා සක්කාතබ්බා ගරුකාතබ්බා මානෙතබ්බා පූජෙතබ්බා. තං කිස්ස හෙතු: මයම්පි හි මනොවිඤ්ඤෙෙය්යසු ධම්මෙසු අවීතරාගා අවීතදොසා අවීතමොහා අජ්ඣත්තං අවූපසන්තචිත්තා සමවිසමං චරාම කායෙන වාචාය මනසා. තෙසං නො සමචරියම්පි හෙතං උත්තරි පස්සතං. තස්මා තෙ භොන්තො සමණබ්රාහ්මණා සක්කාතබ්බා ගරුකාතබ්බා මානෙතබ්බා පූජෙතබ්බා’ති. එවං පුට්ඨා තුම්හෙ ගහපතයො, තෙසං අඤ්ඤතිත්ථියානං පරිබ්බාජකානං එවං ව්යාකරෙය්යාථ."
            },
            {
                "type": "page-break",
                "text": "606"
            },
            {
                "type": "paragraph",
                "text": "සචෙ පන වො ගහපතයො, අඤ්ඤතිත්ථියා පරිබ්බාජකා එවං පුච්ඡෙය්යුං: කෙ පනායස්මන්තානං ආකාරා කෙ අන්වයා, යෙන තුම්හෙ ආයස්මන්තො එවං වදෙථ: අද්ධා තෙ ආයස්මන්තො වීතරාගා වා රාගවිනයාය වා පටිපන්නා, වීතදොසා වා දොසවිනයාය වා පටිපන්නා, වීතමොහා වා මොහවිනයාය වා පටිපන්නා’ති: එවං පුට්ඨා තුම්හෙ ගහපතයො, තෙසං අඤ්ඤතිත්ථියානං පරිබ්බාජකානං එවං ව්යාකරෙය්යාථ: තථා හි තෙ ආයස්මන්තො අරඤ්ෙඤ වනපත්ථානි{1 අරඤ්ඤවනපත්ථානි - මඡසං.} පන්තානි සෙනාසනානි පටිසෙවන්ති. නත්ථි ඛො පන තත්ථ තථාරූපා චක්ඛුවිඤ්ඤෙය්යා රූපා, යෙ දිස්වා දිස්වා අභිරමෙය්යුං. නත්ථි ඛො පන තත්ථ තථාරූපා සොතවිඤ්ඤෙය්යා සද්දා, යෙ සුත්වා සුත්වා අභිරමෙය්යුං. නත්ථි ඛො පන තත්ථ තථාරූපා ඝානවිඤ්ඤෙය්යා ගන්ධා, යෙ ඝායිත්වා ඝායිත්වා අභිරමෙය්යුං. නත්ථි ඛො පන තත්ථ තථාරූපා ජිව්හාවිඤ්ඤෙය්යා රසා, යෙ සායිත්වා සායිත්වා අභිරමෙය්යුං. නත්ථි ඛො පන තත්ථ තථාරූපා කායවිඤ්ඤෙය්යා ඵොට්ඨබ්බා, යෙ ඵුසිත්වා ඵුසිත්වා අභිරමෙය්යුං. ඉමෙ ඛො නො ආවුසො, ආකාරා ඉමෙ අන්වයා, යෙන මයං යෙන මයං ආයස්මන්තො එවං වදෙම. අද්ධා තෙ ආයස්මන්තො වීතරාගා වා රාගවිනයාය වා පටිපන්නා, වීතදොසා වා දොසවිනයාය වා පටිපන්නා, වීතමොහා වා මොහවිනයාය වා පටිපන්නා’ති. එවං පුට්ඨා තුම්හෙ ගහපතයො, තෙසං අඤ්ඤතිත්ථියානං පරිබ්බාජකානං එවං ව්යාකරෙය්යාථා’ති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ නගරවින්දෙය්යකා බ්රාහ්මණගහපතිකා භගවන්තං එතදවොචුං: ‘අභික්කන්තං භො ගොතම, අභික්කන්තං භො ගොතම, සෙය්යථාපි භො ගොතම, නික්කුජ්ජිතං වා උක්කුජ්ජෙය්ය, පටිච්ඡන්නං වා විවරෙය්ය, මූළ්හස්ස වා මග්ගං ආචික්ඛෙය්ය, අන්ධකාරෙ වා තෙලපජ්ජොතං ධාරෙය්ය චක්ඛුමන්තො රූපානි දක්ඛින්තී’ති. එවමෙවං භොතා ගොතමෙන අනෙකපරියායෙන ධම්මො පකාසිතො. එතෙ මයං භවන්තං ගොතමං සරණං ගච්ඡාම ධම්මඤ්ච භික්ඛුසඞ්ඝඤ්ච. උපාසකෙ නො භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතෙ සරණං ගතෙ’ති."
            },
            {
                "type": "centered",
                "text": "නගර වින්දෙය්ය සුත්තං අට්ඨමං.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "608"
            },
            {
                "type": "centered",
                "text": "3. 5. 9",
                "level": "1"
            },
            {
                "type": "heading",
                "text": " පිණ්ඩපාතපාරිසුද්ධි සුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එවං මෙ සුතං: එකං සමයං භගවා රාජගහෙ විහරති වෙළුවනෙ කලන්දකනිවාපෙ. අථ ඛො ආයස්මා සාරිපුත්තො සායන්හසමයං පතිසල්ලානා වුට්ඨිතො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො ආයස්මන්තං සාරිපුත්තං භගවා එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "විප්පසන්නානි ඛො තෙ සාරිපුත්ත, ඉන්ද්රියානි පරිසුද්ධො ඡවිවණ්ණො පරියොදාතො. කතමෙන ඛො ත්වං සාරිපුත්ත, විහාරෙන එතරහි බහුලං විහරසීති:"
            },
            {
                "type": "paragraph",
                "text": "සුඤ්ඤතාවිහාරෙන ඛො අහං භන්තෙ, එතරහි බහුලං විහරාමීති."
            },
            {
                "type": "paragraph",
                "text": "සාධු සාධු සාරිපුත්ත, මහාපුරිසවිහාරෙන කිර ත්වං සාරිපුත්ත, එතරහි බහුලං විහරසි. ‘මහාපුරිසවිහාරො හෙස සාරිපුත්ත, යදිදං සුඤ්ඤතා. තස්මාතිහ සාරිපුත්ත, භික්ඛු සචෙ ආකඞ්ඛෙය්ය, සුඤ්ඤතා විහාරෙන එතරහි බහුලං විහරෙය්ය’න්ති. තෙන සාරිපුත්ත, භික්ඛුනා ඉති පටිසඤ්චික්ඛිතබ්බං: ‘යෙන චාහං මග්ගෙන ගාමං පිණ්ඩාය පාවිසිං, යස්මිඤ්ච පදෙසෙ පිණ්ඩාය අචරිං, යෙන ච මග්ගෙන ගාමතො පිණ්ඩාය පටික්කමිං. අත්ථි නු ඛො මෙ තත්ථ චක්ඛුවිඤ්ඤෙෙය්යසු රූපෙසු ඡන්දො වා රාගො වා දොසො වා මොහො වා පටිඝං වාපි චෙතසො’ති."
            },
            {
                "type": "paragraph",
                "text": "සචෙ සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: ‘යෙන චාහං මග්ගෙන ගාමං පිණ්ඩාය පාවිසිං. යස්මිඤ්ච පදෙසෙ පිණ්ඩාය අචරිං, යෙන ච මග්ගෙන ගාමතො පිණ්ඩාය පටික්කමිං. අත්ථි මෙ තත්ථ චක්ඛුවිඤ්ඤෙෙය්යසු රූපෙසු ඡන්දො වා රාගො වා දොසො වා මොහො වා පටිඝං වාපි චෙතසො’ති. තෙන සාරිපුත්ත, භික්ඛුනා තෙසංයෙව පාපකානං අකුසලානං ධම්මානං පහානාය වායමිතබ්බං."
            },
            {
                "type": "paragraph",
                "text": "සචෙ පන සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: ‘යෙන චාහං මග්ගෙන ගාමං පිණ්ඩාය පාවිසිං, යස්මිං ච පදෙසෙ පිණ්ඩාය අචරිං, යෙන ච මග්ගෙන ගාමතො පිණ්ඩාය පටික්කමිං. නත්ථි මෙ තත්ථ චක්ඛුවිඤ්ඤෙෙය්යසු රූපෙසු ඡන්දො වා රාගො වා දොසො වා මොහො වා පටිඝං වාපි චෙතසො’ති. තෙන සාරිපුත්ත, භික්ඛුනා තෙනෙව පීතිපාමොජ්ජෙන විහාතබ්බං අහොරත්තානුසික්ඛිනා කුසලෙසු ධම්මෙසු."
            },
            {
                "type": "page-break",
                "text": "610"
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං සාරිපුත්ත, භික්ඛුනා ඉති පටිසඤ්චික්ඛිතබ්බං: ‘යෙන චාහං මග්ගෙන ගාමං පිණ්ඩාය පාවිසිං, යස්මිඤ්ච පදෙසෙ පිණ්ඩාය අචරිං, යෙන ච මග්ගෙන ගාමතො පිණ්ඩාය පටික්කමිං. අත්ථි නු ඛො මෙ තත්ථ සොතවිඤ්ඤෙෙය්යසු සද්දෙසු -පෙ- ඝානවිඤ්ඤෙෙය්යසු ගන්ධෙසු -පෙ- ජිව්හාවිඤ්ඤෙෙය්යසු රසෙසු -පෙ- කායවිඤ්ඤෙෙය්යසු ඵොට්ඨබ්බෙසු -පෙ- මනොවිඤ්ඤෙෙය්යසු ධම්මෙසු ඡන්දො වා රාගො වා දොසො වා මොහො වා පටිඝං වාපි චෙතසො’ති. සචෙ සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: ‘යෙන චාහං මග්ගෙන ගාමං පිණ්ඩාය පාවිසිං, යස්මිඤ්ච පදෙසෙ පිණ්ඩාය අචරිං, යෙන ච මග්ගෙන ගාමතො පිණ්ඩාය පටික්කමිං. අත්ථි මෙ තත්ථ මනොවිඤ්ඤෙෙය්යසු ධම්මෙසු ඡන්දො වා රාගො වා දොසො වා මොහො වා පටිඝං වාපි චෙතසො’ති. තෙන සාරිපුත්ත, භික්ඛුනා තෙසංයෙව පාපකානං අකුසලානං ධම්මානං පහානාය වායමිතබ්බං."
            },
            {
                "type": "paragraph",
                "text": "සචෙ පන සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: යෙන චාහං මග්ගෙන ගාමං පිණ්ඩාය පාවිසිං, යස්මිඤ්ච පදෙසෙ පිණ්ඩාය අචරිං, යෙන ච මග්ගෙන ගාමතො පිණ්ඩාය පටික්කමිං. නත්ථි මෙ තත්ථ මනොවිඤ්ඤෙෙය්යසු ධම්මෙසු ඡන්දො වා රාගො වා දොසො වා මොහො වා පටිඝං වාපි චෙතසො’ති. තෙන සාරිපුත්ත, භික්ඛුනා තෙනෙව පීතිපාමොජ්ජෙන විහාතබ්බං අහොරත්තානුසික්ඛිනා කුසලෙසු ධම්මෙසු."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං සාරිපුත්ත, භික්ඛුනා ඉති පටිසඤ්චික්ඛිතබ්බං: පහීනා නු ඛො මෙ පඤ්ච කාමගුණාති, සචෙ සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: අප්පහීනා ඛො මෙ පඤ්ච කාමගුණාති. තෙන සාරිපුත්ත, භික්ඛුනා පඤ්චන්නං කාමගුණානං පහානාය වායමිතබ්බං. සචෙ පන සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: පහීනා ඛො මෙ පඤ්ච කාමගුණාති. තෙන සාරිපුත්ත, භික්ඛුනා තෙනෙව පීතිපාමොජ්ජෙන විහාතබ්බං අහොරත්තානුසික්ඛිනා කුසලෙසු ධම්මෙසු."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං සාරිපුත්ත, භික්ඛුනා ඉති පටිසඤ්චික්ඛිතබ්බං: ‘පහීනා නු ඛො මෙ පඤ්ච නීවරණා’ති. සචෙ සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: අප්පහීනා ඛො මෙ පඤ්ච නීවරණා’ති. තෙන සාරිපුත්ත, භික්ඛුනා පඤ්චන්නං නීවරණානං පහානාය වායමිතබ්බං. සචෙ පන සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: ‘පහීනා ඛො මෙ පඤ්ච නීවරණා’ති. තෙන සාරිපුත්ත, භික්ඛුනා තෙනෙව පීතිපාමොජ්ජෙන විහාතබ්බං අහොරත්තානුසික්ඛිනා කුසලෙසු ධම්මෙසු."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං සාරිපුත්ත, භික්ඛුනා ඉති පටිසඤ්චික්ඛිතබ්බං: පරිඤ්ඤාතා නු ඛො මෙ පඤ්චුපාදානක්ඛන්ධා’ති. සචෙ සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: අපරිඤ්ඤාතා ඛො මෙ පඤ්චුපාදානක්ඛන්ධා’ති. තෙන සාරිපුත්ත, භික්ඛුනා පඤ්චන්නං උපාදානක්ඛන්ධානං පරිඤ්ඤාය වායමිතබ්බං. සචෙ පන සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: පරිඤ්ඤාතා ඛො මෙ පඤ්චුපාදානක්ඛන්ධා’ති. තෙන සාරිපුත්ත, භික්ඛුනා තෙනෙව පීතිපාමොජ්ජෙන විහාතබ්බං අහොරත්තානුසික්ඛිනා කුසලෙසු ධම්මෙසු."
            },
            {
                "type": "page-break",
                "text": "612"
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං සාරිපුත්ත, භික්ඛුනා ඉති පටිසඤ්චික්ඛිතබ්බං: භාවිතා නු ඛො මෙ චත්තාරො සතිපට්ඨානා’ති: සචෙ සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: අභාවිතා ඛො මෙ චත්තාරො සතිපට්ඨානා’ති. තෙන සාරිපුත්ත, භික්ඛුනා චතුන්නං සතිපට්ඨානානං භාවනාය වායමිතබ්බං. සචෙ පන සාරිපුත්ත, භික්ඛුනා පච්චවෙක්ඛමානො එවං ජානාති: ‘භාවිතා ඛො මෙ චත්තාරො සතිපට්ඨානා’ති. තෙන සාරිපුත්ත, භික්ඛුනා තෙනෙව පීතිපාමොජ්ජෙන විහාතබ්බං අහොරත්තානුසික්ඛිනා කුසලෙසු ධම්මෙසු."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං සාරිපුත්ත, භික්ඛුනා ඉති පටිසඤ්චික්ඛිතබ්බං: භාවිතා නු ඛො මෙ චත්තාරො සම්මප්පධානා’ති. සචෙ සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: අභාවිතා ඛො මෙ චත්තාරො සම්මප්පධානා’ති. තෙන සාරිපුත්ත, භික්ඛුනා චතුන්නං සම්මප්පධානානං භාවනාය වායමිතබ්බං. සචෙ පන සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: භාවිතා ඛො මෙ චත්තාරො සම්මප්පධානා’ති. තෙන සාරිපුත්ත, භික්ඛුනා තෙනෙව පීතිපාමොජ්ජෙන විහාතබ්බං අහොරත්තානුසික්ඛිනා කුසලෙසු ධම්මෙසු."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං සාරිපුත්ත, භික්ඛුනා ඉති පටිසඤ්චික්ඛිතබ්බං: භාවිතා නු ඛො මෙ චත්තාරො ඉද්ධිපාදා’ති. සචෙ සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: අභාවිතා ඛො මෙ චත්තාරො ඉද්ධිපාදාති. තෙන සාරිපුත්ත, භික්ඛුනා චතුන්නං ඉද්ධිපාදානං භාවනාය වායමිතබ්බං. සචෙ පන සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: භාවිතා ඛො මෙ චත්තාරො ඉද්ධිපාදාති. තෙන සාරිපුත්ත, භික්ඛුනා තෙනෙව පීතිපාමොජ්ජෙන විහාතබ්බං අහොරත්තානුසික්ඛිනා කුසලෙසු ධම්මෙසු."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං සාරිපුත්ත, භික්ඛුනා ඉති පටිසඤ්චික්ඛිතබ්බං: ‘භාවිතා නු ඛො මෙ පඤ්චින්ද්රියානීති. සචෙ සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: අභාවිතා ඛො මෙ පඤ්චින්ද්රියානී’ති. තෙන සාරිපුත්ත, භික්ඛුනා පඤ්චන්නං ඉන්ද්රියානං භාවනාය වායමිතබ්බං. සචෙ පන සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: භාවිතා ඛො මෙ පඤ්චින්ද්රියානී’ති. තෙන සාරිපුත්ත, භික්ඛුනා තෙනෙව පීතිපාමොජ්ජෙන විහාතබ්බං අහොරත්තානුසික්ඛිනා කුසලෙසු ධම්මෙසු."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං සාරිපුත්ත, භික්ඛුනා ඉති පටිසඤ්චික්ඛිතබ්බං: භාවිතා නු ඛො මෙ පඤ්චබලානීති. සචෙ සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: අභාවිතා ඛො මෙ පඤ්චබලානී’ති. තෙන සාරිපුත්ත, භික්ඛුනා පඤ්චන්නං බලානං භාවනාය වායමිතබ්බං. සචෙ පන සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: භාවිතා ඛො මෙ පඤ්චබලානීති. තෙන සාරිපුත්ත, භික්ඛුනා තෙනෙව පීතිපාමොජ්ජෙන විහාතබ්බං අහොරත්තානුසික්ඛිනා කුසලෙසු ධම්මෙසු."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං සාරිපුත්ත, භික්ඛුනා ඉති පටිසඤ්චික්ඛිතබ්බං: භාවිතා නු ඛො මෙ සත්තබොජ්ඣඞ්ගාති: සචෙ සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: අභාවිතා ඛො මෙ සත්තබොජ්ඣඞ්ගා’ති. තෙන සාරිපුත්ත, භික්ඛුනා සත්තන්නං බොජ්ඣඞ්ගානං භාවනාය වායමිතබ්බං. සචෙ පන සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: භාවිතා ඛො මෙ සත්තබොජ්ඣඞ්ගා’ති. තෙන සාරිපුත්ත, භික්ඛුනා තෙනෙව පීතිපාමොජ්ජෙන විහාතබ්බං, අහොරත්තානුසික්ඛිනා කුසලෙසු ධම්මෙසු."
            },
            {
                "type": "page-break",
                "text": "614"
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං සාරිපුත්ත, භික්ඛුනා ඉති පටිසඤ්චික්ඛිතබ්බං: ‘භාවිතො නු ඛො මෙ අරියො අට්ඨඞ්ගිකො මග්ගො’ති. සචෙ සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: ‘අභාවිතො ඛො මෙ අරියො අට්ඨඞ්ගිකො මග්ගො’ති. තෙන සාරිපුත්ත, භික්ඛුනා අරියස්ස අට්ඨඞ්ගිකස්ස මග්ගස්ස භාවනාය වායමිතබ්බං. සචෙ පන සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: ‘භාවිතො ඛො මෙ අරියො අට්ඨඞ්ගිකො මග්ගො’ති. තෙන සාරිපුත්ත, භික්ඛුනා තෙනෙව පීතිපාමොජ්ජෙන විහාතබ්බං අහොරත්තානුසික්ඛිනා කුසලෙසු ධම්මෙසු."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං සාරිපුත්ත, භික්ඛුනා ඉති පටිසඤ්චික්ඛිතබ්බං: ‘භාවිතා නු ඛො මෙ සමථො ච විපස්සනා චා’ති. සචෙ සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: ‘අභාවිතා ඛො මෙ සමථො ච විපස්සනා චා’ති. තෙන සාරිපුත්ත, භික්ඛුනා සමථවිපස්සනානං භාවනාය වායමිතබ්බං. සචෙ පන සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: ‘භාවිතා ඛො මෙ සමථො ච විපස්සනා චා’ති. තෙන සාරිපුත්ත, භික්ඛුනා තෙනෙව පීතිපාමොජ්ජෙන විහාතබ්බං අහොරත්තානුසික්ඛිනා කුසලෙසු ධම්මෙසු."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං සාරිපුත්ත, භික්ඛුනා ඉති පටිසඤ්චික්ඛිතබ්බං: ‘සච්ඡිකතා නු ඛො මෙ විජ්ජා ච විමුත්ති චා’ති. සචෙ සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: ‘අසච්ඡිකතා ඛො මෙ විජ්ජා ච විමුත්ති චා’ති. තෙන සාරිපුත්ත, භික්ඛුනා විජ්ජාය ච විමුත්තියා ච සච්ඡිකිරියාය වායමිතබ්බං. සචෙ පන සාරිපුත්ත, භික්ඛු පච්චවෙක්ඛමානො එවං ජානාති: ‘සච්ඡිකතා ඛො මෙ විජ්ජා ච විමුත්ති චා’ති. තෙන සාරිපුත්ත, භික්ඛුනා තෙනෙව පීතිපාමොජ්ජෙන විහාතබ්බං අහොරත්තානුසික්ඛිනා කුසලෙසු ධම්මෙසු."
            },
            {
                "type": "paragraph",
                "text": "යෙ හි කෙචි සාරිපුත්ත, අතීතමද්ධානං සමණා වා බ්රාහ්මණා වා පිණ්ඩපාතං පරිසොධෙසුං, සබ්බෙ තෙ එවමෙව පච්චවෙක්ඛිත්වා පච්චවෙක්ඛිත්වා පිණ්ඩපාතං පරිසොධෙසුං. යෙපි හි කෙචි සාරිපුත්ත, අනාගතමද්ධානං සමණා වා බ්රාහ්මණා වා පිණ්ඩපාතං පරිසොධෙස්සන්ති, සබ්බෙ තෙ එවමෙව පච්චවෙක්ඛිත්වා පච්චවෙක්ඛිත්වා පිණ්ඩපාතං පරිසොධෙස්සන්ති. යෙපි හි කෙචි සාරිපුත්ත, එතරහි සමණා වා බ්රාහ්මණා වා පිණ්ඩපාතං පරිසොධෙන්ති, සබ්බෙ තෙ එවමෙව පච්චවෙක්ඛිත්වා පච්චවෙක්ඛිත්වා පිණ්ඩපාතං පරිසොධෙන්ති. තෙන හි වො සාරිපුත්ත එවං සික්ඛිතබ්බං: ‘පච්චවෙක්ඛිත්වා පච්චවෙක්ඛිත්වා පිණ්ඩපාතං පරිසොධෙස්සාමා’ති. එවං හි වො සාරිපුත්ත, සික්ඛිතබ්බන්ති."
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච භගවා. අත්තමනො ආයස්මා සාරිපුත්තො භගවතො භාසිතං අභිනන්දීති."
            },
            {
                "type": "centered",
                "text": "පිණ්ඩපාතපාරිසුද්ධි සුත්තං නවමං.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "616"
            },
            {
                "type": "centered",
                "text": "3. 5. 10",
                "level": "1"
            },
            {
                "type": "heading",
                "text": " ඉන්ද්රියභාවනා සුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "එවං මෙ සුතං: එකං සමයං භගවා කජඞ්ගලායං{1 ගජඞ්ගලායං - මඡසං.} විහරති මුඛෙලුවනෙ{2 සුඛෙලුවනෙ - සීමු. සුඛෙළුවනෙ - මඡසං}. අථ ඛො උත්තරො මාණවො පාරාසරියන්තෙවාසී{3 පාරාසිවියන්තෙවාසී - මඡසං.} යෙන භගවා, තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො උත්තරං මාණවං පාරාසරියන්තෙවාසිං භගවා එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "දෙසෙති උත්තර, පාරාසරියො{4 පාරාසිවියො - මඡසං.} බ්රාහ්මණො සාවකානං ඉන්ද්රියභාවනන්ති."
            },
            {
                "type": "paragraph",
                "text": "දෙසෙති භො ගොතම, පාරාසරියො{5 පාරාසිවියො - මඡසං.} බ්රාහ්මණො සාවකානං ඉන්ද්රියභාවනන්ති."
            },
            {
                "type": "paragraph",
                "text": "යථා කථං පන උත්තර, දෙසෙති පාරාසරියො බ්රාහ්මණො සාවකානං ඉන්ද්රියභාවනන්ති."
            },
            {
                "type": "paragraph",
                "text": "ඉධ භො ගොතම, චක්ඛුනා රූපං න පස්සති, සොතෙන සද්දං න සුණාති. එවං ඛො භො ගොතම, දෙසෙති පාරාසරියො{6 පාරාසිවියො - මඡසං.} බ්රාහ්මණො සාවකානං ඉන්ද්රියභාවනන්ති."
            },
            {
                "type": "paragraph",
                "text": "එවං සන්තෙ ඛො උත්තර, අන්ධො භාවිතින්ද්රියො භවිස්සති, බධිරො භාවිතින්ද්රියො භවිස්සති. යථා පාරාසරියස්ස බ්රාහ්මණස්ස වචනං. අන්ධො හි උත්තර, චක්ඛුනා රූපං න පස්සති. බධිරො සොතෙන සද්දං න සුණාතීති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ උත්තරො මාණවො පාරාසරියන්තෙවාසී තුණ්හීභූතො මඞ්කුභූතො පත්තක්ඛන්ධො අධොමුඛො පජ්ඣායන්තො අප්පටිභානො නිසීදි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා උත්තරං මාණවං පාරාසරියන්තෙවාසිං තුණ්හීභූතං මඞ්කුභූතං පත්තක්ඛන්ධං අධොමුඛං පජ්ඣායන්තං අප්පටිභානං විදිත්වා ආයස්මන්තං ආනන්දං ආමන්තෙසි: ‘අඤ්ඤථා ඛො ආනන්ද, දෙසෙති පාරාසරියො බ්රාහ්මණො සාවකානං ඉන්ද්රියභාවනං, අඤ්ඤථා ච පනානන්ද, අරියස්ස විනයෙ අනුත්තරා ඉන්ද්රියභාවනා හොතී’ති."
            },
            {
                "type": "paragraph",
                "text": "එතස්ස භගවා කාලො, එතස්ස සුගත කාලො යං භගවා අරියස්ස විනයෙ අනුත්තරං ඉන්ද්රියභාවනං දෙසෙය්ය, භගවතො සුත්වා භික්ඛූ ධාරෙස්සන්තී’ති."
            },
            {
                "type": "paragraph",
                "text": "තෙන’හානන්ද, සුණාහි සාධුකං මනසිකරොහි භාසිස්සාමීති."
            },
            {
                "type": "paragraph",
                "text": "එවං භන්තෙති ඛො ආයස්මා ආනන්දො භගවතො පච්චස්සොසි. භගවා එතදවොච:"
            },
            {
                "type": "page-break",
                "text": "618"
            },
            {
                "type": "paragraph",
                "text": "කථඤ්චානන්ද, අරියස්ස විනයෙ අනුත්තරා ඉන්ද්රියභාවනා හොති: ඉධානන්ද, භික්ඛුනො චක්ඛුනා රූපං දිස්වා උප්පජ්ජති මනාපං, උප්පජ්ජති අමනාපං, උප්පජ්ජති මනාපාමනාපං. සො එවං පජානාති: ‘උප්පන්නං ඛො මෙ ඉදං මනාපං, උප්පන්නං අමනාපං, උප්පන්නං මනාපාමනාපං. තඤ්ච ඛො සඞ්ඛතං ඔළාරිකං පටිච්චසමුප්පන්නං, එතං සන්තං එතං පණීතං යදිදං උපෙක්ඛා’ති. තස්ස තං උප්පන්නං මනාපං උප්පන්නං අමනාපං උප්පන්නං මනාපාමනාපං නිරුජ්ඣති, උපෙක්ඛා සණ්ඨාති. සෙය්යථාපි ආනන්ද, චක්ඛුමා පුරිසො උම්මීලෙත්වා වා නිමීලෙය්ය, නිමීලෙත්වා වා උම්මීලෙය්ය. එවමෙව ඛො ආනන්ද, යස්ස කස්සචි එවං සීඝං එවං තුවටං එවං අප්පකසිරෙන උප්පන්නං මනාපං උප්පන්නං අමනාපං උප්පන්නං මනාපාමනාපං නිරුජ්ඣති, උපෙක්ඛා සණ්ඨාති. අයං වුච්චතානන්ද, අරියස්ස විනයෙ අනුත්තරා ඉන්ද්රියභාවනා චක්ඛුවිඤ්ඤෙෙය්යසු රූපෙසු."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං ආනන්ද, භික්ඛුනො සොතෙන සද්දං සුත්වා උප්පජ්ජති මනාපං, උප්පජ්ජති අමනාපං, උප්පජ්ජති මනාපාමනාපං. සො එවං පජානාති: උප්පන්නං ඛො මෙ ඉදං මනාපං, උප්පන්නං අමනාපං, උප්පන්නං මනාපාමනාපං. තඤ්ච ඛො සඞ්ඛතං ඔළාරිකං පටිච්චසමුප්පන්නං. එතං සන්තං එතං පණීතං යදිදං උපෙක්ඛා’ති. තස්ස තං උප්පන්නං මනාපං උප්පන්නං අමනාපං උප්පන්නං මනාපාමනාපං නිරුජ්ඣති, උපෙක්ඛා සණ්ඨාති. සෙය්යථාපි ආනන්ද, බලවා පුරිසො අප්පකසිරෙනෙව අච්ඡරං පහරෙය්ය. එවමෙව ඛො ආනන්ද, යස්ස කස්සචි එවං සීඝං එවං තුවටං එවං අප්පකසිරෙන උප්පන්නං මනාපං උප්පන්නං අමනාපං උප්පන්නං මනාපාමනාපං නිරුජ්ඣති, උපෙක්ඛා සණ්ඨාති. අයං වුච්චතානන්ද, අරියස්ස විනයෙ අනුත්තරා ඉන්ද්රියභාවනා සොතවිඤ්ඤෙෙය්යසු සද්දෙසු."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං ආනන්ද, භික්ඛුනො ඝානෙන ගන්ධං ඝායිත්වා උප්පජ්ජති මනාපං, උප්පජ්ජති අමනාපං, උප්පජ්ජති මනාපාමනාපං. සො එවං පජානාති: ‘උප්පන්නං ඛො මෙ ඉදං මනාපං, උප්පන්නං අමනාපං, උප්පන්නං මනාපාමනාපං. තඤ්ච ඛො සඞ්ඛතං ඔළාරිකං පටිච්චසමුප්පන්නං. එතං සන්තං එතං පණීතං යදිදං උපෙක්ඛා’ති. තස්ස තං උප්පන්නං මනාපං උප්පන්නං අමනාපං උප්පන්නං මනාපාමනාපං නිරුජ්ඣති, උපෙක්ඛා සණ්ඨාති. සෙය්යථාපි ආනන්ද, ඊසකපොණෙ,{1 ඊසකං පොණෙ - සීමු, මඡසං.} පදුමිනීපත්තෙ{2 පදුමපලාසෙ - මඡසං.} උදකඵුසිතානි පවත්තන්ති, න සණ්ඨහන්ති.{3 සණ්ඨන්ති - මඡසං.} එවමෙව ඛො ආනන්ද, යස්ස කස්සචි එවං සීඝං එවං තුවටං එවං අප්පකසිරෙන උප්පන්නං මනාපං උප්පන්නං අමනාපං උප්පන්නං මනාපාමනාපං නිරුජ්ඣති, උපෙක්ඛා සණ්ඨාති. අයං වුච්චතානන්ද, අරියස්ස විනයෙ අනුත්තරා ඉන්ද්රියභාවනා ඝානවිඤ්ඤෙය්යෙසු ගන්ධෙසු."
            },
            {
                "type": "page-break",
                "text": "620"
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං ආනන්ද, භික්ඛුනො ජිව්හාය රසං සායිත්වා උප්පජ්ජති මනාපං, උප්පජ්ජති අමනාපං, උප්පජ්ජති මනාපාමනාපං. සො එවං පජානාති: ‘උප්පන්නං ඛො මෙ ඉදං මනාපං, උප්පන්නං අමනාපං, උප්පන්නං මනාපාමනාපං. තඤ්ච ඛො සඞ්ඛතං ඔළාරිකං පටිච්චසමුප්පන්නං. එතං සන්තං එතං පණීතං යදිදං උපෙක්ඛා’ති. තස්ස තං උප්පන්නං මනාපං උප්පන්නං අමනාපං උප්පන්නං මනාපාමනාපං නිරුජ්ඣති, උපෙක්ඛා සණ්ඨාති. සෙය්යථාපි ආනන්ද, බලවා පුරිසො ජිව්හග්ගෙ ඛෙළපිණ්ඩං සංයූහිත්වා අප්පකසිරෙන වමෙය්ය. එවමෙව ඛො ආනන්ද, යස්ස කස්සචි එවං සීඝං එවං තුවටං එවං අප්පකසිරෙන උප්පන්නං මනාපං උප්පන්නං අමනාපං උප්පන්නං මනාපාමනාපං නිරුජ්ඣති, උපෙක්ඛා සණ්ඨාති. අයං වුච්චතානන්ද, අරියස්ස විනයෙ අනුත්තරා ඉන්ද්රියභාවනා ජිව්හාවිඤ්ඤෙෙය්යසු රසෙසු."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං ආනන්ද, භික්ඛුනො කායෙන ඵොට්ඨබ්බං ඵුසිත්වා උප්පජ්ජති මනාපං, උප්පජ්ජති අමනාපං, උප්පජ්ජති මනාපාමනාපං. සො එවං පජානාති: ‘උප්පන්නං ඛො මෙ ඉදං මනාපං, උප්පන්නං අමනාපං, උප්පන්නං මනාපාමනාපං. තඤ්ච ඛො සඞ්ඛතං ඔළාරිකං පටිච්චසමුප්පන්නං. එතං සන්තං එතං පණීතං යදිදං උපෙක්ඛා’ති. තස්ස තං උප්පන්නං මනාපං උප්පන්නං අමනාපං උප්පන්නං මනාපාමනාපං නිරුජ්ඣති, උපෙක්ඛා සණ්ඨාති. සෙය්යථාපි ආනන්ද, බලවා පුරිසො සමිඤ්ජිතං වා බාහං පසාරෙය්ය, පසාරිතං වා බාහං සමිඤ්ජෙය්ය{1 සමිඤ්ජෙය්ය - මඡසං.} එවමෙව ඛො ආනන්ද, යස්ස කස්සචි එවං සීඝං එවං තුවටං එවං අප්පකසිරෙන උප්පන්නං මනාපං උප්පන්නං අමනාපං උප්පන්නං මනාපාමනාපං නිරුජ්ඣති, උපෙක්ඛා සණ්ඨාති. අයං වුච්චතානන්ද, අරියස්ස විනයෙ අනුත්තරා ඉන්ද්රියභාවනා කායවිඤ්ඤෙෙය්යසු ඵොට්ඨබ්බෙසු."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං ආනන්ද, භික්ඛුනො මනසා ධම්මං විඤ්ඤාය උප්පජ්ජති මනාපං, උප්පජ්ජති අමනාපං, උප්පජ්ජති මනාපාමනාපං. සො එවං පජානාති: ‘උප්පන්නං ඛො මෙ ඉදං මනාපං, උප්පන්නං අමනාපං, උප්පන්නං මනාපාමනාපං. තඤ්ච ඛො සඞ්ඛතං ඔළාරිකං පටිච්චසමුප්පන්නං. එතං සන්තං එතං පණීතං යදිදං උපෙක්ඛා’ති. තස්ස තං උප්පන්නං මනාපං උප්පන්නං අමනාපං උප්පන්නං මනාපාමනාපං නිරුජ්ඣති, උපෙක්ඛා සණ්ඨාති. සෙය්යථාපි ආනන්ද, බලවා පුරිසො දිවසසන්තත්තෙ{2 දිවසං සන්තත්තෙ - මඡසං.} අයොකටාහෙ ද්වෙ වා තීණි වා උදකඵුසිතානි නිපාතෙය්ය. දන්ධො ආනන්ද, උදකඵුසිතානං නිපාතො, අථ ඛො නං ඛිප්පමෙව පරික්ඛයං පරියාදානං ගච්ඡෙය්ය. එවමෙව ඛො, ආනන්ද, යස්ස කස්සචි එවං සීඝං එවං තුවටං එවං අප්පකසිරෙන උප්පන්නං මනාපං උප්පන්නං අමනාපං උප්පන්නං මනාපාමනාපං නිරුජ්ඣති, උපෙක්ඛා සණ්ඨාති. අයං වුච්චතානන්ද, අරියස්ස විනයෙ අනුත්තරා ඉන්ද්රියභාවනා මනොවිඤ්ඤෙෙය්යසු ධම්මෙසු. එවං ඛො ආනන්ද, අරියස්ස විනයෙ අනුත්තරා ඉන්ද්රියභාවනා හොති."
            },
            {
                "type": "page-break",
                "text": "622"
            },
            {
                "type": "paragraph",
                "text": "කථඤ්චානන්ද, සෙඛො හොති පාටිපදො. ඉධානන්ද, භික්ඛුනො චක්ඛුනා රූපං දිස්වා උප්පජ්ජති මනාපං, උප්පජ්ජති අමනාපං, උප්පජ්ජති මනාපාමනාපං. සො තෙන උප්පන්නෙන මනාපෙන උප්පන්නෙන අමනාපෙන උප්පන්නෙන මනාපාමනාපෙන අට්ටීයති හරායති ජිගුච්ඡති. සොතෙන සද්දං සුත්වා -පෙ- ඝානෙන ගන්ධං ඝායිත්වා -පෙ-, ජිව්හාය රසං සායිත්වා -පෙ- කායෙන ඵොට්ඨබ්බං ඵුසිත්වා -පෙ- මනසා ධම්මං විඤ්ඤාය උප්පජ්ජති මනාපං, උප්පජ්ජති අමනාපං, උප්පජ්ජති මනාපාමනාපං. සො තෙන උප්පන්නෙන මනාපෙන උප්පන්නෙන අමනාපෙන උප්පන්නෙන මනාපාමනාපෙන අට්ටීයති හරායති ජිගුච්ඡති. එවං ඛො ආනන්ද, සෙඛො හොති පාටිපදො."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්චානන්ද, අරියො හොති භාවිතින්ද්රියො. ඉධානන්ද, භික්ඛුනො චක්ඛුනා රූපං දිස්වා උප්පජ්ජති මනාපං, උප්පජ්ජති අමනාපං, උප්පජ්ජති මනාපාමනාපං. සො සචෙ ආකඞ්ඛති: ‘පටික්කූලෙ{1 පටිකූලෙ - මඡසං.} අප්පටික්කූලසඤ්ඤී විහරෙය්ය’න්ති. අප්පටික්කූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති අප්පටික්කූලෙ පටික්කූලසඤ්ඤී විහරෙය්යන්ති. පටික්කූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති: ‘පටික්කූලෙ ච අප්පටික්කූලෙ ච අප්පටික්කූලසඤ්ඤී විහරෙය්ය’න්ති. අප්පටික්කූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති: අප්පටික්කූලෙ ච පටික්කූලෙ ච පටික්කූලසඤ්ඤී විහරෙය්ය’න්ති. පටික්කූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති: ‘පටික්කූලං ච අප්පටික්කූලං ච තදුභයං අභිනිවජ්ජෙත්වා උපෙක්ඛකො විහරෙය්යං සතො සම්පජානො’ති. උපෙක්ඛකො තත්ථ විහරති සතො සම්පජානො."
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං ආනන්ද, භික්ඛුනො සොතෙන සද්දං සුත්වා -පෙ- ඝානෙන ගන්ධං ඝායිත්වා -පෙ- ජිව්හාය රසං සායිත්වා -පෙ- කායෙන ඵොට්ඨබ්බං ඵුසිත්වා -පෙ- මනසා ධම්මං විඤ්ඤාය උප්පජ්ජති මනාපං, උප්පජ්ජති අමනාපං, උප්පජ්ජති මනාපාමනාපං. සො සචෙ ආකඞ්ඛති පටික්කූලෙ අප්පටික්කූලසඤ්ඤී විහරෙය්යන්ති. අප්පටික්කූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති: ‘අප්පටික්කූලෙ පටික්කූලසඤ්ඤී විහරෙය්යන්ති. පටික්කූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති: ‘පටික්කූලෙ ච අප්පටික්කූලෙ ච අප්පටික්කූලසඤ්ඤී විහරෙය්ය’න්ති. අප්පටික්කූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති: ‘අප්පටික්කූලෙ ච පටික්කූලෙ ච පටික්කූලසඤ්ඤී විහරෙය්ය’න්ති. පටික්කූලසඤ්ඤී තත්ථ විහරති. සචෙ ආකඞ්ඛති ; පටික්කූලඤ්ච අප්පටික්කූලඤ්ච තදුභයං{2 තදුභයම්පි - මඡසං.} අභිනිවජ්ජෙත්වා උපෙක්ඛකො විහරෙය්යං සතො සම්පජානො’ති. උපෙක්ඛකො තත්ථ විහරති සතො සම්පජානො. එවං ඛො ආනන්ද, අරියො හොති භාවිතින්ද්රියො."
            },
            {
                "type": "page-break",
                "text": "624"
            },
            {
                "type": "paragraph",
                "text": "ඉති ඛො ආනන්ද, දෙසිතා මයා අරියස්ස විනයෙ අනුත්තරා ඉන්ද්රියභාවනා. දෙසිතො සෙඛො පාටිපදො. දෙසිතො අරියො භාවිතින්ද්රියො. යං ඛො ආනන්ද, සත්ථාරා කරණීයං සාවකානං හිතෙසිනා අනුකම්පකෙන අනුකම්පං උපාදාය, කතං වො තං මයා. එතානි ආනන්ද, රුක්ඛමූලානි, එතානි සුඤ්ඤාගාරානි, ඣායථානන්ද, මා පමාදත්ථ. මා පච්ඡා විප්පටිසාරිනො අහුවත්ථ. අයං වො අම්හාකං අනුසාසනීති."
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච භගවා. අත්තමනො ආයස්මා ආනන්දො භගවතො භාසිතං අභිනන්දීති."
            },
            {
                "type": "centered",
                "text": "ඉන්ද්රියභාවනා සුත්තං දසමං.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "සළායතනවග්ගො පඤ්චමො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "උපරිපණ්ණාසකං සමත්තං.",
                "level": 2
            },
            {
                "type": "centered",
                "text": "තස්ස වග්ගස්ස උද්දානං.",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "අනාථපිණ්ඩිකො ඡන්නො පුණ්ණො නන්දක රාහුලා,\nඡ ඡක්කං සළායතනිකං නගරවින්දෙය්ය සුද්ධිකා,\nඉන්ද්රියභාවනා චාපි වග්ගො ඔවාද පඤ්චමොති.{1 අනාථ පිණ්ඩිකො ඡන්නො පුණ්ණො නන්ද රාහුල ඡක්කඤ්ච සළායතනිකං\n නගරවින්දෙය්යං සුද්ධිකෙ ඉන්ද්රියභාවනඤ්චාපි වග්ගො ඔවාදපඤ්චමොති - මඡසං}",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "ඉදං වග්ගානමුද්දානං.",
                "level": "1"
            },
            {
                "type": "gatha",
                "text": "දෙවදහො’නුපදො ච සුඤ්ඤතො ච විභඞ්ගකො,\nසළායතනොති වග්ගා උපරිපණ්ණාසකෙ ඨිතාති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "තීහි පණ්ණාසකෙහි පතිමණ්ඩිතො සකලො\nමජ්ඣිමනිකායො සමත්තො.",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ],
        "pages": {
            "528": {
                "pageNum": 528,
                "footnotesCount": 0
            },
            "530": {
                "pageNum": 530,
                "footnotesCount": 3
            },
            "532": {
                "pageNum": 532,
                "footnotesCount": 1
            },
            "534": {
                "pageNum": 534,
                "footnotesCount": 6
            },
            "536": {
                "pageNum": 536,
                "footnotesCount": 2
            },
            "538": {
                "pageNum": 538,
                "footnotesCount": 1
            },
            "540": {
                "pageNum": 540,
                "footnotesCount": 0
            },
            "542": {
                "pageNum": 542,
                "footnotesCount": 0
            },
            "544": {
                "pageNum": 544,
                "footnotesCount": 2
            },
            "546": {
                "pageNum": 546,
                "footnotesCount": 0
            },
            "548": {
                "pageNum": 548,
                "footnotesCount": 2
            },
            "550": {
                "pageNum": 550,
                "footnotesCount": 2
            },
            "552": {
                "pageNum": 552,
                "footnotesCount": 3
            },
            "554": {
                "pageNum": 554,
                "footnotesCount": 0
            },
            "556": {
                "pageNum": 556,
                "footnotesCount": 0
            },
            "558": {
                "pageNum": 558,
                "footnotesCount": 1
            },
            "560": {
                "pageNum": 560,
                "footnotesCount": 1
            },
            "562": {
                "pageNum": 562,
                "footnotesCount": 0
            },
            "564": {
                "pageNum": 564,
                "footnotesCount": 0
            },
            "566": {
                "pageNum": 566,
                "footnotesCount": 0
            },
            "568": {
                "pageNum": 568,
                "footnotesCount": 0
            },
            "570": {
                "pageNum": 570,
                "footnotesCount": 0
            },
            "572": {
                "pageNum": 572,
                "footnotesCount": 2
            },
            "574": {
                "pageNum": 574,
                "footnotesCount": 2
            },
            "576": {
                "pageNum": 576,
                "footnotesCount": 0
            },
            "578": {
                "pageNum": 578,
                "footnotesCount": 0
            },
            "580": {
                "pageNum": 580,
                "footnotesCount": 2
            },
            "582": {
                "pageNum": 582,
                "footnotesCount": 0
            },
            "584": {
                "pageNum": 584,
                "footnotesCount": 2
            },
            "586": {
                "pageNum": 586,
                "footnotesCount": 0
            },
            "588": {
                "pageNum": 588,
                "footnotesCount": 0
            },
            "590": {
                "pageNum": 590,
                "footnotesCount": 0
            },
            "592": {
                "pageNum": 592,
                "footnotesCount": 0
            },
            "594": {
                "pageNum": 594,
                "footnotesCount": 1
            },
            "596": {
                "pageNum": 596,
                "footnotesCount": 1
            },
            "598": {
                "pageNum": 598,
                "footnotesCount": 0
            },
            "600": {
                "pageNum": 600,
                "footnotesCount": 0
            },
            "602": {
                "pageNum": 602,
                "footnotesCount": 0
            },
            "604": {
                "pageNum": 604,
                "footnotesCount": 1
            },
            "606": {
                "pageNum": 606,
                "footnotesCount": 1
            },
            "608": {
                "pageNum": 608,
                "footnotesCount": 0
            },
            "610": {
                "pageNum": 610,
                "footnotesCount": 0
            },
            "612": {
                "pageNum": 612,
                "footnotesCount": 0
            },
            "614": {
                "pageNum": 614,
                "footnotesCount": 0
            },
            "616": {
                "pageNum": 616,
                "footnotesCount": 6
            },
            "618": {
                "pageNum": 618,
                "footnotesCount": 3
            },
            "620": {
                "pageNum": 620,
                "footnotesCount": 2
            },
            "622": {
                "pageNum": 622,
                "footnotesCount": 2
            },
            "624": {
                "pageNum": 624,
                "footnotesCount": 1
            }
        }
    },
    {
        "filename": "1-9-11-36-91",
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "529"
            },
            {
                "text": "5. සළායතන වර්ගය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "centered",
                "text": "3.5.1",
                "level": 1
            },
            {
                "type": "heading",
                "text": "අනාථපිණ්ඩිකොවාද සූත්‍රය",
                "level": 1
            },
            {
                "text": "මා විසින් මෙසේ අසන ලදි: එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත්නුවර අනේපිඬුසිටුහුගේ දෙව්රම්හි වැඩවසන සේක. එසමයෙහි අනේපිඬුගැහැවි හටගත් ආබාධ ඇති වැ දුකට පැමිණියේ දැඩිගිලන් වූයේ වෙයි. ඉක්බිති අනේපිඬුගැහැවි එක්තරා පුරුෂයෙක් ඇමතී. එව එම්බාපුරුෂය, තෝ භාග්‍යවතුන් වහන්සේ කරා එළැඹ මාගේ බසින් භාග්‍යවතුන් වහන්සේගේ පාසඟළ හිසින් වඳු. ‘වහන්ස, අනේපිඬුගැහැවි හටගත් ආබාධ ඇති වැ දුකට පැමිණියේ දැඩිගිලන් වූයේ හේ භාග්‍යවතුන් වහන්සේගේ පාසඟළ හිසින් වඳී’ යයි. යළි ආයුෂ්මත් සැරියුත් තෙරුන් කරා එලැඹැ මාගේ බසින් ආයුෂ්මත් සැරියුත් තෙරණුවන්ගේ පාසඟළ හිසින් වඳු. ‘වහන්ස, අනේපිඬු ගැහැවි ... වඳී’ යයි. මෙසේත් සැලකර. වහන්ස, ආයුෂ්මත් සැරියුත් තෙරණුවෝ අනේපිඬු සිටුහුගේ නිවෙස්න කරා අනුකම්පා පිණිස එළැඹෙනසේක්ව’යි.",
                "type": "paragraph"
            },
            {
                "text": "‘එසේ යැ වහන්සැ’ යි ඒ පුරුෂ අනේපිඬුසිටුහට පිළිවදන් දී භාග්‍යවතුන් වහන්සේ කරා එලැඹියේ යැ. එළැඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පස් වැ හින. එකත්පස් වැ හුන් ඒ පුරුෂ භාග්‍යවතුන් වහන්සේට තෙල සැල කෙළේ: ‘වහන්ස, අනේපිඬුගැහැවි ආබාධික වැ දුකට පැමිණියේ දැඩිගිලන් වූයේ වෙයි, හේ භාග්‍යවතුන් වහන්සේගේ පාසඟළ හිසින් වඳී’ යයි. යළි ආයුෂ්මත් සැරියුත් තෙරුන් කරා එලැඹ ආයුෂ්මත් සැරියුත් තෙරුන් අභිවාදන කොට එකත්පස් වැ හින. එකත්පස් වැ හුන් ඒ පුරුෂ ආයුෂ්මත් සැරියුත් තෙරණුවන්ට තෙල කී: ‘වහන්ස, අනේපිඬුගැහැවි ආබාධික වැ දුඃඛිත වැ දැඩි ගිලන් වෙයි. හේ ආයුෂ්මත් සැරියුත් තෙරණුවන්ගේ පාසඟළ හිසින් වඳියි. මෙසේත් කියයි: ‘වහන්ස, ආයුෂ්මත් සැරියුත් තෙරණුවෝ අනුකම්පා පිණිස අනේපිඬුසිටුහුගේ නිවෙස්න කරා එළැඹෙනසේක්ව’යි.",
                "type": "paragraph"
            },
            {
                "text": "ආයුෂ්මත් සැරියුත් තෙරණුවෝ නො බැණ ඉවසූසේක. ඉක්බිති, ආයුෂ්මත් සැරියුත් තෙරණුවෝ හැඳ පෙරෙවැ පාසිවුරු ගෙන පසුවැ යන ආයුෂ්මත් අනඳ තෙරුන් සමග අනේපිඬුසිටුහුගේ නිවෙස්න කරා එළැඹියහ. එළැඹ පැනැවූ අස්නෙහි වැඩහුන්හ. වැඩහිඳ ආයුෂ්මත් සැරියුත් තෙරණුවෝ අනේපිඬුගැහැවියනට තෙල වදාළහ. කිම ගැහැවිය, තොපට සෑහිය හෙයි ද, කිම යැපියහෙයි ද, කිම තොපගේ දුක් වේදනාවෝ තනු වෙත් ද, නො වැඩෙත් ද, තනුභාවයෙන් පැනේ ද, වැඩීම නො පැනේ දැ’යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "531"
            },
            {
                "text": "ශාරිපුත්‍රයන් වහන්ස, මට ඉවසිය නො හැක්ක, යැපිය නො හැක්ක, මාගේ දුඃඛ වෙදනාවෝ දැඩි වූවාහු, බලවත් වෙති, තුනී නො වෙත්, වැඩීමේ අවසානය පැනෙයි, බැසීමේ අවසානය නො පැනෙයි.",
                "type": "paragraph"
            },
            {
                "text": "ශාරිපුත්‍රයන් වහන්ස, යම්සේ බලවත් පුරුෂයෙක් තියුණු සැතෙකින් මුදුන පෙළා ද එසෙයින් මැ ශාරිපුත්‍රයන් වහන්ස, අධිමාත්‍ර වූ වාතයෝ මුදුන පෙළති. ශාරිපුත්‍රයන් වහන්ස, මට ඉවසිය නො හැක්ක, යැපිය නො හැක්ක. මාගේ දැඩි වූ දුඃඛ වෙදනාවෝ වැඩෙති, තනු නො වෙත්. වැඩීමේ අවසානය පැනෙයි, තනු බවෙක් නො පැනෙයි.",
                "type": "paragraph"
            },
            {
                "text": "ශාරිපුත්‍රස්ථවිරයන් වහන්ස, යම්සේ බලවත් පුරුෂයෙක් වරපටබැඳුමෙකින් හිස්වෙළුම් දෙන්නේ ද එසෙයින් මැ ශාරිපුත්‍රයන් වහන්ස, අධිමාත්‍ර වූ වාතයෝ මාගේ හිස සිඳිති. ස්වාමීනි ශාරිපුත්‍රයන් වහන්ස, මට සිහිය නො හැක්ක, යැපිය නො හැක්ක, මාගේ දැඩි වූ දුඃඛ වෙදනාවෝ වැඩෙති, තනු නො වෙත්. වැඩීමේ අවසානය පැනෙයි, තනු බවෙක් නො පැනේ යයි.",
                "type": "paragraph"
            },
            {
                "text": "ස්වාමීනි ශාරිපුත්‍රයන් වහන්ස, යම්සේ දක්ෂ වූ ගොඝාතකයෙක් වේවයි ගොඝාතක අතවැසියෙක් වේවයි තියුණු වූ ගෙරින් කපන සැතෙකින් කුස සිඳින්නේ ද, එසෙයින් මැ ශාරිපුත්‍රස්ථවිරයන් වහන්ස, අධිමාත්‍ර වූ වාතයෝ මාගේ කුස සිඳිති. ස්වාමීනි ශාරිපුත්‍රස්ථවිරයන් වහන්ස, මට සිහිය නො හැක්ක, මාගේ දැඩි වූ දුඃඛ වෙදනාවෝ වැඩෙති, තනු නො වෙත්. වැඩීමේ අවසානය පැනෙයි, තනු බවෙක් නො පැනේ යයි.",
                "type": "paragraph"
            },
            {
                "text": "ස්වාමීනි ශාරිපුත්‍රස්ථවිරයන් වහන්ස, යම්සේ බලවත් පුරුෂයෝ දෙදෙනෙක් ඉතා දුඹුල් පුරුෂයකු වෙන වෙන අත්ලාගෙන අඟුරුවළෙක්හි තවන්නාහු ද හාත්පසින් තවන්නාහු ද, එසෙයින් මැ ස්වාමීනි ශාරිපුත්‍රයන් වහන්ස, අධිමාත්‍ර වූ මාගේ ශරීරදාහය වෙයි. ස්වාමීනි ශාරිපුත්‍රස්ථවිරයන් වහන්සැ, මට සිහිය නො හැක්ක, යැපිය නො හැක්ක.",
                "type": "paragraph"
            },
            {
                "text": "ගැහැවිය, එහෙයින් තොප විසින් මෙසේ හික්මියයුතු යැ, චක්ෂුස තෘෂ්ණාදීන් නො ගන්මි. මාගේ විඥානය චක්ෂුර්නිඃශ්‍රිත නො වේ යයි, ගැහැවිය, මෙසේ මැ තොප විසින් හික්මියයුතු ය. ගැහැවිය, එහෙයින් තොප විසින් මෙසේ හික්මියයුතු ය: ශ්‍රොතය තෘෂ්ණාදීන් නො ගන්මි. මාගේ විඥානය ශ්‍රොතනිඃශ්‍රිත ද නො වේ යයි, ගැහැවිය, මෙසේ මැ තොප විසින් හික්මියයුතු ය. ගැහැවිය, එහෙයින් තොප විසින් මෙසේ හික්මියයුතු ය: ඝ්‍රාණය තෘෂ්ණාදීන් නො ගන්මි. මාගේ විඥානය ඝ්‍රාණනිඃශ්‍රිත ද නො වේ යයි, ගැහැවිය, මෙසේ මැ තොප විසින් හික්මියයුතු ය. ගැහැවිය, එහෙයින් ... මාගේ විඥාන ජිහ්වා නිඃශ්‍රිත නො වේ යයි ... හික්මියයුතු ය. ගැහැවිය, එහෙයින් ... කය තෘෂ්ණාදීන් නො ගන්මි ... හික්මියයුතු ය. ගැහැවිය, එහෙයින් ... මනස තෘෂ්ණාදීන් නො ගන්මි ... හික්මියයුතු ය.",
                "type": "paragraph"
            },
            {
                "text": "ගැහැවිය, එහෙයින් ... රූපය තෘෂ්ණාදීන් නො ගන්මි ... හික්මියයුතු ය. ගැහැවිය, එහෙයින් ... ශබ්ද තෘෂ්ණාදීන් නො ගන්මි ... ගන්ධය තෘෂ්ණාදීන් නො ගන්මි ... රසය තෘෂ්ණාදීන් නො ගන්මි ... ස්පර්ශය තෘෂ්ණාදීන් නො ගන්මි ... ධර්මය තෘෂ්ණාදීන් නො ගන්මි. මාගේ විඥානය ධර්මනිඃශ්‍රිත නො ද වේ’ යයි තොප විසින් මෙසේ මැ හික්මියයුතු ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "533"
            },
            {
                "text": "ගැහැවිය, එහෙයින් තොප විසින් මෙසේ මැ හික්මියයුතු යැ: ‘චක්ෂුර්විඥානය තෘෂ්ණාදීන් නො ගන්මි. මාගේ විඥානය චක්ෂුරවිඥානනිඃශ්‍රිත ද නො වේ’ යයි, ගැහැවිය තොප විසින් මෙසේ මැ හික්මියයුතු ය. ගැහැවිය එහෙයින් තොප විසින් මෙසේ හික්මියයුතු යැ: ශ්‍රොතවිඥානය තෘෂ්ණාදීන් නො ගන්මි ... ඝ්‍රාණවිඥානය තෘෂ්ණාදීන් නො ගන්මි. ... ජිහ්වාවිඥානය තෘෂ්ණාදීන් නො ගන්මි. ... කායවිඥානය තෘෂ්ණාදීන් නො ගන්මි. ... මනෝවිඥානය තෘෂ්ණාදීන් නො ගන්මි. මාගේ විඥානය මනොවිඥානනිඃශ්‍රිත ද නො වේ’ යයි ගැහැවිය, මෙසේ මැ තොප විසින් හික්මියයුතු ය.",
                "type": "paragraph"
            },
            {
                "text": "ගැහැවිය, එහෙයින් තොප විසින් මෙසේ හික්මියයුතු ය: ‘චක්ෂුඃසංස්පර්ශය තෘෂ්ණාදීන් නො ගන්මි. මාගේ විඥානය චක්ෂුඃසංස්පර්ශනිඃශ්‍රිත ද නො වේ’ යයි, ගැහැවිය, තොප විසින් මෙසේ හික්මියයුතු ය. ගැහැවිය, එහෙයින් තොප විසින් මෙසේ හික්මියයුතු ය: ශ්‍රොත්‍රසංස්පර්ශය තෘෂ්ණාදීන් නො ගන්මි ... ඝ්‍රාණසංස්පර්ශය තෘෂ්ණාදීන් නො ගන්මි ... ජිහ්වාසංස්පර්ශය තෘෂ්ණාදීන් නො ගන්මි ... කායසංස්පර්ශය තෘෂ්ණාදීන් නො ගන්මි ... මනඃසංස්පර්ශය තෘෂ්ණාදීන් නො ගන්මි. මාගේ විඥානය මනඃසංස්පර්ශනිඃශ්‍රිත නො වේ’ යයි ගැහැවිය, මෙසේ මැ තොප විසින් හික්මියයුතු යි.",
                "type": "paragraph"
            },
            {
                "text": "ගැහැවිය, එහෙයින් තොප විසින් මෙසේ හික්මියයුතු ය: ‘චක්ෂුඃසංස්පර්ශයෙන් උපන් වේදනාව තෘෂ්ණාදීන් නො ගන්මි. මාගේ විඥානය චක්ෂුඃසංස්පර්ශයෙන් උපන් වේදනානිඃශ්‍රිත ද නො වේ’ යයි, ගැහැවිය, තොප විසින් මෙසේ මැ හික්මියයුතු ය. ගැහැවිය, එහෙයින් තොප විසින් මෙසේ හික්මියයුතු ය: ‘ශ්‍රොත්‍රසංස්පර්ශයෙන් උපන් වේදනාව තෘෂ්ණාදීන් නො ගන්මි ... ඝ්‍රාණසංස්පර්ශයෙන් උපන් වේදනාව තෘෂ්ණාදීන් නො ගන්මි ... ජිහ්වාසංස්පර්ශයෙන් උපන් වේදනාව තෘෂ්ණාදීන් නො ගන්මි ... කායසංස්පර්ශයෙන් උපන් වෙදනාව තෘෂ්ණාදීන් නො ගන්මි ... මනඃසංස්පර්ශයෙන් උපන් වෙදනාව තෘෂ්ණාදීන් නො ගන්මි. මාගේ විඥානය මනඃසංස්පර්ශයෙන් උපන් වේදනානිඃශ්‍රිත ද නො වේ’ යයි ගැහැවිය, තොප විසින් මෙසේ මැ හික්මියයුතු යි.",
                "type": "paragraph"
            },
            {
                "text": "ගැහැවිය, එහෙයින් තොප විසින් මෙසේ හික්මියයුතු ය: ‘පෘථිවිධාතු තෘෂ්ණාදීන් නො ගන්මි. මාගේ විඥානය පෘථිවිධාතුනිඃශ්‍රිත ද නො වේ’ යයි, ගැහැවිය, තොප විසින් මෙසේ මැ හික්මියයුතු ය. ගැහැවිය, එහෙයින් ... හික්මියයුතු ය: අබ්ධාතු තෘෂ්ණාදීන් නො ගන්මි ... තෙජොධාතු තෘෂ්ණාදීන් නො ගන්මි ... වායොධාතු තෘෂ්ණාදීන් නො ගන්මි ... ආකාශධාතු තෘෂ්ණාදීන් නො ගන්මි ... විඥානධාතු තෘෂ්ණාදීන් නො ගන්මි. මාගේ විඥානය විඥානධාතුනිඃශ්‍රිත නො වේ’ යයි ගැහැවිය, තොප විසින් මෙසේ මැ හික්මියයුතු යි.",
                "type": "paragraph"
            },
            {
                "text": "එහෙයින් ගැහැවිය, තොප විසින් මෙසේ හික්මියයුතු ය: ‘රූපය තෘෂ්ණාදීන් නො ගන්මි. මාගේ විඥානය රූප නිඃශ්‍රිත ද නො වේ’ යයි, ගැහැවිය, තොප විසින් මෙසේ මැ හික්මියයුතු ය. ‘වෙදනාව තෘෂ්ණාදීන් නො ගන්මි ... සංඥාව ... සංස්කාරයන් ... විඥානය තෘෂ්ණාදීන් විසින් නො ගන්මි. මාගේ විඥානය නො ද විඥානනිඃශ්‍රිත වේ’ යයි ගැහැවිය, තොප විසින් මෙසේ මැ හික්මියයුතු.",
                "type": "paragraph"
            },
            {
                "text": "ගැහැවිය, එහෙයින් තොප විසින් මෙසේ හික්මියයුතු ය: ‘ආකාසානඤ්චායතනය තෘෂ්ණාදීන් විසින් නො ගන්මි. මාගේ විඥානය නො ද ආකාසානඤ්චායතනනිඃශ්‍රිත වේ’ යයි, ගැහැවිය, තොප විසින් මෙසේ මැ හික්මියයුතු ය. ගැහැවිය එහෙයින් තොප විසින් මෙසේ හික්මියයුතු ය: ‘විඤ්ඤාණඤ්චායතනය ... ආකිඤ්චාඤ්ඤායතනය ... නෙවසඤ්ඤානාසඤ්ඤායතනය තෘෂ්ණාදීන් විසින් නො ගන්මි. මාගේ විඥානය නෙවසඤ්ඤානාසඤ්ඤායතනනිඃශ්‍රිත වූයේ නො ද වේ’ යයි ගැහැවිය, තොප විසින් මෙසේ මැ හික්මියයුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "535"
            },
            {
                "text": "එහෙයින් ගැහැවිය, තොප විසින් මෙසේ හික්මියයුතු ය: ‘මෙලොව තෘෂ්ණාදීන් විසින් නො ගන්මි. මාගේ විඥානය නො ද මෙලොව ඇසුරු කරනලද වේ’ යයි, ගැහැවිය, තොප විසින් මෙසේ මැ හික්මියයුතු. එහෙයින් ගැහැවිය, තොප විසින් මෙසේ හික්මියයුතු ය: ‘පරලොව තෘෂ්ණාදීන් විසින් නො ගන්මි. මාගේ විඥානය නො ද පරලොව ඇසුරු කරනලද වේ’ යයි, ගැහැවිය, තොප විසින් මෙසේ මැ හික්මියයුතු.",
                "type": "paragraph"
            },
            {
                "text": "එහෙයින් ගැහැවිය, තොප විසින් මෙසේ හික්මියයුතු ලැබූ සිතින් විමසූ ‘යම් රූපායතනයෙක් ඇද්ද, ශබ්දායතනයෙක් ඇද්ද, ගන්ධරස ඵොට්ඨබ්බායතනයෙක් ඇද්ද, ධම්මායතනයෙක් ඇද්ද, එ ද තෘෂ්ණාදි විසින් නොගන්මි. මාගේ විඥානය ඒ රූපාදිය නො ද ඇසුරු කරනලද වේ’ යයි, ගැහැවිය, තොප විසින් මෙසේ මැ හික්මියයුතු යයි. ",
                "type": "paragraph"
            },
            {
                "text": "මෙසේ වදාළ කල්හි අනේපිඬු ගැහැවි හැඬී, කඳුළු හෙළී. එකල්හි ආයුෂ්මත් අනඳ තෙරණුවෝ අනේපිඬු ගැහැවිහට තෙල වදාළහ: ගැහැවිය, තෙපි (අරමුණෙහි) ඇලෙව, ගැලෙව යි.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස ආනන්ද තෙරණුවෙනි, මම් අරමුණෙහි නො ඇලෙමි, නො ද ගැලෙමි. වැලි එකෙක් ඇති, මා විසින් දීර්ඝරාත්‍රයෙහි ශාස්තෲන් වහන්සේ පර්ය්‍යුපාසිතයහ. මනොභාවනීය භික්ෂූහු ද පර්ය්‍යුපාසිත වූහු. මා විසින් මෙබඳු වූ ධර්මකථාවක් නො ද ඇසූවිරූ යයි.",
                "type": "paragraph"
            },
            {
                "text": "ගැහැවිය, හෙළපිළිහඳනා ගිහිගේ වැසියනට මෙබඳු ධර්මකථා නො වැටහෙයි. ගැහැවිය,පැවිද්දනට මෙබඳු ධර්මකථා වැටහේ යයි.",
                "type": "paragraph"
            },
            {
                "text": "එසේ වී නම් ස්වාමීනි, ශාරිපුත්‍රස්ථවිරයන් වහන්ස, හෙළපිළී හඳනා ගිහිගේ වැසියනට මෙබඳු ධර්මකථා වැටහේවා. ස්වාමීනි, ශාරිපුත්‍රස්ථවිරයන් වහන්ස, අල්පරජස්ක ස්වභාව ඇති කුලපුත්‍රයෝ ඇත්තාහු මැ යැ. ධර්මය අශ්‍රවණතායෙන් (ඔහු) පිරිහෙති. දහම් අවබෝධ කරන්නාහු ඇත්තාහ’ යි.",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති ආයුෂ්මත් ශාරිපුත්‍රස්ථවිරයන් වහන්සේ ද ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ද අනේපිඬු ගැහැවියනට මේ අවවාදයෙන් ඔවා දී හුනස්නෙන් නැඟී නික්ම ගියාහ.",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති ආයුෂ්මත් ශාරිපුත්‍රස්ථවිරයන් වහන්සේ ද ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ද නික්මගිය නොබෝ කාලයෙහි අනේපිඬු ගැහැවි කාබුන් මරණින් මතුයෙහි තුසීපුර උපන.",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති අනේපිඬු දෙව්පිත් මධ්‍යමරාත්‍රියෙහි මනා සිරුරු පැහැ ඇති වැ සියලු දෙව්රම බබුළුවා භාග්‍යවතුන් වහන්සේ කරා එළඹ භාග්‍යවතුන් වහන්සේට අභිවාදනා කොට එකත්පස් වැ සිටගත. එකත්පස් වැ සිටි අනේපිඬු දෙව්පිත් භාග්‍යවතුන් වහන්සේට ගාථායෙන් මෙසේ කී:",
                "type": "paragraph"
            },
            {
                "text": "හික්ෂුසංඝයා විසින් නිති සෙවුනා ලද, ධර්මරාජයන් වහන්සේ විසින් වාස කළ මේ ජෙතවනය මට ප්‍රීති උපදවනු වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "මාර්ගචෙතනා සංඛ්‍යාත කර්මය ද මාර්ගප්‍රඥා සංඛ්‍යාත විද්‍යාව ද සමාධිපාක්ෂික ධර්මය ද සිල්වත්හුගේ ජීවිතය ද උතුම් වෙයි. තෙල කර්මාදිය හේතු කොට ගෙන සත්ත්වයෝ විශුද්ධ වෙති. ගොත්‍රයෙන් වේවයි ධනයෙන් වේවයි ශුද්ධ නො වෙත්.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "537"
            },
            {
                "text": "එහෙයින් පණ්ඩිත පුරුෂ තමහට වැඩ පසස්නේ සමාධිපාක්ෂික ධර්මය උපායයෙන් (නුවණින්) විමසන්නේ ය. මෙසේ ඒ ආර්‍ය්‍යමාර්ගයෙහි විශුද්ධ වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "ප්‍රඥායෙන් ද ශීලයෙන් ද ක්ලෙශොපශමයෙන් ද ශාරිපුත්‍රස්ථවිරයන් වහන්සේ මැ ශ්‍රෙෂ්ඨ වෙති. නිර්‍වාණපාරයට පැමිණි යම් මහණෙක් වේ ද හෙතෙම ශාරිපුත්‍රස්ථවිරයන් වහන්සේ පරම කොට ඇති වන්නේ ය’යි.",
                "type": "paragraph"
            },
            {
                "text": "අනේපිඬු දෙව්පිත් මේ කී ය: ශාස්තෲන් වහන්සේ අනුදත්සේක. ඉක්බිති අනේපිඬු දෙව්පිත් ශාස්තෲන් වහන්සේ මා කී වදන් අනුදත්හ’ යි භාග්‍යවතුන් වහන්සේ වැඳ පැදකුණු කොට එහි මැ අතුරුදහන් වී.",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ ඒ රාත්‍රිය ඇවෑමෙන් භික්ෂූන් ඇමතූසේක: මහණෙනි, මේ රාත්‍රියෙහි එක්තරා දිව්‍යපුත්‍රයෙක් ඉක්මගිය මධ්‍යමරාත්‍රියෙහි මනා සිරුරු පැහැ ඇති වැ සියලු දෙව්රම බබුළුවා මා කරා එළඹ මා අභිවාදනය කොට එකත්පස් වැ සිටගත. මහණෙනි, එකත්පස් වැ සිටි ඒ දෙව්පිත් මට ගාථායෙන් කී:",
                "type": "paragraph"
            },
            {
                "text": "මේ ජෙතවනය ... තෙල මැ පරම කොට ඇති වන්නේ යැ’යි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, ඒ දෙවපුත්‍ර මෙය කී: ‘මා කී වදන් ශාස්තෲන් වහන්සේ අනුදත්හ’ යි. මා වැඳ පැදකුණු කොට එහි මැ අතුරුදහන් වී යයි.",
                "type": "paragraph"
            },
            {
                "text": "මෙසේ වදාළ කල්හි ආයුෂ්මත් අනඳ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට වහන්ස, හේ වනාහි ඒකාන්තයෙන් ඒ අනේපිඬු දෙව්පිත් වන්නේ ය. වහන්ස, අනේපිඬු ගැහැවි සැරියුත් තෙරණුවන් කෙරෙහි අතිශය පහන් වී යයි.",
                "type": "paragraph"
            },
            {
                "text": "සාධු ! සාධු !! ආනන්දය, ආනන්දය යම් පමණ තර්කයෙන් දත යුතු ද තොප විසින් ඒ දන්නාලද්දේ ය. ආනන්දය, හේ අනේපිඬු දෙව්පිත. අනෙකෙක් නො වේ යයි.",
                "type": "paragraph"
            },
            {
                "text": "ශාස්තෲන් වහන්සේ මෙය වදාළහ. සතුටුසිත් ඇති ආයුෂ්මත් අනඳ තෙරණුවෝ භාග්‍යවතුන් වහන්සේගේ භාෂිතය අභිනන්දනා කොළෝ",
                "type": "paragraph"
            },
            {
                "text": "පළමු වැනි අනාථපිණ්ඩිකොවාද සුත්‍ර යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "539"
            },
            {
                "type": "centered",
                "text": "3.5.2",
                "level": 1
            },
            {
                "type": "heading",
                "text": "ඡන්නොවාද සූත්‍රය",
                "level": 1
            },
            {
                "text": "මා විසින් මෙසේ අසන ලද: එක් කලෙක භාග්‍යවතුන් වහන්සේ රජගහනුවර සමීපයෙහි කලන්‍දකනිවාප නම් වේළුවනයෙහි වැඩවසනසේක. එසමයෙහි ආයුෂ්මත් සැරියුත් තෙරණුවෝ ද ආයුෂ්මත් මහාචුන්‍ද තෙරණුවෝ ද ආයුෂ්මත් ඡන්න තෙරණුවෝ ද ගිජුකුළු පව්වෙහි වාස කෙරෙති. එසමයෙහි ආයුෂ්මත් ඡන්න තෙරණුවෝ ආබාධික වැ දුඃඛිත වැ දැඩිගිලන් වූවාහු වෙති. එකල්හි ආයුෂ්මත් සැරියුත් තෙරණුවෝ සවස්කාලයෙහි සමවතින් නැගීසිටියාහු ආයුෂ්මත් මහාචුන්‍ද තෙරුන් කරා එළඹ ආයුෂ්මත් මහාචුන්‍ද තෙරුන්ට තෙල කීහ: ඇවැත්නි චුන්‍දයෙනි, යම්හ ආයුෂ්මත් ඡන්නතෙරුන් කරා ගිලන් බව පුළුවුස්නමෝ එළඹෙම්හ. ඇවැත්නි, එසේ යයි ආයුෂ්මත් මහාචුන්‍ද තෙරණුවෝ ආයුෂ්මත් සැරියුත් තෙරණුවන්ට පිළිවදන් දුන්හ.",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති ආයුෂ්මත් සැරියුත් තෙරණුවන් හා ආයුෂ්මත් මහාචුන්‍ද තෙරණුවෝ ඡන්න තෙරණුවන් කරා එළඹියහ. එළඹ ආයුෂ්මත් ඡන්න තෙරණුවන් සමග සතුටු වූහ. සතුටු වියයුතු වූ සිහි කළයුතු වූ කථා කොට නිමවා එකත්පස් වැ හුන්හ. එකත්පස් වැ හුන් ආයුෂ්මත් සැරියුත් තෙරණුවෝ ආයුෂ්මත් ඡන්න තෙරණුවනට තෙල කීහ: කිම ඇවත් ඡන්නයෙනි, තොප විසින් සිහිය හැකි ද? කිම යැපිය හැකි ද? කිම තොපගේ දුඃඛවෙදනාවෝ බැසයෙත් ද? නැඟ නො යෙත් ද? බැසුම් පැනේ ද? නැඟුම් නො පැනේ දැ? යි. ",
                "type": "paragraph"
            },
            {
                "text": "ඇවත් ශාරිපුත්‍රයෙනි, මා විසින් නො සැහිය හෙයි, යැපිය නො හෙයි, මාගේ දැඩි දුඃඛවෙදනාවෝ නැඟෙති, බැස නො යෙත්. නැඟූම පැනේ, බැස්ම නො පැනේ. ඇවත් ශාරිපුත්‍රයෙනි, යම්සේ බලවත් පුරුෂයෙක් තියුණු යහුලින් මුදුන මඩනේ වේ ද, ඇවත් ශාරිපුත්‍රයෙනි, මාගේ මුදුන අධිමාත්‍ර වාතයෝ වෙසෙසින් පෙළත්. ඇවත් ශාරිපුත්‍රයෙනි, මා විසින් නො සිහිය හැකි යැ, නො යැපිය හැකි යැ. මාගේ දැඩි දුඃඛවෙදනාවෝ නැඟෙති, නො බසිත්. නැඟූම් පැනේ, බැසුම් නො පැනේ.",
                "type": "paragraph"
            },
            {
                "text": "ඇවත් ශාරිපුත්‍රයෙනි, යම් පරිදි බලවත් පුරුෂයෙක් දළ වරබානින් හිසෙහි හිස්වෙළුම් දෙන්නේ වේ ද, ඇවත් ශාරිපුත්‍රයෙනි, එපරිදි මැ මාගේ හිස අධිමාත්‍ර වාතයෝ වෙසෙසින් සිඳිති. ඇවත් ශාරිපුත්‍රයෙනි, මා විසින් නො සිහිය හැකි යැ, නො යැපිය හැකි යැ. මාගේ දැඩි දුඃඛවෙදනාවෝ නැඟෙති, බැස නො යෙත්. නැඟූම් පැනෙයි, බැසුම් නො පැනේ.",
                "type": "paragraph"
            },
            {
                "text": "ඇවත් ශාරිපුත්‍රයෙනි, යම් පරිදි දක්ෂ ගොඝාතකයෙක් හෝ ගොඝාතක අතැවැසියෙක් හෝ තියුණු වූ ගෙරිකපන කැත්තෙන් කුස කපන්නේ වේ ද, ඇවත් ශාරිපුත්‍රයෙනි, එපරිදි මැ අධිමාත්‍ර වාතයෝ මාගේ කුස සිඳිත්. ඇවත් ශාරිපුත්‍රයෙනි, මා විසින් නො සිහිය හැකි යැ, නො යැපිය හැකි යැ. දැඩි දුඃඛවෙදනාවෝ නැඟෙති, බැස නොයෙත්. නැඟූම් පැනේ, බැසුම් නො පැනේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "541"
            },
            {
                "text": "ඇවත් ශාරිපුත්‍රයෙනි, යම් පරිදි බලවත් පුරුෂයෝ දෙදෙනෙක් ඉතා දුර්වල පුරුෂයකු වෙන වෙන අත් ගෙන අඞ්ගාරකර්ෂුයෙක ලා තවත් ද, තර කොට තවත් ද, ඇවත් ශාරිපුත්‍රයෙනි, එපරිදි මැ මාගේ කයෙහි අධිමාත්‍ර දාහයෙක. ඇවත් ශාරිපුත්‍රයෙනි, මා විසින් නො සිහිය හැකි යැ, නො යැපිය හැකි යැ. මාගේ දැඩි දුඃඛවෙදනාවෝ නැඟෙති, නො බසිත්. නැඟූම් පැනෙයි, බැසුම් නො පැනේ. ඇවත් ශාරිපුත්‍රයෙනි, ශස්ත්‍රයක් එළවා ලමි. ජීවිතය නො කැමැත්තෙමි.",
                "type": "paragraph"
            },
            {
                "text": "ආයුෂ්මත් ඡන්න තෙමේ ශස්ත්‍රාහරණ නො කෙරේවා, ආයුෂ්මත් ඡන්න තෙමේ යැපේවා. අපි ආයුෂ්මත් ඡන්න තෙරුන් යැපෙන්නවුන් කැමැත්තම්හ. ඉදින් ආයුෂ්මත් ඡන්න තෙරුන්ට සත්ප්‍රායභොජනයෝ නැත් නම් මම ආයුෂ්මත් ඡන්න තෙරුන්ට සත්ප්‍රායභොජන සොයාලමි. ඉදින් ආයුෂ්මත් ඡන්න තෙරුන්ට සත්ප්‍රායභෛෂජ්‍ය නැත් නම් මම ආයුෂ්මත් ආයුෂ්මත් ඡන්න තෙරුන්ට සත්ප්‍රායභෛෂජ්‍ය සොයාලමි. ඉදින් ආයුෂ්මත් ඡන්න තෙරුන්ට නිසි උපස්ථායකයෙක් නො වේ නම් මම ආයුෂ්මත් ඡන්න තෙරුන් උවටන් කෙරෙමි. ආයුෂ්මත් ඡන්න තෙරුන් ශස්ත්‍රාහරණ නො කෙරේවා. ආයුෂ්මත් ඡන්න තෙමේ යැපේවා. අපි යැපෙන ආයුෂ්මත් ඡන්නයන් කැමැත්තම්හ’ යි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවත් ශාරිපුත්‍රයෙනි, මට සත්ප්‍රායභොජනයෝ නැත්තාහු නො වෙති. මට සත්ප්‍රායභෛෂජ්‍යයෝ නැත්තාහු නො වෙති. මට ප්‍රතිරූප උපස්ථායකයෝ නැත්තාහු නො වෙත්. වැළිදු ඇවත් ශාරිපුත්‍ර තෙරණුවෙනි, මා විසින් දීර්ඝරාත්‍රියෙහි මනාපගතීන් මැ ශාස්තෘන් වහන්සේ ඇසුරු කරන ලදහ, අමනාපගතීන් නො වෙයි. ඇවත් ශාරිපුත්‍ර තෙරණුවෙනි, අමනාපගති තබා මනාපගතීන් මැ ශාස්තෘන් වහන්සේ ඇසුරු කරන්නේ යැ යන යම් කරුණෙක් වේ ද, තෙල කරුණ ශ්‍රාවකයක්හට නිසි වෙයි. ඡන්න භික්ෂු අනුපදව්‍ය (අප්‍රතිසන්ධික) කොට ශස්ත්‍රාභරණ කෙරේ යයි මෙසේ ඇවත් සැරියුත් තෙරණුවෙනි, තෙල කරුණ ධරන්නේ මැනැව.",
                "type": "paragraph"
            },
            {
                "text": "ඉදින් ආයුෂ්මත් ඡන්නයෝ ප්‍රශ්නව්‍යාකරණ සඳහා අවකාශකෙරෙත් නම් අපි ආයුෂ්මත් ඡන්නයන් අතින් කිසි දෙසක් පුළුවුසුම්හ. ඇවත් සැරියුත් තෙරණුවෙනි, පුළුවුස්නේ මැනැව, අසා දනුම්හ’ යි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවත් ඡන්නයෙනි, චක්ෂුස චක්ෂුර්විඥාන චක්ෂුර්විඥානයෙන් විඥාතව්‍යධර්ම ‘තෙල මා ගැත්තේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්මය’ යි නුවණින් දක්නෙහි ද? ඇවත් ඡන්නයෙනි, ශ්‍රොත ශ්‍රොතවිඥාන ... ඇවත් ඡන්නයෙනි, ඝ්‍රාණ ඝ්‍රාණවිඥාන ... ඇවත් ඡන්නයෙනි, ජිහ්වා ජිහ්වාවිඥාන ... ඇවත් ඡන්නයෙනි, කාය කායවිඥාන ... ඇවත් ඡන්නයෙනි, මනස මනොවිඥානයෙන් විඥාතව්‍යධර්ම ‘තෙල මා ගැත්තේ යැ, තෙලෙ මම් වෙමි. තෙලෙ මාගේ ආත්ම යයි නුවණින් දක්නෙහි දැ’ යි.",
                "type": "paragraph"
            },
            {
                "text": "ඇවත් සැරියුත් තෙරණුවෙනි, චක්ෂුස චක්ෂුර්විඥාන චක්ෂුර්විඥානයෙන් විඥාතව්‍යධර්ම ‘තෙල මා ගැත්තේ නො වෙයි, තෙලෙ මම් නො වෙමි. තෙලෙ මා ආත්ම නො වේ’ යයි නුවණින් දක්මි. ඇවත් සැරියුත් තෙරණුවෙනි, ශ්‍රොත ශ්‍රොතවිඥාන ... ඇවත් සැරියුත් තෙරණුවෙනි, ඝ්‍රාණ ඝ්‍රාණවිඥාන ... ඇවත් සැරියුත් තෙරණුවෙනි, ජිහ්වා ජිහ්වාවිඥාන ... ඇවත් සැරියුත් තෙරණුවෙනි, කාය කායවිඥාන ... ඇවත් සැරියුත් තෙරණුවෙනි, මනස මනොවිඥානයෙන් විඥාතව්‍යධර්ම ‘තෙල මා ගැත්තේ නො වෙයි, තෙලෙ මම් නො වෙමි. තෙලෙ මාගේ ආත්ම නො වේ’ යයි නුවණින් දක්මි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "543"
            },
            {
                "text": "ඇවත් ඡන්නයෙනි, චක්ෂුසෙහි චක්ෂුර්විඥානයෙහි චක්ෂුර්විඥානයෙන් විඥාතව්‍යධර්මයෙහි කුමක් දැක කුමක් අවබොධ කොට චක්ෂුස චක්ෂුර්විඥාන චක්ෂුර්විඥානයෙන් විඥාතව්‍යධර්ම යන මේ ‘තෙල මා ගැත්තේ නො වෙයි, තෙලෙ මම් නො වෙමි. තෙලෙ මා ආත්ම නො වේ යයි නුවණින් දක්නෙහි. ඇවත් ඡන්නයෙනි, ශ්‍රොතයෙහි ශ්‍රොතවිඥානයෙහි ... ඇවත් ඡන්නයෙනි, ඝ්‍රාණයෙහි ඝ්‍රාණවිඥානයෙහි ... ඇවත් ඡන්නයෙනි, ජිහ්වායෙහි ජිහ්වාවිඥානයෙහි ... ඇවත් ඡන්නයෙනි, කයෙහි කායවිඥානයෙහි ... ඇවත් ඡන්නයෙනි, මනස්හි මනොවිඥානයෙහි මනොවිඥානයෙන් විඥාතව්‍යධර්මයෙහි කුමක් අවබොධ කොට මනස මනොවිඥාන මනොවිඥානයෙන් විඥාතව්‍යධර්ම යන මේ තෙල මා ගැත්තේ නො වෙයි, තෙලෙ මම් නො වෙමි. තෙලෙ මාගේ ආත්ම නො වේ’ යයි නුවණින් දක්නෙහි?",
                "type": "paragraph"
            },
            {
                "text": "ඇවත් සැරියුත් තෙරණුවෙනි, චක්ෂුසෙහි චක්ෂුර්විඥානයෙහි චක්ෂුර්විඥානයෙන් විඥාතව්‍යධර්මයෙහි නිරොධය දැක නිරොධය අවබොධ කොට චක්ෂු චක්ෂුර්විඥාන චක්ෂුර්විඥානයෙන් විඥාතව්‍යධර්ම යන මේ ‘තෙල මා ගැත්තේ නො වෙයි, තෙලෙ මම් නො වෙමි. තෙලෙ මා ආත්ම නො වේ’ යයි නුවණින් දක්මි. ඇවත් සැරියුත් තෙරණුවෙනි, ශ්‍රොතයෙහි ශ්‍රොතවිඥානයෙහි ... ඇවත් සැරියුත් තෙරණුවෙනි, ඝ්‍රාණයෙහි ඝ්‍රාණවිඥානයෙහි ... ඇවත් සැරියුත් තෙරණුවෙනි, ජිහ්වායෙහි ජිහ්වාවිඥානයෙහි ... ඇවත් සැරියුත් තෙරණුවෙනි, කයෙහි කායවිඥානයෙහි ... ඇවත් සැරියුත් තෙරණුවෙනි, මනස්හි මනොවිඥානයෙහි මනොවිඥානයෙන් විඥාතව්‍යධර්මයෙහි නිරොධය දැක, නිරොධය අවබොධ කොට මනස මනොවිඥාන මනොවිඥානයෙන් විඥාතව්‍යධර්ම යන මේ ‘තෙල මා ගැත්තේ නො වෙයි, තෙලෙ මම් නො වෙමි, තෙලෙ මාගේ ආත්ම නො වේ යයි නුවණින් දක්මි’ යි කී.",
                "type": "paragraph"
            },
            {
                "text": "මෙසේ කී කල්හි ආයුෂ්මත් මහාචුන්‍ද තෙරණුවෝ ආයුෂ්මත් ඡන්න තෙරුන්ට තෙල කීහ: ‘ඇවත් ඡන්නයෙනි, ඒ මාරණාන්තික වෙදනා ඇතියෙන් ඒ භාග්‍යවතුන් වහන්සේගේ මේ අනුශිෂ්ටිය ද නිරතුරු සිහි කරන්නේ මැනැව. තෘෂ්ණාදීන් නිඃශ්‍රිතයාහට ක්ලෙශකම්පනය වෙයි, අනිඃශ්‍රිතයා හට චලිතයෙක් නැත. චලිතය නැති කල්හි කෙලෙස් සන්හිඳුම් වෙයි. සන්හිඳුම් ඇතිවත් ම තෘෂ්ණා නො වෙයි. තෘෂ්ණා නැතිවත් ම (පිලිසඳ විසින්) ආගමන හා (ච්‍යුති විසින්) ගමන නො වෙයි. ආගති හා ගති නැති වත් ම ච්‍යුති උපපාත දෙක නො වෙයි. ච්‍යුති උපපාත දෙක නැති වත් ම මෙලොවැ හෝ නො වෙයි. පරලොවැ හෝ නො වෙයි. දෙලොව්හි මැ නො වෙයි. දුඃඛයාගේ තෙලෙ මැ කෙළවර වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "එසඳ ආයුෂ්මත් සැරියුත් තෙරණුවෝ ද ආයුෂ්මත් මහාචුන්දතෙරණුවෝ ද ආයුෂ්මත් ඡන්න තෙරණුවන්ට මේ අවවාදයෙන් අවවාදදී හුනස්නෙන් නැඟී වැඩියෝ. එසඳ ආයුෂ්මත් ඡන්න තෙරහු ආයුෂ්මත් සැරියුත් තෙරණුවන් හා ආයුෂ්මත් මහාචුන්ද තෙරණුවන් වඩනා හා මැ ශාස්ත්‍රාහරණ කළෝ. ඉක්බිති ආයුෂ්මත් සැරියුත් තෙරණුවෝ භාග්‍යවතුන් වහන්සේ කරා එළැඹියහ. එළැඹ භාග්‍යවතුන් වහන්සේ සකසා වැඳ එකත්පස් වැ හුන්හ. එකත්පස් වැ හුන් ආයුෂ්මත් සැරියුත් තෙරණුවෝ භාග්‍යවතුන් වහන්සේට තෙල සැලකළහ. “වහන්ස, ආයුෂ්මත් ඡන්න තෙරුන් විසින් ශාස්ත්‍රාහරණ කරන ලද”, ඔහුගේ ගති කවර? පරලොව කවරෙ’ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "545"
            },
            {
                "text": "ශාරිපුත්‍රය, ඡන්න මහණහු විසින් තොප හමියෙහි මැ අනුපවද්‍යතා පවසන ලද නො? යි.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, පුබ්බජිර නම් වැදැගමක් ඇත. එහි ආයුෂ්මත් ඡන්න තෙරුන්ගේ මිත්‍ර කුලයන් හා සුහද කුලයන් හා එළැඹිය යුතු කුලයෝ ද ඇත. ශාරිපුත්‍රය, ඡන්න මහණහුගේ තෙල මිත්‍රකුලයෝ ද සුහද කුලයෝ ද ‘උපවජ්ජ’ (එළැඹියැ යුතු) කුලයෝ ද වෙති. ශාරිපුත්‍රය, මම මෙතෙකින් සඋපවජ්ජහ’ යි නො කියමි. ශාරිපුත්‍රය, යමෙක් මේ කය හරණේ වේ ද, අන් කයකුදු ගන්නේ වේ ද, මම ඔහු සඋපවජ්ජහ’ යි කියමි. ඒ ඡන්න හික්ෂූහට නැත. (එහෙයින්) අනුපවජ්ජ වූ ඡන්න මහණ ශාස්ත්‍රාහරණ කෙළේ යයි.",
                "type": "paragraph"
            },
            {
                "text": "භාග්‍යවතුන් වහන්සේ මේ වදාළ සේක. ප්‍රීතිසෞමනස්‍යයන් විසින් ගත් සිත් ඇති ආයුෂ්මත් ශාරිපුත්‍ර තෙරණුවෝ භාග්‍යවතුන් වහන්සේගේ භාෂිතය අභිනන්දන කළෝ.",
                "type": "paragraph"
            },
            {
                "text": "දෙවැනි ඡන්නොවාද සූත්‍ර යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "547"
            },
            {
                "type": "centered",
                "text": "3.5.3",
                "level": 1
            },
            {
                "type": "heading",
                "text": "පුණ්ණෝවාද සූත්‍රය",
                "level": 1
            },
            {
                "text": "මා විසින් මෙසේ අසන ලද: එක් කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයෙහි ජේතවන නම් අනේවඩු මහසිටුහුගේ අරම්හි වැඩවාස කෙරෙති. එසඳ ආයුෂ්මත් පුණ්ණ තෙරණුවෝ සවස් වේලෙහි පිළිසලනින් නැංගාහු භාග්‍යවතුන් වහන්සේ කරා එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ සකසා වැඳ එකත්පස් වැ හුන්හු. එකත්පස් වැ හුන් ආයුෂ්මත් පුණ්ණ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට තෙල සැලකොළෝ:",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, ‘මම භාග්‍යවතුන් වහන්සේගේ යම් දහමක් අසා එකලා වූයෙම් ගණයා කෙරෙන් වෙන් වූයෙම් නො පමා වූයෙම් කෙලෙස් තවන වැර ඇතියෙම් නිවනට මෙහෙයූ සිත් ඇතියෙම් වාස කෙරෙම් ද, භාග්‍යවතුන් වහන්සේ මට එබඳු සංක්ෂීප්ත අවවාදයෙකින් අවවාද කරනසේක්වා’ යි අයැදසිටුම්හ’යි.",
                "type": "paragraph"
            },
            {
                "text": "‘එසේ වී නම් පුණ්ණය, අසව, මනා කොට මෙනෙහි කරව, කියම්හ’ යි වදාළහ.",
                "type": "paragraph"
            },
            {
                "text": "‘වහන්ස, එසේ යැ’ යි ආයුෂ්මත් පුණ්ණ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හ. භාග්‍යවතුන් වහන්සේ තෙල වදාළහ:",
                "type": "paragraph"
            },
            {
                "text": "පුණ්ණය, ඉෂ්ට වූ කාන්ත වූ මනාප වූ ප්‍රිය ස්වරූප වූ කාමොපසංහිත වූ සිත් ඇලවීමට නිසි චක්ෂුර්විඥෙය රූපායතන කෙනෙක් ඇත. ඉදින් මහණ ඒ රූපායතන අභිනන්දන කෙරේ ද, සිතින් ගෙන තෘෂ්ණා වශයෙන් බෙණේ ද, ගැලගෙන සිටී ද, ඒ රූපායතන අභිනන්දන කරන තෘෂ්ණා වශයෙන් බණන ගැලගෙන සිටුනා ඒ මහණහට තෘෂ්ණාව උපදී. තෘෂ්ණා සමුදය හේතුයෙන් පුණ්ණය, දුඃඛසමුදය වේ යයි කියම්හ.",
                "type": "paragraph"
            },
            {
                "text": "පුණ්ණය, ශ්‍රොතවිඥෙය ශබ්දායතන කෙනෙක් ... ඝ්‍රාණවිඥෙය ගන්ධායතන කෙනෙක් ... ජිහ්වාවිඥෙය රසායතන කෙනෙක් ... කායවිඥෙය ස්ප්‍රෂ්ටව්‍යායතන කෙනෙක් ... ඉෂ්ට වූ කාන්ත වූ මනාප වූ ප්‍රියස්වරූප වූ කාමොපසංහිත වූ රඤ්ජනයට නිසි වූ මනොවිඥෙය ධර්මායතන කෙනෙක් ඇත. ඉදින්, මහණ ඒ ධර්මායතන අභිනන්දන කෙරේ ද, තෘෂ්ණා වශයෙන් බෙණේ ද, ගැලගෙන සිටුනේ වේ ද, එය අභිනන්දන කරන තෘෂ්ණා වශයෙන් බණන ගැලගෙන සිටුනා ඔහුට තෘෂ්ණා උපදී. තෘෂ්ණාසමුදය හේතුයෙන් දුඃඛසමුදය වේ යයි කියම්හ.",
                "type": "paragraph"
            },
            {
                "text": "පුණ්ණය, ඉෂ්ට වූ කාන්ත වූ මනාප වූ ප්‍රියස්වරූප වූ කාමොපසංහිත වූ රඤ්ජනාර්හ වූ චක්ෂුර්විඥෙය රූපායතන කෙනෙක් ඇත. ඉදින් මහණෙ රූපායතන අභිනන්දන නො කෙරේ ද, තෘෂ්ණා විසින් නො බෙණේ ද, ගැලගෙන නො සිටුනේ වේ ද, ඒ රූපායතන අභිනන්දන නො කරන තෘෂ්ණා හෙයින් නො බණන ගැලගෙන නො සිටුනා ඒ මහණහට තෘෂ්ණා නිරුද්ධ වෙයි. තෘෂ්ණානිරොධ හේතුයෙන් පුණ්ණය, දුඃඛනිරොධ වේ යයි කියම්හ.",
                "type": "paragraph"
            },
            {
                "text": "පුණ්ණය, ශ්‍රොතවිඥෙය ශබ්දායතන කෙනෙක් ... ඝ්‍රාණවිඥෙය ගන්ධායතන කෙනෙක් ... ජිහ්වාවිඥෙය රසායතන කෙනෙක් ... කායවිඥෙය ස්ප්‍රෂ්ටව්‍යායතන කෙනෙක් ... ඉෂ්ට වූ කාන්ත වූ මනාප වූ ප්‍රියස්වරූප වූ කාමොපසංහිත වූ රඤ්ජනයට නිසි වූ මනොවිඥෙය ධර්මායතන කෙනෙක් ඇත. ඉදින් මහණ ඒ ධර්මායතන අභිනන්දන නො කෙරේ ද, තෘෂ්ණා හෙයින් නො බෙණේ ද, ගැලගෙන නො සිටුනේ වේ ද, ඒ ධර්මායතන අභිනන්දන නො කරන තෘෂ්ණා හෙයින් නො බණන ගැලගෙන නො සිටුනා ඔහුගේ තෘෂ්ණා නිරුද්ධ වෙයි, තෘෂ්ණා නිරොධ හේතුයෙන් පුණ්ණය, දුඃඛනිරොධ වේ යයි කියම්හ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "549"
            },
            {
                "text": "පුණ්ණය, මා විසින් මේ සංක්ෂිප්ත වූ අවවාදයෙන් අවවාද කරන ලද තෝ කිනම් දනවියෙක වාස කෙරෙහි? වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් මේ සංක්ෂිප්ත අවවාදයෙන් මම ඔවා දෙනලදිමි. සුනාපරන්ත නම් දනවියෙක් ඇත, එහි මම වාස කෙරෙමි.",
                "type": "paragraph"
            },
            {
                "text": "පුණ්ණය, සුනාපරන්ත දනවුවැසි මිනිස්හු චණ්ඩයහ. පුණ්ණය, සුනාපරන්ත දනවුවැසි මිනිස්හු පරුෂයහ. පුණ්ණය, ඉදින් සුනාපරන්ත දනවුවැසි මිනිස්හු තට ආක්‍රොශ කෙරෙත් නම්, නින්දා බස් බෙණෙ නම් පුණ්ණය, එහිලා තට කෙබඳු සිතෙක් වේ යැ?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, ඉදින් සුනාපරන්ත දනව්වැසි මිනිස්හු මට ආක්‍රොශ කෙරෙත් නම් නින්දා බෙණෙත් නම් එහිලා මට මෙබඳු සිත් වෙයි: සුනාපරන්ත වැසි මේ මිනිස්හු ඒකාන්තයෙන් භද්‍රයහ, සුනාපරන්ත වැසි මේ මිනිස්හු ඒකාන්තයෙන් භද්‍රයහ. යම් හෙයෙකින් මොහු මට අතින් පහර නො දෙත් ද, එහෙයිනි. භාග්‍යවතුන් වහන්ස, මෙහිලා මෙසේ සිත් වෙයි, සුගතයන් වහන්ස, මෙහිලා මෙසේ සිත් වෙතියි සැල කොළෝ.",
                "type": "paragraph"
            },
            {
                "text": "ඉදින් පුණ්ණය, තට සුනාපරන්ත වැසි මිනිස්හු අතින් පහර දෙත් නම් එහිලා පුණ්ණය තට කෙසේ සිත් වේ යැ? යි.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, ඉදින් සුනාපරන්ත දනව්වැසි මිනිස්හු මට අතින් පහර දෙත් නම් එහිලා මට මෙබඳු සිත් වෙයි: මේ සුනාපරන්ත වැසි මිනිස්හු ඒකාන්තයෙන් භද්‍රයහ. මේ සුනාපරන්ත වැසි මිනිස්හු ඒකාන්තයෙන් භද්‍රයහ. යම් හෙයෙකින් ඔහු මට කැටින් පහර නො දෙත් ද, එහෙයිනි. භාග්‍යවතුන් වහන්ස, මෙහිලා මෙසේ සිත් වෙයි. සුගතයන් වහන්ස, මෙහිලා මෙසේ සිත් වෙති’ යි කී.",
                "type": "paragraph"
            },
            {
                "text": "ඉදින් පුණ්ණය, සුනාපරන්ත වැසි මිනිස්හු තට කැටින් පහර දෙත් නම් පුණ්ණය එහිලා තට කෙසේ සිත් වේ යැ? යි. වහන්ස, ඉදින් සුනාපරන්ත වැසි මිනිස්හු මට කැටින් පහර දෙත් නම් එහිලා මට මෙසේ සිත් වෙයි: මේ සුනාපරන්ත වැසි මිනිස්හු ඒකාන්තයෙන් භද්‍රයහ. මේ සුනාපරන්ත වැසි මිනිස්හු ඒකාන්තයෙන් භද්‍රයහ. යම් හෙයෙකින් මොහු මට දඬින් පහර නො දෙත් ද, එහෙයිනි. භාග්‍යවතුන් වහන්ස, මෙහිලා මෙසේ සිත් වෙයි. සුගතයන් වහන්ස, මෙහිලා මෙසේ සිත් වෙති’ යි කී.",
                "type": "paragraph"
            },
            {
                "text": "ඉදින් පුණ්ණය, තට සුනාපරන්ත වැසි මිනිස්හු දඬින් පහර දෙත් නම් පුණ්ණය එහිලා තට කෙසේ සිත් වේ යැ? යි. වහන්ස, ඉදින් මට සුනාපරන්ත වැසි මිනිස්හු දඬින් පහර දෙත් නම් එහිලා මට මෙසේ සිත් වෙයි. මේ සුනාපරන්ත වැසි මිනිස්හු ඒකාන්තයෙන් භද්‍රයහ, මේ සුනාපරන්ත වැසි මිනිස්හු ඒකාන්තයෙන් භද්‍රයහ. යම් හෙයෙකින් ඔහු මට සැතින් පහර නො දෙත් ද, එහෙයිනි. භාග්‍යවතුන් වහන්ස, මෙහිලා මෙසේ සිත් වෙයි. සුගතයන් වහන්ස, මෙහිලා මෙසේ සිත් වෙති’ යි කී.",
                "type": "paragraph"
            },
            {
                "text": "ඉදින් පුණ්ණය, තට සුනාපරන්ත වැසි මිනිස්හු සැතින් පහර දෙත් නම් එහිලා පුණ්ණය, තට කෙසේ සිත් වේ යැ? යි. වහන්ස, ඉදින් මට සුනාපරන්ත වැසි මිනිස්හු සැතින් පහර දෙත් නම් එහිලා මට මෙසේ සිත් වෙයි. මේ සුනාපරන්ත වැසි මිනිස්හු ඒකාන්තයෙන් භද්‍රයහ, මේ සුනාපරන්ත වැසි මිනිස්හු ඒකාන්තයෙන් භද්‍රයහ. යම් හෙයෙකින් තියුණු සැතින් මා දිවියෙන් තොර නො කෙරෙත් ද, එහෙයිනි. භාග්‍යවතුන් වහන්ස, මෙහිලා මෙසේ සිත් වෙයි. සුගතයන් වහන්ස, මෙහිලා මෙසේ සිත් වෙති’ යි කී.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "551"
            },
            {
                "text": "ඉදින් පුණ්ණය, සුනාපරන්ත වැසි මිනිස්හු තියුණු සැතින් තා දිවියෙන් තොර කෙරෙත් නම් පුණ්ණය, එහිලා තට කෙසේ සිත් වේ යැ? යි. වහන්ස, ඉදින් සුනාපරන්ත වැසි මිනිස්හු තියුණු සැතින් දිවියෙන් තොර කෙරෙත් නම් එහිලා මට මෙසේ සිත් වෙයි: ‘භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක කෙනෙක් කයිනුදු දිවියෙනුදු පෙළෙන්නාහු ලජ්ජා කරන්නාහු පිළිකුල් කරන්නාහු ශස්ත්‍රහාරකයකු සොයන්නාහු ඇත. මා විසින් නො සොයනලද මැ ඒ ශස්ත්‍රහාරකයා ලැබිණැ’ යි. භාග්‍යවතුන් වහන්ස, මෙහිලා මෙසේ සිත් වෙයි. සුගතයන් වහන්ස, මෙහිලා මෙසේ සිත් වෙති’ යි කී.",
                "type": "paragraph"
            },
            {
                "text": "මැනැව මැනැව පුණ්ණය, මේ දම උපසම දෙකින් සමන්වාගත වැ සුනාපරන්ත දනවියෙහි වාස කරන්නට තෝ හැක්කෙහි පුණ්ණය, යි. දැන් එයට කල් දන පුණ්ණය, යි වදාළෝ.",
                "type": "paragraph"
            },
            {
                "text": "එසඳ ආයුෂ්මත් පුණ්ණ තෙරණුවෝ භාග්‍යවතුන් වහන්සේගේ භාෂිතය සතුටින් පිළිගෙන අනුමෝදන් වැ හුනස්නෙන් නැඟී භාග්‍යවතුන් වහන්සේ සකසා වැඳ පැදකුණු කොට සෙනසුන් සඟවා තබා පාසිවුරු ගෙන් සුනාපරන්ත දනවු කරා සැරිසරා ගියහ. පිළිවෙළින් සැරිසරන්නාහු සුනාපරන්ත ජනපදය කරා ගියෝ. එසඳ ආයුෂ්මත් පුණ්ණ තෙරණුවෝ සුනාපරන්ත දනවියෙහි වාස කෙරෙති.",
                "type": "paragraph"
            },
            {
                "text": "එකල ආයුෂ්මත් පුණ්ණ තෙරණුවෝ ඒ අතුරුවසෙහි පන්සියක් පමණ උපාසකයන් ඇති කොළෝ. ඒ අතුරුවසෙහි මැ පන්සියක් පමණ උපාසකාවන් ඇති කොළෝ. ඒ අතුරුවසෙහි මැ ත්‍රිවිද්‍යා පසක් කොළෝ. ඉක්බිති ආයුෂ්මත් පුණ්ණ තෙරණුවෝ පසු කලෙක පිරිනිවියහ. ඉක්බිති බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේ කරා එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ සකසා වැඳ එකත්පස් වැ හුන්හ. එකත්පස් වැ හුන් ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට තෙල සැල කොළෝ: වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්ත අවවාදයෙන් ඔවා දෙනලද යම් පුණ්ණ නම් කුලපුත්‍රයෙක් වී ද, හේ කලුරිය කෙළේ. ඔහුගේ ගති කවර? පරලෝ කවරෙ? යි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, පුණු කුලපුත් පණ්ඩිත වෙයි. ධර්මානුධර්මයෙහි පිළිපන්නේ ය. ධර්ම හේතුයෙන් මා නොවෙහෙසී. මහණෙනි, පුණ්ණ කුලපුත් පිනිවියේ යැ.",
                "type": "paragraph"
            },
            {
                "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළසේක. සතුටු සිත් ඇති ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ භාෂිතය සතුටින් පිළිගත්හු.",
                "type": "paragraph"
            },
            {
                "text": "තුන් වැනි පුණ්ණෝවාද සූත්‍ර යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "553"
            },
            {
                "type": "centered",
                "text": "3.5.4",
                "level": 1
            },
            {
                "type": "heading",
                "text": "නන්දකොවාද සූත්‍රය",
                "level": 1
            },
            {
                "text": "මා විසින් මෙසේ අසන ලද: එක් කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර අනේපිඬු මහසිටුහුගේ දෙව්රම් වෙහෙර වැඩවාස කෙරෙති. එකල ගොයුම්ගොත් මහාප්‍රජාපතී මෙහෙණ පන්සියක් පමණ මෙහෙණන් හා සමග භාග්‍යවතුන් වහන්සේ කරා එළඹියා. එළඹ භාග්‍යවතුන් වහන්සේ සකසා වැඳ එකත්පස් වැ සිටගතු. එකත්පස් වැ සිටි ගොයුම්ගොත් මහාප්‍රජාපතී මෙහෙණ භාග්‍යවතුන් වහන්සේට තෙල සැලකළා: ‘වහන්ස, භාග්‍යවතුන් වහන්සේ මෙහෙණනට ඕවා දෙනසේක්වා, වහන්ස භාග්‍යවතුන් වහන්සේ මෙහෙණනට අනුශාසනා කරනසේක්වා. වහන්ස, භාග්‍යවතුන් වහන්සේ මෙහෙණනට ධර්ම කථා කරන සේක්වා’ යි.",
                "type": "paragraph"
            },
            {
                "text": "එසමයෙහි ස්ථවිර භික්ෂූහු මෙහෙණනට වාර වශයෙන් ඔවා දෙති. ආයුෂ්මත් නන්දක තෙරණුවෝ මෙහෙණනට, වාර වශයෙන් ඔවා දෙන්නට නො කැමැති වෙති. ඉක්බිති භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් අනඳ තෙරණුවන් ඇමැතූසේක: ‘ආනන්දය, මෙහෙණනට වාර වශයෙන් ඔවා දෙන්නට අද කවරහුගේ වාරය වේ දැ?’ යි.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, මෙහෙණනට වාර වශයෙන් ඔවා දෙන්නට නන්දක තෙරණුවනට වාරය වෙයි. වහන්ස, මේ ආයුෂ්මත් නන්දක තෙරණුවෝ මෙහෙණනට වාර වශයෙන් ඔවා දෙන්නට නො කැමැතියහ.",
                "type": "paragraph"
            },
            {
                "text": "එසඳ භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් නන්දක තෙරණුවන් ඇමතූසේක: ‘නන්දකය, මෙහෙණනට ඔවා දෙව. නන්දකය, මෙහෙණනට අනුශාසනා කරව. බ්‍රාහ්මණය, තෝ මෙහෙණනට ධර්මකථා කරව’ යි.",
                "type": "paragraph"
            },
            {
                "text": "‘වහන්ස, එසේ යැ’ යි ඒ ආයුෂ්මත් නන්දක තෙරණුවෝ භාග්‍යවතුන් වහන්සේට පිළිවදන් දී පෙරවරු හැඳ පෙරෙවැ පාසිවුරු ගෙන සැවැතට පිඬු පිණිස පිවිසියහ. සැවැත්හි පිඬු පිණිස හැසිර පසුබත පිණ්ඩපාතයෙන් වැළැක්කාහු තමහට දෙවැන්නකු ඇති වැ රාජකාරාමය කරා එළඹියහ. ඒ මෙහෙණහු දුර දී මැ ආයුෂ්මත් නන්දක තෙරණුවන් එනුවන් දුටහ. දැක අසුන් පැන්වූහු. පා දෝනා දිය එළවූහු. ආයුෂ්මත් නන්දක තෙරණුවෝ පැන්වූ අස්නෙහි හුන්හ. හිඳ පාද ප්‍රක්ෂාලනා කොළෝ. ඒ මෙහෙණහු ද ආයුෂ්මත් නන්දක තෙරණුවන් සකසා වැඳ එකත්පස් වැ හුන්හ. එකත්පස් වැ හුන් මෙහෙණනට ආයුෂ්මත් නන්දක තෙරණුවෝ තෙල කීහ: බුහුනැණියෙනි, පිළිවිස කරන කථායෙක් ඇත. එහි දී වටහා දන්නවුන් විසින් ‘දනුම්හ’ යි කියයුතු වෙයි. වටහා නො දන්නවුන් විසින් ‘නො දනුම්හ’ යි කියයුතු වෙයි. යමක්හට සැකයෙක් හෝ විමතියෙක් හෝ වේ ද එහි දී මම් මැ පිළිවිස්ස යුතුයෙම් වෙමි. (කෙසේ යැ?) ‘වහන්ස, මේ කෙසේ යැ? මේ වචනයාගේ අර්ථ කවරේ යැ?’ යි.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, ඇපි මෙතෙකිනුදු ආර්‍ය්‍ය වූ නන්දක තෙරණුවනට සතුටු සිතැත්තමෝ වම්හ. අභිරද්ධයම්හ. යම් හෙයෙකින් ආර්‍ය්‍ය වූ නන්දක තෙරණුවෝ අප පවරත් ද, එහෙයිනි.",
                "type": "paragraph"
            },
            {
                "text": "බුහුනැණියෙනි, ඒ කෙසේ හඟනාව. චක්ෂුස නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "555"
            },
            {
                "text": "යමෙක් අනිත්‍ය වේ නම්, ඒ දුඃඛ හෝ සුඛ හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුඃඛ යැ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය දුඃඛ විපරිණාමධර්ම වේ ද, ඒ ‘තෙල මා ගැත්තේ යැ, තෙලෙ මම වෙමි, තෙල මාගේ ආත්ම ය’යි දක්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො නිසි වේ මැ යැ.",
                "type": "paragraph"
            },
            {
                "text": "බුහුනැණියෙනි, ඒ කෙසේ හඟනාව. ශ්‍රොතය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ ...",
                "type": "paragraph"
            },
            {
                "text": "ඝ්‍රාණය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ ...",
                "type": "paragraph"
            },
            {
                "text": "ජිහ්වා නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ ...",
                "type": "paragraph"
            },
            {
                "text": "කය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ ...",
                "type": "paragraph"
            },
            {
                "text": "මනස නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ ...",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය වේ නම් ඒ දුඃඛ හෝ සුඛ හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුඃඛ යැ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය දුඃඛ විපරිණාමධර්ම වේ ද, ඒ ‘තෙල මා ගැත්තේ යැ, තෙලෙ මම වෙමි, තෙල මාගේ ආත්ම ය’යි දක්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො නිසි වේ මැ යැ. ඒ කවර හෙයින යත්: වහන්ස, තෙල කරුණ පළමු මැ අප විසින් ඇති තතු සම්‍යක් ප්‍රඥායෙන්, මොනොවට දක්නා ලදි: ‘මෙ කරුණිනුදු මේ අධ්‍යාත්මික ෂඩායතනයෝ අනිත්‍යයහ’ කියා ය.",
                "type": "paragraph"
            },
            {
                "text": "මැනව මැනව බුහුනැණියෙනි. බුහුනැණියෙනි, තෙල යථාභූතය සම්‍යක් ප්‍රඥායෙන් දක්නා ආර්‍ය්‍යශ්‍රාවකයක් හට තෙල සිත් මෙසේ වේ මැ යි. බුහුනැණියෙනි, ඒ කෙසේ හඟනාව රූපායතනයෝ නිත්‍ය හෝ අනිත්‍ය හෝ වෙත් ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍යයහ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය වේ නම්, ඒ දුඃඛ හෝ සුඛ හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුඃඛ යැ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය දුඃඛ විපරිණාමධර්ම වේ නම් එය ‘තෙල මා ගැත්තේ යැ, තෙලෙ මම වෙමි, තෙල මාගේ ආත්ම ය’යි දක්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො නිසි වේ මැ යැ.",
                "type": "paragraph"
            },
            {
                "text": "බුහුනැණියෙනි, ඒ කෙසේ හඟනාව. ශබ්දායතනයෝ නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍යයහ ...",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "557"
            },
            {
                "text": "ගන්ධායතනයෝ නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍යයහ ...",
                "type": "paragraph"
            },
            {
                "text": "රසායතනයෝ නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍යයහ ...",
                "type": "paragraph"
            },
            {
                "text": "ස්ප්‍රෂ්ටව්‍යායතනයෝ නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍යයහ ...",
                "type": "paragraph"
            },
            {
                "text": "ධර්මායතනයෝ නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍යයහ ...",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය වේ නම්, ඒ දුඃඛ හෝ සුඛ හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුඃඛ යැ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය දුඃඛ විපරිණාමධර්ම වේ නම් එය ‘තෙල මා ගැත්තේ යැ, තෙලෙ මම වෙමි, තෙල මාගේ ආත්ම යැ’යි නුවණින් දක්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො නිසි වේ මැ යැ. ඒ කවර හෙයින යත්: වහන්ස, අප විසින් තෙල යථාභූතය පළමු වැ සම්‍යක් ප්‍රඥායෙන්, මොනවට දක්නා ලදි: ‘මෙ හෙතුයෙනුදු මේ බාහිර ෂඩායතනයෝ අනිත්‍යයහ’යි කියා යි.",
                "type": "paragraph"
            },
            {
                "text": "මැනව මැනව බුහුනැණියෙනි. මෙසේ බුහුනැණියෙනි, යථාභූතය සම්‍යක් ප්‍රඥායෙන් දක්නා ආර්‍ය්‍යශ්‍රාවකයක් හට තෙල සිත් වෙයි. ඒ කෙසේ හඟනාව බුහුනැණියෙනි, චක්ෂුර්විඥානය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය වේ නම්, ඒ දුඃඛ හෝ සුඛ හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුඃඛ යැ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය දුඃඛ විපරිණාමධර්ම වේ නම් ‘තෙල මා ගැත්තේ යැ, තෙලෙ මම වෙමි, තෙල මාගේ ආත්ම ය’යි නුවණින් දක්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො නිසි වේ මැ යැ. ",
                "type": "paragraph"
            },
            {
                "text": "ඒ කෙසේ හඟනාව බුහුනැණියෙනි, ශ්‍රොතවිඥානය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ.",
                "type": "paragraph"
            },
            {
                "text": "ඝ්‍රාණවිඥානය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ ...",
                "type": "paragraph"
            },
            {
                "text": "ජිහ්වාවිඥානය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ ...",
                "type": "paragraph"
            },
            {
                "text": "කායවිඥානය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ ...",
                "type": "paragraph"
            },
            {
                "text": "මනොවිඥානය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය වේ නම්, ඒ දුඃඛ හෝ සුඛ හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුඃඛ යැ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "559"
            },
            {
                "text": "යමෙක් අනිත්‍ය දුඃඛ විපරිණාමධර්ම වේ නම් ‘තෙල මා ගැත්තේ යැ, තෙල මම වෙමි, තෙල මාගේ ආත්ම යැ’ යි එය නුවණින් දක්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො නිසි වේ මැ යැ. ඒ කවර හෙයින යත්: වහන්ස, අප විසින් පළමු ව තෙල යථාභූතය සම්‍යක් ප්‍රඥායෙන් මොනොවට දක්නා ලදි: ‘මේ හෙතුයෙනුදු මේ සවැදෑරුම් විඥානකායයෝ අනිත්‍යයහ’ කියා යි.",
                "type": "paragraph"
            },
            {
                "text": "මැනව මැනව බුහුනැණියෙනි. මෙසේ බුහුනැණියෙනි, තෙල යථාභූතය සම්‍යක්ප්‍රඥායෙන් දක්නා ආර්‍ය්‍යශ්‍රාවකයක් හට තෙල සිත් වේ මැ යි.",
                "type": "paragraph"
            },
            {
                "text": "බුහුනැණියෙනි, යම් පරිදි දැල්වෙන තෙල් පහනක්හුගේ තෙල ද අනිත්‍ය වේ ද පෙරැළෙන සැහැවි ඇති වේ ද, වැටි ද අනිත්‍ය විපරිණාමධර්ම වේ ද, සිළු ද අනිත්‍ය විපරිණාම ධර්ම වේ ද, එලි ද අනිත්‍ය විපරිණාමධර්ම වේ ද, බුහුනැණියෙනි, යමෙක් ‘මේ දැල්වෙන තෙල් පහනෙහි තෙල ද අනිත්‍ය යැ විපරිණාම ධර්ම යැ, වැටි ද අනිත්‍ය යැ විපරිණාම ධර්ම යැ, සිළු ද අනිත්‍ය යැ විපරිණාම ධර්ම යැ, මේ ප්‍රදීපයාගේ යම් එළියෙක් ඇද්ද ඒ නිත්‍ය යැ ධ්‍රැව යැ ශාශ්වත යැ අවිපරිණාමධර්ම යැ’ යි මෙසේ කියා නම් බුහුනැණියෙනි, ඒ බණන්නා මැනැවක් බෙණේ දැ? යි.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල මැනැවෙක් නො වේ මැ යැ. ඒ කවර හෙයින යත්: මේ දැල්වෙන තෛල ප්‍රදීපයාගේ තෙල ද අනිත්‍ය යැ විපරිණාමධර්ම යැ, වැටි ද අනිත්‍ය යැ විපරිණාමධර්ම යැ, සිළු ද අනිත්‍ය විපරිණාම ධර්ම යැ, කැල මැ තෙල ප්‍රදීපයාගේ එලිය අනිත්‍ය විපරිණාමධර්ම වේ ද එහෙයිනි.",
                "type": "paragraph"
            },
            {
                "text": "එපරිදි මැ බුහුනැණියෙනි, යමෙක් ‘මේ අධ්‍යාත්මික ෂඩායතනයෝ අනිත්‍යයහ. අධ්‍යාත්මික ෂඩායතනයන් නිසා යම් සුඛයක් හෝ දුඃඛයක් හෝ උපේක්ෂාවේදනාවක් හෝ විඳුනේ නම් ඒ නිත්‍ය යැ ධ්‍රැව යැ ශාශ්වත යැ අවිපරිණාමධර්ම යැ’ යි මෙසේ කියා නම් බුහුනැණියෙනි, බණන හේ මොනොවට බණන්නේ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල බිණීම මනා නො වේ මැ යැ. ඒ කවර හෙයින යත්: නන් නන් ස්වභාව වූ ප්‍රත්‍යය නිසා තත් තත් ස්වභාව වූ වේදනාවෝ උපදිති. තත් තත් ස්වභාව වූ ප්‍රත්‍යයාගේ නිරොධයාගේ තත් තත් ස්වභාව වූ වේදනාවෝ නිරුද්ධ වෙති, එහෙයිනි.",
                "type": "paragraph"
            },
            {
                "text": "මැනැව මැනැව බුහුනැණියෙනි, යථාභූතය සම්‍යක්ප්‍රඥායෙන් දක්නා ආර්‍ය්‍යශ්‍රාවකයක් හට තෙල සිත් වේ මැ යැ.",
                "type": "paragraph"
            },
            {
                "text": "බුහුනැණියෙනි, යම්සේ මුල් බැස සිටි සාරවත් මහාවෘක්ෂයක්හුගේ මුල ද අනිත්‍ය විපරිණාමධර්ම වේ ද, කඳ ද අනිත්‍ය විපරිණාමධර්ම වේ ද, ශාඛාපලාස ද අනිත්‍ය විපරිණාමධර්ම වේ ද, සෙවණ ද අනිත්‍ය විපරිණාමධර්ම වේ ද, බුහුනැණියෙනි, යමෙක් මුල් බැසසිටි සාරවත් මේ මහාවෘක්ෂයාගේ මුල ද අනිත්‍ය විපරිණාමධර්ම යැ යි කඳ ද අනිත්‍ය විපරිණාමධර්ම යැ යි අතුකොළ ද අනිත්‍ය විපරිණාමධර්ම යැ යි ද මේ වෘක්ෂයාගේ යම් සෙවණෙක් ඇද්ද ඒ නිත්‍ය යැ ධ්‍රැව යැ ශාශ්වත යැ අවිපරිණාමධර්ම යැ’ යි මෙසේ කියා ද, බුහුනැණියෙනි, බණන හේ මොනොවට බෙණේ දැ යි.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල මනා බිනීමෙක් නො වේ මැ යැ. ඒ කවර හෙයින යත්: වහන්ස, මුල් බැස සිටුනා සාරවත් වූ මහාවෘක්ෂයාගේ මුල ද අනිත්‍ය විපරිණාමධර්ම වේ ද, කඳ ද අනිත්‍ය විපරිණාමධර්ම වේ ද, අතු කොළ දෑ ද අනිත්‍ය විපරිණාමධර්ම වේ ද, කැල මැ මේ වෘක්ෂයාගේ සෙවණ අනිත්‍ය විපරිණාමධර්ම වේ ද එහෙයිනි. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "561"
            },
            {
                "text": "එපරිදි මැ බුහුනැණි යෙනි, යමෙක් ‘මේ බාහිර ෂඩායතනයෝ අනිත්‍ය විපරිණාම ධර්මයහ. බාහිර ෂඩායතනයන් නිසා යම් සුඛයක් හෝ දුඃඛයක් හෝ උපෙක්ෂා වේදනාවක් හෝ විඳුනේ නම් එය නිත්‍ය යැ ධ්‍රැව යැ ශාශ්වත යැ අවිපරිණාමධර්ම යැ’ යි මෙසේ බණන්නේ නම්, බුහුනැණියෙනි, මෙසේ බණන් හේ මනා කොට බෙණේ’ දැ? යි.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො වේ මැ යැ, ඒ කවර හෙයින යත්: තත් තත් ස්වභාව වූ ප්‍රත්‍යය නිසා තත් තත් ස්වභාව වූ වේදනාවෝ උපදිති. තත් තත් ස්වභාව වූ ප්‍රත්‍යයාගේ නිරෝධයෙන් තත් තත් ස්වභාව වූ වේදනාවෝ නිරුද්ධ වෙත්, එහෙයිනි.",
                "type": "paragraph"
            },
            {
                "text": "මැනැව මැනැව බුහුනැණියෙනි, යථාභූතය සම්‍යක් ප්‍රඥායෙන් දක්නා ආර්‍ය්‍යශ්‍රාවකයා හට තෙල සිත් වේ මැ යි.",
                "type": "paragraph"
            },
            {
                "text": "යම්සේ බුහුනැණියෙනි, දක්ෂ වූ ගවඝාතකයෙක් හෝ ගවඝාතක අතැවැසියෙක් හෝ ගවදෙනක නසා තියුණු ගෙරි කපන කැත්තෙන් ගවදෙන වෙන් කොට කපන්නේ වේ ද, අතර මාංශකාය නො පෙළා බාහිර චර්මකාය නො පෙළා යම් යම් එහි අතුරු විලිමස් අතුරු නහර අතුරු බන්ධන ඇද්ද, ඒ ඒ දැය මැ තියුණු ගෙරි කපන කැත්තෙන් සිඳුනේ වේ ද බිඳ කපන්නේ වේ ද වෙසෙසින් බිඳ කපන්නේ වේ ද හාත්පසින් බිඳ කපන්නේ වේ ද හාත්පසින් සිඳ හාත්පසින් කපා හාත්පසින් මොනොවට කපා මෙසේ බාහිර සම්කය ගලවාගෙන ඒ සමින් මැ ඒ දෙන වසා මෙසේ කියන්නේ වේ ද මේ සමින් මැ තුබු සැටි මැ ගෙන ‘සංයුක්ත’ යයි. බුහුනැණියෙනි, බණන හේ මොනොවට බණන්නේ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො වන්නේ මැ යැ. ඒ කවර හෙයින යත්: වහන්ස, දක්ෂ වූ මේ ගොඝාතක වේවයි ගවඝාතක අතැවැසි වේවයි දෙනක මරා තියුණු ගෙරි කපන කැත්තෙන් අතර මස්කය නො පෙළා බැහැර සම්කය නො පෙළා එහි යම් යම් අතුරු විලිමස් අතුරු නහර අතුරු බැඳුම් ඇද්ද, ඒ ඒ දැය මැ තියුණු ගෙරි කපන කැත්තෙන් මොනොවට වෙන් කරනුයේ මොනොවට කපනුයේ මොනොවට හාත්පස කපනුයේ මොනොවට වෙන් කොට කපනුයේ වේ ද, මොනොවට වෙන් කොට, මොනොවට කපා, මොනොවට වෙන් කොට කපා, බැහැර සම්කය උපුටා ගෙන ඒ සමින් මැ ඒ දෙන වසා ‘මේ සමින් මැ මේ දෙන තුබූ සැටි මැ සංයුක්ත වැ ඇතැ’ යි හෝ මෙසේ කියන්නේ නමුදු වැලි ඒ දෙන ඒ සමින් විසංයුක්ත මැ වේද, එහෙයිනි.",
                "type": "paragraph"
            },
            {
                "text": "බුහුනැණියෙනි, මා විසින් අර්ථය හඟවනු සඳහා මේ උපමා කරනලදු. මේ මේ මැ අර්ථ යැ: බුහුනැණියෙනි, ‘අතුරු මස්කය යැ’ යන තෙල සවැදෑරුම් අධ්‍යාත්මික ආයතනයට නමි. බුහුනැණියෙනි, ‘බාහර චර්මකාය යැ’ යන තෙල සවැදෑරුම් වාහ්‍යායතනයනට නමි. බුහුනැණියෙනි, ‘අතුරු විලිමස් යැ අතුරු නහර යැ අතුරු බන්ධන යැ’ යන තෙල නන්දිරාගයට නමෙකි. බුහුනැණියෙනි, ‘තියුණු ගෙරි කපන සැත යැ’ යන තෙල ආර්‍ය්‍යප්‍රඥාවට නමෙකි. යම් ආර්‍ය්‍යමාර්ගඥානයක් අතුරු කෙලෙස් අතුරු සංයොජන අතුරු බන්ධන මොනොවට සිඳී ද මොනොවට කපා ද මොනවට ප්‍රකාරයෙන් කපා ද මොනවට හාත්පසින් කපා ද එය යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "563"
            },
            {
                "text": "බුහුනැණියෙනි, මේ බොධ්‍යඞ්ගයෝ සත්දෙනෙක් වෙති. යම් බොධ්‍යඞ්ග කෙනකුන් වැඩු හෙයින් බහුල කළ හෙයින් මහණ ආස්‍රවයන්ගේ ක්ෂය වීමෙන් අනාස්‍රව වූ චිත්තවිමුක්තිය ප්‍රඥාවිමුක්තිය ඉහාත්මයෙහි තෙමේ මැ නුවණින් දැන ප්‍රත්‍යක්ෂ කොට ඊට පැමිණ වෙසේ ද, කවර සත්දෙනෙක යත්: බුහුනැණියෙනි, මෙ සස්නෙහි මහණ විවෙකනිඃශ්‍රිත වූ විරාගනිඃශ්‍රිත වූ නිරොධනිඃශ්‍රිත වූ වොස්සග්ගයට පිරිනැමුණු ස්මෘතිසම්බොධ්‍යඞ්ගය වඩයි. ... ධර්මවිචයසම්බොධ්‍යඞ්ගය වඩයි. ... වීර්‍ය්‍යසම්බොධ්‍යඞ්ගය වඩයි. ... ප්‍රීතිසම්බොධ්‍යඞ්ගය වඩයි. ... ප්‍රශබ්ධිසම්බොධ්‍යඞ්ගය වඩයි. ... සමාධිසම්බොධ්‍යඞ්ගය වඩයි. විවෙකනිඃශ්‍රිත වූ විරාගනිඃශ්‍රිත වූ නිරොධනිඃශ්‍රිත වූ වොස්සග්ගයට පිරිනැමුණු උපෙක්ෂාසම්බොධ්‍යඞ්ගය වඩයි. බුහුනැණියෙනි, යම් බොධ්‍යඞ්ග කෙනකුන් භාවිත බහුලීකෘත හෙයින් මහණ ආස්‍රවයන්ගේ ක්ෂය වීමෙන් අනාස්‍රව වූ ඵලසමාධිය ද ඵලප්‍රඥාව ද ඉහාත්මයෙහි තෙමේ මැ නුවණින් දැන ප්‍රත්‍යක්ෂ කොට උපයා වෙසේ ද එබඳුවූ මේ සප්තබොධ්‍යඞ්ගයෝ යි.",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති ආයුෂ්මත් නන්දක තෙරණුවෝ ඒ මෙහෙණනට මේ අවවාදයෙන් ඔවා දී ‘යව බුහුනැණියෙනි, කලැ’ යි යවාලූහ.",
                "type": "paragraph"
            },
            {
                "text": "එසඳ ඒ මෙහෙණහු ආයුෂ්මත් නන්දක තෙරණුවන්ගේ භාෂිතය අභිනන්දනා කොට අනුමෝදන් වැ හුනස්නෙන් නැගී ආයුෂ්මත් නන්දක තෙරුන් වැඳ පැදකුණු කොට භාග්‍යවතුන් වහන්සේ කරා එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ සකසා වැඳ එකත්පස්වැ සිටියහ. එකත්පස් වැ සිටි ඒ භික්ෂුණීන්ට බුදුහු තෙල කරුණ වදාළහ: ‘යව මෙහෙණෙනි, කලැ’ යි.",
                "type": "paragraph"
            },
            {
                "text": "එසඳ ඒ භික්ෂුණීහු භාග්‍යවතුන් වහන්සේ සකසා වැඳ පැදකුණු කොට නික්ම ගියාහ.",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ ඒ මෙහෙණන් නික්මගිය නොබෝ කාලයෙහි භික්ෂුන් ඇමැතූසේක: ‘මහණෙනි, යම් පිරිදි එදවස් තුදුස්වක් පොහොයෙහි බොහෝ ජනයාට සඳ ඌන වූයේ දොහෝ සඳ පිරුණේ දෝහො’ යි සැකයෙන් හෝ විමතියෙක් හෝ නො වෙයි. වැළි චන්ද්‍ර ඌන වූයේ මැ යයි සිත් වෙයි. එසෙයින් මැ මහණෙනි, ඒ මෙහෙණහු නන්දකයන්ගේ ධර්මදෙශනායෙන් සතුටුසිත් ඇත්තාහු ද වෙති. පරිපූර්ණ සංකල්ප ඇත්තාහු නොද වෙති’ යි.",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් නන්දක තෙරුන් ඇමතූ සේක: එහෙයින් නන්දකය තෙපි සෙට ද ඒ මෙහෙණන් ඒ අවවාදයෙන් මැ අවවාද කරව’ යි. ‘එසේ යැ වහන්සැ’ යි ආයුෂ්මත් නන්දක තෙරණුවෝ භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හ.",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති ආයුෂ්මත් නන්දක තෙරණුවෝ ඒ රාත්‍රිය ඇවෑමෙන් පෙරවරුයෙහි හැඳ පෙරෙවැ පාසිවුරු ගෙන සැවැත්නුවරට පිඬු පිණිස පිවිසියහ. සැවැත්නුවර පිඬු පිණිස හැසිර පසුබත්හි පිණ්ඩපාතයෙන් නැවැතියෝ එකලා වැ රාජකාරාමය කරා එළඹියහ. ඒ භික්ෂුණීහු ආයුෂ්මත් නන්දක තෙරණුවන් දුරින් මැ එනුවන් දුටහ. දැක අස්නක් පැනවූහ. පාදෝනා පිණිස දිය ද එළවා තැබූහ. ආයුෂ්මත් නන්දක තෙරණුවෝ පැනවූ අස්නෙහි වැඩහුන්හ. හිඳ පා දෙවූහ. ඒ මෙහෙණහු ද ආයුෂ්මත් නන්දක තෙරණුවන් වැඳ එකත්පස් වැ හුන්හ. එකත්පස් වැ හුන් ඒ මෙහෙණනට ආයුෂ්මත් නන්දක තෙරණුවෝ තෙල වදාළහ: බුහුනැණියෙනි, ‘ප්‍රතිපෘච්ඡාකථායෙක් වෙයි. එහිලා අවබොධ කොට දන්නවුන් විසින් ‘දනුම්හ’ යි කියැයුතු වෙයි. අවබොධ නො කරන්නවුන් විසින් ‘නො වටහම්හ’ යි කියැයුතු වෙයි. යමක්හට සැකයෙක් හෝ විමතියෙක් හෝ වේ ද එහිලා මා මැ පිළිවිසියයුතු වෙයි. ‘වහන්ස, මේ කෙසේ යැ? මේ වචනයාගේ අර්ථ කවරේ යැ?’ කියා යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "565"
            },
            {
                "text": "වහන්ස, අපි මෙතෙකිනිදු ආර්‍ය්‍ය වූ නන්දක තෙරණුවනට සතුටු සිතැත්තමෝ වම්හ. ඇලුණමෝ වම්හ. යම් හෙයෙකින් නන්දක තෙරණුවෝ අප පවරත් ද එහෙයිනි.",
                "type": "paragraph"
            },
            {
                "text": "බුහුනැණියෙනි, ඒ කෙසේ හඟනාව. චක්ෂුස නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය වේ නම් ඒ දුඃඛ හෝ සුඛ හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුඃඛ යැ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය දුඃඛ විපරිණාමස්වභාව ඇති වේ ද, ඒ ‘තෙල මා ගැත්තේ යැ, තෙල මම වෙමි, තෙල මාගේ ආත්ම යයි සමනුපස්සනාවට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො නිසි මැ යැ.",
                "type": "paragraph"
            },
            {
                "text": "බුහුනැණියෙනි, ඒ කෙසේ හඟනාව. ශ්‍රොතය නිත්‍ය හෝ අනිත්‍ය වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ ...",
                "type": "paragraph"
            },
            {
                "text": "ඝ්‍රාණය නිත්‍ය හෝ අනිත්‍ය වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ ...",
                "type": "paragraph"
            },
            {
                "text": "ජිහ්වා නිත්‍ය හෝ අනිත්‍ය වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ ...",
                "type": "paragraph"
            },
            {
                "text": "කය නිත්‍ය හෝ අනිත්‍ය වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ ...",
                "type": "paragraph"
            },
            {
                "text": "මනස නිත්‍ය හෝ අනිත්‍ය වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ ...",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය වේ නම් ඒ දුක් හෝ සුඛ හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුඃඛ යැ ...",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය දුඃඛ විපරිණාම ස්වභාව වේ නම් ‘තෙල මම වෙමි, තෙල මම වෙමි, තෙල මාගේ ආත්ම යැ’ යි ගෙන එය සමනුපස්සනාව කරන්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො වේ මැ ය. ඒ කවර හෙයින යත්: වහන්ස, තෙල අප විසින් පළමු වැ යථා භූත වැ සම්‍යක් ප්‍රඥායෙන් මොනොවට දක්නා ලදී. මෙකරුණෙනුදු ආධ්‍යාත්මික ෂඩායතන අනිත්‍ය ය හ’ යි කියා යි.",
                "type": "paragraph"
            },
            {
                "text": "මැනවැ මැනැවැ බුහුනැණියෙනි, තෙල යථා භූතය සම්‍යක් ඥානයෙන් දක්නා ආර්‍ය්‍යශ්‍රාවකයාහට තෙල සිත් මෙසේ වේ මැයි. බුහුනැණියෙනි, ඒ කෙසේ හඟනාව රූපායතනයෝ නිත්‍ය හෝ අනිත්‍ය හෝ වෙත් ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍යය හ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය නම් ඒ දුක් හෝ සුඛ හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුක් යැ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය දුඃඛ විපරිණාම ස්වභාව වේ නම්, එය ‘තෙල මා ගැත්තේ යැ, තෙල මම වෙමි, තෙල මාගේ ආත්මය’ යි නුවණින් දක්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නොනිසි වේ මැ යැ, ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "567"
            },
            {
                "text": "බුහුනැණියෙනි, ඒ කෙසේ හඟනාව, ශබ්දායතනයෝ නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍යයහ ...",
                "type": "paragraph"
            },
            {
                "text": "ගන්ධායතනයෝ නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍යයහ ...",
                "type": "paragraph"
            },
            {
                "text": "රසායතනයෝ නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍යයහ ...",
                "type": "paragraph"
            },
            {
                "text": "ස්ප්‍රෂ්ටව්‍යායතනයෝ නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍යයහ ...",
                "type": "paragraph"
            },
            {
                "text": "ධර්මායතනයෝ නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍යයහ ...",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය වේ නම්, එය දුක් හෝ සුඛ හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුක් යැ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය දුඃඛ විපරිණාම ස්වභාව වේ නම්, එය ‘තෙල මා ගැත්තේ යැ, තෙල මම වෙමි, තෙල මාගේ ආත්මය’ යි නුවණින් දක්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නොනිසි වේ යැ, ඒ කවර හෙයිනයත්: වහන්ස, තෙල අප විසින් යථාභූතව පළමු වැ සම්‍යග් ඥානයෙන්, මොනොවට දක්නා ලදී. මේ හේතුයෙනුදු බාහිර ෂඩායතනයෙන් අනිත්‍යය හ’යි කියා යි.",
                "type": "paragraph"
            },
            {
                "text": "මැනැවැ මැනැවැ බුහුනැණියෙනි, මෙසේ බුහුනැණියෙනි, යථාභූතය සම්‍යග් ඥානයෙන් දක්නා ආර්‍ය්‍යශ්‍රාවකයා හට තෙල සිත් වෙයි. ඒ කෙසේ හඟනාව බුහුනැණියෙනි, චක්ෂුර් විඥානය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය වේ නම් එය දුක් හෝ සුඛ හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුක් යැ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය දුඃඛ විපරිණාම ස්වභාව වේ නම්, ‘තෙල මා ගැත්තේ යැ, තෙල මම වෙමි, තෙල මාගේ ආත්මය යැ’ යි එය නුවණින් දක්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො නිසි වේ මැයැ.",
                "type": "paragraph"
            },
            {
                "text": "ඒ කෙසේ හඟනාව බුහුනැණියෙනි, ශ්‍රොතවිඥානය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍යය ...",
                "type": "paragraph"
            },
            {
                "text": "ඝ්‍රාණවිඥානය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍යය ...",
                "type": "paragraph"
            },
            {
                "text": "ජිහ්වාවිඥානය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍යය ...",
                "type": "paragraph"
            },
            {
                "text": "කායවිඥානය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍යය ...",
                "type": "paragraph"
            },
            {
                "text": "මනොවිඥානය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍යය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "569"
            },
            {
                "text": "යමෙක් අනිත්‍ය වේ නම්, ඒ දුක් හෝ සුඛ හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුක් යැ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය දුඃඛ විපරිණාම ස්වභාව වේ නම්, ‘තෙල මා ගැත්තේ යැ, තෙල මම වෙමි, තෙල මාගේ ආත්මය’ යි එය නුවණින් දක්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො නිසි වේ මැ යි. ",
                "type": "paragraph"
            },
            {
                "text": "ඒ කවර හෙයින යත්: වහන්ස, යම් හෙයෙකින් අප විසින් ‘මෙසේත් මේ ෂඩ්විඥානකායෝ අනිත්‍යයහ’ යි තෙල තත්වූ පරිදි සම්‍යක්ප්‍රඥායෙන් මොනොවට දක්නාලද ද එහෙයිනි. ",
                "type": "paragraph"
            },
            {
                "text": "මැනවැ මැනැවැ බුහුනැණියෙනි, යථාභූතය විදර්ශනාඥානයෙන් දක්නා ආර්‍ය්‍යශ්‍රාවක හට තෙල මෙසේ මැ වෙයි බුහුනැණියෙනි’ යි.",
                "type": "paragraph"
            },
            {
                "text": "යම් පරිදි බුහුනැණියෙනි, දැල්වෙන තෙල්පහනෙහි තෙලුදු අනිත්‍ය යැ, විපරිණාම ධර්ම යැ. වැටි දු අනිත්‍ය යැ, විපරිණාමධර්ම යැ. පහන්සිළුදු අනිත්‍ය යැ, විපරිණාමධර්ම යැ. එලිදු අනිත්‍ය යැ, විපරිණාමධර්ම යි. බුහුනැණියෙනි, යමෙක් මෙසේ කියා නම් මේ දැල්වෙන තෛලප්‍රදීපයාගේ තෙලුදු අනිත්‍ය යැ, විපරිණාමධර්ම යැ. වැටිදු අනිත්‍ය යැ, විපරිණාමධර්ම යැ. පහන්සිළුදු අනිත්‍ය යැ, විපරිණාමධර්ම යැ. එහි යම් ආභායෙක් ඇද්ද, එය නිත්‍ය යැ, ධ්‍රැව යැ, ශාශ්වත යැ, අවිපරිණාමධර්ම යැ යි. බුහුනැණියෙනි, (මෙසේ) කියන හේ මනා කොට කියන්නේ දැ? යි.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො වේ මැ යි. ඊට හෙතු කවරෙ යත්: වහන්ස, යම් හෙයෙකින් දැල්වෙන මේ තෛලප්‍රදීපයාගේ තෙලුදු අනිත්‍ය විපරිණාමධර්ම වේ ද, වැටිදු අනිත්‍ය විපරිණාමධර්ම වේ ද, පහන්සිළුදු අනිත්‍ය විපරිණාමධර්ම වේ ද, කැල මැ එහි එලිය අනිත්‍ය විපරිණාමධර්ම වේ ද එහෙයිනි.",
                "type": "paragraph"
            },
            {
                "text": "එපරිදි මැ බුහුනැණියෙනි, යමෙක් මෙසේ කියා නම් ‘මේ සවැදෑරුම් ආධ්‍යත්මික ආයතනයෝ අනිත්‍යයහ. ෂට් ආධ්‍යාත්මික ආයතනයන් නිසා යම් සුවයක් වේව යි දුකක් වේවයි උපෙක්ෂාවක් වේවයි විඳීම් ද එය නිත්‍ය යැ, ධ්‍රැව යැ, ශාශ්වත යැ, අවිපරිණාමධර්ම’ ය. බුහුනැණියෙනි, එසේ කියන හෙතෙම මනා කොට කියන්නේ දැ? යි.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො වේ මැ යැ. එ කවර හෙයින? වහන්ස, තත් තත් ස්වභාව වූ ප්‍රත්‍යය නිසා තත් තත් ස්වභාව වූ වෙදනාවෝ උපදිත් ද, තත් තත් ස්වභාව වූ ප්‍රත්‍යයාගේ නිරොධයෙන් තත් තත් ස්වභාව වූ වේදනාවෝ නිරුද්ධ වෙත් ද එහෙයිනි.",
                "type": "paragraph"
            },
            {
                "text": "මැනැව මැනැව බුහුනැණියෙනි, මෙසේ මැ බුහුනැණියෙනි, යථාභූතය විදර්ශනා ඥානයෙන් දක්නා ආර්‍ය්‍යශ්‍රාවකයාහට තෙල වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "යම්සේ බුහුනැණියෙනි, සාරවත් වූ මුල් බැස සිටුනා මහාවෘක්ෂයක්හුගේ මුල ද අනිත්‍ය විපරිණාමධර්ම වේ ද, කඳ ද අනිත්‍ය විපරිණාමධර්ම වේ ද, කොළ අතු ද අනිත්‍ය විපරිණාමධර්ම වේ ද, සෙවණ ද අනිත්‍ය විපරිණාමධර්ම වේ ද, බුහුනැණියෙනි, යමෙක් මෙසේ කියා නම් හර ඇති මුල් බැස සිටුනා මේ මහාවෘක්ෂයාගේ මුලත් අනිත්‍ය විපරිණාමධර්ම වෙයි. කඳ ද අනිත්‍ය විපරිණාමධර්ම වෙයි. කොළඅතු ද අනිත්‍ය විපරිණාමධර්ම වෙයි. එහි යම් ඡායාවක් ඇද්ද එය නිත්‍ය ධ්‍රැව යැ ශාශ්වත යැ අවිපරිණාමධර්ම වේ යයි. බුහුනැණියෙනි, එසේ කියන හේ මනා කොට කියන්නේ දැ? යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "571"
            },
            {
                "text": "වහන්ස, තෙල නො වේ මැ යැ, ඊට් හෙතු කවරෙ යැ? වහන්ස, යම් හෙයෙකින් හර ඇති මුල් බැස සිටුනා මේ මහාවෘක්ෂයාගේ මුලත් අනිත්‍ය විපරිණාමධර්ම වේ ද, කඳත් අනිත්‍ය විපරිණාමධර්ම වේ ද, ශාඛාපලාසත් අනිත්‍ය විපරිණාමධර්ම වේ ද, එහි ඡායාව කැලමැ අනිත්‍ය විපරිණාමධර්ම වේ ද එහෙයිනි.",
                "type": "paragraph"
            },
            {
                "text": "එසෙයින් මැ බුහුනැණියෙනි, යමෙක් මෙසේ කියන්නේ ද: මේ සවැදෑරුම් බාහ්‍යායතන යෝ අනිත්‍ය විපරිණාමධර්මයෝ යැ, ෂඩ් බාහිරායතනයන් නිසා යම් සුවයක් වේවයි, දුකක් වේවයි, උපේක්ෂාවක් වේවයි විඳුනේ ද, එය නිත්‍ය යැ, ධ්‍රැව යැ, ශාශ්වත යැ, අවිපරිණාමධර්ම වේ යයි. බුහුනැණියෙනි, එසේ කියන හෙතෙම මනාකොට කියන්නේ දැ? යි.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො වේ මැ යි. ඒ කවර හෙයින යත්: වහන්ස, තත් තත් ස්වභාව වූ ප්‍රත්‍යය නිසා තත් තත් ස්වභාව ඇති වෙදනාවෝ උපදිත් ද, තත් තත් ස්වභාව ඇති ප්‍රත්‍යයාගේ නිරෝධයෙන් තත් තත් ස්වභාව වූ වේදනාවෝ නිරුද්ධ වෙත් ද, එහෙයිනි.",
                "type": "paragraph"
            },
            {
                "text": "මැනැව මැනැව බුහුනැණියෙනි, තෙල බුහුනැණියෙනි, යථාභූතය විදර්ශනාඥානයෙන් දක්නා ආර්‍ය්‍යශ්‍රාවකහට එසේ මැ වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "යම්සේ බුහුනැණියෙනි, දක්ෂ වූ දක්ෂ වූ ගොඝාතකයෙක් වේවයි, ගොඝාතක අතැවැසියෙක් වේවයි, ගවදෙනක නසා තියුණු වූ ගෙරිකපන සැතින් ඇතුළු මස්කය නො නසා බැහැරි සම්කය නො නසා එහි යම් යම් අතුරු විලිමසක් ඇද්ද අතුරු නහර ඇද්ද අතුරු බන්ධන ඇද්ද ඒ ඒ දැය මැ තියුණු ගෙරිකපනසැතින් මොනොවට සිඳුනේ ද මොනොවට කපන්නේ ද මොනොවට අවට කපන්නේ ද මොනොවට හාත්පස කපන්නේ ද, මොනොවට සිඳ මොනොවට කපා අවට කපා මොනොවට හාත්පසින් කපා බැහැරි සම්කය සලා එ සමින් මැ ඒ ගවදෙන වසා මෙසේ කියා නම් ‘මේ ගවදෙන මේ සමින් එසේ මැ සංයුක්ත කරනලදැ’ යි. බුහුනැණියෙනි, එසේ කියන හෙතෙම මනා කොට කියන්නේ දැ? යි.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො වේ මැ යැ. ඒ කවර හෙයින යත්: වහන්ස, යම් හෙයෙකින් අසෝ ගවඝාතකයා හෝ ගවඝාතකයාගේ අතැවැසියා හෝ ගවදෙනක නසා තියුණු ගෙරිකපනසැතින් අතර මස්කය නො නසා බැහැරි සම්කය නො නසා ගවදෙන කපන්නේ ද එහි යම් යම් අතුරු විලිමසෙක් ඇද්ද අතුරු නහර ඇද්ද අතුරු බැඳුම් ඇද්ද, ඒ ඒ දැය මැ තියුණු ගෙරිකපනසැතින් මොනොවට සිඳුනේ ද මොනොවට කපන්නේ ද මොනොවට අවට කපන්නේ ද මොනොවට හාත්පස කපන්නේ ද, මොනොවට සිඳ මොනොවට හාත්පස කපා, බැහැරි සම්කය සලා ඒ සමින් මැ ඒ ගවදෙන වසා හේ මෙසේ කියන්නේ නම් ‘මේ සමින් මේ ගවදෙන එසේ මැ සංයුක්ත කරන ලදැ’ යි. එතෙකුදු වත් ඒ ගවදෙන ඒ සමින් මැ විසංයුක්ත වී යයි.",
                "type": "paragraph"
            },
            {
                "text": "බුහුනැණියෙනි, අර්ථය හැඟවීම පිණිස මා විසින් මේ උපමා එළවන ලදු. මෙහි මේ මැ අර්ථ යැ: බුහුනැණියෙනි, අතුරු මස්කය යැ යන තෙල ආධ්‍යාත්මික ආයතනයනට නමෙකි. බුහුනැණියෙනි, බැහැරි සම්කය යැ යන තෙල සවැදෑරුම් බාහ්‍යායතනයනට නමෙකි. බුහුනැණියෙනි, අතුරු විලිමසැ අතුරු නහර යැ, අතුරු බැඳුම යැ යන තෙල නන්දිරාගයට නමෙකි. බුහුනැණියෙනි, තියුණු, ගෙරිකපනසැත යැ යන තෙල ආර්‍ය්‍යඥානයට නමෙකි. යම් ආර්‍ය්‍යඥානයෙක් අතුරු කෙලෙස් අතුරු සංයොජන අතුරු බන්ධන සිඳී ද කපා ද මොනවට කපා ද හාත්පසින් කපා ද මොනවට හාත්පස කපා ද එය යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "573"
            },
            {
                "text": "බුහුනැණියෙනි, යම් බොධ්‍යඞ්ග කෙනකුන් භාවිත බැවින් බිහිලි කළ බැවින් මහණ ආස්‍රවක්ෂය හේතුයෙන් අනාස්‍රව වූ චෙතොවිමුක්ති ප්‍රඥාවිමුක්ති ඉහාත්මයෙහි මැ තෙමේ විශිෂ්ටඥානයෙන් දැන පසක් කොට උපයාගෙන වාස කෙරේ ද, මේ බොධ්‍යඞ්ග ධර්මයෝ සත් දෙනෙකි. කවර සත්දෙනෙක යත්: බුහුනැණියෙනි, මෙසස්නෙහි මහණ විවෙක නිඃශ්‍රිත වූ විරාගනිඃශ්‍රිත වූ නිරොධනිඃශ්‍රිත වූ ව්‍යවසර්ගය පිණිස පිරිනැමුම් ඇති ස්මෘති සම්බොධ්‍යඞ්ගය භවයි. ධර්මවිචය සම්බොධ්‍යඞ්ගය භවයි. ... වීර්‍ය්‍යසම්බොධ්‍යඞ්ගය භවයි. ... ප්‍රීතිසම්බොධ්‍යඞ්ගය භවයි. ... ප්‍රශ්‍රබ්ධිසම්බොධ්‍යඞ්ගය භවයි. ... සමාධිසම්බොධ්‍යඞ්ගය භවයි. ... විවෙක නිඃශ්‍රිත වූ විරාගනිඃශ්‍රිත වූ නිරොධනිඃශ්‍රිත වූ ව්‍යවසර්ගය පිණිස පිරිනැමුම් ඇති උපේක්ෂාසම්බොධ්‍යඞ්ගය භවයි. බුහුනැණියෙනි, යම් බොධ්‍යඞ්ගධර්ම කෙනකුන් භැවූ බැවින් බිහිලි කළ බැවින් මහණ ආස්‍රවක්ෂය හේතුයෙන් අනාස්‍රව වූ චේතොවිමුක්ති ප්‍රඥාවිමුක්ති මේ භවයෙහි මැ තෙමේ වෙසෙසින් දැන පසක් කොට එයට එළඹ වාස කෙරේ ද, මේ බොධ්‍යඞ්ගධර්මයෝ සත්දෙනා වෙති.",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති ආයුෂ්මත් නන්දක තෙරණුවෝ ඒ මෙහෙණන් මේ අවවාදයෙන් ඔවා දී ‘බුහුනැණියෙනි, යන්නේ මැනැව යන්නට කලැ’ යි යැවී.",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති ඒ මෙහෙණහු ආයුෂ්මත් නන්දක තෙරණුවන්ගේ භාෂිතය සතුටින් පිළිගෙන අනුමෝදන් වැ හුනස්නෙන් නැඟී ආයුෂ්මත් නන්දක තෙරණුවන් සකසා වැඳ පැදකුණු කොට භාග්‍යවතුන් වහන්සේ කරා එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ සකසා වැඳ එකත්පස් වැ සිටියහ. භාග්‍යවතුන් වහන්සේ එකත්පස් වැ සිටි ඒ මෙහෙණනට තෙල වදාළහ. මෙහෙණනි, ‘යව යන්නට කලැ’ යි.",
                "type": "paragraph"
            },
            {
                "text": "එසඳ ඒ මෙහෙණහු භාග්‍යවතුන් වහන්සේ සකසා වැඳ පැදකුණු කොට බැස ගියෝ. එසඳ භාග්‍යවතුන් වහන්සේ ඒ මෙහෙණන් බැස යන්නා හා මැ භික්ෂූන් ඇමතූසේක. මහණෙනි, යම් පරිදි එදවස් පොහොය පුණුරැසියෙහි ‘චන්ද්‍රයා ඌන වේ ද හෝ චන්ද්‍රයා පූර්ණ වේ ද හෝ’ යි බොහෝ දෙනාට සැකයෙන් හෝ විමතියෙක් හෝ නො වේ ද වැළිත් චන්ද්‍රයා පූර්ණ මැ වේ යයි සිත් වේ ද, මහණෙනි, එපරිදි මැ ඒ මෙහෙණහු නන්දකයන්ගේ දහම් දෙස්නෙන් ගත් සිතැතියාහු ද පරිපූර්ණ සංකල්ප ඇත්තාහු ද වෙති. මහණෙනි, ඒ පන්සියක් මෙහෙණන් ඇසුරින් හැමට සග මෙහෙණක් ඇද්ද හෝ අවිනිපාතධර්ම ඇති නියත වූ සම්බොධිපරායණ වූ සෝවාන් මෙහෙණකැ’ යි වදාළහ.",
                "type": "paragraph"
            },
            {
                "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළසේක. සතුටු සිත් ඇති ඒ මහණහු භාග්‍යවතුන් වහන්සේගේ භාෂිතය සතුටින් පිළිගත්හු.",
                "type": "paragraph"
            },
            {
                "text": "සතර වැනි නන්දකොවාද සූත්‍ර යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "575"
            },
            {
                "type": "centered",
                "text": "3.5.5",
                "level": 1
            },
            {
                "type": "heading",
                "text": "චූළරාහුලොවාද සූත්‍රය",
                "level": 1
            },
            {
                "text": "මා විසින් මෙසේ අසන ලද: එක් කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර ජේතවන නම් වූ අනේපිඬු මහසිටුහුගේ අරම්හි වැඩවාස කෙරෙති. එකල රහොගත වූ එකාකී වූ භාග්‍යවතුන් වහන්සේට මෙබඳු චිත්තපරිවිතර්කයෙක් උපන. රාහුලයන්ගේ විමුක්තිය මිහිකිරීමට හිත වූ ධර්මයෝ පැසී සිටියහ. මම රාහුලයන් මතු ආස්‍රවක්ෂයයෙහි ලා විනයන කෙරෙම් නම් මැනැවැයි.",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ පෙරවරු හැඳපෙරවැ පාසිවුරු ගෙන් සැවතට පිඬු පිණිස වැඩියෝ, සැවැත පිඬු පිනිස හැසිර පසුබතැ පිඬුවායෙන් වැළැක්කාහු ආයුෂ්මත් රාහුල තෙරුන් ඇමතූසේක. රාහුලය, හිඳිනාකඩ ගනුව, දිවාවිහරණ සඳහා අන්ධවනය කරා යම්හ’ යි.",
                "type": "paragraph"
            },
            {
                "text": "‘වහන්ස, එසේ ය’යි ආයුෂ්මත් රාහුල තෙරණුවෝ භාග්‍යවතුන් වහන්සේට පිළිවදන් අස්වා හිඳිනාකඩ ගෙන භාග්‍යවතුන් වහන්සේ පසු පස් ලුහුබැඳ ගියහ.",
                "type": "paragraph"
            },
            {
                "text": "එසමයෙහි අනෙක දේවතාසහස්‍රයෝ භාග්‍යවතුන් වහන්සේ ලුහුබැන්දාහු වෙති. ‘අද භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් රාහුල තෙරණුවන් මතු ආස්‍රවක්ෂය ඥානයෙහි ලා විනයන කෙරෙති’ යි.",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ අන්ධවනයට බැසගෙන එක්තරා රුක්මුලෙක පැන්වූ අස්නෙහි හුන්සේක. ආයුෂ්මත් රාහුල තෙරණුවෝ ද භාග්‍යවතුන් වහන්සේ සකසා වැඳ එකත්පස් වැ හුන්හ. භාග්‍යවතුන් වහන්සේ එකත්පස් වැ හුන් ආයුෂ්මත් රාහුල භද්‍රයන් බණවා තෙල වදාළසේක:",
                "type": "paragraph"
            },
            {
                "text": "රාහුලය, ඒ කෙසේ හඟනෙහි? චක්ෂුස නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය යැ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය වේ නම් ඒ දුඃඛ හෝ සුඛ හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුඃඛ යැ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය දුඃඛ විපරිණාමධර්ම වේ නම් ‘තෙල මා ගැත්තේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි එය සමනුපස්සනා වශයෙන් ගන්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො නිසි වේ මැ යැ.",
                "type": "paragraph"
            },
            {
                "text": "රාහුලය, ඒ කෙසේ හඟනෙහි? රූපයෝ නිත්‍ය හෝ අනිත්‍ය හෝ වෙත් ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍යයහ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය වේ නම් ඒ දුඃඛ හෝ සුඛ හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුඃඛ යැ.",
                "type": "paragraph"
            },
            {
                "text": "යමෙක් අනිත්‍ය දුඃඛ විපරිණාමධර්ම වේ නම් එය ‘තෙල මා ගැත්තේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්මයැ’ යි තෘෂ්ණාදි විසින් ගන්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො නිසි වේ මැ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "577"
            },
            {
                "text": "රාහුලය, ඒ කෙසේ හඟනෙහි, චක්ෂුර්විඥානය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "වැළි යමෙක් අනිත්‍ය වේ නම් එය දුක් හෝ සුව හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුක් වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "වැළි යමෙක් අනිත්‍ය දුඃඛ විපරිණාමස්වභාව වේ නම් එය ‘තෙල මා ගැත්තේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි තෘෂ්ණාදි විසින් දක්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො වේ මැ යැ.",
                "type": "paragraph"
            },
            {
                "text": "රාහුලය, ඒ කෙසේ හඟනෙහි? චක්ෂුස්සංස්පර්ෂය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "වැළි යමෙක් අනිත්‍ය වේ නම් එය දුක් හෝ සුව හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුක් වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "වැළි යමෙක් අනිත්‍ය දුඃඛ විපරිණාමස්වභාව වේ නම් එය ‘තෙල මා ගැත්තේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි තෘෂ්ණාදි විසින් දක්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො වේ මැ යැ.",
                "type": "paragraph"
            },
            {
                "text": "රාහුලය, ඒ කෙසේ හඟනෙහි? චක්ෂුඃසංස්පර්ෂය හේතුයෙන් යම් වේදනාගතයෙක් සංඥාගතයෙක් සංස්කාරගතයෙක් විඥානගතයෙක් උපදී නම් එ ද නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "වැළි යමෙක් අනිත්‍ය වේ නම් එය දුක් හෝ සුව හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුක් වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "වැළි යමෙක් අනිත්‍ය දුඃඛ විපරිණාම ස්වභාව වේ නම් එය ‘තෙල මා ගැත්තේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි තෘෂ්ණාදි විසින් දක්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො වේ මැ යැ.",
                "type": "paragraph"
            },
            {
                "text": "රාහුලය, ඒ කෙසේ හඟනෙහි? ශ්‍රෝතය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය වෙයි. ...",
                "type": "paragraph"
            },
            {
                "text": "ඝ්‍රාණය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය වෙයි. ...",
                "type": "paragraph"
            },
            {
                "text": "ජිහ්වා නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය වෙයි. ...",
                "type": "paragraph"
            },
            {
                "text": "කය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය වෙයි. ...",
                "type": "paragraph"
            },
            {
                "text": "මනස නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය වෙයි. ...",
                "type": "paragraph"
            },
            {
                "text": "වැළි යමෙක් අනිත්‍ය වේ නම් එය දුක් හෝ සුව හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුක් වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "579"
            },
            {
                "text": "වැළි යමෙක් අනිත්‍ය දුඃඛ විපරිණාම ස්වභාව වේ නම් එය ‘තෙල මා ගැත්තේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි තෘෂ්ණාදි විසින් දක්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො වේ මැ යැ.",
                "type": "paragraph"
            },
            {
                "text": "රාහුලය, ඒ කෙසේ හඟනෙහි? ධර්මයෝ නිත්‍ය හෝ අනිත්‍ය හෝ වෙත් ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය වෙති.",
                "type": "paragraph"
            },
            {
                "text": "වැළි යමෙක් අනිත්‍ය වේ නම් එය දුක් හෝ සුව හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුක් වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "වැළි යමෙක් අනිත්‍ය දුඃඛ විපරිණාම ස්වභාව වේ නම් එය ‘තෙල මා ගැත්තේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි තෘෂ්ණාදි විසින් දක්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො නිසි වේ මැ යැ.",
                "type": "paragraph"
            },
            {
                "text": "රාහුලය, ඒ කෙසේ හඟනෙහි? මනෝවිඥානය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "වැළි යමෙක් අනිත්‍ය වේ නම් එය දුක් හෝ සුව හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුක් වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "වැළි යමෙක් අනිත්‍ය දුඃඛ විපරිණාම ස්වභාව වේ නම් එය ‘තෙල මා ගැත්තේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි තෘෂ්ණාදි විසින් දක්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො වේ මැ යැ.",
                "type": "paragraph"
            },
            {
                "text": "රාහුලය, ඒ කෙසේ හඟනෙහි? මනස්සංස්පර්ශය නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "වැළි යමෙක් අනිත්‍ය වේ නම් එය දුක් හෝ සුව හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුක් වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "වැළි යමෙක් අනිත්‍ය දුඃඛ විපරිණාමස්වභාව වේ නම් එය ‘තෙල මා ගැත්තේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි තෘෂ්ණාදි විසින් දක්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො වේ මැ යැ.",
                "type": "paragraph"
            },
            {
                "text": "රාහුලය, ඒ කෙසේ හඟනෙහි, මනඃසංස්පර්ෂය හේතුයෙන් යම් වේදනාගතයෙක් සංඥාගතයෙක් සංස්කාරගතයෙක් විඥානගතයෙක් උපදී ද, එ ද නිත්‍ය හෝ අනිත්‍ය හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, අනිත්‍ය වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "වැළි යමෙක් අනිත්‍ය වේ නම් එය දුක් හෝ සුව හෝ වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, දුක් වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "වැළි යමෙක් අනිත්‍ය දුඃඛ විපරිණාම ස්වභාව වේ නම් එය ‘තෙල මා ගැත්තේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි තෘෂ්ණාදි විසින් දක්නට නිසි වේ ද?",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, තෙල නො වේ මැ යැ. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "581"
            },
            {
                "text": "රාහුලය, මෙසේ නුවණින් දක්නා ශ්‍රැතවත් ආර්‍ය්‍යශ්‍රාවක චක්ෂුසෙහි කලකිරෙයි. රූපයෙහි කලකිරෙයි, චක්ෂුර්විඥානයෙහි කලකිරෙයි, චක්ෂුස්සංස්පර්ශයෙහි කලකිරෙයි, ච්ක්ෂුස්සංස්පර්ශ හේතුයෙන් උපන් යම් වේදනාගතයෙක් සංඥාගතයෙක් සංස්කාරගතයෙක් විඥානගතයෙක් උපදී නම් එහිදු කලකිරෙයි. ශ්‍රොතයෙහි කලකිරෙයි. ... ශබ්දයෙහි කලකිරෙයි. ... ඝ්‍රාණයෙහි කලකිරෙයි. ... ගන්ධයෙහි කලකිරෙයි. ... ජිහ්වායෙහි කලකිරෙයි, රසයෙහි කලකිරෙයි. ... කායයෙහි කලකිරෙයි, ස්ප්‍රෂ්ටව්‍යයෙහි කලකිරෙයි. ... මනසෙහි කලකිරෙයි, ධර්මයන්හි කලකිරෙයි, මනොවිඥානයෙහි කලකිරෙයි, මනඃස්පර්ශයෙහි කලකිරෙයි. මනඃස්පර්ශ හේතුයෙන් යම් වේදනාගතයෙක් සංඥාගතයෙක් සංස්කාරගතයෙක් විඥානගතයෙක් උපදී නම් එහිදු කලකිරෙයි. නිර්වෙදයට පැමිණියේ නො ඇලෙයි. විරාගයෙන් විමුක්ත වෙයි. විමුක්ත කල්හි විමුක්ත යැ’ යි (ප්‍රත්‍යවෙක්ෂා) ඥානය උපදී: ‘ජාති ක්ෂය වූ යැ. මඟ බඹසර වැසැ නිමවනලද. මඟකරණී කරනලද. මේ ආත්මභාවය පිණිස කළයුතු අන් කිසෙක් නැතැ’ යි දැනගනී.",
                "type": "paragraph"
            },
            {
                "text": "භාග්‍යවතුන් වහන්සේ මේ රාහුලොවාදය වදාළසේක. සතුටුසිත් ඇති ආයුෂ්මත් රහල් තෙරණුවෝ භාග්‍යවතුන් වහන්සේ ගේ භාෂිතය පිළිගත්හ.",
                "type": "paragraph"
            },
            {
                "text": "තවද මේ වෙය්‍යාකරණය වදාරන කල්හි ආයුෂ්මත් රහල් තෙරණුවන්ගේ සිත උපාදානය නො කොට ආස්‍රවයන් කෙරෙන් මිදිණ. ඒ නොයෙක් දේවතා දහසුන්ට ද කෙලෙස් රජස් රහිත වූ කෙලෙස් මල රහිත වූ දහම් ඇස පහළ වී: ‘යම්කිසි සමුදය ධර්මයෙක් ඇද්ද එ හැම නිරෝධස්වභාව ඇතැ’ යි කියා යි.",
                "type": "paragraph"
            },
            {
                "text": "පස් වැනි චූළරාහුලොවාද සූත්‍ර යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "583"
            },
            {
                "type": "centered",
                "text": "3.5.6",
                "level": 1
            },
            {
                "type": "heading",
                "text": "ඡ ඡක්ක සූත්‍රය",
                "level": 1
            },
            {
                "text": "මා විසින් මෙසේ අසන ලද: එක් කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර ජේතවන නම් වූ අනේපිඬු මහසිටුහුගේ අරම්හි වැඩවාස කෙරෙති. එකල භාග්‍යවතුන් වහන්සේ ‘මහණෙනි’ යි භික්ෂූන් ඇමතූසේක. ‘වහන්සැ’ යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හු. භාග්‍යවතුන් වහන්සේ තෙල ඡඡක්ක දේශනා වදාළහ:",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, තොපට ආදිකල්‍යාණ වූ මධ්‍යකල්‍යාණ වූ පර්‍ය්‍යවසානකල්‍යාණ වූ සාර්‍ථ වූ සව්‍යඤ්ජන වූ කේවලපරිපූර්ණ වූ ධර්මයක් දෙසමි. පරිශුද්ධ බ්‍රහ්මචර්‍ය්‍ය ප්‍රකාශ කරමි. ඒ කිමෙක යත්: ‘ඡඡක්ක’ ධර්ම යි. ඒ අසව, මොනවට මෙනෙහි කරව, කියමි’ යි වදාළෝ.",
                "type": "paragraph"
            },
            {
                "text": "‘වහන්ස, එසේ යැ’ යි භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හු.",
                "type": "paragraph"
            },
            {
                "text": "සවැදෑරුම් ආධ්‍යාත්මික ආයතනයෝ දතයුත්තාහ. සවැදෑරුම් බාහිර ආයතනයෝ දතයුත්තාහ. සවැදෑරුම් විඥානකායයෝ දතයුත්තාහ. සවැදෑරුම් ස්පර්ශකායයෝ දතයුත්තාහ. සවැදෑරුම් වේදනාකායයෝ දතයුත්තාහ. සවැදෑරුම් තෘෂ්ණාකායයෝ දතයුත්තාහ’ යි.",
                "type": "paragraph"
            },
            {
                "text": "‘සවැදෑරුම් ආධ්‍යාත්මික ආයතනයෝ දතයුත්තාහයි’ යි මෙසේ තෙල බසෙක් කියන ලද යැ, තෙල බස් කුමක් පිණිස කියන ලද ද යත්: චක්ෂුරායතන යැ ශ්‍රොතායතන යැ ඝ්‍රාණායතන යැ ජිහ්වායතන යැ කායායතන යැ මනායතන යි. ‘සවැදෑරුම් ආධ්‍යාත්මික ආයතනයෝ දතයුත්තාහ’ යි මෙසේ යම් බසෙක් කියනලද ද මෙය, තෙල ආයතන පිණිස කියනලදි. මේ පළමු වන ෂට්ක යි.",
                "type": "paragraph"
            },
            {
                "text": "‘සවැදෑරුම් බාහිරායතනයෝ දතයුත්තාහ’ යි මෙසේ තෙල බසෙක් කියන ලද යැ, තෙල බස් කුමක් පිණිස කියන ලද ද යත්: රූපායතන යැ ශබ්දායතන යැ ගන්ධායතන යැ රසායතන යැ ස්ප්‍රෂ්ටව්‍යායතන යැ ධර්මායතන යි. ‘සවැදෑරුම් බාහිර ආයතනයෝ දතයුත්තාහ’ යි මෙසේ යම් බසෙක් කියනලද ද, මෙය තෙල ආයතන පිණිස කියනලදි. මේ දෙවන ෂට්ක යි.",
                "type": "paragraph"
            },
            {
                "text": "‘සවැදෑරුම් විඥානකායයෝ දතයුත්තාහ’ යි මෙසේ තෙල බසෙක් කියනලද යැ, තෙල බස් කුමක් පිණිස කියන ලද යැ යත්: ඇස ද රූපායතන ද නිසා චක්ෂුර්විඥානය උපදනේ යැ. කන ද ශබ්දායතන ද නිසා ශ්‍රොතවිඥානය උපදනේ යැ. නැහැය ද ගන්ධායතන ද නිසා ඝ්‍රාණවිඥාන උපදනේ යැ. දිව ද රසායතන ද නිසා ජිහ්වාවිඥාන උපදනේ යැ. කය ද ස්ප්‍රෂ්ටව්‍යායතන ද නිසා කායවිඥාන උපදනේ යැ. සිත ද ධර්මායතන ද නිසා මනෝවිඥාන උපදනේ යැ. ‘සවැදෑරුම් විඥානකායයෝ දතයුත්තාහ’ යි මෙසේ යම් බසෙක් කියනලද ද, මෙය තෙල කාය පිණිස කියන ලදි. මේ තුන් වන ෂට්ක යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "585"
            },
            {
                "text": "‘සවැදෑරුම් ස්පර්ශකායයෝ දතයුත්තාහ’ යි මෙසේ තෙල බසෙක් කියනලද යැ, තෙල බස් කුමක් පිණිස කියන ලද යැ යත්: ඇස ද රූපායතන ද නිසා චක්ෂුර්විඥානය උපදනේ යැ. තුන් දෙනාගේ සඞ්ගතිය ස්පර්ශ නමි. කන ද ශබ්දායතන ද නිසා ශ්‍රොතවිඥානය උපදනේ යැ. තුන් දෙනාගේ සඞ්ගතිය ස්පර්ශ නමි. නැහැය ද ගන්ධායතන ද නිසා ඝ්‍රාණවිඥාන උපදනේ යැ. තුන් දෙනාගේ සඞ්ගතිය ස්පර්ශ නමි. දිව ද රසායතන ද නිසා ජිහ්වාවිඥාන උපදනේ යැ. තුන් දෙනාගේ සඞ්ගතිය ස්පර්ශ නමි. කය ද ස්ප්‍රෂ්ටව්‍යායතන ද නිසා කායවිඥාන උපදනේ යැ. තුන් දෙනාගේ සඞ්ගතිය ස්පර්ශ නමි. සිත ද ධර්මායතන ද නිසා මනෝවිඥාන උපදනේ යැ. තුන් දෙනාගේ සඞ්ගතිය ස්පර්ශ නමි. ‘සවැදෑරුම් ස්පර්ශකායයෝ දතයුත්තාහ’ යි මෙසේ යම් බසෙක් කියනලද ද, මෙය තෙල ස්පර්ශ පිණිස කියනලදි. මේ සතර වන ෂට්ක යි.",
                "type": "paragraph"
            },
            {
                "text": "‘සවැදෑරුම් වේදනාකායයෝ දතයුත්තාහ’ යි මෙසේ තෙල බසෙක් කියනලද යැ, තෙල බස් කුමක් පිණිස කියන ලද යැ යත්: ඇස ද රූපායතන ද නිසා චක්ෂුර්විඥානය උපදනේ යැ. තුන් දෙනාගේ සඞ්ගතිය ස්පර්ශ නමි. ස්පර්ශ හේතුයෙන් වේදනා පහළ වෙයි. කන ද ශබ්දායතන ද නිසා ශ්‍රොතවිඥානය උපදනේ යැ. ... නැහැය ද ගන්ධායතන ද නිසා ඝ්‍රාණවිඥාන උපදනේ යැ. ... දිව ද රසායතන ද නිසා ජිහ්වාවිඥාන උපදනේ යැ. ... කය ද ස්ප්‍රෂ්ටව්‍යායතන ද නිසා කායවිඥාන උපදනේ යැ. ... සිත ද ධර්මායතන ද නිසා මනෝවිඥාන උපදනේ යැ. තුන් දෙනාගේ සඞ්ගතිය ස්පර්ශ නමි. ස්පර්ශ හේතුයෙන් වේදනා පහළ වෙයි. ‘සවැදෑරුම් වේදනාකායයෝ දතයුත්තාහ’ යි මෙසේ යම් බසෙක් කියනලද ද, මෙය තෙල වේදනා පිණිස කියනලදි. මේ පස් වන ෂට්ක යි.",
                "type": "paragraph"
            },
            {
                "text": "‘ෂට් තෘෂ්ණාකායයෝ දතයුත්තාහ’ යි මෙසේ තෙල බසෙක් කියනලද ද, තෙල බස් කුමක් පිණිස කියන ලද ද යත්: ඇස ද රූපායතන ද නිසා චක්ෂුර්විඥානය උපදනේ යැ. තුන් දෙනාගේ සඞ්ගතිය ස්පර්ශ නමි. ස්පර්ශ ප්‍රත්‍යයෙන් වේදනා වෙයි. වේදනා ප්‍රත්‍යයෙන් තෘෂ්ණා වෙයි. ශ්‍රෝත්‍රය ද ශබ්දායතන ද නිසා ශ්‍රොතවිඥානය උපදනේ යැ. ... ඝ්‍රාණය ද ගන්ධායතන ද නිසා ඝ්‍රාණවිඥාන උපදනේ යැ. ... ජිහ්වාව ද නිසා රසායතන ද නිසා ජිහ්වාවිඥාන උපදනේ යැ. ... කය ද ස්ප්‍රෂ්ටව්‍යායතන ද නිසා කායවිඥාන උපදනේ යැ. ... මනස ද නිසා ධර්මායතන ද නිසා මනෝවිඥාන උපදනේ යැ. තුන් දෙනාගේ සඞ්ගතිය ස්පර්ශ නමි. ස්පර්ශ ප්‍රත්‍යයෙන් වේදනා වෙයි. වේදනා ප්‍රත්‍යයෙන් තෘෂ්ණා වෙයි. ‘ෂට් තෘෂ්ණාකායයෝ දතයුත්තාහ’ යි මෙසේ යමක් කියනලද ද, මෙය තෙල සඳහා කියනලදි. මේ සවන ෂට්ක යි.",
                "type": "paragraph"
            },
            {
                "text": "‘චක්ෂුස ආත්ම යැ’ යි යමෙක් කියා ද එය නො යෙදෙයි. චක්ෂුස්හුගේ උත්පාදය ද විනාශය ද පැනෙයි. යමක්හුගේ වැළිත් උත්පාදයත් ව්‍යයත් පැනේ නම් ‘මාගේ ආත්මය උපදනේත් නිරුද්ධ වන්නේත් වේ ය’යි ඔහුට මෙසේ (ලබ්ධි) ආයේ වෙයි. එහෙයින් ‘චක්ෂුස ආත්ම යැ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. මෙසේ චක්ෂුස අනාත්ම වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "‘රූපායතනය ආත්ම යැ’ යි යමෙක් කියා නම් ඒ නො යෙදෙයි. රූපායතනයාගේ උත්පාදයත් ව්‍යයත් පැනෙයි. යමක්හුගේ වැළිත් උත්පාදයත් ව්‍යයත් පැනේ නම් ‘මාගේ ආත්මය උපදනේත් වෙයි, නැසෙනුයේත් වේ ය’යි ඔහුට මෙසේ ලබ්ධිය ආයේ වෙයි. එහෙයින් ‘රූපායතනය ආත්ම යැ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. මෙසේ චක්ෂුස අනාත්ම වෙයි. රූපායතනය අනාත්ම වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "587"
            },
            {
                "text": "‘චක්ෂුර්විඥානය ආත්ම යැ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. චක්ෂුර්විඥානයාගේ උත්පාදයත් ව්‍යයත් පැනෙයි. යමක්හුගේ වැළිත් උත්පාදයත් ව්‍යයත් පැනේ නම් ‘මාගේ ආත්මය උපදනේත් නැසෙන්නේත් වේ ය’යි ඔහුට මෙසේ ලබ්ධිය ආයේ වෙයි. එහෙයින් ‘චක්ෂුර්විඥානය ආත්ම යැ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. මෙසේ චක්ෂුස අනාත්ම යැ. රූපායතනය අනාත්ම යැ. චක්ෂුර්විඥානය අනාත්මයි.",
                "type": "paragraph"
            },
            {
                "text": "‘චක්ෂුස්සංස්පර්ශය ආත්ම යැ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. චක්ෂුස්සංස්පර්ශයාගේ උත්පාදයත් ව්‍යයත් පැනෙයි. යමක්හුගේ වැළිත් උත්පාදයත් ව්‍යයත් පැනේ නම් ‘මාගේ ආත්මය උපදනේත් වෙයි, නැසෙන්නේත් වේ’ යයි මෙසේ ඔහුට ලබ්ධිය පැමිණියේ වෙයි. එහෙයින් ‘චක්ෂුස්සංස්පර්ශය ආත්ම යැ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. මෙසේ චක්ෂුස අනාත්ම වෙයි. රූපයෝ අනාත්ම වෙයි. චක්ෂුර්විඥානය අනාත්ම වෙයි. චක්ෂුස්සංස්පර්ශය අනාත්මයි.",
                "type": "paragraph"
            },
            {
                "text": "‘වේදනාව ආත්ම යැ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. වේදනාවගේ උත්පාදයත් ව්‍යයත් පැනෙයි. යමක්හුගේ වැළිත් උත්පාදයත් ව්‍යයත් පැනේ නම් ‘මාගේ ආත්මය උපදනේත් වෙයි, නැසෙන්නේත් වේ’ යයි මෙසේ ඔහුට ලබ්ධිය ආයේ වෙයි. එහෙයින් ‘වේදනාව ආත්ම යැ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. මෙසේ චක්ෂුස අනාත්ම වෙයි. රූපයෝ අනාත්ම වෙයි. චක්ෂුර්විඥානය අනාත්ම වෙයි. චක්ෂුස්සංස්පර්ශය අනාත්ම වෙයි. වේදනාව අනාත්මයි.",
                "type": "paragraph"
            },
            {
                "text": "‘තෘෂ්ණාව ආත්ම යැ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. තෘෂ්ණාවගේ උත්පාදයත් ව්‍යයත් පැනෙයි. යමක්හුගේ වැළිත් උත්පාදයත් ව්‍යයත් පැනේ නම් ‘මාගේ ආත්මය උපදනේත් වෙයි, නැසෙන්නේත් වේ’ යයි මෙසේ ඔහුට ලබ්ධිය පැමිණියේ වෙයි. ‘තෘෂ්ණාව ආත්ම යැ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. මෙසේ චක්ෂුස අනාත්ම යැ. රූපයෝ අනාත්මයෝ යැ. චක්ෂුර්විඥානය අනාත්ම යැ. චක්ෂුස්සංස්පර්ශය අනාත්ම යැ. වේදනාව අනාත්ම යැ. තෘෂ්ණාව අනාත්ම යි.",
                "type": "paragraph"
            },
            {
                "text": "‘ශ්‍රොතය ආත්ම යැ’ යි යමෙක් කියා නම් ... ඝ්‍රාණය ආත්ම යැ’ යි යමෙක් කියා නම් ... ජිහ්වාව ආත්ම යැ’ යි යමෙක් කියා නම් ... කාය ආත්ම යැ’ යි යමෙක් කියා නම් ... මනස ආත්ම යැ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. මනස්හුගේ උත්පාදයත් ව්‍යයත් පැනෙයි. වැලි යමෙක්හුගේ උත්පාදයත් ව්‍යයත් පැනේ නම් ‘මාගේ ආත්මය උපදනේත් නැසෙන්නේත් වේ’ යයි මෙසේ ඔහුට ලබ්ධිය ආයේ වෙයි. එහෙයින් ‘මනස ආත්ම යැ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. මෙසේ මනස අනාත්මයි. ",
                "type": "paragraph"
            },
            {
                "text": "‘ධර්මයෝ ආත්මයහ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. ධර්මයන්ගේ උත්පාදයත් ව්‍යයත් පැනෙයි. යමක්හුගේ උත්පාදයත් ව්‍යයත් පැනේ නම් ‘මාගේ ආත්මය උපදනේත් නැසෙන්නේත් වේ’ යයි මෙසේ ඔහුට ලබ්ධිය ආයේ වෙයි. එහෙයින් ‘ධර්මයෝ ආත්මයහ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. මෙසේ මනස අනාත්ම යැ ධර්මයෝ අනාත්මයෝ යි.",
                "type": "paragraph"
            },
            {
                "text": "‘මනෝවිඥානය ආත්ම යැ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. මනෝවිඥානයාගේ උත්පාදයත් ව්‍යයත් පැනෙයි. යමක්හුගේ උත්පාදයත් ව්‍යයත් පැනේ නම් ‘මාගේ ආත්මය උපදනේත් නැසෙන්නේත් වේ’ යයි මෙසේ දෘෂ්ටිය ආයේ වෙයි. එහෙයින් ‘මනෝවිඥානය ආත්ම යැ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. මෙසේ මනස අනාත්ම යැ, ධර්මයෝ අනාත්ම වෙති, මනෝවිඥානය අනාත්ම යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "589"
            },
            {
                "text": "‘මනස්සංස්පර්ශය ආත්ම යැ’ යි යමෙක් කියා නම් එය නොයෙදෙයි. මනෝසම්ඵස්සයාගේ උත්පාදයත් ව්‍යයත් පැනෙයි. යමක්හුගේ උත්පාදයත් ව්‍යයත් පැනේ නම් ‘මාගේ ආත්මය උපදනේත් නැසෙන්නේත් වේ’ යයි මෙසේ දෘෂ්ටිය ආයේ වෙයි. එහෙයින් ‘මනෝසම්ඵස්සය ආත්ම යැ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. මනස අනාත්ම යැ, ධර්මයෝ අනාත්ම වෙති, මනෝවිඥානය අනාත්ම යැ, මනෝසම්ඵස්සය අනාත්ම යි.",
                "type": "paragraph"
            },
            {
                "text": "‘වේදනාව ආත්ම යැ’ යි යමෙක් කියා නම් එය නොයෙදෙයි. වේදනාවගේ උත්පාදයත් ව්‍යයත් පැනෙයි. ‘මාගේ ආත්මය උපදනේත් නැසෙන්නේත් වේ’ යයි මෙසේ දෘෂ්ටිය ආයේ වෙයි. එහෙයින් ‘වේදනාව ආත්ම යැ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. මෙසේ මනස අනාත්ම යැ, ධර්මයෝ අනාත්ම වෙති, මනෝවිඥානය අනාත්ම යැ, මනෝසම්ඵස්සය අනාත්ම යැ, වේදනා අනාත්ම යි.",
                "type": "paragraph"
            },
            {
                "text": "‘තෘෂ්ණාව ආත්ම යැ’ යි යමෙක් කියා නම් එය නොයෙදෙයි. යමක්හුගේ උත්පාදයත් ව්‍යයත් පැනේ නම් ‘මාගේ ආත්මය උපදනේත් නැසෙන්නේත් වේ’ යයි මෙසේ දෘෂ්ටිය ආයේ වෙයි. එහෙයින් ‘තෘෂ්ණාව ආත්ම යැ’ යි යමෙක් කියා නම් එය නො යෙදෙයි. මෙසේ මනස අනාත්ම යැ, ධර්මයෝ අනාත්මයහ, මනෝවිඥානය අනාත්ම යැ, මනෝසම්ඵස්සය අනාත්ම යැ, වේදනා අනාත්ම යැ, තෘෂ්ණාව අනාත්ම යි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මේ වැළිත් සත්කායසමුදයගාමිනී ප්‍රතිපත් වෙයි: චක්ෂුස ‘තෙල මාගේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්මයැ’ යි තෘෂ්ණාදී විසින් දකී. රූපයන් ‘තෙල මාගේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි තෘෂ්ණාදී විසින් දකී. චක්ෂුර්විඥානය ‘තෙල මාගේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි දකී. චක්ෂුර්සංස්පර්ශය ‘තෙල මාගේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි දකී. වේදනාව ‘තෙල මාගේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි දකී. තෘෂ්ණාව ‘තෙල මාගේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි දකී. ශ්‍රොතය ‘තෙල මාගේ යැ’ ... ඝ්‍රාණය ‘තෙල මාගේ යැ’ ... ජිහ්වාව ‘තෙල මාගේ යැ’ ... කය ‘තෙල මාගේ යැ’ ... මනස ‘තෙල මාගේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි තෘෂ්ණාදි විසින් දකී. ධර්මයන් ‘තෙල මාගේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි දකී. මනෝවිඥානය ‘තෙල මාගේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි දකී. මනෝසම්ඵස්සය ‘තෙල මාගේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි දකී. වේදනාව ‘තෙල මාගේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි දකී. තෘෂ්ණාව ‘තෙල මාගේ යැ, තෙලෙ මම් වෙමි, තෙලෙ මාගේ ආත්ම යැ’ යි තෘෂ්ණාදි විසින් දකී.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මේ සත්කායනිරොධගාමිනී ප්‍රතිපත් වෙයි: චක්ෂුස ‘තෙල මාගේ නො වෙයි, තෙලෙ මම් නො වෙමි, තෙලෙ මාගේ ආත්මය නො වේ’ යයි අනිත්‍යාදි විසින් දකී. රූපයන් ‘තෙල මාගේ නො වෙයි, තෙලෙ මම් නො වෙමි, තෙලෙ මාගේ ආත්මය නො වේ’ යයි අනිත්‍යාදි විසින් දකී. චක්ෂුර්විඥානය ‘තෙල මාගේ නො වෙයි, තෙලෙ මම් නො වෙමි, තෙලෙ මාගේ ආත්මය නො වේ’ යයි දකී. චක්ෂුර්සංස්පර්ශය ‘තෙල මාගේ නො වෙයි, තෙලෙ මම් නො වෙමි, තෙලෙ මාගේ ආත්මය නො වේ’ යයි දකී. වේදනාව ‘තෙල මාගේ නො වෙයි, තෙලෙ මම් නො වෙමි, තෙලෙ මාගේ ආත්මය නො වේ’ යයි දකී. තෘෂ්ණාව ‘තෙල මාගේ නො වෙයි, තෙලෙ මම් නො වෙමි, තෙලෙ මාගේ ආත්මය නො වේ’ යයි දකී. ශ්‍රොතය ‘තෙල මාගේ නො වෙයි’ ... ඝ්‍රාණය ‘තෙල මාගේ නො වෙයි’ ... ජිහ්වාව ‘තෙල මාගේ නො වෙයි’ ... කය ‘තෙල මාගේ නො වෙයි’ ... මනස ‘තෙල මාගේ නො වෙයි, තෙලෙ මම් නො වෙමි, තෙලෙ මාගේ ආත්මය නො වේ’ යයි දකී. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "591"
            },
            {
                "type": "paragraph",
                "text": "ධර්මයන් ‘තෙල මාගේ නො වෙයි, තෙලෙ මම් නො වෙමි, තෙලෙ මාගේ ආත්මය නො වේ’ යයි දකී. මනෝවිඥානය ‘තෙල මාගේ නො වෙයි, තෙලෙ මම් නො වෙමි, තෙලෙ මාගේ ආත්මය නො වේ’ යයි දකී. මනෝසම්ඵස්සය ‘තෙල මාගේ නො වෙයි, තෙලෙ මම් නො වෙමි, තෙලෙ මාගේ ආත්මය නො වේ’ යයි දකී. වේදනාව ‘තෙල මාගේ නො වෙයි, තෙලෙ මම් නො වෙමි, තෙලෙ මාගේ ආත්මය නො වේ’ යයි දකී. තෘෂ්ණාව ‘තෙල මාගේ නො වෙයි, තෙලෙ මම් නො වෙමි, තෙලෙ මාගේ ආත්මය නො වේ’ යයි අනිත්‍යාදි විසින් දකී."
            },
            {
                "text": "මහණෙනි, චක්ෂුසත් රූපත් නිසා චක්ෂුර්විඥානය උපදී. (චක්ෂු, රූප, විඥාන යන) තිදෙනාගේ සඞ්ගතිය ඵස්ස වෙයි. ස්පර්ශ ප්‍රත්‍යයෙන් සුඛ වූ හෝ දුඃඛ වූ හෝ උපේක්ෂා වූ හෝ වේදනාව උපදී. හේ සුඛවේදනායෙන් පහස්නාලදුයේ සතුටු වෙයි. සතුටුබස් කියයි. බැසගෙන සිටී. ඔහුගේ සන්තානයෙහි රාගානුසය අප්‍රහීණ වැ සිටී. දුඃඛ වේදනායෙන් පහස්නාලදුයේ ශොක කෙරෙයි, වෙහෙසෙයි, පරිවේදනා කෙරෙයි, ළෙහි පැහැර හඬයි, සම්මොහයට පැමිණෙයි. ඔහුගේ සන්තානයෙහි ප්‍රතිඝානුශය අප්‍රහීණ වැ සිටී. උපේක්ෂාවේදනායෙන් පහස්නාලදුයේ ඒ වේදනාවගේ සමුදය ද අස්තඞ්ගමය ද ආස්වාදය ද ආදීනවය ද නිස්සරණය ද ඇතිසැටි නො දනී. ඔහුගේ සන්තානයෙහි අවිද්‍යානුශය අප්‍රහීණ වැ සිටී. මහණෙනි, ඒකාන්තයෙන් හෙතෙම සුඛවේදනායෙන් රාගානුශය දුරු නො කොට දුඃඛවේදනායෙන් ප්‍රතිඝානුශය විනොදනය නො කොට අදුඃඛමසුඛවේදනායෙන් අවිද්‍යානුශය සමුද්ඝාතනය නො කොට අවිද්‍යාව ප්‍රහීණ නො කොට මාර්ගඥානවිද්‍යාව නූපදවා ඉහාත්මයෙහි මැ වට්ටදුක්ඛය කෙළවර කරන්නේ ය යන තෙල කරුණ නො වේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, ශ්‍රොතය ද නිසා ශබ්දයන් ද නිසා ශ්‍රොතවිඥාන උපදී. ... ඝ්‍රාණය ද නිසා ගන්ධයන් ද නිසා ... ජිහ්වාව ද රසයන් ද නිසා … කාය ද ස්ප්‍රෂ්ටව්‍යයන් ද නිසා ... මනස ද ධර්මයන් ද නිසා මනෝවිඥාන උපදී. තිදෙනාගේ සඞ්ගතිය ස්පර්ශ නමි, ස්පර්ශප්‍රත්‍යයෙන් සුව වූ හෝ දුක් වූ හෝ නො දුක් නො සුව වූ හෝ වේදනාව උපදී. හේ සුඛවේදනායෙන් පහස්නා ලදුයෙ සතුටු වෙයි. තුටුවදන් බෙණෙයි. බැසගෙන සිටී. ඔහුට රාගානුශය අප්‍රහීණ වෙයි. දුඃඛවේදනායෙන් පහස්නාලදුයේ ශෝක කෙරෙයි, වෙහෙසෙයි, පරිදේවනා කෙරෙයි, ළෙහි පැහැර හඬයි, සම්මොහයට පැමිණෙයි. ඔහුට ප්‍රතිඝානුශය අප්‍රහීණ වැ සිටී. නො දුක් නො සුව වේදනායෙන් පහස්නාලදුයේ ඒ වේදනාවගේ සමුදය ද අස්තඞ්ගමය ද ආස්වාදය ද ආදීනවය ද නිස්සරණය ද ඇතිසැටි නො දනී. ඔහුට අවිද්‍යානුශය අප්‍රහීණ වැ සිටී. මහණෙනි, ඒකාන්තයෙන් හෙතෙම සුඛවේදනායෙන් රාගානුශය දුරු නො කොට දුඃඛවේදනායෙන් ප්‍රතිඝානුශය බැහැර නො කොට අදුඃඛමසුඛ වේදනායෙන් අවිද්‍යානුශය සමූහනය නො කොට අවිද්‍යාව ප්‍රහීණ නො කොට විද්‍යාව නූපදවා ‘ඉහාත්මයෙහි මැ දුක් කෙළවර කරන්නේ වෙයි’ යන තෙල කරුණ නො වන්නේ යැ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, ඇසත් රූපත් නිසා චක්ෂුර්විඥානය උපදී. ඒ චක්ෂුරාදි තිදෙනාගේ සඞ්ගතිය ස්පර්ශ නමි. ස්පර්ශ හේතුයෙන් සුඛ වූ හෝ දුක්ඛ වූ හෝ අදුක්ඛඅසුඛ වූ හෝ වේදනා උපදී. හේ සුඛවේදනායෙන් පහරන ලදුව අභිනන්දන නො කෙරෙයි, තෘෂ්ණා වශයෙන් ගෙන නො බෙණෙයි. ගැලගෙන නො සිටී. ඔහුගේ රාගානුශය අනුශය වශයෙන් නො සිටී. දුඃඛවේදනායෙන් පහරනලදුවැ ශොක නො කෙරෙයි, ක්ලාන්ත නො වෙයි, පරිදේවනා නො කෙරෙයි, ළෙහි අත්පැහැර නො හඬයි, සම්මොහයට නො පැමිණෙයි, ඔහුගේ ප්‍රතිඝානුශය අනුශය නො කෙරෙයි. උපෙක්ෂාවේදනායෙන් පහරනලදුවැ ඒ වේදනාවගේ සමුදය හා අස්තඞ්ගමය හා ආස්වාදය හා ආදීනවය හා නිස්සරණය හා ඇති සැටි නුවණින් දනී. ඔහුගේ අවිද්‍යානුශය අනුශය නො කෙරෙයි. මහණෙනි, මෙසේ ඒ මහණ සුඛවේදනායෙහි රාගානුශය පියා දුඃඛවේදනායෙහි ප්‍රතිඝානුශය අනුශය දුරු කොට උපෙක්ෂාවේදනායෙහිලා අවිද්‍යානුශය නසා අවිද්‍යාව හැර විද්‍යාව උපයා ‘ඉහාත්මයෙහි මැ දුක් කෙළවර කරනු වෙයි’ යන මෙ කරුණ වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "593"
            },
            {
                "text": "මහණෙනි, ශ්‍රොතය ද නිසා ශබ්දයනුදු නිසා ශ්‍රොතවිඥාන උපදී. ... මහණෙනි, ඝ්‍රාණය ද නිසා ගන්ධයනුදු නිසා ඝ්‍රාණවිඥාන උපදී. ... මහණෙනි, ජිහ්වාවද නිසා රසයනුදු නිසා ජිහ්වාවිඥාන උපදී. ... මහණෙනි, කය ද නිසා ස්ප්‍රෂ්ටව්‍යයනුදු නිසා කායවිඥාන උපදී. ... මහණෙනි, මනස ද නිසා ධර්මයනුදු නිසා මනෝවිඥාන උපදී. තුන්දෙනාගේ සඞ්ගතිය ස්පර්ශ නමි. ස්පර්ශ හේතුයෙන් සුඛ වූ හෝ දුඃඛ වූ හෝ උපෙක්ෂා සහගත වූ හෝ වේදනා උපදී. හේ සුඛවේදනායෙන් පහරන ලදුවැ තෘෂ්ණා විසින් අභිනන්දන නො කෙරෙයි. තෘෂ්ණා විසින් නො බෙණෙයි. ගැලගෙන නො සිටී. ඔහුගේ රාගානුශය අනුශයන නො කෙරෙයි. හේ දුඃඛ වේදනායෙන් පහරන ලදු වැ … හේ උපෙක්ෂාසහගත වේදනායෙන් පහළේ ඒ වේදනායෙහි ලා සමුදය හා අස්තඞ්ගමය හා ආස්වාදය හා ආදීනවය හා නිස්සරණය හා ඇති සැටි නුවණින් දනී. ඔහුගේ අවිද්‍යානුශය අනුශය නො කෙරෙයි. මහණෙනි, ඒ මහණ සුඛවේදනායෙහි ලා රාගානුශය පියා දුඃඛවේදනායෙහි ලා ප්‍රතිඝානුශය හැර උපෙක්ෂාවේදනායෙහි ලා අවිද්‍යානුශය නසා අවිද්‍යාව පියා විද්‍යාව උපයා ‘මෙ වත්මනු බෙවෙහි මැ දුක් කෙළවර කරනු වෙති’ යි මෙ කරුණ වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මෙසේ දක්නා ශ්‍රැතවත් ආර්‍ය්‍යශ්‍රාවක තෙමේ චක්ෂුසෙහි කලකිරෙයි, රූපයෙහි කලකිරෙයි, චක්ෂුර්විඥානයෙහි කලකිරෙයි. චක්ෂුස්සංස්පර්ශයෙහි කලකිරෙයි. වේදානයෙහි කලකිරෙයි. තෘෂ්ණායෙහි කලකිරෙයි. ශ්‍රොතයෙහි කලකිරෙයි. ශබ්දයෙහි කලකිරෙයි ... ජිහ්වායෙහි කලකිරෙයි. රසයෙහි කලකිරෙයි. ... කයෙහි කල කිරෙයි. ස්පර්ශයෙහි කලකිරෙයි. ... මනසෙහි කලකිරෙයි. ධර්මයෙහි කල කිරෙයි. මනෝවිඥානයෙහි කලකිරෙයි, මනඃසංස්පර්ශයෙහි කලකිරෙයි, වෙදානයෙහි කලකිරෙයි, තෘෂ්ණායෙහි කලකිරෙයි. කලකිරෙනුයේ විරාගයට පැමිණෙයි. විරාගහේතුයෙන් මිදෙයි. මිදීයත් මැ ‘මිදිණැ’ යි ඥානය වෙයි. ජාතිය ක්ෂීණ විය, බඹසර වැස නිමවනලද, කරණී කරනලද, ‘මේ අර්හත්ත්වය පිණිස අන් කරණී නැති’ යි නුවණින් දනී.",
                "type": "paragraph"
            },
            {
                "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළසේක. සතුටුසිත් ඇති ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ භාෂිතය සතුටින් පිළිගත්හ. මේ විභාගධර්මය බණත් මැ සැටක් පමණ මහණුන්ගේ සිත් උපාදාන වශයෙන් නො ගෙන ආස්‍රවයන්ගෙන් මිදිණි.",
                "type": "paragraph"
            },
            {
                "text": "සවන ඡ ඡක්ක සූත්‍ර යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "595"
            },
            {
                "type": "centered",
                "text": "3.5.7",
                "level": 1
            },
            {
                "type": "heading",
                "text": "මහාසළායතනික සූත්‍රය",
                "level": 1
            },
            {
                "text": "මා විසින් මෙසේ අසනලද: එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත්නුවර අනේපිඬු සිටුහුගේ දෙව්රම්වෙහෙර වැඩවාසය කරණ සේක. එසමයෙහි භාග්‍යවතුන් වහන්සේ ‘මහණෙනි’යි භික්ෂූන් ඇමතූසේක. ‘වහන්සැ’යි ඒ මහණහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හු. භාග්‍යවතුන් වහන්සේ තෙල වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, තොපට මහාෂඩායතන පර්යාය දෙසමි. එය අසව, මනාකොට මෙනෙහි කරව, කියමි’යි.",
                "type": "paragraph"
            },
            {
                "text": "‘වහන්ස, එසේ යැ’යි ඒ මහණහු භාග්‍යවතුන් වහන්සේට පිළිවදන් අස්වූහු, භාග්‍යවතුන් වහන්සේ තෙල මහාෂඩායතනපර්යාය වදාළෝ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, චක්ෂුස ඇති සැටි මාර්ගඥානයෙන් නො දන්මින් නො දක්මින් රූපයන් ඇති සැටි නො දන්මින් නො දක්මින් චක්ෂුර්විඥානය ඇති සැටි නො දන්මින් නො දක්මින් චක්ෂුස්සංස්පර්ශය ඇති සැටි නො දන්මින් නො දක්මින් සුඛ වේවයි දුඃඛ වේවයි උපේක්ෂාසහගත වේවයි චක්ෂුස්සංස්පර්ෂය හේතුයෙන් යම් වෙදයිතයෙක් උපදනේ නම් එ ද ඇති සැටි නො දන්මින් නො දක්මින් චක්ෂුසෙහි සංරාග කෙරෙයි, රූපයෙහි සංරාග කෙරෙයි, චක්ෂුර්විඥානයෙහි සංරාග කෙරෙයි, චක්ෂුස්සංස්පර්ෂය සංරාග කෙරෙයි, සුඛ වේවයි දුඃඛ වේවයි උපේක්ෂාසහගත වේවයි චක්ෂුඃසංස්පර්ෂය හේතුයෙන් යම් වේදයිතයෙක් උපදනේ නම් එහිදු ඇලේ.",
                "type": "paragraph"
            },
            {
                "text": "සංරක්ත වැ සංයුක්ත වැ සම්මූඪ වැ ආස්වාද දක්මින් විහරණ කරණ ඔහුගේ මතු පඤ්චඋපාදානස්කන්ධයෝ උපචයට යෙති. ඔහුගේ පුනර්භවය පිණිස වැටෙන නන්දිරාග සහගත වූ ඒ ඒ තන්හි අභිනන්දන කරන තෘෂ්ණායෙක් ඇද්ද, ඔහුට ඒ තෘෂ්ණා ද වෙසෙසින් වැඩෙයි. ඔහුගේ කායදරථයෝ ද වැඩෙති, චෛතසිකරථයෝ ද වැඩෙති. කායික සන්තාපයෝ ද වැඩෙති, චෛතසිකසන්තාපයෝ ද වැඩෙති. කායිකපරිදාහයෝ ද වැඩෙති. චෛතසිකයෝ ද වැඩෙත්. හෙ කායදුඃඛය විඳුනේ යැ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, ශ්‍රෝත්‍රය මාර්ගඥානයෙන් ඇති සැටි නො දන්මින් නො දක්මින් …. මහණෙනි, ඝ්‍රාණය ඇති සැටි නො දන්මින් නො දක්මින් …. මහණෙනි, ජිහ්වාව ඇති සැටි නො දන්මින් නො දක්මින් … මහණෙනි, කය ඇති සැටි නො දන්මින් නො දක්මින් … මහණෙනි, මනස ඇති සැටි නො දන්මින් නො දක්මින් ධර්මයන් යථාභූත වැ නො දන්මින් නො දක්මින් මනෝවිඥානය යථාභූත වැ නො දන්මින් නො දක්මින් මනෝසම්ඵස්සය යථාභූත වැ නො දන්මින් නො දක්මින් මනෝසම්ඵස්ස හේතුයෙන් සුව වේවයි දුක් වේවයි නො දුක් නො සුව වේවයි යම් වේදනාවක් උපදී ද, එ ද යථාභූත ව නො දන්මින් නො දක්මින් මනසෙහි රාග විසින් ඇලෙයි, ධර්මයන්හි ඇලෙයි, මනෝ විඥානයෙහි ඇලෙයි, මනෝසම්ඵස්සයෙහි ඇලෙයි, මනෝසම්ඵස්ස හේතුයෙන් සුව වේවයි දුක් වේවයි නො දුක් නො සුව වේවයි යම් වේදනාවක් උපදී ද, එහිදු රාග විසින් ඇලේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "597"
            },
            {
                "text": "සංරක්ත වැ සංයුක්ත වැ සම්මූඪ වැ ආස්වාද වශයෙන් දක්මින් වෙසෙන ඔහුට මතු පඤ්චෝපාදානස්කන්ධයෝ උපචයට යෙති. ඔහුගේ පුනර්භවය පිණිස වැටෙන නන්දිරාග සහගත වූ ඒ ඒ තන්හි අභිනන්දනා කරණ තෘෂ්ණායෙක් ඇද්ද, ඔහුට ඒ තෘෂ්ණා ද වෙසෙසින් වැඩෙයි. ඔහුට පඤ්චද්වාරික දරථයෝ ද වෙසෙසින් වැඩෙති, මනොද්වාරික දරථයෝ ද වෙසෙසින් වැඩෙති, පඤ්චද්වාරික සන්තාපයෝ ද වැඩෙති, මනොද්වාරික සන්තාපයෝ ද වැඩෙති, පඤ්චද්වාරික පරිදාහයෝ ද වැඩෙති, මනොද්වාරික පරිදාහයෝ ද වැඩෙත්. හෙ පඤ්චද්වාරික දුඃඛය ද මනොද්වාරික දුඃඛය ද විඳී.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, චක්ෂුස යථාභූත වැ දන්මින් දක්මින් රූපයන් යථාභූත වැ දන්මින් දක්මින් චක්ෂුර් විඥානය යථාභූත වැ දන්මින් දක්මින් චක්ඛුසම්ඵස්සය යථාභූත වැ දන්මින් දක්මින් චක්ඛුසම්ඵස්ස හේතුයෙන් සුව වේවයි දුක් වේවයි නො දුක් නො සුව වේවයි යම් වේදනාවක් උපදී ද, එ ද යථාභූත වැ දන්මින් දක්මින් චක්ෂුසෙහි නො ඇලෙයි. රූපයන්හි නො ඇලෙයි. චක්ෂුර්විඥානයෙහි නො ඇලෙයි. චක්ඛුසම්ඵස්සයෙහි නො ඇලෙයි. චක්ඛුසම්ඵස්ස හේතුයෙන් සුව වේවයි දුක් වේවයි නො දුක් නො සුව වේවයි යම් වේදනාවක් උපදී ද, එහිදු නො ඇලේ.  ",
                "type": "paragraph"
            },
            {
                "text": "අසංරක්ත වැ අසංයුක්ත වැ අසම්මුඪ වැ ආදීනව දක්මින් වාස කරණ ඔහුට මතු පඤ්චෝපාදානස්කන්ධයෝ අපචයට යෙති. ඔහුගේ පුනර්භවය ඇති කරන නන්දිරාග සහගත වූ ඒ ඒ භවයෙහි අභිනන්දනා කරන යම් තෘෂ්ණාවක් ඇද්ද, ඔහුට ඒ තෘෂ්ණාව ද ප්‍රහීණ වෙයි. ඔහුට පඤ්චද්වාරික දරථයෝ ද ප්‍රහීණ වෙති, මනොද්වාරික දරථයෝ ද  ප්‍රහීණ වෙති, පඤ්චද්වාරික සන්තාපයෝ ද ප්‍රහීණ වෙති, මනොද්වාරික සන්තාපයෝ ද ප්‍රහීණ වෙති, පඤ්චද්වාරික පරිදාහයෝ ද ප්‍රහීණ වෙති, මනොද්වාරික පරිදාහයෝ ද ප්‍රහීණ වෙත්. හේ පඤ්චද්වාරික සුඛය ද මනොද්වාරික සුඛය ද විඳී.",
                "type": "paragraph"
            },
            {
                "text": "එබඳු වූවහුගේ යම් දෘෂ්ටියක් ඇද්ද, ඒ දෘෂ්ටිය ඔහුට සම්‍යග්දෘෂ්ටි වෙයි. එබඳු වූවහුගේ යම් සංකල්පයෙක් ඇද්ද, ඒ සංකල්පය ඔහුට සම්‍යක්සංකල්ප වෙයි. එබඳු වූවහුගේ යම් ව්‍යායාමයෙක් ඇද්ද, ඒ ව්‍යායාමය ඔහුට සම්‍යග්ව්‍යායාම වෙයි. එබඳු වූවහුගේ යම් ස්මෘතියක් ඇද්ද, ඒ ස්මෘතිය ඔහුට සම්‍යක්ස්මෘති වෙයි. එබඳු වූවහුගේ යම් සමාධියෙක් ඇද්ද, ඒ සමාධිය ඔහුට සම්‍යක් සමාධි වෙයි. ඒ මහණහුගේ කායකර්මය ද වාක්කර්මය ද ආජීවය ද කැල මැ සුපරිශුද්ධ වේ. මෙසේ ඒ මහණහට මේ ආර්යඅෂ්ටාඞ්ගික මාර්ගය භාවනායෙන් වැඩීමට යේ.",
                "type": "paragraph"
            },
            {
                "text": "මෙසේ මේ ආර්යඅෂ්ටාඞ්ගික මාර්ගය වඩන ඒ මහණහට සතර සතිපට්ඨානයෝ ද භාවනායෙන් පිරීමට යෙති. සතර සම්‍යක් ප්‍රධානයෝ ද භාවනායෙන් පිරීමට යෙති, සතර ඍද්ධිපාදයෝ ද භාවනායෙන් පිරීමට යෙති. පඤ්චෙන්ද්‍රියෝ ද භාවනායෙන් පිරීමට යෙති. පඤ්ච බලයෝ භාවනායෙන් පිරීමට යෙති. සප්ත බොධ්‍යඞ්ගයෝ ද භාවනායෙන් පිරීමට යෙත්.",
                "type": "paragraph"
            },
            {
                "text": "ඔහුට ශමථය ද විදර්ශනා ද යන මේ ධර්මයෝ දෙදෙන යුගනද්ධ වැ පවත්නාහ. හෙතෙම යම් ධර්ම කෙනෙක් අභිඥායෙන් පිරිසිඳ දතයුත්තාහු ද, ඒ ධර්මයන් අභිඥායෙන් පිරිසිඳ දැනගනී. යම් ධර්ම කෙනෙක් අභිඥායෙන් ප්‍රහාතව්‍ය වෙත් ද, ඒ ධර්මයන් අභිඥායෙන් දුරු කෙරෙයි. යම් ධර්ම කෙනෙක් අභිඥායෙන් භාවිතව්‍ය වෙත් ද, ඒ ධර්මයන් අභිඥායෙන් වඩයි, යම් ධර්ම කෙනෙක් අභිඥායෙන් ප්‍රත්‍යක්ෂ කටයුත්තාහු වෙත් ද, ඒ ධර්මයන් අභිඥායෙන් ප්‍රත්‍යක්ෂ කෙරේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, කවර ධර්ම කෙනෙක් අභිඥායෙන් පරිඥෙය වෙත් ද යත්: ‘පඤ්චෝපාදානස්කන්ධයෝ’ යයි ඊට පිළිතුරු කියයුතු වෙයි. ඒ මෙසේ යැ. රූපෝපාදානස්කන්ධ යැ වෙදනොපාදානස්කන්ධ යැ සංඥොපාදානස්කන්ධ යැ සංස්කාරෝපාදානස්කන්ධ යැ විඥානෝපාදානස්කන්ධ යි. මේ ධර්මයෝ අභිඥායෙන් පරිඥෙය වෙත්. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "599"
            },
            {
                "text": "මහණෙනි, කවර ධර්ම කෙනෙක් අභිඥායෙන් ප්‍රහාතව්‍ය වෙත් ද යත්: අවිද්‍යාව ද භවතෘෂ්ණාව ද යන මේ ධර්මයෝ අභිඥායෙන් ප්‍රභාතව්‍ය වෙති.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, කවර ධර්ම කෙනෙක් අභිඥායෙන් භාවිතව්‍ය වෙත් ද යත්: ශමථය ද විදර්ශනාව ද යන මේ ධර්මයෝ අභිඥායෙන් භාවිතව්‍ය වෙති.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, කවර ධර්ම කෙනෙක් අභිඥායෙන් ප්‍රත්‍යක්ෂ කටයුත්තාහු ද යත්: විද්‍යාව ද විමුක්තිය ද යන මේ ධර්මයෝ අභිඥායෙන් ප්‍රත්‍යක්ෂ කටයුත්තාහු වෙත්.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, ශ්‍රොත්‍රය යථාභූත කොට දන්මින් දක්මින් ... මහණෙනි, ඝ්‍රාණය යථාභූත වැ දන්මින් දක්මින් … මහණෙනි, ජිහ්වාව යථාභූත වැ දන්මින් දක්මින් …මහණෙනි, කය යථාභූත වැ දන්මින් දක්මින් … මහණෙනි, මනස යථාභූත වැ දන්මින් දක්මින් ධර්මයන් යථාභූත වැ දන්මින් දක්මින් මනෝවිඥානය යථාභූත වැ දන්මින් දක්මින් මනෝසම්ඵස්සය යථාභූත වැ දන්මින් දක්මින් මනෝසම්ඵස්ස හේතුයෙන් සුව වූ හෝ දුක් වූ හෝ නො දුක් නො සුව වූ හෝ යම් වේදනාවක් උපදී ද, එ ද යථාභූත වැ දන්මින් දක්මින් මනසෙහි නො ඇලෙයි. ධර්මයන්හි නො ඇලෙයි, මනෝවිඥානයෙහි නො ඇලෙයි, මනෝසම්ඵස්සයෙහි නො ඇලෙයි. මනෝසම්ඵස්ස හේතුයෙන් සුව වූ හෝ දුක් වූ හෝ නො දුක් නො සුව වූ හෝ යම් වේදනාවක් උපදී ද, එහිදු නො ඇලේ.",
                "type": "paragraph"
            },
            {
                "text": "අසංරක්ත වැ අසංයුක්ත වැ අසම්මුඪ වැ ආදීනවානුදර්ශී වැ වෙසෙන ඔහුට මතුයෙහි පඤ්චෝපාදානස්කන්ධයෝ අපචයට යෙති. ඔහුගේ පුනර්භවික වූ නන්දිරාග සහගත වූ ඒ ඒ භවයෙහි අභිනන්දනා කරණ තෘෂ්ණාවක් ඇද්ද, ඔහුට ඒ තෘෂ්ණාව ද ප්‍රහීණ වෙයි. ඔහුට පඤ්චද්වාරික දරථයෝ ද ප්‍රහීණ වෙති. මනෝද්වාරික දරථයෝ ද ප්‍රහීණ වෙති. පඤ්චද්වාරික සන්තාපයෝ ද ප්‍රහීණ වෙති. මනෝද්වාරික සන්තාපයෝ ද ප්‍රහීණ වෙති. පඤ්චද්වාරික පරිදාහයෝ ද ප්‍රහීණ වෙති. මනෝද්වාරික පරිදාහයෝ ද ප්‍රහීණ වෙත්, හේ පඤ්චද්වාරික සුඛය ද මනෝද්වාරික සුඛය ද විඳී.",
                "type": "paragraph"
            },
            {
                "text": "එබඳු මහණහු ගේ යම් දෘෂ්ටියක් ඇද්ද, එය ඔහුට සම්‍යග්දෘෂ්ටි වෙයි. එබඳු වූවහුගේ යම් සංකල්පයෙක් ඇද්ද, ඒ සංකල්පය ඔහුට සම්‍යක්සංකල්ප වෙයි. එබඳු වූවහු ගේ යම් ව්‍යායාමයෙක් ඇද්ද, එය ඔහුට සම්‍යග්ව්‍යායාම වෙයි. එබඳු වූවහුගේ යම් ස්මෘතියක් ඇද්ද, ඒ ඔහුට සම්‍යක්ස්මෘති වෙයි. එබඳු වූවහුගේ යම් සමාධියෙක් ඇද්ද, එය ඔහුට සම්‍යක් සමාධි වෙයි. ඔහුට කායකර්මය ද වාක්කර්මය ද ආජීවය ද කැල මැ සුපරිශුද්ධ වෙයි. මෙසේ ඔහුට මේ ආර්යය අෂ්ටාඞ්ගික මාර්ගය භාවනායෙන් වැඩීමට යේ.",
                "type": "paragraph"
            },
            {
                "text": "මෙසේ මේ ආර්යය අෂ්ටාඞ්ගික මාර්ගය වඩන ඔහුට සතර සතිපට්ඨානයෝ ද භාවනායෙන් පිරීමට යෙති. සතර සම්‍යක් ප්‍රධානයෝ ද වැඩීමෙන් පිරීමට යෙති. සතර ඍද්ධිපාදයෝ ද වැඩීමෙන් පිරීමට යෙති. පඤ්ච ඉන්ද්‍රියයෝ  ද වැඩීමෙන් පිරීමට යෙති. පඤ්ච බලයෝ ද වැඩීමෙන් පිරීමට යෙති. සප්ත බොධ්‍යඞ්ගයෝ ද වැඩීමෙන් පිරීමට යෙත්.",
                "type": "paragraph"
            },
            {
                "text": "ඔහුට ශමථ ද විදර්ශනා ද යන මේ ධර්මයෝ දෙදෙන යුගනද්ධ වැ වැඩෙති. හේ යම් ධර්ම කෙනෙක් ප්‍රඥායෙන් පිරිසිඳ දතයුත්තාහු ද, ඒ ධර්මයන් ප්‍රඥායෙන් පිරිසිඳ දැනගනී. යම් ධර්ම කෙනෙක් අභිඥායෙන් ප්‍රහාතව්‍ය වෙත්  ද, ඒ ධර්මයන් අභිඥායෙන් ප්‍රහීණ කෙරෙයි. යම් ධර්ම කෙනෙක් අභිඥායෙන් භාවිතව්‍ය වෙත් ද, ඒ ධර්මයන් අභිඥායෙන් භාවනා කෙරෙයි. යම් ධර්ම කෙනෙක් අභිඥායෙන් සාක්ෂාත් කර්තව්‍ය වෙත් ද, ඒ ධර්මයන් අභිඥායෙන් සාක්ෂාත් කෙරේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "601"
            },
            {
                "text": "මහණෙනි, කවර ධර්ම කෙනෙක් අභිඥායෙන් පරිඥේය වෙති යත්: ‘පඤ්චෝපාදානස්කන්ධයෝ’ යයි ඊට කියැයුතු යැ. ඒ මෙසේ යැ: රූපෝපාදානස්කන්ධ යැ. වෙදනොපාදානස්කන්ධ යැ. සංඥොපාදානස්කන්ධ යැ. සංස්කාරෝපාදානස්කන්ධ යැ. විඥානෝපාදානස්කන්ධයි. මේ ධර්මයෝ අභිඥායෙන් පරිඥෙය වෙති.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, කවර ධර්ම කෙනෙක් අභිඥායෙන් ප්‍රහාතව්‍ය වෙති යත්: අවිද්‍යාව ද භවතෘෂ්ණාව ද යන මේ ධර්මයෝ අභිඥායෙන් ප්‍රහාතව්‍ය වෙති.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, කවර ධර්ම කෙනෙක් අභිඥායෙන් භාවිතව්‍ය වෙති යත්: ශමථ ද විදර්ශනා ද යන මේ ධර්මයෝ අභිඥායෙන් භාවිතව්‍ය වෙති.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, කවර ධර්ම කෙනෙක් අභිඥායෙන් සාක්ෂාත් කර්තව්‍ය වෙති යත්: විද්‍යා ද විමුක්ති ද යන මේ ධර්මයෝ අභිඥායෙන් සාක්ෂාත් කර්තව්‍ය වෙත්.",
                "type": "paragraph"
            },
            {
                "text": "භාග්‍යවතුන් වහන්සේ මේ මහාෂඩායතනික සුත්‍රය වදාළ සේක. සතුටු සිත් ඇති ඒ වහන්දෑ භාග්‍යවතුන් වහන්සේගේ භාෂිතය අභිනන්දනා කළෝ.",
                "type": "paragraph"
            },
            {
                "text": "සත් වැනි මහාසළායතනික සූත්‍ර යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "603"
            },
            {
                "type": "centered",
                "text": "3.5.8",
                "level": 1
            },
            {
                "type": "heading",
                "text": "නගරවින්දෙය්‍ය සූත්‍රය",
                "level": 1
            },
            {
                "text": "මා විසින් මෙසේ අසන ලද: එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ මහාභික්ෂු සංඝයා සමග කොසොල් ජනපදයෙහි චාරිකා කරන සේක් කොසොල්රට නගරවින්ද නම් බමුණුගමට වැඩිසේක. නගරවින්දයෙහි වැසි බමුණු ගැහැවියෝ මේ ඇසූහ: ‘ශාක්‍ය පුත්‍ර වූ ශාක්‍ය කුලයෙන් නික්මැ පැවිදි වූ ශ්‍රමණ භවත් ගෞතමයන් වහන්සේ මහාභික්ෂු සංඝයා සමග කොසොල් ජනපදයෙහි චාරිකා කරන සේක් නගරවින්දයට පැමිණි සේක. ඒ භවත් ගෞතමයන් වහන්සේගේ මෙබඳු කල්‍යාණ කීර්තිශබ්දය උස් වැ නැඟිණ: ඒ භාග්‍යවතුන් වහන්සේ මෙසේ අර්හත් වූහ. සම්‍යක්සම්බුද්ධයහ. අෂ්ටවිද්‍යා පසළොස්චරණයෙන් සමන්විතයහ. සුගතයහ. ලොකවිද්හ. අනුත්තර පුරුෂදම්‍යසාරථිහ. දෙවි මිනිස්නට ශාස්තෘ වූහ. බුද්ධයහ. භාග්‍යවත්හ’ යි. ඒ භාග්‍යවත්හු සදෙවක සමාරක සබ්‍රහ්මක වූ ශ්‍රමණබ්‍රාහ්මණයන් සහිත ප්‍රජාව ඇති දෙවිමිනිසුන් සහිත මේ ලොකය තමන් වහන්සේ විශිෂ්ටඥානයෙන් දැන ප්‍රත්‍යක්ෂ කොට ප්‍රකාශ කරන සේක. ඒ භාග්‍යවතුන් වහන්සේ ආදී කල්‍යාණ වූ මධ්‍යකල්‍යාණ වූ පර්‍ය්‍යවසාන කල්‍යාණ සාර්ත්ථ වූ සව්‍යඤ්ජන වූ කෙවලපරිපූර්ණ වූ ධර්මය දෙසන සේක. පරිශුද්ධ වූ මාර්ගබ්‍රහ්මචර්‍ය්‍ය ප්‍රකාශ කරන සේක. එබඳු වූ රහතුන්ගේ දැකීම මනා මැ නු’ යි.",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති නගරවින්දයෙහි වැසි බමුණුගැහැවියෝ භාග්‍යවතුන් වහන්සේ කරා එළැඹියහ. එළැඹ කිසි කෙනෙක් භාග්‍යවතුන් වහන්සේට අභිවාදනා කොට එකත්පස් වැ හුන්හ. ඇතැම් කෙනෙක් භාග්‍යවතුන් වහන්සේ සමග සතුටු වූහ. සතුටු වියයුතු සිහි කළයුතු කථාව කොට නිමවා එකත්පස් වැ හුන්හ. ඇතැම් කෙනෙක් භාග්‍යවතුන් වහන්සේ දෙසට පිණිපා කොට එකත්පස් වැ හුන්හ. ඇතැම් කෙනෙක් භාග්‍යවතුන් වහන්සේ සමීපයෙහි නම්ගොත් අස්වා එකත්පස් වැ හුන්හ. ඇතැම් කෙනෙක් තුෂ්ණීම්භූත වැ එකත්පස් වැ හුන්හ. එකත්පස් වැ හුන් නගරවින්දයෙහි වැසි බමුණුගැහැවියනට භාග්‍යවතුන් වහන්සේ තෙල වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "text": "ඉදින් ගැහැවියෙනි, අන්තොටු පිරිවැජියෝ තොප මෙසේ පුළුවුස්නාහු නම්: “ගැහැවියෙනි, කෙබඳු පියවි ඇති මහණ බමුණෝ සත්කාර නො කටයුත්තාහු ද ගරුකාර නො කට යුත්තාහු ද බුහුමන් නො කටයුත්තාහු ද නො පිදියයුත්තාහු දැ? යි”, ගැහැවියෙනි, මෙසේ පුළුවුස්නාලද තෙපි ඒ අන්තොටු පිරිවැජියනට මෙසේ ප්‍රකාශ කරන්නහු යැ: ‘යම් මහණබමුණු කෙනෙක් චක්ෂුර්විඥෙය රූපයෙහි නො පැහූ රාග ඇති වැ නො පැහූ ද්වේෂ ඇති වැ නො පැහූ මෝහ ඇති වැ තමා තුළ නො සන්හුන් සිත් ඇති වැ කයින් වචසින් මනසින් සමවිසම කොට හැසිරෙත් ද, මෙවන් මහණ බමුණෝ සත්කාර නො කළයුතු වෙති. ගරුකාර නො කළයුතු වෙති. බුහුමන් නො කළයුතු වෙති. නො පිදිය යුතු වෙත්. ඒ කවර හෙයින යත්: අපිදු චක්ෂුර්විඥෙය රූපයෙහි අවීතරාගයම්හ, අවීතද්වේෂයම්හ, අවීතමොහයම්හ, තමා තුළ නො සන්හුන් සිතැතියම්හ. කයින් වචසින් මනසින් සමවිසම කොට හැසිරෙම්හ. මතුයෙහි අන්‍යචර්‍ය්‍යාවක් නො දක්නා අපට තෙල සමචර්‍ය්‍යා මැ වෙයි. එයින් ඒ භවත් මහණ බමුණෝ සත්කාර නො කළයුතු වෙති. ගරුකාර නො කළයුතු වෙති. බුහුමන් නො කළයුතු වෙති. නො පිදියයුතු වෙත්. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "605"
            },
            {
                "type": "paragraph",
                "text": "යම් ඒ මහණ බමුණු කෙනෙක් ශ්‍රොත්‍රවිඥෙය වූ ශබ්දයෙහි … ඝ්‍රාණවිඥෙය වූ ගන්ධයෙහි ... ජිහ්වාවිඥෙය වූ රසයෙහි ... කායවිඥෙය වූ ස්ප්‍රෂ්ටව්‍යයෙහි ... මනොවිඥෙය වූ ධර්මයෙහි නො පැහූ රාග ඇති වැ නො පැහූ ද්වේෂ ඇති වැ නො පැහූ මොහ ඇති වැ තමා තුළ නො සන්හුන් සිතැති වැ කයින් වචසින් මනසින් සමවිසම කොට හැසිරෙත් ද, මෙවන් මහණ බමුණෝ සත්කාර නො කළයුතු වෙති. ගරුකාර නො කළයුතු වෙති. බුහුමන් නො කළයුතු වෙති. නො පිදිය යුතු වෙත්. ඒ කවර හෙයින යත්: අපිදු මනොවිඥෙය වූ ධර්මයෙහි නො පැහූ රාග ඇතියම්හ. නො පැහූ ද්වේෂ ඇතියම්හ. නො පැහූ මොහ ඇතියම්හ. තමා තුලා නො සන්හුන් සිත් ඇතියම්හ. කයින් වචසින් මනසින් සමවිසමචර්‍ය්‍යා කරම්හ. මතුයෙහි අන්‍යචර්‍ය්‍යා නො දක්නා අපට තෙල සමචර්‍ය්‍යා ද වියහෙයි. එයින් ඒ භවත් මහණබමුණෝ සත්කාර නො කළයුතු වෙති, ගරුකාර නො කළ යුතු වෙති. බුහුමන් නො කළයුතු වෙති. නො පිදියයුතු වෙති’ යි. මෙසේ පුළුවුස්නාලද ගැහැවි වූ තෙපි ඒ අන් තොටු පිරිවැජියනට මෙසේ විභාග කොට කියවු."
            },
            {
                "text": "ඉදින් ගැහැවියෙනි, අන් තොටු පිරිවැජියෝ ‘ගැහැවියෙනි, කෙබඳු මහණ බමුණෝ සත්කාරාර්හ වෙත් ද ගරුකාර්හ වෙත් ද මානනාර්හ වෙත් ද පූජනාර්හ වෙත් දැ?’ යි. තොප මෙසේ පුළුවුස්නාහු නම් ගැහැවියෙනි, මෙසේ පුළුවුස්නාලද තෙපි ඒ අන් තොටු පිරිවැජියනට මෙසේ විභාග කොට කියව. යම් මහණ බමුණු කෙනෙක් චක්ෂුර්විඥෙය රූපාලම්බනයෙහි පැහූ රාග ඇති වෙත් ද පැහූ ද්වේෂ ඇති වෙත් ද පැහූ මොහ ඇති වෙත් ද තමා තුළ සන්හුන් සිත් ඇති වෙත් ද කයින් වචසින් මනසින් සමචර්‍ය්‍යා කෙරෙත් ද මෙබඳු මහණ බමුණෝ සත්කාරාර්හ වෙති, ගරුකාර්හ වෙති, මානනාර්හ වෙති, පූජනාර්හ වෙති. ඒ කවර හෙයින යත්: අපි වනාහි චක්ෂුර් විඥෙය රූපාලම්බනයෙහි නො පැහූ රාග ඇතියම්හ, නො පැහූ ද්වේෂ ඇතියම්හ, නො පැහූ මොහ ඇතියම්හ, තමා තුළ නො සන්හුන් සිත් ඇතියම්හ. කයින් වචසින් මනසින් සමවිසමචර්‍ය්‍යා කරම්හ. මතුයෙහි අන්‍යචර්‍ය්‍යා දක්නා අපට තෙල සමචර්‍ය්‍යා ද විය හෙයි. එයින් ඒ භවත් මහණ බමුණෝ සත්කාරාර්හ වෙති, ගරුකාර්හ වෙති, මානනාර්හ වෙති, පූජනාර්හ වෙති. යම් මහණ බමුණු කෙනෙක් ශ්‍රොත්‍රවිඥෙය ශබ්දාලම්බනයෙහි ... ඝ්‍රාණවිඥෙය ගන්ධාලම්බනයෙහි ... ජිහ්වාවිඥෙය රසාලම්බනයෙහි ... කායවිඥෙය ස්ප්‍රෂ්ටව්‍යාලම්බනයෙහි ... මනොවිඥෙය ධර්මයෙහි වීතරාග වෙත් ද වීතද්වේෂ වෙත් ද වීතමොහ වෙත් ද, තමා තුළ සන්හුන් සිත් ඇති වෙත් ද, කයින් වචසින් මනසින් සමචර්‍ය්‍යා කෙරෙත් ද, මෙබඳු මහණ බමුණෝ සත්කාරාර්හ වෙති, ගරුකාර්හ වෙති, මානනාර්හ වෙති, පූජනාර්හ වෙත්, ඒ කවර හෙයින යත්: අපි වනාහි මනොවිඥෙය ධර්මයෙහි අවීතරාගයම්හ, අවීතද්වේෂයම්හ, අවීතමොහයම්හ. තමා තුලා නො සන්හුන් සිත් ඇතියම්හ. කයින් වචසින් මනසින් සමවිසමචර්‍ය්‍යා කරම්හ. මතූයෙහි අන්‍යචර්‍ය්‍යා දක්නා අපට තෙල සමචර්‍ය්‍යා ද වෙයි. එයින් ඒ භවත් මහණ බමුණෝ සත්කාරාර්හ වෙති, ගරුකාර්හ වෙති, මානනාර්හ වෙති, පූජනාර්හ වෙත්’ යි. ගැහැවියෙනි, මෙසේ පුළුවුස්නාලද තෙපි ඒ අන්තොටු පිරිවැජියනට මෙසේ විභාග කොට කියව.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "607"
            },
            {
                "text": "ගැහැවියෙනි, ඉදින් තොප අතින් අන්තොටු පිරිවැජියෝ මෙසේ විචාරත් ද, (කෙසේද යත්: ) ‘යම් හෙයෙකින් ඇවැත්නි, තෙපි ඒකාන්තයෙන් ඒ ආයුෂ්මත්හු වීතරාග හෝ වෙති, රාගවිනය පිණිස හෝ පිළිපන්නාහු වෙති, වීතද්වේෂ හෝ වෙති, ද්වේෂවිනය පිණිස හෝ පිළිපන්නාහු වෙති, වීතමොහ හෝ වෙති, මොහවිනය පිණිස හෝ පිළිපන්නාහු වෙති’ යි මෙසේ කියවු ද, ඒ ආයුෂ්මතුන්ගේ තාදෘශාකාරයෝ කවරහ, අන්වයයෝ කවරහ’ කියා යි. ගැහැවියෙනි, මෙසේ පුළුවුස්නාලද තෙපි ඒ අන්තොටු පිරිවැජියනට මෙසේ කියව: ‘එසේ මැ යැ. ඒ ආයුෂ්මත්හු අරණ්‍ය වානප්‍රස්ථ ප්‍රාන්ත ශයනාසනයන් සෙවිති. එහි යම් බඳු රූපයන් දැක දැක සිත් අලවත් ද, එවන් චක්ෂුර්විඥෙය වූ රූපායතනයෝ නැත. එහි යම් බඳු ශබ්දයන් අස අසා සිත් අලවත් ද, එබඳු ශ්‍රොත්‍රවිඥෙය ශබ්දයෝ නැත. එහි යම්බඳු ගන්ධයන් අඝ්‍රාණ කොට කොට සිත් අලවත් ද, එබඳු ඝ්‍රාණවිඥෙය ගන්ධයෝ නැත. එහි යම්බඳු රසයන් ආස්වාද කොට කොට සිත් අලවත් ද, එබඳු ජිහ්වාවිඥෙය රසයෝ නැත. එහි යම්බඳු ස්ප්‍රෂ්ටව්‍යයන් ස්පර්ශ කොට කොට සිත් අලවත් ද, එබඳු වූ කායවිඥෙය ස්ප්‍රෂ්ටව්‍යයෝ නැත. ආයුෂ්මත්නි, අපි යම් හෙයෙකින් මෙසේ කියමෝද (කෙසේද යැ යත්: ) ‘ඒකාන්තයෙන් ඒ ආයුෂ්මත්හු වීතරාග හෝ වෙති. රාගවිනය පිණිස පිළිපන්නාහු හෝ වෙති. වීතද්වේෂ හෝ වෙති, ද්වේෂවිනය පිණිස පිළිපන්නාහු හෝ වෙති. වීතමෝහ හෝ වෙති, මොහ විනය පිණිස පිළිපන්නාහු හෝ වෙති’ යි. ඇවැත්නි, මොහු අප ගත් ආකාරයෝ වෙති. මොහු අන්වයෝ වෙත්. ගැහැවියෙනි, මෙසේ පුළුවුස්නාලද තෙපි ඒ අන්තොටු පිරිවැජියනට මෙසේ විභාග කොට කියව යි.",
                "type": "paragraph"
            },
            {
                "text": "මෙසේ වදාළ කල්හි නගරවින්ද වැසි බමුණු ගැහැවියෝ භාග්‍යවතුන් වහන්සේට තෙල සැල කොළෝ: භවත් ගෞතමයන් වහන්ස, ඉතා මැනැව, භවත් ගෞතමයන් වහන්ස, ඉතා මැනැව, භවත් ගෝතමයන් වහන්ස, යම් පරිදි යටිහුරු කළ දෙයක් හෝ උඩුහුරු කරන්නේ වේ ද, පිළිසන් දෙයක් හෝ විවර කරන්නේ වේ ද, මං මුළා වුවක්හට හෝ මග කියන්නේ වේ ද, ‘ඇස් ඇතියෝ රූපයන් දක්නාහ’ යි අඳුරෙහි හෝ තෙල් පහනක් දල්වන්නේ වේ ද, එපරිදි භවත් ගෞතමයන් වහන්සේ විසින් දහම් පැවැසිණ. තෙල අපි භවත් ගෞතමයන් වහන්සේ ද ධර්මය ද භික්ෂු සංඝයා ද සරණ කොට යම්හ. භවත් ගෞතමයන් වහන්සේ අද පටන් කොට දිවිහිමියෙන් සරණගිය උපාසකයන් කොට ධරත්ව යි.",
                "type": "paragraph"
            },
            {
                "text": "අටවැනි නගරවින්දෙය්‍ය සූත්‍ර යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "609"
            },
            {
                "type": "centered",
                "text": "3.5.9",
                "level": 1
            },
            {
                "type": "heading",
                "text": "පිණ්ඩපාතපාරිසුද්ධි සූත්‍රය",
                "level": 1
            },
            {
                "text": "මා විසින් මෙසේ අසන ලද: එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ රජගහනුවර කලන්දකනිවාප නම් වේළුවනයෙහි වැඩවසන සේක. එකල්හි ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ සවස් වේලෙහි පලසමවතින් නැඟීසිටියාහු භාග්‍යවතුන්වහන්සේ කරා එළැඹියහ. එළැඹ භාග්‍යවතුන් වහන්සේ සකසා වැඳ එකත්පස් වැ හුන්හ. එකත්පස් වැ හුන් ආයුෂ්මත් සැරියුත් තෙරණුවනට තෙල වදාළසේක:",
                "type": "paragraph"
            },
            {
                "text": "ශාරිපුත්‍රය, තොපගේ ඉන්ද්‍රියයෝ වෙසෙසින් පහන්හ, සිවිපැහැ පරිශුද්ධ යැ, පර්‍ය්‍යවදාත යි. ශාරිපුත්‍රය, තෙපි මෙකල්හි කවර විහරණයෙකින් යුක්ත වැ බහුල කොට වාස කරවු දැ? යි.",
                "type": "paragraph"
            },
            {
                "text": "‘වහන්ස, මෙකල්හි මම් ශුන්‍යතාවිහරණයෙන් යුක්ත වැ බහුල කොට වෙසෙමි’ යි.",
                "type": "paragraph"
            },
            {
                "text": "සාධු සාධු ශාරිපුත්‍රය. ශාරිපුත්‍රය, තෙපි මෙකල්හි මහාපුරුෂවිහරණයෙන් බහුල කොට වාස කරවු. ශාරිපුත්‍රය, යම් ශුන්‍යතායෙක් ඇද්ද, තෙල මහාපුරුෂවිහරණයෙක. ශාරිපුත්‍රය, එහෙයින් මෙහිලා ඉදින් මහණ මෙකල්හි ශුන්‍යතාවිහරණයෙන් බහුල කොට වසන්නෙමි’ යි කැමැති වේ නම් ශාරිපුත්‍රය, ඒ මහණහු විසින් මෙසේ ප්‍රත්‍යවේක්ෂා කටයුතු: ‘මම් යම් මගෙකින් ගමින් පිඬු පිණිස පිවිසියෙම් ද, යම් පෙදෙසෙක්හි පිඬු සිඟා ගියෙම් ද, යම් මඟෙකින් ගමින් පිඬුවායෙන් පෙරළා ආයෙම් ද, එහි මාගේ චක්ෂුර්විඥෙය රූපයෙහි ඡන්දයෙක් වේවයි රාගයෙක් වේවයි ද්වේෂයෙක් වේවයි මෝහයෙක් වේවයි චිත්තයාගේ ගැටෙන ක්ලෙශයෙක් වේවයි ඇත්තේ දෝ හො’යි.",
                "type": "paragraph"
            },
            {
                "text": "ඉදින් ශාරිපුත්‍රය, මහණ ප්‍රත්‍යවේක්ෂා කරනුයේ මෙසේ දනී ද ‘මම් යම් මඟෙකින් ගමට පිඬු පිණිස පිවිසියෙම් ද, යම් පෙදෙසෙක්හි පිඬු සිඟා ගියෙම් ද, යම් මඟෙකින් ගමින් පිඬු සිඟා පෙරළා ආයෙම් ද, එහි දී මාගේ චක්ෂුර්විඥෙය රූපයෙහි ඡන්දයෙක් වේවයි රාගයෙක් වේවයි ද්වේෂයෙක් වේවයි මෝහයෙක් වේවයි චිත්තයාගේ ගැටෙන ක්ලේශ ජාතයෙක් වේවයි ඇතැ’ යි. ශාරිපුත්‍රය, ඒ මහණහු විසින් ඒ ලාමක අකුශලධර්මයන්ගේ මැ ප්‍රහාණය පිණිස වෑයම් කටයුතු යි.",
                "type": "paragraph"
            },
            {
                "text": "තවද ශාරිපුත්‍රය, ඉදින් මහණ ප්‍රත්‍යවේක්ෂා කරනුයේ ‘මම් යම් මඟෙකින් ගමට පිඬු පිණිස පිවිසියෙම් ද, යම් පෙදෙසෙක පිඬු සිඟා ගියෙම් ද, යම් මඟෙකින් ගමින් පිඬු සිඟා පෙරළා ආයෙම් ද, එහි දී මාගේ චක්ෂුර්විඥෙය රූපයෙහි ඡන්දයෙක් හෝ රාගයෙක් හෝ ද්වේෂයෙක් හෝ මෝහයෙක් හෝ සිතෙහි ගැටෙන ක්ලේශජාතයෙක් හෝ නැතැ’ යි මෙසේ දනී ද, ශාරිපුත්‍රය, ඒ මහණහු විසින් ඒ ප්‍රීතිප්‍රාමොද්‍යයෙන් මැ කුශලධර්මයෙහි රෑදෙවෙහි හික්මෙන්නහු වාස කටයුතු.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "611"
            },
            {
                "text": "තවද ශාරිපුත්‍රය, අනෙකෙකි: මහණහු විසින් මෙසේ ප්‍රත්‍යවේක්ෂා කටයුතු: යම් මඟෙකින් මම ගමට පිඬු සිඟා පිවිසියෙම් ද, යම් පෙදෙසෙක්හි පිඬු සිඟා ගියෙම් ද, යම් මඟෙකින් පිඬු සිඟා ගමින් පෙරළා ආයෙම් ද, එහි දී මාගේ ශ්‍රොත්‍රවිඥෙය ශබ්දයෙහි ... ඝ්‍රාණවිඥෙය ගන්ධයෙහි ... ජිහ්වාවිඥෙය රසයෙහි ... කායවිඥෙය ස්ප්‍රෂ්ටව්‍යයෙහි ... මනොවිඥෙය ධර්මයෙහි ඡන්දයෙක් හෝ රාගයෙක් හෝ ද්වේෂයෙක් හෝ මෝහයෙක් හෝ සිතෙහි ගැටෙන ක්ලේශජාතයෙක් හෝ ඇද්ද? යි. ඉදින් ශාරිපුත්‍රය, මහණ ප්‍රත්‍යවේක්ෂා කරනුයේ: ‘යම් මඟෙකින් මම ගමට පිඬු සිඟා පිවිසියෙම් ද, යම් පෙදෙසෙක පිඬු සිඟා ගියෙම් ද, යම් මඟෙකින් පිඬු පිණිස හැසිර ගමින් පෙරළා ආයෙම් ද, එහි දී මාගේ මනෝවිඥෙය ධර්මයෙහි ඡන්දයෙක් වේවයි රාගයෙක් වේවයි ද්වේෂයෙක් වේවයි මෝහයෙක් වේවයි සිතෙහි ගැටෙන ක්ලේශජාතයෙක් වේවයි ඇතැ’ යි මෙසේ දනී ද ශාරිපුත්‍රය, ඒ මහණහු විසින් ඒ ලාමක අකුශලධර්මයන්ගේ මැ ප්‍රහාණය පිණිස වෑයම් කටයුතු යි.",
                "type": "paragraph"
            },
            {
                "text": "ඉදින් ශාරිපුත්‍රය, මහණ ප්‍රත්‍යවේක්ෂා කරනුයේ ‘යම් මඟෙකින් මම ගමට පිඬු පිණිස පිවිසියෙම් ද, යම් පෙදෙසෙක්හි පිඬු සිඟා ගියෙම් ද, යම් මඟෙකින් පිඬු පිණිස හැසිර ගමින් පෙරළා ආයෙම් ද, එහි දී මාගේ මනොවිඥෙය ධර්මයෙහි ඡන්දයෙක් වේවයි රාගයෙක් වේවයි ද්වේෂයෙක් වේවයි මෝහයෙක් වේවයි සිත පිලිබඳ ගැටෙන ක්ලේශ ජාතයෙක් වේවයි නැතැ’ යි මෙසේ දැනගනී ද, ශාරිපුත්‍රය, ඒ මහණහු විසින් ඒ ප්‍රීතිප්‍රාමොද්‍යයෙන් මැ කුශල ධර්මයන්හි රෑදෙවෙහි හික්මෙන්නහු වාස කටයුතු යි.",
                "type": "paragraph"
            },
            {
                "text": "තවද ශාරිපුත්‍රය, අනෙකක් කියමි. මහණහු විසින් ‘මාගේ පඤ්චකාමගුණයෝ ප්‍රහීණ වූවාහු දැ’ යි මෙසේ ප්‍රත්‍යවේක්ෂා කටයුතු යි. ඉදින් ශාරිපුත්‍රය, මහණ ප්‍රත්‍යවේක්ෂා කරනුයේ මාගේ පඤ්චකාමගුණයෝ අප්‍රහීණයහ’ යි මෙසේ දැනගනී ද, ශාරිපුත්‍රය, ඒ මහණහු විසින් පඤ්චකාමගුණයන්ගේ ප්‍රහාණය පිණිස වෑයම් කටයුතු යි. ඉදින් ශාරිපුත්‍රය, මහණ ප්‍රත්‍යවේක්ෂා කරනුයේ මාගේ පඤ්චකාමගුණයෝ ප්‍රහීණ වූහ’ යි මෙසේ දැනගනී ද, ශාරිපුත්‍රය, ඒ මහණහු විසින් ඒ ප්‍රීතිප්‍රාමොද්‍යයෙන් යුක්ත වැ කුශල ධර්මයන්හි රෑදෙවෙහි හික්මෙන්නහු වාස කටයුතු.",
                "type": "paragraph"
            },
            {
                "text": "තවද ශාරිපුත්‍රය, මහණහු විසින් මෙසේ ප්‍රත්‍යවේක්ෂා කටයුතු යැ: මාගේ පඤ්චනීවරණයෝ ප්‍රහීණ වූවාහු දෝහො’ යි. ඉදින් ශාරිපුත්‍රය, මහණ ප්‍රත්‍යවේක්ෂා කරනුයේ ‘මාගේ පඤ්චනීවරණයෝ අප්‍රහීණයහ’ යි මෙසේ දැනගනී ද, ශාරිපුත්‍රය, ඒ මහණහු විසින් පඤ්චනීවරණයන්ගේ ප්‍රහාණය පිණිස වෑයම් කටයුතු යැ. ඉදින් ශාරිපුත්‍රය, මහණ ප්‍රත්‍යවේක්ෂා කරනුයේ (මාගේ සන්තානයෙහි) පඤ්චනීවරණයෝ ප්‍රහීණ වූහ’ යි මෙසේ දැනගනී ද, ශාරිපුත්‍රය, ඒ මහණහු විසින් ඒ ප්‍රීතිප්‍රාමොද්‍යයෙන් මැ කුශලධර්මයන්හි රෑදෙවෙහි හික්මෙන්නහු වාස කටයුතු.",
                "type": "paragraph"
            },
            {
                "text": "තවද ශාරිපුත්‍රය, මහණහු විසින් මෙසේ ප්‍රත්‍යවේක්ෂා කටයුතු යැ: මා විසින් පඤ්චොපාදානසකන්ධයෝ පිරිසිඳ දන්නාලද්දාහු දැ’ යි. ඉදින් ශාරිපුත්‍රය, මහණ ප්‍රත්‍යවේක්ෂා කරනුයේ ‘මා විසින් පඤ්චොපාදානසකන්ධයෝ අපරිඥාතයහ’ යි මෙසේ දැනගනීද, ශාරිපුත්‍රය, ඒ මහණහු විසින් පඤ්චොපාදානසකන්ධයන්ගේ පරිඥානය පිණිස වෑයම් කටයුතුයැ. ඉදින් ශාරිපුත්‍රය, මහණ ප්‍රත්‍යවේක්ෂා කරනුයේ මා විසින් පඤ්චොපාදානසකන්ධයෝ පිරිසිඳ දන්නාලදහ’ යි මෙසේ දැනගනී ද, ශාරිපුත්‍රය, ඒ මහණහු විසින් එ මැ ප්‍රීතිප්‍රාමොද්‍යයෙන් යුක්ත වැ කුශලධර්මයන්හි රෑදෙවෙහි හික්මෙන්නහු වාස කටයුතු.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "613"
            },
            {
                "text": "ඉදින් ශාරිපුත්‍රය, මහණහු විසින් මෙසේ ප්‍රත්‍යවේක්ෂා කටයුතු යැ: මා විසින් සතර සතිපට්ඨානයෝ වඩනලද්දාහු දෝහෝ’ යි. ඉදින් ශාරිපුත්‍රය, ප්‍රත්‍යවේක්ෂා කරන මහණ ‘මා විසින් සතර සතිපට්ඨානයෝ අභාවිතයහ’ යි මෙසේ දැනගනී ද ශාරිපුත්‍රය, ඒ මහණහු විසින් සතර සතිපට්ඨානයන් වැඩීම පිණිස වෑයම් කටයුතු යැ. ඉදින් ශාරිපුත්‍රය, ප්‍රත්‍යවේක්ෂා කරන මහණ ‘මා විසින් සතර සතිපට්ඨානයෝ භාවිතයහ’ යි මෙසේ දැනගනී ද, ශාරිපුත්‍රය, ඒ මහණහු විසින් එ මැ ප්‍රීතිප්‍රාමොද්‍යයෙන් යුක්ත වැ කුශලධර්මයන්හි දවරෑ හික්මෙන්නහු විසින් වාස කටයුතු.",
                "type": "paragraph"
            },
            {
                "text": "තවද අනෙකෙකි: ශාරිපුත්‍රය, මහණහු විසින් මෙසේ ප්‍රත්‍යවේක්ෂා කළයුතු යැ: ‘මා විසින් සතර සම්‍යක් ප්‍රධානයෝ වඩනලද්දාහු දෝහො’ යි. ඉදින් ශාරිපුත්‍රය, ප්‍රත්‍යවේක්ෂා කරන මහණ ‘සතර සම්‍යක් ප්‍රධානයෝ මා විසින් අභාවිතයහ’ යි මෙසේ දැනගනී ද, ශාරිපුත්‍රය, ඒ මහණහු විසින් සතර සම්‍යක් ප්‍රධානයන් වැඩීම පිණිස වෑයම් කළ යුතු යැ. ඉදින් ශාරිපුත්‍රය, ප්‍රත්‍යවේක්ෂා කරන මහණ ‘මා විසින් සතර සම්‍යක් ප්‍රධානයෝ භාවිතයහ’ යි මෙසේ දැනගනී ද, ශාරිපුත්‍රය, ඒ මහණහු විසින් එ මැ ප්‍රීතිප්‍රාමොද්‍යයෙන් යුක්ත වැ කුශලධර්මයන්හි දවරෑ හික්මෙන්නහු විසියයුතු.",
                "type": "paragraph"
            },
            {
                "text": "තවද ශාරිපුත්‍රය, මහණහු විසින් මෙසේ ප්‍රත්‍යවේක්ෂා කටයුතු යැ, මා විසින් සතර ඍද්ධිපාදයෝ භාවිත වූවාහු දෝහො’ යි ඉදින් ශාරිපුත්‍රය, ප්‍රත්‍යවේක්ෂා කරන මහණ මා විසින් සතර ඍද්ධිපාදයෝ අභාවිතයහ’ යි මෙසේ දැනගනී ද, ශාරිපුත්‍රය, ඒ මහණහු විසින් සතර ඍද්ධිපාදයන්ගේ වැඩීම පිණිස වෑයම් කළයුතු යැ. ඉදින් ශාරිපුත්‍රය, ප්‍රත්‍යවේක්ෂා කරන මහණ මා විසින් සතර ඍද්ධිපාදයෝ භාවිතයහ’ යි මෙසේ දැනගනී ද, ශාරිපුත්‍රය, ඒ මහණහු එ මැ ප්‍රීතිප්‍රාමොද්‍යයෙන් යුක්ත වැ කුශලධර්මයන්හි දවරෑ හික්මෙන්නහු විසින් විසියයුතු.",
                "type": "paragraph"
            },
            {
                "text": "තවද ශාරිපුත්‍රය, මහණහු විසින් මෙසේ ප්‍රත්‍යවේක්ෂා කටයුතු යැ: ‘මා විසින් පඤ්චෙන්ද්‍රියෝ වඩනලද්දාහු දෝහො’ යි. ඉදින් ශාරිපුත්‍රය, ප්‍රත්‍යවේක්ෂා කරන මහණ ‘මා විසින් පඤ්චෙන්ද්‍රියෝ අභාවිතයහ’ යි මෙසේ දැනගනී ද, ශාරිපුත්‍රය, ඒ මහණහු විසින් පඤ්චෙන්ද්‍රියෝ වැඩීම පිණිස වෑයම් කළයුතු යැ. ඉදින් ශාරිපුත්‍රය, ප්‍රත්‍යවේක්ෂා කරන මහණ ‘මා විසින් පඤ්චෙන්ද්‍රියෝ භාවිතයහ’ යි මෙසේ දැනගනී ද, ශාරිපුත්‍රය, ඒ මහණහු එ මැ ප්‍රීතිප්‍රාමොද්‍යයෙන් යුක්ත වැ කුශලධර්මයන්හි දවරෑ හික්මෙන්නහු විසින් විසියයුතු.",
                "type": "paragraph"
            },
            {
                "text": "තවද ශාරිපුත්‍රය, මහණහු විසින් මෙසේ ප්‍රත්‍යවේක්ෂා කළයුතු යැ: ‘මා විසින් පඤ්චබලයෝ වඩනලද්දාහු දෝහො’ යි. ඉදින් ශාරිපුත්‍රය, ප්‍රත්‍යවේක්ෂා කරන මහණ ‘මා විසින් පඤ්චබලයෝ අභාවිතයහ’ යි මෙසේ දැනගනී ද, ශාරිපුත්‍රය, ඒ මහණහු විසින් පඤ්චබලයෝ භාවනාව පිණිස වෑයම් කළයුතු යැ. ඉදින් ශාරිපුත්‍රය, ප්‍රත්‍යවේක්ෂා කරන මහණ ‘මා විසින් පඤ්චබලයෝ භාවිතයහ’ යි මෙසේ දැනගනී ද, ශාරිපුත්‍රය, මහණහු එ මැ ප්‍රීතිප්‍රාමොද්‍යයෙන් යුක්ත වැ කුශලධර්මයන්හි දවරෑ හික්මෙන්නහු විසින් විසියයුතු.",
                "type": "paragraph"
            },
            {
                "text": "තවද ශාරිපුත්‍රය, මහණහු විසින් මෙසේ ප්‍රත්‍යවේක්ෂා කළයුතු යැ: ‘මා විසින් සප්තබොධ්‍යඞ්ගයෝ වඩනලද්දාහු දෝහො’ යි. ඉදින් ශාරිපුත්‍රය, ප්‍රත්‍යවේක්ෂා කරන මහණ ‘මා විසින් සප්තබොධ්‍යඞ්ගයෝ අභාවිතයහ’ යි මෙසේ දැනගනී ද, ශාරිපුත්‍රය, ඒ මහණහු විසින් සප්තබොධ්‍යඞ්ගයන් වැඩීම පිණිස වෑයම් කටයුතු යැ. ඉදින් ශාරිපුත්‍රය, ප්‍රත්‍යවේක්ෂා කරන මහණ ‘මා විසින් සප්තබොධ්‍යඞ්ගයෝ භාවිතයහ’ යි මෙසේ දැනගනී ද, ශාරිපුත්‍රය, ඒ මහණහු එ මැ ප්‍රීතිප්‍රාමොද්‍යයෙන් යුතූ වැ කුශලධර්මයන්හි දවරෑ හික්මෙනුවහු විසින් වාස කටයුතු.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "615"
            },
            {
                "text": "තවද ශාරිපුත්‍රය, මහණහු විසින් මෙසේ ප්‍රත්‍යවේක්ෂා කටයුතු යැ: ‘මා විසින් ආර්‍ය්‍යඅෂ්ටාඞ්ගිකමාර්ගය වඩනාලද දෝහො’ යි. ඉදින් ශාරිපුත්‍රය, ප්‍රත්‍යවේක්ෂා කරන මහණ ‘මා විසින් ආර්‍ය්‍යඅෂ්ටාඞ්ගිකමාර්ගය අභාවිතයයි’ මෙසේ දැනගනී ද, ශාරිපුත්‍රය, ඒ මහණහු විසින් ආර්‍ය්‍යඅෂ්ටාඞ්ගිකමාර්ගය වැඩීම පිණිස වෑයම් කළයුතු යැ. ඉදින් ශාරිපුත්‍රය, ප්‍රත්‍යවේක්ෂා කරන මහණ ‘මා විසින් ආර්‍ය්‍යඅෂ්ටාඞ්ගික මාර්ගය වඩනාලද’ යි මෙසේ දැනගනී ද, ශාරිපුත්‍රය, ඒ මහණහු එ මැ ප්‍රීතිප්‍රාමොද්‍යයෙන් යුක්ත වැ කුශලධර්මයන්හි දවරෑ හික්මෙනුවහු විසින් වාස කටයුතු.",
                "type": "paragraph"
            },
            {
                "text": "තවද ශාරිපුත්‍රය, මහණහු විසින් මෙසේ ප්‍රත්‍යවේක්ෂා කටයුතු යැ: ‘මා විසින් ශමථය ද විදර්ශනාව ද වඩනලද්දාහු දෝහො’ යි. ඉදින් ශාරිපුත්‍රය, මහණ ප්‍රත්‍යවේක්ෂා කරන්නේ මෙසේ දන්නේ වේ ද: ‘මා විසින් ශමථය ද විදර්ශනා ද නො ව වඩනලදහ’ යි. ශාරිපුත්‍රය, ඒ මහණහු විසින් ශමථවිදර්ශනා දෙක වඩනු පිණිස ව්‍යායාම කළයුතු යැ. ඉදින් ශාරිපුත්‍රය, මහණ ප්‍රත්‍යවේක්ෂා කරන්නේ මෙසේ දන්නේ වේ ද: ‘මා විසින් ශමථය ද විදර්ශනා ද වඩනාලදහ’ යි. ශාරිපුත්‍රය, ඒ මහණහු එ මැ ප්‍රීතිප්‍රමොදයෙන් කුශලධර්මයෙහි දවරෑ හික්මෙනුවහු විසින් විහරණ කළයුතු යැ.",
                "type": "paragraph"
            },
            {
                "text": "තවද ශාරිපුත්‍රය, මහණහු විසින් මෙසේ ප්‍රත්‍යවේක්ෂා කළයුතු යැ: ‘මා විසින් විද්‍යා ද විමුක්ති ද ප්‍රත්‍යක්ෂ කරන ලද්දාහු දෝහො’ යි. ඉදින් ශාරිපුත්‍රය, මහණ ප්‍රත්‍යවේක්ෂා කරන්නේ මෙසේ දන්නේ වේ ද: ‘මා විසින් විද්‍යා ද විමුක්ති ද ප්‍රත්‍යක්ෂ නො කරන ලදහ’ යි. ශාරිපුත්‍රය, ඒ මහණහු විසින් විද්‍යාව හා විමුක්තියගේ ප්‍රත්‍යක්ෂ කිරීම පිණිස ව්‍යායාම කළයුතු යැ. ඉදින් ශාරිපුත්‍රය, මහණ ප්‍රත්‍යවේක්ෂා කරන්නේ මෙසේ දන්නේ වේ ද: ‘මා විසින් විද්‍යා ද විමුක්ති ද ප්‍රත්‍යක්ෂ කරන ලදහ’ යි. ශාරිපුත්‍රය, ඒ මහණහු එ මැ ප්‍රීතිප්‍රමොදයෙන් කුශලධර්මයෙහි දවරෑ හික්මෙනුවහු විසින් විහාර කළයුතු යැ.",
                "type": "paragraph"
            },
            {
                "text": "ශාරිපුත්‍රය, අතීතකාලයෙහි යම්කිසි ශ්‍රමණ කෙනෙක් හෝ බ්‍රාහ්මණ කෙනෙක් හෝ පිණ්ඩපාතශුද්ධි කළාහු ද , එ හැම මෙසෙයින් ම පුනපුනා ප්‍රත්‍යවේක්ෂා කොට පිණ්ඩපාත පරිශොධනා කළාහු යැ. ශාරිපුත්‍රය, අනාගතකාලයෙහි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ පිණ්ඩපාතපරිශොධනා කෙරෙත් ද, ඒ හැම මෙසෙයින් මැ පුනපුනා ප්‍රත්‍යවේක්ෂා කොට පිණ්ඩපාතපරිශොධනා කෙරෙති. ශාරිපුත්‍රය, මෙ වත්මනුයෙහි යම් කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ පිණ්ඩපාතපරිශොධනා කෙරෙත් ද, එ හැම මෙපෙරිදි මැ පුනපුනා ප්‍රත්‍යවේක්ෂා කොට පිණ්ඩපාතපරිශොධනා කෙරෙති. එකරුණින් ශාරිපුත්‍රය, තොප මෙසේ හික්මෙන්නේ යැ: ‘පුනපුනා ප්‍රත්‍යවේක්ෂා කොට පිණ්ඩපාතපරිශොධනා කරම්හ’ යි. ශාරිපුත්‍රය, මෙසේ තොප හික්මෙන්නේ මැනැව.",
                "type": "paragraph"
            },
            {
                "text": "භාග්‍යවතුන් වහන්සේ මේ සූත්‍රය වදාළසේක. සතුටුසිත් ඇති ආයුෂ්මත් සැරියුත් තෙරණුවෝ භාග්‍යවතුන් වහන්සේගේ භාෂිතය අභිනන්දන කළෝ.",
                "type": "paragraph"
            },
            {
                "text": "නව වැනි පිණ්ඩපාතපාරිසුද්ධි සූත්‍ර යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "617"
            },
            {
                "type": "centered",
                "text": "3.5.10",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඉන්ද්‍රියභාවනා සූත්‍රය",
                "level": 1
            },
            {
                "text": "මා විසින් මෙසේ අසනලද: එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ කජඞ්ගලා නම් නිගමයෙහි මුඛෙලු වනයෙහි වාසය කරනසේක. එසමයෙහි පාරාශරිය ඇතැවැසි උත්තර මාණවක භාග්‍යවතුන් වහන්සේ කරා එළැඹ භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සතුටු විය යුතු සිහි කළයුතු කථාව නිමාව එකත්පස් වැ හිණ. එකත්පස් වැ හුන් පාරාශරිය ඇතැවැසි උත්තරමාණවකහට භාග්‍යවතුන් වහන්සේ තෙල වදාළහ:",
                "type": "paragraph"
            },
            {
                "text": "‘උත්තරය, පාරාශරිය බ්‍රාහ්මණ සව්වනට ඉන්ද්‍රියභාවනාව දෙසා දැ’ යි.",
                "type": "paragraph"
            },
            {
                "text": "‘භවත් ගෞතමයන් වහන්ස, පාරාශරිය බ්‍රාහ්මණ සව්වනට ඉන්ද්‍රියභාවනාව දෙසා’ යයි. ",
                "type": "paragraph"
            },
            {
                "text": "උත්තරය, පාරාශරිය බ්‍රාහ්මණ සව්වනට කිසෙයින් ඉන්ද්‍රියභාවනාව දෙසා දැ’ යි.",
                "type": "paragraph"
            },
            {
                "text": "භවත් ගෞතමයන් වහන්ස, මෙහිලා ඇසින් රූ නො දකී ද, කනින් ශබ්ද නො අසා ද, භවත් ගෞතමයන් වහන්ස, මෙපරිද්දෙන් පාරාශරිය බ්‍රාහ්මණ සව්වනට ඉන්ද්‍රියභාවනා දෙසා’ යයි.",
                "type": "paragraph"
            },
            {
                "text": "උත්තරය, මෙසේ කල්හි පාරාශරිය බමුණුහුගේ බස් පරිදි අන්ධ තෙම වැඩූ ඉඳුරන් ඇති වන්නේ යැ. බධිර තෙම වැඩූ ඉඳුරන් ඇති වන්නේ යැ. උත්තරය, යම් හෙයෙකින් අන්ධ තෙම ඇසින් රූ නො දකී ද බධිර තෙම කනින් ශබ්ද නො අසා ද එහෙයිනි.",
                "type": "paragraph"
            },
            {
                "text": "මෙසේ වදාළ කල්හි පාරාශරිය අතවැසි උත්තර මාණවක තුෂ්ණීම්භූත වූයේ මකු වූයේ බැහූ කඳට ඇතියේ අධොමුඛ වූයේ සිතිවිලි සිතමින් වැටහීම් රහිත වැ හින.",
                "type": "paragraph"
            },
            {
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ පාරාශරිය අතවැසි උත්තරමාණවක තුෂ්ණීම්භූත වූවහු තෙද නැතියහු හෙළු කඳට ඇතියහු අධොමුඛ වූවහු සිතිවිලි සිතනුවහු වැටහීම් රහිත වූවහු දැන ආයුෂ්මත් අනඳ තෙරුන් ඇමතූසේක: ‘ආනන්දය, පාරාශරිය බ්‍රාහ්මණ අන් පරිදි සව්වනට ඉන්ද්‍රියභාවනාව දෙසයි. ආනන්දය, අන් පරිද්දෙකින් ආර්‍ය්‍යවිනයෙහි අනුත්තර වූ ඉන්ද්‍රියභාවනා වේ’ යයි. ",
                "type": "paragraph"
            },
            {
                "text": "භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ ආර්‍ය්‍යවිනයෙහි යම් අනුත්තර ඉන්ද්‍රිය භාවනාවක් දෙසනසේක් ද, මේ ඊට කලැ. සුගතයන් වහන්ස, මේ ඊට කලැ. භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ වදන් අසා ධරන්නාහ’ යි.",
                "type": "paragraph"
            },
            {
                "text": "එසේ වී නම් ආනන්දය, මනා කොට අසව. මනා කොට මෙනෙහි කරව, කියන්නෙමි’ යි.",
                "type": "paragraph"
            },
            {
                "text": "‘එසේ යැ වහන්සැ’ යි ආයුෂ්මත් අනඳ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වූහ. භාග්‍යවතුන් වහන්සේ තෙල වදාළසේක: ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "619"
            },
            {
                "text": "ආනන්දය, කිසෙයින් ආර්‍ය්‍යවිනයෙහි අනුත්තර ඉන්ද්‍රියභාවනා වෙයි යත්: ආනන්දය, මෙසස්නෙහි මහණහට ඇසින් රූ දැක මනාප උපදී, අමනාප උපදී, මනාපාමනාප උපදී. හේ මෙසේ දැනගනී: ‘මට මේ මනාපය උපන, අමනාපය උපන, මනාපාමනාපය උපන හෙද සඞ්ඛත යැ, ඖදාරික යැ, ප්‍රතීත්‍යසමුත්පන්න යි. යම් උපෙක්ෂාවක් ඇද්ද තෙල ශාන්ත යැ, තෙල ප්‍රණීත යැ’ යි කියා යි. ඔහුට ඒ උපන් මනාපය උපන් අමනාපය උපන් මනාපාමනාපය නිරුද්ධ වෙයි. උපෙක්ෂාව පිහිටා සිටී. ආනන්දය, යම්සේ ඇස් ඇති පුරුෂයෙක් ඇස ඇර පියාලන්නේ හෝ වේ ද ඇස පියා ඇරලන්නේ හෝ වේ ද, එසෙයින් මැ ආනන්දය, යම් කිසිවක්හට මෙසේ ශීඝ්‍ර වැ මෙසේ වෙලෙවි වැ මෙසේ නිදුකින් උපන් මනාපය උපන් අමනාපය උපන් මනාපාමනාපය නිරුද්ධ වේ ද, විදර්ශනොපෙක්ෂාව පිහිටා සිටී ද, ආනන්දය, මේ ආර්‍ය්‍යවිනයෙහි චක්ෂුර්විඥෙය රූප විෂයෙහි අනුත්තර වූ ඉන්ද්‍රියභාවනා යයි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "තවද ආනන්දය, මහණහට කනින් ශබ්ද අසා මනාප උපදී, අමනාප උපදී, මනාපාමනාප උපදී. හේ මෙසේ දැනගනී. මට මේ මනාපය උපන, අමනාපය උපන, මනාපාමනාපය උපන. හෙද සඞ්ඛත ය, ඖදාරික යැ, ප්‍රතීත්‍යසමුත්පන්න යි. යම් උපෙක්ෂාවක් ඇද්ද තෙල ශාන්ත යැ, තෙල ප්‍රණීත යැ’ යි කියා යි. ඔහුට ඒ උපන් මනාපය උපන් අමනාපය, උපන් මනාපාමනාපය නිරුද්ධ වෙයි. උපෙක්ෂාව පිහිටා සිටී. ආනන්දය යම්සේ බලවත් පුරුෂයෙක් නිදුකින් මැ අසුර ගසන්නේ ද, එසෙයින් මැ ආනන්දය, යම් කිසිවක්හට මෙසේ ශීඝ්‍ර වැ මෙසේ වෙලෙවි වැ මෙසේ නිදුකින් උපන් මනාපය උපන් අමනාපය උපන් මනාපාමනාපය නිරුද්ධ වේ ද , විදර්ශනොපෙක්ෂාව පිහිටා සිටී ද, ආනන්දය, මේ ආර්‍ය්‍යවිනයෙහි ශ්‍රොත්‍රවිඥෙය ශබ්ද විෂයෙහි අනුත්තර වූ ඉන්ද්‍රියභාවනා යයි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "තවද ආනන්දය, මහණහට ඝ්‍රාණයෙන් ගන්ධාඝ්‍රාණය කොට මනාප උපදී, අමනාප උපදී, මනාපාමනාප උපදී. හේ මෙසේ දැනගනී: ‘මට මේ මනාපය උපන, අමනාපය උපන, මනාපාමනාපය උපන. හෙද සඞ්ඛත යැ, ඖදාරික යැ, ප්‍රතීත්‍යසමුත්පන්න යි. යම් විදර්ශනොපෙක්ෂාවක් ඇද්ද, තෙල ශාන්ත යැ, තෙල ප්‍රණීත යැ’ යි කියා යි. ඔහුට ඒ උපන් මනාපය උපන් අමනාපය, උපන් මනාපාමනාපය නිරුද්ධ වෙයි, විදර්ශනොපෙක්ෂාව පිහිටා සිටියි. යම්සේ ආනන්දය, මඳක් නැඹුරු කල පියුම්පතෙහි දියබිඳුහු පෙරළෙත් ද, පිහිටා නො සිටිත් ද, එසෙයින් මැ ආනන්දය, යම්කිසිවක්හට මෙසේ ශීඝ්‍ර වැ මෙසේ වෙලෙවි වැ මෙසේ නිදුකින් උපන් මනාපය උපන් අමනාපය උපන් මනාපාමනාපය නිරුද්ධ වේ ද, විදර්ශනොපෙක්ෂාව පිහිටා සිටී ද, ආනන්දය, මේ ආර්‍ය්‍ය විනයෙහි ඝ්‍රාණවිඥෙය ගන්ධ විෂයෙහි අනුත්තර වූ ඉන්ද්‍රියභාවනා’ යයි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "621"
            },
            {
                "text": "තවද ආනන්දය, මහණහට දිවින් රස විඳ මනාප උපදී, අමනාප උපදී, මනාපාමනාප උපදී. හේ මෙසේ දැනගනී. මට මේ මනාපය උපන, අමනාපය උපන, මනාපාමනාපය උපන, හෙද සඞ්ඛත යැ, ඖදාරික යැ, ප්‍රතීත්‍යසමුත්පන්න යි. යම් විදර්ශනොපෙක්ෂාවක් ඇද්ද, තෙල ශාන්ත යැ, තෙල ප්‍රණීත යැ’ යි කියා යි. ඔහුට ඒ උපන් මනාපය උපන් අමනාපය, උපන් මනාපාමනාපය නිරුද්ධ වෙයි, උපේක්ෂා පිහිටා සිටී. යම්සේ ආනන්දය බලවත් පුරුෂයෙක් දිවග කෙලපිඬක් රැස් කොට නිදුකින් නඟන්නේ ද, එසෙයින් මැ ආනන්දය, යම් කිසිවක්හට මෙසේ ශීඝ්‍ර වැ මෙසේ වෙලෙවි වැ මෙසේ නිදුකින් උපන් මනාපය උපන් අමනාපය උපන් මනාපාමනාපය නිරුද්ධ වෙයි. උපෙක්ෂාව පිහිටා සිටියි. ආනන්දය, මේ ආර්‍ය්‍යවිනයෙහි ජිහ්වාවිඥෙය රූප විෂයෙහි අනුත්තර වූ ඉන්ද්‍රියභාවනා’ යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "තවද ආනන්දය, මහණහට කයින් ස්ප්‍රෂ්ටව්‍යය පැහැස මනාප උපදී, අමනාප උපදී, මනාපාමනාප උපදී. හේ මෙසේ දැනගනී. මට මේ මනාපය උපන, අමනාපය උපන, මනාපාමනාපය උපන. හෙ ද සඞ්ඛත යැ, ඖදාරික යැ, ප්‍රතීත්‍යසමුත්පන්න යි. යම් විදර්ශනොපෙක්ෂාවක් ඇද්ද, තෙල ශාන්ත යැ තෙල ප්‍රණීත යැ’ යි කියා යි. ඔහුට උපන් ඒ මනාපය උපන් අමනාපය උපන් මනාපාමනාපය නිරුද්ධ වෙයි. විදර්ශනොපෙක්ෂාව පිහිටා සිටී. යම්සේ ආනන්දය බලවත් පුරුෂයෙක් හැකුළූ බාහුව දිගු කරන්නේ හෝ වේද දිගු කළ බාහුව හකුළන්නේ හෝ වේද, එසෙයින් මැ ආනන්දය, යම් කිසිවක්හට මෙසේ ශීඝ්‍ර වැ මෙසේ වෙලෙවි වැ මෙසේ නිදුකින් උපන් මනාපය උපන් අමනාපය උපන් මනාපාමනාපය නිරුද්ධ වෙයි. විදර්ශනොපෙක්ෂාව පිහිටා සිටී. ආනන්දය, මේ ආර්‍ය්‍යවිනයෙහි කායවිඥෙය ස්ප්‍රෂ්ටව්‍ය විෂයෙහි අනුත්තර වූ ඉන්ද්‍රියභාවනා’ යි කියනුලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "තවද ආනන්දය, මහණහට මනසින් දහම් දැන මනාප උපදී. අමනාප උපදී. මනාපාමනාප උපදී. හේ මෙසේ දැනගනී: ‘මට මේ මනාපය උපන. අමනාපය උපන. මනාපාමනාපය උපන. හෙ ද සඞ්ඛත යැ, ඖදාරික යැ, ප්‍රතීත්‍යසමුත්පන්න යි. යම් විදර්ශනොපෙක්ෂායෙක් ඇද්ද තෙල ශාන්ත යැ, තෙල ප්‍රණීත යැ’ යි කියා යි. ඔහුට ඒ උපන් මනාපය උපන් අමනාපය උපන් මනාපාමනාපය නිරුද්ධ වෙයි. උපෙක්ෂාව පිහිටා සිටී. යම්සේ ආනන්දය, බලවත් පුරුෂයෙක් දවසක් මොනොවට තැවුණු යකබලෙක්හි දියබිඳු දෙකක් හෝ තුනක් හෝ හෙළන්නේ ද ආනන්දය, ජලබින්දුන්ගේ වැටීම ලැසිවේ ද, වැළි එය වහා මැ ක්ෂය වීමට ගෙවීමට යන්නේ ද, එසෙයින් මැ ආනන්දය යම් කිසිවක්හට මෙසේ ශීඝ්‍ර වැ මෙසේ වෙලෙවි වැ මෙසේ නිදුකින් උපන් මනාපය උපන් අමනාපය උපන් මනාපාමනාපය නිරුද්ධ වෙයි. විදර්ශනොපෙක්ෂාව පිහිටා සිටී. ආනන්දය, මේ ආර්‍ය්‍යවිනයෙහි මනොවිඥෙය ධර්ම විෂයෙහි අනුත්තර වූ ඉන්ද්‍රිය භාවනා’ යි කියනු ලැබේ. ආනන්දය, මෙසේ ආර්‍ය්‍යවිනයෙහි අනුත්තර වූ ඉන්ද්‍රියභාවනා වේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "623"
            },
            {
                "text": "ආනන්දය, කිසෙයින් ශෛක්ෂප්‍රතිපත් ඇත්තේ වෙයි යත්: ආනන්දය, මේ සස්නෙහි මහණහට ඇසින් රූ දැක මනාප උපදී. අමනාප උපදී. මනාපාමනාප උපදී. හේ ඒ උපන් මානාපයෙන් උපන් අමනාපයෙන් උපන් මනාපාමනාපයෙන් දුකට පැමිණෙයි. ලජ්ජාවට පැමිණෙයි. ජුගුප්සාවට පැමිණෙයි. කනින් ශබ්ද අසා ... නැහැයෙන් ගඳ ආඝ්‍රාණය කොට ... දිවින් රස විඳ ... කයින් පහස් පැහැස ... මනසින් දහම් දැන මනාප උපදී. අමනාප උපදී. මනාපාමනාප උපදී. හේ ඒ උපන් මනාපයෙන් උපන් අමනාපයෙන් උපන් මනාපාමනාපයෙන් දුක් වෙයි. ලජ්ජාවෙයි. ජුගුප්සා කෙරෙයි. ආනන්දය, මෙසේ ශෛක්ෂප්‍රතිපත් ඇත්තේ වේ.",
                "type": "paragraph"
            },
            {
                "text": "ආනන්දය, කිසෙයින් ආර්‍ය්‍ය වැඩූ ඉඳුරන් ඇත්තේ වෙයි යත්: ආනන්දය, මේ සස්නෙහි මහණහට ඇසින් රූ දැක මනාප උපදී, අමනාප උපදී, මනාපාමනාප උපදී. ඉදින් හේ ප්‍රතිකුලයෙහි අප්‍රතිකුලසංඥා ඇති වැ වසන්නෙමි’ යි කැමති වේ නම් එහි අප්‍රතිකුලසංඥා ඇති වැ වෙසෙයි. ඉදින් අප්‍රතිකුලයෙහි ප්‍රතිකූලසංඥා ඇති වැ වෙසෙන්නෙමි’ යි රිසි වේ නම් එහි ප්‍රතිකූල සංඥා ඇති වැ වෙසෙයි. ඉදින් ප්‍රතිකූලයෙහි ද අප්‍රතිකූලයෙහි ද අප්‍රතිකූලසංඥා ඇති වැ වෙසෙන්නෙමි’ යි රිසි වේ නම් එහි අප්‍රතිකූල සංඥා ඇති වැ වෙසෙයි. ඉදින් අප්‍රතිකූලයෙහි ද ප්‍රතිකූලයෙහි ද ප්‍රතිකූලසංඥා ඇති වැ වෙසෙන්නෙමි’ යි රිසි වේ නම් එහි ප්‍රතිකුලසංඥා ඇති වැ වෙසෙයි. ඉදින් ප්‍රතිකූලයත් අප්‍රතිකූලයත් යන දෙක දුරු කොට පියා උපේක්ෂා ඇති වැ ස්මෘතිමත් වැ සම්‍යග්ඥාන ඇති වැ වෙසෙන්නෙමි’ යි කැමැති වේ නම් එහි උපේක්ෂා ඇති වැ ස්මෘතිමත් වැ සම්‍යග්ඥාන ඇති වැ වෙසෙයි. ",
                "type": "paragraph"
            },
            {
                "text": "තවද ආනන්දය, මහණහට කනින් ශබ්ද අසා ... නැහැයෙන් ගඳ ආඝ්‍රාණය කොට ... දිවින් රස විඳ ... කයින් පහස් පැහැස ... මනසින් දහම් දැන මනාප උපදී, අමනාප උපදී, මනාපාමනාප උපදී. ඉදින් හෙතෙම ප්‍රතිකූලයෙහි අප්‍රතිකූලසංඥා ඇති වැ වෙසෙන්නෙමි’ යි කැමැති වේ නම් එහි අප්‍රතිකූලසංඥා ඇති වැ වෙසෙයි. ඉදින් අප්‍රති කූලයෙහි ප්‍රතිකූලසංඥා ඇති වැ වෙසෙන්නෙමි’ යි කැමැති වේ නම් එහි ප්‍රතිකූලසංඥා ඇති වැ වෙසෙයි. ඉදින් ප්‍රතිකූලයෙහිත් අප්‍රතිකූලයෙහිත් අප්‍රතිකූලසංඥා ඇති වැ වෙසෙන්නෙමි’ යි කැමැති වේ නම් එහි අප්‍රතිකූලසංඥා ඇති වැ වෙසෙයි. ඉදින් අප්‍රතිකූලයෙහිත් ප්‍රතිකූලයෙහි ද ප්‍රතිකූලසංඥා ඇති වැ වෙසෙන්නෙමි’ යි කැමැති වේ නම් එහි ප්‍රතිකූලසංඥා ඇති වැ වෙසෙයි. ඉදින් ප්‍රතිකූලය ද අප්‍රතිකූලය ද යන දෙක දුරු කොට පියා උපේක්ෂක වූයෙම් ස්මෘතිමත් වැ සම්‍යග්ඥාන ඇති වැ වෙසෙන්නෙමි’ යි කැමැති වේ නම් එහි උපේක්ෂක වූයේ ස්මෘතිමත් වැ සම්‍යග්ඥාන ඇති වැ වෙසෙයි. මෙසෙයින් ආනන්දය, ආර්‍ය්‍ය වැඩූ ඉඳුරන් ඇත්තේ වේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "625"
            },
            {
                "text": "ආනන්දය, මෙසේ මා විසින් ආර්‍ය්‍යවිනයෙහි අනුත්තර වූ ඉන්ද්‍රියභාවනා දෙසන ලදු. ශෛක්ෂප්‍රතිපදා ඇතියේ දෙසනලද, භාවිතෙන්ද්‍රිය වූ ආර්‍ය්‍ය තෙම දෙසන ලද. ආනන්දය, ශ්‍රාවකයනට හිතෛෂී වූ අනුකම්පා කරන ශාස්තෘහු අනුකම්පා පිණිස යමක් කටයුතු ද, මා විසින් තොපට එය කරන ලද. ආනන්දය, තෙල වෘක්ෂමූල සෙනසුන් වෙයි. තෙල ශුන්‍යාගාරයෝ වෙති. ආනන්දය, ධ්‍යාන කරව. නහමක් ප්‍රමාද වව. පසු වැ නහමක් විපිළිසර ඇති වව’ යි. මේ තොපට අපගේ අනුසසුන් වේ යයි.",
                "type": "paragraph"
            },
            {
                "text": "භාග්‍යවතුන් වහන්සේ මේ ඉන්ද්‍රියභාවනා සුත වදාළ සේක. ආයුෂ්මත් අනඳ තෙරණුවෝ සතුටු වූවාහු භාග්‍යවතුන් වහන්සේගේ භාෂිතය අනුමෝදනා කොළෝ.",
                "type": "paragraph"
            },
            {
                "text": "දස වැනි ඉන්ද්‍රියභාවනාසූත්‍ර යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "පස් වැනි සළායතන වර්ග යි.",
                "type": "centered",
                "level": 2
            },
            {
                "text": "උපරිපණ්ණාසකය සමාප්ත යි.",
                "type": "centered",
                "level": 2
            },
            {
                "text": "ඒ වර්ගයාගේ උද්දානය:",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "අනාථපිණ්ඩිකොවාද යැ, ඡන්නොවාද යැ පුණ්ණෝවාදය හා නන්දකරාහුලොවාදයෝ යැ ඡඡක්කසූත්‍ර යැ මහාසළායතනසූත්‍ර යැ නගරවින්දෙය්‍යසූත්‍රය හා පිණ්ඩපාතසුද්ධිකසූත්‍ර යැ ඉන්ද්‍රිය භාවනාසුත්‍ර යැ යි පස්වැනි අවවාද වර්ගය වේ.",
                "type": "paragraph"
            },
            {
                "text": "මේ වර්ගයන්ගේ උද්දානය :",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "දෙවදහවර්ගය ද අනුපදවර්ගය ද සුඤ්ඤතවර්ගය ද විබඞ්ගවර්ගය ද සළායතන වර්ගය දැ’ යි උපරිපණ්ණාසකයෙහි සිටි වර්ගයෝ යි.",
                "type": "paragraph"
            },
            {
                "text": "තුන් පනසෙකින් ප්‍රතිමණ්ඩිත වූ සියළු\n මධ්‍යමනිකාය සමාප්ත යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ]
    }
]