[
    {
        "filename": "sn-sgv-7",
        "bookId": 16,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "286"
            },
            {
                "type": "heading",
                "text": "7. බ්රාහ්මණසංයුත්තං",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. අරහන්තවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "7. 1. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ධනඤ්ජානීසුත්තං.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "187. එවං මෙ සුතං: එකං සමයං භගවා රාජගහෙ විහරති වෙළුවනෙ කලන්දකනිවාපෙ. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භාරද්වාජගොත්තස්ස බ්රාහ්මණස්ස ධනඤ්ජානී නාම බ්රාහ්මණී අභිප්පසන්නා හොති බුද්ධෙ ච ධම්මෙ ච සඞ්ඝෙ ච."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ධනඤ්ජානී බ්රාහ්මණී භාරද්වාජගොත්තස්ස බ්රාහ්මණස්ස භත්තං උපසංහරන්තී උපක්ඛලිත්වා{1 උපක්කමිත්වා - සීමු. ස්යා. PTS.} තික්ඛත්තුං උදානං උදානෙසි: නමො තස්ස භගවතො අරහතො සම්මාසම්බුද්ධස්ස. නමො තස්ස භගවතො අරහතො සම්මාසම්බුද්ධස්ස. නමො තස්ස භගවතො අරහතො සම්මාසම්බුද්ධස්සාති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ භාරද්වාජගොත්තො බ්රාහ්මණො ධනඤ්ජානිං බ්රාහ්මණිං එතදවොච: ‘එවමෙවං පනායං වසලි යස්මිං වා තස්මිං වා තස්ස මුණ්ඩකස්ස සමණස්ස වණ්ණං භාසති. ඉදානි ත්යාහං වසලි තස්ස සත්ථුනො වාදං ආරොපෙස්සාමීති."
            },
            {
                "type": "paragraph",
                "text": "න ඛ්වාහං තං බ්රාහ්මණ පස්සාමි සදෙවකෙ ලොකෙ සමාරකෙ සබ්රහ්මකෙ සස්සමණබ්රාහ්මණියා පජාය සදෙවමනුස්සාය යො තස්ස භගවතො වාදං ආරොපෙය්ය අරහතො සම්මාසම්බුද්ධස්ස. අපි ච ත්වං බ්රාහ්මණ ගච්ඡ ගන්ත්වා විජානිස්සසීති{2 ගන්ත්වාපි ජානිස්සතීති - ස්යා.}."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භාරද්වාජගොත්තො බ්රාහ්මණො කුපිතො අනත්තමනො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි, සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො භාරද්වාජගොත්තො බ්රාහ්මණො භගවන්තං ගාථාය අජ්ඣභාසි:"
            },
            {
                "type": "gatha",
                "text": "කිං සු ඣත්වා{3 ඡෙත්වා - මඡසං. ස්යා. PTS.} සුඛං සෙති කිං සු ඣත්වා න සොචති,\nකිස්සස්ස එකධම්මස්ස වධං රොචෙසි ගොතමාති."
            },
            {
                "type": "gatha",
                "text": "කොධං ඣත්වා සුඛං සෙති කොධං ඣත්වා න සොචති,\nකොධස්ස විසමූලස්ස මධුරග්ගස්ස බ්රාහ්මණ,\nවධං අරියා පසංසන්ති තං හි ඣත්වා න සොචතීති."
            },
            {
                "type": "page-break",
                "text": "288"
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ භාරද්වාජගොත්තො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම, අභික්කන්තං භො ගොතම. සෙය්යථාපි භො ගොතම නික්කුජ්ජිතං වා උක්කුජ්ජෙය්ය පටිච්ඡන්නං වා විවරෙය්ය මූළ්හස්ස වා මග්ගං ආචික්ඛෙය්ය, අන්ධකාරෙ වා තෙලපජ්ජොතං ධාරෙය්ය චක්ඛුමන්තො රූපානි දක්ඛින්තීති. එවමෙවං{1 එවමෙව - ස්යා. සීමු.} භොතා ගොතමෙන අනෙකපරියායෙන ධම්මො පකාසිතො. එසාහං භගවන්තං ගොතමං සරණං ගච්ඡාමි ධම්මඤ්ච භික්ඛුසඞ්ඝඤ්ච. ලභෙය්යාහං භොතො ගොතමස්ස සන්තිකෙ පබ්බජ්ජං, ලභෙය්යං උපසම්පදන්ති."
            },
            {
                "type": "paragraph",
                "text": "අලත්ථ ඛො භාරද්වාජගොත්තො බ්රාහ්මණො භගවතො සන්තිකෙ පබ්බජ්ජං, අලත්ථ උපසම්පදං, අචිරූපසම්පන්නො ඛො පනායස්මා භාරද්වාජො එකො වූපකට්ඨො අප්පමත්තො ආතාපී පහිතත්තො විහරන්තො න චිරස්සෙව යස්සත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජන්ති, තදනුත්තරං බ්රහ්මචරියපරියොසානං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහාසි. ඛීණා ජාති, වුසිතං බ්රහ්මචරියං, කතං කරණීයං. නාපරං ඉත්ථත්තායාති අබ්භඤ්ඤාසි. අඤ්ඤතරො ච පනායස්මා භාරද්වාජො අරහතං අහොසීති."
            },
            {
                "type": "centered",
                "text": "7. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අක්කොසසුත්තං.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "188. එකං සමයං භගවා රාජගහෙ විහරති වෙළුවනෙ කලන්දකනිවාපෙ. අස්සොසි ඛො අක්කොසකභාරද්වාජො බ්රාහ්මණො භාරද්වාජගොත්තො කිර බ්රාහ්මණො සමණස්ස ගොතමස්ස සන්තිකෙ අගාරස්මා අනගාරියං පබ්බජිතොති. කුපිතො අනත්තමනො යෙන භගවා තෙනුපසඞ්කමි, උපසඞ්කමිත්වා භගවන්තං අසබ්භාහි ඵරුසාහි වාචාහි අක්කොසති පරිභාසති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ භගවා අක්කොසකභාරද්වාජං බ්රාහ්මණං එතදවොච: තං කිං මඤ්ඤසි බ්රාහ්මණ අපි නු ඛො තෙ ආගච්ඡන්ති මිත්තාමච්චා ඤාතිසාලොහිතා අතිථයොති{2 අතිථියො - මඡසං. ස්යා. PTS.}. අප්පෙකදා මෙ භො ගොතම ආගච්ඡන්ති මිත්තාමච්චා ඤාතිසාලොහිතා අතිථයොති."
            },
            {
                "type": "paragraph",
                "text": "තං කිං මඤ්ඤසි බ්රාහ්මණ, අපි නු තෙසං අනුප්පදෙසි ඛාදනීයං වා භොජනීයං වා සායනීයං වාති?"
            },
            {
                "type": "paragraph",
                "text": "අප්පෙකදා නෙසාහං භො ගොතම අනුප්පදෙමි ඛාදනීයං වා භොජනීයං වා සායනීයං වාති."
            },
            {
                "type": "paragraph",
                "text": "සචෙ ඛො පන තෙ බ්රාහ්මණ නප්පටිග්ගණ්හන්ති කස්ස තං හොතීති."
            },
            {
                "type": "paragraph",
                "text": "සචෙ තෙ භො ගොතම නප්පටිග්ගණ්හන්ති අම්හාකමෙව තං හොතීති."
            },
            {
                "type": "page-break",
                "text": "290"
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො බ්රාහ්මණ යං ත්වං අම්හෙ අනක්කොසන්තෙ අක්කොසසි, අරොසෙන්තෙ{1 ආරොසන්තෙ - මඡසං. ස්යා.} රොසෙසි, අභණ්ඩන්තෙ භණ්ඩසි, තං තෙ මයං නප්පටිග්ගණ්හාම. තවෙවෙතං බ්රාහ්මණ හොතීති. යො ඛො බ්රාහ්මණ අක්කොසන්තං පච්චක්කොසති, රොසෙන්තං පටිරොසෙති, භණ්ඩන්තං පටිභණ්ඩති, අයං වුච්චති බ්රාහ්මණ සම්භුඤ්ජති වීතිහරති. තෙ මයං තයා නෙව සම්භුඤ්ජාම න වීතිහරාම තවෙවෙතං බ්රාහ්මණ හොති, තවෙවෙතං බ්රාහ්මණ හොතීති."
            },
            {
                "type": "unindented",
                "text": "[බ්රාහ්මණො:]"
            },
            {
                "type": "paragraph",
                "text": "භවන්තං ඛො ගොතමං සරාජිකා පරිසා එවං ජානාති: අරහං සමණො ගොතමොති. අථ ච පන භවං ගොතමො කුජ්ඣතීති."
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "අක්කොධස්ස කුතො කොධො දන්තස්ස සමජීවිනො,\nසම්මදඤ්ඤා විමුත්තස්ස උපසන්තස්ස තාදිනො."
            },
            {
                "type": "gatha",
                "text": "තස්සෙව තෙන පාපියො යො කුද්ධං පටිකුජ්ඣති,\nකුද්ධං අප්පටිකුජ්ඣන්තො සඞ්ගාමං ජෙති දුජ්ජයං."
            },
            {
                "type": "gatha",
                "text": "උභින්නමත්ථං චරති අත්තනො ච පරස්ස ච,\nපරං සඞ්කුපිතං ඤත්වා යො සතො උපසම්මති."
            },
            {
                "type": "gatha",
                "text": "උභින්නං තිකිච්ඡන්තං{2 තිකිච්ඡන්තානං - සීමු.} අත්තනො ච පරස්ස ච;\nජනා මඤ්ඤන්ති බාලොති යෙ ධම්මස්ස අකොවිදාති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ අක්කොසකභාරද්වාජො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම, -පෙ- එසාහං භවන්තං ගොතමං සරණං ගච්ඡාමි, ධම්මඤ්ච භික්ඛුසඞ්ඝඤ්ච. ලභෙය්යාහං භොතො ගොතමස්ස සන්තිකෙ පබ්බජ්ජං ලභෙය්යං උපසම්පදන්ති.\n\nඅලත්ථ ඛො අක්කොසකභාරද්වාජො බ්රාහ්මණො භගවතො සන්තිකෙ පබ්බජ්ජං, අලත්ථ උපසම්පදං. අචිරූපසම්පන්නො ඛො පනායස්මා අක්කොසකභාරද්වාජො එකො වූපකට්ඨො අප්පමත්තො ආතාපී පහිතත්තො විහරන්තො න චිරස්සෙව යස්සත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජන්ති, තදනුත්තරං බ්රහ්මචරියපරියොසානං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහාසි. ඛීණා ජාති, වුසිතං බ්රහ්මචරියං, කතං කරණීයං, නාපරං ඉත්ථත්තායාති අබ්භඤ්ඤාසි. අඤ්ඤතරො ච පනායස්මා භාරද්වාජො අරහතං අහොසීති."
            },
            {
                "type": "page-break",
                "text": "292"
            },
            {
                "type": "centered",
                "text": "7. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අසුරින්දකසුත්තං.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "189. එකං සමයං භගවා රාජගහෙ විහරති වෙළුවනෙ කලන්දකනිවාපෙ. අස්සොසි ඛො අසුරින්දකභාරද්වාජො බ්රාහ්මණො භාරද්වාජගොත්තො කිර{1 බ්රාහ්මණො කිර - මඡසං. PTS.} බ්රාහ්මණො සමණස්ස ගොතමස්ස සන්තිකෙ අගාරස්මා අනගාරියං පබ්බජිතොති. කුපිතො අනත්තමනො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අසබ්භාහි ඵරුසාහි වාචාහි අක්කොසති පරිභාසති. එවං වුත්තෙ, භගවා තුණ්හී අහොසි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො අසුරින්දකභාරද්වාජො බ්රාහ්මණො භගවන්තං එතදවොච: ජිතො’සි සමණ, ජිතො’සි සමණාති."
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "ජයං වෙ මඤ්ඤති බාලො වාචාය ඵරුසං භණං,\nජයං චෙ වස්ස තං හොති යා තිතික්ඛා විජානතො."
            },
            {
                "type": "gatha",
                "text": "තස්සෙව තෙන පාපියො යො කුද්ධං පටිකුජ්ඣති,\nකුද්ධං අප්පටිකුජ්ඣන්තො සඞ්ගාමං ජෙති දුජ්ජයං."
            },
            {
                "type": "gatha",
                "text": "උභින්නමත්ථං චරති අත්තනො ච පරස්ස ච,\nපරං සංකුපිතං ඤත්වා යො සතො උපසම්මති."
            },
            {
                "type": "gatha",
                "text": "උභින්නං තිකිච්ඡන්තං{2 තිකිච්ඡන්තානං - සීමු.} අත්තනො ච පරස්ස ච,\nජනා මඤ්ඤන්ති බාලොති යෙ ධම්මස්ස අකොවිදාති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ අසුරින්දකභාරද්වාජො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම, -පෙ- අබ්භඤ්ඤාසි. අඤ්ඤතරො ච පනායස්මා භාරද්වාජො අරහතං අහොසීති."
            },
            {
                "type": "centered",
                "text": "7. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "බිලඞ්ගිකසුත්තං.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "190. එකං සමයං භගවා රාජගහෙ විහරති වෙළුවනෙ කලන්දකනිවාපෙ. අස්සොසි ඛො බිලඞ්ගිකභාරද්වාජො බ්රාහ්මණො භාරද්වාජගොත්තො කිර බ්රාහ්මණො සමණස්ස ගොතමස්ස සන්තිකෙ අගාරස්මා අනගාරියං පබ්බජිතොති. කුපිතො අනත්තමනො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා තුණ්හීභූතො එකමන්තං අට්ඨාසි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා බිලඞ්ගිකභාරද්වාජස්ස{3 ඛිලඞ්ගිකස්ස භාරද්වාජස්ස - මඡසං. PTS. ඛිලඞ්ගිකභාරද්වාජගොත්තස්ස - සීමු 1.} බ්රාහ්මණස්ස චෙතසා චෙතො පරිවිතක්කමඤ්ඤාය බිලඞ්ගිකභාරද්වාජං{4 ඛිලඞ්ගිකං භාරද්වාජං - මඡසං. PTS.} බ්රාහ්මණං ගාථාය අජ්ඣභාසි:"
            },
            {
                "type": "gatha",
                "text": "යො අප්පදුට්ඨස්ස නරස්ස දුස්සති සුද්ධස්ස පොසස්ස අනඞ්ගණස්ස,\nතමෙව බාලං පච්චෙති පාපං සුඛුමො රජො පටිවාතංව ඛිත්තොති."
            },
            {
                "type": "page-break",
                "text": "294"
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ බිලඞ්ගිකභාරද්වාජො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම -පෙ- අඤ්ඤතරො ච පනායස්මා භාරද්වාජො අරහතං අහොසීති."
            },
            {
                "type": "centered",
                "text": "7. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අහිංසකසුත්තං.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "191.** සාවත්ථියං{1 එකං සමයං -පෙ- අනාථපිණ්ඩිකස්ස ආරාමෙ - සීමු. 1. 2.}---**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො අහිංසකභාරද්වාජො බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො අහිංසකභාරද්වාජො බ්රාහ්මණො භගවන්තං එතදවොච: අහිංසකාහං භො ගොතම අහිංසකාහං භො ගොතමාති."
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "යථා නාමං තථා චස්ස සියා ඛො ත්වං අහිංසකො,\nයො ච කායෙන වාචාය මනසා ච න හිංසති,\nස වෙ අහිංසකො හොති යො පරං න විහිංසතීති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ අහිංසකභාරද්වාජො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම -පෙ- අඤ්ඤතරො ච පනායස්මා භාරද්වාජො අරහතං අහොසීති."
            },
            {
                "type": "centered",
                "text": "7. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ජටාසුත්තං.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "192. එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ, අථ ඛො ජටාභාරද්වාජො බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ජටාභාරද්වාජො බ්රාහ්මණො භගවන්තං ගාථාය අජ්ඣභාසි:"
            },
            {
                "type": "gatha",
                "text": "අන්තොජටා බහි ජටා ජටාය ජටිතා පජා,\nතං තං ගොතම පුච්ඡාමි කො ඉමං විජටයෙ ජටන්ති."
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "සීලෙ පතිට්ඨාය නරො සපඤ්ඤො චිත්තං පඤ්ඤඤ්ච භාවයං,\nආතාපී නිපකො භික්ඛු සො ඉමං විජටයෙ ජටං."
            },
            {
                "type": "gatha",
                "text": "යෙසං රාගො ච දොසො ච අවිජ්ජා ච විරාජිතා,\nඛීණාසවා අරහන්තො තෙසං විජටිතා ජටා."
            },
            {
                "type": "page-break",
                "text": "296"
            },
            {
                "type": "gatha",
                "text": "යත්ථ නාමඤ්ච රූපඤ්ච අසෙසං උපරුජ්ඣති,\nපටිඝං රූපසඤ්ඤා ච එත්ථෙසා{1 එත්ථ සා - PTS.} ඡිජ්ජතෙ ජටාති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ ජටාභාරද්වාජො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම -පෙ- අඤ්ඤතරො ච පනායස්මා භාරද්වාජො අරහතං අහොසීති."
            },
            {
                "type": "centered",
                "text": "7. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුද්ධිකසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "193. **සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො සුද්ධිකභාරද්වාජො බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො සුද්ධිකභාරද්වාජො බ්රාහ්මණො භගවතො සන්තිකෙ ඉමං ගාථං අභාසි:"
            },
            {
                "type": "gatha",
                "text": "න බ්රාහ්මණො සුජ්ඣති කොචි ලොකෙ සීලවාපි තපොකරං,\nවිජ්ජාචරණසම්පන්නො සො සුජ්ඣති න අඤ්ඤා ඉතරා පජාති."
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "බහුම්පි පලපං ජප්පං න ජච්චා හොති බ්රාහ්මණො,\nඅන්තො කසම්බුසංකිලිට්ඨො කුහනං උපනිස්සිතො."
            },
            {
                "type": "gatha",
                "text": "ඛත්තියො බ්රාහ්මණො වෙස්සො සුද්දො චණ්ඩාලපුක්කුසො,\nආරද්ධවිරියො පහිතත්තො නිච්චං දළ්හපරක්කමො,\nපප්පොති පරමං සුද්ධිං එවං ජානාහි බ්රාහ්මණාති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ සුද්ධිකභාරද්වාජො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම -පෙ- අඤ්ඤතරො ච පනායස්මා භාරද්වාජො අරහතං අහොසීති."
            },
            {
                "type": "centered",
                "text": "7. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අග්ගිකසුත්තං.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "194. එකං සමයං භගවා රාජගහෙ විහරති වෙළුවනෙ කලන්දකනිවාපෙ. තෙන ඛො පන සමයෙන අග්ගිකභාරද්වාජස්ස බ්රාහ්මණස්ස සප්පිනා පායාසො සන්නිහිතො හොති අග්ගිං ජුහිස්සාමි. අග්ගිහුත්තං පරිචරිස්සාමීති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය රාජගහං පිණ්ඩාය පාවිසි. රාජගහෙ සපදානං පිණ්ඩාය චරමානො යෙන අග්ගිකභාරද්වාජස්ස බ්රාහ්මණස්ස නිවෙසනං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා එකමන්තං අට්ඨාසි."
            },
            {
                "type": "page-break",
                "text": "298"
            },
            {
                "type": "paragraph",
                "text": "අද්දසා ඛො අග්ගිකභාරද්වාජො බ්රාහ්මණො භගවන්තං පිණ්ඩාය ඨිතං{1 චරන්තං - PTS.}. දිස්වාන භගවන්තං ගාථාය අජ්ඣභාසි:"
            },
            {
                "type": "gatha",
                "text": "තීහි විජ්ජාහි සම්පන්නො ජාතිමා සුතවා බහූ,\nවිජ්ජාචරණසම්පන්නො සො මං භුඤ්ජෙය්ය පායසන්ති{2 පායාසන්ති - PTS.}."
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "බහුම්පි පලපං ජප්පං න ජච්චා හොති බ්රාහ්මණො,\nඅන්තො කසම්බුසංකිලිට්ඨො කුහනා පරිවාරිතො."
            },
            {
                "type": "gatha",
                "text": "පුබ්බෙ නිවාසං යො වෙදී සග්ගාපායඤ්ච පස්සති,\nඅථො ජාතික්ඛයං පත්තො අභිඤ්ඤා වොසිතො මුනි."
            },
            {
                "type": "gatha",
                "text": "එතාහි තීහි විජ්ජාහි තෙවිජ්ජො හොති බ්රාහ්මණො,\nවිජ්ජාචරණසම්පන්නො සො මං භුඤ්ජෙය්ය පායසන්ති{3 පායාසන්ති - PTS.}."
            },
            {
                "type": "unindented",
                "text": "[බ්රාහ්මණො:]"
            },
            {
                "type": "paragraph",
                "text": "භුඤ්ජතු භවං{4 භවං භො ගොතම - PTS.} ගොතමො. බ්රාහ්මණො භවන්ති."
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "paragraph",
                "text": "ගාථාභිගීතං මෙ අභොජනෙය්යං{5 අභොජනීයං - PTS.} සම්පස්සතං බ්රාහ්මණ නෙස ධම්මො,\nගාථාභිගීතං පනුදන්ති බුද්ධා ධම්මෙ සති බ්රාහ්මණ වුත්තිරෙසා."
            },
            {
                "type": "paragraph",
                "text": "අඤ්ඤෙන ච කෙවලිනං මහෙසිං ඛීණාසවං කුක්කුච්චවූපසන්තං,\nඅන්නෙන පානෙන උපට්ඨහස්සු ඛෙත්තං හි තං පුඤ්ඤපෙක්ඛස්ස හොතීති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ අග්ගිකභාරද්වාජො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම -පෙ- අඤ්ඤතරො ච පනායස්මා භාරද්වාජො අරහතං අහොසීති."
            },
            {
                "type": "centered",
                "text": "7. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුන්දරිකසුත්තං.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "195. එකං සමයං භගවා කොසලෙසු විහරති සුන්දරිකාය නදියා තීරෙ. තෙන ඛො පන සමයෙන සුන්දරිකභාරද්වාජො බ්රාහ්මණො සුන්දරිකාය නදියා තීරෙ අග්ගිං ජුහති. අග්ගිහුත්තං පරිචරති. අථ ඛො සුන්දරිකභාරද්වාජො බ්රාහ්මණො අග්ගිං ජුහිත්වා අග්ගිහුත්තං පරිචරිත්වා උට්ඨායාසනා සමන්තා චතුද්දිසා අනුවිලොකෙසි: කො නු ඛො ඉමං හබ්යසෙසං භුඤ්ජෙය්යාති. අද්දසා ඛො සුන්දරිකභාරද්වාජො බ්රාහ්මණො භගවන්තං අඤ්ඤතරස්මිං රුක්ඛමූලෙ සසීසං{6 සීසං - PTS.} පාරුතං නිසින්නං. දිස්වාන වාමෙන හත්ථෙන හව්යසෙසං ගහෙත්වා දක්ඛිණෙන හත්ථෙන කමණ්ඩලුං ගහෙත්වා යෙන භගවා තෙනුපසඞ්කමි."
            },
            {
                "type": "page-break",
                "text": "300"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා සුන්දරිකභාරද්වාජස්ස බ්රාහ්මණස්ස පදසද්දෙන සීසං විවරි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො සුන්දරිකභාරද්වාජො බ්රාහ්මණො මුණ්ඩො අයං භවං මුණ්ඩකො අයං භවන්ති තතොව පුන නිවත්තිතුකාමො අහොසි. අථ ඛො සුන්දරිකභාරද්වාජස්ස බ්රාහ්මණස්ස එතදහොසි: මුණ්ඩාපි හි ඉධෙකච්චෙ බ්රාහ්මණා භවන්ති. යන්නූනාහං තං උපසඞ්කමිත්වා ජාතිං පුච්ඡෙය්යන්ති. අථ ඛො සුන්දරිකභාරද්වාජො බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං එතදවොච: කිංජච්චො භවන්ති."
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "මා ජාතිං පුච්ඡ චරණඤ්ච පුච්ඡ කට්ඨා හවෙ ජායති ජාතවෙදො,\nනීචා කුලීනොපි මුනී ධිතීමා ආජානීයො හොති හිරීනිසෙධො."
            },
            {
                "type": "gatha",
                "text": "සච්චෙන දන්තො දමසා උපෙතො වෙදන්තගූ වුසිතබ්රහ්මචරියො,\nයඤ්ඤූපනීතො තමුපව්හයෙථ කාලෙන සො ජුහති දක්ඛිණෙය්යොති."
            },
            {
                "type": "unindented",
                "text": "[බ්රාහ්මණො:]"
            },
            {
                "type": "gatha",
                "text": "අද්ධා සුයිට්ඨං සුහුතං මමයිදං යං තාදිසං වෙදගුමද්දසාමි,\nතුම්හාදිසානං හි අදස්සනෙන අඤ්ඤො ජනො භුඤ්ජති හව්යසෙසන්ති."
            },
            {
                "type": "paragraph",
                "text": "භුඤ්ජතු භවං ගොතමො. බ්රාහ්මණො භවන්ති."
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "ගාථාභිගීතං මෙ අභොජනෙය්යං සම්පස්සතං බ්රාහ්මණ නෙසධම්මො,\nගාථාභිගීතං පනුදන්ති බුද්ධා ධම්මෙ සති බ්රාහ්මණ වුත්තිරෙසා."
            },
            {
                "type": "gatha",
                "text": "අඤ්ඤෙන ච{1 චෙ - PTS.} කෙවලිනං මහෙසිං ඛීණාසවං කුක්කුච්චවූපසන්තං,\nඅන්නෙන පානෙන උපට්ඨහස්සු ඛෙත්තං හි තං පුඤ්ඤපෙක්ඛස්ස හොතීති."
            },
            {
                "type": "unindented",
                "text": "[බ්රාහ්මණො:]"
            },
            {
                "type": "paragraph",
                "text": "අථ කස්ස චාහං භො ගොතම ඉමං හව්යසෙසං{2 හබ්යසෙසං - මඡසං. ස්යා.} දම්මීති."
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "paragraph",
                "text": "න ඛ්වාහන්තං{3 න ඛවාහං - මඡසං. PTS.} බ්රාහ්මණ පස්සාමි සදෙවකෙ ලොකෙ සමාරකෙ සබ්රහ්මකෙ සස්සමණබ්රාහ්මණියා පජාය සදෙවමනුස්සාය යස්සෙසො හව්යසෙසො{4 හබ්යසෙසො - මඡසං. ස්යා.} භුත්තො සම්මා පරිණාමං ගච්ඡෙය්ය අඤ්ඤත්ර බ්රාහ්මණ{5 බ්රාහ්මණානි - නත්ථි. ස්යා.} තථාගතස්ස වා තථාගතසාවකස්ස වා. තෙන හි ත්වං බ්රාහ්මණ තං හව්යසෙසං{6 හබ්යසෙසො - මඡසං. ස්යා.} අප්පහරිතෙ වා ඡඩ්ඩෙහි අප්පාණකෙ වා උදකෙ ඔපිලාපෙහීති."
            },
            {
                "type": "page-break",
                "text": "302"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො සුන්දරිකභාරද්වාජො බ්රාහ්මණො තං හව්යසෙසං{1 දිවසං - මඡසං. ගාථාය. සීමු. PTS.} අප්පාණකෙ උදකෙ ඔපිලාපෙසි. අථ ඛො සො හව්යසෙසො උදකෙ පක්ඛිත්තො චිච්චිටායති, චිටිචිටායති, සන්ධූපායති, සම්පධූපායති. සෙය්යථාපි නාම ඵාලො දිවස{2 දිවසං - මඡසං. ගාථාය. සීමු. PTS.} සන්තත්තො උදකෙ පක්ඛිත්තො චිච්චිටායති, චිටිචිටායති, සන්ධූපායති, සම්පධූපායති, එවමෙව සො හව්යසෙසො උදකෙ පක්ඛිත්තො චිච්චිටායති, චිටිචිටායති, සන්ධූපායති, සම්පධූපායති.\n\nඅථ ඛො සුන්දරිකභාරද්වාජො බ්රාහ්මණො සංවිග්ගො ලොමහට්ඨජාතො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතං ඛො සුන්දරිකභාරද්වාජං බ්රාහ්මණං භගවා ගාථාහි අජ්ඣභාසි:"
            },
            {
                "type": "gatha",
                "text": "මා බ්රාහ්මණ දාරුසමාදහානො සුද්ධිං අමඤ්ඤී බහිද්ධා හි එතං,\nන හි තෙන සුද්ධිං කුසලා වදන්ති යො බාහිරෙන පරිසුද්ධිමිච්ඡෙ."
            },
            {
                "type": "gatha",
                "text": "හිත්වා අහං බ්රාහ්මණ දාරුදාහං අජ්ඣත්තමෙව ජලයාමි{3 අජ්ඣත්තමෙවුජ්ජලයාමි - මඡසං.} ජොතිං,\nනිච්චග්ගිනි{4 නිච්චග්ගිනී - කත්ථචි.} නිච්චසමාහිතත්තො අරහං අහං බ්රහ්මචරියං චරාමි."
            },
            {
                "type": "gatha",
                "text": "මානො හි තෙ බ්රාහ්මණ ඛාරිභාරො කොධො ධුමො භස්මනි මොසවජ්ජං,{5 භස්මනිම්මොසමජ්ජං - ස්යා.}\nජිව්හා සුජා හදයං ජොතිඨානං අත්තා සුදන්තො පුරිසස්ස ජොති."
            },
            {
                "type": "gatha",
                "text": "ධම්මො රහදො බ්රාහ්මණ සීලතිත්ථො අනාවිලො සබ්භි සතං පසත්ථො,\nයත්ථ හවෙ වෙදගුනො සිනාතා අනල්ලගත්තා{6 අනල්ලීන ගත්තාව - PTS.}ව තරන්ති පාරං."
            },
            {
                "type": "gatha",
                "text": "සච්චං ධම්මො සංයමො බ්රහ්මචරියං මජ්ඣෙසිතා බ්රාහ්මණ බ්රහ්මපත්ති,\nස තුජ්ජුභූතෙසු නමො කරොහි තමහං නරං ධම්මසාරීති බ්රෑමීති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ සුන්දරිකභාරද්වාජො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම -පෙ- අඤ්ඤතරො ච පනායස්මා භාරද්වාජො අරහතං අහොසීති."
            },
            {
                "type": "centered",
                "text": "7. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "බහුධීතුසුත්තං.{7 බහුධීති සුත්තං - සීමු 1. 2.}",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "196. එකං සමයං භගවා කොසලෙසු විහරති අඤ්ඤතරස්මිං වනසණ්ඩෙ. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භාරද්වාජගොත්තස්ස බ්රාහ්මණස්ස චතුද්දස බලිවද්දා{8 බලිවදදා - මඡසං.} නට්ඨා හොන්ති. අථ ඛො භාරද්වාජගොත්තො බ්රාහ්මණො තෙ බලිවද්දෙ{9 බලිවදදා - මඡසං.} ගවෙසන්තො යෙන සො වනසණ්ඩො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා අද්දස භගවන්තං තස්මිං වනසණ්ඩෙ නිසින්නං පල්ලඞ්කං ආභුජිත්වා උජුං කායං පණිධාය පරිමුඛං සතිං උපට්ඨපෙත්වා. දිස්වාන යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතො සන්තිකෙ ඉමා ගාථායො අභාසි:"
            },
            {
                "type": "page-break",
                "text": "304"
            },
            {
                "type": "gatha",
                "text": "න හි{1 නහ - සබ්බත්ථා. සීමු. ස්යා. සී 2.} නූනිමස්ස සමණස්ස බලිවද්දා චතුද්දස,\nඅජ්ජ සට්ඨි න දිස්සන්ති තෙනායං සමණො සුඛී."
            },
            {
                "type": "gatha",
                "text": "න හි නූනිමස්ස සමණස්ස තිලා ඛෙත්තස්මිං{2 ඛෙත්තස්මි - මඡසං. ස්යා.} පාපකා{3 පාපිකා - සීමු. PTS.},\nඑකපණ්ණා දුපණ්ණා{4 ද්විපණ්ණා - සීමු. PTS.} ච තෙනායං සමණො සුඛී."
            },
            {
                "type": "gatha",
                "text": "න හි නූනිමස්ස සමණස්ස තුච්ඡකොට්ඨස්මිං{5 තුච්ඡකොටස්මි - මඡසං. ස්යා.} මූසිකා,\nඋස්සොළ්හිකාය නච්චන්ති තෙනායං සමණො සුඛී."
            },
            {
                "type": "gatha",
                "text": "න හි නූනිමස්ස සමණස්ස, සන්ථාරො සත්තමාසිකො,\nඋප්පාටකෙහි{6 උප්පාදකෙහි - සීමු. ස්යා.} සංඡන්නො තෙනායං සමනො සුඛී."
            },
            {
                "type": "gatha",
                "text": "න හි නූනිමස්ස සමණස්ස විධවා සත්ත{7 පුත්ත - සීමු. ස්යා.}ධීතරො,\nඑකපුත්තා දුපුත්තා ච තෙනායං සමණො සුඛී."
            },
            {
                "type": "gatha",
                "text": "න හි නූනිමස්ස සමණස්ස පිඞ්ගලා තිලකාහතා,\nසොත්තං පාදෙන බොධෙති{8 පොථෙති - ස්යා.} තෙනායං සමණො සුඛී."
            },
            {
                "type": "gatha",
                "text": "න හි නූනිමස්ස සමණස්ස පච්චූසම්හි ඉණායිකා,\nදෙථ දෙථාති චොදෙන්ති තෙනායං සමණො සුඛීති."
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "න හි මය්හං බ්රාහ්මණ බලිවද්දා චතුද්දස,\nඅජ්ජ සට්ඨි න දිස්සන්ති තෙනාහං බ්රාහ්මණා සුඛී."
            },
            {
                "type": "gatha",
                "text": "න හි මය්හං බ්රාහ්මණ තිලාඛෙත්තම්හි පාපකා,\nඑකපණ්ණා දුපණ්ණා ච තෙනාහං බ්රාහ්මණා{9 බ්රාහ්මණ - ස්යා. PTS.} සුඛී."
            },
            {
                "type": "gatha",
                "text": "න හි මය්හං බ්රාහ්මණ තුච්ඡකොට්ඨස්මිං මූසිකා,\nඋස්සොළ්හිකාය නච්චන්ති තෙනාහං බ්රාහ්මණා{10 බ්රාහ්මණ - ස්යා. PTS.} සුඛී."
            },
            {
                "type": "gatha",
                "text": "න හි මය්හං බ්රාහ්මණ සන්ථාරො සත්තමාසිකො,\nඋප්පාටකෙහි සඤ්ඡන්නො තෙනාහං බ්රාහ්මණා{11 බ්රාහ්මණ - ස්යා. PTS.} සුඛී."
            },
            {
                "type": "gatha",
                "text": "න හි මය්හං බ්රාහ්මණ විධවා සත්තධීතරො,\nඑකපුත්තා දුපුත්තා ච තෙනාහං බ්රාහ්මණා{12 බ්රාහ්මණ - ස්යා. PTS.} සුඛී."
            },
            {
                "type": "gatha",
                "text": "න හි මය්හං බ්රාහ්මණ පිඞ්ගලා තිලකාහතා,\nසොත්තං පාදෙන බොධෙති{13 පොථෙති - ස්යා.} තෙනාහං බ්රාහ්මණා{14 බ්රාහ්මණ - ස්යා. PTS.} සුඛී."
            },
            {
                "type": "page-break",
                "text": "306"
            },
            {
                "type": "gatha",
                "text": "න හි මය්හං බ්රාහ්මණ පච්චූසම්හි ඉණායිකා,\nදෙථ දෙථාති චොදෙන්ති තෙනාහං බ්රාහ්මණා සුඛීති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ භාරද්වාජගොත්තො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම අභික්කන්තං භො ගොතම. සෙය්යථාපි භො ගොතම නික්කුජ්ජිතං වා උක්කුජ්ජෙය්ය, පටිච්ඡන්නං වා විවරෙය්ය මූළ්හස්ස වා මග්ගං ආචික්ඛෙය්ය අන්ධකාරෙ වා තෙලපජ්ජොතං ධාරෙය්ය චක්ඛුමන්තො රූපානි දක්ඛින්ති, එවමෙවං භොතා ගොතමෙන අනෙකපරියායෙන ධම්මො පකාසිතො. එසාහං භවන්තං ගොතමං සරණං ගච්ඡාමි ධම්මඤ්ච භික්ඛුසඞ්ඝඤ්ච. ලභෙය්යාහං භොතො ගොතමස්ස සන්තිකෙ පබ්බජ්ජං ලභෙය්යං උපසම්පදන්ති."
            },
            {
                "type": "paragraph",
                "text": "අලත්ථ ඛො භාරද්වාජගොත්තො බ්රාහ්මණො භගවතො සන්තිකෙ පබ්බජ්ජං අලත්ථ උපසම්පදං. අචිරූපසම්පන්නො ච පනායස්මා භාරද්වාජො එකො වූපකට්ඨො අප්පමත්තො ආතාපී පහිතත්තො විහරන්තො න චිරස්සෙව යස්සත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජන්ති, තදනුත්තරං බ්රහ්මචරියපරියොසානං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහාසි. ඛීණා ජාති, වුසිතං බ්රහ්මචරියං, කතං කරණීයං, නාපරං ඉත්ථත්තායාති අබ්භඤ්ඤාසි. අඤ්ඤතරො ච පනායස්මා භාරද්වාජො අරහතං අහොසීති."
            },
            {
                "type": "centered",
                "text": "අරහන්තවග්ගො පඨමො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "ධනඤ්ජානී{1 ධානඤ්ජානී - සීමු.} ච අක්කොසං අසුරින්දං බිලඞ්ගිකං,\nඅහිංසකං ජටා චෙව සුද්ධිකඤ්චෙ ව අග්ගිකා,\nසුන්දරිකං බහුධීතුකෙන{2 ධීතියෙන - ස්යා. PTS.} ච තෙ දසාති."
            },
            {
                "type": "heading",
                "text": "2. උපාසකවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "7. 2. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කසීසුත්තං.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "197. එවං මෙ සුතං: එකං සමයං භගවා මගධෙසු විහරති දක්ඛිණාගිරිස්මිං එකනාළායං බ්රාහ්මණගාමෙ. තෙන ඛො පන සමයෙන කසිභාරද්වාජස්ස බ්රාහ්මණස්ස පඤ්චමත්තානි නඞ්ගලසතානි පයුත්තානි හොන්ති වප්පකාලෙ."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය යෙන කසිභාරද්වාජස්ස බ්රාහ්මණස්ස කම්මන්තො තෙනුපසඞ්කමි. තෙන ඛො පන සමයෙන කසිභාරද්වාජස්ස බ්රාහ්මණස්ස පරිවෙසනා වත්තති. අථ ඛො භගවා යෙන පරිවෙසනා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා එකමන්තං අට්ඨාසි."
            },
            {
                "type": "page-break",
                "text": "308"
            },
            {
                "type": "paragraph",
                "text": "අද්දසා ඛො කසිභාරද්වාජො බ්රාහ්මණො භගවන්තං පිණ්ඩාය ඨිතං. දිස්වාන භගවන්තං එතදවොච: අහං ඛො සමණ කසාමි ච වපාමි ච. කසිත්වා ච වපිත්වා ච භුඤ්ජාමි. ත්වම්පි සමණ කසස්සු ච, වපස්සු ච, කසිත්වා ච වපිත්වා ච භුඤ්ජස්සූති."
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "අහම්පි ඛො බ්රාහ්මණ කසාමි ච වපාමි ච කසිත්වා ච වපිත්වා ච භුඤ්ජාමීති."
            },
            {
                "type": "unindented",
                "text": "[බ්රාහ්මණො:]"
            },
            {
                "type": "paragraph",
                "text": "න ඛො පන මයං{1 නඛොමයං - මඡසං. PTS.} පස්සාම භොතො ගොතමස්ස යුගං වා නඞ්ගලං වා ඵාලං වා පාචනං වා බලිවද්දෙ වා. අථ ච පන භවං ගොතමො එවමාහ. අහම්පි ඛො බ්රාහ්මණ කසාමි ච වපාමි ච කසිත්වා ච වපිත්වා ච භුඤ්ජාමීති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො කසීභාරද්වාජො බ්රාහ්මණො භගවන්තං ගාථාය අජ්ඣභාසි:"
            },
            {
                "type": "gatha",
                "text": "කස්සකො පටිජානාසි න ච පස්සාමි තෙ කසිං,\nකස්සකො පුච්ඡිතො බ්රෑහි කථං ජානෙමු තං කසින්ති?"
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "සද්ධා බීජං තපො වුට්ඨී පඤ්ඤා මෙ යුගනඞ්ගලං,\nහිරි{2 හිරී - මඡසං. PTS.} ඊසා මනො යොත්තං සති මෙ ඵාලපාචනං."
            },
            {
                "type": "gatha",
                "text": "කායගුත්තො වචීගුත්තො ආහාරෙ උදරෙ යතො,\nසච්චං කරොමි නිද්දානං සොරච්චං මෙ පමොචනං."
            },
            {
                "type": "gatha",
                "text": "විරියං මෙ ධුරධොරය්හං යොගක්ඛෙමාධිවාහනං,\nගච්ඡති අනිවත්තන්තං යත්ථ ගන්ත්වා න සොචති."
            },
            {
                "type": "gatha",
                "text": "එවමෙසා කසී කට්ඨා සා හොති අමතප්ඵලා,\nඑතං කසිං කසිත්වාන සබ්බදුක්ඛා පමුච්චතීති."
            },
            {
                "type": "unindented",
                "text": "[බ්රාහ්මණො:]"
            },
            {
                "type": "paragraph",
                "text": "භුඤ්ජතු භවං ගොතමො. කස්සකො භවං{3 භවංගොතමො - PTS.}, යඤ්හි{4 යංහි - මඡසං. PTS.} භවං ගොතමො අමතඵලං කසිං{5 කසින්ති නත්ථි - ස්යා.} කසතීති."
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "ගාථාභිගීතම්මෙ අභොජනෙය්යං සම්පස්සතං බ්රාහ්මණ නෙසධම්මො,\nගාථාභිගීතං පනුදන්ති බුද්ධා ධම්මෙ සති බ්රාහ්මණ වුත්තිරෙසා."
            },
            {
                "type": "gatha",
                "text": "අඤ්ඤෙන ච කෙවලිනං මහෙසිං ඛීණාසවං කුක්කුච්ච වූපසන්තං,\nඅන්නෙන පානෙන උපට්ඨහස්සු ඛෙත්තඤ්හි තං පුඤ්ඤපෙක්ඛස්ස{6 පුඤ්ඤපෙඛස්ස - සීමු. 1. 2.} හොතීති."
            },
            {
                "type": "page-break",
                "text": "310"
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ කසිභාරද්වාජො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම අභික්කන්තං භො ගොතම. සෙය්යථාපි භො ගොතම නික්කුජ්ජිතං වා උක්කුජ්ජෙය්ය පටිච්ඡන්නං වා විවරෙය්ය මූළ්හස්ස වා මග්ගං ආචික්ඛෙය්ය අන්ධකාරෙ වා තෙල පජ්ජොතං ධාරෙය්ය චක්ඛුමන්තො රූපානි දක්ඛින්ති, එවමෙවං භොතා ගොතමෙන අනෙකපරියායෙන ධම්මො පකාසිතො. එසාහං භවන්තං ගොතමං සරණං ගච්ඡාමි ධම්මඤ්ච භික්ඛුසඞ්ඝඤ්ච. උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
            },
            {
                "type": "centered",
                "text": "7. 2. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "උදයසුත්තං.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "198. **සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය යෙන උදයස්ස බ්රාහ්මණස්ස නිවෙසනං තෙනුපසඞ්කමි. අථ ඛො උදයො බ්රාහ්මණො භගවතො පත්තං ඔදනෙන පූරෙසි. දුතියම්පි ඛො භගවා පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය යෙන උදයස්ස බ්රාහ්මණස්ස නිවෙසනං තෙනුපසඞ්කමි. දුතියම්පි ඛො උදයො බ්රාහ්මණො භගවතො පත්තං ඔදනෙන පූරෙසි. තතියම්පි ඛො භගවා පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය යෙන උදයස්ස බ්රාහ්මණස්ස නිවෙසනං තෙනුපසඞ්කමි. තතියම්පි ඛො උදයො බ්රාහ්මණො භගවතො පත්තං ඔදනෙන පූරෙත්වා භගවන්තං එතදවොච: පකට්ඨකොයං{1 පකට්ඨයං - ස්යා. පගබ්භත්වායං - සී 1. 2.} සමණො ගොතමො පුනප්පුනං ආගච්ඡතීති."
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "පුනප්පුනං චෙව වපන්ති බීජං පුනප්පුනං වස්සති දෙවරාජා,\nපුනප්පුනං ඛෙත්තං කසන්ති කස්සකා පුනප්පුනං ධඤ්ඤමුපෙති රට්ඨං."
            },
            {
                "type": "gatha",
                "text": "පුනප්පුනං යාචකා{2 යාචනකා - සීමු 1, 2. අ.} යාචයන්ති පුනප්පුනං දානපතී දදන්ති,\nපුනප්පුනං දානපතී දදිත්වා පුනප්පුනං සග්ගමුපෙන්ති ඨානං."
            },
            {
                "type": "gatha",
                "text": "පුනප්පුනං ඛීරනිකා{3 ඛීරණිකා - සීමු. 1. 2. අ.} දුහන්ති පුනප්පුනං වච්ඡො උපෙති{4 වච්ඡා උපෙන්ති - සී 1, 2.} මාතරං,\nපුනප්පුනං කිලමති ඵන්දති ච පුනප්පුනං ගබ්භමුපෙති මන්දො."
            },
            {
                "type": "gatha",
                "text": "පුනප්පුනං ජායති මීයති ච පුනප්පුනං සීවථිකං හරන්ති,\nමග්ගඤ්ච ලද්ධා අපුනබ්භවාය න පුනප්පුනං ජායති භූරිපඤ්ඤොති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ උදයො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම -පෙ- උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
            },
            {
                "type": "page-break",
                "text": "312"
            },
            {
                "type": "centered",
                "text": "7. 2. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දෙවහිතසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "199.** සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන භගවා වාතෙහි ආබාධිකො හොති. ආයස්මා ච උපවානො භගවතො උපට්ඨාකො හොති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා ආයස්මන්තං උපවානං ආමන්තෙසි: ඉඞ්ඝ මෙ ත්වං උපවාණ උණ්හොදකං ජානාහී ති."
            },
            {
                "type": "paragraph",
                "text": "එවං භන්තෙති ඛො ආයස්මා උපවානො භගවතො පටිස්සුත්වා නිවාසෙත්වා පත්තචීවරමාදාය යෙන දෙවහිතස්ස බ්රාහ්මණස්ස නිවෙසනං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා තුණ්හීභූතො එකමන්තං අට්ඨාසි."
            },
            {
                "type": "paragraph",
                "text": "අද්දසා ඛො දෙවහිතො බ්රාහ්මණො ආයස්මන්තං උපවානං තුණ්හීභූතං එකමන්තං ඨිතං. දිස්වාන ආයස්මන්තං උපවානං ගාථාය අජ්ඣභාසි:"
            },
            {
                "type": "gatha",
                "text": "තුණ්හීභූතො භවං තිට්ඨං මුණ්ඩො සඞ්ඝාටිපාරුතො,\nකිං පත්ථයානො කිං එසං කින්නු යාචිතුමාගතොති?"
            },
            {
                "type": "unindented",
                "text": "[උපවානො:]"
            },
            {
                "type": "gatha",
                "text": "අරහං සුගතො ලොකෙ වාතෙහාබාධිකො මුනි,\nසචෙ උණ්හොදකං අත්ථි මුනිනො දෙහි බ්රාහ්මණ."
            },
            {
                "type": "gatha",
                "text": "පූජිතො පූජනෙය්යානං සක්කරෙය්යාන{1 සක්කරෙය්යානං - සීමු. PTS. සක්කතෙය්යානං - සී 1, 2.} සක්කතො,\nඅපචිතො අපචෙය්යානං{2 අපවනෙය්යානං - සීමු. අපවිනෙය්යානං - ස්යා.} තස්ස ඉච්ඡාමි හාතවෙති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො දෙවහිතො බ්රාහ්මණො උණ්හොදකස්ස කාජං පුරිසෙන ගාහාපෙත්වා{3 න්හාපෙත්වා - මඡසං. ස්යා.} ඵාණිතස්ස ච පුටං ආයස්මතො උපවානස්ස පාදාසි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා උපවාණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං උණ්හොදකෙන නහාපෙත්වා උණ්හොදකෙන ඵාණිතං ආලොළෙත්වා භගවතො පාදාසි. අථ ඛො භගවතො සො{4 “සො” ඉති නත්ථි - මඡසං.} ආබාධො පටිප්පස්සම්භි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො දෙවහිතො බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි.\n\nඑකමන්තං නිසින්නො ඛො දෙවහිතො බ්රාහ්මණො භගවන්තං ගාථාය අජ්ඣභාසි."
            },
            {
                "type": "gatha",
                "text": "කත්ථ දජ්ජා දෙය්යධම්මං කත්ථ දින්නං මහප්ඵලං,\nකථං හි යජමානස්ස කත්ථ{5 කථං - මඡසං. PTS.} ඉජ්ඣති දක්ඛිණාති?"
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "පුබ්බෙනිවාසං යො වෙදී සග්ගාපායඤ්ච පස්සති,\nඅථො ජාතික්ඛයං පත්තො අභිඤ්ඤාවොසිතො මුනි."
            },
            {
                "type": "page-break",
                "text": "314"
            },
            {
                "type": "gatha",
                "text": "එත්ථ දජ්ජා දෙය්යධම්මං එත්ථ දින්නං මහප්ඵලං,\nඑවං හි යජමානස්ස එවං ඉජ්ඣති දක්ඛිණාති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ දෙවහිතො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම -පෙ- උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
            },
            {
                "type": "centered",
                "text": "7. 2. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මහාසාලසුත්තං.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "200. **සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො අඤ්ඤතරො බ්රාහ්මණමහාසාළො ලූඛො{1 ‘ලූඛො,’ ඌනං - මඡසං.} ලූඛපාපුරණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො තං බ්රාහ්මණමහාසාළං භගවා එතදවොච. කින්නු ත්වං බ්රාහ්මණ ලූඛො{2 ‘ලූඛො,’ ඌනං - මඡසං.} ලූඛපාපුරණොති."
            },
            {
                "type": "unindented",
                "text": "[බ්රාහ්මණො:]"
            },
            {
                "type": "paragraph",
                "text": "ඉධ මෙ භො ගොතම චත්තාරො පුත්තා. තෙ මං දාරෙහි සම්පුච්ඡ ඝරා නික්ඛාමෙන්තීති."
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "paragraph",
                "text": "තෙන හි ත්වං බ්රාහ්මණ ඉමා ගාථායො පරියාපුණිත්වා සභායං මහාජනකායෙ සන්නිපතිතෙ පුත්තෙසු ච සන්නිසින්නෙසු භාසස්සු:"
            },
            {
                "type": "gatha",
                "text": "යෙහි ජාතෙහි නන්දිස්සං යෙසඤ්ච භවමිච්ඡිසං,\nතෙ මං දාරෙහි සම්පුච්ඡ සාව වාරෙන්ති සූකරං."
            },
            {
                "type": "gatha",
                "text": "අසන්තා කිර මං ජම්මා තාත තාතාති භාසරෙ,\nරක්ඛසා පුත්තරූපෙන තෙ පජහන්ති{3 තෙ ජහන්ති - මඡසං. ස්යා. PTS.} වයොගතං."
            },
            {
                "type": "gatha",
                "text": "අස්සොව ජිණ්ණො නිබ්භොගො ඛාදනා අපනීයති,\nබාලකානං{4 බාලානං - සී 1, 2.} පිතා ථෙරො පරාගාරෙසු භික්ඛති."
            },
            {
                "type": "gatha",
                "text": "දණ්ඩොව කිර මෙ සෙය්යො යඤ්චෙ පුත්තා අනස්සවා,\nචණ්ඩම්පි ගොණං වාරෙති අථො චණ්ඩම්පි කුක්කුරං."
            },
            {
                "type": "gatha",
                "text": "අන්ධකාරෙ පුරෙ හොති ගම්භීරෙ ගාධ මෙධති,\nදණ්ඩස්ස අනුභාවෙන ඛලිත්වා පටිතිට්ඨතීති{5 පතිතිට්ඨතීති - මඡසං.}."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො සො බ්රාහ්මණමහාසාළො භගවතො සන්තිකෙ ඉමා ගාථායො පරියාපුණිත්වා සභායං මහාජනකායෙ සන්නිපතිතෙ පුත්තෙසු ච සන්නිසින්නෙසු අභාසි."
            },
            {
                "type": "page-break",
                "text": "316"
            },
            {
                "type": "gatha",
                "text": "“යෙහි ජාතෙහි නන්දිස්සං යෙසඤ්ච භවමිච්ඡිසං,\nතෙ මං දාරෙහි සම්පුච්ඡ සාව වාරෙන්ති සූකරං."
            },
            {
                "type": "gatha",
                "text": "අසන්තා කිර මං ජම්මා තාත තාතාති භාසරෙ,\nරක්ඛසා පුත්තරූපෙන පජහන්ති වයොගතං."
            },
            {
                "type": "gatha",
                "text": "අස්සොව ජිණ්ණො නිබ්භොගො ඛාදනා අපනීයති,\nබාලකානං පිතා ථෙරො පරාගාරෙසු භික්ඛති."
            },
            {
                "type": "gatha",
                "text": "දණ්ඩොව කිර මෙ සෙය්යො යඤ්චෙ පුත්තා අනස්සවා,\nචණ්ඩම්පි ගොණං වාරෙති අථො චණ්ඩම්පි කුක්කුරං."
            },
            {
                "type": "gatha",
                "text": "අන්ධකාරෙ පුරෙ හොති ගම්භීරෙ ගාධ මෙධති,\nදණ්ඩස්ස ආනුභාවෙන ඛලිත්වා පටිතිට්ඨතී”ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො නං බ්රාහ්මණමහාසාළං පුත්තා ඝරං නෙත්වා නාහාපෙත්වා පච්චෙකං දුස්සයුගෙන අච්ඡාදෙසුං."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො සො බ්රාහ්මණමහාසාළො එකං දුස්සයුගං ආදාය යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො බ්රාහ්මණමහාසාළො භගවන්තං එතදවොච: "
            },
            {
                "type": "paragraph",
                "text": "මයං භො ගොතම බ්රාහ්මණා නාම ආචරියස්ස ආචරියධනං පරියෙසාම. පටිගණ්හාතු මෙ භවං ගොතමො ආචරියො ආචරියධනන්ති.{1 ආචරියභාගන්ති - සීමු. 1. 2.} පටිග්ගහෙසි භගවා අනුකම්පං උපාදාය."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො සො බ්රාහ්මණමහාසාළො භගවන්තං එතදවොච: අභික්කන්තං, භො ගොතම -පෙ- උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
            },
            {
                "type": "centered",
                "text": "7. 2. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මානත්ථද්ධසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "201. **සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන මානත්ථද්ධො නාම බ්රාහ්මණො සාවත්ථියං පටිවසති. සො නෙව මාතරං අභිවාදෙති. න පිතරං අභිවාදෙති. න ආචරියං අභිවාදෙති. න ජෙට්ඨභාතරං අභිවාදෙති."
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන භගවා මහතියා පරිසාය පරිවුතො ධම්මං දෙසෙති. අථ ඛො මානත්ථද්ධස්ස බ්රාහ්මණස්ස එතදහොසි: අයං ඛො සමණො ගොතමො මහතියා පරිසාය පරිවුතො ධම්මං දෙසෙති. යන්නූනාහං යෙන සමණො ගොතමො තෙනුපසඞ්කමෙය්යං. සචෙ මං සමණො ගොතමො ආලපිස්සති, අහම්පි තං ආලපිස්සාමි. නො චෙ මං සමණො ගොතමො ආලපිස්සති අහම්පි නාලපිස්සාමීති."
            },
            {
                "type": "page-break",
                "text": "318"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො මානත්ථද්ධො බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා තුණ්හීභූතො{1 ‘තුණ්හීභූතො’ ඉති නත්ථි - ස්යා.} එකමන්තං අට්ඨාසි. අථ ඛො භගවා තං නාලපි{2 නාලපති - සීමු. ස්යා.}. අථ ඛො මානත්ථද්ධො බ්රාහ්මණො නායං සමණො ගොතමො කිඤ්චි ජානාතීති. තතොව පුන නිවත්තිතුකාමො අහොසි."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා මානත්ථද්ධස්ස බ්රාහ්මණස්ස චෙතසා චෙතොපරිවිතක්කමඤ්ඤාය මානත්ථද්ධං බ්රාහ්මණං ගාථාය අජ්ඣභාසි:"
            },
            {
                "type": "gatha",
                "text": "න මාන බ්රෑහණා සාධු{3 න මානං බ්රාහ්මණ සාධු - සීමු 2. මඡසං. ස්යා. PTS. න මානං බ්රෑහණං සාධු - සී 1, 2.} අත්ථිකස්සීධ බ්රාහ්මණ,\nයෙන අත්ථෙන ආගඤ්ඡි{4 ආගච්ඡි - මඡසං. PTS.} තමෙවමනුබ්රෑහයෙති{5 අනුබ්රෑහසි - සී 1, 2.}."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො මානත්ථද්ධො බ්රාහ්මණො චිත්තං මෙ සමණො ගොතමො ජානාතීති තත්ථෙව භගවතො පාදෙසු සිරසා නිපතිත්වා භගවතො පාදානි මුඛෙන{6 මුඛෙන ච - මඡසං. PTS.} පරිචුම්බති, පාණීහි ච පරිසම්බාහති, නාමඤ්ච සාවෙති: ‘මානත්ථද්ධොහං භො ගොතම මානත්ථද්ධොහං භො ගොතමා’ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො සා පරිසා අබ්භුතචිත්තජාතා අහොසි. අච්ඡරියං වත භො අබ්භුතං වත භො අයං හි මානත්ථද්ධො බ්රාහ්මණො නෙව මාතරං අභිවාදෙති. න පිතරං අභිවාදෙති. න ආචරියං අභිවාදෙති. න ජෙට්ඨභාතරං අභිවාදෙති. අථ ච පන සමණෙ ගොතමෙ එවරූපං පරමනිපච්චාකාරං{7 නිපච්චකාරං - මඡසං. ස්යා.} කරොතීති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා මානත්ථද්ධං බ්රාහ්මණං එතදවොච: අලං බ්රාහ්මණ උට්ඨෙහි, සකෙ ආසනෙ නිසීද, යතො තෙ මයි චිත්තං පසන්නන්ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො මානත්ථද්ධො බ්රාහ්මණො සකෙ ආසනෙ නිසීදිත්වා භගවන්තං ගාථාය අජ්ඣභාසි:"
            },
            {
                "type": "gatha",
                "text": "කෙසු න මානං කයිරාථ{8 මානං න - සීමු. 1.} කෙසු චස්ස{9 කෙසු අස්ස - PTS. කථංස්වස්ස - ස්යා.} සගාරවො,\nක්යස්ස අපචිතා අස්සු ක්යස්ස{10 ක්යස්සු - මඡසං. PTS.} සාධු සුපූජිතා."
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "මාතරි පිතරි චාපි{11 ද්වාපි - මඡසං.} අථො ජෙට්ඨම්හි භාතරි,\nආචරියෙ චතුත්ථංහි{12 චතුත්ථම්හි - සබ්බත්ථ.} තෙසු න මානං කයිරාථ.\nතෙසු අස්ස සගාරවො ත්යස්සු{13 ත්යස්ස - සීමු 2.} අපචිතා අස්සු තෙචස්සු සාධු පූජිතා{14 ත්යස්සු සාධු සුපූජිතා - මඡසං. PTS.}."
            },
            {
                "type": "gatha",
                "text": "අරහන්තෙ සීතීභූතෙ{15 සීතිංභූතෙ - ස්යා.} කතකිච්චෙ අනාසවෙ,\nනිහච්ච මානං අත්ථද්ධො තෙ නමස්ස{16 නමස්සෙ - මඡසං.} අනුත්තරෙ."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ මානත්ථද්ධො බ්රාහ්මණො භගවන්තං එතදවොච අභික්කන්තං භො ගොතම -පෙ- උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
            },
            {
                "type": "page-break",
                "text": "320"
            },
            {
                "type": "centered",
                "text": "7. 2. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පච්චනීකසුත්තං.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "202. එවං මෙ සුතං: එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ."
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන පච්චනීකසාතො නාම බ්රාහ්මණො සාවත්ථියං පටිවසති. අථ ඛො පච්චනීකසාතස්ස බ්රාහ්මණස්ස එතදහොසි: යන්නූනාහං යෙන සමණො ගොතමො තෙනුපසඞ්කමෙය්යං. යං යදෙව සමණො ගොතමො භාසිස්සති, තං තදෙවස්සාහං පච්චනීකාස්සන්ති."
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන භගවා අජ්ඣොකාසෙ චඞ්කමති. අථ ඛො පච්චනීකසාතො බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං චඞ්කමන්තං අනුචඞ්කමමානො{1 අනුචඞ්කමමානො ඉති නත්ථි - මඡසං. PTS.} භගවන්තං එතදවොච: භණ සමණ ධම්මන්ති."
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "න පච්චනීකසාතෙන සුවිජානං සුභාසිතං,\nඋපක්කිලිට්ඨචිත්තෙන සාරම්භබහුලෙන ච."
            },
            {
                "type": "gatha",
                "text": "යො ච විනෙය්ය සාරම්භං අප්පසාදඤ්ච චෙතසො,\nආඝාතං පටිනිස්සජ්ජ ස වෙ{2 සචෙ - ස්යා.} ජඤ්ඤා සුභාසිතන්ති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ පච්චනීකසාතො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම -පෙ- උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
            },
            {
                "type": "centered",
                "text": "7. 2. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නවකම්මිකසුත්තං.",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "203. එකං සමයං භගවා කොසලෙසු විහරති අඤ්ඤතරස්මිං වනසණ්ඩෙ."
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන නවකම්මිකභාරද්වාජො බ්රාහ්මණො තස්මිං වනසණ්ඩෙ කම්මන්තං කාරාපෙති. අද්දසා ඛො නවකම්මිකභාරද්වාජො බ්රාහ්මණො භගවන්තං අඤ්ඤතරස්මිං සාලරුක්ඛමූලෙ නිසින්නං පල්ලඞ්කං ආභුජිත්වා උජුං කායං පණිධාය පරිමුඛං සතිං උපට්ඨපෙත්වා. දිස්වානස්ස එතදහොසි: අහං ඛො පන{3 “පන” ඉථි නත්ථි - මඡසං. ස්යා. PTS.} ඉමස්මිං වනසණ්ඩෙ කම්මන්තං කාරාපෙන්තො රමාමි. අයං සමණො ගොතමො කිං කාරාපෙන්තො රමතීති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො නවකම්මිකභාරද්වාජො බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං ගාථාය අජ්ඣභාසි:"
            },
            {
                "type": "gatha",
                "text": "කෙ නු කම්මන්තා කයිරන්ති{4 කරීයන්ති - මඡසං.} භික්ඛු සාලවනෙ තව,\nයදෙකකො අරඤ්ඤස්මිං රතිං වින්දසි ගොතමාති.{5 වින්දති ගොතමොති - මඡසං. ස්යා. PTS.}"
            },
            {
                "type": "page-break",
                "text": "322"
            },
            {
                "type": "gatha",
                "text": "න{1 න ච මෙ - සීමු 1. ස්යා.} මෙ වනස්මිං කරණීයමත්ථි උච්ඡින්නමූලං මෙ වනං විසූකං,\nස්වාහං{2 සොභං - PTS.} වනෙ නිබ්බනථො විසල්ලො එකො රමෙ අරතිං විප්පහායාති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ නවකම්මිකභාරද්වාජො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම -පෙ- උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
            },
            {
                "type": "centered",
                "text": "7. 2. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කට්ඨහාරසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "204. එකං සමයං භගවා කොසලෙසු විහරති අඤ්ඤතරස්මිං වනසණ්ඩෙ."
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස භාරද්වාජගොත්තස්ස බ්රාහ්මණස්ස සම්බහුලා අන්තෙවාසිකා කට්ඨහාරකා{3 කට්ඨහාරකා නාම - සීමු 1. 2.} මාණවකා යෙන සො{4 සොති නත්ථි - මඡසං.} වනසණ්ඩො තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා අද්දසංසු භගවන්තං තස්මිං වනසණ්ඩෙ නිසින්නං පල්ලඞ්කං ආභුජිත්වා උජුං කායං පණිධාය පරිමුඛං සතිං උපට්ඨපෙත්වා."
            },
            {
                "type": "paragraph",
                "text": "දිස්වාන යෙන භාරද්වාජගොත්තො බ්රාහ්මණො තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා භාරද්වාජගොත්තං බ්රාහ්මණං එතදවොචුං: යග්ඝෙ භවං ජානෙය්ය{5 ජානෙය්යාසි - මඡසං.} අසුකස්මිං වනසණ්ඩෙ සමණො{6 සමණො ගොතමො - ස්යා.} නිසින්නො පල්ලඞ්කං ආභුජිත්වා උජුං කායං පණිධාය පරිමුඛං සතිං උපට්ඨපෙත්වාති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භාරද්වාජගොත්තො බ්රාහ්මණො තෙහි මාණවකෙහි සද්ධිං යෙන සො වනසණ්ඩො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා අද්දසා ඛො භගවන්තං තස්මිං වනසණ්ඩෙ නිසින්නං පල්ලඞ්කං ආභුජිත්වා උජුං කායං පණිධාය පරිමුඛං සතිං උපට්ඨපෙත්වා. දිස්වාන යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං ගාථාහි අජ්ඣභාසි:"
            },
            {
                "type": "gatha",
                "text": "ගම්භීරරූපෙ බහුභෙරවෙ වනෙ සුඤ්ඤං අරඤ්ඤං විජනං විගාහිය,\nඅනිඤ්ජමානෙන ඨිතෙන{7 හිතෙන - ස්යා.} වග්ගුනා සුචාරුරූපං{8 සුන්දරරූපං - අට්ඨ:} වත භික්ඛු ඣායසි."
            },
            {
                "type": "gatha",
                "text": "න යත්ථ ගීතා න පි යත්ථ වාදිතං එකො අරඤ්ඤෙ වනමස්සිතො මුනි,\nඅච්ඡෙරරූපං පටිභාති මං ඉදං යදෙකකො පීතිමනො වනෙ වසෙ.\nමඤ්ඤාමහං{9 මඤ්ඤෙහං - PTS.} ලොකාධිපතී සහව්යතං{10 ලොකාධිපතිං සහව්යතං - සීමු 1. ලොකාධිපති සහව්යතං - PTS. මඡසං. ස්යා.} ආකඞ්ඛමානො තිදිවං අනුත්තරං,\nකස්මා භවං විජනමරඤ්ඤමස්සිතො තපො ඉධ කුබ්බසි{11 කුබ්බසී - මඡසං.} බ්රහ්මපත්තියාති."
            },
            {
                "type": "page-break",
                "text": "324"
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "යා කාචි කඞ්ඛා අභිනන්දනා වා අනෙකධාතූසු පුථූ සදාසිතා,\nඅඤ්ඤාණමූලප්පභවා පජප්පිතා සබ්බා මයා බ්යන්තිකතා{1 බ්යන්තීකතා - ස්යා.} සමූලිකා."
            },
            {
                "type": "gatha",
                "text": "ස්වාහං අකඞ්ඛො අසිතො අනූපයො සබ්බෙසු ධම්මෙසු විසුද්ධදස්සනො,\nපප්පුය්ය සම්බොධිමනුත්තරං සිවං ඣායාමහං බ්රාහ්මණ{2 බ්රහ්ම - මඡසං. ස්යා.} රහො විසාරදොති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ භාරද්වාජගොත්තො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම, -පෙ- උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
            },
            {
                "type": "centered",
                "text": "7. 2. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මාතුපොසකසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "205. **සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො මාතුපොසකො බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො මාතුපොසකො බ්රාහ්මණො භගවන්තං එතදවොච. අහං හි භො ගොතම ධම්මෙන භික්ඛං පරියෙසාමි. ධම්මෙන භික්ඛං පරියෙසිත්වා මාතාපිතරො පොසෙමි. කච්චාහං භො ගොතම එවංකාරී කිච්චකාරී හොමීති?\n"
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "paragraph",
                "text": "තග්ඝ ත්වං බ්රාහ්මණ එවංකාරී කිච්චකාරී හොසි{3 අහොසි - සීමු 1, 2. ස්යා.}. යො ඛො බ්රාහ්මණ ධම්මෙන භික්ඛං පරියෙසති. ධම්මෙන භික්ඛං පරියෙසිත්වා මාතාපිතරො පොසෙති. බහුං{4 බහූ - PTS.} සො පුඤ්ඤං පසවතීති."
            },
            {
                "type": "gatha",
                "text": "යො මාතරං වා{5 මාතරං - මඡසං. ස්යා. PTS.} පිතරං වා මච්චො ධම්මෙන පොසති,\nතාය නං පාරිචරියාය මාතාපිතුසු පණ්ඩිතා,\nඉධෙව නං පසංසන්ති පෙච්ච සග්ගෙ පමොදතීති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ මාතුපොසකො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම -පෙ- උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
            },
            {
                "type": "page-break",
                "text": "326"
            },
            {
                "type": "centered",
                "text": "7. 2. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "භික්ඛකසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "206. **සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භික්ඛකො බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො භික්ඛකො බ්රාහ්මණො භගවන්තං එතදවොච: අහම්පි ඛො{1 අහමස්මි - සීමු. 1. 2. ස්යා.} භො ගොතම භික්ඛකො භවම්පි භික්ඛකො ඉධ නො කිං නානාකරණන්ති?"
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "න තෙන භික්ඛකො හොති යාවතා භික්ඛතෙ පරෙ,\nවිස්සං ධම්මං සමාදාය භික්ඛු හොති න තාවතා."
            },
            {
                "type": "gatha",
                "text": "යොධ පුඤ්ඤඤ්ච පාපඤ්ච බාහිත්වා{2 පවාහෙත්වා - ස්යා.} බ්රහ්මචරියවා{3 බ්රහ්මචරියං - මඡසං. සීමු. 1. PTS. ස්යා.},\nසඞ්ඛාය ලොකෙ චරති ස වෙ භික්ඛූති වුච්චති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ භික්ඛකො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම, -පෙ-උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
            },
            {
                "type": "centered",
                "text": "7. 2. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සඞ්ගාරවසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "207. **සාවත්ථියං---**"
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන සඞ්ගාරවො{4 සඞ්ගරවො - ස්යා.} නාම බ්රාහ්මණො සාවත්ථියං පටිවසති. උදකසුද්ධිකො උදකෙන පරිසුද්ධිං{5 සුද්ධිං - සීමු. 1. 2. PTS. සී 1, 2.} පච්චෙති. සායපාතං{6 සායංපාතං - සීමු. 1.} උදකොරොහණානුයොගමනුයුත්තො විහරති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා ආනන්දො පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය සාවත්ථිං පිණ්ඩාය පාවිසි. සාවත්ථියං පිණ්ඩාය චරිත්වා පච්ඡාභත්තං පිණ්ඩපාතපටික්කන්තො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා ආනන්දො භගවන්තං එතදවොච: ඉධ භන්තෙ සඞ්ගාරවො{7 සඞ්ගරවො - ස්යා.} නාම බ්රාහ්මණො සාවත්ථියං පටිවසති, උදකසුද්ධිකො උදකෙන පරිසුද්ධිං{8 සුද්ධිං - සීමු. 1. 2. PTS. සී 1, 2.} පච්චෙති සායපාතං{9 සායංපාතං - සීමු. 1.} උදකොරොහණානුයොගමනුයුත්තො විහරති. සාධු භන්තෙ භගවා යෙන සඞ්ගාරවස්ස බ්රාහ්මණස්ස නිවෙසනං තෙනුපසඞ්කමතු අනුකම්පං උපාදායාති. අධිවාසෙසි භගවා තුණ්හීභාවෙන."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා පුබ්බන්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය යෙන සඞ්ගාරවස්ස බ්රාහ්මණස්ස නිවෙසනං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා පඤ්ඤත්තෙ ආසනෙ නිසීදි."
            },
            {
                "type": "page-break",
                "text": "328"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො සඞ්ගාරවො බ්රාහ්මණො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවතා සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො සඞ්ගාරවං බ්රාහ්මණං භගවා එතදවොච: සච්චං කිර ත්වං බ්රාහ්මණ උදකසුද්ධිකො උදකෙන පරිසුද්ධිං පච්චෙසි. සායපාතං උදකොරොහණානුයොගමනුයුත්තො විහරසීති."
            },
            {
                "type": "paragraph",
                "text": "එවං භො ගොතමාති{1 ගොතම - මඡසං. PTS.}."
            },
            {
                "type": "paragraph",
                "text": "කිම්පන ත්වං බ්රාහ්මණ අත්ථවසං සම්පස්සමානො උදකසුද්ධිකො උදකෙන පරිසුද්ධිං{2 උදකසුද්ධිං - මඡසං. PTS.} පච්චෙසි. සායපාතං උදකොරොහණානුයොගමනුයුත්තො විහරසීති?"
            },
            {
                "type": "paragraph",
                "text": "ඉධ මෙ භො ගොතම යං දිවා පාපකම්මං කතං හොති, තං සාය නහානෙන{3 සායංන්හානෙන - මඡසං. ස්යා.} පවාහෙමි. යං රත්තිං පාපකම්මං කතං හොති, තං පාත{4 පාතං - මඡසං. ස්යා. PTS.} නහානෙන පවාහෙමි. ඉමං ඛ්වාහං භො ගොතම අත්ථවසං සම්පස්සමානො උදකසුද්ධිකො උදකෙන පරිසුද්ධිං පච්චෙමි. සායපාතං උදකොරොහණානුයොගමනුයුත්තො විහරාමීති."
            },
            {
                "type": "unindented",
                "text": "[භගවා:]"
            },
            {
                "type": "gatha",
                "text": "ධම්මො රහදො බ්රාහ්මණ සීලතිත්ථො\nඅනාවිලො සබ්භි සතං පසත්ථො,\nයත්ථ හවෙ වෙදගුනො සිනාතා\nඅනල්ලගත්තා’ව තරන්ති පාරන්ති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ සඞ්ගාරවො බ්රාහ්මණො භගවන්තං එතදවොච: අභික්කන්තං භො ගොතම, -පෙ- උපාසකං මං භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතං සරණං ගතන්ති."
            },
            {
                "type": "centered",
                "text": "7. 2. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඛොමදුස්සසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "208. එවං මෙ සුතං: එකං සමයං භගවා සක්කෙසු විහරති ඛොමදුස්සං නාමං සක්යානං නිගමො. අථ ඛො භගවා පුබ්බන්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය ඛොමදුස්සං නිගමං{5 නාම නිගමං - සීමු. 1.} පිණ්ඩාය පාවිසි."
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන ඛොමදුස්සකා බ්රාහ්මණගහපතිකා සභායං සන්නිපතිතා හොන්ති කෙනචි දෙව කරණීයෙන. දෙවො ච එකමෙකං ඵුසායති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා යෙන සා සභා තෙනුපසඞ්කමි. අද්දසංසු ඛො ඛොමදුස්සකා බ්රාහ්මණගහපතිකා භගවන්තං දූරතොව ආගච්ඡන්තං. දිස්වාන එතදවොචුං: කෙ ච මුණ්ඩකා සමණකා කෙ ච සභාධම්මං ජානිස්සන්තීති?"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා ඛොමදුස්සකෙ බ්රාහ්මණගහපතිකෙ ගාථාය අජ්ඣභාසි."
            },
            {
                "type": "page-break",
                "text": "330"
            },
            {
                "type": "gatha",
                "text": "නෙසා සභා යත්ථ න සන්ති සන්තො සන්තො න තෙ යෙ න වදන්ති ධම්මං,\nරාගඤ්ච දොසඤ්ච පහාය මොහං ධම්මං වදන්තාව{1 වදන්තා ච - මඡසං. ස්යා. සීමු 1.} භවන්ති සන්තොති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ ඛොමදුස්සකා බ්රාහ්මණගහපතිකා භගවන්තං එතදවොචුං: අභික්කන්තං භො ගොතම අභික්කන්තං භො ගොතම. සෙය්යථාපි භො ගොතම නික්කුජ්ජිතං වා උක්කුජ්ජෙය්ය පටිච්ඡන්නං වා විවරෙය්ය, මූළ්හස්ස වා මග්ගං ආචික්ඛෙය්ය, අන්ධකාරෙ වා තෙලපජ්ජොතං ධාරෙය්ය චක්ඛුමන්තො රූපානි දක්ඛින්ති. එවමෙවං භොතා ගොතමෙන අනෙකපරියායෙන ධම්මො පකාසිතො. එතෙ මයං භවන්තං ගොතමං සරණං ගච්ඡාම ධම්මඤ්ච භික්ඛුසඞ්ඝඤ්ච. උපාසකෙ නො භවං ගොතමො ධාරෙතු අජ්ජතග්ගෙ පාණුපෙතෙ සරණං ගතෙති."
            },
            {
                "type": "centered",
                "text": "උපාසකවග්ගො දුතියො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "කසී උදයො දෙවහිතො අඤ්ඤතර මහාසාළං\nමානත්ථද්ධඤ්ච පච්චනීකඤ්ච නවකම්මකට්ඨහාරකං{2 නවකම්මිකට්ඨහාරං - මඡසං.}\nමාතුපොසකො{3 මාතුපොසකං - මඡසං.} භික්ඛකො සඞ්ගාරවො ඛොමදුස්සෙන ද්වාදසාති."
            },
            {
                "type": "centered",
                "text": "බ්රාහ්මණසංයුත්තං සමත්තං.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ],
        "pages": {
            "286": {
                "pageNum": 286,
                "footnotesCount": 3
            },
            "288": {
                "pageNum": 288,
                "footnotesCount": 2
            },
            "290": {
                "pageNum": 290,
                "footnotesCount": 2
            },
            "292": {
                "pageNum": 292,
                "footnotesCount": 4
            },
            "294": {
                "pageNum": 294,
                "footnotesCount": 1
            },
            "296": {
                "pageNum": 296,
                "footnotesCount": 1
            },
            "298": {
                "pageNum": 298,
                "footnotesCount": 6
            },
            "300": {
                "pageNum": 300,
                "footnotesCount": 6
            },
            "302": {
                "pageNum": 302,
                "footnotesCount": 9
            },
            "304": {
                "pageNum": 304,
                "footnotesCount": 14
            },
            "306": {
                "pageNum": 306,
                "footnotesCount": 2
            },
            "308": {
                "pageNum": 308,
                "footnotesCount": 6
            },
            "310": {
                "pageNum": 310,
                "footnotesCount": 4
            },
            "312": {
                "pageNum": 312,
                "footnotesCount": 5
            },
            "314": {
                "pageNum": 314,
                "footnotesCount": 5
            },
            "316": {
                "pageNum": 316,
                "footnotesCount": 1
            },
            "318": {
                "pageNum": 318,
                "footnotesCount": 16
            },
            "320": {
                "pageNum": 320,
                "footnotesCount": 5
            },
            "322": {
                "pageNum": 322,
                "footnotesCount": 11
            },
            "324": {
                "pageNum": 324,
                "footnotesCount": 5
            },
            "326": {
                "pageNum": 326,
                "footnotesCount": 9
            },
            "328": {
                "pageNum": 328,
                "footnotesCount": 5
            },
            "330": {
                "pageNum": 330,
                "footnotesCount": 3
            }
        }
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "287"
            },
            {
                "type": "heading",
                "text": "7. බ්‍රාහ්‌මණ සංයුත්‌තය\n",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. අරහන්ත වර්ගය",
                "level": 2
            },
            {
                "type": "centered",
                "text": "7.1.1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ධනඤ්‌ජානී සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "187. මා විසින් මෙසේ අසන ලදී. එක්කලෙක භාග්‍යවතුන් වහන්සේ රජගහනුවර සමීපයෙහි කලන්දකනිවාප නම් වූ වේළුවනාරාමයෙහි වැඩ වසන සේක. එකල්හි භාරද්වාජ ගෝත්‍රයෙහි උපන් එක්තරා බමුණකුගේ ධනඤ්ජානී නම් බැමිණිය බුදුන් කෙරෙහි ද දහම් කෙරෙහි ද සඟුන් කෙරෙහි ද බෙහෙවින් පහන් වූවා වෙ යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති ධනඤ්ජානී බැමිණිය භාරද්වාජගෝත්‍රබමුණාට බත් එළවන්නී පැකිලී “ඒ භාග්‍යවත් අර්හත් සම්මාසම්බුදුරජානන් වහන්සේට නමස්කාර වේවා! ඒ භාග්‍යවත් අර්හත් සම්මාසම්බුදුරජානන් වහන්සේට නමස්කාර වේවා! ඒ භාග්‍යවත් අර්හත් සම්මාසම්බුදුරජානන් වහන්සේට නමස්කාර වේවා!” යි තෙවරක් උදන් ඇනී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ කී කල්හි භාරද්වාජගෝත්‍ර බමුණු ධනඤ්ජානී බැමිණියට මෙසේ ම මේ සැඩොලිය යම් ඒ තැනක දී හෝ යම් ඒ මුඩුමහණහුගේ ගුණ කියයි. සැඩොලිය, දැන් මම තිගේ ඒ ශාස්තෘහට වාද නගන්නෙමි යි මෙය කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "බමුණ, යමෙක් භාග්‍යවත් අර්හත් ඒ සම්මාසම්බුදුරජානන් වහන්සේට වාද නගන්නේ නම් මම එබන්දකු දෙවියන් සහිත මරුන් සහිත බඹුන් සහිත ලොව්හි මහණ බමුණන් සහිත දෙවිමිනිසුන් සහිත ප්‍රජායෙහි නො ම දකිමි. එහෙත් බමුණ තෙපි යවු. ගොස් දැනගන්නහු යයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති භාරද්වාජගෝත්‍ර බමුණු කිපියේ නොසතුටුසිත් ඇත්තේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සතුටු වියයුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් භාරද්වාජගෝත්‍ර බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට ගාථායෙන් කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ගෞතමයෙනි, කුමක් නසා සුවසේ හොවී ද? කුමක් නසා ශෝක නො කෙරේ ද? කිනම් එක් දහමක් නැසීම රුස්නෙහි ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "බමුණ, ක්‍රෝධය නසා සුවසේ හොවී. ක්‍රෝධය නසා ශෝක නො කෙරෙයි. විෂසඞ්ඛාත දුඃඛවිපාකයට මුල් වූ මිහිරි අග ඇති ක්‍රෝධය නැසීම ආර්යයෝ පසසත්. ඒ ක්‍රෝධය නසා (සිටියේ) ශෝක නො කෙරේ මැයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "289"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි භාරද්වාජගෝත්‍රබමුණා භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. භවත් ගෞතමයන් වහන්ස, යම්සේ යටිකුරු වූවක් උඩුකුරු කරන්නේ හෝ වේ ද? වැසුනු දෙයක් වැසුම් හරින්නේ හෝ වේ ද? මං මුළා වූවකුට මඟ කියන්නේ හෝ වේ ද? ඇස් ඇත්තෝ රූප දක්නාහු යයි අඳුරෙහි තෙල් පහනක් දරන්නේ හෝ වේ ද? එසෙයින් ම භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් නියායෙන් දහම් පවසන ලදී. මේ මම භවත් ගෞතමයන් වහන්සේ ද, දහම ද, බික්සඟන ද සරණ යෙමි. මම භවත් ගෞතමයන් වහන්සේ සමීපයෙහි පැවිද්ද ලබම්වා උපසපුව ලබම්වා යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භාරද්වාජගෝත්‍රබමුණා භාග්‍යවතුන් වහන්සේ සමීපයෙහි පැවිද්ද ලද්දේ ය, උපසපුව ලද්දේ ය. උපසපන් වූ නොබෝකල් ඇති ආයුෂ්මත් භාරද්වාජ තෙමේ එකලා ව ගණයා කෙරෙන් වෙන් වූයේ නොපමාව කෙලෙස් තවන වෙර ඇතිව නිවන් පිණිස මෙහෙයූ සිත් ඇතිව වෙසෙමින් යමක් පිණිස කුලපුත්‍රයෝ මැනවින් ම ගිහිගෙන් නික්ම සස්නට පැමිණේද් ද, මගබඹසර කෙළවර කොට ඇති ඒ අර්හත්වය නොබෝ කලෙකින් ම මේ අත්බැව්හි ම තෙමේ ම මැනවින් දැන සාක්ෂාත් කොට ඊට පැමිණ විසී ය. ජාතිය ක්ෂය වූවා ය. බඹසර වැස නිමවන ලදී. සිවුමග කටයුතු කරණ ලදී. මේ රහත්බව පිණිස අනෙකෙක් නැතැයි දැනගත්තේ ය. ආයුෂ්මත් භාරද්වාජ තෙරණුවෝ රහතුන් අතුරෙන් එක්තරා කෙනෙක් වූහ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7.1.2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අක්කොසක සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "188. එකකලෙක භාග්‍යවතුන් වහන්සේ රජගහනුවර සමීපයෙහි කලන්දකනිවාප නම් වූ වේළුවනාරාමයෙහි වැඩවසන සේක. අක්කොසක භාරද්වාජබමුණු තෙමේ භාරද්වාජගෝත්‍රබමුණා ගිහිගෙයින් නික්ම ශ්‍රමණ ගෞතමයන් සමීපයෙහි සස්නෙහි පැවිදි වී යයි ඇසී ය. කිපියේ නොසතුටු සිත් ඇත්තේ භාග්‍යවතුන් වහන්සේ  වෙතට එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේට අසභ්‍ය වූ පරුෂ වචනයෙන් ආක්‍රොශ කෙරෙයි. පරිභව කෙරෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ ආක්‍රොශ පරිභව කළ කල්හි භාග්‍යවතුන් වහන්සේ අක්කොසක භාරද්වාජබමුණාහට මෙය වදාළ සේක. බමුණ, ඒ කුමැයි හඟීහි ද? ආගන්තුක වූ තාගේ මිත්‍රාමාත්‍යයෝ සහලේ නෑයෝ (තා නිවසට) පැමිණෙද්ද? භවත් ගෞතමයෙනි, ආගන්තුක වූ මාගේ මිත්‍රාමාත්‍යයෝ සහලේ නෑයෝ ඇතැම් දිනෙක පැමිණෙති.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "බමුණ, ඒ කුමැයි හඟිහි ද? ඔවුන්ට කෑයුත්තක් හෝ බුදියයුත්තක් හෝ රස විඳියයුත්තක් හෝ දෙන්නෙහි ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භවත් ගෞතමයෙනි, මම ඔවූන්ට කෑයුත්තක් හෝ බුදියයුත්තක් හෝ රස විඳියයුත්තක් හෝ ඇතැම් දිනෙක දෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "බමුණ, ඉදින් ඔහු නො පිළිගණිත් නම් එය කාට වේ ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භවත් ගෞතමයෙනි ඉදින්, ඔහු නො පිළිගණිත් නම් එය අපට ම වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "291"
            },
            {
                "format": 13,
                "text": "බමුණ, එසෙයින් ම යම් හෙයෙකින් තෝ ආක්‍රෝශ නොකරණ අපට ආක්‍රෝශ කරෙහි ද? නොකිපෙන අපට කිපෙහි ද? භණ්ඩන නොනඟන අපට භණ්ඩන නඟහි ද? තාගේ ඒ අක්‍රොශාදිය අපි නො පිළිගණිමු. බමුණ තෙල තට ම වෙයි. බමුණ, යමෙක් අක්‍රොශ කරන්නහුට පෙරළා අක්‍රොශ කෙරේ ද, කිපෙන්නහුට පෙරළා කිපේ ද, භණ්ඩන නඟන්නහුට පෙරළා භණ්ඩන නඟා ද, බමුණ, මේ තෙමේ එකතු ව අනුභව කෙරේ. උනුනට සමවලා කරතියි කියනු ලැබේ. ඒ අපි තා සමග එකතුව නො වළඳමු. උනුනට සමවලා නොකරමු. බමුණ, තෙල තට ම වෙයි. බමුණ, තෙල තට ම වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[බමුණු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "රජු සහිත පිරිස මහණගොයුම්හු රහත්හ යි මෙසේ භවත් ගෞතමයන් දනී. එහෙත් භවත් ගොයුම්හු. කිපෙති.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "දැමුනු සමදිවි පැවතුම් ඇති මොනවට දැන මිදුනු සන්හුන් වූ තාදී ගුණ ඇති නොකිපෙන රහත්හට ක්‍රොධයෙක් කොයින් ද,",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යමෙක් කිපුනහුට පෙරළා කිපේ ද, එයින් ඒ පුඟුලටාම පව වේ. කිපියහුට පෙරළා නොකිපෙන්නේ දිනීමට දුෂ්කර වූ (ක්‍රොධ) සඞ්ග්‍රාමය දිනයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යමෙක් මෙරමා කිපියහු දැන සිහි ඇතිව ඉවසා ද, (හෙ තෙමේ) තමහට ද මෙරමාහට ද (යන) දෙදෙනාට ම වැඩ සාදයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "තමහට ද මෙරමාහට (යන) දෙදෙනාට ම පිළියම් කරනුවහු බාලයහ යි ධර්මයෙහි අදක්ෂ වූ ඒ ජනයෝ හඟිත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි අක්කෝසභාරද්වාජ බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. මේ මම භවත් ගෞතමයන් වහන්සේ ද, දහම ද බික්සඟන ද සරණ යෙමි. මම භවත් ගෞතමයන් වහන්සේ සමීපයෙහි පැවිද්ද ලබම් වා. උපසපුව ලබම් වා. අක්කෝසකභාරද්වාජ බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේ සමීපයෙහි පැවිදි ද ලැබී ය. උපසපුව ලැබීය. උපසපන් නොබෝ කල් ඇති ආයුෂ්මත් අක්කෝසකභාරද්වාජ තෙමේ එකලාව ගණයා කෙරෙන් වෙන්ව නොපමාව කෙලෙස් තවන වෙර ඇතිව නිවණෙහි මෙහෙයූ සිත් ඇතිව වෙසෙමින් කුලපුත්‍රයෝ යමක් පිණිස  මැනැවින් ම ගිහිගෙන් නික්ම පැවිද්දට යෙත් ද, මගබඹසර කෙළවර කොට ඇති ඒ නිරුත්තර වූ රහත් බව නොබෝකලෙකින් දුටුදැමියෙහි ම තෙමේ ම විශිෂ්ට ඥානයෙන් දැන පසක් කොට එයට පැමිණ විසී ය. ජාතිය ක්ෂය වූවා ය. බඹසර වැස නිමවන ලදී. කටයුතු කරණ ලදී. මේ බැව් පිණිස අනෙකෙක් නැතැයි දැන ගත්තේ ය. ආයුෂ්මත් භාරද්වාජ තෙරණුවෝ රහතුන් අතුරෙන් එක්තරා කෙනෙක් වූහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "293"
            },
            {
                "type": "centered",
                "text": "7.1.3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අසුරින්‌දක සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "189. එක්කලෙක භාග්‍යවතුන් වහන්සේ රජගහනුවර සමීපයෙහි කලන්දකනිවාප නම් වූ වේළුවනාරාමයෙහි වැඩ වසන සේක. අසුරින්දකභාරද්වාජ බ්‍රාහ්මණ තෙමේ භාරද්වාජගෝත්‍ර බමුණා ගිහිගෙයින් නික්ම ශ්‍රමණ ගෞතමයන් සමීපයෙහි පැවිද්දට ගියේ ය යි ඇසීය. කිපියේ නො සතුටු සිත් ඇත්තේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේට අසභ්‍ය පරුෂ වචනයෙන් ආක්‍රොශ කෙරෙයි. පරිභව කෙරෙයි. එසේ ආක්‍රොශ පරිභව කළ කල්හි භාග්‍යවතුන් වහන්සේ නිශ්ශබ්ද වූ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති අසුරින්දකභාරද්වාජ බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙය කී ය. මහණ, දිනුයෙහි ද, මහණ දිනුයෙහි ද.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "අඥාන තෙමේ වචනයෙන් පරුෂ බෙණෙමින් ඒකාන්තයෙන් තමන්ට ජයෙකැයි හඟී. (ඉවසීමෙහි ගුණ) දන්නහුගේ යම් ඉවසීමෙක් වේ ද, ඒ ඔහුට ජයෙක් ම වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යමෙක් කිපියහුට පෙරළා කිපේ ද, එයින් ඔහුට ම පව වේ. කිපියහුට පෙරළා නො කිපෙන්නේ දුකසේ දිනියහැකි ක්‍රෝධ සඞ්ග්‍රාමය දිනයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යමෙක් මෙරමා කිපියහු දැන සිහි ඇතිව ඉවසා ද, (හෙතෙමේ) තමහට ද මෙරමාහට ද (යන) දෙදෙනාහට ම වැඩ සාදයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "තමාහට ද මෙරමාහට ද යන දෙදෙනාහට ම පිළියම් කරනුවහු බාලයහයි ධර්මයෙහි අදක්ෂ වූ ඒ ජනයෝ හඟිත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි අසුන්දරිකභාරද්වාජ බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි … දැනගත්තේ ය. ආයුෂ්මත් භාරද්වාජ තෙරණුවෝ රහතුන් අතුරෙන් එක්තරා කෙනෙක් වූහ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7.1.4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "බිලඞ්‌ගික සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "190. එක්කලෙක භාග්‍යවතුන් වහන්සේ රජගහනුවර සමීපයෙහි කලන්දකනිවාප නම් වූ වේළුවනාරාමයෙහි වැඩ වසන සේක. බිලඞ්ගිකභාරද්වාජ බමුණු තෙමේ භාරද්වාජගෝත්‍ර බමුණා ගිහිගෙයින් නික්ම ශ්‍රමණ ගෞතමයන් වෙත පැවිද්දට ගියේ ය යි ඇසී ය. කිපියේ නොසතුටුසිත් ඇත්තේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ නිහඬ ව එකත් පසෙක සිටියේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ තමසිතින් බිලඞ්ගිකභාරද්වාජ බමුණාගේ චිත්තපරිවිතර්කය දැන බිලඞ්ගිකභාරද්වාජ බමුණාට ගාථායෙන් වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යමෙක් නිරපරාධ වූ නික්ලේශී වූ පුරුෂපුද්ගලයකුට අපරාධ කෙරේ ද, ඒ පව උඩුසුලඟට දමන ලද සියුම් රජසක් මෙන් ඒ අඥානයා කරා ම පෙරළා එයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "295"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි බිලඞ්ගිකභාරද්වාජ බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. … ආයුෂ්මත් භාරද්වාජ තෙරණුවෝ රහතුන් අතුරෙන් එක්තරා කෙනෙක් වූහ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අහිංසක සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "191. **සැවැත්නුවර -**",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි අහිංසකභාරද්වාජ බමුණු තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමග සතුටු වි ය. සතුටුවියයුතු සිහිකටයුතු කථාව කොට නිමවා එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් අහිංසකභාරද්වාජ බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට “භවත් ගෞතමයෙනි, මම අහිංසක වෙමි. භවත් ගෞතමයෙනි, මම අහිංසක වෙමි”යි මෙය කීයේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "නාමය යම්සේ ද, ඉදින් එසේ වන්නෙහි නම් තෝ අහිංසක ම වෙහි. යමෙක් කයින් වචනයෙන් හා සිතින් ද, හිංසා නො කෙරේ ද, යමෙක් මෙරමා නො වෙහෙසා ද, හෙ තෙමේ ඒකාන්තයෙන් අහිංසකයෙක් වේ යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි, අහිංසකභාරද්වාජ බමුණු තෙමේ  භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. … ආයුෂ්මත් භාරද්වාජ තෙරණුවෝ රහතුන් අතුරෙන් එක්තරා කෙනෙක් වූහ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7.1.6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ජටා සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "192. එක්කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයෙහි වූ ජේතවන නම් වූ අනේපිඬු මහසිටුහුගේ අරම්හි වැඩවසන සේක. එකල්හි ජටාභාරද්වාජ බමුණු තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමග සතුටු වි ය. සතුටුවියයුතු සිහිකටයුතු කථාව කොට නිමවා එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් ජටාභාරද්වාජ බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට ගාථායෙන් කී ය:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇතුළත අවුල් ය, පිටත අවුල් ය. ප්‍රජාව අවුලෙන් වළඳනා ලද්දී ය. ගෞතමයන් වහන්ස, එය මුබ විචාරමි: කවරෙක් මේ අවුල නිරවුල් කරන්නේ දැයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "ප්‍රතිසන්ධිප්‍රඥා ඇති කෙලෙස් තවන වීර්යය ඇති පාරිහාරිය නුවණ ඇති (සසර) බිය දක්නාසුලු ඒ සත්ව තෙමේ ශීලයෙහි පිහිටා සමාධිය හා ප්‍රඥාව ද වඩමින් මේ (තෘෂ්ණා) අවුල නිරවුල් කරන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යම් කෙනකුන් විසින් රාගයත් ද්වේෂයත් අවිද්‍යාවත් දුරු කරණ ලද්දාහු ද, (ඔහු) ක්ෂීණාස්‍රව රහත්හුය. ඔවුන් විසින් (තෘෂ්ණා) අවුල නිරවුල් කරණ ලදී.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "297"
            },
            {
                "format": 13,
                "text": "යම් තැනෙක නාමය ද, රූපය ද, ප්‍රතිඝය ද, රූපසංඥාව ද (යාම මොහු) නිරවශේෂයෙන් නිරුද්ධ වෙත් ද, එහි මේ තෘෂ්ණා අවුල සිඳෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි ජටාභාරද්වාජ බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට මෙය කී ය. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි … ආයුෂ්මත් භාරද්වාජ තෙරණුවෝ රහතුන් අතුරෙන් එක්තරා කෙනෙක් වූහ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7.1.7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුද්ධික සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "193. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකල්හි සුද්ධිකභාරද්වාජ බමුණු තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමග සතුටු වි ය. සතුටුවියයුතු සිහිකටයුතු කථාව කොට නිමවා එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් සුද්ධිකභාරද්වාජ බමුණු තෙමේ භාග්‍යවතුන් වහන්සේගේ සමීපයෙහි මේ ගාථාව කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ලෝකයේ කිසි බමුණෙක් සිල්වත් ද, තපස්කම් කරන්නේ ද, (එපමණින්) පිරිසිදු නො වේ. ඒ බමුණු තෙමේ විද්‍යායෙන් හා චරණධර්මයන්ගෙන් යුක්ත වූයේ පිරිසිදු වේ. මෙයින් අන්‍ය වූ සෙසු ප්‍රජාව පිරිසිදු නො වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "බොහෝ ප්‍රලාප බෙණෙන්නේ ඇතුළත (කෙලෙසින්) කුණු වූයේ කිලිටි වූයේ කොහොන් බැව් ඇසුරු කෙළේ ජාතිමාත්‍රයෙන් බමුණෙක් නො වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "පටන් ගන්නා ලද වීර්ය්‍ය ඇති නිවන් පිණිස මෙහෙයූ සිත් ඇති නිති දැඩි පැරකුම් ඇති ක්ෂත්‍රියයා ද බ්‍රහ්මණයා ද වෛශ්‍යයා ද ශුද්‍රයා ද සැඬොලා ද පුප්සඬුවා ද උත්තම සුද්ධි සඞ්ඛ්‍යාත නිවණට පැමිණෙත්. බමුණ, මෙසේ දනුව යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි සුද්ධිකභාරද්වාජ බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි, … ආයුෂ්මත් සුද්ධිකභාරද්වාජ තෙරණුවෝ රහතුන් අතුරෙන් එක්තරා කෙනෙක් වූහ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7.1.8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අග්ගික සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "194. එක්කලෙක භාග්‍යවතුන් වහන්සේ රජගහනුවර සමීපයෙහි කලන්දකනිවාප නම් වූ වේළුවනාරාමයෙහි වැඩ වසන සේක. එකල්හි අග්ගිකභාරද්වාජ බමුණා විසින් ගිනි පුදන්නෙමි යි අග්ගිහොමය කරන්නෙමියි ගිතෙලින් මුසු කිරිබතක් පිළියෙළ කරණ ලද්දේ වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ පෙරවරු හැඳ පෙර ව පාසිවුරු ගෙණ රජගහනුවරට පිඬු පිණිස පිවිසි සේක. රජගහනුවර ගෙපිළිවෙලින් පිඬු පිණිස හැසිරෙණ සේක් අග්ගිකභාරද්වාජ බමුණාගේ නිවෙස්න වෙත එළඹි සේක. එළඹ එකත්පසෙක වැඩ සිටි සේක.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "299"
            },
            {
                "format": 13,
                "text": "අග්ගිකභාරද්වාජ බමුණා පිඬු පිණිස වැඩසිටි භාග්‍යවතුන් වහන්සේ දැක්කේ ය. දැක භාග්‍යවතුන් වහන්සේට ගාථායෙන් කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "(යම් බමුණෙක්) ත්‍රිවිද්‍යායෙන් සමන්විත ද (හත්වන පිතාමග යුගය දක්වා පිවිතුරු) ජාති ඇත්තේ ද, බොහෝ ග්‍රන්ථයන් හදාළේ ද, ත්‍රිවෙද සඞ්ඛ්‍යායාත විද්‍යායෙන් හා ගෝත්‍රසඞ්ඛ්‍යාත චරණයෙන් යුක්ත ද, ඒ බමුණු තෙමේ ම මේ පායාසය වළඳන්නේ ය. (ඒ මිස මොබට මෙය නුසුදුසු යයි කී නියායි)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "බොහෝ ප්‍රලාප බෙණෙන්නේ ඇතුළත (කෙලෙසින්) කුණු වූ යේ කිලිටි වූයේ කොහොන් බැවින් පිරිවරණ ලද්දේ ජාතිමාත්‍රයෙන් බමුණෙක් නො වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යමෙක් පෙර විසූ කඳපිළිවෙළ දනී ද, ස්වර්ගය හා අපායත් දකී ද, වැලි ජාතික්ෂය සඞ්ඛ්ඛ්‍යාත අර්හත්වයට පැමිණියේ ද, (මාර්ගඥානයෙන් චතුස්සත්‍යය) දැන නිමවන ලද (සොළොස්) කිස ඇත්තේ ද, (කායාදී) මෞනගුණ යුක්ත ද,",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මේ ත්‍රිවිද්‍යායෙන් බමුණ තෙමේ තේවිජ්ජ වෙයි. විද්‍යායෙන් හා චරණධර්මයෙන් යුක්ත වූ හෙ තෙමේ මේ පයාසය වළදන්නේ ය. (වැළදීමට සුදුසු යයි වදාළ නියායි.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[බමුණු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "භවත් ගෞතම තෙමේ වළදාවා. භවත් තෙමේ බමුණෙකි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "බමුණ, මා විසින් ගාථාභිගීත මේ පයාසය වැළදීම සුදුසු නො වේ. ආජිවශුද්ධිය දක්නවුන්ගේ මේ ස්වභාවයෙක් නොවේ. බුදුවරයෝ ගාථාභිගීත බොජුන් බැහැර කෙරෙත්. බමුණ, ආර්යධර්මය ඇති කල්හි මේ පැවැත්මයි. (අකැප දෙය දුර ලා කැප දෙය ම වැළදීම ආර්යයන්ගේ ස්වාභාව යයි.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සියලු ගුණයෙන් යුත් මහර්ෂි වූ සන්හුන් කුකුස් ඇති රහත්හු මෙයින් අන්‍ය වූ ආහාරයෙන් ද, පානයෙන් ද උවටන් කරව. පින් කැමැත්තහුට ඒ කෙත වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි අග්ගිකභාරද්වාජ බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය: භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. … ආයුෂ්මත් භාරද්වාජ තෙරණුවෝ රහතුන් අතුරෙන් එක්තරා කෙනෙක් ද වූහ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7.1.9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුන්දරික සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "195. එක්කලෙක භාග්‍යවතුන් වහන්සේ කොසොල් දනව්වෙහි සුන්දරිකා ගංතෙර වැඩවසන සේක. එකල්හි සුන්දරිකභාරද්වාජ බමුණු සුන්දරිකා ගංතෙර ගිනි පුදයි.  අග්නිහොමය කෙරෙයි. ඉක්බිති සුන්දරිකභාරද්වාජ බමුණු ගිනි පුදා අග්නිහොමය කොට හුනස්නෙන් නැගිට “කවරෙක් මේ යාගද්‍රව්‍යශේෂය වළදන්නේ වේ දැ”යි හාත්පස සිවුදිගුන් බැලී ය. සුන්දරිකභාරද්වාජ බමුණු එක්තරා රුක්මුලෙක හිස වටා පෙරෙවි වැඩහුන් භාග්‍යවතුන් වහන්සේ දුටුයේ ය. දැක වමතින් යාගද්‍රව්‍යශේෂය ගෙණ දකුණතින් කෙණ්ඩිය ගෙන භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "301"
            },
            {
                "format": 13,
                "text": "එකල්හි භාග්‍යවතුන් වහන්සේ සුන්දරිකභාරද්වාජ බමුණාගේ පියහඬින් හිස විවර කළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති සුන්දරිකභාරද්වාජ බමුණු මේ භවත් මුඩු වූවෙක. මේ භවත් මුණ්ඩකයෙකැ යි. එතැනින් ම පෙරළා යනු කැමැති විය. එකල්හි සුන්දරිකභාරද්වාජ බමුණාහට “මෙහි මුඩු වූ ද ඇතැම්හු බමුණු වෙති. මම ඔහු වෙත එළඹ ජාතිය විචාරන්නෙම් නම් මැනවැ”යි මේ සිත විය. ඉක්බිති සුන්දරිකභාරද්වාජ බමුණු භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේට “භවත් කිනම් ජාති ඇත්තෙක් වේ දැ”යි තෙල කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "ජාතිය නහමක් විවාරව (ශීලාදි) චරණය ම විවාරව. කාෂ්ටයෙන් ඒකාන්තයෙන් ගිනි හටගණී. එමෙන් ම පහත් කුලයෙහි උපන්නේ ද, උසස්කුලයෙහි උපන්නේ ද, වීර්යවත් වූයේ කරුණු නො කරුණු දන්නේ ලජ්ජායෙන් පව් වළකා සිටියේ (ක්ෂීණාස්‍රව) මුනි වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යමෙක් (පරමාර්ථ) සත්‍යයෙන් දැමුනේ ද, ඉන්ද්‍රිය දමනයෙන් යුක්ත ද, චතුර්මාර්ග සඞ්ඛ්‍යාත වේදයෙහි පරතෙරට ගියේ ද, වැස නිම වූ බඹසර ඇත්තේ ද, යුතු කළ දන් ඇතියේ සුදුසු කල්හි ඔහු කැඳවන්නේ ය. හෙ තෙමේ (ඔහු කැඳවා දන් දෙන තැනැත්තේ) දක්ෂිණාර්භයා කෙරෙහි යාග කෙරෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[බමුණු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "වෙදයෙහි පරතෙරට පැමිණි එබන්දකු යම් හෙයෙකින් දකිම් ද, මා විසින් ඒකාන්තයෙන් මෙය මොනවාට පුදන ලද්දේ වෙයි. මනා කොට (එහෙයින්) හෝම කරණ ලද්දේ වෙයි. මුබ වහන්සේ වැන්නවුන් නො දැක්මෙන් අන්දන හුතාවශේෂය වළඳයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භවත් ගෞතම තෙමේ වළඳාවා. භවත් තෙමේ බ්‍රාහ්මණයෙකි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "බමුණ, මා විසින් ගාථාභිගීත පායාසය වැළඳීම නිසි නො වේ. ආජීවශුද්ධිය දක්නවුන්ගේ මේ ස්වභාවයෙක් නො වේ. බුදුවරයෝ ගාථාභිගීතය බැහැර කෙරෙත්. බමුණ, ආර්යධර්මය ඇතිකල්හි මේ පැවැත්ම යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සියලු ගුණයෙන් යුත් මහර්ෂී වූ සන්හුන් කුකුස් ඇති රහත්හු මෙයින් අන්‍ය අහාරයෙන් ද පානයෙන් ද උවටන් කරව. පින් කැමැත්තහුට ඒ කෙත වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[බමුණු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "භවත් ගෞතමයෙනි, එසේ නම් මම කවරකුට මේ හුතාවශේෂය දෙම් ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "බමුණ, තථාගතයන්ගේ හෝ තථාගතශ්‍රාවකයකුගේ හෝ පරිණාමය හැරපියා අන් යමකු විසින් මේ හුතාවශේෂය වළඳන ලද්දේ මැනවින් පැසීමට යන්නේ නම්, බමුණ, දෙවියන් සහිත මරුන් සහිත බඹුන් සහිත ලොව්හි මහණ බමුණන්සියෝ දෙව්මිනිසුන් සහිත ප්‍රජායෙහි එබන්දකු මම නො ම දකිමි. බමුණ, එසේ වී නම් තෙපි ඒ හුතාවශෙෂය තණ නැති බිමෙක හෝ දමව. පණුවන් නැති දියෙක හෝ පා කොට හරුව.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "303"
            },
            {
                "format": 13,
                "text": "ඉක්බිති සුන්දරිකභාරද්වාජ බමුණු ඒ හුතාවශේෂය පණුවන් නැති දියෙහි පා කොට හැරියේ ය. එකල්හි ඒ හුතාවශේෂය දියෙහි බහා ලන ලද්දේ චිච්චිටි යන අනුකරණ ශබ්දය පවත්වයි. චිටි චිටි යන අනුකරණශබ්ද පවත්වයි. දුමයි. බෙහෙවින් දුමයි. යම්සේ දහවල් තැවුන හීවැල දියෙහි බහාලන ලද්දේ චිච්චිටි යන අනුකරණශබ්දය පවත්වා ද, චිටි චිටි යන අනුකරණශබ්ද පවත්වා ද, දුමා ද, බෙහෙවින් දුමා ද, එසෙයින් ම ඒ හුතාවශේෂය දියෙහි බහා ලන ලද්දේ චිච්චිටි යන අනුකරණ ශබ්දය පවත්වයි. චිටි චිටි යන අනුකරණශබ්ද පවත්වයි. දුමයි. බෙහෙවින් දුමයි. ඉක්බිති සුන්දරිකභාරද්වාජ බමුණු තෙමේ සංවේගයට පැමිණියේ හටගත් ලොමුදහගැනුම් ඇත්තේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ එකත්පසෙක සිටියේ ය. එකත්පසෙක සිටි සුන්දරිකභාරද්වාජ බමුණාට භාග්‍යවතුන් වහන්සේ  ගාථායෙන් වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "බමුණ, දර දවමින් ශුද්ධියක් නහමක් හඟුව. යම් හෙයෙකින් මේ දර දැවීම ආර්යධර්මයෙන් බැහැර ද (එහෙයිනි). බාහිර වූ දර දැවීමෙකින් පිරිසිදුබව යමෙක් කැමැති වන්නේ නම් ඒ දර දැවීමෙන් පිරිසිදු බවක් දක්ෂ වූ ආර්යයෝ නොම කියත්."
            },
            {
                "format": 13,
                "text": "බමුණ, මම දර දැවීම අත්හැර ස්වසන්තානයෙහි ම ඥානාග්නිය දල්වමි. අර්හත් වූ මම නිති (දැල් වූ) ගිනි ඇත්තෙම් නිති සංයතසිත් ඇත්තෙම් බඹසර කෙරෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "බමුණ, තාගේ මානය තවුස්පිරිකරබර වේ. ක්‍රෝධය දුම වේ. මුසා බිණීම හලු වේ. දිව හැන්ද ය. හෘදය ගිනි දැල්වෙන තැන ය. පුරුෂයාගේ මොනවාට දැමුණ සිත ගින්න වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වේදයෙහි පරතෙරට ගිය ආර්යයෝ යම් තැනෙක ස්නානය කළාහු නොතෙත් සිරුරු ඇත්තෝ නිවන් නමැති පරතෙරට ඒකාන්තයෙන් යෙද්ද, බමුණ, ධර්මය තෙමේ සිල් නමැති තොටු ඇති වෙසෙසින් පහන් වූ උතුම් සත්පුරුෂයන් විසින් පසස්නා ලද (එබඳු) ජලාසයෙකි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "බමුණ, වාක්සත්‍යය ද, (දිට්ඨි, සඞ්කප්ප, වායාම, සති, සමාධි සඞ්ඛ්‍යාත) ධර්ම ද, (කම්මන්ත ආජීව සඞ්ඛ්‍යාත) සංයමය ද (යන මේ) බඹසර නම් වේ. මැද ඇසුරු කළා ශ්‍රේෂ්ඨ ප්‍රතිපත්ති ය යි. ඒ (තෙපි) සෘජු වූ රහතුන්ට නමස්කාර කරව. මම ඒ මිනිසා දහම්හි හැසිරෙන්නෙකැ යි කියමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි සුන්දරිකභාරද්වාජ බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි … ආයුෂ්මත් භාරද්වාජ තෙරණුවෝ රහතුන් අතුරෙන් එක්තරා කෙනෙක් වූහ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7.1.10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "බහුධීතු සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "196. එක්කලෙක භාග්‍යවතුන් වහන්සේ කොසොල් දනව්වෙහි එක්තරා වනලැහැබෙක වැඩ වසන සේක. එකල්හි එක්තරා භාරද්වාජ ගෝත්‍ර බමුණු කෙනකුගෙන් ගොන්හු තුදුස් දෙනෙක් නටුවාහු වෙත්, ඉක්බිති ඒ භාරද්වාජ ගෝත්‍ර බමුණු තෙමේ ඒ ගොණුන් සොයමින් ඒ වනලැහැබට පැමිණියේ ය. එළඹ ඒ වනලැහැබෙහි උඩු කය කෙලින් තබා (කමටහන්=) අභිමුඛ කොට සිහි එළවා පලක් බැඳ වැඩහුන් භාග්‍යවතුන් වහන්සේ දැක්කේ ය. දැක භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ ගාථා කීය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "305"
            },
            {
                "format": 13,
                "text": "(මාගේ) ගොන්හු තුදුස්දෙනෙක් අදට සදවසක් මුළුල්ලෙහි නො දක්නා ලැබෙත්. මේ මහණහු ඒකාන්තයෙන් (එබන්දෙක්) නැත. එහෙයින් මේ මහණ තෙමේ සුව ඇත්තෙකි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යම් හෙයකින් මේ මහණහට ලාමකවූ තල ද කොළ එකක් දෙකක් පමණ ඉතිරි වූ තල ද ඒකාන්තයෙන් නැත් ද, එහෙයින් මේ මහණ තෙමේ සුව ඇත්තෙකි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "(මාගේ) හිස් වූ ධාන්‍යාගාරයෙහි මීයෝ අධිකෝත්සාහයෙන් නටත්. මේ මහණහට ඒකාන්තයෙන් (එබන්දෙක්) නො ම ඇත. එහෙයින් මේ මහණ තෙමේ සුව ඇත්තෙකි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සත්මසක් පමණ වූ (මාගේ) තණ ඇතිරිය එහි ම හටගත් ප්‍රාණීන්ගෙන් ගැවසී ගත්තේ ය. මේ මහණහට ඒකාන්තයෙන් (එබන්දෙක්) නො ම ඇත. එහෙයින් මේ මහණ තෙමේ සැප ඇත්තෙකි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එක පුතකු ඇත්තාවූ ද පුතුන් දෙදෙනකුන් ඇත්තාවූ ද, වැන්දඹු වූ දුහු සත් දෙනෙක් (මට මෙන්) මේ මහණහට ඒකාන්තයෙන් නො ම ඇත. එහෙයින් මේ මහණ තෙමේ සුව ඇත්තෙකි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "පිඟුවන් වූ තලකැලලින් ගැවසී ගත් සිරුර ඇති (මාගේ බැමිණි තොමෝ) නිදිගත් මා පයින් ගසා පුබුදුවයි. මේ මහණහට ඒකාන්තයෙන් එබන්දෙක් නො ම ඇත. එහෙයින් මේ මහණ තෙමේ සුව ඇත්තෙකි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අලුයම්හි නය හිමියෝ දෙවු, දෙවු යයි මේ මහණහට (මට මෙන්) ඒකාන්තයෙන් චොදනා නො ම කෙරෙත්. එහෙයින් මේ මහණ තෙමේ සුව ඇත්තෙකි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "බමුණ, (තාගේ) ගොන්හු තුදුස් දෙනෙක් අදට සදවසක් මුළුල්ලෙහි නො දක්නා ලැබෙත්. මට (එබන්දෙක්) නො ම ඇත. බමුණ, එහෙයින් මම සුව ඇත්තෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "බමුණ, කෙතෙහි ලාමක වූ තල ද එකක් දෙකක් කොළ ඉතිරි වූ තල ද මට නොම ඇත. බමුණ, එහෙයින් මම සුව ඇත්තෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "බමුණ, (තාගේ) හිස් වූ ධාන්‍යාගාරයෙහි මීයෝ මහත් උත්සාහයෙන් නටත්. මට එබන්දෙක් නො ම ඇත. බමුණ, එහෙයින් මම සුව ඇත්තෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "බමුණ, සත්මසක් වූ (තාගේ) තණඇතිරිය එහි ම උපන් ප්‍රාණීන්ගෙන් ගැවසී ගත්තේ ය. මට (එබන්දෙක්) නො ම ඇත්තේ ය. බමුණ, එහෙයින් මම සුව ඇත්තෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "බමුණ, එක් පුතකු ඇත්තාවූ ද, දෙපුතු කෙනකුන් ඇත්තාවූ ද වැන්දඹු වූ දූහු සත්දෙනෙක් (තට මෙන්) මට නොම ඇත. බමුණ, එහෙයින් මම සුව ඇත්තෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "පිඟුවන් වූ තලකැලලින් ගැවසී ගත් සිරුරු ඇති (තාගේ බැමිණිය) නිදි ගත් තා පයින් ගසා පුබුදුවයි. මට එබන්දෙක් නො ම ඇත. බමුණ, එහෙයින් මම සුව ඇත්තෙමි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "307"
            },
            {
                "format": 13,
                "text": "බමුණ, අලුයම නයහිමියෝ දෙවූ දෙවූ යයි (තට) චෝදනා කෙරෙත්. මට එබන්දෙක් නො ම ඇත. බමුණ, එහෙයින් මම සුව ඇත්තෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි භාරද්වාජගොත්‍ර බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේ ය. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. භවත් ගෞතමයන් වහන්ස, යම්සේ යටිහුරු වූවක් උඩුහුරු කරන්නේ හෝ වේ ද, වැසුනු දෙයක් විවර කරන්නේ හෝ වේ ද, මං මුළාවූවකුට මඟ කියන්නේ හෝ වේ ද, ඇස් ඇත්තෝ රූප දකින්නාහ යි අඳුරෙහි තෙල් පහනක් දරන්නේ හෝ වේ ද, එපරිද්දෙන් ම භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් නියායෙන් දහම් පවසන ලදී. මේ මම භවත් ගොයුම්හු ද දහම ද බික්සඟන ද සරණ යෙමි. මම භවත් ගෞතමයන් වහන්සේ සමීපයෙහි පැවිද්ද ලබම් වා.  උපසපුව ලබම්වා යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භාරද්වාජගෝත්‍ර බමුණු තෙමේ භාග්‍යවතුන් වහන්සේ සමීපයෙහි පැවිද්ද ලැබීය ය. උපසපුව ලැබීය. උපසපන් වූ නොබෝ කල් ඇති ආයුෂ්මත් භාරද්වාජ තෙරණුවෝ එකලාව ගණයා කෙරෙන් වෙන් ව නොපමා ව කෙලෙස් තවන වෙර ඇති ව නිවන් පිණිස මෙහෙයූ සිත් ඇතිව වෙසෙමින් කුලපුත්‍රයෝ යමක් පිණිස මැනවින් ම ගිහිගෙන් නික්ම පැවිද්දට යෙත් ද, මගබඹසර කෙළවර කොට ඇති ඒ නිරුත්තර වූ රහත්බව නොබෝ කලෙකින් ම දුටුදැමියෙහි තමා විසින් ම විසිතුරු නුවණින් පසක් කොට එයට පැමිණ විසූහ. ජාතිය ක්ෂය වූවා ය. බඹසර වැස නිමවන ලදී. කටයුතු කරණ ලදී. මේ බැව් පිණිස අනෙකෙක් නැතැයි දැන ගත්තේ ය. ආයුෂ්මත් භාරද්වාජ තෙරණුවෝ රහතුන් අතුරෙන් එක්තරා කෙනෙක් ද වූහ.",
                "type": "paragraph"
            },
            {
                "format": 11,
                "text": "අරහන්තවර්ගය පළමුවැනි යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 20,
                "text": "**එහි උද්දානය:**",
                "type": "unindented"
            },
            {
                "format": 20,
                "text": "ධනඤ්ජානි, අක්කොස, අසුන්දරි, බිලඞ්ගික, අහිංසක, ජටා, සුද්ධික, අග්ගික, සුන්දරික, බහුධීතු සූත්‍රය යි ඒ දශයෙකි.",
                "type": "paragraph"
            },
            {
                "type": "heading",
                "text": "2. උපාසක වර්ගය",
                "level": 2
            },
            {
                "type": "centered",
                "text": "7.2.1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කසී සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "197. මා විසින් මෙසේ අසන ලදී: එක්කලෙක භාග්‍යවතුන් වහන්සේ මගධ දනව්වෙහි දකුණුගිරියෙහි ඒකනාළා නම් බමුණුගම්හි වැඩ වසන සේක. එකල්හි කසීභාරද්වාජ බමුණා විසින් වපුරණ කාලයෙහි පන්සියක් පමණ නගුල්හු යොදන ලද්දාහු වෙති. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ පෙරවරු හැඳ පෙරෙව පාසිවුරු ගෙණ කසිභාරද්වාජ බමුණාගේ කර්මාන්තස්ථානය වෙත එළඹිසේක. එකල්හි කසිභාරද්වාජ බමුණාගේ බොජුන් දීම පවතී. ඉක්බිති භාග්‍යවතුන් වහන්සේ බොජුන් දෙන තැනට එළඹි සේක. එළඹ එකත්පසෙක වැඩසිටි සේක.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "309"
            },
            {
                "format": 13,
                "text": "කසිභාරද්වාජ බමුණු තෙමේ පිඬු පිණිස වැඩසිටි භාග්‍යවතුන් වහන්සේ දැක්කේය. දැක භාග්‍යවතුන් වහන්සේට මෙය කීය. මහණ, මම වනාහි සෑම ද කරමි. වැපිරීම ද කරමි. සෑම ද කොට වැපිරීම ද කොට වළඳමි. මහණ, තෙපි ද සෑම ද කරව. වැපිරීම ද කරව. සෑම ද කොට වැපිරීම ද කොට වළඳව.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "බමුණ, මමත් සෑම ද කරමි. වැපිරීම ද කරමි. සෑම ද කොට වැපිරීම ද කොට වළඳමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[බමුණු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "අපි භවත් ගොයුම්හුගේ වියදණ්ඩ හෝ නඟුල හෝ හීවැල හෝ කෙවිට හෝ ගොනුන් හෝ නො ම දකුම්හ. එහෙත් භවත් ගොයුම් තෙමේ “බමුණ, මමත් සෑම ද කරමි. වැපිරීම ද කරමි. සෑම ද කොට වැපිරීම ද කොට වළඳමි” යි මෙසේ කියයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති කසිභාරද්වාජ බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට ගාථායෙන් කීය:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ගොවියකැ යි පිළින කෙරෙහි. මුබගේ සීසෑමක් නොම දකිමි. ගොවියෙක් දැ යි (අප විසින්) විචාරණ ලද (මොබ) කියනු මැනව. ඒ සීසෑම කෙරේ දනුමෝ ද? ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "සැදැහැ බිජුවට ය. තපස වැස්ස ය. නුවණ මාගේ වියදණ්ඩ හා නඟුලය. ලජ්ජාව නඟුලිසය. සිත යොත ය. සිහිය මාගේ හීවැල හා කෙවිට ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කායසුචරිතයෙන් ගෝපිත වූයෙම් වාක්සුචරිතයෙන් ගෝපිත වූයෙම් අහාරයෙහි ද උදරයෙහි ද සංයත වූයෙම් සත්‍යයෙන් නෙළීම කරමි. අර්හත්ඵල විමුක්තිය මාගේ මිදීම යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ධුර ඉසිලීමෙහි සමත් වූ මාගේ ඒ වීර්යය යම් තැනකට ගොස් ශෝක නො කෙරේ නම් ඒ නිවණට අභිමුඛ කොට පමුණුවනු ලබන්නේ නො නවතිමින් යෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ මේ හීය සාන ලදී. ඒ හීය අමාපල ඇති වෙයි. මේ හීය සා සියලු දුකින් මිදෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[බමුණු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "භවත් ගොයුම් තෙමේ වළඳාවා. යම් හෙයෙකින් භවත් ගොයුම් තෙමේ අමාපල ඇති හීයත් සා ද, එහෙයින් භවත් තෙමේ ගොවියෙකි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "බමුණ, මා විසින් ගාථාභිගීත අහාරය වැළදීම නිසි නොවේ. ආජීවසුද්ධිය දක්නවුන්ගේ මේ ස්වභාවයෙක් නො වේ. බුදුවරයෝ ගාථාභිගීත බොජුන් බැහැර කෙරෙත්. බමුණ, ආර්යධර්මය ඇති කල්හි මේ පැවැත්ම යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සියලු ගුණයෙන් යුත් මහර්ෂි වූ සන්හුන් කුකුස් ඇති රහත්හු මෙයින් අන්‍ය වූ අහාරයෙන් ද පානයෙන් ද උවටැන් කරව. පින් කැමැත්තහුට ඒ කෙත වේ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "311"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි කසිභාරද්වාජ බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේ ය. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. භවත් ගෞතමයන් වහන්ස, යම්සේ යටිහුරු වූවක් උඩුහුරු කරන්නේ හෝ වේ ද, වැසුනු දෙයක් විවර කරන්නේ හෝ වේ ද, මං මුළාවූවකුට මඟ කියා දෙන්නේ හෝ වේ ද, ඇස් ඇත්තෝ රූ දක්නාහ යි අඳුරෙහි තෙල් පහනක් දරන්නේ හෝ වේ ද, එසෙයින් ම භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් නියායෙන් දහම් පවසන ලදී. මේ මම භවත් ගොයුම්හු ද දහම ද බික්සඟණ ද සරණ යෙමි. භවත් ගෞතමයන් වහන්සේ අද පටන් දිවිහිමියෙන් සරණ ගිය මා උපාසකයකු කොට දරණ සේක්වා යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 2. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "උදය සූත්‍රය",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "198. **සැවැත්නුවර -**"
            },
            {
                "format": 13,
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ පෙරවරු හැඳ පෙරෙව පාසිවුරු ගෙණ උදය බමුණාගේ නිවෙස්න වෙත එළඹි සේක. එකල්හි උදය බමුණු තෙමේ භාග්‍යවතුන් වහන්සේගේ පාත්‍රය බතින් පුරාලීය. දෙවන දිනෙහි දූ භාග්‍යවතුන් වහන්සේ පෙරවරු හැඳ පෙරෙව පා සිවුරු ගෙණ උදය බමුණාගේ නිවෙස්න වෙත එළඹි සේක. දෙවන දිනෙහි දු උදය බමුණු තෙමේ භාග්‍යවතුන් වහන්සේගේ පාත්‍රය බතින් පුරාලීය. තෙවන දිනෙහි දු භාග්‍යවතුන් වහන්සේ පෙරවරු හැඳ පෙරෙව පාසිවුරු ගෙණ උදය බමුණාගේ නිවෙස්න වෙත එළඹි සේක. තෙවන දිනෙහි දු උදය බමුණු තෙමේ භාග්‍යවතුන් වහන්සේගේ පාත්‍රය බතින් පුරවා භාග්‍යවතුන් වහන්සේට “රසයෙහි ගිජු වූ මේ මහණ ගොයුම් තෙමේ පුනපුනා ඒ ය”යි මෙය කීය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "(ගොවියෝ) පුනපුනා බිජුවට වපුරත් ම ය. වැස්ස පුනපුනා වසී. ගොවියෝ පුනපුනා කෙත සාත්. ධාන්‍ය පුනපුනා රටට පැමිණේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යදියෝ පුනපුනා ඉල්ලත්. දානපතීහු දන් දෙත්. දානපතීහු පුනපුනා දන් දී පුනපුනා ස්වර්ගස්ථානයට පැමිණෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කිරි දොවන්නෝ පුනපුනා දොවත්. වස්සා මව කරා පුනපුනා එළඹේ. (සත්ව තෙමේ) පුනපුනා ක්ලාන්ත ද, කම්පිත ද වෙයි. බාල තෙමේ පුනපුනා ගැබට පැමිණේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "පුනපුනා උපදියි. මියෙයි. පුනපුනා සොහොනට ගෙණ යෙත්. නුවණැත්තේ නිවණ ලැබ පුනපුනා නූපදී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි උදය බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේ ය. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි … භවත් ගෞතමයන් වහන්සේ මා අද පටන් දිවිහිමියෙන් සරණ ගිය උපාසකයකු කොට දරණ සේක්වා යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "313"
            },
            {
                "type": "centered",
                "text": "7.2.3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දේවහිත සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "199. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකල්හි  භාග්‍යවතුන් වහන්සේ වාතයෙන් හටගත් අබාධ ඇති සේක. ආයුෂ්මත් උපවාන තෙමේ ද  භාග්‍යවතුන් වහන්සේට උපස්ථායක වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති  භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් උපවාන ඇමතූ සේක. උපවාන, බලව, තෙපි මට උණුදිය (ලැබෙන සැටියක්) දනිවු යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, එසේ ය යි කියා ආයුෂ්මත් උපවාන තෙමේ  භාග්‍යවතුන් වහන්සේට පිළිවදන් අස්වා හැඳ පෙරෙව පා සිවුරු ගෙණ දේවහිත බමුණාගේ නිවෙස්න වෙත එළඹියේ ය. එළඹ නිශ්ශබ්ද ව එකත්පසෙක සිටියේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "දේවහිත බමුණු තෙමේ නිශ්ශබ්ද ව එකත්පසෙක  සිටි ආයුෂ්මත් උපවාන තෙරුන් දැක්කේ ය. දැක ආයුෂ්මත් උපවාන තෙරුන්ට ගාථායෙන් කීය:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "හිස මුඩු කළ සඟල සිවුර පෙර වූ භවත් තෙමේ කුමක් පතමින් කුමක් සොයමින් නිශ්ශබ්ද ව සිටිනෙහි ද, කුමක් ඉල්ලන්නට ආයෙහි ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[උපවාන:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "බමුණ, ලොව අර්හත් වූ සුගත වූ මුනීන්ද්‍රයන් වහන්සේ වාතයෙන් වූ ආබාධ ඇති සේක. ඉදින් උණුදිය ඇත් නම් මුනීන්ද්‍රයන් වහන්සේට දෙව.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "පිදිය යුත්තන් විසින් පුදන ලද සත්කාර කටයුත්තන් විසින් සත්කාර කරණ ලද අපචිති (අපචායනා) කටයුත්තන් විසින් අපචිති (අපචායනා) කටයුත්තන් විසින් අපචිති කරණ ලද ඒ බුදුරජානන් වහන්සේට ගෙණ යන්නට (උණුදිය) කැමැත්තෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති දේවහිත බමුණු තෙමේ උණුදිය කදක් පුරුෂයකු ලවා ගන්වා සකුරුපිඩක් ද ආයුෂ්මත් උපවාන තෙරුන්ට පිදී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති ආයුෂ්මත් උපවාන තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ උණුදියෙන් නාවා උණුදියෙන් සකුරු දිය කොට භාග්‍යවතුන් වහන්සේ පිදී ය. ඉක්බිති භාග්‍යවතුන් වහන්සේගේ ඒ අබාධය සංසිඳුනේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි දේවහිත බමුණු තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සතුටුවිය යුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් දේවහිත බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට ගාථායෙන් කී ය:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "දෙයධර්මය කවරකුට දෙන්නේ ද? කවරකුට දෙන ලද්දේ මහත්ඵල වේ ද? කෙබඳු අයුරකින් කවරකුට දෙන්නහුගේ දක්ෂිණාව සමෘද්ධ වේ ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "යමෙක් පෙර විසූ කඳපිළිවෙළ දනී ද, ස්වර්ගය හා අපායත් දකී ද, වැලි ජාතික්ෂයසඞ්ඛ්‍යාත අර්හත්වයට පැමිණියේ ද, මාර්ගඥානයෙන් (චතුස්සතය්‍ය) දැන නිම වූ කිස ඇත්තේ ද, කායමෞනත්වාදි මෞනගුණ යුක්ත ද, ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "315"
            },
            {
                "format": 13,
                "text": "මොහුට දේයධර්මය දෙන්නේ ය. මොහුට දෙන ලද්ද මහත්ඵල වේ. මෙසේ දෙන්නහුගේ දක්ෂිණාව මෙසේ සමෘද්ධ වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි දේවහිත බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේ ය. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. … භවත් ගෞතමයන් වහන්සේ අද පටන් දිවියෙන් ගත් සරණ ගිය මා උපාසකයකු කොට දරණ සේක්වා යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7.2.4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මහාසාළ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "200. **සැවැත්නුවර - **",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති ජරාවට පත් වූ දිරා ගිය වස්ත්‍ර ඇති එක්තරා බමුණුමහසළෙක් භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථාව කොට නිමවා එකත් පසෙක හිඳගත්තේ ය. එකත්පසෙක හුන් ඒ බමුණු මහසළුව භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: බමුණ, කුමක්හෙයින් තෝ ජරාවට පත්වූයෙහි දිරා ගිය වස්ත්‍ර ඇත්තෙහි ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[බමුණු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "භවත් ගෞතමයෙනි, මෙහි මාගේ පුත්තු සතර දෙනෙකි. ඔහු අඹුවන් හා සාකච්ඡා කොට මා ගෙයින් නෙරති යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "බමුණ, එසේ වී නම් තෝ මේ ගාථා ඉගෙණ සභාවක මහජනසමූහයා රැස්වූ කල්හි පුතුන් ද හිඳගත් කල්හි කියව:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "(මට දාව) උපන්නා වූ යම් කෙනෙකුන් කරණ කොට ගෙණ සතුටු වූයෙම් ද, යම් කෙනකුන්ගේ අභිවෘද්ධිය පැතුයෙම් ද, ඔහු අඹුවන් හා සකච්ඡා කොට ගෙණ බල්ලෝ හූරකු (වළකන්නාක්) මෙන් මා වළකති.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අසත්පුරුෂ වූ ලාමක වූ රකුසෝ පුත්‍රයන් මෙන් (පෙණී සිටිමින්) මට පියානෙනි පියානෙනි යි කියත්. ඔහු ඉක්ම ගිය වයස් ඇති මා දුරු කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "පරිභෝගයට නුසුදුසු වූ ජරපත් අසකු මෙන් දිරා ගියා වූ පරිභෝග ධනය නැත්තා වූ බාලයන්ගේ පියා වූ මහල්ලා කෑමෙන් පහ කරණු ලැබේ. (එහෙයින් හෙ තෙමේ) පරගෙවල සිඟයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මාගේ යම් ඒ පුත්‍රයෝ නොකීකරු ද, (ඔවුන්ට වඩා) මට මේ සැරයටිය ම ශ්‍රේෂ්ඨ ය. (මේ සැරයටිය) සැඬගොණුකුදු වළකයි. වැලි සැඬබල්ලකුත් (වළකයි.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අඳුරෙහි පෙරටු වෙයි. ගැඹුරෙහි (ගැඹුරුදියෙහි) පිහිට ලබයි. පැකිලී දණ්ඩෙහි අනුභාවයෙන් නැවත පිහිටා සිටියි. (එහෙයිනි.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති ඒ බමුණු මහසල් තෙමේ භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ ගාථා ඉගෙණ සභාවෙහි මහාජනයා රැස් වූ කල්හි පුතුන් ද හිඳගත් කල්හි කී ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "317"
            },
            {
                "format": 13,
                "text": "(මට දා ව) උපන්නාවූ යම් කෙනකුන් කරණ කොට ගෙණ සතුටු වූයෙම් ද, යම් කෙනෙකුන් ගේ අභිවෘද්ධිය පතූයෙම් ද, ඔහු ද අඹුවන් හා සාකච්ඡා කොට ගෙණ බල්ලෝ හූරකු (වළකන්නාක්) මෙන් මා වළකති.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අසත්පුරුෂ වූ ලාමක වූ රකුසෝ පුත්‍රයන් මෙන් (පෙණී සිටිමින්) මට පියානෙනි, පියානෙනි යි කියත්. ඔහු ඉක්ම ගිය වයස් ඇති මා දුර කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "පරිභෝගයට නුසුදුසු වූ ජරපත් අසකු මෙන් දිරා ගියා වූ පරිභෝග ධනය නැත්තා වූ බාලයන්ගේ පියා වූ මහල්ලා කෑමෙන් පහ කරණු ලැබේ. (එහෙයින් හෙ තෙමේ) පරගෙහි සිඟයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මාගේ යම් ඒ පුත්‍රයෝ නොකීකරු ද, (ඔවුන්ට වඩා) මට මේ සැරයටිය ම ශ්‍රේෂ්ඨ ය, (මේ සැරයටිය) සැඬගොණුකුදු වළකයි. වැලි සැඬබල්ලකුත් (වළකයි.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "අඳුරෙහි පෙරටු වෙයි. ගැඹුරෙහි පිහිට ලබයි. පැකිලී දණ්ඩෙහි අනුභාවයෙන් නැවත පිහිටා සිටියි. (එහෙයිනි.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති පුත්‍රයෝ ඒ බමුණු මහසල්හු ගෙට පමුණුවා නාවා වෙන වෙන වස්ත්‍රයුග්මයෙන් පිදූහ. ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "එකල ඒ බමුණු මහසල් තෙමේ එක් වස්ත්‍රයුග්මයන් රැගෙන භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමග සතුටු වී ය. සතුටු වියයුතු සිහිකටයුතු කථාව කොට නිමවා එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් ඒ බමුණු මහසල් තෙමේ භාග්‍යවතුන් වහන්සේට මෙය කී ය:"
            },
            {
                "format": 13,
                "text": "භවත් ගෞතමයෙනි, අපි බමුණෝ වෙමු. ඇදුරහුට ඇදුරුධනය සොයම්හ. මාගේ ඇදුරු වූ භවත් ගෞතමයන් වහන්සේ ඇදුරුධනය පිළිගන්නා සේක්වා. භාග්‍යවතුන් වහන්සේ අනුකම්පාව නිසා පිළිගෙණ වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති ඒ බමුණු මහසල් තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේ ය: භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. … භවත් ගෞතමයන් වහන්ස, මා අද පටන් දිවි යෙන් ගත් සරණ ගිය උපාසකයකු කොට දරණ සේක්වා යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7.2.5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මානත්ථද්ධ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "201. **සැවැත්නුවර - **",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකල්හි මානත්ථද්ධ නම් බමුණෙක් සැවැත්නුවර වෙසෙයි. හෙතෙමේ මව නො ම වඳී. පියා නො ම වඳී. ඇදුරහු නො ම වඳී. දෙටු බෑයා නො ම වඳී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි භාග්‍යවතුන් වහන්සේ මහත් පිරිස විසින් පිරිවරණ ලද්දාහු දහම් දෙසන සේක. ඉක්බිති මානත්ථද්ධ බමුණාට මේ මහණගොයුම් තෙමේ මහත් පිරිස විසින් පිරිවරණ ලදු ව දහම් දෙසයි. මම මහණගොයුම් වෙත එළඹෙන්නෙම් නම් මැනව. ඉදින් මහණගොයුම් තෙමේ මට කථා කරන්නේ නම් මමත් ඔහුට කථා කරන්නෙමි. ඉදින් මහණගොයුම් තෙමේ මට කථා නො කරන්නේ නම් මමත් කථා නො කරන්නෙමි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "319"
            },
            {
                "format": 13,
                "text": "ඉක්බිති මානත්ථද්ධ බමුණු තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ නිශ්ශබ්ද ව එකත්පසෙක සිටියේ ය. එකල්හි භාග්‍යවතුන් වහන්සේ ඔහුට කථා නොකළ සේක. ඉක්බිති මානත්ථද්ධ බමුණු තෙමේ මේ මහණගොයුම් තෙමේ කිසිත් නො දනීයයි එතැනින් ම නැවත පෙරළා එනු කැමැත්තේ වි ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි භාග්‍යවතුන් වහන්සේ තම සිතින් මානත්ථද්ධ බමුණාගේ චිත්තපරිවිතර්කය දැන මානත්ථද්ධ බමුණාට ගාථායෙන් වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "බමුණ, මෙහි ප්‍රයෝජනයක් අපේක්ෂා කරනහුට මානය වැඩීම නො මැනවි. යම් ප්‍රයෝජනයක් හේතු කොට ගෙණ පැමිණියේ නම් එය ම සිදුකර ගන්නේ ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති මානත්ථද්ධ බමුණු තෙමේ මහණගොයුම් තෙමේ මාගේ සිත දනී යයි එහි ම භාග්‍යවතුන් වහන්සේගේ පාමුල හිසින් වැටී භාග්‍යවතුන් වහන්සේගේ පා මුවෙන් සිඹී. අතින් ද පිරිමදී. “භවත් ගෞතමයෙනි, මම මානත්ථද්ධ යෙමි. භවත් ගෞතමයෙනි, මම මානත්ථද්ධ යෙමි” යි නම ද අස්වයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති ඒ පිරිස “පින්වත්නි, ආශ්චර්ය්‍යයෙකි. පින්වත්නි අද්භූතයෙකි. මේ මානත්ථද්ධ බමුණු තෙමේ මව නො ම වඳී. පියා නො ම වඳී. ඇදුරහු නො ම වඳී. දෙටුබෑයා නො ම වඳී. එහෙත් ශ්‍රමණ ගෞතමයන් වහන්සේ කෙරෙහි මෙබඳු ඉතා ම යටත් පැවතුම් ඇති බවක් කෙරේ ය යී අද්භූත සිත් ඇති වූවා ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ මානත්ථද්ධ බමුණාට මෙය වදාළ සේක: බමුණ, පමණි. නැගිටුව. සිය අසුනෙහි හිඳ ගණුව. යම් හෙයකින් තාගේ සිත මා කෙරෙහි පහන් ද, (එහෙයිනි).",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති මානත්ථද්ධ බමුණු තෙමේ සිය අසුනෙහි හිඳ භාග්‍යවතුන් වහන්සේට ගාථාවකින් කී ය:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කවර කෙනෙකුන් කෙරෙහි මානය නො කරන්නේ කවරකෙනකුන් කෙරෙහි ගෞරව සහිත වන්නේ ද? ඔහු විසින් කවර කෙනෙක් අපචිති කටයුත්තෝ වන්නාහු ද? ඔහු විසින් කවර කෙනෙක් මැනවින් පිදියයුත්තෝ වන්නාහු ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මව කෙරෙහි ද, පියා කෙරෙහි ද, වැලි දෙටුබෑයා කරෙහි ද, සිවුවැනි ව ඇදුරා කෙරෙහි දැ යි යන මොවුන් කෙරෙහි මානය නො කරන්නේ ය. මොවුන් කෙරෙහි ගෞරව සහිත වන්නේ ය. ඔහු විසින් මොහු අපචිති කටයුත්තෝ වන්නාහ. ඔහු විසින් මොහු මැනවින් පිදියයුත්තෝ වන්නාහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සිහිල් වූ කළකිස ඇති ආස්‍රව රහිත වූ නිරුත්තර වූ ඒ රහතුන් (මානයෙන්) තද නො වී මානය නසා වඳුව.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි මානත්ථද්ධ බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. … භවත් ගෞතමයන් වහන්සේ මා අද පටන් දිවියෙන් ගත් සරණ ගිය උපාසකයකු කොට දරණ සේක්වා යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "321"
            },
            {
                "type": "centered",
                "text": "7.2.6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පච්චනීක සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "202. මා විසින් මෙසේ අසන ලදී: එක්කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයෙහි වූ ජේතවන නම් වූ අනේපිඬු සිටුහුගේ අරම්හි වැඩ වසන සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි පච්චනීකසාත නම් බමුණෙක් සැවැත්නුවර වෙසෙයි. ඉක්බිති පච්චනීකසාත බමුණාහට “මම මහණ ගොයුම් වෙත එළඹෙන්නෙම් නම් මැනවි. මහණ ගොයුම් යමක් යමක් ම කියන්නේ ද, මම ඔහුගේ ඒ ඒ වදනට ම විරුද්ධ වන්නෙමී”යි මේ අදහස විය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි භාග්‍යවතුන් වහන්සේ අබවස සක්මන් කරණ සේක. එවිට පච්චනීකසාත බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේ කරා එළඹියේ ය. එළඹ සක්මන් කරණ භාග්‍යවතුන් වහන්සේ අනුව සක්මන් කරමින් භාග්‍යවතුන් වහන්සේට “ශ්‍රමණයෙනි දහම් දෙසනු මැනවැ”යි මෙය කීය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "පච්චනීකසාත වූ කිලිටිසිත් ඇති කරණුත්තරියකරණය බහුල කොට ඇති පුද්ගලයා විසින් සුබැසි දහම මොනවට නො දතහැක්කේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යමෙක් සිතේ අප්‍රසාදය ද බද්ධවෛරය ද දුරු කොට සාරම්භය බැහැර කොට (සිටියේ ද ) හෙ තෙමේ ඒකාන්තයෙන් සුබැසි දහම දැන ගන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි පච්චනීකසාත බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. … භවත් ගෞතමයන් වහන්සේ මා අද පටන් දිවිහිමියෙන් සරණ ගිය උපාසකයකු කොට දරණ සේක්වා!",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7.2.7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නවකම්මික සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "203. එක්කලෙක භාග්‍යවතුන් වහන්සේ කොසොල් දනව්වෙහි එක්තරා වනලැහැබෙක වැඩවසන සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි නවකම්මිකභාරද්වාජ බමුණු තෙමේ ඒ වනලැහැබෙහි කර්මාන්ත කරවයි. නවකම්මිකභාරද්වාජ බමුණු තෙමේ එක්තරා සල්රුකක්මුල උඩුකය කෙළින් තබා (කමටහනට) අභිමුඛ කොට සිහි එළවා පලක් බැඳ වැඩහුන් භාග්‍යවතුන් වහන්සේ දැක්කේ ය. දැක ඔහුට “මම වනාහි කර්මාන්ත කරවමින් මේ වනලැහැබෙහි සිත් අලවමි. මේ මහණගොයුම් තෙමේ කුමක් කරවමින් සිත් අලවා දැ”යි මේ අදහස වි ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති නවකම්මිකභාරද්වාජ බමුණු තෙමේ භාගවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේට ගාථායෙන් කී ය:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණ, ඔබවහන්සේ විසින් මේ සල්වෙනෙහි කිනම් කර්මාන්තයෝ කරණු ලැබෙද්ද? ගෞතමයෙනි, යම් හෙයකින් මේ වෙනෙහි හුදෙකලා ව ඇල්ම විඳිහි ද? (එහෙයින්) මෙසේ විචාරමි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "323"
            },
            {
                "format": 13,
                "text": "මට මේ වෙනෙහි කටයුත්තෙක් නැත. මාගේ කෙලෙස්වනය මුලුසුන් කරණ ලද්දේ ය. පහව ගිය (කෙලෙස්) කටු ඇත්තේ ය. ඒ මම නික්ලේශී ව පහ ව ගිය (රාගාදී) හුල ඇති ව (ප්‍රාන්තසෙනසුන්හි හා භාවනාවෙහි) නොඇල්ම වෙසෙසින් පහ කොට මේ වෙනෙහි එකලාව සිත් අලවා වෙසෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි නවකම්මිකභාරද්වාජ බමුණු භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය: භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. … භවත් ගෞතමයන් වහන්සේ අද පටන් දිවි හිමියෙන් සරණ ගිය මා උපාසකයකු කොට දරණ සේක්වා යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 2. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කට්‌ඨහාර සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "204. එක්කලෙක භාග්‍යවතුන් වහන්සේ කොසොල්දනව්වෙහි එක්තරා වනලැහැබෙක වැඩවසන සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි එක්තරා භාරද්වාජගෝත්‍ර බමුණකුගේ අතවැසි වූ දර ගෙණෙන බොහෝ මාණවකයෝ ඒ වනලැහැබ වෙත එළඹියහ. එළඹ ඒ වනලැහැබෙහි පලක් බැඳ උඩුකය කෙළින් තබා අභිමුඛ කොට සිහි එළවා වැඩහුන් භාග්‍යවතුන් වහන්සේ දුටුහ. දැක භාරද්වාජගෝත්‍ර බමුණා වෙත එළඹියහ. එළඹ භාරද්වාජගෝත්‍ර බමුණාහට “භවත් තෙමේ දන්නේ ද? අසවල් වනලැහැබෙහි මහණෙක් පලක් බැඳ උඩුකය කෙලින් තබා සිහිය අභිමුඛ කොට එළවා හුන්නේ ය”යි මෙය කීහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති භාරද්වාජගෝත්‍ර බමුණු ඒ මණෙවුන් සමග ඒ වනලැහැබ වෙත එළඹියේ ය. එළඹ ඒ වනලැහැබෙහි පලක් බැඳ උඩුකය කෙලින් තබා අභිමුඛ කොට සිහි එළවා වැඩහුන් භාග්‍යවතුන් වහන්සේ දැක්කේ ය. දැක භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේට ගාථායෙන් කීය;",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ශ්‍රමණයෙනි, හිස් වූ, ජනයාගෙන් තොර වූ, අරණ්‍යයට පිවිස ගැඹුරු ස්වභාවය ඇති බොහෝ සෙයින් බිය එළවන මේ වෙනෙහි නොසැලෙන ස්ථිර වූ මනහර සිරුරෙන් යුක්ත ව ඒකාන්තයෙන් සොඳුරු ස්වභාවය ඇති ධ්‍යාන කෙරෙහි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යම් තැනෙක ගී ගැයුම් නැද්ද, යම් තැනෙක වැයුමෙකුත් නැද්ද, (එබඳු වූ මේ) වෙනෙහි සර්වඥමුනි තෙමේ හුදෙකලා ව වනසෙනසුන් ඇසුරු කෙළේ ය. යම් හෙයෙකින් එකලා ව ම තුටුසිත් ඇති ව වෙනෙහි වෙසෙන්නේ ද, (එහෙයින්) මෙකරුණ පුදුමයක් සේ මට වැටහෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ලෝකාධිපති බ්‍රහ්මයා හා සහභාවය වූ නිරුත්තර බඹලොව පතමින් (වෙනෙහි වෙසෙයි යයි) මම හඟිමි. (නැතහොත්) භවත් කුමක් හෙයින් ජනයා කෙරෙන් තොර වූ වනය ඇසුරු කළේ ද? බ්‍රහ්මලෝකෝත්පත්තිය පිණිස මෙහි තපස් කෙරෙහි ද?",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "325"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "type": "paragraph",
                "text": "යම්කිසි අභිනන්දනස්වරූප තෘෂ්ණායෙක් හෝ අනෙකස්වාභාවාලම්බණයන්හි වූ නිරතුරු ඇසුරු කළ නානාප්‍රකාර සෙසු කෙලෙස් හෝ ඇද්ද, අවිද්‍යාව මූලප්‍රභාවය කොට ඇති අවිධ්‍යාමූල සහිත වූ ඒ සියලු තෘෂ්ණාවෝ මා විසින් නසන ලදහ."
            },
            {
                "format": 13,
                "text": "බමුණ, ඒ මම තෘෂ්ණා රහිත වූයෙම් තෘෂ්ණාව ඇසුරු නො කෙළෙම් උපගමන රහිත වූයෙම් සියලු ධර්මයන්හි විශුද්ධිදර්ශන ඇත්තෙම් වෙමි. ඒ මම නිරුත්තර වූ ශ්‍රේෂ්ඨ වූ සම්බෝධියට පැමිණ විශාරද ව රහසිගතව ධ්‍යාන කෙරෙමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි භාරද්වාජගෝත්‍ර බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේ ය: භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. … භවත් ගෞතමයන් වහන්සේ අද පටන් දිවිහිමියෙන් සරණ ගිය මා උපාසකයකු කොට දරණ සේක්වා යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7.2.9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මාතුපොසක සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "205. **සැවැත්නුවර -**",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි මාතුපොසක බමුණු භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සතුටුවියයුතු සිහිකටයුතු කථාව කොට නිමවා එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් මාතුපොසක බමුණු භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේය. භවත් ගෞතමයෙනි, මම වනාහි දැහැමින් භික්ෂාව සොයමි. දැහැමින් භික්ෂාව සොයා මවුපියන් පුසිමි. භවත් ගෞතමයෙනි, කිම? මම මෙසේ කරන්නෙම් කිස කරන්නෙකිම් වෙම් ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "බමුණ, මෙසේ කරණ තෝ ඒකාන්තයෙන් කිස කරන්නෙහි. බමුණ, යමෙක් දැහැමින් භික්ෂාව සොයා ද, දැහැමින් භික්ෂාව සොයා මවුපියන් පුසී ද, හෙ තෙමේ බොහෝ පින් රැස් කෙරෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "යම් මිනිසෙක් මවත් පියාත් දැහැමින් පුසී ද, මවුපියන් කෙරෙහි වූ ඒ මෙහෙ කිරීම හේතු කොට ගෙණ පණ්ඩිතයෝ මේ ලොව්හි ම පසසත්. පරලොව ස්වර්ගයෙහි සතුටු වෙයි.",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "මෙසේ වදාළ ලක්හි මාතුපෝසක බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය: භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. … භවත් ගෞතමයන් වහන්සේ අද පටන් දිවිහිමියෙන් සරණ ගිය මා උපාසකයකු කොට දරණ සේක්වා."
            },
            {
                "type": "page-break",
                "text": "327"
            },
            {
                "type": "centered",
                "text": "7.2.10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "භික්‌ඛක සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "206. **සැවැත්නුවර - **",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි භික්ඛක බමුණු භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සතුටුවියයුතු සිහිකටයුතු කථාව කොට නිමවා එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් භික්ඛක බමුණු භාග්‍යවතුන් වහන්සේට තෙල සැළ කෙළේය. භවත් ගෞතමයෙනි, මමත් භික්ෂකයෙක්මි. භවත් තෙමේත් භික්ෂකයෙකි. මෙහි ලා අප දෙදෙනාගේ කිනම් වෙනසෙක් ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භාගවතුහු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මෙරමා සිඟා යන මෙතෙක් වේ ද, එපමණෙකින් භික්ෂකයෙක් නො වේ. දුර්ගන්ධය වූ අකුශලධර්මය සමාදන් ව (සිටියේ) ඒ තාක් භික්ෂු නම් නො වේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මේ සස්නෙහි යමෙක් පිණ ද පව ද බැහැර කොට වුසු බඹසර ඇත්තේ නුවණින් දැන ලොව්හි හැසිරේ ද, හෙ තෙමේ ඒකාන්තයෙන් භික්ෂු යයි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි භික්ෂක බමුණු භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය: භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. … භවත් ගෞතමයන් වහන්සේ අද පටන් දිවිහිම් කොට සරණ ගිය මා උපාසකයකු කොට දරණ සේක්වා.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 2. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සඞ්‌ගාරව සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "207. **සැවැත්නුවර - **",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "එකල්හි සඞ්ගාරව නම් බමුණෙක් සැවැත්නුවර වෙසෙයි. ජලයෙන් ශුද්ධිය වේ යයි අදහන්නේ ජලයෙන් පිරිසිදු බව පතයි. උදය සවස දියට බැසීම් ව්‍රතයෙහි යෙදුනේ වෙසෙයි."
            },
            {
                "format": 13,
                "text": "ඉක්බිති ආයුෂ්මත් ආනන්ද තෙරණුවෝ පෙරවරු හැඳ පෙරව පාසිවුරු ගෙණ සැවැත්නුවරට පිඬු පිණිස පිවිසියහ. සැවැත්නුවර පිඬු පිණිස හැසිර පසුබත පිණ්ඩපාතයෙන් වැළකුනාහු භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක හුන්හ. එකත්පසෙක හුන් ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළහ: “වහන්ස, මෙහි සඞ්ගාරව නම් බමුණෙක් සැවැත්නුවර වෙසෙයි. ජලයෙන් ශුද්ධිය වේ යයි අදහන්නේ ජලයෙන් පිරිසිදු බව පත යි. උදය සවස දියට බැසීම් ව්‍රතයෙහි යෙදුනේ වෙසෙයි. වහන්ස, භාග්‍යවත්හු අනුකම්පා පිණිස සඞ්ගාරව නම් බමුණාගේ නිවෙස්න වෙත එළඹෙන සේක්වා. ඒ මැනවි”යි. භාග්‍යවතුන් වහන්සේ නිශ්ශබ්ද භාවයෙන් ඉවසා වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ පෙරවරු හැඳ පෙරව පාසිවුරු ගෙණ සඞ්ගාරව බමුණාගේ නිවෙස්න වෙත එළඹි සේක. එළඹ පණවන ලද අස්නෙහි වැඩහුන් සේක.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "329"
            },
            {
                "format": 13,
                "text": "එකල්හි සඞ්ගාරව බමුණු භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සතුටු වියයුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් සඞ්ගාරව බමුණාට භාග්‍යවතුන් වහන්සේ  මෙය වදාළ සේක. බමුණ, සැබැව? තෝ ජලයෙන් ශුද්ධිය වේ යයි අදහන්නෙහි ජලයෙන් පිරිසිදු බව පතයි ද? උදය සවස දියට බැසීම් ව්‍රතයෙහි යෙදුනෙහි වෙසෙයි ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භවත් ගෞතමයෙනි, එසේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "බමුණ, තෝ කිනම් ආනිසංසයක් දක්මින් ජලයෙන් පිරිසිදු වේ යයි අදහන්නෙහි ජලයෙන් පිරිසිදු බව පතයි ද? උදය සවස දියට බැසීම් ව්‍රතයෙහි යෙදුනෙහි වෙසෙයි ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භවත් ගෞතමයෙනි, මෙහි මා විසින් දහවල් යම් පව්කමෙක් කරණ ලද්දේ වේ ද, සවස නෑමෙන් එය පා කොට හරිමි. රෑ යම් පව්කමෙක් කරණ ලද්දේ වේ ද, උදය නෑමෙන් එය පා කොට හරිමි. භවත් ගෞතමයෙනි, මම මේ ආනිසංසය දක්නෙම් ජලයෙන් ශුද්ධිය වේ යයි අදහන්නෙම් ජලයෙන් පිරිසුදු බව පතමි. උදය සවස දියට බැසීම් ව්‍රතයෙහි යෙදුනෙම් වෙසෙමි යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "[භගවත්හු:]",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "වේදයෙහි පරතෙරට ගිය අර්යයයෝ යම් තැනෙක ස්නානය කළාහු නොතෙත් සිරුර ඇතිව ම නිවන් නමැති පරතෙරට ඒකාන්තයෙන් යෙද් ද, බමුණ, ධර්මය තෙමේ සිල් නමැති තොට ඇති වෙසෙසින් පහන් වූ උතුම් සත්පුරුෂයන් විසින් පසස්නා ලද (එබඳු) ජලාසයෙකි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි සඞ්ගාරව බමුණු තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය: භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. … භවත් ගෞතමයන් වහන්සේ අද පටන් දිවිහිමියෙන් සරණ ගිය මා උපාසකයකු කොට දරණ සේක්වා.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "7. 2. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඛොමදුස්‌ස සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "208. මා විසින් මෙසේ අසන ලදී: එක්කලෙක භාග්‍යවතුන් වහන්සේ ශාඛය ජනපදයෙහි ශාක්‍යයන්ගේ ඛොමදුස්‌ස නම් නියම්ගම්හි වැඩවසන සේක, එකල්හි භාග්‍යවතුන් වහන්සේ පෙරවරු හැඳ පෙරව පාසිවුරු ගෙණ ඛොමදුස්‌ස නියම්ගමට පිඬු පිණිස පිවිසි සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල, ඛොමදුස්‌ස නියම්ගම්වැසි බමුණුගැහැවියෝ කිසියම් කටයුත්තක් සඳහා සභායෙහි රැස්වූවාහු වෙති. වැස්ස ද එකිඑකි පොද හෙළයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එවිට භාග්‍යවතුන් වහන්සේ ඒ සභාව වෙත එළඹි සේක. ඛොමදුස්‌සක බමුණුගැහැවියෝ වඩින්නා වූ භාග්‍යවතුන් වහන්සේ දුර දී ම දුටුහ. දැක නින්දිත මුඩුමහණහු කවරහු ද, කවර කෙනෙක් සභාධර්මය දන්නාහු දැ යි මෙය කීහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ ඛොමදුස්‌සක බමුණුගැහැවියන්ට ගාථායෙන් වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "331"
            },
            {
                "format": 13,
                "text": "යම් තැනෙක සත්පුරුෂයෝ නැද් ද, තෙල සභායෙක් නොවේ. යම් කෙනෙක් ධර්මය නො කියද් ද, ඔහු සත්පුරුෂ නොවෙති. රාගය ද, ද්වේෂය ද, මෝහය ද දූරු කොට ධර්මය දේශනා කරන්නෝ ම සත්පුරුෂ වෙති.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි ඛොමදුස්‌සක බමුණුගැහැවියෝ භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේ ය. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. භවත් ගෞතමයන් වහන්ස, යම්සේ යටිහුරු වූවක් උඩුහුරු කරන්නේ හෝ වේ ද, වැසුනු දෙයක් විවර කරන්නේ හෝ වේ ද, මංමුළා වූවකුට මඟ කියා දෙන්නේ හෝ වේ ද, ඇස් ඇත්තෝ රූප දක්නාහයි අඳුරෙහි තෙල්පහනක් දරන්නේ හෝ වේ ද, එපරිද්දෙන් ම භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් නියරින් ධර්මය ප්‍රකාශ කරණ ලද්දේ ය. මේ අපි භවත් ගොයුම්හු ද, දහම ද, බික්සඟන ද සරණ යමු. භවත් ගෞතමයන් වහන්සේ අද පටන් දිවිහිමියෙන් සරණ ගිය අප උපාසකයන් කොට දරණ සේක්වා යි.",
                "type": "paragraph"
            },
            {
                "format": 11,
                "text": "උපාසක වර්ගය දෙවෙනි යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 20,
                "text": "**එහි උද්දානය:**",
                "type": "unindented"
            },
            {
                "format": 20,
                "text": "කසී, උදය, දේවහිත, අඤ්ඤතරමහාසාළ, මානත්ථද්ධ, පච්චනීක, නවකම්ම, කට්ඨහාරක, මාතුපොසක, භික්ඛක, සඞ්ගාරව, ඛොමදුස්‌ස සූත්‍රය යි සූත්‍ර දොළොසෙකි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "බ්‍රාහ්මණ සංයුත්තය නිමියේ ය.",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ]
    }
]