[
    {
        "filename": "sn-ndnv-8",
        "bookId": 17,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "406"
            },
            {
                "type": "heading",
                "text": "8. ඔපම්මසංයුත්තං",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. පඨමො වග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "8. 1. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කූටසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "383. එවං මෙ සුතං: එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තත්ර ඛො භගවා -පෙ- එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ, කූටාගාරස්ස යා කාචි ගොපානසියො, සබ්බා තා කූටඞ්ගමා කූටසමොසරණා, කූටසමුග්ඝාතා සබ්බා තා සමුග්ඝාතං ගච්ඡන්ති. එවමෙව ඛො භික්ඛවෙ, යෙ කෙචි අකුසලමූලා{1 අකුසලා ධම්මා - මඡසං. PTS. ස්යා.} සබ්බෙ තෙ අවිජ්ජඞ්ගමා{2 අවිජ්ජා-මූලකා - මඡසං. PTS. ස්යා.} අවිජ්ජාසමොසරණා. අවිජ්ජාසමුග්ඝාතා සබ්බෙ තෙ සමුග්ඝාතං ගච්ඡන්ති."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ භික්ඛවෙ, එවං සික්ඛිතබ්බං: “අප්පමත්තා විහරිස්සාමා”ති. එවං හි වො භික්ඛවෙ, සික්ඛිතබ්බන්ති."
            },
            {
                "type": "centered",
                "text": "8. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නඛසිඛාසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "384. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා පරිත්තං නඛසිඛායං පංසුං ආරොපෙත්වා භික්ඛූ ආමන්තෙසි: තං කිම්මඤ්ඤථ භික්ඛවෙ, කතමන්නුඛො බහුතරං යො වායං{3 යො චායං - මඡසං.} මයා පරිත්තො නඛසිඛායං පංසු ආරොපිතො, අයං වා{4 යො චායං - මඡසං.} මහාපඨවීති?"
            },
            {
                "type": "paragraph",
                "text": "එතදෙව භන්තෙ බහුතරං යදිදං මහාපඨවී. අප්පමත්තකොයං භගවතා පරිත්තො නඛසිඛායං පංසු ආරොපිතො. සඞ්ඛම්පි න උපෙති, උපනිධිම්පි න උපෙති, කලභාගම්පි න උපෙති, මහාපඨවිං උපනිධාය භගවතා පරිත්තො නඛසිඛායං පංසු ආරොපිතොති.\n\nඑව මෙව ඛො භික්ඛවෙ, අප්පකා තෙ සත්තා යෙ මනුස්සෙසු පච්චාජායන්ති. අථ ඛො එතෙව බහුතරා සත්තා යෙ අඤ්ඤත්ර මනුස්සෙහි පච්චාජායන්ති."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ භික්ඛවෙ, එවං සික්ඛිතබ්බං: “අප්පමත්තා විහරිස්සාමා”ති. එවං හි වො භික්ඛවෙ, සික්ඛිතබ්බන්ති."
            },
            {
                "type": "page-break",
                "text": "408"
            },
            {
                "type": "centered",
                "text": "8. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කුලසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "385. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ, යානි කානිචි කුලානි බහුත්ථිකානි අප්පපුරිසානි, තානි සුප්පධංසියානි හොන්ති චොරෙහි කුම්භත්ථෙනකෙහි. එවමෙව ඛො භික්ඛවෙ, යස්ස කස්සචි භික්ඛුනො මෙත්තා චෙතොවිමුත්ති අභාවිතා අබහුලීකතා, සො සුප්පධංසියො හොති අමනුස්සෙහි."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ, යානි කානිචි කුලානි අප්පිත්ථිකානි{1 අප්පත්ථිකානි - සීමු. සී 1, 2. ස්යා.} බහුපුරිසානි, තානි දුප්පධංසියානි හොන්ති චොරෙහි කුම්භත්ථෙනකෙහි. එවමෙව ඛො භික්ඛවෙ, යස්ස කස්සචි භික්ඛුනො මෙත්තා චෙතොවිමුත්ති භාවිතා බහුලීකතා, සො දුප්පධංසියො හොති අමනුස්සෙහි."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ භික්ඛවෙ, එවං සික්ඛිතබ්බං: මෙත්තා නො චෙතොවිමුත්ති භාවිතා භවිස්සති බහුලීකතා යානීකතා වත්ථුකතා අනුට්ඨිතා පරිචිතා සුසමාරද්ධාති. එවං හි වො භික්ඛවෙ, සික්ඛිතබ්බන්ති."
            },
            {
                "type": "centered",
                "text": "8. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඔක්ඛාසතසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "386. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "යො භික්ඛවෙ, පුබ්බණ්හසමයං ඔක්ඛාසතං{2 උක්ඛාසතං - සී 1, 2.} දානං දදෙය්ය, යො මජ්ඣන්තිකං සමයං ඔක්ඛාසතං දානං දදෙය්ය, යො සායණ්හසමයං ඔක්ඛාසතං දානං දදෙය්ය, යො වා පුබ්බණ්හසමයං අන්තමසො ගද්දුහනමත්තම්පි මෙත්තං චිත්තං භාවෙය්ය, යො වා මජ්ඣත්තිකං සමයං අන්තමසො ගද්දුහනමත්තම්පි මෙත්තං චිත්තං භාවෙය්ය, යො වා සායණ්හසමයං අන්තමසො ගද්දුහනමත්තම්පි මෙත්තං චිත්තං භාවෙය්ය, ඉදං තතො මහප්ඵලතරං."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ භික්ඛවෙ, එවං සික්ඛිතබ්බං: මෙත්තා නො චෙතොවිමුත්ති භාවිතා භවිස්සති බහුලීකතා යානීකතා වත්ථුකතා අනුට්ඨිතා පරිචිතා සුසමාරද්ධාති. එවං හි වො භික්ඛවෙ සික්ඛිතබ්බන්ති."
            },
            {
                "type": "page-break",
                "text": "410"
            },
            {
                "type": "centered",
                "text": "8. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සත්තිසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "387. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ, සත්ති තිණ්හඵලා. අථ පුරිසො ආගච්ඡෙය්ය “අහං ඉමං සත්තිං තිණ්හඵලං පාණිනා වා මුට්ඨිනා වා පතිලෙණිස්සාමි පතිකොට්ටෙස්සාමි{1 පතිකොට්ටස්සාමි - සී 1, 2.} පතිවට්ටෙස්සාමී”ති.{2 පතිවට්ටස්සාමි - සී 1, 2.} තං කිම්මඤ්ඤසි භික්ඛවෙ, භබ්බො නු ඛො සො පුරිසො අමුං සත්තිං තිණ්හඵලං පාණිනා වා මුට්ඨිනා වා පටිලෙණෙතුං පතිකොට්ටෙතුං පතිවට්ටෙතුන්ති? නො හෙතං භන්තෙ. තං කිස්ස හෙතු? අසු හි භන්තෙ සත්ති තිණ්හඵලා න සුකරා පාණිනා වා මුට්ඨිනා වා පතිලෙණෙතුං පතිකොට්ටෙතුං පතිවට්ටෙතුං. යාවදෙව ච පන සො පුරිසො කිලමථස්ස විඝාතස්ස භාගී අස්සාති."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො භික්ඛවෙ, යස්ස කස්සචි භික්ඛුනො මෙත්තා චෙතොවිමුත්ති භාවිතා බහුලීකතා යානීකතා වත්ථුකතා අනුට්ඨිතා පරිචිතා සුසමාරද්ධා, තස්ස චෙ අමනුස්සො චිත්තං ඛිපිතබ්බං මඤ්ඤෙය්ය, අථ ඛො ස්වෙව අමනුස්සොකිලමථස්ස. විඝාතස්ස භාගී අස්ස."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ භික්ඛවෙ, එවං සික්ඛිතබ්බං. මෙත්තා නො චෙතොවිමුත්ති භාවිතා භවිස්සති බහුලීකතා යානීකතා වත්ථුකතා අනුට්ඨිතා පරිචිතා සුසමාරද්ධාති. එවං හි වො භික්ඛවෙ, සික්ඛිතබ්බන්ති."
            },
            {
                "type": "centered",
                "text": "8. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ධනුග්ගහසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "388. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ, චත්තාරො දළ්හධම්මා ධනුග්ගහා සික්ඛිතා කහතත්ථා කතූපාසනා චතුද්දිසා ඨිතා අස්සු. අථ පුරිසො ආගච්ඡෙය්ය “අහං ඉමෙසං චතුන්නං දළ්හධම්මානං ධනුග්ගහානං සික්ඛිතානං කතභත්ථානං කතූපාසනානං චතුද්දිසා කණ්ඩෙ ඛිත්තෙ අප්පතිට්ඨිතෙ පඨවියං{3 සුසික්ඛිතස්ස - මඡසං.} ගහෙත්වා ආහරිස්සාමී”ති. තං කිම්මඤ්ඤථ භික්ඛවෙ, ජවනො පුරිසො පරමෙන ජවෙන සමන්නාගතොති අලං වචනායාති?"
            },
            {
                "type": "paragraph",
                "text": "එකස්ස චෙපි භන්තෙ, දළ්හධම්මස්ස ධනුග්ගහස්ස සික්ඛිතස්ස{4 සුසික්ඛිතස්ස - මඡසං.} කතහත්ථස්ස කතූපාසනස්ස කණ්ඩං ඛිත්තං අප්පතිට්ඨිතං පඨවියං{5 පුථුවියං - සී 1, 2. ථපවියං - මඡසං.} ගහෙත්වා ආහරෙය්ය, ජවනො පුරිසො පරමෙන ජවෙන සමන්නාගතොති අලං වචනාය. කොපනවාදො චතුන්නං දළ්හධම්මානං ධනුග්ගහානං සික්ඛිතානං කතහත්ථානං කතූපාසනානන්ති."
            },
            {
                "type": "page-break",
                "text": "412"
            },
            {
                "type": "paragraph",
                "text": "යථා ච භික්ඛවෙ, තස්ස පුරිසස්ස ජවො යථා ච චන්දිමසූරියානං ජවො තතො සීඝතරො. යථා ච භික්ඛවෙ, තස්ස පුරිසස්ස ජවො, යථා ච චන්දිමසූරියානං ජවො, යථා ච යා දෙවතා චන්දිමසූරියානං පුරතො ධාවන්ති, තාසං දෙවතානං ජවො තතො සීඝතරො.{1 සීඝතරං - මඡසං.} යථා ච භික්ඛවෙ, තස්ස පුරිසස්ස ජවො, යථා ච චන්දිමසුරියානං ජවො, යථා ච යා දෙවතා චන්දිමසුරියානං පුරතො ධාවන්ති තාසං දෙවතානං ජවො, තතො සීඝතරං ආයුසඞ්ඛාරා ඛියන්ති."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ භික්ඛවෙ, එවං සික්ඛිතබ්බං: අප්පමත්තා විහරිස්සාමාති. එවං හි වො භික්ඛවෙ, සික්ඛිතබ්බන්ති."
            },
            {
                "type": "centered",
                "text": "8. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආණිසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "389. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "භූතපුබ්බං භික්ඛවෙ, දසාරහානං{2 දසභාතිකානං - සීමු.} ආණකො නාම මුදිඞ්ගො අහොසි. තස්ස දසාරහා ආණකෙ ඵළිතෙ{3 ඝටිතෙ - මඡසං. PTS.} අඤ්ඤං ආණිං ඔදහිංසු. අහු ඛො සො භික්ඛවෙ සමයො යං ආණකස්ස මුදිඞ්ගස්ස පොරාණං පොක්ඛර ඵලකං{4 පොක්ඛරං ඵලකං - සීමු. ස්යා.} අන්තරධායි, ආණිසඞ්ඝාටොව අවසිස්සි."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො භික්ඛවෙ, භවිස්සන්ති භික්ඛූ අනාගතමද්ධානං, යෙ තෙ සුත්තන්තා තථාගතභාසිතා ගම්භීරා ගම්භීරත්ථා ලොකුත්තරා සුඤ්ඤතපටිසංයුත්තා,{5 සුඤ්ඤතප්පටිසායුත්තං - මඡසං.} තෙසු භඤ්ඤමානෙසු න සුස්සූසිස්සන්ති,{6 සුස්සූයිස්සන්ති - සීමු. සී 1, 2.} න සොතං ඔදහිස්සන්ති, න අඤ්ඤාචිත්තං උපට්ඨාපෙස්සන්ති. න ච තෙ ධම්මෙ උග්ගහෙතබ්බං පරියාපුණිතබ්බං මඤ්ඤිස්සන්ති. යෙ පන තෙ සුත්තන්තා කවිකතා කාවෙය්යා චිත්තක්ඛරා චිත්තබ්යඤ්ජනා බාහිරකා සාවකභාසිතා, තෙසු භඤ්ඤමානෙසු සුස්සූසිස්සන්ති, සොතං ඔදහිස්සන්ති, අඤ්ඤාචිත්තං උපට්ඨාපෙස්සන්ති තෙ ච ධම්මෙ උග්ගහෙතබ්බං පරියාපුණිතබ්බං මඤ්ඤිස්සන්ති. එවමෙතෙසං භික්ඛවෙ, සුත්තන්තානං තථාගතභාසිතානං ගම්භීරානං ගම්භීරත්ථානං ලොකුත්තරානං සුඤ්ඤතපටිසංයුත්තානං අන්තරධානං භවිස්සති."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ භික්ඛවෙ, එවං සික්ඛිතබ්බං: “යෙ තෙ සුත්තන්තා තථාගතභාසිතා ගම්භීරා ගම්භීරත්ථා ලොකුත්තරා සුඤ්ඤතපටිසංයුත්තා, තෙසු භඤ්ඤමානෙසු සුස්සූසිස්සාම, සොතං ඔදහිස්සාම, අඤ්ඤාචිත්තං උපට්ඨාපෙස්සාම. තෙ ච ධම්මෙ උග්ගහෙතබ්බං පරියාපුණිතබ්බං මඤ්ඤිස්සාමාති. එවං හි වො භික්ඛවෙ, සික්ඛිතබ්බන්ති."
            },
            {
                "type": "page-break",
                "text": "414"
            },
            {
                "type": "centered",
                "text": "8. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කලිඞ්ගරූපධානසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "390. එවං මෙ සුතං: එකං සමයං භගවා වෙසාලියං විහරති මහාවනෙ කූටාගාරසාලායං. තත්ර -පෙ- භගවා එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "කලිඞ්ගරූපධානා භික්ඛවෙ, එතරහි ලිච්ඡවී විහරන්ති අප්පමත්තා ආතාපිනො උපාසනස්මිං. තෙසං රාජා මාගධො අජාතසත්තු වෙදෙහිපුත්තො න ලභති ඔතාරං, න ලභති ආරම්මණං. භවිස්සන්ති භික්ඛවෙ, අනාගතමද්ධානං ලිච්ඡවී සුඛුමාලා මුදුතළුණහත්ථපාදා. තෙ මුදුකාසු සෙය්යාසු තූලබිම්බොහනාදිසු යාව සූරියුග්ගමනා සෙය්යං කප්පෙස්සන්ති. තෙසං රාජා මාගධො අජාතසත්තු වෙදෙහිපුත්තො ලච්ඡති ඔතාරං, ලච්ඡති ආරම්මණං."
            },
            {
                "type": "paragraph",
                "text": "කලිඞ්ගරූපධානා භික්ඛවෙ, එතරහි භික්ඛු විහරන්ති අප්පමත්තා ආතාපිනො පධානස්මිං. තෙසං මාරො පාපිමා න ලභති ඔතාරං, න ලභති ආරම්මණං. භවිස්සන්ති භික්ඛවෙ, අනාගතමද්ධානං භික්ඛූ සුඛුමාලා මුදුතලුණහත්ථපාදා. තෙ මුදුකාසු සෙය්යාසු තූලබිම්බොහනාදිසු යාව සූරියුග්ගමනා සෙය්යං කප්පෙස්සන්ති. තෙසං මාරො පාපිමා ලච්ඡති ඔතාරං, ලච්ඡති ආරම්මණං."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ භික්ඛවෙ, එවං සික්ඛිතබ්බං: “කලිඞ්ගරූපධානා විහරිස්සාම අප්පමත්තා ආතාපිනො පධානස්මි”න්ති.{1 පධානස්මිං - සීමු.} එවං හි වො භික්ඛවෙ, සික්ඛිතබ්බන්ති."
            },
            {
                "type": "centered",
                "text": "8. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නාගසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "391. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන අඤ්ඤතරො නවො භික්ඛු අතිවෙලං කුලානි උපසඞ්කමති. තමෙනං භික්ඛූ එවමාහංසු: “මා ආයස්මා අතිවෙලං කුලානි උපසඞ්කමී”ති. සො භික්ඛූහි වුච්චමානො එවමාහ: “ඉමෙහි නාම ථෙරා භික්ඛූ කුලානි උපසඞ්කමිතබ්බං මඤ්ඤිස්සන්ති, කිමඞ්ගපනාහ”න්ති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො සම්බහුලා භික්ඛූ යෙන භගවා තෙනුපසඞ්කමිංසු. -පෙ- එකමන්තං නිසින්නා ඛො තෙ භික්ඛූ භගවන්තං එතදවොචුං: ඉධ භන්තෙ අඤ්ඤතරො නවො භික්ඛු අතිවෙලං කුලානි උපසඞ්කමති. තමෙනං භික්ඛූ එවමාහංසු: “මා ආයස්මා එවං අතිවෙලං කුලානි උපසඞ්කමී”ති. සො භික්ඛු භික්ඛූහි වුච්චමානො එවමාහ: “ඉමෙහි නාම ථෙරා භික්ඛූ කුලානි උපසඞ්කමිතබ්බං මඤ්ඤිස්සන්ති, කිමඞ්ගපනාහ”න්ති."
            },
            {
                "type": "page-break",
                "text": "416"
            },
            {
                "type": "paragraph",
                "text": "භූතපුබ්බං භික්ඛවෙ, අරඤ්ඤායතනෙ මහාසරසී. තං නාගා උපනිස්සාය විහරන්ති. තෙ තං සරසිං ඔගාහෙත්වා සොණ්ඩාය භිසමුලාලං අබ්භූග්ගහෙත්වා{1 අධොගහෙත්වා - සීමු. සී 1, 2. අබ්බුහෙත්වා - අට්ඨකථා, අබ්බාගහෙත්වා - මඡසං.} සුවික්ඛාලිතං වික්ඛාලෙත්වා අකද්දමං සඞ්ඛාදිත්වා{2 සංඛරිත්වා - PTS.} අජ්ඣොහරන්ති. තෙසං තං වණ්ණාය චෙව හොති බලාය ච. න ච තතොනිදානං මරණං වා නිගච්ඡන්ති මරණමත්තං වා දුක්ඛං."
            },
            {
                "type": "paragraph",
                "text": "තෙසඤ්ඤෙව ඛො පන භික්ඛවෙ, මහානාගානං අනුසික්ඛමානා තරුණා භිංකච්ඡාපා, තෙ තං සරසිං ඔගාහෙත්වා සොණ්ඩාය භිසමුලාලං අබ්බුග්ගහෙත්වා{3 අධොගහෙත්වා - සීමු. සී 1, 2. අබ්බුහෙත්වා - අට්ඨකථා, අබ්බාගහෙත්වා - මඡසං.} න සුවික්ඛාලිතං වික්ඛාලෙත්වා සකද්දමං අසඞ්ඛාදිත්වා අජ්ඣොහරන්ති. තෙසං තං නෙව වණ්ණාය හොති න බලාය. තතොනිදානං මරණං වා නිගච්ඡන්ති, මරණමත්තං වා දුක්ඛං."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො භික්ඛවෙ, ඉධ ථෙරා භික්ඛූ පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය ගාමං වා නිගමං වා පිණ්ඩාය පවිසන්ති. තෙ තත්ථ ධම්මං භාසන්ති. තෙසං ගිහී පසන්නාකාරං කරොන්ති. තෙ තං ලාභං අගථිතා අමුච්ඡිතා අනජ්ඣොපන්නං,{4 අනජ්ඣාපන්නං - සීමු. ස්යා.} ආදීනවදස්සාවිනො නිස්සරණපඤ්ඤා පරිභුඤ්ජන්ති. තෙසං තං වණ්ණාය චෙව හොති බලාය ච, න ච තතොනිදානං මරණං වා නිගච්ඡන්ති, මරණමත්තං වා දුක්ඛං."
            },
            {
                "type": "paragraph",
                "text": "තෙසඤ්ඤෙව ඛො පන භික්ඛවෙ, ථෙරානං භික්ඛූනං අනුසික්ඛමානා නවා භික්ඛූ පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය ගාමං වා නිගමං වා පිණ්ඩාය පවිසන්ති. තෙ තත්ථ ධම්මං භාසන්ති. තෙසං ගිහී පසන්නාකාරං කරොන්ති. තෙ තං ලාභං ගථිතා මුච්ඡිතා අජ්ඣොපන්නා අනාදීනවදස්සාවිනො අනිස්සරණපඤ්ඤා පරිභුඤ්ජන්ති. තෙසං තං නෙව වණ්ණාය හොති න බලාය. තෙ තතොනිදානං මරණං වා නිගච්ඡන්ති, මරණමත්තං වා දුක්ඛං."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ භික්ඛවෙ, එවං සික්ඛිතබ්බං: “අගථිතා අමුච්ඡිතා අනජ්ඣොපන්නා ආදීනවදස්සාවිනො නිස්සරණපඤ්ඤා ලාභං පරිභුඤ්ජිස්සාමා”ති. එවං හි වො භික්ඛවෙ, සික්ඛිතබ්බන්ති."
            },
            {
                "type": "centered",
                "text": "8. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "බිළාලසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "392. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "තෙන ඛො පන සමයෙන අඤ්ඤතරො භික්ඛු අතිවෙලං කුලෙසු චාරිත්තං ආපජ්ජති. තමෙනං භික්ඛූ එවමාහංසු: “මා ආයස්මා අතිවෙලං කුලෙසු චාරිත්තං ආපජ්ජී”ති. සො භික්ඛු භික්ඛූහි වුච්චමානො න රමති.{5 විරමති - මඡසං. PTS.}"
            },
            {
                "type": "page-break",
                "text": "418"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො සම්බහුලා භික්ඛූ -පෙ- භගවන්තං එතදවොචුං: “ඉධ භන්තෙ අඤ්ඤතරො භික්ඛු අතිවෙලං කුලෙසු චාරිත්තං ආපජ්ජති. තමෙනං භික්ඛූ එවමාහංසු: “මා ආයස්මා අතිවෙලං කුලෙසු චාරිත්තං ආපජ්ජී”ති. සො භික්ඛු භික්ඛූහි වුච්චමානො න රමතී”ති."
            },
            {
                "type": "paragraph",
                "text": "භූතපුබ්බං භික්ඛවෙ, බිළාලො{1 බිළාරො - ස්යා.} සන්ධිසමලසඞ්කටීරෙ{2 සඞ්කතීරෙ - ස්යා.} ඨිතො අහොසි මුදුමූසිං මගයමානො,{3 ආගමයමානො - ස්යා. මග්ගමානො - සීමු. මග්ගයමානො - මඡසං. PTS.} “යදායං මුදුමූසී ගොචරාය පක්කමිස්සති, තත්ථෙව නං ගහෙත්වා ඛාදිස්සාමී”ති. අථ ඛො භික්ඛවෙ, මුදුමූසී ගොචරාය පක්කමි. තමෙනං බිළාලො ගහෙත්වා සහසා අසංඛාදිත්වා{4 සංඛාදිත්වා - සීමු. මඡසං. මංසංඛාදිත්වා - ස්යා. සංඛාරිත්වා - PTS.} අජ්ඣොහරි. තස්ස සො මුදුමූසී අන්තම්පි ඛාදි, අන්තගුණම්පි ඛාදි. සො තතො නිදානං මරණම්පි නිගච්ඡි, මරණමත්තම්පි දුක්ඛං."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො භික්ඛවෙ, ඉධෙකච්චො භික්ඛු පුබ්බණ්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය ගාමං වා නිගමං වා පිණ්ඩාය පවිසති, අරක්ඛිතෙනෙව කායෙන අරක්ඛිතාය වාචාය අරක්ඛිතෙන චිත්තෙන අනුපට්ඨිතාය සතියා අසංවුතෙහි ඉන්ද්රියෙහි."
            },
            {
                "type": "paragraph",
                "text": "සො තත්ථ පස්සති මාතුගාමං දුන්නිවත්ථං වා දුප්පාරුතං වා. තස්ස මාතුගාමං දිස්වා දුන්නිවත්ථං වා දුප්පාරුතං වා රාගො චිත්තං අනුද්ධංසෙති. සො රාගානුද්ධංසෙන චිත්තෙන මරණං වා නිගච්ඡති, මරණමත්තං වා දුක්ඛං. මරණං හෙතං භික්ඛවෙ, අරියස්ස විනයෙ යො සික්ඛං පච්චක්ඛාය හීනායාවත්තති. මරණමත්තං හෙතං භික්ඛවෙ, දුක්ඛං යදිදං අඤ්ඤතරං සඞ්කිලිට්ඨං ආපත්තිං ආපජ්ජති. යථාරූපාය ආපත්තියා වුට්ඨානං පඤ්ඤායති."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ භික්ඛවෙ, එවං සික්ඛිතබ්බං: “රක්ඛිතෙනෙව කායෙන රක්ඛිතාය වාචාය රක්ඛිතෙන චිත්තෙන උපට්ඨිතාය සතියා සංවුතෙහි ඉන්ද්රියෙහි ගාමං වා නිගමං වා පිණ්ඩාය පවිසිස්සාමා”ති. එවං හි වො භික්ඛවෙ, සික්ඛිතබ්බන්ති."
            },
            {
                "type": "centered",
                "text": "8. 1. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සිගාලසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "393. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "අස්සුත්ථ නො තුම්හෙ භික්ඛවෙ, රත්තියා පච්චූසසමයං සිගාලස්ස වස්සමානස්සාති?{5 වසමානස්සාති - සීමු. ස්යා.} එවං භන්තෙ. එසො ඛො භික්ඛවෙ, ජරසිගාලො උක්කණ්ටකෙන{6 උක්කණ්ඩකෙන - මඡසං. උක්කණ්ණකෙන - සීමු. සී 1, 2. PTS.} නාම රොගජාතෙන ඵුට්ඨො. සො යෙන යෙන ඉච්ඡති, තෙන තෙන ගච්ඡති. යත්ථ යත්ථ ඉච්ඡති, තත්ථ තත්ථ තිට්ඨති. යත්ථ යත්ථ ඉච්ඡති, තත්ථ තත්ථ නිසීදති. යත්ථ යත්ථ ඉච්ඡති, තත්ථ තත්ථ නිපජ්ජති. සීතකොපි නං වාතො උපවායති. සාධු ඛ්වස්ස භික්ඛවෙ, යං ඉධෙකච්චො සක්යපුත්තියපටිඤ්ඤො එවරූපම්පි අත්තභාවපටිලාභං පටිසංවෙදයෙථ."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ භික්ඛවෙ, එවං සික්ඛිතබ්බං: “අප්පමත්තා විහරිස්සාමා”ති. එවං හි වො භික්ඛවෙ, සික්ඛිතබ්බන්ති."
            },
            {
                "type": "page-break",
                "text": "420"
            },
            {
                "type": "centered",
                "text": "8. 1. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතියසිගාලසුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "394. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "අස්සුත්ථ නො තුම්හෙ භික්ඛවෙ, රත්තියා පච්චූසසමයං සිගාලස්ස වස්සමානස්සාති? එවං භන්තෙ. සියා ඛො භික්ඛවෙ, තස්මිං ජරසිගාලෙ යා කාචි කතඤ්ඤුතා කතවෙදිතා. න ත්වෙව ඉධෙකච්චෙ සක්යපුත්තියපටිඤ්ඤෙ සියා කාචි කතඤ්ඤුතා කතවෙදිතා."
            },
            {
                "type": "paragraph",
                "text": "තස්මාතිහ භික්ඛවෙ, එවං සික්ඛිතබ්බං: “කතඤ්ඤුනො භවිස්සාම කතවෙදිනො. අම්හෙසු අප්පකම්පි කතං මා නස්සිස්සතී”ති{1 න ච නො අම්හෙසු අප්පකම්පි කතං තස්සිස්සතීති - මඡසං.}. එවං හි වො භික්ඛවෙ, සික්ඛිතබ්බන්ති."
            },
            {
                "type": "centered",
                "text": "වග්ගො පඨමො",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තස්සුද්දානං :**"
            },
            {
                "type": "gatha",
                "text": "කූටං නඛසිඛං කුලං ඔක්ඛා සත්ති ධනුග්ගහො,\nආණි කලිඞ්ගරො නාගො බිළාලො ද්වෙ සිගාලකාති."
            },
            {
                "type": "centered",
                "text": "ඔපම්මසංයුත්තං සමත්තං.",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ],
        "pages": {
            "406": {
                "pageNum": 406,
                "footnotesCount": 4
            },
            "408": {
                "pageNum": 408,
                "footnotesCount": 2
            },
            "410": {
                "pageNum": 410,
                "footnotesCount": 5
            },
            "412": {
                "pageNum": 412,
                "footnotesCount": 6
            },
            "414": {
                "pageNum": 414,
                "footnotesCount": 1
            },
            "416": {
                "pageNum": 416,
                "footnotesCount": 5
            },
            "418": {
                "pageNum": 418,
                "footnotesCount": 6
            },
            "420": {
                "pageNum": 420,
                "footnotesCount": 1
            }
        }
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "407"
            },
            {
                "format": 4,
                "text": "8. ඔපම්ම සංයුක්තය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. ප්‍රථම වර්ගය",
                "level": 2
            },
            {
                "type": "centered",
                "text": "8. 1. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කූට සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "383. මා විසින් මෙසේ අසන ලදි: එක්කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයහි ජේතවන නම් අනේපිඬු සිටුහුගේ අරම්හි වැඩ වසන සේක. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එහි දී භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: මහණෙනි, යම් සේ කුළුගෙයක හැම ගොනැස්හු ම කූටයෙහි (කැණිමඩලෙහි) පිවිසියාහු කූටයෙහි මුළුදුන්නාහු ද කූටය බිඳීමෙන් ඒ හැම විනාශයට යෙත් ද, මහණෙනි, එසෙයින් ම යම් කිසි අකුසල්මුල් කෙනෙක් වෙත් ද, ඒ හැම අවිද්‍යාවෙහි පිවිසියාහු අවිද්‍යාවෙහි මුළුදුන්නාහු වෙත්. අවිද්‍යාව නැසීමෙන් ඒ සියලු අකුශලමූලයෝ විනාශයට යෙති.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එහෙයින් මහණෙනි, තොප විසින් මෙසේ හික්මිය යුතු. “අප්‍රමත්ත ව වසන්නමෝ ”යි. මහණෙනි, තොප විසින් මෙසේ හික්මිය යුතු මැයි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නඛසිඛා සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "384. **සැවැත්නුවර-**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකල්හි භාග්‍යවතුන් වහන්සේ නියසිළෙහි පස් බුඳක් නගා භික්ෂූන් ඇමතූ සේක. “මහණෙනි, ඒ කිමැයි හගිවු ද? කිමෙක් ඉබොහෝ ද? මා විසින් නියසිළෙහි නගන ලද මේ පස් බිඳ ද, නොහොත් මේ මහ පොළොව දැ”යි. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, යම් මේ මහපොළවක් වේ ද, එය ම ඉබොහෝ ය. භාග්‍යවතුන් වහන්සේ විසින් නියසිළෙහි නගන ලද මේ පස්බුඳ ස්වල්ප ය. භාග්‍යවතුන් වහන්සේ විසින් නියසිළෙහි නගන ලද මේ පස්බුඳ මහපොළොව හා සැසඳීමෙහි දී ගණනකට ද නො පැමිණේ. උපමාවට ද නො පැමිණේ. සොළොස්වැනි කලාවෙන් කලාවට ද නො පැමිණේ. මහණෙනි, එසෙයින් ම යම් කෙනෙක් මිනිසුන් කෙරෙහි උපදිද්ද, ඒ සත්ත්වයෝ ඉතා අල්පය. වැලි යම් කෙනෙක් මිනිස්ලොවින් අන් තන්හි උපදිත් ද, මේ සත්ත්වයෝ ම ඉතා බොහෝය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එහෙයින් මහණෙනි, තොප විසින් මෙසේ හික්මිය යුතු. “නො පමා ව වෙසෙන්නමෝ”යි. මහණෙනි, තොප විසින් මෙසේ හික්මිය යුතු මැයි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "409"
            },
            {
                "type": "centered",
                "text": "8. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කුල සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "385** සැවැත්නුවර-**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යම් සේ බොහෝ ස්ත්‍රීන් ඇති අල්ප පුරුෂයන් ඇති යම් කිසි කුලයෝ වෙද්ද, ඔහු කළයෙහි සැඟවූ පහන් එළියෙන් සොරකම් කරණ කුඹු සොරුන් විසින් සුවසේ වෙහෙසිය හැක්කාහු වෙති. මහණෙනි, එසෙයින් ම යම් කිසි මහණකු විසින් මෙත්තාවේතොවිමුත්තිය (මෛත්‍රීධ්‍යානය) නො වඩන ලද ද, බහුල නො කරණ ලද ද, හෙතෙමේ අමනුෂ්‍යයන් විසින් සුවසේ වෙහෙසිය හෙන්නේ වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යම් සේ අල්ප ස්ත්‍රීන් ඇති බොහෝ පුරුෂයන් ඇති යම් කිසි කුලයෝ වෙද්ද, ඔහු කුඹු සොරුන් විසින් නො වෙහෙසිය හෙන්නාහු වෙති. මහණෙනි, එසෙයින් ම යම් කිසි මහණකු විසින් මෙත්තාවේතොවිමුත්තිය වඩන ලද ද, බහුල කරණ ලද ද, හෙතෙමේ අමනුෂ්‍යයන් විසින් නො වෙහෙසිය හෙන්නේ වෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එහෙයින් මෙහි මෙසේ හික්මිය යුතු: “අප විසින් මෙත්තා වේතොවිමුත්තිය වඩන ලද්දී බහුල කරණ ලද්දී යුක්ත යානයක් මෙන් කරණ ලද්දී ප්‍රතිෂ්ඨාර්ථයෙන් වාස්තුවක් මෙන් කරණ ලද්දී එළඹ සිටියක් කරණ ලද්දී පුරුදු කරණ ලද්දී මැනවින් පිරිපුන් කරණ ලද්දී වන්නී ය” යි මහණෙනි, තොප විසින් මෙසේ හික්මිය යුතු මැයි. ",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඔක්‌ඛාසත සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "386. **සැවැත්නුවර - **",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යමෙක් පෙරවරු මහබත් සැළි සීයක් දන් දෙන්නේ ද, යමෙක් මද්දහනෙහි මහබත් සැළි සීයක් දන් දෙන්නේ ද, යමෙක් සවස් කල මහබත් සැළි සීයක් දන් දෙන්නේ ද, යමෙක් පෙරවරු යටත් පිරිසෙයින් ගෝදෝනා (දෙනගේ තනපුඬු එක් වරක් අදනා) කල් පමණකුදු මෙත් සිත වඩන්නේ ද, යමෙකුත් මද්දහනෙහි යටත් පිරිසෙයින් ගෝදෝනා කල් පමණකුදු මෙත් සිත වඩන්නේ ද, යමෙක් සවස් වරු යටත් පිරිසෙයින් ගෝදෝනා කල් පමණකුදු මෙත් සිත වඩන්නේ ද, මෙය ඒ දනට වඩා මහත්ඵල ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එහෙයින් මෙහි මෙසේ හික්මිය යුතු: “අප විසින් මෙත්තාවේතොවිමුත්තිය වඩන ලද්දී බහුල කරණ ලද්දී යානයක් මෙන් කරණ ලද්දී වාස්තුවක් මෙන් කරණ ලද්දී එළඹ සිටියක් කරණ ලද්දී පුරුදු කරණ ලද්දී මැනවින් පිරිපුන් කරණ ලද්දී වන්නී ය” යි. මහණෙනි, තොප විසින් මෙසේ හික්මිය යුතු මැයි. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "411"
            },
            {
                "type": "centered",
                "text": "8. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සත්‌ති සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "387. **සැවැත්නුවර - **",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යම් සේ තියුණු තල ඇති සිරියක් වේ ද, එකල්හි “මම තියුණු තල ඇති මේ සිරිය අතින් හෝ මිටෙන් හෝ පැහැර නමන්නෙමි. (ධාරා දෙක එක් කොට) අලවන්නෙමි. දිග හැර නැවත හකුළුවන්නෙමි” යි පුරුෂයෙක් එන්නේ ය. මහණෙනි, ඒ කිමැයි හගිවූ ද, ඒ පුරුෂ තෙමේ තියුණු තල ඇති මේ සිරිය අතින් හෝ මිටෙන් හෝ නමන්නට අලවන්නට දිග හැර නැවත හකුළුවන්නට නිසි ද? වහන්ස, මෙය නො වේ ම ය. ඒ කවර හෙයින්ද? වහන්ස, තියුණු තල ඇති ඒ සිරිය අතින් හෝ මිටෙන් හෝ නමන්නට අලවන්නට දිග හැර නැවත හකුළුවන්නට සුකර නො වේ. ඒ පුරුෂ තෙමේ (ඒ සඳහා යම්තාක් වැර වඩා ද,) ඒ තාක් ම වෙහෙසීමට විඩාවට හිමියෙක් වන්නේ ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එහෙයින් ම යම් කිසි මහනකු විසින් මෙත්තා වේතොවිමුත්තිය වඩන ලද ද, බහුල කරණ ලද ද, යානයක් මෙන් කරණ ලද ද, වාස්තුවක් මෙන් කරණ ලද ද, එළඹ සිටියක් කරණ ලද ද, පුරුදු කරණ ලද ද, මැනවින් පිරිපුන් කරණ ලද ද, ඉදින් අමනුෂ්‍යයෙක් ඔහුගේ සිත පෙරලිය යුතු ය යි හඟනේ නම් වැලි ඒ අමනුෂ්‍ය තෙමේ වෙහෙසීමට විඩාවට හිමියෙක් වන්නේ ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එහෙයින් මෙහි මෙසේ හික්මිය යුතු: “අප විසින් මෙත්තා වේතොවිමුත්තිය වඩන ලද්දී බහුල කරණ ලද්දී යානයක් මෙන් කරණ ලද්දී වාස්තුවක් මෙන් කරණ ලද්දී එළඹ සිටියක් කරණ ලද්දී පුරුදු කරණ ලද්දී මැනවින් පිරිපුන් කරණ ලද්දී වන්නී ය” යි. මහණෙනි, තොප විසින් මෙසේ හික්මිය යුතු මැයි. ",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ධනුග්‌ගහ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "388. **සැවැත්නුවර - **",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යම් සේ දැඩි දුනු දරණ නිපුණ වූ කෘතහස්ත වූ දැක්වූ ධනුශ්ශිල්ප ඇති දුනුවායෝ සිවුදෙනෙක් සිවුදිග සිටියෝ ද, එකල්හි දැඩි දුනු ඇති නිපුණ වූ කෘතහස්ත වූ දැක් වූ ධනුශ්ශිල්ප ඇති මේ සිවු දුනුවායන් විසින් සිවුදිගට විදින ලද ඊතල පොළොවෙහි නො පිහිටියවුන්ම (පොළොව නොහෙන තෙක්ම) මම හැර ගෙණ එන්නෙමි”යි. පුරුෂයෙක් එන්නේ ය. මහණෙනි, ඒ කිමැයි හගිවූ ද, “එසේ දිවිය හෙන්නා වූ මේ පුරුෂ තෙම උතුම් ජව ඇත්තේ ය යි - දිවිය හෙන්නේ ය යි කියන්නට සුදුසු දැ”යි:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, දැඩි දුනු දරණ උගත් පළපුරුදු දැක්වූ සිප් ඇති එක් දුනුවායකු විසිනුදු විදිනලද හීය පොළොව නො හෙන තෙක් ම ඉදින් හැර ගෙණ එන්නේ නම් එසේ දිවිය හෙන පුරුෂයා උතුම් ජව ඇත්තේ ය යි කියන්නට සුදුසු ය. දැඩි දුනු දරණ උගත් කළපුරුදු දැක්වූ සිප් ඇති එක් දුනුවායන් සිවුදෙනෙකුන් විදි හී ගැණ කවර කථා ද?",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "413"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ඒ පුරුෂයාගේ වෙගය යම්බඳු ද, සඳහිරු දෙදෙනාගේ යම්බඳු වෙගයෙක් වේ නම් (එය) ඊට වඩා ශීඝ්‍ර ය. මහණෙනි, ඒ පුරුෂයාගේ වෙගය යම් බඳු ද, සඳහිරු දෙදෙනාගේ වේගය, යම් බඳු ද, යම් දේවතා කෙනෙක් සඳහිරු දෙදෙනාට පෙරටු ව යම් සේ දිවෙත් නම් ඒ දේවතාවන්ගේ වේගය එයට වඩා ශීඝ්‍රය. ඒ පුරුෂයාගේ වේගය යම් බඳු ද, සඳහිරු දෙදෙනාගේ වේගය යම් බඳු ද, යම් දේවතා කෙනෙක් සඳහිරු දෙදෙනාට පෙරටු ව දිවෙත් නම් ඒ දේවතාවන්ගේ වේගය යම් බඳු ද, ඊට වඩා ශීඝ්‍රව ආයුසංස්කාරයෝ (රූප ජිවිතින්ද්‍රියයෝ) ක්ෂය වෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එහෙයින් මෙහි මෙසේ හික්මිය යුතු: “නො පමා ව වෙසෙන්නෙමු ”යි. මහණෙනි, තොප විසින් මෙසේ හික්මිය යුතු මැ යි. ",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආණි සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "389. **සැවැත්නුවර - **",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, පෙර වූවක් කියමි: (අස්වැන්නෙන් දශයෙන් කොටසක් ගන්නා බැවින්) දසාරහ (නම් වූ) ක්ෂත්‍රියන්ගේ ආණක නම් මිහිඟු බෙරයෙක් විය. දසාරහයෝ ඒ අණබෙරය පැළුනු කල්හි ඊට අන් ඇණයක් ගැසූහ. මහණෙනි, යම් කලෙක්හි ආණක මිහිඟුබෙරයේ පැරණි බෙරකඳ අතුරුදන් වී ද, ඇණහැකිල්ල ම ඉතිරි වීද, එබඳු කලෙක් වූයේ ම ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එහෙයින් ම මතුකාලයෙහි භික්ෂූහු වන්නාහ. (ඔහු) තථාගතයන් වහන්සේ විසින් වදාරණ ලද ගැඹුරු වූ ගැඹුරු අරුත් ඇති ලොවුතුරා අරුත් දක්වන ශුන්‍යතාධර්මය පවසන යම් ඒ සූත්‍රාන්ත කෙනෙක් වෙද්ද, ඔවුන් දේශනා කරණු ලබන කල්හි අසනු කැමති නො වන්නාහ. කන් යොමු නො කරන්නාහ. අවබෝධය පිණිස සිත නො එළවන්නාහ. ඒ දහම් උගත යුතු ය යි පිරිවැහිය යුතු ය යි නොසිතන්නාහ. කවීන් විසින් කරණ ලද කවීන් විසින් නිපදවන ලද විසිතුරු ව්‍යඤ්ජන ඇති සස්නෙන් පිටත්හි වූ (අන්) සව්වන් විසින් දෙසන ලද යම් ඒ සූත්‍රාන්ත කෙනක් වෙද්ද, ඔවුන් කියනු ලබන කල්හි අසනු කැමති වන්නාහ. කන් යොමු කරන්නාහ. අවබෝධය පිණිස සිත එළවන්නාහ. ඒ දහම් උගත යුතු ය යි ද පිරිවැහිය යුතු ය යි ද හඟින්නාහ. මහණෙනි, මෙසේ තථාගතයන් වහන්සේ විසින් වදාරණ ලද ගැඹුරු අරුත් ඇති ලොවුතුරා අරුත් දැක්වෙන ශුන්‍යතා ධර්මය පැවසෙන සූත්‍රාන්තයන්ගේ අතුරුදහන් වීම වන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එහෙයින් මෙහි මෙසේ හික්මිය යුතු: “තථාගතයන් වහන්සේ විසින් වදාරණ ලද ගැඹුරු වූ අරුත් ඇති ලොවුතුරා අරුත් දැක්වෙන ශුන්‍යතා ධර්මය පැවසෙන යම් ඒ සූත්‍රාන්ත කෙනෙක් වෙද්ද, ඔවුන් දේශනා කරණු ලබන කල්හි අසනු කැමති වන්නෙමු. කන් යොමු කරන්නෙමු. අවබෝධය පිණිස සිත එළවන්නෙමු. ඒ දහම් ම උගත යුතුය යි, පිරිවැහිය යුතු ය යි සිතන්නෙමු”යි. මහණෙනි, තොප විසින් මෙසේ හික්මිය යුතු මැ යි. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "415"
            },
            {
                "type": "centered",
                "text": "8.1.8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කලිඞ්‌ගරූපධාන සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "390. මා විසින් මෙසේ අසන ලදි: එක්කලෙක භාග්‍යවතුන් වහන්සේ විසල්පුර මහාවනයෙහි කුටගාරශාලාවෙහි වැඩ වසන සේක. එහි දී … මෙය වදාළ සේක.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, දැන් ලිච්ඡවීහු ලීකොටයක් කන්වයින් කොට ඇත්තාහු අප්‍රමත්තව වීර්ය්‍ය ඇති ව ගුරූපාසනයෙහි (ශිල්ප හැදෑරීමෙහි) යෙදුනාහු වාසය කෙරෙති. මගධාධිපති වේදේහි පුත් අජාසත් රජ තෙමේ ඔවුන්ගේ සිදුරක් නො ලබයි. අරමුණක් (ප්‍රත්‍යයයක්) නො ලබයි. මහණෙනි, අනාගත කාලයෙහි ලිච්ඡවීහු සියුමැලි වූවෝ මුදුතුරුණු අත් පා ඇත්තෝ වන්නාහ. ඔහු පුලුන් කන්වයින් (=කොට්ට) ඇති මුදු යහන්හි හිරු උදා වන තෙක් ශයනය කරන්නාහ. මගධාධිපතී වේදේහි පුත් අජාසත් රජ තෙමේ (ඔවුන් දිනුමට) ඔවුන්ගේ සිදුරක් ලබන්නේ ය. අරමුණක් ලබන්නේ ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, දැන් භික්ෂූහු ලීකොට කන්වයින් කොට ඇත්තාහු අප්‍රමත්ත ව කෙලෙස් තවන වැර ඇති ව ප්‍රධන්විර්ය්‍යයෙහි යෙදුනාහු වාසය කෙරෙත්. පවිටු මරු තෙමේ ඔවුන්ගේ සිදුරක් නො ලබයි. අරමුණක් නො ලබයි. මහණෙනි, අනාගත කාලයෙහි භික්ෂූහු සියුමැලි වූවෝ මුදුතුරුණු අත් පා ඇත්තෝ වන්නාහ. ඔහු පුලුන් කන්වයින් ඇති මුදු යහන්හි හිරු උදාවන තෙක් ශයනය කරන්නාහ. පවිටු මරු තෙමේ ඔවුන්ගේ සිදුරක් (අවකාශයක්) ලබන්නේ ය. අරමුණක් ලබන්නේ ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එහෙයින් මෙහි මෙසේ හික්මිය යුතු: “දැව කඩක් කන්වයින් කොට ඇත්තමෝ අප්‍රමත්ත ව කෙළෙස් තවන වැර ඇති ව ප්‍රධන්විර්ය්‍යයෙහි යෙදුනමෝ වාසය කරන්නෙමු”යි. මහණෙනි, තොප විසින් මෙසේ හික්මිය යුතු මැ යි. ",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නාග සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "391. **සැවැත්නුවර - **",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකල්හි එක්තරා නවක මහණෙක් වෙලාව ඉක්මවා කුලයන් කරා එළඹෙයි. භික්ෂූහු ඒ මේ මහණහට “ආයුෂ්මතුනි, වෙලාව ඉක්මවා කුලයන් කරා නො එළඹෙව”යි මෙසේ කීහ. ඒ මහණ තෙමේ භික්‍ෂූන් විසින් කියනු ලබන්නේ “මේ ස්ථවිර භික්ෂූහු කුලයන් කරා එළඹිය යුතු කොට හගිත්. කවර හෙයකින් මම නො එළඹෙම් දැ”යි මෙසේ කී ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේ කරා එළඹියහ ... එකත්පසෙක හුන් ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට “වහන්ස, මෙහි එක්තරා නවක මහණෙක් වෙලාව ඉක්මවා කුලයන් වෙත එළඹෙයි. ඒ මේ මහණහට භික්ෂූහු “ආයුෂ්මතුනි, මෙසේ වෙලාව ඉක්මවා කුලයන් කරා නො එළඹෙව”යි කීහ. ඒ මහණ තෙමේ භික්ෂූන් විසින් කියනු ලබන්නේ “මේ ස්ථවිර භික්ෂූහු කුලයන් කරා එළඹිය යුතු කොට හගිති. කවර හෙයෙකින් මම නො එළඹෙම් දැ යි මෙසේ කී ය” යි මෙය සැලකළහ. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "417"
            },
            {
                "format": 13,
                "text": "මහණෙනි, පෙර වූවක් කියමි: “වන පෙදෙසක මහවිලෙක් විය. ඇත්තු ඒ විල ඇසුරු කොට වෙසෙති. ඔහු ඒ විලට බැස සොඬින් නෙලුඹල හා නෙලුඹුදැලි උදුරා ගෙණ සුපිරිසිදු ව සෝදා මඩ රහිතව සපා ගිලිත්. එය ඔවුන්ගේ වර්ණය පිණිස ද බලය පිණිස ද වේ. ඒ හේතුවෙන් මරණයට හෝ මරණය හා සම දුකකට හෝ නො පැමිණෙති. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ඒ මහා ඇතුන් අනුව හික්මෙන්නා වු තරුණ ඇත්පැටව් වෙත්. ඔහු ඒ විලට බැස සොඬින් නෙලුඹල හා නෙලුඹුදැලි උදුරා ගෙණ පිරිසිදු ව නො සෝදා මඩ සහිතව නො සපා ගිලිත්. එය ඔවුන්ගේ වර්ණය පිණිස නො වේ ම ය. බලය පිණිස ද නො වේ ම ය. ඒ හේතුවෙන් මරණයට හෝ මරණය හා සම දුකට හෝ පැමිණෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එපරිද්දෙන් ම මෙසස්නෙහි ස්ථවිරභික්ෂූහු පෙරවරු කාලයෙහි හැඳ පෙරව පාසිවුරු ගෙණ ගමට හෝ නියම්ගමට හෝ පිඬු පිණිස පිවිසෙත්. ඔහු එහි දී දහම් දෙසත්. ගිහියෝ ඔවුනට පහන් අයුරක් කෙරෙත්.(ප්‍රත්‍ය දෙත්.) ඔහු නො ගිජු වූවාහු මුසපත් නො වූවාහු තෘෂ්ණාවෙන් නො ගැලී සිටියාහු දොස් දක්නාසුලු වූවාහු සසරින් නික්ම යෑමේ නුවණින් යුක්ත වූවාහු ඒ ලාබය පරිභෝග කෙරෙත්. එය ඔවුන්ගේ වර්ණය පිණිස ද බලය පිණිස ද වේ. ඒ හේතුවෙන් මරණයට හෝ මරණය හා සම දුකට හෝ නො පැමිණෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඒ ස්ථවිර භික්ෂූන් අනුව ම හික්මෙන්නා වූ නවක භික්ෂූහු තුමු පෙරවරු කාලයෙහි හැඳ පෙරව පාසිවුරු ගෙණ ගමකට හෝ නියම්ගමකට හෝ පිඬු පිණිස පිවිසෙත්. ඔහු එහි දහම් දෙසත්. ගිහියෝ ඔවුනට පහන් අයුරක් කෙරෙත් (ප්‍රත්‍යය දෙත්.) ඔහු ගිජු වූවාහු මුසපත් වූවාහු තෘෂ්ණාවෙන් ගැලුනාහු දොස් නො දක්නාසුලු වූවාහු නික්ම යෑමේ නුවණ නැත්තාහු ඒ ලාභය වළඳත්. එය ඔවුන්ගේ වර්ණය පිණිස නො ම වේ. බලය පිණිස ද නො ම වේ. ඔහු ඒ හේතුවෙන් මරණයට හෝ මරණය හා සම දුකට හෝ පැමිණෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එහෙයින් මෙහි මෙසේ හික්මිය යුතු: “නො ගිජු වූවමෝ මුසපත් නුවූවමෝ තෘෂ්ණාවෙහි නො ගැලුනමෝ දොස් දක්නමෝ නිස්සරණ ප්‍රඥා ඇත්තමෝ ලාභය වළඳන්නෙමු”යි. මහණෙනි, තොප විසින් මෙසේ හික්මිය යුතු මැ යි. ",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "බිළාල සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "392.** සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "එකල්හි එක්තරා මහණෙක් වෙලාව ඉක්මවා කුලයන්හි හැසිරීමට පැමිණෙයි. භික්ෂූහු ඒ මොහුට “ආයුෂ්මත්නි, වෙලාව ඉක්මවා කුලයන්හි හැසිරීමට නො පැමිණෙව”යි මෙසේ කීහ. භික්‍ෂූන් විසින් කියනු ලබන ඒ මහණ තෙමේ නො ඇලෙයි. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "419"
            },
            {
                "format": 13,
                "text": "එකල්හි බොහෝ භික්ෂූහු ... භාග්‍යවතුන් වහන්සේට “වහන්ස, මෙහි එක්තර මහණෙක් වෙලාව ඉක්මවා කුලයන්හි හැසිරීමට පැමිණෙයි. භික්ෂූහු ඔහුට ආයුෂ්මතුනි “වෙලාව ඉක්මවා කුලයන්හි හැසිරීමට නහමක් පැමිණෙව”යි මෙසේ කීහ. ඒ මහණ තෙමේ භික්ෂූන් විසින් කියනු ලබන්නේ නො ඇලේ ය”යි මෙය සැළකළහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, පෙර වූවක් කියමි: බළලෙක් ගෘහසන්ධියෙහි (දෙගෙයක් අතර) හෝ මලවහන දියැලක හෝ කසළගොඩක හෝ “යම් කලෙක මේ මෘදු මූෂිකාව ගොදුරු පිණිස යන්නේ ද, එහි දී ම ඌ ගෙණ කන්නෙමි”යි මුදුමීයකු සොයමින් සිටියේ විය. මහණෙනි, එකල්හි ඒ මුදු මීයා ගොදුරු පිණිස නික්මුනේ ය. බළලා ඒ මූ ගෙණ නො සපා වහා ගැලපී ය. ඒ මුදු මීයා ඒ බළලාගේ අතුනු ද කෑ ය. අතුනුබහන් ද කෑ ය ඒ හේතුවෙන් ඒ බළලා මරණයට හෝ මරණය හා සම දුකට හෝ පැමිණියේ ය. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එසෙයින් ම මෙහි ඇතැම් මහණෙක් පෙරවරු හැඳ පෙරව පාසිවුරු ගෙණ නො රක්නා ලද්දාවූ ම කයින් නො රක්නා ලද වචනයෙන් නො රක්නා ලද සිතින් නො එළඹ සිටි සිහියෙන් සංවරණය නො කළ ඉඳුරන්ගෙන් යුතු ව ගමට හෝ නියම්ගමට හෝ පිඬු පිණිස පිවිසෙයි. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "හෙතෙමේ එහි දී නපුරු කොට හැන්දා වූ හෝ නපුරු කොට පෙරවූ හෝ මාගමක් දකී. නපුරු කොට හැන්දා වූ හෝ නපුරු කොට පෙරවූ හෝ මාගම දැකීමෙන් රාගය ඔහුගේ සිත වනසයි. හෙතෙමේ රාගයෙන් නැසුනු සිතින් මරණයට හෝ මරණය සම දුකකට හෝ පැමිණෙයි. මහණෙනි, යමෙක් සිකපිළිකෙව් කොට ගිහිබවට පෙරළේ ද, මේ සස්නෙහි මරණය යි. මහණෙනි, යම් බඳු ඇවතකින් නැගී සිටීමෙක් පෙණේ නම් (එබඳු) යම් කිලිටි වූ එක්තරා (උට්ඨානගාමිනී) ඇවතකට පැමිණේ ද, ඒ මරණය හා සම දුක ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එහෙයින් මෙසේ හික්මිය යුතු: “රක්නා ලද්දා වූ ම කයින් රක්නා ලද වචනයෙන් රක්නා ලද සිතින් එළඹ සිටි සිහියෙන් සංවෘත ඉඳුරන්ගෙන් යුතු ව ගමට හෝ නියම්ගමට හෝ පිඬු පිණිස පිවිසෙන්නෙමු”යි. මහණෙනි, තොප විසින් මෙසේ හික්මිය යුතු මැ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "8. 1. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සිගාල සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "393.** සැවැත්නුවර - **",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, තෙපි රෑ පැසුළුයම්හි හඬන සිවලකුගේ හඬ අසූහු ද? වහන්ස, එසේ ය. මහණෙනි, මේ ජරසිවල් තෙමේ උක්කණ්ටක නම් රෝගයෙන් පහස්නා ලද්දේ ය. හේ යම් යම් තැන කැමැත්තේ නම් ඒ ඒ තැන යෙයි. යම් යම් තැන කැමැත්තේ නම් ඒ ඒ තැන සිටී. යම් යම් තැන කැමැත්තේ නම් ඒ ඒ තැන හිඳී. යම් යම් තැන කැමැත්තේ නම් ඒ ඒ තැන හොවී. සිහිල් වාතය ද ඔහු වෙත හමයි. (හේ මෙයිනුදු චිත්තාස්වාදයක් ලබයි.) මහණෙනි, යම් හෙයකින් මෙහි ‘ශාක්‍ය පුත්‍රයෙමියි ප්‍රතිඥා ඇති ඇතැමෙක් මෙබඳු වූ අත්බැව් පිළිලැබීමක් (චිත්තාස්වාදයක්) විඳිනේ නම් එය යහපත් වන්නේ ය. (මෙය දෙව්දත් සඳහා කියූ.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එහෙයින් මෙසේ හික්මිය යුතු: “නො පමා ව වෙසෙන්නෙමු”යි. මහණෙනි, තොප විසින් මෙසේ හික්මිය යුතු මැ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "421"
            },
            {
                "type": "centered",
                "text": "8. 1. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය සිගාල සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "394. **සැවැත්නුවර - **",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, තෙපි රෑ පැසුළු යම හඬන සිවලෙකු හඬ අසූහු ද? වහන්ස, එසේ ය. මහණෙනි, ඒ ජරසිවලා කෙරෙහි ද යම් කිසි කළ ගුණ දන්නා බවෙක් කළ ගුණ ප්‍රකට කරණ බවෙක් වන්නේ ම ය. මෙහි ශක්‍යපුත්‍රිය භාවය පිළිණ කරණ ඇතමකු කෙරෙහි කිසි ම කළ ගුණ දන්නා බවෙක්, කල ගුණ ප්‍රකට කරණ බවෙක් නො වන්නේ ම ය. (මෙද දෙව්දත් සඳහා කියු සේ ය.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එහෙයින් මහණෙනි, මෙසේ හික්මිය යුතු: “කළ ගුණ දන්නමෝ කළ ගුණ ප්‍රකට කොට දන්නමෝ වන්නෙමු. අප කෙරෙහි මඳකුදු කරණ ලද්ද නහමක් නැසේවා (සිතින් තොර නොවේවා)”යි. මහණෙනි, තොප විසින් මෙසේ හික්මිය යුතු මැ යි.",
                "type": "paragraph"
            },
            {
                "format": 11,
                "text": "පළමුවන වර්ගය යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 20,
                "text": "**එහි උද්දානය:**",
                "type": "unindented"
            },
            {
                "format": 20,
                "text": "කූට, නඛසිඛා, කුල, ඔක්ඛා, සත්ති, ධනුග්ගහ, ආණි, කලිඞ්ගර, නාග, බිළාල සූත්‍ර ය, සිගාල සූත්‍ර දෙක දැ යි සූත්‍ර දොළසෙකි යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "ඔපම්මසංයුත්තය නිමියේ යි.",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ]
    }
]