[
    {
        "filename": "sn-ndnv-2",
        "bookId": 17,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "222"
            },
            {
                "type": "heading",
                "text": "2. ධාතුසංයුත්තං",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. නානත්තවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "2. 1. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ධාතුනානත්තසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "225. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුනානත්තං වො භික්ඛවෙ දෙසිස්සාමි,{1 දෙසෙස්සාමි - මඡසං.} තං සුණාථ සාධුකං මනසි කරොථ භාසිස්සාමීති. එවං භන්තෙති ඛො තෙ භික්ඛූ භගවතො පච්චස්සොසුං, භගවා එතදවොච."
            },
            {
                "type": "paragraph",
                "text": "කතමඤ්ච භික්ඛවෙ ධාතුනානත්තං? චක්ඛුධාතු රූපධාතු චක්ඛුවිඤ්ඤාණධාතු, සොතධාතු සද්දධාතු සොතවිඤ්ඤාණධාතු, ඝානධාතු ගන්ධධාතු ඝානවිඤ්ඤාණධාතු, ජිව්හාධාතු රසධාතු ජිව්හාවිඤ්ඤාණධාතු, කායධාතු ඵොට්ඨබ්බධාතු කායවිඤ්ඤාණධාතු, මනොධාතු ධම්මධාතු මනොවිඤ්ඤාණධාතු. ඉදං වුච්චති භික්ඛවෙ ධාතුනානත්තන්ති."
            },
            {
                "type": "centered",
                "text": "2. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඵස්සනානත්තසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "226. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුනානත්තං භික්ඛවෙ පටිච්ච උප්පජ්ජති ඵස්සනානත්තං. කතමඤ්ච භික්ඛවෙ, ධාතුනානත්තං? චක්ඛුධාතු සොතධාතු ඝානධාතු ජිව්හාධාතු කායධාතු මනොධාතු. ඉදං වුච්චති භික්ඛවෙ ධාතුනානත්තං."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච{2 කතමඤ්ච - ස්යා.} භික්ඛවෙ, ධාතුනානත්තං පටිච්ච උප්පජ්ජති ඵස්සනානත්තං? චක්ඛුධාතුං භික්ඛවෙ, පටිච්ච උප්පජ්ජති චක්ඛුසම්ඵස්සො. සොතධාතුං පටිච්ච උප්පජ්ජති සොතසම්ඵස්සො, ඝාණධාතුං පටිච්ච උප්පජ්ජති ඝාණසම්ඵස්සො, ජිව්හාධාතුං පටිච්ච උප්පජ්ජති ජිව්හාසම්ඵස්සො, කායධාතුං පටිච්ච උප්පජ්ජති කායසම්ඵස්සො, මනොධාතුං පටිච්ච උප්පජ්ජති මනොසම්ඵස්සො. එවං ඛො භික්ඛවෙ, ධාතුනානත්තං පටිච්ච උප්පජ්ජති ඵස්සනානත්තන්ති."
            },
            {
                "type": "centered",
                "text": "2. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නො ඵස්සනානත්තසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "227. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුනානත්තං භික්ඛවෙ, පටිච්ච උප්පජ්ජති ඵස්සනානත්තං, නො ඵස්සනානත්තං පටිච්ච උප්පජ්ජති ධාතුනානත්තං."
            },
            {
                "type": "paragraph",
                "text": "කතමඤ්ච භික්ඛවෙ, ධාතුනානත්තං? චක්ඛුධාතු -පෙ- මනොධාතු. ඉදං වුච්චති භික්ඛවෙ ධාතුනානත්තං."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ, ධාතුනානත්තං පටිච්ච උප්පජ්ජති ඵස්සනානත්තං, නො ඵස්සනානත්තං පටිච්ච උප්පජ්ජති ධාතුනානත්තං? චක්ඛුධාතුං භික්ඛවෙ පටිච්ච උප්පජ්ජති චක්ඛුසම්ඵස්සො, නො චක්ඛුසම්ඵස්සං පටිච්ච උප්පජ්ජති චක්ඛුධාතු -පෙ- මනොධාතුං පටිච්ච උප්පජ්ජති මනොසම්ඵස්සො. නො මනොසම්ඵස්සං පටිච්ච උප්පජ්ජති මනොධාතු. එවං ඛො භික්ඛවෙ, ධාතුනානත්තං පටිච්ච උප්පජ්ජති ඵස්සනානත්තං. නො ඵස්සනානත්තං පටිච්ච උප්පජ්ජති ධාතුනානත්තන්ති."
            },
            {
                "type": "page-break",
                "text": "224"
            },
            {
                "type": "centered",
                "text": "2. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "වෙදනානානත්තසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "228. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුනානත්තං භික්ඛවෙ, පටිච්ච උප්පජ්ජති ඵස්සනානත්තං. ඵස්සනානත්තං පටිච්ච උප්පජ්ජති වෙදනානානත්තං."
            },
            {
                "type": "paragraph",
                "text": "කතමඤ්ච භික්ඛවෙ, ධාතුනානත්තං? චක්ඛුධාතු -පෙ- මනොධාතු ඉදං වුච්චති භික්ඛවෙ ධාතුනානත්තං."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ, ධාතුනානත්තං පටිච්ච උප්පජ්ජති ඵස්සනානත්තං, ඵස්සනානත්තං පටිච්ච උප්පජ්ජති වෙදනානානත්තං? චක්ඛුධාතුං භික්ඛවෙ, පටිච්ච උප්පජ්ජති චක්ඛුසම්ඵස්සො. චක්ඛුසම්ඵස්සං පටිච්ච උප්පජ්ජති චක්ඛුසම්ඵස්සජා වෙදනා -පෙ- මනොධාතුං පටිච්ච උප්පජ්ජති මනොසම්ඵස්සො. මනොසම්ඵස්සං පටිච්ච උප්පජ්ජති මනොසම්ඵස්සජා වෙදනා. එවං ඛො භික්ඛවෙ, ධාතුනානත්තං පටිච්ච උප්පජ්ජති ඵස්සනානත්තං. ඵස්සනානත්තං පටිච්ච උප්පජ්ජති වෙදනානානත්තන්ති."
            },
            {
                "type": "centered",
                "text": "2. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නොවෙදනානානත්තසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "229. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුනානත්තං භික්ඛවෙ, පටිච්ච උප්පජ්ජති ඵස්සනානත්තං, ඵස්සනානත්තං පටිච්ච උප්පජ්ජති වෙදනානානත්තං, නො වෙදනානානත්තං පටිච්ච උප්පජ්ජති ඵස්සනානත්තං. නො ඵස්සනානත්තං පටිච්ච උප්පජ්ජති ධාතුනානත්තං."
            },
            {
                "type": "paragraph",
                "text": "කතමඤ්ච භික්ඛවෙ, ධාතුනානත්තං? චක්ඛුධාතු -පෙ- මනොධාතු. ඉදං වුච්චති භික්ඛවෙ ධාතුනානත්තං."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ, ධාතුනානත්තං පටිච්ච උප්පජ්ජති ඵස්සනානත්තං. ඵස්සනානත්තං පටිච්ච උප්පජ්ජති වෙදනානානත්තං, නො වෙදනානානත්තං පටිච්ච උප්පජ්ජති ඵස්සනානත්තං, නො ඵස්සනානත්තං පටිච්ච උප්පජ්ජති ධාතුනානත්තං? චක්ඛුධාතුං භික්ඛවෙ, පටිච්ච උප්පජ්ජති චක්ඛුසම්ඵස්සො, චක්ඛුසම්ඵස්සං පටිච්ච උප්පජ්ජති චක්ඛුසම්ඵස්සජා වෙදනා. නො චක්ඛුසම්ඵස්සජං වෙදනං පටිච්ච උප්පජ්ජති චක්ඛුසම්ඵස්සො. නො චක්ඛුසම්ඵස්සං පටිච්ච උප්පජ්ජති චක්ඛුධාතු -පෙ- මනොධාතුං පටිච්ච උප්පජ්ජති මනොසම්ඵස්සො. මනොසම්ඵස්සං පටිච්ච උප්පජ්ජති මනොසම්ඵස්සොජාවෙදනා. නො මනොසම්ඵස්සජං වෙදනං පටිච්ච උප්පජ්ජති මනොසම්ඵස්සො. නො මනොසම්ඵස්සං පටිච්ච උප්පජ්ජති මනොධාතු."
            },
            {
                "type": "paragraph",
                "text": "එවං ඛො භික්ඛවෙ, ධාතුනානත්තං පටිච්ච උප්පජ්ජති ඵස්සනානත්තං. ඵස්සනානත්තං පටිච්ච උප්පජ්ජති වෙදනානානත්තං. නො වෙදනානානත්තං පටිච්ච උප්පජ්ජති ඵස්සනානත්තං. නො ඵස්සනානත්තං පටිච්ච උප්පජ්ජති ධාතුනානත්තන්ති."
            },
            {
                "type": "centered",
                "text": "2. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "බාහිරධාතුනානත්තසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "230. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුනානත්තං ඛො භික්ඛවෙ, දෙසෙස්සාමි. තං සුණාථ -පෙ- භාසිස්සාමි. කතමඤ්ච භික්ඛවෙ, ධාතුනානත්තං? රූපධාතු සද්දධාතු ගන්ධධාතු රසධාතු ඵොට්ඨබ්බධාතු ධම්මධාතු. ඉදං වුච්චති භික්ඛවෙ, ධාතුනානත්තන්ති."
            },
            {
                "type": "centered",
                "text": "2. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පරියෙසනානත්තසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "231. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුනානත්තං භික්ඛවෙ, පටිච්ච උප්පජ්ජති සඤ්ඤානානත්තං. සඤ්ඤානානත්තං පටිච්ච උප්පජ්ජති සඞ්කප්පනානත්තං. සඞ්කප්පනානත්තං පටිච්ච උප්පජ්ජති ඡන්දනානත්තං. ඡන්දනානත්තං පටිච්ච උප්පජ්ජති පරිළාහනානත්තං, පරිළාහනානත්තං පටිච්ච උප්පජ්ජති පරියෙසනානානත්තං."
            },
            {
                "type": "paragraph",
                "text": "කතමඤ්ච භික්ඛවෙ, ධාතුනානත්තං? රූපධාතු -පෙ- ධම්මධාතු. ඉදං වුච්චති භික්ඛවෙ ධාතුනානත්තං."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ, ධාතුනානත්තං පටිච්ච උප්පජ්ජති සඤ්ඤානානත්තං, සඤ්ඤානානත්තං පටිච්ච උප්පජ්ජති සඞ්කප්පනානත්තං, සඞ්කප්පනානත්තං පටිච්ච උප්පජ්ජති ඡන්දනානත්තං, ඡන්දනානත්තං පටිච්ච උප්පජ්ජති පරිළාහනානත්තං, පරිළාහනානත්තං පටිච්ච උප්පජ්ජති පරියෙසනානානත්තං?"
            },
            {
                "type": "paragraph",
                "text": "රූපධාතුං භික්ඛවෙ, පටිච්ච උප්පජ්ජති රූපසඤ්ඤා. රූපසඤ්ඤං පටිච්ච උප්පජ්ජති රූපසංකප්පො. රූපසංකප්පං පටිච්ච උප්පජ්ජති රූපච්ඡන්දො. රූපච්ඡන්දං පටිච්ච උප්පජ්ජති රූපපරිළාහො. රූපපරිළාහං පටිච්ච උප්පජ්ජති රූපපරියෙසනා [සද්දධාතුං භික්ඛවෙ, පටිච්ච] -පෙ- ධම්මධාතුං පටිච්ච උප්පජ්ජති ධම්මසඤ්ඤා. ධම්මසඤ්ඤං පටිච්ච උප්පජ්ජති ධම්මසංකප්පො. ධම්මසංකප්පං පටිච්ච උප්පජ්ජති ධම්මච්ඡන්දො. ධම්මච්ඡන්දං පටිච්ච උප්පජ්ජති ධම්මපරිළාහො. ධම්මපරිළාහං පටිච්ච උප්පජ්ජති ධම්මපරියෙසනා."
            },
            {
                "type": "paragraph",
                "text": "එවං ඛො භික්ඛවෙ, ධාතුනානත්තං පටිච්ච උප්පජ්ජති සඤ්ඤානානත්තං. සඤ්ඤානානත්තං පටිච්ච උප්පජ්ජති සංකප්පනානත්තං. සංකප්පනානත්තං පටිච්ච උප්පජ්ජති ඡන්දනානත්තං. ඡන්දනානත්තං පටිච්ච උප්පජ්ජති පරිළාහනානත්තං. පරිළාහනානත්තං පටිච්ච උප්පජ්ජති පරියෙසනානානත්තන්ති."
            },
            {
                "type": "centered",
                "text": "2. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නොපරියෙසනානානත්තසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "232. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුනානත්තං භික්ඛවෙ, පටිච්ච උප්පජ්ජති සඤ්ඤානානත්තං. සඤ්ඤානානත්තං පටිච්ච උප්පජ්ජති සංකප්පනානත්තං. සංකප්පනානත්තං පටිච්ච උප්පජ්ජති ඡන්දනානත්තං. ඡන්දනානත්තං පටිච්ච උප්පජ්ජති පරිළාහනානත්තං. පරිළාහනානත්තං පටිච්ච උප්පජ්ජති පරියෙසනානානත්තං. නො පරියෙසනානානත්තං පටිච්ච උප්පජ්ජති පරිළාහනානත්තං. නො පරිළාහනානත්තං පටිච්ච උප්පජ්ජති ඡන්දනානත්තං. නො ඡන්දනානත්තං පටිච්ච උප්පජ්ජති සංකප්පනානත්තං. නො සංකප්පනානත්තං පටිච්ච උප්පජ්ජති සඤ්ඤානානත්තං. නො සඤ්ඤානානත්තං පටිච්ච උප්පජ්ජති ධාතුනානත්තං."
            },
            {
                "type": "paragraph",
                "text": "කතමඤ්ච භික්ඛවෙ ධාතුනානත්තං? රූපධාතු -පෙ- ධම්මධාතු. ඉදං වුච්චති භික්ඛවෙ, ධාතුනානත්තං."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ ධාතුනානත්තං පටිච්ච උප්පජ්ජති සඤ්ඤානානත්තං, සඤ්ඤානානත්තං පටිච්ච උප්පජ්ජති -පෙ- පරියෙසනානානත්තං, නො පරියෙසනානානත්තං පටිච්ච උප්පජ්ජති පරිළාහනානත්තං. නො පරිළාහනානත්තං පටිච්ච උප්පජ්ජති ඡන්දනානත්තං, නො ඡන්දනානත්තං පටිච්ච උප්පජ්ජති සඞ්කප්පනානත්තං, නො සඞ්කප්පනානත්තං පටිච්ච උප්පජ්ජති සඤ්ඤානානත්තං, නො සඤ්ඤානානත්තං පටිච්ච උප්පජ්ජති ධාතුනානත්තං?"
            },
            {
                "type": "paragraph",
                "text": "රූපධාතුං භික්ඛවෙ, පටිච්ච උප්පජ්ජති රූපසඤ්ඤා. රූපසඤ්ඤං පටිච්ච උප්පජ්ජති රූපසංකප්පො. රූපසංකප්පං පටිච්ච උප්පජ්ජති රූපච්ඡන්දො. රූපච්ඡන්දං පටිච්ච උප්පජ්ජති රූපපරිළාහො. රූපපරිළාහං පටිච්ච උප්පජ්ජති රූපපරියෙසනා. නො රූපපරියෙසනං පටිච්ච උප්පජ්ජති රූපපරිළාහො. නො රූපපරිළහං පටිච්ච උප්පජ්ජති රූපච්ඡන්දො. නො රූපච්ඡන්දං පටිච්ච උප්පජ්ජති රූපසංකප්පො. නො රූපසංකප්පං පටිච්ච උප්පජ්ජති රූපසඤ්ඤා. නො රූපසඤ්ඤං පටිච්ච උප්පජ්ජති රූපධාතු."
            },
            {
                "type": "paragraph",
                "text": "සද්දධාතුං භික්ඛවෙ, පටිච්ච -පෙ- ධම්මධාතුං භික්ඛවෙ පටිච්ච උප්පජ්ජති ධම්මසඤ්ඤා. ධම්මසඤ්ඤං පටිච්ච උප්පජ්ජති ධම්මසංකප්පො. ධම්මසංකප්පං පටිච්ච උප්පජ්ජති ධම්මච්ඡන්දො. ධම්මච්ඡන්දං පටිච්ච උප්පජ්ජති ධම්මපරිළාහො. නො ධම්මපරිළාහං පටිච්ච උප්පජ්ජති ධම්මපරියෙසනා. නො ධම්මපරියෙසනං පටිච්ච උප්පජ්ජති ධම්මපරිළාහො. නො ධම්මපරිළාහං පටිච්ච උප්පජ්ජති ධම්මච්ඡන්දො. නො ධම්මච්ඡන්දං පටිච්ච උප්පජ්ජති ධම්මසංකප්පො. නො ධම්මසංකප්පං පටිච්ච උප්පජ්ජති ධම්මසඤ්ඤා. නො ධම්මසඤ්ඤං පටිච්ච උප්පජ්ජති ධම්මධාතු."
            },
            {
                "type": "paragraph",
                "text": "එවං ඛො භික්ඛවෙ, ධාතුනානත්තං පටිච්ච උප්පජ්ජති සඤ්ඤානානත්තං. සඤ්ඤානානත්තං පටිච්ච -පෙ- උප්පජ්ජති පරියෙසනානානත්තං. නො පරියෙසනානානත්තං පටිච්ච උප්පජ්ජති පරිළාහනානත්තං. නො පරිළාහනානත්තං පටිච්ච උප්පජ්ජති ඡන්දනානත්තං. නො ඡන්දනානත්තං පටිච්ච උප්පජ්ජති සංකප්පනානත්තං. නො සංකප්පනානත්තං පටිච්ච උප්පජ්ජති සඤ්ඤානානත්තං. නො සඤ්ඤානානත්තං පටිච්ච උප්පජ්ජති ධාතුනානත්තන්ති."
            },
            {
                "type": "page-break",
                "text": "230"
            },
            {
                "type": "centered",
                "text": "2. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ලාභනානත්තසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "233.** සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුනානත්තං භික්ඛවෙ, පටිච්ච උප්පජ්ජති සඤ්ඤානානත්තං. සඤ්ඤානානත්තං පටිච්ච උප්පජ්ජති සංකප්පනානත්තං. සංකප්පනානත්තං පටිච්ච උප්පජ්ජති ඵස්සනානත්තං. ඵස්සනානත්තං පටිච්ච උප්පජ්ජති වෙදනානානත්තං. වෙදනානානත්තං පටිච්ච උප්පජ්ජති ඡන්දනානත්තං. ඡන්දනානත්තං පටිච්ච උප්පජ්ජති පරිළාහනානත්තං. පරිළාහනානත්තං පටිච්ච උප්පජ්ජති පරියෙසනානානත්තං. පරියෙසනානානත්තං පටිච්ච උප්පජ්ජති ලාභනානත්තං."
            },
            {
                "type": "paragraph",
                "text": "කතමඤ්ච භික්ඛවෙ, ධාතුනානත්තං? රූපධාතු -පෙ- ධම්මධාතු, ඉදං වුච්චති, භික්ඛවෙ, ධාතුනානත්තං."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ, ධාතුනානත්තං පටිච්ච උප්පජ්ජති සඤ්ඤානානත්තං, සඤ්ඤානානත්තං පටිච්ච -පෙ- උප්පජ්ජති ලාභනානත්තං?"
            },
            {
                "type": "paragraph",
                "text": "රූපධාතුං භික්ඛවෙ, පටිච්ච උප්පජ්ජති රූපසඤ්ඤා. රූපසඤ්ඤං පටිච්ච උප්පජ්ජති රූපසංකප්පො. රූපසංකප්පං පටිච්ච උප්පජ්ජති රූපසම්ඵස්සො. රූපසම්ඵස්සං පටිච්ච උප්පජ්ජති රූපසම්ඵස්සජා වෙදනා. රූපසම්ඵස්සජං වෙදනං පටිච්ච උප්පජ්ජති රූපච්ඡන්දො. රූපච්ඡන්දං පටිච්ච උප්පජ්ජති රූපපරිළාහො. රූපපරිළාහං පටිච්ච උප්පජ්ජති රූපපරියෙසනා. රූපපරියෙසනං පටිච්ච උප්පජ්ජති රූපලාභො."
            },
            {
                "type": "paragraph",
                "text": "සද්දධාතුං භික්ඛවෙ, පටිච්ච -පෙ- ධම්මධාතුං භික්ඛවෙ, පටිච්ච උප්පජ්ජති ධම්මසඤ්ඤා. ධම්මසඤ්ඤං පටිච්ච උප්පජ්ජති ධම්මසංකප්පො. ධම්මසංකප්පං පටිච්ච උප්පජ්ජති ධම්මසම්ඵස්සො. ධම්මසම්ඵස්සං පටිච්ච උප්පජ්ජති ධම්මසම්ඵස්සජා වෙදනා. ධම්මසම්ඵස්සජං වෙදනං පටිච්ච උප්පජ්ජති ධම්මච්ඡන්දො. ධම්මච්ඡන්දං පටිච්ච උප්පජ්ජති ධම්මපරිළාහො. ධම්මපරිළාහං පටිච්ච උප්පජ්ජති ධම්මපරියෙසනා. ධම්මපරියෙසනං පටිච්ච උප්පජ්ජති ධම්මලාභො."
            },
            {
                "type": "paragraph",
                "text": "එවං ඛො භික්ඛවෙ, ධාතුනානත්තං පටිච්ච උප්පජ්ජති සඤ්ඤානානත්තං, සඤ්ඤානානත්තං පටිච්ච -පෙ- උප්පජ්ජති ලාභනානත්තන්ති."
            },
            {
                "type": "centered",
                "text": "2. 1. 10",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නොලාභනානත්තසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "234. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුනානත්තං භික්ඛවෙ, පටිච්ච උප්පජ්ජති සඤ්ඤානානත්තං. සඤ්ඤානානත්තං පටිච්ච උප්පජ්ජති සංකප්පනානත්තං. ඵස්ස -පෙ- වෙදනා -පෙ- ඡන්ද -පෙ- පරිළාහ -පෙ- පරියෙසනානානත්තං. පරියෙසනානානත්තං පටිච්ච උප්පජ්ජති ලාභනානත්තං. නො ලාභනානත්තං පටිච්ච උප්පජ්ජති පරියෙසනානානත්තං. නො පරියෙසනානානත්තං පටිච්ච උප්පජ්ජති පරිළාහනානත්තං. නො පරිළාහනානත්තං පටිච්ච උප්පජ්ජති -පෙ- ඡන්ද -පෙ- වෙදනා -පෙ- ඵස්ස -පෙ- සංකප්ප -පෙ- සඤ්ඤානානත්තං -පෙ- නො සඤ්ඤානානත්තං පටිච්ච උප්පජ්ජති ධාතුනානත්තං."
            },
            {
                "type": "page-break",
                "text": "232"
            },
            {
                "type": "paragraph",
                "text": "කතමඤ්ච භික්ඛවෙ, ධාතුනානත්තං? රූපධාතු -පෙ- ධම්මධාතු, ඉදං වුච්චති භික්ඛවෙ, ධාතුනානත්තං."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ, ධාතුනානත්තං පටිච්ච උප්පජ්ජති සඤ්ඤානානත්තං, සඤ්ඤානානත්තං පටිච්ච උප්පජ්ජති සංකප්පනානත්තං -පෙ- ඵස්ස -පෙ- වෙදනා -පෙ- ඡන්ද -පෙ- පරිළාහ -පෙ- පරියෙසනා -පෙ- ලාභ -පෙ- නො ලාභනානත්තං පටිච්ච උප්පජ්ජති පරියෙසනානානත්තං, නො පරියෙසනානානත්තං පටිච්ච උප්පජ්ජති පරිළාහනානානත්තං -පෙ- ඡන්ද -පෙ- වෙදනා -පෙ- ඵස්ස -පෙ- නො සංකප්පනානත්තං පටිච්ච උප්පජ්ජති සඤ්ඤානානත්තං, නො සඤ්ඤානානත්තං පටිච්ච උප්පජ්ජති ධාතුනානත්තං?"
            },
            {
                "type": "paragraph",
                "text": "රූපධාතුං භික්ඛවෙ, පටිච්ච උප්පජ්ජති රූපසඤ්ඤා -පෙ- සද්දධාතුං -පෙ- ගන්ධධාතුං -පෙ- රසධාතුං -පෙ- ඵොට්ඨබ්බධාතුං -පෙ- ධම්මධාතුං භික්ඛවෙ, පටිච්ච උප්පජ්ජති ධම්මසඤ්ඤා. ධම්මසඤ්ඤං පටිච්ච -පෙ- උප්පජ්ජති ධම්මපරියෙසනා. ධම්මපරියෙසනං පටිච්ච උප්පජ්ජති ධම්මලාභො. නො ධම්මලාභං පටිච්ච උප්පජ්ජති ධම්මපරියෙසනා. නො ධම්මපරියෙසනං පටිච්ච උප්පජ්ජති ධම්මපරිළාහො. නො ධම්මපරිළාහං පටිච්ච උප්පජ්ජති ධම්මච්ඡන්දො. නො ධම්මච්ඡන්දං පටිච්ච උප්පජ්ජති ධම්මසම්ඵස්සජා වෙදනා, නො ධම්මසම්ඵස්සජං වෙදනං පටිච්ච උප්පජ්ජති ධම්මසම්ඵස්සො, නො ධම්මසම්ඵස්සං පටිච්ච උප්පජ්ජති ධම්මසංකප්පො. නො ධම්මසංකප්පං පටිච්ච උප්පජ්ජති ධම්මසඤ්ඤා. නො ධම්මසඤ්ඤං පටිච්ච උප්පජ්ජති ධම්මධාතු."
            },
            {
                "type": "paragraph",
                "text": "එවං ඛො භික්ඛවෙ, ධාතුනානත්තං පටිච්ච උප්පජ්ජති සඤ්ඤානානත්තං. සඤ්ඤානානත්තං පටිච්ච -පෙ- සංකප්ප -පෙ- ඵස්ස -පෙ- වෙදනා -පෙ- ඡන්ද -පෙ- පරිළාහ -පෙ- පරියෙසනා -පෙ- ලාභ -පෙ- නො ලාභනානත්තං පටිච්ච උප්පජ්ජති පරියෙසනානානත්තං. නො පරියෙසනානානත්තං පටිච්ච උප්පජ්ජති පරිළාහනානත්තං. නො පරිළාහනානත්තං පටිච්ච උප්පජ්ජති ඡන්දනානත්තං. නො ඡන්දනානත්තං පටිච්ච උප්පජ්ජති වෙදනානානත්තං. නො වෙදනානානත්තං පටිච්ච උප්පජ්ජති ඵස්සනානත්තං. නො ඵස්සනානත්තං පටිච්ච උප්පජ්ජති සංකප්පනානත්තං. නො සංකප්පනානත්තං පටිච්ච උප්පජ්ජති සඤ්ඤානානත්තං. නො සඤ්ඤානානත්තං පටිච්ච උප්පජ්ජති ධාතුනානත්තන්ති."
            },
            {
                "type": "centered",
                "text": "නානත්තවග්ගො පඨමො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "ධාතුසම්ඵස්සං නො චෙතං වෙදනා අපරෙ දුවෙ,\nඑතං අජ්ඣත්තපඤ්චකං ධාතුසඤ්ඤා ච නො චෙතං,\nඵස්සෙන අපරෙ දුවෙ එතං බාහිරපඤ්චකන්ති.{1 උද්දානෙ සුත්තමානං විසදිසතා දිස්සතෙ.}"
            },
            {
                "type": "page-break",
                "text": "234"
            },
            {
                "type": "heading",
                "text": "2. සත්තධාතුවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "2. 2. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සත්තධාතුසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "235. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "සත්තිමා භික්ඛවෙ, ධාතුයො. කතමා සත්ත? ආභාධාතු, සුභධාතු,{1 සුභාධාතු - බහූසු.} ආකාසානඤ්චායතනධාතු, විඤ්ඤාණඤ්චායතනධාතු, ආකිඤ්චඤ්ඤායතනධාතු, නෙවසඤ්ඤානාසඤ්ඤායතනධාතු, සඤ්ඤාවෙදයිතනිරොධධාතු. ඉමා ඛො භික්ඛවෙ, සත්තධාතුයොති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ අඤ්ඤතරො භික්ඛු භගවන්තං එතදවොච: යාචායං භන්තෙ, ආභාධාතු, යා ච සුභධාතු, යා ච ආකාසානඤ්චායතනධාතු, යා ච විඤ්ඤාණඤ්චායතනධාතු, යා ච ආකිඤ්චඤ්ඤායතනධාතු, යා ච නෙවසඤ්ඤානාසඤ්ඤායතනධාතු, යා ච සඤ්ඤාවෙදයිතනිරොධධාතු, ඉමා නු ඛො භන්තෙ, ධාතුයො කිං පටිච්ච පඤ්ඤායන්තීති?"
            },
            {
                "type": "paragraph",
                "text": "යායං භික්ඛු, ආභාධාතු, අයං ධාතු අන්ධකාරං පටිච්ච පඤ්ඤායති. යායං භික්ඛු, සුභධාතු, අයං ධාතු අසුභං පටිච්ච පඤ්ඤායති. යායං භික්ඛු, ආකාසානඤ්චායතනධාතු, අයං ධාතු රූපං පටිච්ච පඤ්ඤායති. යායං භික්ඛු, විඤ්ඤාණඤ්චායතනධාතු, අයං ධාතු ආකාසානඤ්චායතනං පටිච්ච පඤ්ඤායති. යායං භික්ඛු, ආකිඤ්චඤ්ඤායතනධාතු, අයං ධාතු විඤ්ඤාණඤ්චායතනං පටිච්ච පඤ්ඤායති. යායං භික්ඛු, නෙවසඤ්ඤානාසඤ්ඤායතනධාතු, අයං ධාතු ආකිඤ්චඤ්ඤායතනං පටිච්ච පඤ්ඤායති. යායං භික්ඛු, සඤ්ඤාවෙදයිතනිරොධධාතු, අයං ධාතු නිරොධං පටිච්ච පඤ්ඤායතීති."
            },
            {
                "type": "paragraph",
                "text": "යා චායං භන්තෙ, ආභාධාතු යා ච සුභධාතු, යා ච ආකාසානඤ්චායතනධාතු, යා ච විඤ්ඤාණඤ්චායතනධාතු, යා ච ආකිඤ්චඤ්ඤායතනධාතු, යා ච නෙවසඤ්ඤානාසඤ්ඤායතනධාතු, යා ච සඤ්ඤාවෙදයිතනිරොධධාතු, ඉමා නු ඛො භන්තෙ, ධාතුයො කථං සමාපත්ති පත්තබ්බාති?"
            },
            {
                "type": "paragraph",
                "text": "යා චායං භික්ඛු, ආභාධාතු, යා ච සුභධාතු, යා ච ආකාසානඤ්චායතනධාතු, යා ච විඤ්ඤාණඤ්චායතනධාතු, යා ච ආකිඤ්චඤ්ඤායතනධාතු, ඉමා ධාතුයො සඤ්ඤාසමාපත්ති පත්තබ්බා. යායං භික්ඛු, නෙවසඤ්ඤානාසඤ්ඤායතනධාතු, අයං ධාතු සංඛාරාවසෙසා සමාපත්ති පත්තබ්බා. යායං භික්ඛු, සඤ්ඤාවෙදයිතනිරොධධාතු, අයං ධාතු නිරොධසමාපත්ති පත්තබ්බාති."
            },
            {
                "type": "page-break",
                "text": "236"
            },
            {
                "type": "centered",
                "text": "2. 2. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සනිදානසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "236. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "සනිදානං භික්ඛවෙ, උප්පජ්ජති කාමවිතක්කො නො අනිදානං, සනිදානං උප්පජ්ජති ව්යාපාදවිතක්කො නො අනිදානං, සනිදානං උප්පජ්ජති විහිංසා විතක්කො නො අනිදානං."
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ, සනිදානං උප්පජ්ජති කාමවිතක්කො නො අනිදානං, සනිදානං උප්පජ්ජති ව්යාපාදවිතක්කො නො අනිදානං, සනිදානං උප්පජ්ජති විහිංසාවිතක්කො නො අනිදානං?"
            },
            {
                "type": "paragraph",
                "text": "කාමධාතුං භික්ඛවෙ, පටිච්ච උප්පජ්ජති කාමසඤ්ඤා. කාමසඤ්ඤං පටිච්ච උප්පජ්ජති කාමසංකප්පො. කාමසංකප්පං පටිච්ච උප්පජ්ජති කාමච්ඡන්දො. කාමච්ඡන්දං පටිච්ච උප්පජ්ජති කාමපරිළාහො. කාමපරිළාහං පටිච්ච උප්පජ්ජති කාමපරියෙසනා. කාමපරියෙසනං භික්ඛවෙ, පරියෙසමානො අස්සුතවා පුථුජ්ජනො තීහි ඨානෙහි මිච්ඡා පටිපජ්ජති: කායෙන වාචාය මනසා."
            },
            {
                "type": "paragraph",
                "text": "ව්යාපාදධාතුං භික්ඛවෙ, පටිච්ච උප්පජ්ජති ව්යාපාදසඤ්ඤා. ව්යාපාදසඤ්ඤං පටිච්ච උප්පජ්ජති ව්යාපාදසංකප්පො. ව්යාපාදසංකප්පං පටිච්ච උප්පජ්ජති ව්යාපාදච්ඡන්දො. ව්යාපාදච්ඡන්දං පටිච්ච උප්පජ්ජති ව්යාපාදපරිළාහො. ව්යාපාදපරිළාහං පටිච්ච උප්පජ්ජති ව්යාපාදපරියෙසනා. ව්යාපාදපරියෙසනං භික්ඛවෙ, පරියෙසමානො අස්සුතවා පුථුජ්ජනො තීහි ඨානෙහි මිච්ඡා පටිපජ්ජති: කායෙන වාචාය මනසා."
            },
            {
                "type": "paragraph",
                "text": "විහිංසාධාතුං භික්ඛවෙ, පටිච්ච උප්පජ්ජති විහිංසාසඤ්ඤා -පෙ- විහිංසාසංකප්පො -පෙ- විහිංසාඡන්දො -පෙ- විහිංසාපරිළාහො -පෙ- විහිංසාපරියෙසනා -පෙ- විහිංසාපරියෙසනං භික්ඛවෙ, පරියෙසමානො අස්සුතවා පුථුජ්ජනො තීහි ඨානෙහි මිච්ඡා පටිපජ්ජති: කායෙන වාචාය මනසා."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ, පුරිසො ආදිත්තං තිණුක්කං සුක්ඛෙ තිණදායෙ නික්ඛිපෙය්ය,{1 නික්ඛපෙය්ය - ස්යා.} නො චෙ හත්ථෙහි ච පාදෙහි ච ඛිප්පමෙව නිබ්බාපෙය්ය. එවං හි භික්ඛවෙ, යෙ තිණකට්ඨනිස්සිතා පාණා, තෙ අනයව්යසනං ආපජ්ජෙය්යුං."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො භික්ඛවෙ, යො හි කොචි සමණො වා බ්රාහ්මණො වා උප්පන්නං විසමගතං අකුසලසඤ්ඤං{2 විසමගතං සඤ්ඤං - මඡසං. PTS.} න ඛිප්පමෙව පජහති විනොදෙති බ්යන්තීකරොති අනභාවං ගමෙති, සො දිට්ඨෙ චෙව{3 දිට්ඨෙව ධම්මෙ - සීමු. ස්යා.} ධම්මෙ දුක්ඛං විහරති සවිඝාතං සඋපායාසං සපරිළාහං. කායස්ස ච භෙදා{4 කායස්ස භෙදා - සීමු. ස්යා.} පරම්මරණා දුග්ගති පාටිකඞ්ඛා."
            },
            {
                "type": "paragraph",
                "text": "සනිදානං භික්ඛවෙ, උප්පජ්ජති නෙක්ඛම්මවිතක්කො නො අනිදානං. සනිදානං උප්පජ්ජති අව්යාපාදවිතක්කො නො අනිදානං. සනිදානං උප්පජ්ජති අවිහිංසාවිතක්කො නො අනිදානං."
            },
            {
                "type": "page-break",
                "text": "238"
            },
            {
                "type": "paragraph",
                "text": "කථඤ්ච භික්ඛවෙ, සනිදානං උප්පජ්ජති නෙක්ඛම්මවිතක්කො නො අනිදානං, සනිදානං උප්පජ්ජති අව්යාපාදවිතක්කො නො අනිදානං, සනිදානං උප්පජ්ජති අවිහිංසාවිතක්කො නො අනිදානං?"
            },
            {
                "type": "paragraph",
                "text": "නෙක්ඛම්මධාතුං භික්ඛවෙ, පටිච්ච උප්පජ්ජති නෙක්ඛම්මසඤ්ඤා. නෙක්ඛම්මසඤ්ඤං පටිච්ච උප්පජ්ජති නෙක්ඛම්මසංකප්පො. නෙක්ඛම්මසංකප්පං පටිච්ච උප්පජ්ජති නෙක්ඛම්මච්ඡන්දො. නෙක්ඛම්මච්ඡන්දං පටිච්ච උප්පජ්ජති නෙක්ඛම්මපරිළාහො. නෙක්ඛම්මපරිළාහං පටිච්ච උප්පජ්ජති නෙක්ඛම්මපරියෙසනා. නෙක්ඛම්මපරියෙසනං භික්ඛවෙ, පරියෙසමානො සුතවා අරියසාවකො තීහි ඨානෙහි සම්මා පටිපජ්ජති: කායෙන වාචාය මනසා."
            },
            {
                "type": "paragraph",
                "text": "අව්යාපාදධාතුං භික්ඛවෙ, පටිච්ච උප්පජ්ජති අව්යාපාදසඤ්ඤා -පෙ- අව්යාපාදසංකප්පො -පෙ- අව්යාපාදච්ඡන්දො -පෙ- අව්යාපාදපරිළාහො -පෙ- අව්යාපාදපරියෙසනා -පෙ- අව්යාපාදපරියෙසනං භික්ඛවෙ, පරියෙසමානො සුතවා අරියසාවකො තීහි ඨානෙහි සම්මා පටිපජ්ජති: කායෙන වාචාය මනසා."
            },
            {
                "type": "paragraph",
                "text": "අවිහිංසාධාතුං භික්ඛවෙ, පටිච්ච උප්පජ්ජති අවිහිංසාසඤ්ඤා. අවිහිංසාසඤ්ඤං පටිච්ච උප්පජ්ජති අවිහිංසාසංකප්පො. අවිහිංසාසංකප්පං පටිච්ච උප්පජ්ජති අවිහිංසාඡන්දො. අවිහිංසාඡන්දං පටිච්ච උප්පජ්ජති අවිහිංසාපරිළාහො. අවිහිංසාපරිළාහං පටිච්ච උප්පජ්ජති අවිහිංසාපරියෙසනා. අවිහිංසාපරියෙසනං භික්ඛවෙ, පරියෙසමානො සුතවා අරියසාවකො තීහි ඨානෙහි සම්මා පටිපජ්ජති: කායෙන වාචාය මනසා."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ, පුරිසො ආදිත්තං තිණුක්කං සුක්ඛෙ තිණදායෙ නික්ඛිපෙය්ය, තමෙනං හත්ථෙහි ච පාදෙහි ච ඛිප්පමෙව නිබ්බාපෙය්ය, එවං හි භික්ඛවෙ, යෙ තිණකට්ඨනිස්සිතා පාණා, තෙ න අනයව්යසනං ආපජ්ජෙය්යුං."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො භික්ඛවෙ, යො හි කොචි සමණො වා බ්රාහ්මණො වා උප්පන්නං විසමගතං අකුසලසඤ්ඤං ඛිප්පමෙව පජහති විනොදෙති බ්යන්තීකරොති අනභාවං ගමෙති, සො දිට්ඨෙ චෙව ධම්මෙ සුඛං විහරති අවිඝාතං අනුපායාසං අපරිළාහං. කායස්ස ච භෙදා පරම්මරණා සුගති පාටිකඞ්ඛාති."
            },
            {
                "type": "centered",
                "text": "2. 2. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ගිඤ්ජකාවසථසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "237. එකං සමයං භගවා ඤාතිකෙ{1 ඤාතිකෙහි - PTS.} විහරති ගිඤ්ජකාවසථෙ. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි භික්ඛවොති. භදන්තෙති තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "ධාතුං භික්ඛවෙ, පටිච්ච උප්පජ්ජති සඤ්ඤා, උප්පජ්ජති දිට්ඨි, උප්පජ්ජති විතක්කොති."
            },
            {
                "type": "paragraph",
                "text": "එවං වුත්තෙ ආයස්මා කච්චානො{2 සද්ධො කච්චායනො - PTS. සන්ධො කච්චායනො - සී 1, 2.} භගවන්තං එතදවොච: “යායං භන්තෙ, දිට්ඨි අසම්මාසම්බුද්ධෙසු සම්මා සම්බුද්ධාති. අයං නු ඛො භන්තෙ දිට්ඨි කිං පටිච්ච පඤ්ඤායතී”ති?"
            },
            {
                "type": "page-break",
                "text": "240"
            },
            {
                "type": "paragraph",
                "text": "මහති ඛො එසා කච්චාන, ධාතු යදිදං අවිජ්ජාධාතු. හීනං කච්චාන, ධාතුං පටිච්ච උප්පජ්ජති හීනා සඤ්ඤා, හීනා දිට්ඨි, හීනො විතක්කො, හීනා චෙතනා, හීනා පත්ථනා, හීනො පණිධි, හීනො පුග්ගලො, හීනා වාචා. හීනං ආචික්ඛති, දෙසෙති, පඤ්ඤපෙති, පට්ඨපෙති, විවරති, විභජති, උත්තානීකරොති. හීනා තස්ස උප්පත්තීති{1 උපපත්තීති - මඡසං. ස්යා.} වදාමි."
            },
            {
                "type": "paragraph",
                "text": "මජ්ඣිමං කච්චාන, ධාතුං පටිච්ච උප්පජ්ජති මජ්ඣිමා සඤ්ඤා, මජ්ඣිමා දිට්ඨි, මජ්ඣිමො විතක්කො, මජ්ඣිමා චෙතනා, මජ්ඣිමා පත්ථනා, මජ්ඣිමො පණිධි, මජ්ඣිමො පුග්ගලො, මජ්ඣිමා වාචා. මජ්ඣිමං ආචික්ඛති, දෙසෙති, පඤ්ඤපෙති, පට්ඨපෙති, විවරති, විභජති, උත්තානීකරොති. මජ්ඣිමා තස්ස උප්පත්තීති වදාමි."
            },
            {
                "type": "paragraph",
                "text": "පණීතං කච්චාන, ධාතුං පටිච්ච උප්පජ්ජති පණීතා සඤ්ඤා, පණීතා දිට්ඨි, පණීතො විතක්කො, පණීතා චෙතනා, පණීතා පත්ථනා, පණීතො පණිධි, පණීතො පුග්ගලො, පණීතා වාචා. පණීතං ආචික්ඛති, දෙසෙති, පඤ්ඤාපෙති, පට්ඨපෙති, විවරති, විභජති, උත්තානීකරොති. පණීතා තස්ස උප්පත්තීති වදාමීති."
            },
            {
                "type": "centered",
                "text": "2. 2. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "හීනාධිමුත්තික සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "238. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුසොව{2 ධාතුසො - කත්ථචි.} භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති: හීනාධිමුත්තිකා හීනාධිමුත්තිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. කල්යාණාධිමුත්තිකා කල්යාණාධිමුත්තිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "අතීතම්පි{3 අතීතම්පි ඛො - මඡසං.} භික්ඛවෙ, අද්ධානං ධාතුසොව සත්තා සංසන්දිංසු සමිංසු. හීනාධිමුත්තිකා හීනාධිමුත්තිකෙහි සද්ධිං සංසන්දිංසු සමිංසු. කල්යාණාධිමුත්තිකා කල්යාණාධිමුත්තිකෙහි සද්ධිං සංසන්දිංසු සමිංසු."
            },
            {
                "type": "paragraph",
                "text": "අනාගතම්පි{4 අනාගතම්පි ඛො - මඡසං.} භික්ඛවෙ, අද්ධානං ධාතුසොව සත්තා සංසන්දිස්සන්ති සමෙස්සන්ති. හීනාධිමුත්තිකා හීනාධිමුත්තිකෙහි සද්ධිං සංසන්දිස්සන්ති සමෙස්සන්ති. කල්යාණාධිමුත්තිකා කල්යාණාධිමුත්තිකෙහි සද්ධිං සංසන්දිස්සන්ති සමෙස්සන්ති."
            },
            {
                "type": "paragraph",
                "text": "එතරහි{5 එතරහි ඛො - මඡසං.} භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං ධාතුසොව සත්තා සංසන්දන්ති සමෙන්ති: හීනාධිමුත්තිකා හීනාධිමුත්තිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. කල්යාණාධිමුත්තිකා කල්යාණාධිමුත්තිකෙහි සද්ධිං සංසන්දන්ති සමෙන්තීති."
            },
            {
                "type": "page-break",
                "text": "242"
            },
            {
                "type": "centered",
                "text": "2. 2. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "චඞ්කමසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "239. එකං සමයං භගවා රාජගහෙ විහරති ගිජ්ඣකූටෙ පබ්බතෙ. තෙන ඛො පන සමයෙන ආයස්මා{1 ආයස්මාපි ඛො - PTS. ස්යා. සී 2.} සාරිපුත්තො සම්බහුලෙහි භික්ඛූහි සද්ධිං භගවතො අවිදූරෙ චඞ්කමති. ආයස්මාපි ඛො මහාමොග්ගල්ලානො සම්බහුලෙහි භික්ඛූහි සද්ධිං භගවතො අවිදූරෙ චඞ්කමති. ආයස්මාපි ඛො මහාකස්සපො සම්බහුලෙහි භික්ඛූහි සද්ධිං භගවතො අවිදූරෙ චඞ්කමති. ආයස්මාපි ඛො අනුරුද්ධො සම්බහුලෙහි භික්ඛූහි සද්ධිං භගවතො අවිදූරෙ චඞ්කමති. ආයස්මාපි ඛො පුණ්ණො මන්තානිපුත්තො සම්බහුලෙහි භික්ඛූහි සද්ධිං භගවතො අවිදූරෙ චඞ්කමති. ආයස්මාපි ඛො උපාලි සම්බහුලෙහි භික්ඛූහි සද්ධිං භගවතො අවිදූරෙ චඞ්කමති. ආයස්මාපි ඛො ආනන්දො සම්බහුලෙහි භික්ඛූහි සද්ධිං භගවතො අවිදූරෙ චඞ්කමති. දෙවදත්තොපි ඛො සම්බහුලෙහි භික්ඛූහි සද්ධිං භගවතො අවිදූරෙ චඞ්කමති."
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො භගවා භික්ඛූ ආමන්තෙසි: පස්සථ නො තුම්හෙ භික්ඛවෙ, සාරිපුත්තං සම්බහුලෙහි භික්ඛූහි සද්ධිං චඞ්කමන්තන්ති? ‘එවං භන්තෙ’ සබ්බෙ ඛො එතෙ භික්ඛවෙ, භික්ඛූ මහාපඤ්ඤා."
            },
            {
                "type": "paragraph",
                "text": "පස්සථ නො තුම්හෙ භික්ඛවෙ, මොග්ගල්ලානං{2 මහා මොග්ගල්ලානං - සීමු.} සම්බහුලෙහි භික්ඛූහි සද්ධිං චඞ්කමන්තන්ති? ‘එවං භන්තෙ’. සබ්බෙ ඛො{3 සබ්බෙපි ඛො - සී. 1, 2. PTS.} එතෙ භික්ඛවෙ, භික්ඛූ මහිද්ධිකා."
            },
            {
                "type": "paragraph",
                "text": "පස්සථ නො තුම්හෙ භික්ඛවෙ, කස්සපං{4 මහාකස්සපං - සීමු. 1.} සම්බහුලෙහි භික්ඛූහි සද්ධිං චඞ්කමන්තන්ති? ‘එවං භන්තෙ’. සබ්බෙ ඛො එතෙ භික්ඛවෙ, භික්ඛූ ධුතවාදා."
            },
            {
                "type": "paragraph",
                "text": "පස්සථ නො තුම්හෙ භික්ඛවෙ, අනුරුද්ධං සම්බහුලෙහි භික්ඛූහි සද්ධිං චඞ්කමන්තන්ති? ‘එවං භන්තෙ’. සබ්බෙ ඛො එතෙ භික්ඛවෙ, භික්ඛූ දිබ්බචක්ඛුකා."
            },
            {
                "type": "paragraph",
                "text": "පස්සථ නො තුම්හෙ භික්ඛවෙ, පුණ්ණං මන්තානිපුත්තං සම්බහුලෙහි භික්ඛූහි සද්ධිං චඞ්කමන්තන්ති? ‘එවං භන්තෙ’. සබ්බෙ ඛො එතෙ භික්ඛවෙ, භික්ඛූ ධම්මකථිකා."
            },
            {
                "type": "paragraph",
                "text": "පස්සථ නො තුම්හෙ භික්ඛවෙ, උපාලිං සම්බහුලෙහි භික්ඛූහි සද්ධිං චඞ්කමන්තන්ති? ‘එවං භන්තෙ’. සබ්බෙ ඛො එතෙ භික්ඛවෙ, භික්ඛූ විනයධරා."
            },
            {
                "type": "paragraph",
                "text": "පස්සථ නො තුම්හෙ භික්ඛවෙ, ආනන්දං සම්බහුලෙහි භික්ඛූහි සද්ධිං චඞ්කමන්තන්ති? ‘එවං භන්තෙ. සබ්බෙ ඛො එතෙ භික්ඛවෙ, භික්ඛූ බහුස්සුතා."
            },
            {
                "type": "page-break",
                "text": "244"
            },
            {
                "type": "paragraph",
                "text": "පස්සථ නො තුම්හෙ භික්ඛවෙ, දෙවදත්තං සම්බහුලෙහි භික්ඛූහි සද්ධිං චඞ්කමන්තන්ති? ‘එවං භන්තෙ’. සබ්බෙ ඛො එතෙ භික්ඛවෙ, භික්ඛූ පාපිච්ඡා."
            },
            {
                "type": "paragraph",
                "text": "ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති: හීනාධිමුත්තිකා හීනාධිමුත්තිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. කල්යාණාධිමුත්තිකා කල්යාණාධිමුත්තිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "අතීතම්පි භික්ඛවෙ, අද්ධානං ධාතුසොව සත්තා සංසන්දිංසු සමිංසු: හීනාධිමුත්තිකා හීනාධිමුත්තිකෙහි සද්ධිං සංසන්දිංසු සමිංසු. කල්යාණාධිමුත්තිකා කල්යාණාධිමුත්තිකෙහි සද්ධිං සංසන්දිංසු සමිංසු."
            },
            {
                "type": "paragraph",
                "text": "අනාගතම්පි භික්ඛවෙ, අද්ධානං ධාතුසොව සත්තා සංසන්දිස්සන්ති සමෙස්සන්ති: හීනාධිමුත්තිකා හීනාධිමුත්තිකෙහි සද්ධිං සංසන්දිස්සන්ති සමෙස්සන්ති. කල්යාණාධිමුත්තිකා කල්යාණාධිමුත්තිකෙහි සද්ධිං සංසන්දිස්සන්ති සමෙස්සන්ති."
            },
            {
                "type": "paragraph",
                "text": "එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං ධාතුසොව සත්තා සංසන්දන්ති සමෙන්ති: හීනාධිමුත්තිකා හීනාධිමුත්තිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. කල්යාණාධිමුත්තිකා කල්යාණාධිමුත්තිකෙහි සද්ධිං සංසන්දන්ති සමෙන්තීති."
            },
            {
                "type": "centered",
                "text": "2. 2. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සගාථසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "240. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති: හීනාධිමුත්තිකා හීනාධිමුත්තිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අතීතම්පි භික්ඛවෙ, අද්ධානං ධාතුසොව සත්තා සංසන්දිංසු සමිංසු: හීනාධිමුත්තිකා හීනාධිමුත්තිකෙහි සද්ධිං සංසන්දිංසු සමිංසු. අනාගතම්පි භික්ඛවෙ, අද්ධානං ධාතුසොව සත්තා සංසන්දිස්සන්ති සමෙස්සන්ති: හීනාධිමුත්තිකා හීනාධිමුත්තිකෙහි සද්ධිං සංසන්දිස්සන්ති සමෙස්සන්ති: එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං ධාතුසොව සත්තා සංසන්දන්ති සමෙන්ති. හීනාධිමුත්තිකා හීනාධිමුත්තිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ, ගූථො ගූථෙන සංසන්දති සමෙති. මුත්තං මුත්තෙන සංසන්දති සමෙති. ඛෙලො ඛෙලෙන සංසන්දති සමෙති. පුබ්බො පුබ්බෙන සංසන්දති සමෙති. ලොහිතං ලොහිතෙන සංසන්දති සමෙති. එවමෙව ඛො භික්ඛවෙ, ධාතුසොව සත්තා සංසන්දන්ති සමෙන්ති. -පෙ- අතීතම්පි භික්ඛවෙ, අද්ධානං -පෙ- අනාගතම්පි භික්ඛවෙ, අද්ධානං -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං ධාතුසොව සත්තා සංසන්දන්ති සමෙන්ති: හීනාධිමුත්තිකා හීනාධිමුත්තිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති."
            },
            {
                "type": "page-break",
                "text": "246"
            },
            {
                "type": "paragraph",
                "text": "ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති: කල්යාණාධිමුත්තිකා කල්යාණාධිමුත්තිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අතීතම්පි භික්ඛවෙ, අද්ධානං ධාතුසොව සත්තා සංසන්දිංසු සමිංසු: කල්යාණාධිමුත්තිකා කල්යාණාධිමුත්තිකෙහි සද්ධිං සංසන්දිංසු සමිංසු. අනාගතම්පි භික්ඛවෙ, අද්ධානං -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං ධාතුසොව සත්තා සංසන්දන්ති සමෙන්ති: කල්යාණාධිමුත්තිකා කල්යාණාධිමුත්තිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ, ඛීරං ඛීරෙන සංසන්දති සමෙති. තෙලං තෙලෙන සංසන්දති සමෙති. සප්පි සප්පිනා සංසන්දති සමෙති. මධු මධුනා සංසන්දති සමෙති. ඵාණිතං ඵාණිතෙන සංසන්දති සමෙති. එවමෙව ඛො භික්ඛවෙ, ධාතුසොව සත්තා සංසන්දන්ති සමෙන්ති: කල්යාණාධිමුත්තිකා කල්යාණාධිමුත්තිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අතීතම්පි භික්ඛවෙ අද්ධානං -පෙ- අනාගතම්පි භික්ඛවෙ, අද්ධානං -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං ධාතුසොව සත්තා සංසන්දන්ති සමෙන්ති: කල්යාණාධිමුත්තිකා කල්යාණාධිමුත්තිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "ඉදමවොච භගවා, ඉදං වත්වා සුගතො අථාපරං එතදවොච සත්ථා:"
            },
            {
                "type": "gatha",
                "text": "සංසග්ගා වනථො ජාතො අසංසග්ගෙන ඡිජ්ජති,\nපරිත්තං දාරුමාරුය්හ යථා සීදෙ මහණ්ණවෙ."
            },
            {
                "type": "gatha",
                "text": "එවං කුසීතමාගම්ම සාධු ජීවිපි සීදති,\nතස්මා නං පරිවජ්ජෙය්ය කුසීතං හීනවීරියං,"
            },
            {
                "type": "gatha",
                "text": "පවිවිත්තෙහි අරියෙහි පහිතත්තෙහි ඣායිහි,\nනිච්චං ආරද්ධවිරියෙහි පණ්ඩිතෙහි සහා වසෙ’ති."
            },
            {
                "type": "centered",
                "text": "2. 2. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අස්සද්ධසුත්තං{1 අස්සද්ධ සංසන්දන සුත්ත - මඡසං.}",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "241. ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති: අස්සද්ධා අස්සද්ධෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අහිරිකා අහිරිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අනොත්තාපිනො අනොත්තාපීහි{2 අනොත්තප්පිනො අනොත්තප්පීහි - මඡසං.} සද්ධිං සංසන්දන්ති සමෙන්ති. අප්පස්සුතා අප්පස්සුතෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. කුසීතා කුසීතෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. මුට්ඨස්සතිනො මුට්ඨස්සතීහි සද්ධිං සංසන්දන්ති සමෙන්ති. දුප්පඤ්ඤා දුප්පඤ්ඤෙහි සද්ධිං සංසන්දන්ති සමෙන්ති.{3 “සද්ධො සද්ධෙහි සද්ධිං සංසන්දන්ති, සමෙන්ති. හිරිමනා හිරිමනෙහි සද්ධිං සංසන්දන්ති, සමෙන්ති. ඔත්තාපිනො ඔත්තාපීහි සද්ධිං සංසන්දන්ති, සමෙන්ති. බහුස්සුතා බහුස්සුතෙහි සද්ධිං සංසන්දන්ති, සමෙන්ති. ආරද්ධවිරියා ආරද්ධවිරියෙහි සද්ධිං සංසන්දන්ති, සමෙන්ති. උපට්ඨිතසතිනො උපට්ඨිත සතීහි සද්ධිං සංසන්දන්ති. සමෙන්ති. පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති, සමෙන්ති.” දිස්සතෙත්රායමධිකො පාඨො PTS පොත්ථකෙ.}"
            },
            {
                "type": "page-break",
                "text": "248"
            },
            {
                "type": "paragraph",
                "text": "අතීතම්පි භික්ඛවෙ, අද්ධානං ධාතුසොව සත්තා සංසන්දිංසු සමිංසු: අස්සද්ධා අස්සද්ධෙහි සද්ධිං සංසන්දිංසු සමිංසු. අහිරිකා අහිරිකෙහි සද්ධිං සංසන්දිංසු සමිංසු: අනොත්තාපිනො අනොත්තාපීහි සද්ධිං සංසන්දිංසු සමිංසු. අප්පස්සුතා අප්පස්සුතෙහි සද්ධිං සංසන්දිංසු සමිංසු. කුසීතා කුසීතෙහි සද්ධිං සංසන්දිංසු සමිංසු. මුට්ඨස්සතිනො මුට්ඨස්සතීහි සද්ධිං සංසන්දිංසු සමිංසු. දුප්පඤ්ඤා දුප්පඤ්ඤෙහි සද්ධිං සංසන්දිංසු සමිංසු."
            },
            {
                "type": "paragraph",
                "text": "අනාගතම්පි භික්ඛවෙ, අද්ධානං ධාතුසොව සත්තා සංසන්දිස්සන්ති සමෙස්සන්ති: අස්සද්ධා අස්සද්ධෙහි සද්ධිං සංසන්දිස්සන්ති සමෙස්සන්ති. අහිරිකා අහිරිකෙහි සද්ධිං සංසන්දිස්සන්ති සමෙස්සන්ති. අනොත්තාපිනො අනොත්තාපීහි සද්ධිං -පෙ- අප්පස්සුතා අප්පස්සුතෙහි සද්ධිං -පෙ- කුසීතා කුසීතෙහි සද්ධිං -පෙ- මුට්ඨස්සතිනො මුට්ඨස්සතීහි සද්ධිං -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි සද්ධිං සංසන්දිස්සන්ති සමෙස්සන්ති."
            },
            {
                "type": "paragraph",
                "text": "එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං ධාතුසොව සත්තා සංසන්දන්ති සමෙන්ති: අස්සද්ධා අස්සද්ධෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අහිරිකා අහිරිකෙහි සද්ධිං -පෙ- අනොත්තාපිනො අනොත්තාපීහි සද්ධිං -පෙ- අප්පස්සුතා අප්පස්සුතෙහි සද්ධිං -පෙ- කුසීතා කුසීතෙහි සද්ධිං -පෙ- මුට්ඨස්සතිනො මුට්ඨස්සතීහි සද්ධිං -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි සද්ධිං සංසන්දන්ති සමෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති: සද්ධා සද්ධෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. හිරිමනා හිරිමනෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. ඔත්තාපිනො ඔත්තාපීහි සද්ධිං සංසන්දන්ති සමෙන්ති. බහුස්සුතා බහුස්සුතෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. ආරද්ධවිරියා ආරද්ධවිරියෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. උපට්ඨිතසතිනො උපට්ඨිතසතීහි සද්ධිං සංසන්දන්ති සමෙන්ති. පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "අතීතම්පි භික්ඛවෙ, අද්ධානං -පෙ- අනාගතම්පි භික්ඛවෙ අද්ධානං -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං ධාතුසොව සත්තා සංසන්දන්ති සමෙන්ති: සද්ධා සද්ධෙහි සද්ධිං -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්තීති."
            },
            {
                "type": "centered",
                "text": "2. 2. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අස්සද්ධමූලකතිකපඤ්චකසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "242. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති: අස්සද්ධා අස්සද්ධෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අහිරිකා අහිරිකෙහි සද්ධිං [සංසන්දන්ති සමෙන්ති.] දුප්පඤ්ඤා දුප්පඤ්ඤෙහි සද්ධිං [සංසන්දන්ති සමෙන්ති.] සද්ධා සද්ධෙහි සද්ධිං [සංසන්දන්ති සමෙන්ති.] හිරිමනා හිරිමනෙහි සද්ධිං [සංසන්දන්ති සමෙන්ති.] පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති."
            },
            {
                "type": "page-break",
                "text": "250"
            },
            {
                "type": "paragraph",
                "text": "අතීතම්පි භික්ඛවෙ, අද්ධානං ධාතුසොව සත්තා සංසන්දිංසු සමිංසු -පෙ- අනාගතම්පි භික්ඛවෙ, අද්ධානං ධාතුසොව සත්තා සංසන්දිස්සන්ති සමෙන්ති -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං ධාතුසොව සත්තා සංසන්දන්ති සමෙන්ති. අස්සද්ධා අස්සද්ධෙහි සද්ධිං -පෙ- අහිරිකා අහිරිකෙහි සද්ධිං -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි සද්ධිං -පෙ- සද්ධා සද්ධෙහි සද්ධිං -පෙ- හිරිමනා හිරිමනෙහි සද්ධිං -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. (පඨමත්තිකං.)"
            },
            {
                "type": "paragraph",
                "text": "ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති: අස්සද්ධා අස්සද්ධෙහි -පෙ- අනොත්තාපිනො අනොත්තාපීහි -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි -පෙ- සද්ධා සද්ධෙහි -පෙ- ඔත්තාපිනො ඔත්තාපීහි -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අතීතම්පි භික්ඛවෙ අද්ධානං -පෙ- අනාගතම්පි භික්ඛවෙ අද්ධානං -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං [ධාතුසොව සත්තා සංසන්දන්ති] සමෙන්ති: [අස්සද්ධං අස්සද්ධෙහි -පෙ- අනොත්තාපිනො අනොත්තාපීහි -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි -පෙ- සද්ධා සද්ධෙහි -පෙ- ඔත්තාපිනො ඔත්තාපීහි -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති, සමෙන්ති.] (දුතියත්තිකං.)"
            },
            {
                "type": "paragraph",
                "text": "[ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති:] අස්සද්ධා අස්සද්ධෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අප්පස්සුතා අප්පස්සුතෙහි -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි -පෙ- සද්ධා සද්ධෙහි -පෙ- බහුස්සුතා බහුස්සුතෙහි -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අතීතම්පි භික්ඛවෙ අද්ධානං -පෙ- අනාගතම්පි භික්ඛවෙ අද්ධානං -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං -පෙ- [අස්සද්ධං අස්සද්ධෙහි -පෙ- අප්පස්සුතා අප්පස්සුතෙහි -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි -පෙ- සද්ධා සද්ධෙහි -පෙ- බහුස්සුතා බහුස්සුතෙහි -පෙ- පඤ්ඤවනෙතෙ පඤ්ඤවනෙතෙහි සද්ධිං සංසන්දන්ති] සමෙන්ති. (තතියත්තිකං.)"
            },
            {
                "type": "paragraph",
                "text": "[ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති:] අස්සද්ධා අස්සද්ධෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. කුසීතා කුසීතෙහි -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි -පෙ- සද්ධා සද්ධෙහි -පෙ- ආරද්ධවිරියා ආරද්ධවිරියෙහි -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අතීතම්පි භික්ඛවෙ අද්ධානං -පෙ- අනාගතම්පි භික්ඛවෙ අද්ධානං -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං -පෙ- [අස්සද්ධා -පෙ- කුසීතා -පෙ- දුප්පඤ්ඤා -පෙ- සද්ධා -පෙ- ආරද්ධවිරියා -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. ] (චතුත්ථත්තිකං.)"
            },
            {
                "type": "page-break",
                "text": "252"
            },
            {
                "type": "paragraph",
                "text": "[ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති.] අස්සද්ධා අස්සද්ධෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. මුට්ඨස්සතිනො මුට්ඨස්සතීහි -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි -පෙ- සද්ධා සද්ධෙහි -පෙ- උපට්ඨිතසතිනො උපට්ඨිතසතීහි -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අතීතම්පි භික්ඛවෙ, අද්ධානං -පෙ- අනාගතම්පි භික්ඛවෙ අද්ධානං -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං -පෙ- [අස්සද්ධා -පෙ- මුට්ඨස්සතිනො -පෙ- දුප්පඤ්ඤා -පෙ- සද්ධා -පෙ- උපට්ඨිතසතිනො -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්තීති. ] (පඤ්චමත්තිකං.)"
            },
            {
                "type": "centered",
                "text": "2. 2. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අහිරිකමූලකතිකචතුක්කසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "243. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති: අහිරිකා අහිරිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අනොත්තාපිනො අනොත්තාපීහි සද්ධිං -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි සද්ධිං -පෙ- හිරිමනා හිරිමනෙහි සද්ධිං -පෙ- ඔත්තාපිනො ඔත්තාපීහි සද්ධිං -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අතීතම්පි [භික්ඛවෙ, අද්ධානං] -පෙ- අනාගතම්පි [භික්ඛවෙ, අද්ධානං] -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං -පෙ- අහිරිකා -පෙ- අනොත්තප්පිනො -පෙ- දුප්පඤ්ඤා -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්තීති. (පඨමත්තිකං.)"
            },
            {
                "type": "paragraph",
                "text": "[ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති:] අහිරිකා අහිරිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අප්පස්සුතා අප්පස්සුතෙහි සද්ධිං -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි සද්ධිං -පෙ- හිරිමනා හිරිමනෙහි සද්ධිං -පෙ- බහුස්සුතා බහුස්සුතෙහි සද්ධිං -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අතීතම්පි භික්ඛවෙ, අද්ධානං -පෙ- අනාගතම්පි භික්ඛවෙ, අද්ධානං -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං -පෙ- [අහිරිකා -පෙ- අප්පස්සුතා -පෙ- දුප්පඤ්ඤා -පෙ- හිරිමනා -පෙ- බහුස්සුතා -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. (දුතියත්තිකං.)"
            },
            {
                "type": "paragraph",
                "text": "[ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති:] අහිරිකා අහිරිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. කුසීතා කුසීතෙහි සද්ධිං -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි සද්ධිං -පෙ- හිරිමනා හිරිමනෙහි සද්ධිං -පෙ- ආරද්ධවිරියා ආරද්ධවිරියෙහි සද්ධිං -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අතීතම්පි භික්ඛවෙ, අද්ධානං -පෙ- අනාගතම්පි භික්ඛවෙ, අද්ධානං -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං -පෙ- [අහිරිකා -පෙ- කුසීතා -පෙ- දුප්පඤ්ඤා -පෙ- හිරිමනා -පෙ- ආරද්ධවිරියා -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති.] (තතියත්තිකං.)"
            },
            {
                "type": "page-break",
                "text": "254"
            },
            {
                "type": "paragraph",
                "text": "[ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති:] අහිරිකා අහිරිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. මුට්ඨස්සතිනො මුට්ඨස්සතීහි සද්ධිං -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි සද්ධිං -පෙ- හිරිමනා හිරිමනෙහි සද්ධිං -පෙ- උපට්ඨිතසතිනො උපට්ඨිතසතීහි සද්ධිං -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අතීතම්පි භික්ඛවෙ, අද්ධානං -පෙ- අනාගතම්පි භික්ඛවෙ, අද්ධානං -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං -පෙ- අහිරිකා -පෙ- මුට්ඨස්සතිනො -පෙ- දුප්පඤ්ඤා -පෙ- හිරිමනා -පෙ- උපට්ඨිතසතිනො -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති.] (චතුත්ථතතිකං.)"
            },
            {
                "type": "centered",
                "text": "2. 2. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනොත්තාපමූලකතිකත්තයසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "244. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති. අනොත්තාපිනො අනොත්තාපීහි සද්ධිං -පෙ-අප්පස්සුතා අප්පස්සුතෙහි සද්ධිං -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි සද්ධිං -පෙ- ඔත්තාපිනො ඔත්තාපීහි සද්ධිං -පෙ- බහුස්සුතා බහුස්සුතෙහි සද්ධිං -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අතීතම්පි භික්ඛවෙ, අද්ධානං -පෙ- අනාගතම්පි භික්ඛවෙ, අද්ධානං -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං [අනොත්තාපිනො -පෙ- අප්පස්සුතා -පෙ- දුප්පඤ්ඤා -පෙ- ඔත්තාපිනො -පෙ- බහුස්සුතා -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති.] (පඨමත්තිකං.)"
            },
            {
                "type": "paragraph",
                "text": "[ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති, සමෙන්ති:] අනොත්තාපිනො අනොත්තාපීහි සද්ධිං සංසන්දන්ති සමෙන්ති. කුසීතා කුසීතෙහි සද්ධිං -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි සද්ධිං -පෙ- ඔත්තාපිනො ඔත්තාපීහි සද්ධිං -පෙ- ආරද්ධවිරියා ආරද්ධවිරියෙහි සද්ධිං -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අතීතම්පි භික්ඛවෙ, අද්ධානං -පෙ- අනාගතම්පි භික්ඛවෙ, අද්ධානං -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං -පෙ- අනොත්තාපිනො -පෙ- කුසීතා -පෙ- දුප්පඤ්ඤා -පෙ- ඔත්තාපිනො -පෙ- ආරද්ධවිරියා -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති.] (දුතියත්තිකං.)"
            },
            {
                "type": "paragraph",
                "text": "[ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති, සමෙන්ති:] අනොත්තාපිනො අනොත්තාපීහි සද්ධිං සංසන්දන්ති සමෙන්ති. මුට්ඨස්සතිනො මුට්ඨස්සතීහි සද්ධිං -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි සද්ධිං -පෙ- ඔත්තාපිනො ඔත්තාපීහි සද්ධිං -පෙ- උපට්ඨිතසතිනො උපට්ඨිතසතීහි සද්ධිං -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අතීතම්පි භික්ඛවෙ, අද්ධානං -පෙ- අනාගතම්පි භික්ඛවෙ, අද්ධානං -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං [අනොත්තාපිනො -පෙ- මුට්ඨස්සතිනො -පෙ- දුප්පඤ්ඤා -පෙ- ඔත්තාපිනො -පෙ- උපට්ඨිතසතිනො -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති.] (තතියත්තිකං.)"
            },
            {
                "type": "page-break",
                "text": "256"
            },
            {
                "type": "centered",
                "text": "2. 2. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අප්පස්සුතමූලකතිකද්වයසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "245.** සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති: අප්පස්සුතා අප්පස්සුතෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. කුසීතා කුසීතෙහි සද්ධිං -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි සද්ධිං -පෙ- බහුස්සුතා බහුස්සුතෙහි සද්ධිං -පෙ- ආරද්ධවිරියා ආරද්ධවිරියෙහි සද්ධිං -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අතීතම්පි භික්ඛවෙ, අද්ධානං -පෙ- අනාගතම්පි භික්ඛවෙ, අද්ධානං -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං -පෙ- අප්පස්සුතා -පෙ- කුසීතා -පෙ- දුප්පඤ්ඤා -පෙ- බහුස්සුතා -පෙ- ආරද්ධවිරියා -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. (පඨමත්තිකං.)"
            },
            {
                "type": "paragraph",
                "text": "[ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති, සමෙන්ති:] අප්පස්සුතා අප්පස්සුතෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. මුට්ඨස්සතිනො මුට්ඨස්සතීහි සද්ධිං -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි සද්ධිං -පෙ- බහුස්සුතා බහුස්සුතෙහි සද්ධිං -පෙ- උපට්ඨිතසතිනො උපට්ඨිතසතීහි සද්ධිං -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අතීතම්පි භික්ඛවෙ, අද්ධානං -පෙ- අනාගතම්පි භික්ඛවෙ, අද්ධානං -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං -පෙ- අප්පස්සුතා -පෙ- මුට්ඨස්සතිනො -පෙ- දුප්පඤ්ඤා -පෙ- බහුස්සුතා -පෙ- උපට්ඨිතසතිනො -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. (දුතියත්තිකං.)"
            },
            {
                "type": "centered",
                "text": "2. 2. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කුසීතමූලකතිකෙකසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "246. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති: කුසීතා කුසීතෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. මුට්ඨස්සතිනො මුට්ඨස්සතීහි සද්ධිං -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි සද්ධිං -පෙ- ආරද්ධවිරියා ආරද්ධවිරියෙහි සද්ධිං -පෙ- උපට්ඨිතසතිනො උපට්ඨිතසතීහි සද්ධිං -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අතීතම්පි භික්ඛවෙ, අද්ධානං -පෙ- අනාගතම්පි භික්ඛවෙ, අද්ධානං -පෙ- එතරහිපි භික්ඛවෙ, පච්චුප්පන්නං අද්ධානං -පෙ- කුසීතා -පෙ- මුට්ඨස්සතිනො -පෙ- දුප්පඤ්ඤා -පෙ- ආරද්ධවිරියා -පෙ- උපට්ඨිතසතිනො -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්තීති."
            },
            {
                "type": "centered",
                "text": "සත්තධාතුවග්ගො දුතියො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "paragraph",
                "text": "සත්තධාතු සනිදානං ගිඤ්ජකාවසථෙන ච,හීනාධිමුත්ති චඞ්කමං සගාථාස්සද්ධ{1 සගාථඤ්චාති - සීමු.} සත්තමං.අස්සද්ධමූලකා පඤ්ච චත්තාරි අහිරිකමූලකා,අනොත්තාපමූලකා තීණි දුවෙ අප්පස්සුතෙන චකුසීතං එකකං වුත්තං සුත්තන්තා තීණි පඤ්චකාති"
            },
            {
                "type": "page-break",
                "text": "258"
            },
            {
                "type": "heading",
                "text": "3. කම්මපථවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "2. 3. 1",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අසමාහිතසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "247. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති: අස්සද්ධා අස්සද්ධෙහි සද්ධිං සංසන්දන්ති සමෙන්ති: අහිරිකා අහිරිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අනොත්තාපිනො අනොත්තාපීහි සද්ධිං -පෙ- අසමාහිතා අසමාහිතෙහි සද්ධිං -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි සද්ධිං සංසන්දන්ති සමෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "සද්ධා සද්ධෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. හිරිමනා හිරිමනෙහි සද්ධිං -පෙ- ඔත්තාපිනො ඔත්තාපීහි සද්ධිං -පෙ- සමාහිතා සමාහිතෙහි සද්ධිං -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්තීති."
            },
            {
                "type": "centered",
                "text": "2. 3. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුස්සීලසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "248. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති: අස්සද්ධා අස්සද්ධෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අහිරිකා අහිරිකෙහි සද්ධිං -පෙ- අනොත්තාපිනො අනොත්තාපීහි සද්ධිං -පෙ- දුස්සීලා දුස්සීලෙහි සද්ධිං -පෙ- දුප්පඤ්ඤා දුප්පඤ්ඤෙහි සද්ධිං සංසන්දන්ති සමෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "සද්ධා සද්ධෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. හිරිමනා හිරිමනෙහි සද්ධිං -පෙ- ඔත්තාපිනො ඔත්තාපීහි සද්ධිං -පෙ- සීලවන්තො සීලවන්තෙහි සද්ධිං -පෙ- පඤ්ඤවන්තො පඤ්ඤවන්තෙහි සද්ධිං සංසන්දන්ති සමෙන්තීති."
            },
            {
                "type": "centered",
                "text": "2. 3. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පඤ්චසික්ඛාපදසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "249. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති. පාණාතිපාතිනො පාණාතිපාතීහි සද්ධිං සංසන්දන්ති සමෙන්ති. අදින්නාදායිනො අදින්නාදායීහි සද්ධිං -පෙ- කාමෙසු මිච්ඡාචාරයො කාමෙසු මිච්ඡාචාරීහි සද්ධිං -පෙ- මුසාවාදිනො මුසාවාදීහි සද්ධිං -පෙ- සුරාමෙරයමජ්ජපමාදට්ඨායිනො සුරාමෙරයමජ්ජපමාදට්ඨායීහි සද්ධිං සංසන්දන්ති සමෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "පාණාතිපාතා පටිවිරතා පාණාතිපාතා පටිවිරතෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අදින්නාදානා පටිවිරතා අදින්නාදානා පටිවිරතෙහි සද්ධිං -පෙ- කාමෙසු මිච්ඡාචාරා පටිවිරතා කාමෙසු මිච්ඡාචාරා පටිවිරතෙහි සද්ධිං -පෙ- මුසාවාදා පටිවිරතා මුසාවාදා පටිවිරතෙහි සද්ධිං -පෙ- සුරාමෙරයමජ්ජපමාදට්ඨානා පටිවිරතා සුරාමෙරයමජ්ජපමාදට්ඨානා පටිවිරතෙහි සද්ධිං සංසන්දන්ති සමෙන්තීති."
            },
            {
                "type": "page-break",
                "text": "260"
            },
            {
                "type": "centered",
                "text": "2. 3. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සත්තකම්මපථසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "250. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති: පාණාතිපාතිනො පාණාතිපාතීහි සද්ධිං සංසන්දන්ති සමෙන්ති. අදින්නාදායිනො අදින්නාදායීහි සද්ධිං -පෙ- කාමෙසු මිච්ඡාචාරිනො කාමෙසු මිච්ඡාචාරීහි සද්ධිං -පෙ- මුසාවාදිනො මුසාවාදීහි සද්ධිං -පෙ- පිසුණවාචා පිසුණවාචෙහි සද්ධිං -පෙ- ඵරුසවාචා ඵරුසවාචෙහි සද්ධිං -පෙ- සම්ඵප්පලාපිනො සම්ඵප්පලාපීහි සද්ධිං සංසන්දන්ති සමෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "පාණාතිපාතා පටිවිරතා -පෙ- අදින්නාදානා පටිවිරතා -පෙ- කාමෙසු මිච්ඡාචාරා පටිවිරතා -පෙ- මුසාවාදා පටිවිරතා -පෙ- පිසුණාය වාචාය{1 පිසුණාවාචා - සීමු. සී 1, 2. පිසුණවාචාය - PTS.} පටිවිරතා -පෙ- ඵරුසාය වාචාය{2 ඵරුසාවාචා - සීමු. සී 1, 2. ඵරුසවාචාය - PTS.} පටිවිරතා -පෙ- සම්ඵප්පලාපා පටිවිරතා සම්ඵප්පලාපා පටිවිරතෙහි සද්ධිං සංසන්දන්ති සමෙන්තීති."
            },
            {
                "type": "centered",
                "text": "2. 3. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දසකම්මපථසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "251. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති: පාණාතිපාතිනො පාණාතිපාතීහි සද්ධිං සංසන්දන්ති සමෙන්ති. අදින්නාදායිනො -පෙ- කාමෙසු මිච්ඡාචාරිනො -පෙ- මුසාවාදිනො -පෙ- පිසුණවාචා -පෙ- ඵරුසවාචා -පෙ- සම්ඵප්පලාපිනො -පෙ- අභිජ්ඣාලුනො අභිජ්ඣාලූහි සද්ධිං සංසන්දන්ති සමෙන්ති. බ්යාපන්නචිත්තා බ්යාපන්නචිත්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. මිච්ඡාදිට්ඨිකා මිච්ඡාදිට්ඨිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "පාණාතිපාතා පටිවිරතා පාණාතිපාතා පටිවිරතෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. අදින්නාදානා පටිවිරතා -පෙ- කාමෙසු මිච්ඡාචාරා පටිවිරතා -පෙ- මුසාවාදා පටිවිරතා -පෙ- පිසුණාය වාචාය පටිවිරතා -පෙ- ඵරුසාය වාචාය පටිවිරතා -පෙ- සම්ඵප්පලාපා පටිවිරතා -පෙ- අනභිජ්ඣාලුනො අනභිජ්ඣාලූහි සද්ධිං සංසන්දන්ති සමෙන්ති. අබ්යාපන්නචිත්තා අබ්යාපන්නචිත්තෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. සම්මාදිට්ඨිකා සම්මාදිට්ඨිකෙහි සද්ධිං සංසන්දන්ති සමෙන්තීති."
            },
            {
                "type": "page-break",
                "text": "262"
            },
            {
                "type": "centered",
                "text": "2. 3. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අට්ඨඞ්ගිකසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "252. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති: මිච්ඡාදිට්ඨිකා මිච්ඡාදිට්ඨිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. මිච්ඡාසංකප්පා -පෙ- මිච්ඡාවාචා -පෙ- මිච්ඡාකම්මන්තා -පෙ- මිච්ඡාආජීවා -පෙ- මිච්ඡාවායාමා -පෙ- මිච්ඡාසතිනො -පෙ- මිච්ඡාසමාධිනො මිච්ඡාසමාධීහි සද්ධිං සංසන්දන්ති සමෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "සම්මාදිට්ඨිකා සම්මාදිට්ඨිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. සම්මාසංකප්පා -පෙ- සම්මාවාචා -පෙ- සම්මාකම්මන්තා -පෙ- සම්මාආජීවා -පෙ- සම්මාවායාමා -පෙ- සම්මාසතිනො -පෙ- සම්මාසමාධිනො සම්මාසමාධීහි සද්ධිං සංසන්දන්ති සමෙන්තීති."
            },
            {
                "type": "centered",
                "text": "2. 3. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දසඞ්ගිකසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "253. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "ධාතුසොව භික්ඛවෙ, සත්තා සංසන්දන්ති සමෙන්ති: මිච්ඡාදිට්ඨිකා මිච්ඡාදිට්ඨිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. මිච්ඡාසංකප්පා -පෙ- මිච්ඡාවාචා -පෙ- මිච්ඡාකම්මන්තා -පෙ- මිච්ඡාආජීවා -පෙ- මිච්ඡාවායාමා -පෙ- මිච්ඡාසතිනො -පෙ- මිච්ඡාසමාධිනො -පෙ- මිච්ඡාඤාණිනො මිච්ඡාඤාණීහි සද්ධිං සංසන්දන්ති සමෙන්ති. මිච්ඡාවිමුත්තිනො{1 විමුත්තිකා - සීමු.} මිච්ඡාවිමුත්තීහි සද්ධිං සංසන්දන්ති සමෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "සම්මාදිට්ඨිකා සම්මාදිට්ඨිකෙහි සද්ධිං සංසන්දන්ති සමෙන්ති. සම්මාසංකප්පා -පෙ- සම්මාවාචා -පෙ- සම්මාකම්මන්තා -පෙ- සම්මාආජීවා -පෙ- සම්මාවායාමා -පෙ- සම්මාසතිනො -පෙ- සම්මාසමාධිනො -පෙ- සම්මාඤාණිනො සම්මාඤාණීහි සද්ධිං සංසන්දන්ති සමෙන්ති. සම්මාවිමුත්තිනො{2 විමුත්තිකා - සීමු.} සම්මාවිමුත්තීහි සද්ධිං සංසන්දන්ති සමෙන්තීති."
            },
            {
                "type": "centered",
                "text": "(සබ්බත්ථ අතීතානාගත පච්චුප්පන්නං කාතබ්බං.)",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**සත්තන්නං සුත්තන්තානං උද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "අසමාහිතං දුස්සීලං පඤ්චසික්ඛාපදානි ච,\nසත්තකම්මපථං වුත්තා දසකම්මපථෙන ච,\nඡට්ඨං අට්ඨඞ්ගිකං වුත්තං දසඞ්ගිකෙන{3 දසඞ්ගෙහි - සීමු. 1, 2. දසහි අඞ්ගෙහි ච - ස්යා.} සත්තමන්ති."
            },
            {
                "type": "centered",
                "text": "කම්මපථවග්ගො තතියො.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "264"
            },
            {
                "type": "heading",
                "text": "4. චතුධාතුවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "2. 4. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "චතුධාතුසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "254. එවං මෙ සුතං: එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ -පෙ-"
            },
            {
                "type": "paragraph",
                "text": "චතස්සො ඉමා භික්ඛවෙ, ධාතුයො. කතමා චතස්සො? පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතු. ඉමා ඛො භික්ඛවෙ, චතස්සො ධාතුයොති."
            },
            {
                "type": "centered",
                "text": "2. 4. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පුබ්බසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "255. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "පුබ්බෙව මෙ භික්ඛවෙ, සම්බොධා අනභිසම්බුද්ධස්ස බොධිසත්තස්සෙව සතො එතදහොසි: කො නු ඛො පඨවීධාතුයා අස්සාදො කො ආදීනවො කිං නිස්සරණං? කො ආපොධාතුයා අස්සාදො කො ආදීනවො කිං නිස්සරණං? කො තෙජොධාතුයා අස්සාදො කො ආදීනවො කිං නිස්සරණං? කො වායොධාතුයා අස්සාදො කො ආදීනවො කිං නිස්සරණන්ති?"
            },
            {
                "type": "paragraph",
                "text": "තස්ස මය්හං භික්ඛවෙ, එතදහොසි: යං ඛො පඨවීධාතුං පටිච්ච උප්පජ්ජති සුඛං සොමනස්සං, අයං පඨවීධාතුයා අස්සාදො, යං පඨවීධාතු{1 යා පඨවිධාතු - සීමු. යා පඨවිධාතුයා - සී 1, 2.} අනිච්චා දුක්ඛා විපරිණාමධම්මා, අයං පඨවීධාතුයා ආදීනවො. යො පඨවීධාතුයා ඡන්දරාගවිනයො ඡන්දරාගප්පහාණං, ඉදං පඨවීධාතුයා නිස්සරණං. යං ආපොධාතුං පටිච්ච -පෙ- යං තෙජොධාතුං පටිච්ච -පෙ- යං වායොධාතුං පටිච්ච උප්පජ්ජති සුඛං සොමනස්සං, අයං වායොධාතුයා අස්සාදො. යං වායොධාතු{2 යා වායොධාතු - සීමු. යා වායොධාතුයා - සී 1, 2.} අනිච්චා දුක්ඛා විපරිණාමධම්මා, අයං වායොධාතුයා ආදීනවො. යො වායොධාතුයා ඡන්දවිරාගවිනයො ඡන්දරාගප්පහාණං, ඉදං වායොධාතුයා නිස්සරණං."
            },
            {
                "type": "paragraph",
                "text": "යාවකීවඤ්චාහං භික්ඛවෙ, ඉමාසං චතුන්නං ධාතූනං එවං අස්සාදඤ්ච අස්සාදතො ආදීනවඤ්ච ආදීනවතො නිස්සරණඤ්ච නිස්සරණතො යථාභූතං නාබ්භඤ්ඤාසිං, නෙව තාවාහං භික්ඛවෙ, සදෙවකෙ ලොකෙ සමාරකෙ සබ්රහ්මකෙ, සස්සමණබ්රාහ්මණියා පජාය සදෙවමනුස්සාය අනුත්තරං සම්මාසම්බොධිං අභිසම්බුද්ධො පච්චඤ්ඤාසිං.{3 අභිසම්බුද්ධොති පච්චඤ්ඤාසිං - මඡසං.}"
            },
            {
                "type": "page-break",
                "text": "266"
            },
            {
                "type": "paragraph",
                "text": "යතො ච ඛොහං භික්ඛවෙ, ඉමාසං චතුන්නං ධාතූනං එවං අස්සාදඤ්ච අස්සාදතො ආදීනවඤ්ච ආදීනවතො නිස්සරණඤ්ච නිස්සරණතො යථාභූතං අබ්භඤ්ඤාසිං, අථාහං භික්ඛවෙ, සදෙවකෙ ලොකෙ සමාරකෙ සබ්රහ්මකෙ, සස්සමණබ්රාහ්මණියා පජාය සදෙව මනුස්සාය අනුත්තරං සම්මාසම්බොධිං අභිසම්බුද්ධො පච්චඤ්ඤාසිං. ඤාණඤ්ච පන මෙ දස්සනං උදපාදි: “අකුප්පා මෙ චෙතොවිමුත්ති{1 අකුප්පා මෙ විමුත්ති - මඡසං. ස්යා. සී. 2.} අයමන්තිමා ජාති. නත්ථිදානි පුනබ්භවො”ති."
            },
            {
                "type": "centered",
                "text": "2. 4. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අස්සාදපරියෙසනසුත්තං{2 අචරිංසුත්තං - මඡසං. PTS.}",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "256. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "පඨවීධාතුයාහං භික්ඛවෙ, අස්සාදපරියෙසනං අචරිං. යො පඨවීධාතුයා අස්සාදො, තදජ්ඣගමං. යාවතා පඨවීධාතුයා අස්සාදො, පඤ්ඤාය මෙ සො සුදිට්ඨො. පඨවීධාතුයාහං භික්ඛවෙ, ආදීනවපරියෙසනං අචරිං. යො පඨවීධාතුයා ආදීනවො, තදජ්ඣගමං. යාවතා පඨවීධාතුයා ආදීනවො, පඤ්ඤාය මෙ සො සුදිට්ඨො. පඨවීධාතුයාහං භික්ඛවෙ, නිස්සරණපරියෙසනං අචරිං. යං පඨවීධාතුයා නිස්සරණං, තදජ්ඣගමං. යාවතා පඨවීධාතුයා නිස්සරණං, පඤ්ඤාය මෙ තං සුදිට්ඨං."
            },
            {
                "type": "paragraph",
                "text": "ආපොධාතුයාහං භික්ඛවෙ -පෙ- මෙ තං සුදිට්ඨං. තෙජොධාතුයාහං භික්ඛවෙ -පෙ- මෙ තං සුදිට්ඨං. වායොධාතුයාහං භික්ඛවෙ, අස්සාදපරියෙසනං අචරිං. යො වායොධාතුයා අස්සාදො, තදජ්ඣගමං. යාවතා වායොධාතුයා අස්සාදො, පඤ්ඤාය මෙ සො සුදිට්ඨො. වායොධාතුයාහං භික්ඛවෙ, ආදීනවපරියෙසනං අචරිං. යො වායොධාතුයා ආදීනවො, තදජ්ඣගමං. යාවතා වායොධාතුයා ආදීනවො පඤ්ඤාය මෙ සො සුදිට්ඨො. වායොධාතුයාහං භික්ඛවෙ, නිස්සරණපරියෙසනං අචරිං. යං වායොධාතුයා නිස්සරණං. තදජ්ඣගමං. යාවතා වායොධාතුයා නිස්සරණං, පඤ්ඤාය මෙ තං සුදිට්ඨං."
            },
            {
                "type": "paragraph",
                "text": "යාවකීවඤ්චාහං භික්ඛවෙ, ඉමාසං චතුන්නං ධාතූනං අස්සාදඤ්ච අස්සාදතො ආදීනවඤ්ච ආදීනවතො නිස්සරණඤ්ච නිස්සරණතො යථාභූතං නාබ්භඤ්ඤාසිං, නෙව තාවාහං භික්ඛවෙ, සදෙවකෙ ලොකෙ සමාරකෙ සබ්රහ්මකෙ, සස්සමණබ්රාහ්මණියා පජාය සදෙව මනුස්සාය අනුත්තරං සම්මාසම්බොධිං අභිසම්බුද්ධො පච්චඤ්ඤාසිං."
            },
            {
                "type": "page-break",
                "text": "268"
            },
            {
                "type": "paragraph",
                "text": "යතො ච ඛොහං භික්ඛවෙ, ඉමාසං චතුන්නං ධාතූනං අස්සාදඤ්ච අස්සාදතො ආදීනවඤ්ච ආදීනවතො නිස්සරණඤ්ච නිස්සරණතො යථාභූතං අබ්භඤ්ඤාසිං, අථාහං භික්ඛවෙ, සදෙවකෙ ලොකෙ සමාරකෙ සබ්රහ්මකෙ, සස්සමණබ්රාහ්මණියා පජාය සදෙවමනුස්සාය අනුත්තරං සම්මාසම්බොධිං අභිසම්බුද්ධොති පච්චඤ්ඤාසිං. ඤාණඤ්ච පන මෙ දස්සනං උදපාදි: “අකුප්පා මෙ චෙතොවිමුත්ති. අයමන්තිමා ජාති. නත්ථිදානි පුනබ්භවො”ති."
            },
            {
                "type": "centered",
                "text": "2. 4. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නොචෙදංසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "257. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "නො චෙදං භික්ඛවෙ, පඨවීධාතුයා අස්සාදො අභවිස්ස, නයිදං සත්තා පඨවීධාතුයං සාරජ්ජෙය්යුං. යස්මා ච ඛො භික්ඛවෙ, අත්ථි පඨවීධාතුයා අස්සාදො, තස්මා සත්තා පඨවීධාතුයා සාරජ්ජන්ති. නො චෙදං භික්ඛවෙ, පඨවීධාතුයා ආදීනවො අභවිස්ස, නයිදං සත්තා පඨවීධාතුයා නිබ්බින්දෙය්යුං. යස්මා ච ඛො භික්ඛවෙ, අත්ථි පඨවීධාතුයා ආදීනවො, තස්මා සත්තා පඨවීධාතුයා නිබ්බින්දන්ති. නො චෙදං භික්ඛවෙ, පඨවීධාතුයා නිස්සරණං අභවිස්ස, නයිදං සත්තා පඨවීධාතුයා නිස්සරෙය්යුං. යස්මා ච ඛො භික්ඛවෙ, අත්ථි පඨවීධාතුයා නිස්සරණං, තස්මා සත්තා පඨවීධාතුයා නිස්සරන්ති."
            },
            {
                "type": "paragraph",
                "text": "නො චෙදං භික්ඛවෙ, ආපොධාතුයා අස්සාදො අභවිස්ස -පෙ- නිස්සරන්ති. නො චෙදං භික්ඛවෙ, තෙජොධාතුයා අස්සාදො අභවිස්ස -පෙ- නිස්සරන්ති. නො චෙදං භික්ඛවෙ, වායොධාතුයා අස්සාදො අභවිස්ස, නයිදං සත්තා වායොධාතුයා සාරජ්ජෙය්යුං. යස්මා ච ඛො භික්ඛවෙ, අත්ථි වායොධාතුයා අස්සාදො, තස්මා සත්තා වායොධාතුයා සාරජ්ජන්ති. නො චෙදං භික්ඛවෙ, වායොධාතුයා ආදීනවො අභවිස්ස, නයිදං සත්තා වායොධාතුයා නිබ්බින්දෙය්යුං. යස්මා ච ඛො භික්ඛවෙ, අත්ථි වායොධාතුයා ආදීනවො, තස්මා සත්තා වායොධාතුයා නිබ්බින්දන්ති. නො චෙදං භික්ඛවෙ, වායොධාතුයා නිස්සරණං අභවිස්ස, නයිදං සත්තා වායොධාතුයා නිස්සරෙය්යුං. යස්මා ච ඛො භික්ඛවෙ, අත්ථි වායොධාතුයා නිස්සරණං, තස්මා සත්තා වායොධාතුයා නිස්සරන්ති."
            },
            {
                "type": "page-break",
                "text": "270"
            },
            {
                "type": "paragraph",
                "text": "යාවකීවඤ්ච භික්ඛවෙ, සත්තා ඉමාසං චතුන්නං ධාතූනං අස්සාදඤ්ච අස්සාදතො ආදීනවඤ්ච ආදීනවතො නිස්සරණඤ්ච නිස්සරණතො යථාභූතං නාබ්භඤ්ඤාසුං{1 නාබ්භඤ්ඤංසු - ස්යා. මඡසං. PTS.}, නෙව තාවිමෙ භික්ඛවෙ, සත්තා සදෙවකා ලොකා සමාරකා සබ්රහ්මකා, සස්සමණබ්රාහ්මණී පජා සදෙවමනුස්සා{2 සස්සමණබ්රාහ්මණියා පජාය සදෙවමනුස්සාය - මඡසං. PTS. සී 1, 2.} නිස්සටා විසඤ්ඤුත්තා විප්පමුත්තා විමරියාදිකතෙන චෙතසා විහරිංසු."
            },
            {
                "type": "paragraph",
                "text": "යතො ච ඛො භික්ඛවෙ, සත්තා ඉමාසං චතුන්නං ධාතූනං අස්සාදඤ්ච අස්සාදතො ආදීනවඤ්ච ආදීනවතො නිස්සරණඤ්ච නිස්සරණතො යථාභූතං අබ්භඤ්ඤාසුං, අථ භික්ඛවෙ, සත්තා සදෙවකා ලොකා සමාරකා සබ්රහ්මකා, සස්සමණබ්රාහ්මණී පජා සදෙවමනුස්සා{3 සස්සමණබ්රාහ්මණියා පජාය සදෙවමනුස්සාය - මඡසං. PTS. සී 1, 2.} නිස්සටා විසඤ්ඤුත්තා විප්පමුත්තා විමරියාදිකතෙන චෙතසා විහරන්තීති."
            },
            {
                "type": "centered",
                "text": "2. 4. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුක්ඛලඞ්කණසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "258. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "පඨවීධාතු ච{4 චෙ - මඡසං. PTS. ධාතුඤ්ච - ස්යා.} හිදං භික්ඛවෙ, එකන්තදුක්ඛා අභවිස්ස දුක්ඛානුපතිතා දුක්ඛාවක්කන්තා අනවක්කන්තා සුඛෙන, නයිදං සත්තා පඨවීධාතුයා සාරජ්ජෙය්යුං. යස්මා ච ඛො භික්ඛවෙ, පඨවීධාතු සුඛා සුඛානුපතිතා සුඛාවක්කන්තා අනවක්කන්තා දුක්ඛෙන, තස්මා සත්තා පඨවීධාතුයා සාරජ්ජන්ති. ආපොධාතු ච හිදං භික්ඛවෙ, -පෙ- තෙජොධාතු ච හිදං භික්ඛවෙ, -පෙ- වායොධාතු ච හිදං භික්ඛවෙ, එකන්තදුක්ඛා අභවිස්ස දුක්ඛානුපතිතා දුක්ඛාවක්කන්තා අනවක්කන්තා සුඛෙන, නයිදං සත්තා වායොධාතුයා සාරජ්ජෙය්යුං. යස්මා ච ඛො භික්ඛවෙ, වායොධාතු සුඛා සුඛානුපතිතා සුඛාවක්කන්තා අනවක්කන්තා දුක්ඛෙන, තස්මා සත්තා වායොධාතුයා සාරජ්ජන්ති."
            },
            {
                "type": "paragraph",
                "text": "පඨවීධාතු ච හිදං භික්ඛවෙ, එකන්තසුඛා අභවිස්ස සුඛානුපතිතා සුඛාවක්කන්තා අනවක්කන්තා දුක්ඛෙන, නයිදං සත්තා පඨවීධාතුයා නිබ්බින්දෙය්යුං. යස්මා ච ඛො භික්ඛවෙ, පඨවීධාතු දුක්ඛා දුක්ඛානුපතිතා. දුක්ඛාවක්කන්තා අනවක්කන්තා සුඛෙන, තස්මා සත්තා පඨවීධාතුයා නිබ්බින්දන්ති. ආපොධාතු ච හිදං භික්ඛවෙ, -පෙ- තෙජොධාතු ච හිදං භික්ඛවෙ, -පෙ- වායොධාතු ච හිදං භික්ඛවෙ, එකන්තසුඛා අභවිස්ස සුඛානුපතිතා සුඛාවක්කන්තා අනවක්කන්තා දුක්ඛෙන, නයිදං සත්තා වායොධාතුයා නිබ්බින්දෙය්යුං. යස්මා ච ඛො භික්ඛවෙ, වායොධාතු දුක්ඛා දුක්ඛානුපතිතා දුක්ඛාවක්කන්තා අනවක්කන්තා සුඛෙන, තස්මා සත්තා වායොධාතුයා නිබ්බින්දන්තීති."
            },
            {
                "type": "page-break",
                "text": "272"
            },
            {
                "type": "centered",
                "text": "2. 4. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අභිනන්දනසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "259. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "යො භික්ඛවෙ, පඨවීධාතුං අභිනන්දති, දුක්ඛං සො අභිනන්දති. යො දුක්ඛං අභිනන්දති, අපරිමුත්තො සො දුක්ඛස්මාති වදාමි. යො ආපොධාතුං අභිනන්දති -පෙ- යො තෙජොධාතුං අභිනන්දති -පෙ- යො වායොධාතුං අභිනන්දති, දුක්ඛං සො අභිනන්දති. යො දුක්ඛං අභිනන්දති, අපරිමුත්තො සො දුක්ඛස්මාති වදාමි."
            },
            {
                "type": "paragraph",
                "text": "යො ච ඛො භික්ඛවෙ, පඨවීධාතුං නාභිනන්දති, දුක්ඛං සො නාභිනන්දති. යො දුක්ඛං නාභිනන්දති, පරිමුත්තො සො දුක්ඛස්මාති වදාමි. යො ආපොධාතුං -පෙ- යො තෙජොධාතුං -පෙ- යො වායොධාතුං නාභිනන්දති, දුක්ඛං සො නාභිනන්දති. යො දුක්ඛං නාභිනන්දති, පරිමුත්තො සො දුක්ඛස්මාති වදාමීති."
            },
            {
                "type": "centered",
                "text": "2. 4. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "උප්පාදසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "260. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "යො භික්ඛවෙ, පඨවීධාතුයා උප්පාදො ඨිති අභිනිබ්බත්ති පාතුභාවො, දුක්ඛස්සෙසො උප්පාදො, රොගානං ඨිති, ජරාමරණස්ස පාතුභාවො. යො ආපොධාතුයා -පෙ- යො තෙජොධාතුයා -පෙ- යො වායොධාතුයා උප්පාදො ඨිති අභිනිබ්බත්ති පාතුභාවො, දුක්ඛස්සෙසො උප්පාදො, රොගානං ඨිති, ජරාමරණස්ස පාතුභාවො."
            },
            {
                "type": "paragraph",
                "text": "යො ච ඛො භික්ඛවෙ, පඨවීධාතුයා නිරොධො වූපසමො අත්ථඞ්ගමො{1 අත්ථගමො - සී 1, 2. PTS.} දුක්ඛස්සෙසො නිරොධො, රොගානං වූපසමො, ජරාමරණස්ස අත්ථඞ්ගමො. යො ආපොධාතුයා -පෙ- යො තෙජොධාතුයා -පෙ- යො වායොධාතුයා නිරොධො වූපසමො අත්ථඞ්ගමො, දුක්ඛස්සෙසො නිරොධො, රොගානං වූපසමො, ජරාමරණස්ස අත්ථඞ්ගමොති."
            },
            {
                "type": "centered",
                "text": "2. 4. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සමණබ්රාහ්මණසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "261. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "චතස්සො ඉමා භික්ඛවෙ, ධාතුයො. කතමා චතස්සො? පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතු."
            },
            {
                "type": "paragraph",
                "text": "යෙ හි කෙචි භික්ඛවෙ, සමණා වා බ්රාහ්මණා වා ඉමාසං චතුන්නං ධාතූනං අස්සාදඤ්ච ආදීනවඤ්ච නිස්සරණඤ්ච යථාභූතං නප්පජානන්ති, නමෙතෙ භික්ඛවෙ, සමණා වා බ්රාහ්මණා වා සමණෙසු වා සමණසම්මතා, බ්රාහ්මණෙසු වා බ්රාහ්මණසම්මතා. න ච පන තෙ ආයස්මන්තො සාමඤ්ඤත්ථං වා බ්රහ්මඤ්ඤත්ථං වා දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරන්ති."
            },
            {
                "type": "page-break",
                "text": "274"
            },
            {
                "type": "paragraph",
                "text": "යෙ ච ඛො කෙචි භික්ඛවෙ, සමණා වා බ්රාහ්මණා වා ඉමාසං චතුන්නං ධාතූනං අස්සාදඤ්ච ආදීනවඤ්ච නිස්සරණඤ්ච යථාභූතං පජානන්ති, තෙ ච ඛොමෙ භික්ඛවෙ, සමණා වා බ්රාහ්මණා වා සමණෙසු චෙව{1 ච - සී මු.} සමණසම්මතා බ්රාහ්මණෙසු ච බ්රාහ්මණ සම්මතා. තෙ ච පනායස්මන්තො සාමඤ්ඤත්ථඤ්ච බ්රහ්මඤ්ඤත්ථඤ්ච දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරන්තීති."
            },
            {
                "type": "centered",
                "text": "2. 4. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතියසමණබ්රාහ්මණසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "262. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "චතස්සො ඉමා භික්ඛවෙ, ධාතුයො. කතමා චතස්සො? පඨවීධාතු ආපොධාතු තෙජොධාතු වායොධාතු. යෙ හි කෙචි භික්ඛවෙ, සමණා වා බ්රාහ්මණා වා ඉමාසං චතුන්නං ධාතූනං සමුදයඤ්ච අත්ථඞ්ගමඤ්ච අස්සාදඤ්ච ආදීනවඤ්ච නිස්සරණඤ්ච යථාභූතං නප්පජානන්ති -පෙ- යථාභූතං පජානන්ති, තෙ -පෙ- සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරන්තීති."
            },
            {
                "type": "centered",
                "text": "2. 4. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තතියසමණබ්රාහ්මණසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "263. **සාවත්ථියං-**"
            },
            {
                "type": "paragraph",
                "text": "යෙ හි කෙචි භික්ඛවෙ, සමණා වා බ්රාහ්මණා වා පඨවීධාතුං නප්පජානන්ති, පඨවීධාතුසමුදයං නප්පජානන්ති, පඨවීධාතුනිරොධං නප්පජානන්ති, පඨවීධාතුනිරොධගාමිනිං පටිපදං නප්පජානන්ති -පෙ- ආපොධාතුං නප්පජානන්ති -පෙ- තෙජොධාතුං නප්පජානන්ති -පෙ- වායොධාතුං නප්පජානන්ති, වායොධාතුසමුදයං නප්පජානන්ති, වායොධාතුනිරොධං නප්පජානන්ති, වායොධාතුනිරොධගාමිනිං පටිපදං නප්පජානන්ති, නමෙතෙ භික්ඛවෙ, සමණා වා බ්රාහ්මණා වා සමණෙසු වා සමණසම්මතා, බ්රාහ්මණෙසු වා බ්රාහ්මණසම්මතා. න ච පන තෙ ආයස්මන්තො සාමඤ්ඤත්ථං වා බ්රහ්මඤ්ඤත්ථං වා දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරන්ති."
            },
            {
                "type": "paragraph",
                "text": "යෙ ච ඛො කෙචි භික්ඛවෙ, සමණා වා බ්රාහ්මණා වා පඨවීධාතුං පජානන්ති, පඨවීධාතුසමුදයං පජානන්ති, පඨවීධාතුනිරොධං පජානන්ති පඨවීධාතුනිරොධගාමිනිං පටිපදං පජානන්ති -පෙ- ආපොධාතුං -පෙ- තෙජොධාතුං -පෙ- වායොධාතුං පජානන්ති, වායොධාතුසමුදයං පජානන්ති, වායොධාතුනිරොධං පජානන්ති, වායොධාතුනිරොධගාමිනිං පටිපදං පජානන්ති, තෙ ච ඛො මෙ භික්ඛවෙ, සමණා වා බ්රාහ්මණා වා සමණෙසු චෙව{2 ච - සී මු.} සමණසම්මතා බ්රාහ්මණෙසු ච බ්රාහ්මණසම්මතා. තෙ ච පනායස්මන්තො සාමඤ්ඤත්ථඤ්ච බ්රහ්මඤ්ඤත්ථඤ්ච දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරන්තීති."
            },
            {
                "type": "centered",
                "text": "චතුධාතුවග්ගො චතුත්ථො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තස්සුද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "චතුධාතුපුබ්බඅස්සාදා{3 චතස්සො පුබ්බෙ අචරිං - සබ්බත්ථ} නො චෙදං ච දුක්ඛෙන ච,\nඅභිනන්දනඤ්ච උප්පාදං තයො සමණබ්රාහ්මණාති."
            },
            {
                "type": "centered",
                "text": "ධාතුසංයුත්තං සමත්තං.",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ],
        "pages": {
            "222": {
                "pageNum": 222,
                "footnotesCount": 2
            },
            "224": {
                "pageNum": 224,
                "footnotesCount": 0
            },
            "226": {
                "pageNum": 226,
                "footnotesCount": 0
            },
            "228": {
                "pageNum": 228,
                "footnotesCount": 0
            },
            "230": {
                "pageNum": 230,
                "footnotesCount": 0
            },
            "232": {
                "pageNum": 232,
                "footnotesCount": 1
            },
            "234": {
                "pageNum": 234,
                "footnotesCount": 1
            },
            "236": {
                "pageNum": 236,
                "footnotesCount": 4
            },
            "238": {
                "pageNum": 238,
                "footnotesCount": 2
            },
            "240": {
                "pageNum": 240,
                "footnotesCount": 5
            },
            "242": {
                "pageNum": 242,
                "footnotesCount": 4
            },
            "244": {
                "pageNum": 244,
                "footnotesCount": 0
            },
            "246": {
                "pageNum": 246,
                "footnotesCount": 3
            },
            "248": {
                "pageNum": 248,
                "footnotesCount": 0
            },
            "250": {
                "pageNum": 250,
                "footnotesCount": 0
            },
            "252": {
                "pageNum": 252,
                "footnotesCount": 0
            },
            "254": {
                "pageNum": 254,
                "footnotesCount": 0
            },
            "256": {
                "pageNum": 256,
                "footnotesCount": 1
            },
            "258": {
                "pageNum": 258,
                "footnotesCount": 0
            },
            "260": {
                "pageNum": 260,
                "footnotesCount": 2
            },
            "262": {
                "pageNum": 262,
                "footnotesCount": 3
            },
            "264": {
                "pageNum": 264,
                "footnotesCount": 3
            },
            "266": {
                "pageNum": 266,
                "footnotesCount": 2
            },
            "268": {
                "pageNum": 268,
                "footnotesCount": 0
            },
            "270": {
                "pageNum": 270,
                "footnotesCount": 4
            },
            "272": {
                "pageNum": 272,
                "footnotesCount": 1
            },
            "274": {
                "pageNum": 274,
                "footnotesCount": 3
            }
        }
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "223"
            },
            {
                "format": 4,
                "text": "2. ධාතු සංයුක්තය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. නානත්‌ත වර්ගය",
                "level": 2
            },
            {
                "type": "centered",
                "text": "2. 1. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ධාතුනානත්‌ත සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "225. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, තොපට ධාතුනානාත්‌වය දේශනා කරන්නෙමි. එය අසවු, මැනවින් මෙනෙහි කරවු. දේශනා කරන්නෙමි යි ඒ භික්ෂූහු ”වහන්ස එසේ ය” යි භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වූහ. භාග්‍යවතුන් වහන්සේ මෙය වදාළසේක:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ධාතුනානාත්‌වය කිමෙක යත්: චක්ඛුධාතු ය, රූපධාතු ය, චක්ඛුවිඤ්ඤාණධාතු ය, සෝතධාතු ය, සද්දධාතු ය, සෝතවිඤ්ඤාණධාතු ය, ඝාණධාතු ය, ගන්ධධාතු ය, ඝාණවිඤ්ඤාණධාතු ය, ජීව්හාධාතු ය, රසධාතු ය, ජීව්හාවිඤ්ඤාණධාතු ය, කායධාතු ය, ඵොට්ඨබ්බධාතු ය, කායවිඤ්ඤාණධාතු ය, මනෝධාතු ය, ධම්මධාතු ය, මනෝවිඤ්ඤාණධාතු ය යි. මහණෙනි, මේ ධාතුනානාත්‌වය යි කියනු ලැබේ යි. ",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඵස්‌සනානත්‌ත සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "226. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ධාතුනානාත්‌වය නිසා එස්සනානාත්‌වය උපදී. මහණෙනි, ධාතුනානාත්‌වය කවරේ ද යත්: චක්ඛුධාතු ය, සෝතධාතු ය, ඝාණධාතු ය, ජීව්හාධාතු ය, කායධාතු ය, මනොධාතු ය යි. මහණෙනි, මෙය   ධාතුනානාත්‌ව ය යි කියනු ලැබේ. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, කෙසේ නම් ධාතුනානාත්‌වය නිසා එස්සනානාත්‌වය උපදී ද? මහණෙනි, චක්ඛුධාතුව නිසා චක්ඛුසම්ඵස්සය උපදී. සෝතධාතුව නිසා සෝතසම්ඵස්සය උපදී. ඝාණධාතුව නිසා ඝාණසම්ඵස්සය උපදී. ජීව්හාධාතුව නිසා ජීව්හාසම්ඵස්සය උපදී. කායධාතුව නිසා කායසම්ඵස්සය උපදී. මනෝධාතුව නිසා මනෝසම්ඵස්සය උපදී. මහණෙනි, මෙසෙයින් ධාතුනානාත්‌වය නිසා එස්සනානාත්‌වය උපදී යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නො ඵස්‌සනානත්‌ත සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "227. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ධාතුනානාත්‌වය නිසා එස්සනානාත්‌වය උපදී. එස්සනානාත්‌වය නිසා ධාතුනානාත්‌වය නූපදී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ධාතුනානාත්‌වය කවරේද යත්: චක්ඛුධාතු ය ... මනොධාතු ය යි. මහණෙනි, මේ ධාතුනානාත්‌වය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, කෙසේ නම් ධාතුනානාත්‌වය නිසා එස්සනානාත්‌වය උපදී ද? එස්සනානාත්‌වය නිසා ධාතුනානාත්‌වය නූපදී ද? මහණෙනි, චක්ඛුධාතුව නිසා චක්ඛුසම්ඵස්සය උපදී. චක්ඛුසම්ඵස්සය නිසා චක්ඛුධාතුව නූපදී … මනෝ ධාතුව නිසා මනෝසම්ඵස්සය උපදී. මනෝසම්ඵස්සය නිසා මනෝධාතුව නූපදී. මහණෙනි, මෙසේ ධාතුනානාත්‌වය නිසා ඵස්‌සනානාත්‌වය උපදී. එස්සනානාත්‌වය නිසා  ධාතුනානාත්‌වය නූපදී යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "225"
            },
            {
                "type": "centered",
                "text": "2. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "වේදනා සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "228. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ධාතුනානාත්‌වය නිසා ඵස්‌සනානාත්‌වය උපදී. ඵස්‌සනානාත්‌වය නිසා වේදනානානාත්‌වය උපදි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ධාතුනානාත්‌වය කවරේ ද යත්: චක්ඛුධාතු ය … මනෝ ධාතු යි මහණෙනි, මේ ධාතුනානාත්‌වය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, කෙසේ නම් ධාතුනානාත්‌වය නිසා ඵස්‌සනානාත්‌වය උපදී ද? ඵස්‌සනානාත්‌වය නිසා වේදනානානාත්‌වය උපදී ද? මහණෙනි, චක්ඛුධාතුව නිසා චක්ඛුසම්පස්සය උපදී. චක්ඛුසම්ඵස්සය නිසා චක්ඛුසම්ඵස්සයෙන් හටගත් වේදනාව උපදී … මනෝධාතුව නිසා මනෝසම්ඵස්සය උපදී. මනෝසම්ඵස්සය නිසා මනෝසම්ඵස්සයෙන් උපන් වේදනා උපදී. මහණෙනි, මෙසේ ධාතුනානාත්වය නිසා ඵස්සනානාත්වය උපදී. ඵස්සනානාත්වය නිසා වේදනානානාත්වය උපදී යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නොවෙදනා සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "229. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ධාතුනානාත්‌වය නිසා ඵස්‌සනානාත්‌වය උපදී. එස්සනනාත්වය නිසා වේදනානාත්‌වයක් උපදී. වේදනානානාත්‌වය නිසා එස්සනානාත්වය නූපදී. එස්සනානාත්වය නිසා ධාතුනානාත්‌වය නූපදී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ධාතුනානාත්‌වය කවරේ ද යත්: චක්ඛුධාතු ය … මනෝ ධාතු යි. මහණෙනි, මේ ධාතුනානාත්‌වය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, කෙසේ නම් ධාතුනානාත්‌වය නිසා ඵස්‌සනානාත්‌වය උපදී ද? ඵස්‌සනානාත්‌වය නිසා වේදනානානත්වය උපදී ද? වේදනානානාත්වය නිසා ඵස්‌සනානාත්‌වය නූපදී ද?. ඵස්‌සනානාත්‌වය නිසා ධාතුනානාත්‌වය නූපදී ද? මහණෙනි, චක්ඛුධාතුව නිසා චක්ඛුසම්ඵස්සය උපදී. චක්ඛුසම්ඵස්සය නිසා චක්ඛුසම්ඵස්සයෙන් හටගත් වේදනාව උපදි. චක්ඛුසම්ඵස්සයෙන් හටගත් වෙදනාව නිසා චක්ඛුසම්ඵස්සය නූපදී. චක්ඛුසම්ඵස්සය නිසා චක්ඛුධාතුව නූපදී … මනෝධාතුව නිසා මනෝසම්ඵස්සය උපදී. මනෝසම්ඵස්සය නිසා මනෝසම්ඵස්සයෙන් හටගත් වේදනාව උපදී. මනෝසම්ඵස්සයෙන් හටගත් වේදනාව නිසා මනෝසම්ඵස්සය නූපදී. මනෝසම්ඵස්සය නිසා මනෝධාතුව නූපදී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මෙසේ ධාතුනානාත්‌වය නිසා එස්සනානාත්වය උපදී. එස්සනනාත්වය නිසා වේදනානානත්වය උපදී. වේදනානානාත්වය නිසා එස්සනානාත්වය නූපදී. එස්සනනාත්වය නිසා ධාතුනානාත්‌වය නූපදි යි. ",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "බාහිරධාතුනානත්‌ත සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "230. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, තොපට ධාතුනානාත්‌වය දේශනා කරන්නෙමි. එය අසවු දේශනා කරන්නෙමි. මහණෙනි, ධාතුනානාත්‌වය කවරේ ද යත්: රූපධාතු ය, සද්දධාතු ය, ගන්ධධාතු ය, රසධාතු ය, ඵොට්ඨබ්බධාතු ය, ධම්මධාතු යි. මහණෙනි, මෙය ධාතුනානාත්‌වය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පරියෙසනානානත්‌ත සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "231. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ධාතුනානාත්‌වය නිසා සංඥානානාත්‌වය උපදී. සංඥානානාත්‌වය නිසා සංකල්පනානාත්වය උපදී. සංකල්පනානාත්වය නිස ඡන්දනානාත්වය උපදී. ඡන්දනානාත්වය නිසා පරිදාහනානාත්වය උපදී. පරිදාහනානාත්වය නිසා පර්යේෂණානානාත්‌වය උපදී. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ධාතුනානාත්‌වය කවරේ ද යත්: රූපධතු ය, ධම්මධාතු යි. මහණෙනි, මේ ධාතුනානාත්‌වය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, කෙසේ නම් ධාතුනානාත්‌වය නිසා සංඥානානාත්‌වය උපදී ද, සංඥානානාත්‌වය නිසා සංකල්පනානාත්වය උපදී ද, සංකල්පනානාත්වය නිසා ඡන්දනානාත්වය උපදී ද, ඡන්දනානාත්වය නිසා පරිදාහනානත්වය උපදී ද, පරිදාහනානත්වය නිසා පර්යේෂණානානාත්‌වය උපදී ද? ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, රූපධාතුව නිසා රූපසංඥාව උපදී. රූපසංඥාව නිසා රූපසංකල්පය උපදී. රූපසංකල්පය නිසා රූපච්ඡන්දය උපදී. රූපච්ඡන්දය නිසා රූපපරිදාහය උපදී. රූපපරිදාහය නිසා රූපපර්යේෂණාව උපදී. මහණෙනි, සද්දධාතුව නිසා … මහණෙනි, ධර්මධාතුව නිසා ධර්මසංඥාව උපදී. ධර්මසංඥාව නිසා ධර්මසඞ්කල්පය උපදී. ධර්මසඞ්කල්පය නිසා ධර්මච්ඡන්දය උපදී. ධර්මච්ඡන්දය නිසා ධර්මපරිදාහය උපදී. ධර්මපරිදාහය නිසා ධර්මපර්යේෂණාව උපදී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මෙසේ ධාතුනානාත්‌වය නිසා සංඥානානාත්‌වය උපදී. සංඥානානාත්‌වය නිසා සඞ්කල්පනානාත්වය උපදී. සඞ්කල්පනානාත්වය නිසා ඡන්දනානත්වය උපදී. ඡන්දනානත්වය නිසා පරිදාහනානත්වය උපදී. පරිදාහනානත්වය නිසා පර්යේෂණානානාත්‌වය උපදී යි. ",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නො පරියෙසනානානත්‌ත සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "232. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ධාතුනානාත්‌වය නිසා සංඥානානාත්‌වය උපදී. සංඥානානාත්‌වය නිසා සඞ්කල්පනානාත්වය උපදී. සඞ්කල්පනානාත්වය නිසා ඡන්දනානත්වය උපදී. ඡන්දනානත්වය නිසා පරිදාහනානාත්වය උපදී. පරිදාහනානාත්වය නිසා පර්යේෂණානානාත්‌වය උපදී. පර්යේෂණානානාත්‌වය නිසා පරිදාහනානාත්වය නූපදී. පරිදාහනානාත්වය නිසා ඡන්දනානාත්වය නූපදී. ඡන්දනානාත්වය නිසා සඞ්කල්පනානාත්වය නූපදී. සඞ්කල්පනානාත්වය නිසා සංඥානානාත්‌වය නූපදී. සංඥානානාත්‌වය නිසා ධාතුනානාත්‌වය නූපදී. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ධාතුනානාත්‌වය කවරේද යත්: රූපධාතු… ධර්මධාතු යි. මහණෙනි, මේ ධාතුනානාත්‌වය යි කියනු ලැබේ. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, කෙසේ නම් ධාතුනානාත්‌වය නිසා සංඥානානාත්‌වය උපදී ද, සංඥානානාත්‌වය නිසා පර්යේෂණානානාත්‌වය උපදී ද, පර්යේෂණානානාත්‌වය නිසා පරිදාහනානාත්‌වය නූපදී ද, පරිදාහනානාත්‌වය නිසා ඡන්දනානත්වයය නූපදී ද, ඡන්දනානත්වය නිසා සඞ්කල්පනානාත්‌වය නූපදී ද, සඞ්කල්පනානාත්‌වය නිසා සංඥානානාත්‌වය නූපදී ද, සංඥානානාත්‌වය නිසා ධාතුනානාත්‌වය නූපදී ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, රූපධාතුව නිසා රූපසඤ්ඤාව උපදී. රූපසඤ්ඤාව නිසා රූපසඞ්කප්පය උපදී. රූපසඞ්කප්පය නිසා රූපච්ඡන්දය උපදී. රූපච්ඡන්දය නිසා රූපපරිළාභය උපදී. රූපපරිළාභය නිසා රූපපරියෙසනාව උපදී. රූපපරියෙසනාව නිසා රූපපරිළාභය නූපදී. රූපපරිළාභය නිසා රූපච්ඡන්දය නූපදී. රූපච්ඡන්දය නිසා රූපසඞ්කප්පය නූපදී. රූපසඞ්කප්පය නිසා රූපසඤ්ඤාව නූපදී. රූපසඤ්ඤාව නිසා රූපධාතුව නූපදී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සද්දධාතුව නිසා … මහණෙනි, ධම්මධාතුව නිසා ධර්මසංඥාව උපදී. ධර්මසංඥාව නිසා ධර්මසඞ්කල්පය උපදී. ධර්මසඞ්කල්පය නිසා ධර්මච්ඡන්දය උපදී. ධර්මච්ඡන්දය නිසා ධර්මපරිදාහය උපදී. ධර්මපරිදාහය නිසා ධර්මපර්යේෂණාව උපදී. ධර්මපර්යේෂණාව නිසා ධර්මපරිදාහය නූපදී. ධර්මපරිදාහය නිසා ධර්මච්ඡන්දය නූපදී. ධර්මච්ඡන්දය නිසා ධර්මසඞ්කල්පය නූපදී. ධර්මසඞ්කල්පය නිසා ධර්මසංඥාව නූපදී. ධර්මසංඥාව නිසා ධර්මධාතුව නූපදී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මෙසේ ධාතුනානාත්‌වය නිසා සංඥානානාත්‌වය උපදී. සංඥානානාත්‌වය නිසා … පර්යෙෂණානානාත්‌වය උපදී. පර්යෙෂණානානාත්‌වය නිසා පරිදාහනානාත්‌වය නූපදී. පරිදාහනානාත්‌වය නිසා ඡන්දනානත්වය නූපදී. ඡන්දනානත්වය නිසා සඞ්කල්පනානාත්‌වය නූපදී. සඞ්කල්පනානාත්‌වය නිසා සංඥානානාත්‌වය නූපදී. සංඥානානාත්‌වය නිසා ධාතුනානාත්‌වය නූපදී යි.    ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "231"
            },
            {
                "type": "centered",
                "text": "2. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ලාභනානත්‌ත සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "233. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ධාතුනානාත්‌වය නිසා සංඥානානාත්‌වය උපදී. සංඥානානාත්‌වය නිසා සඞ්කල්පනානාත්‌වය උපදී. සඞ්කල්පනානාත්‌වය නිසා එස්සනානාත්‌වය උපදී. එස්සනානාත්‌වය නිසා වෙදනානානාත්‌වය උපදී. වෙදනානානාත්‌වය නිසා ඡන්දනානත්වය උපදී. ඡන්දනානාත්වය නිසා පරිදාහනානාත්‌වය උපදී. පරිදාහනානාත්‌වය නිසා පර්යෙෂණානානාත්වය උපදී. පර්යෙෂණානානාවය නිසා ලාභනානාත්‌වය උපදී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ධාතුනානාත්‌වය කවරේ ද යත්: රූපධාතු ය … ධම්මධාතු යි. මහණෙනි, මේ ධාතුනානාත්‌වය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, කෙසේ නම් ධාතුනානාත්‌වය නිසා සංඥානානාත්‌වය උපදී ද, සංඥානානාත්‌වය නිසා … ලාභනානාත්‌වය උපදී ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, රූපධාතුව නිසා රූපසංඥාව උපදී. රූපසංඥාව නිසා රූපසඞ්කල්පය උපදී. රූපසඞ්කල්පය  නිසා රූපසම්ඵස්සය උපදී. රූපසම්ඵස්සය නිසා රූපසම්ඵස්සයෙන් හටගත් වෙදනාව උපදී. රූපසම්ඵස්සයෙන් හටගත් වෙදනා නිසා රූපච්ඡන්දය උපදී. රූපච්ඡන්දය නිසා රූපපරිදාහය උපදී. රූපපරිදාහය නිසා රූපපර්යේෂණාව උපදී. රූපපර්යේෂණාව නිසා රූපලාභය උපදී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සද්දධාතුව නිසා … මහණෙනි, ධම්මධාතුව නිසා ධම්මසඤ්ඤාව උපදී. ධම්මසඤ්ඤාව නිසා ධම්මසඞ්කප්පය උපදී. ධම්මසඞ්කප්පය නිසා ධම්මසම්ඵස්සය උපදී. ධම්මසම්ඵස්සය නිසා ධම්මසම්ඵස්සයෙන් හටගත් වෙදනාව උපදී. ධම්මසම්ඵස්සයෙන් හටගත් වෙදනාව නිසා ධම්මච්ඡන්දය උපදී. ධම්මච්ඡන්දය නිසා ධම්මපරිළාහය උපදී. ධම්මපරිළාහය නිසා ධම්මපරියෙසනාව උපදී. ධම්මපරියෙසනාව නිසා ධම්මලාභය උපදී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මෙසේ ධාතුනානාත්‌වය නිසා සංඥානානාත්‌වය උපදී. සංඥානානාත්‌වය නිසා .. ලාභනානාත්‌වය උපදී යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නොලාභනානත්‌ත සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "234. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ධාතුනානාත්‌වය නිසා සංඥානානාත්‌වය උපදී. සංඥානානාත්‌වය නිසා සඞ්කල්පනානාත්‌වය උපදී. ස්පර්ශ...වෙදනා...ඡන්ද...පරිදාහ...පර්යේෂණානානාත්‌වය උපදී. පර්යේෂණානානාත්‌වය නිසා ලාභනානාත්‌වය උපදී. ලාභනානාත්‌වය නිසා පර්යේෂණානානාත්‌වය නූපදී. පර්යේෂණානානාත්‌වය නිසා පරිදාහනානාත්‌වය නූපදී. පරිදාහනානත්වය නිසා ඡන්ද වෙදනා ස්පර්ශ සංකල්ප සංඥානානාත්‌වය …. සංඥානානාත්‌වය නිසා ධාතුනානාත්‌වය නූපදී. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "233"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ධාතුනානාත්‌වය කවරේ ද යත්: රූපධාතු ය ධම්මධාතු යි. මහණෙනි, මේ ධාතුනානාත්‌වය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, කෙසේ නම් ධාතුනානාත්‌වය නිසා සංඥානානාත්‌වය උපදී ද, සංඥානානාත්‌වය නිසා සඞ්කල්පනානාත්‌වය උපදී ද , ස්පර්ශ … වේදනා … ඡන්ද….පරිදාහ … පර්යේෂණා ලාභ ලාභනානාත්‌වය නිසා පර්යේෂණානානාත්‌වය නූපදී ද, පර්යේෂණානානාත්‌වය නිසා පරිදාහනානාත්‌වය නූපදී ද, ඡන්ද … වේදනා … ස්පර්ශ … සඞ්කල්පනානාත්‌වය නිසා සංඥානානාත්‌වය නූපදී ද, සංඥානානාත්‌වය නිසා ධාතුනානාත්‌වය නූපදී ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, රූපධාතුව නිසා රූපසංඥාව උපදී … සද්දධාතුව … ගන්ධධාතුව රසධාතුව ... ඵොට්ඨබ්බධාතුව… මහණෙනි, ධර්මධාතුව නිසා ධර්මසංඥාව උපදී. ධර්මසංඥාව නිසා … ධර්මපර්යේෂණාව උපදී. ධර්මපර්යේෂණාව නිසා ධර්මලාභය උපදී. ධර්මලාභය නිසා ධර්මපර්යේෂණාව නූපදී. ධර්මපර්යේෂණාව නිසා ධර්මපරිදාහය නූපදී. ධර්මපරිදාහය නිසා ධර්මච්ඡන්දය නූපදී. ධර්මච්ඡන්දය  නිසා ධර්මස්පර්ශයෙන් හටගත් වේදනාව නූපදී. ධර්මස්පර්ශයෙන් හටගත් වේදනාව නිසා ධර්මස්පර්ශය නූපදී. ධර්මස්පර්ශය නිසා ධර්මසඞ්කල්පය නූපදී. ධර්මසඞ්කල්පය නිසා ධම්සංඥාව නූපදී. ධර්මසංඥාව නිසා ධර්මධාතුව නූපදී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මෙසේ ධාතුනානාත්‌වය නිසා සංඥානානාත්‌වය උපදී. සංඥානානාත්‌වය නිසා සඞ්කල්ප ස්පර්ශ … වේදනා …ඡන්ද ... පරිදාහ …පර්යේෂණා… ලාභ …ලාභනානාත්‌වය නිසා පර්යේෂණානානාත්‌වය නූපදී. පර්යේෂණානානාත්‌වය නිසා පරිදාහනානාත්‌වය නූපදී. පරිදාහනානාත්‌වය නිසා ඡන්දනානාත්‌වය නූපදී. ඡන්දනානාත්‌වය නිසා වෙදනානාත්‌වය නූපදී. වෙදනානානාත්‌වය නිසා ස්පර්ශනානාත්‌වය නූපදී. ස්පර්ශනානාත්‌වය නිසා සඞ්කල්පනානාත්‌වය නූපදී. සඞ්කල්පනානාත්‌වය නිසා සංඥානානාත්‌වය නූපදී. සංඥානානාත්‌වය නිසා ධාතුනානාත්‌වය නූපදී යි.",
                "type": "paragraph"
            },
            {
                "format": 11,
                "text": "නානත්තවර්ගය පළමුවැනි යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 20,
                "text": "**එහි උද්දනය : **",
                "type": "unindented"
            },
            {
                "format": 20,
                "text": "ධාතු, සම්ඵස්ස, නොසම්ඵස්ස, වෙදනා, නොවෙදනා යි මේ අජ්ඣත්ත පඤ්චකය ද, ධාතු, සඤ්ඤා, නොසඤ්ඤා, එස්ස, නොඑස්ස යි මේ බාහිර පඤ්චකයදෑ යි සූත්‍ර දශයෙකි යි.{* උද්දානයෙහි සූත්‍රනාම වෙනස් ව පෙණේ.}",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "235"
            },
            {
                "type": "heading",
                "text": "2. සත්‌තධාතු වර්ගය",
                "level": 2
            },
            {
                "format": 20,
                "text": "2. 2. 1.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සත්‌තධාතු සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "235. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මේ ධාතූහු සත් දෙනෙකි. කවර සත් දෙනෙක යත්: ආලෝකධාතු ය, සුභධාතු ය, ආකාසානඤ්චායතනධාතු ය, විඤ්ඤාණඤ්චායතනධාතු ය, ආකිඤ්චඤ්ඤායතනධාතු ය, නේවසඤ්ඤානාසඤ්ඤායතන ධාතු ය, සඤ්ඤාවෙදයිතනිරොධ ධාතු යි. මහණෙනි, මොහු සප්තධාතූහු වෙති යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි එක්තරා මහණෙක් භාග්‍යවතුන් වහන්සේට මෙය සැළකළේ ය: වහන්ස, යම් මේ ආලෝකධාතුවකුත් යම් සුභධාතුවකුත් යම් ආකාසානඤ්චායතනධාතුවකුත් යම් විඤ්ඤාණඤ්චායතනධාතුවකුත් යම් ආකිඤ්චඤ්ඤායතනධාතුවකුත් යම් නේවසඤ්ඤානාසඤ්ඤායතන ධාතුවකුත් යම් සඤ්ඤාවෙදයිතනිරොධධාතුවකුත් වේ ද, වහන්ස, මේ ධාතූහු කුමක් නිසා පැණෙද්ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණ, යම් මේ ආලෝකධාතුවක් වේ ද, මේ ධාතුව අඳුර නිසා පැණේ. මහණ, යම් මේ සුභධාතුවක් වේ ද, මේ ධාතුව අසුභය නිසා පැණේ. මහණ, යම් මේ ආකාසානඤ්චායතනධාතුවක් වේ ද, මේ ධාතුව රූපය නිසා පැණේ. මහණ, යම් මේ විඤ්ඤාණඤ්චායතනධාතුවක් වේ ද, මේ ධාතුව ආකාසානඤ්චායතනය නිසා පැණේ. මහණ, යම් මේ ආකිඤ්චඤ්ඤායතනධාතුවක් වේ ද, මේ ධාතුව විඤ්ඤාණඤ්චායතනය නිසා පැණේ. මහණ, යම් මේ නේවසඤ්ඤානාසඤ්ඤායතනධාතුවක් වේ ද, මේ ධාතුව ආකිඤ්චඤ්ඤායතනය නිසා පැණේ. මහණ, යම් මේ සඤ්ඤාවෙදයිතනිරොධධාතුවක් වේ ද, මේ ධාතුව (නාමස්කන්ධ) නිරෝධය නිසා පැණේ යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "වහන්ස, යම් මේ ආලෝකධාතුවකුත් යම් සුභධාතුවකුත් යම් ආකාසානඤ්චායතනධාතුවකුත් යම් විඤ්ඤාණඤ්චායතනධාතුවකුත් යම් ආකිඤ්චඤ්ඤායතනධාතුවකුත් යම් නේවසඤ්ඤානාසඤ්ඤායතන ධාතුවකුත් යම් සඤ්ඤාවෙදයිතනිරෝධධාතුවකුත් වේ ද, වහන්ස, මේ ධාතූහු කෙබඳු පමාපත්ති නම් ව පැමිණිය යුත්තෝ වෙද්ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණ, යම් මේ ආලොකධාතුවකුත් යම් සුභධාතුවකුත් යම් ආකාසානඤ්චායතනධාතුවකුත් යම් විඤ්ඤාණඤ්චායතනධාතුවකුත් යම් ආකිඤ්චඤ්ඤායතනධාතුවකුත් වේ ද, මේ ධාතූහු සංඥාසමාපත්ති නම් ව පැමිණිය යුත්තා හ. මහණ, යම් මේ නේවසඤ්ඤානාසඤ්ඤායතනධාතුවකුත් වේ ද, මේ ධාතුව සංස්කාරාවශේෂසමාපත්ති නම් ව පැමිණිය යුත්තී ය. මහණ, යම් මේ සඤ්ඤාවෙදයිතනිරෝධධාතුවක් වේ ද, මේ ධාතුව නිරොධසමාපත්ති නම් ව පැමිණිය යුත්තී යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "237"
            },
            {
                "type": "centered",
                "text": "2. 2. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සනිදාන සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "236. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, කාමවිතර්කය ප්‍රත්‍යය සහිත ව උපදී. ප්‍රත්‍යය රහිත ව නූපදී. ව්‍යාපාදවිතර්කය ප්‍රත්‍යය සහිත ව උපදී. ප්‍රත්‍යය රහිත ව නූපදී. විහිංසාවිතර්කය ප්‍රත්‍යය සහිත ව උපදී. ප්‍රත්‍යය රහිත ව නූපදී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, කෙසේ නම් කාමවිතර්කය ප්‍රත්‍යය සහිත ව උපදී ද, ප්‍රත්‍යය රහිත ව නූපදී ද, ව්‍යාපාදවිතර්කය ප්‍රරත්‍යය සහිත ව උපදී ද, ප්‍රත්‍යය රහිත ව නූපදී ද, විහිංසාවිතර්කය ප්‍රත්‍යය සහිත ව උපදී ද, ප්‍රත්‍යය රහිත ව නූපදී ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, කාමධාතුව නිසා කාමසංඥාව උපදී. කාමසංඥාව නිසා කාමසඞ්කල්පය උපදී. කාමසඞ්කල්පය නිසා කාමච්ඡන්දය උපදී. කාමච්ඡන්දය නිසා කාමපරිදාහය උපදී. කාමපරිදාහය නිසා කාමපර්යෙෂණාව උපදී. මහණෙනි, කාමපර්යෙෂණය සොයන නූගත් පුහුදුන් තෙමේ කයින් වචනයෙන් සිතින් යන තුන් කරුණින් වරදවා පිළිපදී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ව්‍යාපාදධාතුව නිසා ව්‍යාපාදසංඥාව උපදී. ව්‍යාපාදසංඥාව නිසා ව්‍යාපාදසඞ්කල්පය උපදී. ව්‍යාපාදසඞ්කල්පය නිසා ව්‍යාපාදච්ඡන්දය උපදී. ව්‍යාපාදච්ඡන්දය නිසා ව්‍යාපාදපරිදාහය උපදී. ව්‍යාපාදපරිදාහය නිසා ව්‍යාපාදපර්යෙෂණාව උපදී. මහණෙනි, ව්‍යාපාදපර්යෙෂණය සොයන නූගත් පුහුදුන් තෙමේ කයින් වචනයෙන් සිතින් යන තුන් කරුණින් වරදවා පිළිපදී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, විහිංසාධාතුව නිසා විහිංසා සංඥාව උපදී … විහිංසාසංකල්පය … විහිංසාඡන්දය … විහිංසාපරිදාහය … විහිංසාපර්යෙෂණාව ... මහණෙනි, විහිංසාපර්යෙෂණය සොයන නූගත් පුහුදුන් තෙමේ කයින් වචනයෙන් සිතින් යන තුන් කරුණින් වරදවා පිළිපදී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යම් සේ පුරුෂයෙක් අවිලගත් තණ හුළක් වියලි තණලැහැබෙක හෙලන්නේ ද, ඉදින් අතින් පයින් වහා නො නිවන්නේ නම් මහණෙනි, මෙසේ තණ හා දැව ඇසුරු කළ යම් ප්‍රාණීහු වෙත් ද, ඔහු විනාශයට පැමිණෙන්නාහු ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එසෙයින් ම යම් කිසි මහණෙක් හෝ බමුණෙක් හෝ උපන්නා වූ විෂම බවට පැමිණි අකුශල සංඥාව වහා ම දුරු නො කෙරේ ද, බැහැර නො කෙරේ ද, අවසන් නො කෙරේ ද, අනුක්‍රමයෙන් නො ඉපැද්මට නො පමුණුවා ද, හෙතෙමේ මේ අත්බැව්හිත් පීඩා සහිත ව උපායාස සහිත ව පරිදාහ සහිත ව දුකසේ වෙසෙයි. කාබුන් මරණින් මතුත් දුගතිය කැමති විය යුතු යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, නෛෂ්ක්‍රම්‍යවිතර්කය ප්‍රත්‍යය සහිත ව උපදී. ප්‍රත්‍යය රහිත ව නූපදී. අව්‍යාපාදවිතර්කය ප්‍රත්‍යය සහිත ව උපදී. ප්‍රත්‍යය රහිත ව නූපදී. අවිහිංසාවිතර්කය ප්‍රත්‍යය සහිත ව උපදී. ප්‍රත්‍යය රහිත ව නූපදී.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "239"
            },
            {
                "format": 13,
                "text": "මහණෙනි, කෙසේ නම් නෛෂ්ක්‍රම්‍යවිතර්කය ප්‍රත්‍යය සහිත ව උපදී ද, ප්‍රත්‍යය රහිත ව නූපදී ද, අව්‍යාපාදවිතර්කය ප්‍රත්‍යය සහිත ව උපදී ද, ප්‍රත්‍යය රහිත ව නූපදී ද, අවිහිංසාවිතර්කය ප්‍රත්‍යය සහිත ව උපදී ද, ප්‍රත්‍යය රහිත ව නූපදී ද?",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, නෛෂ්ක්‍රම්‍යධාතුව නිසා නෛෂ්ක්‍රම්‍යසංඥාව උපදී. නෛෂ්ක්‍රම්‍යසංඥාව නිසා නෛෂ්ක්‍රම්‍යසඞ්කල්පය උපදී. නෛෂ්ක්‍රම්‍යසඞ්කල්පය නිසා නෛෂ්ක්‍රම්‍යච්ඡන්දය උපදී. නෛෂ්ක්‍රම්‍යච්ඡන්දය නිසා නෛෂ්ක්‍රම්‍යපරිදාහය උපදී. නෛෂ්ක්‍රම්‍ය පරිදාහය නිසා නෛෂ්ක්‍රම්‍යපර්යේෂණාව උපදී. නෛෂ්ක්‍රම්‍යපර්යේෂණය කරණ ශ්‍රැතවත් ආර්ය්‍යශ්‍රාවක තෙමේ කයින් වචනයෙන් මනසින් යන තුන් කරුණින් මනා සේ පිළිපදී. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, අව්‍යාපාදධාතුව නිසා අව්‍යාපාදසංඥාව උපදී ... අව්‍යාපාදසංකල්පය … අව්‍යාපාදච්ඡන්දය … අව්‍යාපාදපරිදාහය … අව්‍යාපාදපර්යේෂණාව … මහණෙනි, අව්‍යාපාදපර්යේෂණය කරණ ශ්‍රැතවත් ආර්ය්‍යශ්‍රාවක තෙමේ කයින් වචනයෙන් සිතින් යන තුන් කරුණින් මැනවින් පිළිපදී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, අවිහිංසාධාතුව නිසා අවිහිංසාසංඥාව උපදී. අවිහිංසාසංඥාව නිසා අවිහිංසාසඞ්කල්පය උපදී. අවිහිංසාසඞ්කල්පය නිසා අවිහිංසාඡන්දය උපදී. අවිහිංසාඡන්දය නිසා අවිහිංසාපරිදාහය උපදී. අවිහිංසාපරිදාහය නිසා අවිහිංසාපර්යේෂණය උපදී. මහණෙනි, අවිහිංසාපර්යේෂණය කරණ ශ්‍රැතවත් ආර්ය්‍යශ්‍රාවක තෙමේ කයින් වචනයෙන් සිතින් යන තුන් කරුණින් මැනවින් පිළිපදී.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යම් සේ පුරුෂයෙක් ගිනි ගත් තණහුළක් වියලිතණලැහැබෙක බහා ලන්නේ ද, ඒ මේ තණහුළ අතින් පයින් වහා ම නිවන්නේ ද, මහණෙනි, මෙසේ තෘණ හා දැව ඇසුරු කළ යම් ප්‍රාණීහු වෙද්ද, ඔහු විනාශයට නො පැමිණෙන්නාහු ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, එසෙයින් ම යම් කිසි මහණෙක් හෝ බමුණෙක් හෝ විෂමබවට පැමිණි උපන් අකුශලසංඥාව වහා ම දුරු කෙරේ ද, බැහැර කෙරේ ද, මුලුසුන් කෙරේ ද, නැවත නො හටගන්නා බවට පමුණුවා ද, හෙතෙමේ මේ අත්බැව්හි ද පීඩා රහිත ව ආයාස රහිත ව පරිදාහ රහිත ව සුවසේ වෙසෙයි කාබුන් මරණින් මතු ද සුගතිය කැමති විය යුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ගිඤ්‌ජකාවසථ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "237. එක්කලෙක භාග්‍යවතුන් වහන්සේ ඤාතික ගම්හි ගිඤ්ජකාවසථයෙහි (=ගැඩොලින් කළ ගෙහි) වැඩ වසන සේක. එහි දී භාග්‍යවතුන් වහන්සේ ‘මහණෙනි’යි භික්‍ෂූන් ඇමතු සේක. ඒ භික්‍ෂූහු වහන්සැ යි භාග්‍යවතුන් වහන්සේට පිළිවදන් අස්වූහ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ධාතු (අධ්‍යාශය) නිසා සංඥාව උපදී, දෘෂ්ටිය උපදී, විතර්කය උපදී යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මෙසේ වදාළ කල්හි ආයුෂ්මත් කච්චාන තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය: වහන්ස, සම්මාසම්බුදු නො වන්නවුන් කෙරෙහි ‘සම්මාසම්බුදුහ’ යන යම් මේ දෘෂ්ටියෙක් වේ ද, වහන්ස, මේ දෘෂ්ටිය කුමක් නිසා පැණේ දැ යි?",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "241"
            },
            {
                "format": 13,
                "text": "කච්චාන, යම් මේ අවිද්‍යාධාතුවෙක් වේ ද, මේ ධාතුව මහත් ය කච්චාන හීනාධ්‍යාශය නිසා හීන සංඥාව උපදී. හීන දෘෂ්ටිය, හීන විතර්කය හීන චේතනාව, හීන ප්‍රාර්ථනාව, හීන ප්‍රණිධිය, හීන පුද්ගලයා, හීන වචන උපදී, හීන වූවක් කියයි, දේශනා කෙරෙයි, පණවයි, පිහිටුවයි, විවෘත කෙරෙයි, බෙදයි, උඩුහුරු කෙරෙයි. ඔහුගේ ඉපද්ම හීන ය යි කියමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කච්චාන, මධ්‍යම අධ්‍යාශය නිසා මධ්‍යම සංඥාව උපදී, මධ්‍යම දෘෂ්ටිය, මධ්‍යම විතර්කය, මධ්‍යම චේතනාව මධ්‍යම ප්‍රාර්ථනාව, මධ්‍යම ප්‍රණිධීය, මධ්‍යම පුද්ගලයා, මධ්‍යම වචන උපදී. මධ්‍යම වූවක් කියයි, දෙශනා කරයි, පණවයි, පිහිටුවයි, විවෘත කෙරෙයි බෙදෙයි, උඩුහුරු කෙරෙයි. ඔහුගේ ඉපැද්ම මධ්‍යම ය යි කියමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "කච්චාන ප්‍රණීතාධ්‍යාශය නිසා ප්‍රණීත සංඥාව උපදී. ප්‍රණීත දෘෂ්ටිය, ප්‍රණීත විතර්කය, ප්‍රණීත චේතනාව, ප්‍රණීත ප්‍රාර්ථනාව, ප්‍රණීත ප්‍රණීධිය, ප්‍රණීත පුද්ගලයා, ප්‍රණීත වචන උපදී. ප්‍රණීත වූවක් කියයි, දේශනා කෙරෙයි, පණවයි, පිහිටුවයි, විවෘත කෙරෙයි, බෙදෙයි, උඩුහුරු කෙරෙයි. ඔහුගේ ඉපැද්ම ප්‍රණීත ය යි කියමි යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "හීනාධිමුත්‌තික සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "238.** සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත් ලාමක අදහස් ඇති සත්ත්වයෝ ලාමක අදහස් ඇත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. කලණ අදහස් ඇත්තෝ කලණ අදහස් ඇත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ඉකුත් කාලයෙහි ද සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳුනහ, එකතු වූහ: ලාමක අදහස් ඇත්තෝ ලාමක අදහස් ඇත්තවුන් සමග සැසැඳුනහ, එකතු වුහ. කලණ අදහස් ඇත්තෝ කලණ අදහස් ඇත්තවුන් සමග සැසැඳුනහ, එකතු වුහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මතු කාලයෙහි ද සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙන්නාහ, එකතු වන්නාහ: ලාමක අදහස් ඇත්තෝ ලාමක අදහස් ඇත්තවුන් සමග සැසැඳෙන්නාහ, එකතු වන්නාහ. කලණ අදහස් ඇත්තෝ කලණ අදහස් ඇත්තවුන් සමග සැසැඳෙන්නාහ, එකතු වන්නාහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, දැන් පවත්නා කල්හි ද සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: ලාමක අදහස් ඇත්තෝ ලාමක අදහස් ඇත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. කලණ අදහස් ඇත්තෝ කලණ අදහස් ඇත්තවුන් සමග සැසැඳෙති, එකතු වෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "243"
            },
            {
                "type": "centered",
                "text": "2. 2. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "චඞ්‌කම සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "239. එක්කලෙක භාග්‍යවතුන් වහන්සේ රජගහනුවර සමීපයෙහි ගිජුකුළුපව්වෙහි වැඩ වසන සේක. එකල්හි ආයුෂ්මත් සැරියුත් තෙරණුවෝ බොහෝ මහණුන් සමග භාග්‍යවතුන් වහන්සේට නුදුරෙහි සක්මන් කෙරෙති. ආයුෂ්මත් මහමුගලන් තෙරණුවෝ ද බොහෝ මහණුන් සමග භාග්‍යවතුන් වහන්සේට නුදුරෙහි සක්මන් කෙරෙති. ආයුෂ්මත් මහකසුප් තෙරණුවෝ ද බොහෝ මහණුන් සමග භාග්‍යවතුන් වහන්සේට නුදුරෙහි සක්මන් කෙරෙති. ආයුෂ්මත් අනුරුද්ධ තෙරණුවෝ ද බොහෝ මහණුන් සමග භාග්‍යවතුන් වහන්සේට නුදුරෙහි සක්මන් කෙරෙති. ආයුෂ්මත් මන්තානිපුත් පුණ්ණ තෙරණුවෝ ද බොහෝ මහණුන් සමග භාග්‍යවතුන් වහන්සේට නුදුරෙහි සක්මන් කෙරෙති. ආයුෂ්මත් උපාලි තෙරණුවෝ ද බොහෝ මහණුන් සමග භාග්‍යවතුන් වහන්සේට නුදුරෙහි සක්මන් කෙරෙති. ආයුෂ්මත් ආනන්ද තෙරණුවෝ ද බොහෝ මහණුන් සමග භාග්‍යවතුන් වහන්සේට නුදුරෙහි සක්මන් කෙරෙති. දෙව්දත් තෙමේ ද බොහෝ මහණුන් සමග භාග්‍යවතුන් වහන්සේට නුදුරෙහි සක්මන් කෙරෙයි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එකල්හි භාග්‍යවතුන් වහන්සේ භික්‍ෂූන් ඇමතූ සේක: මහණෙනි, තෙපි බොහෝ මහණුන් සමග සක්මන් කරණ සැරියුත් දකිවු ද? වහන්ස, එසේ ය. මහණෙනි, මේ සියලු භික්‍ෂූහු මහපැණැත්තහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, තෙපි බොහෝ භික්‍ෂූන් සමග සක්මන් කරණ මුගලන් දකිවු ද? වහන්ස, එසේ ය. මහණෙනි, මේ සියලු භික්‍ෂූහු මහත් සෘද්ධි ඇත්තහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, තෙපි බොහෝ මහණුන් සමග සක්මන් කරණ කසුප් දකිවු ද? වහන්ස, එසේ ය. මහණෙනි, මේ සියලූ භික්‍ෂූහුධුතවාදීහු ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, තෙපි බොහෝ භික්‍ෂූන් සමග සක්මන් කරණ අනුරුද්ධ දකිවු ද? වහන්ස, එසේ ය. මහණෙනි, මේ සියලු භික්‍ෂූහු දිවැස් ඇත්තහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, තෙපි බොහෝ මහණුන් සමග සක්මන් කරණ මන්තානීපුත් පුණ්ණ දකිවු ද? වහන්ස, එසේ ය. මහණෙනි, මේ සියලූ භික්‍ෂූහු ධර්මකථිකයහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, තෙපි බොහෝ මහණුන් සමග සක්මන් කරණ උපාලි දකිවු ද? වහන්ස, එසේ ය. මහණෙනි, මේ සියලූ භික්‍ෂූහු විනයධරයහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, තෙපි බොහෝ මහණුන් සමග සක්මන් කරණ අනඳ දකිවු ද? වහන්ස, එසේ ය. මහණෙනි, මේ සියලූ භික්‍ෂූහු බහුශ්‍රැතයහ.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "245"
            },
            {
                "format": 13,
                "text": "මහණෙනි, තෙපි බොහෝ මහණුන් සමග සක්මන් කරණ දෙව්දතු දකිවු ද? වහන්ස, එසේ ය. මහණෙනි, මේ සියලූ භික්‍ෂූහු පාපිච්ඡයහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: ලාමක අදහස් ඇත්තෝ ලාමක අදහස් ඇත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. කලණ අදහස් ඇත්තෝ කලණ අදහස් ඇත්තවූන් සමග සැසැඳෙත්, එකතු වෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, අතීත කාලයෙහි දු සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳුනහ, එක් වූහ: ලාමක අදහස් ඇත්තෝ ලාමක අදහස් ඇත්තවුන් සමග සැසැඳුනහ, එක් වූහ. කලණ අදහස් ඇත්තෝ කලණ අදහස් ඇත්තවුන් සමග සැසැඳුනහ, එක් වූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මතු කාලයෙහි දු අදහස් වශයෙන් ම සත්ත්වයෝ සැසැඳෙන්නාහු ය, එක් වන්නාහු ය: ලාමක අදහස් ඇත්තෝ ලාමක අදහස් ඇත්තවුන් සමග සැසැඳෙන්නාහු ය, එක් වන්නාහු ය. කලණ අදහස් ඇත්තෝ කලණ අදහස් ඇත්තවුන් සමග සැසැඳෙන්නාහ, එකතු වන්නාහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, දැන් පවත්නා කල්හි දු අදහස් වශයෙන් ම සත්ත්වයෝ සැසැඳෙති, එකතු වෙති: ලාමක අදහස් ඇත්තෝ ලාමක අදහස් ඇත්තවුන් සමග සැසැඳෙති, එකතු වෙති. කලණ අදහස් ඇත්තෝ කලණ අදහස් ඇත්තවුන් සමග සැසැඳෙති, එකතු වෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සගාථා සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "240. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, අදහස් වශයෙන් ම සත්ත්වයෝ සැසැඳෙති, එකතු වෙති: ලමු අදහස් ඇත්තෝ ලමු අදහස් ඇත්තවුන් සමග සැසැඳෙති, එකතු වෙති. මහණෙනි, ඉකුත් කාලයෙහි ද සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳුනහ, එකතු වූහ: ලමු අදහස් ඇත්තෝ ලමු අදහස් ඇත්තවුන් සමග සැසැඳුනහ, එකතු වූහ. මහණෙනි, මතු කාලයෙහි දු සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙන්නාහ, එකතු වන්නාහ: ලමු අදහස් ඇත්තෝ ලමු අදහස් ඇත්තවුන් සමග සැසැඳෙන්නාහ, එකතු වන්නාහ. මහණෙනි, දැන් වත්මන්හි දු සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙති, එකතු වෙති. ලමු අදහස් ඇත්තෝ ලමු අදහස් ඇත්තවුන් සමග සැසැඳෙති, එකතු වෙති.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යම් සේ මල මල සමග සැසැඳේ ද, එකතු වේ ද; මූත්‍ර මූත්‍ර සමග සැසැඳේ ද, එකතු වේ ද; කෙල කෙල සමග සැසැඳේ ද, එකතු වේ ද; පූයාව පූයාව සමග සැසැඳේ ද, එකතු වේ ද; ලේ ලේ සමග සැසැඳේ ද, එකතු වේ ද; මහණෙනි, එසෙයින් ම සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙති, එකතු වෙති, … මහණෙනි, අයු කල්හි දු … මහණෙනි, මතු කාලයෙහි දු … මහණෙනි, දැන් වත්මන් කල්හි දු සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: ලමු අදහස් ඇත්තෝ ලමු අදහස් ඇත්තවුන් සමග සැසැඳෙති, එකතු වෙති.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "247"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: කලණ අදහස් ඇත්තෝ කලණ අදහස් ඇත්තවුන් සමග සැසැඳෙති, එකතු වෙති. මහණෙනි, ඉකුත් කල්හි දු සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳුනහ, එකතු වූහ: කලණ අදහස් ඇත්තෝ කලණ අදහස් ඇත්තවුන් සමග සැසැඳුනහ, එකතු වූහ. මහණෙනි, මතු කල්හි දු … මහණෙනි, දැන් වත්මන් කල්හි දු සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙති, එකතු වෙති: කලණ අදහස් ඇත්තෝ කලණ අදහස් ඇත්තවුන් සමග සැසැඳෙති, එකතු වෙති.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යම් සේ කිරි කිරි සමග සැසැඳේ ද, එකතු වේ ද, තෙල් තෙල් සමග සැසැඳේ ද, එකතු වේ ද; ගිතෙල් ගිතෙල් සමග සැසැඳේ ද, එකතු වේ ද, මී මී සමග සැසැඳේ ද; එකතු වේ ද, පැණි පැණි සමග සැසැඳේ ද, එකතු වේ ද, මහණෙනි, එසෙයින් ම සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙති, එකතු වෙති. කලණ අදහස් ඇත්තෝ කලණ අදහස් ඇත්තවුන් සමග සැසැඳෙති, එකතු වෙති. මහණෙනි, ඉකුත් කල්හි දු … මහණෙනි, මතු කල්හි දු … මහණෙනි, දැන් වත්මන් කල්හි දු සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙති, එකතු වෙති. කලණ අදහස් ඇත්තෝ කලණ අදහස් ඇත්තවුන් සමග සැසැඳෙති, එකතු වෙති.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගත වූ ශාස්තෲන් වහන්සේ මෙය වදාරා යලි මතු දු මෙය වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ඇල්මෙන් කෙලෙස්වනය හටගත්තේ ය, නො ඇල්මෙන් සිඳෙයි. කුඩා දරකඩකට නැගී (සිටියහු) මහමුහුදෙහි යම් සේ කිඳෙන්නේ ද,",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "එසෙයින් ම පිරිසුදු දිවි ඇත්තේ ද මැලි පිඟුලා වෙත පැමිණ කිඳෙයි. (පිරිහෙයි) එහෙයින් වීර්ය්‍ය නැති ඒ මැලි පුඟුලා දුරු කරන්නේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "ප්‍රකර්ෂ විවේක ඇති ආර්ය්‍ය වූ නිවන් පිණිස මෙහෙයූ සිත් ඇති පටන් ගත වීර්ය්‍ය ඇති ධ්‍යාන කරණසුලු පණ්ඩිතයන් සමග නිරතුරු එක් ව වෙසෙන්නේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අස්‌සද්‌ධ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "241. මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙති, එකතු වෙති: සදැහැ නැත්තෝ සදැහැ නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. ලජ්ජා නැත්තෝ ලජ්ජා නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. පවට බිය නැත්තෝ පවට බිය නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. නූගත්තු නූගතුන් සමග සැසැඳෙත්, එකතු වෙත්. කුසීතයෝ කුසීතයන් සමග සැසැඳෙත්, එකතු වෙත්. මුළාසිහි ඇත්තෝ මුළාසිහි ඇත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. නුවණ නැත්තෝ නුවණ නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "249"
            },
            {
                "format": 13,
                "text": "මහණෙනි, අයු කල්හි දු අදහස් වශයෙන් ම සත්ත්වයෝ සැසැඳුනහ, එකතු වූහ: සැදැහැ නැත්තෝ සැදැහැ නැත්තවුන් සමග සැසැඳුනහ, එකතු වූහ. ලජ්ජා නැත්තෝ ලජ්ජා නැත්තවුන් සමග සැසැඳුනහ, එකතු වූහ. පවට බිය නැත්තෝ පවට බිය නැත්තවුන් සමග සැසැඳුනහ, එකතු වූහ. නූගතුන් නූගතුන් සමග සැසැඳුනහ, එකතු වූහ. කුසීතයෝ කුසීතයන් සමග සැසැඳුනහ, එකතු වූහ. මුළා සිහි ඇත්තෝ මුළා සිහි ඇත්තවුන් සමග සැසැඳුනහ, එකතු වූහ. නුවණ නැත්තෝ නුවණ නැත්තවුන් සමග සැසැඳුනහ, එකතු වූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මතු කල්හි දු සත්ත්වයෝ අදහස් වශයෙන් මැ සැසැඳෙන්නාහ, එකතු වන්නාහ: සැදැහැ නැත්තෝ සැදැහැ නැත්තවුන් සමග සැසැඳෙන්නාහ, එකතු වන්නාහ. ලජ්ජා නැත්තෝ ලජ්ජා නැත්තවුන් සමග සැසැඳෙන්නාහ, එකතු වන්නාහ, පවට බිය නැත්තෝ පවට බිය නැත්තවුන් සමග ... නූගතුන් නූගතුන් සමග ... කුසීතයෝ කුසීතයන් සමග ... මුළාසිහි ඇත්තෝ මුළාසිහි ඇත්තවුන් සමග ... නුවණ නැත්තෝ නුවණ නැත්තවුන් සමග සැසැඳෙන්නාහ, එකතු වන්නාහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, දැන් වත්මන් කල්හි දු සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙති, එකතු වෙති: සැදැහැ නැත්තෝ සැදැහැ නැත්තවුන් සමග සැසැඳෙති, එකතු වෙති. ලජ්ජා නැත්තෝ ලජ්ජා නැත්තවුන් සමග ... පවට බිය නැත්තෝ පවට බිය නැත්තවුන් සමග ... නූගත්තු නූගතුන් සමග ... කුසීතයෝ කුසීතයන් සමග ... මුළා සිහි ඇත්තෝ මුළා සිහි ඇත්තවුන් සමග ... නුවණ නැත්තෝ නුවණ නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: සැදැහැත්තෝ සැදැහැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. ලජ්ජා ඇත්තෝ ලජ්ජා ඇත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. පවට බිය ඇත්තෝ පවට බිය ඇත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. උගත්තු උගතුන් සමග සැසැඳෙත්, එකතු වෙත්. පිරිපුන් වීර්ය්‍ය ඇත්තෝ පිරිපුන් වීර්ය්‍ය ඇත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. එළඹ සිටි සිහි ඇත්තෝ එළඹ සිටි සිහි ඇත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. නුවණැත්තෝ නුවණැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, අයු කල්හි දු … මහණෙනි, මතු කල්හි දු … මහණෙනි, දැන් පවත්නා කල්හි දු සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්. සැදැහැත්තෝ සැදැහැත්තවුන් සමග … නුවණැත්තෝ නුවණැත්තවුන් සමග සැසැඳෙති, එකතු වෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අස්‌සද්‌ධමූලකතිකපඤ්චක සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "242.** සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: සැදැහැ නැත්තෝ සැදැහැ නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. ලජ්ජා නැත්තෝ ලජ්ජා නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. නුවණැත්තෝ නුවණ නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. සැදැහැත්තෝ සැදැහැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. ලජ්ජා ඇත්තෝ ලජ්ජා ඇත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. නුවණැත්තෝ නුවණැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "251"
            },
            {
                "format": 13,
                "text": "මහණෙනි, අයු කල්හි දු සත්ත්වයෝ අදහස් වශයෙන් සැසැඳුනහ, එකතු වූහ … මහණෙනි, මතු කල්හි දු සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙන්නාහ, එකතු වන්නාහ. මහණෙනි, දැන් වත්මන්හි දු සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: සැදැහැ නැත්තෝ සැදැහැ නැත්තවුන් සමග … ලජ්ජා නැත්තෝ ලජ්ජා නැත්තවුන් සමග … නුවණනැත්තෝ නුවණ නැත්තවුන් සමග … සැදැහැත්තෝ සැදැහැත්තවුන් සමග … ලජ්ජා ඇත්තෝ ලජ්ජා ඇත්තවුන් සමග … නුවණැත්තෝ නුවණැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. (පළමුවන තික ය යි.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්. සැදැහැ නැත්තෝ සැදැහැ නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. පවට බිය නැත්තෝ පවට බිය නැත්තවුන් සමග … නුවණ නැත්තෝ නුවණ නැත්තවුන් සමග … සැදැහැත්තෝ සැදැහැත්තවුන් සමග … පවට බිය ඇත්තෝ පවට බිය ඇත්තවුන් සමග … නුවණැත්තෝ නුවණැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. මහණෙනි, අයු කල්හි දු … මහණෙනි, අනා කල්හි දු … මහණෙනි, දැන් වත්මන්හි දු සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්. සැදැහැ නැත්තෝ සැදැහැ නැත්තවුන් සමග … පවටබිය නැත්තෝ පවට බිය නැත්තවුන් සමග … නුවණැත්තෝ නුවණැත්තවුන් සමග … සැදැහැත්තෝ සැදැහැත්තවුන් සමග … පවට බියැත්තෝ පවට බිය ඇත්තවුන් සමග … නුවණැත්තෝ නුවණැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. (දෙවන තිකය යි.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: සැදැහැ නැත්තෝ සැදැහැ නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. නූගතුන් නූගතුන් සමග … නුවණ නැත්තෝ නුවණ නැත්තවුන් සමග … සැදැහැත්තෝ සැදැහැත්තවුන් සමග … උගත්තු උගතුන් සමග … නුවණැත්තෝ නුවණැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. මහණෙනි, ඉකුත් කල්හි දු … මහණෙනි, මතු කල්හි දු … මහණෙනි, දැන් වත්මන් කල්හි දු .... සැදැහැත්තෝ සැදැහැතියන් සමග … නූගත්තු නූගතුන් සමග … නුවණ නැත්තෝ නුවණ නැත්තවුන් සමග … සැදැහැතියෝ සැදැහැතියන් සමග …උගත්තු උගතුන් සමග … නුවණැත්තෝ නුවණැතියන් සමග සැසැඳෙත්, එකතු වෙත්. (තෙවන තිකය යි.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: සැදැහැ නැත්තෝ සැදැහැ නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. කුසීතයෝ කුසීතයන් සමග … නුවණ නැත්තෝ නුවණ නැත්තවුන් සමග … සැදැහැත්තෝ සැදැහැත්තවුන් සමග … පිරිපුන් වෙර ඇත්තෝ පිරිපුන් වෙර ඇත්තවුන් සමග … නුවණැත්තෝ නුවණැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. මහණෙනි, අයු කල්හි දු … මහණෙනි, අනා කල්හි දු … මහණෙනි, දැන් වත්මන්හි දු ... සැදැහැනැතියෝ … කුසීතයෝ … නුවණ නැත්තෝ … සැදැහැතියෝ … පිරිපුන් වෙර ඇතියෝ … නුවණැත්තෝ නුවණැතියන් සමග සැසැඳෙත්, එකතු වෙත්. (සිවුවන තිකය යි.)",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "253"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: සැදැහැ නැත්තෝ සැදැහැ නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. මුළා සිහි ඇත්තෝ මුළා සිහි අත්තවුන් සමග … නුවණ නැත්තෝ නුවණ නැත්තවුන් සමග … සැදැහැත්තෝ සැදැහැත්තවුන් සමග … එළඹ සිටි සිහි ඇත්තෝ එළඹ සිටි සිහි ඇත්තවුන් සමග … පැණැත්තෝ පැණැත්තවුන් සමග සැසඳෙත්, එකතු වෙත්. මහණෙනි, අයු කල්හි දු … මහණෙනි, අනා කල්හි දු … මහණෙනි, දැන් වත්මන්හි දු ... සැදැහැනැත්තෝ … මුළා සිහි ඇත්තෝ … නුවණ නැත්තෝ … සැදැහැත්තෝ … එළඹි සිහි ඇත්තෝ … පැණැත්තෝ පැණැත්තන් සමග සැසැඳෙති එකතු වෙති යි. (පස්වන තිකය යි.)",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අහිරිකමූලකතිකචතුක්ක සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "243. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: ලජ්ජා නැත්තෝ ලජ්ජා නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. පවට බිය නැත්තෝ පවට බිය නැත්තවුන් සමග … නුවණ නැත්තෝ නුවණ නැත්තවුන් සමග … ලජ්ජා ඇත්තෝ ලජ්ජා ඇත්තවුන් සමග … පවට බිය ඇත්තෝ පවට බිය ඇත්තවුන් සමග … පැණැත්තෝ පැණැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. මහණෙනි, අයු කල්හි දු … මහණෙනි, අනාකල්හි දු … මහණෙනි, දැන් වත්මන් කල්හි දු … [ලජ්ජා නැතියෝ … පවට බිය නැතියෝ … නුවණ නැතියෝ … ලජ්ජා ඇතියෝ … පවට බිය ඇතියෝ … පැණැතියෝ පැණැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්.](පළමුවන තිකය යි.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: ලජ්ජා නැත්තෝ ලජ්ජා නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. නූගත්තු නූගතුන් සමග … නුවණ නැත්තෝ නුවණ නැත්තවුන් සමග … ලජ්ජා ඇත්තෝ ලජ්ජා ඇත්තවුන් සමග … උගත්තු උගතුන් සමග … පැණැත්තෝ පැණැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. මහණෙනි, අයුකල්හි දු … මහණෙනි, අනාගතයෙහි දු … මහණෙනි, දැන් වත්මන් කල්හි දු … [ලජ්ජා නැතියෝ … නූගත්තෝ … නුවණ නැතියෝ … ලජ්ජා ඇතියෝ … උගත්තෝ … පැණැතියෝ පැණැත්තන් සමග සැසැඳෙත්, එකතු වෙත්.] (දෙවන තිකය යි.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: ලජ්ජා නැත්තෝ ලජ්ජා නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. කුසීතයෝ කුසීතයන් සමග … නුවණ නැත්තෝ නුවණ නැත්තවුන් සමග … ලජ්ජා ඇත්තෝ ලජ්ජා ඇත්තවුන් සමග … පිරිපුන් වැර ඇත්තෝ පිරිපුන් වෙර ඇත්තවුන් සමග … පැණැත්තෝ පැණැත්තවුන් සමග ... සැසැඳෙත්, එකතු වෙත්. මහණෙනි, අයුකල්හි දු … මහණෙනි, අනාකල්හි දු … මහණෙනි, දැන් වත්මන් කල්හි දු … [ලජ්ජා නැතියෝ … කුසීතයෝ … නුවණ නැතියෝ … ලජ්ජා ඇතියෝ … පරිපුන් වැර ඇතියෝ … පැණැතියෝ පැණැත්තන් සමග සැසැඳෙත්, එකතු වෙත්.] (තෙවන තිකය යි.)",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "255"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: ලජ්ජා නැත්තෝ ලජ්ජා නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. මුළා සිහි ඇත්තෝ මුළා සිහි ඇත්තවුන් සමග … දුෂ්ප්‍රාඥයෝ දුෂ්ප්‍රාඥයන් සමග … ලජ්ජා ඇත්තෝ ලජ්ජා ඇත්තවුන් සමග … එළඹ සිටි සිහි ඇත්තෝ එළඹ සිටි සිහි ඇත්තවුන් සමග … පැණැත්තෝ පැණැත්තවුන් සමග ... සැසැඳෙති, එකතු වෙති. මහණෙනි, අයුකල්හි දු … මහණෙනි, අනාකල්හි දු … මහණෙනි, දැන් වත්මන් කල්හි දු … [ලජ්ජා නැතියෝ … සිහි නැතියෝ … ලජ්ජා ඇතියෝ … සිහි ඇතියෝ … පැණැත්තෝ පැණැත්තවුන් සමග සැසැඳෙති, එකතු වෙති යි.] (සිවුවන තිකය යි.)",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනොත්‌තප්‌පමූලකතිකත්තය සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "244**. සැවැත්නුවර **-",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්. පවට බිය නැත්තෝ පවට බිය නැත්තවුන් සමග … අල්පශ්‍රැතයෝ අල්පශ්‍රැතයන් සමග … දුෂ්ප්‍රාඥයෝ දුෂ්ප්‍රාඥයන් සමග … පාපභීරුකයෝ පාපභීරුකයන් සමග … බහුශ්‍රැතයෝ බහුශ්‍රැතයන් සමග … ප්‍රාඥයෝ ප්‍රාඥයන් සමග සැසැඳෙත්, එකතු වෙත්. මහණෙනි, අයුකල්හි දු … මහණෙනි, අනාකල්හි දු … මහණෙනි, දැන් වත්මන් කල්හි දු … පවට බිය නැතියෝ … අල්පශ්‍රැතයෝ … දුෂ්ප්‍රාඥයෝ … පවට බිය ඇතියෝ … බහුශ්‍රැතයෝ … නුවණැත්තෝ නුවණැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. (පළමුවන තිකය යි.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්. පවට බිය නැත්තෝ පවට බිය නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. කුසීතයෝ කුසීතයන් සමග … දුෂ්ප්‍රාඥයෝ දුෂ්ප්‍රාඥයන් සමග … පාපභීරුකයෝ පාපභීරුකයන් සමග … පිරිපුන් වැර ඇත්තෝ පිරිපුන් වෙර ඇත්තවුන් සමග … ප්‍රාඥයෝ ප්‍රාඥයන් සමග සැසැඳෙත්, එකතු වෙත්. මහණෙනි, අයුකල්හි දු … මහණෙනි, අනාකල්හි දු … මහණෙනි, දැන් වත්මන් කල්හි දු … පවට බිය නැතියෝ … කුසීතයෝ … දුෂ්ප්‍රාඥයෝ … පාපභිරුකයෝ … පිරිපුන් වැර ඇත්තෝ … ප්‍රාඥයෝ ප්‍රාඥයන් සමග සැසැඳෙත්, එකතු වෙත්. (දෙවන තිකය යි.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්. පවට බිය නැත්තෝ පවට බිය නැත්තවුන් සමග සැසැඳෙති, එකතු වෙති. මුළා සිහි ඇත්තෝ මුළා සිහි ඇත්තවුන් සමග … දුෂ්ප්‍රාඥයෝ දුෂ්ප්‍රාඥයන් සමග … පවට බිය ඇත්තෝ පවට බිය ඇත්තවුන් සමග … එළඹ සිටි සිහි ඇත්තෝ එළඹ සිටි සිහි ඇත්තවුන් සමග … පැණැත්තෝ පැණැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. මහණෙනි, අයුකල්හි දු … මහණෙනි, අනාකල්හි දු … මහණෙනි, දැන් වත්මන් කල්හි දු … පවට බිය නැතියෝ … සිහි නැතියෝ … දුෂ්ප්‍රාඥයෝ … පවට බිය ඇත්තෝ … සිහි ඇත්තෝ … ප්‍රාඥයෝ ප්‍රාඥයන් සමග සැසැඳෙත්, එකතු වෙත්. (තෙවන තිකය යි.)",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "257"
            },
            {
                "type": "centered",
                "text": "2. 2. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අප්‌පස්‌සුතමූලකතිකදවය සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "245. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: අල්පශ්‍රැතයෝ අල්පශ්‍රැතයන් සමග සැසැඳෙත්, එකතු වෙත්. කුසීතයෝ කුසීතයන් සමග … දුෂ්ප්‍රාඥයෝ දුෂ්ප්‍රාඥයන් සමග … බහුශ්‍රැතයෝ බහුශ්‍රැතයන් සමග … පිරිපුන් වැර ඇත්තෝ පිරිපුන් වැර ඇත්තවුන් සමග … ප්‍රඥයෝ ප්‍රඥයන් සමග ... සැසැඳෙත්, එකතු වෙත්. මහණෙනි, අතීතයෙහිදු … මහණෙනි, අනාගතයෙහි දු … මහණෙනි, දැන් වත්මන් හි දු … අල්පශ්‍රැතයෝ … කුසීතයෝ … දුෂ්ප්‍රාඥයෝ … බහුශ්‍රැතයෝ … වැර ඇතියෝ … ප්‍රාඥයෝ ප්‍රාඥයන් සමග සැසැඳෙත්, එකතු වෙත්. (පළමුවන තිකය යි.)",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් විසින් ම සැසැඳෙත්, එකතු වෙත්: අල්පශ්‍රැතයෝ අල්පශ්‍රැතයන් සමග සැසැඳෙත්, එකතු වෙත්. මුළා සිහි ඇත්තෝ මුළා සිහි ඇත්තවුන් සමග … දුෂ්ප්‍රාඥයෝ දුෂ්ප්‍රාඥයන් සමග … බහුශ්‍රැතයෝ බහුශ්‍රැතයන් සමග … එළඹ සිටි සිහි ඇත්තෝ එළඹ සිටි සිහි ඇත්තවුන් සමග … ප්‍රඥයෝ ප්‍රඥයන් සමග සැසැඳෙත්, එකතු වෙත්. මහණෙනි, අතීතයෙහිදු … මහණෙනි, අනාගතයෙහි දු … මහණෙනි, දැන් වත්මන් කල්හි දු … අල්පශ්‍රැතයෝ … සිහි නැතියෝ … දුෂ්ප්‍රාඥයෝ … බහුශ්‍රැතයෝ … සිහි ඇතියෝ … පණැත්තෝ පණැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. (දෙවන තිකය යි.)",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කුසීතමූලකතිකෙක සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "246. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්ත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: කුසීතයෝ කුසීතයන් සමග සැසැඳෙත්. එකතු වෙත්. මුළා සිහි ඇත්තෝ මුළා සිහි ඇත්තවුන් සමග … නුවණ නැත්තෝ නුවණ නැතවුන් සමග … පිරිපුන් වැර ඇත්තෝ පිරිපුන් වැර ඇත්තවුන් සමග … එළඹ සිටි සිහි ඇත්තෝ එළඹ සිටි සිහි ඇත්තවුන් සමග ... පැණැතියෝ පණැත්තවුන් සමඟ සැසැඳෙති, එකතු වෙති. මහණෙනි, අතීතයෙහිදු … මහණෙනි, අනාගතයෙහි දු … මහණෙනි, දැන් වත්මන් හි දු … කුසීතයෝ … සිහි නැතියෝ … නුවණ නැතියෝ … පිරිපුන් වැර ඇතියෝ … සිහි ඇතියෝ … පණැතියෝ පණැත්තන් සමග සැසැඳෙති, එකතු වෙති.",
                "type": "paragraph"
            },
            {
                "format": 11,
                "text": "සත්තධාතු වර්ගය දෙවෙනි යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 20,
                "text": "**එහි උද්දානය:**",
                "type": "unindented"
            },
            {
                "format": 20,
                "text": "සත්තධාතු, සනිදාන සූත්‍ර සහ ගිඤ්ජකාවසථ, හීනාධිමුත්ති, වඞ්කම, සගාථ සූත්‍ර ද, සත්වැනි අස්සධ සූත්‍රය ද, අස්සද්ධමූලකතික පස ද, අහිරිකමූලකතික සතර ද, අනොත්තාපමූලකතික තුණ ද, අප්පස්සුතමූලකතික දෙක ද, කුසීතමුලකතික එක ද යන තික දැක්වෙන සූත්‍ර පස දැ යි මෙසේ සූත්‍රාන්ත (දොළොසෙක්) ද, තික පසළොසෙක් ද වදාරණ ලදි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "259"
            },
            {
                "type": "heading",
                "text": "3. කම්‌මපථ වර්ගය",
                "level": 2
            },
            {
                "type": "centered",
                "text": "2. 3. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අසමාහිත සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "247. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්වයෝ අදහස් වශයෙන්ම සැසැඳෙත්, එකතු වෙත්: සැදැහැ නැත්තෝ සැදැහැ නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත් ලජ්ජා නැත්තෝ ලජ්ජා නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. පවට බිය නැත්තෝ පවට බිය නැත්තවුන් සමග … අසමාහිත (උපචාර-අපර්ණා සමාධි රහිත)යෝ අසමාහිතයන් සමග … දුෂ්ප්‍රාඥයෝ දුෂ්ප්‍රාඥයන් සමග සැසැඳෙත්, එකතු වෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සැදැහැත්තෝ සැදැහැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. ලජ්ජා ඇත්තෝ ලජ්ජා ඇත්තවුන් සමග … පාපභීරුකයෝ පාපභීරුකයන් සමග … සමාහිතයෝ සමාහිතයන් සමග … පැණැත්තෝ පැණැත්තවුන් සමග සැසැඳෙති, එකතු වෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුස්‌සීල සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "248. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: සැදැහැ නැත්තෝ සැදැහැ නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. ලජ්ජා නැත්තෝ ලජ්ජා නැත්තවුන් සමග … පවට බිය නැත්තෝ පවට බිය නැත්තවුන් සමග … දුස්සීලයෝ දුස්සසීලයන් සමග … දුෂ්ප්‍රාඥයෝ දුෂ්ප්‍රාඥයන් සමග සැසැඳෙත්, එකතු වෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සැදැහැත්තෝ සැදැහැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. ලජ්ජා ඇත්තෝ ලජ්ජා ඇත්තවුන් සමග … පාපභීරුකයෝ පාපභීරුකයන් සමග … සිල්වත්තු සිල්වතුන් සමග … පැණැත්තෝ පැණැත්තවුන් සමග සැසැඳෙති, එකතු වෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පඤ්‌චසික්‌ඛාපද සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "249. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්වයෝ අදහස් වශයෙන්ම සැසැඳෙත්, එකතු වෙත්: පරපණ නසන්නෝ පරපණ නසන්නවුන් සමග සැසැඳෙත්, එකතු වෙත්. අන්සතු දැ ගන්නෝ අන්සතු දැ ගන්නවුන් සමග … කාමයන්හි වරදවා හැසිරෙන්නෝ කාමයන්හි වරදවා හැසිරෙන්නවුන් සමග … මුසවා බණන්නෝ මුසවා බණන්නවුන් සමග … පමාවට කරුණු වූ රහමෙර මත්පැන් පානය කරන්නෝ පමාවට කරුණු වූ රහමෙර මත්පැන් පානය කරන්නවුන් සමග සැසැඳෙත්, එකතු වෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "පණිවාසයෙන් වෙන් වූවෝ පණිවායෙන් වෙන් වූවන් සමග සැසැඳෙත්, එකතු වෙත්. අන්සතු දෑ ගැන්මෙන් වෙන් වූවෝ අන්සතු දෑ ගැන්මෙන් වෙන් වූවන් සමග … කාමයන්හි වරදවා හැසිරීමෙන් වෙන් වූවෝ කාමයන්හි වරදවා හැසිරීමෙන් වෙන් වූවන් සමග … මුසවා බිණුමෙන් වෙන් වූවෝ මුසවා බිණුමෙන් වෙන් වූවන් සමග … පමාවට කරුණු වූ රහමෙර මත්පැන් පානය කිරීමෙන් වෙන් වූවෝ පමාවට කරුණු වූ රහමෙර මත්පැන් පානය කිරීමෙන් වෙන් වූවන් සමග සැසැඳෙති, එකතු වෙතී යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "261"
            },
            {
                "type": "centered",
                "text": "2. 3. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සත්‌තකම්‌මපථ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "250. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: පරපණ නසන්නෝ පරපණ නසන්නවුන් සමග සැසැඳෙත්, එකතු වෙත්. අන්සතු දැ ගන්නෝ අන්සතු දැ ගන්නවුන් සමග … කාමයන්හි වරදවා හැසිරෙන්නෝ කාමයන්හි වරදවා හැසිරෙන්නවුන් සමග … මුසවා බණන්නෝ මුසවා බණන්නවුන් සමග … පිසුණුබස් බණන්නෝ පිසුණුබස් බණන්නවුන් සමග … පරොස්බස් බණන්නෝ පරොස්බස් බණන්නවුන් සමග … හිස්බස් බණන්නෝ හිස්බස් බණන්නවුන් සමග සැසැඳෙත්, එකතු වෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "පණිවායෙන් වෙන් වූවෝ … අයිනාදනින් වෙන් වූවෝ … කාමයන්හි වරදවා හැසිරීමෙන් වෙන් වූවෝ … මුසවායෙන් වෙන් වූවෝ … පිසුණුබසින් වෙන් වූවෝ … පරොස්බසින් වෙන් වූවෝ … හිස්බස් බිණුමෙන් වෙන් වූවෝ හිස්බස් බිණුමෙන් වෙන් වූවන් සමග සැසැඳෙත්. එකතු වෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දසකම්‌මපථ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "251. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: පරපණ නසන්නෝ පරපණ නසන්නවුන් සමග සැසඳෙත්, එකතු වෙත්. මෙරමා සතු දැ ගන්නෝ … කාමයන්හි වරදවා හැසිරෙන්නෝ … මුසවා බණන්නෝ … පිසුණුබස් බණන්නෝ … පරොස්බස් බණන්නෝ … හිස්බස් බණන්නෝ … දැඩිලෝබ බහුල කොට ඇත්තෝ දැඩිලෝබ බහුල කොට ඇත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. ව්‍යාපාදයට පැමිණි සිතැත්තෝ ව්‍යාපාදයට පැමිණි සිතැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත් මිසදිටුවෝ මිසදිටුවන් සමග සැසැඳෙත්, එකතු වෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "පණිවාසයෙන් වෙන් වූවෝ පණිවායෙන් වෙන් වූවන් සමග සැසැඳෙත්, එකතු වෙත්. අයිනාදනින් වෙන් වූවෝ … කාමයන්හි වරදවා හැසිරීමෙන් වෙන් වූවෝ … මුසවායෙන් වෙන් වූවෝ...පිසුණුබසින් වෙන් වූවෝ … පරොස්බසින් වෙන් වූවෝ … හිස්බස් බිණුමෙන් වෙන් වූවෝ … අභිධ්‍යාව බහුල කොට නැත්තෝ අභිධ්‍යාව බහුල කොට නැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත් … ව්‍යාපාදයට නොපැමිණි සිතැත්තෝ ව්‍යාපාදයට නො පැමිණි සිතැත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. සමිදිටුවෝ සමිදිටුවන් සමග සැසැඳෙති, එකතු වෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "263"
            },
            {
                "type": "centered",
                "text": "2. 3. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අට්‌ඨඞ්‌ගික සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "252. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: මිත්ථ්‍යා ‌දෘෂ්ටි ඇත්තෝ මිත්ථ්‍යා ‌දෘෂ්ටි ඇත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. මිත්ථ්‍යා සංකල්ප ඇත්තෝ … මිත්ථ්‍යා වචන ඇතතෝ … මිත්ථ්‍යා කර්මාන්ත ඇත්තෝ … මිත්ථ්‍යා ආජීව ඇතතෝ … මිත්ථ්‍යා ව්‍යායාම ඇතතෝ … මිත්ථ්‍යා ස්මෘති ඇත්තෝ … මිත්ථ්‍යා සමාධි ඇත්තෝ මිත්ථ්‍යා සමාධි ඇත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සම්‍යග්දෘෂ්ටි ඇත්තෝ සම්‍යග්දෘෂ්ටි ඇත්තවුන් සමග සැසැඳෙත්, එකතු වෙත් … සම්‍යක් සඞ්කල්ප ඇත්තෝ … සම්‍යක් වචන ඇත්තෝ … සම්‍යක් කර්මාන්ත ඇත්තෝ … සම්‍යගාජීව ඇත්තෝ … සම්‍යග්ව්‍යායාම ඇත්තෝ … සම්‍යක් ස්මෘති ඇත්තෝ … සම්‍යක් සමාධි ඇත්තෝ සම්‍යක් සමාධි ඇත්තවුන් සමග සැසැඳෙති, එකතුවෙතියි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දසඞ්‌ගික සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "253. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්වයෝ අදහස් වශයෙන් ම සැසැඳෙත්, එකතු වෙත්: මිත්ථ්‍යා ‌දෘෂ්ටි ඇත්තෝ මිත්ථ්‍යා ‌දෘෂ්ටි ඇත්තවුන් සමග සැසැඳෙත් එකතු වෙත්. මිත්ථ්‍යා සඞ්කල්ප ඇත්තෝ … මිත්ථ්‍යා වචන ඇතතෝ … මිත්ථ්‍යා කර්මාන්ත ඇත්තෝ … මිත්ථ්‍යා ආජීව ඇත්තෝ … මිත්ථ්‍යා ව්‍යායාම ඇත්තෝ … මිත්ථ්‍යා ස්මෘති ඇත්තෝ … මිත්ථ්‍යා සමාධි ඇත්තෝ … මිත්ථ්‍යා ඥාන ඇත්තෝ මිත්ථ්‍යා  ඥාන ඇත්තවුන් සමග සැසැඳෙත් එකතු වෙත්. මිත්ථ්‍යා විමුක්ති ඇත්තෝ මිත්ථ්‍යා විමුක්ති ඇත්තවුන් සමග සැසඳෙත්, එකතු වෙත්. ",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "සම්‍යග් දෘෂ්ටි ඇත්තෝ සම්‍යග් දෘෂ්ටි ඇත්තවුන් සමග සැසැඳෙත්. එකතු වෙත් … සම්‍යක් සඞ්කල්ප ඇත්තෝ … සම්‍යග් වචන ඇත්තෝ … සම්‍යක් කර්මාන්ත ඇත්තෝ … සම්‍යගාජීව ඇත්තෝ … සම්‍යග්ව්‍යායාම ඇත්තෝ … සම්‍යක් ස්මෘති ඇත්තෝ … සම්‍යක් සමාධි ඇත්තෝ … සම්‍යග් ඥාන ඇත්තෝ සම්‍යග් ඥාන ඇත්තවුන් සමග සැසැඳෙත්, එකතු වෙත්. සම්‍යග් විමුක්ති ඇත්තෝ සම්‍යග් විමුක්ති ඇත්තවුන් සමග සැසැඳෙත්, එකතු වෙති.",
                "type": "paragraph"
            },
            {
                "format": 11,
                "text": "(සියලු තැන්හි අතිතානාගතපච්චුප්පන්න කළ යුතු යි.)",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 20,
                "text": "**සූත්‍ර සත පිළිබඳ උද්දානය:**",
                "type": "unindented"
            },
            {
                "format": 20,
                "text": "අසමාහිත, දුස්සීල, පඤ්චසික්ඛාද, සත්තකම්මපථ, දසකම්මපථ, අට්ඨඞ්ගික යන සූත්‍ර හා දසඞ්ගික සූත්‍රය දැ යි සූත්‍ර සතෙකි.",
                "type": "paragraph"
            },
            {
                "format": 11,
                "text": "කම්මපථවර්ගය තුන්වැනි යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "265"
            },
            {
                "type": "heading",
                "text": "4. චතුධාතු වර්ගය",
                "level": 2
            },
            {
                "type": "centered",
                "text": "2. 4. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "චතුධාතු සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "254. මා විසින් මෙසේ අසන ලදී: එක් කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයෙහි ජේතවන නම් වූ අනේපිඬු සිටුහුගේ අරම්හි වැඩවසන සේක ...",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මේ ධාතු සතරෙකි. කවර සතරෙක යත්: පඨවීධාතු ය, ආපෝධාතු ය, තේජෝධාතු ය, වායෝධාතු යි. මහණෙනි, මේ ධාතු සතර යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 4. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පුබ්‌බ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "255.** සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සම්බෝධියෙන් පෙර ම සම්මාසම්බුද්ධ නො වූ බෝසත් වූ ම මට මේ අදහස විය. පඨවීධාතුහුගේ ආස්වාදය කවරේ ද? ආදීනවය කවරේ ද? නිස්සරණය කවරේ ද? ආපොධාතුහුගේ ආස්වාදය කවරේ ද? ආදීනවය කවරේ ද? නිස්සරණය කවරේ ද? තෙජොධාතුහුගේ ආස්වාදය කවරේ ද? ආදීනවය කවරේ ද? නිස්සරණය කවරේ ද? වායෝධාතුහුගේ ආස්වාදය කවරේ ද? ආදීනවය කවරේ ද? නිස්සරණය කවරේ දැ? යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ඒ මට මේ අදහස විය: පඨවීධාතුව නිසා යම් සුවයෙක් සොම්නසෙක් උපදී ද, මේ පඨවීධාතුවේ ආස්වාදය යි. යම් හෙයෙකින් පඨවීධාතුව අනිත්‍ය ද, දුක් ද, පෙරලෙන ස්වභාව ඇත්තේ ද, මේ පඨවීධාතුහුගේ ආදීනවය යි. පඨවීධාතුවෙහි දැඩිරාගය පිළිබද යම් දුරලීමෙක් වේ ද, දැඩිරාගය පිළිබඳ යම් ප්‍රහාණයෙක් වේ ද, මේ පඨවීධාතුහුගේ නිස්සරණ ය යි. ආපොධාතුව නිසා යම් ... තේජෝධාතුව නිසා යම් ... වායොධාතුව නිසා යම් සුවයෙක් සොම්නසෙක් උපදී ද, මේ වායොධාතුවෙහි ආස්වාදය යි. යම් හෙයකින් වායෝධාතුව අනිත්‍ය ද, දුක් ද, පෙරලෙනසුලු ද, මේ වායෝධාතුවෙහි ආදීනවය යි. වායෝධාතුවෙහි දැඩිරාගය පිළිබද යම් දුරලීමෙක් වේ ද, දැඩිරාගය පිළිබඳ යම් ප්‍රහාණයෙක් වේ ද, මේ වායොධාතුවෙහි නිස්සරණය යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම යම්තාක් මේ චතුධාතූන්ගේ ආස්වාදය ආස්වාද වශයෙනුත් ආදීනවය ආදීනව වශයෙනුත් නිස්සරණය නිස්සරණ වශයෙනුත් මෙසේ තතු සේ අවබොධ නො කෙළෙම් ද, මහණෙනි, ඒතාක් මම දෙවියන් සහිත මරුන් සහිත බඹුන් සහිත ලෙව්හි, මහණබමුණන් සහිත දෙවිමිනිසුන් සහිත ප්‍රජාවෙහි අනුත්තර සම්මාසම්බොධිය මැනවින් අවබෝධ කෙළෙමැ යි නො ම පිළිණ කෙළෙමි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "267"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම යම් කලෙක මේ චතුධාතූන්ගේ ආස්වාදය ආස්වාද වශයෙනුත් ආදීනවය ආදීනව වශයෙනුත් නිස්සරණය නිස්සරණ වශයෙනුත් මෙසේ තතු සේ අවබොධ කෙළෙම් ද, මහණෙනි, එකල්හි මම දෙවියන් සහිත මරුන් සහිත බඹුන් සහිත ලෙව්හි, මහණබමුණන් සහිත දෙවිමිනිසුන් සහිත ප්‍රජාවෙහි අනුත්තර සම්මාසම්බොධිය මැනවින් අවබොධ කෙළෙමැ යි පිළිණ කෙළෙමි. \"මාගේ අර්හත් ඵලවිමුක්තිය අකොප්‍ය ය (නිශ්චලය). මේ අන්තිම ජාතිය යි. දැන් පුනර්භවයෙක් නැතැ\" යි ඥානදර්ශනය ද (=ප්ස්විකුම් නුවණද) මට පහළ වී ය.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 4. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අස්සාදපරියෙසන සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "256. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම පඨවීධාතුවෙහි ආස්වාදපර්යේෂණය කෙළෙමි. පඨවීධාතුවෙහි යම් ආස්වාදයෙක් වේ නම්, එය අවබොධ කෙළෙමි. පඨවීධාතුවෙහි ආස්වාදය යම් පමණ වේ නම් එය මා විසින් නුවණින් මැනවින් දක්නා ලද්දේ ය. මහණෙනි, මම පඨවීධාතුවෙහි ආදිනවපර්යේෂණය කෙළෙමි. පඨවීධාතුවෙහි යම් ආදීනවයෙක් වේ නම්, එය අවබොධ කෙළෙමි. පඨවීධාතුවෙහි ආදීනවය යම් පමණ වේ නම්, එය මා විසින් නුවණින් මැනවින් දක්නා ලද්දේ ය. මහණෙනි, මම පඨවීධාතුවෙහි නිස්සරණපර්යේෂණය කෙළෙමි. පඨවීධාතුවෙහි යම් නිස්සරණයෙක් වේ නම්, එය අවබොධ කෙළමි. පඨවීධාතුවෙහි නිස්සරණය යම් පමණ වේ නම්, එය මා විසින් නුවණින් මැනවින් දක්නා ලද්දේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම ආපොධාතුවෙහි ... එය මා විසින් මැනවින් දක්නා ලද්දේ ය. මහණෙනි, මම තෙජොධාතුවෙහි ... එය මා විසින් මැනවින් දක්නා ලද්දේ ය. මහණෙනි, මම වායොධාතුවෙහි ආස්වාද පර්යේෂණය කෙළෙමි. වායොධාතුවෙහි යම් ආස්වාදයෙක් වේ නම්, එය අවබොධ කෙළෙමි. වායොධාතුවෙහි ආස්වාදය යම් පමණ වේ නම්, එය මා විසින් නුවණින් මැනවින් දක්නා ලද්දේ ය. මහණෙනි, මම වායොධාතුවෙහි ආදීනවය පර්යේෂණය කෙළෙමි. වායොධාතුවෙහි යම් ආදීනවයක් වේ නම්, එය අවබොධ කළෙමි. වායොධාතුවෙහි ආදීනවය යම් පමණ වේ නම්, එය මා විසින් නුවණින් මැනවින් දක්නා ලද්දේ ය. මහණෙනි, මම වායොධාතුවෙහි නිස්සරණ පර්යේෂණය කෙළෙමි. වායොධාතුවෙහි යම් නිස්සරණයෙක් වේ නම්, එය අවබොධ කෙළෙමි. වායොධාතුවෙහි නිස්සරණය යම් පමණ වේ නම්, එය මා විසින් නුවණින් මැනවින් දක්නා ලද්දේ ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම යම්තාක් මේ චතුධාතූන්ගේ ආස්වාදය ආස්වාද වශයෙනුත්, ආදීනවය ආදීනව වශයෙනුත්, නිස්සරණය නිස්සරණ වශයෙනුත් තතු සේ අවබොධ නො කෙළෙම් ද, මහණෙනි, ඒතාක් මම දෙවියන් සහිත මරුන් සහිත බඹුන් සහිත ලෙව්හි, මහණබමුණන් සහිත දෙවිමිනිසුන් සහිත ප්‍රජාවෙහි අනුත්තර සම්මාසම්බොධිය අවබොධ කෙළෙමැ යි නොම පිළිණ කෙළෙමි. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "269"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මම යම් කලෙක මේ චතුධාතූන්ගේ ආස්වාදය ආස්වාද වශයෙනුත් ආදීනවය ආදීනව වශයෙනුත්, නිස්සරණය නිස්සරණ වශයෙනුත්, තතු සේ අවබෝධ කෙළෙම් ද, මහණෙනි, එකල්හි මම දෙවියන් සහිත මරුන් සහිත බඹුන් සහිත ලෙව්හි, මහණබමුණන් සහිත දෙවිමිනිසුන් සහිත ප්‍රජායෙහි අනුත්තර වූ සම්මාසම්බොධිය අවබෝධ කෙළෙමැ යි පිළිණ කෙළෙමි. \"මාගේ අර්හත්ඵලවිමුක්තිය අකොප්‍ය ය. මේ අන්තිම ජාතිය යි. දැන් පුනර්භවයෙක් නැතැ\" යි ඥානදර්ශනයද මට පහළ වීය.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 4. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නොචෙදං සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "257. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ඉදින් මේ පඨවීධාතුයෙහි ආස්වාදයෙක් නො වී නම් සත්වයෝ පඨවීධාතුවෙහි නො ඇලෙන්නාහ. මහණෙනි, යම් හෙයෙකින් පඨවීධාතුවෙහි ආස්වාදයෙක් ඇද්ද, එහෙයින් සත්වයෝ පඨවීධාතුයෙහි ඇලෙත්. මහණෙනි, ඉදින් මේ පඨවීධාතුවෙහි ආදීනවයෙක් නො වී නම් සත්වයෝ පඨවීධාතුවෙහි නො කළකිරෙන්නාහු ය. මහණෙනි, යම් හෙයකින් පඨවීධාතුවෙහි ආදීනවයෙක් ඇද්ද, එහෙයින් සත්වයෝ පඨවීධාතුයෙහි කළකිරෙත්. මහණෙනි, ඉදින් පඨවීධාතුවෙන් නිස්සරණයෙක් නො වී නම්, සත්වයෝ පඨවීධාතුයෙන් නො නික්මෙන්නාහ. මහණෙනි, යම් හෙයෙකින් පඨවීධාතුවෙන් නික්මීමෙක් ඇද්ද, එහෙයින් සත්වයෝ පඨවීධාතුයෙන් නික්මෙති.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, ඉදින් මේ ආපෝධාතුවෙහි ආස්වාදයෙක් නො වී නම් ... නික්මෙති. මහණෙනි, ඉදින් මේ තේජෝධාතුවෙහි ආස්වාදයෙක් නො වී නම් ... නික්මෙති. මහණෙනි, ඉදින් මේ වායෝධාතුවෙහි ආස්වාදයෙක් නො වී නම්, සත්වයෝ වායෝධාතුවෙහි නො ඇලෙන්නාහු ය. මහණෙනි, යම් හෙයෙකින් වායෝධාතුයෙහි ආස්වාදයෙක් ඇද්ද, එහෙයින් සත්වයෝ, වායෝධාතුවෙහි ඇලෙති. මහණෙනි, ඉදින් වායෝධාතුවෙහි ආදීනවයෙක් නො වි නම්, සත්වයෝ වායෝධාතුවෙහි නො කළකිරෙන්නාහු ය. මහණෙනි, යම් හෙයෙකින් වායෝධාතුවෙහි ආදීනවයෙක් ඇද්ද, එහෙයින් සත්වයෝ වායෝධාතුවෙහි කළකිරෙති. මහණෙනි, ඉදින් වායෝධාතුවෙන් නිස්සරණයෙක් නො වී නම්, සත්වයෝ වායෝධාතුයෙන් නො නික්මෙන්නාහු ය. මහණෙනි, යම් හෙයකින් වායෝධාතුවෙන් නික්මීමෙක් ඇද්ද, එහෙයින් සත්වයෝ වායෝධාතුවෙන් නික්මෙති. ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "271"
            },
            {
                "format": 13,
                "text": "මහණෙනි, සත්වයෝ යම්තාක් මේ චතුධාතූන්ගේ ආස්වාදය ආස්වාද වශයෙනුත්, ආදීනවය ආදීනව වශයෙනුත්, නිස්සරණය නිස්සරණ වශයෙනුත් තතු සේ අවබොධ නො කළාහු ද, මහණෙනි, ඒ තාක් දෙවියන් සහිත මරුන් සහිත බඹුන් සහිත ලෝකයෙහි සත්වයෝ, මහණබමුණන් සහිත දෙවිමිනිසුන් සහිත ප්‍රජාවෝ නික්මුනාහු, වෙන් වූවාහු, මිදුනාහු, ඉක්මවූ කෙලෙස් සීමා ඇති සිතින් යුක්ත ව නො ම විසූහ.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යම් කලෙක සත්වයෝ මේ චතුධාතූන්ගේ ආස්වාදය ආස්වාද වශයෙනුත් ආදීනවය අදීනව වශයෙනුත් නිස්සරණය නිස්සරණ වශයෙනුත් තතු සේ අවබෝධ කළාහු ද, මහණෙනි, එකල්හි දෙවියන් සහිත මරුන් සහිත බඹුන් සහිත ලෝකයෙහි සත්වයෝ, මහණ බමුණන් සහිත දෙවිමිනිසුන් සහිත ප්‍රජාවෝ නික්මුනාහු, වෙන් වූවාහු, මිදුනාහු ඉක්මවූ කෙලෙස් සීමා ඇතී සිතින් යුතු ව වෙසෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 4. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුක්‌ඛලක්ඛණ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "258. **සැවැත්නුවර **-",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මේ පඨවීධාතුව ද ඒකාන්තයෙන්ම දුක් වූවක්, දුකෙහි පතිත වූවක්, දුකෙහි වැද ගත්තක්, සුවයෙහි නො වැද ගත්තක් වී නම්, මේ සත්වයෝ පඨවීධාතුවෙහි නො ඇලෙන්නාහුය. මහණෙනි, යම් හෙයෙකින් පඨවීධාතුව සුඛ (හෙතු) ද, සුඛයෙන් යුක්තද, සුඛාවතීණි ද, දුඃඛාවතිණි නො වේ ද, එහෙයින් සත්වයෝ පඨවීධාතුවෙහි ඇලෙති. මහණෙනි, මේ ආපෝධාතුව ද ... මහණෙනි, මේ තේජෝධාතුව ද ... මහණෙනි, මේ වායෝධාතුව ද ඒකාන්තයෙන් දුක් වූවක්, දුකෙන් යුක්ත වූවක්, දුකෙන් අවතීර්ණ වූවක්, සුවයෙන් අවතීර්ණ නො වුවක් වී නම්, මේ සත්වයෝ වායෝධාතුවෙහි නො ඇලෙන්නාහු ය. මහණෙනි, යම් හෙයෙකින් වායෝධාතුව සුඛ ද, සුඛයෙන් යුක්ත ද, සුඛයෙන් අවතීර්ණ ද, දුඃඛයෙන් අවතීර්ණ නො නොවේ ද, එහෙයින් සත්වයෝ වායොධාතුවෙහි ඇලෙත්.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මේ පඨවීධාතුව ද එකාන්තයෙන් සුව වූවක්, සුවයෙන් යුක්ත වූවක්, සුවයෙහි පිවිසගත්තක්, දුකෙහි නො පිවිසගත්තක් වී නම්, මේ සත්වයෝ පඨවීධාතුයෙහි නො කළකිරෙන්නාහු ය. මහණෙනි, යම් හෙයෙකින් පඨවීධාතුවත් දුක් ද, දුකෙන් යුක්ත ද, දුකෙහි පිවිසගත්තී ද, සුවයෙහි නො පිවිසගත්තී ද, එහෙයින් සත්වයෝ පඨවීධාතුවෙහි කළකිරෙත්. මහණෙනි, මේ ආපෝධාතුව ද ... මහණෙනි, මේ තෙජොධාතුව ද ... මහණෙනි, මේ වායෝධාතුවද ඒකාන්තයෙන් සුව වූවක්, සුවයෙන් යුක්ත වූවක්, සුවයෙහි පිවිසගත්තක්, දුකෙහි නො පිවිසගත්තක්වී නම් මේ සත්වයෝ වායොධාතුයෙහි නො කළකිරෙන්නාහු ය. මහණෙනි, යම් හෙයකින් වායොධාතුවත් දුක් ද, දුකෙන් යුක්ත ද, දුකෙහි පිවිසගත්තී ද, සුවයෙහි නො පිවිසගත්තී ද, එහෙයින් සත්වයෝ වායොධාතුයෙහි කළකිරෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "273"
            },
            {
                "type": "centered",
                "text": "2. 4. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අභිනන්‌ද සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "259. **සැවැත්නුවර **-",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යමෙක් පඨවීධාතුව පතා ද, හෙතෙමේ දුක පතයි. යමෙක් දුක පතා ද, හෙතෙමේ දුකින් නො මිදුනේ ය යි කියමි. යමෙක් ආපෝධාතුව පතා ද ... යමෙක් තේජෝධාතුව පතා ද, ... යමෙක් වායොධාතුව පතා ද, හෙතෙමේ දුක පතයි. යමෙක් දුක පතා ද, හෙතෙමේ දුකින් නො මිදුනේ ය යි කියමි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යමෙකුන් පඨවීධාතුව නො පතා ද, හෙතෙමේ දුක නො පතයි. යමෙක් දුක නො පතා ද, හෙ තෙමේ දුකින් මිදුනේ ය යි කියමි. යමෙක් ආපෝධාතුව ... යමෙක් තේජෝධාතුව ... යමෙක් වායෝධාතුව නො පතා ද, හෙතෙමේ දුක නො පතයි. යමෙක් දුක නො පතා ද, හෙතෙමේ දුකින් මිදුනේ ය යි කියමි යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 4. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "උප්‌පාද සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "260. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, පඨවීධාතුවෙහි යම් ඉපැද්මෙක් පැවැත්මෙක් නිපැද්මෙක් පහළ වීමෙක් වේ ද, මේ දුක්හුගේ ඉපැද්ම ය, රෝගයන්ගේ පැවැත්ම ය, ජරාමරණයාගේ පහළ වීමය. ආපෝධාතුවෙහි යම් ... තේජෝධාතුවෙහි යම් ... වායෝධාතුවෙහි යම් ඉපැද්මෙක් පැවැත්මෙක් නිපැද්මෙක් පහළ විමෙක් වේ ද, මේ දුක්හුගේ ඉපැද්ම ය, රෝගයන්ගේ පැවැත්ම ය, ජරාමරණයේ පහළ වීම ය.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, පඨවීධාතුවෙහි යම් නිරෝධයෙක් ව්‍යූපශමයෙක් අස්තඞ්ගමයෙක් වේ ද, මේ දුක්හුගේ නිරොධය යි. රෝගයන්ගේ ව්‍යූපශමය යි. ජරාමරණයේ අස්තඞ්ගමය යි. ආපෝධාතුවෙහි යම් ... තේජෝධාතුවෙහි යම් ... වායෝධාතුවෙහි යම් නිරෝධයෙක් ව්‍යූපශමයෙක් අස්තඞ්ගමයෙක් වේ ද, මේ දුක්හුගේ නිරෝධය යි රෝගයන්ගේ ව්‍යූපශමය යි. ජරාමරණයේ අස්තඞ්ගමය යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 4. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සමණබ්‍රාහ්‌මණ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "261 **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මේ ධාතු සතරෙකි. කවර සතරෙක යත්: පඨවීධාතු ය, ආපෝධාතු ය, තේජෝධාතු ය, වායෝධාතු යි.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යම් කිසි මහණ කෙණෙක් හෝ බමුණු කෙනෙක් හෝ මේ සිවුධාතුන්ගේ ආස්වාදයත් ආදීනවයත් නිස්සරණයත් තතු සේ නො දනිද්ද, මහණෙනි, ඒ මේ මහණෝ හෝ බමුණෝ හෝ මහණුන් කෙරෙහි හෝ මහණහ යි සම්මත නො වෙති. බමුණන් කෙරෙහි හෝ බමුණහ යි සම්මත නො වෙති. ඒ ආයුෂ්මත්හු මහණබැව්හි අරුත (සිවුමග) හෝ බමුණුබැව්හි අරුත (සිව්පල) හෝ මේ අත්බැව්හී ම තුමූ ම දැන ප්‍රත්‍යක්ෂ කොට එයට පැමිණ නො ම වෙසෙති.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "275"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යම් කිසි මහණ කෙණෙක් හෝ බමුණු කෙනෙක් හෝ මේ චතුධාතූන්ගේ ආස්වාදයත් ආදීනවයත් නිස්සරණයත් තතු සේ දනිද්ද, මහණෙනි, ඒ මේ මහණෝ හෝ බමුණෝ හෝ මහණුන් කෙරෙහිත් මහණහ යි සම්මතයහ. බමුණන් කෙරෙහි බමුණහ යි සම්මතයහ. ඒ ආයුෂ්මත්හු ද මහණ බැව්හී පලයත්, බමුණු බැව්හි පලයත් මේ අත්බැව්හී ම තුමූ දැන ඊට එළබ වෙසෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 4. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දෙවන සමණබ්‍රාහ්‌මණ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "262. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, මේ ධාතු සතරෙකි. කවර සතරෙක් යත්: පඨවීධාතු ය, ආපෝධාතු ය, තේජෝධාතු ය, වායෝධාතු ය යි. මහණෙනි, යම් කිසි මහණ කෙණෙක් හෝ බමුණු කෙනෙක් හෝ මේ සිවුධාතුන්ගේ සමුදයත් අත්ඞ්ගමයත් ආස්වාදයත් ආදීනවයත් නිස්සරණයත් තතු සේ නො දනිද්ද ... තතු සේ දනිද්ද, ඒ මහණෝ හෝ බමුණෝ ... තුමූ වෙසෙසින් දැන පසක් කොට ඊට පැමිණ වෙසෙති යි. ",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 4. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තෙවන සමණබ්‍රාහ්‌මණ සූත්‍රය",
                "level": "1"
            },
            {
                "format": 13,
                "text": "263. **සැවැත්නුවර -**",
                "type": "unindented"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යම් යම් කිසි මහණ කෙණෙක් හෝ බමුණු කෙනෙක් හෝ පඨවීධාතුව නො දනිද්ද, පඨවීධාතු සමුදය නො දනිද්ද, පඨවීධාතු නිරෝධය නො දනිද්ද, පඨවීධාතු නිරෝධගාමිනී පටිපදාව නො දනිද්ද ... ආපෝධාතුව නො දනිද්ද ... තේජෝධාතුව නො දනිද්ද … වායෝධාතුව නො දනිද්ද, වායෝධාතුසමුදය නො දනිද්ද, වායෝධාතුනිරෝධය නො දනිද්ද, වායෝධාතු නිරෝධගාමිනි පටිපදාව නො දනිද්ද, මහණෙනි, ඒ මේ මහණහු හෝ බමුණහු හෝ මහණුන් කෙරෙහි හෝ මහණහ යි සම්මත නො වෙති. බමුණන් කෙරෙහි හෝ බමුණහ යි සම්මත නො වෙති. ඒ ආයුෂ්මත්හු ශ්‍රමණ භාවාර්ථය හෝ බ්‍රහ්මණභාවාර්ථය හෝ මේ අත්බැව්හි ම තුමූ දැන පසක් කොට (එයට) පැමිණ නො ද වෙසෙති.",
                "type": "paragraph"
            },
            {
                "format": 13,
                "text": "මහණෙනි, යම් කිසි මහණ කෙණෙක් හෝ බමුණු කෙනෙක් හෝ පඨවීධාතුව දනිද්ද, පඨවීධාතුසමුදය දනිද්ද, පඨවීධාතුනිරෝධය දනිද්ද, පඨවීධාතුනිරෝධගාමිනීපටිපදාව දනිද්ද ... ආපෝධාතුව ... තේජෝධාතුව ... වායෝධාතුව දනිද්ද, වායොධාතුසමුදය දනිද්ද, වායෝධාතුනිරෝධය දනිද්ද, වායෝධාතුනිරෝධගාමිනීපටිපදාව දනිද්ද, මහණෙනි, ඒ මේ මහණහු හෝ බමුණහු හෝ මහණුන් කෙරෙහිත් මහණහ යි සම්මත වෙති. බමුණන් කෙරෙහිත් බමුණහ යි සම්මත වෙති. ඒ ආයුෂ්මත්හු ද ශ්‍රමන භාවාර්ථය හෝ බ්‍රහ්මණභාවාර්ථය හෝ මේ අත්බැව්හි ම තුමූ දැන පසක් කොට එයට පැමිණ වෙසෙති යි.",
                "type": "paragraph"
            },
            {
                "format": 11,
                "text": "චතුධාතු වර්ගය සිවුවැනි යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "format": 20,
                "text": "**එහි උද්දානය:**",
                "type": "unindented"
            },
            {
                "format": 20,
                "text": "චතුධාතු, පුබ්බ, අස්සාද, නොවෙදං, දුක්ඛ, අභිනන්දන, උප්පාද යන සූත්‍ර හා සමානබ්‍රහ්මණ සුත්‍ර තුණ දැ යි සූත්‍ර දශයෙකි.",
                "type": "paragraph"
            },
            {
                "format": 9,
                "text": "ධාතුසංයුත්තය නිමියේ ය.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ]
    }
]