[
    {
        "filename": "sn-kdkv-2",
        "bookId": 18,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "340"
            },
            {
                "type": "heading",
                "text": "2. රාධසංයුත්තං",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. පඨම මාරවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "2. 1. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මාර සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "160.** සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මා රාධො යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : මාරො මාරොති භන්තෙ, වුච්චති. කිත්තාවතා නු ඛො භන්තෙ, මාරොති{1 මාරොති වුච්චති - සීමු, සී 2.}."
            },
            {
                "type": "paragraph",
                "text": "රූපෙ ඛො රාධ සති මාරො වා අස්ස මාරෙතා වා යො වා පන මීයති.{2 මීය්යති - ස්යා.} තස්මා තිහත්වං රාධ රූපං මාරොති පස්ස, මාරෙතාති පස්ස, මීයතීති පස්ස, රොගොති පස්ස, ගණ්ඩොති පස්ස, සල්ලන්ති පස්ස, අඝන්ති පස්ස, අඝභූතන්ති පස්ස. යෙ නං එවං පස්සන්ති තෙ සම්මා පස්සන්ති. වෙදනාය සති මාරො වා අස්ස මාරෙතා වා යො වා පන මීයති.{3 මීය්යති - ස්යා.} තස්මාතිහ ත්වං රාධ, වෙදනං මාරොති පස්ස මාරෙතාති පස්ස මීයතීති පස්ස -පෙ- යෙ නං එවං පස්සන්ති තෙ සම්මා පස්සන්ති. සඤ්ඤාය සති -පෙ- සඞ්ඛාරෙසු සති මාරො වා අස්ස මාරෙතා වා යො වා පන මීයති. තස්මාතිහ ත්වං රාධ සඞ්ඛාරෙ මාරො’ති පස්ස මාරෙතාති පස්ස මීයතීති පස්ස -පෙ- යෙ නං එවං පස්සන්ති තෙ සම්මා පස්සන්ති. විඤ්ඤාණෙ සති මාරො වා අස්ස මාරෙතා වා යො වා පන මීයති. තස්මාතිහ ත්වං රාධ, විඤ්ඤාණං මාරොති පස්ස, මාරෙතාති පස්ස, මීයතීති පස්ස, රොගොති පස්ස, ගණ්ඩොති පස්ස, සල්ලන්ති පස්ස, අඝන්ති පස්ස, අඝභූතන්ති පස්ස. යෙ නං එවං පස්සන්ති, තෙ සම්මා පස්සන්තීති."
            },
            {
                "type": "paragraph",
                "text": "සම්මාදස්සනං පන භන්තෙ, කිමත්ථියන්ති?"
            },
            {
                "type": "paragraph",
                "text": "සම්මාදස්සනං ඛො රාධ, නිබ්බිදත්ථං."
            },
            {
                "type": "paragraph",
                "text": "නිබ්බිදා පන භන්තෙ, කිමත්ථියාති?"
            },
            {
                "type": "paragraph",
                "text": "නිබ්බිදා ඛො රාධ, විරාගත්ථා."
            },
            {
                "type": "paragraph",
                "text": "විරාගො පන භන්තෙ කිමත්ථියොති?"
            },
            {
                "type": "paragraph",
                "text": "විරාගො ඛො රාධ, විමුත්තත්ථො."
            },
            {
                "type": "page-break",
                "text": "342"
            },
            {
                "type": "paragraph",
                "text": "විමුත්ති පන භන්තෙ කිමත්ථියා’ති?"
            },
            {
                "type": "paragraph",
                "text": "විමුත්ති ඛො රාධ, නිබ්බානත්ථා."
            },
            {
                "type": "paragraph",
                "text": "නිබ්බානං පන භන්තෙ, කිමත්ථියන්ති?"
            },
            {
                "type": "paragraph",
                "text": "අච්චසරා{1 අච්චගාරාධ - මඡසං.} රාධ, පඤ්හං. නාසක්ඛි පඤ්හස්ස පරියන්තං ගහෙතුං. නිබ්බානොගධං හි රාධ, බ්රහ්මචරියං වුස්සති නිබ්බානපරායනං නිබ්බානපරියොසානන්ති."
            },
            {
                "type": "centered",
                "text": "2. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සත්ත සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "161. **සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : සත්තො සත්තොති භන්තෙ, වුච්චති. කිත්තාවතා නු ඛො භන්තෙ, සත්තොති වුච්චති?"
            },
            {
                "type": "paragraph",
                "text": "රූපෙ ඛො රාධ, යො ඡන්දො යො රාගො යා නන්දී යා තණ්හා. තත්ර සත්තො, තත්ර විසත්තො තස්මා සත්තොති වුච්චති. වෙදනාය යො ඡන්දො යො රාගො -පෙ- සඤ්ඤාය -පෙ- සඞ්ඛාරෙසු -පෙ- විඤ්ඤාණෙ යො ඡන්දො යො රාගො යා නන්දී යා තණ්හා තත්ර සත්තො තත්ර විසත්තො. තස්මා සත්තොති වුච්චති."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථා’පි රාධ, කුමාරකා වා කුමාරිකායො{2 කුමාරියො වා - සීමු, සී 1.} වා පංස්වාගාරකෙහි කීළන්ති{3 පංස්වාගාරකෙළෙසුකීළන්තා - සීමු, සී 1. 2.} යාවකීවඤ්ච තෙසු පංස්වාගාරකෙසු අවිගත{4 අවීත - ස්යා.}රාගා හොන්ති අවිගත{5 අවීත - ස්යා.}ච්ඡන්දා අවිගත{6 අවීත - ස්යා.}පෙමා අවිගත{7 අවීත - ස්යා.}පිපාසා අවිගත{8 අවීත - ස්යා.}පරිළාහා අවිගත{9 අවීත - ස්යා.}තණ්හා තාව තානි පංස්වාගාරකානි අල්ලීයන්ති කෙලායන්ති ධනායන්ති{10 මනායන්ති - සීමු. PTS.}. මමායන්ති."
            },
            {
                "type": "paragraph",
                "text": "යතො ච ඛො රාධ, කුමාරකා වා කුමාරිකායො වා තෙසු පංස්වාගාරකෙසු විගතරාගා හොන්ති විගතඡන්දා විගතපෙමා විගතපිපාසා විගතපරිළාහා විගතතණ්හා, අථ ඛො තානි පංස්වාගාරකානි හත්ථෙහි ච පාදෙහි ච විකිරන්ති විධමන්ති විද්ධංසෙන්ති විකීළනිකං.{11 විකිළනියං - මඡසං.} කරොන්ති."
            },
            {
                "type": "paragraph",
                "text": "එවමෙව ඛො රාධ, තුම්හෙපි රූපං විකිරථ විධමථ විද්ධංසෙථ, විකීළනිකං කරොථ. තණ්හක්ඛයාය පටිපජ්ජථ. වෙදනං විකිරථ -පෙ- සඤ්ඤං විකිරථ -පෙ- සඞ්ඛාරෙ විකිරථ -පෙ- විඤ්ඤාණං විකිරථ විධමථ විද්ධංසෙථ විකීළනිකං කරොථ තණ්හක්ඛයාය පටිපජ්ජථ. තණ්හක්ඛයො හි රාධ, නිබ්බානන්ති."
            },
            {
                "type": "page-break",
                "text": "344"
            },
            {
                "type": "centered",
                "text": "2. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "භවනෙත්ති සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "162. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො, භගවන්තං එතදවොච : භවනෙත්ති භවනෙත්තීති{1 “භවනෙත්තිනිරොධො භවනෙත්තිනිරොධොති - මඡසං. “භවනෙත්තිභවනෙත්තිනිරොධොති - PTS.} භන්තෙ, වුච්චති. කතමා නු ඛො භන්තෙ, භවනෙත්ති. කතමො භවනෙත්තිනිරොධොති?"
            },
            {
                "type": "paragraph",
                "text": "රූපෙ ඛො රාධ, යො ඡන්දො යො රාගො යා නන්දී යා තණ්හා යෙ උපයුපාදානා චෙතසො අධිට්ඨානාභිනිවෙසානුසයා, අයං වුච්චති භවනෙත්ති. තෙසං නිරොධා{2 නීරොධො - මඡසං.} භවනෙත්තිනිරොධො. වෙදනාය යො ඡන්දො -පෙ- සඤ්ඤාය යො ඡන්දො -පෙ- සඞ්ඛාරෙසු යො ඡන්දො -පෙ- විඤ්ඤාණෙ යො ඡන්දො යො රාගො යා නන්දී යා තණ්හා යෙ උපයූපාදානා චෙතසො අධිට්ඨානාභිනිවෙසානුසයා අයං වුච්චති භවනෙත්ති. තෙසං නිරොධා{3 නීරොධො - මඡසං.} භවනෙත්තිනිරොධොති."
            },
            {
                "type": "centered",
                "text": "2. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පරිඤ්ඤෙය්ය සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "163. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නං ඛො ආයස්මන්තං රාධං භගවා එතදවොච : පරිඤ්ඤෙය්යෙ ච රාධ ධම්මෙ දෙසෙස්සාමි. පරිඤ්ඤඤ්ච පරිඤ්ඤාතාවිඤ්ච පුග්ගලං තං සුණාහි. -පෙ- භගවා එතදවොච :"
            },
            {
                "type": "paragraph",
                "text": "කතමෙ ච රාධ, පරිඤ්ඤෙය්යා ධම්මා: රූපං ඛො රාධ, පරිඤ්ඤෙය්යො ධම්මො. වෙදනා පරිඤ්ඤෙය්යො ධම්මො, සඤ්ඤා -පෙ- සඞ්ඛාරා -පෙ- විඤ්ඤාණං පරිඤ්ඤෙය්යො ධම්මො. ඉමෙ වුච්චන්ති රාධ, පරිඤ්ඤෙය්යා ධම්මා."
            },
            {
                "type": "paragraph",
                "text": "කතමා ච රාධ, පරිඤ්ඤා: යො ඛො රාධ, රාගක්ඛයො දොසක්ඛයො මොහක්ඛයො අයං වුච්චති රාධ, පරිඤ්ඤා."
            },
            {
                "type": "paragraph",
                "text": "කතමො ච රාධ, පරිඤ්ඤාතාවී පුග්ගලො?"
            },
            {
                "type": "paragraph",
                "text": "අරහාතිස්ස වචනීයං. යොයං{4 ය්වායං - මඡසං.} ආයස්මා එවංනාමො එවංගොත්තො. අයං වුච්චති රාධ, පරිඤ්ඤාතාවී පුග්ගලොති."
            },
            {
                "type": "page-break",
                "text": "346"
            },
            {
                "type": "centered",
                "text": "2. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සමණ සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "164. **සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නං ඛො ආයස්මන්තං රාධං භගවා එතදවොච : පඤ්චිමෙ රාධ, උපාදානක්ඛන්ධා. කතමෙ පඤ්ච, සෙය්යථිදං : රූපූපාදානක්ඛන්ධො -පෙ- විඤ්ඤාණූපාදානක්ඛන්ධො. යෙ හි කෙචි රාධ, සමණා වා බ්රාහ්මණා වා ඉමෙසං පඤ්චන්නං උපාදානක්ඛන්ධානං අස්සාදං ච ආදීනවං ච නිස්සරණං ච යථාභූතං නප්පජානන්ති නමෙතෙ රාධ, සමණා වා බ්රාහ්මණා වා සමණෙසු වා සමණසම්මතා බ්රාහ්මණෙසු වා බ්රාහ්මණසම්මතා. න ච පන තෙ ආයස්මන්තො සාමඤ්ඤත්ථං වා බ්රහ්මඤ්ඤත්ථං වා දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරන්ති."
            },
            {
                "type": "paragraph",
                "text": "යෙ ච ඛො කෙචි රාධ, සමණා වා බ්රාහ්මණා වා ඉමෙසං පඤ්චන්නං උපාදානක්ඛන්ධානං අස්සාදං ච ආදීනවං ච නිස්සරණං ච යථාභූතං පජානන්ති, තෙ ඛො තෙ රාධ, සමණා වා බ්රාහ්මණා වා සමණෙසු චෙව සමණසම්මතා, බ්රාහ්මණෙසු ච බ්රාහ්මණසම්මතා තෙ ච පනායස්මන්තො සාමඤ්ඤත්ථං ච බ්රහ්මඤ්ඤත්ථං ච දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරන්තීති."
            },
            {
                "type": "centered",
                "text": "2. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය සමණ සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "165. **සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නං ඛො ආයස්මන්තං රාධං භගවා එතදවොච : පඤ්චිමෙ රාධ, උපාදානක්ඛන්ධා. කතමෙ පඤ්ච, සෙය්යථීදං: රූපුපාදානක්ඛන්ධො -පෙ- විඤ්ඤාණුපාදානක්ඛන්ධො. යෙ හි කෙචි රාධ, සමණා වා බ්රාහ්මණා වා ඉමෙසං පඤ්චන්නං උපාදානක්ඛන්ධානං සමුදයඤ්ච අත්ථඞ්ගමඤ්ච අස්සාදං ච ආදීනවං ච නිස්සරණං ච යථාභූතං නප්පජානන්ති -පෙ- සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහරන්තීති."
            },
            {
                "type": "centered",
                "text": "2. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සොතාපන්න සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "166. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නං ඛො ආයස්මන්තං රාධං භගවා එතදවොච : පඤ්චිමෙ රාධ, උපාදානක්ඛන්ධා. කතමෙ පඤ්ච, රූපූපාදානක්ඛන්ධො -පෙ- විඤ්ඤාණූපාදානක්ඛන්ධො."
            },
            {
                "type": "paragraph",
                "text": "යතො ඛො රාධ, අරියසාවකො ඉමෙසං පඤ්චන්නං උපාදානක්ඛන්ධානං සමුදයං ච අත්ථඞ්ගමං ච අස්සාදං ච ආදීනවං ච නිස්සරණං ච යථාභූතං පජානාති. අයං වුච්චති රාධ, අරියසාවකො සොතාපන්නො අවිනිපාතධම්මො නියතො සම්බොධිපරායනොති."
            },
            {
                "type": "page-break",
                "text": "348"
            },
            {
                "type": "centered",
                "text": "2. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අරහන්ත සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "167. **සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නං ඛො ආයස්මන්තං රාධං භගවා එතදවොච : පඤ්චිමෙ රාධ, උපාදානක්ඛන්ධා. කතමෙ පඤ්ච, සෙය්යථීදං: රූපුපාදානක්ඛන්ධො -පෙ- විඤ්ඤාණුපාදානක්ඛන්ධො."
            },
            {
                "type": "paragraph",
                "text": "යතො ඛො රාධ, භික්ඛු ඉමෙසං පඤ්චන්නං උපාදානක්ඛන්ධානං සමුදයඤ්ච අත්ථඞ්ගමං ච අස්සාදං ච ආදීනවං ච නිස්සරණං ච යථාභූතං විදිත්වා අනුපාදා විමුත්තො හොති, අයං වුච්චති රාධ, භික්ඛු අරහං ඛීණාසවො වුසිතවා කතකරණීයො ඔහිතභාරො අනුප්පත්තසදත්ථො පරික්ඛීණභවසඤ්ඤොජනො සම්මදඤ්ඤා විමුත්තොති."
            },
            {
                "type": "centered",
                "text": "2. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඡන්දරාග සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "168. **සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නං ඛො ආයස්මන්තං රාධං භගවා එතදවොච :"
            },
            {
                "type": "paragraph",
                "text": " රූපෙ ඛො රාධ, යො ඡන්දො යො රාගො යා නන්දී යා තණ්හා, තං පජහථ. එවං තං රූපං පහීනං භවිස්සති උච්ඡින්නමූලං තාලාවත්ථුකතං අනභාවකතං ආයතිං අනුප්පාදධම්මං. වෙදනාය යො ඡන්දො යො රාගො යා නන්දී යා තණ්හා තං පජහථ. එවං සා වෙදනා පහීනා භවිස්සති උච්ඡින්නමූලා තාලාවත්ථුකතා අනභාවංකතා ආයතිං අනුප්පාදධම්මා. සඤ්ඤාය -පෙ- සඞ්ඛාරෙසු යො ඡන්දො යො රාගො යා නන්දී යා තණ්හා, තං පජහථ. එවං තෙ සඞ්ඛාරා පහීනා භවිස්සන්ති උච්ඡින්නමූලා තාලාවත්ථුකතා අනභාවකතා ආයතිං අනුප්පාදධම්මා. විඤ්ඤාණෙ යො ඡන්දො යො රාගො යා නන්දී යා තණ්හා, තං පජහථ. එවං තං විඤ්ඤාණං පහීනං භවිස්සති උච්ඡින්නමූලං තාලාවත්ථුකතං ආයතිං අනුප්පාදධම්මන්ති."
            },
            {
                "type": "centered",
                "text": "2. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය ඡන්දරාග සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "169. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නං ඛො ආයස්මන්තං රාධං භගවා එතදවොච :"
            },
            {
                "type": "paragraph",
                "text": "රූපෙ ඛො රාධ, යො ඡන්දො යො රාගො යා නන්දී යා තණ්හා යෙ උපයූපාදානා{1 උපායුපාදානා - සීමු.} චෙතසො අධිට්ඨානාභිනිවෙසානුසයා තෙ පජහථ. එවං තං රූපං පහීනං භවිස්සති උච්ඡින්නමූලං තාලාවත්ථුකතං අනභාවංකතං ආයතිං අනුප්පාදධම්මං. වෙදනාය යො ඡන්දො යො රාගො යා නන්දී යා තණ්හා යෙ උපයුපාදානා චෙතසො අධිට්ඨානාභිනිවෙසානුසයා, තෙ පජහථ. එවං සා වෙදනා පහීනා භවිස්සති උච්ඡින්නමූලා තාලාවත්ථුකතා අනභාවකතා ආයතිං අනුප්පාදධම්මා. සඤ්ඤාය -පෙ- සඞ්ඛාරෙසු යො ඡන්දො යො රාගො යා නන්දී යා තණ්හා යෙ උපයූපාදානා{1 උපායුපාදානා - සීමු.} චෙතසො අධිට්ඨානාභිනිවෙසානුසයා තෙ පජහථ. එවං තෙ සඞ්ඛාරා පහීනා භවිස්සන්ති උච්ඡින්නමූලා තාලාවත්ථුකතා අනභාවකතා ආයතිං අනුප්පාදධම්මා. විඤ්ඤාණෙ යො ඡන්දො යො රාගො යා නන්දී යා තණ්හා යෙ උපයූපාදානා{2 උපායුපාදානා - සීමු.} චෙතසො අධිට්ඨානාභිනිවෙසානුසයා, තෙ පජහථ. එවං තං විඤ්ඤාණං පහීනං භවිස්සති උච්ඡින්නමූලං තාලාවත්ථුකතං අනභාවංකතං ආයතිං අනුප්පාදධම්මන්ති."
            },
            {
                "type": "centered",
                "text": "මාරවග්ගො පඨමො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං :**"
            },
            {
                "type": "gatha",
                "text": "මාරො සත්තො භවනෙත්ති - පරිඤ්ඤෙය්යා සමණා දුවෙ,\nසොතාපන්නො අරහා ච - දුවෙ ච ඡන්දරාගියාති."
            },
            {
                "type": "page-break",
                "text": "352"
            },
            {
                "type": "heading",
                "text": "2. දුතිය මාරවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "2. 2. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මාර සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "170. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : ‘මාරො මාරො’ති භන්තෙ, වුච්චති. කතමො නු ඛො භන්තෙ මාරොති?"
            },
            {
                "type": "paragraph",
                "text": "රූපං ඛො රාධ මාරො, වෙදනා මාරො, සඤ්ඤා මාරො, සඞ්ඛාරා මාරො, විඤ්ඤාණං මාරො. එවං පස්සං රාධ, සුතවා අරියසාවකො රූපස්මිම්පි නිබ්බින්දති, වෙදනායපි නිබ්බින්දති, සඤ්ඤායපි නිබ්බින්දති, සඞ්ඛාරෙසුපි නිබ්බින්දති, විඤ්ඤාණස්මිම්පි නිබ්බින්දති. නිබ්බින්දං විරජ්ජති, විරාගා විමුච්චති. විමුත්තස්මිං විමුත්තමිති ඤාණං හොති. ඛීණා ජාති වුසිතං බ්රහ්මචරියං කතං කරණීයං නාපරං ඉත්ථත්තායාති පජානාතීති."
            },
            {
                "type": "centered",
                "text": "2. 2. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මාරධම්ම සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "171. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : ‘‘මාරධම්මො මාරධම්මො’’ති භන්තෙ, වුච්චති. කතමො නු ඛො භන්තෙ, මාරධම්මොති?"
            },
            {
                "type": "paragraph",
                "text": "රූපං ඛො රාධ, මාරධම්මො, වෙදනා මාරධම්මො, සඤ්ඤා මාරධම්මො, සඞ්ඛාරා මාරධම්මො, විඤ්ඤාණං මාරධම්මො. එවං පස්සං රාධ සුතවා අරියසාවකො -පෙ- නාපරං ඉත්ථත්තායාති පජානාතීති."
            },
            {
                "type": "centered",
                "text": "2. 2. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනිච්ච සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "172.** සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : ‘‘අනිච්චං අනිච්චන්ති” භන්තෙ, වුච්චති. කතමන්නු ඛො භන්තෙ, අනිච්චන්ති?"
            },
            {
                "type": "paragraph",
                "text": "රූපං ඛො රාධ, අනිච්චං, වෙදනා අනිච්චා, සඤ්ඤා අනිච්චා, සඞ්ඛාරා අනිච්චා, විඤ්ඤාණං අනිච්චං. එවං පස්සං රාධ, සුතවා අරියසාවකො -පෙ- නාපරං ඉත්ථත්තායාති පජානාතීති."
            },
            {
                "type": "page-break",
                "text": "354"
            },
            {
                "type": "centered",
                "text": "2. 2. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනිච්චධම්ම සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "173. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : ‘‘අනිච්චධම්මො අනිච්චධම්මො’’ති භන්තෙ වුච්චති. කතමො නු ඛො භන්තෙ, අනිච්චධම්මොති?"
            },
            {
                "type": "paragraph",
                "text": "රූපං ඛො රාධ, අනිච්චධම්මො වෙදනා අනිච්චධම්මො සඤ්ඤා අනිච්චධම්මො සඞ්ඛාරා අනිච්චධම්මො, විඤ්ඤාණං අනිච්චධම්මො. එවං පස්සං රාධ, සුතවා අරියසාවකො -පෙ- නාපරං ඉත්ථත්තායාති පජානාතීති."
            },
            {
                "type": "centered",
                "text": "2. 2. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුක්ඛ සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "174. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : ‘‘දුක්ඛං දුක්ඛ’’න්ති භන්තෙ, වුච්චති. කතමන්නු ඛො භන්තෙ, දුක්ඛන්ති?"
            },
            {
                "type": "paragraph",
                "text": "රූපං ඛො රාධ, දුක්ඛං, වෙදනා දුක්ඛා සඤ්ඤා දුක්ඛා සඞ්ඛාරා දුක්ඛා විඤ්ඤාණං දුක්ඛං. එවං පස්සං රාධ සුතවා අරියසාවකො -පෙ- නාපරං ඉත්ථත්තායාති පජානාතීති."
            },
            {
                "type": "centered",
                "text": "2. 2. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුක්ඛධම්ම සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "175.** සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : ‘‘දුක්ඛධම්මො දුක්ඛධම්මො’’ති භන්තෙ, වුච්චති. කතමො නු ඛො භන්තෙ, දුක්ඛධම්මොති?"
            },
            {
                "type": "paragraph",
                "text": "රූපං ඛො රාධ, දුක්ඛධම්මො වෙදනා දුක්ඛධම්මො සඤ්ඤා දුක්ඛධම්මො සඞ්ඛාරා දුක්ඛධම්මො විඤ්ඤාණං දුක්ඛධම්මො. එවං පස්සං රාධ සුතවා අරියසාවකො -පෙ- නාපරං ඉත්ථත්තායාති පජානාතීති."
            },
            {
                "type": "page-break",
                "text": "356"
            },
            {
                "type": "centered",
                "text": "2. 2. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනත්ත සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "176.** සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : ‘‘අනත්තා අනත්තා’’ති භන්තෙ, වුච්චති. කතමො නු ඛො භන්තෙ, අනත්තාති?"
            },
            {
                "type": "paragraph",
                "text": "රූපං ඛො රාධ, අනත්තා වෙදනා අනත්තා සඤ්ඤා අනත්තා සඞ්ඛාරා අනත්තා විඤ්ඤාණං අනත්තා. එවං පස්සං රාධ සුතවා අරියසාවකො -පෙ- නාපරං ඉත්ථත්තායාති පජානාතීති."
            },
            {
                "type": "centered",
                "text": "2. 2. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනත්තධම්ම සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "177. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : ‘‘අනත්තධම්මො අනත්තධම්මො’’ති භන්තෙ, වුච්චති. කතමො නු ඛො භන්තෙ, අනත්තධම්මොති?"
            },
            {
                "type": "paragraph",
                "text": "රූපං ඛො රාධ, අනත්තධම්මො වෙදනා අනත්තධම්මො සඤ්ඤා අනත්තධම්මො, සඞ්ඛාරා අනත්තධම්මො, විඤ්ඤාණං අනත්තධම්මො. එවං පස්සං රාධ සුතවා අරියසාවකො -පෙ- නාපරං ඉත්ථත්තායාති පජානාතීති."
            },
            {
                "type": "centered",
                "text": "2. 2. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඛයධම්ම සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "178. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : ‘‘ඛයධම්මො ඛයධම්මො’’ති භන්තෙ, වුච්චති. කතමො නු ඛො භන්තෙ, ඛයධම්මොති?"
            },
            {
                "type": "paragraph",
                "text": "රූපං ඛො රාධ, ඛයධම්මො, වෙදනා ඛයධම්මො, සඤ්ඤා ඛයධම්මො, සඞ්ඛාරා ඛයධම්මො, විඤ්ඤාණං ඛයධම්මො. එවං පස්සං රාධ සුතවා අරියසාවකො -පෙ- නාපරං ඉත්ථත්තායාති පජානාතීති."
            },
            {
                "type": "page-break",
                "text": "358"
            },
            {
                "type": "centered",
                "text": "2. 2. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "වයධම්ම සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "179. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : ‘‘වයධම්මො වයධම්මො’’ති භන්තෙ, වුච්චති. කතමො නු ඛො භන්තෙ, වයධම්මොති?"
            },
            {
                "type": "paragraph",
                "text": "රූපං ඛො රාධ, වයධම්මො වෙදනා වයධම්මො සඤ්ඤා වයධම්මො සඞ්ඛාරා වයධම්මො, විඤ්ඤාණං වයධම්මො. එවං පස්සං රාධ සුතවා අරියසාවකො -පෙ- නාපරං ඉත්ථත්තායාති පජානාතීති."
            },
            {
                "type": "centered",
                "text": "2. 2. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සමුදයධම්ම සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "180. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : ‘‘සමුදයධම්මො සමුදයධම්මො’’ති භන්තෙ, වුච්චති. කතමො නු ඛො භන්තෙ, සමුදයධම්මොති?"
            },
            {
                "type": "paragraph",
                "text": "රූපං ඛො රාධ, සමුදයධම්මො වෙදනා සමුදයධම්මො සඤ්ඤා සමුදයධම්මො සඞ්ඛාරා සමුදයධම්මො විඤ්ඤාණං සමුදයධම්මො. එවං පස්සං රාධ සුතවා අරියසාවකො -පෙ- නාපරං ඉත්ථත්තායාති පජානාතීති."
            },
            {
                "type": "centered",
                "text": "2. 2. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නිරොධධම්ම සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "181. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : ‘‘නිරොධධම්මො, නිරොධධම්මො’’ති භන්තෙ වුච්චති. කතමො නු ඛො භන්තෙ, නිරොධධම්මොති."
            },
            {
                "type": "paragraph",
                "text": "රූපං ඛො රාධ, නිරොධධම්මො වෙදනා නිරොධධම්මො සඤ්ඤා නිරොධධම්මො, සඞ්ඛාරා නිරොධධම්මො විඤ්ඤාණං නිරොධධම්මො. එවං පස්සං රාධ සුතවා අරියසාවකො -පෙ- නාපරං ඉත්ථත්තායාති පජානාතීති."
            },
            {
                "type": "centered",
                "text": "දුතිය මාරවග්ගො",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං :**"
            },
            {
                "type": "gatha",
                "text": "මාරො ච මාරධම්මො ච අනිච්චෙන’පරෙ දුවෙ\nදුක්ඛෙන ච දුවෙ වුත්තා අනත්තෙන තථෙව ච\nඛයවයසමුදයධම්මා නිරොධධම්මෙන ද්වාදසාති."
            },
            {
                "type": "page-break",
                "text": "360"
            },
            {
                "type": "heading",
                "text": "3. ආයාචනවග්ගො",
                "level": "2"
            },
            {
                "type": "centered",
                "text": "2. 3. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මාර සුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "182. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : සාධු මෙ භන්තෙ, භගවා සඞ්ඛිත්තෙන ධම්මං දෙසෙතු යමහං භගවතො ධම්මං සුත්වා එකො වූපකට්ඨො අප්පමත්තො ආතාපී පහිතත්තො විහරෙය්යන්ති."
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, මාරො තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො{1 තත්ර තෙ රාගො - සීමු.} පහාතබ්බො, ඡන්දරාගො{2 තත්ර තෙ ඡන්දරාගො - සීමු.} පහාතබ්බො. කො ච රාධ, මාරො :"
            },
            {
                "type": "paragraph",
                "text": "රූපං ඛො රාධ, මාරො තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො{3 තත්ර තෙ රාගො - සීමු.} පහාතබ්බො, ඡන්දරාගො{4 තත්ර තෙ ඡන්දරාගො - සීමු.} පහාතබ්බො. වෙදනා -පෙ- සඤ්ඤා -පෙ- සඞ්ඛාරා -පෙ- විඤ්ඤාණං මාරො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො{5 තත්ර තෙ රාගො - සීමු.} පහාතබ්බො, ඡන්දරාගො{6 තත්ර තෙ ඡන්දරාගො - සීමු.} පහාතබ්බො. යො ඛො රාධ, මාරො තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "2. 3. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මාරධම්ම සුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "183. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : සාධු මෙ භන්තෙ, භගවා සඞ්ඛිත්තෙන ධම්මං දෙසෙතු -පෙ- පහිතත්තො විහරෙය්යන්ති."
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, මාරධම්මො තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. කො ච රාධ, මාර ධම්මො: රූපං ඛො රාධ, මාරධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. වෙදනා -පෙ- සඤ්ඤා -පෙ- සඞ්ඛාරා -පෙ- විඤ්ඤාණං මාරධම්මො තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. යො ඛො රාධ, මාරධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "page-break",
                "text": "362"
            },
            {
                "type": "centered",
                "text": "2. 3. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනිච්ච සුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "184. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : සාධු මෙ භන්තෙ, භගවා සඞ්ඛිත්තෙන ධම්මං දෙසෙතු -පෙ- පහිතත්තො විහරෙය්යන්ති."
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, අනිච්චං, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. කිඤ්ච රාධ, අනිච්චං? රූපං ඛො රාධ, අනිච්චං, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. වෙදනා -පෙ- සඤ්ඤා -පෙ- සඞ්ඛාරා -පෙ- විඤ්ඤාණං අනිච්චං, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. යං ඛො රාධ, අනිච්චං, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "2. 3. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනිච්චධම්ම සුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "185. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : සාධු මෙ භන්තෙ, භගවා සඞ්ඛිත්තෙන ධම්මං දෙසෙතු -පෙ- පහිතත්තො විහරෙය්යන්ති."
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, අනිච්චධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො."
            },
            {
                "type": "paragraph",
                "text": "කො ච රාධ, අනිච්චධම්මො: රූපං ඛො රාධ, අනිච්චධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. වෙදනා -පෙ- සඤ්ඤා -පෙ- සඞ්ඛාරා -පෙ- විඤ්ඤාණං අනිච්චධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. යො ඛො රාධ, අනිච්චධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "2. 3. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුක්ඛ සුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "186. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : සාධු මෙ භන්තෙ, භගවා සඞ්ඛිත්තෙන ධම්මං දෙසෙතු -පෙ- පහිතත්තො විහරෙය්යන්ති."
            },
            {
                "type": "page-break",
                "text": "364"
            },
            {
                "type": "paragraph",
                "text": "යං ඛො රාධ, දුක්ඛං, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. කිං ච රාධ, දුක්ඛං: රූපං ඛො රාධ, දුක්ඛං, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. වෙදනා -පෙ- සඤ්ඤා -පෙ- සඞ්ඛාරා -පෙ- විඤ්ඤාණං දුක්ඛං, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. යො ඛො රාධ, දුක්ඛං, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "2. 3. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුක්ඛධම්ම සුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "187. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : සාධු මෙ භන්තෙ, භගවා සඞ්ඛිත්තෙන ධම්මං දෙසෙතු -පෙ- විහරෙය්යන්ති."
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, දුක්ඛධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. කො ච රාධ, දුක්ඛධම්මො: රූපං ඛො රාධ, දුක්ඛධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. වෙදනා -පෙ- සඤ්ඤා -පෙ- සඞ්ඛාරා -පෙ- විඤ්ඤාණං දුක්ඛධම්මො තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. යො ඛො රාධ, දුක්ඛධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "2. 3. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනත්ත සුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "188. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : සාධු මෙ භන්තෙ, භගවා සඞ්ඛිත්තෙන ධම්මං දෙසෙතු -පෙ- පහිතත්තො විහරෙය්යන්ති."
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, අනත්තා, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. කො ච රාධ, අන්තතා: රූපං ඛො රාධ, අනත්තා, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. වෙදනා -පෙ- සඤ්ඤා -පෙ- සඞ්ඛාරා -පෙ- විඤ්ඤාණං අනත්තා, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. යො ඛො රාධ, අනත්තා, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "page-break",
                "text": "366"
            },
            {
                "type": "centered",
                "text": "2. 3. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනත්තධම්ම සුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "189.** සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : සාධු මෙ භන්තෙ, භගවා සඞ්ඛිත්තෙන ධම්මං දෙසෙතු -පෙ- පහිතත්තො විහරෙය්යන්ති."
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, අනත්තධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. කො ච රාධ, අනත්තධම්මො: රූපං ඛො රාධ, මාරධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. වෙදනා -පෙ- සඤ්ඤා -පෙ- සඞ්ඛාරා -පෙ- විඤ්ඤාණං අනත්තධම්මො තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. යො ඛො රාධ, අනත්තධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "2. 3. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඛයධම්ම සුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "190. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : සාධු මෙ භන්තෙ, භගවා සඞ්ඛිත්තෙන ධම්මං දෙසෙතු -පෙ- පහිතත්තො විහරෙය්යන්ති."
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, ඛයධම්මො තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. කො ච රාධ, ඛයධම්මො: රූපං ඛො රාධ, මාරධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. වෙදනා -පෙ- සඤ්ඤා -පෙ- සඞ්ඛාරා -පෙ- විඤ්ඤාණං ඛයධම්මො තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. යො ඛො රාධ, ඛයධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "2. 3. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "වයධම්ම සුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "191. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : සාධු මෙ භන්තෙ, භගවා සඞ්ඛිත්තෙන ධම්මං දෙසෙතු -පෙ- පහිතත්තො විහරෙය්යන්ති."
            },
            {
                "type": "page-break",
                "text": "368"
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, වයධම්මො තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො."
            },
            {
                "type": "paragraph",
                "text": "කො ච රාධ, වයධම්මො:"
            },
            {
                "type": "paragraph",
                "text": "රූපං ඛො රාධ, වයධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. වෙදනා -පෙ- සඤ්ඤා -පෙ- සඞ්ඛාරා -පෙ- විඤ්ඤාණං වයධම්මො. තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. යො ඛො රාධ, වයධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "2. 3. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සමුදය ධම්ම සුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "192. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : සාධු මෙ භන්තෙ, භගවා සඞ්ඛිත්තෙන ධම්මං දෙසෙතු -පෙ- පහිතත්තො විහරෙය්යන්ති."
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, සමුදයධම්මො තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො."
            },
            {
                "type": "paragraph",
                "text": "කො ච රාධ, සමුදයධම්මො: රූපං ඛො රාධ, මාරධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. වෙදනා -පෙ- සඤ්ඤා -පෙ- සඞ්ඛාරා -පෙ- විඤ්ඤාණං සමුදයධම්මො තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. යො ඛො රාධ, සමුදයධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "2. 3. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නිරොධ ධම්ම සුත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "193. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නො ඛො ආයස්මා රාධො භගවන්තං එතදවොච : සාධු මෙ භන්තෙ, භගවා සඞ්ඛිත්තෙන ධම්මං දෙසෙතු -පෙ- පහිතත්තො විහරෙය්යන්ති."
            },
            {
                "type": "page-break",
                "text": "370"
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, නිරොධධම්මො තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. කො ච රාධ, නිරොධධම්මො: රූපං ඛො රාධ, නිරොධධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. වෙදනා -පෙ- සඤ්ඤා -පෙ- සඞ්ඛාරා -පෙ- විඤ්ඤාණං නිරොධධම්මො තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. යො ඛො රාධ, නිරොධධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "ආයාචනවග්ගො තතියො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං :**"
            },
            {
                "type": "gatha",
                "text": "මාරො ච මාරධම්මො ච අනිච්චෙන’පරෙ දුවෙ\nක්ඛෙන ච දුවෙ වුත්තා අනත්තෙන තථෙව ච,\nඛයවයසමුදයධම්මා නිරොධධම්මෙන ද්වාදසාති.\n",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "372"
            },
            {
                "type": "heading",
                "text": "4. උපනිසින්නවග්ගො",
                "level": "2"
            },
            {
                "type": "centered",
                "text": "2. 4. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මාර සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "194. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "අථ ඛො ආයස්මන්තං රාධො යෙන භගවා නෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නං ඛො ආයස්මන්තං රාධං භගවා එතදවොච : යො ඛො රාධ, මාරො තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො."
            },
            {
                "type": "paragraph",
                "text": "කො ච රාධ, මාරො: රූපං ඛො රාධ, මාරො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. වෙදනා -පෙ- සඤ්ඤා -පෙ- සඞ්ඛාරා -පෙ- විඤ්ඤාණං මාරො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො, යො ඛො රාධ, මාරො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "2. 4. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මාරධම්ම සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "195. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නං ඛො ආයස්මන්තං රාධං භගවා එතදවොච : යො ඛො රාධ, මාරොධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො."
            },
            {
                "type": "paragraph",
                "text": "කො ච රාධ, මාරධම්මො: රූපං ඛො රාධ, මාරධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. වෙදනා -පෙ- සඤ්ඤා -පෙ- සඞ්ඛාරා -පෙ- විඤ්ඤාණං මාරධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො, යො ඛො රාධ, මාරධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "2. 4. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනිච්ච සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "196. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "එකමන්තං නිසින්නං ඛො ආයස්මන්තං රාධං භගවා එතදවොච : යං ඛො රාධ, අනිච්චං තත්ර -පෙ- ඡන්දරාගො පහාතබ්බො."
            },
            {
                "type": "page-break",
                "text": "374"
            },
            {
                "type": "centered",
                "text": "2. 4. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනිච්චධම්ම සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "197. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, අනිච්චධම්මො තත්ර -පෙ- ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "2. 4. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුක්ඛ සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "198. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, දුක්ඛං තත්ර -පෙ- ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "2. 4. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුක්ඛධම්ම සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "199. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, දුක්ඛධම්මො තත්ර -පෙ- ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "2. 4. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනත්ත සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "200. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, අනත්තා තත්ර -පෙ- ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "2. 4. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනත්තධම්ම සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "201. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, අනත්තධම්මො තත්ර -පෙ- ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "2. 4. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඛයධම්ම සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "202. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, ඛයධම්මො තත්ර -පෙ- ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "page-break",
                "text": "376"
            },
            {
                "type": "centered",
                "text": "2. 4. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "වයධම්ම සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "203. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, වයධම්මො තත්ර -පෙ- ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "2. 4. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සමදයධම්ම සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "204. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, සමුදයධම්මො තත්ර -පෙ- ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "2. 4. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නිරොධධම්ම සුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "205. **සාවත්ථියං :**"
            },
            {
                "type": "paragraph",
                "text": "යො ඛො රාධ, නිරොධධම්මො තත්ර -පෙ- ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "paragraph",
                "text": "කො ච රාධ, නිරොධධම්මො: රූපං ඛො රාධ, මාරො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො. වෙදනා -පෙ- සඤ්ඤා -පෙ- සඞ්ඛාරා -පෙ- විඤ්ඤාණං නිරොධධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බො, යො ඛො රාධ, නිරොධධම්මො, තත්ර තෙ ඡන්දො පහාතබ්බො, රාගො පහාතබ්බො, ඡන්දරාගො පහාතබ්බොති."
            },
            {
                "type": "centered",
                "text": "උපනිසින්නවග්ගො චතුත්ථො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං :**"
            },
            {
                "type": "gatha",
                "text": "මාරො ච මාරධම්මො ච අනිච්චෙන’පරෙ දුවෙ\nදුක්ඛෙන ච දුවෙ වුත්තා අනත්තෙන තථෙව ච,\nඛයවයසමුදයධම්මා නිරොධධම්මෙන ද්වාදසාති."
            },
            {
                "type": "paragraph",
                "text": "(එවං මාරසුත්තානි විත්ථාරෙතබ්බානි, එවං නිරොධධම්මෙන ඡත්තිංසවෙය්යාකරණානි. විත්ථාරෙතබ්බානි. එවං රාධසුයුත්තෙ පිණ්ඩිතෙ චතුනවුති වෙය්යාකරණානි හොන්ති.)"
            },
            {
                "type": "centered",
                "text": "රාධසංයුත්තං නිට්ඨිතං.",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ],
        "pages": {
            "340": {
                "pageNum": 340,
                "footnotesCount": 3
            },
            "342": {
                "pageNum": 342,
                "footnotesCount": 11
            },
            "344": {
                "pageNum": 344,
                "footnotesCount": 4
            },
            "346": {
                "pageNum": 346,
                "footnotesCount": 0
            },
            "348": {
                "pageNum": 348,
                "footnotesCount": 1
            },
            "350": {
                "pageNum": 350,
                "footnotesCount": 2
            },
            "352": {
                "pageNum": 352,
                "footnotesCount": 0
            },
            "354": {
                "pageNum": 354,
                "footnotesCount": 0
            },
            "356": {
                "pageNum": 356,
                "footnotesCount": 0
            },
            "358": {
                "pageNum": 358,
                "footnotesCount": 0
            },
            "360": {
                "pageNum": 360,
                "footnotesCount": 6
            },
            "362": {
                "pageNum": 362,
                "footnotesCount": 0
            },
            "364": {
                "pageNum": 364,
                "footnotesCount": 0
            },
            "366": {
                "pageNum": 366,
                "footnotesCount": 0
            },
            "368": {
                "pageNum": 368,
                "footnotesCount": 0
            },
            "370": {
                "pageNum": 370,
                "footnotesCount": 0
            },
            "372": {
                "pageNum": 372,
                "footnotesCount": 0
            },
            "374": {
                "pageNum": 374,
                "footnotesCount": 0
            },
            "376": {
                "pageNum": 376,
                "footnotesCount": 0
            }
        }
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "341"
            },
            {
                "text": "2. රාධ සංයුක්තය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. පඨම මාර වර්ගය",
                "level": 2
            },
            {
                "type": "centered",
                "text": "2. 1. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මාර සූත්‍රය",
                "level": "1"
            },
            {
                "text": "160. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එ කල්හි ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළැඹියහ. එළැඹැ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පස් ව හුන්හ. එකත්පස් ව හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැලකළහ: වහන්ස, “මාර මාර“ යි කියනු ලැබෙයි, වහන්ස කොපමණෙකින් මාර වේ දැ”යි?.",
                "type": "paragraph"
            },
            {
                "text": "රාධය, රූපය ඇති කල්හි මරු (මරණය) හෝ මැරිය යුත්තා හෝ මැරෙන්නා හෝ වන්නේ යැ. රාධය, එ හෙයින් මෙහි ලා තෙපි රූපය මරු යයි දකිවු, මැරිය යුත්තා යයි දකිවු, මැරෙන්නා යයි දකිවු, රෝග ය යි දකිවු, ගඩ යයි දකිවු, හුල යයි දකිවු, ව්‍යසන යයි දකිවු, ව්‍යසනයට පැමිණියෙකැ යි දකිවු. යම් කෙනෙක් එය (රූපය) මෙ සේ දකිත් ද ඔහු මැනවින් දකිති. වේදනාව ඇති කල්හි මරු හෝ මැරිය යුත්තා හෝ මැරෙන්නා හෝ වන්නේ යැ. රාධය, එ හෙයින් මෙහි ලා තෙපි වේදනාව මරණ යයි දකිවු, මැරිය යුත්තා යයි දකිවු, මැරෙන්නා යයි දකිවු. . . යම් කෙනෙක් එ වේදනාව මෙසේ දකිත් ද ඔහු මැනවින් දකිති. සංඥාව ඇති කල්හි. . . සංස්කාර ඇති කල්හි මරු හෝ මැරිය යුත්තා හෝ මැරෙන්නා හෝ වන්නේ යැ. රාධය, එ හෙයින් මෙහි ලා තෙපි සංස්කාර මරු යයි දකිවු, මැරිය යුත්තා ය යි දකිවු, මැරෙන්නා ය යි දකිවු. . . යම් කෙනෙක් මෙසේ දකිත් ද ඔහු මැනවින් දකිති. විඥානය ඇති කල්හි මරු හෝ මැරිය යුත්තා හෝ මැරෙන්නා හෝ වන්නේ යැ. රාධය, එ හෙයින් මෙහි ලා තෙපි විඥානය මරු යයි දකිවු, මැරිය යුත්තා යි දකිවු, මැරෙන්නා යි දකිවු, රෝග යයි දකිවු, ගඩ යයි දකිවු, හුල යයි දකිවු, ව්‍යසනයයි දකිවු, ව්‍යසනයට පැමිණියෙකැයි දකිවු. යම් කෙනෙක් එ විඥානය මේ සේ දකිත් ද, ඔහු මොනොවට දකිත් යි.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, මොනොවට දැක්ම කුමක් අර්ථකොට ඇත් ද? ",
                "type": "paragraph"
            },
            {
                "text": "රාධය, මොනොවට දැක්ම නිර්වෙදය අර්ථකොට ඇත.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, නිර්වෙදය කුමක් අර්ථකොට ඇත් ද?",
                "type": "paragraph"
            },
            {
                "text": "රාධය,  නිර්වෙදය විරාගය අර්ථකොට ඇත.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, විරාගය කුමක් අර්ථකොට ඇත ද?",
                "type": "paragraph"
            },
            {
                "text": "රාධය, විරාගය විමුක්තිය අර්ථකොට ඇත.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "343"
            },
            {
                "text": "වහන්ස, විමුක්තිය කුමක් අර්ථකොට ඇත් ද?",
                "type": "paragraph"
            },
            {
                "text": "රාධය, විමුක්තිය නිවන අර්ථකොට ඇත.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, නිවන කුමක් අර්ථකොට ඇත් ද?",
                "type": "paragraph"
            },
            {
                "text": "රාධය, ප්‍රශ්නය ඉක්මැවූයෙහි, ප්‍රශ්නයේ කෙළවර ගන්නට අසමත් වූයෙහි. නිවනට බැසගත් නිවන පිහිට කොට ඇති නිවන අවසන් කොට ඇති මඟබඹසර වෙසේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සත්ත සූත්‍රය",
                "level": "1"
            },
            {
                "text": "161. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් ව හුන් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට තෙල සැලකළහ: වහන්ස, “සත්ත සත්ත“ යි කියනු ලැබෙයි. වහන්ස කොපමණකින් සත්ත’යි කියනු ලැබේ දැයි?",
                "type": "paragraph"
            },
            {
                "text": "රාධය රූපයෙහි යම් කැමැත්තෙක් යම් ඇල්මෙක් යම් සතුටෙක් යම් ආශාවක් වේ ද එහි ඇලුණේ යැ, එහි දැඩි ව ඇලුණේ යි. එ හෙයින් “සත්ත’යි කියනු ලැබෙ යි.  වේදනාවෙහි යම් කැමැත්තෙක් යම් ඇල්මෙක්. . . සංඥායෙහි. . . සංස්කාර යෙහි… විඥානයෙහි යම් කැමැත්තෙක් යම් ඇල්මෙක් යම් සතුටෙක් යම් ආශාවක් වේ ද එහි ඇලුණේ යැ, එහි දැඩි ව ඇලුණේ යි. එහෙයින් ‘සත්ත’යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "රාධය, යම්සේ කුඩාදරුවෝ හෝ කුඩාදැරියෝ හෝ වැලිගෙවලින් කෙළිද්ද, යම්තාක් ඒ වැලිගෙවල නොපහ වූ ඇලුම් ඇත්තෝ නොපහ වූ කැමැත්ත ඇත්තෝ නොපහ වූ ප්‍රේම ඇත්තෝ නොපහ වූ පවස් ඇත්තෝ නොපහ වූ පරිදාහ ඇත්තෝ නොපහ වූ ආශා ඇත්තෝ වෙද්ද, ඒතාක් ඒ වැලිගෙවල ඇලුම් කෙරෙති. කෙලායන (ලොල්බව) කෙරෙති. (එය) ධනයක් මෙන් හඟිති. මමත්වය කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "text": "රාධය, යම් කලෙක කුමරුවෝ හෝ කුමරියෝ හෝ ඒ වැලිගෙවල පහ ව ගිය කැමැත්ත ඇත්තෝ පහවගිය ඇලුම් ඇත්තෝ පහවගිය පෙම් ඇත්තෝ පහවගිය පවස් ඇත්තෝ පහවගිය පරිදාහ ඇත්තෝ පහවගිය ආශා ඇත්තෝ වෙද්ද, එ කල්හි ඒ වැලිගෙවල් අතින් ද පයින් ද විසුරුවති, බිඳදමති, වනසති, පහවූ ක්‍රීඩා ඇති කෙරෙත්.",
                "type": "paragraph"
            },
            {
                "text": "රාධය, එ පරිද්දෙන් ම තොප විසින් රූපය විසුරුවවු, බිඳදමවු, වනසවු, පහ වූ, ක්‍රීඩා ඇත්තක් කරවු, තෘෂ්ණාව ක්ෂය කිරීම පිණිස පිළිපදිවු. වේදනාව විසුරුවවු. . . සංඥාව විසුරුවවු. . .  සංස්කාරය විසුරුවවු. . .  විඥානය විසුරුවවු, බිඳ දමවු, වනසවු, පහවගිය ක්‍රීඩා ඇත්තක් කරවු, තෘෂ්ණාව ක්ෂය කිරීම පිණිස පිළිපදිවු. රාධ, තෘෂ්ණා ක්ෂය නිවන යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "345"
            },
            {
                "type": "centered",
                "text": "2. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "භවනෙත්ති සූත්‍රය",
                "level": "1"
            },
            {
                "text": "162. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස්ව හුන් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට තෙල සැලකළහ: වහන්ස, “භවනෙත්ති, භවනෙත්ති“ යි කියනු ලැබෙයි. වහන්ස ‘භවනෙත්තිය’ නම් කවරක්ද, ‘භවනෙත්තිනිරෝධය’  කවරේ දැ යි?",
                "type": "paragraph"
            },
            {
                "text": "රාධය, රූපයෙහි යම් ඡන්දයෙක් යම් රාගයෙක් යම් නන්දියෙක් යම් තෘෂ්ණායෙක් යම් උපය උපාදාන කෙනෙක් සිතපිළිබඳ අධිෂ්ඨානඅභිනිවෙසඅනුසය කෙනෙක් වෙත් ද මේ ‘භවනෙත්ති’ යයි කියනු ලැබේ. ඔවුන්ගේ නිරොධයෙන් භවනෙත්තිනිරොධය වේ. වෙදනාවෙහි යම් ඡන්දයෙක්. . . සංඥාවෙහි යම් ඡන්දයෙක්. . . සංස්කාරයන්හි යම් ඡන්දයෙක්. . . විඥානයෙහි යම් ඡන්දයෙක් යම් රාගයෙක් යම් නන්දියෙක් යම් තෘෂ්ණායෙක් යම් උපයඋපාදාන කෙනෙක්, සිත පිළිබඳ අධිෂ්ඨාන, අභිනිවෙස, අනුසය කෙනෙක් වෙද්ද, මේ ‘භවනෙත්ති’ යි කියනු ලැබේ. ඔවුන්ගේ නිරොධයෙන් භවනෙත්තිනිරොධය වේ ය යි .",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පරිඤ්ඤෙය්‍ය සූත්‍රය",
                "level": "1"
            },
            {
                "text": "163.** සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් ව හුන් ආයුෂ්මත් රාධ තෙරුන්ට භාග්‍යවතුන් වහන්සේ තෙල වදාළ සේක: “රාධ, පිරිසිඳ දතයුතු දහම් ද, පිරිසිඳ දැනුම ද, පිරිසිඳ දන්නා පුඟුලා ද දෙශනා කරන්නෙමි. එය අසව. . . භාග්‍යවතුන් වහන්සේ තෙල වදාළ සේක:",
                "type": "paragraph"
            },
            {
                "text": "රාධය, පිරිසිඳ දතයුතු දහම් කවරැ යත්: රාධය, රූපය පිරිසිඳ දතයුතු දහමෙකි. වේදනාව පිරිසිඳ දතයුතු දහමෙකි.  සංඥාව. . .  සංස්කාර. . .  විඥානය පිරිසිඳ දතයුතු දහමෙකි. රාධය මොහු පිරිසිඳ දතයුතු දහම් ය යි කියනු ලැබෙත්.",
                "type": "paragraph"
            },
            {
                "text": "රාධය, පිරිසිඳ දැනුම කවරැ යත්: රාධය යම් රාගක්ෂයයෙක් යම් ද්වේෂක්ෂයයෙක් මෝහක්ෂයයෙක් වේ ද; රාධය, මේ පිරිසිඳ දැනුම ය යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "රාධය, පිරිසිඳ දත් පුඟුල් කවරෙ යත්:",
                "type": "paragraph"
            },
            {
                "text": "මෙබඳු නම් ඇති මෙබඳු ගොත් ඇති යම් මේ ආයුෂ්මත් කෙනෙක් වෙත් නම් හේ අරහත් ය යි කිය යුතු වන්නේ යි. රාධය, මේ පිරිසිඳ දත් පුඟුල්’යි කියනු ලැබේ.   ",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "347"
            },
            {
                "type": "centered",
                "text": "2. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සමණ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "164. සැවැත්නුවර:",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් ව හුන් ආයුෂ්මත් රාධ තෙරුන්ට භාග්‍යවතුන් වහන්සේ තෙල වදාළ සේක. රාධය, මේ උපාදානස්කන්ධ පසෙකි. කවර පසෙකැ යත්: එනම් රූපෝපාදානස්කන්ධය:. . . විඥානෝපාදානස්කන්ධ යි. රාධය, යම් කිසි ශ්‍රමණ කෙනෙක් වේවයි බ්‍රාහ්මණ කෙනෙක් වේවයි මේ පඤ්චෝපාදානස්කන්ධයන්ගේ ආස්වාදයත් ආදීනවයත් නිස්සරණ යත් තතු සේ නො දනිද් ද, රාධය, මේ මහණහු හෝ බමුණෝ හෝ මහණුන් කෙරෙහිත් මහණහු යයි සම්මත නො වෙති. බමුණන් කෙරෙහිත් බමුණෝ යයි සම්මත නො වෙති. ඒ ආයුෂ්මත්හු මහණ බැව්හි ඵලයත් බමුණු බැව්හි ඵලයත් දිටුදැමියෙහි තෙමේ ම වෙසෙසින් දැන පසක් කොට ඊට එළඹ නො ද වෙසෙති.",
                "type": "paragraph"
            },
            {
                "text": "රාධය යම්කිසි මහණ කෙනෙක් හෝ බමුණු කෙනෙක් හෝ මේ පඤ්චොපාදාන ස්කන්ධයන්ගේ ආස්වාදත් ආදීනවත් නිස්සරණත් තතු සේ දනිද්ද, රාධය, ඒ මහණහු හෝ බමුණෝ හෝ මහණුන් කෙරෙහිත් මහණහු යයි සම්මතයහ. බමුණන් කෙරෙහිත් බමුණෝ යයි සම්මත යහ. ඒ ආයුෂ්මත්හු මහණකමෙහි ඵලත් බමුණුකමෙහි  ඵලත් දිටුදැමියෙහි තෙමේ ම වෙසෙසින් දැන එයට එළඹ වෙසෙති යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය සමණ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "165. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් වැ හුන් ආයුෂ්මත් රාධ තෙරුන්ට භාග්‍යවතුන් වහන්සේ තෙල වදාළ සේක: “රාධය මේ  උපාදානස්කන්ධ පසෙකි. කවර පසෙකැ යත්: එනම්: රූපෝපාදානස්කන්ධ ය:…   විඥානෝපාදානස්කන්ධයි. රාධය, යම් කිසි මහණ කෙනෙක් වේවයි බමුණු කෙනෙක් වේවයි මේ පඤ්චෝපාදානස්කන්ධයන්ගේ සමුදයයත් අස්තංගමයත් ආස්වාදයත් ආදීනවයත් නිස්සරණයත් තතු සේ නො දනිද්ද… තෙමේ ම වෙසෙසින් දැන පසක් කොට එයට එළැඹ වෙසෙති”යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සෝතාපන්න සූත්‍රය",
                "level": "1"
            },
            {
                "text": "166. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් වැ හුන් ආයුෂ්මත් රාධ තෙරුන්ට භාග්‍යවතුන් වහන්සේ තෙල වදාළ සේක: “රාධය, මේ  උපාදානස්කන්ධ පසෙකි. කවර පසෙකැ යත්: එනම්: රූපෝපාදාන ස්කන්ධය…   විඥානෝපාදානස්කන්ධයි. ",
                "type": "paragraph"
            },
            {
                "text": "රාධය යම් කලෙක ආර්‍ය්‍යශ්‍රාවක තෙමේ මේ පඤ්චෝපාදානස්කන්ධයන්ගේ සමුදයයත් අස්තංගමයත් ආස්වාදයත් ආදීනවයත් නිස්සරණයත් තතු සේ දනී ද, රාධ, මේ ආර්‍ය්‍ය ශ්‍රාවක සිවු අපායෙහි නොවැටෙන සැහැවි ඇති ගතිනියත වූ සම්බෝධිය පිහිට කොට ඇති සෝතාපන්න ය යි කියනු ලැබේ”යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "349"
            },
            {
                "type": "centered",
                "text": "2. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අරහන්ත සූත්‍රය",
                "level": "1"
            },
            {
                "text": "167. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් වැ හුන් ආයුෂ්මත් රාධ තෙරුන්ට භාග්‍යවතුන් වහන්සේ තෙල වදාළ සේක: “රාධය, මේ  උපාදානස්කන්ධ පසෙකි කවර පසෙකැ යත්: එනම්: රූපොපාදානස්කන්ධ ය…   විඥානොපාදානස්කන්ධ යි. ",
                "type": "paragraph"
            },
            {
                "text": "රාධ, යම් කලෙක මහණ මේ පඤ්චොපාදානස්කන්ධයන්ගේ සමුදයයත් අස්තඞ්ගමයත් ආස්වාදයත් ආදීනවයත් නිශ්ශරණයත් තතු සේ දැන දැඩි ලෙස නො ගෙන මිදුණේ වේද, රාධ, මේ මහණ ක්ෂය වූ කෙලෙස් ඇති වැස නිම වූ බඹසර ඇති කළ සිවුමඟ කිස ඇති, බහා තැබූ (ස්කන්ධ) බර ඇති පිළිවෙළින් පැමිණි ස්වාර්ථ ඇති ක්ෂය කළ බවබැඳුම් ඇති මැනැවින් දැන මිදුණු රහතැ යි කියනු ලැබේ”යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඡන්දරාග සූත්‍රය",
                "level": "1"
            },
            {
                "text": "168. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් ව හුන් ආයුෂ්මත් රාධ තෙරුන්ට භාග්‍යවතුන් වහන්සේ තෙල වදාළ සේක: ",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "“රාධ, රූපයෙහි යම් ඡන්දයෙක් යම් රාගයෙක් යම් නන්දියෙක් යම් තෘෂ්ණායෙක් ඇත් ද එ දුරු කරවු. මෙසේ ඒ රූපය ප්‍රහීණ වූයේ උසුන්මුල් ඇත්තේ හිස් සුන් තල්ගසක් මෙන් (සහමුලින් උදුරා හළ තල්ගස ඇති තැන මෙන්) කරන ලද්දේ නැවත නොහටගන්නක් කරන ලද්දේ මතු නූපදනා ස්වභාව ඇත්තේ වන්නේ ය. වෙදනායෙහි යම්, ඡන්දයෙක් යම් රාගයෙක් යම් නන්දියෙක් යම් තෘෂ්ණායෙක් ඇත් ද එය දුරු කරවු. මෙසේ ඒ වේදනාව ප්‍රහීණ වූවා උසුන්මුල් ඇත්තී හිස්සුන් තල්ගසක් මෙන් කරන ලද්දී නැවත නොහටගන්නක් කරන ලද්දී මතු නූපදනා ස්වභාව ඇත්තී වන්නී ය. සංඥායෙහි… සංස්කාරයන්හි යම් ඡන්දයෙක් යම් රාගයෙක් යම් නන්දියක් යම් තෘෂ්ණාවක් වේ නම් එය දුරු කරවු. මෙසේ ඒ සංස්කාරයෝ ප්‍රහීණ වූවාහු උසුන්මුල් ඇත්තාහු හිස් සුන් තල්ගසක් මෙන් (තාලා වස්තුවක් මෙන්) කරන ලද්දාහු නැවත නොහටගන්න වුන් කරන ලද්දාහු මතු නූපදනා ස්වභාව ඇත්තාහු වන්නාහ. විඥානයෙහි යම් ඡන්දයෙක් යම් රාගයෙක් යම් නන්දියක් යම් තෘෂ්ණාවක් වේ නම් එය දුරු කරවු. මෙසේ ඒ විඥානය ප්‍රහීණ වූයේ උසුන්මුල් ඇත්තේ හිස් සුන් තල්ගසක් මෙන් (තාලාවස්තුවක් මෙන්) කරන ලද්දේ නැවත නොහටගන්නක් කරන ලද්දේ මතු නූපදනා ස්වභාව ඇත්තේ වන්නේ ය”යි. "
            },
            {
                "type": "centered",
                "text": "2. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය ඡන්දරාග සූත්‍රය",
                "level": "1"
            },
            {
                "text": "169. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් ව හුන් ආයුෂ්මත් රාධ තෙරුනට භාග්‍යවතුන් වහන්සේ තෙල වදාළ සේක: ",
                "type": "paragraph"
            },
            {
                "text": "රාධය, රූපයෙහි යම් ඡන්දයෙක් යම් රාගයෙක් යම් නන්දියෙක් යම් තණ්හාවක් යම් උපයඋපාදාන කෙනෙක් සිත පිළිබඳ අධිෂ්ඨානඅභිනිවෙසඅනුසය කෙනෙක් වෙත් නම් ඔවුන් දුරු කරවු. මෙසේ ඒ රූපය ප්‍රහීණ වූයේ උසුන්මුල් ඇත්තේ හිස් සුන් තල්ගසක් (හෝ සහමුලින් උදුරාහළ තල් ගස ඇති තැන මෙන්) මෙන් කරන ලද්දේ නැවත නොහටගන්නක් කරන ලද්දේ මතු නූපදනා ස්වභාව ඇත්තේ වන්නේ ය. වේදනායෙහි යම් ඡන්දයෙක් යම් රාගයෙක් යම් නන්දියක් යම් තණ්හාවක් යම් උපයඋපාදාන කෙනෙක් සිත පිළිබඳ අධිෂ්ඨානඅභිනිවෙසඅනුසය කෙනෙක් වෙත් නම් ඔවුන් දුරු කරවු. මෙසේ ඒ වෙදනාව ප්‍රහීණ වූවා උසුන්මුල් ඇත්තී හිස් සුන් තල් ගසක් මෙන් (තාලාවස්තුවක් මෙන්) කරන ලද්දී නැවත නොහටගන්නක් කරන ලද්දේ මතු නූපදනා ස්වභාව ඇත්තී වන්නී ය. සංඥායෙහි… සංස්කාරයන්හි යම් ඡන්දයෙක් යම් රාගයෙක් යම් නන්දියක් යම් තණ්හාවක් යම් උපයඋපාදාන කෙනෙක් සිත පිළිබඳ අධිෂ්ඨාන අභිනිවෙස අනුසය කෙනෙක් වෙත් නම් ඔවුන් දුරු කරවු. මෙසේ ඒ සංස්කාරයෝ ප්‍රහීණ වූවාහු උසුන්මුල් ඇත්තාහු හිස් සුන් තල්ගසක් මෙන් (තාලාවස්තුවක් මෙන්) කරන ලද්දාහු නැවත නොහටගන්නවුන් කරන ලද්දාහු මතු නූපදනා ස්වභාව ඇත්තාහු වන්නාහ. විඥානයෙහි යම් ඡන්දයෙක් යම් රාගයෙක් යම් නන්දියක් යම් තණ්හාවක් යම් උපය උපාදාන කෙනෙක් සිත පිළිබඳ අධිෂ්ඨාන අභිනිවෙස අනුසය කෙනෙක් වෙත් නම් ඔවුන් දුරු කරවු. මෙසේ ඒ විඥානය ප්‍රහීණ වූයේ උසුන්මුල් ඇත්තේ හිස් සුන් තල්ගසක් මෙන් (තාලාවස්තුවක් මෙන්) කරන ලද්දේ නැවත නොහටගන්නක් කරන ලද්දේ මතු නූපදනා ස්වභාව ඇත්තේ වන්නේ ය”යි.",
                "type": "paragraph"
            },
            {
                "text": "පළමුවැනි මාර වර්ග යි",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රනාමාවලිය :**",
                "type": "unindented"
            },
            {
                "text": "මාර, සත්ත, භවනෙත්ති, පරිඤ්ඤෙය යන සූත්‍ර සතර ය, සමණසූත්‍ර දෙක ය, සෝතාපන්න සූත්‍ර ය අරහන්ත සූත්‍රය ඡන්දරාගසූත්‍ර දෙක ය යි සූත්‍ර දශයෙකි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "353"
            },
            {
                "type": "heading",
                "text": "2. දුතිය වර්ගය",
                "level": 2
            },
            {
                "type": "centered",
                "text": "2. 2. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මාර සූත්‍රය",
                "level": "1"
            },
            {
                "text": "170. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පසෙකැ හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට තෙල සැල කළහ: වහන්ස, ‘මාර, මාර’යි කියනු ලැබෙයි. වහන්ස, ‘මාර’ නම් කවරෙ යැ?",
                "type": "paragraph"
            },
            {
                "text": "රාධය, රූපය මාර යැ, වේදනාව මාර යැ, සංඥාව මාර යැ, සංස්කාර මාර යැ, විඥානය මාර යි. රාධය, මෙසේ දක්නා ශ්‍රැතවත් ආර්යශ්‍රාවක රූපයෙහි දු කලකිරෙයි. වේදනා යෙහිදු කලකිරෙයි, සංඥායෙහි දු කලකිරෙයි, සංස්කාරයෙහි දු කලකිරෙයි, විඥානයෙහි දු කලකිරේ. කලකිරෙනුයේ නො ඇලෙයි, නො ඇලීම් හේතුයෙන් (පස්කඳින්) මිදෙයි, මිදුණු කල්හි මිදිණැ යි පස්විකුම් නැණ වෙයි, දැය ගෙවිණැ, මහබඹසර වැස නිමවන ලද, සිවුමඟ කිස කොට නිමවන ලද, මේ රහත් බව සඳහා කළ යුතු අන් කිසෙක් නැතැ යි දැනගනී.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මාරධම්ම සූත්‍රය",
                "level": 1
            },
            {
                "text": "171. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත් පසෙකැ හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට තෙල, සැලකළහ: වහන්ස, ‘මාරධම්ම, මාරධම්ම’ යි කියනු ලැබෙයි. වහන්ස,‘මාර ධම්ම’ නම් කවරෙ යැ?",
                "type": "paragraph"
            },
            {
                "text": "රාධය, රූපය මාරධම්ම යැ, වේදනාව මාරධම්ම යැ, සංඥාව මාරධම්ම යැ, සංස්කාර මාරධම්ම යැ, විඥානය මාරධම්ම යි. රාධ, මෙසේ දක්නා ආර්යශ්‍රාවක … මේ රහත් බව පිණිස අන් කිසෙක් නැතැ යි දැනගනී.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනිච්ච සූත්‍රය",
                "level": "1"
            },
            {
                "text": "172.** සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් ව හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට තෙල සැලකළහ: “වහන්ස, අනිත්‍ය යැ, අනිත්‍ය’යි කියනු ලැබෙයි, වහන්ස, අනිත්‍ය නම් කිමෙක් දෝ”යි?",
                "type": "paragraph"
            },
            {
                "text": "රාධය, රූපය අනිත්‍ය යැ, වේදනාව අනිත්‍ය යැ, සංඥාව අනිත්‍ය යැ, සංස්කාර අනිත්‍ය යැ. විඥානය අනිත්‍ය යි. රාධය, මෙසේ දක්නා ශ්‍රැතවත් ආර්යශ්‍රාවක … මේ බැව් පිණිස අනෙකෙක් නැතැ යි දැනගනී.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "355"
            },
            {
                "type": "centered",
                "text": "2. 2. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනිච්චධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "173. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පසෙක හුන් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට තෙල සැලකළහ: “වහන්ස, “අනිච්ච්‍ධම්ම යැ, අනිච්ච්‍ධම්ම”යි කියනු ලැබෙයි, වහන්ස, අනිච්ච්‍ධම්ම කිමෙක් දෝ යි?",
                "type": "paragraph"
            },
            {
                "text": "රාධය, රූපය අනිත්‍ය ස්වභාවය ඇත්තේ යැ. වේදනාව අනිත්‍ය ස්වභාවය ඇත්ති යැ. සංඥාව අනිත්‍යස්වභාවය ඇත්තී යැ. සංස්කාරයෝ අනිත්‍ය ස්වභාවය ඇතියහ. විඥානය අනිත්‍යස්වභාවය ඇත්තේ යි. රාධය, මෙසේ දක්නා ශ්‍රැතවත් ආර්යශ්‍රාවක … මේ රහත් බැව් පිණිස අනෙකෙක් නැතැ යි දැනගනී.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුක්ඛ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "174.** සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් වැ හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට තෙල සැල කළහ.: වහන්ස, දුක්ඛ, දුක්ඛ යි කියනු ලැබෙයි, වහන්ස, දුක්ඛ නම් කිමෙක් දෝ”යි?",
                "type": "paragraph"
            },
            {
                "text": "රාධය රූපය දුක් යැ, වේදනාව දුක් යැ, සංඥාව දුක් යැ, සංස්කාර දුක් යැ, විඥානය දුක යි. රාධය මෙසේ දක්නා මේ ශ්‍රැතවත් ආර්යශ්‍රාවක … මේ රහත් බව පිණිස අනෙකෙක් නැතැ යි දැනගනී.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුක්ඛධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "175. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත් පසෙකැ හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට තෙල සැල කළහ: “වහන්ස, “දුක්ඛධම්ම දුක්ඛධම්ම” යි කියනු ලැබේ” වහන්ස, දුක්ඛධම්ම කිමෙක් දෝ හෝ යි?",
                "type": "paragraph"
            },
            {
                "text": "රාධය, රූපය දුඃඛස්වභාවය ඇත්තේ ය, වේදනාව  දුඃඛස්වභාවය ඇත්තී ය, සංඥාව දුඃඛස්වභාවය ඇත්තී ය, සංස්කාරයෝ දුඃඛස්වභාවය ඇතියහ. විඥානය දුඃඛස්වභාවය ඇත්තේ යි. මෙසේ දක්නා මේ ශ්‍රැතවත් ආර්යශ්‍රාවක … මේ රහත් බව පිණිස අනෙකෙක් නැතැ යි දැනගනී.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "357"
            },
            {
                "type": "centered",
                "text": "2. 2. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනන්ත සූත්‍රය",
                "level": "1"
            },
            {
                "text": "176.** සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත් පසෙක හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට තෙල සැල කළහ: වහන්ස, ‘අනාත්ම යැ. අනාත්ම යැ’ යි කියනු ලැබේ, වහන්ස, අනාත්මය නම් කිමෙක් දෝ?යි.",
                "type": "paragraph"
            },
            {
                "text": "“රාධය, රූපය අනාත්ම යැ, වේදනාව අනාත්ම යැ, සංඥාව අනාත්ම යැ, සංස්කාරයෝ අනාත්මයහ, විඥානය අනාත්ම යි. රාධය, මෙසේ දක්නා මේ ශ්‍රැතවත් ආර්යශ්‍රාවක … මේ රහත් බව පිණිස අනෙකෙක් නැතැ යි දැනගනී.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනත්තධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "177. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පසෙක හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට තෙල සැල කළහ: වහන්ස, ‘අනාත්මස්වභාව යැ, අනාත්මස්වභාව යැ’යි කියනු ලැබෙයි, වහන්ස, අනාත්මස්වභාවය ඇත්තේ කිමෙක් දෝ”යි.",
                "type": "paragraph"
            },
            {
                "text": "“රාධය, රූපය, අනාත්මස්වභාව යැ, වේදනාව අනාත්මස්වභාව යැ, සංඥාව අනාත්ම ස්වභාව යැ, සංස්කාර අනාත්මස්වභාව යැ, විඥානය අනාත්ම ස්වභාව යැ. රාධය මෙසේ දක්නා … ශ්‍රැතවත් ආර්යශ්‍රාවක මේ රහත් බව පිණිස අනෙකෙක් නැතැ යි දැනගනී”.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඛයධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "178. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පසෙකැ හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැල කළහ: “වහන්ස, ‘ඛයධම්ම, ඛයධම්ම (නැසෙන සුලු)“යි කියනු ලැබේ. වහන්ස කිමෙක් ඛයධම්ම වේ දැ යි.",
                "type": "paragraph"
            },
            {
                "text": "රාධය, රූපය ඛයධම්ම යැ, වේදනාව ඛයධම්ම යැ, සංඥාව ඛයධම්ම යැ, සංස්කාර ඛයධම්ම යැ. විඥානය  ඛයධම්ම යි. රාධය මෙසේ දක්නා ශ්‍රැතවත් ආර්යශ්‍රාවක … මේ රහත් බව පිණිස අනෙකෙක් නැතැ යි දැනගනී”.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "359"
            },
            {
                "type": "centered",
                "text": "2. 2. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "වයධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "179. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පසෙකැ හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැල කළහ: වහන්ස, “වයධම්ම, වයධම්ම (වැනසෙන සුලු) යි කියනු ලැබෙයි, ‘වහන්ස කිමෙක් වයධම්ම වේ දැ”යි?",
                "type": "paragraph"
            },
            {
                "text": "රාධය, රූපය වයධම්ම යැ, වේදනාව වයධම්ම යැ, සංඥාව වයධම්ම යැ, සංස්කාර වයධම්ම යැ විඥානය  වයධම්ම යි. රාධය මෙසේ දක්නා ශ්‍රැතවත් ආර්යශ්‍රාවක … මේ රහත් බව පිණිස අනෙකෙක් නැතැ යි දැනගනී.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සමුදයධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "180. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් ව හුන් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැල කළහ: වහන්ස, ‘සමුදයධම්ම, සමුදයධම්ම (හටගන්නාසුලු)’යි කියනු ලැබෙයි, වහන්ස, කිමෙක් සමුදය ධම්ම වේ දැ යි?",
                "type": "paragraph"
            },
            {
                "text": "රාධය, රූපය සමුදයධම්ම යැ. වේදනාව සමුදයධම්ම යැ. සංඥාව, සමුදයධම්ම යැ. සංස්කාර සමුදයධම්ම යැ. විඥානය සමුදයධම්ම යි. රාධය මෙසේ දක්නා ශ්‍රැතවත් ආර්යශ්‍රාවක … මේ රහත් බව පිණිස අනෙකෙක් නැතැ යි දැනගනී.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 2. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නිරොධධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "181. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් ව හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැල කළහ: වහන්ස, ‘නිරොධධම්ම, නිරොධධම්ම (නිරුද්ධ වනසුලු)’ යි කියනු ලැබෙයි. වහන්ස, කිමෙක් නිරොධධම්ම වේ දැ”යි.",
                "type": "paragraph"
            },
            {
                "text": "“රාධය, රූපය ‘නිරොධධම්ම යැ, වේදනාව නිරොධධම්ම යැ, සංඥාව නිරොධධම්ම යැ, සංස්කාර නිරොධධම්ම යැ, විඥානය නිරොධධම්ම යි. රාධය, මෙසේ දක්නා ශ්‍රැතවත් ආර්යශ්‍රාවක … මේ රහත් බව පිණිස අනෙකෙක් නැතැ”යි දැනගනීයි.",
                "type": "paragraph"
            },
            {
                "text": "දුතිය මාරවර්ග යි",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රනාමාවලිය :**",
                "type": "unindented"
            },
            {
                "text": "මාර සූත්‍රය ද, මාරධම්ම සූත්‍රය ද, අනික් අනිච්ච සූත්‍ර දෙකෙක් ද, දුක්ඛ සූත්‍ර දෙකෙක් ද කියන ලද යැ. එසේ ම අනත්ත සූත්‍ර ද දෙකෙකි. ඛයධම්ම වයධම්ම සමුදයධම්ම සූත්‍රයෝ ද වෙති. නිරෝධධම්ම සූත්‍රයෙන් (ඔහු) දොළසෙක් වෙත්.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "361"
            },
            {
                "text": "3. ආයාචන වර්ගය",
                "type": "heading",
                "level": "2"
            },
            {
                "type": "centered",
                "text": "2. 3. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මාර සූත්‍රය",
                "level": "1"
            },
            {
                "text": "182. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් ව හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැල කළහ: වහන්ස, මම් භාග්‍යවතුන් වහන්සේ වෙතින් යම් දහමක් අසා එකලා වැ ගණයා කෙරෙන් වෙන් වැ නොපමා වැ කෙලෙස් තවන වැර ඇති වැ නිවන් පිණිස මෙහෙයූ සිත් ඇති වැ වෙසෙම් ද, භාග්‍යවතුන් වහන්සේ එබඳු දහමක් සැකෙවින් මට දේශනා කරන සේක් නම් මැනවැ”යි.",
                "type": "paragraph"
            },
            {
                "text": "රාධය, යමෙක් මාර ද, එහි තොපගේ ඡන්දය (දුර්වල රාගය) දුරු කටයුතු යැ. රාගය (බලවත් රාගය) පහකටයුතු යැ. ඡන්දරාගය පහකටයුතු යි. රාධය මාර කවරේ ද යත්:",
                "type": "paragraph"
            },
            {
                "text": "රාධ, රූපය මාර යැ, එහි ලා තොපගේ ඡන්දය පහ කටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. වේදනාව … සංඥාව … සංස්කාර … විඥානය මාර යැ, එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහ කටයුතු යැ, ඡන්ද රාගය පහකටයුතු යි. රාධය යමෙක් මරු ද එහි ඡන්දය පහකටයුතුය, රාගය පහකට යුතු යැ, ඡන්දරාගය පහකටයුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මාරධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "183. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පසෙකැ හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැල කළහ: වහන්ස, ... නිවන් පිණිස යොමුකළ සිත් ඇති වැ වෙසෙන්නෙම් ද භාග්‍ය වතුන් වහන්සේ එ බඳු දහමක් මට සැකෙවින් දෙසනසේක් නම් මැනවැ”යි.",
                "type": "paragraph"
            },
            {
                "text": "රාධය, යමෙක් මරණධර්ම (මැරෙනසුලු) නම් එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. රාධය, කවරෙක් මරණධර්ම වේ ද යත්: රාධය, රූපය මරණධර්ම යැ. එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතුයැ, ඡන්දරාගය පහකට යුතු යි. වේදනාව … සංඥාව … සංස්කාර … විඥානය මරණධර්ම ය, එ‍‍හි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. රාධය, යමෙක් මරණධර්ම නම් එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ. ඡන්දරාගය පහකටයුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "363"
            },
            {
                "type": "centered",
                "text": "2. 3. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනිච්ච සූත්‍රය",
                "level": "1"
            },
            {
                "text": "184. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් ව හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැල කළහ: වහන්ස, … නිවන් පිණිස යොමු කළ සිත් ඇති වැ වෙසෙන්නෙම් ද භාග්‍ය වතුන් වහන්සේ එ බඳු දහමක් මට සැකෙවින් දේශනා කරන සේක් නම් මැනවැ”යි.",
                "type": "paragraph"
            },
            {
                "text": "රාධය, යමෙක් අනිත්‍ය නම් එහි ලා තොපගේ ඡන්දය පහකළයුතු යැ, රාගය පහකළ යුතු යැ, ඡන්දරාගය පහකළයුතු යි. රාධය, කිමෙක් අනිත්‍ය ද යත්: රාධය, රූපය අනිත්‍ය යැ, එහි ලා තොපගේ ඡන්දය පහකළයුතු යැ, රාගය පහකළයුතු යැ, ඡන්දරාගය පහකළයුතු යි. වේදනාව … සංඥාව … සංස්කාර … විඥානය අනිත්‍ය යැ. එහි ලා තොපගේ ඡන්දය පහකළයුතු යැ, රාගය පහකළයුතු යැ, ඡන්දරාගය පහකළ යුතු යි. රාධය යමෙක් අනිත්‍ය නම් එහි ලා තොපගේ ඡන්දය පහකළයුතු යැ, රාගය පහකළයුතු යැ, ඡන්දරාගය පහකළයුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනිච්චධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "185. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් ව හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැල කළහ: වහන්ස, … නිවන් පිණිස යොමු කළ සිත් ඇති වැ වෙසෙන්නෙම් ද, භාග්‍යවතුන් වහන්සේ එ බඳු දහමක් සැකෙවින් මට දේශනා කරන සේක් නම් මැනවැ”යි.",
                "type": "paragraph"
            },
            {
                "text": "රාධය, යමෙක් අනිත්‍ය ස්වභාව ඇත්තේ නම් එහි ලා තොපගේ ඡන්දය පහකළයුතු ය, රාගය පහකළයුතු යැ. ඡන්දරාගය පහකළයුතු යි. ",
                "type": "paragraph"
            },
            {
                "text": "රාධ, කිමෙක් අනිත්‍ය ස්වභාව ඇත්තේ ද යත්: රාධය, රූපය අනිත්‍ය ස්වභාව ඇත්තේ යැ. එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්ද රාගය පහකටයුතු යි. වේදනාව … සංඥාව … සංස්කාර … විඥානය අනිත්‍ය ස්වභාව ඇත්තේ යැ. එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ. රාගය පහකට යුතු යැ. ඡන්දරාගය පහකටයුතු යි. රාධය, යමෙක් අනිත්‍ය ස්වභාව ඇත්තේ නම් එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ. රාගය පහකටයුතු යැ, ඡන්දරාගය පහකට යුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුක්ඛ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "186. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පසෙක හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැල කළහ: වහන්ස, … “නිවන් පිණිස යොමු කළ සිත් ඇති වැ වෙසෙන්නෙම් ද, භාග්‍යවතුන් වහන්සේ එබඳු දහමක් සැකෙවින් මට දේශනා කරන සේක් නම් මැනවැ”යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "365"
            },
            {
                "text": "රාධය, යමෙක් දුක් නම් එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකට යුතු යැ, ඡන්දරාගය පහකටයුතු යි. රාධය, කිමෙක් දුක් ද යත්: රාධය, රූපය දුක් යැ, එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. වේදනාව … සංඥාව … සංස්කාර … විඥානය දුක් ය, එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. රාධය, යමෙක් දුක් නම් එහි ලා තොපගේ ඡන්දය පහකළයුතු යැ. රාගය පහකට යුතු යැ. ඡන්දරාගය පහකළයුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුක්ඛධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "187. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් ව හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැල කළහ: වහන්ස, … නිවන් කරා යොමු කළ සිතැති වැ වෙසෙන්නෙම් නම් භාග්‍යවතුන් වහන්සේ එබඳු දහමක් සැකෙවින් මට දේශනා කරන සේක් නම් මැනවැ”යි.",
                "type": "paragraph"
            },
            {
                "text": "රාධය, යමෙක් දුක්ඛ ස්වභාව ඇත්තේ නම් එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ. රාගය පහ කටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. රාධය, කිමෙක් දුඃඛස්වභාව ඇත්තේ ද යත්: රාධය, රූපය දුඃඛස්වභාව ඇත්තේ යැ. එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ. රාගය පහකටයුතු යැ. ඡන්දරාගය පහකටයුතු යි. වේදනාව … සංඥාව … සංස්කාරය … විඥානය දුඃඛස්වභාව ඇත්තේ යැ. එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. රාධය යමක් දුඃඛස්වභාව ඇත්තේ නම් එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනන්ත සූත්‍රය",
                "level": "1"
            },
            {
                "text": "188. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් ව හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැලකළහ: වහන්ස, …: “නිවන් කරා යොමු කළ සිත් ඇති වැ වෙසෙන්නෙම් නම් භාග්‍යවතුන් වහන්සේ එබඳු දහමක් සැකෙවින් මට දේශනා කරන සේක් නම් යහපතැ යි.",
                "type": "paragraph"
            },
            {
                "text": "රාධය, යමෙක් අනාත්ම නම් එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ. රාගය පහ කටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. රාධය, කිමෙක් අනාත්ම ද යත්: රාධය, රූපය අනාත්ම යැ ; එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකට යුතු යැ, ඡන්දරාගය පහකටයුතු යි. වේදනාව … සංඥාව … සංස්කාර … විඥානය අනාත්ම යැ. එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. රාධය, යමෙක් අනාත්ම නම් එහි ලා තොපගේ ඡන්දය පහකට යුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "367"
            },
            {
                "type": "centered",
                "text": "2.3.8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනත්තධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "189.** සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් ව හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැල කළහ: වහන්ස, “…: නිවන් පිණිස යොමු කළ සිත් ඇති වැ වෙසෙන්නෙම් නම් භාග්‍යවතුන් වහන්සේ එබඳු දහමක් සැකෙවින් මට දේශනා කරන සේක් නම් මැනැවැ”යි.",
                "type": "paragraph"
            },
            {
                "text": "රාධය, යමෙක් අනාත්ම ස්වභාව ඇත්තේ නම් එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. රාධය, කිමෙක් අනාත්ම ස්වභාව ඇත්තේ ද යත්: රාධය, රූපය අනාත්ම ස්වභාව ඇත්තේ යැ. එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. වෙදනාව … සංඥාව … සංස්කාර … විඥානය අනාත්මස්වභාව ඇත්තේ යැ. එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. රාධය, යමක් අනාත්ම ස්වභාවය ඇත්තේ නම් එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ. රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඛයධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "190. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් ව හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැල කළහ: වහන්ස, …: “නිවන් පිණිස යොමු කළ සිත් ඇති වැ වෙසෙන්නෙම් නම් භාග්‍යවතුන් වහන්සේ එ බඳු දහමක් සැකෙවින් මට දේශනා කරනසේක්වා”යි.",
                "type": "paragraph"
            },
            {
                "text": "රාධය, යමෙක් ක්ෂය වනසුලු නම් එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. රාධය, කිමෙක් ක්ෂය වනසුලු ද යත්: රාධය, රූපය ක්ෂය වනසුලු යැ. එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. වේදනාව … සංඥාව … සංස්කාර … විඥානය ක්ෂය වනසුලු යැ, එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. රාධය, යමෙක් ක්ෂය වනසුලු නම් එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "වයධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "191. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් වැ හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැල කළහ: වහන්ස, …: “නිවන් පිණිස යොමු කළ සිත් ඇති වැ වෙසෙන්නෙම් ද, භාග්‍යවතුන් වහන්සේ එබඳු දහමක් සැකෙවින් මට දේශනා කරන සේක් නම් මැනවැ”යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "369"
            },
            {
                "text": "රාධය, යමෙක් වැය වනසුලු නම් එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. ",
                "type": "paragraph"
            },
            {
                "text": "රාධය, කිමෙක් වැය වනසුලු වේ ද යත්: ",
                "type": "paragraph"
            },
            {
                "text": "රාධය, රූපය වැය වනසුලු යැ, එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. වේදනාව … සංඥාව … සංස්කාර … විඥානය වැය වනසුලු යැ. එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. රාධය යමක් වැය වනසුලු නම් එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ. රාගය පහකටයුතු යැ. ඡන්දරාගය පහකටයුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සමුදයධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "192. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත් පස් ව හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැල කළහ: වහන්ස, …: “නිවන් කරා යොමු කළ සිතැති වැ වෙසෙම් ද, භාග්‍යවතුන් වහන්සේ එබඳු දහමක් සැකෙවින් මට දේශනා කරන සේක් නම් මැනවැ”යි.",
                "type": "paragraph"
            },
            {
                "text": "රාධය, යමක් හටගන්නාසුලු නම් එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ ඡන්දරාගය පහකටයුතු යි. ",
                "type": "paragraph"
            },
            {
                "text": "රාධය, කිමෙක් හටගන්නාසුලු වේ ද යත්: රාධය, රූපය හටගන්නාසුලු යැ. එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ. රාගය පහකටයුතු යැ ඡන්දරාගය පහකටයුතු යි. වේදනාව … සංඥාව … සංස්කාර … විඥානය හටගන්නාසුලු යැ. එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ. ඡන්දරාගය පහකටයුතු යි. රාධය, යමෙක් හටගන්නාසුලු නම් එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 3. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නිරොධධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "193.** සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් ව හුන් ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැල කළහ: වහන්ස, …: “නිවන් කරා යොමුකළ සිත් ඇති වැ වෙසෙම් ද, භාග්‍යවතුන් වහන්සේ එ බඳු දහමක් සැකෙවින් මට දේශනා කරන සේක්, නම් මැනවැ”යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "371"
            },
            {
                "text": "රාධය, යමෙක් නිරුද්ධ වනසුලු නම් එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. රාධ, කිමෙක් නිරුද්ධ වනසුලු ද යත්: රාධය, රූපය නිරුද්ධ වනසුලු ය. එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. වේදනාව … සංඥාව … සංස්කාර … විඥානය නිරුද්ධ වනසුලු යැ. එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. රාධය, යමෙක් නිරුද්ධ වනසුලු නම් එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකට යුතු යි.",
                "type": "paragraph"
            },
            {
                "text": "තෙවෙනි ආයාචනා වර්ග යි",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි උද්දානය :**",
                "type": "unindented"
            },
            {
                "text": "මාර-මාරධම්ම, අනිච්ච-අනිච්චධම්ම, දුක්ඛ-දුක්ඛධම්ම, අනත්ත-අනත්තධම්ම, ඛයධම්ම, වයධම්ම, සමුදය ධම්ම හා නිරොධධම්ම යි සූත්‍ර දොළොසෙකි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "373"
            },
            {
                "text": "4. උපනිසින්න වර්ගය",
                "type": "heading",
                "level": "2"
            },
            {
                "type": "centered",
                "text": "2. 4. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මාර සූත්‍රය",
                "level": "1"
            },
            {
                "text": "194. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එ කල්හි ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පස් ව හුන්හ. එකත්පස් ව හුන් ආයුෂ්මත් රාධ තෙරුන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: රාධය, “යමෙක් මාර නම් එහි ලා තොපගේ ඡන්දය පහකට යුතුයැ. රාගය පහකට යුතුයැ, ඡන්දරාගය පහකට යුතුයි. ",
                "type": "paragraph"
            },
            {
                "text": "රාධය, කිමෙක්  මරු ද යත්: රාධය, රූපය මාර යැ. එහි ලා තොපගේ ඡන්දය පහකටයුතු ය. රාගය පහකටයුතු ය. ඡන්දරාගය පහකටයුතු යි. වෙදනාව …සංඥාව … සංස්කාර … විඥානය මාර යැ. එහිලා තොපගේ ඡන්දය  පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. රාධය යමෙක් මාර නම් එහිලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු ය”යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 4. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මාරධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "195. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් ව හුන් ආයුෂ්මත් රාධ තෙරුන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: රාධය, යමෙක් මාරධම්ම (මරණ ස්වභාව) නම් එහි ලා තොපගේ ඡන්දය පහකට යුතු යැ, රාගය, පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. ",
                "type": "paragraph"
            },
            {
                "text": "රාධ කිමෙක් මරණ ස්වභාව ද යත්: රාධය, රූපය මැරෙන සුලු යැ. එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි. වේදනාව … සංඥාව … සංස්කාර … විඥානය මැරෙනසුලු ය. එ‍‍හි ලා තොපගේ ඡන්දය  පහකට යුතු යැ, රාගය පහකට යුතු යැ, ඡන්දරාගය පහකට යුතු යි. රාධය යමෙක් මැරෙනසුලු නම් එහි ලා තොපගේ ඡන්දය පහකටයුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකටයුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 4. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනිච්ච සූත්‍රය",
                "level": "1"
            },
            {
                "text": "196. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "එකත්පස් ව හුන් ආයුෂ්මත් රාධ තෙරුන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: රාධය, යමෙක් අනිත්‍ය නම් එහි …  ඡන්දරාගය පහකට යුත්තේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "375"
            },
            {
                "type": "centered",
                "text": "2. 4. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනිච්චධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "197. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "රාධය යමෙක් අනිත්‍යධර්ම නම් එහි ... ඡන්දරාගය ප්‍රහාණ කටයුත්තේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 4. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුක්ඛ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "198. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "රාධය යමෙක් දුක් නම් එහි … ඡන්දරාගය පහකට යුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 4. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුක්ඛධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "199. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "රාධය යමෙක් දුක්ඛධර්ම නම් එහි … ඡන්දරාගය පහකට යුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2.4.7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනන්ත සූත්‍රය",
                "level": "1"
            },
            {
                "text": "200. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "රාධය යමෙක් අනාත්ම නම් එහි … ඡන්දරාගය පහකට යුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 4. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනත්තධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "201. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "රාධය, යමෙක් අනාත්මධර්ම නම් එහි … ඡන්දරාගය පහකට යුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 4. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඛයධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "202. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "රාධය, යමෙක් ක්ෂයධර්ම නම් එහි ... ඡන්දරාගය පහකට යුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "377"
            },
            {
                "type": "centered",
                "text": "2. 4. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "වයධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "203. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "රාධය, යමෙක් ව්‍යයධර්ම නම් එහි … ඡන්දරාගය පහකට යුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 4. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සමුදයධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "204. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "රාධය, යමෙක් සමුදයධර්ම නම් එහි … ඡන්දරාගය පහකට යුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "2. 4. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නිරොධධම්ම සූත්‍රය",
                "level": "1"
            },
            {
                "text": "205. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "රාධය, යමෙක් නිරුද්ධ වනසුලු නම් එහි ලා තොපගේ ඡන්දය පහකට යුතු යැ, රාගය පහකටයුතු යැ, ඡන්දරාගය පහකට යුතු යි.",
                "type": "paragraph"
            },
            {
                "text": "රාධය, කිමෙක් නිරුද්ධ වනසුලු ද යත්: රාධය, රූපය නිරුද්ධ වනසුලු යැ. එහි ලා තොපගේ ඡන්දය පහකට යුතු යැ, රාගය පහකට යුතු යැ, ඡන්දරාගය පහකට යුතු යි. වේදනාව … සංඥාව … සංස්කාර … විඥානය නිරුද්ධ වනසුලු ය. එහි ලා තොපගේ ඡන්දය පහකට යුතු යැ, රාගය පහකට යුතු යැ, ඡන්දරාගය පහකට යුතු යි. රාධය යමක් නිරුද්ධ වනසුලු නම් එහි ලා තොපගේ ඡන්දය පහකට යුතු යැ රාගය පහකට යුතු යැ ඡන්දරාගය පහකට යුතු ය යි.",
                "type": "paragraph"
            },
            {
                "text": "සිව්වැනි උපනිසින්න වර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍ර නාමාවලිය :**",
                "type": "unindented"
            },
            {
                "text": "මාර සූත්‍රය ද, මාරධම්ම සූත්‍රය ද, අනිච්ච, අනිච්චධම්ම ය යි අනෙක් සූත්‍ර දෙකෙක් ද, දුක්ඛ, දුක්ඛධම්ම ය යි සූත්‍ර දෙකෙක් ද වදාරන ලදහ. එසේ ම අනත්ත, අනත්තධම්මය යි සූත්‍ර දෙකෙකි. ඛයධම්ම, වයධම්ම, සමුදය ධම්ම සූත්‍රයෝ ද වෙත්. (මෙසේ) නිරොධධම්ම සූත්‍රයෙන් සූත්‍ර දොළසක් වේ.",
                "type": "paragraph"
            },
            {
                "text": "(මෙසේ මාර සූත්‍ර විස්තර කටයුතු යි. මෙසේ නිරොධධම්ම සුත්‍රයෙන් සතිස් සූත්‍ර කෙනෙක් විස්තර කටයුත්තාහ. මෙසේ රාධ සංයුක්තය පිඬු කළ කල්හි සුඅනු සූත්‍ර කෙනෙක් වෙත්.)",
                "type": "paragraph"
            },
            {
                "text": "රාධසංයුක්තය නිමි.",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    }
]