[
    {
        "filename": "sn-slyv-3",
        "bookId": 19,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "450"
            },
            {
                "type": "heading",
                "text": "3. මාතුගාමසංයුත්තං",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. මාතුගාමවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "3. 1. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මාතුගාමසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "280. පඤ්චහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො මාතුගාමො එකන්තඅමනාපො හොති පුරිසස්ස. කතමෙහි පඤ්චහි: න ච රූපවා හොති, න ච භොගවා හොති, න ච සීලවා හොති, අලසො ච හොති, පජඤ්චස්ස න ලභති. ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි අඞ්ගෙහි සමන්නාගතො මාතුගාමො එකන්තඅමනාපො හොති පුරිසස්ස."
            },
            {
                "type": "paragraph",
                "text": "පඤ්චහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො මාතුගාමො එකන්තමනාපො හොති පුරිසස්ස. කතමෙහි පඤ්චහි: රූපවා ච හොති, භොගවා ච හොති, සීලවා ච හොති, දක්ඛො ච හොති අනලසො, පජඤ්චස්ස ලභති. ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි අඞ්ගෙහි සමන්නාගතො මාතුගාමො එකන්තමනාපො හොති පුරිසස්සාති."
            },
            {
                "type": "centered",
                "text": "3. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පුරිසසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "281. පඤ්චහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො පුරිසො එකන්තාමනාපො හොති මාතුගාමස්ස. කතමෙහි පඤ්චහි: න ච රූපවා හොති, න ච භොගවා හොති, න ච සීලවා හොති, අලසො ච හොති, පජඤ්චස්ස න ලභති. ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි අඞ්ගෙහි සමන්නාගතො පුරිසො එකන්තාමනාපො හොති මාතුගාමස්ස."
            },
            {
                "type": "paragraph",
                "text": "පඤ්චහි භික්ඛවෙ අඞ්ගෙහි සමන්නාගතො පුරිසො එකන්තමනාපො හොති මාතුගාමස්ස. කතමෙහි පඤ්චහි: රූපවා ච හොති, භොගවා ච හොති, සීලවා ච හොති, දක්ඛො ච හොති අනලසො, පජඤ්චස්ස ලභති. ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි අඞ්ගෙහි සමන්නාගතො පුරිසො එකන්තමනාපො හොති මාතුගාමස්සාති."
            },
            {
                "type": "centered",
                "text": "3. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආවෙණිකදුක්ඛසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "282. පඤ්චිමානි භික්ඛවෙ, මාතුගාමස්ස ආවෙණිකානි දුක්ඛානි යානි මාතුගාමො පච්චනුභොති අඤ්ඤත්රෙව පුරිසෙහි. කතමානි පඤ්ච: ඉධ භික්ඛවෙ මාතුගාමො දහරොව සමානො පතිකුලං ගච්ඡති, ඤාතකෙහි විනා හොති. ඉදං භික්ඛවෙ, මාතුගාමස්ස පඨමං ආවෙණිකං දුක්ඛං, යං මාතුගාමො පච්චනුභොති අඤ්ඤත්රෙව පුරිසෙහි. පුන ච පරං භික්ඛවෙ, මාතුගාමො උතුනී හොති. ඉදං භික්ඛවෙ මාතුගාමස්ස දුතියං ආවෙණිකං දුක්ඛං යං මාතුගාමො පච්චනුභොති අඤ්ඤත්රෙව පුරිසෙහි."
            },
            {
                "type": "page-break",
                "text": "452"
            },
            {
                "type": "paragraph",
                "text": "පුන ච පරං භික්ඛවෙ මාතුගාමො ගබ්භිනී හොති. ඉදං භික්ඛවෙ මාතුගාමස්ස තතියං ආවෙණිකං දුක්ඛං, යං මාතුගාමො පච්චනුභොති, අඤ්ඤත්රෙව පුරිසෙහි. පුන ච පරං භික්ඛවෙ මාතුගාමො විජායති. ඉදං භික්ඛවෙ මාතුගාමස්ස චතුත්ථං ආවෙණිකං දුක්ඛං, යං මාතුගාමො පච්චනුභොති, අඤ්ඤත්රෙව පුරිසෙහි. පුන ච පරං භික්ඛවෙ මාතුගාමො පුරිසස්ස පාරිචරියං උපෙති. ඉදං භික්ඛවෙ මාතුගාමස්ස පඤ්චමං ආවෙණිකං දුක්ඛං, යං මාතුගාමො පච්චනුභොති, අඤ්ඤත්රෙව පුරිසෙහි. ඉමානි ඛො භික්ඛවෙ පඤ්ච මාතුගාමස්ස ආවෙණිකානි දුක්ඛානි, යානි මාතුගාමො පච්චනුභොති අඤ්ඤත්රෙව පුරිසෙහීති."
            },
            {
                "type": "centered",
                "text": "3. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තීහිධම්මෙහිසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "283. තීහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො යෙභුය්යෙන කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජති. කතමෙහි තීහි: ඉධ භික්ඛවෙ මාතුගාමො පුබ්බණ්හසමයං මච්ඡෙරමලපරියුට්ඨිතෙන චෙතසා අගාරං අජ්ඣාවසති. මජ්ඣන්තිකං සමයං ඉස්සා පරියුට්ඨිතෙන චෙතසා අගාරං අජ්ඣාවසති. සායන්හසමයං කාමරාගපරියුට්ඨිතෙන චෙතසා අගාරං අජ්ඣාවසති. ඉමෙහි ඛො භික්ඛවෙ, තීහි ධම්මෙහි සමන්නාගතො මාතුගාමො යෙභුය්යෙන කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජතීති."
            },
            {
                "type": "centered",
                "text": "3. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනුරුද්ධසුත්තං{1 ඉදං සුත්තං මරම්මපොත්ථකෙ න දිස්සතෙ.}",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "284. අථ ඛො ආයස්මා අනුරුද්ධො යෙන භගවා තෙනුපසඞ්කමි -පෙ- එකමන්තං නිසින්නො ඛො ආයස්මා අනුරුද්ධො භගවන්තං එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "ඉධාහං භන්තෙ මාතුගාමං පස්සාමි දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජන්තං{2 උප්පජ්ජන්තං - සී 1, 2.}. කතීහි නු ඛො භන්තෙ ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජතීති?"
            },
            {
                "type": "paragraph",
                "text": "පඤ්චහි ඛො අනුරුද්ධ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජති. කතමෙහි පඤ්චහි: අස්සද්ධො ච හොති, අහිරිකො ච හොති, අනොත්තප්පී ච හොති, කොධනො ච හොති, දුප්පඤ්ඤො ච හොති. ඉමෙහි ඛො අනුරුද්ධ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජතීති."
            },
            {
                "type": "page-break",
                "text": "454"
            },
            {
                "type": "centered",
                "text": "3. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කොධනසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "285. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජති. කතමෙහි පඤ්චහි: අස්සද්ධො ච හොති, අහිරිකො ච හොති, අනොත්තාපී ච හොති, කොධනො ච හොති, දුප්පඤ්ඤො ච හොති. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජතීති."
            },
            {
                "type": "centered",
                "text": "3. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "උපනාහීසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "286. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජති. කතමෙහි පඤ්චහි: අස්සද්ධො ච හොති, අහිරිකො ච හොති, අනොත්තාපී ච හොති, උපනාහී ච හොති, දුප්පඤ්ඤො ච හොති; ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජති."
            },
            {
                "type": "centered",
                "text": "3. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඉස්සුකීසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "287. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජති. කතමෙහි පඤ්චහි: අස්සද්ධො ච හොති, අහිරිකො ච හොති, අනොත්තාපී ච හොති, ඉස්සුකී ච හොති, දුප්පඤ්ඤො ච හොති; ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජතීති."
            },
            {
                "type": "centered",
                "text": "3. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මච්ඡරීසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "288. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජති. කතමෙහි පඤ්චහි: අස්සද්ධො ච හොති, අහිරිකො ච හොති, අනොත්තාපී ච හොති, මච්ඡරී ච හොති, දුප්පඤ්ඤො ච හොති. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජතීති."
            },
            {
                "type": "page-break",
                "text": "456"
            },
            {
                "type": "centered",
                "text": "3. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අතිචාරීසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "289. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජති. කතමෙහි පඤ්චහි: අස්සද්ධො ච හොති, අහිරිකො ච හොති, අනොත්තාපී ච හොති, අතිචාරී ච හොති, දුප්පඤ්ඤො ච හොති. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජතීති."
            },
            {
                "type": "centered",
                "text": "3. 1. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුස්සීලසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "290. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජතීති. කතමෙහි පඤ්චහි: අස්සද්ධො ච හොති, අහිරිකො ච හොති, අනොත්තාපී ච හොති, දුස්සීලො ච හොති, දුප්පඤ්ඤො ච හොති. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජතීති."
            },
            {
                "type": "centered",
                "text": "3. 1. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අප්පස්සුතසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "291. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජතීති. කතමෙහි පඤ්චහි: අස්සද්ධො ච හොති, අහිරිකො ච හොති, අනොත්තාපී ච හොති, අප්පස්සුතො ච හොති, දුප්පඤ්ඤො ච හොති. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජතීති."
            },
            {
                "type": "centered",
                "text": "3. 1. 13.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කුසීතසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "292. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජතීති. කතමෙහි පඤ්චහි: අස්සද්ධො ච හොති, අහිරිකො ච හොති, අනොත්තාපී ච හොති, කුසීතො ච හොති, දුප්පඤ්ඤො ච හොති. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජතීති."
            },
            {
                "type": "page-break",
                "text": "458"
            },
            {
                "type": "centered",
                "text": "3. 1. 14.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මුට්ඨස්සතිසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "293. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජතීති. කතමෙහි පඤ්චහි: අස්සද්ධො ච හොති, අහිරිකො ච හොති, අනොත්තාපී ච හොති, මුට්ඨස්සති ච හොති, දුප්පඤ්ඤො ච හොති. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජතීති."
            },
            {
                "type": "centered",
                "text": "3. 1. 15.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පඤ්චවෙරසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "294. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජතීති. කතමෙහි පඤ්චහි: පාණාතිපාතී ච හොති, අදින්නාදායී ච හොති, කාමෙසුමිච්ඡාචාරී ච හොති, මුසාවාදී ච හොති, සුරාමෙරයමජ්ජප්පමාදට්ඨායී ච හොති. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා අපායං දුග්ගතිං විනිපාතං නිරයං උපපජ්ජතීති."
            },
            {
                "type": "centered",
                "text": "මාතුගාමවග්ගො පඨමො",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "මාතුගාමො පුරිසො ච ආවෙණිකො තීහි ධම්මෙහි\nකොධනො උපනාහී ච ඉස්සුකී මච්ඡරෙන ච,\nඅතිචාරී ච අනුරුද්ධො දුස්සීලො වාප්පස්සුතො\nකුසීතො මුට්ඨස්සතිචෙති පඤ්චවෙරං පඤ්චදසාති.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "460"
            },
            {
                "type": "heading",
                "text": "2. අනුරුද්ධවග්ගො ",
                "level": 2
            },
            {
                "type": "centered",
                "text": "3. 2. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනුරුද්ධසුත්තං{1 ඉදම්පි සුත්තං මරම්ම පොත්ථකෙ න දිස්සතෙ.}",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "295. අථ ඛො ආයස්මා අනුරුද්ධො යෙන භගවා තෙනුපසඞ්කමි -පෙ- එකමන්තං නිසින්නො ඛො ආයස්මා අනුරුද්ධො භගවන්තං එතදවොච:"
            },
            {
                "type": "paragraph",
                "text": "ඉධාහං භන්තෙ මාතුගාමං පස්සාමි දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජන්තං. කතීහි නු ඛො භන්තෙ ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජතීති."
            },
            {
                "type": "paragraph",
                "text": "පඤ්චහි ඛො අනුරුද්ධ ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති. කතමෙහි පඤ්චහි: සද්ධො ච හොති, හිරිමා ච හොති, ඔත්තාපී ච හොති, අක්කොධනො ච හොති, පඤ්ඤවා ච හොති. ඉමෙහි ඛො අනුරුද්ධ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජතීති."
            },
            {
                "type": "centered",
                "text": "3. 2. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අක්කොධනසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "296. පඤ්චහි ඛො අනුරුද්ධ ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති. කතමෙහි පඤ්චහි: සද්ධො ච හොති, හිරිමා ච හොති, ඔත්තාපී ච හොති, අක්කොධනො ච හොති, පඤ්ඤවා ච හොති. ඉමෙහි ඛො අනුරුද්ධ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජතීති."
            },
            {
                "type": "centered",
                "text": "3. 2. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනුපනාහීසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "297. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති. කතමෙහි පඤ්චහි: සද්ධො ච හොති, හිරිමා ච හොති, ඔත්තාපී ච හොති, අනුපනාහී ච හොති, පඤ්ඤවා ච හොති. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජතීති."
            },
            {
                "type": "page-break",
                "text": "462"
            },
            {
                "type": "centered",
                "text": "3. 2. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනිස්සුකීසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "298. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති. කතමෙහි පඤ්චහි: සද්ධො ච හොති, හිරිමා ච හොති, ඔත්තාපී ච හොති, අනිස්සුකී ච හොති, පඤ්ඤවා ච හොති. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජතීති."
            },
            {
                "type": "centered",
                "text": "3. 2. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අමච්ඡරීසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "299. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති. කතමෙහි පඤ්චහි: සද්ධො ච හොති, හිරිමා ච හොති, ඔත්තාපී ච හොති, අමච්ඡරී ච හොති, පඤ්ඤවා ච හොති. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජතීති."
            },
            {
                "type": "centered",
                "text": "3. 2. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනතිචාරීසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "300. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති. කතමෙහි පඤ්චහි: සද්ධො ච හොති, හිරිමා ච හොති, ඔත්තාපී ච හොති, අනතිචාරී ච හොති, පඤ්ඤවා ච හොති. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජතීති."
            },
            {
                "type": "centered",
                "text": "3. 2. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සීලවන්තසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "301. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති. කතමෙහි පඤ්චහි: සද්ධො ච හොති, හිරිමා ච හොති, ඔත්තාපී ච හොති, සීලවා ච හොති, පඤ්ඤවා ච හොති. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජතීති."
            },
            {
                "type": "page-break",
                "text": "464"
            },
            {
                "type": "centered",
                "text": "3. 2. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "බහුස්සුතසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "302. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති. කතමෙහි පඤ්චහි: සද්ධො ච හොති, හිරිමා ච හොති, ඔත්තාපී ච හොති, බහුස්සුතො ච හොති, පඤ්ඤවා ච හොති. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජතීති."
            },
            {
                "type": "centered",
                "text": "3. 2. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආරද්ධවිරියසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "303. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති. කතමෙහි පඤ්චහි: සද්ධො ච හොති, හිරිමා ච හොති, ඔත්තාපී ච හොති, ආරද්ධවිරියො ච හොති, පඤ්ඤවා ච හොති. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජතීති."
            },
            {
                "type": "centered",
                "text": "3. 2. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "උපට්ඨිතසතිසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "304. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති. කතමෙහි පඤ්චහි: සද්ධො ච හොති, හිරිමා ච හොති, ඔත්තාපී ච හොති, උපට්ඨිතසති ච හොති, පඤ්ඤවා ච හොති. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජතීති."
            },
            {
                "type": "centered",
                "text": "3. 2. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පඤ්චසීලසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "305. පඤ්චහි භික්ඛවෙ, ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති. කතමෙහි පඤ්චහි: පාණාතිපාතා පටිවිරතො ච හොති, අදින්නාදානා පටිවිරතො ච හොති, කාමෙසු මිච්ඡාචාරා පටිවිරතො ච හොති, මුසාවාදා පටිවිරතො ච හොති, සුරාමෙරයමජ්ඣපමාදට්ඨානා පටිවිරතො ච හොති. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජතීති."
            },
            {
                "type": "centered",
                "text": "අනුරුද්ධවග්ගො දුතියො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "අනුරුද්ධො අක්කොධනො අනුපනාහී අනිස්සුකී\nඅමච්ඡරී අනතිචාරී සීලවා ච බහුස්සුතො\nවීරියං සති පඤ්චසීලො ච සුක්කපක්ඛෙ පකාසිතාති.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "466"
            },
            {
                "type": "heading",
                "text": "3. බලවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "3. 3. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුද්ධසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "306. පඤ්චිමානි භික්ඛවෙ, මාතුගාමස්ස බලානි. කතමානි පඤ්ච: රූපබලං, භොගබලං, ඤාතිබලං, පුත්තබලං, සීලබලං. ඉමානි ඛො භික්ඛවෙ පඤ්ච මාතුගාමස්ස බලානීති."
            },
            {
                "type": "centered",
                "text": "3. 3. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "විසාරදසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "307. පඤ්චිමානි භික්ඛවෙ, මාතුගාමස්ස බලානි. කතමානි පඤ්ච: රූපබලං, භොගබලං, ඤාතිබලං, පුත්තබලං, සීලබලං. ඉමානි ඛො භික්ඛවෙ, පඤ්ච මාතුගාමස්ස බලානි. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි බලෙහි සමන්නාගතො මාතුගාමො විසාරදො අගාරං අජ්ඣාවසතීති."
            },
            {
                "type": "centered",
                "text": "3. 3. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පසය්හසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "308. පඤ්චිමානි භික්ඛවෙ, මාතුගාමස්ස බලානි. කතමානි පඤ්ච: රූපබලං, භොගබලං, ඤාතිබලං, පුත්තබලං, සීලබලං. ඉමානි ඛො භික්ඛවෙ, පඤ්ච මාතුගාමස්ස බලානි. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි බලෙහි සමන්නාගතො මාතුගාමො සාමිකං පසය්හ අගාරං අජ්ඣාවසතීති."
            },
            {
                "type": "centered",
                "text": "3. 3. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අභිභුය්හසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "309. පඤ්චිමානි භික්ඛවෙ, මාතුගාමස්ස බලානි. කතමානි පඤ්ච: රූපබලං, භොගබලං, ඤාතිබලං, පුත්තබලං, සීලබලං. ඉමානි ඛො භික්ඛවෙ, පඤ්ච මාතුගාමස්ස බලානි. ඉමෙහි ඛො භික්ඛවෙ, පඤ්චහි බලෙහි සමන්නාගතො මාතුගාමො සාමිකං අභිභුය්ය වත්තති."
            },
            {
                "type": "paragraph",
                "text": "එකෙන ච ඛො භික්ඛවෙ බලෙන සමන්නාගතො පුරිසො මාතුගාමං අභිභුය්ය වත්තති. කතමෙන එකෙන: ඉස්සරියබලෙන, ඉස්සරියබලෙන අභිභූතං භික්ඛවෙ මාතුගාමං නෙව රූපබලං තායති, න භොගබලං{1 ගොත්තබලං - සී 1, 2.} තායති. න ඤාතිබලං තායති. න පුත්තබලං තායති. න සීලබලං තායතීති."
            },
            {
                "type": "page-break",
                "text": "468"
            },
            {
                "type": "centered",
                "text": "3. 3. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අඞ්ගසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "310. පඤ්චිමානි භික්ඛවෙ, මාතුගාමස්ස බලානි. කතමානි පඤ්ච: රූපබලං, භොගබලං, ඤාතිබලං, පුත්තබලං, සීලබලං. රූපබලෙන ච භික්ඛවෙ, මාතුගාමො සමන්නාගතො හොති, න ච භොගබලෙන, එවං සො තෙන අඞ්ගෙන අපරිපූරො හොති. යතො ච ඛො භික්ඛවෙ, මාතුගාමො රූපබලෙන ච සමන්නාගතො හොති භොගබලෙන ච, එවං සො තෙන අඞ්ගෙන පරිපූරො හොති. රූපබලෙන ච භික්ඛවෙ, මාතුගාමො සමන්නාගතො හොති භොගබලෙන ච, න ච ඤාතිබලෙන, එවං සො තෙන අඞ්ගෙන අපරිපූරො හොති. යතො ච ඛො භික්ඛවෙ, මාතුගාමො රූපබලෙන ච සමන්නාගතො හොති, භොගබලෙන ච ඤාතිබලෙන ච, එවං සො තෙන අඞ්ගෙන පරිපූරො හොති."
            },
            {
                "type": "paragraph",
                "text": "රූපබලෙන ච භික්ඛවෙ, මාතුගාමො සමන්නාගතො හොති, භොගබලෙන ච, ඤාතිබලෙන ච, න ච පුත්තබලෙන, එවං සො තෙන අඞ්ගෙන අපරිපූරො හොති. යතො ච ඛො භික්ඛවෙ, මාතුගාමො රූපබලෙන ච සමන්නාගතො හොති, භොගබලෙන ච, ඤාතිබලෙන ච, පුත්තබලෙන ච. එවං සො තෙන අඞ්ගෙන පරිපූරො හොති. රූපබලෙන ච භික්ඛවෙ, මාතුගාමො සමන්නාගතො හොති භොගබලෙන ච ඤාතිබලෙන ච පුත්තබලෙන ච, න ච සීලබලෙන. එවං සො තෙන අඞ්ගෙන අපරිපූරො හොති. යතො ච ඛො භික්ඛවෙ, මාතුගාමො රූපබලෙන ච සමන්නාගතො හොති භොගබලෙන ච ඤාතිබලෙන ච පුත්තබලෙන ච සීලබලෙන ච, එවං සො තෙන අඞ්ගෙන පරිපූරො හොති. ඉමානි ඛො භික්ඛවෙ, පඤ්ච මාතුගාමස්ස බලානීති."
            },
            {
                "type": "centered",
                "text": "3. 3. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නාසිතබ්බසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "311. පඤ්චිමානි භික්ඛවෙ, මාතුගාමස්ස බලානි. කතමානි පඤ්ච: රූපබලං භොගබලං ඤාතිබලං පුත්තබලං සීලබලං. රූප බලෙන ච භික්ඛවෙ, මාතුගාමො සමන්නාගතො හොති, න ච සීලබලෙන, නාසෙන්තෙව නං කුලෙ න වාසෙන්ති. රූපබලෙන ච භික්ඛවෙ, මාතුගාමො සමන්නාගතො හොති භොගබලෙන ච, න ච සීලබලෙන, නාසෙන්තෙව නං කුලෙ න වාසෙන්ති. රූපබලෙන ච භික්ඛවෙ, මාතුගාමො සමන්නාගතො හොති භොගබලෙන ච ඤාතිබලෙන ච, න ච සීලබලෙන, නාසෙන්තෙව නං කුලෙ න වාසෙන්ති. රූපබලෙන ච භික්ඛවෙ, මාතුගාමො සමන්නාගතො හොති භොගබලෙන ච ඤාතිබලෙන ච පුත්තබලෙන ච, න ච සීලබලෙන, නාසෙන්තෙව නං කුලෙ න වාසෙන්ති."
            },
            {
                "type": "page-break",
                "text": "470"
            },
            {
                "type": "paragraph",
                "text": "යතො ච ඛො භික්ඛවෙ, මාතුගාමො රූපබලෙන සමන්නාගතො හොති, භොගබලෙන ච ඤාතිබලෙන ච පුත්තබලෙන ච සීල බලෙන ච. වාසෙන්තෙව නං කුලෙ න නාසෙන්ති. සීලබලෙන ච භික්ඛවෙ, මාතුගාමො සමන්නාගතො හොති න ච රූපබලෙන, වාසෙන්තෙව නං කුලෙ න නාසෙන්ති. සීලබලෙන ච භික්ඛවෙ මාතුගාමො සමන්නාගතො හොති න ච භොග බලෙන, වාසෙන්තෙව න කුලෙ න නාසෙන්ති. සීලබලෙන ච භික්ඛවෙ මාතුගාමො සමන්නාගතො හොති න ච ඤාතිබලෙන වාසෙන්තෙව නං කුලෙ න නාසෙන්ති."
            },
            {
                "type": "paragraph",
                "text": "සීලබලෙන ච භික්ඛවෙ මාතුගාමො සමන්නාගතො හොති න ච පුත්තබලෙන, වාසෙන්තෙව නං කුලෙ න නාසෙන්ති. ඉමානි ඛො භික්ඛවෙ පඤ්ච මාතුගාමස්ස බලානීති."
            },
            {
                "type": "centered",
                "text": "3. 3. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "හෙතුසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "312. පඤ්චිමානි භික්ඛවෙ, මාතුගාමස්ස බලානි. කතමානි පඤ්ච: රූපබලං, භොගබලං, ඤාතිබලං, පුත්තබලං, සීලබලං. න භික්ඛවෙ, මාතුගාමො රූපබලහෙතු වා භොගබලහෙතු වා ඤාතිබලහෙතු වා පුත්තබලහෙතු වා කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති. සීලබලහෙතු ඛො භික්ඛවෙ මාතුගාමො කායස්ස භෙදා පරම්මරණා සුගතිං සග්ගං ලොකං උපපජ්ජති. ඉමානි ඛො භික්ඛවෙ පඤ්ච මාතුගාමස්ස බලානීති."
            },
            {
                "type": "centered",
                "text": "3. 3. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඨානසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "313. පඤ්චිමානි භික්ඛවෙ ඨානානි දුල්ලභානි අකතපුඤ්ඤෙන මාතුගාමෙන. කතමානි පඤ්ච: පතිරූපෙකුලෙ ජායෙය්යන්ති ඉදං භික්ඛවෙ පඨමං ඨානං දුල්ලභං අකතපුඤ්ඤෙන මාතුගාමෙන. පතිරූපකුලෙ ජායිත්වා පතිරූපං කුලං ගච්ඡෙය්යන්ති ඉදං භික්ඛවෙ දුතියං ඨානං. දුල්ලභං අකතපුඤ්ඤෙන මාතුගාමෙන. පතිරූපකුලෙ ජායිත්වා පතිරූපං කුලං ගන්ත්වා අසපත්ති අගාරං අජ්ඣාවසෙය්යන්ති ඉදං භික්ඛවෙ තතියං ඨානං දුල්ලභං අකතපුඤ්ඤෙන මාතුගාමෙන. පතිරූපකුලෙ ජායිත්වා පතිරූපං කුලං ගන්ත්වා අසපත්ති අගාරං අජ්ඣාවසන්තී පුත්තවතී අස්සන්ති ඉදං භික්ඛවෙ චතුත්ථං ඨානං දුල්ලභං අකතපුඤ්ඤෙන මාතුගාමෙන. පතිරූපකුලෙ ජායිත්වා පතිරූපං කුලං ගන්ත්වා අසපත්ති අගාරං අජ්ඣාවසන්තී පුත්තවතී සමානා සාමිකං අභිභුය්ය වත්තෙය්යන්ති. ඉදං භික්ඛවෙ, පඤ්චමං ඨානං දුල්ලභං අකතපුඤ්ඤෙන මාතුගාමෙන. ඉමානි ඛො භික්ඛවෙ පඤ්ච ඨානානි දුල්ලභානි අකතපුඤ්ඤෙන මාතුගාමෙන."
            },
            {
                "type": "page-break",
                "text": "472"
            },
            {
                "type": "paragraph",
                "text": "පඤ්චිමානි භික්ඛවෙ ඨානානි සුලභානි කතපුඤ්ඤෙන මාතුගාමෙන. කතමානි පඤ්ච: පතිරූපකුලෙ ජායෙය්යන්ති ඉදං භික්ඛවෙ පඨමං ඨානං සුලභං කතපුඤ්ඤෙන මාතුගාමෙන. පතිරූපකුලෙ ජායිත්වා පතිරූපං කුලං ගච්ඡෙය්යන්ති. ඉදං භික්ඛවෙ දුතියං ඨානං සුලභං කතපුඤ්ඤෙන මාතුගාමෙන. පතිරූපකුලෙ ජායිත්වා පතිරූපං කුලං ගන්ත්වා අසපත්ති අගාරං අජ්ඣාවසෙය්යන්ති. ඉදං භික්ඛවෙ තතියං ඨානං සුලභං කතපුඤ්ඤෙන මාතුගාමෙන. පතිරූපකුලෙ ජායිත්වා පතිරූපං කුලං ගන්ත්වා අසපත්ති අගාරං අජ්ඣාවසන්තී පුත්තවතී අස්සන්ති. ඉදං භික්ඛවෙ චතුත්ථං ඨානං සුලභං කතපුඤ්ඤෙන මාතුගාමෙන. පතිරූපකුලෙ ජායිත්වා පතිරූපං කුලං ගන්ත්වා අසපත්ති අගාරං අජ්ඣාවසන්තී පුත්තවතී සමානා සාමිකං අභිභුය්ය වත්තෙය්යන්ති. ඉදං භික්ඛවෙ පඤ්චමං ඨානං සුලභං කතපුඤ්ඤෙන මාතුගාමෙන. ඉමානි ඛො භික්ඛවෙ පඤ්චඨානානි සුලභානි කතපුඤ්ඤෙන මාතුගාමෙනාති."
            },
            {
                "type": "centered",
                "text": "3. 3. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "විසාරදවාසසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "314. පඤ්චහි භික්ඛවෙ ධම්මෙහි සමන්නාගතො මාතුගාමො විසාරදො අගාරං අජ්ඣාවසති. කතමෙහි පඤ්චහි: පාණාතිපාතා පටිවිරතො ච හොති, අදින්නාදානා පටිවිරතො ච හොති, කාමෙසු මිච්ඡාචාරා පටිවිරතො ච හොති. මුසාවාදා පටිවිරතො ච හොති, සුරාමෙරයමජ්ජපමාදට්ඨානා පටිවිරතො ච හොති: ඉමෙහි ඛො භික්ඛවෙ පඤ්චහි ධම්මෙහි සමන්නාගතො මාතුගාමො විසාරදො අගාරං අජ්ඣාවසතීති."
            },
            {
                "type": "centered",
                "text": "3. 3. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "වඩ්ඪීසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "315. පඤ්චහි භික්ඛවෙ වඩ්ඪීහි වඩ්ඪමානා අරියසාවිකා අරියාය වඩ්ඪියා වඩ්ඪති. සාරාදායිනී ච හොති වරාදායිනී ච කායස්ස. කතමාහි{1 කතමෙහි - මඡසං, ස්යා.} පඤ්චහි: සද්ධාය වඩ්ඪති, සීලෙන වඩ්ඪති, සුතෙන වඩ්ඪති, චාගෙන වඩ්ඪති, පඤ්ඤාය වඩ්ඪති. ඉමාහි{2 ඉමෙහි - මඡසං, ස්යා.} ඛො භික්ඛවෙ පඤ්චහි වඩ්ඪීහි වඩ්ඪමානා අරියසාවකා අරියාය වඩ්ඪියා වඩ්ඪති, සාරාදායිනී ච හොති, වරාදායිනී ච කායස්සාති."
            },
            {
                "type": "gatha",
                "text": "සද්ධාය සීලෙන ච යාධ වඩ්ඪති\nපඤ්ඤාය චාගෙන සුතෙන චූභයං\nසා තාදිසී සීලවතී උපාසිකා\nආදියති{3 ආදියති - මඡසං, ස්යා.} සාරං ඉධෙව අත්තනොති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "බලවග්ගො තතියො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "සුද්ධා විසාරදා පසය්හා අභිභුය්ය අඞ්ගෙන පඤ්චමං\nනාසයිතබ්බං හෙතුට්ඨානං විසාරදා වඩ්ඪිනා දසාති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "මාතුගාමසංයුත්තං සමත්තං.",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ],
        "pages": {
            "450": {
                "pageNum": 450,
                "footnotesCount": 0
            },
            "452": {
                "pageNum": 452,
                "footnotesCount": 2
            },
            "454": {
                "pageNum": 454,
                "footnotesCount": 0
            },
            "456": {
                "pageNum": 456,
                "footnotesCount": 0
            },
            "458": {
                "pageNum": 458,
                "footnotesCount": 0
            },
            "460": {
                "pageNum": 460,
                "footnotesCount": 1
            },
            "462": {
                "pageNum": 462,
                "footnotesCount": 0
            },
            "464": {
                "pageNum": 464,
                "footnotesCount": 0
            },
            "466": {
                "pageNum": 466,
                "footnotesCount": 1
            },
            "468": {
                "pageNum": 468,
                "footnotesCount": 0
            },
            "470": {
                "pageNum": 470,
                "footnotesCount": 0
            },
            "472": {
                "pageNum": 472,
                "footnotesCount": 3
            }
        }
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "451"
            },
            {
                "text": "3. මාතුගාම සංයුක්තය",
                "type": "heading",
                "level": 3
            },
            {
                "text": "1. මාතුගාම වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "3. 1. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මාතුගාම සූත්‍රය",
                "level": 1
            },
            {
                "text": "280. මහණෙනි, අඞ්ගපසෙකින් යුත් මාගම පුරුෂයාට ඒකාන්තයෙන් අමනාපවේ. කවර පසෙකින් ද යත්: නො ද රූමත් වේ, නො ද ධනවත් වේ, නො ද සිල්වත් වෙයි, අලසත් වේ, ඔහුට දාව ප්‍රජාවත් නො ලබයි. මහණෙනි, මේ අඞ්ගපසින් යුත් මාගම පුරුෂයාට ඒකාන්තයෙන් අමනාප වේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, අඞ්ගපසෙකින් යුත් මාගම පුරුෂයාට ඒකාන්තයෙන් මනාප වෙයි. කවර පසෙකින් ද යත්: රූමත් ද වෙයි, ධනවත් ද වෙයි, සිල්වත් ද වෙයි, අනලස් ව දක්ෂ ද වේ, ඔහුට දාව ප්‍රජාවත් ලබයි. මහණෙනි, මේ අඞ්ග පසින් යුත් මාගම පුරුෂයාට ඒකාන්තයෙන් මනාප වේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 1. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පුරිස සූත්‍රය",
                "level": "1"
            },
            {
                "text": "281. මහණෙනි, අඞ්ගපසෙකින් යුත් පුරුෂ තෙමේ මාගමට ඒකාන්තයෙන් අමනාප වේ. කවර පසෙකින් ද යත්: නො ද රූමත් වෙයි, නො ද භෝගවත් වෙයි, නො ද සිල්වත් වෙයි, අලසත් වෙයි, ඔහුට (දාව) ප්‍රජාව නො ද ලැබයි. මහණෙනි, මේ අඞ්ග පසින් යුත් පුරුෂ තෙමේ මාගමට ඒකාන්තයෙන් අමනාප වේ.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, අඞ්ගපසෙකින් යුත් පුරුෂ තෙමේ මාගමට ඒකාන්තයෙන් මනාප වේ. කවර පසෙකින් ද යත්: රූමත් ද වෙයි, භෝගවත් ද වෙයි, සිල්වත් ද වෙයි, අනලස් ව දක්ෂ ද වෙයි, ඔහුට (දාව) ප්‍රජාව ද ලැබෙයි. මහණෙනි, මේ පස්අඟින් යුත් පුරුෂ තෙමේ මාගමට ඒකාන්තයෙන් මනාප වේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 1. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආවෙණිකදුක්‌ඛ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "282. මහණෙනි, පුරුෂයන් හැර මාගම යම් දුක් අනුභව කෙරේ නම් මාගමට උරුම වූ (එබඳු) මේ දුක් පසෙකි. කවර පසෙක් ද යත්: මහණෙනි, මෙහි මාගම තුරුණු වූවා ම සැමිකුලයට යෙයි. නෑයන්ගෙන් වෙන් වෙයි. මහණෙනි, පුරුෂයන් හැර මාගම යම් දුකක් විදී නම් මාගමට උරුම වූ මේ පළමුවන දුක යි. මහණෙනි, නැවත අනෙකක් ද කියමි. මාගම ඔසප් ඇත්තී වෙයි. මහණෙනි, පුරුෂයන් හැර මාගම යම් දුකක් විදී නම් මාගමට උරුම වූ මේ දෙවෙනි දුක යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "453"
            },
            {
                "text": "මහණෙනි, නැවත අනෙකක් ද කියමි. මාගම ගැබිනි වෙයි. මහණෙනි, පුරුෂයන් හැර මාගම යම් දුකක් විඳී නම් මාගමට උරුම වූ මේ තෙවන දුක යි. මහණෙනි, නැවත අනෙකක් ද කියමි. මාගම (දරුවන්) වදයි. මහණෙනි, පුරුෂයන් හැර මාගම යම් දුකක් විඳී නම් මාගමට උරුම වූ මේ සිවුවන දුක යි. මහණෙනි, නැවත අනෙකක් ද කියමි. මාගම පුරුෂයාගේ පරිචරියාවට එළඹෙයි. මහණෙනි, පුරුෂයන් හැර මාගම යම් දුකක් විඳී නම් මාගමට උරුම වූ මේ පස්වන දුක යි. මහණෙනි, පුරුෂයන් හැර මාගම යම් දුක් විඳී නම් මාගමට උරුම වූ දුක් පස මොහු යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 1. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තීහි ධම්‌මෙහි සූත්‍රය",
                "level": "1"
            },
            {
                "text": "283. මහණෙනි, දහම් තුනකින් යුත් මාගම බෙහෙවින් කාබුන් මරණින් මතු සැපයෙන් පහ වූ නපුරු ගති ඇති විවස ව පතිත වන නිරයට පැමිණෙයි. කවර තුනකින් ද යත්: මහණෙනි, මෙහි මාගම පෙරවරු මසුරුමල නැග සිටි සිතින් යුතු ව ගෙහි වෙසෙයි, මද්දහන තරහ නැගි සිතින් යුතු ව ගෙහි වෙසෙයි, සවස කාම රාගය නැගි සිතින් යුතු ව ගෙහි වෙසෙයි. මහණෙනි, මේ තුන් දහමින් යුත් මාගම බෙහෙවින් කාබුන් මරණින් මතු සැපයෙන් පහ වූ නපුරු ගති ඇති විවසව පතිත වන නිරයට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 1. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනුරුද්ධ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "284. එකල්හි ආයුෂ්මත් අනුරුද්ධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ ... එකත්පස් ව හුන් ආයුෂ්මත් අනුරුද්ධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැලකළහ:",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, මෙහි මම කාබුන් මරණින් මතු සැපයෙන් පහ වූ නපුරු ගති ඇති විවස ව පතිත වන නිරයට පැමිණෙන මාගමක මිනිසැස ඉක්මවා පැවති පිරිසිදු දිවැසින් දකිමි. වහන්ස, කෙතෙක් දහමින් යුතු මාගම කාබුන් මරණින් මතු සැපයෙන් පහ වූ නපුරු ගති ඇති විවස ව පතිත වන නිරයට පැමිණේ දැ?යි.",
                "type": "paragraph"
            },
            {
                "text": "අනුරුද්ධ, දහම් පසෙකින් යුතු මාගම කාබුන් මරණින් මතු සැපයෙන් පහ වූ නපුරු ගති ඇති විවස ව පතිත වන නිරයට පැමිණෙයි. කවර පසෙකින් ද යත්: සැදැහැ රහිත වෙයි, ලජ්ජා රහිත වෙයි, බිය රහිත වෙයි, කිපෙනසුලු වෙයි, නුවණ රහිත වෙයි. අනුරුද්ධ, මේ දහම් පසින් යුතු මාගම කාබුන් මරණින් මතු සැපයෙන් පහ වූ නපුරු ගති ඇති විවස ව පතිත වන නිරයට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "455"
            },
            {
                "type": "centered",
                "text": "3. 1. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කොධන සූත්‍රය",
                "level": "1"
            },
            {
                "text": "285. මහණෙනි, දහම්පසෙකින් යුතු මාගම කාබුන් මරණින් මතු සැපයෙන් පහ වූ නපුරු ගති ඇති විවස ව පතිත වන නිරයට පැමිණෙයි. කවර පසෙකින් ද යත්: සැදැහැ රහිත වෙයි, ලජ්ජා රහිත වෙයි, බිය රහිත වෙයි, කිපෙනසුලු වෙයි, නුවණ රහිත වෙයි. මහණෙනි, මේ පස්දහමින් යුතු මාගම කාබුන් මරණින් මතු සැපයෙන් පහ වූ නපුරු ගති ඇති විවස ව පතිත වන නිරයට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 1. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "උපනහී සූත්‍රය",
                "level": "1"
            },
            {
                "text": "286. මහණෙනි, දහම්පසෙකින් යුතු මාගම කාබුන් මරණින් මතු සැපයෙන් පහ වූ නපුරු ගති ඇති විවස ව පතිත වන නිරයට පැමිණෙයි. කවර පසෙකින් ද යත්: සැදැහැ රහිත වෙයි, ලජ්ජා රහිත වෙයි, බිය රහිත වෙයි, බද්ධවෛර සහිත වෙයි, නුවණ රහිත වෙයි. මහණෙනි, මේ පස්දහමින් යුතු මාගම කාබුන් මරණින් මතු සැපයෙන් පහ වූ නපුරු ගති ඇති විවස ව පතිත වන නිරයට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 1. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඉස්සුකී සූත්‍රය",
                "level": "1"
            },
            {
                "text": "287. මහණෙනි, දහම් පසෙකින් යුතු මාගම කාබුන් මරණින් මතු සැපයෙන් පහ වූ නපුරු ගති ඇති විවස ව පතිත වන නිරයට පැමිණෙයි. කවර පසෙකින් ද යත්: සැදැහැ රහිත වෙයි, ලජ්ජා රහිත වෙයි, බිය රහිත වෙයි, ඊෂ්‍යර්‍ා සහිත වෙයි, නුවණ රහිත වෙයි. මහණෙනි, මේ පස්දහමින් යුතු මාගම කාබුන් මරණින් මතු සැපයෙන් පහ වූ නපුරු ගති ඇති විවස ව පතිත වන නිරයට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 1. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මච්ඡරී සූත්‍රය",
                "level": "1"
            },
            {
                "text": "288. මහණෙනි, දහම් පසෙකින් යුතු මාගම කාබුන් මරණින් මතු සැපයෙන් පහ වූ නපුරු ගති ඇති විවස ව පතිත වන නිරයට පැමිණෙයි. කවර පසෙකින් ද යත්: සැදැහැ රහිත වෙයි, ලජ්ජා රහිත වෙයි, බිය රහිත වෙයි, මසුරු වෙයි, නුවණ රහිත වෙයි. මහණෙනි, මේ පස්දහමින් යුතු මාගම කාබුන් මරණින් මතු සැපයෙන් පහ වූ නපුරුගති ඇති විවස ව පතිත වන නිරයට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "457"
            },
            {
                "type": "centered",
                "text": "3. 1. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අතිචාරී සූත්‍රය",
                "level": "1"
            },
            {
                "text": "289. මහණෙනි, දහම්පසෙකින් යුතු මාගම කාබුන් මරණින් මතු සැපයෙන් පහ වූ නපුරු ගති ඇති විවස ව පතිත වන නිරයට පැමිණෙයි. කවර පසෙකින් ද යත්: සැදැහැ රහිත වෙයි, ලජ්ජා රහිත වෙයි, බිය රහිත වෙයි, (සැමියා) ඉක්මවා හැසිරෙනසුලු වෙයි, නුවණ රහිත වෙයි. මහණෙනි, මේ දහම් පසින් යුතු මාගම කාබුන් මරණින් මතු සැපයෙන් පහ වූ නපුරු ගති ඇති විවස ව පතිත වන නිරයට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 1. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුස්‌සීල සූත්‍රය",
                "level": "1"
            },
            {
                "text": "290. මහණෙනි, දහම්පසෙකින් යුතු මාගම කාබුන් මරණින් මතු අපාය දුග්ගති විනිපාත නිරයට පැමිණෙයි. කවර පසෙකින් ද යත්: සැදැහැ රහිත වෙයි, ලජ්ජා රහිත වෙයි, බිය රහිත වෙයි, දුසිල් වෙයි, නුවණ රහිත වෙයි. මහණෙනි, මේ පස්දහමින් යුතු මාගම කාබුන් මරණින් මතු අපාය දුග්ගති විනිපාත නිරයට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 1. 12.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අප්‌පස්‌සුත සූත්‍රය",
                "level": "1"
            },
            {
                "text": "291. මහණෙනි, දහම්පසෙකින් යුතු මාගම කාබුන් මරණින් මතු අපාය දුග්ගති විනිපාත නිරයට පැමිණෙයි. කවර පසෙකින් ද යත්: සැදැහැ රහිත වෙයි, ලජ්ජා රහිත වෙයි, බිය රහිත වෙයි, ඇසූ පිරූ තැන් රහිත වෙයි, නුවණ රහිත වෙයි. මහණෙනි, මේ පස්දහමින් යුතු මාගම කාබුන් මරණින් මතු අපාය දුග්ගති විනිපාත නිරයට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 1. 13.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "කුසීත සූත්‍රය",
                "level": "1"
            },
            {
                "text": "292. මහණෙනි, දහම්පසෙකින් යුතු මාගම කාබුන් මරණින් මතු අපාය දුග්ගති විනිපාත නිරයට පැමිණෙයි. කවර පසෙකින් ද යත්: සැදැහැ රහිත වෙයි, ලජ්ජා රහිත වෙයි, බිය රහිත වෙයි, මැලි වෙයි, නුවණ රහිත වෙයි. මහණෙනි, මේ පස්දහමින් යුතු මාගම කාබුන් මරණින් මතු අපාය දුග්ගති විනිපාත නිරයට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "459"
            },
            {
                "type": "centered",
                "text": "3. 1. 14.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "මුට්‌ඨස්‌සති සූත්‍රය",
                "level": "1"
            },
            {
                "text": "293. මහණෙනි, දහම් පසෙකින් යුතු මාගම කාබුන් මරණින් මතු අපාය දුග්ගති විනිපාතවූ නිරයට පැමිණෙයි. කවර පසෙකින් ද යත්: සැදැහැ රහිත වෙයි. ලජ්ජා රහිත වෙයි. බිය රහිත වෙයි. මුළාසිහි ඇති වෙයි. නුවණ රහිත වෙයි. මහණෙනි, මේ පස්දහමින් යුතු මාගම කාබුන් මරණින් මතු අපාය දුග්ගති විනිපාත නිරයට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 1. 15.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පඤ්‌චවෙර සූත්‍රය",
                "level": "1"
            },
            {
                "text": "294. මහණෙනි, දහම් පසෙකින් යුතු මාගම කාබුන් මරණින් මතු අපාය දුග්ගති විනිපාතවූ නිරයට පැමිණෙයි. කවර පසෙකින් ද යත්: පණිවායෙන් යුක්ත වෙයි. අයිනාදනින් යුක්ත වෙයි. කාමයෙහි වරදවා හැසිරෙන්නී වෙයි. මුසා බණන්නී වෙයි. රහමෙර පානය කරන්නී වෙයි. මහණෙනි, මේ පස් දහමෙන් යුතු මාගම කාබුන් මරණින් මතු අපාය දුග්ගති විනිපාතවූ නිරයට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "text": "පළමුවැනි මාතුගාමවර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍ර නාමාවලිය:**",
                "type": "unindented"
            },
            {
                "text": "මාතුගාම, පුරිස, ආවෙණික, තීහිධම්මේහි, කොධන, උපනාහී, ඉස්සුකී, මච්ඡරී, අතිචාරී, අනුරුද්ධ, දුස්සීල, අප්පස්සුත, කුසීත, මුට්ඨස්සති, පඤ්චවෙර ය යි සූත්‍ර පසළොසකි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "461"
            },
            {
                "text": "2. අනුරුද්ධ වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "3. 2. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනුරුද්ධ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "295. එකල්හි ආයුෂ්මත් අනුරුද්ධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. ... එකත්පස්ව හුන් ආයුෂ්මත් අනුරුද්ධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැළකළ හ.",
                "type": "paragraph"
            },
            {
                "text": "වහන්ස, මෙහි මම කාබුන් මරණින් මතු සොභන ගති ඇති සග ලොවට පැමිණෙන මාගමක මිනිසැස ඉක්මවා පැවැති පිරිසිදු දිවැසින් දකිමි. වහන්ස කෙතෙක් දහමින් යුතු මාගම කාබුන් මරණින් මතු සොභන ගති ඇති සගලොවට පැමිණේ දැ යි.",
                "type": "paragraph"
            },
            {
                "text": "අනුරුද්ධ, දහම් පසෙකින් යුතු මාගම කාබුන් මරණින් මතු යහපත් ගති ඇති සගලොවට පැමිණෙ යි. කවර පසකින් ද යත්: සැදැහැ ඇති වෙයි. ලජ්ජා ඇති වෙයි. බිය ඇති වෙයි. නො කිපෙනසුලු වෙයි. නුවණැති වෙයි. අනුරුද්ධ, මේ පස් දහමින් යුතු මාගම කාබුන් මරණින් මතු යහපත් ගති ඇති සගලොවට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 2. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අක්‌කොධන සූත්‍රය",
                "level": "1"
            },
            {
                "text": "296. මහණෙනි දහම් පසෙකින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණෙයි. කවර පසෙකින් ද යත්: සැදැහැ ඇති වෙයි. ලජ්ජා ඇති වෙයි. බිය ඇති වෙයි. නො කිපෙනසුලු වෙයි. නුවණැති වෙයි. මහණෙනි මේ පස්දහමින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 2. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනුපනාහී සූත්‍රය",
                "level": "1"
            },
            {
                "text": "297. මහණෙනි, දහම් පසෙකින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණෙ යි. කවර පසෙකින් ද යත්: සැදැහැ ඇති වෙයි. ලජ්ජා ඇති වෙයි. බිය ඇති වෙයි. බැඳි වෙර නැති වෙයි. නුවණැති වෙයි. මහණෙනි මේ පස්දහමින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "463"
            },
            {
                "type": "centered",
                "text": "3. 2. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනිස්‌සුකී සූත්‍රය",
                "level": "1"
            },
            {
                "text": "298. මහණෙනි, දහම් පසෙකින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණෙයි. කවර පසෙකින් ද යත්: සැදැහැ ඇති වෙයි. හිරි ඇති වෙයි. ඔතප් ඇති වෙයි. ඊර්ෂ්‍යා රහිත වෙයි. පැනවත් වෙයි. මහණෙනි මේ පස්දහමින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 2. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආමච්‌ඡරී සූත්‍රය",
                "level": "1"
            },
            {
                "text": "299. මහණෙනි, දහම් පසෙකින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණෙ යි. කවර පසෙකින් ද යත්: සැදැහැ ඇති වෙයි. හිරි ඇති වෙයි. ඔතප් ඇති වෙයි. නො මසුරු වෙයි. පැනවත් වෙයි. මහණෙනි මේ පස්දහමින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 2. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අනතිචාරී සූත්‍රය",
                "level": "1"
            },
            {
                "text": "300. මහණෙනි, දහම් පසෙකින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණෙ යි. කවර පසෙකින් ද යත්: සැදැහැ ඇති වෙයි. හිරි ඇති වෙයි. ඔතප් ඇති වෙයි. (සැමියා) ඉක්ම නො හැසිරෙන්නී වෙයි. පැනවත් වෙයි. මහණෙනි, මේ පස්දහමින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 2. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සීලවන්ත සූත්‍රය",
                "level": "1"
            },
            {
                "text": "301. මහණෙනි, දහම් පසෙකින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණෙයි. කවර පසෙකින් ද යත්: සැදැහැ ඇති වෙයි. හිරි ඇති වෙයි. ඔතප් ඇති වෙයි. සිල්වත් වෙයි. පැනවත් වෙයි. මහණෙනි, මේ පස්දහමින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "465"
            },
            {
                "type": "centered",
                "text": "3. 2. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "බහුස්‌සුත සූත්‍රය",
                "level": "1"
            },
            {
                "text": "302. මහණෙනි, දහම් පසෙකින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණෙයි. කවර පසෙකින් ද යත්: සැදැහැ ඇති වෙයි. හිරි ඇති වෙයි. ඔතප් ඇති වෙයි. බොහෝ ඇසු පිරූ තැන් ඇති වෙයි, පැනවත් වෙයි. මහණෙනි මේ පස්දහමින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 2. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ආරද්‌ධවීරිය සූත්‍රය",
                "level": "1"
            },
            {
                "text": "303. මහණෙනි, දහම්පසෙකින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණෙයි. කවර පසෙකින් ද යත්: සැදැහැ ඇති වෙයි. හිරි ඇති වෙයි. ඔතප් ඇති වෙයි. ඇරඹු වෙර ඇති වෙයි. පැනවත් වෙයි. මහණෙනි මේ පස්දහමින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 2. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "උපට්‌ඨිතස්‌සති සූත්‍රය",
                "level": "1"
            },
            {
                "text": "304. මහණෙනි, දහම් පසෙකින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණෙයි. කවර පසෙකින් ද යත්: සැදැහැ ඇති වෙයි. හිරි ඇති වෙයි. ඔතප් ඇති වෙයි. එළඹ සිටි සිහි ඇති වෙයි. පැනවත් වෙයි. මහණෙනි මේ පස්දහමින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 2. 11.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පඤ්‌චසීල සූත්‍රය",
                "level": "1"
            },
            {
                "text": "305. මහණෙනි, මේ දහම් පසෙකින් යුතු මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණෙයි. කවර පසෙකින් ද යත්: පණිවායෙන් වැළකුණේ වෙයි. අයිනාදනින් වැළකුණේ වෙයි. කාමයෙහි වරදවා හැසිරීමෙන් වැළකුණේ වෙයි. මහණෙනි, මේ පස්දහමින් යුත් මාගම කාබුන් මරණින් මතු සුගති වූ සගලොවට පැමිණේ යි.",
                "type": "paragraph"
            },
            {
                "text": "දෙවැනි අනුරුද්ධ වර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රනාමාවලිය:**",
                "type": "unindented"
            },
            {
                "text": "අනුරුද්ධ, අක්කොධන, අනුපනාහී, අනිස්සුකී, අමච්ඡරී, අනතිවාරී, සීලවන්ත, බහුස්සුත, ආරද්ධවීරිය, උපට්ඨීතසති, පඤ්චසීලය යි. ශුකලපක්ෂයෙහි සූත්‍ර එකොළොසෙක් පවසන ලදී.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "467"
            },
            {
                "text": "3. බල වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "3. 3. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "සුද්ධ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "306. මහණෙනි, මාගමට මේ බල පසෙකි, කවර පසෙක් ද යත්: රූපබලය, භොගබලය, ඤාතිබලය, පුත්‍රබලය, සීලබලයි. මහණෙනි, මේ මාගමගේ බල පස යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 3. 2.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "විසාරද සූත්‍රය",
                "level": "1"
            },
            {
                "text": "307. මහණෙනි, මාගමට මේ බල පසෙකි, කවර පසෙක් ද යත්: රූපබලය, භොගබලය, ඤාතිබලය, පුත්‍රබලය, සීලබල යි. මහණෙනි, මේ මාගමගේ බල පස යි. මහණෙනි මේ බලපසින් යුතු මාගම විසාරද ව ගෙහි වෙසේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 3. 3.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පසය්‌හ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "308. මහණෙනි, මාගමට මේ බල පසෙකි. කවර පසෙක් ද යත්: රූපබලය, භොගබලය, ඤාතිබලය, පුත්‍රබලය, සීලබල යි. මහණෙනි, මේ මාගමගේ බල පස යි. මහණෙනි මේ බලපසින් යුතු මාගම සැමියා මැඬ ගෙහි වෙසේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 3. 4.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අභිභුය්‍ය සූත්‍රය",
                "level": "1"
            },
            {
                "text": "309. මහණෙනි, මාගමට මේ බල පසෙකි. කවර පසෙක් ද යත්: රූපබලය, භොගබලය, ඤාතිබලය, පුත්‍රබලය, සීලබලය යි. මහණෙනි, මේ මාගමගේ බල පස යි. මහණෙනි මේ බලපසින් යුතු මාගම සැමියා යටත් කොට ගෙන පවතියි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, එක්බලයකිනුදු යුතු පුරුෂ තෙමේ මාගම යටත් කොට ගෙන පවතියි. කවර එකෙකින්ද යත්: ඉසුරු බෙලෙනි. මහණෙනි, ඉසුරු බෙලෙන් මඬනා ලද මාගම රූපබලය නො ම රකී. භොගබලය නො ම රකී. ඤාතිබලය නො ම රකී. පුත්‍රබලය නො ම රකී. සීල බලය නො ම රකී යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "469"
            },
            {
                "type": "centered",
                "text": "3. 3. 5.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "අඞ්‌ග සූත්‍රය",
                "level": "1"
            },
            {
                "text": "310. මහණෙනි, මාගමට මේ බල පසෙකි. කවර පසෙක් ද යත්: රූපබලය භොගබලය ඤාතිබලය පුත්‍රබලය සීලබලය යි. මහණෙනි, මාගම රූපබලයෙන් යුතු වූවා භොගබලයෙන් නො ද යුතු වේද, මෙසේ ඇය ඒ අඟින් නො පිරිපුන් වෙයි. මහණෙනි, යම් හෙයෙකින් මාගම රූපබලයෙනුත් භොගබලයෙනුත් යුතු වූවා වේ ද මෙසේ ඇය ඒ අඟින් පිරිපුන් වෙයි. මහණෙනි, මාගම රූපබලයෙනුත් භොගබලයෙනුත් යුතු වූවා ඤාතිබලයෙන් නො ද යුතු වූවා වේද, මෙසේ ඇය ඒ අඟින් නො පිරිපුන් වෙයි. මහණෙනි, යම් හෙයෙකින් මාගම රූපබලයෙනුත් භොගබලයෙනුත් ඤාතිබලයෙනුත් යුතු වූවා වේ ද මෙසේ ඇය ඒ අඟින් පිරිපුන් වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, මාගම රූපබලයෙනුත් භොගබලයෙනුත් ඤාතිබලයෙනුත් යුතු වූවා පුත්‍රබලයෙන් නො ද යුතු වූවා වේ ද, මෙසේ ඇය ඒ අඟින් නො පිරිපුන් වෙයි. මහණෙනි, යම් හෙයෙකින් මාගම රූපබලයෙනුත් භොගබලයෙනුත් ඤාතිබලයෙනුත් පුත්‍රබලයෙනුත් යුතු වූවා වේ ද මෙසේ ඇය ඒ අඟින් පිරිපුන් වෙයි. මහණෙනි, මාගම රූපබලයෙනුත් භොගබලයෙනුත් ඤාතිබලයෙනුත් පුත්‍රබලයෙනුත් යුතු වූවා සීලබලයෙන් නො ද යුතු වූවා වේද, මෙසේ ඇය ඒ අඟින් නො පිරිපුන් වෙයි. මහණෙනි, යම් හෙයකින් මාගම රූපබලයෙනුත් භොගබලයෙනුත් ඤාතිබලයෙනුත් පුත්‍රබලයෙනුත් සීලබලයෙනුත් යුතු වූවා වේ ද, මෙසේ ඇය ඒ අඟින් පිරිපුන් වෙයි. මහණෙනි, මේ පස මාගමගේ බල යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 3. 6.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නාසිතබ්බ සූත්‍රය",
                "level": "1"
            },
            {
                "text": "311. මහණෙනි, මාගමට මේ බල පසෙකි, කවර පසෙක් ද යත්: රූපබලය භොගබලය ඤාතිබලය පුත්‍රබලය සීලබලය යි. මහණෙනි, මාගම රූපබලයෙන් යුතු වූවා සීලබලයෙන් නො ද යුතු වූවා වේ ද ඇය නසත් ම ය. කුලයෙහි නො වස්වත් ම ය. මහණෙනි, මාගම රූපබලයෙනුත් භොගබලයෙනුත් යුතු වූවා නො ද සීලබලයෙන් යුතු වූවා වේ ද, ඇය නසත් ම ය. කුලයෙහි නො වස්වත් මය. මහණෙනි, මාගම රූපබලයෙනුත් භොගබලයෙනුත් ඤාතිබලයෙනුත් යුතු වූවා සීලබලයෙන් නො ද යුතු වූවා වේද, ඇය නසත් ම ය. කුලයෙහි නො වස්වත් ම ය. මහණෙනි, මාගම රූපබලයෙනුත් භොගබලයෙනුත් ඤාතිබලයෙනුත් පුත්‍රබලයෙනුත් යුතු වූවා සීලබලයෙන් නො ද යුතු වූවා වේ ද, ඇය නසත් ම ය. කුලයෙහි නො වස්වත් ම ය.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "471"
            },
            {
                "text": "මහණෙනි, යම් හෙයෙකින් මාගම රූපබලයෙනුත් භොගබලයෙනුත් ඤාතිබලයෙනුත් පුත්‍රබලයෙනුත් සීලබලයෙනුත් යුතු වූවා වේ ද ඇය කුලයෙහි වස්වත් ම ය. නො නසත් ම ය. මහණෙනි, මාගම සීලබලයෙන් යුතු වූවා රූපබලයෙන් නො ද යුතු වේ ද ඇය කුලයෙහි වස්වත් ම ය. නො නසත් ම ය. මහණෙනි, මාගම සීලබලයෙන් යුතු වූවා භොගබලයෙන් නො ද යුතු වේ ද ඇය කුලයෙහි වස්වත් ම ය. නො නසත් ම ය. මහණෙනි, මාගම සීලබලයෙන් යුතු වූවා ඤාතිබලයෙන් නො ද යුතු වේ ද ඇය කුලයෙහි වස්වත් ම ය. නො නසත් ම ය.",
                "type": "paragraph"
            },
            {
                "type": "paragraph",
                "text": "මහණෙනි, මාගම සීලබලයෙන් යුතු වූවා පුත්‍රබලයෙන් නො ද යුතු වේ ද, ඇය කුලයෙහි වස්වත් ම ය. නො නසත් ම ය. මහණෙනි, මේ මාගමගේ බල පස යි."
            },
            {
                "type": "centered",
                "text": "3. 3. 7.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "හේතු සූත්‍රය",
                "level": "1"
            },
            {
                "text": "312. මහණෙනි, මාගමට මේ බල පසෙකි, කවර පසෙක් ද යත්: රූපබලය භොගබලය ඤාතිබලය පුත්‍රබලය සීලබලය යි. මහණෙනි, මාගම රූපබලය හේතු කොට හෝ භොගබලය හේතු කොට හෝ ඤතිබලය හෙතු කොට හෝ පුත්‍රබලය හෙතුකොට හෝ කාබුන් මරණින් මතු සෝභන ගති ඇති සගලොවට නො පැමිණෙයි. මහණෙනි, මාගම සීලබලය හේතු කොට කාබුන් මරණින් මතු සෝභන ගති ඇති සගලොවට පැමිණෙයි. මහණෙනි, මේ මාගමගේ බල පස යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 3. 8.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඨාන සූත්‍රය",
                "level": "1"
            },
            {
                "text": "313. මහණෙනි, නො කළ පින් ඇති මාගම විසින් දුලබ වූ මේ කරුණු පසෙකි. කවර පසෙක් ද යත්: මහණෙනි, “සුදුසු කුලයක උපදෙන්නෙමි” යි මෙය නො කළ පින් ඇති මාගම විසින් දුලබ වූ පළමුවන කරුණ යි. මහණෙනි, “සුදුසු කුලයක ඉපිද සුදුසු කුලයකට යන්නෙමි” යි මෙය නො කළ පින් ඇති මාගම විසින් දුලබ වූ දෙවන කරුණ යි. මහණෙනි, “සුදුසු කුලයක ඉපිද සුදුසු කුලයකට ගොස් සපත්නියක නැති ගෙහි වෙසෙන්නෙමි” යි මෙය නො කළ පින් ඇති මාගම විසින් දුලබ වූ තෙවන කරුණ යි. මහණෙනි, “සුදුසු කුලයක ඉපිද සුදුසු කුලයකට ගොස් සපත්නියක නැති ගෙහි වෙසෙමින් දරුවන් ඇත්තියක් වන්නෙමි” යි මෙය නො කළ පින් ඇති මාගම විසින් දුලබ වූ සිවුවන කරුණ යි. මහණෙනි, “සුදුසු කුලයක ඉපිද සුදුසු කුලයකට ගොස් සපත්නියක නැති ගෙහි වෙසෙමින් දරුවන් ඇත්තී ම සැමිය මැඬගෙන පවත්නෙමි” යි මෙය නො කළ පින් ඇති මාගම විසින් දුලබ වූ පස්වන කරුණ යි. මහණෙනි, මේ නො කළ පින් ඇති මාගම විසින් දුලබ වූ කරුණු පස යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "473"
            },
            {
                "text": "මහණෙනි, කළ පින් ඇති මාගම විසින් සුලබ වූ මේ කරුණු පසෙකි. කවර පසෙක් ද යත්: මහණෙනි, “සුදුසු කුලයක උපදින්නෙමි” යි මෙය කළ පින් ඇති මාගම විසින් සුලබ වූ පළමු කරුණ යි. මහණෙනි, “සුදුසු කුලයක ඉපිද සුදුසු කුලයකට යන්නෙමි” යි මෙය කළ පින් ඇති මාගම විසින් සුලබ වූ දෙවන කරුණයි. මහණෙනි, “සුදුසු කුලයක ඉපිද සුදුසු කුලයකට ගොස් සපත්නියක නැති ගෙහි වෙසෙන්නෙමි” යි මෙය කළ පින් ඇති මාගම විසින් සුලබ වූ තෙවන කරුණ යි. මහණෙනි,  “සුදුසු කුලයක ඉපිද සුදුසු කුලයකට ගොස් සපත්නියක නැති ගෙහි වෙසෙමින් දරුවන් ඇත්තියක් වන්නෙමි” යි මෙය කළ පින් ඇති මාගම විසින් සුලබ වූ සිවුවන කරුණ යි. මහණෙනි, “සුදුසු කුලයක ඉපිද සුදුසු කුලයකට ගොස් සපත්නියක නැති ගෙහි වෙසෙමින් දරුවන් ඇත්තී ම සැමිය මැඬගෙන පවත්නෙමි” යි මෙය කළ පින් ඇති මාගම විසින් සුලබ වූ පස්වන කරුණ යි. මහණෙනි, මේ කළ පින් ඇති මාගම විසින් සුලබ වූ කරුණු පස යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 3. 9.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "විසාරදවාස සූත්‍රය",
                "level": "1"
            },
            {
                "text": "314. මහණෙනි, දහම් පසෙකින් යුතු මාගම විසාරද ව ගෙහි වෙසේ. කවර පසෙකින් ද යත්: පණිවායෙන් වැළකුණී වෙයි. අයිනාදනින් වැළකුණී වෙයි. කාමයෙහි වරදවා හැසුරුමෙන් වැළකුණී වෙයි. මුසවායින් වැළකුණී වෙයි. රහමෙර පානයෙන් වැළකුණී වෙයි. මහණෙනි, මේ දහම් පසෙන් යුත් මාගම විසාරද ව ගෙහි වෙසේ යි.",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "3. 3. 10.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "වඩ්‌ඪී සූත්‍රය",
                "level": "1"
            },
            {
                "text": "315. මහණෙනි, වැඩුම් පසෙකින් වැඩෙන අරීසැවි තොමෝ අරීවැඩුමෙන් වැඩේ. කයෙහි හර ගන්නී ද උතුම් දෑ ගන්නී ද වෙයි. කවර පසෙකින් ද යත්: සැදැහැයෙන් වැඩේ. සීලයෙන් වැඩේ. ශ්‍රැතයෙන් වැඩේ. ත්‍යාගයෙන් වැඩේ. ප්‍රඥාවෙන් වැඩේ. මහණෙනි, මේ පස් වැඩුමෙන් වැඩෙන අරීසැවි තොමෝ අරීවැඩුමෙන් වැඩේ. කයෙහි හර ගන්නී ද උතුම් දෑ ගන්නී ද වෙයි.",
                "type": "paragraph"
            },
            {
                "text": "මෙලෙව්හි යම් ස්ත්‍රියක් සැදැහැයෙනුත් සීලයෙනුත් ප්‍රඥාවෙනුත් ත්‍යාග-ශ්‍රැත දෙකිනුත් වැඩේ ද එබඳු සිල්වත් ඒ උවැසි තොමෝ මෙලෙව්හි ම තමාගේ හර ගනී යි.",
                "type": "paragraph"
            },
            {
                "text": "තෙවෙනි බලවර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රනාමාවලිය:**",
                "type": "unindented"
            },
            {
                "text": "සුද්ධ, විසාරද, පසය්හ, අභිභුය්‍ය, පස්වන අඬ්ග, නසිතබ්බ, හෙතු,ඨාන, විසාරදවාස, වඩ්ඪි සූත්‍ර ය යි ඔහු දශයෙකි.",
                "type": "paragraph"
            },
            {
                "text": "මාතුගාමසංයුත්තය නිමියේ යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ]
    }
]