[
    {
        "filename": "sn-slyv-5",
        "bookId": 19,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "488"
            },
            {
                "type": "heading",
                "text": "5. සාමණ්ඩකානි සංයුත්තං",
                "level": 3
            },
            {
                "type": "centered",
                "text": "5. 1. 1.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "නිබ්බානසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "332. එකං සමයං ආයස්මා සාරිපුත්තො වජ්ජීසු විහරති උක්කවෙලායං{1 උක්කවෙලාය - සී 1,} ගඞ්ගාය නදියා තීරෙ. අථ ඛො සාමණ්ඩකානි{2 සාමණ්ඩකො - ස්යා, මඡසං.} පරිබ්බාජකො යෙනායස්මා සාරිපුත්තො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මතා සාරිපුත්තෙන සද්ධිං සම්මොදි. සම්මොදනීයං කථං සාරාණීයං වීතිසාරෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො සාමණ්ඩකානි පරිබ්බාජකො ආයස්මන්තං සාරිපුත්තං එතදවොච: නිබ්බානං නිබ්බානන්ති ආවුසො සාරිපුත්ත වුච්චති. කතමන්නු ඛො ආවුසො නිබ්බානන්ති. යො ඛො ආවුසො රාගක්ඛයො දොසක්ඛයො මොහක්ඛයො, ඉදං වුච්චති නිබ්බානන්ති."
            },
            {
                "type": "paragraph",
                "text": "අත්ථි පනාවුසො මග්ගො අත්ථි පටිපදා එතස්ස නිබ්බානස්ස සච්ඡිකිරියායාති. අත්ථි ඛො ආවුසො මග්ගො අත්ථි පටිපදා එතස්ස නිබ්බානස්ස සච්ඡිකිරියායාති. කතමො පනාවුසො මග්ගො කතමා පටිපදා එතස්ස නිබ්බානස්ස සච්ඡිකිරියායාති. අයමෙව ඛො ආවුසො අරියො අට්ඨඞ්ගිකො මග්ගො එතස්ස නිබ්බානස්ස සච්ඡිකිරියාය, සෙය්යථිදං: සම්මාදිට්ඨි -පෙ- සම්මාසමාධි. අයං ඛො ආවුසො මග්ගො අයං පටිපදා එතස්ස නිබ්බානස්ස සච්ඡිකිරියායාති. භද්දකො ආවුසො මග්ගො භද්දිකා පටිපදා එතස්ස නිබ්බානස්ස සච්ඡිකිරියාය. අලඤ්ච පනාවුසො සාරිපුත්ත අප්පමාදායාති. -පෙ-"
            },
            {
                "type": "centered",
                "text": "(ජම්බුඛාදකවග්ගෙ විය විත්ථාරෙතබ්බං.)",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "5. 1. 16.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුක්කරසුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "347. කින්නු ඛො ආවුසො සාරිපුත්ත ඉමස්මිං ධම්මවිනයෙ දුක්කරන්ති? පබ්බජ්ජා ඛො ආවුසො ඉමස්මිං ධම්මවිනයෙ දුක්කරාති{3 දුක්කරන්ති - සබ්බත්ථ.}. පබ්බජිතෙන පනාවුසො කිං දුක්කරන්ති? පබ්බජිතෙන ඛො ආවුසො අභිරති දුක්කරාති. අභිරතෙන පන ආවුසො කිං දුක්කරන්ති? අභිරතෙන ඛො ආවුසො ධම්මානුධම්මපටිපත්ති දුක්කරාති. කීවචිරං පනාවුසො ධම්මානුධම්මපටිපන්නො භික්ඛු අරහං අස්සාති? න චිරං ආවුසොති."
            },
            {
                "type": "centered",
                "text": "සාමණ්ඩකානි සංයුත්තං සමත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**පුරිමකසදිසමෙව උද්දානං:**"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ],
        "pages": {
            "488": {
                "pageNum": 488,
                "footnotesCount": 3
            },
            "490": {
                "pageNum": 490,
                "footnotesCount": 0
            }
        }
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "489"
            },
            {
                "text": "5. සාමණ්ඩකානි සංයුක්තය",
                "type": "heading",
                "level": 3
            },
            {
                "type": "centered",
                "text": "5. 1. 1.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "නිබ්බාන සූත්‍රය",
                "level": 1
            },
            {
                "text": "332. එක් කලෙක ආයුෂ්මත් සැරියුත් තෙරණුවෝ වැදෑ දනව්වෙහි ගඞ්ගා ගං ඉවුරෙහි උක්කවේලා නුවර සමීපයෙහි වැඩ වසති. එකල්හි සාමණ්ඩකානි පිරිවැජි තෙමේ ආයුෂ්මත් සැරියුත් තෙරණුවන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් සැරියුත් තෙරණුවන් සමඟ සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථාව කොට නිමවා එකත්පස් ව හුන්නේ ය. එකත්පස් ව හුන් සාමණ්ඩකානි පිරිවැජි තෙමේ ආයුෂ්මත් සැරියුත් තෙරණුවන්ට මෙය කීය: ඇවැත්නි ශාරිපුත්‍රයෙනි, නිවන නිවන යි කියනු ලැබේ. ඇවැත්නි, නිවන කවරේ දැ යි. ඇවැත්නි, යම් රාගය ක්ෂය කිරීමෙක් දෝසය ක්ෂය කිරීමෙක් මෝහය ක්ෂය කිරීමෙක් වේ නම් මෙය නිවනැ යි කියනු ලැබේ.",
                "type": "paragraph"
            },
            {
                "text": "ඇවැත්නි, මේ නිවන පසක් කිරීමට මගෙක් ඇද්ද, පිළිවෙතෙක් ඇද්දැ යි. ඇවැත්නි, මේ නිවන පසක් කිරීමට මගෙක් ඇත. පිළිවෙතෙක් ඇතැ යි. ඇවැත්නි, මේ නිවන පසක් කිරීමට මග කවරේ ද? පිළිවෙත කවරේ දැ? යි. ඇවැත්නි මේ නිවන පසක් කිරීමට මේ අරි අටඟි මග ම ය. එනම්: සම්මාදිට්ඨිය ... සම්මාසමාධි ය යි. ඇවැත්නි, මේ නිවන පසක් කිරීමට මේ මග යි. මේ පිළිවෙත යි. ඇවැත්නි, මේ නිවන පසක් කිරීමට සොඳුරු මගෙකි. සොඳුරු පිළිවෙතෙකි. ඇවැත්නි ශරිපුත්‍රයෙනි, නො පමා වීමට සුදුසු යි. ...",
                "type": "paragraph"
            },
            {
                "text": "(ජම්බුඛාදක වර්ගයෙහි මෙන් විස්තර කටයුතු යි)",
                "type": "centered",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "5. 1. 16.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුක්කර සූත්‍රය",
                "level": "1"
            },
            {
                "text": "347. ඇවැත්නි ශරිපුත්‍රයෙනි, මේ සස්නෙහි කුමක් දුෂ්කර දැ යි. ඇවැත්නි, මේ සස්නෙහි පැවිද්ද දුෂ්කර ය. ඇවැත්නි, පැවිද්දා විසින් කුමක් දුෂ්කර දැ යි. ඇවැත්නි, පැවිද්දා විසින් (පැවිද්දෙහි) ඇල්ම දුෂ්කර ය. ඇවැත්නි, (පැවිද්දෙහි) ඇලුනහු විසින් කුමක් දුෂ්කර දැ යි. ඇවැත්නි, (පැවිද්දෙහි) ඇලුනහු විසින් ධර්‍මානුධර්‍ම ප්‍රතිපත්තිය දුෂ්කර ය. ඇවෙත්නි, ධර්‍මානුධර්‍ම ප්‍රතිපන්න මහණ කොපමණ කලකින් රහත් වන්නේ දැ යි. ඇවැත්නි, නොබෝ කලකිනි යි.",
                "type": "paragraph"
            },
            {
                "text": "සාමණ්ඩකානි සංයුත්තය නිමියේ යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**සූත්‍ර නාමාවලිය: පළමු වර්ගයෙහි මෙනි**",
                "type": "unindented"
            },
            {
                "type": "page-break",
                "text": "end"
            }
        ]
    }
]