[
    {
        "filename": "sn-mhv-5",
        "bookId": 20,
        "language": "pali",
        "entries": [
            {
                "type": "page-break",
                "text": "426"
            },
            {
                "type": "heading",
                "text": "5. සම්මප්පධානසංයුත්තං",
                "level": 3
            },
            {
                "type": "heading",
                "text": "1. ගඞ්ගාපෙය්යාලවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "5. 1. 1",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "පාචීනනින්නසුත්තං",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "2211. **සාවත්ථියං:**"
            },
            {
                "type": "paragraph",
                "text": "චත්තාරො‘මෙ භික්ඛවෙ, සම්මප්පධානා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු අනුප්පන්නානං පාපකානං අකුසලානං ධම්මානං අනුප්පාදාය ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. උප්පන්නානං පාපකානං අකුසලානං ධම්මානං පහානාය ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. අනුප්පන්නානං කුසලානං ධම්මානං උප්පාදාය ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. උප්පන්නානං කුසලානං ධම්මානං ඨිතියා අසම්මොසාය භිය්යොභාවාය වෙපුල්ලාය භාවනාය පාරිපූරියා ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. ඉමෙ ඛො භික්ඛවෙ, චත්තාරො සම්මප්පධානාති."
            },
            {
                "type": "paragraph",
                "text": "සෙය්යථාපි භික්ඛවෙ, ගඞ්ගා නදී පාචීනනින්නා පාචීනපොණා පාචීනපබ්භාරා. එවමෙව ඛො භික්ඛවෙ, භික්ඛු චත්තාරො සම්මප්පධානෙ භාවෙන්තො චත්තාරො සම්මප්පධානෙ බහුලීකරොන්තො නිබ්බානනින්නො හොති නිබ්බානපොණො නිබ්බානපබ්භාරො. කථඤ්ච භික්ඛවෙ, භික්ඛු චත්තාරො සම්මප්පධානෙ භාවෙන්තො චත්තාරො සම්මප්පධානෙ බහුලීකරොන්තො නිබ්බානනින්නො හොති නිබ්බානපොණො නිබ්බානපබ්භාරො: ඉධ භික්ඛවෙ, භික්ඛු අනුප්පන්නානං පාපකානං අකුසලානං ධම්මානං අනුප්පාදාය ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. උප්පන්නානං පාපකානං අකුසලානං ධම්මානං පහානාය ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. අනුප්පන්නානං කුසලානං ධම්මානං උප්පාදාය ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. උප්පන්නානං කුසලානං ධම්මානං ඨිතියා අසම්මොසාය භිය්යොභාවාය වෙපුල්ලාය භාවනාය පාරිපූරියා ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. එවං ඛො භික්ඛවෙ, භික්ඛු චත්තාරො සම්මප්පධානෙ භාවෙන්තො චත්තාරො සම්මප්පධානෙ බහුලීකරොන්තො නිබ්බානනින්නො හොති නිබ්බානපොණො නිබ්බානපබ්භාරොති."
            },
            {
                "type": "page-break",
                "text": "428"
            },
            {
                "type": "centered",
                "text": "5. 1. 2 - 48",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතියපාචීනනින්නාදි සුත්තං",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "2212 – 2258. චත්තාරොමෙ භික්ඛවෙ, සම්මප්පධානා, කතමෙ චත්තාරො -පෙ- නිබ්බානපබ්භාරොති."
            },
            {
                "type": "paragraph",
                "text": "(වුත්තනයෙන විත්ථාරෙතබ්බො.)"
            },
            {
                "type": "centered",
                "text": "ගඞ්ගාපෙය්යාලො පඨමො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "ඡ පාචීනතො නින්නා ඡ ච නින්නා සමුද්දතො,\nඑතෙ ද්වෙ ද්වාදස හොන්ති වග්ගො තෙන පවුච්චතීති.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "2. අප්පමාදවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "5. 2. 1 - 40",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තථාගතාදිසුත්තානි",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "2259 – 2298. යාවතා භික්ඛවෙ, සත්තා අපදා වා දිපදා වා චතුප්පදා වා බහුප්පදා වා -පෙ- බහුලීකරොතීති."
            },
            {
                "type": "paragraph",
                "text": "(යථාවුත්තනයෙන විත්ථාරෙතබ්බො.)"
            },
            {
                "type": "centered",
                "text": "අප්පමාදවග්ගො දුතියො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "තථාගතං පදං කූටං මූලං සාරෙන වස්සිකං,\nරාජා චන්දිමසූරියා ච වත්ථෙන දසමං පදන්ති.",
                "level": "1"
            },
            {
                "type": "page-break",
                "text": "430"
            },
            {
                "type": "heading",
                "text": "3. බලකරණීයවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "5. 3. 1 - 48",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "බලාදි සුත්තානි",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "2299 - 2346. සෙය්යථාපි භික්ඛවෙ, යෙ කෙචි බලකරණීයා කම්මන්තා කයිරන්ති, සබ්බෙ තෙ පඨවිං නිස්සාය පඨවියං පතිට්ඨාය එවමෙතෙ බලකරණීයා කම්මන්තා කයිරන්ති. එවමෙව ඛො භික්ඛවෙ, භික්ඛු සීලං නිස්සාය සීලෙ පතිට්ඨාය චත්තාරො සම්මප්පධානෙ භාවෙති, චත්තාරො සම්මප්පධානෙ බහුලීකරොති. කථඤ්ච භික්ඛවෙ, භික්ඛු සීලං නිස්සාය සීලෙ පතිට්ඨාය චත්තාරො සම්මප්පධානෙ භාවෙති, චත්තාරො සම්මප්පධානෙ බහුලීකරොති: ඉධ භික්ඛවෙ, භික්ඛු අනුප්පන්නානං පාපකානං අකුසලානං ධම්මානං අනුප්පාදාය ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. උප්පන්නානං අකුසලං ධම්මානං පහානාය -පෙ- අනුප්පන්නානං කුසලානං ධම්මානං උප්පාදාය -පෙ- උප්පන්නානං කුසලානං ධම්මානං ඨිතියා අසම්මොසාය භිය්යොභාවාය වෙපුල්ලාය භාවනාය පාරිපූරියා ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. එවං ඛො භික්ඛවෙ, භික්ඛු සීලං නිස්සාය සීලෙ පතිට්ඨාය චත්තාරො සම්මප්පධානෙ භාවෙති, චත්තාරො සම්මප්පධානෙ බහුලීකරොතීති. -පෙ- බහුලීකරොතීති."
            },
            {
                "type": "paragraph",
                "text": "(එවං අට්ඨතාලීස සුත්තන්තා විත්ථාරෙතබ්බා)."
            },
            {
                "type": "centered",
                "text": "බලකරණීයවග්ගො තතියො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "බලං බීජඤ්ච නාගො ච රුක්ඛං කුම්භෙන සූකිනං,\nආකාසෙන ච ද්වෙ මෙඝා නාවා ආගන්තුකා නදීති.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "4. එසනාවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "5. 4. 1 - 160",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "එසනාදි සුත්තානි",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "2347 - 2506. තිස්සො ඉමා භික්ඛවෙ, එසනා. කතමා තිස්සො: කාමෙසනා, භවෙසනා, බ්රහ්මචරියෙසනා. ඉමා ඛො භික්ඛවෙ, තිස්සො එසනා. ඉමාසං ඛො භික්ඛවෙ, තිස්සන්නං එසනානං අභිඤ්ඤාය චත්තාරො සම්මප්පධානා භාවෙතබ්බා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු අනුප්පන්නානං -පෙ- උප්පන්නානං කුසලානං ධම්මානං ඨිතියා අසම්මොසාය භිය්යොභාවාය වෙපුල්ලාය භාවනාය පාරිපූරියා ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. ඉමෙසං ඛො භික්ඛවෙ, තිස්සන්නං එසනානං අභිඤ්ඤාය ඉමෙ චත්තාරො සම්මප්පධානා භාවෙතබ්බාති -පෙ- භාවෙතබ්බාති."
            },
            {
                "type": "page-break",
                "text": "432"
            },
            {
                "type": "paragraph",
                "text": "(එවං අභිඤ්ඤාය පරිඤ්ඤාය පරික්ඛයාය පහානායාති ච එකෙකස්මිං සොළස සොළස කත්වා එකසතසට්ඨි සුත්තන්තා විත්ථාරෙතබ්බා.)"
            },
            {
                "type": "centered",
                "text": "එසනාවග්ගො චතුත්ථො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "එසනා විධා ආසවො භවො දුක්ඛතා ච තිස්සො\nඛිලං මලඤ්ච නීඝො ච වෙදනා තණ්හාභි චාති.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "5. ඔඝවග්ගො",
                "level": 2
            },
            {
                "type": "centered",
                "text": "5. 5. 1 - 159",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඔඝාදිසුත්තානි",
                "level": "1"
            },
            {
                "type": "paragraph",
                "text": "2507 - 2665. චත්තාරොමෙ භික්ඛවෙ, ඔඝා -පෙ- භාවෙතබ්බාති. (විත්ථාරෙතබ්බා)"
            },
            {
                "type": "centered",
                "text": "5. 5. 160.",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "උද්ධම්භාගිය සුත්තං",
                "level": 1
            },
            {
                "type": "paragraph",
                "text": "2666. පඤ්චිමානි, භික්ඛවෙ, උද්ධම්භාගියානි සංයොජනානි. කතමානි පඤ්ච: රූපරාගො, අරූපරාගො, මානො, උද්ධච්චං, අවිජ්ජා. ඉමානි ඛො භික්ඛවෙ, පඤ්චුද්ධම්භාගියානි සංයොජනානි. ඉමෙසං ඛො භික්ඛවෙ, පඤ්චන්නං උද්ධම්භාගියානං සංයොජනානං පහානාය චත්තාරො සම්මප්පධානා භාවෙතබ්බා. කතමෙ චත්තාරො: ඉධ භික්ඛවෙ, භික්ඛු අනුප්පන්නානං පාපකානං අකුසලානං ධම්මානං අනුප්පාදාය ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. උප්පන්නානං පාපකානං අකුසලානං ධම්මානං පහානාය ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. අනුප්පන්නානං කුසලානං ධම්මානං උප්පාදාය ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. උප්පන්නානං කුසලානං ධම්මානං ඨිතියා අසම්මොසාය භිය්යොභාවාය වෙපුල්ලාය භාවනාය පාරිපූරියා ඡන්දං ජනෙති වායමති විරියං ආරභති චිත්තං පග්ගණ්හාති පදහති. ඉමෙසං ඛො භික්ඛවෙ, පඤ්චන්නං උද්ධම්භාගියානං සංයොජනානං පහානාය ඉමෙ චත්තාරො සම්මප්පධානා භාවෙතබ්බාති. (වුත්තනයෙනෙව එකසතසට්ඨිසුත්තන්තා විත්ථාරෙතබ්බා)."
            },
            {
                "type": "centered",
                "text": "ඔඝවග්ගො පඤ්චමො.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්රැද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "ඔඝො යොගො උපාදානං ගන්ථො අනුසයෙන ච\nකාමගුණා නීවරණා ඛන්ධා ඔරුද්ධම්භාගියාති.",
                "level": "1"
            },
            {
                "type": "centered",
                "text": "සම්මප්පධානසංයුත්තං සමත්තං.",
                "level": "1"
            },
            {
                "type": "unindented",
                "text": "**තත්ර වග්ගුද්දානං:**"
            },
            {
                "type": "gatha",
                "text": "ගඞ්ගාපෙය්යාලොප්පමාදො බලකරණීයෙසනා\nඔඝොති පඤ්චෙවවග්ගා සම්මප්පධානසංයුත්තෙති.",
                "level": "1"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ],
        "pages": {
            "426": {
                "pageNum": 426,
                "footnotesCount": 0
            },
            "428": {
                "pageNum": 428,
                "footnotesCount": 0
            },
            "430": {
                "pageNum": 430,
                "footnotesCount": 0
            },
            "432": {
                "pageNum": 432,
                "footnotesCount": 0
            }
        }
    },
    {
        "language": "sinh",
        "entries": [
            {
                "type": "page-break",
                "text": "427"
            },
            {
                "text": "5. සම්මප්පධාන සංයුක්තය",
                "type": "heading",
                "level": 3
            },
            {
                "text": "1. ගඞ්‌ගාපෙය්‍යාල වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "5. 1. 1.",
                "level": 1
            },
            {
                "type": "heading",
                "text": "පාචීනනින්න සූත්‍රය",
                "level": 1
            },
            {
                "text": "2211. **සැවැත්නුවර:**",
                "type": "unindented"
            },
            {
                "text": "මහණෙනි, මේ සම්මප්පධාන සතරෙකි. කවර සතරෙක් ද යත්: මහණෙනි, මෙසස්නෙහි මහණ නූපන් ලාමක අකුසල් දහම් නූපදනා පිණිස සඳ දනවයි. වෑයම් කෙරෙයි. වැර අරඹයි. සිත දැඩි කොට ගනී. ප්‍රධන් වීර්ය්‍ය කෙරෙයි. උපන් ලාමක අකුසල් දහම් ප්‍රහීණ කිරීම පිණිස සඳ දනවයි. වෑයම් කෙරෙයි. වැර අරඹයි. සිත දැඩි කොට ගනියි. ප්‍රධන් වීර්ය්‍ය කෙරෙයි. නූපන් කුසල් දහම් ඉපදවීම පිණිය සඳ දනවයි. වෑයම් කෙරෙයි. වැර අරඹයි. සිත දැඩි කොට ගනියි. ප්‍රධන් වීර්ය්‍ය කෙරෙයි. උපන් කුසල්දහමුන්ගේ පැවැත්ම පිණිස නුමුළාබව පිණිස බොහෝ බව පිණිස විපුලබව පිණිස වැඩීම පිණිස පිරීම පිණිස සඳ දනවයි. වෑයම් කෙරෙයි. වැර අරඹයි. සිත දැඩි කොට ගනියි. ප්‍රධන් වීර්ය්‍ය කෙරෙයි. මහණෙනි, මොහු සතර සම්මප්පධානයෝ යි.",
                "type": "paragraph"
            },
            {
                "text": "මහණෙනි, යම්සේ ගඞ්ගානදී තොමෝ පෙරදිගට නැමුණි පෙරදිගට නැඹුරු වූවා පෙරදිගට බරවූවා වේ ද, මහණෙනි, එසෙයින් ම මහණ තෙමේ සිවුසම්පදහන් වඩනුයේ සිවුසම්පදහන් බහුල කරනුයේ නිවනට නැමුණේ නිවනට නැඹුරු වූයේ නිවනට බර වූයේ වෙයි. මහණෙනි, කෙසේ නම් මහණ තෙමේ සිවුසම්පදහන් වඩනුයේ සිවුසම්පදහන් බහුල කරනුයේ නිවනට නැමුණේ නිවනට නැඹුරු වූයේ නිවනට බර වූයේ වේ ද යත්: මහණෙනි, මෙසස්නෙහි මහණ නූපන් ලාමක අකුසල් දහම් නූපදනා පිණිස සඳ දනවයි. වෑයම් කෙරෙයි. වැර අරඹයි. සිත දැඩි කොට ගනියි. ප්‍රධන් වීර්ය්‍ය කෙරෙයි. උපන් ලාමක අකුසල් දහම් ප්‍රහාණය පිණිස සඳ දනවයි, වෑයම් කෙරෙයි, වැර අරඹයි, සිත දැඩි කොට ගනියි. ප්‍රධන් වීර්ය්‍ය කෙරෙයි. නූපන් කුසල් දහම් උපදනා පිණිස සඳ දනවයි, වෑයම් කෙරෙයි, වැර අරඹයි, සිත දැඩි කොට ගනියි, ප්‍රධන් වීර්ය්‍ය කෙරෙයි. උපන් කුසල් දහමුන්ගේ පැවැත්ම නුමුළා බව බොහෝ බව විපුල බව වැඩීම පිණිස පිරීම පිණිස සඳ දනවයි, වෑයම් කෙරෙයි, වැර අරඹයි, සිත දැඩි කොට ගනියි, ප්‍රධන් වීර්ය්‍ය කෙරෙයි. මහණෙනි, මෙසේ මහණ තෙමේ සිවුසම්පදහන් වඩනුයේ සිවුසම්පදහන් බහුල කරනුයේ නිවනට නැමුණේ නිවනට නැඹුරු වූයේ නිවනට බර වූයේ වේ යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "429"
            },
            {
                "type": "centered",
                "text": "5. 1. 2. - 48",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "දුතිය පාචීනනින්නාදි සූත්‍ර",
                "level": "1"
            },
            {
                "text": "2212-2258. මහණෙනි, මේ සම්පදහන් සතරෙකි. කවර සතරෙක් ද යත්: ... නිවනට බර වූයේ වේ යි.",
                "type": "paragraph"
            },
            {
                "text": "(කී නයින් විතර කටයුතු.)",
                "type": "paragraph"
            },
            {
                "text": "පළමුවැනි ගඞ්ගාපෙය්‍යාලය යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රතාමාවලි ය:**",
                "type": "unindented"
            },
            {
                "text": "පාචීනනින්නසූත්‍ර චතුෂ්ක සයෙකි. සමුද්දනින්න චතුෂ්ක ද සයෙකි. මේ ෂට්ක දෙක චතුෂ්ක දොළොසෙක් වේ. එයින් වර්ග යි කියනු ලැබේ. සූත්‍ර මුළුල්ල අටසාලිසෙකි යි.",
                "type": "paragraph"
            },
            {
                "text": "2. අප්‌පමාද වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "5.2.1 - 40",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "තථාගතාදි සූත්‍ර",
                "level": 1
            },
            {
                "text": "2259-2298. මහණෙනි, අපා වූ ද දෙපා වූ ද සිවුපා වූ ද බහුපා වූ ද යම්තාක් සත්වයෝ වෙද්ද ... බහුල කෙරේ යි.",
                "type": "paragraph"
            },
            {
                "text": "(කියන ලද නයින් විතර කටයුතු.)",
                "type": "paragraph"
            },
            {
                "text": "දෙවෙනි අප්පමාදවර්ගය යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රතාමාවලි ය:**",
                "type": "unindented"
            },
            {
                "text": "තථාගත, පද, කූට, මූල, සාර, වස්සික, රාජ, චන්දිම, සුරිය, වත්ථ යී සූත්‍ර චතුෂ්ක දශයෙකි. මුළුල්ල සාලිසෙකි යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "431"
            },
            {
                "text": "3. බලකරණීය වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "5. 3. 1 - 48",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "බලාදි සූත්‍ර",
                "level": 1
            },
            {
                "text": "2299-2346. මහණෙනි, යම්යේ යම් කිසි බලකරණිය කර්මාන්තයෝ කරනු ලැබෙත් ද, ඒ සියල්ලෝ පොළොව නිසා පොළොවෙහි පිහිටා මෙසේ මේ බලකරණිය කර්මාන්තයෝ කරනු ලැබෙත්. මහණෙනි, එසෙයින් ම මහණ තෙමේ ශීලය නිසා ශීලයෙහි පිහිටා සිවුසම්පදහන් වඩයි. සිවුසම්පදහන් බහුල කෙරෙයි. මහණෙනි, කෙසේ නම් මහණ තෙමේ ශීලය නිසා ශීලයෙහි පිහිටා සිවුසම්පදහන් වඩා ද, සිවුසම්පදහන් බහුල කෙරේ ද යත්: මහණෙනි, මෙසස්නෙහි මහණ නූපන් ලාමක අකුසල්දහම් නූපදනා පිණිස සඳ දනවයි. වෑයම් කෙරෙයි. වැර අරඹයි. සිත දැඩි කොට ගනියි. ප්‍රධන්වීර්ය්‍ය කෙරෙයි. උපන් ලාමක අකුසල් දහම් පහකරනු පිණිස ... නූපන් කුසල්දහම් ඉපදවීම පිණිස ... උපන් කුසල්දහමුන්ගේ පැවැත්ම නුමුළා බව බොහෝ බව විපුල බව වැඩීම පිරීම පිණිස සඳ දනවයි. වෑයම් කෙරෙයි. වැර අරඹයි. සිත දැඩි කොට ගනියි. ප්‍රධන්වීර්ය්‍ය කෙරෙයි. මහණෙනි, මෙසේ මහණ තෙමේ ශීලය නිසා ශීලයෙහි පිහිටා සිවුසම්පදහන් වඩයි. සිවුසම්පදහන් බහුල කෙරේ යි ... බහුල කෙරේ යි.",
                "type": "paragraph"
            },
            {
                "text": "(මෙසේ අටසාලිස් සූත්‍රාන්තයෝ විතර කටයුත්තාහ.)",
                "type": "paragraph"
            },
            {
                "text": "තෙවෙනි බලකරණියවර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රතාමාවලිය:**",
                "type": "unindented"
            },
            {
                "text": "බල, බීජ, නාග, රුක්ඛ, කුම්භ, සූක, ආකාස යි සූත්‍ර චතුෂ්ක සතෙකි. මෙඝ චතුෂ්ක දෙකෙකි. නාවා, ආගන්තුක, නදී යි චතුෂ්ක තුනෙකි යි මෙසේ චතුෂ්ක දොළොසෙකි. සූත්‍ර මුළුල්ල අටසාලිසෙකි යි.",
                "type": "paragraph"
            },
            {
                "text": "4. එසනා වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "5. 4. 1 - 160",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "එසනාදි සූත්‍ර",
                "level": "1"
            },
            {
                "text": "2347-2506. මහණෙනි, මේ එසනා තුනෙකි. කවර තුනෙක් ද යත්: කාමෙසනා භවෙසනා බ්‍රහ්මචරියෙසනා යි. මහණෙනි, මේ තුන් එසනා යි. මහණෙනි, මේ තුන් ඒසනාවන් වෙසෙසින් දැනුම පිණිස සිවුසම්පදහන් වැඩියයුතු. කවර සිවුසම්පදහන්හු ද යත්: මහණෙනි, මෙසස්නෙහි මහණ නූපන් ... උපන් කුසල්දහමුන්ගේ පැවැත්ම නුමුළා බව බොහෝ බව විපුල බව වැඩීම පිරීම පිණිස සඳ දනවයි. වෑයම් කෙරෙයි. වැර අරඹයි. සිත දැඩි කොට ගනියි. ප්‍රධන්වීර්ය්‍ය කෙරෙයි. මහණෙනි, මේ තුන් ඒසනාවන් වෙසෙසින් දැනුම පිණිස මේ සිවුසම්පදහන් වැඩිය යුතු යි ... වැඩියයුතු යි.",
                "type": "paragraph"
            },
            {
                "type": "page-break",
                "text": "433"
            },
            {
                "text": "(මෙසේ අභිඤ්ඤාය පරිඤ්ඤාය පරික්ඛයාය පහානාය යි ද එකෙක සොළොස සොළොස කොට එක්සිය සැට සූත්‍රාන්ත කෙනෙක් විතර කටයුතුවහ.)",
                "type": "paragraph"
            },
            {
                "text": "සිවුවැනි එසනාවර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රනාමාවලි ය:**",
                "type": "unindented"
            },
            {
                "text": "එසනා, විධා, ආසව, භව, දුක්ඛතා, ඛීල, මල, නීඝ, වෙදනා, තණ්හා යී සූත්‍ර ෂොඩශක දශයෙකි. මුළුල්ල එක්සිය සැටෙකි යි.",
                "type": "paragraph"
            },
            {
                "text": "5. ඔඝ වර්ගය",
                "type": "heading",
                "level": 2
            },
            {
                "type": "centered",
                "text": "5. 5. 1 - 159",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "ඔඝාදි සූත්‍ර",
                "level": 1
            },
            {
                "text": "2507-2665. මහණෙනි, මේ ඔඝ සතරෙකි ... වැඩිය යුත්තාහ යි. (විතර කටයුතු.)",
                "type": "paragraph"
            },
            {
                "type": "centered",
                "text": "5. 5. 160",
                "level": "1"
            },
            {
                "type": "heading",
                "text": "උද්ධම්භාගිය සූත්‍රය",
                "level": 1
            },
            {
                "text": "2666. මහණෙනි, මේ උද්ධම්භාගිය සංයෝජන පසෙකි. කවර පසෙක් ද යත්: රූපරාග අරූපරාග මාන උද්ධච්ච අවිජ්ජා යි. මහණෙනි, මොහු පස් උද්ධම්භාගිය සංයොජනයෝ යි. මහණෙනි, මේ පස් උද්ධම්භාගිය සංයොජනයන් පහකරනු පිණිස සිවුසම්පදහන් වැඩියයුතු. කවර සිවුසම්පදහන්හු ද යත්: මහණෙනි, මෙසස්නෙහි මහණ නූපන් ලාමක අකුසල් දහම් නූපදනා පිණිස සඳ දනවයි. වෑයම් කෙරෙයි. වැර අරඹයි. සිත දැඩි කොට ගනියි. ප්‍රධන්වීර්ය්‍ය කෙරෙයි. උපන් අකුසල්දහම් පහකරනු පිණිස සඳ දනවයි. වෑයම් කෙරෙයි. වැර අරඹයි. සිත දැඩි කොට ගනියි. ප්‍රධන්වීර්ය්‍ය කෙරෙයි. නූපන් කුසල්දහම් ඉපදවීම පිණිස සඳ දනවයි. වෑයම් කෙරෙයි. වැර අරඹයි. සිත දැඩි කොට ගනියි. ප්‍රධන්වීර්ය්‍ය කෙරෙයි. උපන් කුසල්දහමුන්ගේ පැවැත්ම නුමුළා බව බොහෝ බව විපුල බව වැඩීම පිරීම පිණිස සඳ දනවයි, වෑයම් කෙරෙයි, වැර අරඹයි. සිත දැඩි කොට ගනියි. ප්‍රධන්වීර්ය්‍ය කෙරෙයි. මහණෙනි, මේ පස් උද්ධම්භාගිය සංයොජනයන් ප්‍රහාණය පිණිස මේ සිවුසම්පදහන්හු වැඩියයුත්තාහ යි.(කියන ලද නයින් ම එක්සියසැට සූත්‍රාන්තයෝ විතර කටයුතුවහ.)",
                "type": "paragraph"
            },
            {
                "text": "පස්වැනි ඔඝවර්ග යි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි සූත්‍රනාමාවලි ය:**",
                "type": "unindented"
            },
            {
                "text": "ඔඝ, යොග, උපාදාන, ගන්ථ, අනුසය, කාමගුණ, නීවරණ, ඛන්ධ, ඔරම්භාගිය, උද්ධම්භාගිය, යී ෂොඩශක දශයෙකි. සූත්‍ර මුළුල්ල එක්සිය සැටෙකි යි.",
                "type": "paragraph"
            },
            {
                "text": "සම්මප්පධානසංයුත්තය නිමි.",
                "type": "centered",
                "level": "1"
            },
            {
                "text": "**එහි වර්ගනාමාවලි ය:**",
                "type": "unindented"
            },
            {
                "text": "ගඞ්ගාපෙය්‍යාල, අප්පමාද, බලකරණීය, එසනා, ඔඝ යී සම්මප්පධාන සංයුත්තයෙහි වර්ග පසෙක් ම වේ යි.",
                "type": "paragraph"
            },
            {
                "text": "end",
                "type": "page-break"
            }
        ]
    }
]