{
    "filename": "sn-1-6",
    "bookId": 16,
    "pageOffset": 0,
    "pages": [
        {
            "pageNum": 248,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "6. බ්රහ්මසංයුත්තං",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. කොකාලිකවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "6. 1. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආයාචනසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "172. එවං මෙ සුතං: එකං සමයං භගවා උරුවෙලායං විහරති නජ්ජා නෙරඤ්ජරාය තීරෙ අජපාලනිග්රොධමූලෙ පඨමාභිසම්බුද්ධො."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවතො රහොගතස්ස පටිසල්ලීනස්ස එවං චෙතසො පරිවිතක්කො උදපාදි. අධිගතො ඛො ම්යායං ධම්මො ගම්භීරො දුද්දසො දුරනුබොධො සන්තො පණීතො අතක්කාවචරො නිපුණො පණ්ඩිතවෙදනීයො. ආලයරාමා ඛො පනායං පජා ආලයරතා ආලයසම්මුදිතා{1}. ආලයරාමාය ඛො පන පජාය ආලයරතාය ආලයසම්මුදිතාය දුද්දසං ඉදං ඨානං යදිදං ඉදප්පච්චයතා පටිච්චසමුප්පාදො. ඉදම්පි ඛො ඨානං යදිදං සබ්බසඞ්ඛාරසමථො සබ්බූපධිපටිනිස්සග්ගො තණ්හක්ඛයො{2} විරාගො නිරොධො නිබ්බාණං. අහඤ්චෙව ඛො පන ධම්මං දෙසෙය්යං. පරෙ ච මෙ න ආජානෙය්යුං. සො මමස්ස කිලමථො සා මමස්ස විහෙසාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අපිස්සුදං{3} භගවන්තං ඉමා අනච්ඡරියා ගාථායො පටිභංසු. පුබ්බෙ අස්සුතපුබ්බා:"
                    },
                    {
                        "type": "gatha",
                        "text": "කිච්ඡෙන මෙ අධිගතං හලන්දානි පකාසිතුං,\nරාගදොසපරෙතෙහි නායං ධම්මො සුසම්බුධො."
                    },
                    {
                        "type": "gatha",
                        "text": "පටිසොතගාමිං නිපුණං ගම්භීරං දුද්දසං අණුං,\nරාගරත්තා න දක්ඛින්ති{4} තමොක්ඛන්ධෙන ආවුතාති.{5}"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉති{6} භගවතො පටිසඤ්චික්ඛතො අප්පොස්සුක්කතාය චිත්තං නමති නො ධම්මදෙසනාය."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො බ්රහ්මුනො සහම්පතිස්ස භගවතො චෙතසා චෙතො පරිවිතක්කමඤ්ඤාය එතදහොසි: නස්සති වත භො ලොකො. විනස්සති වත භො ලොකො යත්ර හි නාම තථාගතස්ස අරහතො සම්මාසම්බුද්ධස්ස අප්පොස්සුක්කතාය චිත්තං නමති නො ධම්මදෙසනායාති. අථ ඛො බ්රහ්මා සහම්පති සෙය්යථාපි නාම බලවා පුරිසො සම්මිඤ්ජිතං{7} වා බාහං පසාරෙය්ය. පසාරිතං වා බාහං සම්මිඤ්ජෙය්ය, එවමෙව බ්රහ්මලොකෙ අන්තරහිතො භගවතො පුරතො පාතුරහොසි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සමුදිතා - ස්යා. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. තණ්හාක්ඛයො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අපිස්සු - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. දක්ඛන්ති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. ආවුටාති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "6. ඉතිහ - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "7. සමිඤ්ජිතං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "6. බ්‍රහ්‌ම සංයුත්‌තය\n",
                        "level": 3
                    },
                    {
                        "type": "heading",
                        "text": "1. කෝකාලික වර්ගය",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "6. 1. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ආයාචන සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "172. මා විසින් මෙසේ අසන ලදී: එක්කලෙක භාග්‍යවතුන් වහන්සේ බුදු ව පළමු කොට උරුවෙල්දනව්වෙහි නේරඤ්ජරා ගංතෙර අජපල් නුගරුකමුල වැඩ වසන සේක. ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි එකලාව චිත්තවිවේකයෙන් හුන් භාග්‍යවතුන් වහන්සේට මෙබඳු චිත්තපරිවිතර්කයෙක් පහළ විය. මා විසින් අවබෝධ කළ මේ ධර්මය ගැඹුරුය. දුකසේ දැක්ක යුතු ය, දුකසේ අවබෝධ කටයුතුය. ශාන්ත ය. ප්‍රණීත ය. තර්කයෙන් බැසගත නොහැක්ක. සියුම් ය. පණ්ඩිතයන් විසින් දැක්ක යුතු ය. මේ සත්ව සමූහයා (පඤ්චකාමගුණ නමැති) ආලයෙන් බැඳුනේ ය. ආලයෙහි ඇලුනේ ය. ආලයෙහි සතුටු විය. ආලයෙහි බැඳුන ආලයෙහි ඇලුනු ආලයෙහි සතුටු වූ මේ සත්ව සමූහයා විසින් ඉදප්පච්චයතා පටිච්චසමුප්පාද නම් වූ යම් මේ දහමෙක් වේ ද, එය දුකසේ දැක්ක යුතු ය. සියලු සංස්කාරයන්ගේ සංසිඳීම වූ සියලු උපධිධර්මයන්ගේ දුරලීම වූ තෘෂ්ණාව ක්ෂය කිරීම වූ විරාගය වූ නිරෝධය වූ යම් මේ නිවණෙක් වේ නම් මේ දහම ද දුකසේ දැක්ක යුතුය. මම ද දහම් දෙසන්නෙම් නම් පරහුදු මාගේ ධර්මය දැන නොගන්නාහු නම් ඒ මට කළකිරෙනු වෙයි. ඒ මට වෙහෙසෙක් වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තව ද භාග්‍යවතුන් වහන්සේට අනච්ඡරිය වූ (නැවත නැවත ආශ්චර්ය්‍යාවහ) පෙර නො ඇසූවිරූ මේ ගාථාවෝ වැටහුනහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මා විසින් දුකසේ අවබෝධ කරණ ලද ධර්මය දැන් පැවසීම නිෂ්ඵල ය. රාග ද්වේශයෙන් මැඩුනවුන් විසින් මේ දහම සුවසේ අවබෝධ නො කට හැක්ක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "රාගයෙන් රත් වූ මොහඳුරෙන් වැසුනු සත්වයෝ උඩුහොයට යන සියුම් ගැඹුරු දුකසේ දතයුතු ඉතා සියුම් මේ දහම නොදකිත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මෙසේ සලකන භාග්‍යවතුන් වහන්සේගේ සිත මන්දෝත්සාහයට, දහම් නො දෙසීමට නැමෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි තමසිතින් භාග්‍යවතුන් වහන්සේගේ සිත පිරිසිඳ දත් සහම්පති බඹහට මේ අදහස විය. යම් ලොවක තථාගත වූ අර්හත් වූ සම්මාසම්බුදුරජානන් වහන්සේගේ සිත මන්දෝත්සාහයට, දහම් නො දෙසීමට නැමේ ද, පින්වත්නි, ඒ ලොව ඒකාන්තයෙන් නැසේ. පින්වත්නි, ඒ ලොව ඒකාන්තයෙන් වැනසේ යි. ඉක්බිති සහම්පතී බ්‍රහ්ම තෙමේ යම්සේ බලවත් පුරුෂයෙක් හැකුළුෑ අත දුගු කරන්නේ හෝ, දිගු කළ අත හකුළුවන්නේ හෝ වේ ද, එසෙයින් ම බඹලොව අතුරුදන් වූයේ භාග්‍යවතුන් වහන්සේ ඉදිරියෙහි පහළ විය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 250,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො බ්රහ්මා සහම්පති එකංසං උත්තරාසඞ්ගං කරිත්වා දක්ඛිණජාණුමණ්ඩලං පඨවියං නිහන්ත්වා යෙන භගවා තෙනඤ්ජලිං පණාමෙත්වා භගවන්තං එතදවොච: “දෙසෙතු භන්තෙ භගවා ධම්මං දෙසෙතු සුගතො ධම්මං. සන්ති සත්තා අප්පරජක්ඛජාතිකා. අස්සවණතා ධම්මස්ස පරිහායන්ති. භවිස්සන්ති ධම්මස්ස අඤ්ඤාතාරො”ති. ඉදමවොච බ්රහ්මා සහම්පති. ඉදං වත්වා අථාපරං එතදවොච:"
                    },
                    {
                        "type": "gatha",
                        "text": "පාතුරහොසි මගධෙසු පුබ්බෙ ධම්මො අසුද්ධො සමලෙහි චින්තිතො,\nඅවාපුරෙතං{1} අමතස්ස ද්වාරං සුණන්තු ධම්මං විමලෙනානුබුද්ධං."
                    },
                    {
                        "type": "gatha",
                        "text": "සෙලෙ යථා පබ්බතමුද්ධනිට්ඨිතො යථාපි පස්සෙ ජනතං සමන්තතො,\nතථූපමං ධම්මමයං සුමෙධ පාසාදමාරුය්හ සමන්තචක්ඛු,\nසොකාවතිණ්ණං ජනතමපෙතසොකො අවෙක්ඛස්සු ජාතිජරාභිභූතන්ති."
                    },
                    {
                        "type": "gatha",
                        "text": "උට්ඨෙහි චීර විජිතසඞ්ගාම සත්ථවාහ අනණ විචර ලොකෙ,\nදෙසස්සු{2} භගවා ධම්මං අඤ්ඤාතාරො භවිස්සන්තීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා බ්රහ්මුනො ච අජ්ඣෙසනං විදිත්වා සත්තෙසු ච කාරුඤ්ඤතං පටිච්ච බුද්ධචක්ඛුනා ලොකං වොලොකෙසි. අද්දසා ඛො භගවා බුද්ධචක්ඛුනා ලොකං වොලොකෙන්තො සත්තෙ අප්පරජක්ඛෙ මහාරජක්ඛෙ තික්ඛින්ද්රියෙ මුදින්ද්රියෙ ස්වාකාරෙ ද්වාකාරෙ සුවිඤ්ඤාපයෙ දුවිඤ්ඤාපයෙ අප්පෙකච්චෙ පරලොකවජ්ජභයදස්සාවිනො විහරන්තෙ [අප්පෙකච්චෙ න පරලොකවජ්ජභයදස්සාවිනො{3} විහරන්තෙ]. සෙය්යථාපි නාම උප්පලිනියං වා පදුමිනියං වා පුණ්ඩරීකිනියං වා අප්පෙකච්චානි උප්පලානි වා පදුමානි වා පුණ්ඩරීකානි වා උදකෙ ජාතානි උදකෙ සංවද්ධානි උදකානුග්ගතානි{4} අන්තො නිමුග්ගපොසීනි. අප්පෙකච්චානි උප්පලානි වා පදුමානි වා පුණ්ඩරීකානි වා උදකෙ ජාතානි උදකෙ සංවද්ධානි සමොදකං ඨිතානි. අප්පෙකච්චානි උප්පලානි වා පදුමානි වා පුණ්ඩරීකානි වා උදකෙ ජාතානි උදකෙ සංවද්ධානි උදකා අච්චුග්ගම්ම ඨිතානි{5} අනුපලිත්තානි උදකෙන. එවමෙවං භගවා බුද්ධචක්ඛුනා ලොකං වොලොකෙන්තො අද්දස සත්තෙ අප්පරජක්ඛෙ මහාරජක්ඛෙ තික්ඛින්ද්රියෙ මුදින්ද්රියෙ ස්වාකාරෙ ද්වාකාරෙ සුවිඤ්ඤාපයෙ දුවිඤ්ඤාපයෙ අප්පෙකච්චෙ පරලොකවජ්ජභයදස්සාවිනො විහරන්තෙ [අප්පෙකච්චෙ න පරලොකවජ්ජභයදස්සාවිනො විහරන්තෙ]{6}. දිස්වාන බ්රහ්මානං සහම්පතිං ගාථාය පච්චභාසි:"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අපාපුරෙතං - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. දෙසෙතු - ස්යා. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. භයදස්සාවිනෙ - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. උදකානුගතානි - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. තිට්ඨන්ති - සීමු 2. ස්යා. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "6. [ - ] අන්තරිත පාඨො සීහලපොත්ථකෙසු න දිස්සතෙ."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ඉක්බිති සහම්පති බ්‍රහ්ම තෙමේ උතුරුසළුව එකස්කොට දකුණු දණමඬල බිම හැන භාග්‍යවතුන් වහන්සේ වෙත ඇඳිලි බැඳ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. “වහන්ස, භාග්‍යවතුන් වහන්සේ දහම් දෙසන සේක්වා. සුගතයන් වහන්සේ දහම් දෙසන සේක්වා. පැණැසෙහි මඳකෙලෙස් රජස් ඇති සත්වයෝ ඇත. දහම් නො අසනබැවින් ඔහු පිරිහෙත්. දහම් අවබෝධ කරනුවෝ වන්නාහ”යි සහම්පති බ්‍රහ්ම තෙමේ මෙය කී ය. මෙය කියා වැලිදු මෙය කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පෙර මගධදනව්වෙහි මල සහිතයන් විසින් සිතන ලද අශුද්ධධර්මයෙක් පහළ වි ය. මේ නිවන්දොර අරිණු මැනවි. නිර්මලයන් වහන්සේ විසින් අවබෝධ කරණ ලද ධර්මය අසත්වා!",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "සෙල්මුවා පවුමුදුනෙක්හි සිටියෙක් හාත්පස ජනසමූහයා යම්සේ දක්නේ ද. ප්‍රාඥයන් වහන්ස, සර්වඥ වූ පහ වූ ශෝක ඇති මුබවහන්සේ ද එබඳු දහම්මුවා පහයට නැග ජාතිජරාදුකෙන් වැඩුනු ශෝකයට බට ජනසමූහයා බලන සේක්වා!",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "දුනු ඇති වීරයන් වහන්ස, නැගී සිටිනු මැනව. අනෘණ සැහැවි ඇති සාර්ථවාහයන් වහන්ස, ලොව හැසිරෙණු මැනව. භාග්‍යවතුන් වහන්සේ දහම් දෙසන සේක්වා, අවබෝධ කරන්නෝ වන්නාහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ බඹහුගේ ඇරයුම් ද ලැබ සත්වයන් කෙරෙහි කරුණාවත් බවත් නිසා බුදුඇසින් ලොව බලා වදාළ සේක. භාග්‍යවතුන් වහන්සේ බුදුඇසින් ලොව බලන සේක් නුවණැස්හි මඳකෙලෙස් රජස් ඇති සත්වයන්ද බොහො කෙලෙස් රජස් ඇති සත්වයන් ද තියුණු (ශ්‍රද්ධා ආදී) ඉඳුරන් ඇති සත්වයන් ද මෘදු ඉඳුරන් ඇති සත්වයන්ද (ශ්‍රද්ධා ආදී) උතුම් ආකාර ඇති සත්වයන් ද නපුරු ආකාර ඇති සත්වයන් ද පහසුවෙන් අවබෝධ කරවිය හැකි සත්වයන් ද පහසුවෙන් අවබෝධ කරවිය නොහැකි සත්වයන් ද පරලොව හා වරද භය විසින් දක්නාසුලු ව වසන ඇතැම් සත්වයන් ද පරලොව හා වරද භය විසින් නො දක්නාසුලු ව වසන ඇතැම් සත්වයන් ද දැක වදාළ සේක. යම්සේ උපුල්බෙනෙක හෝ පියුමිළුයෙක හෝ හෙළපියුමිළුයෙක හෝ ඇතැම් උපුල්හු හෝ පියුම්හු හෝ හෙළපියුම් හෝ දියෙහි හටගත්තාහු දියෙහි වඩුනාහු දියෙන් මතු නොවූවාහු දිය ඇතුළත ගිලී වැඩෙන්නාහු වෙද්ද? ඇතැම් උපුල්හු හෝ පියුම්හු හෝ හෙළපියුම්හු හෝ දියෙහි හටගත්තාහු දියෙහි වඩුනාහු දිය මතුපිට සම ව සිටියාහු වෙද්ද, ඇතැම් උපුල්හු හෝ පියුම්හු හෝ හෙළපියුම්හු හෝ දියෙහි වැඩුනාහු දියෙන් උඩට නැගී දියෙන් නො තැවරුණාහු සිටිද් ද, එපරිද්දෙන් භාග්‍යවතුන් වහන්සේ බුදුඇසින් ලොව බලනසේක් අප්පරජක්ඛ සත්වයන් ද, මහාරජක්ඛ සත්වයන් ද, තික්ඛින්ද්‍රිය සත්වයන් ද, මුදින්ද්‍රිය සත්වයන් ද, ස්වාකාර සත්වයන් ද , ද්වාකාර සත්වයන් ද, සුවිඤ්ඤාපය සත්වයන් ද, දුවිඤ්ඤාපය සත්වයන් ද, පරලොකවජ්ජභයදස්සාවී ව වසන ඇතැම් සත්වයන් ද, පරලොකවජ්ජභයදස්සාවී නො ව වසන ඇතැම් සත්වයන් ද දැක වදාළ සේක. දැක සහම්පති බඹුහට ගාථායෙන් පෙරළා වදාළ සේක.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 252,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "අපාරුතා තෙසං{1} අමතස්ස ද්වාරා යෙ සොතවන්තො පමුඤ්චන්තු සද්ධං,\nවිහිංසසඤ්ඤී පගුණං න භාසිං ධම්මං පණීතං මනුජෙසු බ්රහ්මෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො බ්රහ්මා සහම්පති කතාවකාසො ඛොම්හි භගවතා ධම්මදෙසනායාති භගවන්තං අභිවාදෙත්වා පදක්ඛිණං කත්වා තත්ථෙවන්තරධායීති."
                    },
                    {
                        "type": "centered",
                        "text": "6. 1. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ගාරවසුත්තං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "173. එවං මෙ සුතං: එකං සමයං භගවා උරුවෙලායං විහරති නජ්ජා නෙරඤ්ජරාය තීරෙ අජපාලනිග්රොධමූලෙ{2} පඨමාභිසම්බුද්ධො."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවතො රහොගතස්ස පතිසල්ලීනස්ස එවං චෙතසො පරිවිතක්කො උදපාදි: දුක්ඛං ඛො අගාරවො විහරති අප්පතිස්සො. කන්නු ඛ්වාහං සමණං වා බ්රාහ්මණං වා සක්කත්වා ගරු කත්වා{3} උපනිස්සාය විහරෙය්යන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවතො එතදහොසි: අපරිපුණ්ණස්ස ඛො සීලක්ඛන්ධස්ස පාරිපූරියා අඤ්ඤං සමණං වා බ්රාහ්මණං වා සක්කත්වා ගරු කත්වා උපනිස්සාය විහරෙය්යං, න ඛො පනාහං පස්සාමි සදෙවකෙ ලොකෙ සමාරකෙ සබ්රහ්මකෙ, සස්සමණබ්රාහ්මණියා පජාය සදෙවමනුස්සාය අත්තනා සීලසම්පන්නතරං අඤ්ඤං සමණං වා බ්රාහ්මණං වා යමහං සක්කත්වා ගරු කත්වා{3} උපනිස්සාය විහරෙය්යන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අපරිපුණ්ණස්ස ඛො සමාධික්ඛන්ධස්ස පාරිපූරියා -පෙ- අත්තනා සමාධිසම්පන්නතරං අඤ්ඤං සමණං වා බ්රාහ්මණං වා, යමහං සක්කත්වා ගරු කත්වා{3} උපනිස්සාය විහරෙය්යන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අපරිපුණ්ණස්ස ඛො පඤ්ඤාක්ඛන්ධස්ස පාරිපූරියා -පෙ- අත්තනා පඤ්ඤාසම්පන්නතරං අඤ්ඤං සමණං වා බ්රාහ්මණං වා, යමහං සක්කත්වා ගරු කත්වා උපනිස්සාය විහරෙය්යන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අපරිපුණ්ණස්ස ඛො විමුත්තික්ඛන්ධස්ස පාරිපූරියා -පෙ- අත්තනා විමුත්තිසම්පන්නතරං අඤ්ඤං සමණං වා බ්රාහ්මණං වා, යමහං සක්කත්වා ගරු කත්වා උපනිස්සාය විහරෙය්යන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අපරිපුණ්ණස්ස ඛො විමුත්තිඤාණදස්සනක්ඛන්ධස්ස පාරිපූරියා{6} අඤ්ඤං සමණං වා බ්රාහ්මණං වා සක්කත්වා ගරු කත්වා{7} උපනිස්සාය විහරෙය්යං, න ඛො පනාහං පස්සාමි සදෙවකෙ ලොකෙ සමාරකෙ සබ්රහ්මකෙ සස්සමණබ්රාහ්මණියා පජාය සදෙවමනුස්සාය අත්තනා විමුත්තිඤාණදස්සනසම්පන්නතරං අඤ්ඤං සමණං වා බ්රාහ්මණං වා යමහං සක්කත්වා ගරු කත්වා{7} උපනිස්සාය විහරෙය්යං. යන්නූනාහං ය්වායං ධම්මො මයා අභිසම්බුද්ධො තමෙව ධම්මං සක්කත්වා ගරු කත්වා{7} උපනිස්සාය විහරෙය්යන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. තෙ - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. නිග්රොධෙ - සීමු. 1. ස්යා. PTS. සී 1, 2."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ගුරුං කත්වා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "6. පරිපූරියා - ආ."
                    },
                    {
                        "type": "footnote",
                        "text": "7. ගරුංකත්වා - සී 1."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ඔවුන්ට අමාදොර නොවැසින. යම් කෙනෙක් කන් ඇත්තාහු නම් ශ්‍රද්ධාව මුදත්වා. බ්‍රහ්මය, මිනිසුන් අතර වෙහෙසීම් පමණකැයි යන හැඟීම් ඇත්තෙම් ප්‍රගුණ වූ ප්‍රණීත ධර්මය නො කීයෙමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති සහම්පති බ්‍රහ්ම තෙමේ භාග්‍යවතුන් වහන්සේ විසින් ධර්මදේශනාව පිණිස කරණ ලද අවකාශ ඇත්තෙම් වෙමි යි භාග්‍යවතුන් වහන්සේ වැඳ පැදකුණු කොට එහි ම අතුරුදන් විය.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "6.1.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "ගාරව සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "173. මා විසින් මෙසේ අසන ලදී: එක්කලෙක භාග්‍යවතුන් වහන්සේ බුදුව පළමු කොට උරුවෙල්දනව්වෙහි නේරඤ්ජරා ගංතෙර අජපල් නුගරුකමුල වැඩ වසන සේක. ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි එකලා ව චිත්තවිවේකයෙන් හුන් භාග්‍යවතුන් වහන්සේට කිසිවකු ගුරුතන්හි නො තබා කිසිවකු දෙටු තන්හි නො තබා වසන්නේ දුකසේ වෙසෙයි. මම කවර මහණෙකු හෝ බමුණකු හෝ සත්කාර කොට ගුරු කොට ඇසුරු කොට වසන්නෙම් දැ යි මෙබඳු චිත්තවිතර්කයෙක් පහළ විය. ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති  භාග්‍යවතුන් වහන්සේට මේ අදහස විය. නොපිරිපුන් සීලක්ඛන්ධය පිරීම පිණිස අන් මහණකු හෝ බමුණකු හෝ සත්කාර කොට ගුරු කොට ඇසුරු කොට වසන්නෙම් ද, (එසේ) මම යමකු සත්කාර කොට ගුරු කොට ඇසුරු කොට වසන්නෙම් නම් තමහට වැඩිතරම් සීලසම්පන්න වූ එබඳු අන් මහණකු හෝ බමුණකු හෝ දෙවියන් සහිත මරුන් සහිත බඹුන් සහිත ලෝකයෙහි මහණ බමුණන් සහිත දෙවිමිනිසුන් සහිත ප්‍රජායෙහි මම නො දකිමි. ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "නො පිරිපුන් සමාධික්ඛන්ධය පිරීම පිණිස … මම යමකු සත්කාර කොට ගුරු කොට ඇසුරු කොට වසන්නෙම් නම් තමහට වැඩි තරම් සමාධි සම්පන්න වූ එබඳු අන් මහණකු හෝ බමුණකු හෝ …",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "නො පිරිපුන් පඤ්ඤාක්ඛන්ධය පිරීම පිණිස ... මම යමකු සත්කාර කොට ගුරු කොට ඇසුරු කොට වසන්නෙම් තමහට වැඩි තරම් ප්‍රඥා සම්පන්න වූ එබඳු අන් මහණකු හෝ බමුණකු හෝ …",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "නොපිරිපුන් විමුක්තිස්ඛන්ධය පුරාලීම පිණිස ... මම යමකු සත්කාර කොට ගුරු කොට ඇසුරු කොට වසන්නෙම් නම් තමහට වැඩිතරම් විමුක්තිසම්පන්න වූ අන් මහණකු හෝ බමුණකු හෝ …",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "නොපිරිපුන් විමුත්තිඤාණදස්සනක්ඛන්ධය පුරාලීම පිණිස අන් මහණකු හෝ බමුණකු හෝ සත්කාර කොට ගුරු කොට ඇසුරු කොට වෙසෙන්නෙම් (එසේ) මම යමකු සත්කාර කොට ගුරු කොට ඇසුරු කොට වසෙන්නෙම් නම් තමහට වැඩිතරම් විමුත්තිඤාණදස්සන සම්පන්න වූ එබඳු අන් මහණකු හෝ බමුණකු හෝ දෙවියන් සහිත මරුන් සහිත බඹුන් සහිත ලෝකයෙහි මහණ බමුණන් සහිත දෙවියන් සහිත ප්‍රජායෙහි මම නොදකිමි. යම් ඒ ධර්මයක් මා විසින් මනාකොට අවබෝධ කරණ ලද්දේ ද, ඒ ධර්මය ම සත්කාර කොට ගුරු කොට ඇසුරු කොට වෙසෙන්නෙම් නම් මැනවැ යි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 254,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො බ්රහ්මා සහම්පති භගවතො චෙතසා චෙතොපරිවිතක්කමඤ්ඤාය සෙය්යථාපි නාම බලවා පුරිසො සමිඤ්ජිතං වා බාහං පසාරෙය්ය, පසාරිතං වා බාහං සමිඤ්ජෙය්ය, එවමෙවං බ්රහ්මලොකෙ අන්තරහිතො භගවතො පුරතො පාතුරහොසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො බ්රහ්මා සහම්පති එකංසං උත්තරාසඞ්ගං කරිත්වා යෙන භගවා තෙනඤ්ජලිං පණාමෙත්වා භගවන්තං එතදවොච: එවමෙතං භගවා, එවමෙතං සුගත. යෙපි තෙ භන්තෙ අහෙසුං අතීතමද්ධානං අරහන්තො සම්මාසම්බුද්ධා තෙපි භගවන්තො ධම්මඤ්ඤෙව සක්කත්වා ගරු කත්වා උපනිස්සාය විහරිංසු. යෙපි තෙ භන්තෙ භවිස්සන්ති අනාගතමද්ධානං අරහන්තො සම්මාසම්බුද්ධා තෙපි භගවන්තො ධම්මඤ්ඤෙව සක්කත්වා ගරු කත්වා උපනිස්සාය විහරිස්සන්ති. භගවාපි භන්තෙ එතරහි අරහං සම්මාසම්බුද්ධො ධම්මඤ්ඤෙව සක්කත්වා ගරු කත්වා උපනිස්සාය විහරතූති. ඉදමවොච බ්රහ්මා සහම්පතී. ඉදං වත්වා අථාපරං එතදවොච:"
                    },
                    {
                        "type": "gatha",
                        "text": "යෙ චබ්භතීතා{1} සම්බුද්ධා යෙ ච බුද්ධා අනාගතා,\nයො චෙතරහි සම්බුද්ධො බහුන්නං{2} සොකනාසනො."
                    },
                    {
                        "type": "gatha",
                        "text": "සබ්බෙ සද්ධම්මගරුනො විහංසු{3} විහරන්ති ච,\nඅථොපි{4} විහරිස්සන්ති එසා බුද්ධාන ධම්මතා."
                    },
                    {
                        "type": "gatha",
                        "text": "තස්මා හි අත්ථකාමෙන{5} මහත්තමභිකඞ්ඛතා,\nසද්ධම්මො ගරුකාතබ්බො සරං බුද්ධානසාසනං."
                    },
                    {
                        "type": "centered",
                        "text": "6. 1. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බ්රහ්මදෙවසුත්තං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "174. එවං මෙ සුතං: එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තෙන ඛො පන සමයෙන අඤ්ඤතරිස්සා බ්රාහ්මණියා බ්රහ්මදෙවො නාම පුත්තො භගවතො සන්තිකෙ අගාරස්මා අනගාරියං පබ්බජිතො හොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා බ්රහ්මදෙවො එකො වූපකට්ඨො අප්පමත්තො ආතාපී පහිතත්තො විහරන්තො න චිරස්සෙව යස්සත්ථාය කුලපුත්තා සම්මදෙව අගාරස්මා අනගාරියං පබ්බජන්ති තදනුත්තරං බ්රහ්මචරියපරියොසානං දිට්ඨෙව ධම්මෙ සයං අභිඤ්ඤා සච්ඡිකත්වා උපසම්පජ්ජ විහාසි. ඛීණා ජාති වුසිතං බ්රහ්මචරියං කතං කරණීයං නාපරං ඉත්ථත්තායාති අබ්භඤ්ඤාසි. අඤ්ඤතරො ච පනායස්මා බ්රහ්මදෙවො අරහතං අහොසි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. යෙ ච අතීතා - මඡසං. ස්යා. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. බහූනං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. විහරිංසු - ස්යා. PTS. සී 1,2."
                    },
                    {
                        "type": "footnote",
                        "text": "4. අථාපි - ස්යා. තථාපි - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. අත්තකාමෙන - ස්යා. මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ඉක්බිති සහම්පති බ්‍රහ්ම තෙමේ තමසිතින් භාග්‍යවතුන් වහන්සේ චිත්තපරිවිතර්කය දැන යම්සේ බලවත් පුරුෂයෙක් හැකුළුෑ අත දිගු කරන්නේ හෝ, දිගු කළ ඇත හකුළුවන්නේ හෝ වේ ද, එසෙයින් ම බඹලොව අතුරුදහන් වූසේ භාග්‍යවතුන් වහන්සේ ඉදිරියෙහි පහළ විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති සහම්පති බ්‍රහ්ම තෙමේ උතුරුසළුව එක්ස් කොට භාග්‍යවතුන් වහන්සේ වෙත ඇඳිලි බැඳ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය: භාග්‍යවතුන් වහන්ස, තෙල එසේ ම ය. සුගතයන් වහන්ස, තෙල එසේ ම ය. වහන්ස, අතීත කාලයෙහි යම් ඒ අර්හත් සම්මාසම්බුදු කෙනෙක් වූ සේක නම් ඒ භාග්‍යවතුන් වහන්සේත් ධර්මය ම සත්කාර කොට ගුරු කොට ඇසුරු කොට විසූ සේක. වහන්ස, අනාගත කාලයෙහි යම් ඒ අර්හත් සම්මාසම්බුදු කෙනෙක් වන සේක් නම් ඒ භාග්‍යවතුන් වහන්සේත් ධර්මය ම සත්කාර කොට ගුරු කොට ඇසුරු කොට වෙසෙන සේක්වායි. සහම්පති බ්‍රහ්ම තෙමේ මෙය සැළ කළේ ය. මෙය සැළ කොට යලිත් මෙය ද කීය:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "අතීතකාලික වූ යම් සම්බුදු කෙනෙක් වූ සේක් ද, අනාගතකාලික වූ යම් සම්බුදු කෙනෙක් වන සේක් ද, බොහෝ දෙනාගේ ශෝකය නසන යම් සම්බුදු කෙනෙකුත් දැන් ඇත් ද,",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඒ සියලු බුදුරජානන් වහන්සේ ම සද්ධර්මය ම ගරු කොට ගත්තාහු විසූ සේක. දැන් වසන සේක. වැලිත් (මතු ද) වසන සේක. මේ බුදුවරුන්ගේ ස්වභාව යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එහෙයින් වැඩ කැමති මහත්බව පතන්නහු විසින් බුදුසසුන සිහි කරමින් සදහම ගුරු කටයුත්තේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "6.1.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බ්‍රහ්මදේව සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "174. මා විසින් මෙසේ අසන ලදී: එකකලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයෙහි ජේතවන නම් වූ අනේපිඬු සිටුහුගේ අරම්හි වැඩ වසන සේක. එකල්හි එක්තරා බැමිණියකගේ බ්‍රහ්මදේව නම් පුතෙක් ගිහිගෙන් නික්ම භාග්‍යවතුන් වහන්සේගේ සමීපයෙහි පැවිද්දට පැමිණියේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි ආයුෂ්මත් බ්‍රහ්මදේව තෙමේ එකලා ව ගණයා කෙරෙන් වෙන් ව නොපමා ව කෙලෙස් තවන වෙර ඇති ව නිවන් පිණිස මෙහෙයූ සිත් ඇති ව වසන්නේ යමක් පිණිස කුලපුත්‍රයෝ මැනවින් ම ගිහිගෙන් නික්ම පැවිද්දට පැමිණෙද්ද, සසුන බඹසරට අවසන් වූ ඒ නිරුත්තර රහත්ඵලය මේ අත්බැව්හි ම තෙමේ විශිෂ්ටඥානයෙන් දැන පසක් කොට පැමිණි විසී ය. ජාතිය ක්ෂීණ වූවා ය. මගබඹසර වැස නිමවන ලදී. සොළොස් කරණී කොට නිමවන ලදී. තෙල කරණි පිණිස නොහොත් රහත්බව පිණිස කළයුතු අන් කරණී නැතැයි වෙසෙසින් දැනගත්තේ ය. ආයුෂ්මත් බ්‍රහ්මදෙවයෝ රහතුන් අතුරෙන් එක්තරා කෙනෙක් වූහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 256,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා බ්රහ්මදෙවො පුබ්බන්හසමයං නිවාසෙත්වා පත්තචීවරමාදාය සාවත්ථිං පිණ්ඩාය පාවිසි. සාවත්ථියං සපදානං පිණ්ඩාය චරමානො යෙන සකමාතුනිවෙසනං තෙනුපසඞ්කමි. තෙන ඛො පන සමයෙන ආයස්මතො බ්රහ්මදෙවස්ස මාතා බ්රාහ්මණී බ්රහ්මුනො ආහුතිං නිච්චං පග්ගණ්හාති. අථ ඛො බ්රහ්මුනො සහම්පතිස්ස එතදහොසි: අයං ඛො ආයස්මතො බ්රහ්මදෙවස්ස මාතා බ්රාහ්මණී බ්රහ්මුනො ආහුතිං නිච්චං පග්ගණ්හාති. යන්නූනාහං තං උපසඞ්කමිත්වා සංවෙජෙය්යන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො බ්රහ්මා සහම්පති සෙය්යථාපි නාම බලවා පුරිසො සමිඤ්ජිතං වා බාහං පසාරෙය්ය පසාරිතං වා බාහං සමිඤ්ජෙය්ය. එවමෙවං බ්රහ්මලොකෙ අන්තරහිතො ආයස්මතො බ්රහ්මදෙවස්ස මාතුනිවෙසනෙ පාතුරහොසි. අථ ඛො බ්රහ්මා සහම්පති වෙහාසං ඨිතො ආයස්මතො බ්රහ්මදෙවස්ස මාතරං බ්රාහ්මණිං ගාථාය අජ්ඣභාසි:"
                    },
                    {
                        "type": "gatha",
                        "text": "දූරෙ ඉතො බ්රාහ්මණි බ්රහ්මලොකො යස්සාහුතිං පග්ගණ්හාසි නිච්චං,\nනෙතාදිසො බ්රාහ්මණි බ්රහ්මභක්ඛො කිං ජප්පසි බ්රහ්මපථං අජානන්තී{1}"
                    },
                    {
                        "type": "gatha",
                        "text": "එසො හි තෙ බ්රාහ්මණි බ්රහ්මදෙවො නිරුපධිකො{2} අතිදෙවප්පත්තො,\nඅකිඤ්චනො භික්ඛු අනඤ්ඤපොසී{3} යො තෙ සො පිණ්ඩාය ඝරං පවිට්ඨො."
                    },
                    {
                        "type": "gatha",
                        "text": "ආහුනෙය්යො{4} වෙදගු භාවිතත්තො නරානං දෙවානඤ්ච{5} දක්ඛිණෙය්යො,\nබාහිත්වා පාපානි අනූපලිත්තො{6} ඝාසෙසනං ඉරීයති{7} සීතිභූතො."
                    },
                    {
                        "type": "gatha",
                        "text": "න තස්ස පච්ඡා න පුරත්ථමත්ථි සන්තො විධූමො අනිඝො නිරාසො,\nනික්ඛිත්තදණ්ඩො තසථාවරෙසු සො ත්යාහුතිං භුඤ්ජතු අග්ගපිණ්ඩං."
                    },
                    {
                        "type": "paragraph",
                        "text": "විසෙනිභූතො උපසන්තචිත්තො නාගොව දන්තො චරති අනෙජො,\nභික්ඛූ සුසීලො සුවිමුත්තචිත්තො සොත්යාහුතිං භුඤ්ජතු අග්ගපිණ්ඩං."
                    },
                    {
                        "type": "gatha",
                        "text": "තස්මිං පසන්නා අවිකම්පමානා පතිට්ඨපෙසි දක්ඛිණං දක්ඛිණෙය්යෙ,\nකරොහි පුඤ්ඤං සුඛමායතිකං දිස්වා මුනිං බ්රාහ්මණි ඔඝතිණ්ණන්ති."
                    },
                    {
                        "type": "gatha",
                        "text": "තස්මිං පසන්නා අවිකම්පමානා පතිට්ඨපෙසි දක්ඛිණං දක්ඛිණෙය්යෙ,\nඅකාසි පුඤ්ඤං සුඛමායතිකං දිස්වා මුනිං බ්රාහ්මණී ඔඝතිණ්ණන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. අජානං - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. නිරූපධිකො - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අනඤ්ඤපොසියො - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "4. ආහුනියො - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. දෙවාන ච - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "6. අනූපලිත්තො - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "7. ඉරියති - සීමු 2."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ආයුෂ්මත් බ්‍රහ්මදදේව තෙමේ පෙරවරු හැඳ පෙරව පාසිවුරු ගෙණ සැවැත්නුවරට පිඬු පිණිස පිවිසියේ ය. සැවැත්නුවර ගෙපිළිවෙළින් පිඬු පිණිස හැසිරෙන්නේ සිය මවුනිවස වෙත එළඹියේ ය. එකල්හි ආයුෂ්මත් බ්‍රහ්මදේව තෙරුන්ගේ මවු බැමිණි තොමෝ බඹහට නිරන්තරයෙන් හෝමපූජා කෙරෙයි. එකල්හි සහම්පති බඹහට ආයුෂ්මත් බ්‍රහ්මදේව තෙරුන්ගේ මේ මවුබැමිණි තොමෝ නිරන්තරයෙන් බඹහට හෝමපූජා කෙරෙයි. මම ඇය වෙත එළඹ සංවේග දනවන්නෙම් නම් යෙහෙකැයි මේ සිත විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති සහම්පති බ්‍රහ්ම තෙමේ යම්සේ බලවත් පුරුෂයෙක් හැකුළු අත දිගු කරන්නේ හෝ, දිගු කළ අත හකුළුවන්නේ හෝ වේ ද, එපරිද්දෙන් ම බඹලොව අතුරුදන් වූ යේ ආයුෂ්මත් බ්‍රහ්මදදේව තෙරුන්ගේ මවු නිවසෙහි පහළ විය. ඉක්බිති සහම්පති බ්‍රහ්ම තෙමේ අහසෙහි සිටියේ ආයුෂ්මත් ආයුෂ්මත් බ්‍රහ්මදදේව තෙරුන්ගේ මවු බැමිණියට ගාථාවන්ගෙන් කීය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බැමිණිය, යම් බඹකුට නිතර හෝම කිරීම දැඩි කොට ගණිහි ද, (ඔහුගේ ඒ) බඹලොව මෙයින් දුරය. මෙබඳු පායාසයන් බ්‍රහ්මයන් විසින් අනුභව කළ යුත්තෙක් නො වේ. බ්‍රහ්මපථය නො දන්නී කිම නන් දොඩවහි ද?",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බැමිණිය, තිගේ (පුත් වූ) මේ බ්‍රහ්මදේව තෙරණුවෝ උපධි රහිතයහ. දේවාතිදේව භාවයට පැමිණියහ. රාගාදි පලිබෝධ රහිතයහ (තෙල අත්බව පියා) අන් අත්බැවක් හෝ අඹුදරුවන් හෝ පෝෂණය නො කරන්නෙකි. ඒ රහතුන් වහන්සේ තිගේ ගෙට පිඬු පිණිස පිවිස සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "(ඒ රහත් තෙමේ) ආහුනපිණ්ඩය හා පාහුන පිණ්ඩය ද පිළිගැණීමට සුදුසු ය. චතුර්මාර්ග සංඛ්‍යාත වේදයෙහි කෙළවරට පැමිණියේ ය. වඩන ලද සිත් ඇත්තේ ය. මිනිසුන්ගේ ද දෙවියන්ගේ ද දක්ෂිණාවට සුදුසු ය. පව් බැහැර කොට නො තැවරුණේ සිහිල් වූයේ අහර සෙවීම කෙරෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "උන්වහන්සේට අතීත ස්කන්ධයන්හි ද ඡන්දරාගයෙක් නැත. අනාගත ස්කන්ධයන්හි ද ඡන්දරාගයෙක් නැත. ශාන්තය. ක්‍රොධදුම් රහිත ය. දුක් රහිත ය. ආශා නැත. අස්ථිර ස්ථිර සත්වයන් (පෘථග්ජන ක්ෂීණාස්‍රවයන්) කෙරෙහි බහා තැබූ දඬු ඇතීයෙක. හෙ තෙමේ තිගේ ආහුති සඞ්ඛ්‍යාත අග්‍ර පිණ්ඩය වළදාවා.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ක්ලේශසේනා රහිත වූයේ මොනවට සන්හුන් සිත් ඇත්තේ දැමුනු හස්තියකු මෙන් හැසිරෙයි. තෘෂ්ණා නැති මනාසිල් ඇති මැනවින් මිදුනු සිත් ඇති ඒ රහත් තෙමේ තීගේ ආහුති සඞ්ඛ්‍යාත අග්‍ර පිණ්ඩය වළදාවා.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බැමිණිය, පහන්සිත් ඇති ව අචලශ්‍රද්ධා ඇතිව දක්ෂිණාර්හ වූ උන්වහන්සේ කෙරෙහි දක්ෂිණාව පිහිටුව. චතුරෝඝ තරණය කළ ඒ රහතුන් වහන්සේ දැක මතු සැප එළවන පින් කරව.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඒ බැමිණි තොමෝ උන්වහන්සේ කෙරෙහි පහන්සිත් ඇති ව අචලශ්‍රද්ධා ඇතිව දක්ෂිණාවට සුදුසු වූ උන්වහන්සේ කෙරෙහි දක්ෂිණාව පිහිටුවාලූ ය. චතුරෝඝතරණය කළ ඒ රහතුන් වහන්සේ දැක මතු සැප එළවන පින් කළා ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 258,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "6. 1. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බකබ්රහ්මසුත්තං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "175. එවං මෙ සුතං: එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තෙන ඛො පන සමයෙන බකස්ස බ්රහ්මුනො එවරූපං පාපකං දිට්ඨිගතං උප්පන්නං හොති: ඉදං නිච්චං, ඉදං ධුවං, ඉදං සස්සතං, ඉදං කෙවලං, ඉදං අචවනධම්මං. ඉදං හි න ජායති න ජීයති න මීයති න චවති න උපපජ්ජති. ඉතො ච පනඤ්ඤං උත්තරිං නිස්සරණං{1} නත්ථිති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා බකස්ස බ්රහ්මුනො චෙතසා චෙතොපරිවිතක්කමඤ්ඤාය සෙය්යථාපි නාම බලවා පුරිසො සමිඤ්ජිතං වා බාහං පසාරෙය්ය පසාරිතං වා බාහං සම්මිඤ්ජෙය්ය, එවමෙව ජෙතවනෙ අන්තරහිතො තස්මිං බ්රහ්මලොකෙ පාතුරහොසි. අද්දසා ඛො බකො බ්රහ්මා භගවන්තං දූරතොව ආගච්ඡන්තං. දිස්වාන භගවන්තං එතදවොච: එහි ඛො මාරිස. ස්වාගතං තෙ මාරිස. චිරස්සං ඛො මාරිස ඉමං පරියාය මකාසි යදිදං ඉධාගමනාය. ඉදං හි මාරිස නිච්චං, ඉදං ධුවං, ඉදං සස්සතං, ඉදං කෙවලං, ඉදං අචවනධම්මං, ඉදං හි න ජායති න ජීයති න මීයති න චවති න උපපජ්ජති. ඉතො ච පනඤ්ඤං උත්තරිං නිස්සරණං නත්ථීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං වුත්තෙ භගවා බකබ්රහ්මානං ඉදමවොච{2}: අවිජ්ජාගතො වත භො බකො බ්රහ්මා, අවිජ්ජාගතො වත භො බකො බ්රහ්මා. යත්ර හි නාම අනිච්චඤ්ඤෙව{3} සමානං නිච්චන්ති වක්ඛති. අද්ධුවඤ්ඤෙව සමානං ධුවන්ති වක්ඛති. අසස්සතඤ්ඤෙව සමානං සස්සතන්ති වක්ඛති. අකෙවලඤ්ඤෙව සමානං කෙවලන්ති වක්ඛති. චවනධම්මඤ්ඤෙව සමානං අචවනධම්මන්ති වක්ඛති. යත්ථ ච පන ජායති ච ජීයති ච මීයති ච චවති ච උපපජ්ජති{4} ච. තඤ්ච තථා වක්ඛති: ඉදං හි න ජායති න ජීයති න මීයති න චවති න උපපජ්ජති. සන්තඤ්ච පනඤ්ඤං උත්තරිං නිස්සරණං, නත්ථඤ්ඤං උත්තරිං නිස්සරණන්ති වක්ඛතීති."
                    },
                    {
                        "type": "unindented",
                        "text": "[බකො බ්රහ්මා:]"
                    },
                    {
                        "type": "gatha",
                        "text": "ද්වාසත්තති ගොතම පුඤ්ඤකම්මා වසවත්තිනො ජාතිජරං අතීතා,\nඅයමන්තිමා වෙදගූ බ්රහ්මුපපත්ති අස්මාභිජප්පන්ති ජනා අනෙකාති."
                    },
                    {
                        "type": "unindented",
                        "text": "[භගවා:]"
                    },
                    {
                        "type": "gatha",
                        "text": "අප්පං හි එතං න හි දීඝමායු යං ත්වං බක මඤ්ඤසි දීඝමායුං.\nසතං සහස්සානං නිරබ්බුදානං ආයුං{5} පජානාමි තවාහං බ්රහ්මෙති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උත්තරි නිස්සරණං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. එතදවොච - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අධුවඤ්ඤෙව - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. උපපජ්ජති - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. ආයු - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "6.1.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "බකබ්‍රහ්ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "175. මා විසින් මෙසේ අසන ලදී: එක්කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයෙහි ජේතවන නම් වූ අනේපිඬුසිටුහුගේ අරම්හි වැඩවසන සේක. එකල්හි බක බ්‍රහ්මයාහට “මෙය (බ්‍රහ්මස්ථානය) නිත්‍ය ය. මෙය ස්ථිරය, මෙය ශාශ්වත ය. මෙය කේවලය. මෙය ව්‍යුත නො වන ස්වභාව ඇත්තේ ය. මෙය නූපදී යි. නො දිරයි. නො මියෙයි. ව්‍යුත නො වේ. නො හටගණී. මෙයින් මතු අන් නිස්සරණයෙක් නැතැ”යි මෙබඳු ලාමක මිථ්‍යාදෘෂ්ටියෙක් උපන.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි භාග්‍යවතුන් වහන්සේ තමසිතින් බකබඹුහුගේ චිත්තපරිවිතර්කය දැන යම්සේ බලවත් පුරුෂයෙක් හැකුළුෑ අත දිගු කරන්නේ හෝ වේ ද, දිගු කළ අත හකුළුවන්නේ හෝ වේ ද, එසෙයින් ම දෙව්රම්හි අතුරුදන් වූසේක් ඒ බඹලොව පහළ වූ සේක. බකබ්‍රහ්ම තෙමේ එන්නාවූ භාග්‍යවතුන් වහන්සේ දුරදී ම දැක්කේ ය. දැක භාග්‍යවතුන් වහන්සේට තෙල කී ය: “නිදුකානෙනි, එනු මැනව. නිදුකානෙනි, මුබට ස්වාගත වේවා. නිදුකානෙනි, මෙහි පැමිණීම පිණිස බොහෝ කලෙකින් මේ පර්යාය කෙළෙහි ය. නිදුකානෙනි, මෙය නිත්‍ය ය. මෙය ස්ථිරය, මෙය ශාශ්වත ය. මෙය කෙවලය. මෙය ව්‍යුත නොවන ස්වභාවය ඇත්තේ ය, මෙය නූපදී. නො දිරයි. නො මියේ, ව්‍යුත නො වේ, නො හටගණී. මෙයින් මතු අනික් නිස්සරණයෙක් නැතැයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මෙසේ කීකල්හි භාග්‍යවතුන් වහන්සේ  බක බඹහට මෙය වදාළ සේක: “යමෙක් නම් අනිත්‍ය වූවක් ම නිත්‍ය යයි කියා ද, අස්ථිර වූවක් ම ස්ථිර යයි කියා ද, අශාශ්වත වූවක් ම ශාශ්වත යයි කියා ද, ඛණ්ඩ වූවක් ම අඛණ්ඩ යයි කියා ද, ච්‍යුතවන ස්වභාවා ඇත්තක් ම ච්‍යුත නො වන ස්වභාව ඇත්තෙකැයි කියා ද, යමක් හටගණීද, දිරා ද, මියේ ද, ච්‍යුත වේ ද, නො හටගණී ද, එයත් මෙය නූපදී, නො දිරයි, නො මියෙයි, ච්‍යුත නො වෙයි, නො හටගණීයයි එසේ කියා ද, ඇත්තා වූ ම මත්තෙහි වූ අනෙක් නිස්සරණයෙක් වේ ද, (එසේ වතුදු) මතු අනෙක් නිස්සරණයෙක් නැතැයි කියා ද පින්වත්නි, ඒ බකබ්‍රහ්ම තෙමේ ඒකාන්තයෙන් අවිද්‍යාවෙන් අන්ධ වූයේ ය. පින්වත්නි, ඒ බකබ්‍රහ්ම තෙමේ ඒකාන්තයෙන් අවිද්‍යාවෙන් අන්ධ වූයේ ය\"යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[බක බ්‍රහ්ම:]",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "ගෞතමයෙනි, (අපි) දෙසැත්තෑදෙනෙක් (කළ) පින්කම් ඇත්තමෝ ජාතිය හා ජරාව හා ඉක්ම වූම්හ. අනුන් තමන් විසිය ලා වැටෙම්හ. වෙදසඞ්ඛාත ඥානයෙහි කෙළවරට පැමිණියම්හ. මේ අන්තිම බ්‍රහ්මලෝකෝත්පත්ති යයි නොයෙක් ජනයෝ අප ප්‍රාර්ථනා කෙරෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[භගවත්හු:]",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "බකබ්‍රහ්මය, තෝ යම් දීර්ඝායුෂයක් සිතයි ද, තෙල දීර්ඝායුෂයෙක් නො වේ. තගේ (ඉතිරි වූ) ආයුෂ නිරබ්බුද ලක්ෂයෙකැ යි මම දනිමි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 260,
            "pali": {
                "entries": [
                    {
                        "type": "unindented",
                        "text": "[බකො බ්රහ්මා:]"
                    },
                    {
                        "type": "gatha",
                        "text": "අනන්තදස්සී භගවාහමස්මි ජාතිජරං සොකමුපාතිවත්තො,\nකිං මෙ පුරාණං වත සීලවත්තං ආචික්ඛ මෙතං යමහං විජඤ්ඤාති."
                    },
                    {
                        "type": "unindented",
                        "text": "[භගවා:]"
                    },
                    {
                        "type": "gatha",
                        "text": "යං ත්වං අපායෙසි බහූ මනුස්සෙ පිපාසිතෙ ඝම්මනි සම්පරෙතෙ,\nතං තෙ පුරාණං වතසීලවත්තං සුත්තප්පබුද්ධොව අනුස්සරාමි."
                    },
                    {
                        "type": "gatha",
                        "text": "යං එණිකූලස්මිං ජනං ගහීතං අමොචයී ගය්හකං නීයමානං,\nතං තෙ පුරාණං වතසීලවත්තං සුත්තප්පබුද්ධොව අනුස්සරාමි."
                    },
                    {
                        "type": "gatha",
                        "text": "ගඞ්ගාය සොතස්මිං ගහීතනාවං ලුද්දෙන නාගෙන මනුස්සකම්යා,\nපමොචයිත්ථ{1} බලසා පසය්හ තං තෙ පුරාණං වතසීලවත්තං\nසුත්තප්පබුද්ධොව අනුස්සරාමි."
                    },
                    {
                        "type": "gatha",
                        "text": "කප්පො ච තෙ බද්ධචරො අහොසිං සම්බුද්ධිමන්තං{2} වතිනං අමඤ්ඤිං{3}\nතං තෙ පුරාණං වතසීලවත්තං සුත්තප්පබුද්ධොව අනුස්සරාමීති."
                    },
                    {
                        "type": "unindented",
                        "text": "[බකො බ්රහ්මා:]"
                    },
                    {
                        "type": "gatha",
                        "text": "අද්ධා පජානාසි මමෙතමායුං අඤ්ඤම්පි{4} ජානාසි තථා හි බුද්ධො,\nතථා හි ත්යායං ජලිතානුභාවො ඔභාසයං තිට්ඨති බ්රහ්මලොකන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "6. 1. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අපරාදිට්ඨිසුත්තං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "176. එවං මෙ සුතං: එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තෙන ඛො පන සමයෙන අඤ්ඤතරස්ස බ්රහ්මුනො එවරූපං පාපකං දිට්ඨිගතං උප්පන්නං හොති. නත්ථි සො සමණො වා බ්රාහ්මණො වා යො ඉධ ආගච්ඡෙය්යාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා තස්ස බ්රහ්මුනො චෙතසා චෙතොපරිවිතක්ක මඤ්ඤාය සෙය්යථාපි නාම බලවා පුරිසො සමිඤ්ජිතං වා බාහං පසාරෙය්ය පසාරිතං වා බාහං සමිඤ්ජෙය්ය එවමෙව ජෙතවනෙ අන්තරහිතො තස්මිං බ්රහ්මලොකෙ පාතුරහොසි. අථ ඛො භගවා තස්ස බ්රහ්මුනො උපරි වෙහාසං පල්ලඞ්කෙන නිසීදි තෙජොධාතුං සමාපජ්ජිත්වා."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පටචරො - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සම්බුද්ධිවන්තං - සීමු. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අමඤ්ඤී - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. අඤ්ඤෙපි - මඡසං. ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "[බක බ්‍රහ්ම:]",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවත්නි, (තෙපි) මම අනන්තදර්ශී වෙමි යි, ජාතිය හා ජරාව ද, ශෝකය ද ඉක්ම සිටියෙම් වෙමියි (කියව). මාගේ පුරාතන කර්මය කිම, ව්‍රතසමාදානය කිම? ශීලය කිම? යමක් (තොප අතින් අසා) මම දන්නෙම් නම් එය මට කියනු මැනව.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[භගවත්හු:]",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "ග්‍රීෂ්මකාලයෙහි පීඩිත පිපාසිත වූ බොහෝ මිනිසුන්ට තෝ යම් හෙයෙකින් පැන් පෙවූයෙහි ද, තාගේ ඒ පුරාතන වූ ව්‍රතය හා ශීලය හා නිදා පිබිදියයක්හු මෙන් (මම) සිහි කරමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ගංඉවුරෙහි (සොරුන් විසින්) අල්ලා ගන්නා ලද අත්පා බැඳ ගෙණ යනු ලබන ජනයා යම් හෙයෙකින් මිදී ද, තාගේ ඒ පුරාතන වූ ව්‍රතය හා ශීලය නිදා පිබිදියක්හු මෙන් (මම) සිහි කරමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මිනිසුන් නසනු කැමැත්තෙන් රෞද්‍ර වූ නාගයා විසින් ගඟ සළා මැද දී ගන්න ලද නැව බලහත්කාරයෙන් මැඩ මිදුවෙහි ය. ඒ පුරාතන වූ තාගේ ව්‍රතය හා ශීලය නිදා පිබිදියකු මෙන් සිහි කරමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තට කප්ප නම් අතවැස්සෙකිම් වීමි. (ඒ තා) නුවණැත්තකු කොට ද ව්‍රතසම්පන්නයකු කොට ද (මම) සිතුවෙමි. ඒ පුරාතන වූ තාගේ ව්‍රතය හා ශීලය නිදා පිබිදියකු මෙන් සිහි කරමි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "[බක බ්‍රහ්ම:]",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "මාගේ මේ ආයුෂය ඒකාන්තයෙන් දනිහි, සෙස්ස ද දනිහි, එහෙයින් (මුබ) බුද්ධ වව. එහෙයින් ම මුබගේ මේ දෙලියෙන අනුභාවය මුළුබඹලොව බබුලුවමින් සිටී.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "6.1.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අපරාදිට්ඨි සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "176. මා විසින් මෙසේ අසන ලදී. එක්කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයෙහි ජේතවන නම් වූ අනේපිඬු මහසිටුහුගේ අරම්හි වැඩවසන සේක. එකල්හි එක්තරා බඹකුට යමෙක් මෙහි පැමිණෙන්නේ නම් එබඳු මහණෙක් හෝ බමුණෙක් හෝ නැතැයි මෙබඳු ලාමක මිථ්‍යාදෘෂ්ටියෙක් උපන්නේ වෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි භාග්‍යවතුන් වහන්සේ ඒ බඹහුගේ චිත්තපරිවිතර්කය (තම) සිතින් දැන යම්සේ බලවත් පුරුෂයෙක් හැකුළුෑ අතක් දිගු කරන්නේ හෝ වේ ද, දිගු කළ අතක් හකුළුවන්නේ හෝ වේ ද, එපරිද්දෙන් දෙව්රම්හි අතුරුදන් වූ සේක් ඒ බඹලොව්හි පහළ වූ සේක. එකල්හි භාග්‍යවතුන් වහන්සේ තේජෝධාතූ සමවතට සමවැද ඒ බඹහුගේ මත්තෙහි අහස පලක් බැඳ වැඩ හුන් සේක.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 262,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මතො මහාමොග්ගල්ලානස්ස එතදහොසි: කහං නු ඛො භගවා එතරහි විහරතීති. අද්දසා ඛො ආයස්මා මහාමොග්ගල්ලානො භගවන්තං දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන තස්ස බ්රහ්මුනො උපරිවෙහාසං පල්ලඞ්කෙන නිසින්නං තෙජොධාතුං සමාපන්නං. දිස්වාන සෙය්යථාපි නාම බලවා පුරිසො සම්මිඤ්ජිතං වා බාහං පසාරෙය්ය, පසාරිතං වා බාහං සම්මිඤ්ජෙය්ය, එවමෙව ජෙතවනෙ අන්තරහිතො තස්මිං බ්රහ්මලොකෙ පාතුරහොසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා මහාමොග්ගල්ලානො පුරත්ථිමං දිසං නිස්සාය{1} තස්ස බ්රහ්මුනො උපරිවෙහාසං පල්ලඞ්කෙන නිසීදි, තෙජොධාතුං සමාපජ්ජිත්වා නීචතරං භගවතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මතො මහාකස්සපස්ස එතදහොසි: කහං නු ඛො භගවා එතරහි විහරතීති. අද්දසා ඛො ආයස්මා මහාකස්සපො භගවන්තං දිබ්බෙන චක්ඛුනා විසුද්ධෙන අතික්කන්තමානුසකෙන තස්ස බ්රහ්මුනො උපරිවෙහාසං ඵල්ලඞ්කෙන නිසින්නං තෙජොධාතුං සමාපන්නං. දිස්වාන සෙය්යථාපි නාම බලවා පුරිසො සම්මිඤ්ජිතං වා බාහං පසාරෙය්ය, පසාරිතං වා බාහං සම්මිඤ්ජෙය්ය, එවමෙව ජෙතවනෙ අන්තරහිතො තස්මිං බ්රහ්මලොකෙ පාතුරහොසි. අථ ඛො ආයස්මා මහාකස්සපො දක්ඛිණං දිසං නිස්සාය තස්ස බ්රහ්මුනො උපරිවෙහාසං පල්ලඞ්කෙන නිසීදි, තෙජොධාතුං සමාපජ්ජිත්වා නීචතරං භගවතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මතො මහාකප්පිනස්ස එතදහොසි: කහං නු ඛො භගවා එතරහි විහරතීති. අද්දසා ඛො ආයස්මා මහාකප්පිනො භගවන්තං දිබ්බෙන චක්ඛුනා -පෙ- බ්රහ්මුනො උපරිවෙහාසං පල්ලඞ්කෙන නිසින්නං තෙජොධාතුං සමාපන්නං. දිස්වාන සෙය්යථාපි නාම බලවා පුරිසො -පෙ- එවමෙව ජෙතවනෙ අන්තරහිතො තස්මිං බ්රහ්මලොකෙ පාතුරහොසි. අථ ඛො ආයස්මා මහාකප්පිනො පච්ඡිමං දිසං නිස්සාය තස්ස බ්රහ්මුනො උපරිවෙහාසං පල්ලඞ්කෙන නිසීදි, තෙජොධාතුං සමාපජ්ජිත්වා නීචතරං භගවතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මතො අනුරුද්ධස්ස එතදහොසි: කහං නු ඛො භගවා එතරහි විහරතීති. අද්දසා ඛො ආයස්මා අනුරුද්ධො භගවන්තං දිබ්බෙන -පෙ- අථ ඛො ආයස්මා අනුරුද්ධො උත්තරං දිසං නිස්සාය තස්ස බ්රහ්මුනො උපරිවෙහාසං පල්ලඞ්කෙන නිසීදි, තෙජොධාතුං සමාපජ්ජිත්වා නීචතරං භගවතො."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා මහාමොග්ගල්ලානො තං බ්රහ්මානං ගාථාය අජ්ඣභාසි:"
                    },
                    {
                        "type": "gatha",
                        "text": "අජ්ජාපි තෙ ආවුසො සා දිට්ඨි යා තෙ දිට්ඨි පුරෙ අහු,\nපස්සසි වීතිවත්තන්තං බ්රහ්මලොකෙ පභස්සරන්ති.{2}"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උපනිස්සාය - සීමු."
                    },
                    {
                        "type": "footnote",
                        "text": "2. පරායන්ති - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ඉක්බිති ආයුෂ්මත් මහමුගලන් තෙරුන්ට භාග්‍යවතුන් වහන්සේ දැන් කොහි වැඩවසන සේක් දැයි මේ සිත විය.  ආයුෂ්මත් මහමුගලන් තෙරනුවෝ ඒ බඹහුගේ මත්තෙහි අහස තේජෝධාතු සමවතට සමවැද පලඟින් වැඩ හුන් භාග්‍යවතුන් වහන්සේ මිනිසැස ඉක්මවා පැවැති පිරිසිදු දිවැසින් දුටුහ. දැක යම්සේ බලවත් පුරුෂයෙක් හැකුළුෑ අතක් දිගු කරන්නේ හෝ වේ ද; දිගු කළ අතක් හකුළුවන්නේ හෝ වේ ද, එපරිද්දෙන් දෙව්රම්හි අතුරුදන් වූවාහු ඒ බඹලොව පහළ වූහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති ආයුෂ්මත් මහමුගලන් තෙරනුවෝ තේජෝධාතු සමවතට සමවැද පෙරදිග ඇසුරු කොට, භාග්‍යවතුන් වහන්සේ යටත්සේ ඒ බඹහුගේ මත්තෙහි පලඟින් වැඩ හුන්හ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති ආයුෂ්මත් මහාකස්සප තෙරනුවන්ට භාග්‍යවතුන් වහන්සේ දැන් කොහි වැඩවසන සේක් දැයි මේ සිත විය. ආයුෂ්මත් මහාකස්සප තෙරනුවෝ තේජෝධාතු සමවතට සමවැද ඒ බඹහුගේ මත්තෙහි අහස පර්යඞ්කයෙන් වැඩහුන් භාග්‍යවතුන් වහන්සේ මිනිසැස ඉක්මවා පැවැති පිරිසිදු දිවැසින් දුටුහ. දැක යම් සේ බලවත් පුරුෂයෙක් හැකුළුෑ අතක් දිගු කරන්නේ හෝ වේ ද, දිගු කළ අතක් හකුළුවන්නේ හෝ වේ ද, එපරිද්දෙන් දෙව්රම්හි අතුරුදන් වූවාහු ඒ බඹලොව පහළ වූහ. එකල්හි ආයුෂ්මත් මහසුප් තෙරුනුවෝ දකුණු දිග ඇසුරු කොට, භාග්‍යවතුන් වහන්සේ යටත්සේ ඒ බඹහුගේ මත්තෙහි අහස තේජෝධාතු සමවතට සමවැද පර්යඞ්කයෙන් වැඩ හුන්හ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති ආයුෂ්මත් මහාකප්පීන තෙරුන්ට භාග්‍යවතුන් වහන්සේ දැන් කොහි වැඩවසන සේක් දැයි මේ සිත විය. ආයුෂ්මත් මහාකප්පින තෙරනුවෝ තේජෝධාතු සමවතට සමවැද ඒ බඹහුගේ මත්තෙහි අහස පලඟින් වැඩහුන් භාග්‍යවතුන් වහන්සේ … දිවසින් දුටුහ. දැක යම්සේ බලවත් පුරුෂයෙක් ... එපරිද්දෙන් දෙව්රම්හි අතුරුදන් වූවාහු ඒ බඹලොව පහළ වූහ. ඉක්බිති ආයුෂ්මත් මහාකප්පින තෙරනුවෝ පැසුලු දිග ඇසුරු කොට, භාග්‍යවතුන් වහන්සේට යටත්සේ ඒ බඹහුගේ මත්තෙහි අහස තේජෝධාතුවට සමවැද පලඟින් වැඩ හුන්හ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති ආයුෂ්මත් අනුරුද්ධ තෙරුන්ට භාග්‍යවතුන් වහන්සේ දැන් කොහි වැඩවෙසෙන සේක් දැයි මේ සිත වි ය. ආයුෂ්මත් අනුරුද්ධ තෙරනුවෝ භාග්‍යවතුන් වහන්සේ … දිවැසින් දුටුහ … ඉක්බිති ආයුෂ්මත් අනුරුද්ධ තෙරනුවෝ උතුරුදිග ඇසුරු කොට, භාග්‍යවතුන් වහන්සේට යටත්සේ ඒ බඹහුගේ මත්තෙහි අහස තේජෝධාතු සමවතට සමවැද පලඟින් වැඩ හුන්හ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති ආයුෂ්මත් මහමුගලන් තෙරුවෝ ඒ බඹහට ගාථායෙන් වදාළහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, පෙර තාගේ යම් දෘෂ්ටියෙක් වී ද, තාගේ ඒ දෘෂ්ටිය අදත් තිබේ ද, බඹලොව (ප්‍රභා) මැඩ පවත්වමින් බුදුරජානන් වහන්සේ දකිහි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 264,
            "pali": {
                "entries": [
                    {
                        "type": "unindented",
                        "text": "[බ්රහ්මා:]"
                    },
                    {
                        "type": "gatha",
                        "text": "න මෙ මාරිස සා දිට්ඨි යා මෙ දිට්ඨි පුරෙ අහු,\nපස්සාමි වීතිවත්තන්තං බ්රහ්මලොකෙ පභස්සරං,\nස්වාහං අජ්ජ කථං වජ්ජං අහං නිච්චොම්හි සස්සතොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා තං බ්රහ්මානං සංවෙජෙත්වා සෙය්යථාපි නාම බලවා පුරිසො සම්මිඤ්ජිතං වා බාහං පසාරෙය්ය, පසාරිතං වා බාහං සම්මිඤ්ජෙය්ය එවමෙව තස්මිං බ්රහ්මලොකෙ අන්තරහිතො ජෙතවනෙ පාතුරහොසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො සො බ්රහ්මා අඤ්ඤතරං බ්රහ්මපාරිසජ්ජං ආමන්තෙසි: එහි ත්වං මාරිස යෙනායස්මා මහාමොග්ගල්ලානො තෙනුපසඞ්කම. උපසඞ්කමිත්වා ආයස්මන්තං මහාමොග්ගල්ලානං එවං වදෙහි: අත්ථි නු ඛො මාරිස මොග්ගල්ලාන අඤ්ඤෙපි තස්ස භගවතො සාවකා එවං මහිද්ධිකා එවං මහානුභාවා, සෙය්යථාපි නාම{1} භවං මොග්ගල්ලානො කස්සපො කප්පිනො අනුරුද්ධොති. එවං මාරිසාති ඛො සො බ්රහ්මපාරිසජ්ජො තස්ස බ්රහ්මුනො පටිස්සුත්වා{2} යෙනායස්මා මහාමොග්ගල්ලානො තෙනුපසඞ්කමි. උපසඞ්කමිත්වා ආයස්මන්තං මහාමොග්ගල්ලානං එතදවොච: අත්ථි නු ඛො මාරිස මොග්ගල්ලාන අඤ්ඤෙපි තස්ස භගවතො සාවකා එවං මහිද්ධිකා එවං මහානුභාවා, සෙය්යථාපි භවං මොග්ගල්ලානො කස්සපො කප්පිනො අනුරුද්ධොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො ආයස්මා මහාමොග්ගල්ලානො තං බ්රහ්මපාරිසජ්ජං ගාථාය අජ්ඣභාසි:"
                    },
                    {
                        "type": "gatha",
                        "text": "තෙවිජ්ජා ඉද්ධිප්පත්තා{3} ච චෙතොපරියායකොවිදා,\nඛීණාසවා අරහන්තො බහූ බුද්ධස්ස සාවකාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො සො බ්රහ්මපාරිසජ්ජො ආයස්මතො මහාමොග්ගල්ලානස්ස භාසිතං අභිනන්දිත්වා අනුමොදිත්වා යෙන සො බ්රහ්මා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා තං බ්රහ්මානං එතදවොච: ආයස්මා මාරිස මහාමොග්ගල්ලානො එවමාහ:"
                    },
                    {
                        "type": "gatha",
                        "text": "“තෙවිජ්ජා ඉද්ධිප්පත්තා ච, චෙතොපරියායකොවිදා,\nඛීණාසවා අරහන්තො බහූ බුද්ධස්ස සාවකා”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදමවොච සො බ්රහ්මපාරිසජ්ජො. අත්තමනො ච සො බ්රහ්මා තස්ස බ්රහ්මපාරිසජ්ජස්ස භාසිතං අභිනන්දීති."
                    },
                    {
                        "type": "centered",
                        "text": "6. 1. 6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පමාදසුත්තං",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "177. {4}එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. නාම ඉති න දිස්සතෙ - මඡසං. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. පටිස්සුනිත්වා - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. ඉද්ධිපත්තා - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. සාවත්ථිනිදානං - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "[බ්‍රහ්මයා:]",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "නිදුකානෙනි, පෙර මාගේ යම් දෘෂ්ටියෙක් වී ද, ඒ දෘෂ්ටිය (දැන්) නැත. මේ බඹලොව (ප්‍රභා) මැඩ සිටුමින් බබලන බුදුරජානන් වහන්සේ දකිමි. ඒ මම අද නිත්‍ය වෙමියි ශාශ්වත වෙමියි කෙසේ කියම් ද.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ ඒ බඹහට සංවේග දනවා යම්සේ බලවත් පුරුෂයෙක් හැකුළුෑ අතක් දිගු කරන්නේ හෝ වේ ද, දිගු කළ අතක් හකුළුවන්නේ හෝ වේ ද, එසෙයින් ම ඒ බඹලොව අතුරුදන් වූ සේක් දෙව්රම්හි පහළ වූ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති ඒ බ්‍රහ්ම තෙමේ එක්තරා අතවැසි බ්‍රහ්මයකු ඇමතීය. “නිදුකානෙනි, ඒව තෝ ආයුෂ්මත් මහමුගලන් තෙරුන් වෙත එළඹෙව. එළඹ මහමුගලන් තෙරුන්ට නිදුකානෙනි, මොග්ගල්ලානයෙනි, භවත් මොග්ගල්ලාන, කස්සප, කප්පින අනුරුද්ධ තෙරවරුන්ට වැනි මෙසේ මහත් ඍද්ධි ඇති මහත් අනුභාව ඇති ඒ භාග්‍යවතුන් වහන්සේගේ වෙනත් සව්වොත් ඇද්දැයි මෙසේ කියව”යි. ඒ අතැවැසි බඹ තෙමේ නිදුකානෙනි, එසේ යයි ඒ බඹහට පිළිතුරු දී ආයුෂ්මත් මහමුගලන් තෙරුන් වෙත එළඹියේ ය. එළඹ ආයුෂ්මත් මහමුගලන් තෙරුන්ට “නිදුකානෙනි මොග්ගල්ලානයෙනි, භවත් මොග්ගල්ලාන කස්සප කප්පින අනුරුද්ධ තෙරවරුන් මෙන් මෙසේ මහත් ඍද්ධි ඇති මෙසේ මහත් අනුභාව ඇති භාග්‍යවතුන් වහන්සේගේ වෙනත් සව්වොත් ඇද්දැ”යි මෙය කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති ආයුෂ්මත් මහමුගලන් තෙරනුවෝ ඒ අතවැසි බඹහට ගාථායෙන් වදාළහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ත්‍රිවිද්‍යා ඇති ඍද්ධිවිධඥානයට පැමිණි පරසිත් දැනීමෙහි දක්ෂ වූ ක්ෂය කළ ආස්‍රව ඇති රහත් වූ බුදුරජානන් වහන්සේගේ ශ්‍රාවකයෝ බොහෝ හ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති ඒ අතැවැසි බඹ තෙමේ ආයුෂ්මත් මහමුගලන් තෙරුන්ගේ වචනය පිළිගෙණ අනුමෝදන් ව ඒ බඹු වෙත එළඹියේ ය. එළඹ ඒ බඹුහට මෙය කීය. නිදුකානෙනි, ආයුෂ්මත් මහමුගලන් තෙරනුවෝ මෙසේ කීහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "“ත්‍රිවිද්‍යා ඇති ඍද්ධිවිධඥානයට පැමිණි පරසිත් දැනීමෙහි දක්ෂ වූ ක්ෂය කළ ආස්‍රව ඇති රහත් වූ බුදුරජානන් වහන්සේගේ ශ්‍රාවකයෝ බොහෝ හ”යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඒ අතැවැසි බඹ තෙමේ මෙය කීය. සතුටු සිත් ඇති ඒ බඹ තෙමේ ඒ අතැවැසි බඹහුගේ භාෂිතය පිළිගත්තේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "6.1.6.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පමාද සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "177. එක්කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයෙහි ජේතවන නම් වූ අනේපිඬු සිටුහුගේ අරම්හි වැඩ වසන සේක.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 266,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන භගවා දිවාවිහාරගතො හොති පටිසල්ලීනො. අථ ඛො සුබ්රහ්මා ච පච්චෙකබ්රහ්මා සුද්ධාවාසො ච පච්චෙකබ්රහ්මා යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා පච්චෙකං{1} ද්වාරබාහං උපනිස්සාය අට්ඨංසු. අථ ඛො සුබ්රහ්මා පච්චෙකබ්රහ්මා සුද්ධාවාසං පච්චෙකබ්රහ්මානං එතදවොච: අකාලො ඛො තාව මාරිස භගවන්තං පයිරුපාසිතුං. දිවාවිහාරගතො භගවා පටිසල්ලීනො ච. අසුකො ච බ්රහ්මලොකො ඉද්ධො චෙව ඵීතො ච. බ්රහ්මා ච තත්ර පමාදවිහාරං විහරති. ආයාම මාරිස යෙන සො බ්රහ්මලොකො තෙනුපසඞ්කමිස්සාම. උපසඞ්කමිත්වා තං බ්රහ්මානං සංවෙජෙය්යාමා{2}ති. එවං මාරිසාති ඛො සුද්ධාවාසො පච්චෙකබ්රහ්මා සුබ්රහ්මුනො පච්චෙකබ්රහ්මුනො පච්චස්සොසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො සුබ්රහ්මා ච පච්චෙකබ්රහ්මා සුද්ධාවාසො ච පච්චෙකබ්රහ්මා සෙය්යථාපි නාම බලවා පුරිසො සම්මිඤ්ජිතං වා බාහං පසාරෙය්ය පසාරිතං වා බාහං සම්මිඤ්ජෙය්ය එවමෙව භගවතො පුරතො අන්තරහිතා තස්මිං බ්රහ්මලොකෙ පාතුරහෙසුං{3}."
                    },
                    {
                        "type": "paragraph",
                        "text": "අද්දසා ඛො සො බ්රහ්මා තෙ බ්රහ්මානො දූරතොව ආගච්ඡන්තෙ. දිස්වාන තෙ බ්රහ්මානො එතදවොච: හන්ද කුතො නු තුම්හෙ මාරිසා ආගච්ඡථාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො මයං මාරිස ආගච්ඡාම{4} තස්ස භගවතො සන්තිකා අරහතො සම්මාසම්බුද්ධස්ස. ගච්ඡෙය්යාසි පන ත්වං මාරිස තස්ස භගවතො උපට්ඨානං අරහතො සම්මාසම්බුද්ධස්සාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං වුත්තො{5} ඛො සො බ්රහ්මා තං වචනං අනධිවාසෙන්තො සහස්සක්ඛත්තුං අත්තානං අභිනිම්මිනිත්වා සුබ්රහ්මානං පච්චෙකබ්රහ්මානං එතදවොච: පස්සසි මෙ නො ත්වං මාරිස එවරූපං ඉද්ධානුභාවන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පස්සාමි ඛො ත්යාහං මාරිස එවරූපං ඉද්ධානුභාවන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සො ඛ්වාහං මාරිස එවං මහිද්ධිකො එවං මහානුභාවො කස්ස අඤ්ඤස්ස සමණස්ස වා බ්රාහ්මණස්ස වා උපට්ඨානං ගමිස්සාමීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො සුබ්රහ්මා පච්චෙකබ්රහ්මා ද්විසහස්සක්ඛත්තුං අත්තානං අභිනිම්මිනිත්වා තං බ්රහ්මානං එතදවොච: පස්සසි මෙ නො ත්වං මාරිස එවරූපං තං{6} ඉද්ධානුභාවන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පස්සාමි ඛො ත්යාහං මාරිස එවරූපං ඉද්ධානුභාවන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තයා ච ඛො මාරිස මයා ච ස්වෙව භගවා මහිද්ධිකතරො චෙව මහානුභාවතරො ච. ගච්ඡෙය්යාසි ත්වං මාරිස තස්ස භගවතො උපට්ඨානං අරහතො සම්මාසම්බුද්ධස්සාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො සො බ්රහ්මා සුබ්රහ්මානං පච්චෙකබ්රහ්මානං ගාථාය අජ්ඣභාසි:"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පච්චෙකද්වාරබාහං - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සංවෙජෙස්සාමාති - සී 1. 2."
                    },
                    {
                        "type": "footnote",
                        "text": "3. පාතුරහංසු - සී 1. 2."
                    },
                    {
                        "type": "footnote",
                        "text": "4. ආගතා ඛො මයං මාරිස අම්හ - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. වුත්තෙ - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "6. ‘තං’ ඉති නදිස්සතෙ - මඡසං. PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "එකල්හි භාග්‍යවතුන් වහන්සේ දිවාවිහරණය පැමිණිසේක් චිත්තවිවේකයෙන් වැඩහුන් සේක. ඉක්බිති පච්චේකබ්‍රහ්ම වූ සුබ්‍රහ්ම ද පච්චේක බ්‍රහ්ම වූ සුද්ධාවාස ද භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ වෙන වෙන ම දොර බා ඇසුරු කොට සිටියහ. ඉක්බිති පච්චේකබ්‍රහ්ම වූ සුබ්‍රහ්ම තෙමේ පච්චේකබ්‍රහ්ම වූ සුද්ධාවාසහට “නිදුකානෙනි, භාග්‍යවතුන් වහන්සේ දිවාවිහාර ගත වූ සේක් චිත්තවිවේකයෙන් වැඩහුන් සේක. (එහෙයින් ඒ) භාග්‍යවතුන් වහන්සේ ඇසුරු කරන්නට තව කල් නොවේ.\n\n“අසූවල් බඹලොව (ධ්‍යානසුඛයෙන්) සමෘද්ධවූයේත් (අභිඥා පුෂ්පයෙන්) පිපියේත් වෙයි. බ්‍රහ්ම තෙමේ ද එහි ප්‍රමාදවිහරණයෙන් වාසය කෙරෙයි. නිදුකානෙනි, යම්හ ඒ බඹලොව කරා එළඹෙන්නෙමු. එළඹ ඒ බඹහට සංවේග දනවන්නෙමු”යි මෙය කීය. පච්චේකබ්‍රහ්ම වූ සුද්ධාවාස තෙමේ නිදුකානෙනි, එසේය යි පච්චේකබ්‍රහ්ම වූ සුබ්‍රහ්මහට පිළිවදන් ඇස්වීය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති පච්චේකබ්‍රහ්ම වූ සුබ්‍රහ්ම තෙමේ ද පච්චේකබ්‍රහ්ම වූ සුද්ධාවාස තෙමේ ද යම්සේ බලවත් පුරුෂයෙක් හැකුළුෑ අතක් දිගු කරන්නේ හෝ වේ ද, දිගු කළ අතක් හකුළුවන්නේ හෝ වේ ද, එසෙයින් භාග්‍යවතුන් වහන්සේගේ ඉදිරියෙහි අතුරුදහන් වූවාහු ඒ බඹලොව පහළ වූහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඒ බ්‍රහ්ම තෙමේ එන්නා වූ බ්‍රහ්මයන් දුරදී ම දැක්කේය. දැක ඒ බ්‍රහ්මයන්ට “නිදුකානෙනි, දැන් තෙපි කොහි සිට එවු දැ”යි මෙය කීය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි නිදුකානෙනි, අපි ඒ භාග්‍යවත් අර්හත් සම්මාසම්බුදුරජානන් වහන්සේ සමීපයෙහි සිට එමු. නිදුකානෙනි, තෙපි ඒ භාග්‍යවත් අර්හත් සම්මාසම්බුදුරජානන් වහන්සේට උවටැන් කිරීමට යන්නාහු ද?",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මෙසේ කියන ලද ඒ බඹ තෙමේ ඒ වදන නො ඉවසමින් දහස් වරක් තමා මවා ගෙණ පච්චේකබ්‍රහ්ම වූ සුබ්‍රහ්මහට නිදුකානෙනි, තෙපි මාගේ මෙබඳු වූ ඍද්ධ්‍යානුභාවය නො දකිවු දැ යි මෙය කීය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "නිදුකානෙනි, මම තොපගේ මෙබඳු ඍද්ධ්‍යානුභාවය දකිම් ම ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "නිදුකානෙනි, ඒ මම මෙබඳු මහත් ඍද්ධි ඇත්තෙම් මෙබඳු මහත් අනුභාව ඇත්තෙම් අන් කවර මහණකුට හෝ බමුණකුට හෝ උවටැන් කිරීමට යන්නෙම් ද?",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති පච්චේකබ්‍රහ්ම වූ සුබ්‍රහ්ම තෙමේ දෙදහස් වරක් තමා මවා ගෙණ ඒ බඹහට නිදුකානෙනි, තෙපි මාගේ මෙබඳු ඍද්ධ්‍යානුභාවය නො දකිවු දැ’යි මෙය කීය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "නිදුකානෙනි, මම තොපගේ මෙබඳු ඍද්ධ්‍යානුභාවය දකිම් ම ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "නිදුකානෙනි, තොපට ද අපට ද වඩා ඒ භාග්‍යවතුන් වහන්සේ ම මහත් ඍද්ධිත් ඇති සේක. මහත් අනුභාවත් ඇති සේක. නිදුකානෙනි, තෙපි ඒ භාග්‍යවත් අර්හත් සම්මාසම්බුදුරජාණන් වහන්සේගේ උවටැනට යවු.",
                        "type": "paragraph"
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉක්බිති ඒ බඹ තෙමේ පච්චේකබ්‍රහ්ම වූ සුබ්‍රහ්මහට ගාථායෙන් කී ය."
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 268,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "තයො සුපණ්ණා චතුරො ච හංසා බ්යග්ඝීනිසා පඤ්චසතා ච ඣායිනො,\nතයිදං විමානං ජලතෙ{1} ච බ්රහ්මෙ ඔභාසයං උත්තරස්සං දිසායන්ති."
                    },
                    {
                        "type": "gatha",
                        "text": "කිඤ්චාපි තෙ තං ජලතෙ විමානං ඔභාසයං උත්තරස්සං දිසායං,\nරූපෙ රණං දිස්වා සදා පවෙධිතං තස්මා න රූපෙ රමතී සුමෙධොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "\nඅථ ඛො සුබ්රහ්මා ච පච්චෙකබ්රහ්මා සුද්ධාවාසො ච පච්චෙකබ්රහ්මා තං බ්රහ්මානං සංවෙජෙත්වා තත්ථෙවන්තරධායිංසු. අගමාසි ච ඛො සො බ්රහ්මා අපරෙන සමයෙන භගවතො උපට්ඨානං අරහතො සම්මාසම්බුද්ධස්සාති."
                    },
                    {
                        "type": "centered",
                        "text": "6. 1. 7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කොකාලිකසුත්තං.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "178. **සාවත්ථියං---**"
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන භගවා දිවාවිහාරගතො හොති පටිසල්ලීනො. අථ ඛො සුබ්රහ්මා ච පච්චෙකබ්රහ්මා සුද්ධාවාසො ච පච්චෙකබ්රහ්මා යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා පච්චෙකං ද්වාරබාහං නිස්සාය අට්ඨංසු. අථ ඛො සුබ්රහ්මා පච්චෙකබ්රහ්මා කොකාලිකං භික්ඛුං ආරබ්භ භගවතො සන්තිකෙ ඉමං ගාථං අභාසි:"
                    },
                    {
                        "type": "gatha",
                        "text": "අප්පමෙය්යං පමිනන්තො කො’ධ විද්වා විකප්පයෙ,\nඅප්පමෙය්යං පමායිනං නිවුතං{2} තං{3} මඤ්ඤෙ පුථුජ්ජනන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "6. 1. 8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කතමොරකතිස්සසුත්තං.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "179. **සාවත්ථියං---**"
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන භගවා දිවාවිහාරගතො හොති පටිසල්ලීනො. අථ ඛො සුබ්රහ්මා ච පච්චෙකබ්රහ්මා සුද්ධාවාසො ච පච්චෙකබ්රහ්මා යෙන භගවා තෙනුපසඞ්කමිංසු. උපසඞ්කමිත්වා පච්චෙකං ද්වාරබාහං නිස්සාය අට්ඨංසු. අථ ඛො සුද්ධාවාසො පච්චෙකබ්රහ්මා කතමොරකතිස්සං භික්ඛුකං ආරබ්භ භගවතො සන්තිකෙ ඉමං ගාථං අභාසි:"
                    },
                    {
                        "type": "gatha",
                        "text": "අප්පමෙය්යං පමිනන්තො කො’ධ විද්වා විකප්පයෙ,\nඅප්පමෙය්යං පමායිනං නිවුතං තං මඤ්ඤෙ අකිස්සවන්ති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ජලති - ස්යා. සී 2."
                    },
                    {
                        "type": "footnote",
                        "text": "2. නිඬුතං - ස්යා. නිවුතං මඤ්ඤෙ - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "3. කතමොදකකිස්ස - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "තුන්සියක් ගුරුළුරූ නොහොත් ගුරුළුපඞ්ක්ති ද, හාරසීයක් හංසරූප නොහොත් හංසපඞ්ක්ති ද, පන්සියක් ව්‍යාඝ්‍රසදෘශ මෘගරූප නොහොත් වගවැළ ද ධ්‍යායී වූ මාගේ (විමානයෙහි වෙත්) බ්‍රහ්මය, ඒ මේ විමන උතුරුදික්හි ආලොක කරමින් බබලයි. (මෙසේ ඉසුරුමත් මම අන්කවරකුට නම් උවටැන් කරන්නෙම් ද?)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "වැලි තොපගේ මේ විමන උතුරුදික්හි ආලෝක කෙරෙමින් බබාලා ද (එහෙත්) රූපයෙහි දෝෂය ද, හැමකල්හි කම්පිත බවද දැක එහෙයින් මනා නුවණැත්තේ රූපයෙහි නො ඇලෙයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති පච්චේකබ්‍රහ්ම වූ සුබ්‍රහ්ම ද පච්චේකබ්‍රහ්ම වූ සුද්ධාවාද ද ඒ බඹහට සංවේගය දන්වා එහි ම අතුරුදන් වූහ. පසු කලෙක ඒ බඹ තෙමේ භාග්‍යවත් අර්හත් සම්මාසම්බුදුරජාණන් වහන්සේගේ උවටැනට ගියේ ද විය.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "6.1.7.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කොකාලික සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "178. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි භාග්‍යවතුන් වහන්සේ දිවාවිහාරය පිණිස වැඩිසේක් විවේකී වූ සේක. එකල්හි පච්චේකබ්‍රහ්ම වූ සුබ්‍රහ්ම තෙමේ ද පච්චේකබ්‍රහ්ම වූ සුද්ධාවාස තෙමේ ද භාග්‍යවතුන් වහන්සේ වෙත එළඹිය හ. එළඹ වෙන් වෙන් දොරබා ඇසුරු කොට සිටියහ. ඉක්බිති පච්චේකබ්‍රහ්ම වූ සුබ්‍රහ්ම තෙමේ කොකාලික මහණ ඇරබ භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ ගාථාව කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මේ ලෝකයෙහි කවර නම් නුවණැත්තෙක් අප්‍රමෙය වූ ක්ෂීණාස්‍රවයා පමණ කෙරෙමින් කල්පනා කරන්නේ ද, අප්‍රමෙය වූ ක්ෂීණාස්‍රවයන් පමණ කරන්නාවූ ඒ පෘතග්ජනයා අවකුජ්ජපඤ්ඤ පුද්ගලයෙකැයි හඟිමි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "6.1.8.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "කතමොරකතිස්ස සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "179. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි භාග්‍යවතුන් වහන්සේ දිවාවිහාරය පිණිස වැඩිසේක් විවේකී වූ සේක. එකල්හි පච්චේකබ්‍රහ්ම වූ සුබ්‍රහ්ම තෙමේ ද පච්චේකැබ්‍රහ්ම වූ සුද්ධාවාස තෙමේ ද භාග්‍යවතුන් වහන්සේ වෙත එළඹිය හ. එළඹ වෙන් වෙන් දොරබා ඇසුරු කොට සිටිය හ. ඉක්බිති පච්චේකබ්‍රහ්ම වූ සුද්ධාවාස තෙමේ කතමොරකතිස්සක මහණහු ඇරබ භාග්‍යවතුන් වහන්සේගේ සමීපයෙහි මේ ගාථාව කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මේ ලෝකයෙහි කවර නම් නුවණැත්තෙක් අප්‍රමෙය වූ ක්ෂීණාස්‍රවයා පමණ කෙරෙමින් කල්පනා කරන්නේ ද, අප්‍රමෙය වූ ක්ෂීණාස්‍රවයන් පමණ කරන්නා වූ ඔහු අවකුජ්ජපඤ්ඤ වූ අඥානයෙකැ යි හඟිමි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 270,
            "pali": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "6. 1. 9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තුදුබ්රහ්ම{1}සුත්තං.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "180. **සාවත්ථියං---**"
                    },
                    {
                        "type": "paragraph",
                        "text": "තෙන ඛො පන සමයෙන කොකාලිකො භික්ඛු ආබාධිකො හොති දුක්ඛිතො බාළ්හගිලානො. අථ ඛො තුදුපච්චෙකබ්රහ්මා අභික්කන්තාය රත්තියා අභික්කන්තවණ්ණො කෙවලකප්පං ජෙතවනං ඔභාසෙත්වා යෙන කොකාලිකො භික්ඛු තෙනුපසඞ්කමි. උපසඞ්කමිත්වා වෙහාසං ඨිතො කොකාලිකං භික්ඛුං එතදවොච: පසාදෙහි කොකාලික සාරිපුත්තමොග්ගල්ලානෙසු චිත්තං. පෙසලා සාරිපුත්තමොග්ගල්ලානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "කොසි ත්වං ආවුසොති? අහං තුදුපච්චෙකබ්රහ්මාති. න නු{2} ත්වං ආවුසො භගවතා අනාගාමී බ්යාකතො. අථ කිඤ්චරහි{3} ඉධාගතො{4}. පස්ස යාවඤ්ච තෙ ඉදං අපරද්ධන්ති."
                    },
                    {
                        "type": "gatha",
                        "text": "පුරිසස්ස හි ජාතස්ස කුඨාරී{5} ජායතෙ මුඛෙ,\nයාය ඡින්දති අත්තානං බාලො දුබ්භාසිතං භණං."
                    },
                    {
                        "type": "gatha",
                        "text": "යො නින්දියං පසංසති තං වා නින්දති යො පසංසියො,\nවිචිනාති මුඛෙන සො කලිං කලිනා තෙන සුඛං න වින්දති."
                    },
                    {
                        "type": "gatha",
                        "text": "අප්පමත්තො{6} අයං කලි යො අක්ඛෙසු ධනපරාජයො,\nසබ්බස්සාපි සහාපි අත්තනා අයමෙව මහන්තතරො කලි\nයො සුගතෙසු මනං පදොසයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "සතං සහස්සානං නිරබ්බුදානං ඡත්තිංසති පඤ්ච ච අබ්බුදානි,\nයමරියගරහී{7} නිරයං උපෙති වාචං මනඤ්ච පණිධාය පාපකන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "6. 1. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතියකොකාලිකසුත්තං.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "181. **සාවත්ථියං---**"
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො කොකාලිකො භික්ඛු යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො කොකාලිකො භික්ඛු භගවන්තං එතදවොච: පාපිච්ඡා භන්තෙ සාරිපුත්තමොග්ගල්ලානා පාපිකානං ඉච්ඡානං වසඞ්ගතාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං වුත්තෙ භගවා කොකාලිකං භික්ඛුං එතදවොච: මාහෙවං කොකාලික අවච. මා හෙවං කොකාලික අවච. පසාදෙහි කොකාලික සාරිපුත්තමොග්ගල්ලානෙසු චිත්තං. පෙසලා සාරිපුත්තමොග්ගල්ලානාති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. තුරූබ්රහ්ම - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. කින්නු - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. කථංචරහි - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. ඉධාගතොති - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. කුධාරි - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "6. අප්පමත්තකො - මඡසං. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "7. යමරියෙ ගරහී - ස්යා."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "centered",
                        "text": "6.1.9.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "තුදුබ්‍රහ්ම සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "180. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි කෝකාලික මහණ තෙමේ හටගත් අබාධ ඇත්තේ දුකට පැමිණියේ අධිමාත්‍ර කොට ගිලන් වූයේ වේ. ඉක්බිති මනා ඡවිවර්ණ ඇති තුදු නම් පච්චේකබ්‍රහ්ම තෙමේ රෑ පෙරයම ඉක්ම ගිය කල්හි මුළු දෙව්රම බබුලුවා කොකාලික මහණ වෙත එළඹියේ ය. එළඹ අහස සිටියේ කොකාලික මහණහට මෙය කී ය. කොකාලික, සැරියුත් මුගලන් දෙනම කෙරෙහි සිත පහදව. සැරියුත් මුගලන් දෙදෙනා වහන්සේ ප්‍රියශීලී හ යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඇවැත්නි, තෝ කවරෙහි ද? මම තුදුපච්චේකබ්‍රහ්ම වෙමි. ඇවැත්නි, තෝ අනාගාමී යයි භාග්‍යවතුන් වහන්සේ විසින් පවසන ලද්දේ නො වේ ද? එසේ ඇති කල්හි කුමකට මෙහි ආයෙහි ද? තා විසින් මේ කොතරම් අපරාධයෙක් කරණ ලද්දේ දැයි බලව.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "අඥාන තෙමේ දුබැසි බෙණෙමින් යමෙකින් තමා සිඳී ද? උපන් (එබඳු) මිනිසා ගේ මුවෙහි (ඒ තමා නසන) කෙටේරිය හට ගණී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "යමෙක් නින්දා කටයුත්තා පසසා ද, යමෙක් පැසසිය යුත්තේ නම් ඔහුට නින්දා හෝ කෙරේ ද, හෙ තෙමේ මුවෙන් පව් රැස් කෙරේ. ඒ පවින් සුවයක් නො විඳී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "දූකෙළීම් ආදියෙහි යම් වස්තු පරාජයෙක් වේ ද, තමනුත් සමග සියලූ දේ සම්බන්ධ (යම් පරිහාණියෙකුත් වේ ද,) ඒ අපරාධය ඉතා ස්වල්ප ය. යමෙක් ශෝබන ගති ඇත්තවුන් කෙරෙහි සිත දුෂ්ට කරන්නේ ද, මෙය ම ඉතා මහත් අපරාධ යයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආර්යයන්ට ගරහන පුද්ගල තෙමේ ලාමක වූ වචන ද, සිත ද පිහිටුවා (ඒ හේතුවෙන්) යම් නිරයකට පැමිණේ ද, (එහි ආයුෂ) නිරබ්බුද ලක්ෂයෙක් ද සතිසෙක් ද, අබ්බුද පසෙක් ද වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "6. 1. 10.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දුතියකොකාලික සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "181. **සැවැත්නුවර -**",
                        "type": "unindented"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි කෝකාලික මහණ තෙමේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේට වැඳ එකත්පසෙක හුන්නේ ය. එකත්පසෙක හුන් කෝකාලික මහණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේ ය. වහන්ස, සැරියුත් මුගලන් තෙරහු ලාමක ආශා ඇත්තෝ ය. ලාමක ආශාවන්ට වසඟ වූවෝ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මෙසේ කී කල්හි භාග්‍යවතුන් වහන්සේ කෝකාලික මහණහට මෙය වදාළ සේක. කෝකාලික, එසේ නො කියව. කෝකාලික, එසේ නො කියව. කෝකාලික, සැරියුත් මුගලන් දෙනම කෙරෙහි සිත පහදව. සැරියුත් මුගලන් දෙනම ප්‍රියශීලීහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 272,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "දුතියම්පි ඛො කොකාලිකො භික්ඛු භගවන්තං එතදවොච: කිඤ්චාපි මෙ භන්තෙ භගවා සද්ධායිකො පච්චයිකො. අථ ඛො පාපිච්ඡාව සාරිපුත්තමොග්ගල්ලානා පාපිකානං ඉච්ඡානං වසං ගතාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "දුතියම්පි ඛො භගවා කොකාලිකං භික්ඛුං එතදවොච: මා හෙවං කොකාලික අවච. මා හෙවං කොකාලික අවච. පසාදෙහි කොකාලික සාරිපුත්තමොග්ගල්ලානෙසු චිත්තං. පෙසලා සාරිපුත්තමොග්ගල්ලානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තතියම්පි ඛො කොකාලිකො භික්ඛු භගවන්තං එතදවොච: -පෙ- පාපිකානං ඉච්ඡානං වසං ගතාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "තතියම්පි ඛො භගවා කොකාලිකං භික්ඛුං එතදවොච: -පෙ- පෙසලා සාරිපුත්තමොග්ගල්ලානාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො කොකාලිකො භික්ඛු උට්ඨායාසනා භගවන්තං අභිවාදෙත්වා පදක්ඛිණං කත්වා පක්කාමි. අචිරපක්කන්තස්ස ච කොකාලිකස්ස භික්ඛුනො සාසපමත්තීහි පිළකාහි{1} සබ්බො කායො ඵුටො{2} අහොසි. සාසපමත්තියො හුත්වා මුග්ගමත්තියො අහෙසුං. මුග්ගමත්තියො හුත්වා කලායමත්තියො{3} අහෙසුං කලායමත්තියො{3} හුත්වා කොලට්ඨිමත්තියො අහෙසුං. කොලට්ඨිමත්තියො හුත්වා කොලමත්තියො අහෙසුං. කොලමත්තියො හුත්වා ආමලකමත්තියො අහෙසුං. ආමලකමත්තියො හුත්වා බෙලුව{5}සලාටුකමත්තියො අහෙසුං. බෙලුවසලාටුකමත්තියො හුත්වා බිල්ලමත්තියො අහෙසුං. බිල්ලමත්තියො හුත්වා පභිජ්ජිංසු. පුබ්බඤ්ච ලොහිතඤ්ච පග්ඝරිංසු. අථ ඛො කොකාලිකො භික්ඛු තෙනෙව ආබාධෙන කාලමකාසි . කාලකතො ච කොකාලිකො භික්ඛු පදුමනිරයං{6} උපපජ්ජි. සාරිපුත්තමොග්ගල්ලානෙසු චිත්තං ආඝාතෙත්වා."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො බ්රහ්මා සහම්පති අභික්කන්තාය රත්තියා අභික්කන්තවණ්ණො කෙවලකප්පං ජෙතවනං ඔභාසෙත්වා යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතො ඛො බ්රහ්මා සහම්පති භගවන්තං එතදවොච: කොකාලිකො භන්තෙ භික්ඛු කාලමකාසි{7}. කාලකතො ච භන්තෙ කොකාලිකො භික්ඛු පදුමං නිරයං උපපන්නො සාරිපුත්තමොග්ගල්ලානෙසු චිත්තං ආඝාතෙත්වාති. ඉදමවොච බ්රහ්මා සහම්පති ඉදං වත්වා භගවන්තං අභිවාදෙත්වා පදක්ඛිණං කත්වා තත්ථෙවන්තරධායීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා තස්සා රත්තියා අච්චයෙන භික්ඛූ ආමන්තෙසි: ඉමං භික්ඛවෙ රත්තිං බ්රහ්මා සහම්පති අභික්කන්තාය රත්තියා අභික්කන්තවණ්ණො කෙවලකප්පං ජෙතවනං ඔභාසෙත්වා යෙනාහං තෙනුපසඞ්කමි. උපසඞ්කමිත්වා මං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතො ඛො භික්ඛවෙ බ්රහ්මා සහම්පති මං එතදවොච: කොකාලිකො භන්තෙ භික්ඛු කාලමකාසි. කාලකතො ච භන්තෙ කොකාලිකො භික්ඛු පදුමනිරයං උපපන්නො සාරිපුත්තමොග්ගල්ලානෙසු චිත්තං ආඝාතෙත්වාති. ඉදමවොච භික්ඛවෙ බ්රහ්මා සහම්පති. ඉදං වත්වා මං අභිවාදෙත්වා පදක්ඛිණං කත්වා තත්ථෙවන්තරධායීති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. පීලකාහි - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. ඵුට්ඨො - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. කළායමත්තියො - සීමු. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "5. වෙලුව - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "6. පදුමං නිරයං - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "7. කාලඞ්කතො - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "දෙවනවට දු කෝකාලික මහණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේ ය: වහන්ස, භාග්‍යවතුන් වහන්සේ මා විසින් ඇදහියයුතු වචන ඇත්තාහු ම ය. විශ්වාස කටයුතු වචන ඇත්තාහු ම ය. එතෙකුදු වුවත් සැරියුත්මුගලන් තෙරහු ලාමක ආශා ඇත්තාහු ම ය. ලාමක ආශාවන්ගේ වශයට ගියාහු ම යයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "දෙවනවට දු භාග්‍යවතුන් වහන්සේ කෝකාලික මහණහට මෙය වදාළ සේක. “කෝකාලික, එසේ නොකියව. කෝකාලික, එසේ නොකියව. කෝකාලික, සැරියුත් මුගලන් දෙනම කෙරෙහි සිත පහදව. සැරියුත්මුගලන් තෙරහු ප්‍රියශීලීහ” යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තෙවනවට දු කෝකාලික මහණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කෙළේ ය ... ලාමක ආශාවන්ගේ වශයට ගියාහු යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "තෙවනවට දු භාග්‍යවතුන් වහන්සේ කොකාලික මහණහට මෙය වදාළ සේක. ... සැරියුත්මුගලන් තෙරහු ප්‍රියශීලීහ” යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති කෝකාලික මහණ තෙමේ හුනස්නෙන් නැගිට භාග්‍යවතුන් වහන්සේ වැඳ පැදකුණු කොට ගියේ ය. ගිය නොබෝකල් ඇති කෝකාලික මහණහුගේ මුළුකය අබ පමණ වූ ගඩුයෙන් පතුළේ විය. අබ පමණ ව මුං පමණ වූහ. මුං පමණ ව මැහැ පමණ වූහ. මැහැ පමණ ව ඩෙබරඇට පමණ වූහ. ඩෙබරඇට පමණ ව ඩෙබර පමණ වූහ. ඩෙබර පමණ ව ඇඹුළුපක් පමණ වූහ. ඇඹුලුපක් පමණ ව බෙලිබොබොළු පමණ වූහ. බෙලිබොබොළු පමණ ව බෙලි පමණ වූහ. බෙලි පමණ ව බිඳුනාහු ය. පූයාව ද ලේ ද වැගුරුණහ. ඉක්බිති කෝකාලික මහණ තෙමේ ඒ රෝගයෙන් ම කලුරිය කළේ ය. කලුරිය කළ කෝකාලික මහණ තෙමේ සැරියුත්මුගලන් දෙනම කෙරෙහි සිත වෛර බැඳ පදුම නිරයට පැමිණියේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති මනා ඡවිවරණ ඇති සහම්පති බ්‍රහ්ම තෙමේ රෑ පෙරයම ඉක්ම ගිය කල්හි මුළු දෙව්රම බබුලුවා භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක සිටියේ ය. එකත්පසෙක සිටි සහම්පති බ්‍රහ්ම තෙමේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. වහන්ස, කෝකාලික මහණ තෙමේ කලුරිය කළේ ය. වහන්ස, කලුරිය කළ කොකාලික මහණ තෙමේ සැරියුත් මුගලන් දෙනම කෙරෙහි සිත වෛර බැඳ පදුමනිරයට පැමිණියේ යයි. සහම්පති බ්‍රහ්ම තෙමේ මෙය කී ය. මෙය කියා භාග්‍යවතුන් වහන්සේ වැඳ පැදකුණු කොට එහි ම අතුරුදහන් විය. ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ ඒ රැය ඉක්ම යෑමෙන් භික්ෂූන් ඇමතූ සේක. මහණෙනි, මේ රැය මනා ඡවිවරණ ඇති සහම්පති බ්‍රහ්ම තෙමේ රෑ පෙරයම ඉක්ම ගිය කල්හි මුළු දෙව්රම බබුලුවා මා වෙත එළඹියේ ය. එළඹ මට වැඳ එකත්පසෙක සිටියේ ය. මහණෙනි, එකත්පසෙක සිටි සහම්පති බ්‍රහ්ම තෙමේ මට මෙය කී ය. වහන්ස, කොකාලික මහණ තෙමේ කලුරිය කළේ ය. වහන්ස, කලුරිය කළ කොකාලික මහණ තෙමේ සැරියුත් මුගලන් දෙනම කෙරෙහි සිත වෛර බැඳ පදුමනිරයට පැමිණියේ යයි. මහණෙනි, සහම්පති බ්‍රහ්ම තෙමේ මෙය කී ය. මෙය කියා මට වැඳ පැදකුණු කොට එහි ම අතුරුදහන් වි ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 274,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "එවං වුත්තෙ අඤ්ඤතරො භික්ඛු භගවන්තං එතදවොච: කීවදීඝං නු ඛො භන්තෙ පදුමනිරයෙ ආයුප්පමාණන්ති. දීඝං ඛො භික්ඛු පදුමනිරයෙ ආයුප්පමාණං, තං න සුකරං සඞ්ඛාතුං – එත්තකානි වස්සානි ඉති වා, එත්තකානි වස්සසතානි ඉති වා, එත්තකානි වස්සසහස්සානි ඉති වා, එත්තකානි වස්සසතසහස්සානි ඉති වාති. සක්කා පන භන්තෙ උපමං{1} කාතුන්ති සක්කාති භික්ඛූති භගවා අවොච."
                    },
                    {
                        "type": "paragraph",
                        "text": "සෙය්යථාපි භික්ඛු වීසතිඛාරිකො කොසලකො තිලවාහො, තතො පුරිසො වස්සසතස්ස වස්සසතස්ස{2} අච්චයෙන එකමෙකං තිලං උද්ධරෙය්ය. ඛිප්පතරං ඛො සො භික්ඛු වීසතිඛාරිකො කොසලකො තිලවාහො ඉමිනා උපක්කමෙන පරික්ඛයං පරියාදානං ගච්ඡෙය්ය, නත්වෙව එකො අබ්බුදො නිරයො. සෙය්යථාපි භික්ඛු වීසති අබ්බුදා නිරයා,{3} එවමෙකො නිරබ්බුදො නිරයො{4}. සෙය්යථාපි භික්ඛු වීසති නිරබ්බුදා නිරයා, එවමෙකො අබබො නිරයො. සෙය්යථාපි භික්ඛු වීසති අබබා නිරයා, එවමෙකො අටටො නිරයො. සෙය්යථාපි භික්ඛු වීසති අටටා නිරයා, එවමෙකො අහහො නිරයො. සෙය්යථාපි භික්ඛු වීසති අහහා නිරයා, එවමෙකො කුමුදො නිරයො. සෙය්යථාපි භික්ඛු වීසති කුමුදා නිරයා, එවමෙකො සොගන්ධිකො නිරයො. සෙය්යථාපි භික්ඛු වීසති සොගන්ධිකා නිරයා, එවමෙකො උප්පලො නිරයො. සෙය්යථාපි භික්ඛු වීසති උප්පලා{5} නිරයා, එවමෙකො පුණ්ඩරීකො නිරයො. සෙය්යථාපි භික්ඛු වීසති පුණ්ඩරීකා නිරයා, එවමෙකො පදුමො නිරයො. පදුමං ඛො පන භික්ඛු නිරයං කොකාලිකො භික්ඛු උපපන්නො සාරිපුත්තමොග්ගල්ලානෙසු චිත්තං ආඝාතෙත්වාති. ඉදමවොච භගවා, ඉදං වත්වා සුගතො අථාපරං එතදවොච සත්ථා:"
                    },
                    {
                        "type": "gatha",
                        "text": "පුරිසස්ස හි ජාතස්ස කුඨාරී ජායතෙ මුඛෙ,\nයාය ඡින්දති අත්තානං බාලො දුබ්භාසිතං භණං."
                    },
                    {
                        "type": "gatha",
                        "text": "යො නින්දියං පසංසති තං වා නින්දති යො පසංසියො,\nවිචිනාති මුඛෙන සො කලිං කලිනා තෙන සුඛං න වින්දති."
                    },
                    {
                        "type": "gatha",
                        "text": "අප්පමත්තො{6} අයං කලි යො අක්ඛෙසු ධනපරාජයො,\nසබ්බස්සාපි සහාපි අත්තනා අයමෙව මහන්තරො කලි\nයො සුගතෙසු මනං පදොසයෙ."
                    },
                    {
                        "type": "paragraph",
                        "text": "සතං සහස්සානං නිරබ්බුදානං ඡත්තිංසති පඤ්ච ච අබ්බුදානි,\nයමරියගරහී නිරයං උපෙති වාචං මනඤ්ච පණිධාය පාපකන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "කොකාලිකවග්ගො පඨමො.",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රැද්දානං:**"
                    },
                    {
                        "type": "paragraph",
                        "text": "ආයාචනං ගාරවො බ්රහ්මදෙවො බකො ච බ්රහ්මා අපරා ච දිට්ඨි,\nපමාද කොකාලිකතිස්සකො ච තුදු ච බ්රහ්මා අපරො ච කොකාලිකොති."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. උපමා - සීමු 2."
                    },
                    {
                        "type": "footnote",
                        "text": "2. වස්සසහස්සස්ස - ස්යා. සී 1. 2."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අබ්බුදො නිරයො - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. නිරබ්බුදනිරයො - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. උප්පලකා - සීමු 2."
                    },
                    {
                        "type": "footnote",
                        "text": "6. අප්පමත්තකො - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "මෙසේ වදාළ කල්හි එක්තරා මහණෙක් භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේ ය. වහන්ස, පුදුමනිරයෙහි ආයුඃප්‍රමාණය කොපමණ දිග ද? මහණෙනි, පදුමනිරයෙහි ආයුඃප්‍රමාණය දිග ම ය. එය වර්ෂ මෙතෙකැයි කියා හෝ වර්ෂ මෙතෙක් සියෙකැයි කියා හෝ වර්ෂ මෙතෙක් දහසෙකැයි කියා හෝ වර්ෂ මෙතෙක් ලක්ෂයෙකැ යි කියා හෝ ගණන් කරන්නට පහසු නො වේ. වහන්ස, උපමාවක් කරන්නට හැක්කේ ද? මහණ හැකි යයි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණ, යම්සේ කොසොල්රට ගණනින් විංශත්ඛාරියක් ගන්නා තලයාළෙක් වේ ද, පුරුෂයෙක් සියවසක් සියවසක් ඇවෑමෙන් එයින් එක් තලඇටය ඉවත දමන්නේ නම්, මහණ, කොසොල්රට ගණනින් විසිඛාරියක් ඇති ඒ තලයාළ මේ උපක්‍රමයෙන් වහා ගෙවීමට අවසන් වීමට යන්නේ ය. (එහෙත්) එක් අබ්බුද නිරයක ආයුෂය නො ගෙවෙන්නේ ම ය. මහණ, අබ්බුද නිරය විස්සෙක ආයුඃප්‍රමාණය යම් බඳු ද, එක් නිරබ්බුද නිරයෙක ආයුඃප්‍රමාණය එබඳු ය. මහණ, නිරබ්බුද නිරය විස්සෙක් යම් බඳු ද, එක් අබබ නිරයෙක් එබඳු වෙයි. මහණ, අබබනිරය විස්සෙක් යම් බඳු ද, එක් අටට නිරයෙක් එබඳු වෙයි. මහණ, අටටනිරය විස්සෙක් යම්සේ ද, එක් අහහ නිරයෙක් එසේ ය. මහණ, අහහ නිරය විස්සෙක් යම් සේ ද, එක් කුමුද නිරයෙක් එසේ ය. මහණ, කුමුද නිරය විස්සෙක් යම්සේ ද එක් සොගන්ධික නිරයෙක් එසේ ය. මහණ, සොගන්ධික නිරය විස්සෙක් යම්සේ ද, එක් උප්පලනිරයෙක් එසේ ය. මහණ, උප්පලනිරය විස්සෙක් යම්සේ ද, එක් පුණ්ඩරීක නිරයෙක් එසේ ය. මහණ පුණ්ඩරීක නිරය විස්සෙක් යම්සේ ද, එක් පදුම නිරයෙක් එසේ ය. මහණ කොකාලික මහණ තෙමේ සැරියුත් මුගලන් දෙනම කෙරෙහි සිත වෛර බැඳ (ඒ) පදුම නිරයට පැමිණියේ යි. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගත වූ ශාස්තෘන් වහන්සේ මෙය වදාර නැවත ද මෙය වදාළ සේක. ",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "අඥාන තෙමේ දුබැසි බෙණෙමින් යමෙකින් තමා සිඳී ද, උපන් (එබඳු) මිනිසාගේ මුවෙහි (ඒ තමා නසන) කෙටේරිය හටගණී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "යමෙක් නින්දා කටයුත්තා පස්සා ද, යමෙක් පැසසිය යුත්තේ නම් ඔහුට නින්දා හෝ කෙරේ ද, හෙ තෙමේ මුවෙන් පව් රැස් කෙරෙයි. ඒ පවින් සුවයක් නො විඳී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "දූකෙළීම් ආදියෙහි යම් වස්තු පරාජයෙක් වේ ද, තමනුත් සමග සියලු දෙය සම්බන්ධ (යම් පරිහානියකුත් වේද,) ඒ අපරාධය ඉතා ස්වල්ප ය. යමෙක් සෝභන ගති ඇත්තවුන් කෙරෙහි සිත දුෂ්ට කරන්නේ ද, මෙය ම ඉතා මහත් අපරාධ යයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආර්යයන්ට ගරහන පුද්ගල තෙමේ ලාමක වූ වචන ද, සිත ද පිහිටුවා (ඒ හේතුවෙන්) යම් නිරයකට පැමිණේ ද, එහි ආයුෂය නිරබ්බුද ලක්ෂයෙක් ද සතිසෙක් ද අබ්බුද පසෙක් ද වෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 11,
                        "text": "කොකාලික වර්ගය පළමු වැනියි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 20,
                        "text": "**උද්දානය: **",
                        "type": "unindented"
                    },
                    {
                        "format": 20,
                        "text": "ආයාචන, ගාරව, බ්‍රහ්මදෙව, බකබ්‍රහ්ම, අපරාදිට්ඨි, පමාද, කොකාලික, තිස්සක, තුදුබ්‍රහ්ම, අනෙක් කොකාලික සූත්‍ර යයි දශයෙකි.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 276,
            "pali": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "2. පරිනිබ්බාණවග්ගො",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "6. 2. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සනඞ්කුමාරසුත්තං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "182. එවං මෙ සුතං: එකං සමයං භගවා රාජගහෙ විහරති සප්පිනීතීරෙ. අථ ඛො බ්රහ්මා සනඞ්කුමාරො අභික්කන්තාය රත්තියා අභික්කන්තවණ්ණො කෙවලකප්පං සප්පිනීතීරං ඔභාසෙත්වා යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතො ඛො බ්රහ්මා සනඞ්කුමාරො භගවතො සන්තිකෙ ඉමං ගාථං අභාසි:"
                    },
                    {
                        "type": "gatha",
                        "text": "ඛත්තියො සෙට්ඨො ජනෙතස්මිං යෙ ගොත්තපටිසාරිනො,\nවිජ්ජාචරණසම්පන්නො සො සෙට්ඨො දෙවමානුසෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "ඉදමවොච බ්රහ්මා සනඞ්කුමාරො, සමනුඤ්ඤො සත්ථා අහොසි. අථ ඛො බ්රහ්මා සනඞ්කුමාරො සමනුඤ්ඤො මෙ සත්ථාති භගවන්තං අභිවාදෙත්වා පදක්ඛිණං කත්වා තත්ථෙවන්තරධායීති."
                    },
                    {
                        "type": "centered",
                        "text": "6. 2. 2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දෙවදත්තසුත්තං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "183. එවං මෙ සුතං: එකං සමයං භගවා රාජගහෙ විහරති ගිජ්ඣකූටෙ පබ්බතෙ අචිරපක්කන්තෙ දෙවදත්තෙ. අථ ඛො බ්රහ්මා සහම්පති අභික්කන්තාය රත්තියා අභික්කන්තවණ්ණො කෙවලකප්පං ගිජ්ඣකූටං පබ්බතං ඔභාසෙත්වා යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතො ඛො බ්රහ්මා සහම්පති දෙවදත්තං ආරබ්භ භගවතො සන්තිකෙ ඉමං ගාථං අභාසි:"
                    },
                    {
                        "type": "gatha",
                        "text": "ඵලං වෙ කදලිං හන්ති ඵලං වෙළුං ඵලං නළං{1}\nසක්කාරො කාපුරිසං හන්ති ගබ්භො අස්සතරිං යථාති."
                    },
                    {
                        "type": "centered",
                        "text": "6. 2. 3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අන්ධකවින්දසුත්තං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "184. එකං සමයං භගවා මාගධෙසු{2} විහරති අන්ධකවින්දෙ. තෙන ඛො පන සමයෙන භගවා රත්තන්ධකාරතිමිසායං අජ්ඣොකාසෙ{3} නිසින්නො හොති. දෙවො ච එකමෙකං ඵුසායති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො බ්රහ්මා සහම්පති අභික්කන්තාය රත්තියා අභික්කන්තවණ්ණො කෙවලකප්පං අන්ධකවින්දං ඔභාසෙත්වා යෙන භගවා තෙනුපසඞ්කමි. උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං අට්ඨාසි. එකමන්තං ඨිතො ඛො බ්රහ්මා සහම්පති භගවතො සන්තිකෙ ඉමා ගාථායො අභාසි:"
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. නලං - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "2. මාගධෙසු - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. අබ්භොකාසෙ - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "type": "heading",
                        "text": "2. පරිනිබ්බාණ වර්ගය",
                        "level": 2
                    },
                    {
                        "type": "centered",
                        "text": "6. 2. 1.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "සනඞ්‌කුමාර සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "182. මා විසින් මෙසේ අසන ලදී: එක්කලෙක භාග්‍යවතුන් වහන්සේ රජගහනුවර සමීපයෙහි සප්පිනී ගංතෙර වැඩවසන සේක. එකල්හි මනා ඡවිවර්ණ ඇති සනඞ්කුමාර බ්‍රහ්ම තෙමේ රෑ පෙරයම ඉක්ම ගිය කල්හි මුළු සප්පිනී ගංතෙර බබුලුවා භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක සිටියේ ය. එකත්පසෙක සිටි සනඞ්කුමාර බ්‍රහ්ම තෙමේ භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ ගාථාව කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ප්‍රජායෙහි යම් කෙනෙක් වංශය සලකන්නාහු ද (ඔවුන් අතුරෙන්) ක්ෂත්‍රිය තෙමේ ශ්‍රේෂ්ඨ යි. ත්‍රිවිද්‍යාවෙන් හා පසළොස්චරණ ධර්මයන් ගෙන් යුක්ත වූ ඒ ක්ෂීණාස්‍රව බ්‍රහ්මණ තෙමේ දෙවි මිනිසුන් අතරෙහි ශ්‍රේෂ්ඨ වේ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "සනඞ්කුමාර බ්‍රහ්ම තෙමේ මෙය කී ය: ශාස්තෲන් වහන්සේ අනුමෝදන් වූ සේක. ඉක්බිති සනඞ්කුමාර බ්‍රහ්ම තෙමේ ශාස්තෲන් වහන්සේ මාගේ වචනය අනුමෝදන් වූ සේකැ යි භාග්‍යවතුන් වහන්සේ වැඳ පැදකුණු කොට එහි ම අතුරුදන් විය.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "6.2.2.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "දේවදත්ත සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "183. මා විසින් මෙසේ අසන ලදී: එක්කලෙක භාග්‍යවතුන් වහන්සේ දෙව්දත් සස්නෙන් බැහැර ගිය නො බොහෝ කලැ ම රජගහනුවර සමීපයෙහි ගිජුකුළුපව්වෙහි වැඩවසන සේක. එකල්හි මනා ඡවිවර්ණ ඇති සහම්පති බ්‍රහ්ම තෙමේ රෑ පෙරයම ඉක්ම ගිය කල්හි මුළු ගිජුකුළුපව්ව බබුලුවා භාග්‍යවතුන්වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක සිටියේ ය. එකත්පසෙක සිටි සහම්පති බ්‍රහ්ම තෙමේ දෙව්පුතු ඇරබ භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ ගාථාව කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "යම්සේ ඵලය තෙමේ ඒකාන්තයෙන් කෙසෙල්ගස නසා ද, ඵලය තෙමේ මහහුණ නසා ද, ඵලය රනහුණ නසා ද, දරුගැබ (ගද්‍රභයාට දාව උපන් නහඹු) වෙළඹ නසා ද, එසෙයින් ම සත්කාරය තෙමේ නින්දිත පුරුෂයා නසයි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "6.2.3.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අන්ධකවින්ද සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "184. එක්කලෙක භාග්‍යවතුන් වහන්සේ මගදරට අන්ධකවින්ද ගම්හි වැඩවසන සේක. එකල්හි  භාග්‍යවතුන් වහන්සේ රෑ බොල් අඳුරෙහි අබවස වැඩ හුන් සේක. මෙඝය ද එකී එකි පොද හෙළයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "එකල්හි මනා ඡවිවර්ණ ඇති සහම්පති බ්‍රහ්ම තෙමේ රෑ පෙරයම ඉක්ම ගිය කල්හි මුළු අන්ධකවින්දය බබුලුවා භාග්‍යවතුන් වහන්සේ වෙත එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ වැඳ එකත්පසෙක සිටියේ ය. එකත්පසෙක සිටි සහම්පති බ්‍රහ්ම තෙමේ භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ ගාථා කී ය.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 278,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "සෙවෙථ පන්තානි සෙනාසනානි{1} චරෙය්ය සඤ්ඤොජනවිප්පමොක්ඛා,\nසචෙ රතිං නාධිගච්ඡෙය්ය තත්ථ සඞ්ඝෙ වසෙ රක්ඛිතත්තො සතීමා{2}."
                    },
                    {
                        "type": "gatha",
                        "text": "කුලාකුලං පිණ්ඩිකාය චරන්තො ඉන්ද්රියගුත්තො නිපකො සතීමා{2},\nසෙවෙථ පන්තානි සෙනාසනානි භයා පමුත්තො අභයෙ විමුත්තො."
                    },
                    {
                        "type": "gatha",
                        "text": "යත්ථ භෙරවා සිරිංසපා{4} විජ්ජු සඤ්චරති ථනෙති{5} දෙවො,\nඅන්ධකාරතිමිසාය රත්තියා නිසීදි තත්ථ භික්ඛු විගතලොමහංසො."
                    },
                    {
                        "type": "gatha",
                        "text": "ඉදං හි ජාතු මෙ දිට්ඨං නයිදං ඉතිහීතිහං,\nඑකස්මිං බ්රහ්මචරියස්මිං සහස්සං මච්චුහායිනං.\n"
                    },
                    {
                        "type": "gatha",
                        "text": "භිය්යො{6} පඤ්චසතා සෙඛා දසා ච දසධා දස,\nසබ්බෙ සොතසමාපන්නා අතිරච්ඡානගාමිනො.\n\nඅථායං ඉතරා පජා පුඤ්ඤභාගාති මෙ මනො,\nසඞ්ඛාතුං නොපි සක්කොමි මුසාවාදස්ස ඔත්තපෙති{7}"
                    },
                    {
                        "type": "centered",
                        "text": "6. 2. 4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අරුණවතීසුත්තං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "185. එවං මෙ සුතං: එකං සමයං භගවා සාවත්ථියං විහරති ජෙතවනෙ අනාථපිණ්ඩිකස්ස ආරාමෙ. තත්ර ඛො භගවා භික්ඛූ ආමන්තෙසි: භික්ඛවොති. භදන්තෙති තෙ භික්ඛූ භගවතො පච්චස්සොසුං. භගවා එතදවොච:"
                    },
                    {
                        "type": "paragraph",
                        "text": "භූතපුබ්බං භික්ඛවෙ රාජා අහොසි අරුණවා නාම. රඤ්ඤො ඛො පන භික්ඛවෙ අරුණවතො අරුණවතී නාම රාජධානී අහොසි. අරුණවතිං{8} ඛො පන භික්ඛවෙ රාජධානිං{9} සිඛී භගවා අරහං සම්මාසම්බුද්ධො උපනිස්සාය විහාසි. සිඛිස්ස ඛො පන භික්ඛවෙ භගවතො අරහතො සම්මාසම්බුද්ධස්ස අභිභූසම්භවං නාම සාවකයුගං අහොසි. අග්ගං භද්දයුගං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භික්ඛවෙ සිඛී භගවා අරහං සම්මාසම්බුද්ධො අභිභුං භික්ඛුං ආමන්තෙසි: ආයාම බ්රාහ්මණ යෙන අඤ්ඤතරො බ්රහ්මලොකො තෙනුපසඞ්කමිස්සාම, යාව භත්තස්ස කාලො භවිස්සති. එවං භන්තෙති ඛො භික්ඛවෙ අභිභූ භික්ඛු සිඛිස්ස භගවතො අරහතො සම්මාසම්බුද්ධස්ස පච්චස්සොසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භික්ඛවෙ සිඛී භගවා අරහං සම්මාසම්බුද්ධො අභිභූ ච භික්ඛු සෙය්යථාපි නාම බලවා පුරිසො සම්මිඤ්ජිතං වා බාහං පසාරෙය්ය පසාරිතං වා බාහං සම්මිඤ්ජෙය්ය එවමෙව අරුණවතියා රාජධානියා අන්තරහිතා තස්මිං බ්රහ්මලොකෙ පාතුරහෙසුං."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සයනාසනානි - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. සතිමා - සීමු 1. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "4. සරීසපා - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "5. ථනයති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "6. භීයො - කත්ථචි."
                    },
                    {
                        "type": "footnote",
                        "text": "7. ඔත්තපන්ති - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "8. අරුණවතියං - PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "9. රාජධානියං - PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "ගැඹුරු වල සෙනසුන් සෙවුනේ ය. සංයෝජනයන් ගෙන් මිදීම පිණිස හැසිරෙන්නේ ය. එහි ඉදින් ඇල්මක් නොලබන්නේ නම් රක්නා ලද සිත් ඇතිව (සබ්‍රම්සරුන් නො ගටා) සිහි ඇති ව සඞ්ඝයා අතර වෙසෙන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ගෝපනය කරණ ලද ඉඳුරන් ඇති ව තීරණප්‍රඥා ඇති ව සිහි ඇති ව කුලයෙන් කුලයට පිඬු පිණිස හැසිරෙමින් ප්‍රාන්ත වූ වනසෙනසුන් සෙවුනේ ය. සසරබියෙන් මිදුනේ නිවණෙහි අධිමුත්ක ව (වසන්නේ ය.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "යම් තැනෙක බිහිසුනු අරමුණුත් සර්පයෝත් වෙද් ද. විදුලිය ලෙළෙයි ද, මෙඝය ගිගිර කෙරේ ද, මහණ තෙමේ එහි රෑ ගණඳුරෙහි පහවූ ලොමුදහ ගැණුම් ඇතිව හුන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මෙය වූ කලි මා විසින් එකාන්තයෙන් දක්නා ලද්දේ ය. මම මෙය මෙසේ මෙසේ යයි (තර්කාදි වශයෙන්) නො කියමි. එක් දහම් දෙසුමෙක මරු පරයා සිටි රහතුන් දහසෙක් ද (වෙයි.)",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බොහෝ සේ ශෛක්ෂයෝ පන්සියයෙක් ද දශයෙක් ද සියයෙක් ද (වෙති) සියල්ලෝ මාර්ගශ්‍රොතසට පැමිණියාහු අවිනිපාත ස්වභාව ඇත්තෝ වෙති. යලි මේ අන්‍යප්‍රජා තොමෝ පිණට හිමි යයි මාගේ අදහසයි. (ඔවුන්) ගණින්නට නො හැක්කෙමි. බොරුවට (මා අසුවෙතැයි) බමි.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "6.2.4.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "අරුණවතී සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "185. මා විසින් මෙසේ අසන ලදී: එක්කලෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර සමීපයෙහි ජේතවන නම් වූ අනේපිඬුසිටුහුගේ අරම්හි වැඩවසන සේක. එහි දී භාග්‍යවතුන් වහන්සේ භික්ෂූන් ඇමතූ සේක. ඒ භික්ෂූහු පින්වතුන් වහන්සැයි භාග්‍යවතුන් වහන්සේට පිළිවදන් ඇස්වූහ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "පෙරවූවක් කියමි. මහණෙනි, අරුණවත් නම් රජෙක් විය. මහණෙනි, අරුණවත් රජහට අරුණාවතී නම් රාජධානියෙක් විය. මහණෙනි, භාග්‍යවත් අර්හත් සිඛී සම්මාසම්බුදුරජානන් වහන්සේ අරුණාවතී රාජධානිය ඇසුරු කොට වැඩවිසූ සේක. මහණෙනි, භාග්‍යවත් අර්හත් සිඛී සම්මාසම්බුදුරජානන් වහන්සේට අභිභූසම්භව නම් අග්‍ර වූ භද්‍රයුගලය වූ ශ්‍රාවක යුගලයෙක් වි ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති භාග්‍යවත් අර්හත් සිඛී සම්මාසම්බුදුරජානන් වහන්සේ අභිගු මහණ ඇමතූ සේක. “බමුණ, යමු බත් වේලාව යම්තාක් වේ ද, එක්තරා බඹලොවකට එළඹෙන්නෙමු”යි. මහණෙනි, අභිගු මහණ තෙමේ වහන්ස, එසේ යයි භාග්‍යවත් අර්හත් සිඛී සම්මාසම්බුදුරජානන් වහන්සේට පිළිවදන් ඇස්වී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, ඉක්බිති භාග්‍යවත් අර්හත් සිඛී සම්මාසම්බුදුරජානන් වහන්සේ ද අභිගු මහණ තෙමේ ද යම්සේ බලවත් පුරුෂයෙක් හැකුළුෑඅතක් දිගු කරන්නේ හෝ වේ ද, දිගු කළ අතක් හකුළුවන්නේ හෝ වේ ද, එසෙයින් ම අරුණවතී රාජධානියෙන් අතුරුදන් වූවාහු ඒ බඹලොව පහළ වූහ.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 280,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භික්ඛවෙ සිඛී භගවා අරහං සම්මාසම්බුද්ධො අභිභුං භික්ඛුං ආමන්තෙසි: පටිභාතු තං බ්රාහ්මණ බ්රහ්මුනො ච බ්රහ්මපරිසාය ච බ්රහ්මපාරිසජ්ජානඤ්ච ධම්මී කථාති. එවං භන්තෙති ඛො භික්ඛවෙ අභිභූ භික්ඛු සිඛීස්ස භගවතො අරහතො සම්මාසම්බුද්ධස්ස පටිස්සුත්වා බ්රහ්මානඤ්ච බ්රහ්මපරිසඤ්ච බ්රහ්මපාරිසජ්ජෙ ච ධම්මියා කථාය සංදස්සෙසි සමාදපෙසි සමුත්තෙජෙසි සම්පහංසෙසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ර සුදං භික්ඛවෙ බ්රහ්මා ච බ්රහ්මපරිසා ච බ්රහ්මපාරිසජ්ජා ච උජ්ඣායන්ති ඛීයන්ති{1} විපාචෙන්ති: අච්ඡරියං වත භො අබ්භුතං වත භො, කථං හි නාම සත්ථරි සම්මුඛීභූතෙ සාවකො ධම්මං දෙසෙස්සතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භික්ඛවෙ සිඛී භගවා අරහං සම්මාසම්බුද්ධො අභිභුං භික්ඛුං ආමන්තෙසි: උජ්ඣායන්ති ඛො තෙ බ්රාහ්මණ බ්රහ්මා ච බ්රහ්මපරිසා ච බ්රහ්මපාරිසජ්ජා ච. අච්ඡරියං වත භො අබ්භුතං වත භො, කථං හි නාම සත්ථරි සම්මුඛීභූතෙ සාවකො ධම්මං දෙසෙස්සතීති. තෙන හි ත්වං බ්රාහ්මණ භිය්යොසොමත්තාය බ්රහ්මානඤ්ච බ්රහ්මපරිසඤ්ච බ්රහ්මපාරිසජ්ජෙ ච සංවෙජෙහීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං භන්තෙති ඛො භික්ඛවෙ අභිභූ භික්ඛු සිඛිස්ස භගවතො අරහතො සම්මාසම්බුද්ධස්ස පටිස්සුත්වා දිස්සමානෙනපි කායෙන ධම්මං දෙසෙසි. අදිස්සමානෙන පි කායෙන ධම්මං දෙසෙසි. දිස්සමානෙනපි හෙට්ඨිමෙන උපඩ්ඪකායෙන අදිස්සමානෙනපි උපරිමෙන උපඩ්ඪකායෙන ධම්මං දෙසෙසි. දිස්සමානෙනපි උපරිමෙන උපඩ්ඪකායෙන අදිස්සමානෙන පි{2} හෙට්ඨිමෙන උපඩ්ඪකායෙන ධම්මං දෙසෙසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "තත්ර සුදං භික්ඛවෙ බ්රහ්මා ච බ්රහ්මපරිසා ච බ්රහ්මපාරිසජ්ජා ච අච්ඡරියබ්භුතචිත්තජාතා අහෙසුං: අච්ඡරියං වත භො අබ්භුතං වත භො, සමණස්ස මහිද්ධිකතා මහානුභාවතාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භික්ඛවෙ අභිභූ භික්ඛු සිඛිං භගවන්තං අරහන්තං සම්මාසම්බුද්ධං එතදවොච: අභිජානාමි ඛ්වාහං භන්තෙ භික්ඛුසඞ්ඝස්ස මජ්ඣෙ එවරූපං වාචං භාසිතා, පහොමි ඛ්වාහං ආවුසො බ්රහ්මලොකෙ ඨිතො සහස්සීලොකධාතුං{3} සරෙන විඤ්ඤාපෙතුන්ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එතස්ස බ්රාහ්මණ කාලො එතස්ස බ්රාහ්මණ කාලො යං ත්වං බ්රාහ්මණ බ්රහ්මලොකෙ ඨිතො සහස්සීලොකධාතුං සරෙන විඤ්ඤාපෙය්යාසි."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං භන්තෙති ඛො භික්ඛවෙ අභිභූ භික්ඛු සිඛීස්ස භගවතො අරහතො සම්මාසම්බුද්ධස්ස පටිස්සුත්වා බ්රහ්මලොකෙ ඨිතො ඉමා ගාථායො අභාසි:"
                    },
                    {
                        "type": "gatha",
                        "text": "ආරභථ{4} නික්ඛමථ{5} යුඤ්ජථ බුද්ධසාසනෙ,\nධුනාථ මච්චුනො සෙනං නළාගාරංව කුඤ්ජරො."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. ඛිය්යන්ති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අදිස්සමානෙන - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "3. සහස්සි - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "4. ආරබ්භථ - මඡසං. ස්යා. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "5. නික්කමථ - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "මහණෙනි, ඉක්බිති භාග්‍යවත් අර්හත් සිඛී සම්මාසම්බුදුරජානන් වහන්සේ අභිගු මහණ ඇමතූ සේක: බමුණ, බඹහට ද බඹපිරිසට ද අතැවැසි බඹුන්ට ද දැහැමි කථාවෙක් තොපට වැටහේවා”යි. මහණෙනි, අභිගු මහණ තෙමේ වහන්ස එසේ යයි භාග්‍යවත් අර්හත් සිඛි සම්මාසම්බුදුරජානන් වහන්සේට පිළිවදන් අස්වා බඹු ද බඹ පිරිස ද අතැවැසි බඹුන් ද දැහැමි කථායෙන් කරුණු දැක්වී ය. සමාදන් කරවී ය. උත්සාහවත් කරවී ය. සතුටු කරවී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, එහි දී බඹු ද බඹපිරිස ද අතැවැසි බඹහු ද “පින්වත්නි, ඒකාන්තයෙන් ආශ්චර්යයෙකි! පින්වත්නි, ඒකාන්තයෙන් අද්භූතයෙකී. ශාස්තෲන් වහන්සේ ඉදිරියෙහි ඇති කල්හි කෙසේ නම් සව්වෙක් දහම් දෙසා දැ යි අවමන් කෙරෙත්, ගරහත්, දොස් පහළ කෙරෙත්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, ඉක්බිති භාග්‍යවත් අර්හත් සිඛී සම්මාසම්බුදුරජානන් වහන්සේ අභිගු මහණ ඇමතූ සේක. බමුණ, බඹු ද  බඹපිරිස ද අතැවැසි බඹහු ද “පින්වත්නි, ඒකාන්තයෙන් ආශ්චර්යයෙකි. පින්වත්නි, ඒකාන්තයෙන් අද්භූතයෙකි. ශාස්තෲන් වහන්සේ ඉදිරියෙහි ඇති කල්හි කෙසේ නම් සව්වෙක් දහම් දෙසා දැ”යි තොපට අවමන් කෙරෙත්. බමුණ, එසේ වී නම් තෙපි බඹු ද බඹපිරිස ද අතැවැසි බඹුන් ද බොහෝ සෙයින් සංවෙගයට පමුණුවව්”යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, අභිගු මහණ තෙමේ වහන්ස, එසේ යයි භාග්‍යවත් අර්හත් සම්මාසම්බුදුරජානන් වහන්සේට පිළිවදන් අස්වා පෙණෙන කයින් යුක්තව ද දහම් දෙසී ය. නොපෙණෙන කයින් යුක්ත ව ද දහම් දෙසී ය. පෙණෙන යටඅඩකයින් යුක්තව ද නොපෙණන උඩ අඩකයින් යුක්තව ද දහම් දෙසී ය. පෙණෙන උඩ කයින් යුක්තව ද නොපෙණන යට අඩකයින් යුක්තව ද දහම් දෙසී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, එහි දී බඹු ද බඹපිරිස ද අතැවැසි බඹුහු ද මහණහුගේ මහත් ඍද්ධි ඇතිබව මහත් අනුභාව ඇති බව පින්වත්නි, ඒකාන්තයෙන් ආශ්චර්යයෙකි. පින්වත්නි, ඒකාන්තයෙන් අද්භූතයෙකි”යි ආශ්චර්යාද්භූත සිත් ඇත්තෝ වූහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, ඉක්බිති අභිගු මහණ තෙමේ භාග්‍යවත් අර්හත් සම්මාසම්බුදුරජාණන් වහන්සේට වහන්ස, මම බික්සඟන මැද ඇවැත්නි, මම බඹලොව සිටියෙම් සහශ්‍රීලෝකධාතුව සරයෙන් හඟවන්නට (කටහඬ පතුර වන්නට සමත්මි”යි මෙබඳු වචනයක් කීයෙම් දනිම් ම යයි මෙය කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "බමුණ, තෙපි යම් හෙයකින් බඹලොව සිටියාහු සහශ්‍රීලොකධාතුව සරයෙන් හඟවන්නහු නම් බමුණ, මෙයට කාලය යි. බමුණ, මෙයට කාලය යි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, අභිගු මහණ තෙමේ වහන්ස, එසේ යයි භාග්‍යවත් අර්හත් සම්මාසම්බුදුරජානන් වහන්සේට පිළිවදන් අස්වා බඹලොව සිටියේ මේ ගාථා කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආරම්භවීර්යය කරවු, නිෂ්ක්‍රමණවිර්යය කරවු, බුදුසසුනෙහි යෙදෙවු, ඇතෙක් බටදඬුයෙන් කළ ගෙයක් වනසන්නාක් මෙන් මරසෙනඟ නසවු.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 282,
            "pali": {
                "entries": [
                    {
                        "type": "gatha",
                        "text": "යො ඉමස්මිං ධම්මවිනයෙ අප්පමත්තො විහෙස්සති{1}\nපහාය ජාතිසංසාරං දුක්ඛස්සන්තං කරිස්සතීති."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භික්ඛවෙ සිඛී ච භගවා අරහං සම්මාසම්බුද්ධො අභිභූ ච භික්ඛු බ්රහ්මානඤ්ච බ්රහ්මපරිසඤ්ච බ්රහ්මපාරිසජ්ජෙ ච සංවෙජෙත්වා සෙය්යථාපි නාම බලවා පුරිසො සම්මිඤ්ජිතං වා බාහං පසාරෙය්ය පසාරිතං වා බාහං සම්මිඤ්ජෙය්ය එවමෙව තස්මිං බ්රහ්මලොකෙ අන්තරහිතා අරුණවතියා රාජධානියා පාතුරහෙසුං."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භික්ඛවෙ සිඛී භගවා අරහං සම්මාසම්බුද්ධො භික්ඛූ ආමන්තෙසි: අස්සුත්ථ නො තුම්හෙ භික්ඛවෙ අභිභුස්ස භික්ඛුනො බ්රහ්මලොකෙ ඨිතස්ස ගාථායො භාසමානස්සාති. අස්සුම්හ ඛො මයං භන්තෙ අභිභුස්ස භික්ඛුනො බ්රහ්මලොකෙ ඨිතස්ස ගාථායො භාසමානස්සාති. යථා කථං පන තුම්හෙ භික්ඛවෙ අස්සුත්ථ අභිභුස්ස භික්ඛුනො බ්රහ්මලොකෙ ඨිතස්ස ගාථායො භාසමානස්සාති. එවං ඛො මයං භන්තෙ අස්සුම්හ{2} අභිභුස්ස භික්ඛුනො බ්රහ්මලොකෙ ඨිතස්ස ගාථායො භාසමානස්ස:"
                    },
                    {
                        "type": "gatha",
                        "text": "“ආරභථ නික්කමථ යුඤ්ජථ බුද්ධසාසනෙ,\nධුනාථ මච්චුනො සෙනං නළාගාරංව කුඤ්ජරො."
                    },
                    {
                        "type": "gatha",
                        "text": "යො ඉමස්මිං ධම්මවිනයෙ අප්පමත්තො විහෙස්සති,\nපහාය ජාතිසංසාරං දුක්ඛස්සන්තං කරිස්සතී”ති."
                    },
                    {
                        "type": "paragraph",
                        "text": "එවං ඛො මයං භන්තෙ අස්සුම්හ{2} අභිභුස්ස භික්ඛුනො, බ්රහ්මලොකෙ ඨිතස්ස ගාථායො භාසමානස්සාති."
                    },
                    {
                        "type": "paragraph",
                        "text": "සාධු සාධු භික්ඛවෙ. සාධු ඛො තුම්හෙ භික්ඛවෙ අස්සුත්ථ අභිභුස්ස භික්ඛුනො බ්රහ්මලොකෙ ඨිතස්ස ගාථායො භාසමානස්සාති. ඉදමවොච භගවා. අත්තමනා තෙ භික්ඛූ භගවතො භාසිතං අභිනන්දුන්ති."
                    },
                    {
                        "type": "centered",
                        "text": "6. 2. 5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරිනිබ්බාණසුත්තං.",
                        "level": 1
                    },
                    {
                        "type": "paragraph",
                        "text": "186. එවං මෙ සුතං: එකං සමයං භගවා කුසිනාරායං විහරති උපවත්තනෙ මල්ලානං සාලවනෙ අන්තරෙන යමකසාලානං පරිනිබ්බාණසමයෙ. අථ ඛො භගවා භික්ඛූ ආමන්තෙසි: හන්ද දානි භික්ඛවෙ ආමන්තයාමි වො වයධම්මා සඞ්ඛාරා අප්පමාදෙන සම්පාදෙථාති. අයං තථාගතස්ස පච්ඡිමා වාචා."
                    },
                    {
                        "type": "paragraph",
                        "text": "අථ ඛො භගවා පඨමජ්ඣානං{4} සමාපජ්ජි. පඨමජ්ඣානා වුට්ඨහිත්වා දුතිය{5}ජ්ඣානං සමාපජ්ජි. දුතියජ්ඣානා වුට්ඨහිත්වා තතිය{6}ජ්ඣානං සමාපජ්ජි. තතියජ්ඣානා වුට්ඨහිත්වා චතුත්ථ{7}ජ්ඣානං සමාපජ්ජි."
                    },
                    {
                        "type": "paragraph",
                        "text": "චතුත්ථජ්ඣානා වුට්ඨහිත්වා ආකාසානඤ්චායතනං සමාපජ්ජි. ආකාසානඤ්චායතනා වුට්ඨහිත්වා විඤ්ඤාණඤ්චායතනං සමාපජ්ජි. විඤ්ඤාණඤ්චායතනා වුට්ඨහිත්වා ආකිඤ්චඤ්ඤායතනං සමාපජ්ජි. ආකිඤ්චඤ්ඤායතනා වුට්ඨහිත්වා නෙවසඤ්ඤානාසඤ්ඤායතනං සමාපජ්ජි. නෙවසඤ්ඤානාසඤ්ඤායතනා වුට්ඨහිත්වා සඤ්ඤාවෙදයිතනිරොධං සමාපජ්ජි."
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. විහස්සති - මඡසං."
                    },
                    {
                        "type": "footnote",
                        "text": "2. අස්සුම්හා - ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "4. පඨමං ඣානං - මඡසං. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "5. දුතියං - මඡසං. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "6. තතියං - මඡසං. PTS."
                    },
                    {
                        "type": "footnote",
                        "text": "7. චතුත්ථං - මඡසං. PTS."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "යමෙක් මේ සස්නෙහි අප්‍රමත්ත ව වෙසෙන්නේ ද (හෙ තෙමේ) ජාතිය හා සංසාරය දුරු කොට දුක් කෙළවර කරන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, ඉක්බිති භාග්‍යවත් අර්හත් සිඛී සම්මාසම්බුදුරජානන් වහන්සේ ද, අභිගු මහණ තෙමේ ද බඹුත් බඹපිරිසත් අතැවැසිබඹුනුත් සංවෙගයට පමුණුවා යම්සේ බලවත් පුරුෂයෙක් හැකුළුෑ අතක් දිගු කරන්නේ හෝ වේ ද, දිගු කළ අතක් හකුළුවන්නේ හෝ වේ ද, එසෙයින් ම ඒ බඹලොව අතුරුදන් වූවාහු අරුණාවතී රාජධානියෙහි පහළ වූහ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, ඉක්බිති භාග්‍යවත් අර්හත් සිඛී සම්මාසම්බුදුරජානන් වහන්සේ භික්ෂූන් ඇමතූ සේක. මහණෙනි, තෙපි බඹලොව සිට අභිගු මහණ ගාථා කියද්දී නොඇසූහු ද? වහන්ස, අපි අභිගු මහණ බඹලොව සිට ගාථා කියද්දී අසූම්හ. මහණෙනි, තෙපි අභිගු මහණ බඹලොව සිට ගාථා කියද්දී ඒ කෙසේ නම් ඇසූහු ද? වහන්ස, අපි අභිගු මහණ බඹලොව සිට ගාථා කියද්දී මෙසේ ඇසූම්හ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ආරම්භවීර්යය කරව්, නිෂ්ක්‍රමණවිර්යය කරව්, බුදුසසුන්හි යෙදෙව්. ඇතකු බටදඬුගෙයක් වනසන්නාක් මෙන් මරසෙනඟ නසව්.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "යමෙක් මෙසස්නෙහි අප්‍රමත්තව වෙසෙන්නේ ද (හෙ තෙමේ) ජාතිය හා සංසාරය දුරු කොට දුක් කෙළවර කරන්නේ ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "වහන්ස, අපි අභිගු මහණ බඹලොව සිට ගාථා කියද්දී මෙසේ අසූම්හ.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "මහණෙනි, මැනවි, මැනවි. මහණෙනි, තෙපි අභිගු මහණ බඹලොව සිට ගාථා කියද්දී ඇසූහු ය. මැනවි. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සතුටුසිත් ඇති ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ දෙශනාව පිළිගත්හ.",
                        "type": "paragraph"
                    },
                    {
                        "type": "centered",
                        "text": "6.2.5.",
                        "level": 1
                    },
                    {
                        "type": "heading",
                        "text": "පරිනිබ්බාණ සූත්‍රය",
                        "level": 1
                    },
                    {
                        "format": 13,
                        "text": "186. මා විසින් මෙසේ අසන ලදී. එක්කලෙක භාග්‍යවතුන් වහන්සේ පිරිනිවන් සමයෙහි කුසිනාරානුවර උපවත්තන නම් වූ මල්ලරජුන්ගේ සල්උයනෙහි සල්රුක්යුවල අතරෙහි වැඩවසන සේක. එකල්හි භාග්‍යවතුන් වහන්සේ භික්ෂූන් ඇමතූ සේක: මහණෙනි, දැන් වනාහි තොප අමතමි. සංස්කාරයෝ නැසෙන සුල්ලහ. අප්‍රමාදයෙන් සම්පාදනය කරව්. මෙය තථාගතයන් වහන්සේගේ අන්තිම වචනයයි.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ඉක්බිති භාග්‍යවතුන් වහන්සේ ප්‍රථමධ්‍යානයට සමවන් සේක. ප්‍රථමධ්‍යානයෙන් නැගිට ද්විතීයධ්‍යානයට සමවන් සේක. ද්විතීයධ්‍යානයෙන් නැගිට තෘතීයධ්‍යානයට සමවන් සේක. තෘතීයධ්‍යානයෙන් නැගිට චතුර්ථධ්‍යානයට සමවන් සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "චතුර්ථධ්‍යානයෙන් නැගිට අකාසානඤ්චායතනයට සමවන් සේක. අකාසානඤ්චායතනයෙන් නැගිට විඤ්ඤාණඤ්චායතනයට සමවන් සේක.විඤ්ඤාණඤ්චායතනයෙන් නැගිට ආකිඤ්චඤ්ඤායතනයට සමවන් සේක. ආකිඤ්චඤ්ඤායතනයෙන් නැගිට නේවසඤ්ඤානාසඤ්ඤායතනයට සමවන් සේක. නේවසඤ්ඤානාසඤ්ඤායතනයෙන් නැගිට සඤ්ඤාවෙදයිතනිරොධයට සමවන් සේක.",
                        "type": "paragraph"
                    }
                ],
                "footnotes": []
            }
        },
        {
            "pageNum": 284,
            "pali": {
                "entries": [
                    {
                        "type": "paragraph",
                        "text": "සඤ්ඤාවෙදයිතනිරොධා වුට්ඨහිත්වා නෙවසඤ්ඤානාසඤ්ඤායතනං සමාපජ්ජි. නෙවසඤ්ඤානාසඤ්ඤායතනා වුට්ඨහිත්වා ආකිඤ්චඤ්ඤායතනං සමාපජ්ජි. ආකිඤ්චඤ්ඤායතනා වුට්ඨහිත්වා විඤ්ඤාණඤ්චායතනං සමාපජ්ජි. විඤ්ඤාණඤ්චායතනා වුට්ඨහිත්වා ආකාසානඤ්චායතනං සමාපජ්ජි. ආකාසානඤ්චායතනා වුට්ඨහිත්වා චතුත්ථජ්ඣානං සමාපජ්ජි. චතුත්ථජ්ඣානා වුට්ඨහිත්වා තතියජ්ඣානං සමාපජ්ජි. තතියජ්ඣානා වුට්ඨහිත්වා දුතියජ්ඣානං සමාපජ්ජි. දුතියජ්ඣානා වුට්ඨහිත්වා පඨමජ්ඣානං සමාපජ්ජි."
                    },
                    {
                        "type": "paragraph",
                        "text": "පඨමජ්ඣානා වුට්ඨහිත්වා දුතියජ්ඣානං සමාපජ්ජි. දුතියජ්ඣානා වුට්ඨහිත්වා තතියජ්ඣානං සමාපජ්ජි. තතියජ්ඣානා වුට්ඨහිත්වා චතුත්ථජ්ඣානං සමාපජ්ජි. චතුත්ථජ්ඣානා වුට්ඨහිත්වා සමනන්තරා භගවා පරිනිබ්බායි."
                    },
                    {
                        "type": "paragraph",
                        "text": "පරිනිබ්බුතෙ භගවති සහ පරිනිබ්බානා බ්රහ්මා සහම්පති ඉමං{1} ගාථං අභාසි:"
                    },
                    {
                        "type": "gatha",
                        "text": "සබ්බෙව නික්ඛිපිස්සන්ති භූතා ලොකෙ සමුස්සයං,\nයථා{2} එතාදිසො සත්ථා ලොකෙ අප්පටිපුග්ගලො,\nතථාගතො බලප්පත්තො සම්බුද්ධො පරිනිබ්බුතොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පරිනිබ්බුතෙ භගවති සහ පරිනිබ්බාණා සක්කො දෙවානමින්දො ඉමං ගාථං අභාසි:"
                    },
                    {
                        "type": "gatha",
                        "text": "අනිච්චා වත සඞ්ඛාරා උප්පාදවයධම්මිනො,\nඋප්පජ්ජිත්වා නිරුජ්ඣන්ති තෙසං වූපසමො සුඛොති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පරිනිබ්බුතෙ භගවති සහ පරිනිබ්බාණා ආයස්මා ආනන්දො ඉමං ගාථං අභාසි:"
                    },
                    {
                        "type": "gatha",
                        "text": "තදාසි යං භිංසනකං තදාසි ලොමහංසනං,\nසබ්බාකාරවරූපෙතෙ සම්බුද්ධෙ පරිනිබ්බුතෙති."
                    },
                    {
                        "type": "paragraph",
                        "text": "පරිනිබ්බුතෙ භගවති සහ පරිනිබ්බාණා ආයස්මා අනුරුද්ධො ඉමා ගාථායො අභාසි:"
                    },
                    {
                        "type": "gatha",
                        "text": "නාහු අස්සාසපස්සාසො ඨිතචිත්තස්ස තාදිනො,\nඅනෙජො සන්තිමාරබ්භ චක්ඛුමා පරිනිබ්බුතො."
                    },
                    {
                        "type": "gatha",
                        "text": "අසල්ලීනෙන චිත්තෙන වෙදනං අජ්ඣවාසයි,\nපජ්ජොතස්සෙව නිබ්බාණං විමොක්ඛො චෙතසො අහූති."
                    },
                    {
                        "type": "centered",
                        "text": "පරිනිබ්බාණ වග්ගො දුතියො",
                        "level": 1
                    },
                    {
                        "type": "unindented",
                        "text": "**තත්රැද්දානං:**"
                    },
                    {
                        "type": "gatha",
                        "text": "බ්රහ්මාසනං{3} දෙවදත්තො අන්ධකවින්දො අරුණවතී,\nපරිනිබ්බාණෙන ච දෙසිතං ඉදං බ්රහ්මපඤ්චකන්ති.{4}"
                    },
                    {
                        "type": "centered",
                        "text": "බ්රහ්මසංයුත්තං සමත්තං.",
                        "level": 1
                    }
                ],
                "footnotes": [
                    {
                        "type": "footnote",
                        "text": "1. සමන න්තරං - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "2. යත්ථ - මඡසං. ස්යා."
                    },
                    {
                        "type": "footnote",
                        "text": "3. බ්රහ්මායාචනං - සීමු 2."
                    },
                    {
                        "type": "footnote",
                        "text": "4. බ්රහ්මායාචනං අගාරචඤ්ච බ්රහ්මදෙවො බකො ච බ්රහ්මා, අඤ්ඤතරො ච බ්රහ්මා කොකාලිකඤ්ච තිස්සකඤ්ච තුරූ ච, බ්රහ්මා කොකාලිකභික්ඛු සනඞ්කුමාරෙන දෙවදත්තං, අන්ධකවින්දං අරුණවතී පරිනිබ්බාණෙන පණ්ණරසාති අත්ර ඉමා ගාථායො දිසන්තෙ - මඡසං."
                    }
                ]
            },
            "sinh": {
                "entries": [
                    {
                        "format": 13,
                        "text": "සඤ්ඤාවෙදයිත නිරොධයෙන් නැගිට නෙවසඤ්ඤානාසඤ්ඤායතනයට සමවන් සේක. නෙවසඤ්ඤානාසඤ්ඤායතනයෙන් නැගිට ආකිඤ්චඤ්ඤායතනයට සමවන් සේක. ආකිඤ්චඤ්ඤායතනයෙන් නැගිට විඤ්ඤාණඤ්චායතනයට සමවන් සේක. විඤ්ඤාණඤ්චායතනයෙන් නැගිට අකාසානඤ්චායතනයට සමවන් සේක. අකාසානඤ්චායතනයෙන් නැගිට චතුර්ථධ්‍යානයට සමවන් සේක. චතුර්ථධ්‍යානයෙන් නැගිට තෘතීයධ්‍යානයට සමවන් සේක. තෘතීයධ්‍යානයෙන් නැගිට ද්විතීයධ්‍යානයට සමවන් සේක. ද්විතීයධ්‍යානයෙන් නැගිට ප්‍රථමධ්‍යානයට සමවන් සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ප්‍රථමධ්‍යානයෙන් නැගිට ද්විතීයධ්‍යානයට සමවන් සේක. ද්විතීයධ්‍යානයෙන් නැගිට තෘතීයධ්‍යානයට සමවන් සේක. තෘතීයධ්‍යානයෙන් නැගිට චතුර්ථධ්‍යානයට සමවන් සේක. චතුර්ථධ්‍යානයෙන් නැගිට ධ්‍යානයෙන් නැගිටීම සමග ම භාග්‍යවතුන් වහන්සේ පිරිනිවී සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ පිරිනිවි කල්හි පිරිනිවණ සමග ම සහම්පති බ්‍රහ්ම තෙමේ මේ ගාථාව කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "ලෝකයේ අප්‍රතිපුද්ගල වූ තථාගත වූ බලයට පැමිණියා වූ සියලු ධර්මයන් අවබොධ කළා වූ මෙබඳු වූ ශාස්තෲන් වහන්සේ (පවා) යම් සේ පිරිනිවීසේක් ද (එසෙයින්) ලොකයෙහි සියලු සත්වයෝ සිරුර බැහැර දමන්නාහු ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ පිරිනිවි කල්හි පිරිනිවණ සමග ම සක්දෙව්රජ මේ ගාථාව කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "සංස්කාරයෝ ඒකාන්තයෙන් අනිත්‍යය හ. ඉපදීම හා නැසීම ස්වභාව කොට ඇත්තාහ. ඉපද නිරුද්ධ වෙත්. ඔවුන්ගේ සංසිඳීම සුව ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ පිරිනිවි කල්හි පිරිනිවණ සමග ම ආයුෂ්මත් ආනන්ද තෙරනුවෝ මේ ගාථාව කීහ:",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "සියලු ආකාර උතුම් කරුණුවලින් සමන්විත වූ බුදුරජානන් වහන්සේ පිරිනිවී කල්හි එකෙණෙහි බිහිසුණු සිදුවීමෙක් විය. එකෙණෙහි ලොමුදහගැණුමෙක් විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "භාග්‍යවතුන් වහන්සේ පිරිනිවි කල්හි පිරිනිවණ සමග ම ආයුෂ්මත් අනුරුද්ධ තෙරණුවෝ මේ ගාථා කී ය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "සමාහිතසිත් ඇති තාදී ගුණවත් බුදුරජානන් වහන්සේගේ ආශ්වාසප්‍රශ්වාසය නො වූයේ ය. අනෙජ (තෘෂ්ණා රහිත) වූ පසැස් ඇති බුදුරජානන් වහන්සේ නිවණ ඇරබ පිරිනිවි සේක.",
                        "type": "paragraph"
                    },
                    {
                        "format": 13,
                        "text": "නොහැකුළුණු සිතින් වේදනාව ඉවසූ සේක. සිත පිළිබඳ මිදීම පහන නිවීම මෙන් විය.",
                        "type": "paragraph"
                    },
                    {
                        "format": 11,
                        "text": "පරිනිබ්බාණ වර්ගය දෙවෙනි යි.",
                        "type": "centered",
                        "level": 1
                    },
                    {
                        "format": 20,
                        "text": "**එහි උද්දානය:**",
                        "type": "unindented"
                    },
                    {
                        "format": 20,
                        "text": "සනඞ්කුමාර, දෙවදත්ත, අන්ධකවින්ද, අරුණවතී, පරිනිබ්බාණ යයි මේ බ්‍රහ්මපඤ්චකය දෙශනා කරණ ලදී.",
                        "type": "paragraph"
                    },
                    {
                        "format": 9,
                        "text": "බ්‍රහ්මසංයුක්තය නිමියේය.",
                        "type": "centered",
                        "level": 1
                    }
                ],
                "footnotes": []
            }
        }
    ]
}